{"word":"dog","summary":{"en":"“Dog” most commonly means the animal kept as a pet; it can also mean a contemptible person (informal) or a verb meaning to trouble or follow persistently.","zh":"“dog”最常指“狗（宠物）”；也可指“讨厌/卑鄙的人”（非正式且可能冒犯），或作动词表示“纠缠、持续困扰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common domestic animal (Canis familiaris) often kept as a pet, known for loyalty and companionship","zh":"狗；一种常见的家养动物（家犬），常被当作宠物，以忠诚与陪伴著称"},"examples":[{"en":"Our dog waits by the door when it hears the car.","zh":"我们的狗一听到车声就会在门口等。"},{"en":"She adopted a rescue dog from a local shelter.","zh":"她从当地收容所领养了一只被救助的狗。"}]},{"partOfSpeech":"n.","definition":{"en":"an unpleasant or contemptible person (informal; can be offensive depending on context)","zh":"卑鄙/讨厌的人（非正式用法；在某些语境下可能带侮辱性）"},"examples":[{"en":"He lied to his friends—what a dog.","zh":"他对朋友撒谎——真是个卑鄙的人。"}]},{"partOfSpeech":"vt.","definition":{"en":"to follow or bother someone closely and repeatedly","zh":"紧跟；纠缠；不断困扰"},"examples":[{"en":"Problems like these have dogged the project for months.","zh":"这类问题几个月来一直困扰着这个项目。"}]}],"synonyms":["canine","pooch (informal)","hound (sometimes)","pester (for the verb sense)","plague (for the verb sense)"],"phonetic":"/dɔɡ/","extraExplanation":["“dog”作骂人用法在英语里比较粗鲁，尤其用于指代某个人时容易冒犯；更安全的表达可以用“jerk / nasty person / terrible person”等更中性的词。","常见相关表达：“dog-eared”（书角卷起、旧旧的）、“every dog has its day”（人人都有得意的时候）、“work like a dog”（拼命工作）。"]}
{"word":"dog biscuits","summary":{"en":"treats made for dogs","zh":"狗狗零食/奖励饼干"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hard or crunchy treats made for dogs, often used as snacks or rewards (especially for training).","zh":"专门给狗吃的（通常较硬或酥脆的）零食/奖励饼干，常用于训练奖励。"},"examples":[{"en":"I keep dog biscuits in my pocket during training sessions.","zh":"训练的时候我会在口袋里放些狗狗饼干当奖励。"},{"en":"She bought grain-free dog biscuits for her senior dog.","zh":"她给年纪大的狗买了无谷配方的狗狗饼干。"},{"en":"Don’t give him too many dog biscuits, or he’ll gain weight.","zh":"别给它吃太多狗狗饼干，不然会长胖。"}]}],"synonyms":["dog treats","dog cookies","canine treats","pet treats","training treats"],"phonetic":"/dɔɡ ˈbɪskɪts/","extraExplanation":["在美式英语里，biscuit 也可以指“松软的烤饼”（类似司康但更松），但在 dog biscuits 这个固定搭配中，几乎总是指“给狗吃的硬饼/零食”。","在宠物用品语境中，dog biscuits 常与 training treats（训练零食）一起出现；前者更常见的是“较硬、可咬的饼干型”，后者可能更小更软，方便快速奖励。"],"etymology":"由 dog（狗）+ biscuit（饼干/硬饼）组合而成；biscuit 本义有“烤两次的硬饼”，后来在英语里也泛指各种饼干点心。","mnemonic":["把 biscuit 记成“饼干”，dog biscuits 就是“狗的饼干”。看到宠物店货架上写 biscuits，多半就是零食区。","联想中文常说“奖励一块小饼干”，训练狗时也是用这种“饼干式奖励”。"]}
{"word":"dog food","summary":{"en":"food for dogs; informally, something of very poor quality","zh":"狗粮；（口语）很差的东西"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food made for dogs to eat; pet food formulated for a dog’s nutrition.","zh":"狗吃的食物；为狗营养配制的宠物食品。"},"examples":[{"en":"We ran out of dog food, so I’m going to the store.","zh":"狗粮用完了，所以我要去商店买。"},{"en":"This dog food is made for puppies.","zh":"这种狗粮是给幼犬吃的。"},{"en":"He bought a big bag of dog food online.","zh":"他在网上买了一大袋狗粮。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Something considered very poor in quality.","zh":"（非正式）被认为质量很差的东西。"},"examples":[{"en":"I tried the new app, but it’s dog food—nothing works.","zh":"我试了这个新应用，但简直一塌糊涂——什么都用不了。"},{"en":"The first draft was dog food, so we rewrote it.","zh":"第一版草稿很糟，所以我们重写了。"}]}],"synonyms":["pet food","kibble","canned dog food","dog chow","slop","junk","garbage"],"phonetic":"/ˈdɔɡ fuːd/","extraExplanation":["常见相关词：dry dog food（干狗粮/狗粮颗粒）、wet dog food（湿粮/罐头）、dog treats（狗零食）。","在正式场合通常只用字面义；“很烂的东西”的用法偏口语、带情绪，注意场合。"],"etymology":"“dog food”字面意思是“狗的食物”，由 dog（狗）+ food（食物）组成。作为贬义口语用法，是从“连狗都不想吃的东西”这种夸张评价延伸出来的。","mnemonic":["把它拆开记：dog（狗）+ food（食物）= 狗粮。","联想：狗碗里放的就是 dog food（狗粮）。"]}
{"word":"dog handler","summary":{"en":"a person who works with and directs a working dog","zh":"与工作犬配合并指挥其执行任务的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who trains, controls, and works with a dog, especially a working dog (e.g., police, military, search-and-rescue, detection).","zh":"训导、控制并与狗协同工作的人员，尤指工作犬（如警犬、军犬、搜救犬、缉毒/爆炸物探测犬）的训导员。"},"examples":[{"en":"The dog handler gave the command, and the K-9 immediately began searching the luggage.","zh":"训犬员下达口令后，警犬立刻开始检查行李。"},{"en":"In the earthquake zone, each dog handler worked closely with their search-and-rescue dog.","zh":"在地震灾区，每位训导员都与自己的搜救犬密切配合。"},{"en":"The airport hired an experienced dog handler to support its security team.","zh":"机场雇用了一名经验丰富的训导员来支持安保团队。"}]}],"synonyms":["K-9 handler","canine handler","dog trainer","handler"],"phonetic":"/ˈdɔɡ ˌhændlər/","extraExplanation":["在英语语境中常见搭配有 K-9 handler（警犬训导员）。K-9 读音类似 canine（犬科），常用于警务/安保领域。","与 trainer 相比，dog handler 更强调“在任务现场指挥并与犬协同工作”，不只是训练。"],"etymology":"复合词：dog（狗）+ handler（操控/管理者）。handler 源自动词 handle（操作、处理），引申为“负责操控某物/某动物的人”，与 working dog 组合后常指“工作犬训导员”。","mnemonic":["把它拆开记：dog（狗）+ handler（操作者）=“负责操控/指挥狗的人”。","联想“handle=处理/操控”，训导员就是“handle the dog（把狗指挥得听话）”。"]}
{"word":"dog packs","summary":{"en":"groups of dogs moving or living together","zh":"一起行动或生活的狗群"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"groups of dogs that travel, live, or act together, especially when they are stray or feral","zh":"狗群；（尤指流浪或野化的）成群结队的狗"},"examples":[{"en":"Dog packs sometimes roam the outskirts of towns looking for food.","zh":"狗群有时会在城镇郊外游荡寻找食物。"},{"en":"The village set up safer waste disposal to reduce dog packs near homes.","zh":"村里改进了更安全的垃圾处理，以减少住宅附近的狗群。"}]},{"partOfSpeech":"phrase","definition":{"en":"groups of dogs used for hunting, trained to track or chase animals","zh":"（用于狩猎的）猎犬群；成群训练过用于追踪或追逐猎物的狗"},"examples":[{"en":"In some traditions, dog packs were used to track wild boar.","zh":"在一些传统中，会用猎犬群来追踪野猪。"},{"en":"The guide worked with dog packs to follow the scent trail.","zh":"向导带着猎犬群沿着气味踪迹追寻。"}]}],"synonyms":["packs of dogs","group of dogs","canine pack","stray dog pack","feral dog pack"],"phonetic":"/dɔɡ pæks/","extraExplanation":["在动物行为学里，“pack”常让人想到狼群那种紧密协作、等级分明的结构；但现实中的狗群未必像狼群那样稳定，有时只是临时聚在一起觅食或行动。","在公共安全语境中，媒体或公告可能用“dog packs”指“流浪狗成群活动”，语气会更强调风险；日常更中性说法也可以用“groups of dogs”。"],"etymology":"“pack”本义是“捆、包”，后来引申为“（动物的）群”。“dog packs”就是“dog + packs（复数）”，常用于描述多只狗一起行动的群体。","mnemonic":["把“pack”联想成中文“成群/一群”：pack of dogs = 一群狗。","记忆小窍门：pack 也有“打包”的意思——很多只狗“打包在一起行动”，就是 dog packs。"]}
{"word":"dog paddle","summary":{"en":"a basic, dog-like swimming style; to swim that way","zh":"一种像狗一样划水的基础泳姿；用这种方式游泳"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple way of swimming by moving your hands and feet like a dog, usually with the head above water","zh":"（像狗一样划水的）狗刨式游泳；狗刨泳（通常头露出水面）"},"examples":[{"en":"When I was little, I could only dog paddle in the shallow end.","zh":"我小时候在浅水区只会狗刨。"},{"en":"He fell in the lake and started dog paddling toward the shore.","zh":"他掉进湖里，开始狗刨着往岸边游。"}]},{"partOfSpeech":"v.","definition":{"en":"to swim using this simple dog-like motion, often not very fast or elegant","zh":"用狗刨式游泳；像狗一样划水游（通常不快、不优雅）"},"examples":[{"en":"I dog paddled for a few seconds to stay afloat.","zh":"我狗刨了几秒钟让自己浮在水面上。"},{"en":"She dog paddled across the pool because she wasn’t comfortable with freestyle yet.","zh":"她还不太会自由泳，所以用狗刨游过泳池。"}]}],"synonyms":["doggy paddle","paddle","swim"],"phonetic":"/dɔɡ ˈpædəl/","extraExplanation":["“Dog paddle”多用于口语，带一点“不会正式泳姿/临时应付”的语气，但一般不算贬义。","在救生或自救语境里，它强调“先能漂浮、能前进”，即使动作不标准也有用。"],"etymology":"来自对狗在水中“前爪交替划动”的直观比喻；paddle 原指用桨划水，后来也指用手脚在水里划动。","mnemonic":["把它想成“狗 + paddle（划桨）”：像狗那样用手脚在水里划。","联想中文“狗刨”：字面意思就很像英文的形象比喻。"]}
{"word":"dog salmon","summary":{"en":"Need clarification: choose one word or both.","zh":"需要你确认：查一个还是两个都查。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Your input contains two words. Please tell me which one you want to look up, or say “both” and I’ll do them one by one.","zh":"你输入了两个单词。请告诉我你想查哪一个，或者回复“两个都要”，我会逐个解释。"},"examples":[{"en":"Do you want “dog,” “salmon,” or both?","zh":"你想查“dog”“salmon”，还是两个都要？"}]}]}
{"word":"dog sledding","summary":{"en":"traveling on snow by sled pulled by dogs","zh":"由狗拉雪橇在雪地或冰面上行进的活动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a winter activity and sport in which a team of dogs pulls a sled across snow or ice","zh":"一种冬季活动/运动：由一队狗拉着雪橇在雪地或冰面上前进"},"examples":[{"en":"We went dog sledding in Alaska during winter break.","zh":"寒假我们去阿拉斯加体验了狗拉雪橇。"},{"en":"Dog sledding can be slow and peaceful or fast and exciting.","zh":"狗拉雪橇既可以很慢很安静，也可以很快很刺激。"},{"en":"Before dog sledding, the guide taught us how to stand on the sled and use the brake.","zh":"狗拉雪橇开始前，向导教我们如何站在雪橇上以及如何刹车。"}]}],"synonyms":["dogsledding","dog mushing"],"phonetic":"/ˈdɔɡ ˌslɛdɪŋ/","extraExplanation":["在北美北部与北极圈附近地区，狗拉雪橇曾是重要的交通与运货方式。如今也常见于旅游体验和比赛（如 Iditarod）。","常见相关词：musher（赶犬雪橇的人/驾驶者）、sled（雪橇）、team（犬队）、trail（雪道/路线）。"],"etymology":"由“dog + sled + -ding”构成；“sledding”原指“坐雪橇/玩雪橇的活动”，加上“dog”明确是“狗拉雪橇”。这一用法源自北方寒冷地区的传统运输方式，后来发展成旅游项目和竞速运动。","mnemonic":["把它拆开记：dog（狗）+ sled（雪橇）+ -ding（活动）= “狗拉雪橇这项活动”。","联想画面：一群狗在雪地里拉着雪橇飞快前进——看到雪和狗就想到这个词组。"]}
{"word":"dog trainer","summary":{"en":"a person who trains dogs to behave or do specific tasks","zh":"训练狗行为或特定技能的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who teaches dogs to obey commands and behave well, often using practice, rewards, and clear rules.","zh":"训犬师；训练狗的人，教狗听指令、守规矩并养成良好行为（常用练习、奖励和明确规则）。"},"examples":[{"en":"We hired a dog trainer to help our puppy stop jumping on guests.","zh":"我们请了训犬师，帮我们的小狗改掉见客就扑人的习惯。"},{"en":"The dog trainer showed us how to use treats to reinforce good behavior.","zh":"训犬师教我们如何用零食来强化良好行为。"}]},{"partOfSpeech":"n.","definition":{"en":"A professional who prepares dogs for specific work such as service tasks, police work, detection, or competition.","zh":"（专业）训练工作犬的人，比如服务犬、警犬、搜爆/嗅探犬或比赛犬。"},"examples":[{"en":"The dog trainer specializes in service dogs for people with disabilities.","zh":"这位训犬师专门训练残障人士的服务犬。"},{"en":"A dog trainer worked with the team to prepare the dog for obedience competitions.","zh":"训犬师和团队一起训练这只狗，备战服从性比赛。"}]}],"synonyms":["canine trainer","dog instructor","obedience trainer","pet trainer"],"phonetic":"/ˈdɔɡ ˌtreɪnər/","extraExplanation":["日常语境里常说 dog trainer；更正式/偏职业的说法还有 dog behaviorist（更侧重行为问题分析）与 canine trainer（偏“犬类训练员”，更专业书面）。","在英语里 trainer 也可指“运动鞋”（英式用法较多），但 dog trainer 一般只理解为“训犬师”。"],"etymology":"由 dog（狗）+ trainer（训练者）构成的复合名词。trainer 来自 train（训练），词源可追溯到古法语相关词，原义与“引导、培养”有关。","mnemonic":["把它拆开记：dog + trainer = “训练狗的人”。","联想中文“训犬师”：训=训练，犬=dog，师=trainer（教你怎么做的人）。"]}
{"word":"dog-cabbage","summary":{"en":"Dog-cabbage is a common name for skunk cabbage, a strongly smelly plant found in wetlands.","zh":"Dog-cabbage 常指 skunk cabbage（臭菘/臭天南星），一种生长在湿地、气味很强的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant with a strong smell that grows in wet places (a common name for skunk cabbage, especially in eastern North America).","zh":"一种生长在潮湿地区、气味很浓的植物（常指北美东部的“臭菘/臭天南星”，即 skunk cabbage）。"},"examples":[{"en":"We saw dog-cabbage growing along the edge of the swamp.","zh":"我们在沼泽边缘看到狗白菜（臭菘）在生长。"},{"en":"The dog-cabbage’s odor can be noticeable in early spring.","zh":"早春时狗白菜（臭菘）的气味会很明显。"}]}],"synonyms":["skunk cabbage","swamp cabbage"],"phonetic":"/ˈdɔɡ ˌkæbɪdʒ/","extraExplanation":["“dog-”在一些英语植物名里常带有“野生的、粗劣的、不适合食用的”含义（不一定和“狗”直接有关）。因此 dog-cabbage 并不是“可以给狗吃的白菜”，而是指一种像“菜”但气味强烈、通常不作为蔬菜食用的野生植物。","在北美日常语境中更常见的说法是 skunk cabbage（“臭鼬白菜”），因为它的气味像臭鼬。"]}
{"word":"dog-cabbage-like","summary":{"en":"“Dog-cabbage-like” means “resembling dog cabbage,” usually describing a plant’s broad leaves or a strong swampy smell.","zh":"“dog-cabbage-like”表示“像狗甘蓝（常被理解为类似臭菘的野草）”，多用于形容宽大的叶子或刺鼻的湿地气味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling dog cabbage (a kind of wild plant sometimes used as a local name for skunk cabbage), especially in having broad cabbage-like leaves or a strong, unpleasant smell.","zh":"像“狗甘蓝”（一种野生植物的俗称，有时指“臭菘/臭菘菜”skunk cabbage），尤指叶片宽大像甘蓝，或带有刺鼻难闻的气味。"},"examples":[{"en":"A dog-cabbage-like plant was growing beside the stream, with huge green leaves.","zh":"溪边长着一株像狗甘蓝一样的植物，绿色大叶子特别显眼。"},{"en":"The swamp had a dog-cabbage-like smell—earthy and a bit rotten.","zh":"沼泽里有种像狗甘蓝一样的气味——土腥味里带点腐烂的味道。"}]}],"synonyms":["skunk-cabbage-like","cabbage-like","leafy","rank-smelling"],"phonetic":"/ˌdɔɡ ˈkæbɪdʒ laɪk/","extraExplanation":["“dog-cabbage-like”非常少见，多半是临时造出来的复合形容词：dog cabbage（狗甘蓝/某种野草的俗称）+ like（像……的）。写作时常用连字符，表示“在外形或气味上类似”。","不同地区对“dog cabbage”指代可能不完全一致；在北美语境里，它常被理解为与“skunk cabbage（臭菘）”相近的野生植物形象（大叶、湿地、气味重）。"]}
{"word":"dog-catcher","summary":{"en":"A dog-catcher is an animal-control worker who catches stray dogs; informally it can also be a mildly insulting label for a low-status official or job.","zh":"dog-catcher 指负责抓捕流浪狗的动物管制人员；口语中也可带贬义，指被看作地位不高的小官或低档工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person employed by a city or animal-control agency to catch stray, loose, or dangerous dogs (and sometimes other animals).","zh":"（市政或动物管制部门的）捕狗员；负责抓捕流浪、走失或具有危险性的狗（有时也包括其他动物）的人。"},"examples":[{"en":"Animal control sent a dog-catcher to pick up the stray dog near the school.","zh":"动物管制部门派了捕狗员去带走学校附近的流浪狗。"},{"en":"In old movies, the dog-catcher is often shown chasing dogs with a net.","zh":"在老电影里，捕狗员常被描绘成拿着网追狗的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often negative) Someone seen as an insignificant official or a low-status job.","zh":"（非正式，常带贬义）被认为地位不高的小官员；或被看作“低档”的工作。"},"examples":[{"en":"He complained that the manager treated him like a dog-catcher.","zh":"他抱怨经理把他当成一个不受尊重的小角色。"},{"en":"Please avoid calling someone a “dog-catcher”—it can sound insulting.","zh":"尽量别把别人称作“捕狗的”，这听起来可能很侮辱人。"}]}],"synonyms":["animal control officer","animal-control worker","dog warden","pound officer"],"phonetic":"/ˈdɔɡ ˌkætʃɚ/","extraExplanation":["“dog-catcher”是较老式的美式用法；现代更常见的正式说法是“animal control officer（动物管制员）”或“animal control（动物管制部门工作人员）”。","在一些地区，“dog catcher”还可能出现在地方选举中，指负责动物管理相关事务的公职；也因此衍生出“连捕狗员都能当选”这类带讽刺意味的表达。"]}
{"word":"dog-eared","summary":{"en":"worn with page corners bent; or having drooping ears","zh":"（书页）折角磨旧的；或（狗）垂耳的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the corners of pages bent over, usually from frequent use; worn or well-used (especially of a book, paper, or document).","zh":"（书页、纸张等）折角的；因常翻阅而显旧的、磨损的（尤指书或文件）。"},"examples":[{"en":"I found a dog-eared paperback on the bus.","zh":"我在公交车上发现了一本折角的平装书。"},{"en":"Her notes were dog-eared from weeks of revision.","zh":"她的笔记因为连续几周复习而变得折角发旧。"},{"en":"The librarian replaced the dog-eared copy with a new one.","zh":"图书管理员把那本折角磨损的书换成了新的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having ears that droop or flop down (describing a dog).","zh":"（狗）耳朵下垂的、耷拉的。"},"examples":[{"en":"A dog-eared puppy ran up to us wagging its tail.","zh":"一只垂耳小狗摇着尾巴跑向我们。"},{"en":"The dog-eared breed looks gentle and calm.","zh":"这种垂耳犬看起来温顺又安静。"}]}],"synonyms":["worn","tattered","battered","ragged","well-thumbed","creased","folded","floppy-eared"],"phonetic":"/ˈdɔɡ ɪrd/","extraExplanation":["更常见的意思是“书页折角/书本被翻旧了”。在图书馆或二手书语境里很常用。","有时也指“把书页折角当作书签”的做法，但在一些场合会被认为不爱惜书。"],"etymology":"源自“dog ear（狗耳朵）”，指像狗的下垂耳朵一样翻折下来的纸角；19世纪起常用来形容书页折角。","mnemonic":["把折角的书页想成“像狗耳朵一样耷拉下来”，= dog + ear.","联想中文“狗耳朵（折着）”→ 书页角被折下来。"]}
{"word":"dog-footed","summary":{"en":"Dog-footed: having feet like a dog; in literary use, an animal-like label that can suggest roughness or brutality.","zh":"dog-footed：字面指“狗一样的脚”；文学用法中可作动物化称呼，暗示粗野或残暴。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having feet like a dog’s; dog-footed.","zh":"长着像狗一样的脚（或脚形似狗的）。"},"examples":[{"en":"In the myth, a dog-footed creature guards the gate.","zh":"在神话里，一个狗足的生物守着大门。"},{"en":"The illustrator drew a dog-footed warrior to make him look more beast-like.","zh":"插画家画了一个狗足战士，让他看起来更像野兽。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary, figurative) Compared to a dog—often suggesting wildness, roughness, or shamelessness; sometimes used as a dramatic insult or epithet.","zh":"（文学/比喻）像狗一样——常带“粗野、无耻、凶狠”等色彩；有时用作强烈的辱称或称号。"},"examples":[{"en":"The poem calls the raiders dog-footed to show their brutality.","zh":"诗中称掠夺者为“狗足的”，用来强调他们的残暴。"},{"en":"In old epics, fierce fighters may be described with animal images like “dog-footed.”","zh":"在古老史诗中，凶猛的战士有时会用“狗足的”这类动物意象来描写。"}]}],"synonyms":["doglike","canine-footed","hound-footed","bestial"],"phonetic":"/ˈdɔɡˌfʊtɪd/","extraExplanation":["“dog-footed”较少用于日常英语，更常见于神话、奇幻或古典风格的描写。它直译是“狗一样的脚”，但在文学语境中也可能作为贬义形容（把人比作狗），用来制造强烈情绪。","古典文学里有类似的动物性绰号/称号（epithet）传统：用动物特征突出人物的凶猛或不体面。阅读时要结合语气判断是字面描写（真的长得像狗）还是修辞辱称。"]}
{"word":"dog-free","summary":{"en":"“Dog-free” means dogs are not allowed, or something has no dogs/dog-related elements.","zh":"“dog-free”表示不允许狗进入（禁犬），或不含狗/与狗无关的元素。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not allowing dogs in a place or situation.","zh":"（某地/某种场合）不允许狗进入的；无狗的（禁止携犬）。"},"examples":[{"en":"This beach is dog-free during the summer.","zh":"这个海滩在夏季是禁止带狗的。"},{"en":"The apartment building is dog-free, but cats are allowed.","zh":"这栋公寓不允许养狗，但允许养猫。"},{"en":"Please keep the picnic area dog-free for families with allergies.","zh":"请让野餐区保持无狗，以照顾对动物过敏的家庭。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without dog-related content, themes, or references (often used in media or marketing).","zh":"（内容/主题）不含狗相关元素的；与狗无关的（常用于媒体/宣传）。"},"examples":[{"en":"I’m looking for a dog-free hotel so I won’t hear barking at night.","zh":"我在找一家不接待狗的酒店，这样晚上就不会听到狗叫。"},{"en":"Can you recommend a dog-free neighborhood group chat?","zh":"你能推荐一个不聊狗相关话题的社区群吗？"}]}],"synonyms":["no-dogs","dogs not allowed","pet-free (broader)","no pets (broader)"],"phonetic":"/ˈdɔɡ fri/","extraExplanation":["“dog-free”是由“dog + free”构成的复合形容词，常见于告示、租房条款、旅游信息等，意思接近“No dogs allowed”。","写作时常用连字符（dog-free）放在名词前作定语：a dog-free apartment；也可作表语：The area is dog-free."]}
{"word":"dog-headed","summary":{"en":"Dog-headed means “having a dog’s head” (mythical/imaginary) or, in older literary use, “stubborn or rudely harsh.”","zh":"dog-headed 可指“狗头的”（多见于神话/幻想描写），也可在较旧的文学用法中指“顽固或粗鲁刻薄的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a dog’s head (used literally, often in myths, art, or descriptions of imaginary beings).","zh":"（字面）长着狗的头（常用于神话、艺术或幻想生物的描述）。"},"examples":[{"en":"In some ancient stories, travelers claimed to meet dog-headed people in distant lands.","zh":"在一些古老传说里，旅行者声称在遥远的地方遇到过狗头人。"},{"en":"The statue shows a dog-headed guardian watching over the tomb.","zh":"这座雕像展示了一位狗头守护者守望着墓穴。"}]},{"partOfSpeech":"adj.","definition":{"en":"Stubborn, harsh, or offensively rude (an old-fashioned, literary use).","zh":"（文学/旧式）顽固的；粗暴无礼的；令人反感的。"},"examples":[{"en":"He gave a dog-headed refusal and wouldn’t listen to anyone.","zh":"他固执地拒绝了，谁的话也不听。"},{"en":"The critic described the reply as dog-headed and unnecessary.","zh":"评论者说那种回应既粗鲁又没必要。"}]}],"synonyms":["cynocephalic","stubborn","pigheaded","rude","abrasive"],"phonetic":"/ˈdɔɡˌhɛdɪd/","extraExplanation":["“dog-headed”在古代与中世纪的想象地理里常和“犬首人”（Cynocephali）联系在一起：传说中他们是长着狗头的人类部族。现代读者多把它当作神话/奇谈元素。","在埃及神话与艺术中，阿努比斯（Anubis）常被描绘为胡狼头或犬科动物头的神；英文里有时会被非严格地称作“dog-headed”，但更准确是“jackal-headed”。","用于形容人的“dog-headed（顽固/粗鲁）”带有明显的贬义与文学色彩，日常英语更常用 stubborn, rude, abrasive 等。"]}
{"word":"dog-like","summary":{"en":"“Dog-like” means having qualities typical of a dog—often loyal or eager, but sometimes negatively overly submissive.","zh":"“dog-like”指具有狗的典型特征，常指忠诚或热切；有时也可贬义指过分顺从、讨好。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a dog in behavior or appearance; typical of dogs (often describing loyalty, eagerness, or sometimes roughness).","zh":"像狗一样的；具有狗的典型特征（常指忠诚、热切，有时也指粗野）。"},"examples":[{"en":"He showed dog-like loyalty to his friends.","zh":"他对朋友表现出狗一般的忠诚。"},{"en":"The puppy followed her with dog-like enthusiasm.","zh":"小狗带着狗一般的热情跟着她。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes negative) Servile or submissive in a way that suggests begging or obeying too much.","zh":"（有时含贬义）卑躬屈膝的；过分顺从、像在讨好一样的。"},"examples":[{"en":"He gave a dog-like look, hoping they would let him stay.","zh":"他露出一种像在讨好的眼神，希望他们让他留下。"},{"en":"Some people dislike dog-like obedience in the workplace.","zh":"有些人不喜欢职场里那种“狗一样”的盲目服从。"}]}],"synonyms":["canine","doggy","loyal","submissive"],"phonetic":"/ˈdɔɡˌlaɪk/","extraExplanation":["“dog-like”是由“dog + -like”构成的形容词，-like表示“像……一样”。它常用来形容“忠诚、黏人、兴奋”等典型犬类行为，但在某些语境下也可能带有贬义（如“卑微讨好、盲从”）。使用时要留意语气与文化感受。","写作中它更常用来修饰抽象品质：dog-like loyalty/enthusiasm/obedience，而不是单纯外貌。若要强调外貌相似，有时也会用“canine”或“doggy”（更口语）。"]}
{"word":"dog-lovin","summary":{"en":"“Dog-lovin’” means ‘loving dogs’ in a casual, informal way.","zh":"“dog-lovin’”表示“爱狗的”，语气较口语、随意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Loving dogs; very fond of dogs.","zh":"（非正式）爱狗的；非常喜欢狗的。"},"examples":[{"en":"She’s a dog-lovin’ kid who volunteers at the animal shelter every weekend.","zh":"她是个爱狗的孩子，每个周末都去动物收容所做志愿者。"},{"en":"We’re a dog-lovin’ family, so our vacations are always pet-friendly.","zh":"我们家很爱狗，所以度假时总会选宠物友好的地方。"},{"en":"That dog-lovin’ smile comes out whenever he sees a puppy.","zh":"他一看到小狗就会露出那种“爱狗”的笑容。"}]}],"synonyms":["dog-loving","dog-friendly (context: places)","fond of dogs","a dog person"],"phonetic":"/ˈdɔɡˌlʌvɪn/","extraExplanation":["“dog-lovin’”里的 -in’ 是口语写法，表示把 “loving” 末尾的 g 省略（发音更像 /ˈlʌvɪn/）。常见于轻松、随意的语气（比如对话、歌词、社交媒体）。","通常带连字符（dog-lovin’）来强调它是一个整体的形容词；也可能写成 “dog-loving”（更正式）或 “dog lovin’”（更口语、更随意）。"]}
{"word":"dog-loving","summary":{"en":"“Dog-loving” means having a strong affection for dogs.","zh":"“dog-loving”意为“爱狗的、非常喜欢狗的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Liking dogs very much; showing a strong affection for dogs.","zh":"非常喜欢狗的；爱狗的。"},"examples":[{"en":"She’s a dog-loving person and volunteers at a local shelter.","zh":"她很爱狗，还在当地收容所做志愿者。"},{"en":"The dog-loving crowd cheered when the puppies came on stage.","zh":"当小狗上台时，爱狗的人群欢呼起来。"}]}],"synonyms":["dog-friendly","fond of dogs","a dog person"],"phonetic":"/ˈdɔɡˌlʌvɪŋ/","extraExplanation":["“dog-loving”是由名词+现在分词构成的复合形容词（类似“book-loving”“music-loving”），表示“喜爱……的”。在英语里这种结构常用连字符，尤其放在名词前作定语时：a dog-loving family。","语境上，“dog-loving”通常带有积极、温暖的情感色彩；如果想表达更中性或正式，也可以说 “a person who loves dogs” 或 “fond of dogs”。"]}
{"word":"dog-ness","summary":{"en":"“Dog-ness” means the quality of being a dog, or doglike traits (often playful/humorous).","zh":"“dog-ness”指“狗的特质/狗性”，也可指像狗一样的特征（常带俏皮幽默语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being a dog; dog identity or doglike nature (often used humorously or playfully).","zh":"狗的特质或状态；“作为狗”的本质、狗的身份或狗味（常带幽默、俏皮语气）。"},"examples":[{"en":"There’s a certain dognness in the way he greets everyone at the door.","zh":"他在门口迎接每个人的方式里，有一种很“狗”的特质。"},{"en":"The painting captures the dognness of the animal—loyal, alert, and curious.","zh":"这幅画抓住了那只动物的“狗性”——忠诚、警觉又好奇。"}]},{"partOfSpeech":"n.","definition":{"en":"doglike traits in a person or thing (for example, loyalty, enthusiasm, or eagerness).","zh":"人或事物表现出的“像狗一样”的特征（如忠诚、热情或迫不及待）。"},"examples":[{"en":"Her dognness—always eager to help—made her a great teammate.","zh":"她那种“狗狗般”的特质——总是乐于帮忙——让她成了很棒的队友。"},{"en":"The robot’s dognness made people trust it more.","zh":"这个机器人的“狗狗感”让人更容易信任它。"}]}],"synonyms":["dogginess","canine nature","doglike quality","doglike traits"],"phonetic":"ˈdɔɡ.nəs","extraExplanation":["“dog-ness”是由“dog + -ness”构成的派生词。“-ness”常把形容词或名词变成抽象名词，表示“……的性质/状态”（如 happiness, kindness）。","带连字符的写法（dog-ness）更像临时造词或强调语感；写作中也可能见到不加连字符的“dognness”。多用于口语、幽默表达或文学描写。"]}
{"word":"dog-related","summary":{"en":"“Dog-related” means connected with dogs or involving a dog incident.","zh":"“dog-related”指“与狗有关的；或涉及狗的事件/情况的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with dogs; involving dogs in some way.","zh":"与狗有关的；涉及狗的。"},"examples":[{"en":"The shelter runs dog-related programs like adoption events and training classes.","zh":"收容所会举办与狗有关的活动，比如领养日和训练课程。"},{"en":"She writes dog-related articles for a local pet magazine.","zh":"她为当地宠物杂志撰写与狗有关的文章。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in news or official reports) Caused by a dog or involving a dog incident.","zh":"（常用于新闻/通报）由狗引起的；涉及狗的事件的。"},"examples":[{"en":"The city reported a rise in dog-related injuries this summer.","zh":"市政府通报今年夏天与狗有关的伤害事件增加。"},{"en":"Please report any dog-related incidents to the park staff.","zh":"如遇与狗有关的事件，请告知公园工作人员。"}]}],"synonyms":["dog-associated","dog-connected","canine-related","related to dogs"],"phonetic":"/ˈdɔɡ rɪˈleɪtɪd/","extraExplanation":["“dog-related”是形容词，常用连字符（-）把“dog”和“related”连接起来，尤其放在名词前作定语时更常见：dog-related problems。放在名词后作表语时也可以写成不加连字符的形式：These problems are dog related，但在正式写作中加连字符更清晰。"]}
{"word":"dog-resistant","summary":{"en":"Dog-resistant means made to withstand dogs—preventing chewing, scratching, knocking over, or getting through.","zh":"dog-resistant 指“耐狗的/防狗破坏的”，能抵抗狗的咬、抓、撞或闯入。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to resist damage from dogs or prevent dogs from getting through, chewing, or disturbing something (e.g., a fence, fabric, container, or door).","zh":"（物品/设施）耐狗的；能防止狗破坏、咬坏或闯入的（如围栏、布料、容器、门等）。"},"examples":[{"en":"We installed a dog-resistant fence so our neighbors’ dogs can’t push it down.","zh":"我们装了耐狗的围栏，这样邻居家的狗就推不倒了。"},{"en":"Choose dog-resistant fabric if your puppy likes to chew the sofa.","zh":"如果你的小狗爱咬沙发，就选耐狗的布料。"}]}],"synonyms":["dog-proof","pet-resistant","chew-resistant","scratch-resistant"],"phonetic":"/ˈdɔɡ rɪˈzɪstənt/","extraExplanation":["“dog-resistant”是由名词+形容词（resistant）组成的复合形容词，常用连字符（-）连接，尤其在名词前作定语时更常见：a dog-resistant gate。放在名词后作表语时，有时也可不加连字符，但加连字符更清晰：The material is dog-resistant。","它通常出现在产品说明、广告或家居/宠物用品语境中，强调“对狗造成的影响有抵抗力”。类似结构还有：water-resistant（防水的）、stain-resistant（防污的）、scratch-resistant（防刮的）。"]}
{"word":"dog-safe","summary":{"en":"“Dog-safe” means safe for dogs (not harmful) or suitable for homes with dogs.","zh":"“dog-safe”指“对狗安全（无害）”或“适合有狗的环境（耐狗、对狗友好）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Safe for dogs; not harmful to dogs if used, eaten, or touched as intended.","zh":"对狗安全的；按说明使用/食用/接触时不会伤害狗的。"},"examples":[{"en":"Make sure the houseplants you buy are dog-safe.","zh":"买室内植物时要确认对狗安全。"},{"en":"This cleaner is labeled dog-safe, so it shouldn’t irritate your pet’s paws.","zh":"这款清洁剂标注为“对狗安全”，所以一般不会刺激宠物的爪子。"},{"en":"Is peanut butter dog-safe in small amounts?","zh":"少量花生酱对狗安全吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Suitable for being around dogs (won’t be easily damaged, and won’t cause trouble if a dog is nearby).","zh":"适合有狗的环境；耐狗、对狗友好（狗在旁边也不容易损坏或引发问题）。"},"examples":[{"en":"We chose a dog-safe sofa fabric that’s easy to clean.","zh":"我们选了适合有狗家庭的沙发布料，方便清洁。"},{"en":"Keep cables in a dog-safe place so they won’t get chewed.","zh":"把电线放在狗够不到的安全位置，避免被咬。"}]}],"synonyms":["pet-safe","non-toxic (to dogs)","dog-friendly","safe for dogs"],"phonetic":"/ˈdɔɡ seɪf/","extraExplanation":["“dog-safe”常用于包装、家居、园艺、食物等场景，强调“对狗没有毒/不会造成伤害”。类似表达还有“pet-safe（对宠物安全）”“kid-safe（对孩子安全）”。","写作上常见带连字符的复合形容词（dog-safe）。放在名词前更常用：dog-safe shampoo / dog-safe plants；作表语时也可不用连字符：This shampoo is dog safe."]}
{"word":"dog-shaped","summary":{"en":"“Dog-shaped” means shaped like a dog.","zh":"“dog-shaped”表示“狗形的/形状像狗的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape or outline of a dog; resembling a dog in form (often used before a noun).","zh":"狗形的；形状像狗的（常作名词前的复合形容词）。"},"examples":[{"en":"She bought a dog-shaped cookie for her nephew.","zh":"她给侄子买了一块狗形的饼干。"},{"en":"The park has a dog-shaped topiary near the entrance.","zh":"公园入口附近有一棵修剪成狗形的造型树。"},{"en":"They used a dog-shaped balloon as party decoration.","zh":"他们用狗形气球作为派对装饰。"}]}],"synonyms":["doglike (in shape)","canine-shaped","dog-form"],"phonetic":"/ˈdɔɡ ʃeɪpt/","extraExplanation":["这是一个常见的“名词 + -shaped”的复合形容词，通常要加连字符并放在名词前：a dog-shaped pillow。若放在系动词后也可以不加连字符，但加上更清晰：The pillow is dog-shaped / dog shaped。","类似结构：heart-shaped（心形的）、star-shaped（星形的）、egg-shaped（蛋形的）。"]}
{"word":"dog-steal","summary":{"en":"Dog-steal means to steal a dog, or the act of stealing dogs.","zh":"dog-steal 指偷狗，或偷狗这种行为。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to steal a dog (often to sell it, demand a reward, or use it for illegal purposes).","zh":"偷狗（常见动机包括转卖、勒索赎金/悬赏金，或用于非法用途）。"},"examples":[{"en":"Someone dog-stole her puppy from the yard while she was at work.","zh":"她上班时，有人从院子里把她的小狗偷走了。"},{"en":"The police warned residents about people dog-stealing pets near the park.","zh":"警方提醒居民注意：公园附近有人偷宠物狗。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or crime of stealing dogs; dog theft.","zh":"偷狗行为；偷狗罪（狗盗）。"},"examples":[{"en":"Dog-steal is treated as theft in many places, especially when the dog is valuable.","zh":"在许多地方，偷狗会按盗窃处理，尤其是狗价值较高时。"},{"en":"There was an increase in dog-steal cases during the holiday season.","zh":"假期期间偷狗案件有所增加。"}]}],"synonyms":["dognap","steal a dog","dog theft","pet theft"],"phonetic":"/ˈdɔɡˌstil/","extraExplanation":["“dog-steal / dog-stealing”是比较少见的拼写，更常见的说法是“steal a dog / dog theft”，以及近年口语里常用的“dognap（偷走宠物并让主人焦急寻找）”。","如果是为索要赎金或‘找回费’，新闻报道里也可能写成“pet kidnapping（宠物绑架）”。"]}
{"word":"dog-tired","summary":{"en":"extremely exhausted","zh":"极度疲惫"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"extremely tired; exhausted","zh":"累到不行的；筋疲力尽的"},"examples":[{"en":"After the long flight and layover, I was dog-tired.","zh":"经历了长途飞行和转机后，我累到不行。"},{"en":"She got home dog-tired and fell asleep on the couch.","zh":"她回到家筋疲力尽，倒在沙发上就睡着了。"},{"en":"We were dog-tired after hiking all day.","zh":"我们徒步走了一整天后累得要命。"}]}],"synonyms":["exhausted","worn out","dead tired","bone-tired","beat","spent"],"phonetic":"/ˈdɔɡ taɪrd/","extraExplanation":["常用于非正式口语，语气比 very tired 更强，接近 exhausted。","通常写作 dog-tired（带连字符）；也可见 dog tired，但连字符更常见。"],"etymology":"由“dog（狗）+ tired（疲倦）”构成的复合形容词；早期用法常带有“像狗一样累、精疲力竭”的强调意味，后来固定为口语化的“非常累”。","mnemonic":["把它想成“累得像狗一样趴下就睡”：dog + tired = 累到趴。","联想中文口语“累成狗”，含义非常接近，记忆更牢。"]}
{"word":"dog-walking area","summary":{"en":"a designated place for walking dogs, often with posted rules","zh":"指定的遛狗地点/区域，常配有规则提示"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a designated place (often in a park or apartment complex) where people are allowed or encouraged to walk their dogs, sometimes with specific rules","zh":"（常在公园或小区内）专门划出的遛狗区域；通常允许或鼓励在此遛狗，并可能有相关规定"},"examples":[{"en":"Please keep your dog on a leash outside the dog-walking area.","zh":"在遛狗区域外，请给狗拴上牵引绳。"},{"en":"The hotel has a small dog-walking area behind the parking lot.","zh":"酒店在停车场后面有一块小型遛狗区。"},{"en":"Residents asked for a fenced dog-walking area to reduce mess on the lawns.","zh":"居民要求设置带围栏的遛狗区，以减少草坪上的脏乱。"}]}],"synonyms":["dog walking zone","dog-friendly area","pet relief area","dog exercise area"],"phonetic":"/ˈdɔɡ ˌwɔkɪŋ ˈɛriə/","extraExplanation":["在英语环境里，这类区域常配套规则提示，如：leash required（必须牵绳）、clean up after your dog（请清理宠物排泄物）、no dogs on playground（游乐区禁止带狗）。","有时也会与“dog park（狗公园）”区分：dog park 往往更大、可能允许不牵绳（off-leash）活动；dog-walking area 可能只是允许牵绳散步的路线或一小块区域。"],"etymology":"由“dog-walking（遛狗）+ area（区域）”构成的复合短语，常见于告示牌、物业/社区通知与地图标注中，用来指明允许遛狗的指定地点。","mnemonic":["把它拆开记：dog-walking＝遛狗，area＝区域 → 合起来就是“遛狗区域”。","联想小区标识牌：看到“area（区域）”就想到“这里是指定地点”。"]}
{"word":"dogal","summary":{"en":"“Dogal” is not a standard English word; it often represents Turkish “doğal” (“natural”), or less commonly a name variant of “Dougal.”","zh":"“dogal”不是标准英语词；常见为土耳其语“doğal（天然的）”的简写拼法，较少情况下是人名“Dougal”的变体拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard English) A common non‑diacritic spelling of Turkish “doğal,” meaning “natural; not artificial.”","zh":"（非标准英语用法）常见于去掉变音符号后的土耳其语“doğal”的拼写，意思是“天然的；非人工的”。"},"examples":[{"en":"This label says “dogal” (Turkish: “doğal”), meaning the ingredients are natural.","zh":"这个标签写着“dogal”（土耳其语“doğal”），意思是配料是天然的。"},{"en":"The café advertises “dogal products,” basically natural products.","zh":"这家咖啡馆宣传“dogal products”，基本就是“天然产品”。"}]},{"partOfSpeech":"other","definition":{"en":"A given name (more commonly spelled “Dougal”), used for people; from Scottish Gaelic roots.","zh":"人名（更常见拼写为“Dougal”），源自苏格兰盖尔语词根。"},"examples":[{"en":"Dougal (sometimes written as Dogal) is a Scottish boy’s name.","zh":"Dougal（有时也写作Dogal）是一个苏格兰男孩名。"}]}],"synonyms":["natural","organic","non-artificial","unprocessed"],"phonetic":"/doʊˈɑːl/","extraExplanation":["“doğal”里的字母“ğ”（yumuşak g，软g）在土耳其语中通常不像英语的g那样发硬音，更常见的是拉长前面的元音或产生很轻的滑音；因此在英文环境里常被简化写成“dogal”。","如果你是在英语文章里看到“dogal”，它多半不是英语单词，而是品牌名、菜单用语或对土耳其语“doğal”的转写；在正式英文表达里通常直接用“natural”。"]}
{"word":"dogana","summary":{"en":"Dogana is an Italian word meaning “customs” (the customs office) or “customs duty” (the tax on imports/exports).","zh":"dogana 是意大利语，意思是“海关”（机构/地点）或“关税”（进出口税）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) a customs office; the place where goods are checked when entering or leaving a country (especially used in Italy).","zh":"（意大利语）海关；（尤指在意大利）出入境时检查货物的机构/地点。"},"examples":[{"en":"We had to stop at the dogana to declare the wine we bought.","zh":"我们得在海关申报买的葡萄酒。"},{"en":"The package was held at the dogana for inspection.","zh":"包裹被海关扣下检查。"}]},{"partOfSpeech":"n.","definition":{"en":"(Italian) customs duty; a tax paid on goods imported or exported.","zh":"（意大利语）关税；进出口货物需要缴纳的税。"},"examples":[{"en":"They paid the dogana before taking the goods into the country.","zh":"他们在把货物带入境之前缴了关税。"},{"en":"Ask if any dogana applies to this purchase.","zh":"问一下这笔购买是否需要缴关税。"}]}],"synonyms":["customs","customs office","customs duty","tariff"],"phonetic":"/doʊˈɡɑːnə/","extraExplanation":["“Dogana”是意大利语，常见于旅行、物流、海淘语境里，指“海关/关税”。在英语对话或写作中更常用的对应词是 customs（海关）和 customs duty / tariff（关税）。","词源上与表示“税/贡赋”的概念有关；在意大利旅行时，你可能在机场或边境看到“Dogana”作为指示牌用语。"]}
{"word":"dogareship","summary":{"en":"“dogareship” is not a recognized English word; it’s likely a misspelling or a coined term.","zh":"“dogareship”不是公认的英语单词；很可能是拼写错误或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, or a made-up term, so it doesn’t have an established dictionary meaning.","zh":"不是标准英语单词。它可能是拼写错误、用户名或自造词，因此没有公认的词典释义。"},"examples":[{"en":"I couldn’t find “dogareship” in a dictionary—did you mean a different word?","zh":"我在词典里找不到“dogareship”——你是不是想写另一个词？"},{"en":"If you tell me the sentence where you saw “dogareship,” I can help guess the intended meaning.","zh":"如果你把看到“dogareship”的句子发给我，我可以帮你推测它原本想表达的意思。"}]}],"phonetic":"ˈdɔɡɛɹʃɪp","extraExplanation":["这个词看起来像把几个片段拼在一起（例如 dog + … + ship），但英语里并没有常见的“dogareship”。如果你想学的是以 -ship 结尾的词，常见的有 friendship（友谊）、leadership（领导力）、membership（会员身份）。","你可以告诉我：1）它出现的上下文句子；2）你想表达的中文意思；3）是否是人名/游戏ID/品牌名。我就能更准确地给出正确拼写和释义。"]}
{"word":"dogaressa","summary":{"en":"A historical title for the wife (or widow) of a Venetian doge.","zh":"威尼斯总督（doge）的妻子或遗孀的历史称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The wife (or widow) of a doge, especially the chief magistrate of Venice; a historical title.","zh":"（尤指威尼斯共和国）总督（doge）的妻子或遗孀；一种历史称号。"},"examples":[{"en":"In Venetian history, the dogaressa sometimes played a visible role in public ceremonies.","zh":"在威尼斯历史中，dogaressa 有时会在公共典礼中扮演显眼的角色。"},{"en":"The museum displayed portraits of a dogaressa dressed in formal court clothing.","zh":"博物馆展出了身着正式宫廷服饰的 dogaressa 肖像。"}]}],"synonyms":["Doge’s wife"],"phonetic":"ˌdoʊɡəˈrɛsə","extraExplanation":["“Dogaressa”源自意大利语，指威尼斯（以及少数其他城邦）“doge（总督）”的配偶。它带有强烈的历史与地域色彩，现代英语中多见于历史写作、艺术史、旅游介绍或讨论威尼斯政治文化的语境。","在威尼斯，dogaressa 有时会参与仪式、慈善或公共形象活动，但其权力与职责因时代与具体人物而异；这个词本身通常不用于现代政治职位。"]}
{"word":"dogate","summary":{"en":"Dogate is a rare word meaning “of a doge” or “the doge’s office/term,” mainly used in historical contexts (especially Venice).","zh":"dogate 是个少见词，主要用于历史语境，表示“与威尼斯等地的总督（doge）有关的”，也可指“总督的职位/任期”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a doge (the elected ruler of Venice and some other Italian city-states in the Middle Ages and Renaissance); of the doge or his office.","zh":"与“总督（doge，威尼斯等意大利城邦昔日的选举统治者）”有关的；属于总督或其官职的。"},"examples":[{"en":"The museum displayed dogate portraits from the Venetian Republic.","zh":"博物馆展出了威尼斯共和国时期的总督肖像。"},{"en":"They studied dogate ceremonies to understand how Venice projected power.","zh":"他们研究总督的典礼仪式，以理解威尼斯如何展示权力。"}]},{"partOfSpeech":"n.","definition":{"en":"the office, term, or authority of a doge (rare).","zh":"总督的职位、任期或权力（较少见）。"},"examples":[{"en":"The book describes the struggles surrounding the dogate after the election.","zh":"这本书描述了选举后围绕总督职位的权力斗争。"}]}],"synonyms":["Venetian (context-dependent)","ducal (roughly similar in meaning but not the same)"],"phonetic":"/ˈdoʊɡeɪt/","extraExplanation":["“dogate”在现代英语中非常少见，多出现在历史、艺术史或对威尼斯共和国的研究中。更常见的基础词是“doge”。","词形上常理解为“doge + -ate（表示职位/职权或与……相关）”。","如果你想表达“委派/代表团/代表”，你可能想写的是“delegate”（/ˈdɛlɪɡət/ 名词；/ˈdɛlɪɡeɪt/ 动词）。"]}
{"word":"dogbane","summary":{"en":"Dogbane is a poisonous North American plant in the genus Apocynum, sometimes called Indian hemp.","zh":"Dogbane 指一种北美的有毒植物（夹竹桃麻属 Apocynum），有时也被称为 Indian hemp。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North American plant (genus Apocynum) with milky sap, known for being poisonous; sometimes also called Indian hemp.","zh":"一种北美植物（夹竹桃麻属 Apocynum），有乳白色汁液，具有毒性；有时也叫“印第安大麻”（Indian hemp）。"},"examples":[{"en":"Dogbane is poisonous, so it shouldn’t be eaten by people or pets.","zh":"狗毒草有毒，所以人和宠物都不该食用。"},{"en":"We saw dogbane growing along the riverbank, with clusters of small pinkish flowers.","zh":"我们在河岸边看到狗毒草成片生长，开着一簇簇淡粉色的小花。"},{"en":"Some dogbane species were used to make strong fiber for cord and rope.","zh":"一些狗毒草品种曾被用来制作结实的纤维，用于绳线和绳索。"}]}],"synonyms":["Apocynum","Indian hemp"],"phonetic":"/ˈdɔɡˌbeɪn/","extraExplanation":["“dogbane”字面是“使狗中毒的东西”（bane=祸害/毒物），名字强调它的毒性，并不表示它只对狗有害。","它常被称作“Indian hemp”，因为某些种类的茎皮纤维可被加工成绳线；但它与现代所说的工业大麻/大麻（Cannabis）不是同一种植物。"]}
{"word":"dogbane-family","summary":{"en":"The dogbane family is the plant family Apocynaceae, which includes many milky-sapped, often poisonous flowering plants like oleander and periwinkle.","zh":"dogbane family 指夹竹桃科（Apocynaceae），包含许多有乳汁、常带毒性的开花植物，如夹竹桃和长春花等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (Apocynaceae) that includes dogbanes, milkweeds, oleander, periwinkle, and many other flowering plants; many members have milky sap and can be poisonous","zh":"夹竹桃科（Apocynaceae）：一个开花植物科，包括狗毒草、马利筋（乳草）、夹竹桃、长春花等；许多成员有乳白色汁液并可能有毒"},"examples":[{"en":"Oleander is in the dogbane family and can be dangerous if eaten.","zh":"夹竹桃属于夹竹桃科，误食可能很危险。"},{"en":"Some dogbane-family plants are used in medicine, but their sap can irritate skin.","zh":"一些夹竹桃科植物可入药，但它们的汁液可能刺激皮肤。"}]}],"synonyms":["Apocynaceae","dogbane family (Apocynaceae)","apocynum family (informal)"],"phonetic":"/ˈdɔɡˌbeɪn ˈfæməli/","extraExplanation":["“dogbane family”是常见名（common name），对应的学名科名是 Apocynaceae。日常阅读中（植物书、自然观察、园艺标签）更常见学名“Apocynaceae”。","词源上，“dogbane”字面是“让狗退避/受害的植物”，反映了某些成员有毒、会让动物不适这一传统认知；并不表示只对狗有影响。","该科常见特征包括：乳白色汁液（milky sap）、部分物种含强心苷等生物碱/强效成分；因此园艺与野外识别时通常会提醒“有毒，避免误食”。"]}
{"word":"dogbanes","summary":{"en":"“Dogbanes” means poisonous dogbane plants (plural).","zh":"“dogbanes”指有毒的狗毒草（dogbane）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous plant (dogbane) that can harm animals; the word “dogbanes” is the plural form.","zh":"一种有毒植物（dogbane，夹竹桃科/萝藦科的一类植物），可能对动物有害；“dogbanes”是其复数形式。"},"examples":[{"en":"Dogbanes grow along roadsides and in fields in many parts of North America.","zh":"在北美很多地区，dogbanes 常见于路边和田野里。"},{"en":"Be careful—some dogbanes contain milky sap that can irritate skin.","zh":"小心——有些 dogbanes 含有乳白色汁液，可能刺激皮肤。"},{"en":"The field guide warns hikers not to eat plants like dogbanes.","zh":"野外指南提醒徒步者不要食用像 dogbanes 这样的植物。"}]}],"synonyms":["dogbane","Apocynum","poisonous wild plant"],"phonetic":"/ˈdɔɡˌbeɪn/","extraExplanation":["“dogbane”字面意思是“让狗遭殃/致害的东西”（bane=祸害、毒害），来源于人们对这种植物有毒的认识，并不表示它只对狗有害。","在自然写作或旧文学里，植物名常用复数来泛指“这一类植物/这一片植物”，所以你会看到 dogbanes 用来指多株或多种狗毒草。","日常英语里更常见单数 dogbane（指一种植物或该类植物的统称）；如果你在生物/植物学语境中阅读，可能还会遇到具体属名，如 Apocynum（dogbane 属）。"]}
{"word":"dogberries","summary":{"en":"Dogberries are usually bitter wild berries (often dogwood berries); in older literary use, it can also mean foolish people (an insult).","zh":"Dogberries通常指味苦的野生浆果（常指山茱萸的果实）；在较老的文学用法中也可贬称愚蠢的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Small, usually bitter or inedible wild berries, especially the berries of some dogwood plants.","zh":"（复数）野生的小浆果，通常味苦或不可食用；尤指某些山茱萸（dogwood）植物的果实。"},"examples":[{"en":"The hedge was full of dogberries, but we didn’t pick any because they can taste bitter.","zh":"树篱上结满了dogberries，但我们没采，因为它们可能很苦。"},{"en":"Birds often eat dogberries even when people don’t.","zh":"即使人们不吃，鸟类也常常会吃dogberries。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/dated, from Shakespeare) People who are foolish, bumbling, or low-status (used as an insult).","zh":"（文学/旧用法，源自莎士比亚）指愚蠢、笨拙或地位低下的人（侮辱性用语）。"},"examples":[{"en":"He called the guards “a pack of dogberries” for missing the thief.","zh":"他骂那些守卫是“一群dogberries”，因为他们让小偷溜走了。"},{"en":"The word sounds playful, but it’s meant as an insult in older texts.","zh":"这个词听起来有点俏皮，但在较老的文本里带有侮辱意味。"}]}],"synonyms":["wild berries","dogwood berries","(insult, dated) fools","(insult, dated) idiots"],"phonetic":"/ˈdɔɡˌbɛriz/","extraExplanation":["“Dogberry”最有名的文化来源是莎士比亚喜剧《无事生非》（Much Ado About Nothing）里的角色 Dogberry：他是个自以为很懂、却常把词说错的巡夜官，常用来象征“笨拙但有点好笑的蠢人”。因此后来 dogberry（以及复数 dogberries）可被用作贬称。"]}
{"word":"Dogberry","summary":{"en":"Dogberry is a Shakespeare character, and by extension a term for a bumbling, self-important official who often speaks clumsily.","zh":"Dogberry 是莎士比亚人物名，也引申指笨拙自大、办事不行且常用词出错的官员/执法者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A comic character in Shakespeare’s play *Much Ado About Nothing*: the well-meaning but foolish constable (local police officer) whose speech is full of mistakes.","zh":"（专有名词）莎士比亚喜剧《无事生非》中的滑稽人物：一位善良但愚笨的治安官（类似地方警官），说话常出错、闹笑话。"},"examples":[{"en":"Dogberry is the constable in *Much Ado About Nothing*.","zh":"Dogberry 是莎士比亚《无事生非》里的治安官。"},{"en":"In the play, Dogberry tries to sound official, but his words often come out wrong.","zh":"在剧中，Dogberry 想显得很“官腔”，但他常常把话说错。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common noun, literary) A bumbling, self-important, incompetent official—especially one who uses language clumsily.","zh":"（普通名词，文学用法）指笨拙又自以为是、办事不靠谱的官员（尤指说话用词很别扭、闹笑话的人）。"},"examples":[{"en":"The manager played the Dogberry of the meeting, interrupting with confident but confused remarks.","zh":"那位经理在会议上活像个“Dogberry”，自信插话却越说越糊涂。"},{"en":"Critics called him a Dogberry for his official statements full of misunderstandings.","zh":"评论家称他为“Dogberry”，因为他的官方发言充满误解和错话。"}]}],"synonyms":["bumbling constable","pompous fool","inept official","comic bureaucrat"],"phonetic":"/ˈdɔɡˌbɛri/","extraExplanation":["Dogberry 这个名字常被用来指一种“滑稽的官僚/执法者”形象：职位不大却很爱摆架子，做事与表达都很笨拙。","在《无事生非》中，Dogberry 的笑点很大一部分来自他把词用错（类似把正式词说反、说错），英语里常用 “Dogberryism” 指这种可笑的用词错误或语言失当。","如果你在文章里看到 someone is “a Dogberry”，通常是带一点文学化、讽刺意味的比喻，而不是字面意义。"]}
{"word":"dogberry","summary":{"en":"Dogberry is Shakespeare’s comic constable; by extension, it means a foolish, self-important official.","zh":"Dogberry 是莎士比亚笔下的滑稽警官；引申为愚笨又自负的官员/执法者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Literary) A comically foolish, self-important official—especially an incompetent constable or petty officer.","zh":"（文学用语）滑稽又愚笨、自以为是的官员；尤指无能的警官/小官。"},"examples":[{"en":"The report described the security chief as a real dogberry—confident, but clueless.","zh":"报告把这位安保主管形容成一个“Dogberry”式人物——自信却一头雾水。"},{"en":"In the play, the town relies on a dogberry to keep order, with funny results.","zh":"在戏剧里，小镇指望一个“Dogberry”来维持秩序，结果笑料百出。"}]},{"partOfSpeech":"other","definition":{"en":"Dogberry: a character (the constable) in Shakespeare’s *Much Ado About Nothing*, famous for comic misuse of words.","zh":"Dogberry：莎士比亚《无事生非》中的人物（巡夜警官/警长），以滑稽的用词错误而出名。"},"examples":[{"en":"Dogberry is one of Shakespeare’s most memorable comic constables.","zh":"Dogberry 是莎士比亚笔下最令人难忘的滑稽警官之一。"},{"en":"Our teacher used Dogberry to show how word mistakes can create humor.","zh":"老师用 Dogberry 说明“用词错误”也能制造幽默。"}]}],"synonyms":["bumbling constable","incompetent official","fool","clown","buffoon"],"phonetic":"/ˈdɔɡˌbɛri/","extraExplanation":["Dogberry 出自莎士比亚喜剧《无事生非》（*Much Ado About Nothing*）。他常把词用错或说反，形成一种经典的语言喜剧效果，常被用来代表“无能却自负的官员/执法者”。","在英语里把某人称作 “a Dogberry” 往往带有文学色彩和讽刺意味；更日常的说法可能是 “a bumbling officer / an incompetent official”。"]}
{"word":"Dogberrydom","summary":{"en":"Comic, self-important incompetence in an official role; “bumbling authority.”","zh":"指在官方/执法角色中自大却无能、闹笑话的“笨拙官威”作风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or behavior of being comically incompetent, self-important, and muddle-headed in an official role (especially in law enforcement or bureaucracy).","zh":"（尤指执法或官僚岗位上）既自以为是又笨拙无能、闹笑话的“官腔式蠢忙”作风。"},"examples":[{"en":"The report was full of Dogberrydom—confident claims, basic mistakes, and no clear plan.","zh":"这份报告充满了“道格伯里式蠢忙”——口气很大，却错得离谱，也没有清晰方案。"},{"en":"People complained that the investigation showed pure Dogberrydom rather than professionalism.","zh":"人们抱怨这次调查表现得不是专业，而是纯粹的“道格伯里式瞎忙”。"}]}],"synonyms":["bureaucratic bungling","blundering officiousness","red-tape incompetence","Keystone Kops behavior"],"phonetic":"/ˈdɔɡˌbɛriˌdɑm/","extraExplanation":["该词来自莎士比亚喜剧《无事生非》（Much Ado About Nothing）中的巡夜队长 Dogberry。他爱摆官架子、常用错词、办事糊涂却自信满满，因此 Dogberrydom 用来讽刺“权力感很强但能力不足”的官僚/执法作风。","词尾 -dom 表示“状态、领域、特质”（如 freedom, kingdom），所以 Dogberry + -dom 字面上可理解为“像 Dogberry 那样的状态/作风”。","使用场景多带幽默或讽刺语气，常用于评论荒唐的官僚流程、低效调查或形式主义管理。"]}
{"word":"dogberrydom","summary":{"en":"Dogberrydom means foolish, pompous, clumsy official behavior—like the comic constable Dogberry in Shakespeare.","zh":"dogberrydom 指“道格贝里式”的愚蠢自大、笨拙行使权力的小官僚/无能官员作风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often humorous or critical) The kind of foolish self-importance, clumsy authority, or petty official behavior associated with Dogberry, a comically incompetent constable in Shakespeare.","zh":"（常带幽默或批评）指像莎士比亚作品中“道格贝里”（Dogberry）那样的愚蠢自大、笨拙行使权力或小官僚作风。"},"examples":[{"en":"The meeting was full of dogberrydom: people insisted on rules they didn’t understand.","zh":"这场会议充满了“道格贝里式官僚作风”：人们坚持执行自己都不理解的规定。"},{"en":"His dogberrydom made a simple task feel like a legal trial.","zh":"他的“道格贝里式作派”把一件简单的事弄得像在打官司。"}]}],"synonyms":["pompous officiousness","bureaucratic foolishness","petty officialdom","blundering authority"],"phonetic":"/ˈdɔɡˌbɛriˌdəm/","extraExplanation":["“dogberrydom”来自莎士比亚喜剧《无事生非》（Much Ado About Nothing）中的人物Dogberry。他是地方治安官（constable），说话爱用“大词”却常用错，做事认真却很笨拙，因此在英语里成了“滑稽的无能官员/小官僚”的象征。","词尾“-dom”常表示“……的领域/状态/作风”（如 freedom, officialdom）。因此 dogberrydom 就是“像Dogberry那样的作风或状态”。"]}
{"word":"Dogberryism","summary":{"en":"Dogberryism means a funny mistake in word choice—using the wrong word (often a similar-sounding or overly formal one) in a way that creates humor.","zh":"Dogberryism 指因把词用错（常因音近或刻意用“高级词”）而产生的滑稽表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the humorous use of words in the wrong way, especially by mixing up similar-sounding words or using “fancy” words incorrectly","zh":"（尤指因误用“高级词”或把发音相近的词搞混而产生的）滑稽用词错误、词语误用造成的幽默"},"examples":[{"en":"His speech was full of Dogberryism—he kept saying “pacific” when he meant “specific.”","zh":"他的演讲充满了 Dogberryism——他一直把“specific（特定的）”说成“pacific（太平洋的）”。"},{"en":"The comedy comes from the character’s Dogberryism, not from insults.","zh":"喜剧效果来自这个角色的滑稽误用词语，而不是靠辱骂。"}]}],"synonyms":["malapropism","verbal blunder","misuse of words","mixed-up wording"],"phonetic":"/ˈdɔɡˌbɛɹiˌɪzəm/","extraExplanation":["Dogberryism 源自莎士比亚喜剧《无事生非》（Much Ado About Nothing）中的人物 Dogberry（多格贝里），他自以为用词正式，却常把词用错，从而制造喜剧效果。这个词常用于文学评论、写作或语言学习语境里，指“误用词语导致的可笑表达”。","它与 malapropism（也指误用词语的滑稽错误）很接近；区别是 Dogberryism 更强调“像 Dogberry 那样一本正经地说错”，带有明显的文学典故色彩。"]}
{"word":"dogberryism","summary":{"en":"Dogberryism means a funny mistake in word choice, especially a wrong but official-sounding expression.","zh":"Dogberryism 指滑稽的用词错误，尤其是听起来很官腔/正式但其实用错的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a humorous misuse of words, especially a blunder that sounds formal or official but is wrong (similar to a malapropism).","zh":"（尤指听起来很正式/官腔却用错的）滑稽用词错误；词语误用（类似“malapropism”）。"},"examples":[{"en":"His speech was full of dogberryisms, so the audience laughed even though he was trying to be serious.","zh":"他的演讲里满是 dogberryism（滑稽用词错误），他明明想严肃点，观众却笑了。"},{"en":"Calling the problem “a bless-ed disaster” was an unintentional dogberryism.","zh":"把这个问题称作“被祝福的灾难”是无意的 dogberryism（用词闹笑话）。"}]}],"synonyms":["malapropism","verbal blunder","misuse of words"],"phonetic":"/ˈdɔɡˌbɛrizəm/","extraExplanation":["Dogberryism 源自莎士比亚戏剧《无事生非》(Much Ado About Nothing) 中的角色 Dogberry。他说话喜欢装得很“官样”，却常把词用错，产生喜剧效果，因此后人用 dogberryism 指这类滑稽的用词失误。","与 malapropism 很接近：两者都指“把词说错但又有点像对的”，常见于想显得有学问或正式却词汇掌握不牢的语境。"]}
{"word":"Dogberrys","summary":{"en":"“Dogberrys” usually refers to Dogberry (a comic constable in Shakespeare) or people who are foolish and self-important like him; rarely it can mean dogwood berries.","zh":"“Dogberrys”通常指莎士比亚笔下的Dogberry或“像他一样愚笨又自以为是的人”；很少情况下也可指山茱萸的浆果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Shakespeare) Dogberry: a comic character—a self-important but incompetent constable—in *Much Ado About Nothing*. “Dogberrys” can mean “multiple Dogberry-like people.”","zh":"（莎士比亚）道格伯里（Dogberry）：《无事生非》中滑稽人物——自以为是但办事无能的巡捕/差役。“Dogberrys”可指“多个像道格伯里那样的人”。"},"examples":[{"en":"In Shakespeare’s *Much Ado About Nothing*, Dogberry leads the watch but constantly mixes up words.","zh":"在莎士比亚《无事生非》中，Dogberry 带领巡夜队，但总把词用错。"},{"en":"The office didn’t need more Dogberrys—just one careful, trained security guard.","zh":"办公室不需要更多“Dogberry式人物”，只要一个认真受训的保安就够了。"}]},{"partOfSpeech":"n.","definition":{"en":"(common noun, often humorous) A Dogberry: a foolish, bumbling, or officious person—especially someone in authority like a minor official or guard.","zh":"（常作幽默用法）“Dogberry式的人”：愚笨、笨拙又爱摆架子的人——尤其指掌点小权的官员、管理员、保安等。"},"examples":[{"en":"He tried to sound formal, but he came off as a Dogberry.","zh":"他想装得很正式，结果反而像个 Dogberry。"},{"en":"Don’t let a Dogberry handle the paperwork—mistakes are guaranteed.","zh":"别让“Dogberry式的人”管文书——出错几乎是必然的。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) dogberry: the berry-like fruit of certain dogwood plants.","zh":"（罕见）dogberry：某些山茱萸（dogwood）植物的浆果状果实。"},"examples":[{"en":"Some older texts mention “dogberries” when describing wild hedges and woods.","zh":"一些较老的文本在描写野篱与林地时会提到“dogberries”。"}]}],"synonyms":["bumbling official","fool","clown","buffoon","petty bureaucrat","incompetent constable"],"phonetic":"/ˈdɔɡˌbɛri/","extraExplanation":["“Dogberry”最有名的来源是莎士比亚《无事生非》里的巡捕。他常把词说错（类似“口误+误用大词”的喜剧效果），所以后来“a Dogberry”就引申为“笨拙又自以为是的小人物/小官”。","你输入的“Dogberrys”在规范拼写里通常写作“Dogberries”（复数）或“Dogberry’s”（所有格）。如果你是在指“一群像Dogberry那样的人”，用复数含义是说得通的。"]}
{"word":"dogbite","summary":{"en":"“Dogbite” usually means a dog bite injury (noun) and can also refer to the act of a dog biting (verb).","zh":"“dogbite”通常指狗咬伤（名词），也可指狗咬人这一行为（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an injury caused when a dog bites someone; the act of a dog biting","zh":"狗咬伤；被狗咬（这一行为）"},"examples":[{"en":"He went to the clinic for a dog bite on his hand.","zh":"他因为手上的狗咬伤去诊所了。"},{"en":"Dog bites are more common when people try to pet an unfamiliar dog.","zh":"当人们试图去摸一只不熟悉的狗时，更容易发生狗咬人。"}]},{"partOfSpeech":"v.","definition":{"en":"to bite someone (said of a dog)","zh":"（狗）咬（某人）"},"examples":[{"en":"The neighbor’s dog bit a mail carrier.","zh":"邻居的狗咬了邮递员。"},{"en":"If a dog bites, report it and seek medical advice right away.","zh":"如果被狗咬了，要及时报告并尽快寻求医疗建议。"}]},{"partOfSpeech":"adj.","definition":{"en":"(attributive) involving a dog bite case or injury","zh":"（作定语）与狗咬伤案件/伤情有关的"},"examples":[{"en":"She consulted a lawyer about a dog-bite claim.","zh":"她就一宗狗咬伤索赔咨询了律师。"}]}],"synonyms":["canine bite","dog attack","bite wound"],"phonetic":"/ˈdɔɡ ˌbaɪt/","extraExplanation":["更常见的写法是分开写作 “dog bite”（名词）或用连字符 “dog-bite”（作定语，如 dog-bite case）。","在美国语境里，dog bite 常出现在医疗与法律场景：就医处理伤口、讨论是否需要狂犬病（rabies）相关处置，以及责任归属与赔偿（claim）。"]}
{"word":"dogblow","summary":{"en":"“Dogblow” is rare slang (mainly in dog grooming) meaning a heavy shedding period (a coat blow).","zh":"“dogblow”较少见，多见于宠物美容语境，指狗大量换毛、掉毛的时期（coat blow）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, dog grooming) A period when a dog sheds its coat heavily; a “coat blow.”","zh":"（非正式／宠物美容用语）指狗在一段时间内大量掉毛、换毛；“爆毛期／换毛期”。"},"examples":[{"en":"In spring, my husky goes through a big dogblow, and hair gets everywhere.","zh":"春天我家的哈士奇会经历很严重的 dogblow，毛到处都是。"},{"en":"Regular brushing helps control the dogblow.","zh":"经常梳毛可以帮助控制换毛期的大量掉毛。"}]}],"synonyms":["coat blow","heavy shedding","shedding season","blow coat"],"phonetic":"/ˈdɔɡˌbloʊ/","extraExplanation":["“dogblow”不是常见的标准英语拼写；在宠物美容圈更常见的说法是“coat blow”或动词短语“blow (their) coat”（大量换毛）。如果你是在别的语境里看到这个词（例如游戏名、地名、用户名等），意思可能不同。"]}
{"word":"dogboat","summary":{"en":"Dogboat means a small, simple boat, often a basic fishing/work boat; informally it can mean any small unimpressive boat.","zh":"dogboat 指简易的小船，常见于近岸作业或捕鱼的小艇；口语里也可泛指小而不起眼的船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple boat (often an open fishing boat) used for short trips or nearshore work","zh":"（常指简易的）小船；（多为敞口的）近岸作业/捕鱼小船"},"examples":[{"en":"They rowed out in a dogboat to check the lobster traps.","zh":"他们划着一条小渔船出去查看龙虾笼。"},{"en":"A dogboat is fine for calm water, but it’s not built for rough seas.","zh":"这种小船适合平静水域，但不适合风浪大的海面。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) any small or unimpressive boat","zh":"（非正式）小而不起眼的船；破旧的小船"},"examples":[{"en":"He fixed up an old dogboat and took it out on the lake.","zh":"他把一条旧小破船修了修，就开到湖上去了。"},{"en":"Don’t judge it by its size—this dogboat is surprisingly fast.","zh":"别只看它小——这条小船快得出乎意料。"}]}],"synonyms":["dinghy","skiff","rowboat","small boat"],"phonetic":"/ˈdɔɡˌboʊt/","extraExplanation":["“dogboat”不是非常常见的标准词汇，更常见的对应词是 dinghy（小艇）、skiff（轻舟）、rowboat（划艇）等；在一些沿海地区或口语语境中可能用来指“小型、简陋的工作船/渔船”。","构词上是 dog + boat，但通常不是“给狗坐的船”的意思；更偏向一种带点随意、朴素甚至略贬义的“小船”称呼。"]}
{"word":"dogbodies","summary":{"en":"“Dogbodies” means people who do lots of small, often unpleasant jobs for others (and less commonly, people who meddle in others’ business).","zh":"“dogbodies”指做各种琐碎辛苦杂活的人（较少见也可指爱管闲事的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is paid or expected to do various small, unpleasant, or routine tasks for others; a general helper (often in a low-status role)","zh":"（非正式）杂役；打杂的人；被雇来做各种琐碎、辛苦或例行工作的人（常带有地位较低的意味）"},"examples":[{"en":"In her first job, she felt like a dogbody who only made coffee and copied papers.","zh":"在第一份工作里，她觉得自己就是个打杂的，只会泡咖啡和复印文件。"},{"en":"They hired a dogbody to run errands and clean up after events.","zh":"他们雇了个杂役来跑腿并在活动后收拾场地。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is always interfering in other people’s affairs; a busybody (less common)","zh":"（较少见）爱管闲事的人；多管闲事的人"},"examples":[{"en":"Ignore him—he’s a dogbody who comments on everyone’s choices.","zh":"别理他——他就是个爱管闲事的人，谁的选择都要评头论足。"}]}],"synonyms":["gofer","helper","odd-job person","factotum","busybody"],"phonetic":"/ˈdɔɡˌbɑdiz/","extraExplanation":["“dogbody”更常见于英式英语（BrE）和较老的语体里，语气往往带一点轻视或同情，暗示工作琐碎、辛苦、缺乏认可。","复数形式是“dogbodies”。在职场语境中可近似理解为“跑腿打杂的人”。正式场合建议用更中性的说法，如 “assistant / general helper / support staff”。"]}
{"word":"dogbody","summary":{"en":"A “dogbody” is a person who does lots of small, unpleasant jobs for others; a general gofer.","zh":"dogbody 指替别人做许多琐碎、往往不讨好的杂活的人（跑腿打杂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who does many small, often unpleasant tasks for others; a general helper who does whatever is needed.","zh":"（常带贬义）跑腿打杂的人；做各种杂活、苦差事的人。"},"examples":[{"en":"He started as a dogbody in the office, making copies and delivering mail.","zh":"他刚进办公室时是个打杂跑腿的，负责复印和送邮件。"},{"en":"She didn’t want to be treated like a dogbody, so she asked for clearer responsibilities.","zh":"她不想被当成打杂的，所以要求把职责说清楚。"}]}],"synonyms":["gofer","factotum","lackey","helper","gopher"],"phonetic":"/ˈdɔːɡˌbɑːdi/","extraExplanation":["这个词在英式英语里更常见，语气通常不太客气，暗示“被使唤、被当杂工”。在美式英语中更常用的近义表达有：gofer（跑腿的人）、factotum（杂役/全能助手，较书面）、lackey（走狗/奴才，贬义更强）。","词源上由 dog（狗）+ body（人/家伙）构成，带有把人当“能使唤的家伙”的意味，因此使用时要注意礼貌与场合。"]}
{"word":"dogbolt","summary":{"en":"A dogbolt is a hooked or bent-head bolt used for fastening, common in marine or heavy hardware contexts.","zh":"dogbolt 指一种带钩或弯头的螺栓，用于固定部件，常见于船舶或重型五金场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metal bolt with a bent or hooked head (like a “dog”) used to fasten or hold parts in place, especially in ships, boats, or heavy hardware","zh":"（狗头螺栓）一种头部弯曲或带钩的金属螺栓，用来固定或扣住部件，常见于船舶或重型五金结构"},"examples":[{"en":"The crew replaced a rusted dogbolt on the hatch to make it secure again.","zh":"船员更换了舱盖上生锈的狗头螺栓，使其重新牢固。"},{"en":"Use a dogbolt when you need a fastener that can hook and hold under strain.","zh":"当你需要能“钩住并承受拉力”的紧固件时，可以用狗头螺栓。"}]}],"synonyms":["dog bolt","hook bolt","eye bolt (similar use in some contexts)"],"phonetic":"/ˈdɔɡˌboʊlt/","extraExplanation":["“dogbolt”多见于航海、造船或传统五金语境；日常英语里更常写作两个词：dog bolt。","这里的dog不是“狗”本身，而是来自五金里的“dog”（卡扣/门闩/扣件）这一用法，强调“钩住、扣紧”的形状与功能。"]}
{"word":"dogbush","summary":{"en":"“Dogbush” is a regional common name for a shrub; the exact plant can differ by place.","zh":"dogbush 是某种灌木的地方俗称；具体指哪种植物会因地区而不同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bush or shrub known locally as “dogbush” (a common name that can refer to different plant species in different regions)","zh":"（地方俗称）“dogbush”的灌木/灌丛；属于俗名，不同地区可能指不同的植物"},"examples":[{"en":"We saw a dogbush growing along the fence line.","zh":"我们看到篱笆旁边长着一丛 dogbush。"},{"en":"Ask a local guide which plant they mean by “dogbush,” because the name can vary by region.","zh":"最好问问当地向导他们所说的“dogbush”具体是哪种植物，因为不同地区叫法可能不同。"}]}],"synonyms":["bush","shrub","(sometimes) dogwood (regional)"],"phonetic":"/ˈdɔɡˌbʊʃ/","extraExplanation":["“dogbush”通常不是严格的植物学名称，而是民间/地方用语（common name）。在英语里，很多植物俗名会因地区、文化习惯而对应不同物种；如果需要准确识别，最好结合当地语境、叶形/花/果特征，或使用拉丁学名（scientific name）。"]}
{"word":"dogcart","summary":{"en":"A dogcart is a small, light two-wheeled horse-drawn cart, often mentioned in older British contexts.","zh":"dogcart 指一种小型轻便的两轮马车，多见于较早的英国语境或旧小说中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, light two-wheeled cart (or carriage) pulled by a horse, traditionally used for carrying people or goods.","zh":"（传统）狗车：一种小而轻的两轮马车（或小推车），通常由马拉，用来载人或运货。"},"examples":[{"en":"The farmer drove a dogcart into town with eggs and milk.","zh":"农夫赶着狗车进城，带着鸡蛋和牛奶。"},{"en":"In the novel, they arrived at the inn by dogcart.","zh":"小说里，他们乘狗车到达旅店。"}]}],"synonyms":["cart","carriage","buggy","horse-drawn cart"],"phonetic":"/ˈdɔɡˌkɑrt/","extraExplanation":["“dogcart”里的 dog 并不是指“狗拉车”。它多与早期车具设计有关：一些解释认为这种车最初用于载猎犬（如打猎时带狗），也有人认为名称来自车身形状或当时的俗称。","该词常见于英国历史语境、旧小说或描写乡村生活的文字中；现代英语里更多会用 “cart / carriage / buggy” 等更通用的词。"]}
{"word":"dogcarts","summary":{"en":"“Dogcarts” is the plural of “dogcart,” meaning a light, usually two-wheeled horse-drawn cart (historical/UK).","zh":"“dogcarts”是“dogcart”的复数，指一种轻便的（通常为）两轮马车（多为历史/英式语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light, usually two-wheeled horse-drawn cart (often used in the past for short trips or for carrying people and gear, especially in the UK); plural of “dogcart.”","zh":"一种轻便的（通常为）两轮马车（过去常用于短途出行或运载人和装备，尤其常见于英国）；“dogcart”的复数形式。"},"examples":[{"en":"In the old photograph, two dogcarts are parked outside the inn.","zh":"在那张老照片里，旅馆外停着两辆狗车（轻便两轮马车）。"},{"en":"They arrived at the estate in dogcarts, carrying baskets and blankets.","zh":"他们乘坐狗车来到庄园，还带着篮子和毯子。"}]}],"synonyms":["carriages","carts","horse-drawn carts"],"phonetic":"/ˈdɔɡˌkɑrt/","extraExplanation":["“dogcart”这个词并不是指“狗拉的车”。它最常见的历史含义是“轻便两轮马车”。名称里出现 dog，一种常见解释是：这种车常用于打猎或郊游时，方便携带猎犬（或与猎犬活动相关），因此得名。","在英式历史语境（19世纪、乡村庄园、狩猎/旅行）里更常见；现代英语中多出现在文学作品、历史描写或古董车马语境中。"]}
{"word":"dogcatcher","summary":{"en":"A dogcatcher is someone who catches stray dogs; informally, it can also mean a very low-level, unimportant public job.","zh":"dogcatcher指捕捉流浪狗的人；口语中也可指很基层、无足轻重的公职。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to catch stray dogs and take them to an animal shelter or a city facility.","zh":"捕狗人；抓流浪狗并送往收容所或市政机构的人。"},"examples":[{"en":"The dogcatcher picked up two stray dogs near the park.","zh":"捕狗人在公园附近抓走了两只流浪狗。"},{"en":"If you find a lost dog, you can call the dogcatcher or the local animal shelter.","zh":"如果你发现一只走失的狗，你可以联系捕狗人或当地的动物收容所。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, informal) A low-level, unimportant public job; used to suggest someone has little power or status.","zh":"（引申义，非正式）无足轻重的公职；用来暗示某人权力或地位很低。"},"examples":[{"en":"He said his opponent wasn’t even fit to be a dogcatcher.","zh":"他说他的对手连当个捕狗人都不配。"},{"en":"She started in politics as a small-town dogcatcher and worked her way up.","zh":"她从小镇里一个不起眼的基层公职做起，后来一步步升上去。"}]}],"synonyms":["animal control officer","dog warden","pound worker"],"phonetic":"/ˈdɔɡˌkætʃɚ/","extraExplanation":["“dogcatcher”在美国英语里常带有文化色彩：过去一些小城镇可能真的有“dogcatcher”这种职位，负责处理流浪狗、狂犬病风险等公共卫生问题。后来它也常被用作比喻，表示“最基层、最不体面的小官”。现代更常见的正式说法是“animal control officer（动物管制员）”。"]}
{"word":"dogcatchers","summary":{"en":"Dogcatchers are people who catch stray dogs; informally, the word can also mean very low-level local officials or minor public matters.","zh":"dogcatchers 指捕捉流浪狗的工作人员；口语中也可指非常基层的小官职或鸡毛蒜皮的小事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to catch stray or lost dogs, often for an animal-control agency or shelter.","zh":"捕狗人；（常为动物管理部门或收容所工作）负责捕捉流浪狗、走失狗的工作人员。"},"examples":[{"en":"The dogcatchers picked up several stray dogs after the storm.","zh":"暴风雨过后，捕狗人员带走了几只流浪狗。"},{"en":"If you see an aggressive stray, call animal control rather than trying to catch it yourself.","zh":"如果你看到有攻击性的流浪狗，应该联系动物管理部门，而不是自己去抓。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often humorous) Very small or low-level local officials or jobs, used to suggest limited power or importance.","zh":"（非正式、常带调侃）指很小、很基层的地方官职或工作，暗示权力或重要性不大。"},"examples":[{"en":"He started in politics as a dogcatcher before running for mayor.","zh":"他从“基层小官”做起，后来竞选市长。"},{"en":"The article criticized the government for focusing on dogcatcher issues instead of bigger problems.","zh":"那篇文章批评政府只关注“鸡毛蒜皮的小事”，而不解决更大的问题。"}]}],"synonyms":["animal control officers","dog wardens"],"phonetic":"/ˈdɔɡˌkætʃɚ/","extraExplanation":["“Dogcatcher”在美国语境里常与animal control（动物管理/控制部门）相关。如今很多城市更常用“animal control officer（动物管理员）”来称呼这一类岗位，“dogcatcher”有时带点老派或口语色彩。","“dogcatcher politics/office”是一种带讽刺的说法，用来强调“从最小的地方职位做起”或“事情太小不值得大动干戈”。并不一定真的与抓狗有关。"]}
{"word":"dogdom","summary":{"en":"Dogdom means the world or community of dogs, often used humorously.","zh":"dogdom 指“狗的世界/狗的圈子”，常带幽默色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often humorous) The world, realm, or community of dogs; dogs considered as a group.","zh":"（常带幽默）狗的世界、领域或群体；泛指所有的狗（作为一个整体）。"},"examples":[{"en":"In the small town, her rescue shelter was famous throughout dogdom.","zh":"在这个小镇上，她的救助收容所在“狗狗圈”（dogdom）里很有名。"},{"en":"News spread quickly in dogdom that the new park had a dog-friendly fountain.","zh":"消息在狗狗世界里传得很快：新公园有一座对狗友好的饮水池。"}]}],"synonyms":["the dog world","the canine world","dogs collectively"],"phonetic":"/ˈdɔɡdəm/","extraExplanation":["“dogdom”由 dog + 后缀 -dom 构成。-dom 常表示“领域/状态/群体”（如 kingdom 王国、freedom 自由、officialdom 官场），所以 dogdom 就是“狗的领域/狗的圈子”。","该词较少用于正式写作，多见于幽默、文学化表达或宠物相关的轻松语境，用来把“狗的世界”拟人化。"]}
{"word":"dogdoms","summary":{"en":"“Dogdom(s)” is a humorous, uncommon noun meaning the world or community connected with dogs; “dogdoms” means multiple such dog worlds.","zh":"“dogdom(s)”是一个幽默且不常见的名词，指与狗有关的世界/圈子；“dogdoms”强调有多个不同的狗圈/狗的世界。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Humorous, uncommon) The world, community, or realm of dogs; everything connected with dogs (breeding, shows, owners, culture).","zh":"（幽默/少见）“狗的世界/圈子”；与狗有关的一切（繁育、犬展、狗主人文化等）。"},"examples":[{"en":"In dogdom, a champion title can make a puppy very expensive.","zh":"在“狗圈”里，一个冠军头衔会让幼犬变得非常昂贵。"},{"en":"She’s well known in dogdom for rescuing greyhounds.","zh":"她在狗圈里因救助灵缇而很有名。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form: separate “dog worlds” or dog-related communities in different places or groups.","zh":"复数：不同地区或群体里的“狗的圈子/狗的世界”。"},"examples":[{"en":"Online forums and local clubs can feel like different dogdoms.","zh":"线上论坛和本地俱乐部会让人感觉像不同的“狗圈”。"}]}],"synonyms":["the dog world","the dog community","dog culture","the canine world"],"phonetic":"/ˈdɔɡˌdɑm/","extraExplanation":["“dogdom”由 dog + 后缀 -dom 组成，-dom 表示“领域/状态/群体”，常见于 kingdom（王国）、freedom（自由）、officialdom（官场/官僚圈）。因此 dogdom 多带一点俏皮或讽刺的语气，指“狗的领域/狗圈”。","“dogdoms”是复数，用来强调存在多个不同的“狗圈/狗的世界”（比如不同城市的犬舍圈、不同犬种社群、线上与线下社群）。"]}
{"word":"Doge","summary":{"en":"“Doge” most commonly means the Shiba Inu internet meme (“such wow”), and it can also mean the historical title “Doge” (chief ruler) of Venice.","zh":"“Doge”最常指柴犬网络迷因（如 such wow 的梗图语气）；也可指历史上的“威尼斯总督”等城邦最高统治者称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an internet meme featuring a Shiba Inu dog (often with colorful text in intentionally broken English, e.g., “such wow”) and, by extension, anything related to that meme (including Dogecoin culture)","zh":"“Doge”网络迷因：以柴犬为主角、配上彩色且刻意“错误英语”（如 such wow）的梗图；也可泛指与该迷因相关的事物（含狗狗币文化）"},"examples":[{"en":"That picture is classic Doge—such wow.","zh":"那张图是经典 Doge 梗——太“wow”了。"},{"en":"Doge memes were everywhere in the early 2010s.","zh":"在2010年代初期，Doge 梗图到处都是。"},{"en":"He posts Doge-style captions on his dog’s photos.","zh":"他会在狗的照片上配“Doge 风格”的文字。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical title for the chief ruler of Venice (and some other Italian city-states)","zh":"（历史）“总督”：威尼斯（及部分意大利城邦）最高统治者的称号"},"examples":[{"en":"The Doge of Venice was an important political figure.","zh":"威尼斯总督是重要的政治人物。"},{"en":"We learned about the Doge in European history class.","zh":"我们在欧洲历史课上学到了“总督”。"}]}],"synonyms":["Shiba Inu meme","meme dog","Doge of Venice","chief magistrate (historical context)"],"phonetic":"/doʊdʒ/","extraExplanation":["网络用法中，“Doge”最早源自一只柴犬（昵称 Kabosu）的照片走红，2013年前后形成固定的“Doge 语体”：常用 such/much/very + 名词（故意不按标准语法），以及结尾的 wow。","在加密货币语境里，Doge 常与 Dogecoin（狗狗币）文化相连，但“Doge”本身首先指这个迷因形象与表达方式。","历史用法的 Doge 来自意大利语（如 Venice 的总督），与网络迷因只是拼写相同、含义无关。"]}
{"word":"doge","summary":{"en":"“Doge” most commonly means the Shiba Inu internet meme; it can also refer to the historic leader of Venice (the Doge).","zh":"“Doge”最常见指柴犬网络迷因；也可指历史上的威尼斯总督（Doge）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an internet meme featuring a Shiba Inu dog, usually paired with humorous short phrases in broken English (e.g., “such wow,” “much happy”)","zh":"“Doge”网络迷因：常见为柴犬表情图，配上故意不规范的短句（如“such wow / much happy”）来搞笑"},"examples":[{"en":"That picture became a Doge meme almost overnight.","zh":"那张图几乎一夜之间就变成了Doge迷因。"},{"en":"People captioned the Doge photo with phrases like “much fun” and “very cool.”","zh":"人们给Doge照片配文，比如“much fun”“very cool”之类。"}]},{"partOfSpeech":"n.","definition":{"en":"a chief magistrate (leader) in some historic Italian city-states, especially Venice","zh":"（历史）意大利部分城邦的最高执政官，尤指威尼斯的总督（Doge）"},"examples":[{"en":"The Doge of Venice was an important political figure for centuries.","zh":"威尼斯总督在几个世纪里都是重要的政治人物。"},{"en":"The palace was built for the Doge and the Venetian government.","zh":"这座宫殿是为总督及威尼斯政府建造的。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, old-fashioned) to dodge; to avoid something","zh":"（罕见、古旧）躲闪；回避（同 dodge）"},"examples":[{"en":"In older texts, you may see “doge” used where modern English would use “dodge.”","zh":"在一些较老的文本里，你可能会看到“doge”用于现代英语会写“dodge”的位置。"}]}],"synonyms":["meme","Shiba Inu meme","Venetian doge","duke (historical context)","dodge (rare verb sense)"],"phonetic":"/doʊdʒ/","extraExplanation":["网络用法的“Doge”在2010年代初走红，典型特征是柴犬表情配上故意“语法不太对”的短句（如“such wow”“very amaze”）。这种写法模仿一种天真、兴奋的内心独白，所以常用来表达夸张的赞叹或反差式幽默。","历史上的“Doge”一词与拉丁语“dux（领袖）”有关。英语里常专指威尼斯总督（Doge of Venice），在欧洲历史与艺术（如威尼斯总督府）语境中会出现。"]}
{"word":"dogear","summary":{"en":"Dog-ear means to fold down a page corner, or the folded corner itself, usually to mark a place in a book.","zh":"dog-ear 指把书页角折下来（做标记），也指折起的页角本身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fold down the corner of a page (usually to mark your place)","zh":"把书页（通常是角）折下来（多用于做记号、标记读到哪里）"},"examples":[{"en":"Please don’t dog-ear the pages—use a bookmark.","zh":"请不要把书页折角——用书签吧。"},{"en":"I dog-eared the recipe page so I could find it quickly.","zh":"我把食谱那一页折了角，方便我快速找到。"}]},{"partOfSpeech":"n.","definition":{"en":"a folded-down corner of a page; a mark showing a page has been turned down","zh":"（书页的）折角；折起的页角（用来标记）"},"examples":[{"en":"The old paperback was full of dog-ears.","zh":"那本旧平装书到处都是折角。"},{"en":"There was a dog-ear on chapter five, like someone stopped reading there.","zh":"第五章有个折角，像是有人读到那里就停了。"}]}],"synonyms":["fold down (a corner)","turn down (a page corner)","crease (a page corner)","bookmark (as an alternative)"],"phonetic":"/ˈdɔɡˌɪr/","extraExplanation":["“dog-ear”常写作dog-ear（动词或形容词用法）或dogear（较少见的连写），指页面角像狗的耳朵一样折下来。","在英语文化里，把书页折角通常被视为“会损坏书”的习惯；在图书馆或借书时尤其不礼貌，因此常用bookmark（书签）替代。"]}
{"word":"dogeared","summary":{"en":"“Dogeared” means having (or making) page corners folded or worn from frequent use.","zh":"“dogeared”指书页角被折起或因常翻阅而磨损起角；也可作动词表示把书页折角。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a book, paper, or document) having corners folded down or worn, usually from frequent use.","zh":"（书、纸张或文件的）页角折起的；（因常翻阅而）磨损起角的。"},"examples":[{"en":"I borrowed a dog-eared paperback from the library.","zh":"我从图书馆借了一本页角都折起的平装书。"},{"en":"His dog-eared notebook was full of ideas.","zh":"他那本页角折起的笔记本里写满了点子。"}]},{"partOfSpeech":"vt.","definition":{"en":"To fold down or wear the corner of (a page) by repeated handling.","zh":"把（书页）折角；把（页角）弄得起皱磨损。"},"examples":[{"en":"Try not to dog-ear the pages—use a bookmark.","zh":"尽量别把书页折角——用书签吧。"},{"en":"She dog-eared the recipe so she could find it quickly.","zh":"她把食谱那一页折了角，方便快速找到。"}]}],"synonyms":["worn","tattered","well-thumbed","creased"],"phonetic":"/ˈdɔːɡɪrd/","extraExplanation":["“dog-eared”字面意思是“像狗的耳朵一样”，因为折起的页角看起来像下垂的耳朵。常见搭配有：dog-eared copy（翻旧/折角的那本）、dog-eared pages（折角的书页）。","语气上通常是中性到略带亲切：强调“常用、翻得多”，不一定是“脏”或“破”。正式场合更常用“crease/creased corners（折痕的角）”。"]}
{"word":"dogears","summary":{"en":"Dogears are folded page corners; to dogear a page means folding the corner to mark your place.","zh":"dogears 指书页折角；to dogear 表示把书页角折下来做记号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) folded-down corners of a page, usually in a book, made to mark a place or because of wear.","zh":"（复数）书页（或纸张）被折下来的角，常用来做书签或因翻阅磨损而形成。"},"examples":[{"en":"My old textbook is full of dogears from years of studying.","zh":"我那本旧课本因为多年学习，满是折角。"},{"en":"The library copy had dogears on almost every chapter.","zh":"那本图书馆的书几乎每一章都有折角。"}]},{"partOfSpeech":"v.","definition":{"en":"to fold down the corner of a page to mark it (often seen as careless or disrespectful to books).","zh":"把书页（或纸张）的角折下来当作记号（常被认为不爱惜书）。"},"examples":[{"en":"Please don’t dogear the pages—use a bookmark.","zh":"请别折书角——用书签吧。"},{"en":"I dogeared page 42 so I could find the quote later.","zh":"我把第42页折了角，方便之后找到那句引用。"}]}],"synonyms":["turned-down corners","folded corners","page fold"],"phonetic":"/ˈdɔɡɪrz/","extraExplanation":["更常见的写法是 dog-ear（动词）和 dog-eared（形容词，表示“卷角的/旧旧的”），名词常写作 dog-ear 或复数 dog-ears。你输入的 dogears 属于不带连字符的写法，也能看懂，但在正式写作中建议用连字符。","这个说法来自“像狗的耳朵一样耷拉/折下”的形象比喻。英语里有时会用 dog-eared book 形容一本书“翻得很旧、边角卷曲”，语气通常中性或带一点亲切感。"]}
{"word":"dogedom","summary":{"en":"Dogedom means the office/power of a doge, or the territory ruled by a doge (especially in historic Venice).","zh":"Dogedom 指“总督（Doge）的职位与权力”，也可指“总督统治的领地”（尤指历史上的威尼斯等城邦）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, authority, or rule of a doge (the elected chief magistrate in historic Italian city-states such as Venice and Genoa)","zh":"（历史上威尼斯、热那亚等意大利城邦的）总督（Doge）的职位、权力或统治"},"examples":[{"en":"The stability of Venice depended partly on the institutions of the dogedom.","zh":"威尼斯的稳定在一定程度上取决于总督制度。"},{"en":"He studied how the dogedom balanced noble families and public authority.","zh":"他研究总督如何在贵族家族与公共权力之间取得平衡。"}]},{"partOfSpeech":"n.","definition":{"en":"the territory or state governed by a doge; a doge’s domain","zh":"由总督统治的领地；总督的辖域"},"examples":[{"en":"Trade routes connected the dogedom to ports across the Mediterranean.","zh":"贸易航线把这个总督辖域与地中海各港口连接起来。"},{"en":"In the novel, the hero travels beyond the dogedom to seek allies.","zh":"在小说里，主人公走出总督辖域去寻求盟友。"}]}],"synonyms":["dukedom","kingdom","realm","domain","rule"],"phonetic":"/ˈdoʊdʒdəm/","extraExplanation":["“dogedom”由“doge（总督）+ -dom（……的地位/统治/领域）”构成，类似的结构还有“kingdom（王国）”“dukedom（公国）”。","Doge是中世纪到近代早期意大利海上共和国（尤其是威尼斯）的一种选举产生的最高官职；因此“dogedom”多见于历史写作、学术文章或历史小说，日常英语中很少使用。"]}
{"word":"dogedoms","summary":{"en":"“Dogedoms” is the plural of “dogedom,” meaning the office/term of a doge or the territory ruled by a doge in historical Italian city-states (especially Venice).","zh":"“dogedoms”是“dogedom”的复数，指历史上意大利城邦（尤指威尼斯）总督的职位/任期，或由总督统治的政体与领地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, rank, or term of a doge (a chief magistrate in historical Italian city-states such as Venice or Genoa).","zh":"总督（Doge）的职位、地位，或其在任期间（尤指历史上威尼斯、热那亚等意大利城邦的总督）。"},"examples":[{"en":"During his dogedom, Venice expanded its influence through trade.","zh":"在他担任总督期间，威尼斯通过贸易扩大了影响力。"},{"en":"Historians debate whether this reform weakened the dogedom or made it more stable.","zh":"历史学家争论这项改革是削弱了总督职位，还是让它更稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"the territory or state governed by a doge; the doge’s domain.","zh":"由总督统治的领地或政体；总督的统治范围。"},"examples":[{"en":"The dogedom of Venice became a major Mediterranean power.","zh":"威尼斯的总督政体成为地中海的重要强权。"},{"en":"Rival cities feared the growing dogedoms along the coast.","zh":"沿海日益壮大的几个总督政体令对手城市感到担忧。"}]}],"synonyms":["the office of the doge","dogareship (rare)","doge’s rule","Venetian republic (context-specific)"],"phonetic":"/ˈdoʊdʒdəm/","extraExplanation":["“Doge”一词源自拉丁语 *dux*（领袖、统帅），与英语里的 *duke*（公爵）同源。在威尼斯共和国中，总督是最高官员之一，但其权力受到贵族议会与复杂制度的制衡。","“dogedom(s)”多见于历史写作与学术语境，日常英语里并不常用；更常见的表达是 *the office of the doge*（总督职位）或直接说 *Venice under the doge*（总督统治下的威尼斯）。","文学与历史叙事中提到威尼斯时，常会出现总督形象（如“威尼斯总督宫”Doge’s Palace），用来营造政治与海洋帝国的氛围。"]}
{"word":"dogeless","summary":{"en":"Dogeless means “without a dog” or, informally online, “not related to Doge/Dogecoin.”","zh":"Dogeless 指“没有狗的；缺少狗的”，在网络上也可指“与Doge梗/狗狗币无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without a dog; lacking dogs.","zh":"没有狗的；缺少狗的。"},"examples":[{"en":"The apartment is dogeless, so you don’t have to worry about barking.","zh":"这间公寓没有狗，所以你不用担心狗叫。"},{"en":"After moving to the city, his life felt strangely dogeless.","zh":"搬到城市后，他的生活莫名变得“没有狗”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(internet, informal) not related to “Doge” or Dogecoin; lacking the Doge meme style.","zh":"（网络，非正式）与“Doge”梗或狗狗币无关的；没有Doge风格的。"},"examples":[{"en":"This crypto chat is dogeless today—no one is talking about Dogecoin.","zh":"今天这个加密货币群有点“dogeless”——没人聊狗狗币。"},{"en":"I prefer a dogeless timeline with fewer memes.","zh":"我更喜欢一个“dogeless”的时间线，少点梗图。"}]}],"synonyms":["dog-free","without a dog","non-Doge (informal)"],"phonetic":"ˈdɔːɡləs","extraExplanation":["“-less”是英语里很常见的后缀，表示“没有……/缺少……”，如 homeless（无家可归的）、childless（没有孩子的）、sugarless（无糖的）。因此 dogeless 直观上就是“没有狗的”。","dogeless 并不是非常常见的标准词，更常见的表达是 dog-free（无狗的）或 without a dog（没有狗）。","在网络语境中，有人会把 Doge（柴犬表情包/梗）或 Dogecoin（狗狗币）当作词根来玩梗，用 dogeless 表示“没有Doge相关内容”。这种用法偏口语/圈内。"]}
{"word":"doges","summary":{"en":"“Doges” is usually the plural of “doge,” meaning a historical ruler in Venice/Genoa; in internet slang it can also mean multiple “Doge” meme characters.","zh":"“doges”通常是“doge”的复数，指威尼斯/热那亚等城邦的历史执政官；在网络语境中也可指多个“Doge”柴犬表情包形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of doge: a chief magistrate in the old Italian republics of Venice and Genoa (historical title).","zh":"doge 的复数：旧时意大利城邦（如威尼斯、热那亚）的最高执政官（历史称号）。"},"examples":[{"en":"The doges of Venice were elected for life, but their power was limited by councils.","zh":"威尼斯的总督（doges）通常终身当选，但权力受到议会机构的限制。"},{"en":"Many portraits of Venetian doges hang in the Doge’s Palace.","zh":"总督宫里悬挂着许多威尼斯总督（doges）的肖像。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, Internet) plural of Doge: the Shiba Inu “Doge” meme character; sometimes also used for people who strongly identify with that meme.","zh":"（非正式，网络）Doge 的复数：柴犬“Doge”表情包形象；有时也指很沉迷/认同该梗的人。"},"examples":[{"en":"The chat was full of doges saying, “much wow,” after the surprise announcement.","zh":"突发消息一出，聊天区满是“doges”刷着“much wow”等梗。"},{"en":"Old memes come back, and suddenly there are doges everywhere again.","zh":"老梗又火了，突然到处都是“doges”。"}]}],"synonyms":["Venetian rulers","chief magistrates","(Internet) Doge memes"],"phonetic":"/doʊdʒ/","extraExplanation":["“Doge”（威尼斯总督）一词来自拉丁语 *dux*（领袖），与英语中的 *duke*（公爵）同源。","网络梗“Doge”起源于一只柴犬的照片（2010年前后在网上走红），常见的故意“蹩脚英语”式配文如 “such… / much… / very…”；后续也影响了加密货币 Dogecoin 的文化语境。"]}
{"word":"dogeship","summary":{"en":"Dogeship means the office or the period of rule of a doge, the historical elected leader of Venice or Genoa.","zh":"Dogeship 指（威尼斯或热那亚历史上的）总督的职位、权力或在位时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, authority, or time in power of a doge (the elected leader of Venice or Genoa in the past)","zh":"（历史上威尼斯或热那亚的）总督（Doge）的职位、权力范围，或其在位时期"},"examples":[{"en":"During his dogeship, Venice expanded its influence in Mediterranean trade.","zh":"在他担任总督期间，威尼斯扩大了在地中海贸易中的影响力。"},{"en":"The historian compared different dogeships to show how leadership styles changed over time.","zh":"这位历史学家比较了不同总督的在位时期，以展示领导风格如何随时间变化。"}]}],"synonyms":["tenure","reign","term of office"],"phonetic":"/ˈdoʊdʒˌʃɪp/","extraExplanation":["“dogeship”由“doge（总督）+ -ship”构成；“-ship”常用来表示“身份/职位/状态/任期”（如 kingship 王位、leadership 领导地位）。因此 dogeship 指“总督的职位或任期”。","Doge 是中世纪到近代早期威尼斯共和国、热那亚共和国的选举产生的最高执政者称号，词源与拉丁语 dux（领袖、统帅）有关。这个词多见于历史写作或文学语境，日常英语中很少使用。","文学/历史文本中常与 Venice（威尼斯）、republic（共和国）、election（选举）、Senate（元老院/参议院）等词共现。"]}
{"word":"dogeships","summary":{"en":"“Dogeships” is the plural of “dogeship,” meaning the office or term of a doge, especially in Venice.","zh":"“dogeships”是“dogeship”的复数，指（尤其威尼斯的）总督的职位/权力或其在位任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, position, or authority of a doge (the elected chief magistrate in some Italian city-states, especially Venice); also, the period of time a doge holds that office","zh":"（意大利某些城邦中）总督（Doge）的职位、权力或任期；也指总督在位的那段时间"},"examples":[{"en":"Venice’s political stability depended on rules that limited the dogeship.","zh":"威尼斯的政治稳定依赖于限制总督权力的制度。"},{"en":"During his dogeship, trade agreements expanded across the Mediterranean.","zh":"在他的总督任期内，地中海范围内的贸易协定得到扩展。"}]}],"synonyms":["office","tenure","rule","administration"],"phonetic":"/ˈdoʊdʒʃɪps/","extraExplanation":["“dogeship”由“doge（总督）+ -ship（表示身份、职位或状态的后缀，如 friendship, leadership）”构成；“dogeships”是其复数形式。","Doge 最常见于威尼斯共和国（也见于热那亚等地）。在英语历史写作中，“dogeship”多用于讨论制度、权力边界或具体某位总督的在位时期。"]}
{"word":"dogey","summary":{"en":"“Dogey” is uncommon; it’s usually a misspelling of “doggy/doggie,” meaning “dog-related/like a dog,” or (rarely) “smelling like a dog.”","zh":"“dogey”不常见，多为“doggy/doggie”的误拼，意思是“与狗有关/像狗一样”，或（较少）“有狗味”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon; usually a misspelling of “doggy/doggie”) relating to a dog; like a dog; sometimes used as a cute way to say “dog.”","zh":"（不常见；多为“doggy/doggie”的误拼）与狗有关的；像狗一样的；有时也作可爱说法指“狗狗”。"},"examples":[{"en":"My niece calls every puppy a “dogey.”","zh":"我外甥女把每只小狗都叫“dogey（狗狗）”。"},{"en":"That’s a doggy toy (not “dogey” in standard spelling).","zh":"那是狗狗的玩具（标准拼写一般不是“dogey”）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) having a dog-like smell; a bit smelly, like a dog.","zh":"（罕见）有狗味的；有点像狗一样的味道（偏口语、非标准）。"},"examples":[{"en":"After the rain, the wet fur smelled kind of doggy.","zh":"下雨后，湿毛有点狗味。"}]}],"synonyms":["doggy","doggie","canine-like"],"phonetic":"/ˈdɔɡi/","extraExplanation":["“dogey”不是常见标准拼写；最常见的是“doggy/doggie”。“doggy”既可作形容词（doggy smell/toy），也可作名词（a doggy = 一只狗狗，偏童语/可爱语气）。如果你是在正式写作或考试中使用，建议用“doggy”或直接用“dog”。"]}
{"word":"dogeys","summary":{"en":"“Doge” most commonly means either (1) the historical ruler of Venice/Genoa, or (2) the Shiba Inu internet meme.","zh":"“Doge”最常见有两种意思：（1）威尼斯/热那亚的历史统治者（总督）；（2）柴犬网络迷因（Doge梗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The chief ruler of Venice or Genoa in the Middle Ages and Renaissance.","zh":"（历史）威尼斯或热那亚在中世纪与文艺复兴时期的最高统治者（总督）。"},"examples":[{"en":"The Doge of Venice lived in the Doge’s Palace.","zh":"威尼斯总督住在总督宫。"},{"en":"The council advised the doge on important decisions.","zh":"议会在重大决策上为总督提供建议。"}]},{"partOfSpeech":"n.","definition":{"en":"(internet slang) A popular meme image of a Shiba Inu dog, often with humorous, broken-English captions like “such wow.”","zh":"（网络俚语）“Doge”梗：一只柴犬的流行表情/迷因，常配上搞笑的“碎英语”字幕，如“such wow（太惊艳了）”。"},"examples":[{"en":"That doge meme is still all over social media.","zh":"那个Doge表情到现在还在社交媒体上到处都是。"},{"en":"He posted a photo of his dog with doge-style text: “much cute.”","zh":"他发了狗的照片，还配了Doge风格的字：“much cute（超可爱）”。"}]}],"synonyms":["Venetian ruler","meme"],"phonetic":"/doʊdʒ/","extraExplanation":["“dogeys”不是常见标准拼写；如果你想表达“doge”的复数，通常写作“doges”。在网络语境里也有人随意拼成“dogeys”，但更像是非正式/误拼。"]}
{"word":"dogface","summary":{"en":"A U.S. slang word meaning an ordinary infantry soldier; it can also be an insulting term for someone with an ugly face.","zh":"美式俚语：常指普通步兵/大头兵；也可作侮辱性说法指长相难看的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, chiefly U.S.) An ordinary soldier, especially an infantryman; a “grunt.”","zh":"（俚语，主要为美式）普通士兵，尤指步兵；相当于“步兵小兵/大头兵（grunt）”。"},"examples":[{"en":"In World War II movies, the dogfaces are usually the infantrymen on the front line.","zh":"在二战题材电影里，dogface 通常指在前线作战的步兵。"},{"en":"He wrote letters home like many dogfaces—tired, muddy, but determined.","zh":"他像许多普通士兵一样给家里写信——疲惫、满身泥泞，但很坚定。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, often rude) A person with an ugly or unpleasant-looking face.","zh":"（非正式，常带冒犯）长相难看或让人不舒服的人。"},"examples":[{"en":"Calling someone a “dogface” is insulting, so it’s better to avoid it.","zh":"把别人叫作“dogface”很侮辱人，所以最好避免这样说。"},{"en":"The nickname sounded harsh, and she asked him not to use it.","zh":"这个外号听起来很刻薄，她请他不要再用。"}]}],"synonyms":["infantryman","grunt","GI","soldier","ugly mug (rude)"],"phonetic":"ˈdɔːɡfeɪs","extraExplanation":["“dogface”作为“普通步兵”的意思在二战时期的美军语境里很常见，带有自嘲或同袍之间的口吻；也出现在歌曲《The Dogface Soldier》中。","注意语气：当它用来形容长相时通常是贬损、冒犯性的；在现代日常交流中更建议用中性表达（如“looks tired/rough”）来描述外貌状态。"]}
{"word":"dogfaces","summary":{"en":"Dogfaces means ordinary soldiers (especially infantry); it can also be a rude insult about someone’s appearance.","zh":"dogfaces 指普通士兵（尤指步兵）；也可作形容外貌的粗鲁辱骂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Soldiers, especially ordinary infantry soldiers; a self-deprecating nickname for common troops.","zh":"（非正式）士兵，尤指普通步兵；对基层士兵的一种带自嘲意味的称呼。"},"examples":[{"en":"During the war, the dogfaces slept in muddy foxholes and marched for miles.","zh":"战争期间，这些普通步兵睡在泥泞的散兵坑里，还要行军好几英里。"},{"en":"He said he was just one of the dogfaces, not an officer.","zh":"他说自己只是个普通大头兵，不是军官。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, often derogatory) People with unattractive faces; used as an insult.","zh":"（俚语，常带贬义）长相不好看的人；用作辱骂。"},"examples":[{"en":"Please don’t call people dogfaces—it’s rude and hurtful.","zh":"请不要叫别人“狗脸”——这很粗鲁也很伤人。"},{"en":"Online comments sometimes use words like “dogfaces” to bully others.","zh":"网上评论有时会用“dogfaces”这类词来霸凌他人。"}]}],"synonyms":["infantrymen","grunts","GIs","foot soldiers","troops"],"phonetic":"/ˈdɔɡˌfeɪsɪz/","extraExplanation":["“dogface”在二战语境中很常见，尤其指美国陆军的普通步兵。它既可表达艰苦作战的一线身份，也带点自嘲与团结感。美国歌手Bing Crosby在1943年的军旅歌曲《The Dogface Soldier》中推广了这个称呼。注意：离开军事语境时，用来形容外貌通常很冒犯。"]}
{"word":"dogfall","summary":{"en":"Dogfall means a draw or deadlock, or (in wrestling) a fall where both go down together.","zh":"dogfall 指平局/僵局；也可指（摔跤中）双方同时倒地的一次同倒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a draw or deadlock; a situation where neither side wins (often after a hard struggle).","zh":"平局；僵持不下的局面（常指激烈对抗后谁也没赢）。"},"examples":[{"en":"After hours of negotiations, the two sides were in a dogfall.","zh":"谈了好几个小时，双方还是陷入僵局。"},{"en":"The debate ended in a dogfall—no one changed their mind.","zh":"辩论以平局收场——谁也没被说服。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in wrestling) a fall in which both opponents go down together, so no clear winner is decided.","zh":"（尤指摔跤）双方同时倒地的一次“同倒”，因此无法判定胜负。"},"examples":[{"en":"The first round was a dogfall, and the referee restarted them.","zh":"第一回合双方同倒，裁判让他们重新开始。"},{"en":"They struggled for position until it turned into a dogfall.","zh":"他们一直争夺位置，最后变成同倒。"}]}],"synonyms":["draw","tie","stalemate","deadlock","impasse"],"phonetic":"/ˈdɔɡˌfɔl/","extraExplanation":["“dogfall”是比较少见、偏英式/旧用法的词，常出现在较老的体育语境（如摔跤）或比喻性写作中，表示“拼得很凶但谁也没赢”的结果。现代英语里更常用的表达有：a draw, a tie, a stalemate, a deadlock。"]}
{"word":"dogfennel","summary":{"en":"Dogfennel is a tall, strong-smelling wild plant, often treated as a weed, common in the southeastern U.S.","zh":"Dogfennel（狗茴香）是一种气味浓烈、常被当作杂草的高大野生植物，在美国东南部常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall, strong-smelling wild plant (often considered a weed) with thin leaves, common in the southeastern U.S.; it can irritate skin and is sometimes used in folk remedies or as an insect-repellent plant","zh":"一种高大、气味浓烈的野生植物（常被视为杂草），叶片细长，常见于美国东南部；可能刺激皮肤，也有时用于民间草药或驱虫用途"},"examples":[{"en":"Dogfennel grew along the roadside and made the air smell sharp and bitter.","zh":"狗茴香沿着路边长了一片，空气里都是刺鼻而微苦的气味。"},{"en":"Wear gloves if you pull dogfennel, because some people get skin irritation.","zh":"拔狗茴香时最好戴手套，因为有些人会出现皮肤刺激。"},{"en":"The farmer treated the pasture to control dogfennel before it spread.","zh":"农场主在它扩散前处理了牧场，以控制狗茴香的生长。"}]}],"synonyms":["weed (in context)","wild herb (general)"],"phonetic":"/ˈdɔːɡˌfɛnəl/","extraExplanation":["“Dogfennel”通常指北美的一种菊科植物（常见学名：*Eupatorium capillifolium*）。名字里虽然有“fennel（茴香）”，但它并不是真正的食用茴香，只是叶形细、气味强而得名。","它在英语里常作为一个不可数/可数名词使用：可以说 “There is dogfennel in the field.”（地里有狗茴香），也可以说 “Several dogfennels…”（几株狗茴香）。园艺或农业语境中常把它当作“weed（杂草）”来讨论。"]}
{"word":"dogfight","summary":{"en":"“Dogfight” most commonly means an aerial battle between fighter planes; it can also mean a fight between dogs (often illegal).","zh":"“dogfight”最常指战斗机之间的空战；也可指狗打架，尤其是非法斗狗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fight between dogs, sometimes organized illegally.","zh":"狗与狗之间的打斗；有时指（非法的）斗狗。"},"examples":[{"en":"The police shut down an illegal dogfight.","zh":"警方取缔了一场非法斗狗活动。"},{"en":"Dogfights are cruel and are banned in many places.","zh":"斗狗很残忍，在许多地方被禁止。"}]},{"partOfSpeech":"n.","definition":{"en":"An aerial battle between fighter planes (or, more generally, a close, fast fight between aircraft).","zh":"（战斗机之间的）空战；也可泛指飞机之间近距离、快速的交战。"},"examples":[{"en":"The pilot described a dogfight over the sea.","zh":"飞行员描述了在海上空战的经历。"},{"en":"The movie’s dogfight scenes were intense.","zh":"那部电影的空战场面很紧张。"}]},{"partOfSpeech":"v.","definition":{"en":"To fight in the air in fighter planes; to engage in an aerial battle.","zh":"进行空战；（战斗机）在空中交战。"},"examples":[{"en":"Two squadrons dogfought for control of the sky.","zh":"两支中队为争夺制空权展开空战。"}]}],"synonyms":["aerial combat","air battle","scrap","brawl"],"phonetic":"/ˈdɔɡˌfaɪt/","extraExplanation":["“dogfight”在20世纪初开始被用来形容战斗机近距离缠斗，可能是因为这种追逐、咬合式的空中格斗让人联想到狗打架的场面。","在日常使用中，这个词有强烈的负面色彩（尤其指“斗狗”时），在新闻或社会话题里常与动物保护、违法犯罪相关。"]}
{"word":"dogfighting","summary":{"en":"Dogfighting means the illegal practice of making dogs fight, often linked to cruelty and gambling.","zh":"dogfighting 指（通常非法的）斗狗行为，常与虐待动物和赌博相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the illegal activity of forcing dogs to fight each other, usually for gambling or entertainment","zh":"（通常非法的）斗狗：强迫狗互相撕咬打斗，常与赌博或取乐有关"},"examples":[{"en":"Dogfighting is illegal in all U.S. states.","zh":"斗狗在美国所有州都是非法的。"},{"en":"The police rescued several dogs from a dogfighting ring.","zh":"警方从一个斗狗团伙中救出了几只狗。"}]}],"synonyms":["illegal dog fights","animal fighting"],"phonetic":"/ˈdɔɡˌfaɪtɪŋ/","extraExplanation":["“dogfighting”在现实语境里几乎总是负面词，指虐待动物与犯罪活动；新闻中常见搭配有 dogfighting ring（斗狗团伙/窝点）、animal cruelty（虐待动物）、raid（突袭/搜查）。","英语里“dogfight”（一词）还有“空战”的意思（尤其指战斗机近距离缠斗），但“dogfighting”这个形式在日常中更常被理解为“斗狗”。若要表达“空战”，更常说 aerial dogfight 或 dogfighting in the air。"]}
{"word":"dogfights","summary":{"en":"Dogfights are aerial battles between fighter planes; informally, the word can also mean any fierce, close competition.","zh":"dogfights 指战斗机之间的空中格斗；口语中也可指任何非常激烈、胶着的竞争。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fight between fighter aircraft in the air (an aerial battle).","zh":"（战斗机之间的）空中近距离格斗；空战。"},"examples":[{"en":"The pilots got into a dogfight over the coastline.","zh":"飞行员们在海岸线上空展开了一场空中格斗。"},{"en":"During the war, dogfights were often decided in seconds.","zh":"在战争中，空战的胜负往往在几秒内决定。"}]},{"partOfSpeech":"n.","definition":{"en":"A very intense and competitive struggle between people or groups (used informally).","zh":"（非正式）激烈的竞争或争斗。"},"examples":[{"en":"The election turned into a dogfight in the final week.","zh":"选举在最后一周变成了一场激烈的拉锯战。"},{"en":"It was a dogfight for first place all season.","zh":"整个赛季争夺第一名都非常激烈。"}]},{"partOfSpeech":"vi.","definition":{"en":"To fight in the air, especially in close combat between fighter aircraft.","zh":"进行空中近距离格斗；空战。"},"examples":[{"en":"The two jets dogfought above the city.","zh":"两架喷气式战机在城市上空进行空战。"}]}],"synonyms":["aerial combat","air battle","close combat","duel","battle","showdown"],"phonetic":"/ˈdɔɡˌfaɪt/","extraExplanation":["“dogfight”最初指斗狗（狗与狗的打斗），后来在一战、二战时期被借用来形容战斗机在空中近距离盘旋、缠斗的场景。现代英语里也常借喻为“非常胶着的竞争”。"]}
{"word":"dogfish","summary":{"en":"A dogfish is a small shark, often the spiny dogfish, found in coastal waters.","zh":"dogfish 指一种小型鲨鱼，常指刺狗鲨，多见于近海水域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small type of shark (often with sharp spines in front of its dorsal fins), commonly found in coastal waters; sometimes used as food","zh":"狗鲨；小型鲨鱼（常在背鳍前有尖刺），多见于近海；有时可食用"},"examples":[{"en":"Spiny dogfish are common in the North Atlantic.","zh":"刺狗鲨在北大西洋很常见。"},{"en":"The fisherman pulled a dogfish from the net and carefully removed the hook.","zh":"渔民从网里拉出一条狗鲨，小心地把鱼钩取下。"}]}],"synonyms":["spiny dogfish","small shark"],"phonetic":"/ˈdɔɡˌfɪʃ/","extraExplanation":["“dogfish”是复合词（dog + fish），历史上“dog”常用于给动物起带点贬义或强调“凶/咬人”的名字，并不表示它和狗有亲缘关系。","在英国等地，“dogfish”有时也会被用作更宽泛的口语称呼，指几种较小的鲨鱼；但在科学/渔业语境里常特指“刺狗鲨”（spiny dogfish）。"]}
{"word":"dogfishes","summary":{"en":"“Dogfishes” means more than one dogfish—small sharks commonly found near coasts.","zh":"“Dogfishes”指不止一条狗鲨——常见于沿海海域的小型鲨鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of dogfish: a type of small shark (often from the spiny dogfish group) found in many coastal waters.","zh":"dogfish 的复数：一种体型较小的鲨鱼（常指刺狗鲨一类），分布于许多沿海海域。"},"examples":[{"en":"Fishermen reported many dogfishes near the harbor this winter.","zh":"渔民说这个冬天港口附近有很多狗鲨。"},{"en":"The nets brought up dogfishes along with other small fish.","zh":"渔网除了其他小鱼，也捞上来一些狗鲨。"}]}],"synonyms":["spiny dogfish","small sharks"],"phonetic":"/ˈdɔɡˌfɪʃ/","extraExplanation":["“dogfish”在英语里既可作可数名词（a dogfish / dogfishes），也常被当作集合概念使用（dogfish 作复数不变也有人用），但在现代写作中“dogfishes”作为复数是常见且清晰的表达。","在北美语境中，人们提到的 dogfish 往往是“spiny dogfish（刺狗鲨）”，在海洋生态与渔业报道里比较常见。"]}
{"word":"dogfoot","summary":{"en":"Dogfoot is a rare form meaning a dog’s foot/paw, and it can also be a rare plant name (often written “dog’s-foot”).","zh":"*Dogfoot* 是较少见的写法，通常指“狗的脚/狗爪”，也可作某些植物的俗名（常写作 *dog’s-foot*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the foot (paw) of a dog; a dog’s paw (rare in modern writing; usually written “dog’s foot”)","zh":"狗的脚；狗爪（现代英语中较少单写作 *dogfoot*，更常见写法是 *dog’s foot*）"},"examples":[{"en":"The muddy dog’s foot prints were all over the kitchen floor.","zh":"厨房地板上到处都是沾泥的狗爪印。"},{"en":"He cleaned the dog’s foot after the walk.","zh":"散步后他把狗爪洗干净了。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a name used for certain plants, especially ones whose leaves look like a dog’s paw; often written with a hyphen as “dog’s-foot”","zh":"（罕见）某些植物的俗名，因叶形像狗爪而得名；常写作带连字符的 *dog’s-foot*"},"examples":[{"en":"In older books, “dog’s-foot” may refer to a small wild plant with paw-shaped leaves.","zh":"在较早的书里，*dog’s-foot* 可能指一种叶子像狗爪的小型野生植物。"}]}],"synonyms":["dog’s paw","dog’s foot"],"phonetic":"/ˈdɔɡˌfʊt/","extraExplanation":["*Dogfoot* 不是很常见的标准拼写。日常表达“狗爪/狗脚”通常写 *a dog’s foot* 或更口语的 *a dog’s paw*（paw 更贴近“爪子”的感觉）。","作为植物俗名时，不同地区可能指不同植物；阅读旧书或自然类文本时，若看到 *dog’s-foot*，最好结合上下文或拉丁学名来确认具体指哪一种植物。"]}
{"word":"dogfought","summary":{"en":"Dogfought is the past tense of dogfight: to fight a close-range air battle, or (informally) to compete or argue fiercely.","zh":"Dogfought 是 dogfight 的过去式：指近距离空战缠斗，也可（非正式）指激烈竞争或争执。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense of dogfight) to fight in the air at close range, especially between fighter planes.","zh":"（dogfight 的过去式）指战斗机等在空中近距离缠斗、空战。"},"examples":[{"en":"The two pilots dogfought above the mountains for several minutes.","zh":"两名飞行员在群山上空缠斗了好几分钟。"},{"en":"In the film, the hero dogfought an enemy jet and barely escaped.","zh":"在电影里，主角与敌机缠斗，险些逃脱。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, figurative) to struggle or argue fiercely for an advantage.","zh":"（非正式、比喻）为争取优势而激烈争斗或争辩。"},"examples":[{"en":"The candidates dogfought for every vote in the final week.","zh":"候选人在最后一周为每一张选票激烈拼抢。"},{"en":"The two sides dogfought over the budget details.","zh":"双方就预算细节展开了激烈争执。"}]}],"synonyms":["battled","fought","dueled","clashed","scrapped","contended"],"phonetic":"/ˈdɔɡˌfɔt/","extraExplanation":["“dogfight”原指空中“像狗一样近身撕咬”的缠斗（强调距离近、动作快、互相追逐），后来也常被引申到商业竞争、体育对抗、政治角力等语境。","拼写提示：原形是 dogfight；过去式常写作 dogfought（类比 fight → fought），过去分词也常用 dogfought。"]}
{"word":"dogged","summary":{"en":"Dogged means persistent and determined, or (in passive use) continuously followed or troubled by something.","zh":"dogged可指“顽强、坚持不懈”，也可指（多用于被动）“被持续纠缠/困扰”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very determined; not giving up even when something is difficult or takes a long time.","zh":"顽强的；坚持不懈的（即使困难或耗时也不放弃）。"},"examples":[{"en":"Her dogged determination helped her finish the project on time.","zh":"她顽强的决心帮助她按时完成了项目。"},{"en":"The team made dogged efforts to improve after a tough season.","zh":"在艰难的赛季后，这支队伍坚持不懈地努力提升。"}]},{"partOfSpeech":"v.","definition":{"en":"Followed or bothered continuously, often in an annoying or threatening way (usually in passive forms like “be dogged by”).","zh":"被持续跟踪或纠缠；被不断困扰（常用于被动，如“be dogged by”）。"},"examples":[{"en":"The politician was dogged by questions about the scandal.","zh":"那位政治人物一直被有关丑闻的问题纠缠。"},{"en":"Bad luck seemed to dog him for years.","zh":"厄运似乎多年都在缠着他。"}]}],"synonyms":["persistent","tenacious","determined","unyielding","relentless"],"phonetic":"/ˈdɔɡɪd/","extraExplanation":["“dogged”来自“dog”（狗）作动词时的含义：像狗一样紧跟不放，因此引申为“纠缠不休”。作为形容词时，“dogged”强调“咬住目标不松口”的坚持，语气通常偏褒义（毅力、韧性），但在“be dogged by + 问题/丑闻/厄运”等结构中常带负面语气（被麻烦缠身）。","常见搭配：dogged determination（顽强的决心）、dogged pursuit（执着追求）、doggedly（adv. 坚持不懈地）。注意不要和“dog-tired”（累得像狗一样）混淆。"]}
{"word":"doggedly","summary":{"en":"Doggedly means “with stubborn determination,” and sometimes “in a persistent, hard-to-shake way.”","zh":"doggedly 表示“顽强地、执着地”，有时也指“紧追不放地、挥之不去地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"With stubborn determination; continuing firmly even when something is difficult or when others want you to stop.","zh":"顽强地；执着地（即使很困难或别人想让你停下，也坚持继续）。"},"examples":[{"en":"She studied doggedly for months and finally passed the exam.","zh":"她顽强地学习了好几个月，终于通过了考试。"},{"en":"The team kept working doggedly despite repeated setbacks.","zh":"尽管一次次受挫，团队仍然顽强地继续工作。"},{"en":"He doggedly pursued his goal, refusing to give up.","zh":"他执着地追求目标，拒绝放弃。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a persistent way that follows or sticks to someone or something closely (often describing problems, doubts, or people that won’t go away).","zh":"紧追不放地；纠缠不休地（常形容问题、疑虑或人挥之不去）。"},"examples":[{"en":"Questions about safety doggedly followed the project from the start.","zh":"从一开始，关于安全的问题就一直纠缠着这个项目。"},{"en":"Rumors doggedly clung to him throughout his career.","zh":"谣言在他整个职业生涯中都紧紧缠着他。"}]}],"synonyms":["persistently","steadfastly","tenaciously","determinedly","relentlessly"],"phonetic":"/ˈdɔɡɪdli/","extraExplanation":["doggedly 来自形容词 dogged（顽强的、固执的），原义与“像狗一样不松口、紧追不舍”的形象有关，所以既可褒义（坚持不懈），也可略带贬义（固执、纠缠）。语气取决于上下文。","常见搭配：doggedly pursue（顽强追求）、doggedly continue（执着继续）、doggedly determined（顽强坚定）、be dogged by problems/doubts（被问题/疑虑缠上、困扰）。"]}
{"word":"doggedness","summary":{"en":"Doggedness means strong, stubborn persistence in pursuing a goal, especially despite difficulties.","zh":"Doggedness 指在追求目标时不畏困难、顽强坚持的品质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Determined persistence; the quality of continuing firmly even when something is difficult or takes a long time.","zh":"坚持不懈；在困难或漫长过程中依然坚定持续的品质。"},"examples":[{"en":"Her doggedness helped her finish the project despite many setbacks.","zh":"尽管遇到许多挫折，她的坚持不懈还是帮助她完成了这个项目。"},{"en":"With doggedness and practice, he improved his English step by step.","zh":"凭借坚持不懈和练习，他一步一步提高了英语。"},{"en":"The team’s doggedness kept them fighting until the final minute.","zh":"球队的顽强坚持让他们一直拼到最后一分钟。"}]}],"synonyms":["perseverance","tenacity","determination","persistence","grit"],"phonetic":"/ˈdɔɡɪdnəs/","extraExplanation":["“doggedness”来自形容词“dogged”（顽强的、执着的），与“dog（狗）”相关的比喻含义是“像狗一样紧咬不放、不轻易松口”，强调在压力、反对或失败面前仍持续努力。","语气通常偏褒义，表示可贵的毅力；但在某些语境里也可能带一点“固执、死磕”的感觉，需要看上下文。"]}
{"word":"dogger","summary":{"en":"“Dogger” most commonly means an old North Sea fishing boat; in UK slang it can also mean a participant in an explicit adult activity.","zh":"“dogger”最常指旧时北海的渔船；在英国俚语中也可指涉成人露骨行为的参与者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional two-masted fishing boat once common in the North Sea (especially Dutch and English fisheries)","zh":"（传统）多格船：一种曾在北海常见的双桅渔船（尤指荷兰和英国渔业）"},"examples":[{"en":"In the 1800s, many fishermen worked on doggers in the North Sea.","zh":"在19世纪，许多渔民在北海的多格渔船上工作。"},{"en":"The museum displays a model of a dogger used for long fishing trips.","zh":"博物馆展出了一艘用于远洋捕鱼的多格船模型。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK, informal) a person who takes part in “dogging,” sexual activity in public places watched by others (adult/explicit meaning)","zh":"（英式，非正式）“dogging（露天群体围观性行为）”的参与者（成人/露骨含义）"},"examples":[{"en":"That tabloid article used the word “dogger,” which is an adult slang term.","zh":"那篇小报文章用了“dogger”这个词，它是成人俚语。"},{"en":"If you see “dogger” online in a UK context, it may refer to this explicit meaning.","zh":"如果你在英国语境的网络内容里看到“dogger”，它可能指这个露骨含义。"}]}],"synonyms":["(boat) fishing boat","(boat) trawler","(slang) dogging participant"],"phonetic":"/ˈdɔɡɚ/","extraExplanation":["“dogger（多格船）”来自荷兰语，和北海渔业历史有关；你可能在历史、海事或博物馆语境中见到。","“Dogger Bank（多格浅滩）”是北海著名浅滩，名字与“dogger（多格船）”同源；在地理与历史（如“Dogger Bank incident”）中常见。","现代英式俚语“dogger”与“dogging”相关，属于成人内容；日常英语学习中不建议使用，但阅读英国媒体或小说时可能遇到。"]}
{"word":"doggerel","summary":{"en":"Doggerel is humorous or low-quality rhyming verse, often written for fun or satire.","zh":"Doggerel 指幽默或质量不高的押韵小诗（打油诗），常用于娱乐或讽刺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Humorous or low-quality poetry, often with simple rhymes and irregular rhythm; sometimes written to mock or entertain rather than to be serious.","zh":"打油诗；（常带调侃意味的）拙劣诗歌，通常押简单的韵、节奏不够讲究。"},"examples":[{"en":"He wrote a bit of doggerel for his friend’s birthday card.","zh":"他为朋友的生日卡写了几句打油诗。"},{"en":"The newspaper printed a short piece of political doggerel.","zh":"报纸刊登了一段短短的政治打油诗。"},{"en":"She laughed at the doggerel, even though it wasn’t great poetry.","zh":"尽管算不上好诗，她还是被那首打油诗逗笑了。"}]}],"synonyms":["verse","jingle","rhymes","light verse","satire"],"phonetic":"/ˈdɔɡərəl/","extraExplanation":["“Doggerel”通常带有轻微贬义：强调“粗糙、幼稚、没那么讲究”的诗，但并不一定完全否定它的趣味性。有时人们也会用它来形容刻意写得滑稽的打油诗。","词源上与“dog（狗）”相关的联想使它带点“随便、杂乱”的感觉，但现代用法主要指诗的质量与风格，而不是与动物有关。","文学与文化里常用来区分“严肃诗歌”与“通俗押韵小诗”。例如在评论里可能说某些作品“descends into doggerel（沦为打油诗）”，表示格调下降。"]}
{"word":"doggereled","summary":{"en":"Doggerel is bad or simplistic poetry (or verses) with easy rhymes; it can also describe writing that style.","zh":"doggerel 指粗糙拙劣、押韵简单的“打油诗/顺口溜”，也可作形容词表示“打油诗式的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often disapproving) Bad, simple, or clumsy poetry, usually with an awkward rhythm and easy rhymes.","zh":"（常含贬义）打油诗；粗糙、拙劣、节奏别扭、押韵简单的诗。"},"examples":[{"en":"He dismissed the song lyrics as doggerel, not serious poetry.","zh":"他把那些歌词斥为打油诗，算不上严肃诗歌。"},{"en":"The notebook was filled with silly doggerel about school life.","zh":"那本笔记本里写满了关于校园生活的胡闹打油诗。"}]},{"partOfSpeech":"adj.","definition":{"en":"Written in the style of doggerel; crudely rhymed and not very artistic.","zh":"打油诗式的；粗糙押韵的，不够讲究艺术性的。"},"examples":[{"en":"The play includes a few doggerel verses for comic effect.","zh":"这部戏里穿插了几段打油诗式的诗句来制造喜剧效果。"},{"en":"It’s a doggerel rhyme, but it’s easy to remember.","zh":"这首押韵诗很打油，但很容易记住。"}]}],"synonyms":["bad poetry","crude verse","verse doggerel","jingle (often)","rhyming verse"],"phonetic":"/ˈdɔɡərəl/","extraExplanation":["你输入的“doggereled”更像是由“doggerel”派生出来的过去式/过去分词（常见拼法为 doggerelled / doggereled），意思是“用打油诗写成的、写得很粗糙押韵的”。日常更常见的基本词形是 doggerel（既可作名词也可作形容词）。","词源上 doggerel 与“粗陋、平庸的诗歌”相关，常用于文学评论或带一点嘲讽的语气；也可以较中性地表示“顺口溜/打油诗”，强调好记和好玩而非高雅。"]}
{"word":"doggereler","summary":{"en":"Doggerel is simple, often humorous verse that may sound clumsy or singsong; it can also mean writing such verse.","zh":"Doggerel 指简单、常带幽默的打油诗（常显得粗糙、顺口溜式），也可作动词指写这类诗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, simple poem (or verse) that is usually meant to be funny and often sounds clumsy or singsong","zh":"打油诗；（常带幽默或讽刺、但格律粗糙、带顺口溜味的）诗句"},"examples":[{"en":"He wrote a bit of doggerel for his friend’s birthday card.","zh":"他为朋友的生日卡写了几句打油诗。"},{"en":"The newspaper printed doggerel making fun of the politician.","zh":"报纸刊登了几首嘲讽那位政客的打油诗。"},{"en":"Some children’s rhymes can sound like doggerel, but they’re still fun to read.","zh":"有些童谣听起来像打油诗，但读起来依然有趣。"}]},{"partOfSpeech":"v.","definition":{"en":"to write simple, often joking verse that is not very skillful","zh":"写打油诗；写粗糙但逗趣的诗句"},"examples":[{"en":"They doggerelized a few lines to celebrate the team’s win.","zh":"他们随手写了几句打油诗来庆祝球队获胜。"},{"en":"He tends to doggerel when he’s bored in meetings.","zh":"他开会无聊时就爱写几句打油诗。"}]}],"synonyms":["light verse","rhyming verse","jingle","verse"],"phonetic":"/ˈdɔɡərəl/","extraExplanation":["你输入的“doggereler”更像是拼写错误；常见词是 **doggerel**（打油诗）。如果你想表达“写打油诗的人”，更自然的说法是 **a writer of doggerel**，也可以说 **a doggerel poet**（但不如前者常见）。","语感上，**doggerel** 常带一点“文笔不高/刻意搞笑”的评价色彩；如果想更中性地说“简单的押韵小诗”，可以用 **light verse** 或 **simple rhyme**。"]}
{"word":"doggerelism","summary":{"en":"Doggerelism means the style or tendency of writing rough, simple, often humorous verse (doggerel).","zh":"doggerelism 指“打油诗式”的风格或倾向：粗糙简单、常带幽默的诗句写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or practice of writing doggerel: verse that is simple, rough, and often meant to sound clumsy or funny rather than artistic.","zh":"打油诗式（拙劣/粗糙诗句）的特点或写作方式：指诗歌语言简单生硬，常故意显得笨拙或滑稽，而非追求艺术性。"},"examples":[{"en":"The critic complained that the poem’s emotional theme was weakened by its doggerelism.","zh":"评论家抱怨说，这首诗的情感主题被它的“打油诗式拙劣感”削弱了。"},{"en":"He used a touch of doggerelism to make the song feel playful and easy to remember.","zh":"他加入一点打油诗式的风格，让这首歌更俏皮、也更容易记住。"}]}],"synonyms":["doggerel","jingle","bad verse","trite rhymes"],"phonetic":"/ˈdɔɡərəlˌɪzəm/","extraExplanation":["“doggerel”常指“打油诗/拙劣诗句”，既可以是批评（粗糙、缺乏技巧），也可以是中性的描述（故意用简单押韵制造幽默效果）。因此“doggerelism”多见于评论或写作讨论中，用来概括这种风格或倾向。","词源上与“doggerel（拙劣诗）”有关，后缀“-ism”表示“某种风格/倾向/现象”（如 realism 现实主义）。"]}
{"word":"doggerelist","summary":{"en":"A doggerelist is someone who writes doggerel—simple, often clumsy or comic rhymed verse.","zh":"doggerelist 指写“doggerel（打油诗/拙劣打油体）”的人，常带一点调侃或轻微贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes doggerel (simple, often clumsy or humorous poetry with a regular rhythm and rough rhyme)","zh":"写打油诗的人（节奏规则但常显得笨拙、滑稽或粗糙押韵的诗）"},"examples":[{"en":"He was dismissed by critics as a doggerelist who cared more about rhyme than meaning.","zh":"评论家把他打发成一个打油诗作者，说他更在意押韵而不是意义。"},{"en":"In the school magazine, she proudly called herself a doggerelist and wrote funny poems about homework.","zh":"在校刊里，她自豪地称自己是打油诗作者，写了些关于作业的搞笑小诗。"}]}],"synonyms":["doggerel poet","rhymester","versifier (often informal/critical)"],"phonetic":"/ˈdɑɡərəlɪst/","extraExplanation":["“doggerelist”由“doggerel（打油诗/拙劣打油体）+ -ist（从事者/……家）”构成，意思直观：写doggerel的人。","这个词比较少见；更常见的说法是“writer of doggerel”或直接用“doggerel poet”。","“doggerel”在英语文化中常带轻微贬义，暗示诗歌技巧不高；但也可用于幽默、讽刺或儿童韵文等轻松语境。"]}
{"word":"doggerelize","summary":{"en":"To make writing sound like clumsy, low-quality rhyming verse (doggerel), often mockingly.","zh":"把文字写成/改成打油诗式的拙劣押韵诗，常带讽刺。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn writing (especially poetry or song lyrics) into doggerel—simple, clumsy, or low-quality verse, often in a mocking way","zh":"把（文字，尤指诗歌或歌词）写成/改成打油诗式的拙劣押韵诗；常带有嘲讽意味"},"examples":[{"en":"The critic said the translator had doggerelized the original poem, flattening its beauty into sing-song rhymes.","zh":"评论家说译者把原诗“打油诗化”了，把原本的美感压扁成了唱唱跳跳的押韵句。"},{"en":"Don’t doggerelize this speech—keep the lines clear and natural.","zh":"别把这篇演讲稿写得像打油诗一样——句子要清晰自然。"}]}],"synonyms":["turn into doggerel","reduce to doggerel","trivialize","cheapened (in effect)"],"phonetic":"/ˈdɔɡərəlˌaɪz/","extraExplanation":["“doggerel”指的是质量不高、节奏/押韵显得生硬幼稚的诗句，中文常译作“打油诗、拙劣诗”。“doggerelize”由 doggerel + -ize 构成，语气通常带批评或讽刺，用来强调把原本较好的文字“降格”为廉价顺口溜的感觉。","这个词比较少见，更常见的表达有：turn into doggerel / reduce to doggerel / make it sound like doggerel。"]}
{"word":"doggerelizer","summary":{"en":"Doggerelizer means a person—or sometimes a tool—that turns writing into silly, low-quality rhyming verse (doggerel).","zh":"Doggerelizer 指写打油诗的人，或把文字“改成打油诗式押韵歪诗”的工具/做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes or turns writing into doggerel (simple, usually low-quality or comic verse).","zh":"写打油诗/歪诗的人；把文字改写成打油诗（通常质量不高或带搞笑意味）的人。"},"examples":[{"en":"He jokingly called himself a doggerelizer, churning out silly rhymes for birthdays.","zh":"他开玩笑说自己是个“doggerelizer”，专门为生日写些傻傻的押韵打油诗。"},{"en":"The critic said the translator became a doggerelizer by forcing every line to rhyme.","zh":"评论家说那位译者为了让每行都押韵，结果把作品变成了打油诗，还成了“doggerelizer”。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool, program, or method that converts text into doggerel-style verse (often humorous or informal).","zh":"把文本转换成打油诗风格（常带幽默或随意感）的工具、程序或方法。"},"examples":[{"en":"Someone built a simple doggerelizer that turns news headlines into rhyming couplets.","zh":"有人做了个简单的“doggerelizer”，能把新闻标题变成押韵对句。"},{"en":"This doggerelizer is fun, but it sacrifices meaning for rhyme.","zh":"这个“doggerelizer”很好玩，但它为了押韵牺牲了含义。"}]}],"synonyms":["rhymester","versifier (often ironic)","doggerel writer","poetaster"],"phonetic":"/ˈdɔɡərəˌlaɪzər/","extraExplanation":["“doggerelizer”不是高频词，更多见于幽默、自创词或评论语境。它由 doggerel（打油诗、拙劣滑稽诗）+ -ize（使成为……）+ -er（做……的人/物）构成，意思就是“把内容变成打油诗的人/东西”。","doggerel 在英语文化里常用来轻松地贬低“过度押韵但缺乏内容”的诗句；所以用 doggerelizer 往往带一点自嘲或讽刺。"]}
{"word":"doggerelizing","summary":{"en":"Doggerelizing means writing doggerel (silly or low-quality verse) or making writing sound like doggerel.","zh":"doggerelizing 指写打油诗/歪诗，或把文字（尤指诗句）写得像打油诗一样粗糙轻佻。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"writing (or trying to write) simple, often silly or low-quality poetry; composing doggerel.","zh":"写（或试着写）浅显、常带滑稽但质量不高的打油诗/歪诗；以打油诗的方式写作。"},"examples":[{"en":"He spent the afternoon doggerelizing about the rainy weather.","zh":"他花了一下午用打油诗胡乱写着关于雨天的诗句。"},{"en":"The poem starts seriously but ends up doggerelizing in the last lines.","zh":"这首诗开头很正经，但最后几行变成了打油诗式的胡闹。"}]},{"partOfSpeech":"v.","definition":{"en":"making language (especially verse) sound cheap, careless, or trivial, as if it were doggerel.","zh":"（尤指诗歌）把语言写得粗糙、轻浮、显得廉价，像打油诗一样。"},"examples":[{"en":"The translator avoided doggerelizing the original by keeping its rhythm natural.","zh":"译者通过保持自然的节奏，避免把原作译得像打油诗那样粗糙。"},{"en":"Too many forced rhymes can end up doggerelizing a heartfelt message.","zh":"太多生硬押韵会把真挚的信息写得像打油诗一样轻佻。"}]}],"synonyms":["writing doggerel","versifying badly","rhyming clumsily","dashing off verse"],"phonetic":"/ˈdɑɡərəlˌaɪzɪŋ/","extraExplanation":["“doggerel”指“打油诗/歪诗”：通常押韵明显、内容直白甚至搞笑，但文学性不高，有时带贬义。","“doggerelizing”多见于批评或自嘲的语境，暗示作者在“玩文字”而非认真写高质量诗。","词形上来自 doggerel + -ize（使变成……）+ -ing（进行/动名词），意思就是“使之变成打油诗那样”。"]}
{"word":"doggerelled","summary":{"en":"Doggerelled means “in a doggerel style”—rough, simple, often comically bad verse (often spelled doggerel).","zh":"doggerelled 指“打油诗式的/拙劣诗风格的”——粗糙简单、常带滑稽效果的诗（常见拼写为 doggerel）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often spelled “doggerel.”) Written in a rough, simple, and often humorously bad style of poetry; having the quality of doggerel.","zh":"（常见拼写为 doggerel。）指用粗糙、简单、往往带点滑稽“很烂”的方式写成的诗；具有打油诗/拙劣诗的风格。"},"examples":[{"en":"The critic dismissed the lyrics as doggerelled verse that relied on cheap rhymes.","zh":"评论家把这些歌词斥为狗屁不通的打油诗，只会靠低级押韵。"},{"en":"He wrote a doggerelled poem for the school play to make the audience laugh.","zh":"他为学校话剧写了一首“打油诗式”的诗，好让观众发笑。"}]}],"synonyms":["doggerel","crude","clumsy","sing-song","awkwardly rhymed"],"phonetic":"/ˈdɑɡ(ə)rəl/","extraExplanation":["“Doggerelled”是由名词 doggerel（打油诗、拙劣诗）派生出来的形容词/分词用法，意思是“带有打油诗风格的”。现代英语里更常直接用 doggerel 作形容词（例如：doggerel verse/poetry）。","Doggerel 常用来形容押韵生硬、节奏笨拙但可能很搞笑的诗句；它既可以是批评（很差），也可以是刻意为幽默而写的风格。"]}
{"word":"doggerelling","summary":{"en":"Doggerel is simple, often poorly written rhyming verse; it can be humorous or unintentionally bad.","zh":"Doggerel 指打油诗/拙劣韵文：押韵简单粗糙，可能是搞笑写的，也可能是无意写得很差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of poetry or verse) Simple, clumsy, and often silly in style; written with rough rhyme and rhythm.","zh":"（诗歌/韵文）打油的；粗糙押韵但不够讲究、常显得滑稽或拙劣的。"},"examples":[{"en":"The poem was meant to be serious, but it came out as doggerel.","zh":"这首诗本想写得严肃，但写出来却像打油诗。"},{"en":"He entertained his friends with doggerel about everyday life.","zh":"他用关于日常生活的打油诗逗朋友们开心。"}]},{"partOfSpeech":"n.","definition":{"en":"Verse that is poorly written or overly simple, often with forced rhymes; “bad” or joking poetry.","zh":"拙劣或过于简单的韵文，常有硬凑的押韵；（带调侃意味的）“烂诗/打油诗”。"},"examples":[{"en":"Most of the book is doggerel, but a few lines are surprisingly moving.","zh":"这本书大多是打油诗，但有几句却意外地动人。"},{"en":"She apologized for her doggerel and read it anyway.","zh":"她为自己的“烂诗”道了歉，但还是读了出来。"}]},{"partOfSpeech":"vi.","definition":{"en":"Nonstandard form: the act of writing in doggerel; producing rough, rhyming verse.","zh":"非标准用法：写打油诗；用粗糙押韵的方式写韵文。"},"examples":[{"en":"He spent the evening doggerelling about the weather and the train delays.","zh":"他一晚上都在编打油诗，内容是天气和火车晚点。"}]}],"synonyms":["bad verse","jingle","light verse","rhyming rubbish","verse doggerel"],"phonetic":"/ˈdɔɡərəl/","extraExplanation":["你输入的“doggerelling”更常见的标准词是 **doggerel**（名词/形容词）。在现代英语里，“doggerelling”偶尔会被当作临时造出来的动词形式（类似“写成打油诗的样子”），但不算常用或规范。","词源上与“dog”并不是“狗的诗”那样的直观关系；它更像是历史上对“粗糙、低级的诗体”的称呼，后来固定为表示“打油诗/拙劣韵文”。"]}
{"word":"doggerels","summary":{"en":"Doggerels are simple, often humorous (and sometimes low-quality) rhyming verses.","zh":"doggerels 指通俗押韵、常带幽默感（有时也显得粗糙）的短诗/打油诗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Short, simple, and often humorous or poorly written poems or verses.","zh":"打油诗；（通常指）短小、通俗、往往幽默但艺术性不高的诗或押韵句。"},"examples":[{"en":"He filled his notebook with silly doggerels about school life.","zh":"他在笔记本里写满了关于校园生活的滑稽打油诗。"},{"en":"The review dismissed the lyrics as doggerels rather than real poetry.","zh":"评论认为这些歌词更像打油诗，而不是真正的诗。"}]}],"synonyms":["bad verse","jingle","light verse","rhymes"],"phonetic":"/ˈdɔɡ(ə)rəl/","extraExplanation":["“doggerel”常带一点贬义或玩笑意味：不是指“写得很差就一无是处”，而是强调它通俗、顺口、像打趣的押韵句。也有人用它来形容“刻意粗糙、用来搞笑”的诗。","词源上与中古英语里表示“快速、零散地写/吟”的用法有关；现代英语里多用于评价诗歌、歌词或带押韵的口号。"]}
{"word":"doggeries","summary":{"en":"“Doggeries” means disreputable, low-class drinking places (plural of “doggery”).","zh":"“doggeries”指下等、名声不佳的饮酒场所（“doggery”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) low, disreputable bars or drinking places; places known for cheap alcohol and rough behavior.","zh":"（复数）下等、名声不佳的酒吧/小酒馆；常指卖廉价酒、环境粗鄙的饮酒场所。"},"examples":[{"en":"In the old novel, sailors spent their pay in waterfront doggeries.","zh":"在那部老小说里，水手们把工资花在码头边的下等酒馆里。"},{"en":"The reporter wrote about doggeries where illegal gambling was common.","zh":"记者写到一些下等酒吧里常见非法赌博。"}]}],"synonyms":["dive bars","seedy bars","gin mills","low-life taverns"],"phonetic":"/ˈdɔɡəriz/","extraExplanation":["“doggeries”是“doggery”的复数。这个词带有明显贬义，常见于较老的英语文本（尤其是19世纪到20世纪初）或带历史/文学风格的写作中，用来营造“肮脏、混乱、治安差”的氛围。现代口语里更常用 dive bar / seedy bar / hole-in-the-wall。"]}
{"word":"doggers","summary":{"en":"“Doggers” most often means people involved in UK slang “dogging” (public sex), but it can also be the plural of “dogger,” a historical type of small fishing/sailing vessel.","zh":"“Doggers”最常见指英式俚语中参与“dogging（公共场所性行为）”的人；也可指“dogger（小型渔/帆船）”的复数（历史用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “dogger”: a small sailing boat or fishing vessel (historical).","zh":"“dogger”的复数：一种小型帆船或渔船（历史用法）。"},"examples":[{"en":"In old records, doggers carried fish along the coast.","zh":"在一些旧记录里，doggers 会沿海运送渔获。"},{"en":"The museum has a model of a Dutch dogger.","zh":"博物馆里有一艘荷兰 dogger 的模型。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK slang, informal, often considered crude) People who take part in “dogging,” meaning public sex, typically with others watching or joining.","zh":"（英式俚语，非正式，常被认为粗俗）参与“dogging（露天/公共场所性行为）”的人，通常涉及他人围观或加入。"},"examples":[{"en":"The article discussed how police try to stop doggers in certain parks at night.","zh":"那篇文章谈到警方如何在夜间阻止某些公园里的 doggers。"},{"en":"That term is slang and can be offensive in polite conversation.","zh":"这个词属于俚语，在正式或礼貌的场合可能令人反感。"}]}],"synonyms":["dogger boats (nautical sense)","participants (general)","people involved (general)"],"phonetic":"/ˈdɔɡərz/","extraExplanation":["在英国，“dogging”这一说法据说与人们假装“遛狗”来掩饰真实目的有关，因此参与者有时被称为 doggers。这个含义带有明显的成人与露骨色彩：阅读新闻或网络内容可能会遇到，但日常交流中应谨慎使用，避免冒犯他人。"]}
{"word":"doggery","summary":{"en":"Doggery usually means a cheap, rough bar (especially in parts of North America); less commonly, it can mean a place where dogs are kept.","zh":"doggery通常指廉价、简陋的小酒馆（尤见于北美部分地区）；较少情况下也可指狗舍或养狗的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cheap, rough, or sometimes disreputable bar; a low-class drinking place","zh":"（尤指北美）廉价、简陋，甚至有点不体面的酒吧/小酒馆"},"examples":[{"en":"They ended up in a noisy doggery near the docks.","zh":"他们最后去了码头附近一家吵闹的廉价小酒馆。"},{"en":"In the novel, the detective questions people in a backstreet doggery.","zh":"在小说里，侦探在一条偏僻小街的小酒馆里盘问人。"}]},{"partOfSpeech":"n.","definition":{"en":"a place where dogs are kept, raised, or cared for (less common)","zh":"养狗或看护狗的地方（较少见）"},"examples":[{"en":"The old farm had a small doggery behind the barn.","zh":"那座老农场在谷仓后面有个小型狗舍。"}]}],"synonyms":["dive (bar)","tavern","pub","saloon","kennel (for the dog-place meaning)"],"phonetic":"/ˈdɔɡəri/","extraExplanation":["“doggery”在加拿大和美国部分地区更常见，常带有口语色彩，暗示环境粗糙、便宜，甚至有点“鱼龙混杂”。在正式写作里更常用“bar / tavern / dive bar”等表达。","这个词与“dog”（狗）相关：早期也可指养狗的地方；后来在某些地区转而指低档酒馆，语感接近“dive (bar)”（不一定危险，但通常不讲究）。"]}
{"word":"doggess","summary":{"en":"“doggess” is an old/rare word meaning a female dog.","zh":"“doggess”是一个古旧、罕用的词，意思是“母狗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or rare) a female dog; a bitch.","zh":"（古旧或罕用）母狗；（较直白的）母犬。"},"examples":[{"en":"In some old texts, “doggess” simply means a female dog.","zh":"在一些旧文本里，doggess 只是指“母狗”。"},{"en":"The farmer kept a dog and a doggess for breeding.","zh":"农夫养了一公一母两只狗用来繁殖。"}]}],"synonyms":["female dog","bitch (female dog, can be offensive in other contexts)"],"phonetic":"/ˈdɔɡəs/","extraExplanation":["“doggess”是由“dog + -ess（表示阴性）”构成的旧式词形，类似“lion/lioness”。现代英语里通常不用它，而用“female dog”或更常见的“bitch”（但在日常交流中“bitch”也常被用作骂人词，语气很冒犯，因此谈论动物时更安全的说法是“female dog”或“a bitch (female dog)”并说明语境）。"]}
{"word":"dogget","summary":{"en":"“Dogget” is a rare, old word meaning a coarse woolen cloth; it’s often confused with the modern word “dogged.”","zh":"“dogget”是一个罕见的古词，指粗厚的羊毛呢料；也常被误认为现代词“dogged（顽强的）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a thick, coarse woolen cloth; sometimes used for outer clothing.","zh":"（古义）一种厚实、粗糙的羊毛呢料；有时用于做外衣。"},"examples":[{"en":"In older texts, you may see “dogget” used to describe a rough wool fabric.","zh":"在较老的文本里，你可能会看到用“dogget”来形容一种粗厚的羊毛布料。"},{"en":"The coat was said to be made of dogget, meant for cold, hard weather.","zh":"据说那件外套是用 dogget 呢料做的，适合寒冷艰苦的天气。"}]}],"synonyms":["(fabric) woolen cloth","coarse wool","broadcloth (approx.)"],"phonetic":"/ˈdɑɡɪt/","extraExplanation":["“dogget”在现代英语里非常少见，多数学习者几乎不会在日常对话或新闻中遇到。","它很容易被当作拼写错误：如果你想表达“顽强的、坚持不懈的”，常用词是“dogged”（adj.）。如果你指的是人名/姓氏，常见拼法是“Doggett”。","如果你能提供原句（看到它的上下文），我可以帮你判断这里应当是古义“布料”，还是其实想写“dogged / Doggett”。"]}
{"word":"Doggett","summary":{"en":"Doggett is mainly a surname, and it can also refer to the character John Doggett from *The X-Files*.","zh":"Doggett 主要是一个英文姓氏，也可指《X档案》中的角色 John Doggett。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname): Doggett","zh":"姓氏：Doggett（多格特）"},"examples":[{"en":"Ms. Doggett will lead the meeting today.","zh":"Doggett 女士今天将主持会议。"},{"en":"I met a lawyer named Daniel Doggett.","zh":"我认识一位叫 Daniel Doggett 的律师。"}]},{"partOfSpeech":"n.","definition":{"en":"(in popular culture) John Doggett, a character from the TV series *The X-Files*","zh":"（流行文化）约翰·多格特（John Doggett），电视剧《X档案》（*The X-Files*）中的角色"},"examples":[{"en":"John Doggett joins the investigation in later seasons of *The X-Files*.","zh":"在《X档案》的后期季中，John Doggett 加入了调查。"},{"en":"Some fans prefer the Doggett era, while others miss Mulder.","zh":"有些粉丝更喜欢 Doggett 出现的时期，也有人想念 Mulder。"}]}],"phonetic":"/ˈdɔɡɪt/","extraExplanation":["“Doggett”主要作为英语姓氏使用，而不是常见词汇。读音通常重音在第一音节。","这个姓氏在英语世界里较常见于美国与英国；在中文里常音译为“多格特”。"]}
{"word":"doggie","summary":{"en":"“Doggie” is an affectionate, childlike word for a dog, often used with kids or when speaking sweetly to a dog.","zh":"“doggie”是“dog”的亲昵称呼/童语形式，常用于对孩子说或对狗亲昵地说话。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cute, childlike word for a dog; often used when speaking to children or talking affectionately to a dog","zh":"小狗狗；（对狗的）亲昵称呼，常用于对小孩说或对狗撒娇时"},"examples":[{"en":"Look at the doggie! He’s so fluffy.","zh":"快看那只狗狗！它好蓬松。"},{"en":"Do you want to pet the doggie gently?","zh":"你想轻轻摸摸那只狗狗吗？"},{"en":"Come here, doggie! Good boy!","zh":"过来，狗狗！乖！"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to dogs (used informally, often in children’s language)","zh":"狗的；与狗有关的（非正式用法，常见于儿童用语）"},"examples":[{"en":"She reads a doggie book before bed.","zh":"她睡前会读一本关于狗狗的书。"},{"en":"He wore a doggie costume for the party.","zh":"他派对上穿了狗狗造型的服装。"}]}],"synonyms":["dog","puppy","pooch","pup"],"phonetic":"/ˈdɔɡi/","extraExplanation":["“doggie”（也常写作“doggy”）是“dog”的爱称/童语形式，带有亲切、可爱、温柔的语气。对不熟的人或正式场合，一般用“dog”。","拼写差异：英美都常见“doggie/doggy”。“doggie”更像是在强调“小狗狗/很可爱”的感觉；“doggy”也常见于固定表达如“doggy bag”（打包袋/打包）。"]}
{"word":"doggie bag","summary":{"en":"a restaurant bag or container for leftovers to take home","zh":"餐馆用于把剩菜带走的打包袋/打包盒"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bag or container provided by a restaurant for taking leftover food home.","zh":"（餐馆提供的）打包袋；外带剩菜的袋子/盒子。"},"examples":[{"en":"Could we get a doggie bag for the rest of the pizza?","zh":"剩下的披萨可以帮我们打包吗？"},{"en":"I asked for a doggie bag because the portion was too big.","zh":"份量太大了，所以我 попрос要个打包袋。"}]}],"synonyms":["to-go box","takeout container","carryout container","leftover box"],"phonetic":"/ˈdɔɡi bæɡ/","extraExplanation":["这是很常见、也很礼貌的说法，通常不是真的给狗吃。你也可以更直接地说：“Could I have this to go?”（我可以把这个打包带走吗？）或 “Could you box this up?”（可以帮我装盒打包吗？）","在一些场合（比如较正式的宴会）可能不太常用“doggie bag”，改用“to-go box / takeout container”会更中性。"],"etymology":"源自20世纪美国英语：最初用“doggie（小狗的）”来委婉表示把剩菜带走，好像是带回去给狗吃，从而避免尴尬；后来含义扩大为“打包带走”。","mnemonic":["把它想成“doggie（小狗）+ bag（袋子）”：原本说是“给狗带回去的袋子”，其实就是“打包袋”。","联想中文“打包”：吃不完→装进袋子/盒子→带走。"]}
{"word":"doggier","summary":{"en":"“Doggier” means “more dog-like,” and informally it can mean “more shabby/rough/unpleasant.”","zh":"“doggier”表示“更像狗的”；口语中也可表示“更邋遢/更糟/更不体面”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “doggy”: more like a dog (in appearance, behavior, smell, etc.).","zh":"“doggy”的比较级：更像狗的（外貌、行为、气味等）。"},"examples":[{"en":"After rolling in the mud, the puppy looked even doggier than before.","zh":"在泥里打滚后，小狗看起来比之前更“像狗”（更脏、更野）了。"},{"en":"His costume is doggier this year, with ears and a tail.","zh":"他今年的服装更“狗狗风”，加了耳朵和尾巴。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) More shabby, rough, or unpleasant; less neat or attractive.","zh":"（非正式）更邋遢的、更粗糙的或更不讨喜的；更不整洁/不美观的。"},"examples":[{"en":"The weather got doggier as the week went on—cold, wet, and windy.","zh":"这一周天气越来越糟——又冷又湿又刮风。"},{"en":"That side street is doggier at night, so I avoid it.","zh":"那条小巷晚上更乱更不安全，所以我会避开。"}]}],"synonyms":["more dog-like","more canine","shabbier","rougher","seedier"],"phonetic":"/ˈdɔɡiɚ/","extraExplanation":["“doggier”是比较级，来自形容词“doggy”。拼写规则是：以辅音字母+y结尾时，变比较级把y变成i再加-er（doggy → doggier）。","“doggy”在口语里既可能是可爱的“狗狗的”，也可能带一点贬义，表示“邋遢/糟糕”。具体褒贬要看语境。"]}
{"word":"doggies","summary":{"en":"“Doggies” is an informal, cute way to say “dogs,” and it’s the plural of “doggy.”","zh":"“doggies”是“dogs”的可爱/亲昵称呼，也是“doggy”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Dogs—used as a cute or affectionate way to talk about dogs, often to children or pets.","zh":"（非正式）狗狗；用可爱、亲昵的说法来指“狗”，常用于对孩子或对宠物说话。"},"examples":[{"en":"Do you want to go see the doggies at the park?","zh":"你想去公园看狗狗吗？"},{"en":"Look at those doggies—they’re so friendly.","zh":"看那些狗狗——它们好亲人。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “doggy” (a small dog or a dog spoken of in a cute way).","zh":"“doggy”的复数：小狗；或用萌萌的方式称呼狗。"},"examples":[{"en":"The puppies are like little doggies chasing each other.","zh":"这些小狗像小狗狗一样互相追着跑。"},{"en":"She drew two doggies in her notebook.","zh":"她在笔记本上画了两只狗狗。"}]}],"synonyms":["dogs","puppies","pups","doggos"],"phonetic":"/ˈdɔɡiz/","extraExplanation":["“doggies”来自“doggy”的复数形式；“doggy”里的 -y / -ie 是英语里常见的“昵称/小可爱”后缀（diminutive），让语气更亲昵、更孩子气。","日常口语中更常说“dogs”。“doggies”多用于和孩子说话、对宠物说话，或在轻松可爱的语境里。","注意拼写与发音：dog + -y → doggy（复数 doggies），y 变成 i 再加 -es。"]}
{"word":"doggiest","summary":{"en":"“Doggiest” means “most dog-like,” often used informally to mean very puppy-like/cute or strongly dog-like in behavior or smell.","zh":"“Doggiest”意为“最像狗的”，口语中常指特别有小狗气质/很可爱，或在行为、气味上非常“狗味”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “doggy/doggie”) most like a dog—often meaning very cute and puppy-like, or strongly “dog-like” in behavior or smell (informal).","zh":"（“doggy/doggie”的最高级）最像狗的——常指非常可爱、很有小狗的感觉；也可指行为或气味很“像狗”（非正式）。"},"examples":[{"en":"That puppy is the doggiest thing I’ve ever seen—so round and playful.","zh":"那只小狗是我见过最“狗狗感”的东西——圆滚滚的，还特别爱玩。"},{"en":"After the hike, our clothes smelled doggiest because the dog rolled on them.","zh":"徒步之后，我们的衣服闻起来最“狗味”，因为狗在上面打滚了。"},{"en":"Of all the pets at the shelter, this one has the doggiest personality—always wagging its tail.","zh":"在收容所的宠物里，这只性格最“狗狗”——总是在摇尾巴。"}]}],"synonyms":["most dog-like","puppiest","canine-like"],"phonetic":"/ˈdɑɡiəst/","extraExplanation":["“doggiest”来自形容词“doggy/doggie”（像狗的、带有小狗气质的）。比较级是“doggier”，最高级是“doggiest”。","拼写上“doggy”和“doggie”都常见；“doggie”更偏可爱、口语的感觉。正式写作中更常用“dog-like”（像狗的）。"]}
{"word":"dogging","summary":{"en":"“Dogging” most commonly means persistent following/harassing (from the verb “dog”). In UK slang, it can also refer to an adult practice involving public/semi-public sexual activity.","zh":"“dogging”常见义为“尾随、纠缠不放”（源自动词 dog）。在英国俚语中也可指一种与公共/半公共场所性行为相关的成人活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often informal) The act of following or watching someone closely and repeatedly; persistent harassment or pursuit.","zh":"（常为非正式）紧盯、尾随某人；反复纠缠或持续追踪。"},"examples":[{"en":"A reporter was accused of dogging the actor everywhere he went.","zh":"有记者被指责到处尾随那位演员。"},{"en":"He felt like bad luck was dogging him all week.","zh":"他觉得一整周都像是霉运缠身。"}]},{"partOfSpeech":"n.","definition":{"en":"(British slang, adult) A practice of watching or taking part in sexual activity in public or semi-public places, sometimes arranged online.","zh":"（英式俚语，成人用语）在公共或半公共场所观看或参与性行为的活动，有时会在网上约定。"},"examples":[{"en":"The article mentioned “dogging” as a UK slang term, but didn’t describe details.","zh":"那篇文章提到“dogging”是英国俚语，但没有描述细节。"},{"en":"Some websites warn that dogging can lead to legal trouble.","zh":"一些网站提醒说，dogging 可能会引发法律问题。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “dog”: to follow closely, pursue, or trouble persistently.","zh":"“dog”的现在分词：紧跟、追逐；不断困扰。"},"examples":[{"en":"Photographers were dogging the politician during the campaign.","zh":"竞选期间，摄影师一直紧跟那位政客。"},{"en":"Doubts kept dogging her decision.","zh":"疑虑一直困扰着她的决定。"}]}],"synonyms":["following","pursuit","shadowing","stalking (sometimes)","harassment (depending on context)"],"phonetic":"/ˈdɔɡɪŋ/","extraExplanation":["“dogging”作为成人俚语主要见于英国语境，带有强烈的地域与社交文化色彩；在正式场合、学习或工作沟通中应避免使用，以免造成冒犯或误解。","在新闻或法律语境中出现时，通常与公共秩序、隐私与违法风险相关；理解其含义即可，不建议在日常会话里随意提起。"]}
{"word":"doggish","summary":{"en":"Doggish means dog-like, often implying rude or unpleasant behavior; it can also simply mean relating to dogs.","zh":"doggish 意为“像狗一样的”，常含“粗鲁、令人不快”的贬义；也可指“与狗有关的/犬类的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a dog in behavior or appearance; often suggesting rough, crude, or unpleasant manners.","zh":"像狗一样的；常带贬义，指举止粗鲁、下作或令人不快的。"},"examples":[{"en":"He was drunk and doggish, snapping at anyone who spoke to him.","zh":"他喝醉了，变得很“狗性”，对跟他说话的人都恶狠狠地回嘴。"},{"en":"The review criticized the film for its doggish humor.","zh":"影评批评这部电影的幽默很粗俗低级。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to dogs; dog-like.","zh":"与狗有关的；犬类的；犬似的。"},"examples":[{"en":"The hunter followed the doggish scent through the wet grass.","zh":"猎人顺着那种“犬类的”气味穿过湿草地追踪。"}]}],"synonyms":["doglike","curish","brutish","boorish"],"phonetic":"/ˈdɔɡɪʃ/","extraExplanation":["“doggish”在现代英语里不算常用，更常见的是“doglike”。当它用来形容人的时候，往往带有批评或轻蔑的语气，暗示“粗野、下作、令人讨厌”。","在一些较老的文学或正式写作中，“doggish”可能用来表现人物的卑微、困顿或受辱处境（类似“像狗一样被对待”的意象），属于带有情绪色彩的写法。"]}
{"word":"doggishly","summary":{"en":"“Doggishly” means in a stubborn, rude, or persistently pushy way; less commonly, in a loyal, dog-like way.","zh":"“doggishly”指以顽固、粗鲁或死缠烂打的方式；较少见时也可指像狗一样忠诚地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rude, stubborn, or unpleasantly persistent way; like a dog that won’t give up.","zh":"以粗鲁、顽固或令人不快地死缠烂打的方式；像狗一样不肯放弃。"},"examples":[{"en":"He doggishly refused to apologize, even when he knew he was wrong.","zh":"即使他知道自己错了，他仍然顽固地拒绝道歉。"},{"en":"She kept doggishly asking the same question until the manager answered.","zh":"她死缠烂打地反复问同一个问题，直到经理回答为止。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a loyal or devoted way, like a faithful dog (less common).","zh":"以忠诚、专一的方式；像忠犬一样（较少见）。"},"examples":[{"en":"He followed his coach doggishly, trusting every instruction.","zh":"他像忠犬一样跟随教练，信任每一条指令。"}]}],"synonyms":["stubbornly","obstinately","persistently","rudely","doggedly","loyally"],"phonetic":"/ˈdɔːɡɪʃli/","extraExplanation":["“doggishly”来自形容词“doggish”（像狗的）。在现代英语里，它更常带贬义，强调“固执、粗鲁、纠缠不休”。如果想表达正面的“忠诚”，更自然的词通常是“loyally / faithfully / devotedly”。","文学或较正式的语境中，作者有时用“doggishly”来塑造人物的“屈辱式顺从”或“低姿态的依附”，带一点情绪色彩，而不仅是客观描述。"]}
{"word":"doggishness","summary":{"en":"“Doggishness” means the quality of being doggish—dog-like behavior or a surly/crude manner.","zh":"“doggishness”指“像狗一样的特质”，可指字面上的狗般行为，也常指阴沉、粗俗、缺乏教养的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being doggish: behaving like a dog (especially in a rough, eager, or animal-like way), or showing a surly/crude manner.","zh":"“doggish（像狗的）”的特质：表现得像狗一样（尤其指粗鲁、急切或偏动物性），或带有阴沉、粗俗的态度。"},"examples":[{"en":"The novel describes his sudden doggishness when food was brought into the room.","zh":"小说描写了食物一端进房间，他立刻显出一种“像狗一样”的急切。"},{"en":"Her patience ran out with his doggishness and rude jokes.","zh":"他那种粗俗、阴沉的样子和不礼貌的玩笑让她的耐心耗尽了。"}]}],"synonyms":["canine behavior","animal-like behavior","boorishness","crudeness","surliness"],"phonetic":"/ˈdɔɡɪʃnəs/","extraExplanation":["这是一个较少见的名词，构词法很直观：dog（狗）+ -ish（有点像……的）+ -ness（……的性质/状态）。","doggish 在英语里除了“像狗的”这种字面意义外，也常带负面语气，指“粗鲁、下作、阴沉或缺乏教养的样子”；doggishness 也就常用来概括这种“令人反感的狗性/粗鲁气”。","在文学写作中，这类词有时用来强调人物“被本能驱动”的状态（例如对食物、欲望或地位的渴求），带有讽刺或批评意味。"]}
{"word":"doggle","summary":{"en":"“Doggle” usually means goggles designed for dogs (often seen as “doggles”).","zh":"“doggle”通常指给狗戴的护目镜（常见写法为复数“doggles”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"protective goggles made to fit a dog’s face (often used for wind, dust, UV, or debris).","zh":"给狗戴的护目镜（用于防风、沙尘、紫外线或碎屑等）。"},"examples":[{"en":"My dog wears doggles on motorcycle rides to protect his eyes.","zh":"我带狗坐摩托车时会给它戴护目镜，保护眼睛。"},{"en":"The vet suggested doggles after the surgery to keep dust out.","zh":"手术后兽医建议用狗狗护目镜，避免灰尘进入眼睛。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, rare) a dog; a doggie.","zh":"（非正式，罕见）狗；小狗。"},"examples":[{"en":"Look at that little doggle running around!","zh":"看那只小狗跑来跑去！"}]}],"synonyms":["dog goggles","canine goggles","pet goggles"],"phonetic":"/ˈdɔɡəl/","extraExplanation":["“Doggle”更常见的形式是复数“doggles”，来自“dog + goggles”的合成词，在宠物用品、摩托/滑雪/徒步等户外场景里很常见。部分情况下也可能是品牌名（如某些护目镜产品），日常表达里可直接说“dog goggles”更清楚。"]}
{"word":"doggo","summary":{"en":"“Doggo” is an informal internet word meaning “dog,” used in a cute, playful way.","zh":"“doggo”是网络上的非正式说法，表示“狗/狗狗”，语气可爱、俏皮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, internet slang) A dog; a cute or playful way to refer to a dog.","zh":"（非正式/网络俚语）狗狗；用更可爱、俏皮的方式称呼“狗”。"},"examples":[{"en":"Look at that doggo—he’s so happy!","zh":"看看那只狗狗——它好开心！"},{"en":"My doggo always waits by the door when I get home.","zh":"我家狗狗总是在我回家时守在门口等我。"}]}],"synonyms":["dog","pupper","puppo"],"phonetic":"/ˈdɔɡoʊ/","extraExplanation":["“doggo”常见于英语网络文化（尤其是表情包、社交媒体），带有撒娇/卖萌的语气，类似中文的“汪星人/狗狗”。在正式写作中一般不用。","相关的网络可爱说法还有：pupper（小狗/狗狗）、puppo（更俏皮的变体）、good boy/girl（乖狗狗）、floof（毛茸茸的动物，常指很蓬松的狗）。"]}
{"word":"doggone","summary":{"en":"“Doggone” is an informal, mild exclamation or adjective used to show annoyance or emphasis.","zh":"“doggone”是非正式且较温和的感叹词或形容词，用来表达烦恼或强调。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(informal) Used to show mild anger, surprise, or emphasis; a “soft” substitute for stronger swear words.","zh":"（非正式）表示轻微的生气、惊讶或强调；常用作较温和的“替代脏话”。"},"examples":[{"en":"Doggone it! I forgot my keys again.","zh":"真是的！我又忘带钥匙了。"},{"en":"That doggone printer never works when I need it.","zh":"那台该死的打印机我一需要它就不工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Annoying; used to complain about something in a mild way.","zh":"（非正式）讨厌的、烦人的；用于温和地抱怨某事物。"},"examples":[{"en":"This doggone traffic is making us late.","zh":"这该死的交通让我们迟到了。"},{"en":"I can’t open this doggone jar.","zh":"我打不开这该死的罐子。"}]}],"synonyms":["darn","dang","blasted","pesky"],"phonetic":"/ˈdɔːɡɔn/","extraExplanation":["“doggone”多见于美式口语，语气通常比“damn”更轻，带点老派、乡土或幽默的感觉。","常见搭配：doggone it（真是的/该死）、that/this doggone + 名词（这/那该死的……）。有时也会写作“doggone(d)”。"]}
{"word":"doggoned","summary":{"en":"“Doggoned” is an informal, mildly comic way to say “damned,” used to show annoyance or emphasis.","zh":"“doggoned”是非正式、略带幽默的委婉说法，相当于“damned”，用于表达恼火或强调。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to show mild annoyance, surprise, or emphasis; a polite-sounding substitute for stronger swear words (like “damned”).","zh":"（感叹词/强调用语）表示轻微的恼火、惊讶或强调；是一种较委婉的替代咒骂说法（类似用来替代“damned”等更强烈的粗口）。"},"examples":[{"en":"Doggoned it, I forgot my keys again.","zh":"真是的，我又把钥匙忘了。"},{"en":"That doggoned printer won’t work.","zh":"那该死的（讨厌的）打印机就是不工作。"},{"en":"He’s a doggoned good mechanic.","zh":"他真是个非常厉害的修车师傅。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Dialect/Informal) A playful or old-fashioned way to say “damned,” often used before a noun.","zh":"（方言/非正式）一种带玩笑或旧式口吻的“damned（该死的）”说法，常放在名词前作修饰语。"},"examples":[{"en":"I’ve got a doggoned headache.","zh":"我头疼得要命。"},{"en":"It was a doggoned mess after the party.","zh":"派对过后简直一团糟。"}]}],"synonyms":["darned","dang","blasted","confounded (old-fashioned)"],"phonetic":"/ˈdɔːɡˌɡɑːnd/","extraExplanation":["“doggoned / doggone(d)”常见于美式口语，尤其带一点乡村/老派（old-fashioned）味道。因为英语里很多咒骂词与宗教相关（如“damn”），人们会用较委婉的“minced oaths（委婉咒骂）”来替代，像“darn / dang / doggone(d)”。","拼写上既可见“doggone”也可见“doggoned”。“doggone”常当感叹词（Doggone it!），而“doggoned”更常当形容词来修饰名词（a doggoned problem）。","语气通常不算粗鲁，但在正式写作里不常用；更适合对话、小说人物口吻或轻松吐槽。"]}
{"word":"doggoneder","summary":{"en":"“doggoneder” is a nonstandard/dialect spelling of “doggone/doggoned,” meaning “damned” (a mild euphemism) or used as an annoyed exclamation.","zh":"“doggoneder”多为“doggone/doggoned”的非标准/方言拼写，表示“该死的”（委婉说法）或用作恼火的感叹。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, dialect spelling) A variant of “doggone/doggoned,” used as a mild substitute for “damned,” expressing annoyance or emphasis.","zh":"（非正式/方言拼写）“doggone/doggoned”的变体，用来委婉代替“damned（该死的）”，表示恼火或加强语气。"},"examples":[{"en":"Where’s my doggoneder hat? I just had it a minute ago.","zh":"我的狗goneder（该死的）帽子在哪儿？我刚才还戴着呢。"},{"en":"It’s a doggoneder shame we missed the last bus.","zh":"错过末班车真是太狗goneder（太可惜/真倒霉）了。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used before a word for emphasis, similar to “really” or “so,” often showing irritation.","zh":"放在词前作强调，类似“really/so”，常带有不耐烦或生气的语气。"},"examples":[{"en":"It’s doggoneder hot today.","zh":"今天真是热得狗goneder（要命）。"},{"en":"That doggoneder thing won’t start.","zh":"那台狗goneder（该死的）东西就是启动不了。"}]},{"partOfSpeech":"int.","definition":{"en":"An exclamation showing annoyance (similar to “Doggone it!”).","zh":"感叹语，表示恼火（类似“Doggone it!”=“真讨厌/该死！”）。"},"examples":[{"en":"Doggoneder! I forgot my keys again.","zh":"狗goneder！（真讨厌！）我又忘带钥匙了。"}]}],"synonyms":["doggone","doggoned","darn","dang","blasted"],"phonetic":"/ˈdɔɡoʊn/","extraExplanation":["“doggone/doggoned”在美式英语里常被当作“damn/ damned”的委婉说法（避免直接说脏话），在美国南部/西部口语、乡村题材对白里更常见。","“doggoneder”多半是为了模仿口音或口语节奏的创意拼写（eye dialect），通常不是标准拼写；写作或正式场合建议用“doggone”或“doggoned”。","在文学与影视中，这类表达常用来营造朴实、乡土或老派的语气（例如一些19世纪到20世纪的美国地域写作风格）。"]}
{"word":"doggonedest","summary":{"en":"An informal, old-fashioned emphasis word meaning “the most,” often expressing surprise or annoyance.","zh":"口语、略老派的强调词，表示“最……的”，常用来表达惊讶或恼火。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used for emphasis to mean “the most” (often the most surprising, annoying, stubborn, etc.); a mild, old-fashioned substitute for a stronger swear word.","zh":"用于加强语气，表示“最……的”（常指最让人惊讶、恼火、顽固等）；是一种较温和、略带老派的感叹用语，用来替代更粗的咒骂。"},"examples":[{"en":"That’s the doggonedest thing I’ve ever heard.","zh":"那真是我听过最离谱的事。"},{"en":"It’s the doggonedest lock—no key seems to fit.","zh":"这锁真是最麻烦的那种——怎么试都没有钥匙能配上。"},{"en":"He’s the doggonedest kid—always asking a hundred questions.","zh":"他真是个最“特别”的孩子——总是问一大堆问题。"}]}],"synonyms":["strangest","oddest","damnedest","most annoying","most remarkable"],"phonetic":"/ˈdɔɡoʊndɛst/","extraExplanation":["“doggonedest”是“doggone”的最高级形式，常见于较口语、偏美式、带点乡土/老派风格的表达中，用来加强情绪但不至于太粗鲁。","“doggone”历史上常被认为是对“goddamned（该死的）”的委婉替代，因此语气上带一点“抱怨/惊讶/强调”，但比直接骂人更温和。"]}
{"word":"doggoner","summary":{"en":"“Doggoner” is an informal word meaning a pesky person/thing, or used like “darned/darn!” to show mild annoyance or emphasis.","zh":"“doggoner”是非正式用语，可指“讨厌的人/东西”，也可像“该死的/真倒霉！”那样表达轻度恼火或强调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, dialect) A person or thing you feel annoyed with; a rascal or troublesome person/thing (used playfully or mildly).","zh":"（非正式/方言）让人恼火的人或事物；讨厌鬼、捣蛋鬼（多为玩笑或较温和的说法）。"},"examples":[{"en":"That doggoner broke the gate again.","zh":"那个讨厌鬼又把门弄坏了。"},{"en":"Some doggoner keeps moving my tools.","zh":"总有个家伙一直在挪我的工具。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Darned; annoying; used to add emphasis, often before a noun.","zh":"（非正式）该死的、讨厌的（用于强调，常放在名词前）。"},"examples":[{"en":"This doggoner computer won’t start.","zh":"这台该死的电脑就是打不开。"},{"en":"I can’t find my doggoner keys.","zh":"我找不到我那该死的钥匙。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal) A mild exclamation showing annoyance or emphasis, similar to “darn!”","zh":"（非正式）表示恼火或强调的温和感叹词，相当于“darn!”。"},"examples":[{"en":"Doggoner! I missed the bus.","zh":"真倒霉！我错过公交了。"},{"en":"Doggoner, that hurts.","zh":"哎呀，真疼。"}]}],"synonyms":["darn","darned","pesky","rascal","blasted","confounded"],"phonetic":"/ˈdɔɡoʊnɚ/","extraExplanation":["“doggoner”常见于美式口语、乡村/南部等方言语感中，语气多为调侃或轻度生气。","它与“doggone”相关，历史上常被认为是对更粗俗的咒骂（如“goddamn”）的委婉替代，因此在较保守或避免脏话的语境里更常用。"]}
{"word":"doggones","summary":{"en":"“Doggone” is a mild, informal way to say “darn/dang,” used as an interjection or as an adjective meaning “annoying/unlucky.”","zh":"“doggone”是较委婉的口语感叹/形容用法，相当于“darn/dang”，可表示“真讨厌/倒霉的”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(mild, informal) Used to show annoyance, surprise, or emphasis; similar to “darn!” or “dang!”","zh":"（非正式、较委婉）用于表达恼火、惊讶或加强语气；类似于“哎呀/真讨厌！”（相当于较轻的“damn”）"},"examples":[{"en":"Doggone it—I forgot my keys again.","zh":"真讨厌——我又忘带钥匙了。"},{"en":"Doggone! That was close.","zh":"哎呀！差一点就出事了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Annoying or unlucky; used before a noun as a mild substitute for “damned.”","zh":"（非正式）讨厌的；倒霉的；放在名词前，作为较委婉的“该死的”替代说法"},"examples":[{"en":"This doggone printer keeps jamming.","zh":"这台该死的（真讨厌的）打印机老是卡纸。"},{"en":"I can’t find that doggone file anywhere.","zh":"我到处都找不到那份该死的文件。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare, informal) To curse or condemn; to say “damn” (usually joking or old-fashioned).","zh":"（较少见、非正式）诅咒；咒骂（多带玩笑或偏老派语气）"},"examples":[{"en":"He doggone-d the weather for ruining the picnic.","zh":"他咒骂这鬼天气把野餐给毁了。"}]}],"synonyms":["darn","dang","blasted","confounded"],"phonetic":"ˈdɔɡˌɡɔn","extraExplanation":["你输入的 **doggones** 多半是口语/网络里对 **doggone** 的一种随意拼写（有时也像是在加复数或加强语气）。标准写法通常是 **doggone**（也常见 **doggoned**）。","**doggone** 常被认为是对 **“goddamn”** 的委婉说法（用来避开直接的宗教性咒骂），因此语气更“温和”，但在正式写作中仍应少用，偏口语、偏老派。"]}
{"word":"doggonest","summary":{"en":"“Doggonest” is an informal, dialect word used for emphasis, meaning “very annoying/stubborn” or as a mild frustrated exclamation.","zh":"“doggonest”是非正式方言用语，用来加强语气，可表示“很讨厌／很倔／该死的”，也可作较委婉的恼火感叹。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, dialect) Used as an emphatic adjective meaning “very annoying,” “stubborn,” or “damn(ed)” (a mild swear).","zh":"（非正式／方言）作强调形容词，表示“很讨厌的／很顽固的／该死的”（较委婉的咒骂语）。"},"examples":[{"en":"That doggonest printer jammed again.","zh":"那台讨厌的打印机又卡纸了。"},{"en":"I can’t find the doggonest key anywhere.","zh":"我哪儿都找不到那把该死的钥匙。"},{"en":"He’s the doggonest mule I’ve ever tried to move.","zh":"那头骡子倔得要命，是我见过最难赶动的。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal, dialect) Used as a mild exclamation to show frustration or emphasis.","zh":"（非正式／方言）作感叹语，用来表达恼火或强调语气（较委婉）。"},"examples":[{"en":"Doggone it! I missed the bus.","zh":"真讨厌！我错过公交了。"},{"en":"Doggone, that was close.","zh":"我的天，差一点就出事了。"}]}],"synonyms":["doggone","darned","dang","blasted (informal)","damned (stronger)"],"phonetic":"/ˈdɔɡoʊnɪst/","extraExplanation":["“doggonest”常见于美国口语（尤其带乡村/南方/西部风格的表达），语气通常比“damn/damnedest”更委婉，属于“轻度爆粗”。","它来自对“goddamned / goddamn it”等更强烈咒骂的委婉替代（euphemism）。在较正式场合尽量避免使用。"]}
{"word":"doggoning","summary":{"en":"“Doggoning” is an informal, dialect form of “doggone,” used as a mild swear or intensifier meaning “darn/annoying/very.”","zh":"“doggoning”是非正式的方言写法，源自“doggone”，可作温和的咒骂或强调词，意思接近“该死的／讨厌的／非常”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Informal, dialect) A mild swear word used for emphasis, similar to “doggone!” meaning “darn!” or “oh no!”","zh":"（非正式／方言）温和的感叹或咒骂，用来加强语气，类似“doggone!”表示“哎呀／该死（但不太粗鲁）”。"},"examples":[{"en":"Doggoning it! I forgot my keys again.","zh":"Doggoning it! 我又忘带钥匙了。"},{"en":"Doggoning, that was a close call.","zh":"Doggoning，刚才真险。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, dialect) Used before a noun to show annoyance: “that doggoning …” = “that darn …”","zh":"（非正式／方言）放在名词前表示烦恼或不满：“that doggoning …”=“那个讨厌的／该死的……”。"},"examples":[{"en":"That doggoning alarm keeps going off at night.","zh":"那个该死的警报老是在晚上响。"},{"en":"I can’t fix this doggoning printer.","zh":"我修不好这台讨厌的打印机。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Informal, dialect) Used as an intensifier meaning “very/so”: “doggoning tired” = “really tired.”","zh":"（非正式／方言）作强调词，表示“很／非常”：“doggoning tired”=“累死了／特别累”。"},"examples":[{"en":"I’m doggoning tired after that trip.","zh":"那趟旅行后我真是累坏了。"},{"en":"It’s doggoning hot in here.","zh":"这里热得要命。"}]}],"synonyms":["darn","dang","blasted","heck","really"],"phonetic":"/ˈdɔɡˌɡɔn/","extraExplanation":["“doggoning”多见于口语或方言写法，常被当作“doggone / doggoned”的变体，用来表达不满或加强语气。","它通常被认为是对“goddamn”的委婉说法（避开更冒犯的粗口），在美国南方／乡村口语风格中更常见。","在正式写作中不常用；如果想更中性，可以用“really/very”或“annoying/darn”。"]}
{"word":"doggos","summary":{"en":"“Doggos” is an informal, cute internet way to say “dogs.”","zh":"“doggos”是网络上用来可爱地说“狗狗/狗们”的非正式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, internet slang) Dogs; a cute or affectionate way to talk about dogs, especially online.","zh":"（非正式/网络用语）狗狗；对狗的一种可爱、亲昵的说法，常用于网络语境。"},"examples":[{"en":"Look at those sleepy doggos on the couch.","zh":"看看沙发上那些困困的狗狗。"},{"en":"I love all doggos, big or small.","zh":"我喜欢所有狗狗，不管大只还是小只。"},{"en":"This video has the happiest doggos ever!","zh":"这个视频里的狗狗简直开心到爆！"}]}],"synonyms":["dogs","pups","puppers","doggies"],"phonetic":"ˈdɔɡoʊ","extraExplanation":["“doggo / doggos”最早在英语网络社区里流行，属于一种“可爱化”的说法（类似把词说得更萌）。常和“pupper(s)”（小狗狗）一起出现。","语气通常轻松、夸张、卖萌，适合聊天、社交媒体、评论区；在正式写作中建议用“dogs”。"]}
{"word":"doggrel","summary":{"en":"Doggerel means poorly written, often silly poetry or rhyme; it can also describe writing that sounds like that.","zh":"doggerel 指拙劣、常带搞笑或幼稚感的诗/押韵句，也可作形容词形容“像打油诗一样粗糙”的文字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"poetry or verse that is clumsy, childish, or of very low literary quality (often used critically).","zh":"（常作贬义）打油诗；拙劣、粗糙或幼稚的诗歌/诗句。"},"examples":[{"en":"The critic dismissed the song lyrics as doggerel.","zh":"评论家把这首歌的歌词斥为打油诗。"},{"en":"He scribbled a few lines of doggerel in his notebook.","zh":"他在笔记本上随手写了几句拙劣的小诗。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of poetry or writing) crude, awkward, or written without skill; not serious literature.","zh":"（指诗或文字）拙劣的；粗糙的；不登大雅之堂的。"},"examples":[{"en":"The novel is interrupted by doggerel rhymes that don’t fit the mood.","zh":"小说中穿插的拙劣押韵句与氛围格格不入。"},{"en":"She apologized for her doggerel attempts at poetry.","zh":"她为自己拙劣的诗歌尝试而道歉。"}]}],"synonyms":["bad verse","poor poetry","jingle","rhyme","verse (derogatory)"],"phonetic":"ˈdɔɡrəl","extraExplanation":["“doggerel”常用于文学批评，带有“写得很差、像胡乱押韵”的否定意味，但在轻松语境里也可指逗趣的打油诗。","词源上可能与古英语/中古英语中表示“粗糙、低劣”的词有关；现代用法主要保留了“低质量诗歌/押韵句”的含义。","在英语文化里，人们有时会用“doggerel”形容某些广告歌、儿童押韵句或刻意搞笑的韵文：它不一定“没有价值”，但通常不被当作严肃文学。"]}
{"word":"doggrelize","summary":{"en":"Doggrelize (more commonly doggerelize) means to write doggerel or to turn writing into clumsy, silly rhyming verse.","zh":"doggrelize（更常见拼写为 doggerelize）指写打油诗，或把文字改写成拙劣、滑稽的押韵诗句。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn (good writing, poetry, or ideas) into doggerel—bad, simple, or silly verse; to make something sound like poor poetry","zh":"把（原本较好的文字、诗或想法）写成/改成打油诗式的拙劣诗句；使之听起来像劣质诗歌"},"examples":[{"en":"The editor warned him not to doggerelize the serious speech with forced rhymes.","zh":"编辑警告他不要用生硬押韵把严肃的演讲“打油诗化”。"},{"en":"A few catchy lines can be fun, but it’s easy to doggerelize a complex topic.","zh":"几句顺口溜可以很有趣，但复杂话题很容易被写得“打油诗化”。"}]},{"partOfSpeech":"vi.","definition":{"en":"to write in doggerel; to produce clumsy or comic rhyming verse","zh":"写打油诗；写出笨拙或滑稽的押韵诗句"},"examples":[{"en":"He started doggerelizing about the weather to make the children laugh.","zh":"他开始用打油诗调侃天气，逗孩子们笑。"}]}],"synonyms":["doggerelize","make into doggerel","dumb down (in style)","versify (often poorly)"],"phonetic":"/ˈdɑːɡɚəˌlaɪz/","extraExplanation":["“doggrelize”是较少见的拼写；更常见的是“doggerelize”，来自“doggerel（打油诗、拙劣诗）”。","这个词常带一点批评意味：指把本来可以严肃或优美的内容，处理得过于顺口、低俗或显得廉价（尤其为了押韵而牺牲表达）。"]}
{"word":"doggrels","summary":{"en":"Doggerel means silly or poorly written poetry with simple rhyme and rhythm.","zh":"doggerel 指押韵简单、常被认为拙劣或滑稽的“打油诗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually uncountable) Bad or silly poetry with simple rhythm and rhyme; writing that sounds like verse but is not considered serious or skillful.","zh":"（通常不可数）打油诗；拙劣或滑稽的诗（有简单的节奏和押韵，但通常不被认为严肃或高水平）。"},"examples":[{"en":"The critic dismissed the lyrics as doggerel.","zh":"评论家把这些歌词斥为打油诗。"},{"en":"He wrote a few lines of doggerel for a friend’s birthday card.","zh":"他为朋友的生日卡写了几句打油诗。"},{"en":"Don’t mistake catchy rhyme for good poetry—some of it is just doggerel.","zh":"别把顺口押韵当成好诗——有些只是打油诗。"}]},{"partOfSpeech":"n.","definition":{"en":"(Countable) A single poem or piece of writing that is in this low-quality, sing-song style.","zh":"（可数）一首（或一段）打油诗式的作品。"},"examples":[{"en":"She found a doggerel about exams taped to the classroom door.","zh":"她在教室门上发现贴着一首关于考试的打油诗。"},{"en":"The magazine printed a short doggerel as a joke.","zh":"那本杂志开玩笑地刊登了一首短打油诗。"}]}],"synonyms":["bad poetry","silly verse","comic verse","verse","rhyme"],"phonetic":"/ˈdɔɡərəl/","extraExplanation":["你输入的“doggrels”更常见的拼写是 **doggerels**（doggerel 的复数）。","doggerel 常带一点“轻蔑/不屑”的语气：说它“押韵但不高明”。不过在日常生活里，也有人用它来形容“故意写得滑稽、逗趣”的打油诗。","相关表达：**bad poetry**（烂诗）、**silly verse**（滑稽的诗句）、**comic verse**（诙谐诗）；近义词有时可用 **verse**（诗/韵文，较中性）或 **rhyme**（押韵短诗/儿歌）。"]}
{"word":"doggy","summary":{"en":"“Doggy” usually means a cute, informal way to say “dog,” and it can also (less commonly) describe overly submissive behavior.","zh":"“doggy”通常是“狗/小狗”的可爱口语说法；较少见时也可形容过度讨好、卑微的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cute, informal word for a dog, often used when talking to children or showing affection.","zh":"（对狗的）可爱、非正式说法，常用于对小孩说话或表达喜爱。"},"examples":[{"en":"Look at that doggy—it’s so friendly!","zh":"看看那只小狗狗——它好友善！"},{"en":"Do you want to pet the doggy?","zh":"你想摸摸小狗狗吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes) describing a style of behavior that is overly eager, submissive, or clingy—often used critically.","zh":"（有时）形容行为过于讨好、卑微或黏人——常带批评意味。"},"examples":[{"en":"He acted a bit doggy around the boss, always agreeing with everything.","zh":"他在老板面前有点太“讨好”了，什么都附和。"},{"en":"Try not to be doggy—share your real opinion.","zh":"别那么卑微讨好——说说你的真实想法。"}]}],"synonyms":["dog","puppy","pooch","doggie","pup"],"phonetic":"/ˈdɔːɡi/","extraExplanation":["“doggy”是“dog”的亲昵称呼，最常见于儿童用语、家庭口语和宠物相关场景。写作中偏口语；正式场合更常用“dog”。","在某些语境里，“doggy”作形容词可能带贬义，指像小狗一样“摇尾乞怜”的姿态；具体含义取决于语气和上下文。","注意：与“doggy style”（性姿势相关表达）不同；在不确定场合尽量避免用该短语，以免引起尴尬或冒犯。"]}
{"word":"doggy bag","summary":{"en":"a restaurant container for taking leftovers home","zh":"餐馆用于把剩菜带走的打包袋/外带盒"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bag (or container) given by a restaurant for taking leftover food home.","zh":"（餐馆提供的）打包袋/外带盒，用来把剩菜带回家。"},"examples":[{"en":"Could we get a doggy bag for the fries?","zh":"薯条可以帮我们打包吗？"},{"en":"I’ll take the rest to go—can you pack it in a doggy bag?","zh":"剩下的我想带走，可以帮我装进打包袋吗？"}]}],"synonyms":["to-go box","takeout container","leftover box"],"phonetic":"/ˈdɔɡi bæɡ/","extraExplanation":["在美国点餐文化里，直接说“Can I get a doggy bag?”很常见，也可以更礼貌地说“Could I get this to go?”或“Can you box this up?”","有些正式场合或较高档餐厅更常说“to-go box / takeout container / box it up”，而不是“doggy bag”。"],"etymology":"源自20世纪美国英语：字面意思是“给小狗的袋子”，最初用来委婉地表示把剩菜带走（好像是带回去喂狗），后来就泛指“打包带走的容器”。","mnemonic":["把“doggy”想成“狗狗吃剩饭”：以前人们不好意思说自己要带剩菜，就说“带回去给狗吃”，于是就有了这个说法。"]}
{"word":"doggy-paddle","summary":{"en":"a basic way of swimming by paddling like a dog","zh":"像狗一样划水的基础泳法（狗刨）"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to swim in a simple way by moving your arms and legs like a dog, usually with your head above the water","zh":"（像狗一样）狗刨式游泳；用手脚简单划水（通常头露出水面）"},"examples":[{"en":"When I was a kid, I could only doggy-paddle across the pool.","zh":"我小时候只会用狗刨式游过泳池。"},{"en":"He started to panic, but then he doggy-paddled back to the edge.","zh":"他开始慌了，但后来用狗刨式游回了池边。"}]},{"partOfSpeech":"n.","definition":{"en":"a simple swimming style where you move your arms and legs like a dog, often used by beginners","zh":"狗刨泳（手脚像狗一样划水的基础泳姿，常见于初学者）"},"examples":[{"en":"She learned doggy-paddle first before taking formal lessons.","zh":"她先学会狗刨泳，之后才去上正规的游泳课。"},{"en":"Doggy-paddle is common for young children who are just getting comfortable in water.","zh":"刚开始适应水的小孩子很常用狗刨泳。"}]}],"synonyms":["paddle","dog paddle"],"phonetic":"/ˈdɔɡi ˌpæd(ə)l/","extraExplanation":["“doggy-paddle”常带有“初学者、很基础”的语感；在正式训练或竞技语境中，人们通常会用更标准的泳姿（如 freestyle/crawl）。","连字符写法 doggy-paddle 很常见；也可写作 doggy paddle。"],"etymology":"来自“doggy（小狗的、像狗一样的）+ paddle（用手脚划水）”，因动作像狗在水里划动四肢而得名。","mnemonic":["把它拆开记：doggy（小狗）+ paddle（划水）→“像小狗一样划水”。","联想中文“狗刨”，英文就是 doggy-paddle。"]}
{"word":"doghead","summary":{"en":"Doghead most commonly means “a dog’s head” literally; in older writing it can also be an insult meaning “a contemptible person.”","zh":"doghead最常见是字面意思“狗的头/狗头”；在较旧的写法中也可作辱骂词，指“卑鄙的人/讨厌的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the head of a dog (literal meaning).","zh":"（字面）狗的头；狗头。"},"examples":[{"en":"The statue had a doghead and a human body.","zh":"那座雕像是狗头人身。"},{"en":"A doghead silhouette was painted on the sign.","zh":"招牌上画着一个狗头剪影。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, insulting) a contemptible or aggressive person.","zh":"（旧用法，侮辱）卑鄙的人；讨厌鬼；恶棍。"},"examples":[{"en":"In the old story, the villain is called a doghead.","zh":"在那则旧故事里，反派被骂作“狗头”。"},{"en":"The soldier shouted, “Doghead!” as an insult.","zh":"士兵喊了一句“狗头！”来辱骂对方。"}]}],"synonyms":["dog's head","cur (insult, not exact)","scoundrel (for the insulting sense)"],"phonetic":"/ˈdɔɡˌhɛd/","extraExplanation":["“doghead”在现代日常英语里并不常用；作为骂人的用法带有明显的旧式/文学色彩，现实交流中更常见的是更通用的侮辱词。","在一些中世纪或神话文本里也会出现“dog-headed people”（cynocephali，犬首人）的形象；此时的“doghead”多偏向“狗头的/犬首的”意象，而不一定是直接辱骂。"]}
{"word":"doghearted","summary":{"en":"“Doghearted” means cruel or heartless, often used as a strong insult.","zh":"“doghearted”指“残忍、冷酷无情”，常用作强烈的辱骂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cruel, harsh, or lacking compassion; inhuman (often used as an insult).","zh":"残忍的；冷酷无情的；缺乏同情心的（常作辱骂语）。"},"examples":[{"en":"He called the thief “doghearted” for hurting an old woman.","zh":"他骂那个小偷“冷酷无情”，因为对方伤害了一位老太太。"},{"en":"The story criticizes a doghearted ruler who ignores his people’s suffering.","zh":"这个故事批判了一位无视百姓疾苦的残暴统治者。"}]}],"synonyms":["heartless","cruel","callous","inhuman","cold-blooded"],"phonetic":"/ˈdɔɡˌhɑrtɪd/","extraExplanation":["“doghearted”较少见，也常写作“dog-hearted”。在英语里，dog 在一些固定用法中带有贬义（如 dog-hearted, cur），强调“卑劣/凶狠/无同情心”，并不是指“像狗一样可爱”。","文学中较知名的用例出现在莎士比亚《李尔王》（King Lear）里，Lear 用“dog-hearted daughters”痛骂女儿的无情。现代英语里更常用 cruel, heartless, callous, inhuman 来表达。"]}
{"word":"doghobble","summary":{"en":"“Doghobble” is a tangled, arching shrub (often drooping leucothoe) that can trip or slow animals.","zh":"“doghobble”指枝条交错、弯垂纠结、容易绊住动物的灌木，常指北美的垂枝马醉木等植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub (especially in the heath family) with tangled, arching branches that can “hobble” (trip or slow down) animals; often refers to drooping leucothoe.","zh":"一种灌木（多属杜鹃花科/石南科相关植物），枝条弯垂交错，容易“绊住”动物；常指北美的垂枝马醉木（drooping leucothoe）。"},"examples":[{"en":"The trail was crowded with doghobble, and we had to push through the dense branches.","zh":"小路旁长满了 doghobble，我们得拨开密密的枝条才能过去。"},{"en":"In that shady garden corner, doghobble stays green and spreads slowly.","zh":"在花园阴凉的角落里，doghobble 常绿，而且会慢慢扩展。"}]}],"synonyms":["drooping leucothoe","leucothoe","tanglebush (informal)"],"phonetic":"ˈdɔɡˌhɑbəl","extraExplanation":["“doghobble”是常见俗名，不是严格的单一物种学名；在北美不同地区可能指不同但相似的灌木（常见指 Leucothoe fontanesiana）。","词源很直观：hobble 表示“使行动不便/绊住”，形容这种植物枝条纠结、容易缠住或绊倒小动物（比如狗）的特点。","园艺语境里它常用于描述耐阴、常绿的灌木地被；在野外语境里则常用于形容灌丛难以穿行。"]}
{"word":"doghole","summary":{"en":"Doghole means a dog’s hole/entryway, and informally it can mean a tiny, unpleasant place.","zh":"Doghole 指狗挖的洞或供狗进出的洞口；非正式也可指狭小、糟糕的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hole in the ground or a small opening used by a dog as a shelter, den, or way in/out (often written as “dog hole”).","zh":"狗在地上挖的洞，或供狗进出、躲藏的狭小洞口（常写作“dog hole”）。"},"examples":[{"en":"The puppy crawled into a dog hole under the fence.","zh":"小狗从篱笆下面的狗洞钻了过去。"},{"en":"They filled the dog hole to keep the yard from collapsing.","zh":"他们把狗洞填上，以免院子塌陷。"}]},{"partOfSpeech":"n.","definition":{"en":"informal: a very small, dirty, or unpleasant place to live or stay in.","zh":"（非正式）又小又脏、令人不舒服的住处或地方。"},"examples":[{"en":"He called the old apartment a doghole, but it was all he could afford.","zh":"他把那间旧公寓称作“狗洞”，但那是他唯一负担得起的。"},{"en":"After the storm, the room felt like a doghole—cold and damp.","zh":"暴风雨过后，房间像“狗洞”一样又冷又潮。"}]}],"synonyms":["dog hole","den","burrow","dump (informal)"],"phonetic":"ˈdɔɡˌhoʊl","extraExplanation":["“doghole / dog hole”并不是非常常见的标准词条；日常英语里更常见的是“doghouse（狗窝）”或“kennel（犬舍）”。如果你指的是门或栅栏底下给狗通行的小门/洞，也可以说“a dog door”。","比喻义通常带有贬义和抱怨语气，类似于把住处说成“a dump（破地方）”或“a shithole（粗俗：烂地方）”。在正式场合建议避免使用。"]}
{"word":"doghood","summary":{"en":"Doghood means the state of being a dog, and more rarely a dog’s life stage.","zh":"Doghood 指“作为狗的状态/特质”，较少见时也可指狗生命中的某个阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being a dog; “dog-ness” (often humorous or literary).","zh":"狗的身份或特质；“像狗一样的性质”（常带幽默或文学色彩）。"},"examples":[{"en":"In the story, the narrator reflects on loyalty as part of doghood.","zh":"在故事里，叙述者把忠诚看作“狗性”的一部分。"},{"en":"She joked that stealing socks is an important tradition of doghood.","zh":"她开玩笑说偷袜子是“狗生/狗性”的重要传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the period of a dog’s life; a dog’s life stage (rare).","zh":"狗生命中的一段时期；狗的某个成长阶段（较少见）。"},"examples":[{"en":"From puppyhood to doghood, the training stayed consistent.","zh":"从幼犬期到成犬期，训练一直保持一致。"},{"en":"The memoir describes his pet’s doghood as calm and steady.","zh":"回忆录把他宠物的成犬时期写得平静而稳定。"}]}],"synonyms":["dog-ness","canine nature","a dog's life (context-dependent)","being a dog"],"phonetic":"ˈdɔɡˌhʊd","extraExplanation":["“doghood”不是非常常用的词，更常见的是“dog’s life”（狗的一生/狗的生活）或“being a dog”（作为一只狗）。它带有一点俏皮或文学化的感觉。","后缀“-hood”表示“……的状态/身份/时期”，常见于“childhood（童年）”“adulthood（成年）”“neighborhood（社区）”。因此“doghood”可以直译为“狗的状态/狗的时期”。"]}
{"word":"doghouse","summary":{"en":"A doghouse is a small shelter for a dog; informally, it can mean being in trouble with someone (“in the doghouse”).","zh":"doghouse 指狗屋/犬舍；口语中也可指惹人生气、处于被责怪的状态（常说 in the doghouse）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shelter (usually outside) where a dog can sleep and stay out of the weather; a kennel","zh":"（通常在户外的）狗屋；犬舍"},"examples":[{"en":"We bought a new doghouse so our puppy can stay warm at night.","zh":"我们买了一个新狗屋，让小狗晚上能保暖。"},{"en":"The dog ran into its doghouse when it started to rain.","zh":"开始下雨时，那只狗跑进了狗屋。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a situation where someone is in trouble with their partner, family, or boss; being “in the doghouse”","zh":"（非正式）惹人生气、处于被责怪/受冷落的状态；（常用）“进了狗屋”（in the doghouse）"},"examples":[{"en":"He forgot their anniversary, so he’s in the doghouse now.","zh":"他忘了他们的纪念日，所以现在惹她生气了。"},{"en":"If I’m late again, I’ll be in the doghouse with my boss.","zh":"如果我再迟到，我老板就会不高兴，我就要挨批了。"}]}],"synonyms":["kennel","dog shelter","(informal) trouble","(informal) hot water"],"phonetic":"/ˈdɔɡˌhaʊs/","extraExplanation":["“in the doghouse”是很常见的美式口语，意思是“做错事而被对方不高兴/被冷落/挨批评”。它借用“狗被赶到狗屋外住”这种形象来表达受惩罚或被嫌弃的处境。"]}
{"word":"doghouses","summary":{"en":"Doghouses are small shelters for dogs; informally, “in the doghouse” means being in trouble with someone.","zh":"doghouses 指“狗屋/狗舍”；口语里 in the doghouse 表示“惹人生气、处境不妙（常指伴侣之间）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small house or shelter for a dog, usually kept outdoors (plural of “doghouse”).","zh":"狗屋；狗舍（通常放在户外，供狗休息遮风避雨；doghouse 的复数）"},"examples":[{"en":"We put a blanket inside the doghouses to keep the dogs warm in winter.","zh":"我们在狗屋里放了毯子，让狗在冬天更暖和。"},{"en":"The backyard has two doghouses—one for each dog.","zh":"后院有两间狗屋——每只狗一间。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal, usually in the phrase “in the doghouse”) in trouble with someone, especially a spouse/partner, because you did something wrong.","zh":"（非正式，常用于短语 in the doghouse）“惹某人生气/被冷落”；因做错事而处于不受欢迎的状态（常指伴侣之间）。"},"examples":[{"en":"He forgot their anniversary, so he’s in the doghouse.","zh":"他忘了纪念日，所以现在被“打入冷宫”了。"},{"en":"I’ll be in the doghouse if I come home late again.","zh":"如果我再晚回家一次，我就会惹麻烦/被嫌弃。"}]}],"synonyms":["kennels","dog shelters","dog huts"],"phonetic":"/ˈdɔɡˌhaʊs/","extraExplanation":["“in the doghouse”是很常见的口语习语，带一点幽默感，意思不是“真的住进狗屋”，而是“因为做错事而被对方不高兴/不理睬”。常见搭配：be in the doghouse, get in the doghouse。"]}
{"word":"dogie","summary":{"en":"Dogie most commonly means a stray or motherless calf in the American West; it can also be an informal spelling of “doggy/doggie” meaning a dog.","zh":"Dogie最常见的意思是（美国西部语境中的）走失或失去母牛的幼牛；也可作为“doggy/doggie（小狗）”的非正式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a motherless or stray calf (a young cow), especially in the American West","zh":"（尤指美国西部的）失去母牛的幼牛；走失的小牛"},"examples":[{"en":"The cowboys rounded up the dogies after the storm scattered the herd.","zh":"暴风雨把牛群冲散后，牛仔们把那些走失的小牛赶拢起来。"},{"en":"A dogie with no brand might be claimed later at the ranch.","zh":"没有烙印的小牛之后可能会被牧场认领。"}]},{"partOfSpeech":"n.","definition":{"en":"an informal spelling of “doggy/doggie,” meaning a dog (often used in child-directed or affectionate speech)","zh":"“doggy/doggie”的非正式拼写：小狗（常用于对孩子说话或亲昵语气）"},"examples":[{"en":"Look at the dogie! He’s so friendly.","zh":"看那只小狗！它好亲人。"},{"en":"She wrote “dogie” in her note, but the standard spelling is “doggy” or “doggie.”","zh":"她在便条里写了“dogie”，但更标准的拼写是“doggy”或“doggie”。"}]}],"synonyms":["stray calf","orphan calf","dogy","doggy","doggie"],"phonetic":"/ˈdoʊɡi/","extraExplanation":["“dogie”在牛仔文化里很常见，常出现在牧场、赶牛（cattle drive）的语境中；也常写作“dogy”。它与“doggy/doggie（小狗）”读音相近，但含义完全不同，容易混淆。"]}
{"word":"dogies","summary":{"en":"Dogies are usually motherless calves in American ranch/cowboy contexts; less commonly, it can mean an inexperienced person.","zh":"dogies 通常指美国西部牧场语境中的“无母小牛/孤儿小牛”；较少见时也可指“新手、没经验的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a motherless (or orphaned) calf, especially in the American West (plural: dogies)","zh":"（尤指美国西部的）无母小牛、孤儿小牛（复数：dogies）"},"examples":[{"en":"The cowboys rounded up the dogies after the storm separated them from their mothers.","zh":"暴风雨把小牛和母牛冲散后，牛仔把那些孤儿小牛赶拢起来。"},{"en":"On the ranch, the weakest dogies were given extra milk.","zh":"在牧场里，最弱的那些孤儿小牛会得到额外的牛奶。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) an inexperienced or helpless person; a “greenhorn” (less common)","zh":"（非正式）新手、没经验的人；不太懂行的人（较少见）"},"examples":[{"en":"I was a real dogie on my first day working cattle.","zh":"我第一天放牛时真是个新手。"},{"en":"Don’t worry—you won’t be a dogie for long if you keep practicing.","zh":"别担心，只要持续练习，你很快就不再是新手了。"}]}],"synonyms":["orphan calf","calf","maverick (related)","greenhorn (sense 2)","novice (sense 2)"],"phonetic":"/ˈdoʊɡi/","extraExplanation":["“dogie”常见于美国牛仔文化与西部题材作品（如牧场、赶牛、牛仔歌曲/口述故事）中，带有明显的地域与时代色彩。","词源并不完全确定；有观点认为可能与“dog”（狗）有关（比喻无依无靠），也有人认为与西班牙语或地方发音演变有关。现代日常英语里不算常用，更像是西部/乡村语境用词。"]}
{"word":"dogleg","summary":{"en":"Dogleg means a sharp bend (like a dog’s leg), especially a bent road/line or a golf hole that turns left or right.","zh":"dogleg 指“像狗腿一样的急弯/折角”，常指道路或线条的急转，也特指高尔夫中球道左右拐弯的“狗腿洞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sharp bend or angle in a road, path, line, or other long shape (often like a dog’s hind leg).","zh":"（道路、路径、线条等的）急弯；折角（形状常像狗的后腿）。"},"examples":[{"en":"The trail has a dogleg just before the river.","zh":"这条小径在到河边之前有一个急弯。"},{"en":"Draw a dogleg in the wire so it won’t slip out.","zh":"在铁丝上折一个折角，这样它就不会滑出来。"}]},{"partOfSpeech":"n.","definition":{"en":"In golf, a hole where the fairway bends left or right, so the green cannot be seen from the tee.","zh":"【高尔夫】狗腿洞；球道中途向左或向右弯曲，从发球台看不到果岭的球洞。"},"examples":[{"en":"The 7th is a dogleg left, so aim to the corner of the fairway.","zh":"第7洞是左狗腿洞，所以要把球瞄向球道拐角的位置。"},{"en":"He tried to cut the corner on the dogleg but hit the trees.","zh":"他想在狗腿洞抄近路绕过拐角，结果把球打进了树林。"}]},{"partOfSpeech":"vi.","definition":{"en":"To bend or turn sharply; to follow a route that has a sharp angle.","zh":"急转弯；呈折角行进/延伸。"},"examples":[{"en":"The road doglegs around the hill.","zh":"这条路绕着山丘急转弯。"},{"en":"The hallway doglegs to the right after the stairs.","zh":"楼梯后面的走廊向右急转。"}]}],"synonyms":["bend","sharp turn","kink","angle","curve"],"phonetic":"ˈdɔɡˌlɛɡ","extraExplanation":["“dogleg”这个词来自“像狗后腿那样的弯折”这一形象比喻，因此常用来描述“不是平滑弧线，而是明显的拐角/折线”。","在高尔夫里说“dogleg left/right”非常常见：指球道先直走一段，再明显向左/右拐，策略上常涉及“打到拐角处（play to the corner）”或“抄近路（cut the corner）”。","在写作中，它常用来增强画面感：比如描述道路、走廊、河流或城市街区的走向突然拐折。"]}
{"word":"doglegged","summary":{"en":"Doglegged means “bent or sharply angled, not straight.”","zh":"doglegged 表示“弯曲的、带折角的，不笔直”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a bend or sharp angle (not straight), like a dog’s hind leg; often used to describe a road, line, corridor, or shape.","zh":"弯曲的；有明显折角的（不笔直），常形容道路、路线、走廊或形状。"},"examples":[{"en":"The trail becomes doglegged after the bridge, turning sharply to the left.","zh":"过桥后小路变成折线状，突然向左急转。"},{"en":"We walked down a doglegged hallway to reach the meeting room.","zh":"我们沿着一条拐来拐去的走廊走到会议室。"},{"en":"Draw a doglegged line instead of a straight one.","zh":"画一条折线，不要画直线。"}]}],"synonyms":["bent","angled","crooked","zigzag"],"phonetic":"/ˈdɔɡˌlɛɡd/","extraExplanation":["“dogleg”原指“狗的后腿”，因为形状常被看作有弯折，所以引申为“折角/弯折的部分”。在英美日常用法里，dogleg常见于描述道路、走廊、楼梯、航线等出现突然转向的“折线段”。","相关用法：a dogleg turn（急转弯/折角转弯），dogleg stairway（折返楼梯），dogleg route（折线路线）。"]}
{"word":"doglegging","summary":{"en":"Doglegging means making (or taking) a route with a sharp turn—often a zigzag—rather than going straight.","zh":"Doglegging 指走（或形成）带急转弯的路线，常带“之”字形的曲折感，而不是直走。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a route, line, or movement that makes a sharp turn (often two bends, like a zigzag) instead of going straight","zh":"（路线、线条或移动）突然急转弯的走法；常指像“之”字形那样拐来拐去，而不是直走"},"examples":[{"en":"Because of the construction, the sidewalk has a doglegging path around the building.","zh":"因为施工，人行道绕着大楼走成了一个急转弯的路线。"},{"en":"The trail’s doglegging kept us from seeing what was ahead.","zh":"小路拐来拐去，我们看不到前方情况。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making a sharp turn or changing direction suddenly while moving","zh":"（移动时）急转向、突然改变方向的动作"},"examples":[{"en":"The car avoided the pothole with a quick doglegging to the left.","zh":"车子为了避开坑洞，迅速向左急转了一下。"},{"en":"In the crowded station, his doglegging through people slowed everyone down.","zh":"在拥挤的车站里，他在人群中拐来拐去，反而拖慢了大家。"}]},{"partOfSpeech":"v.","definition":{"en":"to move or go in a path that turns sharply (often in a zigzag)","zh":"（道路/行进）急转弯；（常指）曲折前进、之字形前进"},"examples":[{"en":"The road doglegged around the hill.","zh":"道路在山坡旁急转弯。"},{"en":"We doglegged through side streets to avoid traffic.","zh":"我们走小路拐来拐去，以避开车流。"}]}],"synonyms":["zigzagging","turning","bending","doubling back","detouring"],"phonetic":"/ˈdɔɡˌlɛɡɪŋ/","extraExplanation":["“dogleg”原意是“狗的后腿弯曲处”，因此引申为“像狗腿一样弯折的拐角”。在高尔夫里，dogleg 常指球道在某处明显向左或向右转弯；在道路与步道设计中也很常见。","在一些专业语境里（如航空、军事或金融），dogleg/doglegging 也可指“改变航向/路线以满足限制或达成目标”的折线路径；日常英语中更常用来描述道路或行走路线的急转弯。"]}
{"word":"doglegs","summary":{"en":"Doglegs are sharp bends; in golf, a dogleg is a hole that turns left or right.","zh":"doglegs 指急转弯/折角；在高尔夫中指球洞路线向左或向右弯曲的“狗腿洞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sharp bend or angle in something long and straight (such as a road, path, hallway, pipe, or line)","zh":"（道路、路径、走廊、管道、线条等）突然的急转弯；折角"},"examples":[{"en":"There’s a dogleg in the road just past the bridge, so slow down.","zh":"过了桥路上有个急转弯，所以要减速。"},{"en":"Follow the trail until it makes a dogleg to the left.","zh":"沿着小路走，直到它向左急转。"}]},{"partOfSpeech":"n.","definition":{"en":"(in golf) a hole that bends left or right so the green is not straight ahead from the tee","zh":"（高尔夫）狗腿洞：球洞路线向左或向右弯曲，发球台无法直线看到果岭"},"examples":[{"en":"Hole 7 is a dogleg right, so many players aim toward the corner.","zh":"第7洞是右狗腿洞，所以很多球员会瞄准拐角位置。"},{"en":"A driver isn’t always best on a dogleg; a safer club can help.","zh":"在狗腿洞不一定要用一号木；用更稳的球杆可能更好。"}]},{"partOfSpeech":"v.","definition":{"en":"to turn or bend sharply; to follow a path with an abrupt angle","zh":"急转；呈折角前进"},"examples":[{"en":"The sidewalk doglegs around the building.","zh":"人行道绕着大楼急转。"},{"en":"The route doglegged east to avoid the construction zone.","zh":"路线向东急转以避开施工区域。"}]}],"synonyms":["bend","turn","sharp turn","kink","curve","angle"],"phonetic":"ˈdɔɡˌlɛɡ","extraExplanation":["“dogleg(s)”直译是“狗的后腿”，因为弯折的形状像狗腿的关节。英语里既可用于一般的“折角”，也常见于高尔夫球场术语。","在高尔夫语境中常说“a dogleg left/right”（左/右狗腿洞）。并不是“难洞”的同义词，而是描述球道走向的形状。"]}
{"word":"dogless","summary":{"en":"Dogless means “without a dog.”","zh":"dogless 的意思是“没有狗的（不养狗的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a dog; not having any dog(s).","zh":"没有狗的；不养狗的；无犬的。"},"examples":[{"en":"The park has a dogless area for people who don’t want dogs nearby.","zh":"这个公园有一块“无犬区”，供不想让狗在身边的人使用。"},{"en":"After moving to a small apartment, they became dogless for a few years.","zh":"搬到一间小公寓后，他们有几年没有养狗。"}]}],"synonyms":["without a dog","dog-free"],"phonetic":"/ˈdɔɡləs/","extraExplanation":["“dogless”= dog + 后缀 “-less”（表示“没有……的”）。类似构词：homeless（无家可归的）、jobless（失业的）、childless（无子女的）。","在现实用法中，“dogless”不算特别常见，但在规则说明、标识或写作里很清楚易懂（如 dogless zone/area＝无犬区）。日常口语也常说：don’t have a dog / without a dog。"]}
{"word":"doglike","summary":{"en":"Doglike means having qualities like a dog, especially loyalty or obedience.","zh":"doglike 指“像狗的”，常强调忠诚或顺从等特质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a dog in appearance, behavior, or qualities (often suggesting loyalty, obedience, or sometimes roughness).","zh":"像狗的；具有狗的外貌、行为或特质（常指忠诚、顺从，有时也暗含粗鲁）。"},"examples":[{"en":"He followed his coach with doglike loyalty.","zh":"他以狗一般的忠诚追随教练。"},{"en":"The puppy stared up with a doglike eagerness to please.","zh":"小狗抬头望着，带着一种狗似的讨好与渴望取悦的神情。"},{"en":"She disliked his doglike obedience to authority.","zh":"她不喜欢他对权威那种狗一般的顺从。"}]}],"synonyms":["canine","loyal","obedient"],"phonetic":"/ˈdɔɡlaɪk/","extraExplanation":["“doglike”是由“dog + -like”构成的形容词，表示“像……一样”。语气通常取决于上下文：可以是褒义（忠诚、热情），也可能是贬义（卑躬屈膝、盲从）。","近义表达常见有“dog-like”（也可加连字符）以及更具体的“loyal”“obedient”“canine”。其中“canine”更偏正式/书面，强调“犬科的”。"]}
{"word":"dogly","summary":{"en":"“Dogly” is an archaic word meaning “dog-like,” sometimes praising loyalty and sometimes criticizing rude or shameless behavior.","zh":"“dogly”是一个古语，意思是“像狗一样的”，可褒可贬：既可指忠诚，也可指粗鲁或无耻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Like a dog in behavior or qualities; dog-like (often suggesting loyalty, roughness, or shamelessness).","zh":"（古语）像狗一样的；狗一般的（常带有忠诚、粗野或无耻等含义，语气取决于上下文）。"},"examples":[{"en":"He showed a dogly loyalty to his master, never leaving his side.","zh":"他对主人表现出一种狗一般的忠诚，寸步不离。"},{"en":"The poem mocks his dogly manners at the banquet.","zh":"这首诗嘲讽他在宴席上的“狗一般的”粗鲁举止。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Very rare) In a dog-like way.","zh":"（极少用）以狗一般的方式。"},"examples":[{"en":"The hound followed dogly at his heels.","zh":"猎犬像狗一样紧跟在他脚边。"}]}],"synonyms":["doglike","doggish","canine (literary)"],"phonetic":"/ˈdɔɡli/","extraExplanation":["“dogly”在现代英语里非常少见，读到它时通常是在较早的文学作品、诗歌或仿古写作中。现代更常用的表达是“doglike”（更中性）或带贬义的“doggish / doggedly”（取决于想表达“卑鄙/粗鲁”还是“固执”）。","这个词的情感色彩很依语境而变：可以赞扬“忠诚”，也可以批评“粗鄙、无耻”。阅读时建议结合上下文判断作者态度。"]}
{"word":"dogma","summary":{"en":"Dogma is a belief (often religious or ideological) that people accept as unquestionably true.","zh":"Dogma 指人们不加质疑地当作真理接受的信念（常见于宗教或意识形态），带有“教条、僵化”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strongly held belief or set of beliefs that is accepted as true without questioning, especially in religion or ideology.","zh":"被当作真理而不容质疑的强烈信条或一套信念，尤指宗教或意识形态中的教条。"},"examples":[{"en":"Some people follow political dogma instead of looking at the facts.","zh":"有些人遵循政治教条，而不是看事实。"},{"en":"In the class, students were encouraged to question dogma and think critically.","zh":"在课堂上，老师鼓励学生质疑教条、进行批判性思考。"}]}],"synonyms":["doctrine","creed","orthodoxy","tenet"],"phonetic":"/ˈdɔɡmə/","extraExplanation":["“dogma”常带有负面语气，暗示“盲目接受、拒绝讨论或证据”。与之相对的表达包括“open-minded thinking（开放思考）”或“evidence-based reasoning（基于证据的推理）”。","词源来自希腊语，原意与“观点/决定”有关；在现代英语中多用于批评某种僵化的信念体系。","常见搭配：religious dogma（宗教教条）、political dogma（政治教条）、challenge/question dogma（挑战/质疑教条）、blind adherence to dogma（盲目遵从教条）。"]}
{"word":"dogma-bound","summary":{"en":"Dogma-bound describes someone or something restricted by fixed beliefs and unwilling to change.","zh":"dogma-bound 指被教条束缚、思想僵化、不愿改变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strongly limited by fixed beliefs or rules (dogma), and not open to new ideas or change.","zh":"被（宗教或意识形态的）教条束缚的；思想僵化、不愿接受新观点的。"},"examples":[{"en":"The committee’s dogma-bound thinking blocked any real reform.","zh":"委员会教条式的思维阻碍了任何真正的改革。"},{"en":"She left the dogma-bound group because she wanted to ask questions freely.","zh":"她离开了那个受教条束缚的团体，因为她想自由提问。"},{"en":"A dogma-bound approach can ignore evidence that doesn’t fit the theory.","zh":"教条束缚的做法可能会无视与理论不符的证据。"}]}],"synonyms":["doctrinaire","dogmatic","rigid","close-minded","hidebound"],"phonetic":"/ˈdɔɡmə baʊnd/","extraExplanation":["“dogma-bound”通常带有批评意味，强调一种“被既定信条捆住”的状态：不仅是有原则，更是把原则当成不可质疑的真理，因而缺乏弹性与开放性。","词源上，dogma 指“教条/定论”（常与宗教或意识形态相关），bound 在这里表示“被捆绑/受限制”。写作时常见近义表达有 rigid（僵硬的）, doctrinaire（教条主义的）, close-minded（思想狭隘的）。"]}
{"word":"dogman","summary":{"en":"Dogman usually means a dog handler/trainer, but in some workplaces (especially Australia/New Zealand/UK) it can mean a crane load-handler who slings and signals lifts.","zh":"Dogman 通常指训犬/带犬的人；但在部分国家的工程职场语境中（尤指澳新英），也可指负责绑扎并指挥起吊的吊装挂钩工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who handles, trains, or works closely with dogs (for example, in security, hunting, or dog care).","zh":"驯狗/训犬的人；与狗密切合作的人（如安保、狩猎或犬类照护领域）。"},"examples":[{"en":"The dogman trained the puppies to follow basic commands.","zh":"这位训犬员训练小狗学会基本口令。"},{"en":"A police dogman arrived with a K-9 to help search the area.","zh":"一名警犬训导员带着警犬赶来协助搜查。"}]},{"partOfSpeech":"n.","definition":{"en":"(Workplace English, especially Australia/New Zealand/UK) A worker who attaches, guides, and signals loads being lifted by a crane; a rigger/slinger.","zh":"（职场用语，尤见于澳大利亚/新西兰/英国）负责绑扎、引导并用信号指挥起重机吊运货物的工人；吊装指挥/挂钩工。"},"examples":[{"en":"The dogman checked the sling before the crane lifted the steel beam.","zh":"起吊钢梁前，挂钩工检查了吊带。"},{"en":"On this site, the crane operator waits for the dogman’s hand signals.","zh":"在这个工地上，起重机司机要等吊装指挥的手势信号。"}]}],"synonyms":["dog handler","trainer","K-9 handler","rigger","slinger"],"phonetic":"/ˈdɔɡmæn/","extraExplanation":["“dogman”在不同国家含义差异较大：在日常语境里更容易理解为“训犬/带犬的人”；但在澳新等工程行业里，它是一个正式工种名称，接近“slinger/rigger（挂钩/绑扎/吊装指挥）”。看到招聘或安全培训材料时要结合行业判断。","书名或角色名中也常出现“Dogman/狗人”这种写法，但那通常是专有名词（作品名/外号），不等同于上面两种职业含义。"]}
{"word":"dogmas","summary":{"en":"“Dogmas” means strict beliefs or rules accepted without question (plural of “dogma”).","zh":"“dogmas”指不容质疑的严格信条或规则（dogma的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dogmas: strongly held beliefs or rules that a person, group, religion, or organization says must be accepted as true, often without allowing questions or debate.","zh":"教条；教义：某个人、群体、宗教或组织要求必须接受的强硬信条或规则，常常不鼓励质疑或讨论。"},"examples":[{"en":"The school encourages students to think critically instead of simply accepting dogmas.","zh":"这所学校鼓励学生批判性思考，而不是照单全收各种教条。"},{"en":"Political dogmas can make it hard to compromise.","zh":"政治教条会让妥协变得很困难。"},{"en":"Some traditions are helpful, but dogmas can limit new ideas.","zh":"有些传统很有帮助，但教条可能会限制新想法。"}]}],"synonyms":["doctrines","creeds","tenets","orthodoxy"],"phonetic":"/ˈdɔɡmə/","extraExplanation":["“dogmas”是“dogma”的复数形式；单数dogma常指宗教教义（religious dogma），也可指任何领域里不容挑战的“定论”。","语气上，“dogma(s)”通常带一点批评意味，暗示“过于僵化、缺乏证据或不允许讨论”。如果想中性表达“核心原则/信念”，可以用“principles”或“beliefs”。"]}
{"word":"dogmata","summary":{"en":"“Dogmata” is the (often academic) plural of “dogma,” meaning fixed beliefs accepted as unquestionably true.","zh":"“dogmata”是“dogma”的（较偏学术的）复数形式，指被视为不容置疑的教条/教义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “dogma”) fixed beliefs or principles, especially in religion, politics, or philosophy, that people accept as unquestionably true.","zh":"（dogma 的复数）教条；教义；被认为不容置疑的信条或原则（常见于宗教、政治或哲学语境）。"},"examples":[{"en":"The reformers challenged the old dogmata and encouraged open debate.","zh":"改革者挑战旧有教条，并鼓励公开讨论。"},{"en":"In science, claims should be tested, not treated as dogmata.","zh":"在科学中，观点应当被检验，而不应被当作教条。"}]},{"partOfSpeech":"n.","definition":{"en":"In academic writing, the plural “dogmata” can refer to the official teachings of a church or school of thought.","zh":"在学术写作中，复数 dogmata 可指某个教会或思想流派的“正式教义/教条体系”。"},"examples":[{"en":"The paper compares the central dogmata of early Christian communities.","zh":"这篇论文比较了早期基督教社群的核心教义。"},{"en":"Students studied the dogmata of Stoicism alongside its ethics.","zh":"学生在学习斯多葛伦理学的同时，也研究其教义体系。"}]}],"synonyms":["dogmas","doctrines","tenets","articles of faith"],"phonetic":"/dɔɡˈmɑtə/","extraExplanation":["“dogmata”来自希腊语“dogma”的复数形式。在日常英语里，人们更常用规则复数“dogmas”。“dogmata”更偏正式/学术风格，读起来也更“古典”。","用法提示：有时你会看到作者把“dogmata”当作一个整体（接近“教条体系”）来谈；但语法上它仍是复数，常搭配复数动词（dogmata are…）。"]}
{"word":"dogmatic","summary":{"en":"Dogmatic = too certain your views are right; unwilling to question or accept other ideas.","zh":"Dogmatic 表示“过于确信自己正确、拒绝质疑或接受不同意见”的“教条/武断”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strongly believing that your opinions are definitely true, and not willing to change them or listen to other ideas.","zh":"教条的；武断的：非常坚定地认为自己的观点绝对正确，不愿改变或倾听其他意见。"},"examples":[{"en":"He’s dogmatic about politics and refuses to consider other views.","zh":"他在政治问题上很教条，拒绝考虑其他观点。"},{"en":"A dogmatic teaching style can discourage students from asking questions.","zh":"教条式的教学方式会让学生不敢提问。"},{"en":"Try not to sound dogmatic when you give advice—leave room for discussion.","zh":"给建议时尽量别显得武断——留出讨论空间。"}]}],"synonyms":["opinionated","rigid","inflexible","authoritarian","doctrinaire"],"phonetic":"/dɔɡˈmætɪk/","extraExplanation":["“dogmatic”常带负面语气，强调“过度确定、缺乏开放性”。更中性或更积极的表达可用：“confident（自信的）”“firm（坚定的）”“principled（有原则的）”。","词源与“dogma（教义/教条）”有关，历史上常用于宗教或哲学领域，指把某些观点当作不可质疑的真理；现代英语里也常用于政治、职场、教育等语境。","常见搭配：dogmatic attitude（教条态度）、dogmatic belief（教条信念）、sound dogmatic（听起来很武断）。与之相对的词有 open-minded（开放的）、flexible（灵活的）。"]}
{"word":"dogmatic-historical","summary":{"en":"Dogmatic-historical describes an approach (often in theology) that explains doctrines together with their historical development.","zh":"dogmatic-historical 常用于神学等语境，指把“教义内容”与“历史发展过程”结合起来进行阐释的方法或风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a way of teaching or writing that combines (1) fixed religious doctrines (“dogma”) with (2) an account of how those doctrines developed through history.","zh":"指一种教学或写作方式：把（1）固定的宗教教义（教条、信理）与（2）这些教义在历史中的形成与发展结合起来讲述。"},"examples":[{"en":"The professor used a dogmatic-historical approach to explain how early Christian teachings became formal doctrines.","zh":"教授用“教义—历史”相结合的方法，讲解早期基督教教导如何逐渐成为正式教义。"},{"en":"This chapter offers a dogmatic-historical summary of the doctrine of the Trinity.","zh":"这一章对“三位一体”教义做了“教义—历史”式的概述。"}]},{"partOfSpeech":"adj.","definition":{"en":"More broadly (and less commonly), describing something that is both strongly doctrine-based and focused on historical development.","zh":"更广义且较少见：指某事既强调教条/原则立场，又强调其历史演变。"},"examples":[{"en":"The article is dogmatic-historical in style, moving from core principles to their historical changes.","zh":"这篇文章的风格偏“教条—历史”，先讲核心原则，再谈其历史变化。"}]}],"synonyms":["doctrinal-historical","theological-historical","doctrinal and historical"],"phonetic":"/dɔɡˈmætɪk hɪˈstɔrɪkəl/","extraExplanation":["这个词多见于神学、宗教研究或教义学（dogmatics）语境，常用来形容“dogmatic-historical method/approach”（教义—历史方法/路径）。","连字符（dogmatic-historical）通常表示两个形容词共同修饰同一个名词；在学术写作中也可能写成不带连字符的 dogmatic historical（较少见，且容易被误读为“教条的、历史的”两项并列）。","注意 dogmatic 在日常英语里常带贬义（“武断的、教条式的”），但在神学语境中更中性，常指“与教义/教理相关”。"]}
{"word":"dogmatical","summary":{"en":"Dogmatical means being overly certain and unwilling to consider other views; it can also mean relating to rigid beliefs or doctrine.","zh":"dogmatical 指“武断/教条”，常形容过分确信、不愿听取不同意见；也可指与僵化的信条或教义相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Stating opinions as if they are certainly true, and not being willing to listen to other ideas; often negative in tone.","zh":"武断的；教条的：把自己的观点说得像绝对正确一样，并且不愿意听取他人意见（常带贬义）。"},"examples":[{"en":"He sounded dogmatical in the meeting, so people stopped sharing their ideas.","zh":"他在会议上说话很武断，所以大家都不太愿意继续分享想法。"},{"en":"Try not to be dogmatical—ask questions and listen before you judge.","zh":"尽量别那么教条；先提问、先倾听，再下结论。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a formal set of beliefs (dogma), especially in religion; strict about accepted rules or teachings.","zh":"与教义/信条有关的；（尤指宗教中）强调既定教导、较为僵化的。"},"examples":[{"en":"The debate became dogmatical, focusing on accepted teachings rather than real-life needs.","zh":"讨论变得偏向教义式，更多围绕既定教导，而不是现实需求。"},{"en":"Some critics say the film challenges dogmatical traditions.","zh":"一些评论者认为这部电影在挑战教条式的传统。"}]}],"synonyms":["dogmatic","opinionated","doctrinaire","authoritarian","rigid"],"phonetic":"/dɔɡˈmætɪkəl/","extraExplanation":["“dogmatical”与“dogmatic”意思非常接近；现代英语里更常用“dogmatic”，“dogmatical”显得更书面或较少见。","词根来自“dogma”（信条、教义）。日常表达中，“dogmatic/dogmatical”多用于批评某人说话太绝对、不给讨论空间。更中性的替代说法可以用“confident”（自信的）或“firm”（坚定的），避免带贬义。"]}
{"word":"dogmatically","summary":{"en":"“Dogmatically” means speaking or acting in a rigid, certain way that rejects debate or doubt.","zh":"“dogmatically”表示说话或做事很教条、很武断，自认绝对正确而不接受质疑或讨论。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that expresses your opinions as certainly true, and does not allow discussion or doubt.","zh":"教条地；武断地（把自己的观点当作绝对真理，不容讨论或怀疑）。"},"examples":[{"en":"He spoke dogmatically about politics, so the conversation quickly shut down.","zh":"他谈政治时很武断，所以对话很快就进行不下去了。"},{"en":"The rules were applied dogmatically, without considering individual situations.","zh":"规则被教条地执行，没有考虑个人情况。"}]}],"synonyms":["rigidly","authoritatively","assertively","categorically"],"phonetic":"/dɔɡˈmætɪkli/","extraExplanation":["“dogmatically”来自“dogma”（宗教或思想体系中的“教义/信条”）。它常带有负面语气：强调说话或做事过于“认死理”，缺少开放性。","常见搭配：speak/argue dogmatically（武断地说/争辩），apply/enforce dogmatically（教条地执行）。","与“confidently”（自信地）不同：dogmatically 暗示不愿接受证据或不同意见。"]}
{"word":"dogmaticalness","summary":{"en":"“Dogmaticalness” means a dogmatic, overly certain attitude that isn’t open to other opinions.","zh":"“dogmaticalness”指教条/武断的态度：过分确信自己正确，不太愿意接受不同意见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too certain that your opinions are correct, and expressing them in a forceful way without being open to other views; dogmatism","zh":"教条（武断）性；指过分确信自己的观点正确，并以强硬方式表达、缺乏开放性或愿意听取不同意见的态度"},"examples":[{"en":"His dogmaticalness made group discussions difficult, because he dismissed any opposing ideas.","zh":"他的教条性让小组讨论很困难，因为他会否定任何相反的观点。"},{"en":"The review criticized the author’s dogmaticalness and urged a more balanced tone.","zh":"这篇评论批评了作者的武断口吻，并建议采用更平衡的语气。"}]}],"synonyms":["dogmatism","rigidity","closed-mindedness","authoritarianism"],"phonetic":"/ˌdɔɡˈmætɪkəlnəs/","extraExplanation":["“dogmaticalness”是由形容词 dogmatical（= dogmatic，意为“教条的/武断的”）加名词后缀 -ness 构成的抽象名词，但在现代英语里相对少见。更常用、更自然的表达通常是 **dogmatism**（教条主义/武断）或 **a dogmatic attitude/tone**（武断的态度/语气）。","语气上它多带负面评价，常出现在批评写作风格、课堂讨论、宗教/政治观点表达等语境中。"]}
{"word":"dogmatician","summary":{"en":"A dogmatician is a person who is rigidly confident that their beliefs are correct; less commonly, a theologian concerned with formal religious doctrine.","zh":"dogmatician 指教条主义者、说话武断且坚称自己绝对正确的人；较少见时也可指研究或阐述宗教教义的学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who strongly insists that their beliefs are unquestionably true, often speaking in a rigid, authoritative way.","zh":"教条主义者；坚持自己的观点绝对正确、说话态度强硬且不容置疑的人。"},"examples":[{"en":"He sounds like a dogmatician who refuses to consider new evidence.","zh":"他听起来像个教条主义者，拒绝考虑新的证据。"},{"en":"In debates, a dogmatician often treats opinions as facts.","zh":"在辩论中，教条主义者常常把观点当作事实。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A theologian or writer who focuses on dogma (official religious doctrine), especially in a formal or systematic way.","zh":"（较少见）教义学者；专门研究或阐述宗教教义（官方教义）的人。"},"examples":[{"en":"Some early dogmaticians tried to organize complex doctrines into clear systems.","zh":"一些早期的教义学者试图把复杂的教义整理成清晰的体系。"}]}],"synonyms":["dogmatist","doctrinaire","ideologue","pedant"],"phonetic":"/ˌdɔɡməˈtɪʃən/","extraExplanation":["“dogmatician”由“dogma（教义/教条）”加后缀“-tician/-ician（从事某种学术/职业的人）构成。现代英语里更常见的是“dogmatist”（教条主义者）或形容词“dogmatic（武断的）”。","语气与使用场景：在日常语境中称某人为“dogmatician”通常带批评色彩，暗示对方缺乏开放性、把复杂问题简单化。学术/宗教语境下则可能更中性，指研究或阐述教义的人。"]}
{"word":"dogmatics","summary":{"en":"Dogmatics means the systematic study of religious doctrine, or more broadly rigid, unquestioned beliefs.","zh":"Dogmatics 指对宗教教义的系统研究（教义学），也可泛指僵化、不容质疑的信念（教条主义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often academic) the study or system of fixed religious doctrines (dogma), especially in Christian theology.","zh":"（常用于学术语境）教义学；对固定宗教教义（dogma）的系统研究，尤指基督教神学中的教义体系。"},"examples":[{"en":"She took a course in dogmatics to understand how Christian doctrines were formed and defended.","zh":"她选修了教义学课程，以了解基督教教义是如何形成并被辩护的。"},{"en":"The seminary’s curriculum includes biblical studies, ethics, and dogmatics.","zh":"这所神学院的课程包括圣经研究、伦理学和教义学。"}]},{"partOfSpeech":"n.","definition":{"en":"Rigid, unquestioned opinions or principles treated as unquestionable truths; dogmatic thinking.","zh":"教条主义；把观点或原则当作不容质疑的“真理”的僵硬思维方式。"},"examples":[{"en":"The debate stalled because of political dogmatics on both sides.","zh":"由于双方都陷入政治教条主义，辩论陷入僵局。"},{"en":"Good science avoids dogmatics and stays open to new evidence.","zh":"好的科学会避免教条主义，并对新证据保持开放。"}]}],"synonyms":["doctrine","theology","systematic theology","orthodoxy","dogmatism"],"phonetic":"/dɔɡˈmætɪks/","extraExplanation":["“dogmatics”来自“dogma（教义/信条）”。在神学里它通常是中性、学术性的词，指对教义的系统整理与阐释；但在一般讨论（政治、文化、科学）中，它也可能带批评意味，接近“教条主义/僵化的定见”。","易混词：dogmatic（adj.）=“武断的/教条的”；dogma（n.）=“教条/信条”；dogmatics（n.）更常指“学科/体系”或“教条式思维”。"]}
{"word":"dogmatisation","summary":{"en":"Dogmatisation means making ideas rigid and unquestionable, like a doctrine.","zh":"dogmatisation 指把观点变得僵化、当作不可质疑的教条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of turning ideas into fixed doctrines, or presenting opinions as if they are unquestionably true","zh":"将观点变成僵化教条的行为或过程；把意见当作不容置疑的真理来宣讲"},"examples":[{"en":"The professor warned against the dogmatisation of scientific theories.","zh":"教授警告不要把科学理论教条化。"},{"en":"In politics, dogmatisation can shut down honest debate.","zh":"在政治中，教条化会扼杀坦诚的讨论。"},{"en":"The book criticizes the dogmatisation of tradition in modern education.","zh":"这本书批评现代教育中对传统的教条化。"}]}],"synonyms":["dogmatization","dogmatism","indoctrination","doctrinalization","rigidification"],"phonetic":"ˌdɔɡmətaɪˈzeɪʃən","extraExplanation":["“dogmatisation”（英式拼写；美式常写作“dogmatization”）通常带有批评意味，暗示说话者认为某种观点被当成“绝对正确、不可讨论”的东西。","词根来自“dogma”（教条、教义）。“-isation/-ization”表示“使……化、……化的过程”，所以整体意思就是“使之成为教条/教条化”。","常见于学术写作、评论文章、社会与政治讨论中，用来指出开放探究被“定论化”的倾向。"]}
{"word":"dogmatise","summary":{"en":"To assert opinions as unquestionable facts; to speak in a rigid, dogmatic way.","zh":"把个人观点当作不容置疑的事实来宣称；以教条、武断的方式说话。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to state opinions as if they are certainly true, often in a way that allows little discussion or disagreement","zh":"把观点当作绝对真理来断言（常带有不容讨论或反驳的语气）"},"examples":[{"en":"He tends to dogmatise about politics, so conversations with him can feel one-sided.","zh":"他谈政治时常常武断地下结论，所以和他聊天会让人觉得只有他在说。"},{"en":"Teachers should explain ideas clearly, but not dogmatise in a way that shuts down questions.","zh":"老师应当把观点讲清楚，但不应以武断的方式压制提问。"}]}],"synonyms":["dogmatize","pontificate","assert","preach","lay down the law"],"phonetic":"/ˈdɔɡməˌtaɪz/","extraExplanation":["“dogmatise”是英式拼写；美式更常写作“dogmatize”。两者含义相同。","词源与“dogma（教条、信条）”有关，因此这个动词常带有负面含义：强调说话者太“教条/武断”，不够开放。"]}
{"word":"dogmatised","summary":{"en":"“Dogmatised” means having become dogmatic, or having made ideas sound like unquestionable truths (British spelling).","zh":"“dogmatised”指变得武断/教条，或把观点说成不可质疑的真理（英式拼写）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle) became dogmatic, or expressed opinions as if they were certainly true and should not be questioned.","zh":"（过去式/过去分词）变得教条、武断；或以“绝对正确、不可质疑”的口吻表达观点。"},"examples":[{"en":"As the debate went on, he grew more dogmatised and stopped listening to other views.","zh":"随着辩论继续，他变得更武断，开始不再倾听其他观点。"},{"en":"The report was criticized for its dogmatised tone, as if the conclusions were beyond doubt.","zh":"这份报告因语气过于武断而受到批评，仿佛结论不容置疑。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle) made something dogmatic; presented ideas as fixed rules or unquestionable truths.","zh":"（过去式/过去分词）使……教条化；把观点包装成固定规则或不可置疑的真理来呈现。"},"examples":[{"en":"Over time, a flexible guideline was dogmatised into a strict rule.","zh":"随着时间推移，一条原本灵活的指导原则被教条化成了严格规则。"},{"en":"The teacher warned students not to dogmatise science into a set of slogans.","zh":"老师提醒学生不要把科学教条化成一套口号。"}]}],"synonyms":["dogmatized","became dogmatic","turned rigid","preached","pontificated"],"phonetic":"/ˈdɑːɡməˌtaɪzd/","extraExplanation":["“dogmatised”是英式拼写；美式更常写作“dogmatized”。两者意思相同，只是拼写习惯不同。","词根来自“dogma（教义/信条）”。在学习或写作中，这个词常带批评意味：强调“自以为真、拒绝讨论”的态度。"]}
{"word":"dogmatiser","summary":{"en":"Dogmatiser means a person who speaks in a rigid, overly certain way, treating opinions as unquestionable facts.","zh":"dogmatiser指说话武断、僵化，把个人观点当成不容置疑事实的人（多含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who expresses opinions as if they are unquestionably true, often in a rigid or stubborn way","zh":"教条主义者；武断的人（把自己的观点当作不容置疑的真理来表达，常带有僵化或固执的语气）"},"examples":[{"en":"He came across as a dogmatiser, dismissing anyone who disagreed.","zh":"他给人的感觉很武断，凡是不同意他的人都被他否定。"},{"en":"A good discussion needs curiosity, not a dogmatiser who lectures everyone.","zh":"一场好的讨论需要好奇心，而不是那种对所有人说教的教条主义者。"}]}],"synonyms":["dogmatist","doctrinaire","rigid thinker","opinionated person"],"phonetic":"/ˈdɔɡməˌtaɪzər/","extraExplanation":["“dogmatiser”是英式拼写，更常见的美式拼写是“dogmatizer”。两者意思相同。","词根来自“dogma”（教条、信条）。在日常语境中，这个词多带贬义，暗示说话方式不开放、不给讨论空间。"]}
{"word":"dogmatising","summary":{"en":"Dogmatising means speaking or teaching in a dogmatic, overly certain way, as if your views cannot be questioned.","zh":"dogmatising 指以教条、武断的方式说话或教学，把自己的观点说得像不可质疑一样。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"stating opinions or beliefs in a very certain way, as if they are unquestionably true (often in an annoying or unfair way)","zh":"以非常武断的方式陈述观点或信念，仿佛无可质疑（常带有令人反感或不公平的意味）"},"examples":[{"en":"He kept dogmatising about politics and wouldn’t listen to other views.","zh":"他一直在政治问题上武断地下结论，根本不听别人的观点。"},{"en":"Instead of dogmatising, try asking questions and inviting discussion.","zh":"与其武断地下结论，不如试着提问并邀请大家讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of teaching or arguing in a rigid, authoritative way, as if only one answer is possible","zh":"以僵化、权威式的方式教学或争辩，仿佛只有一个答案的做法"},"examples":[{"en":"The article criticizes the professor for dogmatising in the classroom.","zh":"这篇文章批评那位教授在课堂上教学方式过于僵化和武断。"},{"en":"Dogmatising can shut down curiosity and slow learning.","zh":"武断式的说教会压制好奇心，减慢学习进度。"}]}],"synonyms":["preaching","pontificating","asserting","laying down the law","being dogmatic"],"phonetic":"/ˈdɔɡməˌtaɪzɪŋ/","extraExplanation":["“dogmatising”多见于英式拼写，对应美式常写作“dogmatizing”。两者意思相同。","词根来自“dogma”（教条、教义）。因此它通常带负面语气，暗示说话者不愿接受不同意见。"]}
{"word":"dogmatism","summary":{"en":"Dogmatism is the attitude of insisting you are right and refusing to question or consider other views; it can also mean strict acceptance of doctrines.","zh":"Dogmatism 指坚持自己绝对正确、拒绝质疑或听取他人观点的态度；也可指对既定教义的严格接受。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A way of thinking in which someone believes their opinions are absolutely true and refuses to consider other ideas or evidence.","zh":"教条主义；一种思维方式：认为自己的观点绝对正确，并拒绝考虑其他想法或证据。"},"examples":[{"en":"The discussion failed because of his dogmatism—he wouldn’t listen to anyone else.","zh":"讨论失败了，因为他太教条——他不愿听任何人的意见。"},{"en":"Good science fights dogmatism by testing ideas with evidence.","zh":"好的科学通过用证据检验观点来对抗教条主义。"}]},{"partOfSpeech":"n.","definition":{"en":"In religion or philosophy, the strict acceptance of established doctrines (official beliefs), often without questioning.","zh":"（宗教/哲学中）对既定教义的严格接受，往往不加质疑。"},"examples":[{"en":"Some students felt the class favored dogmatism over open inquiry.","zh":"一些学生觉得这门课更偏向教条，而不是开放探究。"},{"en":"The reform movement challenged religious dogmatism.","zh":"这场改革运动挑战了宗教教条主义。"}]}],"synonyms":["rigidity","closed-mindedness","inflexibility","doctrinairism"],"phonetic":"/ˈdɔɡməˌtɪzəm/","extraExplanation":["词源提示：dogmatism 来自希腊语 dogma（“教义、信条、主张”）。在日常英语里它多带贬义，强调“固执地认定自己对”；而 dogma 更常指“某一套具体的教条/信条”。","学习对比：dogmatic（adj. 教条的、武断的）常用来形容人或语气；dogmatism（n. 教条主义/武断）是这种态度或倾向。相近但更口语的词有 stubbornness（固执）或 closed-mindedness（思想封闭）。"]}
{"word":"dogmatisms","summary":{"en":"Dogmatisms are rigid, unquestioning beliefs or attitudes (plural of dogmatism).","zh":"dogmatisms 指“教条主义”（dogmatism 的复数）：僵化、武断、缺乏质疑与开放性的观点或态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Strong, often rigid beliefs or opinions that are treated as unquestionably true, sometimes without enough evidence or openness to other views; plural of “dogmatism.”","zh":"教条主义（复数）：把某些观点当作绝对真理、态度僵硬且不愿接受不同意见的做法或倾向。"},"examples":[{"en":"The debate stalled because both sides fell into dogmatisms instead of listening.","zh":"辩论陷入僵局，因为双方都陷入教条主义，而不是愿意倾听。"},{"en":"In science, dogmatisms can slow progress when people refuse to question old ideas.","zh":"在科学中，当人们拒绝质疑旧观念时，教条主义会减慢进步。"}]}],"synonyms":["rigidity","doctrinairism","closed-mindedness","inflexibility","orthodoxy (sometimes)"],"phonetic":"/ˈdɔɡ.məˌtɪ.zəm/","extraExplanation":["“dogmatism”来自“dogma”（教义/教条）+ “-ism”（某种思想、主义或倾向）。在日常英语里，dogmatism/dogmatisms 通常带贬义，强调“过于武断、僵化”，并不等同于“有坚定信念”（strong convictions）。"]}
{"word":"dogmatist","summary":{"en":"A dogmatist is someone who is rigidly sure they’re right and won’t seriously consider other views.","zh":"dogmatist 指“教条主义者/武断的人”：自认绝对正确，不愿认真考虑不同观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who strongly believes certain ideas are absolutely true and refuses to consider other opinions or evidence.","zh":"教条主义者：坚信某些观点绝对正确，并拒绝考虑其他意见或证据的人。"},"examples":[{"en":"He’s a dogmatist who won’t listen to any criticism of his theory.","zh":"他是个教条主义者，完全听不进对他理论的任何批评。"},{"en":"In a diverse workplace, a dogmatist can make teamwork difficult.","zh":"在多元化的职场里，教条主义者会让团队合作变得困难。"},{"en":"She stopped arguing because the dogmatist had already made up his mind.","zh":"她不再争论了，因为那个教条主义者早就下定论了。"}]}],"synonyms":["doctrinaire","rigid thinker","ideologue","hardliner"],"phonetic":"/ˈdɔɡməˌtɪst/","extraExplanation":["dogmatist 来自 dogma（“教义/教条”）。它通常带有负面含义，强调“固执、武断、不开放”。在日常表达中，和 open-minded（思想开放的）、flexible（灵活的）形成对比。","常见搭配：a dogmatist attitude（教条的态度）、political/religious dogmatist（政治/宗教上的教条主义者）。近义但语气不同：stubborn（固执，较中性/口语）、rigid（死板）、opinionated（好发表强烈意见，不一定拒绝证据）。"]}
{"word":"dogmatists","summary":{"en":"“Dogmatists” are people who speak in a very certain, rigid way and resist other viewpoints.","zh":"“dogmatists”指说话十分肯定、立场僵硬、抗拒不同观点的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who express their opinions as if they are certainly true, and who are often unwilling to listen to other ideas.","zh":"教条主义者；武断的人（把自己的观点当作绝对真理，且常不愿倾听其他看法）。"},"examples":[{"en":"Some dogmatists refuse to consider new evidence, even when the facts change.","zh":"有些教条主义者即使事实改变，也拒绝考虑新证据。"},{"en":"In class discussions, try not to sound like a dogmatist—ask questions and stay open-minded.","zh":"在课堂讨论中，尽量不要显得很武断——多提问，保持开放的心态。"},{"en":"The article criticizes political dogmatists on both sides for blocking compromise.","zh":"这篇文章批评了双方的政治教条主义者，认为他们阻碍了妥协。"}]}],"synonyms":["rigid thinkers","doctrinaire people","opinionated people","authoritarians"],"phonetic":"/ˈdɔɡmətɪsts/","extraExplanation":["“dogmatists”是“dogmatist”的复数。词根来自“dogma”（教义/教条），在日常英语里常带贬义，强调“态度僵硬、爱下结论”，不一定与宗教有关。","常见搭配：dogmatist attitude（武断的态度）、religious/political dogmatists（宗教/政治上的教条主义者）。"]}
{"word":"dogmatization","summary":{"en":"Dogmatization means making an idea into an unquestioned, rigid doctrine.","zh":"dogmatization 指把观点变成不可质疑的僵化教条（教条化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of turning an idea, belief, or policy into a rigid set of rules (a “dogma”), especially when people stop questioning or discussing it.","zh":"把某个观点、信念或政策变成僵化教条（dogma）的行为或过程，尤指人们不再质疑或讨论时。"},"examples":[{"en":"Dogmatization can stop a team from trying new solutions.","zh":"教条化会让团队停止尝试新的解决方案。"},{"en":"When a method becomes dogmatized, people follow it even when it no longer works.","zh":"当一种方法被教条化后，人们即使知道它不再有效也会照做。"},{"en":"The professor warned against the dogmatization of science into fixed beliefs.","zh":"教授警告说，不要把科学教条化成固定不变的信条。"}]}],"synonyms":["dogmatism","rigidification","hardening (of views)","indoctrination"],"phonetic":"/ˌdɔɡmətaɪˈzeɪʃən/","extraExplanation":["“dogmatization”常带批评意味，强调“把本来可以讨论、修正的东西变得绝对化、不可质疑”。在学术写作、社会评论里更常见。","词根来自“dogma（教条）”，后缀“-ization”表示“使成为……/……化”的过程，因此可理解为“教条化”。日常口语里更常用“dogmatism（教条主义）”或“become dogmatic（变得武断）”。"]}
{"word":"dogmatize","summary":{"en":"“Dogmatize” means to state opinions as unquestionable truths, often in a rigid, preachy way.","zh":"“dogmatize”指把观点当作不容置疑的真理来宣讲，常带武断、说教的负面含义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to express opinions as if they are certainly true, especially in a way that ignores other viewpoints","zh":"把个人观点当作绝对真理来宣讲（常指武断、无视他人观点）"},"examples":[{"en":"He tends to dogmatize about politics, so discussions with him can be difficult.","zh":"他谈政治时很爱武断地下结论，所以和他讨论会比较困难。"},{"en":"Instead of dogmatizing, try asking questions and listening to other perspectives.","zh":"与其武断说教，不如试着提问并倾听别人的观点。"}]}],"synonyms":["pontificate","preach","be dogmatic","assert","expound"],"phonetic":"/ˈdɔɡməˌtaɪz/","extraExplanation":["“dogmatize”通常带负面语气，常用于批评某人“说教式”“不容置疑”地表达观点。","词根与“dogma（教条、信条）”相关；在宗教或意识形态话题中更常见，但也可用于日常话题（如教育、健康、政治）。","近义表达可用：“preach”（说教）、“be dogmatic”（武断）、“pontificate”（自以为是地高谈阔论，语气更强）。想表达中性“坚信并陈述观点”，可用“state firmly / argue strongly”。"]}
{"word":"dogmatized","summary":{"en":"Dogmatized means “spoke or argued in a rigid, overly certain way,” or “made something into a fixed doctrine.”","zh":"dogmatized 表示“以武断、过度肯定的方式讲话/争论”，也可指“把某事教条化成固定教义或规则”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of dogmatize) To state opinions as if they were certain facts, often in a forceful or arrogant way.","zh":"（dogmatize 的过去式/过去分词）把观点当作绝对真理来宣称，常带强硬或自以为是的语气。"},"examples":[{"en":"In the meeting, he dogmatized about what “must” be done, and people stopped sharing ideas.","zh":"在会议上，他用不容置疑的口吻断言“必须”怎么做，大家就不太愿意分享想法了。"},{"en":"The article dogmatized on education policy without offering evidence.","zh":"那篇文章对教育政策下了武断结论，却没有提供证据。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) To turn an idea into a fixed doctrine (a dogma), treating it as the official or unquestionable rule.","zh":"（较少见）把某种想法“教条化”，当作固定的教义/准则，视为不容质疑的规则。"},"examples":[{"en":"Over time, a flexible guideline was dogmatized into a rigid rule.","zh":"随着时间推移，一条本来灵活的指导原则被教条化成了僵硬的规定。"},{"en":"When traditions are dogmatized, it can become hard to adapt to new situations.","zh":"当传统被教条化时，就会很难适应新情况。"}]}],"synonyms":["asserted","pontificated","preached","declared","indoctrinated"],"phonetic":"/ˈdɔɡməˌtaɪzd/","extraExplanation":["“dogmatized”在语气上通常偏负面，常用于批评某人说话武断、爱说教、不给讨论空间。","常见搭配：dogmatize about/on sth（就某事武断地发表意见）。也可用被动：be dogmatized into…（被教条化成……）。","相关词：dogma（教条/教义，名词）、dogmatic（教条的/武断的，形容词）。"]}
{"word":"dogmatizer","summary":{"en":"A dogmatizer is someone who speaks in a rigid, overly certain way, as if their opinions are unquestionable facts.","zh":"dogmatizer 指说话武断、把个人观点当成不可质疑事实的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who states opinions as if they are certain facts, often in a forceful way and without listening to other views","zh":"武断的人；教条主义者（把个人观点当作确定事实来强硬宣称、常不愿倾听不同意见的人）"},"examples":[{"en":"He’s not a good moderator—he becomes a dogmatizer whenever politics comes up.","zh":"他不适合当主持人——一谈到政治他就变得很武断。"},{"en":"The discussion stopped being productive because one dogmatizer kept shutting down questions.","zh":"讨论变得没有成效，因为有个教条主义者一直压制提问。"}]}],"synonyms":["dogmatist","know-it-all","doctrinaire","pedant"],"phonetic":"/ˈdɑɡməˌtaɪzər/","extraExplanation":["“dogmatizer”比较少见，更常用的表达是“dogmatist（教条主义者）”或形容词“dogmatic（武断的/教条的）”。“dogmatize”是动词，表示“武断地下结论、把观点当真理宣讲”。","语气通常带批评：强调说话者缺乏开放性、把复杂问题说得过于确定。在学术讨论或职场沟通中，常与“open-minded（开放的）”“nuanced（细致入微的）”形成对比。"]}
{"word":"dogmatizing","summary":{"en":"Dogmatizing means speaking (or presenting ideas) in a rigid, overly certain way, as if they can’t be questioned.","zh":"Dogmatizing 指以僵化、过度确定的方式表达观点，好像不容质疑。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"speaking in a very certain, opinionated way, as if your views are unquestionably true (often seen as negative)","zh":"以教条式、武断的口吻讲话，仿佛自己的观点绝对正确（常带贬义）"},"examples":[{"en":"He kept dogmatizing about politics, so the conversation quickly became tense.","zh":"他一直在政治话题上武断说教，谈话很快就变得紧张。"},{"en":"Instead of dogmatizing, try asking questions and listening.","zh":"与其武断说教，不如试着提问并倾听。"}]},{"partOfSpeech":"vt.","definition":{"en":"presenting an idea as a fixed rule or unquestionable doctrine; trying to make others accept it as “the truth”","zh":"把某个观点当作不可质疑的信条来宣讲；试图让别人把它当作“真理”接受"},"examples":[{"en":"The coach was dogmatizing his training method as the only right way.","zh":"教练把他的训练方法说成唯一正确的方式。"},{"en":"The article criticizes leaders for dogmatizing their beliefs instead of explaining them.","zh":"这篇文章批评一些领导人把信念当作教条灌输，而不是去解释和论证。"}]}],"synonyms":["preaching","pontificating","lecturing","asserting","being dogmatic"],"phonetic":"/ˈdɔɡməˌtaɪzɪŋ/","extraExplanation":["“dogmatizing”来自动词 dogmatize，和 dogma（教条/教义）同源。它常用来批评一个人说话太绝对、不给讨论空间。","语气上通常不如 simply “stating an opinion” 中性；更接近 “preaching/lecturing” 的感觉，但强调“自以为绝对正确”。"]}
{"word":"dogmeat","summary":{"en":"Dogmeat means meat from a dog; informally it can also mean very low-quality food or, in slang, someone treated as expendable.","zh":"dogmeat 指“狗肉”；在非正式用法中也可指“劣质食物/劣质东西”，或俚语里指被当作可牺牲的“炮灰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Meat from a dog, eaten as food (in some cultures and historical contexts).","zh":"狗肉；指作为食物食用的狗的肉（在某些文化与历史背景中存在）。"},"examples":[{"en":"In some regions, dogmeat has been part of traditional cuisine, though it is controversial today.","zh":"在一些地区，狗肉曾是传统饮食的一部分，但在今天引发争议。"},{"en":"The documentary discusses how attitudes toward dogmeat differ across cultures.","zh":"这部纪录片讨论了不同文化对狗肉的态度差异。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often derogatory) Something considered very poor in quality; low-grade meat.","zh":"（非正式，常带贬义）劣质的东西；低档肉（比喻用法）。"},"examples":[{"en":"He complained that the cafeteria served “dogmeat” burgers.","zh":"他抱怨食堂提供的是“劣质”汉堡。"},{"en":"Don’t buy that discount sausage—it’s practically dogmeat.","zh":"别买那种打折香肠——简直像劣质货。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, figurative) A person treated as worthless or as an easy target, especially in violent contexts.","zh":"（俚语，比喻）被当作无足轻重的人；（尤指暴力语境中）被当作“靶子”的人。"},"examples":[{"en":"In the war memoir, new recruits were described as dogmeat for the front line.","zh":"在那本战争回忆录里，新兵被形容为前线的“炮灰”。"}]}],"synonyms":["dog meat","low-grade meat","garbage (informal)","inferior food","expendable (figurative)"],"phonetic":"/ˈdɔɡˌmit/","extraExplanation":["“dogmeat”在英语里有强烈的文化与情感色彩。由于在许多英语国家里狗常被视为伴侣动物，这个词在讨论食物时容易引起反感；在比喻用法中也常带侮辱或冷酷语气。正式写作中建议避免用它来形容人，改用更中性表达（如 low-quality / inferior / expendable）。"]}
{"word":"dogmen","summary":{"en":"Dogmen usually means men who handle or train dogs; less commonly it can refer to legendary dog-headed people in old stories.","zh":"Dogmen通常指负责管理、训练或使用犬只的职业人员；较少见时也可指古代传说中的“狗头人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) men who work with or handle dogs, especially professionally (e.g., trainers, breeders, handlers, hunting guides).","zh":"（复数）从事与狗相关工作、负责管理或训练狗的人，尤指职业性的（如训犬师、繁殖者、犬只训导员、狩猎向导等）。"},"examples":[{"en":"The dogmen prepared the hounds before the hunt began.","zh":"狩猎开始前，这些训犬员把猎犬都准备好了。"},{"en":"Police dogmen trained the K-9 units to follow a scent.","zh":"警犬训导员训练K9小组沿着气味追踪。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) mythical or legendary “dog-headed men” described in some ancient and medieval writings.","zh":"（较少见）某些古代与中世纪文献中提到的“狗头人”（传说中的人形生物）。"},"examples":[{"en":"Some medieval maps included stories of dogmen living at the edges of the known world.","zh":"一些中世纪地图会在已知世界的边缘标注有关“狗头人”居住的传说。"}]}],"synonyms":["dog handlers","trainers","K-9 handlers","hound handlers"],"phonetic":"/ˈdɔɡmən/","extraExplanation":["“dogmen”更常见是“dogman”的复数，指与犬只工作的人。在现代语境里，这类用法多见于狩猎、警犬/K-9、赛犬或专业训犬圈。","“狗头人”的意思属于历史传说（英语常用学术词是 cynocephali），多出现在旅行见闻、宗教或地图传说中；现代日常英语里较少用到这一义项。"]}
{"word":"dogmouth","summary":{"en":"“dogmouth” is a rare compound noun meaning “a dog’s mouth.” In everyday English, “a dog’s mouth” is much more common.","zh":"“dogmouth”是很少见的复合名词，意思是“狗的嘴”。日常英语更常用“a dog’s mouth”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the mouth of a dog; the jaws, teeth, and tongue of a dog (literal meaning).","zh":"狗的嘴；狗的上下颌、牙齿和舌头（字面意思）。"},"examples":[{"en":"Be careful near the dog’s mouth, especially when it’s eating.","zh":"在狗吃东西时，靠近它的嘴要特别小心。"},{"en":"The vet checked the dogmouth for broken teeth.","zh":"兽医检查了狗的嘴里有没有断牙。"}]}],"synonyms":["a dog's mouth","the mouth of a dog","canine mouth"],"phonetic":"/ˈdɔɡˌmaʊθ/","extraExplanation":["“dogmouth”作为一个连写词非常少见；日常英语更常说“a dog’s mouth”（用所有格）或“the mouth of a dog”。在写作中如果看到“dog-mouth / dog mouth / dogmouth”，通常只是临时合成的复合词，用来强调“像狗一样的嘴”或“狗的嘴”这一意象。"]}
{"word":"dognap","summary":{"en":"“Dognap” means to steal a dog, often in a way similar to a kidnapping (sometimes for ransom).","zh":"“dognap”指“偷狗”，语感上类似“绑架”式地带走宠物，有时会索要赎金。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to steal someone’s dog (often for ransom or resale)","zh":"偷走别人的狗（常为勒索赎金或转卖）"},"examples":[{"en":"Someone tried to dognap our puppy from the yard.","zh":"有人试图从院子里偷走我们的小狗。"},{"en":"The family posted flyers after their dog was dognapped.","zh":"他们的狗被偷走后，这家人张贴了寻狗传单。"},{"en":"Police warned owners about dognapping in the neighborhood.","zh":"警方提醒狗主人注意社区里的偷狗事件。"}]}],"synonyms":["steal a dog","pet-nap","dog-steal"],"phonetic":"/ˈdɔɡˌnæp/","extraExplanation":["“dognap”是由“dog（狗）+ kidnap（绑架）”类比构成的较新词，常见于新闻报道、社交媒体和宠物失窃提醒中。","在英美语境里也常说“pet-nap / pet-napping（偷宠物）”或更直接的“steal a dog”。“dognap”带有“像绑架一样带走并可能索要赎金”的语感。"]}
{"word":"dognaped","summary":{"en":"“Dognaped” is usually spelled “dognapped,” meaning someone stole or kidnapped a dog.","zh":"“dognaped”通常拼作“dognapped”，意思是有人偷走/绑走了一只狗。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense of **dognap**) to steal or kidnap someone’s dog, often to demand a reward or to keep/sell the dog.","zh":"（**dognap** 的过去式）偷走或绑走别人的狗，常见动机是索要赎金、据为己有或转卖。"},"examples":[{"en":"Someone dognapped our puppy from the yard, and we called the police.","zh":"有人从院子里把我们的小狗偷走了，我们报了警。"},{"en":"The family posted flyers after their dog was dognapped near the park.","zh":"他们的狗在公园附近被偷走后，这家人贴了寻犬启事。"}]}],"synonyms":["steal a dog","kidnap a dog","take (someone’s) dog","abduct (a dog)"],"phonetic":"/ˈdɔɡˌnæpt/","extraExplanation":["你写的 **dognaped** 更常见的拼写是 **dognapped**（双写 p），因为 **nap** 是重读的短元音结尾，按英语常见规则加 -ed 时会双写辅音：nap → napped。","**dognap** 是把 **dog + kidnap** 组合出来的口语/新闻用词，语气偏非正式，但在报道宠物失窃时很常见。"]}
{"word":"dognaper","summary":{"en":"A dognapper is someone who steals dogs.","zh":"dognapper 指“偷狗的人/盗狗贼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who steals dogs, usually to sell them, demand a reward, or use them for illegal purposes.","zh":"偷狗的人；盗狗贼（通常为转卖、索要赎金/酬金或用于非法目的）。"},"examples":[{"en":"The police arrested a dognapper who had taken pets from several neighborhoods.","zh":"警方逮捕了一名盗狗贼，他从好几个社区偷走了宠物狗。"},{"en":"They warned owners to keep their dogs on a leash because a dognapper had been reported nearby.","zh":"他们提醒狗主人牵好狗绳，因为附近有人举报出现盗狗贼。"}]}],"synonyms":["dog thief","pet thief"],"phonetic":"ˈdɔɡˌnæpər","extraExplanation":["“dognapper”更常见的拼写是“dognapper”。你输入的“dognaper”通常被视为拼写错误或非常少见的变体。","在新闻与社区公告中，这个词常和“stolen dog（被盗的狗）”“reward（悬赏）”“microchip（植入芯片）”等一起出现。"]}
{"word":"dognapers","summary":{"en":"“Dognapers” means dog thieves; it’s a less common spelling of “dognappers.”","zh":"“dognapers”指偷狗的人，是更常见拼写“dognappers”的一种不太常见写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who steal dogs (often to demand money or sell them); plural of “dognapper.”","zh":"偷狗的人；“dognapper（偷狗贼）”的复数。"},"examples":[{"en":"The police warned pet owners to watch out for dognappers in the neighborhood.","zh":"警方提醒宠物主人注意社区里的偷狗者。"},{"en":"Some dognappers target popular breeds because they can be sold quickly.","zh":"一些偷狗者会盯上热门品种，因为更容易迅速转卖。"},{"en":"After several dogs went missing, neighbors organized a group chat to share sightings of possible dognappers.","zh":"几只狗接连失踪后，邻居们建了群聊来分享疑似偷狗者的线索。"}]}],"synonyms":["dog thieves","dognappers","pet thieves"],"phonetic":"/ˈdɔɡˌnæpɚz/","extraExplanation":["“dognapers”更常见的拼写是“dognappers”（双写p）。对应的动词是“dognap”（偷狗、拐走狗）。","这个词在英美新闻里常用于宠物被盗的报道，有时也出现在社交媒体的提醒贴中。"]}
{"word":"dognaping","summary":{"en":"Dognapping means stealing a dog; it can also mean the act/crime of stealing a dog.","zh":"Dognapping 指“偷狗”；也可指“偷狗这一行为/犯罪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the crime of stealing someone’s dog (often to demand money or for resale)","zh":"偷狗（常为勒索赎金或转卖而偷走他人的狗）"},"examples":[{"en":"Dog-napping cases have increased in some cities.","zh":"一些城市的偷狗案件有所增加。"},{"en":"They installed cameras after a dog-napping incident in the neighborhood.","zh":"社区发生偷狗事件后，他们安装了摄像头。"}]},{"partOfSpeech":"vt.","definition":{"en":"to steal someone’s dog","zh":"偷走（别人的）狗"},"examples":[{"en":"Someone tried to dognap our puppy from the yard.","zh":"有人试图从院子里偷走我们的小狗。"},{"en":"The dog was dognapped and later found at a shelter.","zh":"那只狗被偷走了，后来在收容所找到了。"}]}],"synonyms":["dog theft","steal a dog","kidnap (a dog)"],"phonetic":"/ˈdɔɡˌnæpɪŋ/","extraExplanation":["你写的 **dognaping** 常见拼写是 **dognapping**（有两个 p）。这个词是由 *dog* + *kidnapping* 类比构成，常见于新闻报道和警方通告中。","在日常口语里，人们也会说 **steal a dog**（偷狗）或更具体地说 **take someone’s dog**（把某人的狗带走/偷走），语气比“dognap”更常见。"]}
{"word":"dognapped","summary":{"en":"“Dognapped” means a dog was stolen (or someone stole a dog).","zh":"“dognapped”指（某只）狗被偷走，或指某人偷走了狗。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of “dognap”) to steal someone’s dog, often to demand a reward or to sell the dog.","zh":"（dognap 的过去式/过去分词）偷走别人的狗，常见动机是索要赎金、骗取悬赏金或转卖。"},"examples":[{"en":"Someone dognapped our neighbor’s puppy and left a note asking for money.","zh":"有人偷走了我们邻居的小狗，还留了纸条要钱。"},{"en":"The police found the dognapped dog two days later.","zh":"警方两天后找到了那只被偷走的狗。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective: stolen (said of a dog).","zh":"作形容词：被偷走的（指狗）。"},"examples":[{"en":"They posted flyers to help find the dognapped pet.","zh":"他们张贴传单，寻回那只被偷走的宠物。"}]}],"synonyms":["stole (a dog)","kidnapped (a dog)","abducted (a pet)","pet-napped"],"phonetic":"/ˈdɔɡˌnæpt/","extraExplanation":["“dognap”是由“dog + kidnap”构成的混成词（blend），语气更口语、带有新闻标题/社交媒体常见的表达。正式写作中也可用“steal someone’s dog / the dog was stolen”。","在英语语境里，偷宠物有时与“reward scam（悬赏金骗局）”或转卖有关，因此新闻里常出现“dognapped for ransom（为赎金而偷狗）”这类搭配。"]}
{"word":"dognapper","summary":{"en":"A dognapper is someone who steals a dog, often for ransom or resale.","zh":"dognapper 指偷走宠物狗的人，常为了勒索赎金或转卖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who steals someone’s dog, often to demand money (a ransom) or to resell the dog","zh":"偷狗者；拐走别人宠物狗的人（常为勒索赎金或转卖）"},"examples":[{"en":"The police warned pet owners about a dognapper operating in the neighborhood.","zh":"警方提醒宠物主人注意，有偷狗者在附近活动。"},{"en":"They paid a reward after their dog was taken by a dognapper.","zh":"他们的狗被偷狗者拐走后，只好悬赏寻回。"},{"en":"Keep your dog on a leash so it’s harder for a dognapper to grab it.","zh":"给狗拴上牵引绳，这样偷狗者更难下手。"}]}],"synonyms":["dog thief","pet thief","kidnapper (informal, for pets)"],"phonetic":"/ˈdɔɡˌnæpər/","extraExplanation":["“dognapper”由“dog + kidnapper”构成，是比较口语、带情绪色彩的说法，强调“像绑架一样把狗拐走”。新闻或正式场合也常用“dog thief（偷狗贼）”“steal a dog（偷狗）”。","在英语语境里，这类行为有时与“ransom（赎金）/ reward（悬赏）”联系在一起：偷走后要求付钱赎回，或利用主人急切心理索要“感谢费”。"]}
{"word":"dognappers","summary":{"en":"“Dognappers” means people who steal dogs.","zh":"“dognappers”指偷狗、拐狗的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who steal (kidnap) dogs, often to sell them or demand money for their return","zh":"偷狗的人；拐走狗的人（常为转卖或索要赎金）"},"examples":[{"en":"The police warned local pet owners to watch out for dognappers.","zh":"警方提醒当地宠物主人要提防偷狗的人。"},{"en":"They installed cameras after reports of dognappers in the neighborhood.","zh":"社区传出偷狗者出没后，他们安装了监控摄像头。"},{"en":"Some dognappers target popular breeds because they can be sold quickly.","zh":"一些偷狗者会盯上热门犬种，因为更容易快速转卖。"}]}],"synonyms":["dog thieves","pet thieves","kidnappers (of dogs)"],"phonetic":"/ˈdɔɡˌnæpərz/","extraExplanation":["“dognapper”由 dog + kidnapper（绑架者）构成，常见于新闻与社交媒体提醒语境，尤以英国媒体中较常见；美式英语里也会说 dog thief（偷狗贼）或 someone who steals dogs。","现实中“偷狗”可能涉及转卖、繁殖牟利或勒索（要求主人付钱赎回）。给宠物植入芯片（microchip）、佩戴身份牌（ID tag）与不让宠物单独留在院外，都是常见的防范建议。"]}
{"word":"dognapping","summary":{"en":"Dognapping means stealing a dog, often to demand money for its return.","zh":"dognapping 指偷狗，常带有索要赎金或以归还为条件获利的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the crime of stealing someone’s dog, usually to demand money or other benefits for returning it","zh":"偷狗并勒索赎金（或以归还狗为条件获取好处）的犯罪行为"},"examples":[{"en":"There has been a rise in dognapping cases in the city.","zh":"这座城市的偷狗勒索案件有所上升。"},{"en":"The family posted online after their dog was taken in a suspected dognapping.","zh":"他们的狗疑似被偷走勒索后，这家人在网上发帖求助。"}]},{"partOfSpeech":"v.","definition":{"en":"to steal a dog, especially to demand money for its return","zh":"偷走狗（尤指为索要赎金而偷）"},"examples":[{"en":"Some criminals dognap expensive breeds and ask for a reward.","zh":"有些犯罪分子会偷走名贵犬种并索要酬金。"},{"en":"They were arrested for trying to dognap a puppy outside the store.","zh":"他们因试图在商店外偷走一只小狗而被捕。"}]}],"synonyms":["dog theft","steal a dog","pet theft"],"phonetic":"/ˈdɔɡˌnæpɪŋ/","extraExplanation":["“Dognapping”由 dog + kidnapping 构成，是较新的合成词，常见于新闻与社交媒体语境。","在英美语境中，它通常暗含“索要赎金/悬赏”的动机，不只是一般的“偷狗”（dog theft）。日常表达也常说“steal someone’s dog”或“dog theft”。"]}
{"word":"dognaps","summary":{"en":"“Dognaps” usually means “steals dogs” (verb) or “dog-theft incidents” (noun plural).","zh":"“dognaps”通常指“偷狗”（动词）或“偷狗事件”（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to steal a dog (often for ransom, resale, or breeding); to take someone’s dog without permission","zh":"偷走狗（常为勒索赎金、转卖或繁殖）；未经允许把别人的狗带走"},"examples":[{"en":"Someone dognapped her puppy from the yard and left a note asking for money.","zh":"有人从院子里偷走了她的小狗，还留下纸条要钱。"},{"en":"Keep your dog on a leash—there have been reports of people dognapping small breeds.","zh":"遛狗要拴绳——听说最近有人专偷小型犬。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural form) instances of stealing dogs; stolen-dog cases","zh":"（复数）偷狗事件；狗被盗的案件"},"examples":[{"en":"Local shelters shared warnings after several dognaps in the neighborhood.","zh":"附近发生多起偷狗事件后，当地收容所发布了提醒。"}]}],"synonyms":["steal a dog","dog theft","take someone’s dog","kidnap a dog"],"phonetic":"/ˈdɔɡˌnæps/","extraExplanation":["“dognap”是由“dog + kidnap”构成的较新用法，常见于新闻标题、社交媒体和动物救援组织的通告中。","更常见的说法包括“steal a dog / take someone’s dog / dog theft”。在正式场合或法律语境里，通常会用“dog theft（偷狗）”。"]}
{"word":"Dogpatch","summary":{"en":"Dogpatch is best known as a fictional town in *Li’l Abner*; it can also mean a stereotyped backward rural place, and it’s the name of a San Francisco neighborhood.","zh":"Dogpatch最常指漫画《Li’l Abner》中的虚构小镇；也可指带刻板印象的“落后乡下地方”；同时还是旧金山的一个社区名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fictional rural town in the American comic strip *Li’l Abner* (by Al Capp), often portrayed as poor, isolated, and old-fashioned.","zh":"（美国连环漫画《Li’l Abner》中的）虚构乡村小镇“Dogpatch”，常被描绘为贫穷、偏远、保守落后。"},"examples":[{"en":"In *Li’l Abner*, many of the stories take place in Dogpatch.","zh":"在《Li’l Abner》里，很多故事都发生在Dogpatch。"},{"en":"The movie kept the comic’s Dogpatch setting but updated some jokes.","zh":"这部电影保留了漫画的Dogpatch背景，但把一些笑点更新了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, sometimes offensive) A stereotyped term for a poor, backward, rural place; a “backwoods” town.","zh":"（非正式用法，有时带冒犯）对贫穷、落后乡下地方的刻板称呼；相当于“穷乡僻壤/山沟小镇”。"},"examples":[{"en":"Some people unfairly describe the area as a ‘Dogpatch,’ but locals disagree.","zh":"有些人不公平地把那片地区说成“Dogpatch”，但当地人并不认同。"},{"en":"The article avoided ‘Dogpatch’ because it can sound insulting.","zh":"那篇文章避免使用“Dogpatch”，因为它听起来可能带侮辱性。"}]},{"partOfSpeech":"n.","definition":{"en":"A neighborhood in San Francisco, California, known for former industrial sites, new housing, and a growing arts/tech scene.","zh":"（美国加州旧金山的）Dogpatch社区，以曾经的工业区、近年的住宅开发，以及逐渐兴起的艺术/科技氛围而知名。"},"examples":[{"en":"They rented a studio in San Francisco’s Dogpatch.","zh":"他们在旧金山的Dogpatch租了一个工作室。"},{"en":"Dogpatch has lots of converted warehouses and cafés.","zh":"Dogpatch有很多改造后的仓库空间和咖啡馆。"}]}],"synonyms":["backwoods (informal)","boondocks (informal)","one-horse town (informal)","small town"],"phonetic":"ˈdɔɡˌpætʃ","extraExplanation":["“Dogpatch”最早广为人知来自1930年代起的漫画《Li’l Abner》。因此它后来也被引申为对“偏远落后小地方”的标签，但这种用法容易带有阶层与地域偏见；正式写作中通常建议改用更中性的说法（如 rural town / remote area）。"]}
{"word":"dogpiled","summary":{"en":"“Dogpiled” means people (or animals) piled on top of someone/something, or (figuratively) many people joined in attacking/criticizing someone.","zh":"“Dogpiled”指（人或动物）一拥而上叠成一团；也可比喻许多人跟风一起攻击或批评某人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense / past participle) to crowd on top of someone or something, often suddenly and in a messy pile.","zh":"（过去式/过去分词）突然拥上去、挤压到某人/某物上面，形成一团乱堆。"},"examples":[{"en":"After the final whistle, the players dogpiled on the goalie to celebrate.","zh":"终场哨响后，队员们扑到守门员身上叠成一团庆祝。"},{"en":"The puppies dogpiled on the blanket and fell asleep.","zh":"小狗们挤在毯子上堆成一团睡着了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative) to join others in strongly criticizing, blaming, or attacking someone—especially online.","zh":"（比喻）跟风一起猛烈批评、指责或攻击某人（尤指在网上）。"},"examples":[{"en":"One misunderstanding happened, and people dogpiled on her in the comments.","zh":"一个误会发生后，评论区的人就开始跟风围攻她。"},{"en":"Instead of dogpiling, try asking what actually happened.","zh":"与其跟风指责，不如先问清楚到底发生了什么。"}]}],"synonyms":["piled on","swarmed","mobbed","ganged up on","jumped on"],"phonetic":"/ˈdɔɡˌpaɪld/","extraExplanation":["“dogpile”本来指一群人（或动物）像“狗一样”一起扑上去叠成一堆，常见于体育庆祝场景（如美式足球、棒球）。后来引申为网络语境里的“群起围攻/网暴式跟风”。写作中如果想更中性，可以用“pile on”或“join in the criticism”。"]}
{"word":"dogplate","summary":{"en":"Dogplate usually means a dog’s collar ID tag; in technical contexts it can also mean a toothed metal plate used to grip or join materials.","zh":"Dogplate通常指狗项圈上的身份牌；在技术语境中也可指用于咬合/连接材料的带齿金属连接板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small metal tag attached to a dog’s collar that shows the dog’s ID or license information","zh":"挂在狗项圈上的金属身份牌（写有狗的身份信息或登记/许可证信息）"},"examples":[{"en":"Make sure your dogplate has your current phone number on it.","zh":"确保狗牌上写的是你现在的电话号码。"},{"en":"The shelter checked the dogplate to find the owner.","zh":"收容所查看了狗牌来寻找主人。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) a metal plate, often with points or teeth, used to grip or join pieces of wood or other materials","zh":"（技术用语）用于固定或连接木材等材料的金属连接板（常带尖齿/突起）"},"examples":[{"en":"The carpenter used a dogplate to fasten the two timbers together.","zh":"木匠用带齿连接板把两根木料固定在一起。"},{"en":"Check that each dogplate is seated firmly before lifting the frame.","zh":"抬起框架前要检查每块连接板是否压紧到位。"}]}],"synonyms":["dog tag","ID tag","collar tag","connector plate","toothed plate"],"phonetic":"/ˈdɔɡˌpleɪt/","extraExplanation":["“dogplate”更常见的写法是分开写作“dog plate”，在不同地区也可能直接说“ID tag / dog tag”（但“dog tag”更常指军人身份牌）。","作为连接件的“dog plate / dogplate”多出现在木工、建筑或结构工程语境中；若你是在某个说明书/行业文本里看到它，通常指这种带齿或带钉的金属连接板。"]}
{"word":"dogproof","summary":{"en":"“Dogproof” means made so dogs can’t get in, open, or damage something.","zh":"“dogproof”指“防狗的”：设计成让狗进不去、打不开或不易被狗破坏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed so that a dog cannot enter, reach, open, or damage something; secure against dogs.","zh":"（物品/空间）防狗的；设计成让狗进不去、够不着、打不开或不易被狗破坏的。"},"examples":[{"en":"We need a dogproof gate for the backyard.","zh":"我们需要一个后院用的防狗栅门。"},{"en":"Put the snacks in a dogproof container.","zh":"把零食放进防狗的密封容器里。"},{"en":"The trash can isn’t dogproof—he knocked it over again.","zh":"这个垃圾桶不防狗——它又被它撞翻了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something secure against dogs (often written with a hyphen: dog-proof).","zh":"使……防狗（常写作带连字符的 dog-proof）。"},"examples":[{"en":"They dogproofed the fence by adding a taller panel.","zh":"他们加高了围栏，使它更防狗。"},{"en":"We dogproofed the pantry door with a latch.","zh":"我们给食品储藏室的门装了门闩，让它防狗。"}]}],"synonyms":["dog-resistant","dog-safe","secure","animal-proof","pet-proof"],"phonetic":"/ˈdɔɡˌpruf/","extraExplanation":["在写法上，作形容词时常见 dogproof 或 dog-proof 两种：放在名词前作定语（a dog-proof lock）时更常用连字符；作表语（The lock is dogproof.）时两种都可见。口语里也常用更通俗的说法，如 “dog-safe”（对狗安全）或 “dog-resistant”（耐狗折腾）。"]}
{"word":"Dogra","summary":{"en":"Dogra refers to the Dogra people (mainly from Jammu) and, more broadly, to things related to their culture or the Dogri language.","zh":"Dogra 指多格拉族群（主要在查谟地区）及与其文化相关的事物；有时也可指多格里语（Dogri）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Dogra ethnic group, mainly from the Jammu region (in and around northern India).","zh":"多格拉人（Dogra），主要分布在查谟地区及其周边的一个族群成员。"},"examples":[{"en":"Many Dogra families have a long history in the Jammu region.","zh":"许多多格拉家庭在查谟地区有悠久的历史。"},{"en":"She is Dogra and grew up speaking Dogri at home.","zh":"她是多格拉人，在家里从小讲多格里语（Dogri）。"}]},{"partOfSpeech":"n.","definition":{"en":"the Dogri language (sometimes referred to as “Dogra” in casual use).","zh":"多格里语（Dogri；口语中有时也称“Dogra”）。"},"examples":[{"en":"He can read and write Dogra/Dogri as well as Hindi.","zh":"他既会读写多格拉语/多格里语，也会印地语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Dogra people, their culture, or their language.","zh":"多格拉人的；与多格拉文化或语言有关的。"},"examples":[{"en":"Dogra traditions are an important part of the region’s cultural life.","zh":"多格拉传统是该地区文化生活的重要组成部分。"},{"en":"The museum has a small collection of Dogra art.","zh":"这家博物馆有一小部分多格拉艺术藏品。"}]}],"synonyms":["Dogri (for the language)"],"phonetic":"/ˈdoʊɡrə/","extraExplanation":["“Dogra”常见于历史与文化语境，尤其与查谟（Jammu）及旧时的“Jammu and Kashmir”地区相关。日常语言学语境里，指语言时更常用“Dogri（多格里语）”。","在一些历史叙述中也会出现“Dogra rulers/Dogra dynasty（多格拉统治者/王朝）”，多与19世纪查谟地区的政治史相关。"]}
{"word":"dogra","summary":{"en":"Dogra refers to the Dogra people from the Jammu region, or anything related to their culture and language.","zh":"Dogra 指主要来自印度查谟地区的多格拉族群，也可作形容词表示与其文化或语言有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indo-Aryan ethnic group mainly from the Jammu region (in India), also found in nearby areas of Pakistan","zh":"多格拉人：主要来自印度查谟（Jammu）地区的一个印欧语系（印度-雅利安语支）族群，在巴基斯坦邻近地区也有分布"},"examples":[{"en":"Many Dogra families have lived in the Jammu region for generations.","zh":"许多多格拉家庭在查谟地区世代居住。"},{"en":"She is Dogra and speaks Dogri at home.","zh":"她是多格拉人，在家里说多格里语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Dogra people, their culture, or their language","zh":"多格拉的：与多格拉人、其文化或语言相关的"},"examples":[{"en":"The museum has a Dogra art section with traditional paintings and crafts.","zh":"博物馆有一个多格拉艺术展区，展出传统绘画和手工艺品。"},{"en":"They performed a Dogra folk song at the school event.","zh":"他们在学校活动上表演了一首多格拉民歌。"}]}],"synonyms":["Dogri (language-related)"],"phonetic":"/ˈdoʊɡrə/","extraExplanation":["“Dogra”常见于南亚历史与文化语境，尤其与查谟（Jammu）及克什米尔周边地区相关；“Dogri”则更常指多格拉人使用的语言（多格里语）。","在英文里，“a Dogra”多指“一个多格拉人”；“Dogra culture/food/art”则表示“多格拉文化/饮食/艺术”。首字母通常大写（Dogra）。"]}
{"word":"Dogri","summary":{"en":"Dogri refers to the Dogra people, their Indo-Aryan language, or anything related to them (especially in the Jammu region).","zh":"Dogri 指多格拉族人、他们使用的多格里语，或与其相关的事物（尤与印度查谟地区相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Dogra community, mainly in the Jammu region of India (and nearby areas).","zh":"多格拉族人（主要分布在印度查谟地区及周边）。"},"examples":[{"en":"Many Dogri speakers also use Hindi or English at school and work.","zh":"许多说多格里语的人在学校和工作中也会使用印地语或英语。"},{"en":"Dogri culture includes distinctive music, folk songs, and festivals.","zh":"多格拉文化包含独特的音乐、民歌与节庆活动。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indo-Aryan language spoken by the Dogra people, especially in Jammu and parts of northern India.","zh":"多格里语（印欧语系—印度-雅利安语支语言，主要在查谟及印度北部部分地区使用）。"},"examples":[{"en":"She can understand Dogri but prefers to speak Punjabi with friends.","zh":"她听得懂多格里语，但更喜欢和朋友说旁遮普语。"},{"en":"The story was translated from Dogri into English.","zh":"这篇故事从多格里语被翻译成英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Dogra people or the Dogri language.","zh":"与多格拉族或多格里语相关的。"},"examples":[{"en":"He’s doing research on Dogri literature.","zh":"他正在研究多格里语文学。"},{"en":"We listened to a Dogri folk song.","zh":"我们听了一首多格里民歌。"}]}],"synonyms":["Dogri language","Dogra (people)"],"phonetic":"/ˈdoʊɡri/","extraExplanation":["“Dogri”常见于语言与文化语境：Dogri 是印度宪法承认的语言之一（列入第八附表）。","书写方面：现代多格里语多用天城文（Devanagari）；历史上也曾使用塔克里字母（Takri）等书写传统。","地理与文化背景：Dogri 与查谟（Jammu）地区联系紧密，常在谈论北印度多语言环境、民间艺术与地区身份时出现。"]}
{"word":"Dogrib","summary":{"en":"“Dogrib” is an older English term for the Tłı̨chǫ people and their Athabaskan (Dene) language in Canada’s Northwest Territories.","zh":"“Dogrib”是对加拿大西北地区 Tłı̨chǫ 族群及其阿萨巴斯卡/德内语系语言的旧英文称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former English name for the Tłı̨chǫ (Dogrib) people, a Dene (Athabaskan) Indigenous group in Canada’s Northwest Territories","zh":"对加拿大西北地区（Northwest Territories）一支德内/阿萨巴斯卡语系原住民族——Tłı̨chǫ（旧称 Dogrib）族人的旧英文称呼"},"examples":[{"en":"Some older books use the term “Dogrib,” but today many people prefer “Tłı̨chǫ.”","zh":"一些较早的书会用 “Dogrib”，但如今很多人更倾向使用 “Tłı̨chǫ”。"},{"en":"The museum exhibit highlights the history of the Tłı̨chǫ (Dogrib) people in the Northwest Territories.","zh":"这场博物馆展览介绍了西北地区 Tłı̨chǫ（Dogrib）族群的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Tłı̨chǫ (Dogrib) language, an Athabaskan (Dene) language spoken in Canada","zh":"Tłı̨chǫ（旧称 Dogrib）语，一种在加拿大使用的阿萨巴斯卡/德内语系语言"},"examples":[{"en":"She is learning Dogrib (Tłı̨chǫ) to speak with her grandparents.","zh":"她在学 Dogrib（Tłı̨chǫ）语，好和祖父母交流。"},{"en":"The school offers lessons in English and Tłı̨chǫ (Dogrib).","zh":"学校开设英语和 Tłı̨chǫ（Dogrib）语课程。"}]}],"synonyms":["Tłı̨chǫ"],"phonetic":"/ˈdɔɡˌrɪb/","extraExplanation":["“Dogrib”在当代语境中常被视为较旧或外来命名；许多社群更认可自称 “Tłı̨chǫ”。写作或学术引用时，常见做法是在首次出现时写 “Tłı̨chǫ (formerly called Dogrib)” 以兼顾准确与可读性。","该词在英语中多用于人类学、历史、语言学、加拿大原住民研究等领域；日常对话里更常见 “Tłı̨chǫ people / Tłı̨chǫ language”。"]}
{"word":"dogrib","summary":{"en":"Dogrib refers to the Tłı̨chǫ people of Canada’s Northwest Territories and their Dene (Athabaskan) language.","zh":"Dogrib 指加拿大西北地区的 Tłı̨chǫ（特利乔）族群及其德内（阿萨巴斯卡语系）语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous Dene people of Canada’s Northwest Territories, also known today as the Tłı̨chǫ.","zh":"加拿大西北地区的德内（Dene）原住民族之一；该族群现今也常称为 Tłı̨chǫ（特利乔族）。"},"examples":[{"en":"The Dogrib (Tłı̨chǫ) people have a long history around Great Slave Lake.","zh":"Dogrib（Tłı̨chǫ）族在大奴湖一带有悠久历史。"},{"en":"She is Dogrib and grew up in the Northwest Territories.","zh":"她是 Dogrib（Tłı̨chǫ）族人，在西北地区长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Athabaskan (Dene) language traditionally spoken by the Dogrib/Tłı̨chǫ people; often called the Tłı̨chǫ language.","zh":"Dogrib／Tłı̨chǫ 族传统使用的阿萨巴斯卡语系（德内语支）语言；也常称为 Tłı̨chǫ 语。"},"examples":[{"en":"Some community programs offer classes in Dogrib (Tłı̨chǫ).","zh":"一些社区项目开设 Dogrib（Tłı̨chǫ）语课程。"},{"en":"He can understand Dogrib but usually speaks English at work.","zh":"他能听懂 Dogrib（Tłı̨chǫ）语，但工作时通常说英语。"}]}],"synonyms":["Tłı̨chǫ","Tlicho","Tłı̨chǫ language","Dogrib language"],"phonetic":"/ˈdɔɡˌrɪb/","extraExplanation":["“Dogrib”是较早的英文名称，来源与历史称呼有关；如今很多人更偏好使用族群自称 “Tłı̨chǫ”（也写作 Tlicho），在正式场合与当事人沟通时使用其自称通常更尊重。","在写作中常见大小写：Dogrib（族群/语言专名首字母大写）。当作形容用时也常见于搭配（如 Dogrib community），但英语里通常仍按专名处理。"]}
{"word":"dogs","summary":{"en":"“Dogs” usually means more than one dog; it can also be a verb meaning to follow or trouble someone persistently.","zh":"“dogs”通常是“狗”的复数；也可作动词，表示持续跟踪或长期困扰某人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"More than one dog: domesticated animals often kept as pets, known for loyalty and companionship.","zh":"狗（复数）：常见的家养动物，常作为宠物饲养，以忠诚和陪伴著称。"},"examples":[{"en":"There are three dogs in the park.","zh":"公园里有三只狗。"},{"en":"Some dogs are trained to help people, like guide dogs.","zh":"有些狗会被训练来帮助人，比如导盲犬。"}]},{"partOfSpeech":"v.","definition":{"en":"To follow someone closely and repeatedly, often in an annoying way.","zh":"（动词）紧跟；纠缠（常带有烦扰的意味）。"},"examples":[{"en":"Reporters dogged the actor everywhere he went.","zh":"记者到处跟着那位演员不放。"}]}],"synonyms":["canines","hound","follow","pursue"],"phonetic":"/dɔɡz/","extraExplanation":["“dogs”是“dog”的复数形式。英语里名词变复数通常在词尾加 -s（dog → dogs）。","作动词时，“to dog someone”语气偏负面，常用于“问题/麻烦持续困扰某人”（例如：Problems dogged him for years / 多年来问题一直困扰他）。"]}
{"word":"dogsbodies","summary":{"en":"“dogsbodies” means people who are made to do boring, low-status odd jobs for others (plural of dogsbody).","zh":"“dogsbodies”指被派去做琐碎、低地位杂活的人们（dogsbody 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British, informal) A person who is made to do a lot of boring, low-status jobs for others; a general helper who gets the “dirty work.” (Plural of dogsbody.)","zh":"（英式口语）被派去做许多琐碎、低地位杂活的人；打杂的人。（dogsbodies 为 dogsbody 的复数）"},"examples":[{"en":"As the newest employee, she became the office dogsbody—making coffee, copying files, and running errands.","zh":"作为最新入职的员工，她成了办公室的“打杂”——泡咖啡、复印文件、跑腿。"},{"en":"The manager treated junior staff like dogsbodies instead of training them.","zh":"经理把初级员工当成“杂工”使唤，而不是培训他们。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) People who do unskilled or routine tasks, especially in a team or organization.","zh":"（较少见）在团队或组织里负责非技术性、例行杂务的一群人。"},"examples":[{"en":"The project needed specialists, not just dogsbodies to follow instructions.","zh":"这个项目需要专家，而不只是按指令做事的“杂工”。"}]}],"synonyms":["gofer","lackey","factotum","drudge","odd-jobber"],"phonetic":"/ˈdɔɡzˌbɑdi/","extraExplanation":["“dogsbody”主要是英式用法，语气偏贬义或带抱怨：强调工作琐碎、缺乏认可、常被使唤。更中性的说法可以用 “assistant / helper”。","拼写上：单数 dogsbody；复数 dogsbodies（把 -y 变成 -ies）。","常见搭配：office dogsbody（办公室打杂/跑腿的人）、be treated like a dogsbody（被当成杂工使唤）、do the dogsbody work（做杂活）。"]}
{"word":"dogsbody","summary":{"en":"A dogsbody is someone who does the unpleasant, low-status jobs that others avoid (mainly British English).","zh":"dogsbody 指做别人不愿做的苦差事、地位较低的打杂/跑腿的人（主要为英式英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does unpleasant, low-status work for others; a general helper who does the jobs no one else wants","zh":"（为他人做）苦差事的人；打杂/跑腿的人（做别人不愿做的工作）"},"examples":[{"en":"In the office, he felt like a dogsbody, always making coffee and carrying boxes.","zh":"在办公室里，他觉得自己像个打杂的，总是泡咖啡、搬箱子。"},{"en":"She started as a dogsbody on the film set, doing small tasks for everyone.","zh":"她在片场一开始就是个跑腿打杂的，给所有人做各种小事。"}]}],"synonyms":["gofer","gopher","lackey","flunky","errand runner","general helper"],"phonetic":"/ˈdɔɡzˌbɑdi/","extraExplanation":["“dogsbody”主要是英式英语（British English）的口语词，语气常带一点贬义或自嘲，强调“被使唤、做杂活”。在美式英语里更常用的近似说法有“gofer”“gopher”（跑腿的）或“grunt work”（苦差事）。","词源上可理解为“像狗一样被差遣的身体/人”，因此带有“辛苦、地位低、被呼来喝去”的含义。使用时注意场合：在正式场合可能显得不够礼貌。"]}
{"word":"dogship","summary":{"en":"Dogship is an informal, nonstandard word meaning a friendly bond involving dogs, often used playfully online.","zh":"Dogship 是一种非正式、非标准的网络用词，俏皮地表示与狗有关的友谊或亲密情感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard) Friendship or a close bond involving dogs—either the friendship between dogs, or the affectionate relationship between a person and a dog.","zh":"（非正式、非标准用语）“狗狗之间的友谊/情谊”，或“人与狗之间亲密的感情与陪伴”。"},"examples":[{"en":"Their dogship started at the park and grew every weekend after that.","zh":"它们在公园结下了“狗狗情谊”，之后每个周末都越走越近。"},{"en":"Adopting a rescue dog gave me a kind of dogship I didn’t know I needed.","zh":"领养一只救助犬让我拥有一种我之前没意识到自己需要的“狗狗陪伴与情感”。"}]},{"partOfSpeech":"n.","definition":{"en":"(very rare) A ship or transport service used for carrying dogs (for example, in a story, joke, or brand name).","zh":"（极少见）运送狗的船只或运输服务（常见于故事、玩笑或品牌/标题用法）。"},"examples":[{"en":"In the cartoon, a dogship sailed to the island with hundreds of puppies.","zh":"在那部动画里，一艘“狗狗运输船”载着几百只小狗驶向小岛。"}]}],"synonyms":["canine companionship","bond with a dog","friendship between dogs"],"phonetic":"/ˈdɔɡʃɪp/","extraExplanation":["“dogship”不是常见词，更多是网络上的自造词（blend），把 dog +（friend）ship 拼在一起，用来俏皮地表达“狗狗之间/人与狗之间的情谊”。","语气通常可爱、轻松、带一点幽默；正式写作中一般用更常规的表达，如 “friendship between dogs / companionship with a dog”。"]}
{"word":"dogshore","summary":{"en":"A dogshore is a temporary prop/support, especially in shipbuilding, docks, or construction; it can also mean to brace something with such a support.","zh":"dogshore 指临时支撑物（常用于造船、码头或建筑），也可作动词表示用支撑物临时顶撑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a temporary support or prop (often a timber or beam), especially one used in shipbuilding, docks, or construction to brace something in place","zh":"（临时）支撑木/支撑梁；（尤指造船、码头或建筑中用来）顶撑、支住某物的支柱"},"examples":[{"en":"The workers put in a dogshore to hold the frame steady while they repaired it.","zh":"工人加了一根临时支撑木，来稳住框架，方便维修。"},{"en":"On the dock, a dogshore kept the heavy panel from tipping.","zh":"在码头上，一根支撑木防止那块沉重的板子倾倒。"}]},{"partOfSpeech":"vt.","definition":{"en":"to support or brace something temporarily with a prop","zh":"用临时支撑物顶住；临时支撑"},"examples":[{"en":"They dogshored the damaged wall until engineers could inspect it.","zh":"他们先把受损的墙临时支撑住，等工程师来检查。"}]}],"synonyms":["prop","support","brace","shore (up)"],"phonetic":"/ˈdɔɡˌʃɔr/","extraExplanation":["“Dogshore”多见于英式或航海/造船相关语境，属于较专业的词。意思与“shore（支撑物/顶撑）”接近，强调临时性的支撑，用来防止结构在施工或维修时移动、倾倒或变形。","在现代日常英语里更常见的说法是“prop”“support”“brace”（作名词或动词），而“dogshore”相对少用，常出现在技术说明、工程记录或历史性的港口/船坞文本中。"]}
{"word":"dogskin","summary":{"en":"Dogskin means a dog’s skin/hide, and by extension something made from it (rarely mentioned today).","zh":"dogskin 指狗皮/狗皮革，也可指狗皮制的东西（现代用法较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skin or hide of a dog, sometimes used (rarely) as leather","zh":"狗皮；（罕见）可用作皮革的狗皮革"},"examples":[{"en":"The old book was said to have a cover made of dogskin.","zh":"据说那本旧书的封面是用狗皮做的。"},{"en":"He wore a small pouch made of dogskin leather.","zh":"他带着一个用狗皮革做的小袋子。"}]},{"partOfSpeech":"adj.","definition":{"en":"made from dogskin (used before a noun)","zh":"狗皮制的（作定语）"},"examples":[{"en":"The museum displayed a dogskin drum from the region.","zh":"博物馆展出了一面来自该地区的狗皮鼓。"}]}],"synonyms":["hide","skin","leather (when referring to processed animal skin)"],"phonetic":"/ˈdɔɡˌskɪn/","extraExplanation":["“dogskin”在现代英语里并不常见；在很多文化语境中，使用狗皮制品可能引发强烈情绪或伦理争议，因此相关表达通常出现在历史、民族志（民俗/人类学）或特定地域的描述中。"]}
{"word":"dogsled","summary":{"en":"A dogsled is a sled pulled by dogs, and it can also mean traveling by one.","zh":"dogsled 指“狗拉雪橇”，也可作动词表示“乘狗拉雪橇行进”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sled (sledge) pulled by one or more dogs, used for traveling or racing over snow","zh":"狗拉雪橇；由一只或多只狗拉着在雪地上行驶或比赛的雪橇"},"examples":[{"en":"They crossed the frozen river by dogsled.","zh":"他们乘狗拉雪橇穿过了结冰的河面。"},{"en":"Dogsled racing is popular in Alaska.","zh":"狗拉雪橇比赛在阿拉斯加很受欢迎。"}]},{"partOfSpeech":"v.","definition":{"en":"to travel by dogsled","zh":"乘狗拉雪橇旅行；用狗拉雪橇行进"},"examples":[{"en":"In winter, some families still dogsled to nearby villages.","zh":"冬天，一些家庭仍会乘狗拉雪橇去附近的村庄。"}]}],"synonyms":["dog sled","sled","sledge"],"phonetic":"/ˈdɔɡˌslɛd/","extraExplanation":["“dogsled”常见于北极及亚北极地区（如阿拉斯加、加拿大北部、格陵兰等）。传统上，它不仅是交通工具，也与当地原住民的生活方式和冬季生存技能有关。","在现代语境里，dogsled常与“dogsledding（狗拉雪橇活动）”和“dogsled racing（狗拉雪橇竞赛）”相关，既有观光体验也有体育赛事。"]}
{"word":"dogsleds","summary":{"en":"Dogsleds are sleds pulled by dogs, used to travel on snow and ice.","zh":"Dogsleds 指由狗拉的雪橇，用于在冰雪上行进。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of dogsled: sleds (sledges) pulled by one or more dogs, used for travel over snow and ice","zh":"dogsled 的复数：由一只或多只狗拉的雪橇，用于在冰雪地面上行进"},"examples":[{"en":"In Alaska, dogsleds are still used for winter races and for traveling in remote areas.","zh":"在阿拉斯加，狗拉雪橇至今仍用于冬季比赛以及偏远地区的出行。"},{"en":"The museum displays traditional dogsleds made from wood and rope.","zh":"博物馆展出了用木头和绳索制作的传统狗拉雪橇。"}]}],"synonyms":["dog sleds","sleds pulled by dogs","dog teams (context)"],"phonetic":"/ˈdɔːɡslɛdz/","extraExplanation":["“dogsled / dogsleds”常见于北极与亚北极地区（如阿拉斯加、加拿大北部、格陵兰等）的生活与文化语境，也常出现在探险与极地旅行题材中。","现代语境里，dogsleds 除了交通工具，也很常指“狗拉雪橇运动/比赛”的相关器材；较知名的赛事包括阿拉斯加的 Iditarod（艾迪塔罗德雪橇狗大赛）。","拼写上也常见作 dog sled / dog sleds（分开写）；意思相同，写法取决于出版社或地区习惯。"]}
{"word":"dogsleep","summary":{"en":"“dogsleep” means sleeping lightly or fitfully, not deeply.","zh":"“dogsleep”指浅睡、断断续续地睡，不是熟睡。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to sleep lightly or in short periods (not a deep, restful sleep)","zh":"浅睡；断断续续地睡（睡得不沉、不踏实）"},"examples":[{"en":"I couldn’t relax, so I just dogslept on the couch all night.","zh":"我放松不下来，只能在沙发上浅睡了一整晚。"},{"en":"He was so worried about the exam that he dogslept until morning.","zh":"他太担心考试了，直到早上都只是断断续续地睡。"}]},{"partOfSpeech":"n.","definition":{"en":"a light, uneasy sleep; a doze","zh":"浅睡；不安稳的小睡"},"examples":[{"en":"I got only a dogsleep before the early flight.","zh":"赶早班飞机前我只浅睡了一会儿。"},{"en":"After the noise outside, her dogsleep turned into full wakefulness.","zh":"外面的噪音一来，她的浅睡就变成彻底清醒了。"}]}],"synonyms":["doze","catnap","nap","snooze","sleep lightly","sleep fitfully"],"phonetic":"/ˈdɔɡˌsliːp/","extraExplanation":["“dogsleep / dog-sleep”不是最常见的日常用词，写作里更可能见到带连字符的形式“dog-sleep”，用来形象表达像狗一样保持警觉、睡得不沉。更口语的说法通常是“doze off / nap / sleep lightly”。"]}
{"word":"dogstail","summary":{"en":"“Dogstail” can mean a dog’s tail, and it can also refer to a tail-like type of grass (dogstail grass).","zh":"“dogstail”既可指狗的尾巴，也可指一种花序像尾巴的草（狗尾草类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dog’s tail (the tail of a dog); a less common spelling of “dog’s tail” used in compounds or as a label/name","zh":"狗尾巴；也可视为“dog’s tail”的不常见拼写，常见于复合词或标签/名称中"},"examples":[{"en":"The puppy wagged its dogstail happily.","zh":"小狗开心地摇着它的狗尾巴。"},{"en":"She tied a ribbon to the dogstail for the photo.","zh":"她为了拍照在狗尾巴上系了一条丝带。"}]},{"partOfSpeech":"n.","definition":{"en":"(also “dogstail grass”) a kind of grass with a narrow, tail-like flower head","zh":"（亦作“dogstail grass”）狗尾草类的一种，花序细长，像尾巴"},"examples":[{"en":"Dogstail grass grows well in open fields.","zh":"狗尾草类在开阔的田野里长得很好。"},{"en":"The path was lined with dogstail waving in the wind.","zh":"小路两旁长着狗尾草，在风里摇摆。"}]}],"synonyms":["dog’s tail","tail (of a dog)","dogstail grass"],"phonetic":"/ˈdɔɡzˌteɪl/","extraExplanation":["“dogstail”更常见的写法是带所有格的“dog’s tail”（狗的尾巴）。把它写成一个词“dogstail”时，常见于植物名（如“dogstail grass”）或非正式标注、产品名/用户名等。","植物义在英式英语的自然/农业语境里更常见；如果你想表达“狗的尾巴”，一般优先用“dog’s tail”。"]}
{"word":"dogstone","summary":{"en":"“Dogstone” is a rare noun meaning a stone/fossil nicknamed for dogs or linked to folk beliefs about protection or healing.","zh":"“dogstone”是个较罕见的名词，指因与“狗”有关而得名的石头/化石，或民俗中被认为能护身或疗愈的石头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, informal) A stone or rock associated with dogs, especially a stone believed in folk tradition to have protective or healing power (for example, against dog bites), or a stone/fossil popularly nicknamed for its “dog-like” shape.","zh":"（罕见，非正式）与“狗”相关的石头或岩石，尤其指民俗中被认为具有护身或疗愈作用的石头（例如用来防狗咬），或因外形像“狗”而得名的石头/化石。"},"examples":[{"en":"In local folklore, people carried a dogstone as a small charm for protection.","zh":"在当地民俗里，人们会随身带着“dogstone”当作护身小物。"},{"en":"The museum labeled the odd fossil as a “dogstone,” a popular nickname rather than a scientific term.","zh":"博物馆把那块奇特的化石标为“dogstone”，这更像是俗称而不是科学术语。"}]}],"synonyms":["houndstone (rare)","charm stone (contextual)","amulet stone (contextual)"],"phonetic":"/ˈdɔɡˌstoʊn/","extraExplanation":["“dogstone”不是现代英语里的常用词，更像是地方性/历史性俗称：不同地区可能把不同的石头、化石或护身石叫作“dogstone”。因此在阅读时要结合上下文（地名、民俗、自然史说明）来判断具体指哪一种石头。","如果你是在某本书、地图、博物馆标签或游戏/小说里看到它，可以把原句发来，我可以帮你根据语境锁定最可能的含义。"]}
{"word":"dogstones","summary":{"en":"“Dogstones” is uncommon in everyday English; it usually means stones related to a dog (literal), or it can be a place/rock-feature name.","zh":"“Dogstones”在日常英语中不常见：通常是字面指与狗有关的石头，或作为地名/岩石地貌名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, usually literal) Stones associated with a dog (for example, stones a dog carries, plays with, or that someone throws).","zh":"（罕见，多为字面）与狗有关的石头（例如狗叼着/玩耍的石头，或人们丢给/丢向狗的石头）。"},"examples":[{"en":"The puppy kept bringing dogstones into the house from the garden.","zh":"小狗一直把花园里的“狗石头”（它叼着玩的石头）叼进屋里。"},{"en":"Please don’t throw dogstones near the road—it isn’t safe.","zh":"请不要在路边扔“狗石头”，不安全。"}]},{"partOfSpeech":"n.","definition":{"en":"Dogstones: a proper name used for some places or rock features (the exact meaning depends on the local area).","zh":"Dogstones：某些地点或岩石地貌的专有名称（具体指什么取决于当地的地名用法）。"},"examples":[{"en":"We met at Dogstones and walked up the ridge.","zh":"我们在 Dogstones 碰面，然后沿着山脊往上走。"},{"en":"The map labels the outcrop as Dogstones.","zh":"地图把那处岩石露头标为 Dogstones。"}]}],"synonyms":["stones","rocks","pebbles"],"phonetic":"ˈdɔɡˌstoʊnz","extraExplanation":["“dogstones”不是现代英语里常见的固定词汇；你更常看到的是字面组合（dog + stones），或作为地名/地貌名出现。","如果你是在某本小说、游戏、或某个地区的地图上看到“Dogstones”，更可能是专名；提供一句原文上下文，我可以更准确判断含义与用法。"]}
{"word":"dogtail","summary":{"en":"Dogtail can mean a dog’s tail, or a type of grass with a tail-like seed head (dogtail grass).","zh":"dogtail 可以指“狗的尾巴”，也可以指穗形像尾巴的一类草（常说 dogtail grass）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tail of a dog (also used as a compound word in some contexts).","zh":"狗的尾巴（有时也写作复合词 dogtail）。"},"examples":[{"en":"The puppy chased its own dogtail in circles.","zh":"小狗追着自己的尾巴转圈。"},{"en":"Mud was stuck to the dogtail after the walk.","zh":"散步回来后，狗尾巴上粘了泥。"}]},{"partOfSpeech":"n.","definition":{"en":"a kind of grass with a flower head shaped like a small tail, especially dogtail grass.","zh":"一种穗状花序像“小尾巴”的草，尤指狗尾草/狗尾草类（dogtail grass）。"},"examples":[{"en":"Dogtail grows in meadows and is sometimes used in pasture mixes.","zh":"狗尾草生长在草地里，有时会被加入牧草混合种子中。"},{"en":"The field was full of dogtail swaying in the wind.","zh":"田野里满是随风摇摆的狗尾草。"}]}],"synonyms":["dog’s tail","dogtail grass"],"phonetic":"/ˈdɔɡˌteɪl/","extraExplanation":["“dogtail”作为“狗的尾巴”时，在日常英语里更常写成“dog’s tail”或“the dog’s tail”；写成一个词多见于特定语境（如标签、品种描述、标题）或复合词搭配中。","表示草时，“dogtail”通常指“dogtail grass”，在英式英语和农业/植物语境里更常见；不同地区可能指向不同的狗尾草类植物。"]}
{"word":"dogteeth","summary":{"en":"“Dogteeth” means canine teeth—the pointed teeth used for tearing; it is the plural of “dogtooth.”","zh":"“dogteeth”指犬齿（尖牙），用于撕裂食物；是“dogtooth”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the pointed teeth (canines) between the incisors and premolars, used for tearing food; plural of “dogtooth.”","zh":"犬齿；位于门齿与前臼齿之间、用于撕裂食物的尖牙（“dogtooth”的复数）。"},"examples":[{"en":"Cats and dogs have long dogteeth for tearing meat.","zh":"猫和狗有较长的犬齿，用来撕裂肉类。"},{"en":"The dentist checked my dogteeth to see if they were aligned.","zh":"牙医检查了我的犬齿，看看是否长得整齐。"}]}],"synonyms":["canines","canine teeth","fangs (informal)"],"phonetic":"/ˈdɔɡˌtiθ/","extraExplanation":["“dogtooth / dogteeth”在英语里最常见的意思就是“犬齿（canines）”。在人类口腔里，上下各两颗犬齿通常比较尖。","它也可能在特定领域出现引申用法，例如“dogtooth pattern（犬牙纹）”指一种锯齿状图案；或“dogtooth violet”指一种植物名（常译为“犬齿紫罗兰”），但这些通常需要明确语境才会用到。"]}
{"word":"dogtie","summary":{"en":"A dogtie is a leash/chain used to tether a dog; it can also mean to tether a dog.","zh":"dogtie 指拴狗用的狗绳/狗链，也可作动词表示“把狗拴住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a leash, chain, or cable used to fasten (tether) a dog to a fixed place so it can’t run away","zh":"（拴狗用的）狗绳／狗链／拴狗绳，用来把狗固定在某处，防止跑走"},"examples":[{"en":"Please put a dogtie on him before you open the gate.","zh":"开门前请先给它系上拴狗绳。"},{"en":"We used a dogtie in the yard while we cleaned the house.","zh":"我们打扫房子时，把狗用拴狗绳拴在院子里。"}]},{"partOfSpeech":"v.","definition":{"en":"to fasten a dog with a leash or chain to keep it in one place","zh":"用狗绳／狗链把狗拴住（使它待在固定位置）"},"examples":[{"en":"They dogtied the dog outside the store for a minute.","zh":"他们把狗在店外拴了一分钟。"},{"en":"Don’t dogtie a dog in the sun for long.","zh":"不要把狗在太阳下拴太久。"}]}],"synonyms":["dog leash","leash","lead","dog chain","tie-out","tether"],"phonetic":"/ˈdɔɡˌtaɪ/","extraExplanation":["“dogtie”在口语或商品名称里偶尔会看到，更常见的说法是 dog leash（牵引绳）、dog chain（狗链）、tie-out / tether（拴狗绳/拴系装置）。","在一些地区，长期拴狗可能被视为不人道或违反规定；如果需要短时间固定，尽量提供阴凉、水，并避免把绳子系得过紧或时间过长。"]}
{"word":"dogtooth","summary":{"en":"Dogtooth means a dog’s pointed canine tooth, and by extension a toothlike zigzag/pointed pattern in design or decoration.","zh":"dogtooth 指狗的尖牙（犬齿），也可引申指设计或装饰中“像牙一样的锯齿/尖角形”图案或边缘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pointed, triangular tooth of a dog (used as a general term for a dog’s canine tooth).","zh":"狗的尖牙；（泛指）犬齿。"},"examples":[{"en":"The vet checked the dog’s dogtooth to make sure it wasn’t cracked.","zh":"兽医检查了狗的尖牙，确认没有裂开。"},{"en":"The puppy’s dogtooth was still small and very sharp.","zh":"小狗的尖牙还很小，但非常锋利。"}]},{"partOfSpeech":"n.","definition":{"en":"A toothlike, pointed or zigzag shape (often used in design, patterns, or technical descriptions).","zh":"（形状像牙的）尖角形/锯齿形（常用于图案、设计或技术描述）。"},"examples":[{"en":"The border of the fabric has a dogtooth pattern.","zh":"这块布料的边缘有犬牙状（锯齿状）花纹。"},{"en":"The roof tiles formed a dogtooth edge along the eaves.","zh":"屋檐处的瓦片形成了犬牙状的边缘。"}]}],"synonyms":["canine tooth","canine","fang","zigzag edge","toothlike pattern"],"phonetic":"/ˈdɔɡˌtuθ/","extraExplanation":["“dogtooth”作复合词时字面意思是“狗的牙”，但在不同领域也会引申为“像尖牙一样的尖角/锯齿形”。在建筑装饰里，“dogtooth ornament”可指一种重复的尖角几何纹样（常见于哥特式等风格的装饰细节）。","拼写提示：常写作一个词 dogtooth；复数为 dogteeth。"]}
{"word":"dogtoothing","summary":{"en":"Dogtoothing means a repeated tooth-like triangular pattern, used in textiles/design and sometimes in Gothic architectural ornament.","zh":"Dogtoothing 指一种重复的“齿状三角形”纹样，多用于织物/设计，也可指哥特式建筑中的犬牙饰装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative pattern of repeated triangular “tooth-like” shapes (often seen in fabric patterns, knitting, or design); also the use of this pattern","zh":"“犬牙纹/狗牙纹”式的装饰图案（由重复的三角形“牙齿状”形组成，常见于织物、针织或设计中）；也指使用这种图案"},"examples":[{"en":"Her coat has a black-and-white dogtoothing pattern.","zh":"她的外套是黑白相间的犬牙纹图案。"},{"en":"The designer used subtle dogtoothing along the border of the scarf.","zh":"设计师在围巾边缘用了淡淡的犬牙纹装饰。"}]},{"partOfSpeech":"n.","definition":{"en":"(architecture, less common) a tooth-like ornamental molding, especially in medieval Gothic-style buildings; the act of adding this ornamentation","zh":"（建筑，较少用）中世纪哥特式建筑中常见的“犬牙饰”齿状装饰线脚；也可指添加这种装饰的做法"},"examples":[{"en":"The old church doorway features dogtoothing around the arch.","zh":"那座老教堂的门洞拱圈周围有犬牙饰装饰。"},{"en":"Restorers carefully repaired the worn dogtoothing on the stonework.","zh":"修复人员小心修补了石雕上磨损的犬牙饰。"}]}],"synonyms":["dogtooth pattern","tooth-like pattern","dogtooth ornament"],"phonetic":"/ˈdɔɡˌtuːθɪŋ/","extraExplanation":["“dogtoothing”来自“dogtooth（犬牙/狗牙）+ -ing”。它形容一种像牙齿一样尖尖排列的三角形纹样：在时尚里常和更常见的写法“dogtooth”或“houndstooth（千鸟格）”一起出现，但“houndstooth”通常指更像“破碎四角/鸟嘴”的格纹；在建筑史里，“dogtooth ornament（犬牙饰）”常见于欧洲中世纪哥特式石雕装饰。"]}
{"word":"dogtrick","summary":{"en":"A dog trick is a trained action a dog performs on command.","zh":"dog trick 指狗在指令下完成的训练动作/把戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a behavior a dog is trained to do on command, often for fun, a show, or basic training","zh":"狗在指令下完成的训练动作/把戏（常用于娱乐、表演或基础训练）"},"examples":[{"en":"Her dog can do a trick: it sits and gives a paw.","zh":"她的狗会一个把戏：会坐下，还会握手。"},{"en":"Teaching a simple dog trick can help build trust and focus.","zh":"教一个简单的狗狗动作可以帮助建立信任和专注力。"},{"en":"The kids laughed when the dog did its trick.","zh":"狗表演动作时，孩子们笑了。"}]}],"synonyms":["trained behavior","command","obedience trick","party trick"],"phonetic":"/ˈdɔɡ ˌtrɪk/","extraExplanation":["“dog trick”更常见的写法是分开写（dog trick）；口语里也常说“trick”来指狗的动作，比如：Sit! / Shake! / Roll over!。","有些“tricks”其实也是生活技能训练的一部分（如“stay”等待、“leave it”别碰），不只是表演。"]}
{"word":"dogtrot","summary":{"en":"Dogtrot most commonly means a covered open passage in (or between parts of) a traditional Southern U.S. house that provides airflow; it can also refer to that house style, or a slow easy trot.","zh":"dogtrot 最常指美国南方传统住宅中用于通风的有顶开放通道（穿堂风走廊）；也可指这种住宅格局，或形容慢悠悠的小跑步态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A covered open passage (breezeway), often through the middle of a house, that lets air flow between two enclosed rooms or sections.","zh":"（多指美国南方传统住宅中）两间房/两部分建筑之间的有顶开放通道（穿堂风走廊、风道），用于通风降温。"},"examples":[{"en":"The old farmhouse had a dogtrot that stayed cool even in summer.","zh":"那座老农舍中间有一条狗跑道式穿堂风走廊，夏天也很凉快。"},{"en":"We ate dinner in the dogtrot to catch the evening breeze.","zh":"我们在穿堂风走廊里吃晚饭，想吹吹傍晚的风。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of traditional Southern U.S. house plan featuring two main rooms separated by a central open passage (a “dogtrot house”).","zh":"一种美国南部传统民居格局：两间主要房间中间隔着一条开放风道（“狗跑道式住宅/穿堂风住宅”）。"},"examples":[{"en":"They restored a nineteenth-century dogtrot and kept the central passage open.","zh":"他们修复了一栋19世纪的穿堂风式老房子，并保留了中间的开放风道。"}]},{"partOfSpeech":"n.","definition":{"en":"A slow, relaxed trot (especially like a dog’s easy trotting gait).","zh":"（尤指像狗一样）慢悠悠的小跑步态。"},"examples":[{"en":"He crossed the yard at a dogtrot, not quite running.","zh":"他慢悠悠地小跑穿过院子，算不上真正的奔跑。"}]}],"synonyms":["breezeway","passageway","dogtrot house","easy trot"],"phonetic":"/ˈdɔɡˌtrɑt/","extraExplanation":["“dogtrot”这个词在美国文化里常和乡村、炎热气候下的生活智慧联系在一起：在空调普及前，人们用房屋中间的开放通道制造“穿堂风”来降温。","在建筑语境中你也会看到拼写作 dog-trot 或 dogtrot，指同一种格局；在口语里偶尔也用来形容“不紧不慢的小跑”。"]}
{"word":"dogtrots","summary":{"en":"“Dogtrots” is the plural of “dogtrot,” meaning either a southern U.S. house with an open breezeway between two cabins, or a short, easy trot.","zh":"dogtrots 是 dogtrot 的复数：可指美国南方“中间有通风走廊的两间式住宅”，也可指“轻快的小跑/小步快跑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a house (common in the southern U.S.) made of two small cabins joined by a roof, with an open breezeway (“dogtrot”) between them","zh":"（美国南方常见的）“狗跑廊式”住宅：两间小屋在同一屋顶下，中间留一条通风的露天走廊（称为 dogtrot）"},"examples":[{"en":"The old farmhouse was built as a dogtrot, with a shaded passageway down the middle.","zh":"那座老农舍是狗跑廊式结构，中间有一条阴凉的通道。"},{"en":"In summer, the dogtrot kept the home cooler by letting air flow through.","zh":"夏天，狗跑廊让空气穿过屋子，使室内更凉快。"}]},{"partOfSpeech":"n.","definition":{"en":"a short, quick, easy trot (a kind of gait), especially of a horse or dog","zh":"（马或狗等的）轻快的小跑步态；短促而轻松的慢跑"},"examples":[{"en":"The horse moved at a dogtrot along the dirt road.","zh":"那匹马沿着土路以轻快的小跑前进。"},{"en":"The puppy followed us at a dogtrot, never falling behind.","zh":"小狗轻快地跟着我们跑，一直没落下。"}]}],"synonyms":["breezeway house","cabin-and-breezeway house","jog","trot"],"phonetic":"/ˈdɔɡˌtrɑt/","extraExplanation":["“Dogtrot”这一建筑用法与美国南方早期乡村生活有关：中间的通风走廊在没有空调的年代能带来穿堂风，也常被当作休息、做家务或临时乘凉的空间。如今在历史建筑、民俗村或复古住宅设计中仍能看到。"]}
{"word":"dogtrotted","summary":{"en":"“Dogtrotted” is the past tense of “dogtrot,” meaning to move at an easy trot, or (less commonly) to build/design in the dogtrot-house style.","zh":"“dogtrotted”是“dogtrot”的过去式：指轻松小跑；较少见时也指建成/设计为“狗跑廊式”住宅。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense of “dogtrot”: to move at a steady, easy trot (a relaxed running pace), often describing a person or animal moving quickly but not sprinting.","zh":"“dogtrot”的过去式：以稳定、轻松的小跑速度前进（不算全速冲刺），常用来形容人或动物快速但从容地跑动。"},"examples":[{"en":"When the bus started to pull away, I dogtrotted to the stop and made it just in time.","zh":"公交车快要开走时，我小跑着赶到站牌，刚好赶上。"},{"en":"The kids dogtrotted across the yard to see what was in the box.","zh":"孩子们小跑着穿过院子去看盒子里是什么。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense of “dogtrot” (architecture, chiefly Southern U.S.): to build or design a house in a “dogtrot” style—two enclosed rooms separated by an open, breezy passageway.","zh":"“dogtrot”的过去式（建筑用法，多见于美国南部）：建成或设计为“dogtrot（狗跑廊）”式住宅——两间封闭房间中间留一条通风的开放走廊。"},"examples":[{"en":"In the 1800s, many frontier homes were dogtrotted to catch the summer breeze.","zh":"在19世纪，许多边疆住宅采用狗跑廊式布局，以便在夏天引入凉风。"}]}],"synonyms":["jogged","trotted","ran lightly"],"phonetic":"/ˈdɔɡˌtrɑtɪd/","extraExplanation":["“dogtrot”既可指一种步态（轻松小跑），也可指一种传统民居格局（dogtrot house）。后者常见于美国南部与阿巴拉契亚地区：中间的开放通道像“风道”一样降温，人和动物（包括狗）都可能从中穿行，因此得名。","在现代英语里，表示“步态”的dogtrot相对不算高频；写作中更常见的替代说法有 “jogged,” “trotted,” “ran at an easy pace”。建筑义则多出现在历史、民俗或建筑类语境。"]}
{"word":"dogtrotting","summary":{"en":"“Dogtrotting” usually means moving at an easy, steady trot—like a relaxed slow jog.","zh":"“dogtrotting”通常指像狗一样轻松稳定地小跑，也可指这种慢跑行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"moving at a relaxed, steady pace like a dog’s easy trot; jogging slowly and comfortably.","zh":"像狗的小跑一样以轻松、稳定的速度前进；慢跑（不急不快）。"},"examples":[{"en":"We went dogtrotting along the trail and talked the whole way.","zh":"我们沿着小径慢慢小跑，一路聊天。"},{"en":"He arrived dogtrotting, not out of breath at all.","zh":"他慢慢小跑着到了，一点也不喘。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of moving at a relaxed, steady trot; a slow, easy jog.","zh":"以轻松、稳定的小跑方式移动；慢而轻松的跑步。"},"examples":[{"en":"A little dogtrotting after dinner helps me sleep better.","zh":"晚饭后慢跑一会儿能让我睡得更好。"},{"en":"No sprinting—just dogtrotting for ten minutes.","zh":"不要冲刺——就慢慢小跑十分钟。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “dogtrot”: to move at a relaxed trot (often said of people, animals, or horses).","zh":"“dogtrot”的现在分词：以轻松的小跑节奏前进（常用于人、动物或马）。"},"examples":[{"en":"The horse came dogtrotting up to the fence.","zh":"那匹马小跑着来到栅栏边。"},{"en":"She was dogtrotting across the parking lot to catch up.","zh":"她小跑穿过停车场想追上去。"}]}],"synonyms":["jogging","trotting","ambling (slightly slower)","at an easy pace"],"phonetic":"/ˈdɔgˌtrɑtɪŋ/","extraExplanation":["“dogtrot / dog-trot”在美式英语里比较口语，形象地借用“狗小跑”的节奏，强调“不费力、能一直保持”的速度。","另外，“dogtrot”还是美国南部一种传统民居格局（dogtrot house）：两间房中间留出通风的开敞过道（像“穿堂风”），夏天更凉快。这个建筑义在日常对话中较少见，但在历史/乡土文化语境会出现。"]}
{"word":"Dogue","summary":{"en":"Dogue means a large mastiff-type dog, most often used in French breed names like Dogue de Bordeaux.","zh":"Dogue 指大型獒犬，多用于法语犬种名称中，如 Dogue de Bordeaux（波尔多獒犬）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, powerful mastiff-type dog, especially in French breed names (e.g., Dogue de Bordeaux).","zh":"（大型）獒犬；常见于法语犬种名称中（如波尔多獒犬 Dogue de Bordeaux）。"},"examples":[{"en":"The movie featured a Dogue de Bordeaux with a huge head and a calm temperament.","zh":"那部电影里出现了一只波尔多獒犬，头很大，性格很沉稳。"},{"en":"She adopted a rescue dog that looked like a dogue, with a broad chest and heavy build.","zh":"她领养了一只救援犬，看起来像獒犬，胸很宽、体型很壮。"}]}],"synonyms":["mastiff","Dogue de Bordeaux"],"phonetic":"/doʊɡ/","extraExplanation":["“Dogue”源自法语，字面意思接近“獒犬/大型犬”。在英语里它通常不会单独用来指“狗”，更常见的是出现在具体犬种名中，比如 Dogue de Bordeaux（波尔多獒犬）。在日常英语里，如果不是在谈犬种，人们更常说 mastiff（獒犬）或直接说 the breed name。"]}
{"word":"dogvane","summary":{"en":"A rare word meaning a dog-shaped weather (wind) vane.","zh":"一个较少见的词，指狗形风向标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wind vane (weather vane) designed in the shape of a dog, used to show wind direction on a building.","zh":"（通常做成狗形的）风向标，用来显示风向，常装在建筑物顶部。"},"examples":[{"en":"A small dogvane sat on the barn roof, turning with every gust.","zh":"谷仓屋顶上有一个小狗形风向标，每阵风来都跟着转。"},{"en":"They restored the old dogvane as part of the historic house renovation.","zh":"他们把老旧的狗形风向标修复了，作为历史房屋翻新的一部分。"}]}],"synonyms":["weather vane","wind vane","weathervane"],"phonetic":"/ˈdɔɡˌveɪn/","extraExplanation":["“dogvane”非常少见，更常见的写法是“dog vane”（两个词）或直接说“weather vane / wind vane”。\n也有人把它误写成“dogbane”（狗毒草，一种植物），两者意思完全不同。"]}
{"word":"dogvanes","summary":{"en":"“Dogvanes” is most likely a misspelling of **dogbanes**, meaning poisonous dogbane plants (*Apocynum*).","zh":"“dogvanes”多半是 **dogbanes** 的拼写错误，指有毒的狗毒草属（*Apocynum*）植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled **dogbanes**) plural of **dogbane**: a group of plants (genus *Apocynum*) with milky sap, often poisonous, sometimes used for fiber.","zh":"（通常拼作 **dogbanes**）**dogbane** 的复数：指夹竹桃科狗毒草属（*Apocynum*）的一类植物，乳白色汁液，常有毒；有些种类也可取纤维使用。"},"examples":[{"en":"Dogbanes grow in sunny fields and along roadsides, but you shouldn’t touch or eat them.","zh":"狗毒草常长在向阳的田野或路边，但不要触碰或食用。"},{"en":"The hiker learned to identify dogbanes by their milky sap and opposite leaves.","zh":"那位徒步者通过乳白色汁液和对生叶来辨认狗毒草。"}]}],"synonyms":["dogbanes","dogbane","Apocynum","Indian hemp","poisonous milkweed"],"phonetic":"/ˈdɔːɡbeɪnz/","extraExplanation":["“dogvanes”在现代英语中非常少见，多数情况下是把 **dogbanes** 拼错了（b 和 v 形近，容易误打）。","词根 **bane** 表示“祸害、毒害”（如 *wolfsbane*），所以 **dogbane** 字面意思类似“对狗有害的植物”。","有些地区也会把 dogbane 和 *milkweed*（马利筋）混淆，因为两者都有乳白色汁液、外形相近。"]}
{"word":"dogwatch","summary":{"en":"A nautical term for a two-hour evening watch (duty period) on a ship, especially 4–6 p.m. or 6–8 p.m.","zh":"航海用语，指船上傍晚的两小时短更（值更），尤指4–6点或6–8点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(On a ship) a short watch (duty period), especially one of the two evening watches from 4–6 p.m. and 6–8 p.m., each lasting two hours.","zh":"（航海）短班（值更时段），尤指傍晚的两段短更：下午4–6点与6–8点，各两小时。"},"examples":[{"en":"He was assigned to the dogwatch, so he had to be on deck from 4 to 6 p.m.","zh":"他被分到短更，所以必须在下午4点到6点在甲板上值班。"},{"en":"During the dogwatch, the crew prepared the ship for the night.","zh":"在短更期间，船员为夜间航行做准备。"}]}],"synonyms":["watch","evening watch","duty watch"],"phonetic":"/ˈdɔɡˌwɑtʃ/","extraExplanation":["“dogwatch”最常见于英美海事英语。它不是“看狗”的意思，而是“短更”。传统航海把傍晚的4小时拆成两个2小时短更，主要是为了打破每天固定轮班（watch system）的重复，让轮班安排在每天逐渐轮换，避免同一批人长期值同一时段。","词源解释常见有两种民间说法：一是来自“dodge”（躲开、错开），强调“错开轮班”；另一种认为与“dog”表示“短/不完整”有关。现代词典多倾向把它视为航海行话，重点记住它指“短更/傍晚短更”。"]}
{"word":"dogwatches","summary":{"en":"Dogwatches are the two short evening watches on a ship (4–6 p.m. and 6–8 p.m.), or any short duty watch by extension.","zh":"dogwatches 指船上傍晚的两段“短更”（下午4–6点与6–8点），也可引申为任何较短的值班时段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nautical) The two short watches on a ship: 4–6 p.m. and 6–8 p.m., usually split into two hours each to rotate the night watch schedule.","zh":"（航海用语）“狗更”：船上的两段短值班时间，通常指下午4–6点与6–8点（各2小时），用于打乱轮班顺序、让夜班轮换更公平。"},"examples":[{"en":"The captain put me on dogwatches from 4 to 8 p.m.","zh":"船长安排我值狗更，从下午4点到8点。"},{"en":"Because of dogwatches, the same sailors don’t always get stuck with the midnight watch.","zh":"因为有狗更，同一批水手就不会总是被安排到午夜值班。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) Any unusually short watch or shift of duty, especially on a ship.","zh":"（引申）任何特别短的值班/轮班（尤指在船上）。"},"examples":[{"en":"He covered a dogwatch while his teammate ate dinner.","zh":"队友去吃晚饭时，他顶了一段短班。"},{"en":"They scheduled a dogwatch to bridge the gap between shifts.","zh":"他们安排了一个短班来衔接两段轮班。"}]}],"synonyms":["short watch","evening watch","split watch"],"phonetic":"/ˈdɔɡˌwɑtʃɪz/","extraExplanation":["“dogwatch(es)”主要用于海军、商船等航海语境。它把原本连续的4小时值更拆成两段2小时，从而让值更表每24小时“错开”，避免同一组人天天固定上同一段夜班。","词源有不同说法：常见解释是“dog”有“打乱/变换（to dog = to follow/keep shifting）”的含义，表示把值班时间“拆开变动”；也有人把它理解为口语化的船员行话。"]}
{"word":"dogwinkle","summary":{"en":"Dogwinkle is an uncommon word meaning the dog whelk, a small predatory sea snail.","zh":"Dogwinkle 是较少见的词，指 dog whelk（一种捕食性小型海螺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small predatory sea snail found on rocky coasts; a common name for the dog whelk (Nucella lapillus).","zh":"一种生活在岩石海岸、以捕食为主的小型海螺；常用来指“犬骨螺/狗海螺”（dog whelk，学名 Nucella lapillus）。"},"examples":[{"en":"We saw dogwinkles stuck to the rocks at low tide.","zh":"退潮时，我们看到岩石上附着着许多 dogwinkles（狗海螺）。"},{"en":"Dogwinkles can drill into other shellfish to feed.","zh":"狗海螺会在其他贝类壳上钻孔取食。"}]}],"synonyms":["dog whelk","dog winkle","Nucella lapillus"],"phonetic":"/ˈdɔɡˌwɪŋkəl/","extraExplanation":["“dogwinkle”在现代英语里并不常见，更常见的写法是分开的“dog winkle”，或使用更通用的名称“dog whelk”。","这种词多见于英国/爱尔兰等沿海地区的口语或地方用法；在北美语境里更可能用“dog whelk”或直接用学名。"]}
{"word":"dogwood","summary":{"en":"Dogwood is a flowering tree or shrub (Cornus) famous for its spring blooms and ornamental look.","zh":"Dogwood 指山茱萸属的观赏树或灌木，以春季开花、外形漂亮而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tree or shrub (genus Cornus) known for its showy flowers (often white or pink bracts) and sometimes red berries; common in North America and parts of Asia and Europe","zh":"山茱萸属（Cornus）的树或灌木；以显眼的“花”（常见白色或粉色苞片）以及有时会结红色浆果而闻名，常见于北美以及亚洲、欧洲部分地区"},"examples":[{"en":"The dogwood blooms in early spring with pale pink blossoms.","zh":"山茱萸在早春开花，开出淡粉色的花。"},{"en":"We planted a flowering dogwood near the porch for shade and color.","zh":"我们在门廊旁种了一棵开花的山茱萸，既能遮阴又能增添色彩。"},{"en":"In some neighborhoods, dogwood trees are a symbol of springtime.","zh":"在一些社区里，山茱萸树是春天到来的象征。"}]}],"synonyms":["Cornus","flowering dogwood"],"phonetic":"/ˈdɔɡˌwʊd/","extraExplanation":["“Dogwood”在日常英语里通常指“开花山茱萸”（flowering dogwood，学名 Cornus florida），在美国东部很常见。你看到的“花瓣”常常其实是苞片（bracts），真正的小花在中间一团。","词源常被解释为与早期用其坚硬木材做小工具（如木钉、织布梭等）有关；也有民间说法把它和“dagwood”（匕首木）联系起来，但并非完全确定。"]}
{"word":"dogwoods","summary":{"en":"Dogwoods are trees/shrubs known for showy spring flowers; “dogwoods” is the plural form.","zh":"dogwoods 指以春季繁花著称的山茱萸树/灌木；它是 dogwood 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of small tree or shrub (genus Cornus) often grown for its beautiful spring flowers; also, its wood","zh":"山茱萸属（Cornus）的树或灌木，常因春季开花漂亮而栽培；也可指其木材"},"examples":[{"en":"Dogwoods bloom in early spring, covering the branches with white or pink flowers.","zh":"山茱萸树在早春开花，枝头会开满白色或粉色的花。"},{"en":"We planted dogwoods along the walkway for color in March and April.","zh":"我们在小路旁种了山茱萸树，让三四月更有色彩。"},{"en":"The craftsman used dogwood wood to make small tools.","zh":"工匠用山茱萸木材制作小工具。"}]}],"synonyms":["cornus","flowering dogwood"],"phonetic":"/ˈdɔɡˌwʊdz/","extraExplanation":["“dogwoods”是“dogwood”的复数。日常语境里常指观赏树（如美国东部常见的flowering dogwood，开白/粉色“花瓣”状苞片）。在美国文化中，dogwood常与春天、庭院景观联系紧密。"]}
{"word":"dogy","summary":{"en":"“Dogy” is usually a misspelling of “doggy/doggie” (a cute word for a dog). It can also mean “sluggish/tired,” but that use is less common.","zh":"“dogy”通常是“doggy/doggie（狗狗/小狗）”的误拼；也可表示“没精神、懒散”，但较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common misspelling of “doggy/doggie,” meaning a dog (especially in a cute or childlike way).","zh":"“doggy/doggie”的常见拼写错误，意思是“小狗/狗狗”（多用于可爱或儿童式说法）。"},"examples":[{"en":"Look at the doggy—it’s so cute!","zh":"看那只狗狗——太可爱了！"},{"en":"My little brother calls every dog a “doggy.”","zh":"我弟弟把每只狗都叫“狗狗”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Dog-like; sometimes used to describe someone as sluggish or tired (less common, informal).","zh":"像狗一样的；有时也用来形容人懒散、没精神（较少见，非正式）。"},"examples":[{"en":"I felt dogy after staying up too late.","zh":"熬夜太晚后，我感觉整个人没精神。"}]}],"synonyms":["doggy","doggie","pup","puppy","sluggish"],"phonetic":"/ˈdɔɡi/","extraExplanation":["“dogy”在日常英语中最常见是把“doggy / doggie”拼错了；标准拼写通常用 doggy 或 doggie。","“doggy”也常见于固定说法：doggy bag（打包袋/把剩菜带走的袋子），以及 doggy style（性姿势用语；在一般学习或正式场合不建议使用）。"]}

