{"word":"DOJ","summary":{"en":"DOJ most commonly means the U.S. Department of Justice.","zh":"DOJ最常见的意思是“美国司法部”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) the Department of Justice, the federal government department responsible for enforcing federal law and overseeing agencies like the FBI and federal prosecutors.","zh":"（美国）司法部：负责执行联邦法律、管理联邦检察体系，并监管如FBI等执法机构的联邦政府部门。"},"examples":[{"en":"The DOJ announced new guidelines for investigating cybercrime.","zh":"美国司法部（DOJ）发布了调查网络犯罪的新指南。"},{"en":"The case is being reviewed by the DOJ.","zh":"该案件正在由美国司法部（DOJ）审查。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, a country’s justice ministry/department (used especially in news or official writing), often shortened as “DOJ.”","zh":"（更广义）某国的司法部/司法机构（多见于新闻或公文写作中），常缩写为“DOJ”。"},"examples":[{"en":"The DOJ said it would appeal the court’s decision.","zh":"司法部门（DOJ）表示将对法院裁决提出上诉。"},{"en":"According to the DOJ report, the new policy reduced fraud cases.","zh":"根据司法部门（DOJ）的报告，新政策减少了诈骗案件。"}]}],"synonyms":["Department of Justice","Justice Department","U.S. DOJ"],"phonetic":"/ˌdiː.oʊˈdʒeɪ/","extraExplanation":["“DOJ”在美国语境中几乎默认指“U.S. Department of Justice（美国司法部）”。在其他国家/地区的新闻里也可能被用作“司法部”的英文缩写，但需要看上下文（例如国家名称、机构全称）。","书写上通常大写“DOJ”。首次出现时，正式写作常先写全称再括号写缩写：“Department of Justice (DOJ)”。"]}
{"word":"dojang","summary":{"en":"A dojang is a Korean martial arts training hall, especially for taekwondo.","zh":"Dojang 指韩国武术（尤其跆拳道）的训练馆/道场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a training hall or school where Korean martial arts (especially taekwondo) are taught and practiced.","zh":"道场；（尤指跆拳道等）韩国武术的训练馆/武馆。"},"examples":[{"en":"My kids go to the dojang twice a week for taekwondo practice.","zh":"我的孩子们每周去道场两次练跆拳道。"},{"en":"Everyone bowed when they entered the dojang.","zh":"大家进入道场时都鞠躬致意。"},{"en":"The dojang has rules about respect and safety.","zh":"这个道场有关于尊重与安全的规定。"}]}],"synonyms":["martial arts school","training hall","taekwondo school","dojo (similar term)"],"phonetic":"ˈdoʊdʒɑŋ","extraExplanation":["“Dojang”来自韩语 도장（道場），在韩国语境里常指跆拳道等武术的训练空间；类似日语的“dojo（道场）”。在英语里多用于指跆拳道训练馆，常见于北美的武术学校名称与日常口语。"]}
{"word":"dojigger","summary":{"en":"A dojigger is an informal word for a small object or device when you don’t know (or don’t say) the exact name.","zh":"dojigger 是一个非正式说法，用来指代你不知道或不想说出具体名称的小物件/小装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A small object, tool, or part whose exact name you don’t know or don’t want to say; a “thingamajig/doohickey.”","zh":"（非正式）指你不知道确切名称或不想说出名称的小物件、工具或零件；相当于“那个东西/小玩意儿”。"},"examples":[{"en":"Hand me that dojigger on the table—the little metal clip.","zh":"把桌上那个 dojigger 递给我——就是那个小金属夹子。"},{"en":"This dojigger is supposed to tighten the cable, but I’m not sure how it works.","zh":"这个 dojigger 应该是用来把线缆拧紧的，但我不太确定怎么用。"}]}],"synonyms":["doohickey","thingamajig","whatsit","whatchamacallit"],"phonetic":"/doʊˈdʒɪɡɚ/","extraExplanation":["“dojigger”通常带一点幽默或随口的语气，用在日常口语里，表示“某个小零件/小装置/那个玩意儿”。在正式写作中一般会换成更具体的名词。","它的用法和语感很接近 doohickey、thingamajig、whatchamacallit：当你一时想不起名称，或觉得没必要说得很精确时就可以用。"]}
{"word":"dojiggy","summary":{"en":"“Dojiggy” is informal slang for an unnamed or forgotten object—like “thingamajig.”","zh":"“dojiggy”是非正式俚语，指叫不出名字或想不起来的东西，类似“thingamajig/whatchamacallit”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, slang) A thing whose name you don’t know, can’t remember, or don’t want to say; a gadget or object (like “thingamajig/whatchamacallit”).","zh":"（非正式/俚语）指一个你叫不出名字、想不起来或不想具体说的东西；某个小玩意儿/物件（类似 thingamajig/whatchamacallit）。"},"examples":[{"en":"Hand me that dojiggy on the table—the little metal clip.","zh":"把桌上那个 dojiggy 递给我——那个小金属夹子。"},{"en":"The instructions say to connect the cable to the dojiggy, but the picture is unclear.","zh":"说明书说把线接到那个 dojiggy 上，但图片不清楚。"},{"en":"I bought a new phone stand with a spring-loaded dojiggy that holds it in place.","zh":"我买了个新手机支架，上面有个弹簧式的 dojiggy 用来固定手机。"}]}],"synonyms":["thingamajig","whatchamacallit","doohickey","thingy","gizmo"],"phonetic":"/ˈduˌdʒɪɡi/","extraExplanation":["“dojiggy”更常见的拼写是“do-jiggy / doohickey / thingamajig / whatchamacallit”。它属于口语里的“代称词”（占位用的名字），语气通常随意、带点幽默。","在不同地区/不同家庭里用法会有差异：有的人也会把它用来指某种“小装置/小零件”，尤其是工具、家具或电子产品上的小部件。正式写作中一般避免使用。"]}
{"word":"dojo","summary":{"en":"A dojo is a place (or sometimes a group) for focused practice—most commonly a martial arts training hall.","zh":"dojo 指专注练习的场所或团体，最常见是武术/格斗技的训练道场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A training hall or school where people practice martial arts (such as judo, karate, or aikido).","zh":"（练武的）道场；武术/格斗技训练馆（如柔道、空手道、合气道等）。"},"examples":[{"en":"She goes to the dojo twice a week to practice karate.","zh":"她每周去道场两次练空手道。"},{"en":"Everyone bowed before stepping onto the mats in the dojo.","zh":"大家进入道场的垫子前都会先鞠躬。"}]},{"partOfSpeech":"n.","definition":{"en":"A group, class, or program where people practice skills through repeated exercises, especially in computer programming (e.g., a “coding dojo”).","zh":"（尤指编程）技能练习小组/课程/活动（如“编程道场”）。"},"examples":[{"en":"Our team runs a coding dojo on Fridays to improve testing skills.","zh":"我们团队周五会办编程道场来提升测试能力。"},{"en":"The dojo focuses on short exercises and quick feedback.","zh":"这个道场强调短练习和快速反馈。"}]}],"synonyms":["training hall","martial arts school","gym","practice group","coding dojo"],"phonetic":"/ˈdoʊdʒoʊ/","extraExplanation":["“dojo”来自日语「道場（どうじょう）」：字面意思是“修行之地/学习之所”，最初与佛教修行有关，后来广泛用于武术训练场所。","在英语里它常让人联想到日本武道文化（礼仪、鞠躬、垫子等）；近年也被借用到职场与技术圈，表示“刻意练习、反复训练”的学习形式（例如 coding dojo）。"]}
{"word":"dojos","summary":{"en":"“Dojos” means multiple dojos—places for martial-arts training, and sometimes practice groups/sessions in tech (like coding dojos).","zh":"“Dojos”是“dojo”的复数，指多个道场/武术训练馆；在科技语境中也可指技能练习小组或训练活动（如编程道场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “dojo”) training halls or schools where people practice martial arts such as karate, judo, or aikido.","zh":"（dojo 的复数）道场；用于练习空手道、柔道、合气道等武术的训练馆/武馆。"},"examples":[{"en":"There are several dojos in my neighborhood, so it’s easy to find a place to train.","zh":"我家附近有好几家道场，所以很容易找到训练的地方。"},{"en":"The kids visited different dojos to watch beginner classes.","zh":"孩子们参观了不同的道场，观看初级课程。"}]},{"partOfSpeech":"n.","definition":{"en":"(In tech) groups or sessions where people practice skills together, often through drills and pair work (e.g., a coding dojo).","zh":"（科技语境）技能练习小组/训练活动，常通过练习题与结对协作来提升能力（如“编程道场”）。"},"examples":[{"en":"Our team runs weekly coding dojos to improve problem-solving and teamwork.","zh":"我们团队每周都会办编程道场来提升解题能力和协作。"},{"en":"She learned testing basics in community dojos for new developers.","zh":"她在面向新开发者的社区“道场”活动中学会了测试基础。"}]}],"synonyms":["martial arts schools","training halls","gyms (context-dependent)","practice groups","workshops (tech context)"],"phonetic":"/ˈdoʊdʒoʊ/","extraExplanation":["“Dojo（道場）”源自日语，字面意思是“修行的场所”。在日本文化里，道场不仅是训练空间，也强调礼仪、纪律与心性修炼。","英语里常直接借用 dojo；复数可写作 dojos（更常见）或 dojos/dojo(s)；“dojos”是最常见的英文复数拼写。","在编程圈使用“dojo”是借用了“反复练习、在共同规则下精进”的意象，常见搭配有 coding dojo、testing dojo 等。"]}

