{"word":"doke","summary":{"en":"“Doke” is uncommon in standard English; it’s often a dialect spelling related to “dook” (to dip/duck into water) or a surname.","zh":"“doke”在标准英语中不常见；常见用法是方言拼写（接近“dook”，指浸水/潜入水中）或作为姓氏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/Nonstandard) A spelling used in some dialect writing for “dook,” meaning to dip/duck briefly into water or to take a quick swim.","zh":"（罕见/非标准拼写）在一些方言写法中作“dook”的拼写，意思是“把（身体或头）短暂浸入水中/一头扎进水里”，也可指“快速游泳、泡一下水”。"},"examples":[{"en":"In Scots writing, you might see “doke/dook” meaning “to dip into water.”","zh":"在苏格兰方言的写法里，你可能会看到“doke/dook”，意思是“浸入水中”。"},{"en":"He doke(d) his head under the water to cool off.","zh":"他把头浸到水里凉快一下。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun) A family name (surname).","zh":"（专有名词）姓氏。"},"examples":[{"en":"Dr. Doke published research on language and education.","zh":"Doke 博士发表了关于语言与教育的研究。"}]}],"synonyms":["dook (dialect)","dip","duck (down)"],"phonetic":"/doʊk/","extraExplanation":["“doke”在现代标准英语里并不常见。很多情况下，它可能是：\n1）把“dock”（码头/停靠/扣款）拼错；或\n2）把苏格兰方言动词“dook”（浸水、潜入）写成了“doke”。\n如果你告诉我你看到它的句子/语境，我可以帮你判断最可能是哪一种。"]}
{"word":"Doketic","summary":{"en":"Doketic (more commonly spelled docetic) means ‘related to Docetism’—the idea that Christ’s physical body and suffering were only an appearance; more rarely it can mean ‘illusory.’","zh":"Doketic（更常见拼写为docetic）主要指“与幻现说/道西特主义有关”，即认为基督的肉身与受难只是表象；较少情况下可泛指“虚幻的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Theology) Related to Docetism—the belief that Jesus’s physical body and suffering were only an appearance, not truly real.","zh":"（神学）与“幻现说/道西特主义”有关——一种认为耶稣的肉身与受难只是“看起来如此”，并非真实发生的观点。"},"examples":[{"en":"Some early Christian writers argued against docetic interpretations of Jesus’s suffering.","zh":"一些早期基督教作家反对把耶稣受难解释为“幻现说”的观点。"},{"en":"The scholar described the text as having a docetic tendency because it downplays the physical body.","zh":"这位学者说该文本带有“幻现说”倾向，因为它淡化了肉身的重要性。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally: seeming real but not truly real; illusory (rare in everyday English).","zh":"更一般地：看似真实但并不真实；虚幻的（在日常英语中较少见）。"},"examples":[{"en":"In the novel, the hero chases a docetic dream that disappears at dawn.","zh":"在小说里，主人公追逐一个黎明即逝的虚幻之梦。"}]}],"synonyms":["docetic","illusory","apparent","seeming"],"phonetic":"/doʊˈsɛtɪk/","extraExplanation":["“doketic”常被视为“docetic”的另一种拼写（更常见的是docetic）。词源来自希腊语 dokein（意为“似乎、显得”）。","在宗教史语境中，它通常出现在讨论早期基督教争论（例如耶稣的神性与人性）时；不属于高频日常词汇。"]}
{"word":"doketic","summary":{"en":"Doketic (more commonly spelled docetic) means “related to Docetism,” the belief that Jesus only seemed to be physically human.","zh":"doketic（更常见拼写为 docetic）指“与幻影说有关的”，即认为耶稣的肉身与受苦只是表象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Docetism, an early Christian belief that Jesus only seemed to have a real human body and physical suffering (his humanity was an appearance, not fully real).","zh":"与“幻影说/幻影派（Docetism）”有关的：一种早期基督教观点，认为耶稣只是“看起来”有真实的人类身体与痛苦经历，他的“人性”更像表象而非完全真实。"},"examples":[{"en":"Some historians discuss whether certain texts show a doketic view of Jesus’ suffering.","zh":"一些历史学者会讨论某些文本是否呈现出对耶稣受难的“幻影说”（doketic）观点。"},{"en":"The letter argues against doketic ideas by stressing that Jesus ate, slept, and bled.","zh":"这封书信通过强调耶稣会吃饭、睡觉、流血来反驳“幻影说”（doketic）的思想。"}]}],"synonyms":["docetic"],"phonetic":"/doʊˈsɛtɪk/","extraExplanation":["更常见的拼写是 **docetic**（源自希腊语 *dokein*，意为“看起来/似乎”）。你输入的 **doketic** 在英语里较少见，通常被视为同义的变体或拼写差异。","该词多用于神学、宗教史与古代文献研究语境，日常英语几乎不会用到。"]}
{"word":"Doketism","summary":{"en":"Docetism is the belief that Jesus only appeared to have a real human body and suffer, a view rejected as heresy in most Christian traditions.","zh":"Docetism（幻影说）指认为耶稣只是“看似”具有人身并受难的观点，多数基督教传统将其视为异端。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Religion, Christianity) The belief that Jesus only seemed to have a physical body and to suffer and die, rather than truly being human; an early view rejected as heresy in most Christian traditions.","zh":"（宗教/基督教）幻影说：认为耶稣只是“看起来”有真实肉身、受苦并死亡，而非真正具有人性；在多数基督教传统中被视为早期异端观点。"},"examples":[{"en":"Some early Christian writers argued against Docetism because it denied that Jesus truly suffered.","zh":"一些早期基督教作家反对幻影说，因为它否认耶稣真正受苦。"},{"en":"In a history of theology class, we learned that Docetism was linked to debates about Christ’s nature.","zh":"在神学史课上，我们了解到幻影说与关于基督本性的争论有关。"}]}],"synonyms":["phantom theory (context-dependent)","Docetic view"],"phonetic":"/doʊˈsiːtɪzəm/","extraExplanation":["你写的“Doketism”更常见的拼写是 **Docetism**。该词来自希腊语词根 *dokein*（意为“似乎、看起来”），因此核心含义是“基督只是表象上有肉身”。","在早期基督教思想中，幻影说常与某些诺斯替（Gnostic）倾向的思想有关；主流教会强调“道成肉身”的真实人性与受难，因此把这类观点归为异端并加以批判。","阅读学术文章时，你也可能见到相关词 **Docetic**（形容词，“幻影说的/带有幻影说色彩的”）。"]}
{"word":"doketism","summary":{"en":"Docetism: the belief that Jesus only appeared to be physically human.","zh":"幻影说：认为耶稣只是看似有肉身、并非真正为人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Christian theology) The belief that Jesus only seemed to have a physical human body and did not truly suffer or die as a human.","zh":"（基督教神学）幻影说：认为耶稣只是“看起来”有真实的人类肉身，并非真正以人的方式受苦或死亡。"},"examples":[{"en":"Some early Christian writers argued strongly against Docetism.","zh":"一些早期基督教作家强烈反对幻影说。"},{"en":"In theology class, we discussed how Docetism affects beliefs about suffering and the incarnation.","zh":"在神学课上，我们讨论了幻影说如何影响人们对受苦与“道成肉身”的理解。"}]}],"synonyms":["illusionism","appearance-only view","phantom-Christ view"],"phonetic":"/ˈdɑːsəˌtɪzəm/","extraExplanation":["“doketism”通常是“Docetism”的拼写误差；词源来自希腊语 dokein（“似乎、看起来像”）。","幻影说常与早期基督教的某些思想潮流相关，后来在主流教义发展中被视为异端，因为它削弱了“耶稣真正成为人并真实受难”的核心观念。"]}
{"word":"dokhma","summary":{"en":"A dokhma is a Zoroastrian “Tower of Silence,” a structure traditionally used for funerary exposure of the dead.","zh":"dokhma 指琐罗亚斯德教的“静默之塔/尸塔”，传统上用于曝尸葬的建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Zoroastrianism) a circular stone structure, often called a “Tower of Silence,” where the dead were traditionally placed for exposure to birds and the elements.","zh":"（琐罗亚斯德教/祆教）“静默之塔”（又作“尸塔”）：一种圆形石质建筑，传统上用于将遗体安放在其上，让鸟类与自然因素处理遗体。"},"examples":[{"en":"The travelers learned that a dokhma was used in traditional Zoroastrian funerary practice.","zh":"旅行者了解到，dokhma 用于传统的琐罗亚斯德教葬礼习俗。"},{"en":"In some histories of Persia, the dokhma is described as a “Tower of Silence.”","zh":"在一些波斯历史著作中，dokhma 被描述为“静默之塔”。"}]}],"synonyms":["dakhma","Tower of Silence"],"phonetic":"/ˈdɑkmə/","extraExplanation":["该词也常见拼写为 dakhma（更常用）。“Tower of Silence（静默之塔）”是英语里更普遍的解释性称呼。","在传统观念中，遗体被视为可能污染土、火、水等“神圣元素”，因此采用“曝尸”的方式；但在许多地区这类做法后来受到法律、城市化与公共卫生等因素影响而减少或停止。","词源多追溯到伊朗语系（与中古波斯/阿维斯陀语相关）的“墓/安置处”含义；在英文语境中一般用于宗教与历史介绍。"]}
{"word":"dokimastic","summary":{"en":"Dokimastic means “related to testing or assaying (especially metals),” and by extension “serving as a decisive test.”","zh":"Dokimastic 指“与检验/试金（尤指金属）有关的”，也可引申为“具有决定性考验作用的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to testing, proving, or assaying something (especially metals) to judge its quality or genuineness","zh":"与测试、检验或鉴定有关的（尤指对金属进行化验/试金，以判断其质量或真伪）"},"examples":[{"en":"The lab used dokimastic methods to check whether the gold was pure.","zh":"实验室用试金式的检验方法来确认黄金是否纯净。"},{"en":"In ancient mining towns, dokimastic tests helped buyers avoid counterfeit silver.","zh":"在古代采矿城镇，试银的检验能帮助买家避开假银。"}]},{"partOfSpeech":"adj.","definition":{"en":"(more general) serving as a decisive test; strongly revealing of character or quality","zh":"（更一般）具有决定性检验作用的；能强烈揭示品质或品格的"},"examples":[{"en":"A crisis can be a dokimastic moment for a leader.","zh":"危机可能是对领导者的一次决定性考验。"},{"en":"The long journey was dokimastic: it showed who could stay calm under pressure.","zh":"这段漫长旅程是一种考验：它让人看出谁能在压力下保持冷静。"}]}],"synonyms":["probative","testing","assaying","trial","revealing"],"phonetic":"/ˌdoʊkəˈmæstɪk/","extraExplanation":["词源来自希腊语 *dokimastikos*（与“检验、试验”有关），在英语里较少见，多出现在学术写作、历史/冶金（如“试金”“化验”）或较文学化的“考验、试炼”语境中。","常见搭配包括：*dokimastic test*（鉴定/试验）、*dokimastic analysis*（检验分析）。"]}
{"word":"Dokmarok","summary":{"en":"“Dokmarok” is not a common English word; it’s likely a proper name (username/brand/character) or a borrowed/romanized term.","zh":"“Dokmarok”不是常见英语词；更可能是专名（网名/品牌/角色名）或外来语的罗马字拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name/term that is not a standard English vocabulary word. It is most likely a username, brand name, character name, or a romanized word from another language.","zh":"一个专有名词/术语，并非标准英语词汇。更可能是用户名、品牌名、角色名，或来自其他语言的音译/拼写。"},"examples":[{"en":"‘Dokmarok’ isn’t in most English dictionaries; it may be a screen name.","zh":"“Dokmarok”在多数英语词典里查不到；它可能是一个网名。"},{"en":"I saw Dokmarok credited as the artist on the cover.","zh":"我看到封面上署名的作者/艺术家是 Dokmarok。"}]}],"phonetic":"/ˈdɑk.mə.rɑk/","extraExplanation":["“Dokmarok”看起来像是自造词或专名，因此通常没有固定的英文释义、词性变化或常见搭配。若你能提供它出现的语境（例如一句话、游戏/小说/影片名称、语言来源），我可以帮你判断：是人名/地名/作品名、还是某种语言的音译，并给出更贴切的解释与用法建议。","如果你希望给它一个英文读法：可按音节读作 Dok-ma-rok；但不同作者/社群可能会有不同读音。"]}
{"word":"dokmarok","summary":{"en":"“dokmarok” is not a recognized English word; it’s likely a name or coined term, and its meaning depends on context.","zh":"“dokmarok” 不是常见英语词；更可能是名字或自造词，具体含义需要结合上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a proper name, a username, a brand name, or a made-up/fictional term.","zh":"不是标准英语词汇；更可能是专有名词（人名/地名）、用户名、品牌名，或虚构/自造词。"},"examples":[{"en":"“dokmarok” doesn’t appear in major English dictionaries; it may be a username or a game name.","zh":"“dokmarok” 在主要英语词典中查不到；它可能是用户名或游戏名。"},{"en":"If “dokmarok” is a brand or character, the meaning depends on the story or community that uses it.","zh":"如果 “dokmarok” 是品牌或角色名，它的含义取决于使用它的故事或社群。"}]}],"phonetic":"/ˈdɑk.məˌrɑk/","extraExplanation":["“dokmarok” 看起来像是自造词或专名，因此没有固定、通用的英文释义。","如果你是在某个具体场景看到它（例如游戏、小说、歌曲、聊天群、网站、商品名），把原句或截图发我，我可以根据上下文推断它可能指什么。","也可能是拼写误差：你可以确认是否想查的是类似的单词（例如 dock / Denmark / trademark 等）。"]}
{"word":"Doko","summary":{"en":"“Doko” is most commonly a romanization of Japanese どこ, meaning “where?”. In English it’s usually a name or borrowed term, so the meaning depends on context.","zh":"“Doko” 最常见是日语「どこ」的罗马字写法，意思是“哪里/在哪儿？”。在英语里多作为名字或借用词，具体含义要看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Japanese) “Where?” Used to ask about location.","zh":"（源自日语）“哪里／在哪儿？”用于询问地点。"},"examples":[{"en":"Doko desu ka? — Where is it?","zh":"Doko desu ka? —— 它在哪里？"},{"en":"Toire wa doko? — Where’s the bathroom?","zh":"Toire wa doko? —— 洗手间在哪儿？"}]},{"partOfSpeech":"n.","definition":{"en":"A name (surname, given name, or place/brand name) depending on context; not a standard English vocabulary word.","zh":"可作为人名（姓/名）或地名/品牌名使用；并非标准英语词汇，含义取决于具体语境。"},"examples":[{"en":"Doko is my family name.","zh":"Doko 是我的姓。"},{"en":"I saw “Doko” on the sign, but I’m not sure what it refers to.","zh":"我在牌子上看到了 “Doko”，但不确定它指什么。"}]}],"synonyms":["where (Japanese: doko)"],"phonetic":"/ˈdoʊkoʊ/","extraExplanation":["在日语里常写作「どこ」(doko)，语气较口语；更礼貌的问法会加上「ですか」：どこですか？=“在哪里？”","如果你是在英文语境（聊天、游戏ID、品牌、地名）里看到 Doko，它多半是专有名词；想确认含义，需要你提供一句原文或上下文。"]}
{"word":"doko","summary":{"en":"Doko is a Japanese word meaning “where?” and is sometimes used in English online or fandom contexts.","zh":"Doko 源自日语，意思是“哪里？”，有时会在英语网络或粉丝圈语境中被借用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Japanese) “Where?”—used to ask about a place or location.","zh":"（源自日语）“哪里？”——用来询问地点或位置。"},"examples":[{"en":"Doko? I can’t find the station.","zh":"Doko？我找不到车站。"},{"en":"Doko desu ka? (Where is it?)","zh":"Doko desu ka?（在哪里？）"}]},{"partOfSpeech":"other","definition":{"en":"(Internet/anime fandom) A casual way English speakers sometimes write or say the Japanese word for “where,” often for a Japanese vibe or as a quote.","zh":"（网络/动漫圈）英语使用者有时用来书写或口头模仿日语“哪里”，常带“日系/引用台词”的感觉。"},"examples":[{"en":"He posted “doko??” under the photo as a joke.","zh":"他在照片下面开玩笑留言“doko??”。"},{"en":"Fans kept commenting “doko” when the map wasn’t shown.","zh":"地图没显示时，粉丝一直刷“doko”。"}]}],"synonyms":["where","where (is it)?","where to?"],"phonetic":"/ˈdoʊkoʊ/","extraExplanation":["「どこ（doko）」在日语里常见搭配有：\n- どこですか？= 在哪里？（较礼貌）\n- どこに行くの？= 你要去哪里？（口语）\n- どこへ行きますか？= 您要去哪里？（较礼貌）\n注意「doko」本身不是标准英语单词，在英语语境里多见于玩梗、引用日语台词或与日本文化相关的对话。"]}

