{"word":"doo-dad","summary":{"en":"A doo-dad is an informal word for a small object or gadget, or a small decorative add-on.","zh":"doo-dad 是非正式用语，指小物件/小工具，或可有可无的小装饰、小配件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small object, gadget, or thing whose name you don’t know or don’t want to say (informal)","zh":"（非正式）小东西；小玩意儿（叫不出名字或不想说具体名称时的说法）"},"examples":[{"en":"Can you hand me that doo-dad on the table?","zh":"你能把桌上那个小玩意儿递给我吗？"},{"en":"This kitchen doo-dad opens jars really easily.","zh":"这个厨房小工具开罐子特别轻松。"}]},{"partOfSpeech":"n.","definition":{"en":"a small decorative item or add-on, often not essential","zh":"（常带“可有可无”意味的）小装饰；小配件"},"examples":[{"en":"The room is nice, but it has too many doo-dads on the shelves.","zh":"房间挺好，就是架子上的小摆件太多了。"},{"en":"I prefer a clean design without extra doo-dads.","zh":"我更喜欢简洁的设计，不要太多花里胡哨的配件。"}]}],"synonyms":["doodad","thingamajig","thingamabob","whatchamacallit","gizmo"],"phonetic":"/ˈduːdæd/","extraExplanation":["“doo-dad”也常拼作“doodad”。这是很口语、很随意的说法，用来代替具体名词（类似中文的“那个东西/小玩意儿”）。在写作或正式场合通常避免使用。","词源不太确定，可能来自儿童语或拟声式的随口造词，因此给人一种轻松、不严肃的感觉。"]}
{"word":"doo-doo","summary":{"en":"“Doo-doo” is a childish/informal word for poop, and it can also refer to “doo-doo-doo” syllables in songs.","zh":"“doo-doo”是表示“大便/便便”的儿语或口语，也可指歌曲里“doo-doo-doo”的无意义衬词/和声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A childish or informal word for feces (poop).","zh":"（儿语/口语）大便、便便。"},"examples":[{"en":"The toddler said he needed to doo-doo.","zh":"小宝宝说他要拉便便。"},{"en":"Don’t touch that—it’s doo-doo.","zh":"别碰那个——那是便便。"}]},{"partOfSpeech":"v.","definition":{"en":"(Childish/informal) to poop; to have a bowel movement.","zh":"（儿语/口语）拉屎、排便。"},"examples":[{"en":"The puppy doo-dooed on the carpet.","zh":"小狗在地毯上拉了便便。"},{"en":"He ran to the bathroom because he had to doo-doo.","zh":"他冲去洗手间，因为他想拉便便。"}]},{"partOfSpeech":"n.","definition":{"en":"A common nickname for the 1960s–70s “doo-wop” vocal style or its syllables (doo-doo-doo), especially in pop music.","zh":"（音乐）模仿或指代流行歌曲里“doo-doo-doo”这类无意义衬词/和声（有时与 doo-wop 相关）。"},"examples":[{"en":"The chorus has lots of doo-doo-doo vocals.","zh":"副歌里有很多“doo-doo-doo”的衬词。"},{"en":"That old song has a doo-doo harmony in the background.","zh":"那首老歌背景里有“doo-doo”的和声。"}]}],"synonyms":["poop","pee-pee (for urine, different meaning)","number two (euphemism)","doo-wop (music-related)"],"phonetic":"/ˈduːduː/","extraExplanation":["“doo-doo”多用于对小孩说话的语境，语气比“poop / pee”更幼稚、可爱一些；在正式场合通常用“feces / stool / bowel movement”。","在音乐里出现的“doo-doo-doo”常是拟声/衬词，不一定有具体含义，更多是节奏和旋律需要。"]}
{"word":"doob","summary":{"en":"“Doob” is slang for a marijuana cigarette (a joint), and sometimes for the tube/container used to carry one.","zh":"“doob”是俚语，指大麻卷烟（joint），有时也指装大麻卷烟的筒/容器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A marijuana cigarette; a joint.","zh":"（俚语）大麻烟；大麻卷烟（joint）。"},"examples":[{"en":"He stepped outside to smoke a doob.","zh":"他走到外面去抽了一支大麻烟。"},{"en":"The movie shows teens passing around a doob at a party.","zh":"电影里有青少年在派对上把大麻烟递来递去。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, by extension) A container for carrying a joint, often called a “doob tube.”","zh":"（俚语，引申）用来装大麻卷烟的筒状小容器（常说 doob tube）。"},"examples":[{"en":"Keep it in a doob tube so it doesn’t get crushed.","zh":"把它放在大麻烟筒里，免得被压坏。"}]}],"synonyms":["joint","spliff","weed cigarette","doob tube"],"phonetic":"/dub/","extraExplanation":["“doob”主要出现在口语和流行文化里，语气随意，有时带点调侃。正式写作通常用“marijuana cigarette”或更常见的俚语“joint”。","与大麻相关的法律在不同国家/地区差异很大；在阅读或使用该词时要注意语境与当地法规。"]}
{"word":"doobie","summary":{"en":"“Doobie” is slang for a marijuana cigarette (a joint).","zh":"“doobie”是指“大麻烟/大麻卷烟（joint）”的俚语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A marijuana cigarette; a joint.","zh":"（俚语）大麻烟；大麻卷烟（joint）。"},"examples":[{"en":"He stepped outside to smoke a doobie.","zh":"他走到外面去抽了一根大麻烟。"},{"en":"The movie shows a group of friends passing around a doobie.","zh":"电影里一群朋友在传着抽一根大麻烟。"}]}],"synonyms":["joint","spliff (often mixed with tobacco)","reefer (old-fashioned slang)"],"phonetic":"/ˈduːbi/","extraExplanation":["“doobie”是比较口语、带点嬉皮/复古色彩的俚语（常见于20世纪60—70年代的美式英语），意思通常等同于“joint”。在很多地区，大麻的持有与使用可能违法或受到严格限制；在现实交流中使用该词要注意场合与法律环境。"]}
{"word":"doocot","summary":{"en":"A Scottish/Northern English word meaning a dovecote—a small building for keeping pigeons.","zh":"苏格兰/英格兰北部用语，指“dovecote（鸽舍）”，即用来养鸽的小屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small building or box where pigeons (doves) are kept; a dovecote (common in Scotland and Northern England).","zh":"（尤指苏格兰、英格兰北部用语）鸽舍；养鸽的小屋（同 dovecote）。"},"examples":[{"en":"There was an old stone doocot on the edge of the farm.","zh":"农场边上有一座老石砌的鸽舍。"},{"en":"The castle grounds still include a doocot for raising pigeons.","zh":"城堡的园地里至今还保留着一座用来养鸽子的鸽舍。"}]}],"synonyms":["dovecote","pigeon house","pigeon loft"],"phonetic":"/ˈduːkɑːt/","extraExplanation":["“doocot”主要是苏格兰英语/方言词：doo = pigeon（鸽子），cot = 小屋/棚。常见于乡村庄园或城堡附近，历史上养鸽可用于取肉、取蛋或传信。现代英语更常用“dovecote”。"]}
{"word":"doodab","summary":{"en":"“Doodab” is an informal word for a thing (often a small object or gadget) when you don’t know or don’t want to say its exact name.","zh":"“doodab”是非正式用语，指你叫不出名字或不想具体说的某个东西（常是小物件或小装置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A small object or gadget whose real name you don’t know or don’t want to say; a “thingy.”","zh":"（非正式）指叫不出名字或不想具体说的某个小东西/小装置；“那个东西/小玩意儿”。"},"examples":[{"en":"Pass me that little doodab on the table—the one next to the keys.","zh":"把桌上那个小 doodab 递给我——在钥匙旁边那个。"},{"en":"I need a doodab to tighten this screw, but I can’t remember what it’s called.","zh":"我需要一个 doodab 来拧紧这个螺丝，但我想不起它叫什么了。"}]}],"synonyms":["thingy","doohickey","doodad","whatsit","thingamajig"],"phonetic":"/ˈduːdæb/","extraExplanation":["“doodab”比较口语、随意，常用来临时代替物品名称，语气类似 thingy / doohickey / whatsit。不同地区更常见的拼法可能是 doodad 或 doohickey；“doodab”也可被理解为这些词的变体。","使用时注意场合：在正式写作或正式会议中不太合适；日常对话、朋友之间更自然。"]}
{"word":"doodad","summary":{"en":"Doodad means a small thing—often a gadget or decoration—especially when you don’t know or don’t need its exact name.","zh":"Doodad 指“小东西/小玩意儿”，常用于叫不出名字或觉得不重要的器具或装饰品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small object or gadget, especially one whose exact name you don’t know or that is not very important","zh":"（常指叫不出名字或不重要的）小物件；小玩意儿；小器具"},"examples":[{"en":"Hand me that little doodad on the table—I need it to tighten this screw.","zh":"把桌上那个小玩意儿递给我——我需要用它把这颗螺丝拧紧。"},{"en":"My desk is covered with doodads like keychains and sticky notes.","zh":"我的桌子上堆满了钥匙扣、便利贴之类的小东西。"}]},{"partOfSpeech":"n.","definition":{"en":"a decorative trinket or small accessory, often chosen more for looks than usefulness","zh":"（多指装饰性的）小饰品；小摆件"},"examples":[{"en":"She loves collecting cute doodads for her bookshelf.","zh":"她喜欢收集可爱的小摆件放在书架上。"},{"en":"The shop sells handmade doodads and crafts.","zh":"那家店卖手工小饰品和工艺品。"}]}],"synonyms":["thingamajig","whatchamacallit","gadget","trinket"],"phonetic":"/ˈduːdæd/","extraExplanation":["“doodad”是非常口语化的词，常用来临时指代“那个东西/那个小玩意儿”（类似thingamajig、whatchamacallit）。在正式写作中不太常用，但在日常对话里很自然。","语气通常比较随意，有时带一点幽默感：说话者可能懒得说具体名称，或觉得名称不重要。"]}
{"word":"doodads","summary":{"en":"“Doodads” are small gadgets or miscellaneous little things (often unnamed), sometimes small decorations.","zh":"“doodads”指各种小玩意儿/小东西（常叫不出名字），有时也指小装饰品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small objects or gadgets, especially ones whose exact name you don’t know or that are not very important; also used for small decorative items.","zh":"（口语）小东西/小玩意儿，尤指叫不出名字或不太重要的物件；也可指小装饰品。"},"examples":[{"en":"I’ve got a drawer full of doodads—old chargers, keys, and random cables.","zh":"我有一个抽屉装满了各种小玩意儿——旧充电器、钥匙和各种线。"},{"en":"The shop sells cute doodads for your desk, like tiny lamps and figurines.","zh":"那家店卖很多可爱的桌面小摆件，比如迷你台灯和小人偶。"},{"en":"Hand me that doodad next to the screwdriver.","zh":"把螺丝刀旁边那个小东西递给我。"}]}],"synonyms":["thingamajig","whatchamacallit","gadget","knickknacks","trinkets"],"phonetic":"/ˈduːdæd/","extraExplanation":["“doodad(s)”非常口语、偏随意，语气接近“thing/thingamajig/whatchamacallit（那啥）”。在日常对话里常用复数“doodads”，表示“一堆杂七杂八的小物件”。","它有时带一点“可爱/不太重要/小装饰”的感觉；在更正式的场合可改用“device / accessory / component / ornament”等更具体的词。"]}
{"word":"doodah","summary":{"en":"“Doodah” is informal slang for a small object you can’t name (or a little extra decoration); it can also be a playful “doo-dah” sound in songs.","zh":"“doodah”是口语：指叫不出名字的小物件/小装置，或一些小点缀；也可指歌曲里无实义的“doo-dah”唱词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small object whose real name you don’t know or can’t remember; a gadget or “thingamajig.”","zh":"（口语）指叫不出名字或一时想不起来名称的小物件；小玩意儿；“那个东西”。"},"examples":[{"en":"Can you pass me that little doodah on the table?","zh":"你能把桌上那个小玩意儿递给我吗？"},{"en":"I bought a doodah to hold my phone on my bike.","zh":"我买了个小装置，用来把手机固定在自行车上。"}]},{"partOfSpeech":"n.","definition":{"en":"A small extra detail added to make something better; a finishing touch.","zh":"（口语）点缀的小细节；让东西更好的“点睛之笔”。"},"examples":[{"en":"The designer added a few doodahs to make the plain dress look more interesting.","zh":"设计师加了一些小点缀，让这条素裙子更有意思。"},{"en":"We don’t need more doodahs—let’s keep it simple.","zh":"不用再加那些小装饰了——简洁点就好。"}]},{"partOfSpeech":"other","definition":{"en":"A playful nonsense word used in songs/chanting, especially “doo-dah” in older American folk-style songs.","zh":"（拟声/玩笑用语）歌曲或口号里的无实义词，尤其指老式美国民谣中常见的“doo-dah”。"},"examples":[{"en":"The chorus repeats “doo-dah, doo-dah” to keep the rhythm going.","zh":"副歌反复唱“doo-dah, doo-dah”来保持节奏。"}]}],"synonyms":["doohickey","thingamajig","whatchamacallit","gizmo","thingamabob"],"phonetic":"/ˈduːˌdɑː/","extraExplanation":["“doodah / doo-dah”常作为“临时替代词”（placeholder word），和 doohickey、thingamajig、whatchamacallit 很像：说话人懒得说具体名称，或确实想不起来时就用它。","在美国文化里，“doo-dah”最有名的出处之一是19世纪歌曲《Camptown Races》（歌词里有“Doo-dah! Doo-dah!”），因此它也带一点轻松、滑稽的语气。"]}
{"word":"Doodia","summary":{"en":"“Doodia” isn’t a recognized standard English word; it’s likely a name or made-up term whose meaning depends on context.","zh":"“Doodia” 不是常见的标准英语词，更可能是名字或自造词，含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a person’s name, username, brand, or place name), so its meaning depends on the context where you saw it.","zh":"不是标准英语词汇。它更可能是专有名词（如人名、网名、品牌名或地名），具体含义需要结合你看到它的语境来判断。"},"examples":[{"en":"I couldn’t find an English dictionary meaning for “Doodia”; it may be a username.","zh":"我在英语词典里找不到 “Doodia” 的释义；它可能是一个用户名。"},{"en":"If “Doodia” is a brand name, please share the product or website so I can explain it.","zh":"如果 “Doodia” 是品牌名，请提供产品或网站，我就能更准确地解释。"}]}],"phonetic":"/ˈduːdiə/","extraExplanation":["在英语里，类似拼写但更常见的词有：\n1) doodad /ˈduːdæd/（小玩意儿、装饰小物件，口语）\n2) doodah（口语，指某个东西/某件事；也常出现在歌曲 “Camptown Races” 里：doo-dah, doo-dah）\n3) doodle（随手涂鸦；也可指“信手画”）\n如果你告诉我 “Doodia” 出现在哪句话/哪张图/哪款应用里，我可以帮你判断它到底指什么。"]}
{"word":"doodia","summary":{"en":"“doodia” isn’t a recognized English word; it’s likely a misspelling or a name.","zh":"“doodia”不是常见英语词；更可能是拼写错误或专有名词（名字/品牌等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “doodia” is most likely a misspelling, a made-up word, a username, or a proper name, so it doesn’t have a widely accepted dictionary meaning.","zh":"不是标准英语单词。“doodia”更可能是拼写错误、造词、用户名或专有名词，因此没有公认的词典释义。"},"examples":[{"en":"I can’t find a dictionary meaning for “doodia”—can you share the sentence you saw it in?","zh":"我查不到“doodia”的词典释义——你能把它出现的句子发我吗？"},{"en":"If “doodia” is a name or brand, its meaning depends on the person or company using it.","zh":"如果“doodia”是名字或品牌，它的含义取决于使用它的个人或公司。"}]}],"phonetic":"ˈduːdiə","extraExplanation":["它可能是以下词的拼写或听写误差（常见于口语/歌曲/短视频字幕）：\n- doodle（涂鸦、随手画）\n- doody / doo-doo（儿童用语：便便；也可作人名/昵称）\n- dodo（笨笨的/渡渡鸟，较口语）\n- doodad（小玩意儿/小装置）\n\n如果你把它出现的上下文（前后一句）或你想表达的中文意思发来，我可以帮你判断最可能是哪一个，并给出准确用法与例句。"]}
{"word":"doodle","summary":{"en":"“Doodle” means to draw simple, casual pictures when you’re not fully focused, or the drawing itself.","zh":"“doodle”指走神时随手涂鸦，也可指涂鸦作品本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to draw simple, informal pictures or patterns when you are bored or thinking about something else","zh":"（走神或无聊时）随手乱画、涂鸦"},"examples":[{"en":"I doodled in the margins of my notebook during the meeting.","zh":"开会时我在笔记本边上随手涂鸦。"},{"en":"She doodles flowers while she listens to music.","zh":"她听音乐时会随手画些花。"}]},{"partOfSpeech":"n.","definition":{"en":"a simple, informal drawing made absentmindedly (often in the margins of paper)","zh":"随手画的涂鸦（常画在纸张边缘）"},"examples":[{"en":"His notebook was full of doodles and little cartoons.","zh":"他的笔记本里全是涂鸦和小漫画。"},{"en":"The teacher found a doodle on the desk.","zh":"老师在课桌上发现了一幅涂鸦。"}]}],"synonyms":["scribble","sketch","scrawl"],"phonetic":"/ˈduːdəl/","extraExplanation":["“doodle”常带有“漫不经心、边想边画”的感觉，通常不强调画得好不好；更正式或带街头文化色彩的“涂鸦”常用“graffiti”。","词源上，“doodle”与“傻瓜/呆子”的旧用法有关，所以它也隐含“随便画、没有严肃目的”的语气。"]}
{"word":"doodlebug","summary":{"en":"A doodlebug is usually an antlion larva; informally it can mean a small homemade gadget, and historically it was a nickname for the WWII V-1 flying bomb.","zh":"doodlebug 常指蚁蛉幼虫；口语中也可指小型自制装置；历史上还是二战德国 V-1 飞行炸弹的绰号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in the U.S.) an antlion larva—an insect whose young often makes a small sand pit to trap ants.","zh":"（尤指美国）蚁蛉幼虫（俗称“沙坑虫/陷阱虫”）；幼虫常在沙地挖漏斗形小坑来捕捉蚂蚁。"},"examples":[{"en":"Kids watched a doodlebug build a tiny cone-shaped pit in the sand.","zh":"孩子们看着一只蚁蛉幼虫在沙地里挖出一个小小的漏斗形陷阱。"},{"en":"The doodlebug waits at the bottom of its sand pit for ants to slip in.","zh":"蚁蛉幼虫会在沙坑底部埋伏，等蚂蚁滑落进去。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a small homemade or improvised device, especially one that moves, buzzes, or crawls; sometimes used for a simple toy or gadget.","zh":"（非正式）小型自制/临时拼凑的装置（常指会移动、嗡嗡响或像虫子一样“爬行”的东西）；有时也指简易玩具或小器械。"},"examples":[{"en":"He made a little doodlebug that scooted across the table using a battery and a motor.","zh":"他用电池和马达做了个小装置，能在桌面上“嗖嗖”地滑过去。"},{"en":"My grandpa called any strange-looking gadget a doodlebug.","zh":"我爷爷把任何长得奇怪的小器械都叫作“doodlebug”。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, informal) a nickname for the German V-1 flying bomb used in World War II.","zh":"（历史；非正式）二战时期对德国 V-1 飞行炸弹的绰号。"},"examples":[{"en":"In wartime London, people feared the sound of the doodlebug overhead.","zh":"在战时的伦敦，人们害怕头顶传来的“嗡嗡弹”（V-1）声音。"}]}],"synonyms":["antlion (larva)","gadget","contraption"],"phonetic":"ˈduːd(ə)lˌbʌɡ","extraExplanation":["“doodlebug”这个词带有拟声/昵称色彩：doodle 有“乱涂乱画、随手摆弄”的感觉，bug 是“虫子”。因此它既能指真正的“虫”，也常被用来形容看起来古怪、像虫子一样动来动去的小装置。","二战中英国人把德国 V-1 飞行炸弹叫 doodlebug，很大程度上是因为它飞行时发动机发出连续“嗡嗡”声，像一只巨大的“虫子”。"]}
{"word":"doodlebugs","summary":{"en":"“Doodlebugs” can mean silly little doodles, or (in nature contexts) a small insect larva like an antlion; context decides.","zh":"doodlebugs 可指随手涂鸦，也可在自然语境中指小虫幼体（如蚁狮幼虫）；需看上下文判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, playful drawings you make while thinking, listening, or feeling bored (also called “doodles”).","zh":"随手乱画的小涂鸦（也常称为 doodles）。"},"examples":[{"en":"I drew little doodlebugs in the margins during the meeting.","zh":"我在开会时在页边随手画了一些小涂鸦。"},{"en":"Her notebook is full of doodlebugs and quick sketches.","zh":"她的笔记本里满是涂鸦和随手速写。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname for certain insect larvae (especially antlion larvae) that make pits in sand to trap ants; in some places it can also mean a pill bug/roly‑poly.","zh":"某些昆虫幼虫的俗称（常指蚁狮幼虫，会在沙地挖漏斗坑捉蚂蚁；在一些地区也可指潮虫/鼠妇 roly‑poly）。"},"examples":[{"en":"As kids, we searched for doodlebugs in sandy soil and watched their little sand pits.","zh":"小时候我们在沙地里找“doodlebugs”，看它们挖的小沙坑。"},{"en":"The teacher showed the class a doodlebug (antlion larva) and explained how it hunts.","zh":"老师给全班看了一个“doodlebug”（蚁狮幼虫），并解释它如何捕食。"}]}],"synonyms":["doodles","scribbles","antlion (larva)","roly‑poly","pill bug"],"phonetic":"/ˈduːdəlˌbʌɡ/","extraExplanation":["“doodlebug”在美式英语里是很口语、带童趣的词。因为各地俗称不同，有时会被用来指不同小虫（最常见的是蚁狮幼虫），所以在阅读自然科普或地方故事时，最好结合上下文判断。","在二战历史语境中，“doodlebug”也曾指德国V-1飞弹（buzz bomb）的绰号；如果在战争题材文章里看到这个词，通常是这个意思。"]}
{"word":"doodled","summary":{"en":"“Doodled” usually means you drew simple shapes absentmindedly; it can also mean you wasted time (informal), or describe something covered with doodles.","zh":"“Doodled”通常指心不在焉地随手涂鸦；也可（非正式）指混时间；还可形容“被涂鸦过的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “doodle”: to draw simple, random shapes or pictures absentmindedly (often while thinking or listening).","zh":"“doodle”的过去式/过去分词：心不在焉地随手乱画（常发生在思考或听讲时）。"},"examples":[{"en":"She doodled flowers in the margin of her notebook during the meeting.","zh":"她在开会时在笔记本边缘随手画了些花。"},{"en":"I doodled while I was on the phone to help me focus.","zh":"我打电话时会随手涂鸦，帮助自己集中注意力。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “doodle”: to spend time doing something unimportant instead of working (informal).","zh":"“doodle”的过去式/过去分词：（非正式）磨蹭、混时间，做些不重要的事而不认真工作。"},"examples":[{"en":"He doodled around on the computer instead of starting his homework.","zh":"他在电脑前瞎折腾，没开始写作业。"}]},{"partOfSpeech":"adj.","definition":{"en":"covered with doodles; having casual sketches on it.","zh":"被涂鸦弄得满是随手画；带有随手小画的。"},"examples":[{"en":"The teacher found a doodled worksheet in his backpack.","zh":"老师在他书包里发现了一张被涂鸦过的练习纸。"}]}],"synonyms":["scribbled","sketched","scrawled","drew","idled"],"phonetic":"/ˈduːdəld/","extraExplanation":["“Doodle”常用于学习与办公场景：一边听讲/开会一边随手画。很多时候它并不表示“不认真”，有些人反而会通过涂鸦保持注意力。","口语里常见搭配：doodle in the margins（在页边涂鸦）、doodle around（混时间/瞎弄，语气偏负面）。"]}
{"word":"doodler","summary":{"en":"A doodler is someone who casually draws simple pictures or patterns, often while thinking or listening.","zh":"doodler 指随手涂鸦的人，常在思考或听讲时画简单图案或线条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who doodles (draws simple, absent-minded pictures or patterns, often while thinking or listening).","zh":"涂鸦者；随手乱画的人（常在思考或听讲时无意识地画简单图案或线条）。"},"examples":[{"en":"He’s a doodler who fills the margins of his notebook with little cartoons.","zh":"他是个爱涂鸦的人，会在笔记本页边画满小漫画。"},{"en":"Many doodlers draw to stay focused during long meetings.","zh":"很多涂鸦者会在冗长会议中通过画画来保持专注。"}]}],"synonyms":["doodler (person who doodles)","sketcher (casual)","scribbler"],"phonetic":"/ˈduːd(ə)lər/","extraExplanation":["“doodle”常带有“随手画、无意识画”的感觉，不等同于正式的“绘画（drawing/painting）”。在学习或开会时涂鸦，有时被认为能帮助集中注意力或缓解压力。"]}
{"word":"doodlers","summary":{"en":"“Doodlers” means people who doodle (draw simple, absent-minded sketches). It can also mean people who seem to waste time.","zh":"“doodlers”指涂鸦者（随手画简单小图的人）；也可指看起来在浪费时间、磨洋工的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who doodle—who draw simple, often absent-minded sketches (for example, while thinking or listening).","zh":"涂鸦者；指会随手乱画简单小图的人（常在思考或听讲时不自觉地画）。"},"examples":[{"en":"The teacher asked the doodlers to put their pens down and focus on the test.","zh":"老师让那些爱涂鸦的同学把笔放下，专心考试。"},{"en":"I’m one of those doodlers who draw little stars and faces during phone calls.","zh":"我是那种打电话时会随手画小星星和小脸的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, sometimes critical) People who waste time or appear not to be working seriously.","zh":"（非正式，有时带批评）磨洋工的人；看起来不认真做事的人。"},"examples":[{"en":"The manager didn’t want doodlers on the team when the deadline was close.","zh":"截止日期临近时，经理不希望团队里有磨洋工的人。"}]}],"synonyms":["scribblers","sketchers","daydreamers","time-wasters"],"phonetic":"/ˈduːd(ə)lərz/","extraExplanation":["“doodle”最初有“傻乎乎地闲混、浪费时间”的意思，后来也常指“随手涂画”。在学习语境里，doodling 有时被认为能帮助放松与集中注意力，但也可能被误解为不专心。"]}
{"word":"doodles","summary":{"en":"“Doodles” means casual little drawings, or the action of drawing them without planning.","zh":"“doodles”指随手涂鸦的小图，也可指“随手涂画”这个动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Simple, casual drawings made when you are bored or thinking (often in the margins of notes).","zh":"（随手）涂鸦；信手画的小图（常见于笔记边缘，人在走神或思考时画的）。"},"examples":[{"en":"Her notebook was full of doodles—stars, faces, and little cats.","zh":"她的笔记本里全是涂鸦——星星、脸和小猫。"},{"en":"I drew doodles during the long meeting.","zh":"在漫长的会议里我随手画了些涂鸦。"}]},{"partOfSpeech":"v.","definition":{"en":"To draw simple pictures without planning, usually while you are doing something else.","zh":"随手乱画；信手涂画（通常一边做别的事一边画）。"},"examples":[{"en":"He doodles when he talks on the phone.","zh":"他打电话时会随手涂画。"},{"en":"Stop doodling and focus on the lesson.","zh":"别再涂鸦了，专心上课。"}]}],"synonyms":["scribbles","sketches","scrawls"],"phonetic":"/ˈduːdəlz/","extraExplanation":["“doodles”是“doodle”的复数名词（很多涂鸦）或动词第三人称单数形式（he/she/it doodles）。","在英语里，doodle常带有“无意识/打发时间/边想边画”的感觉，通常不指正式的艺术作品。"]}
{"word":"doodlesack","summary":{"en":"“Doodlesack” is an old/Scottish word for “bagpipe(s).”","zh":"“doodlesack”是“bagpipe(s)（风笛）”的苏格兰/旧式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish/old-fashioned) A bagpipe; a type of musical instrument that uses a bag to push air through pipes.","zh":"（苏格兰/旧式用法）风笛；一种用气囊把空气压入管子的乐器。"},"examples":[{"en":"You could hear the doodlesack playing as the parade came down the street.","zh":"游行队伍沿街走来时，你能听到风笛在演奏。"},{"en":"In the story, a soldier carried a doodlesack to lift everyone’s spirits.","zh":"在故事里，一名士兵带着风笛，用来鼓舞大家的士气。"}]}],"synonyms":["bagpipe","bagpipes","pipes (informal)"],"phonetic":"/ˈduːdəlˌsæk/","extraExplanation":["“doodlesack”多见于苏格兰或旧文学语境，现代英语更常用“bagpipe(s)”。","这个词与德语“Dudelsack”（风笛）有渊源；在一些方言或历史文本中会出现，用来营造地域色彩或古旧氛围。"]}
{"word":"doodling","summary":{"en":"Doodling means making simple, absent-minded drawings, often while you’re bored or thinking.","zh":"Doodling 指在无聊或思考时随手画些简单图案的“涂鸦/乱画”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"making small, casual drawings or patterns while you are not focusing on something else (often because you are bored or thinking)","zh":"在不专注于主要事情时随手画些小图案或线条（常因无聊、走神或思考）"},"examples":[{"en":"She was doodling in the margin of her notebook during the meeting.","zh":"开会时她在笔记本的空白处随手涂鸦。"},{"en":"I doodle when I’m on the phone.","zh":"我打电话时会随手乱画。"}]},{"partOfSpeech":"other","definition":{"en":"the act of drawing in this casual way","zh":"随手涂鸦这一行为"},"examples":[{"en":"Doodling helps some people relax and think.","zh":"随手涂鸦能帮助一些人放松并理清思路。"},{"en":"The teacher asked him to stop doodling and pay attention.","zh":"老师让他别再涂鸦，专心听讲。"}]}],"synonyms":["scribbling","sketching","drawing absent-mindedly","scrawling"],"phonetic":"/ˈduːdlɪŋ/","extraExplanation":["“doodle”常被认为来源不太确定，可能与德语“dudeln”（胡乱弹奏/哼唱）等词有关，因此带有“随意、不太讲究”的感觉。","在学习或开会时“doodling”有时被看作走神，但也有研究与观点认为，适度涂鸦可能帮助保持清醒与记忆要点；语境不同，评价也不同。"]}
{"word":"doodskop","summary":{"en":"A South African informal (often insulting) word for a stupid person.","zh":"南非口语里（常带侮辱）指“笨蛋/傻瓜”的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, from Afrikaans; informal, often insulting) A stupid or foolish person; an idiot; a blockhead.","zh":"（南非英语，源自南非荷兰语Afrikaans；非正式，常带侮辱）笨蛋；傻瓜；蠢人。"},"examples":[{"en":"Don’t be a doodskop—check the directions before you start.","zh":"别当个笨蛋——开始前先把说明看清楚。"},{"en":"He called me a doodskop for forgetting the keys.","zh":"我忘带钥匙，他骂我是个傻瓜。"}]}],"synonyms":["idiot","fool","blockhead","dumbhead","nitwit"],"phonetic":"/ˈdud.skɑp/","extraExplanation":["这个词来自Afrikaans：dood（死的）+ skop（头/头骨的口语成分），字面接近“死脑袋”。在南非日常口语里可用来吐槽别人“很蠢”，语气往往不太友好；在正式场合或对不熟的人使用可能显得粗鲁。"]}
{"word":"dooed","summary":{"en":"“Dooed” is not standard English; it’s usually a playful/mistaken spelling (often meaning “dude”) or a way to show a “doo” sound.","zh":"“dooed”不是标准英语；通常是玩笑/误拼（常指“dude”）或用来表示“doo”的声音。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling or playful spelling of another word (most often “dude”), or an informal way to show the sound “doo.”","zh":"不是标准英语单词。通常是拼写错误或玩笑式拼写（最常见是“dude”），或用来表现“doo”的声音。"},"examples":[{"en":"I can’t find “dooed” in a dictionary—did you mean “dude”?","zh":"我在词典里找不到“dooed”——你是不是想写“dude”？"},{"en":"In chat, people sometimes stretch spelling for fun, like writing “dooed” to imitate a sound.","zh":"在聊天里，人们有时会故意拉长拼写来好玩，比如写“dooed”来模仿声音。"}]}],"synonyms":["dude","mate","buddy"],"phonetic":"/duːd/","extraExplanation":["“dooed”最常见的可能目标词：\n1) dude /duːd/：口语“哥们/朋友”（有时也带“你这家伙”的语气）。\n2) doomed：意为“注定要失败/完蛋的”。\n3) do + -ed：英语里一般写作 did（过去式），不会写成 dooed。\n\n如果你告诉我你看到“dooed”的句子原文，我可以更准确判断你想查的是哪个词。"]}
{"word":"doofus","summary":{"en":"“Doofus” means a silly or foolish person, usually in a mild, joking way.","zh":"“doofus”指“傻乎乎/犯傻的人”，多为口语且语气较轻，常带玩笑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A silly or foolish person (mildly insulting, often joking).","zh":"傻瓜；笨蛋（语气较轻，常带玩笑或吐槽）"},"examples":[{"en":"I forgot my keys again—I'm such a doofus.","zh":"我又忘带钥匙了——我真是个笨蛋。"},{"en":"Don’t be a doofus—read the instructions first.","zh":"别犯傻——先看说明书。"}]}],"synonyms":["goofball","dummy","sillyhead","blockhead"],"phonetic":"/ˈduːfəs/","extraExplanation":["“doofus”是比较口语、偏美式的轻度贬义词，常用于朋友之间自嘲或吐槽；对陌生人或正式场合使用可能显得不礼貌。","语气上比“idiot”更轻一些，更接近“goofball / dummy”（也可能带一点亲昵的玩笑感），但具体仍看语境和语气。"]}
{"word":"doofuses","summary":{"en":"“Doofuses” is the plural of “doofus,” meaning silly or foolish people (informal, mildly insulting).","zh":"“doofuses”是“doofus”的复数，指“笨蛋/傻瓜”（非正式、略带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who behaves in a silly, clumsy, or foolish way; a mildly insulting word for someone you think is not smart or not paying attention.","zh":"（非正式）笨蛋；傻瓜；做事很蠢或很不靠谱的人（带点轻蔑/吐槽语气）。"},"examples":[{"en":"Stop being a doofus—read the instructions first.","zh":"别当笨蛋了——先把说明书读一遍。"},{"en":"I felt like a doofus after forgetting my own password.","zh":"我把自己的密码忘了之后，觉得自己真蠢。"},{"en":"Those doofuses parked in the wrong spot again.","zh":"那些笨蛋又停错位置了。"}]}],"synonyms":["idiots","fools","goofballs","dummies","nincompoops"],"phonetic":"/ˈduːfəs/","extraExplanation":["“doofuses”是“doofus”的复数形式；单数：a doofus，复数：two doofuses。","语气提示：常用于朋友间半开玩笑的吐槽，但对陌生人说可能显得不礼貌。更中性的说法有“silly”或“careless”。"]}
{"word":"doohickey","summary":{"en":"A casual word for a small gadget or part when you don’t know (or don’t say) its real name.","zh":"口语中指“不知道/不想说真实名称的”小工具或小零件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small object or gadget whose exact name you don’t know or don’t want to say; a “thingamajig.”","zh":"（不知道或不想说出准确名称的）小物件/小装置；相当于“那个…东西”。"},"examples":[{"en":"Can you hand me that doohickey on the table?","zh":"你能把桌上的那个小东西递给我吗？"},{"en":"This doohickey holds the cable in place.","zh":"这个小装置用来把线固定住。"}]},{"partOfSpeech":"n.","definition":{"en":"A small, often insignificant part or attachment of a machine or device.","zh":"（机器或设备上的）小零件；小部件（常带“不起眼”的感觉）。"},"examples":[{"en":"One little doohickey broke, and the whole printer stopped working.","zh":"一个小零件坏了，整台打印机就不工作了。"},{"en":"The manual calls it a “retaining clip,” but everyone in the shop just says “doohickey.”","zh":"说明书叫它“固定夹”，但店里的人都直接叫它“那个小零件”。"}]}],"synonyms":["thingamajig","whatchamacallit","gizmo","widget"],"phonetic":"/ˈduːˌhɪki/","extraExplanation":["“doohickey”是非常口语、非正式的说法，常用于日常对话和轻松场合；在正式写作或技术场景中，最好用具体名称（如 screw 螺丝、clip 夹子、adapter 转接头 等）。","词源不太确定，大约在20世纪美国英语中流行起来，属于“临时替代词”（和 thingamajig、whatchamacallit、gizmo 同类），用来填补“我一时想不起/不想说那个词”的空缺。"]}
{"word":"doohickeys","summary":{"en":"Doohickeys means small unnamed gadgets/parts, or “miscellaneous things,” in informal English.","zh":"Doohickeys 是非正式用语，指叫不出名字的小器具/零件，也可泛指杂七杂八的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) Small gadgets, tools, or mechanical parts whose exact name you don’t know or don’t want to say; also used for “things/stuff.”","zh":"（非正式）指叫不出名字或不想说出具体名称的小器具、小工具、机械零件；也可泛指“那些东西/杂物”。"},"examples":[{"en":"Pass me those doohickeys— the little metal clips on the table.","zh":"把那些 doohickeys 递给我——桌上那几个小金属夹子。"},{"en":"This box is full of doohickeys from my old bike.","zh":"这个盒子里装满了我旧自行车上的各种小零件（doohickeys）。"},{"en":"I bought a few kitchen doohickeys, but I rarely use them.","zh":"我买了几个厨房小玩意儿（doohickeys），但几乎不用。"}]}],"synonyms":["gadgets","thingamajigs","whatchamacallits","bits and pieces","widgets"],"phonetic":"/ˈduˌhɪkiz/","extraExplanation":["“Doohickey” 是非常口语、轻松的说法，语气比 “thingamajig/whatchamacallit” 稍微常见一些，常用在聊天或说明书/零件名称不清楚的场景。","复数 doohickeys 常暗示“好几个小零件/小玩意儿”，有时带一点“杂七杂八的小东西”的感觉。"]}
{"word":"doohickus","summary":{"en":"An informal word for a small object or gadget when you don’t know its name.","zh":"口语里用来指代叫不出名字的小物件或小装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A small object or gadget whose exact name you don’t know or don’t want to say.","zh":"（非正式）指一个小物件/小装置，因为不知道或不想说出确切名称而用的代称。"},"examples":[{"en":"Can you hand me that doohickus on the table—the little tool with the red handle?","zh":"你能把桌上那个 doohickus 递给我吗——就是那个红柄的小工具。"},{"en":"I forgot the name of the part, but the mechanic said a doohickus was loose.","zh":"我忘了那个零件叫什么了，但修理工说有个 doohickus 松了。"}]}],"synonyms":["doohickey","doodad","thingamajig","whatchamacallit","gizmo"],"phonetic":"/ˈduːˌhɪkəs/","extraExplanation":["“doohickus”是非常口语、带点幽默的泛称，常用来代替叫不出名字的东西；语气通常不正式，适合日常对话，不太适合正式写作。","更常见的拼写是“doohickey”；相近的口语词还有“doodad”“thingamajig”“whatchamacallit”。这些词都表达“那个东西/那个玩意儿”的感觉。"]}
{"word":"doohinkey","summary":{"en":"“Doohickey” is an informal word for a small object or gadget when you don’t know or can’t recall its name.","zh":"“Doohickey” 是口语用法，指你叫不出名字或想不起名称的小物件/装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal word for a small object or gadget whose name you don’t know or can’t remember","zh":"（口语）指叫不出名字或一时想不起来名称的小物件、装置、玩意儿"},"examples":[{"en":"Can you hand me that doohickey on the table?","zh":"你能把桌上那个小玩意儿递给我吗？"},{"en":"I need a doohickey to tighten this screw, but I can’t remember what it’s called.","zh":"我需要一个东西来拧紧这颗螺丝，但我想不起来它叫什么。"}]}],"synonyms":["thingamajig","whatchamacallit","gadget"],"phonetic":"/ˈduːˌhɪki/","extraExplanation":["你写的 **doohinkey** 通常是 **doohickey** 的拼写变体或误拼。更常见的拼法有：**doohickey / doohicky / doohickie**。","它属于英语里很常见的“占位词”（placeholder word），用来临时代替不确定名称的东西，语气随意、口语化；写正式文章时一般不用。","类似的占位词还有：**thingamajig**, **whatchamacallit**, **gadget**（更偏“装置/小器械”）。"]}
{"word":"doohinkus","summary":{"en":"Doohinkus is an informal name for a thing or gadget whose real name is unknown or forgotten (more commonly spelled doohickey).","zh":"Doohinkus 是非正式说法，指叫不出或想不起名称的物件/小装置（更常见拼写为 doohickey）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal word for an object or device when you don’t know, can’t remember, or don’t want to say its real name; a thingamajig","zh":"（非正式）指叫不出名字、想不起来或不想说出正式名称的物件/装置；“那个东西/玩意儿”"},"examples":[{"en":"Can you hand me that doohinkus on the table?","zh":"你能把桌上那个 doohinkus（那个玩意儿）递给我吗？"},{"en":"This doohinkus is supposed to tighten the screw, but it’s not working.","zh":"这个 doohinkus 本来是用来拧紧螺丝的，但它不好使。"},{"en":"I forgot the name of the part, so I just called it a doohinkus.","zh":"我忘了那个零件叫什么了，所以就叫它 doohinkus。"}]}],"synonyms":["doohickey","thingamajig","whatchamacallit","gizmo","thingy"],"phonetic":"/ˈduːˌhɪki/","extraExplanation":["“doohinkus”更常见的标准拼写是 doohickey /ˈduːˌhɪki/，也有人写作 doohickey、doohickie、doohinkey 等；意思基本相同，都是口语里的“占位词”（placeholder word），相当于中文的“那个…、那玩意儿、那东西”。","使用场景多是轻松口语：修理、做手工、聊工具或零件时很常见；在正式写作里建议用更具体的词（part, device, tool, component）。","它带一点幽默感或随意感：说话者通常并非认真给物品命名，而是用来暂时代替真实名称。"]}
{"word":"dooing","summary":{"en":"“dooing” is a misspelling; the correct form is “doing,” the -ing form of “do.”","zh":"“dooing”是拼写错误；正确形式是“doing”，是“do”的 -ing 形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “doing.”","zh":"“doing”的常见拼写错误。"},"examples":[{"en":"Incorrect: I am dooing my homework.","zh":"错误：I am dooing my homework."},{"en":"Correct: I am doing my homework.","zh":"正确：I am doing my homework."}]},{"partOfSpeech":"v.","definition":{"en":"The act of performing an activity; the present participle/gerund form of “do.”","zh":"做某事的行为；动词“do”的现在分词/动名词形式。"},"examples":[{"en":"I’m doing my homework right now.","zh":"我现在正在做作业。"},{"en":"Doing exercise every day helps you stay healthy.","zh":"每天锻炼有助于保持健康。"},{"en":"What are you doing this weekend?","zh":"这个周末你要做什么？"}]}],"synonyms":["working","performing","carrying out"],"phonetic":"/ˈduːɪŋ/","extraExplanation":["“dooing”之所以常见，是因为学习者会误以为“do + -ing”需要双写元音/辅音。实际规则是：以元音字母组合“do”结尾时，直接加 -ing：do → doing（不双写任何字母）。","“doing”既可以表示进行时（be doing：正在做），也可以作动名词（Doing ... is ...：做……是……）。"]}
{"word":"dooja","summary":{"en":"“dooja” isn’t standard English; it’s usually a Hindi/Urdu romanization meaning “second/the other.”","zh":"“dooja”不是标准英语词；多为印地语/乌尔都语转写，意为“第二/另一个”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “dooja” is most often a romanization of a Hindi/Urdu word meaning “second” or “the other.” In English, it may appear in South Asian names, song lyrics, or informal transliteration.","zh":"不是标准英语词。“dooja”多见于印地语/乌尔都语的拉丁转写，意思常为“第二”“另一个/另一位”。在英语语境里多出现在南亚姓名、歌词或非正式拼写中。"},"examples":[{"en":"In the lyric, “dooja” means “the other/second,” not an English vocabulary word.","zh":"在这句歌词里，“dooja”表示“另一个/第二”，并不是英语词汇。"},{"en":"If you meant “dojo,” that’s an English word for a martial arts training hall.","zh":"如果你想写的是“dojo”，那是英语里指“武术道场/训练馆”的词。"}]}],"synonyms":["second","the other","another"],"phonetic":"/ˈduːdʒə/","extraExplanation":["“dooja/duja/doosra”这类拼法常见于把印地语/乌尔都语用拉丁字母写出来（transliteration）。不同地区/个人会有不同拼写，所以在英文里看起来像“生词”，但本质是外来语或转写。","如果你告诉我它出现的句子（或你想表达的意思），我可以判断你更可能想写的是哪一个词：例如“dojo”（道场）、“Dooja/Doja”（人名/艺名）或南亚语言里的“dooja”。"]}
{"word":"dook","summary":{"en":"“Dook” is a Scottish informal word meaning to duck down quickly or to dip/dunk (or a quick dip) in water.","zh":"“dook”是苏格兰口语词，常指迅速低头闪避，或把东西/人快速浸入水中（也可指一次短暂下水）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scotland, informal) to dip or duck down quickly, often to avoid something; to lower your head.","zh":"（苏格兰口语）快速低头/闪避；把头缩下去（常为躲开某物）。"},"examples":[{"en":"He dooked his head to avoid the low branch.","zh":"他赶紧低头躲开那根低树枝。"},{"en":"When the ball flew toward her, she dooked instinctively.","zh":"球朝她飞来时，她本能地一缩头闪开了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Scotland, informal) to dip something into water briefly; to give something a quick dunk.","zh":"（苏格兰口语）把……短暂浸入水中；快速蘸/ dunk 一下。"},"examples":[{"en":"She dooked the brush in water before painting.","zh":"她画之前把刷子在水里蘸了一下。"},{"en":"Dook the biscuit in your tea if you like it softer.","zh":"如果你喜欢软一点，可以把饼干在茶里蘸一下。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) a quick dip or dunk, especially in water; a brief swim.","zh":"（苏格兰口语）快速一浸/一蘸；（尤指）短暂下水游一会儿。"},"examples":[{"en":"Let’s go for a dook in the river—just for a minute.","zh":"我们去河里泡一下吧——就一分钟。"},{"en":"He took a dook in the sea even though it was cold.","zh":"尽管海水很冷，他还是下海泡了一下。"}]}],"synonyms":["duck","dip","dunk","bob","dive"],"phonetic":"/duk/","extraExplanation":["“dook”主要见于苏格兰英语（Scots/Scottish English），相当于标准英语里的“duck”（低头闪避）或“dip/dunk”（蘸、浸）。在其他英语地区不算常用，写作或正式场合通常用更通用的词。","在苏格兰文化语境里，常见搭配有“go for a dook”（去水里泡/游一下），语气随意、口语化。"]}
{"word":"dooket","summary":{"en":"Docket usually means a court schedule/list of cases, and more generally an agenda or list of items to be handled; it can also mean to officially record or add something to that list.","zh":"Docket 通常指法院的案件排期/清单，也可泛指议程或待办事项清单；作动词时表示正式登记或把事项列入清单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a list or schedule of cases to be dealt with in a court, or the agenda of items to be discussed in a meeting","zh":"（法院）审理案件的排期表/案件清单；（会议）议程、待办事项清单"},"examples":[{"en":"The case is on the court’s docket for next Monday.","zh":"这个案件排在下周一的法院审理日程上。"},{"en":"Budget cuts are at the top of today’s docket.","zh":"预算削减是今天议程上的首要事项。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially record something in a court system or add it to an agenda/list","zh":"（在法院系统中）正式登记/立案；把某事列入清单或议程"},"examples":[{"en":"The clerk docketed the motion in the system.","zh":"书记员把该动议录入系统并登记在案。"},{"en":"We should docket this topic for the next meeting.","zh":"我们应该把这个议题列入下次会议的议程。"}]}],"synonyms":["agenda","schedule","calendar","case list","register"],"phonetic":"/ˈdɑkɪt/","extraExplanation":["你输入的“dooket”通常是把“docket”拼错了（常见于听写或快速打字）。标准拼写是 docket。","在美国英语里，docket 最常见于法律语境：court docket 指“法院排期/案卷清单”。口语或新闻里也常见 on the docket（在议程上/在待处理清单上）。"]}
{"word":"dookie","summary":{"en":"“Dookie” is informal slang, most commonly meaning poop (feces). It can also be an insult for a very bad person.","zh":"“dookie”是非正式俚语，最常见意思是“便便/粪便”；也可作侮辱性称呼，指“很差劲的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, childish) Feces; poop.","zh":"（俚语、儿童用语）粪便；便便。"},"examples":[{"en":"The toddler said he had dookie in his diaper.","zh":"小宝宝说他的尿布里有便便。"},{"en":"Be careful—there’s dog dookie on the sidewalk.","zh":"小心——人行道上有狗屎。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, insulting) A contemptible person; someone seen as worthless.","zh":"（俚语、侮辱性）讨厌的人；被认为很差劲的人。"},"examples":[{"en":"Don’t call people names like “dookie.”","zh":"别用“dookie”这种话骂人。"},{"en":"He acted like a dookie and refused to apologize.","zh":"他表现得很差劲，而且拒绝道歉。"}]}],"synonyms":["poop","feces","shit (very rude)","crap (informal)"],"phonetic":"/ˈdʊki/","extraExplanation":["“dookie”在美式英语里通常是带点幼稚、搞笑的说法，用来指“便便”。在正式场合不建议使用；在公共或职场语境更常说“poop / feces”。","用于骂人时语气比较粗鲁，可能引发冲突；如果只是表达不满，可以改用更温和的说法（如“jerk”“mean person”等）。"]}
{"word":"dookit","summary":{"en":"“Dookit” is a Scots word for a small, tucked-away room or a hidden, cramped place.","zh":"“dookit”是苏格兰英语，指隐蔽狭小的房间/角落，也可形容地方“藏在一边、很挤”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots) A small, tucked-away room or space; a cramped or dingy little room (often an attic or back room).","zh":"（苏格兰英语）隐蔽的小房间/小空间；狭小、阴暗的小屋（常指阁楼或后屋）。"},"examples":[{"en":"They met in a wee dookit behind the shop.","zh":"他们在商店后面一间小小的隐蔽房间里见面。"},{"en":"The flat has a dookit room that’s barely big enough for a bed.","zh":"这套公寓有个很小的房间，小到几乎只放得下一张床。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scots, informal) Hidden away; tucked into a corner; cramped and out of the way.","zh":"（苏格兰英语，非正式）藏在角落里的；隐蔽的；狭窄而不显眼的。"},"examples":[{"en":"It’s a dookit little café, but the food is great.","zh":"那是一家藏得挺深的小咖啡馆，但吃的很棒。"},{"en":"He found a dookit spot to read in peace.","zh":"他找到了一个隐蔽的角落，能安静地看书。"}]}],"synonyms":["tucked-away","hidden","cramped","poky","snug"],"phonetic":"/ˈdʊkɪt/","extraExplanation":["“dookit”多见于苏格兰口语与文学描写中，带有地方色彩：常用来形容“躲在一边的小房间/小角落”，语气有时亲切（小而温馨），有时带点贬义（狭窄、阴暗）。","注意不要和“doocot / dovecote（鸽舍）”混淆：拼写与发音相近，但意思不同。"]}
{"word":"dool","summary":{"en":"“Dool” is a dialect word meaning grief or mourning (and sometimes “mournful”).","zh":"“dool”是方言词，表示“悲痛/哀悼”（也可作形容词表示“悲伤的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots/Irish English, dialect) Grief, sorrow, or mourning; a state of deep sadness, especially after a death.","zh":"（苏格兰/爱尔兰英语方言）悲痛、忧伤、哀悼；尤指亲人去世后的深切悲伤。"},"examples":[{"en":"After the funeral, the whole village was in dool for days.","zh":"葬礼之后，整个村子都哀伤了好几天。"},{"en":"She spoke quietly, still full of dool.","zh":"她轻声说话，仍满怀悲痛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Dialect) Mournful; sorrowful.","zh":"（方言）悲伤的；哀痛的。"},"examples":[{"en":"He gave a dool look when he heard the news.","zh":"他听到消息时露出悲伤的神情。"}]}],"synonyms":["grief","sorrow","mourning","sadness","lament"],"phonetic":"/dul/","extraExplanation":["“dool”主要见于苏格兰英语（Scots）与部分爱尔兰英语语境，在现代标准英语里不常用。常见搭配是“in dool”（处于哀悼/悲痛之中）。","在文学或民谣中，它常用来营造朴素、乡土、带有地方色彩的“哀伤/丧痛”氛围。"]}
{"word":"Doole","summary":{"en":"“Doole” is most commonly a proper noun: a surname (and sometimes a place name).","zh":"“Doole”最常见为专有名词：姓氏（有时也作地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), seen especially in Ireland and in English-speaking countries.","zh":"（姓氏）多见于爱尔兰及英语国家的姓。"},"examples":[{"en":"Ms. Doole will join the meeting at 3 p.m.","zh":"Doole 女士将于下午三点参加会议。"},{"en":"I found a record for the Doole family in the local archives.","zh":"我在当地档案馆里找到了一条关于 Doole 家族的记录。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (used for certain locations), depending on context.","zh":"（地名）在特定语境下可作某些地点的名称。"},"examples":[{"en":"They drove through Doole on their way to the coast.","zh":"他们去海边的路上开车经过了 Doole。"}]}],"phonetic":"/ˈduːl/","extraExplanation":["“Doole”在日常英语里不是常见词，更常见的是作为专有名词（姓氏/地名）。如果你想查的是动词“doodle（涂鸦）”、名词“dole（救济金/施舍）”或“dual（双重的）”等相近拼写，请告诉我你想表达的句子或语境，我可以给出正确词条与用法对比。"]}
{"word":"doolee","summary":{"en":"“Doolee” is usually a person’s name in English; if you meant “duly,” it means “properly” or “on time.”","zh":"“Doolee”在英语里通常是人名；若你想查的是“duly”，意思是“按规定地/适当地”或“按时地”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or given name). It is not a standard English vocabulary word; it’s usually used as a person’s name (often seen as a Korean romanization, e.g., “Doolee/Dooli”).","zh":"专有名词（姓氏或名字）。它不是标准英语词汇；通常用作人名（常见于韩语姓名的罗马拼写，如 Doolee/Dooli）。"},"examples":[{"en":"Doolee Kim joined our team last month.","zh":"金·杜莉（Doolee Kim）上个月加入了我们团队。"},{"en":"I met someone named Doolee at the conference.","zh":"我在会议上认识了一个叫 Doolee 的人。"}]},{"partOfSpeech":"adv.","definition":{"en":"Possible misspelling of “duly,” meaning “in a proper/expected way” or “at the right time.”","zh":"可能是 “duly” 的误拼，意思是“适当地/按规定地”或“按时地”。"},"examples":[{"en":"The form was duly signed and submitted.","zh":"表格已按规定签字并提交。"},{"en":"He duly apologized for being late.","zh":"他也按理道歉了，因为迟到了。"}]}],"synonyms":["(if you meant duly) properly","(if you meant duly) appropriately","(if you meant duly) punctually"],"phonetic":"/ˈduːli/","extraExplanation":["“Doolee/Dooley/Dooli”常见于人名拼写：有时来自爱尔兰姓氏 Dooley；也可能是韩语名字（比如 “둘리” 的一种拼法）。如果你是在某篇文章、字幕或名单里看到它，通常应按人名理解。","如果你本来想查的是副词 “duly”，它常用于较正式的语境（文件、通知、法律/行政表达），表示“手续齐全地、按时地、如期地”。"]}
{"word":"doolees","summary":{"en":"“Doolees” usually means the plural of “dooly/dhooly,” a carried litter or stretcher (often in South Asian historical contexts).","zh":"“doolees”通常指 dooly/dhooly 的复数：一种由人抬着走的简易轿式担架/担架，多见于南亚历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of dooly (also spelled dhooly): a simple covered litter or stretcher carried by people, especially in South Asia (often in historical or military contexts).","zh":"dooly（也拼作 dhooly）的复数：一种由人抬着走的简易担架或有篷的轿/担架，尤用于南亚语境（常见于历史或军旅叙述中）。"},"examples":[{"en":"In the old account, the injured soldier was carried back to camp in a dooly.","zh":"在那篇旧记述中，受伤的士兵被放在一顶 dooly 里抬回营地。"},{"en":"Travelers in colonial-era stories sometimes mention doolies moving along narrow paths.","zh":"殖民时期题材的故事里，旅行者有时会提到 doolies 在狭窄小路上被抬着前行。"}]}],"synonyms":["litters","palanquins","stretchers"],"phonetic":"/ˈduːliz/","extraExplanation":["“doolees”在现代英语中并不常见，更多出现在描写英属印度/殖民时期的英文材料里。常见拼写有 dooly / dhooly，也有人用更通用的词 litter（担架/轿式担架）或 palanquin（轿子）来表达相近概念。","如果你是想问别的词（例如人名、品牌名或特定方言用法），可以告诉我它出现的句子或语境，我可以帮你确认准确拼写和含义。"]}
{"word":"Dooley","summary":{"en":"Dooley is mainly a surname (often Irish in origin) and can also be a U.S. place name.","zh":"Dooley 主要是姓氏（常见于爱尔兰裔），也可指美国的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often of Irish origin; also used as a given name in some places","zh":"姓氏（常见于爱尔兰裔），有时也可作名字使用"},"examples":[{"en":"My teacher’s last name is Dooley.","zh":"我老师的姓是 Dooley。"},{"en":"Officer Dooley helped direct traffic after the storm.","zh":"暴风雨后，Dooley 警官帮忙指挥交通。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S. (e.g., Dooley County in Georgia)","zh":"美国的地名（例如乔治亚州的 Dooley 县）"},"examples":[{"en":"They drove through Dooley County on the way to Atlanta.","zh":"他们去亚特兰大的路上开车经过了 Dooley 县。"}]}],"phonetic":"/ˈduːli/","extraExplanation":["“Dooley”常被认为源自爱尔兰姓氏（有不同拼写变体）。在英文世界里，它最常见的用法是“姓”。\n\n文学/文化小补充：美国作家 Finley Peter Dunne 曾在报刊专栏中塑造过虚构人物 “Mr. Dooley”（19世纪末到20世纪初），用幽默讽刺的口吻评论时事，因此在一些文化语境里这个姓会让人联想到该角色。"]}
{"word":"dooley","summary":{"en":"“Dooley” is usually a surname (family name), and sometimes a given name.","zh":"“Dooley”通常是姓氏（家族姓），有时也可作名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); sometimes used as a given name","zh":"姓氏（家族姓）；有时也用作名字"},"examples":[{"en":"Ms. Dooley will lead today’s meeting.","zh":"杜利女士将主持今天的会议。"},{"en":"In the novel, Detective Dooley is a careful observer.","zh":"在小说里，杜利警探是个细心的观察者。"}]}],"phonetic":"/ˈduːli/","extraExplanation":["“Dooley”多见于英语世界的人名/姓氏，尤其在爱尔兰裔或英美语境中较常见。常见读音为/ˈduːli/（重音在第一音节）。","作为姓氏时，它通常不翻译含义，而是按音译处理（如“杜利/杜莉”等），具体译法会因个人或地区习惯不同而变化。"]}
{"word":"doolfu","summary":{"en":"“Doofus” means a silly or foolish person (informal, often mildly insulting or playful).","zh":"“Doofus”指“傻瓜/笨蛋”，是非正式用语，常带轻微侮辱或玩笑语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silly or foolish person (informal; often mildly insulting, sometimes playful)","zh":"傻瓜；笨蛋（非正式用语；常带轻微侮辱，也可半开玩笑）"},"examples":[{"en":"Don’t be a doofus—read the instructions first.","zh":"别当傻瓜——先把说明书读一遍。"},{"en":"I forgot my keys again. I’m such a doofus.","zh":"我又忘带钥匙了。我真是个笨蛋。"},{"en":"He’s not a bad guy—just a bit of a doofus sometimes.","zh":"他人不坏——只是有时候有点傻。"}]}],"synonyms":["goof","dummy","fool","clown"],"phonetic":"/ˈduːfəs/","extraExplanation":["你输入的“doolfu”不是常见英文拼写；最可能是想写“doofus”。","“doofus”语气通常比“idiot”更轻一点，很多时候带调侃、自嘲的感觉；但对陌生人使用仍可能显得不礼貌。"]}
{"word":"dooli","summary":{"en":"A traditional South Asian palanquin carried by people to transport someone.","zh":"南亚传统的抬轿/轿子，由人抬着运送乘客。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A covered litter or palanquin carried on poles by people, used in South Asia (especially historically) to transport a passenger.","zh":"（南亚，尤指历史上）由人抬着走的轿子/担架式座舆（常有遮盖），用来运送乘客。"},"examples":[{"en":"In the old story, the princess traveled in a dooli carried by four men.","zh":"在那个古老的故事里，公主坐在由四个人抬着的dooli里出行。"},{"en":"The film shows a bride arriving in a decorated dooli.","zh":"电影里新娘乘坐装饰华丽的dooli到达。"}]}],"synonyms":["palanquin","litter"],"phonetic":"/ˈduːli/","extraExplanation":["“dooli”是南亚英语里借用的词，常见于描写印度次大陆历史、婚礼或传统出行方式的语境中；现代日常英语里不常用，更常用的通用词是“palanquin”或“litter”。","词源多与印地语/乌尔都语中的“ḍolī / doli（婚轿、抬轿）”相关；不同地区拼写可能见到“doli / doolie / dooly”。"]}
{"word":"doolie","summary":{"en":"A doolie is a traditional South Asian carried litter/palanquin, also used historically as a simple stretcher for the wounded.","zh":"doolie 指南亚传统的抬轿/轿舆，也可指历史上用于抬运伤员的简易担架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a covered litter (a small bed or seat) carried by people, traditionally used in South Asia to transport a person","zh":"（南亚传统的）轿子/担架式轿舆：由人抬着运送乘客的有篷小轿"},"examples":[{"en":"The injured traveler was carried to the village in a doolie.","zh":"受伤的旅人被用轿子（doolie）抬到村子里。"},{"en":"In older accounts of India, officials sometimes traveled by doolie.","zh":"在较早的印度记述中，官员有时会乘坐轿子（doolie）出行。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a simple stretcher used to carry wounded people, especially in military contexts in South Asia","zh":"（历史用法）简易担架：尤其指南亚军事语境中用来抬运伤员的担架"},"examples":[{"en":"The soldiers lifted him onto a doolie and moved him to the field hospital.","zh":"士兵们把他抬上简易担架（doolie），送往战地医院。"}]}],"synonyms":["palanquin","litter","stretcher"],"phonetic":"/ˈduːli/","extraExplanation":["“doolie”多见于英式英语或历史叙述，尤其与英属印度时期的旅行与军事医疗有关。词源通常追溯到印地语/乌尔都语等语言中的“doli”（一种轿舆）。在现代日常英语里较少用，常被更通用的“stretcher（担架）”或“palanquin/litter（轿舆）”替代。"]}
{"word":"doolies","summary":{"en":"“Doolies” most commonly means first-year cadets at a U.S. military academy (especially USAFA); less commonly, it can mean traditional South Asian carried litters/stretcher-like vehicles.","zh":"“doolies”最常见指美国军校（尤其空军军官学校）的一年级学员；较少见时也可指南亚传统的人抬轿架/担架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US, informal) First-year cadets at some U.S. military academies (especially the U.S. Air Force Academy); freshmen who usually have the lowest rank and must follow many rules.","zh":"（美国，非正式）美国部分军校（尤其是美国空军军官学校）的一年级学员/新生；通常级别最低，需要遵守较多规定。"},"examples":[{"en":"The upperclassmen told the doolies to stay in formation.","zh":"高年级学员让一年级新生（doolies）保持队形。"},{"en":"Life is strict for doolies during the first few weeks.","zh":"在最初几周里，doolies 的生活非常严格。"}]},{"partOfSpeech":"n.","definition":{"en":"A simple stretcher or covered litter carried by people, traditionally used in parts of South Asia (plural: doolies).","zh":"（旧时/传统）一种由人抬的简易担架或有顶轿架（在南亚一些地区使用；复数为 doolies）。"},"examples":[{"en":"The injured traveler was carried to the village in a doolie.","zh":"受伤的旅人被用抬轿式担架（doolie）抬到村里。"},{"en":"In older accounts, doolies were used to transport people through rough terrain.","zh":"在较早的记载中，人们会用 doolies 在崎岖地形中运送乘客。"}]}],"synonyms":["freshmen (cadets)","first-years","new cadets","plebes (at some academies)","litters","stretchers"],"phonetic":"ˈduːliz","extraExplanation":["“doolie”作为军校用语，常见于美国空军军官学校（USAFA），指一年级学员。不同军校/军种对新生可能有不同称呼（如“plebe”等）。","与南亚“抬轿/担架”相关的 doolie 属于较旧的用法，常见于历史记述或文学/旅行写作中。"]}
{"word":"Doolittle","summary":{"en":"“Doolittle” is usually a surname; informally it can also mean a person who does very little (often written “do-little”).","zh":"“Doolittle”通常是姓氏；在非正式用法中也可指“无所事事的人”（常写作 do-little）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); often refers to specific famous people with this surname","zh":"姓氏；常用来指代某位著名的“Doolittle”家族成员"},"examples":[{"en":"Jimmy Doolittle was a famous American pilot and military leader.","zh":"吉米·杜立特（Jimmy Doolittle）是著名的美国飞行员和军事领袖。"},{"en":"In the article, Doolittle is quoted as saying the mission required careful planning.","zh":"文章中引用了杜立特的话，说这次任务需要周密规划。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who does very little; someone idle or unproductive (informal; sometimes written “do-little”)","zh":"无所事事的人；懒散、不怎么做事的人（非正式；有时写作 do-little）"},"examples":[{"en":"He’s not a do-little—he helps out whenever he can.","zh":"他不是那种无所事事的人——只要能帮忙他就会帮。"},{"en":"The coach warned the team not to become do-littles during practice.","zh":"教练警告球队训练时别变得懒散。"}]}],"synonyms":["idler","lazybones","slacker"],"phonetic":"/ˈduːˌlɪtəl/","extraExplanation":["“Doolittle”最常见是英文姓氏。文化上最有名的用法之一是“Doolittle Raid（杜立特突袭）”：二战期间由Jimmy Doolittle领导的空袭行动，常见于历史书与纪录片。","另外，“Doolittle”也可能指流行文化作品名（如专辑或书名）——需要结合上下文判断。注意不要和拼写不同的“Dr. Dolittle（杜利德医生）”混淆。"]}
{"word":"dooly","summary":{"en":"“Dooly” is usually a misspelling of **duly** (“properly; as expected; at the right time”), but it can also be a name or place name.","zh":"“dooly”多半是 **duly** 的误拼（“适当地/如期地/手续完备地”），也可能是人名或地名。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of **duly**, meaning “in the proper way,” “as expected,” or “at the right time.”","zh":"（非标准拼写）通常是 **duly** 的误拼，意思是“适当地 / 正当地”、“如期地 / 按时地”或“符合手续地”。"},"examples":[{"en":"Please make sure the form is **duly** signed before you submit it.","zh":"提交之前请确保表格已**正式签署**。"},{"en":"The guests were **duly** impressed by her performance.","zh":"她的表演让客人们**果然 / 如预料般**印象深刻。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun, less common) **Dooly** can be a family name or a place name (for example, Dooly County in Georgia, USA).","zh":"（专有名词，较少见）**Dooly** 也可能是姓氏或地名（例如美国佐治亚州的 Dooly 县）。"},"examples":[{"en":"She moved to **Dooly County** for work.","zh":"她为了工作搬到了 **Dooly 县**。"}]}],"synonyms":["duly (correct spelling)","properly","appropriately","punctually"],"phonetic":"/ˈduːli/","extraExplanation":["英语里更常见的是 **duly**（adv.），拼写是 d-u-l-y，发音 /ˈduːli/。如果你是在写正式邮件或文件（如 duly signed / duly authorized），建议用 **duly**。","如果你指的是某个人名或地名（例如姓 Dooley / 地名 Dooly），也请告诉我上下文，我可以帮你确认正确拼写和含义。"]}
{"word":"doom","summary":{"en":"“Doom” means a terrible, often unavoidable fate (noun), or to cause inevitable failure or destruction (verb).","zh":"“doom”指（名词）不可避免的可怕结局/厄运，或（动词）使注定失败或毁灭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"death, destruction, or another terrible event that seems unavoidable; a feeling that something very bad is going to happen","zh":"厄运；毁灭；（似乎无法避免的）可怕结局；对大难临头的预感"},"examples":[{"en":"Many people felt a sense of doom as the storm grew stronger.","zh":"随着风暴越来越强，许多人感到一种厄运将至的预感。"},{"en":"The novel is filled with doom and tragedy.","zh":"这部小说充满了厄运与悲剧。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone or something to fail, be destroyed, or have no chance of success","zh":"注定失败；使毁灭；使毫无成功希望"},"examples":[{"en":"A lack of funding could doom the project.","zh":"资金不足可能会让这个项目注定失败。"},{"en":"His careless words doomed their plan.","zh":"他不经意的话让他们的计划泡汤了。"}]}],"synonyms":["fate","ruin","destruction","downfall","condemn"],"phonetic":"/duːm/","extraExplanation":["“doom”常带有文学或新闻语体色彩，比一般的“bad luck/ trouble”更沉重，强调“不可避免的结局”。","词源上与“judge（审判）/ judgment（判决）”的概念有关：早期含义接近“判决、命运的裁定”，后来逐渐引申为“厄运、毁灭”。","常见搭配：a sense of doom（厄运感/不祥预感）, doom and gloom（悲观消沉的气氛）, be doomed to + V（注定会……）。"]}
{"word":"doom and gloom","summary":{"en":"strong pessimism or a dark, hopeless mood","zh":"强烈的悲观情绪；黑暗无望的氛围"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a feeling, attitude, or talk that something bad is going to happen; strong pessimism","zh":"对未来会变糟的强烈担忧或悲观情绪；“要完蛋了”的论调"},"examples":[{"en":"After the layoffs, there was a lot of doom and gloom in the office.","zh":"裁员之后，办公室里弥漫着很多悲观和消沉的情绪。"},{"en":"She’s tired of the constant doom and gloom on social media.","zh":"她厌倦了社交媒体上不断出现的悲观言论。"},{"en":"The report wasn’t all doom and gloom—there were signs of progress too.","zh":"这份报告并不全是坏消息——也有进展的迹象。"}]},{"partOfSpeech":"phrase","definition":{"en":"an atmosphere or style that feels dark, depressing, and hopeless","zh":"黑暗、压抑、让人看不到希望的氛围或风格"},"examples":[{"en":"The film uses rain and gray light to create doom and gloom.","zh":"这部电影用雨和灰暗的光线营造出压抑的氛围。"},{"en":"He tried to bring some humor to cut through the doom and gloom.","zh":"他想用一点幽默来冲淡这种压抑的气氛。"}]}],"synonyms":["pessimism","negativity","despair","bleakness","hopelessness","bad vibes","dark mood"],"phonetic":"/ˌduːm ən ˈɡluːm/","extraExplanation":["常用于评价媒体报道或公众讨论：例如说某些新闻“全是doom and gloom”，意思是只强调坏消息、把前景说得很绝望。语气多为批评或抱怨。"],"etymology":"“doom”意为“厄运/毁灭性结局”，“gloom”意为“阴暗/忧郁”。两词搭配形成押韵式固定说法（doom / gloom），用来加强“前景很糟”的语气。","mnemonic":["把它当作“押韵套餐”：doom（完蛋）+ gloom（阴沉）= “完蛋又阴沉”，记成“坏消息二连”。","联想中文：‘末日感 + 阴霾’就是doom and gloom。"]}
{"word":"doom-and-gloom","summary":{"en":"“Doom-and-gloom” means overly pessimistic talk, feelings, or a negative tone focused on bad outcomes.","zh":"“doom-and-gloom”指过度悲观、唱衰的言论或氛围，强调只看到糟糕结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pessimistic talk or feelings that focus on bad outcomes, failure, or disaster (often exaggerated).","zh":"悲观、唱衰的说法或情绪；总是强调糟糕结果、失败或灾难（常带夸大）。"},"examples":[{"en":"There’s been a lot of doom-and-gloom about the economy, but some indicators are improving.","zh":"关于经济的唱衰言论很多，但一些指标正在好转。"},{"en":"I’m trying to avoid doom-and-gloom news before bed.","zh":"我睡前尽量避免看那些让人悲观的新闻。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing an overly negative, pessimistic attitude or message.","zh":"形容过度消极、悲观的态度或言论。"},"examples":[{"en":"His doom-and-gloom predictions made the team anxious.","zh":"他那些悲观的预测让团队很焦虑。"},{"en":"The article takes a doom-and-gloom tone, ignoring possible solutions.","zh":"这篇文章语气很唱衰，却忽视了可能的解决办法。"}]}],"synonyms":["pessimism","negativity","bleak outlook","gloominess","dire predictions"],"phonetic":"/ˌduːm ən ˈɡluːm/","extraExplanation":["“doom”意为“厄运/毁灭”，而“gloom”是“阴郁/灰暗”。把两者用连字符连在一起，强调一种“非常悲观、几乎只看见坏结果”的气氛。","常见搭配：doom-and-gloom predictions（悲观的预测）、doom-and-gloom scenario（唱衰的情景）、doom-and-gloom about + 话题（对……很悲观）。语气通常带有批评：说话者觉得这种悲观“过头了”。"]}
{"word":"doom-and-gloomer","summary":{"en":"A doom-and-gloomer is someone who regularly predicts bad outcomes and focuses on negativity.","zh":"doom-and-gloomer 指经常唱衰、总往坏处想并宣扬消极结果的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who often expects the worst and talks about negative outcomes, even when there is little evidence","zh":"悲观主义者；总爱预言坏结果、散布消极看法的人"},"examples":[{"en":"Don’t be such a doom-and-gloomer—the project has a real chance to succeed.","zh":"别那么悲观了——这个项目确实有成功的机会。"},{"en":"During the storm warnings, a few doom-and-gloomers insisted the city would completely shut down.","zh":"在暴风雨预警期间，有些唱衰的人坚持认为城市会彻底停摆。"},{"en":"She tries to balance the team by pushing back when a doom-and-gloomer dominates the conversation.","zh":"当有人一味唱衰主导讨论时，她会反驳一下，让团队保持平衡。"}]}],"synonyms":["pessimist","naysayer","Cassandra (literary)","doom-monger"],"phonetic":"/ˈduːm ən ˈɡluːmɚ/","extraExplanation":["“doom-and-gloomer”来自常见搭配“doom and gloom”（厄运与阴霾），常用于形容过度悲观、把事情说得很糟的人或言论。比“pessimist（悲观主义者）”更口语，也更带批评意味。","常见场景：新闻评论、经济预测、公司会议或社交媒体讨论中，用来指那些总强调风险、灾难、崩溃的人。注意它有时也会被用来反讽：对方未必错，只是表达方式太消极。"]}
{"word":"doom-and-gloomers","summary":{"en":"Doom-and-gloomers are people who are habitually negative and predict disaster or failure.","zh":"Doom-and-gloomers 指习惯性悲观、总预测灾难或失败的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who constantly predict bad outcomes or emphasize how terrible the future will be; pessimists.","zh":"总是预测坏结果、渲染前景悲观的人；悲观主义者。"},"examples":[{"en":"During the economic slowdown, doom-and-gloomers predicted massive layoffs everywhere.","zh":"在经济放缓期间，一些悲观主义者预测到处都会大规模裁员。"},{"en":"She tries not to listen to doom-and-gloomers and focuses on practical solutions.","zh":"她尽量不听那些唱衰的人，而是专注于切实可行的解决办法。"}]}],"synonyms":["pessimists","doomsayers","naysayers","prophets of doom"],"phonetic":"/ˈduːm ən ˈɡluːmərz/","extraExplanation":["“doom-and-gloom”直译是“厄运与阴霾”，常见于新闻、评论和社交媒体，用来形容过度悲观、总把事情往最坏处想的论调。","“doom-and-gloomers”是带有评价色彩的说法，语气往往偏批评或调侃；使用时注意场合与对象，避免冒犯。","相关表达：“doom and gloom”（名词短语：悲观论调）、“a doomsayer”（预言灾难的人）、“the sky is falling”（夸张地说大祸临头）。"]}
{"word":"Doom-inspired","summary":{"en":"Doom-inspired means influenced either by the DOOM video game style or by a general sense of doom and apocalypse.","zh":"Doom-inspired 指受到《DOOM／毁灭战士》风格影响，或受到“末日感/不祥预感”启发。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Influenced by the style, gameplay, or aesthetics of the video game series DOOM (often meaning fast, aggressive action, heavy metal energy, demons/hell imagery, and retro FPS design).","zh":"受电子游戏《DOOM／毁灭战士》系列的风格、玩法或美术影响（常指快节奏、强攻击性、重金属氛围、恶魔/地狱意象、复古第一人称射击设计）。"},"examples":[{"en":"The new shooter is clearly Doom-inspired: nonstop movement, big guns, and demons everywhere.","zh":"这款新射击游戏明显是“Doom-inspired”：不停移动、火力凶猛、到处都是恶魔。"},{"en":"The soundtrack uses Doom-inspired riffs to make the fights feel more intense.","zh":"原声用了“Doom-inspired”的吉他段落，让战斗更热血。"}]},{"partOfSpeech":"adj.","definition":{"en":"Inspired by a sense of doom (gloom, impending disaster, or apocalyptic mood), especially in art, music, or writing.","zh":"受“末日感/不祥预感”（阴郁、灾难将至、末世氛围）启发的，常用于艺术、音乐或写作。"},"examples":[{"en":"The film’s Doom-inspired visuals make the city feel trapped and hopeless.","zh":"电影里“Doom-inspired”的画面让城市显得压抑、无望。"},{"en":"She writes Doom-inspired poems about climate anxiety and the future.","zh":"她写“Doom-inspired”的诗，主题是对气候焦虑与未来的担忧。"}]}],"synonyms":["DOOM-like","influenced by DOOM","apocalyptic","ominous","dark","grim"],"phonetic":"/ˈduːm ɪnˈspaɪrd/","extraExplanation":["“Doom-inspired”在网络语境里最常见的是指受经典FPS《DOOM》（1993）及其后续作品影响：高速移动、硬核战斗、夸张武器、地狱/恶魔元素，以及与重金属音乐相连的气质。","如果写作中不确定读者是否了解游戏，可以改用更通用的表达，如“DOOM-like shooter（像DOOM的射击游戏）”或“apocalyptic / ominous（末世感/不祥的）”。"]}
{"word":"doom-laden","summary":{"en":"An adjective meaning “full of doom,” suggesting bad outcomes are likely.","zh":"形容词：充满厄运感、预示不祥，暗示可能会有糟糕结果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Filled with a strong sense of doom; suggesting that something bad is going to happen.","zh":"充满末日感的；预示厄运的；带来不祥预感的。"},"examples":[{"en":"The report was doom-laden, warning of massive job losses.","zh":"这份报告充满末日感，警告将出现大规模失业。"},{"en":"His doom-laden tone made everyone anxious before the meeting.","zh":"他那种不祥的语气让大家在开会前都很紧张。"},{"en":"The novel opens with a doom-laden prophecy.","zh":"这部小说以一个充满厄运色彩的预言开篇。"}]}],"synonyms":["ominous","foreboding","gloomy","pessimistic","dire","apocalyptic"],"phonetic":"/ˈduːm ˌleɪdən/","extraExplanation":["“doom-laden”由 doom（厄运/毁灭）+ laden（装满的、负载的）构成，常用来形容“语言、语气、氛围、警告、预测”等带有强烈悲观与不祥暗示的东西。","它通常强调“感觉上像要出大事”的氛围，而不一定真的会发生；比起 plain 的 negative，更偏向“灾难将至”的戏剧性与沉重感。"]}
{"word":"doom-monger","summary":{"en":"A doom-monger is someone who spreads pessimistic, disaster-focused predictions, often alarmingly.","zh":"doom-monger 指总是散布悲观、灾难性预测、常常危言耸听的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who repeatedly spreads gloomy predictions or warnings about disaster, often in an exaggerated or alarmist way.","zh":"散布厄运/灾难言论的人；总爱危言耸听、唱衰的人。"},"examples":[{"en":"Ignore the doom-mongers—there’s no evidence the project is going to fail.","zh":"别理那些唱衰的人——没有证据表明这个项目会失败。"},{"en":"Some critics called him a doom-monger for predicting an economic collapse every year.","zh":"一些批评者称他为“危言耸听者”，因为他每年都预测经济会崩溃。"},{"en":"During the storm, doom-mongers on social media spread rumors that the whole city would be evacuated.","zh":"暴风雨期间，社交媒体上有些危言耸听的人散布谣言，说整座城市都要撤离。"}]}],"synonyms":["doomsayer","prophet of doom","alarmist","pessimist","Cassandra"],"phonetic":"/ˈduːm ˌmɑːŋɡɚ/","extraExplanation":["“doom-monger”由 doom（厄运、毁灭）+ monger（贩卖者、兜售者）组成，语气通常带批评，暗示对方在“兜售恐慌”或过度悲观。","近义词里有时会提到 Cassandra（卡珊德拉）：源自希腊神话中能预言却无人相信的女子；在英语里可指“总预言坏事的人”，但比 doom-monger 更带文学/文化色彩。"]}
{"word":"Doom-style","summary":{"en":"“Doom-style” means “in the fast, gritty FPS style of the game Doom,” and can also mean generally dark, intense, and aggressive in aesthetic.","zh":"“Doom-style”指“具有《毁灭战士》那种快节奏、粗粝的第一人称射击风格”，也可泛指阴暗强烈、侵略性很强的氛围/美学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Video games) In the style of the game Doom: fast-paced, old-school first-person-shooter action, often with a gritty sci‑fi/horror look.","zh":"（电子游戏）“毁灭战士（Doom）式”的：指具有《毁灭战士》风格的快节奏、老派第一人称射击体验，常带有粗粝的科幻/恐怖视觉氛围。"},"examples":[{"en":"The developer described it as a Doom-style shooter with nonstop movement.","zh":"开发者把它形容为一款“Doom 式”射击游戏，强调不停移动、节奏很快。"},{"en":"The soundtrack is heavy and aggressive—very Doom-style.","zh":"配乐厚重又强硬——非常“Doom 式”。"}]},{"partOfSpeech":"adj.","definition":{"en":"By extension, aggressively intense, dark, and violent in mood or aesthetics (even outside games).","zh":"引申义：在氛围或美学上极其强烈、阴暗、暴烈的（不一定只用于游戏）。"},"examples":[{"en":"The trailer has a Doom-style vibe: harsh lighting, monsters, and chaos.","zh":"预告片有种“Doom 式”的感觉：刺眼的光、怪物和混乱。"},{"en":"They wanted a Doom-style redesign—more metal, more grit.","zh":"他们想要一种“Doom 式”的改版——更金属、更粗粝。"}]}],"synonyms":["Doom-like","old-school FPS","retro shooter","boomer-shooter style","gritty sci-fi horror style"],"phonetic":"/ˈduːm staɪl/","extraExplanation":["“Doom-style”来自经典游戏《Doom》（1993），它奠定了早期FPS的许多标志：高速移动、贴脸战斗、强烈的暴力与压迫感、金属感音乐、迷宫式关卡与大量敌群。如今在玩家语境里，它常与“old-school/boomer shooter（复古射击）”等说法相关。","写法上常用连字符：Doom-style。也可写作“Doom-like”（更口语、强调“像”）或“in the style of Doom”（更正式）。"]}
{"word":"doomage","summary":{"en":"“Doomage” is an archaic/literary word meaning a (often harsh) judgment or sentence.","zh":"“doomage”是古语/文学用词，指（常带严厉意味的）审判或判决。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or literary) a judgment or sentence, especially a harsh or final one; condemnation.","zh":"（古语/文学用语）审判；判决（尤指严厉或最终的判决）；定罪。"},"examples":[{"en":"In the old tale, the king pronounced her doomage without a trial.","zh":"在那个古老的故事里，国王未经审判就宣判了她的定罪。"},{"en":"He feared the doomage of history more than the anger of his enemies.","zh":"他更害怕历史的审判，而不是敌人的愤怒。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) the act or process of judging; judgment as a general idea.","zh":"（罕见）裁决的行为或过程；泛指“评判/审判”这一概念。"},"examples":[{"en":"The poem reflects on doomage and mercy, asking who deserves forgiveness.","zh":"这首诗思考审判与怜悯，追问谁配得上宽恕。"}]}],"synonyms":["judgment","sentence","condemnation","verdict"],"phonetic":"/ˈduːmɪdʒ/","extraExplanation":["“doomage”由 doom（审判、厄运）+ 后缀 -age（表示“行为/结果/状态”）构成，整体带有强烈的古风与文学色彩，现代英语中非常少见。","在现代语境里，通常会用 judgment / sentence / condemnation 来表达更自然。若你在诗歌、奇幻小说或中古题材作品中看到它，多半是在营造“庄严、宿命、审判”的氛围。"]}
{"word":"doombook","summary":{"en":"Doombook usually refers to the Domesday Book, a famous 11th-century English land-and-tax record; rarely, it can mean any final, fate-deciding record.","zh":"Doombook 通常指英格兰11世纪著名的土地与税收登记《末日审判书》（Domesday Book）；少见情况下也可泛指“具有终局裁定意味”的记录/文件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) Another name for the Domesday Book: a detailed survey and record of land, property, and taxes in England, ordered by William the Conqueror in 1085–1086.","zh":"（历史）“末日审判书”的另一种称呼：由征服者威廉在1085–1086年下令编纂的英格兰土地、财产与税收的详尽调查与登记。"},"examples":[{"en":"The doombook recorded who owned land and what it was worth in 11th-century England.","zh":"《末日审判书》（doombook）记录了11世纪英格兰土地的归属及其价值。"},{"en":"Historians often consult the Domesday Book (sometimes called the doombook) to study medieval English society.","zh":"历史学家常查阅《末日审判书》（有时也称 doombook）来研究中世纪英格兰社会。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, rare) A record or document seen as final, unchangeable, or deciding someone’s fate.","zh":"（引申，少见）被认为“最终、不可更改”、仿佛决定命运的记录或文件。"},"examples":[{"en":"To him, the court file felt like a doombook—one line that could change everything.","zh":"在他看来，那份法庭档案像一本 doombook——一行字就可能改变一切。"},{"en":"The report became a kind of doombook for the project, ending further funding.","zh":"那份报告成了项目的“doombook”，使后续资金彻底断掉。"}]}],"synonyms":["Domesday Book","record","register","chronicle"],"phonetic":"/ˈduːmˌbʊk/","extraExplanation":["“doombook”多见于较早或文学性的拼写，通常指“Domesday Book”。这里的“doom”在古英语里常指“判决/裁断”（judgment），不只是现代英语里“厄运”的意思；因此“Domesday”带有“像末日审判一样终局、不可更改的裁定”的色彩。","拼写提示：现代更常用的标准说法是“Domesday Book”。“doombook”在当代日常英语中很少单独使用，更多作为历史语境或复古表达出现。"]}
{"word":"doomed","summary":{"en":"“Doomed” means certain to fail or end badly; it can also mean “fated,” and it is the past form of “doom” (to condemn or cause a bad end).","zh":"“doomed”表示“注定失败/结局很糟”，也可指“命中注定的”；同时是动词“doom”（宣判厄运/使走向坏结局）的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Certain to fail, suffer, or end badly; having no chance of success.","zh":"注定要失败/受苦/结局很糟的；没有成功希望的。"},"examples":[{"en":"Without enough water, the plants are doomed.","zh":"没有足够的水，这些植物注定会枯死。"},{"en":"The plan was doomed from the start because nobody agreed on the goal.","zh":"因为没人对目标达成一致，这个计划从一开始就注定失败。"},{"en":"They felt their relationship was doomed after months of constant arguments.","zh":"在几个月不断争吵后，他们觉得这段关系已注定无果。"}]},{"partOfSpeech":"adj.","definition":{"en":"Destined or fated (often used in a dramatic or formal tone).","zh":"命中注定的；在劫难逃的（常带戏剧性或较正式语气）。"},"examples":[{"en":"In the story, the hero is doomed to wander the earth alone.","zh":"在故事里，英雄命中注定要独自流浪人间。"},{"en":"It seemed like a doomed love, beautiful but impossible.","zh":"这像是一段注定无果的爱情，美却不可能。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “doom”: to condemn or cause someone/something to face a bad end.","zh":"“doom”的过去式/过去分词：宣判（某人）厄运；使（某事）走向糟糕结局。"},"examples":[{"en":"The judge doomed him to life in prison.","zh":"法官判他终身监禁。"},{"en":"One small mistake doomed the project.","zh":"一个小错误就让这个项目彻底失败。"}]}],"synonyms":["fated","destined","hopeless","ill-fated","condemned"],"phonetic":"/dumd/","extraExplanation":["“doomed”在日常英语里很常见的搭配是“be doomed to + 动词”，表示“注定要……/逃不过……”，例如：be doomed to fail（注定失败）、be doomed to repeat history（注定重蹈覆辙）。","语气上，“doomed”比“unlikely to succeed”更强烈、更有“宿命感/无可挽回”的感觉；在新闻、文学和影视里也常用来营造紧张或悲剧氛围。","相关近义表达可按语气强弱理解：likely to fail（可能失败，较中性）→ destined to fail（注定失败，较正式）→ doomed（注定失败，带强烈悲观或戏剧感）。"]}
{"word":"doomer","summary":{"en":"A “doomer” is an internet-slang word for someone who feels the future is doomed and is strongly pessimistic.","zh":"“doomer”是网络俚语，指对未来极度悲观、觉得注定要完蛋的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Internet slang) A person who feels hopeless about the future and believes society or life is heading toward disaster, often showing cynicism, pessimism, or resignation.","zh":"（网络俚语）指对未来非常悲观、觉得社会或人生注定走向崩坏的人；常带有犬儒、消极或“躺平式”的绝望感。"},"examples":[{"en":"After reading the news every day, he started calling himself a doomer.","zh":"他每天看新闻后，开始自称是个 doomer（悲观到绝望的人）。"},{"en":"She isn’t a doomer—she worries about the climate but still believes people can change things.","zh":"她不是 doomer——她担心气候问题，但仍相信人们能改变现状。"},{"en":"The forum is full of doomer posts about jobs and the economy.","zh":"那个论坛里全是关于工作和经济的 doomer 式悲观帖。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who declares or brings doom (rare; mostly replaced by other words).","zh":"宣告或带来“厄运/毁灭”的人（较少用；现代英语中很少这样说）。"},"examples":[{"en":"In old fantasy stories, the villain is sometimes described as a doomer of nations.","zh":"在一些旧奇幻故事里，反派有时会被描写成“带来国家毁灭的人”。"}]}],"synonyms":["pessimist","cynic","doom-and-gloomer","defeatist"],"phonetic":"/ˈduːmɚ/","extraExplanation":["“doomer”是近年网络文化里流行的标签，常见于讨论经济压力、社会问题、环境危机等话题的社群。它不一定等于临床意义的抑郁，但语气往往更“宿命论/无力感”。","常与“bloomer（乐观、相信未来会变好的人）”形成对比；也有人用“coomer”等押韵词做梗。使用时注意语境：对陌生人直接贴“doomer”可能显得不礼貌或带嘲讽。"]}
{"word":"doomful","summary":{"en":"Doomful means ominous or full of a sense that something bad is going to happen.","zh":"doomful 表示“不祥的、充满厄运预感的”，常用于文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of doom; suggesting disaster or a very bad outcome; ominous.","zh":"充满厄运的；预示灾难的；不祥的。"},"examples":[{"en":"The sky turned dark and doomful before the storm.","zh":"暴风雨来临前，天空变得阴沉而不祥。"},{"en":"His doomful warning made everyone nervous.","zh":"他那不祥的警告让大家都紧张起来。"},{"en":"The novel opens with a doomful mood that hints something terrible is coming.","zh":"小说以一种不祥的氛围开篇，暗示可怕的事情即将发生。"}]}],"synonyms":["ominous","foreboding","dire","baleful","ill-omened"],"phonetic":"/ˈduːmfəl/","extraExplanation":["“doomful”比较少见，带有文学/诗歌色彩；日常英语更常用“ominous”“foreboding”“dire”。","词源上由“doom（厄运/裁决）+ -ful（充满……的）”构成，因此语气往往比“sad（悲伤）”更重，强调“灾难将至”的感觉。"]}
{"word":"doomfully","summary":{"en":"“Doomfully” means ‘in an ominous or fatalistic way,’ suggesting an unavoidable bad ending. It’s rare in modern English.","zh":"“doomfully”表示“以不祥或宿命的方式”，暗示难以避免的坏结局；在现代英语中较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that suggests doom, ruin, or an unavoidable bad ending; ominously or fatalistically.","zh":"以带有“厄运/毁灭/难以避免的坏结局”的方式；不祥地、宿命地。"},"examples":[{"en":"He spoke doomfully about the company’s future, as if failure were certain.","zh":"他以一种不祥的口吻谈公司的未来，仿佛失败已成定局。"},{"en":"The news reports sounded doomfully pessimistic.","zh":"新闻报道听起来悲观得不祥。"}]}],"synonyms":["ominously","gloomily","fatalistically","darkly","bleakly"],"phonetic":"/ˈduːm.fəl.i/","extraExplanation":["“doomfully”非常少见，更常用的表达是“ominously（不祥地）”“gloomily（阴郁地）”“fatalistically（宿命地）”。写作中用它会显得更文学、更强调“注定要完”的感觉。","词根“doom”原意与“判决/命运”有关，在宗教或文学语境里常带有“无法逃避的结局”的色彩；因此“doomfully”通常不是指一般的“难过”，而是更强烈的“走向毁灭/终局”。"]}
{"word":"doomfulness","summary":{"en":"Doomfulness means a strong sense of doom or deep pessimism.","zh":"doomfulness 指强烈的厄运感或深度悲观情绪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling or quality of being full of doom; deep pessimism or a sense that something bad is likely to happen.","zh":"充满厄运感的情绪或特质；深度悲观，觉得坏事即将发生的感觉。"},"examples":[{"en":"There was a quiet doomfulness in his voice after the doctor’s call.","zh":"接到医生电话后，他的声音里有一种安静的厄运感。"},{"en":"The news report created a mood of doomfulness about the economy.","zh":"那篇新闻报道营造出一种对经济前景的悲观氛围。"},{"en":"Try not to let doomfulness shape your decisions; focus on what you can control.","zh":"别让厄运感左右你的决定；把注意力放在你能掌控的事情上。"}]}],"synonyms":["gloom","pessimism","foreboding","despair","doom-and-gloom"],"phonetic":"/ˈduːmfəlnəs/","extraExplanation":["“doomfulness”由 doom（厄运、毁灭）+ -ful（充满……的）+ -ness（名词后缀）构成，语气偏文学或评论性写作，日常口语中更常用“gloom”“pessimism”或“a sense of doom”。","它通常指一种持续的、笼罩性的情绪（氛围/预感），不一定是基于事实的“确定会发生”，更像“觉得要出事”的心理阴影。"]}
{"word":"dooming","summary":{"en":"“Dooming” usually means condemning something to a bad outcome; informally it can mean being very pessimistic, especially online.","zh":"“dooming”通常指让某事注定走向糟糕结局；在非正式/网络语境中也可指极度悲观、越看越丧。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “doom”) causing someone or something to fail, die, or have a very bad future; condemning.","zh":"（doom 的现在分词）使……注定失败/毁灭/结局悲惨；宣判（某人/某事）难逃厄运。"},"examples":[{"en":"Cutting the budget now is dooming the project to failure.","zh":"现在削减预算是在把这个项目推向失败。"},{"en":"He knew one mistake could be dooming his career.","zh":"他知道一次失误就可能断送他的职业生涯。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) being extremely pessimistic, especially online—expecting the worst and focusing on negative news or outcomes.","zh":"（非正式）极度悲观（常见于网络语境）；总往最坏处想、反复关注负面消息或结果。"},"examples":[{"en":"I was dooming all night after reading the headlines.","zh":"我看完新闻标题后整晚都在悲观焦虑。"},{"en":"Try not to spend your evening dooming on social media.","zh":"尽量别把晚上都花在社交媒体上“越刷越丧”。"}]}],"synonyms":["condemning","ruining","doomsaying","being pessimistic","catastrophizing"],"phonetic":"/ˈduːmɪŋ/","extraExplanation":["“dooming”在网络语境里常和“doomscrolling（刷负面新闻停不下来）”相关，表达一种被坏消息淹没、对未来失去希望的情绪。也常见于“doomer（丧系/末日悲观主义者）”文化。"]}
{"word":"doomlike","summary":{"en":"“Doomlike” usually means ‘in the style of the classic FPS game *Doom*’; less commonly, it can mean ‘having a dark, doom-filled mood.’","zh":"“doomlike”通常指“具有经典FPS《Doom/毁灭战士》风格”；较少情况下也可指“带有阴沉、末日般氛围”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In the style of the video game *Doom* (1993) or similar classic first-person shooters—fast-paced action, maze-like levels, lots of enemies, and quick weapon-based combat.","zh":"（游戏）具有《毁灭战士》（Doom，1993）或类似经典第一人称射击游戏风格的——节奏快、关卡像迷宫、敌人多、以武器战斗为主。"},"examples":[{"en":"The new indie shooter feels very doomlike, with fast movement and constant enemy waves.","zh":"这款新的独立射击游戏很有 doomlike 的味道：移动很快，敌人一波接一波。"},{"en":"I’m looking for doomlike games with keycards, hidden rooms, and heavy metal music.","zh":"我在找那种 doomlike 的游戏：有钥匙卡、隐藏房间，还有重金属配乐。"}]},{"partOfSpeech":"adj.","definition":{"en":"Dark, threatening, or full of a sense of doom; doom-like in mood (less common).","zh":"（较少见）阴沉、压迫、带有末日感或不祥预感的；像“doom（厄运/末日）”那样的氛围。"},"examples":[{"en":"The sky had a doomlike color before the storm.","zh":"暴风雨前，天空呈现出一种 doomlike 的阴沉颜色。"},{"en":"The movie’s soundtrack creates a doomlike mood.","zh":"这部电影的配乐营造出一种 doomlike 的压迫氛围。"}]}],"synonyms":["Doom-style","Doom-inspired","boomer-shooter-like","doomy (mood)","ominous (mood)"],"phonetic":"/ˈduːmˌlaɪk/","extraExplanation":["“doomlike”在网络与游戏评论里多指“像《Doom》那样的FPS”。有时也会看到更常用的近义说法：boomer shooter（复古快节奏FPS）、Doom-style / Doom-inspired（受《Doom》启发）。","作为情绪形容词（“阴沉不祥”）时，英语里更常说 “doomy”“ominous”“foreboding”。“doomlike”用于这种意义相对少见，但语义能被理解。"]}
{"word":"dooms","summary":{"en":"“Dooms” is the plural of “doom” (disasters/bad fates) or the third-person singular of the verb “doom” (to make something fail or end badly).","zh":"“Dooms”既可作“doom”的复数（厄运/灾难性的结局），也可作动词“doom”的第三人称单数（使注定失败或结局悲惨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) very bad outcomes or a feeling that something terrible will happen; disasters or fates.","zh":"（名词复数）厄运；灾难性的结局；对可怕事情将发生的预感。"},"examples":[{"en":"The novelist writes about wars, plagues, and other dooms that shape a society.","zh":"这位小说家写到了战争、瘟疫等种种灾难性的结局，它们塑造了一个社会。"},{"en":"After the storm warning, people talked about the dooms they feared most.","zh":"暴风雨预警后，人们谈论起自己最害怕的那些灾难。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) makes something likely to fail, suffer, or end badly; condemns to an unpleasant fate.","zh":"（动词第三人称单数）注定使……失败/受苦/结局悲惨；使……在劫难逃。"},"examples":[{"en":"A lack of funding dooms the project before it can start.","zh":"资金不足让这个项目在开始前就注定失败。"},{"en":"In many tragedies, a single mistake dooms the hero.","zh":"在许多悲剧中，一个错误就会让主人公走向悲惨结局。"}]}],"synonyms":["fates","disasters","catastrophes","ruins","condemns","destines"],"phonetic":"/dumz/","extraExplanation":["“doom”常见搭配：be doomed to do sth（注定要……），doom and gloom（悲观、消极的气氛），doomsday（世界末日/大难临头之日）。在新闻里，doom常用于强调严重后果：e.g., “rising costs could doom the plan.”"]}
{"word":"doomsayer","summary":{"en":"A doomsayer is someone who keeps predicting disasters or bad outcomes.","zh":"doomsayer 指总是预言灾难、唱衰未来的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who repeatedly says that something bad will happen; someone who predicts disaster or failure, often in an exaggerated way.","zh":"末日论者；总是宣称将有坏事发生的人；常夸张地预言灾难或失败的人。"},"examples":[{"en":"Some doomsayers predicted the economy would collapse, but it recovered quickly.","zh":"一些末日论者预测经济会崩溃，但它很快就恢复了。"},{"en":"Ignore the doomsayers and focus on what you can actually do today.","zh":"别理会那些唱衰的人，专注于你今天真正能做的事。"}]}],"synonyms":["prophet of doom","pessimist","alarmist","nay-sayer"],"phonetic":"/ˈduːmˌseɪər/","extraExplanation":["“Doom”原意是“厄运/毁灭”或“最终审判”，因此 doomsayer 字面上就是“宣告厄运的人”。现代语境里常用于媒体、政治、环保或经济讨论中，带有“过度悲观、危言耸听”的批评意味。","常见搭配：economic doomsayers（唱衰经济的人）、climate doomsayers（对气候极度悲观的人）、ignore the doomsayers（别听那些唱衰的人）。","近义词里，prophet of doom 更偏书面/修辞；pessimist 更中性，指总体悲观的人，不一定“预言灾难”。"]}
{"word":"doomsayers","summary":{"en":"Doomsayers are people who predict disaster or very negative outcomes.","zh":"doomsayers 指那些预测灾难、动辄唱衰的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who predict that something bad will happen (often exaggerating danger or focusing only on negative outcomes).","zh":"末日预言者；唱衰者（指总是预测会发生坏事的人，常常夸大风险或只关注负面结果）。"},"examples":[{"en":"During the economic slowdown, doomsayers warned that the whole system would collapse.","zh":"在经济放缓期间，唱衰者警告说整个体系会崩溃。"},{"en":"Some doomsayers on social media claimed the new law would ruin the country overnight.","zh":"一些社交媒体上的唱衰者声称新法律会在一夜之间毁掉国家。"},{"en":"Don’t listen only to doomsayers—look at the data and different opinions.","zh":"别只听唱衰者的话——看看数据和不同观点。"}]}],"synonyms":["prophets of doom","alarmists","pessimists","naysayers"],"phonetic":"/ˈduːmˌseɪ.ɚz/","extraExplanation":["“doomsayer”由“doom（厄运/毁灭）+ say（说）”构成，字面意思是“说厄运的人”。常用于新闻与评论语境，带有批评意味，暗示对方过度悲观或危言耸听。","与“pessimist（悲观主义者）”相比，“doomsayer”更强调公开传播“灾难将至”的预测，尤其在经济、政治、科技、环境（如气候变化）话题中常见。"]}
{"word":"doomsaying","summary":{"en":"Doomsaying means repeatedly predicting disaster or a very bad outcome, often in an overly pessimistic way.","zh":"doomsaying 指反复预言灾难或糟糕结局的言论，常带有过度悲观的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or habit of repeatedly saying that something bad will happen (often in an exaggerated or overly pessimistic way).","zh":"（经常带有夸张或过度悲观的）末日论；反复宣称坏事将发生的习惯或行为。"},"examples":[{"en":"There’s been a lot of doomsaying about the economy, but some indicators are improving.","zh":"关于经济的末日论很多，但一些指标正在好转。"},{"en":"Constant doomsaying can make people feel anxious and helpless.","zh":"不断的末日论会让人感到焦虑和无助。"}]}],"synonyms":["doom and gloom","apocalyptic talk","catastrophizing","alarmism","fearmongering"],"phonetic":"/ˈduːmˌseɪ.ɪŋ/","extraExplanation":["“Doomsaying”由“doom（厄运、毁灭）+ saying（说法）”构成，常用于新闻、社交媒体或公共讨论中，形容一种“总往最坏处想、总预言要完蛋”的说法。","语气通常带批评：说话者可能在提醒风险，但也可能被认为是在散布恐慌（fearmongering）。根据语境，它可以是中性（提出严重警告）或贬义（夸大其词）。","相关表达：doom and gloom（悲观论调）、apocalyptic predictions（末日式预测）、catastrophizing（把事情灾难化，偏心理学用语）。"]}
{"word":"doomscroll","summary":{"en":"“Doomscroll” means scrolling online for a long time, especially through bad news, even when it harms your mood.","zh":"“doomscroll”指在网上长时间刷信息，尤其不停刷负面新闻/内容，即使这会让情绪更糟。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to keep scrolling through social media or news feeds for a long time, especially reading negative or upsetting content even though it makes you feel worse","zh":"（在社交媒体或新闻信息流中）停不下来地一直刷，尤其是反复看负面、令人焦虑的内容，越看越难受"},"examples":[{"en":"I stayed up doomscrolling the news and couldn’t fall asleep.","zh":"我熬夜刷负面新闻，结果怎么也睡不着。"},{"en":"If you notice you’re doomscrolling, take a break and do something calming.","zh":"如果你发现自己在无脑刷负面内容，先停一下，做点能让自己平静的事。"},{"en":"During the outbreak, many people doomscrolled for hours every day.","zh":"在疫情暴发期间，很多人每天都会刷负面信息刷好几个小时。"}]}],"synonyms":["doomscrolling","hate-scroll","spiral (online)","binge-read bad news"],"phonetic":"/ˈduːmˌskroʊl/","extraExplanation":["这是一个较新的网络词（大约在2019–2020年前后更流行），由“doom（厄运、坏消息）+ scroll（滑动屏幕）”组合而成。常用于谈论手机使用习惯、焦虑、睡眠问题，以及信息过载。","语体偏口语、网络用语，常见搭配有：doomscrolling（名词/动名词用法，如“Too much doomscrolling.”）、go doomscrolling（去刷负面内容）、stop doomscrolling（别刷了）。"]}
{"word":"doomscroller","summary":{"en":"A doomscroller is someone who can’t stop scrolling through bad news online, even when it harms their mood.","zh":"doomscroller 指停不下來刷网络负面新闻的人，明知影响情绪也难以停止。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who repeatedly scrolls through negative or alarming news on social media or the internet (often for a long time, even though it makes them feel worse)","zh":"（常指在社交媒体/网络上）反复刷负面或令人焦虑的新闻的人；越刷越难受但停不下来的人"},"examples":[{"en":"I was such a doomscroller during the election week that I couldn’t sleep.","zh":"选举那周我一直在刷坏消息，几乎睡不着。"},{"en":"Don’t be a doomscroller—take a break from your feed and go outside.","zh":"别一直刷负面资讯了——离开信息流休息一下，出去走走。"}]}],"synonyms":["doomscrolling addict","news junkie (often negative)","anxious scroller"],"phonetic":"/ˈduːmˌskroʊlɚ/","extraExplanation":["“doomscroller”来自“doom（厄运/灾难）+ scroll（滚动屏幕）”。它常用于描述在手机上不停刷疫情、战争、灾害、政治争吵等内容的习惯，带有一点自嘲或提醒的语气。","相关表达：doomscroll（动词，指这种行为），doomscrolling（名词，指这种行为/习惯）。常见搭配：stop doomscrolling / late-night doomscrolling / a doomscrolling habit。"]}
{"word":"doomscrolling","summary":{"en":"Doomscrolling is repeatedly scrolling through negative news online, often in a way that increases stress or anxiety.","zh":"Doomscrolling 指反复刷负面新闻/内容的习惯，常让压力或焦虑加重。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit of continuously scrolling through bad, upsetting, or alarming news online (especially on social media), even when it makes you feel worse","zh":"（尤其在社交媒体上）不停刷负面、令人焦虑或震惊的新闻/内容，即使越看越难受也停不下来"},"examples":[{"en":"I started doomscrolling after the earthquake and couldn’t sleep.","zh":"地震后我开始不停刷灾情消息，结果睡不着。"},{"en":"Doomscrolling can make anxiety feel stronger.","zh":"不停刷负面新闻会让焦虑感更强。"},{"en":"Try setting a timer so you don’t fall into doomscrolling at night.","zh":"试着设个计时器，避免晚上陷入不停刷负面内容。"}]},{"partOfSpeech":"v.","definition":{"en":"to scroll online in this unhealthy way, repeatedly consuming negative or frightening content","zh":"（动词）以不健康的方式刷屏：反复浏览负面或令人恐惧的内容"},"examples":[{"en":"I doomscrolled for an hour and felt exhausted afterward.","zh":"我刷了一小时负面内容，之后觉得很疲惫。"},{"en":"When I’m stressed, I tend to doomscroll.","zh":"我压力大时就容易不停刷负面消息。"}]}],"synonyms":["compulsive news scrolling","negative news binge","stress-scrolling"],"phonetic":"/ˈduːmˌskroʊlɪŋ/","extraExplanation":["“doom-”表示“厄运/灾难”，与“scrolling（刷屏）”组合而来，多用于描述智能手机与社交媒体时代的信息焦虑。","它常与心理健康话题一起出现，语气偏口语、偏网络用语；正式写作中可改用“compulsive consumption of negative news（强迫性地摄入负面新闻）”。","相关表达：“doomscroll”（动词/名词）、“rage-scrolling（愤怒刷屏）”、“news detox / digital detox（新闻/数字戒断）”。"]}
{"word":"Doomsday","summary":{"en":"Doomsday means the end of the world, or (figuratively) a disastrous final outcome.","zh":"Doomsday 指“世界末日”，也可比喻“灾难性的终局/彻底失败”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the end of the world; a time when everything is destroyed, often in religious or dramatic predictions","zh":"世界末日；万物毁灭的时刻（常见于宗教或戏剧化的预言）"},"examples":[{"en":"Some people worry that a new virus could bring doomsday.","zh":"有些人担心一种新病毒会带来世界末日。"},{"en":"The movie shows a doomsday scenario after a giant asteroid hits Earth.","zh":"这部电影展现了小行星撞击地球后的末日情景。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a disastrous or final outcome for a person, plan, or organization","zh":"（比喻）某人、某计划或某机构的彻底失败/终结；大难临头"},"examples":[{"en":"Losing that contract was doomsday for the small company.","zh":"失去那份合同对那家小公司来说就是致命打击。"},{"en":"He acted like the exam was doomsday, but it was only one test.","zh":"他把考试当成世界末日一样，其实只是一次测验。"}]}],"synonyms":["apocalypse","end times","Judgment Day","catastrophe","disaster"],"phonetic":"/ˈduːmz.deɪ/","extraExplanation":["“Doomsday”源自“doom”（命运、判决）+“day”（日子），最初常指《圣经》中“审判日”（Judgment Day）。因此它带有强烈的宗教与末世想象色彩。","在现代英语里，它也常被媒体用来形容“灾难性预言”或“末日情绪”（doomsday predictions / doomsday mood）。相关常见搭配：doomsday scenario（末日情景）、doomsday clock（末日时钟，象征人类面临的全球风险）。"]}
{"word":"doomsday","summary":{"en":"Doomsday most commonly means the end of the world, and it can also mean Judgment Day or (informally) a very bad outcome.","zh":"Doomsday 最常指“世界末日”，也可指（宗教上的）“审判日”，口语里还可夸张地表示“很糟的结果”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the end of the world; a time when everything is destroyed (often connected to religious or apocalyptic ideas)","zh":"世界末日；万物毁灭之时（常与宗教或“启示录式”的想象相关）"},"examples":[{"en":"Some people fear that climate change could lead to doomsday if we do nothing.","zh":"有些人担心，如果我们什么都不做，气候变化可能会把世界推向末日。"},{"en":"In the movie, the hero tries to stop doomsday from happening.","zh":"在电影里，主角试图阻止末日发生。"}]},{"partOfSpeech":"n.","definition":{"en":"Judgment Day in Christianity: the day God judges all people","zh":"（基督教）审判日：上帝审判众人的日子"},"examples":[{"en":"In some Christian traditions, doomsday refers to the final judgment.","zh":"在一些基督教传统中，doomsday 指最终审判。"}]},{"partOfSpeech":"n.","definition":{"en":"used informally to mean a terrible disaster or the worst possible outcome (often exaggerated)","zh":"（非正式）指严重灾难或“最糟糕的结果”（常带夸张语气）"},"examples":[{"en":"Missing one deadline isn’t doomsday—just fix it and move on.","zh":"错过一次截止日期不是“世界末日”——补救一下继续前进就好。"}]}],"synonyms":["apocalypse","end times","Judgment Day","armageddon","catastrophe"],"phonetic":"/ˈduːmzˌdeɪ/","extraExplanation":["词源小知识：doom 原意与“判决、裁定”有关，doomsday 最早可指“审判之日”。后来在现代英语里常被扩展为“世界末日”或“灾难性终局”。","常见搭配：the doomsday scenario（最坏的情况/末日情景），a doomsday clock（“末日钟”，象征人类离全球灾难还有多近）。","文化提示：在新闻或社交媒体上，doomsday 有时带“危言耸听”的感觉；正式写作中可以用 catastrophic outcome / worst-case scenario 来更中性地表达。"]}
{"word":"doomsdayism","summary":{"en":"Doomsdayism is the belief or rhetoric that a catastrophic end is coming soon.","zh":"Doomsdayism 指相信或宣扬灾难性“末日”即将来临的末日主义/末日论调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief, talk, or teaching that the world (or society) is about to face a catastrophic end, often soon; a focus on “end times.”","zh":"末日主义；相信或宣扬世界（或社会）即将发生灾难性终结的观念或言论，常带有“末世/终末”色彩。"},"examples":[{"en":"Some online groups spread doomsdayism after every natural disaster.","zh":"每次自然灾害之后，一些网络群体就会传播末日主义言论。"},{"en":"The article criticizes doomsdayism and argues that long-term planning is still possible.","zh":"这篇文章批评末日主义，并认为长期规划依然可行。"},{"en":"Her speech avoided doomsdayism and focused on practical solutions.","zh":"她的演讲避免了末日论调，而是强调务实的解决方案。"}]}],"synonyms":["apocalypticism","end-times thinking","doom-mongering","catastrophism"],"phonetic":"/ˈduːmzˌdeɪˌɪzəm/","extraExplanation":["“doomsday”指“世界末日/审判日”，加上“-ism”通常表示“某种思想体系或倾向”（如 Buddhism, realism）。因此 doomsdayism 常用于描述一种持续的“末日叙事/末日心态”，不一定是正式宗教教义，也可指媒体或社交平台上的夸张悲观预测。","在英语语境中，它既可涉及宗教“末世论”（end-times beliefs），也可指对气候、经济、战争等议题的极端悲观判断。写作中常与“fear-mongering（制造恐慌）”“sensationalism（耸动主义）”对比使用。"]}
{"word":"doomsdays","summary":{"en":"“Doomsdays” is the plural of “doomsday,” meaning the end of the world (or figuratively, extreme disaster).","zh":"“doomsdays”是“doomsday”的复数，指世界末日（或比喻极端灾难/危机）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of doomsday: a time when the world is believed to end, or a moment of final judgment and destruction.","zh":"doomsday 的复数：指人们认为世界将终结的那一天；也可指“末日审判/毁灭”的时刻。"},"examples":[{"en":"Some people make predictions about future doomsdays.","zh":"有些人会预测未来的“末日”。"},{"en":"In movies, the heroes often try to stop multiple doomsdays.","zh":"在电影里，英雄常常要阻止一次又一次的“末日危机”。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) very serious or disastrous situations that feel like “the end of the world.”","zh":"（比喻）极其严重、灾难性的局面，让人感觉“像世界末日一样”。"},"examples":[{"en":"The news made it sound like economic doomsdays were coming.","zh":"新闻把情况说得像经济末日要来了一样。"},{"en":"For the team, the final minutes felt like doomsdays.","zh":"对这支队来说，最后几分钟简直像末日时刻。"}]}],"synonyms":["apocalypses","catastrophes","end times","day of judgment","worst-case scenarios"],"phonetic":"/ˈduːmzˌdeɪ/","extraExplanation":["“Doomsday”常和宗教或末世观念相关：在基督教语境中可联想到“最后审判”（Judgment Day）。现代英语里也常用于科幻/灾难片，泛指全球性灾难（如小行星撞地球、核战争等）。","用法提示：英语里更常说“doomsday”作单数概念（the doomsday scenario），或说“doomsday predictions”。“doomsdays”多见于强调“很多次/很多种末日情景”的语境。"]}
{"word":"doomsman","summary":{"en":"Doomsman is an old or literary word meaning a judge or someone who makes a final judgment.","zh":"Doomsman 是较古旧/文学化的词，指“法官或作出最终裁决的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A judge; someone who gives a final decision or judgment (often used in an old-fashioned or literary way).","zh":"（多为古旧或文学用语）法官；裁决者；作出最终判决的人。"},"examples":[{"en":"In the story, the old king acted as the doomsman of the dispute.","zh":"在故事里，那位老国王充当了纠纷的裁决者。"},{"en":"They accepted her as a fair doomsman who would listen to both sides.","zh":"他们接受她作为一位公正的裁决者，愿意听取双方意见。"}]},{"partOfSpeech":"n.","definition":{"en":"In some traditional contexts, an official who declares judgments or sentences (especially in older English or historical writing).","zh":"（传统语境）宣布判决或刑罚的官员（尤见于古英语或历史写作）。"},"examples":[{"en":"The doomsman read the sentence aloud in the crowded hall.","zh":"裁决官在拥挤的大厅里大声宣读了判决。"}]}],"synonyms":["judge","arbiter","referee","umpire","adjudicator"],"phonetic":"/ˈduːmz.mən/","extraExplanation":["“doomsman”来自“doom”的古义，原本更接近“judgment/判决”，而不是现代常见的“厄运、毁灭”。因此它常带有中世纪、史诗或传奇故事的氛围。","在现代日常英语里很少用，通常会用 judge、arbiter、referee、decision-maker 等更常见的词替代；如果在小说里看到，多半是为了营造古风或庄重语气。"]}
{"word":"doomstead","summary":{"en":"Doomstead is a rare, archaic word meaning a place or seat of judgment, used mainly in poetic or old-fashioned writing.","zh":"Doomstead 是罕见的古语，指“审判之所/审判席”，主要用于诗歌或仿古文体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, literary) A place or seat of judgment; a tribunal, especially in a solemn or poetic sense.","zh":"（古语/文学用语）审判之所；审判席；法庭（带庄严、诗意的语气）。"},"examples":[{"en":"In the poem, the guilty are summoned before the doomstead to answer for their deeds.","zh":"在诗中，罪人被召到“doomstead”（审判之所）面前，为自己的行为作答。"},{"en":"He spoke as if history itself were a doomstead, weighing every choice.","zh":"他说得仿佛历史本身就是一座审判席，衡量着每一个选择。"}]}],"synonyms":["judgment seat","tribunal","court","bar (of justice)"],"phonetic":"/ˈduːmˌstɛd/","extraExplanation":["“doomstead”由 doom（古义常指“判决、审判”，不仅是现代常见的“厄运”）+ stead（古英语中有“地点、位置”的意思）构成，字面是“审判之地”。","这是非常少见的古语，多见于诗歌或仿古文体。现代英语里更常用 judgment seat, tribunal, court 等表达。"]}
{"word":"doomster","summary":{"en":"A “doomster” is someone who constantly predicts disaster and speaks very pessimistically about the future.","zh":"“doomster”指总是预测灾难、对未来极度悲观的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who repeatedly predicts disaster or talks in an extremely pessimistic way about the future (often about society, the economy, or the environment).","zh":"末日论者；悲观预言者（常指总是预测社会、经济或环境将走向灾难的人）。"},"examples":[{"en":"Some doomsters say the economy will collapse every year.","zh":"有些末日论者每年都说经济会崩溃。"},{"en":"During wildfire season, doomsters on social media spread worst‑case predictions.","zh":"在野火季，社交媒体上的末日论者传播最坏情况的预测。"},{"en":"She isn’t a doomster—she acknowledges risks but also looks for solutions.","zh":"她不是末日论者——她承认风险，但也会寻找解决办法。"}]}],"synonyms":["pessimist","doomsayer","prophet of doom","alarmist (sometimes)"],"phonetic":"/ˈduːmstər/","extraExplanation":["“doomster”由“doom（厄运/毁灭）+ -ster（表示从事某事的人）”构成，常见于新闻与网络语境。","它常带有轻微贬义，暗示此人“过度悲观”或“总是唱衰”；比起更中性的“pessimist（悲观主义者）”，语气更尖锐。","在气候议题中也常见，如“climate doomster（气候末日论者）”；相关表达还有“doomscrolling（刷灾难新闻停不下来）”。"]}
{"word":"doomsters","summary":{"en":"Doomsters are people who often predict disaster or a very negative outcome.","zh":"Doomsters 指经常预测灾难或极度负面结局的人（唱衰者、末日论者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who repeatedly predicts or warns that something (especially the economy, society, or the environment) will end badly; a pessimistic “end-is-near” commentator","zh":"反复预言或警告某事（尤指经济、社会或环境）将以灾难告终的人；唱衰者、末日论者"},"examples":[{"en":"Some doomsters predicted a recession, but the economy kept growing.","zh":"一些唱衰者预测会出现经济衰退，但经济仍在增长。"},{"en":"Climate doomsters say it’s already too late to avoid catastrophe.","zh":"一些气候末日论者说，要避免灾难已经太晚了。"},{"en":"The article contrasts tech optimists with doomsters who fear job losses.","zh":"这篇文章对比了科技乐观派和担心失业的唱衰者。"}]}],"synonyms":["doomsayer","prophet of doom","pessimist","alarmist"],"phonetic":"/ˈduːmstər/","extraExplanation":["“doomster”来自“doom（厄运、毁灭）+ -ster（表示从事某事的人）”。常用于新闻评论语境，带有贬义或调侃色彩，暗示此人过度悲观或危言耸听。","常见搭配：economic doomsters（经济唱衰者）、market doomsters（市场悲观派）、climate doomsters（气候末日论者）。与“doomsday”相关，但“doomster”更强调“某种人/某类评论者”。"]}
{"word":"doomward","summary":{"en":"Doomward means “toward doom,” used mainly in poetic or old-fashioned writing.","zh":"doomward 意为“走向厄运”，主要用于诗歌或较古典的文风。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic, literary) Toward doom; in a way that leads to destruction or a tragic end.","zh":"（古语/文学用语）走向厄运的；朝着毁灭或悲剧结局发展的。"},"examples":[{"en":"In the tragedy, the hero moves doomward with every proud decision.","zh":"在这部悲剧里，主人公每一次傲慢的决定都让他更走向厄运。"},{"en":"The storm pushed the small boat doomward, away from safe harbor.","zh":"风暴把小船推向厄运，使它远离安全的港湾。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Moving or directed toward doom; doomed in direction.","zh":"（罕见）朝向厄运移动的；方向注定走向毁灭的。"},"examples":[{"en":"Their doomward journey felt inevitable.","zh":"他们那段走向厄运的旅程让人觉得无可避免。"}]}],"synonyms":["toward doom","doomed","heading for disaster","ill-fated"],"phonetic":"ˈduːmwɚd","extraExplanation":["“-ward”是英语里表示“朝向……方向/趋向……”的后缀（如 homeward, northward）。因此 doomward 字面就是“朝向 doom（厄运/毁灭）”。","该词非常少见，多出现在诗歌或带有古典气息的叙述中，用来营造宿命感、悲剧感。现代英语更常用 toward doom / doomed / heading for disaster 等表达。"]}
{"word":"doomwatcher","summary":{"en":"A “doomwatcher” is someone who closely follows or warns about disasters and negative outcomes, often with a pessimistic tone.","zh":"“doomwatcher”指密切关注或警告灾难与负面结果的人，常带悲观或危言耸听的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who closely follows, predicts, or warns about disasters and negative outcomes (often online), sometimes in a pessimistic or alarmist way.","zh":"（常用于网络语境）密切关注、预测或警告灾难与负面结局的人；有时带有悲观或危言耸听的意味。"},"examples":[{"en":"Some doomwatchers track every earthquake report and share worst-case scenarios.","zh":"有些“doomwatchers”会追踪每一条地震报道，并分享最坏的情景。"},{"en":"I try to limit doomwatching at night because it makes me anxious.","zh":"我尽量晚上少做“doomwatching”，因为那会让我焦虑。"},{"en":"During the storm season, doomwatchers filled the forums with warnings and maps.","zh":"在风暴季，“doomwatchers”在论坛里发满了警告和地图。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who watches or monitors signs of danger or collapse as a job or role (less common; more literal).","zh":"（较少见，更字面）负责监视危险或崩溃迹象的人（可指工作或职责）。"},"examples":[{"en":"The team assigned a doomwatcher to monitor the system for failure signals.","zh":"团队指派了一名“doomwatcher”来监测系统的故障信号。"},{"en":"In the story, a lone doomwatcher keeps watch from the tower.","zh":"在故事里，一名孤独的“doomwatcher”在塔上守望。"}]}],"synonyms":["doomsayer","alarmist","pessimist","catastrophizer","doomscroller"],"phonetic":"/ˈduːmˌwɑːtʃər/","extraExplanation":["“doomwatcher”不是最标准、最常见的词，更常见的相关表达是“doomscrolling（刷负面新闻停不下来）”“doomsayer（唱衰者/末日预言者）”。它通常带一点评价色彩：指过度关注灾难消息、不断“盯着坏消息看”的人。","“Doomwatch”也曾是英国BBC的科幻电视剧名（1970年代），讲的是监测环境与社会危机的组织；“doomwatcher”有时会让人联想到这类“监测危机的人”的概念。"]}
{"word":"doomy","summary":{"en":"Doomy means very gloomy or pessimistic, or having an ominous “something bad will happen” feeling.","zh":"Doomy 指非常阴郁/悲观，或带有“不祥、像要出事”的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling or seeming full of doom; very gloomy, hopeless, or pessimistic.","zh":"充满末日感的；非常阴郁、绝望、悲观的。"},"examples":[{"en":"After reading the bad news, he got really doomy about the future.","zh":"看完坏消息后，他对未来变得非常悲观、充满末日感。"},{"en":"The movie has a doomy atmosphere—dark skies, empty streets, and no easy answers.","zh":"这部电影的氛围很“末日”：阴沉的天空、空荡的街道，而且没有简单的答案。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suggesting that something bad is likely to happen; ominous.","zh":"不祥的；预示可能会发生坏事的。"},"examples":[{"en":"Those doomy headlines make everything sound worse than it is.","zh":"那些不祥的标题把一切都说得比实际更糟。"},{"en":"The clouds looked doomy, like a storm was coming.","zh":"乌云看起来很不祥，好像暴风雨要来了。"}]}],"synonyms":["gloomy","bleak","ominous","pessimistic","foreboding"],"phonetic":"/ˈduːmi/","extraExplanation":["“doomy”是由名词/动词“doom（厄运；注定失败）”加上形容词后缀“-y”构成，语气常偏口语，带一点夸张或情绪化色彩。","在日常表达中，“doomy”常用来形容一个人的心态（很悲观）或某种氛围/新闻风格（很压抑、很末日）。更正式的替换词有“gloomy”“bleak”“ominous”。"]}
{"word":"Doon","summary":{"en":"“Doon” is Scottish for “down,” and it’s also a proper name (notably the River Doon in Scotland).","zh":"“Doon”在苏格兰英语中相当于“down（向下）”，也可作专有名词（尤其指苏格兰的杜恩河）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Scottish English, informal) “down”; toward a lower place or position.","zh":"（苏格兰英语，非正式）“down”的方言拼写；向下、往较低处。"},"examples":[{"en":"Come doon the stairs carefully.","zh":"小心地下楼。"},{"en":"The sun went doon behind the hills.","zh":"太阳落到山后面去了。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name used for places (especially the River Doon in Scotland) and institutions (e.g., The Doon School in India).","zh":"专有名词：用于地名（尤其指苏格兰的杜恩河 River Doon）或机构名（如印度的杜恩学校 The Doon School）。"},"examples":[{"en":"They walked along the River Doon in Ayrshire.","zh":"他们沿着艾尔郡的杜恩河散步。"},{"en":"He studied at The Doon School.","zh":"他在杜恩学校就读。"}]}],"synonyms":["down"],"phonetic":"/dun/","extraExplanation":["“doon”常见于苏格兰口语/书面方言中，是“down”的拼写变体，常用来营造地域色彩。","苏格兰诗人罗伯特·彭斯（Robert Burns）在作品中常提到“The Banks o’ Doon”（杜恩河岸），使“Doon”带有一定文学与地方意象。"]}
{"word":"doon","summary":{"en":"“Doon” is Scots for “down,” and it can also be a Scottish place name (especially the River Doon).","zh":"“doon”在苏格兰方言中相当于“down（向下/坐下/落下）”，也可作苏格兰地名（尤指杜恩河）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Scots dialect) “down”: to a lower place or level; from a standing position to the ground.","zh":"（苏格兰方言）相当于“down”：向下、到较低处；（从站立）倒下到地面。"},"examples":[{"en":"He fell doon on the ice.","zh":"他在冰上摔倒在地。"},{"en":"Sit doon and have a cup of tea.","zh":"坐下喝杯茶吧。"},{"en":"The sun went doon behind the hills.","zh":"太阳落到山后面去了。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for places, especially the River Doon in Scotland (also seen in literature).","zh":"地名用法，尤其指苏格兰的杜恩河（River Doon），也常见于文学作品中。"},"examples":[{"en":"They walked along the River Doon in Ayrshire.","zh":"他们沿着艾尔郡的杜恩河散步。"},{"en":"The poem mentions the banks o’ Doon.","zh":"这首诗提到了“杜恩河畔”。"}]}],"synonyms":["down"],"phonetic":"/dun/","extraExplanation":["“doon”常见于苏格兰英语/苏格兰方言（Scots），在口语和文学里用来表现地方特色，常对应标准英语的“down”。","杜恩河（River Doon）因苏格兰诗人罗伯特·彭斯（Robert Burns）的作品而广为人知，例如《The Banks o’ Doon》（《杜恩河畔》）等，读到“Doon”时有时是在指这条河而不是“down”。"]}
{"word":"Doone","summary":{"en":"“Doone” is mainly a proper name (surname), especially known from the classic novel “Lorna Doone.”","zh":"“Doone”主要是专有名词（姓氏），最常见于经典小说《洛娜·杜恩》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname, best known from the novel title “Lorna Doone,” referring to the Doone family (a fictional clan/people).","zh":"姓氏；最著名来自小说《洛娜·杜恩》（Lorna Doone），指书中的“杜恩家族/杜恩族人”（虚构人物/群体）。"},"examples":[{"en":"Have you read Lorna Doone?","zh":"你读过《洛娜·杜恩》吗？"},{"en":"In the story, the Doones are feared by local villagers.","zh":"在故事里，杜恩家族让当地村民害怕。"}]}],"synonyms":["(proper name)"],"phonetic":"/duːn/","extraExplanation":["“Doone”在日常英语里并不是常用词，主要作为专有名词出现。最常见的文化语境是英国作家 R. D. Blackmore 的小说《Lorna Doone》（1869），背景设在17世纪英格兰西南部（Exmoor 一带），融合了爱情、冒险与乡土传说。","如果你本来想输入的是动词“do”（做）或“done”（完成了），告诉我句子语境，我可以帮你确认拼写与用法。"]}
{"word":"dooputty","summary":{"en":"“Dooputty” is not a standard English word; its meaning is context-dependent.","zh":"“dooputty”不是标准英语词；含义取决于具体语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or invented word with no widely accepted meaning in English; it may be used as a playful sound, a nickname, or a made-up label online.","zh":"非标准或自造词，在英语中没有公认固定含义；可能作为俏皮的拟声、昵称或网络自创标签使用。"},"examples":[{"en":"“Dooputty” isn’t in most dictionaries, so its meaning depends on the context you saw it in.","zh":"“dooputty”在大多数词典里找不到，所以它的意思要看你在哪里、什么语境下看到的。"},{"en":"He used “dooputty” as a silly nickname for his friend.","zh":"他把“dooputty”当作给朋友起的一个搞笑昵称。"}]}],"synonyms":["(none—invented/nonstandard)"],"phonetic":"/ˈduːˌpʌti/","extraExplanation":["这个词看起来像是把“doo-”这种俏皮音节和“putty（腻子/橡皮泥）”拼在一起的自造词，但英语里并没有固定用法。","如果你能提供一句原文（或截图/来源平台），我可以根据上下文判断它是在骂人、开玩笑、指某种物品，还是只是用户名。","若你想表达“傻乎乎的人/东西”的语气，英语里更常见的口语有：silly, goofy, doofus（偏口语，可能略冒犯，慎用）。"]}
{"word":"door","summary":{"en":"“Door” most commonly means a door you open and close; it can also mean an entrance or an opportunity in a figurative sense.","zh":"“door”最常见意思是“门”；也可引申为“入口/机会（机会之门）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A movable barrier that you open and close to enter or leave a room, building, car, etc.","zh":"门；用于进出房间、建筑、汽车等的可开合的隔挡。"},"examples":[{"en":"Please close the door quietly.","zh":"请把门轻轻关上。"},{"en":"Someone is knocking at the door.","zh":"有人在敲门。"},{"en":"The front door is locked.","zh":"前门锁上了。"}]},{"partOfSpeech":"n.","definition":{"en":"An entrance or a way in; a chance or opportunity (often used in phrases).","zh":"入口；通道；（常用于短语）机会、门路。"},"examples":[{"en":"Learning English can open the door to better jobs.","zh":"学习英语能为更好的工作打开大门。"},{"en":"This internship is a door into the industry.","zh":"这份实习是进入这个行业的门路。"}]}],"synonyms":["entrance","gateway","opening"],"phonetic":"/dɔr/","extraExplanation":["常见搭配：open/close the door（开/关门），lock/unlock the door（锁上/打开门锁），answer the door（去应门/开门接客）。","常见比喻用法：open the door to sth（为……打开机会之门）；close/shut the door on sth（断绝……的可能性）。","在文学和日常表达中，“door”常象征“界限、选择、转折点”（例如“a door to a new life”表示人生新阶段）。"]}
{"word":"door bell","summary":{"en":"a bell by a door used to signal a visitor","zh":"门口用来提示来访者的铃/装置"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device by a door that makes a ringing sound to let people inside know someone is outside","zh":"门口用来发出铃声、提醒屋内有人来访的装置（门铃）"},"examples":[{"en":"I rang the doorbell, but no one answered.","zh":"我按了门铃，但没人应门。"},{"en":"The doorbell woke the baby up.","zh":"门铃把宝宝吵醒了。"}]},{"partOfSpeech":"v.","definition":{"en":"to ring the bell at someone’s door to get their attention","zh":"按门铃；按（某人）门口的铃来引起注意"},"examples":[{"en":"Please doorbell me when you arrive.","zh":"你到了以后请按门铃。"},{"en":"We doorbelled the neighbor to return the package.","zh":"我们按了邻居的门铃去归还包裹。"}]}],"synonyms":["bell","buzzer","chime"],"phonetic":"/ˈdɔrˌbɛl/","extraExplanation":["拼写上更常见的标准形式是 doorbell（合写）。也有人写作 door bell（分开），但在现代英语里合写更普遍。","美式英语里常说 ring the doorbell 或 press the doorbell；英式英语也常说 ring the doorbell / ring the bell。"],"etymology":"由 door（门）+ bell（铃）组成的复合词，字面意思就是“门上的铃”。作为名词用法很常见；动词用法存在但较口语、较少见，日常更常说 ring the doorbell。","mnemonic":["door + bell = 门 + 铃：看到就能拆开理解，“门上的铃”。","联想：听到“叮咚”就是门铃在响；中文里也常用拟声词“叮咚”对应 doorbell。"]}
{"word":"Door Gods","summary":{"en":"protective figures placed on doors to guard a home, especially in Chinese tradition","zh":"（尤指中国民俗中的）门神；贴在门上用来守护家宅、驱邪避祸的形象"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"deities or protective figures placed on doors (especially in Chinese culture) to guard a home and keep away evil or bad luck; often shown as paired warriors on posters or paintings","zh":"门神；贴在门上的守护神/守护形象（尤指中国文化中），用来保家宅平安、驱邪避祸；常成对出现（多为武将形象）"},"examples":[{"en":"Before Lunar New Year, many families replace the Door Gods on their front door.","zh":"春节前，许多家庭会更换大门上的门神。"},{"en":"The old Door Gods were faded, but you could still see the two warriors.","zh":"旧门神已经褪色，但仍能看出两位武将的轮廓。"},{"en":"In the story, the Door Gods protect the village from wandering spirits at night.","zh":"故事里，门神在夜晚守护村庄，防止游魂作祟。"}]}],"synonyms":["door guardians","guardian deities","household gods","protective spirits"],"phonetic":"/dɔr ɡɑdz/","extraExplanation":["“门神”常被贴在大门两扇门上，因此多用复数 Door Gods。传统题材里常见成对武将（如秦琼、尉迟恭等）或其他守护形象，寓意镇宅、辟邪、纳福。","语境提示：在英文介绍中国文化时，这个词通常作为专有文化名词使用；若要更通俗，也可说 protective door deities 或 traditional Chinese door guardians。"],"etymology":"直译自中文“门神”：门=door，神=gods。英语中多用于介绍中国民俗时，常写作 Door Gods 或 door gods（也可见 door guardians）。","mnemonic":["门神=“门（door）+神（gods）”，直接对照记忆。","想象两位“守门的神”站在门上：因为是一对，所以用复数 Door Gods。"]}
{"word":"door handle","summary":{"en":"A handle used to open or close a door.","zh":"用于开关门的把手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A handle on a door that you turn, push down, or pull to open or close the door.","zh":"门上的把手（用于转动、下压或拉动来开关门的部件）。"},"examples":[{"en":"The door handle is loose, so the door won’t open easily.","zh":"门把手松了，所以门不太好开。"},{"en":"Please wipe the door handle after you come in.","zh":"进来后请擦一下门把手。"}]}],"synonyms":["doorknob","door knob","door lever","lever handle","pull handle"],"phonetic":"/ˈdɔɹ ˌhændl/","extraExplanation":["常见类型：doorknob（圆形门把/门球，通常旋转开门）、lever handle（压杆式把手，常见于公共场所）、pull handle（拉手，多用于推拉门或需要“拉”开的门）。","相关搭配：turn the handle（转动把手）、press down the handle（下压把手）、grab the handle（抓住把手）、the handle came off（把手脱落了）。"],"etymology":"由 door（门）+ handle（把手）组合而成的复合名词；表示“门上用来开关的把手”。","mnemonic":["把它拆开记：door=门，handle=把手；合起来就是“门把手”。","联想：开门时手一定会“handle（动手处理）”门上的东西——就是门把手。"]}
{"word":"door key","summary":{"en":"A key for opening a door; by extension, a means of access.","zh":"开门用的钥匙；引申为获得进入或解决问题的方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A key used to lock or unlock a door (especially a house or room).","zh":"门锁钥匙；用于开门或锁门的钥匙（尤指房门、房间门）。"},"examples":[{"en":"Do you have the door key, or should I call the landlord?","zh":"你有门钥匙吗？不然我就得给房东打电话了。"},{"en":"She hid the door key under the flowerpot.","zh":"她把门钥匙藏在花盆下面。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Something that gives access to a place, opportunity, or solution.","zh":"（比喻）通向某处、机会或解决办法的“钥匙”。"},"examples":[{"en":"Trust is the door key to a healthy relationship.","zh":"信任是健康关系的“钥匙”。"},{"en":"Learning basic phrases can be the door key to traveling more confidently.","zh":"学会一些基础短语会成为你更自信旅行的“钥匙”。"}]}],"synonyms":["house key","front door key","key","passkey","master key","access key","key to"],"phonetic":"/ˈdɔɹ ˌki/","extraExplanation":["用法提示：在口语里常说“Do you have your keys?”（你带钥匙了吗？）不一定会特地说“door key”。如果要强调是家门钥匙，可以说“house key”或“front door key”。"],"etymology":"“door key”是由“door（门）+ key（钥匙）”组成的名词短语，字面意思就是“门的钥匙”。日常英语更常直接说“key”或更具体的“house key / front door key”。","mnemonic":["把它拆开记：door=门，key=钥匙 → “开门的钥匙”。","联想中文：“门钥匙”就是“door key”，一一对应，几乎不用绕。"]}
{"word":"door money","summary":{"en":"an entrance fee paid at the door of an event","zh":"在活动门口支付的入场费"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money paid at the entrance to an event (a cover charge or admission fee), often collected at the door","zh":"在活动入口处支付的费用（入场费/门票钱），通常在门口收取"},"examples":[{"en":"There’s a $10 door money charge, but you don’t need to buy a ticket online.","zh":"门口收10美元入场费，但你不需要在网上买票。"},{"en":"We didn’t have enough cash for door money, so we couldn’t get in.","zh":"我们现金不够付门口入场费，所以进不去。"},{"en":"The band gets a percentage of the door money.","zh":"乐队能拿到门票收入（门口收的钱）的一部分。"}]}],"synonyms":["cover charge","admission","entry fee","door charge"],"phonetic":"/dɔr ˈmʌni/","extraExplanation":["在美国英语里更常见的说法是 cover charge（常用于酒吧/俱乐部）或 admission (fee)。door money 常见于小型演出、俱乐部现场，强调“在门口当场付”。","在音乐/演出行业语境中，door money 也可以指整场“门票收入”，比如按比例分给乐队或主办方。"],"etymology":"由 door（门口）+ money（钱）构成的口语表达，字面意思是“门口收的钱”，引申为现场入场费/门票收入。","mnemonic":["把它想成“门口（door）交的钱（money）= 入场费”。","联想中文“门票钱/门口收钱”，直接对应含义。"]}
{"word":"door to","summary":{"en":"an entrance leading to a place or, figuratively, a way to an opportunity","zh":"通往某处的入口；（比喻）通向机会或目标的途径"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the entrance or access point that leads into a place; used to show where a door leads","zh":"通往某处的门口；用于说明这扇门通向哪里"},"examples":[{"en":"Is this the door to the kitchen?","zh":"这是通往厨房的门吗？"},{"en":"The door to the balcony is locked.","zh":"通往阳台的门锁着。"}]},{"partOfSpeech":"phrase","definition":{"en":"a way to reach a goal or opportunity; a “gateway” in a figurative sense","zh":"（比喻）通向目标或机会的途径；“通往……之门”"},"examples":[{"en":"Education can be the door to a better life.","zh":"教育可以是通向更好生活的途径。"},{"en":"This internship is a door to new opportunities.","zh":"这份实习是通向新机会的一扇门。"}]}],"synonyms":["entrance to","way into","access to","gateway to","path to"],"phonetic":"/dɔr tu/","extraExplanation":["常见搭配：the door to + 地点/抽象名词（the door to the bathroom / the door to success）。","容易混淆：next door to 表示“紧挨着……（隔壁）”，door-to-door 是复合形容词/副词，表示“挨家挨户的/上门的”。"],"etymology":"“door”来自古英语 *duru/dor*（门、入口），“to”来自古英语 *tō*（朝向、到）。合在一起就是“通向……的门/通道”。","mnemonic":["把它理解成固定结构：door（门）+ to（通往）= “通往……的门”。","联想中文常说的“通往成功的大门”，英语就是 the door to success。"]}
{"word":"door to door","summary":{"en":"from one home or business to another; direct pickup-and-delivery service","zh":"挨家挨户地；门到门的接送/配送服务"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"moving from one house, apartment, or business to another to sell, deliver, or ask for something","zh":"挨家挨户地；逐户上门地（通常指推销、派送或征询）"},"examples":[{"en":"They sell vacuum cleaners door to door.","zh":"他们挨家挨户地推销吸尘器。"},{"en":"The charity collected donations door to door.","zh":"这个慈善机构挨家挨户募捐。"},{"en":"We offer door-to-door delivery in this area.","zh":"我们在这个地区提供上门送货服务。"}]},{"partOfSpeech":"adj.","definition":{"en":"a service that picks you up at your starting point and takes you directly to your destination","zh":"门到门的服务（从出发地接送到目的地）"},"examples":[{"en":"The shuttle provides door-to-door service to the airport.","zh":"这趟接驳车提供到机场的门到门服务。"},{"en":"Door-to-door shipping is more convenient but costs more.","zh":"门到门运输更方便，但费用更高。"}]}],"synonyms":["house to house","from house to house","doorstep","direct"],"phonetic":"/ˌdɔɹ tə ˈdɔɹ/","extraExplanation":["写作上常见两种形式：作副词多写“door to door”（We went door to door.）；作形容词修饰名词时更常写连字符“door-to-door”（door-to-door service）。","语境提示：在北美文化中，door-to-door sales（上门推销）很常见，也可能让人觉得打扰；如果你在电话或短信中表达，常加礼貌说明，如“We won’t disturb you if you’re not interested.”（如果您没兴趣我们不会打扰）。"],"etymology":"源自“door（门）+ to + door（门）”的字面组合，强调从一扇门到另一扇门的逐户移动；19世纪起常用于描述上门推销与逐户拜访。","mnemonic":["把它想成“从这家门口到下一家门口”，画面就是“挨家挨户”。","中文联想：记成“门→门”，就是“门到门/逐户上门”。"]}
{"word":"door-free","summary":{"en":"“Door-free” means having no door (or having the door removed), often used to describe an open design.","zh":"“door-free”表示“无门的/门被拆掉的”，常用于描述开放式设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having no door; designed or left open without a door (often used in product descriptions or building design).","zh":"无门的；没有安装门的；（常用于产品或建筑设计说明）采用开放式、无需门的设计。"},"examples":[{"en":"The bathroom has a door-free shower to make it easier to enter.","zh":"这个浴室有一个无门淋浴间，进出更方便。"},{"en":"They chose a door-free entryway to create a more open feeling.","zh":"他们选择了无门的入口，让空间感觉更通透。"}]},{"partOfSpeech":"adj.","definition":{"en":"with door(s) removed temporarily (for repair, moving, filming, etc.).","zh":"（临时）拆掉门的；把门取下的（用于维修、搬运、拍摄等）。"},"examples":[{"en":"The cabinet is door-free right now while we repaint it.","zh":"我们在重新上漆，所以这个柜子现在暂时是没有门的。"},{"en":"The room looked strange, door-free during the renovation.","zh":"装修期间房间看起来很奇怪，门都拆掉了。"}]}],"synonyms":["without a door","doorless","open (design)","no-door"],"phonetic":"/ˈdɔɹ friː/","extraExplanation":["“door-free”不是一个特别固定、常见的词，更多见于广告文案或设计说明（例如 door-free shower / door-free entry）。在日常口语里也可以用更自然的表达：“without a door / no door / open (entry/shower)”。","书写上常用连字符（door-free）来强调它是一个复合形容词；放在名词前更常见：a door-free shower / door-free access。"]}
{"word":"door-like","summary":{"en":"“Door-like” means resembling a door.","zh":"“door-like”表示“像门的；类似门的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a door in shape, size, or function (often meaning “having a door-like opening or panel”).","zh":"像门的；具有门的形状、大小或功能的（常指“有类似门的开口或面板”）。"},"examples":[{"en":"The cabinet has a door-like panel that swings open from the side.","zh":"这个柜子有一块像门一样的面板，可以从侧面打开。"},{"en":"A door-like opening led into the small storage room.","zh":"一个像门一样的开口通向小储藏室。"}]}],"synonyms":["door-shaped","door-style","panel-like"],"phonetic":"/ˈdɔɹˌlaɪk/","extraExplanation":["“door-like”是由名词door（门）+ 后缀-like（像……的）构成的形容词，通常用于描述外形或用途“像门一样”。在日常口语中也常用更自然的表达，比如“a door-shaped opening（门形开口）”或“a door-style panel（门式面板）”。"]}
{"word":"door-shaped","summary":{"en":"“Door-shaped” means shaped like a door—usually a tall rectangle.","zh":"“door-shaped”表示“门形的”，指形状像门（通常是高而窄的长方形）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a door (typically a tall rectangle).","zh":"门形的；像门一样形状的（通常指高而窄的长方形）。"},"examples":[{"en":"The niche in the wall was door-shaped, but it wasn’t an entrance.","zh":"墙上的壁龛是门形的，但并不是入口。"},{"en":"She cut a door-shaped piece of cardboard for the stage set.","zh":"她为舞台布景剪了一块门形的硬纸板。"},{"en":"A door-shaped shadow fell across the floor.","zh":"地板上落下一道门形的影子。"}]}],"synonyms":["doorlike","rectangular (often)","door-form"],"phonetic":"/ˈdɔr ʃeɪpt/","extraExplanation":["“door-shaped”是常见的英语复合形容词结构：名词 + shaped（……形状的）。写作时通常加连字符，尤其放在名词前作定语（a door-shaped window）。放在系动词后作表语时也常见（The window is door-shaped）。","类似表达：heart-shaped（心形的）、L-shaped（L形的）、U-shaped（U形的）、bottle-shaped（瓶形的）。如果是字母或数字形状，常写作“L-shaped / 7-shaped”。"]}
{"word":"door-slammed","summary":{"en":"Door-slammed describes something shut with a loud force, or (figuratively) a sudden, firm rejection or end.","zh":"Door-slammed 指被用力大声关上；也可比喻突然、明确的拒绝或终止。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shut forcefully and noisily (used to describe a door or something like a door).","zh":"（门或类似门的东西）被用力、发出很大声响地关上。"},"examples":[{"en":"The door was door-slammed behind him when he left.","zh":"他离开时，门在他身后被“砰”地一声关上了。"},{"en":"A door-slammed entrance can feel rude in a quiet room.","zh":"在安静的房间里，“砰”地关门式的进入会让人觉得很无礼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suddenly and firmly rejected or ended (figurative, often about chances, plans, or relationships).","zh":"（比喻）突然且明确地被拒绝或被终止（常指机会、计划或关系）。"},"examples":[{"en":"After the interview, it felt like the opportunity was door-slammed.","zh":"面试后，我感觉机会被“当面关门”了。"},{"en":"Negotiations became tense, and the deal was door-slammed in one meeting.","zh":"谈判变得紧张，这笔交易在一次会议中就被直接终止了。"}]}],"synonyms":["slammed shut","shut forcefully","abruptly rejected","shut down"],"phonetic":"/dɔɹ slæmd/","extraExplanation":["“door-slammed”常见于写作或新闻式表达，强调“突然、强硬、不给余地”的感觉。更常见的口语说法是：slam the door / the door slammed / have the door slammed in your face（被当面拒绝）。","在文学或叙事中，关门声常用来表现愤怒、决裂或紧张气氛：比如“the door slammed”比“the door closed”更有情绪与冲击力。"]}
{"word":"door-to-door","summary":{"en":"Door-to-door means visiting each house, often for sales, donations, or outreach.","zh":"door-to-door 指挨家挨户逐家拜访，常用于推销、募捐或宣传。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Going from one house or building to the next, usually to sell something, ask for support, or deliver information.","zh":"挨家挨户地（通常指为了推销、募捐或宣传而逐户拜访）。"},"examples":[{"en":"She got a job doing door-to-door sales.","zh":"她找到了一份挨家挨户推销的工作。"},{"en":"Volunteers went door-to-door to share information about the election.","zh":"志愿者挨家挨户宣传选举信息。"},{"en":"The charity collected donations door-to-door.","zh":"慈善机构挨家挨户募集捐款。"}]},{"partOfSpeech":"adv.","definition":{"en":"From one home to another; by visiting each house in an area.","zh":"逐户地；挨家挨户地（通过逐家拜访的方式）。"},"examples":[{"en":"They traveled door-to-door offering free safety checks.","zh":"他们挨家挨户提供免费的安全检查。"},{"en":"He went door-to-door looking for his lost dog.","zh":"他挨家挨户寻找走失的狗。"}]}],"synonyms":["house-to-house","from door to door","in-person outreach"],"phonetic":"/ˌdɔr tə ˈdɔr/","extraExplanation":["“door-to-door”常用于“door-to-door sales（上门推销）”“door-to-door service（到府服务/上门服务）”“go door-to-door（挨家挨户走访）”。在一些国家，上门推销或拉票很常见，但也可能让住户感到被打扰；写作或口语中可用更中性的说法，如“in-person outreach（面对面走访）”。","连字符写法：作形容词放在名词前时通常加连字符（door-to-door sales）；作副词时也常见连字符（go door-to-door），但有时也会写作“door to door”。"]}
{"word":"door-to-door household survey","summary":{"en":"An in-person survey done by visiting homes one by one.","zh":"挨家挨户上门进行的入户调查。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A survey that is conducted by visiting homes one by one and asking residents questions in person.","zh":"通过挨家挨户上门、面对面向住户提问来进行的调查。"},"examples":[{"en":"The city carried out a door-to-door household survey to understand recycling habits.","zh":"市政府开展了挨家挨户的入户调查，以了解居民的回收习惯。"},{"en":"Interviewers went door to door to complete the household survey before the deadline.","zh":"调查员挨家挨户走访，在截止日期前完成入户调查。"},{"en":"Because internet access was limited, they used a door-to-door household survey instead of an online form.","zh":"由于网络条件有限，他们采用上门入户调查，而不是在线问卷。"}]}],"synonyms":["household survey","door-to-door survey","in-home survey","house-to-house survey","field survey"],"phonetic":"/ˌdɔɹ tə ˈdɔɹ ˈhaʊsˌhoʊld ˈsɝːˌveɪ/","extraExplanation":["door-to-door 强调“逐户上门”的方式；household survey 强调“以住户/家庭为单位”的调查对象。合在一起就是“以住户为单位的上门调查”。","在一些正式语境中也会写作 door-to-door household survey 或 door-to-door household questionnaire，常见于政府统计、学术研究与NGO项目报告。"],"etymology":"由三个常见表达组合而成：door-to-door（“挨家挨户/上门”）+ household（“家庭/住户”）+ survey（“调查”）。常用于人口普查、公共卫生、市场调研等需要覆盖居民的场景。","mnemonic":["door（门）→ 上门；to-door（到门）→ 挨家；合起来 door-to-door = 挨家挨户。再加 household（住户）+ survey（调查）= 入户调查。","把它拆开记：方式（door-to-door）+ 对象（household）+ 任务（survey）。"]}
{"word":"door-to-door interviews","summary":{"en":"home visits to interview residents","zh":"挨家挨户上门访谈"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Interviews conducted by visiting people at their homes, going from one house to another in a neighborhood.","zh":"挨家挨户进行的上门访谈；访问者逐户到住户家中进行采访或问卷。"},"examples":[{"en":"The researchers used door-to-door interviews to reach residents who don’t use the internet.","zh":"研究人员用上门访谈来接触不使用互联网的居民。"},{"en":"Door-to-door interviews can provide detailed answers, but they take more time and staff.","zh":"上门访谈能获得更详细的回答，但更耗时也更费人力。"},{"en":"During the election, volunteers conducted door-to-door interviews to understand local concerns.","zh":"选举期间，志愿者挨家挨户访谈以了解当地民众关心的问题。"}]}],"synonyms":["house-to-house interviews","in-home interviews","home interviews","field interviews","face-to-face interviews"],"phonetic":"/ˌdɔr tə ˈdɔr ˈɪn.t̬ɚ.vjuz/","extraExplanation":["语境提示：在研究/民调里，这种方式常被视为一种“实地入户调查”，优点是覆盖不常上网的人群、能获得更高质量的解释性回答；缺点是成本高、受天气与社区安全影响，也更容易受到“受访者当场压力”的影响。","写法：可以写作 door-to-door interviews（复数更常见），也可说 conduct door-to-door interviews / do door-to-door interviewing。"],"etymology":"“door-to-door”字面意思是“从一扇门到另一扇门”，早期常用于推销或募捐等逐户拜访的活动；后来也广泛用于民调、社会调查等“上门”的工作方式。“interview(s)”表示“访谈/采访”。","mnemonic":["把 door-to-door 想成中文“挨家挨户/上门”；interviews 就是“访谈”。合起来就是“上门挨家挨户访谈”。","记忆画面：手拿夹板/问卷，从一户门口走到下一户门口。"]}
{"word":"door-to-door service","summary":{"en":"service provided at customers’ homes rather than at a shop or office","zh":"到顾客家（或公司）办理/提供的上门服务"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a service where staff visit each customer’s home (or office) to deliver, sell, pick up, or provide help, instead of the customer going to a store or office","zh":"上门服务；工作人员到顾客家（或公司）提供配送、推销、取件或办理业务，而不是顾客自己去门店/机构"},"examples":[{"en":"We offer door-to-door service, so you don’t have to carry heavy boxes.","zh":"我们提供上门服务，所以你不用搬重箱子。"},{"en":"The moving company includes door-to-door service in the price.","zh":"这家搬家公司把上门服务包含在价格里。"},{"en":"Some businesses still rely on door-to-door service to reach elderly customers.","zh":"一些企业仍然依靠上门服务来接触老年客户。"}]}],"synonyms":["home service","in-home service","house call","home visit","doorstep delivery","home delivery","on-site service"],"phonetic":"/ˌdɔr tə ˈdɔr ˈsɝvɪs/","extraExplanation":["常见搭配：door-to-door delivery（送货上门）、door-to-door sales（上门推销）、door-to-door pickup（上门取件）、door-to-door transport（门到门运输）。","语气中性；在一些语境里 door-to-door sales 可能让人联想到“推销打扰”，但 door-to-door service 在物流/搬家/维修里通常是便利服务。","写法：作为复合形容词时常用连字符 door-to-door（如 door-to-door service / door-to-door delivery）。"],"etymology":"源自“door to door（挨家挨户/从一户到另一户）”，早期多用于推销员上门拜访；后来“door-to-door”扩展到物流、搬家、维修等“从你门口到你门口”的服务。","mnemonic":["把它理解成“从你家门口到你家门口”：门→门，强调不用自己出门。","联想中文“上门（服务）/送货上门”，基本是一一对应。"]}
{"word":"doorba","summary":{"en":"“doorba” is not a recognized English word; it’s likely a misspelling or incomplete word.","zh":"“doorba”不是常见英语词；更可能是拼写错误或未输入完整。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or incomplete typing. Please check the spelling or share the sentence where you saw it.","zh":"不是标准英语单词；通常是拼写错误或未输入完整。请检查拼写，或把你看到它的句子发来。"},"examples":[{"en":"I can’t find “doorba” in a dictionary—did you mean “door bar” or “Durbar”?","zh":"我在词典里找不到“doorba”——你是不是想写“door bar”（门闩/门杆）或“Durbar”（宫廷/王公会议）？"},{"en":"If you paste the full sentence, I can guess the intended word more accurately.","zh":"如果你把完整句子贴出来，我可以更准确地判断你想表达的单词。"}]}],"phonetic":"/ˈdɔrbə/","extraExplanation":["“doorba”看起来像是把两个词连在一起（例如 door + bar）或是拼写误差。常见的可能目标包括：\n- door bar：门闩/门杆（用来加固门的横杆）\n- Durbar：源自南亚语境的词，指“宫廷、王公会议/盛大集会”（历史与殖民时期文本中更常见）\n如果你告诉我它出现的语境（聊天、游戏、文章、品牌名等），我可以给出更贴切的解释与用法。"]}
{"word":"doorbell","summary":{"en":"A doorbell is a device by a door that rings to signal a visitor; it can also mean to press that bell.","zh":"doorbell 指门口的门铃；也可作动词，表示按门铃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small device next to a door that makes a ringing sound to let people inside know someone is at the door","zh":"门铃；门口用来发出铃声、提醒屋内有人来访的小装置"},"examples":[{"en":"I rang the doorbell, but no one answered.","zh":"我按了门铃，但没人应门。"},{"en":"The doorbell is broken, so please knock.","zh":"门铃坏了，所以请敲门。"},{"en":"Our new doorbell sends an alert to my phone.","zh":"我们的新门铃会给我的手机发送提醒。"}]},{"partOfSpeech":"v.","definition":{"en":"to press a doorbell so it rings","zh":"按（门铃）；按门铃使其响"},"examples":[{"en":"Doorbell once, then wait politely.","zh":"按一次门铃，然后礼貌地等待。"},{"en":"He doorbelled and stepped back from the door.","zh":"他按了门铃，然后往后退了一步。"}]}],"synonyms":["bell","buzzer","chime"],"phonetic":"/ˈdɔrˌbɛl/","extraExplanation":["在美式英语里更常说“ring the doorbell / press the doorbell”，把 doorbell 当动词（doorbelled）也能用，但比较口语、少见一些。","“doorbell camera / video doorbell”（可视门铃）在北美很常见，常用于家庭安全与包裹投递提醒。","相关常用表达：answer the door（去开门/应门）、knock on the door（敲门）、door-to-door（挨家挨户的）。"]}
{"word":"doorbells","summary":{"en":"Doorbells are devices by a door that you press to make a sound inside.","zh":"Doorbells 指安装在门边、按下会在室内发声的门铃装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bell or electronic device on or near a door that you press to make a sound inside a building (plural: doorbells)","zh":"门铃；按铃装置（复数：doorbells）"},"examples":[{"en":"Our doorbell is broken, so please knock.","zh":"我们的门铃坏了，所以请敲门。"},{"en":"I heard the doorbells ringing and went to open the door.","zh":"我听到门铃响了，就去开门。"},{"en":"Many apartments have doorbells with nameplates next to them.","zh":"很多公寓的门铃旁边都有写名字的牌子。"}]}],"synonyms":["bell","door chime","buzzer"],"phonetic":"/ˈdɔrˌbɛl/","extraExplanation":["在美国家庭里，doorbell 常指“按键式电子门铃”，声音可能是 ring（叮铃声）或 chime（叮咚声）。口语里常说“Someone rang the doorbell.”（有人按门铃了）。","“doorbell camera”（门铃摄像头）近年很常见，指带摄像头的智能门铃，可在手机上看到门口情况。"]}
{"word":"doorboy","summary":{"en":"A (somewhat old-fashioned) word for a young doorman who opens doors and may run small errands.","zh":"较偏旧式的说法，指替人开门、可能兼做跑腿的年轻门童（类似 doorman）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A boy or young man employed to stand at a door, open it for people, and sometimes help with simple errands (similar to a doorman).","zh":"（受雇于门口的）开门男孩/年轻门童；负责替人开门，有时也做些简单跑腿工作（类似 doorman）。"},"examples":[{"en":"A doorboy opened the hotel’s front door and greeted the guests.","zh":"一名门童打开酒店正门，向客人致意。"},{"en":"In old novels, a doorboy might carry messages or fetch a cab.","zh":"在一些老小说里，门童可能会送信或帮人叫出租车。"}]}],"synonyms":["doorman","door attendant","porter (in some contexts)"],"phonetic":"/ˈdɔɹˌbɔɪ/","extraExplanation":["“doorboy”在现代英语里不如“doorman”“door attendant”常用，带有一点旧式或文学描写的感觉；在当代语境中，用“doorman”（常见于公寓、酒店）会更自然。","语域提醒：如果指成年人，用“doorboy”可能显得不够尊重或不准确；更中性的说法是“doorman / door attendant”。"]}
{"word":"doorbrand","summary":{"en":"“doorbrand” usually means “door brand”: the brand/manufacturer of a door (or, less commonly, the brand name shown on a door).","zh":"“doorbrand”通常指“door brand”：门的品牌/制造商（较少情况下指门上显示的品牌名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand or manufacturer of doors (often written as two words: “door brand”)","zh":"门的品牌；门的制造商（通常写作两个词：door brand）"},"examples":[{"en":"We chose a door brand that offers good soundproofing.","zh":"我们选择了一个隔音效果好的门品牌。"},{"en":"Ask the contractor which door brand they usually install.","zh":"问问承包商他们通常安装哪个门的品牌。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a brand name or logo shown on a door or door hardware","zh":"（少见）标在门或门五金上的品牌名/商标"},"examples":[{"en":"The door brand is stamped on the hinge.","zh":"门的品牌刻在合页上。"},{"en":"You can find the door brand label on the inside edge of the door.","zh":"你可以在门的内侧边缘找到品牌标签。"}]}],"synonyms":["door brand","door maker","door manufacturer","brand of doors"],"phonetic":"/dɔr brænd/","extraExplanation":["“doorbrand”作为一个连写词在英语里不常见；更自然的写法通常是两个词“door brand”。如果你指的是门把手、锁、合页等五金件的品牌，也常说“hardware brand”或更具体的“lock brand / hinge brand”。","如果“Doorbrand”是某个公司或产品的正式名称（专有名词），在写作中建议保持其官方拼写与大小写。"]}
{"word":"doorbuster","summary":{"en":"A doorbuster is a heavily discounted item or deal meant to attract many customers quickly, often during major sales.","zh":"doorbuster 指限时限量、折扣很大的“引流爆款”商品或优惠，常见于大型促销活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very popular product sold at a very low price for a short time to attract customers into a store (often during big sales events)","zh":"（限时）超低价促销商品；用来吸引顾客进店的“爆款”（常见于大型促销活动）"},"examples":[{"en":"This TV is a doorbuster, so it might sell out in minutes.","zh":"这台电视是门店引流的爆款，可能几分钟就卖光。"},{"en":"They’re offering a doorbuster deal from 6 a.m. to 8 a.m.","zh":"他们从早上6点到8点推出限时“门店爆款”优惠。"},{"en":"Shoppers lined up early for the doorbusters.","zh":"顾客为了抢门店爆款早早排队。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe a deal or price that is extremely attractive and meant to draw customers in","zh":"（形容优惠/价格）超划算的、用于吸引顾客进店的（引流）"},"examples":[{"en":"The store advertised doorbuster prices on laptops.","zh":"这家店宣传笔记本电脑有“门店爆款价”。"},{"en":"Doorbuster sales often have limited quantities.","zh":"门店爆款促销通常数量有限。"}]}],"synonyms":["loss leader","hot deal","door-crasher (deal)","deep discount"],"phonetic":"/ˈdɔrˌbʌstɚ/","extraExplanation":["“doorbuster”在北美零售文化中很常见，尤其和“Black Friday（黑色星期五）”“Cyber Monday（网购星期一）”等购物季联系紧密。原意带有夸张色彩：优惠太强，顾客会“冲破门”涌进店里。现实中通常表示：时间短、数量少、折扣大，商家用来制造排队与话题热度。"]}
{"word":"doorcase","summary":{"en":"A doorcase is the frame (often including the casing/trim) around a doorway.","zh":"doorcase 指门洞周围的框架（常可包含门套/饰条），相当于 doorframe。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the frame or casing around a doorway; a doorframe","zh":"门框；门套（门洞周围的框架）"},"examples":[{"en":"They repainted the doorcase to match the new wall color.","zh":"他们把门框重新刷漆，让它和新墙的颜色一致。"},{"en":"The old wooden doorcase was cracked near the bottom.","zh":"那扇旧木门框在底部附近裂开了。"}]}],"synonyms":["doorframe","door casing","door trim","door jamb"],"phonetic":"/ˈdɔrˌkeɪs/","extraExplanation":["“doorcase”在现代美式英语里不算常用词，更常见的说法是“doorframe”（门框）或“door casing/door trim”（门套/门边饰条）。在建筑、室内装修或较偏英式/文学的语境中更可能见到“doorcase”。","在细微区别上：doorframe 通常指门的结构框架；door casing/trim 更强调外侧装饰性的包边；doorcase 往往可泛指门洞周围的框架/包边整体。"]}
{"word":"doorcheek","summary":{"en":"Doorcheek means the vertical side piece of a door frame (a doorjamb).","zh":"doorcheek 指门框的侧边竖向构件（门框立边/doorjamb）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the vertical side piece of a door frame; a doorjamb (doorpost).","zh":"门框的侧边竖向构件；门框立边（即 doorjamb / doorpost）。"},"examples":[{"en":"The carpenter checked the doorcheek to make sure it was perfectly plumb.","zh":"木工检查门框立边，确保它完全垂直。"},{"en":"Moisture had rotted the bottom of the doorcheek, so it needed replacing.","zh":"潮气把门框立边的底部腐蚀了，所以需要更换。"}]}],"synonyms":["doorjamb","jamb","doorpost","door frame side"],"phonetic":"/ˈdɔrˌtʃik/","extraExplanation":["“doorcheek”多见于建筑/木工语境，也常写作两个词 door cheek。现代更常用的说法是 doorjamb（美式常见）或 doorpost。","词源上 cheek 有“侧面、旁边”的意思（类似“脸颊在面部的侧边”），因此 doorcheek 表示“门的侧边构件”。"]}
{"word":"doored","summary":{"en":"“Doored” most commonly means being hit by a suddenly opened car door (often a cyclist).","zh":"“Doored”最常指被突然打开的车门撞到（常见于骑行者），即“开门杀”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “door”) to hit or injure someone by suddenly opening a car door into their path, especially a cyclist.","zh":"（“door”的过去式/过去分词）突然打开车门撞到他人，尤指把骑行者撞倒/撞伤（常说 be doored）。"},"examples":[{"en":"A cyclist was doored by a parked car and fell into the street.","zh":"一名骑行者被路边停着的车突然开门撞倒，摔进了马路。"},{"en":"He got doored on his commute, so now he rides farther from parked cars.","zh":"他通勤时被“开门杀”撞过，所以现在骑车会离路边停放的车更远。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) fitted with a door; having a door added.","zh":"（较少见）装有门的；加装了门的。"},"examples":[{"en":"The storage area was doored off to keep the tools secure.","zh":"储物区被加装了门隔开，以便把工具锁好。"}]}],"synonyms":["hit by an opening door","door-slammed (informal)","dooring (n., in traffic/cycling context)"],"phonetic":"/dɔɹd/","extraExplanation":["“be doored / get doored”在英语里常见于交通与骑行安全语境，尤其在北美城市。中文常对应“开门杀”。骑行建议包括：使用“Dutch Reach”（用远离车门的手开门，迫使身体转向检查后方来车/骑行者）、与路边停放车辆保持距离、注意车内乘客是否有动作。"]}
{"word":"doorframe","summary":{"en":"A doorframe is the structure around a door that supports it.","zh":"doorframe 指门周围用来支撑和固定门的门框结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The frame (often made of wood, metal, or plastic) that surrounds and supports a door; the structure the door is attached to.","zh":"门框；门的外框结构（通常为木、金属或塑料），用来支撑并固定门。"},"examples":[{"en":"He leaned against the doorframe and waited.","zh":"他靠在门框上等待。"},{"en":"We need to repaint the doorframe to match the new door.","zh":"我们得把门框重新刷漆，才能和新门颜色一致。"},{"en":"The child’s height was marked on the doorframe every year.","zh":"孩子的身高每年都记在门框上。"}]}],"synonyms":["door frame","door casing","frame"],"phonetic":"/ˈdɔr.freɪm/","extraExplanation":["在日常英语里，doorframe 是一个复合名词（door + frame）。也常写作 door frame（分开写），意思相同。","相关词汇：doorway（门口/门洞，强调开口空间），doorjamb/jamb（门框的立柱部分，较偏建筑术语），threshold（门槛）。","文化小点：把孩子身高刻在门框上是英语文化里常见的家庭记忆画面，在小说和电影中也经常出现。"]}
{"word":"doorhawk","summary":{"en":"“Doorhawk” is an informal term for someone who watches/controls a doorway (a doorman or lookout), and it can also be a brand or nickname for door-security products.","zh":"“Doorhawk”多指（非正式）在门口把关、看守出入口的人，也可能是门禁安防相关产品/服务的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who watches or controls access at a door, especially at a club, event, or restricted area; a doorman or lookout.","zh":"（非正式）看门口、把关的人，尤指夜店/活动入口处负责检查或控制出入的人；类似门卫、把门者。"},"examples":[{"en":"The doorhawk checked IDs before letting anyone in.","zh":"门口把关的人会先查身份证件再放人进去。"},{"en":"Ask the doorhawk if the guest list is still open.","zh":"问问门口把关的人嘉宾名单还没关。"},{"en":"He worked as a doorhawk on weekends to earn extra money.","zh":"他周末做门口把关的工作来赚外快。"}]},{"partOfSpeech":"n.","definition":{"en":"A brand name or nickname used for a door-related security product or service (not a widely standardized dictionary meaning).","zh":"（多见于商标/昵称）与门禁安防产品或服务相关的名称（并非通用、标准的词典义）。"},"examples":[{"en":"Our building uses Doorhawk for entry monitoring.","zh":"我们大楼用 Doorhawk 做出入监控。"},{"en":"Search “Doorhawk” to find the manual for the lock system.","zh":"搜“Doorhawk”可以找到这套门锁系统的说明书。"}]}],"synonyms":["doorman","bouncer","security guard","gatekeeper","lookout"],"phonetic":"/ˈdɔr.hɔk/","extraExplanation":["“hawk”在英语里常带有“警觉地盯着、看守”的比喻色彩（像鹰一样盯着猎物）。所以“doorhawk”直观上就是“盯门口的人”。","这个词并不常见，很多场合更自然的说法是 doorman（门卫/看门人）、bouncer（夜店保安）、security guard（保安）或 gatekeeper（把关者）。如果你是在某个应用、公司或产品上看到它，也可能是专有名称。"]}
{"word":"doorhead","summary":{"en":"Doorhead means the top part of a doorway or door frame, especially in building and carpentry contexts.","zh":"Doorhead 指门洞或门框的上部（门上方的水平部分），多用于建筑和木工语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the top part of a doorway or door frame (the horizontal section above the door)","zh":"门洞或门框的上部（门上方的水平构件）"},"examples":[{"en":"The contractor measured the doorhead before installing the new door.","zh":"承包商在安装新门之前测量了门头的尺寸。"},{"en":"Cracks around the doorhead can mean the frame is shifting.","zh":"门头周围出现裂缝可能意味着门框在移位。"}]}],"synonyms":["door head","lintel","header","top of the door frame"],"phonetic":"/ˈdɔrˌhɛd/","extraExplanation":["“doorhead”是偏建筑/木工领域的用词，更常见的写法是分开写作“door head”。在日常英语里，人们更常说“the top of the door frame / the lintel（过梁）”。其中lintel更偏结构构件（承重或支撑），而doorhead更偏门洞/门框的上部这一位置概念。"]}
{"word":"dooring","summary":{"en":"Dooring most commonly means an accident where a car door opens into someone’s path—especially a cyclist.","zh":"Dooring最常指“车门突然打开导致他人（尤其骑行者）撞上”的交通事故，即“开门杀”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traffic accident in which someone (often a cyclist) hits a car door that is suddenly opened into their path","zh":"（交通事故）汽车车门突然打开，导致他人（常见为骑行者）撞上车门的事故"},"examples":[{"en":"The cyclist was injured in a dooring when a parked car’s door opened into the bike lane.","zh":"一辆停靠车辆突然打开车门伸入自行车道，导致骑行者发生“开门杀”受伤。"},{"en":"To prevent dooring, drivers should check mirrors and look over their shoulder before opening the door.","zh":"为避免“开门杀”，司机开门前应先看后视镜并回头确认。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of hitting someone with a door, or opening a door into someone’s path (less common, more general use)","zh":"用门撞到别人，或把门打开挡到别人行进路线上的行为（较少见、更泛指）"},"examples":[{"en":"He apologized for the dooring and asked if she was okay.","zh":"他为开门撞到人道歉，并询问她有没有事。"}]}],"synonyms":["car-door collision","open-door crash","dooring incident"],"phonetic":"/ˈdɔrɪŋ/","extraExplanation":["“dooring”在英语新闻、交通安全宣传中常指骑行者被“突然打开的车门”撞到的事故，中文常译为“开门杀”。一些地区（如美国部分州、加拿大、澳大利亚等）会在交通法规或安全教育材料中使用这个词。","常见安全提示包括：停车后用离车门较远的那只手开门（Dutch Reach），身体会自然转向后方，更容易发现来车/骑行者，从而减少“dooring”。"]}
{"word":"doorjamb","summary":{"en":"A doorjamb is the vertical side part of a door frame where the door hinges or latch hardware may be attached.","zh":"doorjamb 指门框的竖边部分，门的铰链或锁扣等常固定在这里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The vertical side piece of a door frame that a door closes against (often with hinges or a latch/strike plate attached).","zh":"门框的竖边（门关闭时贴合的那根边框，常装有铰链或门锁扣板）。"},"examples":[{"en":"The installer screwed the hinge into the doorjamb.","zh":"安装工把铰链拧在门框竖边上。"},{"en":"Paint got on the doorjamb when we repainted the hallway.","zh":"我们重刷走廊时，油漆沾到了门框竖边上。"}]}],"synonyms":["door jamb","jamb"],"phonetic":"/ˈdɔɹˌdʒæm/","extraExplanation":["“Doorjamb”也常写作“door jamb”。其中“jamb”指门或窗开口处的“侧柱/立柱”，来源于法语（意为“腿/支撑物”），后来引申为框架两侧的竖向构件。","容易混淆的相关部件：\n- door frame 门框（整体框架）\n- jamb 门框侧柱/竖边（左右两边）\n- header 门楣/上框（顶部横梁）\n- sill/threshold 门槛（底部）"]}
{"word":"doorjambs","summary":{"en":"Doorjambs are the vertical sides of a door frame.","zh":"Doorjambs 指门框两侧的竖直框边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the two vertical sides of a door frame that the door fits into (plural of “doorjamb”)","zh":"门框两侧的竖直框边（doorjamb 的复数；门扇嵌入并与之贴合的两条竖边）"},"examples":[{"en":"The painter taped the doorjambs before painting the wall.","zh":"油漆工在刷墙前先把门框两侧用胶带遮住。"},{"en":"The installer checked the doorjambs to make sure the door would close smoothly.","zh":"安装工检查了门框两侧，确保门能顺畅关上。"},{"en":"Water damage made the doorjambs swell, so the door started to stick.","zh":"门框两侧因受潮膨胀，门开始卡住不好开关。"}]}],"synonyms":["door frame sides","jambs","doorposts"],"phonetic":"/ˈdɔrˌdʒæmz/","extraExplanation":["“Jamb”指门或窗框的侧边（通常是竖直部分）；“threshold”是门槛（底部横向），而“lintel/header”是门框上方的横梁。","常见拼写：doorjamb（美式常用合写）；也有人写作 door jamb。注意不要和“jam（果酱/卡住）”混淆。"]}
{"word":"doorkeep","summary":{"en":"“Doorkeep” means to guard a door and control entry; it’s an uncommon verb in modern English.","zh":"“doorkeep”指在门口把守、控制出入；作为动词在现代英语中较少见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to stand or work at a door to control who enters, often as a guard or attendant; to act as a doorkeeper","zh":"在门口把守或值守以控制谁能进入；担任门卫/看门人"},"examples":[{"en":"Two staff members doorkeeped at the side entrance during the event.","zh":"活动期间有两名工作人员在侧门把守。"},{"en":"He was hired to doorkeep for a private club on weekends.","zh":"他受雇在周末为一家私人俱乐部把门。"}]}],"synonyms":["guard the door","man the door","stand at the door","doorkeeper (noun)"],"phonetic":"/ˈdɔrˌkip/","extraExplanation":["“doorkeep”是由“door + keep”组合而来，意思直观，但在现代英语里相对少见。更常用的表达是“work as a doorkeeper / guard the door / man the door / be on the door（英式口语，常指夜店门口看门）”。在正式写作中也常用名词“doorkeeper”。"]}
{"word":"doorkeeper","summary":{"en":"A doorkeeper is someone who stands at an entrance to welcome people and control entry; it can also mean a symbolic “gatekeeper.”","zh":"doorkeeper 指在入口处接待并管理出入的门卫/看门人；也可引申为象征性的“守门人/把关者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to stand at the entrance of a building to open the door, welcome visitors, and control who may enter.","zh":"门卫；看门人（在建筑入口处开门、接待来访者并管理出入的人）"},"examples":[{"en":"The doorkeeper greeted everyone as they entered the hotel.","zh":"门卫在大家进入酒店时向每个人打招呼。"},{"en":"Please show your ID to the doorkeeper at the main entrance.","zh":"请在正门向门卫出示身份证件。"}]},{"partOfSpeech":"n.","definition":{"en":"In stories or formal writing, a person who guards access to an important place or group (sometimes used symbolically).","zh":"（故事或正式文体中）守门人；把关者（也可作象征性用法）"},"examples":[{"en":"In the legend, a doorkeeper protects the gate to the hidden city.","zh":"在传说中，一位守门人守护着通往隐秘城市的大门。"},{"en":"Editors can act as doorkeepers to the world of publishing.","zh":"编辑有时像出版世界的把关者。"}]}],"synonyms":["gatekeeper","attendant","porter","concierge"],"phonetic":"/ˈdɔrˌkipər/","extraExplanation":["在英美文化里，doorkeeper 常见于酒店、公寓大楼、剧院等场所，职责除了“开门”还可能包括礼貌接待、协助叫车、代收物品或维持秩序。","在英国英语中，类似工作有时也会用 porter（门房/搬运员）或 concierge（礼宾/前台服务）等词，但侧重点不同：concierge 更偏向提供信息与安排服务。"]}
{"word":"doorkeepers","summary":{"en":"Doorkeepers are people who work at an entrance to control entry and assist visitors.","zh":"Doorkeepers 指在入口处把关出入并协助访客的门卫/看门人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to stand at the entrance of a building (such as an apartment, hotel, or theater) to control who enters, welcome visitors, and sometimes provide security or assistance.","zh":"门卫；看门人（在公寓、酒店、剧院等入口处工作，负责把关出入、迎接访客，有时也提供安保或协助）"},"examples":[{"en":"The doorkeepers at the hotel greeted guests and called taxis.","zh":"酒店的门卫会向客人问候并帮忙叫出租车。"},{"en":"In some old apartment buildings, doorkeepers keep a log of visitors.","zh":"在一些老式公寓楼里，门卫会登记来访者的信息。"},{"en":"The theater hired extra doorkeepers for the premiere.","zh":"剧院为首映式额外雇了更多门卫。"}]}],"synonyms":["doormen","gatekeepers","porters (in some contexts)"],"phonetic":"ˈdɔrˌkipərz","extraExplanation":["“doorkeeper”是由 door（门）+ keeper（看守的人）构成的合成词。不同地区或场合也常用“doorman / doormen”（更常见于酒店、公寓，尤其在美式英语中）。","在文学或宗教语境中，“doorkeeper”有时带有象征意义，指“守门者/门口的看守”，强调门槛、进入与拒绝的权力与责任。"]}
{"word":"doorknob","summary":{"en":"A doorknob is usually the round handle you turn to open a door; informally, it can also mean a foolish person.","zh":"doorknob 通常指门上可转动的圆形把手；在非正式用法中也可指“笨蛋”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A round handle on a door that you turn to open it.","zh":"门把手（通常是圆形的，转动后开门）。"},"examples":[{"en":"He turned the doorknob and walked into the room.","zh":"他转动门把手，走进了房间。"},{"en":"The doorknob is loose—can you tighten it?","zh":"门把手松了——你能把它拧紧吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A stupid or annoying person.","zh":"（非正式）笨蛋；讨厌的人。"},"examples":[{"en":"Don’t be a doorknob—read the instructions first.","zh":"别犯傻——先把说明书看清楚。"},{"en":"He acted like a doorknob and forgot the keys again.","zh":"他又犯傻，把钥匙忘了。"}]}],"synonyms":["door handle","knob"],"phonetic":"/ˈdɔrˌnɑb/","extraExplanation":["“doorknob”作为“笨蛋”的用法偏口语、带点责备或玩笑的语气；正式场合建议用更中性的话（如 “That was careless.” / “That wasn’t smart.”）。","相关词：door handle（更常见的总称，尤其指长条形把手）、knob（旋钮/球形把手）、deadbolt（插销锁）。"]}
{"word":"doorknobs","summary":{"en":"Doorknobs are the round handles on doors that you turn to open them.","zh":"Doorknobs 指门上的圆形把手（门把），通过转动来开门。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural form of “doorknob”: the round handles on doors that you turn to open them.","zh":"“doorknob”的复数：门上的圆形把手/门把，转动它来开门。"},"examples":[{"en":"The old house had brass doorknobs on every bedroom door.","zh":"这栋老房子每个卧室门上都有黄铜门把。"},{"en":"Please disinfect the doorknobs and light switches—they’re touched a lot.","zh":"请给门把和电灯开关消毒——它们经常被触碰。"},{"en":"He painted the door but forgot to remove the doorknobs first.","zh":"他把门刷了漆，但忘了先把门把拆下来。"}]}],"synonyms":["door knobs","door handles","door pulls"],"phonetic":"/ˈdɔrˌnɑbz/","extraExplanation":["在美式英语里，doorknob 通常指“圆形可旋转的门把”；而 door handle 更泛指各种“门把手”（包括拉手、压把等）。在公共卫生或清洁语境中，doorknob 常被用来指“高频接触表面”（high-touch surface）。"]}
{"word":"doorknocker","summary":{"en":"A doorknocker is either a door-mounted device you strike to knock, or a person who knocks on doors for work (often politics or sales).","zh":"doorknocker 既可指门上的敲门器/门环，也可指因工作需要挨家挨户敲门拜访的人（常见于竞选、推销等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A metal ring, bar, or other device attached to a door that you lift and strike against a plate to make a knocking sound.","zh":"（门上的）门环；敲门器：安装在门上的金属环、把手等装置，用来敲击门板发出敲门声。"},"examples":[{"en":"She lifted the brass doorknocker and rapped twice.","zh":"她抬起黄铜门环，敲了两下。"},{"en":"The old townhouse still has a lion-head doorknocker.","zh":"那栋老联排住宅仍然装着狮子头门环。"}]},{"partOfSpeech":"n.","definition":{"en":"A person whose job is to knock on doors to talk to people, often for sales, politics, or fundraising.","zh":"（挨家挨户）敲门拜访者：以敲门方式上门沟通的人，常见于推销、竞选或募款。"},"examples":[{"en":"During the election, volunteers worked as doorknockers in the neighborhood.","zh":"选举期间，志愿者在社区挨家挨户敲门拉票。"},{"en":"He got a temporary job as a doorknocker for a charity campaign.","zh":"他在一场慈善活动中做了份临时的上门拜访工作。"}]}],"synonyms":["door knocker","knocker","door knocker device","canvasser","door-to-door solicitor"],"phonetic":"/ˈdɔrˌnɑkɚ/","extraExplanation":["在英式与美式英语里，doorknocker 都可指“门环/敲门器”，但在政治语境中，尤其在美国，doorknocker 常用来指“挨家挨户拉票的志愿者/工作人员”（door-to-door canvasser）。","一些文学与电影中会用形状夸张的门环（如狮子头、怪兽头）来营造“古老宅邸”“神秘访客”的氛围；听到门环沉重的敲击声常被用作悬念开场。"]}
{"word":"doorless","summary":{"en":"Doorless means “having no door.”","zh":"doorless 的意思是“没有门的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no door; without a door.","zh":"没有门的；无门的。"},"examples":[{"en":"The doorless room felt open but not very private.","zh":"这间没有门的房间感觉很敞开，但不太有隐私。"},{"en":"They walked through a doorless entrance into the old temple.","zh":"他们从一个没有门的入口走进了古老的寺庙。"}]}],"synonyms":["without a door","door-free","open (entrance)"],"phonetic":"/ˈdɔrləs/","extraExplanation":["“doorless”是由 door（门）+ -less（没有……的）构成的形容词。-less 常表示“缺少、没有”，例如: homeless（无家可归的）、careless（粗心的）。","它在日常口语里不算高频，更常见的说法有：without a door / with no door。","在写作中，doorless 常用来营造氛围：要么强调“开放、自由”，要么暗示“缺乏边界与隐私”，也可用于奇幻/科幻场景（如“无门之门”式的意象）。"]}
{"word":"doorlike","summary":{"en":"Doorlike means “similar to a door,” especially in shape or function.","zh":"doorlike 意为“像门的”，多指形状或功能类似门。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a door in shape, position, or function (like an entrance or barrier).","zh":"像门的；具有门的形状、位置或功能（如入口或阻挡物）的。"},"examples":[{"en":"The cave had a doorlike opening that looked as if someone had cut it into the rock.","zh":"那个洞穴有一个像门一样的开口，看起来像是有人把岩石切开做成的。"},{"en":"A doorlike panel slid aside, revealing a small room behind it.","zh":"一块像门一样的面板滑到一旁，露出了后面的小房间。"}]}],"synonyms":["door-like","door-shaped","portal-like"],"phonetic":"/ˈdɔrˌlaɪk/","extraExplanation":["“doorlike”在现代英语中不算常见，写作时更常见的形式是带连字符的“door-like”。多用于描写外观或结构（如开口、面板、轮廓），强调“像门一样”的视觉或功能感觉。"]}
{"word":"doormaid","summary":{"en":"A rare word meaning a female doorkeeper or servant who answers the door.","zh":"一个很少见的词，指负责看门或应门的女仆／女门房。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) A female servant or attendant whose job is to watch or answer the door; a female doorkeeper.","zh":"（罕见／较旧用法）看门或应门的女仆；女门房（女看门人）。"},"examples":[{"en":"In the old novel, the doormaid opened the gate and announced the visitors.","zh":"在那本旧小说里，女门房打开大门并通报来客。"},{"en":"She waited in the hall while the doormaid went to fetch the mistress of the house.","zh":"她在门厅等着，女门房去请女主人。"}]}],"synonyms":["doorkeeper","door attendant","gatekeeper","housemaid"],"phonetic":"ˈdɔrˌmeɪd","extraExplanation":["“doormaid”在现代英语里非常少见，更常见的说法是“doorman”（门房，通常指男性）或“door attendant / doorkeeper”（门口值守人员，不强调性别）。","构词很直观：door（门）+ maid（女仆/年轻女子）。在一些较早的文学或历史语境中，用来强调“在门口当差的女仆”。如果你是想表达“宿舍管理员/舍监”，英语通常用“dorm supervisor / house parent”等，而不是“doormaid”。"]}
{"word":"doormaker","summary":{"en":"A doormaker is someone who makes doors, especially as a profession.","zh":"doormaker 指以制作门为职业的人或企业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that makes doors (especially as a job or trade).","zh":"做门的人；制门工匠；门的制造商（通常指以此为职业或行业）。"},"examples":[{"en":"We hired a local doormaker to build custom wooden doors for the old house.","zh":"我们请了一位本地制门工匠，为这栋老房子定做木门。"},{"en":"The doormaker measured the frame carefully before starting the work.","zh":"制门工匠在开工前仔细测量了门框。"}]}],"synonyms":["door manufacturer","carpenter","joiner","door builder"],"phonetic":"/ˈdɔrˌmeɪkər/","extraExplanation":["“doormaker”由 door（门）+ maker（制造者）构成，属于直观的复合词。日常生活中更常见的说法是 “door manufacturer”（门的制造商，偏工厂/企业）或 “carpenter/joiner”（木工/细木工，偏手工制作与安装）。在讲“定制门”“实木门”“复古建筑修复”等场景里，用 doormaker 很自然。"]}
{"word":"doormaking","summary":{"en":"Doormaking means the craft, business, or process of making doors.","zh":"Doormaking 指制作门的工艺、行业或生产过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft or business of making doors (especially wooden doors), including measuring, cutting, joining, and fitting hardware","zh":"门的制作工艺或行业（尤指木门），包括测量、切割、榫接/拼接以及安装五金等"},"examples":[{"en":"He learned doormaking as an apprentice in a small carpentry shop.","zh":"他在一家小木工店当学徒学习做门。"},{"en":"Traditional doormaking often uses mortise-and-tenon joints for strength.","zh":"传统做门常用榫卯结构来增加牢固度。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity or process of producing doors for buildings","zh":"为建筑生产门的活动或过程"},"examples":[{"en":"The factory specializes in doormaking for hotels and office buildings.","zh":"这家工厂专门为酒店和写字楼生产门。"},{"en":"Rising wood prices have affected doormaking costs.","zh":"木材涨价影响了做门的成本。"}]}],"synonyms":["door manufacturing","door production","carpentry (door work)","joinery"],"phonetic":"/ˈdɔrˌmeɪkɪŋ/","extraExplanation":["“doormaking”是由 door + making 组成的复合词，更常见的写法也包括“door-making”（加连字符）或用更具体的表达如“door manufacturing（门的制造）”“door carpentry（门的木工制作）”。在日常英语里，如果不是在行业语境中，人们更常说“making doors”或“door manufacturing”。"]}
{"word":"doorman","summary":{"en":"A doorman is someone who works at a building entrance to help visitors; it can also mean a goalkeeper in sports.","zh":"doorman 指在建筑入口处服务与协助安保的门卫；在体育中也可指守门员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often in a uniform) who stands at the entrance of a building to open the door, greet visitors, and help with security or directions.","zh":"（常穿制服的）门卫；看门人：站在建筑入口处开门、迎接访客，并协助安保或指路的人。"},"examples":[{"en":"The doorman opened the door and called a taxi for us.","zh":"门卫帮我们开了门，还替我们叫了出租车。"},{"en":"Ask the doorman if you’re not sure which elevator to take.","zh":"如果你不确定该坐哪部电梯，可以问门卫。"},{"en":"The apartment has a 24-hour doorman, so it feels safer.","zh":"这栋公寓有24小时门卫，所以感觉更安全。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports (especially soccer), a goalkeeper.","zh":"（体育，尤指足球）守门员。"},"examples":[{"en":"Their doorman made an amazing save in the last minute.","zh":"他们的守门员在最后一分钟做出了一次精彩扑救。"},{"en":"He used to play as a doorman for his school team.","zh":"他以前在校队踢守门员。"}]}],"synonyms":["door attendant","porter","concierge","gatekeeper","goalkeeper"],"phonetic":"/ˈdɔrˌmæn/","extraExplanation":["在美式英语里，doorman 常让人联想到纽约等大城市的公寓楼或酒店门口的工作人员；除“开门”外，也可能负责收包裹、叫车、帮忙拿行李、登记访客等。","在美国日常口语中，体育语境更常说 goalkeeper；doorman 用来指守门员带有较口语或地区性的色彩。"]}
{"word":"doormanlike","summary":{"en":"Doormanlike means “like a doorman” in look or manner—formal, door-holding, greeting-at-the-entrance behavior.","zh":"doormanlike 指“像门卫/门童一样的”外表或举止，常联想到正式、在门口迎宾、替人开门等行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the appearance, manner, or behavior of a doorman (someone who stands at a building entrance to open doors, greet guests, and help with access).","zh":"像门卫/门童一样的；具有门卫的外表、举止或工作方式（在建筑入口处开门、迎接来客并协助出入的人）。"},"examples":[{"en":"He gave a doormanlike nod and held the door open for everyone.","zh":"他像门卫一样点头示意，并为每个人把门扶开。"},{"en":"The hotel wanted a doormanlike uniform—neat, formal, and easy to recognize.","zh":"酒店想要一种“门卫风”的制服——整洁、正式、容易辨认。"}]}],"synonyms":["door-attendant-like","doorman-style","like a doorman","formal","attentive"],"phonetic":"/ˈdɔr.mənˌlaɪk/","extraExplanation":["“doormanlike”是由 doorman（门卫/门童）+ -like（像……一样的）构成的形容词，实际使用中比较少见；更常见的表达是 “like a doorman” 或用 “doorman-style / doorman-type” 来说“门卫风、门卫式的”。","在不同文化语境里，doorman 常与酒店、公寓大楼等“门口接待与安全把关”的角色联系在一起，因此这个词往往带有“正式、礼貌、在门口迎宾”的画面感。"]}
{"word":"doormat","summary":{"en":"A doormat is a mat by a door for wiping shoes; figuratively, it can mean a person who lets others take advantage of them.","zh":"doormat 指门口用来擦鞋的门垫；也可比喻“任人摆布、容易被占便宜的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mat placed at the entrance of a building for wiping dirt off shoes.","zh":"门口的擦脚垫；门垫（用来擦掉鞋底的灰尘）"},"examples":[{"en":"Please wipe your shoes on the doormat before you come in.","zh":"进来之前请先在门垫上擦擦鞋。"},{"en":"A welcome sign was printed on the doormat.","zh":"门垫上印着“欢迎”的字样。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A person who is easily used, disrespected, or treated unfairly because they don’t defend themselves.","zh":"（比喻）任人摆布的人；容易被欺负、被占便宜的人"},"examples":[{"en":"Don’t be a doormat—tell them what you need.","zh":"别当任人摆布的人——把你的需求说清楚。"},{"en":"He felt like a doormat at work because his coworkers dumped tasks on him.","zh":"他觉得自己在工作中像个“受气包”，因为同事总把任务丢给他。"}]}],"synonyms":["welcome mat","door mat","pushover","soft touch"],"phonetic":"/ˈdoʊˌmæt/","extraExplanation":["“doormat”作比喻时常出现在建议或心理界限（boundaries）的语境里：强调要学会说“不”、维护自尊。常见搭配：be a doormat（当‘任人踩’的人）、treat someone like a doormat（把某人当软柿子捏）。"]}
{"word":"doormats","summary":{"en":"“Doormats” most commonly means mats by a door for wiping shoes; figuratively, it can mean people who let others take advantage of them.","zh":"“Doormats”最常指门口擦鞋用的门垫；比喻义可指任人欺负、容易被占便宜的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mats placed at a door to wipe dirt from shoes before entering a building (plural of “doormat”).","zh":"放在门口用来擦鞋底、保持室内清洁的门垫（“doormat”的复数）。"},"examples":[{"en":"Please wipe your shoes on the doormats before you come inside.","zh":"进屋前请先在门垫上擦擦鞋底。"},{"en":"They bought new doormats for the front and back doors.","zh":"他们给前门和后门都买了新的门垫。"}]},{"partOfSpeech":"n.","definition":{"en":"People who allow others to treat them unfairly or take advantage of them (figurative; plural of “doormat”).","zh":"任人欺负、被人占便宜而不反抗的人（比喻义；“doormat”的复数）。"},"examples":[{"en":"Don’t be doormats—speak up when something isn’t fair.","zh":"别当“软柿子”——遇到不公平要敢于表达。"},{"en":"They were tired of being treated like doormats at work.","zh":"他们厌倦了在工作中被当成任人摆布的人。"}]}],"synonyms":["welcome mats","floor mats","pushovers","people-pleasers"],"phonetic":"/ˈdɔrˌmæt/","extraExplanation":["“Doormat”常用于口语比喻：像门垫一样被人“踩在脚下”，指性格过于顺从、缺乏界限感的人。常见表达：be a doormat（当老好人/任人欺负）、treat someone like a doormat（把某人当软柿子）。","在北美文化中，门口的“welcome mat”（欢迎垫）也很常见，上面可能写“Welcome”，用于表达友好与待客之意；但比喻义通常带负面色彩。"]}
{"word":"doormen","summary":{"en":"“Doormen” means more than one doorman—people who welcome visitors and help manage the entrance of a building.","zh":"“doormen”是 doorman 的复数，指多名门卫/看门人，在建筑入口迎接访客并提供协助或安保。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A doorman is a person (often in uniform) who stands at the entrance of a building to open doors, welcome visitors, and provide security or assistance.","zh":"doorman 指（常穿制服的）门卫/看门人，站在建筑入口处开门迎客，并提供安保或协助。"},"examples":[{"en":"The doorman opened the door and called a taxi for us.","zh":"门卫帮我们开门，还替我们叫了出租车。"},{"en":"There’s a doorman at the front desk 24 hours a day.","zh":"前台有门卫全天 24 小时值班。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “doorman.” (More than one doorman.)","zh":"“doorman”的复数形式，表示不止一名门卫/看门人。"},"examples":[{"en":"The hotel has three doormen working in shifts.","zh":"这家酒店有三名门卫轮班工作。"},{"en":"The doormen greeted guests by name.","zh":"门卫们会叫出客人的名字来打招呼。"}]}],"synonyms":["door attendant","attendant","porter","guard"],"phonetic":"/ˈdɔrˌmən/","extraExplanation":["在英语国家，doorman 常见于酒店、高档公寓或办公楼门口，既有“迎宾服务”的意味，也常承担基础安保与来访管理（例如记录访客、协助叫车、收包裹等）。与 concierge（礼宾/前台服务人员）相比，doorman 更强调“在门口迎接与看门”。","注意性别用语：传统词是 doorman（字面“男门卫”），但现在也常用更中性的 door attendant（门口服务员/门卫）或 simply attendant。"]}
{"word":"Doorn","summary":{"en":"“Doorn” is mainly used in English as a proper name: a surname or a place name (notably a town in the Netherlands).","zh":"“Doorn”在英语中主要作为专有名词使用：常见为姓氏或地名（尤其是荷兰的多恩镇）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Doorn will speak at the conference tomorrow.","zh":"多恩博士明天将在会议上发言。"},{"en":"My teacher’s last name is Doorn.","zh":"我老师的姓是 Doorn。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially Doorn (a town in the Netherlands).","zh":"地名，尤指荷兰的多恩（Doorn）镇。"},"examples":[{"en":"They visited Doorn during their trip to the Netherlands.","zh":"他们在荷兰旅行时去了多恩。"},{"en":"Doorn is known for its quiet, green surroundings.","zh":"多恩以安静、绿意盎然的环境而闻名。"}]}],"synonyms":["(proper name) none"],"phonetic":"/dɔrn/","extraExplanation":["“Doorn”本身在现代英语里通常不作为普通词汇使用，更常见是专有名词（人名/地名）。","如果它来自荷兰语，doorn 的字面意思是“刺、荆棘”（英文对应 thorn）。因此一些姓氏或地名可能与“有荆棘的地方/灌木丛”这类地貌含义有关。","容易混淆：英语的“门”是 door（不是 doorn）。"]}
{"word":"doornail","summary":{"en":"A doornail is a large nail used in doors; it’s best known from the phrase “dead as a doornail,” meaning completely dead or totally lifeless.","zh":"doornail 指门钉；最常见于习语“dead as a doornail”，表示“彻底死了/完全没有生气或反应”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large nail used in making doors; traditionally it could be hammered through and then bent over (“clenched”) to hold very firmly.","zh":"（传统）门钉；用于制作门的粗大钉子，常会穿过木板后再把钉尖折弯加固。"},"examples":[{"en":"The old wooden door was reinforced with iron straps and heavy doornails.","zh":"那扇旧木门用铁条和粗大的门钉加固。"},{"en":"In historical buildings, you can sometimes see clenched doornails on the back side of the door.","zh":"在一些历史建筑里，你有时能在门的背面看到被折弯加固的门钉。"}]},{"partOfSpeech":"n.","definition":{"en":"Used mainly in the idiom “dead as a doornail,” meaning completely dead or totally lifeless (often humorous or emphatic).","zh":"多用于习语“dead as a doornail”，表示“死得透透的/毫无生气”（带强调或幽默语气）。"},"examples":[{"en":"After the battery died, the phone was dead as a doornail.","zh":"电池没电后，手机彻底没反应了。"},{"en":"In the story, the villain is dead as a doornail by the final chapter.","zh":"故事里反派到最后一章已经死透了。"}]}],"synonyms":["door nail","clench nail"],"phonetic":"/ˈdɔrˌneɪl/","extraExplanation":["“dead as a doornail”很常见，常用来夸张地强调“彻底没用/完全没有反应”，不一定真的指死亡。","关于为什么是doornail：传统门钉会被“折弯钉尖”加固，一旦这样处理就很难再重复使用，因此被联想到“彻底结束、没法复活”。该说法在英语里很早就出现，狄更斯《圣诞颂歌》（A Christmas Carol）开头也用过这句来强调人物已死。"]}
{"word":"doornails","summary":{"en":"Doornails are nails used in doors; the word is most commonly seen in the idiom “dead as a doornail,” meaning completely dead or finished.","zh":"doornails 指门钉；更常见于习语 “dead as a doornail”，表示“彻底死了/完全完蛋了”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of doornail) a large nail used to fasten parts of a door, especially in older buildings.","zh":"（doornail 的复数）门钉；（尤指旧式建筑中）用来固定门板的大钉子。"},"examples":[{"en":"The old wooden door was held together with iron doornails.","zh":"那扇老木门是用铁门钉固定起来的。"},{"en":"You can still see the doornails on the barn door.","zh":"你仍然能在谷仓门上看到那些门钉。"}]},{"partOfSpeech":"phrase","definition":{"en":"Used mainly in the idiom “dead as a doornail,” meaning completely dead or unquestionably finished (often said humorously or emphatically).","zh":"主要用于习语 “dead as a doornail”，表示“彻底死了 / 完全没希望了 / 肯定完蛋了”（常带夸张或幽默语气）。"},"examples":[{"en":"Without power, the old computer is dead as a doornail.","zh":"没电了，那台旧电脑彻底没戏了。"},{"en":"Their plan was dead as a doornail after the budget cuts.","zh":"预算被砍后，他们的计划彻底泡汤了。"},{"en":"In the story, the villain is described as “dead as a doornail.”","zh":"在故事里，反派被形容为“死得透透的”。"}]}],"synonyms":["nails","door nails","dead as a doornail (idiom)"],"phonetic":"ˈdɔrˌneɪlz","extraExplanation":["“doornails”这个词单独出现并不常见；更常见的是在固定搭配里（尤其是“dead as a doornail”）。","关于“dead as a doornail”的来源，一种常见解释是：旧式门钉会被从另一侧敲弯（clinch）固定，一旦弯折就很难再用，因此被比喻为“彻底、不可逆”。","该表达在英文文学中很有名，例如狄更斯《圣诞颂歌》（A Christmas Carol）开篇就写到“dead as a doornail”，强化“确实死了”的语气。"]}
{"word":"doornboom","summary":{"en":"Doornboom usually means a thorn tree in South African English (from Afrikaans), and it can also be a surname or place name.","zh":"Doornboom 通常指南非英语中的“刺树/荆棘树”（源自南非荷兰语），也可作姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, from Afrikaans) a thorn tree; a tree or shrub with sharp thorns, often referring to kinds of acacia.","zh":"（南非英语，源自南非荷兰语/Afrikaans）“刺树；荆棘树”，指带尖刺的树或灌木，常泛指某些金合欢（acacia）类植物。"},"examples":[{"en":"The cattle sheltered under a doornboom during the heat of the day.","zh":"牛群在白天炎热时躲到一棵刺树下乘凉。"},{"en":"A line of doornboom marks the edge of the dry riverbed.","zh":"一排刺树标示着干涸河床的边缘。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname or place name, especially in Southern Africa.","zh":"（专名）姓氏或地名，尤见于南部非洲地区。"},"examples":[{"en":"Ms. Doornboom will present the report at the meeting.","zh":"多恩布姆女士将在会上做报告。"},{"en":"They drove through Doornboom on the way to the reserve.","zh":"他们去保护区的路上经过了多恩布姆这个地方。"}]}],"synonyms":["thorn tree","acacia","thornbush"],"phonetic":"/ˈdɔrnˌboʊm/","extraExplanation":["“doornboom”来自南非荷兰语（Afrikaans）：doorn=“刺/荆棘”，boom=“树”。在南非的自然与农业语境（如牧场、灌木丛veld）中较常见，属于带明显地域色彩的词。"]}
{"word":"Doornik","summary":{"en":"Doornik is the Dutch name for the Belgian city of Tournai; it can also be used as a surname.","zh":"Doornik 是比利时城市图尔奈（Tournai）的荷兰语名称；也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(proper noun) The Dutch name for the city of Tournai in Belgium (Wallonia), near the French border.","zh":"（专有名词）比利时城市“图尔奈”（Tournai）的荷兰语名称，位于瓦隆大区，靠近法国边境。"},"examples":[{"en":"Doornik is called Tournai in French.","zh":"Doornik 在法语中叫 Tournai（图尔奈）。"},{"en":"We took a day trip to Doornik to see the cathedral.","zh":"我们去 Doornik（一日游）参观了大教堂。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname) found mainly in Dutch- and Flemish-speaking contexts.","zh":"（姓氏）在荷兰语/弗拉芒语语境中较常见的一个姓。"},"examples":[{"en":"Ms. Doornik will join the meeting later.","zh":"Doornik 女士稍后会参加会议。"}]}],"synonyms":["Tournai"],"phonetic":"/ˈdɔr.nɪk/","extraExplanation":["“Doornik”和“Tournai（图尔奈）”是同一座城市的不同语言名称：前者偏荷兰语/弗拉芒语用法，后者是法语用法。比利时常见这种“一城多名”，与当地多语言环境有关。","图尔奈以中世纪建筑闻名，最著名的是圣母大教堂（Cathédrale Notre-Dame de Tournai）。在旅行、地图或历史资料里，可能会交替看到 Doornik/Tournai。"]}
{"word":"doorpiece","summary":{"en":"Doorpiece most often means a decorative artwork or ornament on/above a doorway; more rarely, it can mean a structural piece of the doorway.","zh":"doorpiece 多指门口（尤其门上方）的装饰物/装饰板；较少情况下也可指门口的某个结构构件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative panel, carving, painting, or other ornament placed on or above a doorway (especially above the door).","zh":"（尤指门上方的）门饰；门楣上的装饰板/雕刻/画作等。"},"examples":[{"en":"The old townhouse had a carved doorpiece showing flowers and vines.","zh":"那栋老联排别墅的门饰上雕着花朵和藤蔓。"},{"en":"In the museum, the doorpiece above the entrance tells a story from local history.","zh":"在博物馆里，入口上方的门饰讲述了一段当地历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a structural piece associated with a doorway, such as part of the frame or the horizontal beam above the door.","zh":"（罕见）与门口结构有关的构件，如门框的一部分或门上方的横梁。"},"examples":[{"en":"The carpenter replaced the damaged doorpiece to stop the frame from wobbling.","zh":"木匠更换了损坏的门口构件，让门框不再晃动。"}]}],"synonyms":["overdoor","door ornament","lintel (for the structural sense)"],"phonetic":"/ˈdɔrˌpis/","extraExplanation":["“doorpiece”在现代日常英语里不常见，更常用的对应词是“overdoor”（门上方的装饰）或更具体的“lintel”（门楣/过梁，偏结构）。在古建筑与室内装饰语境中，“doorpiece”常指门口上方的装饰性构件，带有艺术与时代风格信息。"]}
{"word":"doorplate","summary":{"en":"A doorplate is a small sign or plate by a door that identifies the person, office, or room.","zh":"doorplate 指门口用于识别人员、办公室或房间的小标牌/门牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sign or plate fixed on or near a door that shows a name, room number, office, or other identifying information","zh":"门牌；门口的标牌（通常标示姓名、房间号、办公室等信息）"},"examples":[{"en":"The doctor’s doorplate says “Dr. Chen, Pediatrics.”","zh":"医生的门牌写着“陈医生，儿科”。"},{"en":"Please check the doorplate to find the correct meeting room.","zh":"请看门牌，找到正确的会议室。"}]}],"synonyms":["nameplate","door sign","plaque","sign","room number plate"],"phonetic":"/ˈdɔrˌpleɪt/","extraExplanation":["“doorplate”在英式英语里更常见；美式英语里更常用“nameplate”（姓名牌/铭牌）或“door sign”（门牌/门口标志）。","在公寓或宿舍语境中，也常见更具体的说法：如“door number”（门牌号）或“room plaque”（房间铭牌，较正式）。"]}
{"word":"doorplates","summary":{"en":"Doorplates are plates on or beside doors that show names, numbers, or other information.","zh":"doorplates 指装在门上或门旁、用于显示姓名/号码等信息的门牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plate attached to a door (or next to it) that shows a name, room number, or other information; a nameplate for a door.","zh":"门牌；门牌标识（装在门上或门旁，用来显示姓名、房间号或其他信息）"},"examples":[{"en":"The doctor’s doorplate had her name and office hours on it.","zh":"医生的门牌上写着她的名字和门诊时间。"},{"en":"Please check the doorplates to find the correct meeting room.","zh":"请查看门牌以找到正确的会议室。"}]}],"synonyms":["nameplates","door signs","plaques"],"phonetic":"/ˈdɔrˌpleɪts/","extraExplanation":["在英式英语里更常见的说法是 nameplate（门牌/姓名牌）或 door sign（门牌标识）。在公寓和办公室环境中，doorplate 往往指显示住户/员工姓名或房间编号的小牌子。","复数形式 doorplates：单数是 doorplate。常见搭配：a brass doorplate（黄铜门牌）、a doorplate with a name/number（带姓名/号码的门牌）、replace/update the doorplate（更换/更新门牌）。"]}
{"word":"doorpost","summary":{"en":"A doorpost is a vertical side piece of a door frame that helps support the door.","zh":"doorpost 指门框两侧的竖直立柱，用于支撑门扇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vertical post on the side of a door frame that supports the door and where the hinges or latch may attach","zh":"门框两侧的竖直立柱（支撑门扇，铰链或门闩常固定在上面）"},"examples":[{"en":"He leaned against the doorpost and waited.","zh":"他倚在门框边的立柱上等待。"},{"en":"The hinge was loose, so we tightened the screws on the doorpost.","zh":"铰链松了，所以我们把门框立柱上的螺丝拧紧。"}]}],"synonyms":["doorjamb","jamb","door frame (general)"],"phonetic":"/ˈdɔrˌpoʊst/","extraExplanation":["doorpost 常见于较书面或叙述性的语境；日常口语里，人们更常说 door frame（门框）或 door jamb（门框侧柱/门框边）。在建筑术语中，door jamb 更精确，指门框两侧的竖木/竖框。","在文化与文学语境中，doorposts 有时会被用作“门口、家门界限”的象征。一个著名用法来自《圣经·出埃及记》，在逾越节故事里人们把血涂在门框/门柱上作为标记（英语常写 doorposts）。"]}
{"word":"doorposts","summary":{"en":"Doorposts are the vertical side pieces of a door frame.","zh":"Doorposts 指门框两侧的竖直立柱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the two upright sides of a door frame (the vertical pieces that a door closes against)","zh":"门框的两侧立柱（门洞两边竖直的框架部分，门关上时贴合的地方）"},"examples":[{"en":"He leaned against the doorpost while waiting.","zh":"他等着的时候靠在门框立柱上。"},{"en":"The carpenter checked that the doorposts were straight before hanging the door.","zh":"木匠在装门之前先检查门框立柱是否笔直。"}]}],"synonyms":["doorjambs","uprights"],"phonetic":"/ˈdɔrˌpoʊsts/","extraExplanation":["在英语里也常用单数 doorpost（一个门框立柱）。doorposts 是复数，通常指门框两边的两根立柱。","在文化与宗教语境中，doorposts 有时会出现在《圣经》相关表达里（如把记号涂在门框/门柱上），用来象征保护或身份标记；具体含义取决于上下文。"]}
{"word":"doors","summary":{"en":"“Doors” is the plural of “door,” meaning physical doors, entrances, and metaphorically opportunities.","zh":"“doors”是“door”的复数，既指实体的门/入口，也常比喻“机会、出路”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A movable panel that opens and closes an entrance to a room, building, vehicle, etc.","zh":"门；（房间、建筑、车辆等的）可开合的门板。"},"examples":[{"en":"Please close the door when you leave.","zh":"你离开时请把门关上。"},{"en":"Someone is knocking at the door.","zh":"有人在敲门。"}]},{"partOfSpeech":"n.","definition":{"en":"An entrance or doorway (often used in phrases like “at the door”).","zh":"入口；门口（常用于短语，如 at the door）。"},"examples":[{"en":"They were waiting at the door.","zh":"他们在门口等着。"}]},{"partOfSpeech":"n.","definition":{"en":"A chance or opportunity (usually in the phrase “open the door to”).","zh":"机会；可能性（常用于短语 open the door to）。"},"examples":[{"en":"This course can open the door to better jobs.","zh":"这门课程能为更好的工作打开机会之门。"},{"en":"Her success opened doors for other young artists.","zh":"她的成功为其他年轻艺术家打开了道路。"}]}],"synonyms":["entrance","doorway","gate","opportunity (figurative)"],"phonetic":"/dɔrz/","extraExplanation":["“doors”是“door”的复数形式。英语里也常把“doors”用作比喻，表示“机会、出路”，尤其在表达“open doors / open the door to …（为……打开机会）”时很常见。","相关常用搭配：behind closed doors（私下里/不公开地）；next door（隔壁）；show someone the door（请某人离开，带有不客气的语气）；hold the door (open) for someone（为某人扶门）。"]}
{"word":"doorsill","summary":{"en":"A doorsill is the bottom horizontal part of a doorway, like a threshold.","zh":"doorsill 指门口底部的横条/门槛，也可理解为 threshold（门槛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the horizontal bottom part of a doorway (the piece you step over when you enter)","zh":"门槛；门口底部的横木/横条（进门时脚跨过的那一条）"},"examples":[{"en":"Be careful not to trip on the doorsill.","zh":"小心别在门槛上绊倒。"},{"en":"She wiped the dust off the doorsill before opening the door.","zh":"她在开门前先把门槛上的灰尘擦掉。"},{"en":"The cat sat on the doorsill and watched people walk by.","zh":"猫坐在门槛上，看着人来人往。"}]}],"synonyms":["threshold","door sill"],"phonetic":"/ˈdɔrˌsɪl/","extraExplanation":["“doorsill”在美式英语里更常见的拼写是“door sill”，也常直接说“threshold（门槛）”。在英式英语中也会看到“doorstep（门阶/门口台阶）”，但它更强调门外的台阶或门口处。"]}
{"word":"doorsills","summary":{"en":"Doorsills are the bottom horizontal parts of doorways that you step over.","zh":"Doorsills 指门口底部的横向门槛/门洞底边，进出时会跨过去的那一条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the horizontal piece at the bottom of a doorway (often wood, stone, or metal) that forms the base of the door opening","zh":"门口最底部的横向构件（常为木、石或金属），构成门洞的底边"},"examples":[{"en":"Wipe your feet before you step over the doorsill.","zh":"跨过门槛前先把脚擦干净。"},{"en":"Rainwater pooled on the doorsill and leaked inside.","zh":"雨水积在门槛上，渗进了屋里。"},{"en":"The cat sat on the doorsill watching people pass by.","zh":"猫坐在门槛上，看着人来人往。"}]}],"synonyms":["threshold","sill","door threshold"],"phonetic":"/ˈdɔrˌsɪl/","extraExplanation":["“doorsill”更常见的写法是两词形式“door sill”。在日常英语里，人们也常用“threshold（门槛/门口）”来指门口这一带的边界，有时包含更抽象的含义（如“人生的门槛/临界点”）。而“door sill/doorsill”更偏向具体的建筑构件。"]}
{"word":"doorstead","summary":{"en":"Doorstead is an old-fashioned word meaning the threshold or entrance area at a door.","zh":"Doorstead 是较古旧的词，指门槛或门口的入口处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned) the threshold of a door; the doorway or entrance area of a house.","zh":"（较古旧）门槛；门口；门前入口处。"},"examples":[{"en":"She paused on the doorstead before stepping inside.","zh":"她在门槛前停了一下，然后才走进去。"},{"en":"A stranger stood at our doorstead asking for directions.","zh":"一个陌生人站在我们家门口问路。"}]}],"synonyms":["threshold","doorway","entrance","doorstep"],"phonetic":"/ˈdɔrˌstɛd/","extraExplanation":["“doorstead”在现代英语里很少用，带有文学/古风色彩，常见于描写房屋入口、人物在门口停留或来访者出现的场景。","词源上可理解为 door（门）+ stead（位置、所在之处），意思就是“门所在的位置/门口”。"]}
{"word":"doorstep","summary":{"en":"“Doorstep” most commonly means the step/area at a building’s entrance; it can also mean visiting someone without warning.","zh":"“doorstep”最常指门口的台阶/入口处；也可作动词，表示突然上门拜访（不预约）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the area or step at the entrance of a house or building (the threshold)","zh":"门口的台阶；门槛处（门前入口处）"},"examples":[{"en":"Please leave the package on the doorstep.","zh":"请把包裹放在门口。"},{"en":"They sat on the doorstep and talked until dark.","zh":"他们坐在门口聊到天黑。"}]},{"partOfSpeech":"v.","definition":{"en":"to visit someone unexpectedly or without an appointment, especially at their home","zh":"（尤其指到家里）突然上门拜访；不请自来"},"examples":[{"en":"I’m sorry to doorstep you, but I needed to talk in person.","zh":"抱歉冒昧上门，但我需要当面谈谈。"},{"en":"Salespeople used to doorstep customers more often.","zh":"过去推销员更常上门推销。"}]}],"synonyms":["threshold","entryway","front step","porch","show up unexpectedly","drop by unannounced"],"phonetic":"/ˈdɔrˌstɛp/","extraExplanation":["“doorstep”作动词在英式英语里更常见，尤其用于“doorstep someone”（突然上门找某人）或“doorstep interview”（在门口堵访式采访）。美式英语中更常用“show up unexpectedly”“drop by unannounced”等表达。"]}
{"word":"doorsteps","summary":{"en":"“Doorsteps” is the plural of “doorstep”: the step/threshold at an entrance, and figuratively something very near or about to happen. It can also be a verb meaning journalists suddenly visiting someone’s home for questions.","zh":"“doorsteps”是“doorstep”的复数：指门阶/门口，也可比喻“近在咫尺、找上门、即将发生”。还可作动词，指（尤指记者）上门突击采访。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the step or threshold at the entrance of a house or building; the area immediately outside the door","zh":"（房屋或建筑入口处的）门阶；门槛；门口一带"},"examples":[{"en":"Please leave the package on the doorstep.","zh":"请把包裹放在门阶上。"},{"en":"Wet shoes left mud all over the doorstep.","zh":"湿鞋子把门口的门阶弄得都是泥。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) very near to a person or place; about to happen or arrive","zh":"（比喻）在…门口；近在咫尺；即将发生/到来"},"examples":[{"en":"Trouble was on their doorstep after the argument.","zh":"争吵之后，麻烦就找上门了。"},{"en":"A new opportunity is right on your doorstep.","zh":"一个新的机会近在咫尺。"}]},{"partOfSpeech":"v.","definition":{"en":"to visit someone unexpectedly (especially journalists visiting a person’s home to ask questions)","zh":"（尤指记者）上门突击采访；突然登门询问"},"examples":[{"en":"Reporters doorstepped the actor outside his home.","zh":"记者在演员家门口对他进行了突击采访。"},{"en":"She was doorstepped by the press after the trial.","zh":"审判结束后，媒体上门对她进行突击采访。"}]}],"synonyms":["threshold","front step","entryway","on the doorstep (near/impending)","ambush interview (for the verb sense)"],"phonetic":"/ˈdɔrˌstɛp/","extraExplanation":["“doorsteps”是名词复数，单数是“doorstep”。在新闻语境里，动词“to doorstep”常带有“突然上门、给人压力”的感觉，语气可能偏负面。","常见搭配：on your doorstep（近在咫尺/就在门口）、leave sth on the doorstep（把某物放在门口）、right at the doorstep（就在门口/迫在眉睫）。"]}
{"word":"doorstone","summary":{"en":"A doorstone is the stone at a doorway, especially the threshold stone.","zh":"doorstone 指门口的石头，尤其是门槛石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stone used at the entrance of a building, especially as the threshold (the stone you step over/onto when entering).","zh":"门口用的石头，尤指门槛石（进门时脚会跨过或踩到的那块石头）。"},"examples":[{"en":"He wiped the mud off his boots on the doorstone before stepping inside.","zh":"他在进屋前先在门槛石上把靴子上的泥蹭掉。"},{"en":"The old cottage still has its original doorstone, worn smooth by years of use.","zh":"那间老小屋还保留着原来的门槛石，经过多年踩踏已经被磨得很光滑。"}]}],"synonyms":["threshold stone","threshold","doorstep (stone)"],"phonetic":"/ˈdɔɹˌstoʊn/","extraExplanation":["“doorstone”不是现代最常用的词；更常见的说法是 “threshold stone” 或直接说 “threshold”。在英国英语里也可能见到 “doorstone” 用来描写老房子、石砌建筑的门口细节，带一点文学或地方色彩。"]}
{"word":"doorstop","summary":{"en":"A doorstop is something used to hold a door open; it can also mean a very thick, heavy book or pile of papers (humorous).","zh":"doorstop 指“门挡/门楔”；也可幽默地指“厚得像能顶门一样的大部头书或一大叠文件”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An object (often a wedge or a heavy weight) used to keep a door open or to stop it from moving.","zh":"（门挡）用来把门撑开、固定住或防止门移动的物体（常见为楔形或较重的物件）。"},"examples":[{"en":"I put a doorstop under the door so it wouldn’t slam shut.","zh":"我把门挡塞在门下面，这样门就不会“砰”地关上。"},{"en":"The classroom doorstop keeps the door open for fresh air.","zh":"教室的门挡让门保持打开，方便通风。"}]},{"partOfSpeech":"n.","definition":{"en":"A thick stack of printed pages or a very large book (often used humorously) that feels as heavy as something you could prop a door open with.","zh":"（幽默用法）厚厚一叠打印纸或一本很厚的大书，大到重得像可以拿来顶门。"},"examples":[{"en":"My biology textbook is a real doorstop—over a thousand pages.","zh":"我的生物课本真是“门挡级别”的厚——一千多页。"},{"en":"He dropped a doorstop of a report on my desk.","zh":"他把一份厚得夸张的报告“咚”地放到我桌上。"}]}],"synonyms":["door wedge","door holder","door chock","brick (informal, for a heavy book)"],"phonetic":"/ˈdɔɹˌstɑp/","extraExplanation":["“doorstop”是由 door（门）+ stop（阻止/停止）组合而成的复合名词。第二个意思属于口语里的夸张比喻：把“很厚很重的书/文件”比作能用来顶住门的东西。"]}
{"word":"doorstops","summary":{"en":"Doorstops are objects used to hold a door in place; informally, a “doorstop” can also mean a very thick, heavy book.","zh":"Doorstops 指“门挡/挡门器”；在非正式用法中也可指“很厚很重（常暗示难读）的书”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heavy object placed at the bottom of a door to keep it from closing or to stop it from opening too far","zh":"（门的）挡门器；门挡（放在门底部，用来阻止门关上或开得过头的重物）"},"examples":[{"en":"Please put a doorstop there so the door doesn’t slam shut.","zh":"请在那儿放个门挡，这样门就不会砰地关上。"},{"en":"The hotel room had a rubber doorstop behind the door.","zh":"酒店房间的门后面有一个橡胶门挡。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a very thick, heavy book—often implying it is dull or hard to read","zh":"（非正式）“大部头”（很厚很重的书，常带有“沉闷/难啃”的暗示）"},"examples":[{"en":"I tried reading the textbook, but it felt like a doorstop.","zh":"我试着读那本教材，但感觉就是本“大部头”，很难啃。"},{"en":"That 900-page novel is a real doorstop.","zh":"那本900页的小说真是个“大部头”。"}]}],"synonyms":["door wedge","door holder","door block","(informal) brick (book)","tome"],"phonetic":"/ˈdɔɹˌstɑp/","extraExplanation":["“doorstop”由 door（门）+ stop（阻止物/停止）组成。作比喻用法时，把“厚重的书”想象成“可以拿来挡门的东西”，常用于口语或评论。"]}
{"word":"doorward","summary":{"en":"Doorward means “toward the door” (literary/old-fashioned). It can also mean “doorkeeper” (archaic).","zh":"doorward 意为“朝门口（去）”（文学/较旧用法）；也可指“门卫、看门人”（古旧用法）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the door; in the direction of the door (often used in literary or older writing).","zh":"朝门的方向；向门口去（多见于文学或较旧的用法）。"},"examples":[{"en":"Hearing the knock, she stepped doorward and opened it slowly.","zh":"听到敲门声，她朝门口走去，慢慢把门打开。"},{"en":"He glanced doorward, hoping someone would arrive and end the awkward silence.","zh":"他朝门口瞥了一眼，希望有人进来结束这尴尬的沉默。"}]},{"partOfSpeech":"n.","definition":{"en":"A doorkeeper; someone who guards or attends a door (archaic).","zh":"门卫；看门人（古旧用法）。"},"examples":[{"en":"In the old tale, the doorward refused entry to strangers after dusk.","zh":"在那个古老的故事里，门卫黄昏后拒绝陌生人进入。"}]}],"synonyms":["toward the door","to the door","doorwards (rare)","doorkeeper (for the noun sense)"],"phonetic":"/ˈdɔr.wɚd/","extraExplanation":["“doorward”在现代英语中很少见，更常用的表达是“toward the door / to the door / in the direction of the door”。它常出现在较有文学感或古风的叙述里，用来让句子更凝练、节奏更强。"]}
{"word":"doorwards","summary":{"en":"“Doorwards” means “toward the door.” It’s uncommon and slightly literary.","zh":"“doorwards”表示“朝门的方向”，较少用，带一点书面/文学色彩。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the door; in the direction of the door.","zh":"朝门的方向；往门口去。"},"examples":[{"en":"Hearing the knock, she stepped doorwards to see who was there.","zh":"听到敲门声，她朝门口走去看看是谁。"},{"en":"He glanced doorwards, ready to leave if things got awkward.","zh":"他朝门口瞥了一眼，准备在气氛尴尬时离开。"}]}],"synonyms":["toward the door","to the door","in the direction of the door"],"phonetic":"/ˈdɔr.wɚdz/","extraExplanation":["“doorwards”较少见，语气偏书面或带一点老派/文学感。日常英语更常说：toward the door / to the door / in the direction of the door。","构词很好理解：door + -wards（表示“朝……方向”，如：homewards“朝家”、upwards“向上”、backwards“向后”）。在英式英语里也常见拼写“doorward(s)”。"]}
{"word":"doorway","summary":{"en":"A doorway is the entrance/opening where a door is (or could be), and it can also mean a figurative path into a new opportunity.","zh":"doorway 指门口/出入口（门所在的开口处），也可比喻通向新机会或新阶段的途径。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An entrance to a room or building, especially the open space where a door is or could be.","zh":"门口；出入口（尤指门所在或可安装门的开口处）"},"examples":[{"en":"She stood in the doorway and waved goodbye.","zh":"她站在门口挥手告别。"},{"en":"Please don’t block the doorway.","zh":"请不要堵住门口。"}]},{"partOfSpeech":"n.","definition":{"en":"A way to enter a new situation, opportunity, or stage of life (a figurative “entrance”).","zh":"（比喻）通向新局面/机会/人生阶段的途径；门路"},"examples":[{"en":"This course can be a doorway to a better job.","zh":"这门课程可能是通往更好工作的门路。"},{"en":"Learning English opened a doorway to new friendships.","zh":"学英语为我打开了结交新朋友的大门。"}]}],"synonyms":["entrance","entryway","door (literal)","gateway (figurative)","portal (figurative)"],"phonetic":"/ˈdɔrˌweɪ/","extraExplanation":["“Doorway”常强调“开口/入口的位置”，不一定包含门本身；而“door”通常指“门（可开合的那扇）”。因此你可以说“in the doorway（站在门口/门框里）”，但一般不会说“in the door”。","在文学或日常表达中，doorway经常带有“门槛、过渡、改变”的象征意义，比如“standing in the doorway of adulthood（站在成年的门槛上）”。"]}
{"word":"doorways","summary":{"en":"Doorways are entrances (plural of doorway), and can also mean opportunities to enter new experiences.","zh":"Doorways 是 doorway 的复数，指多个门口/入口；也可比喻通往新经历的机会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of doorway: the openings in a wall that you pass through to enter or leave a room or building; the space around the door frame","zh":"doorway 的复数：墙上供人进出房间或建筑的门口；也可指门框周围的入口空间"},"examples":[{"en":"Please don’t leave your shoes in the doorways—they block people from walking through.","zh":"请别把鞋放在门口——会挡住别人通行。"},{"en":"Light spilled from the doorways into the dark hallway.","zh":"光从各个门口洒进昏暗的走廊。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) chances or ways to enter a new situation, experience, or stage of life","zh":"（比喻）进入新处境、新经历或人生新阶段的机会、途径"},"examples":[{"en":"Education can open doorways to better jobs.","zh":"教育能打开通往更好工作的机会之门。"},{"en":"A single conversation became one of the doorways into a new community.","zh":"一次谈话成了进入新社群的途径之一。"}]}],"synonyms":["entrances","door openings","entryways","portals","access points"],"phonetic":"/ˈdɔrˌweɪz/","extraExplanation":["“doorway(s)”既可以指具体的“门口/门洞”，也常用于比喻“机会之门”。写作中常见搭配：open doorways to…（为……打开机会）、through the doorway（跨过门槛＝进入新阶段）。","文学与叙事里，“doorway”常象征“界线/转折点”（从一个世界进入另一个世界），比如描写人物站在门口犹豫，暗示即将做出重要选择。"]}
{"word":"doorweed","summary":{"en":"Doorweed usually means a common low-growing weed found near paths and doorways; rarely, it can mean marijuana in slang.","zh":"doorweed通常指常见的贴地生长、容易在门口或路边出现的杂草；少数情况下也可作俚语指“大麻”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low-growing weed (often prostrate knotweed) that commonly spreads along paths, cracks, and around doorways.","zh":"（常指）匍匐蓼/扁蓼一类的杂草，常沿小路、缝隙和门口附近蔓延。"},"examples":[{"en":"Doorweed is hard to pull because it grows flat against the ground.","zh":"门口草很难拔，因为它贴着地面生长。"},{"en":"We found doorweed filling the cracks in the sidewalk by the front door.","zh":"我们发现前门旁人行道的裂缝里长满了门口草。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, rare) marijuana; cannabis.","zh":"（俚语，较少见）大麻。"},"examples":[{"en":"Some people use “doorweed” as a joking slang word for marijuana.","zh":"有些人会把“doorweed”当作开玩笑的俚语来指大麻。"}]}],"synonyms":["knotweed","prostrate knotweed","weed"],"phonetic":"/ˈdɔrˌwid/","extraExplanation":["“doorweed”这个名字很直观：door（门）+ weed（杂草），因为它常在门口、路边或砖缝等被踩踏的地方贴地生长。不同地区对这种植物的具体指代可能不完全一致，常见对应是英语里说的 prostrate knotweed（匍匐蓼）。","作为俚语指“大麻”的用法较少见，更多是出于幽默或口语替代；正式场合不建议使用。"]}
{"word":"doorwise","summary":{"en":"Doorwise means “toward the door” or “by/near the door,” but it’s uncommon in modern English.","zh":"doorwise 表示“朝门口去”或“在门边/靠近门口”，但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in the direction of the door; toward the door","zh":"朝门的方向；向门口去"},"examples":[{"en":"Hearing a knock, she stepped doorwise to see who it was.","zh":"听到敲门声，她朝门口走去看看是谁。"},{"en":"The dog ran doorwise when it heard the leash.","zh":"狗一听到牵引绳的声音就朝门口跑去。"}]},{"partOfSpeech":"adv.","definition":{"en":"near or at the door; by the doorway","zh":"在门边；靠近门口"},"examples":[{"en":"Leave your shoes doorwise so you don’t track dirt inside.","zh":"把鞋放在门边，这样就不会把脏东西带进屋里。"}]}],"synonyms":["toward the door","to the door","by the door","near the door"],"phonetic":"/ˈdɔrˌwaɪz/","extraExplanation":["“-wise”这个后缀常表示“朝……方向/就……而言/以……方式”（如: clockwise 顺时针；lengthwise 纵向地；otherwise 否则）。因此 doorwise 结构上就是“朝门/在门那边”的意思。","doorwise 在现代英语里很少见，更常用的表达是 “toward the door / to the door / by the door / near the door”。它偶尔会出现在较老的文学描写或为追求节奏、风格而使用的写法中。"]}
{"word":"dooryard","summary":{"en":"A dooryard is the area of ground right outside a house door; a somewhat old-fashioned/regional word for the space near the entrance.","zh":"dooryard 指房屋门外、靠近入口的一片空地或院子；带有较旧或地区性的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A yard or small area of ground right outside a door, especially the space around the entrance of a house (common in some U.S. regional and older writing).","zh":"门前院子；门外的一小块空地（在美国一些地区或较旧的文章中较常见）。"},"examples":[{"en":"She left the pumpkins in the dooryard beside the steps.","zh":"她把南瓜放在门前院子里，就在台阶旁边。"},{"en":"Children were playing in the dooryard before supper.","zh":"晚饭前，孩子们在门前院子里玩。"}]}],"synonyms":["front yard","yard","forecourt","entryway area"],"phonetic":"/ˈdɔrˌjɑrd/","extraExplanation":["“Dooryard”在现代英语里相对少见，更常见的说法是“front yard（前院）”“yard（院子）”或“by the front door（在前门口）”。它常带有乡村、家庭生活气息，在美国东北部、新英格兰等地区写作中更容易看到。","在一些文学作品或乡土叙事里，用“dooryard”能强调“家门口那片土地”的亲切与日常感。"]}
{"word":"dooryards","summary":{"en":"“Dooryards” means the yard areas right outside the doors of houses.","zh":"“Dooryards”指房屋门口外紧邻的院地，是“dooryard”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the areas of land directly outside one or more doors of a house (the yard near the entrance); plural of “dooryard.”","zh":"房屋门外紧邻的院地、门前空地；“dooryard”的复数。"},"examples":[{"en":"The children played in the dooryards while their parents talked on the porch.","zh":"孩子们在门前的院地里玩，大人们在门廊上聊天。"},{"en":"In older villages, you might see gardens, benches, or tools in people’s dooryards.","zh":"在较老的村落里，你可能会在人们的门前院地看到花园、长椅或工具。"}]}],"synonyms":["front yards","yards","entrances","porch areas"],"phonetic":"/ˈdɔrˌjɑrdz/","extraExplanation":["“dooryard”在美式英语里带有一点乡村或旧时的味道，常见于新英格兰等地区，用来指房子门口附近那一小片院地。日常更常说“front yard / yard / front porch area”。"]}
{"word":"Doostoevsky","summary":{"en":"Dostoevsky is a famous Russian novelist known for deep psychological and moral themes.","zh":"Dostoevsky 指著名的俄罗斯小说家陀思妥耶夫斯基，以深刻的心理与道德主题闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Fyodor Dostoevsky (1821–1881), a major Russian novelist known for psychologically deep stories about morality, faith, crime, and human suffering.","zh":"（专有名词）费奥多尔·陀思妥耶夫斯基（1821–1881），俄罗斯重要小说家，以深入的心理刻画著称，常探讨道德、信仰、犯罪与人类苦难等主题。"},"examples":[{"en":"I’m reading Dostoevsky’s novel Crime and Punishment.","zh":"我在读陀思妥耶夫斯基的小说《罪与罚》。"},{"en":"Many writers admire Dostoevsky for his complex characters and moral questions.","zh":"许多作家敬佩陀思妥耶夫斯基，因为他的人物复杂、道德问题深刻。"},{"en":"In literature class, we compared Dostoevsky and Tolstoy.","zh":"在文学课上，我们比较了陀思妥耶夫斯基和托尔斯泰。"}]}],"synonyms":["Fyodor Dostoevsky","Dostoyevsky"],"phonetic":"ˌdɔstəˈjɛfski","extraExplanation":["你输入的“Doostoevsky”更常见的拼写是 **Dostoevsky**（也常译作“陀思妥耶夫斯基”）。","他的重要作品包括《罪与罚》（Crime and Punishment）、《卡拉马佐夫兄弟》（The Brothers Karamazov）、《白痴》（The Idiot）。常见主题有：罪与救赎、自由意志、良心与道德选择、宗教信仰与怀疑等。","在英语里，人们常直接用姓氏“Dostoevsky”来指这位作家；更正式的全名是 **Fyodor Dostoevsky**。"]}
{"word":"doover","summary":{"en":"“Doover” is an informal spelling of “do-over / do over,” meaning a redo or a chance to try again.","zh":"“doover”是“do-over / do over”的非正式拼法，表示“重做、重来、再试一次”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a second chance to do something again, usually because the first attempt was not successful or not satisfactory; a redo","zh":"（通常因第一次不理想而）重新来一次；重做；再试一次"},"examples":[{"en":"Can I get a do-over? I said the wrong thing.","zh":"我能重新来一次吗？我刚才说错话了。"},{"en":"The teacher allowed a do-over on the test for students who missed class.","zh":"老师允许缺课的学生把测验重做一次。"}]},{"partOfSpeech":"phrase","definition":{"en":"to do something again from the beginning; to redo","zh":"从头再做一次；重来；重做"},"examples":[{"en":"Let’s do over the introduction—it doesn’t sound clear.","zh":"我们把开头重写一下——听起来不够清楚。"},{"en":"If you make a mistake, you can do it over.","zh":"如果你犯了错，你可以重来一遍。"}]}],"synonyms":["redo","retry","second chance","try again","start over"],"phonetic":"/ˈduːˌoʊvər/","extraExplanation":["“doover”常见是把“do-over / do over”连写的非正式拼法；更标准的写法是名词“do-over”（常用连字符）或动词短语“do over / do it over”。","在口语和体育比赛里很常见：比如投球失误、发球失误时说“Do-over!”表示“重来一球/重来一次”。"]}
{"word":"dooxidize","summary":{"en":"“dooxidize” is not standard; it most likely refers to “deoxidize” (remove oxygen) or to the verb “oxidize” (undergo oxidation).","zh":"“dooxidize”不是标准拼写；多半指“deoxidize（脱氧）”，或动词“oxidize（氧化）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually written as) deoxidize: to remove oxygen from a substance; to prevent or reverse oxidation (especially in metals or chemical processes).","zh":"（通常写作）deoxidize：从物质中去除氧；防止或逆转氧化（常用于金属或化学工艺）。"},"examples":[{"en":"Steel makers deoxidize the molten metal to improve its quality.","zh":"炼钢时会对熔融金属进行脱氧，以提高质量。"},{"en":"This chemical is used to deoxidize water in industrial boilers.","zh":"这种化学品用于工业锅炉水的脱氧处理。"}]},{"partOfSpeech":"v.","definition":{"en":"oxidize: to combine with oxygen (or lose electrons in chemistry), often causing rust or other chemical changes.","zh":"oxidize：与氧结合（或在化学中失去电子）而发生变化，常导致生锈等现象。"},"examples":[{"en":"Iron oxidizes quickly in moist air.","zh":"铁在潮湿空气中很容易氧化（生锈）。"},{"en":"Cut apples turn brown because the surface oxidizes.","zh":"切开的苹果会变褐，是因为表面发生了氧化。"}]}],"synonyms":["deoxygenate","reduce (chemistry)","remove oxygen","oxidize"],"phonetic":"/diːˈɑːksəˌdaɪz/","extraExplanation":["“dooxidize”不是常见的标准拼写。最可能是把“deoxidize（脱氧）”连写或拼错了；也可能是想表达短语“do oxidize（发生氧化/去氧化处理）”。如果你告诉我你的句子原文，我可以帮你判断应该用哪个词。"]}
{"word":"doozer","summary":{"en":"“Doozer” usually means a sleepy person who dozes a lot; it can also mean a bulldozer in informal usage.","zh":"“doozer”通常指爱打瞌睡的人；在非正式用法中也可指“推土机（bulldozer）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who dozes often; a sleepy person.","zh":"（非正式）爱打瞌睡的人；嗜睡的人。"},"examples":[{"en":"After lunch, I turn into a real doozer at my desk.","zh":"午饭后，我在工位上就会变成一个特别爱打瞌睡的人。"},{"en":"He’s a doozer on long car rides—he falls asleep in minutes.","zh":"他坐长途车特别爱困——几分钟就睡着。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A bulldozer; a large machine used to push earth or rubble.","zh":"（非正式）推土机；用于推土或清理瓦砾的大型工程机械。"},"examples":[{"en":"They brought in a doozer to clear the fallen trees after the storm.","zh":"暴风雨后，他们调来一台推土机清理倒下的树。"},{"en":"The road crew used a doozer to level the ground.","zh":"施工队用推土机把地面整平。"}]}],"synonyms":["sleepyhead","dozer","bulldozer"],"phonetic":"/ˈduːzər/","extraExplanation":["“doozer”在表示“爱打瞌睡的人”时来自动词“doze（打盹）”，属于口语、偏幽默的说法。","在工程语境里，“doozer”常被当作“bulldozer（推土机）”的缩略说法；写作中更正式的词一般用“bulldozer”。"]}
{"word":"doozers","summary":{"en":"“Doozers” means very unusual or standout things/people, often impressively big or surprisingly difficult (informal).","zh":"“doozers”指非常不寻常、很出众的事物/人物，常带“很厉害”或“很难搞”的口语语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural, informal) Very unusual, impressive, or difficult people/things—often used to mean “real standouts,” sometimes in a negative sense (a big problem).","zh":"（复数，非正式）非常不寻常、很厉害或很棘手的人/事物——常表示“很出众的家伙/东西”，有时也带贬义，指“很大的麻烦/难题”。"},"examples":[{"en":"Those math questions were doozers—I couldn’t finish them in time.","zh":"那些数学题太难了，时间不够我做完。"},{"en":"The storm last night was a doozer; it knocked out power for hours.","zh":"昨晚那场暴风雨太厉害了，停电停了好几个小时。"},{"en":"We’ve handled tough cases before, but these are doozers.","zh":"我们以前也处理过棘手的案子，但这次这些真是硬仗。"}]}],"synonyms":["doozies","standouts","blockbusters","whoppers","tough ones","head-scratchers"],"phonetic":"/ˈduːzərz/","extraExplanation":["“doozers”是口语名词复数，更常见的单数形式是“doozer”，而在美式口语里你也会经常看到“doozy”（意思几乎相同，使用频率更高）。","语气取决于上下文：可以是正向的“厉害、惊人”，也可以是负向的“棘手、麻烦”。","来源方面一般认为来自“doozy/doozie”，可能与“daisy（极好的东西）”等口语表达的类比有关；属于非正式用法，写正式文章时建议用“remarkable / exceptional / challenging”等更中性的词。"]}
{"word":"doozie","summary":{"en":"A doozie is an unusually big, intense, or remarkable thing—often surprisingly difficult or troublesome.","zh":"doozie 指“特别夸张、特别厉害/棘手的一件事”，多用于口语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something unusual, impressive, or extreme—often in a surprising, difficult, or troublesome way.","zh":"非常不寻常、很厉害或很极端的事物——常带有“让人吃惊/棘手/麻烦”的感觉。"},"examples":[{"en":"That math test was a doozie—I barely finished on time.","zh":"那次数学考试真是个“狠角色”，我差点没在规定时间内做完。"},{"en":"We had a doozie of a storm last night.","zh":"昨晚的暴风雨可真够厉害的。"},{"en":"His excuse was a doozie, but nobody believed it.","zh":"他的借口很“离谱/惊人”，但没人相信。"}]}],"synonyms":["whopper","humdinger","monster","killer (informal)","beauty (informal)"],"phonetic":"/ˈduːzi/","extraExplanation":["“doozie”是美式口语，语气偏随意，常用于夸张地表达“太狠了/太夸张了/太难搞了”。它既可用于负面（麻烦、很难），也可用于中性或正面（特别厉害、特别出众），要看上下文。","常见搭配：a doozie（一个大麻烦/狠角色）；a doozie of a + 名词（非常……的……），例如 a doozie of a problem（一个大难题）。","词源说法不完全确定；一种常见观点是与早期俚语“daisy（极好的东西）”的表达方式相近，后来在口语中演变成“doozie”。"]}
{"word":"doozies","summary":{"en":"“Doozies” means unusually extreme or remarkable things (often tough, shocking, or impressive), in informal English.","zh":"“doozies”指一些特别夸张、非同寻常的事物（常是棘手、震撼或很厉害的），属非正式口语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of doozy) an unusually remarkable, surprising, or extreme thing—often something difficult, troublesome, or impressive (informal).","zh":"（doozy 的复数）非同寻常、特别夸张/惊人的事物——常指麻烦、棘手或特别厉害的东西（非正式）。"},"examples":[{"en":"That final exam had a few doozies—some questions were really hard.","zh":"那次期末考试里有几道“狠题”（难题）——有些题真的很难。"},{"en":"The storm last night was a doozy; it knocked out power across the city.","zh":"昨晚那场暴风雨太猛了；全城都停电了。"},{"en":"She told me a couple of doozies from her travel days—wild stories I could hardly believe.","zh":"她给我讲了几件旅行时的“离谱大事”——一些我几乎不敢相信的疯狂故事。"}]}],"synonyms":["whoppers","monsters","stunners","big ones","bruisers"],"phonetic":"/ˈduːzi/","extraExplanation":["“doozy”在美式英语里很口语，语气通常带一点夸张：既可表示“糟糕/棘手得要命”，也可表示“厉害/惊艳得很”，需要靠上下文判断。","词源不完全确定；一种常见说法认为可能与早期昂贵又出名的美国产汽车品牌“Duesenberg（杜森伯格）”有关，人们用它来指“特别出众的东西”。"]}
{"word":"doozy","summary":{"en":"A doozy is something unusually big, difficult, or striking—often a serious challenge or hassle.","zh":"doozy 指“非常不一般”的事物，常强调特别难、特别大或特别麻烦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something unusually big, difficult, impressive, or troublesome; a real standout (often in a challenging way).","zh":"不同寻常的“大块头/难题/麻烦事”；很厉害或很棘手的事物（常偏“难搞”）。"},"examples":[{"en":"That final exam was a doozy—I studied for days and still struggled.","zh":"期末考试太难搞了——我学了好几天还是很吃力。"},{"en":"We had a doozy of a storm last night; the power went out.","zh":"昨晚那场暴风雨真够猛的；停电了。"},{"en":"Her headache was a doozy, so she went home early.","zh":"她头痛得厉害，所以提前回家了。"}]}],"synonyms":["whopper","lulu","monster","killer","humdinger"],"phonetic":"/ˈduːzi/","extraExplanation":["“doozy”是非常口语、偏美式的说法，用来强调“特别……（大/难/糟/夸张）”。常见结构：a doozy of a + 名词（a doozy of a problem / storm / story）。","词源不完全确定，常被认为与早期美国俚语或品牌名有关；现代用法主要表达“让人印象深刻到夸张”。语气多为半开玩笑、带感叹。"]}

