{"word":"DOP","summary":{"en":"DOP most commonly means Director of Photography—the person responsible for camera and lighting in film/TV. Other meanings exist in technical contexts, so always check the field.","zh":"DOP 最常见指摄影指导（Director of Photography），负责影视的摄影与灯光。它在技术领域也可能有其他含义，需要结合语境确认。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Director of Photography: the main person in charge of a film or TV production’s camera work and lighting, working closely with the director to create the visual style.","zh":"摄影指导（Director of Photography）：影视制作中负责摄影与灯光的主要负责人，与导演密切合作来决定整体画面风格。"},"examples":[{"en":"The director and the DOP discussed how to light the night scene.","zh":"导演和摄影指导讨论了夜戏该怎么打光。"},{"en":"She started as a camera assistant and later became a DOP.","zh":"她从摄影助理做起，后来成为摄影指导。"},{"en":"The DOP chose a handheld style to make the scene feel more real.","zh":"摄影指导选择了手持拍摄风格，让场景更有真实感。"}]},{"partOfSpeech":"n.","definition":{"en":"Data Output (or other technical uses): an abbreviation used in some fields to mean output-related data, depending on the context.","zh":"数据输出（或其他技术含义）：在某些领域中用来表示与“输出”相关的数据缩写，具体含义取决于语境。"},"examples":[{"en":"Check the manual to see what DOP means in this system.","zh":"查看说明书，确认在这个系统里 DOP 具体指什么。"},{"en":"In this report, DOP refers to a type of output data.","zh":"在这份报告中，DOP 指的是一种输出数据。"}]}],"synonyms":["DP","cinematographer"],"phonetic":"/diː oʊ piː/","extraExplanation":["在影视行业里，DOP（常也写作 DP）通常指“摄影指导”。英语口语中经常把字母逐个读出来（D-O-P），而不是读成一个单词。","不同国家与团队里职位称呼会有差异：有时 DOP 更强调艺术与画面风格的整体把控；“camera operator（摄影机操作员）”更偏向具体操作摄影机。"]}
{"word":"DoP","summary":{"en":"DoP most commonly means “Director of Photography” in film/TV.","zh":"DoP 最常指影视行业的“摄影指导（Director of Photography）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(film/TV) Director of Photography; the main person responsible for the camera and lighting style of a movie or show (also called the cinematographer).","zh":"（影视）摄影指导；负责影片/节目整体摄影与灯光风格的主要负责人（也常称为“摄影师/电影摄影师”）。"},"examples":[{"en":"The DoP worked closely with the director to create a dark, moody look.","zh":"摄影指导与导演密切合作，打造出阴暗、压抑的视觉风格。"},{"en":"Ask the DoP about lens choices and lighting setups for this scene.","zh":"这场戏的镜头选择和灯光布置可以问摄影指导。"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation used in some fields to mean a “department” or “degree” of something, depending on context (less common).","zh":"（泛）在某些领域中用作缩写，表示某种“部门/程度”等，具体含义取决于语境（较不常见）。"},"examples":[{"en":"In this document, DoP is defined at the beginning, so check the glossary.","zh":"在这份文件里，DoP 的含义在开头有定义，可以查看术语表。"}]}],"synonyms":["cinematographer"],"phonetic":"/ˌdiː oʊ ˈpiː/","extraExplanation":["“DoP / DOP”在英文里有多个常见含义，最常见的是影视行业的“Director of Photography（摄影指导）”。不同公司/学科也可能把DoP当作内部缩写使用，因此最好先看上下文或文档中的定义。","注意不要和小写“dop / dope（给…用药、兴奋剂；或俚语中的‘笨蛋’等）”混淆；那是不同的词。"]}
{"word":"dop","summary":{"en":"“dop” is chiefly South African slang meaning an alcoholic drink, or to drink alcohol.","zh":"“dop”主要是南非英语俚语，表示“一杯酒/酒精饮料”，也可作动词表示“喝酒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, informal) A drink of alcohol; an alcoholic drink.","zh":"（南非英语，非正式）一杯酒；酒精饮料。"},"examples":[{"en":"He stopped for a quick dop after work.","zh":"他下班后顺便喝了一杯。"},{"en":"Some workers used to be paid partly in dop.","zh":"过去有些工人曾经部分以酒（“dop”）作为报酬。"}]},{"partOfSpeech":"v.","definition":{"en":"(South African English, informal) To drink alcohol, especially quickly or in a casual way.","zh":"（南非英语，非正式）喝酒（尤指随意地、很快地喝）。"},"examples":[{"en":"They dop at the pub on Fridays.","zh":"他们星期五会在酒吧喝酒。"},{"en":"He went outside to dop with friends.","zh":"他出去和朋友喝两杯。"}]}],"synonyms":["drink","booze (informal)","have a drink"],"phonetic":"/dɑp/","extraExplanation":["“dop”主要见于南非英语，来自南非荷兰语/南非语（Afrikaans）“dop”，原意与“帽子/盖子”有关，后来在口语里引申为“一杯酒”。","历史文化背景：南非曾存在“dop system（酒酬制）”，一些农场以酒精替代部分工资支付给工人，造成严重的社会与健康问题；今天在正式语境提到它常带批判意味。","在美式英语里，“dop”不常用；更常见的是“dope”（俚语：很酷；毒品；或给……下药/兴奋剂等）。如果你想查的是“dope”，告诉我我可以另外给你完整词条。"]}
{"word":"dopa","summary":{"en":"Dopa (L‑DOPA/levodopa) is a chemical and medication that the body turns into dopamine, commonly used for Parkinson’s disease.","zh":"Dopa（L‑DOPA/左旋多巴）是一种可在体内转化为多巴胺的化学物质与药物，常用于治疗帕金森病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical (short for L‑DOPA, levodopa) that the body can convert into dopamine; used as a medicine to treat Parkinson’s disease and some movement disorders.","zh":"一种化学物质（L‑DOPA 的简称，也叫左旋多巴/多巴），人体可将其转化为多巴胺；常用作治疗帕金森病及部分运动障碍的药物。"},"examples":[{"en":"Levodopa (L‑DOPA) is commonly prescribed to help control Parkinson’s symptoms.","zh":"左旋多巴（L‑DOPA）常被用于帮助控制帕金森病的症状。"},{"en":"Dopa helps increase dopamine levels in the brain.","zh":"多巴有助于提高大脑中的多巴胺水平。"}]}],"synonyms":["L-DOPA","levodopa"],"phonetic":"/ˈdoʊpə/","extraExplanation":["“DOPA”常见于医学与生物化学语境，完整名称是 L‑3,4‑dihydroxyphenylalanine（L‑3,4‑二羟基苯丙氨酸），临床上更常写作“L‑DOPA”或“levodopa（左旋多巴）”。","在英语科普或新闻里，提到“dopamine（多巴胺）”“Parkinson’s disease（帕金森病）”时常会顺带出现“L‑DOPA”，因为它是提升体内多巴胺的一种关键前体药物。"]}
{"word":"dopamelanin","summary":{"en":"Dopamelanin is a dark pigment produced from oxidized dopamine, mainly used in scientific contexts.","zh":"Dopamelanin 指由多巴胺氧化聚合生成的深色颜料，主要用于科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, melanin-like pigment formed when dopamine is oxidized and polymerizes; studied in brain chemistry and in materials science","zh":"一种类似黑色素的深色颜料，由多巴胺被氧化并聚合形成；常见于脑化学研究与材料科学研究中"},"examples":[{"en":"Researchers measured dopamelanin formation after dopamine was exposed to oxygen.","zh":"研究人员测量了多巴胺暴露在氧气中后形成的多巴黑色素（dopamelanin）。"},{"en":"Dopamelanin is often discussed when scientists talk about dopamine oxidation products.","zh":"当科学家讨论多巴胺氧化产物时，常会提到多巴黑色素（dopamelanin）。"}]}],"synonyms":["melanin-like pigment","dopamine-derived pigment","dopamine oxidation pigment"],"phonetic":"/ˌdoʊpəˈmɛlənɪn/","extraExplanation":["这个词属于专业术语，不是日常英语。它通常与 neuromelanin（神经黑色素）相关：神经黑色素被认为与多巴胺等儿茶酚胺在脑内的氧化/代谢过程有关。","在医学与神经科学语境中，人们有时会在讨论帕金森病（Parkinson’s disease）等与多巴胺神经元相关的话题时提到类似色素的形成与积累，但具体机制与影响仍在研究中。","在材料科学里，dopamine 氧化聚合也会与 polydopamine（聚多巴胺）一起被讨论；它们都和“多巴胺氧化后形成的深色聚合物/色素”这一类概念有关。"]}
{"word":"dopamine","summary":{"en":"Dopamine is a brain and body chemical that is central to reward and motivation and also affects movement and learning.","zh":"多巴胺是大脑与身体中的化学物质，核心作用与奖励/动机相关，也影响运动与学习。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical in the brain and body that helps control pleasure and reward, motivation, movement, attention, and learning","zh":"多巴胺：一种存在于大脑和身体中的化学物质（神经递质），帮助调节愉悦与奖励、动机、运动、注意力与学习"},"examples":[{"en":"Listening to a favorite song can trigger a dopamine release and make you feel good.","zh":"听到喜欢的歌可能会引发多巴胺释放，让你感觉愉快。"},{"en":"Dopamine plays an important role in motivation and habit-building.","zh":"多巴胺在动机与习惯形成中起着重要作用。"},{"en":"In Parkinson’s disease, dopamine levels in certain brain areas are often too low.","zh":"在帕金森病中，大脑某些区域的多巴胺水平往往过低。"}]}],"synonyms":["neurotransmitter","brain chemical"],"phonetic":"/ˈdoʊpəˌmin/","extraExplanation":["多巴胺常被媒体简化成“快乐激素”，但更准确地说，它与“奖励预期/动机”和“学习（强化）”关系很大：它不只是让你快乐，也会影响你想不想去做、会不会重复去做。","日常表达里出现的“dopamine hit/rush”（多巴胺冲击/快感）多用于口语，描述刷短视频、吃甜食、购物等带来的短暂兴奋；学习英语时要注意这类说法偏非正式。","词源：dopamine 来自化学名词 dopa + -amine（胺），属于科学术语；在医学或科普语境中很常见。"]}
{"word":"dopamine-mediated","summary":{"en":"“Dopamine-mediated” means a process or effect that happens through the action of dopamine, especially in the brain and nervous system.","zh":"“dopamine-mediated”指某种过程或效应是通过多巴胺的作用而发生的，常用于描述大脑与神经系统相关机制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Controlled, influenced, or carried out through the action of dopamine (a brain chemical that helps transmit signals between nerve cells).","zh":"由多巴胺（大脑中的一种化学物质，帮助神经细胞之间传递信号）所调控、影响或介导的。"},"examples":[{"en":"Researchers found that dopamine-mediated learning is stronger when rewards are unexpected.","zh":"研究人员发现，当奖励出乎意料时，由多巴胺介导的学习会更强。"},{"en":"Addiction can involve dopamine-mediated changes in the brain’s reward system.","zh":"成瘾可能涉及大脑奖赏系统中由多巴胺介导的改变。"}]},{"partOfSpeech":"adj.","definition":{"en":"In medicine and biology, describing a process or effect that happens because dopamine activates its receptors.","zh":"在医学与生物学中，描述由于多巴胺激活其受体而发生的过程或效应。"},"examples":[{"en":"The drug reduced dopamine-mediated signaling in certain brain regions.","zh":"这种药物降低了某些脑区的多巴胺介导信号传导。"},{"en":"Some movement symptoms are linked to disrupted dopamine-mediated pathways.","zh":"一些运动症状与受损的多巴胺介导通路有关。"}]}],"synonyms":["dopamine-dependent","dopaminergic (related; not always identical)","dopamine-driven"],"phonetic":"/ˌdoʊpəˌmin ˈmidiˌeɪtɪd/","extraExplanation":["“dopamine-mediated”是典型的英语科学写作复合形容词：名词（dopamine）+ 过去分词（mediated）。加连字符表示它们一起修饰后面的名词，如“dopamine-mediated effects（多巴胺介导的效应）”。","在科普或论文中，mediated 常见搭配还有：receptor-mediated（受体介导的）、stress-mediated（压力介导的）、inflammation-mediated（炎症介导的）。中文通常译为“由……介导/调控/引发的”，具体取决于语境。"]}
{"word":"dopamine-related","summary":{"en":"“Dopamine-related” means connected with dopamine and its effects in the brain/body.","zh":"“dopamine-related”指“与多巴胺及其在大脑/身体中的作用有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with dopamine (a brain chemical involved in reward, motivation, movement, and mood).","zh":"与多巴胺有关的（多巴胺是一种与奖励、动机、运动和情绪有关的脑内化学物质）。"},"examples":[{"en":"The study focuses on dopamine-related changes in the brain after long-term stress.","zh":"这项研究关注长期压力后大脑中与多巴胺有关的变化。"},{"en":"Some dopamine-related medications can affect sleep and appetite.","zh":"一些与多巴胺有关的药物可能会影响睡眠和食欲。"},{"en":"They discussed dopamine-related reward pathways and how habits form.","zh":"他们讨论了与多巴胺有关的奖励通路以及习惯如何形成。"}]}],"synonyms":["dopaminergic","dopamine-linked","dopamine-associated"],"phonetic":"/ˈdoʊpəˌmin rɪˈleɪtɪd/","extraExplanation":["“dopamine-related”常见于医学、心理学与科普语境，用来表示“与多巴胺系统/机制有关”，比如：dopamine-related pathways（多巴胺相关通路）、dopamine-related behaviors（多巴胺相关行为）。","多巴胺常被简化为“快乐激素”，但更准确地说，它与“奖励预测、动机与学习”关系密切；因此在文章里看到 dopamine-related，并不一定等于“快乐”，也可能与成瘾、注意力、帕金森病等议题相关。"]}
{"word":"dopamine-using","summary":{"en":"“Dopamine-using” means dopaminergic—using dopamine for neural signaling.","zh":"“dopamine-using”意为“多巴胺能的”——以多巴胺进行神经信号传递。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Using dopamine as a neurotransmitter; relating to neurons or pathways that release and respond to dopamine.","zh":"（生物/医学）以多巴胺作为神经递质的；指释放并响应多巴胺的神经元或通路。"},"examples":[{"en":"Some brain circuits are dopamine-using and help control motivation and reward.","zh":"大脑里有些回路是“使用多巴胺的”，帮助调节动机和奖励感。"},{"en":"Researchers examined dopamine-using neurons in the midbrain.","zh":"研究人员检查了中脑中“使用多巴胺的”神经元。"},{"en":"The drug may affect dopamine-using pathways linked to movement.","zh":"这种药物可能会影响与运动相关的“使用多巴胺的”通路。"}]}],"synonyms":["dopaminergic","dopamine-related","dopamine-mediated"],"phonetic":"/ˈdoʊpəmiːn ˈjuːzɪŋ/","extraExplanation":["“dopamine-using”多见于科普或研究写作，用来直观描述“以多巴胺为信号传递物质”的神经元/通路。更常见、更专业的同义表达是“dopaminergic（多巴胺能的）”。","这个词通常作定语放在名词前：dopamine-using neurons/pathways/cells。也常用连字符（hyphen）把两个词连接起来，表示它们一起修饰后面的名词。"]}
{"word":"dopaminergic","summary":{"en":"Dopaminergic means “related to dopamine” or “using dopamine in the nervous system.”","zh":"dopaminergic 指“与多巴胺有关”或“在神经系统中使用多巴胺的（多巴胺能的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to dopamine (a brain chemical) or to nerve cells and pathways that use dopamine, especially in the brain.","zh":"与多巴胺（大脑中的一种化学物质）有关的；或指使用多巴胺的神经细胞与神经通路（尤指大脑中的）。"},"examples":[{"en":"Parkinson’s disease involves damage to dopaminergic neurons.","zh":"帕金森病与多巴胺能神经元的损伤有关。"},{"en":"Some medicines increase dopaminergic activity to reduce symptoms.","zh":"一些药物通过增强多巴胺能活动来减轻症状。"}]}],"synonyms":["dopamine-related","dopamine-using","dopamine-mediated"],"phonetic":"/ˌdoʊpəˌmɪˈnɝːdʒɪk/","extraExplanation":["词源小提示：dopa- 来自 dopamine（多巴胺）；-nergic 表示“与……作用/活动有关”（类似 cholinergic“胆碱能的”、adrenergic“肾上腺素能的”）。因此 dopaminergic 通常用于医学或神经科学语境，描述“以多巴胺为主要神经递质的”神经元、通路或作用。"]}
{"word":"dopamines","summary":{"en":"Dopamine is a neurotransmitter involved in reward, motivation, learning, movement, and attention; “dopamines” is the plural form and is also used informally to mean quick pleasure boosts.","zh":"多巴胺是一种与奖励、动机、学习、运动和注意力相关的神经递质；“dopamines”是其复数形式，也常被非正式地用来指短暂的愉悦刺激。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brain chemical (neurotransmitter) that helps send signals between nerve cells and is strongly involved in motivation, pleasure/reward, learning, movement, and attention","zh":"多巴胺：一种大脑中的“神经递质”（神经细胞之间传递信息的化学物质），与动机、愉悦/奖励、学习、运动和注意力密切相关"},"examples":[{"en":"Dopamine plays an important role in how we feel motivated to do things.","zh":"多巴胺在我们产生做事动机的过程中起着重要作用。"},{"en":"Some medicines work by increasing dopamine levels in the brain.","zh":"一些药物通过提高大脑中的多巴胺水平来起作用。"},{"en":"Low dopamine activity is linked to movement problems in Parkinson’s disease.","zh":"多巴胺活动不足与帕金森病的运动问题有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, usually plural) quick feelings of pleasure or excitement, especially from something rewarding or stimulating","zh":"（非正式用法，常用复数）“快乐刺激/奖励感”，指因奖励或刺激而产生的短暂兴奋或愉悦感"},"examples":[{"en":"People sometimes say they get “dopamine hits” from scrolling social media.","zh":"人们有时会说刷社交媒体会带来“多巴胺刺激/多巴胺冲击”。"},{"en":"I’m trying to avoid cheap dopamines and focus on long-term goals.","zh":"我在尽量避免廉价的即时快感，把注意力放在长期目标上。"}]}],"synonyms":["dopamine","neurotransmitter","reward chemical (informal)"],"phonetic":"/ˈdoʊpəˌmiːn/","extraExplanation":["“dopamines”通常是“dopamine”的复数，但在科学语境里更常说“dopamine levels（多巴胺水平）/ dopamine pathways（多巴胺通路）”。在网络语境中，“dopamines”有时被用来泛指“让人上瘾的即时奖励感”，这属于比喻或简化说法，并不等同于严谨的医学表述。"]}
{"word":"dopant","summary":{"en":"A dopant is a small amount of added impurity used to change a material’s properties, especially in semiconductors.","zh":"dopant 指为改变材料性质（尤指半导体电性）而加入的微量杂质/掺杂剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small amount of impurity added to a material (especially a semiconductor) to change its electrical properties.","zh":"（尤指半导体中的）掺杂剂；为改变材料（特别是半导体）的电学性质而加入的微量杂质。"},"examples":[{"en":"In silicon chips, boron is used as a dopant to create p-type material.","zh":"在硅芯片中，硼常作为掺杂剂，用来形成 P 型材料。"},{"en":"Even a tiny amount of dopant can strongly affect conductivity.","zh":"即使极少量的掺杂剂也能显著影响导电性。"}]}],"synonyms":["additive","impurity (in context)","doping agent"],"phonetic":"/ˈdoʊpənt/","extraExplanation":["在半导体里，“dopant（掺杂剂）”常见两类：供体（donor，如磷 P、砷 As）会提供额外电子形成 n 型；受体（acceptor，如硼 B）会“接受”电子、产生空穴形成 p 型。","词源上来自动词 dope（给……掺入/添加），但在日常语境里 dope 也可能指“毒品/兴奋剂”；在科技语境中 dopant 通常是中性术语，指材料工程中的添加物。"]}
{"word":"dopants","summary":{"en":"Dopants are substances added in small amounts—most often in semiconductors—to change a material’s properties.","zh":"Dopants 指少量加入材料中、用来改变材料性质的“掺杂剂”，最常见于半导体领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small amount of a substance added to another material to change its properties (especially to control electrical conductivity in semiconductors)","zh":"（掺杂剂）加入到材料中的少量物质，用来改变材料性质（尤其用于半导体中调控导电性）"},"examples":[{"en":"Boron is a common dopant used to make silicon p-type.","zh":"硼是常见的掺杂剂，用来把硅变成 p 型。"},{"en":"The engineers adjusted the dopant concentration to improve the chip’s performance.","zh":"工程师调整了掺杂剂浓度来提升芯片性能。"},{"en":"Even a tiny amount of dopant can significantly change how the material conducts electricity.","zh":"即使极少量的掺杂剂也能显著改变材料的导电方式。"}]},{"partOfSpeech":"n.","definition":{"en":"a drug or chemical used to dope someone or something (less common; often used in sports/animals contexts)","zh":"（较少用）用于给人或动物“兴奋剂/禁药”的药物或化学品"},"examples":[{"en":"The test detected a banned dopant in the horse’s system.","zh":"检测在那匹马体内发现了违禁兴奋剂。"},{"en":"Officials investigated where the dopant came from.","zh":"官员调查这种禁药来源于哪里。"}]}],"synonyms":["additive","impurity (in materials context)","doping agent"],"phonetic":"/ˈdoʊpənt/","extraExplanation":["“dopants” 是 dopant 的复数形式。科技语境里最常见，尤其在材料科学与半导体领域：通过“掺杂（doping）”把硅变成 n 型或 p 型，从而制造二极管、晶体管等器件。","常见搭配：dopant concentration（掺杂浓度）、dopant level（掺杂水平）、p-type / n-type dopant（p 型/ n 型掺杂剂）。"]}
{"word":"dopaoxidase","summary":{"en":"Dopaoxidase is an enzyme involved in oxidizing DOPA during melanin (pigment) formation.","zh":"dopaoxidase 指参与氧化DOPA、推动黑色素（色素）生成的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme that oxidizes DOPA (a molecule used in making melanin), helping start chemical reactions that lead to pigment formation in skin, hair, and eyes","zh":"多巴氧化酶：一种能氧化DOPA（参与黑色素生成的分子）的酶，促进产生皮肤、头发和眼睛色素的反应"},"examples":[{"en":"Dopaoxidase activity is often measured when scientists study melanin production.","zh":"研究人员在研究黑色素生成时，常会测量多巴氧化酶的活性。"},{"en":"Low dopaoxidase function can affect pigmentation in some organisms.","zh":"在一些生物中，多巴氧化酶功能偏低可能会影响色素沉着。"}]}],"synonyms":["DOPA oxidase","tyrosinase (often related/overlapping in use)"],"phonetic":"/ˌdoʊpəˈɑːksɪˌdeɪs/","extraExplanation":["这是一个生物化学/生理学用语，日常英语中很少见，更常出现在科研论文、实验报告或医学语境里。","在很多资料中，“dopa oxidase”常与“tyrosinase（酪氨酸酶）”相关或被视为其功能描述：它们都参与将L-DOPA等底物氧化，从而进入黑色素合成途径。具体命名会因物种、研究传统或酶的具体性质而有所不同。","理解词形有助记忆：DOPA（底物名）+ oxidase（“氧化酶”，指催化氧化反应的酶类）。"]}
{"word":"dopas","summary":{"en":"“Dopas” is not a common English word; it’s usually a typo, a name, or a foreign word (often Polish: ‘fit/match’).","zh":"“dopas”不是常见英语词；通常是拼写错误、专有名词或外来词（常见为波兰语，意为“合适/匹配”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. In English writing, “dopas” is usually a typo, a name (proper noun), or a word from another language (often Polish, where it relates to “fit/match”).","zh":"不是标准英语单词。在英文中，“dopas”通常是拼写错误、专有名词（姓名/地名），或外来词（常见于波兰语，含义与“匹配/合适”有关）。"},"examples":[{"en":"I couldn’t find “dopas” in an English dictionary—could you tell me the context or the correct spelling?","zh":"我在英语词典里找不到“dopas”——你能提供上下文或正确拼写吗？"},{"en":"If you meant the Polish word, it’s closer in meaning to “fit” or “match.”","zh":"如果你指的是波兰语里的那个词，它的意思更接近“合适/匹配”。"}]}],"phonetic":"/ˈdoʊpæs/","extraExplanation":["在英文学习中，遇到查不到的词，最有效的方法是：\n1）给我一句完整例句；\n2）说明它出现的场景（聊天、游戏ID、学术文章、品牌名等）；\n3）确认大小写（如 DOPAS 可能是缩写）。\n\n你也可能想输入的是：\n- “do pass”（分开写，表示“确实会经过/请递给我”需看语境）\n- “Dopas”（姓氏/用户名）\n- “dopa / dopamine”（生化相关词根）"]}
{"word":"dopatta","summary":{"en":"A dupatta is a long South Asian scarf or shawl worn with traditional outfits, often draped on the shoulders or over the head.","zh":"dupatta是南亚传统服饰中常见的长围巾/披巾，常披肩或罩头搭配穿着。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long scarf worn by women in South Asia (especially with a salwar kameez), often draped over the shoulders or head for style, modesty, or warmth","zh":"（南亚女性常佩戴的）长围巾/披巾，常与旁遮普套装（salwar kameez）搭配，可披在肩上或罩头，用于装饰、得体/端庄或保暖"},"examples":[{"en":"She wore a blue dupatta over her shoulders to match her outfit.","zh":"她把一条蓝色的dupattā披在肩上，和衣服很搭。"},{"en":"In the temple, she covered her head with her dupatta.","zh":"在寺庙里，她用dupattā把头盖起来。"}]}],"synonyms":["scarf","stole","shawl","dupattā (variant spelling)"],"phonetic":"/doʊˈpɑːtə/","extraExplanation":["“dupatta”来自印地语/乌尔都语（दुपट्टा/دوپٹہ），传统上指一种长方形布料，既可作为装饰配件，也常用于体现端庄与尊重（例如在宗教场所或正式场合遮肩/遮头）。","在英语中它多用于描述南亚服饰文化语境；与“scarf”相近，但“dupatta”更具体指这种特定款式与穿搭方式的披巾。"]}
{"word":"dopchick","summary":{"en":"“Dope chick” is slang for a cool or impressive woman, but it can sound casual or objectifying.","zh":"“dope chick”是俚语，指很酷/很厉害的女性，但语气较随意，有时可能带物化意味。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an informal slang term meaning a very cool, impressive, or attractive woman (sometimes used in a casual, objectifying way)","zh":"非正式俚语：指“很酷、很厉害或很有吸引力的女性”（有时带随意甚至物化女性的语气）"},"examples":[{"en":"She’s a dope chick—smart, confident, and always kind to people.","zh":"她真是个很酷的女生——聪明、自信，而且总是对人很友善。"},{"en":"I met a dope chick at the concert who introduced me to new music.","zh":"我在演唱会上认识了一个很酷的女生，她给我推荐了很多新音乐。"}]}],"synonyms":["cool woman","awesome woman","amazing girl","great person"],"phonetic":"/doʊp tʃɪk/","extraExplanation":["“dopchick”更常见的写法是分开写：dope chick。dope 在口语里常表示“很棒/很酷”，chick 是对“年轻女性/女生”的俚语称呼。","chick 在某些语境里可能显得轻佻或带物化意味。更中性、更礼貌的表达可以用：cool woman / awesome woman / great person / she’s amazing。"]}
{"word":"dope","summary":{"en":"“Dope” most commonly means “excellent” in informal speech, but it can also mean “illegal drugs” or “to drug someone,” depending on context.","zh":"“dope”最常见的口语意思是“很棒”，但也可指“毒品”或“给人下药”，需看语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Very good; excellent; impressive.","zh":"（非正式）很棒的；极好的；令人印象深刻的。"},"examples":[{"en":"That new song is dope.","zh":"那首新歌很棒。"},{"en":"Your presentation was dope—clear and confident.","zh":"你的演讲很棒——清晰又自信。"}]},{"partOfSpeech":"n.","definition":{"en":"A drug, especially an illegal one; often used to mean heroin or other narcotics in older usage.","zh":"毒品（尤指非法药物）；较早的用法里常指海洛因等麻醉品。"},"examples":[{"en":"He was arrested for selling dope.","zh":"他因贩卖毒品被捕。"},{"en":"The movie shows how dope can ruin lives.","zh":"这部电影展示了毒品如何毁掉人生。"}]},{"partOfSpeech":"vt.","definition":{"en":"To drug someone; to give drugs to someone without their knowledge (often used as “dope someone”).","zh":"给某人下药；在对方不知情的情况下给其服用药物（常用作 dope someone）。"},"examples":[{"en":"Someone doped his drink at the party.","zh":"有人在聚会上给他的饮料下了药。"}]},{"partOfSpeech":"vi.","definition":{"en":"To use drugs (informal).","zh":"吸毒（非正式）。"},"examples":[{"en":"He used to dope, but he quit.","zh":"他以前吸毒，但后来戒了。"}]},{"partOfSpeech":"n.","definition":{"en":"A thick paste or varnish used for coating (e.g., in aviation or manufacturing); also used for certain lubricants.","zh":"（涂层用的）涂料/浆料/清漆（如航空或制造业）；也可指某些润滑材料。"},"examples":[{"en":"They applied dope to the fabric to tighten and seal it.","zh":"他们在布面上涂了涂料，使其收紧并密封。"}]}],"synonyms":["cool","awesome","great","excellent","impressive","drugs","narcotics"],"phonetic":"/doʊp/","extraExplanation":["“dope”既有俚语褒义（=很酷、很棒），也有严肃的“毒品”含义。语境非常关键：在音乐、潮流、朋友聊天里多半是夸赞；在新闻、法律、学校管理语境里通常指毒品。","在美国英语里，形容词“dope”比较口语，适合熟人或轻松场合；正式写作里更常用“excellent / impressive / outstanding”。"]}
{"word":"dope out","summary":{"en":"to figure out or plan something through careful thinking","zh":"通过思考弄明白或想出（办法/计划）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to figure out or understand something by thinking carefully, often from incomplete information","zh":"（常指信息不完整时）通过仔细思考弄明白、推断出"},"examples":[{"en":"It took me a while to dope out what the instructions meant.","zh":"我花了一会儿才弄明白这些说明到底是什么意思。"},{"en":"Detectives doped out the thief’s route from the security footage.","zh":"侦探根据监控录像推断出了小偷的路线。"}]},{"partOfSpeech":"phrase","definition":{"en":"to plan or work out a solution or strategy","zh":"想出（办法/策略），制定出（计划）"},"examples":[{"en":"We need to dope out a new schedule that works for everyone.","zh":"我们得想出一个适合所有人的新时间表。"},{"en":"She doped out a way to reduce costs without cutting staff.","zh":"她想出了在不裁员的情况下减少成本的办法。"}]}],"synonyms":["figure out","work out","puzzle out","deduce","infer","determine","make out","reason out"],"phonetic":"/doʊp aʊt/","extraExplanation":["语体提醒：比较口语化，多用于美式英语。正式写作里常用 figure out / work out / determine / infer 来替换。","常见搭配：dope out + what/how/why 从句；dope out + a plan/solution（想出计划/办法）。"],"etymology":"“dope”原指“麻醉品/兴奋剂”等，后来在口语里引申为“内幕信息、线索”。“dope out”字面像是“把线索/信息‘弄出来’”，于是发展出“推断、弄明白”的意思（常见于美式口语，20世纪起更普遍）。","mnemonic":["把 dope 想成“情报/线索”，dope out = 把线索“掏出来”→ 推断出、弄明白。","联想中文：像“破案要靠线索”，dope out 就是“靠线索把真相想出来”。"]}
{"word":"dopebook","summary":{"en":"“Dopebook” usually means a slang “drug record/ledger,” and less commonly an “insider-information guide” (often in betting).","zh":"“dopebook”通常指俚语里的“毒品记录/账本”，较少见时也可指（常见于博彩）提供内幕信息的“情报指南”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A notebook or record used to track illegal drugs (for example, inventory, sales, debts, or contacts).","zh":"（俚语）用于记录非法毒品相关信息的本子或账册（如存货、交易、欠款或联系人）。"},"examples":[{"en":"Police said they found a dopebook listing names, amounts, and payment dates.","zh":"警方称他们发现了一本“毒品账本”，上面列着姓名、数量和付款日期。"},{"en":"He kept a dopebook to track who owed him money.","zh":"他用一本毒品账本来记录谁欠他钱。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, less common) A reference book or guide that provides insider information—especially in sports betting or horse racing (similar to a “tip sheet”).","zh":"（非正式，较少见）提供“内幕/情报”的参考手册或指南，尤指体育投注或赛马博彩中的投注技巧资料（类似“投注技巧小报/情报单”）。"},"examples":[{"en":"He bought a dopebook before going to the track.","zh":"去赛马场前他买了一本“情报指南”。"},{"en":"The dopebook gave predictions and notes on each horse.","zh":"这本情报指南提供了对每匹马的预测和笔记。"}]}],"synonyms":["drug ledger","drug log","ledger","record book","betting guide","tip sheet"],"phonetic":"/ˈdoʊpˌbʊk/","extraExplanation":["“dope”在英语里既可以指“毒品”，也可以指“内幕消息/情报”。因此 dopebook 的含义会随语境变化：出现在警方通报、犯罪新闻里多指“毒品账本”；出现在赛马/博彩语境里则更可能指“情报/投注技巧资料”。","这是带有强烈俚语色彩的词，在正式写作中通常改用更中性的说法，如 drug ledger（毒品账册）、betting guide（博彩指南）等。"]}
{"word":"doped","summary":{"en":"“Doped” usually means drugged, using banned performance drugs, or (in science) chemically doped to change a material’s properties.","zh":"“doped”常指被下药/受药物影响、（体育）使用违禁药物，或（科学）材料被掺杂以改变性质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having been given drugs (often illegally or without permission); drugged","zh":"被下药的；被（常指非法或未经允许）给药的；嗑药后处于药物影响中的"},"examples":[{"en":"He looked doped and could barely keep his eyes open.","zh":"他看起来像是被药物影响了，眼睛都快睁不开。"},{"en":"The police suspected the victim was doped before the robbery.","zh":"警方怀疑受害者在抢劫前被下了药。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of an athlete or animal) having used banned drugs to improve performance","zh":"（运动员或动物）使用违禁药物以提高成绩的；服用兴奋剂的"},"examples":[{"en":"A doped athlete can be disqualified and banned from competitions.","zh":"使用兴奋剂的运动员可能被取消成绩并禁赛。"},{"en":"The racehorse tested positive, suggesting it was doped.","zh":"这匹赛马药检呈阳性，说明可能被用药了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in science) mixed with a small amount of another substance to change properties, especially in semiconductors","zh":"（科学）掺杂的；（尤指半导体）通过加入少量杂质来改变材料性质的"},"examples":[{"en":"Silicon becomes more conductive when it is doped with phosphorus.","zh":"硅掺入磷后导电性会增强。"},{"en":"This device uses doped layers to control the flow of electricity.","zh":"这个器件用掺杂层来控制电流的流动。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “dope” (to drug, to take drugs, or to add a substance)","zh":"“dope”的过去式/过去分词（给药/吸毒；或加入物质进行掺杂）"},"examples":[{"en":"Someone doped his drink at the party.","zh":"有人在聚会上给他的饮料下了药。"},{"en":"The lab doped the material to improve its performance.","zh":"实验室对材料进行了掺杂以提升性能。"}]}],"synonyms":["drugged","intoxicated","sedated","stimulated","adulterated","treated"],"phonetic":"/doʊpt/","extraExplanation":["“dope”在口语里可指毒品或兴奋剂，因此“doped”在新闻语境中常与体育反兴奋剂（anti-doping）相关；在科技语境中则常见于“doped silicon（掺杂硅）”。读到时可通过上下文判断是“被下药/嗑药”还是“材料掺杂”。"]}
{"word":"dopehead","summary":{"en":"“Dopehead” is slang for a drug addict (often derogatory) and can also be an insult meaning a foolish person.","zh":"“Dopehead”是俚语，常带贬义，指吸毒成瘾的人；也可作辱骂用语，表示“笨蛋、傻瓜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, often derogatory) A person who regularly uses drugs, especially heroin or other opioids; a drug addict.","zh":"（俚语，常带贬义）经常吸毒的人，尤其指使用海洛因等阿片类毒品的人；瘾君子。"},"examples":[{"en":"The novel portrays a dopehead trying to quit and rebuild his life.","zh":"这部小说刻画了一个瘾君子努力戒毒、重建生活的过程。"},{"en":"Calling someone a “dopehead” is insulting and can make recovery conversations harder.","zh":"把别人叫作“dopehead”很侮辱人，也会让关于戒毒康复的沟通更困难。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, offensive) A stupid or foolish person.","zh":"（俚语，冒犯）笨蛋；傻瓜。"},"examples":[{"en":"Don’t be a dopehead—double-check the address before you go.","zh":"别犯傻——出发前先把地址核对一下。"},{"en":"In polite conversation, it’s better to say “That was a careless mistake” than to call someone a dopehead.","zh":"在较礼貌的交流中，比起骂人“dopehead”，更好说“那是个粗心的错误”。"}]}],"synonyms":["drug addict","junkie","drug user","pothead","idiot"],"phonetic":"/ˈdoʊpˌhɛd/","extraExplanation":["“Dopehead”属于强烈口语/街头用语，很多语境里带有羞辱与污名化色彩。谈到成瘾问题时，英语里更中性、更尊重的说法常用“person with a substance use disorder”“someone struggling with addiction”“drug user”等。","词源上，“dope”可指毒品（也可指兴奋剂、或在别的语境里指“内幕消息”），加上“-head”表示“某种东西的沉迷者/爱好者”（如“pothead”）。因此“dopehead”字面带“沉迷毒品的人”的意思。"]}
{"word":"doper","summary":{"en":"“Doper” usually means a drug user (slang) or someone involved with banned drugs in sports.","zh":"“doper”通常指（俚语）吸毒者，或（体育语境中）使用/涉及兴奋剂的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who takes illegal drugs (slang), especially regularly","zh":"（俚语）吸食非法毒品的人，尤指经常吸毒者"},"examples":[{"en":"The police arrested a suspected doper near the station.","zh":"警方在车站附近逮捕了一名疑似吸毒者。"},{"en":"He used to be a doper, but he got help and quit.","zh":"他以前吸毒，但后来寻求帮助并戒掉了。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who uses banned performance‑enhancing drugs in sports or who gives such drugs to athletes","zh":"（体育）使用兴奋剂的人；（也可指）给运动员使用兴奋剂的人"},"examples":[{"en":"The cyclist was banned for being a doper.","zh":"那名自行车选手因使用兴奋剂被禁赛。"},{"en":"The team promised to report any doper or dealer.","zh":"球队承诺举报任何使用兴奋剂的人或贩卖者。"}]}],"synonyms":["drug user","addict","junkie (slang)","doper (sports context)","doping athlete"],"phonetic":"/ˈdoʊpɚ/","extraExplanation":["“doper”来自“dope（毒品/兴奋剂）”。在日常英语里，它语气较强、带负面评价；正式场合常用“drug user”（吸毒者）或在体育语境用“doping athlete / athlete who dopes”（使用兴奋剂的运动员）。"]}
{"word":"dopers","summary":{"en":"“Dopers” means people who take drugs, especially illegal drugs, or people who use performance‑enhancing drugs in sports.","zh":"“dopers”指吸毒者，或（体育中）使用兴奋剂/违禁药物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who take drugs (especially illegal drugs), or people who use performance‑enhancing drugs in sports.","zh":"吸毒的人；（尤指体育运动中）使用兴奋剂/违禁药物的人。"},"examples":[{"en":"The police arrested several dopers near the club.","zh":"警察在那家夜店附近逮捕了几名吸毒者。"},{"en":"The league banned the dopers for using steroids.","zh":"联盟因使用类固醇而禁赛那些使用兴奋剂的运动员。"}]}],"synonyms":["drug users","addicts","substance abusers","cheaters (sports context)"],"phonetic":"/ˈdoʊpərz/","extraExplanation":["“dopers”是复数，单数是“doper”。日常语境里它常带有贬义，指“吸毒者”。在体育新闻里也常用来指“使用兴奋剂的人”。","词根来自“dope”，在不同语境可指“毒品/兴奋剂”，也可指“给（动物或运动员）用药以提高表现”。因此读到“doper”时，要结合上下文判断是“吸毒”还是“体育兴奋剂”。"]}
{"word":"dopes","summary":{"en":"“Dopes” can mean plural “drugs” or “foolish people,” or it can be the verb form meaning “gives drugs,” “takes drugs,” or “uses banned performance drugs.”","zh":"“dopes”可指“毒品”的复数或“傻瓜们”，也可作动词第三人称单数，表示“下药/吸毒/使用兴奋剂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “dope”: an illegal drug (especially heroin) or, more generally, drugs.","zh":"“dope”的复数：毒品（尤指海洛因）；也可泛指药物/毒品。"},"examples":[{"en":"The police found dopes hidden in the car.","zh":"警方在车里发现了藏起来的毒品。"},{"en":"He got into trouble because of dopes and gambling.","zh":"他因为毒品和赌博惹上了麻烦。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “dope” (slang, informal): a stupid or foolish person.","zh":"“dope”的复数（俚语，非正式）：傻瓜、蠢人。"},"examples":[{"en":"Don’t be dopes—read the instructions first.","zh":"别犯傻——先读说明书。"},{"en":"They acted like dopes and missed the train.","zh":"他们像傻子一样，结果没赶上火车。"}]},{"partOfSpeech":"vt.","definition":{"en":"third-person singular of “dope”: to give someone drugs, especially to make them sleepy or unconscious.","zh":"“dope”的第三人称单数：给某人下药（尤指让人昏睡或失去意识）。"},"examples":[{"en":"The criminal dopes his victims before stealing their money.","zh":"罪犯先给受害者下药，再偷走他们的钱。"},{"en":"The detective thinks someone dopes the guard at night.","zh":"侦探认为有人在夜里给守卫下药。"}]},{"partOfSpeech":"vi.","definition":{"en":"third-person singular of “dope”: to take drugs (informal).","zh":"“dope”的第三人称单数：吸毒（非正式）。"},"examples":[{"en":"He dopes when he feels stressed.","zh":"他一有压力就吸毒。"}]},{"partOfSpeech":"vt.","definition":{"en":"third-person singular of “dope”: to use banned substances to improve sports performance (dope an athlete).","zh":"“dope”的第三人称单数：使用/给运动员使用违禁药物以提高成绩（兴奋剂）。"},"examples":[{"en":"The coach dopes his athletes and risks a lifetime ban.","zh":"教练给运动员用兴奋剂，可能会被终身禁赛。"},{"en":"The scandal showed how some teams dopes to win.","zh":"那起丑闻显示有些队伍为赢而使用兴奋剂。"}]}],"synonyms":["drugs","narcotics","heroin","idiots","fools","drug","spike","dope (sports)"],"phonetic":"/doʊp/","extraExplanation":["“dope”在不同语境里含义差别很大：既可以指“毒品/药物”，也可以是骂人“傻瓜”，还可以指体育中的“兴奋剂（doping）”。看到“dopes”时，要根据上下文判断是哪一种。","口语里“dope”还常作形容词表示“很酷、很棒”（如“That’s dope.”），但这种用法的复数形式一般不会写成“dopes”。"]}
{"word":"dopesheet","summary":{"en":"A dopesheet is a behind-the-scenes instruction or information sheet, especially an animation timing/exposure sheet.","zh":"dopesheet 指幕后用的指令/信息表，尤指动画制作中的时间与动作（曝光）表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Animation/film) A production sheet that lists, frame by frame, what should happen—timing, dialogue, camera moves, and other instructions (also called an exposure sheet or X-sheet).","zh":"（动画/影视）分镜与时间表式的制作表格，按帧记录该发生什么：节奏、对白、镜头运动等指令（也常叫 exposure sheet / X-sheet）。"},"examples":[{"en":"The animator checked the dopesheet to match the character’s mouth shapes to the dialogue.","zh":"动画师查看 dopesheet，把角色的口型和对白对上。"},{"en":"According to the dopesheet, the camera pans left starting at frame 48.","zh":"按 dopesheet 的标注，镜头从第 48 帧开始向左摇。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) A concise information sheet used behind the scenes to track key details, cues, or notes for a project or event.","zh":"（引申）用于后台/内部的“信息速查表”，用来记录项目或活动的关键细节、提示或备注。"},"examples":[{"en":"The producer handed everyone a dopesheet with the segment timings and cue notes.","zh":"制片人给每个人发了一份 dopesheet，上面有各环节时长和提示点。"},{"en":"Keep a dopesheet of passwords, contacts, and deadlines during the shoot.","zh":"拍摄期间整理一份 dopesheet，记录密码、联系人和截止日期。"}]}],"synonyms":["exposure sheet","X-sheet","cue sheet","run sheet","cheat sheet"],"phonetic":"/ˈdoʊpˌʃit/","extraExplanation":["“dope”在口语里除了“毒品”外，还常指“内幕信息/可靠情报”（比如 in the know 的消息）。因此 dopesheet 字面上就是“信息表/情报表”。在动画领域，它特指用于控制节奏与对白对齐的表格，传统手绘动画时代尤其常见。"]}
{"word":"dopest","summary":{"en":"“Dopest” is slang for “the best/coolest,” the superlative of “dope.”","zh":"“dopest”是俚语，表示“最棒/最酷”，相当于“dope”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang) The best, coolest, or most impressive; superlative of “dope.”","zh":"（俚语）最棒的、最酷的、最厉害的；“dope”的最高级。"},"examples":[{"en":"That song is the dopest track on the album.","zh":"那首歌是整张专辑里最炸、最好听的一首。"},{"en":"Your jacket is the dopest—where did you get it?","zh":"你的外套太酷了——你在哪买的？"},{"en":"She’s one of the dopest dancers in our class.","zh":"她是我们班最厉害的舞者之一。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literal/rare) Having the most “dope” (drugs); related to drug slang.","zh":"（字面/较少用）含有最多的“dope”（毒品）；与毒品俚语相关。"},"examples":[{"en":"In older slang, “dope” can mean drugs, so “dopest” may sound drug-related.","zh":"在较早的俚语里，“dope”可以指毒品，所以“dopest”可能让人联想到毒品。"}]}],"synonyms":["best","coolest","awesome","sick (slang)","fire (slang)"],"phonetic":"/ˈdoʊpɪst/","extraExplanation":["“dopest”非常口语，常见于嘻哈/街头文化、社交媒体和朋友间聊天。正式写作或职场场合建议用更中性的词，如 “best / coolest / most impressive”。","在不同地区或不同人群中，“dope”有时会被理解为与毒品有关；如果你不确定语境，改用 “awesome” 或 “great” 更稳妥。"]}
{"word":"dopester","summary":{"en":"“Dopester” is slang, most commonly meaning a drug user (sometimes a drug dealer); more rarely it can mean someone very cool.","zh":"“Dopester”是俚语，最常见指吸毒者（有时也指毒贩）；较少见时可指很酷、很厉害的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, often offensive) A person who uses illegal drugs; sometimes also someone involved in selling them.","zh":"（俚语，常带冒犯/贬义）吸食非法毒品的人；有时也指贩卖毒品的人。"},"examples":[{"en":"He got into trouble because he was hanging out with dopesters.","zh":"他惹上麻烦，因为他老跟一群吸毒的人混在一起。"},{"en":"The movie portrays the dopester as a tragic figure, not a hero.","zh":"这部电影把吸毒者塑造成悲剧人物，而不是英雄。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, slang) Someone who is “dope,” meaning very cool or impressive.","zh":"（少见，俚语）很酷、很厉害的人。"},"examples":[{"en":"Some fans called the producer a dopester after the new track dropped.","zh":"新歌发布后，有些粉丝称那位制作人“太酷了/很厉害”。"}]}],"synonyms":["drug user","drug addict","junkie (offensive)","drug dealer","cool person (rare)"],"phonetic":"/ˈdoʊp.stɚ/","extraExplanation":["“dopester”由“dope（毒品/也可指很棒）+ -ster（表示某类人，如 youngster）”构成。最常见的用法与毒品有关，语气往往贬义，日常交流中建议用更中性的说法：drug user（吸毒者）、drug dealer（毒贩）。","表示“很酷”的用法更少见，通常出现在某些口语/网络语境里；如果不确定语境，直接用 cool / awesome / impressive 更安全。"]}
{"word":"dopesters","summary":{"en":"“Dopesters” is a slang plural noun meaning drug users; less commonly, people who use performance-enhancing drugs.","zh":"“dopesters”是俚语复数名词，常指吸毒者；较少见时也指服用兴奋剂的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, usually informal) People who use drugs (especially marijuana, heroin, or other “dope”); drug users.","zh":"（俚语，非正式）吸毒者；（尤指）吸食“大麻/海洛因等毒品（dope）”的人。"},"examples":[{"en":"The movie shows two dopesters hanging around the neighborhood all day.","zh":"电影里有两个吸毒者整天在社区里游荡。"},{"en":"He stopped spending time with dopesters after he decided to get clean.","zh":"他决定戒毒后，就不再和那些吸毒者来往了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, less common) People who take drugs to improve performance (for example, in sports).","zh":"（非正式，较少见）为提高表现而服用药物/兴奋剂的人（如体育比赛中的“服药”）。"},"examples":[{"en":"The league introduced stricter tests to catch dopesters.","zh":"联盟引入了更严格的检测来抓服用兴奋剂的人。"},{"en":"Fans were disappointed when several dopesters were banned.","zh":"几名服药者被禁赛后，球迷很失望。"}]}],"synonyms":["drug users","drug addicts","junkies (slang)","dopers"],"phonetic":"/ˈdoʊp.stɚz/","extraExplanation":["“dopester”由 dope（毒品/药物；也可指兴奋剂）+ -ster（表示“从事某事的人”，如 youngster）构成。带有明显的口语与贬义色彩，正式场合更常说 drug user / drug addict（吸毒者）或 athlete who dopes / doping athlete（服用兴奋剂的运动员）。","注意 dope 在不同语境意思差异很大：口语里既可能指毒品，也可能指“兴奋剂”，还可能作动词 dope（给……下药/让……服药）。理解时要看上下文（街头语境 vs. 体育语境）。"]}
{"word":"dopey","summary":{"en":"Dopey means ‘silly/slow to understand’ or ‘sleepy and not fully alert.’","zh":"dopey 表示“傻乎乎/反应慢”，也可表示“困倦、昏沉不清醒”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slow to understand, silly, or not very alert (often in a gentle or slightly insulting way).","zh":"反应迟钝的；傻乎乎的；不太机灵的（常带点调侃或轻微贬义）。"},"examples":[{"en":"I’m a bit dopey this morning—I didn’t sleep well.","zh":"我今天早上有点迷糊/反应慢——没睡好。"},{"en":"Don’t be dopey—check the address before you go.","zh":"别犯傻——出门前先核对地址。"},{"en":"He gave a dopey grin when he realized his mistake.","zh":"他意识到自己搞错后，露出一个傻乎乎的笑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sleepy, drowsy, or not fully awake (often because of medicine, alcohol, or tiredness).","zh":"困倦的；昏昏沉沉的；不清醒的（常因药物、酒精或疲劳）。"},"examples":[{"en":"This allergy medicine makes me feel dopey.","zh":"这个过敏药让我感觉昏昏沉沉的。"},{"en":"After the long flight, she was dopey and quiet.","zh":"长途飞行后，她又困又没精神。"}]}],"synonyms":["sleepy","drowsy","spaced-out","silly","foolish","dim"],"phonetic":"/ˈdoʊpi/","extraExplanation":["“Dopey”在口语里常见，语气可能是轻松开玩笑，也可能带点不礼貌；对不熟的人用要谨慎。","在流行文化中，“Dopey”也是迪士尼《白雪公主》里七个小矮人之一的名字（形象是天真、呆萌、话少），因此这个词有时会让人联想到“憨憨的、可爱的笨拙”。"]}
{"word":"dopier","summary":{"en":"“Dopier” means “more dopey”: more silly, slow, or not alert.","zh":"“dopier”意为“更迷糊/更傻气的（dopey的比较级）”：更迟钝或无精打采。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"comparative of “dopey”: more silly, slow, or lacking energy; not very alert","zh":"“dopey”的比较级：更傻气的、更迟钝/无精打采的；不太机灵的"},"examples":[{"en":"I’m dopier than usual today—I didn’t sleep well.","zh":"我今天比平时更迷糊——没睡好。"},{"en":"That joke was even dopier than the last one, but it still made me laugh.","zh":"那个笑话比上一个更傻，但我还是笑了。"}]}],"synonyms":["sillier","goofier","dumber","more sluggish","more spaced-out"],"phonetic":"/ˈdoʊpiər/","extraExplanation":["“dopier”来自形容词“dopey”的比较级形式（dopey → dopier → dopiest）。常用来形容人看起来呆萌、迷糊、反应慢，语气多为口语、略带调侃，有时也可轻微贬义。","注意与“dope”的俚语义区分：在不同语境里，“dope”可能指毒品或（美式口语中）“很酷的人/东西”，但“dopey/dopier”通常指“迷糊、傻气”，不等同于“很酷”。"]}
{"word":"dopiest","summary":{"en":"“Dopiest” means “the most dopey”—either the most foolish/slow-thinking or the most sleepy/dazed (informal).","zh":"“dopiest”表示“最dopey”：要么最傻、最迟钝；要么最困、最迷糊（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “dopey”: the most silly, slow-thinking, or foolish (often in a mildly insulting but sometimes playful way).","zh":"“dopey”的最高级：最傻的、反应最慢的、最糊涂的（常带轻微侮辱，但有时也可开玩笑用）。"},"examples":[{"en":"That was the dopiest mistake I’ve ever made—I emailed the wrong file to everyone.","zh":"那是我犯过最傻的一次错误——我把错误的文件群发给了所有人。"},{"en":"He gave me the dopiest grin when he realized it was a surprise party.","zh":"他发现是惊喜派对时，露出了一个最傻乎乎的笑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Superlative of “dopey”: the most sleepy, dazed, or not fully alert (for example, from tiredness or medicine).","zh":"“dopey”的最高级：最困倦的、最迷糊的、最不清醒的（例如因为疲劳或药物）。"},"examples":[{"en":"After the cold medicine, I felt dopiest in the afternoon and could barely focus.","zh":"吃了感冒药后，我下午最迷糊，几乎无法集中注意力。"}]}],"synonyms":["silliest","goofiest","dumbest","most absentminded","most groggy"],"phonetic":"/ˈdoʊpiəst/","extraExplanation":["“dopiest”来自形容词“dopey”，是非正式用语。对人使用时可能显得不礼貌；熟人之间也可能带一点调侃意味。","“dopey”与“dope（毒品/笨蛋/很酷）”有关，但现代口语里“dopey”主要指“傻乎乎、迟钝”或“昏昏沉沉”，不一定与毒品相关。"]}
{"word":"dopiness","summary":{"en":"Dopiness means grogginess/lack of alertness, or informally, a bit of silliness or foolishness.","zh":"dopiness 指昏沉不清醒的状态；也可（口语）指带点玩笑意味的傻气或犯蠢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of being sleepy, slow, or not fully alert; grogginess.","zh":"昏昏欲睡、反应迟钝、不太清醒的状态；迷糊。"},"examples":[{"en":"After the long flight, I felt a heavy dopiness and couldn’t focus on the meeting.","zh":"长途飞行后，我感觉很迷糊，开会时完全无法集中注意力。"},{"en":"The medicine caused some dopiness, so don’t drive until you feel normal.","zh":"这种药会让人有点犯困发懵，所以在恢复正常之前不要开车。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Behavior or thinking that seems silly, foolish, or not very smart.","zh":"（非正式）显得傻气、愚蠢或不太聪明的言行/想法。"},"examples":[{"en":"He laughed at his own dopiness after forgetting his keys again.","zh":"他又忘带钥匙，只好笑自己真傻。"},{"en":"It was a moment of dopiness, not something to judge her by.","zh":"那只是她一时犯傻，不该用它来评判她。"}]}],"synonyms":["grogginess","sleepiness","dullness","foggy-headedness","silliness","foolishness"],"phonetic":"/ˈdoʊpinəs/","extraExplanation":["“dopiness”来自形容词“dopey”（迟钝的、昏昏沉沉的、傻乎乎的）加名词后缀“-ness”。口语中常见于描述疲劳、时差、酒精或药物带来的“犯困发懵”。第二个意思带一点玩笑或轻微贬义，语气通常比“stupidity（愚蠢）”更轻。"]}
{"word":"dopinesses","summary":{"en":"“Dopinesses” is the plural of “dopiness,” meaning states or instances of being dopey—dull, confused, or foolish, often from tiredness or drugs.","zh":"“dopinesses”是“dopiness”的复数，指昏沉、迷糊、反应迟钝或显得愚钝的多种状态/多次表现（常因疲劳或药物影响）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being dopey (not very alert or intelligent), often because of tiredness or drugs; foolishness or dullness","zh":"昏昏沉沉、反应迟钝或显得不太聪明的状态（常因疲劳或药物影响）；愚钝、呆傻"},"examples":[{"en":"The medicine caused a mild dopiness that made it hard to focus.","zh":"这种药让他有点昏沉，难以集中注意力。"},{"en":"In the morning, her usual dopinesses disappeared after a strong cup of coffee.","zh":"早上她惯常的迷糊劲儿在喝了一大杯咖啡后就消失了。"},{"en":"The comedian exaggerated the character’s dopinesses for laughs.","zh":"喜剧演员夸张了这个角色的呆傻之处来制造笑点。"}]}],"synonyms":["dullness","grogginess","foggy-headedness","stupidity","foolishness"],"phonetic":"/ˈdoʊpinəsɪz/","extraExplanation":["“dopinesses”是名词复数，单数是“dopiness”。日常更常见的是用不可数的“dopiness”（如：a feeling of dopiness），复数多用于强调“多种/多次的迷糊或愚笨表现”。","“dopey/dopiness”有时与药物引起的昏沉有关；注意与俚语“dope”（可指毒品、也可指“内幕消息/很棒的东西”）的不同语境，避免误解。"]}
{"word":"doping","summary":{"en":"Doping usually means using banned drugs to boost sports performance, but it can also mean adding small amounts of substances to materials (like silicon) to change their properties.","zh":"Doping通常指在体育中使用违禁药物提高成绩（兴奋剂），也可指材料/电子中的“掺杂”，即加入少量物质来改变材料性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use of drugs or other banned substances to improve athletic performance (illegal in most sports)","zh":"（体育）服用兴奋剂/违禁药物以提高成绩（多数运动项目中属违规）"},"examples":[{"en":"The athlete was banned for doping after a positive test.","zh":"这名运动员因兴奋剂检测呈阳性而被禁赛。"},{"en":"Many sports organizations have strict rules against doping.","zh":"许多体育组织对兴奋剂有严格规定。"}]},{"partOfSpeech":"n.","definition":{"en":"a drug or substance used for doping, especially in sports","zh":"（尤指体育）兴奋剂；用于作弊提升表现的药物/物质"},"examples":[{"en":"The lab identified the doping as an anabolic steroid.","zh":"实验室确认这种兴奋剂是合成代谢类固醇。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of adding a small amount of another substance to change a material’s properties (common in electronics)","zh":"（材料/电子）掺杂；加入少量杂质以改变材料性质"},"examples":[{"en":"Doping silicon with phosphorus increases its conductivity.","zh":"用磷对硅进行掺杂会提高其导电性。"},{"en":"This chip requires precise doping during manufacturing.","zh":"这款芯片在制造过程中需要精确掺杂。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of giving a drug to a person or animal, often secretly or illegally","zh":"（常指秘密或非法）给人或动物下药"},"examples":[{"en":"The investigation looked into the doping of racehorses.","zh":"调查人员审查了赛马被下药的问题。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “dope”: to use or give drugs, or to add a substance to a material","zh":"“dope”的现在分词：服用/给药；（材料）掺杂"},"examples":[{"en":"Some cyclists were accused of doping to gain an advantage.","zh":"一些自行车选手被指控服用兴奋剂以获取优势。"},{"en":"Engineers are doping the semiconductor to control its behavior.","zh":"工程师正在对半导体进行掺杂以控制其性能。"}]}],"synonyms":["performance-enhancing drug use","drug cheating","substance abuse (context-dependent)","material doping (technical)","adulteration (broader)"],"phonetic":"/ˈdoʊpɪŋ/","extraExplanation":["在体育语境里，doping通常带强烈负面含义，常与“作弊”“违规”关联；常见搭配有：anti-doping（反兴奋剂）、doping test（兴奋剂检测）、doping scandal（兴奋剂丑闻）。","在电子/材料学里，doping是中性术语，指通过“掺杂”改变导电性等性质；与体育含义不同，不带道德评判。"]}
{"word":"doping control","summary":{"en":"tests and supervision to prevent and detect banned drug use","zh":"用于发现并防止使用违禁兴奋剂的检测与监管"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the testing and monitoring system used to detect and prevent the use of banned performance‑enhancing drugs (especially in sports)","zh":"（尤指体育领域）为发现并防止使用违禁兴奋剂而进行的检测与监管体系"},"examples":[{"en":"All medal winners must go through doping control after the race.","zh":"所有奖牌获得者在比赛后都必须接受兴奋剂检测。"},{"en":"The athlete was escorted to the doping control station for a urine test.","zh":"这名运动员被带到兴奋剂检测站进行尿检。"},{"en":"Stricter doping control has improved trust in the sport.","zh":"更严格的反兴奋剂监管提升了人们对这项运动的信任。"}]}],"synonyms":["drug testing","anti-doping testing","doping test","anti-doping control","substance testing"],"phonetic":"/ˈdoʊpɪŋ kənˈtroʊl/","extraExplanation":["常见流程：通知抽检 → 身份核验 → 采样（尿检/血检）→ 样本分A瓶/B瓶封存 → 实验室检测 → 如A瓶阳性可申请B瓶复检。","在国际体育中常与 WADA（世界反兴奋剂机构）相关；违反规定可能导致取消成绩、禁赛等处罚。","语境提示：英式英语常说“doping control”，美式语境也常见“drug testing / anti-doping testing”。"],"etymology":"“doping”原指给马或人用药以提升表现，后在体育语境中专指使用违禁兴奋剂；“control”表示“管控/监督”。合起来就是“对兴奋剂使用的检测与监管”。","mnemonic":["把 control 理解为“管控/把关”，doping control 就是“对兴奋剂的把关”。","联想“dope（药）+ control（控制）= 控制用药”，尤其在比赛后抽检最典型。"]}
{"word":"Dopp","summary":{"en":"“Dopp” usually means a “Dopp kit”: a toiletry bag for travel.","zh":"“Dopp”通常指“Dopp kit”：旅行用的洗漱包。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in “Dopp kit”) a small bag used to carry toiletries (like toothpaste, a razor, shampoo) when traveling; a toiletry bag.","zh":"（多用于 “Dopp kit”）旅行时用来装洗漱用品（如牙膏、剃须刀、洗发水等）的小包；洗漱包。"},"examples":[{"en":"I always pack my toothbrush and razor in my Dopp kit.","zh":"我总是把牙刷和剃须刀装进我的洗漱包里。"},{"en":"Don’t forget your Dopp kit when you travel.","zh":"旅行时别忘了带你的洗漱包。"}]}],"synonyms":["toiletry bag","toiletry kit","wash bag","travel toiletry bag"],"phonetic":"/dɑp/","extraExplanation":["“Dopp kit”这个说法在美式英语里很常见。Dopp 原本来自品牌名（与皮革制品商 Charles Doppelt 相关），后来逐渐被当作通用词来指“洗漱包/盥洗包”。在正式写作中也常用更通用的说法：toiletry bag。"]}
{"word":"dopped","summary":{"en":"“Dopped” is a rare/nonstandard past tense of “dop,” usually written “doped.”","zh":"“dopped”是“dop”的少见/非标准过去式，通常写作“doped”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/rare spelling) past tense of “dop”: to give someone drugs (often secretly) or to take drugs; also, in sports, to use banned substances.","zh":"（非标准/少见拼写）“dop”的过去式：给某人下药（常指偷偷地）或吸毒；也可指体育中使用兴奋剂/违禁药物。"},"examples":[{"en":"The athlete was accused of having dopped before the competition.","zh":"那名运动员被指控在比赛前使用了兴奋剂。"},{"en":"Someone may have dopped his drink at the party.","zh":"可能有人在派对上给他的饮料下了药。"}]}],"synonyms":["doped","drugged"],"phonetic":"/dɑpt/","extraExplanation":["“dopped”在标准英语里很少见；更常见的拼写是“doped”（dop 的过去式/过去分词）。如果你想表达“掉落/放下”，通常应该是“dropped”。","在南非英语里，dop 还可以口语表示“一杯酒/喝酒”，因此“dopped”有时会被理解为“喝了酒（尤其是烈酒）”。"]}
{"word":"doppelbock","summary":{"en":"Doppelbock is a strong, malt-forward German lager—basically a richer, higher-alcohol bock.","zh":"Doppelbock（双博克）是一种麦芽味更浓、酒精度更高的德国拉格博克啤酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong German lager (a type of bock) that is richer, maltier, and usually higher in alcohol than a regular bock; often dark and full-bodied, though it can also be pale.","zh":"一种德国强拉格啤酒（属博克啤酒的一种），比普通博克更浓郁、更偏麦芽风味、酒精度通常更高；多为深色、酒体厚实，也有浅色版本。"},"examples":[{"en":"I ordered a doppelbock because I wanted something malty and warming.","zh":"我点了一杯双博克，因为我想喝点麦芽味浓、喝起来暖和的。"},{"en":"Doppelbock is often served in smaller pours since it’s stronger than many lagers.","zh":"双博克酒精度较高，所以常用较小的杯量来供应。"}]}],"synonyms":["strong lager","bock beer","dark strong lager"],"phonetic":"ˈdɑpəlˌbɑk","extraExplanation":["“Doppel-”在德语里有“双倍/加倍”的意思；“Bock”是博克啤酒（较强的拉格风格）。因此 doppelbock 常被理解为“更强、更浓”的博克。","这种风格与德国修道院酿造传统有关：历史上修士在斋戒期会酿更高热量、更有“面包/焦糖/烘烤麦芽”风味的啤酒作为补充。","在酒标或酒名里，你可能会看到很多 doppelbock 以“-ator”结尾（例如 Salvator），这是受早期经典产品命名习惯影响。"]}
{"word":"Doppelganger","summary":{"en":"A doppelganger is a person who looks almost exactly like someone else, sometimes with an eerie or mysterious vibe.","zh":"doppelganger 指与某人几乎一模一样的“分身／替身”，常带一点诡异或神秘的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who looks extremely similar to someone else; a “double” or look-alike (often with a mysterious or uncanny feeling).","zh":"长得与某人极其相像的人；“分身／替身”（常带有神秘、诡异的感觉）。"},"examples":[{"en":"Everyone was shocked because my doppelganger walked into the room and even had the same haircut.","zh":"大家都吓了一跳，因为一个跟我长得一模一样的人走进了房间，连发型都一样。"},{"en":"In the movie, the hero meets his doppelganger and starts to question who he really is.","zh":"在电影里，主角遇到自己的分身，开始怀疑真正的自己是谁。"}]}],"synonyms":["look-alike","double","twin (informal)"],"phonetic":"/ˈdɑpəlˌɡæŋər/","extraExplanation":["“Doppelganger”来自德语：doppel（双重的）+ Gänger（行走的人），字面意思像是“另一个跟你一起走的人”。英语里常用于小说、电影、恐怖或悬疑语境中，暗示一种“不祥的相似”。","在日常口语里也可以更轻松地用来指“长得很像的人”，但如果想避免“诡异”意味，可以说 look-alike 或 double。"]}
{"word":"doppelganger","summary":{"en":"A doppelganger is someone who looks almost exactly like another person; in stories it can also mean a mysterious double.","zh":"doppelganger 指与某人长得几乎一模一样的人；在故事里也可指神秘的“分身”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who looks very similar to someone else; a “double” or look-alike.","zh":"长得和某人非常相像的人；“替身 / 长相相同的人”。"},"examples":[{"en":"Everyone thought the new student was my doppelganger because we have the same face shape.","zh":"大家都以为新来的学生是我的“替身”，因为我们的脸型很像。"},{"en":"I saw my doppelganger on the subway and even our haircuts matched.","zh":"我在地铁上看到一个长得像我的人，连发型都一样。"}]},{"partOfSpeech":"n.","definition":{"en":"In stories and culture, a ghostly or mysterious double of a person, sometimes seen as a bad omen or a sign of trouble.","zh":"（文学/文化中）某人的幽灵般或神秘“分身”，有时被视为不祥之兆或麻烦的预兆。"},"examples":[{"en":"In the novel, meeting his doppelganger made the hero question who he really was.","zh":"在小说里，遇到自己的分身让主人公开始怀疑真正的自我是谁。"},{"en":"Some legends say seeing your own doppelganger is a warning.","zh":"有些传说说，看到自己的分身是一种警告。"}]}],"synonyms":["look-alike","double","twin","spitting image"],"phonetic":"/ˈdɑpəlˌɡæŋɚ/","extraExplanation":["“Doppelganger”来自德语，字面意思是“行走的双重者”（doppel=双重，gänger=行走者）。英语里常用来指“长得很像的人”，也常出现在哥特文学与心理题材中，象征“另一个自我”。","常见搭配：look like someone’s doppelganger（像某人的替身）、a celebrity doppelganger（明星脸/明星替身）。拼写有时会写成 doppelgänger（带变音符），但英语中不带也很常见。"]}
{"word":"Doppelger","summary":{"en":"Doppelgänger (also spelled doppelganger) means a look-alike or double of a person, sometimes with a mysterious or eerie feeling in stories.","zh":"Doppelgänger（也拼作 doppelganger）指与某人长得极像的“分身/替身”；在故事里常带神秘或诡异色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who looks very similar to someone else (often like a “double” or look-alike).","zh":"与某人长得非常像的人；“分身”“长相极像的人”。"},"examples":[{"en":"People kept mistaking him for his doppelgänger at the airport.","zh":"在机场，人们一直把他认成他的“分身”。"},{"en":"She found her doppelgänger on social media and couldn’t believe the resemblance.","zh":"她在社交媒体上发现了一个和自己长得很像的人，简直不敢相信。"}]},{"partOfSpeech":"n.","definition":{"en":"In stories or psychology, a double of a person—sometimes seen as an unsettling or mysterious “shadow self.”","zh":"（文学/心理语境）某人的“另一个自我”或神秘的替身形象，常带有不安、诡异的意味。"},"examples":[{"en":"In the novel, the hero is haunted by a doppelgänger who mirrors his darkest thoughts.","zh":"在小说里，主人公被一个映照他最黑暗想法的“分身”纠缠。"},{"en":"The film uses the doppelgänger as a symbol of hidden identity.","zh":"这部电影用“分身”来象征隐藏的身份。"}]}],"synonyms":["look-alike","double","twin","spitting image"],"phonetic":"ˈdɑpəlˌɡæŋər","extraExplanation":["你写的“Doppelger”通常是拼写误差；标准拼写是 **doppelgänger**（也常写作 **doppelganger**，省略变音符号 ä）。","这个词来自德语，字面意思接近“走在旁边的人/同行者”。在西方民间传说中，遇到自己的分身有时被视为不祥征兆；现代英语里更多是中性用法，表示“长得像的人”。"]}
{"word":"Doppelgnger","summary":{"en":"A doppelgänger is a person who looks extremely similar to someone else, or (in fiction) an eerie double of the self.","zh":"doppelgänger 指与某人长得极像的人；在文学影视中也可指带神秘或不安意味的“另一个自己/分身”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who looks almost exactly like someone else; a “double” or look-alike.","zh":"（与某人）长得几乎一模一样的人；“替身/分身/长相极像的人”。"},"examples":[{"en":"She thought she saw her doppelgänger on the subway.","zh":"她以为自己在地铁上看到了一个和她长得一模一样的人。"},{"en":"People often tell him he has a doppelgänger in our class.","zh":"大家经常说他在我们班里有个“分身”。"}]},{"partOfSpeech":"n.","definition":{"en":"In stories and popular culture, a double of a person—sometimes seen as an unsettling or mysterious “other self.”","zh":"（文学/流行文化中）某人的“另一个自己/幽暗分身”，常带有神秘或不安的意味。"},"examples":[{"en":"In the novel, the hero is haunted by a dark doppelgänger.","zh":"在小说里，主人公被一个黑暗的分身纠缠。"},{"en":"The movie uses the doppelgänger idea to explore identity.","zh":"这部电影用“分身”的设定来探讨身份认同。"}]}],"synonyms":["look-alike","double","dead ringer"],"phonetic":"/ˈdɑpəlˌɡæŋər/","extraExplanation":["这个词来自德语 Doppelgänger，字面意思是“双重行走者/双身行者”。英语里常写作 doppelgänger（带变音符 ä），但在日常书写中也常见不带变音符的 doppelganger。","在英语语境里，它既可以中性地表示“长得像的人”，也可以带有悬疑、恐怖或心理象征意味（像“另一个自我”“不祥的替身”）。"]}
{"word":"doppelkummel","summary":{"en":"Doppelkummel is a sweet, strong caraway liqueur (a rich style of kümmel).","zh":"Doppelkummel是一种甜且偏烈的葛缕子风味利口酒（较浓郁的kümmel）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sweet, often strong caraway-flavored liqueur (a type of kümmel), traditionally from Germany or nearby regions; “doppel” suggests a richer or stronger style than regular kümmel.","zh":"一种甜的、通常酒精度较高的葛缕子（caraway）风味利口酒，属于“kümmel（葛缕子酒）”的一种；“doppel”常暗示比普通kümmel更浓郁或更强劲的风格。"},"examples":[{"en":"After dinner, he ordered a small glass of Doppelkummel as a digestif.","zh":"晚饭后，他点了一小杯doppelkummel当作餐后助消化酒。"},{"en":"The cocktail recipe calls for Doppelkummel to add a warm caraway note.","zh":"这款鸡尾酒配方需要加入doppelkummel来增加温暖的葛缕子香气。"}]}],"synonyms":["kümmel","caraway liqueur"],"phonetic":"/ˈdɑpəl ˈkʊməl/","extraExplanation":["“Doppelkümmel”来自德语：Doppel-（双倍/更强）+ Kümmel（葛缕子）。英语里有时也写作“Doppel-Kümmel”。","它通常被当作餐后酒（digestif）小口饮用，也可能用于调酒，风味接近带香料感的甜烈酒。","与“cumin（孜然）”不同：Kümmel指的是caraway（葛缕子），香气更偏清凉、草本、像黑麦面包里常见的香料味。"]}
{"word":"Doppelmayer","summary":{"en":"“Doppelmayer” is mainly a German-language surname and is often a variant spelling of “Doppelmayr,” also known as a ropeway/cable-car company name.","zh":"“Doppelmayer”主要是德语姓氏，常被视为“Doppelmayr”的异拼；也可能在工程/商业语境中指代以索道与缆车系统闻名的公司。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A (less common) spelling of the German-language surname “Doppelmayr,” used as a family name in German-speaking regions.","zh":"德语系姓氏“Doppelmayr”的一种较少见拼写形式，可作为家族姓氏出现在德语地区。"},"examples":[{"en":"Professor Doppelmayer will speak at the conference tomorrow.","zh":"Doppelmayer 教授将于明天在会议上发言。"},{"en":"Her last name is Doppelmayer, originally from Austria.","zh":"她的姓是 Doppelmayer，家族起源于奥地利。"}]},{"partOfSpeech":"other","definition":{"en":"In business or engineering contexts, it may refer (often via the spelling “Doppelmayr”) to the Austrian company known for cable cars, gondola lifts, and other ropeway systems.","zh":"在商业或工程语境中，它也可能指（常见拼写为“Doppelmayr”）以缆车、吊厢索道等索道系统闻名的奥地利公司。"},"examples":[{"en":"The resort installed a new Doppelmayr gondola last year.","zh":"这家度假村去年安装了一条新的 Doppelmayr 吊厢索道。"},{"en":"Many ski lifts in Europe are built by Doppelmayr.","zh":"欧洲很多滑雪缆车由 Doppelmayr 建造。"}]}],"synonyms":["Doppelmayr (common spelling)"],"phonetic":"ˈdɔpəlˌmaɪər","extraExplanation":["“Doppelmayer”更常见的标准拼写是“Doppelmayr”（尤其在品牌/公司名上）。如果你是在论文、新闻或产品信息里看到它，建议核对原文是否为“Doppelmayr”。","从构词直觉上看，“Doppel-”在德语里常与“double/双倍”相关；“-mayr/-mayer”常见于德语姓氏（与“Meier/Mayer”同源），但作为姓氏不一定有可直接对应的现代英语含义。"]}
{"word":"Doppelmayr","summary":{"en":"Doppelmayr is a proper name, best known as an Austrian ropeway/cable-car manufacturer.","zh":"Doppelmayr 是专有名词，最常指奥地利的索道/缆车制造商。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname), most commonly seen as the name of an Austrian company that builds ropeways (cable cars), gondola lifts, and ski lifts.","zh":"专有名词（姓氏）；最常见用法是指一家奥地利公司，主要建造索道（缆车）、吊厢式缆车和滑雪缆椅等系统。"},"examples":[{"en":"The resort upgraded to a Doppelmayr gondola to handle more skiers.","zh":"这家度假村升级为一套多贝玛亚（Doppelmayr）的吊厢式缆车系统，以容纳更多滑雪者。"},{"en":"Doppelmayr is a well-known name in the ropeway industry.","zh":"在索道行业里，Doppelmayr 是一个很有名的名字。"}]}],"synonyms":["Doppelmayr/Garaventa"],"phonetic":"/ˈdɑpəlˌmaɪr/","extraExplanation":["“Doppelmayr”在英语新闻与旅游/滑雪语境中常指品牌名（公司名），属于专有名词，首字母大写。","该公司常与“Garaventa”一起出现（Doppelmayr/Garaventa），在北美与欧洲的滑雪场、城市观光缆车项目报道中较常见。","发音上可按三部分理解：DOP-əl-myre；重音通常在第一音节。"]}
{"word":"Dopper","summary":{"en":"Dopper is a Dutch brand of reusable water bottle; sometimes people use it to mean that kind of bottle in general.","zh":"Dopper 是荷兰的可重复使用水瓶品牌；有时也被用来泛指那类水瓶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of reusable water bottle from the Netherlands (often used as a generic name for that style of bottle)","zh":"来自荷兰的可重复使用水瓶品牌名（有时也被当作这种水瓶的泛称）"},"examples":[{"en":"I always bring my Dopper to work so I don’t buy plastic bottles.","zh":"我上班总会带着我的 Dopper，这样就不用买一次性塑料瓶了。"},{"en":"She forgot her Dopper, so she refilled a disposable bottle instead.","zh":"她忘了带 Dopper，只好改用一次性瓶子装水。"}]}],"synonyms":["reusable water bottle","water bottle"],"phonetic":"/ˈdɑpər/","extraExplanation":["“Dopper”最常见的是专有名词（品牌名）。在欧洲一些地方，人们会用它泛指“那种可拆洗、可重复使用的水瓶”，类似英语里用“Thermos”泛指保温瓶的现象。书写时品牌通常首字母大写：Dopper。"]}
{"word":"dopper","summary":{"en":"“Dopper” most commonly refers to a reusable water-bottle brand; in South African English, “dopper” can also mean a very conservative Afrikaner person.","zh":"“Dopper”最常见指可重复使用的水瓶品牌；在南非英语中，“dopper”也可指非常保守的阿非利卡人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reusable water bottle brand (Dopper), especially known for its three-part design and sustainability message","zh":"（Dopper）可重复使用的水瓶品牌，常以三段式设计与环保理念著称"},"examples":[{"en":"I brought my Dopper to class so I don’t have to buy plastic bottles.","zh":"我带了我的 Dopper 去上课，这样就不用买塑料瓶了。"},{"en":"She refilled her Dopper at the water station.","zh":"她在饮水处给她的 Dopper 续水。"}]},{"partOfSpeech":"n.","definition":{"en":"(South African English) a very conservative Afrikaner person, traditionally linked with strict religious values and plain dress","zh":"（南非英语）非常保守的阿非利卡人；传统上与严格宗教观念和朴素穿着相关"},"examples":[{"en":"He grew up in a very traditional community and was sometimes called a dopper.","zh":"他在一个非常传统的社区长大，有时会被称为 dopper。"},{"en":"The book contrasts city life with the attitudes of rural doppers.","zh":"这本书对比了城市生活与乡村 doppers 的观念。"}]}],"synonyms":["reusable bottle","water bottle","(SAE) conservative Afrikaner"],"phonetic":"/ˈdɑpər/","extraExplanation":["“Dopper”作为水瓶品牌源自荷兰，常与“减少一次性塑料、随身补水”的环保语境一起出现。","南非语境中的“dopper”带有文化与历史色彩，可能被视为标签化用语；在描述他人时需注意场合与语气，以免冒犯。"]}
{"word":"dopperbird","summary":{"en":"“dopperbird” is not a standard English word; it likely needs context (misspelling, name, or niche usage).","zh":"“dopperbird”不是标准英语词；很可能需要上下文（拼写错误、名称或小众用法）才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard term that does not have a widely accepted meaning in standard English dictionaries; it is likely a misspelling, a brand/user name, or a niche word that needs context to interpret.","zh":"一个非常少见或非标准的词，在常见英文词典中没有公认释义；很可能是拼写错误、品牌/用户名，或小众用语，需要上下文才能确定含义。"},"examples":[{"en":"I can’t find “dopperbird” in standard dictionaries—where did you see it?","zh":"我在常见词典里找不到“dopperbird”——你是在哪里看到的？"},{"en":"If you meant “Doppler,” the spelling is different and the meaning changes.","zh":"如果你想写的是“Doppler（多普勒）”，拼写不同，意思也会变。"}]}],"phonetic":"/ˈdɑpərbɝd/","extraExplanation":["“dopperbird”更像是由两部分拼出来的词（dopper + bird），但在标准英语里并不常见，所以需要来源来判断：\n1) 可能是拼写错误：常见接近词有 Doppler（多普勒）、dapper（衣着讲究的）。\n2) 可能是专有名词/用户名：例如网名、游戏名、社群昵称。\n3) “Dopper”在南非语境中可能指特定群体（如保守派阿非利卡人宗教群体的俗称），也可能是品牌名（如水瓶品牌），但与“bird”组合并非固定英语词。\n如果你告诉我它出现的句子/平台（书、歌词、游戏、社交媒体等），我可以更准确地解释。"]}
{"word":"doppia","summary":{"en":"“Doppia” is Italian for “double,” and it’s commonly used for a double room or (informally) a double espresso.","zh":"“doppia”在意大利语里表示“双的”，常用于“双人间”，口语里也可指“双份浓缩咖啡”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian) double; two of the same kind (feminine form of the adjective).","zh":"（意大利语）双的、成对的（形容词阴性形式）。"},"examples":[{"en":"Ho una camera doppia.","zh":"我有一间双人房。"},{"en":"Vuoi una porzione doppia?","zh":"你要双份吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(Italian) a double room (hotel); a room for two people (feminine noun use).","zh":"（意大利语）（酒店）双人间（也可作阴性名词用法）。"},"examples":[{"en":"Vorrei prenotare una doppia per due notti.","zh":"我想预订一间双人房住两晚。"}]},{"partOfSpeech":"n.","definition":{"en":"(Italian, informal) a double espresso / two shots of espresso (common in cafés).","zh":"（意大利语，口语）（咖啡馆常用）双份浓缩/两份浓缩。"},"examples":[{"en":"Prendo una doppia, grazie.","zh":"我要一杯双份浓缩，谢谢。"}]}],"synonyms":["doppio","due","raddoppiato"],"phonetic":"/ˈdoʊpiə/","extraExplanation":["“doppia”是意大利语形容词的阴性单数形式，对应阳性单数是“doppio”。例如：un letto doppio（双人床，阳性） vs. una camera doppia（双人房，阴性）。","在酒店语境里，意大利语常说“camera doppia”（双人间），和“camera singola”（单人间）形成固定搭配。","咖啡语境中点单时说“una doppia”通常指“双份浓缩”，不同地区也可能直接说“un doppio”。"]}
{"word":"dopping","summary":{"en":"“Dopping” usually refers to attaching a gemstone to a dop stick for cutting/polishing; it’s also sometimes a misspelling of “doping.”","zh":"“dopping”通常指宝石加工中把宝石粘到托杆上以便切磨抛光；有时也只是把“doping（兴奋剂/用药）”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Lapidary/jewelry) The act of attaching a gemstone (or other small object) to a holder (a “dop stick”) with wax or glue so it can be cut, ground, or polished safely.","zh":"（宝石加工/首饰）用蜡或胶把宝石（或小物件）固定在“粘杆/托杆（dop stick）”上，便于安全地切割、打磨或抛光。"},"examples":[{"en":"Before polishing, the cutter spent a few minutes dopping the opal onto a dop stick.","zh":"抛光前，切磨师花了几分钟把欧泊粘到托杆上。"},{"en":"If the wax is too soft, dopping may fail when the stone heats up.","zh":"如果蜡太软，宝石一受热，粘托可能就会脱落。"}]},{"partOfSpeech":"other","definition":{"en":"A less common spelling of “dopping” used by some people when they mean “doping” (using drugs, especially to improve performance).","zh":"一种不太常见的拼写；有些人写“dopping”其实是想表达“doping（用药/兴奋剂，尤其为提高成绩）”。"},"examples":[{"en":"The article is about doping in sports, but it misspelled the word as “dopping.”","zh":"那篇文章谈的是体育中的兴奋剂问题，但把词拼成了“dopping”。"}]}],"synonyms":["mounting","attaching","doping"],"phonetic":"ˈdɑpɪŋ","extraExplanation":["“dop / dopping”在宝石加工领域很常见：dop是把宝石粘在托杆上的“托”，dopping就是“粘托/上托”的过程。常见搭配有：dopping wax（粘托蜡）、dop stick（托杆）。","如果你的意思是“兴奋剂/用药”，标准拼写是“doping”，更常见也更正式。"]}
{"word":"doppio","summary":{"en":"A doppio is a double shot of espresso.","zh":"doppio 指“双份意式浓缩咖啡”（双份浓缩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a double shot of espresso (about twice the amount of a single espresso).","zh":"（咖啡）双份浓缩咖啡；双份意式浓缩（通常是一份的两倍量）。"},"examples":[{"en":"I’ll have a doppio, please—no sugar.","zh":"请给我一杯双份浓缩，不加糖。"},{"en":"She ordered a doppio to help her stay awake during the long meeting.","zh":"她点了双份浓缩，好在长会议中保持清醒。"},{"en":"This latte is made with a doppio, so it tastes stronger.","zh":"这杯拿铁用的是双份浓缩，所以味道更浓。"}]}],"synonyms":["double espresso","double shot (of espresso)","doppio espresso"],"phonetic":"/ˈdoʊpioʊ/","extraExplanation":["“doppio”来自意大利语，意思是“加倍的/双份的”。在咖啡馆点单时，doppio通常默认指“双份意式浓缩”（double espresso）。在一些地方也会写作“doppio espresso”。"]}
{"word":"Doppler","summary":{"en":"Doppler usually refers to the Doppler effect: a change in observed wave frequency caused by relative motion; it also describes tools/techniques that use this effect (e.g., Doppler radar).","zh":"Doppler 通常指“多普勒效应”：因相对运动而产生的观测频率变化；也可作形容词表示“利用多普勒效应的”（如多普勒雷达）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(physics) A change in the observed frequency (pitch) or wavelength of a wave (such as sound or light) caused by relative motion between the source and the observer.","zh":"（物理）多普勒效应：由于波源与观察者之间的相对运动，导致观察到的波（如声音或光）的频率（音高）或波长发生变化的现象。"},"examples":[{"en":"As the ambulance passed, the siren sounded higher, then suddenly lower—this is the Doppler effect.","zh":"救护车驶过时，警笛听起来先变高、随后突然变低——这就是多普勒效应。"},{"en":"Weather radar uses the Doppler effect to estimate wind speed.","zh":"气象雷达利用多普勒效应来估算风速。"},{"en":"Astronomers use Doppler shifts in light to tell whether a star is moving toward or away from Earth.","zh":"天文学家通过光的多普勒频移来判断恒星是在靠近还是远离地球。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or using the Doppler effect (often used before a noun).","zh":"与多普勒效应有关的；利用多普勒效应的（常作定语）。"},"examples":[{"en":"The doctor ordered a Doppler ultrasound to check blood flow.","zh":"医生安排了多普勒超声来检查血流。"},{"en":"They installed a Doppler radar system at the airport.","zh":"他们在机场安装了多普勒雷达系统。"}]}],"synonyms":["Doppler effect","Doppler shift","frequency shift"],"phonetic":"/ˈdɑplɚ/","extraExplanation":["“Doppler”来自奥地利物理学家 Christian Doppler（克里斯蒂安·多普勒，1803–1853）的姓氏。他在 1842 年提出该现象的理论解释，因此英语里常把它写作大写（Doppler）。","在日常生活里，你最容易听到的是“声音的多普勒效应”（例如警笛、火车鸣笛）；在科学与医疗领域里常见搭配有 Doppler radar（多普勒雷达）、Doppler shift（多普勒频移）、Doppler ultrasound（多普勒超声）。"]}
{"word":"Doppler effect","summary":{"en":"frequency change caused by relative motion","zh":"由相对运动引起的频率变化"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a change in the observed frequency (and wavelength) of a wave caused by relative motion between the source and the observer","zh":"由于波源与观察者之间的相对运动而导致的观测频率（及波长）变化"},"examples":[{"en":"The Doppler effect makes a siren sound higher as an ambulance approaches and lower as it drives away.","zh":"多普勒效应会让救护车靠近时警笛听起来更高，远离时更低。"},{"en":"Astronomers use the Doppler effect to measure whether a star is moving toward or away from Earth.","zh":"天文学家利用多普勒效应来测量恒星是在向地球靠近还是远离。"},{"en":"Weather radar detects wind speed by measuring the Doppler effect in reflected radio waves.","zh":"气象雷达通过测量反射无线电波的多普勒效应来检测风速。"}]}],"synonyms":["Doppler shift","frequency shift","redshift","blueshift"],"phonetic":"/ˈdɑplər ɪˌfɛkt/","extraExplanation":["日常最常见的例子是“救护车效应”：靠近时频率变高（音调变尖），远离时频率变低。","不只适用于声音，也适用于光、无线电等所有波；在天文学中常用“红移/蓝移”来描述光的多普勒效应。"],"etymology":"以奥地利物理学家克里斯蒂安·多普勒（Christian Doppler）的名字命名；他在1842年提出该效应，用于解释因相对运动导致的波的频率变化。","mnemonic":["把它拆成“多普勒 + effect（效应）”：一“动”（相对运动）就会“变”（频率变）。","联想中文常说的“由近到远，音调由高到低”：靠近=变高，远离=变低。"]}
{"word":"Doppler radar","summary":{"en":"Radar that detects motion by measuring frequency change in reflected waves.","zh":"通过反射波频率变化来探测运动的雷达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A radar system that uses the Doppler effect to measure the speed and direction of moving objects (such as rain, wind, or vehicles).","zh":"一种利用多普勒效应来测量移动物体（如降雨、风或车辆）速度和方向的雷达系统。"},"examples":[{"en":"Meteorologists use Doppler radar to track storms and estimate wind speed.","zh":"气象学家使用多普勒雷达来追踪风暴并估算风速。"},{"en":"The Doppler radar image showed a strong area of rotation inside the thunderstorm.","zh":"多普勒雷达图像显示雷暴内部有一个强烈的旋转区域。"}]}],"synonyms":["Doppler weather radar","weather radar","velocity radar"],"phonetic":"/ˈdɑplɚ ˈreɪˌdɑr/","extraExplanation":["多普勒雷达常用于气象领域：不仅能“看到”降水回波在哪里，还能通过频移推算风的来向与来速，因此对监测龙卷风、强对流、台风外围雨带等很重要。","日常新闻里常见的“Doppler radar”多指“Doppler weather radar（多普勒天气雷达）”。"],"etymology":"“Doppler”来自奥地利物理学家克里斯蒂安·多普勒（Christian Doppler），其提出“多普勒效应”（运动导致波频率/波长看起来变化）；“radar”是“radio detection and ranging”的缩写（无线电探测与测距）。","mnemonic":["把 Doppler 记成“动（Dop-）就会变（-pler）”：物体在动，频率就会变——这正是多普勒效应。","联想救护车鸣笛靠近更尖、远离更低：同样的“频移”原理也能用于雷达测速。"]}
{"word":"dopplerite","summary":{"en":"Dopplerite is a rare resin-like organic mineral found in some lignite or coal deposits.","zh":"Dopplerite（多普勒石）是一种罕见的树脂状有机矿物，见于部分褐煤或煤层沉积中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare, brownish, resin-like organic mineral (a kind of fossilized material) found in some lignite or coal deposits","zh":"多普勒石：一种罕见的棕褐色、树脂状的有机矿物（类似化石化的有机物），可见于部分褐煤或煤层沉积中"},"examples":[{"en":"Dopplerite has been reported in a few lignite deposits as a resin-like substance.","zh":"在少数褐煤矿床中曾报告发现多普勒石，呈树脂状物质。"},{"en":"The sample looked like dark resin, but it was identified as dopplerite by mineral analysis.","zh":"该样品看起来像深色树脂，但经矿物分析鉴定为多普勒石。"}]}],"phonetic":"/ˈdɑːpləˌraɪt/","extraExplanation":["这是一个较少见、偏矿物学/地质学的词，日常英语中几乎不会用到。","名称通常被认为与19世纪的科学界/学术命名传统有关，但它与“多普勒效应（Doppler effect）”在意义上没有直接关系；不要把它当作与雷达或声学相关的词。"]}
{"word":"dopster","summary":{"en":"“Dopster” is informal slang, most often meaning a person involved with illegal drugs; less commonly it can mean someone very cool or talented.","zh":"“Dopster”是非正式俚语，最常见指与非法毒品有关的人；较少情况下也可指很酷或很有才华的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) A person involved with illegal drugs, especially someone who uses or deals drugs.","zh":"（俚语，非正式）与非法毒品有关的人，尤指吸毒者或贩毒者。"},"examples":[{"en":"He got in trouble for hanging out with dopsters from the neighborhood.","zh":"他因为和附近那些吸毒/贩毒的人混在一起而惹上麻烦。"},{"en":"The police were looking for a dopster who was selling pills outside the club.","zh":"警方正在寻找一个在夜店外卖药丸的毒贩。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, less common) A “dope” person—someone considered very cool, impressive, or talented.","zh":"（俚语，较不常见）很“牛/很酷”的人——被认为很厉害、很有型或很有才华的人。"},"examples":[{"en":"That DJ is a total dopster—every set is amazing.","zh":"那个DJ真的很牛——每一场都很炸。"},{"en":"She’s a dopster at design; her posters always stand out.","zh":"她做设计很厉害；她的海报总是很出彩。"}]}],"synonyms":["dopester","drug user","drug dealer","junkie (often offensive)","dope person (slang)"],"phonetic":"/ˈdɑp.stɚ/","extraExplanation":["“dopster”不是非常常见、也不太标准的词，更常见的拼法是“dopester”。在不同社群里含义可能变化：在负面语境里多指涉毒相关的人；在音乐/街头文化语境里也可能是对“dope（很酷/很棒）”的延伸用法。遇到时最好根据上下文判断。"]}
{"word":"dopy","summary":{"en":"Dopey means silly/stupid or sleepy and not alert (often written by mistake as “dopy”).","zh":"Dopey 指“傻乎乎的/愚笨的”，也可指“困倦迷糊、不清醒的”（“dopy”多为拼写误写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Stupid or foolish; not thinking clearly.","zh":"愚笨的；傻乎乎的；不太清醒的。"},"examples":[{"en":"That was a dopey mistake—I forgot my keys again.","zh":"那真是个傻乎乎的错误——我又忘带钥匙了。"},{"en":"He gave me a dopey grin and said he didn’t understand the joke.","zh":"他傻笑了一下，说他没听懂这个笑话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sleepy, slow, or not fully alert (often because of being tired or medicine).","zh":"困倦的；迟钝的；没完全清醒的（常因疲劳或药物）。"},"examples":[{"en":"I feel dopey after taking this cold medicine.","zh":"吃了这感冒药后我感觉有点昏昏沉沉的。"},{"en":"She was dopey in the morning because she didn’t sleep well.","zh":"她早上看起来有点迷糊，因为没睡好。"}]}],"synonyms":["silly","foolish","dumb (informal)","sleepy","groggy","dazed"],"phonetic":"/ˈdoʊpi/","extraExplanation":["“dopy”通常是“dopey”的拼写错误。“dopey”在口语里很常见，语气多为不太严肃、带点调侃；但用来形容人时可能显得不礼貌，最好用在熟人或轻松语境。","词源上“dopey”与“dope”有关：早期“dope”可指药物/麻醉品，因此“dopey”也常带有“像被药弄得昏昏沉沉”的含义。"]}

