{"word":"DOV","summary":{"en":"“DOV” is usually an abbreviation with meaning determined by context; it can also be a given name when written as “Dov.”","zh":"“DOV”通常是需靠上下文判断含义的缩写；写作“Dov”时也可作人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(as an abbreviation) A short form that can stand for different phrases depending on the field; common meanings include “Date of Value/Valuation” in finance or “Department/Division of Vehicles” in some organizations.","zh":"（缩写）在不同领域里可能代表不同词组；常见含义包括金融中的“价值日期/估值日期（Date of Value/Valuation）”，以及某些机构中的“车辆部门/车辆处（Department/Division of Vehicles）”。"},"examples":[{"en":"The payment will be processed on the DOV shown on the invoice.","zh":"付款将按照发票上标注的 DOV 日期处理。"},{"en":"Please contact the DOV to update your vehicle records.","zh":"请联系 DOV 更新你的车辆登记信息。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name, often from Hebrew, commonly spelled “Dov.”","zh":"男性名字，常见源自希伯来语，通常写作“Dov”。"},"examples":[{"en":"Dov is a common name in some Jewish communities.","zh":"Dov 在一些犹太社群中是较常见的名字。"},{"en":"I met Dov at the conference last year.","zh":"我去年在会议上认识了 Dov。"}]}],"synonyms":["abbreviation","acronym","short form"],"phonetic":"/ˌdiːoʊˈviː/","extraExplanation":["“DOV”并不是像“USA/UK”那样非常固定的缩写，实际含义高度依赖上下文（行业、国家、文件类型）。在邮件或表格里看到时，最好查看同一页是否有全称（full form）或询问对方“DOV stands for what?” 来确认。","如果你指的是人名，通常写作“Dov”，而不是全大写“DOV”。全大写更像缩写。"]}
{"word":"DOVAP","summary":{"en":"“DOVAP” is usually an acronym or name; its meaning depends on context and is not a common dictionary word.","zh":"“DOVAP”通常是缩写或名称；含义依语境而定，并非常见词典词条。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as an acronym or a project/product name. The exact meaning depends on the field or context.","zh":"不是常见英语单词；通常作为首字母缩写（acronym）或项目/产品名称出现。具体含义取决于使用领域与语境。"},"examples":[{"en":"I saw “DOVAP” in the document, but it wasn’t defined—do you know what it stands for?","zh":"我在文件里看到 “DOVAP”，但没有解释——你知道它代表什么吗？"},{"en":"In this report, DOVAP appears to be a system name rather than a regular English word.","zh":"在这份报告里，DOVAP 看起来像是系统名称，而不是普通英语单词。"}]}],"phonetic":"/ˈdiː oʊ viː eɪ piː/","extraExplanation":["“DOVAP”在通用英语词典中并不常见，因此更可能是缩写。不同领域可能有不同展开方式（例如公司内部系统名、科研项目名、技术术语等）。","如果你把它出现的完整句子、所属领域（例如医疗、军警、IT、学术论文等）或它的全称/相关上下文发我，我可以帮你更准确地解释含义与用法。","读缩写时通常有两种方式：逐字母读（D-O-V-A-P），或按一个“词”读（如果所在组织这样约定）。"]}
{"word":"Dove","summary":{"en":"“Dove” most commonly means a dove (a pigeon-like bird and a symbol of peace). In American English it can also be the past tense of “dive.”","zh":"“dove”最常见意思是“鸽子”（也常象征和平）；在美式英语中也可作“dive”的过去式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bird in the pigeon family, often with a gentle appearance; a common symbol of peace","zh":"鸽子（鸠鸽科的小鸟，外形温和；常象征和平）"},"examples":[{"en":"A white dove flew over the crowd.","zh":"一只白鸽从人群上方飞过。"},{"en":"The dove is often used as a symbol of peace.","zh":"鸽子常被用作和平的象征。"},{"en":"They released doves at the ceremony.","zh":"他们在仪式上放飞了鸽子。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense of “dive” in American English) went down quickly into water or moved downward suddenly","zh":"（美式英语中 dive 的过去式）跳水；俯冲；突然向下"},"examples":[{"en":"He dove into the pool to save the child.","zh":"他跳进泳池去救那个孩子。"},{"en":"The plane dove toward the ground.","zh":"飞机朝地面俯冲。"}]}],"synonyms":["pigeon","peace symbol","dived (as past tense of dive)"],"phonetic":"/dʌv/","extraExplanation":["“dove”作名词通常读 /dʌv/。但在美式英语里，它也常作动词“dive”的过去式，很多人读 /doʊv/；书面语里也常见过去式“dived”。两种形式都对，选择哪一种取决于地区与个人习惯。","文化含义：白鸽象征和平的用法在西方文化中很常见，常与《圣经》中“诺亚方舟”故事（鸽子衔橄榄枝）以及现代和平运动的视觉符号联系在一起。"]}
{"word":"dove","summary":{"en":"“Dove” most commonly means a bird symbolizing peace, and it can also be the past tense of “dive.”","zh":"“dove”最常指象征和平的鸽子；也可作“dive”的过去式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small bird (often white) that symbolizes peace or love; also a type of pigeon.","zh":"鸽子（常为白色），常象征和平或爱情；也可指一种鸽科鸟类。"},"examples":[{"en":"A white dove is often used as a symbol of peace.","zh":"白鸽常被用作和平的象征。"},{"en":"The dove flew out of the cage and into the sky.","zh":"鸽子从笼子里飞出，飞向天空。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense of “dive”: to go quickly down into water or move downward suddenly.","zh":"“dive”的过去式：跳入水中；（突然）俯冲、猛冲向下。"},"examples":[{"en":"He dove into the pool to save the child.","zh":"他跳进泳池去救那个孩子。"},{"en":"The plane dove through the clouds.","zh":"飞机俯冲穿过云层。"}]}],"synonyms":["pigeon","bird","dived (past of dive)"],"phonetic":"/dʌv/","extraExplanation":["“dove”既可以是名词“鸽子”，也可以是动词“dive”的过去式。学习时可用语境判断：前面有冠词 a/the、形容词 white 等时多为“鸽子”；与 into/down/through 等介词连用、表示动作时多为“跳水/俯冲”的过去式。","象征意义：在西方文化中，鸽子（尤其白鸽）常与“和平”相关；这一意象也常出现在文学与艺术中（如“a dove of peace”和“the olive branch”常一起出现）。","拼写提示：名词 dove 复数是 doves；动词过去式 dove 在美式英语中很常见，而英式英语里也常用 dived。"]}
{"word":"Dove Chocolate","summary":{"en":"a well-known chocolate brand (mainly in the U.S.).","zh":"知名巧克力品牌（主要在美国）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand name for milk and dark chocolate products (such as bars, squares, and ice cream), sold mainly in the U.S.","zh":"德芙巧克力（主要在美国销售的巧克力品牌名，含巧克力块/方块等产品）。"},"examples":[{"en":"She bought a bag of Dove Chocolate squares to share at the office.","zh":"她买了一袋德芙巧克力方块，在办公室分享。"},{"en":"Dove Chocolate often includes a short message inside the wrapper.","zh":"德芙巧克力常在包装纸内侧印一句简短的“金句”。"}]}],"synonyms":["Dove","Galaxy","chocolate","chocolate bar"],"phonetic":"/dʌv ˈtʃɑk(ə)lət/","extraExplanation":["在美国市场常叫 Dove Chocolate；在英国、爱尔兰等地，类似产品常以 Galaxy（银河）品牌销售（同属玛氏公司旗下）。","英语里品牌名通常首字母大写；日常口语中也会简化说“Dove”。","注意区分：Dove 也常指“多芬”（个人护理品牌，沐浴露/香皂）。"],"etymology":"品牌名：Dove 原义为“鸽子”，被用于巧克力品牌命名；该品牌在不同地区有不同命名体系（如英国多以 Galaxy 销售）。","mnemonic":["Dove=鸽子；把“鸽子+巧克力”联想成“送礼的甜蜜小鸽子”，容易记住是品牌名。"]}
{"word":"dove-filled","summary":{"en":"Dove-filled describes a place or scene that is full of doves, often suggesting peace or gentleness.","zh":"dove-filled 形容某处“满是鸽子”，常带有宁静、温柔或和平的意象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Filled with doves (the birds), or having many doves present; often used to create a peaceful, gentle, or romantic image in writing.","zh":"充满鸽子（这种鸟）的；有很多鸽子出现的（常用于描写宁静、温柔或浪漫的画面）。"},"examples":[{"en":"The courtyard was dove-filled at sunrise, soft wings fluttering above the fountain.","zh":"日出时分，庭院里满是鸽子，喷泉上方传来轻轻的振翅声。"},{"en":"In the poem, a dove-filled sky signals a moment of calm after conflict.","zh":"在这首诗里，满天的鸽子象征冲突之后的一刻安宁。"}]}],"synonyms":["full of doves","dove-packed","dove-populated","dove-rich"],"phonetic":"/ˈdʌv fɪld/","extraExplanation":["“dove-filled”是由名词+d形容词（-filled）构成的复合形容词，常见结构还有“smoke-filled（烟雾弥漫的）”“crowd-filled（人群拥挤的）”。","“dove（鸽子）”在英语文化中常与“peace（和平）”“purity（纯洁）”“hope（希望）”联系在一起，所以“dove-filled”经常用于文学或抒情描写来营造象征意义。注意不要和动词过去式“dove（潜水）”混淆。"]}
{"word":"dove-footed","summary":{"en":"A poetic adjective meaning gentle, light, and graceful in movement (like a dove).","zh":"一个诗歌色彩的形容词，指步伐轻柔、动作优雅温和，像鸽子一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Poetic) Moving lightly, softly, or gracefully, like a dove; gentle in manner or movement.","zh":"（诗歌用语）步伐轻柔、动作优雅，像鸽子一样轻快；也可形容气质温柔。"},"examples":[{"en":"The dancer crossed the stage, dove-footed and calm.","zh":"那位舞者轻步穿过舞台，步伐柔和而沉静。"},{"en":"In the poem, the child is described as dove-footed, never making a harsh sound.","zh":"在诗里，这个孩子被写成“鸽足般轻柔”，从不发出刺耳的声响。"},{"en":"She approached the sickbed dove-footed, trying not to wake him.","zh":"她轻手轻脚地走近病床，尽量不把他吵醒。"}]}],"synonyms":["light-footed","soft-footed","quiet-footed","gentle","graceful"],"phonetic":"/ˈdʌv ˌfʊtɪd/","extraExplanation":["“dove-footed”是带有强烈文学/诗歌色彩的复合形容词：dove（鸽子，联想温柔、和平）+ footed（有……脚/以……步态行走）。它常用于描写“轻、柔、安静”的走路方式或气质，日常口语里更常说：light-footed / soft-footed / quiet-footed。","文学中常见类似的意象搭配（epithet），例如“dove-footed Cupid（轻柔如鸽的丘比特）”，用来强调神话人物或角色的温柔与灵巧。"]}
{"word":"dove-like","summary":{"en":"“Dove-like” means gentle, peaceful, or resembling a dove—often with a sense of calmness and peace symbolism.","zh":"“dove-like”指像鸽子一样温和、平静、和平，常带有“和平象征”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a dove (a symbol of peace and gentleness); calm, gentle, and peaceful in appearance or behavior.","zh":"像鸽子的（常象征和平与温柔）；外表或举止平静、温和、祥和的。"},"examples":[{"en":"She spoke in a dove-like voice that calmed the room.","zh":"她用一种鸽子般温柔的声音说话，让整个房间都安静下来。"},{"en":"The painting shows a dove-like figure holding an olive branch.","zh":"这幅画描绘了一个鸽子般的形象，手持橄榄枝。"},{"en":"He gave a dove-like smile, peaceful and reassuring.","zh":"他露出鸽子般的微笑，平和又令人安心。"}]}],"synonyms":["gentle","peaceful","mild","tender","dovelike"],"phonetic":"/ˈdʌvˌlaɪk/","extraExplanation":["“dove-like”常带有文化象征意义：在西方文化中，鸽子与“和平、纯洁、温柔”联系紧密，尤其是“衔橄榄枝的鸽子”这一意象。","写作中用“dove-like”多用于描写气质（gentle, mild, peaceful），也可用于外观特征（如柔和的灰白色、圆润的轮廓）。"]}
{"word":"dove-related","summary":{"en":"Connected to doves or what doves symbolize (often peace).","zh":"与鸽子或鸽子的象征意义（常指和平）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to doves (the bird), or connected with the symbolism commonly associated with doves (especially peace, love, or innocence).","zh":"与“鸽子”（这种鸟）有关的；或与鸽子常见象征意义（尤其是和平、爱、纯真）相关的。"},"examples":[{"en":"The museum displayed dove-related artwork to promote peace.","zh":"博物馆展出了与鸽子相关的艺术作品，以倡导和平。"},{"en":"They chose a dove-related theme for the wedding invitations.","zh":"他们为婚礼请柬选择了鸽子相关的主题。"}]}],"synonyms":["dove-associated","dove-linked","dove-themed","peace-related"],"phonetic":"/ˈdʌv rɪˌleɪtɪd/","extraExplanation":["“dove-related”是由名词dove（鸽子）+ related（相关的）构成的复合形容词，常用连字符（-）放在名词前作定语：dove-related symbols / dove-related events。放在系动词后作表语时，有时也可写成不加连字符的形式，但加连字符更清晰。","注意dove还可能是动词dive的过去式（He dove into the pool. 他跳入泳池），但“dove-related”通常指“与鸽子有关”，而不是与“跳水/俯冲”有关。"]}
{"word":"dove-shaped","summary":{"en":"“Dove-shaped” means having the shape of a dove, sometimes suggesting peace or hope depending on context.","zh":"“dove-shaped”指“鸽子形状的”，在特定语境下也可能暗示和平或希望。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a dove (a small bird often seen as a symbol of peace).","zh":"鸽子形状的；像鸽子一样的（鸽子常被视为和平的象征）。"},"examples":[{"en":"She wore a dove-shaped pendant.","zh":"她戴着一枚鸽子形状的吊坠。"},{"en":"A dove-shaped cloud drifted across the sky.","zh":"一朵像鸽子一样的云飘过天空。"},{"en":"They released dove-shaped paper lanterns for the ceremony.","zh":"他们在仪式上放飞了鸽子形状的纸灯笼。"}]}],"synonyms":["dove-like","in the shape of a dove"],"phonetic":"/ˈdʌv ʃeɪpt/","extraExplanation":["“dove-shaped”是由“dove（鸽子）+ -shaped（……形状的）”构成的复合形容词，常用于描述装饰物、图案、云朵或手工艺品的外形。","在西方文化中，鸽子（尤其是白鸽）常象征和平、希望与祝福；宗教语境里也可能象征圣灵。因此这个词在描述“形状”之外，有时也带一点象征意味（取决于上下文）。","写作提示：作形容词时通常放在名词前（a dove-shaped brooch）；也可放在系动词后（The brooch is dove-shaped）。"]}
{"word":"dovecot","summary":{"en":"A dovecot is a shelter for keeping doves (or pigeons), and it can also mean many small compartments like a pigeonhole wall.","zh":"dovecot 指鸽舍（养鸽的小屋）；也可比喻许多小隔间/小格子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small building or shelter where doves (or pigeons) are kept, often for breeding","zh":"鸽舍；养鸽的小屋（常用于饲养、繁殖鸽子）"},"examples":[{"en":"They built a dovecot at the edge of the garden to keep doves.","zh":"他们在花园边上建了一个鸽舍来养鸽子。"},{"en":"The old farm still has a stone dovecot behind the barn.","zh":"那座老农场的谷仓后面仍有一座石砌鸽舍。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of small compartments or holes, like the nests in a dovecot (often used figuratively)","zh":"（比喻）一排小格子/小隔间；蜂窝状隔间"},"examples":[{"en":"The mailroom wall was a dovecot of labeled slots for each employee.","zh":"收发室那面墙像鸽舍一样，有给每位员工标好名字的小格子。"},{"en":"The apartment’s storage area felt like a dovecot of tiny cubbies.","zh":"公寓的储物区像鸽舍一样，到处是小隔间。"}]}],"synonyms":["pigeonhouse","dovehouse","pigeon loft","pigeonhole wall"],"phonetic":"/ˈdʌvˌkɑt/","extraExplanation":["“dovecot”由“dove（鸽子）+ cot（小屋）”构成。欧洲历史上，庄园或农场常建鸽舍，既取鸽肉/鸽蛋，也收集鸽粪作肥料，因此在旧式乡村建筑里很常见。","英语里鸽子常象征和平与温柔，所以文学或描写中出现“dovecot”时，除了字面“鸽舍”，也可能带有宁静、田园或秩序井然（很多小格子）的联想。"]}
{"word":"dovecote","summary":{"en":"A dovecote is a structure where doves or pigeons live and nest, often on farms or old estates.","zh":"dovecote 指供鸽子/鸠栖息筑巢的鸽舍，常见于农场或旧庄园建筑中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small building or set of nesting boxes where doves or pigeons are kept, especially for breeding","zh":"鸽舍；鸽房（饲养、繁殖鸽子/鸠的建筑或巢箱）"},"examples":[{"en":"Behind the farmhouse, there was an old dovecote full of pigeons.","zh":"农舍后面有一座老旧的鸽舍，里面满是鸽子。"},{"en":"The garden wall had a dovecote built into it.","zh":"花园的围墙里嵌着一处鸽舍。"}]}],"synonyms":["pigeonhouse","pigeon loft","pigeon cote"],"phonetic":"/ˈdʌvˌkoʊt/","extraExplanation":["“dovecote”在英国乡村与欧洲庄园文化里比较常见：过去养鸽不仅为了观赏，也为获取肉类与鸽粪（可作肥料）。因此在历史建筑中常见到独立的小塔状或墙体嵌入式鸽舍。","词源上由“dove（鸽/鸠）+ cote（小屋、棚舍）”组成。","相关词：dovecot（美式拼写，较少见）；pigeon loft（鸽棚/鸽楼，更口语）。"]}
{"word":"dovecotes","summary":{"en":"Dovecotes are buildings or boxes where doves or pigeons are kept, often on farms or estates.","zh":"dovecotes 指饲养鸽子或鸽类的鸽舍/鸽房，常见于农场或庄园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A structure (often a small building or box) made to house doves or pigeons, especially for breeding or keeping them.","zh":"鸽舍；鸽房（用来饲养、繁殖鸽子或鸽类的建筑或箱体）。"},"examples":[{"en":"Behind the farmhouse there was an old dovecote full of nesting pigeons.","zh":"农舍后面有一座旧鸽舍，里面满是筑巢的鸽子。"},{"en":"The estate’s dovecotes were built of stone and had dozens of small holes for birds.","zh":"庄园的鸽舍用石头建成，上面有几十个供鸟进出的洞口。"}]}],"synonyms":["dovecot","pigeon house","pigeon loft","columbarium"],"phonetic":"/ˈdʌvˌkoʊt/","extraExplanation":["“dovecote”在英式英语中也常写作“dovecot”。历史上，欧洲一些庄园会修建鸽舍来提供肉食（乳鸽）、鸟蛋或肥料；在中世纪到近代早期，拥有鸽舍有时还是土地与地位的象征。","词形：dovecotes 是 dovecote 的复数。"]}
{"word":"dovecots","summary":{"en":"“Dovecots” means places (small buildings) where doves or pigeons are kept.","zh":"“dovecots”指饲养鸽子/鸽类的鸽舍（dovecot 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “dovecot”: a small building or shelter where doves or pigeons are kept (often with many nesting holes).","zh":"“dovecot”的复数：鸽舍；鸽房（饲养鸽子或鸽类的建筑，常有许多巢穴/小洞）"},"examples":[{"en":"The old farmhouse still had dovecots behind the barn.","zh":"那座老农舍的谷仓后面还有鸽舍。"},{"en":"In the garden, the dovecots were built high to protect the birds from predators.","zh":"花园里的鸽舍建得很高，用来保护鸟类免受捕食者伤害。"}]}],"synonyms":["pigeonhouse","pigeon loft","dovecote (BrE spelling)"],"phonetic":"/ˈdʌvˌkɑt/","extraExplanation":["“dovecot”在欧洲乡村庄园和农场里很常见，历史上既能提供肉和蛋，也能收集鸽粪作为肥料。","在文学与文化意象中，“dove/鸽子”常象征和平与温柔，因此“dovecot/鸽舍”有时也会带一点宁静、田园的氛围。"]}
{"word":"doveflower","summary":{"en":"Doveflower is a (not very common) name for a tropical ornamental plant, often the blue ginger, with violet-blue flowers.","zh":"Doveflower 是一种不太常见的英语植物名，常指蓝姜花一类热带观赏植物，开蓝紫色花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical ornamental plant (often the blue ginger, *Dichorisandra thyrsiflora*) with clusters of violet-blue flowers; also written “dove flower.”","zh":"一种热带观赏植物（常指“蓝姜花/紫花蓝姜”*Dichorisandra thyrsiflora*），开成簇的蓝紫色花；也常写作“dove flower”。"},"examples":[{"en":"The doveflower grows well in warm, humid gardens.","zh":"鸽花（doveflower）在温暖潮湿的花园里长得很好。"},{"en":"She planted doveflowers near the porch for their bright purple blooms.","zh":"她在门廊旁种了鸽花，因为它的紫色花很鲜艳。"}]}],"synonyms":["dove flower","blue ginger","Dichorisandra (thyrsiflora)"],"phonetic":"/ˈdʌvˌflaʊər/","extraExplanation":["“doveflower”并不是非常常见的日常英语词，更常见的写法是分开写作 “dove flower”。园艺语境里它常用来指 *Dichorisandra thyrsiflora*（有时也被叫作 blue ginger）。","注意不要和 “dove orchid / Holy Ghost orchid”（常指兰科 *Peristeria elata*，花形像鸽子）混淆：那种是兰花，“doveflower”通常不是指兰花。"]}
{"word":"dovefoot","summary":{"en":"Dovefoot is a common name for a small wild geranium, especially dove’s-foot geranium.","zh":"dovefoot 是一种野生老鹳草的俗名，常指“鸽脚老鹳草”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common name for a small wild geranium (often called “dove’s-foot geranium,” especially Geranium molle), named because the leaf shape can resemble a dove’s foot.","zh":"一种野生老鹳草（常指“鸽脚老鹳草”，尤指软毛老鹳草 Geranium molle）的俗名；因其叶形有时像鸽子的脚而得名。"},"examples":[{"en":"We found dovefoot growing along the path, with tiny pink flowers close to the ground.","zh":"我们在小路边发现了鸽脚老鹳草，贴着地面开着小小的粉色花。"},{"en":"The field guide lists dovefoot under wild geraniums.","zh":"那本野外图鉴把鸽脚老鹳草归在野生老鹳草一类。"}]}],"synonyms":["dove’s-foot","dove’s-foot geranium","wild geranium"],"phonetic":"/ˈdʌvˌfʊt/","extraExplanation":["“dovefoot”更常见的写法是“dove’s-foot”或带连字符的“dove’s-foot geranium”。不同地区的常用名可能指向同一类（或相近种的）老鹳草，因此在正式写作或园艺场景中，最好同时给出学名（如 Geranium molle）以避免误解。"]}
{"word":"dovehouse","summary":{"en":"A building where doves or pigeons are kept and allowed to nest.","zh":"用于饲养并让鸽子/斑鸠筑巢繁殖的鸽舍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small building (or part of a farm building) made to keep doves or pigeons, often so they can nest and be raised there; a dovecote.","zh":"饲养鸽子或斑鸠的小屋（或农舍的一部分），常用于让它们筑巢、繁殖；鸽舍。"},"examples":[{"en":"The old stone dovehouse still stands behind the farmhouse.","zh":"那座老石头鸽舍仍然立在农舍后面。"},{"en":"They restored the dovehouse and installed nesting boxes for the pigeons.","zh":"他们修复了鸽舍，并为鸽子安装了巢箱。"}]}],"synonyms":["dovecote","pigeon house","pigeon loft"],"phonetic":"/ˈdʌvˌhaʊs/","extraExplanation":["“dovehouse”在英式英语与历史语境中较常见，常与“dovecote”同义。中世纪到近代欧洲的庄园里，鸽舍不仅用于观赏，也提供肉类（鸽子肉）与蛋。","在一些历史背景中，拥有鸽舍曾被视为地位与特权的象征；相关制度在不同地区有差异。"]}
{"word":"dovekey","summary":{"en":"“Dovekey” is usually a proper name (not a common dictionary word). In some contexts it may be a misspelling of “dovekie,” a small North Atlantic seabird.","zh":"“dovekey”多见作专有名词（并非常见词典词条）。在某些语境中，它可能是“dovekie”（北大西洋的一种小型海鸟）的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard word in modern English; most often seen as a proper name (e.g., a company, product, username, or surname) rather than a common dictionary word.","zh":"现代英语中较少见或不规范的词形；最常见作专有名词（如公司名、产品名、用户名或姓氏），而不是常用词条。"},"examples":[{"en":"I couldn’t find a dictionary entry for “Dovekey,” but it appears to be a brand name online.","zh":"我在词典里找不到“Dovekey”的词条，但它在网上看起来像是一个品牌名。"},{"en":"Dovekey is the name of the app our team uses to manage passwords.","zh":"Dovekey是我们团队用来管理密码的应用名称。"}]},{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “dovekie,” a small seabird of the North Atlantic (also called the little auk).","zh":"很可能是“dovekie”的误拼：一种生活在北大西洋的小型海鸟（也叫 little auk，意为“小海雀”）。"},"examples":[{"en":"We spotted a dovekie floating near the rocky shore.","zh":"我们看到一只dovekie漂浮在多岩的海岸边。"},{"en":"In winter, dovekies can be seen farther south than usual.","zh":"冬季时，dovekie有时会出现在比平常更靠南的地方。"}]}],"synonyms":["proper name","brand name","(possible intended word) dovekie","little auk"],"phonetic":"/ˈdʌvˌkiː/","extraExplanation":["“dovekey”并不是常见标准拼写，所以理解时要看语境：\n1）如果它出现在产品、网站、账号或文件名里，多半是自创名称（把“dove（鸽子）+ key（钥匙）”组合，常带“和平/安全/开启”的联想）。\n2）如果它出现在自然、鸟类观察或海洋相关语境里，更可能是把“dovekie（小海雀）”拼错了。你可以告诉我它出现的句子，我可以帮你精准判断。"]}
{"word":"dovekeys","summary":{"en":"Dovekeys are wedge-shaped dovetail-like keys used to lock pieces of stone or wood together, often in building repair.","zh":"dovekeys 指用于连接并加固石材或木材的燕尾状楔键/锁键，常用于建筑修补。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of dovekey) A wedge-shaped key (often like a dovetail) used in stonework or woodworking to lock two pieces together, especially in masonry repairs.","zh":"（dovekey 的复数）一种楔形（常呈燕尾状）的“楔键/锁键”，用于石作或木作中把两块材料牢牢扣住在一起，常见于砌石修补与加固。"},"examples":[{"en":"The conservators inserted stainless-steel dovekeys to stabilize the cracked stone lintel.","zh":"文物修复人员嵌入不锈钢燕尾锁键，以稳定开裂的石质门楣。"},{"en":"You can sometimes see old dovekeys on historic buildings where the stone has been repaired.","zh":"在一些历史建筑上，你有时能看到旧的燕尾锁键，那些地方往往做过石材修补。"}]}],"synonyms":["dovetail key","stone key","cramp"],"phonetic":"/ˈdʌvˌkiː/","extraExplanation":["“dovekey”由 dove（鸽子/燕子）+ key（楔键/锁键）构成，指外形像“燕尾”的连接件；在石材修复中常把它嵌入切开的槽内，用来把裂开的两块石料“锁”在一起。现代工程里也可能用金属材料制作。","这个词比较专业，日常英语更常见的说法是 dovetail key 或 simply a metal/stone key（根据语境）。"]}
{"word":"dovekie","summary":{"en":"A dovekie is a small Arctic/North Atlantic seabird, also called the little auk.","zh":"dovekie 指一种北极/北大西洋的小型海鸟，也叫小海雀（little auk）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small black-and-white seabird (the little auk) that lives in the North Atlantic and Arctic, known for diving and “flying” underwater.","zh":"一种生活在北大西洋和北极地区的黑白色小型海鸟（小海雀），以潜水和在水下“飞行”般游泳而闻名。"},"examples":[{"en":"We saw a flock of dovekies bobbing on the cold water near the cliffs.","zh":"我们在悬崖附近看到一群小海雀在冰冷的海面上起起伏伏。"},{"en":"In winter, dovekies can gather in large numbers along the coast.","zh":"冬季，小海雀常会在海岸附近大量聚集。"}]}],"synonyms":["little auk","auk"],"phonetic":"/ˈdʌvki/","extraExplanation":["“Dovekie”是英语中的鸟名，常见同义名是“little auk”。它不是“dove（鸽子）”的幼鸟；名字里有“dove-”更多是历史命名习惯造成的联想。","这种鸟常出现在关于北极与北大西洋自然生态的写作中，尤其是描写寒冷海域、海鸟迁徙与极地景观的文章或纪录片。"]}
{"word":"dovekies","summary":{"en":"“Dovekies” is an informal South African term of endearment meaning “little doves,” used like “darling/sweetheart,” and more rarely can mean small doves literally.","zh":"“dovekies”是南非语境中的非正式爱称，字面“小鸽子”，相当于“亲爱的/宝贝”；较少情况下也可指字面意义上的“小鸽子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English/Afrikaans-influenced, informal) A term of endearment meaning “little dove(s),” used like “darling” or “sweetheart.”","zh":"（南非英语/受南非荷兰语影响，非正式）爱称，字面是“小鸽子”，用法相当于“亲爱的/宝贝”。"},"examples":[{"en":"Come here, dovekies—let me fix your collar.","zh":"过来呀，小鸽子（亲爱的）——我给你整理一下衣领。"},{"en":"Don’t worry, dovekies; everything will be okay.","zh":"别担心呀，亲爱的；一切都会好的。"}]},{"partOfSpeech":"n.","definition":{"en":"Small doves; little pigeons (rare, usually a literal sense).","zh":"小鸽子（较少见，多为字面意思）。"},"examples":[{"en":"We watched the dovekies pecking at seeds near the fence.","zh":"我们看着小鸽子在篱笆旁啄食种子。"}]}],"synonyms":["darling","sweetheart","dear","honey"],"phonetic":"ˈdʌvkiːz","extraExplanation":["“dovekies”常见于南非语境，带有亲昵、温柔的语气。它看起来像英语“dove（鸽子）+ -kies”，其中“-kie/-kies”也让人联想到南非荷兰语/南非语里常见的指小或昵称后缀（类似“某某小可爱/小某某”的感觉）。在其他英语地区不算常用，可能会被当作方言或个人口头禅。"]}
{"word":"dovelet","summary":{"en":"Dovelet means a young or small dove, and in literary use it can be a tender nickname meaning “little dove.”","zh":"Dovelet 指幼鸽/小鸽子；在文学语境中也可作亲昵称呼，意为“我的小鸽子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young dove; a small dove.","zh":"幼鸽；小鸽子。"},"examples":[{"en":"A dovelet fluttered near the nest, still learning to fly.","zh":"一只幼鸽在巢边扑腾着翅膀，还在学飞。"},{"en":"In the garden, we saw a dovelet following its parent.","zh":"在花园里，我们看到一只幼鸽跟着它的亲鸟。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary) a gentle term of endearment, like “little dove,” used for someone loved.","zh":"（文学/诗歌用法）亲昵称呼，类似“我的小鸽子”，用来称呼所爱之人。"},"examples":[{"en":"Come here, my dovelet, and rest a while.","zh":"过来吧，我的小鸽子，休息一会儿。"},{"en":"The poem calls the beloved a “dovelet” to suggest softness and peace.","zh":"诗中把爱人称作“dovelet”，用来表现温柔与宁静。"}]}],"synonyms":["young dove","little dove","fledgling (more general)"],"phonetic":"/ˈdʌv.lət/","extraExplanation":["“-let”是英语里常见的“小称后缀”，表示“小的/年幼的”，例如：piglet（小猪）、booklet（小册子）、streamlet（小溪）。因此 dovelet 字面意思就是“little dove（小鸽子）”。","dove 在英语文化中常象征“和平、纯洁、温柔”，所以 dovelet 在诗歌或抒情语境里常带有亲昵、柔和的感情色彩。"]}
{"word":"dovelike","summary":{"en":"Dovelike means gentle and peaceful, like a dove.","zh":"dovelike 指“像鸽子一样温柔和平的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a dove in appearance or behavior; gentle, peaceful, and mild.","zh":"像鸽子一样的；温柔、平和、温顺的。"},"examples":[{"en":"She spoke in a dovelike voice that calmed everyone down.","zh":"她用一种鸽子般温柔的声音说话，让大家都冷静下来。"},{"en":"The story contrasts the hero’s dovelike nature with the villain’s cruelty.","zh":"这个故事把主角鸽子般的温和天性与反派的残忍形成对比。"}]}],"synonyms":["dove-like","gentle","peaceful","mild","meek"],"phonetic":"/ˈdʌvˌlaɪk/","extraExplanation":["“dovelike”更常见的写法是带连字符的“dove-like”。它通常用来表达积极的评价：象征和平、温柔与不具攻击性（与“hawkish/鹰派”相对）。在政治或新闻语境中，形容政策立场温和、不主张强硬手段时也可能出现。"]}
{"word":"dovelikeness","summary":{"en":"Dovelikeness means a dove-like quality: gentle, peaceful, and innocent.","zh":"Dovelikeness 指“鸽子般的特质”，强调温柔、和平与纯真。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being like a dove; gentle, peaceful, and innocent character or appearance","zh":"像鸽子一样的特质；温柔、和平、纯真（的性格或外表）"},"examples":[{"en":"Her dovelikeness made people feel calm and safe around her.","zh":"她那种“鸽子般的温柔和平静”让人们在她身边感到安心。"},{"en":"The poet praised the child’s dovelikeness—soft voice, kind eyes, and no harsh words.","zh":"诗人称赞那孩子的“鸽子般纯真温柔”——声音轻柔、眼神善良，从不说刻薄话。"}]}],"synonyms":["gentleness","peacefulness","innocence","mildness","meekness"],"phonetic":"/ˈdʌvˌlaɪknəs/","extraExplanation":["“dove（鸽子）”在英语文化里常象征和平、温顺与纯洁，因此“dovelikeness”多用于文学、宗教或较抒情的语境，比日常说法更有诗意。","常见替代表达：gentleness（温柔）、peacefulness（平和）、innocence（纯真）、dove-like nature（鸽子般的性情）。"]}
{"word":"doveling","summary":{"en":"“Doveling” usually means doweling: joining or aligning parts by inserting dowels (common in woodworking).","zh":"“doveling”通常指“打圆榫/用木榫连接”：用圆柱形木榫钉把部件对齐并连接（常见于木工）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of joining or aligning pieces (usually wood) by inserting dowels (small round pins), or adding dowels for strength and positioning","zh":"（通常指木工中）用木榫/圆榫钉把材料对齐并连接起来的过程；通过加木榫来加强与定位"},"examples":[{"en":"Doveling helps keep the two boards aligned while the glue dries.","zh":"打木榫能在胶水干燥时帮助两块木板保持对齐。"},{"en":"We used a jig to make doveling faster and more accurate.","zh":"我们用定位夹具让打木榫更快、更精准。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “dowel”: joining or reinforcing something by inserting dowels","zh":"动词 dowel 的现在分词：用木榫/圆榫钉连接或加固"},"examples":[{"en":"He is doveling the chair legs to make the joints stronger.","zh":"他正在给椅子腿打木榫，让接合处更牢固。"},{"en":"Try doveling the pieces before you screw them together.","zh":"在上螺丝之前，试着先把部件打木榫定位。"}]}],"synonyms":["doweling","dowel jointing","pegging (in woodworking)"],"phonetic":"/ˈdaʊəlɪŋ/","extraExplanation":["“doveling”在日常英语里不算常见词，更常见的说法是“dowel joint / doweling（打圆榫）”。注意不要和“dovetailing（燕尾榫/使…相吻合）”混淆：dowel 是圆柱形木榫钉，dovetail 是燕尾形的榫卯结构。","如果你是在写作里想表达“衔接得很好/相互契合”，更常用“dovetailing”而不是“doveling”。"]}
{"word":"doven","summary":{"en":"“Doven” is a rare form meaning the past participle of “dive,” and it can also (very rarely) mean “dove-like.”","zh":"“doven”很少用：多指“dive”的过去分词（潜入/猛冲），极少情况下可表示“像鸽子的、与鸽子有关的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare or dialect) past participle of “dive” (meaning “to go down quickly into water” or “to plunge”).","zh":"（罕见/方言）“dive”的过去分词，表示“潜入（水中）/猛冲、猛扑”。"},"examples":[{"en":"He has doven into icy water before, but this time he hesitated.","zh":"他以前潜入过冰冷的水里，但这次他犹豫了。"},{"en":"The seal had doven deep and disappeared from view.","zh":"海豹已潜到很深的地方，从视线中消失了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) dove-like; relating to a dove (a symbol of peace).","zh":"（非常罕见）像鸽子的；与鸽子有关的（鸽子常象征和平）。"},"examples":[{"en":"A doven calm settled over the room after the argument.","zh":"争吵过后，房间里出现了一种鸽子般的宁静（比喻和平的氛围）。"}]}],"synonyms":["dived","plunged"],"phonetic":"/ˈdoʊvən/","extraExplanation":["“doven”在现代标准英语里很少见。表示“潜水/猛冲”的过去式和过去分词，常见的是：过去式可用 AmE 的“dove”或更通用的“dived”，过去分词通常用“dived”。因此你在写作或考试中一般用“dived”，更自然、更标准。","如果你是想查“dove”（鸽子/潜水的过去式）或“woven”（织成的），也可能是拼写接近导致的误输入。"]}
{"word":"dovened","summary":{"en":"“Dovened” is a nonstandard/dialect word, usually meaning “sleepy or sluggish,” and in some dialects it can also mean “dived.”","zh":"“dovened”多为非标准/方言用法，通常指“昏昏欲睡、无精打采”；在某些方言里也可当作 dive 的过去分词，表示“已跳入/已潜入”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard/dialect: feeling sleepy, sluggish, or not fully alert; made drowsy.","zh":"（非标准/方言）昏昏欲睡的、迟钝无力的；让人变得困倦的。"},"examples":[{"en":"After the heavy lunch, I felt dovened and could hardly focus.","zh":"吃完那顿很饱的午饭后，我感觉昏昏沉沉的，几乎无法集中注意力。"},{"en":"The warm room and quiet music left everyone dovened.","zh":"温暖的房间和安静的音乐让大家都变得昏昏欲睡。"}]},{"partOfSpeech":"other","definition":{"en":"Nonstandard/dialect: past participle form meaning “dived” (from the verb dive).","zh":"（非标准/方言）“dive（跳水/潜入）”的过去分词形式，相当于标准英语的 dived。"},"examples":[{"en":"He had doven into the river before anyone could stop him. (dialect)","zh":"还没等别人拦住他，他就已经跳进河里了。（方言用法）"},{"en":"By the time we looked over, she’d already doven under the waves. (dialect)","zh":"等我们看过去时，她已经潜到浪下面了。（方言用法）"}]}],"synonyms":["sleepy","drowsy","groggy","sluggish"],"phonetic":"/ˈdoʊvənd/","extraExplanation":["“dovened”不是现代标准英语里的常见拼写，更多见于苏格兰英语/北英格兰等方言语境，常与表示“懒散、困倦”的词族相关（如 Scots 方言里的 doven）。","如果你是在作文或正式场合写作，通常建议用更通用的词：sleepy, drowsy, groggy, sluggish；表示“跳入/潜入”的完成时则用 dived（美式写法里过去式也常见 dove，但过去分词更常用 dived）。","若你能提供原句，我可以帮你判断这里更可能是“困倦”还是“dived”的意思，或是否其实想写 dovetailed / devoured 等其他词。"]}
{"word":"dovening","summary":{"en":"“Dovening” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“dovening”不是标准英语词，通常是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a nonstandard form (you may have meant “evening,” “divining,” or “dovening” as a name).","zh":"不是标准英语单词。很可能是拼写错误或非标准用法（你可能想写“evening 晚上/傍晚”、或“divining 占卜/推测”等，或作为人名/专有名词）。"},"examples":[{"en":"I couldn’t find “dovening” in an English dictionary—did you mean “evening”?","zh":"我在英语词典里找不到“dovening”——你是不是想写“evening（晚上/傍晚）”？ "},{"en":"If you tell me the full sentence, I can guess the intended word and explain it.","zh":"如果你把完整句子发我，我可以帮你判断你想表达的词并解释用法。"}]}],"phonetic":"ˈdoʊvənɪŋ","extraExplanation":["“dovening”本身不常见于英语。最有效的办法是：把你看到它的句子/上下文贴出来，或告诉我你想表达的意思（比如“傍晚”“变深/加深”“推测/占卜”等），我就能给出准确的单词、发音与例句。"]}
{"word":"dovens","summary":{"en":"“Dozens” means groups of twelve or, more commonly, “many” (as in “dozens of”).","zh":"“dozens”表示“十二个一组（一打）”，更常见的用法是表示“很多/几十个”（dozens of）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of twelve; often used for counting items (especially eggs, baked goods, or small products).","zh":"一打；十二个为一组（常用于清点鸡蛋、烘焙食品或小件商品）。"},"examples":[{"en":"A dozen eggs costs less when you buy in bulk.","zh":"买散装时，一打鸡蛋更便宜。"},{"en":"She brought a dozen cupcakes to the party.","zh":"她带了一打纸杯蛋糕去聚会。"}]},{"partOfSpeech":"n.","definition":{"en":"Used to mean “about twelve” or “many,” especially in the plural (“dozens of”).","zh":"表示“大约十二个”或“很多”，常用复数形式“dozens of”。"},"examples":[{"en":"Dozens of people signed up for the class.","zh":"有几十个人报名参加了这门课。"},{"en":"I’ve told you a dozen times to lock the door.","zh":"我跟你说了不下十几次要锁门。"}]}],"synonyms":["many","numerous","a lot of","scores (informal/older)"],"phonetic":"/ˈdʌzənz/","extraExplanation":["“dovens”在英语里不是常见标准拼写。你可能想写的是：\n1) **dozens**（几十个/很多；或“若干打”），读音 /ˈdʌzənz/；\n2) **doves**（鸽子，dove 的复数），读音 /dʌvz/。\n如果你告诉我你想表达的句子，我可以帮你确认是哪一个。"]}
{"word":"Dover","summary":{"en":"Dover is a port town in southeast England, and it can also refer to the nearby Strait of Dover between England and France.","zh":"Dover 指英国东南部的重要港口城镇“多佛”，也可指英法之间的“多佛海峡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town and major port in Kent, southeast England, near the English Channel; known for the White Cliffs of Dover and for ferries/tunnels connecting the UK and continental Europe.","zh":"（专有名词）多佛：英国英格兰东南部肯特郡的一座城镇与重要港口，临英吉利海峡；以“多佛白崖”闻名，也是英国与欧洲大陆交通（轮渡/海底隧道）要地。"},"examples":[{"en":"We took the ferry from Dover to Calais.","zh":"我们从多佛坐轮渡去加来。"},{"en":"On a clear day, you can sometimes see France from the cliffs near Dover.","zh":"天气晴朗时，从多佛附近的白崖有时能看到法国。"},{"en":"Dover has long been an important gateway between Britain and Europe.","zh":"多佛长期以来一直是英国通往欧洲的重要门户。"}]},{"partOfSpeech":"n.","definition":{"en":"the Strait of Dover (also called the Dover Strait): the narrow part of the English Channel between England and France.","zh":"（专有名词）多佛海峡：英吉利海峡最狭窄的一段，位于英格兰与法国之间。"},"examples":[{"en":"Ships cross the Strait of Dover every day.","zh":"每天都有船只穿越多佛海峡。"},{"en":"The English Channel is widest in the west and narrowest at the Strait of Dover.","zh":"英吉利海峡西部最宽，在多佛海峡处最窄。"}]}],"synonyms":["Dover Strait","Strait of Dover","the White Cliffs of Dover"],"phonetic":"/ˈdoʊvər/","extraExplanation":["“the White Cliffs of Dover（多佛白崖）”在英国文化里常象征“家园、回归与希望”。二战时期有一首很有名的歌曲《The White Cliffs of Dover》（Vera Lynn 演唱），用白崖来表达对和平与团聚的期待。"]}
{"word":"dover","summary":{"en":"Dover is a place name, especially a famous port town in southeast England; it’s also used for several U.S. towns (including Delaware’s capital).","zh":"Dover 是地名，最常指英国东南部著名港口城镇多佛；也用于美国多个城镇（包括特拉华州首府）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coastal town in Kent, southeast England, famous for the White Cliffs of Dover and an important ferry port to France.","zh":"（英国）多佛：英格兰东南部肯特郡的海港城镇，以“多佛白崖”闻名，也是通往法国的重要渡轮港口。"},"examples":[{"en":"We took the ferry from Dover to Calais.","zh":"我们从多佛坐渡轮去加来。"},{"en":"The White Cliffs of Dover are a symbol of Britain for many people.","zh":"对很多人来说，“多佛白崖”是英国的象征之一。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of several towns and cities in the United States (notably Dover, Delaware—Delaware’s capital).","zh":"（美国）多佛：美国多地的地名（尤指特拉华州的多佛，是该州首府）。"},"examples":[{"en":"Dover is the capital of Delaware.","zh":"多佛是特拉华州的首府。"},{"en":"She moved from Boston to Dover, New Hampshire.","zh":"她从波士顿搬到了新罕布什尔州的多佛。"}]}],"synonyms":["(no direct synonyms; it is a proper noun/place name)"],"phonetic":"/ˈdoʊvər/","extraExplanation":["“Dover”在英语中通常读作 /ˈdoʊvər/。在英格兰的多佛最常与“White Cliffs of Dover（多佛白崖）”一起出现，常见于旅游、历史与文学作品中，带有“归乡、海峡对岸、战争与和平”等文化联想。"]}
{"word":"doves","summary":{"en":"“Doves” is the plural of “dove,” meaning the bird (often symbolizing peace) or, in politics, people who favor peaceful approaches.","zh":"“doves”是“dove”的复数：可指鸽子（常象征和平），也可指政治语境中的“鸽派”（主张温和与和平手段的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dove: a small bird (often white or gray) related to pigeons; it is commonly used as a symbol of peace, love, or gentleness.","zh":"鸽子（与家鸽同科的小型鸟类，常为白色或灰色）；也常被用作和平、爱情或温柔的象征。"},"examples":[{"en":"We saw two doves sitting on the roof.","zh":"我们看到两只鸽子停在屋顶上。"},{"en":"A white dove is often a symbol of peace.","zh":"白鸽常常象征和平。"},{"en":"In the story, the dove represents hope and kindness.","zh":"在故事里，鸽子象征希望与善良。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports peace and avoids war or violence (often contrasted with a “hawk”).","zh":"主张和平、反对战争或暴力的人（常与“hawk 强硬派/鹰派”相对）。"},"examples":[{"en":"In foreign policy debates, some people are doves and others are hawks.","zh":"在外交政策辩论中，有些人是鸽派，有些人是鹰派。"},{"en":"She’s known as a dove who prefers negotiation over force.","zh":"她以鸽派著称，更倾向于谈判而不是武力。"}]}],"synonyms":["pigeons (for the bird)","peace symbol (figurative)","pacifists (in some contexts)","moderates (politics, sometimes)"],"phonetic":"/dʌvz/","extraExplanation":["“dove”作为“和平的象征”在英语文化中非常常见：常见来源包括《圣经》中“诺亚方舟”的故事——鸽子衔着橄榄枝带回“洪水已退”的讯息，因此“dove + olive branch（橄榄枝）”常用来表达和平与希望。","“dove/鸽派”与“hawk/鹰派”是一组固定的政治隐喻：鸽派倾向温和、谈判与克制；鹰派倾向强硬、施压或动武。"]}
{"word":"dovetail","summary":{"en":"Dovetail means to fit together smoothly (figuratively) and also refers to a strong woodworking joint called a dovetail joint.","zh":"dovetail 可指（比喻）严密吻合、顺畅衔接；也指木工中的“燕尾榫/燕尾接合”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to fit together neatly or smoothly; to match well (plans, ideas, schedules, etc.)","zh":"（使）严密吻合；（使）顺畅衔接（计划、想法、时间安排等）"},"examples":[{"en":"Her research dovetails with our project goals.","zh":"她的研究与我们的项目目标严密吻合。"},{"en":"The training schedule dovetails nicely with the school calendar.","zh":"培训安排与学校日程衔接得很顺畅。"},{"en":"Their stories don’t dovetail, so the police kept asking questions.","zh":"他们的说法对不上，所以警方继续追问。"}]},{"partOfSpeech":"n.","definition":{"en":"a joint in woodworking shaped like a dove’s tail, used to connect two pieces of wood strongly","zh":"（木工）燕尾榫（像燕尾形的连接结构，用来牢固连接两块木头）"},"examples":[{"en":"The drawer is held together with dovetail joints.","zh":"这个抽屉用燕尾榫连接得很牢固。"},{"en":"He learned to cut a dovetail by hand in carpentry class.","zh":"他在木工课上学会了手工切燕尾榫。"}]},{"partOfSpeech":"vt.","definition":{"en":"to join or connect using a dovetail joint","zh":"用燕尾榫把……连接起来"},"examples":[{"en":"The carpenter dovetailed the sides of the box.","zh":"木工用燕尾榫把盒子的侧板连接起来。"}]}],"synonyms":["fit","match","align","mesh","interlock","coordinate"],"phonetic":"/ˈdʌvˌteɪl/","extraExplanation":["“dovetail”最初来自木工：燕尾榫的形状像鸟类（常译作“燕子/鸽子”）的尾巴，特点是越拉越紧，不容易松脱。因此在现代英语里常用来比喻“严丝合缝地配合、衔接”。","常见搭配：dovetail with（与……吻合/配合）；dovetail into（顺势并入/衔接到……中）。","在写作或新闻中，“dovetail”常用于强调两件事之间的协调或相互印证，比普通的 match / fit 更有“无缝衔接”的感觉。"]}
{"word":"dovetailed","summary":{"en":"“Dovetailed” means joined or fitted together smoothly and securely, or well-matched and coordinated.","zh":"“dovetailed”表示（把事物）巧妙严密地衔接/结合在一起，也可形容彼此很契合、很协调。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “dovetail”) to join or fit two things together neatly and securely, often so they work well as a whole.","zh":"（dovetail 的过去式/过去分词）使两者严密、巧妙地衔接或结合在一起，通常指配合得很好。"},"examples":[{"en":"The new training plan dovetailed with our busy schedule.","zh":"新的培训计划和我们繁忙的日程安排衔接得很好。"},{"en":"Her research dovetailed nicely with the team’s goals.","zh":"她的研究与团队目标配合得很契合。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fitted or joined together closely and smoothly; well-matched or well-coordinated.","zh":"（形容词）紧密嵌合的；严密吻合的；协调一致的。"},"examples":[{"en":"The dovetailed pieces formed a strong frame.","zh":"这些嵌合的部件组成了一个结实的框架。"},{"en":"Their dovetailed schedules made collaboration easy.","zh":"他们协调一致的日程让合作变得很顺畅。"}]}],"synonyms":["fit together","interlock","mesh","integrate","align","coordinate"],"phonetic":"/ˈdʌvˌteɪld/","extraExplanation":["“dovetail”原本是木工术语，指“燕尾榫”（形状像燕子的尾巴），用来把两块木头牢牢咬合在一起。后来引申为计划、想法、时间安排等“无缝衔接、彼此契合”。","常见搭配：dovetail with（与……契合/衔接）；dovetail into（顺势融入/并入某事）。"]}
{"word":"dovetailer","summary":{"en":"A dovetailer is a person who makes dovetail joints in woodworking, or (figuratively) someone/something that fits plans or ideas together neatly.","zh":"dovetailer 指制作燕尾榫的木工；也可比喻为把计划、想法等巧妙衔接起来的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes dovetail joints in woodworking (a craftsperson skilled in fitting interlocking joints, often for drawers and fine furniture).","zh":"（木工）制作燕尾榫（燕尾接合）的人；擅长用燕尾榫拼接抽屉、家具等的工匠。"},"examples":[{"en":"The dovetailer cut the pins and tails by hand for the drawer corners.","zh":"这位做燕尾榫的木工手工切出了抽屉角上的榫头和榫尾。"},{"en":"We hired an experienced dovetailer to restore the antique cabinet.","zh":"我们请了一位经验丰富的燕尾榫工匠来修复这只古董柜子。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone or something that neatly fits ideas, tasks, or plans together (figurative).","zh":"（比喻）把想法、任务或计划巧妙衔接起来的人或事物。"},"examples":[{"en":"She’s a natural dovetailer—she connects teams and timelines so projects run smoothly.","zh":"她很会“衔接”工作——把团队与时间表串起来，让项目顺畅推进。"},{"en":"Their research acts as a dovetailer between theory and real-world practice.","zh":"他们的研究像“连接器”，把理论与现实实践衔接起来。"}]}],"synonyms":["woodworker","cabinetmaker","joiner","craftsperson","integrator","connector"],"phonetic":"/ˈdʌvˌteɪlər/","extraExplanation":["“dovetailer”来自木工术语 dovetail（燕尾榫）。燕尾榫因形状像燕子的尾巴而得名，结构互相卡扣，牢固耐用，常见于抽屉角、箱体连接等。","在日常英语里更常用 dovetail 作动词（to dovetail: 使……吻合/衔接）或名词（dovetail joint: 燕尾榫接合）。“dovetailer”作为名词不算高频，更多出现在木工语境或比喻写法中。"]}
{"word":"dovetailing","summary":{"en":"Dovetailing means fitting together neatly or coordinating well; it can also refer to the dovetail joint used in woodworking.","zh":"dovetailing 指严密契合、协调衔接；也可指木工中的燕尾榫接合。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"fitting or joining together neatly; coordinating so parts match well (often used about plans, schedules, or ideas).","zh":"（使）严密契合、无缝衔接；（使）协调配合（常指计划、时间表或想法等）。"},"examples":[{"en":"Our marketing plan is dovetailing with the product launch schedule.","zh":"我们的营销计划正与产品发布的时间表紧密衔接。"},{"en":"Her research dovetailed with the team’s goals, so collaboration was easy.","zh":"她的研究与团队目标高度契合，所以合作很顺利。"}]},{"partOfSpeech":"n.","definition":{"en":"a woodworking joint shaped so two pieces interlock firmly (a “dovetail joint”).","zh":"燕尾榫；一种木工接合方式，通过“燕尾”形结构让两块木料牢固咬合。"},"examples":[{"en":"The drawer is held together with dovetailing, so it’s very sturdy.","zh":"这个抽屉用燕尾榫接合，所以非常结实。"},{"en":"You can see the dovetailing at the corners of the box.","zh":"你可以看到盒子角上的燕尾榫接合。"}]}],"synonyms":["fitting together","aligning","meshing","integrating","interlocking"],"phonetic":"/ˈdʌvˌteɪlɪŋ/","extraExplanation":["“dovetail”原本指木工里的“燕尾榫”，形状像鸽子/燕子的尾巴，越拉越紧，因此很牢固。后来引申到日常英语里，用来形容两件事“配合得刚刚好、衔接得很顺”。","在写作里常见搭配：dovetail with（与……衔接/吻合）；dovetail into（顺势并入/融入）。例如：The new policy dovetails with existing rules（新政策与现有规则相吻合）。"]}
{"word":"dovetails","summary":{"en":"“Dovetails” can mean strong wedge-shaped woodworking joints, or (as a verb) things that fit together smoothly and match well.","zh":"“dovetails”可指木工中的牢固燕尾榫/鸠尾榫，也可作动词表示（计划、想法等）严密配合、顺畅衔接。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Woodworking) a type of joint where wedge-shaped “tails” fit into matching “pins,” making a strong connection; often used in drawers and fine furniture.","zh":"（木工）鸠尾榫/燕尾榫：一种榫接结构，楔形“榫舌（尾）”嵌入对应的“榫眼（针）”，连接牢固，常见于抽屉和精细家具。"},"examples":[{"en":"The carpenter used dovetails to make the drawer corners strong.","zh":"木匠用鸠尾榫让抽屉的角更结实。"},{"en":"You can see clean dovetails in high-quality furniture.","zh":"高品质家具上常能看到工整的鸠尾榫。"}]},{"partOfSpeech":"v.","definition":{"en":"To fit together neatly or combine smoothly, especially so that two plans, ideas, or pieces of work match well.","zh":"（使）严丝合缝地配合；（使）顺畅衔接（尤指计划、想法或工作彼此吻合）。"},"examples":[{"en":"Her research dovetails with our project goals.","zh":"她的研究与我们的项目目标高度契合。"},{"en":"The two schedules dovetail nicely, so we can meet every Friday.","zh":"两个时间表衔接得很好，所以我们每周五都能见面。"},{"en":"We need to dovetail the marketing plan with the product launch.","zh":"我们需要让市场计划与产品发布衔接起来。"}]}],"synonyms":["fit together","mesh","interlock","align","match","integrate"],"phonetic":"/ˈdʌvteɪl/","extraExplanation":["“dovetail”原指木工里的“燕尾榫/鸠尾榫”，形状像鸽子（dove）的尾巴。因为这种结构咬合紧密、很牢固，所以引申为抽象意义上的“（计划/观点/工作）严密配合、顺畅衔接”。","形式上你输入的是复数或动词第三人称单数“dovetails”。常见搭配：dovetail with（与……吻合/衔接）。"]}
{"word":"dovetailwise","summary":{"en":"“Dovetailwise” means “in the dovetail-joint way,” describing an interlocking, tapering fit.","zh":"“dovetailwise”指“以燕尾榫式的方式”，形容像燕尾接合那样逐渐收窄并相互咬合的连接。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that resembles a dovetail joint; interlocking by tapering like a dovetail (often used in woodworking or technical description).","zh":"以“燕尾榫/燕尾接合”的方式；像燕尾一样逐渐收窄并相互咬合地连接（常用于木工或技术描述）。"},"examples":[{"en":"The two boards were cut dovetailwise so they would lock together without nails.","zh":"这两块木板被切成燕尾式的形状，这样不用钉子也能牢牢咬合在一起。"},{"en":"Fit the pieces dovetailwise to prevent the joint from pulling apart.","zh":"把部件以燕尾式嵌合起来，防止接缝被拉开。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or arranged in the manner of a dovetail joint.","zh":"与燕尾接合有关的；以燕尾接合方式排列/连接的。"},"examples":[{"en":"A dovetailwise groove was carved along the edge for a tighter fit.","zh":"沿着边缘刻出燕尾式槽口，以便更紧密地贴合。"},{"en":"They used a dovetailwise design for the drawer corners.","zh":"他们在抽屉的角部采用了燕尾式结构。"}]}],"synonyms":["in a dovetail manner","interlockingly","dovetailed"],"phonetic":"/ˈdʌvˌteɪlˌwaɪz/","extraExplanation":["“dovetail（燕尾榫）”原本是木工里一种非常牢固的连接方式：形状像燕子的尾巴，越拉越紧，所以常用来做抽屉、箱体等。","“dovetailwise”比较少见，更多时候人们会说 “in a dovetail manner/shape” 或直接用 “dovetail” 作动词（如：The parts dovetail nicely.）。"]}
{"word":"Dovev","summary":{"en":"“Dove” usually means a dove (a peace symbol) or the past tense of “dive.”","zh":"“dove” 通常表示“鸽子（和平象征）”，也可作动词，表示 “dive” 的过去式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bird (often white) that is a symbol of peace and love","zh":"鸽子（常指白鸽），常被用作“和平、爱”的象征"},"examples":[{"en":"A white dove is often used as a symbol of peace.","zh":"白鸽常被用作和平的象征。"},{"en":"They released doves at the wedding.","zh":"他们在婚礼上放飞了鸽子。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense of “dive” (to go down quickly; to jump into water)","zh":"“dive”的过去式：迅速下冲；跳入水中"},"examples":[{"en":"He dove into the pool without thinking.","zh":"他想都没想就跳进了泳池。"},{"en":"The plane dove through the clouds.","zh":"飞机俯冲穿过云层。"}]}],"synonyms":["pigeon (general term, not always symbolic)","plunge (as a verb meaning “dive”)"],"phonetic":"/dʌv/","extraExplanation":["你输入的 “Dovev” 在英语里不常见，可能是拼写错误。最可能是 “dove”（名词：鸽子；动词：dive 的过去式）。如果你想查的是别的词（比如人名/品牌/特定语境），可以告诉我句子或上下文。"]}
{"word":"doveweed","summary":{"en":"Doveweed is a warm-weather lawn weed that spreads in moist areas and has small blue-purple flowers.","zh":"Doveweed是一种喜湿热、会在草坪潮湿处蔓延的杂草，常开小型蓝紫色花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low-growing weed with small blue-to-purple flowers, commonly found in warm, moist lawns and gardens (often identified as *Murdannia nudiflora*)","zh":"一种匍匐生长的杂草，开小型蓝紫色花，常见于温暖潮湿的草坪和花园（常指“裸花水竹草”*Murdannia nudiflora*）"},"examples":[{"en":"Doveweed spread quickly across the wet part of the lawn after a rainy summer.","zh":"一个多雨的夏天过后，草坪里潮湿的那一片很快就长满了doveweed。"},{"en":"The gardener pulled doveweed by hand before it could take over the flower bed.","zh":"园丁趁doveweed还没蔓延到花坛前就用手把它拔掉了。"}]}],"synonyms":["dove weed","Murdannia nudiflora"],"phonetic":"/ˈdʌvˌwiːd/","extraExplanation":["doveweed在美国东南部的草坪护理语境里很常见，通常指一种喜湿热、贴地蔓生的杂草；因为叶片与生长习性有时会像“crabgrass（马唐）”那样铺开，所以容易被初学者误认。","词形上也会写作dove weed（分开写），但在草坪与园艺资料中更常见合写doveweed。","学名常见对应*Murdannia nudiflora*（鸭跖草科）；不同地区对“doveweed”的指称可能略有差异，最好结合当地园艺资料或照片确认。"]}
{"word":"dovewood","summary":{"en":"Dovewood is a tropical tree name, especially for Bourreria succulenta, noted for very hard wood.","zh":"Dovewood 指一种热带树（常指 *Bourreria succulenta*），以木质坚硬著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tropical tree (especially Bourreria succulenta, found in Florida and the Caribbean) known for its very hard, heavy wood.","zh":"（尤指多见于佛罗里达和加勒比地区的）一种热带小乔木（如 *Bourreria succulenta*），以木材坚硬、密度高著称。"},"examples":[{"en":"Dovewood is valued for its extremely tough wood.","zh":"Dovewood 因其非常坚硬的木材而受到重视。"},{"en":"In South Florida, dovewood grows in coastal hammocks.","zh":"在南佛罗里达，dovewood 常生长在沿海林地里。"}]}],"synonyms":["strongbark","Bourreria succulenta"],"phonetic":"/ˈdʌvˌwʊd/","extraExplanation":["“dovewood”是一个常见名（common name），在不同地区可能指不同树种；在英语植物学语境中常用来指 *Bourreria succulenta*（也常被叫作 strongbark）。","词形上由 dove（鸽子）+ wood（木材）构成，但名称并不一定表示与鸽子有直接关系，更多是地方性命名传统。"]}
{"word":"dovey","summary":{"en":"Dovey most commonly means gentle, peaceful, and innocent (like a dove). It can also be a person’s name.","zh":"dovey常指“温柔、和平、纯真（像鸽子一样）”；也可作人名/昵称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Gentle, peaceful, and innocent in a way that suggests a dove.","zh":"（非正式）温柔、和平、纯真的；有“像鸽子一样温顺/象征和平”的感觉。"},"examples":[{"en":"She has a dovey voice that makes everyone feel calm.","zh":"她的声音很温柔，让人感到平静。"},{"en":"The movie’s ending is a bit dovey, but I still liked it.","zh":"这部电影的结局有点过于“温情和平”，但我还是喜欢。"},{"en":"He tried to look dovey in the apology video.","zh":"他在道歉视频里努力表现得很温和无害。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or nickname (usually feminine).","zh":"人名/昵称（多为女性名）。"},"examples":[{"en":"Dovey moved to Chicago after college.","zh":"Dovey大学毕业后搬去了芝加哥。"}]}],"synonyms":["gentle","peaceful","soft","innocent","tender"],"phonetic":"/ˈdoʊvi/","extraExplanation":["“dovey”来自“dove（鸽子）”。在英语文化里，鸽子常象征和平、温柔与纯洁（如“olive branch and dove”）。因此“dovey”常用来形容一个人或氛围“过于温情、过于无害/和平”，有时带一点轻微调侃。"]}
{"word":"dovish","summary":{"en":"Dovish means peace-leaning or less aggressive; in economics it means favoring lower rates and looser policy.","zh":"dovish 指偏向和平、不强硬；在经济语境中指偏向降息与宽松政策（偏鸽派）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Favoring peace, negotiation, and avoiding the use of force; not aggressive.","zh":"主张和平、协商解决问题；反对使用武力的；不强硬的。"},"examples":[{"en":"Some voters prefer a dovish foreign policy that focuses on diplomacy.","zh":"一些选民更喜欢以外交为主、强调协商的温和外交政策。"},{"en":"He sounded dovish during the debate, calling for talks instead of threats.","zh":"他在辩论中语气很温和，主张对话而不是威胁。"}]},{"partOfSpeech":"adj.","definition":{"en":"In economics (especially central banking), favoring lower interest rates and easier monetary policy to support growth and jobs, even if inflation risk is higher.","zh":"（经济/央行语境）偏向降息与宽松货币政策以支持增长和就业，即使通胀风险可能更高。"},"examples":[{"en":"The new central bank governor is seen as dovish on interest rates.","zh":"新任央行行长被视为在利率问题上偏“鸽派”。"},{"en":"Dovish comments from the Fed pushed markets higher.","zh":"美联储偏鸽的表态推动市场走高。"},{"en":"Investors expected a dovish shift after inflation began to cool.","zh":"在通胀开始降温后，投资者预期政策会转向更鸽派。"}]}],"synonyms":["peaceful","conciliatory","nonaggressive","soft-line","pacific","accommodative"],"phonetic":"/ˈdoʊvɪʃ/","extraExplanation":["“dovish”来自“dove（鸽子）”，在英语文化中鸽子常象征和平；相对的词是“hawkish（鹰派的）”，指更强硬、倾向使用武力或加息抗通胀。","在新闻与政策讨论里，“dovish/hawkish”常用来描述“立场”或“语气（tone）”，例如：a dovish stance / a hawkish tone。"]}
{"word":"dovishness","summary":{"en":"Dovishness means a peaceful, non-aggressive stance, especially in politics; in economics it often means favoring easier monetary policy (lower rates).","zh":"Dovishness 指主张和平、温和、不强硬的立场；在经济语境中常指偏向宽松货币政策（如较低利率）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tendency to support peaceful solutions and avoid war, violence, or harsh conflict; the opposite of being hawkish","zh":"（在战争、外交或冲突问题上）主张温和与和平解决、反对强硬对抗的倾向；与 hawkishness（鹰派倾向）相对"},"examples":[{"en":"Her dovishness made her argue for negotiation instead of military action.","zh":"她的鸽派立场让她主张谈判，而不是军事行动。"},{"en":"The party showed more dovishness in its foreign policy this year.","zh":"该党今年在外交政策上表现得更温和、更偏和平路线。"}]},{"partOfSpeech":"n.","definition":{"en":"in economics, a preference for lower interest rates and policies that support growth and jobs, even if inflation may rise","zh":"（经济/央行语境）偏向降息或宽松政策、支持增长与就业，即使可能带来更高通胀的立场"},"examples":[{"en":"Investors expected dovishness from the central bank after the weak jobs report.","zh":"在疲弱的就业报告之后，投资者预期央行会偏鸽派、采取更宽松的立场。"},{"en":"His dovishness on rates pushed the committee toward a smaller hike.","zh":"他在利率问题上的鸽派态度使委员会倾向于更小幅度加息。"}]}],"synonyms":["moderation","conciliatoriness","pacifism","softness","leniency"],"phonetic":"/ˈdoʊvɪʃnəs/","extraExplanation":["“dovishness”来自“dove（鸽子）”，在英语文化里鸽子常象征和平；因此“dove/dovish”用来形容主和、温和的立场。相对的“hawk（鹰）/hawkishness”常指更强硬、倾向对抗的立场。","在财经新闻中，“dovish”（鸽派）常与“hawkish”（鹰派）成对出现：鸽派=更可能降息/放缓加息/维持宽松；鹰派=更可能加息/收紧政策以压通胀。"]}
{"word":"Dovray","summary":{"en":"“Dovray” isn’t a standard English word; it’s usually a name/username or a misspelling of Italian “dovrai” (“you will have to / you’ll need to”).","zh":"“Dovray”不是标准英语词；通常是人名/用户名，或意大利语“dovrai”（“你将不得不/你需要……”）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a name/username or a misspelling of a foreign word.","zh":"不是标准英语词；最常见于人名/用户名，或是外语词的误拼。"},"examples":[{"en":"I couldn’t find “Dovray” in an English dictionary—do you mean a name or a word?","zh":"我在英语词典里找不到“Dovray”，你指的是人名还是一个词？"},{"en":"“Dovray” appears to be a username rather than a common English word.","zh":"“Dovray”看起来更像是用户名，而不是常见英语词。"}]},{"partOfSpeech":"other","definition":{"en":"(Likely) A misspelling/variant of Italian “dovrai,” meaning “you will have to” / “you’ll need to.”","zh":"（很可能）意大利语“dovrai”的误拼/变体，意思是“你将不得不/你需要……”。"},"examples":[{"en":"Italian: Domani dovrai studiare. (You’ll have to study tomorrow.)","zh":"意大利语：Domani dovrai studiare.（你明天得学习。）"},{"en":"If you meant Italian “dovrai,” it’s used to say someone must do something in the future.","zh":"如果你指的是意大利语“dovrai”，它用来表达将来“必须/得”做某事。"}]}],"synonyms":["(if Italian “dovrai”) will have to","need to","must"],"phonetic":"/doʊˈvreɪ/","extraExplanation":["“Dovray”不是常见英文单词，所以最需要的是上下文：你是在歌曲/小说/游戏里看到的，还是某个人名？","如果你想查的是意大利语，正确拼法很可能是“dovrai”（你将不得不/你得……）。如果你把出现它的整句发我，我可以更准确判断。"]}
{"word":"Dovyalis","summary":{"en":"Dovyalis is a plant genus; some species produce edible fruit such as the kei apple.","zh":"Dovyalis 是一个植物属名；其中一些物种会结可食用果实，如开伊苹果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus (group) of thorny shrubs or small trees, native mainly to Africa and nearby regions, some of which bear edible fruit (for example, the kei apple).","zh":"刺灌木或小乔木的一属（植物分类中的“属”），主要原产于非洲及其附近地区；其中一些种会结可食用果实（例如开伊苹果/凯伊苹果）。"},"examples":[{"en":"The kei apple is a fruit from a plant in the genus Dovyalis.","zh":"开伊苹果是一种来自 Dovyalis（多维亚利斯属）植物的果实。"},{"en":"In some gardens, Dovyalis is planted as a thorny hedge for security.","zh":"在一些花园里，人们会把 Dovyalis 种成带刺的树篱，用来增加安全性。"}]}],"synonyms":["kei apple (for Dovyalis caffra)"],"phonetic":"/doʊˈvaɪəlɪs/","extraExplanation":["Dovyalis 是拉丁化的植物学名称，常见于学术文章、植物名录和园艺资料中；日常英语里更常用具体物种名（如 kei apple / Dovyalis caffra）。","作为“属名”，Dovyalis 通常首字母大写并用斜体书写（Dovyalis）；如果指该属中的某个物种，还会出现双名法（属名 + 种加词），例如 Dovyalis caffra。"]}
{"word":"dovyalis","summary":{"en":"Dovyalis is a botanical genus; some species (like the kei apple) are grown for fruit or used as thorny hedges.","zh":"Dovyalis是一个植物属名；部分物种（如凯伊苹果）可产果或用作带刺绿篱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of thorny shrubs or small trees in the willow family (Salicaceae), native mainly to Africa and parts of Asia; some species are grown for their edible fruit (for example, the kei apple).","zh":"【植物】刺灌木或小乔木的一属（柳科/杨柳科体系中常归入Salicaceae），主要原产于非洲及亚洲部分地区；其中一些种可结果食用（如“凯伊苹果/Kei apple”）。"},"examples":[{"en":"The kei apple is a fruit from a species of Dovyalis.","zh":"“凯伊苹果”（kei apple）来自Dovyalis属的某个物种。"},{"en":"In dry regions, some Dovyalis plants are used as thorny hedges.","zh":"在干旱地区，有些Dovyalis植物会被用作带刺的绿篱。"}]}],"synonyms":["(no true synonym; it is a scientific genus name)"],"phonetic":"doʊˈvaɪ.ə.lɪs","extraExplanation":["“Dovyalis”通常是拉丁学名（属名），在日常英语里多出现在园艺、植物学或果树资料中。","常见相关词：kei apple（凯伊苹果，通常指Dovyalis caffra的果实）、genus（属）、species（种）。"]}
{"word":"Dovzhenko","summary":{"en":"Dovzhenko is the surname of a famous Ukrainian filmmaker, Oleksandr Dovzhenko, known especially for the film \"Earth\" and for poetic, lyrical cinema.","zh":"Dovzhenko 指乌克兰著名电影人亚历山大·杜甫仁科，以《大地》及其诗意、抒情的电影风格闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Oleksandr (Alexander) Dovzhenko (1894–1956), a Ukrainian film director, screenwriter, and author, best known as a pioneer of poetic cinema and for the silent film \"Earth\" (1930).","zh":"亚历山大·杜甫仁科（1894–1956），乌克兰电影导演、编剧与作家，以“诗意电影”先驱之一著称，代表作是无声电影《大地》（1930）。"},"examples":[{"en":"In film class, we studied Dovzhenko’s \"Earth\" as a landmark of Soviet-era cinema.","zh":"在电影课上，我们学习了杜甫仁科的《大地》，把它视为苏联时期电影的里程碑。"},{"en":"Dovzhenko’s images often feel lyrical, like poetry on screen.","zh":"杜甫仁科的画面常常带有抒情感，像把诗写在银幕上。"}]}],"synonyms":["Oleksandr Dovzhenko","Alexander Dovzhenko"],"phonetic":"/doʊvˈʒɛŋkoʊ/","extraExplanation":["“Dovzhenko”是姓氏，英语里常用来指这位导演本人或他的作品与风格。中文也常译作“杜甫仁科”。","杜甫仁科常与苏联蒙太奇电影传统并提，但他的风格更强调自然意象、情感与象征（因此常被归为“诗意电影”）。","乌克兰有以他命名的机构与荣誉（如基辅的杜甫仁科电影制片厂），在乌克兰电影史上地位很高。"]}

