{"word":"dox","summary":{"en":"“Dox” means to expose (or gather) someone’s private personal information online, often to harass or intimidate them.","zh":"“dox”指在网上曝光（或搜集）他人的隐私个人信息，常带有骚扰或威胁目的。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to publicly reveal someone’s private personal information online (such as their real name, address, workplace, or phone number), usually to harass or intimidate them","zh":"在网上公开披露他人的私人个人信息（如真名、住址、工作单位、电话等），通常带有骚扰或威胁目的"},"examples":[{"en":"Someone threatened to dox the journalist after the article was published.","zh":"文章发表后，有人威胁要“人肉”那位记者。"},{"en":"Don’t post screenshots that could dox a classmate—blur names and addresses.","zh":"别发可能会“人肉”同学的截图——把姓名和地址打码。"},{"en":"The platform removed the post because it contained doxing information.","zh":"平台删除了那条帖子，因为其中包含“人肉”信息。"}]},{"partOfSpeech":"vt.","definition":{"en":"to find out and compile someone’s private details (even if you don’t post them)","zh":"查出并整理某人的隐私信息（即使不公开发布）"},"examples":[{"en":"They tried to dox the gamer by digging through old accounts.","zh":"他们翻找旧账号，试图查出那位玩家的隐私信息。"},{"en":"It’s not okay to dox people just because you disagree with them online.","zh":"仅仅因为在网上意见不同就去“人肉”别人是不对的。"}]}],"synonyms":["expose someone’s personal information","reveal private details","out (someone)","leak personal info"],"phonetic":"/dɑks/","extraExplanation":["“dox”源自“docs/documents（文件）”，最早指把他人的“资料/档案”曝光；在网络语境里常与网暴、骚扰相关，属于严重的隐私侵犯。","常见写法有“dox / doxx”，意思相同；法律与平台规则通常禁止发布可识别个人身份的信息（如地址、电话、证件号等）。"]}
{"word":"doxa","summary":{"en":"Doxa means common opinion; in philosophy, it’s accepted belief (opinion) contrasted with true knowledge.","zh":"Doxa 指大众的普遍看法；在哲学中指被接受的“意见/信念”，常与“真知/知识”相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Common belief or popular opinion (often contrasted with expert knowledge or truth).","zh":"普遍看法；大众意见（常与专业知识或真理相对）。"},"examples":[{"en":"In many cultures, the doxa is that hard work always leads to success.","zh":"在许多文化中，一种普遍看法是：努力工作总会带来成功。"},{"en":"The scientist challenged the doxa with new data.","zh":"这位科学家用新数据挑战了大众的成见。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy (especially ancient Greek thought), accepted belief or opinion, sometimes meaning what people think is true without proof; contrasted with knowledge.","zh":"（哲学，尤指古希腊思想）被接受的信念或意见；有时指未经理性证明而被当作真实的看法；与“知识/真知”相对。"},"examples":[{"en":"Plato often contrasts doxa (opinion) with episteme (knowledge).","zh":"柏拉图常把 doxa（意见）与 episteme（知识/真知）作对比。"},{"en":"The essay explores how doxa shapes what a society treats as ‘normal.’","zh":"这篇文章探讨了大众意见如何塑造社会所认为的“正常”。"}]}],"synonyms":["opinion","common belief","conventional wisdom","received idea","orthodoxy"],"phonetic":"/ˈdɑk.sə/","extraExplanation":["词源：doxa 来自古希腊语，原意与“看起来、显得”相关，因此带有“看上去如此/人们以为如此”的意味。","学术语境：在修辞学与文化研究里，doxa 常指“无需解释就被默认的观念”（例如刻板印象、常识叙事）。它不一定是错的，但通常是未被检验的。","相关对比：doxa（意见/常识）常与 episteme（知识/真知）对立；也可与 orthodoxy（正统观念）、paradox（悖论）一起讨论。"]}
{"word":"Doxantha","summary":{"en":"Doxantha is an older botanical genus name, most often linked to the vine once called Doxantha unguis-cati (cat’s claw creeper).","zh":"Doxantha 是较旧的植物学属名，常与曾名为 Doxantha unguis-cati 的藤本植物“猫爪藤/猫爪蔓”相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a former scientific genus name for a tropical climbing vine (now usually classified as Dolichandra), especially the plant once called Doxantha unguis-cati (“cat’s claw creeper”).","zh":"一个旧的植物学属名（现多归入 Dolichandra 属），尤指曾被称为 Doxantha unguis-cati 的热带攀援藤本植物“猫爪藤/猫爪蔓”。"},"examples":[{"en":"In older horticulture books, you may see the cat’s claw creeper listed as Doxantha unguis-cati.","zh":"在较旧的园艺书里，你可能会看到“猫爪藤”被写作 Doxantha unguis-cati。"},{"en":"The genus name Doxantha is mostly historical; many sources now use Dolichandra instead.","zh":"Doxantha 这个属名主要属于历史用法；许多资料现在改用 Dolichandra。"}]}],"synonyms":["Dolichandra (modern classification in many sources)"],"phonetic":"/doʊkˈsænθə/","extraExplanation":["“Doxantha”多见于植物学/园艺学的旧文献，是拉丁化的学名（属名）。随着分类学研究更新，这个属名在很多系统中被并入或改用为 Dolichandra，因此现代资料里不一定还用它。","如果你是在小说、人名、品牌或游戏里看到 Doxantha，它也可能是专有名词（名字/设定词）。若你能提供上下文句子，我可以更准确判断含义与用法。"]}
{"word":"doxantha","summary":{"en":"Doxantha is an older botanical genus name, especially linked to the vine now commonly called cat’s claw creeper (Dolichandra unguis-cati).","zh":"Doxantha 是一个较旧的植物属名，常与如今称为“猫爪藤/猫爪蔓”的藤本植物（Dolichandra unguis-cati）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for a type of tropical climbing vine in the trumpet-vine family (Bignoniaceae), especially the plant now widely called cat’s claw creeper (currently usually classified as Dolichandra unguis-cati).","zh":"（植物学）一个旧的属名，指紫葳科的一种热带攀援藤本植物，尤指如今常称“猫爪藤/猫爪蔓”的植物（现多归入属名 Dolichandra，学名 Dolichandra unguis-cati）。"},"examples":[{"en":"In older gardening books, you may see cat’s claw creeper listed under the genus Doxantha.","zh":"在较早的园艺书里，你可能会看到“猫爪藤”被列在属名 Doxantha 之下。"},{"en":"The plant once called Doxantha unguis-cati is now commonly treated as Dolichandra unguis-cati.","zh":"过去叫 Doxantha unguis-cati 的植物，如今通常归为 Dolichandra unguis-cati。"}]}],"synonyms":["Dolichandra (current genus in many sources)","cat’s claw creeper (common name)"],"phonetic":"/doʊkˈsænθə/","extraExplanation":["“Doxantha”在现代英语里非常少见，主要出现在旧的植物分类、园艺资料或学术引用中。现在更常用的分类是把它并入其他属（如 Dolichandra），所以在新资料里不一定查得到。","如果你是在阅读某本书或看到某个标签上的拼写（例如 DoxanthA / DoxanthE / Doxantha），也可能是拼写误差；给我上下文（句子或图片）我可以帮你确认具体指什么。"]}
{"word":"doxastic","summary":{"en":"Doxastic means “related to beliefs,” mainly used in academic contexts like philosophy and logic.","zh":"doxastic 指“与信念有关”，主要用于哲学、逻辑等学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to beliefs (what someone believes), especially in philosophy or logic","zh":"（尤指哲学/逻辑中）与“信念、相信的内容”有关的"},"examples":[{"en":"In philosophy, doxastic attitudes include believing, doubting, and suspending judgment.","zh":"在哲学中，doxastic 态度包括相信、怀疑，以及暂缓判断。"},{"en":"The professor distinguished doxastic reasons (about beliefs) from practical reasons (about actions).","zh":"教授区分了 doxastic 理由（关于信念）和 practical 理由（关于行动）。"}]}],"synonyms":["belief-related","epistemic (related, but not identical)"],"phonetic":"/dɑkˈstæstɪk/","extraExplanation":["“doxastic”来自希腊语 doxa，意为“观点、信念”。它多用于学术语境（哲学、认知科学、形式逻辑），日常英语里不常用。","在哲学里常见搭配：doxastic attitude（信念态度）、doxastic logic（信念逻辑）、doxastic state（信念状态）。它强调的是“信不信/信什么”，而不是“知识”（knowledge）或“事实”（fact）。"]}
{"word":"doxasticon","summary":{"en":"A specialized Eastern Orthodox hymn book containing doxastika.","zh":"东正教礼仪中收录 doxastika（赞荣圣歌）的一种专门圣歌/礼书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a liturgical hymn book in the Eastern Orthodox tradition that contains doxastika (hymns sung after “Glory… both now…”), used especially at Vespers and Matins","zh":"（东正教礼仪用）“荣光颂集/赞荣颂集”，收录 doxastika（常接在“愿荣耀归于……今时直到永远……”之后所唱的赞美圣三的圣歌），多用于晚祷与晨祷"},"examples":[{"en":"The choir consulted the doxasticon to find the hymn appointed for the feast day.","zh":"圣歌队查阅了 doxasticon，以找到节日规定要唱的那首赞美诗。"},{"en":"In some monasteries, the doxasticon is kept near the other service books for Vespers.","zh":"在一些修道院里，doxasticon 会和其他晚祷礼书放在一起。"}]}],"synonyms":["Orthodox hymn book","liturgical hymnbook","service book (Orthodox)"],"phonetic":"/ˌdɑk.səˈstɪk.ən/","extraExplanation":["词源上与希腊语 doxa（“荣耀”）相关；doxasticon 这个词主要出现在东正教/拜占庭礼仪的语境里，属于比较专门的宗教音乐与礼书术语。","doxastika 指一类特定位置与形式的圣歌（常在一组诗节后唱“Glory… both now…”时出现），因此 doxasticon 可以理解为“收录这类圣歌的专门歌册/礼书”。"]}
{"word":"Doxia","summary":{"en":"Doxia means common opinion or belief (especially in philosophy), and less commonly “glory/praise” in religious or literary use.","zh":"Doxia 指“普遍的意见/信念”（尤见于哲学语境）；较少见时也可指宗教或文学中的“荣耀/赞美”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy) Common belief or opinion—what people think is true, often contrasted with certain knowledge.","zh":"（哲学）普遍的看法或意见——人们认为是真的东西，常与“确定的知识”相对。"},"examples":[{"en":"In Plato’s writings, doxia is contrasted with episteme, or true knowledge.","zh":"在柏拉图的著作中，doxia 常与 episteme（真正的知识）形成对比。"},{"en":"His argument challenged the doxia of the crowd.","zh":"他的论证挑战了大众的普遍看法。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Glory or praise, especially in religious or literary contexts, related to words like “doxology.”","zh":"（较少见）荣耀或赞美，尤用于宗教或文学语境，与 doxology（颂赞）等词有关。"},"examples":[{"en":"The hymn offered doxia to God.","zh":"这首圣歌向上帝献上荣耀与赞美。"}]}],"synonyms":["opinion","belief","common belief","popular opinion","orthodoxy (related)"],"phonetic":"/ˈdɑːksiə/","extraExplanation":["“Doxia”来自希腊语 doxa，本义与“看法/声望/荣耀”有关。在古希腊哲学里，它常指“意见层面的认知”，强调可能受习俗、传闻或群体影响；与之对立的是 episteme（可论证的知识）。","在英文中更常见的相关词是 doxastic（与信念有关的）、orthodoxy（正统信仰/正统观念）、heterodoxy（异端/非正统观点）、doxology（颂赞词）。"]}
{"word":"doxie","summary":{"en":"Doxie most commonly means a dachshund (a small dog). In older slang, it can mean a mistress or prostitute (dated and potentially offensive).","zh":"doxie最常指腊肠犬（一种小狗）。在旧俚语中也可指情妇或妓女（过时且可能冒犯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small dog, especially a dachshund (often used as a cute nickname).","zh":"小狗；尤指腊肠犬（常作可爱昵称）。"},"examples":[{"en":"She has a little doxie who loves to burrow under blankets.","zh":"她有一只小腊肠犬，特别爱钻进毯子下面。"},{"en":"Our doxie barks at everything but is very sweet with people.","zh":"我们的腊肠犬对什么都叫，但对人很亲。"}]},{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned, slang) A mistress or lover; sometimes also used to mean a prostitute.","zh":"（过时俚语）情妇/情人；有时也指妓女。"},"examples":[{"en":"In some older stories, “doxie” refers to a man’s secret lover.","zh":"在一些老故事里，“doxie”指男人的秘密情人。"},{"en":"This meaning is dated and can sound insulting today.","zh":"这个意思如今已过时，而且可能带有侮辱性。"}]}],"synonyms":["dachshund","wiener dog","sausage dog","pup","doggie"],"phonetic":"/ˈdɑksi/","extraExplanation":["“doxie”当作“腊肠犬/小狗”的意思，源于对 dachshund 的亲昵称呼（类似 doggie、pup）。在日常口语里，这个用法更常见、更安全。","“doxie”表示“情妇/妓女”的用法属于历史俚语，常见于旧文学或历史材料；现代英语中基本不用，且容易冒犯他人，建议避免在现实交流中使用。"]}
{"word":"doxies","summary":{"en":"“Doxies” is an old-fashioned (often insulting) plural noun meaning mistresses or prostitutes.","zh":"“doxies”是一个旧式（常带侮辱性）的复数名词，指情妇或妓女。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “doxy”) a woman a man has a sexual relationship with outside marriage, especially a mistress; in older English, also used to mean a prostitute (now old-fashioned and often insulting).","zh":"（“doxy”的复数）指与男性有婚外性关系的女性，尤指情妇；在较旧的英语中也可指妓女（现多为旧式用法，且常带侮辱性）。"},"examples":[{"en":"In some old novels, the word “doxy” is used for a man’s mistress.","zh":"在一些旧小说里，“doxy”用来指男人的情妇。"},{"en":"The play uses archaic insults, including “doxies,” to show how people spoke in that era.","zh":"这部戏使用了包括“doxies”在内的古旧侮辱词，来呈现当时人们的说话方式。"}]}],"synonyms":["mistresses","prostitutes","sex workers (modern, respectful)"],"phonetic":"/ˈdɑk.siz/","extraExplanation":["“doxy / doxies”主要见于早期现代英语与文学作品（如16–18世纪语境），在现代日常英语里几乎不用；若直接用于现实人物，往往显得粗俗、轻蔑或带性别歧视。写作或阅读时更常把它当作“时代用语/角色用语”来理解。","更中性、常见的替代说法：mistress（情妇），sex worker（性工作者，较尊重的说法），prostitute（妓女，偏直白，语气因语境而异）。"]}
{"word":"doxographer","summary":{"en":"A doxographer is someone who compiles and writes summaries of other people’s opinions, especially philosophical views.","zh":"doxographer 指整理并撰写他人观点（尤指哲学观点）汇编的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes or compiles a doxography—an organized collection or summary of other people’s opinions (especially philosophers’ views).","zh":"撰写或编纂“意见汇编”（doxography）的人——把他人的观点（尤指哲学家的学说）加以整理、归纳并记录的人。"},"examples":[{"en":"Ancient doxographers preserved many early Greek philosophical ideas by summarizing them.","zh":"古代的意见汇编者通过概述记录，保存了许多早期希腊哲学思想。"},{"en":"The scholar studied a doxographer’s text to compare different schools of thought.","zh":"这位学者研究某位意见汇编者的文本，以比较不同学派的观点。"}]}],"synonyms":["compiler","chronicler","commentator"],"phonetic":"/dɑkˈsɑɡrəfər/","extraExplanation":["词根提示：doxo- 来自希腊语 doxa（“观点、意见”），-grapher 表示“书写者/记录者”。因此 doxographer 字面意思就是“记录观点的人”。","在学术语境中，doxographer 常指古代或后世整理哲学家学说的人（例如把前人观点按主题或学派归类），其作品有时是研究早期思想的重要“二手资料”。"]}
{"word":"doxographical","summary":{"en":"“Doxographical” describes writing or research that mainly compiles and summarizes people’s opinions, especially in philosophy.","zh":"“Doxographical”指以汇编、概述他人观点为主的写作或研究方式，尤常见于哲学领域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a doxography: a collection, summary, or study of people’s opinions (especially philosophers’ views) rather than direct evidence or original arguments.","zh":"与“见解汇编/学说汇编（doxography）”有关的：指对人们（尤指哲学家）观点的收集、概述或研究，而非基于直接证据或原创论证。"},"examples":[{"en":"The article takes a doxographical approach, listing what major thinkers said about the soul.","zh":"这篇文章采用见解汇编式的方式，罗列主要思想家关于灵魂的观点。"},{"en":"Her chapter is more doxographical than analytical: it summarizes positions without evaluating them.","zh":"她那一章更偏向见解汇编而非分析：只概述立场，不做评判。"},{"en":"In ancient philosophy, many sources are doxographical reports of earlier schools.","zh":"在古代哲学研究中，很多资料都是对更早学派的见解汇编式记载。"}]}],"synonyms":["opinion-summarizing","compilatory","survey-based","descriptive"],"phonetic":"/ˌdɑksəˈɡræfɪkəl/","extraExplanation":["词源小提示：doxographical 来自 doxography；doxography 源于希腊语 doxa（“观点、看法”）+ -graphy（“书写、记录”）。因此它常用于哲学史、思想史写作中，强调“记录他人观点”的性质。","学习区分：doxographical（见解汇编式的）常与 analytical（分析性的）、critical（批判性的）、evidence-based（基于证据的）形成对比。"]}
{"word":"doxography","summary":{"en":"Doxography means a written collection of other people’s opinions—especially summaries of philosophers’ views.","zh":"Doxography 指对他人观点的书面汇编，尤其是对哲学家学说的摘要式整理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the writing or collection of other people’s opinions, especially summaries of philosophers’ views rather than original arguments","zh":"（尤指哲学领域的）辑录他人观点的著作；对诸家学说的汇编/概述（常偏重整理转述而非原创论证）"},"examples":[{"en":"Some scholars treat the text as doxography because it mostly reports earlier philosophers’ ideas.","zh":"一些学者把这部文本视为“观点辑录”，因为它主要是在转述早期哲学家的思想。"},{"en":"Doxography can be useful, but it may also simplify complex theories into short summaries.","zh":"观点辑录很有用，但也可能把复杂理论简化成简短的概要。"}]}],"synonyms":["compendium of opinions","collection of views","survey of doctrines"],"phonetic":"/ˌdɑkˈsɑɡrəfi/","extraExplanation":["词源来自希腊语：doxa（“意见、见解”）+ -graphy（“写作、记录”）。在西方哲学史研究中常用来指那些“整理前人学说”的资料，如某些古代作者对早期哲学家的观点摘要。学习时可理解为“二手的观点汇编”，阅读时要留意是否经过筛选、改写或误传。","相关词：doxographical（形容词，表示“观点辑录式的”）；doxographer（名词，指从事观点辑录的人）。与 biography（传记）不同，doxography 记录的重点是“观点/主张”，而不是“人生经历”。"]}
{"word":"doxological","summary":{"en":"Doxological means “connected with a doxology,” especially language or music used to praise God in worship.","zh":"doxological 指“与颂赞有关的”，尤指礼拜中用于赞美上帝的语言或音乐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a doxology (a short hymn or spoken praise to God), especially used in Christian worship.","zh":"与“颂赞”（doxology，一种简短的赞美上帝的赞歌或祷词）有关的；尤指基督教礼拜中的用语。"},"examples":[{"en":"The service ended with a doxological hymn of praise.","zh":"礼拜以一首颂赞诗歌作为结束。"},{"en":"Some churches include doxological language in their closing prayers.","zh":"一些教会会在结束祷告中加入颂赞性的措辞。"}]}],"synonyms":["praise-filled","devotional","hymnic","liturgical"],"phonetic":"/ˌdɑk.səˈlɑdʒ.ɪ.kəl/","extraExplanation":["“doxological”常见于宗教与神学写作，描述礼拜、祷告、诗歌或语言中“赞美上帝”的功能或风格。","词根来自希腊语：doxa（荣耀、赞美）+ -logy（言说、表达）。因此它的核心含义是“表达荣耀/赞美的”。","与“doxological”相关的常见词有：doxology（颂赞；赞美短祷/短歌）、glory（荣耀）、praise（赞美）。"]}
{"word":"doxologically","summary":{"en":"“Doxologically” means “in a way that expresses a doxology—formal praise to God,” often in Christian contexts.","zh":"“doxologically”意为“以颂荣/赞美上帝的方式”，多见于基督教礼拜或神学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a doxology (a short hymn or words of praise to God), especially in Christian worship.","zh":"以“颂荣”（doxology，常见于基督教礼拜中的简短赞美诗或赞美词）的方式；带有宗教颂赞意味地。"},"examples":[{"en":"The choir ended the service doxologically, singing a brief hymn of praise.","zh":"合唱团以颂荣的方式结束礼拜，唱了一段简短的赞美诗。"},{"en":"He interpreted the closing lines doxologically, as a direct expression of praise to God.","zh":"他以颂荣的角度解读结尾几句，认为那是对上帝的直接赞美。"}]}],"synonyms":["in praise of God","as a doxology","devotionally","liturgically"],"phonetic":"/ˌdɑk.səˈlɑdʒ.ɪ.kəl.i/","extraExplanation":["“doxologically”较为少见，多用于神学、宗教学、礼拜研究或文学评论中。日常英语里更常见的是用更直白的说法，例如：“as a doxology / in praise of God / in a hymn of praise”。","词源提示：doxology来自希腊语 doxa（荣耀、赞美）+ -logy（言说、表达）。因此 doxologically 强调“以颂赞/归荣耀的方式表达”。"]}
{"word":"doxologies","summary":{"en":"Doxologies are short songs or lines of praise to God, commonly used in Christian worship.","zh":"doxologies 指用于基督教礼拜中的简短颂歌或颂词，用来赞美上帝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of doxology: short hymns or spoken lines that praise God, often used in Christian worship (for example, at the end of a prayer or a hymn).","zh":"doxology 的复数：赞美上帝的简短颂歌或祷词，常见于基督教礼拜中（例如祷告或圣诗结束时）。"},"examples":[{"en":"Many churches sing doxologies after the offering.","zh":"许多教会会在奉献之后唱颂荣歌（doxologies）。"},{"en":"The book includes doxologies from different Christian traditions.","zh":"这本书收录了不同基督教传统的颂荣词（doxologies）。"}]}],"synonyms":["hymns of praise","praise songs","gloria"],"phonetic":"/dɑkˈsɑlədʒiz/","extraExplanation":["“doxology”来自希腊语：doxa（荣耀、赞美）+ -logia（言说、表达）。在英语里常指礼拜中的“颂荣词/颂荣歌”，尤其是著名的《The Doxology》（“Praise God, from Whom All Blessings Flow…”）。","用法提示：在宗教语境以外也能比喻性使用，指“充满赞美的言辞/文章”，但这种用法相对更文学化或正式。"]}
{"word":"doxologize","summary":{"en":"“Doxologize” means to offer formal praise to God, often by saying or writing a doxology.","zh":"“doxologize”指以礼仪/正式的方式赞美上帝，常指吟诵或撰写颂荣词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to praise God (or something seen as divine) in a formal way; to say or write a doxology","zh":"（以正式/礼仪性的方式）赞美上帝（或被视为神圣的事物）；吟诵或撰写“颂荣词”"},"examples":[{"en":"In the final verse, the choir doxologized with a short hymn of praise.","zh":"在最后一节里，合唱团用一段简短的赞美圣诗来颂荣。"},{"en":"Some older writers used “doxologize” to describe ending a sermon with words of glory to God.","zh":"一些较早期的作者用“doxologize”来指讲道结尾用荣耀上帝的话收束。"}]}],"synonyms":["praise","glorify","extol","offer praise","recite a doxology"],"phonetic":"/ˌdɑːkˈsɑːl.ə.dʒaɪz/","extraExplanation":["“doxologize”源自“doxology（颂荣词）”。doxology来自希腊语词根：doxa（荣耀、赞美）+ -logia（言说、词句）。在基督教礼仪中，常见的颂荣词如“Glory be to the Father…”或“Praise God, from whom all blessings flow（The Doxology）”。该动词非常少见，多见于宗教或文学语境；日常英语里更常用“praise”或“say/recite a doxology”。"]}
{"word":"doxologized","summary":{"en":"“Doxologized” means “praised in the style of a doxology,” usually in a religious (Christian) setting, and can also mean “reverently over-praised” in a figurative sense.","zh":"“doxologized”意为“用颂荣（doxology）的方式来赞美/归荣耀”，多用于基督教礼拜语境；也可引申为“带宗教式敬仰地过度颂扬”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"praised (someone or something) in a doxology; expressed worship or glory to God in a formal way (often in Christian contexts).","zh":"用“颂荣（doxology）”来赞美（某人/某事）；以较正式的宗教用语把荣耀归于上帝（多见于基督教语境）。"},"examples":[{"en":"At the end of the service, the congregation doxologized God with a short hymn.","zh":"礼拜结束时，会众用一首简短的赞美诗来颂赞上帝。"},{"en":"The poet’s final stanza feels doxologized, turning into pure praise.","zh":"这位诗人最后一节带有“颂荣化”的感觉，几乎变成纯粹的赞美。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) treated with reverent, hymn-like praise; celebrated as if in a doxology.","zh":"（引申）以近乎赞美诗/颂荣的方式来歌颂；把……捧到带有宗教式敬仰的高度。"},"examples":[{"en":"In some reviews, the director is almost doxologized as a genius.","zh":"在一些影评里，这位导演几乎被“颂荣式”地奉为天才。"},{"en":"The brand was doxologized in ads, as if it could solve every problem.","zh":"广告里把这个品牌吹捧得像能解决所有问题一样。"}]}],"synonyms":["praised","glorified","extolled","lauded","celebrated"],"phonetic":"/ˈdɑksəˌlaɪzd/","extraExplanation":["“doxologized”来自动词“doxologize”，词根与“doxology（颂荣/荣耀颂）”有关。doxology常指基督教礼拜中固定的简短赞美段落或诗歌（如“Glory be to the Father…”），因此这个词带有明显的宗教与仪式色彩。","该词在日常英语中非常少见。写作时更常用“praise / glorify / extol（赞美/颂扬）”。在非宗教语境里用它，往往带一点“把人或事捧到近乎神圣”的讽刺或强调意味。"]}
{"word":"doxologizing","summary":{"en":"Doxologizing means praising (usually God) using a doxology; more rarely, it means giving grand, formal praise in general.","zh":"doxologizing 指用颂荣词来赞美（通常是上帝）；较少见时也可泛指以庄重夸赞的方式歌颂。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"praising God or expressing worship by using a doxology (a short hymn or spoken formula of praise).","zh":"用“荣耀颂/颂荣词（doxology）”来赞美上帝、表达敬拜。"},"examples":[{"en":"The choir began doxologizing at the end of the service.","zh":"在礼拜结束时，唱诗班开始用颂荣词来赞美上帝。"},{"en":"They stood together, doxologizing with the familiar words, “Praise God from whom all blessings flow.”","zh":"他们一同站立，用熟悉的句子“赞美上帝，万福之源”来颂赞。"}]},{"partOfSpeech":"v.","definition":{"en":"(by extension, rare) offering enthusiastic, formal praise for someone or something.","zh":"（引申义，较少见）以庄重、热烈的方式歌颂某人或某事。"},"examples":[{"en":"The article spends pages doxologizing the inventor’s genius.","zh":"这篇文章用了好几页来歌颂这位发明家的天才。"},{"en":"Instead of doxologizing the past, she focused on what still needed to change.","zh":"她没有一味颂扬过去，而是关注仍需要改变的地方。"}]}],"synonyms":["praising","worshiping","extolling","glorifying","lauding"],"phonetic":"/ˈdɑːksəˌlɔːdʒaɪzɪŋ/","extraExplanation":["“doxologizing”来自动词“doxologize”，与宗教礼仪中的“doxology（颂荣词/荣耀颂）”有关。英语里更常见的是名词“doxology”，而“doxologize/doxologizing”属于偏书面、较少见的用法，多出现在宗教语境或修辞性写作中。"]}
{"word":"doxology","summary":{"en":"A doxology is a short hymn or prayer that praises God, commonly used in Christian worship.","zh":"doxology 指赞美上帝的短诗歌或祷词，常见于基督教礼拜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short hymn or spoken prayer that gives praise to God, often used in Christian worship.","zh":"（基督教礼拜中常用的）颂赞歌；荣耀颂（用来赞美上帝的短诗歌或祷词）。"},"examples":[{"en":"At the end of the service, the congregation sang a doxology together.","zh":"礼拜结束时，会众一起唱了荣耀颂。"},{"en":"Many churches say a doxology after the offering.","zh":"许多教会会在奉献之后诵读荣耀颂。"}]}],"synonyms":["hymn of praise","praise hymn","chant","benediction (related)"],"phonetic":"/dɑkˈsɑlədʒi/","extraExplanation":["词源来自希腊语 doxa（“荣耀、赞美”）+ -logy（“言说、表达”），字面意思是“关于荣耀的言说/颂赞”。","英语里常见的特定文本是“The Doxology”（也叫“Old 100th”）：“Praise God, from whom all blessings flow...”，在一些新教传统中非常熟悉。","在更广义的宗教语境中，doxology 也可指任何以“荣耀归于……”为核心的颂赞句式或段落；在学术写作中多用于宗教学、礼仪学讨论。"]}
{"word":"doxorubicin","summary":{"en":"Doxorubicin is a widely used chemotherapy medicine that treats cancer by damaging cancer cells’ DNA.","zh":"多柔比星是一种常用的化疗药物，通过损伤癌细胞DNA来治疗癌症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a powerful chemotherapy drug (an anthracycline antibiotic) used to treat several types of cancer by damaging cancer cells’ DNA and stopping them from dividing","zh":"一种强效化疗药（蒽环类抗生素），用于治疗多种癌症；通过损伤癌细胞的DNA并阻止其分裂来发挥作用"},"examples":[{"en":"Doxorubicin is often included in combination chemotherapy for breast cancer and lymphoma.","zh":"多柔比星常用于乳腺癌和淋巴瘤的联合化疗方案中。"},{"en":"Because doxorubicin can affect the heart, doctors may monitor heart function during treatment.","zh":"由于多柔比星可能影响心脏，医生在治疗期间可能会监测心功能。"}]}],"synonyms":["Adriamycin (brand name)","anthracycline (drug class)"],"phonetic":"/ˌdɑksoʊˈruːbɪsɪn/","extraExplanation":["“doxorubicin”是通用名（generic name），常见商品名之一是Adriamycin。它属于蒽环类（anthracycline）药物，临床上常见重要不良反应包括骨髓抑制、脱发、恶心，以及与累积剂量相关的心脏毒性；静脉外渗还可能造成局部组织损伤。用药细节应以医生指导为准。"]}
{"word":"doxos","summary":{"en":"“Dox” means to reveal someone’s private personal information online, or the private info itself.","zh":"“dox”指在网上公开他人的隐私信息（动词），或指这些被公开的隐私资料（名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(internet slang) To search for and publish someone’s private personal information online—often with harmful intent.","zh":"（网络俚语）“人肉/开盒”：搜集并在网上公开他人的私人信息，通常带有伤害或威胁意图。"},"examples":[{"en":"Someone tried to dox the journalist after the article came out.","zh":"文章发表后，有人试图“开盒”那位记者。"},{"en":"Don’t dox people—report abuse to the platform instead.","zh":"不要“开盒”别人；遇到骚扰请向平台举报。"},{"en":"He was banned for doxxing a player during a livestream.","zh":"他因在直播中曝光一名玩家的隐私信息而被封禁。"}]},{"partOfSpeech":"n.","definition":{"en":"Private identifying information about a person that is shared online (such as an address, phone number, or workplace).","zh":"（网络俚语）被公开在网上的个人隐私/身份信息（如住址、电话、工作单位等）。"},"examples":[{"en":"The post included her dox, so it was removed quickly.","zh":"那条帖子包含她的隐私信息，因此很快被删除。"},{"en":"Never share anyone’s dox in a chat group.","zh":"不要在群聊里转发任何人的隐私信息。"}]}],"synonyms":["expose","reveal","unmask","leak"],"phonetic":"/dɑks/","extraExplanation":["“dox / doxx”来自“docs（documents，文件）”，早期指“挖出并公布别人的文件/身份资料”。现在常与网络骚扰、威胁、跟踪等行为相关，属于严重不当行为，很多平台明确禁止。","你输入的“doxos”不是常见标准拼写；最常见的是“dox / doxx”（动词）和“doxxing / doxing”（名词，指行为）。有时人们会把“dox”当名词用，表示“被公开的隐私资料”。"]}
{"word":"doxy","summary":{"en":"“Doxy” is a rare, old-fashioned noun meaning a prostitute or sometimes a mistress, and it’s often insulting.","zh":"“doxy”是罕见的旧式名词，指妓女或有时指情妇，通常带侮辱意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, often insulting) a prostitute; sometimes a woman kept as a man’s lover (a mistress).","zh":"（过时且常带侮辱性）妓女；有时指被男子供养的情妇。"},"examples":[{"en":"The novel uses the word “doxy” to show the speaker’s contempt for the woman.","zh":"小说里用“doxy”一词来表现说话者对那名女子的轻蔑。"},{"en":"In older texts, “doxy” can refer to a mistress rather than a sex worker.","zh":"在较早的文本中，“doxy”有时指情妇，而不一定指性工作者。"}]}],"synonyms":["prostitute","sex worker","mistress","courtesan","harlot (dated)"],"phonetic":"/ˈdɑksi/","extraExplanation":["“doxy”在现代英语中非常少用，多见于文学作品、历史文献或仿古/讽刺语境。由于带有贬义与性别歧视色彩，现实交流中不建议用它指人；更中性的说法可用“sex worker（性工作者）”“prostitute（妓女，仍可能显得冒犯）”“mistress（情妇）”等视语境选择。","词源并不十分确定，但普遍认为它来自早期英语/行话系统，属于历史性、社会语域强的词汇。阅读时可把它当作“角色态度/社会阶层”的语言线索。"]}
{"word":"doxycycline","summary":{"en":"Doxycycline is an antibiotic medicine used to treat certain bacterial infections.","zh":"多西环素是一种用于治疗某些细菌感染的抗生素药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a broad-spectrum antibiotic used to treat bacterial infections (for example acne, some respiratory infections, and certain tick-borne diseases)","zh":"多西环素：一种广谱抗生素，用于治疗细菌感染（如痤疮、部分呼吸道感染、某些蜱虫传播疾病等）"},"examples":[{"en":"The doctor prescribed doxycycline for my acne.","zh":"医生给我开了多西环素来治疗痤疮。"},{"en":"If you’re allergic to some antibiotics, tell your doctor before taking doxycycline.","zh":"如果你对某些抗生素过敏，在服用多西环素前要告诉医生。"},{"en":"Doxycycline can be used to treat some tick-borne infections.","zh":"多西环素可用于治疗某些蜱虫传播的感染。"}]}],"synonyms":["antibiotic","tetracycline (related class)"],"phonetic":"/ˌdɑk.siˈsaɪk.lɪn/","extraExplanation":["“doxycycline”是药名，常见于医疗语境。它属于“四环素类（tetracyclines）”抗生素。","学习时可注意：抗生素只对细菌感染有效，对普通感冒/流感等病毒感染通常无效；具体用法与疗程应遵医嘱。","词形来源：doxy- 与化学命名有关；-cycline 与 “tetracycline（四环素）”同一词族，表示这类抗生素。"]}

