{"word":"doyen","summary":{"en":"A doyen is the most respected or senior member of a group; it can also mean the longest-serving ambassador in a diplomatic corps.","zh":"doyen 指某个群体中最受尊敬或资历最深的人；也可指外交团中任职时间最长的大使。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the most respected, experienced, or senior member of a group (often someone who has been in the field the longest)","zh":"某个群体中最受尊敬、最有经验或资历最深的人（常指从业时间最长的人）"},"examples":[{"en":"She is considered the doyen of modern jazz criticism.","zh":"她被认为是现代爵士乐评论界的泰斗。"},{"en":"As the doyen of the department, he mentored generations of young researchers.","zh":"作为系里资历最深的前辈，他指导了一代又一代年轻研究者。"}]},{"partOfSpeech":"n.","definition":{"en":"the senior member of a diplomatic group, especially the ambassador with the longest service in a country (often in the phrase “doyen of the diplomatic corps”)","zh":"外交团中资历最深者，尤指在某国任职时间最长的大使（常见于“doyen of the diplomatic corps”）"},"examples":[{"en":"The ambassador served as doyen of the diplomatic corps at the ceremony.","zh":"在仪式上，这位大使以外交团团长（资历最深者）的身份出席。"}]}],"synonyms":["veteran","elder statesman","leading figure","authority","luminary"],"phonetic":"/ˈdɔɪ.ən/","extraExplanation":["doyen 来自法语，语体偏正式，常用于新闻、学术与文化评论中，表示“业界泰斗/元老”。","有时会看到阴性形式 doyenne（指女性）；现代英语里 doyen 也常作为中性用法。","与 “dean（院长/系主任）” 不同：doyen 强调资历与声望，不一定有正式职位。"]}
{"word":"doyenne","summary":{"en":"A doyenne is the most respected and experienced woman (or sometimes person) in a group or field.","zh":"doyenne 指某个团体或领域中最资深、最受尊敬的女性（有时也可泛指资深权威人士）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The most respected and experienced woman in a particular field or group; a female senior leader.","zh":"（某领域/团体中）最受尊敬、最有资历的女性；女性元老/前辈。"},"examples":[{"en":"She is regarded as the doyenne of American modern dance.","zh":"她被视为美国现代舞的女性泰斗。"},{"en":"As the doyenne of the department, she mentors new teachers.","zh":"作为系里的女性前辈，她指导新来的老师。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, the most respected and experienced person in a field (not always female, though some writers prefer “dean” or “doyen” for men).","zh":"引申义：某领域最资深、最受尊敬的人（不一定是女性；男性有时用 de(an)/doyen）。"},"examples":[{"en":"In the press, he was treated as the doyenne of political reporting.","zh":"在新闻界，他被当作政治报道的资深权威。"},{"en":"Many called her the doyenne of local journalism.","zh":"许多人称她为本地新闻界的女性权威。"}]}],"synonyms":["leading authority","veteran","matriarch","dean (of a field)","doyen"],"phonetic":"/dɔɪˈɛn/","extraExplanation":["“doyenne”来自法语，对应阳性形式是“doyen”。英语里常用“the doyenne of + 领域/群体”来表达“该领域最资深、最受尊敬的人（尤其指女性）”。在较正式的新闻、文化评论、学术语境中更常见。"]}
{"word":"doyennes","summary":{"en":"Doyennes means the most respected or senior women in a group or profession.","zh":"doyennes 指某群体或行业中最资深、最受敬重的女性人物（“doyenne”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of \"doyenne\": a woman who is the most respected, influential, or senior member of a group (especially in a profession or field).","zh":"“doyenne”的复数：指在某个群体（尤指某行业/领域）中最资深、最受敬重、最有影响力的女性成员。"},"examples":[{"en":"The doyennes of the fashion industry attended the annual awards ceremony.","zh":"时尚界的几位泰斗级女性出席了年度颁奖典礼。"},{"en":"She is widely regarded as one of the doyennes of modern dance.","zh":"她被广泛认为是现代舞领域的几位泰斗级人物之一（女性）。"},{"en":"The article interviewed several doyennes of the local theater scene.","zh":"那篇文章采访了当地戏剧界的几位资深女性人物。"}]}],"synonyms":["leading figures","senior figures","veterans","authorities","pioneers","matriarchs"],"phonetic":"/dɔɪˈɛn/","extraExplanation":["“doyenne”来自法语，对应男性形式是“doyen”。在现代英语里它有时也被当作较中性的“资深权威”来用，但字面和传统语感更偏向女性。","“doyennes”是复数形式；如果你指的是男性或不强调性别，也常见用“doyens”或直接用更中性的说法如 “leading figures / senior figures”。"]}
{"word":"doyens","summary":{"en":"“Doyens” means the most respected and senior figures in a field (plural of “doyen”).","zh":"“doyens”指某一领域里最受尊敬、最资深的权威人士（doyen 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the most respected, experienced, or senior person in a group or profession (plural of “doyen”)","zh":"（doyen 的复数）某个群体或行业中最受尊敬、最资深、经验最丰富的人"},"examples":[{"en":"She is one of the doyens of modern jazz, admired by younger musicians.","zh":"她是现代爵士乐界的资深泰斗之一，深受年轻音乐人的敬仰。"},{"en":"The conference invited several doyens of public health to speak.","zh":"会议邀请了几位公共卫生领域的权威前辈发言。"}]}],"synonyms":["veterans","elders","leading figures","authorities","luminaries"],"phonetic":"/ˈdɔɪən/","extraExplanation":["“doyen”来自法语，原意接近“（团体中）资历最老的人”。英语里常用来表达“德高望重的前辈/泰斗”，语气比较正式、带敬意。","虽然传统上有时用来指男性，但现代英语里常作为性别中性的“权威人士/前辈”。若特指女性，也可见到“doyenne”。"]}
{"word":"Doykos","summary":{"en":"“Doykos” is most likely a surname (proper noun), not a standard English word.","zh":"“Doykos”很可能是一个姓氏（专有名词），并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); not a common English vocabulary word, and it is usually used as a proper noun (a person’s last name).","zh":"姓氏（家族姓）；不是常见的英文词汇，通常作为专有名词使用（人的姓）。"},"examples":[{"en":"Dr. Doykos will see you now.","zh":"Doykos 医生现在要见你。"},{"en":"I met Ms. Doykos at the conference.","zh":"我在会议上认识了 Doykos 女士。"}]}],"phonetic":"/ˈdɔɪkoʊz/","extraExplanation":["“Doykos”看起来更像是人名/姓氏，而不是英语里的普通单词，所以一般不会出现在词典里。","如果你是在某个句子、游戏ID、品牌、或特定文化语境里看到它，请把原句发来；我可以帮你判断它指的是谁/什么，或是否是某个词的拼写变体（例如相近拼写的英文单词）。","学习点：英文里专有名词（人名、地名、品牌）通常首字母大写；但在全大写/用户名等场景中大小写可能不固定。"]}
{"word":"Doyle","summary":{"en":"Doyle is mainly a surname, widely known through Arthur Conan Doyle, the creator of Sherlock Holmes.","zh":"Doyle 主要是一个姓氏，并因《福尔摩斯》的作者阿瑟·柯南·道尔而广为人知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), common in Ireland and Scotland; often recognized from the British writer Arthur Conan Doyle, creator of Sherlock Holmes","zh":"一个姓氏（家族姓），在爱尔兰和苏格兰较常见；也常因英国作家阿瑟·柯南·道尔（Sherlock Holmes 的作者）而被熟知"},"examples":[{"en":"Her last name is Doyle.","zh":"她的姓是 Doyle（道尔）。"},{"en":"Arthur Conan Doyle wrote the Sherlock Holmes stories.","zh":"阿瑟·柯南·道尔写了《福尔摩斯》系列故事。"},{"en":"In the meeting, Mr. Doyle introduced himself first.","zh":"在会议上，Doyle 先生先做了自我介绍。"}]}],"phonetic":"/dɔɪl/","extraExplanation":["“Doyle”是英爱地区的常见姓氏。作为专有名词，中文常音译为“道尔”。在正式写作中通常需要首字母大写：Doyle。","最知名的相关人物之一是 Sir Arthur Conan Doyle（1859–1930）。他的作品让“Doyle”在英语文化中常与侦探小说、福尔摩斯形象联系在一起。"]}
{"word":"doyle","summary":{"en":"Doyle is mainly a surname, and it can also refer specifically to the writer Arthur Conan Doyle (Sherlock Holmes).","zh":"Doyle 主要是姓氏，也常特指《福尔摩斯》作者阿瑟·柯南·道尔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most common in Ireland and in English-speaking countries; it can refer to many people with that last name.","zh":"（姓氏）多见于爱尔兰及英语国家的姓；可指任何姓 Doyle 的人。"},"examples":[{"en":"My professor’s last name is Doyle.","zh":"我教授的姓是 Doyle。"},{"en":"Is Doyle your first name or your last name?","zh":"Doyle 是你的名还是姓？"}]},{"partOfSpeech":"n.","definition":{"en":"short for a famous bearer of the name, especially Sir Arthur Conan Doyle, the British writer who created Sherlock Holmes.","zh":"（常指）该姓氏中著名人物，尤指英国作家阿瑟·柯南·道尔（Arthur Conan Doyle），《福尔摩斯》系列的创作者。"},"examples":[{"en":"I’m reading Doyle’s Sherlock Holmes stories.","zh":"我正在读道尔的《福尔摩斯》故事。"},{"en":"Doyle helped make detective fiction popular worldwide.","zh":"道尔帮助侦探小说在全球流行起来。"}]}],"synonyms":["(as a surname) Conan Doyle (when referring to the author)"],"phonetic":"/dɔɪl/","extraExplanation":["“Doyle”源自爱尔兰盖尔语姓氏（常见解释与 Ó Dubhghaill 有关），大意与“黑暗的异乡人/外来者”相关，历史上常与维京人等外来群体的称呼有关。","在英语语境中，用姓氏单独称呼作者很常见：如说“Doyle”常可指“Arthur Conan Doyle”。在正式写作中也可写全名以避免歧义。"]}
{"word":"Doylestown","summary":{"en":"Doylestown is a town in Pennsylvania (near Philadelphia) and the county seat of Bucks County.","zh":"Doylestown 是美国宾夕法尼亚州（靠近费城）的一座小镇，也是巴克斯县的县治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town (borough) in Bucks County, Pennsylvania, USA, about 25 miles (40 km) north of Philadelphia; it is the county seat of Bucks County.","zh":"美国宾夕法尼亚州巴克斯县的一个小镇（自治市），位于费城以北约25英里（40公里）；也是巴克斯县的县治（县政府所在地）。"},"examples":[{"en":"We spent the afternoon in Doylestown visiting the museums and walking downtown.","zh":"我们在多伊尔斯敦度过了一个下午，参观博物馆并在市中心散步。"},{"en":"She commutes from Doylestown to Philadelphia a few days a week.","zh":"她每周有几天从多伊尔斯敦通勤到费城。"}]}],"synonyms":["Doylestown, PA"],"phonetic":"/ˈdɔɪlz.taʊn/","extraExplanation":["“Doylestown”是专有名词，通常不加冠词（不说 *the Doylestown*）。常见写法是 “Doylestown, PA”。","它以文化与历史景点闻名，例如 Mercer Museum 和 Fonthill Castle；同时也与作家 James A. Michener（詹姆斯·A·米切纳）有关，他曾在当地生活并把部分遗产捐给了社区。"]}
{"word":"doyley","summary":{"en":"A doyley (more commonly spelled “doily”) is a small decorative mat placed under items like cups or vases to protect and decorate a surface.","zh":"doyley（更常写作 doily）指一种小型装饰垫，放在杯子或花瓶等物品下面，用于保护并装饰桌面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small decorative mat (often lace or crocheted) put under a plate, cup, vase, or ornament to protect a surface and add decoration; a common spelling is “doily.”","zh":"（常为蕾丝或钩织的）小型装饰垫，用于放在盘子、杯子、花瓶或摆件下面，以保护桌面并起装饰作用；常见拼写为“doily”。"},"examples":[{"en":"She put a lace doyley under the teacup to protect the wooden table.","zh":"她在茶杯下面垫了一块蕾丝小垫子，保护木桌面。"},{"en":"The vase sat on a white doyley in the center of the table.","zh":"花瓶放在桌子中央的一块白色小垫子上。"},{"en":"My grandmother used to crochet doyleys for holidays.","zh":"我奶奶以前会为节日钩织小垫子。"}]}],"synonyms":["doily","lace mat","placemat (similar, usually larger)"],"phonetic":"/ˈdɔɪli/","extraExplanation":["“doyley”是“doily”的变体拼写，在现代英语里“doily”更常见。","这个词常被认为源自19世纪伦敦一家与蕾丝装饰有关的商号名称（与 D’Oyly 相关），后来用来指代这种装饰小垫。","在英美的下午茶文化、传统餐桌布置中常见：放在茶杯、蛋糕盘或小点心盘下面，既防污也显得精致。"]}
{"word":"doyleys","summary":{"en":"“Doyleys” means decorative table mats under cups/plates (plural). The standard spelling is “doilies.”","zh":"“doyleys”指杯子/盘子下面的装饰性小垫片（复数）；标准拼写通常是“doilies”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of doily: a small decorative piece of paper, cloth, or lace placed under a cup, vase, or dessert to protect a surface and look pretty.","zh":"doily 的复数：小型装饰性垫片（纸质、布质或蕾丝），常垫在杯子、花瓶或甜点下面，用来保护桌面并增添美观。"},"examples":[{"en":"She put doilies under the teacups for the afternoon tea.","zh":"她在茶杯下面垫了小垫纸，准备下午茶。"},{"en":"The bakery used white paper doilies under each slice of cake.","zh":"那家烘焙店在每块蛋糕下面都垫了白色纸垫。"}]}],"synonyms":["doilies","placemats","coasters","lace mats"],"phonetic":"/ˈdɔɪliz/","extraExplanation":["“doyleys”常见于非标准拼写；更常见、标准的复数拼写是“doilies”（把 -y 变成 -ies）。在菜单、手工艺品标签或老式说明中偶尔会看到“doyley(s)”这种变体。","doily 传统上与英式/维多利亚风格的茶点文化有关（如茶壶、茶杯下的蕾丝垫），也常见于甜点摆盘与家居装饰。"]}
{"word":"doylies","summary":{"en":"Doilies are small decorative cloth or paper mats placed under items like cups or plates.","zh":"Doilies 指放在杯子或盘子等物品下方的小型装饰布垫或花边纸垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small decorative cloth (often lace or crocheted) placed under a plate, cup, vase, or other object to protect a surface and add decoration.","zh":"（常为蕾丝或钩织的）小装饰布垫，放在盘子、杯子、花瓶等下面，用于保护桌面并增加美观。"},"examples":[{"en":"She put a lace doily under the teapot to protect the wooden table.","zh":"她在茶壶下面垫了一块蕾丝小垫布，保护木桌面。"},{"en":"The cookies were served on a paper doily.","zh":"饼干放在一张纸质花边垫纸上端上来。"}]}],"synonyms":["lace mat","table mat","decorative mat","paper lace doily"],"phonetic":"/ˈdɔɪliz/","extraExplanation":["“doilies”是“doily”的复数形式。日常里常见搭配有：lace doily（蕾丝垫布）、paper doily（纸质花边垫纸，常用于甜点/烘焙摆盘）。","在英语文化中，doilies常让人联想到较传统、温馨或“老派”的家居装饰风格（例如祖母家、乡村风）。"]}
{"word":"Doyline","summary":{"en":"Doyline is a small town in Webster Parish, Louisiana, USA.","zh":"Doyline 是美国路易斯安那州韦伯斯特堂区的一个小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small town (village) in northwestern Louisiana, USA, in Webster Parish","zh":"（美国）路易斯安那州西北部韦伯斯特堂区的一个小镇（村镇）"},"examples":[{"en":"Doyline is a small community in Webster Parish, Louisiana.","zh":"Doyline 是路易斯安那州韦伯斯特堂区的一个小社区。"},{"en":"They drove through Doyline on the way to the lake.","zh":"他们去湖边的路上开车经过了 Doyline。"}]}],"synonyms":["(place name)"],"phonetic":"/ˈdɔɪlaɪn/","extraExplanation":["Doyline 是专有名词（地名）。在英语里，地名通常首字母大写，前面可搭配介词：in Doyline（在多伊莱恩）、from Doyline（来自多伊莱恩）、to Doyline（去多伊莱恩）。","美式读音常近似“DOY-line”。如果你在本地新闻或口语里听到略有差异，通常属于地方口音或习惯读法。"]}
{"word":"doylt","summary":{"en":"“doylt” is not an English word; it’s likely a misspelling of “doily,” a small decorative mat placed under objects.","zh":"“doylt”不是英语单词；很可能是“doily”的拼写错误，指放在物品下面的小装饰垫。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo for “doily,” a small decorative mat (often lace or paper) put under a plate, vase, or other object.","zh":"不是标准英语单词。很可能是把“doily”拼错了；“doily”指（常为蕾丝或纸质的）小装饰垫，用来垫在盘子、花瓶等物品下面。"},"examples":[{"en":"I couldn’t find “doylt” in a dictionary—did you mean “doily”?","zh":"我在词典里找不到“doylt”——你是不是想写“doily”？"},{"en":"She placed a vase on a lace doily on the table.","zh":"她把花瓶放在桌上的蕾丝小垫子（doily）上。"}]}],"synonyms":["doily (correct spelling)","decorative mat","lace mat","paper lace doily"],"phonetic":"/ˈdɔɪli/","extraExplanation":["“doily”常出现在家居、餐桌摆设语境里，带一点传统、复古的感觉；也常指蛋糕或甜点下面那种纸质花边垫。"]}
{"word":"doyly","summary":{"en":"“Doyly” usually means a small decorative mat under dishes or ornaments; it is an uncommon spelling of “doily.”","zh":"“doyly”通常指餐具或摆件下面的装饰小垫布，是“doily”的不常见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant spelling of “doily”) a small decorative cloth placed under a plate, cup, vase, or ornament to protect a surface and add decoration.","zh":"（“doily”的变体拼写）小型装饰垫布，放在盘子、杯子、花瓶或摆件下面，用来保护桌面并起装饰作用。"},"examples":[{"en":"She put a lace doyly under the vase to protect the wooden table.","zh":"她在花瓶下面垫了一块蕾丝小垫布，保护木桌面。"},{"en":"The teacup sat neatly on a paper doyly.","zh":"茶杯整齐地放在一张纸质小垫布上。"}]}],"synonyms":["doily","lace mat","placemat (broader)","paper doily"],"phonetic":"/ˈdɔɪli/","extraExplanation":["“doyly”在现代英语中较少见，更常用的拼写是“doily”。多见于旧式写法、品牌名、或个别地区/个人习惯。","Doily常与家居装饰、英式下午茶（afternoon tea）等场景联系在一起，传统上常见材质有蕾丝、钩针编织或纸质（一次性纸垫）。"]}
{"word":"Doyon","summary":{"en":"Doyon is usually a proper noun—most commonly a surname, and sometimes the name of an organization or place depending on context.","zh":"Doyon 通常是专有名词：最常见为姓氏，也可能是组织或地名，需结合语境理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（常见于法语/英语语境的）姓氏。"},"examples":[{"en":"Ms. Doyon will lead the meeting today.","zh":"Doyon 女士今天将主持会议。"},{"en":"I met a writer named Doyon at the library.","zh":"我在图书馆遇到一位姓 Doyon 的作家。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name used for organizations or places (e.g., a company or a community) depending on context.","zh":"专有名词：也可用作组织或地名（例如公司或社区），具体含义取决于语境。"},"examples":[{"en":"Doyon announced a new community program.","zh":"Doyon 宣布了一项新的社区项目。"},{"en":"She works for Doyon in Alaska.","zh":"她在阿拉斯加的 Doyon 工作。"}]}],"phonetic":"/ˈdɔɪ.ɑn/","extraExplanation":["“Doyon”更常见于专有名词（人名/机构名）。在英语里，专有名词通常首字母大写：Doyon。","在阿拉斯加，“Doyon”也可能指一家阿拉斯加原住民区域公司（Doyon, Limited）。如果你是在新闻、简历或公司介绍里看到它，往往就是这个用法。","如果你告诉我你看到“Doyon”的句子或来源（人名/公司/地名），我可以帮你确认最合适的理解与中文译法。"]}
{"word":"doyst","summary":{"en":"“Doyst” is an archaic form meaning “you do,” usually written today as “dost/doest.”","zh":"“doyst”是古体形式，意思相当于“你做/你会”，现代更常写作“dost/doest”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An archaic (old-fashioned) spelling of “dost” or “doest,” meaning “you do” (used with “thou” in older English).","zh":"古英语/早期现代英语中“dost / doest”的一种拼写，意思是“你做/你会”（与 thou 搭配使用）。"},"examples":[{"en":"Thou doyst speak truth, friend.","zh":"你确实说的是真话，朋友。（古体）"},{"en":"Why doyst thou doubt me?","zh":"你为何怀疑我？（古体）"}]}],"synonyms":["dost","doest","you do"],"phonetic":"/doʊst/","extraExplanation":["“doyst”不是现代标准英语拼写，通常出现在早期文本、戏剧或仿古风格写作中；更常见的形式是“dost”或“doest”。","在莎士比亚等作品里，和“thou”（你，单数亲密/非正式）一起使用：thou dost/doest + 动词。现代英语对应为“you do”。"]}

