{"word":"DP","summary":{"en":"DP is an abbreviation with several common meanings (film, sports, computing, and social media), so you need context to know which one.","zh":"DP 是一个有多种常见含义的缩写（影视、体育、计算机、社交媒体等），需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Director of Photography; the person responsible for a film’s or TV show’s camera work and lighting style.","zh":"（缩写）摄影指导；在电影/电视剧中负责摄影机运用与灯光风格的人。"},"examples":[{"en":"The DP chose a softer lighting look for the flashback scenes.","zh":"摄影指导为闪回场景选择了更柔和的灯光风格。"},{"en":"Ask the DP about lens choices before the shoot.","zh":"开拍前先和摄影指导确认镜头选择。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., sports) Double play; a play in baseball where the defense gets two outs in one continuous action.","zh":"（缩写，体育）双杀；棒球中防守方一次连续动作造成两个出局。"},"examples":[{"en":"They turned a DP to end the inning.","zh":"他们用一次双杀结束了这一局。"},{"en":"A quick throw to second started the DP.","zh":"快速传向二垒启动了这次双杀。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., computing) Dynamic programming; a problem-solving method that breaks a task into smaller subproblems and reuses results.","zh":"（缩写，计算机）动态规划；把问题拆成子问题并复用结果的解题方法。"},"examples":[{"en":"We can solve it with DP using a table of best results.","zh":"我们可以用动态规划，用一个表来记录最优结果。"},{"en":"This DP approach reduces repeated work.","zh":"这种动态规划思路减少了重复计算。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., business/IT) Data processing; the act of collecting and changing data to produce useful information.","zh":"（缩写，商业/IT）数据处理；收集并转换数据以产出有用信息的过程。"},"examples":[{"en":"The company improved DP to speed up monthly reports.","zh":"公司改进了数据处理流程来加快月报生成。"},{"en":"DP errors can affect the final numbers.","zh":"数据处理错误会影响最终数字。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., social media) Display picture; a user’s profile photo (more common in some regions than in the U.S.).","zh":"（缩写，社交媒体）头像/资料照片（在部分地区更常用，美国较少这样说）。"},"examples":[{"en":"Nice DP—did you take that photo yourself?","zh":"你的头像很好看——那是你自己拍的吗？"},{"en":"She changed her DP after the trip.","zh":"旅行后她换了头像。"}]}],"synonyms":["DoP (Director of Photography)","cinematographer (related)","dynamic programming (full term)","double play (full term)","profile picture (related)"],"phonetic":"/ˌdiː ˈpiː/","extraExplanation":["“DP”是高度依赖语境的缩写：在影视行业最常指 Director of Photography；在棒球新闻里常指 double play；在算法/面试里常指 dynamic programming。写作或正式场合建议第一次出现时写全称，后面再用 DP。","发音通常按字母读：D-P。"]}
{"word":"dp","summary":{"en":"“dp” is a context-dependent abbreviation, commonly meaning a profile picture (display picture), damage per second in gaming, or data processing in IT/business.","zh":"“dp”是一个强依赖语境的缩写，常见含义包括头像（display picture）、游戏中的每秒伤害，以及职场/IT里的数据处理。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used online for a profile photo (display picture)","zh":"网络用语：指头像/个人资料照片（display picture）"},"examples":[{"en":"Your DP looks great—did you take that photo on vacation?","zh":"你的头像很好看——那张照片是你度假时拍的吗？"},{"en":"I changed my DP to a simple icon for work.","zh":"我把头像换成了一个适合工作的简单图标。"}]},{"partOfSpeech":"other","definition":{"en":"(gaming) damage per second; how much damage a character or weapon deals each second","zh":"（游戏）每秒伤害（damage per second），指单位时间内造成的伤害量"},"examples":[{"en":"This weapon has higher DP(S), so it’s better for long fights.","zh":"这把武器的DPS更高，所以更适合持久战。"},{"en":"He plays a DPSer role to help the team finish bosses faster.","zh":"他打输出位（DPS）来帮助队伍更快打Boss。"}]},{"partOfSpeech":"other","definition":{"en":"data processing; the work of handling and organizing data (often in business/IT)","zh":"数据处理（data processing）；指对数据进行整理、计算、管理等工作（常见于商务/IT）"},"examples":[{"en":"The company uses DP software to clean and analyze sales data.","zh":"公司用数据处理软件来清洗并分析销售数据。"},{"en":"Her job involves DP and reporting every week.","zh":"她的工作包括数据处理和每周做报表。"}]}],"synonyms":["profile picture (PFP)","avatar","DPS","data processing"],"phonetic":"/ˌdiːˈpiː/","extraExplanation":["“dp”是缩写，具体含义非常依赖场景：社交媒体里常指头像（display picture）；游戏里更常写作“DPS”（每秒伤害）；在职场/IT里可能指data processing（数据处理）。","在少数语境中“DP”也可能代表成人内容相关缩写。若在不熟悉的场合看到，建议结合上下文或直接礼貌询问对方指的是什么。"]}
{"word":"DPA","summary":{"en":"DPA is an abbreviation. Most commonly it means Data Protection Act (privacy law) or Deferred Prosecution Agreement (a legal settlement); less commonly it can mean Digital Personal Assistant.","zh":"DPA是缩写，最常见指《数据保护法》（隐私法律）或“暂缓起诉协议”（法律和解）；较少情况下也可指“数字个人助理”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Data Protection Act — a law about how personal information (data) must be collected, used, stored, and shared.","zh":"（缩写）《数据保护法》——规范个人信息（数据）如何被收集、使用、保存与共享的法律。"},"examples":[{"en":"The company updated its privacy policy to comply with the DPA.","zh":"公司更新了隐私政策以符合《数据保护法》（DPA）。"},{"en":"Under the DPA, you may have the right to access your personal data.","zh":"根据《数据保护法》（DPA），你可能有权查阅自己的个人数据。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Deferred Prosecution Agreement — a legal deal where prosecutors pause criminal charges if the organization meets certain conditions (often used in corporate crime cases).","zh":"（缩写）暂缓起诉协议——检方在满足一定条件的情况下暂缓起诉（常见于公司犯罪案件）。"},"examples":[{"en":"The firm entered into a DPA and agreed to pay a fine and improve compliance.","zh":"该公司签署了暂缓起诉协议（DPA），同意缴纳罚款并加强合规。"},{"en":"If the company breaks the terms of the DPA, the prosecution can continue.","zh":"如果公司违反DPA条款，检方可以继续起诉。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Digital Personal Assistant — an electronic device or software that helps with tasks like scheduling and reminders (more common in older usage; today people often say “virtual assistant”).","zh":"（缩写）数字个人助理——帮助安排日程、提醒等任务的设备或软件（较旧的说法；现在更常说“虚拟助理”）。"},"examples":[{"en":"In the early 2000s, many people used a DPA to manage contacts and appointments.","zh":"在2000年代初，很多人用数字个人助理（DPA）来管理联系人和日程。"},{"en":"This app works like a DPA for reminders and notes.","zh":"这个应用像数字个人助理（DPA）一样用来提醒和记笔记。"}]}],"synonyms":["Data Protection Act","Deferred Prosecution Agreement","digital assistant"],"phonetic":"/ˌdiː piː ˈeɪ/","extraExplanation":["DPA是缩写，具体含义强烈依赖语境与国家/行业：在英国语境里常指Data Protection Act；在美国法律新闻里也常见Deferred Prosecution Agreement。看到DPA时，优先查看它出现的领域（隐私合规、刑事司法、科技产品等）。","读法通常按字母读：D-P-A。写作时首次出现建议先写全称（如Data Protection Act (DPA)），后文再用DPA。"]}
{"word":"DPAC","summary":{"en":"DPAC is an acronym, most often meaning the Durham Performing Arts Center; in other contexts it can refer to different organizations.","zh":"DPAC 是一个缩写，最常见指“达勒姆表演艺术中心”；在其他语境中也可能代表不同机构。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an acronym most commonly used for the Durham Performing Arts Center, a major performing-arts theater in Durham, North Carolina (U.S.).","zh":"一个缩写，最常见的用法是指美国北卡罗来纳州达勒姆市的“达勒姆表演艺术中心”（Durham Performing Arts Center），一座大型剧院/演出场馆。"},"examples":[{"en":"We’re seeing the musical at DPAC tonight.","zh":"我们今晚要去 DPAC 看音乐剧。"},{"en":"DPAC hosts touring Broadway shows and concerts.","zh":"DPAC 会举办巡演的百老汇剧目和音乐会。"}]},{"partOfSpeech":"other","definition":{"en":"a less common acronym that can stand for different organizations or committees, depending on the field (e.g., a data-privacy or advisory committee).","zh":"一个不太固定的缩写，在不同领域可能代表不同机构或委员会（例如与数据隐私、咨询委员会相关的名称）。"},"examples":[{"en":"Check the document to see what DPAC stands for in this report.","zh":"请查看文件，确认这份报告里 DPAC 具体指什么。"},{"en":"Our company’s DPAC reviews privacy risks before product launches.","zh":"我们公司的 DPAC 会在产品发布前审查隐私风险。"}]}],"synonyms":["Durham Performing Arts Center (common full form)"],"phonetic":"/ˌdiː piː eɪ ˈsiː/","extraExplanation":["DPAC 属于“缩写词”（acronym/initialism）一类，通常按字母逐个读（D-P-A-C）。它没有唯一固定含义，最稳妥的做法是结合上下文（地点、行业、文件标题）来判断具体全称。"]}
{"word":"DPANS","summary":{"en":"DPANS is an acronym; its meaning depends on context and usually needs to be expanded/defined in the source text.","zh":"DPANS 是一个缩写；具体含义取决于上下文，通常需要在原文中写出全称并说明。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/acronym written as the letters D-P-A-N-S. It is not a widely standard English word by itself, so its meaning depends on the field or document where it appears (you usually need the full expanded form).","zh":"由字母 D-P-A-N-S 组成的缩写/首字母缩略词。本身不是常见的标准英语单词，具体含义取决于它出现的领域或文件（通常需要看到全称）。"},"examples":[{"en":"I saw “DPANS” in the report, but it wasn’t defined—what does DPANS stand for?","zh":"我在报告里看到“DPANS”，但没有定义——DPANS 是什么的缩写？"},{"en":"In technical writing, define acronyms like DPANS the first time you use them.","zh":"在技术写作中，像 DPANS 这样的缩写第一次出现时要先写出全称并解释。"}]}],"synonyms":["acronym","abbreviation","initialism"],"phonetic":"/ˌdiː piː eɪ ɛn ˈɛs/","extraExplanation":["“DPANS”不是像“NASA”那样普遍固定的缩写；很多组织/项目会自创内部缩写，因此必须结合上下文判断。","如果你把它出现的句子、所属行业（例如医疗、工程、教育、政府文件）或全称的可能选项发我，我可以帮你更准确地解释与翻译。"]}
{"word":"DPC","summary":{"en":"DPC is an abbreviation with several common meanings, especially Direct Primary Care (healthcare) and Deferred Procedure Call (Windows).","zh":"DPC 是一个常见缩写，含义因领域而异，常见指直接基层医疗（医疗）或延迟过程调用（Windows）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Direct Primary Care: a healthcare model where patients pay a regular membership fee to a primary care doctor for most routine care, often without using insurance for those services.","zh":"直接基层医疗（直接初级照护）：一种医疗模式，病人按月或按年向家庭医生/全科医生支付会员费，常规看诊多不经由保险结算。"},"examples":[{"en":"She joined a DPC clinic to get same-day appointments and simpler pricing.","zh":"她加入了DPC诊所，这样可以当天预约，也更容易理解收费。"},{"en":"DPC usually covers basic visits, but you still may need insurance for hospital care.","zh":"DPC通常涵盖基础门诊，但住院等大额医疗仍可能需要保险。"}]},{"partOfSpeech":"n.","definition":{"en":"Deferred Procedure Call: in Windows computing, a mechanism that delays certain low-level tasks so the system can handle urgent work first.","zh":"延迟过程调用：Windows 系统中的一种机制，把部分底层任务延后执行，让系统先处理更紧急的工作。"},"examples":[{"en":"High DPC latency can cause audio crackling during recording.","zh":"DPC 延迟过高会导致录音时出现爆音或卡顿。"},{"en":"The technician checked DPC latency to troubleshoot the stuttering sound.","zh":"技术人员检查了 DPC 延迟来排查声音断断续续的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"Data Processing Center (or Data Processing Company): an organization or place that handles large-scale data processing.","zh":"数据处理中心（或数据处理公司）：负责大规模数据处理的机构或场所。"},"examples":[{"en":"The bank sent nightly reports to the DPC for processing.","zh":"银行把每晚的报表发送到数据处理中心进行处理。"},{"en":"All customer records are stored and processed at the DPC.","zh":"所有客户记录都在数据处理中心存储并处理。"}]}],"synonyms":["Direct Primary Care","Deferred Procedure Call","Data Processing Center"],"phonetic":"/ˌdiː piː ˈsiː/","extraExplanation":["“DPC”是缩写，具体含义高度依赖领域（医疗、电脑系统、企业/机构等）。如果你告诉我它出现的场景（例如一封邮件、医疗合同、电脑报错信息），我可以帮你锁定最准确的释义与用法。"]}
{"word":"DPE","summary":{"en":"DPE is an abbreviation. Most commonly in US aviation it means Designated Pilot Examiner; in computing it can mean a data processing engine/environment depending on context.","zh":"DPE是缩写：在美国航空中常指“指定飞行员考官”；在计算机领域可能指“数据处理引擎/环境”，需结合语境理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(aviation, US) Designated Pilot Examiner: a pilot authorized by the FAA to give practical tests (checkrides) and issue temporary certificates to applicants who pass.","zh":"（美国航空）指定飞行员考官：由美国联邦航空管理局（FAA）授权，负责进行飞行实操考试（checkride）并在考生通过后签发临时执照的人。"},"examples":[{"en":"My DPE asked me to explain the weather briefing before we started the checkride.","zh":"我的DPE在checkride开始前让我说明天气简报。"},{"en":"It can take weeks to schedule a checkride with a DPE during busy season.","zh":"旺季时要约到DPE进行checkride可能得等好几周。"}]},{"partOfSpeech":"other","definition":{"en":"(computing) Data Processing Engine/Environment: a system or component that processes data (the exact meaning depends on the company or document).","zh":"（计算机）数据处理引擎/环境：用于处理数据的系统或组件（具体含义会因公司或文件而异）。"},"examples":[{"en":"The new DPE can handle larger datasets with lower latency.","zh":"新的DPE能以更低延迟处理更大的数据集。"},{"en":"We deployed the model into the DPE for daily batch processing.","zh":"我们把模型部署到DPE里做每日批处理。"}]}],"synonyms":["Designated Pilot Examiner","FAA examiner","checkride examiner","data processing engine"],"phonetic":"/ˌdiː piː ˈiː/","extraExplanation":["“DPE”是缩写，不同领域含义差异很大。最常见、最固定的用法之一是在美国航空语境里指“Designated Pilot Examiner”。在技术文档里则常被各公司用作内部系统名（如Data Processing Engine/Environment）。","如果你告诉我出现DPE的场景（例如：飞行训练、公司技术栈、学校文件、职位名称等），我可以把最准确的释义和更贴近的例句补充给你。"]}
{"word":"DPH","summary":{"en":"DPH is most commonly an abbreviation for a Department of Public Health; less commonly it can refer to a combined vaccine name in some contexts.","zh":"DPH最常见是“公共卫生部门（Department of Public Health）”的缩写；在某些语境下也可能指一种联合疫苗名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Department of Public Health; a government agency responsible for protecting community health (e.g., disease control, vaccinations, health inspections).","zh":"（缩写）公共卫生局/卫生厅；负责维护公共健康的政府部门（如传染病防控、疫苗接种、卫生检查等）。"},"examples":[{"en":"The DPH issued a warning about the flu outbreak.","zh":"公共卫生局就流感暴发发布了警告。"},{"en":"Restaurants must pass a DPH inspection to stay open.","zh":"餐馆必须通过卫生部门的检查才能继续营业。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Diphtheria–Pertussis–Haemophilus (type b) vaccine; a combined childhood vaccine in some countries (often written as DPH or similar).","zh":"（缩写）白喉–百日咳–b型流感嗜血杆菌（Hib）联合疫苗；在部分国家/地区用于儿童的联合疫苗名称（有时写作DPH或类似写法）。"},"examples":[{"en":"The clinic offers DPH vaccinations for infants.","zh":"诊所为婴儿提供DPH联合疫苗接种。"},{"en":"Ask your pediatrician whether the DPH shot is included in the routine schedule.","zh":"可以问儿科医生常规免疫程序里是否包含DPH这一针。"}]}],"synonyms":["(for the agency) DOH","public health department"],"phonetic":"/ˌdiː piː ˈeɪtʃ/","extraExplanation":["在英语里，DPH最常见的含义是“Department of Public Health（公共卫生部门）”，但不同州/城市的官方名称可能不同（例如DPH、DOH等），具体含义通常要看上下文（政府公告、卫生检查、疫苗信息等）。","“DPH”作为疫苗缩写并不是全球统一写法；有的地区更常见写作“DTP/DTaP + Hib”等组合。如果你是在疫苗接种记录或医疗表格里看到DPH，建议结合所在国家/地区的免疫程序来确认。"]}
{"word":"DPhil","summary":{"en":"DPhil is the Oxford-style name for a Doctor of Philosophy degree, equivalent to a PhD.","zh":"DPhil 是“哲学博士”学位的另一种称呼，主要用于牛津大学等，等同于 PhD。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Doctor of Philosophy degree (equivalent to a PhD), used mainly as the official name of the degree at the University of Oxford and a few other universities","zh":"哲学博士学位（等同于 PhD），主要作为牛津大学及少数学校对该学位的正式称呼"},"examples":[{"en":"She is doing a DPhil in History at Oxford.","zh":"她在牛津大学攻读历史学的 DPhil（博士）学位。"},{"en":"After completing his DPhil, he became a university lecturer.","zh":"完成 DPhil 学位后，他成为了一名大学讲师。"},{"en":"The application asks whether you are applying for a PhD or a DPhil.","zh":"申请表会问你申请的是 PhD 还是 DPhil。"}]}],"synonyms":["PhD","doctorate","Doctor of Philosophy"],"phonetic":"/ˌdiːˈfɪl/","extraExplanation":["“DPhil”通常读作“D-Phil”，是 Doctor of Philosophy 的缩写。学术含义与“PhD”基本相同，差别主要在于学校传统与学位名称的写法，而不是学位等级更高或更低。","在英国语境中，提到“Oxford DPhil”常常暗示该学位来自牛津大学；在其他国家（如美国）更常见的写法是“PhD”。"]}
{"word":"DPI","summary":{"en":"DPI most commonly means “dots per inch,” a measure of printing/scanning resolution; in networking it can also mean “deep packet inspection.”","zh":"DPI 最常见指“每英寸点数”，用于衡量打印/扫描分辨率；在网络领域也可指“深度包检测”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dots per inch: a unit for measuring image/printing resolution (how many dots fit in one inch). Higher DPI usually means sharper detail.","zh":"每英寸点数：衡量图像/打印分辨率的单位（每英寸能容纳多少“点”）。DPI 越高通常细节越清晰。"},"examples":[{"en":"This printer can handle 1200 DPI for photo-quality prints.","zh":"这台打印机支持 1200 DPI，可以打印出照片级质量。"},{"en":"Try scanning the document at 300 DPI to make the text clearer.","zh":"试着用 300 DPI 扫描这份文件，让文字更清晰。"},{"en":"The logo looks blurry because the file’s DPI is too low.","zh":"这个标志看起来很糊，因为文件的 DPI 太低了。"}]},{"partOfSpeech":"n.","definition":{"en":"Deep Packet Inspection: a network technique that examines the contents of data packets, often used for security, traffic management, or monitoring.","zh":"深度包检测：一种网络技术，用来检查数据包的内容，常用于安全防护、流量管理或监控。"},"examples":[{"en":"Some companies use DPI to detect malware on their networks.","zh":"一些公司用 DPI 来检测网络中的恶意软件。"},{"en":"The policy limits the use of DPI because of privacy concerns.","zh":"由于隐私方面的担忧，这项政策限制使用 DPI。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) an abbreviation for names of organizations, such as Department of Public Instruction (in some U.S. states).","zh":"（较少见）某些机构名称的缩写，例如美国部分州的“公共教育部门”（Department of Public Instruction）。"},"examples":[{"en":"The DPI announced new guidelines for teacher training.","zh":"DPI 发布了新的教师培训指南。"}]}],"synonyms":["resolution","print resolution","scan resolution","deep packet inspection"],"phonetic":"/ˌdiː piː ˈaɪ/","extraExplanation":["在图像领域，DPI 常和 PPI 混用：PPI（pixels per inch）更常用于“屏幕显示”的像素密度；DPI 更偏“打印/扫描”的点密度。很多软件界面会用 DPI 表示分辨率，但严格说两者不完全一样。","发音通常按字母读：D-P-I。阅读技术文档时要看上下文：打印/扫描谈分辨率多指 dots per inch；网络安全谈 DPI 多指 deep packet inspection。"]}
{"word":"DPM","summary":{"en":"DPM is an abbreviation with several common meanings, such as Deputy Prime Minister, Days Past Due, Direct Part Marking, or Digital Project Manager—its meaning depends on context.","zh":"DPM 是一个多义缩写，常见含义包括“副总理”“逾期天数”“零件直接标识”“数字项目经理”等，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Deputy Prime Minister — a senior government official who supports the Prime Minister and may act in their place.\nExamples: • The DPM met with business leaders. • 她被任命为副总理（DPM）。","zh":"（缩写）副总理（Deputy Prime Minister）——在政府中协助总理、并可能在总理缺席时代行职务的高级官员。\n例：• DPM 与商界领袖会面。• 她被任命为副总理（DPM）。"},"examples":[{"en":"The DPM met with business leaders to discuss new policies.","zh":"副总理（DPM）与商界领袖会面，讨论新政策。"},{"en":"In some countries, the DPM may take charge when the Prime Minister is abroad.","zh":"在一些国家，总理出访时副总理（DPM）可能会负责处理事务。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., business/finance) Days Past Due — the number of days a payment is late.\nExamples: • This invoice is 30 DPM. • 这张账单已逾期 30 天。","zh":"（缩写，商业/财务）逾期天数（Days Past Due）——付款超过到期日的天数。\n例：• This invoice is 30 DPM. • 这张账单已逾期 30 天。"},"examples":[{"en":"The report shows several accounts with high DPM.","zh":"报告显示有几个账户的逾期天数（DPM）很高。"},{"en":"Please reduce DPM by following up with customers earlier.","zh":"请通过更早跟进客户来降低逾期天数（DPM）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., manufacturing) Direct Part Marking — permanently marking a part (often with a laser or dot-peen) for identification/traceability.\nExamples: • The factory uses DPM codes on metal parts. • 工厂在金属零件上使用 DPM 标记。","zh":"（缩写，制造业）零件直接标识（Direct Part Marking）——在零件表面进行永久性标记（常用激光或针刻）以便识别与追溯。\n例：• The factory uses DPM codes on metal parts. • 工厂在金属零件上使用 DPM 标记。"},"examples":[{"en":"DPM helps track parts through the entire supply chain.","zh":"DPM 有助于在整个供应链中追踪零件。"},{"en":"The engineer recommended DPM for better traceability.","zh":"工程师建议使用 DPM 来提高可追溯性。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., tech/work) Digital Project Manager — a person who manages digital projects (websites, apps, online campaigns).\nExamples: • She works as a DPM at a startup. • 她在初创公司担任 DPM。","zh":"（缩写，科技/职场）数字项目经理（Digital Project Manager）——负责网站、应用、线上活动等数字项目的人。\n例：• She works as a DPM at a startup. • 她在初创公司担任 DPM。"},"examples":[{"en":"As a DPM, he coordinates designers, developers, and clients.","zh":"作为 DPM，他协调设计师、开发者和客户。"},{"en":"The DPM set the timeline and managed the budget.","zh":"DPM 制定了时间表并管理预算。"}]}],"synonyms":["Deputy Prime Minister","Days Past Due","Direct Part Marking","Digital Project Manager"],"phonetic":"/ˌdiː piː ˈɛm/","extraExplanation":["“DPM”是多义缩写，具体含义高度依赖语境与领域（政治、财务、制造、互联网职场等）。在邮件或报告里第一次出现时，英语写作常见做法是先写全称再括号标注缩写（例如：Days Past Due (DPM)），以避免歧义。","你可以把原句或你看到“DPM”的场景（国家/行业/句子）发我，我可以帮你准确判断这里到底指哪一种含义。"]}
{"word":"DPMI","summary":{"en":"DPMI is an acronym with multiple possible meanings; common uses include a designated responsible person in documents or “deaths per million inhabitants” in statistics.","zh":"DPMI是一个多义缩写；常见用法包括文件中的“指定负责人/指定人员”，以及统计里的“每百万人死亡数”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation with several meanings; most commonly used in business/legal or corporate contexts to mean “Designated Person(s) / Designated Person-in-charge,” depending on the organization’s wording","zh":"一个有多种解释的缩写；在商业/法律或公司文件中较常见的用法是指“指定人员/负责人”（具体含义取决于机构的正式表述）"},"examples":[{"en":"Please send the report to the DPMI for approval.","zh":"请把报告发给DPMI审批。"},{"en":"If you have questions, contact the DPMI listed on the form.","zh":"如有疑问，请联系表格上列出的DPMI。"}]},{"partOfSpeech":"other","definition":{"en":"(statistics) “deaths per million inhabitants,” a way to compare death rates between places with different population sizes","zh":"（统计）“每百万人死亡数”，用于比较不同人口规模地区的死亡水平"},"examples":[{"en":"The chart compares COVID-19 deaths by DPMI across countries.","zh":"该图表用“每百万人死亡数（DPMI）”比较各国的新冠死亡情况。"},{"en":"DPMI is useful for comparison, but it still needs context such as age and testing.","zh":"DPMI便于比较，但仍需要年龄结构、检测等背景信息。"}]},{"partOfSpeech":"other","definition":{"en":"(various technical fields) a project- or organization-specific acronym; its exact meaning depends on the industry (IT, engineering, healthcare, etc.)","zh":"（多种技术领域）一种项目或机构内部使用的缩写；具体含义取决于行业（IT、工程、医疗等）"},"examples":[{"en":"In this company, DPMI refers to an internal system name.","zh":"在这家公司里，DPMI指的是一个内部系统名称。"},{"en":"Check the glossary—DPMI can mean different things in different departments.","zh":"查一下术语表——DPMI在不同部门可能代表不同意思。"}]}],"synonyms":["abbrev.","acronym"],"phonetic":"/ˌdiː piː ˈɛm aɪ/","extraExplanation":["“DPMI”不是一个像“NASA”那样全球统一的缩写，最可靠的方法是结合你看到它的场景（邮件签名、表格字段名、图表标题、行业报告等）。","如果你把包含DPMI的完整句子/截图发我，我可以根据上下文判断它在你那份材料里具体指什么。"]}
{"word":"DPN","summary":{"en":"DPN most commonly means diabetic peripheral neuropathy, but it can also be an acronym with different meanings depending on context.","zh":"DPN最常见指“糖尿病周围神经病变”，但也可能是其他含义的缩写，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “diabetic peripheral neuropathy,” a common complication of diabetes that damages nerves (usually in the feet and legs), causing numbness, pain, or tingling","zh":"“diabetic peripheral neuropathy（糖尿病周围神经病变）”的缩写；糖尿病常见并发症之一，会损伤神经（多见于足部和小腿），引起麻木、疼痛或刺痛感"},"examples":[{"en":"The doctor screened him for DPN because he reported numbness in his feet.","zh":"因为他说脚发麻，医生给他筛查是否有DPN（糖尿病周围神经病变）。"},{"en":"Good blood sugar control can help slow the progression of DPN.","zh":"控制好血糖有助于减缓DPN的发展。"}]},{"partOfSpeech":"other","definition":{"en":"a set of initials that can stand for different things depending on the field (medicine, business, IT, etc.); you must check the context to know the exact meaning","zh":"一组首字母缩写，在不同领域（医学、商业、IT等）可能代表不同含义；需要根据上下文确定具体指什么"},"examples":[{"en":"In this report, DPN refers to a medical condition, not a company name.","zh":"在这份报告里，DPN指的是一种医学情况，不是公司名称。"},{"en":"What does DPN stand for in your document?","zh":"你这份文件里的DPN具体代表什么？"}]}],"synonyms":["diabetic peripheral neuropathy"],"phonetic":"/diː piː ɛn/","extraExplanation":["在英语里，像DPN这种全大写的缩写通常直接读字母音（D-P-N）。在医疗语境中最常见的是“糖尿病周围神经病变”。如果你是在其他语境（比如课程、公司、技术文档）看到DPN，最好提供一句原文或截图，我可以帮你准确判断是哪一种含义。"]}
{"word":"DPNH","summary":{"en":"DPNH is an older name for NADH, a key electron-carrying coenzyme in metabolism.","zh":"DPNH 是 NADH 的旧称，是代谢中重要的电子载体辅酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An older abbreviation for NADH, the reduced form of NAD (nicotinamide adenine dinucleotide), used as an electron carrier in many cellular reactions.","zh":"NADH 的旧缩写，指 NAD（烟酰胺腺嘌呤二核苷酸）的还原形式；在细胞多种反应中作为“电子载体”参与能量代谢。"},"examples":[{"en":"During respiration, NAD is reduced to DPNH (NADH) when it picks up electrons.","zh":"在细胞呼吸过程中，NAD 获得电子后会被还原成 DPNH（NADH）。"},{"en":"Some older textbooks use DPNH instead of NADH in enzyme reaction diagrams.","zh":"一些较旧的教材在酶反应示意图里会用 DPNH 来代替 NADH。"}]}],"synonyms":["NADH","reduced NAD","reduced diphosphopyridine nucleotide"],"phonetic":"/ˌdiː piː ɛn ˈeɪtʃ/","extraExplanation":["DPN 来自旧称 diphosphopyridine nucleotide（“二磷酸吡啶核苷酸”），早期文献常用 DPN 表示 NAD；加上 H（DPNH）表示“还原态”，也就是今天更常见的 NADH。","现代生物化学与医学文章通常写 NAD/NADH；你在阅读老论文、老版教材或某些实验记录时，可能还会遇到 DPN/DPNH。","不要与 NADPH 混淆：NADPH 是带磷酸基团的另一种辅酶形式，常用于合成代谢与抗氧化体系；而 NADH 更常见于能量产生相关途径。"]}
{"word":"DPNPH","summary":{"en":"DPNPH is an abbreviation used in some labs for DNPH (2,4-dinitrophenylhydrazine), a reagent for testing aldehydes/ketones (carbonyl compounds).","zh":"DPNPH 常被用作 DNPH（2,4-二硝基苯肼）的缩写，是一种用于检验醛、酮等羰基化合物的试剂。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) A laboratory reagent name/label, usually referring to 2,4-dinitrophenylhydrazine (more commonly written as DNPH), used to test for aldehydes and ketones (carbonyl compounds).","zh":"（缩写）实验室试剂名称/标签，通常指 2,4-二硝基苯肼（更常写作 DNPH），用于检验醛和酮等含羰基（C=O）的化合物。"},"examples":[{"en":"We added DPNPH (DNPH) to the sample to check for a carbonyl group.","zh":"我们向样品中加入 DPNPH（DNPH）来检验是否含有羰基。"},{"en":"A yellow or orange solid can form in the DNPH test.","zh":"做 DNPH 试验时可能生成黄色或橙色的固体沉淀。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., less common) A label used in some notes or labs to mean “DNPH reagent” or “Brady’s reagent.”","zh":"（较少见的缩写）在一些课堂笔记或实验室里用作“DNPH 试剂 / Brady 试剂”的标注。"},"examples":[{"en":"The instructor wrote “DPNPH” on the bottle, but the manual calls it DNPH reagent.","zh":"老师在瓶子上写了“DPNPH”，但实验手册称它为 DNPH 试剂。"}]}],"synonyms":["DNPH","2,4-DNPH","2,4-dinitrophenylhydrazine","Brady’s reagent"],"phonetic":"/ˌdiː piː ˌɛn piː ˈeɪtʃ/","extraExplanation":["“DPNPH”不是最标准的写法；在化学里更常见、也更规范的是“DNPH”（2,4-dinitrophenylhydrazine），又叫 Brady’s reagent。你看到的 DPNPH 往往是某个课程、实验室或品牌的内部标记/笔误。","DNPH 试验常用于鉴别：醛/酮与 DNPH 反应生成黄色到橙色的沉淀（腙）。不同化合物的腙熔点可用于进一步鉴别。","安全提示：DNPH 及其溶液可能具有刺激性/危险性（干燥状态下尤其需要谨慎）。务必按实验室安全规范操作与储存。"]}
{"word":"DPP","summary":{"en":"DPP is an acronym most commonly meaning Taiwan’s Democratic Progressive Party, but it can also refer to a public prosecutions official or data parallel processing, depending on context.","zh":"DPP是一个缩写，最常指台湾的民主进步党；也可能指公诉机关负责人或数据并行处理，需依语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Democratic Progressive Party (Taiwan): a major political party in Taiwan, often associated with a pro-democracy platform and a Taiwanese identity-focused stance.","zh":"（台湾）民主进步党：台湾主要政党之一，常与民主改革、强调台湾主体性等立场相关。"},"examples":[{"en":"The DPP won the presidential election in Taiwan.","zh":"民进党在台湾总统选举中获胜。"},{"en":"Some voters support the DPP because of its policies on social reform.","zh":"一些选民支持民进党，因为它在社会改革方面的政策。"}]},{"partOfSpeech":"n.","definition":{"en":"Director of Public Prosecutions: the official in some countries (e.g., the UK, some Commonwealth systems) who oversees public criminal prosecutions.","zh":"（部分国家的）检察署署长／公诉机关负责人：在某些法域（如英国及部分英联邦体系）负责监督公共刑事起诉的官员。"},"examples":[{"en":"The DPP reviewed the evidence before deciding whether to prosecute.","zh":"公诉机关负责人在决定是否起诉前审查了证据。"},{"en":"The case was referred to the DPP for further consideration.","zh":"该案件被提交给公诉机关负责人作进一步考虑。"}]},{"partOfSpeech":"n.","definition":{"en":"Data Parallel Processing: a computing approach where many processors perform the same operation on different parts of data at the same time.","zh":"数据并行处理：一种计算方法，让多个处理器同时对不同数据片段执行相同操作。"},"examples":[{"en":"DPP can speed up large data analysis by running tasks in parallel.","zh":"数据并行处理可以通过并行运行任务来加速大规模数据分析。"},{"en":"Modern GPUs are often used for DPP workloads.","zh":"现代GPU常用于数据并行处理的工作负载。"}]}],"synonyms":["Democratic Progressive Party","Director of Public Prosecutions","Data Parallel Processing"],"phonetic":"/ˌdiː piː ˈpiː/","extraExplanation":["“DPP”是缩写，具体含义高度依赖语境：谈台湾政治时最常指“Democratic Progressive Party（民主进步党）”；谈法律新闻（尤其英国体系）可能指“Director of Public Prosecutions”；谈计算机/高性能计算时可能指“Data Parallel Processing”。","读到“DPP”时，可以看上下文关键词来判断：如“election / Taiwan / president”多半是政党；“prosecute / court / evidence”多半是检察系统；“parallel / GPU / processing / data”多半是计算概念。"]}
{"word":"DPS","summary":{"en":"DPS most commonly means “damage per second” in gaming, but it can also mean “Department of Public Safety” or “Deputy Prime Minister,” depending on context.","zh":"DPS最常见的含义是游戏里的“每秒伤害”，也可能指“公共安全部门”或“副总理”，需根据语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(video games) “Damage per second”: a measure of how much damage a character, weapon, or team can deal each second.","zh":"（电子游戏）“每秒伤害”：衡量角色、武器或队伍每秒能造成多少伤害的指标。"},"examples":[{"en":"This weapon has high DPS, so it’s great for bosses.","zh":"这把武器DPS很高，所以打Boss很强。"},{"en":"Our team needs more DPS to finish the fight faster.","zh":"我们队需要更高的DPS，才能更快打完这场战斗。"},{"en":"She plays a DPS role rather than a healer.","zh":"她玩的是DPS位，而不是治疗位。"}]},{"partOfSpeech":"n.","definition":{"en":"(jobs/organizations) “Department of Public Safety”: a government department responsible for public security and emergency services in some places.","zh":"（机构/政府）“公共安全部/公共安全局”（Department of Public Safety）：在一些地区负责治安与应急事务的政府部门。"},"examples":[{"en":"He works for the DPS and handles emergency management.","zh":"他在DPS工作，负责应急管理。"},{"en":"The DPS issued a safety warning about the storm.","zh":"DPS发布了关于暴风雨的安全警报。"}]},{"partOfSpeech":"n.","definition":{"en":"(politics) “Deputy Prime Minister”: the second-in-command to a country’s prime minister in some governments.","zh":"（政治）“副总理”（Deputy Prime Minister）：在一些国家/政府中协助总理、位居第二的官员。"},"examples":[{"en":"The DPS attended the summit on behalf of the Prime Minister.","zh":"副总理代表总理出席了峰会。"},{"en":"She was appointed as DPS after the election.","zh":"选举后她被任命为副总理。"}]}],"synonyms":["damage per second (gaming)","damage output (gaming context)","Department of Public Safety (government context)","Deputy Prime Minister (political context)"],"phonetic":"ˌdiː piː ˈɛs","extraExplanation":["“DPS”是缩写，具体含义高度依赖语境：聊天/攻略里多指游戏里的“每秒伤害”或“输出位”；新闻或官方文件里更可能是某个地区的“公共安全部门”；国际政治语境里可能指“副总理”。","口语里常直接说字母：D-P-S。写作时第一次出现最好写全称（如 damage per second），后面再用DPS。"]}
{"word":"DPSK","summary":{"en":"DPSK usually means Differential Phase-Shift Keying, a digital modulation technique based on phase changes between consecutive symbols.","zh":"DPSK通常指“差分相移键控”，是一种通过相邻符号间相位变化来传输数据的数字调制技术。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Differential Phase-Shift Keying: a digital modulation method that sends data by changing the phase of a radio/wireless signal relative to the previous symbol (so it can work without an absolute phase reference).","zh":"（缩写）差分相移键控：一种数字调制方式，通过让无线/射频信号的相位相对前一个符号发生变化来传输数据（因此不一定需要绝对相位参考）。"},"examples":[{"en":"The sensor uses DPSK modulation to transmit data reliably in a noisy environment.","zh":"该传感器使用DPSK调制，在噪声环境中可靠传输数据。"},{"en":"In this system, DPSK is simpler to decode than some coherent PSK methods.","zh":"在这个系统里，DPSK比某些相干PSK方式更容易解调。"},{"en":"Engineers compared BPSK and DPSK to see which one fits the power budget.","zh":"工程师比较了BPSK和DPSK，看哪种更符合功耗预算。"}]}],"synonyms":["differential PSK","DBPSK","DQPSK"],"phonetic":"/ˌdiː piː ˈɛs keɪ/","extraExplanation":["DPSK常见于通信与信号处理语境（教材、论文、无线芯片规格书）。核心思想是“差分编码”：接收端看相邻符号的相位变化来判定比特，而不是依赖精确的载波相位同步。","相关变体常写作DBPSK（差分二进制相移键控）和DQPSK（差分四相相移键控）。在工程上它通常更易实现，但在同等条件下误码性能往往略逊于相干PSK。","如果你是在其他领域看到DPSK，它也可能是不同短语的缩写；告诉我出现它的句子或领域（如无线通信/教育/组织名称），我可以帮你精准判定。"]}
{"word":"dpt","summary":{"en":"DPT (or dpt) is usually an abbreviation meaning “department,” and in some contexts it can mean “depth” or “diopter(s).”","zh":"DPT（或 dpt）通常是“department（部门）”的缩写；在某些语境中也可表示“depth（深度）”或“diopter(s)（屈光度）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbreviation) department; used in names of organizations, school units, or government offices.","zh":"（缩写）department（部门）；常用于机构、学校或政府单位名称中。"},"examples":[{"en":"Please send the form to the HR Dpt.","zh":"请把表格发到人力资源部（HR Dpt.）。"},{"en":"She works in the marketing dpt.","zh":"她在市场部工作。"}]},{"partOfSpeech":"other","definition":{"en":"(Abbreviation) depth; used on maps, technical drawings, or measurements to mean how deep something is.","zh":"（缩写）depth（深度）；用于地图、技术图纸或测量中表示“有多深”。"},"examples":[{"en":"The chart shows a dpt of 30 meters near the shore.","zh":"图表显示靠岸处水深（dpt）为30米。"},{"en":"Record the dpt at each point.","zh":"在每个点记录深度（dpt）。"}]},{"partOfSpeech":"other","definition":{"en":"(Abbreviation, optometry) diopter(s), a unit that measures the strength of a lens.","zh":"（缩写，验光/眼科）diopter(s)（屈光度），衡量镜片度数的单位。"},"examples":[{"en":"Her prescription is −2.00 DPT in both eyes.","zh":"她的处方是双眼−2.00屈光度（DPT）。"},{"en":"The lens power is measured in dpt.","zh":"镜片度数用屈光度（dpt）来表示。"}]}],"synonyms":["dept. (for department)","depth (full form for dpt)","diopter (full form for DPT in optometry)"],"phonetic":"/ˌdiː piː ˈtiː/","extraExplanation":["“dpt/Dpt.”不是一个固定的标准词条，更常见于特定领域或某个机构的内部写法。正式英文里写“department”通常用“dept.”（最常见的标准缩写）。","如果你是在某份文件里看到“DPT”，也可能是专有名词缩写（如 Doctor of Physical Therapy 物理治疗博士）。需要结合上下文判断。"]}
{"word":"DPW","summary":{"en":"DPW most commonly means “days per week.”","zh":"DPW最常见的意思是“days per week（每周几天）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “days per week,” used to describe how many days something happens in a typical week (often in schedules, work plans, fitness plans, or medication instructions).","zh":"“days per week（每周几天）”的缩写，用来说明一件事在一周内发生/安排的天数（常见于排班、工作计划、健身计划或用药说明）。"},"examples":[{"en":"I work 3 DPW in the office and the rest from home.","zh":"我每周有3天在办公室上班，其余时间在家办公。"},{"en":"The training plan is 5 DPW, with two rest days.","zh":"这个训练计划是每周5天训练，另外两天休息。"},{"en":"Take the medicine 2 DPW unless your doctor says otherwise.","zh":"除非医生另有说明，否则每周服药2天。"}]}],"synonyms":["days per week","days/week","per week"],"phonetic":"/ˌdiː piː ˈdʌbəl.juː/","extraExplanation":["“DPW”也可能在不同领域代表别的意思（例如某些公司的部门名、技术术语或网络社群用语）。如果你能提供上下文（在哪看到的、句子或行业），我可以帮你确定最准确的含义。"]}
