{"word":"DQ","summary":{"en":"“DQ” is an abbreviation that commonly means disqualification (sports), Dairy Queen (the restaurant), or data quality (business/tech).","zh":"“DQ”是一个缩写，常见含义包括：取消资格（体育）、Dairy Queen 冰淇淋连锁店，以及数据质量（商业/技术）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) disqualification; being removed from a game/contest because of a rule violation.","zh":"（缩写）取消资格；因违规而被判出局/失去参赛资格。"},"examples":[{"en":"The runner was DQ’d for a false start.","zh":"那位跑者因为抢跑被判取消资格。"},{"en":"Our team got a DQ after using an ineligible player.","zh":"我们队因为使用不符合资格的球员而被判取消资格。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Dairy Queen, a fast-food and ice-cream chain (often written as DQ).","zh":"（缩写）Dairy Queen（常写作 DQ），一家快餐与冰淇淋连锁店。"},"examples":[{"en":"Let’s stop at DQ for ice cream.","zh":"我们去 DQ 买个冰淇淋吧。"},{"en":"There’s a DQ right off the highway.","zh":"高速路出口旁边就有一家 DQ。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) data quality; how accurate, complete, and reliable data is (common in business/tech).","zh":"（缩写）数据质量；指数据的准确性、完整性与可靠性（常见于商业/技术语境）。"},"examples":[{"en":"We need to improve DQ before building the dashboard.","zh":"在做数据看板之前，我们需要提升数据质量。"},{"en":"Poor DQ can lead to bad decisions.","zh":"数据质量差会导致错误决策。"}]}],"synonyms":["disqualification (for sports sense)","Dairy Queen (brand name)","data quality"],"phonetic":"/di kju/","extraExplanation":["“DQ”在不同领域含义差异很大：体育新闻/比赛结果里常指“disqualification（取消资格）”；在北美日常对话里，看到大写“DQ”很常指冰淇淋店 Dairy Queen；在职场邮件或数据团队讨论中也常见“DQ = data quality”。判断含义主要看上下文（比赛、餐饮、数据/报表等）。"]}
{"word":"DQDB","summary":{"en":"“DQDB” is an uncommon abbreviation in English; its meaning depends on context.","zh":"“DQDB”在英语中不是常见固定词义的缩写；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/initialism. “DQDB” is not a widely standard English word, so its meaning depends on the context (e.g., a company name, a project code, a username, or an internal acronym).","zh":"一个缩写/首字母缩略词。“DQDB”并不是常见的标准英语单词，具体含义需要结合使用场景（例如公司名、项目代号、用户名或内部简称）。"},"examples":[{"en":"What does DQDB stand for in this document?","zh":"在这份文件里，DQDB 代表什么？"},{"en":"I saw “DQDB” in a file name, but there was no explanation.","zh":"我在文件名里看到了“DQDB”，但没有任何说明。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/diː kjuː diː biː/","extraExplanation":["英语里很多大写字母组合都是“首字母缩写”（initialism）或“缩略词”（acronym）。像 DQDB 这种不常见的组合，通常需要你提供它出现的领域（例如游戏、聊天、公司业务、学术、软件日志）或完整句子，我才能更准确地解释。","读法上一般按字母逐个读：D-Q-D-B（而不是当作一个完整单词来读）。如果它来自某个特定组织/产品，也可能有固定的官方释义。"]}
{"word":"DQL","summary":{"en":"DQL usually means “Data Query Language,” the part of a database language used to query (ask for) data.","zh":"DQL 通常指“数据查询语言”，也就是数据库语言中用来查询（获取）数据的部分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing) Data Query Language: a type of computer language used to ask a database for information (to “query” data).","zh":"（计算机）数据查询语言：一种用来向数据库“提问”、获取信息（查询数据）的语言。"},"examples":[{"en":"SQL is often described as a DQL because it lets you query data from tables.","zh":"SQL 常被描述为一种 DQL，因为它可以从数据表中查询数据。"},{"en":"The DQL part of SQL includes commands like SELECT.","zh":"SQL 里的 DQL 部分包括像 SELECT 这样的命令。"}]}],"synonyms":["data query language","query language","SQL (often, in practice)"],"phonetic":"/diː kjuː ɛl/","extraExplanation":["DQL 通常不是一门独立的语言，而是用来描述数据库语言中的“查询”部分；最常见的例子就是 SQL 的 SELECT 查询。","你可能还会看到相关缩写：DDL（Data Definition Language，数据定义语言，用于建表/改表等）、DML（Data Manipulation Language，数据操作语言，用于插入/更新/删除）。不同教材对这些分类的划分有时会略有差异。"]}
{"word":"DQM","summary":{"en":"DQM most commonly means Data Quality Management: improving and maintaining the quality of data.","zh":"DQM 最常见指数据质量管理：提升并维护数据的质量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Data Quality Management: the process of making sure data is accurate, complete, consistent, and usable (often in databases, analytics, and business systems).","zh":"数据质量管理：确保数据准确、完整、一致且可用的过程（常见于数据库、数据分析和企业系统）。"},"examples":[{"en":"Our team started DQM to reduce errors in customer records.","zh":"我们团队开始做 DQM，以减少客户记录里的错误。"},{"en":"Good DQM includes rules for cleaning, validating, and monitoring data.","zh":"良好的 DQM 包括数据清洗、校验与监控的规则。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Design Quality Management: managing the quality of a product’s design so it meets requirements and user needs.","zh":"（较少见）设计质量管理：管理产品设计的质量，使其满足要求和用户需求。"},"examples":[{"en":"In medical devices, DQM helps ensure the design meets safety standards.","zh":"在医疗器械领域，DQM 有助于确保设计符合安全标准。"}]},{"partOfSpeech":"n.","definition":{"en":"(Technical, less common) Discrete Quadrature Method: a numerical method used in engineering/science calculations (for example, radiation or transport problems).","zh":"（技术用语，较少见）离散求积法：工程与科学计算中的一种数值方法（例如用于辐射或输运问题）。"},"examples":[{"en":"The paper compares DQM with other numerical methods.","zh":"这篇论文将 DQM 与其他数值方法进行比较。"}]}],"synonyms":["data quality management (spelled out)","data governance (related)","data cleansing (related)"],"phonetic":"/ˌdiː kjuː ˈɛm/","extraExplanation":["“DQM”是缩写，具体含义高度依赖语境。最常见于商业与数据领域，指 Data Quality Management；在工程论文里也可能指 Discrete Quadrature Method。阅读时可通过上下文关键词判断：如 data/records/analytics 常对应数据质量管理；如 numerical method/radiation/transport 常对应数值方法。","发音通常是逐字母读：D-Q-M。"]}
{"word":"DQPSK","summary":{"en":"DQPSK is a digital modulation technique that encodes data in changes of phase between symbols.","zh":"DQPSK 是一种数字调制技术，用相邻符号之间的相位变化来编码数据。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Acronym) Differential Quadrature Phase-Shift Keying: a digital modulation method that sends data by changing the phase of a carrier signal, using differences between successive symbols (rather than an absolute reference phase).","zh":"（缩写）差分正交相移键控：一种数字调制方式，通过改变载波信号的相位来传输数据，并用相邻符号之间的“相位变化量”（而不是绝对相位）来表示信息。"},"examples":[{"en":"DQPSK is often chosen when the receiver cannot maintain a stable phase reference.","zh":"当接收端难以保持稳定的相位参考时，常会选择使用 DQPSK。"},{"en":"The system uses DQPSK modulation to improve robustness in noisy channels.","zh":"该系统使用 DQPSK 调制，以提升在噪声信道中的鲁棒性。"},{"en":"Compared with QPSK, DQPSK can simplify carrier phase recovery at the cost of some performance.","zh":"与 QPSK 相比，DQPSK 可以简化载波相位恢复，但通常会牺牲一些性能。"}]}],"synonyms":["Differential QPSK","DQPSK modulation","differential quadrature phase-shift keying"],"phonetic":"/ˌdiːkjuːpiːˌɛsˈkeɪ/","extraExplanation":["DQPSK 常见于通信与无线系统语境（如调制/解调、频谱效率、抗噪声能力等）。它“差分”的核心思想是：信息编码在相位的变化上，因此对初始相位不那么敏感。","写作上，DQPSK 常被当作专业缩写直接使用；正式文档中第一次出现时通常会先写全称 Differential Quadrature Phase-Shift Keying（DQPSK）。"]}

