{"word":"DS","summary":{"en":"“DS” is an abbreviation; common meanings include Nintendo DS, data science, direct supervisor, and Doctor of Science.","zh":"“DS”是缩写；常见含义包括任天堂DS、数据科学、直属主管和理学博士等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nintendo DS (a handheld video game console made by Nintendo).","zh":"任天堂 DS（任天堂推出的掌上游戏机）。"},"examples":[{"en":"I used to play Pokémon on my DS after school.","zh":"我以前放学后会用 DS 玩宝可梦。"},{"en":"Do you still have your old Nintendo DS?","zh":"你还留着旧的任天堂 DS 吗？"}]},{"partOfSpeech":"n.","definition":{"en":"data science (the field of using data to understand problems and make predictions; often used in tech/business).","zh":"数据科学（用数据分析来理解问题并做预测的领域；常见于科技/商业语境）。"},"examples":[{"en":"She’s studying DS to become a data analyst.","zh":"她在学 DS，想成为数据分析师。"},{"en":"Our company is hiring for DS roles.","zh":"我们公司正在招聘数据科学（DS）相关岗位。"}]},{"partOfSpeech":"n.","definition":{"en":"direct supervisor (the person who manages you at work; used in HR/work emails).","zh":"直属主管/直接上级（在职场或人事邮件中常用）。"},"examples":[{"en":"Please ask your DS to approve the request.","zh":"请让你的直属主管（DS）批准这个申请。"},{"en":"I’ll copy my DS on the email.","zh":"我会在邮件里抄送我的直属主管（DS）。"}]},{"partOfSpeech":"n.","definition":{"en":"Doctor of Science (an advanced academic degree, depending on the country/institution).","zh":"理学博士（某些国家/学校设立的高级学位）。"},"examples":[{"en":"He earned a DS in engineering.","zh":"他获得了工程领域的理学博士（DS）学位。"},{"en":"The DS degree is less common than a PhD in some places.","zh":"在一些地区，DS 学位不如 PhD 常见。"}]}],"synonyms":["Nintendo DS","data science","direct supervisor","Doctor of Science"],"phonetic":"/di ɛs/","extraExplanation":["“DS”是缩写，含义高度依赖语境：游戏圈最常指“Nintendo DS”；科技招聘/学习场景常指“Data Science”；公司内部沟通里可能指“Direct Supervisor”。如果你告诉我你看到“DS”的句子或领域（游戏/工作/学习/医学等），我可以给出最准确的解释与用法。"]}
{"word":"Ds","summary":{"en":"“Ds/DS” is usually an abbreviation; its meaning depends on context (e.g., Nintendo DS or data science).","zh":"“Ds/DS”通常是缩写，具体含义取决于语境（如任天堂 DS 或数据科学）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) a short written form of different phrases that start with the letters D and S (the exact meaning depends on the context), such as “Nintendo DS” or “data science (DS).”","zh":"（缩写）以 D 和 S 开头的不同词组的简写；具体含义取决于语境，例如“任天堂掌机 Nintendo DS”或“数据科学（DS）”。"},"examples":[{"en":"I still have my old Nintendo DS at home.","zh":"我家里还留着我的老任天堂 DS。"},{"en":"She’s studying DS and wants to work in machine learning.","zh":"她在学 DS（数据科学），想做机器学习相关工作。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., informal) short for “D’s,” meaning something belonging to or associated with a person or thing named (or labeled) “D.”","zh":"（缩写/非正式）“D’s”的简写，表示“属于/与名为（或标记为）D 的人或事物有关”。"},"examples":[{"en":"We met at D’s place after class.","zh":"下课后我们在 D 的住处见面。"},{"en":"Have you seen Ds notes from the meeting?","zh":"你看到 D 的会议笔记了吗？"}]}],"synonyms":["abbrev.","short form","initialism"],"phonetic":"/ˌdiːˈɛs/","extraExplanation":["“DS/Ds”本身不是一个固定单词，更常见的是缩写（abbreviation）。最稳妥的理解方式是：先看你所处的领域或句子主题（游戏、学习专业、公司部门、姓名首字母等），再确定它具体代表什么。","如果你是想查某个特定含义（例如 Nintendo DS、Data Science、Delivery Service、District Superintendent 等），把包含“Ds/DS”的完整句子发我，我可以按你的语境给出最准确的释义和用法。"]}
{"word":"ds","summary":{"en":"“DS” is an abbreviation meaning different things in different contexts (e.g., Data Science, Nintendo DS, Doctor of Science).","zh":"“DS”是缩写，在不同语境中含义不同（如数据科学、任天堂DS、理学博士等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) the letters “D” and “S,” used as an abbreviation for different phrases depending on context.","zh":"（缩写）字母“D”和“S”的组合；在不同语境中可代表不同含义。"},"examples":[{"en":"What does “DS” stand for in this document?","zh":"在这份文件里，“DS”代表什么？"},{"en":"Please write DS in capital letters.","zh":"请把 DS 用大写字母写。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., tech) Data Science.","zh":"（缩写，科技）数据科学。"},"examples":[{"en":"She’s studying DS and machine learning.","zh":"她在学习数据科学和机器学习。"},{"en":"DS skills include statistics and programming.","zh":"数据科学技能包括统计和编程。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., gaming) Nintendo DS, a handheld game console.","zh":"（缩写，游戏）任天堂 DS（掌上游戏机）。"},"examples":[{"en":"I used to play Pokémon on my DS.","zh":"我以前在我的 DS 上玩宝可梦。"},{"en":"He brought his DS on the trip.","zh":"他旅行时带了他的 DS。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., academia) Doctor of Science (a degree in some countries/schools).","zh":"（缩写，学术）理学博士（某些国家/学校使用的学位名称）。"},"examples":[{"en":"Her signature includes “DS” after her name.","zh":"她的签名在名字后写了“DS”。"},{"en":"He earned a DS in engineering.","zh":"他获得了工程方向的理学博士学位。"}]}],"synonyms":["abbrev. (abbreviation)"],"phonetic":"/ˌdiː ˈɛs/","extraExplanation":["“DS”本身不是一个固定单词，更多是缩写：在聊天里常见的是 Data Science；在游戏语境常指 Nintendo DS；在学术或简历里可能指 Doctor of Science。","如果你告诉我你看到“ds”的具体句子或领域（聊天/课程/游戏/医学等），我可以给出最准确的解释。"]}
{"word":"DSA","summary":{"en":"DSA most commonly means Data Structures and Algorithms in programming; it can also mean Digital Signature Algorithm in cryptography.","zh":"DSA 最常见指编程中的“数据结构与算法”；在密码学中也可指“数字签名算法”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Computing, education) Data Structures and Algorithms; a core topic in programming that focuses on organizing data and designing efficient step-by-step solutions.","zh":"（计算机/教育）数据结构与算法；编程中的核心主题，研究如何组织数据以及如何设计高效的解题步骤。"},"examples":[{"en":"I’m practicing DSA every day to prepare for coding interviews.","zh":"我每天练 DSA 来准备编程面试。"},{"en":"This course covers DSA basics like arrays, linked lists, and sorting.","zh":"这门课讲 DSA 基础，比如数组、链表和排序。"}]},{"partOfSpeech":"other","definition":{"en":"(Cryptography) Digital Signature Algorithm; a cryptographic algorithm used to create and verify digital signatures.","zh":"（密码学）数字签名算法；用于生成和验证数字签名的密码算法。"},"examples":[{"en":"DSA can be used to verify that a message really came from the sender.","zh":"DSA 可用于验证消息确实来自发送者。"},{"en":"Our system supports RSA and DSA for digital signatures.","zh":"我们的系统支持 RSA 和 DSA 的数字签名。"}]}],"synonyms":["Data Structures and Algorithms","Digital Signature Algorithm"],"phonetic":"/ˌdiː ɛs ˈeɪ/","extraExplanation":["在日常英语里，DSA 最常见于程序员语境，尤其是“刷题/面试准备”（coding interviews）。别人说 “I’m doing DSA” 通常指在练数据结构与算法，而不是密码学里的 DSA。","作为缩写，DSA 一般读作字母：D-S-A。写作时常用全大写；在正式文档里第一次出现可能会写出全称。"]}
{"word":"DSAB","summary":{"en":"DSAB is an initialism; its meaning depends on context and it’s usually read letter by letter.","zh":"DSAB 是一个首字母缩写，含义依语境而定，通常按字母逐个读。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (initialism) whose meaning depends on the field or context; it is not a widely standardized English word on its own","zh":"一个缩写/首字母缩略词，具体含义取决于领域与语境；本身并不是英语里普遍固定的词"},"examples":[{"en":"What does DSAB stand for in this report?","zh":"这份报告里的 DSAB 是什么的缩写？"},{"en":"I saw “DSAB” in a chat message, but I couldn’t tell what it meant without more context.","zh":"我在聊天消息里看到“DSAB”，但没有更多语境就看不出它是什么意思。"}]},{"partOfSpeech":"other","definition":{"en":"(common style) pronounced by saying each letter: D-S-A-B","zh":"（常见读法）按字母逐个读：D-S-A-B"},"examples":[{"en":"We usually say DSAB as “D-S-A-B,” not as one word.","zh":"我们通常把 DSAB 读作“D-S-A-B”，而不是当作一个完整单词来读。"}]}],"synonyms":["initialism","abbreviation","acronym (general term)"],"phonetic":"/ˌdiː ɛs eɪ ˈbiː/","extraExplanation":["“DSAB”在不同圈子里可能对应不同短语（例如课程名、项目代号、机构/系统名等）。如果你把它出现的完整句子、领域（学校/工作/游戏/医学/工程等）或截图发出来，我可以更准确地判断它的具体含义与最自然的翻译。"]}
{"word":"DSBAM","summary":{"en":"DSBAM is an initialism (letters) whose meaning depends on context; it isn’t a common dictionary word.","zh":"DSBAM 是一个首字母缩写，含义取决于上下文；它不是常见词典词条。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A set of initials (an initialism). It is not a standard English word, and its meaning depends on the specific context (e.g., an organization name, a project code, or a slang abbreviation).","zh":"一组首字母缩写（字母缩略语）。它不是标准英语单词，具体含义取决于使用场景（如机构名称、项目代号或网络缩写）。"},"examples":[{"en":"I saw “DSBAM” in the email subject line—what does it stand for?","zh":"我在邮件标题里看到“DSBAM”——它代表什么？"},{"en":"DSBAM isn’t in most dictionaries, so you’ll need context to understand it.","zh":"DSBAM 不在大多数词典里，所以需要结合上下文才能理解。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌdiːˌɛsˌbiːˌeɪˈɛm/","extraExplanation":["英语里很多缩写是用“逐个字母读”的（initialism），例如 FBI /ˌɛfbiːˈaɪ/；也有一些会读成一个词（acronym），例如 NASA /ˈnæsə/。DSBAM 更像前者，通常会按字母读。","如果你把 DSBAM 出现的完整句子、领域（学校/公司/游戏/聊天）、或它前后相关内容发我，我可以更准确地帮你还原它最可能的全称与含义。"]}
{"word":"DSC","summary":{"en":"DSC is a common abbreviation with multiple meanings; the exact meaning depends on the field (camera, lab science, or display/video tech).","zh":"DSC 是常见缩写，含义因领域而异（相机、实验室材料分析、或显示/视频技术等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(technology) Digital Still Camera; a camera that takes digital photos (often abbreviated in product specs).","zh":"（科技）数码静态相机；用于拍摄数码照片的相机（常见于产品参数中的缩写）。"},"examples":[{"en":"This phone supports an external DSC via USB.","zh":"这款手机支持通过 USB 连接外置 DSC（数码相机）。"},{"en":"Early DSC models stored photos on memory cards with very small capacity.","zh":"早期的 DSC 机型使用容量很小的存储卡来保存照片。"}]},{"partOfSpeech":"n.","definition":{"en":"(science) Differential Scanning Calorimetry; a lab method used to measure how a material absorbs or releases heat as temperature changes.","zh":"（科学）差示扫描量热法；一种实验室方法，用于测量材料在温度变化时吸收或释放热量的情况。"},"examples":[{"en":"We used DSC to find the melting point of the polymer.","zh":"我们用 DSC 测定了该聚合物的熔点。"},{"en":"The DSC curve shows an exothermic peak during curing.","zh":"DSC 曲线显示在固化过程中出现了放热峰。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing/video) Display Stream Compression; a standard that compresses display video to reduce bandwidth with minimal visible quality loss.","zh":"（计算机/视频）显示流压缩；一种在尽量不影响画质的情况下压缩显示视频、降低带宽需求的标准。"},"examples":[{"en":"To run 4K at high refresh rates, the monitor may rely on DSC.","zh":"要以高刷新率运行 4K，显示器可能会依赖 DSC。"},{"en":"Some GPUs support DSC over DisplayPort.","zh":"一些显卡支持通过 DisplayPort 使用 DSC。"}]}],"synonyms":["abbrev.","initialism"],"phonetic":"/ˌdiː ɛs ˈsiː/","extraExplanation":["“DSC”是缩写，在不同领域含义差异很大。阅读资料或产品规格时，最好根据上下文判断：相机/摄影常指 Digital Still Camera；材料/化学实验常指 Differential Scanning Calorimetry；显示器/显卡/DP 规格常指 Display Stream Compression。","读法通常是逐字母读：D-S-C（美式 IPA：/ˌdiː ɛs ˈsiː/）。"]}
{"word":"Dschagga","summary":{"en":"Dschagga is a less common (often German-influenced) spelling for Chagga: the people near Mount Kilimanjaro and their language(s), often called Kichagga.","zh":"Dschagga 常是受德语影响的拼写，对应英语更常见的 Chagga，指乞力马扎罗山附近的查加人以及他们的语言（常称 Kichagga）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (ethnic group) living mainly on the slopes of Mount Kilimanjaro in northern Tanzania; also spelled **Chagga**","zh":"（主要居住在坦桑尼亚北部乞力马扎罗山坡的）查加人／恰加人；亦作 **Chagga**"},"examples":[{"en":"The Dschagga (Chagga) are one of the major ethnic groups near Mount Kilimanjaro.","zh":"查加人（Dschagga／Chagga）是乞力马扎罗山附近较重要的族群之一。"},{"en":"She studied farming traditions among the Dschagga communities.","zh":"她研究了查加人社区的农耕传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bantu language(s) spoken by the Chagga people; often called **Kichagga** in linguistic contexts","zh":"查加人所使用的班图语（群）；在语言学语境中常称 **Kichagga（基查加语）**"},"examples":[{"en":"He recorded folk stories in Dschagga (Kichagga).","zh":"他用查加语（Kichagga）记录了民间故事。"},{"en":"Some words in Dschagga show similarities to Swahili.","zh":"查加语的一些词与斯瓦希里语有相似之处。"}]}],"synonyms":["Chagga","Wachagga","Kichagga"],"phonetic":"/ˈtʃɑɡə/","extraExplanation":["“Dschagga”多见于德语资料中的拼写方式：德语用“Dsch-”来表示类似英语“j/ch”的音。英语里更常用拼写是“Chagga”。","在东非语境中也可能看到复数形式“Wachagga”（查加人，斯瓦希里语前缀 wa- 表示“人们”）。"]}
{"word":"Dschubba","summary":{"en":"Dschubba is the traditional name of Delta Scorpii, a star in the constellation Scorpius.","zh":"Dschubba是天蝎座δ（Delta Scorpii）的传统星名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a star name: Dschubba, the traditional name for Delta Scorpii (δ Scorpii), a bright star in the constellation Scorpius.","zh":"一个恒星名：Dschubba（德舒巴），天蝎座δ（Delta Scorpii）的传统名称，是天蝎座中较亮的一颗星。"},"examples":[{"en":"On a clear summer night, you can find Dschubba near the head of Scorpius.","zh":"在晴朗的夏夜，你可以在天蝎座“头部”附近找到Dschubba（德舒巴）。"},{"en":"The star Dschubba is also listed in catalogs as Delta Scorpii (δ Sco).","zh":"Dschubba这颗星在星表中也会被标作天蝎座δ（Delta Scorpii，δ Sco）。"}]}],"synonyms":["Delta Scorpii","δ Scorpii","δ Sco"],"phonetic":"ˈdʒʌbə","extraExplanation":["“Dschubba”是传统星名，多认为源自阿拉伯语词根（与“额头/前部”之类的含义相关），经由欧洲语言转写而形成不同拼法。天文学中常同时使用传统星名与拜耳命名（如Delta Scorpii）。"]}
{"word":"dschubba","summary":{"en":"“dschubba” usually refers to a traditional loose robe (jubba/jubbah), often spelled this way in German contexts.","zh":"“dschubba”通常指一种传统的宽松长袍（jubba/jubbah），这种拼写多见于德语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, loose outer robe or coat worn in parts of the Middle East and North Africa (often a transliteration of Arabic “jubba/jubbah”).","zh":"（中东和北非部分地区穿的）长而宽松的外袍/外衣；常见于对阿拉伯语“jubba/jubbah”的音译写法。"},"examples":[{"en":"In the market, the traveler bought a simple dschubba to wear in the evening breeze.","zh":"在集市上，那位旅行者买了一件朴素的dschubba，晚上起风时穿。"},{"en":"The museum display included a dschubba made of wool with traditional embroidery.","zh":"博物馆展柜里有一件羊毛制的dschubba，上面有传统刺绣。"}]},{"partOfSpeech":"other","definition":{"en":"a less common spelling seen in German-language contexts for the same garment (you may also see “Jubba/Jubbah”).","zh":"在德语语境中较少见的一种拼写形式，指同一种衣物（也常写作“Jubba/Jubbah”）。"},"examples":[{"en":"Some sources spell it as dschubba, while others use jubba.","zh":"有些资料写作dschubba，另一些则用jubba。"}]}],"synonyms":["robe","cloak","outer garment","tunic"],"phonetic":"/ˈdʒʊbə/","extraExplanation":["“Dschubba”常见于德语对外来词的转写：德语用“dsch”来表示接近英语 /dʒ/ 的音（类似j的发音）。该词多被认为来自阿拉伯语“جُبَّة‎ (jubba/jubbah)”，指一种宽松外袍。不同地区与文献中拼写会变化（如jubba、jubbah）。"]}
{"word":"DSCS","summary":{"en":"DSCS is an acronym most commonly referring to the U.S. Defense Satellite Communications System, but it may have other meanings depending on context.","zh":"DSCS 是一个缩写，最常见指美国“国防卫星通信系统”，但也可能因上下文不同而有其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Defense Satellite Communications System: a U.S. military satellite network used to provide secure communications.","zh":"（美国）国防卫星通信系统：用于提供安全通信的军用卫星网络。"},"examples":[{"en":"The report mentioned DSCS as part of the military’s satellite communications infrastructure.","zh":"报告提到 DSCS 是军方卫星通信基础设施的一部分。"},{"en":"DSCS satellites supported long-distance communications in remote areas.","zh":"DSCS 卫星支持在偏远地区的远距离通信。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation that can also mean other things depending on the field (e.g., a specific organization, system, or course title).","zh":"一个缩写，在不同领域可能代表不同含义（例如某个机构、系统或课程名称等）。"},"examples":[{"en":"In your document, what does DSCS stand for? The meaning depends on context.","zh":"在你的文件里，DSCS 代表什么？它的含义取决于上下文。"},{"en":"DSCS can be a technical acronym, so it’s often defined the first time it appears.","zh":"DSCS 可能是技术类缩写，因此通常会在首次出现时先给出全称。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/ˌdiː ɛs siː ˈɛs/","extraExplanation":["DSCS 作为缩写并不只有一个固定含义；在军事语境里最常见的是 “Defense Satellite Communications System”。如果你能提供它出现的句子、行业（如通信/计算机/学校课程/公司名），我可以帮你确认最准确的释义。"]}
{"word":"DSD","summary":{"en":"DSD usually means “Differences of Sex Development” (medical) or “Direct Stream Digital” (audio); it can also be a field-specific acronym.","zh":"DSD通常指“性别发育差异”（医学）或“直接流数字”（音频）；也可能是某个领域的特定缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Differences of Sex Development” (also called “Disorders of Sex Development” in older usage): a group of medical conditions where a person’s chromosomes, hormones, or reproductive anatomy develop in ways that don’t fit typical male/female patterns.","zh":"“Differences of Sex Development（性别发育差异）”的缩写（较旧说法也写作“Disorders of Sex Development”）：指一类医学状况，个体的染色体、激素或生殖解剖发育方式不符合典型的男性/女性模式。"},"examples":[{"en":"The clinic has a specialized team for patients with DSD.","zh":"这家诊所有一支专门为DSD患者服务的团队。"},{"en":"Some people prefer the term “differences” rather than “disorders” when talking about DSD.","zh":"谈到DSD时，有些人更倾向用“差异”而不是“障碍/疾病”。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Direct Stream Digital,” an audio format used in some high-resolution recordings (often associated with SACD).","zh":"“Direct Stream Digital（直接流数字）”的缩写：一种用于部分高解析录音的音频格式（常与SACD相关）。"},"examples":[{"en":"This album is available in FLAC and DSD.","zh":"这张专辑提供FLAC和DSD两种格式。"},{"en":"My player supports DSD playback.","zh":"我的播放器支持DSD播放。"}]},{"partOfSpeech":"other","definition":{"en":"a general initialism that can stand for different things depending on the field (e.g., names of departments, documents, or technical systems).","zh":"一个通用首字母缩写，在不同领域可能代表不同事物（例如部门名称、文件名称或技术系统）。"},"examples":[{"en":"In this company, DSD refers to the Digital Services Department.","zh":"在这家公司里，DSD指数字服务部。"},{"en":"Could you clarify what DSD stands for in your report?","zh":"你能说明一下在你的报告里DSD具体指什么吗？"}]}],"synonyms":["Differences of Sex Development","Direct Stream Digital","initialism","acronym"],"phonetic":"ˌdiː ˌɛs ˈdiː","extraExplanation":["“DSD”最常见、最需要谨慎使用的语境是医学中的“性别发育差异”。这个话题涉及个人身份与隐私，英文里不少人更偏好用 differences（差异）而非 disorders（障碍/疾病）来避免污名化。","在音频圈里，DSD通常与“SACD（Super Audio CD）”和“高解析音乐”相关；它是按位流方式存储/传输的一类数字音频表示。","如果你是在特定文本/专业里看到“DSD”，最好提供一句上下文，我可以帮你确定它在那里的准确含义。"]}
{"word":"DSDC","summary":{"en":"“DSDC” is an initialism, and its exact meaning depends on context.","zh":"“DSDC” 是首字母缩略语，具体含义需要结合上下文确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (a set of letters said one by one) whose meaning depends on the field or organization using it; it is not a single, widely standardized English word.","zh":"一个首字母缩略语（通常逐个字母读），具体含义取决于使用它的领域或机构；它不是英语里普遍统一的固定词。"},"examples":[{"en":"What does DSDC stand for in this document?","zh":"在这份文件里，DSDC 代表什么？"},{"en":"Different companies use “DSDC” to mean different departments, so please provide the context.","zh":"不同公司对“DSDC”的含义可能不同，所以请提供上下文。"}]}],"phonetic":"ˌdiːˌɛsˌdiːˈsiː","extraExplanation":["DSDC 这类缩写通常需要上下文才能确定意思：比如它可能是某个机构/部门名称、项目代号、课程名称或系统名的首字母。你可以告诉我它出现在哪个领域（学校、公司、军事、IT、医学等）以及完整句子，我就能更准确地解释与翻译。"]}
{"word":"DSE","summary":{"en":"DSE most commonly means the Hong Kong Diploma of Secondary Education exam; it can also mean Display Screen Equipment in workplace safety contexts.","zh":"DSE最常指香港中學文憑考試；在職安語境中也可指顯示屏設備（Display Screen Equipment）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hong Kong) The Hong Kong Diploma of Secondary Education—an official public exam taken at the end of secondary school, often used for university admission.","zh":"（香港）香港中學文憑考試（HKDSE）——中學畢業階段的公開考試，常用作大學入學依據。"},"examples":[{"en":"She’s studying hard for the DSE this year.","zh":"她今年正努力準備DSE。"},{"en":"Many universities consider DSE results for admission.","zh":"很多大學會把DSE成績作為錄取參考。"}]},{"partOfSpeech":"n.","definition":{"en":"(Workplace safety, UK/Europe) Display Screen Equipment—computer monitors and similar screens, especially in rules about safe workstation setup.","zh":"（職安/英國與歐洲）顯示屏設備（Display Screen Equipment）——指電腦螢幕等顯示設備，常見於工作站安全與人體工學規範。"},"examples":[{"en":"The company provides DSE training to prevent neck and back pain.","zh":"公司提供DSE培訓，預防頸背痛。"},{"en":"Make sure your chair and monitor height meet DSE guidelines.","zh":"確保椅子與螢幕高度符合DSE指引。"}]},{"partOfSpeech":"n.","definition":{"en":"(Finance) Direct Stock Exchange—a method for trading shares directly on an exchange (less common usage).","zh":"（金融）直接股票交易所（Direct Stock Exchange）——指在交易所直接交易股票的一種說法（較少見）。"},"examples":[{"en":"In older documents, DSE may refer to a direct stock exchange model.","zh":"在一些較舊的文件中，DSE可能指直接股票交易模式。"}]}],"synonyms":["HKDSE (for the exam)","Diploma of Secondary Education (HK context)","Display Screen Equipment (workplace context)"],"phonetic":"/ˌdiː ɛs ˈiː/","extraExplanation":["「DSE」是縮寫，意思非常依語境而定。若你在香港教育語境看到「DSE」，幾乎一定是指「香港中學文憑考試（HKDSE）」。","讀縮寫時常逐字母念：D-S-E。正式寫作中，建議首次出現時寫全名（如 Hong Kong Diploma of Secondary Education, DSE），避免誤解。"]}
{"word":"dsect","summary":{"en":"“Dissect” means to cut something apart to study it, or to analyze something in detail.","zh":"“dissect”既可指“解剖（以研究）”，也可指“细致剖析（观点/文本等）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cut something open and separate it into parts in order to study it (especially a body, plant, or animal)","zh":"（尤指对尸体、动植物等）解剖；剖开并分离各部分以进行研究"},"examples":[{"en":"In biology class, we dissected a frog to learn about its organs.","zh":"在生物课上，我们解剖了一只青蛙来学习它的器官。"},{"en":"The scientist dissected the specimen carefully under a microscope.","zh":"科学家在显微镜下小心地解剖了标本。"}]},{"partOfSpeech":"vt.","definition":{"en":"to analyze something closely by examining its parts, meaning, or structure (such as an idea, text, or situation)","zh":"（对观点、文章、局势等）细致分析；剖析"},"examples":[{"en":"Let’s dissect the argument step by step.","zh":"我们来一步一步剖析这个论证。"},{"en":"The teacher asked students to dissect the poem’s imagery.","zh":"老师让学生剖析这首诗的意象。"}]}],"synonyms":["analyze","examine","study","take apart","disassemble"],"phonetic":"/dɪˈsɛkt/","extraExplanation":["你输入的“dsect”通常不是标准英文单词，更常见的是拼写少了“i”的“dissect”。如果你是在某个专业场景里看到“dsect”作为缩写（例如笔记或代码变量名），告诉我上下文，我可以帮你确认它具体指什么。"]}
{"word":"dsects","summary":{"en":"Likely intended word: dissect (or dissects). It means to cut something open to study it, or to analyze something in detail.","zh":"你可能想查的是 dissect（或 dissects）。意思是“解剖以研究”，也可指“详细剖析、分析”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cut something open or apart in order to study its parts, especially in biology (e.g., a frog in a lab)","zh":"（为研究其结构而）解剖，剖开（尤指生物实验中解剖动物）"},"examples":[{"en":"In biology class, we dissected a frog to learn about its organs.","zh":"在生物课上，我们解剖了一只青蛙来学习它的器官。"},{"en":"The scientist dissected the specimen carefully.","zh":"科学家小心地解剖了样本。"}]},{"partOfSpeech":"vt.","definition":{"en":"to examine something closely and analyze it in detail (ideas, language, an argument, data)","zh":"仔细分析，剖析（观点、语言、论证或数据等）"},"examples":[{"en":"The teacher asked us to dissect the poem line by line.","zh":"老师让我们逐行剖析这首诗。"},{"en":"Journalists dissected the speech for hidden meanings.","zh":"记者们仔细分析那篇演讲，寻找隐藏含义。"}]}],"synonyms":["analyze","examine","break down","disassemble"],"phonetic":"/dɪˈsɛkt/","extraExplanation":["“dsects”本身不是常见英文单词；你可能想写的是 **dissects**（第三人称单数：He/She dissects...）或动词原形 **dissect**。","拼写提示：dissect = dis- + sect（切开/分开）。在写作里，‘dissect an argument’ 常用来表示“把论点拆开来分析”。"]}
{"word":"DSEE","summary":{"en":"“DSEE” is an initialism whose meaning depends on context (often an organization name).","zh":"“DSEE”是一个缩略语，具体含义取决于语境（常见于机构名称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (acronym spelled letter by letter) used in names of organizations or programs; the exact meaning depends on the country, institution, or document (for example, it can refer to a Department/Directorate of School Education in some places).","zh":"一个按字母逐个念的缩略语；具体含义取决于国家、机构或文件语境（例如在一些地区可能指“学校教育部门/局”等机构名称）。"},"examples":[{"en":"Please check the notice to see what “DSEE” stands for in this document.","zh":"请查看公告，确认这份文件里“DSEE”具体代表什么。"},{"en":"I emailed DSEE to ask about the school enrollment process.","zh":"我给DSEE发邮件咨询入学流程。"}]}],"synonyms":["initialism","acronym (general term)"],"phonetic":"/ˌdiː ɛs iː ˈiː/","extraExplanation":["“DSEE”不是一个固定的常用英文单词，而更像组织/部门名称的缩写。英文里很多缩写在不同地区会对应不同全称，所以最可靠的方法是：在同一份材料中找第一次出现时的全称（通常写成“Full Name (DSEE)”）。","读法通常按字母读：D-S-E-E。在正式写作中，最好第一次出现写出全称，后面再用缩写。"]}
{"word":"Dseldorf","summary":{"en":"Düsseldorf is a city in western Germany, famous for business, art, and fashion.","zh":"杜塞尔多夫是德国西部城市，以商业、艺术与时尚闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in western Germany (the capital of the state of North Rhine–Westphalia), known for business, fashion, art, and its location on the Rhine River.","zh":"德国西部城市（北莱茵-威斯特法伦州首府），以商业、时尚、艺术以及位于莱茵河畔而闻名。"},"examples":[{"en":"Düsseldorf is a major business and trade fair city in Germany.","zh":"杜塞尔多夫是德国重要的商业与会展城市。"},{"en":"We took a walk along the Rhine in Düsseldorf.","zh":"我们在杜塞尔多夫的莱茵河边散步。"},{"en":"She moved to Düsseldorf for a job in fashion.","zh":"她为了从事时尚行业的工作搬到了杜塞尔多夫。"}]}],"phonetic":"/ˈdʊsəldɔrf/","extraExplanation":["你输入的“Dseldorf”通常是对德语地名“Düsseldorf”的拼写简化或误拼；原词中“ü”有时会写作“ue”，即“Duesseldorf”。","在英语写作里更常见的写法是“Düsseldorf”（保留变音符号）或“Duesseldorf”（不方便输入变音符号时）。"]}
{"word":"DSI","summary":{"en":"DSI is an initialism with multiple possible meanings; you need context to know which one is intended.","zh":"DSI 是一个有多种可能含义的首字母缩写；需要结合上下文才能确定具体指什么。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (initialism) for many different phrases; the exact meaning depends on the field and context (for example, government, tech, or education).","zh":"一个缩写（按字母读的首字母缩略词）；具体含义取决于使用领域与上下文（如政府、科技、教育等）。"},"examples":[{"en":"What does DSI stand for in this report?","zh":"这份报告里的 DSI 代表什么？"},{"en":"In IT documents, DSI can mean different things, so always check the definition section.","zh":"在 IT 文档中，DSI 可能有不同含义，所以要查看“术语定义/缩写”部分。"}]},{"partOfSpeech":"other","definition":{"en":"(common in government/IT in Europe) Digital Service Infrastructure: shared online services used across countries or organizations.","zh":"（在欧洲政府/IT语境中常见）数字服务基础设施：跨国家或机构共享的在线服务与系统。"},"examples":[{"en":"The project connects national systems through a Digital Service Infrastructure (DSI).","zh":"该项目通过数字服务基础设施（DSI）连接各国系统。"}]},{"partOfSpeech":"other","definition":{"en":"(electronics/engineering) Dynamic Stress Index: a measured value used to describe vibration or stress conditions in materials or devices.","zh":"（电子/工程）动态应力指数：用于描述材料或设备振动/受力状况的测量指标。"},"examples":[{"en":"Engineers monitored the DSI to make sure the device could handle vibration.","zh":"工程师监测 DSI，以确保设备能承受振动。"}]}],"synonyms":["initialism","abbreviation","acronym (general use)"],"phonetic":"/ˌdiː ɛs ˈaɪ/","extraExplanation":["DSI 通常按字母逐个读：D-S-I（不是一个完整单词的发音），这种缩写在英语里叫 initialism。","不同领域会给 DSI 不同释义；如果你把原句/行业（例如：论文、公司文件、课程、产品说明）发我，我可以帮你确定最准确的展开与翻译。"]}
{"word":"dsian","summary":{"en":"Not a standard English word; likely a misspelling or a name.","zh":"不是标准英文单词；可能是拼写错误或名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“dsian” is not a standard English word. It may be a typo or a name.","zh":"“dsian” 不是标准英文单词，可能是拼写错误或人名。"},"examples":[{"en":"I couldn’t find “dsian” in an English dictionary—did you mean “Asian” or “distant”?","zh":"我在英文词典里找不到“dsian”——你想写的是“Asian”还是“distant”吗？"},{"en":"Please share the sentence where you saw “dsian,” and I’ll help you figure it out.","zh":"请把你看到“dsian”的完整句子发我，我可以帮你判断意思。"}]}],"phonetic":"/ˈdiːziːən/","extraExplanation":["如果你想查的是“Asian”（亚洲的/亚洲人）或“Dacian”（达契亚的，古代民族/地区），请告诉我正确拼写或给出上下文（整句/段落）。我也可以根据发音来猜测你想表达的词。"]}
{"word":"DSM","summary":{"en":"DSM most commonly refers to the Diagnostic and Statistical Manual of Mental Disorders, a key APA reference for classifying mental disorders; it’s also sometimes used informally to mean any strict classification guide.","zh":"DSM 最常指《精神障碍诊断与统计手册》（APA 的重要参考书，用于精神障碍分类）；也可被非正式引申为“任何严格的分类指南”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly in psychology/psychiatry) The Diagnostic and Statistical Manual of Mental Disorders: a reference book used by mental-health professionals to describe and classify mental disorders, published by the American Psychiatric Association (APA).","zh":"（主要用于心理学/精神医学）《精神障碍诊断与统计手册》：由美国精神医学学会（APA）出版的参考手册，用于描述并分类精神障碍，供心理健康专业人士使用。"},"examples":[{"en":"The clinician used the DSM to help determine whether the symptoms met the criteria for a diagnosis.","zh":"临床医生使用 DSM 来判断这些症状是否符合某个诊断的标准。"},{"en":"In many U.S. hospitals, the DSM is a common reference for mental-health documentation.","zh":"在美国许多医院里，DSM 是心理健康记录中常用的参考依据。"},{"en":"Our textbook compares how depression is defined in the DSM and in other diagnostic systems.","zh":"我们的教材比较了 DSM 与其他诊断体系中对抑郁症的定义。"}]},{"partOfSpeech":"n.","definition":{"en":"(broader use) A set of official guidelines or a standardized reference used to classify something (often used informally by extension from the DSM).","zh":"（引申用法）一套官方指南或标准化的参考体系，用来对某类事物进行分类（常由 DSM 引申而来，属非正式说法）。"},"examples":[{"en":"Some people jokingly call the style guide their “DSM” for punctuation rules.","zh":"有些人开玩笑说那本写作格式指南是他们标点规则的“DSM”。"},{"en":"The company built a “DSM” of product issues to keep problem categories consistent.","zh":"公司建立了一套类似“DSM”的产品问题分类表，以保持问题类别的一致性。"}]}],"synonyms":["Diagnostic and Statistical Manual of Mental Disorders","DSM-5","DSM-5-TR"],"phonetic":"/ˌdiː ɛs ˈɛm/","extraExplanation":["DSM 由美国精神医学学会（APA）编写与更新，常见版本包括 DSM-IV 与 DSM-5（以及文本修订版 DSM-5-TR）。","在临床与研究中，DSM 提供“诊断标准（criteria）”以提高沟通一致性；但它也常被讨论其局限性，例如文化差异、标签化风险等，因此阅读或使用时通常需要结合具体情境与专业判断。","在英语里，人们通常把 DSM 当作字母缩写读作 “D-S-M”。"]}
{"word":"DSMA-Notice","summary":{"en":"“DSMA-Notice” means a notice/alert tagged with “DSMA,” but the exact meaning depends on what DSMA stands for in your context.","zh":"“DSMA-Notice”指带有“DSMA”标识的通知/提示，但DSMA的具体含义需结合你的使用场景确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A notification or announcement labeled “DSMA” in a specific system, organization, or set of rules (the exact meaning depends on what “DSMA” stands for in your context).","zh":"在特定系统、组织或规则中带有“DSMA”标识的通知/公告（“DSMA”的具体含义取决于你所在语境中它的全称）。"},"examples":[{"en":"I received a DSMA-Notice from the platform and had to review the new policy.","zh":"我从该平台收到了 DSMA-Notice，需要查看新的政策。"},{"en":"Please forward any DSMA-Notices to the compliance team.","zh":"请将所有 DSMA-Notice 转发给合规团队。"}]}],"synonyms":["notification","alert","announcement","message"],"phonetic":"/ˌdiː ˌɛs ˌɛm ˌeɪ ˈnoʊtɪs/","extraExplanation":["“DSMA”通常是缩写（acronym/initialism），不同领域含义可能完全不同。常见读法是逐个字母读：D-S-M-A（/diː ɛs ɛm eɪ/）。","如果你把它看到的场景（例如邮件抬头、App 提示、合同条款、政府/学校文件）发我，我可以更准确地解释它的全称、用途，以及是否需要你采取行动。"]}
{"word":"DSMB","summary":{"en":"DSMB is an independent committee that monitors safety and data during clinical trials.","zh":"DSMB指在临床试验中独立监测数据与安全性的专家委员会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Data and Safety Monitoring Board: an independent group of experts that regularly reviews data in a clinical trial to protect participants and ensure the study is safe, ethical, and scientifically valid.","zh":"数据与安全监测委员会：由独立专家组成的团队，定期审查临床试验数据，以保护受试者并确保研究安全、合乎伦理且科学可靠。"},"examples":[{"en":"The DSMB reviewed the interim results and recommended continuing the trial.","zh":"DSMB审查了期中结果，并建议继续试验。"},{"en":"After several serious adverse events, the DSMB asked for a safety pause.","zh":"在出现多起严重不良事件后，DSMB要求暂停以评估安全性。"}]}],"synonyms":["DMC (Data Monitoring Committee)","Data Safety Monitoring Board"],"phonetic":"/ˌdiː ɛs ɛm ˈbiː/","extraExplanation":["DSMB常见于药物、疫苗、医疗器械等临床试验中，成员通常不参与试验的日常执行，以减少利益冲突，保证判断更客观。","在很多文件里你也会看到相近称呼DMC（Data Monitoring Committee，数据监测委员会），含义通常非常接近，有时是同一概念的不同叫法。","DSMB可能会建议：继续、修改方案（如调整入组标准或监测频率）、暂缓招募、甚至提前终止试验（例如疗效明显或风险过高）。"]}
{"word":"DSN","summary":{"en":"DSN is an acronym most commonly meaning “Data Source Name” (database connection label) or “Deep Space Network” (NASA antenna network).","zh":"DSN 是缩写，最常见指“数据源名称”（数据库连接标识）或“深空网络”（NASA 天线通信网络）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) Data Source Name: a saved name/label that stores the connection details for a database (commonly used with ODBC).","zh":"（计算机）数据源名称：用于保存数据库连接信息的名称/标识（常用于 ODBC）。"},"examples":[{"en":"I set up a DSN so Excel can connect to the SQL database.","zh":"我设置了一个 DSN，这样 Excel 就能连接到 SQL 数据库。"},{"en":"The app can’t log in because the DSN points to the wrong server.","zh":"应用无法登录，因为 DSN 指向了错误的服务器。"}]},{"partOfSpeech":"n.","definition":{"en":"(space/telecom) Deep Space Network: NASA’s worldwide system of antennas that communicates with spacecraft far from Earth.","zh":"（航天/通信）深空网络：NASA 的全球天线系统，用于与远离地球的航天器通信。"},"examples":[{"en":"The probe sent images back to Earth through the DSN.","zh":"探测器通过 DSN 把图像传回地球。"},{"en":"DSN antennas track signals from missions on Mars.","zh":"DSN 天线跟踪来自火星任务的信号。"}]},{"partOfSpeech":"n.","definition":{"en":"(business/IT) A general abbreviation for “Design Specification Number,” “Digital Serial Number,” etc., depending on the organization.","zh":"（商务/IT）在不同机构中可能是“设计规格编号”“数字序列号”等的缩写，具体含义取决于语境。"},"examples":[{"en":"Please include the DSN on the form so we can identify the request.","zh":"请在表格上填写 DSN，方便我们识别该请求。"},{"en":"What does DSN stand for in this document?","zh":"在这份文件里，DSN 代表什么？"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/ˌdiː ɛs ˈɛn/","extraExplanation":["DSN 是缩写词，实际含义高度依赖场景。看到 DSN 时，先看它出现的位置：如果在数据库连接、ODBC、驱动、服务器等语境里，通常是 Data Source Name；如果在航天新闻、NASA、探测器通信里，通常是 Deep Space Network。","读法一般按字母念（D-S-N）。在写作中，第一次出现时常写全称：Data Source Name (DSN) 或 Deep Space Network (DSN)。"]}
{"word":"dsname","summary":{"en":"“dsname” is usually a computing term/variable name meaning a directory-service object name (often DN), or sometimes a data source/dataset name depending on context.","zh":"“dsname”通常是计算机领域的缩写/变量名，多指目录服务对象名称（常见为 DN），也可能在特定系统中指数据源/数据集名称，需结合上下文判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) A label used in directory services to identify an object (such as a user, group, or server), often referring to a “distinguished name (DN)” in systems like LDAP/Active Directory.","zh":"（计算机）目录服务中用来标识对象（如用户、组、服务器等）的名称标签；常用来指 LDAP/Active Directory 里的“唯一识别名/专有名称（DN）”。"},"examples":[{"en":"In our LDAP script, dsname stores the user’s distinguished name (DN).","zh":"在我们的 LDAP 脚本里，dsname 用来保存该用户的 DN（唯一识别名）。"},{"en":"Make sure the dsname matches the correct OU before you move the account.","zh":"在移动账号之前，先确认 dsname 对应的是正确的 OU（组织单位）。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, informal) A variable/field name meaning “data source name” or “dataset name,” depending on the program or codebase.","zh":"（计算机，非正式）在不同程序或代码里，dsname 也可能是变量/字段名，表示“数据源名称（data source name）”或“数据集名称（dataset name）”，具体含义取决于上下文。"},"examples":[{"en":"Set dsname to the database connection name used in production.","zh":"把 dsname 设为生产环境使用的数据库连接名称。"},{"en":"The error happens when dsname is empty in the config file.","zh":"配置文件里 dsname 为空时就会报错。"}]}],"synonyms":["DN","distinguished name","directory service name","data source name (context-dependent)"],"phonetic":"/ˈdiːˌɛs.neɪm/","extraExplanation":["“dsname”本身不是常见的日常英语词汇，更像是技术缩写/变量名。最常见的语境是目录服务（LDAP/Active Directory）：对象的 DN 往往很长，代码里可能用 dsname 这样的字段名来保存它。","如果你是在某个软件界面/日志/脚本里看到 dsname，最好同时查看它旁边的字段（如 server、OU、DN、datasource、dataset 等），才能确定到底指“目录对象名”还是“数据源/数据集名称”。"]}
{"word":"dsnames","summary":{"en":"A DNS name is an Internet name (domain/hostname) used by DNS to locate computers or services.","zh":"DNS 名称是 DNS 用来定位计算机或服务的互联网名称（域名/主机名）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a name used in the Domain Name System (DNS) to identify a computer, service, or domain on the Internet (e.g., a domain name or hostname).","zh":"在域名系统（DNS）中用来标识互联网上的计算机、服务或域的名称（例如域名或主机名）。"},"examples":[{"en":"Please enter the DNS name of the server (for example, api.example.com).","zh":"请输入服务器的 DNS 名称（例如 api.example.com）。"},{"en":"The certificate is valid only if it matches the site’s DNS name.","zh":"证书只有在与网站的 DNS 名称匹配时才有效。"}]}],"synonyms":["domain name","hostname","fully qualified domain name (FQDN)"],"phonetic":"/ˌdiːˌɛnˈɛs neɪm/","extraExplanation":["“DNS”是“Domain Name System（域名系统）”的缩写，用来把人类容易记的名称（如 example.com）解析成机器使用的 IP 地址。","你输入的“dsnames”常见于日志、脚本变量或配置字段名，通常表示“DNS names（DNS 名称列表）”。"]}
{"word":"DSO","summary":{"en":"DSO most commonly means Days Sales Outstanding, the average time (in days) it takes to collect payment after a sale.","zh":"DSO最常见指应收账款周转天数，即完成销售后平均需要多少天收回款项。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Days Sales Outstanding: a finance/accounting metric that shows the average number of days it takes a company to collect payment after making a sale (especially on credit).","zh":"应收账款周转天数（DSO）：财务/会计指标，表示企业在完成销售（尤其是赊销）后，平均需要多少天才能收回款项。"},"examples":[{"en":"Our DSO increased from 35 to 48 days, so cash is coming in more slowly.","zh":"我们的DSO从35天升到48天，说明回款变慢了。"},{"en":"The finance team is trying to reduce DSO by tightening payment terms.","zh":"财务团队正通过收紧付款条件来降低DSO。"},{"en":"A lower DSO usually means faster collections and healthier cash flow.","zh":"DSO更低通常意味着回款更快、现金流更健康。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym used in other fields with different meanings (depending on context), such as job titles or technical terms.","zh":"在其他领域也可能代表不同含义的缩写（取决于语境），例如某些岗位名称或技术术语。"},"examples":[{"en":"In this report, DSO refers to Days Sales Outstanding, not a technical role.","zh":"在这份报告里，DSO指应收账款周转天数，而不是某个技术岗位。"}]}],"synonyms":["days to collect","collection days","average collection period"],"phonetic":"/ˌdiː ɛs ˈoʊ/","extraExplanation":["DSO最常见于财务报表、应收账款（Accounts Receivable, AR）与现金流管理场景，常与“账期/付款条款（payment terms）”“催收（collections）”“逾期（overdue）”一起出现。","常见解读：DSO上升往往表示客户付款变慢、信用政策变松或催收效率下降；DSO下降通常表示回款更快，但也可能意味着放弃了一些赊销增长机会，需要结合行业与客户结构判断。","如果你告诉我你看到DSO的具体句子或行业（如财务、能源、电网、IT），我可以帮你确认它在该语境下的准确含义。"]}
{"word":"DSP","summary":{"en":"DSP most commonly means “digital signal processing,” and in online advertising it can also mean “demand-side platform.”","zh":"DSP 最常指“数字信号处理”，在网络广告领域也可指“需求方平台”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) digital signal processing: methods used to analyze or modify signals (like sound, images, or sensor data) using computers or digital circuits.","zh":"（缩写）数字信号处理：用计算机或数字电路来分析或处理信号（如声音、图像、传感器数据）的方法。"},"examples":[{"en":"This microphone uses DSP to reduce background noise.","zh":"这款麦克风用 DSP 来降低背景噪音。"},{"en":"She is studying DSP for audio and speech applications.","zh":"她在学习用于音频和语音应用的 DSP。"},{"en":"The engineer wrote a DSP filter to remove high-frequency hiss.","zh":"工程师写了一个 DSP 滤波器来去掉高频嘶声。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev., advertising) demand-side platform: software advertisers use to buy online ads automatically (often through real-time bidding).","zh":"（缩写，广告）需求方平台：广告主用来自动购买线上广告的软件（常见于实时竞价）。"},"examples":[{"en":"We use a DSP to manage our programmatic ad campaigns.","zh":"我们用 DSP 来管理程序化广告投放。"},{"en":"The DSP helps target users based on interests and location.","zh":"DSP 能根据兴趣和位置来定向用户。"}]}],"synonyms":["digital signal processing","demand-side platform"],"phonetic":"/ˌdiː ɛs ˈpiː/","extraExplanation":["“DSP”最常见的两种含义分别来自工程/音频领域（digital signal processing）和数字广告领域（demand-side platform）。在技术公司面试或电子产品说明书里，通常默认是“数字信号处理”；在营销、投放、媒体购买语境中，才更可能指“需求方平台”。","读法通常按字母读：D-S-P。写作时也常保留大写。"]}
{"word":"dsp","summary":{"en":"DSP most commonly means digital signal processing/processor; in advertising it can mean demand-side platform.","zh":"DSP 最常指数字信号处理/处理器；在广告行业也可指需求方平台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"digital signal processing; or a digital signal processor (a chip) that processes digital audio, video, or other signals.","zh":"数字信号处理；或数字信号处理器（DSP 芯片），用于处理数字音频、视频等信号。"},"examples":[{"en":"This speaker uses a DSP to reduce noise and improve clarity.","zh":"这款音箱使用 DSP 来降低噪声并提升清晰度。"},{"en":"I’m learning DSP basics like filtering and sampling.","zh":"我在学习 DSP 的基础知识，比如滤波和采样。"}]},{"partOfSpeech":"n.","definition":{"en":"demand-side platform (online advertising): software that helps advertisers buy digital ads automatically.","zh":"需求方平台（网络广告）：帮助广告主自动化购买数字广告的软件平台。"},"examples":[{"en":"We bought the campaign through a DSP to target specific audiences.","zh":"我们通过 DSP 投放这次广告活动，以定向特定人群。"},{"en":"The DSP adjusts bids in real time based on performance.","zh":"DSP 会根据效果实时调整出价。"}]}],"synonyms":["digital signal processing","digital signal processor","demand-side platform"],"phonetic":"/ˌdiː ɛs ˈpiː/","extraExplanation":["“DSP”通常读作字母缩写（D-S-P）。在技术语境里最常见的是“数字信号处理/处理器”，常见于音频（降噪、均衡器）、通信、图像处理等。","在市场营销/广告行业里，“DSP”多指“Demand-Side Platform（需求方平台）”，与“SSP（Supply-Side Platform，供给方平台）”相对。看上下文（音频/芯片/滤波 vs. 广告投放/出价/人群定向）即可判断。"]}
{"word":"DSR","summary":{"en":"DSR is an abbreviation with several common meanings, such as demand-side response (energy), dynamic source routing (networking), or digital sound recording (audio).","zh":"DSR是一个多义缩写，常见含义包括需求侧响应（能源）、动态源路由（网络）或数字录音（音频）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Demand-side response: programs that encourage electricity users to reduce or shift their power use, especially during peak demand.","zh":"（缩写）需求侧响应：鼓励用电者在用电高峰减少或调整用电时间的计划。"},"examples":[{"en":"The utility offered a DSR program to lower peak electricity demand.","zh":"这家电力公司推出了DSR项目来降低用电高峰需求。"},{"en":"Factories can join DSR by shifting production to off-peak hours.","zh":"工厂可以通过把生产安排到非高峰时段来参与DSR。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Dynamic source routing: a networking protocol (often in wireless ad hoc networks) where routes are discovered and updated as needed.","zh":"（缩写）动态源路由：一种网络路由协议（常见于无线自组网），按需发现并更新路径。"},"examples":[{"en":"The researchers tested DSR in a mobile ad hoc network simulation.","zh":"研究人员在移动自组网仿真中测试了DSR。"},{"en":"DSR can adapt when nodes move and links change.","zh":"当节点移动、链路变化时，DSR可以自适应调整。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Digital sound recording: recording audio in digital form rather than on analog tape.","zh":"（缩写）数字录音：以数字形式录制声音，而不是用模拟磁带。"},"examples":[{"en":"Modern studios rely on DSR for clean, editable audio.","zh":"现代录音棚依赖DSR来获得干净、可编辑的音频。"},{"en":"DSR made it easier to copy recordings without losing quality.","zh":"DSR让复制录音更容易且不易损失音质。"}]}],"synonyms":["demand response (for Demand-side response)","DSR protocol (for Dynamic source routing)","digital recording (for Digital sound recording)"],"phonetic":"/ˌdiː ɛs ˈɑr/","extraExplanation":["“DSR”是缩写，具体含义高度依赖领域（能源、电力系统；计算机网络；音频录制等）。如果你告诉我出现的场景（例如一封邮件、论文标题、工作内容），我可以锁定最合适的释义并补充更贴近语境的例句。","读作字母：D-S-R。写作时常见格式有“DSR program / DSR protocol / DSR recording”。"]}
{"word":"dsr","summary":{"en":"DSR is usually an abbreviation; its meaning depends on context (e.g., a report in U.S. contracting, a medical registry term, or a networking protocol).","zh":"DSR通常是缩写，具体含义取决于语境（例如美国承包系统中的报告、医学登记/研究用语或网络协议等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation meaning “Down Syndrome (Down syndrome) Registry/Research” in some medical or research contexts (usage varies by organization).","zh":"在一些医学或研究语境中，用作与“唐氏综合征登记/研究”相关的缩写（具体含义因机构而异）。"},"examples":[{"en":"The hospital joined the DSR to improve long-term follow-up for patients.","zh":"这家医院加入了DSR，以改进对患者的长期随访。"},{"en":"Researchers used DSR data to study health outcomes across age groups.","zh":"研究人员使用DSR数据来研究不同年龄组的健康结局。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation meaning “Domestic Subcontracting Report,” a U.S. government contracting report in some procurement systems.","zh":"“Domestic Subcontracting Report（国内分包报告）”的缩写，在一些美国政府采购/承包系统中使用。"},"examples":[{"en":"Submit the DSR by the deadline to stay compliant with the contract.","zh":"请在截止日期前提交DSR，以符合合同合规要求。"},{"en":"Our team reviewed the DSR for subcontracting goals and totals.","zh":"我们团队审查了DSR中的分包目标和汇总数据。"}]},{"partOfSpeech":"other","definition":{"en":"A short form for “dynamic source routing” or other technical terms in networking/engineering, depending on the field.","zh":"在网络/工程领域中，可能是“dynamic source routing（动态源路由）”等技术术语的缩写，具体取决于学科。"},"examples":[{"en":"The paper compares DSR with other ad hoc routing protocols.","zh":"这篇论文比较了DSR与其他自组网路由协议。"},{"en":"In this course, DSR refers to a routing method used in mobile networks.","zh":"在这门课里，DSR指一种用于移动网络的路由方法。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌdiːˌɛsˈɑr/","extraExplanation":["“DSR”不是一个固定单词，更多是首字母缩写；在不同领域含义差异很大。","如果你能告诉我你在哪里看到它（医疗报告、政府采购系统、论文、聊天语境等），我可以给出最准确的释义和更贴切的例句。"]}
{"word":"DSRI","summary":{"en":"DSRI is a finance acronym for Days’ Sales in Receivables Index, used to compare receivables growth with sales growth.","zh":"DSRI 是金融缩写，指“应收账款周转天数指数”，用于比较应收账款增长与销售增长的关系。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(finance/accounting) Abbreviation for Days’ Sales in Receivables Index, a ratio used to see whether a company’s receivables are growing faster than its sales (often used in earnings-quality or fraud-risk analysis, e.g., the Beneish M‑Score).","zh":"（金融/会计）“应收账款周转天数指数”的缩写，用来观察公司应收账款增长是否快于销售额（常用于盈利质量或舞弊风险分析，如 Beneish M‑Score）。"},"examples":[{"en":"In the Beneish M‑Score, DSRI helps flag unusual growth in receivables.","zh":"在 Beneish M‑Score 中，DSRI 用于提示应收账款异常增长。"},{"en":"A DSRI above 1 may indicate that receivables rose faster than sales.","zh":"DSRI 大于 1 可能表示应收账款增长快于销售额。"}]}],"synonyms":["Days’ Sales in Receivables Index"],"phonetic":"/ˌdiː ɛs ɑːr ˈaɪ/","extraExplanation":["DSRI 通常写作 Days’ Sales in Receivables Index，常见计算形式是：DSRI = (Receivables_t / Sales_t) ÷ (Receivables_{t-1} / Sales_{t-1})。","直观理解：如果 DSRI 明显上升，可能意味着公司放宽赊销政策、回款变慢，或存在提前确认收入等风险信号；但也可能是行业季节性、业务结构变化等正常原因导致，需要结合其他指标一起看。","在英文语境里它一般按字母读：D-S-R-I。"]}
{"word":"dsri","summary":{"en":"DSRI is a finance/accounting index that compares receivables growth to sales growth and may flag potential earnings quality issues.","zh":"DSRI 是财务会计指标，用来比较应收账款与销售收入的增长速度，可能提示盈利质量风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Days Sales in Receivables Index: a financial ratio used (often in the Beneish M-score model) to check whether a company’s accounts receivable are growing faster than its sales, which can be a warning sign of aggressive revenue recognition.","zh":"应收账款周转天数指数（DSRI）：一种财务比率（常见于 Beneish M-score 模型），用来观察公司的应收账款增长是否快于销售收入；若明显升高，可能提示收入确认过于激进等风险。"},"examples":[{"en":"The DSRI increased this year, so analysts looked more closely at the company’s revenue recognition.","zh":"今年 DSRI 上升了，所以分析师更仔细地检查了公司的收入确认方式。"},{"en":"A DSRI above 1 can suggest receivables are rising faster than sales.","zh":"DSRI 大于 1 可能意味着应收账款增长快于销售额。"}]}],"synonyms":["Days Sales in Receivables Index"],"phonetic":"/ˌdiː ɛs ɑr ˈaɪ/","extraExplanation":["DSRI 通常写作大写（DSRI），多用于财务分析语境，而不是日常英语单词。","它常与其他指标一起使用（例如在 Beneish M-score 中与 GMI、AQI、SGI 等组合），单独看并不能直接证明造假，只能提示“需要进一步核查”。","若你本来想输入的是别的词（例如 desk、desire 等），告诉我正确拼写，我可以按普通词汇为你解释。"]}
{"word":"DSS","summary":{"en":"DSS is an abbreviation most commonly meaning “Decision Support System,” but it can also refer to a radio technology (direct-sequence spread spectrum) or a government social services department, depending on context.","zh":"DSS是一个缩写，最常见指“决策支持系统”，也可能指通信中的“直序扩频”，或政府的“社会服务/福利部门”，具体取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbreviation) Decision Support System: a computer-based system that helps people make decisions by analyzing data and presenting useful information.","zh":"（缩写）决策支持系统：一种通过分析数据并提供有用信息来帮助人们做出决策的计算机系统。"},"examples":[{"en":"Our hospital uses a DSS to help doctors choose the safest treatment.","zh":"我们医院使用决策支持系统（DSS）来帮助医生选择最安全的治疗方案。"},{"en":"The manager asked the IT team to build a DSS for sales forecasting.","zh":"经理让信息技术团队搭建一个用于销售预测的DSS。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbreviation, telecom) Direct-sequence spread spectrum: a method of sending radio signals that spreads data over a wider frequency band to reduce interference.","zh":"（缩写，通信）直序扩频：一种无线传输方法，把数据分散到更宽的频带上，以降低干扰。"},"examples":[{"en":"Some wireless systems use DSS to improve signal reliability.","zh":"一些无线系统使用DSS来提高信号的可靠性。"},{"en":"The engineer explained how DSS can help resist noise.","zh":"工程师解释了DSS如何帮助抵抗噪声干扰。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbreviation, government) Department of Social Services: a public agency that provides social welfare services (name varies by region).","zh":"（缩写，政府）社会服务局/社会福利部门：提供社会救助与福利服务的政府机构（不同地区名称可能不同）。"},"examples":[{"en":"She applied for assistance through the DSS.","zh":"她通过DSS申请了援助。"},{"en":"Call the DSS if you need information about local benefits.","zh":"如果你需要了解当地福利信息，可以联系DSS。"}]}],"synonyms":["Decision Support System","direct-sequence spread spectrum","Department of Social Services"],"phonetic":"/ˌdiː.ɛsˈɛs/","extraExplanation":["“DSS”是高度依赖语境的缩写：在商业/数据分析里常指Decision Support System；在通信工程里可能指Direct-sequence spread spectrum；在政府与公共服务语境中可能是Department of Social Services。阅读或写作时最好在第一次出现时写全称（DSS = …），以避免误解。"]}
{"word":"DSSI","summary":{"en":"DSSI most commonly refers to the G20 Debt Service Suspension Initiative, a temporary pause on some debt payments for eligible low-income countries.","zh":"DSSI最常见的含义是G20推动的“债务偿付暂停倡议”，为符合条件的低收入国家暂缓部分债务偿付。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Debt Service Suspension Initiative: a G20 program (supported by the World Bank and IMF) that temporarily paused some debt payments for eligible low-income countries, mainly during the COVID-19 period.","zh":"债务偿付暂停倡议（DSSI）：由G20推动、世界银行与IMF支持的一项计划，主要在新冠疫情期间为符合条件的低收入国家暂缓部分债务偿付。"},"examples":[{"en":"During the pandemic, several countries applied for support through the DSSI.","zh":"在疫情期间，一些国家通过DSSI申请了支持。"},{"en":"The report compares debt relief options, including the DSSI and later restructuring talks.","zh":"该报告比较了多种减债方案，包括DSSI以及后续的债务重组谈判。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym that can also stand for other organization names or technical terms, depending on context (for example, a specific institute, company, or system).","zh":"一个缩写，在不同语境下也可能代表其他机构名称或技术术语（例如某个研究所、公司或系统）。"},"examples":[{"en":"What does DSSI stand for in this document—finance, healthcare, or IT?","zh":"在这份文件里，DSSI指的是什么——金融、医疗还是IT？"},{"en":"Please spell out DSSI the first time you use it in a presentation.","zh":"在演示中第一次使用DSSI时，请先写出它的全称。"}]}],"synonyms":["Debt Service Suspension Initiative","debt-payment moratorium (contextual)"],"phonetic":"/ˌdiː ɛs ɛs ˈaɪ/","extraExplanation":["DSSI通常按字母读作“D-S-S-I”。在英文写作中，缩写第一次出现时一般会写出全称（full name）并在后面加括号标注缩写，例如：Debt Service Suspension Initiative (DSSI)。","如果你告诉我它出现的领域或给我一句原文（比如新闻、报告或公司文件），我可以更准确地判断DSSI在你的语境里具体指什么。"]}
{"word":"DST","summary":{"en":"DST most commonly means Daylight Saving Time; it can also be another context-specific abbreviation.","zh":"DST最常指“夏令时/日光节约时间”；也可能是其他需要结合语境的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for Daylight Saving Time (the system of moving clocks forward, usually by 1 hour, in warmer months).","zh":"“Daylight Saving Time”的缩写，指“夏令时/日光节约时间”（通常在暖季把时钟拨快1小时的制度）。"},"examples":[{"en":"The meeting is at 3:00 p.m. EDT (DST).","zh":"会议时间是下午3点（东部夏令时）。"},{"en":"Don’t forget: DST starts this Sunday, so we lose an hour of sleep.","zh":"别忘了：本周日开始实行夏令时，我们会少睡一小时。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) abbreviation used for the name of an organization or field, depending on context (e.g., Department of Science and Technology).","zh":"（较少见）在特定语境中作为机构或领域名称的缩写（如“科学与技术部/厅”等），具体含义取决于上下文。"},"examples":[{"en":"She works at the DST in her country.","zh":"她在本国的DST（某“科技部/厅”等机构）工作。"},{"en":"In this report, DST refers to the Department of Science and Technology.","zh":"在这份报告里，DST指科学与技术部（或同类机构）。"}]}],"synonyms":["Daylight Saving Time","summer time (BrE)"],"phonetic":"/ˌdiː ɛs ˈtiː/","extraExplanation":["在美国语境中更常见的写法是“Daylight Saving Time”（不加s），常缩写为DST；有些地区会用具体时区缩写来写，比如EDT（东部夏令时）/PDT（太平洋夏令时）。","并非所有地方都实行夏令时：例如美国的亚利桑那州大部分地区（以及夏威夷）不使用DST；很多国家也完全不使用或已取消。阅读“DST”时要结合地点和日期判断。"]}
{"word":"DSTN","summary":{"en":"DSTN usually refers to an older LCD technology (Dual-Scan Twisted Nematic) used in early laptops.","zh":"DSTN 通常指一种较早期的 LCD 屏幕技术（双扫描扭曲向列），多见于早期笔记本电脑。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “Dual-Scan Twisted Nematic,” a type of older LCD screen technology once common in early laptops; it was cheaper but had slower response and narrower viewing angles than TFT screens.","zh":"“Dual-Scan Twisted Nematic（双扫描扭曲向列）”的缩写，一种较早期的 LCD 屏幕技术，曾常见于早期笔记本电脑；价格较低，但反应较慢、可视角度较窄，通常不如 TFT 屏。"},"examples":[{"en":"That old laptop uses a DSTN display, so the screen looks blurry when you scroll.","zh":"那台老笔记本用的是 DSTN 屏，所以你滚动页面时画面会显得有点糊。"},{"en":"TFT screens replaced DSTN on most laptops because they look sharper.","zh":"后来大多数笔记本都用 TFT 取代了 DSTN，因为画面更清晰。"}]}],"synonyms":["Dual-Scan Twisted Nematic","passive-matrix LCD"],"phonetic":"/ˌdiː ˌɛs ˌtiː ˈɛn/","extraExplanation":["“DSTN”通常出现在电脑硬件参数、维修论坛或复古电脑讨论中；现代设备上已经很少见。","读法一般按字母读：D-S-T-N。日常英语对话里不常用，更多是技术语境。"]}
{"word":"DSU","summary":{"en":"DSU most commonly means “Disjoint Set Union” in computer science, but it can also refer to organizations such as Delaware State University; context decides the meaning.","zh":"DSU 最常见指计算机中的“并查集（Disjoint Set Union）”，也可能指特拉华州立大学等机构；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Computer science) Disjoint Set Union: a data structure that keeps track of a set of elements split into non-overlapping groups, and supports merging groups and checking whether two elements are in the same group.","zh":"（计算机）并查集：一种数据结构，用来维护一组元素被分成互不重叠的若干集合，并支持“合并集合”和“判断是否同属一个集合”等操作。"},"examples":[{"en":"We used a DSU to quickly check connectivity in the graph.","zh":"我们用并查集（DSU）来快速判断图中的连通性。"},{"en":"With DSU, union merges two sets and find returns the representative.","zh":"用并查集时，union 用来合并两个集合，find 用来找到代表元素。"}]},{"partOfSpeech":"n.","definition":{"en":"(Education; proper noun) Delaware State University, a public university in the U.S. state of Delaware.","zh":"（教育；专有名词）特拉华州立大学（Delaware State University），美国特拉华州的一所公立大学。"},"examples":[{"en":"She applied to DSU for the biology program.","zh":"她申请了特拉华州立大学（DSU）的生物专业。"},{"en":"DSU is located in Dover, Delaware.","zh":"DSU 位于特拉华州多佛市（Dover）。"}]},{"partOfSpeech":"n.","definition":{"en":"(General) An abbreviation that can stand for different organizations or terms; the exact meaning depends on the field and context.","zh":"（泛指）一个可能代表不同机构或术语的缩写；具体含义取决于领域和上下文。"},"examples":[{"en":"In this email, DSU refers to the Device Service Unit.","zh":"在这封邮件里，DSU 指的是设备服务部门（Device Service Unit）。"},{"en":"Ask for clarification if you’re not sure what DSU means here.","zh":"如果你不确定这里的 DSU 指什么，最好问清楚。"}]}],"synonyms":["union-find"],"phonetic":"/ˌdiː.ɛsˈjuː/","extraExplanation":["在编程语境里，DSU（并查集）非常常见，尤其用于“动态连通性”问题，例如：判断网络/地图中两个点是否连通、Kruskal 最小生成树算法等。","读缩写时常按字母读作 “D-S-U”（/ˌdiː.ɛsˈjuː/）。如果你是在特定文章、课程或公司文档里看到的 DSU，给我上下文句子，我可以帮你确定最可能的含义。"]}
{"word":"DSW","summary":{"en":"DSW most commonly refers to the U.S. shoe retailer “Designer Shoe Warehouse,” but it can also mean “direct support worker” in job/healthcare contexts.","zh":"DSW 最常见指美国鞋类零售品牌“Designer Shoe Warehouse”，在招聘/社福语境中也可指“direct support worker（直接支持人员）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) A retail chain whose name stands for “Designer Shoe Warehouse,” selling shoes and accessories.","zh":"（美国）一家零售连锁店，名称是“Designer Shoe Warehouse（设计师鞋仓/鞋类折扣店）”的缩写，主要销售鞋类与配饰。"},"examples":[{"en":"I bought these boots at DSW on sale.","zh":"我在 DSW 打折时买了这双靴子。"},{"en":"DSW carries a lot of brands, so it’s easy to compare prices.","zh":"DSW 品牌很多，所以很容易对比价格。"}]},{"partOfSpeech":"n.","definition":{"en":"(Jobs/health & social care) Abbreviation for “direct support worker,” a person who supports people with disabilities in daily life.","zh":"（招聘/社福领域）“direct support worker（直接支持人员）”的缩写，指在日常生活中支持残障人士的工作人员。"},"examples":[{"en":"She works as a DSW in a group home.","zh":"她在团体之家当 DSW。"},{"en":"The job posting says DSW experience is preferred.","zh":"招聘信息写着有 DSW 经验者优先。"}]}],"phonetic":"/diː ɛs ˈdʌbəl.juː/","extraExplanation":["在美国购物语境里，DSW 通常指鞋类零售品牌（Designer Shoe Warehouse）。在加拿大/社福招聘语境中，DSW 更常见的含义是 direct support worker。看到缩写时可以根据上下文（购物、门店、折扣 vs. 护理、照护、机构）来判断。"]}
{"word":"DSX","summary":{"en":"DSX is an abbreviation that most commonly refers to a telecom cross-connect (DSX-1/DSX-3), but it can also mean Deus Ex (gaming) or a stock ticker (Diana Shipping).","zh":"DSX 是缩写，最常见指电信中的交叉连接配线（DSX-1/DSX-3），也可能指游戏《杀出重围》（Deus Ex）或股票代码（Diana Shipping）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(telecommunications) A Digital Signal Cross-connect interface/panel (often written DSX-1 or DSX-3) used to patch, test, and manage digital circuits like T1 or T3 lines.","zh":"（电信）数字信号交叉连接接口/配线盘（常写作 DSX-1 或 DSX-3），用于跳接、测试和管理如 T1、T3 等数字电路。"},"examples":[{"en":"The technician traced the T1 problem at the DSX-1 panel.","zh":"技术员在 DSX-1 配线盘上排查了这条 T1 线路的问题。"},{"en":"We moved the circuit by repatching it on the DSX.","zh":"我们在 DSX 上重新跳线，把电路切换过去了。"}]},{"partOfSpeech":"other","definition":{"en":"(gaming) Short for Deus Ex, a well-known video game series.","zh":"（游戏）Deus Ex（《杀出重围》）的简称，一款知名电子游戏系列。"},"examples":[{"en":"I started with the first DSX game and then played Human Revolution.","zh":"我先玩了第一部 DSX，然后又玩了《人类革命》。"},{"en":"Some fans call it “DSX” in online forums to save typing.","zh":"一些粉丝在论坛里会用“DSX”来简称，省得打全名。"}]},{"partOfSpeech":"other","definition":{"en":"(finance) A stock ticker symbol: DSX is commonly used for Diana Shipping Inc. on the NYSE.","zh":"（金融）股票代码：DSX 常指纽约证券交易所的 Diana Shipping Inc.（戴安娜航运）。"},"examples":[{"en":"DSX rose after the company reported stronger earnings.","zh":"公司公布更强劲的盈利后，DSX 上涨了。"},{"en":"I added DSX to my watchlist to follow shipping stocks.","zh":"我把 DSX 加进自选股，关注航运板块。"}]}],"synonyms":["DSX-1","DSX-3","digital cross-connect"],"phonetic":"/ˌdiː ɛs ˈɛks/","extraExplanation":["在电信里，DSX 常出现在机房/运营商环境：DSX-1 多与 T1/DS1 相关，DSX-3 多与 T3/DS3 相关。它类似“中间配线点”，方便用跳线改变连接、做回路测试与故障定位。","缩写 DSX 的具体含义非常依赖语境：看到机房、线路、T1/T3 基本就是电信；看到游戏讨论多半是 Deus Ex；看到股市语境通常是股票代码。"]}

