{"word":"DT","summary":{"en":"DT is a common abbreviation; most often it means “downtown,” but it can also mean “delirium tremens” (medical) or certain business/tech terms depending on context.","zh":"DT是常见缩写；最常见指“downtown（市中心）”，也可能指医学上的“delirium tremens（震颤性谵妄）”，或在商业/科技中指特定术语，需看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “downtown,” meaning the central business area of a city","zh":"“downtown（市中心/商业中心）”的缩写，指城市的中心商业区"},"examples":[{"en":"The hotel is DT, so you can walk to most attractions.","zh":"酒店在DT（市中心），所以很多景点都可以步行到。"},{"en":"Traffic is heavy DT during rush hour.","zh":"高峰期DT（市中心）交通很拥堵。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “delirium tremens,” a severe alcohol-withdrawal condition (medical use)","zh":"“delirium tremens（震颤性谵妄）”的缩写，一种严重的酒精戒断反应（医学用语）"},"examples":[{"en":"The doctor monitored him closely for DT after he stopped drinking suddenly.","zh":"他突然戒酒后，医生密切观察他是否出现DT（震颤性谵妄）。"},{"en":"DT can include confusion, shaking, and hallucinations.","zh":"DT可能包括意识混乱、发抖和幻觉。"}]},{"partOfSpeech":"other","definition":{"en":"(also written D.T.) a common abbreviation for “data transfer” or “digital transformation” in business/tech contexts, depending on the company","zh":"（也写作D.T.）在商业/科技语境中常指“data transfer（数据传输）”或“digital transformation（数字化转型）”，具体含义取决于公司/上下文"},"examples":[{"en":"Ask IT if DT is encrypted during transmission.","zh":"问一下IT部门：数据传输（DT）过程中是否加密。"},{"en":"Our DT project focuses on moving services online.","zh":"我们的数字化转型（DT）项目重点是把服务迁到线上。"}]}],"synonyms":["downtown (for the “DT” = downtown meaning)"],"phonetic":"/ˌdiːˈtiː/","extraExplanation":["“DT”在英语里最常见的日常用法之一是写地址/聊天时的“downtown”。例如：DTLA = Downtown Los Angeles（洛杉矶市中心）。","“delirium tremens（DT）”是医学缩写，属于较严肃的健康话题；日常对话中如果不在医疗语境，通常不会用这个意思。","缩写在不同城市、公司或行业里含义可能不同；看到“DT”时，最好结合上下文（地点/医疗/IT项目等）判断。"]}
{"word":"dt","summary":{"en":"DT is an abbreviation most often meaning “downtown,” but it can also mean “delirium tremens” (medical) or “defensive tackle” (sports), depending on context.","zh":"DT是一个缩写，最常见指“downtown（市中心）”，也可能指医学上的“delirium tremens（震颤性谵妄）”或体育上的“defensive tackle（防守截锋）”，需看语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) downtown; the central business area of a city.","zh":"（缩写）市中心；城市的商业中心区。"},"examples":[{"en":"Let’s meet in DT after work.","zh":"下班后我们在市中心（DT）见。"},{"en":"Parking is expensive in DT.","zh":"市中心（DT）停车很贵。"}]},{"partOfSpeech":"other","definition":{"en":"(medical abbrev.) delirium tremens; a severe state of confusion and shaking, usually from alcohol withdrawal.","zh":"（医学缩写）震颤性谵妄；常见于酒精戒断的严重意识混乱与颤抖状态。"},"examples":[{"en":"The doctor monitored him for DT after he stopped drinking suddenly.","zh":"他突然戒酒后，医生监测他是否出现DT（震颤性谵妄）。"}]},{"partOfSpeech":"other","definition":{"en":"(sports abbrev., American football) defensive tackle; a defensive player on the line.","zh":"（体育缩写，美式橄榄球）防守截锋；防守前线的球员。"},"examples":[{"en":"He played DT in college football.","zh":"他大学打美式橄榄球时踢（打）DT（防守截锋）。"}]}],"synonyms":["downtown","city center","CBD"],"phonetic":"/ˌdiːˈtiː/","extraExplanation":["“DT”是首字母缩写，含义高度依赖语境：在短信/口语里常指“downtown（市中心）”；在医疗语境里“DT”几乎总是“delirium tremens”，属于严肃的医学用法；在美式橄榄球里则是位置名“defensive tackle”。如果你告诉我你看到它的句子/场景，我可以帮你确定最可能的意思。"]}
{"word":"DTAS","summary":{"en":"DTAS is an acronym; in U.S. military contexts it often means Deployed Theater Accountability System, a personnel-accountability tracking system.","zh":"DTAS 是一个缩写；在美国军事语境中常指“战区部署人员核查系统”，用于人员登记与追踪。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Deployed Theater Accountability System: a U.S. Army information system used to track and account for personnel (often in deployed/overseas operations).","zh":"（美军）战区部署人员核查系统：美国陆军用于追踪、登记并核对人员信息的系统（常用于海外/战区部署）。"},"examples":[{"en":"The unit updated DTAS to confirm everyone arrived safely at the new base.","zh":"部队更新了 DTAS，以确认所有人都安全抵达新基地。"},{"en":"According to DTAS, two soldiers are still listed as in transit.","zh":"根据 DTAS 的记录，有两名士兵仍被列为“在途中”。"}]},{"partOfSpeech":"other","definition":{"en":"An initialism that can stand for different terms depending on context (e.g., military, government, IT).","zh":"一个首字母缩写，在不同领域可能代表不同含义（如军事、政府、信息技术等）。"},"examples":[{"en":"What does DTAS mean in this document?","zh":"在这份文件里，DTAS 是什么意思？"},{"en":"DTAS can mean different things, so check the glossary or ask the author.","zh":"DTAS 可能有不同含义，所以请查术语表或询问作者。"}]}],"synonyms":["(context-specific) personnel accountability system","tracking system","initialism"],"phonetic":"/ˌdiː tiː eɪ ˈɛs/","extraExplanation":["DTAS 通常按字母逐个读（initialism），常见读法类似“D-T-A-S”。在专业文件里，缩写往往只在特定机构/行业内通用；如果没有上下文，最稳妥的方法是查看该文件的术语表（glossary）、首次出现处的全称，或直接问写作者。"]}
{"word":"DTB","summary":{"en":"DTB most often means “down to business” (let’s focus and start work), but it can also be a context-specific abbreviation for a name.","zh":"DTB最常见意思是“down to business（开始办正事/进入工作状态）”，也可能是某个名称的缩写，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation meaning “down to business,” used in chats or work messages to say you want to start working seriously and focus on the task.","zh":"缩写，表示“开始认真做正事/进入工作状态”，常用于聊天或工作沟通中，意思是要专注处理任务。"},"examples":[{"en":"Okay, DTB—let’s outline the presentation.","zh":"好，DTB——我们来列一下演示稿大纲。"},{"en":"No more small talk. DTB.","zh":"不闲聊了，DTB。"}]},{"partOfSpeech":"other","definition":{"en":"a short written form for various names (e.g., organizations or banks) depending on context; the exact meaning changes by country/field.","zh":"在不同语境下也可能是某些机构/品牌/组织名称的缩写；具体含义取决于国家和领域。"},"examples":[{"en":"Do you mean DTB the bank, or ‘down to business’ in this message?","zh":"你这里的DTB是指那家银行，还是指“down to business（开始办正事）”？"}]}],"synonyms":["down to business","let’s get started","focus time"],"phonetic":"ˌdiːtiːˈbiː","extraExplanation":["“DTB”是高度依赖语境的缩写：在职场聊天里常被理解为“down to business”。如果你是在特定国家/行业（例如金融、学校、社群）看到DTB，它也可能是某个机构或项目的简称。你可以把出现它的完整句子发我，我能帮你准确判断。"]}
{"word":"DTC","summary":{"en":"DTC most commonly means “direct-to-consumer,” a business model/strategy where a company sells or markets directly to customers.","zh":"DTC最常见意思是“direct-to-consumer（直面消费者）”，指企业绕开传统中间渠道直接面向消费者销售或营销。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Direct-to-consumer: selling or marketing products/services straight to the end customer, without traditional intermediaries like wholesalers or retail stores.","zh":"（缩写）DTC＝direct-to-consumer：指品牌/企业绕过批发商、经销商或传统零售渠道，直接向最终消费者销售或营销。"},"examples":[{"en":"Many skincare brands use a DTC model to sell online and ship directly to customers.","zh":"很多护肤品牌采用DTC模式，在网上销售并直接发货给消费者。"},{"en":"The company shifted from wholesale to DTC to control pricing and customer experience.","zh":"这家公司从批发转向DTC，以便更好地控制定价和客户体验。"},{"en":"DTC advertising is common for subscription services.","zh":"订阅制服务常见DTC广告/营销。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, healthcare) Direct-to-consumer testing/medicine marketing: medical tests (often genetic tests) or medical advertising offered directly to the public rather than through a clinician.","zh":"（缩写，医疗）面向消费者的检测/医疗营销：把（常见为基因）检测或医疗广告直接提供给大众，而不是通过医生/医疗机构作为主要入口。"},"examples":[{"en":"DTC genetic testing can provide ancestry information, but results may need medical interpretation.","zh":"DTC基因检测可以提供祖源信息，但结果可能需要专业的医疗解读。"},{"en":"Some countries regulate DTC medical ads to prevent misleading claims.","zh":"一些国家会监管DTC医疗广告，以防误导性宣传。"}]}],"synonyms":["direct-to-consumer","D2C","direct sales (context-dependent)"],"phonetic":"/ˌdiː tiː ˈsiː/","extraExplanation":["在商业语境中，DTC常与“DTC brand（DTC品牌）”“DTC channel（直销渠道）”“DTC strategy（直销策略）”搭配，强调企业直接获取用户数据、建立会员体系与复购。","写法上常见DTC或D2C（同义），也会写作direct-to-consumer（加连字符）。读音通常按字母读：D-T-C。","医疗语境中的DTC更容易涉及合规与风险提示，例如“DTC genetic testing（直面消费者的基因检测）”。"]}
{"word":"dtd","summary":{"en":"“DTD” most commonly means Document Type Definition in XML/SGML; less commonly, it can mean “done to death” (overused).","zh":"“DTD”最常见指 XML/SGML 中的“文档类型定义”；较少情况下也可指“done to death”（被用烂/过度使用）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing) Abbreviation for Document Type Definition: rules that describe the structure and allowed tags/entities of an XML (or SGML) document.","zh":"（计算机）“文档类型定义”的缩写：用于规定 XML（或 SGML）文档结构、允许的标签/实体等规则。"},"examples":[{"en":"This XML file includes a DTD to define which elements are allowed.","zh":"这个 XML 文件包含一个 DTD，用来规定哪些元素是允许的。"},{"en":"The parser rejected the document because it doesn’t match the DTD.","zh":"解析器拒绝了该文档，因为它不符合 DTD。"}]},{"partOfSpeech":"other","definition":{"en":"(informal) Abbreviation for “done to death,” meaning something has been used or repeated so much that it feels boring or unoriginal.","zh":"（非正式）“done to death”的缩写，指某事被用得太多、重复太多，以至于显得无聊或缺乏新意。"},"examples":[{"en":"That plot twist is totally DTD—everyone has seen it before.","zh":"那个剧情反转太 DTD 了——大家早就看过无数遍。"},{"en":"The joke was funny once, but now it’s DTD.","zh":"这个笑话第一次还好笑，但现在已经被讲烂了（DTD）。"}]}],"synonyms":["Document Type Definition","(done to death) overused","cliché"],"phonetic":"/ˌdi ti ˈdi/","extraExplanation":["在技术写作里，DTD 常见于 XML/SGML 语境；它可以写在文档内部（internal subset），也可以通过系统标识符引用外部 DTD（external subset）。现代 XML 项目也常用 XSD（XML Schema）或 Relax NG 来替代 DTD，因为表达能力更强、类型约束更丰富。","在网络聊天里把“done to death”写成 DTD 属于比较口语/小众的缩写，是否能被理解取决于圈子和上下文；正式写作中不建议这样用。"]}
{"word":"DTE","summary":{"en":"DTE most commonly means “Data Terminal Equipment” in networking; informally it can also mean “down-to-earth.”","zh":"DTE最常见指网络中的“数据终端设备”；在非正式聊天中也可指“down-to-earth（务实、接地气）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing & networking) Data Terminal Equipment: an end device (like a computer, router, or terminal) that connects to a network and communicates with Data Communications Equipment (DCE) such as a modem or CSU/DSU.","zh":"（计算机与网络）DTE：数据终端设备；指连接到网络并与DCE（数据通信设备，如调制解调器、CSU/DSU）通信的终端设备（如电脑、路由器或终端机）。"},"examples":[{"en":"In a serial connection, the PC is usually the DTE and the modem is the DCE.","zh":"在串行连接中，电脑通常是DTE，而调制解调器是DCE。"},{"en":"Check whether the cable is wired for DTE-to-DCE communication.","zh":"检查这条线是否按DTE到DCE通信的方式接线。"}]},{"partOfSpeech":"other","definition":{"en":"(informal) “down-to-earth”: practical, realistic, and not pretentious (often used in texting as DTE).","zh":"（非正式）“down-to-earth”的缩写：脚踏实地、务实、不做作（短信或聊天中常写作DTE）。"},"examples":[{"en":"She’s super DTE—you can talk to her about anything.","zh":"她特别DTE（很接地气/很务实），什么都能聊。"},{"en":"I like his DTE attitude toward work.","zh":"我喜欢他对工作的那种DTE（务实）态度。"}]}],"synonyms":["Data Terminal Equipment","down-to-earth"],"phonetic":"/ˌdiː tiː ˈiː/","extraExplanation":["“DTE”更常见、也更正式的含义是网络/通信领域的“Data Terminal Equipment（数据终端设备）”。在技术文档里几乎默认指这个意思。","在聊天语境里，“DTE”表示“down-to-earth”时通常出现在非正式缩写中；是否能这样理解，要看上下文（例如在技术讨论里就不太可能）。"]}
{"word":"dtente","summary":{"en":"Détente means a diplomatic easing of tension, especially between countries.","zh":"détente 指国家间通过外交等方式实现的紧张缓和。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A relaxation of tension or hostility between countries, especially through diplomacy and improved relations.","zh":"（国家间）缓和；（通过外交等）关系改善，紧张局势减弱。"},"examples":[{"en":"In the 1970s, the U.S. and the Soviet Union pursued détente to reduce Cold War tensions.","zh":"在20世纪70年代，美国和苏联推行“缓和”政策，以降低冷战紧张局势。"},{"en":"The two neighbors hoped a trade agreement would lead to détente.","zh":"这两个邻国希望通过贸易协议实现关系缓和。"}]}],"synonyms":["easing","thaw","rapprochement","reconciliation"],"phonetic":"/deɪˈtɑnt/","extraExplanation":["你写的“dtente”通常是拼写省略或误拼；标准拼写是 **détente**（常见英文里也写作 detente，不带重音符号）。","该词来自法语，字面有“放松、松弛”之意；在英语里多用于国际关系语境，尤其常指冷战时期美苏关系的“缓和”。","注意读音里重音通常落在第二音节（-ten-），结尾的 -te 发 /t/ 音。"]}
{"word":"DTF","summary":{"en":"“DTF” is a slang initialism most commonly meaning “down to f***,” i.e., willing to hook up; it can also mean “down to fight” in some contexts.","zh":"“DTF”是俚语缩写，最常见指“down to f***”（愿意约/发生关系）；在少数语境中也可指“down to fight”（准备打架）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang, vulgar) Willing to have casual sex; ready to “hook up.”","zh":"（俚语，粗俗）愿意发生随意性行为；愿意“约炮/发生关系”。"},"examples":[{"en":"That message is pretty explicit—“DTF?” is basically asking if you want to hook up.","zh":"那条信息很露骨——“DTF?”基本是在问你要不要约。"},{"en":"Some people find “DTF” rude or disrespectful, especially from strangers.","zh":"很多人觉得陌生人用“DTF”很无礼、不尊重。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Down to fight; ready to argue or physically fight. (Less common than the sexual meaning.)","zh":"（非正式）愿意打架/吵架；准备开打。（不如性含义常见。）"},"examples":[{"en":"He looked DTF after the argument escalated.","zh":"争吵升级后，他看起来一副要动手的样子。"}]},{"partOfSpeech":"other","definition":{"en":"(other, abbreviations) Used in some fields to mean things like “direct-to-film” (movies) or other technical terms; meaning depends on context.","zh":"（其他缩写）在某些领域也可指“direct-to-film”（电影直接发行）等；具体含义取决于语境。"},"examples":[{"en":"In film discussions, DTF can mean “direct-to-film,” not the slang meaning.","zh":"在电影讨论里，DTF可能指“direct-to-film”，不是俚语意思。"}]}],"synonyms":["down to hook up","up for it","ready to hook up"],"phonetic":"/ˌdi ti ˈɛf/","extraExplanation":["“DTF”最常见于短信、社交媒体、约会软件等场景，通常被视为非常直接甚至冒犯的性暗示用语。遇到时可根据自身边界选择不回复、明确拒绝（例如：Not interested / Please don’t message me like that），并优先重视安全与同意（consent）。","因为它有多个含义，如果出现在正式语境或专业讨论中，先看上下文再判断；但在私聊里几乎总是性含义。"]}
{"word":"DTG","summary":{"en":"DTG most commonly means “direct-to-garment” printing, but it can also mean “date-time group” or “distance to go,” depending on the context.","zh":"DTG最常见指“直喷到衣物（直喷印花）”，也可能指“日期时间组”或“剩余距离”，需看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(printing) Direct-to-garment: a method of printing full-color designs directly onto fabric (usually T-shirts) using inkjet technology.","zh":"（印刷）DTG＝Direct-to-garment（直喷到衣物）：用喷墨技术把彩色图案直接打印到布料上（常见于T恤）。"},"examples":[{"en":"We chose DTG because the design has lots of colors and fine details.","zh":"我们选DTG是因为这个设计颜色多、细节多。"},{"en":"DTG works best on 100% cotton shirts.","zh":"DTG在100%纯棉T恤上效果最好。"}]},{"partOfSpeech":"other","definition":{"en":"(military/communications) Date-time group: a standardized way to write a date and time in official messages.","zh":"（军用/通信）DTG＝Date-time group（日期时间组）：在正式信息里用来规范书写日期和时间的格式。"},"examples":[{"en":"Please include the DTG in the incident report.","zh":"请在事件报告里写明DTG（日期时间）。"},{"en":"The message was logged with the DTG 131530Z FEB 26.","zh":"这条信息以DTG“131530Z FEB 26”记录在案。"}]},{"partOfSpeech":"other","definition":{"en":"(business/logistics) Distance to go: the remaining distance left to travel.","zh":"（商务/物流）DTG＝Distance to go（剩余里程/剩余距离）：指还需要走多远才能到达。"},"examples":[{"en":"What’s the DTG to the delivery point?","zh":"到送货点的DTG（剩余距离）还有多少？"},{"en":"Our DTG is about 20 miles, so we’ll arrive soon.","zh":"我们的DTG大约还有20英里，所以很快就到了。"}]}],"synonyms":["direct-to-garment printing (for printing sense)","date-time code (for communications sense)","remaining distance (for distance sense)"],"phonetic":"/ˌdiːtiːˈdʒiː/","extraExplanation":["“DTG”是缩写，不同领域意思差很多。电商/服装定制里最常见的是“直喷印花（Direct-to-garment）”；军警或正式通信文件中也可能指“日期时间组（Date-time group）”。看到DTG时，最好根据上下文（衣服/印刷、报告/电报、运输距离等）判断。"]}
{"word":"DTh","summary":{"en":"DTh is an abbreviation for Doctor of Theology, a doctoral degree in theology.","zh":"DTh 是 Doctor of Theology（神学博士）的缩写，表示神学领域的博士学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) Doctor of Theology; an academic doctoral degree in theology (the study of religion, especially Christianity).","zh":"（缩写）神学博士；神学领域的博士学位（研究宗教，尤指基督教传统）。"},"examples":[{"en":"She earned her DTh in systematic theology.","zh":"她获得了系统神学方向的神学博士（DTh）学位。"},{"en":"His email signature includes “John Smith, DTh.”","zh":"他的邮件签名里写着“John Smith, DTh.”（神学博士）。"}]}],"synonyms":["Doctor of Theology","D.Th.","ThD"],"phonetic":"/di ti eɪtʃ/","extraExplanation":["“DTh”常见于英联邦或部分神学院的学位缩写，也常写作“D.Th.”或“ThD / DMin”（不同学校体系与学位侧重不同）。在正式写作中，是否使用以及放在姓名前后（如Dr. 或 DTh）通常遵循学校或出版社格式。"]}
{"word":"DTI","summary":{"en":"DTI most commonly means “debt-to-income ratio,” a key number lenders use to evaluate loans.","zh":"DTI 最常见指“债务收入比”，是贷款机构评估借款风险的重要指标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(finance) Debt-to-income ratio: the percentage of your monthly income that goes to paying debts, used by lenders to judge how risky it is to lend you money.","zh":"（金融）债务收入比：每月收入中用于偿还债务的比例，贷款机构用它来评估借款风险。"},"examples":[{"en":"The bank denied the loan because my DTI was too high.","zh":"银行拒绝了贷款，因为我的 DTI 太高。"},{"en":"Try to lower your DTI by paying off credit card balances.","zh":"尽量通过还清信用卡欠款来降低你的 DTI。"},{"en":"Your mortgage pre-approval depends on your credit score and your DTI.","zh":"你的房贷预批准取决于信用评分和 DTI。"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation used in specific fields for different meanings (for example, some schools use DTI for “Doctor of Theology”). The intended meaning depends on context.","zh":"（通用）在不同领域有不同含义的缩写（例如某些学校用 DTI 表示“神学博士”）。具体含义取决于语境。"},"examples":[{"en":"In this report, DTI refers to debt-to-income ratio.","zh":"在这份报告中，DTI 指的是债务收入比。"},{"en":"DTI can mean different things, so check the document’s definitions first.","zh":"DTI 可能有不同含义，所以先查看文件里的定义。"}]}],"synonyms":["debt-to-income ratio","DTI ratio"],"phonetic":"/ˌdiːtiːˈaɪ/","extraExplanation":["在美国的贷款语境里，DTI 通常分为两种：前端（housing DTI，只算房贷相关支出）和后端（total DTI，把所有月度债务都算上，如房贷、车贷、学贷、信用卡最低还款等）。","常见经验值：DTI 越低越好；很多机构希望后端 DTI 大约在 36% 左右或更低，但也可能接受更高（取决于贷款类型、信用分数、首付等）。具体标准以贷款机构为准。","口语里通常直接读字母：D-T-I（“dee tee eye”）。"]}
{"word":"DTIF","summary":{"en":"DTIF is an initialism; in finance it can refer to a debt-to-income measure, and informally it can mean “Do The Impossible First.” The exact meaning depends on context.","zh":"DTIF 多为首字母缩略词；在金融中可指债务收入比等指标，口语中也可指“先做最难的”。具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(finance, mortgage lending) An abbreviation for “debt-to-income factor/ratio”: a measure comparing how much debt you pay each month to how much income you earn, used to judge affordability.","zh":"（金融/房贷）常被用来指“债务收入比（因子/比率）”：把每月债务支出与收入进行比较，用来评估负担能力。"},"examples":[{"en":"The lender checked my DTIF to see if I could afford the monthly payment.","zh":"贷款机构查看了我的 DTIF，以判断我是否负担得起月供。"},{"en":"A lower DTIF usually makes it easier to qualify for a mortgage.","zh":"DTIF 越低通常越容易通过房贷审核。"}]},{"partOfSpeech":"other","definition":{"en":"(informal motto) An abbreviation for “Do The Impossible First,” meaning to start with the hardest task before easier ones.","zh":"（非正式座右铭）可指“Do The Impossible First（先做最难的）”，意思是先从最困难的任务开始，再做简单的。"},"examples":[{"en":"My study plan is DTIF: I do the hardest chapter first.","zh":"我的学习计划是 DTIF：先做最难的一章。"},{"en":"DTIF helped the team stop procrastinating and make progress.","zh":"DTIF 帮团队减少拖延并取得进展。"}]}],"synonyms":["DTI (debt-to-income ratio)","debt-to-income ratio","prioritize the hardest task first"],"phonetic":"/ˌdiː tiː aɪ ˈɛf/","extraExplanation":["DTIF 不是一个“固定唯一”的英文单词，更常见是首字母缩略词（initialism）。不同领域（金融、公司内部系统、项目管理、网络聊天等）可能有不同展开方式。","如果你告诉我它出现的场景（例如邮件、合同、聊天、金融表格、技术文档），我可以给出更准确的含义与用法。"]}
{"word":"DTL","summary":{"en":"DTL is an initialism most commonly used to mean “down the line” (later in the future), and in technical contexts it can mean “data transfer layer.”","zh":"DTL 是一个首字母缩写，最常见表示“down the line（以后、将来）”；在技术语境中也可指“data transfer layer（数据传输层）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(initialism, informal) “down the line”; at a later time in the future.","zh":"（首字母缩写，非正式）“down the line”的缩写；意思是“将来、以后、往后”。"},"examples":[{"en":"We can talk about the details DTL once the main plan is approved.","zh":"等主要计划通过后，我们可以以后（DTL）再谈细节。"},{"en":"DTL, you might want to get more training for this role.","zh":"以后（DTL）你可能需要为这个岗位多做一些培训。"}]},{"partOfSpeech":"other","definition":{"en":"(initialism, technical) “data transfer layer”; a system/software layer that moves data between parts of an app or between systems.","zh":"（首字母缩写，技术）“data transfer layer”；指在应用内部或系统之间传输数据的一层/模块。"},"examples":[{"en":"The app’s DTL sends customer data from the website to the database.","zh":"这个应用的 DTL 把客户数据从网站传到数据库。"},{"en":"If the DTL fails, data may not sync correctly.","zh":"如果 DTL 出故障，数据可能无法正确同步。"}]}],"synonyms":["later on","in the future","eventually"],"phonetic":"/ˌdiː tiː ˈɛl/","extraExplanation":["“DTL”在不同领域可能代表很多意思（例如技术、商业、聊天缩写等）。如果你告诉我它出现的语境（短信/工作邮件/代码/报告/游戏等），我可以给出最贴切的释义和更自然的例句。"]}
{"word":"DTMF","summary":{"en":"DTMF is the touch-tone signaling system used by phone keypads.","zh":"DTMF 指电话按键产生的“触摸音/按键音”信号系统（双音多频）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dual-tone multi-frequency: a system used in telephones where each key press sends two tones (frequencies) to signal a number or command.","zh":"双音多频（DTMF）：电话按键时同时发出两种频率的音调，用来传递数字或指令的信号系统。"},"examples":[{"en":"Press 1 now, or enter your account number using DTMF.","zh":"现在按 1，或用 DTMF 输入你的账号。"},{"en":"The IVR can detect DTMF tones from a caller’s keypad.","zh":"语音菜单（IVR）可以识别来电者按键产生的 DTMF 音调。"},{"en":"DTMF is also called touch-tone signaling.","zh":"DTMF 也叫触摸音（按键音）信令。"}]}],"synonyms":["touch-tone signaling","touch-tone","dual-tone signaling"],"phonetic":"/ˌdiː tiː ɛm ɛf/","extraExplanation":["DTMF 常见于电话客服的“按键式菜单”（IVR）和语音系统中：例如“按 1 查询余额”。即使你听不到那些按键音，系统也可能仍在发送/识别 DTMF 信号。","在技术文档里也会看到“DTMF digits / DTMF tones”（DTMF 数字/音调）以及“DTMF detection”（DTMF 检测）。"]}
{"word":"DTP","summary":{"en":"DTP most commonly means “desktop publishing”; in printing it can also mean “direct-to-plate.”","zh":"DTP 最常见指“桌面出版”；在印刷行业也可指“直接制版”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"desktop publishing; the use of a computer and page-layout software to design documents for printing or digital sharing.","zh":"桌面出版；用电脑与排版软件来设计印刷品或电子文档（如宣传册、海报、简报等）。"},"examples":[{"en":"She learned DTP to make posters and flyers for the school club.","zh":"她学习桌面出版（DTP），为学校社团制作海报和传单。"},{"en":"This job requires basic DTP skills in InDesign or similar software.","zh":"这份工作需要具备 InDesign 等软件的基础桌面出版（DTP）技能。"}]},{"partOfSpeech":"n.","definition":{"en":"direct-to-plate; a printing method where digital files are transferred directly to printing plates, reducing the need for film.","zh":"直接制版；一种印刷工艺，把数字文件直接输出到印版上，减少或省去胶片等中间步骤。"},"examples":[{"en":"The printing company switched to DTP to speed up production.","zh":"这家印刷公司改用直接制版（DTP）来加快生产。"},{"en":"With DTP, revisions are easier because you work from the digital file.","zh":"使用直接制版（DTP）时，修改更方便，因为直接基于数字文件操作。"}]}],"synonyms":["desktop publishing","page layout (software)","direct-to-plate"],"phonetic":"/ˌdiː tiː ˈpiː/","extraExplanation":["“DTP”是缩写，在不同领域含义不同。日常英语里最常见的是“desktop publishing（桌面出版）”，常出现在设计、行政、市场岗位的招聘要求中。","在印刷行业里，“DTP”也常指“direct-to-plate（直接制版）”。如果你是在印刷厂、出版或包装印刷相关语境里看到，多半是这个意思。","注意：疫苗里的“白喉-破伤风-百日咳”常写作“DTP”，但在美国更常见的写法是“DTaP”（儿童用）或“Tdap”（青少年/成人加强针），拼写会因国家与疫苗类型而不同。"]}
{"word":"DTR","summary":{"en":"DTR = “define the relationship”: a talk to clarify what your dating relationship is.","zh":"DTR = “define the relationship”：指通过一次谈话来明确两人的恋爱/约会关系。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"“DTR” is an abbreviation for “define the relationship,” meaning to have a direct conversation (usually in dating) about what you are to each other (e.g., casual, exclusive, boyfriend/girlfriend).","zh":"“DTR”是“define the relationship（明确关系）”的缩写，指（多用于约会）进行一次坦白沟通，说明两人的关系到底是什么（例如暧昧/随意交往、是否排他、是否正式成为男女朋友等）。"},"examples":[{"en":"We’ve been seeing each other for a month—should we DTR?","zh":"我们约会一个月了，要不要聊一下明确关系（DTR）？"},{"en":"He said he wasn’t ready to DTR yet.","zh":"他说他还没准备好明确关系（DTR）。"},{"en":"After the DTR talk, they decided to be exclusive.","zh":"聊完明确关系（DTR）后，他们决定只跟彼此交往（排他）。"}]}],"synonyms":["define the relationship","the talk","relationship talk"],"phonetic":"ˌdiː tiː ˈɑr","extraExplanation":["“DTR”常见于短信、社交媒体和交友软件语境。很多英语文化的约会过程可能会经历“约会/相处（seeing each other）→谈清楚是否排他（exclusive）→正式在一起（official）”。“DTR”往往指的就是把这些说清楚的一次谈话，也常被称为“the talk”。","发音通常读字母：D-T-R，而不是读成一个单词。写作时常全大写（DTR），也有人写作“DTR talk”。"]}
{"word":"dtset","summary":{"en":"“dtset” is usually an informal way (often a typo) to mean “dataset,” a collection of data.","zh":"“dtset”通常是非正式写法（常见为拼写错误），意思多半是“dataset（数据集）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, computing) A misspelling or shorthand people sometimes use for “dataset,” meaning a collection of related data (often in a table or file).","zh":"（非正式／计算机语境）有时被当作“dataset”的拼写错误或简写，指“一组相关的数据”（常见于表格或数据文件）。"},"examples":[{"en":"I saved the dtset as a CSV file so we can analyze it later.","zh":"我把这个 dtset 保存成了 CSV 文件，方便我们之后分析。"},{"en":"This dtset has 10,000 rows and 12 columns.","zh":"这个 dtset 有一万行、十二列。"}]}],"synonyms":["dataset","data set","data collection","data table"],"phonetic":"/ˈdeɪtəˌsɛt/","extraExplanation":["“dtset”不是英语里的标准单词，更多见于代码变量名、文件名或聊天里的随手缩写/拼写错误。正式写作或文档中建议用标准拼写“dataset”。","如果你是在某个软件/包/函数里看到“dtset”，也可能是该工具自定义的参数名或内部缩写；可以告诉我你在哪个环境（例如 Python/R/SQL/Stata/某个库）里看到它，我能更精确解释。"]}
{"word":"DTSS","summary":{"en":"DTSS is an acronym; most often it means “Distributed Temperature Sensing System,” but the exact meaning depends on context.","zh":"DTSS是一个缩写；最常见指“分布式温度传感系统”，但具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in technical fields; most commonly short for “Distributed Temperature Sensing System,” a system that measures temperature along a long cable or fiber (often in pipelines, wells, or power cables).","zh":"一个在技术领域使用的缩写；最常见指“Distributed Temperature Sensing System（分布式温度传感系统）”，用于沿着长电缆或光纤连续测量温度（常用于管道、井筒或电力电缆等）。"},"examples":[{"en":"The engineers installed a DTSS to monitor temperature changes along the pipeline.","zh":"工程师安装了DTSS来监测管道沿线的温度变化。"},{"en":"DTSS data helped the team find a hot spot and prevent equipment damage.","zh":"DTSS数据帮助团队发现过热点，避免设备损坏。"}]},{"partOfSpeech":"other","definition":{"en":"a context-dependent acronym that can have other meanings in specific organizations or documents (you need the surrounding context to be sure).","zh":"一个强依赖语境的首字母缩写，在不同机构或文件里可能代表其他含义（需要上下文才能确定）。"},"examples":[{"en":"In this report, DTSS refers to a specific internal system, not a temperature sensor.","zh":"在这份报告中，DTSS指的是一个特定的内部系统，而不是温度传感系统。"},{"en":"Could you tell me what DTSS stands for in your company?","zh":"你能告诉我在你们公司DTSS代表什么吗？"}]}],"synonyms":["DTS system","distributed temperature sensing"],"phonetic":"/ˌdiː tiː ɛs ˈɛs/","extraExplanation":["DTSS通常按字母逐个读：D-T-S-S。","因为缩写在不同领域可能重复使用，如果你把DTSS出现的句子或行业（例如：油气、光纤测温、IT系统、学校/机构名称）发我，我可以帮你锁定最准确的释义，并补充更贴合的例句。"]}
{"word":"DTU","summary":{"en":"DTU is most commonly the acronym for the Technical University of Denmark; it can also mean different things depending on context.","zh":"DTU 最常见是“丹麦技术大学”的缩写；也可能在不同语境中代表不同含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Technical University of Denmark (Danmarks Tekniske Universitet), a major engineering and science university in Denmark.","zh":"（缩写）丹麦技术大学（Danmarks Tekniske Universitet），丹麦著名的理工类大学。"},"examples":[{"en":"She got her master’s degree at DTU.","zh":"她在 DTU 读了硕士。"},{"en":"DTU is known for engineering, design, and technology research.","zh":"DTU 以工程、设计与技术研究闻名。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) A set of letters that can stand for different things depending on the field or context (for example, a company name, a campus unit, or a technical term).","zh":"（缩写）一组字母，在不同领域或语境中可能代表不同含义（例如公司名、部门名或技术术语）。"},"examples":[{"en":"What does DTU stand for in this document?","zh":"在这份文件里，DTU 代表什么？"},{"en":"DTU can mean different things in different industries.","zh":"DTU 在不同行业里可能有不同含义。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"ˌdiːtiːˈjuː","extraExplanation":["“DTU”最常见的国际用法是指丹麦技术大学（Technical University of Denmark）。在阅读材料里如果没有明确提示（如学校、地点、工程研究），最好直接问“DTU stands for what here?” 来确认具体含义。"]}
