{"word":"DW","summary":{"en":"DW most commonly means “don’t worry” in texting; it can also refer to Deutsche Welle in news contexts.","zh":"DW最常见是聊天里“don’t worry（别担心）”的缩写；在新闻语境中也可能指Deutsche Welle（德国之声）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Texting/chat abbreviation for “don’t worry.” Used to reassure someone.","zh":"聊天/短信缩写，表示“别担心/不用担心”，用来安慰对方。"},"examples":[{"en":"Sorry I’m late—DW, I just got here too.","zh":"不好意思我迟到了——别担心，我也刚到。"},{"en":"DW about the mistake; we can fix it.","zh":"这个错误别担心，我们可以改。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “Deutsche Welle,” Germany’s international public broadcaster (often seen in news).","zh":"“Deutsche Welle（德国之声）”的缩写，德国的国际公共媒体（新闻中常见）。"},"examples":[{"en":"I read the report on DW News.","zh":"我在DW News（德国之声新闻）上读了那篇报道。"}]}],"synonyms":["don’t worry","no worries","it’s okay","no problem"],"phonetic":"/doʊnt ˈwɝi/","extraExplanation":["“DW=don’t worry”多用于非正式场合（聊天、短信、社媒评论）。在正式邮件或工作写作中，更常用完整表达，如“Don’t worry.” “No worries.” “It’s okay.”","如果对方不熟悉缩写，直接写“Don’t worry”会更清楚。"]}
{"word":"dwaible","summary":{"en":"“Dwaible” is usually a surname (a last name), not a standard English word.","zh":"“Dwaible”通常是姓氏（人名中的姓），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). It is not a common English vocabulary word; it’s typically used as a person’s last name.","zh":"姓氏（家族名）。它不是常见的英文词汇，通常用作人的姓。"},"examples":[{"en":"Ms. Dwaible will present the report today.","zh":"Dwaible 女士今天将做报告。"},{"en":"I met Dr. Dwaible at the conference.","zh":"我在会议上遇到了 Dwaible 博士。"}]}],"phonetic":"/ˈdwaɪbəl/","extraExplanation":["“Dwaible”更像是专有名词（姓氏），而不是可查到的常用英语单词，因此通常没有像普通词汇那样固定的词义、同义词或用法搭配。","发音可能因家庭或地区而不同；如果你是在某篇文章、名单或邮件里看到它，最可靠的方式是参考当事人自我介绍、公司目录的语音标注，或直接礼貌询问对方“Could you tell me how to pronounce your last name?”。"]}
{"word":"dwaibly","summary":{"en":"“dwaibly” is not a standard English word; it is likely a misspelling (possibly “durably” or “amiably”).","zh":"“dwaibly”不是标准英语单词，可能是拼写错误（常见可能是“durably”或“amiably”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a typo.","zh":"不是标准英语单词，可能是拼写错误或打字错误。"},"examples":[{"en":"“dwaibly” isn’t found in most English dictionaries—did you mean “durably” or “amiably”?","zh":"“dwaibly”在大多数英语词典里查不到——你是不是想写“durably（耐久地）”或“amiably（友善地）”？"}]},{"partOfSpeech":"adv.","definition":{"en":"Possible intended word: “durably” (in a durable way; able to last).","zh":"可能你想写：durably（耐久地；经久耐用地）。"},"examples":[{"en":"This jacket is made durably and should last for years.","zh":"这件夹克做得很耐用，应该能穿好几年。"},{"en":"We need a solution that works durably, not just for one week.","zh":"我们需要一个能长期奏效的方案，而不是只管一周。"}]},{"partOfSpeech":"adv.","definition":{"en":"Possible intended word: “amiably” (in a friendly, pleasant way).","zh":"可能你想写：amiably（友善地；和气地）。"},"examples":[{"en":"They disagreed but spoke amiably throughout the meeting.","zh":"他们虽然意见不同，但整个会议中都和气地交谈。"},{"en":"She smiled amiably and introduced herself.","zh":"她友善地笑了笑并做了自我介绍。"}]}],"synonyms":["durably","amiably"],"extraExplanation":["“dwaibly”很可能是键盘误触或自动纠错造成的拼写。你可以告诉我：\n1）它出现在哪个句子里？\n2）你想表达“耐用/长期”（durably）还是“友善/和气”（amiably），或是别的意思？\n我就能更准确地帮你确认正确单词。"]}
{"word":"Dwain","summary":{"en":"Dwain is a male first name, commonly treated as a variant spelling of Dwayne.","zh":"Dwain 是男性名字，通常被视为 Dwayne 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (a spelling variant of “Dwayne”), used as a person’s first name.","zh":"男性名字（常被视为“Dwayne”的一种拼写变体），用作人的名字。"},"examples":[{"en":"Dwain moved to Chicago for a new job.","zh":"Dwain 为了新工作搬到了芝加哥。"},{"en":"Please ask Dwain if he can join the meeting at 3 p.m.","zh":"请问一下 Dwain 能不能在下午三点参加会议。"}]}],"synonyms":["Dwayne","Duane"],"phonetic":"/dweɪn/","extraExplanation":["“Dwain”多见于英语国家的人名拼写变体，发音通常与“Dwayne”相同。","常见来源解释之一是与爱尔兰姓氏“Duane”相关（在英语中逐渐演变为不同拼写，如 Dwayne、Dwain）。在人名里，拼写差异往往与家庭习惯、地区偏好或个人选择有关。"]}
{"word":"Dwaine","summary":{"en":"Dwaine is a male first name, a less common spelling of Duane.","zh":"Dwaine是男性名字，属于Duane的较少见拼写形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name; a less common spelling variant of “Duane.”","zh":"男性名字；“Duane”的一种不太常见的拼写变体。"},"examples":[{"en":"Dwaine moved to Chicago for a new job.","zh":"Dwaine为了新工作搬到了芝加哥。"},{"en":"My uncle’s name is Dwaine, but people sometimes misspell it as Duane.","zh":"我叔叔叫Dwaine，但人们有时会把它拼成Duane。"}]}],"synonyms":["Duane"],"phonetic":"/dweɪn/","extraExplanation":["“Dwaine”通常被视为“Duane”的变体拼写，在美国英语里两者读音一般相同。","“Duane”这个名字在英语世界较常见，传统上多被认为与爱尔兰/盖尔语姓氏来源有关；“Dwaine”则更多是个人或家庭偏好的拼写方式。"]}
{"word":"Dwale","summary":{"en":"Dwale is an old word for deadly nightshade (belladonna) or a sedative/poison made from it.","zh":"Dwale 是一个古语词，指致命颠茄（belladonna）或由其制成的镇静剂／毒药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) Deadly nightshade (belladonna), a poisonous plant once used in medicine and folklore.","zh":"（古语）颠茄／致命莨菪（belladonna），一种有毒植物，过去曾用于医药与民俗传说。"},"examples":[{"en":"In old herbals, dwale was listed as a dangerous plant that could cause sleep or death.","zh":"在早期的草药书中，dwale 被列为危险植物，可能导致昏睡甚至死亡。"},{"en":"The story warns children not to touch dwale berries in the woods.","zh":"故事告诫孩子不要碰森林里的 dwale 浆果。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) A drug or drink made from such plants, used as a strong sedative or poison.","zh":"（古语）由此类植物制成的药物或饮料，用作强力镇静剂或毒药。"},"examples":[{"en":"The character was given dwale and fell into a deep sleep.","zh":"那个人物被灌下 dwale，随即陷入沉睡。"},{"en":"In medieval tales, dwale appears as a potion used for dark purposes.","zh":"在中世纪故事里，dwale 常被写成用于阴暗目的的药水。"}]}],"synonyms":["belladonna","deadly nightshade","nightshade","poison (in archaic contexts)"],"phonetic":"/dweɪl/","extraExplanation":["“dwale”多见于中古英语与苏格兰英语语境，现代英语里很少使用，阅读古诗歌、民谣或历史小说时更可能遇到。","在文学与民俗传统中，它常与“沉睡、迷乱、危险的药草”这一意象相连；如果你在文本里看到它，通常是在营造阴郁、神秘或古老的氛围。"]}
{"word":"dwale","summary":{"en":"Dwale is an old word for deadly nightshade (belladonna), a poisonous plant linked to sleepiness or poisoning.","zh":"Dwale 是“颠茄/致命莨菪（belladonna）”的旧称，一种有毒植物，常与催眠或中毒联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous plant (deadly nightshade, belladonna) once used in herbal medicine and also associated with sleepiness or poisoning","zh":"一种有毒植物（颠茄／致命莨菪，belladonna），旧时用于草药疗法，也常与催眠或中毒相关"},"examples":[{"en":"In old stories, dwale was feared because a small dose could poison a person.","zh":"在古老故事里，人们害怕 dwale，因为少量就可能让人中毒。"},{"en":"The healer warned that dwale should never be taken without expert knowledge.","zh":"医者警告说，不懂专业知识绝不要服用 dwale。"}]}],"synonyms":["deadly nightshade","belladonna","nightshade"],"phonetic":"/dweɪl/","extraExplanation":["“dwale”是古语/方言词，常见于苏格兰与中古英语语境；现代英语更常说“deadly nightshade”或“belladonna”。","它在文学中常带有“催眠、麻痹、致命毒性”的意象；有些读者会把它和莎士比亚作品里出现的“sleeping potion/poison”类意象联系起来。"]}
{"word":"dwalm","summary":{"en":"“dwalm” isn’t a standard English word; it likely needs context or is a misspelling.","zh":"“dwalm”不是标准英语词；多半需要上下文或是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a name.","zh":"不是标准英语单词；更可能是拼写错误或专有名词（如人名/地名）。"},"examples":[{"en":"I couldn’t find “dwalm” in an English dictionary—did you mean “dwell” or “psalm”?","zh":"我在英语词典里找不到“dwalm”——你是不是想写“dwell”或“psalm”？"}]}],"phonetic":"N/A","extraExplanation":["“dwalm”在常见英语词典中通常没有词条。如果你是在聊天、歌词、游戏ID或某个专有名词里看到它，可能是：\n1）拼写错误：例如 dwell（居住；停留；细想）或 psalm（《诗篇》中的圣诗）。\n2）外来语/方言/名字：需要上下文才能判断。\n把你看到它的句子（或截图）发我，我可以更准确地解释。"]}
{"word":"Dwamish","summary":{"en":"Duwamish refers to a Native American people of the Seattle area, things related to them, and also the Duwamish River in Washington State.","zh":"Duwamish 指西雅图地区的杜瓦米什族，也可指与其相关的文化/语言，并常指华盛顿州的杜瓦米什河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people from the Seattle–Puget Sound area of Washington State (USA).","zh":"（美国华盛顿州西雅图—普吉特海湾一带的）杜瓦米什族；当地原住民民族。"},"examples":[{"en":"The Duwamish are the Indigenous people of the Seattle area.","zh":"杜瓦米什族是西雅图地区的原住民。"},{"en":"Many place names around Seattle reflect Duwamish history.","zh":"西雅图周边许多地名都反映了杜瓦米什族的历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Duwamish people, their culture, or their language.","zh":"杜瓦米什族的；与杜瓦米什族文化或语言有关的。"},"examples":[{"en":"The museum hosts a Duwamish cultural event each year.","zh":"这家博物馆每年都会举办杜瓦米什族文化活动。"},{"en":"She is learning about Duwamish traditions and storytelling.","zh":"她正在了解杜瓦米什族的传统与口述故事。"}]},{"partOfSpeech":"n.","definition":{"en":"the Duwamish River, a river that flows through the Seattle area in Washington State.","zh":"杜瓦米什河（位于美国华盛顿州西雅图地区的一条河流）。"},"examples":[{"en":"They kayaked along the Duwamish on a sunny afternoon.","zh":"在一个晴朗的下午，他们沿着杜瓦米什河划皮艇。"},{"en":"Environmental groups are working to restore habitats along the Duwamish.","zh":"环保团体正在努力修复杜瓦米什河沿岸的栖息地。"}]}],"synonyms":["Duwamish (standard spelling)"],"phonetic":"ˈduːwɑːmɪʃ","extraExplanation":["你输入的拼写“Dwamish”更常见的标准拼写是 **Duwamish**（杜瓦米什）。在英文中它既可指族群，也可指“Duwamish River”（杜瓦米什河）。","在西雅图的历史语境中，Duwamish 常与部族领袖 Chief Si’ahl（也写作 Chief Seattle）以及普吉特海湾地区的原住民历史联系在一起。","用法提示：作为专有名词通常首字母大写（Duwamish）；作形容词也常大写（Duwamish culture）。"]}
{"word":"Dwan","summary":{"en":"Dwan is mainly used as a surname (and sometimes a given name). It is also often a misspelling of “dawn.”","zh":"Dwan 主要用作姓氏（有时也作名字），也常被误写为 dawn（黎明/开端）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); also used as a given name in some places","zh":"姓氏（家族姓）；在一些地区也可作名字"},"examples":[{"en":"Her last name is Dwan.","zh":"她的姓是 Dwan。"},{"en":"Mr. Dwan will speak at the meeting today.","zh":"Dwan 先生今天会在会议上发言。"}]},{"partOfSpeech":"other","definition":{"en":"(common confusion) a misspelling of “dawn,” meaning the first light of day or the beginning of something","zh":"（常见混淆）“dawn”的误拼，意为“黎明；开端”"},"examples":[{"en":"If you mean the morning, the correct spelling is dawn.","zh":"如果你想表达“早晨/黎明”，正确拼写是 dawn。"},{"en":"We left at dawn.","zh":"我们在黎明时出发。"}]}],"synonyms":["(as a name) no true synonyms","(if you meant “dawn”) daybreak, sunrise (near-meaning)"],"phonetic":"/dwɑn/","extraExplanation":["“Dwan”更常见于英语国家的姓氏拼写；发音会因家庭或地区而不同。若你是在写“黎明/开始”的意思，通常应写作“dawn”。"]}
{"word":"Dwane","summary":{"en":"Dwane is a male first name, a less common variant spelling of Duane.","zh":"Dwane 是男性名字，通常是 Duane 的较少见变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name; a less common spelling variant of “Duane.”","zh":"男性名字；较少见的拼写形式，常见对应为“Duane”。"},"examples":[{"en":"Dwane moved to Chicago for a new job.","zh":"Dwane 为了新工作搬到了芝加哥。"},{"en":"My teacher’s name is Dwane.","zh":"我老师的名字是 Dwane。"}]}],"synonyms":["Duane"],"phonetic":"/dweɪn/","extraExplanation":["“Dwane”通常被视为“Duane”的变体拼写；在英语国家中并不如“Duane”常见。","“Duane”这个名字常被认为与爱尔兰盖尔语名字有关（有时被解释为与“dark/黑暗、深色”相关的词源），但具体来源在不同资料中可能有差异。"]}
{"word":"dwang","summary":{"en":"“dwang” is an informal internet sound effect meaning something happens suddenly with dramatic impact or a flashy effect.","zh":"“dwang”是非正式网络拟声词，表示事情突然发生并带有夸张的冲击感或“特效感”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang) A made-up sound effect used to suggest something happens suddenly, with dramatic impact or a flashy “special effect.” Often written to mimic a comic-book sound.","zh":"（网络俚语）一种编出来的拟声词，用来表示某事“突然发生、效果很炸/很夸张”，像加了特效或漫画音效一样。"},"examples":[{"en":"I opened the app and—dwang—an ad popped up full screen.","zh":"我一打开应用——dwang——一个广告全屏跳出来。"},{"en":"He edited the video so the punch lands with a big “dwang.”","zh":"他剪视频时让那一拳落下时配了一个很大的“dwang”音效。"},{"en":"The lights went out and then dwang, the stage lit up in gold.","zh":"灯一灭，然后dwang一下，舞台变成金色亮起来。"}]}],"synonyms":["bam","bang","boom","whoosh","pow"],"phonetic":"/dwæŋ/","extraExplanation":["“dwang”常被当作“duang”的变体拼写（也有人写作 dwang/duang/duang~），本质上是用字母拼出一个不存在于标准英语里的音效词。","它在中文网络文化中更常见，常用来吐槽“特效很假/很夸张”或强调“突然出现的效果”。在正式英语写作中不常用；更自然的英语替代可以是：*bam*, *bang*, *boom*, *whoosh*（按语境选择）。"]}
{"word":"DWAPS","summary":{"en":"DWAPS is usually an acronym; its meaning depends on context.","zh":"DWAPS 通常是缩略词；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism for a longer phrase; the exact meaning depends on the field or context (e.g., a company name, a technical system, or an internal project code).","zh":"一个首字母缩略词；具体含义取决于使用领域或语境（例如公司名称、技术系统、或内部项目代号）。"},"examples":[{"en":"What does DWAPS stand for in this document?","zh":"在这份文件里，DWAPS 代表什么？"},{"en":"I saw “DWAPS” in a report, but there wasn’t enough context to understand it.","zh":"我在报告里看到“DWAPS”，但上下文不足，无法判断它的意思。"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/ˌdiːˌdʌbəl.juːˌeɪˌpiːˌɛs/","extraExplanation":["“DWAPS”不是一个在通用英语里广泛固定的单词，更常见的用法是作为字母缩写（按字母逐个读）。如果你能提供它出现的句子、行业（如IT、医疗、军事、商业）、或所在国家/地区，我可以帮你准确拆解它的全称与含义。"]}
{"word":"dwarf","summary":{"en":"“Dwarf” can mean a very short person (sensitive term), a small plant/animal type, a fantasy dwarf, or the verb meaning “to make seem small / greatly exceed.”","zh":"“dwarf”可指（用在人上较敏感的）矮个子人士、矮化动植物、奇幻作品中的矮人，也可作动词表示“使相形见绌/远远超过”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person of unusually short height (often called “a little person”; some people find “dwarf” sensitive or offensive when used about real people)","zh":"身材异常矮小的人（更常用且更尊重的说法是“little person/身材矮小者”；用“dwarf”指现实中的人有时会被认为不礼貌或冒犯）"},"examples":[{"en":"Many people prefer the term “little person” instead of “dwarf.”","zh":"很多人更倾向用“little person/身材矮小者”，而不是“dwarf”。"},{"en":"The actor is a little person and has spoken about inclusion in film.","zh":"这位演员身材矮小，并谈到电影行业的包容性。"}]},{"partOfSpeech":"n.","definition":{"en":"a very small version of something, especially a plant or animal (e.g., a dwarf tree)","zh":"（尤指动植物）矮小型的、迷你版的个体（如：矮化树/矮生品种）"},"examples":[{"en":"They planted a dwarf apple tree in the backyard.","zh":"他们在后院种了一棵矮化苹果树。"},{"en":"Dwarf varieties are popular in small gardens.","zh":"矮生品种在小花园里很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"a dwarf-like mythical being in folklore and fantasy literature","zh":"（民间传说与奇幻文学中的）矮人、侏儒族"},"examples":[{"en":"In many stories, dwarves are skilled miners and metalworkers.","zh":"在很多故事里，矮人擅长采矿和锻造。"},{"en":"Tolkien’s dwarves helped shape modern fantasy.","zh":"托尔金笔下的矮人形象影响了现代奇幻文学。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something seem small or unimportant by comparison; to greatly exceed in size, amount, or importance","zh":"使……相形见绌；（在规模、数量或重要性上）远远超过"},"examples":[{"en":"Their new headquarters dwarfs the old building.","zh":"他们的新总部大楼让旧楼相形见绌。"},{"en":"The cost of repairs dwarfed our original budget.","zh":"维修费用远远超出了我们最初的预算。"}]}],"synonyms":["outshine","overshadow","tower over","miniature (n./adj.)","small-scale (adj.)"],"phonetic":"/dwɔrf/","extraExplanation":["用词与礼貌：在谈到现实中的人时，“dwarf”可能带有冒犯或物化的感觉。更常见、更尊重的表达是“a little person / a person with dwarfism（患侏儒症的人）”。在医学或组织名称中仍会出现“dwarfism”（如某些患者组织），但日常交流建议优先用更尊重的说法。","文学与文化：英语里的“dwarf/dwarves”常出现在北欧神话与奇幻作品中（如《霍比特人》《魔戒》传统）。复数既可用“dwarfs”（更一般/生物学用法常见），也可用“dwarves”（奇幻文学更常见）。"]}
{"word":"dwarfed","summary":{"en":"“Dwarfed” means made to seem very small or less important by comparison.","zh":"“dwarfed”表示因对比而显得很小或不重要（被“比下去”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to seem small, unimportant, or weak when compared with something much larger or more powerful.","zh":"（与更大/更强的事物相比）显得很小、微不足道或被“比下去”的。"},"examples":[{"en":"Their tiny village was dwarfed by the surrounding mountains.","zh":"他们的小村庄在周围群山的映衬下显得很渺小。"},{"en":"Her achievements were dwarfed by her sister’s international fame.","zh":"与姐姐的国际名声相比，她的成就显得不那么起眼。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make someone or something seem small, less important, or less impressive by comparison.","zh":"使（某人/某物）相形见绌；使显得渺小、不重要或不出彩。"},"examples":[{"en":"The new skyscraper dwarfed the older buildings downtown.","zh":"这座新摩天大楼让市中心的老建筑显得矮小了。"},{"en":"The scale of the disaster dwarfed everything we had prepared for.","zh":"灾难的规模让我们此前的一切准备都显得不够用了。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become small or insignificant compared with something else.","zh":"相形见绌；显得微不足道。"},"examples":[{"en":"Next to her confidence, his worries seemed to dwarf.","zh":"在她的自信面前，他的担忧显得不值一提。"}]}],"synonyms":["overshadowed","outclassed","eclipsed","diminished","made to look small"],"phonetic":"/dwɔrft/","extraExplanation":["“dwarfed”是动词dwarf的过去式/过去分词，也常当形容词用。学习时可以把它和比较结构一起记：be dwarfed by（被……比下去）、dwarf A（A相形见绌/被压过）。","注意语感：dwarf在这个常用比喻义里通常不带冒犯；但当它直接指“侏儒/矮人”时，涉及对身高或残障的称呼，语境要谨慎，更礼貌的说法往往是“a person with dwarfism（侏儒症患者）”。"]}
{"word":"dwarfer","summary":{"en":"“Dwarfer” is a rare/nonstandard word, usually meaning “smaller/shorter (more dwarf-like),” and very rarely “something that makes others seem small.”","zh":"“dwarfer”是罕见/非标准用法，多指“更小/更矮（更像矮小的）”，极少指“让他者显得渺小的事物/人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare/nonstandard) Comparative form of “dwarf”: smaller or shorter than something else; more dwarfed.","zh":"（罕见/非标准）“dwarf”的比较级：更小、更矮；更显得“被比下去/相形见绌”。"},"examples":[{"en":"In the old photo, the cottage looks dwarfer beside the new hotel.","zh":"在那张老照片里，小屋在新酒店旁边显得更小。"},{"en":"The sapling seemed even dwarfer after the storm knocked down nearby trees.","zh":"暴风雨过后，周围的树倒了，小树苗反而显得更矮小了。"}]},{"partOfSpeech":"n.","definition":{"en":"(very rare) Someone or something that dwarfs others (makes them seem small or unimportant).","zh":"（非常罕见）使他者显得渺小或不重要的人或事物。"},"examples":[{"en":"In the debate, her calm logic was the dwarfer of everyone else’s arguments.","zh":"在辩论中，她冷静的逻辑让其他人的论点都显得逊色。"}]}],"synonyms":["smaller","shorter","more diminutive","more dwarfed","(verb) dwarf"],"phonetic":"/ˈdwɔrfɚ/","extraExplanation":["“dwarfer”在现代英语里不常见。表达“更矮/更小”通常用“smaller/shorter”，表达“相形见绌”更常用动词“to dwarf”（如：The skyscraper dwarfs the old church.）。","如果你想指“矮人/侏儒”，名词通常是“dwarf”（奇幻文学中常见，如《指环王》里的 Dwarves）。但在现实语境里，谈到身高障碍者更礼貌的说法是“a person with dwarfism（侏儒症患者/身材矮小症人士）”，避免用可能冒犯的称呼。"]}
{"word":"dwarfest","summary":{"en":"“Dwarfest” means “the smallest” or “most insignificant,” but it’s uncommon; speakers often say “smallest/tiniest.”","zh":"“dwarfest”表示“最小的/最微不足道的”，但并不常见；更常用的是“smallest / tiniest”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “dwarfish” or “dwarf”) the smallest; most tiny in size, amount, or importance compared with others.","zh":"（“dwarfish / dwarf”的最高级）最小的；最微小的（在体积、数量或重要性上远不如其他的）。"},"examples":[{"en":"Of all the puppies, the runt was the dwarfest and needed extra care.","zh":"在所有小狗里，那只最弱小的一只是最小的，需要额外照顾。"},{"en":"Even the dwarfest detail can change the meaning of a contract.","zh":"哪怕最细微的细节也可能改变合同的含义。"}]}],"synonyms":["smallest","tiniest","least","most minor","most insignificant"],"phonetic":"/ˈdwɔrfɪst/","extraExplanation":["“dwarfest”在现代英语中不算常见；更自然、更常用的表达通常是：the smallest / the tiniest / the least significant。","它来自“dwarf（矮人；使显得矮小/渺小）”。在比较级/最高级的表达上，很多人会改用 more/most dwarfish，或直接用 smaller/smallest 来避免生硬。","注意礼貌与文化敏感：dwarf 也可指患有侏儒症的人群相关用语；描述人的身高或身体状况时，尽量避免用“dwarf”作形容词贬义地形容他人，除非是在明确、尊重的医学或自我认同语境中。"]}
{"word":"dwarfing","summary":{"en":"“Dwarfing” describes something so large or impressive that it makes other things seem small; it can also mean becoming stunted in growth.","zh":"“dwarfing”表示某物大到/强到让其他事物显得渺小，也可表示生长发育不良、矮化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making something else look small, unimportant, or less impressive by comparison","zh":"（通过对比）使别的事物显得矮小、微不足道或不那么令人印象深刻"},"examples":[{"en":"The new skyscraper is dwarfing the older buildings nearby.","zh":"这座新摩天大楼让附近的老建筑显得很矮小。"},{"en":"Her achievements ended up dwarfing mine.","zh":"她的成就最终让我的成就显得不值一提。"}]},{"partOfSpeech":"vt.","definition":{"en":"(present participle of “dwarf”) to make something seem small or less important; to overshadow","zh":"（“dwarf”的现在分词）使……显得渺小/不重要；使相形见绌"},"examples":[{"en":"The huge budget is dwarfing what the smaller teams can afford.","zh":"巨额预算让小团队能承担的费用相形见绌。"},{"en":"The mountains, dwarfing the town below, looked almost unreal at sunset.","zh":"群山俯视着山下的小镇，日落时看起来几乎不真实。"}]},{"partOfSpeech":"vi.","definition":{"en":"growing or becoming much smaller than normal; becoming stunted","zh":"（生长）发育不良、变得比正常小很多；矮化"},"examples":[{"en":"Without enough sunlight, the plants were dwarfing in the corner.","zh":"由于阳光不足，那些植物在角落里长得越来越矮小。"}]}],"synonyms":["overshadowing","outshining","eclipsing","towering over","making (something) look small"],"phonetic":"/ˈdwɔrfɪŋ/","extraExplanation":["“dwarfing”常用于强调强烈对比：A is dwarfing B（A让B显得很小/很逊色）。语气通常比“bigger than”更夸张，更有画面感。","写作中常见结构：名词 + dwarfing + 名词（如 “mountains dwarfing the village”），相当于用分词短语做后置定语，营造“被巨大事物包围”的视觉效果。"]}
{"word":"dwarfish","summary":{"en":"Dwarfish means very small or dwarf-like; it can be neutral for things but may sound offensive for people.","zh":"dwarfish表示“很矮小/像侏儒一样”；形容事物多为中性，但形容人时可能带冒犯性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very small in size or stature; like a dwarf.","zh":"矮小的；像侏儒一样的（体型或规模很小）。"},"examples":[{"en":"The garden had some dwarfish trees that only grew to waist height.","zh":"花园里有些矮小的树，最高只到腰部。"},{"en":"He lived in a dwarfish apartment, but it felt cozy and well organized.","zh":"他住在一间很小的公寓里，但感觉温馨又整洁。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes offensive when describing a person) Having the body size associated with dwarfism.","zh":"（描述人的身体时有时带冒犯性）具有与侏儒症相关的体型特征。"},"examples":[{"en":"It’s better to say “a person with dwarfism” rather than “a dwarfish person.”","zh":"更好的说法是“有侏儒症的人”，而不是“矮人似的/侏儒般的人”。"},{"en":"The book avoids calling characters “dwarfish” and uses more respectful language.","zh":"这本书避免用“dwarfish”称呼角色，而是使用更尊重的措辞。"}]}],"synonyms":["small","tiny","miniature","diminutive","undersized"],"phonetic":"/ˈdwɔɹ.fɪʃ/","extraExplanation":["“dwarfish”来自“dwarf（矮人/侏儒）+ -ish（有点像……的）”。在日常描述物体、空间、数量时很常见且中性（如dwarfish house/trees）。但用来形容真实的人时可能显得不尊重；更推荐使用“short”（矮的）或“a person with dwarfism”（有侏儒症的人）等更中性的表达。","在奇幻文学语境中（如涉及“dwarves/矮人”族群的作品），dwarfish常用来表示“矮人族风格的/矮人般的”，例如dwarfish craftsmanship（矮人般精湛的工艺）。"]}
{"word":"dwarfishly","summary":{"en":"“Dwarfishly” means “in a very small/short, dwarf-like way,” usually describing size or proportions; it can be sensitive or offensive if used about real people.","zh":"“dwarfishly”表示“以非常矮小、侏儒般的方式”，多用于描述大小或比例；若用于真实的人，可能敏感或带冒犯性。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a dwarfish manner; in a way that is very small, short, or resembling a dwarf (often describing appearance or proportions).","zh":"以矮小的方式；形容非常小、很矮，或带有“侏儒般”特征的样子（常用于外貌或比例）。"},"examples":[{"en":"The model village was dwarfishly tiny, with houses no bigger than a hand.","zh":"那个模型村庄小得侏儒般，房子还没有一只手大。"},{"en":"In the painting, the trees look dwarfishly stunted beside the towering mountains.","zh":"在那幅画里，树木在高耸的群山旁显得矮小而发育不良。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Sometimes offensive when describing people) In a way that suggests someone is like a dwarf; used in older writing or fantasy contexts.","zh":"（用于形容人时有时带冒犯性）以“像矮人/侏儒”的方式；常见于较旧的文字或奇幻语境。"},"examples":[{"en":"The author described the character as dwarfishly built, with broad shoulders and short legs.","zh":"作者把这个角色写成侏儒般的体格：肩宽腿短。"},{"en":"It’s better to avoid using “dwarfishly” about real people unless they choose that language themselves.","zh":"除非当事人自己使用这种说法，否则最好避免用“dwarfishly”来形容真实的人。"}]}],"synonyms":["smallly","stuntedly","compactly","minutely"],"phonetic":"/ˈdwɔɹ.fɪʃ.li/","extraExplanation":["“dwarfishly”来自形容词“dwarfish”（像矮人/侏儒的）+ 副词后缀“-ly”。在描写物体、建筑、比例（如“dwarfishly small/tiny/stunted”）时较中性；用于形容真实的人可能涉及对身高或侏儒症的刻板印象，语气容易伤人。更中性的替代说法包括：“very short / unusually small / compact / undersized”。","在奇幻文学里，“dwarfish”常与“dwarven/dwarvish”并列：前者偏“外形矮壮”，后两者更常指“矮人一族/矮人文化”（如“dwarven kingdom”）。因此写作时可根据你想表达的是“体貌特征”还是“种族/文化”来选词。"]}
{"word":"dwarfishness","summary":{"en":"“Dwarfishness” means the state of being unusually small or short, literally or figuratively (limited in scale).","zh":"“dwarfishness”指异常矮小的状态，也可比喻规模/格局很小。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being dwarfish; unusually small or short in size, height, or scale.","zh":"矮小的特质；呈现“像侏儒般”的状态（在身高、体型或规模上异常矮小）。"},"examples":[{"en":"The dwarfishness of the seedlings showed they weren’t getting enough sunlight.","zh":"幼苗长得很矮小，说明它们没有得到足够的阳光。"},{"en":"He criticized the dwarfishness of the proposal, saying it lacked ambition.","zh":"他批评这个提案“格局太小”，说它缺乏雄心。"}]}],"synonyms":["smallness","shortness","diminutiveness","tininess"],"phonetic":"/ˈdwɔɹfɪʃnəs/","extraExplanation":["“dwarfishness”来自形容词 dwarfish（像侏儒的、矮小的）+ 名词后缀 -ness（表示“……的状态/性质”）。","这个词既可用于字面意义（身材、植物、物体很矮小），也可用于比喻意义（规模小、气度小、缺乏宏大格局）。在描述人时要注意语气：带有评价色彩，可能让人不适。更中性、更礼貌的说法常用 short stature（身高较矮）、small size（尺寸较小）、limited scope（范围有限）等。"]}
{"word":"dwarfism","summary":{"en":"Dwarfism is a medical condition that causes a person to be much shorter than average, usually because of genetic or growth-related factors.","zh":"Dwarfism（侏儒症）是一种医学状况，通常因遗传或生长相关因素导致身高显著低于平均水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which a person has significantly shorter stature than average due to genetic or medical causes (often related to bone growth).","zh":"一种医学状况：由于遗传或其他医学原因（常与骨骼生长有关），导致身高明显低于平均水平。"},"examples":[{"en":"The doctor explained that dwarfism can have different causes, so testing is important.","zh":"医生解释说，侏儒症可能有不同原因，因此进行检查很重要。"},{"en":"Some forms of dwarfism affect limb length, while others affect overall growth.","zh":"有些类型的侏儒症会影响四肢长度，而另一些会影响整体生长。"}]}],"synonyms":["short stature (medical)","restricted growth","skeletal dysplasia (broader/medical)"],"phonetic":"/ˈdwɔɹfɪzəm/","extraExplanation":["“dwarfism”是医学术语，较中性；日常谈论人时更建议用以人为本的表达，如“a person with dwarfism（患有侏儒症的人）”。","“dwarf”既可作名词也可作形容词，但用来称呼现实中的人可能被认为不礼貌或带有歧视色彩；更尊重的说法常用“little person（身材矮小者/小个子人士）”，具体用法可依个人偏好。","在科普或医疗语境中也常见更具体的诊断名，如“achondroplasia（软骨发育不全）”，它是侏儒症中较常见的一种类型。"]}
{"word":"dwarfisms","summary":{"en":"“Dwarfisms” is the plural of “dwarfism,” meaning different types or cases of medically caused short stature; less commonly it can mean figurative smallness or underdevelopment.","zh":"“dwarfisms”是“dwarfism”的复数，主要指医学上导致身材矮小的不同类型或个案；较少见时也可作比喻，指渺小或发展受限。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Types or cases of dwarfism; conditions in which a person has short stature caused by genetic or medical factors.","zh":"（复数）侏儒症的不同类型或个案；指由遗传或医学因素导致身材矮小的状况。"},"examples":[{"en":"Doctors study different dwarfisms to understand how bones grow.","zh":"医生研究不同类型的侏儒症，以了解骨骼如何生长。"},{"en":"Some dwarfisms affect only height, while others also involve joint or spine problems.","zh":"有些侏儒症只影响身高，而另一些还会引发关节或脊柱问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, figurative) States of being small, underdeveloped, or limited in growth or power.","zh":"（较少见，比喻）指渺小、发育不全，或在发展/力量上受限的状态。"},"examples":[{"en":"The essay criticizes the dwarfisms of the country’s cultural life under strict censorship.","zh":"这篇文章批评在严格审查下该国文化生活的“畸形萎缩”。"},{"en":"They argued that fear can create dwarfisms of imagination.","zh":"他们认为恐惧会造成想象力的萎缩。"}]}],"synonyms":["forms of dwarfism","types of dwarfism","short-stature conditions","growth disorders","underdevelopment (figurative)"],"phonetic":"ˈdwɔrˌfɪzəmz","extraExplanation":["“dwarfism”的用法在英语里较中性、偏医学/科学语境；谈论个人时更尊重的说法是用“a person with dwarfism（患有侏儒症的人）”，而不是把疾病当作人的标签。","在日常场合要避免把“dwarf”当作贬义词使用；“dwarf”作为名词也可指“矮人（如童话/奇幻作品中的角色）”，语境不同。"]}
{"word":"dwarflike","summary":{"en":"“Dwarflike” means “resembling a dwarf; very small.”","zh":"“dwarflike”表示“像矮人一样的；非常矮小的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a dwarf; very small in size or stature (often describing a person, creature, or object).","zh":"像矮人一样的；（常形容人、动物或物体）非常矮小的。"},"examples":[{"en":"The story describes a dwarflike miner with a huge beard and a loud laugh.","zh":"故事里描写了一位矮人般的矿工，留着大胡子，笑声很响。"},{"en":"The garden had dwarflike trees shaped by years of careful pruning.","zh":"花园里有一些矮小的树，经过多年精心修剪而成。"}]}],"synonyms":["dwarfish","tiny","small","miniature"],"phonetic":"/ˈdwɔrfˌlaɪk/","extraExplanation":["“dwarflike”由“dwarf（矮人/侏儒）+ like（像……一样）”构成，常见于文学、奇幻作品或描述外形特征的写作中。语气有时可能带贬义或冒犯性：用于描述真实的人时要谨慎，更礼貌的说法通常是“very short / small-statured”。"]}
{"word":"dwarfling","summary":{"en":"A rare, fantasy-style word meaning a small or young dwarf; sometimes used humorously.","zh":"一个较少见、偏奇幻风格的词，指“小矮人/年轻的矮人”，有时带幽默或亲昵称呼的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small or young dwarf; sometimes used as a playful or affectionate term for a dwarf in fantasy settings.","zh":"（常用于奇幻语境）小矮人；矮人的幼体/后代；有时带有俏皮或亲昵的意味。"},"examples":[{"en":"The story follows a dwarfling who dreams of becoming a master smith.","zh":"故事讲的是一个小矮人，梦想成为铸造大师。"},{"en":"The old warrior protected the dwarflings during the journey through the mountains.","zh":"那位老战士在穿越群山时保护着矮人幼体。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, sometimes humorous) Something very small that resembles a dwarf in size or shape.","zh":"（少见，偶带幽默）形状或体型像矮人一样的小东西。"},"examples":[{"en":"He jokingly called the tiny statue a dwarfling.","zh":"他开玩笑把那座小雕像称作“小矮人”。"}]}],"synonyms":["dwarf child","young dwarf","little dwarf"],"phonetic":"/ˈdwɔrflɪŋ/","extraExplanation":["“dwarfling”并不是日常英语常用词，更常见于奇幻文学、角色扮演游戏或仿古/戏谑的写法。","后缀 -ling 常表示“幼小的/后代/小型的”（如 duckling 小鸭、gosling 小鹅），所以 dwarfling 直观含义就是“年轻或小个的 dwarf”。","使用时要注意语气：在奇幻世界中多为中性或亲昵称呼；在现实语境里指人可能显得冒犯或不礼貌，建议谨慎使用。"]}
{"word":"dwarfness","summary":{"en":"Dwarfness means the condition of being very small or unusually short; it can also mean figurative smallness or limited scope.","zh":"dwarfness 指“非常小或异常矮小的状态”，也可作比喻表示“格局/能力/发展受限的渺小”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or condition of being a dwarf; unusually short stature or very small size.","zh":"侏儒状态；身材异常矮小或体型非常小的状态。"},"examples":[{"en":"In the story, the hero first underestimates the villain because of his dwarfness.","zh":"在故事里，英雄一开始因为反派身材矮小而低估了他。"},{"en":"The plant’s dwarfness makes it ideal for small apartments.","zh":"这种植物的矮化特性让它很适合小公寓。"}]},{"partOfSpeech":"n.","definition":{"en":"Figurative: a quality of being small, limited, or underdeveloped in importance, power, or achievement.","zh":"（比喻）渺小、受限或发展不足（在重要性、力量或成就方面）。"},"examples":[{"en":"He regretted the dwarfness of his ambitions after meeting people who dared to dream bigger.","zh":"在遇到敢于做更大梦想的人之后，他为自己志向的狭小感到遗憾。"},{"en":"The essay criticizes the dwarfness of the policy, saying it doesn’t match the scale of the problem.","zh":"文章批评该政策“格局太小”，认为它与问题的规模不匹配。"}]}],"synonyms":["short stature","smallness","diminutiveness","stuntedness"],"phonetic":"/ˈdwɔɹfnəs/","extraExplanation":["“dwarfness”由“dwarf（侏儒；矮小）+ -ness（名词后缀，表示状态/性质）”构成，意思是“……的状态/性质”。","谈到人的身高时，用词要注意尊重与语境：在现代英语里，直接用“dwarfness”来描述某个人可能显得生硬或不够礼貌；更常见、更中性的是说“short stature（身材矮小）”。医学语境可能会出现“dwarfism（侏儒症）”，但这是特定诊断用语，日常不要随意给人贴标签。","在园艺/生物学语境中，“dwarfness”常用于描述植物或动物的“矮化/小型化”特征，语气通常是中性的。"]}
{"word":"dwarfs","summary":{"en":"“Dwarfs” can mean people with dwarfism, fantasy “dwarves,” or the verb meaning “to make something seem small by comparison.”","zh":"“dwarfs”既可指侏儒症患者，也可指奇幻作品中的“矮人/矮人族”，还可作动词表示“使……显得渺小/远超”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People with dwarfism; very short people (neutral/medical term: “people with dwarfism”).","zh":"侏儒症患者；身材极矮的人（较中性/医学表达常用：people with dwarfism）。"},"examples":[{"en":"The clinic provides support for people with dwarfism and their families.","zh":"这家诊所为侏儒症患者及其家人提供支持。"},{"en":"It’s more respectful to say “people with dwarfism” than “dwarfs” when talking about real people.","zh":"谈到真实的人时，用“people with dwarfism（侏儒症患者）”通常比“dwarfs”更尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"In fantasy stories: a race of small, strong human-like beings (e.g., in Tolkien’s works).","zh":"奇幻作品中：一种矮小但强壮、类似人类的种族（如托尔金作品中的矮人）。"},"examples":[{"en":"In The Lord of the Rings, dwarves are famous for mining and metalwork.","zh":"在《指环王》中，矮人以采矿和冶金闻名。"},{"en":"The hero asked the dwarves for help forging a weapon.","zh":"英雄请求矮人帮忙打造武器。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something else seem small or less important by comparison; to greatly exceed in size, amount, or importance.","zh":"使……显得渺小/不重要；（在体量、数量或重要性上）远超、使……相形见绌。"},"examples":[{"en":"Her achievements dwarf mine.","zh":"她的成就让我相形见绌。"},{"en":"The new stadium dwarfs the old one.","zh":"新体育场比旧的大得多。"}]}],"synonyms":["outshine","overshadow","tower over","make … look small"],"phonetic":"/dwɔrfs/","extraExplanation":["用法与拼写：作名词时，“dwarfs”常见两种情况：①“dwarf”的复数（尤其在一般语境/谈论真实人时）；②在奇幻语境里，许多作者更偏好复数“dwarves”（如 Tolkien），强调“种族”意味。作动词时，第三人称单数是“dwarfs”（e.g., It dwarfs...).","文化与礼貌：谈论真实人物时，“dwarf(s)”可能让人觉得不够尊重或带有标签化；更推荐“a person with dwarfism / people with dwarfism（侏儒症患者）”。谈论神话/奇幻角色时，“dwarf/dwarves”通常没有冒犯性。"]}
{"word":"dwarfy","summary":{"en":"“Dwarfy” means very small or dwarf-like (informal), often used for things or growth.","zh":"“dwarfy”表示“非常矮小、像矮人一样的”（非正式），常用于描述事物或生长状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Like a dwarf; very small, short, or stunted in size or growth.","zh":"（非正式）像矮人一样的；非常矮小的、发育不良的/显得矮小的。"},"examples":[{"en":"The plant looks dwarfy because it didn’t get enough sunlight.","zh":"这株植物看起来矮矮的，因为光照不够。"},{"en":"A dwarfy table in the corner made the room feel unbalanced.","zh":"角落里那张矮矮的桌子让房间看起来不太协调。"},{"en":"The puppy was dwarfy compared with the rest of the litter.","zh":"和同窝其他小狗比起来，这只幼犬显得特别小。"}]}],"synonyms":["dwarf-like","stunted","undersized","tiny","small"],"phonetic":"/ˈdwɔrfi/","extraExplanation":["“dwarfy”多用于描述物体、植物或动物“矮小/缩小”的外观与比例，语气较口语化。用于描述人时可能显得不礼貌或带有冒犯性；更中性的说法可以用“short”“small”“petite”（形容人）或“stunted/dwarfed”（形容生长受限）。","词源上来自“dwarf（矮人/侏儒）”。在奇幻文学里“dwarf”也常指一种种族（如《指环王》中的矮人族），这时“dwarfy”更像“有矮人风格/特征的”的意思，但仍属非正式用法。"]}
{"word":"dwarves","summary":{"en":"“Dwarves” is the plural of “dwarf,” meaning very small people/animals/plants, and it is especially common for the fantasy race “dwarves.”","zh":"“dwarves”是“dwarf”的复数，可指特别矮小的人/动物/植物；也常用于奇幻作品中的“矮人族”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “dwarf”: a person, animal, or plant that is much smaller than the usual size for its kind.","zh":"“dwarf”的复数：指人、动物或植物的体型/个体大小明显小于同类通常大小。"},"examples":[{"en":"Some apple trees are bred as dwarves so they can grow in small gardens.","zh":"有些苹果树被培育成矮化品种，适合在小花园里种植。"},{"en":"The zoo has a group of dwarf goats; the dwarves are popular with children.","zh":"动物园有一群侏儒山羊；这些“小个子”很受孩子们欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"In fantasy stories, dwarves are a human-like race often shown as short, sturdy, and skilled at mining or metalwork.","zh":"在奇幻作品中，dwarves 指一种类人种族，常被描绘为矮壮、擅长采矿或锻造。"},"examples":[{"en":"In the novel, the dwarves live under the mountains and guard ancient treasures.","zh":"在小说里，矮人住在群山之下，守护古老的宝藏。"},{"en":"Many games let you choose dwarves as a character race.","zh":"许多游戏允许你选择“矮人”作为角色种族。"}]}],"synonyms":["dwarfs (variant plural)","little people (context-sensitive)","fantasy dwarfs (context)"],"phonetic":"/dwɔrvz/","extraExplanation":["在现代英语里，复数有两种：dwarfs 和 dwarves。一般写作中两者都可用；但在奇幻文学（尤其受托尔金影响）里，常用 dwarves 来指“矮人族”。","如果是在谈医学或身高相关议题，英语更常用更中性的表达，如 people with dwarfism（侏儒症患者），以避免冒犯。"]}
{"word":"dwayberry","summary":{"en":"An old northern British dialect word for a small wild berry, usually a bilberry/whortleberry.","zh":"英國北部方言/古語：指野生小漿果，通常為越橘類（多指歐洲越橘/黑果越橘）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small wild berry (usually a kind of bilberry/whortleberry) found in northern Britain; an old dialect word.","zh":"（英國北部方言/古語）野生小漿果，通常指越橘類（多指歐洲越橘/黑果越橘一類）。"},"examples":[{"en":"In some northern dialects, people used to call bilberries “dwayberries.”","zh":"在一些英國北部方言裡，人們過去把越橘叫作「dwayberries」。"},{"en":"She picked dwayberries on the hillside and stained her fingers purple.","zh":"她在山坡上採了些 dwayberries，手指都染成了紫色。"}]}],"synonyms":["bilberry","whortleberry","blaeberry (Scot.)"],"phonetic":"/ˈdweɪˌbɛri/","extraExplanation":["這個詞相當少見，多出現在英國（特別是蘇格蘭、英格蘭北部）方言或較老的文本中；現代日常英語更常用 bilberry / blueberry / whortleberry 等。","詞源上常被認為與方言中的 dway（有「矮小、侏儒」之意）相關，用來形容這類貼近地面生長的小果灌木。閱讀文學或地方誌時遇到它，通常可理解為「野生越橘類小漿果」。"]}
{"word":"Dwayne","summary":{"en":"Dwayne is most commonly a male first name; it can also be a surname.","zh":"Dwayne 通常是男性名字；也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (first name), used mainly in the U.S. and other English-speaking countries.","zh":"男性名字（名），主要用于美国及其他英语国家。"},"examples":[{"en":"Dwayne is my older brother.","zh":"Dwayne 是我的哥哥。"},{"en":"Please ask Dwayne to call me back.","zh":"请让 Dwayne 给我回电话。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name), less common than the first name.","zh":"姓氏（家族名），比作名字更少见。"},"examples":[{"en":"Ms. Dwayne will join the meeting at 3 p.m.","zh":"Dwayne 女士将于下午三点参加会议。"}]}],"synonyms":["Duane (variant spelling)"],"phonetic":"/dweɪn/","extraExplanation":["“Dwayne”常被认为是“Duane”的变体拼写；在北美比较常见。","在书面或正式场合，如果不确定对方姓名的性别或头衔，英语里可用“Dwayne + last name（姓）”或直接用全名来避免失礼。"]}
{"word":"DWB","summary":{"en":"DWB most commonly means “Driving While Black,” referring to racial profiling of Black drivers (U.S. usage).","zh":"DWB 最常见指“Driving While Black”，指美国语境中黑人司机遭遇种族定性/不公正盘查。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Initialism, chiefly U.S.) “Driving While Black”: a phrase referring to racial profiling and unfair police attention toward Black drivers.","zh":"（主要在美国使用的首字母缩写）“Driving While Black（因开车而被当作黑人对待）”：指黑人司机在驾驶时遭遇种族定性/不公正盘查的现象。"},"examples":[{"en":"He said he was pulled over again—another case of DWB.","zh":"他说他又被拦下来了——又是一例“DWB”。"},{"en":"The article discusses DWB and how traffic stops can be shaped by bias.","zh":"那篇文章讨论了“DWB”，以及交通拦查如何受到偏见影响。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) An abbreviation used in specific fields or names (e.g., organization titles, technical terms), meaning depends on context.","zh":"（较少见）在特定领域或专有名词中使用的缩写（如机构名、技术术语等），含义取决于上下文。"},"examples":[{"en":"In this document, DWB is defined in the glossary, so check there for the exact meaning.","zh":"在这份文件里，DWB 在术语表中有定义，所以需要去那里确认具体含义。"}]}],"synonyms":["Driving While Black","racial profiling (in traffic stops)"],"phonetic":"/ˌdiː dʌbəl.juː ˈbiː/","extraExplanation":["“Driving While Black”是一种带批判意味的社会用语，通常用来指出：某些交通拦查并非基于实际违规，而是基于对黑人群体的刻板印象（racial profiling）。在正式写作中，也常直接写全称“Driving While Black”，或用更中性的表达如“racial profiling in traffic stops（交通拦查中的种族定性）”。","如果你是在某个具体文件、课程、软件或机构名称里看到 DWB，它也可能代表别的词组；最好提供一句原文或上下文，我可以帮你精确判定。"]}
{"word":"dwe","summary":{"en":"“DWE” is an initialism; its meaning depends on context (often “data warehouse environment” in tech).","zh":"“DWE”是首字母缩略词；具体含义取决于语境（技术领域常指“数据仓库环境”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(initialism) A written abbreviation made from the first letters of a longer name; “DWE” can mean different things depending on the field (often used in tech as “data warehouse environment”).","zh":"（首字母缩略词）由较长名称的首字母组成的缩写；“DWE”在不同领域含义不同（在技术领域常见指“data warehouse environment”，即“数据仓库环境”）。"},"examples":[{"en":"In the documentation, DWE stands for “data warehouse environment.”","zh":"在这份文档中，DWE 代表“data warehouse environment（数据仓库环境）”。"},{"en":"Ask your team what DWE means here, because different departments use it differently.","zh":"问问团队这里的 DWE 是什么意思，因为不同部门可能用法不同。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/ˌdi ˌdʌbəl.ju ˈi/","extraExplanation":["“DWE”不是一个常见的普通英文单词，更像是缩写（initialism）。缩写在口语里通常逐字母念（D-W-E），写作时要先在文档或对话中定义一次（例如：DWE = data warehouse environment），避免误解。","如果你告诉我它出现的句子或领域（IT、教育、公司部门名等），我可以给出更准确的释义。"]}
{"word":"Dweck","summary":{"en":"Dweck is a surname, most commonly referring to psychologist Carol Dweck and her “growth mindset” research.","zh":"Dweck 是一个姓氏，最常见的指代是心理学家卡罗尔·德韦克及其“成长型思维”研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A family name, best known in education and psychology because of Dr. Carol S. Dweck, a researcher associated with the ideas of “growth mindset” and “fixed mindset.”","zh":"（专有名词）一个姓氏；在教育与心理学领域中最常见的指代是心理学家卡罗尔·德韦克（Carol S. Dweck），她以“成长型思维（growth mindset）/固定型思维（fixed mindset）”等研究观点而知名。"},"examples":[{"en":"Our teacher mentioned Dweck when we talked about growth mindset.","zh":"我们讨论成长型思维时，老师提到了德韦克（Dweck）。"},{"en":"Dweck’s research suggests that effort and strategies can improve ability over time.","zh":"德韦克的研究认为，努力与方法可以让能力随着时间提升。"}]}],"phonetic":"/dwɛk/","extraExplanation":["“Dweck”在英文里通常就是姓氏本身，不是普通词汇；在学习语境中多半是指“Carol Dweck”。写作时常见表达：Dweck (2006) argues… 或 According to Dweck…","她的代表性搭配包括：growth mindset（成长型思维）、fixed mindset（固定型思维）、praise effort not talent（表扬努力而非天赋，常见的课堂建议表达）。"]}
{"word":"dweeble","summary":{"en":"“Dweeble” is an informal word for a socially awkward or nerdy person, often teasing or mildly insulting.","zh":"“dweeble”是口语词，指不太合群、显得书呆子或不酷的人，多用于调侃或轻微贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A socially awkward, unfashionable person; a nerdy or timid person (often used jokingly or mildly insulting).","zh":"（常带玩笑或轻微贬义）笨拙、不合群的人；书呆子/宅男宅女式的人。"},"examples":[{"en":"He was a bit of a dweeble in high school, but he grew more confident later.","zh":"他高中时有点书呆子、不太合群，但后来变得更自信了。"},{"en":"Don’t call her a dweeble—she’s just shy.","zh":"别叫她“dweeble”——她只是害羞。"}]}],"synonyms":["nerd","dork","geek","loser"],"phonetic":"/ˈdwiːbəl/","extraExplanation":["“dweeble”是比较口语、偏幽默的词，语气通常比“loser”轻，但在不熟的人之间仍可能显得冒犯。","常见近义词有“nerd”“dork”“geek”。区别：nerd偏“用功/学术宅”；geek常指对某领域非常着迷（有时是褒义）；dork/dweeble更偏“笨拙、不酷”。","这个词在80年代美国流行文化里更常见（例如电影和校园语境），现在仍能听到，但不算特别正式或书面。"]}
{"word":"dwel","summary":{"en":"Dwell means to live somewhere (formal), or to keep thinking/talking about something for too long (usually “dwell on”).","zh":"Dwell 指（较正式）居住在某处；也指（常用 dwell on）对某事反复思考/谈论、过度纠结。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to live in a place; to reside","zh":"居住；住在（某地）"},"examples":[{"en":"They dwell in a small town near the coast.","zh":"他们住在海岸附近的一个小镇。"},{"en":"Many birds dwell in forests during the spring.","zh":"许多鸟在春天栖息在森林里。"}]},{"partOfSpeech":"vi.","definition":{"en":"to think or talk about something for a long time, often more than is helpful (usually: “dwell on”)","zh":"（常用：dwell on）长时间想着/反复谈论某事（往往过度、不太有益）"},"examples":[{"en":"Try not to dwell on your mistakes—learn from them and move on.","zh":"尽量别总纠结于错误——从中学习然后继续前进。"},{"en":"She kept dwelling on what he said.","zh":"她一直反复想着他说的话。"}]}],"synonyms":["live","reside","inhabit","linger (on)","brood (over)"],"phonetic":"/dwɛl/","extraExplanation":["“dwel”通常是拼写不完整或拼错；正确拼写是 **dwell**。第三人称单数：dwells；过去式/过去分词：dwelt（也常见于英式）或 dwelled（更常见于美式）；现在分词：dwelling。","“dwell”在较正式或书面语里常用来表示“居住”；日常口语中更常用 **live**。","固定搭配 **dwell on** 带有“反复琢磨、纠结”的语气；写作或文学中也常见，比如描写人物“dwelling on a memory（沉溺于回忆）”。"]}
{"word":"dwelian","summary":{"en":"“dwelian” isn’t a standard word; you probably mean “dwell” (live somewhere) or “dwell on” (think about something too much).","zh":"“dwelian”不是标准英语词；你可能想写“dwell”（居住）或“dwell on”（过度反复想着某事/纠结）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) “dwelian” does not appear in major English dictionaries. It is most likely a misspelling of “dwell” or related forms (e.g., “dwelling,” “dwelled”).","zh":"（非标准英语词）“dwelian”不见于主流英语词典，最可能是“dwell”或相关形式（如“dwelling”“dwelled”）的拼写错误。"},"examples":[{"en":"I can’t find “dwelian” in a dictionary—did you mean “dwell” or “dwelling”?","zh":"我在词典里找不到“dwelian”——你想写的是“dwell”还是“dwelling”？"}]},{"partOfSpeech":"vi.","definition":{"en":"to live in a place; to reside (used more in formal or literary English).","zh":"居住在某地；栖居（较正式或文学用语）。"},"examples":[{"en":"They dwell in a small village near the sea.","zh":"他们住在海边的一个小村庄。"},{"en":"In the story, an old wizard dwells in the mountains.","zh":"在故事里，一位老巫师住在山里。"}]},{"partOfSpeech":"v.","definition":{"en":"to think, speak, or write about something for a long time, often longer than necessary (usually: “dwell on”).","zh":"长时间反复想着/谈论/写某事（常用：dwell on）。"},"examples":[{"en":"Try not to dwell on your mistakes.","zh":"尽量不要总纠结于自己的错误。"},{"en":"She dwelled on what he said and felt worse afterward.","zh":"她反复琢磨他的话，结果之后感觉更难受。"}]}],"synonyms":["live","reside","stay","inhabit","linger on","fixate on"],"phonetic":"/dwɛl/","extraExplanation":["“dwell”带有一点“文学/庄重”的感觉，日常口语更常说“live”或“stay”。例如：I live in Chicago（更自然） vs. I dwell in Chicago（更正式/文学）。","固定搭配“dwell on”常用于提醒别人别“反复纠结/钻牛角尖”，语气比“think about”更带有“停留太久”的意味。"]}
{"word":"DWELL","summary":{"en":"“Dwell” means to live in a place, or (with on/upon) to keep thinking or talking about something for too long.","zh":"“dwell”指“居住/栖身”，也可指（与 on/upon 连用）“反复想着或详谈某事，纠结太久”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to live or stay in a place (often for a long time)","zh":"居住；栖身（常指较长时间）"},"examples":[{"en":"They dwell in a small village near the mountains.","zh":"他们住在靠近群山的一个小村庄里。"},{"en":"Many animals dwell underground to stay safe.","zh":"许多动物栖息在地下以保持安全。"}]},{"partOfSpeech":"vi.","definition":{"en":"to think, speak, or write about something for a long time, especially too much (usually used with “on/upon”)","zh":"反复想着/详谈（某事），纠结于（常与 on/upon 连用）"},"examples":[{"en":"Try not to dwell on past mistakes.","zh":"尽量别总纠结于过去的错误。"},{"en":"The article dwells on the problem but offers few solutions.","zh":"这篇文章详细谈了问题，但几乎没提出解决办法。"}]}],"synonyms":["live","reside","inhabit","stay","linger","fixate (on)"],"phonetic":"/dwɛl/","extraExplanation":["“dwell”比较正式，日常口语里表示“住在……”更常用 live / stay（如：I live in New York）。但在描述动物“栖息”、文学描写或较正式的文字中，dwell 很常见。","常见搭配：dwell in（住在/栖息于）；dwell on/upon（反复想、过度关注）。比如：Don’t dwell on it.（别老想这事。）","词源上与“居住、停留”的概念有关，因此也延伸出“在某个想法上停留太久”的含义。"]}
{"word":"dwell","summary":{"en":"“Dwell” means (1) to live in a place, and (2) to keep thinking or talking about something for a long time, often too much.","zh":"“dwell”主要有两义：①居住；②对某事反复思考或反复谈论（常有“过度纠结”之意）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to live or stay in a place (often for a long time); to reside","zh":"居住；栖身（常指较长时间）；居留"},"examples":[{"en":"Many families dwell in small apartments in the city.","zh":"许多家庭住在城市里的小公寓中。"},{"en":"They once dwelt near the river, where the winters were quiet and cold.","zh":"他们曾住在河边，那里的冬天安静而寒冷。"}]},{"partOfSpeech":"v.","definition":{"en":"to think, speak, or write about something for a long time (often too much); to linger on a topic","zh":"反复想着/老是谈论（常带“过度”之意）；纠缠于某个话题"},"examples":[{"en":"Try not to dwell on past mistakes.","zh":"尽量不要总纠结于过去的错误。"},{"en":"The reporter dwelt on the details of the accident.","zh":"记者反复强调了事故的细节。"}]}],"synonyms":["live","reside","inhabit","stay","linger (on)","harp on"],"phonetic":"/dwɛl/","extraExplanation":["“dwell”在表示“居住”时更偏书面或文学色彩；日常口语更常用“live”。","常见搭配：dwell in/on/upon。dwell in + 地点（住在）；dwell on/upon + 事情（反复想/谈）。","过去式和过去分词：dwelt（英美都常见；有时也见作“dwelled”，但较少）。","文学用法中，“dwell”有时带一点“静静停留、驻留”的意境，比如记忆或情感在某处“停驻”。"]}
{"word":"dwellan","summary":{"en":"“Dwell on” means to keep thinking or talking about something for a long time, often more than is helpful.","zh":"“Dwell on”指长时间反复想着或谈论某事，常含“想太多/纠结”的意味。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to keep thinking or talking about something, especially for longer than is necessary (often in an unhelpful or negative way)","zh":"（尤指不必要地、往往带负面地）反复想着或不停谈论某事"},"examples":[{"en":"Try not to dwell on your mistakes—learn from them and move on.","zh":"尽量别老纠结自己的错误——从中吸取教训，然后继续往前走。"},{"en":"He kept dwelling on what she said, replaying the conversation in his head.","zh":"他一直反复琢磨她说的话，在脑海里一遍遍回放那段对话。"},{"en":"Let’s not dwell on the past; we need to focus on what we can do now.","zh":"我们别总沉溺于过去了；该专注当下能做什么。"}]}],"synonyms":["obsess over","fixate on","linger on","brood over","keep thinking about"],"phonetic":"/ˈdwɛl ɑn/","extraExplanation":["你写的“dwellan”更像是把短语 **dwell on** 连在一起了（也常见为拼写或分词错误）。标准写法是 **dwell on**。","语气上，**dwell on** 常暗示“想太多/纠结”，比单纯的 **think about** 更负面一些；但在中性语境也可表示“详细谈论”，如：*The report dwells on the causes of inflation.*（报告详细讨论了通胀原因。）"]}
{"word":"dwelled","summary":{"en":"“Dwelled” is the past form of “dwell,” meaning either “lived/resided” or “kept thinking/talking about something (dwell on).”","zh":"“dwelled”是“dwell”的过去式/过去分词，可表示“居住”，也可表示“（dwell on）反复纠结/老是想着或谈论某事”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “dwell”: to live in a place; to reside.","zh":"“dwell”的过去式和过去分词：居住；住在（某处）。"},"examples":[{"en":"For years, they dwelled in a small apartment near the river.","zh":"多年来，他们住在河边的一间小公寓里。"},{"en":"In the story, an old spirit dwelled in the forest.","zh":"在故事里，一个古老的精灵住在森林中。"}]},{"partOfSpeech":"v.","definition":{"en":"to keep thinking or talking about something for a long time (often used with “on”).","zh":"（常与 on 连用）长时间反复想或谈论某事；纠结于某事。"},"examples":[{"en":"She dwelled on the mistake and couldn’t move on.","zh":"她一直纠结那个错误，没法释怀。"},{"en":"Don’t dwell on what you can’t change.","zh":"别一直纠结那些你改变不了的事。"}]}],"synonyms":["lived","resided","stayed","inhabited","brooded (on)","obsessed (over)"],"phonetic":"/dwɛld/","extraExplanation":["“Dwelled”在现代英语里更常见于书面语、叙述性文字或较正式的语境（如文学、历史叙事）来表达“居住”。日常口语里通常用“lived”。","固定搭配：dwell on + 名词/动名词，常带轻微负面含义，表示“反复纠结、老是提起”。"]}
{"word":"dweller","summary":{"en":"“Dweller” means someone (or an animal) that lives in a particular place, often in compounds like “city-dweller.”","zh":"“dweller”指居住在某处的人或动物，常见于如“city-dweller（城市居民）”这类合成词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or animal that lives in a particular place (often used in compounds like “city-dweller”).","zh":"居住在某处的人或动物（常用于合成词，如“city-dweller 城市居民”）。"},"examples":[{"en":"Many city-dwellers rely on public transportation.","zh":"许多城市居民依赖公共交通。"},{"en":"Cave-dwelling animals are adapted to darkness.","zh":"穴居动物适应了黑暗环境。"},{"en":"She is a long-time dweller in this neighborhood.","zh":"她是这个社区的老住户。"}]}],"synonyms":["resident","inhabitant","occupant"],"phonetic":"/ˈdwɛlər/","extraExplanation":["“dweller”来自动词“dwell”（居住、栖身）+ 表示“……者”的后缀“-er”。它比“resident”更偏口语或描述性，常用来强调生活环境或生活方式（如“city-dweller”暗示城市生活的特点）。","在正式场合更常用“resident / inhabitant”；“dweller”在新闻、文学或科普中常用于描写某类人群或生物（如“forest-dweller 森林居民/栖居者”）。"]}
{"word":"dwellers","summary":{"en":"“Dwellers” means people who live in a particular place (plural of “dweller”).","zh":"“dwellers”指居住在某地的人（“dweller”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live in a particular place (used in compounds or general descriptions).","zh":"居住在某地的人；居民（常用于复合词或概括性描述）。"},"examples":[{"en":"City dwellers often rely on public transportation.","zh":"城市居民常常依赖公共交通。"},{"en":"The forest dwellers knew the land better than anyone.","zh":"森林居民比任何人都更了解那片土地。"},{"en":"The documentary follows desert dwellers and their daily lives.","zh":"这部纪录片记录了沙漠居民的日常生活。"}]}],"synonyms":["residents","inhabitants","locals"],"phonetic":"/ˈdwɛlərz/","extraExplanation":["“dweller”来自动词“dwell”（居住、栖身），后缀“-er”表示“做某事的人”。“dwellers”是其复数形式。","常见搭配：city dwellers（城市居民）、town dwellers（城镇居民）、forest/mountain/desert dwellers（森林/山地/沙漠居民）。语气多为中性，有时在写作中带一点描写色彩。","在文学或纪录片语境中，“dwellers”常用来强调人与环境的关系（如“cave dwellers”洞穴居民），比直接说“people”更有画面感。"]}
{"word":"dwelling","summary":{"en":"“Dwelling” usually means a place where people live; it sounds more formal than “home/house.”","zh":"“dwelling”通常指“住所/住处”，语气比“home/house”更正式，常见于法律、新闻或房产语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where someone lives; a home or residence (often a building such as a house or apartment)","zh":"（某人居住的）住所；住处；住宅（常指房子或公寓等建筑）"},"examples":[{"en":"The village has many old stone dwellings.","zh":"这个村庄有许多古老的石头住宅。"},{"en":"They found a small dwelling near the river.","zh":"他们在河边找到了一处小住处。"},{"en":"Local laws require every dwelling to have safe exits.","zh":"当地法律要求每个住所都要有安全出口。"}]},{"partOfSpeech":"adj.","definition":{"en":"living in a place; residing (often used as an adjective in formal writing)","zh":"居住的；住在某处的（较正式用法）"},"examples":[{"en":"The report counted the dwelling population in the area.","zh":"报告统计了该地区的常住人口。"}]}],"synonyms":["home","house","residence","habitation","abode"],"phonetic":"/ˈdwɛlɪŋ/","extraExplanation":["“Dwelling”比“house/home”更正式、更中性，常用于法律、新闻、政府文件或房地产语境，强调“住的地方”这一功能，不一定带有“家”的情感意味。","搭配常见：dwelling place（居所）、dwelling unit（住宅单元，常见于房产/建筑）、dwelling house（住宅用房，偏法律/英式表达）。","词源来自古英语 dwell（居住、停留）。在文学或宗教文本中，dwelling 也常带有“栖身之所、安身之处”的意味。"]}
{"word":"dwellings","summary":{"en":"“Dwellings” means homes or places where people live (a formal plural noun).","zh":"“dwellings”指人们居住的住所/住宅，是较正式的复数名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Places where people live, such as houses or apartments; homes (plural of “dwelling”).","zh":"人们居住的地方，如房子或公寓；住所（“dwelling”的复数）。"},"examples":[{"en":"The new road will pass close to several dwellings.","zh":"这条新路将从几处住宅附近经过。"},{"en":"The fire damaged five dwellings, but no one was hurt.","zh":"火灾损坏了五处住所，但没有人受伤。"},{"en":"They searched the area for abandoned dwellings.","zh":"他们在该地区寻找废弃的住处。"}]}],"synonyms":["homes","residences","houses","housing units","habitations"],"phonetic":"/ˈdwɛlɪŋz/","extraExplanation":["“Dwelling(s)”比“house(s)”更正式、更中性，常用于新闻报道、法律文件、城市规划、人口统计等语境，用来泛指“居住单元”，不强调独栋还是公寓。","常见搭配：residential dwellings（住宅用房）、occupied/unoccupied dwellings（有人/无人居住的住所）、private dwellings（私人住宅）。"]}
{"word":"dwells","summary":{"en":"“Dwells” means “lives/resides” (often formal) or “keeps thinking/talking about something” in the phrase “dwell on.”","zh":"“dwells”表示“居住/栖居”（较正式），也常用于“dwell on”表示“反复想着/不停谈论某事”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “dwell”) to live in a particular place; to reside.","zh":"（“dwell”的第三人称单数）居住；栖身于某地。"},"examples":[{"en":"She dwells in a small town near the coast.","zh":"她住在海边附近的一个小镇上。"},{"en":"A rare bird dwells in this forest.","zh":"一种罕见的鸟栖息在这片森林里。"}]},{"partOfSpeech":"v.","definition":{"en":"(usually in “dwell on”) to think about or talk about something for too long, often in an unhappy or overly detailed way.","zh":"（常用于“dwell on”）反复想着/不停谈论某事（往往过久、过度，常带消极情绪）。"},"examples":[{"en":"He dwells on past mistakes and can’t move on.","zh":"他总是纠结过去的错误，无法向前看。"},{"en":"Try not to dwell on what you can’t change.","zh":"尽量别反复想着那些你无法改变的事。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common, somewhat literary) to remain or stay for a time.","zh":"（较少见，略文学）停留；逗留一段时间。"},"examples":[{"en":"Her gaze dwells on the painting for a moment.","zh":"她的目光在那幅画上停留了片刻。"}]}],"synonyms":["lives","resides","inhabits","stays","lingers (on)","fixates (on)"],"phonetic":"/dwɛlz/","extraExplanation":["“dwell”比“live”更书面、更带有“长期居住/栖居”的感觉；在日常口语里通常用“live”。","常见搭配：dwell on + 事情（反复想/唠叨）。如果想表达更中性、更短暂的“想到一下”，可用“think about”。"]}
{"word":"dwelt","summary":{"en":"“Dwelt” is the past form of “dwell,” meaning either “lived (somewhere)” or “focused on something for a long time (usually dwell on/upon).”","zh":"“dwelt”是“dwell”的过去式/过去分词，常指“居住在某处”，也可指“反复想着/纠结于某事（多用 dwell on/upon）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “dwell”; to live in a place (often used in literary or formal writing).","zh":"“dwell”的过去式和过去分词；居住在某处（常见于文学或较正式语体）。"},"examples":[{"en":"For generations, the family dwelt by the river.","zh":"几代人以来，这家人都住在河边。"},{"en":"They dwelt in a small village surrounded by hills.","zh":"他们住在一个群山环绕的小村庄里。"}]},{"partOfSpeech":"v.","definition":{"en":"to think, talk, or write about something for a long time; to focus on it (usually “dwell on/upon”).","zh":"长时间地想着/谈论/写某事；反复纠结、过度关注（常用搭配为“dwell on/upon”）。"},"examples":[{"en":"She dwelt on her mistakes and couldn’t sleep.","zh":"她反复想着自己的错误，结果睡不着。"},{"en":"He didn’t dwell upon the past; he planned for the future.","zh":"他不沉湎于过去，而是为未来做计划。"}]}],"synonyms":["lived (in)","resided (in)","inhabited","linger (on)","obsess (over)"],"phonetic":"/dwɛlt/","extraExplanation":["“dwelt”多见于书面语、叙事或文学语境；日常口语里更常说“lived”。","常见搭配：dwell on/upon (sth) 表示“反复想、纠结于”；dwell in/at 表示“居住在”。","文学中常见结构如“dwelt among… / dwelt by…”用来营造较古典、叙事性的氛围。"]}
{"word":"dweorg","summary":{"en":"“dweorg” is an archaic (Old English) word meaning “dwarf,” sometimes used today for an old-fashioned fantasy feel.","zh":"“dweorg”是古英语词，意为“矮人/侏儒”，如今偶尔用于营造古风奇幻语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/Old English) a dwarf; a small, human-like being in Germanic folklore.","zh":"（古英语/古用语）侏儒；（日耳曼民俗中的）矮小类人精灵/矮人。"},"examples":[{"en":"In Old English texts, “dweorg” refers to a dwarf-like creature from folklore.","zh":"在一些古英语文本中，“dweorg”指民间传说里的矮人/侏儒类生物。"},{"en":"Some modern fantasy writers borrow old forms like “dweorg” to give a story an ancient tone.","zh":"一些现代奇幻作者会借用“dweorg”这类古词，让故事带有古老的语感。"}]}],"synonyms":["dwarf","gnome"],"phonetic":"/dwɔrɡ/","extraExplanation":["“dweorg”主要见于古英语（Old English）与历史语言学讨论中，是现代英语“dwarf”的词源之一。古英语复数常见写法如“dweorgas”。","如果你是在游戏、奇幻小说或人名/地名里看到它，它通常是为了营造“古风/中古”氛围，而不是现代日常英语用词。","如果你本来想查的是现代常用词，可能是拼写误差：常见相近词包括“dwarf（矮人/侏儒）”“dweeb（书呆子/怪人，口语）”。"]}
{"word":"DWI","summary":{"en":"DWI: the offense of driving while intoxicated or impaired by alcohol/drugs.","zh":"DWI：指酒精或药物影响下驾驶（酒驾/毒驾）的违法或犯罪行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in the U.S.) the criminal offense of driving a vehicle while intoxicated by alcohol or drugs; “driving while intoxicated/impared.”","zh":"（尤指美国）酒后或药物影响下驾驶车辆的违法/犯罪行为；即“酒驾/毒驾”。"},"examples":[{"en":"He was arrested for DWI after failing a breath test.","zh":"他酒精测试未通过，因酒驾（DWI）被逮捕。"},{"en":"A DWI can lead to fines, license suspension, and even jail time.","zh":"酒驾（DWI）可能导致罚款、吊销驾照，甚至入狱。"},{"en":"She hired a lawyer to fight the DWI charge.","zh":"她请了律师来应对酒驾（DWI）指控。"}]}],"synonyms":["DUI","OWI","drunk driving"],"phonetic":"/ˌdiː dʌbəlˌjuː ˈaɪ/","extraExplanation":["DWI是缩写，通常逐个字母读。在不同州/地区，DWI与DUI、OWI等缩写的具体法律定义和适用条件可能不同：有的地方区分“醉酒”(intoxicated)与“受影响”(impaired)，有的地方基本等同使用。","正式写作中，首次出现可写全称（driving while intoxicated / driving while impaired），后面再用缩写DWI。"]}
{"word":"Dwight","summary":{"en":"Dwight is mainly used as a male first name (and sometimes a surname).","zh":"Dwight 主要用作男性名字（有时也作姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Dwight is starting a new job next Monday.","zh":"Dwight 下周一要开始一份新工作。"},{"en":"My uncle Dwight lives in Chicago.","zh":"我叔叔 Dwight 住在芝加哥。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏。"},"examples":[{"en":"Her last name is Dwight.","zh":"她的姓是 Dwight。"},{"en":"I found a book by Dwight in the library catalog.","zh":"我在图书馆目录里找到一本 Dwight 写的书。"}]}],"phonetic":"/dwaɪt/","extraExplanation":["“Dwight”源自古英语名字 Deorwine，常被解释为“亲爱的朋友/珍贵的朋友”。现代英语里它主要作为人名使用，不像普通词那样有词义变化。","文化联想：美国前总统 Dwight D. Eisenhower（艾森豪威尔）让这个名字在美国更为人熟悉；影视中也有虚构角色 Dwight Schrute（《The Office》）等。"]}
{"word":"DWIM","summary":{"en":"DWIM means “Do What I Mean”: software that tries to infer your intention and act accordingly.","zh":"DWIM 指“照我意思做”：软件会推断你的意图并据此自动处理。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) “Do What I Mean”: a feature in software or a system that tries to guess the user’s intention and automatically does the most likely correct action, even if the input isn’t perfect.","zh":"（缩写）“Do What I Mean（照我意思做）”：指软件或系统会尽量理解用户真正的意图，即使输入不够精确，也会自动执行最可能正确的操作。"},"examples":[{"en":"This editor has a DWIM mode: if you paste messy code, it auto-formats it.","zh":"这个编辑器有 DWIM 模式：你即使粘贴了很乱的代码，它也会自动格式化。"},{"en":"I love DWIM features, but they can be confusing when the program guesses wrong.","zh":"我喜欢 DWIM 功能，但当程序猜错时也会让人困惑。"},{"en":"The library provides DWIM defaults so beginners can get started quickly.","zh":"这个库提供 DWIM 的默认设置，让新手可以快速上手。"}]}],"synonyms":["intention-aware","smart defaults","auto-correcting","heuristic behavior"],"phonetic":"/ˌdiː ˌdʌbəl.juː ˌaɪ ˈɛm/","extraExplanation":["DWIM 这个说法常见于早期“黑客文化”和编程圈，强调“系统要尽量体贴用户”，减少用户必须输入的细节。","在 Perl 等语言社区里，DWIM 常用来形容“很聪明、很省事”的默认行为；不过也有人更偏好“明确胜于猜测”，因为过度 DWIM 可能带来不可预期的结果。","发音通常按字母读（D-W-I-M）。"]}
{"word":"dwindle","summary":{"en":"Dwindle means to slowly become smaller or less in number, amount, or strength.","zh":"Dwindle 指数量、程度或力量等慢慢变小、变少或衰退。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to become gradually smaller, fewer, or less; to slowly decrease","zh":"逐渐变小；逐渐减少；慢慢衰退"},"examples":[{"en":"As winter ended, their food supplies dwindled.","zh":"冬天快结束时，他们的食物储备逐渐减少。"},{"en":"Her interest in the project dwindled over time.","zh":"随着时间推移，她对这个项目的兴趣逐渐减退。"},{"en":"The crowd dwindled to just a few people.","zh":"人群逐渐减少到只剩几个人。"}]}],"synonyms":["decrease","decline","diminish","shrink","wane","taper off"],"phonetic":"/ˈdwɪn.dəl/","extraExplanation":["“dwindle”常用来描述一种“慢慢变少、变弱”的变化过程，语气通常是渐进的，而不是突然的。常见搭配：dwindle away（逐渐消失/减少）、dwindle to…（减少到……）、dwindling resources/population（日益减少的资源/人口）。","词源上与“dwind”有关（古英语/方言中有“变小、消瘦”的意思），所以这个词自带一种“慢慢耗尽、渐渐枯竭”的画面感。"]}
{"word":"dwindled","summary":{"en":"“Dwindled” means “became gradually smaller or fewer.”","zh":"“dwindled”表示“逐渐减少、慢慢变小”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense / past participle of “dwindle”) to become smaller in amount, size, or importance gradually.","zh":"（dwindle 的过去式/过去分词）逐渐减少；慢慢变小（数量、规模或重要性下降）。"},"examples":[{"en":"Our savings dwindled after months of medical bills.","zh":"几个月的医疗账单过后，我们的存款逐渐减少。"},{"en":"As winter ended, the snow on the mountains dwindled to thin patches.","zh":"冬天结束时，山上的积雪逐渐缩成一小片一小片的。"},{"en":"Attendance dwindled as the lecture went on.","zh":"随着讲座继续，出席人数逐渐减少。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common, past tense) to make something become smaller gradually; to reduce.","zh":"（较少见，过去式）使……逐渐减少；让……慢慢变小。"},"examples":[{"en":"High fees dwindled the number of applicants over time.","zh":"高额费用让申请人数随着时间逐渐减少。"}]}],"synonyms":["decreased","diminished","declined","shrank","tapered off","waned"],"phonetic":"/ˈdwɪndəld/","extraExplanation":["“dwindle”常带有“慢慢变少、越变越不够”的语感，常见搭配：dwindle away（逐渐消失/减少）、dwindle to nothing（减少到几乎没有）、resources/supplies/hope/opportunities dwindled（资源/补给/希望/机会减少）。","和“decrease”相比，“dwindle”更强调“渐渐地、不断地变少”，常用于叙述时间推移带来的缩减。"]}
{"word":"dwindlement","summary":{"en":"“Dwindlement” means a gradual decrease or decline.","zh":"“dwindlement”指逐渐减少、衰退的过程或结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gradual reduction in size, amount, number, or strength; the process of becoming smaller or fewer.","zh":"逐渐减少；逐渐缩小（数量、规模、人数或力量等）"},"examples":[{"en":"The company is worried about the dwindlement of its customer base.","zh":"公司担心客户群正在逐渐减少。"},{"en":"We’ve seen a steady dwindlement in water supplies during the dry season.","zh":"在旱季，我们看到水源在持续减少。"},{"en":"There was a noticeable dwindlement of interest after the initial excitement faded.","zh":"最初的兴奋消退后，兴趣明显在减少。"}]}],"synonyms":["decline","decrease","reduction","drop","diminution"],"phonetic":"/ˈdwɪndəlmənt/","extraExplanation":["“dwindlement”来自动词“dwindle”（逐渐减少、衰退）加名词后缀“-ment”（表示“……的过程/结果”）。它比更常见的“decline / decrease / reduction”更偏书面语，常用于描述缓慢、持续的下降。","使用建议：在日常英语里，人们更常说“a decline in… / a decrease in… / a reduction in…”。如果你写论文、报告或新闻稿，“dwindlement”能表达“慢慢变少”的感觉。"]}
{"word":"dwindles","summary":{"en":"“Dwindles” means “gradually becomes less or smaller.”","zh":"“Dwindles”表示“逐渐变少或变小”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to become gradually smaller, fewer, weaker, or less; to decrease little by little","zh":"逐渐变小、变少、减弱；慢慢减少"},"examples":[{"en":"As winter ends, the snow on the mountains dwindles.","zh":"冬天结束时，山上的积雪逐渐减少。"},{"en":"Our savings dwindled after months without work.","zh":"失业几个月后，我们的存款慢慢变少了。"},{"en":"Her enthusiasm for the project dwindles when progress is slow.","zh":"当进展缓慢时，她对这个项目的热情逐渐减弱。"}]}],"synonyms":["decrease","diminish","shrink","decline","wane","drop off"],"phonetic":"/ˈdwɪndəlz/","extraExplanation":["“dwindles”是动词“dwindle”的第三人称单数形式（he/she/it dwindles）。常用于描述数量、资源、希望、兴趣、时间等“慢慢耗尽/减少”，语气通常带有一种无奈或可惜的感觉。"]}
{"word":"dwindling","summary":{"en":"“Dwindling” describes something that is gradually decreasing or becoming smaller.","zh":"“dwindling”表示某事物在逐渐减少、变小或衰退。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"becoming smaller in number, amount, or strength; gradually decreasing","zh":"（数量、程度、力量等）逐渐减少的；日渐缩小的"},"examples":[{"en":"The town’s dwindling population has led to fewer schools and shops.","zh":"这个小镇人口日渐减少，导致学校和商店变少了。"},{"en":"We need to act now because our savings are dwindling fast.","zh":"我们得现在就采取行动，因为我们的存款正在迅速减少。"},{"en":"His confidence was dwindling after several rejections.","zh":"在多次被拒后，他的信心逐渐减弱。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become smaller or fewer; to decrease gradually","zh":"（数量等）逐渐变少；逐渐缩小"},"examples":[{"en":"As winter ends, the snow begins to dwindle.","zh":"冬天快结束时，积雪开始逐渐减少。"},{"en":"Their options dwindled to just two choices.","zh":"他们的选择逐渐减少到只剩两种。"}]}],"synonyms":["decreasing","declining","diminishing","shrinking","waning"],"phonetic":"/ˈdwɪn.dəl.ɪŋ/","extraExplanation":["“dwindle”常用来强调“慢慢地、持续地减少”，语气比“drop”更像一个过程。常见搭配：dwindling resources（日益枯竭的资源）、dwindling interest（兴趣渐退）、dwindling number of…（……的数量在减少）。","词源小知识：dwindle 与古英语中表示“消失/衰退”的词有关，现代英语里常用来写人口、资金、精力、希望等“逐步变少”的情况。"]}
{"word":"dwine","summary":{"en":"“dwine” is an archaic/Scots verb meaning to waste away or dwindle.","zh":"“dwine”是古语/苏格兰英语动词，意思是逐渐衰弱或逐渐减少。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Archaic/Scots) To waste away or grow weaker; to dwindle or pine.","zh":"（古语/苏格兰英语）逐渐衰弱；消瘦；日渐凋零、减少。"},"examples":[{"en":"After the long winter, the old man seemed to dwine day by day.","zh":"漫长的冬天过后，那位老人似乎一天比一天衰弱。"},{"en":"Without enough rain, the river began to dwine into a narrow stream.","zh":"由于雨水不足，这条河开始逐渐缩小成一股细流。"}]}],"synonyms":["dwindle","waste away","pine away","decline"],"phonetic":"/dwaɪn/","extraExplanation":["“dwine”多见于苏格兰英语或较早期英语文本，现代英语里更常用“dwindle”（逐渐减少）或“waste away / pine away”（消瘦、日渐衰弱）。","如果你其实想查的是“divine”（神圣的/推测），请告诉我，我也可以给出“divine”的词条与用法对比。"]}
{"word":"dwined","summary":{"en":"“dwined” isn’t standard; it’s usually a misspelling of “dwindled” (became smaller/less) or, less often, “twined” (wrapped/twisted around).","zh":"“dwined”不是标准拼写；通常是“dwindled”（逐渐变小/变少）的误写，较少情况下也可能指“twined”（缠绕/扭在一起）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “dwindled” (past tense of “dwindle,” meaning “became smaller/less”).","zh":"不是标准英语单词；很可能是“dwindled”的拼写错误（“dwindle”的过去式，意思是“逐渐变小/变少”）。"},"examples":[{"en":"The group’s funding dwindled over the year.","zh":"这一年里，这个团队的资金逐渐减少。"},{"en":"As the sun set, the light dwindled to a soft glow.","zh":"太阳落山时，光线逐渐减弱成柔和的微光。"}]},{"partOfSpeech":"other","definition":{"en":"Less likely: a misspelling of “twined” (past tense of “twine,” meaning “twisted or wrapped around”).","zh":"较不可能：可能是“twined”的拼写错误（“twine”的过去式，意思是“缠绕/扭在一起”）。"},"examples":[{"en":"Vines twined around the fence.","zh":"藤蔓缠绕在篱笆上。"},{"en":"She twined the ribbon around the gift box.","zh":"她把丝带绕在礼品盒上。"}]}],"synonyms":["shrank","decreased","diminished","tapered off","waned"],"phonetic":"/ˈdwɪn.dəl/","extraExplanation":["“dwindle”常用来描述数量、力量、机会、资源等“慢慢变少/变弱”，语气比“drop”更强调“逐渐”的过程。常见搭配：dwindle away（逐渐消失/减少）、dwindling resources（日渐减少的资源）。"]}
{"word":"dwines","summary":{"en":"“dwines” is a rare/archaic verb form meaning “dwindles/withers.”","zh":"“dwines”是罕见/古用动词形式，意思是“逐渐减少/缩小；枯萎、衰弱”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) to wither, waste away, or become smaller or weaker over time; to dwindle.","zh":"（罕见/古用）枯萎；衰弱；逐渐变小/减少（相当于 dwindle）。"},"examples":[{"en":"In the dry season, the river dwines to a narrow stream.","zh":"在旱季，河流逐渐缩小成一条狭窄的溪流。"},{"en":"Without sunlight, the plant slowly dwines.","zh":"没有阳光，这株植物慢慢枯萎。"}]},{"partOfSpeech":"v.","definition":{"en":"“dwines” = third-person singular present form of dwine (he/she/it dwines).","zh":"“dwines”是 dwine 的一般现在时第三人称单数形式（他/她/它 dwines）。"},"examples":[{"en":"Her hope dwines when she stops practicing.","zh":"当她停止练习时，她的希望逐渐减弱。"}]}],"synonyms":["dwindle","wither","wane","decline","shrink"],"phonetic":"/dwaɪn/","extraExplanation":["“dwine / dwines”在现代英语里非常少见；日常写作更常用“dwindle”（减少、缩小）或“wither”（枯萎、衰败）。","如果你本来想查的是“dwindles”（dwindle 的第三人称单数），那是更常见、更标准的拼写。"]}
{"word":"dwining","summary":{"en":"“Dwindle” means to gradually decrease in size, amount, or importance.","zh":"“dwindle”指逐渐减少、变小或衰退。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To become smaller, fewer, or less; to gradually decrease.","zh":"（数量、规模、重要性等）逐渐变小/减少；逐渐衰退。"},"examples":[{"en":"Our savings are dwindling because prices keep rising.","zh":"因为物价不断上涨，我们的存款在逐渐减少。"},{"en":"As winter ends, the snow on the mountains slowly dwindles.","zh":"随着冬天结束，山上的积雪慢慢变少。"},{"en":"His interest in the project dwindled over time.","zh":"随着时间推移，他对这个项目的兴趣逐渐减退。"}]}],"synonyms":["decrease","decline","diminish","shrink","drop"],"phonetic":"/ˈdwɪndəl/","extraExplanation":["“dwining”不是常见英文单词，很可能是拼写错误，最常见的目标词是“dwindling / dwindle”。","“dwindling”通常是形容词或现在分词，用来修饰名词：a dwindling population（逐渐减少的人口）、dwindling resources（日益减少的资源）。","拼写提示：dwindle 里有一个不发音的 d（dw-），容易写错。"]}
{"word":"Dwinnell","summary":{"en":"Dwinnell is most commonly used as an English surname (a last name).","zh":"Dwinnell 最常见用法是英文姓氏（人的姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname). It most commonly refers to a person’s last name, especially in the U.S.","zh":"一个姓氏（家族姓）。最常见用法是指一个人的英文姓，尤其在美国语境中。"},"examples":[{"en":"Ms. Dwinnell will lead the meeting today.","zh":"Dwinnell 女士今天将主持会议。"},{"en":"I’m looking for Dr. Dwinnell’s office.","zh":"我在找 Dwinnell 医生的办公室。"}]}],"synonyms":["last name","surname","family name"],"phonetic":"/ˈdwɪnəl/","extraExplanation":["“Dwinnell”通常被当作专有名词（姓氏）使用，因此在写作中一般首字母大写，也不常见复数形式。","姓氏的读音有时会因家族或地区而不同；如果你指的是某个具体的人名或地名（例如学校楼名、街名），最好以当事人或当地的常用读法为准。"]}
{"word":"Dworak","summary":{"en":"Dvorak/Dvořák is a Czech surname best known from the composer Antonín Dvořák; it can also refer to the Dvorak keyboard layout.","zh":"Dvorak/Dvořák 是捷克姓氏，最常指作曲家安东宁·德沃夏克；也可指德沃夏克键盘布局。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Czech surname, best known from the composer Antonín Dvořák (1841–1904).","zh":"一个捷克姓氏，最有名的是作曲家安东宁·德沃夏克（Antonín Dvořák，1841–1904）。"},"examples":[{"en":"We listened to Dvořák’s “New World Symphony” in class.","zh":"我们在课上听了德沃夏克的《自新大陆交响曲》。"},{"en":"Dvořák was influenced by Czech folk music.","zh":"德沃夏克受到捷克民间音乐的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"The Dvorak (keyboard) layout: a keyboard arrangement designed to make typing more efficient and comfortable than QWERTY for some people.","zh":"德沃夏克键盘布局：一种键盘按键排列方式，据称对一些人来说比 QWERTY 更高效、更舒适。"},"examples":[{"en":"She switched from QWERTY to the Dvorak layout to reduce wrist strain.","zh":"她从 QWERTY 换到德沃夏克布局来减轻手腕压力。"},{"en":"My laptop supports Dvorak input in the settings.","zh":"我的笔记本在设置里支持德沃夏克输入法。"}]}],"phonetic":"/ˈdvɔːræk/","extraExplanation":["你写的“Dworak”常见是把“Dvorak / Dvořák”拼错了；标准拼法多为 **Dvořák**（带“ř”）或不带重音的 **Dvorak**。在英语里通常读作 /ˈdvɔːræk/。","作曲家姓氏里的“ř”是捷克语特有的音，英语通常用更接近的发音替代，所以你会看到不同拼写与读法并存。","键盘布局的“Dvorak”来自其设计者 August Dvorak（奥古斯特·德沃拉克），与作曲家不是同一个人。"]}
{"word":"Dworman","summary":{"en":"A doorman is a building employee who stands at the entrance to greet people, open doors, and help with security; informally it can also mean a goalkeeper.","zh":"doorman 指楼宇门口的门卫/看门人，负责迎客、开门与协助安保；非正式时也可指守门员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person employed to stand at the entrance of a building (such as an apartment, hotel, or office) to open doors, greet visitors, and help with security or deliveries","zh":"（公寓、酒店或办公楼的）门卫；看门人（负责开门、迎客、协助安保或收发物品）"},"examples":[{"en":"The doorman opened the door and called a taxi for us.","zh":"门卫帮我们开门，还替我们叫了出租车。"},{"en":"Please leave the package with the doorman.","zh":"请把包裹交给门卫。"},{"en":"Our building has a doorman on duty 24 hours a day.","zh":"我们这栋楼有门卫全天24小时值班。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, mainly in sports) a goalkeeper","zh":"（非正式，体育用语）守门员"},"examples":[{"en":"He used to be a hockey doorman before becoming a coach.","zh":"他当教练之前曾是冰球队的守门员。"},{"en":"The doorman made an amazing save in the final minute.","zh":"守门员在最后一分钟做出精彩扑救。"}]}],"synonyms":["door attendant","porter","concierge","gatekeeper","goalie"],"phonetic":"/ˈdɔr.mən/","extraExplanation":["“Dworman”不是常见英文拼写，最可能想写的是“doorman”。“door（门）+ man（人）”构成复合词。","在美国文化里，尤其是纽约等大城市，“doorman building（有门卫的公寓楼）”常暗示更高档的住宅服务：代收快递、叫车、简单安保等。"]}
{"word":"Dworshak","summary":{"en":"Dworshak is a place name in Idaho, best known for Dworshak Dam and Dworshak Reservoir.","zh":"Dworshak 是爱达荷州的地名，最常指德沃夏克大坝与德沃夏克水库。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used for places in Idaho, especially Dworshak Dam and Dworshak Reservoir (a large dam and lake on the North Fork of the Clearwater River).","zh":"专有名词：美国爱达荷州的一些地名，最常见指德沃夏克大坝（Dworshak Dam）和德沃夏克水库/湖（Dworshak Reservoir），位于克利尔沃特河（Clearwater River）北支。"},"examples":[{"en":"We went boating on Dworshak Reservoir last summer.","zh":"去年夏天我们去德沃夏克水库划船了。"},{"en":"Dworshak Dam is one of the tallest straight-axis concrete dams in the United States.","zh":"德沃夏克大坝是美国最高的直线轴混凝土大坝之一。"},{"en":"The hiking trails near Dworshak State Park are popular in the fall.","zh":"德沃夏克州立公园附近的徒步路线在秋天很受欢迎。"}]}],"synonyms":["Dworshak Dam","Dworshak Reservoir","Dworshak State Park"],"phonetic":"ˈdwɔrʃæk","extraExplanation":["“Dworshak”通常读作姓氏/地名。在爱达荷州语境里，多数人提到的是 Dworshak Dam（德沃夏克大坝）或 Dworshak Reservoir（德沃夏克水库）。","该名称来源于美国政治人物 Leonard B. Dworshak（伦纳德·B·德沃夏克）；相关设施以他的姓氏命名。"]}
{"word":"dwt","summary":{"en":"“dwt” is an abbreviation most commonly meaning pennyweight (precious metals) or deadweight tonnage (shipping); in texting it can have varied informal meanings.","zh":"“dwt”常见为缩写：多指贵金属的pennyweight（英钱）或航运的deadweight tonnage（载重吨）；在聊天中也可能是非固定的口语缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “pennyweight,” a unit used to measure precious metals (gold, silver)","zh":"“pennyweight（英钱/金衡便士）”的缩写，用于称量贵金属（如黄金、白银）的重量单位"},"examples":[{"en":"The ring weighs 3 dwt of gold.","zh":"这枚戒指含金重量为 3 dwt。"},{"en":"Gold is often priced by the gram, but some jewelers still use dwt.","zh":"黄金常按克计价，但有些珠宝商仍会用 dwt。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for “deadweight tonnage,” the maximum total weight a ship can safely carry (cargo, fuel, water, etc.)","zh":"“deadweight tonnage（载重吨）”的缩写，指船舶可安全承载的最大总重量（货物、燃油、淡水等）"},"examples":[{"en":"This tanker has a capacity of 150,000 DWT.","zh":"这艘油轮的载重吨为 150,000 DWT。"},{"en":"They chose a higher-DWT vessel to reduce shipping costs per unit.","zh":"他们选择了更高载重吨的船，以降低单位运输成本。"}]},{"partOfSpeech":"other","definition":{"en":"(informal texting) abbreviation used as a short message; meanings vary by community (e.g., “don’t worry though/tho”)","zh":"（非正式短信/聊天）一种缩写，用法随圈子而变（例如表示“不过别担心/别担心啦”之类）"},"examples":[{"en":"Dwt, I’ll handle it.","zh":"别担心啦，我来处理。"},{"en":"I’m not sure what “dwt” means in that chat—can you ask them?","zh":"我不确定那条聊天里“dwt”是什么意思——你可以问问对方吗？"}]}],"synonyms":["pennyweight","deadweight tonnage","DWT"],"phonetic":"/ˌdiːˌdʌbəl.juːˈtiː/","extraExplanation":["“dwt”最常见于两类专业语境：①珠宝/贵金属行业（pennyweight）；②航运/船舶参数（deadweight tonnage）。在聊天缩写里含义不固定，最好结合上下文或直接询问对方。","计量小贴士：pennyweight 通常写作 dwt（或 “dwt.”）。载重吨常写作 DWT（全大写更常见）。"]}
{"word":"Dwyer","summary":{"en":"Dwyer is mainly an Irish-origin surname, and it is also sometimes used as a first name.","zh":"Dwyer 主要是一个源自爱尔兰的姓氏，也偶尔用作名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly Irish in origin.","zh":"一个姓氏（家族姓），最常见于爱尔兰起源。"},"examples":[{"en":"Ms. Dwyer will lead the meeting today.","zh":"德怀尔女士今天将主持会议。"},{"en":"I met Professor Dwyer in college.","zh":"我在大学认识了德怀尔教授。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (first name) used occasionally, usually in English-speaking countries.","zh":"一个偶尔使用的名字（名），多见于英语国家。"},"examples":[{"en":"Dwyer is his first name, not his last name.","zh":"Dwyer 是他的名，不是姓。"},{"en":"They named their son Dwyer after a relative.","zh":"他们以一位亲戚为纪念给儿子取名 Dwyer。"}]}],"synonyms":["O’Dwyer"],"phonetic":"/ˈdwaɪ.ər/","extraExplanation":["“Dwyer”多被认为来自爱尔兰盖尔语姓氏“Ó Duibhir / O’Dwyer”，意思大致与“Duibhir（可能与‘黑/暗’相关的词根）之子/后裔”有关。现代英语里常见拼写为 Dwyer，在爱尔兰裔社群或英美国家较常见。"]}
{"word":"Dwyka","summary":{"en":"Dwyka is mainly a South African proper name, best known for the Dwyka Group in geology—glacial rocks that record an ancient ice age.","zh":"Dwyka主要是南非的专有名词，最常见指地质学中的“德维卡群”——记录远古冰期的冰川沉积岩层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a geological unit in southern Africa (the Dwyka Group), made largely of glacial rocks from the late Paleozoic; it is famous evidence of an ancient ice age.","zh":"（南部非洲地质）德维卡群：以冰川沉积岩为主、形成于古生代晚期的地层单位；常被用作“古冰期”证据。"},"examples":[{"en":"The Dwyka Group contains rocks deposited by glaciers long before humans existed.","zh":"德维卡群包含由冰川沉积形成的岩石，年代远早于人类出现。"},{"en":"In geology class, we studied the Dwyka tillite as evidence of Gondwana glaciation.","zh":"在地质课上，我们学习了德维卡冰碛岩（tillite），作为冈瓦纳古陆冰川作用的证据。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in South Africa (used for local features such as rivers/areas), seen mainly in regional geography or geology contexts.","zh":"（地名）南非的地名用法（常见于河流、地区等地理要素名），多出现在区域地理或地质语境中。"},"examples":[{"en":"The field team collected samples near the Dwyka River area.","zh":"野外小组在德维卡河附近区域采集了样品。"}]}],"phonetic":"/ˈdwaɪkə/","extraExplanation":["“Dwyka”在英语里多作为专有名词出现，最常见的是地质学中的“Dwyka Group（德维卡群）”。它属于南非卡鲁盆地相关的地层体系，常与冰川沉积、古气候以及“冈瓦纳古陆（Gondwana）”的话题一起出现。","发音上，英语里通常按拼写读作“DWY-kə”，重音在第一音节。"]}
{"word":"dwyka","summary":{"en":"Dwyka is mainly used as a South African proper name, best known for the Dwyka Group/Formation—glacial rock layers in the Karoo Supergroup.","zh":"Dwyka主要是南非的专有名称，最常见指德怀卡组/德怀卡层——卡鲁超群中记录古冰期的冰川沉积岩层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major rock unit in South Africa (the Dwyka Group/Formation), made mostly of ancient glacial deposits from the late Paleozoic ice age; it forms the lowest part of the Karoo Supergroup.","zh":"（南非地质）德怀卡组/德怀卡层：主要由古冰川沉积物组成的大型岩层单位，形成于古生代晚期冰期，是卡鲁超群的底部地层之一。"},"examples":[{"en":"Geologists found tillite in the Dwyka Group, showing that glaciers once covered the region.","zh":"地质学家在德怀卡组发现了冰碛岩（tillite），说明这里曾被冰川覆盖。"},{"en":"The Dwyka Formation is an important clue to Earth’s ancient climate in southern Africa.","zh":"德怀卡层是研究南部非洲远古气候的重要线索。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in South Africa (used for local features such as the Dwyka River and nearby areas).","zh":"（南非地名）德怀卡：用于指当地地理名称，如德怀卡河及其周边地区。"},"examples":[{"en":"The field team followed the Dwyka River to reach the outcrops.","zh":"考察队沿着德怀卡河前进，以到达露头区域。"}]}],"synonyms":["Dwyka Group","Dwyka Formation"],"phonetic":"/ˈdwaɪkə/","extraExplanation":["“Dwyka”多被当作专有名词使用，常见于南非地质与古气候研究语境中；在学术写作里也常写作“Dwyka Group / Dwyka Formation”。","读音在英语里通常按地名处理，常见近似为“DWY-kə”。"]}
{"word":"dwyl","summary":{"en":"DWYL = “Do What You Love,” a slogan about pursuing work or activities you’re passionate about.","zh":"DWYL=“Do What You Love（做你所热爱的事）”，指鼓励追求自己热爱之事的口号。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an internet abbreviation for “Do What You Love,” often used as a slogan encouraging people to choose work or activities they feel passionate about","zh":"网络缩写，指“Do What You Love（做你所热爱的事）”，常作标语，用来鼓励人们选择自己热爱、有热情的工作或活动"},"examples":[{"en":"Her bio says “DWYL,” and she posts about finding a career that fits her values.","zh":"她的个人简介写着“DWYL”，她常发帖谈如何找到符合自己价值观的职业。"},{"en":"Some people love the idea of DWYL, but others say it can ignore real-life costs like rent and healthcare.","zh":"有些人很喜欢DWYL的理念，但也有人说它可能忽视现实成本，比如房租和医疗。"}]}],"synonyms":["do what you love","follow your passion","pursue your passion","do what makes you happy"],"phonetic":"/ˌdiː ˌdʌbəl.juː ˌwaɪ ˈɛl/","extraExplanation":["DWYL常见于创业、创意行业与社交媒体语境，带有“把兴趣变成事业”的理想主义色彩。","它也会受到批评：当它被用来劝人“靠热爱就够了”时，可能淡化薪酬、公平劳动、家庭责任等现实因素。更稳妥的理解是：尽量让工作与兴趣/价值观对齐，同时也要考虑可持续的生活条件。","读法通常按字母念（D-W-Y-L）；少数场合会把它当成一个词来读，类似“dwell”的发音。"]}
