{"word":"DZ","summary":{"en":"“DZ” usually means “drop zone”; it can also be Algeria’s country code, and in casual texting it may mean “does.”","zh":"“DZ”通常指“drop zone（降落/投放区）”；也可指阿尔及利亚国家代码；在随意聊天中偶尔可表示“does”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “drop zone,” an area where parachutists or cargo are intended to land.","zh":"“drop zone（投放/降落区）”的缩写，指伞兵或空投物资预定着陆的区域。"},"examples":[{"en":"The team secured the DZ before the helicopters arrived.","zh":"直升机到达前，小队先确保了降落区（DZ）的安全。"},{"en":"Meet at the DZ at 0600 for the jump briefing.","zh":"早上六点在降落区（DZ）集合，参加跳伞简报。"}]},{"partOfSpeech":"other","definition":{"en":"country code abbreviation for Algeria (from the French name “Dzayer/Algérie”; often seen online, in logistics, or as the ISO code “DZ”).","zh":"阿尔及利亚的国家代码缩写（常见于网络、物流等场景；对应 ISO 国家代码“DZ”）。"},"examples":[{"en":"The package destination is DZ, meaning Algeria.","zh":"包裹目的地标注为 DZ，表示阿尔及利亚。"},{"en":"In the country list, Algeria appears with the code DZ.","zh":"在国家列表中，阿尔及利亚的代码是 DZ。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, texting) short for “does,” used in casual messages.","zh":"（非正式，短信/聊天）“does”的简写，用于随意的文字交流。"},"examples":[{"en":"What time dz it start?","zh":"它几点开始？（dz=does）"},{"en":"DZ he know about the change?","zh":"他知道这个变动吗？（DZ=Does）"}]}],"synonyms":["drop zone","LZ (landing zone, related)","ISO country code (related)"],"phonetic":"/diː ziː/","extraExplanation":["“DZ”最常见于军事/跳伞语境，完整说法是 drop zone。口语里通常逐字母读作 “D-Z”。","作为国家代码时，“DZ”对应阿尔及利亚（Algeria）。你可能会在海关/物流单、网站表单国家选项或数据表里看到。","短信里的 “dz=does” 比较口语化、也不太标准；在正式写作中不要这样缩写。"]}
{"word":"dz","summary":{"en":"“dz” most commonly means “dozen(s)” in written lists; it can also mean “dizzy” in texting, or the country code for Algeria (DZ).","zh":"“dz”最常见是清单/票据里表示“dozen(s)（一打）”的缩写；也可在短信中表示“dizzy（头晕）”，或指阿尔及利亚的国家代码（DZ）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Written shorthand for “dozen(s),” especially in orders, invoices, or recipes.","zh":"（缩写）“dozen(s)”（一打/若干打）的书面简写，常见于订单、发票或食谱。"},"examples":[{"en":"Please order 2 dz eggs for the cafeteria.","zh":"请为食堂订购2打鸡蛋。"},{"en":"Nails: 5 dz (60 pieces) per box.","zh":"钉子：每盒5打（60个）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Internet/text shorthand for “dizzy.”","zh":"（缩写）网络/短信中“dizzy（头晕的）”的简写。"},"examples":[{"en":"I stood up too fast and felt dz.","zh":"我起得太快，感觉有点头晕（dz）。"},{"en":"That spinning ride made me dz.","zh":"那个旋转项目把我转晕了（dz）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) A common country code abbreviation for Algeria (from “DZ”), seen in web domains and international codes (e.g., .dz).","zh":"（缩写）阿尔及利亚的常见国家代码缩写（DZ），可见于网址域名和国际代码（如 .dz）。"},"examples":[{"en":"The site uses a .dz domain.","zh":"这个网站使用 .dz 域名。"},{"en":"DZ is the country code for Algeria in some contexts.","zh":"在某些场合，DZ 是阿尔及利亚的国家代码。"}]}],"synonyms":["doz.","dozen(s)","DZ"],"phonetic":"/diː ziː/","extraExplanation":["“dz = dozen(s)”在英语商业书写里很常见：1 dz = 12 个，2 dz = 24 个。也常见变体有“doz.”、“dzs.”。","“DZ”作为阿尔及利亚代码来源于法语/阿拉伯语背景（如对国家名称的缩写习惯），在车牌、邮政/域名等系统中会出现。"]}
{"word":"dza","summary":{"en":"“dza” is not a common English word; its meaning depends on where it’s used (often a typo, abbreviation, or transliteration).","zh":"“dza”不是常见英语单词；含义取决于使用场景（常见为打错、缩写或音译/转写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as an abbreviation, username, or transliteration from another language, so the meaning depends on context.","zh":"不是标准英语单词；多见于缩写、用户名或其他语言的音译/转写，因此含义取决于具体语境。"},"examples":[{"en":"I don’t recognize “dza” as an English word—where did you see it?","zh":"“dza”不像是英语单词——你是在哪里看到的？"},{"en":"In this chat, “dza” might be a typo or a short form for something.","zh":"在这段聊天里，“dza”可能是打错字，或某种简称。"}]}],"phonetic":"/dʒɑː/","extraExplanation":["“dza”有时会出现在非英语语境里：可能是某些语言（如藏语等）的音节转写，或特定领域/组织的缩写。若你能提供一句原文或它出现的场景（文章、游戏、聊天、标志等），我可以更准确判断它的含义。"]}
{"word":"Dzaudzhikau","summary":{"en":"Dzaudzhikau is most likely a transliterated Slavic surname, used as a proper name rather than an English word.","zh":"Dzaudzhikau 很可能是斯拉夫语系姓氏的拉丁字母音译形式，属于专名用法而非英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), likely of Slavic origin (often seen as a transliteration into the Latin alphabet). It is not a standard English vocabulary word.","zh":"一个姓氏（家族姓），可能源自斯拉夫语系，常见于从西里尔字母转写成拉丁字母的拼写形式；不是标准英语词汇。"},"examples":[{"en":"Ms. Dzaudzhikau will present her research tomorrow.","zh":"Dzaudzhikau 女士将于明天展示她的研究。"},{"en":"I’m not sure how to pronounce Dzaudzhikau—could you say it for me?","zh":"我不确定 Dzaudzhikau 怎么读——你能读给我听吗？"}]}],"phonetic":"ˌdzaʊdʒɪˈkaʊ","extraExplanation":["这个拼写看起来像是把斯拉夫语言（如俄语/白俄罗斯语等）的人名用拉丁字母音译后的结果，因此在英语语境里通常当作“专有名词（姓氏）”使用，而不是可解释出固定词义的普通词。","不同国家/系统的音译规则可能导致多种拼写变体；如果你能提供原始语言的拼写（例如西里尔字母）或该名字来自哪个国家/地区，我可以更准确地给出读音与可能的词源含义。"]}
{"word":"dzeren","summary":{"en":"Dzeren means the Mongolian gazelle, a steppe-dwelling antelope species in Mongolia and northern China.","zh":"dzeren 指“蒙古黄羊”，一种生活在蒙古及中国北方草原的羚类动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mongolian gazelle (Procapra gutturosa), a medium-sized antelope native to the grasslands of Mongolia and northern China","zh":"蒙古黄羊（学名 Procapra gutturosa），一种生活在蒙古和中国北方草原的中型羚羊/羚类动物"},"examples":[{"en":"We spotted a herd of dzeren moving across the steppe at dusk.","zh":"黄昏时，我们看到一群蒙古黄羊在草原上移动。"},{"en":"Dzeren migrations can cover long distances in search of fresh grass.","zh":"蒙古黄羊为了寻找新鲜牧草，会进行长距离迁移。"},{"en":"The documentary focused on protecting dzeren habitat from overdevelopment.","zh":"这部纪录片关注保护蒙古黄羊栖息地，避免过度开发。"}]}],"synonyms":["Mongolian gazelle","Procapra gutturosa"],"phonetic":"/ˈdzɛrən/","extraExplanation":["“Dzeren”常见于动物学、生态学与自然纪录片语境，是从蒙古语等相关语言的音译进入英文的动物名称。日常英语中更常见的说法是“Mongolian gazelle”（蒙古黄羊）。","蒙古黄羊以草原为主要栖息地，具有季节性游走/迁徙的习性；相关讨论常涉及草原生态保护、栖息地破碎化与人类活动影响。"]}
{"word":"dzerin","summary":{"en":"“dzerin” is not a standard English word; it’s likely a proper name or a misspelling.","zh":"“dzerin”不是标准英语词汇；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “dzerin” is most likely a name (a surname/username) or a misspelling of another English word.","zh":"不是标准英语单词。“dzerin”更可能是姓名（姓氏/网名）或某个英文单词的拼写错误。"},"examples":[{"en":"My colleague’s username is Dzerin.","zh":"我同事的用户名是 Dzerin。"},{"en":"I couldn’t find “dzerin” in an English dictionary—could it be a misspelling?","zh":"我在英文词典里找不到“dzerin”——会不会是拼写错误？"}]}],"phonetic":"/ˈzɛrɪn/","extraExplanation":["“dzerin”在常见英美词典中没有固定词条。如果你是从聊天、游戏ID、社交媒体、或人名中看到的，它很可能是专有名词（昵称/姓氏/品牌名），这种情况下通常不翻译，只按读音或习惯译法处理。","如果你想查的是类似拼写的英文单词，可能是：daring（勇敢的）、desert（沙漠/遗弃）、driven（有干劲的/被驱动的）、dazzling（耀眼的）。把原句发我，我可以根据上下文帮你锁定正确词。"]}
{"word":"dzeron","summary":{"en":"“dzeron” is not a standard English word; it’s likely a name or a misspelling.","zh":"“dzeron”不是标准英语单词；更可能是人名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a name (a given name or surname) or a transliteration from another language.","zh":"不是标准英语单词；最常见是人名（名或姓），或来自其他语言的音译/转写。"},"examples":[{"en":"I couldn’t find “Dzeron” in an English dictionary—maybe it’s a person’s name?","zh":"我在英语词典里找不到“Dzeron”——它可能是人名吗？"},{"en":"Dzeron Johnson will speak at the meeting today.","zh":"Dzeron Johnson 今天将在会议上发言。"}]},{"partOfSpeech":"other","definition":{"en":"Possible misspelling of a different English word (the exact meaning depends on what you intended).","zh":"可能是某个英语单词的拼写错误（具体意思取决于你原本想写的词）。"},"examples":[{"en":"Did you mean “drone” or “Xeron/Zeron”?","zh":"你想写的是“drone（无人机/嗡嗡作响）”还是“Xeron/Zeron”之类的词吗？"}]}],"phonetic":"/ˈdzɛrɑn/","extraExplanation":["“dzeron”在常见英语语料/词典中不属于标准词汇，所以最稳妥的处理是把它当作专有名词（人名/地名/品牌名）或其他语言的转写。","如果你能告诉我：1）你在哪看到这个词（句子/截图/链接），或 2）你想表达的中文意思，我可以帮你确认它最可能对应的英文词，并给出准确释义与用法。"]}
{"word":"Dzerzhinsk","summary":{"en":"Dzerzhinsk is a city in Russia, often mentioned in connection with its industrial (especially chemical) history and its Soviet-era naming.","zh":"Dzerzhinsk（捷尔任斯克）是俄罗斯城市，常因其工业（尤其化工）历史及苏联时期的改名背景而被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Russia (in Nizhny Novgorod Oblast), known historically for its chemical industry.","zh":"俄罗斯的一座城市（位于下诺夫哥罗德州），历史上以化学工业闻名。"},"examples":[{"en":"Dzerzhinsk is located west of Nizhny Novgorod.","zh":"捷尔任斯克位于下诺夫哥罗德以西。"},{"en":"The report mentioned environmental issues around Dzerzhinsk.","zh":"报告提到了捷尔任斯克周边的环境问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name sometimes used in historical or political contexts, because the city was named after Felix Dzerzhinsky.","zh":"在历史或政治语境中出现的地名用法，因为该城以费利克斯·捷尔任斯基命名。"},"examples":[{"en":"In Soviet-era documents, Dzerzhinsk appears as an important industrial center.","zh":"在苏联时期的文件中，捷尔任斯克常被提到是重要的工业中心。"}]}],"phonetic":"/dzərˈʒɪnsk/","extraExplanation":["“Dzerzhinsk”来自俄语“Дзержинск”，中文常译作“捷尔任斯克”。英语里有时也会见到不同的拼写或译名，这是因为从俄语到拉丁字母/中文的转写方式不止一种。","读音提示：开头的“Dz-”在英语里不常见，听起来有点像“dz”；中间的“zh”类似英语单词 measure 里的 /ʒ/ 音。","历史背景：该市原名“Rastyapino”，1929年改名以纪念苏联政治人物费利克斯·捷尔任斯基（Felix Dzerzhinsky）。因此在涉及苏联历史、工业史或政治人物时，这个地名更常出现。"]}
{"word":"Dzhambul","summary":{"en":"Dzhambul is an older Russian-style spelling used for Taraz (a city in Kazakhstan) and for the name Jambyl/Zhambyl (especially the poet Jambyl Jabayev).","zh":"Dzhambul 是一种较旧的俄语式拼写/转写，常指哈萨克斯坦城市塔拉兹（Taraz，旧称之一），也可指 Jambyl/Zhambyl（尤其是诗人江布尔·扎巴耶夫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A former Russian/Soviet-style spelling of **Taraz**, a city in southern Kazakhstan; also used as the older name of the city during parts of the 20th century.","zh":"（专有名词）**塔拉兹（Taraz）**在俄语/苏联时期常见的旧译名或旧拼写形式之一；指哈萨克斯坦南部的一座城市（曾在20世纪部分时期使用该名称）。"},"examples":[{"en":"Taraz was known as **Dzhambul** during the Soviet period.","zh":"塔拉兹在苏联时期曾被称为 **Dzhambul**。"},{"en":"The train route lists Taraz (formerly **Dzhambul**) as a stop.","zh":"火车线路把塔拉兹（旧称 **Dzhambul**）列为一站。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A variant transliteration of **Jambyl (Zhambyl) Jabayev**, a famous Kazakh poet and folk singer (akyn).","zh":"（专有名词）**江布尔/詹布尔·扎巴耶夫（Jambyl/Zhambyl Jabayev）**的另一种音译/转写形式，他是著名的哈萨克诗人、民间歌手（阿肯，akyn）。"},"examples":[{"en":"Some English sources spell the poet’s name as **Dzhambul**.","zh":"一些英文资料会把这位诗人的名字拼作 **Dzhambul**。"},{"en":"A museum in the region features works connected to **Dzhambul** (Jambyl Jabayev).","zh":"当地的一座博物馆展示了与 **Dzhambul**（江布尔·扎巴耶夫）相关的作品。"}]}],"synonyms":["Taraz","Jambyl","Zhambyl"],"phonetic":"/dʒɑmˈbul/","extraExplanation":["“Dzh-”这种开头常见于把俄语字母组合“Дж”转写成英文的旧式拼法，读音接近英语的 /dʒ/（如 *judge* 开头的音）。因此 **Dzhambul** 常被视为对 **Jambyl/Zhambyl** 的俄语式转写。","在现代英语资料中，你更常见到 **Taraz**（城市现名）以及 **Jambyl/Zhambyl**（人名/州名一类的更常见拼写）。如果你是在地图、旧书或苏联时期文件里看到 **Dzhambul**，通常就是这些名称的旧写法。"]}
{"word":"Dzhugashvili","summary":{"en":"Dzhugashvili is a Georgian surname, most famously Joseph Stalin’s birth surname.","zh":"Dzhugashvili 是一个格鲁吉亚姓氏，最著名的用法是作为斯大林的本姓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Georgian surname, best known in English as the birth surname of Joseph Stalin (Ioseb Jughashvili).","zh":"一个格鲁吉亚（乔治亚）姓氏；在英语语境中最广为人知的是苏联领导人斯大林（约瑟夫·斯大林）的本姓（Ioseb Jughashvili）。"},"examples":[{"en":"Joseph Stalin was born with the surname Dzhugashvili (often spelled Jughashvili).","zh":"约瑟夫·斯大林出生时的姓是 Dzhugashvili（也常拼作 Jughashvili）。"},{"en":"In some history books, you may see “Dzhugashvili” used when discussing Stalin’s early life.","zh":"在一些历史书里，谈到斯大林早年经历时可能会用到 “Dzhugashvili”。"}]}],"synonyms":["Jughashvili","Stalin"],"phonetic":"/dʒuːɡəˈʃviːli/","extraExplanation":["“Dzh-”是一种把俄语/东欧语言中类似“дж”的音译成英语字母的写法；因此同一个姓在英语里常见多种拼写（如 Jughashvili、Dzhugashvili）。","格鲁吉亚姓氏里常见后缀“-shvili”（意为“孩子/子孙”之类的家族后缀），所以这个词通常作为姓氏出现，而不是普通词汇。"]}
{"word":"dziggetai","summary":{"en":"“dziggetai” isn’t a recognized English word; it likely needs context or correct spelling.","zh":"“dziggetai”不是常见英语单词；需要语境或确认正确拼写才能解释。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a made-up word, or a transliteration from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/网名、自造词，或来自其他语言的音译/转写。"},"examples":[{"en":"I couldn’t find “dziggetai” in an English dictionary—where did you see it?","zh":"我在英语词典里找不到“dziggetai”——你是在哪里看到的？"},{"en":"If you can share a sentence with “dziggetai,” I can guess its meaning from context.","zh":"如果你能提供包含“dziggetai”的句子，我可以根据语境推测意思。"}]}],"phonetic":"/ˌdiːziːˈɡɛtaɪ/","extraExplanation":["“dziggetai”看起来像是外语转写（例如人名、地名、社群用语或某种语言的罗马字拼写），但仅凭这个拼写很难确定来源和含义。","请你补充其中一种信息，我就能更准确地解释：1）它出现的句子/截图；2）你想表达的中文意思；3）你怀疑它对应的英文/其他语言词（比如更常见的拼写）。"]}
{"word":"Dzimba","summary":{"en":"Dzimba most commonly means “houses” in Shona, and it can also be a surname.","zh":"Dzimba 最常见的含义是绍纳语里的“房子（复数）”，也可以用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Shona (a major language of Zimbabwe), “dzimba” means “houses” (plural of “imba,” meaning “house/home”).","zh":"在绍纳语（津巴布韦的主要语言之一）中，“dzimba”表示“房子/住宅”（“imba”的复数，意为“房子/家”）。"},"examples":[{"en":"There are many dzimba in this neighborhood.","zh":"这个社区里有很多房子（dzimba）。"},{"en":"They are building new dzimba near the road.","zh":"他们正在路边建新的房子（dzimba）。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) used by some people, especially in Southern Africa.","zh":"一个姓氏（家族名），在南部非洲地区较常见。"},"examples":[{"en":"Ms. Dzimba will join the meeting today.","zh":"Dzimba 女士今天会参加会议。"}]}],"synonyms":["homes","houses","dwellings"],"phonetic":"/ˈdzɪmbə/","extraExplanation":["“Dzimba”来自绍纳语时，开头的“dz-”在英语里不常见，读起来接近“dz”连读的声音（像 d + z 快速连在一起）。英语使用者有时会把它简化成更像“zim-”的发音，但在绍纳语里“dz-”是有区别的音。","如果你是在某个具体语境里看到 Dzimba（人名、地名、品牌名或书/电影角色），它的确切含义可能取决于该语境；你可以把原句发我，我能帮你更准确判断。"]}
{"word":"dzo","summary":{"en":"A dzo is a yak–cow hybrid, valued in the Himalayas for strength and endurance.","zh":"dzo 指牦牛与家牛的杂交牛，在喜马拉雅地区因强壮耐劳而珍贵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hybrid animal (usually a male) born from a yak and a domestic cow, commonly found in the Himalayan region and used as a strong work animal.","zh":"牦牛与家牛杂交所生的杂交牛（通常指雄性），常见于喜马拉雅地区，因力气大而被用作役畜。"},"examples":[{"en":"In the high Himalayas, farmers use dzo to carry heavy loads along mountain paths.","zh":"在高海拔的喜马拉雅地区，农民会用牦牛杂交牛来沿山路驮运重物。"},{"en":"A dzo can handle thin air and steep terrain better than many other cattle.","zh":"牦牛杂交牛比许多其他牛更能适应稀薄空气和陡峭地形。"}]}],"synonyms":["yak-cattle hybrid"],"phonetic":"/dzoʊ/","extraExplanation":["“dzo”多用于藏区与尼泊尔、不丹等喜马拉雅相关语境；在英文里属于较少见的外来词。","有时你会看到相关词：雌性的杂交牛常写作“dzomo”（或“zom”），但具体用法会因地区与资料而异。"]}
{"word":"Dzoba","summary":{"en":"“Dzoba” is most commonly a proper name rather than an English word.","zh":"“Dzoba”最常见的是专有名词，而不是英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English vocabulary word). It may be used as a surname, given name, username, or place name in some languages/regions.","zh":"专有名词（不是标准英语词汇）。可能作为姓氏、名字、网名或某些地区的地名使用。"},"examples":[{"en":"Dzoba is my classmate’s last name.","zh":"Dzoba 是我同学的姓。"},{"en":"The account name “Dzoba” was already taken.","zh":"账号名“Dzoba”已经被注册了。"}]}],"phonetic":"/ˈdzoʊbə/","extraExplanation":["“Dzoba”在英语里通常不会出现在词典中，更常见的是音译/转写出来的人名或地名。不同语言来源会导致发音和拼写规则不同，所以具体含义需要结合语境（例如来自哪种语言、指人还是指地点）。","如果你能告诉我：它出现在哪个句子/国家/语言环境里（或发一张截图），我可以更准确地判断它的来源、含义和更自然的英文表达方式。"]}
{"word":"Dzongka","summary":{"en":"Dzongkha: the official language of Bhutan.","zh":"宗卡语：不丹的官方语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the official language of Bhutan, belonging to the Tibetic (Tibetan-related) language group","zh":"不丹的官方语言，属于藏语支（与藏语有亲缘关系）的语言"},"examples":[{"en":"Dzongkha is the national language of Bhutan.","zh":"宗卡语是不丹的国语（官方语言）。"},{"en":"Some signs in Thimphu are written in Dzongkha and English.","zh":"廷布的一些标识同时用宗卡语和英语书写。"},{"en":"She is learning Dzongkha to prepare for a trip to Bhutan.","zh":"她正在学习宗卡语，为去不丹旅行做准备。"}]}],"synonyms":["Dzongkha","Bhutanese (language)"],"phonetic":"/ˈdzɔŋkə/","extraExplanation":["常见拼写是 **Dzongkha**，有时也会看到 **Dzongka** 这种写法。","宗卡语主要使用不丹的传统文字体系（与藏文字母同源），在学校、政府和媒体中具有重要地位。"]}
{"word":"Dzugashvili","summary":{"en":"Dzugashvili is a Georgian surname, most famously associated with Joseph Stalin’s birth name.","zh":"Dzugashvili 是一个格鲁吉亚姓氏，最著名的关联是斯大林的本姓。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Georgian surname (family name), best known as the birth surname of Soviet leader Joseph Stalin (Ioseb Besarionis dze Jughashvili).","zh":"一个格鲁吉亚姓氏（家族姓），最为人熟知的是苏联领导人约瑟夫·斯大林的本姓（伊奥塞布·别萨里奥尼斯·泽·朱加什维利/朱加什维利）。"},"examples":[{"en":"Joseph Stalin was born as Ioseb Jughashvili (also written Dzugashvili in some sources).","zh":"约瑟夫·斯大林出生时名为伊奥塞布·朱加什维利（一些资料也写作 Dzugashvili）。"},{"en":"The surname Dzugashvili is Georgian in origin.","zh":"Dzugashvili 这个姓氏源自格鲁吉亚语。"}]}],"synonyms":["Jughashvili","Dzhugashvili"],"phonetic":"/dzuːɡəˈʃvɪli/","extraExplanation":["这是一个“姓氏/专名”，通常不翻译，只做音译或按习惯写法转写。","不同语言的转写系统会导致拼法差异：你可能也会看到 Jughashvili / Dzhugashvili 等形式，通常指同一个姓。","格鲁吉亚姓氏里常见的后缀 -shvili（什维利）大致有“……之子/后代”的含义，因此这种姓常带有家族渊源或父系来源的色彩。"]}
{"word":"Dzungar","summary":{"en":"Dzungar refers to the Dzungar (Dzunghar) people—an Oirat Mongol group—and to things connected with their historical state, the Dzungar Khanate.","zh":"Dzungar 指准噶尔人（卫拉特蒙古的一支），也可指与其历史政权“准噶尔汗国”相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Dzungars (also spelled Dzunghars), an Oirat Mongol people who formed the Dzungar Khanate in Central Asia (17th–18th centuries)","zh":"准噶尔人（亦拼作 Dzunghar），卫拉特蒙古的一支，17—18世纪在中亚建立了准噶尔汗国"},"examples":[{"en":"The Qing empire fought several wars against the Dzungars in the 1700s.","zh":"清朝在18世纪与准噶尔人进行了多次战争。"},{"en":"Some historical sources describe the Dzungar Khanate as a major power in Central Asia.","zh":"一些史料将准噶尔汗国描述为中亚的重要强权。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the Dzungars, their language, or their historical state","zh":"与准噶尔人、其语言或其历史政权相关的"},"examples":[{"en":"The museum has a small collection of Dzungar-era artifacts.","zh":"这家博物馆收藏了一些准噶尔时期的文物。"},{"en":"Researchers compare Dzungar records with Qing documents to understand the period.","zh":"研究者会对比准噶尔文献与清代档案来理解那个时期。"}]}],"synonyms":["Dzunghar","Jungar"],"phonetic":"/ˈzʊŋɡɑr/","extraExplanation":["“Dzungar/准噶尔”常见于历史与地理语境：准噶尔汗国的核心区域大致在今天中国新疆北部与周边草原地带；“准噶尔盆地（Dzungarian Basin）”也因此得名。","拼写上常见变体：Dzungar、Dzunghar、Jungar；不同拼写多来自把蒙古语/突厥语词音译成英语时的差异。"]}
{"word":"dzungar","summary":{"en":"Dzungar refers to a western Mongol (Oirat) people and, by extension, things related to their former khanate and culture.","zh":"Dzungar 指西蒙古（卫拉特）的一支——准噶尔人；也可作形容词指与准噶尔汗国及其文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Dzungars, a western Mongol (Oirat) people who formed the Dzungar Khanate in Central Asia (mainly in what is now Xinjiang, China, and parts of Kazakhstan and Mongolia) in the 1600s–1700s.","zh":"准噶尔人：西蒙古（卫拉特）的一支民族/部族，曾在中亚建立“准噶尔汗国”（约17—18世纪），主要活动于今中国新疆及哈萨克斯坦、蒙古一带。"},"examples":[{"en":"The Qing empire fought several major wars against the Dzungars in the 18th century.","zh":"18世纪，清朝与准噶尔部进行了多次重大战争。"},{"en":"Some historical accounts describe the Dzungars as a powerful steppe confederation.","zh":"一些史料将准噶尔人描述为强大的草原联盟。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Dzungars or their former state and culture.","zh":"（与）准噶尔人、准噶尔汗国或其文化（有关）的。"},"examples":[{"en":"The museum has a small collection of Dzungar-era artifacts.","zh":"博物馆收藏了一小部分准噶尔时期的文物。"},{"en":"Researchers study Dzungar history to understand Central Asian politics of the time.","zh":"研究者通过准噶尔史来理解当时的中亚政治格局。"}]}],"synonyms":["Zunghar","Jungar"],"phonetic":"/ˈzuːŋɡɑr/","extraExplanation":["“Dzungar”也常拼作“Zunghar / Jungar”。在中文里常见译名是“准噶尔”。","“准噶尔”一词也出现在地名中（如“准噶尔盆地”），但该地名更多指地理区域，不一定等同于族群本身。"]}
{"word":"Dzungaria","summary":{"en":"Dzungaria is a historical-geographic region in northern Xinjiang, China, centered on the Junggar (Dzungarian) Basin.","zh":"Dzungaria（准噶尔）是中国新疆北部的历史与地理区域，核心为准噶尔盆地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in northwestern China (mainly the Dzungarian/Junggar Basin in northern Xinjiang), historically associated with the Dzungar (Oirat Mongol) people","zh":"准噶尔（中国西北地区，主要指新疆北部的准噶尔/准噶尔盆地；历史上与准噶尔〔卫拉特蒙古〕有关的地区）"},"examples":[{"en":"Dzungaria lies north of the Tianshan Mountains in Xinjiang.","zh":"准噶尔位于新疆天山以北。"},{"en":"Historically, Dzungaria was a key crossroads for trade and migration across Inner Asia.","zh":"历史上，准噶尔是内亚贸易与迁徙的重要通道。"},{"en":"The climate of Dzungaria is dry, with wide grasslands and desert areas.","zh":"准噶尔气候干燥，有广阔草原和沙漠地带。"}]}],"synonyms":["Jungaria","Zungaria","Junggar Basin","Dzungarian Basin"],"phonetic":"/dʒʊŋˈɡɛriə/","extraExplanation":["“Dzungaria”也常写作“Jungaria / Zungaria”。在现代地理语境里，它多指“准噶尔盆地（Junggar Basin）”及其周边。","词源与“Dzungar（准噶尔）”有关，原指卫拉特蒙古的一支及其建立的准噶尔汗国。该地区在17—18世纪的中亚与清朝历史中非常重要。"]}
{"word":"Dzyubin","summary":{"en":"Dzyubin is a Slavic-origin surname written in Latin letters; its spelling can vary due to transliteration.","zh":"Dzyubin 是一个常见于斯拉夫语背景的姓氏（拉丁字母拼写），其拼写可能因音译方式不同而变化。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly found in Slavic-language contexts (e.g., Russian or Ukrainian), usually written in Latin letters as a transliteration.","zh":"一个姓氏（家族姓），常见于斯拉夫语背景（如俄语或乌克兰语），通常是从西里尔字母音译成拉丁字母的拼写。"},"examples":[{"en":"My classmate’s last name is Dzyubin.","zh":"我同学的姓是 Dzyubin。"},{"en":"In the document, Dzyubin is listed as the author.","zh":"在文件里，Dzyubin 被列为作者。"}]},{"partOfSpeech":"other","definition":{"en":"a name spelling that may vary by transliteration system; the same original Cyrillic surname can appear in English as Dzyubin, Dziubin, or similar forms.","zh":"一种可能因音译体系不同而变化的姓名拼写；同一个西里尔字母姓氏在英语里可能写作 Dzyubin、Dziubin 等不同形式。"},"examples":[{"en":"Search results show Dzyubin and Dziubin—these may refer to the same family name.","zh":"搜索结果里有 Dzyubin 和 Dziubin——它们可能指的是同一个姓氏。"}]}],"synonyms":["(no direct synonym; it is a proper name)"],"phonetic":"/ˈzjuːbɪn/","extraExplanation":["“Dzyubin”看起来像从俄语/乌克兰语等使用西里尔字母的语言音译过来的拼写；不同国家/护照/媒体采用的音译规则不同，所以同一个姓氏可能出现多种拉丁字母写法。","在英语语境中它通常作为专有名词使用：首字母大写，不加冠词（不说 *a Dzyubin* 来指一个人），除非是在谈“这个姓氏/这一家族”。如果你能提供它的来源语言或原始拼写（西里尔字母），读音和含义可以更准确。"]}
