{"word":"EE","summary":{"en":"“EE” is most commonly an abbreviation for Electrical Engineering; in some online contexts it can also mean “Eevee.”","zh":"“EE”最常见是Electrical Engineering（电气工程）的缩写；在部分网络语境中也可能指宝可梦“Eevee（伊布）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Electrical Engineering; the field of studying and designing electrical systems such as circuits, power, and electronics.","zh":"（缩写）电气工程；研究与设计电路、电力系统与电子设备等的学科。"},"examples":[{"en":"She’s majoring in EE and wants to work on renewable energy.","zh":"她主修EE（电气工程），想从事可再生能源相关工作。"},{"en":"The EE department offers courses in circuits and signal processing.","zh":"EE系（电气工程系）开设电路与信号处理等课程。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., online) “Eevee,” a popular Pokémon; often written as “EE” as a nickname.","zh":"（网络缩写）“伊布”（Eevee），很受欢迎的宝可梦；“EE”有时用作昵称。"},"examples":[{"en":"My favorite Pokémon is EE—Eevee is so cute.","zh":"我最喜欢的宝可梦是EE（伊布），真的很可爱。"},{"en":"In some chats, people shorten Eevee to “EE.”","zh":"在一些聊天里，人们会把Eevee简称为“EE”。"}]}],"synonyms":["Electrical Engineering","E.E.","Eevee (nickname: EE)"],"phonetic":"/ˌiː ˈiː/","extraExplanation":["“EE”是字母缩写，含义高度依赖语境：在大学/职场中最常见的是Electrical Engineering（电气工程）。在游戏或宝可梦社群里，“EE”也可能指Eevee（伊布）。如果你告诉我出现的句子/场景，我可以帮你确定最准确的意思。"]}
{"word":"ee","summary":{"en":"“EE/ee” most commonly means the abbreviation for electrical engineering (or an electrical engineer), and it can also be an “ee!” sound showing feelings, or the spoken name of the letter E.","zh":"“EE/ee”最常见是“电气工程/电气工程师”的缩写；也可作“ee!”的语气拟声（表达惊讶/不适/嫌恶）；还可表示字母E的读音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) electrical engineering; also an electrical engineer.","zh":"（缩写）电气工程；也可指电气工程师。"},"examples":[{"en":"She’s studying EE at university.","zh":"她在大学读电气工程（EE）。"},{"en":"Ask an EE to check the circuit design.","zh":"请一位电气工程师（EE）检查一下电路设计。"}]},{"partOfSpeech":"int.","definition":{"en":"A sound like “ee!” used to show surprise, discomfort, or disgust (often in playful or informal speech).","zh":"“ee!” 之类的声音，用来表示惊讶、不舒服或嫌恶（多用于非正式/口语、带点夸张）。"},"examples":[{"en":"Ee! That water is freezing!","zh":"咦！那水冰得要命！"},{"en":"Ee, don’t touch that—it’s sticky.","zh":"咦，别碰那个——黏黏的。"}]},{"partOfSpeech":"n.","definition":{"en":"The name of the letter “E” (sometimes written as “ee” when representing the sound in text).","zh":"字母 “E” 的读音/名称（在文字里有时写作 “ee” 来表示读音）。"},"examples":[{"en":"“E” is pronounced “ee.”","zh":"字母 “E” 读作“ee”。"},{"en":"Write an “ee” sound like in “see.”","zh":"写一个像 “see” 里那样的“ee”音。"}]}],"synonyms":["electrical engineering","electrical engineer","E (letter name)"],"phonetic":"/iː/","extraExplanation":["在英文里，“EE”作为缩写非常常见，尤其在学校专业、职位和简历中：EE major（电气工程专业）、EE intern（电气工程实习生）。如果是网络聊天或漫画里出现的“ee!”，通常只是拟声/语气词，表示情绪反应，并不是正式单词。"]}
{"word":"eebree","summary":{"en":"“eebree” is not a recognized standard English word; it likely represents a name or a misspelling of another word.","zh":"“eebree”不是标准英语词汇；更可能是名称，或是其他单词的误拼/拟声写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, nickname, brand name, or a phonetic spelling of another word.","zh":"不是标准英语单词；更可能是拼写错误、昵称/品牌名，或对某个词的拟声拼写。"},"examples":[{"en":"I couldn’t find “eebree” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“eebree”——你能把它出现的句子发我看看吗？"},{"en":"Sometimes people write sounds like “eebree” online to imitate pronunciation.","zh":"有时人们会在网上用“eebree”这种写法来模仿发音。"}]}],"phonetic":"/ˈiːbriː/","extraExplanation":["“eebree”本身不常见，所以最有用的是确认语境：它是在聊天、歌词、游戏ID、品牌名，还是某种语言/方言的转写？","如果你是在听力里听到/看到类似拼写，可能想表达的词包括（仅供参考）：\n- eerie（/ˈɪri/，怪异的、阴森的）\n- debris（/dəˈbriː/，残骸、碎片）\n- agree（/əˈɡriː/，同意）\n把原句或截图发来，我可以帮你准确判断。"]}
{"word":"EEC","summary":{"en":"EEC most commonly means the European Economic Community, a predecessor to the EU; in other contexts it can be another abbreviation, so check the surrounding text.","zh":"EEC 最常见指“欧洲经济共同体”，是欧盟的前身之一；在其他语境中也可能是别的缩写，需结合上下文确认。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"European Economic Community (historical): a group of European countries formed to promote economic cooperation and a common market; it later became part of today’s European Union (EU).","zh":"（历史）欧洲经济共同体：为促进欧洲国家间经济合作与共同市场而成立的组织，后来发展并并入今天的欧盟（EU）。"},"examples":[{"en":"The EEC helped reduce trade barriers among its member countries.","zh":"EEC 帮助成员国之间减少了贸易壁垒。"},{"en":"Before the EU, many people referred to Western Europe’s economic bloc as the EEC.","zh":"在欧盟成立之前，许多人把西欧的经济集团称为 EEC。"},{"en":"The UK joined the EEC in 1973.","zh":"英国于 1973 年加入 EEC。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, context-dependent) An abbreviation used in some fields for other terms, such as “electrical and electronic components” or names of organizations; the exact meaning depends on the situation.","zh":"（较少见，依语境而定）在某些领域中也可作其他词组或机构名称的缩写，如“电气与电子元件”等；具体含义取决于上下文。"},"examples":[{"en":"In this catalog, EEC refers to electrical and electronic components.","zh":"在这本目录里，EEC 指“电气与电子元件”。"},{"en":"Always check the document’s glossary to see what EEC means there.","zh":"务必查看文件的术语表，确认其中 EEC 的含义。"}]}],"synonyms":["Common Market","European Economic Community"],"phonetic":"/ˌiː iː ˈsiː/","extraExplanation":["EEC 常被称为“Common Market（共同市场）”。它最初由《罗马条约》（1957）建立，核心目标是推动成员国之间的货物、服务、资本与人员更自由流动。","1993 年《马斯特里赫特条约》生效后，“European Community（EC）”逐步取代 EEC 的称呼，并最终发展为今天更广义的 European Union（EU）。","容易混淆：EEOC（Equal Employment Opportunity Commission，美国平等就业机会委员会）不是 EEC。"]}
{"word":"EECT","summary":{"en":"“EECT” is not a standard word; it’s a context-dependent abbreviation.","zh":"“EECT”不是标准词汇，而是依上下文而定的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare abbreviation (acronym/initialism) that is not a standard English word; its meaning depends on the specific field (e.g., a school program name, a course code, a company/team name).","zh":"一个较少见的缩写（首字母缩略词/字母缩写），不是常见英语词汇；具体含义取决于使用领域（如学校项目名称、课程代码、公司/团队名称等）。"},"examples":[{"en":"What does “EECT” stand for in this document?","zh":"“EECT”在这份文件里代表什么？"},{"en":"I saw “EECT” in an email, but there wasn’t enough context to understand it.","zh":"我在一封邮件里看到了“EECT”，但上下文不足，无法理解它的意思。"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/ˌiː iː siː ˈtiː/","extraExplanation":["“EECT”不像常见缩写（如 “USA”“DIY”）那样有固定、广泛认可的释义。要准确解释，需要你提供上下文：它出现在哪个领域（学校/工程/医学/公司内部）？前后一句话是什么？","如果你把包含“EECT”的原句贴出来（或告诉我它来自哪门课程/哪份报告），我可以帮你判断最可能的展开形式，并给出对应的中文解释与用法。"]}
{"word":"EEDP","summary":{"en":"“EEDP” is an acronym usually pronounced as the letters “E-E-D-P,” and its meaning depends on the context (often a development program or an energy-efficiency-related process).","zh":"“EEDP”是一个缩写，通常按字母读作“E-E-D-P”，具体含义取决于语境（常见为培养/发展项目或与能效相关的流程）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) The acronym “EEDP” can mean different things depending on the field (business, engineering, education, government, etc.). Most often it is read aloud as the letters “E-E-D-P.”","zh":"（缩写）“EEDP”在不同领域含义不同（商业、工程、教育、政府等）。最常见的读法是按字母读“E-E-D-P”。"},"examples":[{"en":"What does EEDP stand for in this document?","zh":"在这份文件里，EEDP 代表什么？"},{"en":"I’m not sure which EEDP you mean—can you share the full name or the context?","zh":"我不确定你指的是哪个 EEDP——能否提供全称或使用场景？"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., business/HR) Sometimes used for a company “Employee/Engineering Early Development Program” (a training program for new hires).","zh":"（缩写，商业/人资）有时指公司里的“员工/工程师早期培养项目”（面向新员工的培训培养计划）。"},"examples":[{"en":"She joined the EEDP after graduation to rotate through different teams.","zh":"她毕业后参加了 EEDP，在不同团队轮岗。"},{"en":"The EEDP focuses on training, mentoring, and early career growth.","zh":"EEDP 侧重培训、导师辅导和早期职业发展。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., tech/engineering) In some contexts it can refer to an “Energy-Efficient Design/Development Process/Program.”","zh":"（缩写，技术/工程）在某些语境中可指“节能（高能效）设计/开发流程或项目”。"},"examples":[{"en":"The team used an EEDP to reduce power consumption in the new system.","zh":"团队采用 EEDP 来降低新系统的能耗。"},{"en":"Our EEDP guidelines require measuring energy use during testing.","zh":"我们的 EEDP 指南要求在测试阶段测量能耗。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/ˌiː iː ˌdiː ˈpiː/","extraExplanation":["“EEDP”不是一个固定词义的常用英语单词，更像是行业缩写。不同公司、学校或项目里可能代表完全不同的全称。","如果你把 EEDP 出现的句子、领域（例如：招聘、课程、工程规范、政府文件）或截图发我，我可以帮你确定最准确的展开与含义。"]}
{"word":"EEE","summary":{"en":"“EEE” most commonly means the university field/department Electrical and Electronic Engineering; informally it can also be an interjection expressing disgust or fear.","zh":"“EEE”最常见指大学专业/系“电气与电子工程”；非正式用法中也可作感叹词，表示嫌恶或害怕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Electrical and Electronic Engineering (a university major/department covering circuits, electronics, power systems, signals, etc.).","zh":"（缩写）Electrical and Electronic Engineering，电气与电子工程（大学专业/系，涵盖电路、电子、电力系统、信号等）。"},"examples":[{"en":"She’s studying EEE at university and wants to work in robotics.","zh":"她在大学读 EEE（电气与电子工程），想去做机器人相关工作。"},{"en":"The EEE department is offering a new course on embedded systems.","zh":"EEE 系正在开设一门新的嵌入式系统课程。"}]},{"partOfSpeech":"int.","definition":{"en":"(interjection; informal) A sound showing dislike, fear, or discomfort (similar to “Ew!”).","zh":"（感叹词；非正式）表示嫌恶、害怕或不舒服的声音（类似“咦！”“呃！”）。"},"examples":[{"en":"Eee—there’s a spider on the wall!","zh":"咦——墙上有只蜘蛛！"},{"en":"Eee, that smell is awful.","zh":"咦，这味道太难闻了。"}]}],"synonyms":["Electrical and Electronic Engineering (EEE)","EE (related abbreviation)","ECE (related abbreviation)","ew (similar interjection)","eek (similar interjection)"],"phonetic":"/ˌiː iː ˈiː/","extraExplanation":["在学校或求职语境里，EEE 常指“电气与电子工程”，不同国家/学校也可能写作 EE（Electrical Engineering）或 ECE（Electrical & Computer Engineering）。","作为感叹词时，拼写可能出现 eee / eek / eeek 等，用来模仿尖叫或嫌恶的声音；书写长度（eee vs. eeeee）常表示情绪强度。"]}
{"word":"eeee","summary":{"en":"“eeee” is informal internet writing for a long “ee” sound, often showing hesitation or awkwardness.","zh":"“eeee”是非正式的网络写法，表示拉长的“ee”音，常用来表达犹豫或尴尬。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A written representation of a long “ee” sound, often used online to show confusion, hesitation, boredom, or an awkward pause (similar to “uh…” or “um…”).","zh":"用文字表示拉长的“ee”音，常见于网络交流，用来表达困惑、犹豫、无聊或尴尬的停顿（类似“呃……”或“嗯……”）。"},"examples":[{"en":"Eeee… I’m not sure what you mean.","zh":"呃……我不太确定你是什么意思。"},{"en":"Eeee, that’s kind of awkward.","zh":"呃，这有点尴尬。"},{"en":"He replied with “eeee” when he didn’t know what to say.","zh":"他不知道该说什么时就回了“eeee”。"}]}],"synonyms":["um","uh","er","hmm"],"phonetic":"/iː/","extraExplanation":["“eeee”并不是标准英语单词，更像是网络拟声/打字习惯。不同人用法不同：有的人用来表示尴尬停顿，有的人用来装可爱或表达无语。正式写作中建议改用 “um/uh” 或直接改写句子。"]}
{"word":"EEG","summary":{"en":"EEG is the abbreviation for electroencephalogram (a brain-wave recording) and sometimes electroencephalography (the technique).","zh":"EEG 是 electroencephalogram（脑电图记录/检查）的缩写，有时也指 electroencephalography（脑电图检查法/脑电图学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) electroencephalogram: a test/recording of the brain’s electrical activity, usually made with sensors placed on the scalp.","zh":"（缩写）脑电图：用头皮上的电极记录大脑电活动的检查/记录结果。"},"examples":[{"en":"The doctor ordered an EEG to check for seizures.","zh":"医生安排做脑电图（EEG）来检查是否有癫痫发作。"},{"en":"Her EEG was normal, so the team looked for other causes of the symptoms.","zh":"她的脑电图结果正常，因此团队继续寻找其他症状原因。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev.) electroencephalography: the method/field of measuring and studying brain electrical activity using an EEG.","zh":"（缩写）脑电图检查法/脑电图学：用脑电图来测量并研究大脑电活动的方法或领域。"},"examples":[{"en":"EEG is commonly used in sleep studies.","zh":"脑电图（EEG）常用于睡眠研究。"},{"en":"The lab specializes in EEG analysis and brain–computer interfaces.","zh":"这个实验室专注于脑电图（EEG）分析和脑机接口。"}]}],"synonyms":["electroencephalogram","electroencephalography","brain-wave test"],"phonetic":"/iː iː dʒiː/","extraExplanation":["EEG 通常读作字母：E-E-G（在医学沟通和报告中很常见）。","EEG 主要用于评估癫痫、昏迷/脑功能状态、睡眠障碍等；它记录的是“电活动”，不是直接的影像（与 CT/MRI 不同）。","容易混淆的缩写：ECG/EKG 是心电图（记录心脏电活动），EEG 是脑电图（记录大脑电活动）。"]}
{"word":"EEG-related","summary":{"en":"EEG-related means connected with an EEG test or with measuring/analyzing brain electrical activity.","zh":"EEG-related 指与脑电图检查或与测量/分析大脑电活动有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with EEG (electroencephalography) or an EEG test; involving the recording or analysis of brain electrical activity.","zh":"与脑电图（EEG，脑电检查/脑电记录）有关的；涉及记录或分析大脑电活动的。"},"examples":[{"en":"The doctor ordered EEG-related tests to investigate her seizures.","zh":"医生安排了与脑电图相关的检查，以调查她的癫痫发作。"},{"en":"EEG-related signals can help researchers study sleep stages.","zh":"与脑电图相关的信号可以帮助研究人员研究睡眠阶段。"},{"en":"The report includes EEG-related findings from the overnight monitoring.","zh":"报告包含了整夜监测得到的与脑电图相关的结果。"}]}],"synonyms":["EEG-associated","EEG-linked","related to EEG"],"phonetic":"/ˌiː iː ˈdʒiː rɪˈleɪtɪd/","extraExplanation":["EEG 是 electroencephalogram（脑电图，指“结果/图”）或 electroencephalography（脑电图检查/脑电记录方法）的缩写；在医学与神经科学里常见搭配有 EEG recording（脑电记录）、EEG monitoring（脑电监测）、EEG study（脑电研究）。","写作中“EEG-related”常作为复合形容词，用连字符修饰名词（如 EEG-related activity/findings/changes）。如果放在名词后作表语，也可写成 “related to EEG”。"]}
{"word":"eegrass","summary":{"en":"Eelgrass is a flowering seagrass that grows in shallow coastal waters, often forming underwater meadows.","zh":"Eelgrass 指生长在浅海沿岸、常形成海底草甸的开花海草（如大叶藻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of seagrass (a flowering marine plant) that grows in shallow coastal waters, forming underwater meadows.","zh":"一种海草（开花的海洋植物），生长在浅海沿岸水域，常形成“海底草甸”。"},"examples":[{"en":"Eelgrass meadows provide shelter for young fish and crabs.","zh":"大叶藻草甸为幼鱼和螃蟹提供庇护。"},{"en":"The bay used to be full of eelgrass before the water became cloudy.","zh":"在海水变得浑浊之前，这个海湾曾经长满了大叶藻。"}]},{"partOfSpeech":"n.","definition":{"en":"The long, ribbon-like leaves of this plant, sometimes washed ashore.","zh":"这种海草细长带状的叶片（有时会被海浪冲到岸边）。"},"examples":[{"en":"After the storm, piles of eelgrass covered the beach.","zh":"暴风雨过后，海滩上堆满了被冲上岸的大叶藻。"}]}],"synonyms":["seagrass","Zostera (genus)"],"phonetic":"/ˈiːlˌɡræs/","extraExplanation":["你输入的“eegrass”更常见的拼写是 **eelgrass**（大叶藻等海草的统称）。","Eelgrass 属于“海草（seagrass）”，是**开花植物**而不是海藻（seaweed）。它通过根系固定在海底，对稳定海岸、净化水质、吸碳都有重要作用。","在北美语境里，eelgrass 常指 *Zostera marina*（大叶藻），在生态与海洋保护话题中很常见。"]}
{"word":"EEGs","summary":{"en":"“EEGs” means multiple electroencephalograms—brain-wave tests/records.","zh":"“EEGs”指多次/多个脑电图（检查或记录）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of EEG: electroencephalogram(s), a medical test that records the brain’s electrical activity (brain waves) using sensors on the scalp.","zh":"EEG 的复数：脑电图（检查）（electroencephalogram），一种用头皮电极记录大脑电活动（脑电波）的医学检查。"},"examples":[{"en":"The neurologist reviewed the patient’s EEGs to look for signs of seizures.","zh":"神经科医生查看了病人的多次脑电图检查结果，以寻找癫痫发作的迹象。"},{"en":"Her EEGs were normal, so the doctor ordered additional tests.","zh":"她的脑电图结果正常，所以医生安排了进一步检查。"},{"en":"Researchers compared EEGs from people with and without sleep disorders.","zh":"研究人员比较了有睡眠障碍与无睡眠障碍人群的脑电图数据。"}]}],"synonyms":["electroencephalograms","brain-wave tests","EEG recordings"],"phonetic":"ˌi i ˈdʒi","extraExplanation":["“EEG”是缩写，完整写法为 electroencephalogram。日常医疗语境里，EEG 既可指“检查/记录结果”，也可泛指“脑电图这项检查”。","EEG 常用于评估癫痫/癫痫样放电、睡眠问题、意识障碍等；它主要反映大脑皮层的电活动，属于无创检查。","写作中更正式的表达是 “electroencephalograms”，口语和病历里常直接写 “EEGs”。"]}
{"word":"EEHO","summary":{"en":"EEHO is not a standard English word; it is usually an initialism whose meaning depends on context.","zh":"EEHO 不是标准英语单词；它通常是首字母缩写，含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (acronym written in capital letters). “EEHO” is not a common standard English word, and its meaning depends on the specific field or community using it.","zh":"一个首字母缩写（用大写字母写的缩写）。EEHO 不是常见的标准英语单词，具体含义取决于使用它的领域或圈子。"},"examples":[{"en":"I saw “EEHO” in the email, but I couldn’t tell what it stood for without more context.","zh":"我在邮件里看到了“EEHO”，但没有更多上下文就不知道它代表什么。"},{"en":"Could you tell me what “EEHO” means in your document?","zh":"你能告诉我在你的文件里“EEHO”是什么意思吗？"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/ˌiː iː eɪtʃ ˈoʊ/","extraExplanation":["在英语里，像 EEHO 这种全大写的形式通常是“首字母缩写”（initialism/acronym）。同一组字母在不同领域可能代表完全不同的词组，所以最好的做法是提供出现它的句子、行业（如医疗、工程、学校、公司内部）或上下文，我才能帮你准确释义。"]}
{"word":"EEI","summary":{"en":"EEI is an abbreviation. Common meanings include the Edison Electric Institute (U.S. electric-utility trade group) and Energy Efficiency Index (a measure of energy efficiency).","zh":"EEI 是一个缩写。常见含义包括：爱迪生电力协会（美国电力行业协会）以及能效指数（衡量能效的指标）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Edison Electric Institute: a U.S. trade association representing investor-owned electric utility companies.","zh":"爱迪生电力协会（Edison Electric Institute）：美国的行业协会，代表投资者持有的电力公用事业公司。"},"examples":[{"en":"According to the EEI, the electric grid needs major upgrades.","zh":"根据 EEI 的说法，电网需要重大升级。"},{"en":"She works on policy research for EEI in Washington, D.C.","zh":"她在华盛顿特区为 EEI 从事政策研究工作。"}]},{"partOfSpeech":"n.","definition":{"en":"Energy Efficiency Index: a number used to compare how energy-efficient a device, building, or system is (common in appliance standards and energy reports).","zh":"能效指数（Energy Efficiency Index）：用于比较设备、建筑或系统能耗效率的指标（常见于家电标准与能耗报告）。"},"examples":[{"en":"This refrigerator has a low EEI, so it uses less electricity.","zh":"这台冰箱的 EEI 很低，所以更省电。"},{"en":"The report tracks EEI changes across different models each year.","zh":"这份报告每年追踪不同型号的 EEI 变化。"}]},{"partOfSpeech":"other","definition":{"en":"More generally: an abbreviation that can stand for different things depending on the field (energy, utilities, education, business, etc.).","zh":"更一般地说：一个缩写，在不同领域（能源、电力、公用事业、教育、商业等）可能代表不同含义。"},"examples":[{"en":"In this document, EEI refers to the Edison Electric Institute.","zh":"在这份文件中，EEI 指的是爱迪生电力协会。"},{"en":"Please define EEI the first time you use it in a report.","zh":"在报告中第一次使用 EEI 时，请先写出全称并说明含义。"}]}],"synonyms":["Edison Electric Institute","Energy Efficiency Index"],"phonetic":"/ˌiː iː ˈaɪ/","extraExplanation":["EEI 是字母缩写，通常读作三个字母的拼读。在不同语境里含义差别很大：如果你是在读美国电力/政策新闻，很可能是 Edison Electric Institute；如果你是在看家电能效或欧盟能效标准材料，则常见为 Energy Efficiency Index。你可以告诉我你看到 EEI 的句子或行业背景，我能帮你确定具体指什么。"]}
{"word":"EEK","summary":{"en":"“Eek” is an exclamation for sudden fear, surprise, or nervousness.","zh":"“eek”是表示突然害怕、惊讶或紧张的感叹词。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show sudden fear, surprise, or nervousness (like “Ah!” or “Oh no!”).","zh":"（感叹词）表示突然的害怕、惊讶或紧张（类似“啊！”“糟了！”）。"},"examples":[{"en":"Eek! There’s a spider on the wall.","zh":"啊！墙上有一只蜘蛛。"},{"en":"Eek—sorry! I didn’t mean to bump into you.","zh":"哎呀——对不起！我不是故意撞到你的。"},{"en":"Eek! I almost missed my stop.","zh":"糟了！我差点坐过站。"}]}],"synonyms":["ah","oh","yikes","oops","gah"],"phonetic":"/ik/","extraExplanation":["“eek”常带一点“可爱/夸张”的语气，常见于口语、漫画、聊天或轻松的写作中；在非常正式或严肃的场合，人们更常用“oh!”“ah!”“help!”等。","它通常用于对小惊吓（比如虫子、突然的声音、差点出糗）作即时反应，也可表达尴尬或紧张。"]}
{"word":"Eek","summary":{"en":"“Eek” is a quick exclamation for sudden fear, surprise, or disgust, often playfully.","zh":"“Eek”是一个很短的感叹词，用来表达突然的害怕、惊讶或嫌恶，常带玩笑或夸张语气。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show sudden fear, surprise, or disgust (often in a playful way).","zh":"（感叹词）用来表示突然的害怕、惊讶或厌恶（常带一点开玩笑、夸张的感觉）。"},"examples":[{"en":"Eek! There’s a spider on the wall!","zh":"啊！墙上有只蜘蛛！"},{"en":"Eek—this milk smells bad.","zh":"哎呀——这牛奶闻起来变质了。"},{"en":"Eek! You scared me!","zh":"哎呀！你吓到我了！"}]}],"synonyms":["yikes","eep","ah!","oh no!"],"phonetic":"/ik/","extraExplanation":["“Eek”多见于口语、漫画、社交媒体或轻松的对话中，语气往往偏可爱/夸张；在正式写作里不常用。","它常用来表达对小事的“惊吓反应”（比如虫子、突然的声音），比“Help!”或“Stop!”弱得多，也不一定代表真正的危险。"]}
{"word":"eek","summary":{"en":"“Eek” is an exclamation for sudden fear, surprise, or disgust, often playful.","zh":"“eek”是表示突然害怕、惊讶或厌恶的感叹词，常带俏皮夸张的语气。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show sudden fear, surprise, or disgust (often in a playful way).","zh":"（感叹词）用于表达突然的害怕、惊讶或厌恶（常带有俏皮、夸张的语气）。"},"examples":[{"en":"Eek! There’s a spider on the wall!","zh":"啊！墙上有只蜘蛛！"},{"en":"Eek—this milk smells bad.","zh":"咦——这牛奶闻起来变质了。"},{"en":"Eek! You scared me when you came in so quietly.","zh":"呀！你这么安静地进来把我吓到了。"}]}],"synonyms":["yikes","ew","ah","oh no"],"phonetic":"/ik/","extraExplanation":["“eek”常见于口语、漫画、影视字幕和社交媒体，用来模拟尖叫或小声惊呼的感觉；比“ah/oh”更像“吓一跳的尖叫”。","语气通常偏轻松、可爱或夸张；在非常正式的写作中不常用。相近表达有“yikes!”（哎呀/糟糕）和“ew!”（恶心）。"]}
{"word":"EEL","summary":{"en":"An eel is a long, snake-like fish.","zh":"Eel 指鳗鱼，一种细长、像蛇一样的鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, snake-like fish that lives in the sea or fresh water","zh":"鳗鱼；一种身体细长、像蛇一样的鱼，可生活在海水或淡水中"},"examples":[{"en":"We saw an eel hiding under the rocks.","zh":"我们看到一条鳗鱼躲在岩石下面。"},{"en":"Eels can live in rivers and also travel to the ocean.","zh":"鳗鱼既能生活在河流里，也会迁徙到海洋。"},{"en":"She ordered grilled eel for dinner.","zh":"她晚餐点了烤鳗鱼。"}]}],"synonyms":["snakefish (rare)","unagi (as a food term, Japanese)"],"phonetic":"/il/","extraExplanation":["“eel”在饮食文化中很常见：日式料理里常说“unagi（烤鳗鱼）”，通常指淡水鳗；“anago”多指海鳗。不同地区对“鳗鱼”的种类区分更细，日常英文里常用eel统称。","鳗鱼以身体滑、黏液多闻名，所以英语里有时会用“eel-like”形容人或物“滑溜、难以捉摸”。"]}
{"word":"eel","summary":{"en":"An eel is a long, slippery, snake-like fish; it can also (less commonly) mean to fish for eels.","zh":"eel 指鳗鱼；也可（较少用）作动词，表示捕鳗鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, snake-like fish with a slippery body that lives in the sea or in freshwater rivers and lakes","zh":"鳗鱼；一种身体细长像蛇、表面黏滑的鱼类，可生活在海水或淡水中"},"examples":[{"en":"We saw an eel hiding under the rocks in the river.","zh":"我们看到一条鳗鱼躲在河里的石头下面。"},{"en":"Eels can swim forward and backward with smooth, wave-like movements.","zh":"鳗鱼能用平滑的波浪式动作向前或向后游动。"}]},{"partOfSpeech":"v.","definition":{"en":"to catch eels or fish for eels (less common)","zh":"捕鳗鱼；捉鳗鱼（较少用）"},"examples":[{"en":"They went out at night to eel in the shallow water.","zh":"他们晚上到浅水区去捕鳗鱼。"}]}],"synonyms":["(n.) freshwater eel","(n.) sea eel","(informal comparison) slippery fish"],"phonetic":"/iːl/","extraExplanation":["鳗鱼在英语里也常出现在比喻中：比如“slippery as an eel”（像鳗鱼一样滑不溜手），形容人很难抓住把柄、很会逃避责任。","文化上，鳗鱼是很多地方的常见食材：例如日式料理里的“unagi”（烤鳗鱼）在英语语境中也很常见。注意“eel”本身是英文通用说法，不等于特定做法。","英语里“electric eel”（电鳗）很有名，但严格来说它不是“真正的鳗鱼”（true eel），而是一种外形相似、能放电的淡水鱼，这在科普语境中常被提到。"]}
{"word":"eel-fork","summary":{"en":"An eel-fork is a pronged tool used for catching or handling slippery eels.","zh":"eel-fork 指用来捕捉或处理滑溜鳗鱼的叉状工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tool with prongs (like a small fork or spear) used to catch, hold, or handle eels, especially when fishing or preparing them","zh":"鳗叉；用于捕捉、固定或处理鳗鱼的叉状工具（多见于捕鱼或料理时）"},"examples":[{"en":"The fisherman used an eel-fork to pin the slippery eel in the net.","zh":"渔夫用鳗叉把滑溜的鳗鱼按在网里。"},{"en":"In the old kitchen, an eel-fork hung beside the knives and hooks.","zh":"在那间老厨房里，鳗叉挂在刀和挂钩旁边。"}]}],"synonyms":["eel spear","fish fork","gaff (similar use)"],"phonetic":"/ˈil ˌfɔrk/","extraExplanation":["“eel-fork”是比较少见、偏传统或地方性的词，多见于旧式渔具或乡村/河湖地区的用具名称。由于鳗鱼表面黏滑、不易徒手抓握，这类带尖齿的工具可以帮助固定或取出鳗鱼。"]}
{"word":"eel-larval","summary":{"en":"Eel-larval means “related to eel larvae or the larval stage of eels.”","zh":"eel-larval 指“与鳗鱼幼体或鳗鱼的幼体阶段有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an eel in its larval stage, or describing something that resembles or involves eel larvae.","zh":"与鳗鱼的幼体阶段有关的；描述鳗鱼幼体（或类似鳗鱼幼体的事物）的。"},"examples":[{"en":"Scientists tracked eel-larval drift to understand how young eels reach coastal waters.","zh":"科学家追踪鳗鱼幼体的漂流路径，以了解幼鳗如何到达沿海水域。"},{"en":"The report focuses on eel-larval survival rates in the open ocean.","zh":"该报告聚焦于鳗鱼幼体在外海的存活率。"}]}],"synonyms":["larval eel","eel larvae (as a noun phrase)","leptocephalus (specific larval form, technical)"],"phonetic":"/ˈiːl ˈlɑɹvəl/","extraExplanation":["“eel-larval”较少见，多用于生物学/渔业研究写作中，强调“鳗鱼的幼体阶段”。鳗鱼的早期生活史常被描述为卵 → 幼体（如柳叶鳗 leptocephalus）→ 玻璃鳗（glass eel，接近透明、进入河口）→ 鳗苗/黄鳗（elver/yellow eel）→ 银鳗（silver eel，性成熟回游产卵）。因此在论文或报告里，常会看到类似“eel-larval transport / eel-larval ecology（鳗鱼幼体运输/生态）”的搭配。"]}
{"word":"eel-like","summary":{"en":"“Eel-like” means shaped or moving like an eel—long, thin, and smoothly wriggling.","zh":"“eel-like”指形状或动作像鳗鱼——细长，并且平滑地扭动/蜿蜒。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an eel in shape or movement (long, thin, and often slippery-looking).","zh":"像鳗鱼的；形状或动作像鳗鱼（细长、常给人滑溜的感觉）。"},"examples":[{"en":"The creature had an eel-like body and moved smoothly through the water.","zh":"那生物有着鳗鱼般的身体，在水中顺滑地游动。"},{"en":"An eel-like cable snaked across the floor.","zh":"一根像鳗鱼一样的电缆蜿蜒穿过地板。"}]}],"synonyms":["eelish","snake-like","serpentine","sinuous"],"phonetic":"/ˈilˌlaɪk/","extraExplanation":["“eel-like”是由名词“eel（鳗鱼）”+“‑like（像……的）”构成的复合形容词，常用于描写外形（细长）或动作（蜿蜒、滑行）。在写作中也可带一点比喻色彩，用来形容人或事物“滑溜、难捉摸”（语气可能偏负面），如：an eel-like politician（圆滑、难以捉摸的政客）。"]}
{"word":"eel-shaped","summary":{"en":"“Eel-shaped” describes something long, narrow, and sinuously curved like an eel.","zh":"“eel-shaped”指像鳗鱼一样细长、狭窄并呈蜿蜒弯曲的形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an eel: long, narrow, and flexible, often with smooth curves.","zh":"鳗鱼状的；细长、狭窄且柔韧的，常呈平滑弯曲的形状。"},"examples":[{"en":"An eel-shaped ribbon of smoke drifted across the dark water.","zh":"一缕鳗鱼状的烟带飘过黑暗的水面。"},{"en":"The artist drew an eel-shaped line to suggest movement and speed.","zh":"画家画了一条鳗鱼状的线来表现运动感和速度感。"}]}],"synonyms":["sinuous","serpentine","snake-like","wormlike","slender"],"phonetic":"/ˈiːl ˌʃeɪpt/","extraExplanation":["这个词是“eel（鳗鱼）+ shaped（……形状的）”的组合形容词，常用来形容细长、蜿蜒、像蛇或鳗鱼一样的外形。写作时也可以用同类结构，如“spear-shaped（矛状的）”“heart-shaped（心形的）”。"]}
{"word":"eelback","summary":{"en":"An informal term for an eel-like fish (often burbot/eelpout).","zh":"指外形像鳗鱼的鱼的俗称（常指江鳕/绒杜父鱼等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fish with an eel-like body or back (often used for burbot or eelpout in some regions)","zh":"像鳗鱼一样细长的鱼（在一些地区常指江鳕或绒杜父鱼等）"},"examples":[{"en":"Some locals call the burbot an “eelback” because of its long, slippery body.","zh":"一些当地人把江鳕叫作“eelback”，因为它身体细长、摸起来很滑。"},{"en":"The fisherman said eelbacks are common in colder lakes.","zh":"渔夫说在较冷的湖里，eelback 很常见。"}]}],"synonyms":["eelpout","burbot"],"phonetic":"ˈiːlˌbæk","extraExplanation":["“eelback”不是非常常用的标准词，更像是某些地区或渔业语境中的俗称/通俗叫法。不同地区可能指不同鱼种，但共同点是“外形像鳗鱼（eel）”。","构词上是 eel（鳗鱼）+ back（背/背部），用来强调“背部或体形像鳗鱼一样细长”。如果你是在菜谱、钓鱼论坛或地方口语里看到它，最好结合上下文确认具体指哪种鱼。"]}
{"word":"eelblennies","summary":{"en":"“Eelblennies” means more than one eelblenny—small eel-like sea fish that live near the bottom.","zh":"“eelblennies”是“eelblenny”的复数，指多条像鳗鱼一样、贴近海底生活的海水小鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of eelblenny: any of several small, eel-like marine fishes (often in the blenny/eelpout groups) that live near the sea bottom among rocks, algae, or cold-water coastal habitats.","zh":"eelblenny 的复数：指多种体形细长、像鳗鱼一样的海水小鱼（常与鳚形鱼/“eelpout”等类群相关），多在海底岩石、海藻间或寒冷沿海水域活动。"},"examples":[{"en":"In the tide pools, we spotted several eelblennies hiding under flat rocks.","zh":"在潮池里，我们看到几条 eelblennies 躲在扁平的石头下面。"},{"en":"Eelblennies often stay close to the seafloor and slip into crevices when threatened.","zh":"eelblennies 常贴近海底活动，受到惊吓时会钻进岩缝里。"}]}],"synonyms":["eel blennies","eelpouts (approx.)","blennies (broad)"],"phonetic":"/ˈiːlˌblɛniːz/","extraExplanation":["“eelblennies”是复数形式；单数是“eelblenny”。这个词在日常英语里不常见，多出现在海洋生物学、自然观察或渔业相关语境中。","不同地区的英文资料有时会把外形像鳗的“鳚类/绵鳚类（eelpout, Zoarcidae）”或与“blenny（鳚鱼）”相近的鱼混用称呼；如果你有具体图片或学名（拉丁名），可以更精确对应中文名。"]}
{"word":"eelblenny","summary":{"en":"An eelblenny is a small eel-like blenny fish that hides among rocks in shallow coastal waters.","zh":"eelblenny 指一种身体像鳗鱼一样细长的䲁鱼，常藏在浅海沿岸岩石缝隙中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, slender, eel-like fish (a kind of blenny) that often hides in rocks or crevices in shallow coastal waters.","zh":"鳗形䲁（一种䲁鱼），体型细长像鳗鱼，常躲在浅海沿岸的岩石缝或洞穴里。"},"examples":[{"en":"We spotted an eelblenny peeking out from a crack in the reef.","zh":"我们看到一条鳗形䲁从珊瑚礁的裂缝里探出头来。"},{"en":"Eelblennies are hard to see because they blend in with rocks and sand.","zh":"鳗形䲁很难被发现，因为它们会和岩石、沙地融为一体。"}]}],"synonyms":["eel blenny","blenny"],"phonetic":"/ˈiːlˌblɛni/","extraExplanation":["“eelblenny”通常也写作“eel blenny”。这是常见名（common name），不同地区可能指不同但外形相似的䲁鱼类（blennies），所以在科学写作或观测记录里常会再配合学名或照片确认。","䲁鱼（blenny）多为底栖、善于躲藏的小型海鱼；“eel-”只是形容它的身体更细长、像鳗鱼，并不表示它真的是鳗鱼（eel）。"]}
{"word":"eelboat","summary":{"en":"An eelboat is a boat used for catching or transporting eels.","zh":"eelboat 指用于捕捞或运输鳗鱼的船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A boat used for catching, keeping, or transporting eels (often in river or coastal eel fisheries).","zh":"鳗鱼船；用于捕捞、暂养或运输鳗鱼的船（多见于河流或沿海鳗业）。"},"examples":[{"en":"The fishermen loaded their catch into an eelboat before heading back to the dock.","zh":"渔民把渔获装上鳗鱼船，然后返回码头。"},{"en":"In the past, small eelboats moved along the river at night to check eel traps.","zh":"过去，小型鳗鱼船常在夜里沿河巡行，查看鳗鱼陷阱。"}]}],"synonyms":["eel boat","fishing boat","workboat"],"phonetic":"/ˈilˌboʊt/","extraExplanation":["“eelboat”不是现代日常英语里的常用词，更常见的写法是分开写作“eel boat”。在英国、荷兰等有鳗鱼渔业传统的地区，历史上确实会用专门的船只来放置鱼笼、收网或把活鳗暂养在有水箱/活舱的船上。阅读旧文献或地方史材料时更容易遇到这个词。"]}
{"word":"eelbob","summary":{"en":"“eelbob” is not a standard English word; it’s usually a username or a playful coinage (possibly “eel” + “bob”).","zh":"“eelbob”不是标准英语词；通常是用户名或趣味自造词（可能由“eel”+“bob”组成）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or made-up word; most often used as a username, nickname, or playful coined term rather than a dictionary word.","zh":"非标准/自造词；多用于用户名、昵称或玩笑式造词，而不是正式词典词汇。"},"examples":[{"en":"Online, “eelbob” looks like a username rather than an English vocabulary word.","zh":"在网络上，“eelbob”看起来更像用户名，而不是英语词汇。"},{"en":"If you saw “eelbob” in a text, you’d need context to know what the writer means.","zh":"如果你在文本里看到“eelbob”，需要上下文才能知道作者想表达什么。"}]},{"partOfSpeech":"n.","definition":{"en":"A possible playful blend of “eel” (a long, snake-like fish) + “bob” (to move up and down), suggesting something like “an eel that bobs” or “bobbing like an eel.”","zh":"可能是由“eel（鳗鱼）”+“bob（上下浮动/跳动）”拼成的趣味混成词，暗示“像鳗鱼一样上下浮动”或“会浮动的鳗鱼”。"},"examples":[{"en":"The toy eel started to bob in the water—someone joked and called it an “eelbob.”","zh":"那条玩具鳗鱼在水里开始上下浮动——有人开玩笑叫它“eelbob”。"},{"en":"In a game, a creator might name a floating eel-like creature “eelbob.”","zh":"在游戏里，创作者可能把一种漂浮的鳗鱼状生物命名为“eelbob”。"}]}],"synonyms":["(none—nonstandard term)"],"phonetic":"/ˈilbɑb/","extraExplanation":["“eelbob”不是常见英语词典词条，所以没有固定、统一的标准释义。最可靠的理解方式是：看它出现的场景（比如是用户名、角色名、物品名，还是一段叙述中的自造词）。","如果你是想查某个特定作品/游戏/社区里的“eelbob”，告诉我它出现的句子或来源，我可以按语境帮你更准确地解释。"]}
{"word":"eelbobber","summary":{"en":"An “eel bobber” is a fishing float (bobber) used for eel fishing, often made to show subtle bites and handle heavier bait.","zh":"“eel bobber”指钓鳗鱼用的浮漂/浮标，通常更能显示细微咬钩并适合较重饵料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fishing float (bobber) used when fishing for eels, often designed to support heavier bait and make subtle bites easier to see.","zh":"（钓鳗鱼用的）浮漂/浮标，常为较重的饵料设计，便于观察鳗鱼较细微的咬钩信号。"},"examples":[{"en":"He clipped an eel bobber onto the line and cast near the reeds.","zh":"他把鳗鱼浮漂夹到鱼线上，朝芦苇边抛竿。"},{"en":"An eel bobber can help you notice a slow, steady pull instead of a quick splash.","zh":"鳗鱼浮漂能帮助你发现缓慢、持续的拉扯，而不是一下子的大动静。"}]},{"partOfSpeech":"n.","definition":{"en":"A brand name or nickname for a specific style of bobber used by local anglers (usage varies by region).","zh":"某些地区钓友对特定款式浮漂的商品名或俗称（各地用法可能不同）。"},"examples":[{"en":"Ask the tackle shop if they carry the eel bobber you saw online.","zh":"问问渔具店有没有你在网上看到的那款“鳗鱼浮漂”。"}]}],"synonyms":["eel float","fishing bobber","float","fishing float"],"phonetic":"ˈiːl ˌbɑbɚ","extraExplanation":["“bobber”在美式英语里通常指钓鱼用的“浮漂/浮标”，会随着鱼咬钩而上下移动或被拖走。加上“eel-”表示它更适合钓鳗鱼：可能浮力更大、对缓慢下沉或侧向拖拽更敏感。","这个词比较口语、偏钓鱼圈子用语，不是非常通用的标准词；在不同地区也可能直接说“eel float”或“bobber for eels”。"]}
{"word":"eelcake","summary":{"en":"A (usually savory) cake/pie made with eel.","zh":"一种以鳗鱼制作的（多为咸味的）糕/派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cake or pie made with eel as an ingredient (often a savory dish).","zh":"鳗鱼糕／鳗鱼派：以鳗鱼为主要食材制作的“糕/派”（通常是咸味的菜肴）。"},"examples":[{"en":"The menu listed eelcake as a local specialty, served warm with greens.","zh":"菜单上写着鳗鱼糕是当地特色，热着配青菜一起上。"},{"en":"I’d never tried eelcake before, but it tasted like a rich savory pie.","zh":"我以前从没吃过鳗鱼糕，但味道很像浓郁的咸派。"}]}],"synonyms":["eel pie","eel tart","eel cake"],"phonetic":"/ˈilˌkeɪk/","extraExplanation":["“eelcake”并不是非常常见的标准词汇，更常见的写法是 **eel cake**（分开写），或在英国语境里更常听到 **eel pie**（鳗鱼派）。在伦敦等地的传统饮食文化中，鳗鱼曾是平价常见的食材，出现过多种做法（派、冻鳗等）。不同地区对“鳗鱼糕/派”的具体做法可能差异很大。"]}
{"word":"eelcatcher","summary":{"en":"An eelcatcher is someone (or, less commonly, a device) that catches eels.","zh":"eelcatcher 指捕鳗的人（较少也可指捕鳗装置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who catches eels, especially as a job","zh":"捕鳗人；以捕捞鳗鱼为业的人"},"examples":[{"en":"The eelcatcher checked the traps at dawn.","zh":"捕鳗人天一亮就去查看陷阱。"},{"en":"In the past, many eelcatchers worked along the river to supply local markets.","zh":"过去，许多捕鳗人沿河作业，为当地市场供货。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool or device used for catching eels (less common)","zh":"捕鳗工具；捕鳗装置（较少用）"},"examples":[{"en":"They bought an eelcatcher designed to keep the eels from slipping out.","zh":"他们买了一个捕鳗装置，设计用来防止鳗鱼滑脱。"}]}],"synonyms":["eel fisherman","eel fisher","eel catcher","eel trap (device)"],"phonetic":"/ˈiːlˌkætʃər/","extraExplanation":["“eelcatcher”不是非常常见的现代通用词，更常见的说法包括“eel fisher / eel fisherman”（捕鳗的渔夫）或更具体的“eel trap”（鳗鱼笼/鳗鱼陷阱）。在一些河口、湿地或传统渔业地区，这类职业或工具更容易出现。"]}
{"word":"eeler","summary":{"en":"An eeler is someone who catches eels, often as a job.","zh":"eeler 指抓（捕）鳗鱼的人，常指以此为业者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who catches eels, especially as a job","zh":"捕鳗人；抓鳗鱼的人（尤指以此为业者）"},"examples":[{"en":"My grandfather was an eeler on the river and sold his catch at the market.","zh":"我祖父在河里抓鳗鱼为生，并把捕获的鳗鱼卖到市场。"},{"en":"The eeler checked the traps early in the morning.","zh":"捕鳗人一大早就去查看陷阱。"}]}],"synonyms":["eel fisherman","eel catcher"],"phonetic":"/ˈiːlər/","extraExplanation":["“eeler”来自“eel（鳗鱼）+ -er（从事某种工作的人）”。在英语里，类似构词还有“fisher（渔夫）”“baker（面包师）”。","这个词比较少见，更常见的说法是“eel fisherman（捕鳗渔民）”或“someone who catches eels（抓鳗鱼的人）”。"]}
{"word":"eelery","summary":{"en":"An eelery is a place where eels are raised, kept, or caught.","zh":"eelery 指养殖、饲养或捕捞鳗鱼的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place where eels are kept, raised, or caught (for example, a pond, enclosure, or fishing area).","zh":"养鳗场；鳗鱼养殖或捕捞的地方（如池塘、围栏或渔场）。"},"examples":[{"en":"The river used to support an eelery that supplied local markets.","zh":"这条河过去有个鳗鱼渔场，为当地市场供货。"},{"en":"They visited an eelery to learn how eels are raised and transported.","zh":"他们参观了养鳗场，了解鳗鱼如何养殖和运输。"}]}],"synonyms":["eel farm","fishery","hatchery"],"phonetic":"/ˈiːləri/","extraExplanation":["“eelery”由“eel（鳗鱼）+ -ery（表示地点/行业的后缀）”构成，类似的词还有“brewery（啤酒厂）”“fishery（渔场/渔业）”。","这个词在现代日常英语中不算常见，更常见的说法是“eel farm（养鳗场）”或在更广义语境中用“fishery（渔场/渔业）”。"]}
{"word":"eelfare","summary":{"en":"“Welfare” means well-being and safety, and it can also mean government financial help or services for people in need.","zh":"“Welfare”既指福祉与安全，也可指政府对困难人群提供的救济金或社会服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “welfare”) People’s health, safety, and general well-being; also, help (money/services) provided by the government to people who need it.","zh":"（你可能想拼：welfare）福利；（人们的）健康、安全与总体福祉；也指政府对困难人群提供的救济金或社会服务。"},"examples":[{"en":"The program focuses on child welfare and safety.","zh":"这个项目关注儿童福利与安全。"},{"en":"She applied for welfare after she lost her job.","zh":"她失业后申请了社会救济。"},{"en":"We should consider the welfare of the whole community.","zh":"我们应该考虑整个社区的福祉。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to government support and services for people in need (used before a noun).","zh":"（作定语）与社会救济/社会福利有关的。"},"examples":[{"en":"The city expanded welfare benefits for low-income families.","zh":"该市扩大了对低收入家庭的福利补助。"},{"en":"He works at a welfare office.","zh":"他在社会救济机构工作。"}]}],"synonyms":["well-being","benefit","public assistance","social services"],"phonetic":"/ˈwɛlˌfɛr/","extraExplanation":["“welfare”常见两层意思：①广义的“福祉/幸福与安全”（the welfare of…）；②较具体的“社会救济/福利金”（go on welfare, apply for welfare）。在一些语境里，谈到社会救济可能带有争议或刻板印象，表达时可用更中性的说法，如 “public assistance” 或 “social benefits”。"]}
{"word":"eelfish","summary":{"en":"Elf-like: playfully mischievous in a charming, magical way.","zh":"像小精灵一样：可爱又有点淘气、带点奇幻气质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like an elf; playful, mischievous, and slightly magical or impish in a charming way.","zh":"像小精灵的；顽皮淘气的，带点神秘或精怪气质（常含可爱、迷人的意味）。"},"examples":[{"en":"Her elfish grin made it hard to stay mad at her.","zh":"她那顽皮的精灵式笑容让人很难继续生她的气。"},{"en":"The child gave an elfish laugh and ran away.","zh":"孩子发出一阵精灵般的笑声就跑开了。"},{"en":"He had an elfish charm—quiet, quick, and full of surprises.","zh":"他有一种精灵般的魅力——安静、敏捷，又充满惊喜。"}]}],"synonyms":["impish","mischievous","playful","pixie-like","sprightly"],"phonetic":"/ˈɛlfɪʃ/","extraExplanation":["你写的“eelfish”通常是拼写错误；正确拼写更常见的是 **elfish**（来自 elf“小精灵” + -ish“有点像……”）。","**elfish** 常用于文学或描写性语境，带有想象色彩，比普通的 “playful/cheeky（顽皮/有点调皮）”更梦幻、更童话。","语气多为褒义或亲昵；如果形容成人，有时也暗示“古灵精怪、爱恶作剧”。"]}
{"word":"eelgrass","summary":{"en":"Eelgrass is a coastal seagrass that forms underwater meadows and supports marine life.","zh":"Eelgrass（鳗草）是一种沿海海草，能形成水下草甸并支持多种海洋生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of seagrass (a flowering plant) that grows in shallow coastal waters and forms underwater meadows.","zh":"一种海草（会开花的植物），生长在浅海岸边，常形成水下“草甸”。"},"examples":[{"en":"Eelgrass beds provide shelter for young fish and crabs.","zh":"鳗草草床为幼鱼和螃蟹提供栖身之所。"},{"en":"The bay was once covered with eelgrass, but pollution reduced it.","zh":"这个海湾曾经遍布鳗草，但污染使其减少了。"}]}],"synonyms":["seagrass","Zostera (genus)"],"phonetic":"/ˈiːlˌɡræs/","extraExplanation":["“eelgrass”叫“鳗草”是因为它细长的叶片让人联想到鳗鱼（eel），但它不是藻类，而是有根、会开花并结种子的海洋植物。","鳗草草甸在生态上很重要：能稳定海底沉积物、改善水质，并为海马、贝类、鱼类等提供栖息地。"]}
{"word":"eelgrasses","summary":{"en":"Eelgrasses are seagrass plants (especially eelgrass) that grow in shallow coastal waters.","zh":"Eelgrasses 指生长在浅海沿岸的海草植物（尤指鳗草/大叶藻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Marine flowering plants (seagrasses), especially eelgrass, that grow in shallow coastal waters and form underwater meadows.","zh":"（海草的一种）大叶藻/鳗草等海洋开花植物，生长在浅海沿岸，常形成“海底草甸”。"},"examples":[{"en":"Eelgrasses provide shelter for young fish and crabs.","zh":"鳗草为幼鱼和小螃蟹提供栖身之处。"},{"en":"The bay’s eelgrasses were damaged by pollution and boat traffic.","zh":"这个海湾的鳗草因污染和船只活动而受损。"},{"en":"Scientists map eelgrasses to track coastal ecosystem health.","zh":"科学家绘制鳗草分布图来监测海岸生态系统的健康状况。"}]}],"synonyms":["seagrass","eelgrass","zostera"],"phonetic":"/ˈiːlˌɡræs/","extraExplanation":["“eelgrass”在英语里常指大叶藻属（Zostera）的海草；复数“eelgrasses”表示多片草场或不同种类/区域的鳗草群落。","鳗草不是海藻（seaweed）；它们是真正的开花植物，有根、茎、叶，能开花结籽，在海底用根状茎固定泥沙。","鳗草草甸能减缓浪流、稳定海床、吸收部分营养盐，并为许多海洋生物提供育幼场，因此常被用作海岸环境质量的“指标”。"]}
{"word":"eelier","summary":{"en":"“Eelier” means “more eely”: more slippery or more long and sinuous like an eel.","zh":"“eelier”是“eely”的比较级，表示更滑溜或更细长蜿蜒、像鳗鱼一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(comparative of “eely”) more like an eel; especially more slippery, smooth, or hard to hold.","zh":"（“eely”的比较级）更像鳗鱼的；尤指更滑、更黏滑、更难抓住的。"},"examples":[{"en":"The river rocks were eelie r after the rain, so we walked slowly.","zh":"下雨后河边的石头更滑了，所以我们走得很慢。"},{"en":"He gave an eelie r answer, avoiding the real question.","zh":"他的回答更“滑头”，刻意回避了真正的问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"More long, thin, and snake-like in shape or movement.","zh":"形状或动作更细长、更像蛇一样蜿蜒的。"},"examples":[{"en":"The dancer’s arms looked eelie r in the dim light.","zh":"昏暗的灯光下，舞者的手臂看起来更细长柔软、带点“鳗鱼般”的感觉。"},{"en":"The fog moved in eelie r ribbons across the road.","zh":"雾像更蜿蜒的带子一样掠过马路。"}]}],"synonyms":["slipperier","slicker","more sinuous","more serpentine"],"phonetic":"/ˈiːliər/","extraExplanation":["“eelie r”更常见的拼写是“eelier”（两个 e + l + i + e + r）。","它来自形容词“eely”（像鳗鱼的、滑溜的）。在日常英语里不算高频，但在描写气氛、动作或“话很圆滑”的人时会用到，带有形象化的文学色彩。"]}
{"word":"eeliest","summary":{"en":"“Eeliest” means the most eel-like—especially very slippery or smooth.","zh":"“eeliest”表示“最像鳗鱼的”，尤其指非常滑溜、光滑难抓。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most like an eel; very slippery, smooth, or hard to hold onto (often used literally or humorously).","zh":"最像鳗鱼的；非常滑溜的、光滑难抓的（可用于字面或幽默表达）。"},"examples":[{"en":"The river stones were the eeliest thing I’ve ever stepped on—so slippery!","zh":"河里的石头是我踩过最“鳗鱼般滑溜”的东西——太滑了！"},{"en":"With all that lotion on his hands, he was at his eeliest.","zh":"他手上抹了那么多乳液，简直滑得像鳗鱼一样。"}]}],"synonyms":["slipperiest","slickest","smoothest","slimiest"],"phonetic":"/ˈiːliɪst/","extraExplanation":["“eeliest”是形容词“eely”的最高级（eely → eelier → eeliest），表示“最像鳗鱼的/最滑的”。日常英语中不算常见，多见于描写触感、幽默夸张或文学化表达。","如果你本来想查的是“earliest（最早的）”，那是另一个词：earliest /ˈɝːliəst/。可以告诉我你的句子，我能帮你确认。"]}
{"word":"eeling","summary":{"en":"“Feeling” most commonly means an emotion, but it can also mean physical sensation (touch) or describe someone/something as emotional and caring.","zh":"“Feeling”最常见意思是“情绪/感受”，也可指“触觉/身体感觉”，还可作形容词表示“富有感情的、体贴的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “feeling”) an emotion or a mental state, such as happiness, anger, or worry.","zh":"（可能想写的是 feeling）情绪；感觉；心理状态（如开心、愤怒、担心）。"},"examples":[{"en":"I have a bad feeling about this plan.","zh":"我对这个计划有种不好的预感。"},{"en":"Her feelings were hurt by his words.","zh":"他的话伤害了她的感情。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “feeling”) the sense of touch; a physical sensation.","zh":"（可能想写的是 feeling）触觉；（身体的）感觉。"},"examples":[{"en":"I’m losing feeling in my fingers because it’s so cold.","zh":"天气太冷了，我的手指快没知觉了。"},{"en":"I like the feeling of warm sunlight on my face.","zh":"我喜欢阳光暖暖照在脸上的感觉。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “feeling”) showing emotion; sympathetic and caring.","zh":"（可能想写的是 feeling）富有感情的；体贴的；有同情心的。"},"examples":[{"en":"She wrote a feeling letter to her parents.","zh":"她给父母写了一封充满感情的信。"},{"en":"He’s a feeling person and easily moved by stories.","zh":"他是个很感性的人，很容易被故事打动。"}]}],"synonyms":["emotion","sensation","touch","sentiment","impression","intuition"],"phonetic":"/ˈfiːlɪŋ/","extraExplanation":["你输入的“eeling”在英文里通常不是一个标准单词；最常见的情况是少了开头的字母 f，应该是“feeling”。","“feeling”来自动词“feel（感觉）”。在日常英语里，“feelings”常指“感情/情绪”（尤其是人与人之间的感受），而“a feeling”也常表示“预感/直觉”。"]}
{"word":"eelish","summary":{"en":"“Eelish” means eel-like—slippery, wriggling, or hard to grasp (often uncommon in modern use).","zh":"“eelish”指“像鳗鱼一样的”，常带“滑溜、扭动、难以捉摸”的感觉（现代用法较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Like an eel in appearance or behavior; slippery, wriggling, or hard to catch.","zh":"（不常用）像鳗鱼的；（行为上）滑溜、扭动、难以捉摸的。"},"examples":[{"en":"The eelish creature slipped through the rocks and vanished.","zh":"那只像鳗鱼一样的生物从岩石间滑过去，一下子就不见了。"},{"en":"He gave an eelish smile and avoided answering the question directly.","zh":"他露出一个滑头的笑容，回避了正面回答这个问题。"}]}],"synonyms":["slippery","sinuous","wriggly","eellike"],"phonetic":"/ˈiːlɪʃ/","extraExplanation":["“eelish”由“eel（鳗鱼）+ -ish（有点像……的）”构成，主要用于描写外形或给人“滑溜、难捉摸”的感觉。","它在现代英语里比较少见；日常更常用的说法有“slippery”“sinuous”“wriggly”。","注意不要和人名/姓氏“Eilish”（如歌手 Billie Eilish）混淆；那是专有名词，含义不同。"]}
{"word":"eellike","summary":{"en":"eel-like: resembling an eel—long, thin, and wriggling.","zh":"eel-like：像鳗鱼一样，细长并会扭动（常指外形或动作）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an eel in shape or movement; long, thin, and often slippery or wriggling.","zh":"像鳗鱼的；形状或动作像鳗鱼一样细长、滑溜、扭动的。"},"examples":[{"en":"An eel-like fish slipped through the rocks and disappeared.","zh":"一条像鳗鱼一样的鱼从岩石间滑过，转眼就不见了。"},{"en":"He made an eel-like twist to escape her grip.","zh":"他像鳗鱼一样扭了一下，挣脱了她的抓握。"}]}],"synonyms":["eelish","serpentine","snake-like","sinuous","wriggly"],"phonetic":"/ˈilˌlaɪk/","extraExplanation":["“eel-like”通常写作带连字符的形式（eel-like）。你输入的“eellike”多半是拼写或连写形式。","这个词常用于描写外形（细长、蛇形）或动作（扭动、滑脱）。有时也会带一点比喻意味，形容人“难以抓住、很会躲闪”。"]}
{"word":"eelpot","summary":{"en":"An eelpot is a pot-shaped trap used to catch eels.","zh":"eelpot 指用来捕捉鳗鱼的壶形陷阱（鳗鱼笼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pot-shaped trap used for catching eels (often set in rivers or coastal waters).","zh":"鳗鱼笼；捕鳗鱼的壶形陷阱（常放在河流或近海水域）。"},"examples":[{"en":"The fisherman checked his eelpot at dawn and found three eels inside.","zh":"渔夫黎明时查看鳗鱼笼，发现里面有三条鳗鱼。"},{"en":"Eelpots are usually baited and left in the water overnight.","zh":"鳗鱼笼通常会放饵料，然后在水里放一夜。"}]}],"synonyms":["eel trap","fish trap","eel pot"],"phonetic":"/ˈiːlˌpɑt/","extraExplanation":["“eelpot”多用于英式或较传统的渔业语境，也可写作“eel pot”。它属于一种“fish trap（鱼笼/鱼陷阱）”，常利用漏斗状入口让鳗鱼进得去、出不来。"]}
{"word":"eelpout","summary":{"en":"An eelpout is an eel-like fish, common in cold northern waters.","zh":"eelpout 指一种外形像鳗鱼、常见于寒冷北方水域的鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of fish with a long, eel-like body, usually living in cold northern seas (and sometimes in freshwater).","zh":"一种鱼，身体细长像鳗鱼，通常生活在寒冷的北方海域（有些也生活在淡水中）。"},"examples":[{"en":"The fishermen pulled an eelpout from the icy water.","zh":"渔民从冰冷的水里拉上来一条鳚鱼。"},{"en":"Eelpout have an eel-like shape but they are not true eels.","zh":"鳚鱼外形像鳗鱼，但并不是真正的鳗鱼。"}]}],"synonyms":["wolf eel (regional/common-name overlap)","eel-like fish"],"phonetic":"/ˈilˌpaʊt/","extraExplanation":["“eelpout”是一个常见名词，字面意思是“像鳗鱼的鱼”。在英语里它通常指“鳚科（Zoarcidae）”的一些鱼类（如海鳚、蛇鳚等），在北大西洋、北冰洋附近较常见。不同地区的“eelpout”可能指不同的近缘鱼种，因此如果是在科普或菜单语境里，最好结合拉丁学名或产地来确认。"]}
{"word":"eelpouts","summary":{"en":"Eelpouts are eel-shaped fish; “eelpouts” is the plural form.","zh":"eelpouts 是 eelpout 的复数，指外形像鳗鱼的鳚类鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Eelpouts: fish with long, eel-like bodies (the plural of eelpout). They are usually bottom-dwelling marine fish, often found in cold northern waters.","zh":"鳚（复数）：一种身体细长、像鳗鱼的鱼类（eelpout 的复数）。多为海洋底栖鱼，常见于寒冷的北方海域。"},"examples":[{"en":"Scientists studied eelpouts living near the Arctic seafloor.","zh":"科学家研究了生活在北极海底附近的鳚类。"},{"en":"Eelpouts can survive in very cold water better than many other fish.","zh":"鳚类比许多其他鱼更能在极冷的海水中生存。"}]},{"partOfSpeech":"n.","definition":{"en":"In everyday writing, “eelpouts” can also mean the meat or catch of these fish (especially in fishing or market contexts).","zh":"在日常用法中，“eelpouts”也可指这些鱼的渔获或鱼肉（尤其在捕鱼或市场语境中）。"},"examples":[{"en":"The boat came back with cod, haddock, and eelpouts.","zh":"渔船带回了鳕鱼、黑线鳕和鳚类渔获。"}]}],"synonyms":["eelpout (singular)","Zoarcids","eel-like fish"],"phonetic":"/ˈiːlˌpaʊt/","extraExplanation":["“eelpout”在英语里是合成词：eel（鳗鱼）+ pout（这里指一种鱼名/鱼类俗称），因为外形像鳗鱼而得名，并不表示它们真的是鳗鱼。","不同地区对“eelpout”的指代可能略有差异，但常见的是北方海域的鳚科（Zoarcidae）鱼类。"]}
{"word":"eels","summary":{"en":"Eels are long, snake-like fish; informally, an “eel” can mean someone who is slippery or hard to understand.","zh":"eels 指细长如蛇的鳗鱼；口语中也可比喻“难以捉摸、滑头的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Long, snake-like fish that live in the sea or in fresh water.","zh":"鳗鱼；一种细长如蛇的鱼类，生活在海水或淡水中。"},"examples":[{"en":"Eels can live in rivers, but many species migrate to the ocean to breed.","zh":"鳗鱼可以生活在河流里，但很多品种会迁徙到海洋中繁殖。"},{"en":"In Japanese cuisine, grilled eel is called unagi.","zh":"在日本料理中，烤鳗鱼叫作 unagi（鳗鱼饭常见食材）。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is hard to catch, understand, or deal with (informal).","zh":"（非正式）难以捉摸的人；难对付或难理解的人。"},"examples":[{"en":"He’s a bit of an eel—you never know what he’s really thinking.","zh":"他有点像“鳗鱼”一样难以捉摸——你永远不知道他在想什么。"}]}],"synonyms":["anguilliform fish","(informal) slippery person","(informal) elusive person"],"phonetic":"/il/","extraExplanation":["“eel”作“难以捉摸的人”的用法来自鳗鱼滑溜、难抓的形象联想，常用于口语或写作中的比喻。"]}
{"word":"eelshop","summary":{"en":"An eelshop is a place that sells eel, often as prepared food.","zh":"eelshop 指售卖鳗鱼（常为熟食）的店铺或小餐馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shop or small restaurant that sells eel (often cooked) and sometimes other seafood","zh":"卖鳗鱼（常为熟食）的小店或小餐馆；鳗鱼店"},"examples":[{"en":"We stopped at a small eel shop by the river for lunch.","zh":"我们在河边一家小鳗鱼店停下来吃午饭。"},{"en":"The eel shop is famous for grilled eel and rice.","zh":"这家鳗鱼店以烤鳗鱼饭出名。"}]}],"synonyms":["eel shop","seafood shop","fish shop"],"phonetic":"/ˈiːlˌʃɑp/","extraExplanation":["“eelshop”更常见的写法是分开写作“eel shop”。英语里很多“名词+名词”组合（如 coffee shop）既可以分开写，也可能逐渐合成一个词，具体取决于地区习惯、出版风格和是否被词典广泛收录。","鳗鱼店在一些饮食文化中很有代表性：例如日本常见“unagi”（烤鳗鱼），英国传统上也有售卖鳗鱼料理的小店。不同地区做法与口味差异很大。"]}
{"word":"eelskin","summary":{"en":"Eelskin is the skin or leather of an eel, often used to make soft, durable items like wallets and belts.","zh":"Eelskin 指鳗鱼的皮或鳗鱼皮革，常用来制作柔软耐用的皮具，如钱包和皮带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The skin (leather) made from an eel, known for being soft, smooth, and durable.","zh":"鳗鱼皮；用鳗鱼制成的皮革，以柔软、光滑且耐用著称。"},"examples":[{"en":"He bought an eelskin wallet because it felt smooth and strong.","zh":"他买了一个鳗鱼皮钱包，因为摸起来很光滑也很结实。"},{"en":"The shop sells belts made of eelskin leather.","zh":"那家店卖鳗鱼皮皮带。"}]}],"synonyms":["eel leather","leather"],"phonetic":"/ˈilˌskɪn/","extraExplanation":["“Eelskin”在日常英语里并不常见，多出现在服饰与皮具语境（如wallet、belt、boots）。在一些市场中会与“exotic leather（珍稀皮革）”一起被提到。购买相关产品时，英语里也常见“genuine eelskin（真鳗鱼皮）”等标注。"]}
{"word":"eelspear","summary":{"en":"An eelspear is a special spear used to catch eels.","zh":"eelspear 指专门用来叉捕鳗鱼的叉/矛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spear (often with several prongs) used for catching eels in shallow water or mud","zh":"鳗鱼叉；捕鳗用的多齿叉（常用于浅水或淤泥中）"},"examples":[{"en":"The fisherman waded into the stream with an eelspear at dusk.","zh":"渔夫黄昏时带着鳗鱼叉趟进小溪里。"},{"en":"In old photos, you can see villagers holding eelspears by the riverbank.","zh":"在老照片里，你能看到村民在河岸边拿着鳗鱼叉。"}]}],"synonyms":["eel spear","eel-fork","fish spear"],"phonetic":"/ˈilˌspɪr/","extraExplanation":["“eelspear”是比较少见、偏历史/民俗语境的词，多见于描写传统捕鱼方式的文章或地方史资料。通常指带多齿的长柄叉，用来在夜间或浅水、泥底处戳/叉鳗鱼。"]}
{"word":"eelware","summary":{"en":"Eelware is a rare word meaning gear or tools used for catching or handling eels.","zh":"Eelware是一个罕见词，指捕捉或处理鳗鱼的渔具/工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Equipment or gear used for catching or handling eels, such as eel traps or eel nets.","zh":"（罕见）用于捕捉或处理鳗鱼的器具/渔具，如鳗鱼笼、鳗网等。"},"examples":[{"en":"The fisherman checked his eelware at dawn and found three large eels in the trap.","zh":"渔夫清晨查看他的捕鳗器具，发现陷阱里有三条大鳗鱼。"},{"en":"In older records, “eelware” sometimes refers to the tools used along rivers for eel fishing.","zh":"在较早的文献记录中，“eelware”有时指河边捕鳗用的工具。"}]}],"synonyms":["eel trap","eel net","fishing gear","fishing tackle"],"phonetic":"/ˈiːlˌwɛr/","extraExplanation":["“eelware”是由“eel（鳗鱼）+ ware（器具/用品）”构成的复合词，但在现代英语中非常少见，更多会直接说eel trap（捕鳗笼）、eel net（鳗网）、fishing gear（渔具）等更常用的表达。","在英国及部分英语方言或旧文本里更可能见到该词，用来笼统指捕鳗相关用具，而不特指某一种器具。"]}
{"word":"eelworm","summary":{"en":"An eelworm is a tiny parasitic nematode, often a plant pest.","zh":"eelworm 指微小的寄生性线虫，常见为危害作物的害虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very small parasitic roundworm (a nematode), especially one that attacks plants such as onions, wheat, or potatoes.","zh":"鳗线虫；一种非常小的寄生性圆形线虫（线虫），尤指危害洋葱、小麦或马铃薯等作物的种类。"},"examples":[{"en":"Eelworms can damage crops by feeding on roots and bulbs.","zh":"鳗线虫会啃食根和鳞茎，从而破坏农作物。"},{"en":"The farmer tested the soil to check for eelworm infestation.","zh":"农民检测了土壤，以确认是否有鳗线虫侵染。"}]}],"synonyms":["nematode","roundworm","plant-parasitic nematode"],"phonetic":"/ˈiːlˌwɝːm/","extraExplanation":["“eelworm”是一个常见名，通常指多种会寄生植物或动物的线虫。它并不是“eel（鳗鱼）+ worm（虫）”真的长得像鳗鱼，而是因为某些线虫细长、会扭动，给人“像小鳗鱼一样”的印象。","在农业语境里，eelworm经常与作物病害、土壤消毒、轮作（crop rotation）等词一起出现。现代科学写作中也常用更具体的学名或统称“nematode（线虫）”，例如“potato cyst nematode（马铃薯胞囊线虫）”。"]}
{"word":"eelworms","summary":{"en":"Eelworms are tiny nematode worms, often plant pests that harm crops.","zh":"Eelworms 指细小的线虫，常为危害植物和农作物的害虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, threadlike roundworms (nematodes), especially ones that live in soil or plants and can damage crops.","zh":"细小的线状圆虫（线虫），尤指生活在土壤或植物中、会危害农作物的线虫。"},"examples":[{"en":"Farmers treated the soil to reduce eelworms that were attacking the potato crop.","zh":"农民处理土壤以减少正在侵害马铃薯作物的线虫（eelworms）。"},{"en":"The lab found eelworms in the roots, which explained the plant’s weak growth.","zh":"实验室在根部发现了线虫，这解释了植物长势不良的原因。"}]}],"synonyms":["nematodes","roundworms","plant-parasitic nematodes"],"phonetic":"/ˈiːlˌwɝːmz/","extraExplanation":["“eelworm”是比较传统/英式的常用叫法，在农业与园艺语境中常指植物寄生线虫（plant-parasitic nematodes），例如影响马铃薯、甜菜、洋葱等作物的种类。现代更通用的科学/技术说法通常是“nematodes（线虫）”，更具体可说“plant-parasitic nematodes（植物寄生线虫）”。","之所以叫“eelworm”，是因为它们形状细长、会扭动，看起来有点像小鳗鱼（eel），但它们并不是鳗鱼，也不是昆虫。"]}
{"word":"eely","summary":{"en":"“Eely” means eel-like: slippery, wriggly, or (figuratively) evasive and hard to pin down.","zh":"“Eely”表示“像鳗鱼一样”：滑溜、扭动，或（比喻）狡猾回避、难以捉摸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like an eel; long, slippery, and often hard to hold or catch (used literally or figuratively).","zh":"像鳗鱼的；细长、滑溜、难以抓住的（可作字面或比喻用法）。"},"examples":[{"en":"The fish felt eely in my hands and slipped back into the water.","zh":"那条鱼在我手里滑溜溜的，一下子又滑回水里了。"},{"en":"He gave an eely answer that avoided the real question.","zh":"他给了一个滑头的回答，回避了真正的问题。"}]}],"synonyms":["slippery","wriggly","sinuous","eel-like","evasive"],"phonetic":"/ˈiːli/","extraExplanation":["“eely”来自名词“eel（鳗鱼）+ -y”，表示“具有……特征的”。在写作里常用来形容触感（滑、黏）或人的态度/回答（狡猾、难以捉摸）。"]}
{"word":"EEM","summary":{"en":"EEM is most commonly the ticker symbol for an emerging-markets ETF; it can also be a general abbreviation for emerging markets or, in technical contexts, electromagnetic emissions.","zh":"EEM 最常见是新兴市场 ETF 的股票代码；也可泛指新兴市场/新兴股市，或在技术语境中指电磁辐射（电磁发射）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(finance) A U.S. stock ticker symbol for the iShares MSCI Emerging Markets ETF, an exchange-traded fund that tracks a broad index of emerging-market stocks.","zh":"（金融）美国股市代码，指 iShares MSCI Emerging Markets ETF（新兴市场指数基金），一种跟踪新兴市场股票指数的交易型开放式指数基金。"},"examples":[{"en":"I bought EEM to get diversified exposure to emerging markets.","zh":"我买了 EEM 来分散配置、获得新兴市场的整体敞口。"},{"en":"EEM fell today as emerging-market currencies weakened.","zh":"由于新兴市场货币走弱，EEM 今天下跌了。"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation people use for “emerging markets” or “emerging equity markets,” depending on context.","zh":"（通用）在不同语境下可作为“新兴市场”或“新兴股市（股票市场）”的缩写。"},"examples":[{"en":"The report compares developed markets with EEM performance.","zh":"这份报告比较了发达市场与 EEM（新兴市场/新兴股市）的表现。"},{"en":"Our strategy increases EEM allocation during global recoveries.","zh":"在全球复苏阶段，我们的策略会提高 EEM（新兴市场）的配置比例。"}]},{"partOfSpeech":"other","definition":{"en":"(technical) An abbreviation for “electromagnetic emissions” in engineering or security contexts.","zh":"（技术）在工程或信息安全语境中，可指“电磁辐射/电磁发射（electromagnetic emissions）”。"},"examples":[{"en":"The lab tested the device’s EEM to meet safety standards.","zh":"实验室测试了设备的 EEM（电磁辐射）以满足安全标准。"}]}],"synonyms":["emerging markets","EM","emerging-market ETF"],"phonetic":"/ˌiː iː ˈɛm/","extraExplanation":["在投资语境里，EEM 最常见是一个 ETF 的“代码（ticker）”，不是普通单词；读法通常按字母读：E-E-M。","因为同一个缩写在不同领域可能代表不同含义（金融/技术等），理解时要看上下文：比如是否在谈股票、ETF、指数或工程测试。"]}
{"word":"eemis","summary":{"en":"“eemis” isn’t a standard word; it most likely means “Emmys,” the U.S. TV awards.","zh":"“eemis”不是标准英文词；很可能指“Emmys”（艾美奖，美国电视奖项）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “Emmys,” the nickname for the Emmy Awards (U.S. television awards).","zh":"不是标准英语单词；很可能是把 “Emmys”（艾美奖，美国电视界奖项的俗称）拼错了。"},"examples":[{"en":"Did you mean the Emmys? The ceremony honors excellence in television.","zh":"你是想说 Emmys（艾美奖）吗？这个颁奖典礼表彰电视领域的卓越成就。"},{"en":"She watched the Emmys to see who won Best Drama Series.","zh":"她看艾美奖是为了看看谁拿了最佳剧情类剧集。"}]},{"partOfSpeech":"n.","definition":{"en":"Emmys (plural noun): the Emmy Awards, annual awards recognizing achievements in American television (including Primetime, Daytime, etc.).","zh":"Emmys（复数名词）：Emmy Awards（艾美奖），每年颁发，用于表彰美国电视行业的成就（包括黄金时段、日间等类别）。"},"examples":[{"en":"The show earned three Emmys last year.","zh":"这档节目去年获得了三项艾美奖。"},{"en":"He was nominated for an Emmy for his supporting role.","zh":"他因配角表演获得艾美奖提名。"},{"en":"Many actors mention the Emmys alongside the Oscars and Grammys.","zh":"许多演员会把艾美奖与奥斯卡和格莱美并列提及。"}]}],"synonyms":["Emmy Awards"],"phonetic":"/ˈɛmiz/","extraExplanation":["“Emmy”一词常被认为与早期电视摄像管（image orthicon）的昵称“Immy”有关，后来演变为“Emmy”。\n\n常见搭配：win an Emmy（赢得艾美奖）、be nominated for an Emmy（获得艾美奖提名）、the Emmys ceremony（艾美奖颁奖礼）。"]}
{"word":"een","summary":{"en":"“een” is usually seen as the abbreviation EEN (Enterprise Europe Network). As a lowercase word, it can appear in Scots/dialect writing meaning “one,” but it’s not standard English.","zh":"“een”最常见是缩写 **EEN**（欧洲企业网络）。作为小写词，它也可能在苏格兰英语/方言写作中表示“one（一个）”，但不属于标准英语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Enterprise Europe Network: an EU-supported network that helps businesses innovate, grow internationally, and find partners.","zh":"（缩写）Enterprise Europe Network（欧洲企业网络）：欧盟支持的服务网络，帮助企业创新、走向国际、寻找合作伙伴。"},"examples":[{"en":"Our startup contacted the EEN to look for partners in Germany.","zh":"我们的初创公司联系了 EEN，想在德国寻找合作伙伴。"},{"en":"The EEN office offered advice on exporting and EU regulations.","zh":"EEN 办公室提供了关于出口和欧盟法规的建议。"}]},{"partOfSpeech":"num.","definition":{"en":"(dialect/Scots) “one”; a non‑standard spelling used in some regional writing, not common in modern standard English.","zh":"（方言/苏格兰英语）“one（一个）”；一种非标准拼写，见于部分地区性写作，在现代标准英语中不常用。"},"examples":[{"en":"In some Scots writing, you may see “een” meaning “one.”","zh":"在一些苏格兰英语的写作里，你可能会看到 “een” 表示 “one（一个）”。"}]}],"synonyms":["Enterprise Europe Network","one (dialect)"],"phonetic":"/iːn/","extraExplanation":["“een”作为普通英语单词并不常见。很多时候它可能是拼写错误（例如把 **been/seen** 打错），也可能是特定领域的缩写（如 **EEN**）。如果你告诉我上下文句子，我可以帮你判断具体意思。"]}
{"word":"EEO","summary":{"en":"EEO means “Equal Employment Opportunity,” referring to fair, non-discriminatory hiring and workplace practices.","zh":"EEO指“平等就业机会”，强调招聘与职场中的公平与反歧视。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Equal Employment Opportunity; the principle and related laws/policies that require fair treatment in hiring and the workplace and prohibit discrimination (especially in the U.S.).","zh":"平等就业机会；指在招聘与职场中必须公平对待、禁止歧视的原则及相关法律/政策（尤其在美国语境中）。"},"examples":[{"en":"Our company is an EEO employer and does not discriminate based on race, sex, or religion.","zh":"我们公司遵守EEO（平等就业机会）原则，不会因种族、性别或宗教而歧视。"},{"en":"The job posting includes an EEO statement at the bottom.","zh":"这份招聘信息在底部包含了EEO声明。"},{"en":"Employees can report EEO concerns to HR.","zh":"员工可以把EEO相关的担忧/问题向人力资源部门反映。"}]}],"synonyms":["equal opportunity","anti-discrimination policy","non-discrimination"],"phonetic":"ˌiː iː ˈoʊ","extraExplanation":["EEO常见于美国职场与招聘文件（如“EEO statement”）。它与反歧视相关，常涉及受保护特征（protected characteristics），例如种族、肤色、宗教、性别（含怀孕、性取向、性别认同）、国籍、年龄、残障、遗传信息等。","在美国，EEO也可能指政府机构“EEOC”（Equal Employment Opportunity Commission，平等就业机会委员会）所执行的相关法律与投诉程序；但EEO是原则/政策称呼，EEOC是具体机构名称。"]}
{"word":"EEOB","summary":{"en":"EEOB is an uncommon initialism; its meaning depends on context.","zh":"EEOB 是不常见的首字母缩写，含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard abbreviation/initialism. It is not a widely recognized fixed meaning in general English, so its meaning depends on the specific context (e.g., a company, school, online community, or technical field).","zh":"一种非标准缩写/首字母词。它在一般英语里没有公认的固定含义，具体意思取决于使用语境（如公司、学校、网络社群或专业领域）。"},"examples":[{"en":"What does EEOB stand for in this email?","zh":"这封邮件里的 EEOB 是什么的缩写？"},{"en":"EEOB isn’t a common abbreviation, so I need more context to interpret it.","zh":"EEOB 不是常见缩写，所以我需要更多上下文才能理解。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌiː iː oʊ ˈbiː/","extraExplanation":["英语里的大写缩写常见两类：acronym（可当作一个词读，如 NASA）与 initialism（按字母逐个读，如 FBI）。EEOB 更像 initialism，通常读作“E-E-O-B”。","遇到不常见缩写，最可靠的方法是：查看首次出现处是否有括号解释（例如 “EEOB (… )”）、在同一文档/群组里搜索它的全称、或直接询问对方“EEOB stands for what?”。如果你把它出现的完整句子发我，我可以更准确判断。"]}
{"word":"EEOC","summary":{"en":"EEOC = the U.S. Equal Employment Opportunity Commission, which investigates and enforces workplace anti-discrimination laws.","zh":"EEOC指美国平等就业机会委员会，负责调查并执行职场反歧视相关法律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) The Equal Employment Opportunity Commission, the federal agency that enforces laws against workplace discrimination.","zh":"（美国）平等就业机会委员会：负责执行反就业歧视法律的联邦机构。"},"examples":[{"en":"She filed a complaint with the EEOC after repeated harassment at work.","zh":"在工作中遭遇反复骚扰后，她向EEOC提出了投诉。"},{"en":"The company must respond to the EEOC’s request for documents.","zh":"该公司必须回应EEOC对文件的要求。"}]},{"partOfSpeech":"n.","definition":{"en":"A process or case involving the EEOC (used informally in workplaces).","zh":"（非正式用法）指与EEOC相关的流程或案件。"},"examples":[{"en":"HR is handling an EEOC matter right now.","zh":"人力资源部门正在处理一件EEOC相关的事。"},{"en":"They settled the EEOC case before it went to court.","zh":"他们在案件进入法庭前就和解了这起EEOC案件。"}]}],"synonyms":["Equal Employment Opportunity Commission","U.S. employment discrimination agency"],"phonetic":"/ˌiː iː oʊ ˈsiː/","extraExplanation":["EEOC常处理的“受保护特征”包括：种族、肤色、宗教、性别（含怀孕、性取向、性别认同）、国籍、年龄（通常指40岁及以上）、残疾、遗传信息等。","很多情况下，个人起诉雇主前需要先向EEOC提交指控（charge），之后可能会拿到“Right-to-Sue letter（起诉权通知）”。","读写时通常逐个字母念：E-E-O-C。它不是普通单词，而是美国特定机构缩写，在其他国家可能没有对应机构或职能不同。"]}
{"word":"eep","summary":{"en":"“Eep” is an informal squeak-like exclamation of surprise or fear (and rarely a verb meaning “to squeak”).","zh":"“eep”是表示惊讶或害怕的（非正式）小尖叫声，少见时也可作动词表示“吱吱叫/轻轻尖叫”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(informal) Used as a small squeak to show surprise, fear, or mild embarrassment; similar to “eek!”","zh":"（非正式）表示惊讶、害怕或一点点尴尬的小尖叫声；类似“eek!”。"},"examples":[{"en":"Eep! I didn’t see you there.","zh":"Eep！我没看到你在那儿。"},{"en":"Eep—sorry, I didn’t mean to interrupt.","zh":"Eep——抱歉，我不是故意打断的。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, informal) To make a small squeaking sound; to let out a tiny squeal.","zh":"（少见，非正式）发出细小的吱吱声；轻轻尖叫一声。"},"examples":[{"en":"The mouse eeped and ran under the table.","zh":"老鼠吱地叫了一声，跑到桌子底下。"},{"en":"She eeped when the cold water touched her hand.","zh":"冷水碰到她的手时，她轻轻尖叫了一声。"}]}],"synonyms":["eek","yelp","squeak","eep! (interjection)"],"phonetic":"/iːp/","extraExplanation":["“eep”常见于漫画、小说对白、字幕或网络聊天里，用来表示声音很小、很短的惊叫，比“scream”更轻；语气上也常带一点可爱、窘迫或被吓到的感觉。","拼写上与“eek”很接近：一般来说“eek!”更常见、更标准；“eep!”更像拟声词，强调短促、细小的声音。"]}
{"word":"EEPROM","summary":{"en":"EEPROM is non-volatile memory that can be electrically erased and rewritten.","zh":"EEPROM 是一种断电不丢数据、可用电方式擦除并重写的存储器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Electrically Erasable Programmable Read-Only Memory: a type of computer memory chip that keeps stored data even when power is off, and can be erased and rewritten using electricity.","zh":"电可擦可编程只读存储器：一种计算机存储芯片，即使断电也能保存数据，并且可以用电信号擦除与重新写入。"},"examples":[{"en":"The device stores calibration settings in EEPROM, so they aren’t lost when the battery is removed.","zh":"设备把校准设置存到 EEPROM 里，所以即使拆下电池也不会丢失。"},{"en":"Unlike ROM, EEPROM can be updated without replacing the chip.","zh":"不同于 ROM，EEPROM 可以更新数据而不必更换芯片。"}]}],"synonyms":["electrically erasable programmable read-only memory","non-volatile memory","NVM"],"phonetic":"/ˈiːiːˌpiːˌɑːrˌoʊˌɛm/","extraExplanation":["EEPROM 常用于保存少量但重要、需要长期保留的数据，例如设备序列号、配置参数（configuration）、BIOS/UEFI 的部分设置等。","与 Flash（闪存）相比：两者都属于非易失性存储（断电不丢数据）。一般来说，Flash 更适合大容量、按“块”擦写；EEPROM 常用于较小容量、可按“字节”或更细粒度更新的场景（具体取决于芯片）。","常见读法是把字母拼读：E-E-P-R-O-M（“ee-ee-pee-are-oh-em”）。"]}
{"word":"eequinoctium","summary":{"en":"Equinoctium is a rare term meaning the equinox, when day and night are nearly the same length.","zh":"Equinoctium 是较少见的词，意思是春分或秋分，即昼夜时长几乎相等的时刻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) The equinox: either of the two times each year when day and night are nearly equal in length (around March and September).","zh":"（少见/较专业）昼夜平分点/春分或秋分：一年中两次白天与黑夜时长几乎相等的时刻（约在三月与九月）。"},"examples":[{"en":"Many cultures mark the spring equinoctium with festivals celebrating new life.","zh":"许多文化会用庆典来纪念春分（春季昼夜平分点），庆祝新生命的开始。"},{"en":"Astronomers can calculate the exact moment of the equinoctium for a given year.","zh":"天文学家可以计算出某一年昼夜平分点发生的精确时刻。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) The celestial “equinoctial” point or the equinoctial line/circle, used in older astronomical writing to describe where the Sun crosses the celestial equator.","zh":"（历史用法）天球上的“分点”或“分圈/赤道圈”相关概念：旧式天文学写作中用于描述太阳穿过天球赤道的位置/线。"},"examples":[{"en":"Older texts may discuss the Sun’s position relative to the equinoctium when describing seasons.","zh":"一些旧文献在描述季节时，会谈到太阳相对于“分点/分圈”的位置。"}]}],"synonyms":["equinox","vernal equinox","autumnal equinox"],"phonetic":"/ˌiːkwəˈnɑːkʃəm/","extraExplanation":["你输入的“eequinoctium”很可能是拼写错误；常见词是 **equinox**（春分/秋分）。**equinoctium** 属于较少见或较旧的用词，意思基本同 equinox。","词源提示：来自拉丁语 *aequinoctium*（字面是“相等的夜晚”），对应“昼夜几乎相等”的概念。","学习建议：日常英语更常用 **equinox**；在科普/天文语境偶尔会看到 **vernal equinox**（春分）与 **autumnal equinox**（秋分）。"]}
{"word":"eer","summary":{"en":"“eer” (usually written “e’er”) means “ever” in poetic or old-fashioned English.","zh":"“eer”（常写作“e’er”）是诗歌或较古典英语中“ever（曾经/一直/永远）”的缩写。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(poetic) A shortened form of “ever,” used especially in older poetry, songs, and hymns.","zh":"（诗歌用语）“ever”的缩写形式，常见于较古典的诗歌、歌曲与赞美诗中。"},"examples":[{"en":"I will love you e’er and always.","zh":"我将永远爱你。"},{"en":"E’er since that day, he has kept his promise.","zh":"从那天起，他就一直遵守诺言。"},{"en":"The poem repeats “e’er” to create a musical rhythm.","zh":"这首诗反复使用“e’er”，营造音乐般的节奏。"}]}],"synonyms":["ever"],"phonetic":"/ɛr/","extraExplanation":["“e’er”通常写作带省略号的形式：e’er（表示省略了v）。它主要出现在文学/抒情语境里，日常英语几乎不用；现代写作一般直接用“ever”。","在经典作品与歌词中很常见，例如诗句“E’er”常用来配合格律与押韵；很多传统圣诗（hymns）也会用到。"]}
{"word":"eerie","summary":{"en":"Eerie means strangely unsettling or spooky, often in a quiet, mysterious way.","zh":"Eerie 指安静神秘却让人不安、阴森诡异的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strange and frightening in a quiet, mysterious way; giving you an uneasy feeling.","zh":"（安静、神秘地）怪异而令人害怕的；让人感到不安的。"},"examples":[{"en":"The abandoned house looked eerie at night.","zh":"那栋废弃的房子在夜里看起来很阴森。"},{"en":"An eerie silence filled the room after the lights went out.","zh":"灯灭后，房间里充满了诡异的寂静。"},{"en":"She heard an eerie sound coming from the woods.","zh":"她听到树林里传来一阵怪异的声音。"}]}],"synonyms":["spooky","uncanny","creepy","haunting","weird"],"phonetic":"/ˈɪri/","extraExplanation":["“eerie”常用来形容一种“安静却让人背脊发凉”的氛围，不一定真的有危险，但会让人感觉不对劲。常和silence（寂静）、glow（微光）、fog（雾）、abandoned（废弃的）、whisper（低语）等词搭配。","和“scary”相比，“eerie”更偏向“诡异/阴森的感觉”；“scary”更直接表示“吓人”。和“creepy”相比，“eerie”通常更强调环境氛围，“creepy”更常形容人或行为让人起鸡皮疙瘩。","文学与影视中常见用法：如“an eerie silence”“an eerie light”，用来营造悬疑、惊悚或超自然的气氛。"]}
{"word":"eerieily","summary":{"en":"“Eerily” means “in a strange, unsettling, mysterious way.”","zh":"“Eerily”表示“以一种诡异、令人不安、神秘的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a strange, scary, or mysterious way; making you feel that something is not quite right.","zh":"以诡异、令人不安或神秘的方式；让人觉得哪里不对劲。"},"examples":[{"en":"The hallway was eerily quiet at night.","zh":"晚上走廊安静得有些诡异。"},{"en":"She smiled eerily, and no one knew what she was thinking.","zh":"她露出诡异的微笑，没人知道她在想什么。"},{"en":"The old house stood eerily still in the fog.","zh":"那栋老房子在雾中静得诡异。"}]}],"synonyms":["uncannily","strangely","spookily","creepily"],"phonetic":"/ˈɪrəli/","extraExplanation":["你输入的“eerieily”常见拼写错误，正确拼写是“eerily”（eerie + -ly）。","“eerily”通常用来形容气氛（quiet, still, calm）在不正常的安静中带有不祥或神秘感；比起“quietly”（单纯安静）更强调“让人发毛/不对劲”的感觉。"]}
{"word":"eerier","summary":{"en":"“Eerier” is the comparative form of “eerie,” meaning more strange, spooky, or unsettling.","zh":"“eerier”是“eerie”的比较级，表示“更诡异/更阴森/更令人不安”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More eerie; feeling stranger, spookier, or more unsettling (often in a mysterious or supernatural way).","zh":"更诡异的；更阴森/更令人不安的（常带神秘或超自然的感觉）。"},"examples":[{"en":"The forest felt eerier after the fog rolled in.","zh":"起雾之后，森林感觉更阴森了。"},{"en":"It got eerier when the lights suddenly went out.","zh":"灯突然熄灭时，气氛变得更诡异了。"},{"en":"His voice sounded eerier in the empty hallway.","zh":"在空荡的走廊里，他的声音听起来更瘆人。"}]}],"synonyms":["spookier","creepier","stranger","more unsettling"],"phonetic":"/ˈɪriər/","extraExplanation":["“eerier”是形容词“eerie”的比较级，用来做两者比较（A is eerier than B）或表示“更……一些”。最高级是“eeriest”（最诡异的/最阴森的）。","拼写提示：因为“eerie”以不发音的e结尾，变比较级时通常去掉一个e再加 -er → eerie → eerier；同理最高级是 eeriest。","语感区别：eerie多指“让人背脊发凉的诡异氛围”（安静、空旷、雾、旧屋、怪声等），不等同于horrible（可怕/糟糕）或scary（吓人）。更接近“creepy / spooky”但eerie更强调“神秘、反常的气氛”。"]}
{"word":"eeriest","summary":{"en":"“Eeriest” means “the most eerie”—the most mysteriously creepy or unsettling.","zh":"“eeriest”表示“最诡异/最阴森的”，强调神秘、令人不安的恐怖氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “eerie”: the most strange and frightening in a mysterious, unsettling way.","zh":"“eerie”的最高级：最诡异、最令人不安（带神秘恐怖感）的。"},"examples":[{"en":"That was the eeriest sound I’ve ever heard in the dark.","zh":"那是我在黑暗中听过最诡异的声音。"},{"en":"The abandoned house on the hill is the eeriest place in town.","zh":"山上的那栋废弃房子是镇上最阴森的地方。"}]}],"synonyms":["creepiest","spookiest","most unsettling","most uncanny"],"phonetic":"/ˈɪriəst/","extraExplanation":["在英语里，eerie 常用来形容“安静得反常、让人起鸡皮疙瘩的氛围”，比 scary（吓人）更强调“神秘、说不清原因的恐怖感”。","拼写提示：eeriest 来自 eerie + -est；eerie 以 -ie 结尾，加 -est 时通常直接加（eerie → eeriest）。","常见搭配：the eeriest silence（最诡异的寂静）、an eerie feeling（诡异的感觉）、eerie glow（幽光）。"]}
{"word":"eerily","summary":{"en":"“Eerily” means “in a strange, spooky, unsettling way,” often describing an unusual silence or atmosphere.","zh":"“eerily”表示“诡异地、阴森地、令人不安地”，常用来形容反常的安静或氛围。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a strange, unsettling, or spooky way; in a manner that makes you feel nervous because it is unusual or too quiet.","zh":"以一种诡异、令人不安或阴森的方式；因为异常或过于安静而让人感到紧张。"},"examples":[{"en":"The street was eerily quiet after the storm.","zh":"暴风雨过后，街道安静得有点瘆人。"},{"en":"She smiled eerily, and no one knew why.","zh":"她诡异地笑了笑，没人知道为什么。"},{"en":"The movie’s music made the scene feel eerily real.","zh":"电影的配乐让那一幕显得诡异地真实。"}]}],"synonyms":["strangely","spookily","uncannily","creepily","oddly"],"phonetic":"/ˈɪrəli/","extraExplanation":["“eerily”来自形容词“eerie（阴森的、诡异的）”，常用来形容“安静得不正常”“气氛怪怪的”。它不一定真的有鬼，更多是强调一种让人不舒服的感觉。","常见搭配：eerily quiet（诡异地安静）、eerily similar（惊人地相似，带点不安）、eerily calm（反常的平静）。"]}
{"word":"eeriness","summary":{"en":"Eeriness means a strange, unsettling atmosphere or feeling.","zh":"Eeriness 指一种诡异、令人不安的氛围或感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strange, unsettling feeling—often because something seems mysterious, quiet, or not quite normal.","zh":"一种诡异、令人不安的感觉——常因事物显得神秘、安静或“不太对劲”。"},"examples":[{"en":"The empty hallway at night had an eerie eeriness to it.","zh":"夜里的空走廊带着一种诡异的不安感。"},{"en":"The film creates eeriness through silence and shadow.","zh":"这部电影通过寂静和阴影营造出诡异感。"}]}],"synonyms":["uncanniness","spookiness","creepiness","strangeness"],"phonetic":"/ˈɪrinas/","extraExplanation":["“eeriness”来自形容词“eerie（诡异的、阴森的）”，再加名词后缀“-ness”。常见搭配有：the eeriness of + 地方/场景（某地的诡异感）、a sense of eeriness（诡异感）。","“eerie”在英语里常和超自然、荒凉、寂静、雾、废弃建筑等意象连用；语气比“scary（恐怖的）”更偏“怪、阴森、令人发毛”，不一定有直接危险。"]}
{"word":"eerinesses","summary":{"en":"“Eerinesses” means multiple kinds or instances of eeriness—an uncanny, spooky, unsettling feeling.","zh":"“eerinesses”指“诡异感/阴森感”的复数，用来强调多种或多处令人不安的氛围或感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “eeriness”: the quality or feeling of being strange, spooky, or unsettling; also, different instances or kinds of that unsettling feeling.","zh":"“eeriness”的复数：诡异、阴森、令人不安的感觉；也可指不同的“诡异感/阴森感”的表现或类型。"},"examples":[{"en":"The abandoned house had several eerinesses: the silence, the cold air, and the old photos on the wall.","zh":"那栋废弃的房子有好几种诡异之处：寂静、冷空气，以及墙上的旧照片。"},{"en":"The film’s eerinesses come from simple things, like shadows and slow footsteps.","zh":"这部电影的阴森感来自一些简单的东西，比如影子和缓慢的脚步声。"}]}],"synonyms":["uncanninesses","spookinesses","creepinesses","unsettling feelings"],"phonetic":"ˈɪrɪnəsɪz","extraExplanation":["“eerie”常用来形容让人起鸡皮疙瘩的“怪”“阴森”“不祥”的气氛；“eeriness”是名词形式。日常写作里更常见的是不可数用法（the eeriness of the forest），复数“eerinesses”较少见，多用于强调“多种/多处诡异感”。"]}
{"word":"eerisome","summary":{"en":"Eerisome means eerie, strange, and unsettling—spooky in a quiet, mysterious way.","zh":"Eerisome表示“诡异、令人不安、阴森”的感觉，带有安静神秘的恐怖氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strange and unsettling; spooky or fearfully mysterious (similar to “eerie”).","zh":"怪异而令人不安的；阴森可怕的（类似“eerie”）。"},"examples":[{"en":"The abandoned house looked eerisome in the fog.","zh":"那栋废弃的房子在雾里看起来阴森可怕。"},{"en":"There was an eerisome silence after the lights went out.","zh":"灯灭之后出现了一种令人不安的诡异寂静。"},{"en":"She told an eerisome story about footsteps in an empty hallway.","zh":"她讲了一个关于空走廊里脚步声的阴森故事。"}]}],"synonyms":["eerie","creepy","spooky","uncanny","haunting"],"phonetic":"/ˈɪrɪsəm/","extraExplanation":["“eerisome”是较少见、带一点文学色彩的词，常见于苏格兰英语（Scots）或较老的英文写作中。日常口语里更常用“eerie / creepy / spooky”。","词尾“-some”在这里表示“具有……性质/倾向”，所以“eerisome”可以理解为“带着诡异气氛的”。"]}
{"word":"eerock","summary":{"en":"“eerock” is usually a nickname/handle (often “E-rock”), and sometimes a casual term for electronic rock music.","zh":"“eerock”通常是昵称/网名（常写作“E-rock”），有时也指电子摇滚音乐的口语简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname or online handle (often written “E-rock”), usually meaning “E + rock,” suggesting someone who is energetic, “rocking,” or connected to rock music.","zh":"昵称或网名（常写作“E-rock”），通常表示“E + rock”，暗示这个人很有活力、很酷/很会带气氛，或与摇滚音乐有关。"},"examples":[{"en":"His username is Erock on most platforms.","zh":"他在大多数平台上的用户名是 Erock。"},{"en":"People call him E-rock because he plays in a rock band.","zh":"大家叫他 E-rock，因为他在摇滚乐队里演出。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) electronic rock; a casual shortened form sometimes used online for rock music with electronic elements.","zh":"（音乐）电子摇滚；有时在网络上把带电子元素的摇滚乐简称为 E-rock。"},"examples":[{"en":"I’ve been listening to E-rock mixes while studying.","zh":"我学习时一直在听电子摇滚混音。"},{"en":"This track is basically E-rock—guitars with synths.","zh":"这首歌基本就是电子摇滚——吉他加合成器。"}]}],"synonyms":["nickname","handle","screen name","electronic rock"],"phonetic":"/ˈiː rɑk/","extraExplanation":["“eerock / Erock / E-rock”并不是标准词典里常见的英语单词，更常见于昵称、艺名、账号名或小圈子用法。大小写和连字符会影响读法与理解：写作“E-rock”时更容易让人理解为“E + rock（电子/酷/摇滚）”。如果你是在某个特定句子或语境里看到它，可以把原句发来，我可以帮你更准确判断意思。"]}
{"word":"Eerotema","summary":{"en":"An erotema is a rhetorical question used for emphasis, not to get a real answer.","zh":"erotema 指“反问/修辞性疑问句”，用于强调观点而非真正求答。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rhetorical question—asked for effect or emphasis rather than to get an actual answer","zh":"反问（修辞性疑问句）：提出问题是为了强调或表达情绪，而不是为了真正得到答案"},"examples":[{"en":"“Who could forget a day like that?” is an erotema used to emphasize how memorable it was.","zh":"“谁会忘记那样的一天？”是一个反问，用来强调那一天有多么难忘。"},{"en":"The speaker used erotema to challenge the audience: “Do we really want to live this way?”","zh":"演讲者用反问来质问听众：“我们真的想这样生活吗？”},{"}]}],"synonyms":["rhetorical question","erotesis"],"phonetic":"/ˌɛrəˈtiːmə/","extraExplanation":["“Eerotema”更常见的拼写是 **erotema**（有时也写作 *erotesis*）。它来自希腊语 *erōtēma*，意思是“问题/询问”。在英语修辞学里，它指“问而不答”的提问方式，用来加强语气、表达态度或引导读者思考。","在写作中，反问常带有强烈的立场或情绪：惊讶、愤怒、讽刺、鼓励等。用得好会很有力量，但用太多可能显得咄咄逼人或像在说教。"]}
{"word":"eery","summary":{"en":"“Eery” is usually a misspelling of “eerie,” meaning strangely frightening or unsettling.","zh":"“eery”通常是“eerie”的拼写错误，意思是“诡异、令人不安的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly a misspelling) strange and frightening in a mysterious way; causing an uneasy feeling.","zh":"（常见拼写错误）诡异的；神秘而令人不安或害怕的。"},"examples":[{"en":"The empty hallway was eery at night.","zh":"夜里那条空荡荡的走廊很诡异。"},{"en":"There was an eery silence after the power went out.","zh":"停电后出现了一阵令人不安的寂静。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) related to or characteristic of Ireland (Éire).","zh":"（罕见）与爱尔兰（Éire）有关的；具有爱尔兰特色的。"},"examples":[{"en":"Some older texts use “Eery” to mean “Irish,” but it’s uncommon today.","zh":"一些较早的文本里会用“Eery”表示“爱尔兰的”，但现在很少见。"}]}],"synonyms":["eerie","creepy","spooky","unnerving","sinister"],"phonetic":"/ˈɪri/","extraExplanation":["“eery”在现代英语里最常见的情况是把“eerie”拼错了。标准拼写是“eerie”。","“eerie”常用于描写氛围（eerie silence/feeling/light）、地点（an eerie house）、或场景（an eerie calm），带有“怪得让人心里发毛”的感觉。"]}
{"word":"eesome","summary":{"en":"“eesome” isn’t standard; it’s probably “awesome,” meaning “excellent” (informal) or “awe-inspiring” (more formal).","zh":"“eesome” 不是标准拼写；多半是 “awesome”，可表示“很棒”（口语）或“令人敬畏/壮观”（较正式）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“eesome” is not a standard English word; it is most likely a misspelling of “awesome.”","zh":"“eesome” 不是标准英文单词；很可能是把 “awesome” 拼错了。"},"examples":[{"en":"I think you meant “awesome.”","zh":"我觉得你想写的是 “awesome”。"},{"en":"That movie was awesome.","zh":"那部电影太棒了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very good; impressive; excellent (informal).","zh":"非常好；令人印象深刻；很棒（非正式用法）。"},"examples":[{"en":"You did an awesome job on the presentation.","zh":"你的演讲做得太棒了。"},{"en":"She has an awesome singing voice.","zh":"她的歌声非常惊艳。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing wonder, respect, or fear because something feels very large, powerful, or majestic (more formal/older use).","zh":"因巨大、强大或庄严而让人敬畏、惊叹（较正式/较旧的用法）。"},"examples":[{"en":"The mountains were awesome in the early morning light.","zh":"清晨的山脉令人心生敬畏。"},{"en":"They stood in awesome silence inside the cathedral.","zh":"他们在大教堂里肃然无声。"}]}],"synonyms":["great","amazing","excellent","fantastic","impressive","wonderful"],"phonetic":"/ˈɔsəm/","extraExplanation":["“awesome” 来自 “awe”（敬畏、惊叹）。早期更偏“令人敬畏/庄严”，现代口语里常用来表示“超棒、很赞”。","如果你想表达“很棒”，最常见的拼写是 awesome（不是 eesome）。"]}
{"word":"eeten","summary":{"en":"“Eeten” is not standard English; you probably mean “eaten,” the past participle of “eat.”","zh":"“eeten” 不是标准英语；你可能想写的是 “eaten”（eat 的过去分词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past participle of “eat” (used with “have/has/had” or in passive voice).","zh":"“eat”的过去分词（常与 have/has/had 连用，或用于被动语态）。"},"examples":[{"en":"I have eaten already, so I’m not hungry.","zh":"我已经吃过了，所以不饿。"},{"en":"The cake was eaten before the guests arrived.","zh":"客人到之前蛋糕就被吃完了。"},{"en":"Have you ever eaten sushi?","zh":"你吃过寿司吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) already consumed; no longer available because it has been eaten.","zh":"（形容词）已被吃掉的；因为被吃掉而不再剩下的。"},"examples":[{"en":"The cookies are all eaten.","zh":"饼干都被吃光了。"},{"en":"Don’t throw it away—it’s not eaten yet.","zh":"别扔掉——还没被吃呢。"}]}],"synonyms":["consumed","devoured","finished (up)"],"phonetic":"/ˈiːtən/","extraExplanation":["“eeten” 不是标准英语拼写；最常见的情况是把 “eaten” 拼错了。","小提示：现在完成时常用 “have/has + eaten”（例如：I have eaten），而一般过去时用 “ate”（例如：I ate）。"]}
{"word":"Eetion","summary":{"en":"“Eetion” is not a standard English word; it is most likely “edition,” meaning a specific version or release of something.","zh":"“Eetion”不是标准英文单词；最可能是“edition”，表示某事物的某个版本或版次。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) the correct word is usually “edition,” meaning a particular version of a book, newspaper, magazine, or product released at one time.","zh":"（很可能是拼写错误）通常应为“edition”，指书籍、报纸、杂志或产品在某一时期发行的某个版本/版次。"},"examples":[{"en":"I bought the latest edition of this dictionary.","zh":"我买了这本词典的最新版本。"},{"en":"The morning edition of the newspaper is already sold out.","zh":"这份报纸的晨报版已经卖完了。"},{"en":"This software comes in a free edition and a professional edition.","zh":"这个软件有免费版和专业版。"}]}],"synonyms":["version","release","issue","printing"],"phonetic":"/ɪˈdɪʃən/","extraExplanation":["“Eetion”不是常见英文单词。如果你是在输入“edition”，常见搭配有：first edition（初版）、new edition（新版）、limited edition（限量版）。","如果你想表达的是别的词（例如“Eaton / Eton”之类的专有名词），可以告诉我上下文句子，我可以帮你确认正确拼写和含义。"]}
{"word":"Eeyore","summary":{"en":"Eeyore is the gloomy donkey from Winnie-the-Pooh; informally, it can also mean a habitually pessimistic person.","zh":"Eeyore（屹耳）是《小熊维尼》里忧郁的驴子；口语中也可指总是悲观、很丧的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gloomy, pessimistic donkey character in A. A. Milne’s Winnie-the-Pooh stories (a proper name).","zh":"《小熊维尼》（Winnie-the-Pooh）故事中那只总是忧郁、悲观的驴子角色（专有名词）。"},"examples":[{"en":"Eeyore is often sad, but his friends still care about him.","zh":"屹耳常常很难过，但朋友们仍然关心他。"},{"en":"My favorite character in Winnie-the-Pooh is Eeyore.","zh":"我在《小熊维尼》里最喜欢的角色是屹耳。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A person who is habitually negative or downbeat, like the character Eeyore.","zh":"（非正式）指总爱消极、情绪低落的人，像“屹耳”一样。"},"examples":[{"en":"Don’t be such an Eeyore—there are good things happening, too.","zh":"别这么“屹耳”了——也有好事在发生。"},{"en":"He can sound like an Eeyore when he’s stressed.","zh":"他压力大时说话会很“屹耳”（很丧）。"}]}],"synonyms":["gloomy person","pessimist","downer"],"phonetic":"/ˈiːɔːr/","extraExplanation":["“Eeyore”最早出自英国作家A. A. Milne（A.A. 米尔恩）1926年的作品《Winnie-the-Pooh》。角色性格长期低落、爱叹气，所以在英语口语里常被借用来形容“很丧、很悲观的人”。","名字“Eeyore”模仿驴叫声的拟声词（类似于中文里用声音来取名/昵称），读音上像是“ee-or”。"]}
{"word":"eeyuch","summary":{"en":"“eeyuch” is a nonstandard way to write an exclamation of disgust, like “yuck!” or “ew!”","zh":"“eeyuch”是“恶心/嫌弃”的非标准写法，意思相当于“yuck!”或“ew!”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard spelling) An exclamation used to show strong dislike or disgust; basically the same as “yuck!” or “ew!”","zh":"（非正式、非标准拼写）表示强烈反感或恶心的感叹词；相当于“yuck!”或“ew!”。"},"examples":[{"en":"Eeyuch! This milk smells sour.","zh":"Eeyuch！这牛奶闻起来酸了。"},{"en":"He tasted the soup and said, “Eeyuch—too salty.”","zh":"他尝了一口汤，说：“Eeyuch——太咸了。”}],"},{"en":"(informal) Something disgusting or unpleasant (same idea as “yuck”).","zh":"（非正式）令人恶心/讨厌的东西（含义类似“yuck”）。"}]}],"synonyms":["yuck","ew","gross","ugh"],"phonetic":"/jʌk/","extraExplanation":["“eeyuch”不是标准拼写，更常见的是“yuck!”（更口语、像发出“呕/恶心”的声音）或“ew!”（更短、更常见）。\n在写作或聊天中，人们有时会用各种拼法来模仿语气和表情，比如“eee-yuck / eww / yuckkk”。","如果你是在书里或字幕里看到“eeyuch”，它通常用来表现人物的语气（厌恶、嫌弃、挑剔），属于拟声式表达。正式写作中一般不用。"]}
{"word":"eeyuck","summary":{"en":"“Eeyuck” is an informal exclamation meaning “That’s disgusting!”","zh":"“Eeyuck”是非正式感叹，意思是“好恶心/真让人反感！”"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An informal exclamation used to show strong disgust or that something is gross (similar to “Ew!” or “Yuck!”).","zh":"（非正式感叹）表示强烈的嫌恶、觉得很恶心（类似“Ew!”“Yuck!”）。"},"examples":[{"en":"Eeyuck—this milk smells sour.","zh":"Eeyuck——这牛奶闻起来酸掉了。"},{"en":"Eeyuck! There’s a bug in my salad.","zh":"Eeyuck！我的沙拉里有只虫子。"},{"en":"He looked at the dirty sink and said, “Eeyuck.”","zh":"他看着脏水槽说：“Eeyuck。”"}]}],"synonyms":["ew","yuck","gross","ugh"],"phonetic":"/iːˈjʌk/","extraExplanation":["“eeyuck”常见于网络或口语表达，是把“ee/ew”（厌恶声）和“yuck”（恶心）拼在一起的夸张写法。也会写成“ee-yuck”“ee yuck”“ew yuck”。多用于轻松、搞笑或夸张的语气，在正式写作中一般避免使用。"]}

