{"word":"eh","summary":{"en":"“Eh” is an interjection used to ask for agreement/confirmation (“right?”) or to show confusion (“huh?”).","zh":"“eh”是感叹词，常用来征求同意/确认（“对吧？”），也可表示疑惑或没听清（“嗯？”）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used at the end of a sentence to ask for agreement, confirmation, or to check that someone is listening (similar to “right?” or “okay?”).","zh":"放在句末，用来征求同意、确认，或确认对方在听（类似“对吧？”“好吗？”）。"},"examples":[{"en":"Nice weather today, eh?","zh":"今天天气不错，对吧？"},{"en":"You’re coming with us, eh?","zh":"你会跟我们一起去的，对吧？"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show mild surprise, uncertainty, or to ask someone to repeat something (similar to “huh?” or “what?”).","zh":"用来表示轻微惊讶、疑惑，或请对方重复（类似“嗯？”“什么？”）。"},"examples":[{"en":"Eh? I didn’t catch that.","zh":"嗯？我没听清。"},{"en":"Eh—are you sure that’s the right address?","zh":"呃——你确定那是对的地址吗？"}]}],"synonyms":["right?","okay?","huh?","what?"],"phonetic":"/eɪ/","extraExplanation":["“eh”在加拿大英语里非常有标志性，常被刻板印象化为加拿大人常用的句末确认语（类似“对吧”）。在美国英语中也会出现，但更常见的是“right?”“huh?”“what?”等表达，语气是否礼貌主要取决于语调与场合。"]}
{"word":"Ehatisaht","summary":{"en":"“Ehatisaht” isn’t an English word; please confirm the spelling or provide context.","zh":"“Ehatisaht”不是英文单词；请确认拼写或提供上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word; it may be a misspelling or random letters.","zh":"这不是一个被认可的英文单词；可能是拼写错误或随机字母。"},"examples":[{"en":"I couldn’t find “Ehatisaht” in an English dictionary.","zh":"我在英文词典里找不到“Ehatisaht”。"},{"en":"Could you check the spelling or tell me the context of the word?","zh":"你能检查一下拼写，或告诉我这个词出现的语境吗？"}]}],"extraExplanation":["我猜你可能想输入的是：\n- “What is that?”（那是什么？）\n- “hat”（帽子）或 “a hat”（一顶帽子）\n- 或者是某个名字/用户名/自造词\n\n请你把正确拼写发我，或告诉我它出现在哪句话里（例如一整句或截图），我就能给你准确释义和例句。"]}
{"word":"ehatisaht","summary":{"en":"“What is that?” is a common question used to ask what something is or what it means.","zh":"“What is that?”是常用问句，用来问某个东西是什么或某句话/现象是什么意思。"},"definitions":[{"partOfSpeech":"sentense","definition":{"en":"Used to ask for identification or explanation of something you see or notice.","zh":"用于询问你看到或注意到的事物是什么，或请对方解释。"},"examples":[{"en":"What is that on the table?","zh":"桌子上那个是什么？"},{"en":"Sorry—what is that noise?","zh":"不好意思——那是什么声音？"},{"en":"What is that supposed to mean?","zh":"那是什么意思？（那话到底想表达什么？）"}]}],"synonyms":["What’s that?","What is this?","What do you mean?"],"phonetic":"/wʌt ɪz ðæt/","extraExplanation":["你输入的“ehatisaht”看起来很像把“what is that”打乱/打错了（常见于手滑或键盘顺序错位）。如果你本来想查的是别的词或短语，告诉我正确拼写或上下文句子，我可以按你真正想查的内容解释。","“What is that?”在口语里非常常用，语气取决于场景：可以是单纯好奇，也可能带一点惊讶或不满。想更礼貌可以说：\"Excuse me, what is that?\" 或 \"What’s that?\"（更口语、更短）。"]}
{"word":"Ehden","summary":{"en":"Ehden is a mountain town in northern Lebanon, famous for summer vacations and nearby cedar forests.","zh":"Ehden是黎巴嫩北部的一座山城，以避暑度假和附近的雪松森林而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mountain town in northern Lebanon, known for its cool summer climate, nearby cedar forests, and as a popular summer resort.","zh":"黎巴嫩北部的一座山城，以夏季凉爽气候、附近的雪松森林以及避暑胜地而闻名。"},"examples":[{"en":"Many Lebanese families spend part of the summer in Ehden to escape the coastal heat.","zh":"许多黎巴嫩家庭会在夏天到Ehden住上一段时间，躲避沿海的炎热。"},{"en":"We visited the cedar reserve near Ehden during our trip to northern Lebanon.","zh":"我们在黎巴嫩北部旅行时参观了Ehden附近的雪松自然保护区。"}]}],"synonyms":["Ehden (Lebanon)"],"phonetic":"/ˈɛdən/","extraExplanation":["“Ehden”是专有名词，常见搭配包括：Ehden, Lebanon（黎巴嫩的Ehden）、Ehden Forest Reserve（Ehden森林自然保护区）。","拼写上容易与英语单词“Eden”（伊甸园）混淆；两者发音和来源不同，语境里“Ehden”通常指地名。"]}
{"word":"eheu","summary":{"en":"“Eheu” is a literary, Latin-style exclamation meaning “alas!” used to express sorrow or regret.","zh":"“Eheu”是带拉丁文学色彩的感叹词，意思是“唉/真可惜”，用来表达悲伤或懊悔。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An old-fashioned exclamation meaning “alas!” or “ah, how sad!” (often used in Latin or in English writing that imitates Latin style).","zh":"一种古旧的感叹词，意思相当于“唉！”“哎呀，真可惜/真悲伤！”（常见于拉丁文，或模仿拉丁风格的英文写作中）。"},"examples":[{"en":"Eheu! The hero has fallen before the battle even began.","zh":"Eheu！英雄还没开战就已经倒下了。"},{"en":"In the poem, the speaker cries “eheu” to show grief and regret.","zh":"在那首诗里，说话者喊出“eheu”来表达悲伤与懊悔。"}]}],"synonyms":["alas","ah","oh no","what a pity"],"phonetic":"/eɪˈheɪ.u/","extraExplanation":["“Eheu”是拉丁语感叹词，常用来表达哀叹、惋惜、悲痛。英文中它多出现在古典文学、宗教文本、学术或仿古风格的写作里，带有明显的“文言/古典”气息。","现代日常英语中很少说“eheu”；更常见、自然的替代说法是“alas,” “oh no,” “how sad,” 或根据语境用“what a pity.”"]}
{"word":"EHF","summary":{"en":"EHF is an acronym most commonly meaning “Extremely High Frequency,” but it can also mean the European Handball Federation or (older) Ebola Hemorrhagic Fever, depending on context.","zh":"EHF 是一个缩写，最常见指“超高频”，也可能指“欧洲手球联合会”或（旧称）“埃博拉出血热”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Extremely High Frequency: radio frequencies from about 30 to 300 gigahertz (GHz), often used for millimeter-wave communication and radar.","zh":"（缩写）超高频：约 30–300 吉赫（GHz）的无线电频段，常用于毫米波通信与雷达。"},"examples":[{"en":"5G and satellite systems may use EHF bands for high-capacity links.","zh":"5G 和卫星系统可能会使用 EHF 频段来实现大容量传输。"},{"en":"EHF signals can carry a lot of data but are easily blocked by buildings.","zh":"EHF 信号可以承载大量数据，但容易被建筑物阻挡。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) European Handball Federation: the organization that governs and runs major handball competitions in Europe.","zh":"（缩写）欧洲手球联合会：负责管理并举办欧洲重要手球赛事的机构。"},"examples":[{"en":"The club qualified for an EHF European competition this season.","zh":"这家俱乐部本赛季获得了参加 EHF 欧洲赛事的资格。"},{"en":"EHF rules are used in many international handball matches in Europe.","zh":"许多欧洲的国际手球比赛采用 EHF 规则。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, older medical term) Ebola Hemorrhagic Fever: an earlier name for Ebola virus disease.","zh":"（缩写，较旧的医学用语）埃博拉出血热：埃博拉病毒病的旧称。"},"examples":[{"en":"Some older reports used the term EHF when describing Ebola outbreaks.","zh":"一些较早的报告在描述埃博拉疫情时会使用 EHF 这个说法。"},{"en":"Today, doctors usually say “Ebola virus disease” instead of EHF.","zh":"如今医生通常说“埃博拉病毒病”，而不是 EHF。"}]}],"synonyms":["Extremely High Frequency (EHF band)","European Handball Federation","Ebola Hemorrhagic Fever"],"phonetic":"/ˌi eɪtʃ ˈɛf/","extraExplanation":["“EHF”是缩写，具体含义强烈依赖语境（通信工程/体育/医学等）。如果你能告诉我它出现的领域或句子，我可以帮你锁定最准确的释义。","读法通常是按字母读（E-H-F），类似说 “EE-aitch-EFF”。在写作中第一次出现时，常会先写全称再括号写 EHF。"]}
{"word":"EHFA","summary":{"en":"EHFA is an acronym; its meaning depends on the context where it appears.","zh":"EHFA是首字母缩略词；含义取决于出现的语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym. “EHFA” is not a standard English word; it usually stands for the name of an organization or program, and the exact meaning depends on context (field, country, document).","zh":"一个首字母缩略词。“EHFA”不是常见英语单词；通常是某个机构或项目的简称，具体含义取决于使用语境（领域、国家、文件）。"},"examples":[{"en":"In this report, EHFA refers to a specific organization—check the first page for the full name.","zh":"在这份报告里，EHFA指某个特定机构——请查看第一页获取全称。"},{"en":"Could you tell me what EHFA stands for in your email?","zh":"你能告诉我在你的邮件中EHFA代表什么吗？"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌiː eɪtʃ ɛf ˈeɪ/","extraExplanation":["“EHFA”在不同领域可能对应完全不同的全称（例如某些协会、论坛、培训项目或公司部门）。如果你把它出现的句子/段落发我，或告诉我它属于哪个领域（医疗、教育、政府、商业等），我可以帮你准确释义并给出更贴切的例句。"]}
{"word":"Ehling","summary":{"en":"Ehling is most commonly used as a surname (a last name), often with German roots.","zh":"Ehling 最常见的用法是姓氏（英文中的 last name），常见于德语背景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), most often of German origin.","zh":"姓氏（家族姓），多见于德语背景。"},"examples":[{"en":"Dr. Ehling will speak at the conference tomorrow.","zh":"Ehling 博士明天将在会议上发言。"},{"en":"My last name is Ehling.","zh":"我的姓是 Ehling。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a place name used in some German-speaking areas or in names derived from places.","zh":"（较少见）地名；也可能出现在源自地名的名称中。"},"examples":[{"en":"The record mentions a farm near Ehling.","zh":"记录中提到一处靠近 Ehling 的农场。"}]}],"phonetic":"/ˈeɪlɪŋ/","extraExplanation":["“Ehling”通常作为专有名词使用（人名/地名），所以在句子里一般要大写。","在德语姓氏中，结尾“-ing”有时与“某地的人/某家族的人”有关，但具体到某个家庭的来源需要查家谱或当地历史资料。"]}
{"word":"ehlite","summary":{"en":"Elite means the best or most powerful group of people, or something top-level.","zh":"Elite 指“精英群体”，也可形容“顶尖的、精英的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small group of people considered the best, most skilled, or most powerful in a society or organization.","zh":"（社会或组织中的）精英；最优秀/最有影响力的一小群人。"},"examples":[{"en":"Only a small elite can afford to live in this neighborhood.","zh":"只有一小部分精英买得起住在这个社区。"},{"en":"She joined the elite group of top-ranked athletes.","zh":"她加入了顶尖运动员的精英行列。"}]},{"partOfSpeech":"adj.","definition":{"en":"Considered the best or highest quality; top-level.","zh":"精英的；顶尖的；最优质的。"},"examples":[{"en":"He trained at an elite university.","zh":"他在一所顶尖大学接受训练/学习。"},{"en":"This program is designed for elite performers.","zh":"这个项目是为顶尖人才设计的。"}]}],"synonyms":["the best","top","upper crust","cream of the crop","select"],"phonetic":"/eɪˈliːt/","extraExplanation":["你输入的“ehlite”通常不是标准拼写，最常见的正确拼写是“elite”。","“elite”常用于讨论社会阶层（the economic/political elite 经济/政治精英）、体育（elite athletes 顶尖运动员）和教育（elite schools 名校）。在写作里注意语气：有时它是中性描述，有时会带有“特权阶层”的批评意味。"]}
{"word":"Ehlke","summary":{"en":"Ehlke is typically used as a surname (family name).","zh":"Ehlke 通常用作姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), likely of German origin; used to refer to a person or family named Ehlke.","zh":"一个姓氏（家族姓），很可能源自德语地区；用来指代姓 Ehlke 的人或家庭。"},"examples":[{"en":"Dr. Ehlke will lead the research team this year.","zh":"Ehlke 博士今年将带领研究团队。"},{"en":"I emailed Ms. Ehlke to confirm the meeting time.","zh":"我给 Ehlke 女士发邮件确认会议时间。"}]}],"phonetic":"/ˈɛlki/","extraExplanation":["“Ehlke”不是常见英语词汇，更常见于人名/姓氏。在英语里，姓氏通常不翻译含义，主要用于称呼与识别（如 Mr./Ms./Dr. + 姓）。","发音会因家庭与地区而异：如果是德语背景，结尾 -e 往往更接近弱读的“呃/ə”音；在英语环境中也可能被读得更“ee/ki”一些。"]}
{"word":"Ehman","summary":{"en":"Ehman is typically used as a surname (family name).","zh":"Ehman 通常用作姓氏（家族名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). It may refer to a specific person (for example, an author, athlete, or someone you know).","zh":"一个姓氏（家族名）。常用来指某个具体的人（例如作者、运动员或你认识的人）。"},"examples":[{"en":"Ms. Ehman will lead the meeting today.","zh":"Ehman 女士今天将主持会议。"},{"en":"I found an article written by Ehman.","zh":"我找到了一篇由 Ehman 撰写的文章。"}]}],"phonetic":"/ˈiːmən/","extraExplanation":["“Ehman”通常作为英文语境中的姓氏使用，而不是常见词汇，因此没有像普通单词那样固定的词义。","它可能与一些德语/中欧来源的姓氏变体有关（拼写在不同移民记录中可能变化），例如与“Ehrman / Eman”等形式在发音或拼写上相近；但具体来源需要结合家谱或个人背景确认。","书写规则：作为姓氏在英文中一般首字母大写（Ehman）。在称呼中常与 Mr./Ms./Dr. 等头衔连用。"]}
{"word":"EHP","summary":{"en":"EHP is an abbreviation; common meanings include effective horsepower (marine) and electric horsepower (motors).","zh":"EHP 是一个缩写；常见含义包括有效马力（船舶）和电马力（电机）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) the letters “E-H-P,” used as an abbreviation for different phrases depending on the field (engineering, health, organizations, etc.).","zh":"（缩写）字母“EHP”，在不同领域可代表不同词组（工程、健康、机构名称等），具体含义取决于语境。"},"examples":[{"en":"What does EHP stand for in this document?","zh":"这份文件里的 EHP 代表什么？"},{"en":"In shipping reports, EHP often refers to a kind of horsepower measurement.","zh":"在航运报告中，EHP 常指一种马力的测量方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(engineering, esp. marine) effective horsepower: the power required to move a ship through the water at a given speed (a performance/efficiency measure).","zh":"（工程，尤指船舶）有效马力：船只在一定速度下在水中航行所需的功率（用于衡量性能/效率）。"},"examples":[{"en":"The designer calculated the ship’s EHP at 20 knots.","zh":"设计师计算了船在 20 节航速下的有效马力（EHP）。"},{"en":"Lower EHP can mean better hydrodynamic efficiency.","zh":"更低的 EHP 可能意味着更好的水动力效率。"}]},{"partOfSpeech":"n.","definition":{"en":"(engineering) electric horsepower: a way to express electric motor power in “horsepower” units.","zh":"（工程）电马力：用“马力”单位来表示电动机功率的一种说法。"},"examples":[{"en":"Check the motor’s rating in kW or EHP.","zh":"查看电机的额定功率，单位可能是千瓦或电马力（EHP）。"}]}],"synonyms":["abbreviation","initialism"],"phonetic":"ˌiː eɪtʃ ˈpiː","extraExplanation":["“EHP”是典型的多义缩写：不同专业会把它展开成不同全称。最可靠的方法是看上下文（例如是否在讲船舶阻力/航速、是否在讲电机功率、是否是某个机构或项目名称）。如果你告诉我它出现在哪句话或哪个领域，我可以帮你确定最可能的含义。"]}
{"word":"Ehr","summary":{"en":"“EHR” most commonly means “electronic health record” in healthcare; “ehr” can also be a hesitation sound like “er/uh.”","zh":"“EHR”最常指医疗领域的“电子健康病历”；“ehr”也可作口语中的犹豫语气音，类似“呃/嗯”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"electronic health record: a digital file that stores a patient’s medical information (such as diagnoses, medicines, test results, and visit notes), shared across clinics or hospitals.","zh":"电子健康病历：以数字形式保存患者医疗信息（如诊断、用药、检查结果、就诊记录等）的档案，可在诊所或医院之间共享使用。"},"examples":[{"en":"The doctor reviewed my EHR before the appointment.","zh":"医生在看诊前查看了我的电子健康病历（EHR）。"},{"en":"This hospital’s EHR system lets different departments see the same patient record.","zh":"这家医院的EHR系统让不同科室能查看同一份患者记录。"},{"en":"The nurse entered my allergy information into the EHR.","zh":"护士把我的过敏信息录入了EHR。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal) a hesitation sound, like “er/uh,” used when someone pauses to think while speaking.","zh":"（非正式）犹豫的语气音，类似“呃/嗯”，说话时停顿思考用。"},"examples":[{"en":"Ehr… I’m not sure that’s the right answer.","zh":"呃……我不确定那是正确答案。"},{"en":"He said, “Ehr, give me a second,” and checked his notes.","zh":"他说：“呃，等我一下。”然后看了看笔记。"}]}],"synonyms":["electronic health record","patient record","medical record (broader)","er","uh"],"phonetic":"/ˌiːˌeɪtʃˈɑːr/","extraExplanation":["在医疗语境里，EHR通常指“Electronic Health Record”。与EMR（Electronic Medical Record，电子病历）相比，EHR更强调跨机构共享与连续照护；不同国家/医院对两者的使用有时会混用。","作为口语停顿音的“ehr”更多见于非正式书写（聊天、口语转写），正式写作中通常避免使用。"]}
{"word":"Ehrenberg","summary":{"en":"Ehrenberg is most commonly a German surname, and it can also be a German place name.","zh":"Ehrenberg 最常见为德语姓氏，也可作德语地区的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German-language surname (family name).","zh":"（德语）姓氏。"},"examples":[{"en":"Christian Gottfried Ehrenberg was a famous German scientist who studied tiny organisms.","zh":"克里斯蒂安·戈特弗里德·埃伦贝格是一位著名的德国科学家，研究微小生物。"},{"en":"Ehrenberg is a common surname in parts of Germany.","zh":"Ehrenberg 在德国一些地区是较常见的姓氏。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in German-speaking regions (for example, towns, mountains, or a castle named “Ehrenberg”).","zh":"（德语地区的）地名（例如名为“Ehrenberg”的城镇、山名或城堡）。"},"examples":[{"en":"They visited Ehrenberg Castle during their trip through Austria.","zh":"他们在穿越奥地利的旅行中参观了埃伦贝格城堡。"},{"en":"The map shows several locations called Ehrenberg.","zh":"地图上标出了几个名为 Ehrenberg 的地点。"}]}],"phonetic":"ˈɛrənbɝːɡ","extraExplanation":["“Ehrenberg”通常来自德语词根：Ehre（荣誉）+ Berg（山），字面意思接近“荣誉之山”。因此它既可能是姓氏，也常被用作地名（例如城堡或山丘的名称）。","作为人名时，英语里常把它当作专有名词使用：Ehrenberg（不加冠词），需要时可在前面加头衔或名字（如 Dr. Ehrenberg）。"]}
{"word":"Ehrenbreitstein","summary":{"en":"Ehrenbreitstein is a famous fortress and historic site in Koblenz, Germany, above the Rhine River.","zh":"Ehrenbreitstein 指德国科布伦茨莱茵河畔山上的著名要塞与历史景点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fortress (and the hill it stands on) in Koblenz, Germany, overlooking the Rhine River; today it is a well-known historical landmark and museum complex.","zh":"德国科布伦茨（Koblenz）的一座要塞（及其所在山丘），俯瞰莱茵河；如今是著名的历史地标与博物馆群。"},"examples":[{"en":"We took the cable car across the Rhine to visit Ehrenbreitstein Fortress.","zh":"我们乘坐跨越莱茵河的缆车去参观埃伦布赖特施泰因要塞。"},{"en":"From Ehrenbreitstein, you can see where the Rhine and Moselle rivers meet at the Deutsches Eck.","zh":"从埃伦布赖特施泰因可以看到莱茵河与摩泽尔河在“德意志之角”（Deutsches Eck）交汇。"}]}],"synonyms":["Ehrenbreitstein Fortress"],"phonetic":"/ˈɛrənˌbraɪtstaɪn/","extraExplanation":["“Ehrenbreitstein”是德语地名，常见于英文旅游与历史语境中，通常指“Ehrenbreitstein Fortress（埃伦布赖特施泰因要塞）”。","它位于德国莱茵兰-普法尔茨州的科布伦茨市，对莱茵河战略位置重要；拿破仑战争时期曾被毁，之后普鲁士在19世纪重建并强化为大型要塞体系的一部分。","发音对英语学习者来说较难，读时可按音节感受：EH-ren-BRYT-styne（重音常落在开头）。"]}
{"word":"Ehrenburg","summary":{"en":"Ehrenburg is a surname, most often referring to the Soviet writer and journalist Ilya Ehrenburg.","zh":"Ehrenburg 是一个姓氏，最常指苏联作家与记者伊利亚·爱伦堡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) A surname; most commonly refers to Ilya Ehrenburg (1891–1967), a Soviet writer and journalist known for novels, memoirs, and wartime reporting.","zh":"（专有名词）一个姓氏；最常指伊利亚·爱伦堡（Ilya Ehrenburg，1891–1967），苏联作家与记者，以小说、回忆录和战争报道闻名。"},"examples":[{"en":"Ehrenburg wrote reports that were widely read during World War II.","zh":"爱伦堡在二战期间写的报道被广泛阅读。"},{"en":"In class, we discussed Ehrenburg’s memoirs and how they portray life in the Soviet era.","zh":"课堂上我们讨论了爱伦堡的回忆录，以及它们如何呈现苏联时代的生活。"}]}],"phonetic":"/ˈerənˌbɝːɡ/","extraExplanation":["“Ehrenburg”是德语/犹太姓氏背景较常见的拼写之一；在英语语境里提到它，多半是在文学史、新闻史或苏联史中指“伊利亚·爱伦堡”。","他与20世纪欧洲文艺圈关系密切，也以战时宣传与报道引发争议；阅读相关作品或研究时，常会同时出现“war correspondent（战地记者）”“propaganda（宣传）”“memoir（回忆录）”等关键词。"]}
{"word":"Ehretia","summary":{"en":"Ehretia is a plant genus (borage family) of shrubs and small trees, including species sometimes used for ornamentals and bonsai.","zh":"Ehretia 指紫草科的一属灌木或小乔木，其中有些物种用于观赏或盆景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs and small trees in the borage family (Boraginaceae), found mainly in warm regions; some species are grown as ornamentals or bonsai.","zh":"（植物）栀子木属／厚壳树属（Ehretia）：紫草科的一属灌木或小乔木，多分布于温暖地区；部分物种作观赏植物或盆景。"},"examples":[{"en":"Ehretia microphylla is often sold as a bonsai and is sometimes called the Fukien tea tree.","zh":"Ehretia microphylla 常被作为盆景出售，也常被称为“福建茶（Fukien tea tree）”。"},{"en":"In some tropical gardens, Ehretia trees are planted for their small flowers and berries.","zh":"在一些热带花园里，人们会种植 Ehretia 属的树木，欣赏它们的小花和浆果。"}]}],"synonyms":["Ehretia (genus name)"],"phonetic":"ˈɛrɪtiə","extraExplanation":["“Ehretia”是拉丁化的属名，来源于18世纪德国植物学插画家 Georg Dionysius Ehret（埃雷特）的姓氏，用于纪念他对植物学绘图与分类传播的贡献。","在园艺与盆景语境里，你更可能看到具体物种名（如 Ehretia microphylla）或俗名（如 Fukien tea tree），而不是单独说属名。"]}
{"word":"ehretia","summary":{"en":"Ehretia is a botanical genus of shrubs and small trees, mainly in warm climates.","zh":"Ehretia 指一种植物学属名（鹅耳枥属），多为温暖地区的灌木或小乔木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs and small trees (family Boraginaceae) found mainly in warm regions; some species are grown for their flowers or used in traditional medicine.","zh":"鹅耳枥属（紫草科）植物的一个属，多为灌木或小乔木，主要分布在温暖地区；部分种类因花或药用价值而栽培或使用。"},"examples":[{"en":"Ehretia is a genus of woody plants often seen in tropical and subtropical habitats.","zh":"Ehretia 是一个木本植物属，常见于热带与亚热带生境。"},{"en":"In some regions, people use parts of an Ehretia plant in traditional remedies.","zh":"在一些地区，人们会把 Ehretia 植物的部分用于传统疗法。"}]}],"synonyms":["Ehretia (genus)"],"phonetic":"/ɪˈriːtiə/","extraExplanation":["“Ehretia”是拉丁化的植物学属名，来源于18世纪的植物学插画家 Georg Dionysius Ehret（格奥尔格·迪奥尼修斯·埃赫雷特）的姓氏，用来纪念他对植物学绘图与分类传播的贡献。","该属常见物种包括 Ehretia microphylla 等；在园艺语境中有时也会被称作“野丁香/假丁香（fukien tea 等）”之类的俗名，但不同地区俗名可能指向不同植物，最好结合学名确认。"]}
{"word":"Ehretiaceae","summary":{"en":"Ehretiaceae is an older botanical family name, now usually included within Boraginaceae, containing *Ehretia* and related plants.","zh":"Ehretiaceae 是较旧的植物科名，现多并入紫草科（Boraginaceae），包含鹅耳枣属（*Ehretia*）等近缘植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former plant family name (now usually treated as part of the borage family, Boraginaceae) that includes the genus *Ehretia* and related plants.","zh":"一种已较少使用的植物科名（现多并入紫草科 Boraginaceae），包含 *Ehretia*（鹅耳枣属）及其近缘植物。"},"examples":[{"en":"In older botany books, *Ehretia* was sometimes placed in Ehretiaceae.","zh":"在一些较早的植物学书籍中，*Ehretia* 有时被归入 Ehretiaceae（鹅耳枣科）。"},{"en":"Modern classifications often merge Ehretiaceae into Boraginaceae.","zh":"现代分类体系常把 Ehretiaceae 并入 Boraginaceae（紫草科）。"}]}],"synonyms":["Boraginaceae (in modern classification)","Ehretia (related genus name)"],"phonetic":"/ˌɛrɪtiˈeɪsiˌi/","extraExplanation":["这是一个“历史/旧分类”里常见的科名：随着分子系统学（DNA 证据）发展，许多过去独立设立的科被重新合并或调整，因此你在新旧资料中可能会看到不同写法与归类。","词形上，-aceae 是植物“科”的标准拉丁化后缀（如 Rosaceae 蔷薇科）；Ehretiaceae 来自属名 *Ehretia*（以人物姓氏命名的属名很常见）。"]}
{"word":"ehretiaceae","summary":{"en":"Ehretiaceae is a plant family name (the Ehretia family), sometimes treated as part of Boraginaceae in modern classifications.","zh":"Ehretiaceae 指植物科名（与厚壳树属等相关），现代分类中常被视作紫草科的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family of flowering plants (the Ehretia family), including genera such as *Ehretia*; in some modern classifications, its members are often treated as part of the borage family (Boraginaceae).","zh":"植物学上的一个被子植物科（“厚壳树科/厚壳树亚科”相关群），包含厚壳树属（*Ehretia*）等；在一些现代分类中，其成员常被并入紫草科（Boraginaceae）。"},"examples":[{"en":"In older botany books, *Ehretia* is sometimes placed in the family Ehretiaceae.","zh":"在较早的植物学书籍里，厚壳树属（*Ehretia*）有时被归入厚壳树科（Ehretiaceae）。"},{"en":"Recent sources may list Ehretiaceae under Boraginaceae depending on the classification system.","zh":"根据不同的分类系统，较新的资料可能会把厚壳树科（Ehretiaceae）并到紫草科（Boraginaceae）之下。"}]}],"synonyms":["Ehretia family"],"phonetic":"/ˌɛrɪtiˈeɪsiˌi/","extraExplanation":["这是一个“科名”（family name），后缀 **-aceae** 是拉丁化的植物科名常见结尾，表示“……科”。","很多植物科在不同年代会发生“拆分/合并”的分类调整；因此你可能在不同资料里看到 Ehretiaceae 被独立列出，或被并入 Boraginaceae（紫草科）。","该科名来自属名 **Ehretia**，而属名又纪念德国植物学家 Georg Dionysius Ehret。"]}
{"word":"Ehrhardt","summary":{"en":"Ehrhardt is usually a German-origin surname, and it can also refer to a serif typeface used in book printing.","zh":"Ehrhardt 通常是源自德语地区的姓氏，也可指一种用于书籍印刷排版的衬线字体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), originally of German origin.","zh":"（姓氏）一个源自德语地区的姓。"},"examples":[{"en":"Dr. Ehrhardt will speak at the conference tomorrow.","zh":"埃尔哈特博士明天将在会议上发言。"},{"en":"I found an article written by someone named Ehrhardt.","zh":"我找到了一篇由一位姓埃尔哈特的人写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"A serif typeface used in printing and book design (often called “Monotype Ehrhardt”).","zh":"（字体）一种常用于印刷与书籍排版的衬线字体（常称“Monotype Ehrhardt / Ehrhardt 字体”）。"},"examples":[{"en":"The publisher set the main text in Ehrhardt for a classic, bookish feel.","zh":"出版社用 Ehrhardt 字体排正文，以营造经典、书卷气的感觉。"},{"en":"Try Ehrhardt if you want a readable serif font for long paragraphs.","zh":"如果你想要适合长段落、易读的衬线字体，可以试试 Ehrhardt。"}]}],"synonyms":["Monotype Ehrhardt (typeface name)"],"phonetic":"/ˈɛr.hɑrt/","extraExplanation":["“Ehrhardt”常见于人名/姓氏，来源与德语地区有关。在英语语境里，它通常作为专有名词使用，首字母大写。","排版领域的 Ehrhardt 多指一款衬线字体（serif typeface），常用于书籍正文，因为它在小字号时也相对清晰、耐读。"]}
{"word":"Ehrlich","summary":{"en":"“Ehrlich” is mainly a surname in English, and it also appears in science/medicine for methods or reagents named after Paul Ehrlich.","zh":"“Ehrlich”主要在英语中作姓氏使用，也常见于科学/医学中指以保罗·埃尔利希命名的方法或试剂。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a German-language surname; in English it is most often seen as a family name (e.g., in books, academic citations, or people’s names).","zh":"德语姓氏；在英语里最常见的用法是作为人名的姓（常见于书籍、论文引用或人物姓名中）。"},"examples":[{"en":"The paper was co-authored by Dr. Ehrlich.","zh":"这篇论文由 Ehrlich 博士共同署名。"},{"en":"I found the quote in Ehrlich’s 1998 article.","zh":"我在 Ehrlich 1998 年的文章里找到了那句引用。"}]},{"partOfSpeech":"other","definition":{"en":"in scientific or medical contexts, “Ehrlich” can refer to things named after Paul Ehrlich (for example, the Ehrlich test / Ehrlich reagent).","zh":"在科学或医学语境中，“Ehrlich”可指以保罗·埃尔利希（Paul Ehrlich）命名的事物（如 Ehrlich 试验 / Ehrlich 试剂）。"},"examples":[{"en":"The lab used the Ehrlich reagent to check the sample.","zh":"实验室用 Ehrlich 试剂来检测样本。"},{"en":"The doctor mentioned an Ehrlich-related staining method in the report.","zh":"医生在报告中提到一种与 Ehrlich 相关的染色方法。"}]}],"synonyms":["(none—proper name)"],"phonetic":"/ˈɛr.lɪk/","extraExplanation":["“Ehrlich”在英语里通常不当作普通词汇使用，而是专有名词（姓氏）。最有名的关联人物是德国科学家保罗·埃尔利希（Paul Ehrlich, 1854–1915），他在免疫学、化学疗法等领域影响很大，因此不少试剂、染色法或检测方法以他命名。","发音上英语往往按德语姓氏的常见英语化读法处理；在学术写作中常见于作者名、方法名或试剂名（通常首字母大写）。"]}
{"word":"Ehrman","summary":{"en":"Ehrman is a surname, often referring to Bart D. Ehrman, a well-known American scholar of the New Testament and early Christianity.","zh":"Ehrman 是一个姓氏，常用来指美国著名的新约与早期基督教研究学者巴特·D·埃尔曼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname; most commonly referring to Bart D. Ehrman, an American scholar known for research on the New Testament, early Christianity, and how biblical manuscripts changed over time.","zh":"一个姓氏；最常见的用法是指巴特·D·埃尔曼（Bart D. Ehrman），美国学者，以研究新约、早期基督教以及《圣经》手稿在流传中如何发生变化而闻名。"},"examples":[{"en":"I’m reading Ehrman’s book about how ancient manuscripts were copied.","zh":"我正在读埃尔曼的一本书，讲古代手稿是如何被抄写流传的。"},{"en":"In class, the professor mentioned Ehrman when discussing textual criticism.","zh":"课堂上，教授在讨论文本批判时提到了埃尔曼。"}]}],"phonetic":"/ˈɛrmən/","extraExplanation":["“Ehrman”本身只是姓氏；在英语语境里单独说“Ehrman”时，常常默认指 Bart D. Ehrman（巴特·D·埃尔曼）。他写过面向大众的书，如《Misquoting Jesus》（常译《篡改的耶稣》），讨论抄写差异、版本变体等问题。","发音上常见重音在第一个音节，听起来接近“AIR-mən”。"]}
{"word":"Ehrsam","summary":{"en":"“Ehrsam” is primarily a surname (a last name).","zh":"“Ehrsam”主要是一个姓氏（英文里的 last name）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used to identify a person or a family; often seen in names like “Fred Ehrsam.”","zh":"一个姓氏（家族姓），用于标识个人或家族；常见于如“Fred Ehrsam（弗雷德·埃尔萨姆）”这样的姓名中。"},"examples":[{"en":"Fred Ehrsam is known for co-founding Coinbase.","zh":"Fred Ehrsam 因共同创立 Coinbase 而为人所知。"},{"en":"Ms. Ehrsam will join the meeting at 3 p.m.","zh":"Ehrsam 女士将于下午三点参加会议。"}]}],"synonyms":["(no direct synonyms; it is a surname)"],"phonetic":"ˈɛr.səm","extraExplanation":["“Ehrsam”通常作为西方人的姓使用，并不是常见的英语词汇，所以一般不翻译，只做音译或直接保留拼写。","在新闻、科技或商业语境中，你可能会遇到这个姓，最常被提到的是加密货币行业相关人物 Fred Ehrsam。"]}
{"word":"ehtanethial","summary":{"en":"Not a recognized English word; likely a misspelling or a proper noun.","zh":"不是常见英语单词；可能是拼写错误或专有名词。"},"extraExplanation":["“ehtanethial”看起来不像是一个常见的英语单词，可能是拼写错误或专有名词。","你可以检查是否想输入：\n- **ethanethial** / **ethanethiol**（常见化学名：乙硫醇，ethanethiol 更常见）\n- **ethereal**（空灵的、缥缈的）\n- **essential**（必要的、本质的）\n- **Ethan**（人名）\n\n如果你告诉我它出现的语境（句子/截图/学科：化学、游戏ID、人名等），我可以帮你确定最可能的正确拼写和含义。"]}
{"word":"ehuawa","summary":{"en":"“ehuawa” is commonly used as a pinyin-based way to mean “worsen/deteriorate,” but standard English uses “worsen” or “deteriorate.”","zh":"“ehuawa”多为“恶化”的拼音式写法，表达“变糟/恶化”；标准英语通常用 worsen 或 deteriorate。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to worsen; to deteriorate (often used by Chinese speakers as a pinyin form of 恶化)","zh":"（常见于中文语境的拼音写法，来自“恶化”）恶化；变坏；加剧"},"examples":[{"en":"If the weather ehuawa, the flight may be delayed.","zh":"如果天气恶化，航班可能会延误。"},{"en":"His condition began to ehuawa after he stopped taking the medicine.","zh":"他停药后病情开始恶化。"}]},{"partOfSpeech":"n.","definition":{"en":"a worsening; deterioration","zh":"恶化；变坏；（情况的）加剧"},"examples":[{"en":"There has been an ehuawa in air quality this winter.","zh":"今年冬天空气质量出现了恶化。"}]}],"synonyms":["worsen","deteriorate","decline","get worse"],"phonetic":"/ˌəˈhwɑːwə/","extraExplanation":["“ehuawa”更像是汉语“恶化（èhuà）”的拼音写法，而不是标准英语单词。在正式英语写作或考试中，通常用：worsen（动词：变糟/加重）、deteriorate（动词：恶化/变差，较正式）、deterioration（名词：恶化）、worsening（名词：加重）。"]}
{"word":"Ehud","summary":{"en":"Ehud is a male name, best known as the biblical judge in the Book of Judges.","zh":"Ehud 是男性名字，最常见的指代是《士师记》中的圣经士师“以笏”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name; in the Bible, Ehud is an Israelite judge known for delivering Israel from Moabite rule (Book of Judges).","zh":"男性名字；《圣经》中“以笏”（Ehud）是以色列的一位士师，以摆脱摩押统治而闻名（《士师记》）。"},"examples":[{"en":"Ehud is a character in the Book of Judges.","zh":"Ehud（以笏）是《士师记》中的人物。"},{"en":"They named their son Ehud after the biblical judge.","zh":"他们给儿子取名叫 Ehud，是为了纪念那位《圣经》中的士师。"}]}],"synonyms":["Ehud (given name)"],"phonetic":"/ˈiːhʊd/","extraExplanation":["“Ehud”源自希伯来语名字“Ehud/’Ehud”，中文常译作“以笏”。在英语语境中，它多作为专有名词出现（人名或圣经人物名），不常用作普通词汇。","圣经叙事中，Ehud以“左撇子”和刺杀摩押王以拯救以色列而著名；因此在宗教或文学讨论里，名字有时会引出“机智、果断、拯救者”等联想（但在日常英语里通常只是人名）。"]}
{"word":"Ehudd","summary":{"en":"Ehud is a male given name, most famously the biblical judge in Judges 3.","zh":"Ehud 是男性名字，最著名的用法指《士师记》中的士师“以笏”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ehud: a man’s name, best known as a judge in the Hebrew Bible (Old Testament) who freed Israel from Moabite rule (Book of Judges 3).","zh":"Ehud：男性名字，最常见的背景来自《希伯来圣经/旧约》中的士师以笏（《士师记》第3章），以摆脱摩押统治而闻名。"},"examples":[{"en":"In the Bible story, Ehud delivers Israel from King Eglon of Moab.","zh":"在圣经故事中，以笏（Ehud）使以色列人脱离摩押王伊矶伦（Eglon）的统治。"},{"en":"Some parents choose the name Ehud for its strong historical and religious associations.","zh":"有些父母选择 Ehud 这个名字，是因为它带有强烈的历史与宗教联想。"}]}],"synonyms":["(no direct synonyms; related: biblical names, Hebrew given names)"],"phonetic":"/ˈiːhʊd/","extraExplanation":["“Ehud/以笏”是专有名词（人名）。在英语文本里常直接写作 Ehud；中文常译作“以笏”。","你输入的“Ehudd”更像是拼写误差：英语里通常不写双 d（Ehud），除非是个人或品牌刻意的拼写。若你指的是别的词或名字（例如昵称/用户名），告诉我语境我可以帮你确认。"]}
