{"word":"EI","summary":{"en":"EI most commonly means emotional intelligence; it can also be an informal attention-getting sound like “hey.”","zh":"EI 最常见指“情绪智力”；也可作非正式的招呼声，类似“嘿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbreviation) emotional intelligence: the ability to understand, use, and manage your own emotions and relate well to other people’s emotions.","zh":"（缩写）情绪智力：理解、运用并管理自己情绪，同时也能理解并良好应对他人情绪的能力。"},"examples":[{"en":"Many employers value EI because teamwork depends on communication and empathy.","zh":"许多雇主重视情绪智力（EI），因为团队合作依赖沟通与同理心。"},{"en":"Her high EI helps her stay calm during conflict.","zh":"她很高的情绪智力（EI）帮助她在冲突中保持冷静。"}]},{"partOfSpeech":"int.","definition":{"en":"(interjection, informal) a sound used to get someone’s attention, similar to “hey.”","zh":"（感叹词，非正式）用来引起别人注意的声音，类似“嘿”。"},"examples":[{"en":"Ei, wait up—I forgot my keys!","zh":"嘿，等等我——我忘带钥匙了！"},{"en":"Ei! Can you hear me?","zh":"嘿！你听得到吗？"}]}],"synonyms":["EQ","emotional intelligence","hey"],"phonetic":"/ˌiːˈaɪ/","extraExplanation":["在英语里，“EI”最常见是“emotional intelligence”的缩写，也有人用“EQ”表示相近概念。谈职场能力、沟通、领导力、同理心等话题时经常出现。","作为引起注意的“ei”更像口语中的声音（类似“hey”），书面语里不算正式，更多出现在对话或小说台词中。"]}
{"word":"Ei","summary":{"en":"EI is an abbreviation most commonly meaning emotional intelligence, and in Canada it can mean Employment Insurance.","zh":"EI是缩写，最常见指情绪智力（情商）；在加拿大语境中也可指就业保险。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Emotional intelligence; the ability to understand and manage your own emotions and relate well to others.","zh":"情绪智力（情商）；理解与管理自己情绪，并与他人良好相处的能力。"},"examples":[{"en":"Some employers value EI as much as technical skills.","zh":"有些雇主认为情商（EI）和技术能力同样重要。"},{"en":"High EI can help you handle conflict calmly.","zh":"高情商能帮助你冷静地处理冲突。"}]},{"partOfSpeech":"other","definition":{"en":"Employment Insurance (Canada); a government program that provides temporary financial support if you lose your job or can’t work for certain reasons.","zh":"就业保险（加拿大）；在失业或因特定原因无法工作时提供临时经济支持的政府项目。"},"examples":[{"en":"She applied for EI after being laid off.","zh":"她被裁员后申请了就业保险（EI）。"},{"en":"To qualify for EI, you must meet certain requirements.","zh":"要符合EI资格，你必须满足一些条件。"}]},{"partOfSpeech":"other","definition":{"en":"In general writing, “EI” can also be used as an abbreviation in specific fields (for example, electronics or testing), but the exact meaning depends on the context.","zh":"在一般写作中，“EI”也可能是某些专业领域的缩写（如电子工程或测试），具体含义取决于上下文。"},"examples":[{"en":"In this manual, EI refers to the error indicator.","zh":"在这本手册中，EI指错误指示器。"}]}],"synonyms":["emotional intelligence","EQ (common related term)","Employment Insurance (Canada)"],"phonetic":"/ˌiːˈaɪ/","extraExplanation":["“EI”更常见的是大写缩写（initialism），通常读作字母名“E-I”。在不同国家/语境里含义可能完全不同：职场沟通中多指情绪智力；加拿大语境里常指就业保险。若你告诉我句子或领域（心理学/职场/移民材料/电子工程等），我可以帮你精确判定。"]}
{"word":"ei","summary":{"en":"“Ei” is an interjection used to get attention or to express surprise or mild disapproval, depending on tone.","zh":"“Ei”是感叹词，可用于引起注意，也可表达惊讶或轻微不满，具体含义取决于语气。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to get someone’s attention, similar to “hey.”","zh":"用来引起别人注意，类似“嘿/喂”。"},"examples":[{"en":"Ei, can you help me for a second?","zh":"喂，你能帮我一下吗？"},{"en":"Ei! Wait up!","zh":"喂！等等我！"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show surprise, mild protest, or disapproval, depending on tone.","zh":"根据语气表示惊讶、轻微抗议或不满。"},"examples":[{"en":"Ei, that’s not fair.","zh":"喂，这不公平吧。"},{"en":"Ei? You’re leaving already?","zh":"诶？你这么快就要走？"}]}],"synonyms":["hey","yo","eh"],"phonetic":"/eɪ/","extraExplanation":["“ei”多见于口语对话或漫画/小说的对白里，用来模拟说话时的声音；语气很关键：拉长或提高音调更像“诶？（惊讶）”，短促有力更像“喂！（叫人/提醒）”。","在不同地区的英语里也可能写作“eh/hey”，有时“ei”是为了呈现角色口音或更口语化的感觉。"]}
{"word":"EIA","summary":{"en":"EIA most commonly means Environmental Impact Assessment; it can also mean the U.S. Energy Information Administration or enzyme immunoassay in lab testing.","zh":"EIA 最常见指“环境影响评价”；也可指“美国能源信息署”或医学检验中的“酶免疫测定”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Environmental Impact Assessment: a formal study that predicts how a project (like a highway, factory, or dam) may affect the environment, and suggests ways to reduce harm.","zh":"环境影响评价：对某个工程或项目（如公路、工厂、水坝等）可能带来的环境影响进行预测与评估，并提出减缓措施的正式研究/程序。"},"examples":[{"en":"The company must complete an EIA before building the new plant.","zh":"公司在建设新工厂前必须完成环境影响评价（EIA）。"},{"en":"The EIA found risks to local wildlife and recommended changing the project design.","zh":"环境影响评价发现对当地野生动物有风险，并建议调整项目设计。"}]},{"partOfSpeech":"n.","definition":{"en":"U.S. Energy Information Administration: a U.S. government agency that collects and publishes data about energy (oil, gas, electricity, etc.).","zh":"美国能源信息署：美国政府机构，负责收集并发布能源（石油、天然气、电力等）相关数据。"},"examples":[{"en":"According to the EIA, gasoline prices rose last week.","zh":"根据美国能源信息署（EIA）的数据，上周汽油价格上涨。"},{"en":"Analysts often cite EIA reports when discussing oil supply.","zh":"分析师在讨论石油供应时常引用EIA报告。"}]},{"partOfSpeech":"n.","definition":{"en":"Enzyme immunoassay: a lab test that uses enzymes and antibodies to detect a substance (such as a drug, hormone, or virus marker).","zh":"酶免疫测定：一种利用酶与抗体来检测特定物质（如药物、激素或病毒标志物）的实验室检测方法。"},"examples":[{"en":"The screening test was done using an EIA method.","zh":"该初筛检测使用了酶免疫测定（EIA）方法。"},{"en":"EIA results may need confirmation with a more specific test.","zh":"EIA结果有时需要用更特异的检测来复核确认。"}]}],"synonyms":["Environmental Impact Assessment (spelled out)","Energy Information Administration (spelled out)","enzyme immunoassay (spelled out)"],"phonetic":"/ˌiː aɪ ˈeɪ/","extraExplanation":["EIA 是缩写，具体含义高度依赖语境：在环保与工程审批中最常见的是“环境影响评价”；在能源新闻、油价与库存数据里常指美国政府机构“能源信息署”；在医学检验或毒品/传染病筛查语境中常指“酶免疫测定”。","读到句子时可用线索判断：出现 project, permit, pollution, wildlife 多半是环境影响评价；出现 oil, gas, inventory, prices 多半是能源信息署；出现 test, assay, antibody 多半是医学检测。"]}
{"word":"EIB","summary":{"en":"EIB most commonly means the European Investment Bank, the EU’s long-term lending institution; in other contexts it can be an organization-specific abbreviation.","zh":"EIB最常见指“欧洲投资银行（European Investment Bank）”，即欧盟的长期贷款机构；在其他语境中也可能是某个组织自定义的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"European Investment Bank: the European Union’s long-term lending institution that finances projects (e.g., infrastructure, climate, innovation) to support EU policy goals.","zh":"欧洲投资银行：欧盟的长期贷款机构，为基础设施、气候、创新等项目提供融资，以支持欧盟政策目标。"},"examples":[{"en":"The EIB funded a new railway project to reduce carbon emissions.","zh":"欧洲投资银行为一个新铁路项目提供融资，以减少碳排放。"},{"en":"Our city applied for an EIB loan to upgrade its public transport system.","zh":"我们城市申请了欧洲投资银行的贷款来升级公共交通系统。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) An abbreviation that can mean different things depending on context (e.g., “employee ID badge” in workplaces or other organization-specific terms).","zh":"（较少见）在不同语境中可能代表不同含义的缩写（例如职场中的“员工识别证/工牌”等，或其他机构内部用语）。"},"examples":[{"en":"Please wear your EIB when entering the secure area.","zh":"进入安全区域时请佩戴你的EIB（如工牌/识别证）。"},{"en":"In this company, EIB refers to the employee identification badge.","zh":"在这家公司里，EIB指员工识别证（工牌）。"}]}],"synonyms":["European Investment Bank (full name)"],"phonetic":"/ˌiː aɪ ˈbiː/","extraExplanation":["在新闻、金融或欧盟相关语境里，EIB几乎总是指“European Investment Bank（欧洲投资银行）”。它是欧盟机构体系中的重要“政策性银行”，常与可持续发展、绿色转型、基础设施建设等话题一起出现。","如果你是在某份公司文件、校园通知或内部系统里看到EIB，也可能是组织自定义缩写；此时最好结合上下文或询问发布方确认全称。"]}
{"word":"Eibar","summary":{"en":"Eibar is a town in the Basque Country of northern Spain, and it can also refer to the local football club (SD Eibar).","zh":"Eibar 指西班牙北部巴斯克自治区的城镇“埃瓦尔”，也可指当地足球俱乐部（SD Eibar）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town/municipality in the Basque Country (Gipuzkoa), northern Spain.","zh":"西班牙北部巴斯克自治区（吉普斯夸省）的一个城镇/市镇：埃瓦尔。"},"examples":[{"en":"Eibar is a small industrial town in northern Spain.","zh":"埃瓦尔是西班牙北部一座小型工业城镇。"},{"en":"She took a train from Bilbao to Eibar for a day trip.","zh":"她从毕尔巴鄂坐火车到埃瓦尔进行一日游。"}]},{"partOfSpeech":"n.","definition":{"en":"A Spanish professional football club based in the town of Eibar (commonly called SD Eibar).","zh":"以埃瓦尔为主场的西班牙职业足球俱乐部（常称 SD Eibar，埃瓦尔竞技）。"},"examples":[{"en":"He started following Eibar after their promotion to La Liga.","zh":"他们升入西甲后，他开始关注埃瓦尔队。"},{"en":"Eibar’s home matches are known for a strong local atmosphere.","zh":"埃瓦尔的主场比赛以浓厚的本地氛围著称。"}]}],"synonyms":["SD Eibar"],"phonetic":"/ˈeɪbɑr/","extraExplanation":["“Eibar”是地名（专有名词），通常不加冠词：说“in Eibar / to Eibar”，而不是“in the Eibar”。","埃瓦尔历史上以金属加工与军械/工具制造闻名；当地足球俱乐部常用全名“SD Eibar”（Sociedad Deportiva Eibar）。"]}
{"word":"Eichendorff","summary":{"en":"Eichendorff is the surname of Joseph von Eichendorff, a leading German Romantic poet and novelist.","zh":"Eichendorff 指德国浪漫主义代表作家约瑟夫·冯·艾兴多夫的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) Joseph von Eichendorff (1788–1857), a major German Romantic poet and novelist, known for lyrical poems about nature, wandering, and longing.","zh":"（专有名词）约瑟夫·冯·艾兴多夫（1788–1857），德国浪漫主义重要诗人、小说家，以描写自然、漫游与“乡愁/渴望”情绪的抒情作品闻名。"},"examples":[{"en":"In our literature class, we read Eichendorff’s poems about forests and evening landscapes.","zh":"在文学课上，我们读了艾兴多夫描写森林与暮色风景的诗。"},{"en":"Eichendorff is often discussed alongside other German Romantic writers.","zh":"艾兴多夫常与其他德国浪漫主义作家一起被讨论。"}]}],"synonyms":["Joseph von Eichendorff","Eichendorff (the writer)"],"phonetic":"/ˈaɪkənˌdɔrf/","extraExplanation":["“Eichendorff”是德国姓氏，英语里通常直接当作作者名使用。读作近似“EYE-kuhn-dorf”，但更接近德语原音。","他最常被提到的作品之一是小说《一个无用之人的生涯》（Aus dem Leben eines Taugenichts），主题常涉及“漫游者”（wanderer）式的自由与对世界的诗意感受。","在文化语境中，艾兴多夫代表德国浪漫主义对自然、宗教/精神体验与内心情感的重视；英文评论里常出现词组如 “Eichendorff’s lyricism”（艾兴多夫的抒情性）。"]}
{"word":"Eichhornia","summary":{"en":"Eichhornia is a genus of floating aquatic plants, especially the water hyacinth, often noted for rapid spread and invasiveness.","zh":"Eichhornia 是一种水生漂浮植物属，尤以水葫芦（凤眼莲）著名，常因繁殖迅速、易入侵而被关注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of floating aquatic plants in the pickerelweed family (Pontederiaceae), best known for the water hyacinth, which can spread quickly and become invasive in warm waterways","zh":"一种水生漂浮植物属（雨久花科），最著名的是“水葫芦/凤眼莲”，在温暖水域中常会快速繁殖并成为入侵物种"},"examples":[{"en":"Eichhornia can form thick mats that block sunlight in rivers and lakes.","zh":"Eichhornia 可能形成厚厚的漂浮植物层，阻挡河流和湖泊中的阳光。"},{"en":"In many places, Eichhornia is removed to protect native plants and fish.","zh":"在许多地区，人们会清除 Eichhornia，以保护本地植物和鱼类。"}]}],"synonyms":["water hyacinth (common name; especially for species in this genus)"],"phonetic":"/aɪˈkɔɹniə/","extraExplanation":["“Eichhornia”是植物学中的拉丁化属名，常见发音接近“eye-KORN-ee-uh”。","该属以19世纪普鲁士政治人物约翰·阿尔布雷希特·弗里德里希·冯·艾希霍恩（Johann Albrecht Friedrich von Eichhorn）命名；最知名的成员是凤眼莲（water hyacinth），因观赏性强但繁殖快而常被视为生态管理难题。"]}
{"word":"Eichman","summary":{"en":"Eichman is mainly a surname; it’s often a misspelling of “Eichmann,” especially in historical contexts referring to Adolf Eichmann.","zh":"Eichman 主要是一个姓氏；在历史语境中，它常被当作 “Eichmann” 的误拼，尤其指阿道夫·艾希曼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name). It may also be used to refer to a specific person with that surname.","zh":"一个姓氏（家族名字）；也可用来指代拥有该姓氏的某个特定人物。"},"examples":[{"en":"Is Eichman your last name, or did you mean Eichmann?","zh":"Eichman 是你的姓吗，还是你想说的是 Eichmann？"},{"en":"I saw the name Eichman in an old document.","zh":"我在一份旧文件里看到了 Eichman 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"Sometimes used (often as a misspelling of “Eichmann”) to refer to Adolf Eichmann, a Nazi official historically associated with the Holocaust and known for his postwar trial.","zh":"有时（常被当作对 “Eichmann” 的拼写错误）用来指阿道夫·艾希曼（Adolf Eichmann），一名纳粹官员；在历史上与大屠杀相关，并因战后审判而知名。"},"examples":[{"en":"Many books discuss Eichmann’s trial and its impact on public understanding of the Holocaust.","zh":"许多书讨论了艾希曼的审判，以及它对公众理解大屠杀的影响。"},{"en":"If you’re searching online, try “Eichmann” with two n’s for more accurate results.","zh":"如果你在网上搜索，建议用两个 n 的 “Eichmann”，结果会更准确。"}]}],"phonetic":"/ˈaɪk.mən/","extraExplanation":["“Eichman”在英语语境里通常不是常见词汇，更常见的是拼写为“Eichmann”。如果你是在阅读历史或政治相关材料，很多情况下指的是阿道夫·艾希曼。","文学与思想讨论中，汉娜·阿伦特（Hannah Arendt）在《耶路撒冷的艾希曼》（Eichmann in Jerusalem）里提出“平庸之恶”（the banality of evil）的概念，使“Eichmann”这个名字在英语中常与对官僚体制、责任与道德的讨论联系在一起。"]}
{"word":"Eichmann","summary":{"en":"Eichmann most often refers to Adolf Eichmann, a Nazi SS officer tried for his role in Holocaust deportations.","zh":"Eichmann通常指阿道夫·艾希曼：纳粹党卫队军官，因参与大屠杀相关驱逐行动而受审。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Adolf Eichmann (1906–1962), a Nazi SS officer who helped organize the deportation of Jews during the Holocaust; he was captured by Israel, tried in Jerusalem, and executed.","zh":"阿道夫·艾希曼（1906–1962），纳粹党卫队军官，参与组织对犹太人的大规模驱逐与屠杀（大屠杀/浩劫）相关行动；后被以色列逮捕，在耶路撒冷受审并被处决。"},"examples":[{"en":"The Eichmann trial brought worldwide attention to Holocaust testimony.","zh":"艾希曼审判让世界广泛关注大屠杀幸存者的证词。"},{"en":"In history class, we discussed how Eichmann’s bureaucracy enabled mass deportations.","zh":"在历史课上，我们讨论了艾希曼如何通过官僚系统推动大规模驱逐。"}]},{"partOfSpeech":"n.","definition":{"en":"A German/Jewish surname; in many contexts it refers specifically to Adolf Eichmann.","zh":"一个德语/犹太姓氏；在很多语境中常特指阿道夫·艾希曼。"},"examples":[{"en":"Eichmann is a surname that appears in several historical records.","zh":"艾希曼这个姓氏在一些历史档案中出现过。"}]}],"synonyms":["Nazi official","SS officer"],"phonetic":"/ˈaɪkmən/","extraExplanation":["“Eichmann”常与政治哲学家汉娜·阿伦特（Hannah Arendt）的报道《耶路撒冷的艾希曼》（Eichmann in Jerusalem）联系在一起，她提出“平庸之恶”（the banality of evil）的讨论：普通人可能在服从与官僚流程中参与巨大罪行。","在英文写作里，提到“Eichmann trial（艾希曼审判）”通常是在讨论大屠杀记忆、法律正义、战争罪审判、以及个人责任与体制责任之间的关系。"]}
{"word":"Eichstadt","summary":{"en":"Eichstadt is a Bavarian town in southern Germany (German: Eichstätt).","zh":"Eichstadt指德国南部巴伐利亚的一座城市（德语：Eichstätt）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A town (city) in Bavaria, southern Germany, best known for its baroque architecture and nearby Solnhofen limestone fossil sites. (Often written in German as “Eichstätt.”)","zh":"德国南部巴伐利亚州的一座城市，以巴洛克建筑以及附近索伦霍芬（Solnhofen）石灰岩化石产地闻名。（德语常写作“Eichstätt”。）"},"examples":[{"en":"Eichstadt is a small Bavarian town with a historic center.","zh":"Eichstadt是一座巴伐利亚的小城，有保存良好的历史城区。"},{"en":"We visited Eichstadt on a day trip from Nuremberg.","zh":"我们从纽伦堡出发，当天往返去Eichstadt游玩。"},{"en":"Some travelers go to Eichstadt to learn about fossils found in the region.","zh":"一些旅行者会去Eichstadt了解该地区出土的化石。"}]}],"synonyms":["Eichstätt"],"phonetic":"/ˈaɪkʃtæt/","extraExplanation":["“Eichstadt”常被用来表示德语地名“Eichstätt”的不带变音符号（ä）写法，或是英文环境中的简化拼写。标准德语拼写是Eichstätt。","如果你是在地图、车站或德国官方资料里查找，建议用“Eichstätt”搜索，会更准确。"]}
{"word":"eicosane","summary":{"en":"Eicosane is a 20‑carbon alkane (C20H42) found in petroleum and waxes, mainly used in scientific contexts.","zh":"Eicosane（二十烷）是含20个碳的烷烃（C20H42），常见于石油和蜡中，主要用于科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical substance (an alkane) with 20 carbon atoms, formula C20H42, found in petroleum and some waxes; it is a colorless solid and is used mainly in scientific research and chemical analysis.","zh":"二十烷：一种含有20个碳原子的烷烃，化学式为C20H42，存在于石油和某些蜡中；通常为无色固体，主要用于科研与化学分析。"},"examples":[{"en":"Eicosane (C20H42) is one of the straight-chain alkanes found in crude oil.","zh":"二十烷（C20H42）是原油中常见的直链烷烃之一。"},{"en":"In the lab, eicosane can be used as a reference compound when studying hydrocarbons.","zh":"在实验室中，二十烷可用作研究烃类时的参考物质。"}]}],"synonyms":["n-icosane","normal eicosane","C20H42"],"phonetic":"/ˈaɪkəˌseɪn/","extraExplanation":["“eicos-”来自希腊语，表示“二十”（twenty）；“-ane”是有机化学中烷烃命名的常见后缀。把它们合起来，eicosane 字面意思就是“二十个碳的烷烃”。","在日常英语里 eicosane 很少出现，更多见于化学、材料、石油相关的专业语境。"]}
{"word":"eide","summary":{"en":"“Eide” is most commonly a Norwegian surname; it can also be an acronym, but the exact meaning depends on context.","zh":"“Eide”最常见的用法是挪威姓氏；也可能是缩写，但具体含义需要语境才能确定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), especially common in Norway; also used as a place name or company name in some contexts.","zh":"（姓氏）常见于挪威的姓；在某些语境中也可作地名或公司名。"},"examples":[{"en":"Dr. Eide will speak at the conference tomorrow.","zh":"Eide 医生明天将在会议上发言。"},{"en":"I met someone named Eide while studying in Norway.","zh":"我在挪威留学时认识了一个姓 Eide 的人。"}]},{"partOfSpeech":"other","definition":{"en":"(as an acronym) may stand for different things depending on the field or organization (the meaning is not fixed without context).","zh":"（作缩写）在不同领域/机构中可能代表不同含义；没有语境时无法确定具体指什么。"},"examples":[{"en":"In this document, EIDE refers to a local education program.","zh":"在这份文件中，EIDE 指的是一个地方教育项目。"}]}],"phonetic":"/ˈaɪdi/","extraExplanation":["“Eide”多见于挪威语姓名体系，常被认为与地形/地名有关（例如与地峡、狭窄地带等地貌相关的词源解释在民间较常见）。具体含义会因家族与地区而异。","如果你是在某篇文章、软件界面或学校/公司名称里看到“EIDE”，把出现它的完整句子或上下文发来，我可以帮你判断它在该语境中的确切含义。"]}
{"word":"eident","summary":{"en":"“eident” is not a standard English word; you probably mean “evident” (obvious, clearly seen/understood).","zh":"“eident” 不是标准英语单词；你很可能想写 “evident”（明显的、显而易见的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended word) Clearly seen or understood; obvious.","zh":"（可能想写的词）明显的；显而易见的。"},"examples":[{"en":"It was evident that she was tired after the long trip.","zh":"长途旅行后，她很疲惫，这是显而易见的。"},{"en":"The evidence made his guilt evident to everyone in the room.","zh":"证据让房间里所有人都清楚地看到他有罪。"}]}],"synonyms":["obvious","clear","apparent","plain","manifest"],"phonetic":"/ˈɛvɪdənt/","extraExplanation":["“eident” 不是常见的英语单词，通常是拼写错误。最常见的目标词是 **evident**（明显的）。\n也有人想写 **eidetic**（/aɪˈdɛtɪk/，意为“影像记忆的；过目不忘的”），但它比较少用，多见于心理学语境。"]}
{"word":"eidently","summary":{"en":"Evidently means “apparently/it seems,” used when you infer something from evidence or signs.","zh":"Evidently 表示“看来/似乎/显然”，用于根据证据或迹象进行推断。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Used to show that something seems true based on what you see, hear, or know.)","zh":"（用于表示根据所见、所闻或已知信息推断）显然；看来；似乎。"},"examples":[{"en":"Evidently, the bus is running late again.","zh":"看来公交车又晚点了。"},{"en":"She was evidently upset, but she didn’t say why.","zh":"她显然很难过，但她没有说原因。"},{"en":"He didn’t study much; evidently, he relied on his memory.","zh":"他没怎么复习；显然他依靠记忆。"}]},{"partOfSpeech":"adv.","definition":{"en":"(In some contexts) It is clear and easy to see or understand.","zh":"（在某些语境中）明显地；清楚地（可见/可理解）。"},"examples":[{"en":"The difference is evidently important in this report.","zh":"在这份报告中，这个差异显然很重要。"},{"en":"Her confidence has evidently grown over time.","zh":"随着时间推移，她的自信明显增强了。"}]}],"synonyms":["apparently","seemingly","clearly","obviously"],"phonetic":"/ˈɛvɪdəntli/","extraExplanation":["你输入的“eidently”很可能是拼写错误；正确拼写是 **evidently**（中间有 **v**：e-vi-dent-ly）。","语气上，**evidently** 常用来表达“根据证据/迹象推断”，比 **obviously**（显而易见）更委婉、更像“从情况来看”。"]}
{"word":"eider","summary":{"en":"An eider is a sea duck, and it can also mean the duck’s soft down used for warm bedding or clothing.","zh":"eider 指一种海鸭（绒鸭），也可指其柔软的绒羽（绒鸭绒），用于保暖寝具或衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large sea duck (especially the common eider) known for its very soft down feathers.","zh":"绒鸭（大型海鸭，尤指普通绒鸭），以非常柔软的绒羽闻名。"},"examples":[{"en":"Eiders nest along rocky coasts, using their down to line the nest.","zh":"绒鸭会在岩石海岸筑巢，并用绒羽铺垫巢穴。"},{"en":"Eiderdown is prized for being light, warm, and breathable.","zh":"绒鸭绒因轻、暖、透气而备受珍视。"}]},{"partOfSpeech":"n.","definition":{"en":"Down (soft feathers) taken from an eider, used as a warm filling for quilts or jackets.","zh":"绒鸭绒（取自绒鸭的柔软绒羽），常用作被褥或外套的保暖填充物。"},"examples":[{"en":"The comforter is filled with eider for extra warmth without much weight.","zh":"这条羽绒被填充了绒鸭绒，保暖但不显沉重。"}]}],"synonyms":["sea duck","eider duck","eiderdown"],"phonetic":"/ˈaɪdɚ/","extraExplanation":["“eider”常见于北欧与北大西洋文化语境：一些地区会在不伤害鸟类的前提下收集绒鸭离巢后留下的绒羽（可持续采集），因此“eiderdown（绒鸭绒）”常带有高端、天然、珍贵的联想。","拼写提示：eider / eiderdown（常写作一个词）。“down”在这里指“绒羽/羽绒”，不是“向下”。"]}
{"word":"eiderdown","summary":{"en":"Eiderdown is the very soft down from eider ducks, and by extension a warm down-filled quilt/duvet.","zh":"Eiderdown 指绒鸭的羽绒，也可引申指羽绒被/厚软保暖的被子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Soft feathers (down) from the eider duck, traditionally used as a very warm filling for bedding.","zh":"（绒鸭的）羽绒；常用作被褥等寝具的保暖填充物。"},"examples":[{"en":"The quilt was filled with eiderdown, so it stayed warm even in winter.","zh":"这条被子填充了绒鸭羽绒，所以即使在冬天也很保暖。"},{"en":"Eiderdown is prized for being light, soft, and insulating.","zh":"绒鸭羽绒因轻、软、保暖性强而很受珍视。"}]},{"partOfSpeech":"n.","definition":{"en":"A duvet or quilt filled with soft down; a warm, fluffy cover for a bed.","zh":"羽绒被；（填充羽绒的）厚软保暖被子。"},"examples":[{"en":"She pulled the eiderdown up to her chin and fell asleep.","zh":"她把羽绒被拉到下巴处，很快睡着了。"},{"en":"In older British usage, “eiderdown” can mean a thick, down-filled bedcover.","zh":"在较早的英式用法中，eiderdown 可指厚厚的羽绒被。"}]}],"synonyms":["down","duvet","quilt","comforter","featherbed"],"phonetic":"/ˈaɪdərˌdaʊn/","extraExplanation":["“Eider”指“绒鸭”（一种海鸭），其羽绒以极佳的保暖性闻名。传统上，人们会收集绒鸭在巢中自然脱落的羽绒；在一些地区，这类采集方式也被视为较为温和、可持续的做法。","词形上可拆成 eider + down（羽绒）。在现代英语里，人们更常用“down”或“duvet”，但“eiderdown”带有更传统、文学化或强调高品质羽绒的语感。"]}
{"word":"eiderdowns","summary":{"en":"“Eiderdowns” means thick, warm down-filled quilts/comforters (plural of eiderdown).","zh":"“eiderdowns”指厚实保暖的羽绒被/厚被（eiderdown 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick, warm quilt or comforter (often filled with down feathers).","zh":"厚实保暖的羽绒被／被芯（常用羽绒填充）。"},"examples":[{"en":"It gets cold at night, so we sleep under two eiderdowns.","zh":"夜里很冷，所以我们盖两床羽绒被。"},{"en":"She packed an eiderdown for the winter trip.","zh":"她为冬季旅行带了一床羽绒被。"}]}],"synonyms":["comforters","down comforters","quilts","duvets"],"phonetic":"/ˈaɪdɚˌdaʊn/","extraExplanation":["“Eiderdown”原指绒鸭（eider duck）的柔软羽绒，传统上用来填充被褥，因而词义延伸为“羽绒被/厚被”。现代产品不一定真用绒鸭羽绒，也可能是其他羽绒或化纤填充。","“Eiderdowns”是复数形式；在英式英语里更常见作“羽绒被/厚被”的说法。美式英语里更常用“comforter”或“down comforter”。"]}
{"word":"eiders","summary":{"en":"“Eiders” is the plural of “eider,” a sea duck famous for its soft down used for warmth.","zh":"“eiders”是“eider（绒鸭）”的复数，绒鸭以柔软的绒羽闻名，常用于保暖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sea ducks (especially eider ducks) known for their very soft down feathers, often used for warm bedding or clothing.","zh":"绒鸭（一类海鸭，尤指“绒鸭属”），以极柔软的绒羽著名，常用于保暖寝具或衣物。"},"examples":[{"en":"Eiders live in cold coastal areas and have thick, insulating feathers.","zh":"绒鸭生活在寒冷的海岸地区，羽毛厚实，保暖性很强。"},{"en":"Eiderdown from eiders has been prized for making very warm quilts.","zh":"来自绒鸭的绒羽（eiderdown）因可制作非常保暖的被子而备受珍视。"}]}],"synonyms":["sea ducks","eider ducks"],"phonetic":"/ˈaɪdɚz/","extraExplanation":["“eiders”是“eider”的复数形式。eider（绒鸭）常见于北大西洋与北极附近海域与海岸。","你可能会在“eiderdown（绒鸭绒）”这个词里看到它：指绒鸭的绒羽，也可指用这种绒羽填充的被褥（如被子、枕头）。在英语中它常与“warmth/insulation（保暖/隔热）”等词一起出现。"]}
{"word":"eidetic","summary":{"en":"Eidetic means having or relating to extremely vivid, detailed mental images—often used in the phrase “eidetic memory.”","zh":"Eidetic 指与极其清晰、细节丰富的心理影像有关，常用于短语“eidetic memory（影像/照相式记忆）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an extremely clear, detailed mental image that remains in the mind after you stop seeing something (often called “eidetic memory”).","zh":"（与）极其清晰、细节丰富的心理影像有关；即使不再看见事物，脑中仍能保留清晰画面（常说“照相式记忆/影像记忆”）。"},"examples":[{"en":"She has an eidetic memory and can recall pages of text after reading them once.","zh":"她有影像记忆，看过一遍就能回忆起整页文字。"},{"en":"The witness described the suspect with eidetic precision.","zh":"证人以近乎影像般的精准度描述了嫌疑人。"}]},{"partOfSpeech":"adj.","definition":{"en":"In psychology, relating to an “eidetic image,” a vivid mental picture that can feel almost like still seeing the object.","zh":"（心理学）与“影像/映像（eidetic image）”有关：一种非常生动的心理画面，感觉几乎像仍在看着该物体。"},"examples":[{"en":"Some children report eidetic images for a short time after looking at a picture.","zh":"有些儿童在看过图片后短时间内会报告出现影像画面。"},{"en":"Researchers debate how common truly eidetic imagery is in adults.","zh":"研究者们争论成年人中真正的影像表象到底有多普遍。"}]}],"synonyms":["photographic (informal)","vivid","image-based","visual"],"phonetic":"/aɪˈdɛtɪk/","extraExplanation":["“Eidetic”来自希腊语 *eidos*，意思是“形象/形式”。日常英语里常搭配：**eidetic memory**（影像记忆/照相式记忆）。","科普语境中“照相式记忆”常被夸张使用；在心理学研究里，严格意义的“eidetic imagery”是否等同于人们想象的“完全像照片一样记住一切”，一直有争议。"]}
{"word":"eidetically","summary":{"en":"“Eidetically” means “in a way that involves extremely vivid, picture-like mental images or memory.”","zh":"“eidetically”表示“以极其生动、如同画面般的心理图像或记忆方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to unusually vivid and accurate mental images (especially memory that feels like seeing the image again).","zh":"以（近乎）“照相记忆/形象记忆”的方式；指与异常清晰、准确的心理图像有关（尤指仿佛再次看见的记忆）。"},"examples":[{"en":"She could describe the painting eidetically, including tiny cracks in the paint.","zh":"她能以近乎形象记忆的方式描述那幅画，连颜料上的细小裂纹都说得出来。"},{"en":"He doesn’t just remember the map—he recalls it eidetically.","zh":"他不只是记得那张地图——而是以形象记忆般的方式把它回想起来。"}]}],"synonyms":["vividly","with vivid imagery","in a picture-like way"],"phonetic":"/aɪˈdɛtɪkli/","extraExplanation":["“eidetically”来自“eidetic”（形象记忆的）。在日常英语里更常见的是形容词“eidetic memory”（形象记忆/照相记忆），副词“eidetically”比较书面或学术，常用于心理学、认知科学等语境。","注意：大众常说的“photographic memory（照相记忆）”在科学上争议较多；“eidetic”更偏向描述一种非常生动的视觉表象或回忆能力，而不一定意味着完美无误。","常见搭配：recall/remember eidetically（以形象记忆般地回想）；describe eidetically（描述得像在看见画面一样）。"]}
{"word":"eidograph","summary":{"en":"An eidograph is a (now uncommon) device for tracing and copying drawings, often to change their size.","zh":"eidograph 指一种（如今不常见的）描摹复制绘图的仪器，常用于按比例放大或缩小图稿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drawing instrument used to copy, reduce, or enlarge a picture or plan by tracing it (similar to a pantograph).","zh":"一种制图/绘图仪器，用来通过描摹复制图像或图纸，并可按比例缩小或放大（类似“缩放描图器”pantograph）。"},"examples":[{"en":"The museum displayed an old eidograph used for copying architectural plans.","zh":"博物馆里展示了一台旧式的 eidograph，用来复制建筑图纸。"},{"en":"Before photocopiers, an eidograph helped draftsmen reproduce drawings at different scales.","zh":"在复印机出现之前，eidograph 能帮助制图员按不同比例复制图稿。"}]}],"synonyms":["pantograph","copying instrument","drafting tool"],"phonetic":"/ˈaɪdəˌɡræf/","extraExplanation":["“eidograph”较为罕见，多见于历史性的工程制图与仪器语境。","词源上可拆为 eido-（形象/外观）+ -graph（书写/描绘），整体含义与“描绘出形状的器具”相关。与更常见的 pantograph（缩放描图器）意义接近。"]}
{"word":"eidola","summary":{"en":"Eidola means “phantom-like images” or “idealized appearances,” often used in literary or philosophical writing; it is the plural of eidolon.","zh":"Eidola 指“幻影般的影像／理想化的表象”，多用于文学或哲学语境；是 eidolon 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Phantoms or idealized images—often meaning the “forms” or mental pictures of things rather than the things themselves (plural of eidolon).","zh":"幻影；理想化的影像／形象——常指事物的“形相”或心中的影像，而非事物本身（eidolon 的复数）。"},"examples":[{"en":"In the poem, the dead return as eidola—beautiful images that cannot be touched.","zh":"在这首诗里，死者以 eidola 的形式归来——美丽却无法触碰的影像。"},{"en":"He chased the eidola of success and ignored the real work in front of him.","zh":"他追逐成功的幻影，却忽视了眼前真正要做的事。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy or literary criticism, image-like “copies” or appearances that stand between the mind and reality.","zh":"（哲学／文学批评）介于心智与现实之间的“影像式副本”或表象。"},"examples":[{"en":"The essay argues that what we perceive are eidola, not reality itself.","zh":"这篇文章主张：我们感知到的是 eidola，而不是现实本身。"},{"en":"Her writing questions whether memory preserves facts or only eidola.","zh":"她的写作追问：记忆保存的是事实，还是仅仅是影像。"}]}],"synonyms":["phantoms","apparitions","images","illusions","specters","shadows"],"phonetic":"/aɪˈdoʊlə/","extraExplanation":["“eidola”来自希腊语：eidolon（εἴδωλον，意为“形象、偶像、幽影”）的复数。英语里更常见的是单数“eidolon”和更普通的词如“phantoms / illusions / images”。“eidola”带有更文学化、哲学化的气质。","在诗歌语境中，它常用来表达“看似真实却不可触及的存在”（如回忆、理想、逝者的影子）。例如美国诗人华莱士·史蒂文斯（Wallace Stevens）有诗名为《The Idea of Order at Key West》，其相关批评与“eidolon/eidola（影像）”概念常被并提。"]}
{"word":"eidolic","summary":{"en":"Eidolic means “related to an ideal form or essential image,” mainly used in philosophical or artistic contexts.","zh":"eidolic 指“与理想形式/本质形象有关”，多用于哲学或艺术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an ideal “form” or archetype (an eidos), especially in philosophy; pertaining to the essential image or pattern of something.","zh":"（尤指哲学中）与“本质形式/理念”（eidos）有关的；指事物的本质形象或原型。"},"examples":[{"en":"Plato’s discussions of beauty can be read as an eidolic search for the perfect form behind imperfect things.","zh":"柏拉图关于“美”的讨论可以理解为一种对不完美事物背后“完美形式”的 eidolic 探寻。"},{"en":"The artist wasn’t copying reality; she was trying to capture an eidolic version of the city.","zh":"这位艺术家并不是在复制现实；她想捕捉的是这座城市的“理念化/原型化”版本。"}]}],"synonyms":["ideal","archetypal","platonic","form-related","eidetic"],"phonetic":"/aɪˈdɑlɪk/","extraExplanation":["“Eidolic”源自希腊语词根 eidos（意为“形状、形象、形式”），常出现在哲学与美学语境中，强调“背后的本质形式”而非表面细节。","这个词较少见；日常英语里更常用的是 “ideal”（理想的）或 “archetypal”（原型的）。在某些学术语境中也会与 “eidetic”（意象的/本质直观的）并列出现，但两者不完全等同。"]}
{"word":"eidolism","summary":{"en":"Eidolism is a rare term, mainly used in philosophy, for the view that perception happens through “eidola” (images/phantoms) rather than direct contact with objects.","zh":"Eidolism 是一个较罕见的词，主要见于哲学语境，指认为知觉是通过“eidola（影像/幻形）”而非直接接触事物本身而发生的观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophical idea that what we perceive are “eidola” (images/phantoms/simulacra)—often described as thin films or likenesses given off by objects—rather than the objects directly.","zh":"（哲学）“影像说/幻像说”：认为我们感知到的是事物发出的“影像/幻形（eidola）”，而不是事物本身。"},"examples":[{"en":"In some ancient atomist writings, eidolism explains perception as contact with images that stream from objects.","zh":"在一些古代原子论者的著作中，eidolism 用“影像从物体流出并与我们接触”来解释知觉。"},{"en":"The professor contrasted direct realism with eidolism to show different theories of perception.","zh":"教授把“直接实在论”和 eidolism 作对比，以展示不同的知觉理论。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly (rare): a tendency to treat mental images or idealized pictures as more real or important than actual reality.","zh":"（更宽泛、较少用）把心中的图像或理想化画面看得比现实更真实或更重要的倾向。"},"examples":[{"en":"His travel plans were driven by eidolism—the perfect picture mattered more than the place itself.","zh":"他的旅行计划被 eidolism 推动：完美的想象画面比地点本身更重要。"},{"en":"The novel critiques eidolism by showing how fantasies can replace genuine relationships.","zh":"这部小说通过展示幻想如何取代真实关系来批评 eidolism。"}]}],"synonyms":["image theory (of perception)","simulacrum theory","eidola theory"],"phonetic":"/aɪˈdoʊlɪzəm/","extraExplanation":["词源来自希腊语 eidolon，意为“形象、影像、幻影”。在古希腊原子论（如德谟克利特、伊壁鸠鲁）及罗马诗人卢克莱修的相关传统中，常用 eidola 指“从物体表面剥离出来的极薄影像”，用来解释视觉与梦境。","这是非常罕见的词，在现代英语中更常见的表达是 image theory of perception（知觉的影像理论）或 simulacrum（拟像/仿像）相关说法；写作或学术语境中使用更合适。"]}
{"word":"eidology","summary":{"en":"Eidology is a rare noun meaning the study of essences/forms (philosophy) or, less commonly, the study of mental images.","zh":"Eidology 是个很少见的名词，指对本质/形式的研究（哲学中常见），较少情况下也指对心理意象的研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The study of forms, essences, or “ideas” (especially in philosophy), often referring to analyzing what makes something what it is.","zh":"（罕用）对“形式 / 本质 / 观念”的研究（尤用于哲学语境），常指分析某物之所以为某物的根本特性。"},"examples":[{"en":"In some philosophical writing, eidology focuses on describing the essence of experience.","zh":"在一些哲学写作中，eidology 关注描述经验的本质。"},{"en":"The author uses eidology to ask what makes a promise a promise.","zh":"作者用 eidology 来追问：是什么让“承诺”成为承诺。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The study of mental images or idealized representations; a term sometimes connected to discussions of imagery and perception.","zh":"（罕用）对心理意象或理想化表象的研究；有时用于与想象、知觉相关的讨论。"},"examples":[{"en":"Her paper links eidology to how readers build vivid images while reading.","zh":"她的论文把 eidology 与读者阅读时如何形成生动意象联系起来。"},{"en":"He treated eidology as a way to talk about inner pictures without calling them “hallucinations.”","zh":"他把 eidology 当作一种谈论“内在图像”的方式，而不把它们称为“幻觉”。"}]}],"synonyms":["study of essences","essence analysis","eidos study","phenomenological analysis","imagery study"],"phonetic":"/aɪˈdɑlədʒi/","extraExplanation":["词源上常追溯到希腊语 eidos（形相、形态、理念）。在现象学（如胡塞尔相关讨论）中，它可能指向对“本质（essence）”的分析，这类方法有时也被称为“本质直观/本质分析”。","该词在现代英语里非常少见，实际写作中更常用的相关词是 eidetic（“意象的/本质的”）或 phenomenology（现象学）。如果你在学术文本中看到 eidology，通常需要结合作者的学派与上下文来确定是“本质研究”还是“意象研究”。"]}
{"word":"eidolology","summary":{"en":"Eidolology is a rare word meaning the study or theory of images (eidola) or ideal forms, often in philosophical or psychological contexts.","zh":"Eidolology 是个罕见词，指对意象（eidola）或理想形式的研究/理论，常见于哲学或心理学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The study or theory of images, “eidola” (phantoms/mental pictures), or ideal forms—especially in philosophy or psychology.","zh":"（罕见）研究或探讨“意象／幻影”（eidola）或理想形式的学说，常见于哲学或心理学语境。"},"examples":[{"en":"In some older philosophical writing, eidolology refers to the study of how images in the mind shape what we believe.","zh":"在一些较早的哲学著作中，eidolology 指研究心中意象如何影响我们的信念。"},{"en":"Her essay connects memory and eidolology, arguing that recollection is built from inner pictures rather than exact records.","zh":"她的文章把记忆与 eidolology 联系起来，认为回忆是由内在图像构成的，而非精确记录。"}]}],"synonyms":["eidology","iconology","the study of mental imagery"],"phonetic":"/aɪˌdɑləˈlɑdʒi/","extraExplanation":["这个词非常少见，很多情况下你会看到更常用的拼写 **eidology**（同样源自希腊语）。词根通常分析为 **eidolon**（意象、影像、幻影）+ **-logy**（学科、研究）。","在现代英语里，如果你想表达“对观念/表象的研究”，更常见的替代表达包括 **the study of mental imagery**（心理意象研究）、**iconology**（图像学，偏艺术史）、或在哲学中更常见的 **phenomenology**（现象学，研究经验如何呈现）。","由于用法不稳定，写作中若要使用，建议在第一次出现时用一句话解释你指的具体含义。"]}
{"word":"eidolon","summary":{"en":"Eidolon means a ghostly or idealized image—something that appears real but is more like a phantom, memory, or symbolic form.","zh":"Eidolon 指幽灵般或理想化的“形象/表象”——看似真实，却更像幻影、记忆或象征性形态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A phantom or idealized image of someone or something; a ghostly figure or a perfect (often haunting) mental picture.","zh":"（某人/某物的）幽灵般的显现或理想化的形象；一种（常带阴影感的）完美心像/幻象。"},"examples":[{"en":"In the fog, the old lighthouse looked like an eidolon from another century.","zh":"在雾中，那座老灯塔看起来像是来自另一个世纪的幽影。"},{"en":"To her, his memory was an eidolon—beautiful, but impossible to touch.","zh":"对她来说，他的记忆是一种幻影——美丽，却无法触及。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy/literature, an image or “shadow-form” that represents an underlying reality or idea rather than the thing itself.","zh":"（哲学/文学）指作为“影像/表象”的形态，用来代表更深层的真实或观念，而非事物本身。"},"examples":[{"en":"The poem treats the self as an eidolon—an image that shifts with time.","zh":"这首诗把“自我”写成一种表象之影——会随时间而变化的形象。"},{"en":"He argued that fame is only an eidolon of real achievement.","zh":"他认为名声只是真实成就的一个表象。"}]}],"synonyms":["phantom","apparition","specter","image","ideal","illusion"],"phonetic":"/aɪˈdoʊlən/","extraExplanation":["词源来自希腊语 *eidōlon*，与“eidos（形象/形式）”同源，所以它常带有“形象、表象、幻影”的意味。","在文学语境里，*eidolon* 常用来营造一种“像真实却又不真实”的气氛：既可能是幽灵/幻觉，也可能是被美化过的记忆或理想化的投影。","阅读提示：它比常见的 *ghost* 更强调“形象/投影/表象”，比 *ideal* 更带一点“虚幻、不可触及”的感觉。"]}
{"word":"eidolons","summary":{"en":"“Eidolons” are ghostlike images or idealized mental figures (plural of “eidolon”).","zh":"“Eidolons”指幽灵般的幻影或理想化的心象（为“eidolon”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “eidolon”) an image or figure that seems ghostlike or unreal; a phantom or apparition.","zh":"（“eidolon”的复数）看似幽灵般、不真实的形象；幻影；幽魂般的显现。"},"examples":[{"en":"In the fog, the trees looked like eidolons rising from the river.","zh":"在雾中，树木像从河面升起的幻影。"},{"en":"The poem fills the empty house with eidolons of the past.","zh":"这首诗让空屋里充满了往昔的幻影。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) idealized images of people or things that exist mainly in the mind—memory-figures or “perfect” versions.","zh":"（较少见）存在于心中的理想化形象——记忆中的影像或“完美版本”。"},"examples":[{"en":"Over time, her memories became eidolons rather than accurate portraits.","zh":"随着时间推移，她的记忆变成了理想化的影像，而不再是准确的写照。"},{"en":"He chased eidolons of success instead of making concrete plans.","zh":"他追逐的是成功的理想幻象，而不是制定具体计划。"}]}],"synonyms":["phantoms","apparitions","specters","visions","shadows","illusions"],"phonetic":"/aɪˈdoʊlənz/","extraExplanation":["词源来自希腊语 eidōlon，意为“形象、影子、幻象”。在英语里常见于文学、诗歌与哲学语境，用来营造“幽灵般的影像”“记忆的残影”或“理想化的投影”等氛围。","用法提示：eidolon 是单数，eidolons 是复数；日常口语不常用，更偏书面与文艺表达。"]}
{"word":"eidoptometry","summary":{"en":"“eidoptometry” is not a standard word; you probably mean “optometry,” the profession of eye and vision care (eye exams and prescriptions for glasses/contacts).","zh":"“eidoptometry”不是标准词；你可能想说“optometry（视光/验光学）”，指眼睛与视力保健（检查视力并开具眼镜/隐形处方）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely a misspelling) The correct word is usually “optometry,” the health profession that examines eyes and vision, prescribes glasses or contact lenses, and helps manage some eye conditions.","zh":"（可能是拼写错误）常见的正确词是“optometry（验光学/视光学）”，指检查眼睛与视力、开具眼镜或隐形眼镜处方，并协助处理部分眼部问题的健康专业。"},"examples":[{"en":"I have an optometry appointment to update my glasses prescription.","zh":"我约了视光/验光门诊，准备更新眼镜处方。"},{"en":"She is studying optometry and wants to work in a clinic.","zh":"她在学视光/验光学，想在诊所工作。"}]}],"synonyms":["vision care","eye care (general)","eye examination (related)"],"phonetic":"/ɑpˈtɑmətri/","extraExplanation":["“eidoptometry”不是常见英文单词；很多学习者会把“eye + optometry”写在一起或误拼。常用表达有：optometry（视光/验光学），eye exam（眼科/视力检查），optometrist（验光师/视光师）。\n在美国语境中：optometrist 主要做视力检查并配镜/隐形；ophthalmologist（眼科医生）是医学博士，可做手术；optician（配镜师）主要负责制作和调整眼镜。"]}
{"word":"eidos","summary":{"en":"Eidos means an ideal Form/essence (in philosophy), or more generally a distinctive, recognizable look or style.","zh":"Eidos 指（哲学中）理念/形式的完美本质，也可泛指某物独特、可辨认的外观或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, especially Plato) the ideal “Form” of something—its perfect, unchanging essence, as opposed to the imperfect things we see in the physical world.","zh":"（哲学，尤指柏拉图）“理念/形式”（Form）：某物完美且不变的本质，与现实世界中不完美、会变化的具体事物相对。"},"examples":[{"en":"In Plato’s philosophy, the eidos of a circle is perfectly round, even if drawn circles are not.","zh":"在柏拉图哲学中，圆的 eidos 是“完美的圆”，即使我们画出来的圆并不完美。"},{"en":"She argued that justice has an eidos that goes beyond any single law.","zh":"她认为“正义”有一种超越任何单一法律的 eidos（理念本质）。"}]},{"partOfSpeech":"n.","definition":{"en":"a characteristic look, form, or style that makes a person, place, or thing recognizable.","zh":"（较少见）某人或某物典型的外观、形态或风格；使其易于辨认的特征。"},"examples":[{"en":"The designer kept the brand’s eidos while updating the colors and materials.","zh":"设计师在更新颜色和材质的同时，保留了品牌的 eidos（标志性风格）。"},{"en":"The film captures the eidos of the city—busy streets, bright signs, and late-night diners.","zh":"这部电影抓住了这座城市的 eidos——繁忙街道、霓虹招牌和深夜餐馆。"}]}],"synonyms":["form","essence","idea","archetype","ideal","characteristic style"],"phonetic":"/ˈaɪdoʊs/","extraExplanation":["Eidos 源自希腊语，原意与“看见/外观”有关（可理解为“所见到的形态/样子”）。在柏拉图传统里，它常与“Form（理念/形式）”对应：具体事物会变化、会损坏，但 eidos 被认为是恒定而完美的“原型”。","在现代写作中，eidos 多出现在哲学、文论或人类学语境里；日常英语更常用 idea、form、essence、characteristic style 等词来表达相近意思。"]}
{"word":"eidouranion","summary":{"en":"A rare poetic word meaning an ideal, heavenly image or vision.","zh":"一个罕见的诗性词，指理想化、天国般的形象或幻象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, poetic) A heavenly or idealized image; a vision of something perfect or celestial.","zh":"（罕见，诗性用语）天上的/理想化的形象；完美或带有神圣感的“天国幻象”。"},"examples":[{"en":"In the poem, the city becomes an eidouranion—more dream than history.","zh":"在这首诗里，那座城市成了一个“eidouranion”——更像梦境而非历史。"},{"en":"She chased an eidouranion of love that no real person could fully match.","zh":"她追逐的是一种理想化的爱情幻象，现实中的任何人都很难完全符合。"}]}],"synonyms":["ideal","vision","celestial image","heavenly vision","idealized image"],"phonetic":"/ˌaɪdoʊˈreɪniən/","extraExplanation":["这个词非常冷僻，多见于文学/诗歌语境，常用来表达“带有宗教或超越现实色彩的理想之像”。","词源上可理解为由希腊语元素构成：eido-（与“形象/形式、可见之相”相关）+ -ouranion（与“天空/天国、神圣的”相关），整体语感接近“天国之像/理型之像”。","现代日常英语几乎不用；写作中若想更自然，可用 ideal、vision、celestial image、heavenly vision 等替代。"]}
{"word":"Eidson","summary":{"en":"“Eidson” is a family name (surname).","zh":"“Eidson” 是一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Dr. Eidson will speak at the conference tomorrow.","zh":"Eidson 博士明天将在会议上发言。"},{"en":"I met someone named Eidson at the library.","zh":"我在图书馆遇到一个姓 Eidson 的人。"}]}],"phonetic":"/ˈaɪdsən/","extraExplanation":["Eidson 通常作为英语世界中的姓氏使用，并不是常见的日常词汇；在正式写作中一般首字母大写。","从拼写看，Eidson 可能与一些以 -son（“……之子”）结尾的英语姓氏模式相似，但具体家族来源需要结合个人或家谱资料确认。"]}
{"word":"Eielson","summary":{"en":"Eielson is a proper name, most often referring to Eielson Air Force Base in Alaska, and it is also a surname associated with aviator Carl Ben Eielson.","zh":"Eielson 是专有名词，最常见指阿拉斯加的艾尔森空军基地；也可作姓氏，常与飞行员卡尔·本·艾尔森相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A proper name, most commonly referring to Eielson Air Force Base, a U.S. Air Force base near Fairbanks, Alaska.","zh":"专有名词，最常见指美国空军的艾尔森空军基地（Eielson Air Force Base），位于阿拉斯加费尔班克斯附近。"},"examples":[{"en":"She was stationed at Eielson for three years.","zh":"她在艾尔森基地驻扎了三年。"},{"en":"The flight diverted to Eielson because of severe weather.","zh":"由于恶劣天气，这趟航班改降到艾尔森。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname, especially known from Carl Ben Eielson (1897–1929), an American aviator and Arctic pilot.","zh":"姓氏；尤其因美国飞行员与北极航线飞行先驱卡尔·本·艾尔森（1897–1929）而为人所知。"},"examples":[{"en":"Eielson is remembered for pioneering flights in the Arctic.","zh":"人们纪念艾尔森在北极地区的开创性飞行。"},{"en":"The base was named after Eielson.","zh":"这座基地以艾尔森的名字命名。"}]}],"synonyms":["Eielson Air Force Base","Eielson AFB"],"phonetic":"/ˈaɪəlsən/","extraExplanation":["“Eielson”在英语里通常读作 /ˈaɪəlsən/，属于人名/地名音译时常见的重音模式：EI-EL-son。","艾尔森空军基地以飞行员Carl Ben Eielson命名；在美国军事与阿拉斯加相关语境中，这个名字出现频率较高。"]}
{"word":"Eifel","summary":{"en":"Eifel: a hilly, partly volcanic region/low mountain range in western Germany.","zh":"Eifel：德国西部的丘陵低山区，部分为火山地貌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hilly, partly volcanic region (and low mountain range) in western Germany, mainly in the states of Rhineland-Palatinate and North Rhine–Westphalia.","zh":"德国西部的艾费尔地区（低山丘陵地带），部分为火山地貌，主要位于莱茵兰-普法尔茨州和北莱茵-威斯特法伦州。"},"examples":[{"en":"We spent a weekend hiking in the Eifel and visiting small villages.","zh":"我们在艾费尔地区周末徒步，还参观了几个小村庄。"},{"en":"The Eifel is known for its volcanic lakes and scenic trails.","zh":"艾费尔以火山湖和风景优美的步道而闻名。"}]}],"synonyms":["Eifel Mountains","Eifel region"],"phonetic":"/ˈaɪfəl/","extraExplanation":["“Eifel”是专有名词，英语里通常直接用德语拼写，不加冠词或复数：in the Eifel（在艾费尔地区）。","艾费尔有著名的“马尔湖（maar）”，即火山口形成的湖泊；在旅游语境中常与徒步、自然公园、温泉小镇等一起出现。"]}
{"word":"Eiffel","summary":{"en":"Eiffel is a French surname, most famously connected to Gustave Eiffel and the Eiffel Tower in Paris.","zh":"Eiffel 是一个法国姓氏，最著名的关联是古斯塔夫·埃菲尔以及巴黎的埃菲尔铁塔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A famous French surname, best known from Gustave Eiffel (1832–1923), the engineer associated with the Eiffel Tower in Paris.","zh":"（专有名词）一个著名的法国姓氏，最广为人知的是工程师古斯塔夫·埃菲尔（Gustave Eiffel，1832–1923），他与巴黎的埃菲尔铁塔有关。"},"examples":[{"en":"Gustave Eiffel helped design and build major metal structures in France and beyond.","zh":"古斯塔夫·埃菲尔参与设计并建造了法国及其他地区的重要金属建筑。"},{"en":"Many people associate the name Eiffel with the Eiffel Tower in Paris.","zh":"很多人把“Eiffel”这个名字和巴黎的埃菲尔铁塔联系在一起。"}]}],"synonyms":["the Eiffel Tower (related phrase)","Gustave Eiffel (related name)"],"phonetic":"ˈaɪfəl","extraExplanation":["“Eiffel”常被当作“埃菲尔铁塔（the Eiffel Tower）”的简称来理解，但严格说它本身是姓氏。英语里大写 E 表示专有名词。","相关文化常识：埃菲尔铁塔建于1889年巴黎世界博览会（World’s Fair）期间，后来成为巴黎乃至法国的象征。"]}
{"word":"Eiffle","summary":{"en":"“Eiffel” is a French name most commonly seen in “the Eiffel Tower.”","zh":"“Eiffel”是法国姓氏，英语里最常见于“the Eiffel Tower（埃菲尔铁塔）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a French surname, best known from the Eiffel Tower in Paris (named after engineer Gustave Eiffel).","zh":"法国姓氏；因巴黎的“埃菲尔铁塔”（以工程师古斯塔夫·埃菲尔命名）而最为人熟知。"},"examples":[{"en":"The Eiffel Tower is one of the most famous landmarks in the world.","zh":"埃菲尔铁塔是世界上最著名的地标之一。"},{"en":"Gustave Eiffel helped design metal structures in the 1800s.","zh":"古斯塔夫·埃菲尔在19世纪参与设计金属结构。"}]}],"phonetic":"/ˈaɪfəl/","extraExplanation":["你写的 **Eiffle** 通常是拼写错误；更常见、标准的拼法是 **Eiffel**（如 *Eiffel Tower*）。","“Eiffel”在英语里一般作为专有名词使用，常见搭配是 **the Eiffel Tower**（埃菲尔铁塔）。"]}
{"word":"eigen","summary":{"en":"“Eigen” is a math/physics term (usually in compounds) meaning “intrinsic/characteristic to itself,” as in eigenvalue and eigenvector.","zh":"“eigen”多用于数学/物理合成词，表示“本征的/固有的/自身特征的”，如特征值、特征向量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(used in math/physics, usually in compounds) relating to an object’s own characteristic property, especially an eigenvalue or eigenvector.","zh":"（多用于数学/物理的合成词中）表示“自身的/本征的/特征的”，尤指特征值（eigenvalue）或特征向量（eigenvector）。"},"examples":[{"en":"To solve the system, we found the matrix’s eigenvalues first.","zh":"为了解这个系统，我们先求出了矩阵的特征值。"},{"en":"An eigenvector keeps its direction after a linear transformation, changing only by a scale factor.","zh":"特征向量在线性变换后方向保持不变，只会按比例缩放。"},{"en":"In quantum mechanics, energy levels can be described using eigenstates.","zh":"在量子力学中，能级可以用本征态来描述。"}]}],"synonyms":["intrinsic","characteristic","inherent"],"phonetic":"/ˈaɪɡən/","extraExplanation":["“eigen-”源自德语 eigen，意思是“自己的、固有的”。英语里通常不单独当作普通形容词使用，而是作为前缀出现在术语中：eigenvalue（特征值/本征值）、eigenvector（特征向量/本征向量）、eigenstate（本征态）。","读音常见为美式 /ˈaɪɡən/（类似“EYE-gən”）。","直观理解：eigenvalue/eigenvector 描述的是一个线性变换的“内部特性”——某些方向（特征向量）在变换后不会“转向”，只会被拉伸或压缩（拉伸倍数就是特征值）。"]}
{"word":"eigenfrequency","summary":{"en":"An eigenfrequency is the natural (built-in) frequency at which an object or system vibrates.","zh":"eigenfrequency 指物体或系统的固有（内在）振动频率。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the natural frequency at which a system tends to vibrate when it is disturbed (also called a natural frequency)","zh":"（系统受扰动后）倾向于自行振动的固有频率（也叫自然频率）"},"examples":[{"en":"Every guitar string has its own eigenfrequency, which determines the pitch you hear.","zh":"每根吉他弦都有自己的固有频率，它决定了你听到的音高。"},{"en":"If the forcing frequency matches the eigenfrequency, the vibration can become very strong.","zh":"如果外加频率与固有频率一致，振动可能会变得非常强烈。"},{"en":"Engineers test a bridge’s eigenfrequencies to reduce the risk of dangerous resonance.","zh":"工程师会测试桥梁的固有频率，以降低危险共振的风险。"}]}],"synonyms":["natural frequency","resonant frequency"],"phonetic":"/ˈaɪɡənˌfriːkwənsi/","extraExplanation":["“eigen-”来自德语，意思是“自身的、固有的”。因此 eigenfrequency 字面上就是“自身的频率”。在物理和工程里常与 eigenmode（固有振型/特征模态）、eigenvalue（特征值）一起出现。","在日常英语里更常说 natural frequency；在学术论文、信号处理、结构动力学等语境中更常用 eigenfrequency。"]}
{"word":"eigenfunction","summary":{"en":"An eigenfunction is a function that keeps its shape under a given operator, changing only by a constant factor (the eigenvalue).","zh":"特征函数是在某个算子作用下“形状不变”、只会乘上一个常数（特征值）的函数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics/Physics) A special function that, after a particular operation (a linear operator) is applied to it, becomes the same function multiplied by a constant number (an eigenvalue).","zh":"（数学/物理）特征函数：对某个运算（线性算子）作用后，结果仍与原函数成比例，只是乘上一个常数（特征值）的函数。"},"examples":[{"en":"In quantum mechanics, the energy eigenfunctions describe the allowed states of an electron in an atom.","zh":"在量子力学中，能量特征函数描述了原子中电子允许存在的状态。"},{"en":"We solved the differential equation by finding the eigenfunctions of the operator.","zh":"我们通过求出该算子的特征函数来解这个微分方程。"}]}],"synonyms":["eigenmode","eigenstate (in physics)"],"phonetic":"/ˈaɪɡənˌfʌŋkʃən/","extraExplanation":["“eigen-”来自德语，意思是“自身的/固有的”。因此 eigenfunction 可以理解为“算子固有的函数”。","直观记法：如果算子是 L，函数是 f，那么 L(f)=λf 时，f 是 eigenfunction，λ 是 eigenvalue（特征值）。","常见搭配：eigenfunction expansion（特征函数展开）、orthogonal eigenfunctions（正交特征函数）、normalized eigenfunction（归一化特征函数）。"]}
{"word":"eigenspace","summary":{"en":"An eigenspace is the subspace of vectors that a matrix transforms by simple scaling for a particular eigenvalue.","zh":"特征空间是指对某个特征值而言，在矩阵作用下只发生按比例缩放的一组向量所形成的子空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In linear algebra, the set of all vectors that are scaled (not rotated into a different direction) by a linear transformation or matrix, together with the zero vector. This set forms a subspace and corresponds to one specific eigenvalue.","zh":"在线性代数中，指在某个线性变换或矩阵作用下只被“按比例缩放”（方向不改变）的所有向量的集合，并包含零向量。这个集合构成一个子空间，并对应某一个特定的特征值。"},"examples":[{"en":"For the eigenvalue 3, the eigenspace consists of all vectors v such that Av = 3v.","zh":"对特征值 3 而言，特征空间包含所有满足 Av = 3v 的向量 v。"},{"en":"If an eigenspace has dimension 2, there are two independent eigenvectors for that eigenvalue.","zh":"如果某个特征空间的维数是 2，就表示该特征值对应两个线性无关的特征向量。"}]}],"synonyms":["eigenvector space","eigen-subspace"],"phonetic":"/ˈaɪɡənˌspeɪs/","extraExplanation":["“eigen-”来自德语，意思是“自身的/本征的”。因此 eigenvalue 常译为“特征值/本征值”，eigenvector 译为“特征向量/本征向量”，eigenspace 译为“特征空间/本征空间”。","直观理解：在线性变换作用下，大多数向量会改变方向；但落在某个特征空间里的向量只会被拉伸或压缩（乘以特征值），方向保持不变（或反向）。","特征空间一定包含零向量；若特征值为 λ，则特征空间就是 (A−λI) 的零空间（null space/核）。"]}
{"word":"eigenstate","summary":{"en":"An eigenstate is a special state that produces a definite measurement result for a particular observable; in math it’s a vector that only scales under a transformation.","zh":"eigenstate 指对某个可观测量测量会得到确定结果的“本征态”；在数学里指在线性变换下只发生缩放的特征向量/本征向量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Physics/quantum mechanics) A special state of a system that gives a definite value when you measure a particular quantity (an observable). If the system is in an eigenstate of that observable, repeated measurements of the same quantity give the same result.","zh":"（物理/量子力学）系统的一种特殊“态”，对某个物理量（可观测量）进行测量时会得到确定的数值。若系统处于该可观测量的本征态，对同一物理量反复测量会得到相同结果。"},"examples":[{"en":"If a particle is in an eigenstate of energy, measuring its energy returns a fixed value.","zh":"如果粒子处于能量的本征态，测量能量会得到一个固定值。"},{"en":"After the measurement, the system is often said to collapse into an eigenstate of the measured observable.","zh":"测量之后，常说系统“塌缩”到被测可观测量的本征态。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math/linear algebra) A vector (state) that keeps its direction under a linear transformation, changing only by a scale factor (the eigenvalue).","zh":"（数学/线性代数）在线性变换作用下方向不变、只按比例缩放的向量（其缩放比例称为特征值）。"},"examples":[{"en":"In matrix form, an eigenstate satisfies A|v⟩ = λ|v⟩.","zh":"用矩阵形式表示时，本征态满足 A|v⟩ = λ|v⟩。"},{"en":"Eigenstates help simplify a problem by turning a complicated transformation into simple scaling.","zh":"本征态能把复杂变换化为简单的缩放，从而简化问题。"}]}],"synonyms":["eigenvector","stationary state","characteristic vector"],"phonetic":"/ˈaɪɡənˌsteɪt/","extraExplanation":["“eigen-”来自德语，意思是“自身的/固有的”。因此 eigenstate 常译为“本征态”（也有人说“特征态”），强调这是系统在某个算符（可观测量）下的“固有”状态。","在量子语境里，eigenstate 常与 operator（算符）、observable（可观测量）、eigenvalue（本征值/特征值）一起出现。很多教材也会用“stationary state（定态）”描述能量本征态：时间演化只改变整体相位，概率分布不变。"]}
{"word":"eigenvalue","summary":{"en":"An eigenvalue is a number that tells how a matrix scales certain special vectors (eigenvectors) without changing their direction.","zh":"特征值是一个数，表示矩阵对某些特殊向量（特征向量）在方向不变时的缩放倍数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A special number linked to a square matrix (or linear transformation) that measures how much an eigenvector is stretched or shrunk without changing its direction.","zh":"与方阵（或线性变换）相关的一个特殊数值，表示某个特征向量在方向不变的情况下被拉伸或压缩的倍数。"},"examples":[{"en":"To find the eigenvalues, we solve the characteristic equation det(A − λI) = 0.","zh":"要找特征值，我们解特征方程 det(A − λI) = 0。"},{"en":"If Av = λv, then λ is an eigenvalue of A and v is the corresponding eigenvector.","zh":"如果 Av = λv，那么 λ 是 A 的特征值，v 是对应的特征向量。"},{"en":"In physics, eigenvalues can represent possible energy levels of a system.","zh":"在物理学中，特征值可以表示系统可能的能量能级。"}]}],"synonyms":["characteristic value"],"phonetic":"/ˈaɪɡənˌvæl.juː/","extraExplanation":["“eigen-”来自德语，意思是“自身的、固有的”。因此 eigenvalue 直译接近“固有值”。这个术语常用于线性代数、微分方程、量子力学、数据科学（如 PCA 主成分分析）等领域。","直观理解：对某些“特别的方向”（特征向量）施加线性变换时，方向不变，只是按某个比例放大/缩小；这个比例就是特征值。","常见搭配：eigenvalue problem（特征值问题）、dominant/largest eigenvalue（主/最大特征值）、real/complex eigenvalues（实/复特征值）。"]}
{"word":"eigenvalues","summary":{"en":"Eigenvalues are numbers that describe how a matrix scales its eigenvectors (A·v = λ·v).","zh":"特征值是描述矩阵如何缩放其特征向量的数（A·v = λ·v）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Math) The special numbers of a matrix (or linear transformation) that tell you how certain nonzero vectors (eigenvectors) are scaled, so that A·v = λ·v.","zh":"（数学）矩阵（或线性变换）的特殊数值，表示某些非零向量（特征向量）被缩放的比例，满足 A·v = λ·v。"},"examples":[{"en":"To find the eigenvalues of a matrix, you often solve the characteristic equation det(A − λI) = 0.","zh":"要求矩阵的特征值，通常要解特征方程 det(A − λI) = 0。"},{"en":"The system is stable when all eigenvalues have negative real parts.","zh":"当所有特征值的实部都为负时，该系统是稳定的。"},{"en":"In PCA, the largest eigenvalues correspond to directions with the most variance.","zh":"在主成分分析（PCA）中，最大的特征值对应方差最大的方向。"}]}],"synonyms":["characteristic values","spectrum (of a matrix)"],"phonetic":"/ˈaɪɡənˌvæljuz/","extraExplanation":["“eigen-”来自德语，意思是“自身的、固有的”。因此 eigenvalue 常译为“特征值”，强调它是线性变换“自身的性质”。","在物理与工程中，特征值常出现在振动（固有频率）、量子力学（本征值）、微分方程与稳定性分析等场景里。"]}
{"word":"eigenvector","summary":{"en":"An eigenvector is a nonzero vector whose direction stays the same after a matrix transformation; it is only scaled.","zh":"特征向量是在线性变换后方向不变、只被缩放的非零向量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonzero vector that keeps its direction when a linear transformation (or square matrix) is applied; it only gets scaled by a constant called an eigenvalue.","zh":"特征向量：在线性变换（或方阵）作用下方向不变、只会被一个常数（特征值）缩放的非零向量。"},"examples":[{"en":"If A v = λ v, then v is an eigenvector of the matrix A.","zh":"如果 A v = λ v，那么 v 就是矩阵 A 的一个特征向量。"},{"en":"Eigenvectors often show the most important directions in data, such as in PCA.","zh":"特征向量常用来表示数据中最重要的方向，例如主成分分析（PCA）。"}]}],"synonyms":["characteristic vector","proper vector"],"phonetic":"/ˈaɪɡənˌvɛktər/","extraExplanation":["“eigen-”来自德语，意思是“自身的、固有的”。因此 eigenvector 可理解为“矩阵（变换）固有的方向”。","直观比喻：把一个箭头放进“机器”（矩阵/线性变换）里，出来后箭头方向不变，只是变长或变短（乘上特征值 λ）；这支箭头就是特征向量。","常见应用：PCA/降维（最大方差方向）、图与网络分析（如 PageRank 思想）、微分方程与振动模态（“固有振型”）。"]}
{"word":"eigenvectors","summary":{"en":"Eigenvectors are special vectors that don’t change direction under a matrix—only their size changes (by an eigenvalue).","zh":"特征向量是在矩阵作用下方向不变、只按特征值缩放大小的向量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In linear algebra, vectors that keep the same direction when a matrix (a linear transformation) is applied to them; only their length changes, scaled by a number called an eigenvalue.","zh":"在线性代数中，指对某个矩阵（线性变换）作用后方向保持不变的向量；只会按某个数（特征值）缩放长度。"},"examples":[{"en":"For matrix A, an eigenvector v satisfies Av = λv, where λ is the eigenvalue.","zh":"对矩阵 A 来说，特征向量 v 满足 Av = λv，其中 λ 是特征值。"},{"en":"Eigenvectors help identify the main directions of variation in data analysis like PCA.","zh":"在主成分分析（PCA）等数据分析中，特征向量能帮助找出数据变化最主要的方向。"}]}],"synonyms":["characteristic vectors (less common)","proper vectors (rare)"],"phonetic":"/ˈaɪɡənˌvɛktɚz/","extraExplanation":["“eigen-”来自德语，意思是“自身的、固有的”。因此 eigenvector 常译为“特征向量”，强调它是变换/矩阵“固有”的方向。","在应用中：物理里可对应“稳定的振动模式/方向”，机器学习里常见于 PCA（协方差矩阵的特征向量给出主成分方向），图算法里也会出现（如谱聚类）。","复数形式是 eigenvectors；单数是 eigenvector。读写时常与 eigenvalue（特征值）一起出现。"]}
{"word":"Eiger","summary":{"en":"Eiger: a famous Swiss Alpine mountain, especially known for its North Face.","zh":"Eiger：瑞士阿尔卑斯山著名山峰，尤其以“北壁”闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous mountain in the Bernese Alps of Switzerland, known especially for its steep north face (the “Eiger North Face”).","zh":"艾格峰（瑞士伯尔尼阿尔卑斯山脉的一座著名山峰），尤以陡峭的北壁（“艾格北壁”）闻名。"},"examples":[{"en":"The Eiger is one of the most iconic peaks in the Swiss Alps.","zh":"艾格峰是瑞士阿尔卑斯山最具代表性的山峰之一。"},{"en":"Many climbers dream of ascending the Eiger’s North Face.","zh":"许多登山者梦想攀登艾格峰的北壁。"},{"en":"We could see the Eiger in the distance from Grindelwald.","zh":"我们在格林德瓦远远就能看到艾格峰。"}]}],"phonetic":"/ˈaɪɡər/","extraExplanation":["“Eiger”是专有名词，通常要大写，指瑞士著名山峰艾格峰，常与附近的“Jungfrau（少女峰）”“Mönch（僧侣峰）”并称为该地区经典三峰。","“Eiger North Face（艾格北壁）”在登山文化中非常有名，因其路线险峻、天气多变、历史上事故较多而被视为高难度挑战；相关题材常出现在纪录片、登山书籍与电影中（如电影《The Eiger Sanction》在中文里常译作《艾格峰行动》或类似译名）。"]}
{"word":"eigh","summary":{"en":"“eigh” is usually a spelling chunk (not a word) that often sounds like /eɪ/ (as in “eight”), with a few exceptions like “height.”","zh":"“eigh”通常是拼写组合（不是独立单词），常读作 /eɪ/（如“eight”），但也有如“height”之类的例外。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A letter sequence (spelling chunk) in English, not usually a standalone word. It most often represents the sound /eɪ/ in words like “eight” and “weigh.”","zh":"英语中的一个字母组合（拼写片段），通常不是独立成词。它在很多单词中常表示 /eɪ/ 的发音，例如 “eight”“weigh”。"},"examples":[{"en":"The spelling chunk “eigh” usually sounds like /eɪ/ in “eight.”","zh":"拼写组合“eigh”在“eight”里通常读作 /eɪ/。"},{"en":"In “weigh,” the “eigh” part also has the /eɪ/ sound.","zh":"在“weigh”中，“eigh”部分也发 /eɪ/ 的音。"},{"en":"Some words with “eigh” include “weight,” “neighbor,” and “sleigh.”","zh":"含有“eigh”的词还有“weight（重量）”“neighbor（邻居）”“sleigh（雪橇）”。"}]}],"synonyms":["-eigh-","spelling pattern","letter combination"],"phonetic":"/eɪ/","extraExplanation":["“eigh”本身一般不作为单词使用，更像是你在拼写中会遇到的“字母组合/拼写规则”。\n\n常见读音规律：\n- 多数情况下读 /eɪ/：eight, weigh, weight, sleigh\n- 但也有例外：height 通常读 /haɪt/（不是 /heɪt/）\n\n如果你其实想查的是 “eight（8）”，告诉我我可以给你完整词条（词性、用法、例句、同义表达等）。"]}
{"word":"Eight","summary":{"en":"Eight is the number 8, and it can also refer to an “8-shaped” figure (a figure eight).","zh":"Eight 表示数字8，也可指“8字形”的图案或路线（figure eight）。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"The number 8; one more than seven and one less than nine.","zh":"数字8；比7大1、比9小1。"},"examples":[{"en":"There are eight students in the group.","zh":"小组里有八名学生。"},{"en":"She wakes up at eight o’clock every day.","zh":"她每天八点起床。"}]},{"partOfSpeech":"n.","definition":{"en":"A shape or figure that looks like the numeral 8 (two loops), often used in sports or patterns.","zh":"“8”字形（上下两个环）的图形；常用于运动路线或图案。"},"examples":[{"en":"The skater traced a figure eight on the ice.","zh":"滑冰者在冰面上划出了一个“8”字形。"},{"en":"Tie the rope in a figure-eight knot for safety.","zh":"为了安全，把绳子打一个八字结。"}]}],"synonyms":["8","VIII"],"phonetic":"/eɪt/","extraExplanation":["在英语里，“eight”与“ate（吃了）”同音，初学者听力中容易混淆：例如 “I ate” 听起来像 “I eight”。","“figure eight（8字形）”在日常英语里很常见：既可指滑冰/驾驶的8字路线，也可指“八字结（figure-eight knot）”。"]}
{"word":"eight","summary":{"en":"Eight is the number 8; it can also mean something shaped like an 8 (a “figure eight”).","zh":"eight 表示数字“8（八）”；也可指“8”字形的形状（figure eight）。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"The number 8.","zh":"数字8；八。"},"examples":[{"en":"There are eight students in the group.","zh":"这个小组里有八个学生。"},{"en":"She wakes up at eight o’clock.","zh":"她八点起床。"}]},{"partOfSpeech":"n.","definition":{"en":"A shape or figure like the numeral 8.","zh":"“8”字形；八字形的图案或形状。"},"examples":[{"en":"The skater traced a figure eight on the ice.","zh":"滑冰者在冰面上画出了一个“8”字形。"},{"en":"Tie the rope in a figure-eight knot.","zh":"把绳子打一个八字结。"}]}],"synonyms":["8","VIII","octad"],"phonetic":"/eɪt/","extraExplanation":["在英语里，8常与“figure eight（8字形）”“figure-eight knot（八字结）”等搭配出现。日常表达时间时常说“at eight”或“eight o’clock”。另外，“eight”在扑克牌里也可指“8点牌/8号牌”（an eight）。"]}
{"word":"eightball","summary":{"en":"Eightball most commonly means the black 8 ball in pool; it can also mean the Magic 8 Ball toy, or (slang) 3.5 grams of an illegal drug.","zh":"Eightball 最常指台球中的8号黑球；也可指“神奇8号球”占卜玩具；另有（俚语）指约3.5克的非法毒品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the black ball numbered 8 in the game of pool (billiards)","zh":"（台球/美式落袋中）编号为8的黑球；八号球"},"examples":[{"en":"He sank the eight ball and won the game.","zh":"他打进了八号球，赢得了比赛。"},{"en":"Don’t hit the eight ball in too early, or you’ll lose.","zh":"别太早把八号球打进袋，不然会输。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) an eighth of an ounce (about 3.5 grams) of an illegal drug, especially cocaine","zh":"（俚语）八分之一盎司（约3.5克）的非法毒品（尤指可卡因）"},"examples":[{"en":"The report mentioned an 'eightball' of cocaine.","zh":"报告中提到了一份“3.5克的可卡因”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Magic 8 Ball) a toy fortune-telling ball that gives random answers when shaken","zh":"（“神奇8号球”）一种摇一摇就随机给出回答的占卜玩具"},"examples":[{"en":"She asked the Magic 8 Ball if she should take the job.","zh":"她问“神奇8号球”自己是否该接受那份工作。"},{"en":"The eightball said, “Outlook good.”","zh":"8号球显示：“前景不错。”"}]}],"synonyms":["eight ball","Magic 8 Ball (specific)","8-ball"],"phonetic":"/ˈeɪtˌbɔl/","extraExplanation":["在美式落袋（pool）里，8号球通常是关键球：很多规则要求你先打完自己那组球（全色或花色）后，最后才能打进8号球，否则会直接判负。这也是它在文化里常被当作“胜负关键”的原因。","“Magic 8 Ball（神奇8号球）”最早在美国作为新奇玩具流行，常出现在影视作品里，用来制造幽默或表现人物犹豫不决。","俚语里把“3.5克（八分之一盎司）”叫做 eightball，属于毒品语境；在学习或使用时要注意场合与敏感性，避免在正式环境中误用。"]}
{"word":"eightballs","summary":{"en":"Eightball(s) most commonly means the 8 ball in pool; informally it can mean something unpredictable/risky, and in slang it can mean an eighth-ounce amount of an illegal drug.","zh":"eightball(s)最常见指台球的8号黑球；非正式可指不可预测/有风险的人或事；俚语中也可指八分之一盎司的毒品数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the black ball numbered 8 in the game of pool (billiards)","zh":"（台球/花式撞球中的）8号球，黑球"},"examples":[{"en":"He sank the eight ball in the corner pocket and won the game.","zh":"他把8号球打进了底袋，赢了这局。"},{"en":"Don’t hit the eight ball until the end, or you may lose.","zh":"不要太早碰8号球，否则可能会输。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a person or thing that is unpredictable or risky; someone who may cause trouble","zh":"（非正式）难以预测的人/事；可能惹麻烦的“危险人物/因素”"},"examples":[{"en":"He’s a bit of an eightball—you never know what he’ll do next.","zh":"他有点像“八号球”那种人——你永远猜不到他下一步会做什么。"},{"en":"Putting all the money into one stock is an eightball move.","zh":"把所有钱都投到一只股票上是很冒险的一步。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) an eighth of an ounce (about 3.5 grams) of an illegal drug, especially cocaine or marijuana","zh":"（俚语）八分之一盎司（约3.5克）的毒品数量，常指可卡因或大麻"},"examples":[{"en":"In the movie, the character talks about buying an eightball.","zh":"在电影里，角色提到要买“一包八分之一盎司”。"},{"en":"Drug slang like “eightball” often appears in crime shows.","zh":"像“eightball”这样的毒品俚语常出现在犯罪剧里。"}]}],"synonyms":["8 ball","black ball","wild card","unpredictable person","an eighth"],"phonetic":"/ˈeɪtˌbɔl/","extraExplanation":["“eightball”原本来自台球里的8号黑球：它通常是最后要打的关键球，因此容易被引申为“关键但风险大”的事物或“难以预测的人”。","毒品含义来自数量单位：1 ounce（盎司）≈ 28.35克；其八分之一约为3.5克。该用法带有明显违法与负面语境，在正式场合应避免使用或改用中性表达（如“an eighth”）。","你输入的 eightballs 是复数形式；单数是 eightball。常见相关表达：behind the eight ball（处于不利/被动局面）。"]}
{"word":"Eighteen","summary":{"en":"“Eighteen” means the number 18, and it can also describe something related to 18.","zh":"“eighteen”表示数字18，也可作形容词表示“十八的/与18有关的”。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"The number 18.","zh":"数字18；十八。"},"examples":[{"en":"She is eighteen years old.","zh":"她十八岁。"},{"en":"There are eighteen students in our class.","zh":"我们班有十八个学生。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the number 18 (often used before a noun).","zh":"与数字18有关的；十八的（常用于名词前）。"},"examples":[{"en":"They took an eighteen-hour train ride.","zh":"他们坐了十八个小时的火车。"},{"en":"He lives on the eighteenth floor.","zh":"他住在第十八层。"}]}],"synonyms":["18","XVIII"],"phonetic":"/eɪˈtiːn/","extraExplanation":["在许多英语国家，18岁常被视为“成年的门槛”：通常可以投票，也常可以合法购买烟草或参加某些成人活动（但美国买酒通常要到21岁；不同国家和地区规定不同）。","拼写提示：eighteen 里有 eight（八），但读音会变成 /eɪˈtiːn/；重音在后半部分 -teen，和 eighty（80）/ˈeɪti/ 区分：eighTEEN（重音在teen） vs. EIGHty（重音在eigh）。"]}
{"word":"eighteen","summary":{"en":"“Eighteen” means the number 18, and it can also describe something that is 18 in age or amount.","zh":"“eighteen”表示数字18，也可作形容词表示“18岁的/18个的”。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"The number 18; one more than 17 and one less than 19.","zh":"数字18；比17大1，比19小1。"},"examples":[{"en":"She is eighteen years old.","zh":"她18岁。"},{"en":"There are eighteen students in the class.","zh":"班上有18名学生。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or being 18 in number or age.","zh":"与18有关的；18个的；18岁的。"},"examples":[{"en":"On his eighteenth birthday, he got his first ID card.","zh":"在他18岁生日那天，他拿到了第一张身份证件。"},{"en":"The team has eighteen members.","zh":"这个团队有18名成员。"}]}],"synonyms":["18","XVIII"],"phonetic":"/ˌeɪˈtiːn/","extraExplanation":["在很多英语国家，18岁通常被视为“成年的开始”或重要人生节点：例如可以投票（美国许多州）、签正式合同、参军等；但饮酒年龄在美国通常是21岁。不同国家规定会有差异。"]}
{"word":"eighteenfold","summary":{"en":"“Eighteenfold” means “eighteen times as much/many” or “increased by a factor of 18.”","zh":"“eighteenfold”表示“十八倍的/以十八倍（增长）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Eighteen times as many or as much; multiplied by 18.","zh":"十八倍的；增至原来的十八倍；乘以18的。"},"examples":[{"en":"The population grew eighteenfold over the last century.","zh":"在上个世纪里，人口增长了十八倍。"},{"en":"Profits increased eighteenfold after the new product launched.","zh":"新产品上市后，利润增长了十八倍。"}]},{"partOfSpeech":"adv.","definition":{"en":"By a factor of eighteen; to eighteen times the original amount.","zh":"以十八倍；达到原来的十八倍。"},"examples":[{"en":"The risk rises eighteenfold if you skip safety checks.","zh":"如果你跳过安全检查，风险会增加十八倍。"},{"en":"Her salary went up eighteenfold in a decade.","zh":"她的薪水在十年里涨到了十八倍。"}]}],"synonyms":["18 times","eighteen times","eighteenfold increase","by a factor of eighteen"],"phonetic":"/ˈeɪˌtiːnˌfoʊld/","extraExplanation":["“-fold”是英语里表示“倍数”的常见后缀：twofold（两倍）、threefold（三倍）、tenfold（十倍）等。用在比较或增长时很自然：increase tenfold / grow threefold。","在日常口语里，也常用“18 times”表达同样意思；“eighteenfold”更常见于书面语、新闻、报告或学术写作。"]}
{"word":"eighteenmo","summary":{"en":"“eighteenmo” is an informal written abbreviation for “18 months old.”","zh":"“eighteenmo”是“18个月大”的非正式书面缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, written) an abbreviation meaning “18 months old,” often used in parenting notes, medical charts, and online posts to describe a child’s age.","zh":"（非正式、书面）“18个月大”的缩写，常见于育儿记录、医疗记录或网络发帖中，用来表示孩子的年龄。"},"examples":[{"en":"My son is eighteenmo and just started walking.","zh":"我儿子18个月大，刚开始学走路。"},{"en":"At eighteenmo, many toddlers can say a few words.","zh":"在18个月大时，很多幼儿已经会说一些词了。"},{"en":"Doctor’s note: fever x2 days, eighteenmo female.","zh":"医生记录：发烧2天，18个月大女婴。"}]}],"synonyms":["18mo","18 mos","eighteen months old"],"phonetic":"/ˌeɪˈtin moʊ/","extraExplanation":["“eighteenmo”更常见的写法是“18mo”或“18 mos”。它多用于快速记录年龄，尤其在美国的育儿社区、儿科就诊记录、托儿沟通本中很常见。","口语中一般不会说“eighteen-mo”，更自然的说法是：“eighteen months old（18个月大）”。","写作时注意场合：正式文章或作业里建议写全“eighteen months old”，不要用这种缩写。"]}
{"word":"eighteenmos","summary":{"en":"“eighteenmos” is an informal way to write “eighteen months (18 mos.),” especially for ages and timelines.","zh":"“eighteenmos”是“18个月（18 mos.）”的非正式写法，常用于年龄或时间周期。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an informal abbreviation meaning “eighteen months,” often used in notes, schedules, parenting, or medical records to describe a child’s age or a time period","zh":"非正式缩写，表示“18个月”，常见于记录、时间表、育儿或医疗文书中，用来描述孩子年龄或一段时间"},"examples":[{"en":"The vaccine is recommended at 18 mos.","zh":"该疫苗建议在18个月大时接种。"},{"en":"My toddler is eighteenmos and just started saying short sentences.","zh":"我家宝宝18个月大，刚开始会说短句了。"},{"en":"The contract lasts eighteenmos from the start date.","zh":"合同从开始日期起有效期为18个月。"}]}],"synonyms":["18 months","18 mos.","eighteen months"],"phonetic":"/ˌeɪˈtiːn mʌnθs/","extraExplanation":["“eighteenmos”常见于短信、论坛、育儿群、病历/随访记录等快速书写场景；更标准的写法是“18 months”或“18 mos.”（带空格/句点更常见）。","读写时注意：口语里通常直接说“eighteen months”（18个月），而不是把“mos”当作一个单词读出来。"]}
{"word":"eighteens","summary":{"en":"“Eighteens” is the plural of “eighteen,” meaning multiple 18s (numbers, sizes, labels), and in golf it can mean full 18-hole rounds.","zh":"“eighteens”是“eighteen”的复数，表示多个“18”（数字/尺码/编号等）；在高尔夫中也可指完整的18洞一轮（多轮则用复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The number 18; an eighteen-unit group or item labeled “18.”","zh":"数字18；由18个单位组成的一组；标为“18”的事物。"},"examples":[{"en":"There are eighteens and nineteens on the rack in that store.","zh":"那家店的衣架上有18码和19码的。"},{"en":"Write the numbers from one to twenty, including the eighteens.","zh":"把1到20的数字写出来，包括18。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “eighteen” in sports, especially golf: a full course made up of 18 holes (often contrasted with “the front nine”).","zh":"（尤指高尔夫）“eighteen”的复数：18洞的完整一轮/一场（常与“前九洞”相对）。"},"examples":[{"en":"Let’s play two eighteens this weekend.","zh":"这周末我们打两轮18洞吧。"},{"en":"He prefers full eighteens rather than just nine holes after work.","zh":"他更喜欢打一整轮18洞，而不是下班后只打9洞。"}]}],"synonyms":["eighteen (plural context)","18s"],"phonetic":"/ˌeɪˈtiːnz/","extraExplanation":["“eighteens”多见于口语或特定语境里的复数用法：\n1) 表示“多个18（号码/尺码/数字/年龄段等）”，例如衣服尺码、车型、球衣号码、18岁的人群等；\n2) 在高尔夫语境中，“an eighteen”指“一轮18洞”，所以“two eighteens”就是“两轮18洞”。"]}
{"word":"eighteenth","summary":{"en":"Eighteenth means “18th,” used for dates, order, and for things related to the 18th century (1701–1800).","zh":"eighteenth 意为“第十八/18th”，用于日期、顺序，也可指与18世纪（1701–1800年）相关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The ordinal number after seventeenth; 18th.","zh":"第十八；18th（序数词）。"},"examples":[{"en":"Today is the eighteenth of June.","zh":"今天是六月十八日。"},{"en":"She finished in eighteenth place.","zh":"她获得了第十八名。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that is number 18 in a series.","zh":"第十八个（人或事物）；序列中的第18位。"},"examples":[{"en":"He was the eighteenth to sign the document.","zh":"他是第十八个在文件上签名的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the 1700s (the 18th century), especially the years 1701–1800.","zh":"与18世纪（1701–1800年，常指1700年代）有关的。"},"examples":[{"en":"They study eighteenth-century literature.","zh":"他们研究18世纪文学。"},{"en":"The museum has an eighteenth-century chair.","zh":"博物馆里有一把18世纪的椅子。"}]}],"synonyms":["18th","the eighteenth"],"phonetic":"/ˌeɪˈtiːnθ/","extraExplanation":["“eighteenth”由“eighteen（十八）+ -th（序数词后缀）”构成。常见写法有：eighteenth（全写）、18th（数字+后缀）。","英美日期表达中常说“the eighteenth of June”（较正式/英式更常见）或“June eighteenth”（美式更常见）。","“eighteenth century”在历史语境里通常指1700年代；在文学里常与启蒙运动（Enlightenment）、理性主义、讽刺文学等话题相关。"]}
{"word":"eighteenthly","summary":{"en":"“Eighteenthly” means “in the eighteenth place,” used to introduce the 18th point in a sequence, but it is rare in modern English.","zh":"“eighteenthly”意为“第十八（点/条）地”，用于引出第18条论点，但在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the eighteenth place; as item number 18 in a list of points or steps.","zh":"第十八（点/条）地；作为列表中第18项来说明。"},"examples":[{"en":"First, we discussed the budget; eighteenthly, we talked about travel policies.","zh":"首先我们讨论了预算；第十八点我们谈到了差旅政策。"},{"en":"Eighteenthly, let me add one small detail before we finish.","zh":"第十八点，在结束前我再补充一个小细节。"}]}],"synonyms":["eighteenth","in the eighteenth place"],"phonetic":"/ˌeɪˈtinθli/","extraExplanation":["“Eighteenthly”在现代英语里非常少见，尤其是在口语和一般写作中。多数情况下，人们会用“eighteenth”来表示顺序（the eighteenth point），或用更自然的表达如“Finally / Next / Another point is…”。","如果你在正式文件里需要列到很靠后的条目，更常见的做法是用编号（18. …）或用“Eighteenth,”（作为句首的过渡词）而不是“eighteenthly”。"]}
{"word":"eighteenths","summary":{"en":"“Eighteenths” is the plural form of “eighteenth,” most often meaning multiple 1/18 parts of a whole; less commonly it can mean multiple 18th positions in different lists.","zh":"“Eighteenths”是“eighteenth”的复数，最常指多个“十八分之一”的等份；较少情况下也可指不同列表中的多个“第十八名/第十八位”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of one eighteenth; equal parts when something is divided into 18 pieces (each part = 1/18).","zh":"“十八分之一”的复数；把整体分成18份时的等份（每一份=1/18）。"},"examples":[{"en":"Cut the cake into eighteenths so everyone gets the same amount.","zh":"把蛋糕切成十八等份，这样每个人分到的量一样。"},{"en":"The recipe calls for adding the butter in eighteenths to help it melt evenly.","zh":"食谱要求把黄油分成十八分之一的小块加入，帮助它均匀融化。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of eighteenth (ordinal): several things that are each in the 18th position in different series or lists.","zh":"“第十八”的复数：指在不同序列或清单中分别位于第18位的多个事物。"},"examples":[{"en":"In two different rankings, both teams finished as eighteenths.","zh":"在两份不同的排名中，两支队伍都排在第十八名。"},{"en":"On the calendar, the eighteenths fall on a Tuesday this year.","zh":"今年日历上“18号”都落在星期二。"}]}],"synonyms":["18ths","one-eighteenth parts","eighteenth parts"],"phonetic":"/ˌeɪˈtiːnθs/","extraExplanation":["“eighteenths”在实际使用中更常见的是“十八分之一（的复数）”，尤其在数学、工程尺寸（如英寸分数）、或需要精确分割时会出现。","表示序数时（“第十八”的复数）相对少见，通常会改用更自然的表达，例如：“both are 18th”或“on the 18th of each month”。"]}
{"word":"eightfoil","summary":{"en":"Eightfoil is an eight-lobed decorative motif often found in Gothic-style ornamentation.","zh":"Eightfoil 指一种由八个圆弧瓣组成的装饰图案，常见于哥特式风格的建筑与装饰中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative shape or motif made of eight rounded lobes (like eight leaves or petals), often seen in Gothic architecture and ornamental design.","zh":"八瓣饰形；八叶饰形（由八个圆弧瓣组成的装饰图案，常见于哥特式建筑与装饰设计中）。"},"examples":[{"en":"The window tracery features an eightfoil at its center.","zh":"窗棂花饰的中心有一个八瓣饰形。"},{"en":"In the cathedral’s stone carving, the eightfoil repeats as a border pattern.","zh":"在大教堂的石雕上，八瓣饰形反复出现，形成边饰图案。"}]}],"synonyms":["octofoil","foil (in architectural ornament)","quatrefoil (related motif)"],"phonetic":"/ˈeɪtˌfɔɪl/","extraExplanation":["“eightfoil”由 eight（八）+ foil（这里指“叶/瓣状图案”，常见于 quatrefoil 四叶饰形、trefoil 三叶饰形等词）组成。它多用于描述建筑装饰（如窗花、石雕的几何花饰）或纹章学/图案设计中的叶瓣形轮廓。"]}
{"word":"eightfold","summary":{"en":"Eightfold means “eight times as much” or “in eight parts.”","zh":"eightfold 意为“八倍的/八重的”，也可表示“增长了八倍（八倍地）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Eight times as many; having eight parts; multiplied by eight.","zh":"八倍的；八重的；由八个部分组成的。"},"examples":[{"en":"The company reported an eightfold increase in profits.","zh":"公司报告利润增长了八倍。"},{"en":"We saw an eightfold rise in online orders during the holiday season.","zh":"假期期间，我们看到线上订单增长了八倍。"}]},{"partOfSpeech":"adv.","definition":{"en":"By a factor of eight; eight times.","zh":"以八倍（的程度）；八倍地。"},"examples":[{"en":"Sales grew eightfold after the new ad campaign.","zh":"新的广告活动之后，销量增长了八倍。"},{"en":"The risk is increased eightfold when you drive too fast.","zh":"开车太快会让风险增加八倍。"}]}],"synonyms":["eight times","eightfold (increase)","octuple","eightfoldly"],"phonetic":"/ˈeɪtˌfoʊld/","extraExplanation":["“eightfold”常用于数据、统计与新闻写作，强调变化的倍数（eightfold increase/rise/growth）。口语中也常用“eight times”表达同样意思。","构词上，-fold 表示“倍数/重数”（如 twofold=两倍，threefold=三倍）。在阅读中看到“X-fold”时，通常可直接理解为“X倍”。"]}
{"word":"Eighth","summary":{"en":"Eighth means “the 8th” (ordinal) or “one of eight equal parts” (1/8); it can also mean an eighth note in music.","zh":"Eighth 表示“第八（第8）”或“八分之一（1/8）”，也可指音乐中的“八分音符”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Coming after the seventh; the ordinal form of eight (8th).","zh":"第八的；排在第七之后的（第8）。"},"examples":[{"en":"She finished in eighth place.","zh":"她获得了第八名。"},{"en":"Our hotel room is on the eighth floor.","zh":"我们的酒店房间在八楼。"}]},{"partOfSpeech":"n.","definition":{"en":"One of eight equal parts of something; 1/8.","zh":"八分之一；（把整体平均分成八份中的）一份。"},"examples":[{"en":"Add an eighth of a teaspoon of salt.","zh":"加八分之一茶匙的盐。"},{"en":"He drank about an eighth of the bottle.","zh":"他喝了大约八分之一瓶。"}]},{"partOfSpeech":"n.","definition":{"en":"A musical note equal to half a quarter note (also called an eighth note).","zh":"（音乐）八分音符（时值为四分音符的一半）。"},"examples":[{"en":"The melody uses a lot of eighth notes.","zh":"这段旋律用了很多八分音符。"}]}],"synonyms":["8th","one-eighth","octave (music-related, not the same meaning)"],"phonetic":"/eɪtθ/","extraExplanation":["“eighth”既可以表示序数（第八），也可以表示分数（八分之一）。写作分数时常用“an eighth of…”（……的八分之一）。","发音里结尾的 /θ/ 是清齿擦音（像“think”里的 th）。"]}
{"word":"eighth","summary":{"en":"“Eighth” means “8th” (the ordinal form of eight) and can also mean one of eight equal parts (1/8).","zh":"“eighth”表示“第八（第8）”，也可表示“八分之一（1/8）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The ordinal number that comes after seventh and before ninth; 8th.","zh":"第八的；在第七之后、第九之前；第8。"},"examples":[{"en":"Today is the eighth of June.","zh":"今天是六月八日。"},{"en":"She finished eighth in the race.","zh":"她在比赛中获得第八名。"},{"en":"This is my eighth attempt.","zh":"这是我第八次尝试。"}]},{"partOfSpeech":"n.","definition":{"en":"One of eight equal parts of something (1/8).","zh":"八分之一（1/8）；把整体分成八等份中的一份。"},"examples":[{"en":"Cut the cake into eighths.","zh":"把蛋糕切成八等份。"},{"en":"I drank an eighth of the bottle.","zh":"我喝了这瓶的八分之一。"}]}],"synonyms":["8th","one-eighth"],"phonetic":"/eɪtθ/","extraExplanation":["在音乐里，an eighth note 指“八分音符”，通常是四分音符时值的一半；在节拍里你会听到“one-and-two-and…”这种更细的分拍。","在日常日期表达中，美式英语常说 “June eighth” 或 “the eighth of June”。书写时常用 “8th”。"]}
{"word":"eighthes","summary":{"en":"“Eighths” usually means eight equal parts (1/8), and it can also mean eighth notes in music.","zh":"“Eighths”通常表示八等分之一（1/8），也可指音乐里的八分音符。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “eighth”: one of eight equal parts (1/8).","zh":"“eighth”的复数：八等分之一（1/8），八个相等部分中的一份。"},"examples":[{"en":"Cut the pizza into eighths so everyone gets the same amount.","zh":"把披萨切成八等份，这样每个人分到的一样多。"},{"en":"In music class, we practiced playing eighths at a steady tempo.","zh":"在音乐课上，我们练习以稳定的速度演奏八分音符。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) eighth notes: notes that last for half the time of a quarter note.","zh":"（音乐）八分音符：时值为四分音符一半的音符。"},"examples":[{"en":"The melody uses a lot of eighths, so it feels quick and lively.","zh":"这段旋律用了很多八分音符，所以听起来又快又有活力。"},{"en":"Try counting “1 and 2 and” to keep your eighths even.","zh":"试着数“1 and 2 and”来让八分音符更均匀。"}]}],"synonyms":["one-eighth","eighth note (music)"],"phonetic":"/eɪtθs/","extraExplanation":["你输入的“eighthes”更常见的拼写是“eighths”。英语里“eighth”的复数一般直接加 -s，但因为词尾是 -th + s，发音会变成 /eɪtθs/，读起来像“eight-ths”。"]}
{"word":"eighthly","summary":{"en":"“Eighthly” means “in the eighth place” when listing points, but it’s uncommon in modern English; writers often use “eighth” or numbered lists instead.","zh":"“eighthly”表示列举时的“第八”，但现代英语中较少使用；更常用“eighth”或用编号/项目符号来列举。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the eighth place; as item number eight in a list or sequence.","zh":"第八；在列表或顺序中作为第八项。"},"examples":[{"en":"First, we reviewed the budget; eighthly, we discussed the new schedule.","zh":"首先，我们回顾了预算；第八，我们讨论了新的时间表。"},{"en":"Eighthly, please double-check the names before you submit the form.","zh":"第八，请在提交表格前再核对一次姓名。"}]}],"synonyms":["eighth","in the eighth place","as the eighth point"],"phonetic":"/ˈeɪtθli/","extraExplanation":["“eighthly”属于“firstly/secondly/thirdly…”这一类用于列举要点的副词，但在现代英语里并不常用，尤其从“fourthly”往后很多人会直接用“eighth”或更自然的表达，如“eighth,” “next,” “another point is…”。","在正式写作中，长篇列表常改用数字或项目符号（1, 2, 3… / bullet points），读起来更清晰，也更符合当代英语习惯。"]}
{"word":"eighths","summary":{"en":"“Eighths” is the plural of “eighth”: it most often means several 1/8 parts, and it can also refer to eighth notes in music.","zh":"“eighths”是“eighth”的复数，常指多个“八分之一”，也可指音乐中的“八分音符”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of eight equal parts of something; the fraction 1/8.","zh":"八分之一；把整体平均分成八份中的一份；分数 1/8。"},"examples":[{"en":"Cut the cake into eighths so everyone gets the same amount.","zh":"把蛋糕切成八等份，这样每个人拿到的一样多。"},{"en":"Add one eighth of a teaspoon of salt.","zh":"加八分之一茶匙的盐。"}]},{"partOfSpeech":"adj.","definition":{"en":"The ordinal number 8th in a sequence; position number eight.","zh":"第八（序数词）；序列中的第八位。"},"examples":[{"en":"Her birthday is on the eighth of May.","zh":"她的生日在五月八日。"},{"en":"He finished eighth in the race.","zh":"他在比赛中获得第八名。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, a note (or rest) lasting half the time of a quarter note; an eighth note.","zh":"【音乐】八分音符（或八分休止符）；时值为四分音符的一半。"},"examples":[{"en":"Play the melody using steady eighths.","zh":"用稳定的八分音符来演奏旋律。"},{"en":"The rhythm is mostly eighth notes.","zh":"这个节奏主要由八分音符构成。"}]}],"synonyms":["one-eighths","eighth parts","eighth notes"],"phonetic":"/eɪtθs/","extraExplanation":["“eighths”是“eighth”的复数形式：表示“八分之一（很多份）”或“多个八分音符”。表示日期时通常用单数：the eighth (of May)。“8th”是常见的书写形式。"]}
{"word":"eighties","summary":{"en":"“Eighties” most commonly means the decade 1980–1989, and it can also mean the style or culture of that decade.","zh":"“eighties”最常指1980—1989年的20世纪80年代，也可指80年代的风格或文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The years from 1980 to 1989 (often written as “the ’80s”).","zh":"20世纪80年代（1980—1989年，常写作 the ’80s）。"},"examples":[{"en":"She grew up in the eighties and still loves synth-pop.","zh":"她在80年代长大，至今仍喜欢合成器流行乐。"},{"en":"Many blockbuster movies became popular in the eighties.","zh":"许多大片电影在80年代走红。"}]},{"partOfSpeech":"n.","definition":{"en":"A cultural style associated with the 1980s, especially in music, fashion, and design.","zh":"（与）80年代相关的文化风格，尤指音乐、时尚与设计。"},"examples":[{"en":"This jacket has a strong eighties vibe.","zh":"这件夹克很有80年代的感觉。"},{"en":"The show uses bright colors for an eighties look.","zh":"这部剧用鲜艳的颜色营造80年代的视觉风格。"}]}],"synonyms":["the 1980s","the ’80s"],"phonetic":"/ˈeɪtiz/","extraExplanation":["写法提示：the eighties = 1980s；也常见更口语、更常用的写法 the ’80s（注意撇号表示省略 19）。在正式写作中常用 1980s。","文化语境：英语里说 “the eighties” 往往会让人联想到当时的流行文化元素，比如合成器音乐（synth）、夸张垫肩（shoulder pads）、霓虹色（neon colors）、早期电子游戏（arcade games）等。"]}
{"word":"eightieth","summary":{"en":"“Eightieth” means “80th,” or “one of 80 equal parts (1/80).”","zh":"“Eightieth”表示“第八十”，也可表示“八十分之一（1/80）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The ordinal number for 80; coming after the seventy-ninth and before the eighty-first.","zh":"第八十（80的序数）；在第七十九之后、在第八十一之前。"},"examples":[{"en":"Today is her eightieth birthday.","zh":"今天是她的八十岁生日。"},{"en":"He finished in eightieth place in the race.","zh":"他在比赛中获得第八十名。"}]},{"partOfSpeech":"n.","definition":{"en":"One of eighty equal parts of something (1/80).","zh":"八十分之一（把整体平均分成80份中的一份，1/80）。"},"examples":[{"en":"An eightieth of the budget was set aside for training.","zh":"预算的八十分之一被预留用于培训。"}]}],"synonyms":["80th","one-eightieth"],"phonetic":"/ˈeɪtiəθ/","extraExplanation":["“Eightieth”是由“eighty（八十）+ -ieth（表示序数的后缀）”构成。很多序数以-th结尾（fourth, fifth, sixth等），而以-ty结尾的数字常变为-tieth（twentieth, thirtieth, fortieth…）。","在生日等语境里常用“80th”书写；读作“eightieth”。在正式写作中，“80th anniversary（第80周年纪念）”也很常见。"]}
{"word":"eightieths","summary":{"en":"“Eightieths” means parts that are each 1/80 of a whole (the plural of “eightieth”).","zh":"“Eightieths”指“八十分之一”的若干份，是“eightieth”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of eighty equal parts of something; a fraction equal to 1/80.","zh":"八十分之一；把整体平均分成八十份中的一份（1/80）。"},"examples":[{"en":"I used eightieths of an inch to measure the thickness more precisely.","zh":"我用“英寸的八十分之一”来更精确地测量厚度。"},{"en":"The recipe calls for eightieths of a gram, which is hard to measure without special tools.","zh":"这个食谱需要“克的八十分之一”，没有专用工具很难量。"}]}],"synonyms":["one-eightieth parts","1/80 parts"],"phonetic":"/ˈeɪtiəθs/","extraExplanation":["“eightieths”是“eightieth”的复数形式。常见于数学、工程或需要精细刻度的测量语境中。","日常英语里更常用“one eightieth (1/80)”或直接写成分数“1/80”，因为“eightieths”听起来更偏书面/技术。"]}
{"word":"eightling","summary":{"en":"Eightling is a rare word meaning a group of eight or something consisting of eight parts.","zh":"Eightling 是个很少见的词，可指“八个一组”或“由八个部分组成的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A group of eight people or things; something made up of eight parts.","zh":"（罕见）八个一组；由八个部分组成的事物。"},"examples":[{"en":"The poem describes an eightling of stars circling the moon.","zh":"这首诗描写了八颗星围着月亮旋转。"},{"en":"They formed an eightling to carry the heavy table together.","zh":"他们组成八人一组一起抬那张沉重的桌子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Consisting of eight; having eight parts.","zh":"（罕见）由八个组成的；有八个部分的。"},"examples":[{"en":"She used an eightling pattern in the quilt design.","zh":"她在被子设计里用了一个八分（八组成）的图案。"},{"en":"An eightling rhythm repeats every eight beats.","zh":"一种“八拍一循环”的节奏每八拍重复一次。"}]}],"synonyms":["octet","group of eight","eightfold"],"phonetic":"/ˈeɪt.lɪŋ/","extraExplanation":["“eightling”在现代英语里非常少见，多半出现在仿古/诗歌式表达中。它由“eight（八）+ -ling（小…；…的一员/一组）”构成，类似的构词有“duckling（小鸭）”“underling（下属）”。如果你想表达“八人/八个一组”，更常用的是“octet / group of eight”。"]}
{"word":"eightpenny","summary":{"en":"Eightpenny means “worth eight pence” (historical) or refers to the nail size called an eightpenny nail (8d).","zh":"eightpenny 可指“价值八便士的”（历史用法），也可指钉子规格“8便士钉”（8d）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Worth or costing eight pence; sometimes used historically to describe prices, coins, or small fees.","zh":"（历史用法）价值或价格为八便士的；可用于描述价格、硬币或小额费用。"},"examples":[{"en":"In old records, you might see an eightpenny charge for the service.","zh":"在旧档案里，你可能会看到这项服务收取“八便士”的费用。"},{"en":"He found an eightpenny coin mentioned in a 19th-century diary.","zh":"他在一篇19世纪的日记里看到提到一枚“八便士”的硬币。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Especially US) Describing a nail size called an “eightpenny nail” (8d), a common way to label nail length.","zh":"（尤指美式英语）指“8便士钉”（8d）这种钉子规格，一种用来标注钉子长度的常见方式。"},"examples":[{"en":"Use eightpenny nails to attach the boards securely.","zh":"用8便士钉把木板牢牢钉住。"},{"en":"The hardware list calls for eightpenny nails (8d).","zh":"五金清单上写着需要8便士钉（8d）。"}]}],"synonyms":["8d","eight-penny (variant spelling)"],"phonetic":"/ˈeɪtˌpɛni/","extraExplanation":["“eightpenny”由 eight + penny 组成。英美传统里，penny（便士）不仅是钱币单位，也曾被用来当作某些商品的规格标记。","在钉子规格里常见的“8d”读作“eight-penny”。这里的 d 来自拉丁语 denarius（古罗马银币），在旧式英制记账中用 d 表示便士（pence）。","这种用法在现代日常对话中不常见，但在木工、建材、五金清单或历史文献中仍可能遇到。"]}
{"word":"eights","summary":{"en":"“Eights” most commonly means more than one “eight” (the number 8). It can also mean cards with the value 8, and in rowing (especially in British English), eight-person-boat races/crews.","zh":"“eights”最常见指多个“8/八”。也可指点数为8的牌；在赛艇语境（尤其英式英语）中，还可指八人艇比赛或队伍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural form of “eight”; the number 8 in more than one instance.","zh":"“eight”的复数；表示多个“8”或“八”。"},"examples":[{"en":"There are two eights in the phone number.","zh":"这个电话号码里有两个8。"},{"en":"She wrote the eights neatly on the worksheet.","zh":"她把练习纸上的“8”写得很工整。"}]},{"partOfSpeech":"n.","definition":{"en":"(Cards/games) Playing cards or tiles with eight symbols (pips); e.g., an eight of hearts, or two “eights.”","zh":"（纸牌/游戏）点数为8的牌或牌块；例如红桃8，或一对“8”。"},"examples":[{"en":"He was dealt two eights in poker.","zh":"他在扑克里发到了一对8。"},{"en":"The eight of spades is missing from this deck.","zh":"这副牌里少了黑桃8。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rowing, mainly British English) Races or events for eight-person rowing boats (“eights”); also used to refer to the boats/crews themselves.","zh":"（赛艇，主要英式英语）八人艇比赛（“eights”）；也可指八人艇/队伍本身。"},"examples":[{"en":"The university trains hard for the spring eights.","zh":"这所大学为春季八人艇比赛刻苦训练。"},{"en":"Their eights team won by a clear margin.","zh":"他们的八人艇队以明显优势获胜。"}]}],"synonyms":["multiple eights","pair of eights (cards)"],"phonetic":"/eɪts/","extraExplanation":["“eights”作为赛艇用语更常见于英国校园语境（如牛津、剑桥等学校的赛艇传统）。在美式英语中更常直接说“an eight”（一条八人艇）或“eight-person boat”。","在口语里谈到牌局时，“two eights”很常见；也可说“a pair of eights”（一对8）。"]}
{"word":"eightscore","summary":{"en":"Eightscore is an archaic way to say 160 (eight times twenty).","zh":"Eightscore 是古语，表示 160（八个二十）。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"(Archaic) One hundred sixty (160); literally “eight times twenty.”","zh":"（古语）一百六十（160）；字面意思是“八个二十”。"},"examples":[{"en":"The record says the village had eight score houses.","zh":"记录里说这个村庄有一百六十户人家。"},{"en":"Eight score soldiers marched through the gate.","zh":"一百六十名士兵从城门行进而过。"}]}],"synonyms":["one hundred sixty","160"],"phonetic":"/ˈeɪtˌskɔr/","extraExplanation":["“score”在古英语/中古英语里常用来表示“二十”（一 score = 20），因此 eight score = 8×20 = 160。现代英语里这种数法很少见，最有名的例子是林肯演说中的“four score and seven years ago”（八十七年前）。如果你在历史文献、圣经译本或文学作品里看到这种表达，把它换算成现代数字理解即可。"]}
{"word":"eightsman","summary":{"en":"An eightsman is a rower in the eight (Seat 8) position of a rowing crew.","zh":"eightsman 指赛艇队中坐在8号位（Seat 8）的划手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In rowing, the person who rows with oar(s) in the “eight” position (Seat 8) of a boat, usually the stern-most rower in an eight-person crew.","zh":"（赛艇）坐在“8号位”（Seat 8）的划手，通常是八人艇中最靠近船尾的那位划手。"},"examples":[{"en":"In an eight, the eightsman often sets a strong rhythm with the stroke seat.","zh":"在八人艇里，8号位划手常常和冲程位一起维持强有力的节奏。"},{"en":"She moved from seven to eightsman after the lineup changed.","zh":"阵容调整后，她从7号位换到了8号位。"}]}],"synonyms":["eight seat","Seat 8 rower","stern pair rower"],"phonetic":"/ˈeɪtsmən/","extraExplanation":["“Eightsman”属于比较小众的赛艇术语。更常见的说法是直接叫“Seat 8 / eight seat”，或把该位置称为“stroke”（冲程位）相关的位置描述。在很多队伍里，8号位与带节奏的冲程位紧密配合，因此常被认为对稳定节奏和力量输出很关键。"]}
{"word":"eightsmen","summary":{"en":"“Eightsmen” means the rowers in an eight-oared crew (plural of eightsman).","zh":"“Eightsmen”指八人艇队的划手们（eightsman 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rower who is a member of an eight-oared rowing crew (an “eight”)","zh":"八人艇（有八支桨、通常另配舵手的赛艇项目）中的一名划手"},"examples":[{"en":"She became an eightsman on the university rowing team in her second year.","zh":"她在大二加入了大学赛艇队，成为八人艇的一名划手。"},{"en":"All the eightsmen trained before sunrise to improve their timing together.","zh":"所有八人艇队员都在日出前训练，以提升全队的配合节奏。"}]}],"synonyms":["crew member","rower","oarsman"],"phonetic":"/ˈeɪtsmən/","extraExplanation":["“Eightsmen”是复数形式；单数是“eightsman”。在赛艇里，“eight”（八人艇）通常指8名划手，加上1名舵手（coxswain）。舵手不算在“eightsmen”里。"]}
{"word":"eightsome","summary":{"en":"Eightsome means a group of eight; it’s also used in Scottish culture for an “eightsome reel,” a dance for eight.","zh":"Eightsome 指“八个一组”；在苏格兰文化中也常指“eightsome reel”，一种八人舞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of eight people or things; an octet (often used in older or literary English).","zh":"八人（或八个事物）的一组；八重奏（多见于较旧或文学语境）。"},"examples":[{"en":"An eightsome of friends gathered for the weekend trip.","zh":"八位朋友凑成一组去周末旅行。"},{"en":"The poet describes an eightsome moving like one body across the field.","zh":"诗人描写八人一组在田野上行动，仿佛同一具身体。"}]},{"partOfSpeech":"n.","definition":{"en":"In Scottish tradition, an “eightsome reel” is a lively dance for eight dancers.","zh":"在苏格兰传统中，“eightsome reel”指一种由八名舞者表演的欢快里尔舞。"},"examples":[{"en":"They performed an eightsome reel at the ceilidh.","zh":"他们在苏格兰民间舞会（ceilidh）上跳了八人里尔舞。"},{"en":"The band played faster as the eightsome reel began.","zh":"八人里尔舞开始时，乐队把节奏演奏得更快了。"}]}],"synonyms":["octet","group of eight","set of eight"],"phonetic":"/ˈeɪt.səm/","extraExplanation":["“eightsome”由“eight + -some”构成，和“twosome / threesome / foursome”同一构词方式，表示“若干个……组成的一组”。现代日常英语里更常用“group of eight”或“octet”。","与苏格兰文化相关时常见搭配是“eightsome reel”。“reel”是一类传统舞曲与舞蹈形式；“ceilidh”是常见的苏格兰社交舞会/聚会场合。"]}
{"word":"eightvo","summary":{"en":"Octavo (8vo) is a book format/size made by folding a sheet into eight leaves (16 pages).","zh":"Octavo（8vo）指八开本：一张纸折成八张纸页（共16页）形成的开本/尺寸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In book publishing) a book size made by folding a printed sheet to form eight leaves (16 pages); also the book or format of that size.","zh":"（出版/装帧）八开本：把一张印好的大纸折成八张纸页（共16页）形成的开本；也指这种尺寸/版本的书。"},"examples":[{"en":"The library has an octavo edition of the poet’s collected works.","zh":"图书馆有这位诗人作品全集的八开本版本。"},{"en":"The catalog lists the book as “8vo,” meaning octavo.","zh":"目录把这本书标为“8vo”，意思就是八开本（octavo）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or printed in octavo format.","zh":"八开本的；以八开格式印刷的。"},"examples":[{"en":"They published an octavo volume for general readers.","zh":"他们为普通读者出版了一本八开本书。"}]}],"synonyms":["8vo","octavo edition","octavo format"],"phonetic":"/ɑkˈteɪvoʊ/","extraExplanation":["“eightvo”并不是常见的标准英文拼写。它很可能是把出版缩写“8vo”（读作 octavo）按发音误写成了“eightvo”。在旧式书目、拍卖目录或古籍描述里，常见 4to（quarto，四开）、8vo（octavo，八开）这类标记，用来说明纸张折叠方式与书本大致尺寸。"]}
{"word":"eightvos","summary":{"en":"“eightvos” isn’t a standard English word; it’s probably a name, typo, or coined term.","zh":"“eightvos”不是标准英语词；多半是名字、拼写错误或造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username/brand name, or a made-up term.","zh":"不是标准英语单词；更可能是拼写错误、用户名/品牌名，或人为造词。"},"examples":[{"en":"I can’t find “eightvos” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“eightvos”，你能把你看到它的句子发我吗？"},{"en":"Sometimes unusual strings like “eightvos” are just usernames or project names.","zh":"像“eightvos”这种不常见的字符串，有时只是用户名或项目名。"}]}],"phonetic":"ˈeɪt.voʊz","extraExplanation":["“eightvos”看起来像把两个部分拼在一起：eight（数字8）+ vos。vos 不是英语常用词：它在西班牙语里是“你”（一种地区用法），在法语里 vos 是“你们/您”（宾格/与格）。如果你是在英文语境里看到它，更可能是昵称、账号、密码样式或品牌名。","如果你想查的是别的词，常见接近的可能有：eight（8）、eighth（第八）、octavo（八开本/一种书本规格，发音类似“ok-TAH-voh”）。把原句发来我可以帮你精准判断。"]}
{"word":"Eighty","summary":{"en":"“Eighty” means the number 80, and it can also be used as an adjective before a noun (e.g., eighty dollars).","zh":"“Eighty”表示数字80，也可作形容词放在名词前（如：eighty dollars 八十美元）。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"The number 80.","zh":"数字 80（八十）。"},"examples":[{"en":"There are eighty students in the program.","zh":"这个项目里有八十名学生。"},{"en":"My grandfather is eighty years old.","zh":"我爷爷八十岁了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or consisting of 80 (often used before a noun).","zh":"与 80 有关的；由 80 构成的（常用于名词前）。"},"examples":[{"en":"They live in an eighty-story building.","zh":"他们住在一栋八十层的楼里。"},{"en":"She bought an eighty-dollar jacket.","zh":"她买了一件八十美元的夹克。"}]}],"synonyms":["80","fourscore"],"phonetic":"/ˈeɪti/","extraExplanation":["拼写提示：80 = eighty（不是 *eightty*）。","读数与时间表达：80 可说 “eighty”；年代常说 “the eighties”（例如：the 1980s = the nineteen eighties，中文常译“八十年代/80年代”）。","连字符用法：作形容词放在名词前时常加连字符：an eighty-year-old man（“一位八十岁的老人”；注意 year 用单数 old 也要保留）。"]}
{"word":"eighty","summary":{"en":"“Eighty” means the number 80, and it can also describe something related to 80 (e.g., an eighty-dollar jacket).","zh":"“eighty”表示数字80，也可作形容词表示“八十的/与80有关的”（如：80美元的夹克）。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"The number 80.","zh":"数字“80”（八十）。"},"examples":[{"en":"There are eighty students in the grade.","zh":"这个年级有八十名学生。"},{"en":"She turned eighty last year.","zh":"她去年满八十岁。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the number 80 (used before a noun).","zh":"与“80”有关的；八十的（放在名词前）。"},"examples":[{"en":"He bought an eighty-dollar jacket.","zh":"他买了一件80美元的夹克。"},{"en":"It’s an eighty-mile drive from here.","zh":"从这里开车过去有80英里。"}]}],"synonyms":["eighty (80)"],"phonetic":"/ˈeɪti/"}
{"word":"eightyfold","summary":{"en":"Eightyfold means “eighty times as much/many,” used to describe very large increases or magnification.","zh":"eightyfold 表示“八十倍”，常用于描述数量/程度的大幅增长或放大倍数。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Eighty times as many or as much; multiplied by 80.","zh":"八十倍的；增加到八十倍的（数量或程度为原来的80倍）。"},"examples":[{"en":"Profits rose eightyfold in just five years.","zh":"利润在短短五年内增长了八十倍。"},{"en":"The new microscope can magnify an image eightyfold.","zh":"这台新显微镜可以把图像放大八十倍。"}]},{"partOfSpeech":"adv.","definition":{"en":"By a factor of 80; to eighty times the original amount.","zh":"以八十倍的方式；达到原来的八十倍。"},"examples":[{"en":"The population increased eightyfold after the factory opened.","zh":"工厂开业后，人口增加到原来的八十倍。"},{"en":"Their online sales grew eightyfold during the holiday season.","zh":"假期期间，他们的线上销量增长了八十倍。"}]}],"synonyms":["eighty times","80 times","multiplied by eighty"],"phonetic":"/ˈeɪtiˌfoʊld/","extraExplanation":["“fold”在这里表示“倍数”，常见搭配有 twofold（三倍？注意：twofold=两倍）、threefold（三倍）、tenfold（十倍）、a hundredfold（百倍）。在较正式或文学/宗教语境中也会看到“X-fold”来强调增长幅度。","拼写有时也写作“eighty-fold”（加连字符），意思相同；现代写作中两种都能见到，连字符更常见于修饰名词时（如 an eighty-fold increase）。"]}
{"word":"eightytig","summary":{"en":"“eightytig” isn’t a dictionary word; it’s most likely a username or a custom term (possibly related to “eighty” or “TIG”).","zh":"“eightytig”不是词典里的标准词；更可能是用户名或自定义词（可能与“eighty”或“TIG”有关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, made-up term, or a username/handle.","zh":"不是标准英文单词；可能是拼写错误、造词，或用作用户名/网名。"},"examples":[{"en":"My username is eightytig on that forum.","zh":"我在那个论坛的用户名是 eightytig。"},{"en":"I couldn’t find “eightytig” in the dictionary—did you mean “eighty” or “TIG”?","zh":"我在词典里找不到“eightytig”——你是想写“eighty”还是“TIG”吗？"}]}],"phonetic":"ˈeɪti tɪɡ","extraExplanation":["“eightytig”看起来像由 two parts 组合而成：eighty（八十）+ tig。tig 可能是：\n1）某个名字/缩写（如 TIG 在技术语境里常指 Tungsten Inert Gas 焊接，即“钨极惰性气体保护焊/氩弧焊”）；\n2）某个绰号或自创拼写。\n如果你告诉我你想表达的语境（比如游戏ID、公司名、焊接、还是数字+动物），我可以帮你判断最可能的意思，并给出更准确的用法。"]}
{"word":"eign","summary":{"en":"“eign” is not a standard English word; you may mean “reign” or “feign.”","zh":"“eign”不是标准英语单词；你可能想写“reign”或“feign”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; usually a misspelling or a word ending seen in words like “reign” and “feign.”","zh":"本身不是标准英语单词；通常是拼写错误，或作为词尾出现在如“reign（统治）”“feign（假装）”等词中。"},"examples":[{"en":"I think you meant “reign” (to rule), not “eign.”","zh":"我觉得你想写的是“reign（统治）”，而不是“eign”。"},{"en":"If you meant “feign,” it means “to pretend.”","zh":"如果你想写的是“feign”，它的意思是“假装”。"}]}],"phonetic":"/eɪn/","extraExplanation":["“eign”看起来像是把“reign /reɪn/（统治，统治时期）”少写了开头的 r，或把“feign /feɪn/（假装）”拼错了。","英语里“reign”常用来谈国王/女王的统治时期（the reign of Queen Elizabeth II），而“feign”更偏书面语，常见搭配有：feign ignorance（装作不知情）、feign interest（假装感兴趣）。"]}
{"word":"eigne","summary":{"en":"“eigne” isn’t an English word; it’s likely a misspelling (usually “engine,” sometimes “eigen”).","zh":"“eigne” 不是英语单词；多半是拼错（通常是 “engine”，有时是数学里的 “eigen”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“eigne” is not a standard English word. It is most often a misspelling (commonly of “engine” or sometimes “eigen” in math).","zh":"“eigne” 不是标准英语单词，通常是拼写错误（常见是把 “engine” 拼错；在数学语境中也可能想写 “eigen”）。"},"examples":[{"en":"Did you mean “engine”? The engine wouldn’t start this morning.","zh":"你是想写 “engine” 吗？今天早上发动机启动不了。"},{"en":"In math, did you mean “eigen”? We need to compute the eigenvalues.","zh":"在数学里，你是想写 “eigen” 吗？我们需要计算特征值。"}]}],"phonetic":"/ˈendʒɪn/","extraExplanation":["“engine” 意为“发动机/引擎”，是日常高频词；而 “eigen-” 来自德语，常见于数学/物理词汇（如 eigenvalue 特征值、eigenvector 特征向量）。","如果你告诉我你看到 “eigne” 的句子（上下文），我可以更准确判断你想找的是哪个词，并给出完整释义与更多例句。"]}
{"word":"Eijkman","summary":{"en":"Eijkman is a Dutch surname, best known for scientist Christiaan Eijkman and for terms like the Eijkman test in microbiology.","zh":"Eijkman 是荷兰姓氏，最常指科学家克里斯蒂安·艾克曼，也用于微生物学中的“艾克曼试验”等术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Dutch surname; most commonly refers to Christiaan Eijkman (1858–1930), a scientist known for research that helped show beriberi is linked to a nutritional deficiency (later identified as vitamin B1).","zh":"荷兰姓氏；最常指克里斯蒂安·艾克曼（1858–1930），因研究揭示脚气病与营养缺乏有关（后来确认为维生素B1缺乏）而著名。"},"examples":[{"en":"Eijkman’s work on beriberi was an early step toward the discovery of vitamins.","zh":"艾克曼关于脚气病的研究，是通向维生素发现的早期关键一步。"},{"en":"The Eijkman Institute in Indonesia is named after Eijkman.","zh":"印度尼西亚的艾克曼研究所（Eijkman Institute）以艾克曼命名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(microbiology) relating to the Eijkman test, a lab test used to help identify certain bacteria (especially some E. coli) based on whether they can grow and produce gas at higher temperatures.","zh":"（微生物学）与“艾克曼试验（Eijkman test）”有关：一种实验室检测方法，用于根据细菌在较高温度下是否能生长并产气来辅助鉴定某些细菌（尤其是部分大肠杆菌）。"},"examples":[{"en":"The lab used the Eijkman test to check for fecal contamination in the water sample.","zh":"实验室用艾克曼试验来检查水样是否存在粪便污染。"},{"en":"Some textbooks mention Eijkman test results when discussing coliform bacteria.","zh":"一些教材在讲解大肠菌群时会提到艾克曼试验的结果。"}]}],"phonetic":"/ˈaɪkmən/","extraExplanation":["“Eijkman”通常在科学史语境中出现，尤其与脚气病（beriberi）研究相关。艾克曼在爪哇（今印度尼西亚）工作时观察到：吃精白米的群体更容易出现类似脚气病的症状，而改吃未精制的米（含米糠）后症状改善。这一现象后来与维生素B1（硫胺素）缺乏联系起来。","他与另一位科学家弗雷德里克·霍普金斯（Frederick G. Hopkins）共同获得1929年诺贝尔生理学或医学奖（表彰其在维生素相关发现上的贡献）。","发音上，英语里常读作“EYEK-mən”（/ˈaɪkmən/）；作为人名/姓氏，大小写要大写：Eijkman。"]}
{"word":"eikon","summary":{"en":"Eikon means “image/likeness,” especially in Greek Bible/theology, and can also refer to a sacred religious icon.","zh":"Eikon 指“形象/肖像/相似物”，常用于希腊文圣经与神学；也可指宗教传统中的“圣像”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An image, likeness, or representation; a transliteration of the Greek word εἰκών, often used in Bible studies and theology.","zh":"形象、肖像、代表；源自希腊语 εἰκών 的音译词，常见于圣经研究与神学语境。"},"examples":[{"en":"In Greek, eikon can mean an image or likeness of something real.","zh":"在希腊语中，eikon 可以指某个真实事物的“形象”或“相似物”。"},{"en":"Some translations connect the word eikon with the idea of humans being made in God’s image.","zh":"一些译注会把 eikon 与“人按上帝的形象被造”的观念联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A sacred icon—especially a painted image used in Eastern Orthodox and Eastern Catholic Christian worship and devotion.","zh":"圣像（宗教圣像画）；尤指东正教与东方礼天主教传统中用于礼拜与敬礼的圣像图像。"},"examples":[{"en":"They lit a candle in front of an eikon during the service.","zh":"礼拜时，他们在一幅圣像（eikon）前点燃了蜡烛。"},{"en":"In some traditions, an eikon is not just art but a focus for prayer.","zh":"在一些传统里，eikon 不只是艺术品，也是一种祈祷的凝聚点。"}]}],"synonyms":["icon","image","likeness","representation","portrait"],"phonetic":"/ˈaɪ.kɑn/","extraExplanation":["eikon（εἰκών）在英语里多见于神学与圣经原文讨论，常出现在对《歌罗西书》1:15（“基督是那不能看见之神的像”）等经文的释义中。","与日常英语 icon 不同，eikon 更像“学术/宗教用语”：强调“像/形象/代表”的概念背景，而不是“电脑图标”或“流行偶像”。"]}
{"word":"eikones","summary":{"en":"Eikones is a Greek plural meaning “images/representations,” often used in biblical or classical contexts.","zh":"Eikones 是希腊语复数，意为“图像/表象/形象”，常见于圣经或古典语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek, plural of eikōn) images; likenesses; representations (often used in Bible/ancient Greek studies).","zh":"（希腊语，eikōn 的复数）图像；肖像；形象；表象（常见于圣经或古希腊文研究语境）。"},"examples":[{"en":"In the Greek text, the word eikones refers to images or representations.","zh":"在希腊文原文中，eikones 指“图像”或“表象”。"},{"en":"Some writers discuss eikones when talking about religious icons and their meaning.","zh":"一些作者在讨论宗教圣像及其意义时会使用 eikones 这个词。"}]}],"synonyms":["icons","images","representations","likenesses"],"phonetic":"/iˈkoʊniz/","extraExplanation":["eikones（εἰκόνες）是 eikōn（εἰκών）的复数形式。eikōn 的核心意思是“形象/像”，英语 icon（图标；圣像）就来自同一词源。","在神学与艺术史语境中，eikones 常用来讨论“圣像（icons）”与“偶像（idols）”的区别：前者通常被理解为“指向/象征”，后者常被批评为“把对象当作神来崇拜”。具体含义会随语境与宗派传统而变。"]}
{"word":"Eikonogen","summary":{"en":"Eikonogen is an old name for a chemical developer used in early black-and-white photographic processing.","zh":"Eikonogen 是一种旧称的化学显影剂，曾用于早期黑白摄影的冲洗显影。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical (a photographic developer) formerly used to develop black-and-white photographs.","zh":"（旧称）爱康诺根：一种早期用于冲洗黑白照片的化学显影剂。"},"examples":[{"en":"Early photographers sometimes developed negatives with eikonogen.","zh":"早期摄影师有时会用 eikonogen 来显影底片。"},{"en":"The manual mentions eikonogen as an alternative developer, but it is rarely used today.","zh":"说明书提到 eikonogen 可作为替代显影剂，但如今很少使用。"}]}],"synonyms":["photographic developer","developer (photography)"],"phonetic":"/aɪˈkɑːnəˌdʒɛn/","extraExplanation":["词源提示：eikonogen 常被解释为来自希腊语词根 eikōn（“图像、肖像”）+ -gen（“产生、生成”），大意是“生成影像的东西”，与其作为“显影剂”的用途相呼应。","使用语境：该词多见于19—20世纪早期的摄影与化学资料、旧配方、博物馆或暗房历史讨论中；现代摄影更常见的是其他显影剂名称（如 D-76、Rodinal 等）。"]}
{"word":"eikonogen","summary":{"en":"Eikonogen is an old or rare term for a photographic developing chemical.","zh":"Eikonogen 是一个较旧且少见的词，指用于摄影冲洗的化学显影剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical used as a photographic developer (a substance that helps bring out an image on film or photographic paper).","zh":"（摄影）显影剂；用于使胶片或相纸上的影像显现出来的化学显影药剂。"},"examples":[{"en":"In early darkrooms, eikonogen was sometimes used to develop black-and-white photographs.","zh":"在早期暗房里，人们有时会用 eikonogen 来冲洗黑白照片。"},{"en":"The technician switched developers, choosing eikonogen for a softer tonal look.","zh":"技术员更换了显影液，选择 eikonogen 来获得更柔和的影调。"}]}],"synonyms":["developer","photographic developer","developing agent"],"phonetic":"/aɪˈkɑːnədʒən/","extraExplanation":["“eikonogen”较少见，常被视为“iconogen”的变体拼写；词源可理解为希腊语词根 eikon（图像）+ -gen（产生、生成），字面含义接近“生成影像的东西”。","在摄影史语境中，它指一种较早期被使用的显影剂名称（有时也作为商品名出现）。现代摄影与暗房化学品中更常见的说法是直接用“developer（显影液/显影剂）”。"]}
{"word":"eikonology","summary":{"en":"Eikonology (more commonly spelled iconology) is the study of interpreting images and symbols, especially in art and cultural history.","zh":"eikonology（更常写作 iconology）指“图像学”，即研究并阐释艺术与文化中的图像和符号含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study and interpretation of images, symbols, and visual motifs—especially in art and cultural history—to understand their meanings and social or religious context.","zh":"图像学；对图像、符号与视觉母题的研究与阐释（尤用于艺术史与文化史），以理解其含义及社会/宗教语境。"},"examples":[{"en":"In her thesis, she uses eikonology to explain why the painting repeats the same religious symbols.","zh":"在她的论文中，她用图像学来解释这幅画为何反复出现同样的宗教符号。"},{"en":"Eikonology helps us read a medieval altar piece as more than decoration.","zh":"图像学帮助我们把中世纪祭坛画理解为不只是装饰品。"}]},{"partOfSpeech":"n.","definition":{"en":"A book, catalogue, or system that classifies and describes images, emblems, or iconographic themes.","zh":"图像志；对图像、徽章或图像主题进行分类与描述的书、目录或体系。"},"examples":[{"en":"The museum published an eikonology of common symbols found in local folk art.","zh":"博物馆出版了一本关于本地民间艺术常见符号的图像志。"}]}],"synonyms":["iconology","study of symbols","visual symbolism","iconography (related)"],"phonetic":"/ˌaɪkəˈnɑlədʒi/","extraExplanation":["“eikonology”是“iconology”的较少见拼写形式之一，源自希腊语 eikōn（意为“图像/肖像”）+ -logy（“学科/研究”）。现代学术语境中更常用的拼写是 iconology；而 iconography（图像志/图像题材描述）常被用来指“描述与归类图像题材”，iconology则更强调“解释图像背后的文化意义”。","在艺术史领域，这个词常与学者埃尔温·潘诺夫斯基（Erwin Panofsky）的研究方法联系在一起：从识别图像内容（是什么）到解释象征意义（为什么这么画）。"]}
{"word":"eikons","summary":{"en":"“Eikons” means images or representations, often religious icons or symbolic images (plural of “eikon”).","zh":"“eikons”指图像或形象，常用于宗教圣像或象征性图像的语境（为“eikon”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of eikon: images or representations, especially religious icons or symbolic images.","zh":"eikon 的复数：图像、形象或表现物，尤指宗教圣像或具有象征意义的图像。"},"examples":[{"en":"The museum displayed Byzantine eikons in a dimly lit gallery.","zh":"博物馆在昏暗的展厅里展出了拜占庭圣像（eikons）。"},{"en":"In the essay, the poet uses eikons to represent memory and loss.","zh":"在这篇文章中，诗人用一系列象征性图像（eikons）来表现记忆与失落。"},{"en":"Old family photos became eikons of a vanished childhood.","zh":"旧家庭照片成了逝去童年的象征性图像（eikons）。"}]}],"synonyms":["icons","images","representations","depictions","portraits"],"phonetic":"/ˈaɪˌkɑnz/","extraExplanation":["“eikon”源自希腊语 εἰκών（eikōn），意为“形象、图像”。它与现代英语的“icon（图标/偶像）”同源。","在艺术史或宗教学语境中，“eikon(s)”常指东正教传统中的“圣像”（如耶稣、圣母或圣徒的绘像），带有敬礼与象征意义。","在文学/批评写作中，“eikon(s)”有时会被用作较书面、较学术的词，强调“承载象征意义的图像/意象”，而不只是普通的“picture”。"]}
{"word":"eila","summary":{"en":"Eila is most commonly used as a personal name (proper noun) in English contexts.","zh":"Eila 在英语语境中最常见的用法是作为人名（专有名词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name), used especially for women; meaning and origin depend on the culture/family and are not fixed in English.","zh":"人名（名字），常见为女性名；其含义与来源因文化与家庭而异，在英语中没有统一固定的词义。"},"examples":[{"en":"Eila introduced herself at the start of the meeting.","zh":"会议一开始，Eila 做了自我介绍。"},{"en":"I’m not sure how to pronounce Eila—could you say it once more?","zh":"我不确定 Eila 怎么读——你能再说一遍吗？"}]}],"phonetic":"/ˈeɪlə/","extraExplanation":["“Eila”在英语里通常被当作专有名词（人名）使用，写作时一般首字母大写：Eila。","发音在不同地区可能有差异；在美式英语里常见读法可近似为 /ˈeɪlə/（类似“AY-luh”）。如果你提供语境（比如是人名、地名、缩写、还是你想查的英文单词拼写），我可以给出更准确的解释。"]}
{"word":"Eilat","summary":{"en":"Eilat is a resort and port city in southern Israel on the Red Sea; it can also refer to the nearby Gulf of Eilat.","zh":"Eilat（埃拉特）是以色列南部红海边的度假与港口城市；也可指其附近的“埃拉特湾”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southern Israel on the Red Sea (Gulf of Aqaba), known as a resort and port city.","zh":"以色列最南端的一座城市，位于红海（亚喀巴湾/埃拉特湾）沿岸，以度假旅游和港口闻名。"},"examples":[{"en":"We flew to Eilat for a winter vacation by the Red Sea.","zh":"我们飞去埃拉特，在红海边度过冬季假期。"},{"en":"Eilat is close to the borders with Egypt and Jordan.","zh":"埃拉特靠近与埃及和约旦的边境。"}]},{"partOfSpeech":"n.","definition":{"en":"The gulf/area of the Red Sea next to Eilat (often called the Gulf of Eilat).","zh":"埃拉特附近的红海海域（常称“埃拉特湾”）。"},"examples":[{"en":"The Gulf of Eilat is famous for snorkeling and coral reefs.","zh":"埃拉特湾以浮潜和珊瑚礁著名。"}]}],"synonyms":["Gulf of Aqaba (related term)","Aqaba (nearby city)"],"phonetic":"/eɪˈlɑːt/","extraExplanation":["“Eilat”是地名（专有名词），英语里常见搭配有：Eilat airport（埃拉特机场）、Eilat Mountains（埃拉特山地）、Gulf of Eilat（埃拉特湾）。","地理与称呼上有时会看到“Gulf of Aqaba（亚喀巴湾）”与“Gulf of Eilat（埃拉特湾）”并用：前者是更大的海湾名称，后者强调靠近以色列埃拉特一侧。"]}
{"word":"eild","summary":{"en":"“Eild” is a Scots/archaic word meaning “age,” especially “old age.”","zh":"“eild”是苏格兰英语/古语，用来表示“年龄”，尤指“老年”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, archaic) Age; old age.","zh":"（苏格兰英语，古语）年龄；老年。"},"examples":[{"en":"In Scots writing, “eild” often means old age.","zh":"在苏格兰英语的作品里，“eild”常指“老年”。"},{"en":"He reached great eild, yet stayed sharp in mind.","zh":"他活到高龄，但头脑依然清醒。"}]}],"synonyms":["old age","age","advanced years"],"phonetic":"/eɪld/","extraExplanation":["“eild”主要见于苏格兰英语（Scots）与较古老的文学用法，现代日常英语里很少用。更常见的对应词是 age / old age / elderly years。","词源上与古英语中表示“年龄/老年”的词有关，因此在拼写上看起来不像现代英语常见词。","如果你本来想查的是拼写相近的 wild（野性的；野外的）或 child（孩子），告诉我句子语境，我可以帮你确认。"]}
{"word":"Eileen","summary":{"en":"Eileen is a common female first name in English, especially with Irish connections.","zh":"Eileen 是英语里常见的女性名字，常与爱尔兰背景相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"（女性）名字；（女子）教名。"},"examples":[{"en":"Eileen is my older sister.","zh":"Eileen 是我姐姐。"},{"en":"Please ask Eileen to join the meeting at 3 p.m.","zh":"请让 Eileen 下午三点参加会议。"},{"en":"I met an Eileen from Ireland at the conference.","zh":"我在会议上认识了一位来自爱尔兰的 Eileen。"}]}],"synonyms":["Helen","Aileen"],"phonetic":"/aɪˈliːn/","extraExplanation":["Eileen 常见于英语国家，传统上多见于爱尔兰/苏格兰语境。","词源上常被认为来自爱尔兰语名字 Eibhlín（英语化为 Eileen），而 Eibhlín 又与 Helen/Helena 同源或相关，因此有时被解释为“光、明亮（bright/shining）”之意。","在书面表达中，Eileen 作为专有名词首字母必须大写；称呼不熟悉的人时，可用 Ms. + 姓氏，而不是 Ms. Eileen。"]}
{"word":"Eileithyia","summary":{"en":"A Greek goddess of childbirth, invoked for help in labor and delivery.","zh":"希腊神话中的分娩女神，人们祈求她保佑生产顺利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Eileithyia: a goddess in ancient Greek mythology associated with childbirth and labor pains; she was prayed to for help in safe delivery.","zh":"Eileithyia（希腊神话）：与分娩、产痛有关的女神；人们会向她祈求顺利生产与平安分娩。"},"examples":[{"en":"In Greek myths, Eileithyia could speed up or delay a birth.","zh":"在希腊神话中，Eileithyia 能加快或延迟分娩。"},{"en":"The poem mentions Eileithyia as a symbol of motherhood and new life.","zh":"这首诗提到 Eileithyia，把她当作母性与新生命的象征。"}]}],"synonyms":["Ilithyia","the Greek goddess of childbirth"],"phonetic":"/ˌaɪlɪˈθaɪə/","extraExplanation":["Eileithyia 常被写作 Ilithyia，是较常见的拼写变体。","她在神话中常与赫拉（Hera）相关；一些故事里，赫拉会派她来“阻止”某人的出生，从而制造戏剧冲突（例如延缓英雄诞生）。","在英文文本里，这个名字多出现在古典文学、神话学、诗歌或艺术史语境中，作为“分娩/诞生力量”的象征意象。"]}
{"word":"Eilis","summary":{"en":"Eilis is an Irish-origin female given name, often associated with the Irish form of Elizabeth.","zh":"Eilis 是源自爱尔兰的女性名字，常被认为是 Elizabeth（伊丽莎白）的爱尔兰变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name of Irish origin (often written as Eilís in Irish), commonly treated as an Irish form of Elizabeth.","zh":"一个源自爱尔兰的女性名字（爱尔兰语常写作 Eilís），通常被视为 Elizabeth（伊丽莎白）的爱尔兰变体。"},"examples":[{"en":"Eilis moved to New York for her first job.","zh":"Eilis 为了第一份工作搬到了纽约。"},{"en":"Her name, Eilis, reflects her Irish family background.","zh":"她的名字 Eilis 体现了她的爱尔兰家庭背景。"}]}],"synonyms":["Eilís","Eilish","Ailish","Elizabeth"],"phonetic":"/ˈeɪlɪʃ/","extraExplanation":["在爱尔兰语里，这个名字常写作 **Eilís**，中间的“í”上面的重音符号（fada）提示元音读得更长。英语环境中可能出现不同读法与拼写（如 Eilis / Eilish），通常取决于家族传统或个人偏好。","文学/影视中较知名的例子是小说与电影 **《Brooklyn》** 的女主角 **Eilis Lacey**，因此这个名字在英语读者里也常因该作品而被熟悉。"]}
{"word":"eille","summary":{"en":"“Eille” is a Quebec French interjection meaning “hey!” used to get attention.","zh":"“Eille”是魁北克法语里的感叹词，意思接近“hey”，用于引起注意。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Quebec French) A casual exclamation used to get someone’s attention, similar to “hey!” or “yo!” in English.","zh":"（魁北克法语）用来引起别人注意的口语感叹词，类似英语的“hey!”“yo!”。"},"examples":[{"en":"Eille, come here for a second!","zh":"Eille，过来一下！"},{"en":"Eille! Watch out!","zh":"Eille！小心！"},{"en":"Eille, what are you doing?","zh":"Eille，你在干嘛？"}]}],"synonyms":["hey","yo","listen"],"phonetic":"eɪ","extraExplanation":["“Eille”（也常写作“Eille!”）主要出现在加拿大魁北克的日常口语中，语气从随意打招呼到提醒、轻微不满都可以，具体靠语境和语调判断。","它常被英语学习者在魁北克的双语环境中听到：在英语句子里夹用“Eille”也很常见，类似把“hey”换成更本地的说法。"]}
{"word":"Eilshemius","summary":{"en":"Eilshemius: the surname of Louis Michel Eilshemius, an American painter and writer (1864–1941).","zh":"Eilshemius：美国画家与作家路易·米歇尔·艾尔谢米乌斯（1864–1941）的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Louis Michel Eilshemius (1864–1941), an American painter and writer known for dreamy, symbolic paintings—often of nudes, forests, and myth-like scenes.","zh":"路易·米歇尔·艾尔谢米乌斯（1864–1941），美国画家与作家，以梦幻、象征主义风格的绘画著称，常画裸像、森林与带神话气息的场景。"},"examples":[{"en":"Eilshemius is sometimes linked to Symbolism because of his imaginative, dreamlike scenes.","zh":"艾尔谢米乌斯常因富于想象、梦境般的画面而被与象征主义联系起来。"},{"en":"The museum label credits Eilshemius as both the painter and the author of several writings on art.","zh":"博物馆说明牌写明艾尔谢米乌斯既是画家，也写过多篇艺术相关文章。"}]}],"synonyms":["(proper name; no true synonyms)"],"phonetic":"/ˌiːlʃeɪˈmiːəs/","extraExplanation":["“Eilshemius”主要作为姓氏出现，常指画家 Louis Michel Eilshemius。他的作品在生前评价较为两极；后来因艺术家马塞尔·杜尚（Marcel Duchamp）的支持与推广而更受关注。","在英文语境中，这个词通常不会当作普通词汇使用，而是在艺术史、展览说明、传记或评论文章中作为专有名词出现。"]}
{"word":"Eimak","summary":{"en":"Eimak (more commonly spelled Aimak/Aimaq) refers to the Aimak peoples of Afghanistan, or something related to them.","zh":"Eimak（更常见拼写为 Aimak/Aimaq）指阿富汗的艾马克人，或与其相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Aimak (Aimaq) peoples, a group of mainly Persian-speaking tribal communities in western and central Afghanistan","zh":"艾马克人（也写作 Aimaq/Aimak）的一员：阿富汗西部与中部一些以波斯语系语言为主的部族社群的统称"},"examples":[{"en":"Some Eimak communities live in the hills west of Kabul.","zh":"一些艾马克社群生活在喀布尔以西的丘陵地区。"},{"en":"The report mentions Eimak herders and their seasonal migration routes.","zh":"报告提到艾马克牧民及其季节性迁徙路线。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Aimak (Aimaq) peoples or their language and culture","zh":"与艾马克人（Aimak/Aimaq）及其语言、文化有关的"},"examples":[{"en":"Researchers recorded Eimak folk songs during the festival.","zh":"研究人员在节日期间录制了艾马克民歌。"}]}],"synonyms":["Aimak","Aimaq","Chahar Aimaq"],"phonetic":"/ˈaɪmɑk/","extraExplanation":["“Eimak”更常见的英语拼写是“Aimak”或“Aimaq”。该名称常被用作“部族联盟/部族群体”的统称，而不是单一民族；不同地区的艾马克社群在方言、生活方式（如游牧或半游牧）等方面可能有差异。","在英文资料中，你也可能看到“Chahar Aimaq（四艾马克）”这一说法，用来指代历史上被归为同一类的几个主要部族群体。"]}
{"word":"eimak","summary":{"en":"Eimak is a less common spelling of Aimaq/Aimak, referring to a traditionally semi-nomadic, mainly Persian-speaking people (or tribal grouping) in Afghanistan.","zh":"Eimak 是 Aimaq/Aimak 的较少见拼写，指阿富汗境内传统上半游牧、主要讲波斯语的族群（或部族联合体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of Aimaq (also spelled Aimak), a group of mainly Persian-speaking, traditionally semi-nomadic people in Afghanistan; sometimes used more broadly for several related tribes in western/central Afghanistan","zh":"Aimaq（也写作 Aimak / Eimak）的一种拼写形式，指阿富汗境内以波斯语为主、传统上半游牧的族群；有时也泛指阿富汗中西部若干相关部族的统称"},"examples":[{"en":"The report mentions Aimaq (Aimak/Eimak) communities in western Afghanistan.","zh":"报告提到了阿富汗西部的 Aimaq（也写作 Aimak/Eimak）社区。"},{"en":"Some families identify as Aimaq while also belonging to specific tribes within the Aimaq confederation.","zh":"有些家庭自称 Aimaq，同时也属于 Aimaq 联盟中的某个具体部族。"}]}],"synonyms":["Aimaq","Aimak"],"phonetic":"/ˈaɪmæk/","extraExplanation":["“Eimak”在英语里不算最常见拼写，更常见的是“Aimaq”。不同资料会因为转写系统（把波斯语/达里语写成拉丁字母的方法不同）而出现 Aimak、Aimaq、Eimak 等变体。","“Aimaq”在一些语境里不仅是单一民族名称，也可能是对若干部族（例如不同地区的群体）的统称；写作时最好参考具体来源对该词的定义。"]}
{"word":"Eimeria","summary":{"en":"Eimeria is a genus of protozoan parasites that infect animals’ intestines and can cause coccidiosis.","zh":"Eimeria（艾美耳属）是一类感染动物肠道的原虫寄生虫，可引起球虫病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of microscopic parasites (protozoa) that infect the intestines of animals and can cause coccidiosis, especially in poultry, rabbits, and cattle","zh":"艾美耳属：一类显微寄生虫（原虫）的属名，可感染动物肠道并引起球虫病（coccidiosis），常见于家禽、兔和牛等"},"examples":[{"en":"Chicks can get sick if they are infected with Eimeria.","zh":"小鸡如果感染艾美耳属球虫，可能会生病。"},{"en":"The vet suspected coccidiosis caused by Eimeria after seeing bloody diarrhea.","zh":"兽医在看到血便后，怀疑是由艾美耳属球虫引起的球虫病。"},{"en":"Good hygiene in animal housing helps reduce the spread of Eimeria.","zh":"保持圈舍清洁有助于减少艾美耳属球虫的传播。"}]}],"synonyms":["coccidia (broader term)","coccidian parasite (general)"],"phonetic":"/aɪˈmɪəriə/","extraExplanation":["Eimeria 常用于兽医学与畜牧业语境，和“coccidia（球虫）/ coccidiosis（球虫病）”经常一起出现。严格来说，Eimeria 是球虫中的一个“属”，而不是所有球虫的总称。","在英文写作中，属名 Eimeria 通常首字母大写并斜体（Eimeria），单个物种名会写成属名+种加词（如 Eimeria tenella）。日常科普或非正式文本里有时不严格斜体。"]}
{"word":"Eimile","summary":{"en":"“Eimile” is likely a misspelling of “Émile/Emile,” a French given name and also the title of Rousseau’s book.","zh":"“Eimile” 可能是“Émile/Emile”的误拼：它既是法语人名，也可指卢梭的著作《爱弥儿》。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually masculine) of French origin, often written “Émile” or “Emile.”","zh":"（人名）常见的法语男性名字，常写作“Émile / Emile”。"},"examples":[{"en":"Émile is a common French boy’s name.","zh":"Émile 是一个常见的法语男孩名字。"},{"en":"The author named the main character Emile.","zh":"作者把主角取名为 Emile。"}]},{"partOfSpeech":"other","definition":{"en":"the title/name of Jean-Jacques Rousseau’s famous book “Émile, or On Education,” about how children should be educated.","zh":"让-雅克·卢梭的著名著作《爱弥儿》（Émile, or On Education）的书名，讨论儿童教育理念。"},"examples":[{"en":"In class, we discussed Rousseau’s Émile.","zh":"课上我们讨论了卢梭的《爱弥儿》。"},{"en":"Émile influenced later ideas about education.","zh":"《爱弥儿》影响了后来的教育思想。"}]}],"synonyms":["Emile","Émile"],"phonetic":"/eɪˈmiːl/","extraExplanation":["“Eimile” 不是常见英文单词拼写；你可能想写的是 **Emile/Émile**（法语名），或 **Emily**（常见英文女名）。如果你告诉我你指的是哪一个（名字/书名/别的词），我可以给更准确的释义与用法。","Émile 源自拉丁语名字 *Aemilius*（古罗马家族名），在英语语境里多被当作外来人名使用。"]}
{"word":"Eimmart","summary":{"en":"Eimmart is mainly a proper name: a German surname, especially linked to the astronomer-artist Georg Christoph Eimmart, and sometimes used as the name of a lunar feature.","zh":"Eimmart 主要是专有名词：一个德国姓氏（尤其与天文学家兼艺术家格奥尔格·克里斯托夫·艾姆马特相关），有时也用于月球地貌名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German surname (a family name), most famously associated with Georg Christoph Eimmart (1638–1705), a German astronomer and artist.","zh":"一个德国姓氏（家族姓），最著名的相关人物是格奥尔格·克里斯托夫·艾姆马特（1638–1705），德国天文学家兼艺术家。"},"examples":[{"en":"Eimmart is a surname you may see in the history of early European astronomy.","zh":"在欧洲早期天文学史中，你可能会看到“Eimmart”这个姓氏。"},{"en":"The museum label mentioned Eimmart as both an observer of the sky and a skilled draftsman.","zh":"博物馆的说明牌提到，Eimmart 既是天空的观测者，也是技艺精湛的绘图者。"}]},{"partOfSpeech":"n.","definition":{"en":"(astronomy) the name used for a lunar feature (for example, “Eimmart” can refer to a crater on the Moon in some naming contexts).","zh":"（天文学）用作月球地貌的名称（例如在某些命名语境中，“Eimmart”可指月球上的一座环形山）。"},"examples":[{"en":"The map marked Eimmart near other labeled craters.","zh":"地图在其他已标注的环形山旁标出了 Eimmart。"},{"en":"Our group used a lunar chart to locate Eimmart during the observation session.","zh":"我们小组在观测时用月面图来定位 Eimmart。"}]}],"synonyms":["proper name","surname"],"phonetic":"ˈaɪmɑrt","extraExplanation":["“Eimmart”更常见于专有名词语境（人名/地名/天体地貌名），不是日常英语词汇。","格奥尔格·克里斯托夫·艾姆马特（Georg Christoph Eimmart）是17世纪的德国天文学家与版画/绘图者，因天文观测与相关图像作品而为后人所知。若你是在书名、地图或论文里看到这个词，多半是在指他本人或以他命名的对象。","如果你是在某篇文章里遇到“Eimmart”，可以把上下文（句子或截图）发来，我可以帮你判断具体指的是人名、地名，还是月球地貌名。"]}
{"word":"ein","summary":{"en":"“ein” is a German word meaning “a/an” and also “one.”","zh":"“ein”是德语词，既可表示不定冠词“一个/一位（a/an）”，也可表示数字“一”。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"(German) the indefinite article meaning “a/an” (used mainly with masculine or neuter nouns in the nominative case).","zh":"（德语）不定冠词，意思是“一个/一位（a/an）”，主要用于主格的阳性或中性名词前。"},"examples":[{"en":"In German, “ein Mann” means “a man.”","zh":"在德语里，“ein Mann”意思是“一个男人”。"},{"en":"She ordered in German: “Ein Kaffee, bitte.” (“A coffee, please.”)","zh":"她用德语点单：“Ein Kaffee, bitte.”（“请来一杯咖啡。”）"}]},{"partOfSpeech":"num.","definition":{"en":"(German) the number “one.”","zh":"（德语）数字“一”。"},"examples":[{"en":"“eins, zwei, drei” means “one, two, three.”","zh":"“eins, zwei, drei”意思是“一、二、三”。"},{"en":"He wrote “ein” on the board and said it meant “one.”","zh":"他在黑板上写了“ein”，并说它的意思是“一”。"}]}],"synonyms":["a/an","one"],"phonetic":"/aɪn/","extraExplanation":["“ein”在德语里会随着性、数、格变化：比如“ein Mann”（一位男士，主格）、“einen Mann”（一位男士，宾格）、“eine Frau”（一位女士）、“ein Kind”（一个孩子）。所以你在不同句子里可能会看到ein/einen/eine等形式。","在英语语境中看到“ein”，通常是引用德语（点餐、台词、歌词、标题等），发音在英语里常近似/aɪn/。"]}
{"word":"Einar","summary":{"en":"Einar is a Nordic male given name (especially Icelandic), historically linked to the Old Norse name Einarr.","zh":"Einar 是北欧常见的男性名字（尤其在冰岛），源自古诺尔斯语名字 Einarr。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, common in Iceland and other Nordic countries","zh":"男性名字，在冰岛及其他北欧国家较常见"},"examples":[{"en":"Einar is my classmate from Iceland.","zh":"Einar 是我来自冰岛的同学。"},{"en":"In the novel, Einar is a quiet but brave fisherman.","zh":"在小说里，Einar 是一位安静但勇敢的渔夫。"}]}],"synonyms":["Einarr","Ejnar"],"phonetic":"/ˈaɪ.nɑr/","extraExplanation":["“Einar”源自古诺尔斯语（Old Norse）名字 **Einarr**，常被解释为“独自/唯一的战士”（大致可理解为 *one/alone + warrior*）。因此它在北欧文化中常带有勇士、坚毅的联想。","在英语语境里，Einar 通常被当作外来人名使用；书写时首字母大写。常见昵称有 **Eini**（更偏北欧用法）。"]}
{"word":"Einberger","summary":{"en":"Einberger is typically used in English as a German-origin surname.","zh":"Einberger 在英语中通常作为一个源自德语的姓氏使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a German-origin surname (family name).","zh":"一个源自德语的姓氏（家族姓）。"},"examples":[{"en":"Dr. Einberger will speak at the conference tomorrow.","zh":"Einberger 医生将于明天在会议上发言。"},{"en":"My teacher’s last name is Einberger.","zh":"我老师的姓是 Einberger。"}]}],"synonyms":["(no true synonyms; proper name)"],"phonetic":"/ˈaɪnˌbɝɡɚ/","extraExplanation":["“Einberger”在英语里通常被当作专有名词（人名/姓氏）使用，而不是常见词汇；具体含义往往与家族来源或地名有关。","发音在英语环境中可能会因个人或家庭习惯而变化；上面的读音是常见的英语化读法。"]}
{"word":"Eindhoven","summary":{"en":"Eindhoven: a major technology-and-design city in the southern Netherlands.","zh":"Eindhoven：荷兰南部一座以科技与设计著称的重要城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the southern Netherlands (North Brabant), known for technology and design; it is home to major companies (historically Philips) and the Eindhoven University of Technology (TU/e).","zh":"荷兰南部（北布拉班特省）的一座城市，以科技与设计闻名；历史上与飞利浦（Philips）关系密切，并拥有埃因霍温理工大学（TU/e）。"},"examples":[{"en":"I’m flying to Eindhoven for a tech conference.","zh":"我要飞去埃因霍温参加一个科技会议。"},{"en":"Eindhoven is often associated with Philips and innovation.","zh":"埃因霍温常常与飞利浦和创新联系在一起。"},{"en":"She studied engineering at Eindhoven University of Technology.","zh":"她在埃因霍温理工大学学习工程。"}]}],"phonetic":"/ˈaɪntˌhoʊvən/","extraExplanation":["“Eindhoven”是专有名词（地名），英语里通常不翻译，只在中文语境中音译为“埃因霍温”。","这座城市常被称为荷兰的“高科技之城”，与High Tech Campus Eindhoven（高科技园区）以及Brainport（创新产业集群）相关。","文化与体育方面，Eindhoven也以Dutch Design Week（荷兰设计周）和足球俱乐部PSV Eindhoven闻名。"]}
{"word":"EINE","summary":{"en":"“eine” is German for “a/an” with feminine singular nouns, and it can also mean “one.”","zh":"「eine」是德語陰性單數名詞用的「一個／一位」（a/an），也可表示「一」。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"a / an (indefinite article used with feminine singular nouns in German; also used for all genders in the plural negative form “keine,” but “eine” itself is feminine singular)","zh":"一個／一位（德語不定冠詞，用於陰性單數名詞的主格與賓格，相當於英語 a/an）"},"examples":[{"en":"Ich habe eine Katze.","zh":"我有一隻（母）貓。"},{"en":"Sie kauft eine Tasche.","zh":"她買一個包。"},{"en":"Das ist eine gute Idee.","zh":"那是一個好主意。"}]},{"partOfSpeech":"pron.","definition":{"en":"one (used to mean “one” with feminine nouns, often when counting or emphasizing a single item)","zh":"一個／一（用於陰性名詞，表示「一」，常見於數數或強調只有一個）"},"examples":[{"en":"Ich nehme eine (Tasse).","zh":"我拿一個（杯子）。"},{"en":"Eine fehlt noch.","zh":"還差一個。"}]}],"synonyms":["ein (masculine/neuter form)","eins (used more as the standalone number “one”)"],"phonetic":"ˈaɪnə","extraExplanation":["「eine」是德語不定冠詞「ein」的陰性形式。德語冠詞會隨「性（陽/陰/中）+ 格（主格/賓格/與格/屬格）」變化：\n- 主格/賓格（陰性）：eine\n- 與格/屬格（陰性）：einer\n常見對照：\n- ein Mann（陽）/ eine Frau（陰）/ ein Kind（中）\n如果你告訴我後面接的名詞或整句話，我也可以幫你判斷應該用 eine / einer / einem / einen。"]}
{"word":"eine","summary":{"en":"“eine” is German for “a/an; one,” used mainly as the feminine singular indefinite article (nominative/accusative).","zh":"“eine”是德语里表示“一个/一位；一”的形式，主要用作阴性单数不定冠词（主格/宾格）。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"(German) “a/an; one” — the feminine form of the indefinite article, used with feminine singular nouns in the nominative or accusative case.","zh":"（德语）“一个；一位”——不定冠词的阴性形式，用于阴性单数名词的主格或宾格。"},"examples":[{"en":"Eine Frau steht vor der Tür.","zh":"一位女士站在门口。"},{"en":"Ich habe eine Idee.","zh":"我有一个主意。"},{"en":"Das ist eine gute Frage.","zh":"这是一个好问题。"}]},{"partOfSpeech":"num.","definition":{"en":"(German) “one” — can function like the number “one” in some contexts, especially when stressing quantity (still inflected for gender/case).","zh":"（德语）“一”——在某些语境中可强调数量，相当于数字“一”（但仍会随性/格变化）。"},"examples":[{"en":"Ich nehme eine (Tasse) Kaffee.","zh":"我要一（杯）咖啡。"},{"en":"Gib mir eine Minute.","zh":"给我一分钟。"}]}],"synonyms":["ein (masculine/neuter form)","1 (eins, as the base numeral)"],"phonetic":"ˈaɪnə","extraExplanation":["“eine”对应的基本词形是“ein/eine”。德语里不定冠词会随“性（阳/阴/中）”和“格（主/宾/与/属）”变化：\n- 阳性：ein (N/A), einem (D), eines (G)\n- 阴性：eine (N/A), einer (D/G)\n- 中性：ein (N/A), einem (D), eines (G)\n例如：Ich sehe **eine** Frau.（我看见一位女士，阴性宾格） / Ich helfe **einer** Frau.（我帮助一位女士，阴性与格）"]}
{"word":"Einhorn","summary":{"en":"“Einhorn” is German for “unicorn,” and it can also be used as a surname or name.","zh":"“Einhorn”是德语“独角兽”的意思，也可作姓氏或人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German) a unicorn; a mythical horse-like animal with a single horn.","zh":"（德语）独角兽；一种传说中的、像马一样、额头长一只角的神话动物。"},"examples":[{"en":"In German, “Einhorn” means “unicorn.”","zh":"在德语里，“Einhorn”就是“unicorn（独角兽）”的意思。"},{"en":"The children loved the Einhorn in the fairy tale.","zh":"孩子们很喜欢童话故事里的那只独角兽。"}]},{"partOfSpeech":"n.","definition":{"en":"a German surname or given name (used as a family name, and sometimes as a brand or character name).","zh":"一个德语姓氏或人名（可作家族姓氏，也常被用作品牌名或角色名）。"},"examples":[{"en":"Einhorn is also a family name in German-speaking communities.","zh":"Einhorn 也是德语地区常见的姓氏之一。"},{"en":"The company chose “Einhorn” as a brand name to suggest something magical and rare.","zh":"这家公司用 “Einhorn” 做品牌名，是想传达“神奇、稀有”的感觉。"}]}],"synonyms":["unicorn","mythical creature"],"phonetic":"/ˈaɪnˌhɔrn/","extraExplanation":["“Einhorn”由德语“ein”（一）+“Horn”（角）组成，字面意思就是“一个角”。对应英语“unicorn”（uni- 表示“一”）。","在德语文化中，“Einhorn”常见于童话、儿童文学、插画与现代流行文化中，常带有“纯洁、梦幻、稀有”的联想。"]}
{"word":"einkanter","summary":{"en":"“Einkanter” is not a standard English word; it’s usually a proper name or a misspelling of a similar word (often “enchanter”).","zh":"“einkanter”不是标准英语单词；多为专有名词，或是相近词（常见为“enchanter”）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a proper name (e.g., a surname, brand, or username). In English text it may also be a misspelling of a similar-sounding word (such as “enchanter”).","zh":"不是标准英语单词；通常作为专有名词（如姓氏、品牌或用户名）出现。在英语语境中也可能是与其发音相近词的拼写错误（例如 enchanter）。"},"examples":[{"en":"I couldn’t find “einkanter” in an English dictionary—where did you see it?","zh":"我在英语词典里找不到“einkanter”——你是在哪里看到的？"},{"en":"If you meant “enchanter,” it refers to a person who uses magic in stories.","zh":"如果你想写的是“enchanter”，它指故事里使用魔法的人。"}]}],"synonyms":["enchanter (possible intended word)"],"phonetic":"/ˈaɪnˌkæn.tɚ/","extraExplanation":["“einkanter”看起来更像德语/荷兰语风格的拼写（如以 ein- 开头），但在英语中并不是常见词条。若你能提供一句原文或它出现的领域（游戏名、产品名、小说角色名等），我可以更准确地解释含义与用法。","如果你的目标是英语词汇学习，最常见的近似词是：enchanter（施法者/魔法师，尤其在奇幻作品中）。也可能是其他拼写相近词的误写，需结合上下文判断。"]}
{"word":"einkorn","summary":{"en":"Einkorn is an ancient kind of wheat, often used as flour for baking and known for a nutty flavor.","zh":"Einkorn 指一种古老的小麦品种，常磨成面粉用于烘焙，味道带坚果香。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient type of wheat with small grains; one of the earliest domesticated wheats, often used in artisan baking and valued for its nutty flavor.","zh":"一种古老的小粒小麦；是最早被驯化的小麦之一，常用于手工烘焙，以坚果香味著称。"},"examples":[{"en":"This bread is made with einkorn flour, so it has a slightly nutty taste.","zh":"这款面包用一粒小麦粉做的，所以有一点坚果香。"},{"en":"Some farmers grow einkorn because it can do well in poorer soils.","zh":"有些农民种一粒小麦，因为它在较贫瘠的土壤里也可能长得不错。"}]}],"synonyms":["ancient wheat","ancient grain"],"phonetic":"/ˈaɪnkɔrn/","extraExplanation":["“einkorn”源自德语，字面意思是“单粒（小麦）”，指每个小穗通常只有一粒谷粒的特征。","在现代食品语境中，einkorn常被归入“ancient grains（古谷物）”。需要注意：它含有麸质（gluten），不适合乳糜泻（celiac disease）人群。","常见相关词：einkorn flour（一粒小麦粉）、ancient grain bowl（古谷物碗/杂粮碗）、artisan bread（手工面包）。"]}
{"word":"einkorns","summary":{"en":"“Einkorns” is the plural of “einkorn,” an ancient type of wheat used as a whole grain in foods.","zh":"“einkorns”是“einkorn”的复数，指一种古老的小麦，可作为全谷物食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Einkorns are an ancient type of wheat (the plural of “einkorn”), often used as a whole grain in breads, pastas, and other foods.","zh":"einkorns 是一种古老的小麦（“einkorn”的复数），常作为全谷物用于面包、意面等食品。"},"examples":[{"en":"Some bakeries use einkorns to make bread with a nutty flavor.","zh":"有些面包店会用 einkorns 做出带坚果香的面包。"},{"en":"I bought a bag of einkorns to try in soup and salad.","zh":"我买了一袋 einkorns，想用在汤和沙拉里试试。"}]}],"synonyms":["ancient wheat","whole grain (context-dependent)"],"phonetic":"/ˈaɪnˌkɔrn/","extraExplanation":["“Einkorn”来自德语：ein（一个）+ Korn（谷粒），常被译为“单粒小麦”。它属于非常古老的栽培小麦之一，在一些历史与饮食文化介绍中会被称为“ancient grain（古谷物）”。","写作里常见单数形式“einkorn”表示这种谷物整体（类似“wheat”），而“einkorns”更强调“不同批次/不同种类的颗粒或产品”，例如比较几种古谷物时：einkorns, emmers, spelt。"]}
{"word":"Einst","summary":{"en":"“Einst” means “once; formerly,” borrowed from German and used mainly in literary/scholarly English.","zh":"“Einst”意为“曾经；从前”，源自德语，在英语中多见于文学或学术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(from German, used in English mainly in literary or scholarly contexts) once; at one time in the past; formerly.","zh":"（源自德语，在英语中多见于文学或学术语境）曾经；从前；一度。"},"examples":[{"en":"Einst, this castle guarded the entire valley.","zh":"曾经，这座城堡守卫着整条山谷。"},{"en":"He spoke of friends who were einst close, but are now strangers.","zh":"他谈起那些曾经亲近、如今却形同陌路的朋友。"}]}],"synonyms":["once","formerly","in the past","at one time"],"phonetic":"/aɪnst/","extraExplanation":["“Einst”是德语副词，常见意思是“曾经/从前”。在现代英语里它不是常用词，更多出现在引用德语原文、讨论德语文学/哲学（如诗歌、尼采或歌德相关论述）、或为了营造古典/庄重语气的写作中。","英语里更自然的对应表达通常是 once, formerly, in the past。若在普通写作中使用“einst”，读者可能会把它当作外来语或风格化用词。"]}
{"word":"Einstein","summary":{"en":"Einstein is the name of the famous physicist Albert Einstein, and informally it can also mean a very smart person.","zh":"Einstein 指著名物理学家阿尔伯特·爱因斯坦；口语中也可指“很聪明的人/天才”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Albert Einstein (1879–1955), a German-born theoretical physicist best known for developing the theory of relativity and for the famous equation E = mc².","zh":"阿尔伯特·爱因斯坦（1879–1955），德国出生的理论物理学家，以提出相对论以及著名公式 E = mc² 最为人知。"},"examples":[{"en":"Einstein changed how we understand space and time.","zh":"爱因斯坦改变了我们对空间与时间的理解。"},{"en":"Many people know Einstein for the equation E = mc².","zh":"很多人认识爱因斯坦是因为公式 E = mc²。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A very intelligent person; a genius.","zh":"（非正式）非常聪明的人；天才。"},"examples":[{"en":"She’s an Einstein when it comes to math.","zh":"她在数学方面简直是个“爱因斯坦”（特别聪明）。"},{"en":"I’m no Einstein, but I can figure it out.","zh":"我不是天才，但我能弄明白。"}]}],"synonyms":["genius","brain","whiz"],"phonetic":"/ˈaɪnstaɪn/","extraExplanation":["在英语里把某位著名人物的姓当作普通名词使用（如“an Einstein”）是一种常见修辞：用“典型代表”来指代某种特质。语气多为夸赞，但也可能带一点玩笑或反讽，具体看语境。","文化提示：直接对别人说“Don’t be such an Einstein”有时会被理解为讽刺（类似“别装聪明”），对不熟的人使用要谨慎。"]}
{"word":"Einsteinian","summary":{"en":"Einsteinian means “related to Albert Einstein/relativity,” and more loosely “genius-level.”","zh":"Einsteinian 指“与爱因斯坦/相对论相关”，也可泛指“天才般的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Albert Einstein or his ideas, especially the theory of relativity.","zh":"与阿尔伯特·爱因斯坦或其思想有关的；尤指与相对论有关的。"},"examples":[{"en":"The GPS system needs Einsteinian corrections because of relativity.","zh":"GPS 系统需要做“爱因斯坦式”的修正，因为涉及相对论效应。"},{"en":"She wrote an Einsteinian explanation of time dilation for beginners.","zh":"她写了一篇面向初学者的“爱因斯坦式”时间膨胀解释。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general) Extremely intelligent or showing genius-level thinking.","zh":"（更宽泛）极其聪明的；展现出天才级思维的。"},"examples":[{"en":"It took an Einsteinian insight to solve the puzzle so quickly.","zh":"要有“爱因斯坦般”的洞察力，才能这么快解开谜题。"},{"en":"People praised her Einsteinian ability to see patterns in data.","zh":"人们称赞她“爱因斯坦式”的能力——能从数据中看出规律。"}]}],"synonyms":["relativistic","Einstein-like","genius-level (informal)"],"phonetic":"/ˌaɪnˈstaɪniən/","extraExplanation":["“Einsteinian”最常见于科学与科普语境，尤其搭配 relativity（相对论）、space-time（时空）、gravity（引力）、time dilation（时间膨胀）等词。","日常口语中用来形容“天才”时，语气通常是夸张或比喻；如果在正式写作里，最好明确指向爱因斯坦的理论（如“Einsteinian relativity”），避免含义含糊。"]}
{"word":"einsteinian","summary":{"en":"Einsteinian means relating to Einstein—especially relativity—or (informally) extremely smart.","zh":"Einsteinian 指与爱因斯坦（尤指相对论）相关；也可在口语中表示“非常聪明/天才般的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to Albert Einstein or his scientific ideas, especially the theory of relativity.","zh":"与阿尔伯特·爱因斯坦或他的科学思想有关的，尤指相对论的。"},"examples":[{"en":"Modern GPS systems need Einsteinian relativity to stay accurate.","zh":"现代 GPS 系统需要用到爱因斯坦式的相对论才能保持准确。"},{"en":"The book offers an Einsteinian view of space and time.","zh":"这本书提供了关于时空的爱因斯坦式观点。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely intelligent or showing genius (often used informally, sometimes humorously).","zh":"非常聪明的、像天才一样的（多为非正式用法，有时带幽默意味）。"},"examples":[{"en":"That was an Einsteinian solution to a really messy problem.","zh":"这真是个“爱因斯坦式”的解决方案，把很棘手的问题一下理清了。"},{"en":"You don’t need an Einsteinian mind to follow these instructions.","zh":"你不需要“爱因斯坦级”的头脑也能看懂这些说明。"}]}],"synonyms":["relativistic","Einstein-related","genius-level (informal)"],"phonetic":"/aɪnˈstaɪniən/","extraExplanation":["“Einsteinian”常见于科学语境，尤其指“Einsteinian relativity（爱因斯坦相对论）”，与“Newtonian（牛顿的/经典力学的）”形成对比：Newtonian 通常适用于低速、弱引力的日常尺度；Einsteinian 则更适合高速或强引力条件下的描述（如黑洞、精密导航等）。","在文学与文化表达中，用人名构成的形容词（如 Shakespearean, Darwinian, Einsteinian）常用来表示“具有某人风格/理论特征”。非正式场合把 Einsteinian 用来夸人聪明时，语气可能是认真称赞，也可能带一点夸张或玩笑。"]}
{"word":"einsteinium","summary":{"en":"Einsteinium (Es) is a synthetic, radioactive chemical element (atomic number 99) used mainly in research.","zh":"锿（Es）是原子序数99的人造放射性化学元素，主要用于科研。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man‑made chemical element (symbol: Es) with atomic number 99; it is radioactive and used mainly for scientific research","zh":"锿（化学元素符号 Es，原子序数 99）；一种人造放射性元素，主要用于科学研究"},"examples":[{"en":"Einsteinium is a synthetic element that does not occur naturally in significant amounts.","zh":"锿是一种人造元素，在自然界中几乎不会大量存在。"},{"en":"Scientists use tiny amounts of einsteinium in nuclear research.","zh":"科学家在核研究中会使用极少量的锿。"}]}],"synonyms":["Es","element 99"],"phonetic":"/aɪnˈstaɪniəm/","extraExplanation":["“Einsteinium（锿）”以物理学家阿尔伯特·爱因斯坦（Albert Einstein）命名，用来致敬他对科学的贡献。","它最早在20世纪中期的核试验残留物中被发现，因此与核科学研究有历史关联；但日常生活中几乎不会接触到。"]}
{"word":"Einthoven","summary":{"en":"Einthoven is the surname of Willem Einthoven, a Dutch scientist famous for the early ECG and concepts like Einthoven’s triangle.","zh":"Einthoven 指威廉·爱因托芬的姓氏；他是荷兰科学家，以早期心电图技术及“爱因托芬三角形”等概念著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Willem Einthoven (1860–1927), a Dutch physiologist best known for inventing the first practical electrocardiograph (ECG/EKG) and for key ideas used to interpret ECG signals.","zh":"威廉·爱因托芬（1860–1927），荷兰生理学家，以发明第一台实用心电图机（ECG/EKG）以及提出用于解读心电图信号的重要概念而闻名。"},"examples":[{"en":"Einthoven’s work helped doctors record and study the heart’s electrical activity.","zh":"爱因托芬的研究帮助医生记录并研究心脏的电活动。"},{"en":"In class, we learned about Einthoven’s triangle in basic ECG interpretation.","zh":"课堂上我们学习了“爱因托芬三角形”，用于基础心电图解读。"}]}],"phonetic":"/ˈaɪnthoʊvən/","extraExplanation":["“Einthoven”常见于医学/生理学语境：例如 Einthoven’s triangle（爱因托芬三角形，用三个肢体导联构成的参考三角形）和 Einthoven’s law（爱因托芬定律，用于描述肢体导联电位关系）。","他因心电图相关贡献获得 1924 年诺贝尔生理学或医学奖。读文献时也常见 ECG 与 EKG 两种拼写：EKG 来自德语 Elektrokardiogramm，用来避免与 EEG（脑电图）混淆。"]}
{"word":"Eioneus","summary":{"en":"Eioneus is a rare Greek mythological proper name, often noted as Chione’s father in some accounts.","zh":"Eioneus 是一个较少见的希腊神话专名，在一些说法中被记为奇俄涅的父亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A minor mythological name; most commonly recorded as the father of Chione (Khione) in some sources. The name appears in variant spellings across texts.","zh":"（希腊神话）一个较少见的神话人名；在一些资料中最常见的说法是：他是奇俄涅（Chione/Khione）的父亲。该名字在不同文本里常见不同拼写。"},"examples":[{"en":"In one version of the myth, Chione is described as the daughter of Eioneus.","zh":"在某个版本的神话中，奇俄涅被描述为艾俄纽斯（Eioneus）的女儿。"},{"en":"Because Eioneus is a minor figure, many retellings leave him unnamed or use a different spelling.","zh":"由于艾俄纽斯是个较小的角色，很多改写故事会不提他的名字，或使用不同的拼写。"}]}],"phonetic":"/aɪˈoʊniəs/","extraExplanation":["“Eioneus”主要出现在神话人物名录、注释（scholia）或不同作者的版本对照中，因此会遇到拼写变体、家谱关系不一致等情况。阅读时可把它当作“某个版本里的专名”，并留意同一人物是否在别处以不同拼写出现（例如转写差异导致的变体）。"]}
{"word":"Eipper","summary":{"en":"“Eipper” is usually a proper name (often a surname), not a standard English word.","zh":"“Eipper”通常是专有名词（多为姓氏），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (usually a surname). It is not a common English vocabulary word, so its meaning depends on the person/family or brand it refers to.","zh":"一个较少见的专有名词（通常是姓氏）。它不是常见的英语词汇，因此含义取决于它指代的具体人物/家族或品牌。"},"examples":[{"en":"Dr. Eipper will speak at the conference today.","zh":"Eipper 博士今天将在会议上发言。"},{"en":"I found an article written by someone named Eipper.","zh":"我找到一篇由一位名叫 Eipper 的人写的文章。"}]}],"phonetic":"/ˈaɪpɚ/","extraExplanation":["“Eipper”在英语里并不常见，通常只作为人名/姓氏出现；如果你是在句子里看到的，发我原句，我可以根据上下文判断它具体指谁或是什么。","如果你想查的是常见单词，可能是拼写接近的词，比如：either（“任一/或者”，/ˈiːðɚ/）、zipper（“拉链”，/ˈzɪpɚ/）等；也可能是某个德语/荷兰语来源的姓氏转写。"]}
{"word":"eir","summary":{"en":"“eir” is most commonly a gender-neutral possessive pronoun meaning “his/her/their,” and it can also be an abbreviation “EIR” with field-specific meanings.","zh":"“eir”最常见用法是性别中立的物主代词，意思相当于“他的/她的/他们的（their）”；也可能是缩写“EIR”，具体含义取决于领域与上下文。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"A gender-neutral third-person possessive pronoun/determiner (used in some “Spivak” or neopronoun sets), meaning “his/her/their.”","zh":"一种性别中立的第三人称物主代词/限定词（常见于部分“Spivak”或新代词体系），意思相当于“他的/她的/他们的（their）”。"},"examples":[{"en":"Alex forgot eir keys on the table.","zh":"Alex 把 eir 钥匙忘在桌子上了。"},{"en":"That book is eirs.","zh":"那本书是 eirs（是 Alex 的）。"}]},{"partOfSpeech":"other","definition":{"en":"(Abbreviation) “EIR,” used in different fields to mean things like “Effective Interest Rate” (finance) or “Equivalent/Effective Isotropically Radiated Power” (telecom), depending on context.","zh":"（缩写）“EIR”，在不同领域可指“有效利率”（金融）或“等效/有效全向辐射功率”（通信）等，需依上下文判断。"},"examples":[{"en":"The loan’s EIR is higher than the advertised rate once fees are included.","zh":"把费用算进去后，这笔贷款的 EIR（有效利率）比宣传利率更高。"},{"en":"Check the antenna’s EIRP limit to stay compliant.","zh":"检查天线的 EIRP（等效全向辐射功率）上限以确保合规。"}]}],"synonyms":["their","his","her","one’s"],"phonetic":"/ɛr/","extraExplanation":["“eir/eirs/em/e”是一套较早出现的性别中立代词写法（常被称为 Spivak pronouns），现在更常见的是 singular they（they/them/their）。是否使用 eir 通常取决于当事人的自我认同与偏好；在正式写作中，除非对方明确使用这套代词，否则更稳妥的是用对方名字或 they/them。","发音在实际使用中不完全统一；很多人把 eir 读作与“air”相同的音。若不确定，礼貌地询问对方偏好的读法即可。"]}
{"word":"eira","summary":{"en":"Eira is most commonly a Welsh girl’s name meaning “snow,” and it can also be a genus name in the scientific name of the tayra (Eira barbara).","zh":"Eira 最常见是威尔士语女性名，意为“雪”；也可作分类学属名，见于泰拉的学名 Eira barbara。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Welsh given name (usually feminine) meaning “snow.”","zh":"威尔士语人名（多为女性名），意为“雪”。"},"examples":[{"en":"Eira is a popular Welsh name that means “snow.”","zh":"Eira 是一个常见的威尔士名字，意思是“雪”。"},{"en":"They named their daughter Eira because she was born during a snowstorm.","zh":"他们给女儿取名叫 Eira，因为她出生在暴风雪中。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology, taxonomy) the genus name in the scientific name Eira barbara, the tayra (a weasel family animal in Central and South America).","zh":"（动物学/分类学）用于学名 Eira barbara 的属名，指“泰拉”（一种鼬科动物，分布于中南美洲）。"},"examples":[{"en":"The tayra’s scientific name is Eira barbara.","zh":"泰拉的学名是 Eira barbara。"},{"en":"In some older texts, you may see the animal referred to with the genus name Eira.","zh":"在一些较旧的文献里，你可能会看到用属名 Eira 来称呼这种动物。"}]}],"synonyms":["(name) Welsh name meaning “snow”","(animal) tayra"],"phonetic":"/ˈaɪrə/","extraExplanation":["作为人名时，Eira 源自威尔士语，常被用来营造“清冷、纯净、冬日”的意象。英语里通常读作 /ˈaɪrə/（类似 “EYE-ruh”）。","作为分类学名称时，Eira 更常出现在拉丁学名中；日常英语里提到该动物通常用 tayra。"]}
{"word":"eirack","summary":{"en":"“eirack” is not a standard English word; it’s likely a typo or a name. Provide context to identify the intended word.","zh":"“eirack”不是标准英语单词；可能是拼写错误或名称。请提供语境以确定你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a name/username, or a specialized term.","zh":"不是标准英语单词。更可能是拼写错误、姓名/用户名，或某个领域的专门术语。"},"examples":[{"en":"I couldn’t find “eirack” in an English dictionary—did you mean “earache” or “air rack”?","zh":"我在英语词典里查不到“eirack”——你想表达的是“earache（耳痛）”还是“air rack（气动置物架/行李架等）”？"},{"en":"If you tell me the sentence where you saw “eirack,” I can help figure out the correct word.","zh":"如果你把看到“eirack”的句子发给我，我可以帮你判断它到底是哪一个词。"}]}],"extraExplanation":["“eirack”看起来像把两个部分拼在一起（例如 ear + rack / air + rack），或是把常见单词拼错了。最常见的可能候选包括：\n- earache（耳痛）\n- air rack（需要具体语境，可能指“置物架/行李架”等）\n也可能是人名、网名、产品名。给我上下文（整句或出处）我就能更准确地判断。"]}
{"word":"Eire","summary":{"en":"Éire is the Irish-language name for Ireland.","zh":"Éire是“爱尔兰”的爱尔兰语名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ireland (the name for the country in the Irish language).","zh":"爱尔兰（“Ireland”的爱尔兰语名称）。"},"examples":[{"en":"“Éire” is the Irish-language name for Ireland.","zh":"“Éire”是“爱尔兰”的爱尔兰语名称。"},{"en":"You may see “Éire” printed on Irish coins and official documents.","zh":"你可能会在爱尔兰的硬币和官方文件上看到“Éire”。"}]}],"synonyms":["Ireland","Republic of Ireland (context-specific)"],"phonetic":"/ˈɛrə/","extraExplanation":["“Éire”来自古爱尔兰语，现代爱尔兰语中表示“爱尔兰”。写作“Éire”时的重音符号（É）很重要：它提示读音更接近“air-uh”。","在英语语境里，人们通常直接说“Ireland”。“Eire”（不带重音符号）有时会被当作英语拼写使用，但在正式写法中更推荐“Éire”。","“Éire”是国家的爱尔兰语名称；而“Republic of Ireland”（爱尔兰共和国）常用于强调与“Northern Ireland”（北爱尔兰）的区别。"]}
{"word":"Eireannach","summary":{"en":"Éireannach means “an Irish person” or “Irish (related to Ireland),” commonly used in Irish-language contexts.","zh":"Éireannach 指“爱尔兰人”或“爱尔兰的”，多见于爱尔兰语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Irish person; someone from Ireland (especially in Irish-language contexts).","zh":"爱尔兰人；来自爱尔兰的人（尤指在爱尔兰语语境中）。"},"examples":[{"en":"He described himself as an Éireannach, proud of his Irish roots.","zh":"他称自己是“Éireannach”，为自己的爱尔兰根源感到自豪。"},{"en":"Many Éireannaigh (Irish people) speak both Irish and English.","zh":"许多 Éireannaigh（爱尔兰人）既说爱尔兰语也说英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Irish; relating to Ireland (often carrying a cultural or national identity tone).","zh":"爱尔兰的；与爱尔兰有关的（常带有文化/民族身份的语气）。"},"examples":[{"en":"Éireannach music and stories are central to the festival.","zh":"爱尔兰（Éireannach）的音乐和故事是这个节日的核心。"},{"en":"She studies Éireannach history through Irish-language sources.","zh":"她通过爱尔兰语资料研究爱尔兰（Éireannach）历史。"}]}],"synonyms":["Irish person","Irishman","Irishwoman","Irish"],"phonetic":"/ˈeɪrənɑk/","extraExplanation":["“Éireannach”是爱尔兰语（Gaeilge）词，来自“Éire”（爱尔兰）。在英语语境里更常说“Irish person / Irish”。","重音符号“É”（fada）会拉长元音，发音更接近“AY-”。复数常见形式是“Éireannaigh”（指“爱尔兰人们”）。","在文化或身份表达中，用爱尔兰语称呼自己为“Éireannach”往往比直接说“Irish”更有“强调本土语言与传统”的意味。"]}
{"word":"Eirena","summary":{"en":"Eirena is a feminine name meaning “peace,” and it can also refer to the Greek goddess/personification of peace (more commonly spelled Eirene).","zh":"Eirena 是一个意为“和平”的女性名字；也可指希腊神话中的和平女神/和平的拟人化（更常见拼写为 Eirene）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name; a variant spelling of Irene/Eirene, ultimately meaning “peace.”","zh":"女性名字；Irene/Eirene 的一种拼写变体，词源义为“和平”。"},"examples":[{"en":"Eirena is a less common spelling of the name Irene.","zh":"Eirena 是名字 Irene 的一种不太常见的拼写。"},{"en":"Her parents chose the name Eirena because it means “peace.”","zh":"她的父母选了 Eirena 这个名字，因为它有“和平”的含义。"}]},{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) Eirena (more commonly spelled Eirene) is the personification or goddess of peace.","zh":"（希腊神话）Eirena（更常见拼写为 Eirene）是“和平”的拟人化/和平女神。"},"examples":[{"en":"In Greek art, Eirene is sometimes shown holding a child symbolizing prosperity.","zh":"在希腊艺术中，Eirene 有时被描绘为抱着象征繁荣的孩子。"},{"en":"The poet referenced Eirene to suggest an end to conflict.","zh":"诗人用 Eirene 来暗示冲突的结束。"}]}],"synonyms":["Irene","Eirene"],"phonetic":"/aɪˈriːnə/","extraExplanation":["Eirena 来自古希腊语“Eirēnē（和平）”。英语里更常见的拼写是 Irene（艾琳）或 Eirene（更贴近希腊语拼写）。","在希腊神话中，Eirene/Eirēnē 常被视为“荷赖（Horae）”之一（与秩序、季节相关的女神群）。艺术作品里她常与“丰饶/繁荣”的象征一起出现，表达“和平带来安定与富足”。"]}
{"word":"eirenarch","summary":{"en":"An eirenarch is a (rare, historical) peace officer or magistrate responsible for keeping public order.","zh":"eirenarch 指（罕见、偏历史的）治安官/维和官，负责维持公共秩序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A peace officer or magistrate whose job is to keep public order; historically, an official responsible for maintaining peace (especially in ancient Greece and later in some Christian/Byzantine contexts).","zh":"治安官；维持和平与公共秩序的官员/司法官（多用于古希腊等历史语境，现代英语中较罕见）。"},"examples":[{"en":"In the old records, the eirenarch is described as the local official who kept the peace.","zh":"在旧档案中，这位治安官（eirenarch）被描述为负责维持地方治安的官员。"},{"en":"The historian notes that an eirenarch could settle disputes before they turned into violence.","zh":"历史学家指出，eirenarch 可以在纠纷演变成暴力冲突之前进行调停。"}]}],"synonyms":["peace officer","magistrate","constable","law officer"],"phonetic":"/aɪˈriːnɑːrk/","extraExplanation":["词源来自希腊语 eirēnē（和平）+ arch-（统治/管理），字面意思接近“和平的管理者”。","这是一个非常书面、偏历史的词；现代英语更常用 peace officer、magistrate、constable 等。","在阅读历史、神学或古典学材料时更可能遇到该词，用来指某类负责维持治安、调解纠纷的官职。"]}
{"word":"Eirene","summary":{"en":"Eirene is the Greek goddess/personification of peace and is also used as a female name (a variant of Irene).","zh":"Eirene 指希腊神话中的和平女神/和平的拟人化形象，也可作女性名字（Irene 的变体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the goddess/personification of peace (one of the Horae, daughters of Zeus and Themis).","zh":"希腊神话中“和平”的女神/拟人化形象（荷赖三女神之一，为宙斯与忒弥斯之女）。"},"examples":[{"en":"In Greek mythology, Eirene represents peace and prosperity after war.","zh":"在希腊神话中，Eirene 象征战争之后的和平与繁荣。"},{"en":"Ancient art sometimes shows Eirene holding the infant Plutus, the god of wealth.","zh":"古代艺术中有时会描绘 Eirene 抱着婴儿普鲁托斯（财富之神）。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name (a variant of Irene), often associated with the meaning “peace.”","zh":"女性名字（Irene 的一种写法/变体），常与“和平”之意相关。"},"examples":[{"en":"Eirene is a less common spelling, but it has the same peaceful meaning as Irene.","zh":"Eirene 是比较少见的拼法，但含义与 Irene 一样都与“和平”相关。"},{"en":"Her parents chose the name Eirene to symbolize hope for peace.","zh":"她的父母取名 Eirene，用来象征对和平的期盼。"}]}],"synonyms":["Irene","Peace (as a meaning/translation)"],"phonetic":"/aɪˈriːni/","extraExplanation":["Eirene 源自古希腊语“εἰρήνη”（eirēnē，意为“和平”）。英语里更常见的形式是 Irene（常见译名“艾琳/艾瑞妮”）。","在古典文学与艺术中，Eirene 往往与“秩序、正义、繁荣”联系在一起；她抱着普鲁托斯（Plutus，财富）这一形象强调“和平带来富足”。"]}
{"word":"eirenic","summary":{"en":"Eirenic means peace-seeking and conflict-avoiding, often used in formal contexts like politics or religion.","zh":"Eirenic 指“主张和平、避免冲突、推动和解”的（较正式用语），常见于政治或宗教等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Peaceful in attitude; aiming to create or maintain harmony, especially by avoiding conflict.","zh":"（态度）温和、和平的；主张和解、尽量避免冲突的。"},"examples":[{"en":"Her eirenic tone helped the team discuss the problem without arguing.","zh":"她温和、和解的语气让团队能不争吵地讨论问题。"},{"en":"The mediator offered an eirenic proposal that both sides could accept.","zh":"调解人提出了一个各方都能接受的和解方案。"},{"en":"In a tense meeting, he tried to stay eirenic and listen carefully.","zh":"在紧张的会议中，他尽量保持平和，认真倾听。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to efforts to promote peace or unity, often in politics or religion.","zh":"与促进和平或团结的努力有关（常见于政治或宗教语境）。"},"examples":[{"en":"The article praised an eirenic approach to interfaith dialogue.","zh":"文章称赞了对宗教间对话采取的和解取向。"},{"en":"Some leaders called for eirenic language after the election.","zh":"选后，一些领导人呼吁使用更和解的措辞。"}]}],"synonyms":["peaceful","conciliatory","pacific","harmonious","irenic"],"phonetic":"/aɪˈriːnɪk/","extraExplanation":["“eirenic”较正式、偏书面，常用于描述“缓和矛盾、追求共识”的风格（如eirenic tone/approach）。日常口语里更常用peaceful、conciliatory、calm。","词源来自希腊语“eirēnē”（和平），在宗教语境中可指“促进教会合一/宗派和解”的努力。"]}
{"word":"eirenicon","summary":{"en":"An eirenicon is a peace-making proposal or statement meant to reconcile opposing sides.","zh":"eirenicon 指为促成和平与和解而提出的提议或声明（较书面）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A proposal, statement, or work intended to promote peace and reconciliation, especially by reducing conflict between opposing groups or opinions.","zh":"旨在促进和平与和解的提议、声明或著作，尤指用来缓和对立群体或观点之间的冲突。"},"examples":[{"en":"The professor’s speech was meant as an eirenicon between the two sides of the debate.","zh":"这位教授的演讲意在成为辩论双方之间的“和解宣言”。"},{"en":"Rather than attacking their critics, the group issued an eirenicon calling for dialogue.","zh":"该团体没有抨击批评者，而是发布了一份呼吁对话的和解声明。"}]}],"synonyms":["peace offering","olive branch","reconciliation","conciliatory proposal"],"phonetic":"/aɪˈraɪnɪkɑn/","extraExplanation":["这是个较少见、偏正式的词，常见于学术写作、宗教或政治语境中，强调“调和分歧、促成和解”的意图。","词源来自希腊语 eirēnē（和平）。在英语里常用来指一种“为和解而写/说的东西”，比 peace offering 更书面、更抽象。","相关近义表达：olive branch（橄榄枝，偏口语/比喻）、peace offering（和平提议）、reconciliation statement（和解声明）。"]}
{"word":"eiresione","summary":{"en":"Eiresione is an ancient Greek decorated branch (and the accompanying song) used in processions to wish for prosperity and protection.","zh":"Eiresione 指古希腊游行中携带的装饰树枝（及其伴唱歌曲），用来祈求繁荣与护佑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ancient Greece) a decorated branch carried in a procession as a symbol of harvest, prosperity, and protection; also the song sung during that procession.","zh":"（古希腊）在游行中携带的装饰树枝，象征丰收、繁荣与护佑；也可指游行时所唱的歌。"},"examples":[{"en":"In a lesson on ancient Greek festivals, we read about the eiresione carried to honor Apollo.","zh":"在讲古希腊节庆的课上，我们读到人们会携带 eiresione 来敬奉阿波罗。"},{"en":"The poem mentions children singing an eiresione song while holding a branch covered with fruit and ribbons.","zh":"诗中提到孩子们手持挂满果实与彩带的树枝，唱着 eiresione 之歌。"}]}],"synonyms":["decorated bough","festival branch","processional branch"],"phonetic":"/aɪˈrɪsɪˌoʊni/","extraExplanation":["“Eiresione”源自古希腊语，常与阿波罗相关的节日（如Pyanepsia等）联系在一起。它通常是一根橄榄枝或月桂枝，上面会装饰羊毛、果实、面包等，寓意驱邪、祈求来年丰收与家宅平安。","该词在现代英语中非常罕见，多见于古典学、神话学、历史或文学研究语境。","拼写提示：常见形式是 eiresione（也有人写作 eiresionē，用长音符号标注末尾元音）。"]}
{"word":"Eirikson","summary":{"en":"Eirikson is a Scandinavian-origin surname meaning “son of Eirik/Eric,” often a variant spelling of Erikson/Ericsson.","zh":"Eirikson 是北欧来源的姓氏，意思是“埃里克之子”，常见于 Erikson/Ericsson 等拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname of Scandinavian origin meaning “son of Eirik/Eric,” also seen as a spelling variant of Erikson/Ericson/Ericsson.","zh":"一个斯堪的纳维亚（北欧）来源的姓氏，意思是“埃里克（Eirik/Eric）之子”，也常被视为 Erikson / Ericson / Ericsson 的拼写变体。"},"examples":[{"en":"My professor, Dr. Eirikson, studies child development.","zh":"我的教授艾里克森博士研究儿童发展。"},{"en":"You’ll also see the name spelled Erikson or Ericsson in different families.","zh":"在不同家族里，你也会看到这个姓写作 Erikson 或 Ericsson。"}]}],"synonyms":["Erikson","Ericson","Ericsson"],"phonetic":"/ˈaɪrɪksən/","extraExplanation":["“Eirikson”属于北欧常见的“父名姓”（patronymic）体系：在传统用法里，孩子的姓可以表示“某人的儿子/女儿”。其中 -son 表示“儿子”，所以 Eirikson 字面是“Eirik 的儿子”。","英文语境中更常见的拼写是 Erikson / Ericsson。知名相关姓氏人物包括：心理学家 Erik Erikson（埃里克·埃里克森，发展心理学/人格发展理论）以及航海探险者 Leif Erikson（莱夫·埃里克森，常被认为最早到达北美的欧洲人之一）。如果你在阅读里看到 Eirikson，通常可以把它理解为同一姓氏体系下的变体拼法。"]}
{"word":"eiry","summary":{"en":"“Eiry” is an uncommon spelling of “eerie,” meaning strange and unsettling in a spooky way.","zh":"“eiry”是较少见的“eerie”拼写，意思是诡异、令人不安、带点阴森恐怖的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Variant spelling of “eerie”) Strange and scary in a way that makes you feel uneasy, as if something supernatural might be happening.","zh":"（“eerie”的拼写变体）诡异的；令人不安的，带有让人觉得像有超自然事情发生的恐怖感。"},"examples":[{"en":"The house was quiet and eiry, like someone was watching us.","zh":"那栋房子安静得很诡异，像是有人在盯着我们。"},{"en":"An eiry wind blew through the empty street at night.","zh":"夜里一阵阴森的风吹过空荡荡的街道。"}]}],"synonyms":["eerie","spooky","creepy","uncanny","sinister"],"phonetic":"/ˈɪri/","extraExplanation":["“eiry”在现代标准英语里不如“eerie”常见，更多见于方言/地区拼写（尤其与苏格兰英语相关的用法）。在正式写作中一般建议用“eerie”。","词源上，“eerie”与“害怕、战栗”的感觉有关，所以它常用来形容“让人毛骨悚然但不一定直接危险”的气氛。"]}
{"word":"EIS","summary":{"en":"EIS is an abbreviation. Most commonly it means Environmental Impact Statement; in business it can mean Executive Information System. The exact meaning depends on context.","zh":"EIS是缩写，最常见指环境影响说明书（Environmental Impact Statement）；在商业领域也可指高层信息系统（Executive Information System）。具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Environmental Impact Statement: an official report that explains how a proposed project (like a road, dam, or factory) may affect the environment, often required by law before approval.","zh":"环境影响说明书/环境影响声明：一份官方报告，用来说明某个拟议项目（如公路、水坝、工厂等）可能对环境造成的影响，常在批准前依法要求提交。"},"examples":[{"en":"The agency released an EIS before deciding whether to build the new highway.","zh":"该机构在决定是否修建新高速公路前发布了环境影响说明书（EIS）。"},{"en":"Public comments on the draft EIS are open until next month.","zh":"对EIS草案的公众意见征集将持续到下个月。"}]},{"partOfSpeech":"other","definition":{"en":"Executive Information System: a computer system that helps top managers see key data and make decisions (especially in business contexts).","zh":"高层信息系统/主管信息系统：一种帮助企业高层查看关键数据并做决策的计算机系统（多用于商业语境）。"},"examples":[{"en":"The company upgraded its EIS to track sales and costs in real time.","zh":"公司升级了EIS，以便实时追踪销售和成本。"},{"en":"An EIS dashboard can summarize performance at a glance.","zh":"EIS仪表盘可以一眼概览业绩表现。"}]},{"partOfSpeech":"other","definition":{"en":"Other common meanings (depending on country/field): for example, Employment Insurance System (insurance benefits) or Early Infantile Scoliosis (a medical condition).","zh":"其他常见含义（取决于国家/领域）：例如失业保险体系（福利制度）或婴幼儿早发性脊柱侧弯（医学病症）。"},"examples":[{"en":"In this report, EIS refers to the Employment Insurance System.","zh":"在这份报告中，EIS指的是失业保险体系。"},{"en":"Ask your doctor what EIS means in the medical notes.","zh":"如果在病历里看到EIS，最好询问医生它具体指什么。"}]}],"synonyms":["Environmental Impact Statement (full form)","Executive Information System (full form)"],"phonetic":"/ˌiː aɪ ˈɛs/","extraExplanation":["“EIS”是缩写，具体含义高度依赖语境。在美国政府与环境法规语境里，最常见的是 Environmental Impact Statement（环境影响说明书），与NEPA（国家环境政策法）相关。","读到“EIS”时，先看上下文：是否出现 project、highway、permit、public comment（多半是环境报告）；是否出现 CEO、dashboard、metrics（多半是管理信息系统）；若在政策或医学文本中，则可能是其他专门含义。"]}
{"word":"EISA","summary":{"en":"EISA is an abbreviation most commonly referring to a 2007 U.S. energy law, and in computing it can mean an older PC bus standard.","zh":"EISA是缩写：最常见指2007年的美国能源法律；在计算机领域也可指一种较早的PC总线标准。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Energy Independence and Security Act (U.S., 2007): a U.S. federal law focused on improving energy efficiency, increasing renewable fuels, and strengthening energy security.","zh":"《能源独立与安全法案》（美国，2007）：一部美国联邦法律，重点在于提高能源效率、增加可再生燃料使用并加强能源安全。"},"examples":[{"en":"The EISA of 2007 set stricter energy-efficiency standards for lighting and appliances.","zh":"2007年的EISA为照明和家电设定了更严格的能效标准。"},{"en":"Some of the fuel and efficiency rules were created under EISA and later updated by agencies.","zh":"一些燃料与效率规定源自EISA，之后由相关机构进一步更新。"}]},{"partOfSpeech":"other","definition":{"en":"Extended Industry Standard Architecture: an older computer expansion-bus standard used mainly in late-1980s and early-1990s PCs.","zh":"扩展工业标准体系结构：一种较早的电脑扩展总线标准，主要用于20世纪80年代末到90年代初的个人电脑。"},"examples":[{"en":"That server still has an EISA slot, which is rare today.","zh":"那台服务器竟然还有EISA插槽，这在今天很少见。"},{"en":"EISA was designed to improve on ISA while keeping compatibility with older cards.","zh":"EISA的设计目标是在兼容旧ISA卡的同时改进ISA的性能。"}]}],"synonyms":["Energy Independence and Security Act","Extended Industry Standard Architecture"],"phonetic":"/ˈiːsə/","extraExplanation":["EISA是缩写，在不同领域含义不同。写作时最好在第一次出现时把全称写出来（例如“Energy Independence and Security Act (EISA)”），避免读者误解。","在公共政策语境里，EISA通常指2007年的美国法案；在电脑硬件史或复古硬件语境里，EISA更可能指扩展总线标准。"]}
{"word":"EISB","summary":{"en":"EISB is an acronym most commonly referring to the European International School of Barcelona; in other contexts it may mean something else depending on the field.","zh":"EISB 是一个缩写，较常见的意思是“European International School of Barcelona（巴塞罗那欧洲国际学校）”；在其他语境中也可能代表不同机构或项目名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) European International School of Barcelona, a private international school in Barcelona, Spain.","zh":"（缩写）European International School of Barcelona，西班牙巴塞罗那的一所私立国际学校。"},"examples":[{"en":"She transferred to EISB for its bilingual program.","zh":"她转到 EISB 是因为它的双语课程。"},{"en":"EISB offers an international curriculum for students from many countries.","zh":"EISB 为来自许多国家的学生提供国际课程。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) Used in some contexts as an organization or project name; the exact meaning depends on the field (education, government, business, etc.).","zh":"（缩写）在某些语境中用作机构或项目名称；具体含义取决于领域（教育、政府、商业等）。"},"examples":[{"en":"What does EISB stand for in this report?","zh":"在这份报告里，EISB 代表什么？"},{"en":"Please write out the full name of EISB the first time you use it.","zh":"请在第一次使用 EISB 时写出它的全称。"}]}],"synonyms":["(as a generic writing tip) initialism","abbreviation"],"phonetic":"/ˌiː aɪ ɛs ˈbiː/","extraExplanation":["“EISB”不是一个在英语里全球通用、只有唯一含义的缩写。它最常见、最容易查到的用法之一是指巴塞罗那的 European International School of Barcelona（EISB）。","如果你告诉我你看到“EISB”的句子/文件主题（例如学校、公司、政府项目、技术名词），我可以帮你准确判断它的全称与中文对应。"]}
{"word":"eisc","summary":{"en":"“EISC” is usually an initialism read as the letters E–I–S–C; its meaning depends on context.","zh":"“EISC”通常是按字母读的缩写（E–I–S–C），具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (acronym/initialism) whose meaning depends on the field or document where it appears. It is usually read as the letters “E–I–S–C.”","zh":"一个缩写（首字母缩略词/字母读法），具体含义取决于它出现的领域或文件语境。通常按字母读作“E–I–S–C”。"},"examples":[{"en":"What does EISC stand for in this report?","zh":"在这份报告里，EISC 代表什么？"},{"en":"Please spell out EISC the first time you use it in an email.","zh":"在邮件中第一次使用 EISC 时，请先写出全称。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌiː aɪ ɛs ˈsiː/","extraExplanation":["“EISC”不是一个固定通用的英文单词，更常见的是不同机构/项目的缩写。常见做法是：在正式写作中第一次出现时写出全称（full name），后面再用缩写。","你可以告诉我它出现在哪个领域或句子里（例如教育、政府机构、公司部门、科研项目等），我就能帮你确定最可能的全称与中文译法。"]}
{"word":"eisegeses","summary":{"en":"Eisegesis means interpreting a text by inserting your own ideas into it, instead of deriving meaning from the text.","zh":"Eisegesis 指把自己的观点“读进”文本进行解读，而非从文本本身推导意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “eisegesis”; plural “eisegeses”) The practice of interpreting a text by reading your own ideas or beliefs into it, rather than drawing meaning from the text itself.","zh":"（常写作 eisegesis；复数 eisegeses）把自己的想法或立场“塞进”文本来解读，而不是从文本本身推导出意义的做法。"},"examples":[{"en":"In our literature class, the teacher warned us not to use eisegesis—support your claims with the words on the page.","zh":"在文学课上，老师提醒我们不要做 eisegesis——要用文本里的原话来支持观点。"},{"en":"Some people accuse the author of encouraging violence, but that can be eisegesis if the passage doesn’t actually say that.","zh":"有人指责作者鼓励暴力，但如果段落并没有那样表达，这种解读可能就是 eisegesis。"},{"en":"To avoid eisegesis, read the paragraph again and check the historical or cultural context.","zh":"为了避免 eisegesis，可以再读一遍段落，并核对历史或文化背景。"}]}],"synonyms":["misinterpretation","subjective interpretation","reading into the text"],"phonetic":"/ˌaɪsɪˈdʒisɪs/","extraExplanation":["你输入的 “eisegeses” 很可能是复数形式，但常见的词条会用单数 “eisegesis”。它常与 “exegesis（释经/严谨阐释）”对比：exegesis 强调“从文本中读出”意义；eisegesis 则是“把自己的意思读进去”。","这个词在宗教文本解读（如圣经研究）和文学、法律文本分析中都很常见，通常带有批评意味，表示解读缺乏文本证据或过度主观。"]}
{"word":"eisegesis","summary":{"en":"Eisegesis means interpreting a text by putting your own ideas into it, instead of letting the text and context guide the meaning.","zh":"Eisegesis 指在解读文本时把自己的想法强行“读进”文本，而非依据文本与语境得出含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of reading your own ideas, assumptions, or bias into a text (especially a religious or literary text) rather than drawing meaning from the text itself.","zh":"（尤指对宗教或文学文本）把自己的观点、预设或偏见“读进”文本里，而不是从文本本身得出意义。"},"examples":[{"en":"The teacher warned us that eisegesis can happen when we pick quotes that only support our opinion.","zh":"老师提醒我们：当我们只挑选支持自己观点的引文时，就很容易出现“主观解经/主观解读”（eisegesis）。"},{"en":"In debates about scripture, people sometimes accuse each other of eisegesis.","zh":"在关于经文的辩论中，人们有时会互相指责对方在进行“主观解经”（eisegesis）。"}]}],"synonyms":["subjective interpretation","reading into the text","biased interpretation"],"phonetic":"/ˌaɪsɪˈdʒiːsɪs/","extraExplanation":["Eisegesis 常与 exegesis（释经/阐释）对比：exegesis 强调“从文本中读出”（让证据与语境带出意义）；eisegesis 则是“把意义读进去”。在学术写作中，这类似于“选择性证据”或“先有结论再找依据”。","词源提示：来自希腊语，前缀 eis- 有“进入”之意，可帮助记忆为“把自己的意思塞进文本里”。"]}
{"word":"eisegetic","summary":{"en":"Eisegetic means interpreting a text by inserting your own ideas into it rather than drawing meaning from the text.","zh":"eisegetic 指“外加式解读”：把个人观点读进文本，而非从文本本身推出含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Interpreting a text by reading your own ideas or assumptions into it, instead of drawing meaning from the text itself.","zh":"用自己的观点或预设去“套”文本，把个人想法读进文本里，而不是从文本本身推导意义。"},"examples":[{"en":"Some readers call that interpretation eisegetic because it adds ideas that aren’t clearly in the passage.","zh":"有些读者认为这种解读是“外加式”的（eisegetic），因为它加入了原文并不明确包含的观点。"},{"en":"In literature class, the teacher asked us to support our claims to avoid being eisegetic.","zh":"在文学课上，老师要求我们用文本证据支持观点，避免变成“外加式解读”。"}]}],"synonyms":["interpretive (in a biased way)","impositional","subjective"],"phonetic":"/ˌaɪsɪˈdʒɛtɪk/","extraExplanation":["eisegetic 常用于圣经研究、神学、文学批评与法律文本解读等场景，通常带有批评意味，表示“把观点塞进文本”。它常与 exegesis / exegetical（释经、从文本出发的解读）相对。","词源上来自希腊语：eis-（“进入、向内”）+ hēgeisthai（“引导、解释”相关）。因此字面感觉像“把意义引进去”。","在学术写作里，避免 eisegetic 的常见做法是：引用原文、说明推理步骤、区分“文本所说”和“我推测/我认为”。"]}
{"word":"eisegetical","summary":{"en":"Eisegetical means interpreting a text by putting your own ideas into it rather than basing meaning on the text itself.","zh":"Eisegetical 指解读文本时把自己的想法“读进去”，而非依据文本本身来推导含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an interpretation, especially of a text) reading your own ideas, assumptions, or beliefs into the text instead of drawing meaning from what the text actually says.","zh":"（尤指对文本的解读）把自己的观点、预设或信念“读进”文本里，而不是从文本本身推导其含义。"},"examples":[{"en":"Some critics say his reading of the poem is eisegetical because it depends more on his personal beliefs than on the words on the page.","zh":"一些评论者认为他对这首诗的解读是“意入式”的，因为它更多依赖个人信念，而不是文本中的措辞。"},{"en":"The professor warned us not to make eisegetical claims in our essays; we must support interpretations with evidence from the text.","zh":"教授提醒我们论文里不要做“意入式”的断言；解读必须用文本证据来支撑。"},{"en":"Calling the argument eisegetical suggests it is biased rather than carefully grounded in the source material.","zh":"把这个论证称为“意入式”的，暗示它带有偏见，而不是严谨地建立在原始材料之上。"}]}],"synonyms":["subjective","biased","tendentious","interpretive (often overly interpretive)","not text-based"],"phonetic":"/ˌaɪsɪˈdʒɛtɪkəl/","extraExplanation":["“eisegetical”来自“eisegesis（意入式解经/解读）”，常见于文学批评、宗教研究与法律文本讨论。它通常带有负面评价，意思是解读者先有结论或立场，再把它硬套进文本。","常与“exegetical（释出式/训诂式的；从文本中释义）”对比：exegetical强调依据语境、词义、结构与证据来“从文本里读出来”；eisegetical强调“把自己的意思读进去”。","在写作或课堂讨论中，如果有人说某个观点很eisegetical，往往是在提醒：需要更多文本证据、上下文支持，或需要区分“文本说了什么”与“我觉得它意味着什么”。"]}
{"word":"Eisele","summary":{"en":"Eisele is a German-origin surname, used mainly as a family name.","zh":"Eisele 是一个源自德语地区的姓氏，主要用作家族姓。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A German-origin surname (family name). It is most commonly used as a last name, and it may also appear as a place or brand name depending on context.","zh":"一个源自德语地区的姓氏（家族姓）。最常见用法是作“姓/家族名”，在不同语境下也可能作为地名或品牌名出现。"},"examples":[{"en":"Dr. Eisele will speak at the conference tomorrow.","zh":"艾泽勒博士将于明天在会议上发言。"},{"en":"My teacher’s last name is Eisele.","zh":"我老师的姓是 Eisele。"},{"en":"I saw the name Eisele on the mailbox.","zh":"我在邮箱上看到了 Eisele 这个名字。"}]}],"synonyms":["(No direct synonyms; surnames typically don’t have synonyms.)"],"phonetic":"/ˈaɪzəl/","extraExplanation":["“Eisele”多见于德语区（如德国、奥地利、瑞士）及其移民社群，是一个典型的德语姓氏。德语姓氏常带有地区方言色彩，小尾缀“-le”在德语某些方言（如施瓦本/阿勒曼尼语系）里有“小称/昵称”的感觉，因此这个姓氏常被认为带有方言来源。由于姓氏来源复杂，精确词源需要结合具体家族地区与历史记录。"]}
{"word":"Eisen","summary":{"en":"Eisen is a German word meaning “iron,” and it can also be a German-origin surname.","zh":"Eisen 是德语“铁”的意思，也可以是一个源自德语的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German word) iron; a common element used to make steel and many tools.","zh":"（德语）“铁”；一种常见元素，用来制造钢和许多工具。"},"examples":[{"en":"In German, Eisen means “iron.”","zh":"在德语里，Eisen 的意思是“铁”。"},{"en":"The sign said “Eisenwaren,” meaning hardware goods made mostly of metal.","zh":"牌子上写着“Eisenwaren”，意思是以金属为主的五金/铁器商品。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), often of German origin.","zh":"一个姓氏（家族姓），常见于德语背景。"},"examples":[{"en":"Her last name is Eisen, and her family is from Germany.","zh":"她的姓是 Eisen，她的家族来自德国。"},{"en":"You may recognize the related name Eisenhower (from German roots).","zh":"你可能听过相关的名字 Eisenhower（有德语词根）。"}]}],"synonyms":["iron (meaning)"],"phonetic":"/ˈaɪzən/","extraExplanation":["“Eisen”在德语中读音接近“艾-森”，字面就是“铁”。在英语环境里，它常作为姓氏出现，发音也通常按相近的读法来念。","你可能在复合词里见到它：Eisenbahn（铁路，字面“铁-路”）、Eisenwaren（五金/铁器商品）。这些都体现了德语喜欢把词组合在一起的构词方式。"]}
{"word":"Eisenach","summary":{"en":"Eisenach is a city in Thuringia, Germany, famous for Wartburg Castle and as J. S. Bach’s birthplace.","zh":"Eisenach（艾森纳赫）是德国图林根州的一座城市，以瓦特堡和巴赫出生地而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the state of Thuringia (Thüringen), central Germany, known for Wartburg Castle and as the birthplace of composer Johann Sebastian Bach.","zh":"德国中部图林根州的一座城市，以瓦特堡（Wartburg Castle）闻名，也是作曲家约翰·塞巴斯蒂安·巴赫（J. S. Bach）的出生地。"},"examples":[{"en":"We stopped in Eisenach to visit Wartburg Castle.","zh":"我们在艾森纳赫停留，去参观瓦特堡。"},{"en":"Bach was born in Eisenach in 1685.","zh":"巴赫于1685年出生在艾森纳赫。"}]}],"phonetic":"/ˈaɪzənˌɑk/","extraExplanation":["“Eisenach”读作德语地名，常见文化联想包括：瓦特堡与马丁·路德（Martin Luther）在此隐居并翻译《新约》；以及巴赫的生平与纪念馆。","词源上可拆分理解：Eisen（铁）+ Ach/Ache（古德语里与水/河有关的词根），但日常使用中只需把它当作专有地名记忆即可。"]}
{"word":"Eisenberg","summary":{"en":"Eisenberg is most commonly a German-origin surname, and it can also be a place name in German-speaking regions.","zh":"Eisenberg 最常见是源自德语的姓氏，也可作德语地区的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally German; used by many people (for example, the American actor Jesse Eisenberg).","zh":"（姓氏）源自德语的姓；许多人使用（例如美国演员 Jesse Eisenberg）。"},"examples":[{"en":"Jesse Eisenberg starred in the film The Social Network.","zh":"杰西·艾森伯格出演了电影《社交网络》。"},{"en":"Her last name is Eisenberg.","zh":"她的姓是艾森伯格。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name; Eisenberg is also the name of towns in German-speaking areas.","zh":"（地名）Eisenberg 也是德语地区一些城镇的名字。"},"examples":[{"en":"They visited Eisenberg during their trip in Germany.","zh":"他们在德国旅行时参观了艾森伯格（Eisenberg）。"},{"en":"Eisenberg appears on the map as a small town.","zh":"在地图上，Eisenberg 标注为一个小镇。"}]}],"phonetic":"/ˈaɪzənˌbɝɡ/","extraExplanation":["“Eisenberg”来自德语：Eisen（铁）+ Berg（山），字面意思接近“铁山”。因此它既可能作为地名（以地形或矿产命名），也常见于姓氏（源自祖先居住地或地名）。","英语里这种外来姓/地名通常不翻译含义，而是按读音音译为“艾森伯格”等；不同地区的中文译名可能略有差异。"]}
{"word":"Eisenhart","summary":{"en":"Eisenhart is mainly a German-origin surname, and it also appears in academic terms named after a person called Eisenhart.","zh":"Eisenhart 主要是一个德语来源的姓氏；它也会出现在以名为 Eisenhart 的学者命名的学术术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) of German origin; used to refer to a person or family with this name.","zh":"（姓氏）德国来源的姓；用来指名叫 Eisenhart 的人或家族。"},"examples":[{"en":"Dr. Eisenhart will lead today’s seminar.","zh":"Eisenhart 博士将主持今天的研讨会。"},{"en":"I emailed Professor Eisenhart about the assignment.","zh":"我给 Eisenhart 教授发邮件询问作业的事。"}]},{"partOfSpeech":"other","definition":{"en":"(in academic contexts) used in names of concepts associated with people named Eisenhart, especially in mathematics/physics (e.g., “Eisenhart theorem,” “Eisenhart lift”).","zh":"（学术语境）用于与名为 Eisenhart 的学者相关的概念名称，尤见于数学/物理（如“Eisenhart 定理”“Eisenhart 提升”）。"},"examples":[{"en":"The paper mentions the Eisenhart lift as a way to reformulate a dynamical system.","zh":"论文提到 Eisenhart 提升，用来重写一个动力系统。"},{"en":"Our geometry course briefly discussed an Eisenhart theorem.","zh":"我们的几何课简要讨论过一个 Eisenhart 定理。"}]}],"phonetic":"ˈaɪzənhɑrt","extraExplanation":["“Eisenhart”常被认为来自德语词根：Eisen（铁）+ hart（坚硬/强韧），因此字面上有“像铁一样坚硬”的含义。","在学术引用里，它通常不是普通词汇而是人名；是否需要大写取决于是否作为专名（一般都大写）。"]}
{"word":"Eisenhower","summary":{"en":"Eisenhower usually refers to Dwight D. Eisenhower, a WWII Allied commander and the 34th U.S. president; it is also a surname.","zh":"Eisenhower通常指二战盟军统帅、美国第34任总统德怀特·D·艾森豪威尔；也可作姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dwight D. Eisenhower (1890–1969), the 34th president of the United States and a five-star general who led Allied forces in Europe during World War II.","zh":"德怀特·D·艾森豪威尔（1890–1969），美国第34任总统、五星上将，二战期间担任欧洲盟军最高统帅。"},"examples":[{"en":"Eisenhower was elected president in 1952.","zh":"艾森豪威尔于1952年当选总统。"},{"en":"As Supreme Allied Commander, Eisenhower oversaw the D-Day invasion in 1944.","zh":"作为盟军最高统帅，艾森豪威尔在1944年指挥了诺曼底登陆（D-Day）。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), especially in reference to people or things connected with Dwight D. Eisenhower.","zh":"姓氏（家族姓），也常用来指与德怀特·D·艾森豪威尔相关的人或事物。"},"examples":[{"en":"The Eisenhower administration focused on ending the Korean War.","zh":"艾森豪威尔政府致力于结束朝鲜战争。"},{"en":"Many highways expanded during the Eisenhower era.","zh":"在艾森豪威尔时期，许多高速公路得到了扩建。"}]}],"synonyms":["Dwight D. Eisenhower","Ike (nickname)"],"phonetic":"/ˈaɪzənˌhaʊ.ɚ/","extraExplanation":["在英语语境里，提到“Eisenhower”常直接指这位总统本人；口语中也常叫他“Ike”（读作 /aɪk/），属于亲切的昵称。","他任内的重要概念包括“军事工业复合体（military-industrial complex）”一词：他在1961年告别演说中提醒公众关注军工力量对政治与社会的影响。","“Eisenhower Interstate System”指美国州际公路系统（联邦资助的大规模高速公路网络），常被视为他任内最具影响力的国内建设之一。"]}
{"word":"Eisenstadt","summary":{"en":"Eisenstadt is mainly the name of a city in eastern Austria (capital of Burgenland), and it can also be a surname.","zh":"Eisenstadt主要指奥地利东部城市（布尔根兰州首府），也可用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in eastern Austria, the capital of the state of Burgenland, near the Hungarian border.","zh":"奥地利东部城市，布尔根兰州（Burgenland）的首府，靠近匈牙利边境。"},"examples":[{"en":"Eisenstadt is the capital of Burgenland.","zh":"艾森施塔特是布尔根兰州的首府。"},{"en":"We took a day trip from Vienna to Eisenstadt.","zh":"我们从维也纳去艾森施塔特一日游。"},{"en":"Many visitors come to Eisenstadt for its music history.","zh":"很多游客因其音乐历史而来到艾森施塔特。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), most often of German-speaking origin.","zh":"姓氏（多见于德语地区的姓）。"},"examples":[{"en":"Her last name is Eisenstadt.","zh":"她的姓是艾森施塔特。"}]}],"phonetic":"/ˈaɪzənʃtæt/","extraExplanation":["“Eisenstadt”在德语里可拆解理解为 Eisen（铁）+ Stadt（城市），字面意思类似“铁之城”。作为地名，它常与埃斯特哈齐宫（Esterházy Palace）以及作曲家海顿（Joseph Haydn）联系在一起：海顿曾长期为埃斯特哈齐家族工作，因此当地有浓厚的古典音乐氛围与相关景点。"]}
{"word":"Eisenstark","summary":{"en":"Eisenstark is mainly a German-origin surname meaning “iron-strong.”","zh":"Eisenstark 主要是源自德语的姓氏，字面含义是“铁一般强壮”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a German-origin surname (proper name). It comes from German roots meaning “iron” (Eisen) + “strong” (stark), suggesting someone “iron-strong” or very sturdy.","zh":"一个源自德语的姓氏（专有名词）。词源来自德语“Eisen（铁）”+“stark（强壮）”，带有“铁一般强壮 / 很坚韧”的含义。"},"examples":[{"en":"Professor Eisenstark will lead today’s seminar on materials science.","zh":"艾森施塔克教授将主持今天的材料科学研讨课。"},{"en":"The letter was signed, “Sincerely, A. Eisenstark.”","zh":"信末署名写着：“此致，A. 艾森施塔克。”}],"}]}],"synonyms":["(no direct synonym; it is a proper name)"],"phonetic":"/ˈaɪzənstɑrk/","extraExplanation":["“Eisenstark”更常见于德语环境中的姓氏；在英语里通常保持原拼写，不会像普通词那样有固定的词典释义。","如果你是在某部小说、电影、游戏或特定学科文章里看到“Eisenstark”，它也可能是角色名、地名或品牌名；告诉我出处，我可以按语境解释它的具体指代。"]}
{"word":"Eisenstein","summary":{"en":"Eisenstein is a surname, most often referring to Sergei Eisenstein, a major Soviet filmmaker and montage theorist.","zh":"Eisenstein 是姓氏，最常指苏联重要电影导演与蒙太奇理论家谢尔盖·爱森斯坦。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname; most commonly refers to Sergei Eisenstein, a pioneering Soviet film director and theorist known for developing montage (editing) techniques.","zh":"一个姓氏；最常指苏联电影导演与理论家谢尔盖·爱森斯坦，以发展“蒙太奇”（剪辑）手法而闻名。"},"examples":[{"en":"We watched an Eisenstein film in our cinema history class.","zh":"我们在电影史课上看了一部爱森斯坦的电影。"},{"en":"Eisenstein’s montage style influenced modern action and propaganda films.","zh":"爱森斯坦的蒙太奇风格影响了现代动作片和宣传片。"},{"en":"The essay compares Eisenstein and Hitchcock as editors and storytellers.","zh":"这篇文章把爱森斯坦和希区柯克作为剪辑者与叙事者进行比较。"}]},{"partOfSpeech":"other","definition":{"en":"In specialized contexts, the name may refer to concepts named after mathematicians or scientists with the surname Eisenstein (e.g., “Eisenstein series” in mathematics).","zh":"在专业语境中，也可能指以“Eisenstein/爱森斯坦”为姓的数学家或科学家命名的概念（如数学中的“Eisenstein series/爱森斯坦级数”）。"},"examples":[{"en":"The course briefly introduced Eisenstein series.","zh":"这门课简要介绍了爱森斯坦级数。"},{"en":"In number theory, some results are associated with Eisenstein.","zh":"在数论中，有些结果与爱森斯坦有关。"}]}],"phonetic":"/ˈaɪzənˌstaɪn/","extraExplanation":["在英语里，“Eisenstein”通常作为专有名词出现，最常见的文化指向是电影人谢尔盖·爱森斯坦（Sergei Eisenstein）。他以“蒙太奇”理论著称，强调通过镜头的并置与剪辑来产生新的意义（不仅仅是把镜头接在一起）。","代表作常被提到的有《战舰波将金号》（Battleship Potemkin）。在影史与媒体研究写作中，\"Eisenstein\" 常用来指代一种剪辑/叙事风格或理论传统。","注意不要与“Einstein（爱因斯坦）”混淆：拼写不同，发音也不同；Eisenstein 里有 “-stein” 结尾，但开头是 “Eisen-”。"]}
{"word":"Eiser","summary":{"en":"“Eiser” is mainly used as a surname (and rarely as a first name) rather than a common English word.","zh":"“Eiser”主要作为姓氏（偶尔作名字）使用，并不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（专有名词）姓氏。"},"examples":[{"en":"Dr. Eiser will speak at the conference tomorrow.","zh":"艾泽尔博士将于明天在会议上发言。"},{"en":"My teacher’s last name is Eiser.","zh":"我老师的姓是 Eiser。"}]},{"partOfSpeech":"other","definition":{"en":"(rare) a given name; used much less often than as a surname.","zh":"（较少见）名字；远不如作为姓氏常见。"},"examples":[{"en":"Eiser is an uncommon first name in English-speaking countries.","zh":"在英语国家里，Eiser 作为名字并不常见。"}]}],"synonyms":["(none—proper name)"],"phonetic":"/ˈaɪzər/","extraExplanation":["“Eiser”在英语里通常被当作人名（尤其是姓）。它不是常见的英语词汇，因此在词典里可能查不到作为普通词的释义。","发音可能因家庭/语言背景而不同；在英语环境中常见的读法接近 /ˈaɪzər/。","容易与 “easier”（更容易的）或姓氏 “Eisner” 混淆；如果你是在句子里看到它，我也可以帮你根据上下文判断含义。"]}
{"word":"Eisinger","summary":{"en":"Eisinger is a family name (surname), commonly associated with German-speaking backgrounds.","zh":"Eisinger 是一个姓氏，常与德语背景相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), often of German origin; it may refer to people with the last name Eisinger.","zh":"一个姓氏（家族姓），多见于德语背景；可指姓 Eisinger 的人。"},"examples":[{"en":"Eisinger is his last name, not his first name.","zh":"Eisinger 是他的姓，不是名。"},{"en":"In the article, Eisinger argues that the policy needs to change.","zh":"在那篇文章里，Eisinger 主张这项政策需要改变。"}]}],"phonetic":"/ˈaɪsɪŋər/","extraExplanation":["Eisinger 通常被当作专有名词使用（姓氏），写作时首字母要大写：Eisinger。用于称呼时常见格式包括“Mr./Ms. Eisinger”（Eisinger 先生/女士）或“Dr. Eisinger”（Eisinger 博士）。","该姓氏常被认为与德语姓名传统有关；在英语语境中读音可能因家庭或地区习惯略有差异，但一般以“Eis-”开头的发音较常见。"]}
{"word":"Eisk","summary":{"en":"“Eisk” is not a standard English word; it’s likely a misspelling or a context-specific name/acronym.","zh":"“Eisk”不是标准英语单词；更可能是拼写错误或特定语境中的名称/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo (for example, “ask,” “risk,” or “disk”) or an acronym/name used in a specific context.","zh":"不是标准英语单词。很可能是拼写错误（例如想写“ask / risk / disk”），或是在特定语境中使用的缩写/名称。"},"examples":[{"en":"“Eisk” doesn’t appear in standard English dictionaries; could you share the full sentence?","zh":"“Eisk”在常见英语词典里找不到；你能提供完整句子吗？"},{"en":"If you meant “ask,” the sentence would be: “I’ll ask the teacher tomorrow.”","zh":"如果你想写的是“ask”，句子可以是：“I’ll ask the teacher tomorrow.”（我明天会问老师。）"},{"en":"If you meant “risk,” you could say: “Driving fast increases the risk of accidents.”","zh":"如果你想写的是“risk”，可以说：“Driving fast increases the risk of accidents.”（开快车会增加事故风险。）"}]}],"phonetic":"/iːsk/","extraExplanation":["如果你是从聊天、游戏用户名、品牌名或课程材料里看到“Eisk”，它可能是专有名词或缩写，含义取决于领域（例如公司/组织名、项目代号）。","把“Eisk”放进一句完整英文里发我（前后各3–5个词也行），我就能判断你真正想表达的是哪个词，并给出准确释义与用法对比。"]}
{"word":"eisk","summary":{"en":"“eisk” is not a standard English word; it’s likely a misspelling (possibly “risk,” “disk,” or “ask”).","zh":"“eisk”不是标准英语单词；很可能是拼写错误（可能是 risk、disk 或 ask）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or a misspelling of a similar-looking word (such as “risk,” “ask,” or “disk”).","zh":"不是标准英语单词。很可能是输入错误或拼写错误，可能想写的是外形相近的单词（如 risk、ask、disk）。"},"examples":[{"en":"I couldn’t find “eisk” in an English dictionary—did you mean “risk”?","zh":"我在英语词典里找不到“eisk”——你是不是想写“risk（风险）”？"},{"en":"If you meant “disk,” try writing: “Save the file to the disk.”","zh":"如果你想写“disk（磁盘）”，可以写：“Save the file to the disk.”"}]}],"phonetic":"/iːsk/","extraExplanation":["“eisk”看起来像是键盘误触或拼写颠倒/漏字。你可以告诉我你想表达的句子或语境（比如：‘eisk’前后有哪些词），我就能更准确地判断你真正想要的单词。常见可能：risk（风险）、disk（磁盘/圆盘）、ask（问）、Esk-（如 Eskimo 的词根，但现在更推荐用 Inuit 等更准确的族群名称，且不写作 eisk）。"]}
{"word":"Eisler","summary":{"en":"Eisler is mainly a surname; in cultural contexts it often refers to the composer Hanns Eisler.","zh":"Eisler主要是一个姓氏；在文化语境中常指作曲家汉斯·艾斯勒。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), most often of German or Central European origin.","zh":"姓氏（家族姓），多见于德语区或中欧背景。"},"examples":[{"en":"Her last name is Eisler, but she grew up in the U.S.","zh":"她姓Eisler，但在美国长大。"},{"en":"I’m emailing Professor Eisler about the assignment.","zh":"我正在给Eisler教授发邮件询问作业。"}]},{"partOfSpeech":"other","definition":{"en":"In arts and history, often refers to Hanns Eisler (1898–1962), an Austrian-German composer known for political songs and collaborations with Bertolt Brecht.","zh":"在艺术与历史语境中，常指汉斯·艾斯勒（Hanns Eisler，1898–1962），奥地利/德国作曲家，以政治歌曲及与布莱希特（Bertolt Brecht）的合作闻名。"},"examples":[{"en":"We studied Eisler’s music alongside Brecht’s theater.","zh":"我们把艾斯勒的音乐与布莱希特的戏剧一起学习。"},{"en":"The documentary uses songs by Eisler to set the tone.","zh":"这部纪录片用艾斯勒的歌曲来营造氛围。"}]}],"phonetic":"/ˈaɪzlər/","extraExplanation":["“Eisler”在英语里通常作为专有名词使用：要么是人的姓，要么在特定学术/艺术语境中指“（汉斯·）艾斯勒”。大小写一般首字母大写。","发音上，英语里常读作/ˈaɪzlər/（类似“EYES-ler”）。如果当事人来自不同国家/家庭，也可能有个人偏好的读法。"]}
{"word":"Eisner","summary":{"en":"Eisner is a surname of German origin, commonly known in English through public figures (e.g., Michael Eisner).","zh":"Eisner 是一个德语来源的姓氏，在英语中常因公众人物（如 Michael Eisner）而为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German-language surname (family name), also found among Ashkenazi Jewish families; in English it is most often recognized from notable people such as Michael Eisner (former CEO of The Walt Disney Company).","zh":"一个德语来源的姓氏（家族姓），也常见于部分阿什肯纳兹犹太家庭；在英语语境中常因名人而为人熟知，例如迈克尔·艾斯纳（Michael Eisner，前迪士尼公司CEO）。"},"examples":[{"en":"Michael Eisner led Disney during a major period of expansion.","zh":"迈克尔·艾斯纳在迪士尼公司快速扩张的重要时期担任领导。"},{"en":"My professor is Dr. Eisner.","zh":"我的教授是艾斯纳博士。"}]}],"synonyms":["surname","family name","last name"],"phonetic":"/ˈaɪznər/","extraExplanation":["“Eisner”多被视为专有名词（姓氏）。在英语里，姓氏通常不翻译含义，但它源自德语词根，常被解释为与“铁/金属加工”（德语古词 *īsen*，意为“铁”）相关的职业姓。","读法提示：英语里常读作“EYE-zner”（重音在第一个音节）。"]}
{"word":"eisodic","summary":{"en":"Episodic means happening in separate episodes or parts, often not continuous, and it can describe TV/books/podcasts made of individual episodes.","zh":"Episodic 指“以一集/一段一段发生的、非连续的（间歇性的）”，也可用来形容由单集/单章构成的电视、书或播客。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening in separate parts or events, not continuously; occurring from time to time.","zh":"以一段一段的事件发生的；非连续的；间歇性的。"},"examples":[{"en":"The show tells the story in an episodic way, with a new problem each week.","zh":"这部剧用单元式的方式讲故事，每周都有一个新问题。"},{"en":"He had episodic headaches that came and went.","zh":"他的头痛是间歇性的，时有时无。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to an episode (one part of a series), especially in TV, books, or podcasts.","zh":"与“集/篇章（episode）”有关的，尤指电视剧、书籍或播客的单集/单章。"},"examples":[{"en":"Episodic TV usually has many episodes in one season.","zh":"单元式电视剧通常一季有很多集。"},{"en":"I prefer episodic podcasts because I can listen in any order.","zh":"我更喜欢单元式播客，因为可以按任意顺序收听。"}]}],"synonyms":["intermittent","occasional","periodic","serialized (opposite in storytelling)"],"phonetic":"/ˌɛpəˈsɑdɪk/","extraExplanation":["你输入的“eisodic”很可能是拼写错误，正确拼写是 episodic（常见错误：把开头的“ep-”写成“ei-”）。","在文化语境里，episodic 常用来形容“单元剧/怪物-of-the-week”这类结构：每一集相对独立；与之相对的是 serialized（连续剧/强剧情连续）。","在心理学里，episodic memory 指“情景记忆/事件记忆”，即你对亲身经历过的具体事件（时间、地点、感受）的记忆。"]}
{"word":"eisodos","summary":{"en":"Eisodos is a term from Greek drama meaning an entrance, especially the chorus’s entrance or entrance song.","zh":"Eisodos 是希臘戲劇用語，指「入場」，尤指合唱隊的進場或進場歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Classics, Greek drama) an entrance—especially the entrance of the chorus, or the entrance song sung as the chorus enters.","zh":"（古典學／希臘戲劇）「入場」；尤指合唱隊（chorus）的進場，或合唱隊進場時所唱的進場歌。"},"examples":[{"en":"In many tragedies, the eisodos introduces the chorus and sets the mood for the play.","zh":"在許多悲劇中，eisodos 用來引入合唱隊，並為全劇定下氛圍。"},{"en":"The director staged the eisodos slowly, so the audience could absorb the opening tension.","zh":"導演把 eisodos 設計得較慢，讓觀眾能感受開場的緊張感。"}]},{"partOfSpeech":"n.","definition":{"en":"a way in; an entrance passage or approach (a more general sense).","zh":"入口；進入的通道或進入方式（較一般的意思）。"},"examples":[{"en":"The side door served as an eisodos for performers waiting backstage.","zh":"側門成了演員在後台等候時的進場入口。"}]}],"synonyms":["entrance","entry","procession","chorus entrance","entrance song"],"phonetic":"/aɪˈsoʊdɑs/","extraExplanation":["「eisodos」來自古希臘語 εἴσοδος，字面意思是「進入、入口」。在希臘悲劇的結構中，它常和「parodos（合唱隊登場歌）」一起被討論：有些課本會把合唱隊第一次進場的歌更常稱為 parodos，而把「eisodos」當作「進場／入口」這個動作或通道來說。不同教材用法可能略有差異。","在古希臘劇場中，舞台兩側常有側入口（eisodoi，複數），角色或合唱隊會從這些通道進出；它們也可能暗示人物來自城內或城外等方向。"]}
{"word":"eisoptrophobia","summary":{"en":"Eisoptrophobia means a strong fear of mirrors or one’s own reflection.","zh":"Eisoptrophobia 指对镜子或自己倒影的强烈恐惧（恐镜症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear of mirrors or of seeing your own reflection.","zh":"对镜子或看到自己倒影的强烈恐惧（恐镜症）。"},"examples":[{"en":"She avoids rooms with large mirrors because she has eisoptrophobia.","zh":"她会避开有大镜子的房间，因为她有恐镜症（eisoptrophobia）。"},{"en":"His eisoptrophobia makes getting ready in the morning very stressful.","zh":"他的恐镜症让每天早上整理仪容变得很有压力。"}]}],"synonyms":["fear of mirrors","catoptrophobia"],"phonetic":"/ˌaɪ.sɑp.trəˈfoʊ.bi.ə/","extraExplanation":["词源：来自希腊语 *eisoptron*（镜子）+ *-phobia*（恐惧）。医学或心理学语境中更常见；日常英文也常用更通俗的说法，如 “fear of mirrors”。","注意：这是特定恐惧的一种（specific phobia）。有些人害怕镜子本身，有些人主要害怕“看到自己的倒影”带来的焦虑或不适。若这种恐惧影响生活，通常建议寻求专业心理帮助。"]}
{"word":"EISS","summary":{"en":"EISS is usually an acronym; its meaning depends on the context where you found it.","zh":"EISS 通常是缩写；具体含义要看你在哪里看到它。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that can stand for different phrases in different fields (education, business, healthcare, etc.). Its exact meaning depends on context.","zh":"一个缩写，在不同领域（教育、商业、医疗等）可能代表不同全称；具体含义取决于语境。"},"examples":[{"en":"I saw “EISS” in the email, but it didn’t explain what it stood for.","zh":"我在邮件里看到“EISS”，但没有说明它代表什么。"},{"en":"What does EISS mean in your school/company document?","zh":"在你们学校/公司的文件里，EISS 是什么意思？"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/iː aɪ ɛs ɛs/","extraExplanation":["“EISS”不是一个固定、全球通用的单词，更常见的是作为缩写出现。缩写在不同机构里可能完全不同。要准确释义，通常需要你提供：出现的句子、所属领域（例如学校、IT、安全、医疗）、国家/地区或文件标题。","如果你把包含 EISS 的原句（或截图/上下文）发来，我可以根据语境给出最可能的全称、中文翻译，以及更自然的用法示例。"]}
{"word":"Eiswein","summary":{"en":"Eiswein is a very sweet dessert wine made from naturally frozen grapes pressed while still frozen.","zh":"Eiswein（冰酒）是用藤上自然结冰的葡萄在冻结状态下压榨制成的高甜度甜点酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sweet dessert wine made from grapes that are naturally frozen on the vine and pressed while still frozen, producing very concentrated juice.","zh":"冰酒：一种甜型甜点酒，由葡萄在藤上自然结冰后趁冷压榨而成，汁液高度浓缩、甜度高。"},"examples":[{"en":"We ordered a small glass of Eiswein with dessert.","zh":"我们点了一小杯冰酒配甜点。"},{"en":"Because the grapes freeze before pressing, Eiswein is usually very sweet and aromatic.","zh":"因为葡萄在压榨前会结冰，冰酒通常非常甜、香气也很浓。"}]}],"synonyms":["ice wine","dessert wine","sweet wine"],"phonetic":"/ˈaɪsvaɪn/","extraExplanation":["“Eiswein”是德语词，直译为“冰酒”。英语里常直接借用这个拼写（Eiswein），也常见翻译“ice wine”。","正宗冰酒的关键是“自然结冰（natural freeze）”：葡萄必须在葡萄藤上被低温冻住后采收并在冻结状态下压榨，这样水分结成冰留在压榨残渣里，流出的汁液更浓更甜。","在文化与产区上，德国、奥地利和加拿大都以冰酒闻名；其中加拿大（如安大略省、卑诗省）在国际市场上很常见。购买时可留意酒标是否写明“ice wine/Eiswein”以及产区法规用语。"]}
{"word":"Eiten","summary":{"en":"“Eiten” is usually a personal name or a misspelling of “eaten.”","zh":"“Eiten”通常是人名，或是把“eaten”（吃过/被吃掉）误拼了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (a less common spelling; often seen as a variant of the Hebrew name “Eitan/Ethan”).","zh":"人名（较少见的拼写；常被视为希伯来名字“Eitan/Ethan”的变体）。"},"examples":[{"en":"Eiten moved to the U.S. when he was ten.","zh":"Eiten十岁时搬到了美国。"},{"en":"I’m not sure whether it’s spelled Eiten or Eitan in the email.","zh":"我不确定邮件里是拼作Eiten还是Eitan。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “eaten,” the past participle of “eat.”","zh":"常见为“eaten”的误拼，即动词“eat”的过去分词。"},"examples":[{"en":"I’ve already eaten lunch.","zh":"我已经吃过午饭了。"},{"en":"The cake was eaten before I arrived.","zh":"我到之前蛋糕就被吃完了。"}]}],"synonyms":["Eitan","Ethan","eaten"],"phonetic":"/ˈaɪtən/","extraExplanation":["“Eiten”在英语里不是常见词汇，更常见的是作为人名拼写变体出现。若你想表达“吃过/被吃掉”，正确拼写通常是“eaten”。","相关名字对比：Ethan（英语常见名）、Eitan（更接近希伯来语转写）。不同家庭/地区可能会有不同拼写。"]}
{"word":"EITHER","summary":{"en":"Either refers to one of two choices; it’s also used in negatives to mean “too,” and in the pattern “either…or…”.","zh":"Either 表示“两者中的任意一个”；也可用于否定句表示“也”；常见结构是 either…or…（要么……要么……）。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"One of two (used when you have a choice between two things, people, or options).","zh":"（两者中的）任意一个（用于在两者之间做选择）。"},"examples":[{"en":"You can sit on either side of the table.","zh":"你可以坐在桌子的任意一边。"},{"en":"Either answer is acceptable.","zh":"两个答案随便哪一个都可以。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used to show that a negative statement is also true for another person or thing (meaning “too,” but in negative sentences).","zh":"（用于否定句）也；同样（相当于肯定句里的“too”，但用于否定）。"},"examples":[{"en":"I don’t like spicy food, and my sister doesn’t either.","zh":"我不喜欢辣的，我妹妹也不喜欢。"},{"en":"He can’t swim, and I can’t either.","zh":"他不会游泳，我也不会。"}]},{"partOfSpeech":"pron.","definition":{"en":"One or the other of two; each of two (often used with “either…or…” to show a choice).","zh":"两者之一；要么……要么……（常用于“either…or…”表示选择）。"},"examples":[{"en":"Either you apologize, or you leave.","zh":"要么你道歉，要么你离开。"},{"en":"We can eat either at home or at a restaurant.","zh":"我们可以要么在家吃，要么去餐馆吃。"}]},{"partOfSpeech":"conj.","definition":{"en":"Used with “or” to connect two choices.","zh":"用于与“or”搭配连接两个选项。"},"examples":[{"en":"You can call me either today or tomorrow.","zh":"你可以今天或明天给我打电话。"},{"en":"Either John or Maria will present the report.","zh":"约翰或玛丽亚会做报告。"}]}],"synonyms":["one of the two","any (when more than two, not a synonym in form)","too (in negatives: either)"],"phonetic":"ˈiːðər","extraExplanation":["“either”的核心是“两者”。当选项多于两个时，通常用“any”（任意一个）更自然：Any day next week is fine（下周哪天都行）。","常见固定结构：\n1) either…or…（要么……要么……）\n2) not…either（也不……）：I didn’t go, and she didn’t either.\n另外，“me either”在口语里很常见，但更标准的说法是“me neither”（我也不）。在美式口语中，两者都能听到。"]}
{"word":"either","summary":{"en":"“Either” is used for two choices: one of the two (or both are acceptable), for “either…or…,” and in negatives meaning “also not.”","zh":"“either”用于两个选项：表示“两者之一/任意一个（有时两个都行）”，用于“either…or…”结构，以及在否定句中表示“也不”。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"Used to talk about one of two choices, people, or things (it can mean “one or the other,” and sometimes “both are fine”).","zh":"用于谈论两个选项/人/事物中的任意一个（可表示“二者之一”，有时也表示“哪个都行/都可以”）。"},"examples":[{"en":"You can take either bus—both go downtown.","zh":"你可以坐任意一趟公交车——两趟都去市中心。"},{"en":"Either answer is acceptable.","zh":"两个答案哪个都可以。"}]},{"partOfSpeech":"conj.","definition":{"en":"Used with “or” to show a clear choice between two alternatives.","zh":"与“or”搭配，表示在两个备选项之间做明确选择（“要么……要么……”）。"},"examples":[{"en":"Either you apologize, or you leave.","zh":"要么你道歉，要么你离开。"},{"en":"We can either eat now or wait until later.","zh":"我们要么现在吃，要么等会儿再吃。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used in negative statements meaning “also not” (often with “neither”).","zh":"用于否定句，表示“也不”（常与“neither”呼应）。"},"examples":[{"en":"I don’t like horror movies, and my sister doesn’t either.","zh":"我不喜欢恐怖片，我妹妹也不喜欢。"},{"en":"He wasn’t invited, and I wasn’t either.","zh":"他没被邀请，我也没被邀请。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used after a negative word to add emphasis, meaning “as well / too.”","zh":"跟在否定词后加强语气，表示“也/同样”（语气更强调）。"},"examples":[{"en":"I can’t go, either!","zh":"我也去不了！"}]}],"synonyms":["one or the other","any of the two","too (in negatives: not…either)"],"phonetic":"/ˈiːðər/","extraExplanation":["易混点：either vs. neither。either 表示“两者之一/任意一个”；neither 表示“两者都不”。例如：“Either option works.”=两个选项哪个都行；“Neither option works.”=两个选项都不行。","常见搭配：either…or…（要么……要么……）；not…either（也不）；either way（不管怎样/无论如何）。","语气与位置：作为副词表示“也不”时，either 常放在句末：“I don’t like it either.” 更自然；放在句中通常需要更复杂的结构。"]}
{"word":"EITS","summary":{"en":"EITS is an acronym with several possible meanings; its exact meaning depends on the context.","zh":"EITS 是一个可能有多种含义的缩写，具体意思需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for different organizations or programs; the meaning depends on the context (field, country, company).","zh":"一个缩写，可能代表不同的机构或项目；具体含义取决于语境（行业、国家、公司等）。"},"examples":[{"en":"In this document, EITS refers to a government IT support team.","zh":"在这份文件中，EITS 指的是一个政府的 IT 支持团队。"},{"en":"Can you tell me what EITS stands for in your company?","zh":"你能告诉我在你们公司里 EITS 是什么的缩写吗？"}]},{"partOfSpeech":"other","definition":{"en":"(common use in some organizations) Enterprise Information Technology Services: a department that provides IT systems and support for a business.","zh":"（某些组织常用）Enterprise Information Technology Services：为企业提供信息技术系统与支持的部门。"},"examples":[{"en":"Please contact EITS if you can’t log in to your account.","zh":"如果你无法登录账号，请联系 EITS。"},{"en":"EITS maintains the company’s email and network systems.","zh":"EITS 负责维护公司的邮箱和网络系统。"}]},{"partOfSpeech":"other","definition":{"en":"(less common; varies by location) Early Intervention Treatment Services: services that support people (often children) who need help as early as possible.","zh":"（较不常见；因地区而异）Early Intervention Treatment Services：为需要尽早获得帮助的人（常指儿童）提供的早期干预/治疗服务。"},"examples":[{"en":"The clinic offers EITS for young children with developmental delays.","zh":"这家诊所为发育迟缓的幼儿提供 EITS（早期干预服务）。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/iː aɪ tiː ɛs/","extraExplanation":["“EITS”不是像“NASA”那样全球统一含义的缩写，通常必须看上下文（例如：公司内部邮件、政府文件、医疗/教育机构资料）。","如果你是想问考试“IELTS（雅思）”，那通常是拼写误差；IELTS 的正确缩写是 I-E-L-T-S。你可以告诉我这四个字母出现在哪一句话/哪份文件里，我可以帮你确定最可能的含义。"]}
{"word":"Eitzen","summary":{"en":"“Eitzen” is usually a surname, and it can also refer to a small city in Minnesota, USA.","zh":"“Eitzen”通常是一个姓氏，也可指美国明尼苏达州的一座小城市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Ms. Eitzen will lead the meeting today.","zh":"Eitzen 女士今天将主持会议。"},{"en":"I met Dr. Eitzen at the conference.","zh":"我在会议上认识了 Eitzen 医生。"}]},{"partOfSpeech":"other","definition":{"en":"a place name: Eitzen, a small city in Minnesota, USA.","zh":"地名：美国明尼苏达州的一个小城市 Eitzen。"},"examples":[{"en":"They drove through Eitzen on their way to La Crosse.","zh":"他们去拉克罗斯（La Crosse）的路上开车经过了 Eitzen。"},{"en":"Eitzen is in southeastern Minnesota near the Wisconsin border.","zh":"Eitzen 位于明尼苏达州东南部，靠近威斯康星州边界。"}]}],"synonyms":["(surname)","(place name)"],"phonetic":"/ˈaɪtsən/","extraExplanation":["“Eitzen”多见于北欧/德语背景的姓氏拼写（在美国中西部也较常见），发音通常为 /ˈaɪtsən/，重音在第一音节。","作为地名的 Eitzen（明尼苏达州）与当地早期移民社区有关；在英文语境里，地名与姓氏同形时常需靠上下文判断。"]}
