{"word":"ejacula","summary":{"en":"“Ejaculate” most commonly means to release semen (medical/neutral). It can also mean to blurt out words (formal/literary).","zh":"“Ejaculate”最常见的意思是（医学/中性）射精；也可指（较正式/文学）突然脱口而出。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to release semen from the penis, especially during orgasm (medical/neutral use).","zh":"（医学/中性用法）射精；（尤指在性高潮时）从阴茎排出精液。"},"examples":[{"en":"The doctor asked whether he was able to ejaculate normally.","zh":"医生询问他是否能够正常射精。"},{"en":"Some medicines can make it difficult to ejaculate.","zh":"有些药物会让人射精困难。"}]},{"partOfSpeech":"v.","definition":{"en":"to suddenly say or shout something; to blurt out (formal or literary).","zh":"（较正式或文学）突然脱口而出；喊出。"},"examples":[{"en":"He ejaculated an angry reply and left the room.","zh":"他愤怒地脱口而出一句回话，然后离开了房间。"},{"en":"\"Nonsense!\" she ejaculated.","zh":"“胡说！”她脱口而出。"}]}],"synonyms":["release (semen)","come (informal)","blurt out","burst out","exclaim"],"phonetic":"/ɪˈdʒæk.jə.leɪt/","extraExplanation":["“ejacula”本身不是常见的英语单词，通常是把 **ejaculate** 拼错或打到一半。","动词 **ejaculate** 在日常英语里多与性/医学语境相关；“脱口而出”的意思较少见，常出现在较老的文学作品或正式写作中。为避免尴尬，日常表达“脱口而出”更常用 **blurt out**、**burst out**、**snap** 等。"]}
{"word":"ejaculate","summary":{"en":"Ejaculate most commonly means to release semen; it can also (in older/literary English) mean to blurt out a sudden remark.","zh":"ejaculate 最常见意思是“射精/排出精液”；在较老或文学性英语中也可指“突然脱口而出一句话”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a person with a penis) to release semen, especially during sexual activity or orgasm.","zh":"（指有阴茎的人）射精；（尤指在性行为或高潮时）排出精液。"},"examples":[{"en":"He ejaculated during sex.","zh":"他在性行为中射精了。"},{"en":"Some medications can make it difficult to ejaculate.","zh":"有些药物会让人难以射精。"}]},{"partOfSpeech":"vt.","definition":{"en":"to say something suddenly and emotionally; to blurt out (often used in older or literary English).","zh":"突然激动地脱口而出；喊出（常见于较老或文学性英语）。"},"examples":[{"en":"“That’s not fair!” she ejaculated.","zh":"“这不公平！”她脱口而出。"},{"en":"He ejaculated a quick warning and ran.","zh":"他急忙喊了一句警告就跑开了。"}]},{"partOfSpeech":"n.","definition":{"en":"semen, or the act of releasing semen.","zh":"精液；或射精这一行为（较少用作名词）。"},"examples":[{"en":"The report mentioned ejaculate volume and sperm count.","zh":"报告提到了射精量和精子数量。"}]}],"synonyms":["come (informal)","finish (informal)","release semen","discharge","blurt out (speech sense)","exclaim"],"phonetic":"/ɪˈdʒæk.jə.leɪt/","extraExplanation":["这个词在日常英语里主要与性/医学语境相关，属于比较直白、正式偏医学的说法；一般聊天中人们更常用更委婉的表达（如“finish/come”），但在医疗、科普、法律文本中会用“ejaculate”。","文学用法里“ejaculate”表示“突然喊出/脱口而出”，现在较少见，读到时不要误会成性含义；通常从上下文（例如有引号的短句）就能判断。"]}
{"word":"ejaculated","summary":{"en":"“Ejaculated” usually means “released semen,” but in older/literary English it can also mean “blurted out suddenly.”","zh":"“ejaculated”通常指“射精”，但在较旧/文学用法中也可指“突然脱口而出”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person with a penis) released semen, usually during sexual activity.","zh":"（通常指有阴茎的人）射精；在性活动中释放精液。"},"examples":[{"en":"He ejaculated during sex.","zh":"他在性行为中射精了。"},{"en":"Some medications can affect how easily a person ejaculates.","zh":"一些药物会影响一个人射精的难易程度。"}]},{"partOfSpeech":"v.","definition":{"en":"(literary/older use) said something suddenly and briefly; blurted out.","zh":"（文学/较旧用法）突然脱口而出；急促地说出。"},"examples":[{"en":"“No!” she ejaculated, before she could stop herself.","zh":"“不！”她脱口而出，还没来得及克制自己。"},{"en":"He ejaculated a quick apology and left the room.","zh":"他急匆匆地说了句道歉就离开了房间。"}]}],"synonyms":["came","released semen","blurted out","exclaimed","interjected"],"phonetic":"/ɪˈdʒækjəˌleɪtɪd/","extraExplanation":["“ejaculate”在日常英文里更常见的是医学/性语境的“射精”。如果你在小说里看到“he ejaculated”，很多时候并不是性含义，而是较旧的写法，表示“突然插话/脱口而出”。","由于这个词在现代语境里很容易让人联想到性含义，非必要时更推荐用更中性的表达：blurted out（脱口而出）、exclaimed（惊呼）、interjected（插话）、said abruptly（突然说道）。"]}
{"word":"ejaculates","summary":{"en":"“Ejaculates” can mean (1) releases of semen (verb/noun) or (2) sudden spoken outbursts (literary verb).","zh":"“ejaculates”可指（1）射精/射出的精液（动词或名词），也可指（2）突然脱口而出（较文学化的动词用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to suddenly release semen from the penis (often during sexual activity); to have an orgasm (male).","zh":"（通常在性活动中）射出精液；（男性）达到性高潮、射精。"},"examples":[{"en":"He ejaculated during sex.","zh":"他在性行为中射精了。"},{"en":"Some medications can make it harder to ejaculate.","zh":"有些药物会让射精变得更困难。"}]},{"partOfSpeech":"v.","definition":{"en":"to say or shout something suddenly and strongly (often used in writing).","zh":"（常用于文学/叙述）突然脱口而出、喊出（某句话）。"},"examples":[{"en":"“No!” she ejaculated, startled by the noise.","zh":"“不！”她被噪声吓到，突然喊道。"},{"en":"He ejaculated a quick apology and left the room.","zh":"他匆匆脱口说了句道歉就离开了房间。"}]},{"partOfSpeech":"n.","definition":{"en":"semen that is released during ejaculation (plural: ejaculates can also mean separate releases/samples).","zh":"射出的精液；（复数）多次射出的量/样本。"},"examples":[{"en":"The lab analyzed the ejaculates for sperm count.","zh":"实验室对这些精液样本进行了精子数量分析。"},{"en":"Several ejaculates were collected for testing.","zh":"为检测收集了多份射精样本。"}]}],"synonyms":["orgasm (context-dependent)","emit","expel","blurt out","exclaim","shout"],"phonetic":"/ɪˈdʒæk.jə.leɪt/","extraExplanation":["“ejaculate/ejaculates”在日常对话中通常属于较直白、偏医学或生理学的用词；在公共场合可能显得露骨。更委婉的说法会根据语境使用（例如在医学语境说“ejaculate”，在更含蓄的语境可能会改用更间接的表达）。","动词“ejaculate”表示“突然喊出”的用法多见于较老的文学作品或叙事文本，现代口语里不常用；日常更常用“blurt out / shout / exclaim”。"]}
{"word":"ejaculating","summary":{"en":"“Ejaculating” means releasing semen, or more generally emitting something suddenly and forcefully.","zh":"“ejaculating”指射精；广义上也可指突然用力喷出某物或脱口而出。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “ejaculate”) releasing semen from the penis, usually at sexual climax.","zh":"（“ejaculate”的现在分词）射精：通常在性高潮时从阴茎排出精液。"},"examples":[{"en":"He said he was ejaculating sooner than he wanted to and asked a doctor for advice.","zh":"他说自己射精比预期更快，并向医生寻求建议。"},{"en":"Some medications can affect arousal and ejaculating.","zh":"一些药物可能影响性唤起和射精。"}]},{"partOfSpeech":"v.","definition":{"en":"(more general) sending out liquid, air, or words suddenly and forcefully.","zh":"（更广义）突然用力喷出液体/气体，或突然脱口而出（话语）。"},"examples":[{"en":"The whale was ejaculating a spray of water into the air.","zh":"那头鲸把水喷向空中。"},{"en":"In the middle of the meeting, he kept ejaculating short comments.","zh":"会议进行到一半时，他不断突然插入简短的评论。"}]}],"synonyms":["climax (informal)","come (informal)","emit","expel","spurt"],"phonetic":"/ɪˈdʒæk.jəˌleɪ.tɪŋ/","extraExplanation":["“ejaculate / ejaculating”在日常英语里最常指“射精”，属于比较私密、可能让人尴尬的词。学术/医疗语境（医生问诊、健康科普）中使用是中性的；在随意场合提及，可能需要更委婉的表达。","表示“更委婉”时可用：“to climax”（达到高潮）、“to come”（口语，较随意）、或更医学化的“to have an orgasm”（达到性高潮；不一定指射精）。"]}
{"word":"ejaculation","summary":{"en":"Ejaculation most commonly means the release of semen; in older/literary use, it can mean a sudden exclamation.","zh":"ejaculation 最常指“射精”；在较旧/文学用法中也可指“突然的惊呼/脱口而出的话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the release of semen from the penis, usually during sexual climax (also used in medical contexts)","zh":"（通常指男性在性高潮时）射精；（医学语境）精液的排出"},"examples":[{"en":"In sex education, teachers may explain that ejaculation is a normal part of male puberty.","zh":"在性教育中，老师可能会解释射精是男性青春期的正常现象。"},{"en":"Some medications can affect ejaculation, so it’s best to ask a doctor if you’re concerned.","zh":"有些药物会影响射精，如果你担心，最好咨询医生。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary, less common) a sudden spoken remark or exclamation","zh":"（文学用法，较少见）突然脱口而出的言语；惊呼"},"examples":[{"en":"The narrator interrupts the story with an occasional ejaculation of surprise.","zh":"叙述者偶尔会插入一两句惊讶的脱口之语。"},{"en":"In older writing, an ejaculation might be a short cry like “Oh!” or “Good heavens!”","zh":"在较早的作品中，ejaculation 可能指像“哦！”或“天哪！”这样简短的惊呼。"}]}],"synonyms":["emission","climax (context-dependent)","exclamation (literary sense)"],"phonetic":"/ɪˌdʒækjəˈleɪʃən/","extraExplanation":["这个词在现代英语里最常见的是性与医学含义，属于较敏感、较正式的用词。日常口语中谈到性话题时，人们有时会用更委婉的表达（如“finish/come”），但在医学、健康咨询、性教育等场合用 ejaculation 更准确也更合适。","文学义“突然的惊呼”现在比较少见，读到时可根据上下文判断并避免误解。"]}
{"word":"ejaculation-related","summary":{"en":"“Ejaculation-related” means connected with or involving ejaculation, usually in medical or sexual-health contexts.","zh":"“Ejaculation-related”指“与射精有关的/涉及射精的”，多用于医学或性健康语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or involving ejaculation (the release of semen), especially in a medical, scientific, or sexual-health context.","zh":"与射精（精液排出）有关的；涉及射精的（多用于医学、科研或性健康语境）。"},"examples":[{"en":"The doctor asked about any ejaculation-related pain or discomfort.","zh":"医生询问是否有与射精有关的疼痛或不适。"},{"en":"Researchers measured ejaculation-related hormones in a controlled study.","zh":"研究人员在受控实验中测量了与射精有关的激素水平。"},{"en":"Some medications can cause ejaculation-related side effects.","zh":"某些药物可能引起与射精有关的副作用。"}]}],"synonyms":["ejaculatory","related to ejaculation","ejaculation-associated","ejaculation-linked"],"phonetic":"/ɪˌdʒæk.jəˈleɪ.ʃən rɪˈleɪ.tɪd/","extraExplanation":["这是一个由名词“ejaculation（射精）+ related（相关的）”构成的复合形容词，常用连字符（ejaculation-related）来修饰后面的名词，如“ejaculation-related symptoms（与射精有关的症状）”。","在正式写作或医疗沟通中，这类表达较中性、客观；日常口语里人们可能会用更委婉的说法（例如“sexual side effects 性方面副作用”），具体取决于场合与受众。"]}
{"word":"ejaculations","summary":{"en":"“Ejaculations” can mean (1) sudden emotional exclamations in speech/writing, or (2) multiple events of ejaculation (a medical/sexual meaning).","zh":"“ejaculations”既可指（1）言语/写作中突然脱口而出的感叹语，也可指（2）多次射精（医学/性相关含义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sudden short spoken remarks, especially emotional exclamations (often in storytelling or writing).","zh":"（尤指在叙述或写作中）突然脱口而出的短句/感叹语，带有情绪色彩。"},"examples":[{"en":"His diary is full of little ejaculations like “What a day!” and “Never again!”","zh":"他的日记里满是“真是一天！”“再也不！”这类脱口而出的感叹。"},{"en":"The novel includes frequent ejaculations from the narrator, which makes the voice feel lively.","zh":"这部小说里叙述者常常插入感叹语，让叙事声音更有活力。"}]},{"partOfSpeech":"n.","definition":{"en":"The release of semen from the penis; the plural refers to multiple events of this happening.","zh":"射精；复数表示多次射精事件。"},"examples":[{"en":"Some medications may affect erections and ejaculations.","zh":"一些药物可能会影响勃起和射精。"},{"en":"If painful ejaculations continue, it’s a good idea to talk to a doctor.","zh":"如果射精疼痛持续，建议咨询医生。"}]}],"synonyms":["exclamations","interjections","outbursts","cries","emissions"],"phonetic":"/ɪˌdʒæk.jəˈleɪ.ʃənz/","extraExplanation":["“ejaculations”在日常英语里常让人首先联想到生理含义，因此在普通对话中用来表示“感叹语/脱口而出的话”会显得偏书面或带一点古典/文学风格。写作中若想避免歧义，可以用更常见的词，如 exclamations（感叹）或 interjections（插入语）。"]}
{"word":"ejaculative","summary":{"en":"Ejaculative means “suddenly exclaimed,” mainly in older/literary English.","zh":"ejaculative 指“突然感叹的”，主要见于较旧或文学性的英语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary, usually old-fashioned) Spoken suddenly as a short exclamation; exclamatory.","zh":"（文学用语，多为旧式）突然脱口而出的短促感叹；感叹式的。"},"examples":[{"en":"In the novel, the narrator adds an ejaculative “Ah!” when the truth is revealed.","zh":"在小说里，叙述者在真相揭晓时插入一个突然的感叹“啊！”。"},{"en":"The dialogue is full of ejaculative phrases like “Oh!” and “Good heavens!”","zh":"对话里充满了“哦！”“天哪！”之类的感叹短句。"}]}],"synonyms":["exclamatory","interjected","spontaneous","abrupt"],"phonetic":"/ɪˈdʒækjələtɪv/","extraExplanation":["“ejaculative”来自较旧的用法：名词“ejaculation”除了现代常见的生理含义外，在古典/文学语境中也指“突然的感叹、插话”。因此在阅读旧文学或评论对话风格时可能会遇到。","在现代日常英语里，这个词很少用；如果你只是想表达“感叹的/突然喊出的”，更常见、更中性的说法是“exclamatory”或“interjected”。由于词根容易让人联想到生理含义，写作或正式场合通常会避免使用以免引起误解。"]}
{"word":"ejaculator","summary":{"en":"An “ejaculator” is usually someone who ejaculates semen; rarely, it can mean someone who blurts out exclamations (old-fashioned).","zh":"“ejaculator”通常指射精者；少见情况下也可指（旧用）脱口而出惊叹或插话的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who ejaculates semen (often used in medical, biological, or explicit contexts).","zh":"射精者；发生射精的人（多用于医学、生物学或露骨语境）。"},"examples":[{"en":"In clinical notes, the doctor wrote that the patient was a premature ejaculator.","zh":"在临床记录中，医生写到该患者为早泄射精者。"},{"en":"The study compared hormone levels in frequent ejaculators and non-ejaculators.","zh":"该研究比较了频繁射精者与不射精者的激素水平。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) A person who suddenly blurts out words or exclamations.","zh":"（罕见/旧用）脱口而出（惊叹或插话）的人。"},"examples":[{"en":"He was an eager ejaculator of comments during meetings.","zh":"他在会议上总是急于插话、脱口而出各种评论。"},{"en":"In older writing, an “ejaculator” could mean someone who frequently exclaimed.","zh":"在较早的作品里，“ejaculator”有时指经常惊呼或插话的人。"}]}],"synonyms":["one who ejaculates","premature ejaculator","blurt-er","exclaimer"],"phonetic":"/ɪˈdʒækjəˌleɪtər/","extraExplanation":["“ejaculator”在现代英语里最常见的含义与性/生理相关，日常交流中可能显得粗俗或引人不适；更中性、医学化的表达常用“a man who ejaculates”或在特定病症语境下用“premature ejaculator”。","第二个含义来自名词“ejaculation”（本义为“突然的喊话/插入语”），但这种用法现在较少见，主要出现在较老的文学或书面语中。"]}
{"word":"ejaculators","summary":{"en":"“Ejaculators” means people (or sometimes animals) that ejaculate; it’s mainly used in medical/explicit contexts.","zh":"“ejaculators”指射精者（有时也指动物学意义上的射精动物），主要见于医学或露骨语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who ejaculates (releases semen), typically used in medical, biological, or explicit contexts.","zh":"射精者；会射精的人（多用于医学、生物学或露骨语境）。"},"examples":[{"en":"In reproductive health studies, researchers may recruit adult male ejaculators as participants.","zh":"在生殖健康研究中，研究人员可能会招募成年男性射精者作为参与者。"},{"en":"The clinic provided guidance for ejaculators about safe sample collection.","zh":"诊所为射精者提供了关于安全采样的指导。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/Zoology) An organism or animal that ejects reproductive fluid during mating.","zh":"（生物/动物学）交配时排出（喷出）生殖液的动物或生物。"},"examples":[{"en":"Some fish are external fertilization ejaculators, releasing sperm into the water.","zh":"有些鱼类属于体外受精的“射精者”，会把精子释放到水中。"}]}],"synonyms":["people who ejaculate","men who ejaculate","emitters (biological context)"],"phonetic":"/ɪˈdʒæk.jəˌleɪ.tɚz/","extraExplanation":["“ejaculators”是“ejaculator”的复数，来自动词“ejaculate”（射精/喷出）。日常英语里更常说“people/men who ejaculate”，而“ejaculator(s)”听起来更像医学或成人内容的用语，使用时要注意场合与礼貌。","如果你是在查词时遇到它，常见于医学文本（如精液采集、射精功能）或性健康讨论；在普通聊天中可能显得过于直白。"]}
{"word":"ejaculatory","summary":{"en":"Ejaculatory means “related to ejaculation,” usually in medical/sexual-health contexts; rarely, it can mean “suddenly blurted out.”","zh":"ejaculatory意为“与射精有关的”，多用于医学/性健康语境；少见时也可指“突然脱口而出的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to ejaculation (the release of semen), especially describing organs, reflexes, or functions involved in that process.","zh":"与射精（精液排出）有关的，常用于描述参与射精过程的器官、反射或功能。"},"examples":[{"en":"The doctor asked about ejaculatory function during the checkup.","zh":"医生在检查时询问了射精功能。"},{"en":"Some medications can affect ejaculatory reflexes.","zh":"一些药物可能会影响射精反射。"}]},{"partOfSpeech":"adj.","definition":{"en":"(By extension) Expressing something suddenly and forcefully; blurted out (a rare, older literary use).","zh":"（引申）突然、强烈地表达出来的；脱口而出的（较少见、偏文学/旧用法）。"},"examples":[{"en":"He made an ejaculatory remark in the middle of the meeting.","zh":"他在会议中途突然插了一句。"}]}],"synonyms":["ejaculation-related","seminal (medical)","emissive (rare)"],"phonetic":"/ɪˈdʒækjəˌleɪtəri/","extraExplanation":["这个词在现代英语里主要用于医学或性健康语境（如“ejaculatory dysfunction”射精功能障碍、“ejaculatory duct”射精管），语气偏正式、专业；在日常对话中更常说“ejaculation-related”或直接说“problems with ejaculation”。","较少见的“突然脱口而出”含义来自动词“ejaculate”的旧用法，常见于文学描写或较正式的书面语；现代口语通常用“blurted”或“spur-of-the-moment”来表达。"]}
{"word":"ejaculum","summary":{"en":"A rare technical word meaning semen or an ejaculate.","zh":"一个较少见的技术用语，意思是精液或一次射出的精液（射出物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, technical) Semen (the fluid released during ejaculation); an ejaculate.","zh":"（罕见，技术用语）精液；射出的精液（一次射精的产物）。"},"examples":[{"en":"In older medical texts, the term “ejaculum” may be used to mean semen or an ejaculate.","zh":"在较早的医学文献中，“ejaculum”有时用来表示精液或一次射出的精液。"},{"en":"The lab report noted the presence of sperm in the ejaculum.","zh":"化验报告记录该射出物（精液）中存在精子。"}]}],"synonyms":["semen","ejaculate","seminal fluid"],"phonetic":"/ɪˈdʒækjələm/","extraExplanation":["“ejaculum”源自拉丁语，属于较少见、偏学术/医学的用词；现代英语更常用“semen”或“ejaculate”。","该词涉及性与生殖相关内容，在日常交流中可能显得过于直白或不合场合；正式场合通常使用医学术语“semen（精液）”。"]}
{"word":"Ejagham","summary":{"en":"Ejagham refers to an ethnic group in Cameroon and Nigeria, their language, and anything related to their culture.","zh":"Ejagham 指喀麦隆与尼日利亚的一支族群、他们所说的语言，以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (an ethnic group) living mainly in southwestern Cameroon and southeastern Nigeria.","zh":"埃贾甘人（一个族群），主要居住在喀麦隆西南部和尼日利亚东南部。"},"examples":[{"en":"The Ejagham live on both sides of the Cameroon–Nigeria border.","zh":"埃贾甘人分布在喀麦隆—尼日利亚边境两侧。"},{"en":"Some local festivals highlight Ejagham traditions of dance and storytelling.","zh":"一些地方节庆会展示埃贾甘的舞蹈与讲故事传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Niger–Congo language spoken by the Ejagham people.","zh":"埃贾甘语（尼日尔—刚果语系语言），由埃贾甘人使用。"},"examples":[{"en":"She is learning Ejagham to speak with her grandparents.","zh":"她在学习埃贾甘语，好和祖父母交流。"},{"en":"The interview included short passages in Ejagham and English.","zh":"采访中包含了埃贾甘语和英语的简短片段。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ejagham people or their language and culture.","zh":"与埃贾甘人或其语言、文化有关的。"},"examples":[{"en":"He studies Ejagham oral literature and proverbs.","zh":"他研究埃贾甘的口头文学与谚语。"},{"en":"The museum has an Ejagham exhibit featuring tools and textiles.","zh":"博物馆有一个埃贾甘主题展，展示工具和纺织品。"}]}],"synonyms":["Ekoi (older term)","Ejagham language"],"phonetic":"/ˈɛdʒəɡæm/","extraExplanation":["“Ejagham”也常见拼写为“Ejagham / Ejaham / Ejagham (Ekoi)”。“Ekoi”在一些旧资料中用来指这一族群或相关语言，但在当代语境里“Ejagham”更常用、更贴近自称与学术用法。","作为族群名称与语言名称时都可用“Ejagham”。在英文里通常首字母大写：the Ejagham（族群），Ejagham (language)（语言）。"]}
{"word":"Ejam","summary":{"en":"“Exam” means a test, especially in school; it can also mean to formally test someone (though “examine” is more common as a verb).","zh":"“exam” 指考试/测验；也可作动词表示正式考核，但动词更常用 “examine”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a test that checks your knowledge or skill, often in school or for a qualification","zh":"考试；测验（常用于学校或资格评定）"},"examples":[{"en":"I have a math exam tomorrow.","zh":"我明天有一场数学考试。"},{"en":"She studied all weekend for the final exam.","zh":"她为了期末考试整个周末都在复习。"},{"en":"You need to pass the exam to get the certificate.","zh":"你需要通过考试才能拿到证书。"}]},{"partOfSpeech":"v.","definition":{"en":"to test someone’s knowledge or skill by asking questions or giving tasks (often formally)","zh":"（正式）考试；测验；考核（某人的知识或技能）"},"examples":[{"en":"The teacher will exam the students on chapter 5.","zh":"老师将就第五章内容考学生。"},{"en":"We were examed orally at the end of the course.","zh":"课程结束时我们进行了口试。"}]}],"synonyms":["test","examination","quiz"],"phonetic":"/ɪɡˈzæm/","extraExplanation":["“Ejam” 不是常见英文单词；你可能想写的是 “exam”（examination 的缩写）。","更常用的动词形式是 “examine”（检查/考查）；在日常英语里很少说 “to exam someone”，更自然的是 “to examine someone” 或 “to test someone”。","相关常见搭配：take an exam（参加考试）、pass/fail an exam（通过/不通过）、final exam（期末考）、midterm exam（期中考）。"]}
{"word":"ejam","summary":{"en":"“Ejam” is likely a misspelling of “exam,” meaning a test (most common) or an inspection/check.","zh":"“ejam”很可能是“exam”的拼写错误；“exam”最常指“考试”，也可指“检查/审查”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A test that checks your knowledge or skill, especially in school.","zh":"（尤指学校的）考试，用来检验你的知识或技能。"},"examples":[{"en":"I have a math exam tomorrow.","zh":"我明天有一场数学考试。"},{"en":"She studied hard for the final exam.","zh":"她为期末考试努力学习。"}]},{"partOfSpeech":"n.","definition":{"en":"A careful look at something to check its condition or details (often used in health or official situations).","zh":"检查；检验（常用于体检或官方检查等场景）。"},"examples":[{"en":"The doctor did a quick exam of his throat.","zh":"医生快速检查了他的喉咙。"},{"en":"The document is under close exam by the committee.","zh":"该文件正在接受委员会的仔细审查。"}]}],"synonyms":["test","quiz","examination","assessment","inspection","check"],"phonetic":"/ɪɡˈzæm/","extraExplanation":["“ejam”在英语里不是常见单词；很多学习者是想输入“exam”（考试）。","“exam”是“examination”的常用缩写，口语和书面语都很常见：final exam（期末考）、midterm exam（期中考）。"]}
{"word":"EJASA","summary":{"en":"EJASA is likely an acronym; its meaning depends on context.","zh":"EJASA 很可能是首字母缩写，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"EJASA is not a standard English word. It is most likely an acronym/initialism (a set of letters that stands for an organization, program, title, or name). The exact meaning depends on the context where you saw it.","zh":"EJASA 不是常见的英文单词，更可能是一个首字母缩写（用于代表某个机构、项目、标题或名称）。它的具体含义需要根据出现的语境来判断。"},"examples":[{"en":"I saw “EJASA” on the form, but it wasn’t explained anywhere.","zh":"我在表格上看到“EJASA”，但哪里都没有解释它的意思。"},{"en":"Can you tell me what EJASA stands for in this document?","zh":"你能告诉我在这份文件里 EJASA 代表什么吗？"}]}],"phonetic":"/ˌiː dʒeɪ ˌeɪ ɛs ˈeɪ/","extraExplanation":["这类全大写字母通常按字母逐个读（例如“E-J-A-S-A”）。如果你把它出现的句子、领域（例如学校、公司、政府文件、医学、工程等）或图片发我，我可以更准确地帮你推断它的全称与含义。"]}
{"word":"eject","summary":{"en":"Eject means to force something or someone out, often suddenly (like a card, disc, or a pilot from a jet).","zh":"Eject 指“把……强行推出/弹出”，常带有突然、机械或紧急弹出的感觉（如弹出卡片/光盘、飞行员弹射逃生）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to force something or someone out of a place, container, or vehicle","zh":"把某物或某人强行推出/弹出（从某处、容器或交通工具中）"},"examples":[{"en":"The machine automatically ejected the card after the payment went through.","zh":"付款完成后，机器自动把卡弹了出来。"},{"en":"The pilot ejected from the jet just before it crashed.","zh":"飞机坠毁前，飞行员从战机里弹射逃生。"}]},{"partOfSpeech":"vt.","definition":{"en":"to forcefully send out or throw out (a substance), such as liquid, gas, or smoke","zh":"（使液体、气体、烟等）喷出/排出"},"examples":[{"en":"The volcano ejected ash high into the sky.","zh":"火山把火山灰喷向高空。"},{"en":"When shaken, the bottle can eject foam.","zh":"瓶子摇晃后可能会喷出泡沫。"}]}],"synonyms":["expel","remove","throw out","cast out"],"phonetic":"/ɪˈdʒɛkt/","extraExplanation":["“eject”常见于科技与交通语境：如“eject button（弹出/弹射按钮）”“eject the disc（弹出光盘）”。在军事航空里，“eject”特指飞行员通过弹射座椅逃生（eject from/ out of an aircraft）。","词源来自拉丁语 eicere（e- “向外” + iacere “投掷”），所以核心画面是“往外扔/推出”。"]}
{"word":"eject sb. from sth.","summary":{"en":"force someone out of a place or out of a vehicle.","zh":"强行把某人赶出某处，或把某人从车内/座位上甩出。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To force someone to leave a place, group, or position (often because of rules, punishment, or strong disagreement).","zh":"把某人从某处/某组织/某职位中强行赶走；开除；驱逐（常因违规或惩罚）。"},"examples":[{"en":"He was ejected from the club for fighting.","zh":"他因打架被俱乐部赶了出去。"},{"en":"The student was ejected from school after repeated cheating.","zh":"那名学生因多次作弊被学校开除。"},{"en":"The referee ejected the player from the game for a dangerous tackle.","zh":"裁判因一次危险铲球把那名球员罚出比赛。"}]},{"partOfSpeech":"phrase","definition":{"en":"To suddenly push or throw someone out of a vehicle or seat, especially in an accident or during a sudden stop.","zh":"（尤指事故或急停时）把某人从车内/座位上甩出或弹出。"},"examples":[{"en":"He wasn’t wearing a seat belt and was ejected from the car during the crash.","zh":"他没系安全带，撞车时被甩出了车外。"},{"en":"Loose passengers can be ejected from their seats in severe turbulence.","zh":"严重颠簸时，未固定好的乘客可能会从座位上被甩起。"}]}],"synonyms":["expel","oust","remove","banish","evict","throw out","kick out"],"phonetic":"/iˈdʒɛkt/","extraExplanation":["常见搭配：eject sb. from + place/group（把某人从……驱逐/开除）。","语气偏正式，也常用于体育（裁判把球员罚下/驱逐出场）和法律/规章场景（被组织开除）。","对比：expel 更常用于学校/组织“开除”；evict 多用于“房东依法把租客赶出房子”。"],"etymology":"源自拉丁语 eicere（e- “向外” + iacere “投掷”），本义是“扔出去”，后来引申为“驱逐、开除”。","mnemonic":["e- 表示“向外”，-ject 像“ject/jet 发射”：把人“发射出去”= 赶出去/驱逐。","联想“project（投射）”同根 -ject：e-ject = 往外投。"]}
{"word":"ejecta","summary":{"en":"Ejecta means material thrown out, especially by a volcanic eruption or a violent impact/explosion.","zh":"Ejecta 指被抛射出来的物质，尤指火山喷发或撞击/爆炸等剧烈事件产生的抛射物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Material (rock, ash, dust, etc.) that is thrown out, especially from a volcano during an eruption.","zh":"（尤指火山喷发时）被抛射出来的物质；喷出物（如岩石、火山灰、尘埃等）。"},"examples":[{"en":"After the eruption, scientists measured the thickness of the ejecta around the volcano.","zh":"喷发后，科学家测量了火山周围喷出物的厚度。"},{"en":"Fine ejecta can travel far and affect air quality in nearby towns.","zh":"细小的喷出物可能飘得很远，影响附近城镇的空气质量。"}]},{"partOfSpeech":"n.","definition":{"en":"Material thrown out by an impact, explosion, or other violent event (for example, from a meteor strike).","zh":"（由撞击、爆炸等剧烈事件）抛出的物质（如陨石撞击产生的抛射物）。"},"examples":[{"en":"The crater’s ejecta formed a bright ring visible from above.","zh":"陨石坑的抛射物形成了一圈明亮的环，从上方清晰可见。"},{"en":"Researchers studied ejecta patterns to estimate the impact’s angle and force.","zh":"研究人员通过抛射物的分布来推测撞击的角度和力度。"}]}],"synonyms":["volcanic debris","ash","tephra","debris"],"phonetic":"/iˈdʒɛktə/","extraExplanation":["“Ejecta”是拉丁语来源的学术用词，常见于地质学、火山学、行星科学等语境。它在形式上是一个复数概念（被“抛出”的东西），但现代英文里常把它当作不可数名词使用：the ejecta was… / the ejecta were… 两种都能见到。","常见搭配：volcanic ejecta（火山喷出物）、impact ejecta（撞击抛射物）、ejecta blanket（抛射物覆盖层/喷出物毯）、ejecta plume（喷出羽流）。"]}
{"word":"ejectable","summary":{"en":"“Ejectable” means “able to be ejected”—pushed or thrown out by a mechanism (devices) or able to escape via an ejection seat (aircraft).","zh":"“ejectable”指“可被弹出/射出”的，常用于设备中的弹出结构，或航空中“可弹射逃生”的座椅/系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be forced or thrown out, removed, or released (often by a mechanism).","zh":"可被弹出、推出、射出的；可被移除或释放的（常指通过装置/机构）。"},"examples":[{"en":"The laptop has an ejectable DVD drive.","zh":"这台笔记本有一个可弹出的DVD驱动器。"},{"en":"The capsule is stored in an ejectable container for safety.","zh":"为安全起见，这个胶囊被存放在可弹出的容器里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to escape from an aircraft by using an ejection seat.","zh":"（飞机上）可弹射逃生的（指使用弹射座椅）。"},"examples":[{"en":"The jet has an ejectable seat for the pilot.","zh":"这架喷气式飞机为飞行员配备了可弹射座椅。"},{"en":"They checked the ejectable system before takeoff.","zh":"起飞前他们检查了弹射系统。"}]}],"synonyms":["removable","ejecting (context-dependent)","releasable","expellable"],"phonetic":"/ɪˈdʒɛk.tə.bəl/","extraExplanation":["“ejectable”来自动词“eject”（弹出、喷出、驱逐）+ 形容词后缀“-able”（能够……的）。在日常科技语境里常见于“ejectable tray / drive”（可弹出的托盘/驱动器）；在军事/航空语境里常见于“ejectable seat / ejection seat”（可弹射座椅/弹射座椅）。","易混词：ejectable（可被弹出） vs. removable（可移除，通常更中性，不强调“弹出/射出”的动作或机械结构）。"]}
{"word":"ejectamenta","summary":{"en":"A rare, formal medical word (usually plural) meaning bodily excretions or material expelled from the body.","zh":"一个很少见的医学正式词（多用复数），指身体排出的排泄物或分泌物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"bodily waste or matter expelled from the body (such as feces, urine, or other discharges); excretions (a formal/medical term, usually plural).","zh":"（医学/正式用语）从身体排出的废物或分泌物；排泄物（常用复数）。"},"examples":[{"en":"In older medical texts, “ejectamenta” refers to the patient’s excretions collected for examination.","zh":"在较早的医学文献中，ejectamenta 指为检查而收集的病人排泄物。"},{"en":"The lab analyzed the ejectamenta to look for signs of infection.","zh":"实验室分析这些排泄物以寻找感染迹象。"}]}],"synonyms":["excreta","excretions","bodily waste","discharge (medical)"],"phonetic":"ɪˌdʒɛktəˈmɛntə","extraExplanation":["这是一个源自拉丁语的借词，常以复数形式出现（-a 结尾常表示拉丁语中性名词复数）。在现代英语里它非常罕见，多见于旧医学文献或非常正式的医学语境。日常英语更常说 excreta / feces / urine / bodily fluids 等。"]}
{"word":"ejected","summary":{"en":"“Ejected” means forced out or removed; it’s the past form of “eject,” and it can also describe someone/something that has been expelled.","zh":"“ejected”表示“被强行赶出/驱逐/移出”，是动词 eject 的过去式/过去分词，也可作形容词表示“被驱逐的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of eject) Forced someone or something out of a place, position, or vehicle.","zh":"（eject 的过去式/过去分词）把某人或某物强行赶出、驱逐出（某处/职位/车辆等）。"},"examples":[{"en":"The referee ejected the player for arguing too much.","zh":"裁判因为那名球员争辩过多而把他罚出场。"},{"en":"The tenants were ejected from the apartment after months of unpaid rent.","zh":"房客拖欠房租数月后被赶出公寓。"},{"en":"The pilot ejected from the plane when the engine failed.","zh":"发动机故障时，飞行员从飞机上弹射逃生。"}]},{"partOfSpeech":"adj.","definition":{"en":"Removed or expelled (often used as an adjective in news or descriptions).","zh":"被移出、被驱逐的（常作形容词用于新闻或描述）。"},"examples":[{"en":"The ejected student apologized and asked to return to class.","zh":"被赶出教室的学生道歉并请求回到课堂。"},{"en":"Security escorted the ejected guest out of the building.","zh":"保安护送那位被赶出的客人离开大楼。"}]}],"synonyms":["expelled","removed","thrown out","kicked out","ousted"],"phonetic":"/ɪˈdʒɛktɪd/","extraExplanation":["“eject”语气通常比较强，暗示“被迫离开”。在体育比赛里常指“罚下/罚出场”（eject a player）。在航空语境里，eject 指“弹射（座椅）逃生”。在电子设备里，按“弹出键”（eject button）可以把光盘/托盘弹出。"]}
{"word":"ejectee","summary":{"en":"“Ejectee” means a person who is ejected—thrown out or forced out—especially in accident or aviation/reporting contexts.","zh":"“Ejectee”指被弹出/被抛出或被逐出的人，常用于事故、航空与报告体语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is thrown or forced out of a vehicle, aircraft, seat, or place (often by ejection or expulsion)","zh":"被弹出者；被抛出/被逐出的人（常指从交通工具、飞机弹射座椅或某个场所被弹出或被赶出）"},"examples":[{"en":"The crash investigators searched for the ejectee near the wreckage.","zh":"坠机调查人员在残骸附近寻找被弹出者。"},{"en":"In a rollover accident, an unbelted passenger may become an ejectee.","zh":"在车辆翻滚事故中，未系安全带的乘客可能会被甩出车外，成为被抛出者。"}]}],"synonyms":["ejected person","occupant ejected","expelled person"],"phonetic":"/iˌdʒɛkˈtiː/","extraExplanation":["“ejectee”常见于交通安全、航空事故与法医/事故报告等较正式的语境，比日常说法更偏技术/报告体。日常口语里更常说：someone who was thrown out / someone who was ejected。","构词上来自动词 eject（弹出/驱逐）+ 名词后缀 -ee（表示动作的承受者，如 employee、refugee）。"]}
{"word":"ejecting","summary":{"en":"Ejecting means forcing something out or removing it, including safely removing a disk/device in computing; in aviation it can mean a pilot escaping by ejection seat.","zh":"Ejecting 指把东西弹出/排出或移出；在计算机里常指安全弹出磁盘/设备；在航空中也可指飞行员通过弹射座椅逃生。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to force something out (often suddenly), or to push someone out of a place or vehicle","zh":"把某物（常突然地）弹出/排出；把某人从某处或交通工具中推出/逐出"},"examples":[{"en":"The machine is ejecting the paper because it’s jammed.","zh":"机器因为卡纸正在把纸弹出来。"},{"en":"The pilot ejected from the plane after the engine failed.","zh":"引擎故障后，飞行员从飞机上弹射逃生。"},{"en":"The printer kept ejecting blank pages.","zh":"打印机不断吐出空白页。"}]},{"partOfSpeech":"v.","definition":{"en":"(computing/media) to safely remove a disk, drive, or device from a computer","zh":"（计算机/媒体）安全弹出磁盘、驱动器或设备"},"examples":[{"en":"Please eject the USB drive before unplugging it.","zh":"请先弹出U盘再拔掉。"},{"en":"I clicked “Eject” to remove the DVD.","zh":"我点了“弹出”来取出DVD。"}]}],"synonyms":["expelling","removing","discharging","forcing out","spitting out","popping out"],"phonetic":"/ɪˈdʒɛktɪŋ/","extraExplanation":["“ejecting”是动词“eject”的现在分词/动名词形式：\n- 现在进行时：The machine is ejecting…（正在弹出…）\n- 动名词作主语/宾语：Ejecting a USB drive properly prevents data loss.（正确弹出U盘能避免数据丢失。）\n在航空语境里，“eject”常特指“弹射座椅逃生”，属于固定搭配：eject from a plane / eject oneself."]}
{"word":"ejection","summary":{"en":"Ejection means being forced out—physically (like a seat or tray), socially (being expelled), or medically (blood pumped out of the heart).","zh":"ejection 指“被强行推出/弹出”，可用于物理弹出、被驱逐/罚出场，以及医学中的心脏射血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of forcing something out or being forced out (often from a machine, seat, or place).","zh":"（常指从机器、座椅或某处）被强行弹出/推出；弹出行为。"},"examples":[{"en":"The pilot survived the crash after a successful ejection from the aircraft.","zh":"飞行员成功从飞机弹射后在坠机中幸存。"},{"en":"A safety interlock prevents the ejection of the tray while the machine is running.","zh":"安全联锁装置可防止机器运转时托盘弹出。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of expelling someone from a group, place, or organization; removal.","zh":"驱逐；把某人从团体、场所或组织中赶走/开除。"},"examples":[{"en":"The athlete appealed the ejection from the game.","zh":"那名运动员对被判罚出场提出申诉。"},{"en":"The committee voted for her ejection from the club for repeated rule-breaking.","zh":"委员会投票决定因她屡次违规而将其开除出俱乐部。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine, the amount or process of blood being pumped out of the heart (as in “ejection fraction”).","zh":"（医学）射血；心脏将血液泵出的过程或数量（如“射血分数”）。"},"examples":[{"en":"The doctor measured his ejection fraction during the heart exam.","zh":"医生在心脏检查中测量了他的射血分数。"},{"en":"Reduced ejection can be a sign of heart failure.","zh":"射血减少可能是心力衰竭的迹象。"}]}],"synonyms":["expulsion","removal","discharge","eviction","throwing out"],"phonetic":"/iˈdʒɛkʃən/","extraExplanation":["词源：来自拉丁语 eicere（“扔出去、抛出”），由 ex-（向外）+ iacere（投掷）构成，因此核心意思是“向外抛出/排出”。","常见搭配：ejection seat（弹射座椅）、eject button（弹出按钮）、ejection from the game（被罚出场）、ejection fraction（射血分数）。注意与动词 eject（弹出/驱逐）区分：ejection 是名词，表示“动作/结果”。"]}
{"word":"ejections","summary":{"en":"“Ejections” means acts of forcing out (often from a vehicle/seat), removing someone from a group/role, or (in medicine) pushing fluid out such as blood from the heart.","zh":"“ejections”指（1）强行推出/抛出（常见于车辆或弹射座椅）；（2）罢免或逐出（组织/职位）；（3）医学上液体（如血液）射出/排出的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of forcing someone or something out of a place (like a vehicle, seat, or building), or the act of being forced out.","zh":"（把人或物）强行推出/抛出；被迫离开的行为。"},"examples":[{"en":"The pilot initiated the ejection, and the seat propelled him out of the aircraft.","zh":"飞行员启动弹射，座椅把他弹出了飞机。"},{"en":"After the crash, the ejection of the passengers was prevented by their seat belts.","zh":"碰撞后，安全带阻止了乘客被甩出车外。"}]},{"partOfSpeech":"n.","definition":{"en":"In politics or organizations, the act of removing a person from a position or group (often by vote or pressure).","zh":"（政治或组织中）罢免；把某人从职位或团体中赶走。"},"examples":[{"en":"The board debated the ejection of the committee chair.","zh":"董事会讨论是否罢免委员会主席。"},{"en":"Public anger led to several ejections from leadership roles.","zh":"公众愤怒导致多人被赶下领导岗位。"}]},{"partOfSpeech":"n.","definition":{"en":"In physiology (especially the heart), the process of pushing fluid out; for example, blood being pumped out of the heart.","zh":"（生理学，尤指心脏）射出/排出（液体）的过程，如把血液泵出心脏。"},"examples":[{"en":"Doctors measured the heart’s ejection fraction to assess how well it pumps blood.","zh":"医生测量心脏的射血分数来评估其泵血能力。"}]}],"synonyms":["expulsions","removals","evictions","throw-outs"],"phonetic":"/ɪˈdʒɛkʃənz/","extraExplanation":["“ejections”是名词复数，单数是“ejection”。最常见的搭配包括：ejection seat（弹射座椅）、ejection from a vehicle（从车内被甩出）、ejection fraction（射血分数，医学常用缩写EF）。","词根角度：eject = e-（向外）+ -ject（投、掷），同根词有 project（投射/项目）、reject（拒绝）、inject（注射）。"]}
{"word":"ejective","summary":{"en":"“Ejective” is a linguistics term for consonants produced with a glottalic burst (e.g., /kʼ/), and it can also mean the consonant itself.","zh":"“Ejective”是语言学术语，指用声门产生爆发气流的喷音辅音（如 /kʼ/），也可指这种辅音本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) made with a burst of air from the closed glottis (voice box), so the sound is produced by pushing air out without using the lungs in the usual way.","zh":"（语言学）“喷音的；内爆式送气的”：通过关闭声门并向外推气产生的辅音，不像普通发音那样主要依靠肺部气流。"},"examples":[{"en":"In some Caucasian languages, ejective consonants are very common.","zh":"在一些高加索地区的语言中，喷音辅音非常常见。"},{"en":"The word begins with an ejective /kʼ/ in that language.","zh":"在那种语言里，这个词以喷音 /kʼ/ 开头。"},{"en":"Learners often confuse ejective sounds with regular voiceless stops like /k/ and /t/.","zh":"学习者常把喷音和普通清塞音（如 /k/、/t/）混淆。"}]},{"partOfSpeech":"n.","definition":{"en":"an ejective consonant sound (such as /pʼ/, /tʼ/, /kʼ/).","zh":"喷音辅音（如 /pʼ/、/tʼ/、/kʼ/）。"},"examples":[{"en":"This language has three ejectives: /pʼ/, /tʼ/, and /kʼ/.","zh":"这门语言有三个喷音：/pʼ/、/tʼ/、/kʼ/。"},{"en":"The teacher asked us to identify the ejectives in the recording.","zh":"老师让我们在录音中找出喷音。"}]}],"synonyms":["glottalic egressive","ejective consonant"],"phonetic":"/ɪˈdʒɛktɪv/","extraExplanation":["在音标里，喷音常用一个“撇号”表示：/tʼ/、/kʼ/。这个符号提示发音时声门先关闭、喉部上提形成压力，然后突然释放，听起来常更“紧”“脆”。","喷音在英语里不是用来区分词义的（不是英语的音位），但在一些语言中会与普通 /t/、/k/ 等形成对立，因此对这些语言的学习者来说很重要。"]}
{"word":"ejectively","summary":{"en":"“Ejectively” means “in a forcefully outward/ejecting way,” and in linguistics it means “with ejective (glottalic) articulation.”","zh":"“ejectively”表示“以喷出/弹出的方式”，在语言学中指“以喷音（声门喷发气流）方式发音”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that ejects or throws something out; forcefully outward.","zh":"以喷出、排出或弹出的方式；向外用力地。"},"examples":[{"en":"The capsule was pushed and released ejectively from the container.","zh":"胶囊被推动后从容器里被弹射式地释放出来。"},{"en":"Steam escaped ejectively through the safety valve.","zh":"蒸汽通过安全阀以喷射的方式逸出。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Linguistics) In a way that produces an ejective sound—made with a burst of air from the glottis rather than the lungs.","zh":"（语言学）以“喷音”的方式发音——主要靠声门的爆发气流而不是肺部气流来产生。"},"examples":[{"en":"In some languages, /k/ can be pronounced ejectively as /kʼ/.","zh":"在一些语言中，/k/ 可以以喷音方式发成 /kʼ/。"},{"en":"The speaker articulated the consonant ejectively, making it sound sharp and popping.","zh":"说话者把这个辅音以喷音方式发出来，听起来很尖锐、像“啪”一声。"}]}],"synonyms":["forcefully","outward","explosively","with ejective articulation"],"phonetic":"/ɪˈdʒɛk.tɪv.li/","extraExplanation":["“ejectively”比较少见，更多出现在语言学、语音学材料里，用来描述“喷音（ejective consonants）”的发音方式。英语里本身几乎没有喷音，但在一些高加索语言、阿拉伯语方言、以及美洲原住民语言中更常见。","相关词：ejective（adj. 喷音的）、eject (v. 弹出/排出)、ejection (n. 弹射/排出)。语音学里常用符号“ʼ”表示喷音，如 kʼ、tʼ、pʼ。"]}
{"word":"ejectiveness","summary":{"en":"“Ejectiveness” is a rare noun meaning the quality of ejecting/being ejected, or (in linguistics) the property of making ejective consonant sounds.","zh":"“Ejectiveness”是少见名词，指“排出/喷出（或被排出/喷出）的特性”，或（语言学）“喷音辅音的发音特性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or tendency of being ejected or of ejecting something; “throwing out” in a forceful way (rare).","zh":"被弹出/被排出的特性；或把某物用力排出、喷出的倾向（较少见）。"},"examples":[{"en":"The valve’s ejectiveness increased when the pressure rose.","zh":"压力升高时，这个阀门的“排出性”（喷出倾向）增强了。"},{"en":"Engineers adjusted the design to reduce the ejectiveness of the exhaust flow.","zh":"工程师调整了设计，以降低排气气流的喷出性。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) the property of producing ejective consonants—sounds made with a burst of air driven by the closed glottis.","zh":"（语言学）“喷音性/喷塞音特性”：指产生喷音（ejective consonants）的发音特征，即通过关闭声门并向上顶起气流产生爆破。"},"examples":[{"en":"The study compared ejectiveness across different consonants in the language.","zh":"这项研究比较了该语言中不同辅音的喷音性。"},{"en":"Learners often notice ejectiveness as a sharp, popping release.","zh":"学习者常把喷音性感受为一种干脆、像“啪”一样的释放。"}]}],"synonyms":["ejection","expulsion","propulsion","ejective quality"],"phonetic":"ɪˈdʒɛktɪvnəs","extraExplanation":["“Ejectiveness”在日常英语中非常少见，更常见的表达是：the tendency to eject / the force of ejection / ejective quality 等。","语言学里更常用的相关词是 ejective（喷音的，形容词）和 ejection（排出/喷出，名词）。如果你是在读语音学资料，作者用 ejectiveness 往往是在强调“喷音这一发音属性”本身。"]}
{"word":"ejectives","summary":{"en":"Ejectives are consonant sounds produced with a sharp burst of air created in the mouth/throat, not pushed out by the lungs.","zh":"喷音是一类通过口腔/喉部加压后突然释放形成爆破的辅音，不依赖肺部呼气推动气流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Speech sounds (consonants) made by building up air pressure in the mouth or throat and then releasing it with a sharp burst, without using the lungs to push air out.","zh":"喷音（语言学术语）：一种辅音发音方式。通过在口腔或喉部先积聚气压，再突然释放形成爆破声；不像普通辅音那样依靠肺部呼气推动气流。"},"examples":[{"en":"Some languages in the Caucasus region use ejectives, while English does not.","zh":"高加索地区的一些语言有喷音，而英语没有。"},{"en":"In a phonetics class, the teacher demonstrated ejectives like [kʼ] and [tʼ].","zh":"在语音学课上，老师示范了像[kʼ]和[tʼ]这样的喷音。"},{"en":"Learners often confuse ejectives with regular stops because both sound like “p, t, k.”","zh":"学习者常把喷音和普通塞音混淆，因为它们听起来都像“p、t、k”。"}]}],"synonyms":["ejective consonants","glottalic egressive consonants"],"phonetic":"/ɪˈdʒɛk.tɪvz/","extraExplanation":["“ejective”里的撇号（如[kʼ]）表示这是喷音：发音时声门（喉头部位）会上移，先把气流“锁”在口腔/咽腔里加压，再突然释放。","喷音常见于格鲁吉亚语、阿姆哈拉语、克丘亚语、祖鲁语（部分方言）等；标准英语里没有这种对立音位，但在某些强调或拟声中可能出现类似的“紧喉爆破”效果。","相关术语：pulmonic（肺气流音，英语大多数音）、glottalic egressive（声门上移的外喷机制=喷音）、implosives（内爆音，气流机制相反）。"]}
{"word":"ejectivity","summary":{"en":"Ejectivity is the linguistic feature of producing ejective sounds (e.g., [k’], [t’]) with a sharp burst from a glottal mechanism.","zh":"Ejectivity 指语言学中的“喷音性”，即用声门机制产生像 [k’]、[t’] 这类喷音辅音的特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) The quality or property of being an ejective sound—made with a burst of air produced by raising the closed glottis (as in ejective consonants like [k’], [t’]).","zh":"（语言学）喷音性；指发音具有“喷音（ejective）”的性质——通过关闭声门并上提，使气流在释放时产生明显爆破的辅音特征（如 [k’]、[t’]）。"},"examples":[{"en":"In this language, ejectivity contrasts meaning: /k/ and /k’/ are different sounds.","zh":"在这种语言中，喷音性会造成意义对立：/k/ 和 /k’/ 是不同的音。"},{"en":"The teacher asked us to listen for ejectivity in the final consonant.","zh":"老师让我们注意听词尾辅音有没有喷音性。"},{"en":"Some learners confuse ejectivity with aspiration, but they are not the same.","zh":"有些学习者会把喷音性和送气混淆，但两者并不相同。"}]}],"synonyms":["ejective quality","ejectiveness","glottalic egressive feature"],"phonetic":"/iˌdʒɛkˈtɪvɪti/","extraExplanation":["“喷音性（ejectivity）”常见于语音学/音系学讨论，和英语里常见的“送气（aspiration，如 [pʰ]）”不同：喷音使用的是“声门上提产生的气流机制（glottalic egressive）”，而送气通常是释放后带出一段额外气流。","英语普通口语里一般没有“对立性的喷音”（不会因为有无喷音而区分词义），但在一些语言（如高加索地区、北美部分原住民语言等）喷音很常见。"]}
{"word":"ejectment","summary":{"en":"Ejectment is a legal term meaning the court process or act of removing someone from property (eviction).","zh":"Ejectment 是法律术语，指通过法院程序将某人从房产/土地中驱逐（类似 eviction）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) The act or legal process of removing someone from land or property, usually by a court order; an eviction.","zh":"（法律）驱逐（令）；通过法律程序将某人从土地或房产中赶走，通常由法院命令执行；即“依法收回占有/驱逐”。"},"examples":[{"en":"The landlord filed an ejectment action to regain possession of the apartment.","zh":"房东提起驱逐诉讼，以取回对公寓的占有权。"},{"en":"After months of unpaid rent, the court granted ejectment.","zh":"在数月未付房租后，法院批准了驱逐令。"}]}],"synonyms":["eviction","removal","dispossession"],"phonetic":"/ɪˈdʒɛktmənt/","extraExplanation":["“ejectment”是英美法中的术语，常见于房产/土地纠纷语境，强调“通过诉讼恢复对不动产的占有（possession）”。在日常英语里，人们更常说“eviction（驱逐/赶租）”；但在法律文件或判例中可能会用“ejectment action / suit（驱逐诉讼）”。","词源上来自“eject（逐出）+ -ment（名词后缀）”。发音中的重音通常落在第二音节（e-JECT-ment），与动词“eject”一致。"]}
{"word":"ejector","summary":{"en":"An ejector is a device that forces something out, or a jet-driven device that creates suction to move/remove fluids or gases.","zh":"ejector 指“把东西推出/弹出”的装置，也可指利用喷射产生抽吸作用来输送或抽走气体/液体的“喷射抽吸器（引射器）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that pushes or forces something out (for example, a mechanism that ejects a seat, a cartridge, or another part).","zh":"弹射器；推出装置（把物体推出或弹出的机械装置，如弹射座椅、抛壳机构等）。"},"examples":[{"en":"The pilot pulled the handle, and the ejector seat fired instantly.","zh":"飞行员拉下把手，弹射座椅立刻启动。"},{"en":"In some machines, an ejector pushes the finished part out of the mold.","zh":"在一些机器里，推出装置会把成品从模具中顶出来。"}]},{"partOfSpeech":"n.","definition":{"en":"A device that uses a fast-moving fluid or gas (like steam or air) to create suction and move or remove another fluid, gas, or particles.","zh":"喷射抽吸器（利用高速流体/气体产生负压吸力，用来输送或抽走另一种气体、液体或颗粒）。"},"examples":[{"en":"The lab used a steam ejector to remove air from the system.","zh":"实验室用蒸汽喷射抽吸器把系统里的空气抽走。"},{"en":"An air ejector can help pull fumes out of a duct.","zh":"空气喷射抽吸器能帮助把管道里的烟气抽出去。"}]}],"synonyms":["expeller","ejection mechanism","jet pump","eductor"],"phonetic":"/ɪˈdʒɛktɚ/","extraExplanation":["在工程语境里，ejector 常见两大类：①“机械推出/弹射”的装置（比如枪械的抛壳机构、模具顶出机构、弹射座椅）；②“喷射器/引射器”（jet ejector/steam ejector），利用喷嘴高速喷射产生低压来“吸走/带走”另一股流体。它们原理不同，但都围绕“把东西推出或带走”的核心概念。","词源上来自动词 eject（“投出、逐出、弹出”），可拆为 e-（out，向外）+ ject（throw，投掷），同词根还见于 project（投射/项目）、inject（注射）、reject（拒绝/退回）。"]}
{"word":"ejectors","summary":{"en":"“Ejectors” usually means devices that use a jet to create suction/vacuum and remove fluids or gases; it can also mean mechanisms that eject things.","zh":"“Ejectors”通常指利用喷流产生吸力/真空以抽走气体或液体的喷射器；也可指把人或物弹出的弹射装置（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that uses a jet of fluid (often steam, water, or air) to pull, pump, or remove another fluid or gas; commonly used to create suction or a vacuum.","zh":"喷射器；利用喷流（常为蒸汽、水或空气）来带走、抽吸或排出另一种气体/液体的装置；常用于产生吸力或真空。"},"examples":[{"en":"The factory installed steam ejectors to create vacuum for the distillation process.","zh":"工厂安装了蒸汽喷射器，为蒸馏过程提供真空。"},{"en":"Water ejectors can remove air from a system without moving mechanical parts.","zh":"水喷射器可以在没有机械运动部件的情况下把系统里的空气抽走。"}]},{"partOfSpeech":"n.","definition":{"en":"People or mechanisms that eject someone or something (for example, aircraft seat ejection systems).","zh":"弹射者/弹射装置；指把人或物弹出、驱逐出去的人或机构（如飞机弹射座椅系统）。"},"examples":[{"en":"Modern ejectors in fighter jets are designed to save the pilot in emergencies.","zh":"战斗机上的现代弹射装置旨在在紧急情况下救命。"},{"en":"The ejectors pushed the spent cartridge out of the chamber.","zh":"弹壳抛出机构把用过的弹壳从膛室中顶出。"}]}],"synonyms":["jet pump","eductor","injector (related, not the same)","ejection mechanism"],"phonetic":"/ɪˈdʒɛktərz/","extraExplanation":["“ejector”在工程领域非常常见，尤其是化工、制冷、真空系统中。它的核心思路是利用高速喷流产生低压区（吸力），从而把另一股气体或液体“带走”。在中文里也常译作“喷射泵/引射器”（不同领域用词略有差别）。","“ejectors”是复数形式；单数是“ejector”。日常英语里如果不是工程语境，更常见的相关词是动词“eject”（弹出/驱逐）或名词“ejection seat”（弹射座椅）。"]}
{"word":"ejects","summary":{"en":"“Ejects” means “forces out” or “removes suddenly”; it can also mean “sends someone out of a sports game as punishment.”","zh":"“ejects”意为“把……弹出/推出；使突然离开”，也可指“（体育）将某人罚出场/驱逐出比赛”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to force something out or make it leave suddenly (often by pushing)","zh":"（常指用力推）把某物弹出/推出；使突然离开"},"examples":[{"en":"The printer ejects the paper when the job is finished.","zh":"打印任务完成后，打印机会把纸弹出来。"},{"en":"The pilot pulled the handle and ejected from the aircraft.","zh":"飞行员拉下拉杆，从飞机中弹射出去。"}]},{"partOfSpeech":"v.","definition":{"en":"(in sports) to officially send a player/coach out of a game as a punishment","zh":"（体育）将球员/教练罚出场；驱逐出比赛"},"examples":[{"en":"The referee ejects a player for fighting.","zh":"裁判因打架将球员罚出场。"},{"en":"He was ejected after arguing with the umpire.","zh":"他因与裁判争吵被罚出场。"}]}],"synonyms":["expels","forces out","pushes out","removes","throws out","boots (informal)"],"phonetic":"/ɪˈdʒekts/","extraExplanation":["“ejects”是动词“eject”的第三人称单数（he/she/it ejects），也可能是复数名词“ejects”（较少见，多用于技术语境，指“被弹出/排出的东西”，如数据或废料）。","常见搭配：eject the CD/USB（弹出光盘/USB）、eject from the plane（从飞机弹射）、eject someone from the game（将某人罚出比赛）。","区分：eject（更强调“用力弹出/推出”或“强制离开”） vs. expel（更偏“驱逐/开除”，语气更正式，如 expel a student）。"]}
{"word":"ejectum","summary":{"en":"Ejectum means a single thing that has been expelled or thrown out, mainly in scientific/technical contexts (more commonly seen as the plural ejecta).","zh":"Ejectum 指“被排出/抛出的单个东西”，多用于科学或技术语境（更常见的是复数 ejecta）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something that has been thrown out or expelled (the singular form; often used in technical or scientific writing).","zh":"被抛出或排出的东西（单数形式；常见于技术或科学语境）。"},"examples":[{"en":"The lab collected the ejectum for chemical analysis.","zh":"实验室收集了排出物进行化学分析。"},{"en":"In volcanology, ejectum can refer to a single piece of material thrown out during an eruption.","zh":"在火山学中，ejectum 可指一次喷发中抛出的单个物质碎块。"}]}],"synonyms":["expelled material","discharge","ejecta (more common plural)"],"phonetic":"/ɪˈdʒɛk.təm/","extraExplanation":["“ejectum”源自拉丁语，字面意思是“被抛出的东西”。在现代英语里更常见的是复数形式“ejecta”（喷出物/抛出物），而“ejectum”作为单数较少见，通常出现在火山学、地质学或医学等较正式的文本中。"]}
{"word":"ejectus","summary":{"en":"Ejectus is a Latin-form word meaning “ejected/expelled,” seen mainly in formal or scientific English, not everyday use.","zh":"ejectus 是拉丁语形式，意为“被抛出/被排出”，主要见于正式或科学英语中，日常不常用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in English mainly in science or formal notes) “thrown out; ejected; expelled.” Often appears as a Latin descriptor meaning something has been cast out or discharged.","zh":"（拉丁语；在英语中多见于科学或正式记录）“被抛出；被排出；被驱逐”。常作拉丁语描述词，表示某物已被排出或逐出。"},"examples":[{"en":"The report used Latin wording: “foreign body ejectus,” meaning the object had been expelled.","zh":"报告用了拉丁语表述：“foreign body ejectus”，意思是异物已被排出。"},{"en":"In older medical notes, you may see “ejectus” to describe material that was discharged from the body.","zh":"在较旧的病历记录里，你可能会看到“ejectus”，用来描述从身体排出的物质。"}]}],"synonyms":["ejected","expelled","discharged","cast out"],"phonetic":"/iˈdʒɛk.təs/","extraExplanation":["“ejectus”本身不是常见英语单词，更像是拉丁语形式出现在英语语境中（尤其是医学、解剖、旧式学术写作或某些标注）。日常英语通常用 ejected / expelled / discharged 等表达。","从拉丁语角度看，ejectus 与英语 eject 同源（都来自“抛出/逐出”的意思）。如果你是在某个固定短语、论文标题、或具体句子里看到它，给我原句我可以帮你判断它在该处的准确含义与更自然的英语改写。"]}
{"word":"ejicient","summary":{"en":"“Efficient” means working well with minimal waste of time, effort, or resources.","zh":"“Efficient”表示高效：用更少的时间、精力或资源取得好结果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Working well without wasting time, money, energy, or resources; producing good results with minimal effort.","zh":"高效的；效率高的（不浪费时间、金钱、精力或资源，以较少投入取得好结果）。"},"examples":[{"en":"She is an efficient worker who finishes tasks quickly and accurately.","zh":"她工作很高效，能又快又准地完成任务。"},{"en":"We need a more efficient way to organize these files.","zh":"我们需要一种更高效的方法来整理这些文件。"},{"en":"This car is fuel-efficient, so it costs less to drive.","zh":"这辆车很省油，所以开起来更省钱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a machine/system) Operating effectively, often with low waste such as less energy loss.","zh":"（机器/系统）运行有效、损耗低的（例如能量浪费少）。"},"examples":[{"en":"LED lights are more efficient than traditional bulbs.","zh":"LED灯比传统灯泡更高效。"},{"en":"An efficient cooling system keeps the computer from overheating.","zh":"高效的散热系统可以防止电脑过热。"}]}],"synonyms":["productive","streamlined","economical","well-organized","resourceful"],"phonetic":"/ɪˈfɪʃənt/","extraExplanation":["你输入的“ejicient”很可能是拼写错误，正确拼写通常是 **efficient**。常见拼错还包括 *effecient*。","词源上与 *efficient*（高效的）相关的词：**efficiency**（效率，名词）、**efficiently**（高效地，副词）。","注意区分：**effective** 强调“有效果/能达成目标”，而 **efficient** 强调“用更少资源更快更省地达成目标”。例如：一种方法可能 *effective* 但不 *efficient*（有效但费时费力）。"]}
{"word":"ejidal","summary":{"en":"Ejidal means “connected to an ejido,” Mexico’s system of community-owned farmland and related rights or authorities.","zh":"ejidal 指“与 ejido（墨西哥社区共有农地制度）相关的”，包括其土地、权利与管理机构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to an ejido (a Mexican system of community-owned agricultural land) or to the rights, land, or governance connected with an ejido","zh":"与“ejido（墨西哥的社区共有农地制度）”有关的；指与该制度下的土地、权利或管理相关的"},"examples":[{"en":"The company had to negotiate with ejidal authorities before building the road.","zh":"公司在修路前必须与ejidal（土地公社）的管理机构协商。"},{"en":"Some families farm ejidal land, but they cannot freely sell it like private property.","zh":"一些家庭耕种ejidal公地，但不能像私有财产那样自由买卖。"}]}],"synonyms":["ejido-related","communal-land (context-specific)"],"phonetic":"/eɪˈhiːdəl/","extraExplanation":["“Ejidal”来自西班牙语，常见于墨西哥社会、历史、法律与土地政策语境；理解它需要知道“ejido”是革命后土地改革的重要制度，强调社区共有与成员（ejidatarios）的使用权。","在英语新闻或学术写作中，你可能会看到“ejidal land / ejidal rights / ejidal authorities”等搭配，多用于描述土地所有权结构、开发谈判、农业政策与原住民/农村社区权益。"]}
{"word":"ejido","summary":{"en":"Ejido is a Mexican system of community-owned land that local members can use, especially for farming.","zh":"Ejido 指墨西哥的村社共有地制度：土地归社区共同所有，成员可使用（多用于耕作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Mexico) a piece of community-owned land that members can farm or use, often managed by a village or local community.","zh":"（尤指墨西哥）“公社土地／村社共有地”：由社区共同拥有、成员可耕作或使用、通常由村社管理的土地制度。"},"examples":[{"en":"After the revolution, many families received access to an ejido to grow corn and beans.","zh":"革命之后，许多家庭获得使用村社共有地（ejido）的权利，用来种玉米和豆类。"},{"en":"The company had to negotiate with the ejido before building the road.","zh":"公司在修路前必须与该村社共有地（ejido）的管理方协商。"}]}],"synonyms":["communal land","community land","common land (roughly)"],"phonetic":"/eɪˈhiːdoʊ/","extraExplanation":["“ejido”是西班牙语借词，常见于有关墨西哥历史、政治与土地制度的英文文章中。它与墨西哥的土地改革密切相关：在20世纪，政府将部分土地以“共同体”的形式分配给农村社区，成员通常拥有使用权而非完全私有产权（具体权利会随法律与时期变化）。","词源上，西班牙语 ejido 原指“城镇边缘的公地/空地”，可追溯到拉丁语与“出去、外部”有关的词根，后来在墨西哥语境中发展为特定的土地制度概念。","在英文里它多用于拉丁美洲研究、新闻与历史写作；通常不翻译，直接用 ejido，并在首次出现时加解释。"]}
{"word":"ejido-related","summary":{"en":"Ejido-related means connected with Mexico’s ejido communal land system or matters involving ejidos.","zh":"Ejido-related 指“与墨西哥ejido共有土地制度或与ejido相关事务有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with an ejido (a community-owned and community-managed land system, especially in Mexico) or with the people, rules, or activities involving ejidos","zh":"与“ejido（尤指墨西哥的共有、集体管理土地制度）”有关的；与ejido中的人、规定或相关活动有关的"},"examples":[{"en":"The report focuses on ejido-related land disputes after the new highway project.","zh":"这份报告聚焦于新公路项目之后与ejido相关的土地纠纷。"},{"en":"Ejido-related meetings are often held to vote on how communal land will be used.","zh":"与ejido相关的会议常常用来投票决定共有土地如何使用。"}]}],"synonyms":["ejidal","communal-land","community-land-related","agrarian-reform-related"],"phonetic":"/eɪˈhiːdoʊ rɪˌleɪtɪd/","extraExplanation":["“Ejido”是西班牙语词，常用于讨论墨西哥的土地制度与乡村政治：土地通常归社区共有，由成员（ejidatarios）共同决定耕作、分配与管理方式。","在新闻、学术或政策语境里，ejido-related 常出现在“土地权属（land tenure）”“农业改革（agrarian reform）”“开发与征地（development/expropriation）”“社区治理（community governance）”等话题中。","写作中也常见变体 ejidal（意为“ejido的；与ejido有关的”），如 ejidal land（ejido土地）。"]}
{"word":"ejidos","summary":{"en":"Ejidos are community-owned lands in Mexico used by local members, often for agriculture.","zh":"Ejidos 指墨西哥的社区集体所有土地，供当地成员使用，常用于农业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Mexico, pieces of land owned by the community (not by one person) and used by members for farming, grazing, or housing.","zh":"（墨西哥）“公社土地／共有土地”：由社区集体拥有、成员共同使用的土地，常用于耕作、放牧或居住。"},"examples":[{"en":"After the revolution, many villages received ejidos for farming.","zh":"革命之后，许多村庄获得了用于耕作的公社土地（ejidos）。"},{"en":"Some families grow corn on ejidos that belong to the whole community.","zh":"有些家庭在属于整个社区的公社土地（ejidos）上种玉米。"}]}],"synonyms":["communal lands","common lands","community-owned land"],"phonetic":"/eɪˈhiːdoʊz/","extraExplanation":["“ejido”（单数）源自西班牙语，英语中多用于拉丁美洲历史、政治、土地制度与人类学语境。你输入的“ejidos”是复数形式。","在墨西哥语境里，ejidos常与20世纪的土地改革相关：土地名义上归社区集体，成员拥有使用权（常见于农业与牧场）。不同地区对可否买卖、继承与管理方式可能有差异。"]}
{"word":"Ejnar","summary":{"en":"Ejnar is a Scandinavian (especially Danish) male given name, related to Einar.","zh":"Ejnar 是一个斯堪的纳维亚（尤其丹麦）男性名字，与 Einar 同源/相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine given name used mainly in Denmark and other Scandinavian contexts (a Danish form related to the Old Norse name “Einar”).","zh":"一个男性名字，主要见于丹麦及其他斯堪的纳维亚语境（与古诺尔斯语名字 Einar 同源/相关的丹麦形式）。"},"examples":[{"en":"Ejnar is a common older-fashioned Danish name.","zh":"Ejnar 是一个较常见、偏传统的丹麦男性名字。"},{"en":"My great-grandfather was named Ejnar.","zh":"我曾祖父叫 Ejnar。"}]}],"synonyms":["Einar"],"phonetic":"/ˈaɪ.nɑr/","extraExplanation":["Ejnar 通常被认为与古诺尔斯语 Einarr 有关，常见解释是“独自的/唯一的（ein）+ 战士（arr）”，因此可引申为“独行的战士/唯一的战士”。名字含义在不同资料中可能有细微差异。","著名人物：丹麦天文学家 Ejnar Hertzsprung（赫茨普龙），与“赫茨普龙—罗素图（H-R diagram）”有关。"]}
{"word":"ejoo","summary":{"en":"“ejoo” isn’t a standard English word; it’s likely a typo, name, or acronym.","zh":"“ejoo”不是标准英语词，可能是拼写错误、人名或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or an acronym, so meaning depends on context.","zh":"不是标准英语单词，可能是拼写错误、人名或缩写，含义需要结合上下文判断。"},"examples":[{"en":"I couldn’t find “ejoo” in an English dictionary—did you mean “enjoy”?","zh":"我在英语词典里找不到“ejoo”——你是不是想写“enjoy”？"},{"en":"If “Ejoo” is a person’s name, please share the sentence so I can explain it.","zh":"如果“Ejoo”是人名，请给我完整句子，我才能更准确解释。"}]}],"extraExplanation":["“ejoo”很可能是键入错误。常见接近的词包括：\n- enjoy /ɪnˈdʒɔɪ/（享受；喜欢）\n- ego（自我；自负）\n- e.g.（for example，例如）\n\n如果你把它放在一句话里（前后各1–2个词也可以），我可以帮你判断最可能的目标词，并给出正确拼写、发音和用法。"]}
{"word":"ejulate","summary":{"en":"Ejaculate most commonly means to release semen; less commonly (often in older writing) it means to blurt out words suddenly.","zh":"Ejaculate 最常见意思是“射精”；较少见的（多见于旧文学）意思是“脱口而出”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a man or male animal) to release semen, especially at orgasm.","zh":"（男性或雄性动物）射精，尤指在高潮时排出精液。"},"examples":[{"en":"He may ejaculate sooner if he feels anxious.","zh":"如果他感到焦虑，可能会更快射精。"},{"en":"Some medications can affect the ability to ejaculate.","zh":"某些药物会影响射精能力。"}]},{"partOfSpeech":"v.","definition":{"en":"to say something suddenly and emotionally; to blurt out.","zh":"（突然且激动地）脱口而出。"},"examples":[{"en":"“No way!” he ejaculated, surprised by the news.","zh":"“不可能！”他听到消息后惊讶地脱口而出。"},{"en":"In older novels, a character may 'ejaculate' a short remark.","zh":"在较老的小说里，人物可能会用“ejaculate”来表示突然说出一句短评。"}]}],"synonyms":["come (informal)","climax (informal)","blurt out","exclaim"],"phonetic":"/ɪˈdʒækjəˌleɪt/","extraExplanation":["你输入的拼写是“ejulate”，常见正确拼写是“ejaculate”。","第二个意思（“脱口而出”）在现代英语里比较少见，常见于较老的文学作品；日常更常用 blurt out / exclaim。"]}
{"word":"ejulation","summary":{"en":"Ejaculation most commonly means the release of semen; less commonly, it means a sudden exclamation in older or formal writing.","zh":"Ejaculation 最常指“射精”；较少见的用法是在较老或较正式的文体中指“突然的惊呼/脱口而出”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the release of semen from the penis, usually during sexual activity or orgasm (medical/sexual term)","zh":"（医学/性相关用语）射精；精液从阴茎排出，通常发生在性行为或性高潮时"},"examples":[{"en":"The doctor asked whether he had pain during ejaculation.","zh":"医生询问他射精时是否疼痛。"},{"en":"Stress can sometimes affect ejaculation.","zh":"压力有时会影响射精。"}]},{"partOfSpeech":"n.","definition":{"en":"a sudden, strong spoken remark or exclamation; something said quickly and spontaneously","zh":"突然的脱口而出；即兴的惊呼或插话"},"examples":[{"en":"His speech was interrupted by an ejaculation of surprise from the audience.","zh":"观众突然一声惊呼打断了他的演讲。"},{"en":"In older writing, “ejaculation” can mean a brief cry like “Oh!” or “Ah!”","zh":"在较早的作品中，ejaculation 可指像 “Oh!” “Ah!” 这样的短促惊呼。"}]}],"synonyms":["climax (sexual)","orgasm (related)","exclamation","outcry","interjection"],"phonetic":"/ɪˌdʒækjəˈleɪʃən/","extraExplanation":["你输入的 **ejulation** 通常是 **ejaculation** 的拼写错误（中间需要 **ac**）。","这个词在现代英语里更常用于“射精”的含义，属于较为私密/敏感的话题；在正式场合可用医学表达（如 *ejaculation*、*ejaculatory problems*），在日常对话中要注意语境与礼貌。","“突然的惊呼/插话”这一义项在现代较少见，但在较老的文学或正式文体里仍可能出现。"]}
{"word":"ejurate","summary":{"en":"A rare formal verb meaning to renounce something by oath.","zh":"一个罕见的正式动词，表示“通过宣誓放弃/否认”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, formal) To renounce or give up something by a sworn statement; to abjure.","zh":"（罕见/正式）以宣誓的方式放弃、否认或断绝（某事）；发誓不再（做某事）。"},"examples":[{"en":"He ejurated his claim to the title in open court.","zh":"他在法庭上公开宣誓放弃对该头衔的主张。"},{"en":"The witness ejurated any involvement in the scheme.","zh":"证人宣誓否认与该阴谋有任何牵连。"}]}],"synonyms":["abjure","renounce","forswear","disavow"],"phonetic":"/ˈɛdʒəˌreɪt/","extraExplanation":["“ejurate”非常少见，多见于法律、历史或文学语境。更常用的近义词是“abjure”（正式/文学：发誓放弃）或“renounce”（更常用：放弃/断绝）。","词源上与拉丁语“e-/ex-（出、离开）+ jurare（发誓）”有关，因此核心含义带有“宣誓”的法律色彩。"]}
{"word":"ejuration","summary":{"en":"Ejuration is a rare noun meaning a formal renunciation, often made under oath.","zh":"Ejuration 是个罕见名词，指正式放弃或否认，常带“宣誓”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A formal renunciation or giving up of something, especially stated under oath; an act of swearing something off.","zh":"（罕见）正式放弃或否认某事，尤指在宣誓/誓言下作出的放弃；“发誓不再……”的行为。"},"examples":[{"en":"In the old legal record, the defendant’s ejuration of all claims ended the dispute.","zh":"在那份旧法律记录中，被告对所有主张的正式放弃（ejuration）结束了争议。"},{"en":"His ejuration of the old habit sounded sincere, but change took time.","zh":"他发誓戒掉旧习惯的声明听起来很真诚，但改变仍需要时间。"}]}],"synonyms":["abjuration","renunciation","disavowal","repudiation","oath"],"phonetic":"/ˌɛdʒəˈreɪʃən/","extraExplanation":["“ejuration”在现代英语中非常少见，多见于旧法律/宗教/文学语境。日常表达更常用 renunciation（放弃）, disavowal（否认）, vow/oath（誓言）, or “swear off (something)”（发誓戒掉/不再做）。","词源上可追溯到拉丁语 ejurare（在誓言下否认/放弃）。学习时也要注意别和更常见的 abjuration（正式放弃/背弃，尤指信仰或立场）或 adjuration（郑重恳求/命令，带“以……起誓”的语气）混淆。"]}
{"word":"ejusd","summary":{"en":"“ejusd” isn’t a recognized English word; it’s likely a typo and needs context.","zh":"“ejusd”不是常见英语词，可能是拼写错误，需要上下文确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo or random letters; please confirm what you meant (for example: “adjust,” “E-USD,” or something else).","zh":"不是标准的英语单词。可能是拼写错误或随机字母；请确认你想表达的词（例如：adjust、E-USD 等）。"},"examples":[{"en":"I couldn’t find “ejusd” in an English dictionary—did you mean “adjust”?","zh":"我在英语词典里找不到“ejusd”——你是不是想写“adjust”？"},{"en":"If “ejusd” is a name, abbreviation, or code, tell me the context and I can help interpret it.","zh":"如果“ejusd”是名字、缩写或代码，请告诉我上下文，我可以帮你解释。"}]}],"phonetic":"/ɛˈdʒʌsd/"}
{"word":"ejusdem","summary":{"en":"Ejusdem is legal Latin meaning “of the same (kind),” often seen in the phrase “ejusdem generis.”","zh":"Ejusdem 是法律拉丁语，意为“同样的/同类的”，常见于短语 “ejusdem generis”（同类解释原则）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Legal Latin) “of the same; of the same kind.” Used in legal writing to refer back to something previously mentioned.","zh":"（法律拉丁语）“同样的；同类的”。在法律文书中用来指代前文提到的同一事物或同一类别。"},"examples":[{"en":"The contract forbids the disclosure of trade secrets and other information ejusdem.","zh":"合同禁止披露商业秘密及其他同类信息。"},{"en":"Courts often interpret general words as limited to items ejusdem generis with the specific list.","zh":"法院常把概括性用语解释为仅限于与具体列举项目同类的事物（同类解释原则）。"}]}],"synonyms":["of the same kind","of the same","similar","same category"],"phonetic":"ˈeɪdʒəsˌdɛm","extraExplanation":["“ejusdem”来自拉丁语，常见于法律英语的固定搭配“ejusdem generis”（同类解释原则）：当条文先列举若干具体事物，再用“and other…”之类的概括性表述时，一般把“other”理解为与前面列举事项“同类”的东西。","在现代英语正文写作里单独用“ejusdem”不算常见，更常见的是直接写“of the same kind”或使用“ejusdem generis”。"]}

