{"word":"ekaboron","summary":{"en":"“Ekaboron” (usually written “eka-boron”) is an old term for scandium, an element Mendeleev predicted before it was discovered.","zh":"“Ekaboron”（常写作“eka-boron”）是钪的旧称，指门捷列夫在元素被发现前预测的一种元素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical name for the chemical element scandium, predicted by Dmitri Mendeleev before it was discovered","zh":"一种历史名称，指化学元素“钪（scandium）”，由门捷列夫在发现前预测其存在"},"examples":[{"en":"In old chemistry texts, “eka-boron” refers to scandium.","zh":"在一些老的化学教材中，“eka-boron”指的就是钪。"},{"en":"Mendeleev predicted eka-boron’s properties long before scandium was isolated.","zh":"门捷列夫在钪被分离出来之前很久就预测了“eka-boron”的性质。"}]}],"synonyms":["eka-boron","scandium"],"phonetic":"/ˌiːkə ˈbɔːrɑːn/","extraExplanation":["“eka-”来自梵语，意思是“一”。门捷列夫用它给尚未发现的元素命名：例如“eka-boron”表示“在元素周期表中位于硼（boron）正下方的那个元素”。后来该元素被发现并命名为scandium（钪）。","现代英语里更常用的名称是“scandium”；“eka-boron/ekaboron”多见于历史背景、科普或化学史文章。"]}
{"word":"ekacaesium","summary":{"en":"Ekacaesium (more commonly written “eka-caesium”) is an old predicted name for the element later called francium.","zh":"Ekacaesium（更常写作“eka-caesium”）是一个旧的预测名称，指后来被命名为钫（francium）的元素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical predicted name for the chemical element later discovered and named francium (Fr), meaning “the element one place below cesium” in the periodic table","zh":"历史上的预测名称，指后来被发现并命名为“钫”（Fr）的化学元素；意思是“在元素周期表中位于铯（cesium）下一位的元素”"},"examples":[{"en":"Before it was discovered, scientists sometimes called francium “eka-caesium.”","zh":"在被发现之前，科学家有时把钫称为“eka-caesium（类铯）”。"},{"en":"The name “eka-caesium” appears in older writings about Mendeleev’s predicted elements.","zh":"“eka-caesium”这个名称会出现在较早期讨论门捷列夫预测元素的文章中。"}]}],"synonyms":["eka-caesium","francium"],"phonetic":"/ˌiːkə ˈsiːziəm/","extraExplanation":["“eka-”来自梵语，意思是“一个”。门捷列夫在预测新元素时，常用“eka- + 已知元素名”来表示“在周期表中下一行（正下方）的那个元素”，例如“eka-aluminum”（后来是镓）。“eka-caesium”对应的就是后来发现的钫（francium）。","现代英语里几乎不再用“eka-caesium”，多只在科学史、周期表发展史的语境中出现。"]}
{"word":"ekaha","summary":{"en":"“Ekaha” is mainly used as a Hawaiian term for a fern (often the bird’s-nest fern).","zh":"“ekaha”主要是夏威夷语用词，指一种蕨类植物（常指鸟巢蕨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Hawaiian word for a kind of fern, often referring to the bird’s-nest fern found in Hawaiʻi","zh":"夏威夷语词，指一种蕨类植物；常用来指夏威夷常见的“鸟巢蕨”"},"examples":[{"en":"We saw ʻēkaha growing on the shady cliffs near the waterfall.","zh":"我们在瀑布附近阴凉的峭壁上看到了生长着的 ʻēkaha（鸟巢蕨）。"},{"en":"In some local plant guides, ʻēkaha is listed as a traditional name for certain ferns.","zh":"在一些本地植物指南里，ʻēkaha 被列为某些蕨类的传统名称。"}]}],"synonyms":["bird’s-nest fern","fern"],"phonetic":"/eɪˈkɑːhə/","extraExplanation":["“ekaha”更常见的写法是夏威夷语“ʻēkaha”（可能带长音符号 ē，以及表示喉塞音的 ʻ）。不同资料里它可能指向不同的蕨类（常见解释是鸟巢蕨一类），具体物种会因地区与资料而异。","如果你是想查英语单词、或想输入的是别的拼写（例如人名/地名/产品名），告诉我上下文或正确拼写，我可以再精确确认。"]}
{"word":"Ekalaka","summary":{"en":"Ekalaka is a town in southeastern Montana, USA, best known as the county seat of Carter County.","zh":"Ekalaka（埃卡拉卡）是美国蒙大拿州东南部的一座小镇，最常见的指代是卡特县的县治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small town in southeastern Montana, USA (the county seat of Carter County).","zh":"美国蒙大拿州东南部的小镇（卡特县的县治/县政府所在地）。"},"examples":[{"en":"We drove through Ekalaka on our way to explore southeastern Montana.","zh":"我们去蒙大拿州东南部探访时，开车经过了埃卡拉卡（Ekalaka）。"},{"en":"Ekalaka is the county seat of Carter County.","zh":"埃卡拉卡是卡特县的县治。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) something associated with that town, such as its local community, school, or area.","zh":"（引申）与该镇相关的事物，如当地社区、学校或周边地区。"},"examples":[{"en":"She’s from Ekalaka, so she knows the area well.","zh":"她来自埃卡拉卡，所以对那一带很熟。"},{"en":"Ekalaka’s community events bring neighbors together.","zh":"埃卡拉卡的社区活动把邻里凝聚在一起。"}]}],"synonyms":["(no true synonyms; it’s a proper place name)"],"phonetic":"/ˌiːkəˈlɑːkə/","extraExplanation":["“Ekalaka”多作为地名使用（专有名词），在英语里通常不翻译，只做音译。书写时首字母大写：Ekalaka。","地名的来源在不同资料中可能有不同说法；如果你是为写作或报告需要更准确的词源/含义，建议以当地历史协会、县政府或权威地名词典的解释为准。"]}
{"word":"ekamanganese","summary":{"en":"Eka-manganese is an old, predicted name for element 43, later discovered as technetium.","zh":"Eka-manganese 是一个历史上的预测名称，指第43号元素，后来发现为锝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical chemistry) Mendeleev’s predicted “missing” element below manganese in the periodic table; it was later identified as technetium (element 43).","zh":"（化学史）门捷列夫在元素周期表中预测的“锰的下一位”的缺失元素；后来被证实为锝（第43号元素）。"},"examples":[{"en":"In early periodic-table writings, element 43 was sometimes called eka-manganese before it was known as technetium.","zh":"在早期的周期表文献中，第43号元素在被称为“锝”之前，有时被叫作“eka-manganese（类锰元素）”。"},{"en":"The name eka-manganese reflects its expected similarities to manganese based on periodic trends.","zh":"“eka-manganese”这个名称体现了人们根据周期律推测它应与锰在性质上相似。"}]}],"synonyms":["technetium","element 43"],"phonetic":"/ˌiːkəˈmæŋɡəniːz/","extraExplanation":["“eka-”来自梵语，意思是“一”。门捷列夫用它来给尚未发现、但在周期表中应当存在的元素起临时名：例如“eka-silicon（类硅）”后来是锗（Ge）。因此“eka-manganese（类锰）”就是“在锰下面一格的元素”的占位名。","历史上也有人用“dvi-（二）”“tri-（三）”等前缀表示同族更往下的预测元素；比如“dvi-manganese（类锰二号）”后来对应铼（Re，75号元素）。"]}
{"word":"ekasilicon","summary":{"en":"“Ekasilicon” is an old name Mendeleev used for the then-unknown element later discovered as germanium.","zh":"“Ekasilicon”是门捷列夫对当时未知、后来被发现为“锗”的元素所用的历史名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical chemistry) The predicted element below silicon in the periodic table; later identified as the element germanium (Ge).","zh":"（化学史用语）指周期表中“硅（silicon）”下方被预测的元素；后来证实为“锗（germanium，Ge）”。"},"examples":[{"en":"Mendeleev called the unknown element “ekasilicon,” and it was later discovered as germanium.","zh":"门捷列夫把这种未知元素称为“ekasilicon（类硅）”，后来它被发现并确认为锗。"},{"en":"In older texts, ekasilicon appears as a placeholder name before germanium was confirmed.","zh":"在较早的文献中，ekasilicon常作为锗被证实之前的“占位名称”出现。"}]}],"synonyms":["germanium (Ge)","(historical) eka-silicon"],"phonetic":"/ˌiːkəˈsɪlɪkən/","extraExplanation":["“eka-”来自梵语，意思是“一个/一”。门捷列夫用它来表示“在周期表中比某元素低一格的未知元素”。因此：ekasilicon＝“比硅低一格的元素”（后来就是锗）。","这类历史命名还有：ekaboron（后来是钪 scandium）、eka-aluminium（后来是镓 gallium）。读化学史或老教材时可能会遇到。"]}
{"word":"ekatantalum","summary":{"en":"“Eka-tantalum” is an old, historical name for the element predicted to sit below tantalum; it is now known as dubnium (element 105).","zh":"“Eka-tantalum”是一个历史旧称，用来指位于钽下方的预测元素；现代对应为第105号元素杜布尼（dubnium）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical placeholder name meaning “the element one place below tantalum” in the periodic table; it later corresponded to element 105, now called dubnium (Db).","zh":"历史上的占位名称，意为“在元素周期表中位于钽（tantalum）正下方的元素”；后来对应于第105号元素，现称为钅杜/杜布尼（dubnium，Db）。"},"examples":[{"en":"In older chemistry writing, “eka-tantalum” was used as a predicted name for what we now call dubnium.","zh":"在较早的化学文献中，“eka-tantalum”曾被用作对如今称为杜布尼（dubnium）的预测性名称。"},{"en":"Modern textbooks usually use “dubnium” rather than “eka-tantalum.”","zh":"现代教材通常使用“dubnium（杜布尼）”，而不是“eka-tantalum”。"}]}],"synonyms":["dubnium","element 105","Db"],"phonetic":"/ˌiːkə ˈtæntələm/","extraExplanation":["“eka-”来自梵语，意思是“一个/第一”。门捷列夫用它给尚未发现的元素起临时名：在某已知元素“下面一格”的就叫“eka-某元素”（再下一格会用“dvi-”“tri-”等）。","“eka-tantalum”在现代并非正式名称；现在对应的正式元素名是 dubnium（Db，第105号元素）。写法上常见带连字符：eka-tantalum。"]}
{"word":"Ekaterina","summary":{"en":"Ekaterina is a Russian female first name, equivalent to Catherine/Katherine.","zh":"Ekaterina 是俄语常见的女性名字，相当于英语的 Catherine/Katherine。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, commonly Russian, equivalent to “Catherine/Katherine.”","zh":"女性名字，常见于俄语文化中，相当于英语里的 “Catherine/Katherine（凯瑟琳/凯瑟琳）”。"},"examples":[{"en":"Ekaterina moved to New York for graduate school.","zh":"叶卡捷琳娜去纽约读研究生。"},{"en":"In the novel, Ekaterina is a pianist who lives in St. Petersburg.","zh":"在小说中，叶卡捷琳娜是一位住在圣彼得堡的钢琴家。"},{"en":"Her friends call her Katya, a common nickname for Ekaterina.","zh":"朋友们叫她“卡佳（Katya）”，这是 Ekaterina 常见的昵称。"}]}],"synonyms":["Catherine","Katherine","Katarina","Yekaterina"],"phonetic":"/ɪˌkæ.təˈriː.nə/","extraExplanation":["“Ekaterina（叶卡捷琳娜）”是俄语对“Catherine/Katherine”的对应形式，源头可追溯到希腊语名“Αἰκατερίνη（Aikaterínē）”。在俄语环境中常见昵称有“Катя（Katya）”“Катенька（Katenka，较亲昵）”。","历史上非常著名的使用者包括俄国的“叶卡捷琳娜二世（Catherine the Great）”。在英文语境中，人们有时会把 Ekaterina 直接写作 Catherine/Katherine，或保留原拼写以强调俄语背景。"]}
{"word":"Ekaterinburg","summary":{"en":"Ekaterinburg is a large Russian city east of the Ural Mountains, known as a key regional center.","zh":"叶卡捷琳堡是俄罗斯乌拉尔山脉以东的一座重要大城市与区域中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in Russia, located east of the Ural Mountains; the administrative center of Sverdlovsk Oblast. It is an important industrial, cultural, and transport hub.","zh":"叶卡捷琳堡：俄罗斯的一座大城市，位于乌拉尔山脉以东；斯维尔德洛夫斯克州首府。它是重要的工业、文化与交通枢纽。"},"examples":[{"en":"Ekaterinburg lies near the Ural Mountains, which are often seen as the boundary between Europe and Asia.","zh":"叶卡捷琳堡靠近乌拉尔山脉，乌拉尔山常被视为欧洲与亚洲的分界线。"},{"en":"She took the Trans-Siberian Railway and stopped in Ekaterinburg for two days.","zh":"她乘坐西伯利亚大铁路，并在叶卡捷琳堡停留了两天。"}]}],"synonyms":["Yekaterinburg","Sverdlovsk (historical name)"],"phonetic":"/jɪˌkæ.tər.ɪnˈbɝːɡ/","extraExplanation":["“Ekaterinburg”是英语常见拼写；俄语为“Екатеринбург”。城市名来自叶卡捷琳娜一世（Catherine I）。\n\n历史上它曾在苏联时期改名为“Sverdlovsk”（斯维尔德洛夫斯克），1991年恢复原名。现在在英语资料里，历史语境中仍可能见到“Sverdlovsk”。\n\n发音提示：重音常落在第三个音节附近（ka-TER-in-...），英语里也有人把它简化或读得更接近俄语。"]}
{"word":"Ekaterinodar","summary":{"en":"Ekaterinodar is the historical name of today’s Krasnodar in southern Russia.","zh":"Ekaterinodar 是俄罗斯南部城市克拉斯诺达尔（Krasnodar）的历史旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The former name of the Russian city now called Krasnodar, in southern Russia; it was used mainly from the late 18th century until the early Soviet period.","zh":"俄罗斯南部城市克拉斯诺达尔（Krasnodar）的旧称，主要在18世纪末至苏维埃早期使用。"},"examples":[{"en":"In old documents, the city appears under the name Ekaterinodar.","zh":"在旧档案中，这座城市常以“Ekaterinodar”的名字出现。"},{"en":"His family history traces back to Ekaterinodar, now known as Krasnodar.","zh":"他的家族史可追溯到旧称为Ekaterinodar、现称Krasnodar的地方。"}]}],"synonyms":["Krasnodar (modern name)"],"phonetic":"/ɪˌkætərɪnəˈdɔr/","extraExplanation":["“Ekaterinodar”来自俄语“Екатеринодар”，可理解为“叶卡捷琳娜的赠礼/赐予之城”，与俄国女皇叶卡捷琳娜二世（Catherine the Great）的历史背景相关。","该地与库班哥萨克（Kuban Cossacks）的定居与军事屯垦历史有关；后来在苏联时期更名为“Krasnodar”（意为“红色的赠礼”或“红色之城”的含义色彩）。"]}
{"word":"Ekaterinoslav","summary":{"en":"Ekaterinoslav is the historical name of today’s Dnipro in Ukraine, mainly seen in older records and historical writing.","zh":"Ekaterinoslav（叶卡捷琳诺斯拉夫）是乌克兰城市第聂伯（Dnipro）的历史旧称，主要见于旧档案与历史著作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the former name of the city now called Dnipro (formerly Dnipropetrovsk) in central Ukraine; used mainly in historical contexts (especially about the Russian Empire and early Soviet period).","zh":"乌克兰中部城市第聂伯（Dnipro；旧称第聂伯罗彼得罗夫斯克）的旧名“叶卡捷琳诺斯拉夫”，多用于历史语境（尤其指俄罗斯帝国及苏联早期）。"},"examples":[{"en":"In 19th-century documents, the city often appears under the name Ekaterinoslav.","zh":"在19世纪的文献中，这座城市常以“Ekaterinoslav（叶卡捷琳诺斯拉夫）”之名出现。"},{"en":"His great-grandparents moved to Ekaterinoslav before the First World War.","zh":"他的曾祖父母在第一次世界大战前搬到了叶卡捷琳诺斯拉夫。"}]}],"synonyms":["Dnipro","Dnipropetrovsk"],"phonetic":"ɪˌkætəˈriːnəslɑːv","extraExplanation":["“Ekaterinoslav”是俄语“Екатеринослав”的拉丁转写，常见于英语历史写作、旧地图、族谱与档案材料中。","词名大致可理解为“叶卡捷琳娜的荣耀/荣耀属于叶卡捷琳娜”，与俄国女皇叶卡捷琳娜二世（Catherine the Great）相关。","该城名称多次更改：历史上曾用Ekaterinoslav；苏联时期更名为Dnipropetrovsk；近年官方名称为Dnipro。阅读历史资料时，可能会在同一地点看到不同名称并存。"]}
{"word":"eke","summary":{"en":"Eke (often in “eke out”) means to achieve or maintain something with difficulty, or to make limited resources last longer.","zh":"Eke（常用于“eke out”）指艰难地取得/维持某事，或在资源有限时省着用以撑得更久。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to manage to get or achieve something with difficulty, often little by little","zh":"（通常指一点一点地）艰难地得到/实现；勉强维持"},"examples":[{"en":"She eked out a living by selling snacks after work.","zh":"她下班后卖零食，勉强维持生计。"},{"en":"We finally eked out a win in the last minute.","zh":"我们最终在最后一分钟艰难地赢了一场。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something last longer by using it carefully or in small amounts","zh":"节省着用；省着点儿用以延长（食物、金钱等）的使用时间"},"examples":[{"en":"They eked out their food until help arrived.","zh":"他们省着点儿吃，把食物撑到救援到来。"},{"en":"I’m trying to eke out my savings this month.","zh":"这个月我在尽量省着点儿花，把存款用久一点。"}]}],"synonyms":["scrape by","get by","manage","make do","stretch"],"phonetic":"/ik/","extraExplanation":["“eke”常见搭配是“eke out”，比单独用“eke”更自然：eke out a living（勉强糊口）、eke out a win（险胜）、eke out resources/food/money（省着用资源/食物/钱）。","语气上，“eke out”带有“资源很少、处境不易但努力撑过去”的感觉，比“save”更强调艰难与勉强。"]}
{"word":"ekebergite","summary":{"en":"Ekebergite is a rare amphibole-group silicate mineral found in some metamorphic rocks.","zh":"Ekebergite（埃克贝吉石）是一种罕见的角闪石族硅酸盐矿物，见于某些变质岩中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a type of amphibole silicate) found in some metamorphic rocks, named after the Swedish chemist Anders Gustaf Ekeberg","zh":"一种罕见矿物（属角闪石族的硅酸盐矿物），常见于某些变质岩中；名称源自瑞典化学家安德斯·古斯塔夫·埃克贝里（Anders Gustaf Ekeberg）"},"examples":[{"en":"The sample was labeled as ekebergite in the museum’s mineral collection.","zh":"这块样品在博物馆的矿物收藏中被标注为“ekebergite（埃克贝吉石）”。"},{"en":"Researchers noted traces of ekebergite in a metamorphic rock from the region.","zh":"研究人员指出，该地区的一块变质岩中含有微量的埃克贝吉石（ekebergite）。"}]}],"synonyms":["(no common everyday synonyms; mineral name)"],"phonetic":"/ˈiːkəˌbɝːɡaɪt/","extraExplanation":["“ekebergite”属于矿物学术语，日常英语里几乎不会出现，更多见于地质报告、矿物标本说明、学术论文等语境。","以“-ite”结尾的词在英语里常用于矿物或岩石名称（如 granite 花岗岩、calcite 方解石），看到这种词尾时可以先联想到“矿物/岩石类名词”。"]}
{"word":"eked","summary":{"en":"“Eked” means “managed with difficulty,” often in the phrase “eked out.”","zh":"“eked”表示“艰难地凑出/维持”，常用于短语“eked out”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “eke”: to manage to get or produce something with difficulty, usually by using small amounts carefully (often in “eke out”).","zh":"“eke”的过去式/过去分词：艰难地设法得到或凑出（某物），通常指精打细算、用一点点把它补足（常见于短语“eke out”）。"},"examples":[{"en":"They eked out a living by doing odd jobs.","zh":"他们靠打零工勉强维持生计。"},{"en":"We eked out our supplies until help arrived.","zh":"我们把物资省着用，勉强撑到救援到来。"},{"en":"She eked out enough money for the bus fare.","zh":"她好不容易凑够了公交车费。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Less common) Past tense of “eke” meaning to live or survive with only a little; to get by.","zh":"（较少见）“eke”的过去式：指靠很少的东西勉强过活；将就度日。"},"examples":[{"en":"During the hard winter, many families eked by on very little food.","zh":"在艰难的冬天，许多家庭靠很少的食物勉强度日。"}]}],"synonyms":["scraped by","managed","made do","got by","stretched (resources)"],"phonetic":"/ik/","extraExplanation":["“eke”多与“out”搭配成固定短语“eke out”，表示“勉强凑足、勉强维持”。常见搭配：eke out a living（糊口）、eke out an existence（勉强生存）、eke out supplies/resources（省着用物资/资源）。","语气通常带有“艰难、紧巴、费力”的感觉，比“save（节省）”更强调“不够用还得硬撑”。"]}
{"word":"ekename","summary":{"en":"An archaic word meaning “nickname,” an extra name added to someone’s real name.","zh":"一个古旧词，意思是“绰号/外号”，即加在本名上的额外称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old word meaning a “nickname” or an additional name added to someone’s given name.","zh":"古英语/中古英语用法：指“绰号、外号”，即加在本名之外的附加称呼。"},"examples":[{"en":"In some old records, a person might be listed with an ekename to tell them apart from others with the same first name.","zh":"在一些古老记录里，一个人可能会带有 ekename（外号）来区分同名的人。"},{"en":"He was known by his ekename in the village more than by his real name.","zh":"在村里，他的外号（ekename）比本名更为人所知。"}]}],"synonyms":["nickname","sobriquet","byname","moniker"],"phonetic":"/ˈiːkˌneɪm/","extraExplanation":["“ekename”如今几乎不用，主要出现在历史语言学或古文献讨论中。它原本由 “eke（额外的、再加上的）+ name（名字）” 组成，意思就是“附加的名字”。后来人们把 “an ekename” 误分为 “a nekename”，逐渐演变成现代英语的 “nickname”。这是英语里很经典的“误切分（rebracketing）”例子。"]}
{"word":"eker","summary":{"en":"“Eker” is usually a proper name, not a common English vocabulary word.","zh":"“Eker”通常是专有名词，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper name (a surname or brand name), especially Turkish (e.g., the Turkish dairy brand “Eker”).","zh":"不是标准英语词；最常见用法是专有名词（姓氏或品牌名），尤其常见于土耳其语背景（例如土耳其乳制品品牌“Eker”）。"},"examples":[{"en":"Eker is a well-known dairy brand in Turkey.","zh":"Eker 是土耳其一家知名的乳制品品牌。"},{"en":"Ms. Eker will join the meeting at 3 p.m.","zh":"Eker 女士将于下午三点参加会议。"}]}],"synonyms":["(as a name) no direct synonyms"],"phonetic":"/ˈɛkər/","extraExplanation":["“eker”在英语里通常不作为词汇使用，因此在阅读中遇到它，往往是在姓名、公司名、品牌名或地名等语境里。","如果你本来想查的是英文单词，可能是拼写误差：常见的相近词包括 eager（渴望的/热切的）、eker（几乎不作为英文单词）、或 -er 结尾的职业/人称名词。你可以告诉我上下文句子，我可以帮你判断。"]}
{"word":"ekerite","summary":{"en":"“ekerite” isn’t a standard English word; it’s probably a misspelling (often of “eukaryote” or “eke it out”).","zh":"“ekerite”不是标准英语词汇；更可能是拼写错误（常见是“eukaryote”或短语“eke it out”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a proper name. Common guesses include “eukaryote” (a cell with a nucleus) or the phrase “eke it (out)” (to manage with difficulty).","zh":"不是常见英语词典中的标准词；更可能是拼写错误或专有名词。常见的可能目标包括“eukaryote（真核生物/真核细胞）”或短语“eke it (out)（勉强维持/设法凑合）”。"},"examples":[{"en":"I can’t find “ekerite” in a dictionary—did you mean “eukaryote”?","zh":"我在词典里找不到“ekerite”——你是不是想写“eukaryote”？"},{"en":"If you meant “eke it out,” it means to manage with very little money or resources.","zh":"如果你想表达“eke it out”，意思是资源/钱很少也要勉强维持下去。"}]}],"synonyms":["eukaryote","eke it out"],"phonetic":"/ˈiːkəˌraɪt/","extraExplanation":["“ekerite”看起来像是拼写误差。你可以回忆一下它出现的语境（生物课、地质/矿物名称、人名/地名、游戏/品牌等），我就能更准确地判断。","如果你想查的是“eukaryote”，常见拼法是 e-u-k-a-r-y-o-t-e；如果你想表达“勉强维持”，常用短语是 “eke it out”。"]}
{"word":"ekes","summary":{"en":"“ekes” is the third-person singular form of “eke,” meaning to manage with difficulty or to stretch a limited supply (often in the phrase “eke out”).","zh":"“ekes”是动词“eke”的第三人称单数，表示“勉强维持/勉强凑够”或“节省使用以延长有限资源”（常见于短语“eke out”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “eke”) to manage to get something you need with difficulty, often because there is not much available.","zh":"（“eke”的第三人称单数）勉强获得/维持（所需之物），常因资源不足而很吃力。"},"examples":[{"en":"With two part-time jobs, she ekes out a living in the city.","zh":"靠着两份兼职，她在城市里勉强维持生计。"},{"en":"He ekes out enough time to finish his homework before work.","zh":"他挤出一点时间，在上班前把作业做完。"}]},{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “eke”) to make something last longer by using it carefully; to stretch a limited supply.","zh":"（“eke”的第三人称单数）节省使用以延长某物的使用时间；把有限资源“撑久一点”。"},"examples":[{"en":"She ekes the rice out by adding more vegetables.","zh":"她多加些蔬菜，把米饭省着吃、让它更耐吃。"},{"en":"The team ekes their budget out until the end of the month.","zh":"团队把预算省着用，撑到月底。"}]}],"synonyms":["scrape by","get by","make do","stretch","manage","ration"],"phonetic":"/ik/","extraExplanation":["“eke”常见搭配是 **eke out**（勉强维持/勉强凑够/省着用把东西撑久），比单独用“eke”更常见。","语气上，“eke (out)”常带有“资源不足、做得很辛苦”的感觉；比“save”更强调“勉强”和“费力”。","词源上与“增加/补足”相关，所以也可表示“稍微补充一点”，但现代英语里主要用于“勉强维持/省着用”。"]}
{"word":"EKG","summary":{"en":"EKG means electrocardiogram, a test that records the heart’s electrical activity.","zh":"EKG指心电图（electrocardiogram），用于记录心脏的电活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Electrocardiogram; a test/recording that shows the heart’s electrical activity, usually printed as a line graph.","zh":"心电图；一种记录心脏电活动的检查/记录，通常以波形图显示。"},"examples":[{"en":"The doctor ordered an EKG to check for irregular heartbeats.","zh":"医生安排做心电图来检查是否有心律不齐。"},{"en":"My EKG was normal, so they ruled out a heart attack.","zh":"我的心电图正常，所以他们排除了心脏病发作的可能。"}]}],"synonyms":["ECG","electrocardiogram"],"phonetic":"/ˌiːkeɪˈdʒiː/","extraExplanation":["EKG和ECG是同一个检查：ECG来自英文全称electrocardiogram；EKG来自德语“Elektrokardiogramm”，用K是为了避免与“EEG（脑电图）”混淆。","在美国日常口语和医疗场景里，EKG和ECG常常可以互换使用。"]}
{"word":"ekhimi","summary":{"en":"“ekhimi” isn’t a recognized English word; it’s likely a misspelling or a proper name.","zh":"“ekhimi”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling, a name, or a term from another language.","zh":"不是标准英语词；可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “ekhimi” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里找不到“ekhimi”——你能把它出现的句子发我吗？"},{"en":"Did you mean “alchemy” (a historical practice related to early chemistry)?","zh":"你是不是想写“alchemy”（与早期化学相关的历史实践）？"}]}],"phonetic":"/ˌɛkɪˈmiː/","extraExplanation":["“ekhimi”看起来更像是：①某个专有名词（人名/网名/品牌名）；②其他语言的转写；③你想输入的英文单词拼错了。","如果你告诉我它出现的语境（整句/段落）以及你想表达的意思或来源（书、歌词、游戏、社交媒体等），我可以更准确地判断。","可能的接近词（仅供参考）：alchemy（炼金术）、echidna（针鼹）、kimchi（泡菜，韩语音译常见）。"]}
{"word":"eking","summary":{"en":"“Eking” means struggling to get or keep just enough by adding a little at a time, most often in the phrase “eke out.”","zh":"“eking”表示通过一点点补足来勉强维持或凑够，最常见于短语“eke out”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the present participle of “eke”; used to mean trying hard to get a little more of something, especially money, food, time, or resources.","zh":"“eke”的现在分词；表示（尤指钱、食物、时间或资源）勉强再多弄到一点、艰难维持。"},"examples":[{"en":"She was eking out a living by doing part-time jobs.","zh":"她靠做兼职勉强维持生计。"},{"en":"They were eking out their supplies until help arrived.","zh":"他们一直省着用物资，撑到救援到来。"},{"en":"I’m eking out a few extra minutes to finish the report.","zh":"我在勉强挤出几分钟把报告写完。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) slowly increasing something by adding small amounts over time.","zh":"（较少见）通过一点点添加来慢慢增加（某物）。"},"examples":[{"en":"He spent years eking his savings into a down payment.","zh":"他花了很多年一点点攒钱凑首付。"}]}],"synonyms":["scraping by","getting by","making ends meet","stretching","rationing"],"phonetic":"/ˈiːkɪŋ/","extraExplanation":["“eke”在现代英语里多见于固定搭配 **eke out**（勉强维持；省着用撑过去）。单独用“eke”作动词也可以，但语气更偏书面或略带文学感。","含义里常带“资源不足、处境不易”的情绪色彩；比起 just enough（刚好够），**eke out** 更强调“费力、拮据、将就着过”。"]}
{"word":"ekistic","summary":{"en":"Ekistic means “related to ekistics,” the study and planning of human settlements.","zh":"ekistic 指“与聚居学/人居学有关”，即研究与规划人类聚居地的学科。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to ekistics—the study and planning of human settlements (how people live in communities, cities, and regions).","zh":"与“聚居学/人居学”（研究与规划人类聚居地：社区、城市、区域等）有关的。"},"examples":[{"en":"The course covers ekistic issues such as housing, transportation, and public space.","zh":"这门课讨论住房、交通与公共空间等人居（聚居学）相关议题。"},{"en":"An ekistic approach looks at a city as a living system shaped by people and place.","zh":"人居（聚居学）视角把城市看作由人与环境共同塑造的“生命系统”。"}]}],"synonyms":["settlement-related","urban-planning-related","human-settlements (related)"],"phonetic":"/ɪˈkɪs.tɪk/","extraExplanation":["“ekistic”来自“ekistics”（聚居学/人居学），常与希腊裔城市规划学者康斯坦丁诺斯·A·多克西阿迪斯（C. A. Doxiadis）相关；他在20世纪中期推动把聚居地当作跨学科对象研究，结合规划、社会学、经济与环境等。","在英语中该词较少见，更多出现在学术写作、城市规划与人居研究语境；日常口语里通常会说“urban planning / settlement studies / human settlements”。"]}
{"word":"ekistics","summary":{"en":"Ekistics is the study of human settlements and how they function and develop.","zh":"Ekistics 指研究人类聚落及其运作与发展的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of human settlements (cities, towns, villages) and how they are planned, built, and managed, including social, economic, and environmental factors","zh":"人类聚落学：研究人类聚居地（城市、城镇、村落）如何被规划、建造与治理的学科，涵盖社会、经济与环境等因素"},"examples":[{"en":"Ekistics looks at how housing, transportation, and public space shape everyday life in a city.","zh":"人类聚落学研究住房、交通与公共空间如何塑造城市中的日常生活。"},{"en":"The course combined ekistics with urban planning and sustainability.","zh":"这门课程把人类聚落学与城市规划、可持续发展结合起来。"}]}],"synonyms":["settlement studies","urban studies","urban planning (related)"],"phonetic":"/ɪˈkɪstɪks/","extraExplanation":["“Ekistics”较少见，多用于学术语境，常与 urban planning（城市规划）、human geography（人文地理）、sustainable development（可持续发展）等领域一起出现。","词源来自希腊语 oikos（家/居所）。该术语在20世纪由希腊规划学者康斯坦丁诺斯·多克西阿迪斯（Constantinos A. Doxiadis）推广，用来强调以“聚落”为中心的跨学科研究视角。"]}
{"word":"ekka","summary":{"en":"“Ekka” is Queensland slang for Brisbane’s annual Royal Queensland Show (the Exhibition).","zh":"“Ekka”是昆士兰俚语，指布里斯班一年一度的昆士兰皇家展览会（Exhibition）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian, especially Queensland) the Royal Queensland Show (an annual agricultural fair in Brisbane), often called “the Exhibition.”","zh":"（澳大利亚俚语，尤指昆士兰）指“昆士兰皇家展览会”（布里斯班一年一度的农业博览会），也常简称为“展览会”。"},"examples":[{"en":"We’re going to the Ekka this weekend to see the showbags and rides.","zh":"我们这周末要去逛 Ekka，去买福袋、坐游乐设施。"},{"en":"Ekka day is a big deal in Brisbane, and some people even get a public holiday.","zh":"在布里斯班，“Ekka 日”很重要，有些人甚至还能放公共假日。"}]}],"synonyms":["the Exhibition","Royal Queensland Show"],"phonetic":"/ˈɛkə/","extraExplanation":["“Ekka”是澳洲口语缩写，来自“Exhibition”的澳式发音/习惯省略，主要在昆士兰使用；外地人有时不熟悉这个称呼。","Ekka常见活动包括农畜比赛、展览、游乐项目、烟花，以及很有代表性的“showbags”（装着零食和小商品的福袋）。"]}
{"word":"ekle","summary":{"en":"“Ekle” is Turkish for “add.”","zh":"“Ekle”是土耳其语，意思是“添加”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Turkish) “Add; include; attach.” Often seen as a button/command in apps meaning “Add.”","zh":"（土耳其语）“添加；加入；附加”。常见于应用/网站按钮或指令中，意思是“添加”。"},"examples":[{"en":"Click “Ekle” to add a new item.","zh":"点击“Ekle”来添加一个新项目。"},{"en":"Ekle the photo to your profile.","zh":"把这张照片添加到你的个人资料里。"}]}],"synonyms":["add","include","attach"],"phonetic":"/ˈekleɪ/","extraExplanation":["“Ekle”来自土耳其语动词“eklemek”（添加、补充）。在土耳其语界面里，你经常会看到：Ekle（添加）、Sil（删除）、Kaydet（保存）。如果你是在学习英语，它最接近的常用词是 add / include。"]}
{"word":"Ekleipsis","summary":{"en":"Ekleipsis is a rare term from Greek meaning either an ellipsis (omission of words) or, less commonly, an eclipse.","zh":"Ekleipsis 是源自希腊语的少见词，可指“省略（ellipsis）”，也可较少见地指“日食/月食（eclipse）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an omission of one or more words that are understood from context (a rhetorical or grammatical “ellipsis”); also used as a rare spelling of “ellipsis” in some contexts","zh":"（修辞/语法）省略：把一个或多个词省去，但意思可由上下文推知；在一些语境中也可作为“ellipsis”的少见拼写形式"},"examples":[{"en":"In conversation, “Want some?” is an ekleipsis of “Do you want some?”","zh":"在口语中，“Want some?” 省略了 “Do you want some?”，这就是一种 ekleipsis（省略）。"},{"en":"The editor noted an ekleipsis in the sentence and suggested making it explicit for clarity.","zh":"编辑注意到句子里有省略，并建议把省略的内容写出来以提高清晰度。"}]},{"partOfSpeech":"n.","definition":{"en":"an eclipse (especially in older or Greek-influenced usage)","zh":"日食或月食（“eclipse”的古老或受希腊语影响的用法）"},"examples":[{"en":"Ancient writers sometimes described a sudden darkness as an ekleipsis of the sun.","zh":"古代作者有时会把突然变暗描述为“太阳的 ekleipsis（日食）”。"}]}],"synonyms":["ellipsis","omission","eclipse"],"phonetic":"/ɪˈklaɪpsɪs/","extraExplanation":["这个词来自希腊语 ἔκλειψις（ekleipsis），原意与“缺失/离开”有关，因此既能指“（天体）被遮蔽的缺失”（eclipse），也能引申为“语言成分的缺失”（ellipsis）。","现代英语里更常用的拼写是 ellipsis（省略）和 eclipse（日食/月食）；ekleipsis 多见于讨论古希腊文本、修辞学或词源时。"]}
{"word":"Ekoi","summary":{"en":"Ekoi refers to an ethnic group in southeastern Nigeria and southwestern Cameroon, and also to the language(s) they speak.","zh":"Ekoi 指尼日利亚东南部与喀麦隆西南部的埃科伊族群，也可指他们所说的埃科伊语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (ethnic group) living mainly in southeastern Nigeria and southwestern Cameroon.","zh":"埃科伊人：主要居住在尼日利亚东南部和喀麦隆西南部的一个民族（族群）。"},"examples":[{"en":"The Ekoi live around the Cross River region of Nigeria and Cameroon.","zh":"埃科伊人主要生活在尼日利亚和喀麦隆的克罗斯河流域。"},{"en":"Some museum collections include Ekoi masks and carved figures.","zh":"一些博物馆藏品中有埃科伊人的面具和雕刻人像。"}]},{"partOfSpeech":"n.","definition":{"en":"the Niger-Congo language(s) spoken by the Ekoi people (often grouped with or referred to as Ejagham).","zh":"埃科伊语：埃科伊人使用的尼日尔-刚果语系语言（常与“埃贾加姆语 Ejagham”归为一类或互称）。"},"examples":[{"en":"She is learning Ekoi to talk with her grandparents.","zh":"她在学埃科伊语，好和祖父母交流。"},{"en":"Ekoi has several related varieties spoken across the Nigeria–Cameroon border.","zh":"埃科伊语在尼日利亚—喀麦隆边境两侧有若干相近的方言/变体。"}]}],"synonyms":["Ejagham","Ejagham people","Ejagham language"],"phonetic":"/ɛˈkɔɪ/","extraExplanation":["“Ekoi”在学术与日常用法中有时会与“Ejagham（埃贾加姆）”互用或并列使用；不同资料可能更偏好其中一个名称。若你是在书名、博物馆说明、或历史人类学文本里看到“Ekoi”，通常指族群与其相关文化（如面具艺术与仪式传统）。"]}
{"word":"ekoi","summary":{"en":"Ekoi refers to a people in southeastern Nigeria and southwestern Cameroon, and also to their language (often linked with the Ejagham/Ekoi language group).","zh":"Ekoi 指尼日利亚东南部与喀麦隆西南部的埃科伊人，也可指他们使用的语言（常与 Ejagham/Ekoi 语言群相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people living mainly in southeastern Nigeria and southwestern Cameroon; sometimes used more broadly for related groups in the Cross River region","zh":"埃科伊人：主要居住在尼日利亚东南部和喀麦隆西南部的民族；有时也泛指克罗斯河地区相关族群"},"examples":[{"en":"The Ekoi people are known for their rich masking traditions and local art forms.","zh":"埃科伊人以丰富的面具传统和地方艺术形式而闻名。"},{"en":"Some historical accounts describe trade between the Ekoi and neighboring communities along the Cross River.","zh":"一些历史记载描述了埃科伊人与克罗斯河沿岸邻近社群之间的贸易往来。"}]},{"partOfSpeech":"n.","definition":{"en":"the language spoken by the Ekoi people (often classified under the Ejagham/Ekoi language cluster)","zh":"埃科伊语：埃科伊人使用的语言（常归入埃贾哈姆/埃科伊语支或语言群）"},"examples":[{"en":"She is learning Ekoi to communicate with her grandparents.","zh":"她正在学习埃科伊语，以便和祖父母交流。"},{"en":"Researchers have recorded Ekoi folktales to preserve oral history.","zh":"研究者录制了埃科伊语民间故事，以保存口述历史。"}]}],"synonyms":["Ejagham","Cross River peoples"],"phonetic":"/ˈɛkɔɪ/","extraExplanation":["“Ekoi”在不同资料中可能指民族、语言，或更广义的地区族群称呼；学术写法也常见与“Ejagham（埃贾哈姆）”并用或互指，具体要看语境与研究分类。","在英文中它通常作专有名词使用（首字母大写：Ekoi）。"]}
{"word":"ekphore","summary":{"en":"Ekphore means to bring something out or bring it forth, often used of drawing out memories or hidden content.","zh":"Ekphore 指把某物带出/引出，常用于“引出记忆或隐藏内容”的语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To bring out, carry out, or bring forth (something), especially from concealment or from the mind (e.g., a memory).","zh":"（罕见）把（某物）带出、取出或引出；尤指从隐藏处或从心智中引出（如记忆）。"},"examples":[{"en":"The therapist used questions to ekphore long-buried memories.","zh":"治疗师用提问来引出深埋已久的记忆。"},{"en":"A single photograph can ekphore feelings you didn’t know you still had.","zh":"一张照片就能引出你没意识到仍然存在的情绪。"}]}],"synonyms":["bring forth","draw out","evoke","elicit","retrieve"],"phonetic":"/ɛkˈfɔr/","extraExplanation":["“ekphore”多见于学术或专业语境，来源于希腊语词根：ek-（向外）+ pherein（携带）。因此核心意象是“把东西带出来/带到外面”。","在心理学/精神病学里更常见的是相关形容词“ekphoric”（引发回忆的；与记忆提取有关），例如“ekphoric recall”（线索诱发回忆）。","容易与“ekphrasis”（对艺术作品的生动文字描写）混淆；两者词形相近但意义不同。"]}
{"word":"ekphoria","summary":{"en":"Ekphoria is a rare noun meaning an emotional “release” that comes from expressing feelings outward.","zh":"Ekphoria 是个较少见的名词，指通过把情绪向外表达而产生的“宣泄/释放感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling of sudden release (often emotional) that comes from expressing something strongly—sometimes described as a “letting out” of tension through words, tears, or outburst.","zh":"一种突然的“释放感”（常为情绪上的），来自强烈表达某事；可理解为通过言语、哭泣或爆发把紧张与压抑“宣泄出来”。"},"examples":[{"en":"After weeks of staying silent, she felt a wave of ekphoria when she finally told the truth.","zh":"沉默了好几个星期后，她终于说出真相时感到一阵强烈的宣泄与释放（ekphoria）。"},{"en":"The therapist said crying can bring ekphoria—an emotional release that helps the body relax.","zh":"治疗师说哭泣可能带来 ekphoria——一种能让身体放松的情绪释放。"}]}],"synonyms":["catharsis","release","emotional release","letting it out"],"phonetic":"/ɛkˈfɔːriə/","extraExplanation":["这个词比较罕见，多见于心理学/精神医学语境。它来自希腊语词根：ek-（向外）+ phorein（携带、带出），核心意象是“把东西带出来/释放出来”。","不要和更常见的“euphoria（欣快感）”混淆：euphoria 强调愉悦高涨；ekphoria 更强调情绪或压力的“外泄/宣泄”，不一定快乐，也可能带着悲伤或激动。","在日常英语里，人们更常用 catharsis（情感宣泄/净化）、release（释放）、letting it out（把情绪说出来/发泄出来）来表达类似意思。"]}
{"word":"ekphorias","summary":{"en":"Ekphoria means the act of recalling or retrieving a memory (plural: ekphorias).","zh":"Ekphoria 指“记忆的唤出/提取”过程（复数：ekphorias）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Psychology, linguistics) The act of bringing a memory out—recalling or retrieving information, often triggered by a cue (an “ekphoric cue”).","zh":"（心理学、语言学）“唤出/提取记忆”的过程：把记忆从脑中“带出来”，常由某个线索触发（称为 ekphoric cue“唤出线索”）。"},"examples":[{"en":"A familiar song served as an ekphoric cue, leading to an ekphoria of childhood memories.","zh":"一首熟悉的歌成了“唤出线索”，引发了对童年记忆的唤出。"},{"en":"In the interview, the photos helped trigger ekphorias that the witness could describe in detail.","zh":"在访谈中，照片帮助触发了证人对往事的多次“记忆唤出”，使他能更详细地描述。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A strong outpouring or release (of thoughts, feelings, speech).","zh":"（罕见）强烈的倾吐、迸发或释放（思想、情感或言语）。"},"examples":[{"en":"The letter reads like an ekphoria of grief and relief mixed together.","zh":"这封信读起来像是悲伤与释然交织的情感倾吐。"}]}],"synonyms":["memory retrieval","recall","recollection"],"phonetic":"/ɛkˈfɔriə/","extraExplanation":["“ekphorias”是名词复数形式；单数是“ekphoria”。在学术写作中更常见的是搭配“ekphoric cue”（唤出线索）来谈记忆如何被提示与提取。","词源上来自希腊语：ek-（向外）+ pherein（携带/带出），字面意思接近“把东西带出来”，因此很适合用来描述“把记忆从脑中带出来”的过程。"]}
{"word":"ekphorize","summary":{"en":"“Ekphorize” means to portray something vividly in words, often like an ekphrasis of art or a scene.","zh":"“Ekphorize”指用文字生动细致地描写事物，常用于像“艺术描写/画面描写（ekphrasis）”那样把画面写出来。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to describe something (especially a work of art, a scene, or an object) in vivid, detailed language; to put it into words so the listener can “see” it","zh":"（尤指对艺术品、场景或物体）用生动细致的语言描写；把画面“写出来”"},"examples":[{"en":"In her essay, she ekphorized the painting so clearly that I could imagine every color and shadow.","zh":"在她的文章里，她把那幅画描写得非常清楚，我仿佛能想象出每一种颜色和阴影。"},{"en":"The poet ekphorized the old temple, turning stone and silence into a living image.","zh":"诗人把那座古寺写得栩栩如生，让石头与寂静都变成了有生命的画面。"}]}],"synonyms":["depict","portray","describe vividly","paint with words","evoke"],"phonetic":"/ˈɛkfəˌraɪz/","extraExplanation":["这个词非常少见，主要出现在文学/修辞学讨论中，和更常见的名词 ekphrasis（对艺术作品或场景的文字描写）同源。","词根来自希腊语：ek-（“向外”）+ phrazein（“说明、表达”），核心感觉是“把画面从作品里‘说出来/写出来’”。更日常的表达通常用 describe vividly / portray / depict。"]}
{"word":"ekphory","summary":{"en":"Ekphory is a psychology term meaning the retrieval of a stored memory into conscious awareness, often prompted by a cue.","zh":"Ekphory 是心理学术语，指在提示线索作用下将储存的记忆提取到意识中的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of bringing a stored memory (a memory trace) back into awareness; memory retrieval or recall, often triggered by a cue","zh":"（心理学）把已储存的记忆（记忆痕迹）重新带回意识中的过程；常由线索触发的记忆提取/回忆"},"examples":[{"en":"A familiar smell can act as a cue that triggers ekphory of childhood memories.","zh":"熟悉的气味可以作为线索，触发对童年记忆的“提取/回忆”（ekphory）。"},{"en":"In this model, the cue helps ekphory by matching details in the stored memory trace.","zh":"在这个模型中，线索通过与储存的记忆痕迹相匹配来促进记忆提取（ekphory）。"}]}],"synonyms":["memory retrieval","recall","remembrance"],"phonetic":"/ˈɛkfəˌri/","extraExplanation":["该词较少出现在日常英语中，多用于认知心理学/记忆研究语境。常见搭配是“ekphory of a memory trace（对记忆痕迹的提取）”“cue-dependent ekphory（线索依赖的提取）”。","词源来自希腊语，含义接近“把……带出来”。可以把它理解为“记忆被‘唤出/调出’的那一步”。日常表达通常用更常见的 recall / retrieval。"]}
{"word":"ekpwele","summary":{"en":"“Ekpwele” is most commonly a Nigerian personal name, not an English word with a standard dictionary meaning.","zh":"“Ekpwele”最常见于尼日利亚人名/姓氏语境，并非具有固定词典释义的英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (usually a surname, sometimes a given name), most often found in Nigeria; not a standard English vocabulary word.","zh":"人名（多为姓氏，有时也作名字），多见于尼日利亚；不是标准英语词汇。"},"examples":[{"en":"I found “Ekpwele” listed as a family name in an online directory.","zh":"我在一个在线名录里看到“Ekpwele”被列为一个姓氏。"},{"en":"Ms. Ekpwele will join the meeting at 3 p.m.","zh":"Ekpwele 女士将于下午三点参加会议。"}]}],"synonyms":["(no direct English synonym; it functions as a name)"],"phonetic":"/ɛkˈpweɪleɪ/","extraExplanation":["“Ekpwele”在英语里通常不作为普通词使用，更常见于人名/姓氏语境，因此它本身在英英词典里一般查不到固定词义。","如果你是在文章、歌词、电影或社交媒体里看到它，发音和含义可能取决于具体语言来源与地区拼写。你可以把原句或上下文发来，我可以更准确判断它是人名、地名，还是某种语言中的词。"]}
{"word":"ekpweles","summary":{"en":"“ekpweles” isn’t an English word in standard usage; please provide context or a corrected spelling.","zh":"“ekpweles”不是标准英语词；请提供语境或更正拼写以便确认含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word; it may be a misspelling, a name, or a random string.","zh":"不是常见或可识别的英文单词；可能是拼写错误、人名/用户名，或随机字母串。"},"examples":[{"en":"I can’t find “ekpweles” in standard English dictionaries—could you check the spelling?","zh":"我在常见英文词典里找不到“ekpweles”，你能确认一下拼写吗？"},{"en":"If you meant a similar word, tell me the context sentence and I can help identify it.","zh":"如果你想表达的是一个相近的词，把完整语境句子发我，我可以帮你判断。"}]}],"extraExplanation":["“ekpweles”看起来不像英语构词（没有常见前缀/后缀或音节组合），更像是：\n1）键盘误触（例如把相邻键按错）；\n2）某个专有名词（网名、游戏ID、地名、人名的拼写变体）；\n3）把其他语言的词用拉丁字母随意拼写。\n\n你可以提供：\n- 你看到它的网页/截图（或前后一句话）；\n- 你猜可能的正确拼法；\n- 它来自哪个领域（游戏、社交平台、课本等）。\n我就能更准确地帮你定位它可能想写的英文词或短语。"]}
{"word":"Ekron","summary":{"en":"Ekron is the name of an ancient Philistine city, known mainly from biblical and historical contexts.","zh":"Ekron（以革伦）是古代非利士人的城名，主要出现在《圣经》及历史语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Philistine city in the southern Levant, often mentioned in the Bible; today its site is generally identified with Tel Miqne (in modern Israel).","zh":"以革伦：古代非利士人的一座城邦，常见于《圣经》记载；其遗址一般认为对应今日的特勒米克内（Tel Miqne，位于现代以色列）。"},"examples":[{"en":"Ekron was one of the five major Philistine cities mentioned in the Bible.","zh":"以革伦是《圣经》中提到的非利士五大城之一。"},{"en":"Archaeologists often connect Ekron with the site known as Tel Miqne.","zh":"考古学家常把以革伦与名为特勒米克内的遗址联系起来。"}]}],"synonyms":["Tel Miqne"],"phonetic":"/ˈɛkrən/","extraExplanation":["“Ekron”多见于宗教、历史与考古语境，日常英语里很少单独出现。阅读《圣经》或古代近东史时更常遇到。","在《列王纪下》里，以革伦与“以革伦的神巴力西卜（Baʿal-zebub）”有关；在后来的传统中，这个名字在英语文化里也会被联想到“Beelzebub”（常被译作别西卜）。","发音提示：重音在第一音节（EK-），后面是轻读的 -ron。"]}
{"word":"ekron","summary":{"en":"Ekron is a proper noun: an ancient Philistine city known from the Bible, also used today for the archaeological site linked to that city.","zh":"Ekron 是专有名词：指《圣经》中提到的古代非利士城邦“以革伦”，现代也常用来指与之对应的考古遗址。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Philistine city mentioned in the Hebrew Bible (Old Testament), located in the southern Levant (in the region of ancient Canaan).","zh":"《希伯来圣经》（《旧约》）中提到的非利士人城邦之一，位于南黎凡特（古迦南地区一带）。"},"examples":[{"en":"Ekron is listed alongside other Philistine cities such as Gaza and Ashdod.","zh":"《圣经》中常把以革伦（Ekron）与迦萨（Gaza）、亚实突（Ashdod）等其他非利士城一起提到。"},{"en":"According to the biblical narrative, people went to Ekron to consult its deity.","zh":"按《圣经》叙事，有人曾去以革伦求问当地的神明。"}]},{"partOfSpeech":"n.","definition":{"en":"A place-name used in modern geography and archaeology to refer to the site traditionally identified with ancient Ekron (often linked with Tel Miqne in Israel).","zh":"现代地理与考古学中的地名用法，指传统上被认为对应古代以革伦的遗址（常与以色列的米克内土丘 Tel Miqne 相联系）。"},"examples":[{"en":"Archaeologists have excavated the site identified with Ekron to learn about Philistine culture.","zh":"考古学家发掘被认为是以革伦的遗址，以研究非利士人的文化。"},{"en":"Some museum labels note Ekron (Tel Miqne) as an important Iron Age center.","zh":"一些博物馆说明牌会写“以革伦（Tel Miqne）”是铁器时代的重要中心。"}]}],"synonyms":["(no close synonyms; related: Philistine city, Tel Miqne"],"phonetic":"/ˈɛkrɑn/","extraExplanation":["“Ekron”多作为专有名词出现，常见于宗教文本、历史读物与考古资料中；中文常译作“以革伦”（也见“以革伦城/以革伦人”的说法）。","如果你原本想查的是别的拼法（如人名/品牌/地名的其他形式），告诉我上下文句子，我可以帮你确认正确词形与含义。"]}
{"word":"Ekronite","summary":{"en":"Ekronite means a person from Ekron or something related to Ekron, an ancient Philistine city mentioned in the Bible.","zh":"Ekronite 指“以革伦人”，或“与以革伦有关的”；以革伦是《圣经》中提到的古代非利士城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Ekron, an ancient Philistine city mentioned in the Bible","zh":"以革伦人；来自以革伦（《圣经》中提到的古代非利士城市）的人"},"examples":[{"en":"In the Old Testament, an Ekronite might be described as living among the Philistines.","zh":"在《旧约》中，“以革伦人”可能被描述为生活在非利士人之中。"},{"en":"The story mentions Ekronites worshiping their local god.","zh":"故事提到以革伦人敬拜他们的地方神明。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Ekron or its people","zh":"以革伦的；与以革伦或其居民有关的"},"examples":[{"en":"Archaeologists study Ekronite pottery styles to learn about daily life.","zh":"考古学家研究以革伦式（以革伦相关的）陶器风格，以了解日常生活。"},{"en":"The text refers to an Ekronite city as one of the Philistine centers.","zh":"文中把以革伦城称为非利士人的中心之一。"}]}],"synonyms":["(no common modern synonym; sometimes paraphrased as “a person from Ekron”)"],"phonetic":"/ˈɛkroʊ.naɪt/","extraExplanation":["“Ekronite”来自地名 Ekron（以革伦）+ 后缀 -ite（常表示“某地的人/与某地有关的”，如 Israelite 以色列人、Moabite 摩押人）。","以革伦在《圣经》中常与“非利士五城”相关；因此这个词多见于宗教文本、历史研究或考古语境，而在日常英语中很少使用。"]}
{"word":"ekronite","summary":{"en":"“Ekronite” is not a standard English word; it is likely a coined/proper name (often resembling a mineral name).","zh":"“Ekronite”不是标准英语常用词；很可能是造词或专有名词（形式上像矿物名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A term that does not appear in major English dictionaries; it is likely a proper name or a coined word (for example, the name of a fictional mineral/material, a brand, or a place/person name).","zh":"一个不常见、未收入主流英语词典的词；很可能是专有名词或人为造词（例如虚构矿物/材料名称、品牌名，或地名/人名）。"},"examples":[{"en":"In the game’s lore, ekronite is described as a rare crystal used to power engines.","zh":"在这款游戏的设定里，ekronite 被描述为一种稀有水晶，用来驱动引擎。"},{"en":"I couldn’t find “ekronite” in a dictionary—do you have a sentence or source for it?","zh":"我在词典里找不到“ekronite”——你能提供它出现的句子或出处吗？"}]}],"phonetic":"/ˈɛk.roʊ.naɪt/","extraExplanation":["从构词上看，后缀 **-ite** 在英语里常见于“矿物/岩石名称”（如 *granite* 花岗岩、*graphite* 石墨）或“某种物质/成员”（如 *Israelite*）的命名形式。所以 **ekronite** 很像“某种矿物/材料”的名字，但具体含义需要依赖出处（小说、游戏设定、科研文章、品牌等）。","如果你把它出现的上下文（一句话、截图或链接）发我，我可以帮你判断它是：虚构设定词、专有名词拼写变体、还是某个专业领域的术语。"]}
{"word":"Ekstrom","summary":{"en":"Ekstrom is mainly a Swedish-origin surname (also spelled Ekström).","zh":"Ekstrom 主要是一个源自瑞典的姓氏（也写作 Ekström）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Swedish-origin surname (family name), also written as Ekström; used as a last name for people and sometimes for places, companies, or brands named after a person or family","zh":"一个源自瑞典的姓氏，也常写作 Ekström；用于人名的姓，有时也会出现在以人名/家族命名的地名、公司或品牌中"},"examples":[{"en":"Her last name is Ekstrom, and her family is from Sweden.","zh":"她的姓是 Ekstrom，她的家族来自瑞典。"},{"en":"I found an article written by Dr. Ekstrom.","zh":"我找到了一篇由 Ekstrom 博士写的文章。"}]}],"synonyms":["Ekström"],"phonetic":"/ˈɛkstrəm/","extraExplanation":["Ekström 中的 “ö” 是瑞典语字母；在英语环境里常被简写成 “o”，所以你会看到 Ekström 和 Ekstrom 两种拼法。","这个姓氏通常可拆解理解为：ek-（与“橡树”相关）+ ström（“溪流/水流”），大意类似“橡树林旁的水流/溪”。作为姓氏时不必逐字翻译，只要知道是姓即可。"]}
{"word":"Ektachrome","summary":{"en":"Ektachrome is Kodak’s color slide (reversal) film, and it can also refer to the distinctive color style associated with it.","zh":"Ektachrome 是柯达的彩色反转片（幻灯片胶片）品牌，也可指这种胶片的典型色彩风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for Kodak color reversal (slide) film known for vivid, realistic color and fine detail; also used to describe the look made with this film","zh":"（柯达）Ektachrome：一种彩色反转片（幻灯片胶片）品牌，以色彩鲜明、还原自然和细节清晰著称；也可指这种胶片带来的影像风格"},"examples":[{"en":"She shot the road trip on Ektachrome and projected the slides at home.","zh":"她用 Ektachrome 拍了公路旅行，回家把幻灯片投影出来看。"},{"en":"The documentary uses an Ektachrome look to evoke the 1970s.","zh":"这部纪录片用类似 Ektachrome 的影像风格来唤起 20 世纪 70 年代的氛围。"}]}],"synonyms":["color slide film","reversal film","transparency film","slide film"],"phonetic":"/ˈɛktəˌkroʊm/","extraExplanation":["Ektachrome 是 Kodak（柯达）的商标名，常被归类为“反转片/正片”（reversal film, slide film）：冲洗后直接得到正像透明片，适合投影观看；与更常见的彩色负片（color negative film）不同。","在摄影文化里，“Ektachrome”常让人联想到对比适中、色彩清透、偏自然的色调（当然具体效果也会因年代、批次、冲洗与扫描方式而变化）。","词名中的 “-chrome” 与“颜色”相关（见于 chroma 等词根）；品牌名整体更像商业命名，不是普通英语构词。"]}
{"word":"ektene","summary":{"en":"Ektene is an Orthodox litany—a sequence of repeated petitions and responses in worship.","zh":"Ektene 指东正教礼仪中的“连祷”，即礼拜中反复的祈求与应答。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox/Byzantine Christianity) A litany: a series of short petitions and responses said or sung in a church service.","zh":"（东正教/拜占庭礼仪）连祷（祈求文）：在礼拜中由执事/会众反复应答的一连串简短祈求与回应。"},"examples":[{"en":"During the service, the deacon led an ektene, and the people responded, “Lord, have mercy.”","zh":"礼拜中，执事带领连祷，会众回应：“主啊，怜悯。”"},{"en":"The priest began the ektene for peace and for those in need.","zh":"司祭开始为和平与困苦者的连祷。"}]}],"synonyms":["litany","supplication","petition"],"phonetic":"/ɛkˈtiːni/","extraExplanation":["“ektene”多见于东正教语境，也常写作“ektenia”。词源与希腊语有关，含有“迫切、恳切”的意味，因此这种连祷常带有恳切祈求、反复呼求的风格。","在英语里它属于较专门的宗教用语；如果一般语境想表达“连祷/反复祈求”，更常用 litany。"]}
{"word":"ektenes","summary":{"en":"Ekténes means “earnestly, fervently,” a rare formal adverb often found in religious or solemn contexts.","zh":"ektenes 意为“恳切地、热切地”，是较罕见的正式副词，常见于宗教或庄重语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare, formal) Earnestly and intensely; with deep feeling, often used in religious or solemn writing (from Greek).","zh":"（罕见，正式）恳切而强烈地；发自内心地（常见于宗教或庄重语境，源自希腊语）。"},"examples":[{"en":"They prayed ektenes for peace and healing.","zh":"他们恳切地祈祷，求得和平与医治。"},{"en":"The poet speaks ektenes of love and loss.","zh":"诗人深切地谈论爱与失去。"}]}],"synonyms":["earnestly","fervently","sincerely","intensely"],"phonetic":"/ɛkˈtiːniːz/","extraExplanation":["这个词多见于东正教/希腊语传统相关的英文写作中，带有“热切、迫切、虔诚”的语气。现代日常英语很少用；更常见的替换词有：earnestly, fervently, sincerely, intensely。","词源来自希腊语 ἐκτενῶς（ektenōs，“热切地”）。在宗教语境里，你也可能见到相关词根的形式，如 ektenia（连祷文/恳祷）。"]}
{"word":"ektexine","summary":{"en":"Ektexine is the outer layer of a pollen or spore’s exine (outer wall).","zh":"Ektexine 指花粉或孢子外壁（exine）最外侧的一层结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the outer part of the exine (the tough outer wall) of a pollen grain or spore; also called ectexine.","zh":"（花粉粒或孢子）外壁（exine）中靠外侧的一层结构；也称 ectexine（外外壁/外壁外层）。"},"examples":[{"en":"Under the microscope, the ektexine shows a patterned surface that helps identify the plant species.","zh":"在显微镜下，ektexine 常呈现有规律的表面纹饰，有助于鉴定植物种类。"},{"en":"Damage to the ektexine can make pollen more vulnerable to drying out.","zh":"ektexine 受损会使花粉更容易失水而受影响。"}]}],"synonyms":["ectexine","sexine (related term)","exine (broader term)"],"phonetic":"/ˌɛkˈtɛk.saɪn/","extraExplanation":["在花粉学（palynology）里，花粉壁常分为外壁 exine 与内壁 intine。exine 又可细分为外侧的 ectexine/ektexine 与内侧的 endexine（内外壁）。许多花粉表面的刺、网状纹等“花粉纹饰”主要来自 ektexine，因此在植物分类与古环境研究中很重要。"]}
{"word":"ektexines","summary":{"en":"Ektexines are the outer layers of the exine (outer wall) of pollen grains or spores.","zh":"Ektexines 指花粉粒或孢子外壁（exine）的外层结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the outer layer of the exine (the tough outer wall) of a pollen grain or spore; the part often showing sculptured patterns","zh":"（花粉粒或孢子外壁的）外外壁层；属于外壁（exine）的外层，常呈现纹饰/雕纹结构"},"examples":[{"en":"Under the microscope, the ektexines showed a spiny, sculptured surface.","zh":"在显微镜下，花粉的外外壁层呈现带刺的雕纹表面。"},{"en":"Differences in ektexines can help scientists identify plant species from pollen.","zh":"外外壁层的差异可以帮助科学家通过花粉来鉴定植物种类。"}]}],"synonyms":["outer exine layer","ectexine (variant spelling)"],"phonetic":"/ˌɛkˈtɛk.saɪnz/","extraExplanation":["该词多见于植物学/孢粉学（palynology）文献中。exine 是花粉“外壁”的总称，而 ektexine 指其中更靠外的那一层；相对地，内层常称为 endexine。很多植物的花粉表面纹理（如网状、刺状）主要由 ektexine 的结构决定。"]}
{"word":"ektodynamorphic","summary":{"en":"A very rare adjective meaning “shaped by external forces.”","zh":"一个非常罕见的形容词，意为“受外力塑形的/由外部力量决定形态的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare / technical) Describing something whose shape or form is influenced or shaped by external (outside) forces.","zh":"（非常罕见/技术用语）形容某物的形状或形态受到外部力量影响或被外力塑造。"},"examples":[{"en":"In his notes, the researcher used “ektodynamorphic” to describe tissues whose final form depended on external pressure.","zh":"在笔记里，研究者用“ektodynamorphic”来描述那些最终形态取决于外部压力的组织。"},{"en":"The author contrasted an ektodynamorphic pattern (shaped from outside) with an internally driven growth pattern.","zh":"作者将“ektodynamorphic”模式（由外部塑形）与内部驱动的生长模式作了对比。"}]}],"synonyms":["externally shaped","extrinsically formed","molded by external forces"],"phonetic":"ˌɛktoʊˌdaɪnəˈmɔrfɪk","extraExplanation":["这个词在常见英语词典中几乎查不到，更多像是非常专业的造词或拼写变体。理解时可以用词根拆解来“推断大意”：ecto- 表示“外部”，dynamo-/dynam- 表示“力量/动态”，-morphic 表示“形态/成形”。如果你是在论文、实验记录或某本书里看到它，建议同时核对上下文或确认是否为拼写（例如 ecto- / ekto-）或专门学科术语。"]}
{"word":"EKTS","summary":{"en":"EKTS is an initialism with no single standard meaning in English; it’s often context-dependent and sometimes a typo for ECTS.","zh":"EKTS 是一个没有统一标准含义的首字母缩写，含义依语境而定，也常被误写为 ECTS。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (letters read one by one). “EKTS” is not a single standard English word; it can refer to different things depending on the field, and it is sometimes a typo for “ECTS” (European Credit Transfer and Accumulation System).","zh":"一个首字母缩写（逐个字母读）。EKTS 不是一个统一标准的英语单词；它在不同领域可能代表不同含义，也常被当作 “ECTS（欧洲学分转换与累积体系）” 的误写。"},"examples":[{"en":"I saw “EKTS” in a document, but the context suggests they meant “ECTS” credits.","zh":"我在文件里看到 “EKTS”，但从上下文看他们可能是想写 “ECTS” 学分。"},{"en":"Before you translate EKTS, check what industry the text is about.","zh":"在翻译 EKTS 之前，先确认文本属于哪个行业。"}]},{"partOfSpeech":"other","definition":{"en":"(Pharma/logistics, less common) Used in some materials as a label related to Estimated Kinetic Temperature (usually written “EKT”), especially in temperature-controlled shipping/storage discussions.","zh":"（制药/物流，较少见）在一些资料中用作与“估算动力学温度（通常写作 EKT）”相关的标记，常见于温控运输/仓储讨论。"},"examples":[{"en":"The report mentions EKTS alongside temperature excursions during shipment.","zh":"报告在提到运输中的温度偏移时也提到了 EKTS。"},{"en":"Ask the supplier whether EKTS here is linked to EKT calculations.","zh":"可以问供应商这里的 EKTS 是否与 EKT 的计算有关。"}]}],"phonetic":"/ˌiː keɪ tiː ˈɛs/","extraExplanation":["由于 “EKTS” 不是英语里公认的固定缩写，它的真实含义高度依赖上下文（例如：教育、物流、制药、某个机构名称等）。如果你把看到 EKTS 的完整句子或截图发来，我可以根据语境给出更准确的释义与对应翻译。","读法通常按字母读：E-K-T-S。"]}
{"word":"ekuele","summary":{"en":"Ekuele is usually a proper name (a person’s name), not a standard English word.","zh":"Ekuele 通常是专有名词（人名/姓氏），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (first name or surname), most commonly seen in West African contexts; it refers to a person or family name rather than a common English vocabulary word.","zh":"专有名词（名字或姓氏），常见于西非语境；它通常指人名/家族名，而不是英语里的常用词汇。"},"examples":[{"en":"Dr. Ekuele will speak at the conference tomorrow.","zh":"Ekuele 博士明天将在会议上发言。"},{"en":"I met someone named Ekuele at my new job.","zh":"我在新工作中遇到一个叫 Ekuele 的人。"}]}],"synonyms":["(no direct synonyms; it is a name)"],"phonetic":"/ˌɛkuˈeɪleɪ/","extraExplanation":["“Ekuele”不是常见英语单词，更像是人名/姓氏的拼写。如果你是在某个句子、歌曲、品牌、或某种语言（如尼日利亚/喀麦隆等地区语言）里看到的，请把原句或来源发我，我可以帮你判断它的准确含义、语言来源与更自然的英文表达。","英文里遇到不熟悉的专有名词时，通常不翻译其“词义”，而是确认：①是否为人名/地名/品牌；②正确拼写与重音；③在句子中的功能（称呼、署名、引用等）。"]}
{"word":"Ekwok","summary":{"en":"Ekwok is a small city and Alaska Native village in southwestern Alaska.","zh":"Ekwok 是美国阿拉斯加州西南部的一座小城镇与原住民村落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small city and Alaska Native village in the Dillingham Census Area of southwestern Alaska, USA.","zh":"美国阿拉斯加州西南部（迪灵厄姆人口普查区）的一座小城镇，也是阿拉斯加原住民村落。"},"examples":[{"en":"Ekwok is located along the Nushagak River in southwest Alaska.","zh":"Ekwok 位于阿拉斯加西南部的努沙加克河沿岸。"},{"en":"She traveled to Ekwok to visit family in the village.","zh":"她前往 Ekwok 探望村里的家人。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"/ˈiːkwɑk/","extraExplanation":["Ekwok 多作为地名使用（专有名词），常见于阿拉斯加地图、旅行信息、政府统计与地方新闻中。","该地区与 Yup’ik（尤皮克）等原住民族群的文化传统相关；如果在正式写作中提到 Ekwok，通常会补充其所在河流或区域以便读者定位。"]}
