{"word":"enb","summary":{"en":"ENB most often means a gaming graphics-enhancement mod/framework; in other fields it can be an acronym with context-specific meaning.","zh":"ENB最常指游戏中的画面增强Mod/框架；在其他领域也可能是语境特定的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(initialism, mainly gaming) A type of graphics modification and post-processing framework used to improve lighting, color, and visual effects in some PC games (often called an “ENB preset”).","zh":"（首字母缩写，主要用于游戏）一种用于某些PC游戏的画面后期/图形增强修改框架，可改善光照、色彩与特效（常称“ENB预设”）。"},"examples":[{"en":"I installed an ENB to make the game’s lighting look more realistic.","zh":"我装了一个ENB，让游戏的光照看起来更真实。"},{"en":"This ENB preset boosts contrast and makes nights much darker.","zh":"这个ENB预设提高了对比度，也让夜晚更暗。"},{"en":"My computer runs hot when I use an ENB, so I lowered the settings.","zh":"我用ENB时电脑很烫，所以我把设置调低了。"}]},{"partOfSpeech":"n.","definition":{"en":"(initialism, less common) A short label used in some technical or organizational contexts to refer to a specific group, system, or project named “ENB.” (Meaning depends on the field.)","zh":"（首字母缩写，较少见）在某些技术或组织语境里，用来指代名为“ENB”的某个机构/系统/项目的简称（具体含义取决于领域）。"},"examples":[{"en":"Check the ENB report for the latest performance numbers.","zh":"查看ENB报告，了解最新的性能数据。"},{"en":"Our team is migrating the service to ENB next quarter.","zh":"我们团队计划在下个季度把服务迁移到ENB。"}]}],"synonyms":["graphics mod","post-processing preset","shader preset"],"phonetic":"/ˌiːɛnˈbiː/","extraExplanation":["“ENB”在英语网络里最常见的用法来自游戏圈，尤其是老滚（Skyrim）等作品的画质增强工具与预设。通常会搭配说法：ENB preset / ENB settings / ENB mod。","如果你本来想找的是“enby”（/ˈɛnbi/），那是对“nonbinary（非二元性别）”的口语称呼，拼写一般是 enby，而不是 enb。你可以告诉我你指的是哪个，我可以按那个词条再详细解释。"]}
{"word":"enbaissing","summary":{"en":"“Embarrassing” describes something that makes you feel awkward or ashamed, or a situation that is awkward/troublesome.","zh":"“Embarrassing”指“令人尴尬的/难为情的”，也可指“棘手、让人难处理的情况”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing someone to feel shy, awkward, or ashamed in a social situation","zh":"令人尴尬的；让人难为情的"},"examples":[{"en":"It was embarrassing when I forgot her name.","zh":"我忘了她的名字，真尴尬。"},{"en":"He told an embarrassing story about his first day at school.","zh":"他讲了一个关于自己上学第一天的尴尬故事。"},{"en":"There’s nothing embarrassing about asking for help.","zh":"寻求帮助一点也不丢人。"}]},{"partOfSpeech":"adj.","definition":{"en":"difficult or problematic in a way that creates trouble or awkwardness","zh":"棘手的；让人难处理的（会带来麻烦或不便）"},"examples":[{"en":"We’re in an embarrassing situation because we don’t have enough money.","zh":"我们处境很棘手，因为钱不够。"},{"en":"The report revealed some embarrassing mistakes in the plan.","zh":"报告揭示了这个计划里一些令人难堪的错误。"}]}],"synonyms":["awkward","humiliating","mortifying","cringe-worthy","uncomfortable"],"phonetic":"/ɪmˈbærəsɪŋ/","extraExplanation":["你输入的“enbaissing”很可能是拼写错误，更常见的正确拼写是 **embarrassing**。","**embarrassing** 来自动词 **embarrass**（使尴尬/使为难）。在英语里，-ing 形容词通常描述“事物/情况让人产生的感觉”（embarrassing = 让人尴尬的）；而 -ed 形容词描述“人的感受”（embarrassed = 感到尴尬的）。例如：*I’m embarrassed.*（我很尴尬） vs. *That was embarrassing.*（那很尴尬）"]}
{"word":"enbibe","summary":{"en":"Imbibe means to drink (especially alcohol) or to absorb something such as ideas or qualities.","zh":"Imbibe 指“饮用（尤指酒）”，也可指“吸收/接受（观念、信息或品质）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to drink (especially alcohol)","zh":"饮用（尤指酒精饮料）"},"examples":[{"en":"They imbibed wine late into the night.","zh":"他们喝葡萄酒喝到深夜。"},{"en":"He doesn’t imbibe often, but he had a beer at the party.","zh":"他不常喝酒，但在聚会上喝了一杯啤酒。"}]},{"partOfSpeech":"v.","definition":{"en":"to absorb or soak up (an idea, information, or a quality)","zh":"吸收；接受（观点、信息或某种品质）"},"examples":[{"en":"Children quickly imbibe new words from their parents.","zh":"孩子会很快从父母那里吸收新词。"},{"en":"She imbibed a love of music from her grandfather.","zh":"她从祖父那里培养（吸收）了对音乐的热爱。"}]}],"synonyms":["drink","consume","absorb","take in","soak up"],"phonetic":"/ɪmˈbaɪb/","extraExplanation":["你输入的 **enbibe** 很可能是拼写误差；正确拼写通常是 **imbibe**。","**imbibe** 语气偏正式，写作或新闻里更常见；口语里常用 **drink**（喝）或 **learn/absorb**（吸收）。","常见搭配：**imbibe alcohol**（饮酒）、**imbibe deeply**（痛饮/大量吸收）、**imbibe the culture/values**（吸收文化/价值观）。词源来自拉丁语 *bibere* “to drink”（也与 *biblical* 无关）。"]}
{"word":"enbloc","summary":{"en":"En bloc means “as a whole, all together,” often used for groups voting or acting as one unit.","zh":"en bloc 指“作为整体、全体一起”，常用于描述群体统一投票或一致行动。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"As a single unit; all together; as a whole group rather than separately.","zh":"作为一个整体；全体一起；不分开地（而不是分别地）。"},"examples":[{"en":"The committee voted en bloc to approve the proposal.","zh":"委员会全体一致投票通过了该提案。"},{"en":"The neighborhood opposed the plan en bloc.","zh":"社区整体一致反对这项计划。"},{"en":"The firm sold its overseas assets en bloc instead of selling them one by one.","zh":"公司把海外资产打包整体出售，而不是逐一出售。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Politics/business) A group acting together, especially voting together as one bloc.","zh":"（政治/商业）作为一个集团联合行动，尤指作为一个阵营统一投票。"},"examples":[{"en":"Several smaller parties formed an en bloc voting alliance.","zh":"几个小党组成了一个统一投票的联盟。"},{"en":"The delegates agreed to negotiate en bloc rather than individually.","zh":"代表们同意以集团方式谈判，而不是各自单独谈判。"}]}],"synonyms":["as a whole","all together","collectively","in a block","in a body"],"phonetic":"/ɑn ˈblɑk/","extraExplanation":["“en bloc”来自法语，字面意思是“成块地/成整体地”。英语里多用于政治、投票、谈判或资产出售等语境，强调“作为一个整体一起行动/处理”，有时也带有“统一立场”的含义。","写法上常见为 en bloc（两词、斜体可有可无），也有人写成 enbloc 或 en-bloc，但在正式英文里 en bloc 更常见。"]}
{"word":"enbranglement","summary":{"en":"“Enbranglement” is a rare/nonstandard word meaning a tangled or complicated involvement; in most cases, “entanglement” is the standard word to use.","zh":"“Enbranglement”是罕见且非标准的用法，大意是“纠缠、牵连、复杂的卷入”；通常应使用标准词“entanglement”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) a state of being tangled, caught up, or complicated; an entanglement or involvement in something difficult.","zh":"（罕见/非标准用法）被缠住、牵连或事情变得复杂的状态；类似“纠缠、牵连、卷入困境”。"},"examples":[{"en":"The paperwork became an enbranglement of forms, signatures, and delays.","zh":"这些文件手续变成了一团“enbranglement”（各种表格、签名和拖延纠缠在一起）。"},{"en":"He tried to avoid any enbranglement in the office politics.","zh":"他尽量避免卷入办公室政治的纠葛。"}]}],"synonyms":["entanglement","involvement","complication","embroilment"],"phonetic":"/ɛnˈbræŋɡəlmənt/","extraExplanation":["“enbranglement”不是常见的标准英语拼写，你在字典里通常查不到。大多数情况下，它可能是把 **entanglement**（纠缠、牵连）和 **embranglement/embarrassment/entanglement** 一类词混写，或是作者为了幽默/风格化而造的词。","如果你想表达日常英语里的“纠缠/牵连”，更自然的选择是：**entanglement**（最常用）、**involvement**（卷入）、**complication**（复杂化）、**embroilment**（卷入麻烦，较正式）。","发音这里按拼写给出近似读法；但在真实语境中，人们更可能使用并读 **entanglement**。"]}
{"word":"enbrave","summary":{"en":"“Embrave” is a rare verb meaning “to make (someone) brave; to embolden.”","zh":"“embrave”是一个罕见动词，意思是“使某人勇敢；鼓舞/使更有胆量”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To make someone brave; to encourage or embolden someone to face danger or difficulty.","zh":"（罕见/古语）使某人变得勇敢；鼓舞、激励某人去面对危险或困难。"},"examples":[{"en":"The captain’s calm words seemed to embrave the young sailors.","zh":"船长镇定的话似乎让那些年轻水手更有勇气。"},{"en":"Hardship can embrave a person, teaching them to endure and act with courage.","zh":"艰难困苦可能会使人更勇敢，教会他们忍耐并勇敢行动。"}]}],"synonyms":["embolden","encourage","hearten","steel","fortify"],"phonetic":"/ɪmˈbreɪv/","extraExplanation":["“embrave”在现代英语里非常少见，更多时候人们会用更常见的词：**embolden**（使更大胆/更有勇气）、**encourage**（鼓励）、**hearten**（使振作）。","词形上可理解为“使……变得brave（勇敢）”，属于带有古风/文学色彩的表达；在当代写作中用它可能会显得刻意或复古。"]}
{"word":"Enbrel","summary":{"en":"Enbrel is the brand name of etanercept, a TNF-blocking biologic used for several autoimmune inflammatory diseases.","zh":"Enbrel 是依那西普（etanercept）的商品名，一种抑制 TNF 的生物制剂，用于多种自身免疫性炎症疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for etanercept, a prescription biologic medicine that blocks tumor necrosis factor (TNF) and is used to treat certain autoimmune inflammatory diseases (such as rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis, plaque psoriasis, and some cases of juvenile idiopathic arthritis).","zh":"英夫利（Enbrel）的商品名：依那西普（etanercept），一种处方生物制剂，通过抑制肿瘤坏死因子（TNF）来治疗部分自身免疫性炎症疾病（如类风湿关节炎、银屑病关节炎、强直性脊柱炎、斑块型银屑病，以及部分幼年特发性关节炎）。"},"examples":[{"en":"My doctor prescribed Enbrel to help control my rheumatoid arthritis symptoms.","zh":"医生给我开了 Enbrel 来帮助控制类风湿关节炎的症状。"},{"en":"Enbrel is usually given as an injection, not a pill.","zh":"Enbrel 通常以注射方式使用，不是口服药片。"},{"en":"Before starting Enbrel, patients are often screened for tuberculosis.","zh":"在开始使用 Enbrel 之前，通常会先筛查结核感染。"}]}],"synonyms":["etanercept","TNF inhibitor","biologic (medicine)"],"phonetic":"/ˈɛnbrɛl/","extraExplanation":["Enbrel 是“生物制剂（biologic）”，并非传统化学小分子药；多用于免疫系统过度活跃导致的炎症性疾病。","由于会抑制免疫反应，使用期间感染风险可能增加；临床上常会在用药前评估结核/乙肝等感染风险，具体以医生指导为准。","Enbrel 属于 TNF 抑制剂（TNF inhibitor）一类；同类药还有 adalimumab（Humira）、infliximab（Remicade）等，但适应症、给药方式与个体反应可能不同。"]}
{"word":"enbusshe","summary":{"en":"“enbusshe” is not a standard word; it most likely means “ambush” (a surprise attack or to attack/surprise suddenly).","zh":"“enbusshe”不是标准英语词；很可能是“ambush”，表示“伏击/突然袭击”，也可引申为“突然围住提问/让人措手不及”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling of “ambush.”","zh":"这不是标准英语单词；很可能是“ambush”的拼写错误。"},"examples":[{"en":"I couldn’t find “enbusshe” in a dictionary—did you mean “ambush”?","zh":"我在词典里找不到“enbusshe”——你是不是想写“ambush”？"}]},{"partOfSpeech":"n.","definition":{"en":"(ambush) A surprise attack from a hidden place.","zh":"（ambush）伏击：从隐蔽处发起的突然袭击。"},"examples":[{"en":"The soldiers walked carefully to avoid an ambush.","zh":"士兵们小心行进以避免遭遇伏击。"},{"en":"The hikers were warned about bandits who might set an ambush on the road.","zh":"有人提醒徒步者注意路上可能会有匪徒设伏。"}]},{"partOfSpeech":"vt.","definition":{"en":"(ambush) To attack someone suddenly from a hidden position; more generally, to surprise someone with questions or attention.","zh":"（ambush）伏击；（引申）突然“围住”某人提问/采访，让人措手不及。"},"examples":[{"en":"The police ambushed the suspect as he left the building.","zh":"嫌疑人离开大楼时，警方对他实施了伏击。"},{"en":"Reporters ambushed the actor outside the hotel.","zh":"记者在酒店外突然围住那位演员采访。"}]}],"synonyms":["attack","assault","trap","waylay","surprise"],"phonetic":"/ˈæm.bʊʃ/","extraExplanation":["“Ambush”常用于军事/犯罪语境，也常用于日常引申义：比如被记者、同事突然追问，让人来不及准备。","如果你想表达“忙得不可开交/很忙”，可能想写的是“busy”。如果你想表达“尴尬/害羞”，可能是“embarrassed”。可以告诉我你想表达的中文意思，我可以帮你选最贴切的英文词。"]}

