{"word":"ene","summary":{"en":"ENE usually means “east-northeast,” a compass direction between east and northeast.","zh":"ENE通常指“东东北”，即介于正东与东北之间的方位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbrev.) east-northeast: a compass direction between east (E) and northeast (NE), about 67.5° from north.","zh":"（缩写）东东北：罗盘上介于正东（E）与东北（NE）之间的方向，约为从正北起顺时针67.5°。"},"examples":[{"en":"The wind is ENE at 15 knots.","zh":"风向为东东北，风速15节。"},{"en":"Sail ENE to reach the next island before sunset.","zh":"向东东北航行，争取在日落前到达下一个岛。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) a spelling seen as an abbreviation in some languages (e.g., Spanish “ene” = the letter N), but this is not standard in English.","zh":"（较少见）在某些语言中可作缩写或称呼（如西班牙语“ene”指字母N），但这不是英语中的标准用法。"},"examples":[{"en":"In Spanish, “ene” names the letter N.","zh":"在西班牙语里，“ene”是字母N的名称。"}]}],"synonyms":["east-northeast","E-NE"],"phonetic":"/ˌiːɛnˈiː/","extraExplanation":["“ENE”常见于航海、气象预报、航空与户外地图的方位标注（16方位罗盘）。它比“NE”更精确：NE是45°，ENE是67.5°。"]}
{"word":"ENEA","summary":{"en":"ENEA is most commonly an acronym for an Italian energy/technology agency; it can also be an Italian given name.","zh":"ENEA 最常指意大利能源与新技术相关的机构缩写；也可作意大利人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Acronym) An Italian public agency focused on energy, new technologies, and sustainable economic development; its Italian name is “Agenzia nazionale per le nuove tecnologie, l'energia e lo sviluppo economico sostenibile.”","zh":"（缩写）意大利的公共机构，主要从事能源、新技术与可持续经济发展；其意大利语全称为 “Agenzia nazionale per le nuove tecnologie, l'energia e lo sviluppo economico sostenibile”。"},"examples":[{"en":"ENEA published a report on renewable energy trends in Italy.","zh":"ENEA 发布了一份关于意大利可再生能源趋势的报告。"},{"en":"The project was carried out in partnership with ENEA.","zh":"该项目与 ENEA 合作开展。"}]},{"partOfSpeech":"other","definition":{"en":"A given name (mostly Italian); sometimes seen as a modern form related to the classical name “Aeneas.”","zh":"人名（多见于意大利）；有时被视为与古典名字 “Aeneas（埃涅阿斯）”相关的现代形式。"},"examples":[{"en":"Enea is a popular boy’s name in Italy.","zh":"Enea 是意大利比较常见的男孩名字。"},{"en":"In the novel, Enea struggles to live up to his father’s expectations.","zh":"在小说中，Enea 努力想达到父亲的期望。"}]}],"synonyms":["(acronym) Italian National Agency for New Technologies, Energy and Sustainable Economic Development"],"phonetic":"/ˈɛn.i.ə/","extraExplanation":["ENEA 在英语语境里最常见是机构缩写，写作全大写。读法在不同地方不完全一致：有的人按字母逐个读（E-N-E-A），也有人读成一个音节串（类似“EN-ee-uh”）。","如果你指的是古典人物“埃涅阿斯”，英语更常用拼写 Aeneas（源自拉丁语/希腊语），与 ENEA（缩写/人名拼写）不同。"]}
{"word":"enecate","summary":{"en":"Enecate is an archaic verb meaning to kill (often by starving or suffocating) or, figuratively, to exhaust completely.","zh":"enecate 是一个古语动词，意为杀死（常指饿死或窒息致死），也可作比喻表示使精疲力尽。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To kill or destroy someone, especially by suffocating, starving, or exhausting them.","zh":"（古语）使…死亡；杀死（尤指通过窒息、饥饿或极度疲惫而致死）。"},"examples":[{"en":"In old writings, the tyrant was said to enecate his prisoners by denying them food.","zh":"在一些旧文献里，据说暴君通过不给食物来使囚犯饿死。"},{"en":"The harsh winter nearly enecated the livestock when fodder ran out.","zh":"当饲料耗尽时，严冬几乎把牲畜都饿死了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative, archaic) To drain the life or strength from; to wear out completely.","zh":"（比喻，古语）耗尽…的精力/生命力；使筋疲力尽。"},"examples":[{"en":"Endless worry can enecate the spirit over time.","zh":"无尽的忧虑久而久之会耗尽人的精神。"},{"en":"He wrote that constant labor enecated the workers’ strength.","zh":"他写道，持续的劳作耗尽了工人的力气。"}]}],"synonyms":["kill","starve","suffocate","smother","exhaust"],"phonetic":"/ˈɛnɪˌkeɪt/","extraExplanation":["“enecate”在现代英语中非常少见，多见于早期英文文本或仿古写作。日常表达更常用：kill, starve, suffocate, exhaust 等。","词源可追溯到拉丁语 enecare（“杀死、使窒息”）。因此它常带有“通过窒息/饥饿/折磨而致死”的语感，比一般的 kill 更具体、更阴暗。","阅读古典或早期文学时见到它，可以先根据上下文判断是“致死（饥饿/窒息）”还是“把人耗垮”的比喻用法。"]}
{"word":"eneclann","summary":{"en":"“eneclann” is not recognized as a standard English word; it’s likely a misspelling or a proper name/foreign term.","zh":"“eneclann”不是标准英语单词；更可能是拼写错误或专有名词/外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/term from another language.","zh":"不是标准英语单词。可能是拼写错误，或是其他语言中的词/专有名词。"},"examples":[{"en":"I couldn’t find “eneclann” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“eneclann”——你能把它出现的句子发我吗？"},{"en":"If you meant “clean” or “enclan(n)” (a name), please confirm the correct spelling.","zh":"如果你想写的是“clean”，或“enclan(n)”（人名/名称），请确认正确拼写。"}]}],"extraExplanation":["“eneclann”在常见英语词典（学习者词典/通用词典）中不作为词条出现，因此更可能是：\n1）拼写错误（例如把某个常见词打乱或多打/少打字母）；\n2）专有名词（人名、地名、游戏/小说设定名）；\n3）来自其他语言（如盖尔语/爱尔兰语等）的词形。\n\n为了帮你准确解释，请你提供：\n- 它出现的上下文句子或截图；\n- 你想表达的中文意思；\n- 是否来自游戏、小说、家族姓氏或地名。"]}
{"word":"ened","summary":{"en":"“ened” is not standard English; it’s usually a misspelling (often of “need” or “ended”).","zh":"“ened”不是规范英语单词，通常是拼写错误（常见为“need”或“ended”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard word in modern English; most often seen as a typo or misspelling (commonly for “need” or “ended”).","zh":"现代英语中不是规范单词；最常见于拼写错误（常把 “need” 或 “ended” 拼错成它）。"},"examples":[{"en":"I ened help. (Incorrect) → I need help.","zh":"I ened help.（错误）→ I need help.（我需要帮助。）"},{"en":"The meeting ened at 5. (Incorrect) → The meeting ended at 5.","zh":"The meeting ened at 5.（错误）→ The meeting ended at 5.（会议五点结束。）"}]}],"phonetic":"/ɛnɛd/","extraExplanation":["“ened”在常见英语词典里一般查不到。如果你是在某篇文章、歌词或聊天记录里看到的，可能是打字快漏了字母（例如把 ended 的 d 漏了，或把 need 前面多/少了字母）。","如果你愿意，发一下原句（包含前后文），我可以帮你判断作者真正想表达的是哪个词。"]}
{"word":"enema","summary":{"en":"An enema is a medical treatment where liquid is put into the rectum to empty the bowels or prepare for a procedure; it can also mean to administer this treatment.","zh":"enema 指“灌肠”：把液体注入直肠以排空肠道或为检查/手术做准备；也可作动词表示“给……灌肠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical procedure in which liquid is put into the rectum to help empty the bowels (relieve constipation) or to prepare for a medical exam or surgery.","zh":"一种医疗操作：将液体注入直肠，以帮助排空肠道（缓解便秘）或为检查/手术做准备。"},"examples":[{"en":"The doctor recommended an enema before the colonoscopy.","zh":"医生建议在结肠镜检查前进行灌肠。"},{"en":"He was given an enema to relieve severe constipation.","zh":"他因严重便秘接受了灌肠来缓解。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give someone an enema; to wash out the bowel with liquid.","zh":"给某人灌肠；用液体冲洗肠道。"},"examples":[{"en":"The nurse enemaed the patient as instructed.","zh":"护士按医嘱给病人进行了灌肠。"}]}],"synonyms":["bowel irrigation","rectal washout"],"phonetic":"/ˈɛnəmə/","extraExplanation":["“enema”在日常英语里偏医学/护理语境，属于较私密的话题；更礼貌、常见的说法包括：\"have an enema\"（接受灌肠）或 \"give an enema\"（实施灌肠）。","常见相关词：\"constipation\"（便秘）、\"bowel movement\"（排便）、\"laxative\"（泻药）、\"colonoscopy\"（结肠镜检查）。"]}
{"word":"enemas","summary":{"en":"“Enemas” is the plural form of “enema,” meaning a medical procedure that flushes the bowel or delivers medicine through the rectum.","zh":"“enemas”是“enema”的复数，指灌肠：通过肛门将液体注入直肠/结肠，用于清洁肠道或给药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical procedure in which liquid is put into the rectum to clean out the bowel or to deliver medicine (plural of “enema”)","zh":"灌肠；将液体通过肛门注入直肠/结肠，用于清洁肠道或给药（“enema”的复数）"},"examples":[{"en":"The nurse prepared the enemas before the patient’s procedure.","zh":"护士在病人手术/检查前准备好了灌肠。"},{"en":"Some people use enemas to relieve severe constipation, but they should follow medical advice.","zh":"有些人用灌肠来缓解严重便秘，但应遵循医嘱。"},{"en":"The doctor explained the risks and benefits of enemas in simple terms.","zh":"医生用通俗的话解释了灌肠的利弊和风险。"}]}],"synonyms":["bowel irrigation","rectal infusion","bowel cleansing"],"phonetic":"ˈɛnəmə","extraExplanation":["“enema”属于医学用语，日常对话中也会出现，但通常在看病、护理、或讨论肠道清洁时使用。中文常说“灌肠”。","涉及健康与隐私，这个词在英语语境里可能让人觉得尴尬或很私人；在正式场合可用更中性的表达，如“a bowel prep（肠道准备）”或“a cleansing procedure（清洁处理）”。","不要把“enema”与“laxative（泻药）”混淆：泻药是口服/外用促排便的药物；灌肠是将液体直接注入直肠/结肠的操作。"]}
{"word":"enemata","summary":{"en":"“Enemata” is the formal/older plural of “enema” (more commonly: enemas).","zh":"“enemata”是“enema（灌肠）”较正式/较旧的复数形式（更常用：enemas）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “enema”: a medical treatment where liquid is put into the rectum (back passage) to help empty the bowels or deliver medicine.","zh":"“enema（灌肠）”的复数：一种医疗处理，将液体注入直肠（肛门内的通道）以帮助排便或给药。"},"examples":[{"en":"The doctor ordered enemata before the procedure.","zh":"医生在手术/检查前开了灌肠处理。"},{"en":"In older medical texts, you may see “enemata” instead of “enemas.”","zh":"在较早的医学文本中，你可能会看到用“enemata”而不是“enemas”。"}]}],"synonyms":["enemas"],"phonetic":"/ɪˈnɛmətə/","extraExplanation":["“Enemata”是较偏学术/古典的复数形式，源自希腊语的复数变化；在现代日常英语里，更常见、更口语的复数是“enemas”。","这个词多用于医学语境。一般学习者在非医学写作中使用“enemas”就足够了。"]}
{"word":"enemied","summary":{"en":"“Enemied” is a rare, literary word meaning “made hostile” or “treated as an enemy.”","zh":"“Enemied”是罕见的文学用词，意思是“被敌视／被当作敌人”或“变得敌对”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Treated as an enemy; made hostile or opposed.","zh":"（罕见／文学用法）被当作敌人对待的；被激起敌意的；敌对的。"},"examples":[{"en":"In the story, the hero feels enemied by the very people he tried to protect.","zh":"在故事里，英雄感到自己被那些曾试图保护的人当作敌人。"},{"en":"The reformer was enemied by powerful groups who feared change.","zh":"这位改革者遭到害怕改变的强势团体敌视。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) Past form of the verb “to enemy”: to oppose or act against as an enemy.","zh":"（罕见）动词“to enemy”的过去式：把……当作敌人；与……为敌；反对。"},"examples":[{"en":"They enemied his plan at every meeting.","zh":"他们在每次会议上都与他的计划为敌（处处反对）。"}]}],"synonyms":["hostile","opposed","antagonistic","treated as an enemy","beset (by enemies)"],"phonetic":"/ˈɛnəmid/","extraExplanation":["“enemied”在现代英语里非常少见，多见于较旧的文学或带古风的写作。日常表达通常用：hostile（敌对的）、opposed（反对的）、treated as an enemy（被当作敌人）、enemy-held（被敌方占领的）等。","如果你本来想写的是复数名词“enemies”（敌人们），拼写应为 enemies，而不是 enemied。"]}
{"word":"enemies","summary":{"en":"“Enemies” is the plural of “enemy,” meaning opponents who are against you, or anything that harms your success or well-being.","zh":"“enemies”是“enemy”的复数，指与你对立的敌人/对手，也可指妨碍成功或健康的有害因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or groups that are actively opposed to someone, causing harm or trying to defeat them; opponents.","zh":"敌人；对手：积极反对某人、试图伤害或击败对方的人或团体。"},"examples":[{"en":"In the story, the hero learns that not all enemies are truly evil.","zh":"在故事里，英雄明白了并不是所有敌人都真的邪恶。"},{"en":"The two countries were enemies for many years.","zh":"这两个国家多年为敌。"},{"en":"She refused to treat her classmates as enemies just because they disagreed.","zh":"她不愿因为意见不同就把同学当成敌人。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that is harmful to something; something that works against success or well-being.","zh":"有害之物；大敌：对某事有害、阻碍成功或幸福的人或事物。"},"examples":[{"en":"Stress can be an enemy of good sleep.","zh":"压力可能是良好睡眠的大敌。"},{"en":"Pride is sometimes an enemy of learning.","zh":"骄傲有时是学习的敌人。"}]}],"synonyms":["opponents","adversaries","rivals","foes"],"phonetic":"/ˈɛnəmiz/","extraExplanation":["“enemies”是“enemy”的复数形式。发音上注意：词尾 -ies 读作 /iz/。","常见搭配：make enemies（树敌），common enemy（共同的敌人），enemy territory（敌占区/敌方地盘），enemy of the state（国家的敌人；常见于政治语境，使用时需注意语气与文化敏感性）。","在文学里，“enemy”常不只指外在对手，也可指内在弱点（如恐惧、偏见、贪婪），用来表达成长与自我对抗的主题。"]}
{"word":"Enemy","summary":{"en":"An enemy is someone (or something) you fight against or strongly oppose.","zh":"Enemy 指你与之对抗、敌对的人/团体/国家，也可指阻碍或伤害你的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, group, or country that you fight against or strongly oppose.","zh":"敌人；对手；（与之作战或强烈对立的）个人、团体或国家。"},"examples":[{"en":"In the story, the hero must defeat his enemy to save the village.","zh":"在故事里，英雄必须打败敌人来拯救村庄。"},{"en":"During the war, the two countries called each other enemies.","zh":"战争期间，这两个国家互称为敌国（敌人）。"},{"en":"They were political enemies, but they still spoke politely in public.","zh":"他们是政治上的对手（敌人），但在公众场合仍然礼貌交谈。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that harms you or makes success difficult (often used in phrases like “the enemy of ...”).","zh":"有害之物；阻碍成功的因素（常用于“……的敌人”这类表达）。"},"examples":[{"en":"Fear is the enemy of progress.","zh":"恐惧是进步的敌人。"},{"en":"Poor sleep can be an enemy of good health.","zh":"睡眠不足可能是健康的大敌。"}]}],"synonyms":["opponent","rival","foe","adversary"],"phonetic":"/ˈɛnəmi/","extraExplanation":["“enemy”常用于对比“friend（朋友）”。更正式或更中性的“对手”可用“opponent / rival”，强调冲突或敌对时用“enemy”。","常见搭配：make an enemy（树敌）, common enemy（共同敌人）, sworn enemy（死敌）, the enemy of the good is the perfect（“完美是好的敌人”，指过度追求完美反而阻碍进步）。"]}
{"word":"enemy","summary":{"en":"An enemy is someone (or something) that opposes you or causes harm.","zh":"enemy 指“敌人/对手”，也可比喻“有害的不利因素”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, group, or country that is fighting against or strongly opposed to another; an opponent in conflict.","zh":"敌人；对手（指与另一方交战或强烈对立的人、团体或国家）"},"examples":[{"en":"They were once friends, but now they are enemies.","zh":"他们曾经是朋友，但现在成了敌人。"},{"en":"The two countries became enemies after the war started.","zh":"战争开始后，两国成了敌对国家。"},{"en":"In the story, the hero must defeat his enemy.","zh":"在故事里，英雄必须打败他的敌人。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that harms you or makes success difficult (for example, a condition, habit, or problem).","zh":"祸害；不利因素（指伤害你或让成功更困难的事物，如习惯、问题或状况）"},"examples":[{"en":"Fear can be your worst enemy.","zh":"恐惧可能是你最大的敌人。"},{"en":"Lack of sleep is an enemy of good health.","zh":"睡眠不足是健康的大敌。"},{"en":"In winter, ice on the roads is an enemy of safe driving.","zh":"冬天路面结冰是安全驾驶的敌人。"}]}],"synonyms":["opponent","foe","adversary","rival","antagonist"],"phonetic":"/ˈɛnəmi/","extraExplanation":["“enemy”既可用于真实冲突（国家、军队、对手），也常用于比喻（把抽象问题当作“敌人”来强调它的危害）。","常见搭配：make enemies（树敌）、common enemy（共同的敌人）、public enemy（公敌）、the enemy（敌军/对方阵营，常用于军事语境）。","词源上来自拉丁语 *inimicus*（不友好的），与“friend（朋友）”形成清晰对比。文学或叙事作品中常见“enemy”与“rival（竞争对手）”“villain（反派）”区分：rival更偏竞争，villain更强调邪恶角色。"]}
{"word":"enemying","summary":{"en":"“Enemying” is a rare/archaic form meaning “acting as an enemy; opposing.”","zh":"“Enemying”较罕见且偏古旧，意思是“像敌人一样对待；与……为敌/反对”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare/archaic) Present participle of “enemy”: treating someone as an enemy; opposing or acting against.","zh":"（罕见/古旧）“enemy”的现在分词：把某人当作敌人对待；与……为敌、反对或对抗。"},"examples":[{"en":"By enemying his neighbors, he turned small disagreements into lasting conflict.","zh":"他把邻居当敌人一样对待，把小分歧变成了长期冲突。"},{"en":"The two groups spent years enemying one another instead of negotiating.","zh":"这两个团体多年互相为敌，而不是坐下来谈判。"},{"en":"An enemying army marched toward the city.","zh":"敌对的军队向城市进军。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Used like an adjective: hostile; antagonistic.","zh":"（罕见）作形容词用：敌对的；充满敌意的。"},"examples":[{"en":"They faced enemying voices in the crowd.","zh":"他们面对人群中敌意的声音。"},{"en":"Her enemying attitude made teamwork difficult.","zh":"她敌对的态度让团队合作变得困难。"}]}],"synonyms":["opposing","antagonizing","fighting","hostile to","at odds with"],"phonetic":"/ˈɛnəmiɪŋ/","extraExplanation":["“enemy”在现代英语里主要是名词（enemy=敌人）。把它当动词用（to enemy=与……为敌/反对）比较古旧或文学化，所以“enemying”在当代写作中不常见。更自然的表达通常是：to oppose（反对）、to fight against（对抗）、to treat … as an enemy（把……当敌人）、to make an enemy of …（与……结仇）。"]}
{"word":"enemylike","summary":{"en":"Enemy-like means “hostile or behaving like an enemy.”","zh":"Enemy-like 指“像敌人一样的；带有敌意的、敌对的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling an enemy; hostile or unfriendly in attitude or behavior","zh":"像敌人一样的；带有敌意的，敌对的"},"examples":[{"en":"His tone became enemy-like as soon as the topic changed to money.","zh":"一谈到钱，他的语气立刻变得像敌人一样充满敌意。"},{"en":"They faced enemy-like resistance from people who didn’t trust outsiders.","zh":"他们遇到了不信任外来者的人们所表现出的敌对抵制。"}]}],"synonyms":["hostile","unfriendly","antagonistic","adversarial"],"phonetic":"/ˈɛnəmiˌlaɪk/","extraExplanation":["“enemy-like”更常见的写法是带连字符的形容词（enemy-like）。如果你看到“enemylike”连写，通常是非正式写法、网络用法，或是拼写/排版造成的。","表达“敌意的”时，英语里更常用的常见词还有 hostile、unfriendly、antagonistic；“enemy-like”更偏文学或强调“像敌人一样”的比喻色彩。"]}
{"word":"enemyship","summary":{"en":"Enemyship means a state of being enemies—hostility or enmity between people or groups.","zh":"Enemyship 指“成为敌人的状态/关系”，即人与人或团体之间的敌意与对立。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or relationship of being enemies; enmity or hostility between people or groups","zh":"敌对状态；敌对关系；仇恨（人与人或团体之间的敌意与对立）"},"examples":[{"en":"Years of enemyship between the two families finally ended after a public apology.","zh":"两家多年的敌对关系最终在一次公开道歉后结束了。"},{"en":"The treaty was meant to turn enemyship into cooperation.","zh":"这项条约旨在把敌对转变为合作。"},{"en":"Old enemyship can flare up again during stressful times.","zh":"旧日的敌意在压力大的时候可能会再次爆发。"}]}],"synonyms":["enmity","hostility","antagonism","animosity"],"phonetic":"/ˈɛnəmiʃɪp/","extraExplanation":["“enemyship”是一个比较少见的词，意义接近更常用的“enmity / hostility / antagonism”。在现代英语写作中，通常用这些更自然、更常见的词来表达“敌意/仇恨”。","后缀“-ship”常表示“某种状态、身份或关系”（如 friendship 友谊、leadership 领导地位）。因此 enemyship 字面上就是“敌人的关系/状态”。","在文学或较旧的文本里可能会看到 enemyship，用来强调“长期的对立关系”，带一点书面或古典的语感。"]}
{"word":"enent","summary":{"en":"Event: something that happens, especially an important or planned happening.","zh":"event：发生的事情；尤指重要的或计划好的事件/活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) something that happens; an important happening, especially one that is planned or public.","zh":"（可能想写的是）事件；发生的事情；（尤指）计划好的或公开的活动/大事。"},"examples":[{"en":"The concert is a major event in our city every summer.","zh":"这场音乐会是我们城市每年夏天的一项重要活动。"},{"en":"What time does the event start?","zh":"活动几点开始？"},{"en":"Winning the prize was a life-changing event for her.","zh":"获奖对她来说是改变人生的一件大事。"}]},{"partOfSpeech":"n.","definition":{"en":"One of several possible results in a situation (often used with probability, science, or math).","zh":"（常用于概率/数学/科学）事件：某种情况中可能发生的一种结果。"},"examples":[{"en":"In probability, getting heads is an event.","zh":"在概率里，掷出正面是一个事件。"},{"en":"Two events can happen at the same time.","zh":"两个事件可以同时发生。"}]}],"synonyms":["occasion","happening","incident","activity","function"],"phonetic":"/ɪˈvɛnt/","extraExplanation":["“enent”在英语里通常不是一个标准单词，很可能是把“event”拼错了（把v写成了n）。如果你想查的不是“event”，请告诉我你看到“enent”的句子或上下文。"]}
{"word":"enepidermic","summary":{"en":"Epidermic means “related to the epidermis,” the outer layer of skin, or “applied to the skin’s surface” in medical contexts.","zh":"epidermic 指“与表皮有关的（皮肤最外层）”，或在医学语境中指“作用于皮肤表面”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the epidermis (the outer layer of skin).","zh":"与表皮有关的；表皮层的（皮肤最外层）。"},"examples":[{"en":"Epidermic cells form the skin’s outer protective layer.","zh":"表皮细胞构成皮肤最外层的保护屏障。"},{"en":"The cream is designed for epidermic repair after mild irritation.","zh":"这种乳霜用于轻微刺激后的表皮修复。"}]},{"partOfSpeech":"adj.","definition":{"en":"(medical) applied to or affecting the surface of the skin.","zh":"（医学）作用于皮肤表面（而非更深层组织）的。"},"examples":[{"en":"The doctor recommended an epidermic antiseptic for the cut.","zh":"医生建议给伤口使用表皮用的消毒剂。"},{"en":"Epidermic treatment can help protect the skin barrier.","zh":"表皮治疗有助于保护皮肤屏障。"}]}],"synonyms":["epidermal","cutaneous","dermal (broader)","skin-related"],"phonetic":"/ˌɛpəˈdɝmɪk/","extraExplanation":["你输入的“enepidermic”很可能是拼写错误；更常见、标准的词是“epidermic”。","在现代英语里，“epidermic”相对偏医学/生物学用语；日常表达更常用“skin”相关说法（如 skin layer / on the skin）。","注意区分：epidermic（表皮的/皮肤表面的） vs. intradermal（皮内的） vs. subcutaneous（皮下的）。"]}
{"word":"ener","summary":{"en":"“ener” is usually an informal shorthand for “energy,” or a typo/incomplete form of “energy/energetic.”","zh":"“ener”通常是“energy”的非正式缩写，或是“energy/energetic”等词的拼写错误/未打完形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, internet slang) A shortened form of “energy,” especially in gaming/fitness chats to mean enthusiasm, stamina, or vibe.","zh":"（非正式/网络用语）“energy（能量/精力/气场）”的缩写，常见于游戏或健身聊天中，表示热情、体力或氛围。"},"examples":[{"en":"I don’t have the ener to play ranked tonight.","zh":"我今晚没那个精力打排位。"},{"en":"Bring good ener to the meeting—stay positive.","zh":"开会带点好气场——保持积极。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling or incomplete typing of “energy,” “energetic,” or words beginning with “ener-.”","zh":"可能是“energy（能量）”“energetic（精力充沛的）”或以“ener-”开头单词的拼写错误或未打完。"},"examples":[{"en":"Did you mean “energy” (ener + gy)?","zh":"你是想写“energy”吗（ener + gy）？"},{"en":"She’s very energetic. (not: ener)","zh":"她很有活力。（不是：ener）"}]}],"synonyms":["energy","vibe","stamina","enthusiasm"],"phonetic":"ˈɛnɚ","extraExplanation":["“ener-”这一部分来自与“能量/做功”相关的词源（如 energy, energetic）。在正式写作中不要用“ener”代替“energy”；它更像聊天里的省略写法。","如果你告诉我你看到“ener”的句子或领域（游戏/健身/学校作业/科学），我可以给出最准确的释义与替换词。"]}
{"word":"energeia","summary":{"en":"Energeia is a Greek-derived term meaning vivid, energetic expression in rhetoric, and “actuality” (active, realized being) in philosophy.","zh":"Energeia 源自希腊语：在修辞学中指语言的鲜活动感；在哲学中指“现实性/实现状态”（与潜能相对）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric) A style or quality of language that feels energetic and vivid—making actions seem alive and happening right now.","zh":"（修辞学）一种“有力、鲜活”的表达效果，使描写像正在发生一样，语言富有动感与冲击力。"},"examples":[{"en":"The poet writes with energeia, turning a simple walk into a scene full of motion and urgency.","zh":"这位诗人写作很有 energeia，把一次普通的散步写成充满动作与紧迫感的场景。"},{"en":"In public speaking, energeia can keep the audience attentive by making ideas feel immediate.","zh":"在公众演讲中，energeia 能让观点更有“当下感”，从而抓住听众注意力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Philosophy, especially Aristotle) Actuality or active being—something in action or fully realized, contrasted with potentiality.","zh":"（哲学，尤指亚里士多德）“现实性/实现状态/活动的存在”——事物处于运作或已实现的状态，与“潜能”相对。"},"examples":[{"en":"For Aristotle, learning can move from potentiality to energeia when a skill is actively used.","zh":"在亚里士多德那里，当技能被真正运用时，学习就从“潜能”走向 energeia（实现/现实状态）。"},{"en":"The seed is a tree in potential, but the grown tree is closer to energeia.","zh":"种子里的树是“潜在的”，而长成的大树更接近 energeia（实现的状态）。"}]}],"synonyms":["vividness","verbal energy","force (in expression)","actuality","activity"],"phonetic":"/ˌɛnərˈɡeɪə/","extraExplanation":["energeia 源自古希腊语，和英语的 energy（能量）有同源关系，但在修辞学里更强调“表达的动感与生动”，不只是“精力”。","学习时注意与 enargeia（常译“逼真、生动呈现”）容易混淆：两者都可谈“生动”，但 energeia 更突出“动作在进行、语言有推动力”的感觉；具体用法会随学派/译者而略有差异。","在文学批评中，它常用来评价描写是否“把场面写活了”。你也会在讨论亚里士多德《形而上学》或《修辞学》的文章里见到它。"]}
{"word":"energesis","summary":{"en":"Energesis is a rare noun meaning active operation or activity—something actually at work, producing effects.","zh":"Energesis 是一个罕用名词，指“正在起作用的运作/活动”，强调实际在发生并产生效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) activity or operation; the act of working or producing an effect.","zh":"（罕用）活动；运作；起作用、产生效果的过程。"},"examples":[{"en":"In some philosophical writing, energesis refers to an action that is actively happening, not just a potential ability.","zh":"在一些哲学写作中，energesis 指正在发生的行动，而不只是潜在的能力。"},{"en":"The author contrasts energesis (active operation) with mere possibility.","zh":"作者把 energesis（积极的运作）与单纯的可能性作对比。"}]}],"synonyms":["activity","operation","functioning","action","effectiveness"],"phonetic":"/ˌɛnɚˈdʒiːsɪs/","extraExplanation":["这个词在现代英语里非常少见，多见于哲学、神学或讨论希腊思想的语境。它来自希腊语词根，和更常见的 energy（能量）同源，都与“运作/活动”有关。日常表达通常用 activity, operation, functioning, effectiveness 等更常见的词。"]}
{"word":"energetic","summary":{"en":"Energetic means full of energy and life, or showing strong, active effort.","zh":"Energetic 指“精力充沛、充满活力”，也可指“积极有力的努力或行动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"full of energy; lively and active","zh":"精力充沛的；充满活力的；有朝气的"},"examples":[{"en":"She’s energetic in the morning and finishes her work quickly.","zh":"她早上精力很旺盛，很快就把工作做完了。"},{"en":"The energetic children ran around the playground.","zh":"精力充沛的孩子们在操场上跑来跑去。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing strong effort, force, or determination (often about actions, speaking, or leadership)","zh":"（常形容行动、讲话或领导）有力的；积极有为的；坚定果断的"},"examples":[{"en":"The mayor made an energetic effort to improve public transportation.","zh":"市长积极努力地改善公共交通。"},{"en":"Her energetic speech motivated the team.","zh":"她有力的演讲鼓舞了团队。"}]}],"synonyms":["lively","active","vigorous","spirited","dynamic"],"phonetic":"/ˌɛnɚˈdʒɛtɪk/","extraExplanation":["“Energetic”多用于形容人或行为风格（lively/active），也可形容“努力的程度”（energetic efforts）。它通常是褒义词；若想表达“吵闹、坐不住”的负面感觉，可用“hyperactive”或“too energetic”。","常见搭配：energetic person/child；energetic music/dance；energetic effort/campaign；stay energetic（保持精力）。"]}
{"word":"energetical","summary":{"en":"“Energetical” is a rare/older form meaning “energetic; full of energy.” Use “energetic” in modern English.","zh":"“energetical”是较少见/较旧的说法，意思是“精力充沛的”，现代英语一般用“energetic”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Full of energy; active and lively. (Often replaced by “energetic.”)","zh":"（少见）精力充沛的；活跃有活力的。（常用 energetic 代替）"},"examples":[{"en":"She is energetic, and older books might call her “energetical.”","zh":"她精力充沛；较旧的书里可能会用 energetical 来形容她。"},{"en":"The team made an energetic start to the project.","zh":"团队以充满干劲的姿态开始了这个项目。"}]}],"synonyms":["energetic","lively","active","vigorous"],"phonetic":"/ˌɛnɚˈdʒɛtɪkəl/","extraExplanation":["“energetical”在现代英语里很少见，更多出现在较旧的文本中，或被当作“energetic”的非标准变体。写作与考试中建议用更常见、更自然的“energetic”。","词根来自 energy（能量、精力）+ -ic（形容词后缀）。现代常见搭配：energetic person（精力充沛的人）、energetic music（充满活力的音乐）、energetic debate（激烈/热烈的辩论）。"]}
{"word":"energetically","summary":{"en":"“Energetically” means doing something in a lively, active way, with lots of energy or enthusiasm.","zh":"“energetically”表示做事很有活力、很积极，带着充沛的精力或热情。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an energetic, lively, and active way; with a lot of energy or enthusiasm.","zh":"精力充沛地；有活力地；热情地。"},"examples":[{"en":"The children ran energetically around the playground.","zh":"孩子们在操场上精力充沛地跑来跑去。"},{"en":"She spoke energetically about her new project.","zh":"她热情洋溢地谈起她的新项目。"},{"en":"The team worked energetically to meet the deadline.","zh":"团队干劲十足地工作以赶上截止日期。"}]}],"synonyms":["actively","vigorously","lively","briskly","enthusiastically"],"phonetic":"/ˌɛnɚˈdʒɛtɪkli/","extraExplanation":["“energetically”来自形容词“energetic”（精力充沛的）+ 副词后缀“-ally”。它常用来描述动作或说话方式，语气比“actively（积极地）”更强调“精力/活力”，比“enthusiastically（热情地）”更偏向“体力或精神上的能量”。"]}
{"word":"energeticalness","summary":{"en":"“Energeticalness” is a rare, nonstandard noun meaning “being energetic.” Use “energy,” “enthusiasm,” or “vitality” instead.","zh":"“Energeticalness”是少见且不太标准的名词，意思是“精力充沛/有活力”。更推荐用energy、enthusiasm或vitality等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) The quality of being energetic; liveliness and active energy.","zh":"（非标准/少见）精力充沛的特质；活力与积极的能量。"},"examples":[{"en":"Her energeticalness helped the whole team stay motivated during late nights.","zh":"她的“energeticalness”（充沛的干劲）让整个团队在熬夜时也保持动力。"},{"en":"The teacher’s energeticalness made the class feel more alive.","zh":"老师的“energeticalness”（活力）让课堂更有生气。"}]}],"synonyms":["energy","enthusiasm","vitality","liveliness","pep"],"phonetic":"/ˌɛnɚˈdʒɛtɪk(ə)lnəs/","extraExplanation":["“energeticalness”在现代英语里非常少见，也常被认为不够地道（nonstandard）。更自然的表达通常是：energy（精力/能量）、enthusiasm（热情）、vitality（活力）、liveliness（生气/活泼），或直接用形容词 energetic（精力充沛的）。","构词上它看起来像 energetic/energetical + -ness（表示“……的性质/状态”），但实际使用中英语更偏好用 energy 或 vitality 来表达这层意思。写作或正式场合建议避免使用该词。"]}
{"word":"energeticist","summary":{"en":"Energeticist is a rare noun meaning someone who works with or believes in “energetics,” sometimes used for energy-based wellness practitioners.","zh":"Energeticist 是个较少见的名词，指研究/信奉“能量学”的人；在身心灵语境里也可指从事能量疗愈等“能量工作”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies or works in “energetics” (the idea of explaining physical, biological, or psychological phenomena in terms of energy and its transformations).","zh":"研究或从事“能量学/能量论”（用能量及其转化来解释物理、生物或心理现象的一种观点或领域）的人。"},"examples":[{"en":"In early scientific writing, an energeticist might describe heat and work as different forms of energy.","zh":"在早期科学写作中，energeticist 可能会把热和功描述为不同形式的能量。"},{"en":"The book presents an energeticist view of metabolism, focusing on energy flow in the body.","zh":"这本书用能量学的视角解释新陈代谢，强调体内的能量流动。"}]},{"partOfSpeech":"n.","definition":{"en":"(More informal, especially in wellness contexts) A practitioner who claims to diagnose or treat problems through “energy work” (such as balancing or reading a person’s energy).","zh":"（较口语，常见于身心灵/健康圈）声称通过“能量疗愈/能量工作”（如平衡或读取个人能量）来诊断或改善问题的人。"},"examples":[{"en":"She consulted an energeticist for stress, alongside seeing a doctor.","zh":"她在看医生的同时，也找了一位 energeticist 做压力方面的辅助咨询。"},{"en":"Some spas advertise sessions with an energeticist, but the approach varies widely.","zh":"一些水疗馆会宣传有 energeticist 的服务，但具体方法差异很大。"}]}],"synonyms":["energetics researcher","energy theorist","energy practitioner","energy healer"],"phonetic":"/ˌɛnɚˈdʒɛtɪsɪst/","extraExplanation":["“energeticist”在现代英语里很少见，更常见的是：scientist who studies energetics（研究能量学的人）、energetics researcher（能量学研究者），或在身心灵语境里用 energy healer / energy practitioner（能量疗愈师/能量工作者）。","词形理解：energetic（有活力的/与能量有关的）+ -ist（从事者/信奉者）。注意它和常见词 energetic（adj. 精力充沛的）不是一回事。"]}
{"word":"energeticness","summary":{"en":"“Energeticness” means the quality of being energetic (energy, liveliness), but it’s uncommon; “energy” is usually more natural.","zh":"“energeticness”指精力充沛的特质（活力/朝气），但不常用；更自然的说法通常用“energy”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) The quality of being energetic; energy, liveliness, or enthusiasm.","zh":"（不常用）精力充沛的状态；活力、朝气或热情。"},"examples":[{"en":"I like the energeticness of this song—it makes me want to move.","zh":"我喜欢这首歌的那种活力——它让人想动起来。"},{"en":"Her energeticness helped the team stay focused during a long meeting.","zh":"她的活力让团队在漫长的会议中保持专注。"}]}],"synonyms":["energy","enthusiasm","liveliness","vigor","pep"],"phonetic":"/ˌɛnərˈdʒɛtɪknəs/","extraExplanation":["“energeticness”在日常英语里比较少见，听起来有点“生造词”。更自然、更常用的说法通常是：\n- energy（精力/能量）\n- enthusiasm（热情）\n- liveliness（活泼/生气勃勃）\n例如更地道：I like the energy of this song. / Her energy kept the team focused.\n在正式写作中也更建议用这些常见名词。"]}
{"word":"energetics","summary":{"en":"Energetics means the study of energy and how it changes in systems, and it can also mean the energy demands/balance of an activity or organism.","zh":"Energetics 指研究系统中能量及其变化的学科，也可指活动或生物体的能量需求/能量平衡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study of energy—how it is produced, transformed, stored, and used in a system (common in physics, chemistry, and biology).","zh":"能量学；研究能量如何产生、转化、储存与被系统利用的学科（常见于物理、化学、生物）。"},"examples":[{"en":"In chemistry, energetics helps explain why some reactions release heat.","zh":"在化学中，能量学有助于解释为什么有些反应会放热。"},{"en":"We discussed the energetics of muscle movement in biology class.","zh":"我们在生物课上讨论了肌肉运动的能量学。"}]},{"partOfSpeech":"n.","definition":{"en":"The energy demands and energy balance of an activity or organism (often in sports science and physiology).","zh":"（活动或生物体的）能量需求与能量平衡（常用于运动科学与生理学）。"},"examples":[{"en":"Endurance training changes the energetics of running.","zh":"耐力训练会改变跑步时的能量需求与能量平衡。"},{"en":"The paper compares the energetics of walking uphill versus on flat ground.","zh":"这篇论文比较了上坡走路和平地走路的能量消耗差异。"}]}],"synonyms":["energy science","energy studies","thermodynamics (related)"],"phonetic":"/ˌɛnɚˈdʒɛtɪks/","extraExplanation":["“Energetics”常以复数形式出现，但通常表示一个不可数的概念（类似“physics”“mathematics”），意思不是“很多种能量”，而是“关于能量的整体研究/框架”。","词根来自“energy（能量）”，学术写作中常见搭配：reaction energetics（反应能量学）、metabolic energetics（代谢能量学）、cellular energetics（细胞能量学）。"]}
{"word":"energetistic","summary":{"en":"Energetistic is an uncommon adjective meaning “energetic,” or (in academic contexts) “related to energetism.”","zh":"energetistic 是个不常见的形容词，可表示“有活力的”，也可在学术语境中表示“与能量论（energetism）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Full of energy; energetic; showing strong activity or enthusiasm.","zh":"（不常见）精力充沛的；有活力的；表现出强烈活动或热情的。"},"examples":[{"en":"She gave an energetistic performance that kept the audience engaged.","zh":"她的表演非常有活力，让观众一直很投入。"},{"en":"The team stayed energetistic even after a long day of work.","zh":"即使工作了一整天，团队仍然保持精力充沛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Specialized) Related to “energetism,” a theory emphasizing energy as a basic principle (used mainly in academic/philosophical writing).","zh":"（专门用法）与“能量一元论/能量论（energetism）”有关的；强调“能量”为基本原则的（多见于学术/哲学语境）。"},"examples":[{"en":"The paper compares mechanistic and energetistic views of nature.","zh":"这篇论文比较了自然的机械论观点与能量论观点。"},{"en":"In early 20th-century debates, some authors used energetistic language to describe physical processes.","zh":"在20世纪早期的争论中，一些作者用能量论的措辞来描述物理过程。"}]}],"synonyms":["energetic","vigorous","lively","dynamic"],"phonetic":"/ˌɛnərdʒəˈtɪstɪk/","extraExplanation":["“energetistic”在现代英语里非常少见，日常表达通常用“energetic”（有活力的）更自然、更常用。","如果你想表达“与能量有关的、能量层面的”，常见替代词包括“energetic”（如 energetic cost/energetic efficiency）或“energy-related”。","注意不要和“energistic”混淆：energistic 更常用于生物/化学语境，表示“协同增效的（synergistic-like）”。"]}
{"word":"energiatye","summary":{"en":"Energetic means having lots of energy or showing strong, lively effort.","zh":"Energetic 表示“精力充沛的；有干劲的；充满活力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of energy; active and lively.","zh":"精力充沛的；活跃有生气的。"},"examples":[{"en":"She is energetic in the morning and gets a lot done.","zh":"她早上精力充沛，能完成很多事情。"},{"en":"The children were energetic after the game started.","zh":"比赛开始后，孩子们变得很有活力。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a style, performance, or action) showing strong effort and force.","zh":"（指风格、表演或行为）有力的；充满干劲的。"},"examples":[{"en":"He gave an energetic speech that motivated the team.","zh":"他发表了一场有力的演讲，激励了团队。"},{"en":"The band played an energetic set.","zh":"乐队演奏了一组充满激情的曲目。"}]}],"synonyms":["active","lively","vigorous","dynamic"],"phonetic":"/ˌɛnɚˈdʒɛtɪk/","extraExplanation":["你输入的“energiatye”看起来像是拼写错误，最可能想写的是 energetic（精力充沛的）。常见相关词：energy（能量/精力，名词），energetically（精力充沛地，副词）。"]}
{"word":"energic","summary":{"en":"“Energic” means energetic or related to energy; it’s less common than “energetic” in everyday English.","zh":"“energic”可表示“精力充沛的”或“与能量有关的”；在日常英语中不如“energetic”常见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of energy; active and lively (often used as a less common synonym of “energetic”).","zh":"精力充沛的；活力十足的（常作为“energetic”的较少见同义词）。"},"examples":[{"en":"She’s an energic student who always volunteers to help.","zh":"她是个精力充沛的学生，总是主动帮忙。"},{"en":"The puppy stayed energic even after a long walk.","zh":"小狗走了很久之后还是很有活力。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Science) Relating to energy or energy changes (especially in physics or chemistry).","zh":"（科学）与能量或能量变化有关的（尤指物理或化学语境）。"},"examples":[{"en":"Researchers compared the energic cost of different reactions.","zh":"研究人员比较了不同反应的能量成本。"},{"en":"This model focuses on energic efficiency in the system.","zh":"这个模型关注系统的能量效率。"}]}],"synonyms":["energetic","lively","active","vigorous"],"phonetic":"/ɛnˈɝːdʒɪk/","extraExplanation":["“energic”在日常英语里不算常见，更自然、最常用的是“energetic”。如果写作或考试中想表达“精力充沛”，优先用“energetic”。","在学术写作中，“energic”有时会出现在“energic cost / energic efficiency”等搭配里，用来强调与“能量”相关的概念；不过很多领域也常用“energetic/energy-related”来表达。"]}
{"word":"energical","summary":{"en":"“Energical” means “energetic,” but it’s uncommon in modern English.","zh":"“energical”意思接近“energetic（精力充沛的）”，但在现代英语中不常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of energy; lively and active (rare or old-fashioned form of “energetic”).","zh":"精力充沛的；充满活力的（较少见或偏旧式的“energetic”的变体）。"},"examples":[{"en":"The children were especially energical after the party.","zh":"聚会后孩子们特别精力旺盛。"},{"en":"She gave an energical performance that kept the audience engaged.","zh":"她的表演很有活力，让观众一直投入。"}]}],"synonyms":["energetic","lively","active","vigorous","dynamic"],"phonetic":"/ˌɛnərˈdʒɛtɪkəl/","extraExplanation":["“energical”在现代英语里很少用，更常见、也更自然的写法是“energetic”。在写作、考试或正式场合建议用“energetic”。","如果你是在学习或工作中看到“energical”，它通常意味着“energetic”，有时也可能是拼写错误。"]}
{"word":"energico","summary":{"en":"“Energico” means “energetic,” and in music it tells performers to play with energy and drive.","zh":"“energico”表示“充满活力的”；在音乐中它提示要演奏得有劲、有推动力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian/Spanish) energetic; full of energy; vigorous and active.","zh":"（意大利语/西班牙语）精力充沛的；有活力的；有劲的。"},"examples":[{"en":"She gave an energico performance that kept the audience awake.","zh":"她的表演很energico（充满活力），让观众一直精神集中。"},{"en":"After a short break, the team came back more energico and focused.","zh":"短暂休息后，团队以更energico（更有干劲）的状态回来了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Music, Italian direction) played in an energetic, forceful way.","zh":"（音乐术语，意大利语指示）以有力、充满活力的方式演奏。"},"examples":[{"en":"The score marks this passage energico, so play it with drive.","zh":"乐谱在这一段标注了energico，所以要演奏得更有推进力。"},{"en":"The conductor asked for a more energico sound in the strings.","zh":"指挥要求弦乐部分的音色更energico（更有力、更有精神）。"}]}],"synonyms":["energetic","vigorous","dynamic","forceful","spirited"],"phonetic":"/ˌeɪ.nɚˈdʒiː.koʊ/","extraExplanation":["“energico”常见于意大利语音乐术语中（类似“allegro / dolce / cantabile”），用于提示演奏风格：更有冲劲、更用力、节奏感更强。","在英语语境里，日常表达更常用“energetic / vigorous / dynamic”。如果你在非音乐场合使用“energico”，通常是借用外语来营造风格或强调语气。"]}
{"word":"energid","summary":{"en":"“Energid” is not standard English; it is most likely a misspelling of “energized,” meaning full of energy or made more active/excited.","zh":"“energid” 不是标准英语，通常是把 “energized” 拼错了，意思是“精力充沛的/被激发的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) feeling full of energy; made more active, excited, or motivated.","zh":"（可能想写的是）精力充沛的；被激发的；更有活力、更有干劲的。"},"examples":[{"en":"After a short walk, I felt energized and ready to study again.","zh":"短暂散步后，我觉得精力充沛，又准备继续学习了。"},{"en":"The music energized the crowd.","zh":"音乐让人群兴奋起来。"},{"en":"A good night’s sleep can leave you energized in the morning.","zh":"睡个好觉会让你早上精神满满。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense / past participle of energize) to give someone or something more energy, power, or enthusiasm.","zh":"（energize 的过去式/过去分词）给……提供能量/动力；使更有干劲。"},"examples":[{"en":"The coach energized the team with a short speech.","zh":"教练用一段简短的讲话鼓舞了全队。"},{"en":"New batteries energized the flashlight.","zh":"新电池给手电筒提供了电力。"}]}],"synonyms":["energetic","refreshed","revitalized","stimulated","motivated"],"phonetic":"/ˈɛnərˌdʒaɪzd/","extraExplanation":["“energid” 不是标准英语拼写，最常见的目标词是 **energized**（美式常用拼写）。","拼写小提示：energize + -ed → energized；中间是 **-giz-** 的发音 /dʒaɪz/，容易写错成 -gid 或 -ged。"]}
{"word":"energids","summary":{"en":"“Energids” is the plural of “energid,” a biology term meaning a nucleus plus the nearby cytoplasm it controls in a multinucleate cell.","zh":"energids 是 energid 的複數，是生物學術語，指多核細胞中「一個細胞核＋其周圍受其控制的細胞質」所構成的功能單元。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) In a multinucleate cell, one nucleus together with the surrounding cytoplasm it controls; a functional nucleus-and-cytoplasm unit.","zh":"（生物學）在多核細胞中，一個細胞核及其所控制的周圍細胞質所形成的功能單位；可理解為「核—胞質單元」。"},"examples":[{"en":"Some large algae have many nuclei, each forming an energid within the shared cytoplasm.","zh":"有些大型藻類有許多細胞核，每個細胞核都在共同的細胞質中形成一個 energid（核—胞質單元）。"},{"en":"In a coenocytic organism, energids can be spaced throughout the cell to manage local activity.","zh":"在合胞體（coenocytic）生物中，energids 可能分布在細胞各處，以管理局部的細胞活動。"}]}],"synonyms":["nucleus–cytoplasm unit","nuclear domain (approx.)"],"phonetic":"/ˈɛnɚdʒɪdz/","extraExplanation":["這個字比較偏專業，常見於植物學／藻類學與細胞生物學的語境，尤其描述「合胞體／多核、但沒有分隔成多個細胞」的結構（如某些藻類、真菌）。","字形上是 energid，複數為 energids；和日常英文的 energy、energetic 沒有直接用法關係（雖然詞根看起來相似）。"]}
{"word":"energies","summary":{"en":"“Energies” is the plural of “energy,” meaning forms/amounts of energy, or (more figuratively) a person’s strength and effort.","zh":"“Energies”是“energy”的复数，可指各种/多份能量，也可引申指人的精力与投入的努力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of energy: the ability to do work or cause change (often in physics, like heat, light, electricity).","zh":"energy 的复数：能量；做功或引起变化的能力（常用于物理，如热、光、电等）。"},"examples":[{"en":"Solar panels convert sunlight into energies we can use as electricity.","zh":"太阳能板把阳光转化为我们可用作电力的能量。"},{"en":"Different energies—heat and light—are released in the reaction.","zh":"反应会释放不同形式的能量——热和光。"}]},{"partOfSpeech":"n.","definition":{"en":"people’s strength, enthusiasm, or mental focus; the effort they can give.","zh":"人的精力、热情或专注力；可投入的劲头与努力。"},"examples":[{"en":"After the long trip, she didn’t have the energies to go out.","zh":"长途旅行后，她没有精力再出门了。"},{"en":"He put all his energies into learning English.","zh":"他把全部精力都投入到学习英语上。"}]}],"synonyms":["power","vitality","vigor","stamina","enthusiasm","effort"],"phonetic":"ˈɛnɚdʒiz","extraExplanation":["“energies”作“精力/心力”时，常见搭配有：have the energy/energies to do sth（有精力做某事）；put/devote one’s energies to…（把精力投入到……）。在口语里更常说 energy（不可数）表示“精力”，但用 energies（复数）会更强调“多方面的努力/精力”。"]}
{"word":"energis","summary":{"en":"“energis” isn’t standard English; it’s usually a misspelling of “energize” or “energies.”","zh":"“energis”不是标准英语，通常是 “energize” 或 “energies” 的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; commonly a misspelling of “energize” (to give energy to) or “energies” (plural of energy).","zh":"不是标准英语单词；常见为 “energize”（使充满活力/给……供能）或 “energies”（energy 的复数：能量/精力）的拼写错误。"},"examples":[{"en":"I think you meant “energize”: Coffee can energize you in the morning.","zh":"我猜你想写的是 “energize”：咖啡早上能让你更有精神。"},{"en":"If you meant “energies”: She put her energies into studying English.","zh":"如果你想写的是 “energies”：她把精力投入到学习英语中。"}]}],"synonyms":["energize","energies"],"phonetic":"/ˈɛnərdʒaɪz/","extraExplanation":["“energis”在英文里不常见，通常是拼写输入造成的。最接近的两个高频词：\n1) energize（动词）：让人更有活力/给设备供能（如 energize a system）。\n2) energies（名词复数）：精力（常用于“投入精力”put one’s energies into…）或物理意义的能量。","如果你告诉我你的原句（例如：I want to energis… / my energis…），我可以帮你判断你更想表达哪一个词，并给出更自然的改写。"]}
{"word":"energise","summary":{"en":"Energise means to make someone feel more energetic or to supply electrical power; it’s the British spelling of “energize.”","zh":"energise 指“使更有活力/激励”，也可指“给……供电”；它是美式 energize 的英式拼写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone feel more active, enthusiastic, or full of energy; to boost energy or motivation","zh":"使更有活力；使振奋；激励（精力或热情）"},"examples":[{"en":"A short walk can energise you when you feel sleepy in the afternoon.","zh":"下午犯困时，短走一会儿能让你精神起来。"},{"en":"The coach’s speech energised the team before the match.","zh":"教练的讲话在比赛前让全队士气大振。"},{"en":"Try to eat a balanced breakfast to energise your morning.","zh":"尽量吃一顿均衡的早餐，为早晨补充能量。"}]},{"partOfSpeech":"vt.","definition":{"en":"to supply power or electricity to a device, system, or place; to power up","zh":"给……供电；使通电；使运转"},"examples":[{"en":"The battery energises the sensor for several hours.","zh":"电池能让传感器通电运行好几个小时。"},{"en":"Do not energise the equipment until the cover is securely in place.","zh":"在外盖固定好之前不要给设备通电。"}]}],"synonyms":["energize","invigorate","revitalize","stimulate","power"],"phonetic":"/ˈɛnərdʒaɪz/","extraExplanation":["“energise”是英式拼写；美式更常写作“energize”。两者意思相同。","在工程/安全告示里，“energise”常指“通电/带电”，如“Do not energise”=“禁止送电”。日常语境里更常用来表示“提神、激励”。"]}
{"word":"energised","summary":{"en":"Energised (BrE) means feeling full of energy or being made more active/effective; AmE spelling: energized.","zh":"energised（英式）指精力充沛、干劲十足，或使某事更有活力/更有效；美式拼写为 energized。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(BrE spelling) full of energy; excited and ready to do something","zh":"（英式拼写）精力充沛的；兴奋并准备行动的"},"examples":[{"en":"After a short walk, I felt energised and ready to study.","zh":"短走一会儿后，我觉得精神振奋，准备开始学习。"},{"en":"The team looked energised at the start of the game.","zh":"比赛开始时，队伍看起来很有干劲。"}]},{"partOfSpeech":"adj.","definition":{"en":"(BrE spelling) given more energy or power; made more active or effective","zh":"（英式拼写）被注入更多能量/动力的；被激活的；更有活力或效率的"},"examples":[{"en":"The campaign was energised by new volunteers.","zh":"新志愿者让这次宣传活动更有活力。"},{"en":"This policy aims to energise the local economy.","zh":"这项政策旨在为当地经济注入活力。"}]}],"synonyms":["energetic","revitalized","reinvigorated","charged","animated"],"phonetic":"/ˈɛnərˌdʒaɪzd/","extraExplanation":["“energised”是英式拼写；美式通常写作“energized”。两者意思相同。","它既可描述人的状态（精神振奋、干劲十足），也常用于比喻“让某事更有活力/推动力”，比如energise a team/economy/campaign。"]}
{"word":"energiser","summary":{"en":"An energiser is someone or something that boosts energy or enthusiasm; in British English it can also refer to Energiser-brand batteries (and sometimes a battery in general).","zh":"energiser 指让人更有精力/更振奋的人或事物；在英式英语中也可指劲量品牌电池，有时还会被泛指为电池。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that gives energy, excitement, or motivation to others","zh":"（人或事物）使人充满精力/振奋、带动气氛的人（或东西）"},"examples":[{"en":"Our new coach is a real energiser—practice feels fun again.","zh":"我们的新教练真是个“带动气氛的人”——训练又变得有趣了。"},{"en":"A quick stretch break can be an energiser in the middle of a long meeting.","zh":"在漫长会议中做个快速拉伸休息，可以起到提神、让人振作的作用。"}]},{"partOfSpeech":"n.","definition":{"en":"(BrE) a brand name commonly used to mean an “AA/AAA battery” in general","zh":"（英式英语）常用作“劲量电池”的品牌名，也常被泛指为普通电池（如AA/AAA）"},"examples":[{"en":"Do we have any Energiser batteries for the remote?","zh":"我们有给遥控器用的劲量（或AA/AAA）电池吗？"},{"en":"In some places people say “an Energiser” when they just mean a battery.","zh":"在一些地方，人们说“an Energiser”时其实只是泛指电池。"}]}],"synonyms":["motivator","booster","pick-me-up","spark","catalyst"],"phonetic":"/ˈɛnɚˌdʒaɪzɚ/","extraExplanation":["拼写与地区差异：在英式英语里常见拼写是 energiser；美式英语更常写作 energizer（-ize 结尾更常见）。发音基本相同。","语域提示：作为“带动气氛的人/提神的东西”时，多用于口语或较轻松的语境；正式写作中也可用 motivator、source of energy 等表达。","商标泛化：Energiser（劲量）是品牌名；在口语里有时会像 “Kleenex=纸巾” 一样被用来泛指同类产品，但正式场合最好说 battery。"]}
{"word":"energises","summary":{"en":"“Energises” means “gives energy or enthusiasm” (British spelling; US: energizes).","zh":"“energises”表示“使更有能量/更有干劲”，为英式拼写；美式为“energizes”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(BrE) third-person singular present of “energise”: to give someone or something more energy, enthusiasm, or power.","zh":"（英式拼写）“energise”的第三人称单数现在时：给某人或某物注入能量/活力，使更有精神或更有动力。"},"examples":[{"en":"A short walk after lunch energises me for the afternoon.","zh":"午饭后散步一小会儿会让我下午更有精神。"},{"en":"Good music energises the crowd before the game starts.","zh":"在比赛开始前，好音乐会让观众更兴奋、更有气氛。"}]}],"synonyms":["energizes","invigorates","stimulates","boosts","revitalizes"],"phonetic":"/ˈɛnərˌdʒaɪzɪz/","extraExplanation":["“energises”是英式拼写（BrE）；美式拼写通常是“energizes”。两者意思和用法相同，只是拼写不同。","常见搭配：energise/energize sb.（使某人更有精神）、energise/energize a campaign/team/crowd（让活动/团队/人群更有活力）。","语感提示：比“make … energetic”更自然、更常用于描述“提振精神/带动气氛”。"]}
{"word":"energising","summary":{"en":"“Energising” means making you feel more energetic or active (BrE spelling of “energizing”).","zh":"“energising”表示“使人更有精力/更有活力”，是“energizing”的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(BrE spelling) giving you more energy; making you feel more awake, active, or enthusiastic.","zh":"（英式拼写）使人更有精力的；让人更清醒、更积极或更有热情的。"},"examples":[{"en":"A brisk walk in the morning is really energising.","zh":"早晨快走真的很提神、很有活力。"},{"en":"She played energising music to stay focused while studying.","zh":"她放了很带劲的音乐来保持学习时的专注。"},{"en":"The team found the coach’s speech energising before the game.","zh":"比赛前，球队觉得教练的讲话很鼓舞士气、让人更有干劲。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “energise”) to give energy to; to make someone or something more active or effective.","zh":"（“energise”的现在分词）给……注入能量/动力；使（人或事物）更有活力或更有效率。"},"examples":[{"en":"A good night’s sleep is energising her for the week ahead.","zh":"一晚好觉正在让她为接下来的一周充满精力。"},{"en":"The new project is energising the whole department.","zh":"这个新项目正在让整个部门都更有干劲。"}]}],"synonyms":["energizing","invigorating","stimulating","uplifting"],"phonetic":"/ˈɛnərˌdʒaɪzɪŋ/","extraExplanation":["“energising”是英式拼写；美式英语更常写作“energizing”。意思相同。","常见搭配：energising drink（提神饮料）、energising music（提神/带劲的音乐）、energising start to the day（充满活力的一天开端）。","语气上多偏积极；如果要表达“刺激得焦虑/过度兴奋”，可用“overstimulating”或“too stimulating”。"]}
{"word":"energism","summary":{"en":"Energism is a rare philosophical term meaning the belief that energy or activity is the most fundamental reality.","zh":"Energism（能量论）是较少见的哲学术语，指认为能量或活动性是最根本的真实基础。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophical view that treats energy (or activity/force) as the fundamental reality behind matter and mind.","zh":"一种哲学观点：把“能量”（或活动、动力）看作比物质与心灵更根本的真实基础。"},"examples":[{"en":"In the essay, the author argues for energism, claiming that energy is more basic than matter.","zh":"在这篇文章里，作者主张“能量论”，认为能量比物质更根本。"},{"en":"Energism appears in some older philosophical writing, but it’s not common in everyday English.","zh":"“能量论”会出现在一些较早的哲学著作中，但在日常英语里并不常见。"}]}],"synonyms":["energy monism","energeticism","monism"],"phonetic":"/ˈɛnərˌdʒɪzəm/","extraExplanation":["“energism”是相对少见的学术词，常见于哲学史或形而上学讨论。日常英语中更常用的相关词可能是“energy-based view（以能量为基础的观点）”或在科学语境下直接讨论“energy”。","不要把它与物理学里的“energy（能量）”混为一谈：energism更偏“世界本体是什么”的哲学立场，而不是具体的科学理论。"]}
{"word":"energist","summary":{"en":"An energist is someone who emphasizes or advocates an energy-based way of explaining things; it can also mean (rarely) an energy specialist.","zh":"energist指强调或主张用“能量”来解释事物的人；也可（较少见）指研究/从事能量相关工作的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or emphasizes the idea of “energy” as an important principle (especially in science or philosophy); someone who argues from an energy-based viewpoint.","zh":"强调或支持“能量”这一重要原理的人（尤指科学或哲学语境）；从能量观点出发进行论证的人。"},"examples":[{"en":"Some early 20th‑century energists argued that physics should be explained primarily in terms of energy rather than matter.","zh":"一些20世纪初的energists认为，物理学应主要用“能量”而不是“物质”来解释。"},{"en":"In the debate, the energist focused on energy transfers and efficiency.","zh":"在辩论中，这位energist把重点放在能量转换与效率上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A specialist or practitioner concerned with energy—how it is produced, stored, or used.","zh":"（少见）研究或从事与能量相关工作的人；关注能量的产生、储存或利用的专家/从业者。"},"examples":[{"en":"The conference invited engineers, chemists, and a few energists to discuss future power systems.","zh":"会议邀请了工程师、化学家以及少数energists来讨论未来能源系统。"},{"en":"As an energist, she studies how batteries store and release energy.","zh":"作为一名energist，她研究电池如何储存与释放能量。"}]}],"synonyms":["energy expert","advocate of energetics","proponent of energetics","energy scientist"],"phonetic":"/ˈɛnərdʒɪst/","extraExplanation":["“energist”在现代英语中非常少见，更常见的表达是“energy scientist（能源/能量科学家）”“energy expert（能源专家）”“proponent of energetics（能量学观点的支持者）”。","在历史语境里，它有时与“energetics（能量学/能量论）”相关：即用“能量”作为解释自然现象的核心概念。阅读较旧的哲学或科学史材料时更可能见到。"]}
{"word":"energistic","summary":{"en":"Energistic means related to energy or producing a stimulating, energizing effect; it’s rare in everyday English.","zh":"energistic 指与能量相关或具有刺激、增活力作用的；在日常英语中较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to energy or the production/use of energy; energizing or stimulating.","zh":"与能量或能量的产生/利用有关的；使人有活力的、起刺激作用的。"},"examples":[{"en":"Scientists studied the energistic effects of the hormone on muscle cells.","zh":"科学家研究了这种激素对肌肉细胞的促能（增活力）作用。"},{"en":"After a short walk, she felt more energistic and ready to work.","zh":"短暂散步后，她感觉更有精神，准备开始工作。"}]}],"synonyms":["energetic","energizing","stimulating","activating"],"phonetic":"/ˌɛnərˈdʒɪstɪk/","extraExplanation":["“energistic”在现代日常英语中很少用，更常见的表达是“energetic / energizing / stimulating”。在生理学、药理学或较旧的学术文本里，有时会用它来描述“能量相关的/促进活性”的作用。","注意不要和“synergistic（协同的）”混淆；两者含义不同，只是拼写看起来相近。"]}
{"word":"energiz","summary":{"en":"“Energiz” is not a standard word; it usually refers to “energize”: to make more energetic or to supply power (often electricity).","zh":"“energiz”不是标准单词，通常指“energize”：使更有精力/更活跃，或为设备供能（常指通电）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Often a misspelling) To give someone or something more energy, strength, or enthusiasm; to make more active.","zh":"（常见拼写错误）使某人或某物更有精力/力量/热情；使更活跃。"},"examples":[{"en":"A short walk can energize you in the afternoon.","zh":"下午短暂散步可以让你更有精神。"},{"en":"The music energized the crowd.","zh":"音乐让人群兴奋起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"To supply energy (especially electrical power) to a device, system, or circuit.","zh":"为（尤指电力设备、系统或电路）供能/通电。"},"examples":[{"en":"Turn on the switch to energize the system.","zh":"打开开关给系统通电。"},{"en":"The backup generator energized the lights during the outage.","zh":"停电时备用发电机为照明供电。"}]}],"synonyms":["stimulate","invigorate","revitalize","power","activate"],"phonetic":"/ˈɛnɚˌdʒaɪz/","extraExplanation":["“energiz”不是标准拼写；正确拼写通常是 **energize**（美式常用；英式也用 energise）。在写作或考试中请用 energize/energise。","词源上来自 energy（能量）+ -ize（使……化/使成为……）。在工程语境里，energize 常指“通电”，在日常语境里更常指“提神、激励”。"]}
{"word":"energize","summary":{"en":"Energize means to make someone feel more active and enthusiastic, or to supply power to a system.","zh":"Energize 指让人更有精神、更有干劲；也可指给系统或设备供能/通电。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone or something more energy, strength, or enthusiasm; to make them feel active and ready to do something","zh":"使某人/某物更有精力、力量或热情；使变得活跃、振作"},"examples":[{"en":"A short walk can energize you in the afternoon.","zh":"下午出去短走一会儿能让你精神起来。"},{"en":"The coach’s speech energized the whole team.","zh":"教练的讲话让全队都振奋起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to supply power (especially electricity) to a machine, system, or area","zh":"给（机器、系统或地区）供能/供电（尤指供电）"},"examples":[{"en":"The battery energizes the sensor for several hours.","zh":"这块电池能给传感器供电好几个小时。"},{"en":"They plan to energize the grid with more renewable energy.","zh":"他们计划用更多可再生能源为电网供能。"}]}],"synonyms":["invigorate","revive","stimulate","rejuvenate","power","electrify"],"phonetic":"/ˈɛnərˌdʒaɪz/","extraExplanation":["“energize”常用于两类场景：①日常生活里指“让人更有精神/更有干劲”；②科技/工程语境里指“给设备或系统通电/供能”。","词根“energy（能量）+ -ize（使……化）”，所以字面意思就是“使具有能量”。在写作中比“give energy”更简洁、更正式。"]}
{"word":"energized","summary":{"en":"“Energized” means feeling full of energy and ready to act, or (in technical contexts) powered by electricity.","zh":"“Energized”常指精力充沛、被激发出干劲；在技术语境中也指通电、带电。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"full of energy; feeling active, lively, and ready to do things","zh":"精力充沛的；充满活力、很有干劲的"},"examples":[{"en":"After a good night’s sleep, I feel energized and ready for work.","zh":"睡了个好觉后，我感到精力充沛，准备去工作。"},{"en":"The music energized the crowd.","zh":"音乐让人群兴奋起来、变得更有活力。"},{"en":"She looked energized after her workout.","zh":"她锻炼后看起来精神更好了。"}]},{"partOfSpeech":"adj.","definition":{"en":"given power (especially electricity) so it can operate","zh":"通电的；已被供能（尤指电力）而能运作的"},"examples":[{"en":"Do not touch the energized wire.","zh":"不要触碰带电的电线。"},{"en":"Make sure the equipment is not energized before you repair it.","zh":"维修前要确认设备没有通电。"}]}],"synonyms":["invigorated","revitalized","refreshed","animated","charged"],"phonetic":"/ˈɛnɚˌdʒaɪzd/","extraExplanation":["“energized”常用于描述人的状态（有精神、有动力），也可用于工程/安全语境，指“带电/通电”。在工作或学习场景里，常见搭配有 feel energized、stay energized、keep me energized。","与“energetic”相比：energetic更像长期特质（这个人很有活力），energized更像当下被激发后的状态（此刻更有干劲）。"]}
{"word":"energizer","summary":{"en":"An energizer is a power source (often a battery) or a person/thing that boosts energy and enthusiasm.","zh":"energizer可指电源（常指电池），也可指让人更有精神、更有干劲的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device (especially a battery) that provides power to something, or a brand known for batteries.","zh":"为设备提供电力的装置（尤指电池），也可指以电池闻名的“劲量（Energizer）”品牌。"},"examples":[{"en":"This toy needs an energizer to make it work.","zh":"这个玩具需要电池供电才能运作。"},{"en":"I bought Energizer batteries for my flashlight.","zh":"我给手电筒买了劲量电池。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that gives energy, motivation, or enthusiasm to others; something that “lifts the mood.”","zh":"能给他人带来活力、动力或热情的人或事物；让气氛“活跃起来”的东西。"},"examples":[{"en":"Her smile is an energizer for the whole team.","zh":"她的笑容能让整个团队都充满干劲。"},{"en":"A short walk can be a great energizer in the afternoon.","zh":"下午短走一会儿会很提神。"}]}],"synonyms":["battery","power source","booster","pick-me-up","motivator"],"phonetic":"/ˈɛnɚˌdʒaɪzɚ/","extraExplanation":["“Energizer”在日常英语里常见的两种用法：①指电池/供电装置；②比喻“提神的东西/带动气氛的人”。第二种更口语、更形象。","作为品牌名“Energizer”（劲量）通常要大写；如果只是泛指“电力来源/提神物”，可小写energizer。"]}
{"word":"energizers","summary":{"en":"“Energizers” most commonly means people or things that boost energy or motivation; it can also refer to Energizer-brand batteries/products.","zh":"“energizers”常指能让人更有精力/动力的人或事物；也可指劲量（Energizer）品牌的电池/产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that give energy, motivation, or enthusiasm (plural of “energizer”).","zh":"能让人充满精力、动力或热情的人或事物（“energizer”的复数）。"},"examples":[{"en":"Good music can be one of the best energizers during a workout.","zh":"好音乐在锻炼时可能是最好的“提神/增劲”方式之一。"},{"en":"The coach is a real energizer—everyone plays harder when she’s around.","zh":"这位教练真是个“带动气氛的人”——她在场时大家都更拼。"}]},{"partOfSpeech":"n.","definition":{"en":"Batteries or battery-powered products made by the brand Energizer (often treated as a plural noun in casual speech).","zh":"劲量（Energizer）品牌的电池或电池类产品（口语中常用复数说法）。"},"examples":[{"en":"Do we have any Energizers for the remote?","zh":"我们有劲量电池可以给遥控器用吗？"},{"en":"I bought a pack of Energizers because they last longer in my flashlight.","zh":"我买了一包劲量电池，因为用在手电里更耐用。"}]}],"synonyms":["boosters","motivators","pick-me-ups","power sources","batteries"],"phonetic":"/ˈɛnɚˌdʒaɪzɚz/","extraExplanation":["“Energizer”也是美国很知名的电池品牌。口语里人们常把品牌名当成普通名词用（类似说“拿两节Duracells/两节劲量”）。","作为“让人更有劲的人/事物”时，语气通常偏正面，强调“带动气氛、提升干劲”。"]}
{"word":"energizes","summary":{"en":"“Energizes” means “makes more energetic/active” or “supplies power,” and it is the third-person singular form of “energize.”","zh":"“energizes”表示“使更有精力/更活跃”或“供能/通电”，是“energize”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give someone or something more energy, enthusiasm, or strength; to make more active","zh":"使某人/某物更有精力、更有干劲；使更活跃"},"examples":[{"en":"A short walk energizes me in the afternoon.","zh":"下午走一小段路会让我精神一振。"},{"en":"Good music energizes the crowd at a game.","zh":"好的音乐会让比赛现场的观众更兴奋。"},{"en":"The new plan energizes the team to work faster.","zh":"新计划让团队更有动力、更快推进工作。"}]},{"partOfSpeech":"v.","definition":{"en":"to supply power (especially electricity) to a device, system, or place","zh":"（尤指用电）给设备、系统或场所供能/通电"},"examples":[{"en":"The battery energizes the circuit.","zh":"电池为电路供电。"},{"en":"Solar panels energize the building during the day.","zh":"太阳能板在白天为大楼供电。"}]}],"synonyms":["invigorates","revitalizes","stimulates","powers","electrifies"],"phonetic":"/ˈɛnərˌdʒaɪzɪz/","extraExplanation":["“energizes”是动词“energize”的第三人称单数形式，用于一般现在时：He/She/It energizes...（他/她/它使……更有活力/供能）。如果主语是I/you/we/they，则用“energize”。"]}
{"word":"energizing","summary":{"en":"“Energizing” usually means making you feel more awake and full of energy.","zh":"“energizing”通常表示“让人更有精神、充满能量/更有干劲”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Giving you more energy, excitement, or motivation; making you feel more awake and active.","zh":"让人精力充沛的；使人更兴奋或更有动力的；提神的。"},"examples":[{"en":"A quick walk outside can be really energizing.","zh":"到外面快走一会儿会非常提神。"},{"en":"She likes energizing music when she studies.","zh":"她学习时喜欢听让人有精神的音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of giving energy to something or someone (often used in discussions of power, business, or motivation).","zh":"（向某物/某人）提供能量或注入活力的行为（常见于能源、商业或激励等语境）。"},"examples":[{"en":"The new policy focuses on energizing the local economy.","zh":"这项新政策着重于为当地经济注入活力。"},{"en":"They discussed energizing the system with renewable power.","zh":"他们讨论用可再生能源为系统供能。"}]}],"synonyms":["invigorating","stimulating","revitalizing","uplifting","refreshing"],"phonetic":"/ˈɛnərˌdʒaɪzɪŋ/","extraExplanation":["“energizing”最常见是形容词，用来描述让你更有精神的事物（如运动、音乐、天气、谈话）。也常用于更抽象的场景，比如“energizing a team/economy”（激活团队/经济）。","近义词语感对比：energizing偏“注入能量、提神”；stimulating偏“引发兴趣、启发/刺激思考”；invigorating更正式，常指“使人精神振奋、恢复活力”。"]}
{"word":"energumen","summary":{"en":"An old/rare word for a person believed to be demon-possessed, or (figuratively) someone acting with wild, fanatical intensity.","zh":"一个古老/罕用词，指被认为被邪灵附身的人；也可比喻指行为狂热、失控的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A person believed to be possessed by an evil spirit; a demoniac.","zh":"（历史用语）被认为被邪灵附身的人；被魔附者。"},"examples":[{"en":"In some early Christian texts, an energumen was not allowed to take part in certain church rites.","zh":"在一些早期基督教文献中，被称为 energumen 的人不被允许参加某些教会仪式。"},{"en":"The novel describes a villager treated as an energumen during a time of superstition.","zh":"这部小说描写在迷信盛行的年代里，一位村民被当作“被附身者”对待。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/rare) A person who seems driven by an intense, uncontrollable force; a fanatical or wildly excited person.","zh":"（文学/罕用）像被某种强烈力量驱使的人；狂热而失控的人。"},"examples":[{"en":"He argued like an energumen, refusing to listen to any evidence.","zh":"他争辩得像个被某种力量驱使的人，完全不听任何证据。"},{"en":"The crowd turned into energumens, shouting over one another.","zh":"人群变得异常狂热，彼此吼叫盖过对方。"}]}],"synonyms":["demoniac","possessed person","fanatic","zealot"],"phonetic":"/ɛnˈɝːɡjəmən/","extraExplanation":["词源来自希腊语 energoumenos（意为“被作用/被驱使的人”），经拉丁语进入英语。在早期基督教语境中常指“被魔附者”，现代英语里非常少见，多用于文学化比喻：形容某人像“被某种力量附体”一样狂热、失控。使用时需注意语气可能带有贬义或宗教色彩。"]}
{"word":"energumenon","summary":{"en":"A rare word meaning (1) a person thought to be demon-possessed, or (2) figuratively, a wildly driven fanatic.","zh":"一个罕见词，指（1）被认为被恶灵附身的人，或（2）引申为像被力量驱使般狂热、失控的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A person believed to be possessed by an evil spirit or demon; a “demoniac.”","zh":"（历史用法）被认为被恶灵或魔鬼附身的人；“被鬼附的人”。"},"examples":[{"en":"In medieval stories, an energumenon might be brought to a priest for exorcism.","zh":"在中世纪故事里，被称为 energumenon 的人可能会被带到神父那里接受驱魔。"},{"en":"The chronicle describes the patient as an energumenon, showing how people explained illness through religion.","zh":"编年史把病人描述为 energumenon，反映了当时人们用宗教来解释疾病。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, rare) A violently excited or fanatical person; someone who behaves as if “driven” by a force.","zh":"（引申，罕见）情绪极端激动或狂热的人；仿佛被某种力量“驱使”的人。"},"examples":[{"en":"He spoke like an energumenon, shouting slogans and refusing to listen to anyone.","zh":"他讲起话来像个 energumenon，一直喊口号，谁的话都听不进去。"},{"en":"The novelist used “energumenon” to portray a character consumed by obsession.","zh":"这位小说家用“energumenon”来刻画一个被执念吞噬的角色。"}]}],"synonyms":["demoniac","possessed person","fanatic","zealot"],"phonetic":"/ɪˌnɝɡjuˈmiːnən/","extraExplanation":["词源来自希腊语 *energeoumenos*，本意是“正在被某种力量作用/驱动的人”。早期基督教语境里常用于指“被附身者”，与驱魔（exorcism）等宗教仪式相关。","现代英语中该词非常少见，通常只在历史讨论、宗教研究或文学修辞中出现；日常表达更常用 *possessed person*、*demoniac*，引申义可用 *fanatic*、*zealot*。"]}
{"word":"energy","summary":{"en":"Energy means (1) the strength or liveliness to do things, (2) a source of power like electricity or solar power, and (3) in science, the ability to do work.","zh":"Energy 可指（1）精力/活力，（2）能源（如电、太阳能等），也可指（3）科学意义上的“能量”（做功的能力）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"power or strength needed to do physical or mental work; the feeling of being lively and active","zh":"（做体力或脑力活动所需的）能量、精力；活力"},"examples":[{"en":"I don’t have the energy to cook tonight.","zh":"我今晚没有精力做饭。"},{"en":"She came into the room with a lot of energy.","zh":"她很有活力地走进房间。"},{"en":"Try to save your energy for the exam tomorrow.","zh":"尽量把精力留到明天的考试。"}]},{"partOfSpeech":"n.","definition":{"en":"a source of power used to produce heat, light, or electricity (such as oil, gas, wind, or sunlight)","zh":"（用于产生热、光或电的）能源（如石油、天然气、风能、太阳能等）"},"examples":[{"en":"The country is investing in clean energy.","zh":"这个国家正在投资清洁能源。"},{"en":"Solar energy is becoming cheaper every year.","zh":"太阳能每年都在变得更便宜。"}]},{"partOfSpeech":"n.","definition":{"en":"in science, the ability to do work or cause change (for example, heat or electricity)","zh":"（科学）能量：做功或引起变化的能力（如热能、电能）"},"examples":[{"en":"The battery stores energy for the phone.","zh":"电池为手机储存能量。"},{"en":"Heat energy can make water boil.","zh":"热能可以使水沸腾。"}]}],"synonyms":["power","vigor","vitality","stamina","pep"],"phonetic":"/ˈɛnərdʒi/","extraExplanation":["在日常英语里，energy 很常用来形容“精神状态”（有/没精力）。在“能源”语境中，它常和 clean/renewable 这些词搭配：clean energy（清洁能源）、renewable energy（可再生能源）。"]}
{"word":"enervate","summary":{"en":"Enervate means to drain someone’s energy and make them feel weak or exhausted.","zh":"Enervate 指“使人精力被消耗、变得虚弱疲惫”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make someone feel weak, tired, or lacking energy; to drain strength or enthusiasm.","zh":"使（人）虚弱、疲惫；削弱精力或干劲。"},"examples":[{"en":"The long, humid afternoon heat enervated everyone in the office.","zh":"漫长又潮湿的午后热气让办公室里的每个人都感到疲惫无力。"},{"en":"Months of constant stress can enervate you, even if you sleep enough.","zh":"即使睡得够，持续数月的压力也会让你精疲力竭。"},{"en":"The team’s early losses enervated their confidence.","zh":"球队早期的失利削弱了他们的信心。"}]}],"synonyms":["weaken","exhaust","drain","sap","debilitate","fatigue"],"phonetic":"/ɪˈnɝːveɪt/","extraExplanation":["“enervate”常被误用为“使精力充沛”。它的正确含义是“使虚弱/使没力气”。如果你想表达“使振奋”，更合适的词是“energize / invigorate”。","词源上来自拉丁语，含义与“去掉力量”有关，因此带有“削弱、抽走力气”的感觉。","语体上偏正式，常用于写作或新闻评论；日常口语里更常说“wear out / exhaust / drain (someone)”。"]}
{"word":"enervated","summary":{"en":"Enervated means exhausted or drained of energy; it can describe a person who feels weak or something that makes people feel that way.","zh":"Enervated 表示“精疲力尽、被耗尽精力的”，可形容人很疲惫，也可形容让人疲惫的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) feeling very tired, weak, or lacking energy; exhausted.","zh":"（人）感到非常疲惫、虚弱、没精神；精疲力尽的。"},"examples":[{"en":"After the long flight, I felt completely enervated and went straight to bed.","zh":"长途飞行后，我感到精疲力尽，直接上床睡觉了。"},{"en":"The hot, humid weather left everyone enervated by mid-afternoon.","zh":"炎热潮湿的天气让大家到下午就都没精神了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of something such as heat, stress, or an experience) causing someone to lose energy or strength; draining.","zh":"（事物如高温、压力、经历）使人失去精力或体力的；让人疲惫不堪的。"},"examples":[{"en":"It was an enervating day of meetings with no real breaks.","zh":"那是个让人筋疲力尽的会议日，几乎没有真正的休息。"},{"en":"Constant worry can be deeply enervating over time.","zh":"长期的持续担忧会非常耗人精力。"}]}],"synonyms":["exhausted","drained","weary","fatigued","spent","worn out"],"phonetic":"/ɪˈnɝː.veɪ.tɪd/","extraExplanation":["注意不要和“energetic（精力充沛的）”搞混：enervated 的意思是“被耗尽精力的”，不是“更有活力的”。","词源上来自拉丁语，原意有“使无力/削弱力量”的感觉；因此它常用在较正式的写作中（新闻、评论、文学性表达）。","常见搭配：feel enervated（感到疲惫）、leave someone enervated（让某人疲惫）、enervating heat/stress（耗人精力的高温/压力）。"]}
{"word":"enervates","summary":{"en":"“Enervates” means “makes someone or something weak or tired; drains energy.”","zh":"“enervates”意为“使虚弱/使疲惫；消耗精力”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to weaken someone or something; to drain strength, energy, or vitality","zh":"使（某人/某物）虚弱；消耗精力、力量或活力"},"examples":[{"en":"The long heat wave enervates people, especially those who work outdoors.","zh":"持续的热浪会让人变得虚弱，尤其是户外工作者。"},{"en":"Constant stress can enervate the body and make it easier to get sick.","zh":"长期压力会消耗身体的力量，让人更容易生病。"},{"en":"The boring lecture enervates the class, and everyone looks tired.","zh":"这场无聊的讲座让全班都没精神，大家看起来都很累。"}]}],"synonyms":["weaken","drain","sap","exhaust","debilitate","enfeeble"],"phonetic":"/ɪˈnɝːveɪts/","extraExplanation":["“enervates”是动词第三人称单数形式（he/she/it enervates）。原形是 enervate。","很多学习者会被前缀 en- 误导，以为是“让人更有精力”。但 enervate 的真实意思是“使人虚弱、耗尽精力”，和 energize 正好相反。","词源上与拉丁语中表示“筋、神经/力量”的词有关，因此带有“削弱力量”的含义。"]}
{"word":"enervating","summary":{"en":"Enervating means very tiring or weakening—something that drains your energy or strength.","zh":"Enervating 指“令人疲惫、削弱精力的”，强调消耗人的体力或意志。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making you feel very tired; exhausting or draining.","zh":"使人非常疲惫的；令人精疲力尽的。"},"examples":[{"en":"The heat and humidity were enervating, so we took frequent breaks.","zh":"高温和潮湿让人精疲力尽，所以我们经常休息。"},{"en":"After an enervating day of travel, she went straight to bed.","zh":"经历了一天令人疲惫的旅程后，她直接上床睡觉了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Weakening your strength, energy, or determination; sapping vigor (often in a physical or emotional sense).","zh":"削弱力量、精力或意志的；使人变得无力（常指身心层面）。"},"examples":[{"en":"The constant criticism had an enervating effect on his confidence.","zh":"持续的批评对他的自信产生了削弱作用。"},{"en":"Long meetings can be enervating and hurt productivity.","zh":"冗长的会议会消耗精力，影响效率。"}]}],"synonyms":["exhausting","draining","fatiguing","debilitating","wearisome"],"phonetic":"/ɪˈnɝːveɪtɪŋ/","extraExplanation":["“enervating”比较正式，常用于写作或较正式的口语场合。","词源来自拉丁语 enervare，原意接近“去筋、使无力”，所以它的核心是“削弱精力”，不是“让人更有能量”。学习者常把它和“energizing（令人振奋的）”混淆，注意两者含义相反。","在文学或评论性写作中常用来形容“闷热的天气、冗长的程序、持续的压力/批评”等对人造成的消耗。"]}
{"word":"enervation","summary":{"en":"Enervation means a state or feeling of weakness and tiredness, or the process of becoming weakened.","zh":"Enervation 指“疲惫无力、精力不足”的状态，也可指“被削弱、衰弱”的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of being weak, tired, or lacking energy (physical or mental).","zh":"虚弱、疲惫、精力不足（身体或精神上的）。"},"examples":[{"en":"After the long flight, she felt a deep enervation and went straight to bed.","zh":"长途飞行后，她感到深深的疲惫无力，直接上床睡了。"},{"en":"The heat of midsummer can cause enervation, making it hard to focus at work.","zh":"盛夏的炎热会让人疲惫无力，使人很难在工作中集中注意力。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of weakening someone or something; a loss of strength.","zh":"使（人或事物）衰弱的过程；力量的削弱。"},"examples":[{"en":"Doctors warned that dehydration can lead to the enervation of the body.","zh":"医生警告说，脱水会导致身体机能衰弱。"},{"en":"He worried that constant stress would result in the enervation of his motivation.","zh":"他担心持续的压力会削弱自己的动力。"}]}],"synonyms":["fatigue","weariness","exhaustion","weakness","lassitude","debilitation"],"phonetic":"/ˌɛnɚˈveɪʃən/","extraExplanation":["词源提示：enervation 来自拉丁语“enervare”，原意是“去掉筋/神经，使无力”。因此它常带有“被抽走力量、变得软弱”的语感，语体偏正式，常见于文学、医学或较正式的写作中。","易混点：它不是“兴奋/激励”（这类通常用 energize, invigorate），而是相反的“使人没劲、疲乏”。也别和 irritation（烦躁）混淆：enervation 更强调“无力、疲惫”。"]}
{"word":"enervations","summary":{"en":"“Enervations” means feelings or instances of being weakened and drained of energy, or the process of weakening.","zh":"“enervations”指“疲惫无力的状态/表现”，也可指“使…变虚弱的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of being weakened or drained of energy; exhaustion","zh":"精疲力竭；无力感；元气被抽空的状态"},"examples":[{"en":"After weeks of overtime, she felt a deep enervation and could barely focus.","zh":"连续加班几周后，她感到深深的疲惫，几乎无法集中注意力。"},{"en":"The heat caused enervation in the afternoon, so we took a short break.","zh":"下午的高温让人疲惫无力，所以我们休息了一会儿。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of weakening someone or something","zh":"使（人或事物）变得虚弱的行为或过程"},"examples":[{"en":"The constant criticism led to the enervation of his confidence.","zh":"持续的批评使他的自信心逐渐被削弱。"},{"en":"Some argued that the policy would bring the enervation of local communities.","zh":"有人认为这项政策会削弱地方社区的活力。"}]}],"synonyms":["exhaustion","fatigue","weakness","lassitude","drain"],"phonetic":"/ˌɛnɚˈveɪʃən/","extraExplanation":["“enervations” 是名词复数，单数是 “enervation”。也常用作不可数名词来表示“疲惫、虚弱”的状态。","词源来自拉丁语 enervare，原意是“削弱筋力/力量”（字面可理解为“去掉力量”）。","学习者常把它和 “energize（使精力充沛）” 搞混：enervate / enervation 的意思恰恰相反，是“使无力”。","不要与医学/生理学里的 “innervation（神经支配）” 或 “denervation（去神经支配）” 混淆：它们更偏专业术语。"]}
{"word":"enervative","summary":{"en":"Enervative describes something that drains your energy and leaves you feeling weak or tired.","zh":"Enervative 用来形容某事物会消耗精力，让人感到无力或疲惫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making you feel weak, tired, or lacking energy; draining.","zh":"使人无力的；令人疲惫的；消耗精力的。"},"examples":[{"en":"The long, humid afternoon was enervative, and everyone worked more slowly.","zh":"漫长又潮湿的午后很消耗精力，大家工作都慢了下来。"},{"en":"Endless meetings can be mentally enervative.","zh":"没完没了的会议会让人精神上很疲惫。"}]}],"synonyms":["draining","exhausting","fatiguing","debilitating","sapping"],"phonetic":"/ɪˈnɝːvətɪv/","extraExplanation":["常见易混：enervative（使人无力、耗尽精力）和 invigorating（使人精神振奋、充满活力）是反义。","词源提示：来自拉丁语 enervare，原意接近“去筋/削弱力量”。因此它不是“让人紧张(nervous)”的意思，而是“让人没力气”。"]}
{"word":"enervator","summary":{"en":"An enervator is something or someone that makes you feel weak, tired, or less energetic.","zh":"enervator 指使人感到虚弱、疲惫或精力下降的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, thing, or influence that makes someone feel weak, tired, or lacking energy.","zh":"使人衰弱、疲惫或失去精力的人、事物或影响。"},"examples":[{"en":"For him, constant bad news was an enervator that drained his motivation.","zh":"对他来说，持续的坏消息是一种“使人衰弱的因素”，会耗尽他的动力。"},{"en":"Long meetings can be an enervator, especially late in the afternoon.","zh":"冗长的会议可能是让人疲惫的“耗能因素”，尤其是在下午晚些时候。"}]}],"synonyms":["weakener","drain","fatiguer","debilitator","sapper"],"phonetic":"/ˈɛnərˌveɪtər/","extraExplanation":["“enervator”比较少见，更常用的表达是：something is enervating（令人疲乏的）或 it enervates someone（使某人疲乏）。","词源：来自拉丁语 enervare，原意与“去除筋力/力量”相关（e- ‘out’ + nervus ‘sinew, nerve’）。在现代英语里，“nerve”既可指“神经”也可指“勇气”，所以 enervate 强调“削弱精力/使人无力”。","注意不要与“energizer（使人更有精神的事物）”混淆：enervator 是让你更累的东西，energizer 是让你更有劲的东西。"]}
{"word":"enervators","summary":{"en":"“Enervators” are people or things that drain energy or weaken strength.","zh":"“enervators”指会消耗精力、削弱力量的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that weaken someone’s energy, strength, or enthusiasm; agents that cause fatigue or loss of vitality.","zh":"使人失去精力、力量或热情的人或事物；导致疲惫、衰弱的因素。"},"examples":[{"en":"Long meetings with no breaks can be real enervators for the whole team.","zh":"没有休息的长会议对整个团队来说真是让人精疲力竭的因素。"},{"en":"In the summer, heat and humidity are common enervators, especially for outdoor workers.","zh":"夏天的高温和潮湿是常见的“消耗精力”的因素，尤其对户外工作者。"},{"en":"She tried to remove small enervators from her day, like constant phone notifications.","zh":"她试着从日常中去除一些小小的“精力杀手”，比如不停的手机通知。"}]}],"synonyms":["drainers","debilitators","exhausters","fatiguers"],"phonetic":"/ˈɛnərˌveɪtərz/","extraExplanation":["“enervators”是名词复数，单数是“enervator”。它来自动词“enervate”（使衰弱、使失去精力）。词根来自拉丁语“nervus”（神经、力量），加上前缀“e-/en-”有“使……失去”的感觉，所以整体含义偏向“削弱精力/活力”。","学习提示：不要把“enervate”误解为“energize”（使有活力）。两者看起来相似，但意思几乎相反。"]}
{"word":"enerve","summary":{"en":"Enervate means to weaken or drain energy from someone or something.","zh":"Enervate 指使人或事物变得虚弱、精力被耗尽、力量被削弱。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to weaken someone or make them feel drained of energy; to reduce strength or vitality","zh":"使虚弱；使精力衰竭；削弱（力量或活力）"},"examples":[{"en":"The long heat wave enervated the whole city.","zh":"持续的热浪让整座城市都疲惫不堪。"},{"en":"Too many late nights can enervate your body and mind.","zh":"熬夜太多会让你的身心都变得虚弱。"},{"en":"The team felt enervated after hours of training without a break.","zh":"连续训练数小时不休息后，队员们感到精疲力尽。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common, older use) to deprive of nerves or vigor; to make less forceful","zh":"（较少见/旧用法）使失去神经或元气；使变得不那么有力"},"examples":[{"en":"In older writing, the author says fear can enervate a nation’s spirit.","zh":"在较早的文字里，作者说恐惧会削弱一个民族的精神。"}]}],"synonyms":["weaken","sap","drain","exhaust","debilitate","enfeeble"],"phonetic":"/ˈɛnərˌveɪt/","extraExplanation":["“enerve”常被当作“enervate”的拼写错误。标准英语里更常用的词是 enervate。","易混淆点：enervate 的核心是“让人没力气/被削弱”，不是“让人生气”。“让人生气”更常用 irritate / annoy。","词源提示：来自拉丁语 e-（向外）+ nervus（神经/力量），早期含义与“去除力量”相关。"]}
{"word":"enervous","summary":{"en":"Enervous (archaic) means weak, lacking energy, or worn out.","zh":"enervous（古旧用法）指虚弱、缺乏精力、疲惫无力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) Lacking strength or energy; weakened and tired.","zh":"（古旧或文学用语）虚弱的；无力的；疲惫的。"},"examples":[{"en":"After weeks of illness, he felt enervous and could barely climb the stairs.","zh":"生病几周后，他感到很虚弱，几乎爬不动楼梯。"},{"en":"The hot, humid afternoon left everyone enervous and quiet.","zh":"闷热潮湿的午后让大家都变得无精打采、很安静。"},{"en":"She spoke in an enervous voice, as if all her strength had drained away.","zh":"她用虚弱的声音说话，仿佛力气都被抽走了。"}]}],"synonyms":["weak","feeble","exhausted","drained","enervated"],"phonetic":"/ɪˈnɝːvəs/","extraExplanation":["“enervous”现在很少用，更常见的是形容词“enervated”（被削弱的、使人疲惫的）或动词“enervate”（使虚弱、使失去活力）。","词源来自拉丁语 *enervare*，字面意思是“去掉肌肉/筋（nerve/sinew）”，引申为“削弱力量”。注意这里的“nerve”是“筋/力气”的旧义，不是现代常见的“紧张、焦虑”的“nervous（紧张的）”。"]}
{"word":"ENET","summary":{"en":"ENET is usually a context-dependent abbreviation, often referring to Ethernet networking.","zh":"ENET 通常是依语境而定的缩写，常指以太网相关的网络/接口。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in tech contexts to refer to an Ethernet network (a wired local area network) or to something related to Ethernet networking; exact meaning can vary by document or organization.","zh":"在科技语境中常用作缩写，指以太网（Ethernet）网络或与以太网相关的事物；在不同文件或机构中具体含义可能不同。"},"examples":[{"en":"Connect the printer to the ENET port on the router.","zh":"把打印机连接到路由器的 ENET 接口。"},{"en":"The device supports Wi‑Fi and ENET for internet access.","zh":"这台设备支持 Wi‑Fi 和 ENET 进行网络连接。"}]},{"partOfSpeech":"other","definition":{"en":"a name/label sometimes used for companies, products, or stock tickers (written as ENET); meaning depends on the specific context.","zh":"有时用作公司名、产品名或股票代码（写作 ENET）的标签；含义取决于具体语境。"},"examples":[{"en":"ENET rose sharply in early trading.","zh":"ENET 在早盘交易中大幅上涨。"},{"en":"Please check ENET’s official documentation for setup steps.","zh":"请查看 ENET 的官方文档了解安装步骤。"}]}],"synonyms":["Ethernet","LAN","ETH (label)"],"phonetic":"/ˈiːnɛt/","extraExplanation":["“ENET/Enet”不是一个固定词义的普通英文单词，更常见于缩写或标签。很多设备上会把以太网口标为“ENET”（也常见写法：ETH、LAN）。","如果你是在说明书/设备接口/股票行情里看到的 ENET，最好提供一句原文或截图上下文，我可以帮你确定它在该处最准确的含义。"]}
{"word":"enetophobia","summary":{"en":"Enetophobia means a strong fear of pins or needles (fear of being pricked).","zh":"Enetophobia 指对针/别针/针头或被刺到的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense or irrational fear of pins, needles, or being pricked by sharp objects","zh":"对针、别针、针头或被尖锐物刺到的强烈/非理性恐惧"},"examples":[{"en":"Because of enetophobia, she avoids sewing and won’t touch safety pins.","zh":"因为有针恐惧（enetophobia），她会避免缝纫，也不愿碰别针。"},{"en":"His enetophobia made vaccinations very stressful for him.","zh":"他的针恐惧让打疫苗这件事对他来说非常有压力。"},{"en":"The nurse explained the steps slowly to help with the patient’s enetophobia.","zh":"护士慢慢解释每个步骤，以帮助缓解病人的针恐惧。"}]}],"synonyms":["needle phobia","trypanophobia (more common for injections)","fear of needles"],"phonetic":"/ˌɛnɪtəˈfoʊbiə/","extraExplanation":["这个词比较少见，常见医学/日常用语更常用 **trypanophobia**（对打针/注射针头的恐惧）或更笼统的 **needle phobia**（针恐惧）。如果你的恐惧主要是“抽血、注射、疫苗”等场景，用 trypanophobia 会更准确。","构词上，**-phobia** 来自希腊语，表示“恐惧”。在英文里很多心理/恐惧相关词会用这个后缀（如 arachnophobia 蜘蛛恐惧）。"]}
{"word":"eneuch","summary":{"en":"A eunuch is a castrated man, historically often serving in royal courts; it can also be an offensive insult meaning a man seen as lacking masculinity.","zh":"eunuch 指阉人/太监（历史上常在宫廷中任职）；也可作侮辱性说法，指被认为缺乏男子气概的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A castrated man (historically often employed as a palace servant, guard, or official).","zh":"阉人；太监（历史上常在宫廷中担任侍从、守卫或官员）。"},"examples":[{"en":"In some ancient courts, eunuchs guarded the inner palace.","zh":"在一些古代宫廷里，太监负责守卫内廷。"},{"en":"The novel describes a eunuch who rose to political power.","zh":"小说描写了一位掌权的太监。"}]},{"partOfSpeech":"n.","definition":{"en":"A man seen as lacking sexual power or masculinity (often insulting or offensive).","zh":"（贬义、常具冒犯性）被认为缺乏性能力或“男子气概”的人。"},"examples":[{"en":"Using “eunuch” as an insult is derogatory and can be hurtful.","zh":"把“eunuch”当作辱骂用语带有贬损意味，可能伤人。"}]}],"synonyms":["castrate (historical context)","palace eunuch","court eunuch"],"phonetic":"/ˈjuːnək/","extraExplanation":["你输入的拼写更常见的标准形式是 **eunuch**（你写的是 *eneuch*）。","“eunuch/太监”在不同文化中都有历史记录：如中国宫廷的宦官制度、拜占庭帝国与奥斯曼宫廷中的阉人官僚等。相关叙述常见于历史书与文学作品，但现代语境里使用时要注意尊重与敏感性。","词源来自希腊语 *eunoukhos*，常被解释为“床的守护者/看守内室的人”，反映其在宫廷内廷服务与守卫的历史角色。"]}
{"word":"eneugh","summary":{"en":"“Enough” means “sufficient” (as much as needed). It can be an adjective, adverb, pronoun, or an interjection meaning “Stop—this is too much.”","zh":"“Enough”表示“足够的/充分的”。可作形容词、副词、代词，也可作感叹词表示“够了，别再这样了”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"As much as is needed; sufficient in amount, degree, or level.","zh":"足够的；充足的（数量、程度或水平达到需要）"},"examples":[{"en":"Do we have enough time to finish the project?","zh":"我们有足够的时间完成这个项目吗？"},{"en":"This room is big enough for five people.","zh":"这个房间足够大，容得下五个人。"}]},{"partOfSpeech":"adv.","definition":{"en":"To a sufficient degree; sufficiently.","zh":"足够地；充分地"},"examples":[{"en":"I didn’t sleep enough last night.","zh":"我昨晚睡得不够。"},{"en":"If you practice enough, you’ll improve quickly.","zh":"如果你练习得足够多，你会进步很快。"}]},{"partOfSpeech":"pron.","definition":{"en":"A sufficient amount; all that is needed.","zh":"足够的数量；所需的一切"},"examples":[{"en":"I’ve had enough for today.","zh":"我今天已经够了。"},{"en":"Is there enough for everyone?","zh":"够每个人分吗？"}]},{"partOfSpeech":"int.","definition":{"en":"Used to say you want something to stop because it is too much or you are annoyed.","zh":"够了！（用于表示受够了、希望停止）"},"examples":[{"en":"Enough! Stop arguing right now.","zh":"够了！立刻别吵了。"},{"en":"That’s enough, please don’t shout.","zh":"够了，请不要喊。"}]}],"synonyms":["sufficient","adequate","plenty (of)","enough of (used with nouns)"],"phonetic":"/ɪˈnʌf/","extraExplanation":["你输入的“eneugh”常见拼写错误，正确拼写是“enough”。","发音提示：enough 结尾的 -ough 在这里读作 /f/（类似“stuff”里的 f），不是 /oʊ/。","常见搭配：enough + 名词（enough money 足够的钱）；形容词/副词 + enough（big enough 足够大；well enough 够好）。注意位置不同。"]}
{"word":"enew","summary":{"en":"“Enew” is not a standard English word; it’s usually a misspelling of “anew” (“again; starting over; in a new way”).","zh":"“enew”不是标准英语单词；通常是把“anew”拼错了，意为“再次；重新开始；以新的方式”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard.) Often a misspelling of “anew,” meaning again or in a new way.","zh":"（非标准用法）常见为“anew”的拼写错误，意为“再一次；以新的方式”。"},"examples":[{"en":"I think you mean “anew”: She decided to start anew in a different city.","zh":"你可能想写“anew”：她决定在另一座城市重新开始。"},{"en":"Try writing the sentence anew with simpler words.","zh":"试着用更简单的词把这句话重新写一遍。"}]},{"partOfSpeech":"adv.","definition":{"en":"Anew: again; starting over; in a new way (used mainly in writing and formal speech).","zh":"Anew：再次；重新开始；以新的方式（多用于书面语或较正式表达）。"},"examples":[{"en":"After the storm, the town began anew.","zh":"暴风雨过后，这座小镇重新开始建设。"},{"en":"Let’s look at the problem anew.","zh":"我们换个角度重新看这个问题。"},{"en":"They found hope anew when help arrived.","zh":"当援助到来时，他们重新燃起了希望。"}]}],"synonyms":["again","afresh","over again","from scratch"],"phonetic":"/əˈnuː/","extraExplanation":["“anew” = a-（表示“在…中/向…”的前缀）+ new（新的），整体表达“重新变得新”“重新开始”。在现代英语里它比“again”更有文学感、更正式。","文学/常见引语里常出现类似表达，例如：\"born anew\"（获得新生）、\"begin anew\"（重新开始）。","如果你本来想表达“足够/很多”，可能是另一个词“enough”（足够的/足够地），或古体词“enow”（很多的/足够的，较少见）。"]}
