{"word":"enface","summary":{"en":"Enface means “directly in front” or “face to face,” and can also mean “openly; head-on.”","zh":"enface 指“在正前方/面对面”，也可引申为“直面问题、坦率地处理”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"directly in front; face to face; openly and without avoiding the issue","zh":"在正前方；面对面；坦率地（不回避问题）"},"examples":[{"en":"The two leaders met enface for the first time.","zh":"两位领导人首次面对面会晤。"},{"en":"You need to address the problem enface instead of hinting around it.","zh":"你需要坦率地面对这个问题，而不是拐弯抹角。"}]}],"synonyms":["face to face","directly","head-on","openly"],"phonetic":"/ɛnˈfeɪs/","extraExplanation":["“enface”来源于法语（en face），字面意思是“在……的脸/面前”。在现代英语里它相对少见，更常见的表达是 “face to face / directly / head-on”。在正式写作、法律或较文学化的语境中偶尔会看到。"]}
{"word":"enfaced","summary":{"en":"Enfaced is a rare form meaning “given a facing/covering” or “faced directly”; it can also describe something shown face-on.","zh":"Enfaced 较少见，可指“加贴面/外层覆盖”或“正面面对”；也可形容“正面朝向/正面呈现”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of enface) to put a facing surface on; to cover or line the front of something.","zh":"（enface 的过去式/过去分词）给……加外层/饰面；把……的正面包覆或贴面。"},"examples":[{"en":"The stone wall was enfaced with brick to match the older buildings.","zh":"石墙外层贴了砖面，好与老建筑的风格一致。"},{"en":"The cabinets were enfaced with oak veneer for a warmer look.","zh":"橱柜贴上了橡木木皮，让外观看起来更温暖。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to confront or face directly; to meet something head-on.","zh":"（罕见）正面面对；迎向（问题、危险等）。"},"examples":[{"en":"She enfaced the criticism calmly and explained her decision.","zh":"她冷静地正面回应批评，并解释了自己的决定。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, literary/technical) shown or positioned face-on; facing the viewer.","zh":"（罕见，文学/技术用法）正面朝向的；面向观看者的。"},"examples":[{"en":"In the illustration, the figure is enfaced rather than in profile.","zh":"在插图中，这个人物是正面而不是侧面呈现。"}]}],"synonyms":["faced","covered","veneered","confronted","met head-on"],"phonetic":"ɛnˈfeɪst","extraExplanation":["“enfaced”在现代英语里非常少见，多数场景会用更常见的表达：\n- 表示“贴面/饰面”时：faced with, covered with, veneered。\n- 表示“正面面对”时：face, confront。\n如果你是在某段原文里看到它，告诉我上下文句子，我可以帮你判断最贴切的含义。"]}
{"word":"enfacement","summary":{"en":"Enfacement is a rare noun meaning either adding a facing/outer surface to something or, less commonly, the way a face is presented or depicted.","zh":"Enfacement 是个较少见的名词，主要指给物体加“饰面/外层”，较少也可指面孔的呈现或描绘方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of adding a facing or outer surface (for example, a layer of stone, brick, or another material) to cover and finish something","zh":"（较少用）给……加“面层/饰面”的行为或过程；用外层材料覆盖并完成表面处理（如石材、砖或其他材料）"},"examples":[{"en":"The old wall needed enfacement with new stone to protect it from weather.","zh":"这面旧墙需要用新石材做饰面（enfacement），以防风雨侵蚀。"},{"en":"They chose a smooth cement enfacement for the exterior of the building.","zh":"他们为建筑外墙选择了光滑的水泥饰面（enfacement）。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the placing, presenting, or depiction of a face; the way a face is shown in art or description","zh":"（罕用）“脸/面孔”的呈现或描绘；在艺术或文字中展现面孔的方式"},"examples":[{"en":"The painter’s enfacement of the subject is calm and direct.","zh":"画家对人物面孔的呈现（enfacement）平静而直接。"},{"en":"In the novel, her enfacement changes with each emotion.","zh":"在小说里，她的面孔呈现（enfacement）会随着情绪而变化。"}]}],"synonyms":["facing","cladding","overlay","veneering","surface covering"],"phonetic":"/ɛnˈfeɪsmənt/","extraExplanation":["这个词非常少见，更常见的是 enface（“正面地/在正面”）或 effacement（“抹去、抹消”）。enfacement 由 en-（“使……处于某种状态/加上”）+ face（“表面/脸”）构成，因此含义多与“加饰面、使有表面”或“面孔的呈现”相关。遇到写作或阅读中出现时，可结合上下文判断是建筑材料的“饰面/贴面”，还是艺术描写的“面孔呈现”。"]}
{"word":"enfaces","summary":{"en":"“En face” means “face to face” or “on the facing page.” “Enfaces” is rarely used as a verb form of “enface.”","zh":"“en face”常指“面对面/迎面”，也可指“在对页（对照排版）”。“enfaces”作为动词 enface 的形式非常少见。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"face to face; directly in front of someone or something; head-on.","zh":"面对面；在……正前方；迎面、正面地。"},"examples":[{"en":"They sat en face and talked for hours.","zh":"他们面对面坐着聊了好几个小时。"},{"en":"The car came en face, so I stepped back onto the sidewalk.","zh":"车迎面驶来，所以我退回到人行道上。"}]},{"partOfSpeech":"phrase","definition":{"en":"(books/printing) on the facing page; side by side for comparison (often in bilingual editions).","zh":"（书籍/排版）在对页；并排对照（常见于双语读物）。"},"examples":[{"en":"The translation is printed en face with the original text.","zh":"译文与原文以对页形式印刷，便于对照。"},{"en":"In this edition, notes appear en face on the right-hand page.","zh":"在这个版本里，注释出现在右侧的对页上。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to put a face on; to adorn or cover the front of something. “enfaces” is the third-person singular present form.","zh":"（罕见）给……装饰正面；覆盖其表面。“enfaces”为第三人称单数现在时。"},"examples":[{"en":"A carved panel enfaces the cabinet door.","zh":"一块雕刻面板装饰着柜门正面。"}]}],"synonyms":["face to face","directly","head-on","opposite","on the facing page"],"phonetic":"/ɑn ˈfeɪs/","extraExplanation":["“en face”来自法语，意思是“在（某人/某物）对面”。英语里多用于较正式或书面语；日常口语更常说 face to face / directly / head-on。","你输入的“enfaces”单独出现时不常见：更可能是把短语“en face”写成了一个词，或是在阅读中遇到非常少见的动词 enface 的变形。"]}
{"word":"enfacing","summary":{"en":"“Enfacing” is a rare word meaning “facing or confronting directly.” In modern English, people usually say “facing” or “confronting.”","zh":"“enfacing”较少见，意思是“正面面对/直接对抗”。现代英语中通常用“facing”或“confronting”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Facing or confronting directly; meeting something head-on.","zh":"（罕见）正面面对；直接对抗；迎面而来。"},"examples":[{"en":"Enfacing the challenge, she spoke calmly and clearly.","zh":"她正面迎接挑战，语气冷静清晰。"},{"en":"He stood still, enfacing the crowd’s questions.","zh":"他站着不动，正面应对人群的提问。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of “enface” (rare): to face or confront directly.","zh":"“enface”的现在分词（罕见）：正面面对；直接对峙。"},"examples":[{"en":"They were enfacing a difficult decision together.","zh":"他们一起正面面对一个艰难的决定。"},{"en":"A modern rewrite might prefer “facing” instead of “enfacing.”","zh":"现代改写时，往往会用“facing”替代“enfacing”。"}]}],"synonyms":["facing","confronting","meeting","standing up to"],"phonetic":"/ɛnˈfeɪsɪŋ/","extraExplanation":["“enfacing”在现代英语里非常少见，通常属于较旧或较文学化的用法。日常表达里更常用：facing / confronting / meeting (a problem).","注意不要和法语短语“en face”（意为“在对面；当面；正对着”）混淆；“en face”通常分开写，作副词或介词短语使用。"]}
{"word":"enfamish","summary":{"en":"Enfamish is an archaic verb meaning to starve—either to cause hunger or to become extremely hungry.","zh":"Enfamish 是个较古的动词，意思是“使人挨饿/使饥饿”或“（自己）极度饥饿”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To make someone very hungry; to starve or cause to be famished.","zh":"（古/文）使（人）挨饿；使饥饿；使饥荒般缺粮。"},"examples":[{"en":"The long siege enfamished the people inside the city walls.","zh":"长期围城使城墙内的人们饥饿难耐。"},{"en":"Poor harvests can enfamish whole communities if food is not brought in.","zh":"歉收若没有外来粮食补给，可能会让整个社区陷入饥饿。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Archaic) To become extremely hungry; to suffer from hunger.","zh":"（古/文）变得极其饥饿；受饥饿之苦。"},"examples":[{"en":"Without food for days, the travelers enfamished on the road.","zh":"几天没有食物，旅人们在路上饥饿不堪。"}]}],"synonyms":["starve","famish","make hungry","go hungry"],"phonetic":"/ɪnˈfæmɪʃ/","extraExplanation":["“enfamish”在现代英语中很少用，读到时多见于较早期文学作品或仿古文风的写作。日常表达通常用“starve”“make (someone) hungry”“go hungry”。","词首“en-”常有“使…处于某种状态/使成为…”的意思（如“encourage”“enrich”），所以“enfamish”字面上可理解为“使…饥饿”。"]}
{"word":"enfamous","summary":{"en":"Enfamous is a rare verb meaning “make famous,” and sometimes “make infamous.”","zh":"enfamous 是个罕用动词，意为“使出名”，有时也指“使恶名远扬”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To make someone or something famous; to celebrate publicly.","zh":"（罕用）使……出名；颂扬、传颂。"},"examples":[{"en":"The poet’s verses were meant to enfamous the heroes of his city.","zh":"这位诗人的诗句旨在让他城邦的英雄名扬四方。"},{"en":"A single victory can enfamous an athlete overnight.","zh":"一次胜利就能让运动员一夜成名。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare, sometimes ironic) To make someone or something well-known for a bad reason; to make infamous.","zh":"（罕用，有时带讽刺）使……因坏名声而出名；使臭名昭著。"},"examples":[{"en":"The scandal enfamoused the company more than its products ever did.","zh":"这场丑闻让这家公司“出名”的程度超过了它的产品。"},{"en":"History can enfamous a leader for cruelty as well as for achievements.","zh":"历史既可能因成就而让一位领导者出名，也可能因残酷而让其恶名远扬。"}]}],"synonyms":["make famous","celebrate","bring fame to","make infamous","disgrace"],"phonetic":"/ɛnˈfeɪməs/","extraExplanation":["“enfamous”在现代英语中非常少见，日常表达通常用更常见的词：正面含义用“make (someone) famous / bring fame to / celebrate”，负面含义用“make (someone) infamous / disgrace”。","词首“en-”常有“使……处于某种状态”的意思（如“enable, enrich”），因此“enfamous”字面上就是“使……有名”。"]}
{"word":"enfant","summary":{"en":"“Enfant” is French for “child,” used in English mostly in set phrases like “enfant terrible.”","zh":"“Enfant” 是法语“孩子”的意思，在英语中多用于固定搭配，如 “enfant terrible”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A French word meaning “child,” sometimes used in English mainly in set phrases (especially in art, fashion, and literature contexts).","zh":"法语词，意思是“孩子/儿童”；在英语中偶尔借用，多见于固定搭配（尤其在艺术、时尚、文学语境）。"},"examples":[{"en":"In the novel, the narrator calls her little brother an enfant, using French for style.","zh":"在小说里，叙述者称弟弟为 enfant，用法语来增加文风。"},{"en":"The review described the painter as an enfant terrible of the art world.","zh":"评论称这位画家是艺术界的 enfant terrible（“惹事的天才/离经叛道的风云人物”）。"}]}],"synonyms":["child","kid","youngster"],"phonetic":"/ɑ̃ˈfɑ̃/","extraExplanation":["在现代英语里，单独使用 enfant 比较少见，更多是作为法语“氛围词”出现在文学描写或评论中；最常见的固定搭配是 enfant terrible，指“才华出众但言行叛逆、常让圈内人头疼的人”。","发音提示：词尾的 -nt 在法语里通常不完全读出英语那种 /nt/，英语借用时也常读得更轻。"]}
{"word":"enfants","summary":{"en":"Enfants is French for “children,” mostly used in English in French titles or set phrases.","zh":"Enfants是法语“孩子们”，在英语里主要出现在法语标题或固定短语中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) children; the plural of enfant (“child”). In English, it is mainly seen in French titles, names, menus, or set phrases.","zh":"（法语）孩子们；enfant（孩子）的复数。在英语里多见于法语标题、名称、菜单或固定短语中。"},"examples":[{"en":"The museum had a French program called “Atelier pour enfants” (workshop for children).","zh":"博物馆有一个法语项目叫“Atelier pour enfants”（儿童工作坊）。"},{"en":"The book title includes the word enfants, meaning it focuses on children.","zh":"书名里有enfants这个词，意思是内容与儿童有关。"}]}],"synonyms":["children","kids"],"phonetic":"/ɑnˈfɑnts/","extraExplanation":["在英语语境中，单独写enfants通常是为了保留“法语风格”（例如活动名称、文学/电影标题、歌曲名）。如果你在普通英文句子里想表达“孩子们”，更自然的说法是children或kids。","你可能见过固定表达enfant terrible（复数enfants terribles），指“特立独行、爱挑战权威的人”（常用于艺术界、时尚界或公众人物），带一点戏谑或评价色彩。"]}
{"word":"enfarce","summary":{"en":"“Enfarce” is a rare verb meaning to stuff food with a savory filling (farce).","zh":"“Enfarce”是个罕用动词，指给食物塞入咸香馅料（尤指肉馅farce）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To stuff (food) with a filling, especially a seasoned meat mixture (a “farce”).","zh":"（罕用）给（食物）塞馅；尤指用调味肉馅（farce）填塞。"},"examples":[{"en":"The chef enfarced the chicken with herbs and minced pork before roasting it.","zh":"厨师把鸡用香草和猪肉末塞馅后再烤。"},{"en":"In older recipes, you may see “enfarce the fish” meaning to fill it with a savory stuffing.","zh":"在较早的食谱里，你可能会看到“enfarce the fish”，意思是给鱼塞入咸香的馅料。"}]}],"synonyms":["stuff","fill","farcir (culinary term)"],"phonetic":"/ɛnˈfɑrs/","extraExplanation":["这个词在现代英语里非常少见，多出现在古典/法式烹饪语境中，来源与法语烹饪用语有关。日常更常用的表达是：stuff (something) / fill (something) with stuffing。","注意不要和常见词 enforce（执行；强制实施）混淆。两者拼写相近，但意思完全不同。"]}
{"word":"enfasten","summary":{"en":"“Enfasten” means to fasten or secure something firmly (rare/old-fashioned).","zh":"“enfasten”意为把……扣紧、系牢、固定（较罕见/偏旧用法）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fasten or attach something securely; to make something tight or fixed in place","zh":"把……系牢/扣紧；使固定、紧固"},"examples":[{"en":"She enfstened the strap so the bag wouldn’t slip.","zh":"她把带子系牢，这样包就不会滑落。"},{"en":"Use a clip to enfasten the papers together.","zh":"用夹子把这些纸夹在一起。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare/old-fashioned) to become fastened or fixed in place","zh":"（罕见/较旧）被扣住；固定住"},"examples":[{"en":"The latch didn’t fully enfasten, so the door kept opening.","zh":"门闩没有完全扣住，所以门一直开。"}]}],"synonyms":["fasten","attach","secure","fix","tighten"],"phonetic":"/ɛnˈfæsən/","extraExplanation":["“enfasten”在现代英语中非常少见，通常会用更常见的动词如“fasten / attach / secure”。它带有较强的书面或古旧色彩，偶尔出现在较老的文本或仿古风格的写作里。"]}
{"word":"enfatico","summary":{"en":"Emphatic means strongly emphasized, clear, and forceful in meaning or tone.","zh":"emphatic 指“强调的、语气强烈而明确的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Expressed with strong emphasis, certainty, or feeling; very clear and forceful.","zh":"强调的；斩钉截铁的；语气强烈的。"},"examples":[{"en":"She gave an emphatic “no” when he asked to borrow her car.","zh":"他借车时，她斩钉截铁地说“不要”。"},{"en":"The report is emphatic about the need to reduce costs.","zh":"报告明确强调必须降低成本。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of speech or writing) Using stress or emphasis to highlight a word or idea.","zh":"（指说话/写作）通过重读或强调来突出某个词或观点的。"},"examples":[{"en":"In English, we can be emphatic by stressing a word: “I *did* call you.”","zh":"英语里可以用重读来表示强调：“我*确实*给你打过电话。”"},{"en":"His emphatic tone made everyone pay attention.","zh":"他强调性的语气让大家都注意了起来。"}]}],"synonyms":["forceful","strong","definite","insistent","stressed"],"phonetic":"/ɪmˈfætɪk/","extraExplanation":["“enfático”是西班牙语/葡萄牙语里的“强调的”，对应常见英文词是 **emphatic**。","常见搭配：**an emphatic yes/no**（明确的肯定/否定）、**be emphatic about**（对……强调/坚称）、**emphatic tone**（强调的语气）。","词族：**emphasis**（n. 强调），**emphasize**（v. 强调），**emphatically**（adv. 斩钉截铁地）。"]}
{"word":"enfavor","summary":{"en":"“In favor (of)” means supporting something, doing something to help someone, or being advantageous to one side.","zh":"“in favor (of)”表示“支持/赞同”，也可表示“帮某人一个忙”或“对……有利”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"supporting someone or something; approving of an idea or plan","zh":"支持；赞同（某人/某事或某个想法/计划）"},"examples":[{"en":"Most students are in favor of longer library hours.","zh":"大多数学生赞成图书馆延长开放时间。"},{"en":"Are you in favor of the new rule?","zh":"你赞成这条新规定吗？"},{"en":"The vote was 8–2 in favor of the proposal.","zh":"投票结果是8比2，赞成该提案。"}]},{"partOfSpeech":"phrase","definition":{"en":"for the benefit of someone; to help someone (often used in formal requests)","zh":"为了……的利益；帮……一个忙（常用于较正式的请求）"},"examples":[{"en":"Could you do me a favor and email this file?","zh":"你能帮我个忙，把这个文件发邮件吗？"},{"en":"She spoke in favor of her coworker during the meeting.","zh":"她在会议上为同事说好话/辩护。"}]},{"partOfSpeech":"phrase","definition":{"en":"giving an advantage to one side; beneficial to","zh":"对……有利；使……占优势"},"examples":[{"en":"The warm weather is in favor of the crops this year.","zh":"今年的暖和天气对庄稼有利。"},{"en":"These results are in favor of our main argument.","zh":"这些结果支持/有利于我们的主要论点。"}]}],"synonyms":["in support of","for","supportive of","pro"],"phonetic":"/ɪn ˈfeɪvər/","extraExplanation":["“enfavor”不是常见英语拼写。你可能想写的是 **in favor (of)**（美式英语常用拼写；英式也常见 **in favour (of)**）。","如果你是在写西班牙语的 **en favor de**（意为“为了/支持”），对应的自然英文通常是 **in favor of** 或 **in support of**。"]}
{"word":"enfeature","summary":{"en":"A rare literary verb meaning “to shape with distinct features” or “to depict vividly.”","zh":"一个罕见的文学动词，意为“塑造出鲜明特征”或“生动刻画/描绘”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare, literary) To give someone or something distinctive features; to form or shape in appearance.","zh":"（罕见，文学用语）赋予（人或物）鲜明的外貌特征；使成形、塑造外观。"},"examples":[{"en":"Time can enfeature a face with lines of experience.","zh":"岁月会在人的脸上刻下经历的纹路，形成鲜明的特征。"},{"en":"The sculptor tried to enfeature the clay into a calm, gentle expression.","zh":"雕塑家努力把泥塑塑造成平静温柔的神情。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare, literary) To portray or describe with clear features; to depict vividly.","zh":"（罕见，文学用语）把特征描写清楚；生动刻画、描绘。"},"examples":[{"en":"The novel enfeatures the city as both beautiful and cruel.","zh":"这部小说把这座城市刻画得既美丽又残酷。"},{"en":"In a few lines, the poet enfeatures a lonely traveler.","zh":"诗人用寥寥数行就生动刻画出一位孤独的旅人。"}]}],"synonyms":["shape","form","mold","depict","portray","characterize"],"phonetic":"/ɛnˈfiːtʃər/","extraExplanation":["“enfeature”在现代英语中非常少见，更常见的是名词/动词“feature”（特征；以……为特色/主角）。在古典或文学语境里，你可能会看到过去分词形式“enfeatured”（意为“具有……面貌/特征的；被塑造出特征的”），带有较强的文艺色彩。","词形上可理解为 en-（使……进入某种状态）+ feature（特征/面貌），因此整体有“使之有面貌/特征”的感觉。日常写作通常用“shape, form, give…features, depict, portray”等更自然。"]}
{"word":"enfect","summary":{"en":"“Enfect” isn’t a standard English word; it’s usually a misspelling of “infect,” meaning to spread disease or harmfully influence something (including computers).","zh":"“enfect” 不是标准英语单词；通常是 “infect” 的拼写错误，意为“感染/传染”，也可指（比喻）不良影响或让电脑中病毒。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Usually intended to mean “infect.”","zh":"（常见拼写错误）通常想表达的是 “infect（感染）”。"},"examples":[{"en":"“Enfect” is not a standard spelling; you probably mean “infect.”","zh":"“enfect” 不是标准拼写；你可能想写的是 “infect”。"}]},{"partOfSpeech":"vt.","definition":{"en":"To pass a disease or harmful germ/virus to a person, animal, or plant; to cause illness by germs.","zh":"（使）感染；把病菌/病毒传播给人、动物或植物，从而引起疾病。"},"examples":[{"en":"The flu can infect people quickly in winter.","zh":"冬天流感可能很快感染人群。"},{"en":"Wash your hands so you don’t infect others.","zh":"洗手以免把病传染给别人。"}]},{"partOfSpeech":"vt.","definition":{"en":"To affect something in a harmful way, especially by spreading bad ideas, emotions, or computer viruses.","zh":"（比喻）使受不良影响；（如）传播坏想法/情绪；（计算机）使中病毒。"},"examples":[{"en":"Fear can infect a whole group.","zh":"恐惧会在整个群体中蔓延。"},{"en":"The email attachment infected my computer with malware.","zh":"那个邮件附件让我的电脑感染了恶意软件。"}]}],"synonyms":["catch (a disease)","contaminate","spread","transmit","pollute","taint"],"phonetic":"/ɪnˈfɛkt/","extraExplanation":["“infect” 的常见拼写是 i-n-f-e-c-t。很多学习者会把它和 “effect”（影响/效果）混淆：infect = 传染/感染；effect = 影响/效果（名词）或实现（动词）。"]}
{"word":"enfeeble","summary":{"en":"Enfeeble means to make someone or something weaker; it’s a more formal word for “weaken.”","zh":"enfeeble 指使某人或某物变得更虚弱，是比 weaken 更正式的说法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something weaker in strength, power, or ability","zh":"使（某人或某物）变得虚弱；削弱（力量、权力或能力）"},"examples":[{"en":"The long illness enfeebled him, so he had to rest for weeks.","zh":"长期的疾病让他变得很虚弱，所以他不得不休息好几周。"},{"en":"Corruption can enfeeble a government’s ability to serve the public.","zh":"腐败会削弱政府服务公众的能力。"},{"en":"The company avoided decisions that would enfeeble its reputation.","zh":"这家公司避免做出会削弱其声誉的决定。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become weaker; to lose strength or energy (less common)","zh":"变得虚弱；失去力量或精力（较少见）"},"examples":[{"en":"Without proper nutrition, the body may enfeeble over time.","zh":"如果营养不足，身体可能会随着时间变得虚弱。"}]}],"synonyms":["weaken","sap","debilitate","undermine"],"phonetic":"/ɪnˈfiːbəl/","extraExplanation":["“enfeeble”比较正式，常见于写作或新闻中；日常口语里更常用“weaken”。","词形上：en-（使……进入某种状态）+ feeble（虚弱的），字面意思是“使变得虚弱”。常见搭配：enfeeble the body / enfeeble the economy / enfeeble one’s resolve（削弱决心）。"]}
{"word":"enfeebled","summary":{"en":"Enfeebled means weakened in strength, health, or effectiveness (often in formal writing).","zh":"Enfeebled 指力量、健康或效能被削弱、变得衰弱（多用于较正式的书面表达）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person, body, or ability) made physically or mentally weak; weakened.","zh":"（指人、身体或能力）被削弱的；衰弱的。"},"examples":[{"en":"After the long illness, he felt enfeebled and needed help walking.","zh":"久病之后，他感到身体衰弱，需要人搀扶走路。"},{"en":"The team’s enfeebled defense couldn’t stop the attacks.","zh":"球队薄弱的防守挡不住对方的进攻。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often figurative) made less effective, powerful, or influential.","zh":"（常作比喻）被削弱的；无力的；影响力下降的。"},"examples":[{"en":"New rules enfeebled the agency’s power to act quickly.","zh":"新规定削弱了该机构迅速采取行动的权力。"},{"en":"Without public support, the movement became enfeebled.","zh":"没有公众支持，这场运动变得势弱无力。"}]}],"synonyms":["weakened","debilitated","frail","enervated","diminished"],"phonetic":"/ɪnˈfiːbəld/","extraExplanation":["“enfeebled”来自动词“enfeeble”（使衰弱），核心词根是“feeble”（虚弱的）。在写作中它语气偏正式、书面，常用于描述长期疾病、年老、战争/政策导致的“力量被削弱”。","常见搭配：enfeebled by illness（因疾病而衰弱）、enfeebled condition（衰弱状态）、enfeebled economy/institutions（被削弱的经济/机构）。"]}
{"word":"enfeeblement","summary":{"en":"Enfeeblement means the process or state of becoming weak (often used in formal or medical contexts).","zh":"Enfeeblement 指“变得虚弱的过程或虚弱状态”，多用于较正式或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of becoming weak in strength, energy, health, or influence; weakening.","zh":"衰弱；虚弱化；（力量、精力、健康或影响力的）减弱过程。"},"examples":[{"en":"The long illness led to his gradual enfeeblement.","zh":"长期的疾病使他逐渐衰弱。"},{"en":"Many people worried that constant stress would cause mental enfeeblement.","zh":"许多人担心持续的压力会导致精神上的衰弱。"}]},{"partOfSpeech":"n.","definition":{"en":"A state or condition of being weak or weakened.","zh":"虚弱状态；衰弱的状况。"},"examples":[{"en":"The doctor noted signs of enfeeblement and recommended rest.","zh":"医生注意到他有衰弱的迹象，并建议休息。"},{"en":"The policy was criticized for the enfeeblement of local communities.","zh":"这项政策因削弱了地方社区而受到批评。"}]}],"synonyms":["weakening","weakness","frailty","decline","debilitation"],"phonetic":"/ɛnˈfiːbəlmənt/","extraExplanation":["“enfeeblement”来自动词“enfeeble”（使虚弱）+ 名词后缀“-ment”（表示结果或过程），语气较正式，常见于医疗、学术或评论文章。","近义词对比：weakness（更常用、口语也可）强调“弱”；frailty（更偏“脆弱、体质弱”）；decline（更偏“下降、衰退”的过程）。"]}
{"word":"enfeeblements","summary":{"en":"“Enfeeblements” means multiple cases or results of weakening (making something less strong or effective).","zh":"“Enfeeblements”指多种“衰弱/削弱”的情况或结果，即使某物变得不那么强壮或有效。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of enfeeblement: acts or results of making someone or something weak in strength, health, power, or effectiveness.","zh":"enfeeblement 的复数：使人或事物在力量、健康、权力或效能上变弱的行为或结果。"},"examples":[{"en":"The long illness led to several enfeeblements, including muscle loss and fatigue.","zh":"长期的疾病导致了多种衰弱现象，包括肌肉流失和疲劳。"},{"en":"Historians debated whether these policies caused the enfeeblements of the state over time.","zh":"历史学家争论这些政策是否在长期内造成了国家的衰弱。"}]}],"synonyms":["weakenings","impairments","declines","diminutions","debilitations"],"phonetic":"/ɪnˈfiːbəlmənts/","extraExplanation":["“enfeeblement”来自动词“enfeeble”（使衰弱），核心意思是“让……变得不那么强”。“enfeeblements”是其复数形式，常见于较正式或学术的写作中，用来列举多种“衰弱/削弱”的表现或结果。","近义词里，“weakening”更口语、更常用；“enfeeblement(s)”语气更正式，常用于健康、社会或国家力量等较宏观的语境。"]}
{"word":"enfeebler","summary":{"en":"An enfeebler is someone or something that weakens or reduces strength, health, power, or influence.","zh":"enfeebler 指使人或事物变弱、削弱力量/健康/权力/影响的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that makes someone or something weaker (in strength, health, power, or influence).","zh":"使（某人或某物）变得虚弱的人或事物（在力量、健康、权力或影响力方面）。"},"examples":[{"en":"Chronic stress can be an enfeebler of both body and mind.","zh":"长期压力会让身心都变得虚弱，是一种“削弱者”。"},{"en":"Some critics called the scandal an enfeebler of public trust.","zh":"一些评论者称那场丑闻削弱了公众信任，是公众信任的“削弱者”。"}]}],"synonyms":["weakener","underminer","debilitator","sapper"],"phonetic":"/ɛnˈfiːb(ə)lər/","extraExplanation":["“enfeebler”来自动词“enfeeble”（使变弱、使衰弱）。构词上常见：en-（使进入某种状态）+ feeble（虚弱的）+ -er（做某事的人/物），所以字面意思就是“使变弱的人/物”。","这个词在现代英语里比较少见，更常用的表达是“something that weakens … / a factor that undermines …”（削弱……的东西/因素）。"]}
{"word":"enfeebles","summary":{"en":"“Enfeebles” means “makes weak” or “reduces strength or effectiveness.”","zh":"“enfeebles”意为“使虚弱；削弱（力量或效力）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone or something weak; to reduce strength, energy, or effectiveness","zh":"使（某人或某物）虚弱；削弱力量、精力或效力"},"examples":[{"en":"Long illness can enfeeble the body.","zh":"长期的疾病会使身体虚弱。"},{"en":"Fear enfeebles our ability to make good decisions.","zh":"恐惧会削弱我们做出好决定的能力。"},{"en":"The new rules enfeeble the agency’s power to act quickly.","zh":"新规定削弱了该机构快速行动的权力。"}]}],"synonyms":["weaken","debilitate","sap","undermine","impair"],"phonetic":"/ɛnˈfiːbəlz/","extraExplanation":["“enfeebles”是动词“enfeeble”的第三人称单数（he/she/it enfeebles）。","词源上由前缀 en-（使……进入某种状态）+ feeble（虚弱的）组成，语气偏正式，常见于写作、新闻或学术语境。"]}
{"word":"enfeebling","summary":{"en":"Enfeebling means “weakening” or “making less strong.”","zh":"enfeebling 表示“削弱、使变得虚弱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"weakening someone or something; making them less strong (physically, mentally, or morally).","zh":"使（人或事物）变得虚弱；削弱（体力、精神或意志）。"},"examples":[{"en":"Lack of sleep has an enfeebling effect on your immune system.","zh":"睡眠不足会对你的免疫系统产生削弱作用。"},{"en":"The scandal was enfeebling the public’s trust in the institution.","zh":"这起丑闻正在削弱公众对该机构的信任。"}]},{"partOfSpeech":"v.","definition":{"en":"the act or process of making someone or something weaker (present participle of “enfeeble”).","zh":"使变弱的过程；正在削弱（“enfeeble”的现在分词）。"},"examples":[{"en":"Long-term illness can be enfeebling the body over time.","zh":"长期疾病会随着时间推移不断削弱身体。"},{"en":"The harsh conditions were enfeebling the team’s morale.","zh":"恶劣的条件正在削弱团队士气。"}]}],"synonyms":["weakening","debilitating","sapping","undermining","enervating"],"phonetic":"/ɪnˈfiːbəlɪŋ/","extraExplanation":["“Enfeebling/enfeeble”语气偏正式，常见于写作、新闻或学术语境；日常口语更常用“weakening”“making … weaker”。","这个词既可指身体上的虚弱，也常用于抽象意义（如削弱信心、权威、影响力）。"]}
{"word":"enfeeblish","summary":{"en":"“Enfeeblish” means to weaken someone or something; it’s a rarer form of “enfeeble.”","zh":"“enfeeblish”意为“使虚弱/削弱”，是较少见的“enfeeble”的变体。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make someone or something weak in strength, energy, or effectiveness; to weaken.","zh":"使（某人/某物）虚弱；削弱（力量、精力或效能）。"},"examples":[{"en":"The long illness enfeeblished him, so he needed help walking.","zh":"长期的疾病使他变得虚弱，所以他走路需要人搀扶。"},{"en":"Constant infighting enfeeblished the team’s ability to finish projects on time.","zh":"不断的内斗削弱了团队按时完成项目的能力。"}]}],"synonyms":["enfeeble","weaken","debilitate","sap","undermine"],"phonetic":"/ɛnˈfiːbəlɪʃ/","extraExplanation":["“enfeeblish”较少见，更常用的表达是“enfeeble”（同义）或“weaken”。在正式写作或较旧的文体中可能会看到“enfeeblish”。","构词：前缀 en- 有“使……处于某种状态”的意思；feeble 表示“虚弱的”。合起来就是“使变得虚弱”。"]}
{"word":"enfelon","summary":{"en":"“Enfelon” is an archaic verb meaning to make someone a felon or to treat/label them as a criminal.","zh":"“enfelon”是一个较古旧的动词，意思是使某人成为重罪犯，或把某人当作/贴上罪犯标签。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To make someone a felon; to brand or treat someone as a criminal.","zh":"（古用）使某人成为重罪犯；把某人污名化为罪犯、按罪犯对待。"},"examples":[{"en":"In old polemical writing, opponents were sometimes accused of trying to enfelon honest citizens.","zh":"在早期的论战文章里，作者有时会指责对手试图把诚实的公民“enfelon”（污名化为罪犯）。"},{"en":"The pamphlet claims the law would enfelon minor offenders.","zh":"这本小册子声称该法律会把轻微违法者也变成“重罪犯”。"}]}],"synonyms":["criminalize","brand","stigmatize","make a felon of"],"phonetic":"/ɛnˈfɛlən/","extraExplanation":["“enfelon”由前缀 en-（使成为……）+ felon（重罪犯）构成，属于较少见、偏古旧的用法，多出现在历史文本、政治宣传或修辞性写作中。现代英语更常用的表达有：criminalize（将……定为犯罪）、turn someone into a felon（使某人成为重罪犯）或 brand someone a criminal（给某人贴上罪犯标签）。"]}
{"word":"enfeoff","summary":{"en":"“Enfeoff” means to grant someone land or a fief under the feudal system, usually in return for service or loyalty.","zh":"“Enfeoff”指在封建制度下授封土地/采邑给某人，通常以服务或效忠为交换。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Historical, law) To give someone land or a fief in return for loyalty or service; to invest someone with a feudal estate.","zh":"（历史/法律）授封（土地/采邑）；以封建方式把土地授予某人，以换取效忠或服务。"},"examples":[{"en":"The king enfeoffed a loyal knight with a small estate.","zh":"国王把一小块领地授封给一位忠诚的骑士。"},{"en":"In medieval records, nobles were often enfeoffed for military service.","zh":"在中世纪档案中，贵族常因服兵役而被授封。"}]},{"partOfSpeech":"vt.","definition":{"en":"To endow or provide someone with something (a rare, extended use).","zh":"（罕见引申义）赋予；授予（某人某物）。"},"examples":[{"en":"The charter seemed to enfeoff the town with new rights.","zh":"该特许状似乎赋予该城镇新的权利。"}]}],"synonyms":["grant","invest","endow","enfeud"],"phonetic":"/ɛnˈfiːf/","extraExplanation":["词源与背景：enfeoff 来自 feoff（封地/授封），源于中古法语与封建制度相关用语。它常见于历史叙述或法律文献里，现代日常英语很少使用。","用法提示：enfeoff 后面常接人作宾语（enfeoff someone），再用 with 引出被授封的土地/采邑（with land/an estate/a fief）。","相关词：feoff（封地；授封）、feudal（封建的）、fief（采邑/封地）、vassal（附庸/臣属）。"]}
{"word":"enfeoffed","summary":{"en":"“Enfeoffed” means someone was granted possession or legal rights to land (a fief), especially under a medieval feudal system.","zh":"“Enfeoffed”指（在中世纪封建制度下）某人被分封土地/封地，从而获得土地的占有权或法律权益。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(historical, law) Given someone land or a legal estate in land, usually in return for service; granted a feudal holding to.","zh":"（历史/法律）授予某人土地或土地的合法权益（通常作为回报要求效忠或服役）；分封（土地）。"},"examples":[{"en":"The king enfeoffed a loyal knight with a small manor.","zh":"国王分封给一位忠诚的骑士一座小庄园。"},{"en":"The document states that the heir was enfeoffed of the property in 1320.","zh":"文件记载该继承人于1320年被授予该地产的封地权益。"}]},{"partOfSpeech":"adj.","definition":{"en":"(historical) Put into possession of land; invested with a fief (feudal landholding).","zh":"（历史）使某人取得土地的占有权；使其获得封地（封建土地持有权）。"},"examples":[{"en":"After the ceremony, he was formally enfeoffed and could collect rents.","zh":"仪式之后，他正式取得封地权利，并可收取地租。"},{"en":"Only those enfeoffed by the lord could lawfully use the land.","zh":"只有被领主分封的人才合法拥有该土地的使用权。"}]}],"synonyms":["granted land","invested (with land)","endowed (with an estate)","enfeoffed (formal)"],"phonetic":"/ɛnˈfiːft/","extraExplanation":["“enfeoffed”来自动词“enfeoff”，词根与“fief（封地）”有关，常见于中世纪欧洲的封建制度与英美古代地产法语境。现代英语中多用于历史叙述、法律史研究或引用古文书。","在英国古法里，enfeoffment（分封/授地）常通过象征性“交付占有”（如交付一把土或一枝树枝）来表示土地占有权的转移；今天大多已被现代不动产转让制度取代。"]}
{"word":"enfeoffees","summary":{"en":"Enfeoffees are people given legal ownership of land in an old feudal system, often to hold or manage it for others.","zh":"Enfeoffees 指在旧时封建制度下被授予土地法律所有权的人，常代他人持有或管理土地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (often trustees) who are given legal ownership of land or property under an old feudal system, usually to hold it for someone else’s benefit.","zh":"（常指受托人）在旧时封建制度下被授予土地或财产法律所有权的人，通常代他人持有并为其利益管理。"},"examples":[{"en":"Under the will, the land was transferred to enfeoffees to manage the estate for the heirs.","zh":"根据遗嘱，土地转交给受托持有人（enfeoffees），为继承人管理该产业。"},{"en":"The document names three enfeoffees responsible for collecting rents and maintaining the property.","zh":"文件指明三位受托持有人负责收取租金并维护该房产。"}]}],"synonyms":["trustees (context-dependent)","feoffees","legal holders (historical context)"],"phonetic":"/ˌɛnˌfiːˈfiːz/","extraExplanation":["“enfeoffees”是“enfeoffee”的复数形式，属于非常古老、偏法律史/土地法的用语，常见于英国中世纪封建土地制度（feoff）以及后来的历史文献、契约和判例讨论中。","核心概念是“把土地（feoff）正式交付给某人”，该人可能并非真正受益者，而是代为持有与处理（类似今天语境里的某些“受托人/名义持有人”的角色，但并不完全等同于现代信托法术语）。"]}
{"word":"enfeoffing","summary":{"en":"Enfeoffing means formally granting someone a feudal estate (a fief), or the act of doing so.","zh":"enfeoffing 指在封建制度下正式授予某人封地/地产，或指这种授封行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of formally granting someone land or an estate (a “fief”) under feudal law; investing someone with ownership or a feudal right","zh":"（封建法中）正式把土地或封地（fief）授予某人；使某人取得封地/封建权益的行为或过程"},"examples":[{"en":"The charter describes the enfeoffing of a knight with a small manor.","zh":"该特许状记载了一位骑士被授予一座小庄园的封地授封过程。"},{"en":"After the enfeoffing, the new lord owed service to his superior.","zh":"完成授封后，新领主需要向其上级履行封建义务。"}]},{"partOfSpeech":"vt.","definition":{"en":"formally granting (someone) a fief or estate; investing (someone) with ownership or a feudal right","zh":"（正在）将封地/地产正式授予（某人）；（使某人）取得所有权或封建权利"},"examples":[{"en":"The king’s council was enfeoffing loyal supporters to secure control of the region.","zh":"国王的议会正把封地授予忠诚的支持者，以巩固对该地区的控制。"},{"en":"In medieval records, landowners are sometimes listed as enfeoffing heirs.","zh":"在中世纪档案中，有时会记载地主将封地授予继承人。"}]}],"synonyms":["grant (land)","invest","endow","bestow","confer"],"phonetic":"/ɪnˈfiːfɪŋ/","extraExplanation":["“Enfeoffing”来自动词 enfeoff，核心名词是 feoff / fief（封地）。这是典型的中世纪封建制度用语，常见于古英语法律文书、地契、王室特许状等正式文本中。","现代英语里它多用于历史、法律史或学术写作；日常表达更常用 grant (land), invest (with title), endow 等。"]}
{"word":"enfeoffment","summary":{"en":"Enfeoffment is the medieval feudal act of granting land (a fief) to someone, formally making them a vassal who owes loyalty and service.","zh":"Enfeoffment 指中世纪封建制度中将封地授予某人的行为或仪式，使其成为附庸并承担效忠与服务义务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of granting someone a feudal estate (a “fief”) and making them a vassal in return for loyalty and service.","zh":"（封建制度中）授予某人封地（采邑）并使其成为附庸，以换取效忠与服务的行为。"},"examples":[{"en":"In medieval Europe, enfeoffment often came with an oath of loyalty to the lord.","zh":"在中世纪欧洲，enfeoffment 通常伴随对领主宣誓效忠。"},{"en":"The document recorded the enfeoffment of the knight with a small manor and its lands.","zh":"该文件记载了将一座小庄园及其土地封赐给那位骑士的 enfeoffment。"}]},{"partOfSpeech":"n.","definition":{"en":"In legal or historical writing, a formal investiture or transfer of land under feudal law.","zh":"（法律/历史语境）在封建法下对土地进行正式授职式交付或转让。"},"examples":[{"en":"The historian described the enfeoffment as a public ceremony with witnesses.","zh":"历史学家将 enfeoffment 描述为有见证人在场的公开仪式。"},{"en":"Records of enfeoffment help researchers trace how land changed hands.","zh":"enfeoffment 的记录有助于研究者追踪土地如何易手。"}]}],"synonyms":["investiture","grant of a fief","feudal land grant"],"phonetic":"/ɪnˈfifmənt/","extraExplanation":["词源提示：enfeoffment 来自动词 enfeoff（把封地授予某人），与 feoff（封地/封赐）同源，核心概念是“以土地换取义务”的封建关系。","使用场景：现代英语里它多见于历史、法律史、或文学研究中，日常对话很少用。可以把它理解为“封建式的授地与立约”。"]}
{"word":"enfeoffs","summary":{"en":"“Enfeoffs” means “grants land/estate to someone under the old feudal system.”","zh":"“enfeoffs”指“在封建制度下把土地/采邑授封给某人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Law, historical) To give someone land or an estate under feudal tenure; to grant a fief; to invest with a freehold estate.","zh":"（法律/历史）以封建领地（采邑）授予某人；授封；（旧法）使某人取得自由保有地产（freehold）的权利。"},"examples":[{"en":"The king enfeoffs a knight with land in return for military service.","zh":"国王把土地授封给骑士，以换取其服兵役。"},{"en":"In the old record, the lord enfeoffs his vassal of a small manor.","zh":"在旧档案中，领主把一座小庄园授封给他的封臣。"},{"en":"The document says he enfeoffs his son with the estate, though the wording is archaic today.","zh":"文件写道他把该地产授予儿子，尽管这种措辞在今天已属古旧。"}]}],"synonyms":["grant (land)","invest (with an estate)","endow","confer (a fief)"],"phonetic":"/ɛnˈfiːf/","extraExplanation":["“enfeoffs”是动词“enfeoff”的第三人称单数现在时（he/she/it enfeoffs）。常见于英国中世纪封建制度与古英语法律文书中：把土地（fief/fee）授予受封者，以换取效忠与服务。","词源上，“en-”有“使进入某种状态”的意思，“feoff/fee”与“封地、采邑”相关；因此整体含义接近“授封土地”。现代英语里多出现在历史研究或法律史语境。"]}
{"word":"enfester","summary":{"en":"Enfester means to fester: to become infected/rotten, or (figuratively) to worsen over time when ignored.","zh":"enfester 意为“化脓、溃烂；（比喻）因忽视而逐渐恶化”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To become infected, rotten, or full of pus; to fester (often used for a wound or sore).","zh":"（伤口等）感染、化脓、溃烂；（使）化脓恶化。"},"examples":[{"en":"If you don’t clean the cut, it may enfester and become painful.","zh":"如果你不清洁伤口，它可能会感染化脓并变得疼痛。"},{"en":"The untreated wound began to enfester after a few days.","zh":"未处理的伤口几天后开始化脓恶化。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Figurative) To grow worse over time because it is ignored; to become a deeper problem.","zh":"（比喻）因被忽视而愈演愈烈；逐渐恶化成更严重的问题。"},"examples":[{"en":"Resentment can enfester when people never talk honestly.","zh":"当人们从不坦诚沟通时，怨恨会逐渐恶化。"},{"en":"Small conflicts may enfester into a serious dispute.","zh":"小矛盾可能会逐渐恶化成严重纠纷。"}]}],"synonyms":["fester","infect","suppurate","rot","worsen"],"phonetic":"/ɛnˈfɛstər/","extraExplanation":["“enfester”较少见，更常用的是“fester”。前缀“en-”有“使……进入某种状态”的感觉，因此“enfester”语气上更强调“变得化脓/恶化”。","写作中常用它来表达“被压抑的问题、情绪、社会矛盾在暗中发酵”，语感偏负面、较强烈。"]}
{"word":"enfetter","summary":{"en":"Enfetter means to shackle or restrain someone/something, literally with chains or figuratively by limiting freedom.","zh":"Enfetter 指“用镣铐束缚”或“（比喻）限制自由/行动”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to restrict or tie someone/something down; to prevent freedom of movement or action (often used figuratively)","zh":"束缚；给……戴上镣铐；限制……的自由（常用于比喻）"},"examples":[{"en":"The new rules could enfetter small businesses and slow innovation.","zh":"新规定可能会束缚小企业，并减缓创新。"},{"en":"She refused to be enfettered by other people’s expectations.","zh":"她拒绝被他人的期待所束缚。"},{"en":"Old traditions sometimes enfetter a society’s progress.","zh":"旧传统有时会束缚社会的进步。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put fetters (chains) on someone, especially on the ankles","zh":"给……上脚镣（用镣铐锁住，尤指脚踝）"},"examples":[{"en":"In the story, the prisoner was enfettered before being led away.","zh":"在故事里，囚犯被戴上镣铐后被带走。"},{"en":"The guards threatened to enfetter anyone who tried to escape.","zh":"守卫威胁说，任何试图逃跑的人都会被上镣铐。"}]}],"synonyms":["shackle","restrain","bind","hamper","constrain","restrict","tie down"],"phonetic":"/ɛnˈfɛtɚ/","extraExplanation":["“en-”是常见前缀，表示“使……处于某种状态”；“fetter”意为“镣铐/束缚”。因此 enfetter 字面就是“使戴上镣铐”，在现代英语中更常见的是比喻用法（限制自由、创造力、行动）。","语体提示：enfetter 偏正式、文学或评论性用词；日常口语里更常用 restrict / shackle / tie down。"]}
{"word":"enfettered","summary":{"en":"“Enfettered” means free from restraints or limits (similar to “unfettered”).","zh":"“enfettered”表示“不受束缚/不受限制”，意义接近更常见的“unfettered”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not restricted, controlled, or tied down; free to act or think in your own way.","zh":"不受束缚的；不受限制的；自由的。"},"examples":[{"en":"She felt enfettered by old traditions and wanted to choose her own path.","zh":"她觉得自己被旧传统束缚住了，想选择自己的道路。"},{"en":"The new policy allows researchers to explore ideas in a more enfettered way.","zh":"新政策让研究人员能更自由地探索想法。"}]}],"synonyms":["unfettered","unrestrained","unbounded","free","unhampered"],"phonetic":"/ʌnˈfɛtɚd/","extraExplanation":["“enfettered”来自“fetter（脚镣/束缚）”，字面意思是“没有被脚镣锁住”。在现代英语里更常见的词是“unfettered”；“enfettered”本身比较少见，容易被误读为“被束缚的”，但它常被用作“unfettered”的变体/同义形式。正式写作中建议用更常见的“unfettered”。"]}
{"word":"enfettering","summary":{"en":"Enfettering means restricting or confining someone or something, as if putting them in chains.","zh":"Enfettering 指对人或事物进行束缚与限制，仿佛上了锁链。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle of \"enfetter\") restraining someone or something, as if with chains; limiting freedom or action.","zh":"（enfetter 的现在分词）束缚、羁绊某人或某事，仿佛用锁链捆住；限制自由或行动。"},"examples":[{"en":"Strict rules can be enfettering for creative students.","zh":"严格的规定可能会束缚有创造力的学生。"},{"en":"They criticized the policy as enfettering small businesses with paperwork.","zh":"他们批评该政策用繁琐文件程序束缚了小企业。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective) overly restrictive; confining.","zh":"（作形容词）过度限制的；令人感到受困的。"},"examples":[{"en":"She left an enfettering job that gave her no flexibility.","zh":"她离开了一份令人受困、毫无弹性的工作。"},{"en":"An enfettering schedule can harm your work-life balance.","zh":"过于束缚人的日程安排会破坏工作与生活的平衡。"}]}],"synonyms":["restricting","constraining","limiting","hampering","shackling"],"phonetic":"/ɛnˈfɛtərɪŋ/","extraExplanation":["“enfetter”由 en-（使……处于某种状态）+ fetter（脚镣；束缚）构成。fetter 原指绑住脚踝的镣铐，因此这个词常带有“像上了锁链一样被限制”的形象感，多用于较正式或文学化的语境。"]}
{"word":"enfetters","summary":{"en":"Enfetter means to restrain or limit, literally like putting someone in chains, or figuratively by restricting freedom or progress.","zh":"Enfetter 指“束缚、限制”，既可指字面上像上镣铐一样捆住，也可比喻限制自由或发展。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tie up or restrain someone or something, as if with chains","zh":"（用镣铐等）束缚、拴住；使动弹不得"},"examples":[{"en":"The prisoners were enfettered before being led away.","zh":"囚犯被戴上镣铐后被带走。"},{"en":"Fear can enfetter people and stop them from speaking up.","zh":"恐惧会束缚人们，让他们不敢发声。"}]},{"partOfSpeech":"vt.","definition":{"en":"to limit freedom, progress, or action (often figurative)","zh":"（常为比喻）限制、羁绊；使无法自由发展或行动"},"examples":[{"en":"Outdated rules can enfetter innovation in the workplace.","zh":"过时的规章会束缚职场创新。"},{"en":"She refused to be enfettered by other people’s expectations.","zh":"她拒绝被他人的期待所羁绊。"}]}],"synonyms":["restrain","shackle","bind","hamper","limit","constrain"],"phonetic":"/ɛnˈfɛtər/","extraExplanation":["“enfetter”由前缀 en-（使……处于某种状态）+ “fetter”（脚镣；束缚）构成，带有较强的文学/正式语气。日常表达中更常用 “restrict / shackle / hold back”。","你输入的 “enfetters” 通常是动词第三人称单数（He/She/It enfetters...）或较少见的复数形式；词典条目一般以原形 “enfetter” 收录。"]}
{"word":"enfeud","summary":{"en":"Enfeud means to bind someone or land into a feudal-like dependence under a lord’s control.","zh":"Enfeud 指把某人或土地纳入封建式依附关系，使其受领主控制与约束。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to place (someone or something) under the control or obligations of a feudal lord; to make dependent or bound like in a feudal system","zh":"使（某人或某物）受封建领主的控制或义务约束；使像封建制度那样依附、受制"},"examples":[{"en":"In medieval Europe, peasants were often enfeuded to the land and could not freely leave.","zh":"在中世纪欧洲，农民常常被“封建束缚”在土地上，不能自由离开。"},{"en":"Some critics say the policy could enfeud small farmers to powerful landlords.","zh":"一些批评者说，这项政策可能会让小农被迫依附强势地主。"}]}],"synonyms":["bind","subject","enslave (figurative)","subjugate","make dependent"],"phonetic":"/ɛnˈfjud/","extraExplanation":["“enfeud”来自“feud/feudal（封建的）”，核心意思是“把人或土地纳入封建关系中”。它多见于历史、法律或学术语境，现代日常英语很少使用。","在现代写作中，它也可用于比喻：强调某人“因制度/权力结构而被迫依附、难以脱身”。如需更常见表达，可用“bind,” “subject,” “make dependent (on)”。"]}
{"word":"enfever","summary":{"en":"Enfever means to make someone feverish or, more figuratively, to stir up strong emotion (literary/formal).","zh":"Enfever 指“使发烧”，也可（多为文学/正式用法）指“煽动、使情绪亢奋”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone physically feverish; to cause a fever","zh":"使（某人）发烧；使发热"},"examples":[{"en":"The infection can enfever the body within hours.","zh":"这种感染可能在几小时内就让身体发烧。"},{"en":"The hot, crowded room seemed to enfever everyone.","zh":"炎热又拥挤的房间似乎把大家都“热”得发起烧来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to excite or inflame emotions; to make someone feel intensely stirred up (often used in literary writing)","zh":"（多用于文学或修辞）使情绪亢奋；使激动；煽动"},"examples":[{"en":"The speech enfevered the crowd, and the shouting grew louder.","zh":"这场演讲煽动了人群，喊声越来越大。"},{"en":"Rumors enfevered public opinion before the trial.","zh":"审判前，谣言煽动了公众情绪。"}]}],"synonyms":["inflame","excite","stir up","agitate","make feverish"],"phonetic":"/ɛnˈfiːvɚ/","extraExplanation":["“enfever”由前缀 en-（使……进入某种状态）+ fever（发烧/热）构成，常见于较正式或文学语境；日常英语里更常说 “give someone a fever / make someone feverish” 或在比喻义上用 “inflame / stir up / excite”。"]}
{"word":"enfevered","summary":{"en":"Enfevered means having a fever, or (figuratively) being intensely excited or overheated in a way that feels unhealthy or out of control.","zh":"Enfevered 指“发烧的”，也可比喻“情绪或局势过度升温、狂热而失控的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Affected by fever; having an unusually high temperature, often with sweating, chills, or weakness.","zh":"发烧的；有热度的（常伴随出汗、发冷或虚弱）。"},"examples":[{"en":"The child was enfevered and too weak to get out of bed.","zh":"孩子在发烧，虚弱得下不了床。"},{"en":"He felt enfevered after a long night of illness.","zh":"他病了一整夜后感觉在发烧。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Hot, excited, or intense in an unhealthy or uncontrolled way.","zh":"（比喻）狂热的；激动而失控的；紧张而不健康的。"},"examples":[{"en":"An enfevered debate filled the room, with everyone speaking at once.","zh":"房间里争论得火热而失控，大家同时开口。"},{"en":"In the novel, the city is described as enfevered by fear and rumor.","zh":"在小说里，这座城市被恐惧和谣言“烧”得躁动不安。"}]}],"synonyms":["feverish","febrile","heated","overwrought","frantic"],"phonetic":"/ɛnˈfiːvərd/","extraExplanation":["“enfevered”由前缀 en-（使……进入某种状态）+ fever（发烧/热）构成，字面意思是“使发烧的”，所以既可指真实的发热症状，也常见于文学或新闻中作比喻，表示情绪或局势像发烧一样“升温”。","更常见的日常说法是 “feverish”（发烧的/狂热的）。 “enfevered”更偏书面、文学化。"]}
{"word":"enfevering","summary":{"en":"“Enfevering” means making someone feverish or intensely excited (a rare, literary-sounding word).","zh":"“enfevering”表示“使人发热或情绪亢奋/躁动”，是较少见、偏文学的用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Making someone feverish or intensely excited; stirring up strong emotion.","zh":"（罕见）使人发热或变得亢奋；激起强烈情绪。"},"examples":[{"en":"The humid air was enfevering, and everyone moved more slowly.","zh":"潮湿的空气让人燥热难耐，大家的动作都慢了下来。"},{"en":"Rumors can be enfevering, turning a calm crowd into an anxious one.","zh":"谣言会让人情绪“发热”，把冷静的人群变得焦虑不安。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “enfever”: to make feverish; to inflame with excitement or agitation.","zh":"“enfever”的现在分词：使发热；使激动或焦躁。"},"examples":[{"en":"The endless debate was enfevering the audience.","zh":"没完没了的争论让观众越发烦躁激动。"}]}],"synonyms":["feverish","inflaming","agitating","exciting","stimulating"],"phonetic":"/ɛnˈfiːvərɪŋ/","extraExplanation":["“enfever / enfevering”在现代英语中很少见，更常用的替代表达有：feverish（发热的/亢奋的）, inflaming（煽动的）, agitating（令人焦躁的）, exciting（令人兴奋的）。","这个词带有一点文学色彩：常用来描写气候、情绪、谣言、政治氛围等“让人热起来/躁起来”的感觉。"]}
{"word":"enfevers","summary":{"en":"“Enfevers” means “causes a fever” or, figuratively, “stirs up strong excitement or tension.”","zh":"“enfevers”意为“使发烧”，也可比喻“使情绪或局势升温、加剧”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone have a fever; to cause a rise in body temperature","zh":"使（某人）发烧；引起体温升高"},"examples":[{"en":"The infection enfevers the patient within a day.","zh":"这种感染会在一天之内让病人发烧。"},{"en":"Some illnesses enfever the body quickly, so rest and fluids are important.","zh":"有些疾病会很快引起发烧，所以休息和补充水分很重要。"}]},{"partOfSpeech":"vt.","definition":{"en":"(often figurative) to excite or inflame feelings, thoughts, or a situation","zh":"（常作比喻）使激动；使情绪/局势“发热”、加剧"},"examples":[{"en":"The heated debate enfevers the crowd.","zh":"激烈的辩论让人群情绪高涨。"},{"en":"Rumors can enfever tensions in a community.","zh":"谣言会加剧社区的紧张气氛。"}]}],"synonyms":["cause a fever","make feverish","inflame","excite","agitate"],"phonetic":"/ɛnˈfiːvərz/","extraExplanation":["“enfevers”是动词“enfever”的第三人称单数形式（he/she/it enfevers）。","“enfever”带有比较文学/书面色彩，日常英语里更常用“give someone a fever”“cause a fever”或比喻用“inflame/excite”。"]}
{"word":"ENFIA","summary":{"en":"ENFIA is Greece’s annual property tax on real estate ownership.","zh":"ENFIA 指希腊对不动产所有权征收的年度房产税。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Greece) Acronym for a national annual real-estate property tax paid by owners of land and buildings; commonly translated as the “Uniform Real Estate Ownership Tax.”","zh":"（希腊）全国性的年度不动产税/房产税，由土地和房屋的所有者缴纳；常译为“统一不动产所有权税”。"},"examples":[{"en":"We need to budget for ENFIA before the end of the year.","zh":"我们需要在年底前把 ENFIA（房产税）列入预算。"},{"en":"The accountant asked for the ENFIA statement to confirm the property’s tax status.","zh":"会计要求提供 ENFIA 缴税单，以确认该房产的税务状态。"},{"en":"ENFIA rates can vary depending on the property’s location and size.","zh":"ENFIA 的税额会因房产的位置和面积而不同。"}]}],"synonyms":["Greek property tax","real-estate tax (Greece)"],"phonetic":"/ˌɛnfiˈɑː/","extraExplanation":["ENFIA 是希腊语税名的缩写：Ενιαίος Φόρος Ιδιοκτησίας Ακινήτων。它在希腊的房产交易、继承、出租等场景中经常被提到；若你在希腊拥有房产，通常每年都会收到相关的缴税通知。","发音在英语语境里常按字母读成类似“EN-fee-AH”的三音节读法；不同人也可能逐字母拼读（E-N-F-I-A）。"]}
{"word":"enfief","summary":{"en":"Enfief means to grant someone a fief (land) under the feudal system; more rarely, to invest someone with rights or authority.","zh":"Enfief 指在封建制度下把采邑（土地）封给某人；较少用时也可引申为“赋予权力/权利”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone land (or an estate) to hold under the feudal system; to grant a fief","zh":"（封建制度下）把土地/采邑封给某人，使其以封臣身份持有"},"examples":[{"en":"The king enfiefed the knight with a small estate in return for military service.","zh":"国王将一小块采邑封给那位骑士，作为其服兵役的回报。"},{"en":"In medieval records, lords could enfief loyal followers to secure alliances.","zh":"在中世纪的记载中，领主会把土地封给忠诚的追随者，以巩固同盟。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, rare) to endow or invest someone with a right, duty, or privilege","zh":"（引申义，较少用）赋予某人某种权利、职责或特权"},"examples":[{"en":"The charter enfiefed the council with new powers over local taxes.","zh":"该宪章赋予议会新的地方税收权力。"}]}],"synonyms":["enfeoff","grant","invest","endow"],"phonetic":"/ɛnˈfiːf/","extraExplanation":["“enfief”主要出现在历史、法律或文学语境，和中世纪欧洲的“封建制度”有关：国王/领主把土地（fief/采邑）授予封臣（vassal），封臣则以效忠、军役或贡赋作为回报。","词源上由“en-”（使……处于某种状态）+ “fief”（采邑）构成；现代英语中更常见的相关词是“enfeoff”（意思很接近，在法律英语里更常见）。"]}
{"word":"enfierce","summary":{"en":"“Enfierce” is a rare, archaic verb meaning “to make fierce” or “to become fierce.”","zh":"“enfierce”是一个少见的古体动词，表示“使变得凶猛/激烈”或“变得更凶猛/更强烈”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic or literary) To make someone or something fierce; to embolden, intensify, or drive into a more violent/angry state.","zh":"（古体/文学用语）使变得凶猛；使更强烈；激起愤怒或促使变得更暴烈。"},"examples":[{"en":"The harsh winter seemed to enfierce the wolves, pushing them closer to the village.","zh":"严冬仿佛使狼群更凶猛，逼得它们更靠近村庄。"},{"en":"His speech was meant to inspire the crowd, but it only enfierced their anger.","zh":"他的演讲本想鼓舞人群，却反而激起了他们更强烈的愤怒。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Very rare) To become fierce or more intense.","zh":"（极少用）变得凶猛；变得更强烈。"},"examples":[{"en":"As the argument continued, their tempers enfierced.","zh":"争吵持续下去，他们的脾气越来越火爆。"}]}],"synonyms":["enrage","inflame","embolden","fiercen (rare)","intensify"],"phonetic":"/ɛnˈfɪrs/","extraExplanation":["“enfierce”非常少见，多出现在早期英语或仿古的文学写作中。现代英语里更常用的表达有：*enrage*（激怒）、*inflame*（激起/加剧）、*fiercen*（更少见，但比 enfierce 直观）、或用短语 *make … fiercer*。","词形上可理解为前缀 **en-**（使……进入某种状态）+ **fierce**（凶猛的），意思就是“使变得凶猛/激烈”。在现代写作中使用它会带有明显的古典或戏剧化语感。"]}
{"word":"enfigure","summary":{"en":"“Enfigure” is a rare, literary verb meaning to depict/embody something or to shape it into a form.","zh":"“enfigure”是较少见的文学用动词，表示“描绘/体现某事”或“使……成形、塑造”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary, uncommon) To represent or embody something in a visible form; to depict in words or images.","zh":"（文学用语，较少见）把某事物用可见的形式表现出来；用文字或图像描绘、体现。"},"examples":[{"en":"In the poem, the storm enfigures the hero’s inner conflict.","zh":"在这首诗里，暴风雨体现了英雄内心的冲突。"},{"en":"The painter tried to enfigure grief without showing a single tear.","zh":"画家试图在不画出一滴眼泪的情况下表现悲伤。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Literary, uncommon) To give something a particular shape or figure; to form or fashion.","zh":"（文学用语，较少见）使……成形；塑造、使具有某种形态。"},"examples":[{"en":"Time enfigured the riverbanks into smooth curves.","zh":"时间把河岸塑造成平滑的弧线。"},{"en":"She enfigured her ideas into a clear outline.","zh":"她把想法整理成清晰的大纲。"}]}],"synonyms":["represent","embody","depict","portray","shape","form"],"phonetic":"/ɛnˈfɪɡjɚ/","extraExplanation":["“enfigure”带有明显的文学/古风色彩，现代日常英语里很少用。更常见、更自然的替代词包括：represent（代表/体现）, embody（体现/化身）, depict（描绘）, portray（刻画）, shape/form（塑造/形成）。","构词上常见为 en- + figure（使……成为某种形态/形象），语感上接近“赋予形象、把抽象变得可见”。"]}
{"word":"enfilade","summary":{"en":"Enfilade usually means a straight aligned series (especially of rooms/doors), and in military contexts it refers to fire directed along the length of a line or trench.","zh":"Enfilade 常指（建筑中）一列对齐相通的空间（如房间/门），在军事语境中指沿队列或战壕纵向扫射的“纵射/纵射火力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A line or arrangement of rooms, doors, windows, or columns that are aligned so you can see or move straight through them.","zh":"（建筑中）一列对齐相通的房间、门、窗或柱廊，使人能沿直线望穿或穿行。"},"examples":[{"en":"From the entrance, you can see an enfilade of doors stretching to the back of the house.","zh":"从入口处，你能看到一列对齐的门一直延伸到房子后面。"},{"en":"The museum’s main gallery is designed as an enfilade, guiding visitors in a straight path.","zh":"博物馆的主展厅被设计成串联的长轴线，引导参观者沿直线前进。"}]},{"partOfSpeech":"n.","definition":{"en":"In military use, a position where gunfire can sweep along the length of a line of troops or a trench.","zh":"（军事）能沿敌方队列或战壕的长度方向进行纵向射击的位置；纵射。"},"examples":[{"en":"The soldiers tried to avoid being caught in enfilade fire along the trench.","zh":"士兵们尽量避免在战壕里遭到纵向火力扫射。"},{"en":"They shifted the artillery to enfilade the road.","zh":"他们调整炮位以纵向射击那条道路。"}]},{"partOfSpeech":"vt.","definition":{"en":"To direct gunfire so that it sweeps along the length of a target formation or position.","zh":"（军事）对（队列/阵地）实施纵射；沿目标纵向扫射。"},"examples":[{"en":"The machine gun was placed to enfilade the narrow pass.","zh":"机枪被架设在能纵向扫射狭窄山口的位置。"}]}],"synonyms":["alignment","suite (of rooms)","vista","long view","(mil.) raking fire"],"phonetic":"ˌɛn.fəˈleɪd","extraExplanation":["词源与读法：enfilade 来自法语（en “使……处于/进入” + fil “线”），字面意思接近“沿着一条线”。因此它在建筑里强调“对齐成一条视线/通道”，在军事里强调“沿着队列或战壕的长度方向扫射”。","文化与语境：在欧洲宫殿与古典建筑中常见“enfilade of rooms”（成串套间、轴线串联的房间），例如许多巴洛克或新古典风格建筑会用这种布局制造庄严的“长视廊”效果。","相关词：建筑语境常与 suite of rooms（套间）、axis（轴线）、vista（远景/长视线）搭配；军事语境常见 enfilade fire（纵射火力），与 flanking fire（侧射火力）概念相近但不完全相同。"]}
{"word":"enfiladed","summary":{"en":"Enfiladed means being raked by fire along the length of a line or position; it’s also the past form of enfilade (“to fire along the length of”).","zh":"enfiladed 指（军事上）被纵射火力沿队列/阵地长度方向扫射的；也可作动词 enfilade 的过去式/过去分词，表示“实施纵射”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Military) Hit or raked by gunfire directed along the length of a line (such as troops, a trench, or a road).","zh":"（军事）被“纵射/纵向火力”扫射的；火力沿着队列、战壕或道路的长度方向射入。"},"examples":[{"en":"The soldiers were enfiladed as they moved down the narrow road.","zh":"士兵们沿着狭窄道路前进时，遭到纵射火力扫射。"},{"en":"The trench was enfiladed from a hill to the right.","zh":"战壕从右侧山坡方向遭到纵射。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of enfilade: to direct fire along the length of (a line or position).","zh":"enfilade 的过去式/过去分词：对（队列或阵地）实施纵射；沿其长度方向开火。"},"examples":[{"en":"The machine gun enfiladed the advancing line.","zh":"机枪对前进的队列实施纵射。"},{"en":"They were enfiladed by artillery positioned on higher ground.","zh":"他们被部署在高地上的炮兵纵射。"}]}],"synonyms":["raked (by fire)","swept (by fire)","subjected to enfilade fire","hit along the line"],"phonetic":"/ˌɛn.fəˈleɪd/","extraExplanation":["“enfilade”源自法语，词根与“fil”（线、细丝）有关，核心画面是“沿着一条线的方向扫过去”。在军事语境里，它强调射击方向与目标队形/阵地的“长度方向”一致，因此通常杀伤更大。常见对比词是“frontal fire（正面射击）”或“flanking fire（侧翼射击）”。在历史写作中也常用来描写壕沟战、城防与狭窄通道（如山谷或街巷）中的火力优势。"]}
{"word":"enfilades","summary":{"en":"Enfilade means a straight alignment—either a line of rooms/doorways you can see through, or (military) fire directed along the length of a target.","zh":"enfilade 指“成一直线的对齐”：可指建筑中一串门洞/房间形成的视线通廊，也可指军事上的“纵射火力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A series of rooms, doorways, or openings aligned in a straight line so you can see through them.","zh":"（房间、门洞等）成一直线对齐的一串空间/开口，从一个点能一路望穿。"},"examples":[{"en":"From the entrance, you could see an enfilade of rooms stretching toward the garden.","zh":"从入口处，你能看到一串连成一线的房间一直延伸到花园。"},{"en":"The palace is designed with an enfilade of doorways to create long views.","zh":"这座宫殿用一连串对齐的门洞设计出很长的视线通廊。"}]},{"partOfSpeech":"n.","definition":{"en":"In military use, a line of fire that runs along the length of a target (such as a trench), allowing shots to strike it from end to end.","zh":"【军事】纵射火力：火力沿目标（如战壕）长轴方向扫射，使目标从头到尾都暴露在射击下。"},"examples":[{"en":"The soldiers feared enfilade fire along the trench.","zh":"士兵们害怕战壕遭到纵射火力扫射。"},{"en":"They moved at night to avoid being caught in enfilade.","zh":"他们夜间行动以避免暴露在纵射火力之下。"}]}],"synonyms":["alignment","suite (of rooms)","vista","long view","crossfire (related, not exact)"],"phonetic":"/ˌɛn.fəˈleɪd/","extraExplanation":["这个词来自法语 enfilade，原意与“像穿针引线一样串起来”有关：在建筑里指门洞/房间对齐形成一条视线；在军事里指沿着目标“纵向”扫射。","常见于描述欧洲宫殿、博物馆的空间布局（如走过一串对齐的门洞），以及军事史写作中谈战壕或阵地火力布局。"]}
{"word":"enfilading","summary":{"en":"Enfilading refers to directing fire along the length of a line (troops, trench, street), hitting many targets in a row.","zh":"enfilading 指沿着队列、战壕或街道的纵向火力/扫射，使目标像一串一样被连续打击。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Military) Describing gunfire or attack directed along the length of a line (such as troops, a trench, or a street), so it can hit many targets in a row.","zh":"（军事）指火力或攻击沿着队列、战壕或街道的纵向射击/扫射，从而能连续打击一整排目标。"},"examples":[{"en":"The machine gun was positioned for enfilading fire down the trench.","zh":"机枪被部署在能沿战壕纵向实施扫射的位置。"},{"en":"They avoided the open road to prevent an enfilading attack.","zh":"他们避开了开阔的道路，以免遭到沿路纵向的扫射式攻击。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “enfilade”: to direct fire along the length of a formation or space, striking it from end to end.","zh":"“enfilade”的现在分词：指沿队列/空间的纵向实施射击，从一端扫到另一端。"},"examples":[{"en":"The artillery was enfilading the enemy positions from the side.","zh":"炮兵正从侧面沿纵深对敌方阵地进行纵向射击。"},{"en":"A single elevated gun could enfilade the entire street.","zh":"一挺架在高处的枪就能沿整条街实施纵向扫射。"}]}],"synonyms":["raking","sweeping","flanking (in context)","crossfire (related)"],"phonetic":"ˌɛn.fəˈleɪ.dɪŋ","extraExplanation":["“enfilade / enfilading”常见于军事史写作与战术描述，强调火力与目标“成一条线”时的致命性（例如战壕、道路、狭长通道）。","词源来自法语 enfiler，原意有“把东西穿成串/穿线”的感觉，引申为“沿着一条线贯穿”。"]}
{"word":"enfile","summary":{"en":"Enfile means to arrange or move in a single line; in military use, it can mean to fire down the length of a line or passage.","zh":"enfile 指把……排成一列或列队前进；在军事用法中也可指沿队列/通道的纵向射击（纵射）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(often in passive) To line up or arrange in a straight row, one behind another; to file in.","zh":"（常用于被动）把……排成一列；使依次列队前进。"},"examples":[{"en":"The guests were enfiled along the corridor as they waited to enter the hall.","zh":"客人们在走廊里被安排成一列，等着进入大厅。"},{"en":"Students enfiled through the narrow doorway one by one.","zh":"学生们一个接一个地从狭窄的门口列队进入。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common; military) To fire along the length of a line, hallway, or trench so that the shots travel straight down it.","zh":"（较少见；军事）沿着队列、走廊或战壕的纵向射击，使火力贯穿其全长。"},"examples":[{"en":"The machine gun could enfile the trench from the hilltop.","zh":"那挺机枪能从山顶沿战壕纵向扫射。"},{"en":"The defenders positioned themselves to enfile the bridge approach.","zh":"防守方布置位置以便沿桥头通道纵向射击。"}]}],"synonyms":["line up","file","queue","array","enfilade (related)"],"phonetic":"/ɛnˈfaɪl/","extraExplanation":["“enfile”来自法语 en filer（意为“排成一线、像线一样延伸”）。在军事语境里，它常与名词“enfilade（纵射、纵向火力）”相关：指沿着目标的长度方向射击，通常比横向射击更具破坏力。"]}
{"word":"enfiled","summary":{"en":"“Enfiled” usually means “arranged in a line/sequence,” and in military contexts it means “hit by lengthwise gunfire.”","zh":"“enfiled”通常指“排成一列/按顺序连接”；在军事语境中指“遭到沿纵向的火力扫射（纵射）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “enfile”: to arrange or join things in a line, often by threading them together or putting them in sequence.","zh":"“enfile”的过去式/过去分词：把东西排成一列，常指把物品串起来或按顺序连接起来。"},"examples":[{"en":"She enfiled the beads onto a string to make a necklace.","zh":"她把珠子串在绳子上做成项链。"},{"en":"The documents were enfiled in chronological order for easy reference.","zh":"文件按时间顺序依次整理，便于查阅。"}]},{"partOfSpeech":"vt.","definition":{"en":"In military writing: to direct gunfire along the length of a line of troops or a position (to “enfilade” it).","zh":"军事用法：沿着部队队列或阵地的纵向进行射击（即实施“纵射/侧击纵向火力”）。"},"examples":[{"en":"The trench was enfiled by machine-gun fire from the hill.","zh":"战壕遭到来自山上的机枪纵向扫射。"},{"en":"They built a wall to prevent their flank from being enfiled.","zh":"他们修筑了一道墙，以防侧翼被纵向火力打击。"}]}],"synonyms":["lined up","arranged","threaded","strung","ordered","enfiladed"],"phonetic":"/ɛnˈfaɪld/","extraExplanation":["“enfile”源自法语，原意与“线、串在一起”有关，所以既可指把物品串成一线，也发展出军事上的“沿纵深方向射击（enfilade fire）”。在现代英语里，这个词日常较少见，更常出现在文学描写、历史叙述或军事语境中。"]}
{"word":"enfin","summary":{"en":"“Enfin” is a common French word meaning “finally/at last,” and it can also mean “well/anyway/in short” to move a conversation along or conclude.","zh":"“Enfin”是常见法语词，意思多为“终于/总算”；也可表示“嗯/总之/不管怎样”，用于推进话题或作总结。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(French) finally; at last (used when something happens after a delay or difficulty).","zh":"（法语）终于；总算（表示等待很久或经历困难后终于发生）。"},"examples":[{"en":"Enfin, the train arrived after two hours.","zh":"终于，火车在两小时后到了。"},{"en":"He sighed, “Enfin!” when the exam ended.","zh":"考试结束时，他叹了口气说：“终于！”"}]},{"partOfSpeech":"adv.","definition":{"en":"(French) well; anyway; in short (used in conversation to change topic, sum up, or conclude).","zh":"（法语）嗯；总之；不管怎样（口语中用于转折、总结或收尾）。"},"examples":[{"en":"Enfin, let’s talk about something else.","zh":"总之，我们聊点别的吧。"},{"en":"Enfin, that’s my opinion.","zh":"总之，这就是我的看法。"}]},{"partOfSpeech":"int.","definition":{"en":"(French, as an exclamation) at last!; about time! (shows relief, impatience, or emphasis).","zh":"（法语作感叹）可算来了！；早该如此！（表达松一口气、不耐烦或强调）。"},"examples":[{"en":"“Enfin!” she said, when he stopped arguing.","zh":"“总算！”他不再争辩时她说道。"}]}],"synonyms":["finally","at last","well","anyway","in short"],"phonetic":"/ɑ̃ˈfɛ̃/","extraExplanation":["“Enfin”在法语里很常见，既可以表示时间上的“终于”，也常作为话语标记（discourse marker）用于承上启下，相当于英语里的“well / anyway / in any case / to sum up”。具体含义要看语气和上下文。","在英语文本中，你可能会在描写法国人物、法式对话或具有法式风格的文学作品里看到“enfin”被保留为法语，以增加氛围或人物性格。"]}
{"word":"enfire","summary":{"en":"“Enfire” is a literary verb meaning to ignite something or, figuratively, to stir up intense emotion.","zh":"“enfire”是较文学化的动词，意思是点燃（使着火），也可比喻为激起强烈情感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary) To set on fire; to ignite.","zh":"（文学用语）点燃；使着火。"},"examples":[{"en":"A single spark could enfire the dry grass in seconds.","zh":"一颗火星就可能在几秒内点燃干燥的草。"},{"en":"In the novel, anger seems to enfire the whole town.","zh":"在小说里，愤怒仿佛点燃了整个小镇。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To arouse strong feeling or passion; to inflame.","zh":"（比喻）激起强烈情感；使热血沸腾／使激动。"},"examples":[{"en":"Her speech enfired the crowd with hope.","zh":"她的演讲点燃了人群的希望。"},{"en":"Old memories can enfire jealousy if you’re not careful.","zh":"如果不小心，旧回忆可能会激起嫉妒。"}]}],"synonyms":["ignite","set on fire","inflame","kindle"],"phonetic":"/ɛnˈfaɪr/","extraExplanation":["“enfire”在现代英语中比较少见，更常见的说法是“set on fire / ignite / inflame”。它带有更强的文学色彩，常用于诗歌、小说或较正式的写作。","词首“en-”常有“使……处于某种状态/使变得……”的意思（如“enrich”使富裕，“enlarge”使变大），所以“enfire”字面就是“使……起火/使……燃起来”。"]}
{"word":"enfirm","summary":{"en":"Enfirm is a rare/archaic verb meaning “to weaken” or “to become weak.”","zh":"Enfirm 是一个罕见/古语动词，意思是“使虚弱/削弱”或“变得虚弱”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To make someone or something weak; to weaken or impair.","zh":"（罕见/古语）使（某人/某物）虚弱；削弱；损害。"},"examples":[{"en":"Years of poor nutrition can enfirm the body.","zh":"多年的营养不良会使身体虚弱。"},{"en":"Grief seemed to enfirm his spirit.","zh":"悲伤似乎削弱了他的精神。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare/archaic) To become weak or feeble.","zh":"（罕见/古语）变得虚弱；衰弱。"},"examples":[{"en":"As winter deepened, the old tree began to enfirm.","zh":"随着冬天加深，那棵老树开始衰弱。"}]}],"synonyms":["weaken","impair","enfeeble","undermine"],"phonetic":"/ɪnˈfɝm/","extraExplanation":["“enfirm”在现代英语中非常少见，多见于旧文本或模仿古风的写作。日常表达里通常不用它。","很多学习者其实想查的是 **infirm**（adj. 虚弱的；体弱的），读音接近，拼写也容易混淆。更常见的现代说法包括：**weaken, impair, undermine**（动词）以及 **weak, frail**（形容词）。"]}
{"word":"enflagellate","summary":{"en":"Enflagellate is a rare verb meaning to whip severely, or (in very rare biology use) to make something develop flagella.","zh":"Enflagellate 是一个罕见动词，常指“鞭笞、鞭打”，在极罕见的生物学用法中也可指“使长出鞭毛”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To whip or beat (someone or something), especially as punishment; to scourge.","zh":"（罕见）鞭打、抽打（某人或某物），尤指作为惩罚；鞭笞。"},"examples":[{"en":"In the old story, the prisoner was enflagellated in public.","zh":"在那个古老的故事里，囚犯被当众鞭笞。"},{"en":"The novel describes a cruel ruler who would enflagellate his servants for small mistakes.","zh":"小说描写了一位残暴的统治者，会因小错鞭打仆人。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Biology, very rare) To provide with flagella; to make (a cell or organism) flagellate (able to move using whip-like tails).","zh":"（生物学，极罕见）使长出鞭毛；使（细胞或生物体）具鞭毛、能靠鞭毛运动。"},"examples":[{"en":"Some older texts used enflagellate to describe cells becoming able to swim by developing flagella.","zh":"一些较早的文献用 enflagellate 来描述细胞通过长出鞭毛而获得游动能力。"}]}],"synonyms":["flagellate","whip","flog","scourge","lash"],"phonetic":"/ˌɛnˈflɛdʒəˌleɪt/","extraExplanation":["这个词非常少见；更常见的词是 flagellate（鞭打；或“有鞭毛的”）。前缀 en- 常有“使……进入某种状态/使具有……”的意思（如 enlarge=使变大）。","在文学语境里，它通常带有强烈的暴力与惩罚色彩；如果你想更中性或更常用的表达，可用 whip, flog, scourge（语气从普通到更文学/更强烈不等）。"]}
{"word":"enflagellation","summary":{"en":"A rare noun meaning “flagellation” (whipping), often in historical, religious, or literary contexts.","zh":"一个很少见的名词，意思同“flagellation”（鞭笞/抽打），多见于历史、宗教或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or practice of whipping or beating, especially as punishment or for religious/ritual reasons; flagellation","zh":"鞭笞；抽打（尤指作为惩罚或宗教/仪式行为的自我或他人鞭打）"},"examples":[{"en":"The novel includes a scene of enflagellation meant to show the cruelty of the old prison system.","zh":"这部小说有一段鞭笞的描写，用来展现旧监狱制度的残酷。"},{"en":"Some historical accounts mention enflagellation as a form of public punishment.","zh":"一些历史记载提到，鞭笞曾是一种公开的惩罚方式。"}]}],"synonyms":["flagellation","whipping","lashings","scourging"],"phonetic":"/ɛnˌflædʒəˈleɪʃən/","extraExplanation":["“enflagellation”非常少见，更常用的词是“flagellation”（鞭笞）。前缀“en-”有“使……处于某种状态/加以……”的意味，但在现代英语里这个词并不常见于日常或学术写作。","“flagellation”在历史与文学语境中可能指刑罚，也可能指宗教意义上的“苦修/自我鞭笞”（self-flagellation）。现代日常表达通常避免使用该词，除非讨论历史、宗教或特定文学场景。"]}
{"word":"enflame","summary":{"en":"Enflame means to ignite or intensify fire, and more commonly to arouse or intensify strong emotions like anger or passion.","zh":"Enflame既可指“点燃/使火势加剧”，更常指“激起或加剧强烈情绪（如愤怒、激情）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make someone feel strong emotion (especially anger, passion, or excitement).","zh":"激起（强烈情绪）；使（尤指愤怒、激情、兴奋）加剧。"},"examples":[{"en":"The politician’s remarks enflamed public anger.","zh":"那位政客的言论激起了公众的愤怒。"},{"en":"Online rumors can quickly enflame a tense situation.","zh":"网络谣言会迅速让紧张局势升级。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause something to burn or become hotter; to inflame.","zh":"使燃烧；使更炽热；点燃（较少用）。"},"examples":[{"en":"A gust of wind enflamed the small fire.","zh":"一阵风让小火越烧越旺。"},{"en":"Dry leaves can enflame quickly in summer heat.","zh":"干树叶在夏季高温下很容易燃烧起来。"}]}],"synonyms":["inflame","ignite","kindle","provoke","stir up","agitate"],"phonetic":"/ɪnˈfleɪm/","extraExplanation":["“en-”有“使……进入某种状态”的意思，enflame字面上是“使成火/使燃起”，因此既可指真实的“燃烧”，也常用于比喻“点燃情绪、加剧矛盾”。在新闻与评论写作中，enflame常带有“让事态更糟、更激烈”的语气色彩。"]}
{"word":"enflamed","summary":{"en":"Enflamed means inflamed: either physically red and swollen, or (less commonly) emotionally angered/excited.","zh":"enflamed 意为 inflamed：可指身体发红肿痛的“发炎”，也可（较少见）指情绪被激起、被激怒。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually of a body part or tissue) red, swollen, and painful because of irritation or infection; inflamed.","zh":"（通常指身体部位或组织）因刺激或感染而发红、肿胀、疼痛的；发炎的。"},"examples":[{"en":"Her throat was enflamed, so swallowing hurt.","zh":"她的喉咙发炎了，所以吞咽会痛。"},{"en":"The doctor said the skin looked enflamed and advised her to stop using that cream.","zh":"医生说皮肤看起来发炎了，并建议她停止使用那种乳霜。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) made very angry or emotionally excited; inflamed.","zh":"（较少见）被激怒的；情绪被煽动得很激动的。"},"examples":[{"en":"His enflamed temper made the argument worse.","zh":"他被激怒的脾气让争吵更糟。"},{"en":"The speech left the crowd enflamed with anger.","zh":"那场演讲让人群被愤怒煽动得情绪高涨。"}]}],"synonyms":["inflamed","swollen","irritated","reddened","angered","incensed"],"phonetic":"/ɪnˈfleɪmd/","extraExplanation":["“enflamed”是“inflamed”的变体拼写，现代英语中更常用“inflamed”（医学与日常用法都更普遍）。","词源上与“flame（火焰）”相关，常用于比喻：身体像“着火”一样发热、红肿，或情绪像“被点燃”一样激动。"]}
{"word":"enflames","summary":{"en":"Enflames means “sets on fire” or “makes emotions/conflict more intense.”","zh":"enflames 意为“点燃（火）”或“使情绪/冲突更激烈（激化）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular of enflame) To set something on fire; to ignite.","zh":"（enflame 的第三人称单数）使起火；点燃。"},"examples":[{"en":"A single spark can enflame dry grass in seconds.","zh":"一个火星就能在几秒内点燃干草。"},{"en":"The hot wind enflames the wildfire’s edge.","zh":"热风助长了野火边缘的火势。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make emotions or a situation more intense (often anger, fear, or conflict); to inflame.","zh":"使情绪或局势更激烈（常指愤怒、恐惧或冲突）；煽动；激化。"},"examples":[{"en":"Careless rumors can enflame tensions in a community.","zh":"不负责任的谣言会激化社区紧张关系。"},{"en":"His speech enflames the crowd’s anger instead of calming it.","zh":"他的演讲没有安抚人群，反而点燃了他们的怒火。"}]}],"synonyms":["ignite","set on fire","inflame","kindle","exacerbate","intensify"],"phonetic":"/ɪnˈfleɪmz/","extraExplanation":["“enflames”是动词“enflame”的第三人称单数形式，常见于一般现在时（He/She/It enflames...）。","“en-”这个前缀有“使……进入某种状态/使……成为……”的感觉，因此 enflame 字面可理解为“使成为火/使燃起”。在比喻义里常与 anger/tension/conflict 等搭配。"]}
{"word":"enflaming","summary":{"en":"“Enflaming” means causing something to burn, or (more commonly) making emotions or conflict more intense.","zh":"“enflaming”指点燃使其燃烧，或（更常见）使情绪/冲突加剧、被煽动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making feelings, conflict, or a situation more intense; stirring up strong emotion (often anger, passion, or debate).","zh":"使情绪、冲突或局势更激烈；煽动强烈情感（常指愤怒、激情或争论）。"},"examples":[{"en":"The headline was enflaming tensions between the two communities.","zh":"这条标题在煽动两大社群之间的紧张情绪。"},{"en":"His speech had an enflaming effect on the crowd.","zh":"他的演讲对人群起到了煽动性的作用。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of setting something on fire or causing it to burn (literal meaning; less common in modern everyday use).","zh":"点燃某物、使其燃烧（字面义；现代日常用法较少见）。"},"examples":[{"en":"Dry wind and heat can speed up enflaming of brush in the summer.","zh":"夏季的干风与高温会加速灌木的起火燃烧。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “enflame”: to make something burn or to make emotions stronger.","zh":"“enflame”的现在分词：使燃烧；或使情绪更强烈。"},"examples":[{"en":"The rumor kept enflaming public anger online.","zh":"这则谣言不断在网上激化公众的愤怒。"},{"en":"A single spark is capable of enflaming the dry grass.","zh":"一点火星就足以点燃干草。"}]}],"synonyms":["inflaming","igniting","stirring up","fueling","kindling"],"phonetic":"/ɛnˈfleɪmɪŋ/","extraExplanation":["“enflame / enflaming”带有比较强的文学色彩或正式语气，尤其常见于描写“激情/愤怒被煽起”的场景。日常口语里更常用：ignite（点燃/引发）、inflame（激怒/使加剧）、stir up（煽动）、fuel（火上浇油/助长）。","拼写上要注意：enflame（使燃烧/使激动）与 inflame（使发炎；使激怒/使加剧）意义接近，但 inflame 在医学语境里也很常见（inflammation 炎症）。"]}
{"word":"enflesh","summary":{"en":"Enflesh means to make something more fully formed—especially by adding details—or to make an abstract idea feel embodied and real.","zh":"enflesh 指通过补充细节让内容更完整具体，或把抽象概念“实体化”、变得有血有肉。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To give (an idea, plan, or story) more detail so it feels complete and real; to develop or elaborate.","zh":"（使想法、计划或故事）更充实、更具体；补充细节使其更完整、更真实。"},"examples":[{"en":"We have the basic plot; now we need to enflesh the characters with real motivations.","zh":"我们有了基本情节；现在需要给角色补充真实的动机，让他们更立体。"},{"en":"The proposal is good, but it needs to be enfleshed with data and timelines.","zh":"这个提案不错，但需要用数据和时间表把它充实起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover or fill with flesh; to make something seem embodied or “made physical.”","zh":"用肉覆盖或使之长出肉；使某物看起来有具体形体、被“实体化”。"},"examples":[{"en":"Mythic tales often enflesh abstract forces as gods and monsters.","zh":"神话故事常把抽象力量实体化为神祇和怪物。"},{"en":"In the novel, the author enfleshes grief into a character who follows the narrator.","zh":"在小说里，作者把“悲伤”具象化成一个跟着叙述者的角色。"}]}],"synonyms":["flesh out","develop","elaborate","fill out","embody"],"phonetic":"/ɛnˈflɛʃ/","extraExplanation":["“en-”常表示“使……成为/进入某种状态”（如 enable 使能够）。enflesh 字面是“使成肉身/使有肉”，在现代英语里更常用于写作、创意、学术表达中，意思接近“把抽象变具体、把骨架补成有血有肉的作品”。","语体偏正式，不太用于日常口语；更自然的口语替换有 flesh out, fill in the details, develop。"]}
{"word":"enfleshed","summary":{"en":"Enfleshed means “having flesh” or “embodied in a physical body,” often used in philosophical or literary contexts.","zh":"Enfleshed 指“有血有肉的/具身体的”，多用于哲学或文学语境，强调经验与身体不可分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a body or person) having flesh; made of flesh rather than being purely spiritual, abstract, or skeletal.","zh":"（指身体/人）有血有肉的；由肉体构成的（相对于纯精神的、抽象的或仅骨架的）。"},"examples":[{"en":"Humans are enfleshed beings—we experience the world through our bodies.","zh":"人类是有血有肉的存在——我们通过身体来体验世界。"},{"en":"The novel contrasts the enfleshed, everyday life of the characters with their lofty ideals.","zh":"这部小说将人物有血有肉的日常生活与他们崇高的理想形成对比。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) given flesh; embodied in a physical form.","zh":"（较少见）被赋予肉身的；具体化为可触摸的身体形态的。"},"examples":[{"en":"In some myths, a spirit becomes enfleshed and walks among people.","zh":"在一些神话里，灵体会获得肉身，行走于人间。"},{"en":"The poet imagines love enfleshed as a person at the door.","zh":"诗人想象“爱”化为肉身，成了站在门口的人。"}]}],"synonyms":["embodied","incarnate","corporeal","in the flesh"],"phonetic":"/ɛnˈflɛʃt/","extraExplanation":["“enfleshed”常见于哲学、神学、文学评论中，用来强调人类经验离不开身体（例如痛觉、饥饿、疲惫、亲密感等），常与“embodied（具身的）”意思相近。","构词：en-（使……处于某种状态）+ flesh（肉体），字面可理解为“使之有肉/成为肉身”。日常英语里更常说“fleshy”或“in the flesh”，但语气与含义不完全相同。"]}
{"word":"enfleurage","summary":{"en":"Enfleurage is a traditional perfume-making technique that uses fat to absorb the scent of flowers.","zh":"Enfleurage（脂吸法）是一种用油脂吸附花香、再提取香精的传统制香工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A method of extracting fragrance from flowers by placing petals on odorless fat (or oil) so the scent is absorbed, then processing the perfumed fat to obtain an essence.","zh":"一种传统的花香萃取法：把花瓣铺在无味的脂肪（或油脂）上，让香气被吸附，再处理带香的脂肪以取得香精/香料。"},"examples":[{"en":"Traditional jasmine perfume was sometimes made using enfleurage.","zh":"传统的茉莉香水有时会用“脂吸法（enfleurage）”制作。"},{"en":"Enfleurage is slow and labor-intensive, so it’s rare in modern perfumery.","zh":"脂吸法耗时又费工，所以在现代调香中比较少见。"}]}],"synonyms":["fat extraction","cold fat extraction","cold enfleurage"],"phonetic":"/ˌɑ̃fluːˈrɑːʒ/","extraExplanation":["“Enfleurage”来自法语，字面含义接近“用花覆盖/让花附着”。这种方法在香水史上很有名，尤其与法国格拉斯（Grasse）等传统香水产地相关。","它适合处理一些受热会变质、无法用蒸馏等高温方式提取香气的娇嫩花朵（例如茉莉、晚香玉等）。","在现代工业中更常见的是溶剂萃取（得到“浸膏/原精”）等方法；但在文学或香水文化讨论里，“enfleurage”常被用来唤起一种复古、手工、精致的意象。"]}
{"word":"enflower","summary":{"en":"“Enflower” means to decorate something with flowers, or (literary) to bloom.","zh":"“Enflower”指用花装饰（某物）；也可作文学用法表示“开花、绽放”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to decorate or cover with flowers; to adorn something as if with flowers","zh":"用花装饰；使（某物）布满花（或如花般点缀）"},"examples":[{"en":"They enflowered the wedding arch with roses and ivy.","zh":"他们用玫瑰和常春藤把婚礼拱门装点得繁花似锦。"},{"en":"In spring, wild blossoms enflower the hillsides.","zh":"春天里，野花让山坡开满花朵。"}]},{"partOfSpeech":"vi.","definition":{"en":"to flower; to come into bloom (literary)","zh":"（文学用法）开花；绽放"},"examples":[{"en":"After the long rain, the garden began to enflower.","zh":"久雨之后，花园开始开花绽放。"}]}],"synonyms":["decorate with flowers","adorn","bedeck","garland","cover with flowers"],"phonetic":"/ɛnˈflaʊɚ/","extraExplanation":["“en-”是一个常见前缀，表示“使……进入某种状态/使……具有……（to cause to be/put into）”。例如：enrich（使富裕/使更丰富）、enlarge（使变大）。所以 enflower 字面意思就是“使……有花/使……像花一样”。","enflower 比较少见，带有诗意、文学色彩；日常英语更常用 decorate with flowers / cover with flowers / flower-strewn 等表达。"]}
{"word":"enflowered","summary":{"en":"Enflowered means covered with flowers or decorated with floral patterns, often in poetic writing.","zh":"Enflowered 指“开满花的/以花装饰的”，多用于诗意或文学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with flowers; decorated with flower-like patterns (often poetic or literary).","zh":"开满花的；以花装饰的；带有花卉图案的（常见于诗歌或文学语境）。"},"examples":[{"en":"They walked through an enflowered meadow in late spring.","zh":"他们在暮春时分走过一片开满花的草地。"},{"en":"The balcony was enflowered with pots of geraniums and roses.","zh":"阳台上摆满了天竺葵和玫瑰盆栽，繁花点缀。"},{"en":"In the poem, the garden is described as “enflowered,” suggesting abundance and new life.","zh":"诗中把花园写成“开满花的”，暗示丰盛与新生。"}]}],"synonyms":["flower-covered","in bloom","blossoming","flower-strewn","floral"],"phonetic":"/ɛnˈflaʊərd/","extraExplanation":["“enflowered”由前缀 en-（使……处于某种状态/使……具有……）+ flower 构成，整体语气偏文学、描写性强。日常英语里更常用 in bloom / full of flowers / flower-covered 等表达。","它也可理解为过去分词形容词，和 “snow-covered / sunlit” 类似，用来营造画面感。"]}
{"word":"enflowering","summary":{"en":"Enflowering is a literary word meaning “full of flowers/flowering,” or “the act of adorning with flowers.”","zh":"Enflowering 是较文学化的词，表示“繁花盛开/开花的”，也可指“用花装饰（使开花）的过程”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Covered with flowers; full of blossoms; flowering.","zh":"（文学用语）开满花的；繁花盛开的；开花的。"},"examples":[{"en":"They walked through enflowering fields in early spring.","zh":"他们在初春穿过繁花盛开的田野。"},{"en":"An enflowering vine climbed the old stone wall.","zh":"一条开满花的藤蔓爬上了那堵古老的石墙。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of covering or adorning something with flowers; blooming (present participle of enflower).","zh":"用花装饰（某物）的行为；使开花（enflower 的现在分词）。"},"examples":[{"en":"She imagined the garden enflowering the plain yard with color.","zh":"她想象花园用色彩把朴素的院子装点得花团锦簇。"},{"en":"The poem describes nature enflowering the valley after the rains.","zh":"这首诗描写雨后大自然让山谷繁花绽放。"}]}],"synonyms":["flowering","in bloom","blossoming","flower-covered"],"phonetic":"/ɛnˈflaʊərɪŋ/","extraExplanation":["“en-”是一个较古老的前缀，常有“使……处于某种状态/把……放进……”的意思（如 encircle, enrich）。因此 enflower 原意接近“使……开花/以花装饰”。","“enflowering”多见于诗歌、散文等文学语境，日常英语更常用 flowering / in bloom / covered with flowers。"]}
{"word":"enfoeffment","summary":{"en":"Enfeoffment (often spelled that way today) is a historical legal term for the formal granting and transfer of land ownership under the feudal system.","zh":"Enfeoffment（现代多作此拼写）是历史法律用语，指封建制度下正式授予并转移土地所有权（授封/封授）的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The legal act of granting someone ownership of land (a feudal “fee estate”) and formally putting them in possession of it; the transfer itself.","zh":"（封建法/古法律）授予他人土地所有权（封地/世袭不动产）并正式让其取得占有的法律行为；即土地的转让。"},"examples":[{"en":"The old deed described an “enfeoffment” of the manor to the knight.","zh":"那份旧契据记载了将庄园“封授/授封”给那位骑士的行为。"},{"en":"In medieval records, enfeoffment often required a public ceremony to show possession.","zh":"在中世纪的记录中，enfoeffment（授封）常常需要公开仪式来表示占有的取得。"}]}],"synonyms":["grant (of land)","conveyance","transfer of title","enfeoffment"],"phonetic":"/ɛnˈfiːfmənt/","extraExplanation":["这是一个非常古老、专业的法律词，现代英语里更常见的是拼写 **enfeoffment**（你输入的 **enfoeffment** 多半是旧式或变体拼写/误拼）。","词根来自法语/中古拉丁语传统：**en-**（使……）+ **fief/fee**（封地、封建地产）相关。它与封建制度下的土地授予与效忠关系有关。","在英美现代不动产法语境中，这个词基本只出现在历史讨论、旧契据或学术文章里；一般口语会用 **grant/transfer/convey title to land** 等表达。"]}
{"word":"enfoil","summary":{"en":"Enfoil is a rare verb meaning to decorate with leaf-like (foil/trefoil) ornamentation, especially in heraldry; more rarely, it can mean to wrap or cover something.","zh":"Enfoil 是一个少见动词，主要指（尤在纹章学中）用叶形花饰（foil/三叶饰等）装饰；更少见时也可指包裹或覆盖某物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Heraldry/decoration) To adorn or design with leaf-like shapes (foils) or trefoil/quatrefoil-style ornamentation.","zh":"（纹章学/装饰）用叶形花饰（foil，如三叶饰、四叶饰等）来装饰或设计。"},"examples":[{"en":"The architect enfoiled the window tracery with small trefoil patterns.","zh":"建筑师用小型三叶花饰来装点窗户的花格。"},{"en":"In the manuscript, the initial letter is enfoiled with delicate leaf-like curves.","zh":"在那份手稿中，首字母用精致的叶形曲线作了花饰装饰。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To wrap, cover, or envelop (something), as if in a thin layer.","zh":"（罕见）包裹、覆盖、裹住（某物），好像用一层薄薄的材料。"},"examples":[{"en":"The jeweler enfoiled the gem to protect it during transport.","zh":"珠宝商把宝石包裹起来，以便在运输途中保护它。"}]}],"synonyms":["ornament","embellish","decorate","adorn"],"phonetic":"/ɛnˈfɔɪl/","extraExplanation":["“enfoil”在现代英语里非常少见，最常见的语境是纹章学（heraldry）或古典装饰艺术：foil 指“叶形花饰”的一瓣（常见如 trefoil 三叶、quatrefoil 四叶图案），en- 是“使…具有/加上…”的前缀，因此 enfoil 有“加上叶形花饰、以叶形纹样装饰”的意思。","不要把它和常见词 foil（锡纸/箔/挫败）混淆：在 enfoil 里，foil 更接近“叶形装饰瓣”的含义。"]}
{"word":"enfold","summary":{"en":"Enfold means to wrap/cover completely, to embrace, or to include as part of a whole, often with a literary tone.","zh":"enfold 指“包裹/笼罩”“拥抱”，也可指“包含、纳入整体”，语气常较有文学描写感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wrap or cover something completely, often by folding it around","zh":"把某物包住或完全覆盖（常指用折叠/环绕的方式）"},"examples":[{"en":"She enfolded the baby in a warm blanket.","zh":"她用温暖的毯子把婴儿裹了起来。"},{"en":"Mist enfolded the mountains at dawn.","zh":"清晨，薄雾笼罩着群山。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hold someone or something closely in your arms; to embrace","zh":"紧紧抱住；拥抱"},"examples":[{"en":"He enfolded his daughter in a long hug.","zh":"他把女儿紧紧抱在怀里，拥抱了很久。"},{"en":"The crowd enfolded the singer as she stepped off the stage.","zh":"歌手走下舞台时，人群把她团团围住。"}]},{"partOfSpeech":"vt.","definition":{"en":"to include, surround, or contain as part of a whole","zh":"包含；包容；把……纳入整体之中"},"examples":[{"en":"The course enfolds both theory and hands-on practice.","zh":"这门课程既包含理论也包含动手实践。"},{"en":"Her novel enfolds stories from several generations.","zh":"她的小说涵盖了好几代人的故事。"}]}],"synonyms":["wrap","envelop","embrace","surround","encircle","include"],"phonetic":"/ɛnˈfoʊld/","extraExplanation":["“en-”常有“使……进入/使……处于某状态”的感觉；“fold”是“折叠”。合起来的“enfold”带有“把……包进来、裹起来”的画面感，比普通的“wrap”更偏文学、描写性。","在文学或较正式的描写中常见：如“darkness enfolded the town”（黑暗笼罩小镇），用来营造氛围。日常口语里更常说“wrap”或“hug”。"]}
{"word":"enfolded","summary":{"en":"Enfolded means wrapped around, surrounded, or held closely; it can also be the past form of “enfold,” meaning to embrace or include completely.","zh":"Enfolded 意为被包裹、被笼罩或被紧紧环抱；也可作动词 enfold 的过去式/过去分词，表示完全拥抱或纳入其中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"wrapped around something or someone; held closely as if in an embrace.","zh":"包裹住；环抱住；仿佛拥抱般紧紧围住。"},"examples":[{"en":"She stood quietly, enfolded in a warm blanket.","zh":"她安静地站着，裹在一条温暖的毯子里。"},{"en":"Mist enfolded the mountain road, making it hard to see.","zh":"薄雾笼罩着山路，让人很难看清。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of enfold: to wrap, surround, or embrace completely.","zh":"enfold 的过去式/过去分词：包住、围住或完全拥抱。"},"examples":[{"en":"He enfolded the child in his arms to calm her down.","zh":"他把孩子抱在怀里，让她平静下来。"},{"en":"The story enfolded several smaller tales inside it.","zh":"这个故事把好几个小故事包含在其中。"}]}],"synonyms":["wrapped","encircled","surrounded","embraced","enveloped"],"phonetic":"/ɪnˈfoʊldɪd/","extraExplanation":["“enfold”比较书面、带有文学色彩，常用来描写雾、黑暗、寂静、情感等“像布一样包裹”住人的感觉；比起常见的 “wrap” 或 “hug”，语气更诗意、更强调“完全包围”。","也可以表示“把……纳入/包含在整体里”（如把多个故事、观点、细节纳入一个结构中），这种用法常见于写作与学术表达。"]}
{"word":"enfolden","summary":{"en":"Enfolden is an archaic/poetic form of enfold, meaning to wrap, embrace, or completely surround.","zh":"Enfolden 是 enfold 的古语/诗歌形式，意为包裹、拥抱或完全笼罩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic/poetic) to wrap, cover, or hold something closely; to embrace.","zh":"（古语/诗歌用语）包裹、覆盖或紧紧抱住；拥抱。"},"examples":[{"en":"The mother enfolden her child in a warm shawl.","zh":"母亲用温暖的披肩把孩子裹起来。"},{"en":"Night enfolden the village in silence.","zh":"夜色把村庄笼罩在寂静之中。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic/poetic) to surround or envelop completely (often used for abstract things like light, mist, or emotion).","zh":"（古语/诗歌用语）完全包围、笼罩（常用于光、雾、情绪等抽象事物）。"},"examples":[{"en":"A soft mist enfolden the hills at dawn.","zh":"黎明时分，薄雾笼罩着群山。"},{"en":"Grief seemed to enfolden him after the news.","zh":"听到消息后，悲伤仿佛将他包围。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) to include or contain within something larger; to fold into.","zh":"（较少见）包含在更大的整体之中；纳入其中。"},"examples":[{"en":"The plan was meant to enfolden several smaller projects.","zh":"这个计划旨在把几个较小的项目纳入其中。"}]}],"synonyms":["enfold","wrap","embrace","envelop","surround","shroud","cover","encircle"],"phonetic":"/ɪnˈfoʊldən/","extraExplanation":["“enfolden”是“enfold”的古体/诗体形式，现代英语里更常用“enfold”。","词尾“-en”在古英语或中古英语里有时用来构成或加强动词形式（类似“sharpen”“widen”），在现代英语中这种用法较少见。","文学语境中常用来营造柔和、庄严或带有宗教/抒情色彩的氛围，如“night enfolden…”来表现“夜幕笼罩”。"]}
{"word":"enfolder","summary":{"en":"Enfolder means someone or something that wraps or surrounds; it’s a rare word often used in poetic descriptions.","zh":"Enfolder 指“包裹/环绕”的人或物；较罕见，常用于诗意或文学性的描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that enfolds (wraps, surrounds, or covers) something; something that acts like a wrapper or container.","zh":"包裹者；包裹物：指把某物包住、环绕或覆盖的“人或物”；可理解为“像外套/容器一样的东西”。"},"examples":[{"en":"In the poem, night is described as an enfolder of secrets.","zh":"在这首诗里，夜晚被描写成“秘密的包裹者”。"},{"en":"A thick fog became an enfolder of the town, hiding the streets from view.","zh":"浓雾成了小镇的“包裹物”，把街道都遮住了。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to enfold; to wrap or surround.","zh":"（罕用）包裹；围住：相当于 *enfold*。"},"examples":[{"en":"The vines enfolder the old stone wall over time.","zh":"藤蔓随着时间慢慢把老石墙缠绕起来。"}]}],"synonyms":["wrapper","cover","encloser","enveloper","enfold (verb)"],"phonetic":"/ɛnˈfoʊldɚ/","extraExplanation":["“enfolder”不算常用词，更常见的是动词 **enfold**（包裹、拥抱、笼罩）或名词 **enclosure / wrapper / cover**。它由 **en-**（使……进入某状态）+ **fold**（折叠、包裹）+ **-er**（做某事的人/物）构成，因此很容易理解为“把东西包起来的东西/人”。在文学写作中常用于拟人化或意象表达，如“night as an enfolder”。"]}
{"word":"enfolders","summary":{"en":"“Enfolders” means people or things that enfold—wrap around, surround, or embrace something (literary and uncommon).","zh":"“enfolders”指“包裹/环绕/拥抱某物的人或物”（偏文学、较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that enfolds (wraps, surrounds, or embraces something); an enclosing or wrapping agent.","zh":"包裹者；环抱者；使某物被包围/覆盖的人或物。"},"examples":[{"en":"In the poem, the night is described as an enfolder of secrets.","zh":"在这首诗里，夜晚被描写成“秘密的包裹者”。"},{"en":"The thick fog became an enfolder, hiding the hills from view.","zh":"浓雾成了“包裹者”，把山丘遮得看不见。"}]}],"synonyms":["wrapper","encloser","embracer","covering"],"phonetic":"/ɛnˈfoʊldɚ/","extraExplanation":["“enfolders”是名词复数形式，来自动词“enfold”（包裹、环绕、拥抱）。在现代英语中“enfolder”很少用于日常对话，更常见的表达是用动词“enfold”或名词“embrace / wrapper / covering”。","“enfold”常带有文学/诗意色彩，用来写自然景象（雾、夜色、海浪）或抽象概念（沉默、黑暗、记忆）把人或事物“包围起来”。"]}
{"word":"enfolding","summary":{"en":"Enfolding means wrapping, covering, or surrounding something (often with a protective, poetic feeling).","zh":"Enfolding 指包裹、覆盖或环绕某物（常带有保护、诗意的语感）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often poetic) The act or process of wrapping, covering, or surrounding something completely.","zh":"（常用于诗意表达）包裹、覆盖或完全环绕某物的行为或过程。"},"examples":[{"en":"The enfolding of fog over the hills made everything look soft and distant.","zh":"雾气把山丘包裹起来，让一切看起来柔和而遥远。"},{"en":"In the story, the night’s enfolding brings quiet and safety.","zh":"在故事里，夜色的笼罩带来安静与安全感。"}]},{"partOfSpeech":"adj.","definition":{"en":"Wrapping, covering, or surrounding; holding closely (used as a participle/adjective).","zh":"包裹的；覆盖的；环绕的；紧抱的（作分词形容词用）。"},"examples":[{"en":"She sat in enfolding silence, listening to the rain.","zh":"她坐在包围般的寂静里，听着雨声。"},{"en":"He gave his child an enfolding hug after the long trip.","zh":"长途旅行后，他给了孩子一个紧紧的拥抱。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of “enfold”: to wrap, cover, or surround; to embrace closely.","zh":"“enfold”的现在分词：包裹、覆盖、环绕；紧紧拥抱。"},"examples":[{"en":"Clouds were enfolding the mountain as we drove closer.","zh":"我们开近时，云层正把那座山包围起来。"},{"en":"She stood by the door, arms enfolding the gift.","zh":"她站在门边，双臂抱着礼物。"}]}],"synonyms":["wrapping","covering","surrounding","enveloping","embracing"],"phonetic":"/ɛnˈfoʊldɪŋ/","extraExplanation":["“enfold”比较偏书面或文学用语，比“wrap / cover / surround”更带有温柔、保护、怀抱的感觉，因此“enfolding”常用来描写雾、黑夜、寂静、树林、怀抱等带来“被包围”的氛围。","常见搭配：enfolding arms（环抱的手臂）、enfolding darkness（夜色笼罩）、enfolding mist/fog（雾气弥漫包围）、enfolding silence（寂静笼罩）。"]}
{"word":"enfoldings","summary":{"en":"“Enfoldings” means acts of wrapping/holding close, or surrounding layers/coverings (often literary).","zh":"“Enfoldings”指包裹/拥抱的动作过程，或包围在外的层层覆盖与褶皱（常偏文学用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the acts or processes of enclosing, wrapping, or holding something closely (plural of “enfolding”)","zh":"包裹、围住或紧紧抱住某物的动作或过程（“enfolding”的复数）"},"examples":[{"en":"In the story, the sea’s enfoldings swallow the ship in fog.","zh":"在故事里，大海的层层包围用浓雾吞没了船。"},{"en":"Her enfoldings of the child were gentle and protective.","zh":"她把孩子轻轻搂在怀里的动作温柔而有保护感。"}]},{"partOfSpeech":"n.","definition":{"en":"layers, folds, or coverings that surround something (often literary)","zh":"包围在外的层层褶皱、覆盖物或外层（常见于文学语境）"},"examples":[{"en":"They walked through the enfoldings of the forest—branches and shadows closing in.","zh":"他们走进森林的层层包围——枝叶与阴影渐渐合拢。"},{"en":"The letter was hidden in the enfoldings of a thick cloak.","zh":"那封信藏在厚斗篷的层层褶里。"}]}],"synonyms":["embraces","wraps","enclosures","coverings","folds","surroundings"],"phonetic":"/ɪnˈfoʊldɪŋz/","extraExplanation":["“enfoldings”是由动词 enfold（包住/拥抱）加 -ing 构成名词 enfolding（包裹、拥抱；覆盖层），再加复数 -s 形成。日常英语里更常用动词 enfold 或名词 fold/embrace；“enfoldings”偏文学或描写性写作，用来强调“层层包围、温柔包裹”的画面感。"]}
{"word":"enfoldment","summary":{"en":"Enfoldment means the act of enclosing or wrapping something, and it can also mean a protective, comforting embrace (often in literary or formal style).","zh":"Enfoldment 指“包裹/围住”的过程，也可指“充满保护与安慰的怀抱”（常见于较文学或正式的表达）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of wrapping, covering, or enclosing something","zh":"包裹；覆盖；围住（某物的行为或过程）"},"examples":[{"en":"The baby relaxed in the enfoldment of a warm blanket.","zh":"宝宝在温暖毯子的包裹中放松下来。"},{"en":"We watched the valley disappear into the enfoldment of fog.","zh":"我们看着山谷逐渐消失在雾的笼罩中。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) the act of holding someone close with care, protection, or love","zh":"（比喻）怀抱；拥抱式的保护与关爱"},"examples":[{"en":"After the bad news, she found comfort in her friend’s enfoldment.","zh":"听到坏消息后，她在朋友的拥抱与守护中得到了安慰。"},{"en":"The community offered an enfoldment of support to the family.","zh":"社区给予那家人一份包围式的支持与关怀。"}]},{"partOfSpeech":"n.","definition":{"en":"(specialized) a folding-in or enclosing movement or structure; sometimes used in biology, geology, or abstract writing","zh":"（专门用法）内折、卷入或围合的运动/结构；可见于生物学、地质学或抽象写作中"},"examples":[{"en":"The paper described the enfoldment of the membrane during cell movement.","zh":"论文描述了细胞运动过程中膜的内折过程。"},{"en":"Geologists studied the enfoldment of older rock layers.","zh":"地质学家研究了更古老岩层的褶皱围合。"}]}],"synonyms":["enclosure","embrace","wrapping","encirclement","covering"],"phonetic":"/ɪnˈfoʊldmənt/","extraExplanation":["词源上可理解为 en-（使进入/使处于……之中）+ fold（折叠、包裹）+ -ment（名词后缀，表示“行为/结果”）。因此 enfoldment 常带有“把……包进去、抱进去”的画面感。","在文学或抒情写作中，enfoldment 比 hug/embrace 更强调“被包围、被覆盖”的氛围（如雾、夜色、回忆的笼罩）。日常口语里更常用 wrapping, covering, embrace。"]}
{"word":"enfolds","summary":{"en":"“Enfolds” means “wraps, covers, or surrounds closely,” and can also mean “embraces” in literary use.","zh":"“Enfolds”表示“包裹、覆盖、环绕”，在文学语境中也可表示“拥抱”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wrap or cover something completely; to surround closely (often in a gentle or protective way)","zh":"包住；裹住；环绕（常带有温柔或保护的感觉）"},"examples":[{"en":"The warm scarf enfolds her neck in winter.","zh":"冬天，温暖的围巾把她的脖子裹得严严实实。"},{"en":"Fog enfolds the hills early in the morning.","zh":"清晨，雾气笼罩着群山。"}]},{"partOfSpeech":"v.","definition":{"en":"(literary) to embrace someone; to hold someone close in your arms","zh":"（文学用法）拥抱；紧紧抱住"},"examples":[{"en":"He enfolds the child in his arms to comfort her.","zh":"他把孩子紧紧抱在怀里安慰她。"},{"en":"In the poem, the sea enfolds the sailor like a mother.","zh":"在诗中，大海像母亲一样拥抱着水手。"}]}],"synonyms":["wrap","cover","surround","envelop","embrace"],"phonetic":"/ɛnˈfoʊldz/","extraExplanation":["“enfolds”是动词“enfold”的第三人称单数（he/she/it enfolds）。过去式和过去分词是“enfolded”。","“en-”这个前缀常有“使……进入/加在……上”的感觉，因此“enfold”带有“把……包进褶皱里、包裹起来”的形象意味，常见于描写雾、黑暗、寂静等“笼罩”场景，语气偏文学。"]}
{"word":"enfollow","summary":{"en":"“Follow” means to go after someone/something, obey instructions, happen next, understand, or (online) subscribe to updates.","zh":"“follow” 常指跟随、遵循指示、随后发生、理解（跟得上），也可指在社交媒体上“关注”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to go or come after someone or something; to move behind in the same direction","zh":"跟随；在……后面走（或来）"},"examples":[{"en":"The dog followed me home.","zh":"那只狗跟着我回了家。"},{"en":"Please follow the guide and stay with the group.","zh":"请跟着导游走，并且不要离开队伍。"}]},{"partOfSpeech":"v.","definition":{"en":"to do what a rule, instruction, or advice says; to obey","zh":"遵循；听从（规则、指示或建议）"},"examples":[{"en":"Follow the instructions on the package.","zh":"请按照包装上的说明操作。"},{"en":"If you follow your doctor’s advice, you may feel better soon.","zh":"如果你听从医生的建议，可能很快会好转。"}]},{"partOfSpeech":"v.","definition":{"en":"to happen after something as a result; to come next in time or order","zh":"（结果）随之发生；接着发生"},"examples":[{"en":"A short silence followed her question.","zh":"她问完后，出现了短暂的沉默。"},{"en":"After the meeting, a report will follow.","zh":"会议之后会有一份报告。"}]},{"partOfSpeech":"v.","definition":{"en":"to understand the meaning or logic of something; to keep track of","zh":"理解；听懂；跟得上（思路或内容）"},"examples":[{"en":"I can’t quite follow what you’re saying.","zh":"我不太能听懂你在说什么。"},{"en":"The movie was confusing, but I could still follow the main story.","zh":"这部电影有点复杂，但我还能跟上主线。"}]},{"partOfSpeech":"v.","definition":{"en":"to come after and support someone/something (online); to subscribe to their updates","zh":"（在社交媒体上）关注；订阅动态"},"examples":[{"en":"I follow her on Instagram for travel tips.","zh":"我在 Instagram 上关注她，获取旅行建议。"},{"en":"Follow our account for more updates.","zh":"关注我们的账号以获取更多更新。"}]}],"synonyms":["go after","come after","obey","stick to","understand","track","subscribe"],"phonetic":"/ˈfɑːloʊ/","extraExplanation":["“enfollow” 不是常见英文单词；你可能想查的是 “follow”。如果你指的是某个平台里的功能词（例如“关注”按钮），也通常用 follow。"]}
{"word":"enfonce","summary":{"en":"*enfonce* is a French verb form meaning “push/drive in; smash in,” and figuratively “sink/plunge into.”","zh":"*enfonce* 是法语动词形式，意思是“推进/钉入；砸开/撞塌”，引申为“陷入/沉入”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(French verb form) from *enfoncer*: to push/drive something in (so it goes deep or becomes embedded), or to smash something inward.","zh":"（法语动词形式）来自 *enfoncer*：把某物用力推进去/钉进去（使其深陷或嵌入），也可指把某物向内砸碎/撞塌。"},"examples":[{"en":"He hammered the nail in deeper. (Fr: Il enfonce le clou plus profondément.)","zh":"他把钉子钉得更深。（法：Il enfonce le clou plus profondément.）"},{"en":"The door was smashed in. (Fr: La porte a été enfoncée.)","zh":"门被砸开了/被撞塌了。（法：La porte a été enfoncée.）"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative, French) to sink into or plunge into something (e.g., mud, darkness, despair).","zh":"（引申义，法语）陷入/沉入某种状态或环境（如泥里、黑暗中、绝望中）。"},"examples":[{"en":"The car sank into the mud. (Fr: La voiture s’enfonce dans la boue.)","zh":"车陷进了泥里。（法：La voiture s’enfonce dans la boue.）"},{"en":"He sank into silence. (Fr: Il s’enfonce dans le silence.)","zh":"他陷入沉默。（法：Il s’enfonce dans le silence.）"}]}],"synonyms":["drive in","push in","ram in","smash in","sink into"],"phonetic":"ɑ̃.fɔ̃ˈseɪ","extraExplanation":["“enfonce”本身不是英语单词，而是法语 *enfoncer* 的变位形式，常见于：\n- 直陈式现在时：il/elle *enfonce*（他/她推进、砸开）\n- 虚拟式现在时：que je/il/elle *enfonce*（愿我/他/她推进）\n常见搭配：*enfoncer un clou*（把钉子钉进去）、*enfoncer une porte*（把门撞开/砸开）、*s’enfoncer dans*（陷入/深入……）。"]}
{"word":"enfonced","summary":{"en":"“Enfonced” is not standard English; it’s usually a misspelling of “enforced,” and only rarely a French-style word meaning “sunken/embedded.”","zh":"“enfonced”不是标准英语：通常是把“enforced”拼错；极少数情况下是受法语影响，表示“凹陷/嵌入”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Most often) a misspelling of “enforced”: made to happen by using authority, rules, or pressure.","zh":"（最常见）“enfonced”通常是把“enforced”拼错：用权力、规定或压力使某事发生/被执行。"},"examples":[{"en":"The rule was strictly enforced by the school.","zh":"学校严格执行了这条规定。"},{"en":"They enforced the contract after he refused to pay.","zh":"他拒绝付款后，他们强制执行了合同。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare; French-influenced) pushed or driven in; sunken in; embedded.","zh":"（很少见；受法语影响）被推进/打入里面的；凹陷的；嵌入的。"},"examples":[{"en":"In the painting, the figure’s eyes look enfonced, giving a tired expression.","zh":"在这幅画里，人物的眼睛看起来有些凹陷，显得疲惫。"},{"en":"The old doorway was enfonced into the stone wall.","zh":"老旧的门洞嵌进了石墙里。"}]}],"synonyms":["enforced","compelled","imposed","embedded","sunken"],"phonetic":"/ɪnˈfɔrst/","extraExplanation":["“enfonced”不是标准英语拼写，读到它时，最值得先检查上下文是否其实在写“enforced”（/ɪnˈfɔrst/）。","如果作者是在模仿法语或使用文学/艺术评论语境，它可能来自法语动词 enfoncer（意为“推进去、使凹陷”），更常见的法语形式是 enfoncé（带重音符号）。"]}
{"word":"enfoncee","summary":{"en":"Enfoncée is a French form meaning “sunken/pushed in,” and figuratively “tucked-away or remote.”","zh":"enfoncée 是法语形式，意思是“凹陷的/被推进去的”，引申也可指“偏僻的、藏得深的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(French; feminine form) sunken or pushed in; driven in (as if pressed inward).","zh":"（法语；阴性形式）凹陷的；被推进去的；被按压进内部的。"},"examples":[{"en":"The door had a panel that looked enfoncée, as if something had struck it.","zh":"门板有一块看起来是凹进去的，好像被什么东西撞过。"},{"en":"After the impact, the metal was enfoncée and hard to straighten.","zh":"撞击之后，金属被压凹了，很难弄平。"}]},{"partOfSpeech":"adj.","definition":{"en":"(French; figurative) tucked-away, deep/remote, hard to reach (often used about a place).","zh":"（法语；引申义）偏僻的；深入的；不易到达的（常形容地点）。"},"examples":[{"en":"They rented a small house in an enfoncée valley, far from the main road.","zh":"他们在一个偏僻的山谷里租了间小房子，远离主路。"},{"en":"The café is enfoncée behind the buildings, so it’s easy to miss.","zh":"那家咖啡馆藏在楼后面，所以很容易错过。"}]}],"synonyms":["sunken","dented","recessed","pushed-in","tucked away","remote"],"phonetic":"/ɑ̃.fɔ̃ˈseɪ/","extraExplanation":["“enfoncée”是法语动词“enfoncer”（推入、压入、撞凹）的过去分词阴性形式；阳性常见为“enfoncé”。在法语里它会随名词的性数变化：enfoncé（阳性单数）、enfoncée（阴性单数）、enfoncés（阳性复数）、enfoncées（阴性复数）。","如果你是在英文语境里看到它，通常出现在描写法式场景、文学翻译或原文引用中；英文更常用的对应词是“sunken / dented / recessed / tucked away”。"]}
{"word":"enforce","summary":{"en":"“Enforce” means to make people obey a rule or law, often with authority; it can also mean to strengthen an idea or message.","zh":"“enforce”主要指用权力或措施确保规则/法律被遵守（执行）；也可指强化某种观点或信息。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make sure a rule, law, or agreement is obeyed; to make it happen in practice.","zh":"（通过权力或措施）确保规则、法律或协议被遵守；执行、实施。"},"examples":[{"en":"Police enforce the law to keep the public safe.","zh":"警察执行法律以保障公众安全。"},{"en":"The school strictly enforces its no-bullying policy.","zh":"学校严格执行其反霸凌政策。"},{"en":"The company will enforce the contract if the terms are broken.","zh":"如果条款被违反，公司将执行合同（追究责任）。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause an idea or feeling to be accepted more strongly; to strengthen or reinforce.","zh":"使某种观点或感受更被接受；加强、强化。"},"examples":[{"en":"Her calm voice enforced the message that everything was under control.","zh":"她平静的声音强化了“一切尽在掌控”的信息。"},{"en":"The results enforce what researchers suspected.","zh":"这些结果加强了研究人员原本的猜测。"}]}],"synonyms":["carry out","implement","uphold","compel","reinforce"],"phonetic":"/ɪnˈfɔrs/","extraExplanation":["“enforce”常与 law（法律）, rule（规则）, policy（政策）, ban（禁令）, contract（合同）, regulation（条例）搭配。语气比“apply/implement（实施）”更强，强调“有权力/有手段让别人遵守”，必要时可包含惩罚或强制措施。","常见结构：enforce + 名词（enforce the law）；enforce + 名词 + on/upon + 人（较正式：enforce discipline upon the team）。","易混：reinforce（加强、巩固）更常用于“加固/强化”本身；enforce 更常用于“执行规定”。不过在较正式语境中，enforce 也可表示“强化某种观点/信息”（见第二义）。"]}
{"word":"enforceability","summary":{"en":"Enforceability means how well a law, rule, or contract can be legally or practically enforced.","zh":"Enforceability 指法律、规则或合同条款在法律上或现实中能否被强制执行、落实的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be made to happen or be obeyed by law or authority (for example, a contract clause that a court will uphold).","zh":"可执行性；可强制执行的程度（指法律或权威机构能否让某条款、协议等生效并被遵守）。"},"examples":[{"en":"The enforceability of the contract depends on whether both sides agreed knowingly.","zh":"合同的可执行性取决于双方是否在知情情况下达成一致。"},{"en":"A lawyer reviewed the non-compete clause to check its enforceability.","zh":"律师审查了竞业限制条款，以确认其可执行性。"}]},{"partOfSpeech":"n.","definition":{"en":"The practical ability to successfully apply and enforce a rule, policy, or requirement in real life (not just in theory).","zh":"可实施性；实际可执行程度（强调现实中是否真的能有效落实、监管和执行）。"},"examples":[{"en":"The new policy sounds strict, but its enforceability is unclear without enough staff.","zh":"新政策听起来很严格，但如果人手不足，其实际可执行性就不明确。"},{"en":"They debated the enforceability of the ban in rural areas.","zh":"他们讨论了在农村地区执行该禁令的可行性与可执行性。"}]}],"synonyms":["executability","enforcement strength","legal enforceability"],"phonetic":"/ɪnˌfɔrsəˈbɪləti/","extraExplanation":["在法律英语里，enforceability 常出现在合同、条款、规定等语境中。常见搭配有：the enforceability of a contract/term/clause；question the enforceability（质疑可执行性）；be enforceable（可执行的） vs. be unenforceable（不可执行的）。","区分两个近义点：validity（有效性/合法性）强调“是否有效、是否合法”；enforceability（可执行性）强调“是否能被法院或执法机制强制落实”。某条款可能“有效”但因操作困难而“不易执行”。"]}
{"word":"enforceable","summary":{"en":"“Enforceable” means legally able to be enforced or made to happen.","zh":"“Enforceable”指在法律上可被强制执行、具有法律效力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be made to happen by law or rules; legally valid so that a court or authority can require people to follow it.","zh":"（法律或规则上）可强制执行的；具有法律效力、可由法院或权力机关要求遵守的。"},"examples":[{"en":"The contract is enforceable because both sides signed it.","zh":"这份合同具有可强制执行性，因为双方都签了字。"},{"en":"Some verbal agreements are enforceable, but it depends on the situation and local law.","zh":"有些口头协议也可能可强制执行，但要看具体情况和当地法律。"}]}],"synonyms":["binding","valid","executable","upholdable"],"phonetic":"/ɛnˈfɔrsəbəl/","extraExplanation":["词根提示：enforce（强制执行）+ -able（能够……的）→ enforceable（能够被强制执行的）。","常见搭配：enforceable contract（可执行合同）、enforceable rule/law（可执行的规则/法律）、legally enforceable（法律上可执行的）。","学习区分：enforceable 强调“法律或权力上能被执行”；practical/feasible 强调“现实中做得到”；effective 强调“有实际效果”。","文化/语境提醒：在英语法律语境中，enforceable 往往暗示“法院可救济/可追责”。例如合同若缺少对价（consideration）或条款过于含糊（too vague），可能被认为 not enforceable。"]}
{"word":"enforceably","summary":{"en":"“Enforceably” means “in a way that is legally enforceable or can be made to happen by authority.”","zh":"“enforceably”表示“以法律上可强制执行/具有可执行性的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be made to happen by law or official authority; in a legally binding, enforceable manner.","zh":"以可由法律或官方权力强制执行的方式；以具有法律约束力、可执行的方式。"},"examples":[{"en":"The agreement is enforceably written, so either side can go to court if it’s broken.","zh":"这份协议写得具有可执行性，所以任何一方违约都可以诉诸法院。"},{"en":"A non-compete clause must be enforceably narrow in time and location.","zh":"竞业禁止条款在时间和地域范围上必须足够合理，才具有可执行性。"},{"en":"The policy was enforceably applied across all departments.","zh":"这项政策在所有部门都以可执行的方式统一落实。"}]}],"synonyms":["legally","validly","authoritatively","bindingly"],"phonetic":"ɛnˈfɔrsəbli","extraExplanation":["“enforceably”多用于法律与合同语境，强调“能不能真的执行到位”。它通常修饰written / drafted / binding / applied 等词，表示条款或规则不仅写在纸上，而且在法律上站得住脚。","词形来源：enforce（执行、强制实施）→ enforceable（可执行的）→ enforceably（可执行地）。日常口语中更常用“legally enforceable / enforceable”。"]}
{"word":"enforced","summary":{"en":"Enforced means a rule is made to happen by authority, or something is forced on someone (not voluntary).","zh":"Enforced 指规则被权威强制执行，或某事被迫发生（非自愿）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of enforce) to make a rule, law, or decision happen by using authority, pressure, or power.","zh":"（enforce 的过去式/过去分词）用权力、压力或手段使规则、法律或决定得以执行。"},"examples":[{"en":"The police enforced the new speed limit starting Monday.","zh":"警方从周一开始执行新的限速规定。"},{"en":"The school enforced its dress code after repeated warnings.","zh":"学校在多次警告后开始严格执行着装规定。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective) made compulsory or obeyed because an authority ensures it; carried out in practice.","zh":"（形容词）因权威机构确保而被强制遵守的；被落实执行的。"},"examples":[{"en":"There is an enforced curfew in the city tonight.","zh":"今晚该市实行强制宵禁。"},{"en":"She took an enforced break from work due to illness.","zh":"她因生病被迫暂停工作。"}]}],"synonyms":["compulsory","mandatory","imposed","forced","strictly applied"],"phonetic":"/ɪnˈfɔrst/","extraExplanation":["“enforced”常用于法律、规定、禁令等语境（如 enforced law/ban/curfew），强调“不是自愿，而是有人负责让它生效”。在“an enforced break/absence”中，则强调“被迫的、非自愿的”，语气较中性，指外部原因导致。"]}
{"word":"enforcedly","summary":{"en":"“Enforcedly” means “forcibly; under compulsion,” but it is uncommon in modern English.","zh":"“enforcedly”意为“强制地、被迫地”，但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is forced or required by rules, power, or authority; not voluntarily","zh":"以强制的方式；被迫地；（因法律、权力或规定）不得不地"},"examples":[{"en":"They were enforcedly removed from the building by the police.","zh":"他们被警察强制带离了大楼。"},{"en":"The plan was enforcedly accepted after the company changed its policy.","zh":"公司改变政策后，这个方案被迫被接受。"}]}],"synonyms":["forcibly","compulsorily","under duress","by force","involuntarily"],"phonetic":"/ɪnˈfɔrstli/","extraExplanation":["“enforcedly”在现代英语中比较少见，很多时候更自然的说法是：forcibly（强行地）、by force（用武力/强制）、compulsorily（强制地，常用于法律/规定语境）或 against one’s will（违背某人意愿）。","常见搭配语感上更偏向：be forcibly removed / be compelled to / be required to，而不是用“enforcedly”去修饰动词。"]}
{"word":"enforcement","summary":{"en":"Enforcement means ensuring rules or laws are obeyed, often through official action.","zh":"Enforcement 指通过官方手段确保法律或规则被遵守，即“执行/执法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of making sure a law, rule, or agreement is obeyed.","zh":"（对法律、规则或协议的）执行；强制遵守。"},"examples":[{"en":"The enforcement of traffic laws helps reduce accidents.","zh":"交通法规的执行有助于减少事故。"},{"en":"Strict enforcement of the school rules started this semester.","zh":"本学期开始严格执行校规。"}]},{"partOfSpeech":"n.","definition":{"en":"Actions taken by authorities (such as police or regulators) to stop illegal behavior or punish it.","zh":"（执法机关或监管机构采取的）执法行动；取缔、查处。"},"examples":[{"en":"Local enforcement focused on shutting down illegal gambling.","zh":"当地执法行动重点是取缔非法赌博。"},{"en":"The company faced enforcement from the environmental agency.","zh":"这家公司遭到环保机构的执法查处。"}]},{"partOfSpeech":"n.","definition":{"en":"The group of people responsible for enforcing laws (often used in the phrase “law enforcement”).","zh":"执法机构；执法人员（常见于“law enforcement”一词组）。"},"examples":[{"en":"She works in law enforcement.","zh":"她在执法部门工作。"}]}],"synonyms":["implementation","execution","law enforcement","policing","crackdown"],"phonetic":"ɪnˈfɔrsmənt","extraExplanation":["常见搭配：enforcement of the law（法律的执行）、enforcement action（执法行动）、enforcement agency（执法/监管机构）。","“Law enforcement”通常指警察和相关执法部门的整体；而“enforcement”单独使用时更偏向“执行/查处”这个过程或行动。","词源提示：en-（使……）+ force（力量、强制）→ enforcement 含有“通过强制让规则被遵守”的意味。"]}
{"word":"enforcements","summary":{"en":"“Enforcements” means actions/measures taken to ensure rules or laws are obeyed (plural of enforcement).","zh":"“enforcements”指为确保规则或法律被遵守而采取的执行/执法措施（enforcement 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Actions taken to make sure a rule, law, or agreement is obeyed (plural of “enforcement”).","zh":"为确保规则、法律或协议被遵守而采取的措施（“enforcement”的复数）。"},"examples":[{"en":"The new safety enforcements started last month, and inspectors now visit factories more often.","zh":"新的安全执法/落实措施从上个月开始，现在检查员更频繁地走访工厂。"},{"en":"Online platforms increased policy enforcements to reduce harmful content.","zh":"网络平台加强了政策执行措施，以减少有害内容。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of applying force or pressure to make someone comply (less common).","zh":"通过武力或强制手段迫使他人服从（较少用）。"},"examples":[{"en":"The report criticized enforcements that intimidated local residents.","zh":"报告批评了那些恐吓当地居民的强制手段。"}]}],"synonyms":["implementation measures","crackdowns","enforcement actions","compliance measures"],"phonetic":"/ɪnˈfɔrsmənts/","extraExplanation":["“enforcement”常见搭配：law enforcement（执法/警方系统）、enforcement action（执法行动/处罚措施）、strict enforcement（严格执行）、enforcement mechanism（执行机制）。","在新闻语境里，enforcements 常指“加强执行的措施/行动”，例如 traffic enforcements（交通执法行动）、border enforcements（边境管控与执法措施）。"]}
{"word":"enforcen","summary":{"en":"Enforce means to make sure rules or laws are obeyed, or to force something to happen.","zh":"Enforce 指“强制执行（确保被遵守）”，也可指“强迫/使某事发生或被接受”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make sure a law, rule, or agreement is obeyed (often by using authority or penalties)","zh":"（通常借助权威或惩罚）强制执行（法律、规则或协议），确保被遵守"},"examples":[{"en":"The police enforce traffic laws to keep roads safe.","zh":"警方执行交通法规以保障道路安全。"},{"en":"The school enforces a strict no-phone policy during class.","zh":"学校严格执行上课期间禁止使用手机的规定。"}]},{"partOfSpeech":"vt.","definition":{"en":"to force someone to do something; to make something happen or be accepted","zh":"强迫某人做某事；使某事发生或被接受"},"examples":[{"en":"The manager enforced the deadline, so everyone worked late.","zh":"经理强行落实截止日期，所以大家都加班了。"},{"en":"They tried to enforce their opinion on others.","zh":"他们试图把自己的观点强加给别人。"}]}],"synonyms":["implement","apply","carry out","impose","compel"],"phonetic":"/ɪnˈfɔrs/","extraExplanation":["你输入的“enforcen”更像是拼写错误，常见正确拼写是 **enforce**。","常见搭配：**enforce the law/rules/regulations**（执行法律/规则/条例）、**strictly enforce**（严格执行）、**enforce a ban**（执行禁令）、**enforce a policy**（执行政策）、**enforce a deadline**（强制落实截止时间）。","语感区别：**enforce** 强调“用权力/手段让它被遵守”；而 **encourage** 更偏“鼓励”，不含强制意味。"]}
{"word":"enforcer","summary":{"en":"An enforcer is someone who makes sure rules or laws are obeyed; in sports, it can mean a tough player who protects teammates.","zh":"enforcer 指确保规则或法律被遵守的人；在体育语境中也可指强硬型球员，负责保护队友。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group who makes sure laws, rules, or agreements are obeyed.","zh":"执法者；执行者（确保法律、规则或协议被遵守的人或团体）。"},"examples":[{"en":"The police are the main enforcers of the law.","zh":"警察是法律的主要执行者（执法者）。"},{"en":"The school hired a new enforcer to stop students from breaking the rules.","zh":"学校雇了一名新的执行人员来制止学生违反规定。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports (especially ice hockey), a player known for being physically tough and protecting teammates, sometimes by fighting.","zh":"（体育，尤指冰球）强硬型球员；“打手/护卫”（以身体对抗保护队友，有时会打架）。"},"examples":[{"en":"The team’s enforcer stepped in when their star player was hit.","zh":"当球队明星球员被撞时，那名强硬型球员上前保护。"},{"en":"He was valued more as an enforcer than as a scorer.","zh":"与其说他以得分见长，不如说更被看作是强硬型球员。"}]}],"synonyms":["lawman","officer","rule keeper","disciplinarian","strong-arm (informal)"],"phonetic":"/ɪnˈfɔrsər/","extraExplanation":["“enforcer”来自动词“enforce（强制执行；实施）”，常见搭配有：law enforcer（执法人员）、rule enforcer（规则执行者）。","在日常语境里，它既可以是中性词（如“政策执行者”），也可能带一点负面或强硬的感觉，尤其在形容用强势手段“让人服从”的人时。"]}
{"word":"enforcers","summary":{"en":"“Enforcers” means people who ensure rules or laws are obeyed; informally it can also mean tough “muscle” who use intimidation to make others comply.","zh":"“Enforcers”指确保规则或法律被遵守的执行者/执法者；非正式语境中也可指用威吓或武力让人服从的“打手”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (or things) that make sure a rule, law, or decision is obeyed; those who enforce.","zh":"执行者；执法者；负责确保规则、法律或决定被遵守的人（或机构）。"},"examples":[{"en":"Traffic enforcers issued tickets to drivers who ran the red light.","zh":"交通执法人员给闯红灯的司机开了罚单。"},{"en":"The school’s rule enforcers reminded students to wear their ID badges.","zh":"学校的纪律执行者提醒学生佩戴学生证。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A person who uses force or intimidation to make others obey, especially in organized crime or tough workplace settings.","zh":"（非正式）打手；“强制执行”的人，常指用武力或威吓让他人服从的人（如黑帮或强硬的职场环境）。"},"examples":[{"en":"In the movie, the gang’s enforcers collected money from shop owners.","zh":"在电影里，帮派的打手向店主收钱。"},{"en":"He was known as the boss’s enforcer—people listened when he arrived.","zh":"他被称为老板的“执行者/打手”——他一到，大家就听话了。"}]}],"synonyms":["law enforcement officers","inspectors","regulators","rule keepers","muscle (informal)","henchmen (informal)"],"phonetic":"/ɪnˈfɔrsərz/","extraExplanation":["“Enforcers”是复数形式；单数是“enforcer”。常见搭配有：law enforcers（执法人员）、rule enforcers（规则执行者）。","语气上：在中性语境里多指合法的“执法/执行”；在犯罪题材或口语里，“enforcer”常带负面色彩，接近“打手”。可通过上下文判断。","词源提示：来自动词 enforce（强制执行、贯彻），-enforcer 表示“做这件事的人/机构”。"]}
{"word":"enforces","summary":{"en":"“Enforces” means makes sure rules or laws are obeyed, using authority.","zh":"“enforces”表示用权力强制执行，确保法律或规定被遵守。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make sure a rule or law is obeyed; to cause something to happen by using authority or power","zh":"（用权力/权威）强制执行；确保（法律、规定）被遵守"},"examples":[{"en":"The police enforce traffic laws to keep roads safe.","zh":"警察执行交通法规，以确保道路安全。"},{"en":"The school enforces a strict no-phone policy in class.","zh":"学校在课堂上严格执行“禁止使用手机”的规定。"},{"en":"The company enforces safety rules in the factory.","zh":"公司在工厂里严格执行安全规定。"}]}],"synonyms":["carry out","implement","apply","uphold","impose"],"phonetic":"/ɪnˈfɔrsɪz/","extraExplanation":["“enforces”是动词“enforce”的第三人称单数（he/she/it enforces）。常见搭配：enforce the law/rules/policy/ban（执行法律/规定/政策/禁令）。","语气通常比较正式，常用于政府、警察、学校、公司等“有权制定并执行规则”的机构。不要把它和“encourage（鼓励）”混淆：enforce强调“必须遵守”。"]}
{"word":"enforcibility","summary":{"en":"Enforceability means the ability of a rule, promise, or contract to be legally or officially enforced.","zh":"Enforceability 指规则、承诺或合同在法律或官方层面“能被执行/强制实施”的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law/business) The quality of being enforceable—able to be made to happen or obeyed by legal or official authority (for example, a contract clause that a court will uphold).","zh":"（法律/商务）可执行性；可强制实施性——指某项规定或条款能够被法律或官方权力强制执行（例如法院会支持的合同条款）。"},"examples":[{"en":"The enforceability of the contract depends on whether both sides gave clear consent.","zh":"合同的可执行性取决于双方是否明确表示同意。"},{"en":"They rewrote the clause to improve its enforceability in court.","zh":"他们重写了该条款，以提高其在法庭上的可执行性。"},{"en":"Noncompete agreements vary in enforceability from state to state.","zh":"竞业禁止协议在不同州的可执行性不同。"}]}],"synonyms":["validity (legal)","legal force","binding nature","effectiveness (in practice)"],"phonetic":"/ɪnˌfɔrsəˈbɪləti/","extraExplanation":["你写的 **enforcibility** 通常被认为是拼写错误或非常少见的变体；标准拼写是 **enforceability**。在法律英语里更常见的是讨论“合同条款/协议”的 enforceability（法院是否会执行）。","构词理解：**enforce**（执行/强制实施）+ **-able**（可……的）→ **enforceable**（可执行的）+ **-ity**（名词后缀）→ **enforceability**（可执行性）。"]}
{"word":"enforcible","summary":{"en":"Enforcible is a less common spelling of enforceable: something that can be legally or practically enforced.","zh":"Enforcible 是 enforceable 的较少见拼写：指某事在法律或实际层面“可被强制执行/可落实”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Variant spelling) Able to be enforced by law, rules, or authority; legally valid and can be made to happen.","zh":"（拼写变体）可被执行的；（在法律或规则上）可强制实施的；具有法律效力、可被强制履行的。"},"examples":[{"en":"The contract is enforceable only if both sides sign it.","zh":"只有双方都签字，这份合同才具有可执行性。"},{"en":"Some rules are hard to enforce, even if they’re enforceable on paper.","zh":"有些规定即使在纸面上“可执行”，实际也很难真正执行。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be carried out effectively in practice (not only in theory).","zh":"（更一般地）在实际中能够被落实、能够真正执行的（不只是理论上）。"},"examples":[{"en":"We need a clear and enforceable policy for late homework.","zh":"我们需要一项清晰、可落实的迟交作业政策。"},{"en":"An enforceable deadline helps keep the project on schedule.","zh":"一个能真正执行的截止日期有助于项目按计划推进。"}]}],"synonyms":["enforceable","binding","valid","executable"],"phonetic":"/ɛnˈfɔrsəbəl/","extraExplanation":["“enforcible”在现代英语中较少见，更多时候写作“enforceable”。在正式写作（合同、法律文件、学术写作）中，建议使用“enforceable”，以避免被认为是拼写错误或不够规范。"]}
{"word":"enforcing","summary":{"en":"“Enforcing” means actively making sure rules or laws are followed (the -ing form of “enforce”), and it can also describe something strict about applying rules.","zh":"“enforcing”表示正在执行/实施并确保他人遵守规则或法律（enforce 的 -ing 形式），也可作形容词表示“严格执行规定的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of enforce) making sure a law, rule, or agreement is obeyed; using authority or power to make people follow it.","zh":"（enforce 的现在分词）执行/实施（法律、规则或协议）；用权力或手段确保他人遵守。"},"examples":[{"en":"The city is enforcing the new parking rules starting next week.","zh":"这座城市将从下周开始执行新的停车规定。"},{"en":"She is enforcing company policy, not making a personal judgment.","zh":"她是在执行公司规定，并不是在做个人评判。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) actively carrying out or applying rules or standards; strict about compliance.","zh":"（形容词）正在严格执行规定的；强调合规、管得严的。"},"examples":[{"en":"There is an enforcing agency responsible for food safety checks.","zh":"有一个负责食品安全检查的执法机构。"},{"en":"An enforcing attitude can feel uncomfortable, but it may improve safety.","zh":"强硬的执行态度可能让人不舒服，但也可能提升安全性。"}]}],"synonyms":["implementing","applying","upholding","carrying out","policing"],"phonetic":"/ɛnˈfɔrsɪŋ/","extraExplanation":["常见搭配：enforcing the law（执法/执行法律）、enforcing rules/regulations（执行规则/法规）、enforcing a ban（执行禁令）、strictly enforcing（严格执行）。","用法提示：英文里更常说“law enforcement（执法）”，以及“enforcement”（名词：执行/实施）。如果想表达“可被执行的”，用 enforceable（如：an enforceable contract 可执行的合同）。"]}
{"word":"enforcingly","summary":{"en":"“Enforcingly” means “in a way that enforces rules or makes people obey,” but it’s rare in modern English; “strictly enforced” is more natural.","zh":"“enforcingly”意为“以强制执行、使人遵守的方式”，但现代英语中较少见，更自然的说法是“strictly enforced（严格执行）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that enforces a rule, law, or requirement; with authority so that people must obey.","zh":"以强制执行（规则/法律/要求）的方式；带有权威地使人必须遵守。"},"examples":[{"en":"The policy was enforcingly applied, and employees had to follow it.","zh":"该政策被强制执行，员工必须遵守。"},{"en":"The school enforcingly banned phones during class.","zh":"学校强制禁止上课时使用手机。"}]}],"synonyms":["strictly","rigorously","authoritatively","forcibly"],"phonetic":"/ɪnˈfɔrsɪŋli/","extraExplanation":["“enforcingly”这个副词在现代英语里非常少见，母语者更常说：“strictly enforced / rigorously enforced / enforce the rule strictly”。比如：The rule is strictly enforced.（这条规则被严格执行。）","注意不要和 “enforceable”（可执行的/可强制实施的）混淆；“enforcingly”强调“执行的方式”，而 “enforceable”强调“能不能被执行”。"]}
{"word":"enforcive","summary":{"en":"“Enforcive” is a rare/nonstandard adjective. In most cases, use “coercive” (forcing compliance) or “enforceable” (able to be enforced).","zh":"“Enforcive”是罕见且不太规范的形容词。多数情况下应改用“coercive（强制性的）”或“enforceable（可执行的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Intended to mean “using force or authority to make people obey; coercive; enforcing.”","zh":"（非标准/罕见用法）常被用来表示“用力量或权威迫使人服从；强制性的；执行性的”。"},"examples":[{"en":"Some people use “enforcive” when they mean “coercive” policies.","zh":"有些人说“enforcive”，其实想表达“coercive（强制性的）”政策。"},{"en":"The contract’s terms aren’t “enforcive”; they need to be enforceable in court.","zh":"合同条款不是“enforcive”就行；它们需要在法庭上“enforceable（可执行的）”。"}]}],"synonyms":["coercive","compulsory","forcible","authoritarian","enforceable"],"phonetic":"/ɪnˈfɔrsɪv/","extraExplanation":["“enforcive”不是常见或规范的英语词，在正式写作、学术写作、法律语境里通常不建议使用。","如果你想表达“强制性的/胁迫性的”，更地道的词是：coercive。","如果你想表达“（法律/规定）可被执行的”，更准确的词是：enforceable（如 enforceable contract 可执行的合同）。","如果你想表达“负责执行的/执法的”，可以用：enforcing（如 enforcing agency 执行机构）或 law-enforcement（执法的/警务的）。"]}
{"word":"enforcively","summary":{"en":"“Enforcively” means “in a forceful/strictly enforcing way,” but it is uncommon; “forcibly,” “coercively,” or “strictly” are more natural in most contexts.","zh":"“enforcively”表示“以强制/强硬执行的方式”，但用法较少；多数语境更自然的是“forcibly / coercively / strictly”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a forceful or coercive way; by using power or physical force to make something happen.","zh":"以强制或武力的方式；用权力或力量迫使某事发生。"},"examples":[{"en":"The crowd was enforcively removed from the area by security.","zh":"人群被保安以强制方式从该区域驱离。"},{"en":"The policy was applied enforcively, with little room for negotiation.","zh":"该政策被强硬执行，几乎没有协商空间。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that strongly enforces a rule or law (often implying strictness).","zh":"以严格执行规章或法律的方式（常带“严厉、强硬”含义）。"},"examples":[{"en":"The new regulations were enforcively implemented across all departments.","zh":"新规在所有部门被强势推行。"},{"en":"Some critics say the rule is enforced enforcively against minor mistakes.","zh":"一些批评者说，这条规定对小错误也被严厉执行。"}]}],"synonyms":["forcibly","coercively","strictly","firmly"],"phonetic":"/ɪnˈfɔrsɪvli/","extraExplanation":["“enforcively”在现代英语中非常少见，很多情况下会用更自然的副词替代，例如：forcibly（用武力地）、coercively（胁迫地）、strictly（严格地）、firmly（坚定/强硬地）。","构词上可理解为 enforce（执行/强制实施）+ -ive + -ly，但在实际写作里更常见的是“enforce + 名词”结构（如 enforce the law）或用“strictly/firmly enforced（被严格执行）”来表达。"]}
{"word":"enforest","summary":{"en":"“Enforest” means to plant trees on land to make it a forest (or for land to become forested).","zh":"“enforest”指在土地上植树造林使其成为森林，或指土地逐渐被森林覆盖。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to plant trees on (land) so that it becomes a forest; to reforest/afforest","zh":"在（土地上）植树造林；使成为森林（造林/再造林）"},"examples":[{"en":"The government plans to enforest abandoned farmland to reduce soil erosion.","zh":"政府计划在废弃农田上植树造林，以减少水土流失。"},{"en":"Local volunteers helped enforest the hillside after the wildfire.","zh":"野火之后，当地志愿者帮助在山坡上重新造林。"}]},{"partOfSpeech":"v.","definition":{"en":"to cover or fill with forest; to become forested","zh":"（使）被森林覆盖；（逐渐）森林化"},"examples":[{"en":"Over decades, the valley slowly enforested as people moved away.","zh":"几十年间，随着人们搬离，这个山谷逐渐森林化。"}]}],"synonyms":["afforest","reforest","plant","wood (rare)"],"phonetic":"/ɛnˈfɔrɪst/","extraExplanation":["“en-”这个前缀常表示“使……处于某种状态”（如: enrich 使富裕、encircle 包围）。enforest 就是“使成为森林”。","在环境与土地管理语境里更常见的近义词是 afforest（在原本非森林地区造林）与 reforest（在曾经有森林、后来被砍伐/烧毁的地方再造林）。enforest 用法相对少见，更多见于较正式或文学/技术写作。"]}
{"word":"enfork","summary":{"en":"Enfork is a rare verb meaning to lift/catch with a fork (tool) or to split/form into a fork.","zh":"Enfork 是一个罕见动词，指用叉状工具叉起/夹住，或指（使）分叉、呈叉状。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To put on or into a fork; to fasten, catch, or lift with a fork-shaped tool.","zh":"（罕见）用叉子叉起/挑起；用叉状工具固定、夹住或搬起。"},"examples":[{"en":"The gardener enforked the compost and spread it across the beds.","zh":"园丁用叉子把堆肥叉起，撒在花坛上。"},{"en":"He tried to enfork the hay onto the wagon with a pitchfork.","zh":"他试着用草叉把干草叉到马车上。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare) To form or become forked; to split into two branches.","zh":"（罕见）使（或变得）呈叉状；分叉成两支。"},"examples":[{"en":"The path enforks near the river and meets again after the bridge.","zh":"小路在河边分叉，过桥后又汇合。"},{"en":"Over time, the tree’s trunk enforked into two main stems.","zh":"随着时间推移，这棵树的树干分叉成两条主干。"}]}],"synonyms":["fork","pitchfork","fork up","branch","split"],"phonetic":"/ɛnˈfɔrk/","extraExplanation":["“enfork”非常少见，多见于较老的英语或仿古/文学化写作中。现代英语通常用更常见的表达：用叉子叉起说“fork (up)”或“pitchfork”；表示“分叉”多用“fork”或“branch (off)”。","词首“en-”有“使……处于某种状态/使成为……”的意思（如“encircle”使成圆、包围；“enrich”使变富/丰富）。因此“enfork”字面上就是“使成叉状/用叉子处理”。"]}
{"word":"enform","summary":{"en":"Enform is a rare verb meaning “to shape or give form to,” and historically could also mean “to train or discipline.”","zh":"Enform 是个罕用动词，意思是“使成形/塑造”，古义也可指“训练/教化”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To give shape or structure to; to form or mold something into a particular form.","zh":"（罕用）使成形；塑造；使形成某种结构或形式。"},"examples":[{"en":"The artist enformed the clay into a small bowl.","zh":"艺术家把黏土塑造成一个小碗。"},{"en":"Good habits can enform a child’s character over time.","zh":"良好的习惯会随着时间塑造孩子的品格。"}]},{"partOfSpeech":"vt.","definition":{"en":"(archaic) To train, discipline, or instruct by shaping someone’s behavior or mind.","zh":"（古义）训练；约束；教导（强调“塑造”人的行为或心智）。"},"examples":[{"en":"The school sought to enform its students with patience and respect.","zh":"这所学校希望以耐心与尊重来教化学生。"}]}],"synonyms":["shape","form","mold","fashion","structure"],"phonetic":"/ɛnˈfɔrm/","extraExplanation":["“enform”在现代英语中非常少见，多数情况下人们会用更常见的“form / shape / mold”。","注意不要和“inform /ɪnˈfɔrm/（通知；告知）”混淆：两者拼写相近，但意义不同。","词源上可理解为前缀“en-（使……）”+“form（形状/形式）”，强调“使之成形、使之具有某种形式”。"]}
{"word":"enfort","summary":{"en":"“Enfort” isn’t standard English; it’s usually a misspelling of “effort” or “enforce.”","zh":"“enfort”不是标准英语；通常是把“effort”或“enforce”拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “effort” or “enforce,” or a non-English form (e.g., French).","zh":"不是标准英语单词；最常见是把“effort（努力）”或“enforce（执行/强制实施）”拼错，或来自其他语言（如法语）。"},"examples":[{"en":"I couldn’t find “enfort” in an English dictionary—did you mean “effort”?","zh":"我在英语词典里找不到“enfort”——你是不是想写“effort（努力）”？"},{"en":"If you mean “to make a rule happen,” the word is “enforce,” not “enfort.”","zh":"如果你想表达“让规则生效/执行”，应该用“enforce”，不是“enfort”。"}]}],"synonyms":["effort","enforce"],"phonetic":"ɛnˈfɔrt","extraExplanation":["“enfort”很可能是拼写错误：\n- effort（名词）：努力；常见搭配：make an effort（努力）、put effort into（在……上投入努力）\n- enforce（动词）：执行（法律/规则）；常见搭配：enforce the law/rules（执法/执行规则）\n\n如果你是在看法语或双语材料，“en fort”在法语里可表示“强/有力”的意思，但这不是英语用法。"]}
{"word":"enforth","summary":{"en":"“Enforth” is an archaic adverb meaning “forward/onward” or “from then on.”","zh":"“enforth”是古体副词，表示“向前/继续”或“从那时起（继续）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic/literary) Forward; onward; from that point on.","zh":"（古体/文学用语）向前；继续向前；从那时起（继续）。"},"examples":[{"en":"He rode enforth into the dark forest without looking back.","zh":"他继续向前骑入那片黑暗的森林，头也不回。"},{"en":"Enforth, she spoke more carefully in public.","zh":"从那时起，她在公开场合说话更谨慎。"}]}],"synonyms":["forth","onward","forward","henceforth","from then on"],"phonetic":"/ɛnˈfɔrθ/","extraExplanation":["“enforth”多见于中古英语/早期英语文本，属于较古旧的写法，现代英语里通常用“forth / onward / henceforth / from then on”等表达。","在一些古典文学或仿古文风的作品里可能会刻意使用“enforth”来营造古风；日常写作不建议用。"]}
{"word":"enfortune","summary":{"en":"A rare verb meaning “to make fortunate; to bring good luck to.”","zh":"一个罕见动词，意思是“使走运；带来好运”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To bring good luck or success to someone or something; to make fortunate.","zh":"（罕见）使（某人/某事）走运；使更幸运、顺利。"},"examples":[{"en":"Many people carry a charm believing it can enfortune their journey.","zh":"很多人带着护身符，相信它能让旅途更顺利。"},{"en":"She hoped the new year would enfortune her family with health and peace.","zh":"她希望新的一年能让家人健康平安、好运相伴。"}]}],"synonyms":["bless","bring good luck to","make fortunate","favor","endow (with good fortune)"],"phonetic":"/ɛnˈfɔrtʃən/","extraExplanation":["“enfortune”非常少见，更多见于文学化或仿古的语气；现代英语里通常用“bring good luck to / bless / make someone fortunate”。","构词上可理解为前缀“en-”（使……处于某种状态）+ “fortune”（命运/好运），意思直观但并非高频常用词。"]}
{"word":"enfoul","summary":{"en":"Enfoul means to make something dirty or polluted, or (in nautical use) to tangle/obstruct equipment like ropes or propellers.","zh":"Enfoul 表示“弄脏、污染”，也可（航海用语）指“使锚、绳索、螺旋桨等缠住或受阻”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something dirty or polluted; to soil or contaminate","zh":"弄脏；污染；使受污"},"examples":[{"en":"The oil spill enfouled the shoreline and harmed wildlife.","zh":"漏油污染了海岸线，并伤害了野生动物。"},{"en":"Mud from the construction site enfouled the river after the storm.","zh":"暴风雨后，工地的泥水污染了河流。"}]},{"partOfSpeech":"vt.","definition":{"en":"(especially nautical) to tangle or obstruct equipment (like an anchor or rope), often by catching on something","zh":"（尤指航海）使（锚、绳索等）缠住；使受阻"},"examples":[{"en":"Seaweed can enfoul the propeller and slow the boat.","zh":"海藻会缠住螺旋桨，让船变慢。"},{"en":"The anchor line became enfouled on rocks near the bottom.","zh":"锚绳在海底附近的岩石上缠住了。"}]}],"synonyms":["pollute","dirty","soil","contaminate","foul","tangle"],"phonetic":"/ɛnˈfaʊl/","extraExplanation":["“enfoul”由前缀 en-（使……处于某种状态）+ foul（肮脏的/弄脏）构成，意思就是“使变得肮脏/受污染”。","这个词在日常口语里不算常见，更常见的替代说法有 pollute（污染）、dirty（弄脏）、contaminate（污染/使受污染）。但在航海、海事或较正式的环境描写中仍会用到。"]}
{"word":"enfoulder","summary":{"en":"“Enfoulder” is a rare word meaning a wrapper/surrounder, or (poetically) to enfold.","zh":"“enfoulder”很罕见，可指“包裹者/包覆物”，或（诗意地）表示“包裹、环绕”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) Someone or something that enfolds—wraps, covers, or surrounds closely.","zh":"（罕见）包裹者；包覆物：指把某物紧紧包住、覆盖或环绕的人或事物。"},"examples":[{"en":"In the poem, the fog is an enfoulder, hiding the harbor lights.","zh":"在这首诗里，雾成了“包裹者”，把港口的灯光遮住了。"},{"en":"She used the shawl as an enfoulder against the cold wind.","zh":"她把披肩当作“包覆物”，用来抵挡寒风。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare/poetic) To enfold; to wrap or surround closely.","zh":"（罕见/诗意）包裹；环绕：把某物紧紧包住或围住。"},"examples":[{"en":"Night enfouldered the hills in deep shadow.","zh":"夜色把群山包裹在浓重的阴影里。"},{"en":"A soft silence enfoulders the room after the music ends.","zh":"音乐结束后，一种柔和的寂静笼罩着房间。"}]}],"synonyms":["enfold","envelop","wrap","surround","cloak"],"phonetic":"/ɪnˈfoʊldər/","extraExplanation":["“enfoulder”非常少见，多数情况下人们会用更常见的动词 **enfold**（包裹、拥抱、环绕）或名词短语如 **something that envelops**（包覆物）。","拼写上也常与 **enfolder**（包裹者，较少见）或 **envelop**（包封）混淆。如果你是在阅读文学作品里见到它，通常带有诗意、画面感，用来强调“被温柔或强烈地包围”的感觉。"]}
{"word":"enfrai","summary":{"en":"“Enfrai” isn’t a standard English word; it’s likely a misspelling of “enfray,” meaning “to frighten/alarm” (literary/archaic).","zh":"“enfrai”不是标准英语词；很可能是“enfray”的拼写误差，意思是“使惊恐/使害怕”（偏文学/古老用法）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely intended: “enfray”) to frighten or alarm; to put someone into fear (old-fashioned/literary).","zh":"（多半是想写：enfray）使惊恐；使害怕（较古老/文学用法）。"},"examples":[{"en":"The sudden cry enfrayed the children in the dark hallway.","zh":"突如其来的喊叫声把走廊里的孩子们吓坏了。"},{"en":"News of the storm enfrayed the villagers, so they stayed indoors.","zh":"风暴的消息让村民们心生恐惧，于是他们都待在屋里。"}]}],"synonyms":["frighten","scare","alarm","terrify"],"phonetic":"/ɛnˈfreɪ/","extraExplanation":["“enfrai”不是常见英语单词，通常会被认为是拼写错误；最接近的英语词是较罕见的古词“enfray”。","“enfray”属于偏文学/古风用词，现代英语里更常用：frighten, scare, alarm。","注意不要与常见词“fray”（磨损；争吵）混淆；两者拼写相近但含义不同。"]}
{"word":"enframe","summary":{"en":"enframe = to frame something physically or to frame/present an idea in a certain way (more literary/formal than “frame”).","zh":"enframe = 给某物装框/围住；或（比喻）以某种方式框定并呈现观点（比 frame 更偏文学/正式）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To put something in a frame; to surround or border something like a frame.","zh":"把某物装进框里；像画框一样把某物围住、衬托出来。"},"examples":[{"en":"They enframed the painting in a simple wooden frame.","zh":"他们用一个简单的木框把这幅画装裱起来。"},{"en":"Tall trees enframe the view of the lake.","zh":"高大的树木把湖景衬托得像被框住一样。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To present or structure an idea, story, or argument in a particular way; to frame.","zh":"（比喻）以某种方式呈现或组织观点、故事或论证；给……定调/设定框架。"},"examples":[{"en":"The journalist enframed the event as a turning point in local history.","zh":"那位记者把这次事件定调为当地历史的转折点。"},{"en":"Try to enframe your answer with one clear main idea and two supporting reasons.","zh":"试着用一个明确的中心观点和两个支撑理由来组织你的回答。"}]}],"synonyms":["frame","encircle","border","surround","enclose","contextualize"],"phonetic":"/ɛnˈfreɪm/","extraExplanation":["“enframe”较偏文学/正式用语，日常英语里更常用“frame”。在写作中用“enframe”会显得更有画面感（强调“围住、衬托”的效果）。","词形上：en- 常有“使进入……状态/使具备……”的意思（如 encircle, enrich），因此 enframe 可理解为“使成为（被）框住的样子”。"]}
{"word":"enframed","summary":{"en":"“Enframed” means “framed” or “surrounded like a frame,” often used in descriptive writing.","zh":"“enframed”表示“被框住/被衬托”，常用于描写性或文学化语境，相当于“framed”“surrounded like a frame”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Set in a frame; surrounded or bordered as if by a frame.","zh":"置于框中；像被相框一样包围或衬托。"},"examples":[{"en":"Her face was enframed by dark curls in the portrait.","zh":"在那幅肖像里，她的脸被深色卷发衬托着。"},{"en":"The mountains were enframed by the window, like a painting.","zh":"群山被窗框框住，像一幅画。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put (something) in a frame; to surround or border.","zh":"把……装入框中；围住、镶边。"},"examples":[{"en":"They enframed the certificate before hanging it on the wall.","zh":"他们把证书装裱好后挂在墙上。"},{"en":"Tall trees enframed the path leading to the house.","zh":"高大的树木把通往房子的路夹在中间，形成拱形般的边框效果。"}]}],"synonyms":["framed","surrounded","bordered","encircled"],"phonetic":"/ɪnˈfreɪmd/","extraExplanation":["“enframed”常见于较文学化或描写性的语境，强调“像画面一样被框住/被衬托”的视觉效果。日常英语里更常用“framed”“set in a frame”“surrounded by”。"]}
{"word":"enframement","summary":{"en":"Enframement means the act of framing something, or the way an image/scene is framed or composed.","zh":"Enframement 指“装框/框住”的行为，或（在艺术、摄影、电影中）画面如何被取景与构图。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of putting something into a frame; the way something is framed or composed (especially in art, photography, or film).","zh":"装框；框住（某物）的过程；（尤指艺术、摄影、电影中的）取景/构图方式。"},"examples":[{"en":"The painting’s enframement is simple, so your attention goes straight to the face.","zh":"这幅画的装框很朴素，所以你的注意力会直接落在人物的脸上。"},{"en":"In the opening scene, the director uses tight enframement to make the room feel crowded.","zh":"在开场镜头里，导演用紧凑的取景让房间显得拥挤。"}]}],"synonyms":["framing","composition","frame","encasement"],"phonetic":"/ɛnˈfreɪmmənt/","extraExplanation":["“enframement”在现代英语中比较少见，更常见的词是“framing”（构图/取景/框架）或“the framing of …”。在艺术与影视语境里，它强调“画面如何被框起来”，也就是观众被引导去看什么、忽略什么。","不要与哲学语境中的“enframing”（常与海德格尔相关）混淆：那通常指一种把世界“框定”为资源的思维方式；而“enframement”更偏向具体的视觉呈现或装框。"]}
{"word":"enframes","summary":{"en":"“Enframe” means to put something in a frame or to present it within a particular context.","zh":"“enframe”表示给……装框/围住，也可指把某事置于特定语境中来呈现或界定。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put into a frame; to surround or enclose as if with a frame","zh":"给……装框；（像画框一样）围住、框住"},"examples":[{"en":"She enframed the photo in a simple wooden frame.","zh":"她把那张照片装进了一个简洁的木质相框里。"},{"en":"Tall trees enframe the entrance to the garden.","zh":"高大的树木像边框一样围住了花园入口。"}]},{"partOfSpeech":"vt.","definition":{"en":"to present, shape, or set something in a particular context (often in writing, art, or discussion)","zh":"（常用于写作、艺术或讨论中）把……置于某种语境中来呈现；框定、界定"},"examples":[{"en":"The article enframes the problem as a public health issue.","zh":"这篇文章把这个问题置于公共健康的语境中来讨论。"},{"en":"The director enframes the story with scenes from the present day.","zh":"导演用当下的场景为故事“设框”，让叙事更有层次。"}]}],"synonyms":["frame","enclose","surround","encase","contextualize"],"phonetic":"/ɛnˈfreɪm/","extraExplanation":["“enframes”是动词“enframe”的第三人称单数形式（he/she/it enframes）。这个词在日常口语中不算常见，更常见的表达是“frame”（如：frame a picture / frame an argument）。"]}
{"word":"enframing","summary":{"en":"Enframing usually means a “framing” way of seeing—often, in philosophy, a technological mindset that treats the world as resources to be managed.","zh":"Enframing 通常指一种“框定式”的看法——在哲学里尤其指技术化的思维，把世界当作可被管理与利用的资源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy) A way of thinking or revealing that organizes the world as something to be ordered, managed, and used—especially in discussions of technology (often from Martin Heidegger’s idea of *Gestell*).","zh":"（哲学）一种“揭示/理解世界”的方式，把世界组织成可被安排、管理和利用的对象——常见于对技术的讨论（多源自海德格尔的 *Gestell* 概念）。"},"examples":[{"en":"In Heidegger’s view, modern technology encourages an enframing that treats nature as a resource.","zh":"在海德格尔看来，现代技术会促成一种“enframing”，把自然当作资源。"},{"en":"The essay warns that data-driven decision-making can become an enframing of human life.","zh":"这篇文章警告说，数据驱动的决策可能会把人的生活“enframing”化。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of putting something into a frame or setting a boundary around how something is seen or discussed.","zh":"将事物“框定/定框”的行为或过程；给某个问题设定观看或讨论的边界与角度。"},"examples":[{"en":"The reporter’s enframing of the event shaped how readers understood it.","zh":"记者对事件的“定框”影响了读者的理解。"},{"en":"Try a different enframing of the question to find a clearer answer.","zh":"试着换一种方式来“定框”这个问题，可能更容易得到清晰答案。"}]}],"synonyms":["framing","conceptual framework","mindset","perspective","technological ordering"],"phonetic":"ɛnˈfreɪmɪŋ","extraExplanation":["“Enframing”在日常英语里不算高频词；它最常出现在哲学与科技批评语境中，用来翻译/解释海德格尔《技术的问题》中“Gestell（座架/框架化）”的思想。其核心不是“外面的相框”，而是指一种把万物理解为“可计算、可调度、可利用”的思维框架。","在学术写作中，你也会看到它与“framing（框架/话语建构）”并用：framing 更通用、更偏传播学/心理学；enframing 更偏海德格尔传统，带有对现代技术理性（把世界变成资源库）的批判意味。"]}
{"word":"enfranch","summary":{"en":"Enfranchise means to give someone the legal right to vote or full citizenship rights; more broadly, it can mean to empower people by removing restrictions.","zh":"Enfranchise指赋予某人投票权或完整公民权；引申也可指通过解除限制来赋权、增强自主权。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone the legal right to vote (or full rights of citizenship)","zh":"赋予（某人）投票权；使获得完整公民权"},"examples":[{"en":"The new law enfranchised millions of young voters.","zh":"这项新法律赋予了数百万年轻人投票权。"},{"en":"Many activists fought to enfranchise women in the early 20th century.","zh":"许多活动人士在20世纪初为争取女性选举权而奋斗。"}]},{"partOfSpeech":"vt.","definition":{"en":"to free someone from limits or control; to empower","zh":"使摆脱限制；赋权；使获得更大自主权"},"examples":[{"en":"Education can enfranchise people by giving them more choices.","zh":"教育能通过提供更多选择来赋权于人们。"},{"en":"The program aims to enfranchise local communities to manage their own resources.","zh":"该项目旨在赋权当地社区，让他们管理自己的资源。"}]}],"synonyms":["give the vote to","grant voting rights to","empower","liberate"],"phonetic":"/ɛnˈfrænˌtʃaɪz/","extraExplanation":["“enfranchise”最常见的语境是政治与公民权，尤其与“选举权（the franchise）”相关；因此常见搭配有：enfranchise voters / enfranchise women / enfranchise a group。","词根上可理解为“把某人纳入享有franchise（公民权/特权）的范围”。在英美历史中常与扩大选举权的社会运动一起出现（如妇女参政权、民权运动等）。"]}
{"word":"enfranchisable","summary":{"en":"Enfranchisable means “able to be given voting rights or full citizenship rights,” mainly in legal or political writing.","zh":"enfranchisable 指“可被赋予选举权或完整公民权”的，主要用于法律或政治语境的正式表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be given the right to vote or the full rights of citizenship (especially by law).","zh":"（尤指依法）可被赋予选举权或完整公民权的；可获得公民资格/权利的。"},"examples":[{"en":"The bill aimed to expand the number of enfranchisable residents in the territory.","zh":"这项法案旨在扩大该地区有资格获得选举权的居民人数。"},{"en":"Legal experts debated which groups were enfranchisable under the new constitution.","zh":"法律专家就哪些群体在新宪法下可被赋予选举权展开了讨论。"}]}],"synonyms":["eligible to vote","eligible for suffrage","qualified (to vote)","able to be enfranchised"],"phonetic":"/ɪnˈfræn.tʃaɪ.zə.bəl/","extraExplanation":["“enfranchisable”来自动词 enfranchise（赋予……选举权/公民权）+ 形容词后缀 -able（“能够……的”）。常见于法律、宪政、选举制度与公民权利讨论中。","在历史语境中，它常与“扩大选举权”（例如妇女参政权、少数族裔投票权、殖民地或属地居民的政治权利）等议题相关。","日常口语更常说 “eligible to vote”（有投票资格）或 “can be enfranchised”（可以被赋权）；“enfranchisable”更偏正式、书面。"]}
{"word":"enfranchise","summary":{"en":"Enfranchise means to give someone the legal right to vote, and more generally to give a person or group more freedom and power.","zh":"Enfranchise 指赋予某人投票权（最常用），也可引申为赋予某人或某群体更多自由与权力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone the legal right to vote; to give full political rights to a person or group","zh":"赋予（某人或某群体）投票权；给予完整的政治权利（公民权）"},"examples":[{"en":"The new law enfranchised women and allowed them to vote.","zh":"新法律赋予女性选举权，让她们可以投票。"},{"en":"Many activists worked to enfranchise people who had been excluded from elections.","zh":"许多活动人士努力让被排除在选举之外的人获得投票权。"}]},{"partOfSpeech":"vt.","definition":{"en":"(broader) to free someone from limits or control; to give more freedom or power","zh":"（引申）使摆脱限制或控制；赋予更多自由或权力"},"examples":[{"en":"Education can enfranchise young people by giving them more choices in life.","zh":"教育可以让年轻人获得更多人生选择，从而更有自主权。"}]}],"synonyms":["grant the right to vote","give voting rights","empower","liberate"],"phonetic":"/ɛnˈfræntʃaɪz/","extraExplanation":["词源：en-（使……）+ franchise（特权/选举权）。franchise 在现代英语里常见于“特许经营”（比如快餐连锁），但它的较早含义之一就是“投票权、政治特权”，所以 enfranchise 最核心的意思是“赋予投票权”。","常见搭配：enfranchise voters / enfranchise women / enfranchise minorities（赋予选民/女性/少数群体投票权）。名词形式是 enfranchisement（获得/赋予选举权）。","语体提示：在新闻、历史、政治学语境中很常见；日常口语里更常说 give (someone) the right to vote。"]}
{"word":"enfranchised","summary":{"en":"Enfranchised means having been given the right to vote, or more broadly, being empowered to participate and have a voice.","zh":"Enfranchised 指“被赋予选举权”，也可泛指“被赋权、能参与并拥有发言权”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Given the legal right to vote (or to take part fully in civic life).","zh":"被赋予选举权（或更广义地，被赋予充分公民参与权）。"},"examples":[{"en":"Women became fully enfranchised in the United States with the 19th Amendment in 1920.","zh":"美国女性在1920年通过《第十九条修正案》后获得了完整的选举权。"},{"en":"The campaign focused on getting young people enfranchised and registered to vote.","zh":"这场运动重点在于让年轻人获得投票资格并完成选民登记。"}]},{"partOfSpeech":"adj.","definition":{"en":"Freed from a restriction or control; given more power or independence.","zh":"摆脱限制或控制的；获得更多权力或自主权的。"},"examples":[{"en":"After the policy change, local teams felt more enfranchised to make decisions quickly.","zh":"政策改变后，各地团队觉得自己更有权快速做决定。"},{"en":"Good managers help employees feel enfranchised rather than ignored.","zh":"好的管理者会让员工感到被赋权，而不是被忽视。"}]}],"synonyms":["empowered","eligible to vote","given the vote","included","authorized"],"phonetic":"/ɛnˈfræn.tʃaɪzd/","extraExplanation":["词源提示：enfranchise 来自法语/中古法语词根，原意与“给予自由（franchise）”有关，所以 enfranchised 不仅常指“获得投票权”，也可引申为“被赋权、获得参与和决定的机会”。","常见搭配：be enfranchised（获得选举权）；enfranchised voters（有投票资格的选民）；feel enfranchised（感到被赋权/被重视）。","文化语境：在历史与政治文本中，enfranchised 常与 disenfranchised（被剥夺选举权的）成对出现，用来讨论不同群体在公民权利上的不平等。"]}
{"word":"enfranchisement","summary":{"en":"Enfranchisement means giving people the right to vote, and more broadly giving full rights or participation in society.","zh":"enfranchisement 指赋予选举权；也可泛指赋予完整权利、让人获得充分社会/政治参与。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving someone the right to vote (or the right to take part in political decision-making)","zh":"赋予（某人）选举权；扩大政治参与权"},"examples":[{"en":"Women’s enfranchisement in the United States was achieved nationally in 1920.","zh":"美国女性的选举权在1920年在全国范围内实现。"},{"en":"The reform aimed at enfranchisement of groups that had been excluded from voting.","zh":"这项改革旨在让此前被排除在投票之外的群体获得选举权。"}]},{"partOfSpeech":"n.","definition":{"en":"the fact of being freed from a limit or control; being given full rights or membership in a society or system","zh":"（更广义）获得完整权利/资格；从限制或控制中解放"},"examples":[{"en":"Access to education can support social enfranchisement and opportunity.","zh":"受教育机会能够促进社会层面的赋权与机会。"},{"en":"The policy was presented as economic enfranchisement for small business owners.","zh":"该政策被描述为对小企业主的经济赋权。"}]}],"synonyms":["suffrage","empowerment","political inclusion","granting of voting rights"],"phonetic":"/ɪnˈfræn.tʃaɪz.mənt/","extraExplanation":["词源：en-（使……）+ franchise（特权、权利，尤其指“选举权”）。franchise 源自法语，原意与“自由/权利”相关。","常见搭配：political enfranchisement（政治赋权/选举权）、women’s enfranchisement（女性选举权）、mass enfranchisement（大规模赋权）、enfranchisement of voters（赋予选民权利）。","语境提示：在新闻与学术写作里，enfranchisement 不仅指“给投票权”，也常被引申为“让某群体获得公平参与社会、经济资源的机会”（如 economic/social enfranchisement）。","相关词：disenfranchisement（剥夺选举权/使失去权利）；enfranchise（动词：赋予选举权/赋权）。"]}
{"word":"enfranchisements","summary":{"en":"“Enfranchisements” is the plural of “enfranchisement,” meaning acts of granting voting rights or full civil rights to people.","zh":"“enfranchisements”是“enfranchisement”的复数，指多次赋予人们选举权或完整公民权/自由的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of giving someone the right to vote (or the state of being given that right).","zh":"赋予（某人）选举权；获得选举权的状态。"},"examples":[{"en":"Women’s enfranchisement expanded democracy in many countries.","zh":"妇女获得选举权在许多国家推动了民主的发展。"},{"en":"The movement fought for the enfranchisement of previously excluded groups.","zh":"这场运动为过去被排除在外的群体争取选举权。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of giving someone full civil rights or freedom; making someone a full member of a community.","zh":"赋予完全公民权或自由；使某人成为社会/群体的完整成员。"},"examples":[{"en":"The policy aimed at the enfranchisement of former prisoners after release.","zh":"该政策旨在帮助刑满释放人员重新获得完整公民权。"},{"en":"Education can support the enfranchisement of marginalized communities.","zh":"教育可以促进边缘群体的赋权与融入。"}]}],"synonyms":["granting voting rights","suffrage","empowerment","civil rights expansion","emancipation"],"phonetic":"/ɪnˈfræn.tʃaɪz.mənts/","extraExplanation":["“enfranchisement”来自“franchise”（特权、选举权），前缀“en-”有“使……获得”的意思，因此整体常与投票权、政治权利扩展有关。","历史语境中常见于“universal enfranchisement（普选权）”“women’s enfranchisement（妇女参政权/选举权）”“Black enfranchisement（黑人选举权）”。在美国语境里也会涉及重罪犯投票权恢复（felon enfranchisement）等议题。","词形提示：enfranchisements 是复数，用于谈论不同地区/时期的多次“赋权/授予选举权”的事件或措施。"]}
{"word":"enfranchiser","summary":{"en":"An enfranchiser is someone (or an organization) that grants rights—especially voting rights—or, in business, grants franchise rights.","zh":"enfranchiser 指赋予他人权利（尤指选举权）的人或机构；在商业中也指授予特许经营权的品牌方/总部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or organization that grants the right to vote (enfranchises) or gives someone the rights of citizenship","zh":"赋予（他人）选举权的人或机构；授予公民权利的人或机构"},"examples":[{"en":"The reformers praised the government as an enfranchiser after it expanded voting rights.","zh":"改革者称赞政府是“赋权者”，因为它扩大了选举权。"},{"en":"In history classes, students discussed which leaders acted as enfranchisers and which limited rights.","zh":"在历史课上，学生讨论哪些领导人是“赋权者”，哪些限制了权利。"}]},{"partOfSpeech":"n.","definition":{"en":"(business) a company that grants a franchise to others, allowing them to sell its products or use its brand","zh":"（商业）特许经营权授予方；总部/品牌方（授权他人使用品牌并经营）"},"examples":[{"en":"The enfranchiser provided training and marketing support to new franchise owners.","zh":"特许经营权授予方为新的加盟商提供培训和营销支持。"},{"en":"Before signing, she compared what each enfranchiser required in fees and rules.","zh":"签约前，她比较了不同品牌方对费用和规定的要求。"}]}],"synonyms":["grantor","rights-giver","empowerer","franchisor"],"phonetic":"/ɛnˈfræn.tʃaɪ.zɚ/","extraExplanation":["“enfranchiser”来自动词“enfranchise”（赋予权利/选举权；或授予特许经营权）+ 表示“……的人/物”的后缀“-er”。","在政治语境中更常见的相关词是“enfranchisement”（赋权/获得选举权）与“disenfranchise”（剥夺选举权）。","在商业语境中，“enfranchiser”与更常用的“franchisor”（特许经营权授予方）意义接近；实际合同与法律文件里通常用“franchisor”。"]}
{"word":"enfranchises","summary":{"en":"“Enfranchises” means “gives (someone) the right to vote” or more broadly “empowers (someone).”","zh":"“enfranchises”意为“赋予（某人）投票权”，也可引申为“赋权/让（某人）更有话语权”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone the legal right to vote (or full political rights)","zh":"赋予（某人）投票权；给予完整的公民/政治权利"},"examples":[{"en":"The new law enfranchised millions of citizens for the first time.","zh":"新法律首次赋予了数百万公民投票权。"},{"en":"Many activists fought for decades to enfranchise women and marginalized groups.","zh":"许多活动家为争取妇女和边缘群体的选举权奋斗了几十年。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give someone more power, freedom, or a stronger voice in decisions (broader, non-election sense)","zh":"赋权；让（某人）在决策中更有力量/更有发言权（引申义，非仅指选举）"},"examples":[{"en":"The program aims to enfranchise young people by involving them in community planning.","zh":"该项目旨在通过让年轻人参与社区规划来为他们赋权。"},{"en":"Technology can enfranchise small businesses by helping them reach new customers.","zh":"科技可以通过帮助小企业触达新客户来为它们赋权。"}]}],"synonyms":["grants the vote to","gives suffrage to","empowers","gives rights to"],"phonetic":"/ɪnˈfræn.tʃaɪ.zɪz/","extraExplanation":["“enfranchise”常见于政治与历史语境，尤其是“扩大选举权”（例如女性参政权、民权运动等）。","词形提示：enfranchise（原形）→ enfranchises（第三人称单数/现在时）→ enfranchised（过去式/过去分词）→ enfranchising（现在分词）。","反义词常用“disenfranchise”（剥夺选举权）。"]}
{"word":"enfranchising","summary":{"en":"Enfranchising means giving people legal rights—especially the right to vote—so they can fully participate in society.","zh":"Enfranchising 指赋予人们法律权利（尤指投票权），使其能更充分地参与社会。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"giving someone a legal right or power (especially the right to vote); bringing people into full citizenship or participation","zh":"赋予某人法律权利或权力（尤指投票权）；使人获得完整公民权或更充分的参与"},"examples":[{"en":"The new law focuses on enfranchising young voters by making registration easier.","zh":"新法律重点在于通过简化登记程序来赋予年轻选民投票权。"},{"en":"Activists worked for decades on enfranchising marginalized communities.","zh":"活动人士为让边缘群体获得完整权利而奋斗了几十年。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of granting such rights (used as a noun in some contexts)","zh":"授予此类权利的行为或过程（在某些语境中可作名词用）"},"examples":[{"en":"Enfranchising was a gradual process, shaped by protests and court decisions.","zh":"赋权（授予投票权）是一个渐进的过程，受到抗议与法院判决的影响。"}]}],"synonyms":["grant voting rights","empower","give rights to","extend the franchise to"],"phonetic":"/ɛnˈfræn.tʃaɪ.zɪŋ/","extraExplanation":["“enfranchising”来自动词“enfranchise”。词根与“franchise（特许权/加盟权）”相关，核心概念是“给人某种正式的权利或资格”。在美国历史语境中常与投票权扩展有关（如废除财产门槛、女性选举权、民权运动等）。","常见搭配：enfranchise voters（赋予选民投票权）、enfranchise a group/community（让某群体获得权利）、the enfranchisement of…（……的赋权/获得选举权）。","近义词（语境不同略有差别）：grant voting rights（授予投票权）、empower（赋权/赋能，范围更广）。反义词常见：disenfranchise（剥夺投票权/权利）。"]}
{"word":"enfree","summary":{"en":"“enfree” means “to set free; to liberate,” but it is rare in modern English.","zh":"“enfree”意为“使自由、解放”，但在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone or something; to release from control, limits, or bondage","zh":"使自由；解放；使摆脱控制、限制或束缚"},"examples":[{"en":"New laws were introduced to enfree enslaved people.","zh":"新的法律被引入来解放被奴役的人。"},{"en":"She hoped education would enfree her from fear and ignorance.","zh":"她希望教育能让自己摆脱恐惧与无知。"}]}],"synonyms":["free","set free","liberate","release","emancipate"],"phonetic":"/ɛnˈfri/","extraExplanation":["“enfree”在现代英语中非常少见，常见的替代词是“free”“liberate”“set free”。在较早或较文学化的语境里，你可能会看到“en-（使……）+ free”的构词方式，用来强调“使进入某种状态（自由）”。如果你是在现代写作中使用，通常建议用更常见的表达以避免读者困惑。"]}
{"word":"enfrenzy","summary":{"en":"A rare verb meaning “to make frenzied; to drive into a frenzy.”","zh":"一个罕用动词，意为“使陷入狂乱；使极度激动/惊慌”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make someone or something frenzied; to drive into a state of wild excitement or panic.","zh":"（罕用）使某人/某物陷入狂乱；使极度激动或惊慌。"},"examples":[{"en":"The sudden rumor seemed to enfrenzy the crowd, and people began shouting over one another.","zh":"突然的谣言似乎让人群陷入狂乱，人们开始互相喊叫。"},{"en":"Online outrage can enfrenzy a discussion until no one listens anymore.","zh":"网络上的愤怒情绪会让讨论变得失控，直到没人愿意再听。"}]}],"synonyms":["frenzy","madden","agitate","whip into a frenzy","drive into a frenzy"],"phonetic":"/ɛnˈfrɛnzi/","extraExplanation":["“enfrenzy”在现代英语中非常少见，更多见于较文学化或仿古的写法。日常表达里更常用“frenzy”（作动词）或“drive someone into a frenzy / whip someone into a frenzy”等。"]}
{"word":"enfroces","summary":{"en":"“Enforce” means to make sure a law, rule, or decision is obeyed, often by using authority or force.","zh":"“Enforce” 指用权力或手段确保法律、规则或决定被遵守/被执行。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make people obey a law, rule, or agreement; to ensure it is followed","zh":"强制执行（法律、规则或协议）；确保被遵守"},"examples":[{"en":"The police enforce the law to keep people safe.","zh":"警察执法以保护人们的安全。"},{"en":"The school enforces a strict no-phone policy in class.","zh":"学校严格执行课堂禁用手机的规定。"},{"en":"The company enforces safety rules on every job site.","zh":"公司在每个工地都强制执行安全规定。"}]},{"partOfSpeech":"vt.","definition":{"en":"to force something to happen or to be accepted (often an idea, decision, or change)","zh":"强行推行（想法、决定或变化）；使被接受"},"examples":[{"en":"The new leader tried to enforce changes too quickly.","zh":"新领导试图过快地强行推行改革。"},{"en":"It’s hard to enforce a decision if people don’t agree with it.","zh":"如果人们不同意，就很难让决定真正被执行。"}]}],"synonyms":["implement","carry out","apply","uphold","impose"],"phonetic":"/ɪnˈfɔrs/","extraExplanation":["你输入的 **enfroces** 很可能是拼写错误，正确拼写通常是 **enforces**（动词 enforce 的第三人称单数：He/She/It enforces…）。","常见搭配：enforce the law（执法）、enforce rules/regulations（执行规章制度）、enforce a policy（执行政策）、enforce a ban（执行禁令）。"]}
{"word":"enfroward","summary":{"en":"Enfroward is an archaic word meaning “perverse/contrary,” and rarely as a verb meaning “to make someone stubborn or unruly.”","zh":"Enfroward 是古语，常指“乖戾、逆反的”；极少数情况下作动词，指“使某人变得任性难管”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Perverse or contrary; not willing to obey or cooperate.","zh":"（古语）乖戾的；逆反的；不愿服从或合作的。"},"examples":[{"en":"The old text warns against an enfroward spirit that rejects all good counsel.","zh":"那部旧文告诫人们要警惕一种拒绝一切善意劝告的逆反之心。"},{"en":"He was described as enfroward, quick to argue and slow to compromise.","zh":"他被形容为乖戾好争，难以妥协。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare, archaic) To make someone froward—stubborn, unruly, or difficult to manage.","zh":"（罕见，古语）使（某人）变得乖戾/任性/难以管束。"},"examples":[{"en":"Harsh punishment may only enfroward a child instead of teaching them.","zh":"严厉的惩罚可能只会让孩子更逆反，而非真正教会他们。"}]}],"synonyms":["froward","contrary","perverse","refractory","unruly"],"phonetic":"/ɛnˈfroʊərd/","extraExplanation":["“enfroward”现在几乎不用于日常英语，多见于古旧宗教/道德文本或仿古写作。","词首的 en- 是较旧的构词方式，常带有“使……进入某种状态/使……变成……”的意思（类似于 encourage, enrich 的构词逻辑），因此它与 “froward（乖戾的、逆反的）”在意义上紧密相关。"]}
{"word":"enfuddle","summary":{"en":"“Enfuddle” means to confuse someone or to become confused, often in a slightly humorous tone.","zh":"“Enfuddle”表示“把人弄糊涂/使困惑”，也可指“自己变迷糊”，语气常带一点幽默。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to confuse someone; to make thinking or understanding difficult","zh":"使困惑；使糊涂；让人难以理解"},"examples":[{"en":"The complicated instructions enfuddled me, so I asked for help.","zh":"这些复杂的说明把我弄糊涂了，所以我去求助。"},{"en":"Too many tabs open can enfuddle your focus.","zh":"同时开太多网页标签会让你难以集中注意力。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become confused","zh":"变得困惑；迷糊起来"},"examples":[{"en":"I started to enfuddle when the teacher changed topics quickly.","zh":"老师很快换话题时，我开始有点跟不上、变迷糊了。"}]}],"synonyms":["confuse","bewilder","baffle","muddle","perplex"],"phonetic":"/ɪnˈfʌdəl/","extraExplanation":["“Enfuddle”在现代英语中不算常用，语气偏口语/带点幽默感；正式写作里更常见的是“confuse / bewilder”。","词根上有“fuddle”（把人弄糊涂，也可指把人灌醉/喝得迷糊）的影子，所以它有时暗含“头脑昏沉、像喝多了一样的糊涂”。"]}
{"word":"enfume","summary":{"en":"Enfume means to fill a place with smoke or fumes, and more rarely, to anger or offend someone.","zh":"enfume 意为“使充满烟雾/熏满”，更少见地也可指“使恼怒、冒犯”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fill with smoke or fumes; to smoke out (a place or area)","zh":"使充满烟雾；熏（某处），用烟把（某处）熏满"},"examples":[{"en":"The firefighters used a fan to clear the room after it was enfumed by smoke.","zh":"房间被烟熏得乌烟瘴气后，消防员用风扇把烟排出去。"},{"en":"In the old story, the villagers tried to enfume the cave to drive the animals out.","zh":"在那个古老故事里，村民试图用烟熏洞穴，把动物赶出来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, rare) to make someone angry, upset, or offended; to incense","zh":"（比喻义，较少见）使恼怒；激怒；冒犯"},"examples":[{"en":"His rude comment enfumed her, and she left the meeting early.","zh":"他无礼的评论把她惹火了，她提前离开了会议。"}]}],"synonyms":["smoke out","fill with smoke","fumigate","fume","incense","infuriate"],"phonetic":"/ɛnˈfjum/","extraExplanation":["“enfume”较为少见，常见于较书面或旧式英语；更日常的说法通常是“fill with smoke/fumes”“smoke out”。","词源上与法语“enfumer”（使充满烟）有关；因此它带有“把某处弄得烟雾弥漫”的画面感。"]}
{"word":"enfurrow","summary":{"en":"Enfurrow means to make grooves in something (like plowing a field) or to cover something with deep lines or wrinkles (often a brow or face).","zh":"Enfurrow 指在……上犁出沟槽（如耕地），也指使……出现深纹/皱纹（常说额头或脸）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make furrows (long narrow grooves) in; to plow or mark with grooves","zh":"在……上犁出沟；使出现一道道沟纹（凹槽）"},"examples":[{"en":"The farmer enfurrowed the field before planting corn.","zh":"农夫在种玉米前把田地犁出一道道沟。"},{"en":"Years of rain enfurrowed the hillside with deep channels.","zh":"多年的雨水把山坡冲刷出很深的沟壑。"}]},{"partOfSpeech":"vt.","definition":{"en":"to wrinkle or line (especially a face or brow), as if with furrows","zh":"使（脸、额头等）布满皱纹；使出现深纹"},"examples":[{"en":"Worry enfurrowed his brow.","zh":"忧虑使他的额头皱纹更深。"},{"en":"Her face was enfurrowed by age and hard work.","zh":"岁月与辛劳让她的脸布满深深的皱纹。"}]}],"synonyms":["furrow","groove","plow","score","crease","wrinkle"],"phonetic":"/ɛnˈfɝoʊ/","extraExplanation":["“enfurrow”较偏文学/书面语（也略显古旧），日常英语更常用“furrow”（如：His brow furrowed. / The plow furrowed the soil）或“crease / wrinkle”。","前缀“en-”常有“使变成……/使处于……”的意思（例如：enrich 使更富足，encircle 环绕），所以“enfurrow”带有“使……变得有沟纹”的感觉。"]}

