{"word":"ENIAC","summary":{"en":"ENIAC is a famous early electronic computer in U.S. history; its name is short for “Electronic Numerical Integrator and Computer.”","zh":"ENIAC 是美国计算史上著名的早期电子计算机；其名称源自“Electronic Numerical Integrator and Computer”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the earliest large-scale electronic general-purpose computers, built in the United States during World War II; its name is an acronym for “Electronic Numerical Integrator and Computer.”","zh":"世界上最早期的大型通用电子计算机之一，于二战期间在美国建造；其名称是“Electronic Numerical Integrator and Computer（电子数值积分器与计算机）”的首字母缩写。"},"examples":[{"en":"ENIAC is often called one of the first general-purpose electronic computers.","zh":"ENIAC 常被称为最早的通用电子计算机之一。"},{"en":"Engineers used ENIAC to perform complex calculations much faster than manual methods.","zh":"工程师使用 ENIAC 来进行复杂计算，比人工方法快得多。"},{"en":"In many history books, ENIAC marks a major turning point in modern computing.","zh":"在许多历史书中，ENIAC 被视为现代计算的重要转折点。"}]}],"synonyms":["Electronic Numerical Integrator and Computer","early computer","first-generation computer"],"phonetic":"/ˈiːniæk/","extraExplanation":["ENIAC 于 1945 年完成并公开发布，主要由约翰·莫克利（John Mauchly）与 J. 普雷斯珀·埃克特（J. Presper Eckert）主导设计，地点在宾夕法尼亚大学。","它最初用于弹道表等军用计算；与后来的“存储程序计算机”不同，ENIAC 早期需要通过插线与开关来重新配置程序，因此“编程”非常耗时。","ENIAC 使用大量真空管（常被提到约一万八千个），体积巨大、耗电高，但在当时代表了电子计算速度的飞跃。"]}
{"word":"enicuridae","summary":{"en":"Enicuridae is the bird family of forktails (Old World songbirds), mainly found near forest streams in South and Southeast Asia.","zh":"Enicuridae 指燕尾鸲科（forktails），一种旧大陆鸣禽科，主要见于南亚与东南亚的林间溪流环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small to medium-sized Old World songbirds known as forktails, found mainly in South and Southeast Asia and often living near fast-flowing forest streams.","zh":"燕尾鸲科（Enicuridae）：一类旧大陆鸣禽科，俗称“燕尾鸲/叉尾鸲（forktails）”，主要分布于南亚与东南亚，常栖息在林间溪流等水边环境。"},"examples":[{"en":"The bird guide lists the White-crowned Forktail under the family Enicuridae.","zh":"这本观鸟图鉴把白顶燕尾鸲列在燕尾鸲科（Enicuridae）下。"},{"en":"Enicuridae species are often seen walking on rocks beside mountain streams.","zh":"燕尾鸲科的鸟常被看到在山溪边的石头上行走。"}]}],"synonyms":["forktail family","Enicurus (genus within Enicuridae)"],"phonetic":"/ɛnɪˈkjʊrɪdi/","extraExplanation":["“Enicuridae”是鸟类分类学中的“科”名，常见俗名是“forktail（燕尾鸲/叉尾鸲）”。在较新的分类观点中，有些资料会把它们并入“鹟科（Muscicapidae）”或与之关系非常接近，因此不同图鉴/数据库可能出现分类差异。","词源上，“Enicurus”（燕尾鸲属名）来自希腊语成分，含有“特别/奇异（eni-）”与“尾巴（-curus/oura）”之意，指它们显著的黑白相间、常摆动的尾羽特征。"]}
{"word":"enid","summary":{"en":"Enid is mainly used as a female personal name; it can also be a place name (notably a city in Oklahoma, USA).","zh":"Enid 主要用作女子人名；也可作地名（尤其指美国俄克拉荷马州的城市 Enid）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a personal name).","zh":"女子名字（人名）。"},"examples":[{"en":"Enid is starting a new job next week.","zh":"Enid 下周开始一份新工作。"},{"en":"I met Enid at a language exchange event.","zh":"我在一次语言交流活动上认识了 Enid。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially a city in Oklahoma, USA (also used for some smaller places).","zh":"地名，尤其指美国俄克拉荷马州的城市 Enid（也可指其他较小地点）。"},"examples":[{"en":"He drove through Enid, Oklahoma on his way to Kansas.","zh":"他去堪萨斯的路上开车经过俄克拉荷马州的 Enid。"},{"en":"The concert will be held in Enid this Saturday.","zh":"音乐会将于本周六在 Enid 举行。"}]}],"phonetic":"/ˈiːnɪd/","extraExplanation":["“Enid”常被认为源自威尔士语名字（与中世纪威尔士文学和亚瑟王传说有关）。在英语文学里，Enid 是亚瑟王故事人物之一；丁尼生（Tennyson）的《Idylls of the King》中也出现过这个名字。","作为人名时，Enid 在英语里通常读作 /ˈiːnɪd/，重音在第一个音节。"]}
{"word":"enif","summary":{"en":"“enif” is not standard English; it’s often a typo for “enough.”","zh":"“enif”不是标准英语；常见情况是把“enough（足够）”打错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a typo or non-English spelling. In English writing, people sometimes type “enif” when they mean “enough.”","zh":"不是标准英语单词；通常是拼写错误或非英语拼写。在英文输入中，有人会把“enough”误打成“enif”。"},"examples":[{"en":"I couldn’t find “enif” in an English dictionary—did you mean “enough”?","zh":"我在英语词典里找不到“enif”——你是不是想写“enough”？"},{"en":"If you meant “enough,” you could say: “That’s enough for today.”","zh":"如果你想表达“enough（足够）”，可以说：“That’s enough for today.（今天就到这里，够了。）”}],"}]}],"phonetic":"/ˈɛnɪf/","extraExplanation":["“enif”本身在英语里不常见、也不被主流词典收录。最常见情况是把“enough”（/ɪˈnʌf/）误拼了。","如果你是在某个特定领域（如学校、公司、游戏、社群）看到“ENIF/Enif”，它也可能是缩写、用户名或专有名词；把原句发我，我可以根据上下文判断。"]}
{"word":"enigma","summary":{"en":"An enigma is something or someone that is mysterious and hard to understand or explain.","zh":"enigma 指神秘、难以理解或难以解释的人或事（也可指较正式语境中的难题/谜题）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something or someone that is mysterious, difficult to understand, or hard to explain.","zh":"难以理解的事物或人；谜一般的存在。"},"examples":[{"en":"Her sudden decision to quit was an enigma to everyone at work.","zh":"她突然辞职的决定对公司里的每个人来说都是个谜。"},{"en":"The book describes the ocean as an enigma—beautiful, powerful, and still not fully known.","zh":"这本书把海洋描写成一个谜——美丽、强大，却仍未被完全了解。"}]},{"partOfSpeech":"n.","definition":{"en":"A puzzling question, problem, or riddle (often used in more formal writing).","zh":"（较正式）难题；谜题；令人费解的问题。"},"examples":[{"en":"Scientists are still working on the enigma of what causes the disease.","zh":"科学家仍在研究这种疾病成因这个难题。"},{"en":"The poem leaves the enigma unsolved, inviting readers to interpret it in different ways.","zh":"这首诗没有解开谜题，邀请读者从不同角度去解读。"}]}],"synonyms":["mystery","puzzle","riddle","conundrum","mystique"],"phonetic":"/ɪˈnɪɡmə/","extraExplanation":["“enigma”常用于较正式的语境（新闻、论文、文学评论），语气比“mystery”更书面，也更强调“看起来有线索但仍难解释”的感觉。","词源来自希腊语，原意与“谜语/隐喻式表达”有关，所以在文学讨论中也常用来形容“含义暧昧、解读空间很大”的人物或主题。","文化补充：二战时期的“Enigma”也指德国使用的恩尼格玛密码机，因此在历史/密码学语境里，这个词可能带有“密码谜团”的联想。"]}
{"word":"enigmas","summary":{"en":"“Enigmas” is the plural of “enigma”: mysteries or puzzling people/things that are hard to understand.","zh":"“enigmas”是“enigma”的复数：指难以理解的谜团，或令人捉摸不透的人/事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mystery or puzzle that is difficult to understand or explain; something or someone that feels hard to “figure out.”","zh":"难以理解或解释的谜；令人费解的事物或人。"},"examples":[{"en":"Her sudden decision to quit was an enigma to everyone at work.","zh":"她突然决定辞职，让公司里的每个人都摸不着头脑。"},{"en":"The ending of the novel remains an enigma, even after a second reading.","zh":"即使读了第二遍，这部小说的结局仍然是个谜。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who seems mysterious or hard to read.","zh":"性格神秘、难以看透的人。"},"examples":[{"en":"He’s an enigma—quiet in public but hilarious with close friends.","zh":"他是个让人捉摸不透的人——在公众场合很安静，但和熟朋友在一起特别搞笑。"}]}],"synonyms":["mysteries","puzzles","riddles","conundrums"],"phonetic":"/ɪˈnɪɡməz/","extraExplanation":["“enigmas”是名词复数形式；单数是“enigma”。","词源来自希腊语，原意与“谜语、隐晦的话”有关，所以它常带有一种“不是普通难题，而是带点神秘感”的语气。","常见搭配：an enigma to sb（对某人来说是个谜）、remain an enigma（仍是个谜）、solve an enigma（解开谜团）。","文学语境里，“enigma”常用来形容人物或结局的“耐人寻味、刻意留白”，而不只是简单的“题目/问题”。"]}
{"word":"enigmata","summary":{"en":"“Enigmata” means “enigmas”—multiple mysteries or puzzles.","zh":"“enigmata”意为“enigmas”：多个谜团、难题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “enigma”: mysterious or puzzling things, situations, or people that are hard to understand or explain.","zh":"“enigma（谜、难解之事）”的复数：指一系列神秘、令人困惑、难以理解或解释的事物、情况或人。"},"examples":[{"en":"The paintings are full of visual enigmata that invite different interpretations.","zh":"这些画作充满了视觉上的谜团，引人做出不同的解读。"},{"en":"In the novel, the detective faces one enigma after another—multiple enigmata with no obvious clues.","zh":"在小说里，侦探接连遇到一个又一个谜题——许多谜团都没有明显线索。"}]}],"synonyms":["enigmas","mysteries","puzzles","riddles"],"phonetic":"ɪˈnɪɡmətə","extraExplanation":["“enigmata”来自希腊语复数形式（enigma 的希腊复数），在学术写作或较正式的语境中更常见。日常英语里，人们更常说“enigmas”。两者意思相同，但“enigmata”语感更书面、更“古典”。"]}
{"word":"enigmatic","summary":{"en":"Enigmatic means mysterious or puzzling—something that’s hard to understand or interpret.","zh":"Enigmatic 指“神秘难懂、令人困惑”，强调难以理解或解读。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Mysterious and difficult to understand; seeming to hide a meaning or intention.","zh":"神秘的；难以理解的；似乎隐藏着含义或意图的。"},"examples":[{"en":"She gave an enigmatic smile and said nothing more.","zh":"她露出一个神秘的微笑，就不再多说。"},{"en":"The painting’s symbols are enigmatic to many viewers.","zh":"这幅画的象征意义对许多观众来说很难读懂。"}]},{"partOfSpeech":"adj.","definition":{"en":"Hard to interpret or explain; puzzling.","zh":"令人困惑的；难以解释的。"},"examples":[{"en":"His sudden decision to quit was enigmatic to his coworkers.","zh":"他突然辞职的决定让同事们感到困惑。"},{"en":"The report ends with an enigmatic statement.","zh":"报告以一句令人费解的话结尾。"}]}],"synonyms":["mysterious","puzzling","cryptic","obscure","inscrutable"],"phonetic":"/ˌɛnɪɡˈmætɪk/","extraExplanation":["“enigmatic”常用来形容人的表情、行为、话语、艺术作品等，语气比“mysterious”更偏“让人摸不着头脑、难以解读”。","词根来自希腊语“ainigma（谜语）”，所以它常带有“像谜题一样”的感觉。文学与评论写作里也很常见，用来形容“留下悬念/不明说”的表达方式。"]}
{"word":"enigmatical","summary":{"en":"“Enigmatical” means mysterious and difficult to understand.","zh":"“enigmatical”意为“神秘的、难以理解的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Mysterious or hard to understand; not explained clearly, so it makes people wonder what it really means.","zh":"神秘的；难以理解的；不清楚、让人猜不透的。"},"examples":[{"en":"She gave me an enigmatical smile and didn’t answer my question.","zh":"她给了我一个神秘的微笑，却没有回答我的问题。"},{"en":"The poem’s meaning feels enigmatical at first, but it becomes clearer after a second reading.","zh":"这首诗的意思一开始让人觉得很难懂，但再读一遍就更清楚了。"},{"en":"His enigmatical comment started a rumor at the office.","zh":"他那句令人费解的评论在办公室里引发了流言。"}]}],"synonyms":["mysterious","puzzling","cryptic","obscure","baffling"],"phonetic":"/ˌɛnɪɡˈmætɪkəl/","extraExplanation":["“enigmatical”更偏书面语，日常口语里更常用“mysterious”或“puzzling”。","它来自“enigma”（谜、难题）。常见搭配有：an enigmatical smile/remark/message（神秘的微笑/话语/信息）。","语气上不一定是“阴暗危险”，更多是“含义不明、让人想解读”。如果强调故意隐瞒，可用“cryptic”（言辞隐晦的）。"]}
{"word":"enigmatically","summary":{"en":"“Enigmatically” means “in a mysterious, hard-to-understand way.”","zh":"“enigmatically”表示“以神秘、难以理解的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a mysterious or puzzling way, so that the meaning is not clear.","zh":"以神秘或令人困惑的方式；让人难以理解其含义。"},"examples":[{"en":"She smiled enigmatically and didn’t answer the question.","zh":"她神秘地笑了笑，没有回答那个问题。"},{"en":"The note was written enigmatically, as if it had a hidden message.","zh":"那张便条写得含糊而神秘，仿佛藏着暗号。"}]}],"synonyms":["mysteriously","cryptically","obscurely","puzzlingly"],"phonetic":"/ˌɛnɪɡˈmætɪkli/","extraExplanation":["“enigmatically”来自形容词“enigmatic”（神秘的、费解的），再加上副词后缀“-ly”。常用来描写表情、话语、线索、艺术作品等给人“看得见但猜不透”的感觉。","语气上它通常偏中性到略带文学感：可能是刻意保持神秘，也可能只是表达不清。与“mysteriously”相比，“enigmatically”更强调“像谜语一样难解、含义不明”。"]}
{"word":"enigmaticalness","summary":{"en":"Enigmaticalness means the quality of being mysterious or hard to understand.","zh":"Enigmaticalness 指“神秘难解、令人费解”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being mysterious, puzzling, or difficult to understand; an enigmatic character or feeling","zh":"神秘难解的特质；令人费解、难以理解的感觉或性格"},"examples":[{"en":"The poem’s enigmaticalness makes readers argue about its meaning.","zh":"这首诗的“神秘难解”让读者不断争论它的含义。"},{"en":"Her quiet smile added to the enigmaticalness of the whole scene.","zh":"她安静的微笑为整个场景增添了几分神秘感。"},{"en":"The detective was drawn to the enigmaticalness of the message.","zh":"侦探被这条信息的费解之处所吸引。"}]}],"synonyms":["mystery","mysteriousness","enigmatic quality","obscurity","puzzlement"],"phonetic":"/ˌɛnɪɡˈmætɪkəlnəs/","extraExplanation":["“enigmaticalness”比较少见、偏书面，更多时候人们会用更自然的表达，如“mystery”“enigmatic quality”“sense of mystery”，或直接用形容词“enigmatic / mysterious”。","词根来自“enigma（谜）”。在写作中用它可以强调一种“难以解释、越想越不明白”的气质，常见于文学评论、艺术评论等语境。"]}
{"word":"enigmatist","summary":{"en":"An enigmatist is a person who seems mysterious and hard to understand.","zh":"enigmatist 指“神秘难懂、令人费解的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who speaks or behaves in a mysterious, puzzling way; someone who seems hard to understand.","zh":"行为或言谈神秘、令人费解的人；让人难以看懂的人。"},"examples":[{"en":"To his coworkers, he was an enigmatist—always hinting at plans but never explaining them clearly.","zh":"在同事眼里，他像个神秘主义者——总是暗示有什么计划，却从不讲清楚。"},{"en":"The poet cultivated the image of an enigmatist, letting readers interpret the meaning for themselves.","zh":"那位诗人刻意塑造“神秘莫测”的形象，让读者自行解读含义。"}]}],"synonyms":["mystery","riddler","puzzler","enigma","mysterious person"],"phonetic":"/ɪˈnɪɡmətɪst/","extraExplanation":["“enigmatist”不算常用词，更常见的说法是 **enigmatic person**（神秘的人）或 **mystery**（谜一样的人）。","词根来自 **enigma**（谜、谜团）+ **-ist**（表示“……的人/从事者”）。它通常带有文学或评论语气，用来强调一个人的“难以捉摸”。"]}
{"word":"enigmatization","summary":{"en":"“Enigmatization” means the process of making something seem mysterious or difficult to understand.","zh":"“enigmatization”指把某事“谜化/神秘化”、让它显得难以理解的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something seem mysterious, puzzling, or hard to understand (often by presenting it as a “riddle” or by withholding clarity)","zh":"使某事显得神秘、难以理解或像谜一样的行为或过程（常指通过含糊表达或刻意不解释来制造“谜感”）"},"examples":[{"en":"The film’s marketing relied on enigmatization, revealing almost nothing about the plot.","zh":"这部电影的营销依靠“谜化”，几乎不透露任何剧情。"},{"en":"In politics, a leader’s vague answers can be a form of enigmatization.","zh":"在政治领域，领导人含糊其辞的回答可能是一种“谜化”手段。"},{"en":"The poet uses enigmatization to invite readers to interpret the images in different ways.","zh":"诗人通过“谜化”来邀请读者对意象做多种解读。"}]}],"synonyms":["mystification","obfuscation","concealment","deliberate vagueness","making something mysterious"],"phonetic":"ˌɛnɪɡmətaɪˈzeɪʃən","extraExplanation":["“enigmatization”较少见，更多出现在学术写作（文学批评、媒体研究、修辞分析）中。日常英语里更常用的表达是“making it mysterious / making it unclear / mystification / obscuring”。","构词上：enigma（谜）+ -tize（使成为…）→ enigmatize（使变得像谜一样）+ -ation（名词化，表示过程/结果）→ enigmatization（谜化/神秘化的过程）。"]}
{"word":"enigmatize","summary":{"en":"Enigmatize means to make something seem mysterious or hard to understand, often by presenting it in an obscure way.","zh":"enigmatize 指“使某事显得神秘、费解”，常带有“用含糊方式呈现”的意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something seem mysterious, puzzling, or hard to understand","zh":"使……显得神秘、费解或难以理解"},"examples":[{"en":"The author enigmatized the ending so readers would debate it for years.","zh":"作者把结局写得很耐人寻味，让读者多年都在讨论。"},{"en":"Don’t enigmatize a simple answer—just explain it clearly.","zh":"别把简单的答案说得玄乎其玄——清楚解释就好。"}]},{"partOfSpeech":"vt.","definition":{"en":"to describe or present something in an intentionally obscure way","zh":"以刻意含糊、晦涩的方式描述或呈现（某事）"},"examples":[{"en":"In the interview, he enigmatized his plans with vague hints.","zh":"在采访中，他用含糊的暗示把自己的计划说得扑朔迷离。"},{"en":"Some advertisements enigmatize the message to create curiosity.","zh":"有些广告会故意把信息弄得神秘，以激起好奇心。"}]}],"synonyms":["mystify","obscure","bewilder","puzzle","make enigmatic"],"phonetic":"/ɪnˈɪɡməˌtaɪz/","extraExplanation":["这个词比较少见，常见的表达通常用：make (something) mysterious / make (something) enigmatic，或用形容词 enigmatic（神秘的、令人费解的）。","词形上来自 enigmatic（神秘的）+ 动词后缀 -ize，表示“使变得……”。在写作或评论里用它，会显得更“文艺/学术”，但日常口语里不太常用。"]}
{"word":"enigmatized","summary":{"en":"Enigmatized means “made mysterious or turned into an enigma,” often used in literary or critical writing.","zh":"Enigmatized 指“被弄得神秘、变成谜一样难懂”，多见于文学/评论性写作。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"made mysterious or hard to understand; turned into an enigma","zh":"使变得神秘、难以理解；把……变成谜"},"examples":[{"en":"The filmmaker enigmatized the ending so viewers would debate it.","zh":"导演把结局处理得更神秘，让观众去争论解读。"},{"en":"In the novel, ordinary events are enigmatized through symbolic language.","zh":"在小说里，普通事件通过象征性的语言被“谜化”，显得更耐人寻味。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective) mysterious or difficult to interpret because it has been made unclear","zh":"（作形容词）因被刻意处理而显得神秘、难以解读的"},"examples":[{"en":"The report felt enigmatized, full of hints but few clear facts.","zh":"这份报告给人一种被“谜化”的感觉：提示很多，但明确事实很少。"}]}],"synonyms":["mystified","obscured","made enigmatic","shrouded","veiled"],"phonetic":"/ɪˈnɪɡməˌtaɪzd/","extraExplanation":["“enigmatized”是动词“enigmatize”的过去式/过去分词，比较少见，常出现在文学评论、艺术评论或学术写作里，用来强调“被刻意弄得更神秘、更难解”。日常英语更常用的表达有：“made mysterious / made unclear / shrouded in mystery”。"]}
{"word":"enigmatizing","summary":{"en":"“Enigmatizing” means making something seem mysterious or difficult to understand.","zh":"“enigmatizing”指把某事变得更神秘、更难懂或更让人困惑。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something seem mysterious, hard to understand, or puzzling (present participle of “enigmatize”)","zh":"使某事显得神秘、难以理解或令人困惑（“enigmatize”的现在分词）"},"examples":[{"en":"By using vague language, the speaker was enigmatizing a simple issue.","zh":"通过使用含糊的措辞，演讲者把一个简单的问题弄得更神秘难懂。"},{"en":"The director keeps enigmatizing the ending so viewers will debate it.","zh":"导演不断把结局处理得更耐人寻味，好让观众去讨论争辩。"}]},{"partOfSpeech":"adj.","definition":{"en":"puzzling or mysterious in effect; making things seem unclear (rare as an adjective)","zh":"令人困惑的；带有神秘感的（作形容词用较少见）"},"examples":[{"en":"The novel’s enigmatizing tone keeps readers guessing.","zh":"这部小说那种“越写越谜”的语气让读者一直猜测。"}]}],"synonyms":["mystifying","obscuring","clouding","complicating","making mysterious"],"phonetic":"/ɪˈnɪɡməˌtaɪzɪŋ/","extraExplanation":["“enigmatize”在日常英语中不算常用，更常见的替代说法有：make (something) mysterious / make it confusing / obscure / complicate。写作或评论中用“enigmatizing”往往带一点批评意味：不是自然地“神秘”，而是“把事情故意弄得玄乎”。","词根来自“enigma（谜）”。在文学评论里，你可能会看到类似表达：an author enigmatizes a character（作者把人物写得更难以捉摸）。"]}
{"word":"enigmato","summary":{"en":"“Enigmato” is likely a misspelling of “enigmatic,” meaning mysterious or hard to understand.","zh":"“enigmato”很可能是“enigmatic”的拼写错误，意为“神秘的、难以理解的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Mysterious and hard to understand or explain; puzzling.","zh":"神秘的；难以理解或解释的；令人困惑的。"},"examples":[{"en":"She gave an enigmatic smile and didn’t answer the question.","zh":"她露出一个意味深长、难以捉摸的微笑，却没有回答问题。"},{"en":"The poem’s ending is enigmatic, so readers interpret it in different ways.","zh":"这首诗的结尾很晦涩，因此读者会有不同的解读。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a secretive quality; not revealing your thoughts or feelings clearly.","zh":"（人）讳莫如深的；不轻易表露想法或情绪的。"},"examples":[{"en":"He stayed enigmatic during the meeting, speaking very little.","zh":"开会时他表现得很神秘，几乎不怎么说话。"},{"en":"Her enigmatic reply made everyone wonder what she really meant.","zh":"她那句含糊神秘的回答让大家都在猜她到底什么意思。"}]}],"synonyms":["mysterious","puzzling","cryptic","opaque","hard-to-read"],"phonetic":"/ˌɛnɪɡˈmætɪk/","extraExplanation":["“enigmato”不是常见英语单词，最可能是把 **enigmatic**（神秘的/难懂的）拼错了。","**enigmatic** 来自名词 **enigma**（谜、谜团），词源可追溯到希腊语，常用于文学评论、人物描写、艺术作品解读等语境，带有“耐人寻味、可多重解读”的感觉。","文学与文化中常见搭配：**an enigmatic smile/figure/ending**（意味深长的微笑/神秘人物/晦涩结局）。相关词：**enigma**（谜团），**mysterious**（神秘的，更通用），**cryptic**（晦涩隐晦的，常指语言/信息）。"]}
{"word":"enigmatographer","summary":{"en":"An enigmatographer is a creator or writer of enigmas—mysteries or puzzles meant to be solved.","zh":"enigmatographer 指“谜题/谜语的创作者或撰写者”，即出谜的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who creates, writes, or records enigmas (mysteries or puzzles), especially for readers to solve.","zh":"创作、撰写或记录谜题/谜语（神秘难解之事）的人，尤指供人解答的谜题作者。"},"examples":[{"en":"The magazine hired an enigmatographer to design a weekly puzzle page.","zh":"这本杂志聘请了一位谜题作者来设计每周的益智版面。"},{"en":"As an enigmatographer, she enjoys hiding clues in ordinary-looking sentences.","zh":"作为谜题作者，她喜欢把线索藏在看似普通的句子里。"},{"en":"The enigmatographer’s riddles are simple in language but tricky in logic.","zh":"这位谜题作者的谜语语言简单，但逻辑刁钻。"}]}],"synonyms":["puzzle-maker","puzzle creator","riddler","puzzle designer","(cryptic crossword) setter"],"phonetic":"/ɪˌnɪɡməˈtɑɡrəfɚ/","extraExplanation":["这个词很少见，更多时候人们会说 puzzle-maker（谜题作者）、riddler（出谜语的人）、or cryptic crossword setter（隐语填字作者）。","构词上可以理解为 enigma（谜、难题）+ -grapher（书写者/记录者，如 photographer 摄影师、biographer 传记作者）。因此 enigmatographer 字面就是“写谜的人”。","在正式写作中用它会显得有点“书卷气”或带玩笑式的夸张；如果想更自然，通常用 puzzle creator / puzzle designer。"]}
{"word":"enigmatography","summary":{"en":"Enigmatography means the art or practice of creating or writing riddles and puzzles.","zh":"enigmatography 指“谜题/谜语的创作或写作”的艺术或实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The art or practice of writing, designing, or collecting riddles and puzzles (especially word puzzles).","zh":"谜题（尤其是文字谜）的创作、设计或收集的艺术/实践。"},"examples":[{"en":"She became interested in enigmatography after joining a campus puzzle club.","zh":"加入校园谜题社团后，她开始对谜题创作产生兴趣。"},{"en":"The book is a small collection of enigmatography—riddles, wordplay, and logic puzzles.","zh":"这本书收录了一些谜题创作作品——谜语、文字游戏和逻辑题。"},{"en":"In his spare time, he practices enigmatography and posts a new riddle every Friday.","zh":"他闲暇时创作谜题，并在每周五发布一条新谜语。"}]}],"synonyms":["riddle-writing","puzzle-making","riddling","wordplay","puzzling (as a hobby)"],"phonetic":"/ɪnˌɪɡməˈtɑːɡrəfi/","extraExplanation":["这个词非常少见，更多见的表达是 riddle-writing（写谜语）、puzzle-making（做谜题）、or the art of riddles（谜题艺术）。","词源上可拆为 enigma（谜、谜团）+ -graphy（书写/记录/创作的“……学/……术”后缀），意思就是“关于谜的书写/创作”。","在正式写作中使用时，最好给出上下文说明（例如“the art of writing riddles”），因为很多母语者也未必熟悉该词。"]}
{"word":"enigmatology","summary":{"en":"Enigmatology means the study and practice of puzzles, especially word puzzles like crosswords.","zh":"enigmatology 指“谜题学”，即研究与实践谜题（尤其是填字等文字谜题）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or practice of creating, solving, and analyzing puzzles (especially word puzzles like crosswords).","zh":"谜题学；研究与实践谜题（尤指填字游戏等文字谜题）的创作、解答与分析。"},"examples":[{"en":"She writes a blog about enigmatology and reviews new crossword puzzles every week.","zh":"她写博客介绍谜题学，并每周评测新的填字游戏。"},{"en":"A course on enigmatology might cover clue types, wordplay, and puzzle design.","zh":"一门关于谜题学的课程可能会讲线索类型、文字游戏以及谜题设计。"}]}],"synonyms":["puzzle studies","cruciverbalism (crossword solving)","puzzling (informal)"],"phonetic":"/ɪˌnɪɡməˈtɑlədʒi/","extraExplanation":["“Enigmatology”由“enigma（谜）+ -logy（……学）”构成，常见于英语世界的填字游戏与谜题社群中，但在日常口语里不算高频词。","在文化语境中，它常与报纸填字（如《纽约时报》crossword）或谜题杂志联系在一起；提到这个词时，通常暗示较系统、较“专业”的谜题兴趣。"]}
{"word":"enigua","summary":{"en":"Enigma means something or someone mysterious and hard to understand.","zh":"Enigma 指“神秘难解、令人费解的事物或人物”，也可指“谜语/难题”（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, thing, or situation that is mysterious, puzzling, or hard to understand.","zh":"神秘难解的人／事／情况；谜一般的存在。"},"examples":[{"en":"To her classmates, he was an enigma—quiet, but always getting top grades.","zh":"在同学眼里，他是个谜一样的人——很安静，却总拿最高分。"},{"en":"The sudden change in the company’s decision remains an enigma.","zh":"公司决定的突然变化仍然令人费解。"}]},{"partOfSpeech":"n.","definition":{"en":"A riddle or puzzling question (less common in everyday modern English).","zh":"谜语；难题（现代日常英语中较少用这种意思）。"},"examples":[{"en":"The book begins with an enigma that the hero must solve.","zh":"这本书以一个主角必须解开的谜题开场。"}]}],"synonyms":["mystery","puzzle","riddle","unknown","conundrum"],"phonetic":"/ɪˈnɪɡmə/","extraExplanation":["你输入的“enigua”很可能是拼写错误；英语里更常见的词是 **enigma**。","**enigma** 源自希腊语 *ainigma*（意为“谜语/隐晦的话”）。在文学与新闻评论中常用来形容“难以看透的人物”或“无法解释的现象”。","常见搭配：**an enigma to someone**（对某人来说是个谜）、**remain an enigma**（仍是个谜）。"]}
{"word":"enisle","summary":{"en":"“enisle” is not a standard English word; it is likely a misspelling (often of “ensile” or “enlist,” depending on context).","zh":"“enisle”不是标准英语单词，通常是拼写错误；多半取决于语境，可能想写“ensile”或“enlist”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of another word (see suggestions below).","zh":"不是标准英语单词，通常是拼写错误（可参考下方可能想表达的词）。"},"examples":[{"en":"I couldn’t find “enisle” in a dictionary—did you mean “ensile” or “enlist”?","zh":"我在词典里查不到“enisle”，你是不是想写“ensile”或“enlist”？."}]}],"extraExplanation":["“enisle”在常见英英/英汉词典中通常查不到。最常见的情况是拼写误差。你可以根据语境对照以下可能目标词：\n1) ensile / store as silage：农业用语，指把饲料青贮（如把玉米秸秆青贮起来）。\n2) enlist：入伍；（使）加入（组织/军队）。\n3) in an isle / on an isle：如果你想表达“在岛上”，通常写作 on an island（更常用）或 in an isle（较少见且更偏文学/古风）。\n如果你把包含“enisle”的句子发我，我可以帮你精准判断你想要的词。"]}
{"word":"enisled","summary":{"en":"“Enlisted” usually means “joined the military” or describes a non-officer service member.","zh":"“Enlisted”通常表示“入伍”，也可形容“非军官的军人（士兵/士官）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended: “enlisted”) to join the military or another organized group; past tense/past participle of “enlist.”","zh":"（你可能想写：enlisted）入伍；加入某个有组织的团体；是 enlist 的过去式/过去分词。"},"examples":[{"en":"She enlisted in the Navy right after high school.","zh":"她高中毕业后就加入了海军。"},{"en":"They enlisted volunteers to help clean up the park.","zh":"他们招募志愿者来帮忙清理公园。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Military) serving in the armed forces as a non-officer (not a commissioned officer).","zh":"（军事）服役的士兵（非军官；非“委任军官”）。"},"examples":[{"en":"He was an enlisted soldier before he became an officer.","zh":"他当军官之前是一名士兵（非军官）。"},{"en":"Enlisted personnel and officers often have different duties and training.","zh":"士兵（非军官）和军官通常有不同的职责与训练。"}]}],"synonyms":["joined up","signed up","recruited","drafted (sometimes, context-dependent)"],"phonetic":"ɪnˈlɪstɪd","extraExplanation":["“enlisted”在美国语境里常与军队阶层有关：enlisted personnel 指“士兵/士官”体系（如 private, sergeant 等），与 commissioned officer（委任军官，如 lieutenant, captain 等）相对。","也可用于非军事场景，表示“招募/征集（人力）”或“争取（支持）”，例如 enlist help/support。"]}
{"word":"enisles","summary":{"en":"“Enisle” means to make something into an island or to isolate it as if it were an island.","zh":"“enisle”意为使成为岛屿，或（比喻）使孤立、与外界隔绝。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make into an island; to surround with water (or something like water) so that it becomes an island","zh":"使成为岛屿；以水（或类似水的东西）环绕，使之成岛"},"examples":[{"en":"Over time, the rising sea enisled the rocky hill.","zh":"随着时间推移，海平面上升把那座岩石小山变成了岛。"},{"en":"The floodwaters enisled a few homes for days.","zh":"洪水把几户人家围成“孤岛”好几天。"}]},{"partOfSpeech":"vt.","definition":{"en":"to isolate or cut off, as if turning something into an island (often used figuratively)","zh":"使孤立；使与外界隔绝（常用于比喻，好像变成一座岛）"},"examples":[{"en":"New highways can enisle small towns from their neighbors.","zh":"新的高速公路可能让小镇与周边地区变得隔绝。"},{"en":"Working remotely sometimes enisles people socially.","zh":"远程工作有时会让人在社交上变得孤立。"}]}],"synonyms":["isolate","cut off","surround","encircle"],"phonetic":"/ɪˈnaɪəl/","extraExplanation":["“enisle”由前缀 en-（表示“使成为”）+ isle（岛）构成，意思直观但比较少见，多出现在文学、描写性写作里。","常见变体：enisled（过去式/过去分词），enisling（现在分词）。","比喻用法很常见：不是“真的变成岛”，而是强调“像岛一样被切断联系、难以接近”。"]}
{"word":"enisling","summary":{"en":"“Enisling” is not a standard English word; it likely means “enlisting”: joining or recruiting, or getting someone’s support.","zh":"“enisling”不是标准英语词；很可能指“enlisting”：报名加入/招募，或争取他人支持。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended: “enlisting”) to sign up or recruit someone for a group, organization, or cause (often the military).","zh":"（很可能是想写“enlisting”）报名加入或招募某人加入某个团体、组织或事业（常指参军）。"},"examples":[{"en":"She is enlisting in the army next month.","zh":"她下个月要报名参军。"},{"en":"The campaign is enlisting volunteers to help on weekends.","zh":"这项活动正在招募志愿者周末来帮忙。"}]},{"partOfSpeech":"vt.","definition":{"en":"to get someone’s help, support, or involvement in order to achieve something.","zh":"争取某人的帮助、支持或参与，以达成某事。"},"examples":[{"en":"We enlisted our neighbors’ help to move the sofa.","zh":"我们请邻居帮忙搬沙发。"},{"en":"The teacher enlisted parents to support reading at home.","zh":"老师争取家长支持孩子在家阅读。"}]}],"synonyms":["join","sign up","recruit","enroll","register"],"phonetic":"/ɪnˈlɪst/","extraExplanation":["“enisling”在英语里不是常见单词，看起来最像是拼写错误。最接近且常用的是“enlisting”（来自动词 enlist）。","拼写提示：enlist = en + list（把名字“列入名单”→报名/招募）。常见形式：enlist / enlisted / enlisting。"]}
