{"word":"enjail","summary":{"en":"“Enjail” means to imprison someone (a less common, more formal word).","zh":"“enjail”表示“监禁、把人关进监狱”（较少用，语气更正式/文学）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put someone in jail; to imprison.","zh":"把（某人）关进监狱；监禁。"},"examples":[{"en":"The court decided to enjail him for fraud.","zh":"法院决定因诈骗罪将他监禁。"},{"en":"In some stories, a hero is enjail​ed unjustly before proving their innocence.","zh":"在一些故事里，英雄会先被冤枉入狱，后来才证明清白。"}]}],"synonyms":["jail","imprison","incarcerate","confine","detain"],"phonetic":"/ɛnˈdʒeɪl/","extraExplanation":["“enjail”相对少见，更常用的是 “jail” 或 “imprison”。在写作中使用 “enjail” 会显得更正式或带一点文学/古风色彩。","前缀 “en-” 常有“使……处于某种状态/进入……”的意思（如 “enrich” 使富裕，“encircle” 围住）。因此 “enjail” 字面上就是“使进入监狱（的状态）”。"]}
{"word":"enjamb","summary":{"en":"“Enjamb” means to let a sentence run over to the next line in poetry without a strong pause.","zh":"“enjamb”指在诗歌中让句子跨过行末不断句，延续到下一行。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Poetry) to carry a sentence or phrase over from one line to the next without a strong pause at the line break; to use enjambment.","zh":"（诗歌）把一句话或短语在行末不断句（或不作明显停顿）地接到下一行；使用跨行（enjambment）。"},"examples":[{"en":"The poet enjambs the line so the meaning keeps moving into the next one.","zh":"诗人把这一行做成跨行，使意思继续流向下一行。"},{"en":"Try to enjamb the sentence to create a faster rhythm.","zh":"试着把句子跨行来制造更快的节奏。"}]}],"synonyms":["run on (in verse)","carry over","use enjambment"],"phonetic":"/ɛnˈdʒæm/","extraExplanation":["“enjamb”来自法语，和“跨过（腿）”的意象有关：句子像“跨步”一样越过行尾进入下一行。","在诗歌朗读时，enjambed lines 往往在行尾不停顿或只轻微停顿；与之相对的是 end-stopped lines（行末句读完整，停顿明显）。"]}
{"word":"enjambed","summary":{"en":"“Enjambed” describes poetry lines that continue into the next line without a strong pause at the break.","zh":"“Enjambed”指诗歌中行末不停顿、语意跨到下一行的“跨行不断句”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Poetry) having a line that runs on into the next line without a full stop (no strong pause at the line break).","zh":"（诗歌）跨行不断句的；诗行在行末不停顿而接到下一行的。"},"examples":[{"en":"The poem is mostly enjambed, so the meaning often continues across line breaks.","zh":"这首诗大多使用跨行不断句，所以意思常常跨过换行继续。"},{"en":"An enjambed line can create speed and surprise in the reader.","zh":"跨行不断句的诗行能让阅读节奏更快，并带来出其不意的效果。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “enjamb” (to carry a sentence or phrase over a line break in poetry).","zh":"“enjamb”的过去式/过去分词：在诗歌中使语句跨行延续。"},"examples":[{"en":"The poet enjambed several sentences to keep the voice flowing.","zh":"诗人让好几句话跨行延续，以保持语气的流动感。"}]}],"synonyms":["run-on (line)","not end-stopped","flowing"],"phonetic":"/ɛnˈdʒæmd/","extraExplanation":["“enjambed”来自法语 enjamber，原意是“跨过去、跨步”。在诗歌里，它常与“end-stopped（行末停顿）”对比：end-stopped 在行末有明显停顿（如句号、分号），而 enjambed 则把语意推到下一行。","效果上，enjambment 常用来制造：更口语的流动感、强调某个词（把关键词放在下一行开头）、或制造悬念与转折（读者到下一行才“补全”意思）。"]}
{"word":"enjambement","summary":{"en":"Enjambement is a poetic technique where a sentence continues past the end of a line into the next line without a full pause.","zh":"Enjambement 指诗歌中的“跨行/续行”：句子不在行末停顿，而是延续到下一行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In poetry, the continuation of a sentence or phrase from one line to the next without a full pause (and often without end punctuation), so the meaning “runs over” the line break.","zh":"（诗歌）跨行（续行）：一句话或短语在行末不停顿（常无句末标点），意思延续到下一行。"},"examples":[{"en":"The poem uses enjambement to create a fast, flowing rhythm across lines.","zh":"这首诗用跨行来制造快速、流动的节奏。"},{"en":"Because of enjambement, you have to read into the next line to complete the thought.","zh":"因为有跨行，你必须读到下一行才能读完整个意思。"},{"en":"Try writing two lines with enjambement instead of ending each line with a period.","zh":"试着写两行跨行的诗，不要每行都用句号结尾。"}]}],"synonyms":["run-on line","line run-on"],"phonetic":"/ɛnˈdʒæm.bmənt/","extraExplanation":["这个词来自法语 enjambement，字面意思有“跨步、迈过去”的感觉：句子“跨过”了行尾。","学习时可把它和 end-stopped line（句读行：行末有停顿/标点）对比：跨行更像口语的自然延伸，句读行更像一句一句“落地”。","阅读技巧：遇到跨行不要在行末强行停顿，先顺着语法和意义读到句子真正结束的位置。"]}
{"word":"enjambements","summary":{"en":"“Enjambements” (plural of “enjambement/ enjambment”) means run-on lines in poetry where the sentence continues beyond the line break.","zh":"“enjambements”（“enjambement/ enjambment”的复数）指诗歌中的跨行：句子越过行末，延续到下一行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lines in poetry that run on into the next line without a full pause (the sentence continues past the line break).","zh":"（诗歌中的）跨行（法）：一句话在行末不断句，意思延续到下一行。"},"examples":[{"en":"The poet uses enjambements to make the rhythm feel more natural and conversational.","zh":"诗人用跨行来让节奏更自然、更像口语。"},{"en":"Notice how the meaning doesn’t stop at the end of the line—those are enjambements.","zh":"注意句意没有在行末结束——那就是跨行。"},{"en":"Too many enjambements can create speed and tension in a poem.","zh":"过多的跨行会让诗的节奏变快，并制造紧张感。"}]}],"synonyms":["run-on line(s)","line running-on"],"phonetic":"/ɛnˈdʒæm.mənt/","extraExplanation":["“enjambements”是“enjambement”的复数形式，常见于文学批评或课堂分析中；英语里也常用拼写“enjambment”。","它常与“end-stopped line（行末停顿/行末断句）”对比：end-stopped 通常在行末有明显停顿（如句号、分号），而 enjambement 则让语法结构和意义跨过行末继续流动。"]}
{"word":"enjambment","summary":{"en":"Enjambment is when a poetic line runs on into the next line without a strong pause at the end.","zh":"Enjambment 指诗歌中一句意思跨过行末不停顿，延续到下一行的“行跨/跨行连续”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In poetry) the continuation of a sentence or idea from one line to the next without a strong pause (like a period or comma) at the end of the line.","zh":"（诗歌中）行跨（跨行连续）：句子或意思不在诗行末尾停顿（没有明显的句号/逗号等），而是直接延续到下一行。"},"examples":[{"en":"The poet uses enjambment so the reader’s eyes and thoughts move quickly into the next line.","zh":"诗人使用行跨，让读者的视线和思路快速进入下一行。"},{"en":"In “I wandered lonely as a cloud,” Wordsworth often carries meaning across lines, creating gentle enjambment.","zh":"在华兹华斯的《我孤独地漫游，像一朵云》中，他常把意思跨到下一行，形成柔和的行跨效果。"}]}],"synonyms":["run-on line","line running","line break without pause"],"phonetic":"/ɛnˈdʒæm.mənt/","extraExplanation":["“Enjambment”来自法语 enjambement，原意与“跨步/跨过去”有关，很形象：意思“跨过”行尾的边界继续向前。","行跨的常见效果：①制造速度感与流动感（读者不停顿）；②营造悬念（要到下一行才“揭晓”）；③让行尾的词更突出（因为视觉上停在行尾）。","对比术语：end-stopped line（句止行/行末停顿）指一句话在行尾自然结束，常见于句号、分号或明显停顿处；行跨则相反。"]}
{"word":"enjambments","summary":{"en":"“Enjambments” is the plural of “enjambment”: a poetic technique where a sentence runs on into the next line without a strong pause at the line break.","zh":"“Enjambments”是“enjambment”的复数：一种诗歌技巧，句子在行尾不断开，直接跨到下一行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In poetry, the continuation of a sentence or idea from one line to the next without a strong pause (like a period or comma) at the end of the line.","zh":"（诗歌中）“跨行延续/跨行”（enjambment）：一句话或一个意思在诗行末尾不断开（没有明显停顿或标点），而是直接延续到下一行。"},"examples":[{"en":"The poem uses enjambment to make the lines flow quickly into each other.","zh":"这首诗用“跨行延续”让诗行之间流动得更快。"},{"en":"Because of the enjambment, you have to read into the next line to complete the meaning.","zh":"由于有跨行延续，你必须读到下一行才能把意思读完整。"},{"en":"Try writing a stanza with enjambments to create a feeling of speed or urgency.","zh":"试着写一节带有跨行延续的诗，来营造速度感或紧迫感。"}]}],"synonyms":["run-on lines","line breaks with run-on syntax","unbroken phrasing"],"phonetic":"/ɛnˈdʒæm.mənts/","extraExplanation":["“Enjambment”源自法语 enjambement，字面有“跨步/跨越”的感觉：意思“跨过”了行尾。","阅读时不要只看每一行是否“结束”；更重要的是句法（句子结构）在哪里真正停顿。跨行延续常用来制造：紧迫感、口语感、意外转折（下一行才揭示关键信息）。","对比概念：end-stopped line（行末停顿/句子在行末结束）。如果行末有完整停顿（句号、分号或明确语义收束），通常就不是 enjambment。"]}
{"word":"enjelly","summary":{"en":"“Enjelly” is a rare verb meaning “to (make something) turn into jelly; to congeal or gel.”","zh":"“enjelly”是一个很少见的动词，意思是“（使）变成果冻状；凝固/胶凝”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare) To turn into jelly; to congeal or become gelatin-like.","zh":"（罕见）变成果冻状；凝固、胶凝。"},"examples":[{"en":"As the soup cooled, the fat began to enjelly on the surface.","zh":"汤冷却后，脂肪开始在表面凝结成胶状。"},{"en":"The sauce will enjelly if you add too much gelatin.","zh":"如果你加太多明胶，这个酱汁会凝成果冻状。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) To make something jelly-like; to cause to gel or set.","zh":"（罕见）使……变成果冻状；使凝固、胶凝。"},"examples":[{"en":"Chill the stock to enjelly it for aspic.","zh":"把高汤冷藏，让它凝固成冻菜（aspic）需要的胶状。"},{"en":"The cook used gelatin to enjelly the fruit juice.","zh":"厨师用明胶把果汁做成果冻状。"}]}],"synonyms":["gel","congeal","set","jellify","solidify"],"phonetic":"/ɪnˈdʒɛli/","extraExplanation":["“enjelly”在现代英语中非常少见，更常用的是“gel / congeal / set / jellify”。你可能会在较老的文学作品、食谱描写或带有幽默/夸张语气的写作中见到它。","构词上可以理解为“en-（使……进入某种状态）+ jelly（果冻/胶状物）”，表示“使变成胶状/凝固”。"]}
{"word":"enjeopard","summary":{"en":"Enjeopard is a rare/archaic verb meaning “to endanger; to put at risk.”","zh":"Enjeopard 是一个罕用/古语动词，意思是“使陷入危险；危及”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic/rare) To put (someone or something) in danger; to endanger.","zh":"（古语/罕用）使（某人或某物）处于危险之中；危及。"},"examples":[{"en":"Reckless driving can enjeopard your life and the lives of others.","zh":"鲁莽驾驶会危及你和他人的生命。"},{"en":"They feared that the decision would enjeopard the peace talks.","zh":"他们担心这个决定会危及和平谈判。"}]}],"synonyms":["endanger","jeopardize","put at risk","imperil"],"phonetic":"/ɪnˈdʒɛpɚd/","extraExplanation":["“enjeopard”是非常少见的词，多见于较旧的文学/法律语境。现代英语通常用更常见、更自然的表达：endanger / jeopardize / put ... at risk。","词源上可理解为 en-（使……处于某种状态）+ jeopard（危险）。其中“jeopard”本身在现代英语里也很少单独作动词使用。"]}
{"word":"enjeopardy","summary":{"en":"Jeopardy means danger or serious risk; most often you’ll see it in “in jeopardy” or “put … in jeopardy.”","zh":"Jeopardy 指“危险/严重风险”，最常见用法是 in jeopardy（处于危险中）和 put … in jeopardy（使……陷入危险）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"danger or risk of harm, loss, or failure","zh":"危险；风险（可能受到伤害、损失或失败的处境）"},"examples":[{"en":"The hikers were in jeopardy when the weather suddenly changed.","zh":"天气突然变化时，徒步者处于危险之中。"},{"en":"Cutting safety checks can put people’s lives in jeopardy.","zh":"减少安全检查会让人们的生命陷入危险。"}]},{"partOfSpeech":"phrase","definition":{"en":"(often in the phrase “in jeopardy”) in a situation where something important could be lost or harmed","zh":"（常用于短语“in jeopardy”）处在可能失去或受损的重要局面中"},"examples":[{"en":"If we miss the deadline, the whole project is in jeopardy.","zh":"如果我们错过截止日期，整个项目就有风险了。"},{"en":"Her scholarship was in jeopardy after her grades dropped.","zh":"她成绩下滑后，奖学金岌岌可危。"}]}],"synonyms":["danger","risk","peril","threat"],"phonetic":"/ˈdʒɛpɚdi/","extraExplanation":["你输入的“enjeopardy”不是常见拼写；最常用的是名词 **jeopardy**，以及固定搭配 **in jeopardy**（处于危险中/有失去的风险）。","词源上与“赌博、冒险”有关，所以它常带有“押上重要东西、可能失去”的语感。","常见搭配：**put (something) in jeopardy**（使……陷入危险/风险）、**be in jeopardy**（处于危险/岌岌可危）。"]}
{"word":"enjewel","summary":{"en":"“Enjewel” means to decorate something with jewels, or figuratively to make it look jewel-like and more beautiful.","zh":"“Enjewel”指用珠宝装饰或镶嵌；也可比喻把事物点缀得像宝石般更美。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to decorate or cover (something) with jewels; to set with gems","zh":"用珠宝装饰；镶嵌宝石于（某物）"},"examples":[{"en":"The crown was enjeweled with rubies and emeralds.","zh":"王冠上镶嵌着红宝石和绿宝石。"},{"en":"She wore an enjeweled necklace to the ceremony.","zh":"她在仪式上戴了一条镶宝石的项链。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to make something seem more beautiful or valuable, as if adorned with jewels","zh":"（比喻）使某物更美、更珍贵，仿佛被珠宝点缀"},"examples":[{"en":"Tiny lights enjeweled the city skyline at night.","zh":"夜里点点灯光像珠宝一样点缀着城市天际线。"},{"en":"Dewdrops enjeweled the grass in the early morning.","zh":"清晨的露珠像宝石一样装点着草地。"}]}],"synonyms":["bejeweled","adorn","embellish","decorate","garnish"],"phonetic":"/ɛnˈdʒuəl/","extraExplanation":["“enjewel”较偏文学/描写性用词，日常英语更常用“decorate with jewels”“bejeweled/adorned with jewels”。","词形来自“en-（使……）+ jewel（珠宝）”。在诗歌或散文中常用来描写光点、露珠、星光等“像宝石般点缀”的视觉效果。"]}
{"word":"enjoin","summary":{"en":"“Enjoin” means to formally order or strongly urge someone to do something, often used in legal or official contexts.","zh":"“enjoin”指以正式（常为法律或官方）方式命令某人做某事，也可指强烈劝告/敦促。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially tell or order someone to do something (often in writing or by law)","zh":"（常指以法律或正式书面方式）命令/要求某人做某事"},"examples":[{"en":"The judge enjoined the company to stop dumping waste into the river.","zh":"法官命令这家公司停止向河里倾倒废物。"},{"en":"The notice enjoins all visitors to wear safety helmets.","zh":"通知要求所有访客佩戴安全帽。"}]},{"partOfSpeech":"vt.","definition":{"en":"to strongly advise or urge someone to do something","zh":"强烈劝告；敦促某人做某事"},"examples":[{"en":"Her parents enjoined her to be careful when traveling alone.","zh":"她的父母强烈叮嘱她独自旅行时要小心。"},{"en":"The teacher enjoined the class to read widely.","zh":"老师敦促全班广泛阅读。"}]}],"synonyms":["order","command","instruct","direct","urge","admonish"],"phonetic":"/ɛnˈdʒɔɪn/","extraExplanation":["“enjoin”常见于正式/法律语境，语气比“ask”更强，比普通的“advise”更带有权威感。法律中常与“injunction（禁令）”相关：法院可能“enjoin”某方停止某行为或采取某行动。","词源上来自拉丁语，核心含义是“加在……之上、施加（义务）”，因此常带“职责/义务”的感觉。"]}
{"word":"enjoinder","summary":{"en":"Enjoinder is a rare legal noun meaning a court order (an injunction) requiring someone to do or stop doing something.","zh":"Enjoinder 是一个较罕见的法律名词，指法院命令（禁令），要求某人去做或停止做某事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legal order (usually from a court) that tells someone to do something or to stop doing something; an injunction.","zh":"（法律）法院发布的命令，要求某人去做或停止做某事；禁令。"},"examples":[{"en":"The judge issued an enjoinder to stop the company from using the trademark.","zh":"法官发布禁令，要求该公司停止使用该商标。"},{"en":"They asked for an enjoinder preventing the publication of private photos.","zh":"他们请求法院发布禁令，禁止刊登私人照片。"}]}],"synonyms":["injunction","court order","restraining order"],"phonetic":"/ɪnˈdʒɔɪndər/","extraExplanation":["“Enjoinder”在现代英语中非常少见，更常用的词是“injunction”。在很多语境里，你可以把enjoinder理解为injunction的较旧或较罕见的说法。","词源上与“enjoin”（命令、嘱咐）同源，因此常带有“权威命令”的语气，多见于法律或正式文体。"]}
{"word":"enjoinders","summary":{"en":"Enjoinders are strong commands—especially formal or legal orders, such as court orders to do or stop doing something.","zh":"Enjoinders 指强制性的命令，尤其是正式或法律上的命令（如法院要求做或停止做某事的裁定）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) A legal order (often a court order) that commands someone to do something or to stop doing something.","zh":"（法律）强制性的法律命令（常见为法院命令），要求某人去做某事或停止做某事。"},"examples":[{"en":"The judge issued enjoinders preventing the company from using the rival’s trademark.","zh":"法官发布了强制命令，禁止该公司使用竞争对手的商标。"},{"en":"After repeated violations, the court’s enjoinders became stricter.","zh":"在多次违规后，法院的强制命令变得更严格。"}]},{"partOfSpeech":"n.","definition":{"en":"A strong instruction or demand; the act of ordering someone to do something (less common).","zh":"强烈的指示或要求；命令他人去做某事的行为（较不常见）。"},"examples":[{"en":"Her enjoinders to be careful were ignored.","zh":"她一再要求大家小心，但被无视了。"},{"en":"Parents’ enjoinders about safety can feel repetitive to teenagers.","zh":"父母关于安全的叮嘱对青少年来说可能显得啰嗦。"}]}],"synonyms":["injunctions","orders","directives","commands","mandates"],"phonetic":"/ɪnˈdʒɔɪndɚz/","extraExplanation":["“enjoinders”是复数形式，单数是“enjoinder”。这个词在现代英语里偏正式、偏法律语境。日常交流中更常用的是“injunction（禁令）”或“order（命令/裁定）”。","在法律写作中，“enjoin”表示“命令/禁止”，因此“enjoinder”可理解为“命令（多指法院）”。不同法域与文体里，它可能被当作“injunction”的近义词使用，但常见度远低于“injunction”。"]}
{"word":"enjoined","summary":{"en":"“Enjoined” means “officially ordered/required,” or (in law) “officially forbidden by a court order.”","zh":"“Enjoined”表示“被正式命令/要求”，也可指（法律）“被法院下令禁止”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of “enjoin”) to officially tell someone to do something; to order or direct (often in a formal or legal way).","zh":"（enjoin 的过去式/过去分词）正式要求某人做某事；命令、指示（常用于正式或法律语境）。"},"examples":[{"en":"The judge enjoined the company to improve safety procedures.","zh":"法官命令该公司改进安全程序。"},{"en":"They were enjoined to remain silent about the investigation.","zh":"他们被要求对调查保持沉默。"}]},{"partOfSpeech":"vt.","definition":{"en":"(law) to officially forbid someone to do something, usually by a court order (an injunction).","zh":"（法律）通过法院命令正式禁止某人做某事（通常指禁令 injunction）。"},"examples":[{"en":"The factory was enjoined from dumping waste into the river.","zh":"该工厂被法院下令禁止向河里排放废物。"},{"en":"The protest group was enjoined from entering the private property.","zh":"该抗议团体被下令禁止进入私人土地。"}]}],"synonyms":["ordered","directed","required","commanded","instructed","forbade","prohibited"],"phonetic":"/ɪnˈdʒɔɪnd/","extraExplanation":["“enjoined”常见于法律与正式写作中，语气比“told/asked”更强，接近“ordered/required”。","法律用法里常见结构是“be enjoined from doing sth”（被禁止做……）或“be enjoined to do sth”（被命令/被要求做……）。","词源来自古法语/拉丁语，核心含义是“施加命令、义务”。在新闻与法庭报道里很常见。"]}
{"word":"enjoiner","summary":{"en":"An enjoiner is someone who officially orders or strongly urges a person to do (or stop doing) something.","zh":"enjoiner 指下达正式命令或强烈敦促他人做（或停止做）某事的人或机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or authority who enjoins something—i.e., who officially orders, instructs, or urges someone to do (or not do) something.","zh":"下令者；命令者；劝告/敦促者——指发布正式命令、指示或强烈要求他人做（或不做）某事的人或机构。"},"examples":[{"en":"In the court order, the judge acted as the enjoiner, requiring the company to stop the practice immediately.","zh":"在法院命令中，法官是下令者，要求公司立即停止该做法。"},{"en":"Some saw the principal as an enjoiner of discipline, reminding students to follow the rules.","zh":"有人把校长看作纪律的督促者，提醒学生遵守规定。"}]}],"synonyms":["commander","issuer (of an order)","authority","instructor","director"],"phonetic":"/ɪnˈdʒɔɪnɚ/","extraExplanation":["“Enjoiner”并不常用，更常见的表达是用动词“enjoin”（命令；嘱咐；要求）或用名词“the one who enjoins / the person who enjoins”。在法律语境中，“enjoin”常与禁令相关（例如“enjoin someone from doing something”表示“禁止某人做某事”），因此“enjoiner”多见于较正式或法律/行政文体。"]}
{"word":"enjoiners","summary":{"en":"“Enjoiners” means people who formally order or require others to do (or stop doing) something, often in legal or authoritative contexts.","zh":"“Enjoiners”指下令/强制要求他人做（或不做）某事的人，常见于法律或权威语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who enjoin (formally order or instruct) others to do something, especially by authority or law.","zh":"下令者；命令/强制要求他人做某事的人（尤指依靠权威或法律）。"},"examples":[{"en":"The judge and other enjoiners required the company to stop polluting the river.","zh":"法官等下令者要求该公司停止污染河流。"},{"en":"In the story, the king’s enjoiners demanded strict obedience from the villagers.","zh":"在故事中，国王的下令者要求村民绝对服从。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare, general plural form meaning “those who urge or strongly recommend something.”","zh":"（较少见）泛指“敦促者/强烈建议者”。"},"examples":[{"en":"Early enjoiners of the plan argued it would improve public safety.","zh":"该计划的早期敦促者认为它能提升公共安全。"}]}],"synonyms":["orderers","commanders","authorities","those who issue injunctions"],"phonetic":"/ɪnˈdʒɔɪnərz/","extraExplanation":["“enjoin”常见于正式或法律语境，意思是“命令、要求”。在法律英语里，常见搭配是“enjoin someone from doing something”（禁止某人做某事）或“enjoin someone to do something”（命令某人做某事）。","“enjoiners”这个复数名词在现代英语中不太常用；更常见的表达是用具体身份来说明，如“the court/judge ordered…”（法院/法官下令……）或“the authorities required…”（当局要求……）。"]}
{"word":"enjoining","summary":{"en":"“Enjoining” means formally ordering or strongly urging someone to do something, often in legal or official contexts.","zh":"“enjoining”指（以正式或法律方式）命令或强烈敦促某人做某事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle of enjoin) giving an authoritative order to someone; commanding.","zh":"（enjoin 的现在分词）命令某人做某事；郑重要求。"},"examples":[{"en":"The judge is enjoining the company to stop the illegal practice immediately.","zh":"法官正在命令该公司立即停止该违法行为。"},{"en":"Parents are enjoining their children to be careful online.","zh":"父母郑重叮嘱孩子上网要小心。"}]},{"partOfSpeech":"vt.","definition":{"en":"(present participle of enjoin) strongly urging or advising someone to do something (often in formal writing).","zh":"（enjoin 的现在分词）（较正式）强烈劝告/敦促某人做某事。"},"examples":[{"en":"The letter is enjoining all members to attend the meeting on time.","zh":"这封信敦促所有成员准时参加会议。"},{"en":"The guidebook keeps enjoining travelers to respect local customs.","zh":"这本指南不断劝告游客尊重当地习俗。"}]}],"synonyms":["ordering","commanding","requiring","urging","instructing"],"phonetic":"/ɪnˈdʒɔɪnɪŋ/","extraExplanation":["“enjoin”常见于法律与正式语体，语气比“ask/advise”更强，接近“order/require”。在法律语境里常与不定式连用：enjoin sb. to do sth.，也可表示法院发布禁令（injunction）要求某方停止或采取某行动。","词形提示：enjoining 是现在分词/动名词形式；过去式/过去分词为 enjoined。"]}
{"word":"enjoinment","summary":{"en":"Enjoinment means a formal command or requirement; less commonly, it can mean a legal injunction.","zh":"Enjoinment 指正式的命令或要求；较少情况下也可指法律上的禁令（injunction）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal instruction, command, or strong request that someone must follow; the act of ordering someone to do something.","zh":"正式的指示、命令或强烈要求；（对某人）下达必须遵守的指令的行为。"},"examples":[{"en":"The policy came with an enjoinment to protect customer privacy at all times.","zh":"该政策附带一项要求：任何时候都要保护客户隐私。"},{"en":"The coach’s enjoinment was clear: practice every day and stay disciplined.","zh":"教练的要求很明确：每天训练，保持自律。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law, less common) An injunction; a court order requiring someone to do or stop doing something.","zh":"（法律，较少见）禁令；法院命令，要求某人采取或停止某种行为。"},"examples":[{"en":"The judge issued an enjoinment preventing the company from releasing the disputed product.","zh":"法官发布禁令，禁止该公司发布有争议的产品。"},{"en":"They sought an enjoinment to stop construction until the environmental review was finished.","zh":"他们申请禁令，要求在环境评估完成前停止施工。"}]}],"synonyms":["command","order","directive","instruction","injunction"],"phonetic":"/ɪnˈdʒɔɪnmənt/","extraExplanation":["“enjoinment”在现代英语里相对少见，更常见的是动词“enjoin”（命令/要求）以及法律用语“injunction”（禁令）。在法律语境中如果你看到“enjoinment”，通常可以理解为“injunction”的近义表达。","注意不要和“enjoyment”（享受）混淆：拼写和发音相近，但含义完全不同。"]}
{"word":"enjoins","summary":{"en":"“Enjoins” means “formally orders/urges,” or in legal contexts “forbids or requires by court order.”","zh":"“enjoins”表示“正式命令/要求”，在法律语境中也可指“通过法院禁令禁止或要求某事”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to officially order or strongly tell someone to do something; to instruct or urge (often used in formal writing)","zh":"（正式地）命令/嘱咐某人做某事；强烈要求（常用于书面语）"},"examples":[{"en":"The teacher enjoins students to cite their sources carefully.","zh":"老师嘱咐学生要认真标注引用来源。"},{"en":"The contract enjoins both parties to keep the information confidential.","zh":"合同要求双方对信息保密。"}]},{"partOfSpeech":"v.","definition":{"en":"(law) to forbid or stop an action by issuing a legal order (an injunction)","zh":"（法律）通过禁令禁止或阻止某项行为"},"examples":[{"en":"The court enjoins the company from dumping waste into the river.","zh":"法院下令禁止该公司向河里倾倒废物。"},{"en":"The judge enjoins further construction until safety checks are completed.","zh":"法官下令在安全检查完成前暂停进一步施工。"}]}],"synonyms":["orders","directs","commands","urges","instructs","forbids","prohibits"],"phonetic":"/ɪnˈdʒɔɪnz/","extraExplanation":["“enjoin”很常见于正式语境，尤其是法律和规章制度中。法律含义常与“injunction（禁令）”一起出现：to enjoin = 以法院命令禁止/要求某事。","常见搭配：enjoin someone to do something（要求某人做某事）；enjoin someone from doing something（禁止某人做某事）。"]}
{"word":"enjoy","summary":{"en":"“Enjoy” means to take pleasure in something, to have a benefit, or as a friendly “Enjoy!” to wish someone a good experience.","zh":"“Enjoy”可表示“享受/喜欢”，也可表示“享有（好处）”，还可作礼貌祝福语“祝你玩得开心/请慢用”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To get pleasure from something; to like doing or experiencing it.","zh":"享受；从……中获得乐趣；喜欢做或体验某事。"},"examples":[{"en":"I really enjoy reading before bed.","zh":"我很享受睡前阅读。"},{"en":"Did you enjoy the movie?","zh":"你喜欢那部电影吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"To have something good as a benefit or advantage (often followed by a noun like “freedom,” “support,” or “success”).","zh":"享有；拥有（某种好处或优势，常接“自由/支持/成功”等名词）。"},"examples":[{"en":"The city enjoys a warm climate all year.","zh":"这座城市全年享有温暖的气候。"},{"en":"She enjoys strong support from her team.","zh":"她得到了团队的强力支持。"}]},{"partOfSpeech":"v.","definition":{"en":"Used as a polite expression meaning “I hope you like it,” especially when giving something or ending a message: “Enjoy!”","zh":"（礼貌用语）“祝你玩得开心/祝你用得愉快/请慢用！”常用于递东西或结束信息：Enjoy!。"},"examples":[{"en":"Here’s your coffee—enjoy!","zh":"你的咖啡，请慢用！"},{"en":"Enjoy your trip!","zh":"祝你旅途愉快！"}]}],"synonyms":["like","take pleasure in","appreciate","relish"],"phonetic":"/ɪnˈdʒɔɪ/","extraExplanation":["“Enjoy”后面常接名词或动名词（-ing）：enjoy music / enjoy swimming。英语里一般不说“enjoy to do”。","口语里“Enjoy!”很常见，语气通常友好；在餐厅服务员说“Enjoy!”相当于“请慢用”。"]}
{"word":"enjoyable","summary":{"en":"Enjoyable describes something that is pleasant and gives you enjoyment.","zh":"Enjoyable 用来形容“令人愉快、让人享受”的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"pleasant and giving you enjoyment; fun or satisfying","zh":"令人愉快的；让人享受的；好玩的/令人满足的"},"examples":[{"en":"The movie was simple, but very enjoyable.","zh":"这部电影情节简单，但非常好看、很享受。"},{"en":"We had an enjoyable evening chatting with friends.","zh":"我们和朋友聊天，度过了一个愉快的夜晚。"},{"en":"Reading in the park is enjoyable when the weather is nice.","zh":"天气好的时候，在公园读书很惬意。"}]}],"synonyms":["pleasant","fun","delightful","agreeable","entertaining"],"phonetic":"/ɪnˈdʒɔɪəbəl/","extraExplanation":["“enjoyable”来自动词“enjoy”（享受/喜欢）+ 形容词后缀“-able”（能够……的/值得……的）。意思是“能让人享受的”。","常见搭配：an enjoyable experience/time/evening（愉快的经历/时光/夜晚），make something enjoyable（让某事变得有趣/更好享受）。","语气上比“fun”更正式一点，也更广泛：不仅指“好玩”，也可以指“舒服、令人满意”。"]}
{"word":"enjoyableness","summary":{"en":"Enjoyableness means the quality of being enjoyable—how pleasant or fun something is.","zh":"Enjoyableness 指“令人愉快、好玩”的性质，即某事有多好享受、愉悦程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being enjoyable; how pleasant or fun something is","zh":"愉快性；可享受的程度；令人愉悦/好玩的特质"},"examples":[{"en":"The enjoyableness of the trip depended on the weather and the company.","zh":"这次旅行的愉快程度取决于天气和同伴。"},{"en":"Good music can increase the enjoyableness of a long drive.","zh":"好音乐能提升长途开车的愉快感。"},{"en":"She cares about the enjoyableness of the class, not just the test scores.","zh":"她在意这门课的趣味性，而不只是考试分数。"}]}],"synonyms":["enjoyment","pleasantness","agreeableness","fun","delight"],"phonetic":"/ɪnˈdʒɔɪəbəlnəs/","extraExplanation":["“enjoyableness”= enjoy（享受）+ -able（可……的）+ -ness（……的性质）。日常英语里更常用的替代表达是“enjoyment”（享受、乐趣）或“how enjoyable it is / the level of enjoyment”（有多好玩/多愉快）。","语体上，“enjoyableness”偏正式、偏书面或学术（例如评价体验、产品、课程的“愉悦度/可享受性”）。口语里用“fun,” “pleasant,” “enjoyable,” 或 “I really enjoyed it.” 更自然。"]}
{"word":"enjoyably","summary":{"en":"Enjoyably means “in a pleasant or enjoyable way.”","zh":"Enjoyably 表示“以愉快/令人享受的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a pleasant, fun, or satisfying way.","zh":"愉快地；令人享受地；惬意地。"},"examples":[{"en":"We spent the afternoon enjoyably at the park.","zh":"我们在公园里愉快地度过了一个下午。"},{"en":"The book is written simply and enjoyably.","zh":"这本书写得简洁又好读。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that gives pleasure or entertainment; agreeably.","zh":"以让人感到快乐或有趣的方式；惬意地。"},"examples":[{"en":"She chatted enjoyably with her classmates after dinner.","zh":"晚饭后她和同学聊得很开心。"},{"en":"The class passed enjoyably because the teacher used games.","zh":"因为老师用了游戏，这节课过得很有趣。"}]}],"synonyms":["pleasantly","happily","agreeably","delightfully","enjoyabley (common misspelling)"],"phonetic":"/ɪnˈdʒɔɪəbli/"}
{"word":"enjoyed","summary":{"en":"“Enjoyed” is the past tense/past participle of “enjoy,” meaning you liked something or had pleasure from it.","zh":"“enjoyed”是“enjoy”的过去式/过去分词，表示喜欢某事或从中获得乐趣。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “enjoy”: to get pleasure from something; to like an experience, activity, or situation.","zh":"“enjoy”的过去式和过去分词：从某事中获得乐趣；喜欢某种经历、活动或状态。"},"examples":[{"en":"I really enjoyed the movie last night.","zh":"我昨晚真的很享受（很喜欢）那部电影。"},{"en":"She enjoyed working with her new team.","zh":"她很喜欢和新团队一起工作。"},{"en":"We enjoyed a quiet weekend at home.","zh":"我们在家度过了一个安静而愉快的周末。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective in some contexts) liked or taken pleasure in; appreciated.","zh":"（在某些语境中作形容词）被喜欢的；令人愉快并被享受/欣赏的。"},"examples":[{"en":"It was a well-enjoyed tradition in our family.","zh":"那是我们家里一个大家都很喜欢的传统。"},{"en":"Her talk was widely enjoyed by the audience.","zh":"她的演讲受到观众的广泛喜爱。"}]}],"synonyms":["liked","loved","relished","appreciated","took pleasure in"],"phonetic":"/ɪnˈdʒɔɪd/","extraExplanation":["“enjoyed”常见两种用法：\n1) 一般过去时：I enjoyed…（我当时很喜欢/很享受）\n2) 现在完成时或被动语态的过去分词：I have enjoyed… / It is enjoyed by…（已经很享受/被大家喜爱）\n另外，“enjoy”后面常接名词或动名词（enjoy doing），不常直接接不定式（×enjoy to do）。"]}
{"word":"enjoyer","summary":{"en":"An “enjoyer” is someone who enjoys or is a fan of something, often used casually or humorously online.","zh":"“enjoyer”指享受某事或某物的爱好者/粉丝，常用于口语或网络语境，语气轻松甚至带幽默。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who enjoys something; someone who takes pleasure in a particular activity, thing, or type of content.","zh":"享受……的人；爱好者；喜欢……的人（指从某种活动、事物或内容中获得乐趣的人）。"},"examples":[{"en":"She’s a coffee enjoyer and likes trying beans from different countries.","zh":"她是个咖啡爱好者，喜欢尝试不同国家的咖啡豆。"},{"en":"I’m not a big sports enjoyer, but I’ll watch the final with friends.","zh":"我不算是体育爱好者，但我会和朋友一起看决赛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Internet slang, often humorous) A fan or supporter of something, sometimes used to contrast with “hater.”","zh":"（网络俚语，常带幽默语气）某事物的粉丝/支持者，有时用来与“hater（讨厌者）”对比。"},"examples":[{"en":"I’m a sunscreen enjoyer—wear it every day.","zh":"我是防晒霜的忠实拥护者——每天都用。"},{"en":"Be a solution enjoyer, not a problem hater.","zh":"做“解决方案的支持者”，别当“问题的讨厌者”。"}]}],"synonyms":["fan","lover","enthusiast","supporter"],"phonetic":"/ɪnˈdʒɔɪ.ɚ/","extraExplanation":["“enjoyer”是由动词“enjoy（享受）”加后缀“-er（做某事的人）”构成的名词。传统书面语里更常见的是“fan / lover / enthusiast”，而“enjoyer”在日常口语和网络语境中更常见，语气往往更轻松、带点梗。","在网络上，“X enjoyer”常用来表达一种身份认同或态度（有时略夸张），例如“tea enjoyer”“quiet-life enjoyer”。正式写作中建议改用“enthusiast/lover/supporter”。"]}
{"word":"enjoyers","summary":{"en":"“Enjoyers” means people who enjoy something—fans, enthusiasts, or (online) a humorous self-label like “coffee enjoyers.”","zh":"“enjoyers”指喜欢某事物的人——爱好者/拥护者；网络上也常用作幽默的自我标签，如“coffee enjoyers（咖啡爱好者）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who enjoy something; fans or enthusiasts of a particular activity, thing, or idea.","zh":"喜欢某事物的人；某个活动/事物/观点的爱好者、拥护者。"},"examples":[{"en":"Coffee enjoyers often have strong opinions about brewing methods.","zh":"咖啡爱好者常常对冲泡方法有很强的看法。"},{"en":"This book club is a friendly space for mystery enjoyers.","zh":"这个读书会对推理小说爱好者很友好。"}]},{"partOfSpeech":"n.","definition":{"en":"(Internet slang) People who identify themselves as liking something, often used humorously in phrases like “X enjoyers.”","zh":"（网络用语）自称喜欢某物的一群人，常带幽默语气，用在“X enjoyers（X爱好者）”这类说法中。"},"examples":[{"en":"Spicy food enjoyers, what’s your favorite hot sauce?","zh":"爱吃辣的朋友们，你最喜欢哪种辣酱？"},{"en":"Early-morning enjoyers know how peaceful the city feels at sunrise.","zh":"喜欢早起的人知道日出时城市有多安静。"}]}],"synonyms":["fans","enthusiasts","lovers","supporters","admirers"],"phonetic":"/ɪnˈdʒɔɪər/","extraExplanation":["“enjoyer”来自动词 enjoy（享受、喜欢）+ 表示“……的人”的后缀 -er。复数为 enjoyers。","在英语网络文化里，“X enjoyer”常是一种轻松的自我标签，表示“我就是喜欢X的那种人”，有时也带一点调侃或群体认同感。"]}
{"word":"enjoying","summary":{"en":"“Enjoying” means taking pleasure in something right now, or (more formally) benefiting from something.","zh":"“Enjoying”表示正在享受/喜欢某事；也可更正式地表示“享有、获得（某种好处/支持）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"taking pleasure in something; feeling happy about an experience (present participle/gerund of “enjoy”).","zh":"正在享受（某事）；从某种经历中感到快乐（“enjoy”的现在分词/动名词）。"},"examples":[{"en":"She is enjoying the quiet morning with a cup of coffee.","zh":"她正喝着咖啡享受安静的早晨。"},{"en":"I’m enjoying this book more than I expected.","zh":"这本书比我想的更好看，我很享受。"},{"en":"Enjoying time with family can help you feel less stressed.","zh":"享受与家人在一起的时光能帮助你减轻压力。"}]},{"partOfSpeech":"v.","definition":{"en":"using or having something as a benefit or advantage (often in formal writing).","zh":"享有；拥有（某种利益或优势，常见于较正式的语境）。"},"examples":[{"en":"The city is enjoying rapid economic growth.","zh":"这座城市正享有快速的经济增长。"},{"en":"The policy is enjoying broad public support.","zh":"这项政策正获得广泛的公众支持。"}]}],"synonyms":["taking pleasure in","liking","having fun","relishing","appreciating","benefiting from"],"phonetic":"/ɪnˈdʒɔɪɪŋ/","extraExplanation":["“enjoying”常用于进行时（be enjoying）表示“此刻正在享受/喜欢”，也可作动名词放在句首或作宾语：Enjoying nature is good for your health（享受大自然有益健康）。","口语中“Enjoy!”常被用作告别语或服务用语，意思是“祝你玩得开心/祝你用餐愉快”，带有礼貌的祝愿色彩。"]}
{"word":"enjoyingly","summary":{"en":"“Enjoyingly” means “in an enjoyable way,” but it’s uncommon; “enjoyably” is usually more natural.","zh":"“enjoyingly”意为“愉快地/以令人享受的方式”，但不常用；更自然的表达通常是“enjoyably”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is enjoyable or pleasant; pleasantly.","zh":"以令人愉快的方式；愉快地。"},"examples":[{"en":"We spent the afternoon enjoyingly chatting and listening to music.","zh":"我们愉快地聊天、听音乐，度过了一个下午。"},{"en":"The course is taught enjoyingly, with games and simple stories.","zh":"这门课教得很有趣，会用游戏和简单故事来讲。"}]}],"synonyms":["enjoyably","pleasantly","delightfully"],"phonetic":"/ɪnˈdʒɔɪ.ɪŋ.li/","extraExplanation":["“enjoyingly”这个副词在现代英语里不算常用，更自然的说法通常是 “enjoyably” 或 “in an enjoyable way”。例如：The movie is enjoyably funny.（这部电影好笑得让人很享受。）","词形来源：enjoy（享受）+ -ing（构成形容词 enjoyable）+ -ly（构成副词）。不过英语里更固定、更常见的副词搭配是 enjoyable → enjoyably。"]}
{"word":"enjoyment","summary":{"en":"Enjoyment means the pleasure or satisfaction you feel, or the pleasant act of experiencing something.","zh":"enjoyment 指“愉快/满足感”，也可指“带着愉快去体验或使用某物的行为”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pleasure, happiness, or satisfaction you feel when something is fun or pleasing.","zh":"享受；愉快；满足感（做某事时感到开心或舒适的感觉）"},"examples":[{"en":"Reading is one of my simple enjoyments in life.","zh":"阅读是我生活中一种简单的享受。"},{"en":"She smiled with quiet enjoyment as she listened to the music.","zh":"她听着音乐，带着安静的愉悦微笑着。"},{"en":"For your own enjoyment, take a short break.","zh":"为了让自己舒服一点/享受一下，休息一会儿吧。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of using or experiencing something with pleasure.","zh":"享用；欣赏；体验（带着愉快地使用或体验某物的行为）"},"examples":[{"en":"The park is open for public enjoyment.","zh":"这座公园对公众开放，供大家游玩/享用。"},{"en":"This room is reserved for the enjoyment of guests.","zh":"这个房间是为客人使用/享用而预留的。"}]}],"synonyms":["pleasure","delight","satisfaction","fun (more informal)","joy"],"phonetic":"/ɪnˈdʒɔɪmənt/","extraExplanation":["“enjoyment”常用于比较正式的语境（如公共设施、服务说明）：for public enjoyment（供公众享用）。日常口语里也常说“fun/pleasure”。","搭配很常见：get/enjoy enjoyment from…（从……中获得乐趣）；a source of enjoyment（乐趣的来源）；pure/simple enjoyment（纯粹/简单的享受）。"]}
{"word":"enjoyments","summary":{"en":"“Enjoyments” means pleasures or the experience of enjoying things, especially when talking about different kinds of happiness in life.","zh":"“Enjoyments”指“乐趣/享受”，常用于强调生活中不同种类的快乐与满足。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pleasures or things/activities that give you happiness and satisfaction.","zh":"乐趣；享受；让人感到快乐与满足的事物或活动。"},"examples":[{"en":"Simple enjoyments like reading and taking walks can make life feel richer.","zh":"读书、散步这类简单的乐趣会让生活更充实。"},{"en":"She found enjoyments in cooking for friends and listening to music.","zh":"她的乐趣在于为朋友做饭、听音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"The experience or state of enjoying something; enjoyment (often in a more formal tone).","zh":"享受（某事）的体验或状态；愉悦感（较正式用法）。"},"examples":[{"en":"The goal of the trip was rest and quiet enjoyments.","zh":"这次旅行的目的就是休息与安静的享受。"},{"en":"He spoke about the enjoyments of learning a new language.","zh":"他谈到了学习一门新语言的乐趣。"}]}],"synonyms":["pleasures","delights","joys","satisfactions"],"phonetic":"/ɪnˈdʒɔɪmənts/","extraExplanation":["“Enjoyments”是名词复数，单数是“enjoyment”。复数常用于强调“多种乐趣/多方面的享受”，语气比单数更具体、更生活化。","在较正式或书面语中，有时会看到“the enjoyments of …（……的乐趣）”这种结构，用来概括某件事带来的愉悦与满足。"]}
{"word":"enjoys","summary":{"en":"“Enjoys” means “likes/gets pleasure from” or “benefits from,” used with he/she/it in the present tense.","zh":"“Enjoys”是“enjoy”的第三人称单数，表示“享受/喜爱”或“享有（好处）”，用于一般现在时的he/she/it。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “enjoy”) to take pleasure in something; to like doing or experiencing something.","zh":"（“enjoy”的第三人称单数）享受；喜爱（做某事或经历某事）。"},"examples":[{"en":"She enjoys reading before bed.","zh":"她喜欢睡前读书。"},{"en":"He really enjoys spicy food.","zh":"他非常喜欢辣的食物。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “enjoy”) to get a benefit or advantage from something.","zh":"（“enjoy”的第三人称单数）享有；获得（某种好处或优势）。"},"examples":[{"en":"The city enjoys a warm climate most of the year.","zh":"这座城市一年中大部分时间都享有温暖的气候。"},{"en":"Employees enjoy flexible working hours.","zh":"员工享有弹性工作时间。"}]}],"synonyms":["likes","takes pleasure in","relishes","appreciates","benefits from","has the advantage of"],"phonetic":"/ɪnˈdʒɔɪ/","extraExplanation":["“enjoys”是一般现在时的第三人称单数形式，用在he/she/it或单数名词后：He enjoys… / My sister enjoys…","常见搭配：enjoy + 名词（enjoy music/coffee）或 enjoy + 动词-ing（enjoy reading/traveling）。","语气上，“enjoy”通常表示比较积极、真正的愉快；如果只是“觉得还行/愿意”，也可以用“like”。"]}
