{"word":"enmagazine","summary":{"en":"A magazine is usually a periodical publication; in weapon contexts, it can also mean a cartridge container in a gun.","zh":"magazine通常指“杂志/期刊”；在武器语境中也可指“弹匣/弹夹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a regular publication (print or digital) with articles, photos, and advertisements, usually about particular topics (news, fashion, sports, etc.)","zh":"杂志；期刊（定期出版的纸质或电子刊物，含文章、图片和广告，常有特定主题）"},"examples":[{"en":"I read a science magazine every month.","zh":"我每个月都会读一本科学杂志。"},{"en":"She writes articles for a fashion magazine.","zh":"她为一本时尚杂志写文章。"},{"en":"This magazine has an online edition, too.","zh":"这本杂志也有线上版。"}]},{"partOfSpeech":"n.","definition":{"en":"a container in a gun that holds cartridges and feeds them into the firearm","zh":"（枪的）弹匣；弹夹（装子弹并将其送入枪械的装置）"},"examples":[{"en":"The officer removed the magazine from the handgun.","zh":"警官从手枪上取下了弹匣。"},{"en":"This rifle uses a detachable magazine.","zh":"这把步枪使用可拆卸弹匣。"}]}],"synonyms":["periodical","journal","publication","(weapon) ammo magazine"],"phonetic":"/ˌmæɡəˈzin/","extraExplanation":["“magazine”最早来自阿拉伯语 *makhāzin*（意为“仓库/储藏处”），因此它既可指“信息的集合”（杂志），也可指“弹药的储藏处”（弹匣）。","在日常英语里不加说明时，magazine通常指“杂志”；谈到武器语境时才常指“弹匣”。"]}
{"word":"enmanche","summary":{"en":"“En masse” means “all together; as a group; in large numbers.”","zh":"“en masse”表示“集体地、一起；大量地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Likely intended) as a group; all together; in large numbers.","zh":"（可能是你想写的）集体地；一起；成群地；大量地。"},"examples":[{"en":"The audience stood up en masse when the singer returned.","zh":"歌手回到舞台时，观众集体起立。"},{"en":"People left the city en masse after the storm warning.","zh":"暴风预警后，人们成群结队地离开了这座城市。"}]}],"synonyms":["collectively","all together","in a group","in large numbers"],"phonetic":"ɑn ˈmæs","extraExplanation":["“enmanche”本身不是常见英语词。它看起来像把法语短语写在一起了。英语里更常见、拼写很接近且意义常被需要的表达是 **en masse**（集体地、一起）。","如果你其实想写法语 **La Manche**（英语称 *the English Channel*，英吉利海峡），那是地名语境，不是英语里的常用词汇形式。你可以告诉我你想表达的句子，我能帮你确定正确拼写与用法。"]}
{"word":"enmarble","summary":{"en":"“Enmarble” means to cover or decorate with marble, or (literarily) to make something marble-like and statue-cold.","zh":"“Enmarble”指用大理石覆盖/装饰，或（文学用法）使之如大理石般冷硬、雕像化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cover, decorate, or build something with marble; to give something a marble-like appearance.","zh":"用大理石覆盖、装饰或建造；使呈现大理石般的外观。"},"examples":[{"en":"The lobby columns were enmarbled to make the building feel grander.","zh":"大厅的柱子用大理石装饰，以让建筑显得更气派。"},{"en":"They plan to enmarble the entrance wall with white stone and gray veins.","zh":"他们计划用带灰色纹理的白色石材把入口墙面做成大理石效果。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common, literary) to turn into marble; to make something hard, cold, or statue-like in feeling.","zh":"（较少见，偏文学）使变成大理石；使情感变得冷硬、如雕像般。"},"examples":[{"en":"Grief seemed to enmarble his face, leaving no expression.","zh":"悲伤仿佛让他的脸“石化”成大理石般，毫无表情。"},{"en":"Time can enmarble a moment into memory.","zh":"时间会把某一刻“凝成”如大理石般的记忆。"}]}],"synonyms":["clad in marble","cover with marble","marble","face with marble","veneering (with marble)"],"phonetic":"/ɛnˈmɑr.bəl/","extraExplanation":["“enmarble”由前缀 en-（表示“使……处于某种状态/加上……”）+ marble（大理石）构成，属于较少见的书面用词。更常见的表达有：to cover with marble / to clad in marble / to marble（使呈大理石纹）。","在文学语境里，“enmarble”常用于比喻，强调情感或表情变得冷硬、固定，像雕像一样不易改变。"]}
{"word":"enmarbled","summary":{"en":"“Enmarbled” means covered or decorated with marble, or having a marble-like appearance (rare, literary).","zh":"“Enmarbled”指被大理石覆盖/装饰，或呈现大理石般外观（较少见、偏文学用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered, inlaid, or surrounded with marble; made to look like marble.","zh":"被大理石覆盖的；镶嵌/包裹着大理石的；（外观）仿大理石纹的。"},"examples":[{"en":"The tomb was enmarbled with white stone that reflected the candlelight.","zh":"那座坟墓被白色大理石包裹着，烛光映在上面闪闪发亮。"},{"en":"An enmarbled hall can feel cool and formal, even in summer.","zh":"铺着大理石的大厅即使在夏天也会让人感觉清凉而庄重。"}]}],"synonyms":["marble-clad","marble-lined","marbled","encased in marble","faced with marble"],"phonetic":"/ɛnˈmɑr.bəld/","extraExplanation":["“enmarbled”比较少见，常用于较文学化的描写（如建筑、墓碑、宫殿等）。日常英语里更常说“marble-lined”（大理石镶边/铺面的）、“marble-clad”（大理石包覆的）、“marbled”（有大理石纹的/大理石般的）。","前缀“en-”有“使…处于…之中/用…覆盖”的感觉（如“encase”“encrust”）。因此“enmarbled”带有“被大理石包起来/使之呈大理石化”的意象。"]}
{"word":"enmarbling","summary":{"en":"Enmarbling is a rare word meaning “making something look marbled,” often used in descriptive or artistic contexts.","zh":"Enmarbling 是个较罕见的词，意思是“让某物呈现大理石纹/像大理石一样”，多见于描写或艺术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the act of giving something a marble-like pattern (veins or streaks), as if decorating it with marble.","zh":"（罕见）使某物呈现大理石般的纹理（纹路、条纹）的行为；仿佛用大理石纹装饰。"},"examples":[{"en":"The artist used ink washes for enmarbling the paper with soft gray veins.","zh":"那位艺术家用墨色晕染，让纸张呈现柔和的灰色大理石纹。"},{"en":"Light and shadow seemed to be enmarbling the walls in the old hallway.","zh":"光影仿佛在老走廊的墙面上“铺出”大理石般的纹路。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) present participle of “enmarble”: to mark or decorate with marble-like veins; to make something look as if it were marble.","zh":"（罕见）“enmarble”的现在分词：使呈现大理石状纹路；使看起来像大理石。"},"examples":[{"en":"Minerals are enmarbling the rock over thousands of years.","zh":"矿物质经过数千年在岩石中形成大理石般的纹理。"},{"en":"She is enmarbling the clay to create a stone-like finish.","zh":"她正在给黏土做大理石纹处理，做出类似石材的效果。"}]}],"synonyms":["marbling","mottling","veining","streaking"],"phonetic":"/ɛnˈmɑrblɪŋ/","extraExplanation":["“enmarbling”不是常见词，更常见的是“marbling”（大理石纹；肉的雪花纹）或动词“to marble”（使呈现大理石纹）。在文学或描写性写作里，作者有时会用带“en-”的造词（如 encrust, enclose）来强调“使……带上/覆盖上某种特征”，因此“enmarble/enmarbling”带有一种更具修辞色彩的“赋予大理石般质感/纹路”的感觉。","如果你想表达牛排的“雪花纹”，日常英语最自然的是：“The beef has beautiful marbling.”（这块牛肉雪花纹很漂亮）。"]}
{"word":"enmask","summary":{"en":"Enmask means to mask or disguise, often in a literary/formal style.","zh":"Enmask 指“戴上面具、遮掩或伪装”，多用于文学或较正式的表达。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put a mask on someone or something; to cover or disguise (often used in a literary or formal style)","zh":"给……戴上面具；遮掩、伪装（多见于文学或较正式语体）"},"examples":[{"en":"In the play, the villain enmasked himself before entering the ballroom.","zh":"在戏剧里，反派在进入舞厅前给自己戴上了面具。"},{"en":"Fog enmasked the coastline, hiding the ships from view.","zh":"浓雾遮住了海岸线，使船只难以看见。"}]}],"synonyms":["mask","cover","disguise","conceal","hide"],"phonetic":"/ɛnˈmæsk/","extraExplanation":["“en-”是一个常见前缀，表示“使……处于某种状态/放入……之中”（如: enable, encircle）。因此 enmask = “使……戴上面具/遮蔽起来”。","enmask 在现代日常英语中比较少见，更常用的表达是 mask、cover、disguise。","文学语境里常把雾、黑暗等当作“面具”来写：如 “Darkness enmasked the street.” 这种拟人化表达更有画面感。"]}
{"word":"enmass","summary":{"en":"“En masse” means “all together as a group.”","zh":"“en masse”表示“集体地、一起（成群地）”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(of people or things) all together as a group, not separately.","zh":"（人或事物）一起、集体地；不是一个一个地。"},"examples":[{"en":"The students left the classroom en masse after the bell rang.","zh":"铃声一响，学生们就集体离开了教室。"},{"en":"Fans arrived en masse to support the team.","zh":"球迷们成群结队地到场支持球队。"},{"en":"People began buying masks en masse during the outbreak.","zh":"疫情期间，人们开始大规模地购买口罩。"}]}],"synonyms":["all together","as a group","in a body","collectively","in large numbers"],"phonetic":"ɑn ˈmæs","extraExplanation":["“en masse”来自法语，意思是“作为一个整体”。英语里常用于新闻或较正式的语境。","常见拼写是“en masse”（两个词）。你写的“enmass”通常被视为拼写错误；少数情况下会作为非正式/品牌用法出现，但不推荐。","用法提示：多修饰动作（arrive/leave/vote/quit/buy等），强调“很多人同时做同一件事”。与“in mass”不同；“in mass”更偏“整体上/总的来说”，现在较少见。"]}
{"word":"enmesh","summary":{"en":"Enmesh means to entangle physically in a net/mesh or to become deeply caught in a complicated situation.","zh":"Enmesh 指被网状物缠住，或（比喻）深陷复杂局势/纠葛而难以脱身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trap or entangle someone or something in a net, mesh, or complicated situation so it is hard to get free","zh":"用网/网状物缠住；（比喻）使陷入错综复杂的局势而难以脱身"},"examples":[{"en":"The dolphin became enmeshed in a fishing net and couldn’t swim away.","zh":"那只海豚被渔网缠住，游不走了。"},{"en":"Be careful not to get enmeshed in office politics.","zh":"小心别陷入办公室政治的纠葛里。"},{"en":"The two cyclists’ wheels enmeshed, and they both fell.","zh":"两位骑行者的车轮卡在一起，两人都摔倒了。"}]}],"synonyms":["entangle","snare","trap","ensnare","embroil"],"phonetic":"/ɛnˈmɛʃ/","extraExplanation":["“en-”是一个常见前缀，表示“使进入某种状态/使……化”，因此 enmesh 字面意思就是“使……进入网（mesh）中”。","mesh 原意是“网眼/网状结构”；在新闻和文学里，enmeshed 常用于比喻：被关系、规则、官司、阴谋等“缠住”，强调越挣扎越难脱身的感觉。"]}
{"word":"enmeshed","summary":{"en":"Enmeshed means tightly tangled or deeply involved, often in a complicated situation.","zh":"enmeshed 指被紧紧缠住，或深陷于复杂处境之中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Tightly involved with something (often in a complicated, hard-to-escape situation or relationship).","zh":"与某事紧密纠缠在一起（常指复杂、难以脱身的处境或关系）。"},"examples":[{"en":"The company became enmeshed in legal problems after the scandal.","zh":"丑闻之后，这家公司陷入了法律纠纷之中。"},{"en":"She was enmeshed in a toxic friendship and didn’t know how to leave.","zh":"她被一段有毒的友谊纠缠住了，不知道该怎么离开。"}]},{"partOfSpeech":"adj.","definition":{"en":"Caught or tangled in a net, web, or other trapping material.","zh":"被网、蛛网或其他捕捉物缠住／困住。"},"examples":[{"en":"The bird was enmeshed in the fishing line.","zh":"那只鸟被钓鱼线缠住了。"},{"en":"In the story, the hero finds travelers enmeshed in a giant spider’s web.","zh":"在故事里，英雄发现旅人被巨蜘蛛网困住了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “enmesh”: to entangle, trap, or involve someone/something deeply.","zh":"“enmesh”的过去式：使缠住、困住，或使深陷其中。"},"examples":[{"en":"The debate enmeshed everyone in details that were hard to understand.","zh":"这场辩论把所有人都卷进了难以理解的细节里。"},{"en":"He was enmeshed by a clever scheme.","zh":"他被一个巧妙的骗局套住了。"}]}],"synonyms":["entangled","caught up","involved","embroiled","trapped"],"phonetic":"/ɪnˈmɛʃt/","extraExplanation":["“enmeshed”既可用于字面（被网/线缠住），也常用于比喻（陷入麻烦、政治斗争、复杂人际关系）。在新闻与学术写作中很常见，语气通常偏正式。","常见搭配：become/get enmeshed in trouble/politics/a dispute；be enmeshed with/in a network of relationships。与“involved”相比，“enmeshed”更强调“纠缠、难以脱身”。"]}
{"word":"enmeshes","summary":{"en":"“Enmeshes” (from “enmesh”) means traps or deeply involves someone/something so it’s hard to escape.","zh":"“enmeshes”（来自 enmesh）指把人或物缠住、困住，或使其深陷某种复杂局面难以脱身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trap, catch, or entangle someone or something (often in a net, system, or complicated situation)","zh":"使（某人/某物）陷入、缠住、困住（常指被网、体系或复杂局面缠住）"},"examples":[{"en":"The fishing line enmeshes the hook in seaweed.","zh":"鱼线把鱼钩缠在海藻里。"},{"en":"The scandal enmeshes several officials in a long investigation.","zh":"这起丑闻让几名官员卷入了长期调查。"}]},{"partOfSpeech":"vt.","definition":{"en":"to involve someone deeply in a relationship, conflict, or problem so it becomes hard to get out","zh":"使（某人）深陷于关系、冲突或麻烦之中，难以脱身"},"examples":[{"en":"He enmeshes himself in other people’s drama.","zh":"他总把自己卷进别人的闹剧里。"},{"en":"The new policy enmeshes small businesses in extra paperwork.","zh":"新政策让小企业陷入更多文书手续之中。"}]}],"synonyms":["entangles","traps","snarls","ensnares","embroils"],"phonetic":"/ɛnˈmɛʃ/","extraExplanation":["“enmesh”原意与“网（mesh）”有关：mesh 指网眼/网状结构，en- 有“使……进入/使……成为”的意思，所以 enmesh 常带有“像被网缠住”那种难以摆脱的感觉。日常中既可指真实的缠住，也常作比喻（卷入复杂局势）。"]}
{"word":"enmeshing","summary":{"en":"Enmeshing means becoming involved or trapped in something complex, like a tangled net; it can also describe things that are tightly intertwined.","zh":"Enmeshing 指（像被网缠住一样）卷入或陷入复杂情境/关系，也可形容事物相互交织、纠缠。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to involve or trap someone/something in a complicated situation, relationship, or system so it becomes hard to escape","zh":"使卷入；使陷入（复杂的处境、关系或体系中），难以脱身"},"examples":[{"en":"The scandal ended up enmeshing several senior officials.","zh":"这起丑闻最终把好几位高级官员都卷了进去。"},{"en":"She was enmeshing herself in debt by using her credit card every day.","zh":"她每天刷信用卡，让自己陷入债务泥潭。"},{"en":"The new rules are enmeshing small businesses in paperwork.","zh":"新规让小企业陷入繁琐的文书工作中。"}]},{"partOfSpeech":"vi.","definition":{"en":"becoming involved in something in a way that feels tangled or restrictive","zh":"（逐渐）纠缠其中；牵连其中，带有“越陷越深”的感觉"},"examples":[{"en":"He kept enmeshing in online arguments and couldn’t stop checking replies.","zh":"他不断卷入网络争论，忍不住一直去看回复。"},{"en":"Over time, their work and personal lives started enmeshing.","zh":"久而久之，他们的工作与私人生活开始纠缠在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"tangled together; intertwined (often used figuratively)","zh":"纠缠在一起的；交织的（常用于比喻）"},"examples":[{"en":"The novel portrays an enmeshing web of family secrets.","zh":"这部小说描绘了一张由家族秘密交织而成的纠缠之网。"},{"en":"They faced an enmeshing set of legal and financial problems.","zh":"他们面对一连串相互纠缠的法律与财务问题。"}]}],"synonyms":["entangling","involving","embroiling","ensnaring","intertwining"],"phonetic":"/ɛnˈmɛʃɪŋ/","extraExplanation":["“enmesh”来自“mesh（网、网状物）”，字面是“用网把……缠住”。因此它常带有不太积极的语气：不仅是“参与”，而是“被卷住、难以脱身”。","在心理学/家庭系统语境中，enmeshed / enmeshment 常指“界限不清、过度纠缠的关系”（例如父母与孩子过度干预彼此生活）。"]}
{"word":"enmeshment","summary":{"en":"Enmeshment means being overly entangled—either in relationships with unclear boundaries or being trapped/tangled more generally.","zh":"Enmeshment 指“过度纠缠”：既可指关系中界限不清的过分卷入，也可泛指被缠住、陷入困境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A close, overly involved connection where personal boundaries are unclear, often in relationships (especially families).","zh":"（人际关系中）过度纠缠、过分卷入，界限不清（常见于家庭关系）。"},"examples":[{"en":"In an enmeshed family, children may feel responsible for their parents’ emotions.","zh":"在“纠缠式”的家庭里，孩子可能会觉得自己要为父母的情绪负责。"},{"en":"Therapy helped her recognize enmeshment and set healthier boundaries.","zh":"心理咨询帮助她识别这种过度纠缠，并建立更健康的界限。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or state of being caught, tangled, or trapped (literal or figurative).","zh":"（字面或比喻）被缠住、被困住、陷入其中的状态。"},"examples":[{"en":"The bird died from enmeshment in discarded fishing line.","zh":"那只鸟因被丢弃的鱼线缠住而死亡。"},{"en":"He described his enmeshment in office politics as exhausting.","zh":"他形容自己陷入办公室政治的纠葛让人精疲力尽。"}]}],"synonyms":["entanglement","overinvolvement","fusion (psychology)","tangled involvement","caught-up-ness"],"phonetic":"/ɛnˈmɛʃmənt/","extraExplanation":["“enmeshment”常用于心理学/家庭治疗语境，强调“边界（boundaries）模糊”。它并不等同于亲密（closeness）：亲密可以有清晰边界，而enmeshment往往伴随过度干涉、难以独立、内疚感等。","词根来自“mesh”（网、网状物）→“enmesh”（使落入网中、使缠住）→“enmeshment”（被网住/纠缠的状态）。因此它既可字面也可比喻使用。"]}
{"word":"enmeshments","summary":{"en":"Enmeshments means complicated entanglements—either physical (caught in nets/cords) or figurative (tight, hard-to-escape involvement between people or issues).","zh":"Enmeshments 指“纠缠/牵连”，既可指被网线等物理缠住，也可指人与事之间复杂且难以脱身的关系牵连。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation where people, groups, or problems become closely involved with each other in a complicated (often hard-to-escape) way.","zh":"（人、团体或问题之间）复杂而紧密的牵连；纠缠在一起（常常难以脱身）。"},"examples":[{"en":"The investigation revealed several political enmeshments between business leaders and local officials.","zh":"调查揭露了商界领袖与地方官员之间多重政治牵连。"},{"en":"Family enmeshments can make it hard to set healthy boundaries.","zh":"家庭中的过度纠缠会让人难以建立健康的界限。"}]},{"partOfSpeech":"n.","definition":{"en":"The state of being caught or trapped in something, especially in nets, wires, or other tangling material.","zh":"（尤指被网、线等）缠住；困住；陷入。"},"examples":[{"en":"The animal died from enmeshments in fishing gear left near the shore.","zh":"那只动物因被海岸附近遗弃的渔具缠住而死亡。"},{"en":"To prevent enmeshments, keep cords tied up and out of walkways.","zh":"为了避免被电线缠住，应把线缆扎好并远离通道。"}]}],"synonyms":["entanglements","involvements","complications","intertwining","snarls"],"phonetic":"/ɛnˈmɛʃmənts/","extraExplanation":["“enmeshment”来自动词“enmesh”（使落入网中/使纠缠），常见于两类语境：\n1）字面：渔网、线缆、渔具等造成的“缠住”。\n2）比喻：关系或利益上的“牵连/纠葛”。心理学里也常用“enmeshment”指家庭成员界限不清、过度卷入彼此生活的状态。","拼写提示：结尾“-ments”表示复数（多个“纠缠/牵连”）。日常写作里更常见单数“enmeshment”，复数“enmeshments”多用于强调“多重牵连/多处缠绕”。"]}
{"word":"enmew","summary":{"en":"“Enmew” is a rare, literary verb meaning “to confine or shut up (as in a cage).”","zh":"“enmew”是非常少见的文学用语，意思是“禁闭、关起来（如关进笼子）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic/literary) To shut up or confine; to keep someone or something enclosed (as if in a cage or small room).","zh":"（古雅/文学用语）把……关起来、禁闭；使……被围困在狭小空间里（如同关进笼子/小屋）。"},"examples":[{"en":"The prince was enmewed in a lonely tower.","zh":"王子被禁闭在一座孤寂的高塔里。"},{"en":"She felt enmewed by the strict rules of the household.","zh":"她觉得自己被家里的严苛规矩束缚得像被关起来一样。"},{"en":"In the old story, the bird is enmewed until it learns to sing.","zh":"在那个古老的故事里，鸟儿被关着，直到学会歌唱。"}]}],"synonyms":["confine","shut up","lock up","imprison","enclose"],"phonetic":"/ɛnˈmjuː/","extraExplanation":["这个词非常少见，主要出现在古典或文学语境中。它由前缀 en-（使进入某种状态）+ mew 组成。这里的 mew 不是“猫叫声”，而是一个较古老的名词，指“笼子、关动物的小屋/围栏”，因此 enmew 就有“关进笼里、禁闭”的意思。","在现代英语里，更常用的表达是 shut up, confine, lock up, imprison（语气强弱不同）。文学作品中用 enmew 往往是为了营造古典、压抑或被束缚的氛围。"]}
{"word":"enmist","summary":{"en":"“Enmist” is a rare literary verb meaning to cover with mist or (figuratively) to obscure.","zh":"“enmist”是罕见的文学动词，意为“被薄雾笼罩/使起雾”，也可比喻“使变得模糊、遮蔽”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, literary) To cover or surround with mist; to make something misty.","zh":"（罕见，文学用语）用薄雾覆盖或笼罩；使变得雾蒙蒙。"},"examples":[{"en":"The valley was enmisted at dawn, and the houses looked like shadows.","zh":"黎明时山谷被薄雾笼罩，房子看起来像影子。"},{"en":"A light rain enmisted the windows, blurring the streetlights.","zh":"小雨让窗户蒙上一层雾气，把路灯的光晕模糊了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative, rare) To cloud or obscure (someone’s view, thoughts, or feelings).","zh":"（比喻，罕见）使（视线、思绪或情感）变得模糊不清；遮蔽。"},"examples":[{"en":"Grief enmisted her memory, so even happy moments felt distant.","zh":"悲伤让她的记忆变得朦胧，连快乐的时刻都显得遥远。"},{"en":"Rumors enmisted the truth about what happened.","zh":"谣言让事情的真相变得扑朔迷离。"}]}],"synonyms":["shroud","veil","envelop","obscure","cloud"],"phonetic":"/ɛnˈmɪst/","extraExplanation":["“enmist”由前缀 en-（使……处于某种状态）+ mist（薄雾）构成，带有明显的诗意色彩。在现代英语中很少见，更常用的表达是 “be covered in mist / be shrouded in mist / grow misty / fog over”。","学习时可把它当作描写氛围的文学动词：既能写真实的雾气，也能写“情绪或真相被遮蔽”的朦胧感。"]}
{"word":"enmities","summary":{"en":"“Enmities” means multiple cases of strong hatred or hostile opposition between people or groups.","zh":"“enmities”指多种仇恨或敌意对立（“enmity”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Strong dislike or hatred; hostile feelings.","zh":"强烈的反感或仇恨；敌意。"},"examples":[{"en":"There was deep enmity between the two families after the land dispute.","zh":"土地纠纷之后，两家人之间产生了深深的仇恨。"},{"en":"She tried to end years of enmity by starting a calm conversation.","zh":"她试图通过一次平静的谈话结束多年的敌意。"}]},{"partOfSpeech":"n.","definition":{"en":"A state of being enemies; active hostility or opposition.","zh":"敌对状态；公开的对立或敌意。"},"examples":[{"en":"The treaty reduced enmity between the neighboring countries.","zh":"这项条约减少了邻国之间的敌对状态。"},{"en":"Old political enmities can make cooperation difficult.","zh":"旧有的政治对立会让合作变得困难。"}]}],"synonyms":["hostilities","animosities","hatreds","antagonisms"],"phonetic":"/ˈɛn.mə.tiz/","extraExplanation":["“enmities”是“enmity”的复数形式，常用于谈论多个仇怨/敌对关系（例如不同群体之间的长期矛盾）。","语气比较正式，常见于新闻、历史、政治或文学语境。日常口语里更常说“hate”“bad blood”“hostility”。","搭配：deep/bitter enmity（深刻/强烈的仇恨），end/put aside enmity（结束/搁置敌意），between A and B（A与B之间）。"]}
{"word":"enmity","summary":{"en":"Enmity means strong hatred/hostility or the state of being enemies.","zh":"Enmity 指强烈的仇恨/敌意，或彼此为敌的敌对状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong feeling of hatred or hostility toward someone; active opposition","zh":"对某人的强烈仇恨或敌意；对立、对抗"},"examples":[{"en":"Years of enmity between the two families made cooperation impossible.","zh":"两家多年的仇怨使合作变得不可能。"},{"en":"She tried to end the enmity by apologizing and talking calmly.","zh":"她试图通过道歉并冷静沟通来结束敌意。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being enemies; a hostile relationship between people or groups","zh":"敌对状态；人与人或群体之间的敌对关系"},"examples":[{"en":"The treaty reduced enmity between the two countries.","zh":"这项条约减少了两国之间的敌对状态。"},{"en":"Old enmity can last for generations if no one works to heal it.","zh":"如果没人努力化解，旧日的敌对可能延续好几代。"}]}],"synonyms":["hostility","hatred","animosity","antagonism"],"phonetic":"/ˈɛn.mə.t̬i/","extraExplanation":["词源提示：enmity 来自“enemy（敌人）”同源，核心感觉比 dislike（不喜欢）更强，常接近 hatred（仇恨）或 deep hostility（深层敌意）。","常见搭配：deep/bitter/long-standing enmity（深刻/激烈/长期的仇怨）；end/resolve enmity（结束/化解敌意）；enmity between A and B（A与B之间的敌对）。","文学/经典用法：在《圣经》英译中常见 “I will put enmity between…”（我要使……彼此为仇），用来表达根深蒂固的对立。"]}
{"word":"enmoss","summary":{"en":"“En masse” means “all together” or “in large numbers,” emphasizing collective action.","zh":"“en masse”表示“全体一起/大量同时”，强调集体性的行动或变化。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"As a group; all together; in large numbers at the same time.","zh":"成群地；全体一起；大量同时地。"},"examples":[{"en":"The students left the auditorium en masse after the speech.","zh":"演讲结束后，学生们成群结队地离开了礼堂。"},{"en":"Customers complained en masse when the app stopped working.","zh":"当应用无法使用时，顾客们纷纷集体投诉。"},{"en":"The birds took off en masse when they heard a loud noise.","zh":"鸟群听到巨响后一起飞起。"}]},{"partOfSpeech":"phrase","definition":{"en":"As a single body (viewed collectively rather than as individuals).","zh":"作为一个整体（强调集体，而非个体）。"},"examples":[{"en":"The committee en masse supported the proposal, even though a few members had doubts.","zh":"尽管少数成员有所疑虑，但委员会整体上支持该提案。"},{"en":"Voters en masse shifted toward the new candidate.","zh":"选民整体上转向了这位新候选人。"}]}],"synonyms":["all together","all at once","in a group","in large numbers","collectively"],"phonetic":"/ɑn ˈmæs/","extraExplanation":["“en masse”来自法语，字面意思是“以团块/整体的方式”。英语里常用于新闻报道、评论或较正式的写作，表示“集体地、成批地”。","拼写常见误区：不是 *enmoss*，标准写法是 **en masse**（两个词）。发音也更接近“on MASS”。","近义表达：*in a group*, *all at once*, *in large numbers*；语气最正式的通常是 **en masse**。"]}
{"word":"enmove","summary":{"en":"“Enmove” is not standard English; it’s likely a typo or a name. Use “move” or “remove,” depending on your intended meaning.","zh":"“enmove”不是标准英语，常见为拼写错误或名称；应按语境改用“move（移动）”或“remove（移除）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or a product/name. In normal writing, use “move,” “remove,” or another specific verb depending on meaning.","zh":"不是标准英语单词；通常是拼写错误或品牌/名称。在正式表达中应根据意思改用“move（移动）”“remove（移除）”等更准确的动词。"},"examples":[{"en":"I couldn’t find “enmove” in a dictionary—did you mean “remove” or “move”?","zh":"我在词典里找不到“enmove”——你想说的是“remove（移除）”还是“move（移动）”吗？"},{"en":"Please move the table closer to the window.","zh":"请把桌子移到靠近窗户的地方。"},{"en":"Please remove the file after you finish.","zh":"你完成后请把文件删除/移除。"}]}],"synonyms":["move","remove","shift","relocate","take away"],"phonetic":"/ˈɛnmuːv/","extraExplanation":["“en-”在英语里常见作前缀，含义大致是“使成为……/使进入……”，常见于：enrich（使更富有/使丰富）、enable（使能够）、encourage（鼓励）、enlarge（扩大）。但“enmove”并不是常用或规范的派生词，所以母语者一般不会这样说。","如果你告诉我你想表达的中文意思或给我一句完整例句（你原本想写“enmove”的那句话），我可以帮你选最自然的英文表达。"]}
{"word":"enmuffle","summary":{"en":"“Enmuffle” means to wrap or cover something so it is muffled, hidden, or protected, often used in literary description.","zh":"“Enmuffle”指把某物裹住或遮住，使其被闷住、隐藏或保护起来，常用于文学性描写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wrap or cover someone or something so that it is muffled, hidden, or protected (often with cloth); to muffle completely","zh":"（常指用布料）把……包住/裹住，使其被捂住、遮住或保暖；使……完全闷住（声音或形状）"},"examples":[{"en":"She enmuffled the baby in a thick blanket before going outside.","zh":"出门前，她用厚毯子把宝宝裹得严严实实。"},{"en":"The hills were enmuffled in fog, and the town looked far away.","zh":"群山被雾气笼罩着，小镇看起来很遥远。"},{"en":"He spoke softly, his voice enmuffled by the scarf over his mouth.","zh":"他轻声说话，嘴上的围巾把声音闷住了。"}]}],"synonyms":["muffle","wrap up","swathe","envelop","shroud"],"phonetic":"/ɛnˈmʌfəl/","extraExplanation":["“enmuffle”比较少见、偏文学或描写性用词。它由前缀 en-（表示“使进入某种状态/包裹起来”）+ muffle（捂住、闷住）构成，语气比常见的“wrap up / cover / muffle”更有画面感。","常见搭配多与布料、雾、黑暗等一起出现，如：enmuffled in fog（被雾笼罩）、enmuffled in a cloak（裹在斗篷里）。"]}
