{"word":"Enoch-related","summary":{"en":"“Enoch-related” means connected with Enoch or with traditions/writings associated with him.","zh":"“Enoch-related”指与以诺本人或与其相关的传统、著作有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with Enoch, a figure in the Hebrew Bible/Old Testament (Genesis), or with writings and traditions associated with him (especially the Book of Enoch).","zh":"与以诺（《希伯来圣经/旧约·创世记》人物）有关的；或与以诺相关的传统与著作（尤其是《以诺书》）有关的。"},"examples":[{"en":"The lecture discussed Enoch-related traditions in early Jewish literature.","zh":"这场讲座讨论了早期犹太文学中与以诺有关的传统。"},{"en":"Some scholars compare Enoch-related themes with later apocalyptic writing.","zh":"一些学者把与以诺相关的主题与后来的启示文学进行比较。"}]}],"synonyms":["Enochic","Enochian (in some contexts)"],"phonetic":"/ˈiːnɑk rɪˌleɪtɪd/","extraExplanation":["“Enoch-related”常见于宗教研究、圣经研究与文学研究语境，用来概括“与以诺这个人物或以诺传统相关”的内容（例如天使、末世审判、异象等主题）。","以诺（Enoch）在《创世记》中以“与神同行”并“被神取去”而闻名；而《以诺书》（Book of Enoch）属于古代犹太启示文学，对后世一些宗教与文学传统有影响，但不被大多数基督教教派列入《圣经》正典。"]}
{"word":"Enochian","summary":{"en":"Enochian usually means “related to Enoch,” or it can refer to a famous 16th‑century occult ‘angelic language.’","zh":"Enochian 通常指“与以诺有关的”，也可指16世纪著名的神秘学“天使语言”（以诺奇语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Enoch, a figure in the Bible (especially the Book of Genesis) and in later Jewish and Christian tradition.","zh":"与以诺（Enoch，圣经人物，尤其见于《创世记》，并在后来的犹太与基督教传统中出现）有关的；以诺的。"},"examples":[{"en":"Some scholars discuss Enochian traditions in early Jewish writings.","zh":"一些学者会讨论早期犹太著作中的以诺传统。"},{"en":"The text uses Enochian imagery to describe heavenly visions.","zh":"这篇文本使用以诺传统的意象来描绘天上的异象。"}]},{"partOfSpeech":"n.","definition":{"en":"An esoteric or “angelic” language recorded in the 16th century by John Dee and Edward Kelley, used in some Western occult traditions.","zh":"16世纪由约翰·迪（John Dee）和爱德华·凯利（Edward Kelley）记录的一种神秘学/“天使语言”，在一些西方秘学传统中被使用。"},"examples":[{"en":"The magician claimed to recite prayers in Enochian.","zh":"那位术士声称会用以诺奇语诵读祷文。"},{"en":"Modern fantasy games sometimes borrow Enochian words for spells.","zh":"一些现代奇幻游戏会借用以诺奇语词汇来设计咒语。"},{"en":"She’s studying Enochian as part of a history-of-occultism project.","zh":"她正在学习以诺奇语，作为一项神秘学史研究项目的一部分。"}]}],"synonyms":["angelic language","occult language","Enoch-related"],"phonetic":"/iːˈnoʊkiən/","extraExplanation":["“Enochian”这个词有两条常见线索：\n1）宗教与文献层面：与以诺相关，尤其常见于《以诺书》（Book of Enoch，属次经/伪经传统，在不同宗教传统中的地位不一）。\n2）神秘学层面：指迪与凯利在通灵记录中写下的“天使语”，后来被一些西方仪式魔法体系（如黄金黎明系传统）吸收与改造。它在流行文化（小说、影视、游戏）中也常被当作“神秘咒语语言”使用。"]}
{"word":"enochic","summary":{"en":"Enochic means “connected with Enoch,” especially Enoch-related writings; it is also sometimes used (less precisely) for Enochian, an occult constructed language.","zh":"Enochic 指“与以诺有关”，尤指以诺传统与相关文献；也常（较不严谨地）被用来指 Enochian（以诺语），一种神秘学的人造语言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Enoch (a biblical figure), especially to writings, traditions, or stories connected with him (such as the Book of Enoch).","zh":"与以诺（《圣经》人物）有关的；尤指与以诺相关的著作、传统或故事（如《以诺书》）。"},"examples":[{"en":"The professor taught a unit on Enochic literature and early Jewish apocalyptic texts.","zh":"教授讲授了一单元的以诺相关文献，以及早期犹太末世论文本。"},{"en":"Some themes in the Book of Jude echo Enochic traditions.","zh":"《犹大书》中的一些主题呼应了以诺传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to “Enochian,” a constructed magical language used in some Western occult traditions (sometimes loosely called “Enochic” in popular writing).","zh":"与“以诺语/Enochian”有关的——一种在部分西方神秘/魔法传统中使用的人造语言（大众写作中有时也笼统称为“Enochic”）。"},"examples":[{"en":"The novel includes a chant described as Enochic, though it isn’t historically accurate.","zh":"小说里有一段咒语被描述为“以诺式的”，不过并不符合历史。"},{"en":"Online forums sometimes label Enochian scripts as Enochic symbols.","zh":"网络论坛有时把以诺语文字称作“以诺符号”。"}]}],"synonyms":["Enochian (often, but not always, the intended meaning)","Enoch-related","apocalyptic (context-dependent)"],"phonetic":"/iˈnɑkɪk/","extraExplanation":["“Enochic”在学术语境中多指与以诺及《以诺书》等“以诺传统”相关的内容；在大众文化或神秘学圈子里，有时会把“Enochic”当作“Enochian（以诺语）”的泛称，但更规范的说法是用“Enochian”。","以诺（Enoch）在《创世记》中被提到；《以诺书》属于犹太伪经/次经传统的重要文本，常与天使、末世启示等主题相关。阅读相关材料时，注意区分宗教研究（历史文本）与神秘学实践（仪式语言）的不同语境。"]}
{"word":"enochlophobia","summary":{"en":"Enochlophobia means an intense fear of crowds.","zh":"enochlophobia 指“人群恐惧症/害怕拥挤人群”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong fear or anxiety about crowds or being in a crowd.","zh":"对人群/拥挤人群的强烈恐惧或焦虑。"},"examples":[{"en":"She avoided concerts because of her enochlophobia.","zh":"因为有人群恐惧症，她会避开演唱会。"},{"en":"His enochlophobia got worse on packed subway platforms.","zh":"在拥挤的地铁站台上，他的人群恐惧更严重。"}]}],"synonyms":["fear of crowds","crowd phobia","crowd anxiety"],"phonetic":"/ɪˌnɑːkloʊˈfoʊbiə/","extraExplanation":["这个词比较“书面/学术”，日常更常说：fear of crowds（害怕人群）或 crowd anxiety（人群焦虑）。","词源来自希腊语：ochlos（人群、乌合之众）+ -phobia（恐惧）。注意它不同于 agoraphobia（广场/开放或公共场所恐惧），后者不一定只针对“人群”。","在心理健康语境中，人群恐惧可能与惊恐发作、社交焦虑或创伤经历有关；如果影响生活，寻求专业帮助是常见且有效的做法。"]}
{"word":"enocyte","summary":{"en":"An enocyte is a specialized insect cell important for lipid (fat) metabolism.","zh":"enocyte 指昆虫体内一种与脂类（脂肪）代谢密切相关的特化细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialized cell found mainly in insects (and some other arthropods), involved in lipid (fat) metabolism and related chemical processing in the body.","zh":"（昆虫及部分节肢动物体内的）成脂细胞／酒细胞，一种特化细胞，主要参与脂类代谢及相关化学处理过程。"},"examples":[{"en":"In many insects, enocytes help process lipids needed for growth and development.","zh":"在许多昆虫中，enocyte 会处理生长发育所需的脂类。"},{"en":"Researchers examined enocytes to understand how an insect makes and uses fatty substances.","zh":"研究人员通过观察 enocyte 来了解昆虫如何制造并利用脂类物质。"}]}],"synonyms":["oenocyte","fat-body cell (related, not exact)"],"phonetic":"/ˈiːnəˌsaɪt/","extraExplanation":["在学术文章中更常见的拼写是 **oenocyte**（英式写法），你输入的 **enocyte** 常被当作简写或变体。","词源来自希腊语 **oinos**（葡萄酒）。早期显微观察中，这类细胞在某些染色下呈“酒色/黄褐色”，因此得名。"]}
{"word":"enodal","summary":{"en":"Enodal means “without nodes/knots,” used mainly in botanical or technical descriptions.","zh":"Enodal 指“无节/无结”，主要用于植物学或技术性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Without nodes or knots; smooth and unknotted (especially of stems or plant structures).","zh":"（植物学）无节的；无结的；表面平滑无节（尤指茎或植物结构）。"},"examples":[{"en":"The botanist described the plant’s stem as enodal and smooth.","zh":"植物学家把这种植物的茎描述为无节且光滑。"},{"en":"Compared with the nodal variety, this enodal shoot shows fewer visible joints.","zh":"与有节的品种相比，这条无节的新枝可见的节更少。"}]}],"synonyms":["unnoded","unnotched","unknotted","smooth","without nodes"],"phonetic":"/iˈnoʊdəl/","extraExplanation":["“enodal”是非常少见的书面词，多见于植物学或较正式的描述中。构词上可理解为“e-/en-（使……成为/处于……状态）+ nodal（有节的）”，整体意思就是“无节的、没有结节的”。日常英语里更常用的表达是“without nodes / smooth / unknotted”。"]}
{"word":"enodally","summary":{"en":"“Enodally” means “without knots or nodes; smoothly,” often used in botanical or technical descriptions.","zh":"“enodally”意为“无结节/无节地；平滑地”，多用于植物学或技术性描写。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is without knots or nodes; smoothly; (in botany) without joints or nodes on a stem.","zh":"以无结节、无节（的方式）；平滑地；（植物学）指茎上无节/无节间界限地。"},"examples":[{"en":"The writer described the vine as growing enodally, with no obvious nodes along the stem.","zh":"作者形容那株藤蔓生长得很“enodally”，茎上看不出明显的节。"},{"en":"In the specimen, the surface appears enodally smooth, without any knot-like bumps.","zh":"在这个标本上，表面显得平滑无结节，没有任何像结疤一样的凸起。"}]}],"synonyms":["smoothly","knotlessly","without nodes"],"phonetic":"/ɪˈnoʊdəli/","extraExplanation":["“enodally”非常罕见，多见于植物学或较旧的科学描写。它来自拉丁语词根：e-/ex-（“去除、没有”）+ nodus（“结、节”）。因此常用于强调“没有节/结、没有疙瘩”的特征。","相关词：enodal（形容词，意为“无节的/无结的”）、node（名词，“节；结点”）、nodal（形容词，“节的；结点的”）。在日常英语里，人们更常用 smooth、knotless、without nodes 等表达。"]}
{"word":"enodate","summary":{"en":"“Enodate” is not standard English; it most likely means “annotate” (to add notes or comments).","zh":"“enodate”不是标准英语，最可能是想写“annotate”（添加注释/批注）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “annotate.”","zh":"不是标准英语单词，很可能是把“annotate”拼错了。"},"examples":[{"en":"I couldn’t find “enodate” in the dictionary—did you mean “annotate”?","zh":"我在词典里找不到“enodate”——你是不是想写“annotate”？"}]},{"partOfSpeech":"vt.","definition":{"en":"(annotate) To add notes, comments, or explanations to a text, document, image, or data.","zh":"（annotate）给文本、文件、图片或数据添加注释、批注或说明。"},"examples":[{"en":"Please annotate the article with key vocabulary and short notes.","zh":"请在文章上做标注，把重点词汇和简短注释写出来。"},{"en":"The teacher annotated my essay with suggestions for improvement.","zh":"老师在我的作文上写了批注，提出改进建议。"},{"en":"You can annotate the chart to explain what each line means.","zh":"你可以给图表加注释，说明每条线代表什么。"}]}],"synonyms":["comment on","make notes on","add notes","gloss"],"phonetic":"/ˈænəˌteɪt/","extraExplanation":["“annotate”常用于学习与工作场景：读书做笔记、老师批改作业、在PDF里加批注、给数据/图表加说明。常见搭配：annotate a text/document/PDF, annotate with notes/comments, annotated edition（带注释的版本）。如果你想表达“注明日期/写上日期”，更常用的是：date it / add the date / put the date on it。"]}
{"word":"enodation","summary":{"en":"Enodation is a rare word meaning an explanation or interpretation (and, less commonly, the untying of a knot).","zh":"Enodation 是一个少见词，主要指“阐释/解说”，较少见地也可指“解开绳结”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of explaining or interpreting something difficult or unclear (especially a text or passage); an explanation","zh":"（尤指对文本、段落等晦涩内容的）阐释；解说；解释"},"examples":[{"en":"The professor’s enodation of the poem made its images easier to understand.","zh":"教授对这首诗的阐释让其中的意象更容易理解。"},{"en":"The notes provide an enodation of several archaic words in the story.","zh":"注释对故事中几个古词做了说明与解释。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the act of untying a knot; loosening something tied","zh":"（罕见）解开结；松开绑扎物"},"examples":[{"en":"In older writing, “enodation” could refer to the enodation of a rope before use.","zh":"在较早的文字中，enodation 有时指使用前把绳结解开。"}]}],"synonyms":["explanation","interpretation","clarification","elucidation","explication"],"phonetic":"/ˌiːnoʊˈdeɪʃən/","extraExplanation":["这个词在现代英语里非常少见，多见于学术/古典语境（如对古文、经文、诗歌的“阐释”）。日常写作更常用 explanation、interpretation、clarification。","词源来自拉丁语 enodare（e- “出/解开” + nodus “结”），本义是“解开结”，引申为“解开难题、说明晦涩之处”。"]}
{"word":"enode","summary":{"en":"“Enode” is usually a technical noun meaning an E-labeled node in diagrams, or (in LTE telecom) an eNodeB base station.","zh":"“Enode”多为技术用名词：指示意图中标为 E 的节点，或在 LTE 通信中指 eNodeB（4G 基站）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing/electronics) A node (connection point) labeled “E,” often referring to an electrical node in a circuit or a graph/network node named E in diagrams.","zh":"（计算机/电子）标记为“E”的节点，常指电路中的电气连接点，或图/网络中在示意图里被命名为 E 的节点。"},"examples":[{"en":"Connect the sensor’s output to the enode labeled E3 on the schematic.","zh":"把传感器的输出接到电路图上标记为 E3 的 enode 节点。"},{"en":"In the network diagram, the enode is the point where three branches meet.","zh":"在网络图中，enode 是三条支路汇合的那个节点。"}]},{"partOfSpeech":"n.","definition":{"en":"(telecommunications, LTE) Short for eNodeB: a 4G LTE base station (radio access node) that connects phones to the cellular network.","zh":"（通信，LTE）eNodeB 的简称：4G LTE 的基站（无线接入节点），负责把手机连接到蜂窝网络。"},"examples":[{"en":"If your signal drops, your phone may be switching to a different enode (eNodeB).","zh":"如果信号变差，你的手机可能正在切换到另一个 enode（eNodeB）基站。"},{"en":"The technician checked the enode configuration to improve coverage in the area.","zh":"技术人员检查了 enode 的配置，以改善该区域的覆盖。"}]}],"synonyms":["node","junction","connection point","eNodeB (LTE)","base station (LTE)"],"phonetic":"ˈiːnoʊd","extraExplanation":["“enode”不是非常标准的通用词，更多见于工程笔记、图纸标注或特定系统的命名方式。","在移动通信领域更常见的正式写法是“eNodeB”（LTE）；到 5G 时常见对应术语是“gNodeB”。如果你是在电池/电化学语境看到“anode/cathode”，那里的“anode（阳极）”与“enode”不是同一个词。"]}
{"word":"eNodeB","summary":{"en":"eNodeB: an LTE (4G) cellular base station.","zh":"eNodeB：LTE（4G）蜂窝网络的基站。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of cellular base station used in LTE (4G) networks; it connects mobile devices to the operator’s core network and manages radio communication in a cell.","zh":"LTE（4G）网络中的一种蜂窝基站；负责把手机等终端接入运营商核心网，并管理小区内的无线通信。"},"examples":[{"en":"The operator upgraded the eNodeB to support more LTE users in the area.","zh":"运营商升级了 eNodeB，以支持该地区更多的 LTE 用户。"},{"en":"If the eNodeB fails, phones in that cell may lose LTE service.","zh":"如果 eNodeB 故障，该小区内的手机可能会失去 LTE 服务。"}]}],"synonyms":["eNB","LTE base station","base station"],"phonetic":"/ˌiːˈnoʊdˌbiː/","extraExplanation":["eNodeB 是 “evolved Node B” 的缩写，常读作 “ee-node-bee”。它主要用于 LTE（4G）无线接入网（RAN），与 3G 的 NodeB 概念相对应。","在 5G 里，类似角色通常叫 gNodeB（用于 NR/5G 无线接入）。在一些网络里也会出现 “eNB” 这个更常见的缩写形式。"]}
{"word":"enoil","summary":{"en":"“Enoil” is an archaic verb meaning to oil or anoint something.","zh":"“enoil”是一个很少见的古语动词，意思是给……上油或（仪式性地）抹油。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to oil; to smear or cover with oil; to anoint.","zh":"（古语）给……上油；用油涂抹或覆盖；（宗教/仪式中）给……抹油、涂圣油。"},"examples":[{"en":"He enoiled the leather to keep it soft and waterproof.","zh":"他给皮革上油，让它保持柔软并防水。"},{"en":"In old texts, a king might be described as “enoiled” before a ceremony.","zh":"在古老文本中，国王可能会被描述为在仪式前“受抹油”（enoiled）。"}]}],"synonyms":["oil","anoint","smear","lubricate"],"phonetic":"/ɪˈnɔɪl/","extraExplanation":["“enoil”在现代英语中非常少见，带有明显的古典/文学色彩。日常表达通常用“oil”（上油）或“anoint”（抹油/膏立，常见于宗教或仪式语境）。","词形上可理解为前缀“en-”（使进入某种状态）+“oil”（油），字面就是“使之有油/被油覆盖”。"]}
{"word":"enoint","summary":{"en":"Anoint means (1) to apply oil/liquid in a religious or healing ritual, or (2) to officially declare someone chosen for an important role.","zh":"Anoint 指（1）在宗教或疗愈仪式中用油/液体涂抹（傅油），也可引申为（2）正式认定/推举某人为重要人选。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To rub or spread oil or a special liquid on someone or something, often as part of a religious ceremony or for healing.","zh":"（常指宗教仪式或疗愈中）用油或特殊液体涂抹在某人/某物上，为其祝福、洁净或医治。"},"examples":[{"en":"The priest anointed the baby with oil during the ceremony.","zh":"在仪式中，牧师用油为婴儿傅油。"},{"en":"In the story, the healer anointed the wound before wrapping it.","zh":"故事里，医者先在伤口上抹上药油，再把它包扎起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"To officially choose or declare someone as the best person for an important role (often in politics, business, or sports).","zh":"（引申）正式选定或公开认定某人为重要职位/角色的最佳人选（常用于政商体坛）。"},"examples":[{"en":"The party anointed her as the next leader.","zh":"该党正式推举她为下一任领导人。"},{"en":"Many fans have already anointed him the greatest player of his generation.","zh":"许多球迷早已认定他是这一代最伟大的球员。"}]}],"synonyms":["consecrate","bless","sanctify","appoint","designate"],"phonetic":"əˈnɔɪnt","extraExplanation":["你输入的“enoint”在现代英语里非常少见，通常被认为是“anoint”的旧式/拼写变体或拼写错误。标准拼写是 anoint。","anoint 常见于《圣经》语境（如为君王、先知、病人傅油），因此在文学或正式写作中带有“庄重、神圣、被拣选”的色彩；引申义（“钦定/捧为”）也保留了这种语气。"]}
{"word":"enol","summary":{"en":"An enol is an organic compound/form with a C=C double bond and an –OH group on the double-bonded carbon, often paired with a keto form in tautomerism.","zh":"烯醇是含有C=C双键并在双键碳上带–OH的有机化合物/形态，常与酮式形成互变异构对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A type of organic compound (or form of a compound) that has a carbon–carbon double bond (C=C) and a hydroxyl group (–OH) attached to one of the double-bonded carbons; it is often the less stable partner of a keto–enol tautomeric pair.","zh":"（化学）烯醇：一种有机化合物（或同一化合物的一种形态），特点是在碳碳双键（C=C）上连有羟基（–OH）；常见于“酮–烯醇互变异构”中，通常比酮式更不稳定。"},"examples":[{"en":"In many reactions, the enol form reacts faster than the keto form.","zh":"在许多反应中，烯醇式比酮式反应更快。"},{"en":"Acetone exists mostly as the keto form, with only a tiny amount of enol present.","zh":"丙酮主要以酮式存在，只有极少量以烯醇式存在。"},{"en":"The catalyst helps shift the equilibrium toward the enol.","zh":"催化剂有助于使平衡向烯醇式方向移动。"}]}],"synonyms":["alkenol (less common)"],"phonetic":"/ˈiːnɔl/","extraExplanation":["“enol”这个词来自“ene”（表示双键）+“ol”（表示醇/羟基），名字就提示了结构特征：既有C=C双键，也有–OH。","在基础有机化学里，烯醇常和“酮式（keto form）”成对出现，二者可相互转化（tautomerism，互变异构）。虽然烯醇通常含量较低，但在某些反应（如α位卤化、醛醇反应相关过程）中会起关键作用。"]}
{"word":"enol-form","summary":{"en":"“Enol form” is the enol (C=C–OH) tautomer of a compound, contrasted with its keto form.","zh":"“Enol form（烯醇式）”指化合物中含C=C并带–OH的互变异构形式，与酮式相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The tautomeric form of a compound that contains a carbon–carbon double bond (C=C) and an –OH group attached to one of the double-bonded carbons (an enol), as opposed to the keto form.","zh":"（化学）化合物的一种互变异构形式：分子中含有碳碳双键（C=C），并且其中一个双键碳上连有羟基（–OH）的形式（称为烯醇式），与酮式相对。"},"examples":[{"en":"Many aldehydes and ketones can exist in both the keto form and the enol form.","zh":"许多醛和酮既可以以酮式存在，也可以以烯醇式存在。"},{"en":"In most cases, the keto form is more stable than the enol form.","zh":"在大多数情况下，酮式比烯醇式更稳定。"},{"en":"Under acidic or basic conditions, a small amount of the enol form may form and react further.","zh":"在酸性或碱性条件下，可能会生成少量烯醇式并进一步发生反应。"}]}],"synonyms":["enol tautomer","enolic form"],"phonetic":"/ˈiːnɔːl fɔːrm/","extraExplanation":["“Enol-form”常见于有机化学讨论“酮-烯醇互变异构（keto–enol tautomerism）”时：同一个分子可以在酮式与烯醇式之间通过质子转移与双键位置变化相互转化。","烯醇式通常在反应机理里很重要（例如烯醇/烯醇盐参与的α位反应），即使它在平衡中所占比例很小。"]}
{"word":"enol-related","summary":{"en":"“Enol-related” means connected with enols or chemistry involving enols (enolization, keto–enol tautomerism).","zh":"“Enol-related”指与烯醇或涉及烯醇的化学过程（烯醇化、酮-烯醇互变异构）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with an enol (a type of organic compound/structure that has a carbon–carbon double bond next to an –OH group), or with chemistry involving enols (such as enolization or keto–enol tautomerism).","zh":"与“烯醇”（一种有机结构：碳碳双键旁带—OH）有关的；或与涉及烯醇的化学过程有关（如烯醇化、酮-烯醇互变异构）。"},"examples":[{"en":"The reaction rate depends on an enol-related intermediate.","zh":"该反应速率取决于一个与烯醇有关的中间体。"},{"en":"They used NMR to study enol-related signals in the spectrum.","zh":"他们用核磁共振（NMR）研究谱图中与烯醇有关的信号。"},{"en":"Enol-related pathways are common in base-catalyzed reactions.","zh":"在碱催化反应中，与烯醇有关的反应路径很常见。"}]}],"synonyms":["enolic","enol-type","enol-derived"],"phonetic":"ˈiːnɔl rɪˌleɪtɪd","extraExplanation":["“enol-related”是化学写作里常见的复合形容词，通常用来概括“与烯醇/烯醇化/烯醇型中间体有关”的现象或证据。","烯醇（enol）常与“酮（keto）”形成互变异构（keto–enol tautomerism）：同一分子在两种结构之间可相互转化，因此论文里会提到“enol-related peaks/signals/products/intermediates（与烯醇有关的峰/信号/产物/中间体）”。","书面表达中也常见近义写法：enolic（烯醇的/呈烯醇性质的）、enol-type（烯醇型）、enol-derived（由烯醇产生的）。语气上“enol-related”更中性，强调“关联”而不强行断定结构一定是烯醇。"]}
{"word":"enolase","summary":{"en":"Enolase is an enzyme that helps cells break down glucose for energy in glycolysis.","zh":"Enolase（烯醇化酶）是一种参与糖酵解、帮助细胞分解葡萄糖获取能量的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein enzyme found in most living cells that helps break down glucose for energy (it catalyzes a step in glycolysis).","zh":"一种存在于大多数生物细胞中的蛋白质酶，帮助分解葡萄糖以获取能量（催化糖酵解过程中的一个步骤）。"},"examples":[{"en":"Enolase is an important enzyme in glycolysis, a pathway cells use to produce energy.","zh":"烯醇化酶是糖酵解中的重要酶，细胞通过这条途径产生能量。"},{"en":"Doctors and researchers may measure enolase levels in the lab as a biomarker in certain diseases.","zh":"医生和研究人员可能在实验室中测量烯醇化酶水平，作为某些疾病的生物标志物。"}]}],"synonyms":["2-phosphoglycerate dehydratase","phosphopyruvate hydratase"],"phonetic":"/ɪˈnoʊleɪs/","extraExplanation":["“enolase”是生物化学术语，来自“enol（烯醇）+ -ase（酶）”。它的名字反映了它所催化反应与“烯醇/酮式互变异构”相关。","在医学语境中，你可能会看到“neuron-specific enolase (NSE，神经元特异性烯醇化酶)”作为检验项目名称，用于特定疾病的辅助评估。"]}
{"word":"enolases","summary":{"en":"Enolases are enzymes involved in glycolysis (sugar breakdown).","zh":"Enolases 指参与糖酵解（分解糖）的烯醇化酶（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of enolase) enzymes that help break down sugar during glycolysis, especially by converting 2‑phosphoglycerate into phosphoenolpyruvate.","zh":"（enolase 的复数）烯醇化酶；一类参与糖酵解的酶，主要催化“2-磷酸甘油酸”转变为“磷酸烯醇式丙酮酸（PEP）”。"},"examples":[{"en":"Researchers measured enolases to estimate glycolysis activity in the cells.","zh":"研究人员测量烯醇化酶的水平，以估计细胞中的糖酵解活性。"},{"en":"Some bacteria have multiple enolases that work under different conditions.","zh":"有些细菌具有多种烯醇化酶，可在不同条件下发挥作用。"}]}],"synonyms":["enolase (singular)","glycolytic enzyme"],"phonetic":"/iˈnoʊleɪs/","extraExplanation":["“enolase”这个词由“enol（烯醇）+ -ase（酶的常见后缀）”组成；在生命科学文章里常以缩写“ENO”或按同工酶写作 ENO1/ENO2/ENO3。","临床与免疫学语境中，有时会提到“anti-enolase antibodies（抗烯醇化酶抗体）”，或在某些疾病研究中把 enolase 作为生物标志物（biomarker）来讨论。"]}
{"word":"enolate","summary":{"en":"An enolate is a resonance-stabilized anion formed by deprotonating the α-carbon next to a carbonyl, widely used as a nucleophile in organic reactions.","zh":"Enolate（烯醇负离子）是羰基α-位去质子化得到的、由共振稳定的阴离子，常在有机反应中作为亲核体使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Organic chemistry) The conjugate base formed when a carbonyl compound (like an aldehyde or ketone) loses a proton at the alpha (α) carbon, giving a resonance-stabilized ion that can react as a nucleophile.","zh":"（有机化学）羰基化合物（如醛或酮）在α-碳位置失去一个质子后形成的共轭碱；它是一个由共振稳定的离子，常作为亲核体参与反应。"},"examples":[{"en":"Strong base can deprotonate acetone to form an enolate.","zh":"强碱可以使丙酮去质子化，生成烯醇负离子（enolate）。"},{"en":"Enolates are key intermediates in aldol reactions.","zh":"烯醇负离子是醛醇反应中的关键中间体。"},{"en":"The enolate can attack an electrophile to make a new carbon–carbon bond.","zh":"烯醇负离子可以进攻亲电试剂，形成新的碳—碳键。"}]}],"synonyms":["enolate ion","enol(ate) anion"],"phonetic":"/ˈiːnəˌleɪt/","extraExplanation":["“Enolate”通常与“enol（烯醇）”一起出现：烯醇（中性）与烯醇负离子（带负电）是一对互相关联的形式。","烯醇负离子之所以稳定，主要因为负电荷可在氧与α-碳之间共振离域；很多教材会画两个共振式。","在合成中，常用LDA等强、位阻大的碱在低温下生成烯醇负离子，以控制反应的区域选择性（例如形成“动力学烯醇负离子”）。"]}
{"word":"enolate-forming","summary":{"en":"“Enolate-forming” describes conditions or reagents that generate an enolate from a carbonyl compound, typically by removing an α-hydrogen with a base.","zh":"“enolate-forming”指能从羰基化合物生成烯醇负离子的条件或试剂，通常是碱移走 α-氢而形成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to form an enolate (the negatively charged, resonance-stabilized form of a carbonyl compound) under basic conditions; describing reactions, reagents, or conditions that generate enolates.","zh":"能在碱性条件下形成烯醇负离子（羰基化合物的带负电、共振稳定形式）的；用于描述会生成烯醇负离子的反应、试剂或条件。"},"examples":[{"en":"LDA is a strong, non-nucleophilic base often used in enolate-forming conditions.","zh":"LDA 是一种强而不具亲核性的碱，常用于烯醇负离子生成条件。"},{"en":"The enolate-forming step is usually done at low temperature to control which enolate forms.","zh":"烯醇负离子生成步骤通常在低温下进行，以控制生成哪一种烯醇负离子。"},{"en":"In an enolate-forming reaction, the base removes an α-hydrogen next to the carbonyl.","zh":"在烯醇负离子生成反应中，碱会移走羰基旁边的 α-氢。"}]}],"synonyms":["enolate-generating","enolizing (context-dependent)"],"phonetic":"/ˈɛnəˌleɪt ˌfɔr.mɪŋ/","extraExplanation":["“enolate-forming”常见于有机化学论文、实验步骤与机理描述中，用来概括“会先生成烯醇负离子”的那一步或那组条件（例如：强碱、低温、无水溶剂）。","烯醇（enol）与烯醇负离子（enolate）相关但不同：enol 是中性互变异构体；enolate 是去质子化后的阴离子，通常更具亲核性，更常用于形成新的 C–C 键（如醛醇反应、烷基化、Claisen 缩合）。","写法上常作复合形容词置于名词前：enolate-forming step/conditions/base/reagent。也可用近义表达：“enolate-generating”。"]}
{"word":"enolic","summary":{"en":"Enolic means “related to an enol form” in chemistry.","zh":"enolic 指“与烯醇形式有关”的（化学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an enol (a chemical form that contains a carbon–carbon double bond and an –OH group), or showing properties typical of an enol form.","zh":"与烯醇（含有碳—碳双键并带有—OH 的化学形式）有关的；具有烯醇形式特征的。"},"examples":[{"en":"In solution, the compound exists partly in its enolic form.","zh":"在溶液中，这种化合物部分以烯醇形式存在。"},{"en":"The enolic hydrogen can be more acidic than expected because the conjugate base is stabilized.","zh":"烯醇上的氢可能比预期更酸，因为其共轭碱更稳定。"}]}],"synonyms":["enol-related","enol-form"],"phonetic":"ɪˈnɑlɪk","extraExplanation":["“enolic”是化学/生物化学中常见的形容词，多用于描述“烯醇形态（enol form）”或“烯醇相关性质”，常见搭配有：enolic form（烯醇形式）、enolic hydrogen（烯醇氢）、enolic tautomer（烯醇互变异构体）。","它常与“keto–enol tautomerism（酮-烯醇互变异构）”一起出现：同一种物质在“酮式（keto）”与“烯醇式（enol）”之间可相互转化。很多教材会用丙酮/乙酰乙酸乙酯等例子说明这种现象。"]}
{"word":"enolizable","summary":{"en":"“Enolizable” means capable of forming an enol/enolate via keto–enol tautomerization, typically because it has alpha hydrogens next to a carbonyl.","zh":"“Enolizable”指可发生烯醇化（酮-烯醇互变），通常因为羰基邻位有α-氢。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Able to undergo enolization (keto–enol tautomerization), usually because it has at least one acidic alpha (α) hydrogen next to a carbonyl group.","zh":"（化学）可发生烯醇化（酮-烯醇互变异构）的；通常因为羰基旁边的α位有可被夺取的氢（α-氢）。"},"examples":[{"en":"Acetone is enolizable because it has alpha hydrogens next to the carbonyl.","zh":"丙酮是可烯醇化的，因为它在羰基旁边有α-氢。"},{"en":"Under basic conditions, an enolizable ketone can form an enolate ion.","zh":"在碱性条件下，可烯醇化的酮可以形成烯醇负离子（enolate）。"}]}],"synonyms":["enolizable (variant: enolisable)","capable of enolization","tautomerizable (in keto–enol systems)"],"phonetic":"ɪˈnoʊləˌzaɪzəbəl","extraExplanation":["“enolizable”常用于有机化学讨论反应性：可烯醇化的羰基化合物更容易在α位被去质子化，生成enolate，进而参与醛醇反应（aldol）、卤代（α-halogenation）等反应。","判断是否“可烯醇化”的常见要点：看羰基（C=O）相邻的碳（α-碳）上是否有氢；如果α-碳没有氢（例如某些全取代的酮），通常就不易烯醇化。"]}
{"word":"enolization","summary":{"en":"Enolization is the chemistry process where a carbonyl compound shifts into its enol form (often via keto–enol tautomerism).","zh":"Enolization（烯醇化）是指羰基化合物转变为烯醇形式的过程（常见于酮式–烯醇式互变异构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The process in which a carbonyl compound (like an aldehyde or ketone) forms its enol form (an alkene with an –OH group), usually through keto–enol tautomerism.","zh":"（化学）指含羰基的化合物（如醛或酮）转变为烯醇形式（含C=C并带–OH）的过程，通常属于“酮式–烯醇式互变异构”。"},"examples":[{"en":"Enolization of acetone happens more readily in the presence of a base.","zh":"丙酮在碱存在下更容易发生烯醇化。"},{"en":"The reaction rate increased because enolization produced a more reactive intermediate.","zh":"反应速率加快了，因为烯醇化生成了更活泼的中间体。"},{"en":"In many mechanisms, enolization is the first step before substitution at the alpha carbon.","zh":"在许多机理中，烯醇化是α位碳发生取代反应之前的第一步。"}]}],"synonyms":["keto–enol tautomerization","tautomerization","enol formation"],"phonetic":"/ɪˌnoʊlɪˈzeɪʃən/","extraExplanation":["烯醇化常与“α位氢（alpha hydrogen）”有关：羰基旁边的α位氢相对更酸性，容易在酸/碱催化下被移走（或被活化），从而形成烯醇或更常见的“烯醇盐（enolate）”。","很多有机反应（如卤代、醛醇反应 aldol reaction）都依赖先发生烯醇化/形成烯醇盐，才能在α位进行成键或断键。","在大多数简单羰基化合物中，酮式通常比烯醇式更稳定，因此烯醇含量常较低，但它在反应性上非常关键。"]}
{"word":"enolize","summary":{"en":"Enolize means to form an enol (the enol form of a compound), typically via keto–enol tautomerization in organic chemistry.","zh":"enolize 指形成烯醇式（烯醇形态），通常指有机化学中的酮—烯醇互变过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) To convert (a compound) into its enol form; to undergo or cause keto–enol tautomerization.","zh":"（化学）使（化合物）转化为烯醇式；发生或引发“酮式—烯醇式”互变异构。"},"examples":[{"en":"Under basic conditions, the ketone can enolize and then react with an electrophile.","zh":"在碱性条件下，这个酮可以发生烯醇化，然后与亲电试剂反应。"},{"en":"Only a small fraction of acetone enolizes in water at room temperature.","zh":"在室温水溶液中，丙酮只有很小一部分会烯醇化。"},{"en":"Enolized intermediates are important in aldol reactions.","zh":"烯醇化的中间体在羟醛反应中很重要。"}]}],"synonyms":["tautomerize","form an enol","convert to the enol form"],"phonetic":"/ɪˈnoʊlaɪz/","extraExplanation":["“enolize”常见于有机化学语境，核心概念是“互变异构（tautomerization）”：酮式（keto form）与烯醇式（enol form）之间在酸/碱催化下可相互转化。","学习时可联想相关名词：enol（烯醇）、enolate（烯醇盐/烯醇负离子，常在强碱条件下形成），以及常见反应场景如卤代、羟醛反应、Michael加成等。","拼写提示：enol + -ize（使……成为/使……化），英式也可见拼写“enolise”。"]}
{"word":"enolized","summary":{"en":"“Enolized” means a compound has formed (or been converted into) its enol form, often discussed in keto–enol tautomerism.","zh":"“enolized”指化合物已形成（或被转化为）烯醇式，常用于描述酮-烯醇互变等过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Converted into an enol form; having undergone enolization (a keto form changes to an enol form).","zh":"（化学）已转变为烯醇形式的；发生了烯醇化（酮式转变为烯醇式）的。"},"examples":[{"en":"Under basic conditions, the ketone can become enolized and react with an electrophile.","zh":"在碱性条件下，这个酮可能发生烯醇化，并与亲电试剂反应。"},{"en":"The enolized product is usually present in small amounts because it quickly shifts back to the keto form.","zh":"烯醇式产物通常含量很少，因为它会很快转回酮式。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “enolize”: to cause a compound to form an enol, or to form an enol (especially in keto–enol tautomerism).","zh":"“enolize”的过去式/过去分词：使化合物形成烯醇式；或（化合物）形成烯醇式（尤指酮-烯醇互变）。"},"examples":[{"en":"The aldehyde enolized during the reaction and then formed a new carbon–carbon bond.","zh":"该醛在反应过程中发生了烯醇化，随后形成了新的碳-碳键。"},{"en":"Once enolized, the molecule can be deprotonated at the alpha carbon more easily.","zh":"一旦烯醇化，该分子在α-碳处更容易被去质子化。"}]}],"synonyms":["enol-form","tautomerized (in context)","converted to the enol form"],"phonetic":"/ɪˈnɑːlˌaɪzd/","extraExplanation":["“enolized / enolize”主要用于有机化学语境，和“keto–enol tautomerism（酮-烯醇互变）”密切相关：含有羰基（C=O）的化合物在酸/碱条件下，可能在α-位（羰基旁边的碳）发生质子转移与双键重排，生成含C=C与–OH的“烯醇式（enol）”。","在教材与论文中你还会看到相关词：enolization（烯醇化，名词）、enolate（烯醇盐/烯醇负离子，常见亲核体）、tautomer（互变异构体）。这些词常一起出现，用来解释如醛醇反应（aldol reaction）等机理。"]}
{"word":"enolizing","summary":{"en":"Enolizing means converting to (or forming) the enol form of a compound in chemistry.","zh":"Enolizing 指在化学中转变为（或形成）烯醇形式，即发生酮-烯醇互变。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) to change (a compound) into its enol form, or to undergo keto–enol tautomerism.","zh":"（化学）使（化合物）转变为烯醇形式；或发生酮-烯醇互变异构。"},"examples":[{"en":"Under acidic conditions, the ketone can be enolizing briefly before it reacts.","zh":"在酸性条件下，酮可能会短暂地发生烯醇化，然后再发生反应。"},{"en":"The molecule is enolizing in solution, so you may observe an equilibrium mixture.","zh":"该分子在溶液中发生烯醇化，因此你可能会观察到一个平衡混合物。"}]}],"synonyms":["tautomerizing","forming an enol","enolate-forming"],"phonetic":"/ɪˈnɑːl.aɪ.zɪŋ/","extraExplanation":["“enolizing”是动词“enolize”的现在分词/动名词形式，常见于有机化学语境。","烯醇（enol）指含有“碳碳双键 + 羟基（C=C–OH）”的结构；许多酮或醛可在一定条件下与其烯醇形式互相转化，这种现象叫“酮-烯醇互变异构（tautomerism）”。","在机理题中，烯醇化常与“形成烯醇/烯醇盐（enolate）”“α-位氢被夺取（deprotonation at the alpha carbon）”等概念一起出现。"]}
{"word":"enological","summary":{"en":"Enological means “related to the study of wine,” especially winemaking and tasting.","zh":"enological 指“与葡萄酒学相关”，尤其涉及酿造与品鉴等研究。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the study of wine (including how it is made and how it tastes).","zh":"与葡萄酒学有关的；涉及葡萄酒的酿造与品鉴等研究。"},"examples":[{"en":"She took an enological course to learn how wine is made.","zh":"她选了一门葡萄酒学课程来学习葡萄酒是如何酿造的。"},{"en":"The museum hosted an enological workshop with local winemakers.","zh":"博物馆举办了一场葡萄酒学工作坊，邀请了当地酿酒师。"}]}],"synonyms":["oenological","wine-related","vinous (less exact)"],"phonetic":"/ˌiːnəˈlɑːdʒɪkəl/","extraExplanation":["词源提示：enological 来自 enology / oenology（葡萄酒学），源于希腊语 oinos（葡萄酒）+ -logy（学科/研究）。两种拼写 enology 与 oenology 都常见，含义相同；oenology 更偏传统/学术拼写。","使用场景：在酒庄、葡萄酒课程、品鉴活动、餐饮与侍酒师（sommelier）语境里常见；更偏正式，不太用于日常闲聊。","相关词：enology/oenology（名词：葡萄酒学），oenologist/enologist（名词：葡萄酒学家/酿酒研究人员），viticulture（葡萄栽培学，强调种植而非酿造）。"]}
{"word":"enologies","summary":{"en":"“Enologies” is the plural of “enology,” meaning the science and study of wine and winemaking, or different approaches within that field.","zh":"“Enologies”是“enology”的复数，指葡萄酒与酿造的科学研究，或该领域中不同的流派/方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study and science of wine and winemaking","zh":"葡萄酒学；酿酒学（研究葡萄酒与酿造的科学）"},"examples":[{"en":"She studied enology at university and now works at a winery.","zh":"她在大学学习葡萄酒学，现在在酒庄工作。"},{"en":"The course covers enology topics like fermentation, tasting, and quality control.","zh":"这门课程涵盖发酵、品鉴和质量控制等葡萄酒学主题。"}]},{"partOfSpeech":"n.","definition":{"en":"different approaches or fields within the study of wine (plural: enologies)","zh":"葡萄酒学的不同分支或方法（复数：enologies）"},"examples":[{"en":"The conference compared Old World and New World enologies.","zh":"这次会议比较了旧世界与新世界的葡萄酒学理念/方法。"}]}],"synonyms":["oenology","wine science","viticulture and enology"],"phonetic":"iˈnɑlədʒi","extraExplanation":["“enology”也常写作“oenology”。其中“oe-”源自希腊语 oinos（酒、葡萄酒），英式拼写更常见“oenology”，美式语境里“enology”更常见。","在日常交流中更常见的是单数“enology”。“enologies”较少见，通常用于强调“不同流派/体系的葡萄酒学”。"]}
{"word":"enologist","summary":{"en":"An enologist is a wine science expert who studies and helps guide winemaking.","zh":"enologist 指研究并指导葡萄酒酿造的葡萄酒科学专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist or specialist who studies wine and the process of making it (winemaking).","zh":"葡萄酒学家；酿酒学专家（研究葡萄酒及其酿造过程的人）"},"examples":[{"en":"The enologist checked the grape sugar levels before fermentation.","zh":"酿酒学家在发酵前检查了葡萄的含糖量。"},{"en":"Our winery hired an enologist to improve the flavor and consistency of the wines.","zh":"我们的酒庄聘请了一位酿酒学家来提升葡萄酒的风味和稳定性。"}]}],"synonyms":["wine scientist","oenologist","wine expert"],"phonetic":"/iˈnɑlədʒɪst/","extraExplanation":["“enologist”常与“winemaker（酿酒师）”一起出现：winemaker更偏向实际操作与管理酒庄生产；enologist更强调科学分析与技术（如发酵控制、酸度/糖度检测、风味评估等）。","词源提示：来自希腊语“oinos（葡萄酒）”+ “-logy（学科/研究）”。在葡萄酒行业里也常写作“oenologist”（英式拼写）。"]}
{"word":"enology","summary":{"en":"Enology is the scientific study of wine and how it is made.","zh":"Enology 指研究葡萄酒及其酿造过程的学科（酿酒学/葡萄酒学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of wine and winemaking (including grape growing, fermentation, aging, tasting, and quality control)","zh":"葡萄酒学；酿酒学（研究葡萄酒与酿造过程，包括葡萄栽培、发酵、陈酿、品鉴与质量控制等）"},"examples":[{"en":"She studied enology in college and now works at a winery.","zh":"她在大学学习酿酒学，现在在酒庄工作。"},{"en":"Courses in enology often include wine tasting and lab work.","zh":"酿酒学课程通常包括品酒和实验室操作。"}]}],"synonyms":["oenology","wine science","winemaking (general sense)"],"phonetic":"/ɪˈnɑlədʒi/","extraExplanation":["词形常见为 **enology**（美式拼写）与 **oenology**（英式/更传统拼写），都源自希腊语 *oinos*（葡萄酒）+ *-logy*（学科/研究）。","在日常语境中，**enology** 更偏“科学与生产”（发酵、化学、微生物等），而 **viticulture** 指“葡萄栽培”。两者常一起出现：*viticulture and enology*（葡萄栽培与酿酒）。"]}
{"word":"enols","summary":{"en":"“Enols” are compounds (or forms) with a C=C double bond and an –OH group on the double-bonded carbon; they often appear in equilibrium with ketones/aldehydes.","zh":"“Enols”指含有碳—碳双键且在双键碳上连有 –OH 的化合物（或结构形式）；常与酮/醛之间处于平衡互变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of enol: an organic compound (or form of a compound) that has a carbon–carbon double bond and a hydroxyl group (–OH) attached to one of the double-bonded carbons.","zh":"enol 的复数：一种有机化合物（或某化合物的一种形式），特点是在碳—碳双键上连着一个羟基（–OH）（羟基连在双键的其中一个碳上）。"},"examples":[{"en":"Many carbonyl compounds exist partly as enols in solution.","zh":"许多羰基化合物在溶液中会有一部分以烯醇（enol）的形式存在。"},{"en":"In basic conditions, enols can react as nucleophiles in some reactions.","zh":"在碱性条件下，烯醇在某些反应中可以作为亲核体参与反应。"},{"en":"Chemistry students often learn how enols and ketones can interconvert.","zh":"化学学生常会学习烯醇与酮如何相互转化。"}]}],"synonyms":["enol forms","alkenols (less common)"],"phonetic":"/ˈiːnɔlz/","extraExplanation":["“enol”来自“ene（烯，表示双键）+ ol（醇，表示 –OH）”，所以字面意思就是“带双键的醇”。","烯醇最常见的学习背景是“酮式–烯醇式互变异构（keto–enol tautomerism）”：同一个分子在不同形式之间可快速平衡转化。通常酮式更稳定，但在某些情况下（例如形成共轭或氢键稳定）烯醇比例会增加。","在很多反应机理中，真正参与反应的常是烯醇的相关形式“烯醇负离子（enolate）”，它比中性的烯醇更常见、更活泼。"]}
{"word":"enomania","summary":{"en":"Enomania (more commonly oenomania) means an obsessive craving or mania for wine.","zh":"enomania（更常见拼作 oenomania）指对葡萄酒的痴迷或异常渴求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal or obsessive craving for wine; a form of “wine mania.”","zh":"对葡萄酒的异常或痴迷式渴求；“嗜酒（葡萄酒）癖/酒迷”。"},"examples":[{"en":"Some writers use the word oenomania (sometimes spelled enomania) to describe an obsessive fixation on wine.","zh":"一些作者用 oenomania（有时也拼作 enomania）来形容对葡萄酒的痴迷。"},{"en":"He joked that his cellar-building hobby had turned into enomania.","zh":"他开玩笑说自己建酒窖的爱好已经变成了“葡萄酒痴迷”。"}]}],"synonyms":["oenomania","wine obsession","wine mania","wine addiction (informal)"],"phonetic":"/ˌiːnoʊˈmeɪniə/","extraExplanation":["“enomania”较少见，更常见的拼法是“oenomania”。前缀“oeno-”来自希腊语“oinos（葡萄酒）”，与“oenology（葡萄酒学）”“oenophile（葡萄酒爱好者）”同源。","该词通常带一点幽默或夸张色彩，用来强调“痴迷/上瘾”的程度；在正式医学语境中更常用“alcohol use disorder（酒精使用障碍）”。"]}
{"word":"enomaniac","summary":{"en":"An enomaniac is someone intensely obsessed with wine.","zh":"enomaniac 指对葡萄酒非常痴迷的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is excessively enthusiastic about or obsessed with wine (a wine fanatic).","zh":"对葡萄酒过度热衷、近乎痴迷的人（酒迷/葡萄酒狂热者）。"},"examples":[{"en":"He’s an enomaniac who plans vacations around vineyards and tastings.","zh":"他是个葡萄酒迷，度假都会围着葡萄园和品酒安排。"},{"en":"As an enomaniac, she keeps detailed notes on every bottle she tries.","zh":"作为葡萄酒狂热者，她会为每一瓶尝过的酒做详细笔记。"}]}],"synonyms":["wine fanatic","wine lover","wine enthusiast","oenophile"],"phonetic":"/ˌiːnoʊˈmeɪniæk/","extraExplanation":["这个词很少见，更常见的说法是 wine lover（爱酒的人）、wine enthusiast（葡萄酒爱好者）或 oenophile（葡萄酒鉴赏/爱好者，较正式）。enomaniac 含有“过度、近乎上瘾”的语气，使用时注意场合，可能带一点戏谑或夸张。","词源提示：eno- 来自希腊语 oinos（葡萄酒），-maniac 表示“狂热者/痴迷者”。拼写上有时也会见到 oenomania（对葡萄酒的痴迷）这样的相关词。"]}
{"word":"enomotarch","summary":{"en":"An enomotarch was a Spartan officer who commanded an enomoty, a small military unit.","zh":"enomotarch 指古斯巴达军队中指挥 enomoty（小型编制单位）的军官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Sparta, an officer who commanded an enomoty (a small military unit, roughly a platoon or squad).","zh":"（古斯巴达）“艾诺莫提”（enomoty，一种小型军队编制，约相当于班/排）的指挥官。"},"examples":[{"en":"The enomotarch led his men during training drills.","zh":"这位 enomotarch 在训练操练中带领士兵。"},{"en":"In some accounts, discipline in an enomoty depended heavily on the enomotarch.","zh":"在一些记载中，艾诺莫提的纪律很大程度上取决于 enomotarch。"}]}],"synonyms":["Spartan officer","unit commander"],"phonetic":"/əˈnɑːməˌtɑːrk/","extraExplanation":["这个词多见于古希腊/斯巴达军制的历史书写或学术文章中，日常英语几乎不用。","词源来自希腊语：enōmotía（“一队/一编制”，原意与“宣誓结队”相关）+ -arch（“统领、长官”，见于 monarch、patriarch）。","不同史料对 enomoty 的规模描述不尽相同；学习时可把它理解为“较小的基层战斗单位”，enomotarch 即其指挥官。"]}
{"word":"enomoty","summary":{"en":"Enmity means deep hatred or hostility.","zh":"Enmity 指深刻的仇恨或敌意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deep hatred or strong hostility toward someone or something.","zh":"（对某人/某事的）仇恨，敌意；强烈的对立情绪"},"examples":[{"en":"There has been enmity between the two families for years.","zh":"这两个家族多年来一直结怨。"},{"en":"Old enmity made it hard for them to work together.","zh":"旧日的敌意让他们很难合作。"},{"en":"The war increased enmity between the neighboring countries.","zh":"这场战争加深了邻国之间的敌意。"}]}],"synonyms":["hostility","hatred","animosity","antagonism","ill will"],"phonetic":"/ˈɛn.mə.t̬i/","extraExplanation":["你输入的 **enomoty** 很可能是拼写错误；正确拼写通常是 **enmity**。","常见搭配：**enmity between A and B**（A与B之间的敌意）、**deep/bitter enmity**（深/刻骨的仇恨）、**ancient/old enmity**（宿怨）。","词源提示：来自拉丁语 *inimicus*（敌人），与 *enemy*（敌人）同源，意思核心都是“把对方当作敌人”。"]}
{"word":"enophthalmos","summary":{"en":"Enophthalmos means a sunken eyeball (the eye sits deeper in the socket than normal).","zh":"Enophthalmos 指眼球内陷（眼球位于眼眶内的位置比正常更深）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which an eyeball is sunken deeper into the eye socket than normal","zh":"（医学）眼球内陷：眼球比正常更深地陷入眼眶内"},"examples":[{"en":"After the facial fracture, the doctor checked for enophthalmos.","zh":"面部骨折后，医生检查是否出现眼球内陷。"},{"en":"The scan showed mild enophthalmos on the left side.","zh":"影像检查显示左侧有轻度眼球内陷。"}]}],"synonyms":["sunken eye","posterior displacement of the eyeball"],"phonetic":"/ˌɛn.əfˈθæl.məs/","extraExplanation":["词源：来自希腊语 en-（“向内”）+ ophthalmos（“眼睛”）。所以字面意思就是“眼睛向内”。","常见相关原因（简要）：眼眶骨折导致眼眶容积变大、眼眶脂肪减少/萎缩、某些炎症或肿瘤治疗后组织改变等。具体原因需由眼科或整形/颌面外科评估。","易混词：exophthalmos（眼球突出，常见于甲状腺相关眼病）。两者一个“内陷”，一个“突出”，方向相反。"]}
{"word":"enophthalmus","summary":{"en":"Enophthalmus is a medical term for a sunken-looking eye caused by the eyeball being set back in the socket.","zh":"Enophthalmus 是医学术语，指眼球向眼眶内后移导致眼睛看起来凹陷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) a condition in which the eyeball is displaced backward into the eye socket, making the eye look sunken.","zh":"（医学）眼球后陷：眼球向眼眶内后移，使眼睛看起来凹陷。"},"examples":[{"en":"After the injury, the doctor noted mild enophthalmus in his left eye.","zh":"受伤后，医生发现他的左眼有轻度眼球后陷。"},{"en":"Enophthalmus can occur after an orbital fracture or loss of tissue around the eye.","zh":"眼球后陷可能在眼眶骨折后出现，或因眼周组织减少而发生。"}]}],"synonyms":["enophthalmos","sunken eye(s)"],"phonetic":"/ˌɛnəfˈθælməs/","extraExplanation":["“Enophthalmus”在现代医学英语中较少见，更常用的拼写是 **enophthalmos**（意思相同）。","词源来自希腊语：**en-**（在内）+ **ophthalmos**（眼），字面意思是“眼睛向内”。","这是一个较为专业的临床用语，常见于眼科、急诊或影像学报告中；日常英语通常会说 **sunken eye(s)**（凹陷的眼睛）。"]}
{"word":"enopla","summary":{"en":"Enopla is a zoology term for a group of ribbon worms characterized by a stylet-armed proboscis.","zh":"Enopla 是动物学术语，指一类纽虫（带形虫），其典型特征是带刺针的可外翻吻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (formerly a class) of ribbon worms (phylum Nemertea) that typically have an armed proboscis with one or more stylets, used for catching prey","zh":"（旧分类中）有吻纲：纽形动物门（带形虫/纽虫）的一类，典型特征是吻（可外翻的口器）带有刺针（stylet），用来捕食"},"examples":[{"en":"In older textbooks, many predatory ribbon worms with a stylet-bearing proboscis are placed in Enopla.","zh":"在一些较旧的教材里，许多带刺针吻、以捕食为主的纽虫会被归入有吻纲（Enopla）。"},{"en":"The lab specimen was identified as an enoplan nemertean because it had a visible stylet.","zh":"这个实验标本因可见刺针而被鉴定为有吻纲（Enopla）的纽虫。"}]}],"synonyms":["enoplan","enoplan nemertean"],"phonetic":"/ɪˈnɑːplə/","extraExplanation":["“Enopla”主要出现在动物分类学语境中；现代分类有时会调整层级或分组方式，但学习时可把它理解为“带刺针吻的纽虫类群”。","对比记忆：Anopla（无吻刺/无刺针）常被用来与 Enopla 作对照，帮助理解其关键特征。"]}
{"word":"enoplan","summary":{"en":"“Enoplan” is not a standard English word; it’s likely a misspelling (maybe “airplane/aeroplane”) or a proper name.","zh":"“enoplan”不是标准英语词；可能是拼写错误（如 airplane/aeroplane）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a proper name (e.g., a brand/company/product name).","zh":"不是标准英语单词；更可能是拼写错误或专有名词（例如品牌/公司/产品名）。"},"examples":[{"en":"I can’t find “enoplan” in standard English dictionaries—could you mean “airplane” (US) or “aeroplane” (UK)?","zh":"我在标准英语词典里找不到“enoplan”；你是不是想写“airplane”（美式）或“aeroplane”（英式）？"},{"en":"If Enoplan is a company name, please share the sentence or link so I can explain it in context.","zh":"如果 Enoplan 是公司名，请给我一句原文或链接，我可以结合语境解释。"}]}],"synonyms":["airplane","aeroplane"],"phonetic":"/ˈɛnəˌplæn/","extraExplanation":["“enoplan”看起来像拼写错误：常见目标词可能是 airplane（美式“飞机”）/ aeroplane（英式“飞机”）。也可能是某个品牌或项目名称（专有名词通常不收录在普通词典里）。","把它放进一句话里或提供来源（网站/图片/段落），我就能判断它具体指什么，并给出更准确的释义与用法。"]}
{"word":"enoplion","summary":{"en":"“Enoplion” is not a common standard English word; it’s likely a misspelling, rare technical term, or proper name.","zh":"“enoplion”不是常见规范英文词；更可能是拼写错误、罕见术语或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling, a very rare technical term, or a proper name (e.g., a name in fantasy/science fiction).","zh":"不是常见词典里的标准英文词；可能是拼写错误、非常罕见的专业术语，或专有名词（例如奇幻/科幻作品中的名称）。"},"examples":[{"en":"I couldn’t find “enoplion” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英文词典里找不到“enoplion”——你可以把看到它的句子发我吗？"},{"en":"It might be a misspelling of a similar-looking word; checking the original source can help.","zh":"它可能是某个相近拼写单词的误写；核对原始出处会更清楚。"}]}],"extraExplanation":["“enoplion”看起来可能来源于希腊语词根 *hoplon*（武器、装备）相关的构词（如 *enoplios* 表示“武装的”），但在英语里并不作为常见规范词条出现。也有可能是某个生物学/古典学领域的极罕用术语或专名。若你提供上下文（学科、句子、作者/作品名），我可以更准确判断含义与读音。"]}
{"word":"enoptromancy","summary":{"en":"Enoptromancy means fortune-telling by using a mirror or reflective surface.","zh":"Enoptromancy 指“通过镜子或反光表面进行占卜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Divination (fortune-telling) by looking into a mirror or other reflective surface; mirror scrying.","zh":"通过镜子或其他反光表面进行占卜；镜占（镜面凝视占卜）。"},"examples":[{"en":"In some folktales, a witch practices enoptromancy by staring into a mirror to see distant events.","zh":"在一些民间故事里，女巫会通过凝视镜子进行 enoptromancy（镜占），以看到远处发生的事。"},{"en":"The museum’s exhibit on magic mentioned enoptromancy alongside crystal-gazing.","zh":"博物馆关于魔法的展览提到了 enoptromancy（镜占），并把它与水晶凝视占卜并列介绍。"}]}],"synonyms":["catoptromancy","mirror divination","scrying","mirror scrying"],"phonetic":"/ˌɛnɑpˈtroʊmənsi/","extraExplanation":["词源上可拆为希腊语元素：*en-*（在……之中）+ *optro-*（与“看/视觉”相关）+ *-mancy*（占卜）。整体意思就是“在（镜中）观看来占卜”。","易混淆词：**catoptromancy** 也常指“镜占/反射占卜”，实际使用中两者含义高度接近；更通俗的说法是 **scrying**（凝视占卜），材料可包括镜子、水面或水晶球。","文化语境：镜子在许多传统里既象征“真相/自我”，也被认为是通往未知的媒介，因此常出现在民俗、哥特文学与奇幻作品中。"]}
{"word":"enorganic","summary":{"en":"Enorganic is a rare, old-fashioned word meaning “organic” or “related to living bodily structures.”","zh":"Enorganic 是一个罕见的旧用词，大致相当于“organic（有机的）”，也可指“与生命/器官结构有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/old-fashioned) Having the nature of an organism; organic; consisting of or relating to living structures.","zh":"（罕见/旧用）具有生物体的性质；有机的；由生命结构构成的或与之相关的。"},"examples":[{"en":"In some older texts, “enorganic” is used where modern English would say “organic.”","zh":"在一些较早的文本里，“enorganic”常用在现代英语会说“organic（有机的）”的地方。"},{"en":"The author describes the brain as an enorganic system that adapts over time.","zh":"作者把大脑描述为一种会随时间适应变化的“enorganic（有机的/生命性的）”系统。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Connected with or produced by bodily organs; involving physical organization.","zh":"（极罕见）与身体器官有关或由器官产生的；涉及生理结构的。"},"examples":[{"en":"The essay contrasts enorganic sensation with purely mechanical motion.","zh":"这篇文章把“enorganic（与器官有关的）感觉”与纯粹机械运动作对比。"}]}],"synonyms":["organic","living","biological"],"phonetic":"/ˌɛnɔrˈɡænɪk/","extraExplanation":["“enorganic”在现代英语中非常少见，多见于19世纪或更早的哲学、医学或文学语境。日常写作中通常用“organic”（有机的）或“inorganic”（无机的）。","如果你原本想写“inorganic”（无机的），拼写是 i-n-o-r-g-a-n-i-c。若想表达“有机的/自然形成的”，用“organic”更地道。"]}
{"word":"enorm","summary":{"en":"“Enorm” is an informal abbreviation of “enormous,” meaning extremely large or very much, mainly used in casual writing or texting.","zh":"“enorm”是“enormous”的非正式缩写，表示“非常巨大/很多”，主要用于口语化的聊天或随手写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Short for “enormous”; extremely large in size, amount, or degree.","zh":"（非正式）“enormous”的缩写；非常巨大的、数量很多的、程度很高的。"},"examples":[{"en":"That backpack is enorm—I don’t know how you carry it.","zh":"那个背包也太大了——我都不知道你怎么背得动。"},{"en":"We made an enorm mistake by leaving too late.","zh":"我们因为出发太晚犯了个大错。"}]},{"partOfSpeech":"other","definition":{"en":"(Informal, abbreviation in texting/writing) Used as a casual emphasis meaning “really big” or “a lot.”","zh":"（非正式，短信/随笔里的缩写）用作强调，表示“特别大 / 特别多”。"},"examples":[{"en":"The wait was enorm, but the food was worth it.","zh":"等得超级久，但食物很值得。"},{"en":"Thanks for the enorm help!","zh":"谢谢你帮了我大忙！"}]}],"synonyms":["enormous","huge","massive","gigantic","immense"],"phonetic":"/ɪˈnɔrm/","extraExplanation":["“enorm”不是标准书面英语，更多见于聊天、短信、随手笔记等场景。正式写作（论文、邮件、简历）建议用“enormous”。","注意别和“enormity”混淆：enormity 常指“严重性/恶行之大”，而不是单纯的“巨大”。"]}
{"word":"enormious","summary":{"en":"Enormous means “extremely large or huge.”","zh":"enormous 意为“非常大、巨大”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely large in size, amount, or degree; huge.","zh":"（尺寸、数量或程度）巨大的；庞大的。"},"examples":[{"en":"They live in an enormous house near the lake.","zh":"他们住在湖边一栋巨大的房子里。"},{"en":"An enormous crowd showed up for the concert.","zh":"一大群人来参加音乐会。"},{"en":"She made an enormous effort to learn English every day.","zh":"她每天付出很大的努力学习英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common, formal/old-fashioned) Extremely bad or shocking; outrageous.","zh":"（较少见，较正式/旧式）极其恶劣的；骇人听闻的。"},"examples":[{"en":"Some writers once used “enormous” to describe an enormous crime.","zh":"一些作家曾用“enormous”来形容骇人听闻的罪行。"}]}],"synonyms":["huge","massive","gigantic","enormous","immense","vast"],"phonetic":"/ɪˈnɔrməs/","extraExplanation":["你输入的 **enormious** 通常是 **enormous** 的常见拼写错误。记忆小技巧：**enormous** 里是 **-mous**（像 famous 里的 -mous），不是 **-mious**。","词源上它和“norm（规范/标准）”有关，早期含义偏向“偏离规范、过分、恶劣”，现代英语里最常用的意思已经固定为“非常大”。"]}
{"word":"enormities","summary":{"en":"“Enormities” most commonly means serious wrongdoings or shocking crimes; less commonly, it can mean extremely large things or amounts.","zh":"“enormities”最常指严重恶行或滔天罪行；较少见地也可指极其庞大的事物或数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Very great wrongdoings; serious crimes or morally shocking acts.","zh":"滔天罪行；严重的不道德行为（令人震惊的恶行）。"},"examples":[{"en":"The report documented the enormities committed during the war.","zh":"报告记录了战争期间犯下的滔天罪行。"},{"en":"She spoke out against the enormities of corruption in local government.","zh":"她公开谴责地方政府中的严重腐败恶行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Extremely large things or amounts; huge size or scale.","zh":"（较少见）极其庞大的事物或数量；巨大规模。"},"examples":[{"en":"They underestimated the enormities of the task ahead.","zh":"他们低估了前方任务的巨大规模。"},{"en":"The novel describes the enormities of the landscape in the American West.","zh":"这部小说描写了美国西部地貌的宏大壮阔。"}]}],"synonyms":["atrocities","outrages","heinous acts","crimes","abuses"],"phonetic":"/ɪˈnɔrmətiz/","extraExplanation":["“enormities”是“enormity”的复数。现代英语里，enormity最常指“严重罪行/恶行”，尤其在新闻、法律、历史语境中。","容易与“enormousness”（巨大程度）混淆：enormousness更明确表示“巨大”，而enormity在当代更常带强烈负面道德判断。虽然“巨大规模”这一义项仍存在，但相对少见，使用时可能引起歧义。","在文学与修辞中，用enormities形容“罪行”会带有谴责与震撼的语气，强调其道德上的不可饶恕。"]}
{"word":"enormity","summary":{"en":"Enormity most strictly means “great wickedness or a shocking crime,” though it is also commonly (especially informally) used to mean “great size or extent.”","zh":"Enormity严格意义上指“极其邪恶的行为/滔天罪行”，但现代英语中也常（尤其非正式）用来表示“规模或程度巨大”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extremely wicked or morally shocking act; great evil or outrage.","zh":"极其邪恶或令人道德震惊的行为；滔天罪行。"},"examples":[{"en":"Many people were horrified by the enormity of the crime.","zh":"许多人对这起罪行的滔天恶行感到震惊。"},{"en":"The report details the enormity of the abuses committed during the war.","zh":"报告详细描述了战争期间所犯下的严重暴行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often in informal use) Great size or extent; immensity.","zh":"（常见于非正式用法）巨大；广阔；庞大程度。"},"examples":[{"en":"She was unprepared for the enormity of the task ahead.","zh":"她对眼前任务的艰巨程度毫无准备。"},{"en":"We didn’t understand the enormity of the damage until morning.","zh":"直到早上我们才意识到破坏有多严重（规模有多大）。"}]}],"synonyms":["atrocity","heinousness","outrage","immensity","vastness"],"phonetic":"/ɪˈnɔrməti/","extraExplanation":["“enormity”传统上主要指“道德上的极端邪恶/暴行”，强调“性质恶劣”；但在现代英语中，很多人也用它表示“规模巨大/程度极大”（更接近“immensity”）。在正式写作里，如果你只想表达“巨大”，用“immensity / enormity of the task (informal)”或直接用“immense/huge”更稳妥；如果你用“enormity”指“巨大”，读者有时会误以为你在暗示“道德上的可憎”。","词源上来自拉丁语“enormis”（意为“超出常规/不合规范”），因此更容易发展出“越轨、骇人”的道德色彩。"]}
{"word":"enormous","summary":{"en":"Enormous means extremely large or very great (in size, amount, or degree).","zh":"enormous 表示“极其巨大/非常多/程度很强”，可用于具体事物或抽象概念。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very large in size, amount, or degree; extremely big.","zh":"巨大的；庞大的；非常多的（数量/程度很大）。"},"examples":[{"en":"An enormous elephant stood quietly near the river.","zh":"一头巨大的大象安静地站在河边。"},{"en":"She felt enormous pressure before the exam.","zh":"考试前她感到巨大的压力。"},{"en":"The project was an enormous success.","zh":"这个项目获得了巨大成功。"}]}],"synonyms":["huge","massive","gigantic","immense","vast"],"phonetic":"/ɪˈnɔrməs/","extraExplanation":["“enormous”常用于强调“超出一般的大”，语气比“very big”更强；既可形容具体大小（enormous building），也常形容抽象概念（enormous pressure / influence / cost）。","词源上与“norm（规范/标准）”有关，隐含“超出常规/标准”的感觉，因此带有“夸张的大、不同寻常的大”的强调意味。","常见搭配：enormous amount/number, enormous difference, enormous impact, enormous potential, enormous responsibility。"]}
{"word":"enormously","summary":{"en":"“Enormously” means “extremely” or “by a very large amount/degree.”","zh":"“enormously”表示“极其；非常”，也可表示“在数量或幅度上巨大地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"To a very great degree; extremely.","zh":"极其；非常（程度很大）。"},"examples":[{"en":"I enjoyed the trip enormously.","zh":"我非常享受这次旅行。"},{"en":"Your help mattered enormously to us.","zh":"你的帮助对我们来说非常重要。"},{"en":"The project grew enormously over time.","zh":"这个项目随着时间发展壮大了很多。"}]},{"partOfSpeech":"adv.","definition":{"en":"By a very large amount or size; hugely.","zh":"以巨大的数量或规模；大幅度地。"},"examples":[{"en":"The company’s costs increased enormously last year.","zh":"这家公司去年的成本大幅上升。"},{"en":"The stadium is enormously large.","zh":"这个体育场非常大。"}]}],"synonyms":["extremely","tremendously","immensely","vastly","hugely"],"phonetic":"/ɪˈnɔrməsli/","extraExplanation":["“enormously”来自形容词“enormous”（巨大的），常用来修饰动词或形容词，语气比“very”更强，接近“extremely / tremendously”。在正式写作与口语中都常见。","注意搭配：常见于“enormously important / successful / helpful”“increase/grow enormously”。用来表达“程度/幅度很大”，但不一定是“身体尺寸很大”，也可以是“影响很大”。"]}
{"word":"enormousness","summary":{"en":"Enormousness means the state or quality of being extremely large or immense.","zh":"Enormousness 指“极其巨大、庞大”的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being extremely large in size, amount, or degree; immensity.","zh":"极其巨大、庞大（在大小、数量或程度上）的性质；浩大、无边。"},"examples":[{"en":"The enormousness of the universe is hard to imagine.","zh":"宇宙的浩瀚之大令人难以想象。"},{"en":"She was shocked by the enormousness of the debt.","zh":"她被债务的巨大规模震惊了。"},{"en":"From the hilltop, you can sense the enormousness of the desert.","zh":"从山顶上，你能感受到沙漠的无边广阔。"}]}],"synonyms":["immensity","vastness","hugeness","gigantic size","sheer size"],"phonetic":"/ɪˈnɔrməsnəs/","extraExplanation":["“Enormousness”是由形容词“enormous（巨大的）”加名词后缀“-ness”构成，表示“……的性质/状态”。在正式写作中，人们更常用“enormity”或“immensity/vasterness”，但要注意：在严格语境里“enormity”也常指“极大的罪恶/暴行”，并不总等于“巨大”。如果只想表达“非常大”，用“immensity”或直接说“the sheer size”更稳妥。"]}
{"word":"enormousnesses","summary":{"en":"“Enormousnesses” means multiple instances or aspects of being extremely large or great (plural of “enormousness”).","zh":"“enormousnesses”表示“enormousness”的复数，用来指多个/不同方面的“巨大程度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “enormousness”: the quality or state of being extremely large, great, or intense (in size, amount, degree, or impact).","zh":"“enormousness”的复数：极其巨大、极其多、程度极高或影响极强的性质/状态（可指体积、数量、程度或影响）。"},"examples":[{"en":"The report compares the enormousnesses of different cities’ populations over time.","zh":"这份报告比较了不同城市人口规模的“巨大程度”（enormousnesses）随时间的变化。"},{"en":"We were struck by the enormousnesses of the challenges facing the healthcare system.","zh":"我们对医疗系统面临的种种巨大挑战感到震撼。"}]}],"synonyms":["vastnesses","immensities","magnitudes","hugenesses","greatnesses"],"phonetic":"/ɪˈnɔrməsnəsɪz/","extraExplanation":["“enormousnesses”是一个比较少见的复数形式。英语里抽象名词（如 enormousness）通常当作不可数名词使用；当你要强调“不同类型/不同方面的巨大程度”时，才可能用复数，例如：the enormousnesses of the tasks（这些任务各自的巨大程度）。","在日常表达中，更常用的替换说法包括：the sheer size of..., the scale of..., the magnitude of..., enormous challenges / huge differences 等。"]}
{"word":"enorn","summary":{"en":"“Enorn” is a rare, old-fashioned verb meaning “to adorn or decorate.”","zh":"“enorn”是一个罕见、较古旧的动词，意思是“装饰、点缀”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to decorate or adorn (used mainly in older or poetic writing)","zh":"装饰；点缀（多见于古体或诗歌用法）"},"examples":[{"en":"The hall was enorned with flowers and ribbons.","zh":"大厅用鲜花和彩带装饰起来。"},{"en":"In the poem, the poet enorns the night with images of silver light.","zh":"在诗中，诗人用“银色的光”等意象来点缀夜晚。"}]}],"synonyms":["adorn","decorate","embellish","ornament"],"phonetic":"/ɪˈnɔrn/","extraExplanation":["“enorn”是非常少见的词，现代英语里几乎不用；通常会用更常见的“adorn / decorate / embellish”。","词源上与中古法语/古法语中表示“装饰”的形式有关（可联想到“adorn”一类的词）。在文学语境里用它，会带有古雅、诗意的风格。"]}
{"word":"enorthotrope","summary":{"en":"Enantiotrope: a material/crystal form that can reversibly change into another form at a transition temperature.","zh":"Enantiotrope：可逆多形体；能在转变温度下与另一晶型可逆互变的物质/晶体形态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, technical) A substance (or crystalline form) that can reversibly change into another form at a specific transition temperature; the opposite of a monotrope.","zh":"（罕见/专业）“可逆多形体”：一种物质（或晶体形态）能在特定转变温度下可逆地转变为另一种形态；与“单变体（monotrope）”相对。"},"examples":[{"en":"Sulfur has enantiotropic forms: it can switch between two crystal structures depending on temperature.","zh":"硫具有可逆多形：它会随温度在两种晶体结构之间转变。"},{"en":"In an enantiotrope, heating past the transition point changes the crystal form, and cooling can change it back.","zh":"在可逆多形体中，加热超过转变点会改变晶型，冷却后又可能变回去。"}]}],"synonyms":["reversible polymorph"],"phonetic":"/iˈnæn.ti.ə.troʊp/","extraExplanation":["“enorthotrope”不是常见英语词，通常在词典和常用语料中找不到。你可能想写的是 **enantiotrope**（可逆多形体），拼写非常接近。","词源提示：**enantio-** 表示“相反/对立”，**-trope** 表示“转变/转向”。该词多见于矿物学、材料科学、晶体学等领域。","如果你能提供出现它的句子或学科背景（例如化学/晶体/材料/光学），我可以更准确判断是否为术语变体或专有名词。"]}
{"word":"enos","summary":{"en":"Enos is a male name; biblically, it refers to Seth’s son in Genesis.","zh":"Enos 是男性名字；在《圣经》中指《创世记》里塞特的儿子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (also a surname), used especially in English-speaking contexts; in the Bible, Enos is the grandson of Adam (son of Seth).","zh":"男性名字（也可作姓氏），在英语国家较常见；《圣经》中 Enos（以诺士）是亚当的孙子（塞特之子）。"},"examples":[{"en":"Enos is a biblical name that appears in the Book of Genesis.","zh":"Enos 是一个出现在《创世记》中的《圣经》名字。"},{"en":"My great-grandfather’s name was Enos, so we used it for our son.","zh":"我曾祖父叫 Enos，所以我们给儿子也取了这个名字。"}]}],"synonyms":["(no direct synonyms; related names: Enoch, Seth)"],"phonetic":"/ˈiːnəs/","extraExplanation":["在中文语境里，这个名字常被译作“以诺士”（也见作“以挪士”等译法），不同版本的《圣经》中文译名可能略有差异。","作为人名时，它和更常见的名字 Enoch（以诺）不是同一个人名：Enos 指《创世记》中的 Seth 的儿子；Enoch 则是另一位族谱人物。"]}
{"word":"enosis","summary":{"en":"Enosis means political union or unification, most often referring to the movement to unite Cyprus with Greece.","zh":"Enosis 指政治上的联合或统一，最常用来指塞浦路斯与希腊合并的历史运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Union or political unification, especially the historical movement to unite Cyprus with Greece.","zh":"合并；政治统一（尤指历史上主张塞浦路斯与希腊合并的运动）。"},"examples":[{"en":"The idea of enosis shaped much of Cyprus’s politics in the mid-20th century.","zh":"“合并”（enosis）的理念在20世纪中期深刻影响了塞浦路斯的政治。"},{"en":"Some groups campaigned for enosis, while others opposed it and argued for independence.","zh":"一些团体为“合并”（enosis）而奔走，另一些则反对并主张独立。"}]}],"synonyms":["union","unification","political union"],"phonetic":"/eˈnoʊsɪs/","extraExplanation":["“Enosis”来自希腊语，字面意思是“联合/统一”。在英语中它通常是一个带有明确历史语境的术语：多用于讨论塞浦路斯与希腊关系、殖民与民族主义运动、以及相关的政治冲突。","在日常英语里很少用来泛指一般的“联合”，更常见的通用词是 “union / unification / annexation”（其中 annexation 常带“吞并”的强烈政治色彩）。"]}
{"word":"enosises","summary":{"en":"Enosis most often means a political movement for union—especially Cyprus with Greece.","zh":"Enosis通常指“合并/统一”的政治主张，尤指塞浦路斯与希腊合并。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Politics, history) A movement or policy calling for political union of a territory with another state—especially union of Cyprus with Greece.","zh":"（政治/历史）主张某一地区与另一国家实现政治合并（统一）的运动或政策；尤指塞浦路斯与希腊合并的主张。"},"examples":[{"en":"In the mid‑20th century, many Greek Cypriots supported enosis with Greece.","zh":"在20世纪中期，许多希腊裔塞浦路斯人支持与希腊实现“恩诺西斯”（合并）。"},{"en":"The debate over enosis shaped Cyprus’s politics for decades.","zh":"围绕“恩诺西斯”的争论在几十年里影响了塞浦路斯政治。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medicine, rare) A joining together or union of parts (a general sense of “union”).","zh":"（医学，罕见）部分组织的联合、连接（一般意义上的“结合”）。"},"examples":[{"en":"The report described enosis of the tissues after healing.","zh":"报告描述了愈合后组织的连接（联合）。"}]}],"synonyms":["union","political union","unification"],"phonetic":"ɛˈnoʊsɪs","extraExplanation":["“Enosis”来自希腊语，字面意思是“联合/统一”。英语中最常见的用法是指塞浦路斯历史背景下的政治主张：把塞浦路斯与希腊合并。","拼写提示：常见复数是“enoses”（较少见）；“enosises”属于不标准的复数拼写，学习写作中建议避免。"]}
{"word":"enosist","summary":{"en":"Enosis means “union,” especially the historical political movement to unite Cyprus with Greece.","zh":"Enosis 意为“联合/统一”，尤指历史上塞浦路斯“并入希腊”的政治运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Politics, especially in Cypriot history) the movement or policy of uniting a territory with Greece; most often used for Cyprus’s proposed union with Greece.","zh":"（政治，尤指塞浦路斯历史）“并入希腊”的运动或主张；最常指塞浦路斯与希腊合并的诉求。"},"examples":[{"en":"In the 1950s, enosis became a central issue in Cyprus politics.","zh":"在20世纪50年代，“并入希腊”（enosis）成为塞浦路斯政治的核心议题。"},{"en":"Some groups supported enosis, while others feared it would deepen conflict.","zh":"一些团体支持并入希腊（enosis），而另一些人担心这会加深冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"(General) a union or political unification of one group, region, or state with another.","zh":"（一般用法）联合、合并；一个群体、地区或国家与另一个的统一。"},"examples":[{"en":"The speaker argued for enosis as a path to stability.","zh":"演讲者主张通过“联合/统一”（enosis）来实现稳定。"},{"en":"In historical writing, the term can refer to a broader idea of unification.","zh":"在历史写作中，这个词也可指更广泛的“统一”概念。"}]}],"synonyms":["union","unification","annexation","integration"],"phonetic":"/ɛˈnoʊsɪs/","extraExplanation":["你输入的“enosist”很可能是拼写错误；常见词形是 **enosis**（结尾是 -sis，不是 -sist）。","词源来自希腊语 **énōsis**，意为“联合/统一”。在英文中它多带有明确的历史与政治语境（尤其与塞浦路斯有关），使用时通常需要交代背景。"]}
{"word":"enostose","summary":{"en":"Enostosis is a benign “bone island,” a small patch of compact bone within spongy bone.","zh":"Enostosis 指“骨岛/骨内生骨”，是松质骨内一小块良性致密骨灶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A small, benign area of compact bone located inside spongy (cancellous) bone; also called a “bone island.”","zh":"（医学）骨内生骨（骨岛）：在松质骨（骨小梁骨）内部出现的一小块良性致密骨灶，也常被称为“骨岛”。"},"examples":[{"en":"The radiology report described an enostosis in the femur and noted that it was likely benign.","zh":"影像学报告描述股骨内有一处骨内生骨，并注明很可能是良性的。"},{"en":"Most enostoses are found incidentally on X-rays or CT scans.","zh":"多数骨内生骨是在X光或CT检查时偶然发现的。"}]}],"synonyms":["bone island","enostosis"],"phonetic":"ˌɛnəˈstoʊsɪs","extraExplanation":["“enostose”更常见是对标准医学术语“enostosis”的拼写误差；在英文病历、影像报告中通常写作 enostosis（复数 enostoses）。","在影像学语境里，enostosis 常被解释为“bone island（骨岛）”，一般不需要治疗；但医生会结合大小、形态及既往病史判断是否需要随访。"]}
{"word":"enostosis","summary":{"en":"Enostosis is a benign “bone island”—a small area of dense bone found inside a bone, usually noticed on imaging.","zh":"Enostosis 指“骨岛/骨内硬化灶”，是骨内出现的小片致密骨，通常在影像检查中偶然发现且多为良性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A benign (non-cancerous) area of extra bone growth inside a bone, often found incidentally on an X-ray; also called a “bone island.”","zh":"骨内硬化灶；骨岛：骨头内部出现的良性（非癌性）致密骨增生区，常在X光等影像检查中偶然发现。"},"examples":[{"en":"The radiology report described a small enostosis in the femur and said it looked benign.","zh":"放射科报告写到股骨有一个小的骨内硬化灶，并表示影像表现良性。"},{"en":"The doctor reassured her that a bone island (enostosis) usually doesn’t require treatment.","zh":"医生安慰她说，骨岛（骨内硬化灶）通常不需要治疗。"}]}],"synonyms":["bone island","enostose"],"phonetic":"/ˌiːnoʊˈstoʊsɪs/","extraExplanation":["词源提示：en- 表示“在……之内”，ost- 来自希腊语“骨（osteon）”，-osis 常用于表示“状态/过程”。因此 enostosis 字面意思可理解为“骨内的（增生/变化）”。","医学语境中，它常被当作影像学名词使用：多见于无症状、边界清楚的硬化灶。与某些需要进一步排查的骨硬化性病变不同，典型“骨岛”往往随访即可；但是否需要复查要由医生结合大小、形态和症状判断。"]}
{"word":"enough","summary":{"en":"Enough means “sufficient”—as much as needed. It can describe quantity (enough time), degree (warm enough), or be used as a strong stop signal (Enough!).","zh":"Enough 表示“足够的/充分的”，可用于数量（enough time）、程度（warm enough），也可单独表示“够了！”用于制止或表达受够了。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"as much as is needed; sufficient","zh":"足够的；充足的"},"examples":[{"en":"Do we have enough time to finish?","zh":"我们有足够的时间完成吗？"},{"en":"Two blankets are enough for tonight.","zh":"两条毯子今晚就够了。"}]},{"partOfSpeech":"adv.","definition":{"en":"to a necessary or acceptable degree; sufficiently","zh":"足够地；充分地（达到需要或可接受的程度）"},"examples":[{"en":"It isn’t warm enough to go swimming.","zh":"还不够暖，不能去游泳。"},{"en":"She didn’t practice enough.","zh":"她练习得不够。"}]},{"partOfSpeech":"int.","definition":{"en":"used to say you have had as much as you want, or to tell someone to stop","zh":"够了！（表示已经受够/足够了，或让对方停止）"},"examples":[{"en":"Enough! Stop arguing and listen.","zh":"够了！别吵了，听我说。"},{"en":"I’ve had enough of his excuses.","zh":"我受够了他的借口。"}]},{"partOfSpeech":"pron.","definition":{"en":"the amount that is needed; a sufficient quantity","zh":"足够的数量；所需的量"},"examples":[{"en":"I’ve eaten enough, thanks.","zh":"我吃得够了，谢谢。"},{"en":"We didn’t raise enough to cover the costs.","zh":"我们筹到的钱不够支付费用。"}]}],"synonyms":["sufficient","adequate","plenty (of)","enough already (phrase)"],"phonetic":"/ɪˈnʌf/","extraExplanation":["“enough”常放在形容词/副词后面：big enough（够大）、fast enough（够快）。但在名词前：enough money（足够的钱）、enough people（足够的人）。","常见结构：“enough to + 动词”表示“足够……去做……”：She is old enough to drive.（她年龄够大可以开车了。）","语气提醒：单独说“Enough.”在英文里通常比较强硬，接近“别说了/到此为止”。如果想更礼貌，可说“That’s enough, thank you.”或“I think that’s enough for now.”"]}
{"word":"enoughness","summary":{"en":"“Enoughness” means “sufficiency,” the condition of having enough of something.","zh":"“Enoughness”表示“足够/充足”的状态，相当于“sufficiency”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being enough; sufficiency.","zh":"足够；充足；足量（指“足够”的状态或性质）。"},"examples":[{"en":"I questioned the enoughness of the evidence to support the claim.","zh":"我怀疑这些证据是否足够支持这个说法。"},{"en":"The report argues that the enoughness of current funding is uncertain.","zh":"报告认为目前资金是否充足仍不确定。"}]}],"synonyms":["sufficiency","adequacy","plenty","abundance"],"phonetic":"/ɪˈnʌfnəs/","extraExplanation":["“enoughness”在现代英语中不太常见，更多见于学术写作、哲学讨论或刻意的文风中，用来把“enough（足够）”名词化。日常表达更常用：sufficiency（更正式）、adequacy（强调“够不够用/合不合标准”）、having enough（口语）。","常见搭配：the enoughness of + 名词（如 the enoughness of time / resources / evidence）。在更自然的表达中可改为：the sufficiency of time/resources/evidence，或 whether we have enough time/resources/evidence。"]}
{"word":"enoughs","summary":{"en":"“Enoughs” is the plural noun form of “enough,” meaning sufficient amounts (often used to talk about different people’s or situations’ ideas of what is “enough”). It can also be a rare verb meaning “to make sufficient.”","zh":"“Enoughs”是“enough”的复数名词形式，表示“足够的量”（常用来强调不同的人或情境对“够了”的标准不同）。它也可作罕见动词，表示“使足够”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) sufficient amounts; as much as is needed.","zh":"（复数名词）足够的量；所需的充足数量。"},"examples":[{"en":"We have enoughs of everything for the trip—food, water, and blankets.","zh":"我们为旅行准备了各样足够的东西——食物、水和毯子。"},{"en":"Different people have different enoughs when it comes to money.","zh":"谈到钱时，不同的人对“够用”的标准不一样。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) supplies enough; makes sufficient.","zh":"（罕用）使足够；提供足够（的量）。"},"examples":[{"en":"A single battery enoughs the device for a full day of use. (rare)","zh":"一块电池就能让这个设备用一整天。（罕用）"}]}],"synonyms":["sufficiencies","adequate amounts","plenty","enough (as a noun)"],"phonetic":"/ɪˈnʌfs/","extraExplanation":["“enough”最常见的用法其实不是名词，而是形容词或副词：\n- 形容词：enough time / enough money（足够的时间/钱）\n- 副词：fast enough / good enough（够快/够好）\n把“enough”当名词用时，通常写作“enough”（不加复数），而“enoughs”多见于强调“不同的标准/程度”，语气更口语、也较少见。"]}
{"word":"enounce","summary":{"en":"“Enounce” is an old-fashioned verb meaning to state clearly or to utter/pronounce.","zh":"“Enounce”是一个较古老的动词，意思是清楚地陈述，或发音、说出。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To declare or state something clearly; to pronounce or utter (words).","zh":"（古语）清楚地声明或表述；发音、说出（词语）。"},"examples":[{"en":"The witness enounced the facts in a calm voice.","zh":"证人用平静的声音清楚地陈述了事实。"},{"en":"In older texts, writers sometimes used “enounce” where we would say “announce” or “enunciate.”","zh":"在较早的文本中，作者有时用“enounce”，相当于我们今天说的“announce”或“enunciate”。"}]}],"synonyms":["announce","declare","state","enunciate","utter"],"phonetic":"/ɪˈnaʊns/","extraExplanation":["“enounce”在现代英语里很少用，常见替代词是：\n- announce（宣布、公布）\n- state / declare（陈述、声明）\n- enunciate（清晰发音，尤其指把每个音节说清楚）\n日常写作或口语中更建议使用这些现代词。","词源上与拉丁语“宣告、说出”有关，因此在老式或正式文体中更可能出现。"]}
{"word":"enounced","summary":{"en":"“Enounced” means “said clearly and formally” or “declared,” and it’s a rare, formal form of the verb “enounce.”","zh":"“enounced”意为“清楚而郑重地说出/宣告”，是较少见、偏正式的动词“enounce”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of enounce) to say something clearly and publicly; to declare or pronounce.","zh":"（enounce 的过去式/过去分词）清楚而公开地说出；宣布；宣告。"},"examples":[{"en":"The judge enounced the sentence in a steady voice.","zh":"法官用平稳的声音宣告了判决。"},{"en":"She enounced her decision at the meeting so everyone could hear.","zh":"她在会议上清楚地宣布了自己的决定，让大家都听见。"}]}],"synonyms":["announced","declared","proclaimed","pronounced","stated"],"phonetic":"/ɪˈnaʊnst/","extraExplanation":["“enounce”在现代英语中比较少见、略带书面/正式色彩，更常用的近义词是“announce（宣布）”“declare（宣告）”，以及强调“发音清晰”的“enunciate（清晰发音）”。","注意不要把“enounced”误当作“announced（宣布了）”。两者意思接近，但“enounced”更偏“郑重说出/宣示”，在日常口语里不常见。"]}
{"word":"enouncement","summary":{"en":"Enouncement is a rare noun meaning a formal announcement or public statement.","zh":"Enouncement 是一个罕见名词，表示“正式宣布/公开声明”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A public statement or formal announcement; the act of announcing something.","zh":"（罕见）公开声明；正式宣布；宣布这一行为。"},"examples":[{"en":"The company’s enouncement of the new policy came on Monday.","zh":"公司在周一正式宣布了新政策。"},{"en":"After weeks of rumors, the mayor made an enouncement to the press.","zh":"谣言传了几周后，市长向媒体作出正式声明。"}]}],"synonyms":["announcement","pronouncement","declaration","statement"],"phonetic":"/ɪˈnaʊnsmənt/","extraExplanation":["“enouncement”在现代英语中非常少见，很多情况下是把更常用的词拼错或用错了。更自然的表达通常是：\n- announcement（公告、宣布；最常见）\n- pronouncement（正式宣告/裁决，语气更权威）\n- enunciation（清晰发音；与“宣布”不同）\n- denouncement（谴责；意义相反或不同）\n写作或考试中建议优先用“announcement / pronouncement”，除非你在引用历史文本或刻意使用罕见词。"]}
{"word":"enounces","summary":{"en":"“Enounce” means to speak or pronounce something clearly, or to declare something formally. “Enounces” is its third-person singular form.","zh":"“enounce” 指把话说清楚/发音清晰，或正式宣布；“enounces” 是其第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to say something clearly and carefully; to pronounce or state (something) distinctly (formal, somewhat rare).","zh":"清楚、明确地说出；清晰地发音或陈述（较正式、较少见）。"},"examples":[{"en":"Please enounce your name so everyone can hear it.","zh":"请把你的名字清楚地说出来，让大家都能听见。"},{"en":"The actor practiced to enounce every word on stage.","zh":"那位演员练习在舞台上把每个词都发得清清楚楚。"}]},{"partOfSpeech":"vt.","definition":{"en":"to announce or declare a rule, idea, or decision publicly (formal).","zh":"公开宣布；郑重宣告（规则、观点或决定）（正式用法）。"},"examples":[{"en":"The committee enounced a new policy on safety.","zh":"委员会正式宣布了一项新的安全政策。"}]}],"synonyms":["articulate","pronounce","state","declare","announce"],"phonetic":"/ɪˈnaʊns/","extraExplanation":["“enounces” 是动词 “enounce” 的第三人称单数（he/she/it enounces）。日常英语里更常用的说法是 “pronounce clearly / articulate / state / announce”。","这个词来自拉丁语词根，核心含义是“说出来、表述出来”。在现代英语中偏书面、正式，有时带一点“郑重其事”的语气。"]}
{"word":"enouncing","summary":{"en":"Enouncing means stating something clearly and formally (the -ing form of the rare verb enounce).","zh":"enouncing 指清楚而正式地陈述/宣告（较少见动词 enounce 的 -ing 形式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of enounce) saying something clearly and formally; declaring or stating an idea aloud or in writing.","zh":"（enounce 的现在分词）清楚而正式地说出；宣布、陈述（观点或主张）。"},"examples":[{"en":"In the speech, she was enouncing the company’s values in simple language.","zh":"在演讲中，她用简明的语言清楚地阐述了公司的价值观。"},{"en":"The judge paused before enouncing the final decision.","zh":"法官在宣告最终裁决前停顿了一下。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) pronouncing or articulating words distinctly.","zh":"（较少用）清晰发音；把词语咬字说清。"},"examples":[{"en":"He practiced slowly, enouncing each syllable.","zh":"他慢慢练习，把每个音节都清楚地发出来。"}]}],"synonyms":["declare","state","proclaim","utter","articulate"],"phonetic":"/ɪˈnaʊns/","extraExplanation":["“enounce”在现代英语里比较正式、偏书面，常见于演讲、法律或哲学语境中，意思接近“declare / state”。日常更常用的是“announce”（宣布消息）或“pronounce / articulate”（发音清楚）。","拼写上你输入的“enouncing”多半是“enounce”的动词-ing形式；如果你本来想表达“宣布（消息）”，更可能要用“announcing”。"]}
{"word":"enow","summary":{"en":"“Enow” is an archaic form of “enough,” meaning “sufficiently” or “a sufficient number/amount.”","zh":"“enow”是“enough”的古体，表示“足够地/充分地”或“足够的数量/量”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic) enough; sufficiently; in a degree that is adequate.","zh":"（古语）足够地；充分地；达到足以满足需要的程度。"},"examples":[{"en":"We have talked enow for one night—let’s go home.","zh":"我们今晚谈得够多了——回家吧。"},{"en":"If you rest enow, you’ll feel better tomorrow.","zh":"如果你休息得够充分，明天会好些。"}]},{"partOfSpeech":"det.","definition":{"en":"(Archaic, used before plural nouns) enough; a sufficient number or amount.","zh":"（古语，用于复数名词前）足够的；足量的；足够数量的。"},"examples":[{"en":"They had enow supplies to last through the winter.","zh":"他们有足够的补给可以撑过冬天。"},{"en":"There were enow reasons to be cautious.","zh":"谨慎行事的理由已经够多了。"}]}],"synonyms":["enough","sufficiently","adequately","plenty (of)","sufficient"],"phonetic":"/ɪˈnaʊ/","extraExplanation":["“enow”是“enough”的古体形式，现代英语中几乎不用；多见于中古/早期近代英语文学或仿古写作里。","在诗歌或古风叙述中使用“enow”，会带来更古典、文学化的语感；现代日常表达通常直接用“enough”。","文学中可见于较早的作品与仿古文体（例如中世纪/文艺复兴时期诗文），常用来配合韵律或营造时代感。"]}
{"word":"enows","summary":{"en":"“Enows” is an archaic form meaning “enough,” used rarely today and mostly in older or literary texts.","zh":"“enows”是表示“足够”的古用形式，如今很少使用，多见于较老或文学性的文本。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(archaic) Enough; sufficiently; in a sufficient amount.","zh":"（古用）足够；充分地；数量上足够。"},"examples":[{"en":"We have eaten enows, so let’s stop.","zh":"我们吃得够多了，所以就停吧。"},{"en":"If you work hard enows, you will improve.","zh":"如果你足够努力，你就会进步。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic, literary) Enough things or a sufficient amount (used like a noun, meaning “enough”).","zh":"（古用/文学用法）足够的东西；足量（作名词用，相当于“enough”）。"},"examples":[{"en":"He had enows of worries already.","zh":"他已经有够多的烦恼了。"},{"en":"There were enows to share with the guests.","zh":"这些足够分给客人。"}]}],"synonyms":["enough","sufficiently","sufficient","plenty","adequately"],"phonetic":"ɪˈnaʊz","extraExplanation":["“enows”是“enough”的古体/变体，源自中古英语“enow”。现代英语里基本不用，更多出现在较老的文学作品、仿古风格写作，或诗歌里，为了节奏或古典感而使用。","现代写作与考试中建议用“enough / sufficiently / plenty”来替代；看到“enows”时通常可直接理解为“enough”。"]}

