{"word":"enucleate","summary":{"en":"Enucleate means to remove something whole—especially an eye or a tumor—or, more generally, to remove the core/central part.","zh":"enucleate 指将某物整体剥离取出（尤指眼球或肿瘤），也可泛指去除某物的核心部分。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Medicine/biology) To remove an organ, mass, or object as a whole, usually by separating it from surrounding tissue (often used for removing the eye or a tumor without cutting into it).","zh":"（医学/生物）将器官、肿块或异物整体剥离并取出，通常指与周围组织分离后完整移除（常用于摘除眼球或完整剜除肿瘤）。"},"examples":[{"en":"The surgeon decided to enucleate the tumor to reduce the risk of leaving cancer cells behind.","zh":"外科医生决定将肿瘤整体剜除，以降低残留癌细胞的风险。"},{"en":"In severe cases of eye injury, doctors may need to enucleate the eye to prevent infection.","zh":"在严重眼外伤的情况下，医生可能需要摘除眼球以防感染。"}]},{"partOfSpeech":"vt.","definition":{"en":"(General/figurative) To remove the central part or “core” of something.","zh":"（一般/比喻）去除某物的中心部分或“核心”。"},"examples":[{"en":"The editor tried to enucleate the core idea from a long, confusing paragraph.","zh":"编辑试图从一段冗长又令人困惑的文字中提炼出核心观点。"},{"en":"We can enucleate the main problem by looking at what keeps happening again and again.","zh":"我们可以通过观察反复出现的情况来抓住主要问题。"}]}],"synonyms":["remove","extract","excise","extirpate","core (out)"],"phonetic":"/iˈnuːkliˌeɪt/","extraExplanation":["词源上与“nucleus（核、核心）”有关：en- 表示“使……成为/使……处于某状态或去除”，-nucle- 与“核”相关，因此 enucleate 有“把核取出/把核心剥离出来”的含义。","医学语境里最常见的搭配是 enucleate the eye（摘除眼球）和 enucleation（摘除术/剜除术）。日常英语中较少用，多见于医学说明或学术写作。"]}
{"word":"enucleated","summary":{"en":"Enucleated means either (1) made without a nucleus (biology) or (2) completely removed by surgery, especially an eye or a tumor.","zh":"enucleated 可指（1）生物学上的“去核的”，也可指（2）手术中被完整摘除的（尤其指眼球或肿瘤）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine/biology) Having been removed from its nucleus; made without a nucleus.","zh":"（医学/生物）去核的；已将细胞核移除的。"},"examples":[{"en":"The scientists used an enucleated egg cell for cloning research.","zh":"科学家使用去核的卵细胞进行克隆研究。"},{"en":"Enucleated cells cannot divide normally because they lack genetic control from the nucleus.","zh":"去核细胞因为缺少细胞核的遗传调控，无法正常分裂。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine, about the eye or a tumor) Having been removed completely by surgery (enucleation).","zh":"（医学，指眼球或肿瘤）经手术完整摘除的（眼球摘除/肿瘤剜除）。"},"examples":[{"en":"The patient has an enucleated eye and now uses a prosthetic eye.","zh":"病人的眼球已被摘除，现在使用义眼。"},{"en":"The surgeon reported that the tumor was enucleated with clean margins.","zh":"外科医生报告该肿瘤已被剜除，切缘干净。"}]}],"synonyms":["denucleated","nucleus-free","excised","removed"],"phonetic":"/iˈnuːkliˌeɪtɪd/","extraExplanation":["“enucleated”来自动词“enucleate”，词根是拉丁语 nucleus（核、核心）。在生物学里多指“去除细胞核”；在临床（尤其眼科）里常与“enucleation（眼球摘除术）”相关。","注意不要和“denucleated（去核的）”“extirpated（根除的）”混用：在医学语境中，enucleate 往往强调“完整剜出/摘出”，而不一定是“彻底根除所有组织”。"]}
{"word":"enucleating","summary":{"en":"Enucleating means removing something whole from its surrounding tissue (often an eye or a tumor), or removing the nucleus/core of something.","zh":"enucleating 指将某物整体从周围组织中剥离切除（常指眼球或肿瘤），也可指去除某物的“核/核心”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(medicine) Surgically removing an organ or a mass (especially removing an eye from its socket, or removing a tumor as a whole).","zh":"（医学）用手术完整切除某个器官或肿块（尤指眼球摘除术，或将肿瘤整体剥除）。"},"examples":[{"en":"The surgeon is enucleating the patient’s eye to stop the spread of infection.","zh":"外科医生正在为患者进行眼球摘除术，以阻止感染扩散。"},{"en":"Doctors discussed enucleating the tumor because it had clear boundaries.","zh":"医生讨论是否将肿瘤整体剥除，因为它的边界很清楚。"}]},{"partOfSpeech":"v.","definition":{"en":"Removing the nucleus, core, or central part of something; taking out the “inner part.”","zh":"去除某物的核、核心或中心部分；把“内核”取出。"},"examples":[{"en":"The process involves enucleating the seed before cooking the fruit.","zh":"这个过程包括在烹饪前把水果的籽核去掉。"},{"en":"In biology class, we watched a video of scientists enucleating cells for research.","zh":"在生物课上，我们看了一段科学家为研究而进行细胞去核的录像。"}]}],"synonyms":["removing","excising","extracting","extirpating","decoring","denucleating"],"phonetic":"ɪˈnuːkliˌeɪtɪŋ","extraExplanation":["“enucleating”是动词“enucleate”的现在分词/动名词形式，常见于医学与生物学语境，语气偏正式。","词源来自拉丁语 *nucleus*（“核、果核”）。因此它既可用于“眼球摘除/肿瘤剥除”等外科术语，也可引申为“去核、取出核心部分”。","医学里“enucleation”常特指眼球摘除术（enucleation of the eye）。与之相关但不同的术语还有“evisceration”（取出眼内容物但保留巩膜）等，阅读医学材料时要注意区分。"]}
{"word":"enucleation","summary":{"en":"Enucleation is a medical term meaning surgical removal, most commonly the complete removal of an eyeball, or the clean removal of a mass from surrounding tissue.","zh":"enucleation 是医学术语，最常指“眼球摘除术”（完整移除眼球），也可指将肿块/组织从周围结构中整体剥离取出的“剜除/剥离式切除”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove an eye (the whole eyeball) from its socket","zh":"（外科）眼球摘除术；把整个眼球从眼眶中移除的手术"},"examples":[{"en":"After the severe injury, the doctors recommended enucleation to prevent infection.","zh":"严重受伤后，医生建议做眼球摘除术以防止感染。"},{"en":"She received counseling to help her adjust emotionally after enucleation.","zh":"她在眼球摘除术后接受了心理辅导，帮助自己进行情绪适应。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of removing something completely from its surrounding tissue or structure (medical use)","zh":"（医学）剥离/剜除：把某个组织或肿块从周围结构中完整移除的过程"},"examples":[{"en":"The surgeon performed enucleation of the tumor, removing it in one piece.","zh":"外科医生对肿瘤进行了剥离式切除，将其整体取出。"},{"en":"In some cases, enucleation is preferred to reduce damage to nearby tissue.","zh":"在某些情况下，为减少对邻近组织的损伤，会优先选择剥离式切除。"}]}],"synonyms":["removal","excision","extraction","extirpation"],"phonetic":"/ɪˌnuːkliˈeɪʃən/","extraExplanation":["词源提示：enucleation 来自拉丁语 nucleus（“核、果仁”），字面含义接近“去核/把核剥出来”。因此在医学语境中常指“把某个结构从包裹它的组织中完整剥离出来”。","注意区分相关术语：眼科里 enucleation（摘除整个眼球）不同于 evisceration（只取出眼内容物、保留巩膜外壳）和 exenteration（清除眼眶内更广泛的组织）。具体使用哪种术语取决于手术范围。"]}
{"word":"enucleator","summary":{"en":"An enucleator is either a person (surgeon) or a tool that removes an organ or mass whole, especially in eye-related surgery.","zh":"enucleator 指进行剜除/摘除（常见于眼科）的医生，或用于剜除的手术器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgeon or medical professional who performs enucleation (removing an organ or a mass whole, often the eye or a tumor).","zh":"进行“剜除术/摘除术（enucleation）”的外科医生或医疗人员（常指摘除眼球，或将肿块完整剥离取出）。"},"examples":[{"en":"After the accident, an enucleator was consulted to evaluate whether the damaged eye could be saved.","zh":"事故后，医生请来一位进行眼球摘除术的外科医生评估受损的眼睛是否还能保住。"},{"en":"The hospital’s enucleator explained the procedure and the recovery plan to the patient’s family.","zh":"医院负责剜除手术的医生向患者家属解释了手术流程和康复计划。"}]},{"partOfSpeech":"n.","definition":{"en":"a surgical instrument used to enucleate—especially to separate and remove tissue cleanly (historically used in eye surgery and related procedures).","zh":"用于剜除/摘除的手术器械（尤其指在眼科等手术中用于分离并取出组织的工具）。"},"examples":[{"en":"The tray included an enucleator and other delicate instruments for eye surgery.","zh":"器械盘里有一把剜除器以及其他精细的眼科手术器械。"},{"en":"Older textbooks sometimes describe how an enucleator is used to lift and separate tissue.","zh":"较早的教材有时会描述剜除器如何用于抬起并分离组织。"}]}],"synonyms":["enucleation surgeon","ophthalmic surgeon (in eye context)","enucleating instrument","surgical enucleator"],"phonetic":"/ɪˈnuːkliˌeɪtər/","extraExplanation":["“enucleator”来自 enucleate（剜出、摘除），词根与拉丁语 nucleus（核、果核）有关，原意有“把核完整取出”的感觉，因此在医学上常指“整块剥离取出”。","在现代临床英语中，这个词相对少见；更常见的表达是 enucleation（剜除术/摘除术）以及具体术式名称。不同语境下它可能指“执行手术的人”或“手术器械”，需要根据上下文判断。"]}
{"word":"enukki","summary":{"en":"“Enukki” isn’t a recognized English vocabulary word; it’s likely a name or a misspelling.","zh":"“Enukki”不是常见英语词汇；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a username, character name, or place name) or a misspelling of another word.","zh":"不是标准英语单词。更可能是专有名词（如用户名、角色名、地名等）或其他词的拼写错误。"},"examples":[{"en":"I couldn’t find “Enukki” in an English dictionary—can you tell me where you saw it?","zh":"我在英语词典里找不到“Enukki”——你是在哪里看到它的？"},{"en":"Enukki might be a character name in a game or story.","zh":"Enukki 可能是游戏或故事里的角色名。"}]}],"phonetic":"/ɛˈnʌki/","extraExplanation":["“Enukki”目前没有公认的英语词典释义。如果你能提供更多上下文（例如一句话、作品/游戏名称、语言环境，或你想表达的意思），我可以帮你判断它是专有名词、外来词音译，还是你想查的其实是另一个拼写相近的词（比如某些日语罗马字、或英语单词的拼写误差）。"]}
{"word":"enumerability","summary":{"en":"Enumerability is the property of being able to count or systematically list items, especially in math and computer science.","zh":"Enumerability 指“可枚举性/可数性”，即能够把对象逐个计数或系统地列出来（多用于数学与计算机科学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be counted or listed as separate items (often used in mathematics, logic, and computer science).","zh":"“可枚举性；可数性”：指能够被逐个数出来或按顺序列成清单的性质（常见于数学、逻辑与计算机科学语境）。"},"examples":[{"en":"In computer science, enumerability means we can list all the valid outputs one by one, at least in principle.","zh":"在计算机科学中，“可枚举性”指我们至少在理论上可以把所有有效输出一个个列出来。"},{"en":"The paper discusses the enumerability of certain sets of numbers.","zh":"这篇论文讨论了某些数集的可枚举性。"}]}],"synonyms":["countability","listability"],"phonetic":"/ɪˌnuːməˈrəbɪləti/","extraExplanation":["“Enumerability”是较偏学术的名词，来自动词“enumerate”（列举、枚举）+ 名词后缀“-ability”（……的能力/性质）。","在数学里常与“countable（可数的）/uncountable（不可数的）”相关：如果一个集合能被按某种顺序列成一个无限清单（即与自然数一一对应），就具有“enumerability”。","在计算机科学里也常见“recursively enumerable (r.e.) / computably enumerable (c.e.)”（递归可枚举/可计算可枚举），强调“存在一种算法能把成员逐个生成出来”，即使不能保证在有限时间内判断某个元素是否属于该集合。"]}
{"word":"enumerable","summary":{"en":"Enumerable means “able to be listed or counted one by one,” and in programming it also means “iterable item by item.”","zh":"Enumerable 指“能逐一列举或计数的”，在编程中也指“可逐项遍历/可迭代的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be counted one by one; countable as separate items.","zh":"可逐一列举的；可数的（能一个个数出来的）。"},"examples":[{"en":"The data includes enumerable categories like age groups and regions.","zh":"这些数据包含可列举的类别，比如年龄组和地区。"},{"en":"Apples are enumerable; water is not.","zh":"苹果是可数的；水不是。"}]},{"partOfSpeech":"adj.","definition":{"en":"In programming, something you can iterate through item by item (like a list, array, or set).","zh":"（编程）可迭代的；可以逐项遍历的（如列表、数组或集合）。"},"examples":[{"en":"In C#, a string is enumerable—you can loop through its characters.","zh":"在 C# 里，字符串是可枚举的——你可以循环遍历每个字符。"},{"en":"Make sure the function returns an enumerable collection.","zh":"请确保这个函数返回一个可枚举的集合。"}]}],"synonyms":["countable","listable","iterable"],"phonetic":"/ɪˈnuːmɚəbəl/","extraExplanation":["词源：来自拉丁语 numerare（“数、计数”），与 number（数字）同源，所以 enumerable 常带“能数清、能列出来”的感觉。","常见对比：enumerable 强调“可以一个个列出/遍历”；countable 更日常，强调“可数”。在数学或逻辑语境里常见 enumerable（如“可数无限”）。","用法提示：读到 enumerable + 名词（enumerable items/sets/categories）时，通常可理解为“能逐项列举的/可逐个列出的”。"]}
{"word":"enumerably","summary":{"en":"“Enumerably” means “in a way that can be listed or counted one by one,” mainly in math/CS contexts.","zh":"“enumerably”指“以可逐一列举或计数的方式”，主要用于数学/计算机科学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be listed or counted one by one; countably (often used in math or computer science).","zh":"以可以逐一列出或计数的方式；可数地（常用于数学或计算机科学语境）。"},"examples":[{"en":"The items in the dataset are enumerably finite, so we can list them all.","zh":"这个数据集中的项目在可枚举意义下是有限的，所以我们可以把它们全部列出来。"},{"en":"If the possibilities are enumerably infinite, we can still label them as first, second, third, and so on.","zh":"如果可能性是可数无穷（可枚举无穷），我们仍然可以把它们标记为第一、第二、第三，依此类推。"}]}],"synonyms":["countably","in a listable way","in a countable way"],"phonetic":"/ɪˈnuːmərəbli/","extraExplanation":["“enumerably”在日常英语里非常少见，更常见的是用形容词“enumerable”来修饰名词（如 enumerable set / enumerable items），或直接用“in a way that can be listed / counted”来表达。","在数学中，常见搭配是“countably infinite（可数无穷）”，意思是虽然无限，但仍能与自然数1,2,3…一一对应，因此“能编号/能列举”。"]}
{"word":"enumerate","summary":{"en":"Enumerate means to list items one by one (often in order), or more formally, to count them.","zh":"enumerate 指逐条列举（常按顺序/编号），也可指正式地计数统计。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To list things one by one, usually in a clear and ordered way (often using numbers).","zh":"逐一列举；按顺序（常用编号）把事物一条条写出来。"},"examples":[{"en":"Please enumerate the main reasons for your decision.","zh":"请逐条列出你做出这个决定的主要原因。"},{"en":"The report enumerates five key risks.","zh":"报告列举了五个关键风险。"},{"en":"She enumerated the steps: first, sign in; second, choose a plan.","zh":"她把步骤逐条列出：第一，登录；第二，选择方案。"}]},{"partOfSpeech":"vt.","definition":{"en":"To count or calculate the number of items.","zh":"计数；计算数量。"},"examples":[{"en":"The government enumerated the population in the census.","zh":"政府在人口普查中统计了人口数量。"},{"en":"We need to enumerate how many boxes are left.","zh":"我们需要数一数还剩多少箱子。"}]}],"synonyms":["list","count","itemize","recite","detail"],"phonetic":"/ɪˈnuːməˌreɪt/","extraExplanation":["“enumerate”常见于正式写作、报告、法律或学术语境，语气比“list”更正式，强调“逐条、清楚、有条理”。","词源来自拉丁语“numerus”（数字），因此它常暗示“用数字/顺序来列出”。","易混词：\n- list：更口语、更通用，只表示“列出”。\n- itemize：强调“分项列明（尤其是费用/清单）”。\n- count：侧重“数数量”，不一定逐条写出来。"]}
{"word":"enumerated","summary":{"en":"“Enumerated” means listed or counted item by item, often in an ordered (sometimes numbered) way.","zh":"“Enumerated”指把事项逐条（常按编号或顺序）列出或逐项统计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Listed or mentioned one by one as part of a numbered or ordered list.","zh":"（事项等）逐条列举的；按序（常按编号）列出的。"},"examples":[{"en":"The report includes an enumerated list of risks and suggested fixes.","zh":"报告包含一份逐条列出的风险清单以及建议的修复措施。"},{"en":"Please answer the questions in the enumerated order shown on the form.","zh":"请按表格上标出的编号顺序回答问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Counted or described item by item (often in a careful, complete way).","zh":"（数量或内容）逐项统计或逐项说明的（常含“仔细、完整”之意）。"},"examples":[{"en":"The invoice shows the enumerated costs for each service.","zh":"发票逐项列出了每项服务的费用。"},{"en":"They provided enumerated reasons for delaying the launch.","zh":"他们逐条说明了推迟上线的原因。"}]}],"synonyms":["listed","itemized","numbered","specified","cataloged"],"phonetic":"/ɪˈnuːməˌreɪtɪd/","extraExplanation":["“Enumerated”来自动词 enumerate（逐条列举、枚举）。在学术写作、法律文本、说明书里很常见，用来强调“按条目/按编号逐项列出”，语气比 listed 更正式。","常见搭配：an enumerated list（编号清单）、enumerated items（列举的条目）、enumerated powers（美国政治语境：宪法中“列举的权力/明文授予的权力”，也常写作 enumerated powers）。"]}
{"word":"enumerates","summary":{"en":"“Enumerates” means “lists or specifies items one by one,” often in a formal or organized way.","zh":"“enumerates”意为“逐一列举/逐项说明”，常带有正式、条理清晰的语气。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to list things one by one, usually in a clear, ordered way","zh":"逐一列举（把事物一条条清楚地列出来）"},"examples":[{"en":"The report enumerates the main causes of the problem.","zh":"报告逐一列举了问题的主要原因。"},{"en":"She enumerates the steps so everyone can follow them.","zh":"她把步骤一条条列出来，方便大家跟着做。"}]},{"partOfSpeech":"vt.","definition":{"en":"to mention or specify items individually, often to show how many or what they are","zh":"逐项说明；一一指出（强调有哪些/有多少项）"},"examples":[{"en":"The guide enumerates several safety rules before the hike.","zh":"向导在徒步前逐条说明了几项安全规则。"},{"en":"He enumerates his achievements in the interview.","zh":"他在面试中逐项提到自己的成就。"}]}],"synonyms":["lists","itemizes","details","sets out","recites"],"phonetic":"/ɪˈnuːməreɪts/","extraExplanation":["“enumerates”是动词“enumerate”的第三人称单数形式（he/she/it enumerates）。常见搭配：enumerate the reasons/steps/features.","语气上“enumerate”比“list”更正式，常用于报告、说明书、学术写作，强调“逐项、条理清楚地列出”。"]}
{"word":"enumerating","summary":{"en":"“Enumerating” means listing or counting things one by one, often in a clear, ordered way.","zh":"“enumerating”指把事物逐一列举或清点，通常强调有条理、按顺序。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"listing things one by one, usually in order or as separate points","zh":"逐一列举；把事物按顺序/分点列出来"},"examples":[{"en":"The report is enumerating the main risks of the project.","zh":"报告正在逐条列出该项目的主要风险。"},{"en":"She is enumerating the reasons why the plan won’t work.","zh":"她正在逐项说明这个计划行不通的原因。"}]},{"partOfSpeech":"v.","definition":{"en":"counting items carefully, often to get an exact total","zh":"逐一清点；精确计数"},"examples":[{"en":"After the inventory, we spent an hour enumerating the remaining boxes.","zh":"盘点之后，我们花了一个小时清点剩下的箱子。"},{"en":"The volunteers are enumerating households for the survey.","zh":"志愿者正在为调查逐户登记/统计。"}]}],"synonyms":["listing","itemizing","counting","cataloging","reciting"],"phonetic":"/ɪˈnuːməˌreɪtɪŋ/","extraExplanation":["“enumerating”是动词 enumerate 的现在分词/动名词形式。常用于较正式的语境（报告、法律、学术写作）。","与 list 相比，enumerate 更强调“逐条、系统地列出”，有时也暗含“编号/计数”的感觉。","常见搭配：enumerate the reasons/steps/facts/advantages; enumerate items; enumerate from A to B。"]}
{"word":"enumeration","summary":{"en":"“Enumeration” means listing items one by one, or the act of counting/officially recording them.","zh":"“Enumeration”指逐项列举，也可指统计、清点或官方登记计数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A list of items mentioned one by one, especially in a clear and ordered way (often using numbers or bullet points).","zh":"逐项列举；（常用数字或项目符号的）清单。"},"examples":[{"en":"The report begins with an enumeration of the project’s goals.","zh":"报告开头列举了项目的目标。"},{"en":"Please give an enumeration of the main reasons for your decision.","zh":"请逐条列出你做出这个决定的主要原因。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of counting or officially recording people or things; a count.","zh":"统计；清点；（官方）登记与计数。"},"examples":[{"en":"The city’s enumeration of residents helps plan public services.","zh":"对居民的统计有助于规划公共服务。"},{"en":"An enumeration of all the equipment was done before the trip.","zh":"出发前对所有装备进行了清点。"}]}],"synonyms":["listing","itemization","count","tally","cataloging"],"phonetic":"/ɪˌnuːməˈreɪʃən/","extraExplanation":["“enumeration”常见于学术写作、报告和法律文本：强调“逐项列出”，语气比“list”更正式。","在修辞学里，enumeration 也可指一种写作技巧：通过连续列举细节来加强语气与画面感（如文学或演讲中把多个事物一口气列出）。"]}
{"word":"enumerations","summary":{"en":"“Enumerations” means lists of items stated one by one, or (in computing) sets of fixed named choices.","zh":"“Enumerations”指“逐一列举的清单”，也可指（计算机中的）“枚举：固定命名选项的集合”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A list of items stated one by one; the act of naming or counting things in order.","zh":"逐一列举；把项目按顺序一一说出或数出。"},"examples":[{"en":"The report includes an enumeration of the main risks.","zh":"报告中列举了主要风险。"},{"en":"After a brief enumeration of reasons, she changed her mind.","zh":"在简短列举了几个理由后，她改变了主意。"},{"en":"Please give an enumeration of the steps you took.","zh":"请把你采取的步骤逐一列出来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A defined set of named values (often called an “enum”) used to represent fixed choices.","zh":"（计算机）枚举：一组预先定义的命名值（常称为 enum），用来表示固定选项。"},"examples":[{"en":"Use an enumeration to store the possible states: START, PAUSE, and STOP.","zh":"用枚举来存储可能的状态：START、PAUSE 和 STOP。"},{"en":"The function returns an enumeration value rather than a string.","zh":"这个函数返回的是枚举值，而不是字符串。"}]}],"synonyms":["listing","itemization","catalog","count","inventory","roll call","enum"],"phonetic":"/ɪˌnuːməˈreɪʃən/","extraExplanation":["“Enumerations”是“enumeration”的复数形式，常见于学术写作（列举要点）和编程语境（枚举类型）。","修辞写作中，enumeration 也可指为了强调而把多个细节连续列出（类似中文的“排比式列举”），但日常用法多指“清单式列举”。"]}
{"word":"enumerative","summary":{"en":"Enumerative describes a style or structure that lists items one by one, often using markers like “first, second, third.”","zh":"Enumerative 指“逐一列举”的表达方式或结构，常用“first/second/third”等标记来组织列表。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to listing things one by one (often as examples or items in a series).","zh":"与“逐一列举”有关的；用列举方式表达的（常用于举例或罗列条目）。"},"examples":[{"en":"The teacher used an enumerative style, listing the causes of the war one by one.","zh":"老师用了列举式的讲法，把战争的原因逐一列出来。"},{"en":"The essay feels too enumerative and needs more explanation and connections between points.","zh":"这篇文章太像在罗列观点，需要更多解释，并把各点之间的联系写清楚。"}]},{"partOfSpeech":"adj.","definition":{"en":"In grammar and writing, describing words or structures that introduce a list (for example, “first… second… third…”).","zh":"（语法/写作）指用于引出或组织列表的词语或结构，例如“first… second… third…”。"},"examples":[{"en":"Use enumerative markers like “first,” “next,” and “finally” to guide the reader.","zh":"用“first”“next”“finally”等列举标记来引导读者。"},{"en":"The paragraph begins with an enumerative phrase: “There are three reasons…”","zh":"这一段以列举式短语开头：“There are three reasons…”（有三个原因……）。"}]}],"synonyms":["listing","list-like","itemized","cataloging","sequential"],"phonetic":"/ɪˈnuːməˌreɪtɪv/","extraExplanation":["“enumerative”来自拉丁语词根 numer-（数字、计数），和“number（数字）”“numerous（众多的）”是同源词。它常用于学术写作评价：说某段“enumerative”通常暗示“只是列清单、缺少分析/论证”。","常见搭配：enumerative style（列举式风格）、enumerative sentence/paragraph（列举句/段）、enumerative marker（列举标记）。相关词：enumerate v.（列举）、enumeration n.（列举/清单）。"]}
{"word":"enumerator","summary":{"en":"An enumerator is someone or something that counts or lists items one by one; in computing, it can mean an object used to iterate through a collection.","zh":"enumerator 指逐一清点/列举的人或装置；在计算机领域也指用于遍历集合元素的“枚举器”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who counts or lists things one by one, especially in an official or careful way.","zh":"（尤指正式或仔细地）逐一清点、列举的人；统计员。"},"examples":[{"en":"Census enumerators visit homes to collect information.","zh":"人口普查员会挨家挨户收集信息。"},{"en":"The enumerator carefully listed every item in the shipment.","zh":"清点员仔细列出了货物中的每一项。"}]},{"partOfSpeech":"n.","definition":{"en":"A device or tool that counts, records, or lists items or events.","zh":"用于计数、记录或列举事项/事件的装置或工具。"},"examples":[{"en":"An enumerator on the website tracks how many downloads happened today.","zh":"网站上的计数器会追踪今天发生了多少次下载。"},{"en":"The lab used an enumerator to record the number of cells.","zh":"实验室用计数装置记录细胞数量。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing, a type of object that lets you go through items in a collection one at a time.","zh":"（计算机）枚举器：一种让你逐个遍历集合中元素的对象/工具。"},"examples":[{"en":"This function returns an enumerator so you can iterate through the results.","zh":"这个函数会返回一个枚举器，让你能遍历结果。"},{"en":"If you stop early, the enumerator may not process the remaining items.","zh":"如果你提前停止，枚举器可能不会处理剩余的项目。"}]}],"synonyms":["counter","tally","census worker","list-maker","iterator"],"phonetic":"/ɪˈnuːməˌreɪtər/","extraExplanation":["词源提示：enumerator 来自动词 enumerate（逐一列举、清点），源于拉丁语 numerus（数字）。因此它常和“数、列、统计”相关。","使用场景：日常英语里更常见的是 counter（计数器）或 census worker（普查工作人员）；enumerator 更偏正式/专业（如人口普查、清点、计算机编程）。","相关词：enumerate（v. 列举）；enumeration（n. 列举/清点）；census enumerator（人口普查员）。"]}
{"word":"enumerators","summary":{"en":"Enumerators are people or tools that list items one by one; in computing, they traverse a collection; in some technical texts, they can mean a numerator.","zh":"Enumerators 指逐一列举/清点的人或工具；在计算机中指用于遍历集合的对象/方法；在少数技术文本中也可指分子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or tools that list or count items one by one.","zh":"逐一列出或清点事物的人或工具；列举者。"},"examples":[{"en":"The survey enumerators visited each house to count the residents.","zh":"人口普查的登记员逐户走访，统计居民人数。"},{"en":"Good enumerators record answers carefully and without changing people’s words.","zh":"好的调查员会认真记录答案，不会擅自改动受访者的话。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) Objects or methods that let you go through items in a collection one at a time (similar to an iterator).","zh":"（计算机）用于一次访问集合中一个元素的对象或方法（类似“迭代器”）。"},"examples":[{"en":"In C#, you can use an enumerator to move through a list element by element.","zh":"在 C# 中，你可以用 enumerator 逐个遍历列表元素。"},{"en":"The enumerator stops when it reaches the end of the collection.","zh":"当到达集合末尾时，enumerator 就会停止。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math/Engineering) The top number in a fraction-like ratio (the numerator).","zh":"（数学/工程）比值或分式中的上项（即“分子”）。"},"examples":[{"en":"To compare the rates, keep the denominator the same and change the enumerator.","zh":"要比较这些比率，保持分母不变并改变分子。"}]}],"synonyms":["listers","counters","survey takers","census workers","iterators"],"phonetic":"/ɪˈnuːməˌreɪtɚz/","extraExplanation":["在现实语境中，enumerators 常见于“调查/普查”领域，指上门访问、记录数据的“调查员/登记员”。在一些国家和地区的人口普查、健康调查等项目中，这个角色很重要。","在编程语境里，enumerator 通常与“遍历（iterate）集合”有关：它让你按顺序读取元素，而不必一次性拿到全部数据。不同语言/框架（如 C#、.NET）对它的具体接口名称和用法会有所不同。","“分子”在现代英语里更常说 numerator；enumerator 作为“分子”更偏旧式或特定技术文献用法，因此阅读工程/老教材时可能会遇到。"]}
{"word":"enunciability","summary":{"en":"Enunciability means how easy something is to say clearly.","zh":"Enunciability 指某个词或短语是否容易清楚地说出来（可发音性/顺口程度）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being easy to say clearly; how pronounceable a word or phrase is.","zh":"可清楚说出的特性；（词或短语的）可发音性、顺口程度。"},"examples":[{"en":"When naming a brand, people often test the enunciability of the name in different accents.","zh":"在给品牌取名时，人们常会用不同口音来测试名字的可发音性。"},{"en":"The teacher chose words with high enunciability for beginner students.","zh":"老师为初学者选择了更容易清楚读出来的词。"}]}],"synonyms":["pronounceability","clarity","ease of pronunciation"],"phonetic":"/ɪˌnʌnsiəˈbɪləti/","extraExplanation":["“Enunciability”来自“enunciate”（清楚发音、清晰表达）+ “-ability”（……的能力）。它多用于语言学习、语音学、命名/品牌学等语境，强调“是否容易被清楚读出”，比单纯的“pronounceability（可发音性）”更带有“清晰度/咬字”的意味。","常见相关词：enunciate（动词：清楚发音）、enunciation（名词：发音/清晰表达）、pronounceability（名词：可发音性）。在日常口语里，“pronounceable / easy to pronounce”更常用；“enunciability”偏正式、偏学术或专业写作。"]}
{"word":"enunciable","summary":{"en":"Enunciable means “able to be clearly spoken/pronounced” or, more broadly, “able to be expressed in words.”","zh":"enunciable 指“能清楚说出/发音的”，也可泛指“能用语言表述的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be clearly spoken or pronounced; pronounceable.","zh":"可清楚发音的；说得清的（可发音的）。"},"examples":[{"en":"Some loanwords are hard to say, so people adjust them into a more enunciable form.","zh":"有些外来词很难念，所以人们会把它们调整成更“容易清楚发音”的形式。"},{"en":"Choose a name that is short and enunciable for international audiences.","zh":"给国际受众取名时，最好选短一些、容易清楚发音的名字。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be stated or expressed in words; expressible.","zh":"可用语言表述的；可表达的。"},"examples":[{"en":"Not every feeling is fully enunciable, but writing can help clarify it.","zh":"并非每种感受都能完全说得清，但写作能帮助把它理顺。"},{"en":"The theory tries to make implicit assumptions enunciable.","zh":"这个理论试图把隐含的假设变得可表述、可说清。"}]}],"synonyms":["pronounceable","articulable","expressible","sayable"],"phonetic":"ɪˈnʌnsiəbəl","extraExplanation":["“enunciable”比较少见，更常用的替代词是“pronounceable（可发音的）”或“expressible（可表达的）”。它来自“enunciate（清楚地说/发音；阐明）”，在语言学或哲学语境里有时用于强调“能否被清楚说出/被语言表达”。"]}
{"word":"enunciate","summary":{"en":"Enunciate means to speak words clearly and distinctly; it can also mean to state an idea clearly in a formal way.","zh":"enunciate 指“咬字清楚、发音清晰”；也可指在正式语境中“清楚阐明/表述观点”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to say words clearly, with each sound spoken distinctly (often to help others understand)","zh":"清晰发音；把每个音都说清楚（常用于帮助别人听懂）"},"examples":[{"en":"Please enunciate when you speak; the room is noisy.","zh":"请你说话时把字音发清楚；房间里很吵。"},{"en":"She enunciated each syllable slowly for the students.","zh":"她为了学生把每个音节都慢慢地清楚说出来。"}]},{"partOfSpeech":"v.","definition":{"en":"to express or state an idea clearly (often in formal speech or writing)","zh":"清楚阐明；明确表达（常用于较正式的演讲或写作）"},"examples":[{"en":"The report enunciates the company’s goals for next year.","zh":"这份报告清楚阐明了公司明年的目标。"},{"en":"He enunciated his opinion without being rude.","zh":"他表达了自己的观点，但并不失礼。"}]}],"synonyms":["articulate","pronounce","declare","state","express"],"phonetic":"/ɪˈnʌnsiˌeɪt/","extraExplanation":["“enunciate”常被学习者和“pronounce（发音）”混用：pronounce强调某个单词怎么读；enunciate强调把话说清楚、咬字清晰（尤其是在连贯说话时）。","常见搭配：enunciate clearly / enunciate your words / enunciate each syllable。","名词形式是“enunciation”（清晰发音；表达方式）。"]}
{"word":"enunciated","summary":{"en":"“Enunciated” means spoken clearly or stated formally and clearly.","zh":"“Enunciated”表示把话（或发音）说得很清楚，或正式而清晰地阐明观点/原则。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"said or pronounced clearly and carefully (past tense/past participle of “enunciate”)","zh":"（enunciate 的过去式/过去分词）清晰、仔细地发音；把话说得很清楚"},"examples":[{"en":"She enunciated every word so the audience could understand.","zh":"她把每个词都发得很清楚，这样观众就能听懂。"},{"en":"Please slow down and enunciate your name.","zh":"请放慢一点，把你的名字念清楚。"}]},{"partOfSpeech":"vt.","definition":{"en":"stated or expressed an idea or rule clearly and formally","zh":"清楚、正式地阐明（观点、原则或规则）"},"examples":[{"en":"The scientist enunciated a new theory in the lecture.","zh":"那位科学家在讲座中清楚地阐述了一种新理论。"},{"en":"The policy was enunciated in a short written statement.","zh":"这项政策在一份简短的书面声明中被正式说明。"}]}],"synonyms":["articulated","pronounced clearly","stated","expressed","declared"],"phonetic":"ɪˈnʌnsiˌeɪtɪd","extraExplanation":["“enunciate”更强调“把音节/单词说得清楚”，常用于发音训练、演讲、播音等场景；而“pronounce”只是“发音/读某个词”，不一定强调清晰度。","书面语里，“enunciate”也常用于“阐明观点/原则”（比“say”更正式），常见搭配：enunciate a principle/idea/policy。"]}
{"word":"enunciates","summary":{"en":"“Enunciates” means (1) says words clearly and distinctly, or (2) states an idea clearly and formally.","zh":"“enunciates”表示（1）清晰吐字/发音，或（2）正式而清楚地阐明观点。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to pronounce or say something clearly, especially each sound or word","zh":"（尤指逐音逐词）清晰地发音；清楚地说出"},"examples":[{"en":"The teacher enunciates each word slowly so beginners can follow.","zh":"老师把每个单词都慢慢地清晰读出来，方便初学者跟上。"},{"en":"Please enunciate your name—I didn’t catch it.","zh":"请把你的名字说清楚一点——我没听清。"}]},{"partOfSpeech":"vt.","definition":{"en":"to state an idea, rule, or plan clearly and formally","zh":"（正式）清楚阐明（观点、原则或计划）"},"examples":[{"en":"In his speech, he enunciates a clear vision for the community.","zh":"在演讲中，他清楚阐述了对社区的明确愿景。"},{"en":"The policy enunciates the company’s expectations about privacy.","zh":"该政策清楚说明了公司对隐私的要求。"}]}],"synonyms":["articulates","pronounces clearly","states","expresses","declares"],"phonetic":"/ɪˈnʌnsiˌeɪts/","extraExplanation":["“enunciates”是动词“enunciate”的第三人称单数现在时：he/she/it enunciates。常用于两类语境：①发音/吐字清晰（语言学习、演讲、播音）；②正式阐明观点（较书面、正式）。","词根提示：来自拉丁语 *enuntiare*（宣布、说出）。因此它不仅指“念清楚”，也可指“清楚表述（原则/立场）”。"]}
{"word":"enunciating","summary":{"en":"“Enunciating” means speaking with clear, careful pronunciation (and sometimes clearly stating an idea).","zh":"“enunciating”指清楚、仔细地发音（有时也指清楚明确地陈述观点）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Speaking words clearly by pronouncing each sound carefully so they are easy to understand.","zh":"（清楚地）发音；把每个音节/音说清楚，让别人容易听懂。"},"examples":[{"en":"She is enunciating every word so the class can follow.","zh":"她把每个词都清楚地发出来，这样全班都能跟上。"},{"en":"Try enunciating the ending sounds, especially the “-ed” and “-s.”","zh":"试着把词尾音发清楚，尤其是“-ed”和“-s”。"}]},{"partOfSpeech":"v.","definition":{"en":"Saying or expressing something in a clear, definite way (often used in formal writing).","zh":"（更正式）清楚明确地陈述/表达（常用于书面语）。"},"examples":[{"en":"The policy is enunciating the company’s values.","zh":"这项政策明确陈述了公司的价值观。"},{"en":"In his speech, he was enunciating a new plan for education.","zh":"在演讲中，他清楚地阐述了一项新的教育计划。"}]}],"synonyms":["articulating","pronouncing clearly","speaking clearly","expressing","stating clearly"],"phonetic":"/ɪˈnʌnsiˌeɪtɪŋ/","extraExplanation":["“enunciating”是动词enunciate的现在分词/动名词形式。日常谈“发音清楚”时，英语里更常说“pronounce clearly”或“speak clearly”；“enunciate”略更正式、也常用于口语训练（如演讲、播音、配音）。","发音学习里常见搭配：enunciate clearly / enunciate each word / enunciate consonants（把辅音发清楚）。注意它强调“清晰度”，不等于“口音很地道”。"]}
{"word":"enunciation","summary":{"en":"Enunciation means speaking clearly so each word (and sound) can be understood.","zh":"Enunciation 指说话时咬字清楚、发音清晰，让人能听懂每个词（每个音）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of speaking words clearly and correctly; clear pronunciation","zh":"清晰、正确地说出词语的行为；（发音）清晰度"},"examples":[{"en":"Good enunciation helps people understand you in a noisy room.","zh":"良好的咬字清晰度能让别人即使在嘈杂的房间里也听懂你。"},{"en":"The actor practiced enunciation so every line could be heard.","zh":"这位演员练习咬字，让每一句台词都能被听清。"},{"en":"Try to slow down and focus on enunciation, not speed.","zh":"试着放慢速度，把重点放在咬字清晰上，而不是语速。"}]},{"partOfSpeech":"n.","definition":{"en":"a careful, formal way of saying or pronouncing something (often used when describing a specific word or phrase)","zh":"（对某个词/短语的）谨慎、正式的说法或读法"},"examples":[{"en":"Some dictionaries list a different enunciation of this word.","zh":"一些词典会列出这个词的不同读法。"},{"en":"Her enunciation of the foreign name was surprisingly accurate.","zh":"她对这个外国名字的读法出乎意料地准确。"}]}],"synonyms":["articulation","diction","clear pronunciation"],"phonetic":"/ɪˌnʌnsiˈeɪʃən/","extraExplanation":["“enunciation”强调“把每个音节/词说清楚”（清晰度），而“pronunciation”更偏向“是否读得正确、是否符合标准读音”。因此你可以说：Your pronunciation is correct, but your enunciation is unclear（读音对，但咬字不清）。","词源来自拉丁语前缀 e-/ex-（向外）+ nuntiare（宣告/说出），带有“把话说出来、说清楚”的感觉。","常见搭配：clear/crisp enunciation（清晰/利落的咬字）、poor enunciation（咬字差）、work on/practice enunciation（练习咬字）。"]}
{"word":"enunciations","summary":{"en":"Enunciations means instances of enunciation—usually clear, careful pronunciation; less commonly, formal statements or announcements.","zh":"enunciations是enunciation的复数，通常指“清晰的吐字/发音”；较少情况下指正式的陈述或宣布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"clear, careful pronunciation of words (how distinctly you speak)","zh":"清晰、仔细的发音；吐字（说话是否清楚）"},"examples":[{"en":"Good enunciation helps people understand you in class.","zh":"良好的吐字能帮助别人更好地听懂你在课堂上说的话。"},{"en":"The actor practiced her enunciation before going on stage.","zh":"那位演员上台前练习了自己的咬字/吐字。"},{"en":"Try slowing down to improve your enunciation.","zh":"试着放慢语速来改善你的吐字。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of stating or announcing something (formal; less common)","zh":"陈述；宣布（较正式、较少见）"},"examples":[{"en":"The policy’s enunciation was followed by many questions.","zh":"该政策的宣布之后出现了许多提问。"},{"en":"In the speech, the enunciation of these goals came early.","zh":"在演讲中，这些目标的陈述出现在较前面。"}]}],"synonyms":["clear pronunciation","diction","articulation","statement","announcement"],"phonetic":"ɪˌnʌnsiˈeɪʃən","extraExplanation":["“enunciations”是复数形式；更常见的单数是“enunciation”。在日常英语里，这个词最常指“吐字清晰”。","易混词：pronunciation更泛指“某个词怎么读”；enunciation更强调“说得是否清楚、是否咬字到位”。annunciation通常指“宣告/报喜”（如宗教语境中的The Annunciation），不要混用。"]}
{"word":"enunciative","summary":{"en":"Enunciative means clear and direct in expressing meaning, or related to clear pronunciation (enunciation).","zh":"enunciative 指表达清晰直接，或与清晰发音/吐字（enunciation）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Expressing meaning clearly and directly; serving to state or declare something.","zh":"（表达方式）清晰而直接的；用于陈述或宣示的。"},"examples":[{"en":"Her enunciative style makes even complex ideas easy to follow.","zh":"她清晰直接的表达风格让复杂的想法也很容易理解。"},{"en":"The poem uses short, enunciative sentences to deliver its message.","zh":"这首诗用简短而明确的句子来传达信息。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to enunciation or pronunciation in speech; articulated distinctly.","zh":"与发音/清晰吐字有关的；吐字清楚的。"},"examples":[{"en":"Actors train to have an enunciative voice on stage.","zh":"演员会训练舞台上的吐字与发音，使声音清晰。"},{"en":"Try to be more enunciative when you speak English in class.","zh":"你在课堂上说英语时尽量吐字更清楚一些。"}]}],"synonyms":["articulate","clear","explicit","declarative","well-articulated"],"phonetic":"/ɪˈnʌnsiˌeɪtɪv/","extraExplanation":["“enunciative”来自“enunciate”（清楚地说出；阐明）和拉丁语词根 *nuntiare*（宣布、报告）。在语言学习语境里，它常与“clear articulation / good enunciation（吐字清晰）”相关；在写作或修辞语境里，它更偏向“陈述性、宣示性”的表达风格。","在日常口语中，“enunciative”不算高频，更常见的说法是：clear, articulate, well-spoken；若谈语法/语言学里的“陈述句”，通常用“declarative”，而不是“enunciative”。"]}
{"word":"enunciatively","summary":{"en":"“Enunciatively” means speaking with clear, careful pronunciation.","zh":"“enunciatively”表示“清晰地、字正腔圆地（说话/发音）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an enunciative (clearly articulated) way; with careful, distinct pronunciation so each sound and word is easy to understand.","zh":"以清晰发音的方式；把每个音和每个词都说得分明、易懂。"},"examples":[{"en":"Please read the paragraph slowly and enunciatively so everyone can follow.","zh":"请慢慢地、清晰地朗读这一段，让大家都能跟上。"},{"en":"The actor spoke enunciatively, making even the back row understand every line.","zh":"那位演员说话字正腔圆，连最后一排都能听清每一句台词。"}]}],"synonyms":["clearly","distinctly","articulately","with clear enunciation"],"phonetic":"/ɪˈnʌnsiˌeɪtɪvli/","extraExplanation":["“enunciatively”在日常口语中比较少见，更常用的说法是“clearly / distinctly / with clear enunciation”。","它来自动词“enunciate（清楚发音）”，常用于演讲、播客、播音训练、表演台词等语境。"]}
{"word":"enunciator","summary":{"en":"An enunciator is someone (or sometimes a device) that speaks clearly; in linguistics, it can mean the person/voice producing an utterance.","zh":"enunciator 指发音清晰的人（或设备）；在语言学中也可指发出话语的主体/声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or device that enunciates—speaks or pronounces words clearly and distinctly.","zh":"发音清晰的人；（也可指）清晰发声/播报的设备。"},"examples":[{"en":"As a news anchor, she is a careful enunciator who makes every word easy to understand.","zh":"作为新闻主播，她发音非常清晰，每个词都让人容易听懂。"},{"en":"The language-learning app includes a slow enunciator so beginners can follow the audio.","zh":"这个语言学习应用提供了慢速清晰发声功能，方便初学者跟读。"}]},{"partOfSpeech":"n.","definition":{"en":"In linguistics or grammar, a speaker who produces an utterance; the person who voices a statement (sometimes contrasted with the author).","zh":"（语言学/语法）话语的发出者、说话者；表达某句话的人（有时与作者区分）。"},"examples":[{"en":"In the poem, the enunciator sounds confident, even though the author may not feel that way.","zh":"在这首诗里，话语发出者听起来很自信，即使作者本人未必如此。"},{"en":"The enunciator is not always the same as the narrator in a story.","zh":"在故事中，话语发出者不一定等同于叙述者。"}]}],"synonyms":["clear speaker","articulator","speaker","announcer"],"phonetic":"/ɪˈnʌn.siˌeɪ.tɚ/","extraExplanation":["“enunciator”来自动词 enunciate（清楚地说/宣告）+ 名词后缀 -or（做某事的人/物）。日常英语里更常说 someone who enunciates clearly、clear speaker，或在表演/播音语境说 good diction。","第二个义项偏学术：在诗歌、叙事或话语分析中，enunciator 指“发声的位置/话语主体”，用来区分作者（author）、叙述者（narrator）和文本中“说话的那个声音”。"]}
{"word":"enunciators","summary":{"en":"“Enunciators” means people (or sometimes devices) that speak or express words very clearly.","zh":"“enunciators”指吐字清晰的人（有时也指能清楚发声的装置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (or devices) that enunciate—i.e., speak or state words clearly and distinctly.","zh":"发音清晰的人（或装置）；指把词语说得清楚、吐字分明的人（或设备）。"},"examples":[{"en":"The acting coach reminded the enunciators to open their mouths and hit every consonant.","zh":"表演老师提醒这些吐字清晰的演员要张开嘴，把每个辅音都发到位。"},{"en":"In some older radios, the announcer’s voice sounded like an enunciator—slow, careful, and very clear.","zh":"在一些老式收音机里，播音员的声音像“吐字器”一样——慢、谨慎，而且非常清楚。"}]}],"synonyms":["clear speakers","articulators","speakers","orators"],"phonetic":"/ɪˈnʌnsiˌeɪtərz/","extraExplanation":["“enunciators”是复数形式，单数是“enunciator”。它来自动词“enunciate”（清楚地说；阐明观点）。在日常英语里更常用“speaker(s) who enunciate clearly / clear speaker(s)”或直接用动词“enunciate”。","注意不要和“annunciator”（通告者；报信者/提示装置，如电梯语音提示器）混淆：拼写相近，但词源和常见用法不同。","学习发音时，“enunciate”常用于建议：如“Try to enunciate more clearly.”（试着更清楚地吐字）。"]}
{"word":"enunciatory","summary":{"en":"Enunciatory means related to clear pronunciation or (more formally) to declaring something.","zh":"enunciatory 指与清晰吐字有关的；也可（较正式）指与宣告、阐明有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to enunciation—speaking clearly and pronouncing words distinctly.","zh":"与“清晰发音/吐字”有关的；指说话时把词语发得清楚、分明。"},"examples":[{"en":"The teacher gave us enunciatory exercises to improve our pronunciation.","zh":"老师给我们做了吐字练习来改善发音。"},{"en":"Good enunciatory habits make your speech easier to understand.","zh":"良好的吐字习惯会让你的表达更容易被听懂。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the act of stating or declaring something (formal).","zh":"（较正式）与“表明/宣告某事”的行为有关的。"},"examples":[{"en":"The judge’s enunciatory statement set the rules for the courtroom.","zh":"法官的宣示性陈述为法庭设定了规则。"},{"en":"The policy includes an enunciatory section that explains its purpose.","zh":"该政策包含一段说明宗旨的宣示性文字。"}]}],"synonyms":["articulatory","pronunciational","declarative","explanatory"],"phonetic":"/ɪˈnʌnsiəˌtɔri/","extraExplanation":["“enunciatory”在日常英语中不算常见，更常见的是“clear enunciation（清晰吐字）”“enunciation（发音/吐字）”和动词“enunciate（清楚地说出；阐明）”。","在语言学习语境里，它多指发音清晰度；在法律、政策或学术写作中，它有时用于表示“阐明/宣示（原则或目的）”的部分。注意不要和“annunciatory（宣布、预告性的）”混淆。"]}
{"word":"enure","summary":{"en":"“Enure” is a (less common) spelling of “inure,” meaning to become accustomed (often “inured to”), or in legal writing, to take effect/benefit someone.","zh":"“enure”是“inure”的较少见拼写：常指“（对……）习惯/适应”（常用 inured to），在法律语境中指“生效/使利益归于某人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone (or yourself) used to something difficult, unpleasant, or unfamiliar; to toughen or accustom","zh":"使（某人/自己）习惯于困难、不愉快或陌生的事物；使适应、使坚韧"},"examples":[{"en":"Years of early-morning training inured her to cold weather.","zh":"多年清晨训练使她习惯了寒冷的天气。"},{"en":"Living abroad can inure you to cultural differences over time.","zh":"在国外生活久了会让你逐渐适应文化差异。"}]},{"partOfSpeech":"vi.","definition":{"en":"(law, formal) to take effect or become beneficial; to apply to someone’s benefit","zh":"（法律/正式用语）生效；使（利益、权利等）归于某人"},"examples":[{"en":"Any compensation shall inure to the benefit of the injured party.","zh":"任何赔偿均应归受害方受益。"},{"en":"The rights under this agreement inure to the heirs.","zh":"本协议项下的权利归继承人享有。"}]}],"synonyms":["accustom","harden","habituate","toughen","condition"],"phonetic":"/ɪˈnʊr/","extraExplanation":["“enure”常被当作“inure”的变体拼写，尤其在法律文件里更常见；日常英语里更推荐写作“inure”。","发音里常见重音在第二音节（in-URE）。表示“使习惯”时，常搭配介词“to”：be inured to something（对……习以为常）。","法律用法里常见固定搭配：“inure to the benefit of …”（使利益归于……/使……受益）。"]}
{"word":"enured","summary":{"en":"**Enured** is most often the past form of **enure** in legal/formal English (“to take effect; to benefit someone”). In everyday usage, many people actually mean **inured** (“accustomed/hardened”).","zh":"**enured** 多见于法律/正式英语，是 **enure** 的过去式（“生效；对某人有利”）。日常用法中很多人其实想写 **inured**（“习惯于/变得麻木或坚韧”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of **enure**) to take effect; to become effective; to be for someone’s benefit (often used in legal or formal writing).","zh":"（**enure** 的过去式/过去分词）生效；开始起作用；（常用于法律/正式语境）对某人有利、归于某人的利益。"},"examples":[{"en":"The new policy **enured** on January 1.","zh":"新政策于1月1日**生效**。"},{"en":"Any insurance proceeds shall **enure** to the benefit of the homeowner.","zh":"任何保险赔款应**归于/有利于**房主。"}]},{"partOfSpeech":"adj.","definition":{"en":"A less common spelling that people use when they actually mean **inured**: accustomed to something unpleasant; hardened by experience.","zh":"一种较少见的拼写，用来表达 **inured** 的意思：习惯于（不愉快的事）；因经历而变得麻木/坚韧。"},"examples":[{"en":"After years of criticism, she felt **(e)nured/inured** to negative comments.","zh":"经历多年批评后，她对负面评论已经**习以为常/变得麻木**了。"},{"en":"He was **inured** to the cold from working outdoors.","zh":"他因长期户外工作而对寒冷**习惯了**。"}]}],"synonyms":["take effect","become effective","accrue (to)","benefit","inured (for the ‘accustomed’ sense)"],"phonetic":"/ɪˈnʊrd/","extraExplanation":["“**enured**”在现代英语里最常见于法律或合同文本，是动词 **enure**（“生效；归于某人的利益”）的过去式/过去分词。","日常英语里想表达“习惯于（不好的事）”通常拼作 **inured**。写作时如果不是法律语境，建议优先用 **inured**，避免被认为是拼写错误。","常见搭配：**enure to the benefit of…**（归于……的利益）；**inured to…**（对……习惯/麻木）。"]}
{"word":"enures","summary":{"en":"“Enures” means “becomes beneficial,” most often in formal legal writing: “enure to the benefit of …”.","zh":"“enures”表示“变得有利/利益归于……”，多见于正式法律或合同表达：“enure to the benefit of …”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of enure) to become helpful or beneficial (usually in the phrase “enure to the benefit of”).","zh":"（enure 的第三人称单数）变得有利；起到利益归属的作用（常见于短语 “enure to the benefit of”）。"},"examples":[{"en":"Any refund will enure to the benefit of the customer.","zh":"任何退款都将归客户受益。"},{"en":"The rights under this agreement enures to the heirs as well.","zh":"本协议项下的权利也将惠及继承人。"}]}],"synonyms":["benefits","accrues","redounds"],"phonetic":"/ɪˈnjʊr/","extraExplanation":["“enure”常见于法律/合同英语里，意思是“（结果）归于……的利益/效力”，更常见的固定搭配是 “enure to the benefit of …”。日常口语中很少用。","很多学习者会把 “enures” 和医学词 “enuresis（遗尿；尿床）” 混淆：两者拼写相近，但含义完全不同。"]}
{"word":"enureses","summary":{"en":"“Enureses” is the plural of “enuresis,” meaning repeated involuntary urination, especially bedwetting.","zh":"“Enureses”是“enuresis”的复数，指反复的非自主排尿，尤其是尿床（遗尿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of enuresis: repeated, unintentional urination, especially during sleep (bedwetting).","zh":"enuresis 的复数：反复的非自主排尿，尤其指睡眠时的尿床（遗尿）。"},"examples":[{"en":"The doctor asked whether the child had enureses during the week or only on weekends.","zh":"医生询问孩子是一周内都有遗尿，还是只在周末发生。"},{"en":"In the report, enureses were recorded as more frequent during periods of stress.","zh":"报告中记录到，压力时期遗尿更频繁。"}]}],"synonyms":["bedwetting","involuntary urination","urinary incontinence (general)"],"phonetic":"/ˌɛn.jəˈriː.siːz/","extraExplanation":["“Enureses”是医学/学术写作中较常见的复数形式；日常英语更常说“bedwetting（尿床）”。","词源来自希腊语：en-（在……之中）+ ourein（排尿）。","如果你在阅读医学资料：常见搭配有“nocturnal enuresis（夜间遗尿）”“diurnal enuresis（日间遗尿）”“primary/secondary enuresis（原发性/继发性遗尿）”。"]}
{"word":"enuresis","summary":{"en":"Enuresis is the medical term for involuntary urination, especially bedwetting in children.","zh":"Enuresis 是“遗尿”的医学术语，尤指儿童夜间尿床等不自主排尿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"involuntary urination, especially during sleep (bedwetting), most common in children","zh":"遗尿；（尤指）夜间不自主排尿（尿床），多见于儿童"},"examples":[{"en":"Many children grow out of enuresis as they get older.","zh":"许多孩子随着年龄增长会逐渐不再遗尿。"},{"en":"The pediatrician explained that enuresis is common and usually treatable.","zh":"儿科医生解释说遗尿很常见，而且通常可以治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"involuntary urination during the day as well as at night (a medical/clinical use)","zh":"（医学/临床用语）日间或夜间的不自主排尿"},"examples":[{"en":"The doctor asked whether the enuresis happened only at night or also during the day.","zh":"医生询问遗尿是只发生在夜间，还是白天也会发生。"}]}],"synonyms":["bedwetting","involuntary urination","nocturnal enuresis"],"phonetic":"/ˌɛn.jəˈriː.sɪs/","extraExplanation":["“enuresis”是医学术语，日常英语更常说“bedwetting（尿床）”。在医疗语境中常见搭配：nocturnal enuresis（夜间遗尿）、primary/secondary enuresis（原发性/继发性遗尿）。","词源来自希腊语，含义与“在……里排尿”相关（多用于医学词汇体系），因此语气较为正式、偏临床。"]}
{"word":"enuresises","summary":{"en":"Enuresis is a medical term for involuntary urination, especially bedwetting during sleep.","zh":"Enuresis 是医学用语，指不自主排尿，尤其指睡眠中的尿床。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Involuntary urination, especially during sleep (bedwetting).","zh":"（医学）遗尿；尿失禁，尤指睡眠中（尿床）。"},"examples":[{"en":"The doctor said childhood enuresis is common and often improves with age.","zh":"医生说儿童遗尿很常见，通常会随着年龄增长而改善。"},{"en":"They kept a sleep diary to track episodes of enuresis.","zh":"他们记录睡眠日记来追踪遗尿发生的次数。"},{"en":"Treatment for enuresis may include limiting fluids before bed and using a bedwetting alarm.","zh":"遗尿的治疗可能包括睡前限制饮水，以及使用尿床报警器。"}]}],"synonyms":["bedwetting","urinary incontinence"],"phonetic":"/ˌɛn.jəˈriː.sɪs/","extraExplanation":["“enuresises”通常是想写复数“enureses”（较少见）或更常见的表达“episodes/cases of enuresis（遗尿的发作/病例）”。在日常英语里，“enuresis”多用作不可数名词，临床或研究语境才会看到复数形式。","词源来自希腊语，含义与“尿（urine）”相关，因此属于较正式的医学用词；在更口语的场景里常说“bedwetting（尿床）”。"]}
{"word":"enuretic","summary":{"en":"Enuretic means “related to bedwetting (enuresis), especially at night.”","zh":"enuretic 意为“与尿床/遗尿有关的（尤指夜间）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bedwetting (involuntary urination), especially at night; describing a person who wets the bed or a medical condition involving this.","zh":"与尿床（不自主排尿）有关的，尤指夜间；描述尿床者或与尿床相关的医学情况。"},"examples":[{"en":"The doctor reassured the parents that enuretic episodes are common in young children.","zh":"医生安慰父母说，年幼孩子出现尿床（enuretic）情况很常见。"},{"en":"They kept a simple chart to track enuretic nights and look for patterns.","zh":"他们用一张简单的表记录尿床（enuretic）的夜晚，以寻找规律。"}]}],"synonyms":["bedwetting-related","relating to enuresis"],"phonetic":"/ˌɛn.jəˈriː.tɪk/","extraExplanation":["“enuretic”较常用于医学或较正式的语境，日常英语更常说“bedwetting”或“wetting the bed”。","词源来自希腊语前缀 en-（“在……里面”）+ ourein（“排尿”）。相关名词是“enuresis”（遗尿/尿床），常见搭配：nocturnal enuresis（夜间遗尿）。","谈到儿童尿床时，在英语语境里通常会尽量用中性、非羞辱性的表达（如“bedwetting”或“enuresis”），避免给孩子贴负面标签。"]}
{"word":"enuring","summary":{"en":"“Enuring” is a rare spelling of “inuring,” meaning gradually becoming accustomed to something, or (in legal/formal use) becoming effective/benefiting someone.","zh":"“enuring”是“inuring”的罕见拼写，指逐渐习惯某事；在法律/正式语境中也可指开始生效/使某方受益。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) The present participle of “enure” (more commonly spelled “inure”): accustoming someone (or yourself) to something difficult or unpleasant through repeated experience.","zh":"（罕见）“enure”（更常见拼写为 inure）的现在分词：通过反复经历使某人（或自己）逐渐习惯困难或不愉快的事物。"},"examples":[{"en":"Years of early-morning practice were enuring her to the cold.","zh":"多年来清晨训练让她逐渐习惯了寒冷。"},{"en":"The constant criticism was enuring him to public pressure.","zh":"持续的批评使他慢慢习惯了公众压力。"}]},{"partOfSpeech":"v.","definition":{"en":"(Law, formal) Becoming effective; coming into operation (often used with “to”).","zh":"（法律/正式）开始生效；开始起作用（常与 to 连用）。"},"examples":[{"en":"The benefits are enuring to the employees under the new contract.","zh":"根据新合同，这些福利开始对员工生效。"},{"en":"Any profits are enuring to the charity as stated in the will.","zh":"遗嘱中规定，任何利润将开始归慈善机构所有（开始对其起作用）。"}]}],"synonyms":["inuring","accustoming","habituating","conditioning"],"phonetic":"/ɪˈnʊrɪŋ/","extraExplanation":["“enure/enuring”在现代英语里较少见，日常更常用的拼写是“inure / inuring”。意思基本相同。","常见搭配：inure someone to something（使某人习惯于……）；be inured to something（已对……习以为常）。","法律语境里的用法多见于文件或判例：“enure to the benefit of …”（利益归于……/对……生效）。"]}
{"word":"enurny","summary":{"en":"“enurny” is not a standard English word; it’s likely a misspelling (possibly “inquiry/enquiry”).","zh":"“enurny”不是标准英语单词；很可能是拼写错误（可能是“inquiry/enquiry”等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or typing error, so the intended meaning depends on context.","zh":"不是标准英语单词。很可能是拼写或输入错误，具体想表达的意思需要看上下文。"},"examples":[{"en":"I couldn’t find “enurny” in the dictionary—did you mean “inquiry” or “enquiry”?","zh":"我在词典里找不到“enurny”——你是不是想写“inquiry”或“enquiry”？"},{"en":"If you share the sentence where you saw “enurny,” I can help identify the correct word.","zh":"如果你把“enurny”出现的句子发给我，我可以帮你判断正确的单词。"}]}],"synonyms":["inquiry","enquiry"],"extraExplanation":["“enurny”看起来像是拼写误差。常见的可能目标包括：\n1) inquiry / enquiry（询问、咨询）——发音和拼写上容易被打乱；\n2) unearthly（超自然的、怪异的）或 unruly（不守规矩的）——如果是从听写或口音输入而来，也可能出现类似拼法。\n把你原句贴出来（前后各一两句）或说明你想表达的中文意思，我能更准确地帮你纠正。"]}
