{"word":"enwall","summary":{"en":"Enwall means to surround something with a wall, or (figuratively) to shut something in as if by a wall.","zh":"Enwall 指“用墙围住/筑墙围起”，也可比喻“像墙一样把……困住或隔绝”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to surround or enclose (a place or area) with a wall; to wall in","zh":"用墙围住；筑墙围起（某地/某区域）"},"examples":[{"en":"In medieval times, many towns were enwalled for protection.","zh":"在中世纪，许多城镇会筑墙围起以防御。"},{"en":"The city decided to enwall the old quarter to preserve its historic character.","zh":"这座城市决定用城墙围起老城区，以保护其历史风貌。"}]},{"partOfSpeech":"vt.","definition":{"en":"to confine or shut in as if with a wall (often figurative)","zh":"（常为比喻）像用墙一样把……围住/困住；使隔绝"},"examples":[{"en":"He felt enwalled by silence after the argument.","zh":"争吵后，他觉得沉默像墙一样把他围住了。"},{"en":"Rules can enwall creativity if they leave no room to experiment.","zh":"如果规则不给试错空间，就可能把创造力“围死”。"}]}],"synonyms":["enclose","surround","wall in","wall off","encircle","fence in"],"phonetic":"/ɛnˈwɔl/","extraExplanation":["“enwall”由前缀 en-（使……处于某种状态/使……进入某种状态）+ wall（墙）构成，意思直观但在现代日常英语中比较少见，更常见的表达是 “wall in / wall off / enclose / surround with a wall”。","多见于历史、建筑描写，或带有文学色彩的比喻用法（如“被沉默围住”）。"]}
{"word":"enwallow","summary":{"en":"Enwallow is a rare/archaic verb meaning to engulf or immerse, or to wallow/linger in a feeling or situation.","zh":"Enwallow 是罕见/古用动词，意为“使沉浸/吞没”，也可指“沉溺于某种情绪或处境”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To immerse or plunge (someone or something) in something, as if making it wallow; to engulf.","zh":"（罕见/古用）使（某人或某物）沉浸、扑入某物中；（仿佛让其打滚般）使其陷入；吞没。"},"examples":[{"en":"In the old tale, the monster seemed to enwallow the village in darkness.","zh":"在那个古老的故事里，怪物仿佛让村庄陷入黑暗之中。"},{"en":"She felt enwallowed by grief after the bad news.","zh":"听到坏消息后，她觉得自己被悲伤吞没了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare/archaic) To wallow; to sink or linger in something (often a feeling or situation).","zh":"（罕见/古用）打滚；（常指在情绪或处境中）沉溺、久困其中。"},"examples":[{"en":"He would enwallow in self-pity instead of asking for help.","zh":"他宁愿沉溺于自怜，而不愿寻求帮助。"},{"en":"Don’t enwallow in regret—learn from it and move on.","zh":"别沉溺于后悔——从中学习，然后继续前行。"}]}],"synonyms":["wallow","immerse","engulf","submerge","sink into"],"phonetic":"/ɪnˈwɑloʊ/","extraExplanation":["“enwallow”非常少见，多数现代英语会直接用“wallow (in…)”来表达“（在情绪/状态里）沉溺”。","词首“en-”常见于古英语/中古英语构词，表示“使进入……/使处于……”（类似“encircle, entangle”中的en-）。因此“enwallow”带有“使……陷入/吞没”的感觉。","如果你是在阅读文学或古旧文本中遇到它，可以把它理解为更强调“被……包围、吞没”的“wallow/immerse”。"]}
{"word":"enweave","summary":{"en":"Enweave means to interweave things (literally or figuratively) so they become closely connected.","zh":"Enweave 指把事物（字面或比喻）交织在一起，使它们紧密相连。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To weave or intertwine things together; to interlace threads, strands, or parts into a single whole.","zh":"把事物织在一起；使线、条或部分交织成一个整体。"},"examples":[{"en":"She enweaved blue silk with gold thread to make a patterned scarf.","zh":"她把蓝色丝绸和金色线交织在一起，做成一条有图案的围巾。"},{"en":"Vines enweave the fence in summer.","zh":"夏天藤蔓缠绕并交织在篱笆上。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To blend ideas, details, or themes into a story, argument, or design so they feel naturally connected.","zh":"（比喻）把思想、细节或主题融入故事、论述或设计之中，使之自然连贯。"},"examples":[{"en":"The novelist enweaves humor and grief throughout the book.","zh":"这位小说家把幽默与悲伤贯穿并交织在整本书里。"},{"en":"Try to enweave your main point into every paragraph.","zh":"尽量把你的核心观点融入每一段中。"}]}],"synonyms":["interweave","entwine","interlace","weave into","blend"],"phonetic":"/ɛnˈwiːv/","extraExplanation":["“enweave”由前缀 en-（使……进入某种状态/使……成为）+ weave（编织）构成，意思接近“interweave / entwine”。在现代英语中较少见，更常用的替代词是 interweave、entwine、weave in/into。"]}
{"word":"enweaved","summary":{"en":"“Enweaved” means “woven into; closely intertwined,” and is a literary past form of “enweave.”","zh":"“enweaved”意为“被织入、紧密交织”，是较文艺的“enweave”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of **enweave**) to weave something into something else; to intertwine or interlace closely (often used in literary writing).","zh":"（**enweave** 的过去式/过去分词）把某物编织进另一物中；使紧密交织、交错（多见于文学表达）。"},"examples":[{"en":"Her memories were enweaved with the smell of rain and old books.","zh":"她的记忆与雨味和旧书香紧紧交织在一起。"},{"en":"Gold thread was enweaved through the fabric to create a subtle pattern.","zh":"金线被织入布料中，形成一种含蓄的图案。"},{"en":"Their stories are enweaved into the history of the town.","zh":"他们的故事被编织进这座小镇的历史之中。"}]}],"synonyms":["interwoven","intertwined","woven into","interlaced","entwined"],"phonetic":"/ɛnˈwiːvd/","extraExplanation":["“enweaved”在现代英语中比较少见，更常用的表达是 **interwoven / intertwined / woven into**。因此它常带有更“文艺、诗意”的语感，用来强调情感、记忆、故事等抽象事物的“交织”。"]}
{"word":"enweaving","summary":{"en":"Enweaving means interweaving or intertwining things (literary), and it can also mean the process of doing so.","zh":"Enweaving 指（偏文学的）交织/缠绕，也可指“交织的过程”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"interweaving; weaving things together so they become closely connected (often used in a literary way).","zh":"交织；把事物织在一起，使其紧密结合（常见于文学表达）。"},"examples":[{"en":"The author uses enweaving storylines to show how the characters’ lives connect.","zh":"作者用交织的故事线来展示人物命运如何相连。"},{"en":"Vines were enweaving around the fence after a rainy season.","zh":"雨季过后，藤蔓缠绕着篱笆交织生长。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of interweaving; a blending of elements into a single whole.","zh":"交织的过程；把多个元素融合成整体的做法。"},"examples":[{"en":"The enweaving of music and dialogue makes the scene more emotional.","zh":"音乐与对白的交织让这一幕更有感染力。"},{"en":"Her poem describes the enweaving of memory and place.","zh":"她的诗描写了记忆与地方感的交织。"}]},{"partOfSpeech":"adj.","definition":{"en":"forming an interwoven or intertwined pattern (describing something).","zh":"交织成形的；缠绕交错的（作描写用）。"},"examples":[{"en":"They admired the enweaving branches above the path.","zh":"他们欣赏小路上方交错缠绕的树枝。"},{"en":"The film creates an enweaving sense of past and present.","zh":"这部电影营造出过去与现在交织的感觉。"}]}],"synonyms":["interweaving","intertwining","entwining","braiding","weaving together"],"phonetic":"/ɛnˈwiːvɪŋ/","extraExplanation":["“enweaving”来自动词“enweave”（较少见，文学色彩更浓），意思与“interweave / intertwine”很接近。","前缀“en-”常有“使进入某种状态、使包裹/覆盖”的感觉，因此“enweave”带有“把……织入其中、使之交织”的画面感。","在现代日常英语中更常用“interweaving / intertwining”；“enweaving”更可能出现在诗歌、小说、或强调意象的描写里。"]}
{"word":"enweb","summary":{"en":"Enweb means to entangle or surround as if with a web, often used in vivid or literary descriptions.","zh":"Enweb 指“像被网一样缠住或包围”，常用于较形象、带文学色彩的描写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cover, surround, or trap someone or something as if in a web; to entangle","zh":"（如同被网覆盖一样）包围、缠住或困住；使陷入纠缠"},"examples":[{"en":"The vines enwebbed the fence and made it hard to open the gate.","zh":"藤蔓缠满了篱笆，害得大门都难打开。"},{"en":"She felt enwebbed by rumors she couldn’t control.","zh":"她觉得自己被无法控制的谣言缠住了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to spread across or connect something like a network (less common)","zh":"（较少见）像网络一样铺开或连结"},"examples":[{"en":"Railways enweb the countryside, linking small towns to the city.","zh":"铁路像网一样铺开，把小镇与城市连在一起。"}]}],"synonyms":["entangle","ensnare","trap","enmesh","embroil"],"phonetic":"/ɛnˈwɛb/","extraExplanation":["“en-”是一个常见前缀，表示“使……处于某种状态/加上……”，例如：enslave（使为奴）、enclose（围住）。因此 enweb 字面意思就是“使……像被网覆盖/缠住”。","enweb 在现代英语里偏文学/描写性用法，比 entangle 或 trap 更有“蛛网般纠缠、难以摆脱”的画面感。"]}
{"word":"enwheel","summary":{"en":"Enwheel is a rare/archaic verb meaning “to encircle” (and sometimes “to put on wheels”).","zh":"Enwheel 是一个罕见/古义动词，主要指“环绕、包围”，有时也指“装上轮子”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to surround or enclose as if with a wheel; to encircle.","zh":"（古义）像车轮一样把……围住；环绕；包围。"},"examples":[{"en":"In the old poem, the moonlight seemed to enwheel the sleeping town.","zh":"在那首旧诗里，月光仿佛把沉睡的小镇环绕起来。"},{"en":"Mist enwheeled the hills, hiding the paths from view.","zh":"薄雾环绕群山，把小路都遮住了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare/poetic) to fit with wheels or set on wheels; to make movable by adding wheels.","zh":"（少见/诗意）给……装上轮子；使……上轮子以便移动。"},"examples":[{"en":"They enwheeled the heavy cart so it could be pulled more easily.","zh":"他们给沉重的车装上轮子，这样更容易拉动。"},{"en":"The inventor dreamed of enwheeling every tool in the workshop.","zh":"那位发明家梦想把车间里的每样工具都装上轮子。"}]}],"synonyms":["encircle","surround","enclose","ring","wheel (onto)"],"phonetic":"/ɛnˈwiːl/","extraExplanation":["“en-”是英语里一个较老的前缀，常表示“使……进入某种状态/把……放进……里”（如 *encircle, enclose, endanger*）。因此 *enwheel* 字面上可理解为“使其像被轮子围住/套上轮子”。","*enwheel* 在现代英语中非常少见，多出现在诗歌或仿古文体里；日常表达“环绕”更常用 *encircle / surround*，“装轮子”更常用 *put wheels on / wheel*。"]}
{"word":"enwheeled","summary":{"en":"“Enwheeled” means “having wheels” (literary) or, rarely, “put on wheels.”","zh":"“Enwheeled”意为“有轮子的”（偏文学用法），或较少见地指“给……装上轮子/置于轮上”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having wheels; fitted with wheels (often used in poetic or literary style).","zh":"有轮子的；装有轮子的（常见于诗歌或文学语体）。"},"examples":[{"en":"The enwheeled cart rolled slowly over the stones.","zh":"那辆装有轮子的手推车慢慢地从石头路上滚过。"},{"en":"In the poem, the enwheeled chariot suggests speed and power.","zh":"在那首诗里，“有轮子的战车”暗示速度与力量。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of a rare verb meaning “to put on wheels” or “to set on wheels.”","zh":"（罕见动词的过去式）给……装上轮子；使……置于轮上。"},"examples":[{"en":"They enwheeled the heavy machine so it could be moved easily.","zh":"他们给那台沉重的机器装上轮子，这样就能轻松移动。"},{"en":"The statue was enwheeled for transport to the museum.","zh":"那座雕像被装上运输轮，运往博物馆。"}]}],"synonyms":["wheeled","wheel-equipped","on wheels","mounted on wheels"],"phonetic":"/ɛnˈwiːld/","extraExplanation":["“en-”这个前缀有“使……处于某种状态/使具有……”的意思（如 enrich 使富裕、enlarge 使变大）。enwheeled 因此可理解为“使具有轮子/置于轮上”。","enwheeled 在现代日常英语中不常用，更常见的说法是 wheeled（有轮子的）或 put on wheels（装上轮子）。在文学作品里使用它，语气更古典、更有画面感。"]}
{"word":"enwheeling","summary":{"en":"Enwheeling is a rare word meaning putting wheels on something or making it move on wheels; it can also describe something that has been fitted with wheels.","zh":"Enwheeling 是个很少见的词，指给某物装上轮子或使其靠轮子移动；也可形容“已装上轮子的/带轮的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) the act of fitting something with wheels, or setting it on wheels; making it move on wheels.","zh":"（罕见）给某物装上轮子或使其上轮子；使其能靠轮子移动。"},"examples":[{"en":"The inventor spent the afternoon enwheeling his cart so it could roll more smoothly.","zh":"发明家花了一下午给他的手推车装轮子，让它滚动得更顺。"},{"en":"They talked about enwheeling the heavy boxes to avoid lifting them.","zh":"他们讨论把沉重的箱子“装轮推行”，以避免搬抬。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, adjective use) having wheels added; wheel-equipped.","zh":"（罕见，作形容词）已装上轮子的；带轮的。"},"examples":[{"en":"An enwheeling platform made moving furniture easier.","zh":"一个带轮的平台让搬家具更容易。"}]}],"synonyms":["fitting with wheels","putting wheels on","equipping with wheels","wheeling"],"phonetic":"/ɛnˈwiːlɪŋ/","extraExplanation":["“enwheeling”多被理解为动词 enwheel 的现在分词/动名词形式。en- 是一个古老前缀，常表示“使……处于某种状态/加上……”。在现代英语里这个词非常少见，通常会直接说 “put wheels on… / fit … with wheels / wheel … (around)” 更自然。","如果你原本想写的是常见词 “wheeling”（推着/转动着轮子前进）或 “unwheeling”（不愿变通的，较正式/少用），也可以告诉我你的上下文，我帮你选最合适的词。"]}
{"word":"enwheels","summary":{"en":"“Enwheels” is the third-person singular of the rare verb “enwheel,” meaning to fit something with wheels so it can be moved.","zh":"“enwheels”是罕见动词“enwheel”的第三人称单数形式，意思是给某物装上轮子以便移动。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/old-fashioned) To put (something) on wheels; to fit with wheels so it can be moved.","zh":"（罕见/旧式用法）给（某物）装上轮子；使其带轮以便移动。"},"examples":[{"en":"The craftsman enwheeled the heavy chest so it could be rolled across the floor.","zh":"工匠给沉重的箱子装上轮子，这样就能在地板上滚动搬运。"},{"en":"In older texts, carts are sometimes described as enwheeled for travel.","zh":"在较早的文本中，车有时会被描述为“装上轮子”以便出行。"}]}],"synonyms":["fit with wheels","mount on wheels","put wheels on","wheel"],"phonetic":"/ɛnˈwiːl/","extraExplanation":["“en-”是英语里一个常见前缀，常表示“使……处于某种状态/加上……/包住……”。例如：enrich（使变富/使更丰富）、encircle（包围）。因此 enwheel 可理解为“使……有轮子”。","enwheel/enwheels 在现代英语中非常少见；日常更常用 put wheels on / fit with wheels / mount on wheels，或直接用 wheel（用轮子推/滚动）。"]}
{"word":"enwiden","summary":{"en":"“Enwiden” means to make something wider or to become wider; in modern English, “widen” is more common.","zh":"“Enwiden”表示使……变宽或变宽；在现代英语中更常用“widen”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make something wider; to widen (often by expanding the sides or boundaries).","zh":"使（某物）变宽；加宽（常指向两侧或边界扩展）。"},"examples":[{"en":"They plan to enwiden the road to reduce traffic jams.","zh":"他们计划把这条路加宽，以减少交通拥堵。"},{"en":"The city wants to enwiden the sidewalks to make walking safer.","zh":"市政府想把人行道加宽，让步行更安全。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become wider; to widen (less common).","zh":"变得更宽；变宽（较少见）。"},"examples":[{"en":"As the river enwidened, the current slowed down.","zh":"随着河道变宽，水流变慢了。"}]}],"synonyms":["widen","broaden","expand"],"phonetic":"/ɛnˈwaɪdən/","extraExplanation":["“enwiden”是一个相对少见的词，更常见的表达是“widen”。“en-”这个前缀有“使……进入某种状态/使……变成”的感觉（如“enlarge”使变大），但在现代英语里，“enwiden”多见于较旧或较文学化的用法。写作或日常交流中通常用“widen”更自然。"]}
{"word":"enwind","summary":{"en":"Enwind is an archaic/literary verb meaning to wrap or coil something around, or to surround closely.","zh":"Enwind 是古体/文学用语动词，指“缠绕、盘绕（某物）”或“围住、笼罩”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic/literary) To wind or wrap (something) around; to coil or entwine.","zh":"（古体/文学用语）把……缠绕在……上；盘绕；缠结。"},"examples":[{"en":"Ivy enwound the old stone wall.","zh":"常春藤缠绕着那面古老的石墙。"},{"en":"She enwound a scarf around her neck to keep warm.","zh":"她把围巾缠在脖子上取暖。"},{"en":"In the poem, mist enwinds the hills at dawn.","zh":"在那首诗里，薄雾在黎明时缠绕群山。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) To surround or encircle closely.","zh":"（较少见）紧紧围住；环绕。"},"examples":[{"en":"Silence enwound the room after the news.","zh":"消息传来后，寂静笼罩着房间。"},{"en":"A soft fog enwound the harbor.","zh":"柔和的雾笼罩着港口。"}]}],"synonyms":["wrap (around)","wind (around)","coil","entwine","twine","encircle","surround"],"phonetic":"/ɛnˈwaɪnd/","extraExplanation":["“en-”是一个常见前缀，常带有“使……进入某种状态/加在……之上”的意思（如 enclose, encircle）。因此 enwind 字面上就是“把……缠上去”。","enwind 主要见于较老的文学或诗歌语境；现代英语更常用 wind (around), wrap (around), coil, entwine, encircle 等。","注意拼写：enwind 的过去式/过去分词常见为 enwound（类似于 wind → wound）。"]}
{"word":"enwinding","summary":{"en":"“Enwinding” is a rare/poetic word meaning “winding around; wrapping; entwining,” often used to create a vivid literary image.","zh":"“Enwinding” 是较罕用、偏诗意的词，意思是“缠绕着；包裹着；交缠着”，常用于营造文学化的画面感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Poetic or rare) winding around; wrapping or coiling around something (the -ing form of “enwind”).","zh":"（诗歌/罕用）缠绕着的；盘绕着的；包裹着的（源自动词 enwind 的 -ing 形式）。"},"examples":[{"en":"Vines were enwinding the old fence after years of neglect.","zh":"多年无人打理后，藤蔓缠绕在旧篱笆上。"},{"en":"A scarf lay enwinding her neck against the cold wind.","zh":"围巾绕在她的脖子上，用来抵御寒风。"}]},{"partOfSpeech":"n.","definition":{"en":"(Poetic or rare) the act of winding or wrapping something around something else; entwining.","zh":"（诗歌/罕用）把……缠绕/绕住的动作；使交缠。"},"examples":[{"en":"The poem describes the enwinding of ivy around stone.","zh":"这首诗描写了常春藤缠绕石墙的景象。"},{"en":"Their arguments led to an enwinding of feelings and misunderstandings.","zh":"他们的争吵让情绪与误会纠缠在一起。"}]},{"partOfSpeech":"v.","definition":{"en":"(Poetic or rare, verb form) present participle of “enwind”: to wind around; to wrap; to entwine (often figurative).","zh":"（诗歌/罕用，动词形式）enwind 的现在分词：缠绕；包裹；使交缠（常用于比喻）。"},"examples":[{"en":"Smoke kept enwinding the lamp, turning the room hazy.","zh":"烟雾不断缠绕着灯光，让房间变得朦胧。"},{"en":"Fear was enwinding his thoughts, making it hard to speak clearly.","zh":"恐惧缠住了他的思绪，让他很难说清楚。"}]}],"synonyms":["wrapping","winding around","coiling","entwining","twining"],"phonetic":"/ɛnˈwaɪndɪŋ/","extraExplanation":["“enwind”在现代英语中非常少见，更常用的表达是：wrap (around), wind around, coil around, entwine, twine around。","前缀 en- 常带有“使……进入某种状态/使……包围”的感觉（如 encircle, enclose），所以 enwind 字面意思就是“使……被缠绕/包围”。","如果你是在文章里看到 “enwinding”，它往往带有更文学、更画面化的语气；日常写作一般不用。"]}
{"word":"enwinds","summary":{"en":"“Enwinds” is the third-person singular of “enwind,” meaning to wrap or coil around, or (figuratively) to entangle/surround.","zh":"“enwinds”是“enwind”的第三人称单数，意思是“缠绕/盘绕”，也可比喻为“牵缠、包围”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wind or wrap around something; to coil around","zh":"缠绕；盘绕在……周围"},"examples":[{"en":"Vines enwound the old stone wall.","zh":"藤蔓缠绕着古老的石墙。"},{"en":"The scarf enwound her neck in the cold wind.","zh":"寒风里，围巾绕在她的脖子上。"}]},{"partOfSpeech":"vt.","definition":{"en":"to surround or entangle someone or something (often in a figurative, literary way)","zh":"（常为比喻、文学用法）包围；牵缠；使陷入"},"examples":[{"en":"Rumors enwound him until he couldn’t speak freely.","zh":"谣言缠住了他，使他无法畅所欲言。"},{"en":"She felt enwound by responsibilities at home.","zh":"她觉得被家里的责任缠得喘不过气。"}]}],"synonyms":["wind around","wrap around","coil around","entwine","encircle","envelop"],"phonetic":"/ɛnˈwaɪnd/","extraExplanation":["“enwinds”通常是动词“enwind”的第三人称单数（he/she/it enwinds）。这个词较偏文学/古风表达，日常英语里更常用“wind around / wrap around / coil around”。","拼写提示：原形是“enwind”，过去式常见为“enwound”，过去分词也可用“enwound”（有时也会见到规则变化“enwinded”，但较少见且不如“enwound”自然）。"]}
{"word":"enwing","summary":{"en":"Enwing is a rare, literary verb meaning “to give wings to” or “to inspire and lift.”","zh":"Enwing 是较少见的文学动词，意思是“给……装上翅膀”，也可引申为“激励、使精神振奋”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary) to give someone or something wings; to enable to fly or to imagine/aspire freely.","zh":"（文学用语）给……装上翅膀；使……能飞；引申为让想象或抱负自由驰骋。"},"examples":[{"en":"The poet’s words seemed to enwing my thoughts and lift them above everyday worries.","zh":"诗人的文字仿佛为我的思想装上翅膀，让它们飞越日常的烦恼。"},{"en":"Hope can enwing a tired heart and make it brave again.","zh":"希望能为疲惫的心装上翅膀，让它重新变得勇敢。"}]}],"synonyms":["give wings to","inspire","uplift","animate","empower"],"phonetic":"/ɛnˈwɪŋ/","extraExplanation":["“en-”是一个常见前缀，表示“使……处于某种状态/赋予……某种性质”（如 enrich 使富裕、enable 使能够）。enwing 就是“使有翅膀”。","enwing 属于较少见、偏文学或诗歌风格的词。日常英语里更常说 give wings to, enable, let…fly, inspire。"]}
{"word":"enwingly","summary":{"en":"“enwingly” is not a standard English word; it is likely a typo. Common intended alternatives include “enjoyingly” (pleasantly) or “winningly” (charmingly).","zh":"“enwingly”不是标准英语单词，可能是拼写错误。常见的目标词可能是“enjoyingly（愉快地）”或“winningly（讨人喜欢地）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a nonstandard form.","zh":"不是标准英语单词；很可能是拼写错误或非规范用法。"},"examples":[{"en":"I couldn’t find “enwingly” in standard dictionaries—did you mean “enjoyingly” or “winningly”?","zh":"我在标准词典里找不到“enwingly”——你想写的是“enjoyingly（愉快地）”还是“winningly（讨人喜欢地）”吗？"}]},{"partOfSpeech":"adv.","definition":{"en":"Possible intended word: “enjoyingly” (in an enjoyable way; pleasantly).","zh":"可能你想写的是：enjoyingly（愉快地；令人享受地）。"},"examples":[{"en":"The story is enjoyingly simple and easy to follow.","zh":"这个故事简单易懂，读起来很愉快。"},{"en":"We spent an enjoyingly quiet evening at home.","zh":"我们在家度过了一个安静而愉快的夜晚。"}]},{"partOfSpeech":"adv.","definition":{"en":"Possible intended word: “winningly” (in a charming, likable way that makes people feel positive toward someone).","zh":"可能你想写的是：winningly（讨人喜欢地；迷人地）。"},"examples":[{"en":"She smiled winningly and introduced herself.","zh":"她讨人喜欢地笑了笑，做了自我介绍。"},{"en":"He spoke winningly, which helped calm the room.","zh":"他说话很有亲和力，这帮助安抚了现场的气氛。"}]}],"synonyms":["enjoyingly","pleasantly","delightfully","winningly","charmingly","engagingly"],"extraExplanation":["“enwingly”很像把某个副词拼错了。英语里很多副词以 -ly 结尾（如 enjoy + -ingly → enjoyingly；winning + -ly → winningly）。","如果你把原句贴出来（包含前后文），我可以更准确判断你想表达的是“愉快地”、 “有说服力地/讨人喜欢地”，还是其他意思。"]}
{"word":"enwisen","summary":{"en":"Enwisen means “to make (someone) wiser,” and it’s an uncommon, old-fashioned word.","zh":"Enwisen 意为“使（某人）更有智慧”，属于较少见、偏旧式/文学的用词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone wiser; to teach or give someone knowledge or good judgment","zh":"使某人更有智慧；教导、启迪，使人增长见识与判断力"},"examples":[{"en":"Experience can enwisen you if you reflect on it.","zh":"如果你愿意反思，经历可以使你更有智慧。"},{"en":"The mentor’s stories enwisened the young artist.","zh":"导师的故事启迪了那位年轻艺术家。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become wiser (rare)","zh":"变得更有智慧（较少见）"},"examples":[{"en":"Over time, she seemed to enwisen and speak with more patience.","zh":"随着时间推移，她似乎变得更有智慧，说话也更有耐心。"}]}],"synonyms":["enlighten","educate","instruct","teach","wisdom","make wiser"],"phonetic":"/ɛnˈwaɪzən/","extraExplanation":["“enwisen”在现代英语中很少使用，更多出现在较旧的文本或仿古/文学风格里。日常表达更常用“make someone wiser”“teach”“enlighten”。","词首“en-”常见于表示“使成为……”的动词（如“enrich”使富有、“enable”使能够）。因此“enwisen”字面意思就是“使变得更有智慧”。"]}
{"word":"enwoman","summary":{"en":"“Enwoman” is a rare, archaic verb meaning to make something or someone more feminine or womanlike.","zh":"“enwoman”是一个罕见的古语动词，意思是使某人或某物更女性化、更具女性气质。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To make (someone or something) womanlike; to give feminine qualities; to feminize.","zh":"（罕见/古语）使（某人或某物）变得女性化；赋予女性气质；使更柔美。"},"examples":[{"en":"Some older poems use “enwoman” to suggest a character becomes softer or more gentle.","zh":"一些较早的诗歌会用“enwoman”来暗示角色变得更柔和、更温柔。"},{"en":"The critic argued that the costume design “enwomaned” the hero, changing how the audience perceived him.","zh":"评论者认为服装设计“enwomaned”（让他更显女性气质），改变了观众对男主角的看法。"}]}],"synonyms":["feminize","make feminine","soften"],"phonetic":"/ɛnˈwʊmən/","extraExplanation":["这个词非常少见，多见于早期文学或带有仿古风格的写作中。现代英语更常用 feminize（使女性化）、make more feminine（变得更女性化）等表达。","前缀 en- 常有“使成为……、使处于……状态”的意思（如 enrich 使富有、enable 使能够）。因此 enwoman 可理解为“使成为女人/使具女人气质”，但日常对话里几乎不用。"]}
{"word":"enwomb","summary":{"en":"“Enwomb” is a rare literary verb meaning to enclose in a womb, or figuratively to wrap and protect completely.","zh":"“enwomb”是少见的文学动词，指“置于子宫中孕育”，也可比喻“包裹并完全庇护”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary) To enclose or hold in a womb; to conceive and carry an embryo/fetus.","zh":"（文学用语）使进入子宫；使受孕并在子宫内孕育。"},"examples":[{"en":"In the poem, the sea is described as a dark cradle that enwombs new life.","zh":"在诗中，大海被描写成黑暗的摇篮，孕育着新生命。"},{"en":"The author uses “enwomb” to suggest that the child is already protected and growing before birth.","zh":"作者用“enwomb”来暗示孩子在出生前就已被保护并逐渐成长。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative, literary) To wrap, surround, or shelter completely, as if inside a womb.","zh":"（比喻，文学用语）包裹；环绕；完全庇护，仿佛置于母体之中。"},"examples":[{"en":"Fog enwombed the city, making the streets feel quiet and unreal.","zh":"浓雾包裹着城市，让街道显得安静而不真实。"},{"en":"She wanted a home that would enwomb her from the noise of the world.","zh":"她想要一个能把她与世间喧嚣隔开的家。"}]}],"synonyms":["enclose","envelop","cradle","shelter","surround","nurture"],"phonetic":"/ɪnˈwuːm/","extraExplanation":["“en-”是英语里常见的前缀，常表示“使进入/使成为/使处于某种状态”（如 enable, enrich, encircle）。因此 enwomb 字面意思就是“使进入子宫/像子宫一样包裹”。","这个词非常少见，多见于诗歌、宗教或古典文学语境，用来营造“孕育、庇护、原初、安全”的意象；日常英语更常用 envelop, cradle, nurture, contain 等。"]}
{"word":"enwombed","summary":{"en":"Enwombed means “enclosed as if in a womb,” often used in literary writing to suggest being hidden, sheltered, or deeply surrounded.","zh":"Enwombed 指“如同在子宫中一样被包裹”，常见于文学描写，强调被隐藏、庇护或深深围住的意象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Enclosed or wrapped up as if in a womb; deeply hidden, sheltered, or surrounded.","zh":"（文学用语）如同在子宫中一样被包裹/封闭；深深隐藏、受庇护或被环境包围。"},"examples":[{"en":"The seed lay enwombed in the dark earth, waiting for spring.","zh":"种子像在子宫里一样被黑暗的泥土包裹着，等待春天。"},{"en":"In the fog, the town seemed enwombed—quiet, muffled, and protected from the world.","zh":"在浓雾中，小镇仿佛被包裹在子宫里——安静、声音被消减，与世隔绝。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To enclose or surround as if in a womb; to embed or wrap up completely.","zh":"（罕用）像子宫一样包裹/围住；把……完全嵌入或封住。"},"examples":[{"en":"The poet wrote that the sea enwombed the ship in darkness.","zh":"诗人写道，大海用黑暗将船完全包裹起来。"},{"en":"Snow enwombed the cottage, softening every edge and sound.","zh":"白雪将小屋包裹起来，使所有的棱角与声音都变得柔和。"}]}],"synonyms":["enclosed","enshrouded","embedded","nestled","swathed","surrounded"],"phonetic":"/ɪnˈwuːmd/","extraExplanation":["“enwombed”多见于诗歌或较古雅的散文，语气带有强烈的意象：不仅是“包围”，还暗示“孕育、保护、遮蔽”。","构词上可理解为 en-（使进入/使处于某状态）+ womb（子宫），因此常用于自然景象或抽象状态的比喻描写。"]}
{"word":"enwombing","summary":{"en":"“Enwombing” is a literary word meaning “enveloping or enclosing like a womb.”","zh":"“enwombing”是偏文学的词，意思是“如子宫般包裹、围绕、容纳”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) enclosing, surrounding, or holding something as if in a womb; warmly enveloping.","zh":"（文学用语）如子宫般包裹、围绕或容纳；温柔地环抱。"},"examples":[{"en":"The fog lay over the harbor, enwombing the ships in silence.","zh":"雾笼罩着港口，如同子宫般把船只包裹在寂静里。"},{"en":"She described the forest as enwombing—dark, protective, and close.","zh":"她形容那片森林“enwombing”——幽暗、保护性强，又让人感觉贴近。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “enwomb”: to enclose or wrap up completely; to hold within (often used in poetic writing).","zh":"“enwomb”的现在分词：把……完全包住；把……纳入其中（多用于诗歌/文学描写）。"},"examples":[{"en":"Clouds were enwombing the mountain peak.","zh":"云层正把山峰完全包住。"},{"en":"Time seems to be enwombing these memories, keeping them hidden but alive.","zh":"时间仿佛把这些记忆包裹起来，让它们隐秘却仍然鲜活。"}]}],"synonyms":["enveloping","encasing","enshrouding","embracing","surrounding"],"phonetic":"/ɪnˈwuːmɪŋ/","extraExplanation":["“enwomb”来自前缀 en-（使进入/使处于某种状态）+ womb（子宫）。因此它常带有“包裹、孕育、保护、封存”的意象，语气偏诗意或古雅，在现代日常英语里不常用。","文学中用它可以强调一种“被温柔地包围/被孕育”的氛围，有时也可表达“封闭、与外界隔绝”的感觉，具体褒贬取决于语境。"]}
{"word":"enwombs","summary":{"en":"“Enwombs” (from “enwomb”) is a rare, literary verb meaning to enclose or cradle something as if in a womb.","zh":"“enwombs”（源自动词“enwomb”）是少见的文学用语，意思是像子宫一样包裹、容纳或护住某物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary) to enclose, wrap, or contain as if in a womb; to cradle protectively inside something.","zh":"（文学用语）像在子宫里一样包裹、容纳或围住；把……温柔地护在里面。"},"examples":[{"en":"The mist enwombs the valley at dawn, hiding the houses in soft gray.","zh":"黎明时薄雾把山谷温柔地包裹起来，把房屋藏在柔和的灰色里。"},{"en":"In her story, the sea enwombs the island, keeping it isolated from the world.","zh":"在她的故事里，大海把岛屿围抱起来，让它与世界隔绝。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put (someone or something) into a womb; to conceive or carry in the womb (very rare).","zh":"把（人或物）置于子宫中；在子宫里孕育、怀胎（非常少见）。"},"examples":[{"en":"The myth says the goddess enwombed a child made of light.","zh":"神话说那位女神在子宫里孕育了一个由光组成的孩子。"}]}],"synonyms":["enclose","envelop","surround","cradle","encase"],"phonetic":"/ɛnˈwuːm/","extraExplanation":["“enwombs”通常是动词“enwomb”的第三人称单数（he/she/it enwombs）。这个词非常少见，多见于诗歌或带强烈意象的散文。","词形结构：前缀 en- 表示“使进入/使处于……之中”（如 encase, enclose），加上 womb（子宫），整体强调“像子宫一样包裹、滋养、保护”的画面感。","使用语感：在现代日常英语里更常用 enclose / envelop / cradle / surround；选择 enwomb 往往是为了更强的“孕育、庇护、隔绝”的文学色彩。"]}
{"word":"enwood","summary":{"en":"Enwood is a rare, old-fashioned verb meaning to cover or surround something with wood or woods, or to make it woody.","zh":"Enwood 是罕见的古语动词，意思是用木材包覆或以树林环绕，使其呈木质/多树的样子。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To cover, surround, or enclose with wood or woods; to make something woody.","zh":"（罕见/古语）用木材包覆；以树林环绕/围住；使某物呈木质或多树的样子。"},"examples":[{"en":"In older writing, the valley was described as enwooded on all sides.","zh":"在较早的文字里，这座山谷被描述为四周林木环绕。"},{"en":"They enwooded the pathway with timber rails to keep carts from slipping.","zh":"他们用木制护栏把小路围起来，防止推车打滑。"}]}],"synonyms":["surround","enclose","cover","wood (up)","make woody"],"phonetic":"/ɛnˈwʊd/","extraExplanation":["“en-”是英语里常见的构词前缀之一，常带有“使……成为/使……处于某种状态、包住、加上”的含义（如 *enrich* 使富裕、*encase* 把……装入壳中）。因此 *enwood* 可理解为“使之变得有木/被木（或树林）包围”。","该词在现代英语中非常少见，更多会用 *surround with trees/woods*, *cover with wood*, *wooded*（形容词）等更常见表达。"]}
{"word":"enworthed","summary":{"en":"“Enworthed” is a rare/archaic word meaning “made worthy or given value; honored.”","zh":"“Enworthed” 是罕见/古体用法，意思是“使更有价值、使配得上（某种荣誉）、使受尊崇”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, archaic) Made worthy; given worth or value; honored or ennobled.","zh":"（罕见/古体）使之有价值、变得更有价值；使之配得上（某种荣誉）；使其受尊崇、提升其身份。"},"examples":[{"en":"Her steady kindness enworthed the simple gift, making it feel precious.","zh":"她持久的善意让这份朴素的礼物更显珍贵。"},{"en":"In the old tale, the hero is enworthed by brave deeds and public trust.","zh":"在那则古老故事里，英雄因勇敢事迹与众人的信任而被“加以尊崇/更显其价值”。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, archaic) To make worthy; to endow with worth; to honor.","zh":"（罕见/古体）使值得；赋予价值；使受尊敬。"},"examples":[{"en":"Time can enworthe ordinary moments by turning them into memories.","zh":"时间能让平凡时刻更显珍贵，把它们变成回忆。"},{"en":"The poet sought to enworthe the everyday through careful language.","zh":"诗人试图用细腻的语言让日常生活更具价值与意味。"}]}],"synonyms":["honored","ennobled","valued","dignified","made worthy"],"phonetic":"/ɛnˈwɝðd/","extraExplanation":["“enworthed”非常少见，多半出现在仿古写作、诗歌或个人造词中。构词上可理解为前缀 en-（表示“使……进入某种状态/使成为……”）+ worth（价值/值得）。","现代英语里通常不用它；更自然的替代表达有：made worthy、honored、ennobled、valued、given value（视语境选择）。","如果你是在某段文本里看到它，也有可能是拼写/印刷误差；常见相近词形包括 enwreathed（被花环/烟雾等环绕）等，最好提供原句以便确认。"]}
{"word":"enworthy","summary":{"en":"“Enworthy” is most likely a rare surname rather than a common English word.","zh":"“Enworthy”更可能是一个罕见的英文姓氏，而不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare family name (surname). It is not a common standard English vocabulary word.","zh":"一个较少见的英文姓氏（家族姓）。它不是常见的标准英语词汇。"},"examples":[{"en":"I found an author named Enworthy in an old local history record.","zh":"我在一份旧的地方史记录里看到一位姓 Enworthy 的作者。"},{"en":"Ms. Enworthy will be joining the meeting today.","zh":"Enworthy 女士今天会参加会议。"}]}],"phonetic":"/ɛnˈwɝði/","extraExplanation":["“enworthy”在现代英语里几乎不作为常用词出现，更常见的是你可能想查的是：\n- “worthy” /ˈwɝði/（值得的；有价值的）\n- “unworthy” /ʌnˈwɝði/（不值得的；不配的）\n如果你是在某本书、名单或家谱材料里看到它，很可能是姓氏，或是较少见的拼写变体。","发音方面，如果作为姓氏按字面读，通常可读作 /ɛnˈwɝði/（重音在 WORTH 上）。实际读音也可能因家族或地区而不同。"]}
{"word":"enwound","summary":{"en":"“Enwound” is an archaic poetic verb meaning “to wrap or wind around; to encircle.”","zh":"“enwound”是古旧的诗性动词，意思是“缠绕；环绕”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic, poetic) To wrap or wind something around; to encircle or entwine.","zh":"（古旧/诗歌用语）把……缠绕起来；环绕；盘绕。"},"examples":[{"en":"Vines enwound the old stone wall.","zh":"藤蔓缠绕着那面古老的石墙。"},{"en":"In the poem, mist enwounds the mountain like a veil.","zh":"在诗里，薄雾像面纱一样环绕着群山。"}]}],"synonyms":["entwine","encircle","enwrap","coil around","wind around"],"phonetic":"/ɛnˈwaʊnd/","extraExplanation":["“enwound”由前缀 en-（使……处于某种状态/加在……上）+ wound（wind 的过去式，意为“缠绕”）构成；这里的 wound 读音同“wound（伤口）”不同义，容易混淆。","这个词在现代英语中很少使用，更常见的表达是：wrap around / wind around / entwine / encircle。用于文学描写时有一种古典、抒情的感觉。"]}
{"word":"enwove","summary":{"en":"“Enwove” is the past form of “enweave,” meaning “woven into” or “interwoven/entangled,” often in literary style.","zh":"“Enwove”是“enweave”的过去式/过去分词，表示“织入、交织、缠绕”，常带文学或古风色彩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “enweave”) to weave something into something else; to interlace or entangle as if by weaving.","zh":"（“enweave”的过去式/过去分词）把……织入……；使……交织、缠绕（像编织一样）。"},"examples":[{"en":"Gold thread was enwove into the border of the cloth.","zh":"金线被织入布料的边缘。"},{"en":"Legends were enwove with history in the old tale.","zh":"在那个古老的故事里，传说与历史交织在一起。"},{"en":"Vines enwove the fence after years of growth.","zh":"多年生长后，藤蔓缠绕着篱笆。"}]}],"synonyms":["interwove","wove into","interwoven","entangled","interlaced"],"phonetic":"/ɛnˈwoʊv/","extraExplanation":["“enwove”属于较少见、偏文学或古风的用法，多见于诗歌、古体散文或仿古写作中；现代英语更常用“woven into / interwoven with / weaved (into)”等表达。","词根上，“en-”有“使进入/使处于……”的意思；“enweave”字面就是“使（某物）被编织进……”。在文学中常用作比喻，表示“情节、情感、命运等相互交织”。"]}
{"word":"enwoven","summary":{"en":"Enwoven means “interwoven”—woven together or closely connected, often in a literary style.","zh":"Enwoven 意为“交织的”，指被编织在一起或紧密相连，常带文学色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"interwoven; woven together (often used in a literary or poetic way).","zh":"交织的；编织在一起的（常用于文学或诗意表达）。"},"examples":[{"en":"Their lives were enwoven with the history of the town.","zh":"他们的人生与这座小镇的历史交织在一起。"},{"en":"The story is enwoven with themes of loss and hope.","zh":"这个故事交织着失落与希望的主题。"},{"en":"In the old tapestry, gold thread is enwoven through the blue cloth.","zh":"在那幅古老的挂毯里，金线穿织在蓝色布料之中。"}]}],"synonyms":["interwoven","intertwined","woven together","entwined","interlaced"],"phonetic":"/ɛnˈwoʊvən/","extraExplanation":["“enwoven”多见于较正式、文学或诗歌语境，相当于更常用的“interwoven / intertwined”。它来自动词“enweave”（把……织入、使交织），但“enweave”本身偏少见。"]}
{"word":"enwrap","summary":{"en":"Enwrap means to wrap or envelop something completely, often used in more literary contexts (fog, darkness, feelings).","zh":"Enwrap 指把某物完全包住或笼罩，常见于较书面/文学性的语境（如雾、黑暗、情绪等）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wrap or cover something completely; to envelop","zh":"把某物完全包住；包裹；围住"},"examples":[{"en":"She enwrapped the gift in bright red paper.","zh":"她用鲜红的包装纸把礼物包了起来。"},{"en":"Fog enwrapped the city all morning.","zh":"浓雾整个上午笼罩着这座城市。"}]},{"partOfSpeech":"vt.","definition":{"en":"to surround someone or something (often in a comforting or overwhelming way)","zh":"环绕（某人/某物），常含“包围、笼罩”之意，可能是温柔或强烈的感受"},"examples":[{"en":"A sense of calm enwrapped him as he listened to the music.","zh":"他听着音乐，一种平静的感觉将他包围。"},{"en":"The story enwraps the reader in mystery.","zh":"这个故事让读者沉浸在神秘之中。"}]}],"synonyms":["wrap","envelop","encircle","surround","enshroud"],"phonetic":"/ɛnˈræp/","extraExplanation":["“enwrap”比常见的“wrap”更偏书面、更有文学感，常用来描写雾、黑暗、寂静、情绪等“像布一样把人包住”的意象。","词形上“en-”有“使进入/使处于……状态”的感觉，所以“enwrap”常带“完全包住、笼罩”的语气。","近义词中：wrap更日常（包礼物）；envelop更正式/客观（信封、烟雾笼罩）；enshroud更偏“遮蔽、阴沉、神秘”。"]}
{"word":"enwrapment","summary":{"en":"Enwrapment means the act/state of being wrapped, or (figuratively) being surrounded by a feeling or atmosphere.","zh":"enwrapment 指“包裹/被包裹的状态”，也可比喻“被某种情绪或氛围笼罩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of wrapping or covering something completely; the state of being wrapped.","zh":"包裹；覆裹的行为；被包裹的状态。"},"examples":[{"en":"The enwrapment of the fragile vase in bubble wrap kept it safe during shipping.","zh":"用气泡膜把易碎花瓶包裹起来，保证了运输安全。"},{"en":"In winter, the enwrapment of a scarf around her neck helped block the wind.","zh":"冬天把围巾围在脖子上能挡风。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, a feeling or atmosphere that surrounds someone, as if it were a physical covering.","zh":"（比喻）笼罩某人的感觉或氛围，仿佛被“裹住”。"},"examples":[{"en":"A quiet enwrapment of sadness settled over the room after the news.","zh":"消息传来后，房间里笼罩着一种安静的悲伤。"},{"en":"He spoke with an enwrapment of calm that made everyone relax.","zh":"他说话带着一种沉稳的气场，让大家都放松下来。"}]}],"synonyms":["wrapping","covering","encasement","enclosure","embrace"],"phonetic":"/ɛnˈræpmənt/","extraExplanation":["“enwrapment”由动词“enwrap”（包裹、裹住）加名词后缀“-ment”构成，意思是“……的行为/结果”。在现代英语里它不算常用，更常见的替代词有“wrapping”“covering”“encasement”（更偏“封装/包覆”）或“embrace”（比喻“包围、拥抱”的感觉）。","文学或描写性语境中，“enwrapment”常用来营造“被某种情绪、气氛或静默包围”的画面感，语气比普通的“wrapping”更诗意。"]}
{"word":"enwrapped","summary":{"en":"Enwrapped means completely wrapped or enveloped, or (figuratively) deeply absorbed in a feeling or thought.","zh":"enwrapped 指被完全包裹/笼罩，也可引申为沉浸在某种情绪或思考中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wrapped up or covered completely; enveloped.","zh":"被包裹住的；被完全覆盖的；被裹住的。"},"examples":[{"en":"The old book was enwrapped in brown paper to protect it.","zh":"那本旧书用牛皮纸包了起来以保护它。"},{"en":"Mist enwrapped the mountains at dawn.","zh":"黎明时分，薄雾笼罩着群山。"}]},{"partOfSpeech":"adj.","definition":{"en":"Deeply absorbed or surrounded (often by a feeling or mood).","zh":"（常指被情绪或氛围）深深包围；沉浸在……之中。"},"examples":[{"en":"She sat quietly, enwrapped in thought.","zh":"她安静地坐着，沉浸在思考中。"},{"en":"The audience was enwrapped in a sense of wonder during the performance.","zh":"演出过程中，观众沉浸在惊奇之中。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “enwrap”: to wrap or cover; to envelop.","zh":"“enwrap”的过去式/过去分词：包裹；覆盖；笼罩。"},"examples":[{"en":"He enwrapped the fragile vase in towels before moving it.","zh":"他在搬运前用毛巾把易碎的花瓶包好。"}]}],"synonyms":["wrapped","enveloped","shrouded","swathed","covered","immersed","absorbed"],"phonetic":"ɪnˈræpt","extraExplanation":["“enwrapped”来自动词 enwrap（en- 表“使……进入/使……处于……之中” + wrap“包裹”）。在文学或较正式的写作中更常见，尤其用于描写“雾/黑暗/寂静”等把事物“笼罩起来”的画面感。","与 wrap（简单“包起来”）相比，enwrap 往往更强调“完全包围、笼罩”或带有更诗意的语气。"]}
{"word":"enwrapping","summary":{"en":"“Enwrapping” means completely surrounding or covering something, literally or emotionally.","zh":"“Enwrapping”表示（字面或比喻）把某物完全包住、围住或笼罩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"covering or surrounding something completely; wrapping around","zh":"把某物完全包住或围住；缠绕包裹"},"examples":[{"en":"Fog was enwrapping the hills, hiding the roads from view.","zh":"雾气正笼罩着群山，把道路都遮得看不见了。"},{"en":"She pulled the scarf higher, enwrapping her neck against the cold wind.","zh":"她把围巾拉高，裹住脖子来挡冷风。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) filling someone’s mind or feelings; absorbing or surrounding emotionally","zh":"（比喻）使某人的思绪或情绪被包围；让人沉浸其中"},"examples":[{"en":"A quiet peace was enwrapping him as the music played.","zh":"音乐响起时，一种安宁感包围着他。"},{"en":"She felt anxiety enwrapping her before the interview.","zh":"面试前，她感到焦虑逐渐笼罩着自己。"}]}],"synonyms":["enveloping","surrounding","wrapping","shrouding","cloaking"],"phonetic":"/ɛnˈræpɪŋ/","extraExplanation":["“enwrapping”是动词“enwrap”的现在分词形式，常见于描写性语境（如雾、黑暗、衣物、情绪等“包围/笼罩”）。","词根上可理解为前缀“en-”（使进入……状态）+ “wrap”（包裹）。拼写上有时也见更常用的“wrapping / enveloping”，语气上“enwrap”更偏文学、较正式。"]}
{"word":"enwraps","summary":{"en":"“Enwraps” means “wraps/envelops completely” (he/she/it enwraps).","zh":"“Enwraps”表示“完全包裹/笼罩”（他/她/它 enwraps）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular of enwrap) to wrap or cover something completely; to envelop.","zh":"（enwrap 的第三人称单数）把某物完全包裹起来；笼罩；裹住。"},"examples":[{"en":"Fog enwraps the city in the early morning.","zh":"清晨的雾笼罩着整座城市。"},{"en":"She pulls the blanket higher until it enwraps her shoulders.","zh":"她把毯子往上拉，直到包住她的肩膀。"},{"en":"A deep silence enwraps the room after the announcement.","zh":"宣布结束后，房间被一种深沉的寂静笼罩。"}]}],"synonyms":["envelops","wraps","surrounds","cloaks"],"phonetic":"/ɪnˈræps/","extraExplanation":["“enwrap”较常见于文学或较正式的语境，比日常的“wrap”更强调“完全包住/笼罩”的感觉。也常用于抽象事物：fog（雾）、darkness（黑暗）、silence（寂静）、mystery（神秘感）等。"]}
{"word":"enwrapt","summary":{"en":"Enwrapt is an archaic literary form meaning “wrapped/enveloped,” or figuratively “absorbed as if wrapped up.”","zh":"Enwrapt 是较古老的文学用词，意为“被包裹/笼罩”，也可引申为“仿佛被包住般地沉浸、专注”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) wrapped or covered; enveloped.","zh":"（古体）被包裹的；被覆盖的；被围住的。"},"examples":[{"en":"She sat enwrapt in a heavy cloak against the cold.","zh":"她裹着厚斗篷坐着抵御寒冷。"},{"en":"The hills were enwrapt in mist at dawn.","zh":"黎明时群山笼罩在薄雾中。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, archaic) absorbed or deeply engaged, as if “wrapped up” in thoughts or feelings.","zh":"（引申，古体）全神贯注的；沉浸其中的（仿佛“被思绪/情感包裹住”）。"},"examples":[{"en":"Enwrapt in his reading, he did not hear the door.","zh":"他沉浸在阅读中，没听见开门声。"},{"en":"They walked on, enwrapt in quiet grief.","zh":"他们继续走着，沉浸在无声的悲伤里。"}]}],"synonyms":["enwrapped","wrapped","enveloped","shrouded","swathed","immersed"],"phonetic":"/ɪnˈræpt/","extraExplanation":["“enwrapt”是较古老/文学化的拼写与用法，相当于现代英语里的“enwrapped”（过去分词作形容词）。在诗歌、宗教或古典文学译本中更常见。","注意不要和“enrapt”（着迷的、陶醉的）混淆：enwrapt 强调“包裹/笼罩”或“被…包住般地专注”，而 enrapt 强调“因愉悦或赞叹而入迷”。"]}
{"word":"enwreath","summary":{"en":"“Enwreath” (more commonly “enwreathe”) means to surround or decorate with something like a wreath, often used in literary description.","zh":"“enwreath”（更常见写作“enwreathe”）指用花环或类似环状之物环绕/装饰，常用于较文学的描写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to surround, cover, or decorate with a wreath or something wreath-like (flowers, smoke, mist, arms, etc.)","zh":"用花环（或环状之物）环绕、覆盖或装饰（如花、烟雾、薄雾、手臂等）"},"examples":[{"en":"The bride’s hair was enwreathed with small white flowers.","zh":"新娘的头发上环绕着小白花作装饰。"},{"en":"Morning mist enwreathed the trees along the river.","zh":"清晨的薄雾缠绕着河边的树木。"},{"en":"Smoke enwreathed the ceiling after the candles were blown out.","zh":"蜡烛被吹灭后，烟雾在天花板附近盘旋缭绕。"}]}],"synonyms":["enwreathe","surround","encircle","garland","wreathe"],"phonetic":"/ɛnˈrið/","extraExplanation":["“enwreath”在现代英语里较少见，更多时候会写作/用作“enwreathe”。带前缀 en- 的动词常有“使进入某种状态、使包围”的感觉（如 encircle, enclose）。","这个词常见于诗歌或较文学的描写，用来营造“缠绕、环抱、环绕”的画面感；日常表达里更常用 surround / decorate with / be wreathed in。"]}
{"word":"enwreathe","summary":{"en":"“Enwreathe” (literary) means to surround, decorate, or envelop something as if with a wreath or a wrapping.","zh":"“enwreathe”（文学用语）指像花环般把某物围绕、装饰，或使其被缠绕/笼罩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary) To surround or decorate (someone or something) with wreaths, flowers, or something that forms a ring or wrapping.","zh":"（文学用语）用花环、花朵或环绕状的东西把（人或物）围住或装饰。"},"examples":[{"en":"The guests enwreathed the doorway with fresh ivy and roses.","zh":"宾客们用新鲜的常春藤和玫瑰把门口装点得环绕成圈。"},{"en":"In the painting, mist enwreathes the mountains at dawn.","zh":"在那幅画中，晨雾在黎明时分缭绕群山。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To wrap or envelop completely, often in something imagined (light, smoke, memories, etc.).","zh":"（引申）把……完全包裹/笼罩（常指光、烟、回忆等抽象之物）。"},"examples":[{"en":"A soft golden light enwreathed the old church.","zh":"柔和的金色光芒笼罩着那座古老的教堂。"},{"en":"Her story enwreathed the room in silence.","zh":"她的故事让整个房间被寂静所笼罩。"}]}],"synonyms":["surround","encircle","envelop","wrap","wreathe"],"phonetic":"/ɛnˈriːð/","extraExplanation":["“enwreathe”较少用于日常口语，更常见于诗歌、小说描写自然景象或氛围的句子中。","前缀“en-”有“使进入……状态/使包裹”的意思（如：encircle, enclose），搭配“wreathe（以花环围绕/缭绕）”，整体语感偏“缠绕、环绕、笼罩”。","近义表达更口语：“surround / encircle / wrap / wreath (something) around”。"]}
{"word":"enwreathed","summary":{"en":"Enwreathed means “surrounded or decorated as if with a wreath,” and it’s a literary word often used for vivid description.","zh":"enwreathed 指“仿佛被花环般环绕或装饰”，偏文学用语，常用于营造画面感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Covered, wrapped, or encircled with wreaths, garlands, or twisting bands; surrounded as if by a wreath.","zh":"（文学用语）被花环/花冠/花圈或盘绕的装饰物覆盖、缠绕或环绕；仿佛被花环围住。"},"examples":[{"en":"The doorway was enwreathed in ivy and white roses.","zh":"门口被常春藤和白玫瑰缠绕装饰着。"},{"en":"Her hair was enwreathed with jasmine for the ceremony.","zh":"仪式上她的头发用茉莉花编成花环装饰。"},{"en":"The hills lay enwreathed in morning mist.","zh":"群山笼罩在晨雾之中，仿佛被雾环绕。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of \"enwreathe\": to cover or surround with a wreath or something wreath-like (used mainly in poetic/literary writing).","zh":"“enwreathe”的过去式/过去分词：用花环或类似花环的东西覆盖或围绕（多见于诗歌/文学语境）。"},"examples":[{"en":"They enwreathed the statue with laurel to honor the winner.","zh":"他们用月桂花环装饰雕像，以致敬获胜者。"},{"en":"The balcony was enwreathed in lights for the festival.","zh":"节日期间阳台被彩灯环绕装点。"}]}],"synonyms":["surrounded","encircled","wreathed","garlanded","adorned"],"phonetic":"ɛnˈriːðd","extraExplanation":["词形来源：en-（使……处于某种状态/把……置于……之中）+ wreathe（编成花环；环绕）。因此 enwreathed 常给人一种“被环绕、被装饰”的画面感，尤其常用于描写自然景象（雾、藤蔓）或节庆装饰（花环、彩灯）。","用法提示：enwreathed 偏文学/诗意表达；日常英语里更常用 surrounded (by), covered (with), wrapped (in) 等。"]}
{"word":"enwreathing","summary":{"en":"“Enwreathing” means wrapping or surrounding something like a wreath (often poetic).","zh":"“enwreathing”指像花环一样缠绕或环绕（多用于文学描写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(present participle of “enwreathe”) surrounding or decorating something by wrapping it with a wreath, garland, or ring-like cluster (often used in poetic/literary writing).","zh":"（“enwreathe”的现在分词）用花环/花圈/花串环绕或装饰某物；像花环一样围绕（常见于诗歌或文学语境）。"},"examples":[{"en":"Vines were enwreathing the old stone gate.","zh":"藤蔓正缠绕着那座古老的石门。"},{"en":"A soft mist came enwreathing the hills at dawn.","zh":"黎明时分，薄雾轻柔地环绕着群山。"},{"en":"She wore her hair with flowers enwreathing it.","zh":"她把花缠在发间，用鲜花装饰头发。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of wrapping, encircling, or adorning with a wreath/garland; the process of forming a ring-like surround.","zh":"缠绕、环绕或以花环/花串装饰的动作或过程；形成环状包围。"},"examples":[{"en":"The enwreathing of the doorway with ivy made the house look timeless.","zh":"用常春藤缠绕门口，让房子看起来历久弥新。"},{"en":"In the poem, the enwreathing of light around the lake suggests calm.","zh":"在这首诗里，光环绕湖面象征着宁静。"}]},{"partOfSpeech":"v.","definition":{"en":"Wrapping or surrounding (someone or something) as if with a wreath; encircling.","zh":"像用花环一样把（人或物）包围起来；环绕。"},"examples":[{"en":"Clouds were enwreathing the mountain peak.","zh":"云层正环绕着山顶。"},{"en":"The scarf was enwreathing her neck against the cold.","zh":"围巾绕着她的脖子御寒。"}]}],"synonyms":["encircling","surrounding","wreathing","garlanding","wrapping around"],"phonetic":"/ɛnˈriːðɪŋ/","extraExplanation":["“enwreathe”由前缀 en-（使进入某种状态/使具有……）+ wreath（花环）构成，语感偏文学与描写性，比常用的 “surround/encircle/wrap” 更有画面感，常用于描写雾、藤蔓、光线、花朵等“柔和地环绕”。","在正式或文学语境中，它常带有审美意味：不仅是“包围”，也暗示“装点、点缀”。在日常口语里更常说 “wrap around” 或 “be covered with”。"]}
{"word":"enwrite","summary":{"en":"Enwrite is an archaic verb meaning “to write in/on; to inscribe or record.”","zh":"enwrite 是一个古语动词，意思是“写入/写在……上；题写、铭刻或记载”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic/rare) To write into or on something; to inscribe or record in writing.","zh":"（古语/罕用）把文字写入或写在某物上；题写、铭刻、记载。"},"examples":[{"en":"The clerk enwrote the payment in the ledger.","zh":"书记把这笔付款记载在账簿里。"},{"en":"Her name was enwrote on the old stone tablet.","zh":"她的名字被刻写在那块古老的石碑上。"}]}],"synonyms":["inscribe","write in","write on","record","enter (in a book)"],"phonetic":"/ɛnˈraɪt/","extraExplanation":["“en-”这个前缀在较古老的英语里常有“使……进入/置于……之中”的意思（类似“enclose, enfold”）。因此“enwrite”字面上有“写进去、写上去”的感觉。","现代英语里“enwrite”几乎不用，通常用“write in / write on / inscribe / record”来表达同样意思。"]}
{"word":"enwrought","summary":{"en":"Enwrought means “worked into something as an integral part,” and it is rare and literary.","zh":"enwrought 意为“被加工并融入某物之中、成为整体的一部分”，属罕见的文学用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) Worked into something; woven, carved, or built in as an integral part.","zh":"（古旧/文学用语）被做进某物之中；（纹样、思想、情感等）被织入、雕入或融入成为整体的一部分。"},"examples":[{"en":"Gold threads were enwrought into the silk, catching the light as she moved.","zh":"金线被织入丝绸中，她一动就闪着光。"},{"en":"In his poems, grief is enwrought with hope rather than set against it.","zh":"在他的诗里，悲伤与希望是交织在一起的，而不是彼此对立。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past participle, rare) To work or shape into; to incorporate by crafting or forming.","zh":"（过去分词，罕见）把……做进/塑入；通过加工、塑形把……融入其中。"},"examples":[{"en":"A small emblem was enwrought into the handle to mark the maker.","zh":"一个小徽记被做进手柄里，用来标识制作者。"}]}],"synonyms":["inwrought","inlaid","woven into","embedded","ingrained","incorporated"],"phonetic":"/ɪnˈrɔt/","extraExplanation":["“en-”在古英语/中古英语中常表示“使……进入/包覆/附着”（类似于 today 的 *enclose, embed*），因此 *enwrought* 字面上就是“wrought（加工成形的）进去了”。","这个词非常少见，更多时候你会看到更常用的替代表达：*inwrought*（更常见的同义古词）、*inlaid*（镶嵌的）、*woven into*（织入）、*embedded*（嵌入）、*ingrained*（根深蒂固的）。","*wrought* 本身常见于固定搭配，如 *wrought iron*（熟铁/锻铁）与 *wrought with*（充满……，如 *wrought with emotion*）。"]}
{"word":"enwwove","summary":{"en":"Enwove means “wove together; blended into a whole,” the past form of enweave (a literary word).","zh":"Enwove 表示“交织在一起/融入整体”，是 enweave 的过去式/过去分词（偏文学用语）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of enweave) to weave or interlace things together; to blend ideas, stories, or elements so they form a whole.","zh":"（enweave 的过去式/过去分词）把……交织在一起；（比喻）把观点、故事或元素融合成一个整体。"},"examples":[{"en":"The author enwove myths and history into a single narrative.","zh":"作者把神话与历史交织成一个叙事。"},{"en":"Gold threads were enwove through the fabric.","zh":"金线被织进了布料里。"},{"en":"Their lives were enwove with the fate of the town.","zh":"他们的生活与小镇的命运紧密交织在一起。"}]}],"synonyms":["interwove","interwoven","wove into","interlaced","braided"],"phonetic":"/ɛnˈwoʊv/","extraExplanation":["你输入的“enwwove”很可能是拼写错误；更常见/正确的形式是 **enwove**（来自动词 **enweave**）。","**enwove/enweave** 属于偏文学、较少见的用法；日常英语里更常用 **interwove / interwoven** 或 **wove into** 来表达“交织/融入”。","在写作中用 **enwove** 会带有更“诗意/文学”的语感，常用于讲故事、主题融合、命运交织等场景。"]}
{"word":"enwwoven","summary":{"en":"Enwoven means “woven together; interwoven,” often used in literary writing.","zh":"Enwoven 意为“交织在一起的；互相编织的”，常见于文学或较正式表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often literary) Woven together; intertwined or interlaced.","zh":"（常见于文学语境）交织在一起的；交错编织的。"},"examples":[{"en":"Her memories were enwoven with the smell of rain and old books.","zh":"她的记忆与雨味和旧书的气息交织在一起。"},{"en":"The story is enwoven with themes of loss and hope.","zh":"这个故事交织着失落与希望的主题。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past participle of \"enwove\" (to weave into; to entwine).","zh":"“enwove”的过去分词：把……织入；使……缠结/交织。"},"examples":[{"en":"Traditions were enwoven into daily life.","zh":"传统被织入了日常生活之中。"},{"en":"The author enwove humor into a serious narrative.","zh":"作者把幽默织入严肃的叙事中。"}]}],"synonyms":["interwoven","woven together","entwined","interlaced","inseparable"],"phonetic":"/ɛnˈwoʊvən/","extraExplanation":["“enwoven/enwove”在现代英语里比较少见，更多出现在诗歌、小说或较正式的描写中。日常表达更常用“interwoven”“woven together”“entwined”。","拼写提醒：你输入的“enwwoven”很可能是“enwoven”的拼写错误（多了一个w）。"]}
