{"word":"enzone","summary":{"en":"An end zone is the scoring area at each end of an American football field.","zh":"end zone 指美式橄榄球球场两端用于达阵得分的区域（达阵区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(American football) The area at each end of the field that a team must reach to score a touchdown; also the space where a receiver catches a scoring pass.","zh":"（美式橄榄球）球场两端用于得分的“达阵区”；也指接球手完成得分接球的区域。"},"examples":[{"en":"He caught the ball in the end zone for a touchdown.","zh":"他在达阵区接住了球，完成了达阵得分。"},{"en":"The defense stopped them one yard short of the end zone.","zh":"防守方把他们拦在离达阵区还差一码的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, a situation where a goal is achieved or a final point is reached (often in sports talk).","zh":"引申义：达到目标或到达“终点/关键点”的状态（多见于体育语境的口语表达）。"},"examples":[{"en":"After months of training, the team finally felt like they were in the end zone.","zh":"训练了几个月后，球队终于感觉自己快要达成目标了。"}]}],"synonyms":["goal line area","scoring area"],"phonetic":"/ˈɛndˌzoʊn/","extraExplanation":["“end zone”是两词组成的名词，常被写成两个词；有时也会写作“endzone”。如果你输入的“enzone”是拼写简化或误拼，标准写法通常是“end zone / endzone”。","美式橄榄球里，进攻方带球进入对方的end zone（或在end zone内接到传球）即可得6分的“touchdown（达阵）”。随后通常还会尝试加分（extra point）或两分转换（two-point conversion）。"]}
{"word":"enzootic","summary":{"en":"Enzootic describes a disease that is consistently present in an animal population or area (animal “endemic”).","zh":"Enzootic 指某种疾病在特定动物群体或地区长期持续存在（动物领域的“地方性流行”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a disease) regularly present in a particular animal population or region; the animal version of “endemic.”","zh":"（疾病）在某一动物群体或地区长期、持续存在的；相当于动物领域的“地方性（endemic）”。"},"examples":[{"en":"Rabies is enzootic in some wildlife populations, so vaccination programs are important.","zh":"狂犬病在一些野生动物种群中呈地方性流行，因此接种疫苗项目很重要。"},{"en":"The report warned that the virus could become enzootic if it keeps circulating among birds.","zh":"报告警告说，如果该病毒持续在鸟类间传播，可能会变成动物地方性流行。"}]}],"synonyms":["endemic (in animals)","native (to a region, of disease)"],"phonetic":"/ˌɛnzoʊˈɑtɪk/","extraExplanation":["“Enzootic”常用于兽医、流行病学与野生动物保护领域，强调“长期存在、稳定出现”，而不是短期暴发。","对比记忆：enzootic（动物地方性）≈ endemic（人群/一般意义的地方性）；epizootic（动物疫情暴发）≈ epidemic（人群流行）。","词源提示：en-（在……之内）+ zoo-（动物）+ -tic（形容词后缀）。"]}
{"word":"enzootically","summary":{"en":"“Enzootically” means a disease is present and maintained in an animal population in a specific area (endemic in animals).","zh":"“Enzootically”表示某种疾病在特定地区的动物群体中长期存在并维持传播（动物的地方性流行）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is consistently present among animals in a particular region or population (the animal equivalent of “endemic”).","zh":"（指动物疾病）以地方性流行的方式；在某一地区或某一动物群体中长期、持续存在（相当于人类疾病中的“地方病/地方性流行”）。"},"examples":[{"en":"Rabies occurs enzootically in some wildlife populations.","zh":"狂犬病在一些野生动物种群中呈地方性流行。"},{"en":"The virus spreads enzootically in bats and occasionally spills over to humans.","zh":"该病毒在蝙蝠中以地方性方式传播，并偶尔“外溢”感染人类。"}]}],"synonyms":["endemically (in animals)","in an enzootic manner","locally (of animal disease)"],"phonetic":"/ˌɛnzoʊˈɑtɪkli/","extraExplanation":["“enzootically”主要出现在兽医学、流行病学与公共卫生（人畜共患病）语境中，强调一种疾病在动物群体里“长期存在、反复出现”，而不是短期的暴发。","对比记忆：enzootic（动物地方性流行）≈ endemic（人群地方性流行）；epizootic（动物疫情暴发）≈ epidemic（人群流行/暴发）。","构词提示：en-（在……之中）+ zoo（动物）+ -tic（形容词后缀）+ -ally（副词后缀）。"]}
{"word":"enzootics","summary":{"en":"“Enzootics” are animal diseases that are consistently present in a specific area or animal population.","zh":"“enzootics”指在特定地区或动物群体中长期、稳定存在的动物地方性流行病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"diseases that regularly occur in a particular animal population or geographic area (the animal equivalent of “endemic” in humans)","zh":"（动物）地方性流行病；在某一动物群体或地区长期、经常出现的疾病（相当于人类的“地方病/地方性流行”）"},"examples":[{"en":"Rabies is enzootic in some wildlife populations.","zh":"在一些野生动物种群中，狂犬病属于地方性流行（enzootic）。"},{"en":"Veterinarians monitor enzootics to prevent sudden outbreaks.","zh":"兽医会监测地方性流行病，以防止突然暴发。"}]}],"synonyms":["endemic animal diseases","animal endemics"],"phonetic":"/ˌɛnzoʊˈɑtɪks/","extraExplanation":["“Enzootic(s)”多用于兽医学与流行病学语境：\n- enzootic：动物中“地方性流行/长期存在”\n- epizootic：动物中“暴发/流行”（类似 humans 的 epidemic）\n- panzootic：动物中“大流行”（类似 humans 的 pandemic）\n词源上，en- 表“在……之内”，-zoo- 与“动物”有关（如 zoo 动物园），-tic 为形容词/名词构词成分。常见用法是“is enzootic in …（在……中呈地方性流行）”。","在新闻或科普中也会看到它用于禽流感、狂犬病、莱姆病等与野生动物/家畜相关的长期存在状态，用来强调“持续存在”而不是“突然爆发”。"]}
{"word":"enzooty","summary":{"en":"“Enzooty” means an enzootic (endemic) animal disease—one that is regularly present in a particular region.","zh":"“Enzooty”指动物的地方性流行病（动物中的“地方病”），即在特定地区经常存在的疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a disease that regularly occurs among animals in a particular region (an animal “endemic” disease); sometimes used for an outbreak of such a disease in a herd or area","zh":"（动物）地方性流行病；指某种疾病在特定地区的动物群体中经常出现（也可指该类疾病在某一畜群/地区的发生）"},"examples":[{"en":"The veterinarian warned that enzooty can persist for years in a herd if vaccination is inconsistent.","zh":"兽医警告说，如果疫苗接种不持续，地方性动物疫病可能在一个畜群中持续多年。"},{"en":"In some regions, rabies is an enzooty among wild animals, creating a risk for pets.","zh":"在一些地区，狂犬病在野生动物中属于地方性流行病，因此会对宠物造成风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) regularly present among animals in a particular area; enzootic","zh":"（罕用）在某一地区的动物群体中经常存在的；动物地方性流行的（同 enzootic）"},"examples":[{"en":"The report described an enzooty pattern of infection in the local deer population.","zh":"报告描述了当地鹿群感染呈动物地方性流行的模式。"}]}],"synonyms":["enzootic","animal endemic disease","endemic (in animals)"],"phonetic":"/ɛnˈzoʊəti/","extraExplanation":["词源提示：en-（在……之中）+ zoo（动物）+ -ty（名词后缀），整体意思接近“动物中的地方性流行”。","易混词对比：\n- enzootic/enzooty：动物中的“地方性”持续存在（类似人类的 endemic）。\n- epizootic：动物中的“流行/暴发”（类似人类的 epidemic）。"]}
{"word":"enzygotic","summary":{"en":"Enzygotic means “related to a zygote,” especially events occurring at or just after fertilization.","zh":"enzygotic 指“与合子/受精卵有关的”，尤指发生在受精时或受精后不久的事件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a zygote (a fertilized egg), especially referring to events, changes, or development that occur at or just after fertilization.","zh":"与“受精卵（合子）”有关的；尤指发生在受精时或受精后不久的过程、变化或发育。"},"examples":[{"en":"Some genetic changes happen in the enzygotic stage, right after fertilization.","zh":"有些遗传变化发生在合子阶段，也就是受精后不久。"},{"en":"Researchers studied enzygotic development in early embryos.","zh":"研究人员研究了早期胚胎的合子期发育。"}]}],"synonyms":["zygotic","post-fertilization (context-dependent)"],"phonetic":"/ˌɛnzaɪˈɡɑtɪk/","extraExplanation":["词源上可拆为 en-（“在……之内/在……过程中”）+ zygote（合子/受精卵）。在遗传学与胚胎学文章中，这个词常用来强调“发生在合子形成时或合子早期”的时间点。","易与 monozygotic（同卵的，源自同一个合子）混淆：monozygotic 通常用来描述双胞胎类型；enzygotic 更常用于描述“阶段/过程/突变发生的时期”。"]}
{"word":"enzym","summary":{"en":"“enzym” is usually a misspelling of “enzyme,” meaning a biological substance that speeds up chemical reactions.","zh":"“enzym”通常是“enzyme”的误拼；“enzyme（酶）”指能加速化学反应的生物物质。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) An informal or incorrect short form people sometimes type when they mean “enzyme,” a substance in living things that speeds up chemical reactions.","zh":"（常见拼写错误）人们有时把“enzym”当作“enzyme”的简写或误拼；“enzyme（酶）”指生物体内能加速化学反应的物质。"},"examples":[{"en":"I wrote “enzym” in my notes, but the correct spelling is “enzyme.”","zh":"我在笔记里写了“enzym”，但正确拼写是“enzyme”。"},{"en":"Enzymes help your body digest food faster.","zh":"酶能帮助你的身体更快地消化食物。"}]}],"synonyms":["enzyme","catalyst (general meaning)"],"phonetic":"/ˈɛnzaɪm/","extraExplanation":["“enzyme（酶）”来自希腊语，含义与“在……之中（en-）+ 酵母/发酵（zyme）”有关，因为早期研究与发酵现象密切相关。","写作或考试中建议使用标准拼写“enzyme”。“enzym”通常只会被视为拼写错误，而不是正式词汇。"]}
{"word":"enzymatic","summary":{"en":"Enzymatic means “related to enzymes” or “done/caused by enzymes,” often used in biology, food science, and cleaning products.","zh":"enzymatic 表示“与酶有关的”或“由酶参与/引起的”，常用于生物学、食品科学与清洁产品等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to enzymes (proteins that speed up chemical reactions in living things).","zh":"与酶有关的；由酶参与或催化的（酶是能加速生命体内化学反应的蛋白质）。"},"examples":[{"en":"Enzymatic reactions help your body digest food.","zh":"酶促反应帮助你的身体消化食物。"},{"en":"The lab measured enzymatic activity at different temperatures.","zh":"实验室测量了不同温度下的酶活性。"}]},{"partOfSpeech":"adj.","definition":{"en":"Caused by or done using enzymes; enzyme-driven.","zh":"由酶引起的；通过酶完成的；酶驱动的。"},"examples":[{"en":"Enzymatic browning makes cut apples turn brown.","zh":"酶促褐变会让切开的苹果变黄褐色。"},{"en":"They used an enzymatic cleaner to remove protein stains.","zh":"他们用酶清洁剂去除蛋白质污渍。"}]}],"synonyms":["enzyme-related","enzyme-driven","catalytic"],"phonetic":"/ˌɛnzaɪˈmætɪk/","extraExplanation":["“Enzymatic”常见搭配有：enzymatic activity（酶活性）、enzymatic reaction（酶促反应）、enzymatic digestion（酶解/酶促消化）、enzymatic browning（酶促褐变）。","词形小提示：enzyme（酶）+ -atic（表示“与……有关的”形容词后缀）。因此 enzymatic = “与酶有关的/由酶参与的”。"]}
{"word":"enzymatically","summary":{"en":"“Enzymatically” means “by using enzymes” or “through enzyme action.”","zh":"“enzymatically”表示“通过酶作用/借助酶来进行”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves, is caused by, or is done using enzymes (natural proteins that speed up chemical reactions in living things).","zh":"以酶的方式；通过酶作用地；由酶促反应引起地（酶是能加速生物体内化学反应的蛋白质）。"},"examples":[{"en":"The starch is enzymatically broken down into sugar during digestion.","zh":"在消化过程中，淀粉会在酶的作用下分解成糖。"},{"en":"This cheese is enzymatically ripened to develop its flavor.","zh":"这种奶酪通过酶促熟成来形成风味。"},{"en":"Enzymatically treated fabrics can feel softer after washing.","zh":"经过酶处理的织物洗后可能更柔软。"}]}],"synonyms":["by enzymatic action","through enzymes","via enzyme catalysis"],"phonetic":"/ˌen.zaɪˈmæt.ɪ.kli/","extraExplanation":["“enzymatically”常见于生物、医学、食品科学与洗涤用品说明书中，强调某个变化不是靠高温或强酸碱“硬做出来”，而是借助酶更有选择性、更温和地进行。","构词法：enzyme（酶）+ -atic（……的）→ enzymatic（酶的/由酶引起的）+ -ally（以……方式）→ enzymatically（以酶的方式）。"]}
{"word":"enzyme","summary":{"en":"An enzyme is a biological catalyst that speeds up reactions in living things.","zh":"酶是生物体内加速化学反应的“催化剂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protein (or sometimes RNA) in living things that speeds up chemical reactions without being used up.","zh":"（多为蛋白质，有时为RNA的）酶：在生物体内加速化学反应但自身不被消耗的物质。"},"examples":[{"en":"Digestive enzymes help your body break down food.","zh":"消化酶帮助身体分解食物。"},{"en":"This enzyme works best at body temperature.","zh":"这种酶在体温下效果最好。"},{"en":"Without the right enzyme, the reaction is too slow.","zh":"没有合适的酶，这个反应会太慢。"}]}],"synonyms":["biological catalyst","catalyst"],"phonetic":"/ˈɛnzaɪm/","extraExplanation":["“enzyme”来自希腊语词源，含义大致为“在……里面（en-）的酵母/发酵（-zyme）”。早期科学家在研究发酵时发现有一些“看不见的催化者”，后来发展成现代的“酶”概念。","学习搭配：常见说法有 digestive enzyme（消化酶）, enzyme activity（酶活性）, enzyme inhibitor（酶抑制剂）, catalyze a reaction（催化反应）。在日常科普里，常把酶比喻成“生物体里的小帮手/加速器”。"]}
{"word":"enzyme-active","summary":{"en":"Enzyme-active means having active enzymes or showing enzyme activity, often used in scientific and product descriptions.","zh":"enzyme-active 指“具有酶活性/含有活性酶；在检测中表现出酶活性”，多用于科研或产品说明。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a substance, ingredient, or surface) able to work through enzymes or to affect enzyme action; having active enzymes so it can speed up a biochemical reaction.","zh":"（指物质、成分或表面）具有酶活性；含有活性酶，能加速生化反应或影响酶的作用。"},"examples":[{"en":"This cleanser is enzyme-active, so it can help break down protein stains.","zh":"这款清洁剂具有酶活性，因此能帮助分解蛋白质污渍。"},{"en":"Keep the enzyme-active solution refrigerated to maintain its activity.","zh":"把酶活性溶液冷藏，以保持其活性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In research/medical contexts) showing measurable enzyme activity in a test or sample.","zh":"（科研/医疗语境）在检测或样本中表现出可测得的酶活性。"},"examples":[{"en":"Only the enzyme-active fraction was used for the next step of the experiment.","zh":"只有具有酶活性的组分被用于实验的下一步。"},{"en":"The lab confirmed the sample is enzyme-active at room temperature.","zh":"实验室确认该样本在室温下具有酶活性。"}]}],"synonyms":["enzymatically active","enzymatic","bioactive (context-dependent)","contains active enzymes"],"phonetic":"/ˈɛnzaɪm ˈæktɪv/","extraExplanation":["“enzyme-active”常见于科学、医学、护肤品与清洁产品说明中，属于较偏专业的形容词。日常更常说“enzymatic（酶的/与酶有关的）”或“contains active enzymes（含有活性酶）”。","写法上常用连字符（enzyme-active）来把两个词组合成一个修饰语；放在名词前更常见（an enzyme-active cleaner）。放在名词后也可以（The cleaner is enzyme-active.）。","注意区分“enzyme-active（具有酶活性）”与“enzyme-activated（被酶激活的）”：前者强调本身有活性酶或能发挥酶作用；后者强调需要酶来启动某过程。"]}
{"word":"enzyme-broken-down","summary":{"en":"Describes something that has been decomposed into smaller parts by enzymes.","zh":"指某物被酶分解（降解）成更小的成分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a substance) decomposed into smaller parts by enzymes; enzymatically degraded.","zh":"（指某种物质）被酶分解成更小成分的；经酶降解的。"},"examples":[{"en":"Enzyme-broken-down proteins are easier for the body to absorb.","zh":"被酶分解的蛋白质更容易被人体吸收。"},{"en":"The label says the formula contains enzyme-broken-down collagen.","zh":"标签写明该配方含有经酶分解的胶原蛋白。"},{"en":"In the lab, we compared fresh starch with enzyme-broken-down starch.","zh":"在实验室里，我们比较了新鲜淀粉和被酶分解后的淀粉。"}]}],"synonyms":["enzymatically broken down","enzyme-degraded","enzymatically degraded","enzymatically hydrolyzed"],"phonetic":"/ˈɛnˌzaɪm ˌbroʊkən ˈdaʊn/","extraExplanation":["“enzyme-broken-down”是常见的科技/产品说明里的复合形容词（compound adjective），通常放在名词前作定语：enzyme-broken-down + 名词（如 proteins / starch / collagen）。","更自然的替代表达包括：“enzymatically broken down”“enzyme-degraded”“enzymatically hydrolyzed（偏专业：酶促水解）”。在正式写作中，“enzymatically broken down”往往比连字符形式更常见。"]}
{"word":"enzyme-catalyzed","summary":{"en":"Enzyme-catalyzed describes a reaction or process that is sped up by an enzyme acting as a catalyst.","zh":"enzyme-catalyzed 用来描述“由酶作为催化剂而加速进行的”反应或过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a reaction or process) made faster or possible because an enzyme acts as a catalyst.","zh":"（指反应或过程）由酶充当催化剂而被加速或得以进行的。"},"examples":[{"en":"This is an enzyme-catalyzed reaction in which starch is broken down into sugars.","zh":"这是一个酶催化反应，淀粉被分解成糖。"},{"en":"In the lab, we compared enzyme-catalyzed and non-catalyzed reaction rates.","zh":"在实验室里，我们比较了酶催化与非催化反应的速率。"},{"en":"Many digestion steps are enzyme-catalyzed processes.","zh":"许多消化步骤都是酶催化过程。"}]}],"synonyms":["enzymatic","enzyme-mediated","enzyme-driven","catalyzed by an enzyme"],"phonetic":"ˈɛnzaɪm ˌkætəˌlaɪzd","extraExplanation":["“enzyme-catalyzed”常见于生物化学与生物学写作，用来强调反应由特定酶促成（例如amylase催化淀粉分解）。","酶作为催化剂通常能降低反应的活化能（activation energy），因此显著加快反应速率，但酶本身在反应前后不会被永久消耗。","写作上它多用于修饰名词：enzyme-catalyzed reaction/process/step；也可写作enzyme catalyzed（不加连字符）但在名词前作定语时加连字符更常见、更清晰。"]}
{"word":"enzyme-driven","summary":{"en":"Enzyme-driven describes processes or reactions that depend on enzymes to make them happen or control their speed.","zh":"Enzyme-driven 指依赖酶来发生或由酶控制反应速度的过程或反应（“酶驱动的”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a process or reaction) powered or controlled by enzymes (biological catalysts), rather than happening on its own.","zh":"（指过程或反应）由酶（生物催化剂）驱动或控制的，而不是自行发生的。"},"examples":[{"en":"Digestion is an enzyme-driven process that breaks food into smaller molecules.","zh":"消化是一个由酶驱动的过程，会把食物分解成更小的分子。"},{"en":"The lab studied an enzyme-driven reaction to speed up drug production.","zh":"实验室研究了一种酶驱动的反应，以加快药物生产。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More generally) organized or made possible by enzyme activity in living cells.","zh":"（更广义）由细胞中的酶活性所组织或促成的。"},"examples":[{"en":"Many enzyme-driven pathways help cells make energy.","zh":"许多酶驱动的代谢通路帮助细胞产生能量。"},{"en":"Enzyme-driven changes in the body can affect how quickly a medicine works.","zh":"体内由酶驱动的变化会影响药物起效的速度。"}]}],"synonyms":["enzyme-catalyzed","enzyme-mediated","catalyzed by enzymes"],"phonetic":"ˈɛnˌzaɪm ˈdrɪvən","extraExplanation":["“enzyme-driven”常见于生物学、医学和化学写作，用来强调“需要酶参与/由酶催化”。如果你看到类似结构（如 “data-driven”“market-driven”），通常表示“由……驱动/主导”。","写作上多用连字符表示这是一个复合形容词：enzyme-driven process（酶驱动的过程）。放在名词后作表语时也常见：The process is enzyme-driven.（这个过程是酶驱动的。）"]}
{"word":"enzyme-inactive","summary":{"en":"“Enzyme-inactive” means unable to act as an enzyme or catalyze reactions.","zh":"“enzyme-inactive”指“酶不活性的；不能催化反应的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to function as an enzyme (it cannot catalyze a biochemical reaction).","zh":"酶不活性的；不能发挥酶作用（无法催化生化反应）。"},"examples":[{"en":"The sample was heated until it became enzyme-inactive.","zh":"样品被加热，直到变成酶不活性。"},{"en":"Use enzyme-inactive serum as a control in the experiment.","zh":"在实验中使用酶不活性的血清作为对照。"},{"en":"This enzyme-inactive mutant binds the substrate but does not catalyze the reaction.","zh":"这种酶不活性的突变体能结合底物，但不催化反应。"}]}],"synonyms":["inactive","nonfunctional","catalytically inactive","enzymatically inactive","inactivated"],"phonetic":"/ˈɛnzaɪm ɪnˈæktɪv/","extraExplanation":["“enzyme-inactive”常见于生物化学/分子生物学语境，强调“酶的催化功能失效”。失活的原因可能包括：高温或极端pH导致蛋白质变性、关键氨基酸突变（如活性位点突变）、被抑制剂结合、或缺少必需的辅因子/金属离子等。","注意与“enzyme-free（无酶的）”区分：enzyme-inactive表示“有这个酶（或酶样蛋白）但不起作用”，enzyme-free表示“根本不含酶”。"]}
{"word":"enzyme-inhibiting","summary":{"en":"Enzyme-inhibiting describes something that reduces or blocks an enzyme’s activity.","zh":"enzyme-inhibiting 指“抑制酶活性”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to slow down or stop the activity of an enzyme (a protein that helps chemical reactions happen in the body or in living things).","zh":"能减慢或阻止酶（帮助生物体内化学反应进行的蛋白质）活性的；抑制酶的。"},"examples":[{"en":"Some medicines are enzyme-inhibiting drugs that reduce how fast the body breaks down certain chemicals.","zh":"有些药物属于抑制酶的药，能降低人体分解某些化学物质的速度。"},{"en":"Researchers tested an enzyme-inhibiting compound to see if it could slow the virus from copying itself.","zh":"研究人员测试了一种抑制酶的化合物，看看能否减缓病毒复制。"}]}],"synonyms":["enzyme-suppressing","enzyme-blocking","inhibitory (to enzymes)"],"phonetic":"/ˈɛnzaɪm ɪnˈhɪbɪtɪŋ/","extraExplanation":["“enzyme-inhibiting”常见于医学、药学与生物化学语境，用来描述“通过抑制特定酶而产生作用”的药物或物质。英文里也常写作“enzyme inhibiting”（不加连字符）或更常见的“enzyme inhibitor”（名词：酶抑制剂）。"]}
{"word":"enzyme-mediated","summary":{"en":"Enzyme-mediated describes a process or reaction that is helped or controlled by an enzyme.","zh":"enzyme-mediated 指由酶促进或控制的过程或反应。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Caused, controlled, or helped by an enzyme—especially describing a chemical reaction that an enzyme speeds up.","zh":"（生物学）由酶引起、控制或促进的——尤指被酶加速的化学反应。"},"examples":[{"en":"Enzyme-mediated reactions usually happen faster than the same reactions without enzymes.","zh":"酶介导的反应通常比没有酶参与的同类反应更快。"},{"en":"The drug is broken down through an enzyme-mediated pathway in the liver.","zh":"这种药物在肝脏中通过酶介导的途径被分解。"},{"en":"Researchers studied enzyme-mediated DNA repair after UV exposure.","zh":"研究人员在紫外线照射后研究了酶介导的 DNA 修复。"}]}],"synonyms":["enzyme-catalyzed","enzyme-dependent","catalyzed by an enzyme","enzyme-driven"],"phonetic":"/ˈɛnzaɪm ˈmiːdieɪtɪd/","extraExplanation":["“enzyme-mediated”是一个复合形容词，常见于生物化学、药理学与分子生物学文献，用来强调“不是自发发生（spontaneous）”，而是需要酶作为催化剂或调控者参与。","写作中常与reaction / process / pathway / mechanism / transport / cleavage / conversion等名词搭配：enzyme-mediated reaction（酶介导反应）、enzyme-mediated metabolism（酶介导代谢）。","近义表达会因语境不同而变：强调“催化”常用enzyme-catalyzed；强调“依赖/需要酶参与”可用enzyme-dependent。"]}
{"word":"enzyme-producing","summary":{"en":"Enzyme-producing describes an organism or cell that makes enzymes.","zh":"enzyme-producing 指能产生（分泌/合成）酶的生物或细胞。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to produce enzymes (proteins that help chemical reactions happen in living things).","zh":"能产生酶的；产酶的（酶是帮助生物体内化学反应进行的蛋白质）。"},"examples":[{"en":"This enzyme-producing bacterium helps break down starch into sugar.","zh":"这种产酶细菌能帮助把淀粉分解成糖。"},{"en":"Researchers isolated an enzyme-producing strain for industrial fermentation.","zh":"研究人员分离出一种产酶菌株用于工业发酵。"}]}],"synonyms":["enzyme-secreting","enzyme-forming","enzyme-generating"],"phonetic":"/ˈɛnzaɪm prəˈdusɪŋ/","extraExplanation":["这是一个复合形容词：enzyme（酶）+ producing（产生……的）。常见于生物学、医学、食品科学与工业发酵等语境，用来描述“能分泌/合成某类酶”的细胞、细菌、真菌、组织或基因工程产物。","连字符 enzyme-producing 在学术写作里更常见，用来清楚地修饰后面的名词（如 enzyme-producing bacteria/strain/microorganism）。在较口语或不需强调复合修饰时，也会写作 enzyme producing。"]}
{"word":"enzyme-related","summary":{"en":"“Enzyme-related” means connected with enzymes or involving enzymes, often used in scientific or medical contexts.","zh":"“enzyme-related”表示“与酶有关/涉及酶的”，常用于科学或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with enzymes (proteins that speed up chemical reactions in living things), especially in biology, medicine, or chemistry.","zh":"与酶有关的；涉及酶的（酶是一类能加速生物体内化学反应的蛋白质），常用于生物学、医学或化学语境。"},"examples":[{"en":"The doctor ordered enzyme-related blood tests to check her liver function.","zh":"医生安排了与酶有关的血液检查，以评估她的肝功能。"},{"en":"Researchers studied enzyme-related pathways that affect how the body breaks down sugar.","zh":"研究人员研究了与酶相关的通路，看看它们如何影响人体分解糖。"},{"en":"Some enzyme-related side effects are mild and go away after treatment ends.","zh":"一些与酶相关的副作用较轻，治疗结束后会消失。"}]}],"synonyms":["enzyme-associated","enzyme-linked","related to enzymes","enzyme-dependent"],"phonetic":"/ˈɛn.zaɪm rɪˌleɪ.tɪd/","extraExplanation":["“enzyme-related”是由名词 enzyme + 形容词 related 组成的复合形容词，常用连字符把两部分连接起来，尤其在学术/医学写作中更常见。","在日常表达里也常用同义结构：“related to enzymes / associated with enzymes / enzyme-associated”。"]}
{"word":"enzyme-treated","summary":{"en":"“Enzyme-treated” describes something that has been processed using enzymes to improve or change it.","zh":"“enzyme-treated”指某物经过酶处理，以改变或改善其特性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"processed with enzymes (natural proteins that speed up chemical reactions) to change or improve a material’s properties.","zh":"经过酶处理的（用酶这种能加速化学反应的蛋白质来加工，以改变或改善材料性质）。"},"examples":[{"en":"Enzyme-treated cotton feels softer and drapes better.","zh":"经过酶处理的棉布手感更柔软、垂坠性更好。"},{"en":"The label says the drink is made with enzyme-treated ingredients.","zh":"标签上写这款饮料使用了经过酶处理的原料。"}]}],"synonyms":["enzyme-processed","enzymatically treated","bio-treated"],"phonetic":"/ˈɛn.zaɪm ˌtriː.tɪd/","extraExplanation":["“enzyme-treated”通常作为复合形容词使用，常用连字符（hyphen）放在名词前：enzyme-treated fabric / enzyme-treated food。放在名词后作表语时，有时也可不加连字符：The fabric is enzyme treated（但加连字符更常见、更清晰）。","在食品与纺织领域很常见：食品中可能用于分解淀粉/蛋白质、改善口感与澄清度；纺织中常见“bio-polishing（生物抛光）”，用酶减少起毛起球、让表面更平滑。"]}
{"word":"enzymes","summary":{"en":"Enzymes are biological catalysts that help reactions happen faster, especially in digestion and other body processes.","zh":"酶是“生物催化剂”，能加快反应速度，常见于消化和人体其他生理过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Proteins (or sometimes RNA) that speed up chemical reactions in living things without being used up.","zh":"在生物体内加速化学反应、而自身不被消耗的物质（通常是蛋白质，有时也可能是RNA）。"},"examples":[{"en":"Digestive enzymes help your body break down food into smaller parts.","zh":"消化酶帮助身体把食物分解成更小的部分。"},{"en":"When the enzyme is too hot, it may stop working properly.","zh":"当酶温度过高时，可能会失去正常功能。"},{"en":"This reaction needs an enzyme to happen fast enough in the cell.","zh":"这个反应需要酶才能在细胞中足够快地进行。"}]}],"synonyms":["biological catalyst","catalyst"],"phonetic":"/ˈɛn.zaɪmz/","extraExplanation":["“Enzymes”是“enzyme”的复数形式。很多酶的名字以 -ase 结尾（如 lactase 乳糖酶、amylase 淀粉酶），这是常见的命名线索。","酶常被比喻为“催化剂”或“生物催化剂”：它们降低反应所需的能量门槛（活化能），让反应更容易发生，但酶本身不等于反应物。","在日常语境中，“enzyme”常出现在健康与食品话题：如“digestive enzymes（消化酶）”“enzyme cleaner（酶清洁剂）”“enzyme activity（酶活性）”。"]}
{"word":"enzymic","summary":{"en":"“Enzymic” means “related to enzymes,” often used in scientific writing (similar to “enzymatic”).","zh":"“enzymic”意为“与酶有关的”，常用于科学/医学语境（与“enzymatic”同义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to enzymes (proteins in living things that speed up chemical reactions).","zh":"与酶有关的；由酶引起或参与的（酶是能加速体内化学反应的蛋白质）。"},"examples":[{"en":"Enzymic reactions help your body digest food.","zh":"酶促反应帮助你的身体消化食物。"},{"en":"The lab measured enzymic activity in the blood sample.","zh":"实验室测量了血液样本中的酶活性。"},{"en":"Heat can reduce enzymic function by damaging the enzyme.","zh":"高温可能通过破坏酶而降低其酶功能。"}]}],"synonyms":["enzymatic"],"phonetic":"/ɛnˈzaɪmɪk/","extraExplanation":["“enzymic”多见于科学/医学写作（如 enzymic activity/enzymic reaction），日常英语更常用同义词 “enzymatic”。两者意思相同，只是使用频率与风格不同。","词根提示：enzyme（酶）+ -ic（形容词后缀，表示“……的/与……有关的”）。"]}
{"word":"enzymically","summary":{"en":"“Enzymically” means “in an enzyme-related or enzyme-catalyzed way.”","zh":"“enzymically”表示“以酶相关/酶促（酶催化）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves enzymes (biological substances that speed up chemical reactions).","zh":"以酶的方式；涉及酶（能加速化学反应的生物物质）地。"},"examples":[{"en":"The reaction proceeds enzymically in living cells.","zh":"这种反应在活细胞中以酶促的方式进行。"},{"en":"The substance is broken down enzymically during digestion.","zh":"这种物质在消化过程中被酶促分解。"}]}],"synonyms":["enzymatically"],"phonetic":"/ɛnˈzaɪmɪkli/","extraExplanation":["“enzymically”多见于生物化学、医学与科研写作中，日常英语里更常用“enzymatically”。两者意思基本相同，只是“enzymatically”更常见、也更口语一点点。","词形来源：enzyme（酶）+ -ic（……的）+ -ally/-ly（……地）。因此它强调“由酶参与/催化而发生”的方式，而不是单纯“在生物体内发生”。"]}
{"word":"enzymologies","summary":{"en":"Enzymologies means the study (or different branches of study) of enzymes.","zh":"enzymologies 指“酶学”，即对酶的研究（也可指不同的研究分支/体系）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of enzymes (proteins that speed up chemical reactions in living things)","zh":"酶学；对“酶”（在生物体内加速化学反应的蛋白质）的科学研究"},"examples":[{"en":"Enzymologies help scientists understand how the body breaks down food and makes energy.","zh":"酶学帮助科学家理解人体如何分解食物并产生能量。"},{"en":"Modern enzymologies are important in medicine and biotechnology.","zh":"现代酶学在医学和生物技术中很重要。"}]}],"synonyms":["enzymology","enzyme research","study of enzymes"],"phonetic":"/ˌɛnzaɪˈmɑlədʒiz/","extraExplanation":["“enzymologies”是名词复数形式；更常见的单数是“enzymology”，通常作为不可数名词使用（比如：the field of enzymology）。当说“different enzymologies”时，往往是在区分不同研究方向、方法体系或学派。","词形构成：enzyme（酶）+ -ology（……学/……研究）。在学术语境中常见搭配：enzyme kinetics（酶动力学）、active site（活性位点）、inhibitor（抑制剂）、catalysis（催化）。"]}
{"word":"enzymologist","summary":{"en":"An enzymologist is a scientist who specializes in studying enzymes.","zh":"enzymologist 指专门研究酶的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies enzymes—proteins that speed up chemical reactions in living things (and in labs or industry).","zh":"酶学家；研究酶的科学家——酶是能加速生物体（以及实验室或工业中）化学反应的蛋白质。"},"examples":[{"en":"The enzymologist tested how temperature changes affect the enzyme’s activity.","zh":"这位酶学家测试了温度变化如何影响酶的活性。"},{"en":"An enzymologist may work in medicine, food science, or biotechnology.","zh":"酶学家可能在医学、食品科学或生物技术领域工作。"}]}],"synonyms":["enzyme researcher","enzyme scientist","biochemist (broader)"],"phonetic":"/ˌɛn.zaɪˈmɑl.ə.dʒɪst/","extraExplanation":["“enzymologist”由“enzyme（酶）+ -logist（……学家/研究者）”构成，表示专门研究某一领域的人。","酶学家的工作常涉及：测定酶活性、研究抑制剂（会减弱酶作用的物质）、解析酶的结构与机制，以及开发工业用酶（如洗衣粉中的蛋白酶、食品加工中的淀粉酶）。","常见近义表达有“enzyme researcher（酶研究者）”；更大的学科领域可说“biochemist（生物化学家）”，但biochemist范围更广，不一定专注于酶。"]}
{"word":"enzymology","summary":{"en":"Enzymology is the scientific study of enzymes and how they control and speed up reactions in living organisms.","zh":"Enzymology 指“酶学”，即研究酶及其在生物体内如何控制并加速化学反应的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of enzymes, including how they work, how they are regulated, and how they affect chemical reactions in living things","zh":"酶学；研究酶的科学，包括酶如何起作用、如何被调控，以及它们如何影响生物体内的化学反应"},"examples":[{"en":"Enzymology helps explain how the body breaks down food into usable energy.","zh":"酶学帮助解释人体如何把食物分解成可利用的能量。"},{"en":"She studies enzymology to understand how enzymes speed up reactions in cells.","zh":"她学习酶学，以了解酶如何加速细胞内的反应。"},{"en":"This drug was developed using insights from enzymology and biochemistry.","zh":"这种药物是在酶学与生物化学研究成果的基础上开发出来的。"}]}],"synonyms":["enzyme science","study of enzymes","biochemistry (related field)"],"phonetic":"/ˌɛnzaɪˈmɑlədʒi/","extraExplanation":["词源提示：enzyme（酶）+ -logy（“……学/研究”）。所以 enzymology 直译就是“酶的研究”。","常见搭配：enzymology lab（酶学实验室）、enzyme kinetics（酶动力学，酶学中的重要分支）、metabolic pathways（代谢通路，常与酶学一起讨论）。"]}
{"word":"enzymolysis","summary":{"en":"Enzymolysis is the enzyme-driven breakdown (often hydrolysis) of a substance.","zh":"Enzymolysis 指由酶催化引起的物质分解（常为水解）过程，即“酶解”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the breaking down (hydrolysis) of a substance by enzymes; enzymatic decomposition","zh":"（酶解）由酶催化使物质发生分解/水解的过程；酶促分解"},"examples":[{"en":"Enzymolysis helps turn starch into sugars during digestion.","zh":"在消化过程中，酶解有助于把淀粉分解成糖。"},{"en":"The lab measured the rate of enzymolysis at different temperatures.","zh":"实验室测量了不同温度下酶解速率的变化。"}]}],"synonyms":["enzymatic hydrolysis","enzymatic breakdown","enzyme-catalyzed hydrolysis"],"phonetic":"/ˌɛnzaɪˈmɑləsɪs/","extraExplanation":["“enzymolysis”常见于生物化学、食品科学与制药领域，强调“由酶催化的分解/水解”。日常英语里更常用“enzymatic hydrolysis（酶促水解）”或直接说“enzymes break down…（酶分解……）”。","词源结构：enzyme（酶）+ -lysis（分解、溶解）。同类词还有“hydrolysis（水解）”“glycolysis（糖酵解）”。"]}
{"word":"enzymolytic","summary":{"en":"Enzymolytic means ‘enzyme-caused’ or ‘broken down by enzymes.’","zh":"enzymolytic 指“由酶引起的/通过酶作用分解的（酶解的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Chemistry) Caused by enzymes; able to break down a substance through enzyme action (enzymatic breakdown). Examples: (1) The paper describes enzymolytic degradation of cellulose by fungal enzymes. (2) Enzymolytic reactions can be very specific to certain molecules.","zh":"（生物/化学）由酶引起的；通过酶的作用分解某种物质的（酶促分解的）。例句：（1）该论文描述了真菌酶对纤维素的酶促分解。 （2）酶促分解反应往往对特定分子非常“挑剔”。"},"examples":[{"en":"Researchers measured the enzymolytic breakdown of starch during digestion.","zh":"研究人员测量了消化过程中淀粉的酶促分解。"},{"en":"This bacterium secretes proteins with strong enzymolytic activity.","zh":"这种细菌会分泌具有很强酶解活性的蛋白质。"}]}],"synonyms":["enzymatic","enzyme-mediated","enzymatically degradative"],"phonetic":"ˌɛnzaɪmoʊˈlɪtɪk","extraExplanation":["“enzymolytic”常见于科研语境，日常英语里更常用的是“enzymatic”（酶的/酶促的）或“enzyme-mediated”（由酶介导的）。","构词提示：enzyme（酶）+ -lytic（溶解的/分解的，来自希腊语词根，常见于 *lysis* “裂解/溶解”）。因此该词强调“分解（lysis）是由酶完成的”。"]}
{"word":"enzymosis","summary":{"en":"A rare/old term meaning enzyme-driven chemical change, especially fermentation.","zh":"一个罕用/旧式词，指由酶引起的化学变化，尤指发酵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The action or process of an enzyme causing a chemical change, especially fermentation; enzyme-driven decomposition.","zh":"（罕用）指酶引起化学变化的作用或过程，尤指发酵；由酶驱动的分解过程。"},"examples":[{"en":"In early scientific writing, “enzymosis” was sometimes used to describe fermentation in bread and wine making.","zh":"在早期科学写作中，“enzymosis”有时用来描述面包和葡萄酒制作中的发酵。"},{"en":"The author attributed the sour smell to enzymosis occurring in the stored fruit.","zh":"作者把酸味归因于储存水果中发生的酶促发酵/分解过程。"}]}],"synonyms":["fermentation","enzymatic activity","enzyme action","enzymatic process"],"phonetic":"/ˌɛnzaɪˈmoʊsɪs/","extraExplanation":["“enzymosis”在现代英语里几乎不用，多见于19世纪的科学文献。如今更常用的说法是“enzyme action / enzymatic activity（酶活性）”或直接说“fermentation（发酵）”。","词形上看像“osmosis（渗透作用）”，但它的核心含义是“酶促作用”，不是“渗透”。阅读老文献时看到它，通常可以理解为“酶导致的发酵/分解”。"]}
{"word":"enzymotic","summary":{"en":"Enzymotic means “related to enzymes/enzymatic action,” and it can also be an old term for certain infectious or fermentation-like processes.","zh":"enzymotic 指“与酶或酶促作用有关的”；也可作旧称，指与某种“发酵样/传染性”过程有关（多见于19世纪文献）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to enzymes or to the action of enzymes; caused by enzymatic processes.","zh":"与酶有关的；与酶的作用有关的；由酶促反应引起的。"},"examples":[{"en":"Enzymotic browning can turn cut apples brown if they’re left in the air.","zh":"酶促褐变会让切开的苹果暴露在空气中后变黄褐色。"},{"en":"The paper compared enzymotic activity at different temperatures.","zh":"这篇论文比较了不同温度下的酶促活性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Older usage) Relating to fermentation or a “zymotic”/infectious process (an outdated scientific idea in 19th‑century medicine).","zh":"（旧用法）与发酵或所谓“酶病性/瘴气性”传染过程有关（19世纪医学中的过时概念）。"},"examples":[{"en":"Some Victorian writers described cholera as an enzymotic disease.","zh":"一些维多利亚时期的作者把霍乱描述为“酶病性（enzymotic）”疾病。"},{"en":"The term appears in older public‑health reports, but it is rarely used in modern medicine.","zh":"这个词在早期公共卫生报告中出现过，但在现代医学中几乎不用。"}]}],"synonyms":["enzymatic","enzyme-related","(older) zymotic"],"phonetic":"/ˌɛnzaɪˈmɑtɪk/","extraExplanation":["“enzymotic”在现代英语里非常少见；写科研或科普时更常用的是“enzymatic（酶的/酶促的）”。","19世纪的“zymotic/enzymotic disease”曾被用来指代被认为由某种“发酵样过程”引起的传染病；随着细菌学与病原体理论的发展，这种分类逐渐被淘汰。"]}
{"word":"enzyms","summary":{"en":"“Enzyms” is a misspelling of “enzymes,” meaning biological proteins that speed up chemical reactions.","zh":"“enzyms”是“enzymes（酶）”的误拼，指能加速化学反应的生物蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) “enzyms” usually means “enzymes”: proteins in living things that speed up chemical reactions in the body (like digestion).","zh":"（常见拼写错误）“enzyms”通常指“enzymes（酶）”：生物体内能加速化学反应的蛋白质（例如帮助消化）。"},"examples":[{"en":"Some people misspell “enzymes” as “enzyms.”","zh":"有些人会把“enzymes”误拼成“enzyms”。"},{"en":"Digestive enzymes help break down food in your stomach and intestines.","zh":"消化酶帮助在胃和肠道中分解食物。"}]}],"synonyms":["biological catalysts"],"phonetic":"/ˈɛn.zaɪmz/","extraExplanation":["“Enzyme（酶）”常见于生物、营养与医学语境。日常里也常说：digestive enzymes（消化酶）、lactase（乳糖酶）、amylase（淀粉酶）。拼写上注意是 en-zy-mes，结尾是 -mes。"]}

