{"word":"exd.","summary":{"en":"An abbreviation whose meaning depends on context, often related to finance (not including a dividend).","zh":"一个依语境而定的缩写，常见于金融语境，表示不包含股息（除息）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Unclear entry: “exd.” is usually an abbreviation (not a standard standalone English word). Common meanings include “ex-dividend” (finance) or a shortened form used in notes/messages.","zh":"不明确条目：“exd.” 通常是缩写（不是标准独立英文单词）。常见含义包括金融里的“除息（ex-dividend）”，或在笔记/聊天中随手写的缩写。"},"examples":[{"en":"The stock is exd. tomorrow, so buyers after today won’t receive the dividend.","zh":"这只股票明天除息，所以今天之后买入的人拿不到这次股息。"},{"en":"In my notes, I wrote “exd.” as a quick abbreviation, but I should spell it out for clarity.","zh":"在我的笔记里我用“exd.”做了快速缩写，但为了清楚起见最好写全。"}]}],"synonyms":["ex-dividend","without dividend"],"phonetic":"/ˌɛks ˈdɪvɪdɛnd/","extraExplanation":["你看到“exd.”的具体句子/领域很关键：在股票/分红语境里，最常见是“ex-dividend（除息）”。在别的语境里可能只是个人缩写。","如果你想查的其实是“etc.”或“e.g.”之类，也可能是拼写/输入错误。把原句发我，我可以按真实含义整理词条和用法。"],"etymology":"多见于缩写用法；若指金融“ex-dividend”，其中 ex- 源自拉丁语，表示“在……之外/不再包含”。“dividend”来自拉丁语 dividere（分开、分配）。","mnemonic":["如果是金融含义：记 ex- = “不含/不再有”，所以 ex-dividend = “不含股息（除息）”。"]}
{"word":"exdelicto","summary":{"en":"Ex delicto means “arising from a tort or wrongful act,” not from a contract.","zh":"Ex delicto 指“源于侵权或不法行为（而非源于合同）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Legal) Arising from a wrongful act or tort (a civil wrong), rather than from a contract.","zh":"（法律）因侵权或不法行为而产生的；源于侵权责任，而非源于合同。"},"examples":[{"en":"The plaintiff brought an action ex delicto for negligence after the accident.","zh":"事故发生后，原告以过失侵权为由提起侵权之诉（ex delicto）。"},{"en":"Damages in an ex delicto claim are meant to compensate for harm caused by wrongdoing.","zh":"侵权之诉（ex delicto）中的赔偿旨在补偿因不法行为造成的损害。"}]},{"partOfSpeech":"n.","definition":{"en":"A legal action or claim based on a tort or wrongful act.","zh":"（法律）基于侵权或不法行为的诉讼或请求。"},"examples":[{"en":"The court treated the case as ex delicto rather than ex contractu.","zh":"法院将该案视为侵权之诉（ex delicto），而非合同之诉（ex contractu）。"}]}],"synonyms":["tort-based","arising from a tort","based on wrongdoing"],"phonetic":"/ˌɛks dɪˈlɪktoʊ/","extraExplanation":["“ex delicto”是拉丁语法律用语，字面意思是“出自不法行为/侵权”。在英美法语境中常与“ex contractu”（源于合同）对比，用来区分责任来源：一个来自侵权（如过失、诽谤、侵害财产），另一个来自合同违约。","它多见于判例、法律文书或课堂讨论，日常英语中很少使用。学习时可以把它理解为“tort-based（基于侵权的）”。"]}
{"word":"exdie","summary":{"en":"“exdie” isn’t a standard English word; it’s likely a misspelling or a proper name.","zh":"“exdie” 不是标准英文单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/username. If you meant another word (e.g., “edify,” “exile,” “expire,” “die,” or “ex-DIE” in a specific context), tell me the intended spelling or a sample sentence and I’ll define it.","zh":"不是标准英文单词；更可能是拼写错误，或是人名/用户名。若你想查的是另一个词（如 edify、exile、expire、die，或特定语境下的 ex-DIE），请提供正确拼写或例句，我就能给出准确释义。"},"examples":[{"en":"I couldn’t find “exdie” in a standard dictionary—could you share the sentence you saw it in?","zh":"我在常见词典里找不到 “exdie”——你能把它出现的句子发我吗？"},{"en":"Did you mean “edify” (to improve someone morally or intellectually)?","zh":"你是不是想说 “edify”（在道德或知识上启发、教化）？"}]}],"extraExplanation":["“exdie” 很可能是以下几种情况之一：\n1) 拼写错误：常见接近的词有 edify（启发/教化）、exile（流放/流亡）、expire（到期/过期）、excise（切除/消费税）、eddie（漩涡/涡流）。\n2) 专有名词：游戏ID、网名、品牌名、项目代号等通常不在词典收录范围内。\n3) 特定领域缩写：例如公司内部系统、课程缩写、医学/工程缩写等。\n如果你把它所在的一整句发来，我可以根据语境判断你真正想表达的词，并给出准确释义与例句。"]}
{"word":"exdividend","summary":{"en":"Ex-dividend describes a stock trading without the upcoming dividend; buyers on/after the ex-dividend date usually won’t receive it.","zh":"ex-dividend 指股票进入除息状态；在除息日及之后买入的人通常拿不到即将发放的那次股息。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Finance) The period when a stock trades without the right to receive the next declared dividend; if you buy on or after the ex-dividend date, you usually will not get that upcoming dividend.","zh":"（金融）除息期/除息的：股票在“除息日”及之后交易时，买入者通常无权领取即将发放的那次股息；股息通常归除息日前持有该股票的人。"},"examples":[{"en":"The stock went ex-dividend today, so new buyers won’t receive this quarter’s dividend.","zh":"这只股票今天除息，所以新买入的人拿不到本季度的股息。"},{"en":"If you want the dividend, you generally need to buy before the ex-dividend date.","zh":"如果你想拿到股息，一般需要在除息日之前买入。"}]}],"synonyms":["ex-div","without dividend (upcoming)"],"phonetic":"/ˌɛks ˈdɪvɪdɛnd/","extraExplanation":["“ex-”来自拉丁语，表示“没有/不含/脱离”。在金融语境中，ex-dividend（除息）对应的还有 ex-rights（除权）等。","常见规则（以美国市场为例）是：在除息日或之后买入通常拿不到即将发放的股息；要拿到股息，需要在除息日之前买入并在记录日（record date）股东名册上。具体仍以交易所与公司公告为准。","除息日当天，股价往往会在开盘时理论上向下调整接近股息金额，但实际价格还会受市场供需、消息面等影响。"]}

