{"word":"exgorgitation","summary":{"en":"“Exgorgitation” is likely a misspelling of “regurgitation”: bringing material back up, or repeating information without thinking.","zh":"“exgorgitation”很可能是“regurgitation”的拼写错误：指反流/回吐，也可指不加思考地照搬复述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely meant) the act of bringing swallowed food, liquid, or material back up into the mouth; sometimes used medically or to describe repeating information without thinking.","zh":"（可能你想写的是）反流；把吞下去的食物、液体或物质返到口腔中；也可引申为不加思考地照搬、复述信息。"},"examples":[{"en":"The baby’s regurgitation is common, but ask a doctor if it happens often or causes pain.","zh":"婴儿反流很常见，但如果频繁发生或伴随疼痛，建议咨询医生。"},{"en":"In the exam, he gave a regurgitation of facts instead of explaining the ideas.","zh":"考试中他只是照搬事实，没有解释核心思想。"}]}],"synonyms":["reflux","spit-up","vomiting (informal/general)","rote repetition"],"phonetic":"/riˌɡɝdʒəˈteɪʃən/","extraExplanation":["“exgorgitation”在英语中不是常见或标准拼写。最接近、最常用的词通常是 **regurgitation**（反流；照搬式复述）。如果你想表达“强烈的劝告/敦促”，可能是 **exhortation**；如果想表达“夸大”，可能是 **exaggeration**。你也可以告诉我你想表达的中文意思或使用场景，我可以帮你确定正确单词。"]}
{"word":"exgratia","summary":{"en":"Ex gratia means given voluntarily as a goodwill gesture, not because it is legally owed.","zh":"ex gratia 指“出于善意自愿给予的”，强调并非法律义务或不承认法律责任的付款/补偿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Given as a favor or goodwill, not because it is legally required.","zh":"出于善意或恩惠而给予的（并非法律义务所要求）。"},"examples":[{"en":"The company offered an ex gratia payment to the customer for the inconvenience.","zh":"公司向客户提供了一笔“恩恤性/善意”的补偿金，以弥补不便。"},{"en":"She received an ex gratia settlement even though the contract did not require it.","zh":"尽管合同并不要求，她仍收到了一个“非强制”的和解补偿。"}]},{"partOfSpeech":"n.","definition":{"en":"A payment or compensation made voluntarily, without admitting legal responsibility.","zh":"（不承认法律责任前提下）自愿给付的款项；恩恤金/善意补偿。"},"examples":[{"en":"They approved an ex gratia to help the family cover funeral costs.","zh":"他们批准发放一笔恩恤金，帮助家属支付葬礼费用。"},{"en":"The insurer made an ex gratia after reviewing the case, as a gesture of goodwill.","zh":"保险公司在审查案件后出于善意做出了一次自愿给付。"}]}],"synonyms":["voluntary","goodwill","non-obligatory","gesture of goodwill","without legal liability"],"phonetic":"/ˌɛks ˈɡrɑːʃə/","extraExplanation":["“ex gratia”源自拉丁语，字面意思是“出于恩惠/出于情面”。在英语法律、保险、公司人事等语境里很常见，常用来强调：这笔钱是自愿给的，不代表承认过错或承担法律责任。","常见搭配：ex gratia payment（善意/恩恤性付款）、ex gratia settlement（自愿和解补偿）、make an ex gratia payment（做出自愿给付）。","拼写提示：常连写为两个词“ex gratia”，也可作形容词短语使用；发音和重音在不同地区略有差异。"]}

