{"word":"exuberance","summary":{"en":"Exuberance means lively, joyful energy, and it can also mean excessive growth or activity.","zh":"Exuberance 指热情洋溢、精力充沛，也可指过度旺盛的生长或活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of showing a lot of energy, excitement, and happiness; lively enthusiasm","zh":"充沛的精力与热情；兴高采烈；洋溢的活力"},"examples":[{"en":"Her exuberance made the whole team feel more confident.","zh":"她的热情让整个团队都更有信心。"},{"en":"The children ran into the park with exuberance.","zh":"孩子们兴高采烈地跑进公园。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of having too much of something, especially growth or activity","zh":"过度旺盛；过多（尤指生长或活动过于繁盛）"},"examples":[{"en":"Gardeners pruned the plants to control their exuberance.","zh":"园丁修剪植物以控制其过度生长。"},{"en":"Some critics warned that the market’s exuberance could lead to risky decisions.","zh":"一些评论人士警告市场的过度乐观可能导致冒险决策。"}]}],"synonyms":["enthusiasm","high spirits","vivacity","ebullience","overflow"],"phonetic":"/ɪɡˈzuːbərəns/","extraExplanation":["词源上与拉丁语中表示“充满、丰沛”的含义有关，所以它既能指“情绪上的热情洋溢”，也能指“数量或生长上的过度旺盛”。","常见搭配：with exuberance（热情地）、youthful exuberance（年轻人的朝气）、an exuberance of + 名词（……的过盛/过多）。在财经语境里，常见短语“irrational exuberance（非理性繁荣/非理性乐观）”。"]}
{"word":"exuberances","summary":{"en":"Exuberances means multiple instances or forms of exuberance: lively enthusiasm, or abundant rich growth.","zh":"Exuberances 指 exuberance 的复数：多种/多次的热情兴奋，或（自然、风格等的）繁盛丰沛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of exuberance: strong, lively energy and excitement; great enthusiasm","zh":"exuberance 的复数：旺盛而充满活力的兴奋感；热情洋溢"},"examples":[{"en":"Her exuberances were obvious—she talked fast and smiled at everyone.","zh":"她的热情与兴奋显而易见——说话很快，对每个人都微笑。"},{"en":"The team’s exuberances after the win filled the whole stadium.","zh":"球队获胜后的欢腾与激动充满了整个体育场。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of exuberance: an abundance or rich growth of something (often in writing about nature, art, or style)","zh":"exuberance 的复数：某物的繁盛、过度充沛（常用于描写自然、艺术或风格）"},"examples":[{"en":"In spring, the garden shows exuberances of color and scent.","zh":"春天里，花园呈现出色彩与香气的繁盛。"},{"en":"The novel is full of exuberances of imagination.","zh":"这部小说充满了想象力的喷涌与丰沛。"}]}],"synonyms":["enthusiasms","high spirits","excitements","abundance","profusion"],"phonetic":"/ɪɡˈzuːbərəns/","extraExplanation":["“Exuberance”既可指人的情绪（热情、兴奋），也可指事物的“丰盛/繁茂”。复数“exuberances”多用于强调“多种表现”或“多处繁盛”，比如不同场合的热情表现、或自然景象中多样的繁茂。"]}
{"word":"exuberancy","summary":{"en":"Exuberancy means lively, joyful energy and enthusiasm; it can also mean excessive optimism or excitement, especially in markets.","zh":"Exuberancy 指充满活力与热情的兴奋状态；也可指（尤其在市场/财经语境中）过度乐观或亢奋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having a lot of lively energy, excitement, and joyful enthusiasm.","zh":"充满活力与兴奋的状态；洋溢的热情与喜悦。"},"examples":[{"en":"Her exuberancy lit up the room as soon as she walked in.","zh":"她一走进来，洋溢的活力就把整个房间都点亮了。"},{"en":"The children’s exuberancy made it hard to keep the class quiet.","zh":"孩子们的兴奋劲儿让课堂很难安静下来。"},{"en":"He spoke with youthful exuberancy about his new plans.","zh":"他带着年轻人的热情谈起自己的新计划。"}]},{"partOfSpeech":"n.","definition":{"en":"An overly confident or inflated feeling, especially in opinions or markets (often used in economics and news).","zh":"（尤用于经济/新闻）过度乐观或膨胀的情绪；非理性的亢奋。"},"examples":[{"en":"Some analysts warned that stock-market exuberancy was pushing prices too high.","zh":"一些分析师警告说，股市的过度乐观正在把价格推得过高。"},{"en":"After the early success, a sense of exuberancy made the team take unnecessary risks.","zh":"早期成功后，一种亢奋情绪让团队冒了不必要的风险。"}]}],"synonyms":["liveliness","enthusiasm","high spirits","excitement","euphoria"],"phonetic":"/ɪɡˈzuːb(ə)rəns/","extraExplanation":["“Exuberancy”来自形容词“exuberant”（充满活力的、热情洋溢的）。在日常语境里多是正面含义；但在财经语境中常带一点“过热/过度”的提醒意味（类似“irrational exuberance 非理性繁荣/非理性亢奋”）。","同义词提示：liveliness（活泼）、enthusiasm（热情）、high spirits（兴致高昂）。偏“过头”的近义说法可用：overexcitement（过度兴奋）、euphoria（陶醉/狂喜）。"]}
{"word":"exuberant","summary":{"en":"Exuberant means very energetic and joyful, or (less commonly) growing in a rich, abundant way.","zh":"exuberant 表示“精力充沛、热情洋溢”，也可指（较少见）“生长繁茂、丰盛”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of energy, excitement, and joyful enthusiasm; lively and expressive.","zh":"充满活力与兴奋的；热情洋溢的；欢快外露的。"},"examples":[{"en":"The children were exuberant after winning the game.","zh":"孩子们赢得比赛后兴奋得不得了。"},{"en":"She gave an exuberant welcome to the guests.","zh":"她热情洋溢地欢迎客人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Growing strongly and in large amounts; rich and abundant (often about plants, hair, or decoration).","zh":"（生长）茂盛的；繁茂的；（数量或装饰）丰盛的。"},"examples":[{"en":"After weeks of rain, the garden looked exuberant and green.","zh":"连续几周下雨后，花园显得郁郁葱葱、一片翠绿。"},{"en":"The villa was surrounded by exuberant tropical plants.","zh":"别墅被茂盛的热带植物环绕。"}]}],"synonyms":["energetic","enthusiastic","ebullient","buoyant","lively","animated"],"phonetic":"/ɪɡˈzuːb(ə)rənt/","extraExplanation":["词源提示：exuberant 来自拉丁语 ex-（向外）+ uber（肥沃、丰饶），原意偏向“（植物）繁茂、丰盛”，后来更常用来形容人的情绪“热情洋溢、兴高采烈”。","语体与搭配：常见搭配有 exuberant personality（外向热情的性格）、exuberant praise（热烈的称赞）、exuberant mood（高涨的情绪）。也可用于较正式写作。","近义词辨析：joyful 更偏“快乐”；enthusiastic 偏“热心投入”；exuberant 强调“热情外放、精力满满”，有“溢出来”的感觉。"]}
{"word":"exuberantly","summary":{"en":"“Exuberantly” means “with lively, joyful energy and enthusiasm.”","zh":"“exuberantly”意为“热情洋溢地、兴高采烈地、充满活力地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very energetic, joyful, and expressive way; with lively enthusiasm.","zh":"以充满活力、喜悦、外向表达的方式；热情洋溢地。"},"examples":[{"en":"The crowd cheered exuberantly when the team won.","zh":"球队获胜时，人群热情洋溢地欢呼。"},{"en":"She spoke exuberantly about her new job.","zh":"她兴致勃勃地谈起她的新工作。"},{"en":"Spring flowers bloomed exuberantly across the park.","zh":"春天的花在公园里蓬勃地盛开。"}]}],"synonyms":["enthusiastically","joyfully","excitedly","animatedly","vibrantly"],"phonetic":"/ɪɡˈzuːbərəntli/","extraExplanation":["“exuberantly”来自形容词“exuberant”（生机勃勃的、热情洋溢的），常用来形容情绪、说话方式、庆祝场面，也可形容自然生长“旺盛”。语气通常偏正面，但在特定语境下也可能暗示“过于兴奋/有点夸张”。","搭配提示：cheer/smile/laugh exuberantly（热情地欢呼/微笑/大笑）；speak/talk exuberantly（兴奋地说）；grow/bloom exuberantly（繁茂地生长/盛开）。","近义词对比：enthusiastically更中性、强调“热情”；excitedly偏“兴奋”；joyfully偏“快乐”；exuberantly则更强调“活力充沛、外放、感染力强”。"]}
{"word":"exuberantness","summary":{"en":"Exuberantness means the state or quality of being exuberant—very lively, energetic, and joyful. In everyday English, “exuberance” is more common.","zh":"Exuberantness 指“兴高采烈、充满活力与热情”的状态或特质；日常英语中更常用 exuberance。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being exuberant; very lively, energetic, and full of joyful excitement","zh":"兴高采烈；充满活力与热情的状态（“exuberant”的名词形式）"},"examples":[{"en":"Her exuberantness made the whole team feel more confident.","zh":"她的兴高采烈让整个团队更有信心。"},{"en":"The child’s exuberantness was obvious when he ran around laughing.","zh":"那个孩子跑来跑去笑个不停，兴奋劲儿一眼就能看出来。"}]}],"synonyms":["exuberance","enthusiasm","high spirits","vivacity","buoyancy"],"phonetic":"/ɪɡˈzuːbərəntnəs/","extraExplanation":["“Exuberantness”可以理解，但在真实英语里比较少见；更常用、更自然的名词是“exuberance”。例如：Her exuberance was contagious.（她的热情很有感染力。）","“Exuberant”常用于描述情绪、性格、气氛，也可用于自然景象（如植物生长旺盛）：exuberant growth（繁茂生长）。"]}
{"word":"exuberate","summary":{"en":"Exuberate means to show lively joy or energy; more rarely, to abound or overflow.","zh":"exuberate 指“洋溢着喜悦与活力”；较少见的用法是指“繁盛、充满、溢出”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to show or feel a lot of lively energy, happiness, or excitement; to be exuberant","zh":"表现出（或感到）充沛的活力、快乐或兴奋；洋溢着热情"},"examples":[{"en":"The children exuberated when they heard they could go to the park.","zh":"孩子们听说可以去公园时兴奋得欢呼雀跃。"},{"en":"She seemed to exuberate with confidence after her first successful performance.","zh":"她第一次成功演出后看起来信心满满、神采飞扬。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) to abound or overflow; to be produced in great quantity","zh":"（罕见）大量存在；充满；溢出"},"examples":[{"en":"In spring, wildflowers exuberate across the hillsides.","zh":"春天里，野花在山坡上大片盛开。"},{"en":"The soil here exuberates with life after the rains.","zh":"这里的土壤在雨后充满生机。"}]}],"synonyms":["rejoice","exult","beam","radiate","overflow","abound"],"phonetic":"/ɪɡˈzuːbəˌreɪt/","extraExplanation":["“exuberate”在现代英语中比较少见，更常用的是形容词“exuberant”（精力充沛的、热情洋溢的）或名词“exuberance”（活力、热情）。","它来自拉丁语词根，带有“溢出、充满”的意象；因此既可指“情绪洋溢”，也可指“数量繁盛”（较文学/书面）。","更自然的替代表达：be thrilled / be overjoyed / burst with joy / overflow with enthusiasm。"]}
{"word":"exuberated","summary":{"en":"“Exuberated” (rare) means showed great excitement or overflowed with energy; it can also mean being abundant or growing vigorously.","zh":"“exuberated”（罕见）指表现出强烈兴奋、精力充沛；也可指大量充溢或繁茂生长。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare) Show or express great energy, excitement, or happiness; act in an exuberant way.","zh":"（罕见）表现出极大的精力、兴奋或快乐；兴高采烈地行动。"},"examples":[{"en":"After hearing the good news, she exuberated in front of her friends.","zh":"听到好消息后，她在朋友面前兴奋得手舞足蹈。"},{"en":"The crowd exuberated as the team scored the winning goal.","zh":"球队踢进制胜球时，人群欢呼雀跃。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare, formal) Be abundant or overflowing; grow or spread vigorously.","zh":"（罕见，正式）大量存在；充溢；（生长/扩展）旺盛。"},"examples":[{"en":"Wildflowers exuberated across the hillside after the spring rains.","zh":"春雨过后，野花在山坡上繁茂盛开。"},{"en":"New ideas exuberated in the studio during the late-night discussion.","zh":"深夜讨论时，工作室里涌现出大量新想法。"}]}],"synonyms":["rejoiced","cheered","celebrated","beamed","overflowed","abounded"],"phonetic":"/ɪɡˈzuːbəˌreɪtɪd/","extraExplanation":["“exuberated”是动词“exuberate”的过去式/过去分词，但在现代英语里非常少见。日常表达更常用：\n- “was/were exuberant”（很兴奋/很有活力）\n- “burst with excitement/joy”（兴奋得要炸开）\n- “celebrated loudly/cheered”（大声庆祝/欢呼）","词源上与拉丁语中表示“充满、丰盛”的含义有关，所以它既可指人的情绪外放，也可指事物“繁茂/充溢”。"]}
{"word":"exuberating","summary":{"en":"“Exuberating” means actively showing great joy or energy; it’s a less common form of the verb “exuberate.”","zh":"“exuberating”表示正兴高采烈地表现出强烈的喜悦或活力；它是较少见的动词“exuberate”的现在分词。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"showing or expressing great joy, energy, or enthusiasm; behaving in an exuberant way (present participle of “exuberate”).","zh":"表现出（或流露出）极大的喜悦、活力或热情；兴高采烈地表现（为动词 exuberate 的现在分词）。"},"examples":[{"en":"The kids came exuberating out of the classroom, talking all at once.","zh":"孩子们兴高采烈地冲出教室，七嘴八舌地说个不停。"},{"en":"She was exuberating with pride after finishing her first marathon.","zh":"完成第一次马拉松后，她兴奋得充满自豪感。"}]}],"synonyms":["beaming","bubbling over","radiating","brimming (with excitement)","overjoyed"],"phonetic":"/ɪɡˈzuːbəˌreɪtɪŋ/","extraExplanation":["“exuberating”来自较少见的动词 exuberate，日常英语里更常用形容词 “exuberant” 或名词 “exuberance”。例如：an exuberant crowd（热情高涨的人群）、with exuberance（充满活力/热情地）。","词根相关：exuberant 原义与“生长旺盛、繁茂”有关，因此也常用来形容“精力充沛、情绪饱满”。文学或新闻写作中可能用 exuberating 来营造更生动的动态画面，但口语中用得不多。"]}
{"word":"exuberation","summary":{"en":"Exuberation means joyful, overflowing excitement, and can also mean rich, vigorous abundance (especially in growth or creativity).","zh":"Exuberation 指热情洋溢的兴奋与喜悦；也可指（生长或创作等）繁茂旺盛、充沛有力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lively, joyful excitement; a feeling of overflowing energy or happiness.","zh":"热情洋溢；兴高采烈；充满活力与喜悦的情绪。"},"examples":[{"en":"Her exuberation was obvious when she heard she got the job.","zh":"她听到自己被录用时，兴奋之情溢于言表。"},{"en":"The crowd cheered with exuberation after the winning goal.","zh":"进球获胜后，人群兴奋地欢呼。"},{"en":"He spoke with youthful exuberation, even about small things.","zh":"他谈起小事也充满年轻人的热情与活力。"}]},{"partOfSpeech":"n.","definition":{"en":"A quality of being abundant and vigorous (often used about plants, growth, or creative output).","zh":"（多指植物、生长或创作）繁茂旺盛；充沛而有力。"},"examples":[{"en":"The garden’s exuberation after the spring rains amazed everyone.","zh":"春雨过后花园的繁茂旺盛让大家惊叹。"},{"en":"Her early poems show an exuberation of imagery.","zh":"她早期的诗歌展现出意象的充沛奔涌。"}]}],"synonyms":["excitement","joy","enthusiasm","elation","exuberance"],"phonetic":"/ɪɡˌzuːbəˈreɪʃən/","extraExplanation":["“exuberation”常用于较书面或文学语境，日常口语里更常说“excitement”“joy”“enthusiasm”。","词根来自拉丁语，含有“过于丰盛、溢出”的感觉，所以既可形容情绪的“洋溢”，也可形容生长或创造力的“旺盛”。","常见搭配：with exuberation（兴奋地）；a sense of exuberation（兴奋感）；youthful exuberation（年轻人的朝气）。"]}
{"word":"exuccous","summary":{"en":"Exsuccous means “not juicy; lacking sap or moisture,” a rare term often used in botany.","zh":"Exsuccous 指“无汁/不多汁、缺乏汁液或水分”，是常见于植物学的罕见词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having little or no juice or sap; not juicy (often used in botany).","zh":"（罕见/术语）汁液很少或没有的；不多汁的（常用于植物学）。"},"examples":[{"en":"The botanist described the plant’s fruit as exsuccous rather than fleshy.","zh":"植物学家描述这种植物的果实是“无汁的”，而不是“肉质多汁的”。"},{"en":"After drying, the berries become hard and almost exsuccous.","zh":"晒干后，这些浆果变硬，几乎变得无汁。"}]}],"synonyms":["dry","nonjuicy","sapless","arid"],"phonetic":"/ɛkˈsʌkəs/","extraExplanation":["你输入的 **exuccous** 很可能是拼写误差，标准拼写通常是 **exsuccous**（有时也见作 *exsuccose*）。这个词非常少见，多出现在植物学或古旧文献里，用来和 *succulent*（多汁的）或 *fleshy*（肉质的）形成对比。"]}
{"word":"exucontian","summary":{"en":"Execution most commonly means carrying out a plan or task; it can also mean a legal execution (putting someone to death) or enforcing a court judgment.","zh":"Execution 最常见意思是“执行/实施”；也可指“处决（死刑执行）”，或“对判决的强制执行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) the act of carrying out a plan, order, or piece of work; the way something is performed.","zh":"（可能是你想拼的词）执行；实施；（做事的）方式与表现。"},"examples":[{"en":"The team focused on execution, not just planning.","zh":"团队专注于执行，而不仅仅是计划。"},{"en":"Her execution of the song was calm and precise.","zh":"她对这首歌的演绎很沉稳、很精准。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law) the act of putting someone to death as a punishment, usually by the state.","zh":"（法律）处决；死刑执行（通常由国家实施）。"},"examples":[{"en":"Many countries have banned the execution of prisoners.","zh":"许多国家已禁止处决囚犯。"},{"en":"The film discusses the ethics of capital punishment and execution.","zh":"这部电影讨论了死刑与处决的伦理问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(Business/Law) a legal process that enforces a court judgment, such as taking property to pay a debt.","zh":"（商法/法律）强制执行（如扣押财产以偿还债务）。"},"examples":[{"en":"The creditor applied for execution of the judgment.","zh":"债权人申请对判决进行强制执行。"}]}],"synonyms":["implementation","carryout","enforcement","performance","accomplishment"],"phonetic":"/ˌɛksɪˈkjuːʃən/","extraExplanation":["你输入的“exucontian”不是常见英文单词，最接近的常用词很可能是 execution（执行/处决）。如果你原本想查的是 exultation（欢欣；雀跃）或 exudation（渗出），告诉我正确拼写/语境，我可以给你对应词条。"]}
{"word":"exudate","summary":{"en":"Exudate is fluid or material that oozes out, especially from inflamed tissue (medical) or from plants (botany).","zh":"Exudate 指“渗出（液/物）”，常见于医学上的炎症组织渗出液，也可指植物渗出的汁液、树脂等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fluid (often containing proteins, immune cells, or bacteria) that leaks out of blood vessels into nearby tissue, usually because of inflammation or infection.","zh":"渗出液：因发炎或感染等导致血管通透性增加，从血管渗出到周围组织的液体，常含蛋白质、免疫细胞或细菌。"},"examples":[{"en":"The doctor noted purulent exudate from the wound, suggesting an infection.","zh":"医生观察到伤口有脓性渗出液，提示可能感染。"},{"en":"In pneumonia, exudate can fill the air sacs and make breathing difficult.","zh":"在肺炎中，渗出液可能充满肺泡，使呼吸困难。"},{"en":"The nurse cleaned the exudate and changed the dressing.","zh":"护士清理渗出液并更换敷料。"}]},{"partOfSpeech":"n.","definition":{"en":"In botany, a substance (such as sap, resin, or gum) that oozes out from a plant.","zh":"（植物学）渗出物：从植物组织渗出的物质，如汁液、树脂或胶质等。"},"examples":[{"en":"Some trees produce a sticky exudate to seal damaged bark.","zh":"有些树会分泌黏性的渗出物来封住受损的树皮。"},{"en":"The leaf exudate can attract helpful insects.","zh":"叶片的渗出物可能会吸引有益昆虫。"}]}],"synonyms":["discharge","secretion","ooze","fluid","drainage"],"phonetic":"/ˈɛksjəˌdeɪt/","extraExplanation":["医学里常把 exudate（渗出液）与 transudate（漏出液）对比：exudate 多见于“炎症/感染”，通常蛋白含量较高；transudate 多与“压力或蛋白不足”等非炎症原因有关（如心衰导致的积液），蛋白含量相对较低。","词源提示：ex-（向外）+ udare（拉丁语“变湿/浸湿”相关），帮助记忆“向外渗出”的感觉。"]}
{"word":"exudates","summary":{"en":"Exudates are substances that seep out of tissues or blood vessels (often due to inflammation), or chemicals released by plant roots into soil.","zh":"Exudates指（多因炎症）从组织/血管渗出的液体或脓等渗出物；也可指植物根部分泌到土壤中的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fluid, pus, or other material that leaks out of blood vessels into nearby tissues, usually because of inflammation or injury.","zh":"（多因炎症或损伤导致）从血管渗出到周围组织中的液体、脓或其他物质（渗出物）。"},"examples":[{"en":"The doctor noted thick exudates on the patient’s tonsils.","zh":"医生发现患者的扁桃体上有较厚的渗出物。"},{"en":"Infected wounds may produce yellow exudates.","zh":"感染的伤口可能会产生黄色渗出物。"},{"en":"The lab analyzed the exudates to identify the bacteria.","zh":"实验室分析渗出物以确定细菌种类。"}]},{"partOfSpeech":"n.","definition":{"en":"Substances released by plants (especially roots) into the soil, such as sugars and organic acids, which can affect microbes and nutrient uptake.","zh":"植物（尤其是根部）释放到土壤中的物质，如糖类和有机酸，会影响微生物与养分吸收（根系分泌物/渗出物）。"},"examples":[{"en":"Root exudates can attract beneficial microbes.","zh":"根系渗出物可以吸引有益微生物。"},{"en":"Scientists studied exudates from corn roots to understand soil health.","zh":"科学家研究玉米根部的渗出物以了解土壤健康。"}]}],"synonyms":["secretions","discharge","ooze","fluid","pus"],"phonetic":"/ˈɛksjəˌdeɪts/","extraExplanation":["“exudates”是复数形式；单数是“exudate”。在医学语境里常用来描述炎症部位的“渗出物”，例如扁桃体炎时的白色或黄色覆盖物（tonsillar exudate）。","词源上来自拉丁语，含义与“渗出/流出”有关。相关词：exude（v. 渗出、散发），exudation（n. 渗出）。","医学上常与“transudate（漏出液）”对比：exudate通常蛋白含量更高、与炎症相关；transudate多与压力改变（如心衰）相关。初学者可先记：exudate≈炎症渗出物。"]}
{"word":"exudation","summary":{"en":"Exudation is the process of fluid slowly oozing out, or the fluid itself (often in medical/biology contexts).","zh":"exudation 指液体缓慢渗出的过程，也可指渗出物本身（多用于医学/生物学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of slowly seeping, oozing, or being given off (especially fluid from living tissue or a surface).","zh":"（尤指液体从组织或表面）缓慢渗出、溢出、分泌的过程。"},"examples":[{"en":"After the injury, there was a small amount of exudation from the wound.","zh":"受伤后，伤口有少量渗出液。"},{"en":"The doctor cleaned the area and monitored the exudation for signs of infection.","zh":"医生清洁了该区域，并观察渗出情况以判断是否感染。"}]},{"partOfSpeech":"n.","definition":{"en":"The fluid that seeps out, especially in medicine (often called “exudate”).","zh":"渗出的液体；（医学）渗出液（也常称 exudate）。"},"examples":[{"en":"The nurse noted thick, yellow exudation on the bandage.","zh":"护士记录到绷带上有浓稠的黄色渗出物。"},{"en":"In plant diseases, exudation can appear as sticky sap on the stem.","zh":"在植物病害中，渗出物可能表现为茎上黏稠的汁液。"}]}],"synonyms":["oozing","seepage","discharge","leakage","exudate"],"phonetic":"/ˌɛɡzjuˈdeɪʃən/","extraExplanation":["词源与构词：exudation 来自拉丁语前缀 ex-（“向外”）+ sudare（“出汗”），字面含义接近“向外出汗”。因此它常用于医学或生物学语境，强调液体从组织“渗出来”。","易混词提示：exudation / exudate（渗出）通常与炎症有关，液体蛋白含量较高；而 transudation / transudate（漏出）多与血管压力变化有关，蛋白较低。这是医学上常见的区分。","用法提示：日常英语更常说 discharge（分泌物/流出物）或 fluid leaking/oozing（液体渗出）；exudation 更偏正式、学术或医疗记录。"]}
{"word":"exudations","summary":{"en":"Exudations are substances or fluids that ooze out slowly, especially from wounds or inflamed tissue.","zh":"Exudations 指从伤口或发炎组织等处慢慢渗出的液体或渗出物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) the slow release of fluid, sap, pus, or other material from tissue, a wound, or a surface; these released substances.","zh":"（复数）渗出物；指液体、树液、脓等从组织、伤口或表面慢慢渗出的物质（或渗出的现象）。"},"examples":[{"en":"The nurse cleaned the wound and noted thick yellow exudations on the bandage.","zh":"护士清理了伤口，并注意到绷带上有浓稠的黄色渗出物。"},{"en":"After the storm, sticky exudations of sap appeared on the tree bark.","zh":"暴风雨过后，树皮上出现了黏黏的树液渗出物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medical/biology) abnormal fluid that leaks from blood vessels into nearby tissue, often linked to inflammation or infection.","zh":"（医学/生物）渗出液；指因炎症或感染等原因，血管内液体异常渗漏到周围组织中的液体。"},"examples":[{"en":"The doctor tested the exudations to check for bacterial infection.","zh":"医生检测渗出液，以判断是否存在细菌感染。"},{"en":"Inflammation can cause exudations that make the area swollen and warm.","zh":"炎症会导致渗出液，使局部肿胀并发热。"}]}],"synonyms":["exudates","oozing","discharge","seepage"],"phonetic":"/ˌɛks.juˈdeɪ.ʃənz/","extraExplanation":["“Exudations”是“exudation”的复数。更常见的可数说法是“exudate(s)”（渗出物/渗出液），尤其在医学语境中。","词源来自拉丁语 exudare（ex- “向外” + sudare “出汗”），字面意思接近“向外出汗”，所以常用来形容液体从内部慢慢“渗出来”。"]}
{"word":"exudative","summary":{"en":"Exudative describes fluid leaking out of tissue or vessels—usually due to inflammation—and medical conditions involving protein- and cell-rich fluid.","zh":"exudative 指“渗出性的”，常因炎症等导致组织或血管渗出液体；在医学上也指蛋白和细胞含量较高的渗出液相关情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing or relating to an outflow of fluid (exudate) from blood vessels or tissue, especially because of inflammation or injury.","zh":"渗出性的；（尤指因炎症或损伤）与液体从血管或组织渗出有关的。"},"examples":[{"en":"The doctor said the wound had an exudative discharge, so it needed careful cleaning.","zh":"医生说伤口有渗出性分泌物，所以需要仔细清洁。"},{"en":"Exudative inflammation often causes swelling and fluid build-up in the affected area.","zh":"渗出性炎症常会导致患处肿胀并出现液体积聚。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In medical descriptions) Having fluid rich in protein and cells, as in exudative pleural effusion.","zh":"（医学）渗出液型的；（如渗出性胸腔积液）液体常含较多蛋白质和细胞。"},"examples":[{"en":"Tests suggested an exudative pleural effusion rather than a transudative one.","zh":"检查提示是渗出性胸腔积液，而不是漏出性胸腔积液。"},{"en":"An exudative process is more likely when there is infection or cancer.","zh":"当存在感染或肿瘤时，更可能出现渗出性过程。"}]}],"synonyms":["oozing","seeping","discharging","inflammatory (context-dependent)"],"phonetic":"/ˈɛks.jəˌdeɪ.tɪv/","extraExplanation":["词源提示：exudative 来自拉丁语前缀 ex-（向外）+ sudare（出汗），字面意思像“往外冒汗”，因此常用来形容组织“渗出”液体的状态。","学习对比：transudative（漏出性的）多与压力/蛋白水平变化有关；exudative（渗出性的）多与炎症、感染、肿瘤等导致血管通透性增加有关。临床上常用这对词来区分积液类型。"]}
{"word":"exudatory","summary":{"en":"Exudatory means “producing inflammatory fluid (exudate),” used mainly in medical contexts.","zh":"exudatory 指“渗出性的（产生渗出液，常与炎症相关）”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing or relating to an exudate (fluid such as pus, serum, or mucus that leaks out of blood vessels into nearby tissues, usually because of inflammation or injury).","zh":"渗出性的；与“渗出液”有关的（渗出液指因炎症或损伤导致血管中的液体如脓、血清或黏液渗入周围组织）。"},"examples":[{"en":"The doctor noted an exudatory wound with thick yellow drainage.","zh":"医生记录这是一个渗出性的伤口，有浓稠的黄色渗液。"},{"en":"Exudatory pleural effusion is often linked to infection or inflammation.","zh":"渗出性胸腔积液通常与感染或炎症有关。"},{"en":"The nurse changed the dressing because the ulcer was exudatory.","zh":"护士因为溃疡渗出明显而更换了敷料。"}]}],"synonyms":["oozing","seeping","suppurative (in some contexts)","purulent (when pus is present)"],"phonetic":"/ˌɛɡˈzuːdəˌtɔri/","extraExplanation":["“exudatory”常见于医学语境（伤口护理、皮肤科、呼吸科等）。它强调“因炎症/损伤导致液体渗出”，与“transudative（漏出性的）”常作对比：transudative多与全身性因素（如心衰、低蛋白）相关，液体相对清亮；exudatory多与局部炎症/感染相关，蛋白和细胞含量较高。","词根提示：exude（渗出）+ -atory（……的），看到 exud- 往往联想到“渗出、渗流”。"]}
{"word":"exude","summary":{"en":"Exude means to strongly show a quality or to slowly give off/release something like a smell or liquid.","zh":"exude 表示“强烈流露某种气质/情感”，也可指“缓慢散发或渗出气味、液体等”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To show or express a quality or feeling strongly, often in a way others can sense.","zh":"（强烈地）散发出、流露出（某种品质或情感），让他人明显感受到。"},"examples":[{"en":"She exuded confidence during the interview.","zh":"她在面试中流露出十足的自信。"},{"en":"The room exuded warmth and calm.","zh":"这个房间给人一种温暖而平静的感觉。"}]},{"partOfSpeech":"vt.","definition":{"en":"To slowly send out or release something (such as a smell, liquid, or gas).","zh":"（缓慢地）渗出、释放（气味、液体或气体等）。"},"examples":[{"en":"The flower exuded a sweet smell.","zh":"这朵花散发出甜甜的香味。"},{"en":"Pine trees can exude sticky sap.","zh":"松树会渗出黏黏的树脂。"}]}],"synonyms":["radiate","emit","give off","ooze","secrete"],"phonetic":"/ɪɡˈzuːd/","extraExplanation":["“exude”常用于较正式的语境，尤其是描述人的“气质/氛围”（exude confidence/charm/authority）。日常口语里也可用“give off”“radiate”表达类似意思，但“exude”更有“自然流露、难以掩饰”的感觉。","词源来自拉丁语，核心意象是“渗出来”（像液体从里面慢慢流出），所以既可指“物理的渗出/散发”，也可引申为“情感与气场的流露”。"]}
{"word":"exuded","summary":{"en":"Exuded means “gave off or released,” either literally (liquid/smell) or figuratively (a feeling or quality).","zh":"exuded 表示“散发、渗出”，既可指液体/气味等的缓慢释放，也可比喻“流露出”某种气质或情绪。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of exude) to release or let out a liquid, smell, gas, etc., often slowly or in small amounts.","zh":"（exude 的过去式/过去分词）指（液体、气味、气体等）缓慢地或少量地渗出、散发出来。"},"examples":[{"en":"Sap exuded from the cut branch.","zh":"树枝被割开后，树液渗了出来。"},{"en":"A strong smell exuded from the old refrigerator.","zh":"旧冰箱里散发出一股强烈的气味。"},{"en":"After the rain, water exuded from the ground.","zh":"下雨后，水从地里慢慢渗出来。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to show or give off a quality or feeling strongly, as if it spreads from a person or place.","zh":"（比喻）指强烈地流露出某种气质或情绪，仿佛从人或环境中“散发”出来。"},"examples":[{"en":"She exuded confidence during the interview.","zh":"她在面试中流露出自信。"},{"en":"The café exuded a warm, welcoming atmosphere.","zh":"那家咖啡馆散发着温暖、好客的氛围。"}]}],"synonyms":["gave off","emitted","released","oozed","seeped","radiated"],"phonetic":"/ɪɡˈzuːd/","extraExplanation":["“exude”既可用于具体的“渗出/分泌”（常见于生物、植物、材料表面），也常用于抽象意义的“散发（气质、氛围）”。","搭配提示：exude confidence/calm/charm（散发自信/冷静/魅力）；exude from…（从……渗出/散发）。"]}
{"word":"exudence","summary":{"en":"Exudence is a rare noun meaning the process of oozing out or the substance that oozes out.","zh":"Exudence 是一个较少见的名词，指“渗出/流出”的过程，或“渗出物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the act or process of oozing or flowing out (for example, liquid seeping from a surface).","zh":"（少见）渗出、流出（例如液体从表面慢慢渗出来）的过程或现象。"},"examples":[{"en":"After the cut, there was a slow exudence of clear fluid from the wound.","zh":"伤口划开后，有清澈液体缓慢渗出。"},{"en":"The report noted exudence from the plant stem after it was damaged.","zh":"报告指出植物茎受损后出现渗出。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) something that oozes out; an exuded fluid or substance.","zh":"（少见）渗出物；渗出的液体或物质。"},"examples":[{"en":"The nurse cleaned the exudence and changed the bandage.","zh":"护士清理了渗出物并更换了绷带。"},{"en":"Sticky exudence on the bark attracted insects.","zh":"树皮上黏性的渗出物吸引了昆虫。"}]}],"synonyms":["exudation","oozing","seepage","discharge","exudate"],"phonetic":"/ɪɡˈzuːdəns/","extraExplanation":["“exudence”在现代英语中非常少用，更常见的相关词是：\n- “exudation”（n. 渗出；渗出作用）\n- “exudate”（n. 渗出液/渗出物，医学语境常用）\n- 动词 “exude”（v. 渗出；散发）\n在医学或生物学写作里，通常会用“exudate/exudation”来表达更标准、更自然。"]}
{"word":"exudes","summary":{"en":"“Exudes” means “shows a strong quality” or “gives off something like a smell.”","zh":"“exudes”表示“强烈地流露某种气质/感觉”，也可表示“散发（气味等）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to show or give off a feeling or quality strongly and naturally","zh":"强烈而自然地流露（某种感觉或气质）"},"examples":[{"en":"She exudes confidence during interviews.","zh":"她在面试时流露出自信。"},{"en":"The cafe exudes a warm, welcoming vibe.","zh":"这家咖啡馆散发出温暖、好客的氛围。"}]},{"partOfSpeech":"v.","definition":{"en":"to give off or release something (such as a smell, liquid, or heat)","zh":"散发；释放（气味、液体、热量等）"},"examples":[{"en":"The flowers exude a sweet scent.","zh":"花朵散发出甜美的香气。"},{"en":"Fresh paint can exude a strong odor.","zh":"新刷的油漆可能会散发出刺鼻的气味。"}]}],"synonyms":["radiates","gives off","emanates","oozes"],"phonetic":"/ɪɡˈzudz/","extraExplanation":["“exudes”是动词“exude”的第三人称单数（he/she/it exudes）。写作中常用来描述“气质/氛围”的自然流露，比“show”更有“由内而外、让人感受到”的味道。","常见搭配：exude confidence/charm/elegance（流露自信/魅力/优雅）；exude warmth（散发温暖）；exude a smell/scent（散发气味）。"]}
{"word":"exuding","summary":{"en":"“Exuding” means gradually giving off something (a smell, liquid, heat, or a feeling), or clearly showing a quality like confidence or warmth.","zh":"“exuding”表示逐渐散发/渗出某物（气味、液体、热等），也可指明显地流露某种特质（如自信、温暖）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of exude) giving off or releasing something gradually (like a smell, liquid, heat, or an emotion).","zh":"（exude 的现在分词）逐渐散发或渗出某物（如气味、液体、热量或情绪）。"},"examples":[{"en":"The flowers were exuding a sweet scent.","zh":"花朵散发着甜美的香气。"},{"en":"The wound was exuding a small amount of fluid.","zh":"伤口渗出少量液体。"},{"en":"She spoke calmly, exuding confidence.","zh":"她语气平静，流露出自信。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing a strong quality in an obvious, natural way (often used before a noun).","zh":"（常作定语）明显而自然地散发某种特质。"},"examples":[{"en":"He greeted everyone with an exuding warmth that made people relax.","zh":"他以一种自然流露的温暖问候大家，让人放松。"},{"en":"The actor’s exuding charm won over the audience.","zh":"这位演员流露出的魅力征服了观众。"}]}],"synonyms":["giving off","emitting","oozing","seeping","radiating","projecting"],"phonetic":"/ɪɡˈzuːdɪŋ/","extraExplanation":["“exude”来自拉丁语 exudare，字面意思是“向外出汗/渗出”。所以它既能形容“液体渗出”，也常用于比喻“气质、情绪、态度自然流露”。","常见搭配：exuding confidence/charisma/warmth（流露自信/魅力/温暖）；exuding a smell/fragrance（散发气味/香味）。","语体上，“exuding + 抽象名词（confidence, calm, authority）”常见于描写人物气质的写作，也常出现在文学/影评/人物介绍中。"]}
{"word":"exul","summary":{"en":"Exul is a rare literary word meaning “an exile,” a person banished from their home or country.","zh":"exul 是一个罕见的文学用词，意思是“流亡者/被放逐的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, literary) A person who has been forced to leave their country or home; an exile.","zh":"（罕见，文学用语）被迫离开祖国或家园的人；流亡者。"},"examples":[{"en":"He wandered Europe as an exul, unable to return home after the war.","zh":"战后他作为流亡者在欧洲漂泊，无法回国。"},{"en":"The poem speaks in the voice of an exul longing for familiar streets.","zh":"这首诗以流亡者的口吻诉说对熟悉街巷的渴望。"}]}],"synonyms":["exile","banished person","expatriate","outcast"],"phonetic":"/ˈɛk.suːl/","extraExplanation":["“exul”源自拉丁语，字面意思就是“流亡者/被放逐的人”。在现代英语中非常少见，多见于古典学、历史写作或带有拉丁色彩的文学表达，用来营造庄重、古典或悲剧性的语气。","与常用词“exile”相比，“exul”更像一个学术/文学用的标签；写普通英语文章时一般用“exile”。"]}
{"word":"exulate","summary":{"en":"Exulate is a rare verb meaning to live in exile or to exile/banish someone.","zh":"exulate 是一个很少用的动词，意思是“流亡（居住在放逐中）”或“放逐/驱逐某人”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Rare) To live in exile; to be an exile.","zh":"（罕见）流亡；被放逐而居住在异乡。"},"examples":[{"en":"After the coup, the former minister exulated in a neighboring country for years.","zh":"政变后，那位前部长在邻国流亡了多年。"},{"en":"Many writers have exulated far from home and still written in their native language.","zh":"许多作家远离故土流亡，却仍用母语写作。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To exile; to banish someone from their country or home.","zh":"（罕见）放逐；把某人驱逐出国或离开家园。"},"examples":[{"en":"The king threatened to exulate anyone who questioned his rule.","zh":"国王威胁要放逐任何质疑他统治的人。"},{"en":"In older texts, rulers sometimes exulated political rivals.","zh":"在较早的文本中，统治者有时会放逐政治对手。"}]}],"synonyms":["exile","banish","expatriate","deport"],"phonetic":"/ˈɛɡzəˌleɪt/","extraExplanation":["“exulate”在现代英语中非常少见，更多会用更常见的词：exile（放逐/流亡）、banish（驱逐）。","它很容易与更常见的“exult /ɪɡˈzʌlt/”（欢欣鼓舞）混淆；两者拼写和发音相近，但意思完全不同。","词源上与拉丁语“exul”（流亡者）有关，因此语义与“流亡/放逐”相关。"]}
{"word":"exulcerate","summary":{"en":"A rare medical verb meaning “to ulcerate badly; to cause deep ulcers.”","zh":"一个罕见的医学动词，意思是“使严重溃烂；使形成深部溃疡”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Medical) To cause a deep ulcer or sore to form; to ulcerate severely.","zh":"（医学）使形成深部溃疡；使严重溃烂。"},"examples":[{"en":"The infection can exulcerate the skin if it is not treated promptly.","zh":"如果不及时治疗，感染可能会使皮肤严重溃烂。"},{"en":"Doctors warned that constant friction might exulcerate the wound.","zh":"医生警告说，持续摩擦可能会使伤口溃烂加重。"}]}],"synonyms":["ulcerate","cause ulcers","erode","fester"],"phonetic":" /ɪɡˈzʌl.sə.reɪt/","extraExplanation":["这是一个非常少见、偏医学/书面语的动词，日常英语里更常用 ulcerate（溃疡化/溃烂）或 cause an ulcer（导致溃疡）。","词形上可拆为 ex-（加强语气，表示“使更……/向外”）+ ulcer（溃疡）+ -ate（动词后缀），整体强调“形成/加重溃疡”。"]}
{"word":"exulcerated","summary":{"en":"Exulcerated means “ulcerated” or “broken into open sores,” mainly used in medical contexts; it can also be the past form of exulcerate.","zh":"exulcerated 指“溃疡的、破溃成创面”的（多用于医学语境）；也可作动词 exulcerate 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having ulcers; broken open into raw, sore areas (especially on skin or a mucous membrane).","zh":"（医学）溃疡的；表面破溃成溃疡、创面（尤指皮肤或黏膜）。"},"examples":[{"en":"The doctor noted an exulcerated lesion on the patient’s tongue.","zh":"医生记录到患者舌头上有一处破溃成溃疡的病灶。"},{"en":"After weeks of irritation, the skin became exulcerated and painful.","zh":"经过数周刺激后，皮肤出现破溃溃疡并伴有疼痛。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of exulcerate: to become ulcerated or to cause something to ulcerate.","zh":"exulcerate 的过去式/过去分词：发生溃疡；使（组织等）溃疡、破溃。"},"examples":[{"en":"The tissue had exulcerated due to chronic infection.","zh":"由于慢性感染，该组织已经发生溃疡破溃。"},{"en":"Repeated friction exulcerated the lining of the mouth.","zh":"反复摩擦使口腔黏膜破溃溃疡。"}]}],"synonyms":["ulcerated","eroded","raw","sore","broken (skin)"],"phonetic":"/ɪɡˈzʌl.səˌreɪ.tɪd/","extraExplanation":["“exulcerated”属于较少见、偏医学/病理学的词。日常英语里更常用“ulcerated”（溃疡的）或用更通俗的表达如“open sore / raw and broken skin（开放性溃疡/破皮的疼痛部位）”。","词形上可理解为 ex-（加强/使…成为）+ ulcer（溃疡）。在病历、研究论文或病理描述中更可能见到。"]}
{"word":"exulcerating","summary":{"en":"Exulcerating is a rare medical word meaning “ulcerating” (becoming or causing tissue to become ulcerated).","zh":"exulcerating 是较罕见的医学用语，意思是“正在溃疡化/使溃疡化”，相当于更常见的 ulcerating。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical, rare) Becoming ulcerated; forming open sores or ulcers on tissue or skin.","zh":"（医学用语，较罕见）正在溃疡化；组织或皮肤形成溃疡、破溃。"},"examples":[{"en":"The doctor noted an exulcerating lesion on the patient’s leg.","zh":"医生记录到病人腿部有一个正在溃疡化的病灶。"},{"en":"If the wound is exulcerating, it needs careful cleaning and medical attention.","zh":"如果伤口正在溃疡化，就需要仔细清洁并就医处理。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of exulcerate: to cause tissue to ulcerate; to make a sore become an ulcer (medical, rare).","zh":"exulcerate 的现在分词：使组织溃疡化；使创口/病灶破溃成溃疡（医学用语，较罕见）。"},"examples":[{"en":"The infection was exulcerating the surrounding skin.","zh":"感染正在使周围皮肤溃疡化。"},{"en":"Harsh chemicals can irritate tissue, sometimes exulcerating fragile areas.","zh":"强刺激性化学物质会刺激组织，有时会使脆弱部位溃疡化。"}]}],"synonyms":["ulcerating","eroding","breaking open","suppurating"],"phonetic":"/ɛkˈsʌlsəˌreɪtɪŋ/","extraExplanation":["“exulcerating”在现代英语里非常少见，多见于较旧的医学写作；日常更常用的是“ulcerating / ulcerated”。","词源上可理解为 ex-（强调“变成/发展成某状态”）+ ulcerate（溃疡化）。在阅读医学材料时看到它，通常可直接按“正在溃疡化/破溃”来理解。"]}
{"word":"exulceration","summary":{"en":"Exulceration is a medical term meaning the formation of an ulcer (an open sore).","zh":"exulceration 是医学用语，指“溃疡形成/发生溃疡（开放性溃烂）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation of an ulcer; the process of becoming ulcerated (developing an open sore)","zh":"溃疡形成；发生溃疡的过程（组织变成开放性溃烂）"},"examples":[{"en":"The report described exulceration of the stomach lining.","zh":"报告描述了胃黏膜的溃疡形成。"},{"en":"Severe inflammation can lead to exulceration if untreated.","zh":"严重炎症若不治疗，可能会导致溃疡形成。"}]}],"synonyms":["ulceration","ulcer formation"],"phonetic":"/ɛkˌsʌl.səˈreɪ.ʃən/","extraExplanation":["这是一个较少见、偏医学/病理学用语。更常见的表达是“ulceration（溃疡形成）”。前缀 ex- 在这里可理解为“向外、变成……的状态”的感觉，但实际使用中你更可能在医学文献里看到 ulceration。","词形提示：exulceration → exulcerate（动词，较少见）→ exulcerated（形容词/过去分词，表示“已溃疡的”）。"]}
{"word":"exulcerative","summary":{"en":"Exulcerative is a medical adjective meaning ‘causing ulceration’ or ‘ulcer-producing.’","zh":"exulcerative 是医学形容词，表示“引起溃疡形成的/致溃疡的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) causing or tending to cause ulceration (the forming of ulcers); ulcer-producing.","zh":"（医学）引起或倾向引起溃疡（形成溃疡）的；致溃疡的。"},"examples":[{"en":"Some infections can be exulcerative, leading to sores on the skin or mucosa.","zh":"某些感染可能具有致溃疡性，导致皮肤或黏膜出现溃疡。"},{"en":"The doctor described the lesion as exulcerative and recommended further tests.","zh":"医生将该病灶描述为致溃疡性的，并建议做进一步检查。"}]}],"synonyms":["ulcerative","ulcerating","ulcer-producing","erosive"],"phonetic":"/ɪɡˈzʌlsəˌreɪtɪv/","extraExplanation":["这是一个相对少见、偏医学写作的词，常用于病理/皮肤科/口腔科等语境，描述病变或炎症“会导致溃疡形成”。日常英语里更常见的表达是“ulcerating / ulcerative（溃疡性的）”。","词形来源可理解为 ex-（向外、使…发生）+ ulcer（溃疡）+ -ative（形容词后缀），强调“促成溃疡形成”的性质。"]}
{"word":"exulceratory","summary":{"en":"Exulceratory means “causing ulceration,” used mostly in medical contexts.","zh":"exulceratory 指“引起溃疡的”，主要用于医学语境，且较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, rare) Causing ulcers or making tissue become ulcerated.","zh":"（医学，较少用）引起溃疡的；使组织发生溃疡的。"},"examples":[{"en":"Some chemicals are exulceratory and can damage the skin if not handled properly.","zh":"某些化学物质具有引起溃疡的作用，如不当处理可能损伤皮肤。"},{"en":"The doctor warned that repeated irritation may have an exulceratory effect on the lining of the stomach.","zh":"医生警告说，反复刺激可能对胃黏膜产生致溃疡的影响。"}]}],"synonyms":["ulcerogenic","ulcerative","corrosive (context-dependent)"],"phonetic":"/ˌɛkˌsʌl.səˈreɪ.tə.ri/","extraExplanation":["这个词非常少见，多用于较旧或较专业的医学/药理学语境。现代写作里更常见的是 ulcerogenic（致溃疡的）或 ulcerative（溃疡性的/引起溃疡的）。","词形上可拆为 ex-（向外/加剧）+ ulcer（溃疡）+ -atory（表示“有……作用的”形容词后缀），整体意思就是“会造成溃疡的”。"]}
{"word":"exulding","summary":{"en":"“Excluding” means “not including; except for,” and it’s also the -ing form of “exclude.”","zh":"“excluding”表示“不包括；除……之外”，也可作“exclude”的现在分词。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"not including; except for","zh":"不包括；除……之外"},"examples":[{"en":"Everyone can join, excluding children under 12.","zh":"所有人都可以参加，但不包括12岁以下的儿童。"},{"en":"The price is $50, excluding tax.","zh":"价格是50美元，不含税。"}]},{"partOfSpeech":"v.","definition":{"en":"the -ing form of “exclude”: to keep someone or something out; to leave out","zh":"“exclude”的现在分词：排除；把……拒之门外；不把……算在内"},"examples":[{"en":"They are excluding outside food from the event.","zh":"他们不允许把外面的食物带入活动现场。"},{"en":"The report is excluding data from last year.","zh":"这份报告没有把去年的数据算进去。"}]}],"synonyms":["except (for)","not including","leaving out","excluding (as a participle of exclude)"],"phonetic":"/ɪkˈskludɪŋ/","extraExplanation":["你输入的“exulding”很可能是拼写错误，正确拼写是 **excluding**。常见易错点是字母顺序：**exclu-**（不是 exul-）。","**excluding** 在句子里最常见的用法是作介词，后面直接接名词/代词/动名词：\n- excluding + 名词：excluding weekends（不含周末）\n- excluding + 代词：excluding him（不包括他）\n- excluding + 动名词：excluding shipping（不含运费）","和 **except (for)** 很像：\n- excluding 更常用于公告、价格、统计等“正式/说明性”语境。\n- except (for) 口语更常见，也可更灵活。"]}
{"word":"exult","summary":{"en":"Exult means to feel or show strong joy and pride, especially after success.","zh":"Exult 指在成功后感到或表现出强烈的喜悦与自豪，常有“扬眉吐气”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel or show great happiness, pride, or triumph (often because something went very well)","zh":"（因事情进展顺利而）欢欣鼓舞；得意；扬扬得意"},"examples":[{"en":"She exulted in her victory after months of hard training.","zh":"经过数月艰苦训练后，她为自己的胜利而欢欣鼓舞。"},{"en":"Fans exulted when the team won the championship.","zh":"当球队夺冠时，球迷们欣喜若狂。"},{"en":"He tried not to exult too openly, out of respect for the other side.","zh":"出于对对方的尊重，他尽量不把得意表现得太明显。"}]},{"partOfSpeech":"v.","definition":{"en":"to take great pleasure in something; to rejoice in it (often used with “in/over”)","zh":"以……为乐；因……而欣喜（常与 in/over 连用）"},"examples":[{"en":"They exulted in the quiet success of their small business.","zh":"他们为小生意悄然取得成功而感到满足与欣喜。"},{"en":"Don’t exult over someone else’s mistakes.","zh":"不要因别人的错误而幸灾乐祸。"}]}],"synonyms":["rejoice","triumph","celebrate","be thrilled","gloat (negative)"],"phonetic":"/ɪɡˈzʌlt/","extraExplanation":["“exult”语气比“be happy/glad”更强，常带有“胜利、成就、扬眉吐气”的感觉。常见搭配：exult in (one’s success), exult over (a rival’s defeat)。","词源上与拉丁语中表示“欢跃、跳起来”的意思有关，所以它带有一种“情绪高涨、忍不住雀跃”的画面感。文学或新闻报道里更常见，口语中可用 “rejoice” 或 “be thrilled” 更自然。"]}
{"word":"exultance","summary":{"en":"Exultance means intense joy or triumphant excitement, especially after success.","zh":"exultance 指因成功或胜利而产生的强烈喜悦与得意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Great joy, pride, or triumph—an excited feeling of success.","zh":"狂喜；欢欣；因成功而产生的兴奋与得意。"},"examples":[{"en":"Her exultance was obvious when she saw the acceptance email.","zh":"看到录取邮件时，她的狂喜一目了然。"},{"en":"The team shouted in exultance after winning the final match.","zh":"球队在赢得决赛后欢呼雀跃。"}]}],"synonyms":["exultation","jubilation","elation","triumph","glee"],"phonetic":"/ɪɡˈzʌltəns/","extraExplanation":["“Exultance”来自动词“exult”（欢欣鼓舞、得意洋洋），常见名词形式还有“exultation”，两者意思非常接近；“exultation”在书面语和正式语境中更常见。","词语语气偏正式，常用于描述“胜利、成功、解脱”带来的强烈喜悦，而不仅是一般的“开心”（happy）。"]}
{"word":"exultancy","summary":{"en":"Exultancy means a strong feeling of joy and triumph, often after success.","zh":"Exultancy 指强烈的喜悦与胜利感，常出现在成功之后。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong feeling of great joy, triumph, or celebration (the state of being very happy and proud).","zh":"狂喜；欢腾；得意（非常开心、兴奋并带有胜利感的情绪状态）。"},"examples":[{"en":"There was exultancy in the room when the results were announced.","zh":"当结果公布时，房间里一片欢腾。"},{"en":"She spoke with quiet exultancy after finishing the marathon.","zh":"完成马拉松后，她带着克制的喜悦说话。"}]}],"synonyms":["joy","triumph","elation","jubilation","exultation"],"phonetic":"/ɪɡˈzʌltənsi/","extraExplanation":["“exultancy”来自动词“exult”（欢呼、狂喜），常见搭配是“a feeling/sense of exultancy”（一种欢腾的感觉）。它比“happiness”更强调“胜利/成功后的喜悦”，语气更书面。","相关词：exultant（adj. 兴高采烈的、得意的）；exultation（n. 狂喜、欢腾，和 exultancy 意思很接近，但 exultation 更常见、更偏正式）。"]}
{"word":"exultant","summary":{"en":"Exultant means extremely joyful and excited, often because of success.","zh":"Exultant 指因成功等原因而极其喜悦、兴奋的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very happy and excited, especially because of success or a good result.","zh":"（尤指因成功或好结果而）极其高兴的，兴高采烈的。"},"examples":[{"en":"She felt exultant after hearing she got the scholarship.","zh":"听到自己拿到奖学金后，她感到欣喜若狂。"},{"en":"The team was exultant when they won the championship.","zh":"球队夺冠时，队员们兴高采烈。"}]}],"synonyms":["ecstatic","elated","jubilant","overjoyed"],"phonetic":"/ɪɡˈzʌltənt/","extraExplanation":["“exultant”常用于较正式或文学化的语境，比“happy/pleased”更强烈，带有“因胜利、成功而欢呼雀跃”的感觉。","词源上与“exult（欢呼、狂喜）”相关；常见搭配有：exultant mood（兴奋的心情）、exultant cries/shouts（欢呼声）。"]}
{"word":"exultantly","summary":{"en":"“Exultantly” means ‘with great joy and triumph.’","zh":"“exultantly”表示“带着强烈喜悦与胜利感地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very happy, proud, and excited way (showing clear triumph or joy).","zh":"兴高采烈地；得意洋洋地（带着明显的胜利感或喜悦）。"},"examples":[{"en":"She raised her arms exultantly after finishing the race.","zh":"比赛结束后，她得意洋洋地举起了双臂。"},{"en":"The fans shouted exultantly when their team scored.","zh":"球队进球时，球迷们兴奋地欢呼。"}]}],"synonyms":["triumphantly","joyfully","gleefully","jubilantly"],"phonetic":"/ɪɡˈzʌl.tənt.li/","extraExplanation":["“exultantly”来自动词“exult”（欢腾、得意），常见搭配有：smile/laugh/shout exultantly（得意地笑/笑出声/高声欢呼）。","语气通常比“happily”更强，带“赢了”“终于成功了”的情绪；在写作里可用来描写胜利后的反应，但在某些情境（如他人失败）中可能显得不够体贴。","相关词：exult（v. 欢腾）；exultation（n. 欢腾、狂喜）；exultant（adj. 得意的、欢欣鼓舞的）。"]}
{"word":"exultation","summary":{"en":"Exultation means intense joy and triumph, especially after success.","zh":"Exultation 指强烈的喜悦与胜利感，尤指成功之后的狂喜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling of great joy, pride, or triumph (often after success or good news).","zh":"极大的喜悦；得意；狂喜（常指成功或好消息后的情绪）。"},"examples":[{"en":"There was a shout of exultation when the team won the championship.","zh":"球队夺冠时，人们发出一阵欢呼，充满狂喜。"},{"en":"She felt quiet exultation after finishing the marathon.","zh":"她完成马拉松后，心里涌起一种安静的喜悦。"},{"en":"His voice carried a note of exultation as he announced the results.","zh":"他宣布结果时，声音里带着一丝得意与兴奋。"}]}],"synonyms":["triumph","jubilation","elation","exhilaration","glee"],"phonetic":"/ˌɛɡzʌlˈteɪʃən/","extraExplanation":["“exultation”常见于较正式或文学性的语境，比“happiness/joy”更强调“胜利感、成就感、扬眉吐气”的那种情绪。","词源上与动词“exult”（欢腾；得意）相关，常与介词“in/at/over”搭配：exultation in victory / at the news / over the defeat of an opponent。"]}
{"word":"exulted","summary":{"en":"“Exulted” means “felt and showed great joy or triumph,” and it is the past form of “exult.”","zh":"“exulted”表示“欢欣鼓舞、洋溢着胜利或自豪感”，是动词“exult”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel and show great happiness, pride, or triumph (often because something good has happened)","zh":"（因好事发生而）欢欣鼓舞，得意洋洋，洋溢着胜利或自豪感"},"examples":[{"en":"She exulted when she heard she got the scholarship.","zh":"听说自己拿到奖学金时，她欣喜若狂。"},{"en":"Fans exulted in the team’s victory.","zh":"球迷为球队的胜利而欢呼雀跃。"},{"en":"He tried not to exult too loudly after winning the debate.","zh":"赢了辩论后，他尽量不让自己表现得太得意。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “exult”","zh":"“exult”的过去式和过去分词形式"},"examples":[{"en":"They exulted over their success, but thanked their supporters.","zh":"他们为自己的成功而兴奋不已，同时也感谢支持者。"}]}],"synonyms":["rejoiced","celebrated","triumphed","was elated"],"phonetic":"/ɪɡˈzʌl.tɪd/","extraExplanation":["“exult”常与介词搭配：exult in（为……而雀跃/沉浸在喜悦中）、exult over（因胜过别人或取得成果而得意）。语气通常比“be happy”更强，带有“胜利、扬眉吐气”的感觉。","写作中它偏正式，常见于新闻、演讲或文学语境。比如：people exulted in freedom（人们为自由而欢呼）。"]}
{"word":"exultet","summary":{"en":"Exultet (often spelled Exsultet) is the Latin “Easter Proclamation” sung at the Catholic Easter Vigil.","zh":"Exultet（常写作 Exsultet）指天主教复活前夕守夜礼中吟唱的拉丁《逾越颂》（复活宣告）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Latin hymn (the “Easter Proclamation”) sung in the Roman Catholic liturgy at the Easter Vigil, traditionally during the lighting of the Paschal (Easter) candle.","zh":"《逾越颂》（又称“复活宣告”）：在罗马天主教礼仪中于复活前夕守夜礼（Easter Vigil）里吟唱的拉丁圣歌，传统上在点燃复活蜡烛（Paschal candle）时唱诵。"},"examples":[{"en":"The deacon chanted the Exultet after the Paschal candle was lit.","zh":"执事在点燃复活蜡烛后吟唱《逾越颂》。"},{"en":"Many parishes print an English translation of the Exultet for the congregation.","zh":"许多堂区会为会众印发《逾越颂》的英文译文。"}]}],"synonyms":["Exsultet","Easter Proclamation","Paschal Proclamation"],"phonetic":"/ɪɡˈzʌltɛt/","extraExplanation":["“Exultet”常见的标准写法是“Exsultet”，来自拉丁语开头句“Exsultet iam angelica turba caelorum…”，意为“愿天上的天使欢欣……”。在英语语境里它多作为专有名词，指复活前夕礼仪中的那段固定颂唱。","在文学与文化描写中，Exsultet常被用来营造“复活节夜的光与喜乐”的氛围：黑暗中点燃蜡烛、会众回应、长篇颂唱宣告复活的意义。"]}
{"word":"exulting","summary":{"en":"Exulting means feeling or showing great joy or triumph, often after success.","zh":"exulting 指因成功或胜利而表现出强烈的喜悦或得意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing great joy, pride, or triumph; very happy and excited (often after success).","zh":"欣喜若狂的；洋洋得意的；因成功而兴奋欢腾的。"},"examples":[{"en":"She gave an exulting shout when she saw her name on the list.","zh":"看到名单上有自己的名字时，她兴奋地喊了一声。"},{"en":"The team walked off the field exulting after the last-minute goal.","zh":"球队在最后一刻进球后兴高采烈地走下球场。"},{"en":"His exulting smile made it clear he had won the argument.","zh":"他得意的笑容表明他在争论中赢了。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of “exult”: to feel or show great happiness or triumph.","zh":"“exult”的现在分词：欢腾；得意；因胜利或成功而非常高兴。"},"examples":[{"en":"They were exulting in their victory.","zh":"他们正沉浸在胜利的喜悦中。"},{"en":"He kept exulting over his test score.","zh":"他一直为自己的考试成绩而得意。"}]}],"synonyms":["triumphant","joyful","elated","jubilant","overjoyed","gleeful"],"phonetic":"/ɪɡˈzʌltɪŋ/","extraExplanation":["“exult”常与介词 in / over 搭配：exult in（沉浸于……的喜悦中），exult over（因……而得意/欢呼）。语气通常比 “happy” 更强，带有“胜利、成功后的欢庆”意味。","词源来自拉丁语 exsultare（跳起来、欢腾），因此有一种“喜悦到要跳起来”的画面感。"]}
{"word":"exultingly","summary":{"en":"Exultingly means “in a proud, joyful way,” especially after success or victory.","zh":"exultingly 表示“得意地、欢欣鼓舞地”，尤指因成功或胜利而表现出的喜悦。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows great happiness, pride, or victory (often because something went very well).","zh":"以得意或欢欣鼓舞的方式（常因成功、胜利或好结果而表现出强烈喜悦）。"},"examples":[{"en":"She smiled exultingly when she heard she got the scholarship.","zh":"听到自己拿到奖学金时，她得意地笑了。"},{"en":"The fans cheered exultingly after the final goal.","zh":"最后一球进了之后，球迷们欢呼雀跃。"},{"en":"“We did it,” he said exultingly.","zh":"“我们做到了，”他兴奋得意地说道。"}]}],"synonyms":["triumphantly","joyfully","gleefully","proudly"],"phonetic":"/ɪɡˈzʌl.tɪŋ.li/","extraExplanation":["exultingly 来自动词 exult（“欢欣鼓舞；扬扬得意”）。它比 happily 更强调“因胜利/成功而激动、得意”的情绪，有时也可能带一点“幸灾乐祸/过分得意”的语气，取决于上下文。","常见搭配：smile/grin exultingly（得意地笑）、say/declare exultingly（兴奋地宣布）、cheer exultingly（欢呼雀跃）。"]}
{"word":"exults","summary":{"en":"“Exults” means “shows great joy or pride,” usually about a success; it’s the third-person singular form of “exult.”","zh":"“exults”表示因成功等而表现出强烈的喜悦或自豪；是动词“exult”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel and show great happiness, pride, or excitement (often because of a success or victory)","zh":"（因成功或胜利而）欢欣鼓舞，得意洋洋，兴高采烈"},"examples":[{"en":"She exults in every small victory at work.","zh":"她为工作中的每一次小小胜利都感到很兴奋。"},{"en":"Fans exulted after the team won the championship.","zh":"球队夺冠后，球迷们欣喜若狂。"},{"en":"He exults at the news that his book made the bestseller list.","zh":"听到自己的书上了畅销榜，他兴奋不已。"}]}],"synonyms":["rejoices","celebrates","triumphs","glories","is thrilled"],"phonetic":"/ɪɡˈzʌlts/","extraExplanation":["“exults”通常是动词“exult”的第三人称单数（he/she/it exults），也可能是现在时用于一般现在时，或出现在文学叙述中。","常见搭配：exult in（因……而得意/欢欣），exult at/over（听到/看到……而欢呼）。语气比“be happy”更强，更带有“胜利者的喜悦/自豪”。","在文学或新闻写作里更常见；日常口语里人们更常说“celebrate”“be thrilled”“be so proud”。"]}
{"word":"exululate","summary":{"en":"A rare verb meaning to cry out loudly in joy; to exult noisily.","zh":"一个罕见动词，表示因喜悦而高声欢呼、喧闹地庆祝。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To shout or cry out loudly in joy; to exult with loud cries.","zh":"（罕见）高声欢呼；因喜悦而大声喊叫。"},"examples":[{"en":"When the team scored in the final seconds, fans began to exululate in the streets.","zh":"球队在最后几秒进球后，球迷开始在街上高声欢呼。"},{"en":"She could hardly speak; she only exululated with relief.","zh":"她几乎说不出话，只能如释重负地大声欢呼。"}]}],"synonyms":["cheer","exult","rejoice","shout","celebrate"],"phonetic":"/ɛɡˈzʌljuˌleɪt/","extraExplanation":["这个词非常少见，多见于较老的文学或夸张的书面语中。日常英语里更常用的说法是：cheer, shout with joy, celebrate, exult。","词形上常被认为与 exult（欢欣鼓舞）和 ululate（发出尖锐的叫声，常用于描述哀号或欢呼）有关，因此带有“声音很大、情绪很强烈”的感觉。使用时注意语境，通常偏“隆重/戏剧化”。"]}
{"word":"exumbral","summary":{"en":"Exumbral means being outside the umbra (the darkest shadow), often referring to partial-shadow areas in eclipse/optics contexts.","zh":"exumbral 指“在本影之外”，多用于日食/光学等语境，表示靠近本影的半影/外影区域仍有部分光照。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Outside the darkest part of a shadow (the umbra); in the partial-shadow region near it.","zh":"在本影（最暗的影子部分）之外；位于接近本影的半影/外影区域。"},"examples":[{"en":"During the eclipse, the exumbral region still received some sunlight.","zh":"在日食期间，外本影区域仍能接收到一些阳光。"},{"en":"The telescope measured brightness changes in the exumbral zone.","zh":"望远镜测量了外本影区域的亮度变化。"}]}],"synonyms":["outside the umbra","penumbral (related, not identical)"],"phonetic":"/ˌɛkˈzʌmbrəl/","extraExplanation":["这是一个非常少见、偏科学语境的词，常见于天文学与光学讨论（例如日食/月食、遮挡与影锥）。","词源结构：ex-（在……之外）+ umbra（拉丁语“影子/阴影”）。因此字面意思就是“在影子之外”。","相关概念对比：umbra（本影，最暗）→ penumbra（半影，部分遮挡）→ exumbral（本影之外的区域/状态，通常仍有部分光照）。不同学科对边界的划分可能略有差异。"]}
{"word":"exumbrella","summary":{"en":"“Exumbrella” is not a standard word; it’s usually an informal label meaning “former umbrella (organization/brand/arrangement),” often written “ex-umbrella.”","zh":"“exumbrella”不是标准词；多为非正式写法，常写作“ex-umbrella”，意为“曾经的伞式（组织/品牌/体系）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard) Formerly an umbrella organization, brand, or arrangement that used to “cover” or include something; used mainly as a made-up label in notes or informal writing (more often written with a hyphen: ex-umbrella).","zh":"（不标准用法）曾经的“伞式”组织/品牌/安排；指过去用于“涵盖、统领”某些事物的体系。多见于临时标签或非正式写法（更常写作 ex-umbrella）。"},"examples":[{"en":"After the company split, the team became an ex-umbrella unit and joined a new division.","zh":"公司拆分后，这个团队不再隶属于原来的伞式体系，转入了新的事业部。"},{"en":"These products were sold under an ex-umbrella brand name before the rebrand.","zh":"这些产品在重新品牌化之前，曾使用旧的伞式品牌名销售。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A former physical umbrella (an actual rain umbrella) that someone no longer uses or owns.","zh":"（罕见）以前用过、现在不再使用或不再拥有的一把雨伞。"},"examples":[{"en":"I found my ex-umbrella in the back of the closet.","zh":"我在衣柜后面找到了那把以前用过的伞。"}]}],"synonyms":["former umbrella organization","previous umbrella brand","umbrella organization (related)","umbrella term (related)"],"phonetic":"/ˌɛks ʌmˈbrɛlə/","extraExplanation":["“exumbrella”并不是常见英文单词；更自然的写法通常是带连字符的“ex-umbrella”，其中前缀“ex-”表示“前任的/以前的/不再属于的”。","如果你想表达“伞；雨伞”，正确单词是“umbrella”。如果你想表达“伞式的、统领的（组织/政策/品牌）”，常用说法有“umbrella organization / umbrella term / umbrella brand”。"]}
{"word":"exumbrellar","summary":{"en":"“Exumbrellar” means “on or of the outer/upper surface of a jellyfish’s umbrella (exumbrella).”","zh":"“exumbrellar”指与水母伞部的外侧/上表面（伞外侧，exumbrella）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the outside (upper) surface of a jellyfish’s umbrella-shaped body (the “exumbrella”).","zh":"（生物学）与水母伞部外侧/上表面有关的；指“伞外侧（exumbrella）”的。"},"examples":[{"en":"Pigmentation patterns on the exumbrellar surface can help identify the species.","zh":"伞外侧表面的色素花纹有助于辨认物种。"},{"en":"The biologist noted small bumps on the exumbrellar side of the medusa.","zh":"生物学家注意到这只水母伞外侧有一些小突起。"}]}],"synonyms":["exumbrellar (technical term; few true synonyms)","of the exumbrella"],"phonetic":"/ˌɛksʌmˈbrɛlər/","extraExplanation":["这是一个比较少见的专业词，多见于海洋生物学/动物学文献。常见的相关名词是 exumbrella（伞外侧、伞部上表面），与 subumbrella（伞内侧、伞部下表面）相对。","词形上，ex- 表示“外部”，umbrella 在这里不是日常的“雨伞”，而是指水母“伞状体”的结构名称。"]}
{"word":"exundance","summary":{"en":"“Exundance” is not standard; you probably mean “abundance” = plenty, a large amount.","zh":"“exundance”不是标准用法；你大概率想写“abundance”，意思是“充足；大量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Most likely a misspelling of “abundance,” meaning a large quantity; plenty.","zh":"（非标准拼写）多半是把“abundance”拼错了，意思是“大量；充足”。"},"examples":[{"en":"I think you mean “abundance”: There is an abundance of fresh fruit in summer.","zh":"我猜你想写的是“abundance”：夏天新鲜水果很充足。"},{"en":"She spoke with an abundance of confidence.","zh":"她说话时充满自信。"}]}],"synonyms":["plenty","a lot of","a great deal","an ample supply"],"phonetic":"/əˈbʌndəns/","extraExplanation":["“exundance”不是常见或标准的英语单词。学习和写作中建议使用“abundance”（充足；大量）。","如果你本来想表达“精力充沛、热情洋溢”，更接近的词可能是“exuberance”（热情；活力），而不是“abundance”。"]}
{"word":"exundancy","summary":{"en":"Redundancy means unnecessary repetition or extra parts; it can also mean backup capacity in systems, and in British English it can mean job loss because a role is no longer needed.","zh":"Redundancy 指不必要的重复或多余部分；也可指系统中的备份冗余；在英式英语中还可指因岗位不再需要而被裁员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having more words, information, or parts than necessary; unnecessary repetition or excess","zh":"冗余；赘述；多余（指信息、措辞或部分超过需要）"},"examples":[{"en":"Please remove any redundancy from the report so it’s easier to read.","zh":"请把报告里的冗余内容删掉，这样更容易阅读。"},{"en":"The instructions contain a lot of redundancy—many steps are repeated.","zh":"这些说明有很多赘述——不少步骤被重复了。"},{"en":"Good editors cut redundancy to make writing clearer.","zh":"好的编辑会删掉冗余，使文章更清晰。"}]},{"partOfSpeech":"n.","definition":{"en":"in engineering/computing, extra systems or copies added to prevent failure if one part breaks","zh":"（工程/计算机）冗余设计；备份（为防故障而增加的额外系统或副本）"},"examples":[{"en":"The plane’s control system has redundancy for safety.","zh":"飞机的控制系统有冗余设计以确保安全。"},{"en":"Data redundancy can help protect files if a drive fails.","zh":"数据冗余可以在硬盘损坏时帮助保护文件。"}]},{"partOfSpeech":"n.","definition":{"en":"in British English, the situation of losing a job because your position is no longer needed","zh":"（英式英语）裁员；被解雇（因岗位不再需要）"},"examples":[{"en":"He was made redundant when the company closed the factory.","zh":"公司关闭工厂后，他被裁员了。"},{"en":"She received redundancy pay after ten years at the firm.","zh":"在公司工作十年后，她拿到了裁员补偿金。"}]}],"synonyms":["repetition","excess","duplication","superfluity","surplus"],"phonetic":"/rɪˈdʌndənsi/","extraExplanation":["你输入的“exundancy”很可能是拼写错误：最接近且常用的词是“redundancy”。“redundancy”在美式英语里主要指“冗余/重复”，在英式英语里还常指“裁员”。如果你想表达“充沛的活力/热情”，可能是“exuberance”。"]}
{"word":"exundate","summary":{"en":"Exundate means to overflow or flood out beyond limits, mainly in literary/formal use.","zh":"Exundate 指“泛滥、溢出、漫出”，多见于文学或正式语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to overflow; to flood out or spread beyond limits (often used in literary or formal writing)","zh":"（文雅/正式用语）泛滥；溢出；漫出（常指水或情感等超出界限）"},"examples":[{"en":"After days of heavy rain, the river began to exundate into the fields.","zh":"连下几天大雨后，河水开始漫出河岸，淹进田地。"},{"en":"Her joy seemed to exundate from every word she spoke.","zh":"她说的每一句话都仿佛洋溢着喜悦。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to abound or be present in great quantity","zh":"（较少见）大量存在；充满"},"examples":[{"en":"In spring, the hills exundate with wildflowers.","zh":"春天时，山坡上野花繁盛。"}]}],"synonyms":["overflow","flood","spill over","inundate","surge"],"phonetic":"/ɛɡˈzʌn.deɪt/","extraExplanation":["“exundate”非常少见，来源于拉丁语 exundare（ex- “向外” + unda “波浪/水”），因此核心意象是“水向外漫开”。现代英语里更常用的替代词有 overflow, flood, spill over。","容易与医学词“exudate”（渗出液）混淆；两者拼写和发音相近，但含义不同：exudate 指组织渗出的液体，exundate 指“泛滥/溢出”。"]}
{"word":"exundation","summary":{"en":"Exundation means a flood or overflow, and it can also mean a figurative outpouring in formal writing.","zh":"Exundation 指洪水泛滥、溢出；在正式文体中也可比喻为某事物的大量涌现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flooding or overflow of water, especially a river flooding its banks.","zh":"洪水；泛滥（尤指河水漫出河岸）。"},"examples":[{"en":"After days of heavy rain, the valley suffered an exundation that damaged roads and farms.","zh":"连续几天暴雨后，山谷发生洪水泛滥，损坏了道路和农田。"},{"en":"The report described periodic exundation along the river during the wet season.","zh":"报告描述了雨季期间河流沿岸周期性的洪水泛滥。"}]},{"partOfSpeech":"n.","definition":{"en":"A sudden outpouring or abundance of something (often used figuratively in formal writing).","zh":"（比喻）突然的涌现；大量涌出（多见于正式文体）。"},"examples":[{"en":"The announcement was followed by an exundation of support from the community.","zh":"公告发布后，社区涌现出大量支持。"},{"en":"Her speech triggered an exundation of memories he had tried to forget.","zh":"她的演讲引发了他试图忘记的大量回忆涌上心头。"}]}],"synonyms":["flood","overflow","inundation","deluge","outpouring"],"phonetic":"/ˌɛk.sʌnˈdeɪ.ʃən/","extraExplanation":["这是一个较少见、偏正式/文学性的词，来自拉丁语 exundare（意为“溢出、泛滥”），词根 und- 与“波浪/水”有关（可联想 undulate “起伏、波动”）。","在现代英语里，更常用的替代词包括 flood（洪水/泛滥）、overflow（溢出）、inundation（淹没/泛滥）。其中 inundation 更常见，也常用于比喻“信息/情绪的淹没”。"]}
{"word":"exungulate","summary":{"en":"Exungulate means “without hooves; non-ungulate,” used mainly in zoology or academic writing.","zh":"exungulate 指“无蹄的；非有蹄类的”，多用于动物学或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) not having hooves; not belonging to hoofed mammals (ungulates).","zh":"（指动物）无蹄的；非有蹄类（非“有蹄哺乳动物”）的。"},"examples":[{"en":"Humans are exungulate mammals—they do not have hooves.","zh":"人类是无蹄的哺乳动物——我们没有蹄。"},{"en":"The report compares ungulate and exungulate species in the same habitat.","zh":"该报告比较了同一栖息地中的有蹄类与无蹄类物种。"}]}],"synonyms":["non-ungulate","not hoofed","without hooves"],"phonetic":"/ɛksˈʌŋɡjələt/","extraExplanation":["这是一个较少见的学术/动物学词，主要用于分类或对比“ungulate（有蹄类）”。词根上，ex- 表示“无/非/脱离”，-ungulate 来自拉丁语 ungula（蹄）。日常英语里更常用 not hoofed / without hooves，或直接说 non-ungulate。"]}
{"word":"exuperable","summary":{"en":"Exuperable means “able to be overcome.”","zh":"exuperable 的意思是“可克服的、可战胜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be overcome, defeated, or successfully dealt with (often used for difficulties or obstacles).","zh":"可克服的；可战胜的；（困难、障碍等）能够成功应对的。"},"examples":[{"en":"With enough practice, the challenges of the course are exuperable.","zh":"只要练得足够多，这门课的挑战是可以克服的。"},{"en":"She treated the setback as exuperable, not as a reason to quit.","zh":"她把这次挫折当作可克服的问题，而不是放弃的理由。"}]}],"synonyms":["overcomeable","surmountable","manageable","conquerable"],"phonetic":"/ɪɡˈzuːpərəbəl/","extraExplanation":["“exuperable”较正式、较少见，常用于写作或演讲中，语气比“solvable / manageable”更书面。","词源来自拉丁语 exsuperare（“超越、克服”），因此含有“跨过去、赢过去”的感觉。","相关词：inexuperable（不可克服的）。在文学或新闻评论中，有时会用这一对词来强调困难的程度。"]}
{"word":"exurb","summary":{"en":"An exurb is a community beyond the suburbs, often low-density and more rural, but still linked to a nearby city (often through commuting).","zh":"exurb 指“郊区之外的远郊居住区”，通常更低密度、更接近乡村，但仍与附近城市（多通过通勤）相连。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a residential area outside a city’s suburbs; a community beyond the suburbs, often more rural or low-density but still connected to the city (e.g., by commuting)","zh":"远郊（城市“郊区之外”的居住区）；通常更接近乡村、密度更低，但仍与城市有通勤或经济联系的地区"},"examples":[{"en":"After housing prices rose, many families moved from the suburbs to an exurb.","zh":"房价上涨后，许多家庭从郊区搬到了远郊。"},{"en":"She commutes to the city from an exurb about an hour away.","zh":"她从距离市区大约一小时车程的远郊通勤上班。"},{"en":"Exurbs often have more open space, but fewer public transit options.","zh":"远郊通常有更多空地，但公共交通选择更少。"}]}],"synonyms":["outer suburb","commuter town","bedroom community (sometimes)","rural fringe"],"phonetic":"/ˈɛksɝb/","extraExplanation":["“exurb”由“extra-（在……之外）+ suburb（郊区）”构成，常用来对比：suburb（郊区）更靠近城市、开发更成熟；exurb（远郊）更外圈、密度更低，常见独栋住宅与更长通勤。","在美国语境中，“exurb”常出现在城市规划、房价、通勤、土地开发等话题里，有时带有“城市外扩、开车依赖更强”的社会讨论背景。"]}
{"word":"exurban","summary":{"en":"Exurban describes places (or less commonly people) beyond the suburbs—more rural-feeling but still connected to a city, often by commuting.","zh":"Exurban 指“远郊（郊区之外）”的地方（较少也指人）：更像乡村但仍与城市联系紧密，常通过通勤连接。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an area outside a city’s suburbs, where people often live in more rural or semi-rural settings but still commute to the city.","zh":"（与）远郊的有关；指在城市郊区之外、较乡村化但仍与城市通勤联系紧密的地区。"},"examples":[{"en":"They moved to an exurban neighborhood for more space and a quieter lifestyle.","zh":"他们搬到远郊社区，想要更大的空间和更安静的生活。"},{"en":"Exurban growth has increased traffic on the highways leading into the city.","zh":"远郊扩张增加了通往市区高速公路的交通压力。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who lives in an exurban area (less common).","zh":"远郊居民；住在远郊地区的人（较少见）。"},"examples":[{"en":"As an exurban, she drives nearly an hour to work downtown.","zh":"作为远郊居民，她开车去市中心上班要将近一小时。"}]}],"synonyms":["outer-suburban","beyond-the-suburbs","peri-urban (related)","commuter-belt (related)"],"phonetic":"/ɛɡˈzɝbən/","extraExplanation":["“exurban”来自“exurb”（ex- 表示“在外/超出” + urban 表示“城市的”）。常用来描述比“suburban（郊区的）”更远、更接近乡村但仍与城市经济与通勤紧密相连的居住区。","搭配提示：exurban area/community/neighborhood；exurban growth/sprawl（远郊扩张/蔓延）。与“rural（农村的）”不同，exurban 通常仍依赖城市就业与服务。"]}
{"word":"exurbanite","summary":{"en":"An exurbanite is a person who lives beyond the suburbs in the exurbs, often in a low-density, semi-rural area.","zh":"exurbanite 指住在郊区外更远的“远郊/外缘郊区（exurbs）”的人，通常居住环境更低密度、偏半乡村。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives in the exurbs—residential areas beyond the suburbs, usually farther from the city center and often more rural or semi-rural.","zh":"住在“远郊/外缘郊区（exurbs）”的人——比郊区更远、离市中心更远，常带有更乡村或半乡村特点的居住区。"},"examples":[{"en":"Many exurbanites commute long distances to jobs in the city.","zh":"许多远郊居民需要长距离通勤到市里上班。"},{"en":"As housing prices rose, some families became exurbanites to find larger homes.","zh":"随着房价上涨，一些家庭搬到远郊，去寻找更大的房子。"},{"en":"The town’s school population grew as more exurbanites moved in.","zh":"随着更多远郊居民迁入，这个小镇的学生人数增加了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of people or life in the exurbs.","zh":"与远郊居民或远郊生活有关的；具有远郊特征的。"},"examples":[{"en":"The area has an exurbanite feel: quiet roads, big lots, and a long drive to downtown.","zh":"这里有一种远郊的感觉：道路安静、地块很大，去市中心要开很久。"},{"en":"Local planners debated how to serve exurbanite communities with limited public transit.","zh":"当地规划者讨论了在公共交通有限的情况下如何服务远郊社区。"}]}],"synonyms":["exurb resident","outer-suburb resident","commuter (contextual)"],"phonetic":"/ˌɛksˈɝːbəˌnaɪt/","extraExplanation":["“exurbanite”来自“exurb（远郊/外缘郊区）+ -ite（表示某地居民的后缀）”。在美国语境里，它常出现在城市规划、住房、通勤与政治地理的讨论中。一般理解为比“suburbanite（郊区居民）”住得更远、更依赖汽车、人口密度更低。","相关词对比：urban（城市的）→ suburban（郊区的）→ exurban（远郊的）。常见搭配：exurbanite commuters（远郊通勤者）、exurbanite lifestyle（远郊生活方式）。"]}
{"word":"exurbanites","summary":{"en":"Exurbanites are people who live beyond the suburbs, in lower-density areas still tied to a city (often by commuting).","zh":"Exurbanites 指居住在郊区之外的远郊居民，居住更分散但仍与城市保持联系（常通过通勤）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live in an exurb—an area outside a city’s suburbs, often more rural or spread out, but still connected to the city by commuting.","zh":"居住在“远郊/外郊区（exurb）”的人——位于郊区之外、通常更乡村化或更分散，但仍与城市通勤和生活联系紧密的居民。"},"examples":[{"en":"Many exurbanites commute to the city a few days a week and work from home the rest of the time.","zh":"许多远郊居民每周有几天通勤进城，其余时间在家办公。"},{"en":"Exurbanites often trade a longer drive for more space and quieter neighborhoods.","zh":"远郊居民常常用更长的车程来换取更大的居住空间和更安静的社区。"},{"en":"The county is growing quickly as exurbanites move in and new housing is built.","zh":"随着远郊居民迁入并修建新住宅，这个县正在快速增长。"}]}],"synonyms":["people living in the exurbs","outer-suburban residents"],"phonetic":"/ˌɛkˈsɝːbənˌaɪts/","extraExplanation":["“exurbanite”来自“exurb”（ex- + urban），常用于美国城市研究、房地产和人口迁移语境。它与“suburbanite（郊区居民）”不同：exurbanite通常住得更远、密度更低、环境更接近小城镇或乡村，但经济与就业仍与大都市圈强相关。","相关词：exurb（远郊/外郊区）, suburbanite（郊区居民）, commuter（通勤者）。常见搭配：exurban sprawl（远郊扩张/蔓延）、move to the exurbs（搬到远郊）。"]}
{"word":"exurbia","summary":{"en":"Exurbia means the outer suburbs beyond a city, often low-density and car-dependent.","zh":"Exurbia 指城市外缘、更外圈的郊区，常见特点是低密度、依赖开车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the suburbs (especially prosperous residential areas) beyond a city; suburban life or the suburban area seen as a whole","zh":"（尤指富裕的）城市外缘郊区；郊区生活；泛指郊区地区"},"examples":[{"en":"After having kids, they moved from downtown to exurbia for more space.","zh":"有了孩子之后，他们从市中心搬到城市外缘的郊区，空间更大。"},{"en":"Commuting from exurbia can take over an hour each way.","zh":"从城市外缘郊区通勤，单程可能要一个多小时。"},{"en":"Some people love exurbia for its quiet streets and bigger yards.","zh":"有些人喜欢城市外缘郊区，因为街道安静、院子更大。"}]}],"synonyms":["outer suburbs","commuter belt","suburban fringe"],"phonetic":"/ˌɛɡˈzɝbiə/","extraExplanation":["“exurbia”通常指比“suburb（郊区）”更远、密度更低、更依赖开车的居住区，常见于美国城市周边的“通勤圈（commuter belt）”。","这个词在新闻与社会评论中常用来讨论城市扩张（urban sprawl）、房价、通勤、以及郊区文化等话题。","词源上可理解为“ex-（在外）+ suburbia（郊区生活）”，带有“在郊区之外的更外圈”的含义。"]}
{"word":"exurbias","summary":{"en":"Exurbia means the areas beyond the suburbs, often low-density communities where people commute into a city.","zh":"Exurbia 指“郊区之外的远郊地区”，多为低密度住宅区，居民常通勤进城。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the area outside the suburbs—often a commuter belt with low-density housing that is farther from the city center than typical suburbs","zh":"“远郊地区”：位于郊区之外、比一般郊区更远、以低密度住宅和通勤为主的地区"},"examples":[{"en":"Many families moved to exurbia for bigger homes and quieter neighborhoods.","zh":"许多家庭搬到远郊地区，以获得更大的房子和更安静的社区。"},{"en":"Traffic from exurbia into the city can be heavy during rush hour.","zh":"从远郊地区进城的通勤高峰期交通可能很拥堵。"}]},{"partOfSpeech":"n.","definition":{"en":"the lifestyle or social environment associated with living in exurbia","zh":"远郊生活方式；远郊的社会环境（与住在远郊相关的生活形态）"},"examples":[{"en":"Some people enjoy the space of exurbia but miss the culture of downtown.","zh":"有些人喜欢远郊的宽敞，但会想念市中心的文化活动。"}]}],"synonyms":["the outer suburbs","commuter belt","outlying area"],"phonetic":"/ɛɡˈzɝbiə/","extraExplanation":["“exurbia”由“exurban（远郊的）”发展而来，常见于美国城市规划与新闻语境，用来区分 city（城市）、suburb（郊区）和 exurb（远郊/城外通勤区）。","你输入的“exurbias”更常见的拼写是“exurbia”。“exurbias”有时会被当作“多个远郊地区”的复数用法，但在现代英语里不太常见，通常直接用“exurbia”指整体概念。"]}
{"word":"exurbs","summary":{"en":"Exurbs are areas beyond the suburbs, farther from a city, often with lower density and longer commutes.","zh":"Exurbs 指“远郊”，位于郊区之外、离城市更远的低密度居住区，通勤通常更长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a district outside the suburbs, usually beyond a city’s main commuting area, where people often live in newer, lower-density housing and may commute long distances","zh":"远郊（位于郊区之外、城市通勤圈更外围的居住区；通常住宅密度更低、通勤距离更长）"},"examples":[{"en":"Many families moved to the exurbs for bigger homes and more space.","zh":"许多家庭搬到远郊，是为了更大的房子和更多的空间。"},{"en":"Traffic increased as exurb residents drove into the city for work.","zh":"随着远郊居民开车进城上班，交通拥堵加剧。"},{"en":"Housing prices in the exurbs are often lower than in the suburbs closer to downtown.","zh":"远郊的房价通常比更靠近市中心的近郊更低。"}]}],"synonyms":["outer suburbs","commuter belt","bedroom communities"],"phonetic":"/ˈɛɡzɝb/","extraExplanation":["“exurb”由“extra-（在……之外）+ suburb（郊区）”构成，常用于城市规划、房地产与社会学语境。","“suburb（郊区）”通常仍与城市联系紧密、通勤更方便；“exurb（远郊）”更偏乡村化、密度更低，生活方式更依赖汽车。","你输入的“exurbs”是复数形式；单数是“exurb”。"]}
{"word":"exurge","summary":{"en":"Exurge is a rare, formal verb meaning “to rise up” (and sometimes “to rouse or awaken”).","zh":"Exurge 是一个较少见、偏正式的动词，意思是“升起/起身”，有时也指“唤起/使苏醒”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to rise up; to arise or spring up (often used in formal, poetic, or older writing).","zh":"起身；起立；升起；突然出现（多用于正式、诗歌或较旧的用法）。"},"examples":[{"en":"From the valley, a thin mist exurged at dawn.","zh":"黎明时分，一缕薄雾从山谷里升起。"},{"en":"Old legends say courage exurges when fear is strongest.","zh":"古老的传说说，恐惧最强烈时，勇气反而会升起。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause (something) to rise or awaken; to rouse (rare).","zh":"使……升起或苏醒；唤起（较罕见）。"},"examples":[{"en":"The speech exurged hope in the crowd.","zh":"那场演讲唤起了人群的希望。"}]}],"synonyms":["arise","rise","emerge","surge","spring up","rouse"],"phonetic":"ɪɡˈzɝdʒ","extraExplanation":["“exurge”非常少见，现代英语里通常用更常见的词替代，如“arise / rise / emerge / surge / spring up / rouse”。你更可能在宗教或古典文本中见到它。","它源自拉丁语“exurgere”（ex- 向外 + surgere 升起）。在基督教语境中，常见短语是拉丁文“Exurge, Domine”（“主啊，请兴起/起来”），也曾作为历史文献（如教宗诏书标题）出现。"]}
{"word":"exuscitate","summary":{"en":"Exuscitate is a rare formal verb meaning to revive someone/something or to reawaken feelings or memories.","zh":"Exuscitate 是一个罕见的正式动词，意思是“使复苏/唤醒”，也可指“重新激起情感或记忆”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to revive or bring back to life or consciousness; to reawaken (formal, rare)","zh":"使复苏；使恢复知觉；唤醒（正式用语，较罕见）"},"examples":[{"en":"The cold water seemed to exuscitate him after the long hike.","zh":"长途徒步后，冷水似乎让他恢复了精神。"},{"en":"The speech exuscitated hope in the community.","zh":"那场演讲重新唤起了社区的希望。"}]},{"partOfSpeech":"vt.","definition":{"en":"to rouse or stir up feelings, memories, or interest again (formal, rare)","zh":"重新激起（情感、记忆或兴趣）（正式用语，较罕见）"},"examples":[{"en":"Old photographs can exuscitate painful memories.","zh":"旧照片可能会重新勾起痛苦的回忆。"},{"en":"The museum’s new exhibit exuscitated public interest in local history.","zh":"博物馆的新展览重新激起了公众对本地历史的兴趣。"}]}],"synonyms":["revive","resuscitate","reawaken","rouse","rekindle"],"phonetic":"/ɪɡˈzʌsɪˌteɪt/","extraExplanation":["“exuscitate”非常少见，多用于文学或非常正式的写作。日常英语中更常用的是“resuscitate”（使复苏/抢救）或“revive”（使恢复精神/复苏）。","词源来自拉丁语：ex-（向外/再次）+ suscitare（唤起、激起）。因此它既可指“让人恢复意识”，也可引申为“唤起情感或记忆”。","用法提示：在医疗语境里一般不要用“exuscitate”，用“resuscitate (someone)”更自然、更常见。"]}
{"word":"exust","summary":{"en":"“Exist” means to be real/present or to live/continue, and it can also mean to survive (often “exist on”).","zh":"“exist”表示“存在、真实存在；继续存在”，也可表示“（靠……）维持生活（常见 exist on）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be real or to be present; to be alive or to continue in a certain place or situation","zh":"存在；真实存在；（人）活着；（事物）继续存在"},"examples":[{"en":"Do you think life exists on other planets?","zh":"你认为其他行星上有生命存在吗？"},{"en":"These traditions still exist in some villages.","zh":"这些传统在一些村庄里仍然存在。"},{"en":"When I moved abroad, I learned I could exist with less stuff.","zh":"我搬到国外后才发现，东西少一点我也能过下去。"}]},{"partOfSpeech":"v.","definition":{"en":"to live, especially in a difficult or basic way (often used with “on”)","zh":"（尤指艰难地）生活；维持生计（常与 on 连用）"},"examples":[{"en":"After the storm, many families existed on donated food.","zh":"暴风雨过后，许多家庭靠捐赠的食物维持生活。"},{"en":"As a student, I existed on instant noodles for weeks.","zh":"当学生时，我靠方便面撑了好几周。"}]}],"synonyms":["be","live","remain","persist","survive"],"phonetic":"/ɪɡˈzɪst/","extraExplanation":["“exust” 不是标准英语单词。最常见的可能是拼写想写 **exist**（存在）或 **exhaust**（使精疲力竭/排气）。如果你告诉我你想表达的中文意思或给我一个句子，我可以帮你确认。"]}
{"word":"exuvia","summary":{"en":"Exuvia means a shed skin or outer covering left behind after an animal molts; it can also be used figuratively for something left from an earlier stage.","zh":"Exuvia 指动物蜕皮后留下的外皮/外壳；也可引申指旧阶段的遗留痕迹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the shed outer skin (or shell) of an animal, especially an insect’s or reptile’s skin left behind after molting","zh":"（动物的）蜕皮；脱落的外皮（尤指昆虫或爬行动物蜕皮后留下的外壳/皮）"},"examples":[{"en":"We found a cicada exuvia clinging to the tree bark.","zh":"我们在树皮上发现了一只蝉蜕下的外壳。"},{"en":"The snake’s exuvia was curled up near a warm rock.","zh":"那条蛇的蜕皮蜷在一块温热的岩石旁。"}]},{"partOfSpeech":"n.","definition":{"en":"something left behind that shows a previous stage, especially in biology or figurative writing","zh":"（引申）残留物；旧阶段的遗留痕迹（常用于生物学或文学性的表达）"},"examples":[{"en":"Old habits can feel like an exuvia you’re trying to outgrow.","zh":"旧习惯有时像你想摆脱的“旧壳”。"},{"en":"In the essay, the author calls the abandoned house an exuvia of the town’s past.","zh":"在文章中，作者把那栋废弃的房子称为小镇往昔的“遗蜕”。"}]}],"synonyms":["shed skin","cast skin","molted skin","shell","remains"],"phonetic":"/ɪɡˈzuːviə/","extraExplanation":["“Exuvia”源自拉丁语，意思接近“脱下的衣服/剥下的外皮”，所以常用于描述动物蜕皮后留下的“空壳”。","复数常见两种写法：exuviae（较学术/拉丁复数）或 exuvias（英语化复数）。","在自然观察中，你可能更常听到更口语的说法：shed skin（蛇蜕皮）、cicada shell（蝉壳）。"]}
{"word":"exuviability","summary":{"en":"Exuviability means the ability or tendency to shed an outer covering (to molt).","zh":"Exuviability 指生物蜕去外层覆盖物（蜕皮/蜕壳）的能力或倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability or tendency of an organism (especially an insect or reptile) to shed its outer covering (skin, shell, or exoskeleton) during growth; capability of molting","zh":"（尤指昆虫或爬行动物）在生长过程中蜕去外层覆盖物（皮、壳或外骨骼）的能力或倾向；蜕皮/蜕壳的能力"},"examples":[{"en":"In insects, exuviability is essential because the exoskeleton cannot expand as the body grows.","zh":"在昆虫中，外骨骼无法随身体长大而扩张，因此“蜕皮能力”（exuviability）至关重要。"},{"en":"Researchers compared exuviability under different temperatures to see how climate affects molting.","zh":"研究人员比较了不同温度下的蜕皮能力，以观察气候如何影响蜕皮。"}]}],"synonyms":["molting ability","ability to molt","capacity to molt"],"phonetic":"/ɛɡˌzuːviəˈbɪləti/","extraExplanation":["这是一个非常少见、偏生物学/动物学的名词，来自拉丁语词根 exuviae（“蜕下的皮/壳；遗蜕”）。在科学写作里更常见的说法通常是 molting ability / ability to molt（蜕皮能力）。","相关词：exuviae（遗蜕，复数名词，常指昆虫蜕下的壳）；exuvial（与遗蜕有关的，形容词）；molt（蜕皮/蜕壳，动词/名词）。"]}
{"word":"exuviable","summary":{"en":"Exuviable means “able to be shed or cast off,” especially an outer skin or covering in biology.","zh":"exuviable 指“可蜕去、可脱落的”，多用于生物学语境中的外皮或外壳。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be cast off or shed (especially used for an animal’s skin, outer covering, or a plant’s outer layer).","zh":"可蜕去的；可脱落的（尤指动物的皮、外壳，或植物的外层）。"},"examples":[{"en":"Insects have an exuviable outer covering that they shed as they grow.","zh":"昆虫的外层覆盖物是可蜕去的，会随着生长而脱下。"},{"en":"The snake’s old skin is exuviable and comes off in one piece sometimes.","zh":"蛇的旧皮是可蜕去的，有时会整片脱落。"}]}],"synonyms":["shedable","cast-off","peelable","deciduous (context-dependent)"],"phonetic":"/ɪɡˈzuːviəbəl/","extraExplanation":["“exuviable”源自拉丁语 exuviae，意思是“脱下的衣物、剥落之物”，在生物学语境里常指“蜕皮/蜕壳后留下的外层”。更常见的名词是 exuviae（蜕皮、蜕壳）以及形容词 exuvial（与蜕皮相关的）。","这是非常少见的词，日常英语里通常会用 shed / cast off / peel off 来表达“脱落、蜕去”。"]}
{"word":"exuviae","summary":{"en":"Exuviae are the shed outer skins or shells of animals (especially insects after molting), and by extension can mean remnants left behind from an earlier stage.","zh":"Exuviae 指动物蜕下的皮或壳（尤指昆虫蜕皮后的外骨骼空壳），引申也可指某个阶段被遗留、被抛下的“旧物/残迹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the empty outer skin or shell that an insect, snake, or other animal has shed (especially an insect’s cast-off exoskeleton after molting)","zh":"（动物）蜕下的皮；蜕壳；（尤指昆虫蜕皮后留下的）外骨骼空壳"},"examples":[{"en":"After the cicadas emerged, exuviae clung to the tree trunks.","zh":"蝉羽化后，树干上还粘着它们的蜕壳。"},{"en":"The biologist collected dragonfly exuviae to study when the larvae had molted.","zh":"生物学家收集蜻蜓的蜕壳，用来研究幼虫何时蜕皮。"},{"en":"We found a snake’s exuviae in the grass and knew it had grown recently.","zh":"我们在草丛里发现了一条蛇的蜕皮，知道它最近长大了。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary or formal) things that are cast off or left behind; remnants of an earlier stage","zh":"（文学/正式）被抛弃或遗留之物；旧阶段的残留物"},"examples":[{"en":"He tried to shed the exuviae of his past and begin again.","zh":"他努力甩掉过去的遗留痕迹，重新开始。"},{"en":"In the attic lay the exuviae of childhood—old notebooks and worn toys.","zh":"阁楼里堆着童年的遗留物——旧笔记本和磨损的玩具。"}]}],"synonyms":["shed skin","cast skin","molt","shell","remains","remnants"],"phonetic":"/ɪɡˈzuːviˌaɪ/","extraExplanation":["“Exuviae”常见于生物学与自然观察语境，尤其指昆虫蜕皮后留下的“壳”。单数常写作“exuvia”，但在英语里“exuviae”也经常被当作一个整体来使用。","词源来自拉丁语，原意与“脱下的衣物/剥去的东西”有关，因此在文学中也可引申为“旧我/旧时代的遗留物”。"]}
{"word":"exuvial","summary":{"en":"Exuvial describes something connected to or made of a shed outer skin or shell after molting.","zh":"exuvial 指与蜕下的外皮/外壳有关的，或由其构成的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, or consisting of, a shed outer skin or shell (especially when an insect or animal molts).","zh":"与蜕下的外皮/外壳有关的；由蜕皮（蜕壳）组成的（尤指昆虫等动物蜕皮后留下的外层）。"},"examples":[{"en":"Scientists found exuvial remains of a cicada on the tree trunk.","zh":"科学家在树干上发现了蝉蜕（蜕下的外皮）遗留物。"},{"en":"The museum displayed an exuvial casing to show how insects grow.","zh":"博物馆展示了昆虫的蜕壳，以说明昆虫如何生长。"}]}],"synonyms":["molted","shed","cast-off"],"phonetic":"/ɛɡˈzuːviəl/","extraExplanation":["“exuvial”主要出现在生物学、昆虫学、动物学语境中；日常英语里更常用的相关名词是“exuviae”（蜕皮/蜕壳，复数形式）或更通俗的“shed skin”（蜕下的皮）。","词源上与拉丁语中表示“脱下衣物/剥去”的含义有关，因此常用来描述“外层被脱去后留下的东西”。"]}
{"word":"exuviate","summary":{"en":"Exuviate means to shed an outer covering (especially in zoology), and more rarely to cast off something like a covering in a literary sense.","zh":"exuviate 指（尤用于动物学）蜕去外层覆盖物；也可在文学语境中比喻“脱去/摆脱”某种外壳。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of an animal) to shed an outer covering such as skin, a shell, or an exoskeleton (for example, a snake shedding its skin).","zh":"（指动物）蜕去外层覆盖物，如皮肤、甲壳或外骨骼（例如蛇蜕皮）。"},"examples":[{"en":"Snakes exuviate several times as they grow.","zh":"蛇在生长过程中会蜕皮好几次。"},{"en":"After molting, the insect had exuviated its old exoskeleton.","zh":"蜕皮后，这只昆虫已经脱去了旧的外骨骼。"}]},{"partOfSpeech":"vt.","definition":{"en":"To strip off or cast off something like a covering (used in a formal or literary way).","zh":"（较正式/文学用法）剥去或脱去某种“覆盖物”。"},"examples":[{"en":"The poem imagines the city exuviating its winter coat of snow.","zh":"这首诗想象城市脱去冬雪织成的冬衣。"},{"en":"He tried to exuviate old habits and start fresh.","zh":"他试图摆脱旧习惯，重新开始。"}]}],"synonyms":["shed","molt","slough (off)","cast off","peel off"],"phonetic":"/ɛɡˈzuːviˌeɪt/","extraExplanation":["“exuviate”是非常偏学术/文学的词，在生物学语境里更常见。日常英语里更常用 shed（蜕/脱落）、molt（蜕皮/换毛）、slough off（脱落、摆脱）。","相关名词：exuviae（常用复数，指蜕下来的皮、壳等，如“snake exuviae”=蛇蜕皮）。词源来自拉丁语 exuviae，原意与“剥下来的外衣/战利品”有关，所以也能在文学里比喻“脱去旧的外壳”。"]}
{"word":"exuviated","summary":{"en":"Exuviated means having shed an outer layer (or having shed it). It’s a formal/scientific word often used for animals after molting or shedding.","zh":"exuviated 指“已蜕去外层（皮、羽、外骨骼等）的/已经蜕掉的”，属于较正式、偏科学的用词，常用于描述蜕皮或蜕壳后的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) having shed its outer layer (such as skin, feathers, or an exoskeleton).","zh":"（动物）已蜕去外层（如皮肤、羽毛或外骨骼）的；已蜕皮/蜕壳的。"},"examples":[{"en":"The snake was exuviated, leaving its old skin on the branch.","zh":"那条蛇已经蜕皮，把旧皮留在树枝上。"},{"en":"After molting, the crab’s exuviated shell was found near the rocks.","zh":"螃蟹蜕壳后，人们在岩石旁发现了它蜕下的空壳。"}]},{"partOfSpeech":"v.","definition":{"en":"Shed or cast off (an outer layer); past form of “exuviate.”","zh":"蜕去；脱落（外层）；“exuviate”的过去式/过去分词。"},"examples":[{"en":"The insect exuviated its old exoskeleton as it grew.","zh":"昆虫在生长过程中蜕去了旧的外骨骼。"},{"en":"By spring, the tree had exuviated much of its dead bark.","zh":"到春天时，那棵树已经脱落了不少枯死的树皮。"}]}],"synonyms":["shed","molted","cast off","sloughed"],"phonetic":"/ɛɡˈzuːviˌeɪtɪd/","extraExplanation":["“exuviated”在日常英语里很少见，更常见的说法是：snakes “shed their skin”（蛇蜕皮），insects/crabs “molt”（昆虫/螃蟹蜕壳）。在生物学或自然观察的文字里，“exuviae”常指“蜕下来的外皮/壳”。"]}
{"word":"exuviates","summary":{"en":"“Exuviates” means “sheds an outer covering (like skin or an exoskeleton),” and can also mean “casts off something old” in a formal, figurative sense.","zh":"“exuviates”意为“蜕皮/蜕壳、脱落外层覆盖物”，在正式的比喻用法中也可指“抛弃旧物或旧习”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of an insect, reptile, etc.) to shed or cast off an outer covering such as skin or an exoskeleton.","zh":"（昆虫、爬行动物等）蜕皮；脱落外层覆盖物（如皮肤或外骨骼）。"},"examples":[{"en":"The cicada exuviates as it becomes an adult, leaving an empty shell on the tree.","zh":"蝉羽化成虫时会蜕壳，把空壳留在树上。"},{"en":"Some snakes exuviate several times a year as they grow.","zh":"有些蛇在生长过程中一年会蜕皮好几次。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative, formal) to cast off something old or unwanted; to discard.","zh":"（比喻义，较正式）抛弃旧的或不再需要的东西；摒弃。"},"examples":[{"en":"Over time, he exuviates the habits that no longer help him.","zh":"随着时间推移，他逐渐摒弃那些不再有益的习惯。"},{"en":"The novel’s hero tries to exuviate a painful past and start again.","zh":"小说里的主人公试图抛开痛苦的过去，重新开始。"}]}],"synonyms":["molt","shed","slough off","cast off","discard"],"phonetic":"/ɛɡˈzuːviˌeɪts/","extraExplanation":["“exuviates”是动词“exuviate”的第三人称单数现在时（he/she/it exuviates）。","这个词常见于生物学/昆虫学语境，和“蜕皮/蜕壳”的过程相关；更常用、更日常的表达通常是“shed its skin”或“molt”。","相关名词“exuviae”指蜕下来的外壳/皮（例如蝉壳）。"]}
{"word":"exuviating","summary":{"en":"Exuviating means shedding an outer skin or shell; figuratively, it can mean casting off old habits or identities.","zh":"exuviating 指（生物）蜕皮/蜕壳；也可比喻“抛弃旧习惯或旧身份”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology) shedding an outer covering such as skin or an exoskeleton (happening now or used to describe something that does this).","zh":"（生物）正在蜕去外层覆盖物（如皮肤或外骨骼）；也可作形容词指“会蜕皮/正在蜕壳的”。"},"examples":[{"en":"The cicada nymph is exuviating, leaving its empty shell on the tree.","zh":"蝉的若虫正在蜕壳，把空壳留在树上。"},{"en":"Exuviating insects are often vulnerable right after molting.","zh":"正在蜕壳的昆虫在蜕皮后往往更脆弱。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) discarding something old—habits, roles, or beliefs—as if shedding a skin.","zh":"（比喻）像蜕皮一样抛弃旧事物（旧习惯、旧身份或旧观念）。"},"examples":[{"en":"After moving to a new city, she felt she was exuviating her old routines.","zh":"搬到新城市后，她觉得自己正在“蜕掉”旧的生活习惯。"},{"en":"The novel shows a hero exuviating fear and learning to trust others.","zh":"这部小说展现主人公“蜕去”恐惧，学会信任他人。"}]}],"synonyms":["molting","shedding","sloughing (off)","casting off"],"phonetic":"ˌɛɡˈzuːviˌeɪtɪŋ","extraExplanation":["“exuviating”来自动词 exuviate，词根与拉丁语 exuviae（脱下的衣物、动物蜕下的皮/壳）有关。学术写作里常见于昆虫学、爬行动物学等语境，用来描述“蜕皮/蜕壳”。","在文学或评论中偶尔用作比喻，强调“更新、重生、摆脱旧我”的意象；但在日常口语里更常用 shed / slough off 来表达。"]}
{"word":"exuviation","summary":{"en":"Exuviation means the process of shedding an outer covering (molting), or the shed skin/shell itself.","zh":"Exuviation 指动物等蜕皮/蜕壳的过程，也可指蜕下来的皮或壳本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of shedding an outer layer (such as skin, hair, or a shell), especially in animals; molting","zh":"（外皮、皮肤、毛发或外壳等的）脱落；蜕皮；换羽（尤指动物的蜕变过程）"},"examples":[{"en":"Snakes go through exuviation several times as they grow.","zh":"蛇在生长过程中会经历多次蜕皮。"},{"en":"Researchers recorded the timing of crab exuviation to understand its growth cycle.","zh":"研究人员记录了螃蟹蜕壳的时间，以了解其生长周期。"}]},{"partOfSpeech":"n.","definition":{"en":"something that has been shed, such as a cast-off skin or shell","zh":"脱落物；蜕下的皮或壳（如蛇蜕、蟹壳）"},"examples":[{"en":"We found the exuviation of a cicada on the tree trunk.","zh":"我们在树干上发现了蝉蜕。"},{"en":"The lab kept the insect’s exuviation for identification.","zh":"实验室保存了昆虫的蜕皮，用于鉴定。"}]}],"synonyms":["molting","shedding","ecdysis","cast skin","slough"],"phonetic":"/ɛkˌsuːviˈeɪʃən/","extraExplanation":["“Exuviation”较常见于生物学、动物学与昆虫学写作；日常英语里更常用“molting / shedding”。","词源来自拉丁语 exuviae，原意为“脱下的衣物/战利品”，后来引申为“脱落的外皮或残留物”。因此在文学或修辞中偶尔也可比喻“抛弃旧身份、旧习惯”，但这种用法不如科学语境常见。"]}
{"word":"exuvium","summary":{"en":"Exuvium means the empty outer skin or shell an invertebrate leaves behind after molting.","zh":"Exuvium 指无脊椎动物蜕皮后留下的空外皮或外壳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The shed outer skin or shell of an invertebrate (especially an insect, spider, or crustacean) after it molts; an empty “cast-off” covering.","zh":"（尤指昆虫、蜘蛛或甲壳类）蜕皮后留下的外皮/外壳；空的“蜕下物”。"},"examples":[{"en":"We found a cicada exuvium clinging to the tree bark.","zh":"我们发现一只蝉的蜕壳紧紧附在树皮上。"},{"en":"The lab collected mosquito exuviae to confirm that larvae had successfully molted.","zh":"实验室收集蚊子的蜕皮残留物，以确认幼虫已成功蜕皮。"}]}],"synonyms":["shed skin","molted skin","cast skin","shell (left behind)","exoskeleton (cast)"],"phonetic":"/ɪɡˈzuːviəm/","extraExplanation":["“Exuvium”来自拉丁语，原意与“脱下的衣物/剥下的东西”相关，因此常被形象地理解为动物“换下来的外衣”。","科学写作里也常见复数形式“exuviae”（读音大致为 /ɪɡˈzuːviˌaɪ/），尤其在昆虫学、生态学、法医昆虫学中常用来指一堆蜕壳样本。"]}

