{"word":"exxon","summary":{"en":"Exxon is best known as the brand name of a major U.S. oil-and-gas company (Exxon Mobil), and sometimes refers to its gasoline.","zh":"Exxon通常指美国大型油气公司埃克森美孚的品牌名，也可引申指其品牌汽油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large American oil-and-gas company; the brand name most commonly associated with Exxon Mobil Corporation","zh":"埃克森（美国大型石油与天然气公司；常指埃克森美孚公司的品牌名）"},"examples":[{"en":"Exxon is one of the world’s largest energy companies.","zh":"埃克森是全球最大的能源公司之一。"},{"en":"He works at an Exxon refinery on the Gulf Coast.","zh":"他在墨西哥湾沿岸的一家埃克森炼油厂工作。"},{"en":"The report discussed Exxon’s investments in new energy projects.","zh":"这份报告讨论了埃克森在新能源项目上的投资。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) gasoline sold under the Exxon brand, especially at an Exxon gas station","zh":"（引申）埃克森品牌的汽油（尤指在埃克森加油站销售的汽油）"},"examples":[{"en":"Let’s stop for Exxon gas if there’s a station nearby.","zh":"如果附近有埃克森加油站，我们就去加埃克森的油。"},{"en":"This car runs fine on regular Exxon gasoline.","zh":"这辆车加普通标号的埃克森汽油也跑得很好。"}]}],"synonyms":["Exxon Mobil","ExxonMobil","Esso (related brand in some countries)"],"phonetic":"/ˈɛk.sɑn/","extraExplanation":["“Exxon”原本是Esso（Standard Oil的旧品牌名）的替代商标之一；后来随着公司重组与合并，形成了今天常见的“Exxon Mobil（埃克森美孚）”。在英文新闻里，Exxon常被当作公司或品牌的简称使用。"]}
{"word":"ExxonMobil","summary":{"en":"ExxonMobil is a major U.S. multinational energy company in the oil and gas industry.","zh":"ExxonMobil（埃克森美孚）是美国大型跨国石油天然气能源公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large American multinational energy company (oil and gas), known for producing and selling petroleum products and petrochemicals.","zh":"埃克森美孚：美国大型跨国能源公司（石油与天然气），以生产与销售石油产品和石化产品而闻名。"},"examples":[{"en":"ExxonMobil is one of the world’s largest publicly traded energy companies.","zh":"埃克森美孚是世界上最大的上市能源公司之一。"},{"en":"The report discusses ExxonMobil’s plans for carbon capture and emissions reductions.","zh":"这份报告讨论了埃克森美孚关于碳捕集与减排的计划。"},{"en":"Oil prices can affect companies like ExxonMobil in significant ways.","zh":"油价会以显著方式影响埃克森美孚这样的公司。"}]}],"synonyms":["Exxon","Mobil","oil major","energy company"],"phonetic":"/ˌɛk.sɑnˈmoʊ.bəl/","extraExplanation":["“ExxonMobil”来自两家公司的合并：Exxon（埃克森，源自 Standard Oil 的后继公司之一）与 Mobil（美孚）。1999 年两者合并后形成现名。","作为公司名称，英语里通常首字母大写；新闻与商业语境中常与 “oil major（石油巨头）”“energy company（能源公司）”等词搭配出现。","在公共讨论中，它也常出现在能源转型、气候政策、石油勘探与炼化产业等话题里；阅读新闻时可留意其与 “renewables（可再生能源）”“carbon capture（碳捕集）”等词的共现。"]}

