{"word":"ey","summary":{"en":"“Ey” is an informal attention-getter like “hey,” and in some dialects it can mean “yes” (like “aye).”","zh":"“ey”多用于非正式口语，类似“hey（嗨/喂）”；在某些方言中也可表示“是的”（相当于“aye”）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(informal) A casual way to get someone’s attention or show recognition; similar to “hey.”","zh":"（非正式）用来引起别人注意或表示认出对方的招呼语；相当于“hey（嗨/喂）”。"},"examples":[{"en":"Ey, can you help me for a second?","zh":"喂，你能帮我一下吗？"},{"en":"Ey! Long time no see.","zh":"嗨！好久不见。"}]},{"partOfSpeech":"other","definition":{"en":"(dialect, informal) A variant spelling/pronunciation of “aye,” meaning “yes,” especially in some Scottish or Northern English contexts.","zh":"（方言，非正式）“aye”的变体写法/读法，意思是“是的”，常见于苏格兰或英格兰北部语境。"},"examples":[{"en":"“You ready?” “Ey.”","zh":"“你准备好了吗？”“嗯/是的。”"}]}],"synonyms":["hey","hi","yo","aye","yeah"],"phonetic":"/eɪ/","extraExplanation":["“ey”在标准英语里不算常见拼写；更多出现在口语化写法、网络对话、方言对白或文学作品的拟声/拟口语中。正式写作一般用“hey”或“yes/yeah/aye”。"]}
{"word":"eyah","summary":{"en":"“Eyah” is a nonstandard spelling, usually meaning “yeah” (yes/agreement) or an exclamation depending on context.","zh":"“Eyah”是非标准拼写，通常相当于“yeah”（表示是/同意），也可能作感叹词，具体看语境。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(nonstandard spelling) “yeah”; used informally to mean “yes” or to show agreement.","zh":"（非标准拼写）“yeah”的写法；口语中表示“是/对”，或表示同意。"},"examples":[{"en":"—Are you coming tonight? —Eyah, I’ll be there.","zh":"——你今晚来吗？——Eyah，我会去的。"},{"en":"Eyah, that makes sense.","zh":"Eyah，那很有道理。"}]},{"partOfSpeech":"int.","definition":{"en":"(nonstandard spelling) An exclamation showing mild surprise, annoyance, or emphasis (often influenced by other languages or dialect spellings).","zh":"（非标准拼写）用于表示轻微惊讶、无奈、烦恼或强调的感叹（常受其他语言或方言拼写影响）。"},"examples":[{"en":"Eyah! I forgot my keys again.","zh":"Eyah！我又忘带钥匙了。"},{"en":"Eyah, this is harder than I thought.","zh":"Eyah，这比我想的难。"}]}],"synonyms":["yeah","yes","yep","uh-huh"],"phonetic":"/jɛə/","extraExplanation":["“eyah”不是常见的标准英语拼写。很多时候它只是把“yeah”随意写出来（尤其在聊天、评论区）。","在一些英语使用环境里（例如受多语言影响的口语/网络表达），人们也会用类似“eyah/aiyah/ayiah”的写法来表达“哎呀/唉”的语气；具体含义要看上下文和说话者背景。","如果你想写得更标准：表示“是/对”通常写“yeah”（更口语）或“yes”（更正式）。"]}
{"word":"eyalet","summary":{"en":"Eyalet most commonly corresponds to English “state” (an administrative region, especially a U.S. state).","zh":"“eyalet”在英文里最常对应“state”，表示行政区划（尤指美国的“州”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political region that is part of a country (especially one of the U.S. states); similar to a province","zh":"（国家内的）行政区划；（尤指）美国的“州”；类似“省/自治区”"},"examples":[{"en":"California is a state on the west coast of the United States.","zh":"加利福尼亚是美国西海岸的一个州。"},{"en":"Some countries use provinces instead of states.","zh":"有些国家用“省”而不是“州”来划分行政区。"}]},{"partOfSpeech":"n.","definition":{"en":"the condition or situation that someone or something is in","zh":"（人或事物的）状态，情况"},"examples":[{"en":"The roads are in a bad state after the storm.","zh":"暴风雨过后，道路状况很糟。"},{"en":"She was in a state of shock.","zh":"她处于震惊状态。"}]},{"partOfSpeech":"vt.","definition":{"en":"to say or write something clearly and officially","zh":"陈述；说明（尤指正式、清楚地表达）"},"examples":[{"en":"Please state your name and address.","zh":"请陈述你的姓名和地址。"},{"en":"The report states that prices will rise next year.","zh":"报告指出明年价格将上涨。"}]}],"synonyms":["province","region","territory"],"phonetic":"/steɪt/","extraExplanation":["“eyalet”是土耳其语，最常见对应英文是 state（美国“州”）或 province（省/行省）。在英语里说“the State”有时也指“国家/政府”（如：the welfare state），但日常谈行政区多用 a state（一个州）。","文化小提示：美国的“state（州）”拥有一定自治权（自己的州政府、州法等），这和一些国家的“省”在权力结构上可能不完全相同。"]}
{"word":"eyas","summary":{"en":"Eyas means a young hawk/falcon (often in falconry), and figuratively a novice or immature person.","zh":"Eyas 指幼鹰/雏隼（常见于训鹰语境），也可比喻“新手、未成熟的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young hawk or falcon, especially one taken from the nest for training (falconry)","zh":"（尤指用于训练的）幼鹰；雏隼（常指从巢中取来的）"},"examples":[{"en":"The falconer raised an eyas to become a hunting bird.","zh":"训鹰人养了一只雏隼，把它训练成猎鸟。"},{"en":"An eyas can be easier to train because it grows up around people.","zh":"雏鸟在人的环境中长大，往往更容易训练。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) an inexperienced or immature person; a novice","zh":"（比喻）缺乏经验的人；新手"},"examples":[{"en":"He was still an eyas in the company, learning the basics.","zh":"他在公司里还是个新手，正在学习基础。"},{"en":"She stopped acting like an eyas and took responsibility.","zh":"她不再像个毛头小子那样行事，而是开始承担责任。"}]}],"synonyms":["nestling","chick","fledgling","novice","beginner","greenhorn"],"phonetic":"/ˈeɪəs/","extraExplanation":["“eyas”是一个较文学、较古典的词，常见于与训鹰术（falconry）有关的语境。在日常现代英语里，更常用的说法是“young hawk/falcon”“chick”“nestling”。","词源上与“巢中的雏鸟/幼鸟”这一概念有关，因此引申出“新手、未成熟的人”的比喻义。","莎士比亚《麦克白》（Macbeth）中有著名的比喻：\"We but teach bloody instructions, which being taught return to plague the inventor...\" 同段落里出现过“like the poor cat i' the adage”以及“the poor wren, the most diminutive of birds, will fight…”等鸟类意象；而“eyas”本身也常在古典文学里用来暗示“年幼、尚未定型”。"]}
{"word":"eyases","summary":{"en":"“Eyases” is the plural of “eyas,” meaning a young hawk or falcon.","zh":"“eyases”是“eyas”的复数，指鹰或隼的幼鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young hawk or falcon (a nestling); the plural form is often written as “eyases.”","zh":"（鹰或隼的）幼鸟；常见复数写作“eyases”。"},"examples":[{"en":"The falconer checked the eyas in the nest to be sure it was healthy.","zh":"训鹰师查看巢里的幼隼，确保它健康。"},{"en":"In spring, the cliffs are home to eyases learning to flap their wings.","zh":"春天，悬崖上常有正在学着拍翅的幼鹰/幼隼。"}]}],"synonyms":["young hawk","young falcon","nestling","chick"],"phonetic":"/ˈaɪ.əs/","extraExplanation":["“eyas”是较少见、偏文学或训鹰（falconry）语境的词，日常英语更常说“young hawk/falcon”或“chick”。","文学中较有名的例子出现在莎士比亚《哈姆雷特》（Hamlet）里提到“little eyases”，用来比喻“年纪很小、但很抢眼的孩子/演员”。"]}
{"word":"eyass","summary":{"en":"An eyass is a young hawk, often referring to one taken from the nest for falconry.","zh":"eyass 指幼鹰，常特指为驯鹰而从巢中取出的幼隼/幼鹰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young hawk (especially one taken from the nest and not yet fully trained in falconry)","zh":"幼鹰；（尤指从巢中取出的、尚未训练好的）幼隼"},"examples":[{"en":"The falconer raised an eyass until it was strong enough to fly.","zh":"驯鹰人养育这只幼隼，直到它强壮到可以飞翔。"},{"en":"In the old tale, an eyass was taken from the cliff-side nest.","zh":"在那则古老的故事里，人们从悬崖边的巢里取走了一只幼鹰。"}]}],"synonyms":["young hawk","nestling","fledgling (general)"],"phonetic":"/ˈaɪ.əs/","extraExplanation":["“eyass”多见于较古老或文学性的英语，尤其与中世纪的驯鹰术（falconry）语境相关。现代日常英语里更常说“young hawk / fledgling hawk（幼鹰）”。","词源上与“nestling（巢雏）/ young bird（幼鸟）”这类概念接近；在莎士比亚等早期文学中偶尔出现，用来带出一种古典或猎鹰文化的氛围。"]}
{"word":"eydent","summary":{"en":"“Evident” means clear and obvious—easy to see or understand.","zh":"“evident”表示“明显的、显而易见的”，容易看出或理解。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Easy to see, notice, or understand; clear and obvious.","zh":"明显的；显而易见的；容易看出或理解的。"},"examples":[{"en":"It was evident that she was tired after the long trip.","zh":"长途旅行后，她显然很累。"},{"en":"From his smile, it was evident he was happy with the results.","zh":"从他的笑容可以看出，他对结果很满意。"},{"en":"The difference between the two photos is evident.","zh":"这两张照片的差别很明显。"}]}],"synonyms":["obvious","clear","apparent","plain","noticeable"],"phonetic":"/ˈɛvɪdənt/","extraExplanation":["你输入的“eydent”很可能是拼写错误；常见正确拼写是 **evident**。","**evident** 常与从句搭配：**It is evident that + 从句**（“很明显……”）；也常与介词短语搭配：**be evident in/from**（“在……中明显/从……可以看出”）。"]}
{"word":"eye","summary":{"en":"Eye mainly means the organ for seeing, and it can also mean attention (“keep an eye on”) or the ability to notice quality (“an eye for detail”). As a verb, it means to look at something carefully or with interest.","zh":"Eye 主要指“眼睛”这一视觉器官，也可指“注意/监视”（keep an eye on）或“眼光/鉴赏力”（an eye for detail）。作动词时表示“仔细地看/打量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The organ you use to see; one of the two round parts on your face that detect light and form images.","zh":"眼睛；用来看东西的器官（脸上两只用于感光成像的部位）。"},"examples":[{"en":"She has brown eyes.","zh":"她有一双棕色的眼睛。"},{"en":"Keep your eyes on the road.","zh":"把眼睛盯着路面。"}]},{"partOfSpeech":"n.","definition":{"en":"The ability to notice or judge things well (often used in the phrase “an eye for”).","zh":"眼光；鉴赏/识别的能力（常用于“an eye for …”）。"},"examples":[{"en":"He has an eye for detail.","zh":"他很有看细节的眼光。"},{"en":"She has an eye for modern design.","zh":"她对现代设计很有鉴赏力。"}]},{"partOfSpeech":"n.","definition":{"en":"Attention or watchful observation (often used in “keep an eye on”).","zh":"注意；监视/留意（常用于“keep an eye on”）。"},"examples":[{"en":"Could you keep an eye on my bag for a minute?","zh":"你能帮我看一下我的包吗？"},{"en":"The teacher kept a close eye on the class during the test.","zh":"考试时老师密切关注着全班。"}]},{"partOfSpeech":"vt.","definition":{"en":"To look at something, especially with interest, desire, or careful attention.","zh":"注视；打量（尤指带着兴趣、渴望或谨慎地看）。"},"examples":[{"en":"She eyed the last cookie on the plate.","zh":"她盯着盘子里最后一块饼干。"},{"en":"He eyed the door, ready to leave.","zh":"他盯着门口，准备离开。"}]}],"synonyms":["sight","vision","gaze","look","watch","observe"],"phonetic":"/aɪ/","extraExplanation":["“eye”在英语里非常常用，很多固定搭配与“注意/监视”有关：keep an eye on（照看/留意）、catch someone’s eye（吸引某人的注意）、in the public eye（在公众视野中）。","文学与文化里，“eye”常象征“洞察、真相或灵魂的窗口”。常见说法是“the eyes are the windows to the soul”（眼睛是心灵的窗户）。"]}
{"word":"eyeable","summary":{"en":"Eyeable means “easy to see; visually noticeable,” and it’s an uncommon, informal adjective.","zh":"Eyeable 指“容易看见、很显眼”，属于不太常见、偏口语/文案风格的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be seen, noticed, or caught by the eye; visually noticeable.","zh":"能被看见的；显眼的；引人注目的。"},"examples":[{"en":"The bright red button is more eyeable than the gray one.","zh":"亮红色按钮比灰色的更显眼。"},{"en":"From the balcony, the ocean was clearly eyeable on a sunny day.","zh":"在阳光明媚的日子里，从阳台上能清楚看见大海。"},{"en":"Try to keep important warnings in a large, eyeable font.","zh":"尽量把重要警告用更大、醒目的字体显示。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be watched or judged with the eyes; visually assessable (less common).","zh":"可通过目测观察或评估的（较少见）。"},"examples":[{"en":"Some quality issues are not eyeable and require testing.","zh":"有些质量问题无法靠目测发现，需要检测。"},{"en":"The damage wasn’t eyeable until we looked closely under the light.","zh":"在灯光下仔细看之前，损伤并不明显可见。"}]}],"synonyms":["visible","noticeable","easy to see","clear","conspicuous","eye-catching"],"phonetic":"/ˈaɪəbəl/","extraExplanation":["“eyeable”不是非常常见的标准词，更常用的是“visible / noticeable / easy to see”。它偶尔出现在广告文案、设计/用户体验（UX）讨论或口语化写作里，用来强调“对眼睛来说更容易看到/更吸睛”。如果写正式英语，通常建议改用更常见的表达。"]}
{"word":"eyeball","summary":{"en":"“Eyeball” is a noun meaning the round part of your eye, and a verb meaning to look at something closely or to estimate by looking.","zh":"“Eyeball”作名词指“眼球”；作动词可指“仔细打量/盯着看”，也可指“目测估算”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the eyeball: the round part of the eye inside the eyelids that you see and that helps you see","zh":"眼球：眼睛里圆圆的部分，在眼睑内可见，负责视觉功能"},"examples":[{"en":"The doctor examined his eyeball with a bright light.","zh":"医生用强光检查了他的眼球。"},{"en":"Dust got into my eyeball, so it started to hurt.","zh":"灰尘进了我的眼球，所以开始疼。"}]},{"partOfSpeech":"v.","definition":{"en":"to look at someone or something carefully (often in an informal way)","zh":"（非正式）仔细打量、认真查看某人或某物"},"examples":[{"en":"She eyeballed the menu for a long time before ordering.","zh":"她盯着菜单看了很久才点餐。"},{"en":"He eyeballed the new coworker, trying to remember her name.","zh":"他打量着新同事，想起她的名字。"}]},{"partOfSpeech":"v.","definition":{"en":"to estimate something by looking, not by measuring exactly","zh":"目测估算：不精确测量，仅凭目测估计"},"examples":[{"en":"I didn’t measure the rice—I just eyeballed it.","zh":"我没量米，只是目测抓了一些。"},{"en":"You can eyeball the distance, but a tape measure is more accurate.","zh":"你可以目测距离，但卷尺更准确。"}]}],"synonyms":["eye (noun)","stare at","look over","check out","size up","estimate"],"phonetic":"/ˈaɪˌbɔl/","extraExplanation":["“eyeball”作动词在美式英语口语里很常见：既可以表示“打量/盯着看”，也常用于厨房、手工、设计等场景表示“凭感觉估个大概”（= estimate by eye）。","语气提示：动词eyeball在描述“盯着某人看”时，可能带一点评估、怀疑或不太友好的感觉；在“目测估算”时则更中性。"]}
{"word":"eyeballed","summary":{"en":"“Eyeballed” means either (1) roughly estimate by looking, or (2) stare at someone/something often with suspicion or challenge.","zh":"“Eyeballed”可指（1）凭目测粗略估算；（2）盯着看，常带怀疑或挑衅/不满的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to look at something quickly or roughly, often to estimate size, amount, or value without measuring exactly","zh":"粗略地看一眼；凭目测估算（不精确测量）"},"examples":[{"en":"I eyeballed the distance and guessed it was about a mile.","zh":"我目测了一下距离，猜大约有一英里。"},{"en":"She eyeballed the ingredients instead of using measuring cups.","zh":"她没用量杯，而是凭目测放了食材。"},{"en":"Can you eyeball the price of this used laptop?","zh":"你能凭经验估一下这台二手笔记本的价格吗？"}]},{"partOfSpeech":"v.","definition":{"en":"to stare at someone or something, often in a way that feels challenging, suspicious, or disapproving","zh":"盯着看（常带挑衅、怀疑或不赞同的意味）"},"examples":[{"en":"The security guard eyeballed him as he walked in.","zh":"保安盯着他看着他走进来。"},{"en":"He felt the other team eyeballing him after the foul.","zh":"犯规之后，他感觉对方队员在盯着他看。"}]}],"synonyms":["estimated","gauged","sized up","stared at","glared at","watched closely"],"phonetic":"/ˈaɪˌbɔld/","extraExplanation":["“Eyeballed”是动词“eyeball”的过去式/过去分词。口语里很常见，尤其在做菜、手工、装修、估价等场景中表示“不量就大概估一下”。","语气提示：表示“估算”时通常中性；表示“盯着看”时带一点压力或不友善的感觉。","常见搭配：eyeball it（凭目测估一下）；eyeball the numbers/cost/distance（估算数字/成本/距离）；give someone the eyeball（口语：用怀疑或不满的眼神打量某人）。"]}
{"word":"eyeballing","summary":{"en":"Eyeballing means either looking at something/someone closely or estimating by sight without measuring.","zh":"Eyeballing 指“仔细打量”，也可指“不测量、只凭目测来估算”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"looking at someone or something carefully (often in an obvious or slightly suspicious way)","zh":"仔细打量（常指很明显地、甚至带点怀疑或挑剔地看）"},"examples":[{"en":"The security guard was eyeballing everyone who walked in.","zh":"保安在打量每一个走进来的人。"},{"en":"She noticed the interviewer eyeballing her résumé.","zh":"她注意到面试官在仔细看她的简历。"}]},{"partOfSpeech":"v.","definition":{"en":"estimating a size, distance, amount, or value just by looking, without measuring","zh":"目测估算（不测量，只凭看来估计尺寸、距离、数量或价值）"},"examples":[{"en":"I was just eyeballing the distance—it’s about two miles.","zh":"我只是目测了一下距离——大概两英里。"},{"en":"Eyeballing the ingredients is fine for soup, but baking needs exact measurements.","zh":"做汤凭感觉放料没问题，但烘焙需要精确用量。"},{"en":"The mechanic was eyeballing the damage before giving an estimate.","zh":"修理工先目测损坏情况，再给出报价。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of judging something by sight rather than by exact measurement (informal)","zh":"目测判断；凭目测做估计（非正式）"},"examples":[{"en":"A quick eyeballing told me the desk wouldn’t fit through the door.","zh":"我快速目测了一下，就知道那张桌子过不了门。"},{"en":"We did some rough eyeballing before we started measuring.","zh":"我们先粗略目测了一下，然后才开始测量。"}]}],"synonyms":["looking over","checking out","sizing up","staring at","guesstimating","estimating","judging by eye"],"phonetic":"ˈaɪˌbɔlɪŋ","extraExplanation":["“eyeballing”来自动词短语“to eyeball”，在口语和非正式写作中很常见。它既可以表示“盯着看/打量”，也可以表示“目测估算”。","在职场或购物语境里，常用“to eyeball a price/figure”表示“粗估一个价格/数字”；在运动或装修语境里，常用来表示“凭眼睛判断距离或尺寸”。","语气提示：用来形容“打量别人”时，有时会带一点不友好或让人不舒服的感觉；如果只是“目测估算”，语气通常中性。"]}
{"word":"eyeballs","summary":{"en":"“Eyeballs” usually means eyes (informal), and it can also mean people’s attention or viewership in media/marketing.","zh":"“Eyeballs”通常指眼睛（较口语），也可指媒体/营销语境中的关注度或观看量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The round organs in your head that you use to see; the eyes (often used informally).","zh":"眼球；眼睛（常为口语/非正式用法）"},"examples":[{"en":"Keep your eyeballs on the road while you’re driving.","zh":"开车时眼睛要盯着路。"},{"en":"My eyeballs are tired from staring at the screen all day.","zh":"我盯着屏幕看了一整天，眼睛都累了。"}]},{"partOfSpeech":"n.","definition":{"en":"People’s attention or viewership (common in marketing, media, and social media).","zh":"关注度；观看量（常用于营销、媒体和社交平台语境）"},"examples":[{"en":"This headline is designed to get more eyeballs on the article.","zh":"这个标题是为了吸引更多人点进来看这篇文章。"},{"en":"The brand paid for ads to bring more eyeballs to the new product page.","zh":"这个品牌投放广告，为了让更多人看到新产品页面。"}]}],"synonyms":["eyes","watchers","viewers","attention"],"phonetic":"/ˈaɪˌbɔlz/","extraExplanation":["“eyeballs”作“关注度/观看量”时，是一种比喻：把“眼睛看向哪里”延伸为“有多少人正在看”。在商业语境里很常见，但在正式学术写作中可能显得过于口语。","单数是“eyeball”。在口语中也会说“all eyeballs on…”表示“所有人都把注意力集中在……上”。"]}
{"word":"eyebalm","summary":{"en":"“Eyebalm” (more often written “eye balm”) usually means a soothing eye-area skincare balm; informally it can also mean something pleasing to look at.","zh":"“eyebalm”（更常写作“eye balm”）通常指用于眼周的舒缓滋润型护肤膏；口语里也可指赏心悦目的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a skincare product (usually a thick cream or ointment) applied around the eyes to moisturize and soothe the delicate skin there, often to reduce dryness or puffiness","zh":"眼部护理膏／眼霜（通常较厚的乳霜或膏状产品），涂在眼周用来保湿、舒缓娇嫩肌肤，常用于缓解干燥或浮肿"},"examples":[{"en":"I use an eye balm at night because the skin around my eyes gets dry in winter.","zh":"我晚上会用眼部护理膏，因为冬天眼周皮肤容易干。"},{"en":"This eye balm feels soothing after a long day of staring at screens.","zh":"盯了一整天屏幕后，这款眼部护理膏用起来很舒缓。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, playful) something that is very pleasant or comforting to look at; a “balm for the eyes”","zh":"（非正式、带玩笑意味）赏心悦目的东西；“看着就舒服”的事物"},"examples":[{"en":"After weeks of gray weather, the spring flowers were real eyebalm.","zh":"连着几周阴沉天气后，春天的花真是赏心悦目。"},{"en":"Her clean, simple design is eyebalm compared with the cluttered old layout.","zh":"和以前杂乱的版面比起来，她简洁清爽的设计看着特别舒服。"}]}],"synonyms":["eye balm","eye cream","eye ointment","under-eye balm","(figurative) eye candy","a balm for the eyes"],"phonetic":"/ˈaɪ ˌbɑːm/","extraExplanation":["“eyebalm”更常见的写法是分开写作 **eye balm**（产品包装与电商页面也多用这种写法）。","字面上是“给眼睛/眼周的膏”，所以在护肤语境里通常指眼周用的膏/霜；比起“eye cream”，**balm**更强调“膏状、滋润、舒缓”的感觉。","比喻义属于比较新、偏口语化的用法，常借用 **balm**（“慰藉、舒缓”）的概念，表达“看着就被治愈/舒服”。"]}
{"word":"eyebar","summary":{"en":"An eyebar is a steel bar with an eye-shaped end used to connect by a pin and carry tension, especially in bridges.","zh":"Eyebar 指带“眼”端部、用销轴连接并承受拉力的钢杆件，常见于桥梁等结构工程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A metal bar (usually steel) with a hole or loop (“eye”) at one or both ends, used to connect to a pin and carry tension (pulling force), especially in bridges and heavy structures.","zh":"（通常为钢制的）眼杆；两端（或一端）带“眼”（孔/环）的金属杆件，用销轴连接并承受拉力，常用于桥梁等大型结构。"},"examples":[{"en":"The engineer inspected the bridge’s eyebars for cracks.","zh":"工程师检查了桥梁眼杆是否有裂纹。"},{"en":"Each eyebar connects to the joint with a large pin.","zh":"每根眼杆都通过一个大销轴连接到接头处。"},{"en":"Older suspension bridges sometimes used eyebars as tension members.","zh":"较早期的悬索桥有时会用眼杆作为受拉构件。"}]},{"partOfSpeech":"n.","definition":{"en":"A small, flat bar placed at an eyelet or hole to reinforce it, especially in leatherwork or textiles (less common).","zh":"（较少见）眼条；用于加固孔眼/鸡眼处的小扁条，常见于皮革或纺织加工。"},"examples":[{"en":"The leather strap was strengthened with an eyebar near the eyelet.","zh":"这条皮带在孔眼附近加了眼条进行加固。"}]}],"synonyms":["tie bar","tension link","steel link","tension member"],"phonetic":"/ˈaɪˌbɑr/","extraExplanation":["“Eyebar”主要是工程/结构领域用词，日常英语里不常见；更常见的是说“tension member（受拉构件）”“steel link（钢连接件）”。","在桥梁史中，eyebar 常与“pin connection（销接）”一起出现：眼杆端部的“eye”套在销轴上，从而把拉力传递到节点。美国一些早期大型桥梁（如部分悬索桥）曾大量使用。"]}
{"word":"eyebath","summary":{"en":"An eyebath is a small cup/device used to rinse the eye with a liquid.","zh":"Eyebath 指用于用液体冲洗眼睛的小杯或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cup or device used to rinse or bathe the eye with a liquid (often saline or an eye-wash solution)","zh":"洗眼杯；洗眼器（用盐水或洗眼液冲洗、浸洗眼睛的小杯或装置）"},"examples":[{"en":"The pharmacist showed me how to use an eyebath to rinse out dust.","zh":"药剂师教我怎么用洗眼杯把灰尘冲出来。"},{"en":"Use a clean eyebath with sterile saline, and don’t share it with others.","zh":"用干净的洗眼杯配合无菌生理盐水，不要与他人共用。"}]}],"synonyms":["eye wash","eye cup","eye bath (variant spelling)"],"phonetic":"/ˈaɪˌbæθ/","extraExplanation":["在日常英语里，\"eyebath\"相对不算常见；更常见的说法是 \"eye wash\"（洗眼液/冲洗）或 \"eye cup\"（洗眼杯）。","医疗与安全语境中会提到它：用于冲走异物或刺激物（如灰尘、轻微化学刺激）。如果是化学品溅入眼睛，英语里更常见的指令是 \"flush your eyes\" / \"rinse your eyes\"（立刻大量冲洗），并尽快就医。"]}
{"word":"eyebeam","summary":{"en":"Eyebeam means an imagined beam of light from the eyes, or more commonly a strong, expressive look; in sci‑fi it can mean an eye laser.","zh":"Eyebeam 指想象中从眼睛射出的光束；更常见地指带强烈情感的目光；在科幻中也可指“眼部激光”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ray or beam of light imagined as coming from a person’s eyes (often poetic or humorous).","zh":"（常见于诗歌或幽默语境）想象中从眼睛射出的光束。"},"examples":[{"en":"In the poem, her eyebeams brighten the dark room.","zh":"在诗里，她的眼中光芒照亮了黑暗的房间。"},{"en":"He joked that his eyebeams could scare the cat off the table.","zh":"他开玩笑说自己的“眼睛光束”能把猫从桌子上吓下去。"}]},{"partOfSpeech":"n.","definition":{"en":"a look or glance, especially one showing strong feeling (like love, anger, or approval).","zh":"（带有强烈情感的）目光；一瞥（如爱意、怒意或赞许）。"},"examples":[{"en":"She sent him a warm eyebeam across the crowded room.","zh":"在人群拥挤的房间里，她向他投去温暖的目光。"},{"en":"The teacher’s stern eyebeam told us to quiet down.","zh":"老师严厉的目光示意我们安静。"}]},{"partOfSpeech":"n.","definition":{"en":"(in comics, games, and sci‑fi) a laser-like beam shot from the eyes as a superpower.","zh":"（漫画/游戏/科幻中）从眼睛发射的激光束式“超能力”。"},"examples":[{"en":"The villain fired an eyebeam that sliced through the metal door.","zh":"反派发出眼部激光，切开了金属门。"},{"en":"His character can shoot eyebeams after powering up.","zh":"他的角色在蓄力后可以发射眼部激光。"}]}],"synonyms":["look","glance","gaze","stare","beam (of light)"],"phonetic":"/ˈaɪˌbiːm/","extraExplanation":["“eyebeam”比较少见，更多出现在文学描写（把目光写得像光一样）或流行文化（超级英雄/科幻的“眼部激光”）。日常英语里更常用的说法是：a look, a glance, a gaze。","在文学里，常见搭配有“bright eyebeams / loving eyebeams”，把情感通过“光”的意象表达出来。"]}
{"word":"eyebeams","summary":{"en":"Eyebeams means “gazes” in a poetic way—suggesting beams or rays from someone’s eyes.","zh":"Eyebeams 指“目光/凝视”，多为文学化表达，带有“眼中射出光束”的意象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) A person’s gaze or the light/energy suggested by their eyes; a literary way to describe how someone looks at someone or something.","zh":"（复数）目光；（文学用语）用来形容从眼睛“射出”的光或力量，指一个人看向他人/事物时的视线与情感。"},"examples":[{"en":"He felt her eyebeams on him across the room.","zh":"他在房间另一头也能感觉到她的目光落在自己身上。"},{"en":"The hero’s eyebeams were described as bright with hope.","zh":"书中描写英雄的目光明亮，充满希望。"},{"en":"She avoided his eyebeams and stared at the floor.","zh":"她躲开他的目光，低头盯着地板。"}]},{"partOfSpeech":"n.","definition":{"en":"(poetic/old-fashioned) Imaginary “rays” thought to come out from the eyes, used to create a vivid, dramatic image.","zh":"（诗歌/古旧用法）想象中从眼睛射出的“光线/射线”，用来营造生动、戏剧性的画面感。"},"examples":[{"en":"In the poem, her eyebeams could soften even angry hearts.","zh":"在诗里，她的“眼光”甚至能软化愤怒的心。"},{"en":"The villain’s eyebeams were said to burn like fire.","zh":"文中说反派的目光像火一样灼人。"}]}],"synonyms":["gaze","look","stare","glance","eyes"],"phonetic":"/ˈaɪˌbiːmz/","extraExplanation":["“eyebeams”常见于文学或较古典的英语里。早期欧洲有一种观念叫“视觉外射说”（认为眼睛会发出光线去“触碰”所看之物），因此会用“beam（光束）”来比喻目光。现代英语日常更常用 gaze / look / stare。"]}
{"word":"eyeberry","summary":{"en":"“Eyeberry” is a regional word for a bilberry/blueberry-type berry, especially in parts of Scotland and Northern England.","zh":"“Eyeberry”是一个地区性词汇，指越橘/蓝莓一类的小浆果，尤见于苏格兰和英格兰北部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Regional, chiefly Scotland & Northern England) A bilberry or blueberry; a small dark-blue edible berry.","zh":"（方言，多见于苏格兰与英格兰北部）越橘/欧洲越橘（bilberry）或蓝莓一类的浆果；一种可食用的深蓝色小浆果。"},"examples":[{"en":"In late summer, people went to the hills to pick eyeberries for jam.","zh":"夏末时，人们会上山采眼莓（eyeberries）做果酱。"},{"en":"The pie was filled with eyeberries and a little sugar.","zh":"这款派里装满了眼莓（eyeberries）和一点糖。"}]}],"synonyms":["bilberry","blueberry","whortleberry"],"phonetic":"/ˈaɪˌbɛri/","extraExplanation":["“eyeberry”并不是现代标准英语里常见的词，更常见的是 bilberry（欧洲越橘）或 blueberry（蓝莓）。在一些苏格兰/英格兰北部的方言与民间说法中，“eyeberry”可用来指野生的越橘类小果。","不同地区对越橘属（Vaccinium）浆果的叫法可能混用：bilberry 往往指欧洲常见的野生小果（果肉也偏紫），blueberry 常指北美常见的栽培蓝莓（果肉多偏浅色）。在阅读地方故事、民俗文本或旅行记时更可能遇到 “eyeberry”。"]}
{"word":"eyeblack","summary":{"en":"Eyeblack is a dark mark under the eyes, worn mainly by athletes to reduce glare and create a focused game-day look.","zh":"Eyeblack 指眼下的黑色涂抹或贴条，多见于运动员，用来减少眩光，也常带有营造专注“比赛状态”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dark grease or sticker put under the eyes (usually by athletes) to reduce glare from sunlight or bright stadium lights.","zh":"（运动员常用的）眼下黑色油膏或贴条，用来减少阳光或强光灯的眩光反射。"},"examples":[{"en":"The quarterback applied eyeblack before the afternoon game to cut down glare.","zh":"这位四分卫在下午比赛前涂了眼下黑，来减少眩光。"},{"en":"Some players wear eyeblack stickers with a Bible verse or a short message.","zh":"有些球员会贴带字的眼下黑贴条，上面写着圣经经文或简短标语。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) A “game-day” look meant to appear tough, focused, or intimidating.","zh":"（引申）比赛日的“战斗妆”，用来显得更强硬、更专注或更有气势。"},"examples":[{"en":"He joked that the eyeblack gave him extra confidence, even if it didn’t really change his performance.","zh":"他开玩笑说眼下黑让他更有自信，虽然未必真的改变了表现。"}]}],"synonyms":["eye black","anti-glare grease","black grease","eye paint"],"phonetic":"/ˈaɪˌblæk/","extraExplanation":["在美国棒球和美式橄榄球中，eyeblack 很常见：传统款是黑色油膏，后来也流行贴条（stickers），更方便且不易弄脏。","它的原理是用深色减少皮肤反光，从而降低进入眼睛的散射光；不过在某些场景下效果因人而异。","口语里也常被拿来比喻“上战场的状态/仪式感”，类似 war paint（战斗彩绘）的感觉。"]}
{"word":"eyeblink","summary":{"en":"A very quick blink; used especially to mean “in a moment.”","zh":"眨眼；也常指“转眼之间、瞬间”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very quick closing and opening of the eyes; a blink (often used to emphasize how fast something happens: “in an eyeblink”).","zh":"眨眼；极短的瞬间（常用于强调事情发生得非常快：in an eyeblink＝转眼之间）。"},"examples":[{"en":"The bird disappeared in an eyeblink.","zh":"那只鸟转眼之间就不见了。"},{"en":"It all changed in an eyeblink.","zh":"一切在一瞬间就变了。"}]}],"synonyms":["blink","flash","instant","moment"],"phonetic":"/ˈaɪˌblɪŋk/","extraExplanation":["“Eyeblink”比更常见的“blink”更强调“非常短”的时间感，所以常见于写作或较正式/文学化的表达（如：in the blink of an eye / in an eyeblink）。","固定搭配：in an eyeblink（转眼间）；常见近似表达：in a flash（一下子）、in no time（很快）、in the blink of an eye（眨眼间）。"]}
{"word":"eyebolt","summary":{"en":"An eyebolt is a bolt with a looped end used to attach or lift things.","zh":"Eyebolt 指一端带环的螺栓，用于连接或起吊物体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A metal bolt with a loop (an “eye”) at one end, used as a strong attachment point for ropes, cables, hooks, or lifting gear.","zh":"一种一端带环（“眼”）的金属螺栓，用作绳索、钢缆、挂钩或起吊装置的牢固连接点。"},"examples":[{"en":"They screwed an eyebolt into the beam to hang the punching bag.","zh":"他们把一个吊环螺栓拧进梁里，用来挂沙袋。"},{"en":"Use an eyebolt rated for lifting if you’re going to hoist something heavy.","zh":"如果要起吊重物，要使用有起吊额定载荷的吊环螺栓。"}]}],"synonyms":["eye bolt","ring bolt","lifting eye"],"phonetic":"/ˈaɪˌboʊlt/","extraExplanation":["“Eyebolt”是一个复合词：eye（环形孔/眼）+ bolt（螺栓）。它常见于建筑、船舶、攀登、吊装等场景。","安全提示：日常英语里常会看到“rated/for lifting（有起吊额定载荷）”“working load limit/WLL（工作载荷极限）”等说法；普通眼栓不一定适合承重起吊。"]}
{"word":"eyebolts","summary":{"en":"Eyebolts are bolts with a looped head, used as strong attachment points for ropes, hooks, or cables.","zh":"Eyebolts 指带环头的螺栓，用作绳索、挂钩或钢缆的牢固连接点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A threaded metal bolt with a loop (“eye”) at one end, used to attach ropes, hooks, or cables for lifting, anchoring, or securing things.","zh":"带环（“眼”）的一种带螺纹金属螺栓，用来连接绳索、挂钩或钢缆，常用于起吊、固定或系牢。"},"examples":[{"en":"The workers installed eyebolts in the ceiling to hang the lights safely.","zh":"工人们在天花板上安装了吊环螺栓，以便安全地悬挂灯具。"},{"en":"Clip the rope to the eyebolts and tighten everything before lifting.","zh":"把绳子扣到吊环螺栓上，起吊前把所有东西都拧紧。"}]}],"synonyms":["eye bolts","lifting eyes","eye screws (similar, but usually a screw)"],"phonetic":"/ˈaɪˌboʊlts/","extraExplanation":["“Eyebolt”是复合词：eye（环/孔）+ bolt（螺栓）。注意它的“eye”指金属环形结构，不是“眼睛”。","日常语境里常见的搭配有：install eyebolts（安装吊环螺栓）、attach to an eyebolt（固定在吊环螺栓上）、lifting eyebolt（起吊用吊环螺栓）。安全场景中要确认承重等级（load rating）。"]}
{"word":"eyebree","summary":{"en":"“Eyebree” is not standard English; it’s probably “eyebrow,” meaning the hair above the eye or (figuratively) a sign of surprise/disapproval.","zh":"“Eyebree”不是标准英文，通常是“eyebrow（眉毛）”的拼写错误，也可引申为“挑眉”表示惊讶/不赞同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “eyebrow”: the strip of hair above your eye.","zh":"很可能是“eyebrow”的拼写错误：眉毛，位于眼睛上方的一条毛发。"},"examples":[{"en":"She raised her eyebrow when she heard the news.","zh":"听到这个消息时，她挑了挑眉。"},{"en":"He has thick eyebrows.","zh":"他的眉毛很浓。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A facial expression of doubt, surprise, or mild disapproval, often shown by lifting an eyebrow.","zh":"（引申）表示怀疑、惊讶或轻微不赞同的表情，常通过挑眉表现。"},"examples":[{"en":"His comment drew a few raised eyebrows.","zh":"他的评论引来了一些人挑眉（表示惊讶或不赞同）。"},{"en":"There were eyebrows raised at the sudden decision.","zh":"大家对这个突然的决定都露出惊讶/质疑的表情。"}]}],"synonyms":["brow","eyebrow hair","raised eyebrow (figurative)"],"phonetic":"/ˈaɪ.braʊ/","extraExplanation":["“Eyebree”不是常见英文单词，最常见的情况是把“eyebrow（眉毛）”拼错了。","拼写提示：eyebrow = eye（眼睛）+ brow（眉脊/眉部），结尾是 -brow，不是 -bree。"]}
{"word":"eyebridled","summary":{"en":"“Eyebridled” is a rare poetic adjective meaning eyebrows drawn/knit to show restraint or disapproval.","zh":"“eyebridled”是罕见的诗意形容词，指眉毛紧绷或微皱，表现克制或不赞同。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/poetic) Having eyebrows drawn up or knit in a tense, “bridled” way; showing restraint, displeasure, or suspicion through the brows.","zh":"（罕见/诗意用法）眉毛紧绷、上扬或微皱，像被“勒住”一样；用眉形表现克制、不悦或怀疑。"},"examples":[{"en":"He gave me an eyebridled look, as if holding back a sharp comment.","zh":"他眉眼紧绷地看了我一眼，像是在忍住一句尖刻的话。"},{"en":"Her eyebridled expression told us she didn’t approve.","zh":"她紧蹙的眉眼表情告诉我们，她并不赞同。"}]}],"synonyms":["furrow-browed","knit-browed","stern","disapproving","wary"],"phonetic":"/ˈaɪˌbraɪdəld/","extraExplanation":["“eyebridled”非常少见，多见于带有创造性或古风的文字里，属于把“eyebrow/eye”与“bridled（受缰绳约束的；克制的）”组合起来的写法，用来形容眉眼所传达的压抑、警惕或不满。","如果你是在词典/拼写检查中遇到它，也可能是拼写误差；更常见的相关表达有：“furrow-browed（眉头紧锁的）”“browbeaten（被压得抬不起头的）”“bridled（克制的）”。"]}
{"word":"eyebright","summary":{"en":"Eyebright is a small wildflower (Euphrasia) traditionally used in herbal remedies for eye problems.","zh":"Eyebright指小米草（眼亮草），一种野生小花，传统上用于与眼部不适相关的草药疗法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small wild plant (Euphrasia) with pale purple-and-white flowers, traditionally used in herbal medicine—especially for eye irritation (though evidence is limited).","zh":"小米草（眼亮草，Euphrasia属）的一种野生小花，常见淡紫白色花；传统草药中常用于缓解眼部不适（但科学证据有限）。"},"examples":[{"en":"Eyebright grows in grassy fields and blooms in late summer.","zh":"小米草常生长在草地里，夏末开花。"},{"en":"Some people drink eyebright tea for mild eye discomfort, but you should check with a doctor first.","zh":"有些人会喝小米草茶来缓解轻微眼部不适，但最好先咨询医生。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or made from the eyebright plant, especially in herbal products.","zh":"（尤指草本产品中）与小米草有关的；由小米草制成的。"},"examples":[{"en":"She bought an eyebright herbal tincture at a health store.","zh":"她在保健品店买了一瓶小米草草本酊剂。"}]}],"synonyms":["Euphrasia","herb","wildflower"],"phonetic":"/ˈaɪˌbraɪt/","extraExplanation":["“Eyebright”这个名字来自传统观念：它能“让眼睛更明亮”。在欧洲民间草药中很常见，但现代研究对其疗效结论并不一致。若用于眼部（如滴眼液、洗眼等），要特别注意无菌与安全性，避免感染或刺激。"]}
{"word":"eyebrow","summary":{"en":"An eyebrow is the hair above the eye, often used in language to talk about facial expressions like surprise or doubt.","zh":"eyebrow 指“眉毛”，也常用来描述表情（如惊讶、怀疑、不赞同）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The strip of hair above your eye that helps protect the eye and shows facial expression.","zh":"眉毛；长在眼睛上方的一条毛发，能保护眼睛，也能表达面部情绪。"},"examples":[{"en":"She raised her eyebrows in surprise.","zh":"她惊讶地挑起了眉毛。"},{"en":"He has thick eyebrows like his father.","zh":"他的眉毛很浓，像他爸爸。"},{"en":"Sweat ran into his eyebrows during the game.","zh":"比赛时汗水流到了他的眉毛上。"}]}],"synonyms":["brow"],"phonetic":"/ˈaɪˌbraʊ/","extraExplanation":["“eyebrow”常用于一些固定搭配：\n- raise an eyebrow：表示惊讶、怀疑或不赞同（常带一点“你在说什么？”的感觉）。\n- furrow your brows / furrow your eyebrows：皱眉，表示担心、困惑或生气。\n也常见形容词搭配：thick/bushy eyebrows（浓眉）、thin eyebrows（细眉）。","文化小提示：在不同文化中，“挑眉”“皱眉”等表情的含义可能略有差异；在英语语境里，“raise an eyebrow”经常用来表达“质疑/不以为然”，不一定只是惊讶。"]}
{"word":"eyebrows","summary":{"en":"Eyebrows are the hairs above your eyes and are also used to show feelings through facial expression.","zh":"Eyebrows 指“眉毛”，也可指通过眉毛动作表达情绪的表情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The strips of hair above each eye; they help protect the eyes and are important for facial expression.","zh":"眉毛；位于眼睛上方的一条毛发，能保护眼睛，也对面部表情很重要。"},"examples":[{"en":"She has thick eyebrows and long eyelashes.","zh":"她的眉毛很浓，睫毛很长。"},{"en":"He raised his eyebrows when he heard the news.","zh":"他听到这个消息时扬起了眉毛。"},{"en":"Try not to get soap in your eyebrows.","zh":"尽量别让肥皂弄到眉毛上。"}]},{"partOfSpeech":"n.","definition":{"en":"A facial expression made by moving the eyebrows, often showing surprise, doubt, or curiosity.","zh":"（通过动眉毛形成的）表情，常表示惊讶、怀疑或好奇。"},"examples":[{"en":"Her eyebrows said, “Really?” even before she spoke.","zh":"她还没开口，眉毛的表情就像在说：“真的吗？”"},{"en":"He gave me an eyebrow and walked away.","zh":"他挑了挑眉看了我一眼就走开了。"}]}],"synonyms":["brows"],"phonetic":"/ˈaɪbraʊz/","extraExplanation":["常见搭配：raise your eyebrows（扬眉/表示惊讶）、arch your eyebrows（把眉毛弯成弧形，常显得怀疑或好奇）、furrow your eyebrows/brow（皱眉）。在英语里也常用单数 brow 表示“眉头/额头一带”，如 furrow your brow。","文化提示：在不同文化中，“挑眉/扬眉”的含义可能不同；在英语语境里通常表示惊讶、怀疑或不赞同，但也可能只是无声的提问或调侃。"]}
{"word":"eyecup","summary":{"en":"An eyecup is the cup-shaped piece on an optical device that fits around the eye to block light and improve comfort.","zh":"Eyecup 指光学器材上围住眼睛的杯状部件，用来遮光并提升使用舒适度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small cup-shaped part around or over the eye, especially on binoculars, cameras, microscopes, or similar devices, used to block stray light and help you position your eye comfortably.","zh":"（望远镜、相机、显微镜等器材上的）目罩/眼罩；包在眼睛周围的小杯状部件，用来遮光并帮助舒适对准眼睛。"},"examples":[{"en":"Press your eye gently against the eyecup to block side light.","zh":"把眼睛轻轻贴在目罩上，以遮住侧面漏进来的光。"},{"en":"The binoculars have soft rubber eyecups for comfort.","zh":"这副望远镜配有柔软的橡胶目罩，戴起来更舒适。"},{"en":"I replaced the torn eyecup on my camera viewfinder.","zh":"我把相机取景器上破掉的目罩换掉了。"}]}],"synonyms":["eyepiece cup","viewfinder eyecup","rubber eyecup"],"phonetic":"/ˈaɪˌkʌp/","extraExplanation":["“Eyecup”常见于摄影和观鸟等语境：相机取景器的目罩可以减少杂光、提升画面对比度；戴眼镜的人有时会把可折叠/可旋转的目罩调到更合适的位置。","有时也会看到拼写变体“eye cup”（分开写），意思相同。"]}
{"word":"eyecups","summary":{"en":"Eyecups are the soft rings/cups around an eyepiece that block light and help you position your eyes; less commonly, it can mean a small cup used to rinse the eye.","zh":"Eyecups 指目镜周围用来遮光并帮助对准眼睛的软质眼罩；较少见时也可指用于冲洗眼睛的洗眼杯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Soft rubber or plastic rings/cups around the eyepieces of binoculars, cameras, microscopes, or VR headsets that block stray light and help position your eyes comfortably.","zh":"（望远镜、相机取景器、显微镜或VR设备等）目镜周围的软橡胶/塑料眼罩，用来遮光并帮助眼睛舒适对准。"},"examples":[{"en":"These binoculars have twist-up eyecups, so you can adjust them for comfort.","zh":"这副望远镜有可旋拧升降的眼罩，可以调到更舒适的位置。"},{"en":"Fold down the eyecups if you wear glasses.","zh":"如果你戴眼镜，把眼罩折下来。"},{"en":"The eyecups block side light and make the view clearer.","zh":"眼罩能挡住侧面杂光，让画面更清晰。"}]},{"partOfSpeech":"n.","definition":{"en":"Small cup-shaped tools used in eye care (for example, to rinse/irrigate the eye), less common in everyday English.","zh":"（眼科护理中使用的）杯状小器具，用于冲洗眼睛等；日常英语中较少见。"},"examples":[{"en":"The nurse used an eyecup to rinse out the patient’s eye.","zh":"护士用洗眼杯给病人冲洗眼睛。"},{"en":"Follow the instructions carefully when using an eyecup for eye irrigation.","zh":"用洗眼杯冲洗眼睛时要严格按说明操作。"}]}],"synonyms":["eye shield","rubber eyecup","eyepiece guard","eye cup"],"phonetic":"/ˈaɪˌkʌp/","extraExplanation":["“Eyecups”通常是“eyecup”的复数，更常见于光学器材的说明书或评测里（binoculars/monoculars/camera viewfinder）。常搭配的说法有：twist-up eyecups（旋升式眼罩）、fold-down eyecups（可折叠眼罩）。","戴眼镜的人常把眼罩压下/折下，以免顶到镜片；不戴眼镜的人通常把眼罩升起，以获得更稳定的视角并减少漏光。"]}
{"word":"eyed","summary":{"en":"“Eyed” most often describes what kind of eyes someone or something has (especially in compounds like “blue-eyed”). It can also be the past form of “eye,” meaning to look at closely.","zh":"“eyed”最常见是形容词，用来描述某人/某物的眼睛特征（常见于如“blue-eyed”的复合词）。它也可以是动词“eye”的过去式/过去分词，表示仔细地看、盯着看。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in compounds) Having a particular kind of eyes (color, size, shape, etc.).","zh":"（常用于复合词）长着某种特征的眼睛（颜色、大小、形状等）。"},"examples":[{"en":"She’s blue-eyed and friendly.","zh":"她有一双蓝眼睛，很友善。"},{"en":"A sharp-eyed student noticed the mistake on the board.","zh":"一个目光敏锐的学生注意到了黑板上的错误。"},{"en":"The big-eyed kitten looked up at me.","zh":"那只大眼睛的小猫抬头看着我。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “eye”: to look at or watch closely, often with interest or suspicion.","zh":"“eye”的过去式/过去分词：仔细看、盯着看（常带兴趣或怀疑）。"},"examples":[{"en":"The manager eyed the report and asked a few questions.","zh":"经理仔细看了报告，问了几个问题。"},{"en":"He eyed my backpack, as if checking what was inside.","zh":"他盯着我的背包看，好像在确认里面有什么。"}]}],"synonyms":["watched","observed","studied","stared at","gazed at"],"phonetic":"/aɪd/","extraExplanation":["“eyed”作形容词时很常见于带连字符的复合形容词：blue-eyed, one-eyed, wide-eyed, sharp-eyed 等，通常放在名词前作定语（a blue-eyed boy）。也可以不加连字符放在名词后（The boy is blue eyed），但写作中更常用连字符形式。","注意发音：词尾的 -ed 在这里读 /d/（不是 /t/ 或 /ɪd/），因为词根以浊辅音 /aɪ/ 结尾的音后接 -ed 常读 /d/。"]}
{"word":"eyedness","summary":{"en":"Eyedness means the quality of having certain eye features (often in compounds) and, less commonly, eye dominance (favoring one eye).","zh":"Eyedness 指具有某种眼睛特征的性质（多见于复合词中），也可较少见地指“优势眼/眼睛主导性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of having eyes of a particular type, color, or number (often used in compounds)","zh":"（多用于复合词中）具有某种眼睛特征（如颜色、数量等）的状态或性质"},"examples":[{"en":"The artist exaggerated the character’s three-eyedness to make it feel mythical.","zh":"画家夸张了角色“三只眼”的特征，让它更有神话感。"},{"en":"In fantasy stories, unusual eyedness can signal magic or a special lineage.","zh":"在奇幻故事里，不寻常的“眼睛特征”常暗示魔法或特殊血统。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) eye dominance; a tendency to rely more on one eye than the other for aiming or focusing","zh":"（较少见）优势眼/眼睛主导性：在瞄准或对焦时更依赖某一只眼的倾向"},"examples":[{"en":"The coach checked her eyedness to decide whether she should shoot right- or left-handed.","zh":"教练检查了她的优势眼，以决定她更适合用右手还是左手射击。"},{"en":"Eyedness can matter in sports like archery, shooting, and baseball.","zh":"在射箭、射击和棒球等运动中，优势眼可能很重要。"}]}],"synonyms":["eye dominance","dominant eye","ocular dominance","eye preference"],"phonetic":"/ˈaɪdnəs/","extraExplanation":["“eyedness”在日常英语里不算常用，更常见的是用更自然的表达：\n- 描述眼睛特征：用形容词（blue-eyed, one-eyed, three-eyed）或名词短语（the fact that he has…）。\n- 描述优势眼：更常用“eye dominance / dominant eye”。\n\n构词上它类似“handedness（惯用手）”：在形容词/名词后加“-ness”表示“……的性质/状态”。"]}
{"word":"eyednesses","summary":{"en":"“Eyednesses” is the plural of “eyedness,” meaning different kinds of eye-related qualities (usually in compounds like “blue-eyedness”).","zh":"“Eyednesses”是“eyedness”的复数，表示各种与眼睛相关的“特质/状态”（多用于如“blue-eyedness”等复合词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of having a particular kind of eyes (usually used in compounds like “blue-eyedness” or “one-eyedness”)","zh":"（通常用于复合词中，如 blue-eyedness / one-eyedness）指“有某种眼睛特征的状态或性质”"},"examples":[{"en":"In the story, her blue-eyedness is described as making her look calm and gentle.","zh":"在故事里，她的“蓝眼睛特质”被描写得让她看起来平静温柔。"},{"en":"The villain’s one-eyedness became a memorable detail in the film.","zh":"反派“独眼的特征”成了电影里令人难忘的细节。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, playful) the state of having a certain number of eyes","zh":"（罕见、带玩笑语气）指“拥有某个数量的眼睛的状态”"},"examples":[{"en":"The cartoon jokes about alien eyednesses: three-eyedness, four-eyedness, and more.","zh":"这部动画拿外星人的“眼睛数量特征”开玩笑：三眼、四眼等等。"},{"en":"He teased his friend’s “four-eyedness,” but apologized right away.","zh":"他取笑朋友“四眼”（戴眼镜的绰号相关），但马上道歉了。"}]}],"synonyms":["eye traits","eye characteristics","-eyed quality","appearance (eye-related)"],"phonetic":"/ˈaɪd.nə.sɪz/","extraExplanation":["“eyednesses”是名词“eyedness”的复数形式（-ness 表示“性质/状态”，复数常加 -es）。这个词本身很少单独使用，更常见的是出现在复合词里：blue-eyedness（蓝眼睛的特质）、one-eyedness（独眼的状态）。","注意：口语里的“four-eyes”常用来取笑戴眼镜的人，可能带冒犯意味；使用时要考虑场合与他人感受。"]}
{"word":"eyedot","summary":{"en":"An i-dot is the small dot above a lowercase “i” (and sometimes “j”).","zh":"i-dot 指英文小写字母“i”（有时也包括“j”）上方的小圆点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the small dot above a lowercase “i” (and sometimes “j”) in English writing","zh":"英文小写字母“i”（有时也包括“j”）上方的小圆点"},"examples":[{"en":"In careful handwriting, make sure the i-dot is directly above the letter.","zh":"在工整书写时，要确保 i 的点正好在字母上方。"},{"en":"The teacher said my i-dots were too far to the right.","zh":"老师说我给 i 点的位置太靠右了。"}]},{"partOfSpeech":"n.","definition":{"en":"a tiny dot-like mark used in lettering or design (informal)","zh":"在字体或设计中使用的小圆点状标记（非正式用法）"},"examples":[{"en":"The logo uses an i-dot shaped like a star.","zh":"这个标志把 i 的点设计成星星形状。"}]}],"synonyms":["tittle"],"phonetic":"/ˈaɪ dɑt/","extraExplanation":["“i-dot”在排版/字体学里更正式的词是“tittle”，指的就是 i 或 j 上面的那个小点。","在习语“dot the i’s and cross the t’s”里，这类小细节象征“把事情做得非常仔细、把所有细节都处理好”。"]}
{"word":"eyedrop","summary":{"en":"Eyedrop (more commonly “eye drop/eye drops”) is liquid medicine you put in your eye.","zh":"Eyedrop（更常见写法为 eye drop/eye drops）指滴入眼睛的药水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small amount of liquid medicine put into the eye (often written as two words: “eye drop”; usually plural: “eye drops”)","zh":"滴眼液；眼药水（常写作两个词 eye drop；更常用复数 eye drops）"},"examples":[{"en":"The doctor told me to use eye drops twice a day.","zh":"医生让我每天用两次滴眼液。"},{"en":"Put one drop in each eye and blink gently.","zh":"每只眼睛滴一滴，然后轻轻眨眼。"}]}],"synonyms":["eye drop","eye drops","eyewash (related, not the same)"],"phonetic":"/ˈaɪˌdrɑp/","extraExplanation":["“Eye drop(s)”在日常英语中更常见；“eyedrop”作为一个词也能见到，但多用于商品名、标签或较少见的拼写。","用法小提醒：表示药水本身时常用复数“eye drops”（e.g., I need eye drops.）；表示一次的用量时常用单数“one eye drop / one drop”。"]}
{"word":"eyedropper","summary":{"en":"An eyedropper is a small tool used to dispense tiny drops of liquid, especially eye medicine.","zh":"eyedropper 指用于滴出少量液体的小工具，尤指滴眼药时用的滴管/滴眼器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small tool (usually a squeezable tube with a narrow tip) used to draw up and release small drops of liquid, especially medicine for the eyes.","zh":"滴管；（尤指）滴眼器：一种小工具（常为可挤压的软管、细嘴），用来吸取并滴出少量液体，尤其是滴眼药。"},"examples":[{"en":"Put two drops of the medicine in each eye with the eyedropper.","zh":"用滴管给每只眼睛滴两滴药。"},{"en":"The doctor showed me how to keep the eyedropper clean.","zh":"医生教我如何保持滴管清洁。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool used to measure or transfer small amounts of liquid in cooking, science, or art.","zh":"（通用）滴管：在烹饪、实验或美术中用于量取或转移少量液体的工具。"},"examples":[{"en":"Use an eyedropper to add food coloring one drop at a time.","zh":"用滴管一滴一滴地加入食用色素。"},{"en":"In the lab, we used an eyedropper to move the solution into the test tube.","zh":"在实验室里，我们用滴管把溶液转移到试管里。"}]}],"synonyms":["dropper","pipette","eye dropper"],"phonetic":"/ˈaɪˌdrɑpɚ/","extraExplanation":["在英语中也常写作 two words：eye dropper。日常语境里，药房卖的“滴眼液”叫 eye drops（复数更常见）；而“滴眼器/滴管”是 eyedropper，指工具本身。","注意区分 dropper 与 eyedropper：dropper 更泛指任何“滴管/滴头”；eyedropper 强调用于眼药或类似形状的滴管。"]}
{"word":"eyedropperful","summary":{"en":"An eyedropperful is the amount of liquid in one full eyedropper.","zh":"eyedropperful 指“一滴管的量”，即滴管吸满一次的液体量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The amount of liquid that fills an eyedropper (one full squeeze of the dropper).","zh":"一滴管的量；用滴管吸满一次的液体量。"},"examples":[{"en":"Add one eyedropperful of the solution to a glass of water.","zh":"把一滴管的溶液加入一杯水中。"},{"en":"The instructions say to take two eyedropperfuls a day.","zh":"说明书说每天服用两滴管的量。"}]}],"synonyms":["dropperful","a dropperful"],"phonetic":"/ˈaɪˌdrɑpərˌfʊl/","extraExplanation":["这是由 eyedropper（滴管）+ -ful（“……的量”）构成的名词。-ful 常见于 spoonful（一勺的量）、cupful（一杯的量）等。","在日常口语中，人们也常说 “a dropperful”。在医学或配药等需要精确计量的场景，仍应以毫升（mL）等标准单位为准，因为不同滴管容量可能不同。"]}
{"word":"eyedroppers","summary":{"en":"Eyedroppers are tools or small containers used to dispense liquid in drops, especially medicine or lab liquids.","zh":"Eyedroppers 指用于一滴滴滴出液体的滴管或滴瓶，常见于药品或实验场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small tool or container (usually with a rubber bulb or squeeze top) used to draw up and dispense liquid in drops, often for medicine or lab work.","zh":"滴管；滴瓶（常带橡皮球或挤压式滴嘴，用来吸取并一滴滴滴出液体，常用于药品或实验）"},"examples":[{"en":"Use the eyedropper to add two drops of food coloring.","zh":"用滴管加两滴食用色素。"},{"en":"The pharmacist showed me how to use the eyedropper for my child’s medicine.","zh":"药剂师教我如何用滴管给孩子喂药。"},{"en":"In the lab, we measured the solution by adding it drop by drop with an eyedropper.","zh":"在实验室里，我们用滴管一滴一滴地加入溶液来测量。"}]},{"partOfSpeech":"n.","definition":{"en":"A bottle of eye medicine designed to be applied as drops to the eyes; eye drops (less common usage).","zh":"滴眼液（较少见用法，指装在滴瓶里的眼药水；也可泛指“眼药水”）"},"examples":[{"en":"I always keep an eyedropper in my bag during allergy season.","zh":"过敏季我总会在包里备一瓶滴眼液。"},{"en":"The doctor prescribed an antibiotic eyedropper for the infection.","zh":"医生开了抗生素滴眼液来治疗感染。"}]}],"synonyms":["dropper","pipette","medicine dropper","eye drops (for the medicine meaning)"],"phonetic":"/ˈaɪˌdrɑpər/","extraExplanation":["“eyedroppers”是复数形式；单数是“eyedropper”。在日常英语里，说“eye drops（眼药水）”更常见；“eyedropper”更常指“滴管/滴瓶”这个工具或容器。","写法上常见“eyedropper”和“eye dropper”两种；美式英语里合写“eyedropper”更常见。"]}
{"word":"eyedrops","summary":{"en":"Eyedrops are liquid medicine or moisturizing drops you put in your eyes.","zh":"Eyedrops 指滴入眼睛的药液或润眼液（眼药水/滴眼液）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicinal liquid put into the eyes (usually from a small bottle with a dropper) to treat dryness, irritation, infection, or allergies.","zh":"滴眼液；眼药水（通常用带滴管的小瓶把药液滴入眼睛，用于缓解干涩、刺激、感染或过敏等）。"},"examples":[{"en":"These eyedrops help with dry eyes after long hours on the computer.","zh":"这些眼药水能缓解长时间用电脑后的眼睛干涩。"},{"en":"Use the antibiotic eyedrops three times a day, as the doctor advised.","zh":"按医生建议，每天用三次抗生素滴眼液。"},{"en":"She kept a small bottle of eyedrops in her bag during allergy season.","zh":"过敏季节她会在包里放一小瓶眼药水。"}]}],"synonyms":["eye drops","eye medication","artificial tears"],"phonetic":"/ˈaɪˌdrɑps/","extraExplanation":["在美式英语里更常写作 two words：eye drops；也常写成一个词 eyedrops。口语和日常说明书里两种都能见到。","常见搭配：lubricating/artificial tears（润滑型/人工泪液，用于干眼）、allergy eyedrops（抗过敏滴眼液）、antibiotic eyedrops（抗生素滴眼液）。","用法小提醒：隐形眼镜佩戴者要注意是否“safe for contacts/for use with contact lenses（可用于隐形眼镜）”。有的滴眼液需要先摘下隐形眼镜。"]}
{"word":"eyeflap","summary":{"en":"Eyeflap usually means a flap that covers or protects the eye, especially on clothing or gear; more rarely it can mean the eyelid in informal speech.","zh":"Eyeflap 通常指装备或服装上用来遮护眼睛的“遮眼片”；更少见时也可在口语中指“眼睑/眼皮”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flap or movable piece of material that covers or shields the eye (for example, on a mask, hood, helmet, or protective gear)","zh":"（面罩、兜帽、头盔或防护装备上的）眼罩片；可翻起/可移动的遮眼片"},"examples":[{"en":"The winter hood has an eyeflap you can pull down when the wind gets strong.","zh":"这顶冬季兜帽有一块眼罩片，风大时可以拉下来遮住眼睛。"},{"en":"He adjusted the eyeflap on his mask so it wouldn’t block his view.","zh":"他调整了面罩上的眼罩片，避免挡住视线。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the upper eyelid, especially when described as a “flap” in informal or humorous speech","zh":"（罕见）上眼睑；口语或玩笑式把眼皮说成“眼睛的翻盖”"},"examples":[{"en":"With heavy makeup, her eyeflaps looked darker than usual.","zh":"因为妆很浓，她的上眼睑看起来比平时更深。"}]}],"synonyms":["eye flap","eye cover","visor","eyelid (rare sense)"],"phonetic":"/ˈaɪˌflæp/","extraExplanation":["“Eyeflap”不是非常常见的标准词，更常见的说法是“eyelid（眼睑）”或在装备上说“eye flap / eye cover / visor（护目片/面罩/遮光片）”。在服装或道具说明里可能会把两个词写成一个词（eyeflap），属于拼写风格差异。"]}
{"word":"eyeful","summary":{"en":"Eyeful means a striking, often attractive sight (sometimes a person), and less commonly a full view of something.","zh":"Eyeful 指很抢眼、常常很养眼的景象（有时指人）；较少见时也指“一眼所见的全部景象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A noticeable or attractive sight; something (often a person) that is pleasant or striking to look at.","zh":"养眼的人或物；很吸引目光、看起来很漂亮/很抢眼的景象（常指人）。"},"examples":[{"en":"That new mural is an eyeful—you can’t miss it.","zh":"那幅新壁画太抢眼了——你想不注意都难。"},{"en":"She walked in wearing a bright red coat, and she was quite an eyeful.","zh":"她穿着亮红色外套走进来，真是很吸睛。"},{"en":"The garden in spring is a real eyeful.","zh":"春天的花园真的很养眼。"}]},{"partOfSpeech":"n.","definition":{"en":"A complete view of something, as much as your eyes can take in at one time (less common).","zh":"一眼能看到的全部景象；满眼所见（较少见）。"},"examples":[{"en":"From the hilltop, the city was an eyeful of lights.","zh":"从山顶望去，满眼都是城市的灯火。"},{"en":"The first eyeful of the ocean took my breath away.","zh":"第一次一眼看到大海，真让我屏住了呼吸。"}]}],"synonyms":["sight","spectacle","showstopper","head-turner","stunner"],"phonetic":"/ˈaɪˌfʊl/","extraExplanation":["“an eyeful”常带口语色彩，语气可能是赞叹（很美/很惊艳），也可能带一点“太显眼/太夸张”的感觉，具体取决于语境。","谈到人时要注意礼貌与文化敏感性：对陌生人说“you’re an eyeful”可能显得冒犯或物化，更安全的说法是“you look great / you look lovely / that outfit looks amazing”。"]}
{"word":"eyefuls","summary":{"en":"Eyefuls is the plural of eyeful, meaning very pleasing or impressive sights (or attractive people/things).","zh":"Eyefuls 是 eyeful 的复数，指非常养眼、令人印象深刻的景象（也可指好看的人或事物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something (or someone) that is very attractive or impressive to look at; a pleasing sight.","zh":"非常养眼、赏心悦目的事物（或人）；好看的景象。"},"examples":[{"en":"That garden in spring is a real eyeful.","zh":"那个花园在春天真是赏心悦目。"},{"en":"The new skyline at night is an eyeful.","zh":"夜晚的新天际线很养眼。"}]},{"partOfSpeech":"n.","definition":{"en":"A full view of something, often emphasizing how much there is to see.","zh":"满眼所见；强调“看个够”的一大幅景象。"},"examples":[{"en":"From the hilltop, the valley was an eyeful of green fields.","zh":"从山顶望去，山谷满眼都是绿油油的田地。"}]}],"synonyms":["feast for the eyes","sight to behold","visual treat","stunner"],"phonetic":"/ˈaɪfʊlz/","extraExplanation":["“eyefuls”是“eyeful”的复数形式。这个词偏口语、略带幽默或夸赞语气，常用于称赞景色、设计、穿着等“很上镜/很养眼”。在较正式写作中，更常用“a beautiful sight / a feast for the eyes”。"]}
{"word":"eyeglance","summary":{"en":"“Eye glance” means a quick look; “eyeglance” is uncommon and is usually written as “a glance/quick glance.”","zh":"“eye glance”指“迅速瞥一眼”；“eyeglance”这种连写不常见，通常写作“a glance/quick glance”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a quick look with your eyes; a brief moment of looking at something","zh":"瞥一眼；迅速看一下"},"examples":[{"en":"She gave the schedule a quick eye glance and then hurried away.","zh":"她迅速瞥了一眼行程表，然后匆匆离开。"},{"en":"At a single eye glance, he understood something was wrong.","zh":"只消一瞥，他就明白出了问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the act of glancing, emphasizing the eyes rather than the head or body movement","zh":"（较少见）“瞥视”的动作，强调用眼睛快速扫视"},"examples":[{"en":"In the painting, the character’s eye glance suggests suspicion.","zh":"在这幅画里，人物的眼神一瞥透露出怀疑。"}]}],"synonyms":["glance","quick look","peek","look briefly"],"phonetic":"ˈaɪ ˌɡlæns","extraExplanation":["“eyeglance”不是很常见的标准写法；更自然的表达通常是“a glance”“a quick glance”或动词“glance at …”。","如果你想表达“眼镜”，正确单词是“eyeglass”（常用复数“eyeglasses”）。请告诉我你的具体意思，我可以给出更贴切的词条。"]}
{"word":"eyeglass","summary":{"en":"An eyeglass can mean a single lens for one eye (old-fashioned), or more commonly “eyeglasses/glasses.”","zh":"eyeglass 可指较老式的单片眼镜；更常见的用法是指眼镜（多用复数 eyeglasses/glasses）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A single lens worn in front of one eye to help someone see better (less common today).","zh":"（较少见）单片眼镜：戴在一只眼前用于矫正视力的单个镜片。"},"examples":[{"en":"The detective in the old movie wore an eyeglass on a chain.","zh":"老电影里的侦探戴着一副用链子系着的单片眼镜。"},{"en":"He lifted his eyeglass to read the small print.","zh":"他抬起单片眼镜来读小字。"}]},{"partOfSpeech":"n.","definition":{"en":"Eyeglasses; glasses (often used in plural as “eyeglasses” in American English).","zh":"眼镜（常用复数 eyeglasses；也可泛指 glasses）。"},"examples":[{"en":"I can’t read without my eyeglasses.","zh":"没有眼镜我就看不清字。"},{"en":"She got new eyeglasses with thinner lenses.","zh":"她配了一副镜片更薄的新眼镜。"}]}],"synonyms":["glasses","eyeglasses","spectacles","monocle"],"phonetic":"/ˈaɪˌɡlæs/","extraExplanation":["在美式英语里，更常说 **glasses**（口语）或 **eyeglasses**（更正式一些）。**Eyeglass**（单数）有时指“单片眼镜”（monocle），也可能在一些语境里被当作“眼镜”的单数用法，但日常交流里说 *a pair of glasses* 更自然。"]}
{"word":"eyeglasses","summary":{"en":"Eyeglasses are glasses you wear to improve your vision or protect your eyes.","zh":"Eyeglasses 指戴在眼前用来矫正视力或保护眼睛的眼镜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Glasses (lenses in a frame) worn in front of the eyes to help you see better or to protect your eyes.","zh":"眼镜（镜片装在镜框里），戴在眼前用来矫正视力或保护眼睛。"},"examples":[{"en":"I can’t read the menu without my eyeglasses.","zh":"没有眼镜我看不清菜单。"},{"en":"She bought new eyeglasses after her eye exam.","zh":"她做完视力检查后买了新眼镜。"},{"en":"Wear protective eyeglasses when you’re working with chemicals.","zh":"处理化学品时要戴防护眼镜。"}]}],"synonyms":["glasses","spectacles"],"phonetic":"/ˈaɪˌɡlæsɪz/","extraExplanation":["在美式英语里，\"eyeglasses\"常被简称为\"glasses\"；英式英语更常说\"spectacles\"（较正式）。","注意这是复数名词：通常说\"my eyeglasses are...\"。要说“一副”，可用\"a pair of eyeglasses\"。","相关词汇：\"frames\"（镜框）、\"lenses\"（镜片）、\"prescription\"（度数/处方）、\"contacts/contact lenses\"（隐形眼镜）、\"sunglasses\"（太阳镜）。"]}
{"word":"eyeground","summary":{"en":"Eyeground is a less-common art term for the eye-level area of a scene where viewers naturally focus (often the midground).","zh":"Eyeground 是较少见的美术用语，指场景中接近视线高度、观者自然聚焦的区域（常接近中景）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(art/photography) The part of a picture or view that sits around the viewer’s eye level—the area where the eye naturally “rests,” often similar to the midground.","zh":"（绘画/摄影）画面或景物中接近观者视线高度的区域；人眼最容易停留、聚焦的部分，常接近“中景”。"},"examples":[{"en":"In landscapes, place the main subject in the eyeground so the viewer finds it quickly.","zh":"在风景画里，把主体放在“eyeground（视线区）”，观者会更快注意到它。"},{"en":"The foreground is dark, but the eyeground is bright and detailed.","zh":"前景很暗，但视线区明亮而且细节丰富。"}]}],"synonyms":["midground","eye level","focal area","focal plane"],"phonetic":"/ˈaɪˌɡraʊnd/","extraExplanation":["“eyeground”不是非常常见的标准词，更常见的说法是“eye level（视线高度）”、“midground（中景）”或“focal area（视觉焦点区域）”。在构图教学里，有人用它来强调：把重要信息放在观者最舒服、最自然观看的高度和距离。"]}
{"word":"eyehole","summary":{"en":"An eyehole is a small opening designed for looking through, especially on doors or masks.","zh":"eyehole 指用于观看的小孔/开口，常见于门或面具/头盔等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small opening you look through (for example, in a door, mask, helmet, or screen).","zh":"供人往外看（或往里看）的一个小孔/小开口（如门上的窥视孔、面具/头盔的眼孔等）。"},"examples":[{"en":"There’s an eyehole in the door so you can see who is outside.","zh":"门上有个窥视孔，你可以看看外面是谁。"},{"en":"The costume mask had tiny eyeholes, so it was hard to see.","zh":"那副服装面具的眼孔很小，所以很难看清。"}]}],"synonyms":["peephole","spyhole","viewing hole","eye opening"],"phonetic":"/ˈaɪˌhoʊl/","extraExplanation":["“eyehole”是由 eye + hole 组成的复合词，意思直观，但在日常英语里更常用的是“peephole”（门上的猫眼/窥视孔）或“eye opening(s)”（面具、头盔上的眼部开口）。","在一些特定语境（比如手工制作、服装道具、头盔或防护面罩说明书）里，“eyehole(s)”会更常见，用来指“眼部开口/眼孔”。"]}
{"word":"eyeholes","summary":{"en":"“Eyeholes” means openings for the eyes, especially in a mask or helmet.","zh":"“eyeholes”指面具、头盔等物品上供眼睛看的开口/眼孔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Holes or openings for the eyes (often in a mask, helmet, costume, or covering).","zh":"眼睛的孔洞/开口（常见于面具、头盔、服装或遮盖物上）。"},"examples":[{"en":"The mask’s eyeholes were too small, so I couldn’t see clearly.","zh":"面具的眼孔太小了，所以我看不清。"},{"en":"Make sure the helmet’s eyeholes line up with your eyes.","zh":"确保头盔的眼部开口对齐你的眼睛。"}]}],"synonyms":["eye holes","eye openings","eye ports","eye slits"],"phonetic":"/ˈaɪˌhoʊlz/","extraExplanation":["“eyeholes”通常是口语或非正式用法，更常见、更中性的表达是“eye holes”（分开写）或“eye openings”。在产品说明或安全场景里也可能用“eye ports / visor opening”等更具体的说法。","在恐怖、戏谑或网络语境中，“eyeholes”有时会带一点夸张或怪诞的语气，用来强调“只有两个洞能看到外面”的感觉。"]}
{"word":"eyehook","summary":{"en":"An eyehook is a hardware hook with a loop (“eye”) used for hanging or fastening.","zh":"eyehook 指带圆环“眼”的五金挂钩，用于悬挂或固定连接。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small hook with a closed loop (“eye”) on one end, used to hang, fasten, or connect things (often a screw-in hook for wood or a hook attached to a cable/chain).","zh":"一种一端带“圆环/眼”（eye）、另一端为钩或螺纹的挂钩，用来悬挂、固定或连接物品（常见为拧入木头的螺旋眼钩）。"},"examples":[{"en":"We used an eyehook to hang the small plant near the window.","zh":"我们用一个眼钩把小盆栽挂在窗边。"},{"en":"Attach the rope to the eyehook before lifting the box.","zh":"抬箱子之前，先把绳子系在眼钩上。"}]}],"synonyms":["eye hook","screw eye","eyelet hook","hook-and-eye (related)"],"phonetic":"/ˈaɪˌhʊk/","extraExplanation":["在五金语境里更常写作两词：eye hook 或 eyehook。常见类型包括：screw eye（螺旋眼钩，拧入木材/墙面）和 hook-and-eye（钩眼扣，多用于衣物/内衣的扣合）。购买或施工时要注意承重、材质（不锈钢/镀锌）以及是否需要膨胀管固定。"]}
{"word":"eyehooks","summary":{"en":"Eyehooks are hooks with a closed loop (“eye”), used to hang or attach things, or (in clothing) hook-and-eye fasteners.","zh":"Eyehooks 指带“眼”（环扣）的钩子，可用于悬挂/连接物品，也可指衣物上的钩眼扣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small metal hook with a closed loop (“eye”) used to attach, hang, or fasten something (often used in hardware, boating, or packaging).","zh":"带有封闭圆环（“眼”）的小金属钩，用来连接、悬挂或固定物品（常见于五金、航海或包装等场景）。"},"examples":[{"en":"Use two eyehooks to hang the planter from the ceiling.","zh":"用两个带环钩把花盆吊在天花板上。"},{"en":"He screwed an eyehook into the wooden beam to hold the rope.","zh":"他把带环钩拧进木梁，用来固定绳子。"}]},{"partOfSpeech":"n.","definition":{"en":"A fastening made of a hook and an “eye” loop, often used on clothing (commonly called “hook-and-eye” fasteners).","zh":"由“钩”和“眼”（环扣）组成的扣件，常用于衣物（更常说 hook-and-eye 扣）。"},"examples":[{"en":"The dress closes with eyehooks at the back.","zh":"这条裙子背后用钩眼扣扣上。"},{"en":"She replaced the broken eyehooks on her bra strap.","zh":"她把胸衣肩带上坏掉的钩眼扣换了。"}]}],"synonyms":["eye hook","screw eye","eyelet hook","hook-and-eye fastener"],"phonetic":"ˈaɪˌhʊk","extraExplanation":["“eyehook(s)”在日常英语里更常写作 two words：eye hook / eyehooks，或更明确地说 screw eye（螺丝眼/带环螺钉）指能拧进木头的那种。","用于衣物时，英语更常用固定搭配 hook-and-eye（钩眼扣）。如果你在说明书或网购标题里看到 eyehooks，通常是在指这一类五金小配件或扣件。"]}
{"word":"eyeing","summary":{"en":"“Eyeing” means looking at something/someone closely or with interest, or considering something you want or plan to do.","zh":"“eyeing”表示（持续地）打量/注视，或表示看中、盘算要做/要得到某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to look at someone or something with interest, attention, or desire (often for a period of time)","zh":"（常持续地）注视、打量（某人或某物），带着兴趣、关注或想要的念头"},"examples":[{"en":"She kept eyeing the last piece of cake.","zh":"她一直盯着最后那块蛋糕看。"},{"en":"The manager was eyeing him carefully during the interview.","zh":"面试时经理一直很仔细地打量他。"}]},{"partOfSpeech":"v.","definition":{"en":"to consider or plan to get or do something; to have your eye on a goal","zh":"（非正式）考虑/打算得到或做某事；把目标“看上了”"},"examples":[{"en":"They’re eyeing a move to New York next year.","zh":"他们在考虑明年搬去纽约。"},{"en":"I’m eyeing that jacket, but it’s a bit expensive.","zh":"我看上了那件夹克，但有点贵。"}]}],"synonyms":["watching","staring at","looking over","checking out","considering","having one’s eye on"],"phonetic":"/ˈaɪ.ɪŋ/","extraExplanation":["“eyeing”是动词“eye”的现在分词/动名词形式，常用于进行时（be eyeing）或作定语（the eyeing crowd）。","语气上常带“打量、看中、盘算”的感觉；在语境里有时会暗示一点点怀疑、警惕或想要（例如在商店里“eyeing”某物）。"]}
{"word":"eyeish","summary":{"en":"“Eyeish” is a nonstandard adjective meaning “somewhat eye-like.”","zh":"“eyeish”是非标准形容词，意思是“有点像眼睛的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) Somewhat like an eye; eye-like in shape or appearance.","zh":"（非标准用法）有点像眼睛的；眼睛般的（形状或外观）。"},"examples":[{"en":"The pattern on the butterfly’s wings looks a bit eyeish, like tiny eyes.","zh":"蝴蝶翅膀上的花纹有点“眼睛般”，像一对小眼睛。"},{"en":"The camera lens gives an eyeish feeling, as if it’s watching you.","zh":"相机镜头让人觉得有点像“眼睛”，仿佛在看着你。"}]}],"synonyms":["eye-like","ocular (formal)","eyed (in compounds)"],"phonetic":"/ˈaɪˌɪʃ/","extraExplanation":["“eyeish”不是常见的标准词，更像是把名词 eye（眼睛）加上后缀 -ish（“有点……、略带……、像……的”）临时造出来的口语/网络写法。正式写作里更常用 eye-like、eyed（如: big-eyed）、ocular（更正式）。","如果你想表达“有点像/有点……的”，-ish 很常用：greenish（带点绿）、childish（孩子气的）、sixish（大约六点）。"]}
{"word":"eyelash","summary":{"en":"An eyelash is a small hair on the edge of the eyelid that helps protect the eye.","zh":"eyelash 指眼睑边缘的细毛（睫毛），用于保护眼睛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the small hairs that grow along the edge of your eyelids, protecting your eyes from dust and helping trigger blinking.","zh":"睫毛：长在眼睑边缘的一根根细毛，用来保护眼睛、防尘，并帮助引发眨眼反射。"},"examples":[{"en":"She got a speck of dust stuck on her eyelash.","zh":"一粒灰尘卡在她的睫毛上了。"},{"en":"He has long eyelashes, so his eyes look very expressive.","zh":"他的睫毛很长，所以眼睛看起来很有神。"},{"en":"Be careful—don’t pull out your eyelashes.","zh":"小心，别把睫毛拔掉。"}]}],"synonyms":["lash"],"phonetic":"/ˈaɪˌlæʃ/"}
{"word":"eyelashes","summary":{"en":"Eyelashes are the short hairs on the edges of your eyelids.","zh":"Eyelashes 指眼睑边缘的短毛，也就是“睫毛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The short hairs that grow along the edges of your eyelids, protecting your eyes from dust and bright light.","zh":"长在眼睑边缘的短毛（睫毛），用来保护眼睛免受灰尘和强光刺激。"},"examples":[{"en":"She has long eyelashes and wears mascara to make them look thicker.","zh":"她的睫毛很长，还会涂睫毛膏让它们看起来更浓密。"},{"en":"Dust got into my eye, and my eyelashes couldn’t block it.","zh":"灰尘进了我的眼睛，睫毛没能挡住。"},{"en":"The baby’s eyelashes are so delicate.","zh":"宝宝的睫毛非常细软。"}]}],"synonyms":["lashes"],"phonetic":"/ˈaɪˌlæʃɪz/","extraExplanation":["“Eyelashes”通常用复数，因为我们一般指两只眼睛上的多根睫毛；单数“an eyelash”多用于指一根睫毛（例如：I found an eyelash on my cheek. 我在脸颊上发现了一根睫毛）。","在美容语境中常见搭配：mascara（睫毛膏）、false eyelashes / fake lashes（假睫毛）、eyelash extensions（嫁接睫毛）、lash curler（睫毛夹）。","文化上，长睫毛常被视为“好看/迷人”的特征，但各地审美不同；谈论外貌时注意语气和场合会更礼貌。"]}
{"word":"eyelast","summary":{"en":"Likely meant “eyelash”: a hair along the edge of your eyelid.","zh":"很可能想写“eyelash”：长在眼睑边缘的毛发（睫毛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hair that grows along the edge of an eyelid (the lashes around your eyes).","zh":"睫毛（长在眼睑边缘的毛发）。"},"examples":[{"en":"She has long eyelashes.","zh":"她的睫毛很长。"},{"en":"Be careful not to get soap in your eyes or on your eyelashes.","zh":"小心别让肥皂进到眼睛里或弄到睫毛上。"},{"en":"Mascara makes your eyelashes look darker and thicker.","zh":"睫毛膏会让睫毛看起来更黑、更浓密。"}]}],"synonyms":["lash","cilia (technical)"],"phonetic":"/ˈaɪˌlæʃ/","extraExplanation":["“eyelast”不是常见英文单词，最可能是拼写错误，正确拼写通常是“eyelash”（睫毛）。","与化妆相关时常见搭配：false eyelashes（假睫毛）、eyelash curler（睫毛夹）、lash extensions（嫁接睫毛/睫毛延长）。","复数是 eyelashes；口语里也常简化说 lashes（如：long lashes）。"]}
{"word":"eyeless","summary":{"en":"“Eyeless” means having no eyes, used in biology and vivid literary descriptions; sometimes used figuratively for “ignoring what’s obvious.”","zh":"“eyeless”指“没有眼睛的”，常用于生物学或生动的文学描写；有时也可比喻“对明显事实视而不见”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no eyes; lacking eyes (literally or figuratively).","zh":"没有眼睛的；无眼的（可指字面或比喻）"},"examples":[{"en":"The eyeless fish live in dark caves where eyesight isn’t useful.","zh":"无眼鱼生活在黑暗的洞穴里，在那里视力并不重要。"},{"en":"In the poem, the author describes an eyeless monster that senses its prey by sound.","zh":"在诗中，作者描写了一只“无眼”的怪物，靠声音感知猎物。"},{"en":"Some people use “eyeless” figuratively to criticize someone who ignores obvious facts.","zh":"有些人把“eyeless”用作比喻，批评某人对明显的事实视而不见。"}]}],"synonyms":["sightless","blind","without eyes"],"phonetic":"/ˈaɪlɪs/","extraExplanation":["“eyeless”由 eye + -less（表示“没有……的”）构成，常见于生物学语境（洞穴生物、深海生物）和文学描写（营造恐怖、神秘或失明的意象）。","与之相关的常见表达包括：blind（失明的）、sightless（无视力的，较文学化）、without eyes（没有眼睛的，较中性直白）。注意：eyeless 更强调“没有眼睛/眼睛缺失”，而 blind/sightless 更强调“看不见”。"]}
{"word":"eyelessness","summary":{"en":"Eyelessness means the condition of having no eyes; it can also (rarely) mean figurative blindness or refusal to see the truth.","zh":"Eyelessness 指“无眼”的状态；也可（较少见）作比喻，指对真相的盲目或刻意无视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or condition of having no eyes; lack of eyes.","zh":"无眼的状态；缺乏眼睛。"},"examples":[{"en":"In some cave fish, eyelessness is an adaptation to living in complete darkness.","zh":"在一些洞穴鱼类中，无眼是适应完全黑暗环境的一种特征。"},{"en":"The scientist studied genes that can lead to eyelessness during development.","zh":"这位科学家研究了在发育过程中可能导致无眼的基因。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) The condition of being unable or unwilling to “see” the truth; blindness in awareness or judgment.","zh":"（比喻，用法较少）看不见或不愿看见真相的状态；认知或判断上的“盲目”。"},"examples":[{"en":"His eyelessness toward others’ suffering made him seem cold.","zh":"他对他人痛苦的“视而不见”让他显得冷漠。"},{"en":"The novel criticizes a society’s eyelessness to injustice.","zh":"这部小说批评了社会对不公的“看不见”。"}]}],"synonyms":["lack of eyes","anophthalmia","blindness","willful blindness"],"phonetic":"/ˈaɪləsnəs/","extraExplanation":["“eyelessness”由形容词“eyeless（无眼的）”加名词后缀“-ness（……的状态/性质）”构成，常见于生物学、医学或科普语境。","比喻义不常用，但在文学或评论写作中可用来强调“有眼却不看见”的道德或社会层面的麻木；更常见的替代表达是“blindness（盲目）”或“willful blindness（刻意无视）”。"]}
{"word":"eyelet","summary":{"en":"An eyelet is a small reinforced hole (or the ring that reinforces it), used for threading laces, cords, or fasteners.","zh":"eyelet 指用于穿鞋带/绳子等的加固小孔眼，或加固该孔的金属（塑料）圈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small hole in fabric, leather, paper, etc., often reinforced with metal or stitching, used to thread a cord, lace, or hook through.","zh":"（布料、皮革、纸张等上的）小孔眼，常用金属圈或缝线加固，用于穿过绳子、鞋带或挂钩等。"},"examples":[{"en":"Thread the shoelace through the eyelets from the bottom up.","zh":"把鞋带从下往上穿过鞋孔眼。"},{"en":"The curtain has metal eyelets along the top for the rod.","zh":"这块窗帘上沿有一排金属孔眼，方便穿杆。"}]},{"partOfSpeech":"n.","definition":{"en":"A small metal (or plastic) ring used to reinforce a hole, especially on clothing, shoes, curtains, or banners.","zh":"（用于加固孔的）金属圈（或塑料圈），常见于衣物、鞋子、窗帘或横幅等。"},"examples":[{"en":"One eyelet came loose from the belt hole.","zh":"腰带孔上的一个金属圈松脱了。"},{"en":"They installed brass eyelets to stop the hole from tearing.","zh":"他们装上黄铜孔眼圈，防止孔被扯裂。"}]},{"partOfSpeech":"n.","definition":{"en":"A small loop or hole-shaped part used for fastening (for example, to attach a hook or pass a pin through).","zh":"（用于扣合/固定的）小环、小孔状部件（如挂钩或穿销用）。"},"examples":[{"en":"The tag is attached to the suitcase handle with a plastic eyelet.","zh":"标签用一个塑料小环固定在行李箱把手上。"},{"en":"Push the pin through the eyelet to secure the strap.","zh":"把销钉穿过孔眼来固定带子。"}]}],"synonyms":["grommet","reinforced hole","ringlet"],"phonetic":"/ˈaɪlɪt/","extraExplanation":["“eyelet”来自“eye（眼睛）+ -let（表示小的后缀）”，字面意思是“小眼睛”，因为这种孔看起来像一个小“眼”。","在日常英语里，鞋子上那一排小孔最常用的说法是“shoelace eyelets”或直接说“eyelets”。窗帘常见搭配是“grommets”（也常被理解为更大、更结实的金属孔眼圈），有时与“eyelets”近义但不完全等同。"]}
{"word":"eyeleted","summary":{"en":"Eyeleted means “having eyelets” or “made/fitted with eyelets.”","zh":"eyeleted 表示“带孔眼的”，也可作动词表示“打孔眼/装鸡眼孔”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of fabric, leather, or an object) Having eyelets—small holes (often reinforced with metal) used for threading laces, cords, or for fastening.","zh":"（指布料、皮革或物体）带有孔眼的；有鸡眼孔（常用金属圈加固的小孔），用于穿鞋带、绳子或固定。"},"examples":[{"en":"She bought an eyeleted belt so it would be easy to adjust the size.","zh":"她买了一条带孔眼的皮带，这样更容易调节尺寸。"},{"en":"The eyeleted curtains hang from hooks through the small holes along the top edge.","zh":"这幅带孔眼的窗帘通过上沿的小孔挂在挂钩上。"}]},{"partOfSpeech":"v.","definition":{"en":"Simple past and past participle of eyelet: to make or fit with eyelets.","zh":"eyelet 的过去式/过去分词：给……打孔眼；给……装鸡眼孔（金属孔）。"},"examples":[{"en":"The tailor eyeleted the fabric so the lacing would not tear it.","zh":"裁缝给布料打上鸡眼孔，这样系带就不会把布扯破。"},{"en":"The boots were eyeleted and ready for new laces.","zh":"靴子已经装好孔眼，可以换新鞋带了。"}]}],"synonyms":["grommeted","laced","perforated"],"phonetic":"/ˈaɪlətɪd/","extraExplanation":["“Eyelet”常指两种相关概念：①孔眼（小孔）；②加固孔眼的金属圈（中文常说“鸡眼/鸡眼扣”）。在服装与手工领域里很常见，如鞋子、束腰、窗帘、文件活页等。"]}
{"word":"eyeleteer","summary":{"en":"An eyeleteer is someone who makes or installs eyelets (reinforced holes).","zh":"eyeleteer 指制作或安装鸡眼/扣眼（加固小孔）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to make or insert eyelets (small reinforced holes, often with a metal ring) in fabric, leather, shoes, sails, etc.","zh":"（职业）制作或安装鸡眼/扣眼（常带金属圈的加固小孔）的人；打鸡眼工"},"examples":[{"en":"The shoe factory hired an eyeleteer to set metal eyelets into the leather boots.","zh":"那家鞋厂雇了一位打鸡眼工，把金属鸡眼安装到皮靴上。"},{"en":"As an eyeleteer, she used a press to punch holes and fasten each eyelet securely.","zh":"作为打鸡眼工，她用压机冲孔，并把每个鸡眼牢牢固定。"}]}],"synonyms":["eyelet maker","grommet setter","eyelet setter","hole puncher"],"phonetic":"/ˌaɪləˈtɪr/","extraExplanation":["“eyeleteer”由“eyelet（鸡眼/扣眼）+ -eer（从事某行业的人，如 engineer, auctioneer）”构成，属于较少见的职业称呼。现代英语里更常见的说法是“eyelet maker / grommet setter”。","在服装、鞋靴、帆布、帐篷等行业，eyeleteer 的工作通常包括：冲孔（punch）、装入金属环（set/insert an eyelet）、并用工具压合固定（press/crimp）。"]}
{"word":"eyeleting","summary":{"en":"Eyeleting means making/adding reinforced small holes (eyelets), or the decorative fabric trim featuring a row of eyelet holes.","zh":"Eyeleting 指打/装鸡眼（加固小孔）的工序，也可指带有一排鸡眼孔的装饰布料/花边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making or adding eyelets (small reinforced holes) to fabric, leather, paper, etc.","zh":"给布料、皮革、纸等打/加“鸡眼”（加固小孔）的工序；打扣眼/打鸡眼"},"examples":[{"en":"Eyeleting is used to strengthen holes so laces or cords don’t tear the fabric.","zh":"打鸡眼可以加固孔洞，这样鞋带或绳子不容易把布料扯破。"},{"en":"The tailor finished the eyeleting before attaching the ribbon.","zh":"裁缝先把鸡眼打好，再缝上缎带。"}]},{"partOfSpeech":"n.","definition":{"en":"a fabric trim, strip, or material that has (or is decorated with) a row of eyelets, often used in clothing, curtains, and crafts","zh":"带有一排鸡眼孔的花边/布条/饰边（常用于衣服、窗帘和手工）"},"examples":[{"en":"She added white eyeleting to the hem of the dress.","zh":"她在裙摆处加了一圈白色鸡眼花边。"},{"en":"Eyeleting is common on summer blouses because it looks light and airy.","zh":"夏季衬衫常用鸡眼花边，因为看起来清爽透气。"}]},{"partOfSpeech":"v.","definition":{"en":"(as a verb form) to make or add eyelets to something","zh":"（动词用法）给……打/装鸡眼；在……上做扣眼"},"examples":[{"en":"They are eyeleting the canvas so it can be tied down securely.","zh":"他们正在给帆布打鸡眼，这样就能牢牢固定住。"}]}],"synonyms":["grommeting","adding eyelets","eyelet lace","broderie anglaise"],"phonetic":"/ˈaɪlɪtɪŋ/","extraExplanation":["“Eyelet”本义是“小眼睛”一样的小孔。服装与手工语境中，eyeleting/eyelet lace 常指带孔的装饰性刺绣布料；五金/维修语境中则多指用金属扣眼（grommet）加固孔洞。英美日常里，如果强调金属圈加固，常也会用 grommet。"]}
{"word":"eyelets","summary":{"en":"Eyelets are small reinforced holes or rings for threading laces/cords or for attaching and fastening items.","zh":"Eyelets 指用于穿鞋带/绳子或用于连接固定的加固小孔（孔眼/扣眼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small holes (often reinforced with a metal or stitched ring) used for threading a lace, cord, or string.","zh":"（常有金属或缝线加固的）小孔，用来穿鞋带、绳子或线。"},"examples":[{"en":"Thread the shoelace through the eyelets from bottom to top.","zh":"把鞋带从下往上依次穿过鞋孔。"},{"en":"One of the jacket’s eyelets came loose, so the cord kept slipping out.","zh":"外套的一个扣眼松了，所以绳子总是滑出来。"}]},{"partOfSpeech":"n.","definition":{"en":"Small holes or rings in fabric or material, used to attach, hang, fasten, or allow airflow/drainage.","zh":"材料或布料上的小孔或小环，用于连接、悬挂、固定，或用于通风/排水。"},"examples":[{"en":"The tarp has eyelets in the corners so you can tie it down.","zh":"防水布四角有孔眼，方便你把它绑牢。"},{"en":"The banner was hung using cords through the eyelets.","zh":"横幅用绳子穿过孔眼挂起来的。"}]}],"synonyms":["grommets","lacing holes","reinforced holes"],"phonetic":"/ˈaɪlɪts/","extraExplanation":["“Eyelet”里有“eye（眼睛）”这个词，是因为它看起来像一个小小的“眼”。常见搭配：metal eyelets（金属孔眼）、lace eyelets（鞋带孔）、reinforced eyelets（加固孔眼）。","发音与拼写注意：eyelet 的复数是 eyelets；不要和“eyelid（眼皮）”混淆。"]}
{"word":"eyeletted","summary":{"en":"Eyeleted means “having eyelets” or “fitted with reinforced holes for laces or cords,” and it can also mean “to add eyelets to something.”","zh":"Eyeleted 指“带孔眼的/有加固小孔的”，也可作动词表示“给……打孔并加固孔眼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having eyelets (small holes reinforced with metal or stitching) for threading a lace, cord, or hook.","zh":"带孔眼的；有（加固的）小孔用于穿鞋带、绳子或挂钩的。"},"examples":[{"en":"She bought a pair of eyeleted boots with thick laces.","zh":"她买了一双带金属孔眼、配粗鞋带的靴子。"},{"en":"The eyeleted curtains hang neatly on the rod.","zh":"带孔眼的窗帘整齐地挂在窗帘杆上。"}]},{"partOfSpeech":"vt.","definition":{"en":"To add eyelets to (fabric, leather, paper, etc.); to punch and reinforce holes for lacing or fastening.","zh":"给……打孔并加固孔眼（用于穿带或固定）。"},"examples":[{"en":"The tailor eyeleted the fabric so it could be laced tightly.","zh":"裁缝给布料打上加固孔眼，这样就能系得很紧。"},{"en":"We eyeleted the tag and tied it to the bag with string.","zh":"我们给标签打了孔眼，再用细绳系在包上。"}]}],"synonyms":["laced (context-dependent)","grommeted (close in meaning for metal-reinforced holes)","punched (less specific)"],"phonetic":"ˈaɪlɪtɪd","extraExplanation":["“eyeleted”常见于服装、鞋靴、窗帘、帐篷等语境，强调“有孔眼/打孔加固”的工艺。","拼写提醒：你输入的“eyeletted”多半是“eyeleted”的误拼。英式拼写有时会出现双写辅音的情况，但常见标准拼法是 eyeleted（来自名词 eyelet）。"]}
{"word":"eyeletter","summary":{"en":"An eyelet is a small reinforced hole for threading a lace or cord; it can also mean making or reinforcing such holes.","zh":"eyelet 指用于穿鞋带/绳子的加固小孔（孔眼），也可作动词表示打孔眼或加固孔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hole in cloth, leather, paper, etc., often reinforced with stitching or a metal ring, used for threading a lace, cord, or string through","zh":"（布、皮革、纸等上的）小孔眼；（常有线迹或金属圈加固的）扣眼、穿绳孔"},"examples":[{"en":"Thread the lace through the eyelets of the shoe.","zh":"把鞋带穿过鞋子的孔眼。"},{"en":"The curtain has metal eyelets along the top edge.","zh":"窗帘上边缘有一排金属孔眼。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make eyelets in something, or to reinforce a hole with an eyelet (often a metal ring)","zh":"在……上打孔眼；用孔眼圈（常为金属圈）加固孔"},"examples":[{"en":"They eyeleted the tarp so it could be tied down with rope.","zh":"他们在防水布上打了孔眼，这样就能用绳子固定住。"}]}],"synonyms":["grommet","hole","ringlet (in some contexts)"],"phonetic":"/ˈaɪlɪt/","extraExplanation":["你输入的“eyeletter”在英语里不常见，最可能是“eyelet”的拼写误差。Eyelet 来自 eye（眼睛）+ -let（表示“小”的后缀），意思是“像小眼睛一样的孔”。","常见搭配：metal eyelet（金属孔眼/鸡眼扣）、eyelet curtain（打孔窗帘/穿杆孔窗帘）、eyelet lace（穿孔花边/镂空花边）。"]}
{"word":"eyeletting","summary":{"en":"Eyeletting is the process (or act) of making or installing eyelets—reinforced holes for laces, cords, or hooks.","zh":"Eyeletting 指制作或安装“扣眼/鸡眼”（加固孔洞）的过程或行为，用于鞋带、绳子或挂钩等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making or reinforcing small holes (eyelets) in fabric, leather, or paper, often by inserting a metal or plastic ring (a grommet)","zh":"（缝纫、制鞋等）打孔并加固成“扣眼/鸡眼”（eyelet）的工序，常指加装金属或塑料孔环（grommet）"},"examples":[{"en":"The shoemaker finished the eyeletting before lacing up the boots.","zh":"鞋匠在给靴子穿鞋带之前先把扣眼加固处理好了。"},{"en":"Eyeletting helps prevent the holes from tearing when the cord is pulled tight.","zh":"加固扣眼可以防止拉紧绳子时孔洞被扯裂。"},{"en":"In crafts, careful eyeletting makes a booklet look neat and durable.","zh":"在手工制作中，细致的打孔加固能让小册子看起来整洁又耐用。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of creating or inserting eyelets (to eyelet something)","zh":"给……打扣眼/装孔环（作为动词 eyelet 的现在分词/动名词用法）"},"examples":[{"en":"She is eyeletting the curtain so it can hang on hooks.","zh":"她正在给窗帘装扣眼，好让它能挂在钩子上。"},{"en":"We spent the afternoon eyeletting leather straps for the bags.","zh":"我们花了一下午给包的皮带打扣眼。"}]}],"synonyms":["eyeleting","installing eyelets","grommeting"],"phonetic":"/ˈaɪˌlɛtɪŋ/","extraExplanation":["“eyeletting”在现代英语里很少见，更常见的拼写是“eyeleting”。意思与“eyelet（做扣眼/装孔环）”相关。","相关词：eyelet（扣眼/孔环；给……打扣眼）、grommet（鸡眼扣/金属孔环）。"]}
{"word":"eyelid","summary":{"en":"An eyelid is the movable skin that covers and protects the eye.","zh":"eyelid 指覆盖并保护眼睛、可开合的“眼睑/眼皮”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The thin piece of skin that covers and protects your eye; it opens and closes when you blink.","zh":"眼睑；眼皮（覆盖并保护眼睛的薄皮肤，眨眼时会开合）。"},"examples":[{"en":"Dust got into my eye, and my eyelid kept twitching.","zh":"灰尘进了我的眼睛，我的眼皮一直在跳。"},{"en":"She rubbed her eyelids because she was tired.","zh":"她因为疲倦揉了揉眼皮。"},{"en":"Close your eyelids and relax for a minute.","zh":"闭上眼皮，放松一分钟。"}]}],"phonetic":"/ˈaɪˌlɪd/","extraExplanation":["常见搭配：upper eyelid（上眼睑）、lower eyelid（下眼睑）、droopy eyelids（眼皮下垂）。","易混词：eyelash（睫毛）是长在眼睑边缘的毛；eyebrow（眉毛）在眼睛上方。","表达提示：英语里说“我的眼皮在跳”常用 my eyelid is twitching；也可说 my eye is twitching（更口语）。"]}
{"word":"eyelids","summary":{"en":"Eyelids are the movable skin folds that protect your eyes and blink to keep them moist.","zh":"Eyelids 指保护眼睛并通过眨眼保持湿润的可活动皮肤褶皱（眼睑/眼皮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The two movable folds of skin (upper and lower) that cover and protect the eye; they blink to keep the eye clean and moist.","zh":"眼睑；眼皮（上下两片可活动的皮肤，覆盖并保护眼睛；通过眨眼保持眼睛清洁湿润）。"},"examples":[{"en":"Her eyelids felt heavy because she was so tired.","zh":"她太累了，觉得眼皮很沉。"},{"en":"Dust got in my eye, so I blinked my eyelids quickly.","zh":"灰尘进了我的眼睛，所以我快速眨了眨眼皮。"},{"en":"He closed his eyelids and tried to relax.","zh":"他闭上眼睑，试着放松。"}]}],"synonyms":["lids (informal)"],"phonetic":"/ˈaɪˌlɪdz/","extraExplanation":["“eyelids”是“eyelid”的复数形式。英语里常用“heavy eyelids（眼皮沉）”形容困倦；“under/upper eyelid（下/上眼睑）”常见于医学或护肤语境。"]}
{"word":"eyelight","summary":{"en":"“Eyelight” is the bright reflection in a person’s eyes that makes portraits look more alive.","zh":"“Eyelight”指人像中眼睛里的高光反光点，能让眼神更有神采。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, bright reflection of a light source seen in someone’s eyes in a photo or painting, often used to make the eyes look more lively.","zh":"（摄影或绘画中）眼睛里的高光/反光点（通常来自光源），用来让眼神更有神采。"},"examples":[{"en":"The photographer adjusted the softbox to create a clean eyelight in her eyes.","zh":"摄影师调整了柔光箱，让她的眼睛里出现干净的眼部高光。"},{"en":"Without eyelight, the portrait looked flat and the eyes seemed dull.","zh":"没有眼部高光，这张人像看起来很平，眼神也显得无神。"}]}],"synonyms":["catchlight","eye light"],"phonetic":"/ˈaɪˌlaɪt/","extraExplanation":["“eyelight”在英语里多见于摄影/影视灯光圈的用法，也常写作“eye light”。更常见、更通用的术语是“catchlight”。","在布光时，eyelight通常来自主光（key light）或专门的补光（fill light），位置常放在镜头上方、略偏一侧，以产生自然的眼神高光。","不同形状的光源会产生不同形状的eyelight：柔光箱常是方形/矩形反光，环形灯常是圆环状反光。"]}
{"word":"eyelike","summary":{"en":"Eyelike means “looking like an eye.”","zh":"Eyelike 的意思是“看起来像眼睛的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an eye in shape, appearance, or function (for example, a spot, marking, or opening that looks like an eye).","zh":"像眼睛的；形状、外观或功能类似眼睛的（例如像眼睛一样的斑点、纹路或孔洞）。"},"examples":[{"en":"The butterfly has eyelike spots on its wings to scare predators.","zh":"这只蝴蝶的翅膀上有像眼睛一样的斑点，用来吓退捕食者。"},{"en":"The mask had an eyelike opening that made it look alive.","zh":"面具上有一个像眼睛的开口，让它看起来像活的一样。"}]}],"synonyms":["eye-like","ocular-like","eyespot-like"],"phonetic":"/ˈaɪˌlaɪk/","extraExplanation":["“eyelike”是由“eye + like”构成的复合形容词，常用于描述自然界中的“眼状斑”（也常写作 eye-like 或 eyeli ke 的变体，学术写作里更常见 eye-like）。","在生物学语境中，类似“眼睛的斑点”也常用更专业的词“eyespot（眼斑）”。"]}
{"word":"eyeline","summary":{"en":"Eyeline means the direction of someone’s gaze (especially in film/photos), and it can also mean the visual line created around the eyes by makeup.","zh":"Eyeline 指人的视线方向（常用于影视/摄影），也可指眼妆在眼周形成的线条或轮廓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An imaginary line showing where someone is looking, often used in film, photography, and drawing to guide composition and viewer attention.","zh":"（视线）表示某人看向哪里的一条假想线；常用于电影、摄影、绘画中帮助构图与引导观众注意力。"},"examples":[{"en":"In the shot, the actor’s eyeline points to the door, so we expect someone to enter.","zh":"在这个镜头里，演员的视线指向门口，所以我们会期待有人进来。"},{"en":"The photographer asked her to shift her eyeline slightly to the left.","zh":"摄影师让她把视线稍微往左移一点。"}]},{"partOfSpeech":"n.","definition":{"en":"In fashion and grooming, the visual line or shape created around the eyes by makeup (especially eyeliner) or styling.","zh":"（美容/造型）由眼妆（尤其是眼线）或造型在眼周形成的视觉线条或轮廓。"},"examples":[{"en":"A sharp eyeline can make the eyes look bigger.","zh":"利落的眼部线条能让眼睛看起来更大。"},{"en":"She softened her eyeline with a smudged pencil liner.","zh":"她用晕染的眼线笔让眼部线条更柔和。"}]}],"synonyms":["line of sight","gaze direction","eye line","eyeliner line"],"phonetic":"/ˈaɪˌlaɪn/","extraExplanation":["在影视里常见的搭配是“match eyelines / eyeline match（视线匹配）”：先给一个人看向某处的镜头，再切到他/她所看的对象或方向，这样观众更容易理解空间关系与叙事。"]}
{"word":"eyeliner","summary":{"en":"Eyeliner is makeup used to define the eyes, and it can also mean applying that makeup.","zh":"Eyeliner 指用来勾勒眼睛轮廓的眼线化妆品，也可指“画眼线”这个动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cosmetic used to outline or define the eyes, applied along the eyelids or lash line.","zh":"眼线（化妆品）：沿眼睑或睫毛根部描画，用来勾勒和强调眼睛轮廓。"},"examples":[{"en":"She put on eyeliner to make her eyes look bigger.","zh":"她画了眼线，让眼睛看起来更大。"},{"en":"Waterproof eyeliner is useful on rainy days.","zh":"防水眼线在下雨天很实用。"}]},{"partOfSpeech":"v.","definition":{"en":"To apply eyeliner to the eyes.","zh":"画眼线；给眼睛上眼线。"},"examples":[{"en":"It takes me two minutes to eyeliner my left eye, but five minutes for the right.","zh":"我给左眼画眼线只要两分钟，但右眼要五分钟。"},{"en":"She carefully eyelinered along the upper lash line.","zh":"她沿着上睫毛根部小心地画了眼线。"}]}],"synonyms":["eye makeup","liner"],"phonetic":"/ˈaɪˌlaɪnɚ/","extraExplanation":["“Eyeliner”常见类型：铅笔式（pencil）、液体式（liquid）、凝胶式（gel）。搭配的常见表达有：winged eyeliner（猫眼/上扬眼线）、tightline（填内眼线）、smudged eyeliner（晕染眼线）。","在日常英语里，“apply eyeliner / put on eyeliner”更常用；把它当动词（to eyeliner / eyelinered）也能用，但更口语、相对少见。"]}
{"word":"eyeliners","summary":{"en":"“Eyeliners” is the plural of “eyeliner,” a cosmetic used to line and define the eyes.","zh":"“eyeliners”是“eyeliner”的复数，指用来画眼线、强调眼部轮廓的化妆品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cosmetic used to define or emphasize the eyes by drawing a line along the eyelids, especially near the eyelashes.","zh":"眼线笔/眼线液（化妆品）：沿着眼睑（尤其睫毛根部）画线，用来强调和修饰眼睛。"},"examples":[{"en":"She wears eyeliner every day to make her eyes look bigger.","zh":"她每天都画眼线，让眼睛看起来更大。"},{"en":"Waterproof eyeliners are helpful in hot weather.","zh":"在炎热天气里，防水眼线更实用。"}]}],"synonyms":["eye makeup","liner"],"phonetic":"/ˈaɪˌlaɪnɚ/","extraExplanation":["“eyeliners”是“eyeliner”的复数形式。英语里说化妆品时，复数常表示“多种/多支/不同类型的产品”（例如：different eyeliners）。","常见搭配：pencil eyeliner（眼线笔）、liquid eyeliner（眼线液）、gel eyeliner（眼线膏）、waterproof/smudge-proof（防水/防晕染）、apply/remove eyeliner（画/卸眼线）。"]}
{"word":"eyemark","summary":{"en":"Eyemark can mean to notice and single out something visually, or a distinctive feature that stands out and helps you recognize a place or thing.","zh":"Eyemark 可指“用目光辨认并记住（锁定）”，也可指“醒目的特征/标记”，便于一眼识别或定位。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to notice or pick out something by looking carefully; to single out visually and remember","zh":"用眼睛仔细辨认并记住；用目光挑出来（锁定某人/某物）"},"examples":[{"en":"I eyemarked the exit as soon as I walked into the theater.","zh":"我一走进剧院就用眼睛先把出口位置记住了。"},{"en":"She eyemarked the person in the blue jacket as the one who asked the question.","zh":"她用目光锁定了穿蓝色夹克的那个人就是提问者。"}]},{"partOfSpeech":"n.","definition":{"en":"a distinctive feature or spot that catches your attention; something easy to recognize at a glance","zh":"醒目的特征/标记；一眼就能认出来的地方（显眼点）"},"examples":[{"en":"The red door is an eyemark you can use to find the house.","zh":"那扇红门是个显眼标记，你可以靠它找到那栋房子。"},{"en":"In the photo, the mountain peak serves as an eyemark on the horizon.","zh":"在照片里，那座山峰成了地平线上的醒目标记。"}]}],"synonyms":["spot","identify","single out","recognize","landmark","visual cue","distinctive feature"],"phonetic":"/ˈaɪˌmɑrk/","extraExplanation":["“eyemark”在现代日常英语中不算常见，更常见的写法是带连字符的“eye-mark”，或直接用更常用的词：动词用“spot / identify / single out”，名词用“landmark / distinctive feature / visual cue”。","作为动词时，它带有“用目光记住、以便之后能认出来”的感觉，常用于描述进场先记出口、在人群中锁定某人等场景。"]}
{"word":"eyen","summary":{"en":"“Eyen” is an archaic word meaning “eyes.” In modern English, use “eyes.”","zh":"“eyen”是古语，意思是“眼睛（eyes）”。现代英语请用“eyes”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) the plural form of “eye” (meaning “eyes”).","zh":"（古语）“eye”的复数形式，意为“眼睛（eyes）”。"},"examples":[{"en":"In old poems, you may see “his eyen” meaning “his eyes.”","zh":"在古诗里你可能会看到“his eyen”，意思就是“his eyes（他的眼睛）”。"},{"en":"The knight looked with bright eyen into the distance.","zh":"骑士用明亮的眼睛望向远方。"}]}],"synonyms":["eyes"],"phonetic":"/ˈaɪən/","extraExplanation":["“eyen”常见于中古英语/早期现代英语作品里（如乔叟 Chaucer 的文字风格中），属于古体复数形式。现代英语里几乎不用，日常写作请用“eyes”。","如果你本来想查的是“eye”（眼睛）或“eyes”，告诉我你的句子，我可以按你需要解释更常见的用法。"]}
{"word":"eyeopener","summary":{"en":"An eye-opener is something surprising that makes you realize the truth; less commonly, it can mean an early-day drink meant to “wake you up.”","zh":"eye-opener 指让人震惊、从而看清事实并“长见识/醒悟”的事；较少见时也指早晨用来“提神/醒酒”的饮品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something surprising or shocking that makes you realize the truth about a situation (often changing your opinion).","zh":"让人吃惊、震撼，从而让你看清事实或改变看法的事（常指“长见识/醒悟”）。"},"examples":[{"en":"The documentary was a real eye-opener about how much food we waste.","zh":"那部纪录片真是让我大开眼界，才知道我们浪费了这么多食物。"},{"en":"Living abroad was an eye-opener for her—it changed how she saw her own culture.","zh":"在国外生活对她来说是一次“开眼界”的经历——也改变了她看待自己文化的方式。"},{"en":"It was an eye-opener to learn how expensive healthcare can be.","zh":"了解到医疗费用可能这么高，真是让人震惊又醒悟。"}]},{"partOfSpeech":"n.","definition":{"en":"A drink (especially an alcoholic one) taken early in the day as a “wake-up” or pick-me-up (informal).","zh":"（尤指酒精饮料）早上喝的“提神/醒酒”饮品（非正式用法）。"},"examples":[{"en":"He joked that a Bloody Mary is the perfect eye-opener on a lazy Sunday.","zh":"他开玩笑说，懒散的周日来一杯血腥玛丽最“提神”。"},{"en":"Some people consider strong coffee their morning eye-opener.","zh":"有些人把浓咖啡当作早晨的“醒脑神器”。"}]}],"synonyms":["revelation","wake-up call","surprise","shock","rude awakening","lesson"],"phonetic":"/ˈaɪˌoʊpənɚ/","extraExplanation":["拼写上常见 eye-opener（带连字符）或 eye opener（分开写）；口语里也会说 a real eye-opener 来强调“特别让人震撼/长见识”。","语气通常是非正式到中性：第一义更常用，既可指一次经历、一本书/一部影片，也可指一条信息或事实。","第二义带一点幽默或俚语色彩，传统上多指“早上喝的酒”；现代也有人把咖啡等提神饮料也称作 eye-opener，但要看语境避免误解。"]}
{"word":"eyepiece","summary":{"en":"An eyepiece is the part of a microscope or telescope that you look through.","zh":"Eyepiece 指显微镜或望远镜上用来“看进去”的目镜部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lens or set of lenses you look through in an optical instrument (such as a microscope or telescope)","zh":"（显微镜、望远镜等光学仪器的）目镜；接目镜"},"examples":[{"en":"Look through the eyepiece and slowly adjust the focus.","zh":"从目镜看进去，然后慢慢调焦。"},{"en":"This telescope comes with two eyepieces for different magnifications.","zh":"这台望远镜配有两个不同倍率的目镜。"}]}],"synonyms":["ocular","ocular lens"],"phonetic":"/ˈaɪˌpis/","extraExplanation":["在显微镜/望远镜里，eyepiece 通常指靠近眼睛的一端镜组；与之对应的 objective 是靠近物体、负责主要成像的“物镜”。两者搭配决定清晰度与放大效果。","也常见相关说法：through the eyepiece（通过目镜观看）、eyepiece lens（目镜镜片）、eyepiece cap（目镜盖）。"]}
{"word":"eyepieces","summary":{"en":"Eyepieces are the lenses you look through on optical instruments (plural of eyepiece).","zh":"Eyepieces 指光学仪器上供你观看的目镜，是 eyepiece 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lens (or set of lenses) you look through on an optical instrument such as a telescope, microscope, or binoculars.","zh":"（望远镜、显微镜、双筒望远镜等光学仪器的）目镜；接目镜（你用眼睛贴近观看的镜片或镜组）。"},"examples":[{"en":"These binoculars come with two interchangeable eyepieces.","zh":"这副双筒望远镜配有两个可更换的目镜。"},{"en":"He adjusted the microscope’s eyepiece to get a clearer view.","zh":"他调了显微镜的目镜，以获得更清晰的视野。"},{"en":"Try not to touch the eyepiece with your eyelashes; it can smudge the lens.","zh":"尽量别让睫毛碰到目镜，否则容易把镜片弄脏。"}]},{"partOfSpeech":"other","definition":{"en":"The plural form of eyepiece.","zh":"“eyepiece”的复数形式。"},"examples":[{"en":"The telescope kit includes three eyepieces of different magnifications.","zh":"这套望远镜套件包含三个不同倍率的目镜。"}]}],"synonyms":["oculars","ocular lenses"],"phonetic":"/ˈaɪˌpis/","extraExplanation":["“Eyepiece”在英式英语里也常叫“ocular”。不同目镜会影响放大倍率和视野（例如更高倍率通常视野更窄、画面更暗）。","常见搭配：eyepiece lens（目镜镜片）、eyepiece cap（目镜盖）、interchangeable eyepieces（可更换目镜）。"]}
{"word":"eyepit","summary":{"en":"“Eyepit” is a rare word meaning the eye socket (orbit).","zh":"“eyepit”是个罕见词，意思是眼窝/眼眶（eye socket / orbit）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the eye socket; the hollow in the skull where the eyeball sits (also called the “orbit”).","zh":"（罕见）眼窝；眼眶（眼球所在的颅骨凹陷处，也叫 orbit）。"},"examples":[{"en":"The injury left bruising around the eyepit.","zh":"这次受伤导致眼窝周围出现了瘀青。"},{"en":"In older medical writing, “eyepit” may refer to the bony socket of the eye.","zh":"在较早的医学写作中，“eyepit”有时指眼眶的骨性凹陷。"}]}],"synonyms":["eye socket","orbit"],"phonetic":"/ˈaɪˌpɪt/","extraExplanation":["“eyepit”在现代英语里非常少见，多数情况下人们会说“eye socket”或“orbit”。如果你是在解剖/医学语境看到它，基本可按“眼眶/眼窝”理解。","它也可能是拼写或分词差异（eye pit）。如果你愿意，可以把你看到它的原句发我，我可以帮你更准确判断意思。"]}
{"word":"eyepoint","summary":{"en":"Eyepoint means the position or perspective from which something is seen, often used in writing, film, photography, and 3D/VR.","zh":"Eyepoint 指观察某物的视点/视角（强调“从哪里看”），常用于写作、电影、摄影及3D/VR语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position (real or imagined) from which someone sees a scene; a viewpoint or perspective","zh":"观察点；视点；（真实或想象的）观看场景的位置；观点/视角"},"examples":[{"en":"From the child’s eyepoint, the counter looks incredibly high.","zh":"从孩子的视点看，柜台显得特别高。"},{"en":"The director shifts the eyepoint to make the audience feel uneasy.","zh":"导演改变视点，让观众感到不安。"},{"en":"Try writing the story from a different eyepoint.","zh":"试着从另一个视角来写这个故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(photography/graphics) the effective viewpoint of a camera, viewer, or virtual camera, especially in 3D or AR/VR; often tied to where the eye or lens is placed","zh":"（摄影/图形学）相机、观察者或虚拟相机的有效视角/机位（尤其用于3D或AR/VR），常与眼睛或镜头的位置相关"},"examples":[{"en":"Move the camera’s eyepoint slightly left to reduce distortion.","zh":"把相机的视点稍微向左移，减少变形。"},{"en":"In VR, the eyepoint must match the user’s head position.","zh":"在VR中，视点必须与用户头部位置一致。"}]}],"synonyms":["viewpoint","vantage point","perspective","point of view","camera angle"],"phonetic":"/ˈaɪˌpɔɪnt/","extraExplanation":["“Eyepoint”由 eye + point 组成，意思直观：眼睛所在的“点”。它比“viewpoint”更强调“从哪里看”（位置/机位），而“viewpoint”更常强调“怎么看”（观点/立场）。在写作与电影中，改变 eyepoint 往往会改变读者/观众的情绪与信息获取。"]}
{"word":"eyepoints","summary":{"en":"“Eyepoints” is the plural of “eyepoint,” meaning the correct eye position to see a full view through an eyepiece, or a viewpoint in 3D/design.","zh":"eyepoints 是 eyepoint 的复数，指通过目镜看到完整画面的正确眼睛位置；也可指三维/设计中的视点（观察点、虚拟相机位置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Optics/photography) The position where your eye should be placed to see the full image through an eyepiece (for example, in a camera viewfinder, telescope, binoculars, or a scope).","zh":"（光学/摄影）眼点：眼睛应放置的位置，从目镜处才能看到完整视场的图像（如相机取景器、望远镜、双筒望远镜或瞄准镜）。"},"examples":[{"en":"If your eye is not at the right eyepoint, the edges of the view will look dark.","zh":"如果你的眼睛不在正确的眼点位置，画面边缘会变暗。"},{"en":"This scope has a comfortable eyepoint, so it’s easier to aim quickly.","zh":"这个瞄准镜的眼点很舒适，所以更容易快速瞄准。"}]},{"partOfSpeech":"n.","definition":{"en":"(3D graphics/design) The viewpoint or virtual camera position from which a scene is seen.","zh":"（三维图形/设计）视点：观看场景的观察位置或虚拟相机的位置。"},"examples":[{"en":"Move the eyepoint higher to make the room feel more open.","zh":"把视点提高一些，会让房间看起来更开阔。"},{"en":"Changing the eyepoint changes what the viewer notices first.","zh":"改变视点会改变观众最先注意到的内容。"}]}],"synonyms":["viewpoint","eye position","vantage point","camera position"],"phonetic":"/ˈaɪˌpɔɪnts/","extraExplanation":["在光学里，eyepoint 常和 eye relief（出瞳距离/眼距）一起出现：eye relief 是“眼点到目镜最后一片镜片的大致距离”，距离太近可能会碰到镜片，太远则会出现“黑影/隧道感”（视场被遮住）。","在实际使用中，调整眼点的方法通常是：把眼睛缓慢前后移动，直到画面最亮、视野最完整、边缘不发黑为止。"]}
{"word":"eyepopper","summary":{"en":"An informal word for something amazingly surprising or striking.","zh":"口语：形容非常惊人、醒目或震撼的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is extremely surprising, impressive, or shocking—so striking that it makes people open their eyes wide.","zh":"非常令人惊讶、震撼或惊艳的事物——夸张地说会让人“瞪大眼睛”。"},"examples":[{"en":"That final plot twist was a real eyepopper.","zh":"最后那个剧情反转真是让人大吃一惊。"},{"en":"The view from the mountaintop is an eyepopper at sunrise.","zh":"日出时山顶的景色美得让人惊艳。"},{"en":"The new phone’s price is an eyepopper.","zh":"这款新手机的价格高得让人震惊。"}]}],"synonyms":["stunner","shock","surprise","showstopper","jaw-dropper"],"phonetic":"/ˈaɪˌpɑpər/","extraExplanation":["“eyepopper”是非正式口语，常见拼写也有“eye-popper”。语气通常偏夸张，既可表达“惊艳/太厉害了”，也可表达“太离谱/太震撼了”，要看上下文。","它来自“make your eyes pop（让你眼睛都要‘瞪出来’）”这种形象化说法，用来强调强烈的视觉或情绪冲击。"]}
{"word":"eyer","summary":{"en":"“Eyer” is uncommon in modern English. It can mean a watcher (rare) or be used as a surname.","zh":"“eyer”在现代英语中不常见，可指“观察者”（较罕见），也可作姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A person who watches or looks at something; someone who “eyes” something.","zh":"（罕见）观察者；盯着看某物的人；“用眼打量”的人。"},"examples":[{"en":"He was an eyer of details, noticing small mistakes others missed.","zh":"他很会观察细节，能发现别人忽略的小错误。"},{"en":"The museum guard stayed an alert eyer on the crowd.","zh":"博物馆保安警觉地盯着人群。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"（专有名词）姓氏。"},"examples":[{"en":"Dr. Eyer will see you now.","zh":"Eyer 医生现在可以见你了。"},{"en":"The article was written by Maria Eyer.","zh":"这篇文章由 Maria Eyer 撰写。"}]}],"synonyms":["watcher","observer","looker"],"phonetic":"/ˈaɪ.ər/","extraExplanation":["“eyer”在现代英语中不算常用词。你如果是想查“eye”（眼睛/注视）或“eyre”（较少见，常见于人名，如《Jane Eyre》中的 Eyre，或旧时法律用语）可能更常见。若你告诉我你看到它的句子/上下文，我可以帮你判断是哪一个词或是否拼写有误。"]}
{"word":"eyereach","summary":{"en":"“Eyereach” means the farthest distance you can see—your visible range, often like “as far as the eye can reach.”","zh":"“Eyereach”指目光所及的最远距离，即可见范围，意思接近“as far as the eye can reach（一望无际）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the farthest distance you can see; the visible horizon (often used as “as far as the eye can reach”)","zh":"目光所及之处；视野所到的最远距离（常用于“as far as the eye can reach”）"},"examples":[{"en":"Golden wheat fields stretched to the eyereach.","zh":"金色的麦田一直延伸到目光所及之处。"},{"en":"There were no buildings in eyereach—only open desert.","zh":"目光所及之处没有任何建筑，只有开阔的沙漠。"},{"en":"Snow covered everything within eyereach.","zh":"目光所及之处都被白雪覆盖。"}]}],"synonyms":["as far as the eye can see","within sight","in view","visible range","horizon"],"phonetic":"/aɪ riːtʃ/","extraExplanation":["“eyereach”并不是最常见的标准拼写；更常见的表达是 “as far as the eye can see/reach”（一望无际）或名词短语 “within sight / in view”（在视线范围内）。在一些诗歌式或描写性写作中，有人会把 “eye reach” 写成连字符或合写（eye-reach / eyereach）来强化画面感。","在写作里它带有比较文学/描景的色彩，适合风景描写（田野、海面、沙漠等）。正式写作中建议用更常规的表达，以免读者觉得不自然。"]}
{"word":"eyeroot","summary":{"en":"“eyeroot” is uncommon; it usually means “eye-root,” a Buddhist term for the eye as a sense faculty (one of the six roots).","zh":"“eyeroot”不常见；通常指“eye-root（眼根）”，佛教用语，指作为感官能力的眼（六根之一）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Buddhism) the eye as a sense faculty—the physical basis for seeing, one of the “six sense bases/roots.”","zh":"（佛教）“眼根”，指作为感官能力的眼，是视觉产生的生理基础之一，属于“六根/六处”之一。"},"examples":[{"en":"In Buddhist texts, “eye-root” refers to the faculty that enables visual experience.","zh":"在佛教文本中，“eye-root（眼根）”指能产生视觉经验的感官能力。"},{"en":"Practice begins by guarding the eye-root so you’re not carried away by what you see.","zh":"修行常从“护眼根”开始，不被所见之境牵着走。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) the root/base area of the eye; used loosely in some contexts for the part where the eye “begins,” but this is not standard medical English.","zh":"（少见）眼的根部/基部；有时被松散地用来指眼“起始”的部位，但这不是标准医学英语。"},"examples":[{"en":"The poet described a tear forming near the eye-root (an uncommon phrasing).","zh":"诗人写泪在“眼根处”凝起（这种说法不常见）。"}]}],"synonyms":["eye faculty","visual faculty","sense base (eye)","sense organ (eye)"],"phonetic":"ˈaɪˌruːt","extraExplanation":["“eye-root”常见于佛经英译（如巴利语/梵语传统）中，对应“眼根”，与“耳根、鼻根、舌根、身根、意根”并列，合称“六根”。它强调的是“感官能力/感官门”而不只是解剖结构。","在更常见的现代英语里，讨论佛教语境时也会写作“eye faculty”“visual faculty”或“sense base (of the eye)”。如果你是在非佛教语境看到 eyeroot，可能是作者自造词或把两个词合写。"]}
{"word":"eyers","summary":{"en":"“Eyers” is most commonly a surname; as a common noun it can rarely mean the plural of “eyer” (someone who watches).","zh":"“Eyers”最常见是姓氏；作为普通名词时很少见，可指“eyer（观察者）”的复数。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name).","zh":"（人名）姓氏。"},"examples":[{"en":"Dr. Eyers will see you now.","zh":"Eyers 医生现在会见你。"},{"en":"I read an article by Maria Eyers.","zh":"我读了一篇 Maria Eyers 写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of eyer: a person who watches or observes (rare).","zh":"eyer 的复数：观察者、注视的人（罕用）。"},"examples":[{"en":"In the poem, the eyers of the city never sleep.","zh":"在这首诗里，城市的观察者从不入睡。"},{"en":"The guards were silent eyers in the hallway.","zh":"守卫在走廊里沉默地注视着。"}]}],"phonetic":"/ˈaɪ.ərz/","extraExplanation":["“Eyers”最常见是姓氏（专有名词），在日常英语里一般不当作普通词汇使用。","它也可能是拼写误差：如果你想表达“眼睛”，应写作“eyes”；如果是动词第三人称单数“注视”，是“eyes”（例如：He eyes the prize.）。","发音通常与“Eyre(s)”或“ire(s)”接近（/ˈaɪ.ərz/），但不同家族可能会有不同读法。"]}
{"word":"eyes","summary":{"en":"“Eyes” is the plural of “eye,” meaning the organs of sight, and it can also mean people’s attention or a skillful sense of judging quality or beauty.","zh":"“eyes”是“eye”的复数，表示“眼睛”，也可引申为“目光/关注”，或指善于判断品质与美感的“眼光”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “eye”: the organs you use to see; also used to mean someone’s look or attention.","zh":"“eye”的复数：眼睛；也可指某人的目光、关注。"},"examples":[{"en":"Her eyes are blue.","zh":"她的眼睛是蓝色的。"},{"en":"All eyes were on the speaker.","zh":"所有人的目光都集中在演讲者身上。"},{"en":"Keep your eyes on the road.","zh":"把注意力放在路上。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) the ability to notice and judge something well, especially beauty, quality, or detail.","zh":"（非正式）鉴赏力/眼光：善于发现并判断美感、质量或细节的能力。"},"examples":[{"en":"She has a good eye for design.","zh":"她很有设计眼光。"},{"en":"He has an eye for detail.","zh":"他很注重细节。"}]}],"synonyms":["gaze","look","attention","watchfulness","vision"],"phonetic":"/aɪz/","extraExplanation":["“eyes”常用于固定表达来强调“注意力/关注”：如“keep an eye on…（照看/留意）”“have your eyes on…（盯上/想要）”“catch someone’s eye（吸引某人注意）”。","注意：“eye”作单数时也可表示“洞察力/眼光”（a good eye），复数“eyes”更常指真实的“眼睛”或“目光（all eyes on…）”。"]}
{"word":"eyesalve","summary":{"en":"Eyesalve is an ointment for the eyes, and it can also mean (figuratively) something that helps you see the truth more clearly.","zh":"Eyesalve 指眼部药膏；也可作比喻，表示让人更清楚地看见真相的洞察或启迪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ointment or medicinal salve applied to the eyes to soothe irritation or treat an eye condition.","zh":"眼药膏；眼部药膏（涂在眼睛周围或用于眼部不适/眼疾的药膏）"},"examples":[{"en":"The doctor prescribed an eyesalve for her irritated eyelids.","zh":"医生给她开了眼药膏，用来缓解眼睑的刺激和不适。"},{"en":"Use the eyesalve exactly as directed and wash your hands before applying it.","zh":"按医嘱使用眼药膏，并在涂抹前洗手。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, often religious) Something that helps a person see clearly or understand the truth; spiritual or moral insight.","zh":"（比喻，常见于宗教语境）使人看清真相的“眼药”；属灵/道德上的洞察与醒悟"},"examples":[{"en":"For him, education was an eyesalve that helped him see the world differently.","zh":"对他来说，教育就像一剂“眼药”，让他用不同的眼光看世界。"},{"en":"The speaker described humility as eyesalve for the soul.","zh":"演讲者把谦卑形容为灵魂的“眼药”，使人看得更清楚。"}]}],"synonyms":["eye ointment","eye salve","ointment","salve","(figurative) insight","(figurative) clarity"],"phonetic":"/ˈaɪˌsælv/","extraExplanation":["“eyesalve”在现代日常英语中不常用；更常见的说法是“eye ointment”或“eye salve”。","在《圣经·启示录》(Revelation) 3:18 中出现过“anoint your eyes with eye salve, that you may see”（用眼药擦你的眼，使你能看见）。因此它常被用作隐喻，表示获得属灵洞察、认清现实或看见真理。"]}
{"word":"eyeseed","summary":{"en":"Eyeseed is a rare, old-fashioned word meaning a tear, and sometimes the crusty discharge in the corner of the eye after sleep.","zh":"Eyeseed 是少见的旧式用词，通常指“眼泪”，有时也指“睡醒后眼角的分泌物（眼屎）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialectal/poetic) A tear; a drop of moisture from the eye.","zh":"（方言/诗意用法）眼泪；从眼睛流出的泪滴。"},"examples":[{"en":"An eyeseed slipped down her cheek when she heard the news.","zh":"听到这个消息时，一滴眼泪顺着她的脸颊滑落。"},{"en":"The poem speaks of “eyeseed” as a sign of quiet grief.","zh":"这首诗把“eyeseed（泪滴）”写成无声悲伤的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A small crust or sticky discharge found in the corner of the eye after sleep (similar to “sleep” in the eye).","zh":"（罕见）睡醒后眼角的分泌物/眼屎（类似英语里的“sleep in your eyes”）。"},"examples":[{"en":"He rubbed the eyeseed from the corner of his eye.","zh":"他揉掉了眼角的分泌物。"}]}],"synonyms":["tear","teardrop","eye discharge","sleep (in your eyes)"],"phonetic":"/ˈaɪˌsiːd/","extraExplanation":["“eyeseed”不是现代英语里的常用词，更常见的表达是 tear（眼泪）或 sleep/goop in your eyes（眼角分泌物）。它带有旧式/方言色彩，有时在诗歌或仿古写法里用来营造更形象的感觉：像“眼睛结出的种子”一样的一滴泪。"]}
{"word":"eyeservant","summary":{"en":"An eye-servant is someone who works hard only when being watched, mainly to look good.","zh":"eyeservant 指只在被监督时才认真做事、主要为了让人觉得自己很勤快的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works only when being watched, seeming diligent to please a boss but not truly responsible.","zh":"只在被人盯着时才卖力做事的人；做给人看的“表面勤快”的人。"},"examples":[{"en":"He’s not lazy exactly, but he can be an eye-servant—busy when the manager walks by, slow when no one is looking.","zh":"他倒不一定懒，但有点像“眼前仆人”——经理一走过来就忙得很，没人看时就慢吞吞。"},{"en":"The team needed self-discipline, not eye-servants who only performed for appearances.","zh":"团队需要自律，而不是只为面子表现、只在有人看时才做事的人。"}]}],"synonyms":["show-off worker","yes-man (partial)","men-pleaser (contextual)","slacker (opposite in nuance)"],"phonetic":"/ˈaɪˌsɝːvənt/","extraExplanation":["这个词较少见，更常见的相关词是 eyeservice（做给人看的工作、只在被监督时才认真）。eye-servant/eyeservant 的观念常与《圣经》中的用语联系在一起（如“not with eyeservice, as menpleasers”），批评那种只求取悦上级、缺乏内在责任感的工作态度。属于带有道德评判色彩的词，用在正式场合要注意语气。"]}
{"word":"eyeserver","summary":{"en":"“eyeserver” is not standard English; it’s likely a tech compound meaning a server for eye/vision data, or a misspelling/product name.","zh":"“eyeserver”不是标准英语词；更可能是技术复合词（用于眼部/视觉数据的服务器），或是拼写错误/产品名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard dictionary word) A tech-style compound that could mean “a server (computer) used for eye/vision systems,” for example storing or processing eye‑tracking or camera data.","zh":"（非标准词，词典中通常没有）一种偏技术的复合写法，可能指“用于眼部/视觉系统的服务器（电脑）”，例如存储或处理眼动追踪或摄像头数据的服务器。"},"examples":[{"en":"The lab connected the eye tracker to an eye server to store the recordings.","zh":"实验室把眼动仪连接到“eyeserver”，用来保存记录数据。"},{"en":"Check the eye server logs if the cameras stop streaming.","zh":"如果摄像头停止推流，查看“eyeserver”的日志。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling or a product/project name; the intended word may be different depending on context.","zh":"常见于拼写错误或产品/项目名；具体想表达的词可能取决于上下文。"},"examples":[{"en":"Did you mean “observer” or “IIS server”? “eyeserver” isn’t common English.","zh":"你是想写“observer（观察者）”还是“IIS server（IIS 服务器）”？“eyeserver”并不是常见英语。"}]}],"synonyms":["eye server (as two words)","(context-dependent) vision server","(possible intended word) observer"],"phonetic":"/ˈaɪ ˌsɝvɚ/","extraExplanation":["“eyeserver”更像是技术圈的自造词（compound）或项目名，而不是通用英语词汇。如果你能提供一句原文或它出现的领域（如医疗、眼动追踪、安防摄像头、游戏/VR），我可以帮你判断它具体指什么。","如果你是想找发音相近或拼写相近的常见词，可能包括：observer（观察者）、server（服务器）、Eye Server（作为产品名/专有名词）。"]}
{"word":"eyeservice","summary":{"en":"Eyeservice means doing work mainly to be seen, not to truly do a good job.","zh":"Eyeservice 指“做给人看的工作/表面功夫”，并非真正尽责。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Work done only when someone is watching, especially to create a good impression rather than from real responsibility.","zh":"只在有人监督时才做的工作；为给人留下好印象而做、缺乏真正责任感的表现。"},"examples":[{"en":"He worked hard only when the manager was nearby—it was pure eyeservice.","zh":"他只有经理在旁边时才努力工作——这完全是“做给人看的”。"},{"en":"The company wants real results, not eyeservice.","zh":"公司要的是实际成果，不是表面功夫。"},{"en":"In class, copying notes just to look busy is a kind of eyeservice.","zh":"在课堂上为了看起来很忙而抄笔记，也是一种“做样子”。"}]}],"synonyms":["work for show","showy effort","performative work","lip service"],"phonetic":"/ˈaɪˌsɝːvɪs/","extraExplanation":["“eyeservice”常见于基督教文化语境，出自《圣经》英译本（如 KJV）：意思是“眼前的服事/做给人看的服事”，强调只在别人看见时才表现。现代英语里更常写作 **eye service**（两词）或 **eye-service**（连字符）。","近义表达：**work for show**（做样子）、**put on a show**（装样子）、**performative effort**（表演式努力）。反义表达：**work ethic**（职业操守）、**integrity**（诚信）、**conscientious work**（尽责工作）。"]}
{"word":"eyeshade","summary":{"en":"An eyeshade is something that blocks light from your eyes, such as a sun visor or a sleep mask.","zh":"eyeshade 指用来挡光、保护眼睛的遮光物，比如遮阳板或睡眠眼罩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A screen or cover that blocks light from your eyes (for example, a sun visor, a blindfold, or a shade on a lamp that prevents glare).","zh":"遮光物；用来挡住刺眼光线、保护眼睛的遮罩（如遮阳帽檐、眼罩，或用于防眩光的灯罩）。"},"examples":[{"en":"He pulled down the car’s eyeshade to block the afternoon sun.","zh":"他把车上的遮阳板放下来，挡住下午的阳光。"},{"en":"An eyeshade helps you sleep on a bright airplane cabin.","zh":"在机舱很亮的情况下，眼罩能帮助你睡觉。"}]},{"partOfSpeech":"n.","definition":{"en":"A visor-like hood or adjustable shade on some helmets or caps that protects the eyes from bright light.","zh":"（某些头盔或帽子上的）遮阳罩；可调的遮光帽檐，用来保护眼睛不受强光刺激。"},"examples":[{"en":"The cyclist adjusted the helmet’s eyeshade before the ride.","zh":"骑行者在出发前调好了头盔的遮阳罩。"}]}],"synonyms":["eye mask","sleep mask","visor","sun visor","blindfold"],"phonetic":"/ˈaɪˌʃeɪd/","extraExplanation":["“eyeshade”有时会与“eyeshadow（眼影）”混淆：eyeshade 是“遮光/挡光”的东西；eyeshadow 是化妆品。","常见近义表达：sleep mask（睡眠眼罩）、eye mask（眼罩）、visor（遮阳板/帽檐）、sun visor（汽车遮阳板）。注意 car sun visor 比 eyeshade 更常用。"]}
{"word":"eyeshades","summary":{"en":"Eyeglass-like or visor-like coverings that shade the eyes from bright light; often sunglasses, sometimes a sleep/light-blocking eye cover.","zh":"用于遮挡强光、保护眼睛的遮光用品；常指太阳镜，也可指用于睡眠/遮光的眼罩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dark glasses (sunglasses) worn to reduce glare and protect the eyes from bright light.","zh":"（用于遮光的）深色眼镜；太阳镜。"},"examples":[{"en":"He put on his eyeshades before stepping into the bright sun.","zh":"他走到强烈的阳光下之前戴上了太阳镜。"},{"en":"The driver wore eyeshades to cut the glare from the road.","zh":"司机戴着太阳镜以减少路面反光。"}]},{"partOfSpeech":"n.","definition":{"en":"A visor-like shade worn over the eyes (sometimes for sleep or to block light).","zh":"（有时指）遮光眼罩；遮光用的护眼罩（用于睡觉或阻挡光线）。"},"examples":[{"en":"She used eyeshades on the flight to sleep more easily.","zh":"她在飞行途中戴上遮光眼罩，更容易入睡。"},{"en":"The patient wore eyeshades after the procedure because the lights felt too bright.","zh":"手术后病人戴上遮光护眼罩，因为灯光太刺眼。"}]}],"synonyms":["sunglasses","shades","dark glasses","eye mask","sleep mask"],"phonetic":"/ˈaɪˌʃeɪdz/","extraExplanation":["“eyeshades”在美式英语里有时也会让人想到“green eyeshade”（绿色遮光眼罩），一种传统的办公遮光用品，常与会计、出纳等需要长时间看账本/文件的职业形象关联。","日常口语中，如果你指“太阳镜”，更常用的是“sunglasses”。“eyeshades”有时更强调“遮光/防眩”的功能，或指“睡眠眼罩”这一类遮光用品。"]}
{"word":"eyeshield","summary":{"en":"An eyeshield is something worn over the eyes—either to protect them or to block light for sleep.","zh":"eyeshield 指戴在眼睛上的遮挡物，可用于保护眼睛或遮光助眠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protective cover worn over the eyes to prevent injury from impact, debris, chemicals, or bright light (often used in sports, labs, or medical settings).","zh":"护目罩；护眼罩（覆盖在眼睛前，用于防止撞击、飞屑、化学品或强光伤害，常见于运动、实验室或医疗场景）。"},"examples":[{"en":"Wear an eyeshield when you use power tools.","zh":"使用电动工具时要戴护目罩。"},{"en":"The doctor gave him an eyeshield after the eye surgery.","zh":"眼部手术后，医生给了他一个护眼罩。"}]},{"partOfSpeech":"n.","definition":{"en":"A soft cover worn over the eyes to block light, especially for sleeping (similar to a sleep mask).","zh":"眼罩（用于遮光，尤其是睡觉时；类似睡眠眼罩）。"},"examples":[{"en":"She put on an eyeshield to sleep on the plane.","zh":"她在飞机上戴上眼罩睡觉。"},{"en":"An eyeshield can help if your room is too bright at night.","zh":"如果房间晚上太亮，戴眼罩会有帮助。"}]}],"synonyms":["eye shield","protective eye cover","sleep mask","eye mask"],"phonetic":"/ˈaɪˌʃiːld/","extraExplanation":["在实际使用中，防护用途的“eyeshield”常与“face shield（面罩）”“goggles（护目镜）”区分：eyeshield更强调遮挡眼部区域；而goggles通常是密封式护目镜，防护等级往往更高。睡眠用途时，日常更常说“sleep mask”，但“eyeshield”也能表达同样意思。"]}
{"word":"eyeshine","summary":{"en":"Eyeshine is the bright reflective glow seen in eyes in the dark (especially animals), and it can also mean a figurative sparkle in someone’s eyes.","zh":"Eyeshine 指黑暗中眼睛的反光发亮（多见于动物），也可比喻人眼里闪烁的光彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright, reflective glow seen in an animal’s eyes when light hits them in the dark (often from a flashlight, headlights, or a camera).","zh":"（动物在黑暗中被光照到时）眼睛出现的反光发亮现象（常见于手电筒、车灯或相机光线）。"},"examples":[{"en":"We spotted the deer by the green eyeshine near the road.","zh":"我们是靠路边那道绿色的眼睛反光发现那只鹿的。"},{"en":"The cat’s eyeshine looked gold when I turned on the flashlight.","zh":"我打开手电筒时，那只猫的眼睛反光看起来是金色的。"}]},{"partOfSpeech":"n.","definition":{"en":"A shining or lively look in someone’s eyes that suggests emotion (such as excitement, curiosity, or joy).","zh":"（比喻）眼神发亮；眼里闪烁的光彩，表示某种情绪（如兴奋、好奇或喜悦）。"},"examples":[{"en":"There was a playful eyeshine when she talked about her new project.","zh":"她谈起新项目时，眼里闪着俏皮的光。"},{"en":"I could see the eyeshine of pride in his expression.","zh":"我能从他的神情里看到自豪的眼神光彩。"}]}],"synonyms":["eye glow","reflective eye shine","sparkle (figurative)","gleam (figurative)"],"phonetic":"/ˈaɪˌʃaɪn/","extraExplanation":["在科学语境里，动物“eyeshine”通常来自一种叫 tapetum lucidum（明毯/反光层）的结构，它能把进入眼睛的光反射回去，帮助夜间视力更好；因此很多夜行性动物更常见到明显的 eyeshine。不同动物的 eyeshine 颜色可能不同。","写作或自然观察（尤其是夜间徒步、野外摄影）中，eyeshine 是一个常用词，用来描述“在黑暗里先看到眼睛的反光，再看到动物本体”的体验。"]}
{"word":"eyeshot","summary":{"en":"“Eyeshot” means the range of vision—something close enough to be seen, often used in the phrase “within eyeshot.”","zh":"“Eyeshot”指视野范围、目力所及，常用在短语“within eyeshot（在看得见的地方）”中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the distance you can see; within view","zh":"视野范围内；目力所及的距离"},"examples":[{"en":"The lighthouse was just within eyeshot of the shore.","zh":"灯塔刚好在海岸的目力所及范围内。"},{"en":"Keep the kids within eyeshot while we’re at the park.","zh":"在公园时要让孩子一直在你看得见的范围内。"}]}],"synonyms":["range of vision","view","sight","line of sight"],"phonetic":"/ˈaɪˌʃɑt/","extraExplanation":["“within eyeshot (of …)”是最常见的用法，意思是“在……看得见的地方”。常和“within earshot（在听得见的地方）”对比使用。","拼写注意：标准写法是 **eyeshot**（一个词），而不是 *eye shot*。在日常表达中，它比“within sight”稍微更口语、也更形象。"]}
{"word":"eyeshots","summary":{"en":"Eyeshot means the distance or range you can see, most often in the phrase “within eyeshot.”","zh":"Eyeshot 指“目力所及的范围/看得见的距离”，最常见于短语“within eyeshot（在视线范围内）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the range or distance within which something can be seen; the area that is visible to you","zh":"目力所及的范围；看得见的距离"},"examples":[{"en":"Keep your bag within eyeshot while you wait.","zh":"等候时把包放在你看得见的地方。"},{"en":"The children stayed within eyeshot of their parents at the beach.","zh":"孩子们在海边一直待在父母看得见的范围内。"},{"en":"The cabin was just beyond eyeshot, hidden by the trees.","zh":"小屋就在目力之外，被树遮住了。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural: eyeshots) separate lines or moments of looking; individual glances (rare, not common in modern English)","zh":"（复数 eyeshots）单次的目光/瞥视；一次次看（较少见，用法偏少）"},"examples":[{"en":"He stole a few quick eyeshots toward the door.","zh":"他朝门口快速瞥了几眼。"}]}],"synonyms":["sight","view","line of sight","visual range"],"phonetic":"/ˈaɪˌʃɑt/","extraExplanation":["“eyeshot”最常见的搭配是 **within eyeshot**（在视线范围内）和 **out of eyeshot**（不在视线范围内）。日常英语里人们更常说 **within sight** / **out of sight**。","你输入的 **eyeshots** 多半是 “eyeshot” 的复数，但在真实语料中复数并不常见；如果你想表达“在视线范围内”，通常不用复数，直接说 **within eyeshot**。"]}
{"word":"eyesight","summary":{"en":"Eyesight means your ability to see, and it can also mean the area within your view in set phrases.","zh":"Eyesight 指“视力”，也可在固定搭配中指“视线范围/目力所及”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability to see; vision","zh":"视力；视觉能力"},"examples":[{"en":"Good lighting can help protect your eyesight.","zh":"良好的照明有助于保护视力。"},{"en":"His eyesight has gotten worse with age.","zh":"随着年龄增长，他的视力变差了。"},{"en":"She went for an eyesight test before buying new glasses.","zh":"她在配新眼镜前做了视力检查。"}]},{"partOfSpeech":"n.","definition":{"en":"the range or distance you can see (often used in fixed phrases)","zh":"视野范围；目力所及的距离（常用于固定搭配）"},"examples":[{"en":"Keep the child within your eyesight at all times.","zh":"任何时候都要让孩子在你的视线范围内。"},{"en":"The boat disappeared from eyesight in the fog.","zh":"小船在雾中消失在视线之外。"}]}],"synonyms":["vision","sight"],"phonetic":"/ˈaɪ.saɪt/","extraExplanation":["“Eyesight”日常最常指“视力好坏”，常搭配：have good/poor eyesight（视力好/差）、lose eyesight（失明）、protect your eyesight（保护视力）。","表示“在视线内/外”时，常用固定说法：within your eyesight（在你视线内）/out of sight（看不见），英语里更常说“in/within sight”而不是“in eyesight”。"]}
{"word":"eyesights","summary":{"en":"Eyesight usually means vision (your ability to see). The plural “eyesights” is uncommon and may refer to different people’s vision or, less commonly, “sights/views.”","zh":"Eyesight 通常指“视力”。复数 eyesights 不常用，可能指“不同人的视力”，或较少见地指“景象/风景”（更常说 sights/views）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s ability to see; vision (how well your eyes work).","zh":"视力；看东西的能力（眼睛工作的好坏）。"},"examples":[{"en":"My eyesight isn’t very good, so I wear glasses.","zh":"我的视力不太好，所以我戴眼镜。"},{"en":"Regular breaks from screens can help protect your eyesight.","zh":"经常从屏幕前休息一下有助于保护视力。"},{"en":"He went for an eyesight test at the clinic.","zh":"他去诊所做了视力检查。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Things you see; sights or views (often used in travel or storytelling).","zh":"（不太常见）所见之物；景象；风景（常见于旅行或叙述）。"},"examples":[{"en":"On the trip, we enjoyed many beautiful sights and eye-catching sights.","zh":"旅行中，我们欣赏了许多美丽的风景和引人注目的景象。"},{"en":"The city’s night views were unforgettable sights for visitors.","zh":"这座城市的夜景对游客来说是难忘的景象。"}]}],"synonyms":["vision","sight","eyesight (ability to see)","view (for scenery)","sights (for scenery)"],"phonetic":"/ˈaɪˌsaɪt/","extraExplanation":["“eyesight”通常是不可数名词，最常见说法是“good/bad eyesight”。写成复数“eyesights”比较少见，多用于强调“不同人的视力”（如：children’s eyesights differ）或在某些写作里用作“所见景象”（但更自然的词通常是“sights”或“views”）。"]}
{"word":"eyesome","summary":{"en":"Eyosome means “pleasant to look at,” and it sounds poetic or old-fashioned in modern English.","zh":"Eyosome 表示“悦目、好看”，在现代英语中带有诗意或较古旧的语感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Pleasant or attractive to look at; visually pleasing (often poetic or old-fashioned).","zh":"悦目的；好看的；赏心悦目的（常见于诗歌或较古旧的用法）。"},"examples":[{"en":"A garden of roses can be truly eyesome in spring.","zh":"春天里，玫瑰花园真的很悦目。"},{"en":"The artist chose soft colors to make the scene more eyesome.","zh":"艺术家选择柔和的颜色，让画面更赏心悦目。"}]}],"synonyms":["beautiful","attractive","pleasing","good-looking","easy on the eyes","comely"],"phonetic":"/ˈaɪ.sʌm/","extraExplanation":["“eyesome”现在非常少用，带有古风/诗意色彩，更常见的现代说法是“pleasant to look at”“attractive”“beautiful”“easy on the eyes”。","词形上可理解为“eye + -some”（表示“具有……特征/容易引起……”），意思就是“让眼睛觉得舒服/喜欢看的”。在古诗文或仿古写作中使用会更自然。"]}
{"word":"eyesore","summary":{"en":"An eyesore is something ugly or unpleasant to look at that spoils a place’s appearance.","zh":"eyesore 指“难看、刺眼、破坏环境观感的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that looks very unpleasant or ugly, especially because it spoils the appearance of a place.","zh":"难看的东西；碍眼的东西（尤指破坏某处景观的事物）。"},"examples":[{"en":"That abandoned building is a real eyesore in the neighborhood.","zh":"那栋废弃的楼房在这个社区里真是个碍眼的东西。"},{"en":"Residents want the old billboard removed because it’s an eyesore.","zh":"居民希望把那块旧广告牌拆掉，因为它很碍眼。"},{"en":"The graffiti-covered wall became an eyesore for visitors.","zh":"那面满是涂鸦的墙成了游客眼中的“视觉污染”。"}]}],"synonyms":["blight","ugly sight","visual pollution","monstrosity"],"phonetic":"/ˈaɪ.sɔr/","extraExplanation":["“eyesore”由“eye（眼睛）+ sore（痛处、伤处）”构成，形象地表达“看了就刺眼/难受”。常用于描述建筑、广告牌、垃圾堆、杂乱的电线等对城市景观造成的“视觉污染”。","语气通常带主观评价，偏负面；在正式场合也常见于城市规划、社区投诉等语境。"]}
{"word":"eyesores","summary":{"en":"“Eyesores” is the plural of “eyesore,” meaning ugly or unpleasant things to look at.","zh":"“eyesores”是“eyesore”的复数，指看起来难看、让人觉得碍眼的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is very unpleasant or ugly to look at.","zh":"难看的东西；碍眼的事物。"},"examples":[{"en":"The abandoned building is an eyesore in the neighborhood.","zh":"那栋废弃的楼房成了社区里一个碍眼的存在。"},{"en":"Many residents complained that the billboard was an eyesore.","zh":"很多居民抱怨那块广告牌很碍眼。"}]}],"synonyms":["blight","ugly sight","nuisance","blemish"],"phonetic":"/ˈaɪˌsɔr/","extraExplanation":["“Eyesore”常用来表达对环境外观的抱怨，语气比较直接但不算粗鲁。常见搭配：an eyesore in the area（这一带的碍眼之物）、become/turn into an eyesore（变得很碍眼）、remove an eyesore（清除碍眼的东西）。","词形上：eyesores 是复数；单数是 eyesore。发音里通常重读第一个音节。","在城市规划、社区新闻或环保话题中很常见，比如谈“乱搭乱建、破败建筑、垃圾堆、杂乱招牌”等影响市容的东西。"]}
{"word":"eyespot","summary":{"en":"An eyespot is an eye-like marking, especially on animals, often used to deter or confuse predators.","zh":"eyespot 指像眼睛一样的斑点，常见于动物身上，用于吓退或迷惑捕食者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A round marking on an animal (especially on wings or skin) that looks like an eye; it often helps protect the animal by scaring or confusing predators.","zh":"（动物身上，尤指翅膀或皮肤上的）眼状斑点；看起来像眼睛，常用于吓退或迷惑捕食者以起到保护作用。"},"examples":[{"en":"The butterfly’s wings have bright eyespots that make it look bigger to birds.","zh":"这只蝴蝶翅膀上有鲜亮的眼状斑点，会让鸟以为它更大。"},{"en":"Some fish use eyespots near their tails to misdirect attacks away from the head.","zh":"有些鱼在尾部附近长有眼状斑点，用来把攻击引开头部。"}]},{"partOfSpeech":"n.","definition":{"en":"A small spot or patch that resembles an eye in design or decoration.","zh":"（图案或装饰中）类似眼睛的小斑点或小块图案。"},"examples":[{"en":"The fabric pattern includes eyespots in blue and gold.","zh":"这块布料的图案里有蓝金色的眼状点。"}]}],"synonyms":["ocellus","eye-like marking","eye marking"],"phonetic":"/ˈaɪˌspɑt/","extraExplanation":["“Eyespot”常见于生物学与自然纪录片语境，属于一种常见的防御性伪装（例如“startle display”惊吓展示或“deflection”转移攻击）。它不一定是真正的“眼睛”，而是让捕食者产生误判的视觉信号。","相关常见搭配：eyespot on the wings（翅膀上的眼状斑点）、bright/large eyespots（明亮的/大的眼状斑点）。"]}
{"word":"eyespots","summary":{"en":"Eyespots are eye-like markings on animals (often for defense) or, in biology, light-sensitive spots in simple organisms.","zh":"Eyspots 指动物身上的眼状斑（常用于防御）或生物学上简单生物的感光“眼点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, eye-like marking (often a circular spot) on an animal, especially on butterfly wings or fish, that can help with camouflage or scare predators.","zh":"（动物身上的）眼状斑；眼点（常为圆形斑纹，常见于蝴蝶翅膀、鱼类等，用于伪装或吓退捕食者）。"},"examples":[{"en":"The butterfly’s eyespots make it look like it has a much larger face.","zh":"蝴蝶翅膀上的眼状斑让它看起来像有一张更大的脸。"},{"en":"Some fish use eyespots near the tail to confuse predators about which way they will swim.","zh":"有些鱼在尾部附近有眼点，用来迷惑捕食者它将往哪个方向游。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology, a light-sensitive spot in some simple animals that helps them detect light and direction (not a fully formed eye).","zh":"（生物学）眼点（某些简单动物体内的感光点，可感知光线与方向，并非完整的眼睛）。"},"examples":[{"en":"Many single-celled organisms have eyespots that help them move toward light.","zh":"许多单细胞生物有眼点，帮助它们朝光线移动。"},{"en":"The eyespot lets the organism sense changes in light intensity.","zh":"眼点能让这种生物感知光强变化。"}]}],"synonyms":["eye-like markings","ocelli","ocellus (singular)","eye marks"],"phonetic":"/ˈaɪˌspɑts/","extraExplanation":["“Eyespot(s)”常见于自然纪录片和科普文章中。第一种含义是“像眼睛一样的斑纹”，强调外观与防御功能；第二种含义是生物学结构“眼点”，强调感光作用。阅读时可通过语境判断：提到蝴蝶、孔雀蝶、鱼类、捕食者等，多为“眼状斑”；提到单细胞生物、藻类、感光、趋光性（phototaxis）等，多为“眼点”。"]}
{"word":"eyess","summary":{"en":"“Eyes” usually means the plural of “eye” (the organs for seeing), and it can also mean attention or viewpoint; it can also be a verb meaning “looks at carefully.”","zh":"“Eyes”通常是“eye”的复数（眼睛），也可表示“目光/关注”或“观点”；作动词时可表示“仔细看/打量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “eye”: the organs you use to see; also used in expressions meaning attention or viewpoint","zh":"“eye”的复数：眼睛；也可引申为“注视/关注”或“观点/看法”"},"examples":[{"en":"Her eyes are brown.","zh":"她的眼睛是棕色的。"},{"en":"All eyes were on the speaker.","zh":"所有人的目光都集中在演讲者身上。"},{"en":"In my eyes, this is the best choice.","zh":"在我看来，这是最好的选择。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “eye”: to look at something carefully or with interest","zh":"“eye”的第三人称单数：仔细看；饶有兴趣地打量"},"examples":[{"en":"He eyes the dessert menu every time.","zh":"他每次都会盯着甜品菜单看。"},{"en":"The cat eyes the bird from the window.","zh":"猫从窗边盯着那只鸟。"}]}],"synonyms":["look (at)","watch","stare","gaze","glance"],"phonetic":"/aɪz/","extraExplanation":["你输入的“eyess”通常是拼写错误，更常见的正确拼写是“eyes”。如果你想表达单数“眼睛”，用“eye”；复数用“eyes”。"]}
{"word":"eyestalk","summary":{"en":"An eyestalk is the movable stalk that holds an eye, common in crabs and similar animals.","zh":"eyestalk 指承载并可活动的“眼柄”，常见于螃蟹等动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stalk-like structure that carries an eye, especially in animals like crabs, lobsters, and some snails.","zh":"（尤指螃蟹、龙虾及部分蜗牛等动物的）眼柄；承载眼睛的柄状结构。"},"examples":[{"en":"Crabs can move their eyestalks to look in different directions.","zh":"螃蟹可以转动眼柄，朝不同方向看。"},{"en":"The scientist studied the nerves inside the eyestalk.","zh":"科学家研究了眼柄内部的神经。"}]}],"synonyms":["eye stalk","eye-stalk"],"phonetic":"/ˈaɪˌstɔk/","extraExplanation":["“eyestalk”也常写作“eye stalk”或“eye-stalk”。在科普/生物学语境中更常见，日常对话里不太常用。","在甲壳类动物中，eyestalk不仅是“支撑眼睛的柄”，里面还包含与视觉和某些激素调节相关的组织；因此在科研文章中会出现得更多。"]}
{"word":"eyestalks","summary":{"en":"Eyestalks are the stalk-like parts that carry an animal’s eyes (often in snails and crabs).","zh":"Eyestalks 指动物用来支撑眼睛的柄状结构（常见于蜗牛、螃蟹等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The stalk-like body parts that hold an animal’s eyes out from its head (common in snails, slugs, crabs, and some insects).","zh":"（动物的）眼柄；长在头部外、用来支撑眼睛的“柄状”结构（常见于蜗牛、蛞蝓、螃蟹及部分昆虫）。"},"examples":[{"en":"The snail pulled its eyestalks back when I touched the leaf.","zh":"我碰了那片叶子后，蜗牛把眼柄缩了回去。"},{"en":"Crabs can move their eyestalks to look in different directions.","zh":"螃蟹可以转动眼柄朝不同方向看。"}]}],"synonyms":["eye stalks","ocular stalks"],"phonetic":"ˈaɪˌstɔk","extraExplanation":["“Eyestalks”是复数形式，单数是“eyestalk”。在科普、自然纪录片和动物学语境中更常见。","口语里有时会用夸张说法“my eyes were on eyestalks”来表示“看得目瞪口呆/非常惊讶或非常感兴趣”，带一点幽默感。"]}
{"word":"eyestone","summary":{"en":"An old/rare word for a small stone used as a folk remedy for eye trouble, and sometimes a protective or magical stone in folklore.","zh":"一个较古老、少见的词，指用于眼部问题的民间“眼石”，有时也指民俗中用来护身或带有“看见隐藏之物”寓意的石头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Traditional/folk medicine) A small smooth stone (or similar object) placed in the eye to help remove dust or a foreign body, or believed to treat eye problems.","zh":"（传统/民间疗法）“眼石”：一种小而光滑的石子（或类似物），放入眼中用来帮助带出灰尘、异物，或被认为可以治疗眼疾。"},"examples":[{"en":"My grandmother said an eyestone could help pull a speck of dust out of the eye.","zh":"我奶奶说“眼石”可以把眼里的灰尘小颗粒带出来。"},{"en":"The herbalist sold an eyestone as a simple remedy for irritated eyes.","zh":"那位草药师把“眼石”当作缓解眼睛刺痛的简易疗法出售。"}]},{"partOfSpeech":"n.","definition":{"en":"(Folklore) A charm-like stone believed to protect the wearer or help them “see” hidden things; sometimes linked with folk magic and old superstitions.","zh":"（民俗/传说）被当作护身或“看见隐藏之物”的石头；有时与民间巫术、旧时迷信相关。"},"examples":[{"en":"In the story, the traveler carried an eyestone for protection on the road.","zh":"故事里，旅人带着“眼石”上路求个平安。"},{"en":"Some old tales say an eyestone lets you notice things others miss.","zh":"一些古老传说说“眼石”能让人察觉到别人看不到的东西。"}]}],"synonyms":["eye stone","eye-stone","folk remedy stone","charm stone"],"phonetic":"/ˈaɪˌstoʊn/","extraExplanation":["“eyestone/eye stone”在现代英语里很少见，更常出现在民俗记录或旧时医药习惯的描述中。","从安全角度看，把任何物体放进眼睛都有风险；若眼睛进异物或发炎，通常应使用清洁冲洗液并及时就医。"]}
{"word":"eyestones","summary":{"en":"“Eyestones” are small stones traditionally used in folk remedies or as charms related to eye care (plural of “eyestone”).","zh":"“Eyestones”指传统民间与护眼/治眼相关的小石头或护符（“eyestone”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of eyestone: a small, smooth stone (or similar object) traditionally used as a folk remedy to help remove something stuck in the eye, or carried as a charm for eye protection.","zh":"eyestone 的复数：一种小而光滑的石头（或类似物），传统民间用来帮助把异物从眼睛里取出，或当作护眼的护身符/吉祥物。"},"examples":[{"en":"In some folk traditions, people kept eyestones to help with eye irritation or dust.","zh":"在一些民间传统里，人们会留着“eyestones”，据说能缓解眼部刺激或进灰尘。"},{"en":"The museum display included eyestones alongside other healing charms.","zh":"博物馆展柜里把“eyestones”和其他疗愈护符一起陈列。"}]}],"synonyms":["folk charm","amulet","healing charm","talisman"],"phonetic":"/ˈaɪˌstoʊnz/","extraExplanation":["“eyestone”在现代英语里很少见，多出现在民俗、历史、地方志或博物馆语境中。它并不是标准医学用语；如果眼睛进异物或疼痛，现代语境更常说“flush/rinse the eye（冲洗眼睛）”并寻求医疗帮助。","有些地区也把某些化石或光滑小石称作“eye stone”，并赋予护眼、驱邪等象征意义；具体含义会随地域传统而变化。"]}
{"word":"eyestrain","summary":{"en":"Eyestrain is tired or uncomfortable eyes, often from long periods of reading or screen use.","zh":"Eyestrain 指眼睛疲劳或不适，常因长时间阅读或看屏幕引起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Discomfort or tiredness in the eyes caused by using them intensely for a long time (especially reading or looking at screens).","zh":"眼睛疲劳；用眼过度导致的眼部不适或酸胀（尤其是长时间阅读或看屏幕）。"},"examples":[{"en":"After three hours of online classes, I had bad eyestrain.","zh":"上了三个小时网课后，我眼睛非常疲劳。"},{"en":"Turn down the screen brightness to reduce eyestrain.","zh":"把屏幕亮度调低一点，能减少眼睛疲劳。"},{"en":"If you often get eyestrain, take short breaks and look at something far away.","zh":"如果你经常眼睛疲劳，记得短暂休息并看看远处。"}]}],"synonyms":["eye strain","visual fatigue","tired eyes"],"phonetic":"/ˈaɪˌstreɪn/","extraExplanation":["“eyestrain”是一个合成词（eye + strain）。日常也常写作“eye strain”。它通常指功能性的疲劳感，不等同于严重眼病；但如果伴随持续疼痛、视力明显下降或头痛加重，最好就医。","常见搭配：eye/eyestrain relief（缓解眼疲劳），digital eyestrain（数码/屏幕眼疲劳），cause eyestrain（导致眼疲劳），suffer from eyestrain（遭受眼疲劳）。"]}
{"word":"eyestrains","summary":{"en":"Eye strain is eye tiredness or discomfort from using your eyes too much, especially with screens or reading.","zh":"eye strain 指因长时间或过度用眼（常见于看屏幕、阅读）引起的眼睛疲劳与不适。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tiredness, discomfort, or soreness in the eyes caused by intense or prolonged visual effort (for example, reading, screen use, or focusing in low light).","zh":"眼睛疲劳；视疲劳（因长时间用眼或用眼过度，如看屏幕、阅读、光线不足时用眼而产生的酸胀、不适或疼痛）。"},"examples":[{"en":"After three hours of online classes, I started to get eye strain.","zh":"上了三个小时的网课后，我开始出现眼睛疲劳。"},{"en":"Eye strain can cause headaches and make it hard to focus.","zh":"眼睛疲劳可能会引起头痛，并让人难以集中注意力。"},{"en":"I reduced my eye strain by taking short breaks and increasing the screen brightness.","zh":"我通过短暂休息并调高屏幕亮度来减轻眼睛疲劳。"}]}],"synonyms":["visual fatigue","ocular fatigue","tired eyes"],"phonetic":"/aɪ streɪn/","extraExplanation":["“eyestrains”更常见的写法是两词：eye strain（不可数名词，表示一种状态）。如果要说多次/不同人的情况，也可以用复数：eye strains。","常见搭配：get eye strain（出现视疲劳）；reduce/relieve eye strain（减轻）；cause eye strain（导致）；digital eye strain（电子屏幕视疲劳）。"]}
{"word":"eyestring","summary":{"en":"Eyestring is an old, rare word meaning the (imagined) tendon/nerve of the eye, and it appears in old phrases meaning “to blind someone.”","zh":"Eyestring 是罕见古语，指（被想象为）眼部的筋/神经，也用于旧式说法中表示“把某人弄瞎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A tendon or nerve thought to control the eye; by extension, a person’s eyesight.","zh":"（古语）被认为控制眼睛活动的筋腱或神经；引申指视力、眼力。"},"examples":[{"en":"In older writing, people sometimes spoke of the “eye-strings” as if they were cords that controlled sight.","zh":"在较早的文字里，人们有时把“eye-strings”说成像控制视力的绳索一样。"},{"en":"The poet used “eyestring” to suggest how fragile a person’s sight can be.","zh":"诗人用“eyestring”来暗示人的视力可能很脆弱。"}]},{"partOfSpeech":"phrase","definition":{"en":"(In old phrases) In “to cut someone’s eyestrings,” to blind someone (usually used as a threat, not literal in modern speech).","zh":"（旧式说法）在短语“cut someone’s eyestrings”中，指把某人弄瞎（多为威胁用语，现代英语里很少字面使用）。"},"examples":[{"en":"The villain threatened, “I’ll cut your eyestrings,” meaning he would blind his enemy.","zh":"反派威胁说：“I’ll cut your eyestrings,” 意思是要把对方弄瞎。"},{"en":"Today, that expression sounds theatrical and old-fashioned.","zh":"如今，这种说法听起来很戏剧化、很古老。"}]}],"synonyms":["optic nerve (modern)","eyesight","vision"],"phonetic":"ˈaɪˌstrɪŋ","extraExplanation":["“eyestring / eye-string”主要见于早期英语（如戏剧与诗歌）中。当时人们并不总以现代解剖学来理解身体结构，会把视力想象成由“绳索/筋腱”牵引或维系。","你更可能在文学作品或仿古台词里遇到它，而不是在日常现代英语中。现代表达“使某人失明”更常用 blind someone / put someone’s eyes out（后者也偏暴力语境，需谨慎使用）。"]}
{"word":"eyestrings","summary":{"en":"“Eye-strings” is an archaic literary word meaning the muscles/nerves of the eyes, or one’s eyesight.","zh":"“eye-strings”是较古旧的文学用词，指眼部的肌肉/神经等组织，也可泛指视力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/literary) The muscles, tendons, or nerves that move or control the eyes; sometimes used more generally to mean one’s eyesight.","zh":"（古语/文学用语）指控制眼睛运动的肌肉、腱或神经；也可更泛指“视力/眼力”。"},"examples":[{"en":"In some old poems, “eye-strings” refers to the parts that let the eyes turn and focus.","zh":"在一些古诗文里，“eye-strings”指让眼睛转动、聚焦的组织。"},{"en":"After hours of reading, my eye-strings felt tired. (literary-style)","zh":"读了好几个小时后，我的“眼筋/眼弦”都觉得累了。（偏文学化表达）"}]}],"synonyms":["eye muscles","optic nerves","eyesight"],"phonetic":"ˈaɪˌstrɪŋz","extraExplanation":["“eye-strings”现在几乎不用于现代日常英语，更常见于早期现代英语（如莎士比亚时代）或带古典风格的写作中。现代英语通常会说 eye muscles / optic nerves / eyesight，而不会说 eye-strings。","它的表达方式类似于更常见的比喻“heartstrings（心弦）”，用“strings（弦/筋）”来形象化人体内部“牵动、拉扯”的感觉。"]}
{"word":"eyeteeth","summary":{"en":"“Eyeteeth” means the canine teeth—the pointed teeth next to the front teeth.","zh":"“Eyeteeth”指犬齿，即门牙旁边尖尖的牙齿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the canine teeth (the pointed teeth next to the front teeth), especially in the upper jaw","zh":"犬齿（位于门牙旁边、较尖的牙齿），尤指上颌犬齿"},"examples":[{"en":"The dentist said my eyeteeth are healthy but my molars need more care.","zh":"牙医说我的犬齿很健康，但臼齿需要更注意保养。"},{"en":"Some people call the sharp “vampire-looking” teeth eyeteeth.","zh":"有些人把那种尖尖的“像吸血鬼一样”的牙叫作犬齿。"}]}],"synonyms":["canines","canine teeth"],"phonetic":"/ˈaɪˌtiːθ/","extraExplanation":["“eyeteeth”通常以复数形式出现，指“犬齿”。之所以和“eye”有关，是旧时的说法：人们认为上颌犬齿的牙根靠近眼眶下方。","常见习语：lie through one’s eyeteeth（睁眼说瞎话/公然撒谎）。例：He lied through his eyeteeth about where the money went.（他对钱去哪儿了公然撒谎。）"]}
{"word":"eyetooth","summary":{"en":"An old-fashioned word meaning a canine tooth, especially an upper canine.","zh":"较旧的说法，指犬齿，尤指上犬齿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a canine tooth (especially one of the upper canines), the pointed tooth beside the incisors","zh":"犬齿（尤指上犬齿），位于门齿旁边、较尖的牙齿"},"examples":[{"en":"The dentist said the pain was coming from her upper eyetooth (canine).","zh":"牙医说她的疼痛来自上犬齿（eyetooth）。"},{"en":"In older books, you may see “eyetooth” used instead of “canine tooth.”","zh":"在较旧的书里，你可能会看到用“eyetooth”来代替“canine tooth（犬齿）”。"}]}],"synonyms":["canine tooth","canine","cuspid"],"phonetic":"/ˈaɪˌtuːθ/","extraExplanation":["“eyetooth”是较古老、较少见的说法，现代英语里更常用canine tooth或cuspid。","之所以叫“eye-tooth”，一般认为与上犬齿的牙根位置接近眼眶下方有关（并不是说牙齿长在眼睛里）。"]}
{"word":"eyewaiter","summary":{"en":"“Eyewaiter” isn’t standard English; you likely mean “eye-watering” (tear-inducing or extremely expensive/intense) or “waiter.”","zh":"“eyewaiter”不是标准英语；你可能想说“eye-watering”（让人流泪/贵得惊人/刺激得惊人）或“waiter”（服务员）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or mishearing of another word (often “eye-watering” or “waiter”).","zh":"不是标准英语单词；很可能是拼写或听错了（常见可能是“eye-watering”或“waiter”）。"},"examples":[{"en":"I couldn’t find “eyewaiter” in a dictionary—did you mean “eye-watering” (very expensive/spicy) or “waiter” (a server in a restaurant)?","zh":"我在词典里找不到“eyewaiter”——你是想说“eye-watering”（非常贵/非常辣）还是“waiter”（餐厅服务员）？"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) eye-watering: causing tears, or (informal) extremely expensive or intense (e.g., spicy).","zh":"（可能想表达）eye-watering：让人流泪的；（非正式）贵得惊人/刺激得惊人（如很辣）。"},"examples":[{"en":"The curry was so spicy it was eye-watering.","zh":"这咖喱辣得让人流眼泪。"},{"en":"They paid an eye-watering price for the apartment.","zh":"他们为那套公寓付了贵得惊人的价格。"}]}],"synonyms":["eye-watering (if that’s what you meant): tear-inducing","very expensive","extremely"],"phonetic":"/ˈaɪˌwɔtərɪŋ/","extraExplanation":["“eyewaiter”在常见英语语料和权威词典中几乎不出现，通常不当作正规词使用。","如果你能提供你看到它的句子/上下文（比如聊天记录、歌词、游戏或品牌名），我可以更准确判断它到底想表达哪个词或是否是专有名词。"]}
{"word":"eyewash","summary":{"en":"Eyewash most commonly means a device for rinsing the eyes in emergencies; it can also mean misleading talk meant to make things look better.","zh":"eyewash 常指紧急冲洗眼睛的洗眼器；也可指粉饰用的空话或做做样子的说辞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A safety device that quickly rinses chemicals, dust, or other harmful substances from the eyes, usually in workplaces or labs.","zh":"洗眼器；紧急冲眼装置（用于在实验室或工厂等场所快速冲洗眼睛里的化学品、灰尘等）。"},"examples":[{"en":"If a chemical splashes into your eyes, use the eyewash station immediately.","zh":"如果化学品溅到眼睛里，立刻使用洗眼器。"},{"en":"The lab must have an eyewash and a safety shower near the door.","zh":"实验室门口附近必须配有洗眼器和安全淋浴装置。"}]},{"partOfSpeech":"n.","definition":{"en":"Something said or shown to make a situation look better than it really is; empty words or a misleading cover.","zh":"粉饰；门面话；空洞的说辞（让情况看起来比实际更好）。"},"examples":[{"en":"His apology felt like eyewash—nice words, but no real change.","zh":"他的道歉感觉像是在粉饰——话说得好听，但没有真正改变。"},{"en":"The report was mostly eyewash to calm the public.","zh":"那份报告大多是用来安抚公众的粉饰之词。"}]}],"synonyms":["(device) eye rinse, eyewash station","(figurative) window dressing, empty talk, lip service"],"phonetic":"/ˈaɪˌwɑʃ/","extraExplanation":["“eyewash station”是非常常见的安全标识搭配，尤其在化学实验室、工厂、医院等场所。遇到化学品入眼通常建议持续冲洗一段时间并尽快求助医疗人员，具体以场所安全指南为准。","比喻义的“eyewash”常带批评语气，接近“只是做做样子/说说而已”，使用时注意语境与礼貌。"]}
{"word":"eyewashes","summary":{"en":"“Eyewashes” is the plural of “eyewash”: either a liquid for rinsing the eyes or (figuratively) a misleading show meant to impress.","zh":"“eyewashes”是“eyewash”的复数：可指洗眼液/冲洗眼睛用的液体，也可比喻指“做给人看”的表面功夫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sterile liquid used to rinse the eyes, especially to remove dust, chemicals, or irritation.","zh":"洗眼液；用于冲洗眼睛的无菌液体（尤其用于去除灰尘、化学物质或缓解刺激）。"},"examples":[{"en":"The nurse used an eyewash to flush out the dust in his eye.","zh":"护士用洗眼液把他眼里的灰尘冲出来。"},{"en":"Always keep an eyewash station nearby when working with chemicals.","zh":"接触化学品工作时，务必在附近配备洗眼器/洗眼站。"}]},{"partOfSpeech":"n.","definition":{"en":"Something meant to look impressive but with little real value; a show or display to fool people.","zh":"花架子；表面功夫（看起来很厉害但实际价值不大，用来糊弄人的展示）。"},"examples":[{"en":"The new policy sounded good, but it was mostly eyewash.","zh":"新政策听起来不错，但大多是做做样子。"},{"en":"Voters are tired of campaigns full of promises and eyewash.","zh":"选民厌倦了充满空头承诺和表面功夫的竞选活动。"}]}],"synonyms":["eye rinse","saline solution","window dressing","show","pretense"],"phonetic":"/ˈaɪˌwɑʃ/","extraExplanation":["“eyewash”作比喻义时，语气通常带批评，指“只做给别人看”的东西。常见搭配：pure eyewash（纯粹的作秀）、political eyewash（政治作秀）。"]}
{"word":"eyewater","summary":{"en":"“Eyewater” is a rare/old-fashioned word meaning “tears.”","zh":"“Eyewater”是较少见/偏旧的说法，意思是“眼泪/泪水”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"tears; the watery liquid produced by your eyes (especially when you cry)","zh":"眼泪；由眼睛分泌的水样液体（尤指哭泣时）"},"examples":[{"en":"Her eyes filled with eyewater when she heard the news.","zh":"她听到这个消息时，眼里充满了泪水。"},{"en":"The cold wind brought eyewater to my eyes.","zh":"寒风吹得我眼睛流泪。"}]}],"synonyms":["tears","tear fluid","water (of the eyes)"],"phonetic":"/ˈaɪˌwɔtɚ/","extraExplanation":["“eyewater”不是现代英语里常用的标准词，更常见的说法是“tears”或“eye-watering”（意为“催泪的/刺激得流泪的”）。在一些旧文学、方言或特定语境中，“eyewater”可能被用来直指“泪水”。如果你是在歌词、小说或网络文本里看到它，多半是为了营造更口语或更“古风”的感觉。"]}
{"word":"eyewaters","summary":{"en":"“Eyewaters” is a poetic, old-fashioned word meaning “tears.”","zh":"“eyewaters”是较文学、较古雅的说法，意思是“眼泪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poetic or old-fashioned) tears; the water that comes from your eyes when you cry.","zh":"（诗歌/古雅用法）眼泪；哭泣时从眼睛流出的泪水。"},"examples":[{"en":"Her cheek was wet with eyewaters after the sad news.","zh":"听到悲伤的消息后，她的脸颊被眼泪打湿了。"},{"en":"He tried to hide his eyewaters, but his voice shook.","zh":"他想掩饰眼泪，但声音还是发抖了。"}]}],"synonyms":["tears","tear drops","weeping","crying"],"phonetic":"/ˈaɪˌwɔtərz/","extraExplanation":["“eyewaters”较少见，多出现在诗歌或较古老的英语里，现代英语通常直接说“tears”。","它常用复数形式（eyewaters），强调“泪水”这种液体的感觉，带一点文学色彩。"]}
{"word":"eyewear","summary":{"en":"Eyewear means glasses, sunglasses, or protective items worn on the eyes.","zh":"Eyewear 指眼镜、太阳镜或防护眼镜等眼部佩戴用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Glasses, sunglasses, or other items worn on the eyes to improve vision or protect the eyes.","zh":"眼镜类用品：戴在眼睛上的物品，用于矫正视力或保护眼睛（如眼镜、太阳镜等）。"},"examples":[{"en":"I need new eyewear because my prescription changed.","zh":"我需要换新的眼镜，因为我的度数变了。"},{"en":"Safety eyewear is required in the lab.","zh":"在实验室里必须佩戴防护眼镜。"},{"en":"She picked out stylish eyewear for the summer.","zh":"她挑了一副适合夏天的时髦太阳镜。"}]}],"synonyms":["glasses","spectacles","sunglasses","protective eyewear"],"phonetic":"/ˈaɪˌwɛr/","extraExplanation":["“Eyewear”是一个集合名词，常用于商店、医疗或安全场景（如optical shop/眼镜店、protective eyewear/防护眼镜）。日常更口语的说法通常是“glasses”（眼镜）或“sunglasses”（太阳镜）。","相关常见搭配：prescription eyewear（处方眼镜）、designer eyewear（设计师款眼镜）、protective/safety eyewear（防护眼镜）、eyewear brand（眼镜品牌）。"]}
{"word":"eyewink","summary":{"en":"Eyewink means a wink, and in older/literary use it can also mean a very brief moment.","zh":"Eyewink 指“眨眼/使眼色”，在较旧或文学用法中也可指“转眼间的一瞬”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quick closing and opening of one eye; a wink","zh":"眨一只眼；使眼色；眨眼（一次）"},"examples":[{"en":"She gave me an eyewink to signal that everything was fine.","zh":"她对我眨了下眼，示意一切都没问题。"},{"en":"With an eyewink, he let his friend know it was a joke.","zh":"他眨了眨眼，让朋友知道那是个玩笑。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/old-fashioned) a very short moment; the blink of an eye","zh":"（文学/旧式）一瞬间；眨眼之间"},"examples":[{"en":"In an eyewink, the child ran out of the room.","zh":"一眨眼的工夫，孩子就跑出了房间。"},{"en":"The mood can change in an eyewink.","zh":"气氛可能在一瞬间就改变。"}]}],"synonyms":["wink","blink","in an instant","in the blink of an eye"],"phonetic":"/ˈaɪˌwɪŋk/","extraExplanation":["“eyewink”比较少见，现代英语更常用“wink”（眨眼）或“in the blink of an eye / in an instant”（转眼间）。在较老的文学或诗歌里，“eyewink”偶尔用来营造更书面、带画面感的表达。"]}
{"word":"eyewinker","summary":{"en":"Eyewinker means a person who winks to communicate a hidden or playful message.","zh":"Eyewinker 指通过眨眼传递隐含或戏谑信息的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who winks, especially to signal a private meaning (joking, flirting, or sharing a secret).","zh":"眨眼的人；（尤指）用眨眼暗示私下意思的人（玩笑、调情或心照不宣）。"},"examples":[{"en":"He gave me a quick wink—such an eyewinker.","zh":"他朝我快速眨了下眼——真是个爱眨眼暗示的人。"},{"en":"In old stories, the eyewinker often hints that something is not quite true.","zh":"在一些旧故事里，“眨眼者”常暗示事情并不完全真实。"}]}],"synonyms":["winker","flirt","tease"],"phonetic":"/ˈaɪˌwɪŋkər/","extraExplanation":["“eyewinker”属于较少见、略带旧式（archaic / literary）的用法，字面就是“eye + winker（眨眼的人）”。现代日常英语更常说“someone who winks”或直接用“a flirt”（调情者）来表达相关意思。"]}
{"word":"eyewinks","summary":{"en":"“Eyewinks” is the plural of “eyewink,” meaning a wink, and more rarely an instant.","zh":"“eyewinks”是“eyewink”的复数，常指“眨眼”，较少见时也可指“瞬间”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wink of the eye; a brief closing and opening of one eye, often to signal something secretly or playfully","zh":"眨眼（单眼快速闭合再张开）；常用来暗示、开玩笑或传递秘密信号"},"examples":[{"en":"She gave me an eyewink to show it was a joke.","zh":"她对我眨了眨眼，表示那只是个玩笑。"},{"en":"With an eyewink, he let his friend know the plan was working.","zh":"他眨了眨眼，让朋友知道计划进展顺利。"}]},{"partOfSpeech":"n.","definition":{"en":"a very short moment; an instant (old-fashioned/rare)","zh":"一瞬间；眨眼工夫（较古旧/少见用法）"},"examples":[{"en":"The bird vanished in an eyewink.","zh":"那只鸟在一眨眼的工夫就消失了。"},{"en":"It was over in an eyewink.","zh":"事情转瞬之间就结束了。"}]}],"synonyms":["wink","blink","signal","instant","moment"],"phonetic":"/ˈaɪwɪŋk/","extraExplanation":["“eyewink”在现代英语里很少见，更常用的是“wink”（眨眼）或短语“in the blink of an eye”（转瞬之间）。它在较早期或文学语境中偶尔出现，因此读到时可按“wink/瞬间”来理解。"]}
{"word":"eyewitness","summary":{"en":"An eyewitness is someone who saw an event happen, or something based on what a person directly saw.","zh":"Eyewitness 指“亲眼目击的人（目击者）”，也可指“基于亲眼所见的（目击的）”信息或证据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who personally saw an event happen and can describe what they saw","zh":"目击者；亲眼见到事件发生的人，能够描述所见情况"},"examples":[{"en":"Police interviewed several eyewitnesses after the accident.","zh":"事故发生后，警方采访了几位目击者。"},{"en":"An eyewitness said the fire started in the kitchen.","zh":"一名目击者说火是从厨房开始的。"}]},{"partOfSpeech":"adj.","definition":{"en":"seen directly by a person (not heard secondhand)","zh":"亲眼目击的；亲眼所见的（不是道听途说的）"},"examples":[{"en":"We still don’t have any eyewitness evidence.","zh":"我们仍然没有任何目击证据。"},{"en":"Her eyewitness account matched the video.","zh":"她的目击叙述与视频一致。"}]}],"synonyms":["witness","observer","onlooker"],"phonetic":"/ˈaɪˌwɪt.nəs/","extraExplanation":["在法律与新闻语境中，eyewitness 常与 testimony（证词）、account（叙述）、evidence（证据）搭配。注意：目击证词并不一定百分之百可靠，因为人类记忆可能受紧张、光线、距离等影响。"]}
{"word":"eyewitnesses","summary":{"en":"“Eyewitnesses” means people who personally saw an event happen.","zh":"“Eyewitnesses”指亲眼看到某事发生的目击者（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who saw an event happen with their own eyes (plural of “eyewitness”).","zh":"亲眼目击某事件的人（“eyewitness”的复数）。"},"examples":[{"en":"Police interviewed eyewitnesses who saw the accident.","zh":"警方采访了亲眼目击事故的目击者。"},{"en":"Eyewitnesses reported hearing a loud bang before the fire started.","zh":"目击者称在起火前听到一声巨响。"},{"en":"The news story relied on eyewitnesses at the scene.","zh":"这则新闻报道依靠现场目击者的说法。"}]}],"synonyms":["witnesses","onlookers","observers","spectators"],"phonetic":"/ˈaɪˌwɪt.nəs/","extraExplanation":["在法律与新闻语境中，eyewitness(es) 常用于描述“第一手目击证词”。不过人类记忆可能受压力、光线、距离与暗示性提问影响，所以英语里也常见搭配如 eyewitness testimony（目击证词）、reliable/unreliable eyewitness（可靠/不可靠的目击者）。"]}
{"word":"eyewort","summary":{"en":"Eyewort is a traditional name for an herb (often eyebright) believed to help eye problems.","zh":"Eyewort 是一种传统名称，指被认为能帮助眼部问题的草药（常指 eyebright）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant traditionally used in herbal medicine, especially for eye irritation; commonly the herb “eyebright.”","zh":"一种传统草药植物，常用于缓解眼部不适；通常指“欧夏至草/小米草（eyebright）”。"},"examples":[{"en":"Some herbalists recommend eyewort tea for mild eye discomfort (but evidence is limited).","zh":"一些草药从业者会推荐用“eyewort”泡茶来缓解轻微眼部不适（但科学证据有限）。"},{"en":"In old remedies, eyewort was associated with improving eyesight.","zh":"在古老的偏方中，“eyewort”常被认为与改善视力有关。"}]}],"synonyms":["eyebright","herb","medicinal plant"],"phonetic":"/ˈaɪˌwɝːt/","extraExplanation":["“Eyewort”在现代英语里不算常用词，更常见的是“eyebright”。在英国和欧洲民间疗法中，eyebright（学名常见为 *Euphrasia* 属）曾被用来处理眼睛发炎、流泪等问题，但现代医学并不一定认可其疗效。","词形上是 eye + wort（古英语中“wort”表示“草本植物/药草”，也见于“St. John’s wort（贯叶连翘）”）。因此“eyewort”字面意思是“对眼睛有用的药草”。","使用草药涉及安全性与过敏风险，尤其是眼部问题更需要谨慎；若症状明显或持续，通常应咨询专业医疗人员。"]}
{"word":"eyey","summary":{"en":"“eyey” is nonstandard chat slang, usually meaning a playful “hey/hey, hey.”","zh":"“eyey”多为非标准网络拼写，通常表示一种俏皮随意的“hey/嘿嘿/嗨嗨”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Internet slang, nonstandard) A playful or casual way to call someone’s attention, similar to “hey” or “hey, hey.”","zh":"（网络用语，非标准）一种随意、带点玩笑的招呼方式，类似“hey”或“嘿嘿/嗨嗨”，用来引起注意或打招呼。"},"examples":[{"en":"Eyyy—what’s up? (Sometimes people also type it as “eyey.”)","zh":"Eyyy——最近怎么样？（有时也有人打成“eyey”。）"},{"en":"eyey, are you still online?","zh":"eyey，你还在线吗？"}]}],"synonyms":["hey","hi","yo","eyy","hey hey"],"phonetic":"/eɪ/","extraExplanation":["“eyey”不是常见的标准英文拼写，更常见的是“ey/hey/hey hey/eyy/eyyy”。在聊天里这种写法通常是在模仿语气：更随意、更亲近，拖长或重复字母表示更热情或更俏皮。","如果你是在找某个正式单词或特定语境（比如歌曲歌词、方言、名字缩写）里的“eyey”，可以告诉我原句，我可以按上下文解释。"]}
{"word":"eyght","summary":{"en":"“Eyght” is a rare, nonstandard/archaic spelling of “eight” (8). Modern English uses “eight.”","zh":"“eyght”是“eight（8）”的少见非标准/古体拼写；现代英语使用“eight”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/archaic spelling) a variant spelling of “eight,” the number 8.","zh":"（非标准/古体拼写）“eight”的一种拼写变体，表示数字8。"},"examples":[{"en":"In some old texts, you may see “eyght” used for “eight.”","zh":"在一些旧文本中，你可能会看到用“eyght”来表示“eight”。"},{"en":"Modern English uses “eight,” not “eyght.”","zh":"现代英语用“eight”，不用“eyght”。"}]},{"partOfSpeech":"num.","definition":{"en":"The number 8.","zh":"数字8。"},"examples":[{"en":"I have eight apples.","zh":"我有八个苹果。"},{"en":"The meeting starts at eight.","zh":"会议八点开始。"}]},{"partOfSpeech":"n.","definition":{"en":"A group or item marked with the number 8.","zh":"标着8的事物；第八号；八人/八件一组。"},"examples":[{"en":"She wore a size eight.","zh":"她穿8号尺码。"},{"en":"Table eight is ready.","zh":"8号桌准备好了。"}]}],"synonyms":["eight","8"],"phonetic":"/eɪt/","extraExplanation":["“eyght”多见于中古英语/早期现代英语的拼写变体，反映当时拼写尚未统一。学习时建议记现代标准拼写“eight”。","“eight”的发音为 /eɪt/，末尾的“gh”在现代英语中不发音，这类不发音字母也出现在 light, night 等词里。"]}
{"word":"eying","summary":{"en":"“Eying” means looking at something carefully or with desire; it’s the -ing form of “eye.”","zh":"“Eying”表示仔细注视或看中了某物，是动词“eye”的 -ing 形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"looking at someone or something carefully or with interest (present participle of “eye”)","zh":"仔细地看；用带有兴趣或警惕的目光注视（“eye”的现在分词）"},"examples":[{"en":"The cat sat by the door, eying the bird outside.","zh":"猫坐在门边，盯着外面的鸟看。"},{"en":"She noticed a stranger eying her phone on the table.","zh":"她注意到有个陌生人正盯着桌上的手机看。"}]},{"partOfSpeech":"v.","definition":{"en":"wanting something and looking at it as a possible choice (often followed by “for” or used with a noun)","zh":"看中了；打算要（常与“for”连用，或直接接名词）"},"examples":[{"en":"He’s been eying that jacket for weeks.","zh":"那件夹克他看中好几个星期了。"},{"en":"They’re eying a bigger apartment closer to work.","zh":"他们正在考虑（看中）一个离工作更近、面积更大的公寓。"}]}],"synonyms":["watching","staring at","observing","gazing at","checking out","considering"],"phonetic":"/ˈaɪ.ɪŋ/","extraExplanation":["拼写提示：动词“eye”加 -ing 时通常写成“eying”，而不是“eyeing”。这是英语里为了避免出现连续的“ee”而常见的拼写变化（类似：dye → dyeing）。"]}
{"word":"eyl","summary":{"en":"EYL most commonly means “English for Young Learners,” referring to English teaching/learning for children.","zh":"EYL最常见指“English for Young Learners（少儿英语）”，即面向儿童的英语教学/学习。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) English for Young Learners; teaching/learning English aimed at children (often ages ~3–12).","zh":"（缩写）少儿英语；面向儿童（常见约3–12岁）的英语教学/学习。"},"examples":[{"en":"She specializes in EYL and uses lots of songs and games.","zh":"她专攻少儿英语教学，经常用歌曲和游戏。"},{"en":"This course is designed for teachers working in EYL classrooms.","zh":"这门课程为在少儿英语课堂任教的老师设计。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., less common) Early Years Learning; education/learning in the early childhood stage.","zh":"（缩写，较不常见）幼儿阶段学习；早期儿童教育/学习。"},"examples":[{"en":"The workshop focuses on EYL methods for preschool children.","zh":"这个工作坊重点讲学龄前儿童的幼儿阶段教学方法。"}]}],"synonyms":["young learners (YL)","English for young learners","TEYL (Teaching English to Young Learners)"],"phonetic":"/i waɪ ɛl/","extraExplanation":["“EYL”在教育领域里更常见的解释是“English for Young Learners（少儿英语）”。在不同国家/机构也可能写作“EFL for Young Learners”或直接说“young learners (YL)”。如果你是在别的语境里看到“eyl”，也可能是某个组织/课程/账号的缩写名称，需要结合上下文确认。"]}
{"word":"eyliad","summary":{"en":"The Iliad is Homer’s famous ancient Greek epic poem about the Trojan War, centered on Achilles.","zh":"《伊利亚特》是相传由荷马创作的古希腊史诗，讲述特洛伊战争并以阿喀琉斯为核心人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually “the Iliad”) An ancient Greek epic poem by Homer about the Trojan War, focusing on Achilles’ anger and its consequences.","zh":"（通常作 the Iliad）古希腊史诗《伊利亚特》，相传为荷马所作，讲述特洛伊战争时期，重点描写阿喀琉斯的愤怒及其后果。"},"examples":[{"en":"In literature class, we read passages from the Iliad.","zh":"在文学课上，我们读了《伊利亚特》的节选。"},{"en":"The Iliad begins in the middle of the Trojan War, not at the very start.","zh":"《伊利亚特》从特洛伊战争的中段写起，而不是从最初开始。"}]}],"synonyms":["Homer’s Iliad"],"phonetic":"/ˈɪliæd/","extraExplanation":["你输入的“eyliad”很可能是拼写误差。最接近的常见词是 **Iliad（伊利亚特）**。另一个可能的目标词是 **eyelid（眼睑）**，拼写和发音也相近；如果你想查的是“眼皮/眼睑”，告诉我我可以给出对应词条。","《伊利亚特》和《奥德赛》（the Odyssey）并称为西方文学的核心经典之一；英语里常用 **Iliadic**（较少见）表示“与《伊利亚特》有关的/史诗般的”。","常见搭配：**the Iliad and the Odyssey**（《伊利亚特》和《奥德赛》）；相关名词：**Trojan War**（特洛伊战争）、**Achilles**（阿喀琉斯）、**Hector**（赫克托耳）、**Troy**（特洛伊）。"]}
{"word":"eyn","summary":{"en":"“eyn” isn’t a standard English word; it’s usually a context-specific abbreviation (EYN).","zh":"“eyn”不是标准英语单词；通常是语境相关的缩写（EYN）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as an abbreviation (EYN) in specific names (organizations, courses, online usernames), so its meaning depends on context.","zh":"不是标准英语单词。它更常见于特定名称中的缩写（EYN）（如组织、课程、网名等），具体含义取决于语境。"},"examples":[{"en":"I couldn’t find a dictionary meaning for “eyn”—is it an abbreviation in your text?","zh":"我在词典里找不到“eyn”的词义——它在你的文章里是不是一个缩写？"},{"en":"In this email, EYN seems to be the name of a group, not a common English word.","zh":"在这封邮件里，EYN 看起来像是某个团体的名称，而不是常见英语词汇。"}]}],"phonetic":"/eɪ wɑɪ ɛn/","extraExplanation":["“eyn”本身不是常用词；如果你能提供一句包含它的英文原句，或告诉我是来自聊天、作业、游戏/网名、公司/组织名称等，我可以更准确判断它是否是：某个缩写（例如项目名/机构名）、拼写错误（你可能想写 eye / ein / e.g. 等）、或是其他语言的转写。"]}
{"word":"eyne","summary":{"en":"“Eyne” is an archaic/poetic word meaning “eyes.”","zh":"“eyne”是古语/诗歌用语，意思是“眼睛（eyes）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) plural of “eye”; used in older or poetic English to mean “eyes.”","zh":"（古语/诗歌用语）“eye”的复数形式；意思是“眼睛”。"},"examples":[{"en":"She cast her eyne upon the sea and sighed.","zh":"她把目光投向大海，叹了口气。"},{"en":"In old poems, you may see “eyne” where modern English would simply use “eyes.”","zh":"在古诗或旧文本中，你可能会看到“eyne”，而现代英语只会用“eyes”。"}]}],"synonyms":["eyes"],"phonetic":"/aɪn/","extraExplanation":["“eyne”常见于中古英语或仿古、诗歌体（poetic/archaic style）中，带有古典、抒情的语感。现代日常英语几乎不用；阅读文学作品时把它当作“eyes”理解即可。","你可能在较早的英文作品或带有仿古风格的写作里遇到类似复数形式，如“kine”（cows 的古复数之一）。"]}
{"word":"eyot","summary":{"en":"An eyot is a small island, especially in a river.","zh":"eyot 指（尤指河里的）小岛/河中沙洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small island, especially one in a river (often used in British English).","zh":"（尤指河里的）小岛；河中沙洲（多用于英式英语）。"},"examples":[{"en":"We picnicked on an eyot in the middle of the river.","zh":"我们在河中央的一座小岛上野餐。"},{"en":"Several eyots along the Thames are protected as nature reserves.","zh":"泰晤士河上的几座河中小岛被保护为自然保护区。"}]}],"synonyms":["ait","islet","small island"],"phonetic":"/ˈeɪ.ət/","extraExplanation":["“eyot”也常拼作“ait”。这两个词在英国地名与河流语境中较常见，尤其与泰晤士河（the Thames）相关。","在文学与写作中，“eyot/ait”常用来营造河景意象：安静、隐蔽、与水流相伴的小片陆地。"]}
{"word":"eyoty","summary":{"en":"“eyoty” isn’t an English word; it’s probably a misspelling (e.g., “equity” or “eighty”).","zh":"“eyoty”不是英语单词，可能是拼写错误（例如“equity”或“eighty”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a typo.","zh":"不是标准英语单词，可能是拼写错误或打字错误。"},"examples":[{"en":"I can’t find “eyoty” in an English dictionary—did you mean “equity” or “eighty”?","zh":"我在英语词典里找不到“eyoty”——你是不是想写“equity（公平/股权）”或“eighty（八十）”？"}]}],"extraExplanation":["“eyoty”很可能是你想输入的单词被打错了。最接近的常见词有：\n- **equity**（公平；股权）\n- **eighty**（八十）\n如果你能告诉我：1）你想表达的中文意思；或 2）它出现的句子/上下文，我可以帮你精准判断正确拼写并解释用法。"]}
{"word":"eyr","summary":{"en":"“eyr” is usually a rare informal abbreviation meaning “every year,” or a rare Nordic/Icelandic name element linked to “sandbank/gravelly shore.”","zh":"“eyr”通常是较少见的非正式缩写，表示“每年”；也可能是北欧/冰岛地名中的成分，与“沙洲/砾石岸边”相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, rare) An abbreviation used in messages to mean “every year” or “each year.”","zh":"（非正式、较少见）在短信/聊天中用作缩写，表示“每年”。"},"examples":[{"en":"I visit my grandparents eyr.","zh":"我每年都会去看望祖父母。"},{"en":"We do this trip eyr in summer.","zh":"我们每年夏天都会进行这次旅行。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun, rare) A name or element in some Nordic/Icelandic place names, related to the idea of a sandbank or gravelly shore.","zh":"（专有名词、少见）出现在部分北欧/冰岛地名中的成分，含义与“沙洲、砾石岸边”相关。"},"examples":[{"en":"Some Icelandic place names contain eyr, referring to a sandy/gravelly shoreline.","zh":"一些冰岛地名中含有 eyr，用来指代沙地或砾石海岸。"}]}],"synonyms":["each year","every year","annually"],"phonetic":"/ˌi waɪ ˈɑɹ/","extraExplanation":["“eyr”本身在现代英语里不是常见单词，更常见的是作为缩写或出现在北欧地名/人名相关语境中。如果你是在某个句子、游戏、医学/金融缩写里看到的 EYR/eyr，告诉我上下文，我可以给出更准确的释义。"]}
{"word":"eyra","summary":{"en":"Eyra is mainly used as a feminine name (often linked to Welsh “snow”), and can also mean the tayra (Eira barbara) in zoology.","zh":"Eyra 主要用作女性名字（常与威尔士语“雪”的意象相关），也可在动物学中指貂熊/泰拉貂（Eira barbara）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (a spelling variant of “Eira”), often associated with the Welsh word for “snow.”","zh":"女性名字（常见拼写变体为 Eira），常与威尔士语中“雪”的含义相关。"},"examples":[{"en":"Eyra is a popular baby name in some families who like nature-inspired names.","zh":"Eyra 在一些喜欢“自然系”名字的家庭中很受欢迎。"},{"en":"They chose the name Eyra because it reminded them of snow and winter.","zh":"他们选 Eyra 这个名字，因为它让他们想到雪和冬天。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology) another name for the tayra, a weasel-like mammal in Central and South America (scientific name: Eira barbara).","zh":"（动物学）貂熊/泰拉貂的别称，一种生活在中南美洲、外形像鼬科动物的哺乳动物（学名：Eira barbara）。"},"examples":[{"en":"The eyra (tayra) is known for being agile and curious.","zh":"eyra（貂熊/泰拉貂）以敏捷、好奇而闻名。"},{"en":"In some older texts, the animal is called an eyra instead of a tayra.","zh":"在一些较旧的文献里，这种动物会被称为 eyra，而不是 tayra。"}]}],"synonyms":["Eira","tayra"],"phonetic":"/ˈaɪrə/","extraExplanation":["“Eyra”作为人名时，常被当作“Eira”的变体；“Eira”在威尔士语里与“雪”相关，所以在英文语境中常带有“清冷、纯净、冬日”的联想。","作为动物名称时，eyra 多见于较旧或较少见的英文用法；现代更常用 tayra，而学名属名是 Eira。"]}
{"word":"eyrant","summary":{"en":"Errant means either ‘wandering’ (literary) or ‘straying from what is correct/normal; mistaken.’","zh":"Errant 指（文学中）“四处游荡的”，也可指“偏离正确/常规的；出错的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"wandering; traveling from place to place (often in old-fashioned or literary use)","zh":"（常见于文学/较古雅用法）四处游荡的；到处旅行的"},"examples":[{"en":"In the story, an errant knight rides from town to town looking for adventure.","zh":"在故事里，一位四处游历的骑士从一个城镇到另一个城镇寻找冒险。"},{"en":"She lived an errant life for years, moving wherever work appeared.","zh":"她过了多年漂泊的生活，哪里有工作就搬到哪里。"}]},{"partOfSpeech":"adj.","definition":{"en":"not behaving in the usual, accepted, or correct way; straying; mistaken","zh":"偏离常规/正道的；出错的；走偏的"},"examples":[{"en":"The editor corrected a few errant commas in the final draft.","zh":"编辑在终稿里改正了几个用错的逗号。"},{"en":"An errant driver nearly caused an accident by changing lanes too fast.","zh":"一名驾驶不当的司机因为变道太快差点引发事故。"},{"en":"We need to fix the errant data before we publish the report.","zh":"我们需要在发布报告前修正异常/错误的数据。"}]}],"synonyms":["wandering","roving","straying","misguided","wayward","incorrect","mistaken"],"phonetic":"/ˈɛrənt/","extraExplanation":["你输入的“eyrant”不是常见英语单词，最可能是拼写错误。最接近且常用的是 **errant**（本条）。另一个容易混淆的词是 **tyrant**（/ˈtaɪrənt/，n. 暴君、专制者），意思完全不同：errant=走偏/游荡的；tyrant=暴政统治者。","常见搭配：**errant behavior**（不当行为）、**errant shot**（打偏的一枪/球）、**errant data**（错误/异常数据）、**errant knight**（游侠/游历骑士，偏文学）。"]}
{"word":"eyrar","summary":{"en":"“eyrar” is not a standard English word; it’s likely a foreign-language form or a name, or possibly a misspelling.","zh":"“eyrar”不是标准英语词；更可能是外语形式、名字，或是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It most often appears as a foreign-language form (especially Icelandic) or as a name (e.g., a surname/username).","zh":"不是标准英语词。它更常见于外语形式（尤其冰岛语）或作为名字（如姓氏/用户名）。"},"examples":[{"en":"I don’t recognize “eyrar” as an English word.","zh":"我不把“eyrar”当作一个英语单词来认识。"},{"en":"I saw “eyrar” in an Icelandic text, so it may be Icelandic rather than English.","zh":"我在一段冰岛语文本里看到“eyrar”，所以它可能是冰岛语而不是英语。"}]}],"phonetic":"/ˈeɪrɑr/","extraExplanation":["如果你是在英文文章里看到“eyrar”，它可能是拼写错误。你可以回忆一下上下文或把原句发来，我可以帮你判断更可能的词（例如 errand, eyrie, error 等）。","如果你指的是冰岛语，“eyrar”常被解释为某些词形变化（例如与旧货币单位或地名/普通名词的复数形式相关），但具体含义需要上下文来确认。"]}
{"word":"eyras","summary":{"en":"“Eyras” is an archaic plural meaning young hawks/eagles from the nest (nestlings), especially in falconry.","zh":"“eyras”是古语复数，指巢中的幼鹰/幼隼（巢雏），常见于鹰猎等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) young hawks or eagles taken from the nest; nestlings used in falconry.","zh":"（古语）从巢中取出的幼鹰/幼隼；（鹰猎术中）用于驯养的雏鸟。"},"examples":[{"en":"In old falconry manuals, “eyras” were birds taken from the eyrie and raised by people.","zh":"在古老的鹰猎手册里，“eyras”指从鹰巢里取出、由人饲养长大的幼鸟。"},{"en":"The ranger found the eyrie, but the eyras had already fledged and flown.","zh":"护林员找到了鹰巢，但那些幼鸟已经长羽离巢飞走了。"}]}],"synonyms":["eyases","nestlings","fledglings"],"phonetic":"/ˈaɪrəz/","extraExplanation":["“eyras”是古老/文学用法，现代更常见的词是 *eyas*（幼隼/幼鹰）或 *nestling*（巢雏）。也有人把它看作与 *eyrie/eyry*（鹰巢）相关的旧式复数或拼写变体。","语境上多见于鹰猎（falconry）、中世纪/文艺复兴文学或仿古写作中；日常英语里几乎不用。"]}
{"word":"eyre","summary":{"en":"A medieval English traveling court or judicial circuit.","zh":"中世纪英格兰的巡回审判法庭/巡回审判。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, chiefly British) A traveling court or circuit of judges in medieval England; a session of such a court (as in “justice in eyre”).","zh":"（历史用语，主要英式）中世纪英格兰巡回审判法庭；或该法庭的一次巡回审判/开庭（如“justice in eyre”）。"},"examples":[{"en":"In the Middle Ages, royal judges went on eyre to hear serious cases in different counties.","zh":"在中世纪，王室法官会进行巡回审判（on eyre），到各郡审理重大案件。"},{"en":"The record mentions a justice in eyre who visited the region that year.","zh":"档案提到那一年有一位巡回法官（justice in eyre）到过该地区。"}]}],"synonyms":["itinerant court","judicial circuit","assizes"],"phonetic":"/ɛr/","extraExplanation":["“eyre”读音同“air”，现代英语中很少单独使用，主要出现在历史/法律语境里（尤其是固定搭配“justice in eyre”）。","词源来自古法语/拉丁语中表示“旅程、行程”的词，强调法官“巡回”办案的特点。","注意：小说《Jane Eyre》里的“Eyre”是姓氏（专有名词），与这个历史名词同形但用法不同。"]}
{"word":"eyren","summary":{"en":"Eyren is an archaic word meaning “eggs.”","zh":"Eyren 是一个古语词，意思是“鸡蛋（eggs）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, chiefly Middle English) eggs; an old plural form of “egg.”","zh":"（古语，主要见于中古英语）鸡蛋；“egg”的旧式复数形式。"},"examples":[{"en":"In some Middle English texts, people speak of buying eyren at the market.","zh":"在一些中古英语文本里，人们会说在集市上买 eyren（鸡蛋）。"},{"en":"The word eyren is now mostly seen in older literature, where it simply means “eggs.”","zh":"如今 eyren 多见于较老的文学作品中，意思就是“鸡蛋”。"}]}],"synonyms":["eggs"],"phonetic":"/ˈaɪrən/","extraExplanation":["“eyren”源自中古英语，是“ey”（egg 的旧形式）的复数。后来标准英语中“egg/eggs”成为主流，但在早期文学与方言记载里仍能看到“ey/eyren”。","在学习文学英语时，遇到“eyren”可以直接按“eggs”理解；它本身不算现代日常词汇。"]}
{"word":"eyrer","summary":{"en":"“Eyrer” is usually a surname; if used as a common word, it may be a misspelling of “eyrie/eyry” (an eagle’s nest).","zh":"“Eyrer”通常是姓氏；若当作普通词使用，可能是“eyrie/eyry（鹰巢）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name); not a common standard English vocabulary word.","zh":"（姓氏）一个家族姓；并非常见的标准英语词汇。"},"examples":[{"en":"Dr. Eyrer will present the research results tomorrow.","zh":"Eyrer 博士将于明天展示研究结果。"},{"en":"I saw the name “Eyrer” on the mailbox.","zh":"我在邮箱上看到了“Eyrer”这个姓。"}]},{"partOfSpeech":"n.","definition":{"en":"(often a misspelling) intended to mean “eyrie/eyry,” an eagle’s nest, especially high on a cliff.","zh":"（常见拼写误写）可能想写的是“eyrie/eyry”，指鹰巢，尤指筑在高崖上的巢。"},"examples":[{"en":"The eagle returned to its eyrie at dusk.","zh":"黄昏时，鹰飞回了它的鹰巢。"},{"en":"From the cliff-top eyrie, the birds could see the valley below.","zh":"从崖顶的鹰巢处，鸟儿能俯瞰下方的山谷。"}]}],"synonyms":["(surname) none","(eyrie) eagle’s nest"],"phonetic":"/ˈaɪrər/","extraExplanation":["“Eyrer”在英语里更像是专有名词（姓氏），因此通常没有固定的“词义”。如果你是在阅读文章时看到“eyrer”，而上下文与鸟巢/高崖有关，很可能是把“eyrie/eyry（鹰巢）”拼错了。","“eyrie/eyry”常见于较文学化或描写性文本中，用来营造高处、险峻、孤绝的意象。"]}
{"word":"eyres","summary":{"en":"“Eyres” is usually either the plural of “eyre” (a medieval English traveling court session) or a surname.","zh":"“Eyres”通常要么是“eyre”的复数（中世纪英格兰的巡回法庭审理/审期），要么是一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of eyre: traveling sessions of court held by judges who went on circuit (especially in medieval England).","zh":"eyre 的复数：巡回法庭审理（尤指中世纪英格兰法官外出巡回审判的法庭开庭/审期）。"},"examples":[{"en":"In medieval records, you may see references to the “eyres” that brought royal justice to the counties.","zh":"在中世纪的档案中，你可能会看到提到“eyres”（巡回审判）把王室司法带到各郡县。"},{"en":"The historian explained how the eyres changed local law enforcement.","zh":"这位历史学家解释了巡回审判（eyres）如何改变地方执法。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Dr. Eyres will speak at the conference tomorrow.","zh":"Eyres 医生将于明天在会议上发言。"},{"en":"She searched for the Eyres family in old census data.","zh":"她在旧人口普查数据中查找 Eyres 家族的记录。"}]}],"synonyms":["assizes","circuit courts"],"phonetic":"/ɛrz/","extraExplanation":["“eyre”在法律史语境中较常见，指英格兰国王派法官到各地巡回开庭的制度与审期；现代英语里非常少用，更多出现在历史、法学或档案文献中。","不要和小说《Jane Eyre》（《简·爱》）的“Eyre”混淆：那是人名/姓氏；“eyres”有时只是这个姓的复数（指“Eyres一家/几位姓Eyres的人”），需要结合上下文判断。"]}
{"word":"eyrie","summary":{"en":"An eyrie is a high nest of a bird of prey, or any lofty, hard-to-reach place like a stronghold.","zh":"eyrie 指猛禽（如鹰）的高处巢穴，也可指像据点一样高而难达的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high nest built by a large bird of prey (such as an eagle), often on a cliff or in a tall tree","zh":"（猛禽如鹰的）高处巢穴；鹰巢（常在悬崖或高树上）"},"examples":[{"en":"From the cliff, we could see an eagle circling near its eyrie.","zh":"从悬崖上我们能看到一只鹰在它的鹰巢附近盘旋。"},{"en":"The eyrie was hidden on a rocky ledge, safe from most predators.","zh":"鹰巢藏在岩石突出的平台上，能躲开大多数天敌。"}]},{"partOfSpeech":"n.","definition":{"en":"a high, hard-to-reach place that seems like a nest or stronghold; a lofty hideout","zh":"高处且难以到达的地方（像巢或据点）；高处隐蔽所"},"examples":[{"en":"The old castle sat like an eyrie above the village.","zh":"那座古堡高高地俯瞰着村庄，像个高处据点。"},{"en":"She turned the attic into a quiet eyrie for reading and writing.","zh":"她把阁楼改造成安静的“高处小窝”，用来阅读和写作。"}]}],"synonyms":["aerie","nest","roost","lair","stronghold"],"phonetic":"/ˈɪri/","extraExplanation":["“eyrie”也常拼作“aerie”。两者意思相同；“aerie”在美国写作中较常见，“eyrie”在文学或较传统的拼写里更常见。","在文学中，“eyrie”常用来营造“高远、孤绝、易守难攻”的意象，比如形容城堡、隐居处或权力中心。常见搭配有：an eagle’s eyrie（鹰巢）、perched in an eyrie（栖在高处）。"]}
{"word":"eyries","summary":{"en":"“Eyries” means eagle nests built high up; it can also mean high, secluded retreats (figuratively).","zh":"“eyries”指高处的鹰巢（复数）；也可比喻高而隐蔽的隐居处/据点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “eyrie” (also spelled “aerie”): a large bird’s nest built high up, especially an eagle’s nest.","zh":"“eyrie”（也拼作 aerie）的复数：高处的大型鸟巢，尤指鹰巢。"},"examples":[{"en":"The hikers spotted several eyries along the cliff face.","zh":"徒步者在悬崖峭壁上看到了好几个鹰巢。"},{"en":"Eagles often build their eyries on remote, rocky ledges.","zh":"鹰常把巢筑在偏远的岩石突出处。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A high, secluded place that feels like a lookout or retreat.","zh":"（比喻）高处、隐蔽的地方，像瞭望点或隐居处。"},"examples":[{"en":"From his apartment eyry above the city, he could see the river at night.","zh":"从他那座城市上方的“巢居”公寓里，他夜晚能看到河流。"},{"en":"She escaped to her mountain eyry to write in peace.","zh":"她躲到山上的隐居处，安静地写作。"}]}],"synonyms":["aeries","nests (for the literal sense)","lairs (figurative)","hideaways (figurative)","retreats (figurative)"],"phonetic":"/ˈɪri/","extraExplanation":["“eyrie/eyry/aerie”都可表示“鹰巢”。现代英语里 aery/aerie 在文学或描写性文字中更常见；eyrie/eyry 也常见，尤其在英式或苏格兰用法中。","文化与文学联想：用来形容“高而孤立的居所/据点”时，常带有“远离尘嚣、俯瞰众生”的意象。"]}
{"word":"eyrir","summary":{"en":"Eyrir is a former Icelandic “cent”-like unit: 1/100 of a króna.","zh":"Eyrir 是旧时冰岛类似“分/美分”的货币单位：1/100 克朗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former Icelandic monetary unit equal to 1/100 of a króna (similar in value and function to a “cent”).","zh":"（旧）冰岛货币单位，“eyrir”相当于1/100克朗（功能上类似“分/美分”）。"},"examples":[{"en":"Prices used to be listed in krónur and aurar (eyrir).","zh":"过去商品价格常用“克朗和分（eyrir）”来标示。"},{"en":"The coin was worth a few aurar, but those small units later stopped being used in everyday spending.","zh":"那枚硬币只值几分（eyrir），但这种小面额后来逐渐退出日常交易。"}]}],"synonyms":["cent","penny","small coin"],"phonetic":"/ˈeɪrɪr/","extraExplanation":["“eyrir”是冰岛语名词，复数通常写作“aurar”。随着通货膨胀与现金找零需求下降，1 eyrir 这类极小面额在现代实际交易中基本不再使用，但在历史、旧价格体系或语言文化讨论中仍会出现。"]}
{"word":"eyry","summary":{"en":"Eyry means an eagle’s nest, often high and inaccessible; it can also describe a lofty dwelling or place.","zh":"eyry 指（多在高处、难以到达的）鹰巢，也可引申为高踞之处或居所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An eagle’s nest, usually built high on a cliff or in a tall tree; by extension, any lofty, hard-to-reach home or place.","zh":"（通常指）鹰巢；也可引申为位于高处、难以到达的住处或地点。"},"examples":[{"en":"The hikers spotted an eagle’s eyry on the cliff face.","zh":"徒步者在峭壁上发现了一个鹰巢。"},{"en":"The old castle sat like an eyry above the valley.","zh":"那座古堡像鹰巢一样高踞在山谷之上。"}]}],"synonyms":["eyrie","aerie","nest"],"phonetic":"/ˈɪri/","extraExplanation":["“eyry”是“eyrie / aerie”的拼写变体，较少见；在现代英语中更常见的是“eyrie”或“aerie”。","这个词常带有文学色彩，用来营造“高耸、孤峭、俯瞰”的意象，不仅指鸟巢，也可比喻高处的居所或据点。"]}
{"word":"eysoge","summary":{"en":"“eysoge” isn’t a recognized English word; it’s probably a misspelling or a proper name.","zh":"“eysoge”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, or invented term.","zh":"不是标准英语单词；可能是拼写错误、用户名或自造词。"},"examples":[{"en":"I couldn’t find “eysoge” in an English dictionary—did you mean a different spelling?","zh":"我在英语词典里找不到“eysoge”——你是不是想写另一个拼法？"},{"en":"If “eysoge” is a name or brand, please share the context so I can explain it.","zh":"如果“eysoge”是人名或品牌名，请提供上下文，我才能更准确地解释。"}]}],"phonetic":"N/A","extraExplanation":["“eysoge”看起来像随机字母组合，英语里没有常见词条对应。最常见的情况是：1）拼写打错；2）专有名词（网名、品牌、游戏ID）；3）其他语言的词或缩写。","你可以把它放进一句话里，或告诉我你想表达的意思/接近的单词（比如读音像什么），我可以帮你猜测最可能的正确拼法与含义。"]}
