{"word":"ezan","summary":{"en":"Ezan means the Islamic call to prayer, often used in Turkish contexts (English also uses “adhan”).","zh":"Ezan 指伊斯兰教的宣礼／唤礼，在土耳其语境中更常用（英语也常写作 adhan）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam) the call to prayer, traditionally recited or broadcast from a mosque to announce the five daily prayer times (common in Turkish usage; also spelled “adhan” in English).","zh":"（伊斯兰教）宣礼／唤礼：从清真寺宣告每日五次礼拜时间的呼唤（“ezan”常见于土耳其语拼写；英语也常写作“adhan”）。"},"examples":[{"en":"At dawn, the ezan echoed through the neighborhood.","zh":"黎明时分，宣礼声在社区里回荡。"},{"en":"We paused our conversation when we heard the ezan from the nearby mosque.","zh":"听到附近清真寺的宣礼后，我们暂停了谈话。"},{"en":"In Turkey, people often say “ezan” instead of “adhan.”","zh":"在土耳其，人们常说“ezan”，而不是“adhan”。"}]}],"synonyms":["adhan","call to prayer"],"phonetic":"/eɪˈzɑn/","extraExplanation":["“Ezan”源自阿拉伯语“adhān（أذان）”，意为“宣告、通知”，在英语语境中更常见的拼写是“adhan”。不同地区/语言的拼写差异很常见。","“ezan/adhan”具有宗教意义，通常指宣告礼拜时间的诵词与声音本身；在写作或讨论时，用中性、尊重的语气更合适。"]}
{"word":"ezba","summary":{"en":"“ezba” isn’t a recognized English word; it’s likely a name, acronym, or typo.","zh":"“ezba”不是常见英语词，通常更可能是人名/缩写/拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username, a proper name, or an acronym in a specific context.","zh":"不是标准英语单词。可能是拼写错误、用户名、专有名词，或某个领域里的缩写。"},"examples":[{"en":"I couldn’t find “ezba” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里找不到“ezba”——你能把它出现的句子发我吗？"},{"en":"Is “ezba” a person’s name, a brand, or an abbreviation?","zh":"“ezba”是人名、品牌名，还是缩写？"}]}],"phonetic":"/ˈiːz biː eɪ/","extraExplanation":["为了更准确地解释，我需要一点上下文：它出现在哪个句子/平台（聊天、游戏、论文、工作文件）？你想查的是拼写“ezba”，还是发音相近的词（例如 Ezra /ˈɛzrə/）？","如果你是想输入某个常见英文单词，请告诉我你想表达的中文意思（例如“例子”“简单”“特别”等），我可以帮你找到最贴切的英文词并给例句。"]}
{"word":"ezekiel","summary":{"en":"Ezekiel is a male first name and also the name of a biblical prophet and the Book of Ezekiel.","zh":"Ezekiel 可作男性名字，也指《圣经》旧约先知“以西结”及《以西结书》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (first name), often used in English-speaking countries.","zh":"（男）名：以西结（常见于英语国家的人名）。"},"examples":[{"en":"Ezekiel is starting a new job next week.","zh":"以西结下周开始一份新工作。"},{"en":"I met a student named Ezekiel in my English class.","zh":"我在英语课上认识了一位叫以西结的学生。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Bible, a Hebrew prophet whose writings form the Book of Ezekiel in the Old Testament.","zh":"《圣经》中旧约的先知“以西结”，其著作为《以西结书》。"},"examples":[{"en":"In the Book of Ezekiel, the prophet describes vivid visions.","zh":"在《以西结书》中，这位先知描述了生动的异象。"},{"en":"Some readers study Ezekiel for its symbolic language and imagery.","zh":"一些读者研究《以西结书》，因为它有丰富的象征语言与意象。"}]}],"synonyms":["Zeke","Ezequiel"],"phonetic":"/ɪˈziːkiəl/","extraExplanation":["“Ezekiel”源自希伯来语（常解释为“上帝使其坚强 / 上帝加力量”之意），因此在宗教与文化语境中常带有信仰色彩。","在英语写作里：指人名时通常不加定冠词（Ezekiel）；指《圣经》中的人物或书卷时，常见表达是 “the Book of Ezekiel” 或直接说 “Ezekiel” 来指代该书。","文学与文化中常引用《以西结书》的意象（如“枯骨复生”一类的象征），用来表达重生、复兴或巨变。"]}
{"word":"ezod","summary":{"en":"“ezod” is not a standard English word; it’s likely a misspelling of “Exod.” (Exodus) or a context-specific acronym/name.","zh":"“ezod”不是标准英语词；多半是把“Exod.”（《出埃及记》）拼错，或是特定语境下的缩写/名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling of “Exod.” (an abbreviation for the biblical book “Exodus”), or as a name/acronym in specific contexts.","zh":"不是标准英语单词。它更常见于把“Exod.”（《圣经》中《出埃及记》Exodus 的缩写）拼错，或在特定语境中作为名字/首字母缩写出现。"},"examples":[{"en":"I can’t find “ezod” in a dictionary—did you mean “Exod.” for Exodus?","zh":"我在词典里找不到“ezod”——你是不是想写《出埃及记》的缩写“Exod.”？"},{"en":"The file name says “EZOD,” but it might be a project acronym.","zh":"文件名写着“EZOD”，但它可能是某个项目的缩写。"}]}],"extraExplanation":["“ezod”本身没有固定、通用的读音和权威词典释义。若你是在阅读圣经注释、引文或参考文献时看到它，最可能对应的是“Exod.”（Exodus 的缩写）。","如果你能提供一句原文或你看到“ezod”的场景（聊天、游戏、公司项目、缩写表等），我可以帮你判断它到底指什么。"]}
{"word":"ezra","summary":{"en":"Ezra is most commonly a male first name; it can also refer to the biblical Ezra and the Book of Ezra.","zh":"Ezra 最常见是男性英文名；也可指《圣经》人物以斯拉以及《以斯拉记》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), often used in English-speaking countries","zh":"（男子）名字；常见英文名"},"examples":[{"en":"Ezra is a popular baby name in the U.S. right now.","zh":"Ezra 现在在美国是很受欢迎的宝宝名字。"},{"en":"My friend Ezra plays the guitar.","zh":"我的朋友 Ezra 会弹吉他。"}]},{"partOfSpeech":"n.","definition":{"en":"a biblical figure (Ezra), a Jewish scribe and leader linked to the return from exile; also the name of the Book of Ezra in the Bible","zh":"《圣经》人物以斯拉（Ezra）：犹太文士与领袖；也指《以斯拉记》"},"examples":[{"en":"In the Bible, Ezra is known for teaching the law to the people.","zh":"在《圣经》中，以斯拉以向民众讲授律法而闻名。"},{"en":"We read a passage from the Book of Ezra in class.","zh":"我们在课上读了《以斯拉记》的一段。"}]}],"synonyms":["Esdras"],"phonetic":"/ˈɛzrə/","extraExplanation":["“Ezra”源自希伯来语名字“עֶזְרָא (Ezra)”，常被解释为“帮助/援助”（help）。在英语里它通常读作两音节，重音在第一个音节。","在文学与文化中，“Ezra”也可能让人联想到诗人 Ezra Pound（埃兹拉·庞德）。遇到时需要根据上下文判断是人名还是《圣经》人物/书名。"]}
