{"word":"fb","summary":{"en":"“fb” is a common abbreviation meaning Facebook, feedback, or (less often) fullback, depending on context.","zh":"“fb”常见作缩写，通常指Facebook或feedback；较少情况下指体育位置fullback，需看语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Facebook (a social media platform; often used in texts or online posts).","zh":"Facebook（脸书；社交媒体平台的简称，常见于短信或网络发帖）。"},"examples":[{"en":"I saw the announcement on FB.","zh":"我在FB（脸书）上看到这个通知。"},{"en":"Do you have FB?","zh":"你有FB（脸书）账号吗？"}]},{"partOfSpeech":"other","definition":{"en":"feedback (comments or suggestions about how something is done; common in work or school).","zh":"feedback（反馈；对某事的意见或建议，工作和学习中常用）。"},"examples":[{"en":"Can you send me FB on my presentation?","zh":"你能给我的演讲一些反馈（FB）吗？"},{"en":"Thanks for the quick FB.","zh":"谢谢你这么快就给了反馈（FB）。"}]},{"partOfSpeech":"other","definition":{"en":"fullback (a position in some sports, such as American football or soccer; less common in everyday texting).","zh":"fullback（体育位置名；如美式足球或足球中的“后卫/边后卫”等；日常聊天中较少见）。"},"examples":[{"en":"He played FB in high school football.","zh":"他高中打美式足球时踢（打）的是FB（fullback）的位置。"}]}],"synonyms":["Facebook","feedback","fullback"],"phonetic":"/ˌɛfˈbi/","extraExplanation":["“FB”是缩写，读作字母：F-B。具体意思要看语境：社交媒体里通常指Facebook；职场/学校聊天里常指feedback。","写作时更正式的表达通常直接写全：Facebook / feedback / fullback。"]}
{"word":"FBI","summary":{"en":"FBI = the U.S. Federal Bureau of Investigation, a major national law-enforcement and security agency.","zh":"FBI = 美国联邦调查局，美国主要的国家级执法与安全机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Federal Bureau of Investigation: the main national law-enforcement agency of the U.S. government, known for investigating serious federal crimes and protecting national security.","zh":"（美国）联邦调查局：美国政府的主要国家级执法机构，负责调查重大联邦犯罪并维护国家安全。"},"examples":[{"en":"The FBI is investigating the case.","zh":"联邦调查局正在调查此案。"},{"en":"She works for the FBI as an analyst.","zh":"她在联邦调查局做分析员。"},{"en":"The suspect was questioned by the FBI.","zh":"嫌疑人被联邦调查局讯问。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the FBI; used to describe agents, offices, or investigations connected with the agency.","zh":"与联邦调查局有关的；用于描述该机构的特工、办公室或调查。"},"examples":[{"en":"An FBI agent arrived at the scene.","zh":"一名联邦调查局特工到达了现场。"},{"en":"They released an FBI report.","zh":"他们公布了一份联邦调查局的报告。"}]}],"synonyms":["Federal Bureau of Investigation","the Bureau"],"phonetic":"/ˌɛf.biːˈaɪ/","extraExplanation":["“FBI”是缩写，通常逐字母读作 /ˌɛf.biːˈaɪ/，而不是读成一个单词。","在美国文化与媒体中，FBI常出现在犯罪、反间谍与反恐题材里；它主要负责国内（美国境内）的联邦案件。与之常被对比的CIA主要负责国外情报。","口语里也常说“the Bureau”（直译“该局”）来指FBI，尤其在新闻或影视对白中。"]}
{"word":"FBS","summary":{"en":"FBS most commonly means “fasting blood sugar” in medicine or “Football Bowl Subdivision” in U.S. college sports; its exact meaning depends on context.","zh":"FBS最常见指医学中的“空腹血糖”，或美国大学体育中的“橄榄球碗赛分区”；具体含义需看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medicine) Fasting blood sugar (also called fasting blood glucose): the level of sugar (glucose) in your blood after you have not eaten for several hours, often used to screen for or monitor diabetes.","zh":"（医学）空腹血糖：指在禁食数小时后测得的血液中葡萄糖水平，常用于筛查或监测糖尿病。"},"examples":[{"en":"My doctor ordered an FBS test to check for diabetes.","zh":"医生给我开了空腹血糖（FBS）检查，用来排查糖尿病。"},{"en":"Your FBS should be measured after at least 8 hours of fasting.","zh":"空腹血糖（FBS）通常需要至少空腹8小时后测量。"}]},{"partOfSpeech":"other","definition":{"en":"(U.S. college sports) Football Bowl Subdivision: the highest level of NCAA Division I college football in the United States.","zh":"（美国大学体育）橄榄球碗赛分区：美国NCAA一级（Division I）大学橄榄球的最高级别分区。"},"examples":[{"en":"He got a scholarship offer from an FBS school.","zh":"他收到了来自FBS级别学校的奖学金邀请。"},{"en":"FBS teams can play in bowl games at the end of the season.","zh":"FBS球队在赛季末可以参加“碗赛”（bowl games）。"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation for other organizations or terms; the meaning depends on the field (e.g., business, government, statistics).","zh":"（泛指）也可能是其他机构或术语的缩写；具体含义取决于使用领域（如商业、政府、统计等）。"},"examples":[{"en":"In this report, FBS refers to a government statistics office.","zh":"在这份报告里，FBS指的是某个政府统计机构。"},{"en":"Before you translate FBS, check the context and the full name.","zh":"翻译FBS之前，先看上下文和全称。"}]}],"synonyms":["fasting blood glucose (FBG)","fasting plasma glucose (FPG)"],"phonetic":"ˌɛf biː ˈɛs","extraExplanation":["FBS作为缩写很常见，最常见的两种是医学里的“空腹血糖”和美国大学橄榄球里的“Football Bowl Subdivision”。如果你告诉我你看到FBS的句子或领域（体检单/医院、体育新闻、公司文件等），我可以帮你锁定最准确的含义。"]}

