{"word":"fc","summary":{"en":"“FC” is an abbreviation most commonly meaning “Football Club,” and it can also mean “facial cleanser” or “cutoff frequency (Fc)” depending on context.","zh":"“FC”是缩写，最常见指“足球俱乐部（Football Club）”；也可能指“洗面奶/洁面（facial cleanser）”或“截止频率（Fc）”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Football Club; used in sports team names (especially soccer).","zh":"（缩写）足球俱乐部；常用于球队名称（尤其是英式足球/“足球”）。"},"examples":[{"en":"FC Barcelona is one of the most famous clubs in the world.","zh":"巴塞罗那足球俱乐部（FC Barcelona）是世界上最有名的俱乐部之一。"},{"en":"He wears an FC Bayern jersey.","zh":"他穿着拜仁慕尼黑（FC Bayern）的球衣。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Facial cleanser; a skincare product used to clean the face.","zh":"（缩写）洗面奶/洁面产品；用于清洁面部的护肤品。"},"examples":[{"en":"I use a gentle FC every morning.","zh":"我每天早上用一款温和的洗面奶（FC）。"},{"en":"This FC removes sunscreen well.","zh":"这款洁面（FC）卸防晒很干净。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., electronics/physics) Cutoff frequency (Fc); the frequency where a filter starts to reduce a signal strongly.","zh":"（缩写，电子/物理）截止频率（Fc）；指滤波器开始明显衰减信号的频率点。"},"examples":[{"en":"Set Fc to 100 Hz for the low-pass filter.","zh":"把低通滤波器的截止频率 Fc 设为 100 赫兹。"},{"en":"Above Fc, the signal drops quickly.","zh":"超过 Fc 后，信号会快速衰减。"}]}],"synonyms":["football club","soccer club","cleanser","cutoff frequency"],"phonetic":"/ˌɛfˈsiː/","extraExplanation":["“FC”最常见的是体育语境里的 Football Club，尤其在欧洲足球队名中非常常见。不同国家/联赛的缩写习惯不完全一样，有的队会用 “FC”，有的用 “SC/CF/AFC”等。","护肤圈里把 facial cleanser 简写成“FC”更偏口语/笔记式写法，不是所有人都会这样缩写；正式场合更常写 full term（facial cleanser/cleanser）。","在工程与科学写作中，“Fc”常见于滤波器、音频分频等话题；注意大小写有时有区分（例如 Fc vs fc），具体看作者或领域习惯。"]}
{"word":"fchar","summary":{"en":"“fchar” is usually a technical abbreviation meaning a kind of character in code; its exact meaning depends on context.","zh":"“fchar”通常是技术语境中的缩写，表示某种“字符”；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation used in some programming or technical contexts to mean “a character” (a single text symbol), often with a specific role depending on the system (for example, a “format character” or “fixed-length character”). It is not a common standard English word by itself.","zh":"在某些编程或技术语境中使用的缩写，指“字符”（一个文本符号），具体含义常随系统而变（例如“格式字符”或“定长字符”）。它本身不是常见的标准英语单词。"},"examples":[{"en":"In this codebase, fchar represents a formatting character used to build the output string.","zh":"在这套代码中，fchar 表示用于构建输出字符串的“格式字符”。"},{"en":"The parser reads each fchar and decides whether it is a letter, number, or symbol.","zh":"解析器会读取每个 fchar，并判断它是字母、数字还是符号。"}]}],"synonyms":["character","char (in code)","format character","control character"],"phonetic":"ɛf tʃɑr","extraExplanation":["“fchar”不是通用英语词汇，更像项目内命名或某个库/语言里的缩写。不同环境里 f 可能代表 format（格式）、fixed（定长）、function（函数）或 file（文件）等。","如果你能告诉我你在哪个软件/语言/代码片段里看到它（或贴出前后两行），我可以帮你确定它在该语境下的准确含义与用法。"]}
{"word":"fcomp","summary":{"en":"“fcomp” is usually an abbreviation; it often means financial compensation, and in computing it can mean a Fortran compiler or a floating-point compare operation.","zh":"“fcomp”通常是缩写；常指薪酬（经济补偿），在计算机领域也可能指 Fortran 编译器或“浮点比较”操作。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal abbreviation) financial compensation; pay, especially in HR or job-offer discussions.","zh":"（非正式缩写）经济补偿；薪酬，常见于人力资源或谈薪语境。"},"examples":[{"en":"What’s the total fcomp for this role, including bonus?","zh":"这个岗位的总fcomp是多少（含奖金）？"},{"en":"They increased my fcomp after the performance review.","zh":"绩效评估后他们提高了我的薪酬。"}]},{"partOfSpeech":"other","definition":{"en":"(computing abbreviation) a Fortran compiler (the program/tool that compiles Fortran code).","zh":"（计算机缩写）Fortran 编译器（用来编译 Fortran 代码的工具/程序）。"},"examples":[{"en":"I installed fcomp to build the legacy Fortran project.","zh":"我安装了 fcomp 来编译那个旧的 Fortran 项目。"},{"en":"The code compiles on my machine, but fcomp fails on the server.","zh":"这份代码在我电脑上能编译，但服务器上的 fcomp 编译失败。"}]},{"partOfSpeech":"other","definition":{"en":"(computing abbreviation) floating-point compare (an operation/instruction that compares decimal-number values).","zh":"（计算机缩写）浮点比较（用于比较小数数值的运算/指令）。"},"examples":[{"en":"This CPU uses an fcomp instruction to compare two floating-point numbers.","zh":"这个CPU用 fcomp 指令来比较两个浮点数。"}]}],"synonyms":["comp","compensation","pay"],"phonetic":"/ˈɛf kɑmp/","extraExplanation":["“fcomp”不是一个固定的通用英语单词，更常见是圈内缩写（例如招聘/薪酬讨论或编程文档）。不同领域含义可能完全不同，最好结合你看到它的句子或行业来确认。","如果你告诉我它出现的上下文（例如聊天记录、招聘邮件、代码片段/报错信息），我可以帮你判断最准确的意思。"]}
{"word":"fconv","summary":{"en":"“fconv” is a context-dependent abbreviation, often meaning “file converter” or “(free/forced) convection/convective.”","zh":"“fconv”是一个依语境而定的缩写，常见含义包括“文件转换器”或“（自然/强制）对流/对流的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (not a standard English word) whose meaning depends on the field; it is often used in technical contexts to mean something like “file converter” or “(free/forced) convection / convective.”","zh":"一个缩写（不是标准英文单词），含义取决于领域；常见于技术语境中，可指“文件转换器”，或“（自然/强制）对流/对流的”等。"},"examples":[{"en":"This tool is called fconv because it acts as a file converter.","zh":"这个工具叫 fconv，因为它用来做文件转换。"},{"en":"In the report, fconv refers to convection heat transfer, not a software name.","zh":"在这份报告里，fconv 指的是对流换热，不是软件名称。"}]}],"synonyms":["abbrev.","short for"],"phonetic":"/ɛf kɑnv/","extraExplanation":["“fconv”更像是变量名/函数名/命令名或领域缩写，而不是通用词汇。常见写法包括 f_conv（对流项/对流通量）、或用作 file converter 的简称。","如果你能提供一句原文（例如它出现在哪个句子、论文/代码/软件里），我可以给出更准确的释义与对应翻译建议。"]}
{"word":"fconvert","summary":{"en":"“fconvert” is usually a tool/command name meaning to convert formats in computing.","zh":"“fconvert”通常是工具/命令名，表示在计算机领域进行格式转换。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard term (often a command name, function name, or file/tool label) meaning “to convert something from one format to another,” especially in computing (e.g., converting files, fonts, or data formats).","zh":"一个非标准用词（常见于命令名、函数名或工具标签），通常表示“把某物从一种格式转换成另一种格式”，多用于计算机领域（如文件、字体或数据格式转换）。"},"examples":[{"en":"Use fconvert to change the image from PNG to JPG.","zh":"用 fconvert 把图片从 PNG 转成 JPG。"},{"en":"The script calls fconvert before uploading the file.","zh":"脚本在上传文件之前会调用 fconvert。"},{"en":"I can’t find fconvert on my system—maybe it’s part of a specific app.","zh":"我在系统里找不到 fconvert——可能它属于某个特定软件。"}]}],"synonyms":["convert","format converter","file converter"],"phonetic":"/ˈɛf kənˌvɝt/","extraExplanation":["“fconvert”不是常见英语词典里的标准词，更像是“file/format/font convert”的缩写命名方式（其中 f 代表 file/format/font 等，convert 表示转换）。","不同软件或项目里，“fconvert”可能指完全不同的工具/命令。若你能提供上下文（例如它出现在终端报错、代码片段、软件名称里），我可以帮你确认它具体指什么以及如何使用。"]}
{"word":"fcp","summary":{"en":"FCP most commonly means Final Cut Pro (Apple’s video-editing software), but it can also be a field-specific abbreviation with other meanings.","zh":"FCP 最常见指 Final Cut Pro（苹果的视频剪辑软件），也可能是各领域使用的其他缩写，需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Final Cut Pro, a professional video-editing software made by Apple.","zh":"（缩写）Final Cut Pro，苹果公司出品的专业视频剪辑软件。"},"examples":[{"en":"I edited the documentary in FCP and exported it in 4K.","zh":"我用 FCP 剪了这部纪录片，并导出了 4K 版本。"},{"en":"Our media class teaches basic cutting and color correction in FCP.","zh":"我们的传媒课会教用 FCP 做基础剪辑和调色。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) In science/medicine/business texts, FCP can stand for different terms depending on the field (for example, “fracture callus pressure,” “fluorocarbon polymer,” etc.).","zh":"（缩写）在科学/医学/商业语境中，FCP 可能代表不同术语（例如“fracture callus pressure（骨痂压力）”“fluorocarbon polymer（含氟聚合物）”等），需结合上下文判断。"},"examples":[{"en":"In this paper, FCP refers to a measurement defined in the methods section.","zh":"在这篇论文里，FCP 指的是方法部分定义的一项测量值。"},{"en":"Please define FCP the first time you use it in your report.","zh":"请在报告中第一次出现时把 FCP 的全称写出来并加以说明。"}]}],"synonyms":["Final Cut Pro (when referring to the software)"],"phonetic":"/ˌɛf si ˈpi/","extraExplanation":["“FCP”最常见的日常用法通常是指苹果的剪辑软件 Final Cut Pro（尤其在影视/自媒体/后期制作圈）。","因为缩写在不同领域会重复使用，如果你能告诉我你看到“FCP”的句子或领域（剪辑、医学、工程、游戏等），我可以给出更精准的释义。"]}
{"word":"fcs","summary":{"en":"FCS is an abbreviation; in science it most commonly means fetal calf serum used in cell culture.","zh":"FCS 是缩写；在科研语境中最常指细胞培养用的胎牛血清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(initialism) Fetal calf serum; a supplement added to cell-culture media in biology and medicine.","zh":"（缩写）胎牛血清；生物/医学细胞培养中常加入培养基的血清补充物。"},"examples":[{"en":"We grew the cells in DMEM with 10% FCS.","zh":"我们用含 10% FCS 的 DMEM 来培养细胞。"},{"en":"The protocol says to heat-inactivate the FCS before use.","zh":"实验流程要求使用前先对 FCS 进行热灭活处理。"}]},{"partOfSpeech":"other","definition":{"en":"(initialism) An abbreviation that can stand for different names depending on context (e.g., organizations, school courses, or technical terms).","zh":"（缩写）根据语境可代表不同名称的缩写（例如组织名称、课程名或技术术语）。"},"examples":[{"en":"What does FCS stand for in this document?","zh":"在这份文件里，FCS 代表什么？"},{"en":"In science, FCS often means fetal calf serum.","zh":"在科学语境中，FCS 常指胎牛血清。"}]}],"synonyms":["FBS (common alternative for fetal bovine serum)"],"phonetic":"/ˌɛf si ˈɛs/","extraExplanation":["“FCS”最常见的实际用法之一是在实验室语境中指“胎牛血清”。但在非科研场景里，它也可能是某个机构/课程/系统名称的缩写，因此理解时最好结合上下文或直接询问“stands for what”。"]}
{"word":"fcy","summary":{"en":"FCY means “foreign currency,” commonly used in finance to refer to non-local currency amounts.","zh":"FCY表示“外币”，常用于金融语境，指非本币/本地货币的金额。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) foreign currency; money that is not the local currency (often used in banking and accounting).","zh":"（缩写）外币；非本国/本地货币（常用于银行与会计语境）。"},"examples":[{"en":"The invoice is in FCY, so we need to convert it to USD for reporting.","zh":"这张发票是外币（FCY）计价，所以我们需要换算成美元用于报表。"},{"en":"The company holds FCY deposits to pay overseas suppliers.","zh":"公司持有外币（FCY）存款，用来支付海外供应商。"}]}],"synonyms":["foreign currency","non-local currency"],"phonetic":"/ˌɛf siˈwaɪ/","extraExplanation":["在金融文件里，FCY常与LCY（local currency，本币/本地货币）对比使用，用来区分“原币金额”和“换算成本币后的金额”。","读写时通常按字母念：F-C-Y。不同机构也可能写作“fcy/FCY”，含义不变。"]}

