{"word":"FH","summary":{"en":"“FH” is an initialism meaning different things in different contexts; common meanings include Fahrenheit (temperature) and Front of House (customer-facing staff/area).","zh":"“FH”是首字母缩写，含义随语境变化；常见指华氏度（温度）或前场/前台（面向顾客的区域/员工）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(initialism) The letters “F” and “H,” used as an abbreviation. Common meanings depend on the context (e.g., in science, places, names, or organizations).","zh":"（首字母缩写）字母“F”和“H”的组合，用作缩写。具体含义取决于语境（如科学、地点、人名或机构等）。"},"examples":[{"en":"What does “FH” stand for in this document?","zh":"这份文件里的“FH”代表什么？"},{"en":"Please write the full name instead of “FH.”","zh":"请写全称，不要只写“FH”。"}]},{"partOfSpeech":"other","definition":{"en":"(common in everyday contexts) Abbreviation for “Fahrenheit,” a temperature scale used mainly in the United States.","zh":"（日常常见）“Fahrenheit（华氏度）”的缩写，美国最常用的温度单位之一。"},"examples":[{"en":"It’s 72°F (FH) inside the house.","zh":"屋里是72华氏度（FH）。"},{"en":"The weather app shows temperatures in FH, not Celsius.","zh":"天气软件显示的是华氏度（FH），不是摄氏度。"}]},{"partOfSpeech":"other","definition":{"en":"(work/venues) Abbreviation for “Front of House,” meaning the customer-facing area/staff in places like restaurants or theaters.","zh":"（工作/场馆）“Front of House（前场/前台）”的缩写，指餐厅、剧院等面向顾客的区域或员工。"},"examples":[{"en":"She works in FH, greeting guests at the door.","zh":"她在FH（前场）工作，在门口接待客人。"},{"en":"The manager asked the FH team to be ready by 6 p.m.","zh":"经理让FH团队在晚上6点前准备好。"}]}],"synonyms":["abbrev.","initialism","acronym"],"phonetic":"/ˌɛf ˈeɪtʃ/","extraExplanation":["“FH”本身不是一个固定词汇，更像“缩写/首字母”。看到它时，最重要的是找同一份材料里的提示（标题、表格单位、行业背景）。","表示温度时，标准写法更常见的是“°F”（华氏度符号），而不是“FH”。如果你是在某个特定句子或专业领域里看到“FH”，把原句发来我可以帮你确定最准确的含义。"]}
{"word":"Fhlannchaidh","summary":{"en":"Fhlannchaidh is a Gaelic name-form (often inside surnames) meaning “of Flannchadh,” and the initial “fh” is typically silent due to lenition.","zh":"Fhlannchaidh 是盖尔语姓名形式（常见于姓氏中），意为“源自/属于 Flannchadh”，因弱化变音首字母 “fh” 通常不发音。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Gaelic (Irish/Scottish Gaelic) personal-name form meaning “(of) Flannchadh/Flannchaidh,” often seen inside traditional surnames (patronymics)","zh":"盖尔语（爱尔兰语/苏格兰盖尔语）人名形式，意为“（属于/源自）Flannchadh/Flannchaidh”，常见于传统父系姓氏构成中"},"examples":[{"en":"The surname Mac Fhlannchaidh is sometimes anglicized as Clancy.","zh":"姓氏 Mac Fhlannchaidh 有时会英语化为 Clancy。"},{"en":"In older records, you may see Ó Fhlannchaidh as a family name.","zh":"在较早的文献记录里，你可能会看到 Ó Fhlannchaidh 作为家族姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"the lenited (softened) spelling of Flannchaidh used after certain Gaelic words (so the “fh” is typically silent)","zh":"Flannchaidh 的“弱化变音（lenition）”拼写形式，用在某些盖尔语词之后（因此 “fh” 通常不发音）"},"examples":[{"en":"After Mac (“son of”), Gaelic spelling can trigger lenition: Mac Fhlannchaidh.","zh":"在 Mac（“……之子”）之后，盖尔语拼写可能引发弱化变音：Mac Fhlannchaidh。"},{"en":"Even if it looks complex, many speakers don’t pronounce the “fh” sound here.","zh":"虽然看起来复杂，但这里的 “fh” 许多情况下并不发音。"}]}],"synonyms":["Flannchaidh","Flannchadh","Mac Fhlannchaidh","Ó Fhlannchaidh"],"phonetic":"/ˈlɑnxi/","extraExplanation":["“Fhlannchaidh”通常不是单独使用的英文词，而是出现在盖尔语姓名/姓氏里的一部分。它带有“lenition（弱化变音）”的拼写特征：在爱尔兰语/苏格兰盖尔语中，某些语法环境会让词首辅音发生变化；其中“fh”往往表示该辅音弱化到几乎不发音。","英语化（anglicization）也很常见：例如 Irish 的 Mac Fhlannchaidh 常被英语写作/理解为 Clancy（不同地区与家族会有差异）。如果你告诉我它出现的完整姓氏或句子语境，我可以给更贴近该地区的读音和对应英语形式。"]}
{"word":"fhrer","summary":{"en":"“Führer” means “leader” in German, but in English it most often refers specifically to Adolf Hitler and is strongly associated with Nazi Germany.","zh":"“Führer”在德语中意为“领袖/领导者”，但在英语里最常特指希特勒，并与纳粹德国强烈关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often capitalized) A German word meaning “leader”; in English it most commonly refers to Adolf Hitler as the leader of Nazi Germany.","zh":"（常大写）德语词，意为“领袖/领导者”；在英语中最常指纳粹德国时期的阿道夫·希特勒。"},"examples":[{"en":"In many history books, “the Führer” refers to Adolf Hitler.","zh":"在许多历史书中，“the Führer”指的就是阿道夫·希特勒。"},{"en":"Because of its strong Nazi association, many writers avoid using the word outside historical context.","zh":"由于它与纳粹有强烈关联，许多作者会避免在历史语境之外使用这个词。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, more literal) A leader or guide; a person who leads others (sometimes seen in translations from German).","zh":"（较少见，偏字面）领导者/引导者；带领他人的人（有时见于德语译文）。"},"examples":[{"en":"In older translations, a “führer” may simply mean a guide or leader.","zh":"在较早的译文中，“führer”可能只是指“向导”或“领导者”。"}]}],"synonyms":["leader","head","chief"],"phonetic":"/ˈfjʊrər/","extraExplanation":["你输入的 **fhrer** 很可能是拼写遗漏了变音符的 **Führer / fuhrer**。德语里的 **ü** 常在英文中写成 **ue**（如 *Fuehrer*），也常直接写成 *fuhrer*。","这个词在英语语境里高度敏感，通常只在二战/纳粹相关的历史讨论中使用。日常想表达“领导者”，更中性常用的是 **leader**、**head**、**chief**。"]}

