{"word":"fib","summary":{"en":"“Fib” means a small, usually harmless lie, and it can be used as both a noun and a verb.","zh":"“fib”指“小谎言/无伤大雅的谎”，既可作名词也可作动词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, harmless lie (often told to avoid hurting someone’s feelings or to make a story sound better)","zh":"小谎言；无伤大雅的谎（常为避免伤害他人感受或让故事更好听）"},"examples":[{"en":"I told a little fib and said I loved the gift.","zh":"我撒了个小谎，说我很喜欢那份礼物。"},{"en":"That’s a fib—you were the one who ate the last cookie.","zh":"那是个小谎——是你吃了最后一块饼干。"}]},{"partOfSpeech":"v.","definition":{"en":"to tell a small, harmless lie","zh":"撒小谎；说无伤大雅的谎"},"examples":[{"en":"Kids sometimes fib when they’re afraid of getting in trouble.","zh":"孩子害怕挨骂时有时会撒小谎。"},{"en":"Please don’t fib to me—just tell me what happened.","zh":"请别对我撒小谎——直接告诉我发生了什么。"}]}],"synonyms":["small lie","white lie","untruth"],"phonetic":"/fɪb/","extraExplanation":["“fib”语气通常比“lie”轻，带有“并非恶意、程度较小”的感觉，但在正式场合或严肃话题中仍建议用更直接的“lie/false statement”，避免淡化事实。"]}
{"word":"fibbed","summary":{"en":"“Fibbed” means “lied,” usually a small or harmless lie.","zh":"“fibbed”表示“撒了谎”，通常指无伤大雅或善意的小谎。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"told a small or harmless lie; lied (past tense/past participle of “fib”).","zh":"撒了小谎；说了善意或无伤大雅的谎（“fib”的过去式/过去分词）。"},"examples":[{"en":"He fibbed about his age on the form.","zh":"他在表格上把年龄稍微撒了个谎。"},{"en":"I fibbed and said I was busy because I didn’t want to go.","zh":"我撒谎说我很忙，因为我不想去。"},{"en":"She admitted she’d fibbed to avoid hurting his feelings.","zh":"她承认自己为了不伤他的感情而撒了个小谎。"}]}],"synonyms":["lied","told a white lie","prevaricated (more formal)"],"phonetic":"/fɪbd/","extraExplanation":["“fib”通常指“小谎、善意的谎”，语气比“lie”更轻一些，但依然是不真实的话。在正式场合或严肃语境中，人们更常用“lie / lied”；“fibbed”多见于口语或较轻松的叙述中。"]}
{"word":"fibber","summary":{"en":"A “fibber” is someone who tells small, usually harmless lies.","zh":"“fibber”指爱说小谎、通常不太恶意的撒谎者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who tells small or harmless lies (often used with a mildly joking or scolding tone).","zh":"（常带玩笑或轻微责备语气的）说小谎的人；爱编小谎的人。"},"examples":[{"en":"Don’t be such a fibber—just tell me what really happened.","zh":"别再编了——直接告诉我到底发生了什么。"},{"en":"He’s not a bad kid; he’s just a bit of a fibber sometimes.","zh":"他不是坏孩子；只是有时候会撒点小谎。"}]}],"synonyms":["teller of tall tales","storyteller (informal)","liar (stronger)"],"phonetic":"/ˈfɪbɚ/","extraExplanation":["“fibber”来自“fib”（小谎）。它通常比“liar”语气更轻，常用于孩子或亲近的人之间，表示“撒点小谎/编点小故事”，但在正式或严肃场合仍可能显得不礼貌。","文化语感上，“liar”更重、更具指控性；如果你想更委婉，可以用“not being honest”“not telling the whole truth”。"]}
{"word":"fibbers","summary":{"en":"“Fibbers” means people who tell small, not very serious lies.","zh":"“Fibbers”指那些说不太严重的小谎的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who tell small lies; liars (often about minor or not very serious things).","zh":"说小谎的人；撒（无伤大雅的）小谎的人。"},"examples":[{"en":"He’s a fibber—he said he finished his homework, but he didn’t.","zh":"他就是个爱说小谎的人——他说作业写完了，其实没有。"},{"en":"Don’t be fibbers; tell the truth even when it’s uncomfortable.","zh":"别说小谎；即使不舒服也要说真话。"}]}],"synonyms":["liars","storytellers","tall-tale tellers"],"phonetic":"/ˈfɪbɚz/","extraExplanation":["“fibber”来自动词“fib”（说小谎）。语气通常比“liar”轻一些，常用于批评孩子或朋友的“小谎”，但在正式场合或涉及严重欺骗时，用“liar”更常见也更严厉。","“fibbers”是复数形式：one fibber（一个说小谎的人）→ two fibbers（两个说小谎的人）。"]}
{"word":"fibbery","summary":{"en":"“Fibbery” means somewhat untruthful or full of little lies (informal).","zh":"“fibbery”指有点不诚实、爱编小谎（非正式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Full of small lies; not truthful.","zh":"（非正式）充满小谎言的；不诚实的。"},"examples":[{"en":"His fibbery excuse didn’t convince anyone.","zh":"他那套充满小谎言的借口谁也没被说服。"},{"en":"The story sounded a bit fibbery, so I checked the facts.","zh":"这个故事听起来有点不靠谱（像在编小谎），所以我去核实了事实。"}]}],"synonyms":["untruthful","dishonest","lying","deceptive"],"phonetic":"/ˈfɪbəri/","extraExplanation":["“fibbery”来自“fib”（小谎言、善意的小谎），语气通常比“lying / dishonest”更轻一些，常暗示“夸大其词、编点小故事”，但在正式场合仍可能显得不礼貌或不专业。"]}
{"word":"fibbing","summary":{"en":"Fibbing means telling a small, usually harmless lie.","zh":"fibbing 指“撒小谎”，通常是无伤大雅的谎。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"telling a small, harmless lie (often to avoid hurting someone’s feelings or to make a story a bit better)","zh":"撒小谎；编个无伤大雅的谎（常为避免伤人或让故事更好听）"},"examples":[{"en":"Are you fibbing, or did you really meet a celebrity?","zh":"你是在撒小谎，还是你真的见过名人？"},{"en":"She fibbed about her age to get into the movie.","zh":"她谎报年龄，好进电影院。"},{"en":"He admitted he was fibbing to avoid an argument.","zh":"他承认自己撒了个小谎，只是为了避免争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"a small, harmless lie","zh":"小谎；善意的谎言"},"examples":[{"en":"It was just a little fib to protect his surprise birthday plan.","zh":"那只是个小谎，为了保住他的生日惊喜计划。"},{"en":"Kids sometimes tell fibs when they’re scared of getting in trouble.","zh":"孩子有时因为害怕被责罚而说小谎。"}]}],"synonyms":["telling a little lie","stretching the truth","white lie"],"phonetic":"/ˈfɪbɪŋ/","extraExplanation":["“fib”比“lie”语气更轻，常暗示“影响不大、无伤大雅”的谎；但在正式场合或涉及诚信问题时，即使是“fib”，也可能被视为不诚实。","“fibbing”通常是动词fib的现在分词/动名词形式：Stop fibbing.（别撒谎了。） / Fibbing won’t help.（撒谎没用。）"]}
{"word":"fibdom","summary":{"en":"A fiefdom is a feudal lord’s territory, or (figuratively) a domain controlled by one person or group.","zh":"fiefdom 指封建领主的领地；也可比喻某人或某团体把持的“地盘/势力范围”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A territory or estate ruled by a lord in the medieval feudal system (historically, a “fief”).","zh":"（中世纪封建制度中）领主统治的领地、采邑（即“封地”）。"},"examples":[{"en":"In the Middle Ages, the king could grant land as a fiefdom to a loyal knight.","zh":"在中世纪，国王可能把土地作为封地（fiefdom）赐给忠诚的骑士。"},{"en":"The novel describes a small fiefdom where the lord controlled the local courts and taxes.","zh":"小说描写了一个小领地，领主掌控当地的法庭和税收。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A place, organization, or area of activity controlled by one person or group, often in an unfair or overly powerful way.","zh":"（比喻）被某个人或团体控制的地盘、势力范围（常含“把持、专断”的贬义）。"},"examples":[{"en":"He treated the department like his personal fiefdom.","zh":"他把这个部门当成自己的私人地盘。"},{"en":"Corruption turned the local government into a political fiefdom.","zh":"腐败把地方政府变成了政治“地盘”。"}]}],"synonyms":["domain","territory","realm","kingdom","stronghold","sphere of influence","turf"],"phonetic":"/ˈfiːfdəm/","extraExplanation":["“fibdom”不是常见英文单词，很可能是拼写错误，通常想写的是 **fiefdom**。","词源提示：**fiefdom** 来自 **fief**（封地）+ **-dom**（表示“领域/状态”，如 kingdom）。在现代语境里常用作比喻，带有“被某人把持的地盘”的语气。","文学/文化用法：历史小说、奇幻作品常用 **fiefdom** 描写封建领地；新闻评论中也会用它批评某些机构被个人或家族长期控制。"]}
{"word":"fiber","summary":{"en":"Fiber can mean dietary fiber (nutrition), a thread-like material used in textiles, or optical fiber used for fast communication.","zh":"fiber 可指膳食纤维（营养）、纺织等用的纤维材料，或用于高速通信的光纤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant-based nutrient that your body cannot fully digest; it helps digestion and keeps you feeling full.","zh":"（膳食）纤维：人体无法完全消化的植物性成分，有助于肠道蠕动与消化，也能增加饱腹感。"},"examples":[{"en":"Vegetables, beans, and whole grains are high in fiber.","zh":"蔬菜、豆类和全谷物都富含纤维。"},{"en":"Try to eat more fiber to help with digestion.","zh":"试着多吃点纤维来帮助消化。"}]},{"partOfSpeech":"n.","definition":{"en":"A thin, thread-like strand; a natural or man-made material used to make cloth, rope, or other products.","zh":"纤维：细丝状的条状物；天然或人造的材料，用来制作布料、绳子等产品。"},"examples":[{"en":"Cotton fiber is soft and comfortable.","zh":"棉纤维柔软舒适。"},{"en":"This jacket is made from synthetic fibers.","zh":"这件夹克是由合成纤维制成的。"}]},{"partOfSpeech":"n.","definition":{"en":"A very fine strand that carries light or signals, especially in fiber-optic communication.","zh":"（光）纤：用于传输光或信号的极细丝状材料，尤指光纤通信。"},"examples":[{"en":"The city is expanding its fiber internet network.","zh":"这座城市正在扩建光纤网络。"},{"en":"Fiber-optic cables can transmit data very fast.","zh":"光纤电缆可以非常快速地传输数据。"}]}],"synonyms":["dietary fiber","roughage","strand","filament","optical fiber"],"phonetic":"/ˈfaɪbɚ/","extraExplanation":["美式英语里更常拼作 fiber；英式英语通常写作 fibre。两者发音相同、意思也相同，只是拼写习惯不同。","常见搭配：dietary fiber（膳食纤维）、high-fiber diet（高纤维饮食）、fiber optic(s) / fiber-optic（光纤/光纤的）、fiber internet（光纤网络）。"]}
{"word":"fiber diet","summary":{"en":"a diet high in dietary fiber","zh":"高膳食纤维饮食"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a diet that includes a lot of dietary fiber (from foods like vegetables, fruit, whole grains, and beans), often to support digestion and heart health","zh":"富含膳食纤维的饮食（多来自蔬菜、水果、全谷物、豆类等），常用于促进消化与心血管健康"},"examples":[{"en":"My doctor suggested a fiber diet to help with constipation.","zh":"医生建议我采用富含纤维的饮食来缓解便秘。"},{"en":"A fiber diet usually includes oats, beans, and plenty of vegetables.","zh":"富含纤维的饮食通常包括燕麦、豆类和大量蔬菜。"},{"en":"If you start a fiber diet, increase fiber slowly and drink more water.","zh":"如果开始高纤维饮食，要循序渐进增加纤维，并多喝水。"}]}],"synonyms":["high-fiber diet","fiber-rich diet","high-fiber eating plan"],"phonetic":"/ˈfaɪbɚ ˈdaɪət/","extraExplanation":["日常语境里更自然的说法通常是“a high-fiber diet”或“a fiber-rich diet”。单说“fiber diet”也能理解，但在医疗/营养建议中常加 high- 或 -rich 更明确。","膳食纤维主要分为可溶性（如燕麦、豆类）与不可溶性（如全麦、部分蔬菜）；不同类型对血糖、胆固醇、排便的影响略有差异。"],"etymology":"由“fiber（纤维）+ diet（饮食）”组合而成的现代健康用语；更常见的表达是“high-fiber diet（高纤维饮食）”。","mnemonic":["把它拆开记：fiber=“纤维”，diet=“饮食”；合起来就是“吃纤维多的饮食”。","联想常见搭配：high-fiber（高纤维）≈ high（高）+ fiber（纤维），一看到 high-fiber diet 就知道“更高的纤维摄入”。"]}
{"word":"fiber optic cable","summary":{"en":"a data cable that transmits information using light through optical fibers","zh":"用光在光纤中传输信息的数据电缆"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a cable that uses very thin strands of glass or plastic (optical fiber) to send data as pulses of light, often for high-speed internet and telecommunications","zh":"一种使用极细的玻璃或塑料“光纤”来以光脉冲传输数据的电缆，常用于高速互联网和通信"},"examples":[{"en":"Our office switched to fiber optic cable for faster and more stable internet.","zh":"我们办公室改用光纤电缆，以获得更快、更稳定的网络。"},{"en":"Fiber optic cable can carry large amounts of data over long distances with low signal loss.","zh":"光纤电缆可以在长距离内以较低的信号衰减传输大量数据。"},{"en":"The technician ran fiber optic cable into the building and tested the connection.","zh":"技术人员把光纤电缆接入大楼并测试了连接。"}]}],"synonyms":["fiber cable","fiber-optic cable","optical fiber cable","optical cable"],"phonetic":"/ˈfaɪbɚ ˈɑptɪk ˈkeɪbəl/","extraExplanation":["英美拼写差异：美国更常写 fiber optic cable；英式拼写常见 fibre optic cable。","常见搭配：fiber optic network（光纤网络）、fiber line（光纤线路）、fiber-to-the-home/FTTH（光纤到户）。","与普通“铜缆/网线”对比：光纤以“光”传输，抗电磁干扰更强、带宽更大、距离更远；但施工和熔接更专业、成本可能更高。"],"etymology":"“fiber/fibre”源自拉丁语 fibra（纤维）；“optic”来自希腊语 optikos（与视觉/光学有关）。该短语用于描述以“光”作为信息载体的电缆技术，20世纪通信工程领域普及后成为常见术语。","mnemonic":["把它拆开记：fiber（纤维）+ optic（光学的）+ cable（电缆）=“用光学纤维做的电缆”。","联想“光纤=光+纤维”：数据像“灯光闪烁”一样在细纤维里跑。"]}
{"word":"fiber optic network","summary":{"en":"A data network that carries information via light through optical fibers.","zh":"通过光纤以光信号传输数据的通信网络。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A communication network that uses thin glass or plastic fibers to transmit data as light signals, enabling very fast and reliable internet and telecom connections.","zh":"一种使用细玻璃或塑料光纤把数据以“光信号”传输的通信网络，可提供高速且稳定的互联网与通信连接。"},"examples":[{"en":"Our neighborhood finally got a fiber optic network, and streaming no longer buffers.","zh":"我们小区终于接入了光纤网络，看视频再也不怎么卡顿了。"},{"en":"The hospital upgraded to a fiber optic network to support high-resolution medical imaging.","zh":"医院升级为光纤网络，以支持高分辨率医学影像传输。"},{"en":"A fiber optic network is less affected by electrical interference than copper cables.","zh":"与铜缆相比，光纤网络更不容易受到电磁干扰影响。"}]}],"synonyms":["optical fiber network","fiber network","optical network","FTTH network"],"phonetic":"/ˈfaɪbɚ ˈɑptɪk ˈnɛtˌwɝk/","extraExplanation":["日常口语里常简化说成 “fiber” 或 “fiber internet”（光纤/光纤宽带）。","常见相关词：fiber-to-the-home (FTTH，光纤到户)、bandwidth（带宽）、latency（延迟）。光纤的优势通常是带宽更大、延迟更低、距离更远、抗干扰更强。"],"etymology":"“fiber optic”指“光纤的”（optic=光学的），源自拉丁语 opticus（与视觉/光相关）；“network”来自古法语/拉丁语，原指“网”，后引申为“网络/系统”。合起来表示“用光纤构成的通信网络”。","mnemonic":["把它拆开记：fiber（纤维）+ optic（光的）→ “用纤维传光” → 光纤；network（网络）→ 光纤网络。","联想：光纤里跑的是“光”，所以速度快、信号稳。"]}
{"word":"fiber optic technology","summary":{"en":"Data transmission through optical fibers using light signals.","zh":"通过光纤用光信号传输数据的技术。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Technology that uses thin strands of glass or plastic (optical fibers) to transmit data as pulses of light, often for internet, telecommunications, and sensors.","zh":"利用细玻璃或塑料光纤把数据以光脉冲形式传输的技术，常用于互联网、通信和传感。"},"examples":[{"en":"Many cities upgraded their networks using fiber optic technology for faster internet.","zh":"许多城市通过采用光纤技术升级网络，以获得更快的网速。"},{"en":"Fiber optic technology can carry signals over long distances with low signal loss.","zh":"光纤技术可以在长距离传输中保持较低的信号衰减。"},{"en":"Hospitals and factories also use fiber optic technology in sensors to monitor equipment safely.","zh":"医院和工厂也会用光纤技术做传感器，以更安全地监测设备。"}]}],"synonyms":["optical fiber technology","fibre-optic technology","optical communications","photonic communication"],"phonetic":"/ˈfaɪbər ˈɑptɪk tɛkˈnɑlədʒi/","extraExplanation":["光纤传输的核心是“用光传信息”：发送端把电信号转换成光脉冲，经光纤传播后在接收端再转换回电信号。","常见优势：带宽大（速度快）、抗电磁干扰强、远距离衰减小；常见应用：家庭宽带、海底光缆、数据中心互联、工业与医疗传感。","英语里也常写作“fiber-optic technology”（加连字符），含义不变；英式拼写常见“fibre optic”。"],"etymology":"“fiber optic”来自“fiber（纤维）+ optic（光学的）”，指以光纤进行光学传输；“technology”源自希腊语词根，意为“技艺/方法”。该短语在现代通信发展中固定用来指“光纤通信相关技术”。","mnemonic":["记忆法：fiber=“纤维/纤”，optic=“光学/光”，合起来就是“用纤维传光”的技术——光纤技术。","联想：把信息“变成光”在细细的“玻璃纤维”里跑——像“光在管道里走”。"]}
{"word":"fiber-cement","summary":{"en":"Fiber-cement is a durable construction material made of cement reinforced with fibers, often used for siding and panels.","zh":"Fiber-cement 指用纤维增强的水泥复合建材，耐用，常用于外墙挂板和板材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a composite building material made from cement reinforced with fibers (today usually cellulose fibers), used for siding, roofing, panels, and other construction products","zh":"一种复合型建筑材料，由水泥与纤维（如今多为纤维素纤维）增强制成，常用于外墙挂板、屋面、板材等建材产品"},"examples":[{"en":"Fiber-cement siding is popular because it resists rot and insects.","zh":"纤维水泥外墙挂板很受欢迎，因为它防腐烂、抗虫害。"},{"en":"They replaced the old wooden boards with fiber-cement panels.","zh":"他们把旧木板换成了纤维水泥板。"},{"en":"Fiber-cement roofing can handle harsh weather better than some lightweight materials.","zh":"纤维水泥屋面在恶劣天气下的耐受性比一些轻质材料更好。"}]}],"synonyms":["fiber cement","cement board","fiber-cement board"],"phonetic":"/ˌfaɪbɚ ˈsəˌmɛnt/","extraExplanation":["“fiber-cement”常见于建筑与装修语境，也写作“fiber cement”。很多产品会标注为“fiber-cement board/panel/siding”。","历史上有些纤维水泥产品曾使用石棉（asbestos）作增强纤维；现代主流产品通常改用纤维素等更安全的纤维。若涉及拆除老旧材料，应遵循当地安全规范。","与之相关的常见搭配：fiber-cement siding（纤维水泥外墙挂板）、fiber-cement board（纤维水泥板）、fiber-cement panel（纤维水泥墙板/板材）。"]}
{"word":"fiber-eating","summary":{"en":"“Fiber-eating” describes someone/something that eats or emphasizes foods high in dietary fiber.","zh":"“fiber-eating”指（人/动物）吃高膳食纤维食物的，或（食物/饮食）强调高膳食纤维的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or animal) eating food that contains a lot of dietary fiber (such as whole grains, beans, fruits, and vegetables).","zh":"（人或动物）吃富含膳食纤维的食物（如全谷物、豆类、水果和蔬菜）的。"},"examples":[{"en":"Fiber-eating habits can help keep your digestion regular.","zh":"吃高纤维的习惯有助于让消化更规律。"},{"en":"The fiber-eating group in the study reported fewer digestive complaints.","zh":"研究中“高纤维饮食”的组别报告的消化不适更少。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of food or a diet) designed to be high in dietary fiber.","zh":"（食物或饮食）以高膳食纤维为特点或目的的。"},"examples":[{"en":"She switched to a fiber-eating meal plan with more beans and oats.","zh":"她改成了更偏高纤维的饮食计划，加入了更多豆类和燕麦。"},{"en":"These are fiber-eating snacks made with whole grains.","zh":"这些是用全谷物做的高纤维零食。"}]}],"synonyms":["high-fiber","fiber-rich","fiber-heavy","whole-grain-focused"],"phonetic":"/ˈfaɪbɚ ˌiːtɪŋ/","extraExplanation":["“fiber-eating”是由名词fiber（纤维）+ 现在分词eating构成的复合形容词，常用连字符，放在名词前作定语（如fiber-eating habits / a fiber-eating group）。放在名词后也可以（如People are fiber-eating），但较少见。","在营养语境里，fiber指“膳食纤维”，不是衣物纤维。更常见、更自然的表达还包括high-fiber 或 fiber-rich。"]}
{"word":"fiber-forming","summary":{"en":"“Fiber-forming” describes something that can form fibers (thread-like strands), especially materials like polymers; it can also refer to forming fibrous tissue in biology/medicine.","zh":"“fiber-forming”指能形成纤维（线状细丝）的，尤用于聚合物等材料；在生物/医学语境中也可指形成纤维组织的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to form fibers (long, thin strands), especially when a material is processed (spun, drawn, or extruded) into thread-like form.","zh":"能形成纤维的；（尤指材料在纺丝、拉伸或挤出等加工过程中）可形成细长丝状纤维的。"},"examples":[{"en":"Nylon is a fiber-forming polymer widely used in clothing.","zh":"尼龙是一种能形成纤维的聚合物，广泛用于服装。"},{"en":"Scientists tested whether the new material was fiber-forming under heat and pressure.","zh":"科学家测试这种新材料在高温和压力下是否具有成纤维性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Producing or leading to the formation of fibrous tissue.","zh":"（生物/医学）产生或导致纤维组织形成的。"},"examples":[{"en":"Some chronic injuries can trigger a fiber-forming response in tissue.","zh":"一些慢性损伤会引发组织的成纤维反应。"},{"en":"Doctors monitored the fiber-forming changes during healing.","zh":"医生在愈合过程中监测成纤维变化。"}]}],"synonyms":["fibrous","spinnable","filament-forming","fiber-producing"],"phonetic":"/ˈfaɪbɚ ˌfɔrmɪŋ/","extraExplanation":["“fiber-forming”多见于材料科学与纺织语境：强调材料在加工条件下能否被“拉成丝/纺成线”，常与polymer（聚合物）、spinning（纺丝）、extrusion（挤出）、drawing（拉伸）等词搭配。","书写上常用连字符（fiber-forming）作定语；也可写作fiber forming（较口语/说明性）。在英式英语中常拼作fibre-forming。"]}
{"word":"fiber-free","summary":{"en":"“Fiber-free” means having no (or almost no) fiber—most often in food and diets; it can also mean without fiber-based materials or fiber-optic connections.","zh":"“fiber-free”指不含（或几乎不含）纤维，最常用于饮食/食物；也可指不使用纤维材料或没有光纤连接。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing dietary fiber; having little or no fiber.","zh":"不含（或几乎不含）膳食纤维的；低纤维的。"},"examples":[{"en":"After the procedure, the doctor told him to eat a fiber-free diet for a few days.","zh":"术后医生让他吃几天无纤维饮食。"},{"en":"Many clear juices are fiber-free because the pulp has been removed.","zh":"很多澄清果汁因为去除了果肉，所以不含纤维。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not made with fiber (such as glass fiber or carbon fiber) or not connected by fiber-optic cable; without fiber-based materials or connections.","zh":"不含纤维材料（如玻璃纤维、碳纤维）的；不使用光纤连接的。"},"examples":[{"en":"The building is fiber-free, so the internet relies on cable instead.","zh":"这栋楼没有光纤，所以网络改用同轴电缆。"},{"en":"The new model is fiber-free and uses a metal frame.","zh":"新款不使用纤维材料，采用金属框架。"}]}],"synonyms":["fiberless","low-fiber","without fiber"],"phonetic":"/ˈfaɪbɚ friː/","extraExplanation":["“fiber-free”在健康与营养语境里最常见，常见搭配有：fiber-free diet（无纤维饮食）、fiber-free foods（无纤维食物）。它通常是临时性的医学/术前术后饮食要求；日常长期饮食是否需要“无纤维”，应遵医嘱。","在英语里也常看到“fiber-free”与“fiber optic / fiber-optic”（光纤）相关，表示“没有光纤覆盖/不走光纤”。如果你想表达“无麸质”，不要用fiber-free，而要用“gluten-free”。"]}
{"word":"fiber-like","summary":{"en":"Fiber-like describes something that looks or feels like thin fibers or threads.","zh":"fiber-like 表示“像纤维/细丝一样的”，强调外观或质地呈纤维状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling fiber; having the appearance or texture of thin strands or threads.","zh":"像纤维的；呈细丝状的；具有纤维般外观或质地的。"},"examples":[{"en":"Under the microscope, the tissue showed a fiber-like pattern.","zh":"在显微镜下，这种组织呈现出纤维状的结构。"},{"en":"The surface had a rough, fiber-like texture, similar to paper pulp.","zh":"表面有粗糙的纤维状质感，类似纸浆。"},{"en":"Some plants have fiber-like roots that spread out widely.","zh":"有些植物有纤维状的根系，向四周广泛扩展。"}]}],"synonyms":["fibrous","threadlike","stringy","filamentous"],"phonetic":"/ˈfaɪbɚˌlaɪk/","extraExplanation":["“fiber-like”是由名词“fiber（纤维）+ like（像……的）”构成的复合形容词，常用连字符（-）连接，尤其放在名词前作定语时更常见：a fiber-like material。放在系动词后作表语时有时也可写作“fiberlike”，但带连字符更清晰、也更常见。","注意区分：“fiber-like”（像纤维的/细丝状的）描述外观或结构；而“fibrous”（纤维质的）更常用于描述含有大量纤维、嚼起来粗的口感（如fibrous vegetables）或组织的性质。"]}
{"word":"fiber-optic","summary":{"en":"Using optical fiber to transmit data as light, especially for fast communications.","zh":"用光纤以光信号传输数据的（多指高速通信）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using thin strands of glass or plastic (optical fiber) to carry information as light signals, especially for fast telecommunications and internet.","zh":"（通过）光纤的；使用细玻璃/塑料纤维把信息以光信号传输（尤指高速通信与互联网）的。"},"examples":[{"en":"Fiber-optic cables carry internet data very quickly over long distances.","zh":"光纤电缆可以在长距离内非常快速地传输互联网数据。"},{"en":"The hospital upgraded to a fiber-optic network for more reliable connections.","zh":"医院升级为光纤网络，以获得更可靠的连接。"}]},{"partOfSpeech":"n.","definition":{"en":"A communication system or equipment that uses optical fiber.","zh":"光纤通信系统；光纤设备。"},"examples":[{"en":"The building installed fiber-optic to improve its phone and internet service.","zh":"这栋楼安装了光纤系统来改善电话和网络服务。"},{"en":"Fiber-optic is common in modern data centers.","zh":"光纤在现代数据中心很常见。"}]}],"synonyms":["optical-fiber","fiber optics","optical-fiber communications","optical networking"],"phonetic":"/ˌfaɪbɚ ˈɑːptɪk/","extraExplanation":["常见搭配：fiber-optic cable（光纤电缆）、fiber-optic network（光纤网络）、fiber-optic connection（光纤连接）。","写法与用法：作定语时常写作带连字符的 fiber-optic（如 fiber-optic cable）；作名词时也可写作 fiber optics（更常见，指“光纤技术”这一领域）。","在美式英语里，fiber 是英式 fibre 的拼写变体。"],"etymology":"由 fiber（“纤维”）+ optic（“光学的/与光相关的”）组合而成；因用“光”在“纤维”中传输信号而得名。","mnemonic":["把它拆开记：fiber=“纤维”，optic=“光”。→“用光在纤维里跑”的通信。","联想“光速上网”：光（optic）+ 线（fiber）= 更快的网络。"]}
{"word":"fiber-optics","summary":{"en":"Fiber-optics is technology that uses optical fibers to send data as light, enabling fast, long-distance communication.","zh":"Fiber-optics 指用光纤以光信号传输数据的技术，可实现高速、远距离通信。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a technology that transmits information as pulses of light through thin strands of glass or plastic (optical fibers), often used for very fast internet and communications","zh":"光纤通信技术：通过细如发丝的玻璃或塑料光纤以光脉冲传输信息，常用于高速互联网与通信"},"examples":[{"en":"Many homes now get internet through fiber-optics instead of copper cables.","zh":"现在很多家庭通过光纤而不是铜缆来接入互联网。"},{"en":"Fiber-optics can carry large amounts of data over long distances with low signal loss.","zh":"光纤可以在长距离内以较低的信号损耗传输大量数据。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to communication systems that use optical fiber","zh":"与光纤通信系统有关的；使用光纤的"},"examples":[{"en":"The company upgraded to fiber-optics equipment for faster connections.","zh":"公司升级为光纤设备以获得更快的连接。"},{"en":"Fiber-optics networks are common in modern data centers.","zh":"现代数据中心里很常见光纤网络。"}]}],"synonyms":["fiber optics","optical fiber communication","fiber-optic technology"],"phonetic":"/ˈfaɪbɚ ˈɑp.tɪks/","extraExplanation":["“fiber-optics”在日常英语里常写作“fiber optics”（更常见，不加连字符）；英式英语多用拼写“fibre optics”。","它的核心优势常被概括为：带宽大、抗电磁干扰、长距离损耗低；但铺设与接入设备成本可能更高。","相关常见搭配：fiber-optic cable（光纤电缆）、fiber-to-the-home/FTTH（光纤到户）、broadband（宽带）、latency（延迟）。"]}
{"word":"fiber-reinforced","summary":{"en":"“Fiber-reinforced” describes a material made stronger by adding reinforcing fibers.","zh":"“fiber-reinforced”指通过加入增强纤维而变得更坚固的材料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a material) strengthened by adding fibers (such as glass, carbon, or steel) to improve its strength, stiffness, or durability.","zh":"（材料）通过加入纤维（如玻璃纤维、碳纤维或钢纤维）来增强，从而提高强度、刚度或耐久性。"},"examples":[{"en":"Fiber-reinforced concrete is often used in floors to reduce cracking.","zh":"纤维增强混凝土常用于地坪，以减少开裂。"},{"en":"They chose a fiber-reinforced plastic panel because it is light but strong.","zh":"他们选择了纤维增强塑料板，因为它轻但结实。"},{"en":"The helmet shell is made from fiber-reinforced composite material.","zh":"头盔外壳由纤维增强复合材料制成。"}]}],"synonyms":["reinforced","fiber-strengthened","composite (in many contexts)"],"phonetic":"/ˈfaɪbɚ rɪnˈfɔrst/","extraExplanation":["“fiber-reinforced”常见于工程与材料领域，常搭配名词使用：fiber-reinforced concrete（纤维增强混凝土）、fiber-reinforced plastic/FRP（纤维增强塑料/纤维增强聚合物）、fiber-reinforced composite（纤维增强复合材料）。","核心思路是“纤维承担拉力、基体材料（如树脂或混凝土）把纤维固定并传递载荷”，因此比单一材料更不易断裂、开裂。","写法上多作复合形容词并加连字符：fiber-reinforced；在名词前作定语最常见。"]}
{"word":"fiber-rich","summary":{"en":"Fiber-rich means “high in dietary fiber,” often describing foods like fruits, vegetables, beans, and whole grains.","zh":"fiber-rich 指“富含（膳食）纤维的”，常用来形容水果、蔬菜、豆类和全谷物等食物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing a lot of dietary fiber (the part of plant foods that helps digestion and can help you feel full).","zh":"（食物）富含膳食纤维的（植物性食物中有助消化、增加饱腹感的成分）。"},"examples":[{"en":"Oats and beans are fiber-rich foods that can keep you full longer.","zh":"燕麦和豆类是富含纤维的食物，能让你更久有饱腹感。"},{"en":"Try adding fiber-rich vegetables like broccoli to your dinner.","zh":"晚餐可以加一些富含纤维的蔬菜，比如西兰花。"},{"en":"A fiber-rich breakfast helps many people avoid snacking mid-morning.","zh":"富含纤维的早餐能帮助很多人避免在上午加餐。"}]}],"synonyms":["high-fiber","fiber-filled","rich in fiber"],"phonetic":"/ˈfaɪbɚ rɪtʃ/","extraExplanation":["“Fiber-rich”是由名词“fiber（纤维）+ rich（富含的）”构成的复合形容词，常用于营养与健康语境。它多用于修饰食物（fiber-rich foods/meal/diet）。","常见搭配：a fiber-rich diet（高纤饮食）、fiber-rich fruits/vegetables/grains（高纤水果/蔬菜/谷物）。","写作提示：作定语时通常加连字符（fiber-rich bread）；作表语时也可见不加连字符的写法（The bread is fiber rich），但连字符更常见、更规范。"]}
{"word":"fiber-split","summary":{"en":"Fiber-split refers to fibers splitting apart, often as a defect; it can also be used as an adjective describing such material.","zh":"fiber-split 指纤维裂开/分裂（常见于缺陷描述），也可作形容词修饰出现纤维分裂的材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a split or separation in a fiber (or bundle of fibers), often treated as a defect in materials like textiles, paper, rope, or composites","zh":"纤维（或纤维束）的裂开/分裂，常被视为纺织品、纸张、绳索或复合材料中的一种缺陷"},"examples":[{"en":"The inspector found a fiber-split along the edge of the fabric.","zh":"检验员在布料边缘发现了一处纤维裂开。"},{"en":"Repeated bending can cause a fiber-split in the cable’s reinforcement threads.","zh":"反复弯折会导致电缆加固纤维丝出现分裂。"}]},{"partOfSpeech":"adj.","definition":{"en":"(attributive) describing something made by splitting fibers, or showing fibers that have split","zh":"（作定语）指“通过分裂纤维制成的”或“出现纤维分裂现象的”"},"examples":[{"en":"They rejected the fiber-split yarn because it looked fuzzy and uneven.","zh":"他们拒收了这种纤维分裂的纱线，因为看起来毛糙且不均匀。"},{"en":"The report mentions fiber-split damage near the seam.","zh":"报告提到接缝附近存在纤维分裂损伤。"}]}],"synonyms":["split fibers","fiber splitting","fiber separation","frayed fibers"],"phonetic":"/ˈfaɪbɚ splɪt/","extraExplanation":["“fiber-split”不是最常见的固定词条，更常见的表达有：textile defect 语境里的“split fibers / fiber splitting（纤维分裂）”，光通信语境里通常说“fiber splitter（光纤分路器）”而不是“fiber-split”。","在纺织/材料检测中，“fiber splitting”常与磨损、反复弯折、拉伸或化学老化有关，外观上可能表现为起毛、边缘散开、强度下降。"]}
{"word":"fiber-tip pen","summary":{"en":"A pen with a fiber (felt-like) tip for smooth writing or coloring.","zh":"笔尖为纤维（类似毛毡）的笔，用于顺滑书写或上色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pen with a porous, felt-like tip made of fibers, used for smooth writing or coloring (similar to a felt-tip pen).","zh":"一种笔尖由纤维材料制成、略像毛毡的笔，用于顺滑书写或上色（类似“毡尖笔/马克笔”）。"},"examples":[{"en":"She labeled the folders with a fiber-tip pen so the words looked bold and clear.","zh":"她用纤维尖笔给文件夹贴标签，所以字看起来又粗又清楚。"},{"en":"Use a fiber-tip pen to color the poster without scratching the paper.","zh":"用纤维尖笔给海报上色，不容易刮伤纸面。"}]}],"synonyms":["felt-tip pen","marker","fine-tip marker","felt pen"],"phonetic":"/ˈfaɪbɚ tɪp pɛn/","extraExplanation":["在美式英语里，更常见的说法是 felt-tip pen 或 marker（取决于粗细和用途）。一般较细、用于书写的常叫 felt-tip pen；更粗、用于上色或标记的常叫 marker。","有些语境中 fiber-tip pen 可特指“纤维笔尖的签字笔/绘图笔”，强调笔尖结构而不是墨水类型。"],"etymology":"由“fiber（纤维）+ tip（笔尖）+ pen（笔）”组合而成的复合名词，强调笔尖由纤维材料构成；在日常英语里常与 felt-tip pen（毡尖笔）接近或互换使用。","mnemonic":["拆开记：fiber=纤维；tip=尖；pen=笔 → “纤维做的笔尖的笔”。","联想：像“毛毡/纤维头”的笔尖，写起来更“滑”，不会像圆珠笔那样“硬刮”。"]}
{"word":"fiberboard","summary":{"en":"Fiberboard is a sheet material made from pressed wood fibers, commonly used in furniture and construction.","zh":"fiberboard指由压制木纤维制成的板材，常用于家具与建筑装修。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A building material made by pressing wood fibers (and sometimes resin) into flat sheets; used for furniture, cabinets, walls, and packaging.","zh":"纤维板（用木纤维等压制成的板材，有时含树脂）；用于家具、橱柜、墙面和包装等。"},"examples":[{"en":"The back panel of the bookcase is made of fiberboard.","zh":"书柜的背板是用纤维板做的。"},{"en":"We used fiberboard to create a smooth surface before painting.","zh":"我们用纤维板在刷漆前做出平整的表面。"},{"en":"This desk looks like solid wood, but it’s actually fiberboard with a veneer.","zh":"这张桌子看起来像实木，但其实是贴皮的纤维板。"}]}],"synonyms":["MDF","hardboard","engineered wood","composite board"],"phonetic":"/ˈfaɪbərˌbɔrd/","extraExplanation":["“fiberboard”常见的相关分类包括：\n- MDF（Medium-Density Fiberboard，中密度纤维板）：表面较平整，适合喷漆和贴皮。\n- HDF（High-Density Fiberboard，高密度纤维板）：更硬更密，常用于地板基层等。\n- hardboard（硬质纤维板）：通常更薄，常见于家具背板、抽屉底板。\n在日常英语里，有时人们会把一些工程板材笼统叫“fiberboard”，但在购买或装修时最好问清具体是哪一种（MDF / HDF / hardboard）。","使用提示：fiberboard一般不如实木耐潮。若用于厨房、浴室或地下室等潮湿环境，通常需要选择“moisture-resistant (MR) fiberboard”（防潮纤维板）或做好封边/涂装来防水。","词源小提示：fiberboard是“fiber（纤维）+ board（板材）”的合成词，直观表示“由纤维制成的板”。"]}
{"word":"fiberboards","summary":{"en":"Fiberboards are engineered wood boards made from compressed wood fibers, commonly used in furniture and interior construction.","zh":"Fiberboards 指由压制木纤维制成的人造板材，常用于家具与室内装修。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boards made from compressed wood fibers (often with resin), used as an engineered wood material for furniture, cabinets, interior panels, and construction.","zh":"由木纤维（常与树脂）压制而成的板材，属于人造板，常用于家具、橱柜、室内墙板与建筑等。"},"examples":[{"en":"The cabinet backs are made of fiberboards to keep costs down.","zh":"这些橱柜的背板用的是纤维板，以降低成本。"},{"en":"Fiberboards paint smoothly, but they can swell if they get wet.","zh":"纤维板上漆很平整，但遇水可能会膨胀。"}]}],"synonyms":["fiberboard","MDF","hardboard","engineered wood"],"phonetic":"/ˈfaɪbɚˌbɔrdz/","extraExplanation":["“fiberboards”是“fiberboard”的复数。常见类型包括：MDF（中密度纤维板）与HDF（高密度纤维板）。它们表面细腻、易加工，但耐水性通常不如胶合板（plywood）或实木（solid wood），潮湿环境需选防潮/防水等级或做好封边。"]}
{"word":"fibered","summary":{"en":"“Fibered” means having fibers or being made of/containing fibers, often in technical descriptions.","zh":"“fibered”指“有纤维的；由纤维构成或含纤维的”，常用于较正式或技术性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having fibers; made of or containing fibers (often used in descriptions of materials, tissues, or surfaces).","zh":"有纤维的；由纤维构成或含有纤维的（常用于描述材料、组织或表面）。"},"examples":[{"en":"The lab report described the sample as a fibered material under the microscope.","zh":"实验报告描述该样本在显微镜下呈现为有纤维的材料。"},{"en":"Fibered tissues help connect and support different parts of the body.","zh":"纤维组织有助于连接并支撑身体的不同部位。"},{"en":"The paper felt rough and slightly fibered.","zh":"这张纸摸起来粗糙，带一点纤维感。"}]}],"synonyms":["fibrous","threadlike","stringy"],"phonetic":"/ˈfaɪbɚd/","extraExplanation":["“fibered”多见于较正式或技术性的语境（如生物学、医学、材料科学），表示“呈纤维状/含纤维”。日常英语中更常说“fibrous（纤维状的）”或“made of fibers（由纤维制成）”。","英式拼写常见为“fibred”，美式拼写更常见“fibered”。在固定搭配里也常看到“fiber-optic（光纤的）”，但“fibered”本身不等同于“高纤维食物”。"]}
{"word":"fiberfill","summary":{"en":"Fiberfill is a soft synthetic stuffing (usually polyester) used to fill pillows, toys, and cushions.","zh":"Fiberfill 指一种柔软的合成纤维填充物（多为聚酯），用于填充枕头、玩具和靠垫等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft synthetic stuffing material (usually polyester) used to fill pillows, toys, quilts, and cushions, making them fluffy and lightweight.","zh":"一种柔软的合成填充物（通常是聚酯纤维），用于填充枕头、玩具、被子、靠垫等，使其蓬松、轻便。"},"examples":[{"en":"I used fiberfill to stuff the handmade teddy bear.","zh":"我用纤维填充棉把手工泰迪熊塞得鼓鼓的。"},{"en":"This pillow is filled with fiberfill instead of down.","zh":"这个枕头用的是纤维填充棉，而不是羽绒。"},{"en":"Add a little more fiberfill so the cushion feels firm.","zh":"再加一点纤维填充棉，让靠垫更有支撑感。"}]}],"synonyms":["polyester stuffing","polyfill","synthetic filling","pillow stuffing"],"phonetic":"/ˈfaɪbərˌfɪl/","extraExplanation":["“Fiberfill”常见于手工缝纫/拼布圈、家居用品说明和商品标签。它通常是聚酯短纤维做成的“填充棉”，优点是便宜、轻、易清洗、不易过敏；缺点是质感和保暖性一般不如羽绒。","它也常被写作“fiber fill”（两个词）或作为商标/品牌名出现；在英式英语中有时会看到拼写“fibre”。"]}
{"word":"fiberglas","summary":{"en":"Fiberglas is a less common spelling of fiberglass, a strong, lightweight material made of glass fibers used in insulation and manufacturing.","zh":"Fiberglas 是 fiberglass 的较少见拼写（常见误拼/变体），指由玻璃纤维制成、用于保温和制造的轻而坚固材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common misspelling/variant of fiberglass: a light, strong material made from very fine glass fibers, often used for insulation or to make durable products (boats, panels, helmets).","zh":"fiberglass 的常见拼写变体/误拼：由极细玻璃纤维制成的轻而坚固的材料，常用于隔热保温或制造耐用制品（如船体、板材、头盔等）。"},"examples":[{"en":"The attic is filled with fiberglass insulation.","zh":"阁楼里铺满了玻璃纤维保温材料。"},{"en":"They repaired the boat with a fiberglass patch.","zh":"他们用玻璃纤维补片修好了船。"}]}],"synonyms":["fiberglass","glass fiber","glass fibre"],"phonetic":"/ˈfaɪbərˌɡlæs/","extraExplanation":["“Fiberglas”有时会被当作“Fiberglas®”一类的商标式拼法（少一个 s），但在现代英语中最常见、最标准的拼写是“fiberglass”。写作时建议用“fiberglass”，除非你是在引用品牌名或原文拼法。"]}
{"word":"fiberglass","summary":{"en":"Fiberglass is a strong, lightweight material made from fine glass fibers, widely used in insulation and molded products.","zh":"Fiberglass 指由细玻璃纤维构成的坚固轻质材料，常用于保温材料和各种成型制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A material made of very fine glass threads (fibers), often used with resin to make strong, lightweight products.","zh":"玻璃纤维；由极细的玻璃丝构成的材料，常与树脂结合制成坚固且轻质的制品。"},"examples":[{"en":"The boat’s hull is made of fiberglass, so it’s light but strong.","zh":"这艘船的船体是玻璃纤维做的，所以很轻但很结实。"},{"en":"Workers wore gloves and masks when handling fiberglass insulation.","zh":"工人处理玻璃纤维保温材料时戴了手套和口罩。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made from or covered with fiberglass.","zh":"由玻璃纤维制成的；覆盖玻璃纤维的。"},"examples":[{"en":"They installed a fiberglass shower stall in the new bathroom.","zh":"他们在新浴室安装了一个玻璃纤维整体淋浴房。"},{"en":"A fiberglass ladder won’t conduct electricity as easily as a metal one.","zh":"玻璃纤维梯子不像金属梯子那样容易导电。"}]}],"synonyms":["glass fiber","glass wool (for insulation)","GRP (glass-reinforced plastic)"],"phonetic":"/ˈfaɪbərˌɡlæs/","extraExplanation":["“Fiberglass”在美式英语里非常常见，常用于建筑（fiberglass insulation 玻璃纤维保温棉）、交通工具（boat/auto parts）、运动器材等领域。","学习时可注意：它通常是不可数名词（some fiberglass），但在谈“不同类型/不同批次”时也可能见到复数用法（fiberglasses），不过较少见。","安全提示：玻璃纤维碎屑可能刺激皮肤和呼吸道，因此英文里常见搭配有 wear gloves/mask、skin irritation（皮肤刺激）。"]}
{"word":"fiberglass manufacturer","summary":{"en":"a company that makes fiberglass materials or products","zh":"生产玻璃纤维材料或制品的企业/厂家"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a company or business that produces fiberglass (glass fiber) materials or products","zh":"生产玻璃纤维（玻纤）材料或制品的公司/厂家"},"examples":[{"en":"We contacted a fiberglass manufacturer to customize the panels for the boat.","zh":"我们联系了一家玻璃纤维厂家，为这艘船定制面板。"},{"en":"The plant is one of the largest fiberglass manufacturers in the region.","zh":"这家工厂是该地区最大的玻璃纤维制造商之一。"},{"en":"A local fiberglass manufacturer supplies parts for wind turbines.","zh":"一家本地玻璃纤维制造商为风力发电机提供零部件。"}]}],"synonyms":["fiberglass producer","glass-fiber manufacturer","FRP manufacturer","composites manufacturer","fiberglass supplier"],"phonetic":"/ˈfaɪbərˌɡlæs ˌmænjuˈfæktʃərər/","extraExplanation":["fiberglass 常指由细玻璃纤维制成的材料，特点是轻、强、耐腐蚀，常用于船体、汽车部件、建筑保温材料、风电叶片等。","在商业语境中也常见更具体的说法，如 fiberglass manufacturer of insulation（保温玻纤制造商）或 fiberglass parts manufacturer（玻纤零件制造商）。"],"etymology":"由“fiberglass（玻璃纤维，字面为 fiber + glass）”与“manufacturer（制造商，制造/生产者）”组合而成，用于指代从事玻璃纤维材料或制品生产的企业。","mnemonic":["把它拆开记：fiber（纤维）+ glass（玻璃）= fiberglass（玻璃纤维）；manufacturer = “制造商”。合起来就是“玻璃纤维制造商/厂家”。","联想“玻璃（glass）拉成很细的纤维（fiber）”，能做成船、风电叶片等——生产这些材料的公司就是 manufacturer。"]}
{"word":"fiberglasses","summary":{"en":"Fiberglass is a lightweight, strong material made from glass fibers; it’s commonly used for insulation and durable products.","zh":"Fiberglass（玻璃纤维）是一种由玻璃纤维构成的轻便坚固材料，常用于保温隔热和耐用制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually written as “fiberglass”) A strong, lightweight material made of very thin glass fibers, often used in insulation, boats, car parts, and sports equipment.","zh":"（通常写作“fiberglass”）玻璃纤维材料：由极细的玻璃纤维组成，坚固且轻便，常用于保温隔热、船只、汽车部件和运动器材等。"},"examples":[{"en":"The workers installed fiberglass insulation in the attic.","zh":"工人们在阁楼里安装了玻璃纤维保温层。"},{"en":"Many small boats are made from fiberglass because it doesn’t rust.","zh":"许多小船用玻璃纤维制造，因为它不会生锈。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of fiberglass (describing something’s material).","zh":"玻璃纤维制的（形容某物的材质）。"},"examples":[{"en":"She bought a fiberglass ladder that’s easy to carry.","zh":"她买了一把轻便好携带的玻璃纤维梯子。"},{"en":"The helmet has a fiberglass shell for strength.","zh":"这顶头盔有一个坚固的玻璃纤维外壳。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover or reinforce something with fiberglass.","zh":"用玻璃纤维覆盖或加固。"},"examples":[{"en":"They fiberglassed the damaged section of the boat.","zh":"他们用玻璃纤维加固了船体受损的部分。"}]}],"synonyms":["glass fiber","glass fibre (BrE)","fiberglass insulation"],"phonetic":"/ˈfaɪbərˌɡlæs/","extraExplanation":["“fiberglasses”在英语里不常见，通常是把“fiberglass（玻璃纤维）”误写成了复数形式。日常使用时一般写“fiberglass”即可：\n- 不可数名词：fiberglass insulation（玻璃纤维保温材料）\n- 形容词：a fiberglass boat（玻璃纤维船）","注意安全：玻璃纤维碎屑可能刺激皮肤和呼吸道；施工或切割时常建议戴手套、口罩并清洁粉尘。"]}
{"word":"fiberization","summary":{"en":"Fiberization means the process of making a material into fibers or a fibrous form, mainly in industrial/material contexts.","zh":"fiberization 指把材料加工成纤维或纤维状的过程，主要用于工业与材料领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of turning a material into fibers or a fibrous form (used especially in manufacturing, textiles, paper, plastics, and composite materials)","zh":"纤维化；使材料变成纤维或呈纤维状的过程（多用于制造业、纺织、造纸、塑料与复合材料等领域）"},"examples":[{"en":"The new machine improves fiberization of recycled plastic, making it easier to spin into thread.","zh":"这台新机器提高了回收塑料的纤维化效率，使其更容易纺成丝线。"},{"en":"Fiberization is a key step in producing high-strength paper from wood pulp.","zh":"纤维化是用木浆生产高强度纸张的关键步骤。"}]}],"synonyms":["fibrillation","fiber formation","defibration","pulverization into fibers"],"phonetic":"/ˌfaɪbərəˈzeɪʃən/","extraExplanation":["“fiberization”更常见于工程与材料语境（如木浆处理、非织造布、复合材料、回收塑料再加工）。在普通日常英语里不算高频词，日常表达更可能说“turn something into fibers / make it fibrous”。","不要与医学里的“fibrosis（纤维化/纤维组织增生）”混淆：fibrosis指组织病理变化；fiberization通常指材料加工中形成纤维的工艺过程。"]}
{"word":"fiberize","summary":{"en":"Fiberize means to make something into fibers or to become fibrous, usually in an industrial or processing context.","zh":"Fiberize 指“使……纤维化/加工成纤维”或“变成纤维状”，多用于工业或加工语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to convert something into fibers or a fibrous form (often by mechanical or chemical processing)","zh":"使……纤维化；把……加工成纤维或纤维状（常指机械或化学处理）"},"examples":[{"en":"The company fiberizes recycled plastic to make durable textile yarn.","zh":"这家公司把回收塑料纤维化，制成耐用的纺织纱线。"},{"en":"Wood pulp is fiberized before it is formed into paper sheets.","zh":"木浆在制成纸张之前会先被纤维化处理。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become fibrous; to break down into fibers","zh":"变成纤维状；分解成纤维"},"examples":[{"en":"Under strong mixing, the plant material quickly fiberized.","zh":"在强力搅拌下，植物材料很快就变成纤维状了。"}]}],"synonyms":["defiber","shred","pulverize","process into fibers","render fibrous"],"phonetic":"/ˈfaɪbəˌraɪz/","extraExplanation":["“fiberize”在日常口语中不算常见，更常出现在材料科学、造纸、纺织、回收加工、食品加工（把原料打成更细的纤维结构）等领域。","拼写上美式英语常用 fiberize（fiber），英式英语更可能写作 fibreize（fibre）。"]}
{"word":"fiberized","summary":{"en":"“Fiberized” means processed or converted into a fibrous form.","zh":"“fiberized”指“被加工成纤维状/纤维化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made into fibers, or processed so a material breaks down into fine fibers (often for easier mixing, absorption, or texture).","zh":"纤维化的；被加工成纤维状的（常指为了更易混合、吸收或获得特定质地而把材料处理成细纤维）。"},"examples":[{"en":"The manufacturer uses fiberized cellulose to thicken the sauce.","zh":"厂家使用纤维化的纤维素来增稠酱料。"},{"en":"Fiberized wood pulp is used in some eco-friendly packaging.","zh":"一些环保包装会使用纤维化的木浆。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “fiberize”: to convert something into fibers or a fibrous form.","zh":"“fiberize”的过去式/过去分词：使（材料）纤维化；把……加工成纤维状。"},"examples":[{"en":"The plant material was fiberized before it was added to the composite.","zh":"植物材料在加入复合材料之前先被纤维化处理。"},{"en":"The paper has been fiberized to improve strength and bonding.","zh":"纸张经过纤维化处理以提高强度和黏合性。"}]}],"synonyms":["fibrous","shredded","pulverized (into fibers)","defibrated","fiber-forming"],"phonetic":"/ˈfaɪbəˌraɪzd/","extraExplanation":["“fiberized”常见于工业、食品与材料科学语境（如纤维素、木浆、纺织与复合材料）。在日常口语里不算常用，更多出现在产品说明、工艺描述或学术/技术文本中。","美式拼写是 fiber（英式常见 fibre）。因此美式常写 fiberized，英式文本里可能见到 fibreized。"]}
{"word":"fiberizer","summary":{"en":"A “fiberizer” is usually a machine that turns materials into fibers, used in industrial processing.","zh":"“fiberizer”通常指把材料制成纤维的机器，多用于工业加工语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or tool that turns a material into fibers (or separates it into fiber-like strands), especially in manufacturing or processing","zh":"纤维化机；制纤机：把材料制成纤维（或分离成纤维状条丝）的机器或工具，常用于工业加工"},"examples":[{"en":"The mill installed a new fiberizer to break wood chips into pulp fibers.","zh":"工厂安装了一台新的纤维化机，把木片分解成纸浆纤维。"},{"en":"After fiberizing the plant material, they mixed the fibers into biodegradable packaging.","zh":"把植物材料纤维化之后，他们将纤维混入可降解包装材料中。"}]},{"partOfSpeech":"n.","definition":{"en":"a product name for a device or attachment that helps increase dietary fiber in blended food by breaking ingredients into very fine strands or particles (less common)","zh":"（较少见）某些产品对搅拌食物的装置/配件的称呼：通过将食材打得更细来增加“纤维感”或纤维摄入"},"examples":[{"en":"The manual says to use the fiberizer for vegetables to make a thicker smoothie.","zh":"说明书说用该“fiberizer”处理蔬菜，可以做出口感更浓稠的奶昔。"}]}],"synonyms":["defiberizer","shredder (context-dependent)","pulper (paper-making context)","fiberizing machine"],"phonetic":"/ˈfaɪbəˌraɪzər/","extraExplanation":["“fiberizer”由 fiber（纤维）+ -ize（使……化/使成为）+ -er（做某事的物/人）构成，字面意思就是“使……变成纤维的东西”。在纸浆、纺织、复合材料、食品加工等语境中更常见，很多时候是行业术语或产品名称，不一定是日常通用词。","相关动词是 fiberize（使纤维化/制成纤维）。写作时如果想更通用，也可以用 make into fibers / shred into fibers / defiber 来表达。"]}
{"word":"fiberizes","summary":{"en":"Fiberizes means “turns something into fibers” or “makes it fibrous.”","zh":"Fiberizes 指“把某物变成纤维/使其纤维化（呈纤维状）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of fiberize) to break something into fibers, or to make it become fibrous (stringy, like threads).","zh":"（fiberize 的第三人称单数）使某物分解成纤维；使其变成纤维状（像细丝一样）。"},"examples":[{"en":"The machine fiberizes the wood into pulp for paper.","zh":"这台机器把木材纤维化，制成造纸用的纸浆。"},{"en":"High-speed spinning fiberizes the plastic into thin threads.","zh":"高速旋转把塑料纤维化成细丝。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to add or increase fiber content (especially in food processing).","zh":"（较少见）增加（食物等的）纤维含量；使更富含纤维。"},"examples":[{"en":"The producer fiberizes the cereal by adding oat bran.","zh":"生产商通过加入燕麦麸来提高麦片的膳食纤维含量。"}]}],"synonyms":["defibrates","shreds","pulverizes","breaks down","makes fibrous"],"phonetic":"ˈfaɪbɚˌraɪz","extraExplanation":["“fiberizes”常见于工业与材料/食品加工语境；日常口语更常用“turns into fibers / makes it fibrous（使纤维化）”。","英式拼写常见为“fibreize / fibreises”，美式拼写为“fiberize / fiberizes”。"]}
{"word":"fiberizing","summary":{"en":"“Fiberizing” means the process of turning a material into fibers, or making it fibrous, usually in manufacturing.","zh":"“Fiberizing”指把材料制成纤维或使其纤维化的过程，常用于制造业/材料领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of turning a material into fibers (thin, thread-like strands) or making it more fibrous","zh":"将材料制成纤维（细长丝状物）的过程；使材料变得更纤维状"},"examples":[{"en":"The company is fiberizing recycled plastic to make textile yarn.","zh":"这家公司正在把回收塑料纤维化，用来做纺织纱线。"},{"en":"During production, the molten material is fiberizing as it is stretched and cooled.","zh":"在生产过程中，熔融材料在被拉伸并冷却时正在纤维化。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “fiberize”) to turn something into fibers or make it fibrous, often for manufacturing","zh":"（“fiberize”的现在分词）把某物纤维化/制成纤维；常用于制造业语境"},"examples":[{"en":"They are fiberizing wood pulp to improve the insulation material.","zh":"他们正在把木浆纤维化，以改进保温材料。"},{"en":"The machine works by fiberizing the input and then blending it evenly.","zh":"这台机器通过先把原料纤维化，再进行均匀混合来工作。"}]}],"synonyms":["making into fibers","defibering","shredding (context-dependent)","pulverizing (context-dependent)"],"phonetic":"/ˈfaɪbəˌraɪzɪŋ/","extraExplanation":["“fiberizing”多见于工业/材料领域（如玻璃纤维、矿棉、纸浆、塑料回收等），强调“把原料拉成纤维状以便后续加工”。在英式拼写中常写作“fibreizing / fibreise”。日常口语里更常用“make into fibers / make fibrous”来表达。"]}
{"word":"fiberless","summary":{"en":"“Fiberless” means having no (or almost no) fiber, especially in food; it can also describe materials that contain no visible fibers.","zh":"“fiberless”指无（或几乎无）纤维的，常用于食物（无膳食纤维）；也可形容材料表面或结构不含可见纤维。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no fiber, or almost no fiber; lacking dietary fiber (often used about food).","zh":"无（或几乎无）纤维的；缺乏膳食纤维的（常用于描述食物）。"},"examples":[{"en":"During the test prep, the doctor asked me to eat a fiberless diet for a day.","zh":"在检查准备期间，医生让我一天吃无纤维饮食。"},{"en":"White rice is more fiberless than brown rice.","zh":"白米比糙米更接近无纤维。"},{"en":"Some processed snacks are basically fiberless and don’t keep you full for long.","zh":"一些加工零食几乎没有纤维，饱腹感维持不久。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not containing visible fibers or filaments (used in materials/textiles contexts).","zh":"不含（或看不出）纤维/丝状结构的（用于材料、纺织等语境）。"},"examples":[{"en":"The coating dried into a smooth, fiberless film.","zh":"涂层干燥后形成了一层光滑、无纤维的薄膜。"},{"en":"They preferred a fiberless paper surface for high-quality printing.","zh":"他们更喜欢用于高质量印刷的无纤维纸面。"}]}],"synonyms":["low-fiber","fiber-free","lacking fiber"],"phonetic":"/ˈfaɪbərləs/","extraExplanation":["“fiberless”在日常英语里不算特别常见，更常见的说法是“low-fiber（低纤维）”或“fiber-free（无纤维）”。","在医学或检查准备（例如结肠镜检查前）中，医生可能会建议短时间的“low-fiber/low-residue diet（低纤维/低渣饮食）”，有时也会口语化说成“fiberless diet”。不同人群的饮食需求不同，遵医嘱最重要。"]}
{"word":"fiberoptic","summary":{"en":"Fiber‑optic means using optical fibers to transmit data as light; it can also refer to a fiber‑optic cable/connection.","zh":"fiber‑optic 指“使用光纤以光信号传输数据”，也可指“光纤电缆/光纤连接”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a system or device) using thin strands of glass or plastic to carry data as light signals, especially for high‑speed internet and telecommunications.","zh":"（系统或设备）使用细玻璃或塑料纤维以光信号传输数据，尤指高速互联网与电信通信。"},"examples":[{"en":"Our building upgraded to a fiber‑optic internet connection.","zh":"我们大楼升级为光纤网络连接。"},{"en":"Fiber‑optic cables can transmit data over long distances with low signal loss.","zh":"光纤电缆可以在长距离传输数据，同时信号衰减较低。"}]},{"partOfSpeech":"n.","definition":{"en":"a fiber‑optic cable or connection.","zh":"光纤电缆；光纤线路（连接）。"},"examples":[{"en":"The technician ran new fiber‑optic to the house.","zh":"技术人员把新的光纤线路接到了房子里。"},{"en":"We don’t have fiber‑optic in this neighborhood yet.","zh":"我们这个社区目前还没有光纤。"}]}],"synonyms":["optical-fiber","fiber-optics"],"phonetic":"/ˌfaɪbər ˈɑptɪk/","extraExplanation":["“fiber‑optic”常作形容词，修饰 cable / network / connection 等；作名词时多为口语省略说法，完整表达常见为 “fiber‑optic cable/connection”。","美式拼写是 fiber‑optic；英式常见 fibre‑optic。写作中常用连字符 fiber‑optic，尤其在名词前作定语时。"]}
{"word":"fiberous","summary":{"en":"Fibrous means made of or full of fibers—thread-like strands—often describing materials or foods that are stringy or high in fiber.","zh":"Fibrous 指“纤维状/纤维丰富的”，常用于形容材料或食物呈丝状、有筋或富含膳食纤维。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a material or food) made of fibers; containing many thread-like strands; tough or stringy.","zh":"（材料或食物）由纤维构成的；含有许多丝状纤维的；坚韧或有筋的（口感偏“柴/有嚼劲”）。"},"examples":[{"en":"This towel is made of fibrous cotton, so it absorbs water well.","zh":"这条毛巾是纤维状的棉质材料做的，所以很吸水。"},{"en":"The meat was a bit fibrous, so it was hard to chew.","zh":"这肉有点纤维多（偏柴、有筋），所以不太好嚼。"},{"en":"Leafy vegetables are fibrous and help support digestion.","zh":"绿叶蔬菜纤维丰富，有助于消化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to plant or animal fibers used in textiles or other products.","zh":"与（纺织等用途的）植物纤维或动物纤维有关的。"},"examples":[{"en":"Workers sort fibrous materials before they are turned into fabric.","zh":"工人会先把纤维材料分类，再加工成布料。"}]}],"synonyms":["stringy","fibery","threadlike","tough","high-fiber"],"phonetic":"/ˈfaɪbrəs/","extraExplanation":["“fiberous”是常见拼写错误，标准拼写是“fibrous”。","“fibrous”在饮食语境里常带有口感评价：可能是“纤维多、健康”，也可能暗示“偏柴、难嚼”，要结合上下文判断。"]}
{"word":"fibers","summary":{"en":"Fibers are strands in materials (like cotton), dietary nutrient that aids digestion, and can also mean moral strength.","zh":"fibers 可指材料中的纤维、帮助消化的膳食纤维，也可引申为品格与坚韧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Long, thin strands that make up or come from plants, animals, or materials (used to make cloth, rope, paper, etc.).","zh":"（植物、动物或材料中的）纤维；细长丝状物（可用于制作布料、绳子、纸等）。"},"examples":[{"en":"Cotton fibers are spun into thread to make fabric.","zh":"棉纤维被纺成线来做布料。"},{"en":"The carpet is made from synthetic fibers.","zh":"这张地毯是由合成纤维制成的。"}]},{"partOfSpeech":"n.","definition":{"en":"A nutrient in plant foods that helps digestion and supports gut health.","zh":"（营养）膳食纤维：存在于植物性食物中，有助于消化并支持肠道健康。"},"examples":[{"en":"Oats and beans are high in fiber.","zh":"燕麦和豆类富含膳食纤维。"},{"en":"Try to eat more fruits and vegetables for added fiber.","zh":"为了增加膳食纤维，尽量多吃水果和蔬菜。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong moral character or determination (often in the phrase “the fiber of”).","zh":"（引申）品格；道德力量；意志力（常见于短语“the fiber of…”）。"},"examples":[{"en":"Honesty is part of the fiber of the community.","zh":"诚实是这个社区精神的一部分。"},{"en":"It takes real fiber to keep going after a failure.","zh":"失败后还能坚持下去需要真正的坚韧。"}]}],"synonyms":["threads","strands","filaments","dietary fiber","roughage","fortitude"],"phonetic":"/ˈfaɪbɚz/","extraExplanation":["“fibers”是“fiber”的复数。美式英语常用拼写是 fiber；英式英语常见拼写是 fibre。","在营养语境里常见两类：soluble fiber（可溶性纤维）与 insoluble fiber（不可溶性纤维），前者常与血糖/胆固醇管理相关，后者常与促进排便相关。","“the fiber of”多用于较正式或文学化表达，强调“构成某人/某团体本质的核心品质”。"]}
{"word":"fiberscope","summary":{"en":"A fiberscope is a flexible viewing instrument that uses optical fibers to see inside narrow or hidden spaces.","zh":"fiberscope 指利用光纤传像、可弯曲的观察仪器，用来查看狭窄或隐蔽空间内部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument (usually a flexible tube) that uses bundles of optical fibers to carry light and images, allowing you to look inside hard-to-reach places such as engines, pipes, or parts of the human body.","zh":"一种利用光纤束传输光线与影像的观察仪器（通常为可弯曲的软管），用于查看难以触及的内部空间，如发动机、管道或人体内部。"},"examples":[{"en":"The mechanic used a fiberscope to inspect the inside of the engine without taking it apart.","zh":"修理工用光纤内窥镜检查发动机内部，而不用拆开引擎。"},{"en":"Doctors may use a fiberscope to see inside a patient’s body during certain examinations.","zh":"在某些检查中，医生可能会用光纤内窥镜观察病人体内情况。"}]}],"synonyms":["borescope","endoscope","inspection scope","scope"],"phonetic":"/ˈfaɪbərˌskoʊp/","extraExplanation":["“fiberscope”由 fiber（光纤）+ scope（观察镜/镜检仪）组成，常见于工程检修与医疗内窥检查语境。更通用的说法是 borescope（管道/孔内窥镜）；而 fiberscope 往往强调使用光纤传像、可弯曲、适合转弯的空间。","在现代医疗中也常见 endoscope（内窥镜）这一更广义的词；fiberscope 可以视为早期/特定技术路线的一种内窥镜类型。"]}
{"word":"fiberware","summary":{"en":"Fiberware means disposable products made from plant fibers, often used as eco-friendlier food packaging or tableware.","zh":"Fiberware 指由植物纤维制成的一次性用品，常用作更环保的餐具或食品包装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"products (often plates, bowls, cups, or takeout containers) made from plant fibers, usually intended to be disposable and sometimes compostable","zh":"由植物纤维制成的用品（常见为盘子、碗、杯子或外卖餐盒等），通常为一次性使用，有时可堆肥降解"},"examples":[{"en":"The café switched to fiberware takeout boxes to reduce plastic waste.","zh":"这家咖啡馆改用纤维餐盒来减少塑料垃圾。"},{"en":"These fiberware plates are sturdy enough for hot food.","zh":"这些纤维餐盘结实到可以盛热食。"},{"en":"Check whether the fiberware is compostable in your local facility.","zh":"要确认这种纤维餐具在你当地的处理设施里是否真的能堆肥。"}]}],"synonyms":["plant-fiber tableware","bagasseware","compostable tableware","fiber-based packaging"],"phonetic":"/ˈfaɪbərˌwɛr/","extraExplanation":["“Fiberware”在英文里常见于包装与餐饮行业语境，意思接近“plant-fiber tableware/containers（植物纤维餐具/包装）”。不少产品以甘蔗渣（bagasse）、竹纤维、小麦秸秆等为原料。","注意：标注“compostable（可堆肥）”不一定等于“在家后院就能自然分解”。很多需要工业堆肥条件（industrial composting），不同地区的回收/堆肥体系也不同。","因为它也可能是品牌名或商品系列名，在具体文本中有时会大写（FiberWare）。"]}
{"word":"fibery","summary":{"en":"Fibery means full of fibers—often describing a stringy, tough texture in food or material.","zh":"Fibery 表示“纤维很多的”，常用来形容食物或材料带有丝状、偏韧偏柴的质感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of food or material) containing a lot of fibers; stringy or tough because of fibers.","zh":"（指食物或材料）含有很多纤维的；因纤维多而呈丝状、较韧（常带“嚼起来粗/柴”的感觉）。"},"examples":[{"en":"Celery can taste fibery if it’s old.","zh":"芹菜如果放久了，吃起来可能会很纤维、很柴。"},{"en":"This rope feels fibery and rough in my hands.","zh":"这根绳子摸起来很纤维、很粗糙。"},{"en":"The mango was sweet but a little fibery near the seed.","zh":"芒果很甜，但靠近果核的地方有点纤维感。"}]}],"synonyms":["fibrous","stringy","tough","ropey"],"phonetic":"/ˈfaɪbəri/","extraExplanation":["“fibery”是“fiber（纤维）+ -y（……的）”构成的形容词，口语和日常写作中可用，但更常见、更正式的说法是“fibrous”。","用来形容食物时，“fibery”常暗示口感不够细嫩（stringy/chewy），比如芹菜、菠萝、芒果靠近核的部分等。"]}
{"word":"Fibonacci","summary":{"en":"Fibonacci can mean the medieval Italian mathematician or the famous number sequence where each term equals the sum of the two previous terms.","zh":"Fibonacci既可指中世纪意大利数学家“斐波那契”，也可指著名的“斐波那契数列”，其规则是每一项等于前两项之和。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian mathematician (Leonardo of Pisa, c. 1170–1250) famous for introducing Hindu–Arabic numerals to Europe and for a problem that led to the Fibonacci sequence","zh":"斐波那契：意大利数学家（比萨的列奥纳多，约1170–1250），以把印度—阿拉伯数字体系介绍到欧洲而闻名；他提出的一道问题也引出了“斐波那契数列”"},"examples":[{"en":"Fibonacci helped popularize the Hindu–Arabic number system in Europe.","zh":"斐波那契帮助印度—阿拉伯数字体系在欧洲普及。"},{"en":"In history of math class, we read about Fibonacci’s book Liber Abaci.","zh":"在数学史课上，我们读到了斐波那契的《算盘书》（Liber Abaci）。"}]},{"partOfSpeech":"n.","definition":{"en":"the Fibonacci sequence: a series of numbers where each number is the sum of the two before it (0, 1, 1, 2, 3, 5, 8, …)","zh":"斐波那契数列：一个数列，每个数等于前两个数之和（0, 1, 1, 2, 3, 5, 8, ……）"},"examples":[{"en":"The Fibonacci sequence starts 0, 1, 1, 2, 3, 5, 8.","zh":"斐波那契数列的开头是0、1、1、2、3、5、8。"},{"en":"Some programmers practice recursion by writing a Fibonacci function.","zh":"一些程序员会通过写斐波那契函数来练习递归。"},{"en":"The sunflower’s spirals are often discussed with Fibonacci numbers, though nature isn’t perfectly exact.","zh":"向日葵的螺旋常常会与斐波那契数联系起来讨论，不过自然界并不总是完全精确。"}]}],"synonyms":["Fibonacci sequence","Fibonacci numbers"],"phonetic":"/ˌfɪbəˈnɑːtʃi/","extraExplanation":["“Fibonacci”来自拉丁语，常解释为“Bonacci之子”（filius Bonacci）。斐波那契在《Liber Abaci》（1202）中用通俗问题（如兔子繁殖）展示了数列思想。","关于自然界：人们常把斐波那契数与“黄金比例”以及植物螺旋联系在一起，这更多是一种观察与模型；现实生长会受环境与生物机制影响，并非处处严格符合。"]}
{"word":"fibr","summary":{"en":"fibr- is a medical/scientific word part meaning “fiber” or “fibrous.”","zh":"fibr- 是医学/科学中的构词成分，表示“纤维/纤维状”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “fiber,” used in medical and scientific words (often referring to fibrous tissue or threadlike structures).","zh":"构词成分，表示“纤维/纤维状”，常见于医学与科学词汇中（常指纤维组织或线状结构）。"},"examples":[{"en":"In words like “fibrosis,” fibr- refers to fibrous tissue.","zh":"在“fibrosis（纤维化）”这类词中，fibr- 指纤维组织。"},{"en":"“Fibrin” and “fibril” are related terms built from fibr-.","zh":"“fibrin（纤维蛋白）”和“fibril（原纤维/微原纤维）”都是以 fibr- 构成的相关词。"}]}],"synonyms":["fibro-","fiber-"],"phonetic":"ˈfaɪbɚ","extraExplanation":["“fibr-”不是一个常见的独立单词，更常作为词根/构词成分出现。常见家族词：\n- fiber /ˈfaɪbɚ/（纤维）\n- fibrous（纤维状的）\n- fibrosis（纤维化）\n- fibrin（纤维蛋白）\n- fibrillation（颤动；如心房颤动 atrial fibrillation）\n看到“fibr-”时，通常可以联想到“纤维、纤维化、纤维蛋白”等医学含义。"]}
{"word":"fibra","summary":{"en":"“Fibra” usually means “fiber” (American spelling) or “fibre” (British): a strand-like material, or dietary fiber.","zh":"“fibra”通常相当于英语的“fiber/​fibre”：指纤维材料，也可指膳食纤维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"fiber; a thread-like strand or material (often used in science, medicine, or textiles).","zh":"纤维；丝状的细条或材料（常用于科学、医学或纺织语境）。"},"examples":[{"en":"Plant fibers are used to make paper and clothing.","zh":"植物纤维被用来造纸和制作衣物。"},{"en":"A muscle fiber can contract to produce movement.","zh":"肌纤维可以收缩来产生动作。"}]},{"partOfSpeech":"n.","definition":{"en":"(In nutrition) dietary fiber; the part of plant foods that helps digestion.","zh":"（营养学）膳食纤维；植物食物中有助于消化的成分。"},"examples":[{"en":"Try to eat more fruits and vegetables for extra fiber.","zh":"想增加纤维摄入，可以多吃水果和蔬菜。"},{"en":"This cereal is high in fiber.","zh":"这种麦片富含膳食纤维。"}]}],"synonyms":["fiber","fibre","strand","filament"],"phonetic":"/ˈfiːbrə/","extraExplanation":["“Fibra”不是最常见的英语拼写；在英语里通常写作 **fiber**（美式）或 **fibre**（英式）。","“Fibra”常见于西班牙语、意大利语、葡萄牙语等罗曼语，含义与英语的“fiber/fibre”基本对应。你在英文材料里看到“fibra”，往往是外来词、品牌名、产品型号或拉丁语/多语混用的语境。"]}
{"word":"fibranne","summary":{"en":"“Fibranne” is not a standard English word; it’s likely a misspelling or a proper/specialized term.","zh":"“fibranne”不是标准英语词汇；更可能是拼写错误或专有/专业术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It may be a misspelling or a specialized name (e.g., a brand, surname, or a scientific term in another language).","zh":"这不是常见英语词典里的标准单词，可能是拼写错误或某个专有名词（如品牌名、姓氏、或其他语言/专业领域术语）。"},"examples":[{"en":"I couldn’t find “fibranne” in a standard English dictionary—could you share the sentence you saw it in?","zh":"我在常见英语词典里找不到“fibranne”，你能把看到它的句子发我吗？"},{"en":"Did you mean “fibrin” (a protein involved in blood clotting)?","zh":"你是不是想写“fibrin”（参与血液凝固的蛋白质）？"}]}],"phonetic":"/ˈfaɪbræn/","extraExplanation":["“fibranne”看起来像拼写误差。最接近的常见英文可能是：\n1) fibrin（纤维蛋白）：医学/生物里常见，和凝血有关。\n2) fibrinogen（纤维蛋白原）：fibrin 的前体。\n3) fiber / fibre（纤维）：拼写或输入法导致的变形可能性较低，但也可排查。\n如果你把原句或领域（医学、纺织、品牌名等）发来，我可以更准确判断。"]}
{"word":"fibrate","summary":{"en":"A fibrate is a class of lipid-lowering medicine, especially for high triglycerides.","zh":"fibrate 指贝特类降脂药，尤其用于降低甘油三酯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of medicine used to lower triglycerides (blood fats) and sometimes raise HDL (“good”) cholesterol; used to treat some kinds of high cholesterol","zh":"一类用于降低甘油三酯（血脂）并有时提高高密度脂蛋白（“好”胆固醇）的药物；用于治疗某些类型的高血脂"},"examples":[{"en":"The doctor prescribed a fibrate to help lower his triglyceride levels.","zh":"医生开了一种贝特类药物来帮助降低他的甘油三酯水平。"},{"en":"Fibrates are often considered when triglycerides remain high after lifestyle changes.","zh":"当生活方式调整后甘油三酯仍然偏高时，常会考虑使用贝特类药物。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or belonging to the fibrate class of drugs","zh":"与贝特类药物有关的；属于贝特类药物的"},"examples":[{"en":"She is taking fibrate therapy along with dietary changes.","zh":"她在调整饮食的同时也在接受贝特类药物治疗。"}]}],"synonyms":["lipid-lowering drug","triglyceride-lowering medicine","fenofibrate (a specific fibrate)","gemfibrozil (a specific fibrate)"],"phonetic":"/ˈfaɪbreɪt/","extraExplanation":["“Fibrate”常见于医学与药学语境，常见成员包括fenofibrate（非诺贝特）和gemfibrozil（吉非贝齐）。它们主要用于降低甘油三酯；与他汀类（statins）合用时需由医生评估风险（如肌肉相关不良反应）。"]}
{"word":"fibration","summary":{"en":"A mathematical term for a “fibered” structure: a space mapped onto a base space with a fiber attached over each point.","zh":"数学术语：把空间视为映射到底空间，并在每个点上附着一个纤维的“纤维化”结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In mathematics (especially topology/geometry), a structure that describes a space as being “fibered” over another space, like a family of similar pieces (fibers) attached to each point of a base space.","zh":"（数学，尤指拓扑/几何）一种把一个空间看作“铺在”另一个空间之上的结构：在底空间的每个点上都附着一个相似的部分（称为纤维）。"},"examples":[{"en":"A fibration can help us study a complicated space by separating it into a base space and fibers.","zh":"纤维化可以把复杂空间分成底空间和纤维，帮助我们分析。"},{"en":"In a fiber bundle, the projection map is often described as a fibration.","zh":"在纤维丛中，投影映射常被描述为一种纤维化。"}]}],"synonyms":["fiber bundle (related)","bundle projection (related)"],"phonetic":"/faɪˈbreɪʃən/","extraExplanation":["在英语里，fibration主要是数学术语，日常英语很少用。它和fiber（纤维）同源，直观图像是“每个点都挂着一条/一片纤维”。","常见相关词：fiber（纤维/纤维状结构）、fiber bundle（纤维丛）、base space（底空间）、fiber（纤维）、projection（投影）、(Serre) fibration（塞尔纤维化）、homotopy lifting property（同伦提升性质）。"]}
{"word":"fibratus","summary":{"en":"A rare scientific/Latin-derived adjective meaning “fibrous; made of or showing fibers.”","zh":"较少见的科学/拉丁语形容词，意思是“纤维状的；由纤维构成或呈现纤维结构的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scientific/Latin-derived) fibrous; having fibers or threadlike strands.","zh":"（科学/拉丁语衍生用法）纤维状的；具纤维或丝状结构的。"},"examples":[{"en":"Under the microscope, the tissue looked fibratus and tightly bundled.","zh":"在显微镜下，这种组织看起来呈纤维状，并且束状结构很紧密。"},{"en":"Some older botanical descriptions use fibratus to mean “with visible fibers.”","zh":"一些较早的植物学描述会用 fibratus 表示“带有可见纤维”。"}]}],"synonyms":["fibrous","fibrillar","fibrillated"],"phonetic":"/faɪˈbreɪtəs/","extraExplanation":["“fibratus”更常见于拉丁语或拉丁化的科学描述（例如旧式的植物学、解剖学文献），在现代一般英语中不常单独使用。写作或查词时，通常会改用更常见的英语词：fibrous（纤维状的）、fibrillated（有细小纤维的）。","如果你是在某个物种名称、拉丁诊断（Latin diagnosis）或论文里看到它，它往往是在描述组织/器官/表面“呈纤维结构”。在不同学科里，它可能对应的具体结构略有差异，最好结合上下文（例如是植物茎、肌腱还是某种壳体表面）。"]}
{"word":"Fibre","summary":{"en":"Fibre means dietary fiber, a thin strand/material, or (figuratively) strength of character; it’s the British spelling of “fiber.”","zh":"Fibre 指膳食纤维、纤维/纤维材料，也可比喻“意志力/韧性”；是“fiber”的英式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nutrition) The part of plant foods that your body cannot fully digest; it helps keep digestion regular.","zh":"（营养）膳食纤维：植物性食物中人体不能完全消化的部分，有助于促进肠道蠕动、保持排便规律。"},"examples":[{"en":"This cereal is high in fibre, so it can help prevent constipation.","zh":"这种麦片富含膳食纤维，所以能帮助预防便秘。"},{"en":"Try to eat more vegetables and whole grains to get enough fibre.","zh":"尽量多吃蔬菜和全谷物来摄取足够的纤维。"}]},{"partOfSpeech":"n.","definition":{"en":"A long, thin strand or thread; a natural or artificial material made from strands (like cotton, wool, or glass fibre).","zh":"纤维；纤维丝：细长的丝状物；由丝状物构成的天然或人造材料（如棉、羊毛或玻璃纤维）。"},"examples":[{"en":"The shirt is made from natural fibres like cotton.","zh":"这件衬衫由棉等天然纤维制成。"},{"en":"The boat’s body uses glass fibre to stay strong and light.","zh":"这艘船的船体使用玻璃纤维，既坚固又轻。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Strength of character or determination.","zh":"（比喻）意志力；品格力量；坚韧。"},"examples":[{"en":"She showed real fibre by staying calm under pressure.","zh":"她在压力下依然冷静，展现出真正的韧性。"}]}],"synonyms":["fiber","dietary fiber","roughage","strand","filament","character","resolve"],"phonetic":"/ˈfaɪbɚ/","extraExplanation":["“fibre”是英式拼写；美式拼写通常为“fiber”。在科学/工程语境里也常见“optical fibre（光纤）”“carbon fibre（碳纤维）”等固定搭配。","在饮食语境中，“fibre”常与“soluble/insoluble fibre（可溶/不可溶性纤维）”搭配，用来区分不同类型的膳食纤维。"]}
{"word":"fibre","summary":{"en":"Fibre (UK: fiber) means a thin strand in materials, dietary fibre in food, or fibre used in fibre‑optic communication.","zh":"fibre（英式；美式为fiber）可指材料的纤维、食物中的膳食纤维，或用于光纤通信的光纤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(UK spelling) A thin thread or strand that forms part of a material (like cloth, paper, or muscle).","zh":"（英式拼写）纤维；构成材料（如布料、纸张或肌肉）的一根细丝/细条。"},"examples":[{"en":"This fabric is made from natural fibres like cotton.","zh":"这种布料由棉花等天然纤维制成。"},{"en":"Muscle fibres help your body move.","zh":"肌纤维帮助身体运动。"}]},{"partOfSpeech":"n.","definition":{"en":"The part of plant foods that your body cannot fully digest; it helps digestion and keeps you regular.","zh":"（食物）膳食纤维；人体不能完全消化的植物性成分，有助于消化和排便规律。"},"examples":[{"en":"Oats, beans, and vegetables are high in fibre.","zh":"燕麦、豆类和蔬菜富含膳食纤维。"},{"en":"Try to eat more fibre to support gut health.","zh":"尽量多摄入膳食纤维来支持肠道健康。"}]},{"partOfSpeech":"n.","definition":{"en":"A long, very thin piece of glass or plastic used to send light and data in telecommunications (often in the phrase “fibre-optic”).","zh":"（通信）光纤；用于传输光信号和数据的细长玻璃/塑料丝（常见于“fibre-optic/光纤的”）。"},"examples":[{"en":"The city is expanding fibre internet to more neighborhoods.","zh":"这座城市正在把光纤网络扩展到更多社区。"},{"en":"Fibre-optic cables can carry data very quickly.","zh":"光纤电缆可以非常快速地传输数据。"}]}],"synonyms":["fiber","strand","filament","dietary fiber","roughage"],"phonetic":"/ˈfaɪbɚ/","extraExplanation":["“fibre”是英式拼写，美式常写作“fiber”。在营养标签里，美式更常见“dietary fiber”。","常见搭配：natural fibre（天然纤维）、fibre content（纤维含量）、fibre-optic（光纤的）、fibre internet（光纤网络）。","在文学或比喻用法中，fibre也可指人的“品格/气质的基本构成”（the moral fibre of a person，人的道德底子），属于较正式表达。"]}
{"word":"fibre diet","summary":{"en":"an eating plan high in dietary fiber","zh":"以膳食纤维摄入为主、含量较高的饮食方式"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a diet that includes plenty of dietary fiber, usually from foods like whole grains, beans, fruits, and vegetables, to support digestion and overall health","zh":"高纤维饮食；指摄入较多膳食纤维（常来自全谷物、豆类、水果和蔬菜等）的饮食方式，用于促进消化与健康"},"examples":[{"en":"After weeks of constipation, my doctor recommended a fibre diet with more vegetables and whole grains.","zh":"便秘了好几周后，医生建议我采用高纤维饮食，多吃蔬菜和全谷物。"},{"en":"A fibre diet can help you feel full longer, which may support healthy weight control.","zh":"高纤维饮食能让人更有饱腹感，可能有助于健康的体重管理。"},{"en":"She switched to a fibre diet by adding oats, lentils, and berries to breakfast.","zh":"她通过在早餐加入燕麦、扁豆和浆果来改为高纤维饮食。"}]}],"synonyms":["high-fiber diet","fiber-rich diet","roughage-rich diet"],"phonetic":"/ˈfaɪbɚ ˈdaɪət/","extraExplanation":["英式拼写为 fibre diet，美式更常见 fiber diet，意思相同。","这里的“fibre/fiber”通常指“膳食纤维（dietary fiber）”，包括可溶性纤维和不可溶性纤维；常见来源有全谷物、豆类、蔬果、坚果和种子。"],"etymology":"“fibre/fiber”源自拉丁语 fibra（纤维），经法语进入英语；英式常拼作 fibre，美式常拼作 fiber。“diet”源自希腊语 diaita（生活方式、饮食习惯），后来专指饮食。","mnemonic":["把 fibre 联想成“纤维（纤=细丝）”，吃“纤维多”的饮食=高纤维饮食。","diet 可联想“diet=对饮食的安排/计划”，合起来就是“以纤维为重点的饮食计划”。"]}
{"word":"fibre-digesting organ","summary":{"en":"an organ specialized for breaking down dietary fiber, often via microbial fermentation","zh":"专门分解膳食纤维的器官，常通过微生物发酵完成"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an organ (especially in plant-eating animals) where dietary fiber is broken down, usually with the help of microbes","zh":"（尤指食草动物体内）分解膳食纤维的器官，通常借助肠道微生物完成"},"examples":[{"en":"In cows, the rumen is a major fibre-digesting organ.","zh":"在牛体内，瘤胃是主要的纤维消化器官。"},{"en":"Rabbits rely on a large cecum as a fibre-digesting organ.","zh":"兔子依靠发达的盲肠作为纤维消化器官。"},{"en":"Humans have limited fibre digestion compared with animals that have specialized fibre-digesting organs.","zh":"与拥有专门纤维消化器官的动物相比，人类对纤维的消化能力有限。"}]}],"synonyms":["rumen","cecum","hindgut","large intestine"],"phonetic":"/ˈfaɪbɚ daɪˈdʒɛstɪŋ ˈɔrɡən/","extraExplanation":["许多动物本身的消化酶很难直接分解纤维素（植物细胞壁的重要成分），因此会在特定消化腔室里“发酵”，由微生物把纤维转化为可吸收的短链脂肪酸等能量来源。","不同动物的“纤维消化器官”不一样：反刍动物（牛、羊）主要是瘤胃（rumen）；马等后肠发酵动物常在盲肠/结肠（cecum/colon）发酵。"],"etymology":"复合短语：fibre（英式拼写，=美式 fiber）+ digesting（“消化的/用于消化的”）+ organ（器官）。常用于动物学、生理学语境，用来概括“负责纤维分解”的部位。","mnemonic":["记成“三段式”：fibre（纤维）+ digesting（消化）+ organ（器官）=“消化纤维的器官”。","联想“草→纤维多→需要专门的胃/肠来发酵”，就容易想到反刍动物的 rumen（瘤胃）或 cecum（盲肠）。"]}
{"word":"fibreboard","summary":{"en":"A pressed wood-fiber panel used as a building/furniture material.","zh":"由木纤维压制成的板材，常用于家具与建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A manufactured wood panel made from wood fibers pressed together (often with resin). It is used for furniture, cabinets, doors, and construction panels.","zh":"纤维板：由木纤维加压压制（常含树脂胶）制成的人造板材，用于家具、橱柜、门和建筑板材等。"},"examples":[{"en":"The back of the bookcase is made of fibreboard to keep the cost down.","zh":"书柜背板用的是纤维板，这样能降低成本。"},{"en":"They replaced the damaged fibreboard panel in the cabinet.","zh":"他们把橱柜里损坏的纤维板面板换掉了。"},{"en":"Fibreboard is easy to cut, but it doesn’t handle water well.","zh":"纤维板容易切割，但不太耐水。"}]}],"synonyms":["fiberboard","MDF (medium-density fiberboard)","hardboard"],"phonetic":"/ˈfaɪbɚˌbɔrd/","extraExplanation":["“fibreboard”是英式拼写；美式更常写作“fiberboard”。常见类型包括MDF（中密度纤维板）和hardboard（硬质纤维板），用途和密度不同。","与“particle board（刨花板）”不同：纤维板用更细的木纤维压制，表面通常更平整，适合贴皮、喷漆；但受潮容易膨胀、变形，因此做厨卫等潮湿区域要特别注意防水封边。"]}
{"word":"fibred","summary":{"en":"“Fibred” means “containing or made of fibers,” and is the British spelling of “fibered.”","zh":"“fibred”意为“含纤维的/由纤维构成的”，是美式“fibered”的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(British spelling) Made with fibers; containing fibers (often describing food, tissue, or materials).","zh":"（英式拼写）含纤维的；由纤维构成的（常用于食物、人体组织或材料）。"},"examples":[{"en":"Choose high-fibred foods like oats and beans to help digestion.","zh":"选择燕麦、豆类等高纤维食物有助于消化。"},{"en":"The lab described the sample as fibred tissue under the microscope.","zh":"实验室在显微镜下将该样本描述为纤维状组织。"}]}],"synonyms":["fibered","fibrous","high-fiber","high-fibre"],"phonetic":"/ˈfaɪbərd/","extraExplanation":["“fibred”更常见于英式英语；美式英语里通常写作“fibered”。","在食品语境中，“high-fibred”=“high-fiber/ high-fibre”，意思是“高纤维的”。","在材料或生物学语境中，“fibred / fibered”可表示“呈纤维状结构的”，不一定强调“膳食纤维”。"]}
{"word":"fibrefill","summary":{"en":"Fibrefill is synthetic stuffing (usually polyester) used for pillows, cushions, toys, and quilts; it can also mean filling something with that material.","zh":"Fibrefill 指用于枕头、靠垫、玩具、被子等的合成纤维填充物（多为聚酯）；也可作动词表示用这种材料进行填充。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft synthetic stuffing fiber (often polyester) used to fill pillows, cushions, plush toys, quilts, and similar items.","zh":"一种柔软的合成填充纤维（常为聚酯纤维），用于填充枕头、靠垫、毛绒玩具、被子等。"},"examples":[{"en":"The pillow is filled with fibrefill, so it feels light and fluffy.","zh":"这只枕头用纤维填充物填充，所以摸起来轻盈又蓬松。"},{"en":"She used fibrefill to stuff the handmade teddy bear.","zh":"她用纤维填充物把手工泰迪熊塞得鼓鼓的。"}]},{"partOfSpeech":"vt.","definition":{"en":"To stuff or fill something with synthetic filling fiber.","zh":"用纤维填充物把某物塞满；填充。"},"examples":[{"en":"We fibrefilled the cushion cover until it was firm.","zh":"我们把靠垫套用纤维填充物塞到变得挺实为止。"},{"en":"He fibrefilled the toy and sewed it shut.","zh":"他把玩具填充好后把开口缝上。"}]}],"synonyms":["fiberfill","polyester filling","stuffing","wadding","polyfill"],"phonetic":"/ˈfaɪbɚˌfɪl/","extraExplanation":["“Fibrefill”多见于产品标签、手工缝纫与家居用品语境，属于偏商业/材料名称的用法；有时也会写作“fiberfill”（美式更常见拼写）或作为品牌名出现。购买或写作时可留意大小写与是否为商标。","常见优点：轻、保暖、易清洗、不过敏（相对羽绒）；常见缺点：使用久了可能结块或塌陷。与“down（羽绒）”“memory foam（记忆海绵）”是不同材质。"]}
{"word":"fibreglass","summary":{"en":"Fibreglass is a strong, lightweight material made from fine glass fibers, often used for insulation and durable products.","zh":"Fibreglass（玻璃纤维）是由细玻璃纤维制成的坚固轻质材料，常用于保温和耐用制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lightweight material made of very fine glass fibers, often used to make strong products such as boats, car parts, insulation, and sports equipment.","zh":"玻璃纤维（材料）：由极细的玻璃纤维制成的轻质材料，常用于制作坚固的产品，如船体、汽车部件、保温隔热材料和运动器材。"},"examples":[{"en":"The boat’s hull is made of fibreglass, so it’s strong but not too heavy.","zh":"这艘船的船体是玻璃纤维做的，所以很结实但不会太重。"},{"en":"Many homes use fibreglass insulation to keep rooms warm in winter.","zh":"很多房屋使用玻璃纤维保温棉来在冬天保持室内温暖。"},{"en":"Wear gloves when handling fibreglass, because it can irritate your skin.","zh":"处理玻璃纤维时要戴手套，因为它可能刺激皮肤。"}]}],"synonyms":["fiberglass","glass fiber","FRP"],"phonetic":"/ˈfaɪbərˌɡlæs/","extraExplanation":["“fibreglass”是英式拼写；美式英语更常写作“fiberglass”。两者意思相同。","玻璃纤维相关的常见搭配：fibreglass insulation（玻璃纤维保温材料）、fibreglass boat/hull（玻璃纤维船/船体）、fibreglass reinforced plastic / FRP（玻璃纤维增强塑料）。"]}
{"word":"fibreless","summary":{"en":"Fibreless means having no (or very little) fiber, especially in food or materials.","zh":"Fibreless 指“无（或几乎无）纤维的”，常用于食物或材料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no fiber (or very little fiber); lacking fibrous material.","zh":"无纤维的；（几乎）不含纤维的；缺乏纤维质的。"},"examples":[{"en":"White bread is more fibreless than whole-grain bread.","zh":"白面包比全麦面包更接近“无纤维”。"},{"en":"A fibreless diet can cause constipation for many people.","zh":"对许多人来说，无纤维饮食可能会导致便秘。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not containing textile or plant fibers; not fibrous in structure.","zh":"不含纺织/植物纤维的；结构上不呈纤维状的。"},"examples":[{"en":"Some synthetic padding is designed to be soft and fibreless.","zh":"有些合成填充物被设计得柔软且不含纤维。"},{"en":"The material looks smooth and almost fibreless under a microscope.","zh":"在显微镜下，这种材料看起来很光滑，几乎没有纤维结构。"}]}],"synonyms":["fiberless","low-fiber","non-fibrous","refined (food context)"],"phonetic":"/ˈfaɪbərləs/","extraExplanation":["“fibreless”是英式拼写，美式更常写作“fiberless”。意思相同，只是拼写不同。","在营养语境里，常见搭配有“a fibreless diet（无/低膳食纤维饮食）”“fibreless foods（无/低纤维食物）”。"]}
{"word":"fibres","summary":{"en":"“Fibres” means the plural of fiber: thin strands in materials, or (in food) dietary fiber that aids digestion.","zh":"“fibres”是“fiber”的复数：指材料中的纤维细丝，也可指食物中的膳食纤维（帮助消化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “fiber” (also spelled “fibre” in British English): a thin thread-like strand, especially one that makes up plant tissue, cloth, rope, or other materials.","zh":"“fiber”的复数（英式拼法常写作 fibre）：纤维；细丝状的条状物，常指植物组织、布料、绳索等材料的组成部分。"},"examples":[{"en":"Cotton fibres are soft and absorb water easily.","zh":"棉纤维很柔软，而且很容易吸水。"},{"en":"The rope is made from strong synthetic fibres.","zh":"这根绳子是由坚固的合成纤维制成的。"}]},{"partOfSpeech":"n.","definition":{"en":"Dietary fiber in food (often written “fiber/fibre”): the part of plant foods that helps digestion.","zh":"（食物中的）膳食纤维：植物性食物中帮助消化的成分。"},"examples":[{"en":"Vegetables and whole grains are high in fibre.","zh":"蔬菜和全谷物的膳食纤维含量很高。"},{"en":"Try to eat more fibre to support healthy digestion.","zh":"尽量多摄入一些膳食纤维，有助于维持健康消化。"}]}],"synonyms":["fibers","threads","strands","filaments","roughage"],"phonetic":"/ˈfaɪbɚz/","extraExplanation":["“fibres”是复数形式；美式英语更常用拼写“fibers”，英式英语更常见“fibres”。","在“膳食纤维”这个意思里，fibre/fiber通常是不可数名词（eat more fibre），但也可以用复数强调“不同种类/来源的纤维”（different fibres in the diet）。"]}
{"word":"fibrescope","summary":{"en":"A fibrescope is a flexible fiber-optic viewing instrument used in medicine or inspections to see inside hard-to-reach places.","zh":"fibrescope 指一种利用柔性光纤进行观察的器械，用于医疗检查或工业检修以查看难以到达的内部空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical or technical instrument with flexible fiber-optic cables used to look inside the body or inside machines/structures, usually by sending light in and carrying an image back to the viewer.","zh":"一种利用柔性光纤束来照明并传回影像、用于观察人体内部或设备/结构内部的器械（多用于医疗或工业检测）。"},"examples":[{"en":"The doctor used a fibrescope to examine the patient’s stomach.","zh":"医生用纤维内镜检查了病人的胃。"},{"en":"Engineers inserted a fibrescope into the turbine to check for damage.","zh":"工程师把纤维镜伸入涡轮机内部检查是否受损。"}]}],"synonyms":["endoscope","fiberoptic scope","borescope"],"phonetic":"/ˈfaɪbərˌskoʊp/","extraExplanation":["英式拼写为 fibrescope；美式更常见拼写是 fiberoscope 或 fiberscope。","词源可拆解理解：fiber/fibre（光纤）+ scope（观察仪器，如 microscope 显微镜、telescope 望远镜）。","在医疗语境中常与 endoscope（内镜）相关：fibrescope 强调“使用光纤的柔性内镜”，现代更常见的是 video endoscope（视频内镜）。"]}
{"word":"fibreware","summary":{"en":"Fibreware is plant-fiber-based disposable food packaging/tableware, often promoted as compostable.","zh":"Fibreware指用植物纤维制成的一次性食品包装或餐具，常被宣传为可堆肥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Disposable food packaging or tableware made from plant fibers (such as sugarcane bagasse, bamboo, or wheat straw), often marketed as compostable or eco-friendly.","zh":"由植物纤维（如甘蔗渣、竹纤维或麦秸等）制成的一次性餐盒、餐具等包装用品，常被宣传为可堆肥或更环保。"},"examples":[{"en":"The café switched to fibreware containers to reduce plastic waste.","zh":"这家咖啡馆改用fibreware餐盒来减少塑料垃圾。"},{"en":"These fibreware plates are sturdy enough for hot food.","zh":"这些fibreware盘子够结实，可以装热食。"}]}],"synonyms":["fiberware","bagasseware","compostable fiber containers","plant-fiber tableware"],"phonetic":"/ˈfaɪbərˌwɛr/","extraExplanation":["“fibreware”常见于英式拼写环境（如英国、澳大利亚、新西兰）；在美式英语中更常写作“fiberware”。两者含义通常相同。","虽然很多fibreware产品被称为“compostable（可堆肥）”，但是否能在家庭堆肥中分解、是否需要工业堆肥条件，取决于材料与当地处理设施；选购时可留意是否有认证标识（如BPI、OK compost等）以及使用/处理说明。"]}
{"word":"fibriform","summary":{"en":"“Fibriform” means fiber-shaped or threadlike, often used in biology and medicine.","zh":"“fibriform”表示“纤维状/丝状的”，常用于生物学和医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/biology) Shaped like fibers; threadlike or made up of fiberlike strands.","zh":"（解剖/生物）纤维状的；像细丝一样的；由纤维样条索构成的。"},"examples":[{"en":"Under the microscope, the tissue shows a fibriform pattern.","zh":"在显微镜下，这种组织呈现纤维状的形态。"},{"en":"Some fungi form fibriform structures as they grow.","zh":"有些真菌在生长时会形成纤维状结构。"}]}],"synonyms":["fibrous","filamentous","threadlike"],"phonetic":"/ˈfaɪbrəˌfɔrm/","extraExplanation":["“fibriform”来自拉丁语词根：fibra（纤维）+ -form（形状），字面意思就是“呈纤维形状的”。","容易和“cribriform（筛状的）”混淆：cribriform 指“像筛子一样有许多小孔”的结构；fibriform 则强调“像纤维/丝状条索”。"]}
{"word":"fibril","summary":{"en":"A fibril is a tiny thread-like fiber, especially in muscle, connective tissue, or plant structures.","zh":"fibril 指“极细的纤维丝/原纤维”，常见于肌肉、结缔组织或植物结构等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very small, thread-like fiber; a tiny filament found in biological tissues (like muscle or connective tissue).","zh":"（生物组织中的）原纤维；纤维丝，极细的线状纤维。"},"examples":[{"en":"Under the microscope, the scientist could see collagen fibrils in the tissue sample.","zh":"在显微镜下，科学家能看到组织样本中的胶原原纤维。"},{"en":"Muscle cells contain many protein fibrils that help them contract.","zh":"肌肉细胞含有许多蛋白质原纤维，帮助它们收缩。"}]},{"partOfSpeech":"n.","definition":{"en":"In botany, a very slender strand or root-like fiber (often referring to fine plant fibers).","zh":"（植物学）细丝状纤维；（类似细根的）纤维。"},"examples":[{"en":"The seedling developed tiny fibrils that helped it anchor in the soil.","zh":"幼苗长出了细小的纤维丝，帮助它固定在土壤中。"}]}],"synonyms":["filament","tiny fiber","strand"],"phonetic":"/ˈfaɪ.brəl/","extraExplanation":["词源提示：fibril 来自拉丁语 fibra（“纤维”），-il 表示“小”的意思，所以整体带有“很小的纤维/细丝”的感觉。","常见相关词：fiber/fibre（纤维）；fibrillar（原纤维的，形容词）；fibrillate（出现细小纤维状结构/颤动，医学或生物学语境较常见）。"]}
{"word":"fibrilated","summary":{"en":"Fibrilated (more commonly spelled fibrillated) describes irregular twitching—especially an abnormal heart rhythm—or material split into fine fibers.","zh":"fibrilated（更常见拼法 fibrillated）指不规则颤动（尤指心脏异常心律），也可指材料被分裂成极细纤维。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having rapid, irregular muscle contractions—especially used for the heart in an abnormal rhythm (fibrillation).","zh":"（医学）出现快速、无规律的肌肉抽动；尤指心脏发生“颤动”（心律异常）。"},"examples":[{"en":"The monitor showed that the patient’s heart had fibrillated rhythmically for several seconds.","zh":"监护仪显示病人的心脏出现了持续数秒的颤动。"},{"en":"Doctors treated the fibrillated heartbeat immediately to restore a normal rhythm.","zh":"医生立即处理颤动的心跳，以恢复正常心律。"}]},{"partOfSpeech":"adj.","definition":{"en":"Split or formed into very fine fibers (fibrils), especially in paper, textiles, or plant material processing.","zh":"（材料/工艺）被分裂或形成许多极细纤维（纤原/微纤维）；常见于造纸、纺织或植物材料处理。"},"examples":[{"en":"The fibrillated pulp absorbs water more easily.","zh":"纤维化（产生微纤维）的纸浆更容易吸水。"},{"en":"These fibrillated strands create a softer texture in the fabric.","zh":"这些被纤维化的细丝让织物手感更柔软。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of fibrillate: to twitch rapidly and irregularly; or to split into fibrils.","zh":"fibrillate 的过去式/过去分词：指快速不规则抽动；或分裂成微纤维。"},"examples":[{"en":"In the emergency room, the ventricles fibrillated and the team began CPR.","zh":"在急诊室里，心室发生颤动，团队立即开始心肺复苏。"},{"en":"The fibers were mechanically fibrillated to improve bonding.","zh":"这些纤维被机械方式纤维化，以增强黏结性。"}]}],"synonyms":["fibrillated","quivering","twitching","fluttering","irregular","fiber-split","defibrillated (related but opposite in meaning)"],"phonetic":"/ˈfɪbrəˌleɪtɪd/","extraExplanation":["你写的 **fibrilated** 常见于拼写变体或误拼；更标准的拼写通常是 **fibrillated**（多一个 l）。","在医学语境里它多指心脏“颤动”（如 *ventricular fibrillation* 心室颤动），属于紧急情况；日常英语里不常用。","在材料/造纸领域，*fibrillated* 描述纤维被“打散成微纤维”，用来提高吸水性、结合力或触感。"]}
{"word":"fibrilation","summary":{"en":"A medical term for rapid, irregular quivering of muscle fibers, especially an irregular heartbeat.","zh":"医学术语，指肌纤维快速不规则颤动，尤指心脏出现不规则心跳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) A rapid, irregular twitching or quivering of muscle fibers, especially in the heart, causing an abnormal heartbeat (e.g., atrial fibrillation).","zh":"（医学）纤维性颤动；肌纤维快速且不规则的抽动或颤动，尤指心脏的异常颤动（如房颤）。"},"examples":[{"en":"The doctor diagnosed him with atrial fibrillation after an ECG test.","zh":"医生在做完心电图检查后诊断他为房颤。"},{"en":"Fibrillation can reduce the heart’s ability to pump blood effectively.","zh":"纤维性颤动会降低心脏有效泵血的能力。"}]}],"synonyms":["arrhythmia","irregular heartbeat","AFib"],"phonetic":"/ˌfɪbrəˈleɪʃən/","extraExplanation":["你输入的 **fibrilation** 更常见的是拼写错误；标准拼写通常是 **fibrillation**（双写 l，并以 -tion 结尾）。在医学语境里最常见的搭配是 **atrial fibrillation（房颤）** 和 **ventricular fibrillation（室颤）**。","日常英语里人们更常说缩写 **AFib** 来指代 atrial fibrillation（房颤），尤其在美国的医疗交流与健康科普中很常见。"]}
{"word":"fibrilations","summary":{"en":"Fibrillations are rapid, irregular muscle twitches—most commonly referring to an abnormal, chaotic heart rhythm.","zh":"fibrillations 指快速、不规则的肌肉颤动，最常见是指心脏异常紊乱的心律（如心房/心室颤动）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) A rapid, irregular twitching or quivering of muscle fibers, especially an abnormal, chaotic beating of the heart.","zh":"（医学）肌纤维快速、不规则的抽动或颤动；尤指心脏异常、紊乱的颤动（如心房颤动）。"},"examples":[{"en":"The ECG showed atrial fibrillation, so the doctor adjusted his medication.","zh":"心电图显示心房颤动，所以医生调整了他的用药。"},{"en":"Muscle fibrillations can happen after intense exercise or nerve irritation.","zh":"剧烈运动后或神经受刺激时，肌肉可能出现纤颤。"}]}],"synonyms":["fibrillation","quivering","twitching","irregular heartbeat"],"phonetic":"/ˌfɪbrəˈleɪʃənz/","extraExplanation":["你输入的 **fibrilations** 更常见的标准拼写是 **fibrillations**（多一个 l）。在医疗英语中最常见的搭配是 **atrial fibrillation (AFib)**「心房颤动」和 **ventricular fibrillation (VFib)**「心室颤动」（后者通常更危急）。","日常语境里，fibrillation 通常指“心律失常的一种”，而在更广义的生理学语境中也可指“肌纤维的细小颤动”。"]}
{"word":"fibrilla","summary":{"en":"Fibrilla means a tiny fiber-like structure in biological tissue.","zh":"fibrilla 指生物组织中的微细纤维状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small fiber or threadlike structure, especially in biological tissues (often used in anatomy and microscopy).","zh":"（尤指生物组织中的）微细纤维；纤维小丝（常用于解剖学与显微观察）。"},"examples":[{"en":"Under the microscope, the researcher could see tiny collagen fibrillae forming a network.","zh":"在显微镜下，研究人员能看到微小的胶原纤维小丝形成网络。"},{"en":"Damage to the muscle’s fibrillae can reduce strength and flexibility.","zh":"肌肉纤维小丝受损会降低力量和柔韧性。"}]}],"synonyms":["fibril","microfiber","filament"],"phonetic":"/faɪˈbrɪlə/","extraExplanation":["“fibrilla”是拉丁语来源，意思是“细小的纤维”。在现代英文里更常见的是复数形式“fibrillae”（尤其在医学/生物学论文中），或用更通俗的“fiber / fibril”。","不要和“fibril”混淆：两者都指细丝状结构，但“fibril”在英语中更常用、更通用；“fibrilla”更偏学术、偏解剖学传统用语。"]}
{"word":"fibrillae","summary":{"en":"Fibrillae are very small fibers or thread-like strands found in biological tissues; it is the plural of fibrilla.","zh":"fibrillae 指生物组织中的微小纤维丝/丝状结构，是 fibrilla 的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tiny fibers or thread-like strands, especially in biological tissues (such as muscles, nerves, or connective tissue).","zh":"微小的纤维或丝状结构，尤指生物组织中的（如肌肉、神经或结缔组织）。"},"examples":[{"en":"Under the microscope, the muscle cell showed many fine fibrillae.","zh":"在显微镜下，这个肌肉细胞显示出许多细小的纤维。"},{"en":"Damage to collagen fibrillae can weaken the strength of connective tissue.","zh":"胶原纤维丝受损会削弱结缔组织的强度。"}]}],"synonyms":["microfibers","filaments","fine fibers","fibrils"],"phonetic":"/faɪˈbrɪli/","extraExplanation":["“fibrillae”是复数形式；单数是“fibrilla”（纤维丝）。","常见于生物学、解剖学与病理学语境；日常英语更常用“fibers/filaments”。","词源与“fiber（纤维）”同源，来自拉丁语“fibra（纤维）”，-illa 表示“更小/更细”。"]}
{"word":"fibrillar","summary":{"en":"Fibrillar means ‘made of tiny fibers’ or ‘having a fine thread-like structure,’ often used in biology and materials science.","zh":"fibrillar 指“由微小纤维构成的/呈细丝状结构的”，常用于生物学与材料科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of or relating to tiny fibers (fibrils), especially in biological tissues.","zh":"由微小纤维（原纤维）构成的；与纤维状微结构有关的（尤指生物组织）。"},"examples":[{"en":"Under the microscope, the muscle tissue has a fibrillar pattern.","zh":"在显微镜下，这种肌肉组织呈现出纤维状的纹理。"},{"en":"The scientist described the protein as forming fibrillar structures.","zh":"科学家描述这种蛋白质会形成纤维状结构。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a texture that looks or feels like fine threads or strands.","zh":"呈细丝状/线状质地的；像细线一样的（外观或触感）。"},"examples":[{"en":"A fibrillar coating can make the surface feel slightly fuzzy.","zh":"纤维状涂层会让表面摸起来有点毛绒绒的。"},{"en":"The material develops a fibrillar appearance when it is stretched.","zh":"这种材料被拉伸时会出现纤维状外观。"}]}],"synonyms":["fibrous","filamentous","threadlike","stringy"],"phonetic":"/faɪˈbrɪlər/","extraExplanation":["“fibrillar”来自“fibril”（原纤维、细纤维）+ 形容词后缀“-ar”，常见于生物学、医学与材料科学文献中（例如“fibrillar collagen”纤维状胶原）。","日常英语里较少使用，更常出现在学术写作中；如果在普通场景想表达“纤维状的/像线一样的”，也可用“fibrous”（纤维性的、含纤维的）作更通用的替代词，但“fibrillar”更强调“微观层面的细小纤维结构”。"]}
{"word":"fibrillary","summary":{"en":"fibrillary = fiber-like; made of tiny fibers (fibrils), often used in scientific/medical contexts.","zh":"fibrillary 表示“纤维状的；由微纤维构成的”，常用于科学/医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or made up of very small fibers (fibrils). Often used in biology and medicine.","zh":"与（微）纤维有关的；呈纤维状的；由微纤维构成的（常用于生物学与医学语境）。"},"examples":[{"en":"Under the microscope, the tissue showed a fibrillary structure.","zh":"在显微镜下，这种组织呈现出纤维状结构。"},{"en":"The report described fibrillary deposits in the sample.","zh":"报告描述了样本中存在纤维状沉积物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having thread-like strands or a delicate, filament-like texture.","zh":"具有丝状／线状细丝的；质地像细丝一样的（偏描述性用法）。"},"examples":[{"en":"The artist painted a fibrillary pattern that looked like fine threads.","zh":"艺术家画出了像细丝一样的纤维状图案。"}]}],"synonyms":["fibrous","fibrillar","filamentous","threadlike"],"phonetic":"/faɪˈbrɪləri/","extraExplanation":["词源提示：fibrillary 来自拉丁语 fibra（“纤维”），常见于学术写作中，用来强调“非常细小的纤维/纤维束”。","常见搭配（医学/生物）：fibrillary protein（纤维状蛋白）、fibrillary deposits（纤维状沉积）、fibrillary glomerulonephritis（纤维样肾小球肾炎，一种较少见的肾病名）。","易混词对比：fibrillar（也意为“纤维状的”）更常见于生物学文献；fibrillary 往往更强调“由微纤维构成/出现微纤维结构”的特征。"]}
{"word":"fibrillate","summary":{"en":"“Fibrillate” means to have (or cause) rapid, irregular muscle contractions, especially an abnormal heart rhythm.","zh":"“Fibrillate”指（或使）肌肉，尤其是心脏，出现快速而不规则的收缩，即异常纤颤。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of the heart or a muscle) to contract quickly and irregularly; to quiver in an uncoordinated way.","zh":"（心脏或肌肉）发生纤颤；快速且不规则地收缩、颤动（失去协调）。"},"examples":[{"en":"The patient’s heart began to fibrillate, and the monitor showed an irregular rhythm.","zh":"病人的心脏开始纤颤，监护仪显示心律不规则。"},{"en":"Without treatment, the heart can fibrillate and stop pumping blood effectively.","zh":"如果不治疗，心脏可能会发生纤颤，无法有效泵血。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause (the heart or muscle) to fibrillate (used mainly in medical contexts).","zh":"使（心脏或肌肉）发生纤颤（多用于医学语境）。"},"examples":[{"en":"A severe electric shock can fibrillate the heart.","zh":"强烈电击可能使心脏发生纤颤。"}]}],"synonyms":["quiver","flutter","twitch","convulse"],"phonetic":"/ˈfaɪbrəˌleɪt/","extraExplanation":["“Fibrillate”常见于医疗英语，尤其与心脏相关。常见搭配有：atrial fibrillation（房颤）与 ventricular fibrillation（室颤）。其中“室颤”更危急，因为心室无法有效泵血。","词根提示：fibril 指“细小纤维/肌纤维”，-ate 常用于动词，表示“使……/变成……”。理解词根有助于记忆：像许多细小纤维在乱颤。"]}
{"word":"fibrillated","summary":{"en":"“Fibrillated” usually means (1) showing irregular muscle twitching (especially heart fibrillation) or (2) split into many fine fibers; it is also the past form of “fibrillate.”","zh":"“fibrillated”通常指（1）肌肉（尤指心脏）出现不规则颤动，或（2）材料分裂成细小纤维；也可作动词 fibrillate 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of muscle tissue, especially the heart) showing fibrillation—rapid, irregular, uncoordinated twitching or contraction.","zh":"（肌肉组织，尤指心脏）出现“颤动”的；即快速、不规则、不同步的抽搐或收缩。"},"examples":[{"en":"The monitor suggested that the patient’s heart had fibrillated.","zh":"监护仪显示病人的心脏可能出现了颤动。"},{"en":"In the lab report, the cardiac muscle was described as fibrillated after the shock.","zh":"在实验报告中，电击后心肌被描述为发生了颤动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of fibrous material) split into fine fibers or fibrils; frayed into many tiny strands.","zh":"（纤维材料）被分裂成细小纤维的；起毛、分散成许多细丝的。"},"examples":[{"en":"The rope became fibrillated at the ends after repeated rubbing.","zh":"绳子反复摩擦后末端起毛，变得纤维化分散。"},{"en":"Fibrillated polypropylene is used to make some types of durable packaging.","zh":"纤维化分散的聚丙烯用于制作某些耐用包装材料。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “fibrillate”: to twitch rapidly and irregularly; to split into fine fibers.","zh":"“fibrillate”的过去式/过去分词：发生快速不规则抽动；或分裂成细小纤维。"},"examples":[{"en":"After intense stress, the damaged muscle fibers fibrillated intermittently.","zh":"在强烈压力后，受损的肌纤维间歇性地抽动。"},{"en":"The material fibrillated during processing, creating a mesh-like texture.","zh":"该材料在加工过程中纤维化分散，形成网状质感。"}]}],"synonyms":["fibrillating","fluttering","twitching","quivering","frayed","fiber-split"],"phonetic":"/ˈfɪbrəˌleɪtɪd/","extraExplanation":["在医学语境里，fibrillated 多与心脏相关（如 ventricular fibrillation 心室颤动、atrial fibrillation 心房颤动）。它强调“肌肉纤维各自乱跳、不同步”，所以会影响正常泵血。","在材料/纺织语境里，fibrillated 描述“纤维被撕裂成细丝”的状态，常见于塑料纤维（如 polypropylene 聚丙烯）或绳索边缘的起毛。"]}
{"word":"fibrillates","summary":{"en":"“Fibrillates” means (a heart or muscle) beats or twitches rapidly and irregularly; it can also mean to cause that irregular twitching.","zh":"“fibrillates”指（心脏或肌肉）快速不规则地颤动/抽搐；也可指使其发生这种颤动。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of the heart or a muscle) to beat or twitch in a rapid, irregular, uncoordinated way.","zh":"（心脏或肌肉）快速、紊乱、缺乏协调地跳动或抽搐。"},"examples":[{"en":"The doctor said his heart fibrillates sometimes, so he needs monitoring.","zh":"医生说他的心脏有时会发生颤动，所以需要监测。"},{"en":"After the shock, the muscle in her eyelid began to fibrillate.","zh":"受到惊吓后，她的眼皮肌肉开始不由自主地抽动。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause a muscle (or the heart) to go into fibrillation.","zh":"使（肌肉或心脏）发生颤动。"},"examples":[{"en":"Certain electrical impulses can fibrillate the heart.","zh":"某些电刺激可能使心脏发生颤动。"}]}],"synonyms":["flutter","quiver","twitch","throb irregularly"],"phonetic":"/ˈfɪbrəˌleɪts/","extraExplanation":["“fibrillates”是动词“fibrillate”的第三人称单数（he/she/it fibrillates）。在医学语境里最常见的是指“心房/心室颤动（atrial/ventricular fibrillation）”，属于需要专业评估的情况。日常口语里更常说“heart rhythm becomes irregular / has an irregular heartbeat”。"]}
{"word":"fibrillating","summary":{"en":"Fibrillating describes rapid, irregular quivering—especially an abnormal heart rhythm where muscle fibers contract chaotically.","zh":"Fibrillating 指快速而不规则的颤动，尤指心脏肌纤维紊乱收缩造成的异常纤颤心律。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) having rapid, irregular twitching or quivering movements; in the heart, showing an abnormal rhythm where muscle fibers contract in a disorganized way.","zh":"（医学）纤颤的；（尤指心脏）出现异常的、快速而不规则的颤动，因肌纤维收缩紊乱所致。"},"examples":[{"en":"The monitor showed a fibrillating heart rhythm, so the team prepared immediate treatment.","zh":"监护仪显示为纤颤心律，因此团队准备立刻处理。"},{"en":"In severe cases, the ventricles can become fibrillating, which is life-threatening.","zh":"在严重情况下，心室可能发生纤颤，这会危及生命。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of fibrillate: to twitch or quiver rapidly and irregularly (often used of the heart or muscle fibers).","zh":"fibrillate 的现在分词：快速且不规则地抽动/颤动（常用于描述心脏或肌纤维）。"},"examples":[{"en":"The muscle tissue was fibrillating under stimulation.","zh":"该肌肉组织在刺激下出现不规则颤动。"},{"en":"Doctors described the heart as fibrillating rather than beating effectively.","zh":"医生描述心脏是在纤颤，而不是有效搏动。"}]}],"synonyms":["quivering","twitching","fibrillating (medical)","fluttering (heart context)","shaking (general, less precise)"],"phonetic":"/ˈfɪbrəˌleɪtɪŋ/","extraExplanation":["“Fibrillating”最常见于医学语境，尤其指心房/心室纤颤（atrial/ventricular fibrillation）。日常英语里很少用它来形容一般的“发抖”，更常用 trembling/shaking。","词源上与“fibril（小纤维）”相关，强调许多细小纤维各自乱跳，导致整体失去协调。"]}
{"word":"fibrillation","summary":{"en":"Fibrillation is rapid, irregular muscle quivering—especially an abnormal heart rhythm (like atrial fibrillation).","zh":"Fibrillation 指肌纤维快速、不规则的颤动，常指心脏的异常心律（如心房颤动）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rapid, irregular, and uncoordinated twitching or quivering of muscle fibers, especially in the heart, that can interfere with normal function.","zh":"（肌纤维的）快速、不规则、不同步的颤动；尤指心脏的纤颤，可能影响正常泵血功能。"},"examples":[{"en":"Atrial fibrillation can cause an irregular heartbeat and increase the risk of stroke.","zh":"心房颤动会导致心跳不规则，并增加中风风险。"},{"en":"The doctor monitored the patient’s heart rhythm for signs of fibrillation.","zh":"医生监测病人的心律，查看是否有纤颤迹象。"},{"en":"He felt palpitations, but tests showed no fibrillation.","zh":"他感到心悸，但检查显示没有纤颤。"}]}],"synonyms":["quivering","twitching","flutter (heart)","arrhythmia (broader term)"],"phonetic":"/ˌfɪb.rəˈleɪ.ʃən/","extraExplanation":["“fibrillation”常见于医学语境，尤其是心电图（ECG/EKG）报告里。最常提到的是：\n- atrial fibrillation（AFib，心房颤动）：心房电活动混乱，心跳常变得不规则；\n- ventricular fibrillation（V-fib，心室颤动）：更危险，可能导致心脏无法有效泵血，需要紧急处理。\n日常英语中较少用它来形容一般的“发抖”，通常会用 shaking/trembling/quivering。","词源提示：来自“fibril/fiber”（纤维）相关的词根，强调“纤维状肌肉的细小、无序收缩”。在医学写作里，它是一个比较正式、精确的术语。"]}
{"word":"fibrillations","summary":{"en":"“Fibrillations” means episodes or types of rapid, irregular muscle twitching, especially abnormal irregular beating of the heart (fibrillation).","zh":"fibrillations 指（多次或多种）纤颤：肌肉（尤指心脏）快速、无规则、不同步的颤动/抽动，常用于医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rapid, irregular, uncoordinated twitching or quivering of muscles—especially the heart—often used in medical contexts (e.g., atrial/ventricular fibrillation).","zh":"（尤指心脏的）纤颤；指肌肉（多为心肌）快速、无规则、不同步的颤动或抽动，常见于医学语境（如房颤/室颤）。"},"examples":[{"en":"The monitor showed atrial fibrillation, so the doctor adjusted his medication.","zh":"监护仪显示房颤，所以医生调整了他的用药。"},{"en":"Ventricular fibrillation is a medical emergency that can cause cardiac arrest.","zh":"室颤是一种医疗急症，可能导致心搏骤停。"}]}],"synonyms":["fibrillation","irregular heartbeat","arrhythmia"],"phonetic":"/ˌfɪb.rəˈleɪ.ʃənz/","extraExplanation":["在医学里更常用单数 fibrillation 来指“纤颤”这种状态；复数 fibrillations 通常表示“不同类型/多次发生的纤颤事件”，或在学术写作中泛指多处的纤颤。","词源与 fibril（纤维/细纤维）有关，强调的是许多细小肌纤维在“各自乱跳”，导致整体无法有效收缩（尤其是心脏泵血效率下降）。","常见搭配：atrial fibrillation（房颤，常缩写 AFib）、ventricular fibrillation（室颤，常缩写 VFib）、to go into fibrillation（进入纤颤状态）。注意：palpitations（心悸）是症状描述，不等同于 fibrillation（心律失常的一种）。"]}
{"word":"fibrilled","summary":{"en":"Fibrilled means “split into tiny fibers (fibrils),” often describing a frayed or fibrous surface in materials.","zh":"fibrilled 指“分裂成许多细小纤维（原纤维）”，常用于描述材料表面起丝、呈纤丝状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in textiles, paper, or materials science) having split into tiny fibers (fibrils); frayed or filament-like on the surface.","zh":"（尤用于纺织品、纸张或材料科学）分裂成许多细小纤维（原纤维）的；表面起丝、呈纤丝状的。"},"examples":[{"en":"Under the microscope, the rope looked fibrilled at the edges.","zh":"在显微镜下，这根绳子的边缘看起来已经起丝分纤了。"},{"en":"Fibrilled pulp bonds well because the tiny fibers create more contact points.","zh":"起丝分纤的纸浆更容易粘结，因为细小纤维增加了接触点。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of a rare verb meaning “to form fibrils” or “to become split into fibrils.”","zh":"少见动词的过去式/过去分词，意为“形成原纤维”或“分裂成原纤维”。"},"examples":[{"en":"After repeated rubbing, the fabric fibrilled in high-wear areas.","zh":"经过反复摩擦后，布料在高磨损区域出现了起丝分纤。"}]}],"synonyms":["frayed","fibrous","filamented","fibrillated (technical)"],"phonetic":"/ˈfaɪ.brəld/","extraExplanation":["“fibrilled”常见于技术或学术语境（如造纸、纺织、复合材料、生物材料）。它强调材料表面或内部结构“分出很多更细的小纤维”，这可能带来更强的粘结/更大的比表面积，但在衣物上也可能表现为“起毛、起丝、磨损”。","不要和“fibrillated”混淆：医学里常见的“fibrillate/fibrillation”指（心肌等）“发生颤动”。而“fibrilled”通常谈的是纤维结构。"]}
{"word":"fibrilliferous","summary":{"en":"Fibrilliferous means “having or producing fibrils,” used mainly in scientific descriptions of tissues or cells.","zh":"fibrilliferous 指“具有或产生纤维丝（fibrils）的”，主要用于科学/医学语境描述组织或细胞。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Having or producing fibrils (very small fibers or fiber-like strands), especially in tissue or cells.","zh":"（生物/医学）具有或产生纤维丝（fibrils，极细小的纤维状结构）的；纤维丝丰富的。"},"examples":[{"en":"Under the microscope, the damaged muscle looked fibrilliferous, with many tiny strands visible.","zh":"在显微镜下，受损的肌肉呈现出纤维丝丰富的样子，可以看到许多细小的丝状结构。"},{"en":"The report described the sample as fibrilliferous connective tissue.","zh":"报告将该样本描述为纤维丝丰富的结缔组织。"}]}],"synonyms":["fibrillar","fibrous (broader)","fibrillated"],"phonetic":"/ˌfaɪbrɪˈlɪfərəs/","extraExplanation":["这是一个非常学术、偏专业的形容词，常见于组织学（histology）、病理学（pathology）或细胞生物学文献中，日常英语几乎不用。","词形来源：fibrill- 来自 fibril（纤维丝），-ferous 表示“带有/产生……的”（类似 carboniferous=含碳的，coniferous=针叶的）。看到 -ferous 结尾时，通常可以理解为“富含……、携带……”。"]}
{"word":"fibrilliform","summary":{"en":"Fibrilliform means “threadlike or made of tiny fibers,” mainly used in scientific or medical descriptions.","zh":"fibrilliform 指“细纤维/纤丝状的”，主要用于医学或科学领域的形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape or texture of tiny fibers; made up of small, threadlike strands (fibrils).","zh":"呈细纤维状的；由许多细小丝状纤维（纤丝）构成的。"},"examples":[{"en":"Under the microscope, the tissue showed a fibrilliform pattern.","zh":"在显微镜下，这种组织呈现出细纤维状的形态。"},{"en":"The pathologist noted fibrilliform material in the sample.","zh":"病理学家在样本中记录到纤维丝状的物质。"}]}],"synonyms":["fibrous","filamentous","threadlike","fibrillar"],"phonetic":"/fɪˈbrɪləˌfɔrm/","extraExplanation":["这个词多见于医学、病理学、生物学和材料科学等语境，用来描述“像纤维一样”的微观形态（fibril = 微小纤维/纤丝）。","构词上：fibrill- 来自拉丁语 fibra（纤维），-form 表示“形状/形态”。因此 fibrilliform 直观含义就是“纤丝状”。","在日常英语中很少使用，更多出现在学术论文、检验报告或专业描述里。与常见的 fibrous（纤维性的、纤维质的）相比，fibrilliform 更强调“细小纤丝的形态特征”。"]}
{"word":"fibrillose","summary":{"en":"Fibrillose means “covered with or made of fine, thread-like fibers,” used mostly in scientific descriptions.","zh":"fibrillose 指“带有细丝状纤维的/呈微纤维状的”，多用于科学或技术性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having fine, thread-like fibers; fibrous in a delicate or fringed way.","zh":"呈细丝状纤维的；带有细小纤维、略显“毛边/纤维状”的。"},"examples":[{"en":"Under the microscope, the surface looked fibrillose rather than smooth.","zh":"在显微镜下，这个表面看起来是纤维丝状的，而不是光滑的。"},{"en":"The old rope had a fibrillose texture from wear.","zh":"这根旧绳子因磨损而呈现细丝状纤维的质感。"}]}],"synonyms":["fibrous","stringy","frayed","filamentous"],"phonetic":"/ˈfaɪbrəˌloʊs/","extraExplanation":["“fibrillose”是偏学术/技术用词，常见于生物学、植物学、医学或材料学描述（如组织、细胞外基质、纤维、菌丝等的外观）。日常英语里更常用的近似表达有：fibrous（纤维状的）、stringy（拉丝的/有筋的）、frayed（磨损起毛边的）。","词源上与“fibril”（微纤维、细纤维）相关；后缀 -ose 在一些形容词中表示“具有……特征的/充满……的”。"]}
{"word":"fibrillous","summary":{"en":"Fibrillous means ‘fibrous’—made of or containing many tiny fibers, often used in medical or biological descriptions.","zh":"fibrillous 指“纤维状的/含细纤维的”，多用于医学或生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of tissue) made of or containing many small fibers; fibrous in structure.","zh":"（指组织）由许多细小纤维构成的；含有纤维的；纤维状的。"},"examples":[{"en":"Under the microscope, the damaged tissue looked fibrillous and uneven.","zh":"在显微镜下，受损组织看起来呈纤维状且不均匀。"},{"en":"The report describes a fibrillous material surrounding the cells.","zh":"报告描述细胞周围有一种纤维状材料。"}]}],"synonyms":["fibrous","filamentous","stringy"],"phonetic":"/ˈfaɪbrɪləs/","extraExplanation":["这是一个较偏医学/生物学的形容词，来自“fibril（细纤维）”。在日常英语里不常用，更常见的近义表达是 fibrous（纤维的）。","在病理学或组织学语境中，它常用来描述显微镜下呈“丝状/纤维束状”的外观，用于提示组织结构或损伤改变。"]}
{"word":"fibrils","summary":{"en":"Fibrils are very small, threadlike fibers, especially in biological tissues or medical structures like clots.","zh":"fibrils 指非常细小的纤维/纤丝状结构，常见于生物组织或医学结构（如血栓）中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, thin fibers or threadlike structures, especially in living tissues (such as muscles, nerves, or connective tissue).","zh":"（尤指生物组织中的）细小纤维；纤丝状结构（如肌肉、神经或结缔组织中的微细纤维）。"},"examples":[{"en":"Under the microscope, the muscle cells showed clear fibrils arranged in parallel lines.","zh":"在显微镜下，这些肌细胞显示出清晰的纤丝，呈平行排列。"},{"en":"The scientist studied collagen fibrils to understand how skin stays strong and flexible.","zh":"科学家研究胶原纤丝，以了解皮肤如何保持强韧与弹性。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine, tiny strands that can form within blood clots or other deposits (for example, fibrin fibrils).","zh":"（医学）在血栓或其他沉积物中形成的细小丝状结构（如纤维蛋白纤丝）。"},"examples":[{"en":"Fibrin fibrils help create a mesh that stabilizes a blood clot.","zh":"纤维蛋白纤丝会形成网状结构，从而稳定血凝块。"},{"en":"The report noted fibrils within the clot structure.","zh":"报告指出血凝块结构中可见纤丝。"}]}],"synonyms":["tiny fibers","filaments","strands","microfibers"],"phonetic":"/ˈfaɪbrəlz/","extraExplanation":["“fibrils”是复数形式，单数是“fibril”。常见于生物学与医学语境。","词根来自拉丁语“fibra”（纤维）。相关词：fiber/fibre（纤维）、fibrin（纤维蛋白）、fibrous（纤维状的）。"]}
{"word":"fibrin","summary":{"en":"Fibrin is the fibrous protein that forms the mesh of a blood clot.","zh":"纤维蛋白是构成血凝块网状结构的纤维状蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protein fiber that forms a mesh in blood clots, helping stop bleeding and begin wound healing.","zh":"纤维蛋白：形成血凝块网状结构的蛋白质纤维，帮助止血并启动伤口愈合。"},"examples":[{"en":"After the cut, fibrin formed a net that helped stop the bleeding.","zh":"割伤后，纤维蛋白形成一张网，帮助止血。"},{"en":"Doctors can check clotting problems by looking at how fibrin forms.","zh":"医生可以通过观察纤维蛋白如何形成来检查凝血问题。"}]}],"synonyms":["clotting protein","blood-clot fiber"],"phonetic":"/ˈfaɪbrɪn/","extraExplanation":["“fibrin”来自拉丁语词根 *fibra*（纤维），所以它的名字就暗示了“纤维状结构”。","基础理解：血液里先有一种可溶的蛋白叫“fibrinogen（纤维蛋白原）”，受凝血反应影响后会转变成不溶的“fibrin（纤维蛋白）”，像网一样把血细胞“抓住”，形成血块。"]}
{"word":"fibrin-containing","summary":{"en":"“Fibrin-containing” means having fibrin in it, often used in medical contexts (clots, fluids, tissue).","zh":"“fibrin-containing”意为“含有纤维蛋白的”，常用于医学语境（如血栓、体液、组织等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing fibrin (a protein involved in blood clotting).","zh":"含有纤维蛋白的（纤维蛋白是参与血液凝固的蛋白质）。"},"examples":[{"en":"The doctor noted fibrin-containing fluid in the wound.","zh":"医生发现伤口里有含纤维蛋白的液体。"},{"en":"Fibrin-containing clots can form after an injury.","zh":"受伤后可能形成含纤维蛋白的血块。"},{"en":"The lab report described fibrin-containing material in the sample.","zh":"化验报告描述样本中有含纤维蛋白的物质。"}]}],"synonyms":["fibrin-rich","containing fibrin"],"phonetic":"/ˈfaɪbrɪn kənˌteɪnɪŋ/","extraExplanation":["“fibrin-containing”是医学/生物学里常见的复合形容词结构：名词 + “-containing”（意为“含有……的”），用于正式描述检体、渗出液、沉积物或血栓的成分。","纤维蛋白（fibrin）由纤维蛋白原（fibrinogen）在凝血过程中转化而来，会形成网状结构，帮助“固定”血小板与血细胞，从而止血。看到“fibrin-containing”通常提示与凝血、炎症渗出或组织修复相关。"]}
{"word":"fibrin-dissolving","summary":{"en":"Fibrin-dissolving describes something (especially a drug) that breaks down fibrin to help dissolve blood clots.","zh":"fibrin-dissolving 指（尤指药物）能分解纤维蛋白，从而帮助溶解血栓的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to break down fibrin (a protein that helps form blood clots); used to describe medicines or processes that dissolve clots.","zh":"能够分解纤维蛋白（形成血栓的重要蛋白）的；常用于描述溶解血栓的药物或过程。"},"examples":[{"en":"Doctors may use a fibrin-dissolving drug to treat a dangerous blood clot.","zh":"医生可能会使用一种溶解纤维蛋白的药物来治疗危险的血栓。"},{"en":"The treatment is fibrin-dissolving, meaning it helps dissolve the clot-forming material in the blood.","zh":"这种治疗具有溶解纤维蛋白的作用，意思是它能帮助溶解血液中形成血栓的物质。"}]}],"synonyms":["fibrinolytic","thrombolytic","clot-dissolving"],"phonetic":"/ˈfaɪbrɪn dɪˈzɑlvɪŋ/","extraExplanation":["在医学英语里，fibrin-dissolving 常与 thrombolytic（溶栓的）或 fibrinolytic（纤溶的）相关，常见于急性心肌梗死、缺血性脑卒中、肺栓塞等“需要快速开通血管”的语境。","构词法：fibrin（纤维蛋白）+ dissolving（溶解的）。在正式写作中也常见同义表达 fibrin-dissolving activity（纤维蛋白溶解活性）。"]}
{"word":"fibrin-forming","summary":{"en":"“Fibrin-forming” describes something that produces or helps form fibrin, a key material in blood clots.","zh":"“fibrin-forming”指能产生或促进形成纤维蛋白的；纤维蛋白是血凝块形成的关键物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to produce or promote the formation of fibrin (a protein that forms the mesh of a blood clot).","zh":"能产生或促进形成纤维蛋白（构成血凝块网状结构的蛋白质）的。"},"examples":[{"en":"Thrombin is a key fibrin-forming enzyme in normal blood clotting.","zh":"凝血酶是正常凝血过程中关键的纤维蛋白形成酶。"},{"en":"Doctors may avoid fibrin-forming drugs in patients with a high risk of thrombosis.","zh":"对血栓风险较高的患者，医生可能会避免使用促纤维蛋白形成的药物。"}]}],"synonyms":["procoagulant","clot-forming","coagulation-promoting"],"phonetic":"ˈfaɪbrɪn ˌfɔrmɪŋ","extraExplanation":["“fibrin-forming”多见于医学与生理学语境，常用来描述某种酶（如凝血酶）、反应或药物在凝血级联反应中“促使纤维蛋白生成”的作用。","词形上是复合形容词：fibrin（纤维蛋白）+ forming（形成……的）。写作中常作定语放在名词前，如 fibrin-forming process / fibrin-forming activity。"]}
{"word":"fibrin-like","summary":{"en":"“Fibrin-like” means resembling fibrin, often describing clot-like or threadlike material in medical descriptions.","zh":"“fibrin-like”指“类似纤维蛋白的”，常用于医学描述凝块样或丝网状物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling fibrin (a blood-clotting protein), especially in appearance or structure (often describing a mesh-like, threadlike, or clot-like material in medical contexts).","zh":"类似纤维蛋白（参与血液凝固的蛋白质）的；尤指外观或结构上呈现网状、丝状或“凝块样”的（多用于医学语境）。"},"examples":[{"en":"Under the microscope, the tissue showed a fibrin-like network.","zh":"在显微镜下，这些组织呈现出类似纤维蛋白的网状结构。"},{"en":"The pathologist noted fibrin-like deposits on the surface of the organ.","zh":"病理学家注意到器官表面有纤维蛋白样沉积物。"}]}],"synonyms":["fibrinous","fibrinlike"],"phonetic":"/ˈfaɪbrɪn laɪk/","extraExplanation":["“fibrin-like”常见于医学/病理报告，用来做“形态学描述”（看起来像纤维蛋白），并不一定表示该物质化学成分就是纤维蛋白；是否真为纤维蛋白往往需要进一步染色或检测。","相关词：fibrin（纤维蛋白）；fibrinous（含纤维蛋白的/纤维蛋白性的，强调“有纤维蛋白”而不只是“像”）。"]}
{"word":"fibrin-related","summary":{"en":"“Fibrin-related” means connected with fibrin, a key protein in blood clotting.","zh":"“fibrin-related”表示“与纤维蛋白有关的”，多用于血液凝固与医学检验语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to fibrin, a thread-like protein involved in blood clotting (coagulation).","zh":"与纤维蛋白有关的；指参与血液凝固的丝状蛋白（纤维蛋白）相关。"},"examples":[{"en":"The report mentioned elevated fibrin-related markers after surgery.","zh":"报告提到手术后纤维蛋白相关指标升高。"},{"en":"Doctors may order fibrin-related tests to check for abnormal clotting.","zh":"医生可能会开纤维蛋白相关检查，以评估是否存在异常凝血。"}]}],"synonyms":["fibrin-associated","fibrin-linked","coagulation-related"],"phonetic":"/ˈfaɪbrɪn rɪˌleɪtɪd/","extraExplanation":["“fibrin-related”常见于医学语境，尤其是检验项目或诊断描述中，比如：fibrin-related markers（纤维蛋白相关标志物）、fibrin-related products / FDP（纤维蛋白相关降解产物/纤维蛋白降解产物）、fibrin-related clot（与纤维蛋白相关的血栓）。","它是一个复合形容词：fibrin（纤维蛋白）+ related（相关的）。写作中通常用连字符表示它共同修饰后面的名词。"]}
{"word":"fibrin-rich","summary":{"en":"Fibrin-rich means containing a lot of fibrin, especially in medical descriptions of clots or inflammatory material.","zh":"fibrin-rich 指“富含纤维蛋白的”，多用于医学语境描述血栓或炎性渗出物等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing a lot of fibrin (a protein that forms a mesh to help blood clot).","zh":"富含纤维蛋白的（纤维蛋白是一种形成网状结构、帮助血液凝固的蛋白质）。"},"examples":[{"en":"The biopsy showed a fibrin-rich clot in the small vessel.","zh":"活检显示小血管内有一个富含纤维蛋白的血栓。"},{"en":"Doctors described the fluid as fibrin-rich, suggesting active inflammation.","zh":"医生将该液体描述为富含纤维蛋白，提示存在活动性炎症。"}]}],"synonyms":["rich in fibrin","fibrinous (often related, but not always identical)"],"phonetic":"/ˈfaɪbrɪn rɪtʃ/","extraExplanation":["“fibrin-rich”常见于医学/检验语境，用来形容血栓、渗出物（exudate）、炎性沉积物等含有较多纤维蛋白的特征。","构词：fibrin（纤维蛋白）+ rich（富含……的）。在科学写作中常用连字符（hyphen）把它当作一个形容词放在名词前，如 fibrin-rich thrombus（富含纤维蛋白的血栓）。","相关搭配：fibrin-rich clot/thrombus/exudate/deposit；近似表达：rich in fibrin（富含纤维蛋白）。"]}
{"word":"fibrinate","summary":{"en":"Fibrinate means to form fibrin and clot, or (less commonly) to make something clot.","zh":"fibrinate 指形成纤维蛋白并凝固成血块；较少见时也可指使其凝固。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to form fibrin (a protein fiber) and begin clotting; to turn into a fibrous clot","zh":"形成纤维蛋白并开始凝固；变成纤维状的血凝块"},"examples":[{"en":"When blood is exposed to air, it can fibrinate and form a clot.","zh":"当血液暴露在空气中时，可能会发生纤维蛋白形成并凝固成血块。"},{"en":"The surgeon checked that the bleeding had stopped and the tissue was starting to fibrinate.","zh":"外科医生确认出血已停止，并且组织开始出现凝固（纤维蛋白形成）的迹象。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to cause something (especially blood) to form fibrin; to make it clot","zh":"（较少见）使（尤其是血液）形成纤维蛋白；使其凝固"},"examples":[{"en":"Certain enzymes can fibrinate blood in laboratory conditions.","zh":"在实验室条件下，某些酶可以使血液发生纤维蛋白形成并凝固。"}]}],"synonyms":["clot","coagulate","congeal"],"phonetic":"/ˈfaɪbrəˌneɪt/","extraExplanation":["“fibrinate”多见于医学/生物学语境，日常英语里更常用的说法是“clot”（凝固/结块）或“form a clot”。","词根来自“fibrin”（纤维蛋白）；纤维蛋白是血液凝固时形成网状结构的关键物质。"]}
{"word":"fibrination","summary":{"en":"Fibrination means the formation or deposition of fibrin, typically during blood clotting or inflammation.","zh":"fibrination 指纤维蛋白的形成或沉积，常见于凝血或炎症过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of forming fibrin (a fibrous protein) in blood, usually as part of clotting or inflammation; the deposit of fibrin in tissues","zh":"纤维蛋白形成；（多指凝血或炎症中）纤维蛋白在血液或组织中的生成与沉积"},"examples":[{"en":"The lab report suggested increased fibrination, consistent with active clot formation.","zh":"化验报告提示纤维蛋白形成增加，与正在发生的血栓形成相符。"},{"en":"In severe inflammation, fibrination can appear on the surface of affected tissues.","zh":"在严重炎症中，受累组织表面可能出现纤维蛋白沉积。"}]}],"synonyms":["fibrin formation","fibrin deposition","coagulation (context-dependent)"],"phonetic":"/ˌfaɪbrəˈneɪʃən/","extraExplanation":["这是医学/病理学用词，常见于描述“凝血（clotting）”或“炎症渗出（exudation）”时纤维蛋白（fibrin）的形成与沉积。日常英语中不常用，临床写作里更常见的表达是“fibrin formation / fibrin deposition”。","与之相关的常见词：fibrin（纤维蛋白）、fibrinogen（纤维蛋白原，纤维蛋白的前体）、coagulation（凝血）、thrombosis（血栓形成）。"]}
{"word":"fibrine","summary":{"en":"Fibrine is an older spelling of fibrin, the protein that forms threads in blood clots.","zh":"Fibrine 是 fibrin 的较旧拼写，指形成血凝块纤维网的蛋白质（纤维蛋白）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein that forms fine threads in blood clots (common modern spelling: fibrin)","zh":"（血液凝固时形成纤维网的）纤维蛋白（现代常用拼写：fibrin）"},"examples":[{"en":"After an injury, fibrine (fibrin) helps form a clot to stop the bleeding.","zh":"受伤后，纤维蛋白会帮助形成血块以止血。"},{"en":"Doctors may check for problems in fibrine formation if a patient bleeds too easily.","zh":"如果病人容易出血，医生可能会检查纤维蛋白形成是否有问题。"}]}],"synonyms":["fibrin"],"phonetic":"/ˈfaɪbrɪn/","extraExplanation":["“fibrine”多见于较旧的医学/生物学文献，是“fibrin”的旧式或较少用的拼写；现代英语写作与医学语境中通常用“fibrin”。","词源与拉丁语“fibra”（纤维）相关，因此与“fiber/fibrous（纤维/纤维状的）”在意义上同源、好联想。"]}
{"word":"fibrinemia","summary":{"en":"A medical term for the amount/condition of fibrin (or related clotting material) in the blood, often seen in forms like hyperfibrinemia or hypofibrinemia.","zh":"医学术语：指血液中纤维蛋白（或相关凝血物质）的含量/状态，常见于高/低纤维蛋白血症等表达中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) The level or condition of having fibrin in the blood; used especially in terms like “hyperfibrinemia” (too much fibrin/fibrin-related material) or “hypofibrinemia” (too little).","zh":"（医学）血液中纤维蛋白（或与纤维蛋白相关物质）的含量或“有纤维蛋白的状态”；常见于“高纤维蛋白血症（hyperfibrinemia）”“低纤维蛋白血症（hypofibrinemia）”等术语中。"},"examples":[{"en":"The report mentioned abnormal fibrinemia, suggesting a possible clotting problem.","zh":"报告提到纤维蛋白相关指标异常，提示可能存在凝血问题。"},{"en":"Doctors may investigate fibrinemia when evaluating unexplained blood clots.","zh":"在评估不明原因的血栓时，医生可能会检查纤维蛋白相关指标。"}]}],"synonyms":["fibrin level","blood fibrin level","(more common) fibrinogen level"],"phonetic":"/ˌfaɪbrəˈniːmiə/","extraExplanation":["“fibrinemia”属于医学/检验领域较少单独使用的词，更常见的是带前缀的形式：\n- hyperfibrinemia：纤维蛋白（相关指标）过高，可能与炎症、感染、血栓风险等相关；\n- hypofibrinemia：纤维蛋白（原）过低，可能与出血倾向、肝功能问题、消耗性凝血等相关。\n在临床里也常直接说“fibrinogen level（纤维蛋白原水平）”或讨论“fibrin(ogen)”相关检验。"]}
{"word":"fibrino","summary":{"en":"Fibrino- is a medical combining form meaning “fibrin” or “related to fibrin (blood clotting).”","zh":"fibrino- 是医学中的构词成分，表示“纤维蛋白”或“与纤维蛋白（凝血）有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “fibrin” or “related to fibrin,” a protein involved in blood clotting","zh":"构词成分，表示“纤维蛋白（fibrin）”或“与纤维蛋白有关”，纤维蛋白是血液凝固中的一种蛋白"},"examples":[{"en":"Fibrinogen is converted into fibrin during clot formation; “fibrino-” refers to that fibrin component.","zh":"在血栓形成过程中，纤维蛋白原会转变为纤维蛋白；“fibrino-”指的就是与这种纤维蛋白相关的部分。"},{"en":"The report mentioned fibrinolysis, the process that breaks down fibrin clots.","zh":"报告提到了“纤维蛋白溶解（fibrinolysis）”，也就是分解纤维蛋白血栓的过程。"}]}],"synonyms":["fibrin-","fibrino- (combining form)"],"phonetic":"/faɪˈbrɪnoʊ/","extraExplanation":["“fibrino-”多见于医学/生物学术语中，通常不单独作为一个词使用，而是放在词首构成专业词汇。","常见相关词：fibrin（纤维蛋白）、fibrinogen（纤维蛋白原）、fibrinolysis（纤维蛋白溶解）、fibrinolytic（溶栓的/促纤溶的）。记忆时可把“fibrin（纤维蛋白）+ -o-（连接元音）”理解为词根组合。"]}
{"word":"fibrinoalbuminous","summary":{"en":"A medical adjective meaning “containing both fibrin and albumin,” usually describing inflammatory exudates or fluids.","zh":"医学形容词，意为“同时含有纤维蛋白和白蛋白”，多用于描述炎症性渗出物或体液。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or relating to both fibrin (a clot-forming protein) and albumin (a common blood protein), especially describing inflammatory fluids or deposits in medical contexts.","zh":"（医学）含有或与纤维蛋白（凝血相关蛋白）和白蛋白（血液中常见蛋白）两者有关的；常用来形容炎症产生的渗出液或沉积物。"},"examples":[{"en":"The doctor described the pleural fluid as fibrinoalbuminous, suggesting an inflammatory process.","zh":"医生把胸膜液描述为“纤维蛋白-白蛋白性的”，提示存在炎症过程。"},{"en":"Microscopy showed a fibrinoalbuminous exudate on the tissue surface.","zh":"显微镜下可见组织表面有纤维蛋白-白蛋白性的渗出物。"}]}],"synonyms":["fibrinous (related, but not identical)","albuminous (related, but not identical)","protein-rich (broader)"],"phonetic":"/ˌfaɪbrɪnoʊælˈbjuːmənəs/","extraExplanation":["这是一个较少见的医学形容词，多出现在病理学/临床记录中，常与 exudate（渗出物）、fluid（液体）、deposit（沉积物）、inflammation（炎症）等词搭配。","词形结构：fibrino-（纤维蛋白/与纤维蛋白有关）+ albuminous（含白蛋白的）。理解前后缀有助于在阅读医学英语时快速推断词义。"]}
{"word":"fibrinocellular","summary":{"en":"A medical adjective meaning “containing both fibrin and cells,” often used to describe inflammatory exudates in pathology reports.","zh":"医学形容词，指“同时含有纤维蛋白和细胞”的成分，常用于病理报告描述炎症渗出物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Made of or relating to a mixture of fibrin (a protein involved in blood clotting) and cells, especially in an inflammatory fluid (exudate) seen in tissue or on membranes.","zh":"（医学）由纤维蛋白（与凝血有关的蛋白）和细胞混合构成的；常用于描述炎症渗出物或组织/膜表面的沉积物。"},"examples":[{"en":"The pathology report described a fibrinocellular exudate on the pleural surface.","zh":"病理报告描述胸膜表面有纤维蛋白-细胞性渗出物。"},{"en":"Microscopy showed a fibrinocellular layer covering the ulcerated mucosa.","zh":"显微镜下可见溃疡黏膜表面覆盖一层纤维蛋白-细胞性物质。"}]}],"synonyms":["fibrinous (related, less specific)","cellular (partial)","fibrin-rich (related)"],"phonetic":"/ˌfaɪbrɪnoʊˈsɛljələr/","extraExplanation":["这个词多见于病理学/检验报告，用来更精准地说明渗出物的“成分”：既有纤维蛋白（提示凝血/纤维素样沉积），又有细胞成分（常见为炎症细胞，如中性粒细胞等）。","构词上：fibrino-（纤维蛋白/纤维素样）+ cellular（细胞的）。临床写作中也可能看到相近表达如 fibrinous（纤维蛋白性的）或 fibrinopurulent（纤维蛋白脓性，强调脓细胞更多）。"]}
{"word":"fibrinogen","summary":{"en":"Fibrinogen is a blood-plasma protein that is converted into fibrin to form clots and stop bleeding.","zh":"Fibrinogen（纤维蛋白原）是血浆蛋白，在凝血时转变为纤维蛋白，帮助形成血栓以止血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein in blood plasma that is changed into fibrin during blood clotting (it helps stop bleeding).","zh":"血浆中的一种蛋白质，在凝血过程中会转变为“纤维蛋白”（fibrin），帮助形成血栓以止血。"},"examples":[{"en":"Doctors may measure fibrinogen levels to understand a patient’s risk of abnormal bleeding or clotting.","zh":"医生可能会检测纤维蛋白原水平，以了解患者异常出血或凝血的风险。"},{"en":"Low fibrinogen can make it harder for the body to form stable blood clots.","zh":"纤维蛋白原偏低会让身体更难形成稳定的血凝块。"}]}],"synonyms":["clotting factor I","Factor I"],"phonetic":"/faɪˈbrɪnədʒən/","extraExplanation":["词源小提示：fibrinogen = fibrin（纤维蛋白）+ -gen（“产生、生成”之意）。它本身不等于“血栓”，而是凝血链条中的关键“原料”，在凝血酶等作用下转变为纤维蛋白，形成网状结构把血细胞“兜住”，从而止血。"]}
{"word":"fibrinogen-forming","summary":{"en":"“Fibrinogen-forming” describes something that produces or promotes production of fibrinogen, a key blood-clotting protein.","zh":"“fibrinogen-forming”指生成或促进生成纤维蛋白原（凝血关键蛋白）的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) producing or helping the body produce fibrinogen (a blood protein needed for clotting).","zh":"（医学）生成或促进生成纤维蛋白原（参与凝血的重要血浆蛋白）的。"},"examples":[{"en":"Researchers studied the fibrinogen-forming capacity of liver cells.","zh":"研究人员考察了肝细胞生成纤维蛋白原的能力。"},{"en":"A fibrinogen-forming factor may influence how quickly blood clots.","zh":"纤维蛋白原生成因子可能影响血液凝固的速度。"}]}],"synonyms":["fibrinogenic","fibrinogen-producing"],"phonetic":"/faɪˈbrɪnədʒən ˈfɔrmɪŋ/","extraExplanation":["“fibrinogen-forming”多见于医学/生物学写作中，常用来描述“产生纤维蛋白原”的细胞、组织（尤其是肝脏）或相关机制。","纤维蛋白原（fibrinogen）在凝血过程中会被转化为纤维蛋白（fibrin），形成网状结构帮助止血；因此这个词通常出现在凝血、炎症、肝功能等话题里。","近义表达常见有“fibrinogenic”（意为与纤维蛋白原生成相关/促成），但具体用法取决于学科和作者习惯。"]}
{"word":"fibrinogenetic","summary":{"en":"Fibrinogenetic means “related to the formation/production of fibrinogen,” a key blood-clotting protein.","zh":"fibrinogenetic 指“与纤维蛋白原的形成/生成有关”，纤维蛋白原是凝血关键蛋白。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the production or formation of fibrinogen (a blood protein that helps blood clot).","zh":"与纤维蛋白原（帮助血液凝固的血浆蛋白）的生成或形成有关的。"},"examples":[{"en":"Doctors studied fibrinogenetic activity in the liver, since the liver makes most fibrinogen.","zh":"医生研究了肝脏中的纤维蛋白原生成活动，因为大部分纤维蛋白原由肝脏合成。"},{"en":"A fibrinogenetic disorder can affect how easily blood clots.","zh":"纤维蛋白原生成相关的障碍会影响血液凝固的容易程度。"}]}],"synonyms":["fibrinogen-forming","related to fibrinogen production"],"phonetic":"/ˌfaɪbrɪnoʊdʒəˈnɛtɪk/","extraExplanation":["这是一个医学/生物化学领域的低频词，多见于科研论文或专业报告。日常英语里更常见的是 fibrinogen（纤维蛋白原）本身，或用 “fibrinogen production/formation”（纤维蛋白原生成）来表达。","词形可拆分理解：fibrinogen（纤维蛋白原） + -etic（表示“与……有关的/具有……性质的”）。不要与 fibrinogenic（促成纤维蛋白/凝血的）混淆；两者都与凝血相关，但关注点可能不同。"]}
{"word":"fibrinogenic","summary":{"en":"Fibrinogenic means “related to or promoting fibrin(ogen) formation,” usually in medical contexts about blood clotting.","zh":"fibrinogenic 指“与纤维蛋白（原）的形成有关或促进其形成的”，多用于凝血等医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to fibrinogen (a blood protein) or causing/able to promote the formation of fibrinogen or fibrin in blood clotting.","zh":"与纤维蛋白原（血液中的一种蛋白）有关的；或指能促使纤维蛋白原/纤维蛋白形成、与凝血过程相关的。"},"examples":[{"en":"Doctors monitored fibrinogenic factors to understand why the patient was forming clots.","zh":"医生监测促凝/纤维蛋白原相关因素，以了解患者为何会形成血栓。"},{"en":"A fibrinogenic response can increase the risk of thrombosis in some conditions.","zh":"在某些情况下，促纤维蛋白生成的反应可能会增加血栓形成的风险。"}]}],"synonyms":["thrombogenic","procoagulant","clot-promoting"],"phonetic":"/ˌfaɪbrɪnəˈdʒɛnɪk/","extraExplanation":["“fibrinogenic”多见于医学与生物学语境（如凝血、炎症、血栓风险评估）。词形上可拆解为 fibrin(纤维蛋白) + -gen-（产生/生成）+ -ic（形容词后缀），整体含义偏“促生成/与生成有关”。日常英语中很少用，常见于论文、检验报告或临床描述。"]}
{"word":"fibrinogenically","summary":{"en":"“Fibrinogenically” means “in a fibrin-forming (clot-promoting) way,” mainly used in medical/scientific contexts.","zh":"“fibrinogenically”意为“以促使纤维蛋白形成（促凝血）的方式”，主要用于医学/科研语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that promotes or relates to the production of fibrin (the protein threads that help blood clot).","zh":"以促进或涉及纤维蛋白生成（帮助血液凝固的蛋白纤维）的方式。"},"examples":[{"en":"Some surfaces can act fibrinogenically, encouraging fibrin to form quickly on contact with blood.","zh":"某些表面具有促纤维蛋白生成的作用，与血液接触时会更快形成纤维蛋白。"},{"en":"The researchers described the coating as fibrinogenically active in their lab tests.","zh":"研究人员在实验中将这种涂层描述为“具有促纤维蛋白生成活性”。"}]}],"synonyms":["in a fibrin-forming way","clot-promotingly","procoagulantly"],"phonetic":"/ˌfaɪbrɪnəˈdʒɛnɪkli/","extraExplanation":["这是一个非常少见、偏医学/生物材料领域的副词，来自形容词 fibrinogenic（“促纤维蛋白生成的”）+ -ly。fibrin（纤维蛋白）来自 fibrinogen（纤维蛋白原，血浆中的前体蛋白），在凝血过程中被转化为 fibrin，形成网状结构帮助止血。","写作中更常见的是 fibrinogenic（adj.）或 fibrinogenically active（短语）；单独使用 fibrinogenically 多见于科研论文或技术报告。"]}
{"word":"fibrinogenous","summary":{"en":"Fibrinogenous means “fibrin-forming; producing fibrin,” usually in medical contexts about blood clotting.","zh":"fibrinogenous 指“形成/生成纤维蛋白的”，多用于医学语境，常与血液凝固相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing or forming fibrin (the protein fibers that help blood clot).","zh":"能生成或形成纤维蛋白的（纤维蛋白是帮助血液凝固的蛋白纤维）。"},"examples":[{"en":"Fibrinogenous activity increases during the clotting process after an injury.","zh":"受伤后，在凝血过程中会增强纤维蛋白生成（成纤维蛋白）的活动。"},{"en":"Doctors studied the fibrinogenous factors involved in abnormal clot formation.","zh":"医生研究了导致异常血栓形成的纤维蛋白生成相关因素。"}]}],"synonyms":["fibrin-forming","clot-forming"],"phonetic":"/faɪˌbrɪˈnɑːdʒənəs/","extraExplanation":["该词多见于医学/生理学语境，常用来描述“促使纤维蛋白形成”的过程、物质或因素。日常英语中更常见的是 fibrinogen（纤维蛋白原）和 fibrin（纤维蛋白）。","构词提示：fibrin（纤维蛋白）+ -gen-（产生、生成）+ -ous（……的），整体就是“能生成纤维蛋白的”。"]}
{"word":"fibrinoid","summary":{"en":"Fibrinoid means “fibrin-like,” especially describing tissue deposits/changes seen in pathology.","zh":"fibrinoid 指“类纤维蛋白样的”，常用于病理学描述组织中的沉积或改变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling fibrin (a protein involved in blood clotting); used especially in medicine/pathology to describe tissue deposits that look like fibrin under a microscope.","zh":"类似纤维蛋白（参与血液凝固的蛋白质）的；尤用于医学/病理学，指在显微镜下看起来像纤维蛋白的组织沉积。"},"examples":[{"en":"The report mentioned fibrinoid material in the vessel wall.","zh":"报告提到血管壁内有类纤维蛋白样物质。"},{"en":"Fibrinoid change can be seen in some inflammatory conditions.","zh":"在某些炎症性疾病中可见类纤维蛋白样改变。"}]},{"partOfSpeech":"n.","definition":{"en":"A fibrin-like deposit or degeneration seen in damaged tissue (often described as “fibrinoid necrosis”).","zh":"受损组织中出现的类纤维蛋白样沉积或变性（常见说法为“类纤维蛋白样坏死”）。"},"examples":[{"en":"Microscopy showed areas of fibrinoid within the small arteries.","zh":"显微镜检查显示小动脉内有类纤维蛋白样区域。"},{"en":"In severe vasculitis, fibrinoid necrosis may occur.","zh":"在严重的血管炎中，可能发生类纤维蛋白样坏死。"}]}],"synonyms":["fibrin-like","fibrinous (context-dependent)"],"phonetic":"/faɪˈbrɪnɔɪd/","extraExplanation":["“fibrinoid”主要用于病理学语境，并不等同于真正的“fibrin（纤维蛋白）”。它强调的是“外观/染色特征像纤维蛋白”，常与免疫反应、血管壁损伤、结缔组织病等情境一起出现。","常见搭配：fibrinoid necrosis（类纤维蛋白样坏死）、fibrinoid change（类纤维蛋白样改变）、fibrinoid material/deposit（类纤维蛋白样物质/沉积）。"]}
{"word":"fibrinokinase","summary":{"en":"Fibrinokinase is a clot-dissolving enzyme/drug that helps break down fibrin in blood clots.","zh":"Fibrinokinase 指一种用于分解血栓中纤维蛋白的溶栓酶/药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme (a type of protein) that helps break down fibrin, the protein threads that form blood clots; used medically to dissolve clots","zh":"一种酶（蛋白质的一种），可帮助分解纤维蛋白——形成血栓的“纤维丝”；在医学上可用于溶解血栓"},"examples":[{"en":"In some treatments, fibrinokinase can help dissolve dangerous blood clots.","zh":"在某些治疗中，fibrinokinase 可帮助溶解危险的血栓。"},{"en":"Doctors use clot‑dissolving drugs like fibrinokinase only in specific emergency situations.","zh":"医生只会在特定的紧急情况下使用像 fibrinokinase 这样的溶栓药物。"}]}],"synonyms":["fibrinolytic enzyme","clot‑dissolving enzyme","thrombolytic agent"],"phonetic":"/ˌfaɪbrɪnoʊˈkaɪneɪs/","extraExplanation":["这个词在现代医学英语里相对少见，很多时候会用更具体或更常见的名称来表达“溶栓/纤溶”相关药物或酶，例如：streptokinase（链激酶）、urokinase（尿激酶）、tPA（组织型纤溶酶原激活剂）。不同药物作用机制与适应症并不完全相同，实际用药需以临床语境为准。","词形上可拆理解：fibrino-（与纤维蛋白 fibrin 有关）+ -kinase（激酶/促活酶，常指催化磷酸化或“激活”某种过程的酶）。不过这里的“fibrinokinase”常被广义地理解为与纤维蛋白溶解相关的酶/药物。"]}
{"word":"fibrinolyses","summary":{"en":"“Fibrinolyses” is the plural of “fibrinolysis,” meaning the breakdown of fibrin in blood clots.","zh":"“Fibrinolyses”是“fibrinolysis”的复数，指血栓中纤维蛋白被分解、溶解的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of fibrinolysis: the breakdown (dissolution) of fibrin in blood clots, usually by the body’s own enzymes or by medication.","zh":"fibrinolysis 的复数：指血栓中“纤维蛋白（fibrin）”被分解、溶解的过程，可由人体自身酶系统完成，也可由药物促进。"},"examples":[{"en":"Doctors monitored fibrinolyses after surgery to reduce the risk of dangerous clots.","zh":"医生在术后监测纤维蛋白溶解过程，以降低危险血栓的风险。"},{"en":"Abnormal fibrinolyses can lead to either excessive bleeding or clotting problems.","zh":"异常的纤维蛋白溶解过程可能导致出血过多或凝血问题。"}]}],"synonyms":["fibrin breakdown","clot dissolution (context-dependent)","thrombolysis (related, not identical)"],"phonetic":"/faɪˌbrɪnəˈlɪsiz/","extraExplanation":["“Fibrinolysis（纤维蛋白溶解）”常见于医学/检验语境，和“thrombolysis（溶栓）”相关但不完全相同：fibrinolysis 更强调对“纤维蛋白网”的分解，是溶栓过程中的关键机制之一。","词形提示：fibrinolyses 是复数形式；单数是 fibrinolysis。发音与拼写中的 -lysis（分解）有关，复数把 -is 变为 -es（-yses）。"]}
{"word":"fibrinolysin","summary":{"en":"Fibrinolysin is an enzyme (plasmin) that dissolves blood clots by breaking down fibrin.","zh":"fibrinolysin 指一种酶（纤溶酶/ plasmin），通过分解纤维蛋白来溶解血栓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme (also called plasmin) that breaks down fibrin, helping dissolve blood clots","zh":"一种酶（也称纤溶酶/血纤维蛋白溶解酶，plasmin），能分解纤维蛋白，从而帮助溶解血栓"},"examples":[{"en":"Fibrinolysin helps break down fibrin so the clot can be removed after healing.","zh":"纤溶酶帮助分解纤维蛋白，使伤口愈合后血块能够被清除。"},{"en":"Doctors study fibrinolysin activity to understand why some patients form clots more easily.","zh":"医生会研究纤溶酶的活性，以了解为什么有些患者更容易形成血栓。"}]}],"synonyms":["plasmin"],"phonetic":"/ˌfaɪbrəˈnɑləsɪn/","extraExplanation":["在现代医学与生化语境中，fibrinolysin 常与 plasmin 视为同义；更常见的表达是“plasmin（纤溶酶）”以及“fibrinolysis（纤维蛋白溶解/纤溶）”。","词源可拆解理解：fibrino-（与纤维蛋白 fibrin 有关）+ -lysin（溶解、裂解）。因此字面意思就是“溶解纤维蛋白的物质”。"]}
{"word":"fibrinolysis","summary":{"en":"Fibrinolysis is the breakdown of fibrin to dissolve blood clots; it can also refer to clot-dissolving treatment in medicine.","zh":"fibrinolysis 指纤维蛋白的分解以溶解血栓；也可指医学上的溶栓治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the natural process in which the body breaks down fibrin (the protein threads that form blood clots), helping dissolve clots after they have done their job","zh":"纤维蛋白溶解：人体分解纤维蛋白（形成血栓的蛋白质纤维）的自然过程，用于在血栓完成止血作用后将其溶解"},"examples":[{"en":"After the wound stopped bleeding, fibrinolysis helped remove the clot as healing continued.","zh":"伤口止血后，随着愈合进行，纤维蛋白溶解会帮助清除血栓。"},{"en":"Doctors may test how well fibrinolysis is working in patients with unusual clotting problems.","zh":"对于出现异常凝血问题的患者，医生可能会检测纤维蛋白溶解功能是否正常。"}]},{"partOfSpeech":"n.","definition":{"en":"(in medicine) treatment that uses drugs to dissolve dangerous blood clots, such as in some heart attacks or strokes","zh":"（医学）溶栓治疗：使用药物溶解危险血栓（如某些心肌梗死或中风情况下）"},"examples":[{"en":"In some cases, rapid fibrinolysis can restore blood flow and reduce damage.","zh":"在某些情况下，快速溶栓可以恢复血流并减少损伤。"},{"en":"Fibrinolysis is not suitable for everyone because it can increase the risk of bleeding.","zh":"溶栓并不适合所有人，因为它可能增加出血风险。"}]}],"synonyms":["clot breakdown","clot dissolution","thrombolysis (related)"],"phonetic":"/ˌfaɪbrɪˈnɑləsɪs/","extraExplanation":["词源提示：fibrin（纤维蛋白）+ -lysis（分解、溶解）。因此 fibrinolysis 字面意思就是“纤维蛋白的溶解/分解”。","相关词汇：fibrinolytic（adj. 溶纤维蛋白的/溶栓的）；fibrinolytic drug（溶栓药）；thrombolysis（溶栓，常与 fibrinolysis 近义但更强调“血栓”）；anticoagulant（抗凝药，作用是防止形成新血栓，不等于溶解已有血栓）。"]}
{"word":"fibrinolytic","summary":{"en":"Fibrinolytic means “clot-dissolving” by breaking down fibrin; it can be an adjective or a noun for a clot-busting drug.","zh":"fibrinolytic 指“通过分解纤维蛋白来溶解血栓的”，既可作形容词，也可作名词指溶栓药/纤溶剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A drug or substance that breaks down fibrin in blood clots, helping dissolve the clot.","zh":"（医学）溶解（血栓中）纤维蛋白的药物或物质，用于帮助溶解血栓。"},"examples":[{"en":"Doctors may give a fibrinolytic to dissolve a dangerous blood clot after a heart attack.","zh":"在心肌梗死后，医生可能会使用溶栓药（纤溶剂）来溶解危险的血栓。"},{"en":"Because fibrinolytics can increase bleeding risk, patients are monitored closely.","zh":"由于纤溶剂可能增加出血风险，患者会被严密监测。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or causing the breakdown of fibrin in blood clots; clot-dissolving.","zh":"与分解血栓中的纤维蛋白有关的；促进溶栓的。"},"examples":[{"en":"Tissue plasminogen activator (tPA) has fibrinolytic effects.","zh":"组织型纤溶酶原激活剂（tPA）具有纤溶作用。"},{"en":"The hospital follows strict rules for fibrinolytic therapy in stroke care.","zh":"医院对卒中治疗中的溶栓（纤溶）疗法有严格规范。"}]}],"synonyms":["clot-busting","thrombolytic","fibrin-dissolving"],"phonetic":"/ˌfaɪ.brə.noʊˈlɪtɪk/","extraExplanation":["词源提示：fibrin（纤维蛋白）+ -lytic（溶解、分解的）。因此 fibrinolytic 字面意思就是“分解纤维蛋白的”。","学习提示：临床上常把 fibrinolytic 用作名词，指“溶栓药/纤溶剂”；也常搭配 therapy（治疗）构成 fibrinolytic therapy（溶栓治疗）。"]}
{"word":"fibrinoplastic","summary":{"en":"Fibrinoplastic means promoting fibrin formation, especially in blood clotting.","zh":"fibrinoplastic 指促进纤维蛋白形成的，尤用于描述促凝血/易形成血栓的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Promoting the formation of fibrin, especially in blood clotting; tending to produce fibrin.","zh":"（医学）促使纤维蛋白形成的；（尤指）促进凝血、易形成纤维蛋白的。"},"examples":[{"en":"The surgeon monitored the patient for fibrinoplastic changes that might increase clot formation.","zh":"外科医生监测患者是否出现纤维蛋白生成增多的变化，以免血栓形成风险上升。"},{"en":"Some older medical texts described certain inflammatory fluids as fibrinoplastic.","zh":"一些较早的医学文献会把某些炎症渗出液描述为“促纤维蛋白生成的（fibrinoplastic）”。"}]}],"synonyms":["procoagulant","thrombogenic","clot-promoting"],"phonetic":"/ˌfaɪbrəˈnɑplæstɪk/","extraExplanation":["该词由 fibrin（纤维蛋白）+ -plastic（有“形成/生成”之意的构词成分）组成，字面含义是“能生成纤维蛋白的”。","在现代医学写作中，这个词相对少见，更常见的表达是 “procoagulant（促凝的）”、“thrombogenic（致血栓形成的）” 或直接说 “promoting fibrin formation（促进纤维蛋白形成）”。"]}
{"word":"fibrinoplastin","summary":{"en":"Fibrinoplastin is an older medical word for a substance involved in blood clotting that helps produce fibrin.","zh":"Fibrinoplastin 是一个较旧的医学词，指参与血液凝固、帮助生成纤维蛋白的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, older term) A blood-clotting substance (a protein/enzyme) that helps form fibrin, the material that makes a blood clot.","zh":"（医学旧称）一种参与血液凝固的物质（蛋白质/酶），帮助生成纤维蛋白（fibrin），即血凝块的主要成分。"},"examples":[{"en":"Some older physiology books use the word fibrinoplastin when describing how blood clots form.","zh":"一些较早的生理学教材在描述血液凝固过程时会使用 fibrinoplastin 这个词。"},{"en":"In simple terms, fibrinoplastin helps turn fibrinogen into fibrin during clotting.","zh":"简单来说，fibrinoplastin 在凝血过程中帮助把纤维蛋白原（fibrinogen）转变成纤维蛋白（fibrin）。"}]}],"synonyms":["clotting factor","thrombin (context-dependent)","thromboplastin (context-dependent)"],"phonetic":"/ˌfaɪbrɪnoʊˈplæstɪn/","extraExplanation":["这是一个较少见、偏旧的术语。不同年代/作者对它所指的“凝血成分”可能不完全一致，常被用来泛指与“生成纤维蛋白”有关的凝血因子（例如与 thrombin / thromboplastin 相关的概念）。阅读旧文献时，最好结合上下文或查看该书的术语表来确认它具体对应哪一种现代名称。"]}
{"word":"fibrinopurulent","summary":{"en":"A medical adjective meaning “containing both fibrin and pus,” typically describing inflammatory exudate in infections.","zh":"医学形容词：指同时含有纤维蛋白和脓液的（渗出物/炎症），多见于感染相关炎症。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or producing both fibrin (a protein involved in blood clotting) and pus; describing an inflammatory exudate made of fibrin plus pus cells, often seen in infections.","zh":"（医学）纤维素性脓性（的）；指炎症渗出物同时含有纤维蛋白（与凝血相关的蛋白）和脓液/脓细胞，常见于感染。"},"examples":[{"en":"The report described a fibrinopurulent exudate covering the tissue surface.","zh":"报告描述组织表面覆盖着纤维素性脓性渗出物。"},{"en":"In severe bacterial infection, doctors may see fibrinopurulent inflammation in the affected area.","zh":"在严重细菌感染中，医生可能在病灶处看到纤维素性脓性炎症。"}]}],"synonyms":["purulent","fibrinous-purulent","suppurative (related)"],"phonetic":"/ˌfaɪbrəˌnoʊˈpjʊrələnt/","extraExplanation":["词源结构：fibrino-（与纤维蛋白/纤维素性相关）+ purulent（脓性的）。这是病理学/临床报告中较正式的描述性术语，常用于形容胸膜炎、腹膜炎或黏膜表面的“渗出物（exudate）/炎症（inflammation）”类型。","使用场景提示：它多出现在医学影像/病理报告（如“fibrinopurulent pleuritis 胸膜纤维素性脓性炎”）而非日常英语；理解时可抓住核心含义“纤维蛋白 + 脓”。"]}
{"word":"fibrinose","summary":{"en":"Fibrinose means “containing or resembling fibrin,” used mainly in medical descriptions of clot-like inflammatory material.","zh":"fibrinose 指“含有/类似纤维蛋白的”，主要用于医学中描述炎症时凝块样（纤维蛋白样）物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Containing, resembling, or caused by fibrin (a protein involved in blood clotting), especially describing an exudate or inflammation with stringy, clot-like material.","zh":"（医学）含有纤维蛋白的；类似纤维蛋白的；由纤维蛋白引起的（常用于描述渗出物或炎症时出现的丝状、凝块样物质）。"},"examples":[{"en":"The report described a fibrinose coating on the inflamed tissue.","zh":"报告描述发炎组织表面有一层纤维蛋白样覆盖物。"},{"en":"In severe infections, doctors may see fibrinose exudate forming on mucous membranes.","zh":"在严重感染中，医生可能会看到黏膜表面形成纤维蛋白样渗出物。"}]}],"synonyms":["fibrinous","fibrin-like"],"phonetic":"/ˈfaɪbrɪˌnoʊs/","extraExplanation":["“fibrinose”在日常英语中非常少见，更常用的对应词是“fibrinous”。在医学语境里它常与“exudate（渗出物）”“inflammation（炎症）”“membrane（膜）/pleurisy（胸膜炎）”等搭配，用来强调渗出物中有纤维蛋白、呈丝状或凝块状。"]}
{"word":"fibrinosis","summary":{"en":"Fibrinosis is a medical term for fibrin forming or depositing in tissues or vessels, often linked to inflammation or abnormal clotting.","zh":"Fibrinosis 是医学术语，指纤维蛋白在组织或血管中形成/沉积，常与炎症或异常凝血相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) The formation or presence of fibrin (a blood‑clotting protein) in tissues or blood vessels, often as part of inflammation or abnormal clotting.","zh":"（医学）纤维蛋白（参与凝血的蛋白质）在组织或血管中形成或沉积的现象，常见于炎症反应或异常凝血过程。"},"examples":[{"en":"The biopsy showed fibrinosis in small blood vessels, suggesting ongoing inflammation.","zh":"活检显示小血管内有纤维蛋白沉积，提示存在持续的炎症。"},{"en":"Doctors monitored the patient for signs of fibrinosis after severe infection.","zh":"严重感染后，医生监测患者是否出现纤维蛋白沉积的迹象。"}]}],"synonyms":["fibrin deposition","fibrin accumulation","fibrinoid change (related, context-dependent)"],"phonetic":"/ˌfaɪbrəˈnoʊsɪs/","extraExplanation":["“fibrinosis”主要出现在医学/病理学语境中，用来描述“纤维蛋白样沉积”或“纤维蛋白在组织中的沉着”。在一些文献里也可能见到更常用的相关表达，如“fibrin deposition（纤维蛋白沉积）”或“fibrinoid change/necrosis（纤维样变/纤维样坏死）”，具体用词取决于病理特征与作者习惯。","词根提示：fibrin（纤维蛋白）+ -osis（表示某种状态/病变）。看到“-osis”结尾的医学词时，常可理解为“某种状态、过程或病理变化”。"]}
{"word":"fibrinous","summary":{"en":"Fibrinous means “related to/containing fibrin,” usually in medical contexts (e.g., fibrinous inflammation or exudate).","zh":"fibrinous 指“与纤维蛋白有关或含纤维蛋白的”，多用于医学语境（如纤维蛋白性炎症或渗出物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or containing fibrin (a protein involved in blood clotting), often describing an inflammation or tissue change where fibrin forms or deposits.","zh":"与纤维蛋白有关或含有纤维蛋白（参与凝血的蛋白质）；常用于医学中描述因炎症或组织变化而出现纤维蛋白形成或沉积的情况。"},"examples":[{"en":"The doctor noted a fibrinous exudate on the surface of the tissue.","zh":"医生注意到组织表面有纤维蛋白性的渗出物。"},{"en":"Fibrinous inflammation can create a thin, tough layer over affected membranes.","zh":"纤维蛋白性炎症可能在受累的膜表面形成一层薄而坚韧的覆盖层。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling fibers in texture or appearance; fibrous-looking (less common in everyday English, more technical).","zh":"外观或质地像纤维一样的、呈纤维状的（较少见，多为技术/医学语境）。"},"examples":[{"en":"Under the microscope, the material appeared fibrinous and threadlike.","zh":"在显微镜下，这种物质看起来呈纤维蛋白样、细丝状。"}]}],"synonyms":["fibrin-related","fibrin-containing","(sometimes) fibrous-looking"],"phonetic":"/ˈfaɪbrənəs/","extraExplanation":["词源提示：fibrinous 来自 fibrin（纤维蛋白）+ -ous（“……的”）。因此它多用于医学/生物学语境，而不是日常对话。","常见搭配（医学）：fibrinous exudate（纤维蛋白性渗出物）、fibrinous pericarditis（纤维蛋白性心包炎）、fibrinous pleuritis（纤维蛋白性胸膜炎）。","学习提醒：不要和 fibrous（纤维状的、含纤维的）混淆。fibrous 更广泛，可形容木材、蔬菜等“纤维多”；fibrinous 更具体，通常指与“纤维蛋白/凝血”相关的改变。"]}
{"word":"fibrinous-purulent","summary":{"en":"A medical adjective meaning “containing both fibrin and pus.”","zh":"医学形容词：指“同时含纤维蛋白与脓（脓性成分）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Containing both fibrin (a thread-like protein involved in clotting) and pus; describing an inflammation, fluid, or discharge that has a fibrous/filmy component plus purulent (pus-like) material.","zh":"（医学）含有纤维蛋白与脓的；形容炎症、积液或分泌物同时具有“纤维素样（成膜/丝状）”成分和“化脓（脓性）”成分。"},"examples":[{"en":"The surgeon noted a fibrinous-purulent exudate in the wound.","zh":"外科医生发现伤口内有纤维蛋白脓性渗出物。"},{"en":"The report described fibrinous-purulent pleuritis affecting the right lung.","zh":"报告描述右肺受累的纤维蛋白脓性胸膜炎。"},{"en":"Microscopy showed fibrin strands mixed with purulent material.","zh":"显微镜下可见纤维蛋白丝与脓性物质混合。"}]}],"synonyms":["fibrinopurulent","suppurative with fibrin","purulent with fibrinous component"],"phonetic":"/ˈfaɪbrɪnəs ˈpjʊrəˌlənt/","extraExplanation":["这是病理/临床记录里常见的复合形容词，用来更精确地描述“渗出物（exudate）/积液（effusion）/炎症（inflammation）”的性质：既有纤维蛋白沉积（常呈膜状或丝状），又有明显脓性成分（提示细菌感染或强烈炎症）。","常见搭配：fibrinous-purulent exudate（纤维蛋白脓性渗出物）、fibrinous-purulent pleuritis（纤维蛋白脓性胸膜炎）、fibrinous-purulent pericarditis（纤维蛋白脓性心包炎）。"]}
{"word":"fibrins","summary":{"en":"“Fibrins” means the protein threads of fibrin that form a blood-clotting net (plural form).","zh":"“fibrins”指纤维蛋白形成的丝状结构，用于凝血成网（复数形式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of fibrin: tough protein threads that form in the blood to help make a clot (for example, after a cut).","zh":"fibrin 的复数：纤维蛋白形成的坚韧丝状结构，帮助血液凝固并形成血块（例如受伤出血后）。"},"examples":[{"en":"During clotting, fibrins form a net that traps blood cells.","zh":"在凝血过程中，纤维蛋白形成网状结构，把血细胞“网住”。"},{"en":"Doctors looked for abnormal fibrins in the patient’s blood sample.","zh":"医生在患者的血液样本中检查是否存在异常的纤维蛋白。"}]}],"synonyms":["fibrin threads","clotting fibers","fibrin strands"],"phonetic":"/ˈfaɪbrɪn/","extraExplanation":["“fibrin”常见于医学/生物学语境，和“clot（血块）”“coagulation（凝血）”“fibrinogen（纤维蛋白原，fibrin 的前体）”一起出现：fibrinogen 在凝血时被转化为 fibrin，fibrin 再交织成网帮助止血。","词形提示：日常英语中更常用单数“fibrin”来指这种物质；“fibrins”多用于强调不同类型/不同来源的纤维蛋白，或在科研写作中按可数用法出现。"]}
{"word":"fibrinuria","summary":{"en":"Fibrinuria means fibrin is present in the urine, often indicating urinary tract inflammation or bleeding.","zh":"Fibrinuria 指尿中出现纤维蛋白，常提示泌尿道炎症或出血等情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The presence of fibrin (a protein involved in blood clotting) in the urine, usually as a sign of inflammation or bleeding somewhere in the urinary tract.","zh":"尿中出现纤维蛋白（参与凝血的蛋白质），通常提示泌尿道某处存在炎症或出血等问题。"},"examples":[{"en":"The lab report mentioned fibrinuria, so the doctor ordered more tests to look for urinary tract inflammation.","zh":"化验报告提到纤维蛋白尿，所以医生安排了更多检查以寻找泌尿道炎症的原因。"},{"en":"Fibrinuria is not a common finding and may suggest injury or infection in the urinary system.","zh":"纤维蛋白尿并不常见，可能提示泌尿系统的损伤或感染。"}]}],"synonyms":["fibrin in the urine"],"phonetic":"/faɪˌbrɪnˈjʊriə/","extraExplanation":["词源提示：fibrin（纤维蛋白）+ -uria（“尿中出现某物”的医学后缀，如 hematuria 血尿）。","学习提示：日常英语里很少用到这个词，更多出现在医学报告或论文中。口语沟通时，医生可能更常说“protein in the urine（尿蛋白）”“blood in the urine（尿血）”等更宽泛的表达；但 fibrinuria 特别强调“纤维蛋白”这一凝血相关成分。"]}
{"word":"fibro","summary":{"en":"“Fibro” most often means fibromyalgia in informal speech; it can also refer to the prefix “fibro-” meaning “fiber/fibrous tissue.”","zh":"“fibro”最常见的意思是口语中的“纤维肌痛（fibromyalgia）”；也可指与“纤维/纤维组织”相关的前缀“fibro-”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Fibromyalgia: a long-term health condition that often includes widespread pain, fatigue, and sleep problems.","zh":"（非正式）纤维肌痛／纤维肌痛综合征：一种长期健康状况，常见症状包括全身广泛疼痛、疲劳以及睡眠问题。"},"examples":[{"en":"She was diagnosed with fibro last year, so she plans her week around rest and gentle exercise.","zh":"她去年被诊断为纤维肌痛，所以她会围绕休息和温和运动来安排一周的计划。"},{"en":"Some days my fibro flares up, and even simple chores feel exhausting.","zh":"有些天我的纤维肌痛会发作，连简单的家务都让人筋疲力尽。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, in words) Relating to fibers or fibrous tissue; short for the prefix “fibro-”.","zh":"（非正式，用于构词）与纤维或纤维组织有关；“fibro-”前缀的简称。"},"examples":[{"en":"In medical terms, “fibro-” often points to fibrous tissue, as in “fibroblast.”","zh":"在医学术语中，“fibro-”常指纤维组织，比如“fibroblast（成纤维细胞）”。"},{"en":"The article mentioned fibro tissue changes after injury.","zh":"文章提到受伤后纤维组织的变化。"}]}],"synonyms":["fibromyalgia","fibro-"],"phonetic":"/ˈfaɪbroʊ/","extraExplanation":["“fibro”作为“fibromyalgia（纤维肌痛）”的口语简称，在澳大利亚、英国等地的日常表达中更常见；在更正式的医疗沟通或写作中通常用“fibromyalgia”。","纤维肌痛是一种真实且可能严重影响生活质量的慢性疼痛相关疾病；不同人的症状和严重程度差异很大。若在交流中提到，使用尊重、理解的语气会更合适。"]}
{"word":"fibro-caseous","summary":{"en":"A medical adjective describing tissue that is both fibrous and caseous (cheese-like), often in tuberculosis-related lesions.","zh":"医学形容词：描述同时存在纤维化与干酪样（奶酪样）坏死的组织改变，常见于结核相关病灶。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having both fibrous tissue and caseous (“cheese-like”) necrosis; often describing certain chronic inflammatory lesions, especially in tuberculosis.","zh":"（医学）同时具有纤维性组织与干酪样（“像奶酪一样”）坏死的；常用于描述某些慢性炎症病灶，尤其见于结核病。"},"examples":[{"en":"The CT report mentioned a fibro-caseous lesion in the upper lobe.","zh":"CT报告提到上肺叶存在纤维-干酪样病灶。"},{"en":"Fibro-caseous changes can be seen in chronic pulmonary tuberculosis.","zh":"慢性肺结核可见纤维-干酪样改变。"}]}],"synonyms":["fibrocaseous","fibro-cavitary (related, not identical)","fibrotic and caseating"],"phonetic":"/ˌfaɪbroʊ ˈkeɪʒəs/","extraExplanation":["“caseous”指“干酪样坏死”，外观呈白黄、松碎，病理上常与结核感染相关；“fibro-”表示纤维化（疤痕样）成分，提示病程较久或慢性过程。","该词多用于影像学报告或病理描述，日常英语中很少出现；也可见写法“fibrocaseous”（不加连字符）。"]}
{"word":"fibro-connective","summary":{"en":"An adjective meaning “related to fibrous connective tissue.”","zh":"形容词：表示“与纤维性结缔组织有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to fibrous connective tissue (tissue made mainly of collagen fibers that supports and connects parts of the body).","zh":"与“纤维性结缔组织”有关的（主要由胶原纤维构成、用于支撑并连接身体各部分的组织）。"},"examples":[{"en":"The surgeon noted fibro-connective changes around the scar.","zh":"外科医生指出疤痕周围出现了纤维性结缔组织的改变。"},{"en":"Fibro-connective tissue helps hold organs in place.","zh":"纤维性结缔组织有助于把器官固定在适当位置。"},{"en":"On the report, the mass was described as fibro-connective in nature.","zh":"在报告中，该肿块被描述为纤维性结缔组织性质。"}]}],"synonyms":["fibroconnective","fibrous","connective"],"phonetic":"/ˌfaɪbroʊ kəˈnɛktɪv/","extraExplanation":["这是医学/解剖学里的形容词，常用来描述组织学特征。临床写作里更常见不加连字符的写法“fibroconnective”（或写作“fibro-connective tissue”指纤维性结缔组织）。","“fibro-”表示“纤维”，常见于 fibroblast（成纤维细胞）、fibrosis（纤维化）等词。"]}
{"word":"fibro-fatty","summary":{"en":"Fibro-fatty means made of or involving both fibrous tissue and fat, especially in medical contexts.","zh":"fibro-fatty 指同时含有纤维组织与脂肪组织的（多用于医学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing a mixture of fibrous (scar-like) tissue and fat; made up of both fiber and fatty tissue (often used in medical descriptions).","zh":"（常用于医学）含有纤维组织（类似瘢痕）和脂肪组织的；由纤维与脂肪组织混合构成的。"},"examples":[{"en":"The report described fibro-fatty tissue in the muscle.","zh":"报告描述肌肉中存在纤维-脂肪组织。"},{"en":"Doctors noted fibro-fatty replacement after long-term injury.","zh":"医生指出长期损伤后出现纤维-脂肪替代。"},{"en":"A biopsy showed fibro-fatty changes in the affected area.","zh":"活检显示患处出现纤维-脂肪性改变。"}]}],"synonyms":["fibrofatty","fibrous-and-fatty","fibroadipose"],"phonetic":"/ˌfaɪbroʊ ˈfæti/","extraExplanation":["“fibro-”表示“纤维的/纤维组织”，与“fatty（脂肪的）”用连字符连接，常见于病理或影像学描述（如fibro-fatty change/replacement），强调两种组织成分混在一起。","日常英语中较少单独使用，更多出现在医疗报告、学术文章或检验结果里。"]}
{"word":"fibro-hemorrhagic","summary":{"en":"A medical adjective describing tissue or findings that show both fibrous change and bleeding.","zh":"医学形容词：描述组织或检查所见同时具有纤维性改变与出血特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) involving both fibrous tissue (scar-like tissue) and bleeding.","zh":"（医学）同时涉及纤维性组织（类似瘢痕的组织）和出血的。"},"examples":[{"en":"The pathologist reported a fibro-hemorrhagic lesion in the lung tissue.","zh":"病理科医生报告肺组织中存在纤维性-出血性病变。"},{"en":"CT results suggested fibro-hemorrhagic changes after the injury.","zh":"CT结果提示受伤后出现纤维性-出血性改变。"}]}],"synonyms":["fibrosing and hemorrhagic","fibrotic-hemorrhagic","fibrohemorrhagic"],"phonetic":"/ˌfaɪbroʊ ˌhɛməˈrædʒɪk/","extraExplanation":["这是一个医学复合形容词，常用于病理报告或影像学描述：fibro- 表示“纤维/纤维化（纤维性组织增多）”，hemorrhagic 表示“出血性的”。合在一起强调组织同时有纤维化（或纤维组织增生）与出血两种特征。","写法上常见带连字符（fibro-hemorrhagic），也可能见到不带连字符的写法（fibrohemorrhagic），但临床与学术文本中带连字符更清晰。","注意它多用于描述“改变/病变/渗出/积液”等（例如 fibro-hemorrhagic effusion：纤维性-出血性胸腔积液），属于专业语域，日常英语中很少使用。"]}
{"word":"fibro-mucous","summary":{"en":"A medical adjective meaning “fibrous and mucous; involving both fibrous tissue and mucus.”","zh":"医学形容词，表示“纤维性的且黏液性的；同时含纤维组织与黏液成分的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) relating to or made of both fibrous tissue and mucus; having a fibrous-and-mucus-like character.","zh":"（医学）与纤维组织和黏液都有关的；由纤维成分与黏液成分共同构成的；呈“纤维＋黏液”特征的。"},"examples":[{"en":"The pathology report described a fibro-mucous polyp.","zh":"病理报告描述为“纤维-黏液性息肉”。"},{"en":"Doctors noted a fibro-mucous discharge during the exam.","zh":"检查时医生记录到纤维-黏液性分泌物。"},{"en":"The lesion had a fibro-mucous surface texture.","zh":"该病灶表面质地呈纤维-黏液样。"}]}],"synonyms":["fibromucous","mucous and fibrous","fibrous-mucoid"],"phonetic":"/ˌfaɪbroʊ ˈmjuːkəs/","extraExplanation":["这是偏医学/病理学用语，常用来修饰组织、息肉（polyp）、分泌物（discharge）或炎症产物，强调“既有纤维成分（fibro-）又有黏液成分（mucous）”。","写法上常见连字符 fibro-mucous；在一些文献中也可能见到不加连字符的 fibromucous。","mucous（黏液的）是形容词；不要和 mucus（黏液，名词）混淆。"]}
{"word":"fibro-nuclear","summary":{"en":"A technical adjective meaning ‘involving fibrous tissue and cell nuclei,’ used mainly in medical/biological contexts.","zh":"一个技术性形容词，指“同时涉及纤维组织与细胞核”，主要用于医学/生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving both fibrous (connective) tissue and cell nuclei, especially in medical or biological descriptions (e.g., in histology or pathology).","zh":"（多用于医学/生物学）与纤维组织（结缔组织）和细胞核都有关的；涉及纤维成分与核成分的。"},"examples":[{"en":"The report described a fibro-nuclear pattern under the microscope.","zh":"报告描述了显微镜下的纤维-核性形态/模式。"},{"en":"Some stains help highlight fibro-nuclear details in tissue sections.","zh":"某些染色方法有助于突出组织切片中的纤维-核性细节。"}]}],"synonyms":["fibronuclear","fibrous-and-nuclear","connective-tissue-and-nuclear"],"phonetic":"/ˌfaɪbroʊˈnuːkliɚ/","extraExplanation":["这是一个非常专业且不常见的复合形容词，由 fibro-（纤维、纤维组织）+ nuclear（核的/细胞核的）组成，常见于组织学、病理学等语境，用来强调“纤维成分”和“细胞核相关特征”同时被关注。","英语里用连字符（fibro-nuclear）常见于临时性的专业组合词；在不同文献中也可能写作 fibronuclear 或 fibro nuclear，具体以作者/期刊用法为准。"]}
{"word":"fibro-osseous","summary":{"en":"A medical adjective meaning “involving both fibrous tissue and bone.”","zh":"一个医学形容词，表示“同时涉及纤维组织与骨组织（纤维—骨性）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) relating to or made of both fibrous tissue and bone; describing a lesion or condition where normal bone is replaced by fibrous tissue that may later harden into bone.","zh":"（医学）纤维—骨性的；与纤维组织和骨组织都有关的；指正常骨被纤维组织替代，且可能逐渐骨化的病变/状况。"},"examples":[{"en":"The dentist noted a fibro-osseous lesion on the jaw X-ray.","zh":"牙医在颌骨X光片上发现了一个纤维—骨性病变。"},{"en":"Fibro-osseous changes can be seen in some benign bone conditions.","zh":"在一些良性骨疾病中可以看到纤维—骨性改变。"}]}],"synonyms":["fibrous-and-bony","fibro-bony","ossifying (context-dependent)"],"phonetic":"/ˌfaɪbroʊ ˈɑsiəs/","extraExplanation":["这是一个医学/牙科/病理学常用的复合形容词：fibro-（纤维的）+ osseous（骨的）。常用于描述“纤维组织与骨样组织混合或相互替代”的影像学或病理学表现，而不是日常口语。","在口腔颌面部领域，常见相关类别包括“纤维性骨营养不良（fibrous dysplasia）”和“骨化性纤维瘤（ossifying fibroma）”等；具体诊断通常需要结合影像、临床表现与病理结果。"]}
{"word":"fibro-tuberculosis","summary":{"en":"Fibro-tuberculosis is a medical term for tuberculosis associated with fibrous scarring, often describing chronic or old (healed) TB changes in the lungs.","zh":"fibro-tuberculosis 是医学用语，指与纤维化瘢痕相关的结核病改变，常用于描述肺部慢性或陈旧（已愈合）结核的纤维化表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of tuberculosis (usually in the lungs) in which long-term infection leads to scarring and fibrous tissue formation, often seen in chronic or healed lesions","zh":"一种（多见于肺部的）结核病类型，因长期感染而出现瘢痕与纤维化组织增生，常见于慢性或愈合后的病灶"},"examples":[{"en":"The chest X-ray suggested old fibro-tuberculosis with scarring in the upper lobes.","zh":"胸部X光提示上叶有瘢痕，考虑陈旧性纤维性结核。"},{"en":"In the report, “fibro-tuberculosis” referred to chronic, scar-forming lung changes after infection.","zh":"在报告中，“纤维性结核”指的是感染后出现的慢性、形成瘢痕的肺部改变。"}]}],"synonyms":["fibrotic tuberculosis","post-tuberculous fibrosis","old (healed) TB with fibrosis"],"phonetic":"/ˌfaɪbroʊ tuˌbɝːkjəˈloʊsɪs/","extraExplanation":["该词较偏医学/病理学用语：fibro- 表示“纤维/纤维化”，tuberculosis 为“结核病”。在现代临床沟通中，更常见的表达可能是“fibrotic TB（纤维化结核）”“post‑TB fibrosis（结核后纤维化）”或“old/healed TB with fibrosis（陈旧/愈合结核伴纤维化）”。","历史上结核（TB）曾被称为“consumption（肺痨/痨病）”，而“纤维性/纤维化”相关描述常用于强调病变的慢性、瘢痕化特征。具体含义仍需结合影像学与病理学语境解读。"]}
{"word":"fibroadenia","summary":{"en":"“Fibroadenia” is a rare/nonstandard term; most often people mean “fibroadenoma,” a benign breast lump.","zh":"“fibroadenia”较少见且不太规范；多数情况下指的是“fibroadenoma（纤维腺瘤）”，一种良性乳房肿块。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard medical term sometimes used to refer to a benign (non-cancerous) breast lump made of fibrous and glandular tissue; in modern English, people usually mean “fibroadenoma.”","zh":"一个较少见或不规范的医学用词，有时用来指由纤维组织和腺体组织构成的良性（非癌性）乳房肿块；现代英语中更常用、也更准确的说法是“fibroadenoma（纤维腺瘤）”。"},"examples":[{"en":"The report mentioned “fibroadenia,” but the doctor clarified it was a fibroadenoma.","zh":"报告里写了“fibroadenia”，但医生说明其实是纤维腺瘤（fibroadenoma）。"},{"en":"She was told the lump was likely benign, such as a fibroadenoma, not cancer.","zh":"她被告知这个肿块很可能是良性的，比如纤维腺瘤，而不是癌症。"}]}],"synonyms":["fibroadenoma","benign breast lump"],"phonetic":"/ˌfaɪbroʊæˈdiːniə/","extraExplanation":["“fibroadenia”在常见医学英语里并不标准，临床与论文中更常见的是“fibroadenoma（纤维腺瘤）”。如果你是在化验单、病理报告或超声结果中看到它，建议向医生确认原词拼写与具体诊断。","构词理解：fibro-（纤维）+ adeno-（腺体）组合常见于医学词汇；但以 -oma（肿瘤/肿块）结尾的“fibroadenoma”是更规范的病名。"]}
{"word":"fibroadenoma","summary":{"en":"A fibroadenoma is a common benign breast lump made of fibrous and glandular tissue.","zh":"fibroadenoma 指常见的良性乳房肿块（纤维腺瘤），由纤维与腺体组织组成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common, noncancerous (benign) breast lump made of fibrous and glandular tissue, often found in younger women and usually smooth, firm, and movable.","zh":"纤维腺瘤：一种常见的良性乳房肿块，由纤维组织和腺体组织组成，常见于较年轻女性，通常触感光滑、较硬、可推动。"},"examples":[{"en":"The doctor said the lump was likely a fibroadenoma and recommended an ultrasound to confirm.","zh":"医生说这个肿块很可能是纤维腺瘤，并建议做超声检查来确认。"},{"en":"Many fibroadenomas stay the same size or grow very slowly and don’t require surgery.","zh":"许多纤维腺瘤大小保持不变或生长很慢，不一定需要手术。"},{"en":"She felt a small, rubbery, movable mass that turned out to be a fibroadenoma.","zh":"她摸到一个小的、像橡皮一样、有弹性且可推动的肿块，结果是纤维腺瘤。"}]}],"synonyms":["benign breast lump","breast fibroadenoma"],"phonetic":"/ˌfaɪbroʊˌædəˈnoʊmə/","extraExplanation":["词源提示：fibro- 表示“纤维的”，aden(o)- 表示“腺体”，-oma 表示“肿瘤/肿块”（医学上常用于“肿块”的名称，未必代表恶性）。","学习提示：在英语医疗语境里，fibroadenoma 通常与 “benign (良性)”“breast lump (乳房肿块)”“ultrasound/mammogram/biopsy（超声/钼靶/活检）”等词一起出现。","文化与沟通：讨论乳房肿块时，英语中常用较中性的表达，例如 “a lump/mass” 和 “benign,” 以减少恐慌；医生也常强调 “most are not cancer” 来安抚患者情绪。"]}
{"word":"fibroadipose","summary":{"en":"Fibroadipose describes tissue composed of both fibrous connective tissue and fat.","zh":"fibroadipose 用于描述由纤维结缔组织与脂肪组织混合构成的组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Relating to tissue that contains both fibrous (connective) tissue and fat (adipose) tissue; made up of a mixture of fiber-like tissue and fat.","zh":"（医学）纤维脂肪的；指同时含有纤维（结缔）组织和脂肪（脂肪组织）的组织；由纤维组织与脂肪组织混合构成。"},"examples":[{"en":"The ultrasound report mentioned a fibroadipose mass in the breast.","zh":"超声报告提到乳房内有一个纤维脂肪性肿块。"},{"en":"The surgeon removed a small piece of fibroadipose tissue for biopsy.","zh":"外科医生切取了一小块纤维脂肪组织进行活检。"},{"en":"Microscopy showed fibroadipose tissue with mild inflammation.","zh":"显微镜下显示纤维脂肪组织伴轻度炎症。"}]}],"synonyms":["fibrofatty","fibroadipose tissue"],"phonetic":"/ˌfaɪbroʊˈædəˌpoʊs/","extraExplanation":["“fibroadipose”常见于影像学报告和病理报告中，用来描述组织成分，而不一定表示恶性。它通常是对“组织里既有纤维结缔组织、也有脂肪组织”的客观描述。","构词提示：fibro-（纤维/结缔组织）+ adipose（脂肪的）。在医学英语里，这类复合词常用于说明组织的组成。"]}
{"word":"fibroangioma","summary":{"en":"Fibroangioma is a medical term for a benign tumor composed of fibrous tissue and blood vessels.","zh":"Fibroangioma 指由纤维组织和血管构成的良性肿瘤（医学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a noncancerous (benign) tumor made up of fibrous tissue and blood vessels; often used in medical contexts as a descriptive term","zh":"（医学）纤维血管瘤：由纤维组织和血管组成的良性肿瘤，常作为描述性医学术语使用"},"examples":[{"en":"The pathology report described the lump as a fibroangioma, meaning it was benign.","zh":"病理报告将这个肿块描述为纤维血管瘤，意味着它是良性的。"},{"en":"Doctors may recommend monitoring a fibroangioma if it isn’t causing symptoms.","zh":"如果纤维血管瘤没有引起症状，医生可能会建议先观察随访。"}]}],"synonyms":["benign tumor","vascular-fibrous tumor"],"phonetic":"/ˌfaɪbroʊændʒiˈoʊmə/","extraExplanation":["这是偏专业的病理/临床用词：fibro- 表示“纤维”，angio- 表示“血管”，-oma 表示“肿瘤”。它强调组织成分（纤维+血管），不等同于“癌”。","不同器官/部位的具体诊断名称可能更常用（例如某些场景更常见的术语是与乳腺相关的“fibroadenoma/纤维腺瘤”，含义不完全相同）。遇到此词最好结合检查部位与病理报告上下文理解。","日常英语中很少出现；多见于医学论文、影像/病理报告或医生沟通。"]}
{"word":"fibroangiomatous","summary":{"en":"A medical adjective meaning “fibrous and blood-vessel (angioma-like) in nature.”","zh":"医学形容词，指“具有纤维组织与血管（血管瘤样）成分的；纤维血管性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to (or made up of) a mixture of fibrous tissue and blood-vessel (angiomatous) tissue; fibrovascular in nature.","zh":"与纤维组织和血管（血管瘤样）组织的混合有关的；呈纤维血管性（纤维+血管）特征的。"},"examples":[{"en":"The biopsy showed fibroangiomatous tissue with no signs of cancer.","zh":"活检显示为纤维血管瘤样组织，未见癌变迹象。"},{"en":"Doctors described the mass as a fibroangiomatous growth.","zh":"医生将该肿块描述为纤维血管瘤样增生。"},{"en":"The report noted fibroangiomatous changes in the breast tissue.","zh":"报告指出乳腺组织存在纤维血管瘤样改变。"}]}],"synonyms":["fibrovascular","angiomatous"],"phonetic":"/ˌfaɪbroʊˌændʒioʊˈmeɪtəs/","extraExplanation":["这是偏医学/病理学用语，常见于检查报告（如活检、病理结果）中，用来描述组织成分或外观，并不直接等同于某一种具体疾病；是否良性/恶性需要结合部位、影像、细胞异型性等信息综合判断。","词素拆解：fibro-（纤维）+ angio-（血管）+ -omatous（“像肿瘤/肿块那样的、呈……样”的形容词后缀）。","相关近义表达：fibrovascular（纤维血管性的）、angiomatous（血管瘤样的）。医学写作中有时会用这些词来强调血管成分或纤维成分的比例。"]}
{"word":"fibroareolar","summary":{"en":"Fibroareolar describes tissue that combines fibrous and areolar (loose connective) components.","zh":"fibroareolar 用于描述由纤维组织与疏松结缔组织共同构成或与之相关的组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to (or made up of) fibrous tissue and areolar (loose connective) tissue together.","zh":"（组织）与纤维组织和疏松结缔组织（蜂窝组织）有关的；由两者共同构成的。"},"examples":[{"en":"The report described a fibroareolar layer beneath the skin.","zh":"报告描述了皮肤下方有一层纤维—疏松结缔组织层。"},{"en":"Surgeons carefully separated the fibroareolar tissue to reach the deeper structures.","zh":"外科医生小心分离纤维—疏松结缔组织，以到达更深层结构。"}]}],"synonyms":["fibrous-and-areolar","fibro-connective (context-dependent)"],"phonetic":"/ˌfaɪbroʊ əˈriːələr/","extraExplanation":["这是偏医学/解剖学用词，常见于手术记录、影像/病理描述中，用来概括一种“纤维成分 + 疏松结缔组织成分”并存的组织质地。","areolar 在这里不是“乳晕”的意思，而是指“疏松结缔组织（areolar connective tissue）”。不过在乳房相关的医学语境里也可能同时出现乳晕（areola）等词，阅读时要注意区分。"]}
{"word":"fibroblast","summary":{"en":"A fibroblast is a connective-tissue cell that makes collagen and helps repair tissues.","zh":"fibroblast（成纤维细胞）是一种制造胶原蛋白并参与组织修复的结缔组织细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of cell in connective tissue that makes collagen and other fibers; it helps build and repair skin and other tissues","zh":"一种结缔组织细胞，会制造胶原蛋白等纤维；帮助构建并修复皮肤及其他组织"},"examples":[{"en":"Fibroblasts produce collagen, which gives skin strength and structure.","zh":"成纤维细胞会产生胶原蛋白，使皮肤更有强度和结构。"},{"en":"After an injury, fibroblasts help repair the damaged tissue.","zh":"受伤后，成纤维细胞会帮助修复受损组织。"},{"en":"Some anti-aging treatments aim to stimulate fibroblasts to make more collagen.","zh":"一些抗老化疗法希望刺激成纤维细胞制造更多胶原蛋白。"}]}],"synonyms":["connective-tissue cell","collagen-producing cell"],"phonetic":"/ˈfaɪbroʊˌblæst/","extraExplanation":["词源拆解：fibro- 表示“纤维”，-blast 表示“未成熟/形成中的细胞”。因此 fibroblast 可理解为“形成纤维的细胞”。","学习提示：在医学或护肤语境里，你常会看到“collagen（胶原蛋白）”“connective tissue（结缔组织）”“wound healing（伤口愈合）”与 fibroblast 一起出现。"]}
{"word":"fibroblast-related","summary":{"en":"“Fibroblast-related” means connected with fibroblasts, especially in biomedical contexts (genes, pathways, or changes involving these cells).","zh":"“fibroblast-related”表示“与成纤维细胞有关的”，多用于生物医学语境，指涉及成纤维细胞的基因、通路或变化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with fibroblasts (cells in connective tissue that make collagen and help form and repair the body’s structural framework).","zh":"与成纤维细胞相关的（成纤维细胞是结缔组织中的细胞，负责生成胶原蛋白，并参与组织结构形成与修复）。"},"examples":[{"en":"Researchers measured fibroblast-related gene activity during wound healing.","zh":"研究人员在伤口愈合过程中测量了与成纤维细胞相关的基因活性。"},{"en":"The report discusses fibroblast-related changes in skin aging.","zh":"该报告讨论了皮肤老化中与成纤维细胞相关的变化。"}]}],"synonyms":["fibroblast-associated","fibroblast-linked","related to fibroblasts"],"phonetic":"/ˈfaɪbroʊˌblæst rɪˈleɪtɪd/","extraExplanation":["这是一个医学/生物学里常见的复合形容词：fibroblast（成纤维细胞）+ related（相关的）。常用于学术写作中修饰名词，如 fibroblast-related genes/markers/pathways/inflammation（与成纤维细胞相关的基因/标志物/通路/炎症）。","写法上有时也会看到不加连字符的 fibroblast related（较少见且更像临时搭配）；在正式出版物里用连字符 fibroblast-related 更清晰。"]}
{"word":"fibroblastic","summary":{"en":"Fibroblastic means related to fibroblasts or their activity, especially in tissue repair or scarring.","zh":"fibroblastic 指与成纤维细胞及其活动有关，常用于描述组织修复或瘢痕相关变化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to fibroblasts (cells that make connective tissue) or to the growth/activity of fibroblasts, especially in healing or scarring.","zh":"与成纤维细胞（制造结缔组织的细胞）有关的；指成纤维细胞的生长/活动（常见于愈合或瘢痕形成）。"},"examples":[{"en":"The report described a fibroblastic response during wound healing.","zh":"报告描述了伤口愈合过程中的成纤维细胞反应。"},{"en":"Microscopy showed fibroblastic cells in the tissue sample.","zh":"显微镜下在组织样本中看到了成纤维样细胞。"}]}],"synonyms":["fibroblast-related","connective-tissue (context-dependent)","fibrogenic (near meaning in some medical contexts)"],"phonetic":"/ˌfaɪbroʊˈblæstɪk/","extraExplanation":["“fibroblastic”多见于医学/病理学语境，如“fibroblastic proliferation（成纤维细胞增生）”“fibroblastic tumor（成纤维细胞性肿瘤）”。它通常是描述组织学表现的专业形容词，日常英语中不常用。","词根提示：fibro-（纤维）+ -blast（未成熟细胞/能生成某类组织的细胞）+ -ic（形容词后缀）。了解“fibroblast（成纤维细胞）”会更容易记住这个词。"]}
{"word":"fibrobronchitis","summary":{"en":"A medical term for bronchitis involving fibrous tissue (fibro-), typically used in clinical or pathology contexts.","zh":"医学用语：指伴有纤维组织参与/纤维化倾向的支气管炎，常见于临床或病理语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the bronchial tubes (airways in the lungs) involving fibrous tissue, often associated with persistent irritation or infection.","zh":"纤维性支气管炎：支气管（肺部气道）的炎症，并伴有纤维组织增生/参与，常与长期刺激或感染有关。"},"examples":[{"en":"The doctor suspected fibrobronchitis because his cough had lasted for weeks.","zh":"医生怀疑是纤维性支气管炎，因为他的咳嗽已经持续了好几周。"},{"en":"Smoking can irritate the airways and may contribute to chronic bronchial inflammation, including fibrobronchitis.","zh":"吸烟会刺激气道，可能促成慢性支气管炎症，包括纤维性支气管炎。"}]}],"synonyms":["bronchitis","chronic bronchitis","bronchial inflammation"],"phonetic":"/ˌfaɪbroʊbrɑŋˈkaɪtɪs/","extraExplanation":["这是偏医学/病理学用语：fibro- 表示“纤维（组织）”，bronch- 表示“支气管”，-itis 表示“炎症”。整体意思就是“支气管的炎症，且伴随纤维化/纤维组织增多”。","日常英语里更常见的说法是 bronchitis（支气管炎）。若看到 fibrobronchitis，多出现在病理报告、医学论文或较正式的临床记录中。","它不是自我诊断用词；如果出现持续咳嗽、痰多、喘鸣、胸闷或发热等症状，应由医生结合查体、听诊、影像学（如胸片/CT）和病史来判断。"]}
{"word":"fibrocalcareous","summary":{"en":"Fibrocalcareous describes tissue that is both fibrous and calcified (has calcium deposits), often seen in old or chronic lesions on imaging.","zh":"fibrocalcareous 指“纤维化并伴钙化”的组织改变，影像学中常用于描述旧病灶或慢性病变的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing both fibrous (scar-like or connective) tissue and calcium deposits; partly hardened by calcification.","zh":"含有纤维组织（类似瘢痕/结缔组织）并伴有钙盐沉积的；因钙化而部分变硬的。"},"examples":[{"en":"The X-ray showed a fibrocalcareous lesion in the upper lung.","zh":"X光显示上肺部有一个纤维钙化性病灶。"},{"en":"Doctors described the nodule as fibrocalcareous, suggesting an old healed infection.","zh":"医生将这个结节描述为纤维钙化性，提示可能是既往感染愈合后的改变。"}]}],"synonyms":["fibrocalcific","calcified","fibrotic"],"phonetic":"/ˌfaɪbroʊˌkælˈkɛriəs/","extraExplanation":["这是医学/影像学中较常见的形容词，多用来描述“纤维化（fibro-）+钙化（-calcareous）”并存的组织改变，常见于旧病灶、慢性炎症或既往感染愈合后留下的痕迹。","词形拆解：fibro- 表示“纤维/纤维组织”，calcareous 表示“含钙的/石灰质的”。在报告里看到该词时，通常是在描述外观或成分，并不单独等同于某一种疾病诊断。"]}
{"word":"fibrocalcific","summary":{"en":"A medical adjective meaning “fibrous and calcified,” often used in imaging/pathology reports.","zh":"医学形容词，意为“纤维化并伴钙化”，常见于影像学/病理学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Having both fibrous tissue (scar-like tissue) and calcification (calcium deposits); describing changes in tissue that become scarred and partly hardened by calcium.","zh":"（医学）纤维化并伴随钙化的；用于描述组织出现瘢痕样纤维组织增生，同时有钙盐沉积、变硬的改变。"},"examples":[{"en":"The CT scan showed fibrocalcific changes in the upper lobe.","zh":"CT显示上叶有纤维钙化性改变。"},{"en":"Fibrocalcific plaques can be seen in long-standing inflammation.","zh":"在长期炎症中可见纤维钙化性斑块。"},{"en":"The report described a fibrocalcific nodule consistent with an old infection.","zh":"报告描述了一个纤维钙化性结节，提示可能是陈旧感染所致。"}]}],"synonyms":["fibrotic and calcified","calcified scarred","fibrocalcified"],"phonetic":"ˌfaɪbroʊkælˈsɪfɪk","extraExplanation":["这是一个常见于影像学/病理学报告的描述性术语，多用于肺部（如“fibrocalcific scarring/changes”提示陈旧感染或旧病灶）、血管斑块等场景。它通常强调“既有纤维瘢痕，又有钙化硬化”的组合特征，而不是一个独立疾病名称。","词形可拆解理解：fibro-（纤维）+ calcific（钙化的）。临床语境中常与“scar/scarring（瘢痕）”“changes（改变）”“plaque（斑块）”“nodule（结节）”等词搭配。"]}
{"word":"fibrocarcinoma","summary":{"en":"A medical term for a carcinoma with a prominent fibrous tissue component.","zh":"医学术语：指含有明显纤维组织成分的癌瘤（癌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare type of cancer (carcinoma) in which the tumor has a prominent fibrous (scar-like) tissue component; often used in pathology to describe how the cancer looks under a microscope","zh":"一种较少见的癌（癌瘤）：肿瘤中含有明显的纤维性（类似疤痕的）组织成分；常用于病理学描述其在显微镜下的形态特征"},"examples":[{"en":"The pathology report mentioned fibrocarcinoma, indicating a carcinoma with a strong fibrous component.","zh":"病理报告提到“fibrocarcinoma”，表示这是一种具有明显纤维组织成分的癌瘤。"},{"en":"Because fibrocarcinoma is uncommon, the doctor requested a second review of the biopsy slides.","zh":"由于 fibrocarcinoma 较少见，医生请求对活检切片进行二次复核。"}]}],"synonyms":["carcinoma with fibrous stroma","fibrous carcinoma","scirrhous carcinoma"],"phonetic":"/ˌfaɪbroʊˌkɑrˈsɪnoʊmə/","extraExplanation":["这是医学/病理学术语，多见于检验报告或学术论文中，一般不用于日常对话。词形可拆分理解：fibro-（纤维）+ carcinoma（癌/癌瘤）。","不同医院或专科可能更常用更具体的诊断名称（例如按器官或亚型命名）。若在报告中看到该词，通常需要结合肿瘤来源部位、分期、免疫组化等信息由医生解释。"]}
{"word":"fibrocartilage","summary":{"en":"Fibrocartilage is a very strong cartilage that supports joints and absorbs shock.","zh":"纤维软骨是一种非常结实的软骨，能为关节提供支撑并起到缓冲减震作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tough, strong type of cartilage made with lots of collagen fibers, found where the body needs extra support and shock absorption.","zh":"一种坚韧、强度高的软骨，含有较多胶原纤维，常见于需要额外支撑与缓冲减震的部位。"},"examples":[{"en":"The intervertebral discs are made largely of fibrocartilage, which helps absorb shock when you move.","zh":"椎间盘主要由纤维软骨构成，有助于在运动时吸收冲击。"},{"en":"A tear in the knee’s meniscus can damage fibrocartilage and cause pain or swelling.","zh":"膝关节半月板的撕裂会损伤纤维软骨，并引起疼痛或肿胀。"}]}],"synonyms":["cartilage (general)","meniscal cartilage (context-specific)"],"phonetic":"/ˌfaɪ.broʊˈkɑr.t̬ə.lɪdʒ/","extraExplanation":["词源提示：fibro- 表示“纤维的”，cartilage 表示“软骨”。合起来强调“纤维含量多、因此更结实”的软骨类型。","常见位置（帮助记忆）：椎间盘、耻骨联合（pubic symphysis）、膝关节半月板（meniscus）。它比“透明软骨（hyaline cartilage）”更耐拉扯，但通常没有那么“光滑”。"]}
{"word":"fibrocartilage-related","summary":{"en":"“Fibrocartilage-related” means involving or connected to fibrocartilage, a tough cartilage found in places like spinal discs and knee menisci.","zh":"“fibrocartilage-related”指与纤维软骨有关的；纤维软骨是一种较坚韧的软骨，常见于椎间盘和膝关节半月板等部位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, involving, or caused by fibrocartilage (a tough, fibrous type of cartilage found in structures like spinal discs and knee menisci).","zh":"与纤维软骨有关的；涉及纤维软骨的；由纤维软骨引起的（纤维软骨是一种坚韧、含较多纤维的软骨，常见于椎间盘、膝关节半月板等）。"},"examples":[{"en":"The MRI report mentioned a fibrocartilage-related injury in the knee meniscus.","zh":"核磁共振报告提到膝关节半月板存在与纤维软骨相关的损伤。"},{"en":"Doctors often discuss fibrocartilage-related pain when talking about problems in the spine’s intervertebral discs.","zh":"医生谈到脊柱椎间盘问题时，常会讨论与纤维软骨相关的疼痛。"}]}],"synonyms":["related to fibrocartilage","fibrocartilaginous (technical)","meniscal (context-specific)","disc-related (context-specific)"],"phonetic":"/ˌfaɪbroʊˈkɑr.tɪ.lɪdʒ rɪˈleɪ.tɪd/","extraExplanation":["“fibrocartilage-related”是医学/解剖学写作中常见的复合形容词：fibrocartilage（纤维软骨）+ related（相关的）。日常英语里更常写成“related to fibrocartilage”或直接用更具体的部位表达，如“meniscus injury（半月板损伤）”“disc degeneration（椎间盘退变）”。","纤维软骨与透明软骨（如鼻、气管等处的软骨）不同：它更“硬、更抗拉”，因此常出现在需要承受压力和牵拉的部位。阅读医学材料时，看到该词往往意味着“与承重/缓冲结构有关”。"]}
{"word":"fibrocartilaginous","summary":{"en":"Fibrocartilaginous means “made of or related to fibrocartilage,” a tough, shock-absorbing tissue found in places like intervertebral discs.","zh":"fibrocartilaginous 指“由纤维软骨构成的/与纤维软骨有关的”，常用于描述如椎间盘等既强韧又能缓冲的组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of or relating to fibrocartilage (a tough tissue that contains both strong fibrous tissue and cartilage, often found where extra strength and shock absorption are needed).","zh":"由纤维软骨构成的；与纤维软骨有关的（纤维软骨是一种兼具强韧纤维组织与软骨成分的组织，常见于需要更强支撑与缓冲的部位）。"},"examples":[{"en":"The intervertebral discs are fibrocartilaginous structures that help absorb shock in the spine.","zh":"椎间盘是纤维软骨性结构，能帮助脊柱吸收冲击。"},{"en":"A tear in the fibrocartilaginous ring of the disc can cause pain and limited movement.","zh":"椎间盘的纤维软骨环发生撕裂可能导致疼痛和活动受限。"},{"en":"The labrum is partly fibrocartilaginous, which helps deepen the joint socket.","zh":"盂唇部分为纤维软骨性组织，有助于加深关节窝。"}]}],"synonyms":["fibrocartilage-related","fibrocartilage (as a related term)"],"phonetic":"/ˌfaɪbroʊˌkɑrˈtɪlədʒənəs/","extraExplanation":["“fibro-”表示“纤维”，而“cartilaginous”表示“软骨的”。合在一起强调这种组织“既有纤维的强度，又有软骨的弹性与缓冲”。","常见搭配：fibrocartilaginous tissue（纤维软骨组织）, fibrocartilaginous disc（纤维软骨盘/椎间盘）, fibrocartilaginous ring（纤维软骨环，常指椎间盘纤维环）。","这是医学/解剖学用语，在日常英语中不常见；多出现在体检报告、影像学描述或医学教材里。"]}
{"word":"fibrocaseose","summary":{"en":"A medical adjective describing tissue that is both fibrous and caseous (cheese-like), often in tuberculosis.","zh":"医学形容词：指组织既纤维化又呈干酪样坏死，常见于结核相关描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having both fibrous tissue and “caseous” (cheese-like) necrosis, often describing certain tuberculosis lesions.","zh":"（医学）既有纤维化组织，又有“干酪样”（类似奶酪的）坏死，常用于描述某些结核病灶。"},"examples":[{"en":"The CT scan suggested a fibrocaseous lesion in the upper lobe, so tuberculosis was considered.","zh":"CT 扫描提示上叶存在纤维干酪样病灶，因此考虑结核感染。"},{"en":"In advanced disease, doctors may describe areas of fibrocaseous change in the lungs.","zh":"在疾病进展较重时，医生可能会描述肺部出现纤维干酪样改变。"}]}],"synonyms":["fibro-caseous","caseofibrotic (rare)"],"phonetic":"/ˌfaɪbroʊˈkeɪziəs/","extraExplanation":["“fibrocaseose”更常见于葡语/意大利语等语境；英语里更标准的对应词通常是 **fibrocaseous**。其中 **fibro-** 表示“纤维（化）”，**caseous** 来自拉丁语 *caseus*（奶酪），用于形容结核等疾病中“干酪样坏死”的外观。","该词多见于病理学/影像学报告或结核病相关文献；日常英语很少使用。"]}
{"word":"fibrocaseous","summary":{"en":"Fibrocaseous describes a medical lesion with both fibrous scarring and caseous (cheese-like) necrosis, often linked to tuberculosis.","zh":"Fibrocaseous 指同时具有纤维化（瘢痕）与干酪样坏死的医学病变，常与结核相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having both fibrous tissue and caseous (“cheese-like”) necrosis, especially describing certain chronic infections such as tuberculosis.","zh":"（医学）纤维化与干酪样（“奶酪样”）坏死并存的，常用于描述结核等慢性感染的病变。"},"examples":[{"en":"The biopsy showed a fibrocaseous lesion consistent with chronic tuberculosis.","zh":"活检显示纤维干酪样病灶，符合慢性结核的表现。"},{"en":"Chest imaging suggested fibrocaseous changes in the upper lobes.","zh":"胸部影像提示上叶存在纤维干酪样改变。"}]}],"synonyms":["fibro-caseous (variant spelling)","fibrotic and caseous","caseofibrotic (rare)"],"phonetic":"/ˌfaɪbroʊˈkeɪʃəs/","extraExplanation":["“caseous”源自拉丁语 caseus（奶酪），在病理学里用来形容坏死组织外观呈碎屑状、类似奶酪的质地；“fibro-”表示纤维组织增生/瘢痕形成。两者合起来常见于结核病灶：一部分组织被破坏形成干酪样坏死，周围则出现纤维化包裹或修复。","该词多见于病理报告、影像学描述或医学论文中，日常英语很少使用。"]}
{"word":"fibrocellular","summary":{"en":"A medical adjective meaning “fibrous and cellular,” used to describe tissue that contains both fibrous material and cells.","zh":"医学形容词，意为“纤维性且细胞性的”，描述同时含纤维成分与细胞成分的组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of or involving fibrous tissue and cells (often used in medicine/pathology to describe healing tissue, scars, or certain lesions).","zh":"（多用于医学/病理学）由纤维组织和细胞组成的；与纤维组织及细胞增生有关的。"},"examples":[{"en":"The biopsy showed fibrocellular tissue consistent with a healing scar.","zh":"活检显示为纤维细胞性组织，与正在愈合的瘢痕相符。"},{"en":"Doctors described the mass as a fibrocellular lesion rather than a fluid-filled cyst.","zh":"医生将该肿块描述为纤维细胞性病变，而不是充满液体的囊肿。"}]}],"synonyms":["fibrous and cellular","fibroblastic (context-dependent)"],"phonetic":"/ˌfaɪbroʊˈsɛljələr/","extraExplanation":["这是一个医学复合词：fibro- 表示“纤维/纤维组织”，cellular 表示“细胞的”。合起来强调“纤维成分 + 细胞成分”同时存在，常见于病理报告（如瘢痕形成、肉芽组织、某些增生/肿瘤性病变的描述）。","在英文医学写作里，-cellular 往往用来描述“细胞丰富/以细胞为主”的特征；fibrous 更偏“以纤维为主”。fibrocellular 则介于二者之间，表示既有明显纤维又有一定细胞性。"]}
{"word":"fibrocement","summary":{"en":"Fibrocement is fiber-reinforced cement used for tough building boards and exterior surfaces.","zh":"Fibrocement 指纤维增强水泥材料，常用于坚固耐用的建筑板材与外墙等部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A building material made from cement reinforced with fibers (often cellulose), used for durable boards and panels, especially for exterior cladding and roofing.","zh":"一种建筑材料，由水泥加入纤维（常见为纤维素）增强制成，常用于耐用的板材与面板，尤其用于外墙挂板和屋面材料。"},"examples":[{"en":"They chose fibrocement siding because it resists rot and insects.","zh":"他们选择了纤维水泥外墙挂板，因为它耐腐烂、抗虫害。"},{"en":"The contractor installed fibrocement panels on the exterior for better weather protection.","zh":"承包商在外立面安装了纤维水泥板，以获得更好的防风雨保护。"}]}],"synonyms":["fiber cement","fiber-cement","fibre cement"],"phonetic":"/ˌfaɪbɚˈsiːmɛnt/","extraExplanation":["“fibrocement”常见于建材、装修语境，也常写作“fibre cement / fiber cement”（英式/美式拼写）。在英语里更常用的说法是“fiber-cement”或“fiber cement”。","早期某些“fiber cement”产品曾使用石棉纤维（asbestos）增强；现代许多国家/地区的产品多改用纤维素等更安全的纤维。阅读旧房屋资料或翻新说明时，若看到相关字样需要留意年代与安全规范。"]}
{"word":"fibrochondral","summary":{"en":"A medical adjective meaning “related to fibrous tissue and cartilage (fibrocartilage).”","zh":"医学形容词，表示“与纤维组织和软骨（纤维软骨）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both fibrous connective tissue and cartilage (especially fibrocartilage).","zh":"与纤维性结缔组织和软骨（尤其是纤维软骨）有关的；纤维软骨性的。"},"examples":[{"en":"The doctor suspected a fibrochondral injury near the joint.","zh":"医生怀疑关节附近有纤维软骨性损伤。"},{"en":"MRI showed changes in the fibrochondral tissue of the intervertebral disc.","zh":"核磁共振显示椎间盘的纤维软骨组织出现了改变。"}]}],"synonyms":["fibrocartilaginous","fibrocartilage-related"],"phonetic":"/ˌfaɪbroʊˈkɑːndrəl/","extraExplanation":["这是一个医学/解剖学用语，常见于论文或影像学报告中，用来描述“纤维组织（fibro-）+软骨（-chondral）”的结构或病变。常与椎间盘、关节唇（labrum）、半月板（meniscus）等含纤维软骨的部位相关。","拼写结构提示：fibro- 表示“纤维”，chondr- 来自希腊语，表示“软骨”。日常英语中较少使用，更常见于专业语境。"]}
{"word":"fibrochondritis","summary":{"en":"A medical term meaning inflammation of fibrocartilage.","zh":"医学术语，指纤维软骨的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of fibrocartilage (a tough cartilage found in places like spinal discs, the meniscus in the knee, and the pubic symphysis).","zh":"纤维软骨的炎症（纤维软骨是一种坚韧的软骨，常见于椎间盘、膝关节半月板、耻骨联合等部位）。"},"examples":[{"en":"The doctor considered fibrochondritis as a possible cause of the patient’s chronic joint pain.","zh":"医生将纤维软骨炎作为患者慢性关节疼痛的可能原因之一。"},{"en":"Imaging tests may help distinguish fibrochondritis from other types of cartilage injury.","zh":"影像学检查可能有助于将纤维软骨炎与其他软骨损伤区分开来。"}]}],"synonyms":["fibrocartilage inflammation","chondritis (broader term)"],"phonetic":"/ˌfaɪbroʊˌkɑːnˈdraɪtɪs/","extraExplanation":["这是一个较少见、偏医学书面语的词。词形可拆解为：fibro-（纤维的）+ chondr-（软骨）+ -itis（炎症）。遇到类似结构的医学词汇时，-itis 通常表示“炎症”，有助于快速理解大意。"]}
{"word":"fibrochondroma","summary":{"en":"Fibrochondroma is a rare, usually benign tumor composed of fibrous tissue and cartilage.","zh":"Fibrochondroma 指一种罕见、通常为良性的由纤维组织和软骨组成的肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare, usually benign (non-cancerous) tumor made of fibrous tissue and cartilage","zh":"一种罕见、通常为良性（非癌性）的肿瘤，由纤维组织和软骨组织构成"},"examples":[{"en":"The pathology report described the mass as a fibrochondroma.","zh":"病理报告将该肿块描述为纤维软骨瘤。"},{"en":"Doctors often confirm a suspected fibrochondroma with imaging and a biopsy.","zh":"医生通常会通过影像检查和活检来确认疑似纤维软骨瘤。"}]}],"synonyms":["chondroma (related term)","fibroma (related term)"],"phonetic":"/ˌfaɪbroʊˈkɑndroʊmə/","extraExplanation":["这是偏医学/病理学用语，在日常英语里几乎不会出现。临床上通常需要由病理切片来最终诊断。","词形可拆解理解：fibro-（纤维的）+ chondro-（软骨的）+ -oma（肿瘤）。看到 -oma 结尾时，常提示“肿瘤/瘤样增生”的医学名词。","若你是在报告或论文中看到该词，建议同时核对上下文与影像/病理描述，因为不同资料对相关软骨肿瘤的分类与命名可能略有差异。"]}
{"word":"fibrochondrosteal","summary":{"en":"A rare medical adjective meaning “involving fibrous tissue, cartilage, and bone.”","zh":"较少见的医学形容词，意为“涉及纤维组织、软骨与骨组织的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to (or composed of) fibrous tissue, cartilage, and bone—often describing a structure, lesion, or developmental process that involves all three tissue types.","zh":"与纤维组织、软骨与骨组织有关的（或由三者构成的）——常用于描述同时涉及这三类组织的结构、病变或发育过程。"},"examples":[{"en":"The report described a fibrochondrosteal mass near the joint.","zh":"报告描述关节附近有一个纤维-软骨-骨性的肿块。"},{"en":"In some injuries, healing can create fibrochondrosteal tissue at the attachment site.","zh":"在某些损伤中，愈合时可能在附着点形成纤维-软骨-骨性组织。"}]}],"synonyms":["fibrocartilaginous","osteochondral","fibrochondral"],"phonetic":"/ˌfaɪbroʊˌkɑːndroʊˈstiːl/","extraExplanation":["这是一个较少见的医学/解剖学形容词，常见于专业文献而不太会出现在日常英语中。","词形可拆解理解：fibro-（纤维）、chondro-（软骨）、-steal（与骨有关，来自 osteal 的构词形式）。有时也会写作 fibro-chondro-osteal 来更清楚地显示来源。"]}
{"word":"fibroconnective","summary":{"en":"Fibroconnective means “related to fibrous connective tissue,” mainly used in medical contexts.","zh":"fibroconnective 指“与纤维性结缔组织有关”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to fibrous connective tissue (the tough, collagen-rich tissue that supports and connects parts of the body).","zh":"与纤维性结缔组织有关的（富含胶原蛋白、坚韧，用于支撑并连接身体组织的组织）。"},"examples":[{"en":"The report noted fibroconnective tissue around the healed wound.","zh":"报告指出愈合的伤口周围有纤维性结缔组织。"},{"en":"Fibroconnective changes can appear after long-term inflammation.","zh":"长期炎症后可能出现纤维性结缔组织的改变。"}]}],"synonyms":["fibrous","connective-tissue (related)","fibroblastic (in some contexts)"],"phonetic":"/ˌfaɪbroʊkəˈnɛktɪv/","extraExplanation":["“fibro-”表示“纤维的”，与纤维（尤其是胶原纤维）相关；“connective”指“结缔组织”。这个词多见于病理报告、医学论文或解剖学语境，日常英语里更常说“fibrous connective tissue（纤维性结缔组织）”。","在医学语境中，“fibroconnective tissue”常用来描述瘢痕/纤维化（scar/fibrosis）相关的组织增生或修复过程。"]}
{"word":"fibrocrystalline","summary":{"en":"A technical adjective meaning “fibrous and crystal-like.”","zh":"一个技术性形容词，意思是“既呈纤维状又呈结晶状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having both fibrous (stringy, connective-tissue-like) and crystalline (crystal-like) structure or components.","zh":"同时具有纤维状（类似结缔组织的丝状结构）与结晶状（类似晶体的结构）成分或特征的。"},"examples":[{"en":"The microscope showed a fibrocrystalline texture in the damaged tissue.","zh":"显微镜下可以看到受损组织呈现纤维—结晶样的质地。"},{"en":"Researchers described the deposit as fibrocrystalline material mixed with proteins.","zh":"研究人员将该沉积物描述为与蛋白质混合的纤维—结晶样物质。"}]}],"synonyms":["fibrous-crystalline","fibrous and crystalline","crystal-fibrous"],"phonetic":"/ˌfaɪbroʊˈkrɪstəlaɪn/","extraExplanation":["这是一个较少见的科学/医学形容词，由 fibro-（纤维、纤维组织）+ crystalline（结晶的）构成，常用于描述在显微镜或材料分析中观察到的“既像纤维又像晶体”的结构（例如某些病理性沉积物、组织改变或材料表面形态）。","它通常不是日常英语词汇，更常见于论文、病理报告、材料科学或生物医学语境中。"]}
{"word":"fibrocyst","summary":{"en":"“Fibrocystic” describes a medical condition involving fibrous tissue and cysts, most often referring to benign breast changes.","zh":"“Fibrocystic”指与纤维组织和囊肿有关的医学情况，最常用于描述良性的乳腺纤维囊性改变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having or relating to fibrous tissue and cysts, especially in the breast (as in “fibrocystic breast changes”).","zh":"（医学）与纤维组织和囊肿有关的，尤指乳房的（如“乳腺纤维囊性改变”）。"},"examples":[{"en":"Many people experience fibrocystic breast changes that can cause tenderness before a period.","zh":"很多人会出现乳腺纤维囊性改变，经期前可能会觉得乳房胀痛。"},{"en":"Her doctor said the lump felt consistent with fibrocystic changes, not cancer.","zh":"医生说这个肿块触感更像纤维囊性改变，而不是癌症。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medical, less common) A fibrocyst: a cyst-like area associated with fibrous tissue; often used as a shortened form in clinical notes.","zh":"（医学，较少见）纤维囊肿：与纤维组织相关的囊性区域；在临床记录中有时作为简写使用。"},"examples":[{"en":"The report mentioned small fibrocysts on ultrasound.","zh":"报告提到超声下可见小的纤维囊性囊肿。"}]}],"synonyms":["cystic","fibrous","benign breast changes (phrase)"],"phonetic":"/ˌfaɪbroʊˈsɪstɪk/","extraExplanation":["你输入的“fibrocyst”更常见于“fibrocystic（纤维囊性的）”这个形容词，尤其是在“fibrocystic breast changes（乳腺纤维囊性改变）”这一固定医学表达中。日常英语里单独说“fibrocyst”并不常见，多见于医疗语境或简写。","词源拆解有助记忆：fibro- 表示“纤维（纤维组织）”，cyst 表示“囊肿/囊”。"]}
{"word":"fibrocystic","summary":{"en":"Fibrocystic means “fibrous and cyst-like,” especially referring to common, usually benign breast tissue changes that may cause lumps or tenderness.","zh":"Fibrocystic 指“纤维性并伴囊性改变的”，常指乳腺常见且通常良性的组织改变，可能引起结节感或胀痛。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Having or involving fibrous tissue and cysts; most commonly used in the phrase “fibrocystic breast changes,” a benign (non-cancerous) condition that can cause lumpy or tender breasts.","zh":"（医学）纤维组织与囊肿并存的；最常用于“fibrocystic breast changes（乳腺纤维囊性改变）”，一种良性（非癌性）情况，可能导致乳房触感结节或胀痛。"},"examples":[{"en":"My doctor said the lumps were due to fibrocystic breast changes, not cancer.","zh":"医生说这些结节是乳腺纤维囊性改变造成的，不是癌症。"},{"en":"Fibrocystic tissue can feel more tender before a period.","zh":"纤维囊性组织在月经前可能会更胀痛。"},{"en":"If the pain becomes severe, ask your clinician whether the symptoms might be fibrocystic and what to do next.","zh":"如果疼痛变得明显加重，建议询问临床医生是否可能是纤维囊性改变，以及下一步该怎么处理。"}]}],"synonyms":["cystic","benign (in this context)","noncancerous (in this context)"],"phonetic":"/ˌfaɪbroʊˈsɪstɪk/","extraExplanation":["“fibro-”表示“纤维（组织）的”，来自拉丁语系词根；“cystic”表示“囊肿的/囊性的”，与“cyst（囊肿）”相关。组合起来强调“纤维增生 + 囊性改变”这两种特征同时存在。","在日常英语里，单独说“fibrocystic”通常不完整，最常见搭配是“fibrocystic breast changes / fibrocystic breasts”。医学沟通中也会看到“fibrocystic disease”，但现代更倾向用“changes”来避免让人误以为是严重疾病。","注意：它通常是良性的描述词，但任何新的、持续的或明显变化的乳房肿块都应由专业人士评估。"]}
{"word":"fibrocystoma","summary":{"en":"A rare medical term for a usually benign tumor made of fibrous and cyst-like tissue.","zh":"一种较少见的医学术语，指通常为良性的、由纤维组织和囊样结构组成的肿块。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a benign (non-cancerous) tumor or lump made up of fibrous tissue and cyst-like spaces; a rare medical term often used in pathology descriptions.","zh":"一种良性（非癌性）肿块/肿瘤，由纤维组织与囊样（充满液体的）腔隙构成；属较少见的医学/病理学用语。"},"examples":[{"en":"The pathology report described the mass as a fibrocystoma with no signs of malignancy.","zh":"病理报告将该肿块描述为纤维囊性瘤，未见恶性征象。"},{"en":"Because a fibrocystoma is usually benign, treatment may depend on symptoms and location.","zh":"由于纤维囊性瘤通常为良性，是否治疗常取决于症状与发生部位。"}]}],"synonyms":["fibrocystic tumor","benign fibrocystic mass"],"phonetic":"/ˌfaɪbroʊˈsɪstoʊmə/","extraExplanation":["词源拆解：fibro- 表示“纤维”，cyst- 表示“囊/囊肿”，-oma 表示“肿瘤/肿块”。合起来就是“由纤维组织与囊样结构构成的肿块”。","使用提醒：该词在日常英语中很少见，多见于医学语境（如病理报告、医学论文）。不同器官或不同作者可能会用更常见的术语来描述类似病变，因此遇到时最好结合具体部位与报告上下文理解。"]}
{"word":"fibrocyte","summary":{"en":"A fibrocyte is a connective-tissue cell involved in maintaining fibrous tissue (especially collagen) and, in some contexts, a circulating cell that can aid repair and scarring.","zh":"fibrocyte 指参与维持纤维性结缔组织（尤其胶原）的细胞；在某些语境中也可指可在血中循环、参与修复与瘢痕形成的细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of connective-tissue cell that helps maintain and produce the fibrous framework (like collagen) in tissues; often considered a mature, less active form related to a fibroblast.","zh":"一种结缔组织细胞，帮助维持并产生组织中的纤维性支架（如胶原）；常被视为与成纤维细胞相关、较成熟且活性较低的形式。"},"examples":[{"en":"Fibrocytes help keep connective tissue strong by maintaining collagen fibers.","zh":"纤维细胞通过维持胶原纤维来帮助结缔组织保持强韧。"},{"en":"Under the microscope, the fibrocyte looks flatter and less active than a fibroblast.","zh":"在显微镜下，纤维细胞看起来比成纤维细胞更扁平、活性更低。"}]},{"partOfSpeech":"n.","definition":{"en":"In some medical research contexts, a circulating (blood-borne) cell that can move into damaged tissue and contribute to scarring and repair.","zh":"在一些医学研究语境中，指一种可在血液中循环、进入受损组织并参与瘢痕形成与修复的细胞。"},"examples":[{"en":"Some studies suggest circulating fibrocytes can contribute to fibrosis in chronic disease.","zh":"一些研究提示，循环纤维细胞可能会促进慢性疾病中的纤维化。"},{"en":"After injury, fibrocytes may migrate to the wound site and support tissue repair.","zh":"受伤后，纤维细胞可能迁移到伤口部位并支持组织修复。"}]}],"synonyms":["connective-tissue cell","(related) fibroblast","circulating fibrocyte"],"phonetic":"/ˈfaɪbroʊˌsaɪt/","extraExplanation":["词源拆解：fibro- 表示“纤维”，-cyte 表示“细胞”，合起来就是“纤维（相关的）细胞”。","学习提示：不同教材/论文里 fibrocyte 的用法可能不完全一致——在组织学里常指“较成熟、较不活跃的纤维细胞”；在免疫/纤维化研究里也可能特指“循环纤维细胞（circulating fibrocyte）”。阅读时可结合上下文（组织切片 vs. 血液/炎症/纤维化）。"]}
{"word":"fibrocytic","summary":{"en":"Fibrocytic means “related to fibrocytes,” especially in medical or pathology contexts.","zh":"fibrocytic 指“与纤维细胞有关的”，多用于医学/病理学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to fibrocytes (mature connective-tissue cells) or to tissue/cells characterized by fibrocytes.","zh":"与纤维细胞（成熟的结缔组织细胞）有关的；或指以纤维细胞为特征的组织/细胞。"},"examples":[{"en":"The biopsy showed fibrocytic changes consistent with scar tissue.","zh":"活检显示纤维细胞样改变，与瘢痕组织相符。"},{"en":"Fibrocytic activity can be seen during the later stages of wound healing.","zh":"在伤口愈合的后期阶段可见纤维细胞相关的活动。"}]}],"synonyms":["fibrocellular (related, context-dependent)","fibrous (broader, more general)"],"phonetic":"/ˌfaɪbroʊˈsɪtɪk/","extraExplanation":["“fibrocytic”多见于医学/病理学语境，属于较专业的形容词。日常英语里更常用“fibrous（纤维性的）”来描述组织外观或质地。","fibrocyte（纤维细胞）通常指较成熟、较安静的结缔组织细胞；fibroblast（成纤维细胞）则更“活跃”，参与生成胶原、修复组织。某些报告里用“fibrocytic”暗示细胞形态更接近成熟纤维细胞。"]}
{"word":"fibroelastic","summary":{"en":"“Fibroelastic” describes tissue or material that is fibrous and also elastic.","zh":"fibroelastic 指“既含纤维成分又具有弹性”的组织或材料特性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to fibrous tissues and their elastic (stretch-and-return) properties.","zh":"与纤维组织及其弹性（可拉伸并回弹）的性质有关的。"},"examples":[{"en":"The therapist explained that the scar tissue became more fibroelastic over time.","zh":"治疗师解释说，疤痕组织会随着时间推移变得更具纤维弹性。"},{"en":"Certain ligaments have a fibroelastic structure that allows controlled movement.","zh":"某些韧带具有纤维弹性结构，使关节能进行可控的运动。"}]}],"synonyms":["fibrous and elastic","elastic-fibrous"],"phonetic":"/ˌfaɪbroʊɪˈlæstɪk/","extraExplanation":["这是一个偏医学/生物学的形容词，常见于解剖学、病理学、组织工程等语境。","词由两部分组成：fibro-（纤维、纤维组织）+ elastic（有弹性的）。它强调“含纤维成分且具有弹性”的特征，而不仅仅是“柔软”或“有弹性”。","近似相关词：fibrocartilage（纤维软骨）、fibrosis（纤维化，通常指病理性增生）、elastic tissue（弹性组织）。注意：fibroelastic 多用于描述组织性质，不太用于日常物品。"]}
{"word":"fibroenchondroma","summary":{"en":"Fibroenchondroma is a rare, usually benign tumor composed of both fibrous tissue and cartilage.","zh":"Fibroenchondroma（纤维软骨瘤）是一种罕见、通常为良性的肿瘤，由纤维组织与软骨组织共同组成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare, usually benign (non-cancerous) tumor made of both fibrous tissue and cartilage, often considered a combination of a fibroma and an enchondroma.","zh":"一种罕见、通常为良性（非癌性）的肿瘤，由纤维组织和软骨组织共同构成，常被视为“纤维瘤（fibroma）+ 软骨瘤（enchondroma）”的组合。"},"examples":[{"en":"The biopsy suggested a fibroenchondroma with no signs of malignancy.","zh":"活检结果提示为纤维软骨瘤，未见恶性表现。"},{"en":"The doctor explained that fibroenchondroma is uncommon and may be monitored if it is not causing symptoms.","zh":"医生解释说纤维软骨瘤并不常见，如果没有症状，可能只需要随访观察。"}]}],"synonyms":["benign fibrocartilaginous tumor","fibroma with enchondroma components"],"phonetic":"/ˌfaɪbroʊɛnˈkɑːndroʊmə/","extraExplanation":["这是医学/病理学用词，日常英语里几乎不用；常见于影像学报告或病理诊断中。","词形可拆解理解：fibro- 表示“纤维”，en- + chondro- 与“软骨”相关，-oma 表示“肿瘤”。","如果你在报告里看到这个词，通常需要结合部位（例如骨/软组织）、影像表现和病理结果来判断是否需要手术或随访。"]}
{"word":"fibroenteric","summary":{"en":"A medical adjective meaning “related to fibrous tissue and the intestines.”","zh":"医学形容词：指“与纤维组织和肠道有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to fibrous tissue and the intestines (enteric), especially used in medical descriptions (e.g., adhesions, fistulas, or connective tissue involving the gut).","zh":"与纤维组织（纤维性组织）和肠道（肠的、肠相关）有关的，多用于医学描述（如粘连、瘘管或涉及肠道的结缔组织改变）。"},"examples":[{"en":"The surgeon noted fibroenteric adhesions during the operation.","zh":"外科医生在手术中发现了纤维性肠粘连。"},{"en":"Imaging suggested a fibroenteric fistula connecting the bowel to nearby tissue.","zh":"影像学提示存在纤维性肠瘘，与附近组织相通。"}]}],"synonyms":["fibrous-enteric","intestinal (context-dependent)","enteric (broader)"],"phonetic":"/ˌfaɪbroʊˈɛn.tə.rɪk/","extraExplanation":["这是一个医学复合词：fibro- 表示“纤维/纤维组织”（如纤维化 fibrosis），enteric 来自 enter- 表示“肠”，-ic 表示“……的”。因此 fibroenteric 直译为“纤维-肠的/与纤维组织和肠有关的”。","该词多见于专业文献或病历记录，日常英语中很少使用。非医学语境通常会改说 fibrous intestinal tissue（肠道纤维组织）或 intestinal adhesions（肠粘连）等更直白的表达。"]}
{"word":"fibrofatty","summary":{"en":"Fibrofatty describes tissue that contains both fibrous (scar-like) and fatty components, commonly used in medical imaging and pathology.","zh":"Fibrofatty 指含有纤维（瘢痕样）与脂肪两种成分的组织，常用于医学影像和病理描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Made up of both fibrous tissue and fat; containing a mixture of connective (fibrous) tissue and fatty tissue.","zh":"（医学）由纤维组织和脂肪组织共同组成的；含有纤维组织与脂肪组织混合成分的。"},"examples":[{"en":"The MRI showed fibrofatty replacement in part of the muscle.","zh":"核磁共振显示该肌肉部分出现了纤维脂肪性替代。"},{"en":"The surgeon noted fibrofatty tissue around the damaged area.","zh":"外科医生记录到受损区域周围有纤维脂肪性组织。"}]}],"synonyms":["fibrofatty (replacement)","fibro-fatty","fibroadipose","fibroadipose tissue"],"phonetic":"/ˌfaɪbroʊˈfæti/","extraExplanation":["“fibrofatty”常见于影像学报告（如MRI、CT）和病理描述中，用来说明组织成分既有“纤维化”（fibro-，更坚韧、瘢痕样）也有“脂肪”（fatty，更柔软、脂肪沉积）。","在某些疾病语境里，它可能暗示正常组织被“纤维+脂肪”成分替代（例如某些心肌或肌肉相关的疾病描述），但具体含义需结合部位、检查方式与医生结论。","词形结构：fibro-（纤维）+ fatty（脂肪的）。在临床写作中也可见连字符写法“fibro-fatty”。"]}
{"word":"fibroferrite","summary":{"en":"Fibroferrite is a rare iron sulfate-hydroxide mineral that often forms yellow-brown fibrous crusts in oxidized iron-rich settings, especially near mines.","zh":"Fibroferrite（纤维铁矾）是一种较罕见的铁的硫酸盐-氢氧化物矿物，常在富铁环境的氧化带（尤其矿区附近）形成黄褐色纤维状结皮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral made mainly of iron sulfate and hydroxide, often forming yellow-brown fibrous crusts in oxidized iron-rich environments (such as mine areas).","zh":"一种较罕见的矿物，主要由铁的硫酸盐与氢氧化物组成，常在富铁环境的氧化带（如矿区）形成黄褐色的纤维状壳层或结皮。"},"examples":[{"en":"Fibroferrite can appear as a yellow-brown, fibrous coating on rock surfaces near old mines.","zh":"在一些废旧矿区附近，纤维铁矾常以黄褐色的纤维状薄层覆盖在岩石表面。"},{"en":"The geologist identified fibroferrite as a secondary mineral formed during the oxidation of sulfides.","zh":"地质学家把纤维铁矾鉴定为硫化物氧化过程中形成的次生矿物。"}]}],"synonyms":["iron sulfate mineral","secondary iron mineral"],"phonetic":"/ˌfaɪbroʊˈfɛraɪt/","extraExplanation":["词源提示：fibro- 表示“纤维状的”，ferrite 来自拉丁语 ferrum “铁”。因此 fibroferrite 字面意思可理解为“纤维状的含铁矿物”。","语境提示：这是矿物学/地质学术语，在日常英语中几乎不使用；常见于矿物鉴定报告、矿区环境描述和学术文章中。"]}
{"word":"fibrogenic","summary":{"en":"Fibrogenic describes something that causes or encourages fibrosis (formation of fibrous scar-like tissue).","zh":"Fibrogenic 指“致纤维化的”，即会引起或促进纤维化（纤维性瘢痕组织形成）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing or promoting the formation of fibrous tissue (fibrosis), especially in the lungs.","zh":"引起或促进纤维组织形成（纤维化）的，尤指肺部。"},"examples":[{"en":"Long-term exposure to fibrogenic dust can lead to lung disease.","zh":"长期接触致纤维化粉尘可能导致肺部疾病。"},{"en":"Silica is a fibrogenic material that can scar lung tissue.","zh":"二氧化硅是一种可致纤维化的物质，可能使肺组织形成瘢痕。"}]}],"synonyms":["fibrosis-inducing","pro-fibrotic","fibrotic (context-dependent)"],"phonetic":"/ˌfaɪbroʊˈdʒɛnɪk/","extraExplanation":["词源提示：-genic 表示“产生……的/引起……的”（如 carcinogenic 致癌的、pathogenic 致病的）；fibro- 与“纤维/纤维组织”有关。合起来 fibrogenic 就是“引起纤维组织增生/纤维化的”。","常见语境：多用于医学、职业卫生与毒理学文献，常搭配 dust/particles/materials（粉尘/颗粒/材料）以及 exposure（暴露）出现。与 fibrous（纤维状的）不同，fibrogenic 强调“会导致纤维化的作用”。"]}
{"word":"fibroglia","summary":{"en":"Fibroglia refers to supportive glial cells in the central nervous system, often meaning astroglia (astrocytes).","zh":"Fibroglia 指中枢神经系统中的支持性胶质细胞，常用于指星形胶质（星形胶质细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of supportive cell in the central nervous system with many fiber-like processes; commonly refers to astroglia (astrocytes).","zh":"（中枢神经系统的）纤维胶质细胞；一种具有纤维状突起的支持细胞，常指星形胶质（星形胶质细胞）。"},"examples":[{"en":"Fibroglia help support and protect neurons in the brain and spinal cord.","zh":"纤维胶质细胞有助于在大脑和脊髓中支持并保护神经元。"},{"en":"In many modern texts, “fibroglia” is discussed under the term astroglia.","zh":"在许多现代教材中，“fibroglia（纤维胶质）”常归在“astroglia（星形胶质）”这一术语下讨论。"}]}],"synonyms":["astroglia","astrocyte","glial cell","neuroglia"],"phonetic":"/ˌfaɪbroʊˈɡliə/","extraExplanation":["这是一个偏专业、偏旧的神经科学用词，在日常英语里很少见。现代更常用的相关词是 astroglia / astrocyte（星形胶质/星形胶质细胞）。","在阅读不同年代的医学或生物学资料时，你可能会看到 fibroglia 被用来强调“纤维状（fibrous）突起”的胶质细胞特征。"]}
{"word":"fibroglioma","summary":{"en":"Fibroglioma is a rare, outdated medical term for a tumor involving fibrous and gland-/glial-like tissue; modern medicine usually uses more specific names.","zh":"Fibroglioma 是一种罕见且较过时的医学术语，泛指含纤维成分并呈腺样/胶质样特征的肿瘤；现代医学通常改用更具体的诊断名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, older medical term for a tumor thought to be made of fibrous tissue and gland-like tissue; today it is not commonly used and may be replaced by more specific diagnoses.","zh":"一种较旧、较少使用的医学术语，指被认为由纤维组织与腺样组织构成的肿瘤；现代医学中较少使用，通常会被更具体的诊断名称取代。"},"examples":[{"en":"The old pathology report described the mass as a fibroglioma, but the hospital now uses newer classification terms.","zh":"这份旧的病理报告把肿块描述为 fibroglioma，但医院现在使用更新的分类术语。"},{"en":"Because the term is outdated, the doctor recommended reviewing the original tissue slides for a modern diagnosis.","zh":"由于这个术语已较为过时，医生建议复查原始切片，以得到符合现代标准的诊断。"}]}],"synonyms":["tumor","neoplasm (general term)","glioma (related root; not identical)"],"phonetic":"ˌfaɪbroʊˈɡlaɪoʊmə","extraExplanation":["这个词看起来由三部分组成：fibro-（纤维）、glio-（胶质/神经胶质，常见于“glioma 胶质瘤”一类词）、-oma（肿瘤）。历史上有些文献会用它来描述“带纤维成分的肿瘤”。但在现代病理学与肿瘤分类体系中，更倾向用更精确的名称（例如依据组织来源、免疫组化和分子特征）来诊断，因此你在新教材/新报告中很少见到它。","如果你在病历或论文里遇到该词，通常需要结合具体部位（例如脑、皮肤、软组织等）、显微镜描述和检测结果，才能判断它在当时作者语境里对应的现代诊断是什么。"]}
{"word":"fibrohemorrhagic","summary":{"en":"A medical adjective meaning “both fibrous and bleeding-related.”","zh":"医学形容词：同时具有“纤维性”和“出血性”特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) describing tissue, fluid, or inflammation that involves both fibrous (scar-like) material and bleeding (hemorrhage).","zh":"（医学）形容组织、渗出物或炎症同时具有纤维性（类似瘢痕/纤维蛋白样）成分和出血（ hemorrhage ）特征。"},"examples":[{"en":"The pathologist noted a fibrohemorrhagic exudate on the pleural surface.","zh":"病理医生记录到胸膜表面有纤维性-出血性的渗出物。"},{"en":"CT findings suggested fibrohemorrhagic changes after the injury.","zh":"CT 所见提示损伤后出现纤维性-出血性改变。"}]}],"synonyms":["fibrous and hemorrhagic","fibro-hemorrhagic (hyphenated)","hemorrhagic with fibrosis"],"phonetic":"/ˌfaɪbroʊˌhɛmɚˈhædʒɪk/","extraExplanation":["这是一个相对专业的复合形容词：fibro- 表示“纤维/纤维化”，hemorrhagic 表示“出血性的”。常见于病理报告、影像学描述或炎症渗出物的描述，用来强调“既有纤维成分又伴随出血”。","在一些语境中 fibro- 可能指“纤维蛋白（fibrin-）样”或“纤维化（fibrosis）”相关改变；具体含义通常由上下文（如 exudate、tissue、membrane）和检查结果决定。"]}
{"word":"fibroid","summary":{"en":"“Fibroid” most commonly means a benign growth, especially a uterine fibroid; it can also mean fibrous or fiber-like (medical use).","zh":"fibroid 最常指良性肿块，尤其是子宫肌瘤；也可作形容词表示“纤维的/纤维样的”（多用于医学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A noncancerous (benign) growth made of muscle and fibrous tissue, most commonly found in the uterus.","zh":"（通常为子宫）肌肉与纤维组织构成的良性（非癌性）肿块。"},"examples":[{"en":"Many people have uterine fibroids and never notice any symptoms.","zh":"很多人有子宫肌瘤却从未出现明显症状。"},{"en":"Her doctor said the fibroid was benign but could cause heavy periods.","zh":"医生说这个肌瘤是良性的，但可能会导致经血量增多。"},{"en":"An ultrasound showed a fibroid pressing on the bladder.","zh":"超声检查显示一个肌瘤压迫到了膀胱。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to fibers or fibrous tissue; fiber-like.","zh":"纤维的；与纤维组织有关的；呈纤维状的。"},"examples":[{"en":"The report mentioned fibroid changes in the tissue.","zh":"报告提到该组织出现了纤维样改变。"},{"en":"Under the microscope, the sample looked more fibroid than normal.","zh":"在显微镜下，这份样本看起来比正常组织更纤维化。"}]}],"synonyms":["leiomyoma","uterine fibroid","benign tumor","fibrous"],"phonetic":"/ˈfaɪˌbrɔɪd/","extraExplanation":["日常英语里，fibroid 最常见的用法是名词，几乎默认指“子宫肌瘤”（uterine fibroid）。医学沟通中也常用复数 fibroids。","如果你在医疗场景听到 fibroid，通常会涉及症状（如经量增多、腹痛、压迫感）、检查（如 ultrasound/超声）、以及治疗选择（如观察、药物、手术等）。具体情况需要由医生评估。"]}
{"word":"fibroids","summary":{"en":"Fibroids are benign growths in or on the uterus, often called uterine fibroids.","zh":"Fibroids 指子宫内或子宫表面的良性肿块，常称子宫肌瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Noncancerous (benign) growths made of muscle and fibrous tissue that develop in or on the uterus (womb).","zh":"子宫内或子宫表面生长的良性（非癌性）肿块，由肌肉和纤维组织构成（常称“子宫肌瘤”）。"},"examples":[{"en":"Many people have fibroids and never notice any symptoms.","zh":"很多人有子宫肌瘤却从未出现明显症状。"},{"en":"Her doctor explained that fibroids can sometimes cause heavy periods.","zh":"医生解释说，子宫肌瘤有时会导致经量过多。"},{"en":"An ultrasound showed several small fibroids in her uterus.","zh":"超声检查显示她的子宫里有几个较小的肌瘤。"}]}],"synonyms":["uterine fibroids","uterine myomas","leiomyomas"],"phonetic":"/ˈfaɪ.brɔɪdz/","extraExplanation":["“Fibroids”通常指“uterine fibroids（子宫肌瘤）”，医学上也叫“leiomyomas”。在日常英文里，说“fibroids”时多默认与子宫相关。","语境提示：英语里谈到该词时常会配合症状（heavy periods 经量多、pelvic pain 骨盆疼痛、pressure 压迫感）或检查/治疗（ultrasound 超声、medication 用药、surgery 手术）来说明。","用词辨析：fibroid（单数）= 一个肌瘤；fibroids（复数）更常见，因为很多人会同时有多个肌瘤。"]}
{"word":"fibroin","summary":{"en":"Fibroin is the main protein in silk fibers, valued for being strong, smooth, and useful in biomaterials.","zh":"Fibroin 是丝纤维中的主要蛋白质，因其强度与光滑性而受到重视，也常用于生物材料领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein that makes up the main structural fiber of silk, produced by silkworms and some spiders","zh":"丝心蛋白；丝纤维蛋白（构成蚕丝等丝纤维的主要结构蛋白，也见于部分蜘蛛丝）"},"examples":[{"en":"Silk is largely made of fibroin, which gives it strength and smoothness.","zh":"蚕丝主要由丝心蛋白构成，这使它既结实又光滑。"},{"en":"Researchers study fibroin to create biodegradable medical stitches.","zh":"研究人员研究丝心蛋白，用来制造可降解的医用缝合线。"}]}],"synonyms":["silk protein","silk fibroin"],"phonetic":"/ˈfaɪbrɔɪn/","extraExplanation":["“fibroin”常出现在生物学、材料科学与医学材料语境中，比如“silk fibroin（丝心蛋白）”用于组织工程支架、药物缓释载体等。","读词小提示：词根“fibro-”常与“纤维”有关（如 fibrosis 纤维化），帮助你把它和“纤维状蛋白”联系起来。"]}
{"word":"fibroins","summary":{"en":"Fibroins are the main structural proteins in silk fiber (plural of fibroin).","zh":"Fibroins 是丝纤维的主要结构蛋白（fibroin 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fibroins: proteins that make up most of silk fiber, produced mainly by silkworms and some spiders.","zh":"丝心蛋白（复数）：构成丝纤维主要成分的蛋白质，主要由蚕（家蚕）以及一些蜘蛛产生。"},"examples":[{"en":"Silk is largely made of fibroins, which give it strength and shine.","zh":"丝绸主要由丝心蛋白构成，这使它具有强度和光泽。"},{"en":"Researchers study spider fibroins to develop strong, lightweight materials.","zh":"研究人员研究蜘蛛的丝心蛋白，以开发强韧而轻质的材料。"}]}],"synonyms":["silk proteins","structural proteins (in silk)"],"phonetic":"/ˈfaɪbroʊˌɪnz/","extraExplanation":["“fibroin”常见于生物学、材料科学与纺织相关语境。日常英语里更常说“silk protein(s)”或直接说“silk is made of protein”。","丝主要由两类蛋白组成：fibroin（丝心蛋白，形成纤维核心，负责强度）和 sericin（丝胶蛋白，像“胶水”一样把纤维黏在一起）。在丝绸加工中常说“degumming（脱胶）”，就是去除 sericin。"]}
{"word":"fibrointestinal","summary":{"en":"A medical adjective meaning “involving fibrous (scar-like) tissue in the intestines.”","zh":"医学形容词，指“肠道出现纤维性（瘢痕样）组织/纤维化改变”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to fibrous (scar-like) tissue and the intestines; describing intestinal changes involving fibrosis.","zh":"与纤维性（瘢痕样）组织和肠道有关的；用于描述肠道出现纤维化改变的。"},"examples":[{"en":"The CT scan suggested a fibrointestinal stricture in the small bowel.","zh":"CT 显示小肠可能存在纤维化相关的肠狭窄。"},{"en":"Doctors considered fibrointestinal involvement as a cause of the patient’s recurrent obstruction.","zh":"医生考虑肠道纤维化受累可能是患者反复梗阻的原因。"}]}],"synonyms":["fibroenteric","fibrotic (intestinal)","fibrostenotic (context-dependent)"],"phonetic":"ˌfaɪbroʊɪnˈtɛstənl","extraExplanation":["这是一个医学/病理学语境中偶见的形容词，并不常见于日常英语。更常见的相关表达包括 fibrostenotic（纤维性狭窄的）、fibrotic stricture（纤维性狭窄）、intestinal fibrosis（肠道纤维化）或 fibroenteric（纤维-肠道的）。在克罗恩病等慢性炎症性肠病中，医生可能用它来强调“纤维化（疤痕）+ 肠道”这一特征。"]}
{"word":"fibrokeratinous","summary":{"en":"Fibrokeratinous describes tissue that is tough and fibrous because it contains keratin.","zh":"Fibrokeratinous 指含有角蛋白、因此呈坚韧纤维状的组织或结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Made of or containing fibrous keratin; having a tough, hair- or horn-like fibrous texture.","zh":"（生物/医学）由纤维状角蛋白构成的；含有纤维性角蛋白的；呈现坚韧、类似毛发或角质的纤维结构的。"},"examples":[{"en":"The sample showed a fibrokeratinous layer consistent with horn tissue.","zh":"样本显示出纤维性角蛋白层，与角质组织一致。"},{"en":"Some skin lesions develop a fibrokeratinous surface that feels rough to the touch.","zh":"有些皮肤病变会形成纤维性角蛋白表面，摸起来很粗糙。"}]}],"synonyms":["keratinous","fibrous","horny (technical)","cornified"],"phonetic":"/ˌfaɪbroʊkəˈrætənəs/","extraExplanation":["这个词非常偏专业，多见于病理学/皮肤科或动物解剖学的描述，用来强调“角蛋白（keratin）”不仅存在，而且呈“纤维状（fibro-）”结构，因而常暗示组织更坚韧、较难切开或触感粗硬。","构词提示：fibro- = 纤维；keratin = 角蛋白；-ous = “具有……性质的”。理解构词后，即使第一次见到也更容易推测含义。"]}
{"word":"fibroleiomyoma","summary":{"en":"A fibroleiomyoma is a benign tumor of smooth muscle and fibrous tissue, usually in the uterus (a type of fibroid).","zh":"fibroleiomyoma 指由平滑肌与纤维组织构成的良性肿瘤，通常发生在子宫（子宫肌瘤的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a benign (non-cancerous) tumor made of fibrous tissue and smooth muscle, most commonly found in the uterus; a type of leiomyoma (fibroid).","zh":"由纤维组织与平滑肌组成的良性肿瘤，最常见于子宫；属于平滑肌瘤（子宫肌瘤）的一种。"},"examples":[{"en":"The ultrasound suggested a fibroleiomyoma in the uterine wall.","zh":"超声检查提示子宫壁内可能有一个纤维平滑肌瘤。"},{"en":"Fibroleiomyomas can cause heavy periods and pelvic pressure in some patients.","zh":"在一些患者中，纤维平滑肌瘤可能导致月经量多和盆腔压迫感。"},{"en":"The pathology report confirmed the mass was a fibroleiomyoma, not cancer.","zh":"病理报告证实该肿块是纤维平滑肌瘤，并非癌症。"}]}],"synonyms":["leiomyoma","uterine fibroid","fibromyoma"],"phonetic":"/ˌfaɪbroʊˌlaɪoʊmaɪˈoʊmə/","extraExplanation":["这是医学/病理学用词，日常交流中更常说“uterine fibroid（子宫肌瘤）”或“leiomyoma（平滑肌瘤）”。“fibro-”强调纤维成分较多；在病理报告里会更常见。","如果出现在检验单上，常与症状（经量增多、痛经、压迫感）和检查（超声、MRI）一起出现；治疗从观察随访到药物、介入或手术不等，需由医生评估。"]}
{"word":"fibroligamentous","summary":{"en":"A medical adjective meaning “fibrous and ligament-related.”","zh":"医学形容词，表示“纤维组织与韧带相关（或构成）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made of both fibrous tissue (strong connective tissue) and ligaments (bands that connect bones).","zh":"与（或由）纤维组织和韧带共同相关或构成的；纤维—韧带性的。"},"examples":[{"en":"The MRI report mentioned fibroligamentous thickening around the joint.","zh":"核磁共振报告提到关节周围出现纤维—韧带性增厚。"},{"en":"Pain can come from irritation of the fibroligamentous structures in the spine.","zh":"疼痛可能来自脊柱中纤维—韧带性结构的刺激。"}]}],"synonyms":["fibrous-ligamentous","fibrous and ligamentous","ligamentous (context-dependent)"],"phonetic":"/ˌfaɪbroʊˌlɪɡəˈmɛn(t)əs/","extraExplanation":["这是医学/解剖学中较少见的复合形容词：fibro-（纤维的）+ ligamentous（韧带的）。常用于影像学报告、手术记录或病理描述，用来强调组织成分或结构性质。","在临床语境里，它通常不是日常词汇；更常见的表达有“fibrous and ligamentous tissue（纤维与韧带组织）”或具体结构名（如“posterior longitudinal ligament 后纵韧带”）。"]}
{"word":"fibrolipoma","summary":{"en":"Fibrolipoma is a benign tumor made of fat plus fibrous connective tissue.","zh":"Fibrolipoma（纤维脂肪瘤）是由脂肪组织和纤维结缔组织组成的良性肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a benign (non-cancerous) tumor made of fatty tissue (lipoma) mixed with fibrous (connective) tissue","zh":"一种良性肿瘤，由脂肪组织（脂肪瘤成分）与纤维（结缔）组织混合组成"},"examples":[{"en":"The biopsy showed a fibrolipoma, so no cancer treatment was needed.","zh":"活检结果显示是纤维脂肪瘤，因此不需要进行癌症治疗。"},{"en":"A fibrolipoma can feel firmer than a typical lipoma because of the fibrous tissue.","zh":"由于含有纤维组织，纤维脂肪瘤摸起来可能比普通脂肪瘤更硬一些。"}]}],"synonyms":["benign lipomatous tumor","lipoma (related, but not identical)"],"phonetic":"ˌfaɪbroʊlɪˈpoʊmə","extraExplanation":["词源提示：fibro- 表示“纤维（组织）”，lipoma 表示“脂肪瘤”，合在一起就是“含纤维成分的脂肪瘤”。","医学语境：通常表现为皮下缓慢生长的包块，多为无痛；是否需要处理取决于大小、位置、是否影响功能或外观等。确诊一般依赖影像学与病理检查。"]}
{"word":"fibrolipomatous","summary":{"en":"A medical adjective describing something involving both fibrous and fatty (lipomatous) tissue.","zh":"医学形容词：描述同时涉及纤维组织与脂肪（脂肪样）组织的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) relating to, made of, or involving both fibrous tissue and fatty (lipomatous) tissue.","zh":"（医学）与纤维组织和脂肪（脂肪瘤样）组织两者有关的；由纤维组织与脂肪组织共同构成或受其影响的。"},"examples":[{"en":"The MRI suggested a fibrolipomatous mass near the nerve.","zh":"核磁共振提示神经附近有一个纤维脂肪样肿块。"},{"en":"The pathology report described fibrolipomatous tissue with no signs of malignancy.","zh":"病理报告描述为纤维脂肪样组织，未见恶性征象。"},{"en":"Fibrolipomatous changes can make a lesion feel firm and slightly irregular.","zh":"纤维脂肪样改变可能使病灶触感更坚实，且略显不规则。"}]}],"synonyms":["fibrofatty","fibro-fatty","fibroadipose"],"phonetic":"/ˌfaɪbroʊˌlɪpəˈmeɪtəs/","extraExplanation":["这是一个医学/病理学常用形容词：fibro- 表示“纤维（组织）”，lipomatous 表示“脂肪样/与脂肪瘤相关”。合在一起强调组织成分里同时有纤维成分与脂肪成分。","它通常用于影像学或病理描述（例如“fibrolipomatous mass/tissue”），用于说明组织性质或组成，并不直接等同于“癌”。是否良恶性仍需结合部位、影像特征与病理结果判断。","在日常英语中很少使用，更多见于医学报告、病例讨论或研究论文中。"]}
{"word":"fibrolite","summary":{"en":"Fibrolite is a fibrous variety of the mineral sillimanite, found in metamorphic rocks.","zh":"Fibrolite 指硅线石的一种纤维状形态，常见于变质岩中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fibrous form of the mineral sillimanite (an aluminum silicate), found in some metamorphic rocks and used as an indicator of high-temperature metamorphism","zh":"（矿物）纤维硅线石：硅线石（含铝硅酸盐矿物）的一种纤维状形态，常见于某些变质岩中，常用作高温变质作用的指示矿物"},"examples":[{"en":"Under the microscope, the thin fibrolite needles were visible in the schist.","zh":"在显微镜下，可以看到片岩中细长的纤维硅线石针状晶体。"},{"en":"The presence of fibrolite suggests the rock experienced relatively high metamorphic temperatures.","zh":"纤维硅线石的出现表明该岩石经历了较高的变质温度。"}]}],"synonyms":["sillimanite (fibrous variety)"],"phonetic":"/ˈfaɪbroʊˌlaɪt/","extraExplanation":["“fibrolite”来自“fibro-（纤维）+ -lite（石）”，字面意思就是“纤维状的石头”。","在地质学里，它常被看作“硅线石（sillimanite）”的一种习性（晶体外形/集合体形态），强调其细长纤维或针状外观。不同资料中也可能把它当作硅线石的旧称或近义称呼。"]}
{"word":"fibrolitic","summary":{"en":"Fibrinolytic means ‘able to break down blood clots (fibrin),’ and it can also refer to a clot-dissolving drug.","zh":"fibrinolytic 指“能分解血栓（纤维蛋白）的”，也可指溶栓药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Able to dissolve fibrin (a protein involved in blood clots), so it helps break down clots.","zh":"（医学）能溶解纤维蛋白（血栓中的蛋白质），因此有助于分解血栓。"},"examples":[{"en":"The doctor prescribed a fibrinolytic drug to treat the blood clot.","zh":"医生开了溶栓（纤溶）药来治疗血栓。"},{"en":"Fibrinolytic therapy can reduce damage if given quickly after certain types of stroke.","zh":"在某些类型的中风后若能尽快使用纤溶治疗，可能减少损伤。"}]},{"partOfSpeech":"n.","definition":{"en":"A fibrinolytic drug or substance (a clot-busting agent).","zh":"溶栓药；纤溶剂（“破栓”药物或物质）。"},"examples":[{"en":"In the emergency room, they prepared a fibrinolytic for rapid treatment.","zh":"在急诊室里，他们准备了溶栓药以便快速治疗。"}]}],"synonyms":["clot-dissolving","thrombolytic","clot-busting"],"phonetic":"/ˌfaɪ.brə.noʊˈlɪtɪk/","extraExplanation":["你输入的 **fibrolitic** 很可能是拼写错误；标准拼写通常是 **fibrinolytic**（也可说 *fibrinolytic agent* / *fibrinolytic drug*）。","词根提示：*fibrin-*（纤维蛋白）+ *-lytic*（溶解的、分解的）。","语境提醒：该词多用于医疗/药理学场景，日常英语较少用；非专业场合更常说 *clot-busting drug*（“破栓药”）。"]}
{"word":"fibroma","summary":{"en":"A fibroma is a benign tumor made of fibrous (connective) tissue.","zh":"fibroma 指由纤维（结缔）组织构成的良性肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A benign (non-cancerous) tumor made mostly of fibrous or connective tissue, often found in the skin, mouth, uterus, or other organs.","zh":"纤维瘤：一种良性（非癌性）肿瘤，主要由纤维组织/结缔组织构成，常见于皮肤、口腔、子宫等部位。"},"examples":[{"en":"The doctor said the lump was a fibroma and usually doesn’t spread like cancer.","zh":"医生说这个肿块是纤维瘤，一般不像癌症那样扩散。"},{"en":"She had the fibroma removed because it was causing discomfort.","zh":"她因为不适而把纤维瘤切除了。"}]}],"synonyms":["benign tumor","benign growth","noncancerous lump"],"phonetic":"/faɪˈbroʊmə/","extraExplanation":["词源提示：fibro- 表示“纤维”，-oma 表示“肿瘤/肿块”。很多医学名词都用 -oma 结尾（如 lipoma 脂肪瘤）。","使用场景：在日常英语里，人们更常说 “a benign tumor/lump（良性肿瘤/肿块）”；“fibroma” 更偏医学/病理报告用语。","注意区分：fibroma（纤维瘤，通常良性）不等同于 fibrosarcoma（纤维肉瘤，恶性）。若在报告中看到后者，需要进一步医疗评估。"]}
{"word":"fibroma-like","summary":{"en":"“Fibroma-like” means resembling a fibroma in appearance, especially in medical descriptions.","zh":"fibroma-like 指“外观或特征类似纤维瘤的”，常用于医学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a fibroma (a usually benign tumor made of fibrous connective tissue) in appearance or characteristics.","zh":"类似纤维瘤的（纤维瘤通常是由纤维结缔组织构成的良性肿瘤）；在外观或特征上像纤维瘤。"},"examples":[{"en":"The biopsy showed a fibroma-like lesion that required further testing to confirm the diagnosis.","zh":"活检显示一个类似纤维瘤的病变，需要进一步检测来确认诊断。"},{"en":"On imaging, the mass had a fibroma-like pattern with well-defined borders.","zh":"影像学上，该肿块呈类似纤维瘤的表现，边界较清楚。"}]}],"synonyms":["fibroma-like in appearance","fibromatous","fibroma-resembling"],"phonetic":"/faɪˈbroʊmə laɪk/","extraExplanation":["这是医学/病理学写作里常见的“形容词 + like”结构，用来表示“外观或特征像……但不一定就是……”。因此 fibroma-like 通常暗示“看起来像纤维瘤”，但最终是否为纤维瘤仍需病理或其他检查确认。","写作上常用连字符（fibroma-like）来修饰名词（如 fibroma-like lesion/pattern/mass），在学术论文或病理报告中更清晰。"]}
{"word":"fibromas","summary":{"en":"“Fibromas” means benign fibrous-tissue tumors or growths (plural of fibroma).","zh":"“Fibromas”是“fibroma”的复数，指由纤维组织构成的良性肿块/肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A benign (non-cancerous) growth or tumor made mostly of fibrous connective tissue.","zh":"纤维瘤：由纤维结缔组织为主构成的良性（非癌性）肿块或肿瘤。"},"examples":[{"en":"The doctor said the skin fibromas were benign and usually harmless.","zh":"医生说这些皮肤纤维瘤是良性的，通常没有大问题。"},{"en":"Fibromas can appear in different parts of the body, depending on the tissue involved.","zh":"纤维瘤可能出现在身体不同部位，取决于受影响的组织。"}]}],"synonyms":["benign tumor","fibrous growth","noncancerous growth"],"phonetic":"/faɪˈbroʊməz/","extraExplanation":["“Fibromas”是“fibroma”的复数形式。词根理解：fibro-（纤维）+ -oma（肿瘤/肿块）。","医学语境中常强调“benign（良性）”，但是否需要处理取决于大小、位置、症状（如疼痛、压迫感）以及医生的评估。"]}
{"word":"fibromata","summary":{"en":"Fibromata are benign tumors made of fibrous tissue (plural of fibroma).","zh":"fibromata 指纤维瘤的复数，即由纤维组织构成的良性肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of fibroma: non-cancerous (benign) tumors made mostly of fibrous (connective) tissue.","zh":"fibroma（纤维瘤）的复数：主要由纤维（结缔）组织构成的良性肿瘤。"},"examples":[{"en":"The scan suggested multiple fibromata in the uterus.","zh":"扫描提示子宫内有多个纤维瘤。"},{"en":"Most fibromata grow slowly and are not life-threatening.","zh":"多数纤维瘤生长缓慢，通常不会危及生命。"}]}],"synonyms":["fibromas","benign fibrous tumors","(uterus) fibroids (context-dependent)"],"phonetic":"/ˌfaɪbroʊˈmɑːtə/","extraExplanation":["“fibromata”是源自拉丁/希腊式复数的用法（类似“bacterium → bacteria”）。在现代医学英语中，也常见规则复数“fibromas”，两者意思相同。","“fibroma”在日常医疗语境里有时会被更具体的名称替代，例如子宫里的常被称为“uterine fibroids”（子宫肌瘤/子宫纤维瘤）。"]}
{"word":"fibromatoid","summary":{"en":"Fibromatoid means “fibroma-like,” used mainly in medical contexts to describe tissue that resembles a fibroma.","zh":"fibromatoid 意为“纤维瘤样的”，多用于医学语境，描述组织或病变外观/性质类似纤维瘤。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to (or resembling) a fibroma: a usually non-cancerous tumor made mainly of fibrous connective tissue.","zh":"纤维瘤样的；与纤维瘤有关的：指与纤维瘤（通常为良性、主要由纤维结缔组织构成的肿瘤）有关或外观/性质类似的。"},"examples":[{"en":"The biopsy described a fibromatoid lesion with abundant fibrous tissue.","zh":"活检报告描述为纤维瘤样病变，含有丰富的纤维组织。"},{"en":"The pathologist considered a fibromatoid tumor in the differential diagnosis.","zh":"病理科医生在鉴别诊断中考虑了纤维瘤样肿瘤。"}]}],"synonyms":["fibroma-like","fibrous","fibromatous (context-dependent)"],"phonetic":"/ˌfaɪbroʊməˈtɔɪd/","extraExplanation":["这是医学/病理学里常见的形容词，用来描述“外观或组织学特点像纤维瘤”的情况，并不等同于最终诊断。临床上常与 lesion（病变）、tumor（肿瘤）、nodule（结节）、change（改变）等词搭配。","词形构成：fibroma（纤维瘤）+ -oid（……样的、类似……的）。-oid 在医学英语中很常见，如 “rheumatoid”（类风湿的）。","注意与 “fibromatosis”（纤维瘤病/纤维增生性病变）区分：fibromatoid 是“像纤维瘤的”（描述性），fibromatosis 是具体疾病/病理过程名称。"]}
{"word":"fibromatosis","summary":{"en":"Fibromatosis is an overgrowth of fibrous tissue that forms usually benign but sometimes aggressive lumps, often discussed as a group of related conditions (e.g., desmoid-type).","zh":"Fibromatosis 指纤维组织异常增生形成肿块，通常良性但可能侵袭性强；也可泛指一组相关疾病（如硬纤维瘤型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition in which fibrous connective tissue grows too much, forming lumps (tumors) in soft tissues; these growths are usually non-cancerous but can still be aggressive and may come back after treatment.","zh":"纤维瘤病：纤维结缔组织异常增生，在软组织中形成肿块（肿瘤）；通常为良性，但可能具有侵袭性，并在治疗后复发。"},"examples":[{"en":"The doctor explained that fibromatosis is usually benign, but it can still grow into nearby tissue.","zh":"医生解释说，纤维瘤病通常是良性的，但仍可能向周围组织生长。"},{"en":"She is being monitored regularly because her fibromatosis returned after surgery.","zh":"因为她的纤维瘤病在手术后复发了，所以需要定期随访。"}]},{"partOfSpeech":"n.","definition":{"en":"More specifically, a group of related disorders (such as desmoid tumors) involving fibrous tissue growth, often described by where in the body they occur.","zh":"更具体地说：一组与纤维组织增生相关的疾病（如硬纤维瘤/硬纤维瘤样肿瘤 desmoid tumor），常按发生部位来描述。"},"examples":[{"en":"Abdominal fibromatosis may cause pain or pressure as the mass grows.","zh":"腹部纤维瘤病随着肿块增大，可能引起疼痛或压迫感。"},{"en":"The report mentioned “desmoid-type fibromatosis,” which is a locally aggressive tumor.","zh":"报告中提到“硬纤维瘤型纤维瘤病”，它是一种局部侵袭性肿瘤。"}]}],"synonyms":["desmoid-type fibromatosis (related term)","aggressive fibromatosis (related term)","fibrous tissue overgrowth (description)"],"phonetic":"/ˌfaɪbroʊˌmætoʊˈsoʊsɪs/","extraExplanation":["词源提示：fibro- 表示“纤维”，-matosis 常表示“增生/病变状态”，合起来就是“纤维组织的异常增生”。","学习提示：在医学英语里它常与 desmoid (硬纤维瘤) 连用，常见搭配包括 desmoid-type fibromatosis（硬纤维瘤型纤维瘤病）、aggressive fibromatosis（侵袭性纤维瘤病）、recurrence（复发）。","温和提醒：这是医学术语，具体严重程度与治疗方式需由专业医生根据位置、大小、症状与病理结果判断。"]}
{"word":"fibromatous","summary":{"en":"Fibromatous describes something that is fibroma-like or mainly made of fibrous connective tissue, often used in medical reports.","zh":"fibromatous 指“纤维瘤样的”或“以纤维结缔组织为主的”，常用于医学检查/病理报告中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling a fibroma (a usually benign tumor made of fibrous or connective tissue).","zh":"与纤维瘤有关的；类似纤维瘤的（纤维瘤通常是由纤维/结缔组织构成的良性肿瘤）。"},"examples":[{"en":"The biopsy report described a fibromatous growth in the soft tissue.","zh":"活检报告描述软组织中有纤维瘤样增生。"},{"en":"Doctors considered the mass likely benign because it appeared fibromatous.","zh":"医生认为该肿块可能是良性的，因为它呈纤维瘤样特征。"}]},{"partOfSpeech":"adj.","definition":{"en":"Composed largely of fibrous tissue; having many fibrous bands.","zh":"主要由纤维组织构成的；含有较多纤维束的。"},"examples":[{"en":"Imaging showed a fibromatous lesion with dense connective tissue.","zh":"影像显示该病灶呈纤维组织为主的特征，结缔组织较致密。"},{"en":"Some scars can become thick and fibromatous over time.","zh":"有些疤痕随着时间会变得增厚并呈纤维化/纤维组织增生样。"}]}],"synonyms":["fibrous","fibroma-like","connective-tissue"],"phonetic":"/ˌfaɪbroʊˈmeɪtəs/","extraExplanation":["这是医学/病理学用词，常见于检查报告（如“fibromatous change/lesion”）。它通常是在描述组织学特征（像纤维瘤或以纤维组织为主），并不直接等同于“癌”。具体良恶性仍需结合病理诊断与临床判断。","词根提示：fibro-（纤维）+ -oma（肿瘤）→ fibroma（纤维瘤）；-tous 表示“具有……特征的”，所以 fibromatous = “纤维瘤样的/纤维组织特征明显的”。"]}
{"word":"fibromembrane","summary":{"en":"A medical term for a fibrous, membrane-like tissue layer; it can be used as a noun or an adjective.","zh":"医学术语：指纤维性、膜样的组织薄层；可作名词或形容词使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) A thin layer of tissue made of fibrous material and membrane-like tissue, often forming a covering or sheet in the body.","zh":"（医学）由纤维组织与膜样组织构成的薄层组织，常在体内形成覆盖或片状结构。"},"examples":[{"en":"The surgeon removed a fibromembrane that was restricting movement.","zh":"外科医生切除了一个限制活动的纤维膜样组织。"},{"en":"Inflammation can cause a fibromembrane to develop over the affected area.","zh":"炎症可能会使患处表面形成纤维膜样覆盖层。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical) Describing tissue or a layer that has both fibrous and membrane-like characteristics.","zh":"（医学）形容同时具有纤维性与膜样特征的组织或薄层。"},"examples":[{"en":"The report mentioned fibromembrane thickening around the joint.","zh":"报告提到关节周围出现纤维膜样增厚。"},{"en":"A fibromembrane sheet formed as part of the healing process.","zh":"在愈合过程中形成了一层纤维膜样薄片。"}]}],"synonyms":["fibrous membrane","fibro-membranous layer","membranous tissue"],"phonetic":"ˌfaɪbroʊˈmɛmˌbreɪn","extraExplanation":["这个词常见于影像学报告、病理报告或手术记录中，用来描述一种“又像纤维组织又像薄膜”的覆盖层或增厚层。它通常不是日常用词，更偏专业医学语境。","构词法：fibro- 表示“纤维（组织）”，membrane 表示“膜”。合起来强调组织的两种性质并存。"]}
{"word":"fibromembranous","summary":{"en":"A medical adjective meaning “fibrous and membranous,” describing tissue that has both fiber-like and membrane-like parts.","zh":"医学形容词，表示“纤维性且膜性的”，用于描述同时具有纤维组织与膜状结构特征的组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of both fibrous tissue (tough, rope-like connective tissue) and a membrane (a thin layer of tissue).","zh":"由纤维组织（坚韧、似绳状的结缔组织）和膜（薄层组织）共同构成的；纤维膜性的。"},"examples":[{"en":"The doctor described a fibromembranous layer covering the tissue.","zh":"医生描述有一层纤维膜性组织覆盖在该组织表面。"},{"en":"A fibromembranous band can sometimes form after inflammation or surgery.","zh":"炎症或手术后有时会形成纤维膜性条带。"}]}],"synonyms":["fibrous","membranous","fibroconnective (less common)"],"phonetic":"/ˌfaɪbroʊˈmɛmbrənəs/","extraExplanation":["这是一个医学/解剖学用语，常见于病理报告或影像学描述，用来强调组织“既有纤维性（更坚韧、较厚、偏支撑）又有膜性（更薄、呈层状/覆盖）”的特征。","词形来源：fibro-（纤维）+ membranous（膜状的）。在普通日常英语中不常用，主要出现在临床沟通、论文或检查报告里。"]}
{"word":"fibromucinous","summary":{"en":"Fibromucinous describes tissue that contains both fibrous material and mucin (mucus-like substance), commonly used in medical/pathology descriptions.","zh":"Fibromucinous 指含有纤维组织与黏蛋白（黏液样物质）成分的组织，常用于医学/病理描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having, consisting of, or resembling a mixture of fibrous tissue and mucin (a thick, mucus-like substance).","zh":"（医学）含有、由……构成或呈现为纤维组织与黏蛋白（类似黏液的稠厚物质）混合的。"},"examples":[{"en":"The pathology report described a fibromucinous lesion in the colon.","zh":"病理报告描述结肠内有一个纤维黏蛋白样病变。"},{"en":"Microscopy showed fibromucinous stroma surrounding the tumor cells.","zh":"显微镜下可见肿瘤细胞周围有纤维黏蛋白样间质。"}]}],"synonyms":["fibromucous","fibromyxoid","mucin-rich (context-dependent)"],"phonetic":"/ˌfaɪbroʊˈmjuːsɪnəs/","extraExplanation":["这个词多见于病理学/影像学报告（如“fibromucinous tissue/lesion/stroma”），用来描述组织成分：既有“纤维性（fibro-）”的结缔组织，也有“黏蛋白性（mucinous）”的黏液样物质。它通常是形态学描述词，不是单独的诊断名称；最终诊断需要结合部位、镜下特征与其他检查结果。"]}
{"word":"fibromucous","summary":{"en":"A medical adjective meaning “made of or containing both fibrous and mucous tissue.”","zh":"医学用形容词，指“由纤维组织和黏液（产黏）组织共同构成或含有二者”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or made of both fibrous tissue and mucous (mucus-producing) tissue; fibro-mucous.","zh":"（组织）含有或由纤维组织与黏液（产黏）组织共同组成的；纤维-黏液性的。"},"examples":[{"en":"The pathology report described a fibromucous polyp in the colon.","zh":"病理报告描述结肠里有一个纤维黏液性息肉。"},{"en":"Under the microscope, the lesion showed fibromucous stroma.","zh":"在显微镜下，这个病变显示出纤维黏液性基质。"}]}],"synonyms":["fibro-mucous","fibromucinous","mucous and fibrous"],"phonetic":"/ˌfaɪbroʊˈmjuːkəs/","extraExplanation":["这是医学/病理学中的描述性形容词，常用来说明组织成分：fibro-（纤维）+ mucous（黏液性的）。","在临床语境里，它通常出现在病理报告或影像/手术记录中，用来描述息肉、基质（stroma）、组织增生等的质地或组织学成分。日常英语中几乎不用。","注意拼写：fibromucous（一个词）与 fibro-mucous（带连字符）意思相同，取决于写作风格或期刊规范。"]}
{"word":"fibromuscular","summary":{"en":"“Fibromuscular” describes something involving both fibrous tissue and muscle tissue, especially in medical contexts.","zh":"“fibromuscular”指与纤维组织和肌肉组织同时相关或由二者构成，常用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made of both fibrous (tough connective) tissue and muscle tissue.","zh":"与纤维组织（坚韧的结缔组织）和肌肉组织都有关的；由纤维组织与肌肉组织共同构成的。"},"examples":[{"en":"The doctor noted fibromuscular thickening of the artery wall.","zh":"医生记录到动脉壁出现了纤维肌性增厚。"},{"en":"Fibromuscular tissue can provide both strength and movement.","zh":"纤维肌性组织既能提供支撑强度，也能产生运动。"}]}],"synonyms":["fibromuscular (medical adjective)","fibromuscular (of fibrous and muscular tissue)","fibromuscular (containing fiber and muscle)"],"phonetic":"/ˌfaɪbroʊˈmʌskjələr/","extraExplanation":["这是医学/解剖学常用形容词，常见于组织学描述或影像学报告，例如“fibromuscular dysplasia（纤维肌性发育不良）”描述血管壁异常增厚，可能导致血管狭窄。","词由 fibro-（纤维）+ muscular（肌肉的）构成；在日常英语里较少使用，多见于专业场景。"]}
{"word":"fibromyalgia","summary":{"en":"Fibromyalgia is a chronic condition marked by widespread body pain, fatigue, and sleep/cognitive difficulties.","zh":"纤维肌痛是一种以全身广泛疼痛为主，并常伴疲劳、睡眠与认知困难的慢性疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long-term (chronic) health condition that causes widespread muscle and body pain, often along with fatigue, sleep problems, and “brain fog” (trouble thinking clearly).","zh":"一种长期（慢性）疾病，会引起全身广泛的肌肉与身体疼痛，常伴随疲劳、睡眠问题，以及“脑雾”（思考不清、注意力困难）。"},"examples":[{"en":"She was diagnosed with fibromyalgia after years of widespread pain and poor sleep.","zh":"她在多年全身疼痛和睡眠不佳后，被诊断为纤维肌痛。"},{"en":"Fibromyalgia symptoms can flare up during periods of stress.","zh":"在压力较大时，纤维肌痛症状可能会加重。"},{"en":"Gentle exercise and good sleep habits can help some people manage fibromyalgia.","zh":"温和运动与良好的睡眠习惯能帮助一些人管理纤维肌痛。"}]}],"synonyms":["fibro (informal)"],"phonetic":"/ˌfaɪbroʊmaɪˈældʒiə/","extraExplanation":["词源拆解：fibro- 表示“纤维”，myo- 表示“肌肉”，-algia 表示“疼痛”，字面意思可理解为“纤维/肌肉疼痛”。","日常使用中，它是医学名词，多用于就医、健康科普或正式交流；口语中也有人说 “I have fibro.”（更口语、非正式）。","学习提示：fibromyalgia 指一种综合征/疾病名称，不等同于单次“肌肉酸痛”。如需表达一般性的疼痛，更常用 muscle pain / soreness。"]}
{"word":"fibromyectomy","summary":{"en":"Fibromyectomy is a surgery to remove uterine fibroids while keeping the uterus (similar to myomectomy).","zh":"Fibromyectomy 指在保留子宫的前提下切除子宫肌瘤的手术（类似 myomectomy）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove uterine fibroids (benign muscle tumors) while leaving the uterus in place; essentially another term for a myomectomy.","zh":"一种外科手术：切除子宫肌瘤（良性平滑肌肿瘤）但保留子宫；基本等同于“子宫肌瘤剔除术（myomectomy）”。"},"examples":[{"en":"She chose a fibromyectomy to remove the fibroids and preserve her uterus.","zh":"她选择做子宫肌瘤剔除术，以切除肌瘤并保留子宫。"},{"en":"After the fibromyectomy, her heavy menstrual bleeding improved.","zh":"子宫肌瘤剔除术后，她的经量过多有所改善。"},{"en":"The doctor explained that a fibromyectomy can be done through open surgery or minimally invasive techniques in some cases.","zh":"医生解释说，在某些情况下，子宫肌瘤剔除术可以通过开腹手术或微创方式进行。"}]}],"synonyms":["myomectomy","fibroid removal surgery"],"phonetic":"/ˌfaɪbroʊmaɪˈɛktoʊmi/","extraExplanation":["这个词属于医学用语，临床上更常见的标准说法是 myomectomy（子宫肌瘤剔除术）。在病历或资料中看到 fibromyectomy，通常指的就是“切除子宫肌瘤但不切除子宫”。","词根有助于记忆：fibro-（纤维/纤维组织）+ my-（肌肉）+ -ectomy（切除术）。因此字面意思接近“切除纤维肌性肿块”。","需要注意：它与 hysterectomy（子宫切除术）不同；后者会切除子宫，适应证与生育影响也不同。"]}
{"word":"fibromyitis","summary":{"en":"Fibromyitis is a rare/older medical term for pain or inflammation involving fibrous tissue and muscle, now often replaced by newer terms.","zh":"Fibromyitis 是较少见/较旧的医学术语，指纤维组织与肌肉的疼痛或炎症，如今常被更新的术语取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Inflammation or pain involving fibrous tissue and muscle; a term historically used for widespread muscle-and-fascia pain, now largely replaced by more modern diagnoses.","zh":"（医学）纤维组织与肌肉的炎症或疼痛；历史上曾用来指广泛的肌肉/筋膜疼痛，如今多被更现代的诊断名称取代。"},"examples":[{"en":"The old chart listed “fibromyitis,” but the clinician updated the diagnosis to a more current term.","zh":"旧病历上写着“fibromyitis（纤维肌炎）”，但临床医生把诊断更新成了更现代的术语。"},{"en":"Some early writers used fibromyitis to describe chronic muscle aches without clear swelling or infection.","zh":"一些早期作者用 fibromyitis 来描述没有明确肿胀或感染迹象的慢性肌肉酸痛。"}]}],"synonyms":["fibromyositis","fibrositis (historical)","fibromyalgia (related)"],"phonetic":"/ˌfaɪbroʊmaɪˈaɪtɪs/","extraExplanation":["这个词在现代医学文献中比较少见，也常被视为历史/过时用语；你可能还会看到拼写或相关词：fibromyositis（纤维肌炎，较接近“肌肉+纤维组织”）、fibrositis（旧称）、fibromyalgia（纤维肌痛，现代更常用的相关诊断之一，但不完全等同）。","如果你是在报告、论文或病历里遇到它，通常需要结合上下文判断作者想表达的是“炎症”还是更广义的“慢性肌肉疼痛/触痛”。若是健康相关疑问，建议以医生给出的当代诊断与解释为准。"]}
{"word":"fibromyoma","summary":{"en":"Fibromyoma is a medical term for a benign fibrous-and-muscle tumor, usually a uterine fibroid.","zh":"Fibromyoma 指由纤维组织与肌肉组成的良性肿瘤，通常就是子宫肌瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a noncancerous (benign) tumor made of fibrous tissue and smooth muscle, most commonly found in the uterus; also called a fibroid (or leiomyoma).","zh":"由纤维组织和平滑肌组成的良性肿瘤，最常见于子宫；也称为子宫肌瘤（fibroid / leiomyoma）。"},"examples":[{"en":"The ultrasound showed a fibromyoma in the uterine wall.","zh":"超声检查显示子宫壁内有一个纤维肌瘤。"},{"en":"Many fibromyomas cause no symptoms and are found during routine exams.","zh":"许多纤维肌瘤没有症状，常在常规检查中被发现。"},{"en":"Her doctor discussed options for treating the fibromyoma, including medication and surgery.","zh":"医生和她讨论了纤维肌瘤的治疗选择，包括药物与手术。"}]}],"synonyms":["fibroid","uterine fibroid","leiomyoma"],"phonetic":"/ˌfaɪbroʊmaɪˈoʊmə/","extraExplanation":["这是医学用词，在日常英语里更常用的是“fibroid（子宫肌瘤）”或“uterine fibroid”。“leiomyoma”也常见，强调来源于平滑肌；“fibromyoma”强调纤维组织成分。","词源上可拆解理解：fibro-（纤维）+ myo-（肌肉）+ -oma（肿瘤）。写作或就医时常见于检查报告、病理报告。"]}
{"word":"fibromyomatous","summary":{"en":"A medical adjective meaning “related to fibroids (fibromyomas), especially in the uterus.”","zh":"医学形容词，表示“与纤维肌瘤（常指子宫肌瘤）有关/呈纤维肌瘤样的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characterized by a fibromyoma (a benign tumor made of fibrous tissue and smooth muscle), most often in the uterus; fibroid-like.","zh":"与纤维肌瘤有关的；以纤维肌瘤（由纤维组织与平滑肌组成的良性肿瘤，常见于子宫）为特征的；类似子宫肌瘤的。"},"examples":[{"en":"The ultrasound report described a fibromyomatous uterus, consistent with multiple fibroids.","zh":"超声报告描述为“纤维肌瘤样子宫”，提示存在多个子宫肌瘤。"},{"en":"She was treated for heavy bleeding caused by fibromyomatous changes in the uterine wall.","zh":"她因子宫壁出现纤维肌瘤样改变导致月经过多而接受治疗。"}]}],"synonyms":["fibroid","leiomyomatous","fibromatous"],"phonetic":"/ˌfaɪbroʊˌmaɪəˈmeɪtəs/","extraExplanation":["这是偏医学/影像学的正式用词，临床上常在报告中看到，如“fibromyomatous uterus（纤维肌瘤样子宫）”。日常交流里，医生更常用 fibroid(s)（子宫肌瘤）或 uterine fibroids（子宫肌瘤）来解释给患者听。","词源上可拆解理解：fibro-（纤维）+ myo-（肌肉）+ -matous（…样的/…性质的）。"]}
{"word":"fibromyomectomy","summary":{"en":"A surgery to remove uterine fibroids while preserving the uterus.","zh":"切除子宫肌瘤但保留子宫的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove fibroids (benign muscle tumors) from the uterus while keeping the uterus intact","zh":"（子宫）肌瘤剔除术：一种手术，把子宫肌瘤（良性的肌肉肿瘤）从子宫上切除，但保留子宫本身"},"examples":[{"en":"She had a fibromyomectomy to remove several uterine fibroids and preserve fertility.","zh":"她做了子宫肌瘤剔除术，切除了多个子宫肌瘤，并尽量保留生育能力。"},{"en":"After the fibromyomectomy, her heavy menstrual bleeding improved.","zh":"做完子宫肌瘤剔除术后，她月经过多的情况改善了。"},{"en":"The doctor discussed risks like bleeding and scar tissue before scheduling the fibromyomectomy.","zh":"在安排子宫肌瘤剔除术前，医生说明了出血、瘢痕组织等风险。"}]}],"synonyms":["myomectomy","uterine myomectomy","fibroid removal surgery"],"phonetic":"/ˌfaɪbroʊˌmaɪəˈmɛktəmi/","extraExplanation":["这是一个医学术语，临床上更常见的说法是 myomectomy（肌瘤剔除术）。fibro-（纤维）+ myo-（肌肉）+ -ectomy（切除术）强调“纤维/肌肉性肿块”的切除。","常见方式包括腹腔镜（laparoscopic myomectomy）、开腹（open/abdominal myomectomy）或经宫腔镜（hysteroscopic myomectomy，适用于部分位于宫腔内的肌瘤）。具体选择取决于肌瘤大小、位置和数量。"]}
{"word":"fibromyositis","summary":{"en":"Fibromyositis is a medical term for painful inflammation in muscles and nearby connective tissue.","zh":"Fibromyositis 是指肌肉及附近结缔组织的疼痛性炎症的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Inflammation and pain in muscle tissue and the connective tissue around it; sometimes used to describe muscle aches related to myofascial pain.","zh":"（医学）肌肉组织及其周围结缔组织的炎症与疼痛；有时用于描述与肌筋膜疼痛相关的肌肉酸痛。"},"examples":[{"en":"The doctor considered fibromyositis as a possible cause of her ongoing shoulder pain.","zh":"医生把纤维肌炎（fibromyositis）作为她持续肩痛的一个可能原因。"},{"en":"Rest, gentle stretching, and heat therapy are sometimes recommended when symptoms look like fibromyositis.","zh":"当症状类似纤维肌炎时，有时会建议休息、温和拉伸和热敷治疗。"}]}],"synonyms":["myofascial pain","myalgia","muscle inflammation"],"phonetic":"/ˌfaɪbroʊˌmaɪəˈsaɪtɪs/","extraExplanation":["这是一个较偏“旧式/不太常用”的医学术语，在现代临床中更常见的相关说法包括 myofascial pain syndrome（肌筋膜疼痛综合征）、myalgia（肌痛）或 fibromyalgia（纤维肌痛）。不同词并不完全等同：fibromyalgia 更强调广泛性疼痛与疲劳等综合症表现，而 fibromyositis 更强调肌肉/结缔组织的炎症与局部疼痛。","词源可拆解理解：fibro-（纤维/结缔组织）+ myo-（肌肉）+ -itis（炎症）。看到 “-itis” 通常提示“炎症”的意思。"]}
{"word":"fibromyotomy","summary":{"en":"Fibromyotomy is a medical term for a surgery that cuts muscle fibers to relieve tightness or obstruction.","zh":"fibromyotomy 指一种通过切开肌肉纤维来缓解紧张或阻塞的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure that cuts muscle fibers (usually to relieve tightness or a blockage) without removing the muscle.","zh":"纤维肌切开术：一种外科手术，通过切开肌肉纤维（通常用于缓解痉挛、狭窄或阻塞），但不切除肌肉本体。"},"examples":[{"en":"The surgeon recommended a fibromyotomy to reduce the abnormal muscle tightness.","zh":"外科医生建议进行纤维肌切开术，以减轻异常的肌肉紧张。"},{"en":"In some digestive conditions, fibromyotomy can help food pass more easily through a narrowed area.","zh":"在某些消化系统疾病中，纤维肌切开术可以帮助食物更顺利地通过狭窄部位。"}]}],"synonyms":["myotomy","muscle incision procedure"],"phonetic":"/ˌfaɪbroʊmaɪˈɑːtəmi/","extraExplanation":["这是一个医学术语，构词很透明：fibro-（纤维/纤维组织）+ myo-（肌肉）+ -tomy（切开术）。它强调“切开”以松解（release）或减压，而不是切除（-ectomy）。","在临床语境里，你也可能看到更常用、指向更明确的相关术语，如 myotomy（肌切开术）或 pyloromyotomy（幽门肌切开术，常用于婴儿肥厚性幽门狭窄）。具体手术名称会因部位与疾病而不同。","这种词多出现在医学论文、手术记录或专业对话中，日常英语里很少用到。读到它时，把它理解为“针对肌层纤维的切开松解手术”通常就够了。"]}
{"word":"fibromyxoma","summary":{"en":"A benign tumor consisting of fibrous and myxoid (gel-like) connective tissue.","zh":"由纤维组织与黏液样（胶冻状）结缔组织组成的良性肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a benign (non-cancerous) tumor made of fibrous tissue mixed with myxoid (gel-like) connective tissue, often described in pathology reports","zh":"一种良性（非癌性）肿瘤，由纤维组织与黏液样（胶冻状）结缔组织混合构成，常见于病理报告中的描述"},"examples":[{"en":"The biopsy suggested a fibromyxoma rather than a malignant tumor.","zh":"活检提示更像是纤维黏液瘤，而不是恶性肿瘤。"},{"en":"The pathologist noted abundant myxoid stroma consistent with fibromyxoma.","zh":"病理医师记录到丰富的黏液样间质，符合纤维黏液瘤的特征。"}]}],"synonyms":["fibromyxomatous tumor","myxofibroma","fibroma (related)","myxoma (related)"],"phonetic":"/ˌfaɪbroʊmɪkˈsoʊmə/","extraExplanation":["这是偏医学/病理学术语，日常英语中很少使用，更多出现在病理报告、影像学讨论或口腔颌面外科相关语境中。","词源可拆分理解：fibro-（纤维）+ myx-（黏液样/黏液质）+ -oma（肿瘤）。看到这些构词部件时，常能大致推测医学名词的含义。","在临床沟通中，有时会与“myxoma（黏液瘤）”“fibroma（纤维瘤）”并列比较；不同机构对命名与分类可能略有差异，通常以病理诊断为准。"]}
{"word":"fibromyxosarcoma","summary":{"en":"Fibromyxosarcoma is a rare malignant soft‑tissue tumor with both fibrous and myxoid (gel-like) tissue.","zh":"fibromyxosarcoma 指一种罕见的恶性软组织肿瘤，含有纤维成分与黏液样（胶冻样）成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare malignant (cancerous) soft‑tissue tumor made of fibrous tissue mixed with myxoid (gel-like) tissue","zh":"一种较罕见的恶性软组织肿瘤，由纤维组织与黏液样（胶冻样）组织混合构成"},"examples":[{"en":"The biopsy suggested a fibromyxosarcoma, so the doctors planned further imaging.","zh":"活检结果提示可能是纤维黏液样肉瘤，因此医生安排了进一步影像检查。"},{"en":"Because fibromyxosarcoma is rare, the patient was referred to a specialist cancer center.","zh":"由于纤维黏液样肉瘤较罕见，患者被转诊到肿瘤专科中心。"}]}],"synonyms":["soft-tissue sarcoma (general term)"],"phonetic":"/ˌfaɪbroʊˌmɪksoʊsɑrˈkoʊmə/","extraExplanation":["词源拆解有助记忆：fibro-（纤维）+ myxo-（黏液样、胶冻样）+ sarcoma（肉瘤，源自结缔组织/软组织的恶性肿瘤）。","这是医学专有名词，日常英语里很少使用；在临床语境中更常见的相关大类说法是 “soft-tissue sarcoma（软组织肉瘤）”。如果你是在阅读病理报告，通常还会看到更具体的亚型名称与分级信息。"]}
{"word":"fibronectin","summary":{"en":"Fibronectin is an extracellular-matrix and plasma protein important for cell adhesion and wound healing.","zh":"纤维连接蛋白是一种存在于细胞外基质和血浆中的蛋白质，重要作用是促进细胞黏附并参与伤口愈合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein in blood plasma and in the extracellular matrix that helps cells stick (adhere) to surfaces and to each other, and supports wound healing and tissue repair","zh":"纤维连接蛋白：存在于血浆和细胞外基质中的一种蛋白质，帮助细胞黏附在表面或彼此黏附，并参与伤口愈合与组织修复"},"examples":[{"en":"Fibronectin helps cells attach to the extracellular matrix during wound healing.","zh":"在伤口愈合过程中，纤维连接蛋白帮助细胞附着在细胞外基质上。"},{"en":"Doctors sometimes measure plasma fibronectin in research on severe infection and inflammation.","zh":"在重度感染与炎症的研究中，医生有时会检测血浆中的纤维连接蛋白。"}]}],"synonyms":["FN","cell-adhesion protein","extracellular-matrix protein"],"phonetic":"/ˌfaɪbroʊˈnɛktɪn/","extraExplanation":["词源提示：fibro- 表示“纤维”，nect- 来自拉丁语词根，含“连接/绑定”之意，-in 常用于蛋白质名称；整体含义可理解为“把纤维样结构连接起来的蛋白”。","使用场景：该词多见于生物学、医学、组织工程与细胞培养语境（如 cell adhesion、extracellular matrix/ECM、wound healing 等）。日常英语中不常用。"]}
{"word":"fibronection","summary":{"en":"Fibronectin is a body protein that supports cell attachment and tissue repair, especially in wound healing.","zh":"纤连蛋白是一种促进细胞黏附与组织修复（尤其与伤口愈合相关）的蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fibronectin: a protein in the body (found in blood and in tissues) that helps cells stick to each other and to the surrounding material, supporting wound healing and tissue repair.","zh":"纤连蛋白：人体中的一种蛋白质（存在于血液和组织中），帮助细胞彼此及与周围基质黏附，参与伤口愈合与组织修复。"},"examples":[{"en":"Fibronectin helps cells attach to the extracellular matrix during wound healing.","zh":"在伤口愈合过程中，纤连蛋白帮助细胞黏附到细胞外基质上。"},{"en":"Doctors and researchers study fibronectin to better understand how tissues repair after injury.","zh":"医生和研究人员研究纤连蛋白，以更好理解组织在受伤后的修复过程。"}]}],"synonyms":["adhesion protein","ECM protein","cell-adhesion glycoprotein"],"phonetic":"/ˌfaɪbroʊˈnɛktɪn/","extraExplanation":["你输入的拼写“fibronection”常见的正确拼写是 **fibronectin**。","这是生物学/医学领域的专业词汇，日常英语中不太常用；在阅读论文、检验报告或医学科普时更常见。","词源可拆解理解：**fibro-**（纤维/结缔组织相关）+ **nect-**（连接、黏附的意思，联想到 connect）+ **-in**（蛋白质名词常见后缀）。"]}
{"word":"fibroneuroma","summary":{"en":"A benign tumor of fibrous and nerve tissue; a less common/older term often referring to neurofibroma.","zh":"由纤维组织与神经组织构成的良性肿瘤；较少见/较旧的术语，常指神经纤维瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A benign (non-cancerous) tumor made of fibrous tissue and nerve tissue; often used as an older or less common term for a neurofibroma.","zh":"一种由纤维组织与神经组织构成的良性（非癌性）肿瘤；常作为“神经纤维瘤（neurofibroma）”的较旧或较少见称呼。"},"examples":[{"en":"The pathology report described the mass as a fibroneuroma.","zh":"病理报告将该肿块描述为纤维神经瘤。"},{"en":"The doctor explained that a fibroneuroma is usually benign but may still need monitoring.","zh":"医生解释说，纤维神经瘤通常是良性的，但仍可能需要随访观察。"}]}],"synonyms":["neurofibroma","benign nerve sheath tumor"],"phonetic":"/ˌfaɪbroʊnuˈroʊmə/","extraExplanation":["这是医学/病理学用语，日常英语中很少见；在现代文献里更常见的对应词是 neurofibroma（神经纤维瘤）。","该词常出现在病理报告、影像学描述或医学论文中；如果你是在报告里看到它，通常是在描述肿块的组织来源（纤维组织 + 神经组织），并不等同于治疗建议。","不要把它与 neuroma（神经瘤，广义的神经相关肿瘤或神经增生）混为一谈；fibroneuroma 强调含有明显的纤维成分。"]}
{"word":"fibronuclear","summary":{"en":"A technical adjective meaning “involving fibrous tissue and cell nuclei,” used mainly in medical/biological descriptions.","zh":"一个偏专业的形容词，意为“与纤维组织和细胞核都有关”，多见于医学/生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving both fibrous tissue (fibro-) and cell nuclei (-nuclear), especially when describing microscopic (histologic) features in medicine or biology.","zh":"（多用于医学/生物学）指同时与纤维组织（fibro-）和细胞核（-nuclear）有关的；常用于描述显微镜下（组织学）的表现。"},"examples":[{"en":"The pathology report noted fibronuclear changes in the tissue sample.","zh":"病理报告指出该组织标本存在纤维-核相关的改变。"},{"en":"Researchers compared fibronuclear features between healthy and diseased muscle.","zh":"研究人员比较了健康与患病肌肉之间的纤维-核特征。"}]}],"synonyms":["fibronucleated","fibro-nuclear","fibrous-and-nuclear"],"phonetic":"/ˌfaɪbroʊˈnuːkliər/","extraExplanation":["这是一个相对少见、偏专业的形容词，常见于病理学/组织学语境，用来概括“纤维化（纤维成分增多）+ 细胞核形态/分布改变”等复合特征。","构词法：fibro-（纤维、纤维组织）+ nuclear（核的）。在阅读医学文献时，看到它通常意味着描述的是显微结构，而不是日常可见的外观。"]}
{"word":"fibronucleated","summary":{"en":"A rare technical adjective meaning “fibrous and containing nuclei,” used mainly in biology/medicine.","zh":"一个较少见的专业形容词，意为“纤维状且含有细胞核（有核细胞）”，主要用于生物/医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Describing tissue or a structure that has a fibrous (fiber-like) texture and contains nuclei (i.e., nucleated cells within fibrous material).","zh":"（生物/医学）形容组织或结构呈纤维状（像纤维一样）并且含有细胞核（即纤维性材料中含有有核细胞）。"},"examples":[{"en":"Under the microscope, the pathologist noted a fibronucleated pattern in the connective tissue.","zh":"在显微镜下，病理学家注意到结缔组织呈现纤维有核的形态特征。"},{"en":"The report described the lesion as fibronucleated rather than purely fibrous.","zh":"报告将该病变描述为“纤维有核”，而不是“单纯纤维性”。"}]}],"synonyms":["fibrocellular","fibrous","nucleated"],"phonetic":"/ˌfaɪbroʊˈnuːkliˌeɪtɪd/","extraExplanation":["这个词非常少见，多出现在专业语境（病理、组织学）里，用来概括“纤维性成分 + 有核细胞”的显微特征；在日常英语中几乎不会用。更常见、更具体的替代表达包括 fibrocellular（纤维细胞性的）、fibrous tissue with nucleated cells（含有核细胞的纤维组织）。"]}
{"word":"fibropapilloma","summary":{"en":"Fibropapilloma is a medical term for a benign fibrous, papilloma-like growth, often diagnosed by biopsy.","zh":"fibropapilloma 是医学术语，指由纤维组织与乳头状突起构成的良性增生，常通过活检/病理诊断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a benign (non-cancerous) growth made of fibrous tissue and papillary (finger-like) projections, often found on skin or mucous membranes (such as in the mouth or genital area) and sometimes linked to viral infection.","zh":"纤维乳头状瘤：一种良性（非癌性）增生，由纤维组织和乳头状（指状）突起构成，常见于皮肤或黏膜（如口腔、生殖器等），有时与病毒感染有关。"},"examples":[{"en":"The biopsy report described the lesion as a fibropapilloma with no signs of malignancy.","zh":"活检报告将该病变描述为纤维乳头状瘤，未见恶性迹象。"},{"en":"The dentist removed a small fibropapilloma from the patient’s inner cheek.","zh":"牙医从患者的颊黏膜内侧切除了一个小的纤维乳头状瘤。"},{"en":"The veterinarian suspected a fibropapilloma on the dog’s skin and recommended monitoring it.","zh":"兽医怀疑狗的皮肤上有纤维乳头状瘤，并建议进行观察。"}]}],"synonyms":["fibrous papilloma","benign papilloma (context-dependent)"],"phonetic":"/ˌfaɪbroʊˌpæpɪˈloʊmə/","extraExplanation":["这是偏医学/病理学的术语，在日常英语中不常用；常见于病理报告（biopsy/pathology report）、临床记录或兽医语境。","词形可拆解理解：fibro-（纤维的）+ papilloma（乳头状瘤）。papilloma 通常指乳头状增生/肿物，多为良性，但是否需要处理取决于大小、位置、症状以及病理结果。","有时会与 papillomavirus（乳头瘤病毒）相关联，但具体病因需由医生根据部位与检查判断。"]}
{"word":"fibropericarditis","summary":{"en":"Fibropericarditis is a type of pericarditis where a fibrous (fibrin-rich) layer forms on the pericardium around the heart.","zh":"fibropericarditis 指一种心包炎，其特征是心包表面形成以纤维素/纤维蛋白为主的纤维性覆盖层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the pericardium (the sac around the heart) in which a fibrous (fibrin-rich) layer forms, often causing sharp chest pain and a scratching sound (pericardial rub).","zh":"纤维素性心包炎：心包（包裹心脏的膜囊）发生炎症，并形成以纤维素/纤维蛋白为主的纤维性覆盖层，常见症状包括刺痛样胸痛及可听到“心包摩擦音”。"},"examples":[{"en":"The doctor suspected fibropericarditis because the patient had sharp chest pain that got worse when lying down.","zh":"医生怀疑是纤维素性心包炎，因为患者有刺痛样胸痛，平躺时更明显。"},{"en":"An ECG and echocardiogram were ordered to evaluate possible fibropericarditis.","zh":"医生安排了心电图和超声心动图来评估是否存在纤维素性心包炎。"}]}],"synonyms":["fibrinous pericarditis","pericarditis (general term)"],"phonetic":"/ˌfaɪbroʊˌpɛrɪˌkɑrˈdaɪtɪs/","extraExplanation":["词源结构：fibro-（纤维/纤维组织）+ pericardium（心包）+ -itis（炎症）。因此它字面意思就是“心包的纤维性炎症”。","在医学语境中，fibropericarditis 常与“fibrinous pericarditis（纤维素性/纤维蛋白性心包炎）”相关或近似使用；具体用词会因教材、地区和临床记录习惯而异。","学习提示：它属于专业医学词汇，日常英语中很少出现；一般在病历、论文、医学影像报告或课堂讨论里见到。"]}
{"word":"fibroplasia","summary":{"en":"Fibroplasia is the growth/formation of fibrous connective tissue, commonly seen in healing or some medical conditions.","zh":"Fibroplasia 指纤维结缔组织的形成与增生，常见于愈合过程或某些疾病中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation and growth of fibrous connective tissue (often during healing or in certain diseases).","zh":"纤维组织（结缔组织）的形成与增生（常见于伤口愈合过程或某些疾病）。"},"examples":[{"en":"The doctor said the scar became thicker because of fibroplasia during healing.","zh":"医生说疤痕在愈合过程中因纤维增生而变厚。"},{"en":"Excessive fibroplasia can sometimes reduce flexibility in the affected tissue.","zh":"过度的纤维增生有时会降低受影响组织的柔韧性。"}]}],"synonyms":["fibrous tissue formation","fibroblast proliferation","connective tissue growth"],"phonetic":"/ˌfaɪbroʊˈpleɪʒə/","extraExplanation":["词源提示：fibro- 表示“纤维”，-plasia 表示“形成/生成”。合起来就是“纤维组织的生成”。","医学语境里它常与 wound healing（伤口愈合）、scar formation（瘢痕形成）、fibrosis（纤维化，偏病理性、持续性）等词一起出现。fibroplasia 更强调“形成/增生的过程”，fibrosis 更强调“结果/病变”。"]}
{"word":"fibroplastic","summary":{"en":"“Fibroplastic” is a medical adjective meaning involving the formation or growth of fibrous connective tissue (often in healing or certain lesions/tumors).","zh":"“Fibroplastic”是医学形容词，指与纤维性结缔组织的形成或增生有关（常见于愈合过程或某些病变/肿瘤的描述）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the formation or growth of fibrous (scar-like) connective tissue, especially during healing or in certain diseases.","zh":"（尤指在愈合或某些疾病中）与纤维性（类似疤痕的）结缔组织的形成或增生有关的。"},"examples":[{"en":"The biopsy showed a fibroplastic response consistent with tissue repair.","zh":"活检显示纤维增生性反应，符合组织修复的表现。"},{"en":"Doctors monitored the fibroplastic changes around the surgical site.","zh":"医生监测手术部位周围的纤维增生性变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a tumor or lesion made of, or characterized by, fibrous tissue growth (used mainly in medical writing).","zh":"（主要用于医学文献）形容由纤维组织增生构成或以纤维组织增生为特征的肿瘤或病变。"},"examples":[{"en":"The report mentioned a fibroplastic lesion requiring follow-up imaging.","zh":"报告提到一个纤维增生性病变，需要随访影像检查。"},{"en":"A fibroplastic tumor can resemble other soft-tissue masses on scans.","zh":"纤维增生性肿瘤在影像上可能与其他软组织肿块相似。"}]}],"synonyms":["fibrous","fibrogenic","fibroproliferative","scar-forming"],"phonetic":"/ˌfaɪbroʊˈplæstɪk/","extraExplanation":["这个词多见于医学语境：fibro- 表示“纤维/纤维组织”，-plastic 来自 plastic（与“塑形、形成”有关），合起来强调“纤维组织的形成或增生”。日常英语中不常用，更多出现在病理报告、研究论文、影像学描述等。"]}
{"word":"fibropleural","summary":{"en":"A medical adjective meaning “related to the pleura and fibrous tissue,” often describing scarring or thickening around the lungs.","zh":"医学形容词，意为“与胸膜及纤维组织相关”，常指肺周围的瘢痕或增厚改变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pleura (the membranes around the lungs) and fibrous tissue; used especially in medical contexts to describe scarring or thickening around the lungs.","zh":"与胸膜（包围肺的膜）和纤维组织有关的；多用于医学语境，描述肺周围的瘢痕或增厚。"},"examples":[{"en":"The CT scan showed fibropleural thickening on the right side.","zh":"CT 显示右侧存在胸膜纤维性增厚（fibropleural thickening）。"},{"en":"Fibropleural scarring can reduce how easily the lungs expand.","zh":"胸膜纤维性瘢痕可能会降低肺部扩张的顺畅程度。"}]}],"synonyms":["pleural fibrotic","fibrotic pleural","fibrothoracic (related term)"],"phonetic":"/ˌfaɪ.broʊˈplʊr.əl/","extraExplanation":["这是一个较少见的医学形容词，常见于影像学报告或病理描述中，例如 fibropleural thickening（胸膜纤维性增厚）、fibropleural fibrosis（胸膜纤维化）。","构词可拆为 fibro-（纤维）+ pleural（胸膜的）。它通常指“胸膜相关的纤维化/瘢痕改变”，并不等同于某一种单独疾病名称，而是对组织改变的描述。"]}
{"word":"fibropolypus","summary":{"en":"A medical term for a fibrous (usually benign) polyp.","zh":"医学用语：指主要由纤维组织构成、通常为良性的息肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a polyp (a small growth) made mainly of fibrous tissue; a type of benign (non-cancerous) polyp often described in medical contexts.","zh":"纤维性息肉：主要由纤维组织构成的息肉（小的赘生物）；常见于医学语境，通常为良性（非癌性）。"},"examples":[{"en":"The pathology report described the lesion as a fibropolypus with no signs of malignancy.","zh":"病理报告将该病灶描述为纤维性息肉，未见恶性迹象。"},{"en":"The doctor explained that a fibropolypus can often be removed with a simple procedure.","zh":"医生解释说，纤维性息肉通常可以通过较简单的手术切除。"}]}],"synonyms":["fibrous polyp","polyp","fibroepithelial polyp"],"phonetic":"/ˌfaɪbroʊˈpɑlɪpəs/","extraExplanation":["“fibro-”表示“纤维的”，“polypus”是“息肉”的较旧/较正式写法（现代更常用 polyp）。因此 fibropolypus 基本可理解为“纤维性息肉/纤维息肉”。","该词多见于病理报告、临床记录或较旧的医学文献中；日常英语里几乎不会使用。"]}
{"word":"fibroproliferative","summary":{"en":"A medical adjective meaning “involving the overgrowth of fibrous (scar-like) tissue.”","zh":"医学形容词：指“与纤维性（疤痕样）组织增生有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Relating to the growth and multiplication of fibrous (scar-like) tissue, often as part of healing or disease.","zh":"（医学）与纤维性（疤痕样）组织的增生有关，常见于愈合过程或某些疾病中。"},"examples":[{"en":"The patient developed a fibroproliferative response after the injury.","zh":"这位病人在受伤后出现了纤维增生性反应。"},{"en":"Fibroproliferative changes can lead to scarring and reduced organ function.","zh":"纤维增生性改变可能导致瘢痕形成并降低器官功能。"},{"en":"Researchers are studying drugs that may prevent fibroproliferative lung disease.","zh":"研究人员正在研究可能预防纤维增生性肺部疾病的药物。"}]}],"synonyms":["fibrotic","scar-forming","fibrosis-related"],"phonetic":"/ˌfaɪbroʊprəˈlɪfərətɪv/","extraExplanation":["这个词多用于医学/科研语境：fibro-（纤维、成纤维细胞相关）+ proliferative（增生的）。常指成纤维细胞活动增强、胶原等细胞外基质增加，最终可能造成“纤维化/瘢痕化”。","在临床上常见搭配有：fibroproliferative disorder（纤维增生性疾病）、fibroproliferative phase（纤维增生期，如某些肺损伤后的阶段）、fibroproliferative changes（纤维增生性改变）。它往往带有“可能造成病理性瘢痕”的含义，而不只是一般的正常修复。"]}
{"word":"fibropsammoma","summary":{"en":"A rare pathology term for a fibrous tumor/lesion characterized by many psammoma bodies (sand-like calcifications).","zh":"一个较罕见的病理学术语，指含大量砂粒体（沙样钙化小体）的纤维性肿瘤/病变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine, pathology) A rare, usually benign tumor or tumor-like lesion made of fibrous tissue containing many psammoma bodies (tiny, sand-like calcifications), most often described in meningeal or gynecologic pathology reports.","zh":"（医学/病理）一种罕见、通常为良性的肿瘤或类肿瘤病变，由纤维组织构成，并含有大量砂粒体（psammoma bodies，细小如沙的钙化小体）；多见于脑膜或妇科相关的病理报告描述中。"},"examples":[{"en":"The pathology report mentioned a fibropsammoma with prominent psammoma bodies.","zh":"病理报告提到“纤维砂粒瘤（fibropsammoma）”，并指出砂粒体很明显。"},{"en":"Because fibropsammoma is uncommon, the doctor explained the findings in simple terms.","zh":"由于纤维砂粒瘤较少见，医生用更通俗的方式解释了检查结果。"}]}],"synonyms":["psammoma","psammomatous tumor","psammomatous meningioma (context-dependent)"],"phonetic":"/ˌfaɪbroʊˌsæˈmoʊmə/","extraExplanation":["词源拆解：fibro-（纤维）+ psammoma（含“砂粒体”的肿瘤/病变；psammos 在希腊语中有“沙”的意思）。因此它强调“纤维成分 + 砂粒样钙化”。","在实际临床写作中，这个词并不常见，医生更常用更具体的诊断名称（如“psammomatous …/含砂粒体的…”）来表述；具体含义需结合发生部位与完整病理结论理解。"]}
{"word":"fibropurulent","summary":{"en":"A medical adjective meaning “fibrous and pus-forming/containing,” often describing exudate or inflammation.","zh":"医学形容词，表示“兼具纤维性与化脓性/含脓的”，常用于描述渗出物或炎症。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or made up of both fibrous tissue and pus; describing an inflammation or discharge that is partly fibrous and partly purulent.","zh":"纤维脓性的；含有（或由）纤维组织与脓液共同构成的；用于描述既有纤维性成分又有化脓性成分的炎症或分泌物。"},"examples":[{"en":"The doctor noted a fibropurulent exudate in the wound.","zh":"医生记录到伤口里有纤维脓性渗出物。"},{"en":"Microscopy showed fibropurulent inflammation, suggesting infection with tissue reaction.","zh":"显微镜下显示纤维脓性炎症，提示感染并伴随组织反应。"}]}],"synonyms":["purulent","suppurative","fibrous"],"phonetic":"/ˌfaɪbroʊˈpjʊrələnt/","extraExplanation":["词源拆解：fibro- 表示“纤维/纤维组织”，purulent 表示“化脓的/含脓的”，合起来强调“纤维性 + 化脓性”两种特征同时存在。","常见搭配（多用于医学语境）：fibropurulent exudate（纤维脓性渗出物）、fibropurulent inflammation（纤维脓性炎症）、fibropurulent debris（纤维脓性碎屑）。","使用提示：这是偏专业的病理/临床描述词，日常英语中很少使用；在非医学写作里通常用更通俗的表达，如 “pus-filled” 或 “infected discharge”。"]}
{"word":"fibroreticular","summary":{"en":"A medical adjective describing tissue that is both fibrous and net-like in structure.","zh":"一个医学形容词，描述“既纤维性又呈网状结构”的组织特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made of fibrous (fiber-like) tissue and a net-like (reticular) structure, especially in medical or biological contexts.","zh":"（尤用于医学/生物学）与纤维性组织和网状（网织状）结构有关的；由纤维与网状结构组成的。"},"examples":[{"en":"The biopsy showed a fibroreticular pattern in the tissue.","zh":"活检显示该组织呈现纤维网状（fibroreticular）形态。"},{"en":"Fibroreticular changes can be seen in some chronic inflammatory conditions.","zh":"在一些慢性炎症情况下可以看到纤维网状改变。"}]}],"synonyms":["fibrous-reticular","reticulofibrous","fibrous (partial)","reticular (partial)"],"phonetic":"/ˌfaɪbroʊrɪˈtɪkjələr/","extraExplanation":["这是一个较专业的医学形容词：fibro- 表示“纤维”，reticular 表示“网状”。常用来描述组织学（显微镜下）看到的“既有纤维成分、又呈网状分布”的外观或结构。","在普通英语里不常见，多出现在病理报告、影像学描述或科研文章中。阅读时可把它理解为“纤维+网状”的组合特征。"]}
{"word":"fibroreticulate","summary":{"en":"A medical adjective meaning showing both fibrotic (scar-like) and reticular (net-like) features, often on imaging.","zh":"医学形容词：指同时呈现纤维化与网状纹理特征，常用于影像学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Having a pattern of both fibrosis (scar-like thickening) and reticulation (a net-like set of lines), especially seen on medical imaging or in tissue description.","zh":"（医学）指同时具有纤维化（瘢痕样增厚）与网状纹理（像网一样的线条）特征的，多用于影像学或组织学描述。"},"examples":[{"en":"The CT scan showed fibroreticulate changes in the lower lungs.","zh":"CT 显示下肺部有纤维网状改变。"},{"en":"The report described a fibroreticulate pattern consistent with chronic scarring.","zh":"报告描述为纤维网状模式，符合慢性瘢痕（长期纤维化）改变。"},{"en":"Doctors monitored the patient because fibroreticulate findings can suggest interstitial lung disease.","zh":"医生对患者进行随访监测，因为纤维网状表现可能提示间质性肺病。"}]}],"synonyms":["fibroreticular","fibrotic and reticular","reticular (in imaging context)"],"phonetic":"/ˌfaɪbroʊrɪˈtɪkjəleɪt/","extraExplanation":["这个词主要出现在放射科/病理科语境中（例如胸部 X 光或 CT 报告）。它不是日常英语词汇，更多是“描述性术语”，强调“纤维化 + 网状影”的组合外观。","常见相关部位是肺：当影像出现“线条交织成网”的纹理，同时伴有组织变厚或瘢痕样改变，就可能用 fibroreticulate 来概括这种外观。它本身不等于具体诊断，但可能支持某些疾病方向（需结合临床与其他检查）。"]}
{"word":"fibrosa","summary":{"en":"Fibrosa is a medical-Latin form meaning “fibrous,” usually seen inside anatomical/medical terms.","zh":"fibrosa 是医学拉丁语形式，意为“纤维性的”，常作为解剖/医学术语的一部分出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Medical Latin) “Fibrous”; made of or relating to fibrous (string-like) connective tissue. Often used as a descriptive word in anatomical or diagnostic names.","zh":"（医学拉丁语）“纤维性的；纤维组织的”。常用于解剖结构或疾病名称中作描述词。"},"examples":[{"en":"The sclera is the tough outer coat of the eye, also called the tunica fibrosa.","zh":"巩膜是眼球坚韧的外层，也称为“纤维膜”（tunica fibrosa）。"},{"en":"The report mentioned dysplasia fibrosa, meaning a condition involving abnormal fibrous tissue growth.","zh":"报告中提到“dysplasia fibrosa”，指与异常纤维组织增生有关的情况。"}]}],"synonyms":["fibrous","connective-tissue (contextual)"],"phonetic":"/faɪˈbroʊzə/","extraExplanation":["“fibrosa”多见于医学拉丁语，常作为阴性形式出现（与被修饰名词的性一致），例如 tunica fibrosa（纤维膜）。在英语医学文本中它通常作为术语的一部分出现，而不是日常英语里单独使用的词。"]}
{"word":"fibrosarcoma","summary":{"en":"Fibrosarcoma is a rare cancer that develops from fibrous connective tissue.","zh":"Fibrosarcoma（纤维肉瘤）是起源于纤维结缔组织的一种罕见恶性肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare malignant (cancerous) tumor that arises from fibrous connective tissue, often forming a mass in soft tissue or bone.","zh":"一种罕见的恶性（癌性）肿瘤，起源于纤维结缔组织，常在软组织或骨中形成肿块。"},"examples":[{"en":"The biopsy suggested fibrosarcoma, so the doctor discussed surgery and possible chemotherapy.","zh":"活检提示可能是纤维肉瘤，因此医生讨论了手术以及可能的化疗方案。"},{"en":"She noticed a firm lump that slowly grew; imaging later raised concern for fibrosarcoma.","zh":"她发现一个坚硬的肿块在缓慢变大；之后影像检查提示可能是纤维肉瘤。"}]}],"synonyms":["sarcoma","soft-tissue sarcoma"],"phonetic":"/ˌfaɪbroʊsɑrˈkoʊmə/","extraExplanation":["词源小提示：fibro- 表示“纤维”，sarcoma 表示“肉瘤（源自结缔组织的恶性肿瘤）”。因此 fibrosarcoma 字面意思就是“纤维性的肉瘤”。","医学语境中常见搭配：soft-tissue fibrosarcoma（软组织纤维肉瘤）、infantile fibrosarcoma（婴幼儿纤维肉瘤）。在非医学语境不常用，通常出现在病理报告、影像学报告或肿瘤科讨论中。","温和提醒：该词涉及疾病诊断与治疗，具体含义和分型需要由专业医生结合病理结果解释。"]}
{"word":"fibrose","summary":{"en":"“Fibrose” is usually a nonstandard/foreign form in English; the common English term is “fibrosis,” meaning the scarring/thickening of tissue.","zh":"“fibrose”在英语里多为非标准或外来写法；常用英语词是“fibrosis”，指组织增厚并瘢痕化（纤维化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) a condition in which body tissue becomes thickened and scarred, often affecting organs such as the lungs or liver.","zh":"（医学）纤维化：身体组织变厚并形成瘢痕的状态，常影响肺、肝等器官。"},"examples":[{"en":"Pulmonary fibrosis can make it hard to breathe during daily activities.","zh":"肺纤维化会让人在日常活动中呼吸困难。"},{"en":"The doctor explained that fibrosis may develop after long-term inflammation.","zh":"医生解释说，长期炎症后可能会发展为纤维化。"}]},{"partOfSpeech":"other","definition":{"en":"In French, “fibrose” can refer to fibrosis; in English, the standard word is “fibrosis.”","zh":"在法语中，“fibrose”可指“纤维化”；在英语里标准用词是“fibrosis”。"},"examples":[{"en":"In English medical writing, use “fibrosis,” not “fibrose.”","zh":"英语医学写作中应使用“fibrosis”，而不是“fibrose”。"},{"en":"The French report mentioned “fibrose hépatique,” meaning liver fibrosis.","zh":"法语报告提到“fibrose hépatique”，意思是肝纤维化。"}]}],"synonyms":["fibrosis","scarring","tissue scarring"],"phonetic":"/faɪˈbroʊsɪs/","extraExplanation":["“fibrose”常见于法语或受法语影响的医学资料；英语里更常见也更规范的拼写是“fibrosis”。","词根提示：fibr- 与“纤维（fiber）”有关，-osis 常表示“（疾病）状态”。"]}
{"word":"fibroserosal","summary":{"en":"A medical adjective meaning ‘involving fibrous tissue and a serosa.’","zh":"医学形容词，指“涉及纤维组织与浆膜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving both fibrous tissue and a serosa (the smooth membrane covering organs in the chest or abdomen), especially in medical/pathology descriptions.","zh":"（医学）与“纤维组织”和“浆膜（覆盖胸腹腔器官的光滑膜）”两者有关的；常用于病理或手术记录中描述相关组织或病变。"},"examples":[{"en":"The surgeon noted fibroserosal adhesions around the intestine.","zh":"外科医生记录到肠道周围存在纤维-浆膜性粘连。"},{"en":"Biopsy showed fibroserosal inflammation of the appendix.","zh":"活检显示阑尾存在纤维-浆膜性炎症。"}]}],"synonyms":["fibrous and serosal","fibro-serosal (hyphenated form)"],"phonetic":"/ˌfaɪbroʊˈsɪrəsəl/","extraExplanation":["词源构成：fibro- 表示“纤维（组织）”，serosal 来自 serosa（浆膜）。组合后常见于病理报告，用来说明病变累及“纤维性成分 + 浆膜表面/层”。","常见搭配：fibroserosal adhesions（纤维-浆膜性粘连）、fibroserosal inflammation（纤维-浆膜性炎症）。在日常英语中很少用，主要是医学语境。"]}
{"word":"fibroserous","summary":{"en":"Fibroserous describes tissue or membranes that combine fibrous and serous components (a common medical term).","zh":"fibroserous 指同时具有“纤维性”和“浆膜性”成分的组织或膜（常见于医学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Made of or involving both fibrous tissue and a serous (smooth, membrane-like) lining; relating to a fibrous-serous membrane.","zh":"（医学）由纤维组织与浆膜（光滑的膜状组织）共同构成的；与纤维-浆膜组织/膜有关的。"},"examples":[{"en":"The surgeon noted a fibroserous layer covering the organ.","zh":"外科医生注意到器官表面覆盖着一层纤维-浆膜层。"},{"en":"Fibroserous adhesions can form after inflammation or surgery.","zh":"炎症或手术后可能形成纤维-浆膜性粘连。"},{"en":"The report described thickening of a fibroserous membrane.","zh":"报告描述了纤维-浆膜膜的增厚。"}]}],"synonyms":["fibrous-serous","fibroserosal"],"phonetic":"/ˌfaɪbroʊˈsɪrəs/","extraExplanation":["这个词主要出现在解剖学、病理学和手术记录中，用来描述“既有纤维性（较坚韧、结缔组织）又有浆膜性（薄而光滑的膜）”的结构或改变。","词形上可拆为 fibro-（纤维、纤维组织）+ serous（浆膜的/浆液的）。在日常英语中很少使用，更多见于医学文献。"]}
{"word":"fibroses","summary":{"en":"“Fibroses” means multiple cases or types of fibrosis (scar-tissue buildup that stiffens organs).","zh":"“Fibroses”指多种或多处“纤维化”（瘢痕样纤维组织增生导致器官变硬、功能下降）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of fibrosis: diseases or conditions in which excess fibrous (scar-like) tissue forms in an organ, often making it stiff and less able to work normally","zh":"fibrosis 的复数：指纤维化（某个器官或组织出现过多纤维性/瘢痕样组织），常导致变硬、功能下降的疾病或状况"},"examples":[{"en":"Doctors monitor lung function in patients with progressive fibroses.","zh":"医生会监测进行性纤维化患者的肺功能。"},{"en":"Different fibroses can affect the liver, lungs, or heart.","zh":"不同类型的纤维化可能影响肝脏、肺或心脏。"}]}],"synonyms":["fibrosis (plural cases)","scarring (medical context)","fibrotic disease"],"phonetic":"/faɪˈbroʊsɪz/","extraExplanation":["“fibroses”常见于医学写作或研究论文中，强调“多种/多处纤维化”或“多例纤维化疾病”。日常交流里更常说“fibrosis（纤维化）”。","词形提示：fibrosis（单数）→ fibroses（复数）。发音中 -ses 读作 /siːz/ 的感觉。"]}
{"word":"fibrosis","summary":{"en":"Fibrosis is the abnormal formation of excess scar-like fibrous tissue in an organ, which can reduce its function.","zh":"Fibrosis（纤维化）指器官内异常形成过多类似疤痕的纤维组织，可能降低器官功能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which too much fibrous (scar-like) tissue forms in an organ, making it thicker, stiffer, and less able to work normally.","zh":"（医学）纤维化：器官内过多的纤维（类似疤痕的）组织增生，导致组织变厚、变硬，从而影响正常功能。"},"examples":[{"en":"Long-term inflammation can lead to fibrosis in the lungs.","zh":"长期炎症可能导致肺部纤维化。"},{"en":"The doctor explained that liver fibrosis can worsen if the cause isn’t treated.","zh":"医生解释说，如果不治疗病因，肝纤维化可能会加重。"},{"en":"They monitored her heart fibrosis with regular imaging tests.","zh":"他们用定期影像检查来监测她的心脏纤维化。"}]}],"synonyms":["scarring","fibrotic scarring","tissue scarring"],"phonetic":"/faɪˈbroʊsɪs/","extraExplanation":["“fibrosis”来自词根“fiber（纤维）”，加上表示状态/过程的后缀“-osis”（常见于医学名词，如“cirrhosis 肝硬化”“scoliosis 脊柱侧弯”）。","日常英语里它多出现在医疗语境；在非医学场景中更常用“scarring（结疤/瘢痕形成）”来表达“出现疤痕组织”的概念。"]}
{"word":"fibrosities","summary":{"en":"“Fibrosities” means fibrous conditions or fibrous masses/structures, often mentioned in medical contexts.","zh":"“Fibrosities”指纤维性状态或纤维性团块/结构，常用于医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of fibrosity) the condition or quality of being fibrous; a fibrous structure or mass (often in a medical/pathology context).","zh":"（fibrosity 的复数）纤维性状态；纤维状结构或纤维性团块（常见于医学/病理语境）。"},"examples":[{"en":"The biopsy report mentioned fibrosities in the lung tissue.","zh":"活检报告提到肺组织中存在纤维性团块。"},{"en":"Years of inflammation can lead to fibrosities that make an organ less flexible.","zh":"长期炎症可能导致纤维性改变，使器官弹性下降。"}]}],"synonyms":["fibrous tissue","fibrous changes","fibrotic tissue","fibrosis (related term)"],"phonetic":"/faɪˈbrɑsəti/","extraExplanation":["“fibrosities”较少见，多用于医学写作；更常看到的是“fibrosis（纤维化）”或“fibrotic tissue（纤维化组织）”。","词形提示：fibrosity = fibro-（纤维）+ -osity（……的状态/性质）。因此它强调“纤维性这一性质/状态”，而不是某一种具体疾病名称。"]}
{"word":"fibrositis","summary":{"en":"“Fibrositis” is an older medical term for chronic muscle/soft-tissue pain; today it’s often considered outdated and linked to fibromyalgia.","zh":"“Fibrositis”是描述慢性肌肉/软组织疼痛的旧医学用语；现多被认为过时，常与纤维肌痛（fibromyalgia）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older term for chronic muscle and soft-tissue pain and tenderness, now often discussed under conditions like fibromyalgia","zh":"（旧称）指慢性的肌肉与软组织疼痛、压痛；如今多常归入或与“纤维肌痛综合征（fibromyalgia）”等概念相关"},"examples":[{"en":"The doctor said the diagnosis of fibrositis is outdated and may actually refer to fibromyalgia.","zh":"医生说“fibrositis”这种诊断说法已经过时，可能其实指的是纤维肌痛综合征。"},{"en":"She was once told she had fibrositis because of widespread muscle aches.","zh":"她因为广泛的肌肉酸痛，曾被告知患有“fibrositis”。"}]}],"synonyms":["fibromyalgia (related modern term)","myofascial pain (related, depending on context)"],"phonetic":"/ˌfaɪbroʊˈsaɪtɪs/","extraExplanation":["“fibrositis”字面上像是“纤维组织发炎”（-itis 常表示“炎症”），但后来研究发现很多患者并没有明确的炎症证据，所以医学上逐渐不用这个词，更多使用“fibromyalgia（纤维肌痛）”等更符合现代理解的术语。","在日常阅读中，你可能会在较老的病历、旧书或患者自述中看到 fibrositis。遇到时可把它理解为“慢性肌肉疼痛/软组织疼痛的一种旧说法”，并留意上下文是否在谈 fibromyalgia。"]}
{"word":"fibrosity","summary":{"en":"Fibrosity means the quality of being fibrous, or (in medicine) the development of fibrous tissue.","zh":"Fibrosity 指“纤维性”，也可指（医学上）纤维组织的形成或增生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being fibrous; having many fibers or fibrous tissue","zh":"纤维性；多纤维的状态或性质（含较多纤维或纤维组织）"},"examples":[{"en":"The doctor noted increased fibrosity in the lung tissue on the scan.","zh":"医生在扫描中注意到肺组织的纤维性增加。"},{"en":"Some cuts of meat have more fibrosity and feel tougher to chew.","zh":"有些部位的肉纤维性更强，嚼起来更硬。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) the formation or buildup of fibrous tissue, often linked to scarring or fibrosis","zh":"（医学）纤维组织的形成或增生（常与瘢痕或纤维化相关）"},"examples":[{"en":"Chronic inflammation can lead to fibrosity and reduced organ function.","zh":"慢性炎症可能导致纤维组织增生，并降低器官功能。"},{"en":"The report described mild fibrosity around the surgical site.","zh":"报告描述手术部位周围有轻度纤维组织增生。"}]}],"synonyms":["fibrousness","fibrosis (medical context)","stringiness (food/meat context)"],"phonetic":"/faɪˈbrɑːsəti/","extraExplanation":["“fibrosity”在日常英语中不常用，更常见的是“fibrous”（形容词：纤维性的）和“fibrosis”（名词：纤维化）。在医学语境里，如果你看到“fibrosity”，通常是在描述组织的“纤维化程度/纤维组织增多”，语气比“fibrosis”更偏向“性质/特征”的描述。"]}
{"word":"fibrospongiae","summary":{"en":"Fibrospongiae is an older plural scientific term for sponges with a fibrous (“horny”) skeleton.","zh":"Fibrospongiae 是一个较旧的复数科学术语，指骨架以纤维（角质）结构为主的海绵类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, plural) A former scientific group of sponges characterized by a fibrous (often “horny”) skeleton rather than hard mineral spicules; roughly similar to what many modern sources call keratose/horny sponges.","zh":"（动物学，复数）一种旧的海绵分类名称，指骨架以纤维状（常称“角质”）结构为主、而不是以硬的矿物骨针为主的海绵类群；大致相当于现代常说的“角质/角海绵（horny/keratose sponges）”。"},"examples":[{"en":"In older zoology books, Fibrospongiae were described as sponges with a tough, fibrous framework.","zh":"在较早的动物学书籍里，Fibrospongiae 常被描述为具有坚韧纤维骨架的海绵。"},{"en":"Some texts contrast Fibrospongiae with groups that have many mineral spicules.","zh":"有些文本会把 Fibrospongiae 与含有大量矿物骨针的海绵类群作对比。"}]}],"synonyms":["horny sponges","keratose sponges"],"phonetic":"/ˌfaɪbroʊˈspʌndʒiˌiː/","extraExplanation":["这是一个较偏“历史分类学”的术语：不同年代的海绵分类体系差异很大，很多旧名称在现代文献中已不常用，阅读时可把它理解为“以海绵蛋白纤维（spongin）为骨架的海绵”。","词形上是拉丁化复数（-ae），常见于旧式生物分类名；单数形式可见作 Fibrospongia（但在现代资料中也不常见）。"]}
{"word":"fibrostenotic","summary":{"en":"Fibrostenotic means “scar-tissue-related narrowing,” especially in medical contexts like intestinal strictures.","zh":"fibrostenotic 指“由纤维化（瘢痕组织）导致的狭窄”，常用于如肠道狭窄等医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Describing a condition where fibrous (scar-like) tissue causes narrowing (stenosis) of a tube or passage in the body, such as the intestine or an airway.","zh":"（医学）指纤维化（瘢痕样组织增生）导致身体某个管腔或通道变窄（狭窄）的情况，如肠道或气道。"},"examples":[{"en":"The CT scan suggested a fibrostenotic stricture in the small intestine.","zh":"CT检查提示小肠存在纤维狭窄性的狭窄段。"},{"en":"Some patients with Crohn’s disease develop a fibrostenotic form that can block the bowel.","zh":"部分克罗恩病患者会发展为纤维狭窄型，可能导致肠道梗阻。"},{"en":"Treatment differs for inflammatory versus fibrostenotic disease.","zh":"炎症型与纤维狭窄型疾病的治疗方式不同。"}]}],"synonyms":["fibrotic","stenotic","scar-related narrowing","stricturing (context-dependent)"],"phonetic":"/ˌfaɪbroʊstəˈnɑtɪk/","extraExplanation":["词源拆解：fibro- 表示“纤维/纤维组织”，stenotic 来自 stenosis（狭窄）。合起来强调“因纤维化而造成的狭窄”。","常见于胃肠科与炎症性肠病（尤其克罗恩病）的语境：fibrostenotic stricture（纤维狭窄性狭窄）多与瘢痕形成有关，通常不像单纯炎症那样容易用抗炎药完全逆转，临床上可能需要扩张或手术等处理。"]}
{"word":"fibrotic","summary":{"en":"“Fibrotic” means related to fibrosis—abnormal thickening and scarring of tissue.","zh":"fibrotic 指与纤维化有关的，即组织异常增厚并发生瘢痕化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having to do with fibrosis—thickening and scarring of body tissue, often in an organ (such as the lungs or liver).","zh":"与“纤维化”有关的；指身体组织（常见于肺、肝等器官）变厚并发生瘢痕化（疤痕形成）的。"},"examples":[{"en":"The scan showed fibrotic changes in the lungs.","zh":"扫描显示肺部出现纤维化改变。"},{"en":"Doctors are monitoring his fibrotic liver tissue closely.","zh":"医生正在密切监测他肝脏的纤维化组织。"}]}],"synonyms":["fibrous","scarred","sclerotic"],"phonetic":"/faɪˈbrɑːtɪk/","extraExplanation":["在医学语境里，fibrotic 常用来描述一种“病理性的组织变硬、变厚、结疤”的状态，常见搭配有 fibrotic changes（纤维化改变）、fibrotic tissue（纤维化组织）、fibrotic scarring（纤维化瘢痕）。","词根提示：fibro- 表示“纤维/纤维组织”（如 fibroblast 成纤维细胞），-tic 表示“……的”。理解词根有助于记忆：fibrotic = 纤维化相关的。","与 scarred（有疤的）相比，fibrotic 更偏医学/影像或病理描述；与 hardened（变硬的）相比，fibrotic 强调“纤维组织增生导致的硬化与瘢痕化”，而不只是一般的变硬。"]}
{"word":"fibrotuberculosis","summary":{"en":"Fibrotuberculosis is a (usually lung) form of TB marked by fibrosis/scarring from long-term infection.","zh":"fibrotuberculosis 指一种以组织纤维化/瘢痕形成为特征的（多见于肺部的）结核病类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of tuberculosis (TB) in which lung tissue becomes scarred and thickened (fibrosis), often after long-lasting infection.","zh":"一种结核病（TB）类型，常见于肺部；由于长期感染导致组织纤维化（形成瘢痕、变厚）。"},"examples":[{"en":"The chest X-ray suggested fibrotuberculosis with scarring in the upper lobes.","zh":"胸部X光提示上叶有瘢痕，考虑纤维性结核。"},{"en":"Fibrotuberculosis may cause chronic cough and shortness of breath.","zh":"纤维性结核可能引起长期咳嗽和呼吸困难。"}]}],"synonyms":["fibro-tuberculosis","fibrocaseous tuberculosis","post-tuberculosis fibrosis (related)"],"phonetic":"/ˌfaɪbroʊtjuˌbɝkjəˈloʊsɪs/","extraExplanation":["这是偏医学/病理学用语，日常英语中很少用；更多时候会说“pulmonary tuberculosis (TB)”或“post‑tuberculosis fibrosis（结核后纤维化）”。","词形上可拆成 fibro-（纤维、纤维化）+ tuberculosis（结核病）。在临床语境里，它强调“结核导致的瘢痕/纤维化改变”，常用于影像学或病理描述。"]}
{"word":"fibrous","summary":{"en":"Fibrous describes something that has many fibers or a tough, stringy texture, especially in plants, foods, or tissues.","zh":"Fibrous 指“纤维状/含大量纤维”的，常用于植物、食物口感或生物组织等，强调粗硬、有筋的质地或纤维结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of or containing many fibers; having a tough, stringy texture.","zh":"纤维状的；含大量纤维的；（口感/质地）粗硬有筋的。"},"examples":[{"en":"Celery has a fibrous texture, so it can be a bit stringy when you chew it.","zh":"芹菜的质地很纤维，咀嚼时会有点拉丝、有筋。"},{"en":"Doctors often recommend a fibrous diet to help digestion.","zh":"医生常建议吃高纤维的饮食来帮助消化。"},{"en":"The plant’s fibrous roots help it hold tightly to the soil.","zh":"这种植物的纤维状根系能让它牢牢抓住土壤。"}]}],"synonyms":["stringy","fibery","tough","sinewy","fiber-rich"],"phonetic":"/ˈfaɪbrəs/","extraExplanation":["“fibrous”来自“fiber/fibre（纤维）”。它既可用于生物/食物（高纤维、纤维质地），也常用于材料与组织（如 fibrous tissue 纤维组织、fibrous insulation 纤维保温材料）。","常见搭配：fibrous diet（高纤维饮食）、fibrous vegetables（富含纤维的蔬菜）、fibrous tissue（纤维组织）、fibrous roots（须根/纤维状根）。","区分：fibrous（纤维状、含纤维、偏质地/结构）≠ fiber-rich（富含膳食纤维，偏营养含量）。食品语境里两者都能用，但“fiber-rich”更像营养标签表达。"]}
{"word":"fibrous roots","summary":{"en":"Many thin roots spreading from the plant base.","zh":"从植株基部散开的许多细根（须根系）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A root system made up of many thin, similarly sized roots spreading out from the base of a plant (not one main thick root).","zh":"由许多细而大小相近的根从植株基部向外扩展形成的根系（不是一条主要的粗根）。"},"examples":[{"en":"Grasses usually have fibrous roots that spread near the soil surface.","zh":"禾本科植物通常有须根系，主要在土壤表层扩展。"},{"en":"Fibrous roots help hold the soil in place and reduce erosion.","zh":"须根系能固定土壤、减少水土流失。"},{"en":"When you transplant this plant, keep as much of the fibrous roots as possible.","zh":"移栽这种植物时，尽量保留更多的须根。"}]}],"synonyms":["fibrous root system","adventitious roots"],"phonetic":"/ˈfaɪbɚs ruːts/","extraExplanation":["常见对比：fibrous roots（须根系）vs. taproot（直根/主根系，如胡萝卜）。须根系更擅长在表层快速吸收水分与养分，并帮助植物牢固“抓住”土壤。","常见于：草类、谷物（如小麦、稻）、洋葱等。园艺与农业中谈到移栽、固土、防侵蚀时经常出现这个词组。"],"etymology":"来自形容词 fibrous（“像纤维一样的、多纤维的”）+ roots（“根”）。用于植物学时，强调“细而多、像纤维一样分散”的根系结构。","mnemonic":["记忆：fiber=“纤维”，想象很多“纤维丝”一样的细根一把散开，就是须根系。","中文联想：“须根”像“胡须”——细细的一大把。"]}
{"word":"fibrous-and-areolar","summary":{"en":"An anatomy term meaning “made of or involving both fibrous and areolar connective tissue.”","zh":"解剖学用语，表示“由纤维性组织与疏松（蜂窝）结缔组织共同构成/相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to two kinds of connective tissue: fibrous tissue (dense, strong tissue) and areolar tissue (loose, flexible tissue). Often used in anatomy to describe layers or membranes made of these tissues.","zh":"与两种结缔组织有关：纤维性组织（致密、强韧）和疏松结缔组织/蜂窝组织（柔软、有弹性）。常用于解剖学中描述由这些组织构成的层或膜。"},"examples":[{"en":"The surgeon separated the fibrous-and-areolar layer to reach the underlying muscle.","zh":"外科医生分离了纤维性与疏松结缔组织层，以到达下面的肌肉。"},{"en":"In the textbook, the fascia is described as fibrous-and-areolar connective tissue.","zh":"在教材中，筋膜被描述为纤维性与疏松结缔组织。"}]}],"synonyms":["fibroareolar","fibrous and areolar connective tissue","fibro-areolar (variant)"],"phonetic":"/ˈfaɪbrəs ænd əˈriːələr/","extraExplanation":["“fibrous-and-areolar”多见于医学/解剖学写作，是把两个形容词用连字符连接，表示“同时具有……特征的”。现代教材更常写作“fibrous and areolar connective tissue”或直接说“fibroareolar tissue（纤维疏松组织）”。","纤维性组织（fibrous）通常更致密、抗拉强；疏松结缔组织（areolar）更柔软、含较多间隙，利于血管和神经通过。两者常一起出现，用来描述筋膜、皮下组织等层次。"]}
{"word":"fibrous-and-nuclear","summary":{"en":"Fibrous-and-nuclear means having both fibrous (fiber-like/scar-like) and nuclear (cell-nucleus-related) features, usually in medical or scientific descriptions.","zh":"fibrous-and-nuclear 指同时具有纤维性（纤维状/瘢痕样）与核相关（细胞核层面）特征的，多用于医学或科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually in biology/medicine) describing something that has both fibrous (fiber-like or scar-like connective tissue) and nuclear (related to cell nuclei) features or components.","zh":"（多用于生物/医学）形容同时具有“纤维性”（纤维状或瘢痕样结缔组织）和“核的/细胞核相关”（与细胞核有关）特征或成分。"},"examples":[{"en":"The report mentioned fibrous-and-nuclear changes in the sample.","zh":"报告提到样本中存在纤维性与核相关的变化。"},{"en":"Under the microscope, the lesion looked fibrous-and-nuclear rather than purely inflammatory.","zh":"在显微镜下，这个病灶呈现纤维性与核相关的特征，而不完全是炎症性的。"}]}],"synonyms":["fibrous and nuclear","fibrotic and nuclear","with fibrous and nuclear features","fibrous with nuclear changes"],"phonetic":"/ˈfaɪbrəs ænd ˈnuːkliɚ/","extraExplanation":["这是一个技术性复合形容词，常见于病理学/组织学语境。fibrous 常指纤维化（纤维组织增多、可能与瘢痕修复相关）；nuclear 常指“细胞核层面”的特征（如核大小、形状、染色深浅等）。把两者并列（X-and-Y）通常表示“同时具有两种特征”，而不一定是固定词条。写作中也可能改写为 fibrous and nuclear features / fibrous, nuclear changes。"]}
{"word":"fibrous-crystalline","summary":{"en":"An adjective describing a material with both fiber-like and crystal-ordered structure.","zh":"形容材料同时具有纤维状与晶体有序结构的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a material) Having a structure that is both fibrous (made of thin, thread-like strands) and crystalline (made of ordered crystals).","zh":"（材料）同时具有纤维状（细丝状）与晶体状（有规则晶格/晶体）结构的。"},"examples":[{"en":"The lab report describes the sample as fibrous-crystalline under the microscope.","zh":"实验报告描述该样品在显微镜下呈纤维状-晶体状结构。"},{"en":"Some fibrous-crystalline minerals can split into thin strands and still show crystal faces.","zh":"一些纤维状-晶体状矿物能裂成细丝，同时仍可见晶面。"}]}],"synonyms":["fibrous and crystalline","fiber-like crystalline","crystalline-fibrous"],"phonetic":"/ˈfaɪbɹəs ˈkɹɪstəˌlaɪn/","extraExplanation":["“fibrous-crystalline”是带连字符的复合形容词，常见于材料科学、矿物学或工程写作，用来强调两种显微结构特征并存（纤维状 + 晶体有序）。","常见搭配：fibrous-crystalline structure/texture/microstructure（纤维状-晶体状结构/构造/显微组织）。在正式论文中也可能写作“fibrous crystalline”（不加连字符）或用更具体术语替代。"]}
{"word":"fibrous-ligamentous","summary":{"en":"Fibrous-ligamentous describes tissue that is both fibrous and ligament-like, often in medical contexts.","zh":"fibrous-ligamentous 指兼具纤维组织与韧带样特征的组织，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Made of, relating to, or containing both fibrous tissue and ligament-like (ligamentous) tissue.","zh":"（解剖/医学）由纤维组织与韧带样（韧带性）组织共同构成的；与两者相关的。"},"examples":[{"en":"The surgeon found a fibrous-ligamentous band restricting the joint’s movement.","zh":"外科医生发现一条纤维-韧带性束带限制了关节活动。"},{"en":"MRI suggested a fibrous-ligamentous structure rather than a muscle tear.","zh":"核磁共振提示为纤维-韧带性结构问题，而不是肌肉撕裂。"}]}],"synonyms":["fibro-ligamentous","fibrous and ligamentous","ligamentous-fibrous"],"phonetic":"ˈfaɪbrəs lɪˈɡæmən(t)əs","extraExplanation":["“fibrous-ligamentous”多见于影像学报告、手术记录或病理描述，用来强调组织成分：既偏“纤维化/纤维组织（fibrous）”，又具有“韧带样/韧带性（ligamentous）”特征。","英语医学写作里常用连字符把两个形容词并列（fibrous + ligamentous），表示“混合性质”或“兼具两种特征”，相当于中文的“纤维-韧带性/纤维韧带样”。"]}
{"word":"fibrous-rooted","summary":{"en":"Fibrous-rooted describes plants with many thin, spreading roots (a fibrous root system).","zh":"fibrous-rooted 指“须根的”，即根系由许多细根向外扩散（须根系）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a plant) having many thin, branching roots that spread out from the base of the stem, rather than one main taproot.","zh":"（指植物）具须根的；根系由许多细而分枝的根从茎基部向外扩散，而不是一条主根（直根）。"},"examples":[{"en":"Grasses are typically fibrous-rooted, which helps them hold soil in place.","zh":"禾本科植物通常是须根的，这有助于它们固定土壤。"},{"en":"A fibrous-rooted plant often handles transplanting better than a taprooted plant.","zh":"须根植物通常比直根植物更耐移栽。"}]}],"synonyms":["fibrous-rooted","with a fibrous root system","fibrous-rooted plant"],"phonetic":"/ˈfaɪbrəs ˈruːtɪd/","extraExplanation":["“fibrous-rooted”多用于园艺与植物学描述根系类型，常与“taprooted（直根的）”对比。须根系一般更浅、更分散，吸收表层水分较快，也更擅长防止水土流失；直根系往往更深，耐旱能力可能更强。","常见的须根植物包括草坪草、麦类、玉米、葱蒜等；常见直根植物包括胡萝卜、蒲公英等。实际情况会因品种和生长环境而有所不同。"]}
{"word":"fibrous-serous","summary":{"en":"Fibrous-serous describes a medical structure that combines tough fibrous tissue with a smooth serous lining.","zh":"fibrous-serous 指医学上同时具有坚韧纤维组织与光滑浆膜衬里的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Made of both fibrous tissue and a serous (smooth, fluid-producing) lining or surface.","zh":"（医学）由纤维组织和浆膜（光滑、可分泌浆液的膜）两部分构成的；兼具“纤维性 + 浆膜性”的。"},"examples":[{"en":"The pericardium has a fibrous-serous structure that protects the heart and reduces friction as it beats.","zh":"心包具有纤维-浆膜性结构，既保护心脏，也减少心脏跳动时的摩擦。"},{"en":"The report describes a fibrous-serous membrane surrounding the organ.","zh":"报告描述了包绕该器官的一层纤维-浆膜性膜。"}]}],"synonyms":["fibroserous","fibrous and serous"],"phonetic":"/ˈfaɪbrəs ˈsɪrəs/","extraExplanation":["这个词多见于解剖学/病理学语境，常用来描述“外层较坚韧的纤维层（fibrous）+ 内层光滑可分泌少量液体的浆膜层（serous）”的复合结构。典型例子是心包（pericardium）外层为纤维心包，内层为浆膜心包。","写作上有时也写作 fibrous and serous（不用连字符），但在强调“二者构成一个整体结构”时会用连字符。"]}
{"word":"fibrous-vascular","summary":{"en":"Fibrous-vascular describes a structure that includes both fibrous (supporting) and vascular (conducting) tissues.","zh":"fibrous-vascular 指同时具有纤维性（支撑）与维管性（输导）组织特征的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/biology) Made of or characterized by both fibrous tissue and vascular (conducting) tissue.","zh":"（植物学/生物学）由纤维组织与维管（输导）组织共同构成的；具有纤维性与维管性特征的。"},"examples":[{"en":"The stem has a fibrous-vascular structure that helps it stay strong while moving water and nutrients.","zh":"这种茎具有纤维—维管结构，既能保持坚固，又能输送水分和养分。"},{"en":"Under the microscope, the fibrous-vascular bundles are clearly visible.","zh":"在显微镜下，可以清楚看到纤维—维管束。"}]}],"synonyms":["fibrovascular","fiber-vascular","fibrous and vascular","vascular-fibrous"],"phonetic":"/ˈfaɪbrəs ˈvæskjələr/","extraExplanation":["这个词多见于植物解剖或组织学语境，用来强调两种功能同时存在：纤维成分偏“支撑/加固”，维管成分偏“输导（水分与有机养分）”。","写作中有时也会看到更常见的表达如“fibrovascular（纤维血管的）”，用于医学（如“fibrovascular tissue”）或生物学；在植物学里也常说“vascular bundles（维管束）”或“fibrous tissue（纤维组织）”。"]}
{"word":"fibrously","summary":{"en":"“Fibrously” means “in a fibrous, stringy way,” often describing how food, plants, or materials look or tear.","zh":"“fibrously”表示“以纤维状、筋状的方式”，常用来描述食物、植物或材料的质地或撕裂/断裂方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is fibrous; with a threadlike, stringy, or fiber-filled texture or structure.","zh":"以纤维状的方式；呈现出丝状、筋状或充满纤维的质地/结构。"},"examples":[{"en":"The celery stalk breaks fibrously, leaving long strings you can pull apart.","zh":"芹菜梗折断时会呈纤维状断裂，会留下可以拉开的长丝。"},{"en":"Overcooked meat can tear fibrously instead of slicing cleanly.","zh":"肉煮得过老时，撕开会呈纤维状，而不是干净利落地切开。"}]}],"synonyms":["stringily","with fibers","in a stringy way"],"phonetic":"/ˈfaɪbɹəsli/","extraExplanation":["“fibrously”是副词，来自形容词“fibrous”（纤维状的）+ 副词后缀“-ly”。它常用于描述食物的口感（stringy筋多）、植物组织的断裂方式，或材料/组织在显微层面的纤维结构。","写作中也可用作较“技术/描写性”的副词（如生物学、材料学、烹饪描述）。日常口语里更常直接说“stringy / full of fibers（筋很多/纤维很多）”。"]}
{"word":"fibrousness","summary":{"en":"Fibrousness means the quality of being fibrous—full of fibers or having a stringy texture.","zh":"Fibrousness 指“纤维性”，即充满纤维或呈丝状、筋道质地的特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being fibrous: having many fibers, or a stringy, thread-like texture.","zh":"纤维性；多纤维的特质：含有许多纤维，或呈现丝状、筋道的质地。"},"examples":[{"en":"The fibrousness of celery makes it crunchy but sometimes hard to chew.","zh":"芹菜的纤维性让它很脆，但有时也比较难嚼。"},{"en":"Some cuts of meat have too much fibrousness, so they feel tough.","zh":"有些部位的肉纤维性太强，所以吃起来很韧。"},{"en":"We judged the fabric by its fibrousness and how easily it frayed.","zh":"我们通过它的纤维性以及是否容易起毛边来判断这块布料。"}]}],"synonyms":["stringiness","toughness","fiber content","fibrosity"],"phonetic":"/ˈfaɪbɚəsnəs/","extraExplanation":["“fibrousness”来自形容词“fibrous”（多纤维的、纤维状的）+ 名词后缀“-ness”（表示“……的性质/状态”）。常用于食物口感（stringy/chewy）、材料质地（纸张、布料、植物纤维）或医学语境（组织呈纤维化倾向）。","日常英语里更常用“fibrous”作形容词来描述（a fibrous texture / fibrous vegetables）。名词“fibrousness”更偏书面、技术或描述性写作。"]}
{"word":"fibrovasal","summary":{"en":"A rare medical adjective meaning “fibrovascular”: containing both fibrous tissue and blood vessels.","zh":"一个罕见的医学形容词，意为“纤维血管性的（fibrovascular）”：同时含纤维组织与血管成分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Relating to tissue that contains both fibrous (scar-like) and vascular (blood-vessel) components; fibrovascular.","zh":"（医学）指同时含有纤维性（瘢痕样）成分和血管（血管丰富）成分的组织；即“纤维血管性的”。"},"examples":[{"en":"The report described a fibrovasal (fibrovascular) membrane growing over the retina.","zh":"报告描述视网膜表面生长出一层纤维血管性（fibrovasal/fibrovascular）的膜。"},{"en":"Chronic inflammation can lead to fibrovasal tissue changes with increased blood vessels and fibrosis.","zh":"慢性炎症可能导致纤维血管性组织改变，表现为血管增生与纤维化。"}]}],"synonyms":["fibrovascular","fibrous-vascular","vascular and fibrous"],"phonetic":"/ˌfaɪbroʊˈveɪsəl/","extraExplanation":["“fibrovasal”在英语医学写作中非常少见；临床与论文里更常用的标准词是“fibrovascular”。如果你是在病理报告、眼科（如糖尿病视网膜病变的膜）、皮肤或肿瘤相关描述中看到它，很可能是“fibrovascular”的变体写法或拼写误差。","构词理解：fibro-（纤维/纤维化）+ vas-（血管）+ -al（……的）。看到这个组合时，重点把握为“纤维化 + 血管增生/血供丰富”。"]}
{"word":"fibrovascular","summary":{"en":"Fibrovascular describes tissue that includes both fibrous connective tissue and blood vessels, often used in medical contexts.","zh":"Fibrovascular 指“纤维+血管”的组织特征，常用于医学语境，描述同时含纤维结缔组织与血管的组织或病变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made of both fibrous (connective) tissue and blood vessels.","zh":"与纤维（结缔）组织和血管都有关的；由纤维组织与血管共同构成的。"},"examples":[{"en":"The doctor noted fibrovascular tissue forming near the wound as it healed.","zh":"医生注意到伤口愈合时附近形成了纤维血管组织。"},{"en":"Some eye conditions involve abnormal fibrovascular growth.","zh":"一些眼部疾病会出现异常的纤维血管增生。"}]}],"synonyms":["fibroangiomatous","vascular-fibrous","fibrous and vascular"],"phonetic":"/ˌfaɪbroʊˈvæskjələr/","extraExplanation":["这是医学/病理学常用的形容词，常见搭配有 fibrovascular tissue（纤维血管组织）、fibrovascular proliferation（纤维血管增生）、fibrovascular membrane（纤维血管膜）。","词形结构：fibro- 表示“纤维/纤维组织”，vascular 表示“血管的”。在医学英语里，这类组合词很常见，用来精确描述组织成分或病变特征。","在眼科语境中尤其常见，例如糖尿病视网膜病变可能出现 fibrovascular proliferation，表示新生血管伴随纤维组织一起生长，可能牵拉视网膜。"]}
{"word":"fibry","summary":{"en":"Fibry means “full of fibers; fibrous; stringy.”","zh":"fibry 表示“充满纤维的；纤维状的；拉丝/筋道的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of material or food) containing many fibers; fibrous; stringy.","zh":"（指材料或食物）含有许多纤维的；纤维状的；（口感）筋道/拉丝的。"},"examples":[{"en":"Celery has a fibry texture, so it can be hard to chew.","zh":"芹菜的口感比较纤维状，所以可能不太好嚼。"},{"en":"The old rope was dry and fibry, breaking into strands.","zh":"那根旧绳子又干又纤维化，断开时散成一缕一缕的。"}]}],"synonyms":["fibrous","stringy","ropy"],"phonetic":"/ˈfaɪbri/","extraExplanation":["“fibry”在现代英语中不算常用，更常见的说法是“fibrous”。但“fibry”仍可用来强调“带纤维、呈丝状/条状”的特征。","词尾“-y”常把名词变成形容词，表示“充满……的/具有……特征的”（如：cloudy 多云的，hairy 多毛的）。这里 fiber + -y → fibry。"]}
{"word":"fibs","summary":{"en":"“Fibs” usually means small, harmless lies, or the verb form “(someone) fibs” meaning they tell small lies.","zh":"“fibs”通常指“小谎话”，也可作动词表示“（某人）撒小谎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small lies; unimportant or harmless untruths (plural of “fib”).","zh":"小谎话；无伤大雅的谎言（“fib”的复数）。"},"examples":[{"en":"He told a few fibs about why he was late.","zh":"他为了说明迟到的原因撒了几句小谎。"},{"en":"Kids sometimes tell fibs when they’re scared.","zh":"孩子害怕时有时会说些小谎。"}]},{"partOfSpeech":"v.","definition":{"en":"To tell small lies; to lie in a minor way (third-person singular of “fib”).","zh":"说小谎；撒无关紧要的谎（“fib”的第三人称单数）。"},"examples":[{"en":"He fibs to avoid getting in trouble.","zh":"他为了不惹麻烦会撒点小谎。"},{"en":"She fibs about her age sometimes.","zh":"她有时会在年龄上撒个小谎。"}]}],"synonyms":["small lies","white lies","untruths"],"phonetic":"/fɪbz/","extraExplanation":["“fib”通常指不太严重、说的人觉得“没什么大不了”的谎，比“lie”语气更轻，有时带一点宽容或半开玩笑的感觉。但在正式或严肃场合，仍建议用更明确的说法（如“lie/falsehood”）并注意诚信。","“fibs”也可能是某些专有名词或缩写（如公司名、项目名）。如果你是在特定语境里看到“FIBs”，告诉我上下文我可以帮你判断。"]}
{"word":"fibster","summary":{"en":"“Fibster” means a person who tells small, usually harmless lies (informal).","zh":"“Fibster”指爱说小谎、常撒无伤大雅的谎的人（非正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who tells small or harmless lies; someone who often “fibs.” (Informal)","zh":"爱说小谎的人；常常“撒小谎”的人。（非正式）"},"examples":[{"en":"Don’t believe everything he says—he’s a bit of a fibster.","zh":"别全信他说的话——他有点爱撒小谎。"},{"en":"She admitted she was a fibster when it came to her age.","zh":"她承认在年龄这件事上自己会撒点小谎。"}]}],"synonyms":["fibber","little liar","storyteller (informal, sometimes)"],"phonetic":"/ˈfɪb.stɚ/","extraExplanation":["“fibster”来自“fib”（小谎、无伤大雅的谎）+ “-ster”（表示“某类人”的后缀）。语气通常比“liar（骗子）”轻一些，常带玩笑或责备但不算很严厉的感觉。","在正式场合或严肃指控中一般不用“fibster”；如果涉及重大欺骗，更常用“liar”或更具体的词（如“fraud”）。"]}
{"word":"fibula","summary":{"en":"Fibula usually means the smaller lower-leg bone; it can also mean an ancient clothing pin/brooch.","zh":"Fibula 通常指小腿较细的骨头“腓骨”；也可指古代用于固定衣物的扣针/胸针。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The smaller of the two bones in the lower leg (the other is the tibia). It helps stabilize the ankle and supports muscles, but it carries less body weight than the tibia.","zh":"腓骨：小腿两根骨头中较细的一根（另一根是胫骨）。它主要帮助稳定踝关节并提供肌肉附着点，但承重比胫骨少。"},"examples":[{"en":"She broke her fibula while skiing and had to wear a cast.","zh":"她滑雪时把腓骨摔断了，只能打石膏。"},{"en":"The X-ray showed a small crack in the fibula near the ankle.","zh":"X 光显示踝关节附近的腓骨有一道小裂纹。"}]},{"partOfSpeech":"n.","definition":{"en":"In archaeology/history, a clasp or brooch used in ancient times to fasten clothing, similar to a safety pin.","zh":"（考古/历史）纤维拉（fibula）：古代用于固定衣物的扣针或胸针，类似安全别针。"},"examples":[{"en":"The museum displayed a bronze fibula from the Roman period.","zh":"博物馆展出了一枚罗马时期的青铜扣针（fibula）。"},{"en":"Archaeologists found a fibula that may have held a cloak closed.","zh":"考古学家发现了一枚可能用来扣住斗篷的扣针（fibula）。"}]}],"synonyms":["calf bone (informal, for the leg bone sense)","brooch (for the pin sense)","clasp (for the pin sense)"],"phonetic":"/ˈfɪbjələ/","extraExplanation":["“fibula”来自拉丁语，原意与“扣针/夹子”有关；后来解剖学借用这个词来命名“腓骨”，可能因为腓骨又细又长，让人联想到扣针的形状。","读医学英语时常见搭配：fibula fracture（腓骨骨折）、fibular head（腓骨头）、fibular nerve（腓总神经/腓骨相关神经）。在日常英语里，提到腿骨更常用“shin bone（胫骨）”，而“fibula”更偏医学或正式语境。"]}
{"word":"fibulae","summary":{"en":"Fibulae is the plural of fibula, meaning either the outer lower-leg bones or ancient clothing clasps/brooches.","zh":"fibulae 是 fibula 的复数，可指小腿外侧的腓骨，或指古代用于固定衣物的扣针/胸针。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of fibula: the smaller of the two bones in the lower leg, on the outside of the tibia (shinbone).","zh":"fibula（腓骨）的复数：小腿两根骨头中较细的一根，位于胫骨（shinbone）外侧。"},"examples":[{"en":"The X-ray showed a small crack in both fibulae after the fall.","zh":"X 光显示跌倒后两侧腓骨都有细小裂纹。"},{"en":"Strong calf muscles help stabilize the tibia and the fibulae during running.","zh":"强壮的小腿肌肉有助于跑步时稳定胫骨和腓骨。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of fibula: a brooch or clasp used in ancient times (especially in Roman and Greek culture) to fasten clothing, like a pin.","zh":"fibula（古代别针/扣针）的复数：古代（尤指罗马、希腊）用来固定衣物的胸针或扣针，类似大别针。"},"examples":[{"en":"The museum displayed silver fibulae used to fasten cloaks.","zh":"博物馆展出了用于固定斗篷的银质扣针。"},{"en":"Archaeologists found fibulae near the burial site, suggesting the person wore a pinned garment.","zh":"考古学家在墓葬附近发现了扣针，说明死者可能穿着用别针固定的衣物。"}]}],"synonyms":["fibulas (less formal plural)","brooches (for the clasp meaning)","clasps (for the clasp meaning)"],"phonetic":"/ˈfɪbjəˌliː/","extraExplanation":["“fibula”源自拉丁语，原意与“扣针/别针”有关；解剖学上的“腓骨”名称也来自其形状或功能与“别针”相似的联想（都是细长、起固定/支撑作用）。","英语里有时也会看到更英语化的复数形式“fibulas”，但在医学、学术写作中更常用拉丁复数“fibulae”。"]}
{"word":"fibular","summary":{"en":"“Fibular” means “related to the fibula,” the smaller outer bone of the lower leg.","zh":"“fibular”表示“与腓骨相关的”，腓骨是小腿外侧较细的一根骨头。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the fibula (the smaller bone in the lower leg, on the outside).","zh":"与腓骨有关的（腓骨是小腿外侧较细的一根骨头）。"},"examples":[{"en":"The X-ray showed a fibular fracture near the ankle.","zh":"X 光显示脚踝附近有腓骨骨折。"},{"en":"She felt pain along the fibular side of her lower leg after the fall.","zh":"摔倒后，她小腿腓骨一侧感到疼痛。"}]}],"synonyms":["peroneal (often used in medical contexts)"],"phonetic":"/ˈfɪbjələr/","extraExplanation":["“fibular”常见于医学或运动伤害语境（如 fibular fracture 腓骨骨折、fibular nerve 腓总神经、fibular head 腓骨头）。日常英语里更常直接说“the fibula（腓骨）”。","词源上与拉丁语有关：fibula 指“腓骨”。在英式英语中也常见拼写变体“peroneal”（如 peroneal nerve），现代医学中两者有时并用，但“fibular”更直观地表示“与腓骨相关”。"]}
{"word":"fibular-calcaneal","summary":{"en":"An anatomical term meaning “involving the fibula and the heel bone (calcaneus).”","zh":"解剖学术语，表示“与腓骨和跟骨（脚跟骨）相关/相连的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the fibula (the outer lower-leg bone) and the calcaneus (the heel bone), especially describing a ligament or structure that connects or runs between them.","zh":"与腓骨（小腿外侧的骨）和跟骨（脚跟骨）有关的；尤指连接两者或位于两者之间的韧带或结构。"},"examples":[{"en":"The doctor examined the fibular-calcaneal ligament after the ankle injury.","zh":"脚踝受伤后，医生检查了腓骨-跟骨韧带。"},{"en":"Pain near the outer ankle can involve fibular-calcaneal structures.","zh":"外侧脚踝附近的疼痛可能与腓骨-跟骨相关结构有关。"}]}],"synonyms":["fibulocalcaneal","lateral ankle (context-dependent)"],"phonetic":"/ˌfɪbjəloʊ kælˈkeɪniəl/","extraExplanation":["这是一个医学/解剖学复合形容词，常见于专业语境；也常写作 **fibulocalcaneal**（把连字符去掉）。","相关解剖点：腓骨在小腿外侧，跟骨是脚跟最大的骨头；两者之间的韧带与踝关节外侧稳定性有关（例如外侧副韧带复合体的一部分）。"]}
{"word":"fibular-side","summary":{"en":"“Fibular-side” means the outer (lateral) side of the lower leg/ankle where the fibula is.","zh":"“fibular-side”指小腿/踝部腓骨所在的外侧（外侧面）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"On the outer (lateral) side of the lower leg or ankle—the side where the fibula is located.","zh":"位于小腿或踝部的外侧（外侧面）——即腓骨所在的一侧。"},"examples":[{"en":"The swelling is worse on the fibular-side of the ankle.","zh":"肿胀在踝部的腓骨侧更明显。"},{"en":"The incision was made on the fibular-side to avoid the tibial vessels.","zh":"切口选择在腓骨侧，以避开胫骨侧的血管。"},{"en":"Pain along the fibular-side may suggest a lateral ligament injury.","zh":"沿腓骨侧的疼痛可能提示外侧韧带损伤。"}]}],"synonyms":["lateral (side)","outer (side)","peroneal side"],"phonetic":"/ˈfɪbjələr saɪd/","extraExplanation":["“fibular-side”常见于医学/运动康复/解剖学语境，用来精确描述方向位置。日常英语里更常说“the outer side (lateral side) of the leg/ankle”。","与之相对的常见说法是“tibial-side”（胫骨侧），通常指小腿内侧（靠近身体中线的一侧）。","有时你也会看到“peroneal side”（腓骨/腓骨肌相关的侧面）作为近义表达，但具体用词取决于学科与描述重点。"]}
{"word":"fibulare","summary":{"en":"Fibulare: a rare technical adjective meaning “related to the fibula; fibular.”","zh":"fibulare：较少见的专业形容词，表示“与腓骨有关的；腓骨的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, rare/technical) Relating to the fibula (the smaller bone on the outer side of the lower leg); fibular.","zh":"（解剖学，较少见/专业）与腓骨有关的；腓骨的。"},"examples":[{"en":"In some anatomical texts, “fibulare” is used to mean “fibular,” referring to structures near the fibula.","zh":"在一些解剖学资料中，“fibulare”用来表示“fibular（腓骨的）”，指靠近腓骨的结构。"},{"en":"Pain on the fibulare (fibular) side of the ankle may involve ligaments near the fibula.","zh":"脚踝腓骨侧（fibulare/fibular side）的疼痛可能与腓骨附近的韧带有关。"}]}],"synonyms":["fibular","peroneal"],"phonetic":"/ˈfɪbjəˌlɛr/","extraExplanation":["“fibulare”常见于拉丁化的解剖命名或较旧的医学写法；现代英文更常用的对应词是 **fibular**，也可能看到同义词 **peroneal**（尤其用于“腓骨肌/腓骨神经”等结构）。","如果你是在某段原文里看到“fibulare”，它多半是作为形容词修饰名词（如某条韧带、动脉或区域），意思就是“与腓骨相关的”。"]}
{"word":"fibularia","summary":{"en":"Fibularia: a scientific genus name for small sea urchins (echinoids).","zh":"Fibularia：一种小型海胆（海胆纲）属的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small sea urchins (echinoids) found in marine environments.","zh":"（生物）纤维海胆属：一种生活在海洋环境中的小型海胆类（棘皮动物门、海胆纲）属名。"},"examples":[{"en":"Fibularia is a genus of echinoids studied in marine biology.","zh":"纤维海胆属（Fibularia）是海洋生物学中研究的一类海胆属。"},{"en":"The sample was identified as a species within Fibularia.","zh":"该样本被鉴定为纤维海胆属（Fibularia）中的一种。"}]}],"synonyms":["echinoid genus","sea urchin genus"],"phonetic":"/ˌfaɪbjəˈlɛriə/","extraExplanation":["Fibularia 是拉丁化的属名，通常用于学术语境（论文、物种名录、标本标签等）。在书写上常用斜体表示属名（Fibularia），若加上具体种名则写成二名法，如 Fibularia + species（属名首字母大写，种名小写）。","词源上与拉丁语 fibula（“扣针、别针、扣件”）有关，属名常反映形态特征或早期分类者的命名习惯，但具体命名动机需查对应的分类学原始文献。"]}
{"word":"fibularis","summary":{"en":"Fibularis refers to the fibula, and it also names the muscles on the outer side of the lower leg (fibularis longus/brevis/tertius).","zh":"Fibularis 表示“与腓骨相关的”，也可指小腿外侧的一组肌肉（腓骨长肌/短肌/第三肌）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Relating to the fibula (the smaller bone on the outer side of the lower leg).","zh":"（解剖）与腓骨有关的；腓骨的（腓骨是小腿外侧较细的一根骨头）。"},"examples":[{"en":"The fibularis muscles run along the outer side of the lower leg.","zh":"腓骨肌群沿着小腿外侧走行。"},{"en":"Pain near the fibularis tendon can occur after an ankle sprain.","zh":"脚踝扭伤后，腓骨肌腱附近可能会疼痛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A muscle of the lateral (outer) lower leg, especially one of the fibularis muscles (fibularis longus, fibularis brevis, or fibularis tertius).","zh":"（解剖）腓骨肌之一：指小腿外侧的肌肉，尤指腓骨长肌、腓骨短肌或腓骨第三肌。"},"examples":[{"en":"The therapist strengthened the fibularis to improve ankle stability.","zh":"治疗师加强腓骨肌力量以提升踝关节稳定性。"},{"en":"Fibularis longus helps evert the foot and support the arch.","zh":"腓骨长肌有助于外翻足部并支撑足弓。"}]}],"synonyms":["peroneal","peroneus"],"phonetic":"/ˌfɪbjəˈlærɪs/","extraExplanation":["在临床与解剖学里，fibularis 常见于肌肉名称（fibularis longus/brevis/tertius）。许多旧教材或临床用语会用 peroneus（或形容词 peroneal）来指同一组结构；现代命名更倾向使用 fibularis，以强调其与腓骨（fibula）的关联。"]}
{"word":"fibulas","summary":{"en":"Fibulas are either the fibula bones in the lower leg (plural of fibula) or, historically, brooches/pins used to fasten clothing.","zh":"Fibulas 是 fibula 的复数，可指小腿外侧的腓骨；在历史语境中也可指古代用来固定衣物的胸针/别针。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The smaller of the two bones in the lower leg, on the outside of the leg, running parallel to the tibia (shinbone).","zh":"（解剖）腓骨：小腿两根骨头中较细的一根，位于外侧，与胫骨（小腿骨）平行。"},"examples":[{"en":"He fractured his fibula while skiing.","zh":"他滑雪时腓骨骨折了。"},{"en":"The X-ray showed a crack in the fibula but the tibia was fine.","zh":"X光显示腓骨有裂纹，但胫骨没有问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(History) A brooch or pin used in ancient Rome and other cultures to fasten clothing.","zh":"（历史）纤维拉别针：古罗马等文化中用来固定衣物的胸针或别针。"},"examples":[{"en":"The museum displayed a bronze fibula from the Roman period.","zh":"博物馆展出了一枚罗马时期的青铜纤维拉别针。"},{"en":"Archaeologists found fibulas near the burial site, suggesting the clothing style of the time.","zh":"考古学家在墓葬附近发现了纤维拉别针，说明了当时的服饰风格。"}]}],"synonyms":["calf bone (common, non-technical)","brooch","clasp","pin"],"phonetic":"/ˈfɪbjələ/","extraExplanation":["“Fibulas”是英语里常见的复数拼法；在医学或学术写作中也常见拉丁复数“fibulae”。两种都对，但正式程度略有差别。","词源来自拉丁语 fibula，原意与“扣住/固定”有关，所以它既可指“别针”，也借用来命名小腿外侧那根“起到支撑与连接作用的骨头”。"]}
{"word":"fibulo-calcaneal","summary":{"en":"An anatomical adjective meaning “involving the fibula and the calcaneus (heel bone),” often used for ankle ligaments.","zh":"解剖学形容词，指“与腓骨和跟骨（脚跟骨）有关”，常用于描述踝部韧带等结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the fibula (the smaller outer bone of the lower leg) and the calcaneus (the heel bone); used especially to describe a ligament or joint connection in the ankle/foot.","zh":"与腓骨（小腿外侧较细的骨）和跟骨（脚跟骨）两者相关的；尤用于描述踝足部的韧带或结构连接。"},"examples":[{"en":"The fibulo-calcaneal ligament helps stabilize the outer side of the ankle.","zh":"腓骨-跟骨韧带有助于稳定踝关节外侧。"},{"en":"MRI showed inflammation near the fibulo-calcaneal region after the sprain.","zh":"扭伤后，核磁共振显示腓骨-跟骨区域附近有炎症。"}]}],"synonyms":["fibulocalcaneal","peroneocalcaneal"],"phonetic":"/ˌfɪbjəloʊ kælˈkeɪniəl/","extraExplanation":["这是医学/解剖学用语，常见于“fibulo-calcaneal ligament（腓骨-跟骨韧带）”等搭配中。","构词上由 fibulo-（与腓骨相关）+ calcaneal（与跟骨相关）组成；连字符表示“同时涉及两者”。"]}
{"word":"fibulocalcaneal","summary":{"en":"An anatomical adjective meaning “involving the fibula and the heel bone (calcaneus).”","zh":"解剖学形容词，表示“与腓骨和跟骨（脚跟骨）相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the fibula (the smaller lower-leg bone) and the calcaneus (the heel bone).","zh":"与腓骨（小腿外侧较细的骨）和跟骨（脚跟骨）有关的。"},"examples":[{"en":"The report mentioned mild thickening of the fibulocalcaneal ligament.","zh":"报告提到腓骨—跟骨韧带轻度增厚。"},{"en":"Pain along the outer ankle may involve fibulocalcaneal structures.","zh":"外侧脚踝的疼痛可能与腓骨—跟骨相关结构有关。"}]}],"synonyms":["calcaneofibular","fibular-calcaneal","fibulo-calcaneal"],"phonetic":"/ˌfɪbjʊloʊkælˈkeɪniəl/","extraExplanation":["这是一个医学/解剖学复合形容词：fibulo-（腓骨）+ calcaneal（跟骨的）。在临床与影像报告中多用来描述外踝附近的韧带与组织。","更常见的对应说法是 **calcaneofibular**（跟腓的/跟骨—腓骨的），例如 **calcaneofibular ligament (CFL)**，中文常译“跟腓韧带”。不同写法意思接近，但在教材与文献中以 calcaneofibular 更常见。"]}
{"word":"fibulotarsal","summary":{"en":"Fibulotarsal means “related to the fibula and the tarsal (ankle/heel) bones.”","zh":"fibulotarsal 表示“与腓骨和跗骨（踝/足跟骨）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the fibula (the outer lower-leg bone) and the tarsus (the ankle/heel bones), especially describing a joint, ligament, or region near the ankle.","zh":"与腓骨（小腿外侧的骨）和跗骨（踝/足跟部骨骼）有关的，常用于描述踝部附近的关节、韧带或区域。"},"examples":[{"en":"The doctor examined the fibulotarsal region for swelling after the ankle injury.","zh":"医生检查了踝伤后腓骨-跗骨区域是否有肿胀。"},{"en":"A fibulotarsal ligament helps stabilize parts of the ankle.","zh":"腓骨-跗骨韧带有助于稳定踝部的某些结构。"}]}],"synonyms":["fibulo-tarsal","fibular-tarsal"],"phonetic":"/ˌfɪbjʊloʊˈtɑrsəl/","extraExplanation":["这是医学/解剖学用语，常见写法也会加连字符：fibulo-tarsal。多用于专业语境（如临床记录、解剖描述），日常英语中很少单独出现。","词形上由 fibulo-（腓骨的）+ tarsal（跗骨的）组合而成，属于“复合形容词”，表示“与A和B都相关”。"]}
{"word":"fibulotibial","summary":{"en":"An anatomical adjective meaning “related to the fibula and tibia.”","zh":"解剖学形容词，表示“与腓骨和胫骨有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the fibula and the tibia (the two bones of the lower leg), especially where they connect or interact (e.g., the joint/ligament area).","zh":"与腓骨和胫骨（小腿的两块骨头）有关的，尤指它们连接或相互作用的部位（如关节/韧带区域）。"},"examples":[{"en":"The doctor examined the fibulotibial joint for signs of instability.","zh":"医生检查了腓胫关节是否有不稳定的迹象。"},{"en":"Pain near the fibulotibial area can be related to ligament strain.","zh":"腓胫区域附近的疼痛可能与韧带拉伤有关。"}]}],"synonyms":["tibiofibular","fibular-tibial"],"phonetic":"/ˌfɪbjəloʊˈtɪbiəl/","extraExplanation":["“fibulo-”指腓骨（fibula），“tibial”指胫骨（tibia）。它通常出现在医学/解剖学语境里，例如“proximal fibulotibial joint（近端腓胫关节）”，描述的是腓骨与胫骨在膝盖附近的连接处。日常英语里很少用，多见于体检报告、影像学描述、运动医学与骨科文章。"]}

