{"word":"fic","summary":{"en":"“Fic” is an informal abbreviation for “fan fiction/fanfic” (most common), and sometimes for “fiction.”","zh":"“fic”是非正式缩写，最常见指“fan fiction/fanfic（同人文）”，有时也可指“fiction（虚构作品/小说）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “fan fiction” or “fanfic”: a story written by fans using characters or settings from an existing book, movie, game, etc.","zh":"（非正式）“fan fiction / fanfic”的缩写：粉丝基于已有作品（小说、电影、游戏等）的角色或世界观创作的同人故事。"},"examples":[{"en":"I found a great fic about Harry Potter on AO3.","zh":"我在 AO3 上找到一篇很棒的《哈利·波特》同人文。"},{"en":"Do you have any fic recommendations for this ship?","zh":"你有这个 CP 的同人文推荐吗？"},{"en":"She writes fic in her free time.","zh":"她空闲时会写同人文。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A short, casual way to say “fiction,” especially online (less common than the fanfic meaning).","zh":"（非正式）“fiction（虚构作品/小说）”的简略说法，常见于网络语境（不如“同人文”的意思常用）。"},"examples":[{"en":"I’m in the mood for some sci‑fi fic tonight.","zh":"我今晚想看点科幻小说/科幻虚构作品。"},{"en":"He mostly reads classic fic and biographies.","zh":"他主要读经典小说和传记。"}]}],"synonyms":["fanfic","fan fiction","fiction","story"],"phonetic":"/fɪk/","extraExplanation":["“fic”在同人圈里非常常见，通常默认指“fanfic（同人文）”。常见搭配有：read fic（看同人文）、write fic（写同人文）、fic recs（同人文推荐）、one-shot fic（短篇/一发完）、longfic（长篇）、ficlet（超短篇）。","不同平台会有不同标注方式：比如 AO3、Wattpad、Tumblr 等。也常和“ship（嗑 CP）”“canon（原作设定）”“AU（架空设定）”一起出现。"]}
{"word":"fica","summary":{"en":"FICA is the U.S. payroll tax that funds Social Security and Medicare.","zh":"FICA 指美国用于资助社会保障和医疗保险的工资税。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) A payroll tax withheld from employees’ wages (and matched by employers) to fund Social Security and Medicare; the tax created under the Federal Insurance Contributions Act.","zh":"（美国）工资税：从员工工资中扣缴、并由雇主等额配比缴纳，用于资助社会保障（Social Security）和医疗保险（Medicare）；依据《联邦保险缴款法》（Federal Insurance Contributions Act）设立。"},"examples":[{"en":"FICA taxes are taken out of your paycheck automatically.","zh":"FICA 税会自动从你的工资单中扣除。"},{"en":"My pay stub shows separate lines for federal income tax and FICA.","zh":"我的工资单上联邦所得税和 FICA 分别列出。"},{"en":"Employers must pay the employer share of FICA.","zh":"雇主必须缴纳雇主承担的那部分 FICA。"}]}],"synonyms":["payroll tax","Social Security and Medicare tax"],"phonetic":"/ˈfaɪkə/","extraExplanation":["在美国日常语境里，人们常把 Social Security tax + Medicare tax 合称为 “FICA”。你在工资单（pay stub）上看到的 “FICA” 通常就是这两项合并或分开列出的扣款。","注意大小写：更常见的写法是全大写 FICA（指税/法案）。如果你指的是葡语 “fica”（动词 ficar 的形式，意思是“待着/留下/变得”），那是另一种语言的词。"]}
{"word":"ficaria","summary":{"en":"Ficaria is a botanical genus, best known for the plant called lesser celandine (Ficaria verna).","zh":"Ficaria 是一个植物属名，最常见相关植物是 lesser celandine（学名常写 Ficaria verna）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the buttercup family (Ranunculaceae), especially known for the species commonly called lesser celandine (now often named Ficaria verna)","zh":"（植物）毛茛科的一个属名（Ficaria），指一类小型开花植物；其中最常见、常被提到的是“小白头翁/小毛茛”（lesser celandine，常用学名 Ficaria verna）"},"examples":[{"en":"In early spring, Ficaria can carpet damp woodland floors with bright yellow flowers.","zh":"早春时，Ficaria 常会在潮湿的林地地面成片铺开，开出明亮的黄色花。"},{"en":"The park label lists the plant as Ficaria verna (lesser celandine).","zh":"公园的标牌把这种植物标为 Ficaria verna（lesser celandine，小白头翁/小毛茛）。"}]}],"synonyms":["lesser celandine","pilewort","Ficaria verna"],"phonetic":"/faɪˈkɛriə/","extraExplanation":["“Ficaria”是拉丁化的植物学属名，日常英语里更常用的是俗名 **lesser celandine** 或 **pilewort**。在较旧的资料中，你可能会看到它被归在毛茛属，写作 **Ranunculus ficaria**；现代分类常改为 **Ficaria verna**。","注意：不同地区（尤其是北美和欧洲）对这种植物的生态评价不一样；在一些地方它被视为外来入侵植物，繁殖快、会排挤本地植物。"]}
{"word":"ficaries","summary":{"en":"“Ficaries” is not a standard English word; it is most likely a misspelling of “vicarious,” meaning ‘experienced indirectly through someone else.’","zh":"“ficaries”不是标准英文单词；很可能是“vicarious”的拼写错误，意思是“通过他人而间接体验的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended word) experiencing something through another person’s feelings or actions, rather than directly yourself.","zh":"（可能是你想写的词）指通过他人的感受或经历来“间接体验”某事，而不是自己亲身经历。"},"examples":[{"en":"She felt vicarious pride when her younger brother graduated.","zh":"弟弟毕业时，她感到一种“与有荣焉”的间接自豪感。"},{"en":"I get vicarious excitement from watching travel videos.","zh":"我看旅行视频会获得一种“身临其境但不亲历”的兴奋感。"},{"en":"Some parents try to live vicariously through their children.","zh":"有些父母会试图通过孩子来“替自己过一遍人生”。"}]}],"synonyms":["indirect","secondhand","empathetic"],"phonetic":"/vaɪˈkɛriəs/","extraExplanation":["“ficaries”不是常见或标准的英文拼写，最可能是把 **vicarious** 拼错了（f/v 在键盘上相邻或发音记忆混淆常见）。","**vicarious** 常用搭配：vicarious pleasure / vicarious thrill（间接的快乐/刺激）、live vicariously through someone（通过某人来过自己想要的生活）。语气有时带一点批评意味（比如父母把未实现的梦想投射到孩子身上）。"]}
{"word":"ficary","summary":{"en":"“Ficary” is not an English word; it’s likely a misspelling of “vicar” or “vicarious.”","zh":"“ficary” 不是英文单词；可能是 “vicar” 或 “vicarious” 的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “vicar,” “vicarious,” or “vicary.”","zh":"不是标准英文单词。很可能是 “vicar”（教区牧师）、“vicarious”（间接体验的），或 “vicary”（较少见：教区牧师的职位/辖区等）的拼写错误。"},"examples":[{"en":"I can’t find “ficary” in a dictionary—did you mean “vicarious”?","zh":"我在词典里找不到 “ficary”——你是不是想写 “vicarious”？"},{"en":"If you meant “vicar,” you could say: “The vicar spoke to the community.”","zh":"如果你想写 “vicar”，可以说：“教区牧师对社区发表了讲话。”"}]}],"extraExplanation":["“vicar”常见于英国英语，指英国圣公会等教会的教区牧师。美式英语里也能见到，但语境更偏宗教或英国文化背景。","“vicarious”更常用，意思是“通过他人的经历来感受/体验（情绪、快乐、痛苦等）”，例如：vicarious pleasure（替别人开心/间接的快乐）。","如果你告诉我你看到这个词的句子或你想表达的意思（宗教职位？替别人体验？），我可以帮你确定最合适的正确拼写和用法。"]}
{"word":"fication","summary":{"en":"“-fication” is a suffix meaning “the process of making/becoming,” used to form nouns (e.g., simplification, purification).","zh":"“-fication”是表示“使……成为/变成……的过程”的后缀，用来构成名词（如 simplification、purification）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a suffix meaning “the process of making or causing something to become (the root word),” often forming nouns from verbs or adjectives","zh":"一个后缀，表示“使……成为/变成……的过程”，常用于把动词或形容词变成名词"},"examples":[{"en":"Purification means “the process of making something pure.”","zh":"purification 表示“使某物变得纯净的过程”。"},{"en":"Classification is “the process of putting things into groups.”","zh":"classification 是“把事物分门别类的过程”。"},{"en":"Simplification means “the process of making something simpler.”","zh":"simplification 表示“把某事变得更简单的过程”。"}]}],"phonetic":"/fɪˈkeɪʃən/","extraExplanation":["“-fication”在英语里通常不单独作为一个词使用，而是构成名词的一部分，常见于较正式/书面语（学术、政府、技术写作）。","拼写小提示：很多词以“-ify”结尾的动词，其名词形式常变为“-ification”（如 simplify → simplification，classify → classification）。","有些词的构词链较长：pure → purify → purification。理解词根（pure）+ 动词后缀（-ify）+ 名词后缀（-cation/-ation）能帮助快速猜词义。"]}
{"word":"ficche","summary":{"en":"“Ficche” is not a standard English word; it’s likely a misspelling of “fiche,” meaning a microfiche sheet or an information card.","zh":"“ficche”不是标准英文词，可能是“fiche”的拼写错误，意思是微缩胶片薄片或信息记录卡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) If you mean “fiche”: a flat sheet of film (microfiche) or a small card used to store information or data.","zh":"（可能是拼写错误）如果你想表达“fiche”：指用于保存信息的微缩胶片薄片（microfiche），或记录资料的小卡片/信息卡。"},"examples":[{"en":"The old newspaper articles are stored on microfiche in the library.","zh":"旧报纸文章以微缩胶片的形式保存在图书馆里。"},{"en":"Please fill out a fiche with your contact details.","zh":"请填写一张信息卡，写上你的联系方式。"}]}],"synonyms":["microfiche","card","index card","record"],"phonetic":"/fiʃ/","extraExplanation":["“fiche”源自法语，原意与“卡片/记录条目”有关。英语里常见于信息管理与图书馆场景，尤其是“microfiche（微缩胶片）”。","如果你原本要拼的是其他词（例如 fickle, fishing, fiche 等），你可以告诉我你想表达的中文意思或给我一个句子，我可以帮你确认正确拼写和用法。"]}
{"word":"fice","summary":{"en":"“Fice” is a rare word meaning a small dog, often with a negative tone.","zh":"“fice”是个较少见的词，指小狗，常带一点贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dog (often used in a slightly insulting way, like “a yappy little dog” or “a cur”).","zh":"小狗（常带贬义，类似“爱叫的小狗／小杂种狗”）。"},"examples":[{"en":"A little fice kept barking at everyone who walked by.","zh":"一只小狗对每个路过的人都不停地叫。"},{"en":"He called the dog a fice, annoyed by the noise.","zh":"他嫌狗太吵，生气地骂它是只讨厌的小狗。"}]}],"synonyms":["cur","mongrel","yappy dog"],"phonetic":"/faɪs/","extraExplanation":["“fice”在现代英语里很少见，通常出现在较旧的文学/方言用法中，语气往往不太友好，用来指“又小又吵的狗”。日常交流更常用：small dog / little dog / yappy dog。","如果你本来想查的是别的词（例如：office、fierce、fizz），告诉我你看到它的句子，我可以帮你确认正确拼写与意思。"]}
{"word":"ficelle","summary":{"en":"Ficelle is a French loanword meaning “thin string,” and in food contexts it can mean a thin baguette or a sandwich made with it.","zh":"Ficelle 是借自法语的词，常指“细绳”；在餐饮语境中也可指细法棍或用它做的三明治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French word used in English) a thin string or piece of twine; literally “string.”","zh":"（英语中借用的法语词）细绳；麻绳；字面意思是“绳子”。"},"examples":[{"en":"Tie the package with a ficelle so it won’t open during shipping.","zh":"用一根细绳把包裹绑好，这样运输途中就不会散开。"},{"en":"The florist wrapped the bouquet with a simple ficelle.","zh":"花店用一根简单的细绳把花束扎起来。"}]},{"partOfSpeech":"n.","definition":{"en":"In food contexts, a long, thin French-style loaf (a very thin baguette), or a sandwich made with it (often called a “ficelle sandwich”).","zh":"（食物语境）一种细长的法式面包（很细的法棍）；也可指用这种面包做的三明治（常说“ficelle sandwich”）。"},"examples":[{"en":"I ordered a ham-and-cheese ficelle sandwich for lunch.","zh":"我午餐点了一个火腿芝士的细法棍三明治。"},{"en":"The bakery sells ficelles that are crisp on the outside and soft inside.","zh":"这家面包店卖的细法棍外脆里软。"}]}],"synonyms":["string","twine","cord","thin baguette"],"phonetic":"/fiˈsɛl/","extraExplanation":["“Ficelle”是法语，原意是“细绳/麻绳”。在英语里它不算常用词，通常出现在法式餐饮、烘焙菜单或较“法式”的书写风格中。","在烘焙里，ficelle 常指比标准法棍更细、更长的面包；不同地区菜单的用法可能略有差异。"]}
{"word":"ficent","summary":{"en":"-ficent is a suffix meaning “doing or producing (an effect),” as in beneficent (“doing good”).","zh":"-ficent 是后缀，表示“做……的/产生……作用的”，如 beneficent（行善的、带来好处的）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A suffix (found in words like beneficent) meaning “doing” or “producing” a certain effect; showing a particular kind of influence.","zh":"后缀（常见于 beneficent 等词），表示“做……的 / 产生……作用的 / 具有……影响的”。"},"examples":[{"en":"Beneficent means “doing good” or “producing good results.”","zh":"Beneficent 表示“行善的”或“带来好结果的”。"},{"en":"The suffix -ficent is related to making or doing something, similar to the idea in “efficient.”","zh":"后缀 -ficent 与“做/造成某事”有关，意义上和 efficient 里“产生效果”的感觉相近。"}]}],"synonyms":["-doing","-producing","-causing"],"phonetic":"/ˈfɪsənt/","extraExplanation":["“-ficent”通常不单独作为一个词使用，而是作为构词成分出现在较正式的词里（如 beneficent, maleficent）。","它源自拉丁语中表示“做、制作”的词根（与 *facere* “to do/make”有关）。因此这类词往往带有“产生某种结果/影响”的含义。","易混点：-ficent（多见于形容词，如 beneficent）和 -fici-（常见于动词，如 *benefit* 的相关形式或 *sacrifice* 不同）不是同一个后缀；学习时可先把 -ficent 记成“带来某种效果的”。"]}
{"word":"fices","summary":{"en":"“Fices” alone isn’t a common English word; it’s usually part of another word (e.g., offices, sacrifices).","zh":"“fices”单独使用不是常见英语单词；多半是其他单词的一部分（如offices、sacrifices）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; it usually appears as part of other words (often as the ending “-fice/-fices”) or as a misspelling/partial typing (for example, “offices,” “sacrifices”).","zh":"本身不是标准英语单词；通常只作为其他单词的一部分出现（常见于词尾“-fice/-fices”），或是拼写/输入不完整（如“offices”“sacrifices”）。"},"examples":[{"en":"Did you mean “offices” (workplaces) or “sacrifices” (things you give up)?","zh":"你想问的是“offices”（办公室/机构）还是“sacrifices”（牺牲/付出）呢？"},{"en":"Please send the full sentence so I can guess the correct word.","zh":"请把完整句子发来，我才能判断你想表达的正确单词。"}]}],"phonetic":"/ˈfaɪsɪz/","extraExplanation":["“-fice”常见于一些较正式/书面词汇里，来自拉丁语词根，和“做/制造（make/do）”有关。例如：\n- sacrifice /ˈsækrəˌfaɪs/（牺牲；献祭）→ sacrifices（复数）\n- suffice /səˈfaɪs/（足够；足以）\n- office /ˈɔfɪs/（办公室；职务）→ offices（复数）\n如果你告诉我你看到“fices”的上下文（句子或段落），我可以帮你锁定是哪一个词，并解释用法与区别。"]}
{"word":"fichat","summary":{"en":"Fiat means an official order or decree; often implies something imposed by authority.","zh":"Fiat 指“（权威发布的）命令/法令”，常带有“强制推行”的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal order or decision, often given by a person or authority, that must be obeyed.","zh":"（通常指有权威者发出的）命令；谕令；法令。"},"examples":[{"en":"The policy was introduced by government fiat.","zh":"这项政策是政府以法令形式推行的。"},{"en":"By royal fiat, the city gates were closed at sunset.","zh":"依国王谕令，城门在日落时关闭。"}]},{"partOfSpeech":"adv.","definition":{"en":"Authorized by an official order rather than by normal rules or agreement.","zh":"（因官方命令而）强制规定的；钦定的。"},"examples":[{"en":"The committee was disbanded by fiat.","zh":"该委员会被强制解散了。"},{"en":"He became leader by fiat, not by election.","zh":"他成为领导者是靠强制指定，而不是选举。"}]}],"synonyms":["decree","edict","order","mandate"],"phonetic":"/ˈfiːɑːt/","extraExplanation":["你输入的“fichat”不是常见英文单词；最接近、最常见的词是 **fiat**（法令、命令）。如果你指的是某个品牌名/应用名（例如聊天软件名称），请告诉我上下文（句子或领域），我可以按专有名词再解释。","**fiat** 在新闻与学术写作里常见，带有“自上而下、不经讨论/协商就规定”的语气，因此有时含轻微批评意味。","不要与 **Fiat**（菲亚特，意大利汽车品牌）混淆；品牌名通常首字母大写。"]}
{"word":"fiche","summary":{"en":"Fiche usually means a microfiche: a thin film sheet with mini photos of pages, read with a special machine.","zh":"fiche 通常指縮微膠片（microfiche）：把頁面縮小拍在膠片上，用讀片機查看。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat sheet of photographic film containing tiny images of printed pages, viewed with a special reader; often used to store old newspapers, records, or documents","zh":"縮微膠片（縮微卡）；把文件頁面縮小拍在一張平片膠片上，需用讀片機查看，常用於保存舊報紙、檔案等"},"examples":[{"en":"The librarian showed me how to read the article on microfiche.","zh":"圖書館員教我如何用縮微膠片讀那篇文章。"},{"en":"Many historical newspapers are stored on fiche to save space.","zh":"許多歷史報紙為了節省空間會以縮微膠片保存。"},{"en":"You can print a copy from the fiche reader.","zh":"你可以從縮微讀片機把縮微膠片的內容列印出來。"}]}],"synonyms":["microfiche","film sheet","archival film"],"phonetic":"/fiʃ/","extraExplanation":["「fiche」常見於「microfiche（縮微膠片/縮微卡）」；在英語裡單說 fiche 也能指這種載體，但多數情況會直接說 microfiche。","詞源來自法語 fiche，原意接近「卡片/資料卡」。在檔案管理與圖書館情境中很常見。","文化/使用情境：在數位化普及前，縮微膠片是保存大量紙本資料（如報紙、政府檔案、族譜資料）的重要方式；現在仍常用於查找老資料。"]}
{"word":"fiches","summary":{"en":"“Fiches” usually means record cards or microfiche sheets used to store and organize information.","zh":"“fiches”通常指用于整理信息的资料卡，或用于保存文件的缩微平片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of fiche: small index cards or sheets used to record and organize information (often in libraries, offices, or research).","zh":"fiche 的复数：用于记录与整理信息的小卡片或小纸张（常见于图书馆、办公室或研究资料整理）。"},"examples":[{"en":"The librarian filed the fiches by author’s last name.","zh":"图书管理员按作者姓氏把资料卡（fiches）归档。"},{"en":"She copied dates and quotes onto fiches for her history project.","zh":"她把日期和引文抄到资料卡（fiches）上，用于历史作业。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of fiche: flat sheets of microfilm containing miniaturized documents for storage and reading with a special viewer (microfiche).","zh":"fiche 的复数：用于缩微存储的平片胶片，上面有缩小的文件内容，需要用缩微阅读器查看（缩微平片）。"},"examples":[{"en":"Old newspapers were preserved on fiches in the archive.","zh":"旧报纸以缩微平片（fiches）的形式保存在档案馆里。"},{"en":"You can view the fiches with a microfiche reader.","zh":"你可以用缩微平片阅读器查看这些缩微片（fiches）。"}]}],"synonyms":["index cards","record cards","catalog cards","microfiche (in the microfilm sense)"],"phonetic":"/fiʃ/","extraExplanation":["“fiche”来自法语，意思是“卡片/记录卡”。在英语里常见于较正式或较旧的资料管理语境，尤其是图书馆与档案馆。","与“microfiche（缩微平片）”相关：microfiche 是一种把大量页面缩小印在透明平片上的技术，在数字化普及前非常常用。"]}
{"word":"Fichte-inspired","summary":{"en":"“Fichte-inspired” means influenced by Johann Gottlieb Fichte’s philosophy, especially ideas about the active self, freedom, and sometimes national education/civic duty.","zh":"“Fichte-inspired”指受费希特哲学影响，尤指关于主动的自我、自由（有时也包括国民教育/公民义务）的思想。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Influenced by the ideas of Johann Gottlieb Fichte (a German idealist philosopher), especially his emphasis on the active “I/self,” moral freedom, and the self’s role in shaping experience.","zh":"受约翰·戈特利布·费希特（德国观念论哲学家）的思想影响，尤指他对“自我/主体”的主动性、道德自由，以及主体在建构经验中的作用的强调。"},"examples":[{"en":"The paper offers a Fichte-inspired account of how the self becomes aware of its freedom.","zh":"这篇论文以费希特启发的方式解释自我如何意识到自身的自由。"},{"en":"Her Fichte-inspired reading treats education as the formation of moral agency, not just skill training.","zh":"她以费希特启发的解读把教育看作道德主体性的养成，而不只是技能训练。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More broadly) Echoing Fichte’s political or cultural themes, such as national education, civic responsibility, and community-building.","zh":"（更广义）呼应费希特的政治或文化主题，例如国民教育、公民责任与共同体建构。"},"examples":[{"en":"The speech used Fichte-inspired language about national renewal through education.","zh":"这场演讲使用了受费希特启发的措辞，强调通过教育实现国家复兴。"},{"en":"Some critics call the program Fichte-inspired because it links schooling to citizenship and duty.","zh":"一些批评者称该项目“费希特式”，因为它把学校教育与公民身份和义务紧密联系。"}]}],"synonyms":["Fichtean","Fichtean-inspired","idealist","German-idealist-inspired","selfhood-focused"],"phonetic":"/ˈfɪktə ɪnˈspaɪrd/","extraExplanation":["“Fichte-inspired”常见于学术写作（哲学、政治理论、教育学）。它不是固定术语，而是表示“借鉴费希特的某些观点”。具体指哪些内容要看上下文。","拼写上通常加连字符（Fichte-inspired）来表明这是一个复合形容词；放在名词前更常见，如：a Fichte-inspired theory。","费希特常与“德国观念论”“自我（the I）”“自由与道德行动”相关；在政治语境中也常与《告德意志民族书》（Addresses to the German Nation）及其对民族教育的强调被联系起来。"]}
{"word":"fichtean","summary":{"en":"Fichtean means “related to Johann Gottlieb Fichte or his philosophy,” often emphasizing the active, world-shaping role of the self.","zh":"Fichtean 指“与费希特或其哲学有关”，常强调“自我”主动建构经验与现实的作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the German philosopher Johann Gottlieb Fichte (1762–1814) or to his ideas in German Idealism, especially the view that the self (“I”) actively shapes experience and meaning.","zh":"与德国哲学家约翰·戈特利布·费希特（Johann Gottlieb Fichte，1762–1814）或其思想相关；尤指德国观念论中强调“自我（I）”主动建构经验与意义的观点。"},"examples":[{"en":"Her dissertation gives a Fichtean reading of how the self creates a moral world through action.","zh":"她的论文用费希特式的解读，说明自我如何通过行动建构道德世界。"},{"en":"The novel’s narrator sounds almost Fichtean, insisting that reality depends on the mind’s activity.","zh":"小说叙述者的口吻几乎带有费希特式色彩，坚持认为现实取决于心灵的活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"In a broader, looser sense: strongly focused on selfhood, agency, and the power of the will to shape one’s life or society.","zh":"（更宽泛、较不严格的用法）强调自我、能动性与意志力量，认为它们能塑造个人生活或社会。"},"examples":[{"en":"His speeches have a Fichtean confidence in education’s power to remake a nation.","zh":"他的演讲带着费希特式的自信，相信教育能重塑一个国家。"},{"en":"The coach’s message was almost Fichtean: you become who you decide to be.","zh":"教练的讯息几乎是费希特式的：你会成为你选择成为的那个人。"}]}],"synonyms":["Fichte-inspired","(philosophical) German Idealist","(loosely) self-centered","agency-focused"],"phonetic":"/ˈfɪçtiən/","extraExplanation":["“Fichtean”来自费希特（Fichte）之名，常用于哲学与思想史语境。费希特是德国观念论的重要人物之一，强调“自我（I）”的主动性：不是被动接受世界，而是通过意识与行动赋予世界结构与意义。","在学术写作中，“Fichtean”通常比“idealistic（理想主义的）”更具体：它暗示与费希特的“自我/非我（I / not-I）”、道德行动与自由等主题有关。"]}
{"word":"fichteanism","summary":{"en":"Fichteanism is the philosophical system of J. G. Fichte, highlighting the self’s active role in shaping knowledge, reality, and moral action.","zh":"费希特主义是费希特的哲学体系，强调主体（自我）的能动性，以及其在认识、现实理解与道德行动中的关键作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The philosophy of Johann Gottlieb Fichte (German Idealism), emphasizing the active “I” (the self) as the source of knowledge and moral action, and seeing reality as shaped by the mind’s striving.","zh":"费希特主义：德国观念论哲学家约翰·戈特利布·费希特的思想体系，强调“自我/主体（I）”的能动性，认为认识与道德实践源于主体的主动建构与努力，现实在一定意义上被心灵的行动所形塑。"},"examples":[{"en":"In her paper, she explains Fichteanism as a view that the self is not passive but actively creates meaning through action.","zh":"在论文中，她把费希特主义解释为：自我不是被动接受，而是通过行动主动生成意义。"},{"en":"Some readers connect Fichteanism with later discussions of freedom and responsibility in modern philosophy.","zh":"一些读者把费希特主义与现代哲学中关于自由与责任的讨论联系起来。"}]}],"synonyms":["Fichte’s philosophy","German Idealism (related)","post-Kantian idealism (related)"],"phonetic":"/ˈfɪk.ti.ənˌɪz.əm/","extraExplanation":["“Fichteanism”来自哲学家费希特（Johann Gottlieb Fichte, 1762–1814）的姓氏 + “-ism（主义）”。在英语里常用于学术语境，指他的整体哲学立场或受其影响的一类观点。","费希特通常被归入“德国观念论”（German Idealism），与康德、谢林、黑格尔等同一思想传统相关；但他特别强调主体的能动性、道德实践与自我确立。","学习提示：在阅读哲学文本时，你可能会看到 “Fichtean” 作形容词（如 Fichtean ethics 费希特式伦理学），而 “Fichteanism” 更常指系统或流派层面的概括。"]}
{"word":"fichtelite","summary":{"en":"Fichtelite is a rare waxy hydrocarbon mineral found in fossil wood and peat.","zh":"Fichtelite 指一种发现于化石木与泥炭中的罕见蜡状烃类矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare, waxy natural hydrocarbon (a kind of mineral wax) found in some fossil wood and peat, especially associated with conifer remains; it is used mainly as a scientific specimen rather than in everyday products.","zh":"一种罕见的蜡状天然烃类（可视为“矿物蜡”的一种），常见于部分化石木和泥炭中，尤其与针叶树遗骸有关；主要作为科研标本而非日常用品。"},"examples":[{"en":"The museum’s mineral display includes fichtelite collected from fossil conifer wood.","zh":"这家博物馆的矿物展柜里有一块采自针叶树化石木的菲希特石（fichtelite）。"},{"en":"In the lab, the sample was labeled “fichtelite,” a waxy hydrocarbon found in peat deposits.","zh":"在实验室里，这个样品被标注为“fichtelite”，一种在泥炭沉积中发现的蜡状烃类。"}]}],"synonyms":["mineral wax (general)"],"phonetic":"/ˈfɪk.təl.aɪt/","extraExplanation":["词源提示：fichtelite 以人名/地名（Fichtel）命名，后缀 -lite 常用于矿物名，表示“石、矿物”。","使用场景：这个词多见于地质学、矿物学、古生物相关论文或博物馆说明牌中，日常英语里几乎不使用。","学习建议：可以把它理解为“来自古老植物遗存的天然蜡状烃类矿物”，与“peat（泥炭）”“fossil wood（化石木）”“conifer（针叶树）”等词经常同现。"]}
{"word":"fichu","summary":{"en":"A fichu is a light triangular scarf worn around the neck and upper chest, especially in historical European women’s fashion.","zh":"fichu指一种轻薄的三角披巾/方巾，围在颈部和胸前上方，常见于欧洲历史女性服饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light triangular scarf or kerchief, often made of lace or muslin, worn by women to cover the neck and the top of the chest (especially in 18th–19th century European fashion).","zh":"（常为蕾丝或薄棉布的）三角形轻薄披巾/小方巾，女性用来遮住颈部和胸前上方（尤指18—19世纪欧洲服饰中常见）。"},"examples":[{"en":"In the portrait, she wears a lace fichu tucked into the neckline of her dress.","zh":"在那幅肖像画中，她在裙领里塞着一条蕾丝fichu。"},{"en":"The costume designer added a white fichu to make the outfit look more historically accurate.","zh":"服装设计师加了一条白色fichu，让造型更符合历史。"}]}],"synonyms":["kerchief","neckerchief","scarf","shawl (similar)"],"phonetic":"/ˈfiːʃuː/","extraExplanation":["“fichu”来自法语，原意与“围在颈部的布巾”有关。它常出现在描写18—19世纪欧洲（尤其是法国、英国）女性服饰的文本里，在历史题材小说、戏剧或博物馆服装说明中也很常见。","在英语语境中，fichu更偏“历史服饰用语”，日常更常说kerchief / neckerchief / scarf。"]}
{"word":"fichus","summary":{"en":"“Fichus” means light triangular neck-and-shoulder scarves (plural of “fichu”), often seen in historical or vintage clothing contexts.","zh":"“Fichus”指轻薄的三角披巾/围巾（fichu 的复数），多用于历史服饰或复古穿搭语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of fichu: a light triangular scarf (often lace or linen) worn around the neck and shoulders, especially by women in the 18th–19th centuries.","zh":"fichu 的复数：一种轻薄的三角形披巾/围巾（常为蕾丝或亚麻），围在颈部与肩上，尤见于18–19世纪女性服饰中。"},"examples":[{"en":"In the portrait, she wears a lace fichu pinned neatly at the front.","zh":"在这幅肖像中，她戴着一条蕾丝 fichu，在前面别得很整齐。"},{"en":"The costume designer added fichus to make the outfits look more period-accurate.","zh":"服装设计师加上了 fichus，使造型更符合时代特征。"}]}],"synonyms":["neck scarf","shawl (small/light)","kerchief"],"phonetic":"/ˈfiʃuː/","extraExplanation":["“fichu”借自法语，历史上常与欧洲（尤其法英）18–19世纪女性服装搭配，用来遮住胸口或保暖，也能作为装饰。现代英语里多见于历史描写、戏服/复古穿搭语境。","拼写提示：单数是 fichu，复数常写作 fichus（有时也会见到较少用的法式复数 fichus/fichoux 的讨论，但英语里以 fichus 最常见）。"]}
{"word":"fici","summary":{"en":"-fici- is a Latin-based word part meaning “make/do,” found inside many English words.","zh":"-fici- 是源自拉丁语的构词成分，表示“做/制造”，常出现在许多英语单词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin-derived word part (not usually a standalone word) meaning “to make” or “to do,” seen in many English words.","zh":"一个源自拉丁语的构词成分（通常不单独成词），表示“做、制造”，常见于许多英语词汇中。"},"examples":[{"en":"In beneficial, the part -fici- is related to making or doing good.","zh":"在 beneficial（有益的）中，-fici- 这一部分与“行善/产生好处（做出好事）”的含义有关。"},{"en":"Words like simplify and clarify come from the same Latin idea: “make simple,” “make clear.”","zh":"simplify（使简化）和 clarify（使清楚）来自同一种拉丁语概念：分别是“使变简单”“使变清楚”。"},{"en":"In magnificent, the -fic- part is related to “making/doing,” giving the sense of “doing something great.”","zh":"在 magnificent（宏伟的）中，-fic- 与“做/制造”相关，整体带有“做出伟大之事/呈现伟大效果”的感觉。"}]}],"synonyms":["-fic-","-fy","-fice"],"phonetic":"/ˈfɪʃi/","extraExplanation":["-fici- 常与拉丁语 facere（“做、制造”）有关，在英语里会以不同形式出现，如 -fic-（magnificent）、-fy（simplify）、-fice（sacrifice 的词源关联）。","在实际单词中，这个部分的读音会随拼写与后接字母变化而变化；例如 beneficial 里常听到类似 /fɪʃ/ 的音。若你能提供包含它的完整单词，我可以给出更准确的发音与词义拆解。"]}
{"word":"ficial","summary":{"en":"“-ficial” is a common adjective ending (not a standalone word) found in words like artificial, official, and superficial.","zh":"“-ficial”常见于一些形容词的词尾（不独立成词），如 artificial、official、superficial。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A suffix-like ending in some English adjectives, usually pronounced “-fish-uhl,” seen in words like artificial, official, and superficial. It is not normally used as a separate word by itself.","zh":"一些英语形容词中的词尾（类似后缀），通常读作“-fish-uhl”，常见于 artificial、official、superficial 等词中；一般不单独作为一个词使用。"},"examples":[{"en":"artificial = made by people, not natural","zh":"artificial＝人造的；非自然形成的"},{"en":"official = connected to the government or an organization","zh":"official＝官方的；与政府/机构有关的"},{"en":"superficial = only on the surface; not deep","zh":"superficial＝表面的；肤浅的"}]}],"synonyms":["(ending in) -cial","(ending in) -tial"],"phonetic":"/ˈfɪʃəl/","extraExplanation":["“-ficial”本身不是一个常用的独立单词，更像是你在拼写时看到的“词尾”。不同单词的词源不完全一样：比如 artificial 常与拉丁语 facere（做、制造）相关；而 superficial 更接近“表面/外表”的来源。","如果你想查的是“facial”（面部的），那是一个完整的形容词，拼写是 f-a-c-i-a-l，读音和含义都不同。可以告诉我你想表达的完整单词或句子，我能帮你精准解释。"]}
{"word":"ficient","summary":{"en":"“Ficient” is a rare adjective meaning “skilled,” mostly seen as the suffix -ficient in words like “proficient.”","zh":"“ficient”是个很少单独使用的形容词，意为“熟练的”，多作为后缀出现在proficient等词中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, mostly used in compounds) skilled; having a good ability to do something.","zh":"（罕见，主要用于复合词中）熟练的；有能力的。"},"examples":[{"en":"She is computer-ficient and learns new software quickly.","zh":"她在电脑方面很熟练，学新软件很快。"},{"en":"In modern English, you usually see -ficient in words like proficient.","zh":"在现代英语里，你通常在 proficient 这样的词中看到 -ficient。"}]}],"synonyms":["skilled","capable","adept"],"phonetic":"/ˈfɪʃənt/","extraExplanation":["“ficient”在当代英语中几乎不单独使用，更常见的是作为后缀“-ficient”出现在proficient（熟练的）、deficient（不足的）等词里。","词源上与拉丁语 *facere*（做）有关：-ficient 大致有“正在做/达到某种状态”的含义，所以proficient可理解为“在某方面做得很好”。","学习建议：日常写作与考试中不建议单独用ficient；更自然的表达是proficient in…（在……方面熟练）或skilled at/in…（擅长……）。"]}
{"word":"ficiform","summary":{"en":"Ficiform means “fig-shaped,” a rare adjective mostly found in older scientific descriptions.","zh":"ficiform 指“无花果状的”，是较罕见的形容词，多见于较旧的科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) shaped like a fig; fig-shaped.","zh":"（罕见）无花果状的；像无花果一样的形状。"},"examples":[{"en":"Some older botanical descriptions use ficiform to describe fig-shaped fruit or galls.","zh":"一些较早的植物学描述会用 ficiform 来形容无花果状的果实或虫瘿。"},{"en":"The swelling was described as ficiform in appearance.","zh":"这种肿胀的外观被描述为无花果状。"}]}],"synonyms":["fig-shaped","figlike","pyriform (pear-shaped)"],"phonetic":"/ˈfɪsəˌfɔrm/","extraExplanation":["ficiform 很少见，多用于较旧的科学写作（尤其是植物学/解剖学）来描述“形状像无花果”。词源来自拉丁语 ficus（无花果）+ -form（……形状的）。","如果你其实想查的是更常见的词，比如 fig-shaped（像无花果的）或 pear-shaped（梨形的），也可以告诉我上下文句子，我帮你确认拼写。"]}
{"word":"ficin","summary":{"en":"Ficin is a protein-digesting enzyme from figs, used especially in labs and sometimes for tenderizing meat.","zh":"Ficin 是一种来自无花果的分解蛋白质的酶，常用于实验室研究，有时也用于嫩肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme (a protein) found in fig latex that breaks down proteins; used in research and sometimes as a meat tenderizer","zh":"一种存在于无花果乳汁中的酶（蛋白质），能分解蛋白质；用于科研，有时也用于嫩肉"},"examples":[{"en":"Ficin is a proteolytic enzyme extracted from figs.","zh":"Ficin 是一种从无花果中提取的蛋白水解酶。"},{"en":"Some studies use ficin to digest proteins before analysis.","zh":"一些研究会用 ficin 在分析前消化（分解）蛋白质。"},{"en":"Ficin can be used as a meat tenderizer because it breaks down muscle proteins.","zh":"Ficin 可用作嫩肉剂，因为它能分解肌肉蛋白。"}]}],"synonyms":["protease","proteolytic enzyme"],"phonetic":"/ˈfaɪsɪn/","extraExplanation":["Ficin 常见于生物化学/实验室语境，属于“蛋白酶（protease）”的一种，来源与木瓜蛋白酶（papain）、菠萝蛋白酶（bromelain）类似，都是植物来源的蛋白水解酶。","词源与无花果属（Ficus）有关；ficin 的名字来自 Ficus（无花果属）的拉丁名。","注意拼写：ficin 常被误写为 *ficine* 或与 *fission*（裂变/分裂）混淆；发音以重音在第一个音节为常见。"]}
{"word":"ficins","summary":{"en":"“Ficins” means multiple ficin enzymes from figs that break down proteins.","zh":"“ficins”指多种无花果来源的蛋白水解酶，用于分解蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Proteolytic enzymes from fig latex, used to break down proteins (for example, in food processing or research).","zh":"（复数）无花果乳汁中的蛋白水解酶，用来分解蛋白质（例如用于食品加工或科研）。"},"examples":[{"en":"Ficins can tenderize meat by breaking down muscle proteins.","zh":"无花果蛋白酶可以分解肌肉蛋白，从而让肉更嫩。"},{"en":"The lab compared ficins with papain to see which enzyme worked faster.","zh":"实验室把无花果蛋白酶和木瓜蛋白酶作比较，看哪一种酶反应更快。"}]}],"synonyms":["protease","proteinase","enzyme"],"phonetic":"/ˈfaɪsɪn/","extraExplanation":["“ficins”是名词“ficin”的复数形式；ficin 常译作“无花果蛋白酶/无花果凝乳酶”。它来自无花果（fig, Ficus）树的乳汁（latex），能切割蛋白质，因此在肉类嫩化、食品加工与生物化学实验中可能出现。","如果你原本想查的是更常见的单词，可能是拼写相近的：fictions（小说/虚构作品）或 Ficuses（无花果属植物，复数）。你可以告诉我你想表达的句子，我帮你确认。"]}
{"word":"ficio","summary":{"en":"“Ficio” isn’t standard English; it’s likely a misspelling of “fiction” or “fictitious.”","zh":"“ficio”不是标准英语词；多半是“fiction”或“fictitious”的误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. In English writing, “ficio” is usually a misspelling or a fragment of another word (most often “fiction” or “fictitious”).","zh":"不是标准英语单词。在英文中，“ficio”通常是拼写错误或某个单词的残缺形式（最常见是“fiction / 虚构作品”或“fictitious / 虚构的”）。"},"examples":[{"en":"I couldn’t find “ficio” in an English dictionary—did you mean “fiction”?","zh":"我在英文词典里找不到“ficio”——你是不是想写“fiction（小说/虚构作品）”？"},{"en":"If you’re describing something not real, the usual word is “fictitious,” not “ficio.”","zh":"如果你想表达“不是事实的”，常用词是“fictitious（虚构的）”，而不是“ficio”。"}]}],"synonyms":["fiction","fictitious","fabricate"],"phonetic":"/ˈfɪsi.oʊ/","extraExplanation":["“fic-”常见于英语词根，和“make/做、形成”或“虚构”相关（例如 fiction, fictitious, fabricate）。如果你告诉我你看到“ficio”的句子或语境（在哪本书/哪门课/哪个国家的用法），我可以更准确判断你想找的词。"]}
{"word":"ficium","summary":{"en":"Ficium is a rare Latin/Latinized word form connected to “fig,” occasionally seen in older scientific or medicinal texts or as an old-style taxonomic name.","zh":"Ficium 是一个罕见的拉丁语/拉丁化词形，和“无花果”有关，偶见于较早的科学/药用文献或旧式分类学名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; Latin/Neo‑Latin) A term related to “fig,” sometimes used in older scientific or medicinal Latin to refer to a fig or fig-based material.","zh":"（罕见；拉丁语/新拉丁语）与“无花果”有关的词形，在较早的科学或药用拉丁文中有时用来指无花果或无花果制品。"},"examples":[{"en":"In some older herbals, Latin plant notes may include a form like “ficium” when discussing figs.","zh":"在一些较早的草药书里，谈到无花果时的拉丁文注释里可能会出现类似“ficium”的词形。"},{"en":"The recipe lists dried fig, sometimes labeled in Latinized form in historical texts.","zh":"该配方写的是干无花果，在历史文献中有时会用拉丁化的形式来标注。"}]},{"partOfSpeech":"n.","definition":{"en":"(As a scientific name; rare) Used in or resembling a Latin genus/species name in taxonomy, generally connected to the idea of “fig.”","zh":"（作学名；罕见）在分类学中作为或类似拉丁化的属/种名使用，含义通常与“无花果”相关。"},"examples":[{"en":"You may encounter “Ficium” capitalized in older catalogues, though modern naming may differ.","zh":"你可能会在较旧的目录中看到首字母大写的“Ficium”，但现代命名可能已不同。"}]}],"synonyms":["ficus","fig"],"phonetic":"ˈfɪkiəm","extraExplanation":["“ficium”并不是现代英语里的常用词，更常见的是拉丁词根 fic-（如 ficus = 无花果）。在阅读旧植物志、药典或博物学文本时，可能会遇到这种拉丁词形变化或拉丁化拼写。","如果你是在某本书/某张图片里看到“ficium”，把原句或上下文发来会更容易判断它到底是拉丁语的词形、拼写变体，还是某个旧的分类学名称。"]}
{"word":"fickle","summary":{"en":"Fickle means changing often and unpredictably, especially in feelings, loyalty, or conditions like weather or fortune.","zh":"Fickle 指反复无常、善变、难以预测，常形容人的感情与忠诚不稳定，也可形容天气、运气等变化无常。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changing your mind or feelings often, so you are not loyal or consistent.","zh":"（人）反复无常的；善变的；不够坚定、缺乏忠诚或一致性。"},"examples":[{"en":"He’s too fickle to keep the same job for a year.","zh":"他太善变了，同一份工作很难坚持一年。"},{"en":"Public opinion can be fickle, changing quickly after one news story.","zh":"公众舆论可能很反复无常，一条新闻出来就迅速改变。"},{"en":"She’s not unkind—just fickle about her plans.","zh":"她并不是不友善，只是对计划很容易变来变去。"}]},{"partOfSpeech":"adj.","definition":{"en":"Changing unpredictably (often used for weather, luck, or fortunes).","zh":"（事物）难以预测、变化无常的（常用于天气、运气、命运等）。"},"examples":[{"en":"Spring weather is fickle—warm one day and cold the next.","zh":"春天天气变化无常，今天暖明天就冷。"},{"en":"Fame can be fickle, disappearing as quickly as it arrives.","zh":"名声也可能很无常，来得快去得也快。"}]}],"synonyms":["changeable","inconstant","unpredictable","capricious","unstable"],"phonetic":"/ˈfɪkəl/","extraExplanation":["“fickle”常带一点批评意味，形容人“不可靠、容易变心”。如果只是想表达“常常改变想法”但语气更中性，可以用“changeable”或“indecisive”（更强调犹豫不决）。","常见搭配：fickle lover（善变的恋人）、fickle friend（不可靠的朋友）、fickle public/opinion（多变的公众/舆论）、the fickle winds/fortune（无常的风/命运）。"]}
{"word":"ficklehearted","summary":{"en":"Ficklehearted describes someone whose feelings or loyalty change easily and often.","zh":"Ficklehearted 指感情或忠诚容易变化、缺乏稳定与专一的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"changing your feelings, opinions, or loyalty often; not steady or dependable in affection or commitment","zh":"感情或立场多变的；不专一、不稳定、难以依靠（常指对人或关系的态度）"},"examples":[{"en":"He was too ficklehearted to stay in one relationship for long.","zh":"他太善变、不专一，很难在一段关系里长久坚持下去。"},{"en":"The novel warns against ficklehearted friends who disappear when times get hard.","zh":"这部小说告诫人们要提防那些在困难时就消失的薄情朋友。"},{"en":"Don’t make big promises if you know you’re ficklehearted.","zh":"如果你知道自己容易变心，就别轻易许下重诺。"}]}],"synonyms":["fickle","inconstant","changeable","flighty","unreliable","capricious"],"phonetic":"/ˈfɪkəlˌhɑrtɪd/","extraExplanation":["“ficklehearted”由“fickle（善变的）+ hearted（……心的/……性格的）”构成，语感偏文学或较正式写法；日常更常见的是“fickle”或“fickle-hearted（带连字符）”。","它通常带有负面评价，强调在感情、友谊或忠诚方面“变来变去”。写作中可用来塑造人物性格（例如爱情故事里“不专一的情人”、政治语境里“立场不坚定的人”）。"]}
{"word":"ficklely","summary":{"en":"“Ficklely” means “in a fickle, changeable, unpredictable way.”","zh":"“ficklely”表示“反复无常地、善变地、难以预测地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a fickle way; changing opinions, feelings, or decisions often and unpredictably.","zh":"反复无常地；（观点、感情或决定）经常且难以预测地改变。"},"examples":[{"en":"The committee responded ficklely, supporting the plan one week and rejecting it the next.","zh":"委员会的反应反复无常，这周支持这个计划，下周又否决。"},{"en":"He treated his hobbies ficklely, abandoning each new interest after a few days.","zh":"他对兴趣爱好很反复无常，每个新兴趣没过几天就放弃。"},{"en":"Markets can move ficklely when investors feel uncertain.","zh":"当投资者感到不确定时，市场可能会反复无常地波动。"}]}],"synonyms":["capriciously","erratically","unpredictably","inconsistently","changeably"],"phonetic":"/ˈfɪkəli/","extraExplanation":["“ficklely”是形容词“fickle”的副词形式，但在现代英语里相对少见；很多情况下更常用的表达是“in a fickle way”或用副词“erratically / unpredictably / capriciously”来替代。写作中用“ficklely”会显得更正式或更文学化。"]}
{"word":"fickleness","summary":{"en":"Fickleness means frequent, unreliable change in feelings, opinions, or loyalty.","zh":"fickleness 指情感、观点或忠诚经常变化、缺乏稳定性，带有不可靠的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of changing your feelings, opinions, or loyalties often and suddenly; not staying consistent.","zh":"（情感、观点或忠诚）反复无常、善变；缺乏稳定性。"},"examples":[{"en":"Her fickleness made it hard to trust her decisions.","zh":"她的反复无常让人很难信任她的决定。"},{"en":"The coach complained about the team’s fickleness after a few losses.","zh":"几场失利后，教练抱怨球队的状态和态度不够稳定。"},{"en":"In politics, fickleness among voters can change the result quickly.","zh":"在政治中，选民的善变可能迅速改变结果。"}]}],"synonyms":["inconstancy","unreliability","volatility","changeability"],"phonetic":"/ˈfɪkəl.nəs/","extraExplanation":["“fickle”表示“善变的、反复无常的”，后缀“-ness”把形容词变成名词，表示“……的性质/状态”，所以“fickleness”就是“善变这一特质”。","这个词常用于评价人的感情、忠诚、友谊、兴趣或公众舆论的变化；语气多为负面，暗含“不可靠、难以依靠”。","在文学与日常表达中，常见搭配有：the fickleness of love（爱情的善变）、the fickleness of fortune（命运无常）、the fickleness of public opinion（舆论反复）。"]}
{"word":"ficklenesses","summary":{"en":"Fickleness means being changeable and not steady in feelings, choices, or loyalty.","zh":"Fickleness 指在感情、选择或立场上不稳定、容易改变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of often changing your mind, feelings, or loyalties; not being steady or reliable","zh":"（想法、感情或立场）多变；反复无常；不坚定"},"examples":[{"en":"He was tired of her fickleness and wanted a more stable relationship.","zh":"他受够了她的反复无常，想要一段更稳定的关系。"},{"en":"The coach worried about the player’s fickleness—one bad game and he wanted to quit.","zh":"教练担心这名球员不够坚定——一场比赛打得不好就想放弃。"},{"en":"Public opinion can show great fickleness during an election.","zh":"选举期间，公众舆论可能会表现得非常多变。"}]}],"synonyms":["inconstancy","unpredictability","capriciousness","instability"],"phonetic":"/ˈfɪkəl.nəs/","extraExplanation":["你输入的 **ficklenesses** 很可能是 **fickleness**（单数）或 **ficklenesses**（复数，较少见）的拼写/形式。通常更常用的是不可数名词 **fickleness**（表示一种“多变的特质”），复数多用于强调“多次/多方面的反复无常”。","词根提示：**fickle**（adj. 反复无常的）+ **-ness**（名词后缀，表示“……的性质/状态”）。"]}
{"word":"fickler","summary":{"en":"“Fickler” means “more fickle”: more changeable and less reliable.","zh":"“fickler”是“fickle”的比较级，表示“更善变、更不可靠”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more likely to change your mind, feelings, or loyalty quickly; less steady or reliable than someone or something else","zh":"更善变的；比别人/别的事物更容易改变想法、感情或立场的；更不可靠的"},"examples":[{"en":"She’s fickler than her brother—she changes her plans every week.","zh":"她比她哥哥更善变——几乎每周都在改计划。"},{"en":"The market is even fickler this year, so we’re being careful with investments.","zh":"今年市场更反复无常，所以我们对投资更谨慎。"}]}],"synonyms":["more changeable","more unpredictable","more capricious","less steady","less consistent"],"phonetic":"/ˈfɪk(ə)lɚ/","extraExplanation":["“fickler”是形容词“fickle”的比较级，表示“更善变/更不稳定”。最高级是“ficklest”。","很多学习者会把它当成一个独立新词，其实它主要用于比较两个人/事物的“稳定程度”。","如果你想表达“非常善变”，更常见的说法是“very fickle”，而不是一直用比较级。"]}
{"word":"ficklest","summary":{"en":"“Ficklest” means the most changeable or unpredictable in feelings, opinions, loyalty, or conditions like weather.","zh":"“ficklest”表示在情感、观点、忠诚或天气等方面“最善变、最难以预测的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “fickle”: changing your mind, feelings, or loyalty very often; the most unpredictable or inconsistent.","zh":"“fickle”的最高级：想法、感情或忠诚经常改变；最善变、最不可靠的。"},"examples":[{"en":"Of all the voters in this district, younger voters are often the ficklest.","zh":"在这个选区的所有选民中，年轻选民常常是最善变的。"},{"en":"He was the ficklest friend—warm one week and distant the next.","zh":"他是最不可靠的朋友——这一周很热情，下一周又很冷淡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Also used for conditions like weather or luck) changing frequently and suddenly; the most changeable.","zh":"（也可形容天气、运气等）变化频繁且突然；最变化无常的。"},"examples":[{"en":"Spring can bring the ficklest weather—sunny mornings and stormy afternoons.","zh":"春天常带来最变化无常的天气——早上晴朗，下午却可能暴风雨。"},{"en":"In the mountains, the ficklest winds can arrive without warning.","zh":"在山区，最难以捉摸的风可能毫无预警地出现。"}]}],"synonyms":["most changeable","most unpredictable","most inconsistent","most unstable","most volatile"],"phonetic":"/ˈfɪkəlɪst/","extraExplanation":["“ficklest”是形容词“fickle”的最高级形式，常见结构是“the ficklest + 名词”（the ficklest audience/market/friend）。","语气通常偏负面，暗示“不稳定、不可靠”。如果想更中性一些，可以用“most changeable / most unpredictable”。"]}
{"word":"ficklety","summary":{"en":"“Ficklety” means fickleness—being changeable or unreliable in feelings, decisions, or loyalty.","zh":"“ficklety”意为“反复无常/不坚定”，相当于更常见的“fickleness”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Changeability of mind, mood, or loyalty; the quality of being fickle (not steady or reliable).","zh":"反复无常；三心二意；不够坚定（“fickle”的名词形式，意为不稳定、不可靠的特质）。"},"examples":[{"en":"Her sudden ficklety made it hard for the team to plan anything.","zh":"她突然的反复无常让团队很难制定任何计划。"},{"en":"He apologized for his ficklety and promised to follow through this time.","zh":"他为自己的三心二意道歉，并承诺这次会坚持到底。"}]}],"synonyms":["fickleness","inconstancy","volatility","capriciousness"],"phonetic":"/ˈfɪkəlti/","extraExplanation":["“ficklety”在现代英语中非常少见，通常会用更常见的名词“fickleness”。在写作或考试中，建议优先使用“fickleness”，因为读者更容易理解。","词根来自形容词“fickle”（反复无常的）。日常表达中也常用：be fickle（很善变）、change one’s mind often（经常改主意）。"]}
{"word":"ficklewise","summary":{"en":"“Ficklewise” means “in a fickle, changeable way,” but it’s rare in modern English.","zh":"“ficklewise”意为“反复无常地、善变地”，但在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a fickle or changeable way; in a way that shows quickly changing feelings, choices, or loyalty.","zh":"反复无常地；善变地（指情感、选择或忠诚容易改变）。"},"examples":[{"en":"He supported the plan at first, but then acted ficklewise when the results weren’t immediate.","zh":"他一开始支持这个计划，但当效果没有立刻出现时就表现得反复无常。"},{"en":"If you respond ficklewise to every small problem, people may stop trusting your decisions.","zh":"如果你对每个小问题都善变地反应，人们可能会不再信任你的决定。"}]}],"synonyms":["inconsistently","changeably","unpredictably","waveringly","in a fickle way"],"phonetic":"/ˈfɪkəlˌwaɪz/","extraExplanation":["“ficklewise”非常少见，更多时候人们会用“fickly”（较少见）或用更自然的表达：\"in a fickle way\" / \"changeably\" / \"inconsistently\"。","后缀“-wise”常表示“以……方式；在……方面”（如“clockwise”“otherwise”“likewise”）。把它加在“fickle”后面在构词上说得通，但在现代英语里不常用，可能显得古旧或刻意。"]}
{"word":"fickly","summary":{"en":"Fickle means changeable and unpredictable, especially in feelings, opinions, or loyalty.","zh":"Fickle 指反复无常、难以预测，常形容人的情感、态度或忠诚不稳定。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"changing feelings, opinions, or choices often and unpredictably; not steady or loyal","zh":"（情感、想法或选择）反复无常的；不坚定的；善变的"},"examples":[{"en":"He’s fickle—one day he loves the plan, the next day he hates it.","zh":"他很善变——今天喜欢这个计划，明天又讨厌它。"},{"en":"Public opinion can be fickle, especially online.","zh":"公众舆论可能很反复无常，尤其在网上。"},{"en":"She was tired of his fickle promises.","zh":"她厌倦了他反复无常的承诺。"}]},{"partOfSpeech":"adj.","definition":{"en":"often changing and hard to predict (used about things like weather or fortune)","zh":"（多指天气、运气等）变化无常的；难以预测的"},"examples":[{"en":"Spring weather is fickle: warm in the morning and cold at night.","zh":"春天的天气变化无常：早上暖和，晚上又冷。"},{"en":"Fame can be fickle and disappear quickly.","zh":"名声往往变化无常，可能很快就消失。"}]}],"synonyms":["changeable","unpredictable","inconstant","capricious","volatile"],"phonetic":"/ˈfɪkəl/","extraExplanation":["你写的“fickly”通常是拼写错误；标准拼写是“fickle”。“fickle”常用来形容人感情或态度不稳定，也常出现在文学里（如“the fickle world / fickle fortune”），强调世事无常、难以依靠。"]}
{"word":"fico","summary":{"en":"FICO: a widely used U.S. credit score that helps lenders judge borrowing risk.","zh":"FICO：美国最常用的信用评分之一，用于帮助贷款方评估借款风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a credit score created by the Fair Isaac Corporation, commonly used in the U.S. to predict how likely someone is to repay borrowed money","zh":"FICO信用评分（由费埃哲公司 Fair Isaac Corporation 制定），在美国常用于预测借款人偿还债务的可能性"},"examples":[{"en":"My FICO score went up after I paid off my credit card balance.","zh":"我把信用卡余额还清后，FICO分数上升了。"},{"en":"Many lenders check your FICO score before approving a loan.","zh":"很多贷款机构在批准贷款前会查看你的FICO分数。"},{"en":"A higher FICO score can help you qualify for a lower interest rate.","zh":"较高的FICO分数可能帮助你拿到更低的利率。"}]}],"synonyms":["credit score","FICO score"],"phonetic":"/ˈfaɪkoʊ/","extraExplanation":["FICO 是一个缩写（Fair Isaac Corporation），日常口语里常直接说“FICO score”。","常见的 FICO 评分范围通常是 300–850；分数越高，一般代表信用风险越低。","在美国生活中，租房、办信用卡、买车贷款、房贷等场景都可能会用到信用分；不同机构也可能使用其他评分模型（如 VantageScore），但 FICO 最常见。"]}
{"word":"ficoes","summary":{"en":"“FICOs” commonly refers to FICO credit scores (plural), widely used in the U.S. to judge credit risk.","zh":"“FICOs”常指 FICO 信用评分的复数形式，在美国广泛用于评估借款人的信用风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a credit score made by the company Fair Isaac (FICO) that lenders use to estimate how likely someone is to repay borrowed money","zh":"由费埃哲公司（Fair Isaac，简称 FICO）生成的一种信用评分，贷款机构用它来估计一个人按时还款的可能性"},"examples":[{"en":"My FICO score went up after I paid down my credit card balance.","zh":"我把信用卡欠款还了一部分后，FICO 分数上升了。"},{"en":"Some landlords check your FICO score before approving an application.","zh":"有些房东会在批准申请前查看你的 FICO 分数。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural form of FICO score (often written as “FICOs” in casual writing); used to talk about multiple people’s scores or multiple score versions","zh":"FICO score 的复数形式（口语/非正式写法常写作 “FICOs”）；用于表示多个人的分数或多个版本的评分"},"examples":[{"en":"Lenders may pull FICOs from different credit bureaus.","zh":"贷款机构可能会从不同的征信机构调取多个 FICO 分数。"},{"en":"They compared their FICOs before applying for a mortgage.","zh":"他们在申请房贷前比较了各自的 FICO 分数。"}]}],"synonyms":["credit score","FICO score"],"phonetic":"/ˈfaɪkoʊ/","extraExplanation":["“FICO”来自公司名 Fair Isaac Corporation（费埃哲）。在美国语境里，日常说“my FICO”通常就是指自己的信用评分。","常见范围大致是 300–850；分数越高通常代表信用风险越低。不同机构/模型（例如不同版本、不同征信局）可能给出略有差异的分数，所以会出现复数 “FICOs”。","如果你原本想查的是别的词（比如拼写为 “ficções” 的葡语，意思是“虚构/小说作品”），告诉我语言或上下文，我可以换成你需要的词条。"]}
{"word":"ficoid","summary":{"en":"“Ficoid” means fig-like or related to the fig genus (Ficus), mainly used in botanical contexts.","zh":"“Ficoid”意为“无花果状的/与榕属（Ficus）相关的”，主要用于植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fig-like; resembling a fig or related to the fig genus (Ficus), especially in botanical descriptions.","zh":"无花果状的；像无花果的；（尤用于植物学）与榕属/无花果属（Ficus）有关或相似的。"},"examples":[{"en":"The botanist described the plant’s fruit as ficoid in shape.","zh":"植物学家把这种植物的果实形状描述为无花果状（ficoid）。"},{"en":"Some species have ficoid structures that resemble small figs.","zh":"有些物种具有类似小无花果的无花果状结构。"}]}],"synonyms":["fig-like","ficus-like"],"phonetic":"ˈfaɪkɔɪd","extraExplanation":["“ficoid”由拉丁语词根 ficus（无花果/榕）+ 后缀 -oid（“像……一样的”）构成，常见于植物学或生物学的形态学描述中，属于较专业、偏书面用语。","在日常英语里很少用到；更常见的表达可能是 “fig-like”（像无花果的）或 “related to Ficus”（与榕属相关的）。"]}
{"word":"ficoidaceae","summary":{"en":"Ficoidaceae is a plant family name for the succulent “ice-plant” group, mostly from southern Africa.","zh":"Ficoidaceae 指番杏科（冰花植物类群）的科名，多为原产非洲南部的多肉植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family of succulent flowering plants (the ice-plant family), mostly from southern Africa, known for fleshy leaves and often bright, daisy-like flowers","zh":"番杏科；一类多肉开花植物（常称“冰花植物/冰花科植物”），多原产于非洲南部，以肥厚多汁的叶片和常见的雏菊状鲜艳花朵著称"},"examples":[{"en":"Many garden “ice plants” belong to the family Ficoidaceae.","zh":"许多园艺中常见的“冰花植物”属于番杏科（Ficoidaceae）。"},{"en":"Ficoidaceae species are adapted to dry climates with their succulent leaves.","zh":"番杏科的许多物种通过多肉叶片来适应干旱气候。"}]}],"synonyms":["ice-plant family","Aizoaceae (modern classification)"],"phonetic":"/ˌfaɪ.kɔɪˈdeɪ.si.i/","extraExplanation":["“Ficoidaceae”是植物分类学中的科名，来自拉丁化命名；词根与“ficus（无花果）”有关，早期命名与某些成员的果实形态联想相关。","在较新的分类系统（如APG系统）里，番杏科中的许多属常被归入更常用的“番杏科 Aizoaceae”框架下；因此在现代资料中你可能更常看到 Aizoaceae。查资料时可把两者作为相关检索词。"]}
{"word":"ficoidal","summary":{"en":"Ficoidal means “fig-shaped” or “resembling a fig,” mainly in scientific descriptions.","zh":"ficoidal 指“无花果状的/形似无花果的”，主要用于科学语境中的形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fig-shaped; resembling a fig (often used in biology or botany to describe a shape).","zh":"无花果状的；形似无花果的（常用于生物学或植物学中描述形状）。"},"examples":[{"en":"Under the microscope, the cells looked ficoidal, with a swollen base and a narrower top.","zh":"在显微镜下，这些细胞呈无花果状，底部较鼓、顶部较窄。"},{"en":"The botanist described the fruit as small and ficoidal rather than perfectly round.","zh":"植物学家描述这种果实较小，呈无花果状，而不是完全圆形。"}]}],"synonyms":["fig-shaped","figlike","ficiform"],"phonetic":"/fɪˈkɔɪdəl/","extraExplanation":["“ficoidal”是比较少见的学术用词，多见于形态描述（如生物学、植物学、医学解剖的外形比喻）。词根来自拉丁语 ficus（无花果），-oid/-oidal 表示“……形的/类似……的”。"]}
{"word":"ficoideae","summary":{"en":"Ficoideae is a botanical subfamily name within the ice plant family (Aizoaceae).","zh":"Ficoideae 是番杏科（冰花科）中的一个植物亚科名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of flowering plants in the ice plant family (Aizoaceae), including many succulent species often found in dry or coastal habitats.","zh":"番杏科（Aizoaceae）中的一个亚科（番杏亚科），包含许多多肉植物，常见于干旱或海岸等环境。"},"examples":[{"en":"Many ornamental ice plants belong to the subfamily Ficoideae.","zh":"许多观赏用的“冰花/冰植物”（ice plants）属于番杏亚科（Ficoideae）。"},{"en":"Researchers compared salt tolerance across several Ficoideae species growing near the coast.","zh":"研究人员比较了生长在海岸附近的多种番杏亚科植物的耐盐性。"}]}],"synonyms":["Aizoaceae (family context)","ice plant group (informal)","Ficoideae subfamily"],"phonetic":"/ˌfɪkɔɪˈdiːi/","extraExplanation":["“Ficoideae”是拉丁化的植物分类学名称：-oideae 常用来表示“亚科”。日常英语里更常说 ice plant family（冰花科/番杏科）或直接说某个属、某个物种。","该类群里有不少多肉植物，常见特征包括储水的肉质叶、适应干旱与强光的生理结构等；但具体特征会因属和物种而异。","学习时可把它当作“学术写作/植物学论文里会出现的分类名”，在普通对话中使用频率较低。"]}
{"word":"ficoides","summary":{"en":"Ficoides is an older botanical name used for certain succulent ice plants, now usually classified under other genera (e.g., Mesembryanthemum).","zh":"Ficoides 是旧的植物学名称，曾指一些多肉冰花类植物；现代多改归其他属（如番杏属 Mesembryanthemum）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A former or informal Latin genus name used for certain succulent “ice plants” in the fig-marigold family (Aizoaceae), often referring to plants now classified in genera such as Mesembryanthemum.","zh":"（植物）一个旧的/非正式的拉丁属名，曾用于指某些多肉“冰花”（番杏科 Aizoaceae）植物，现代多多归入如 Mesembryanthemum（番杏属）等属。"},"examples":[{"en":"In older horticultural books, some ice plants may be listed under the name Ficoides.","zh":"在较早的园艺书里，一些冰花类植物可能会被写作 Ficoides。"},{"en":"The label says Ficoides, but the plant is now usually classified as Mesembryanthemum.","zh":"标签写着 Ficoides，但这种植物现在通常归类为 Mesembryanthemum。"}]}],"synonyms":["ice plant","Mesembryanthemum","fig-marigold"],"phonetic":"/fɪˈkɔɪˌdiz/","extraExplanation":["“Ficoides”常见于旧的植物学/园艺文献或植物标签中，属于分类学沿革留下的名称；不同地区和年代的用法不完全一致。","词源上含有“-oides（……样的）”，整体大意接近“像无花果一样的”，多用于拉丁化的植物命名体系中。"]}
{"word":"ficolin","summary":{"en":"A ficolin is an immune-system protein that binds to microbes and helps trigger complement (lectin pathway).","zh":"纤凝集素是一类先天免疫蛋白，可结合病原体并触发补体系统的凝集素途径。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of protein in the immune system that recognizes certain patterns on microbes and helps activate the lectin pathway of the complement system (part of the body’s early, “innate” defense).","zh":"（免疫学）纤凝集素：一种免疫系统中的蛋白质，可识别微生物表面的特定“模式”，并帮助激活补体系统的凝集素途径（先天免疫的一部分）。"},"examples":[{"en":"Researchers measured serum ficolin levels to study early immune responses to infection.","zh":"研究人员测量了血清中纤凝集素的水平，以研究感染时的早期免疫反应。"},{"en":"Low ficolin activity may be associated with increased susceptibility to certain infections.","zh":"纤凝集素活性偏低可能与更易感染某些疾病有关。"}]}],"synonyms":["pattern-recognition molecule","lectin (related, broader term)","innate immune protein"],"phonetic":"/faɪˈkoʊlɪn/","extraExplanation":["“Ficolin”常见于医学与生物学论文（免疫学、感染、炎症等语境），日常英语中很少使用。","词源上常被解释为与“ficus（无花果）”相关，指其结构中类似“纤维蛋白原样（fibrinogen-like）”的识别结构域；它属于模式识别分子（PRMs）的一类。","常见类型包括 M-ficolin、L-ficolin、H-ficolin（不同物种或不同基因产物的分类方式略有差异），它们都可参与补体激活与病原体清除。"]}
{"word":"fict","summary":{"en":"“fict” is most commonly seen as the abbreviation “fict.” meaning “fictional/invented.”","zh":"“fict”最常见用法是作为缩写“fict.”，表示“虚构的/编造的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(abbreviation) fictional; invented; not real (often seen in notes, labels, or citations as “fict.”).","zh":"（缩写）虚构的；编造的；不真实的（常在注释、标签或引用中写作“fict.”）。"},"examples":[{"en":"The case name is fict., used to protect the person’s privacy.","zh":"这个案件名称标注为 fict.，用来保护当事人的隐私。"},{"en":"In the bibliography, some titles are marked “fict.” to show they are imaginary.","zh":"在参考文献里，有些标题标注“fict.”，表示它们是虚构的。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a shortened form used informally to mean “fiction” or “fictional work.”","zh":"（少见）非正式缩写，用来指“小说/虚构作品”或“虚构类内容”。"},"examples":[{"en":"I’m in the mood for some fict tonight—maybe a mystery novel.","zh":"我今晚想看点 fict——也许来本悬疑小说。"}]}],"synonyms":["fictional","invented","imaginary","made-up","fictitious"],"phonetic":"/fɪkt/","extraExplanation":["“fict-”常见于词根中，来自拉丁语 *fingere*（塑造、捏造、编造）。因此你会在一些常用词里看到类似含义：\n- **fiction**（小说；虚构）\n- **fictitious**（虚构的）\n- **fictional**（虚构的）\n- **conflict** 虽然拼写里有 *flict*，但词源不同（来自“打击/冲突”），不要混淆。"]}
{"word":"fictation","summary":{"en":"Dictation means spoken words written down by someone else, or the act of doing this (often as a listening exercise). It can also mean strict control.","zh":"dictation 指“口述让人记录/听写”的内容或活动；也可指“支配、控制”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Speech or text that someone dictates (speaks aloud) for another person to write or type; also the activity of doing this, often as a listening-and-writing exercise.","zh":"口授的内容；听写（说话者口述，另一人记录/输入的活动，常用于语言学习）。"},"examples":[{"en":"We did a short dictation in English class to practice spelling.","zh":"英语课上我们做了一段简短的听写来练习拼写。"},{"en":"Please slow down—this dictation is hard to keep up with.","zh":"请说慢一点——这段口授内容太难跟上了。"},{"en":"She typed the letter from his dictation.","zh":"她根据他的口述把信打了出来。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong control or influence over what happens; being able to tell others what to do (often used in the phrase “under someone’s dictation”).","zh":"支配、控制；对他人/局势的强势影响（常见于短语“under someone’s dictation”）。"},"examples":[{"en":"The small country feared living under the dictator’s dictation.","zh":"这个小国担心在独裁者的支配下生活。"},{"en":"They refused to work under anyone’s dictation and wanted more independence.","zh":"他们拒绝在任何人的支配下工作，想要更多自主。"}]}],"synonyms":["transcription (for the written result)","oral exercise (classroom context)","control","domination"],"phonetic":"/dɪkˈteɪʃən/","extraExplanation":["“fictation”不是常见英语单词，最可能是把“dictation”（听写/口述）拼错了。","拼写提示：dictation 里有 “dict-” 这一词根，和 say（说）有关，也出现在 dictate（口述；命令）、dictionary（词典）等词里。"]}
{"word":"fictil","summary":{"en":"Fictile means “able to be shaped or molded,” especially describing clay; it can also refer to a clay-made object (pottery).","zh":"Fictile 指“可塑的、可捏塑成形的”（尤用于黏土等材料）；也可作名词指陶制品等黏土制物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of clay or another material) able to be shaped or molded, especially before it hardens; plastic and workable.","zh":"（尤指黏土等材料）可塑的、可捏塑成形的；在变硬前容易加工的。"},"examples":[{"en":"Fictile clay is easiest to work with when it’s slightly damp.","zh":"可塑性好的黏土在稍微潮湿时最容易塑形。"},{"en":"Before firing, the vessel remained fictile and could still be reshaped.","zh":"烧制之前，这个容器仍然可塑，还能重新塑形。"}]},{"partOfSpeech":"n.","definition":{"en":"A fictile object, especially one made of clay (such as pottery) before firing or in general.","zh":"（尤指黏土制的）可塑物；陶制品（如陶器等）。"},"examples":[{"en":"The museum displayed small fictiles from an ancient workshop.","zh":"博物馆展出了古代作坊制作的小型陶制品。"}]}],"synonyms":["moldable","pliable","plastic","workable"],"phonetic":"/ˈfɪktaɪl/","extraExplanation":["你输入的“fictil”更常见的标准拼写是 **fictile**。它来自拉丁语 *fictilis*（与“捏塑、塑造”有关），常见于考古、艺术史或材料描述中，属于较书面/专业的词。日常英语里更常用 **moldable / pliable / plastic** 来表达相近意思。"]}
{"word":"fictile","summary":{"en":"Fictile means either “moldable/shapeable” or “made of clay; earthenware,” often used in art and archaeology contexts.","zh":"fictile 可指“可塑的、可被塑形的”，也可指“陶制的、泥土烧制的”，多见于艺术与考古语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be shaped or molded (especially clay or a material softened by heat).","zh":"可塑的；可被塑形的（尤指黏土或受热变软的材料）。"},"examples":[{"en":"Before firing, the clay is fictile and easy to form into a bowl.","zh":"在烧制之前，黏土很可塑，容易捏成碗的形状。"},{"en":"The artist prefers a fictile medium that can be reshaped many times.","zh":"这位艺术家更喜欢一种可反复重塑的可塑材料。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of clay; earthenware.","zh":"陶制的；泥土烧制的（陶器的）。"},"examples":[{"en":"The museum displayed fictile lamps from ancient Rome.","zh":"博物馆展出了古罗马的陶制油灯。"},{"en":"Archaeologists found fragments of fictile vessels near the site.","zh":"考古学家在遗址附近发现了陶器碎片。"}]}],"synonyms":["moldable","pliable","plastic","clay-made","earthenware"],"phonetic":"/ˈfɪk.taɪl/","extraExplanation":["“fictile”较为少见，多用于艺术史、考古、陶艺等语境；日常英语更常用“moldable/pliable”（可塑的）或“ceramic/earthenware”（陶器的）。","词源与拉丁语有关，含义与“塑造、捏制”相关；注意它不是“fiction”（小说、虚构）那一类词。"]}
{"word":"fictileness","summary":{"en":"Fictileness means the quality of being easily shaped—literally (like clay) or figuratively (like opinions).","zh":"Fictileness 指“容易被塑形”的性质：既可指黏土等材料的可塑性，也可比喻观点或态度容易被影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being moldable or easily shaped, especially like clay before it is fired","zh":"（尤指像未烧制的黏土那样）可塑性、易于被塑形的性质"},"examples":[{"en":"The sculptor chose wet clay for its fictileness, so she could revise the face again and again.","zh":"雕塑家选择了湿黏土，因为它很有可塑性，这样她就能一遍又一遍地修改脸部细节。"},{"en":"In early pottery lessons, students learn to control the fictileness of the clay by adding water slowly.","zh":"在初级陶艺课上，学生会学习通过慢慢加水来控制黏土的可塑性。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a tendency to be easily influenced or shaped by other people’s ideas or pressure","zh":"（比喻）容易受他人想法或压力影响、容易被“塑造”的倾向"},"examples":[{"en":"As a new employee, his opinions had a certain fictileness, changing with the loudest voice in the room.","zh":"作为新员工，他的观点有点“可塑”，常常随着屋里声音最大的人而改变。"},{"en":"Good education reduces fictileness by teaching students how to think critically.","zh":"良好的教育通过教授批判性思维来减少这种“易被塑造”的倾向。"}]}],"synonyms":["malleability","plasticity","pliability","moldability"],"phonetic":"/ˈfɪktaɪlnəs/","extraExplanation":["“fictileness”来自形容词“fictile”（可塑的、易成型的），多用于陶艺、雕塑、材料等语境；日常英语里更常见的说法是“malleability”（延展性/可塑性）或“plasticity”（可塑性）。","词根与拉丁语“fingere”（塑造、捏造）有关，所以它既能指“把黏土捏成形”，也能引申指“人的想法容易被塑造”。"]}
{"word":"fictility","summary":{"en":"Fictility means “plasticity,” the ability of a material to be molded or shaped.","zh":"Fictility 指“可塑性”，即材料能够被捏塑或成型的能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easily shaped or molded; plasticity (often used of clay or other soft materials).","zh":"（常指黏土等材料）可塑性；易于塑形的性质。"},"examples":[{"en":"Potters test a clay’s fictility before throwing it on the wheel.","zh":"陶艺师会先测试黏土的可塑性，再把它放到拉坯机上。"},{"en":"Moisture increases the fictility of the mixture, making it easier to form.","zh":"水分会提高混合物的可塑性，使其更容易成型。"}]}],"synonyms":["plasticity","malleability","pliability","workability"],"phonetic":"/fɪkˈtɪləti/","extraExplanation":["“fictility”是非常少见的词，来自拉丁语词根 *fingere*（塑造、捏造），与 *fiction*（虚构）同源，但这里指“塑形”而不是“虚构故事”。","学习时注意不要和更常见的 *futility*（徒劳、无用）混淆：两者拼写相近、意义完全不同。"]}
{"word":"fiction","summary":{"en":"Fiction means invented stories (literature) or, less commonly, something false that people believe.","zh":"fiction 指“虚构文学/小说”，也可指“被人当真但其实不真实的说法或观念”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stories or writing that are invented (not presented as true), such as novels and short stories.","zh":"虚构作品；小说（不是以真实为目的的故事或写作，如长篇小说、短篇小说）。"},"examples":[{"en":"I prefer fiction to history because I like imaginative stories.","zh":"比起历史，我更喜欢小说，因为我喜欢有想象力的故事。"},{"en":"This bookstore has a large fiction section.","zh":"这家书店有很大的小说区。"}]},{"partOfSpeech":"n.","definition":{"en":"A false idea or statement that people believe, even though it is not true.","zh":"（被人相信的）虚假观念；不真实的说法。"},"examples":[{"en":"The idea that success comes overnight is a fiction.","zh":"认为成功一夜之间就会发生，这是一种不真实的想法。"},{"en":"He insisted the rumor was pure fiction.","zh":"他坚称那个传言完全是捏造的。"}]}],"synonyms":["novels","stories","imagined writing","made-up story","falsehood (sense 2)","fabrication (sense 2)"],"phonetic":"/ˈfɪkʃən/","extraExplanation":["“Fiction”通常是不可数名词，用来指“虚构文学”这一大类：read fiction（读小说/虚构作品）。当你说“a fiction”时，更常指“一个虚构的说法/谎言/不真实的观念”。","写作和文学课里常把作品分为fiction（虚构）与nonfiction（非虚构，如传记、自传、纪实、随笔）。","常见搭配：science fiction（科幻小说）、historical fiction（历史小说）、fan fiction（同人小说）、crime fiction（犯罪小说）。"]}
{"word":"fiction-like","summary":{"en":"Fiction-like means “resembling fiction,” either in feeling (dramatic/unreal) or in style (using fiction techniques).","zh":"Fiction-like 表示“像虚构作品/小说一样”，既可指感觉上戏剧化、不真实，也可指写法上“小说化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of writing, a story, or a situation) resembling fiction—dramatic, plot-driven, or imaginative, often in a way that feels unreal or surprising","zh":"（指写作、故事或情境）像小说/虚构作品一样的——戏剧化、有情节推进或富有想象力，常带有“不真实却很精彩/离奇”的感觉"},"examples":[{"en":"The documentary is so suspenseful it feels fiction-like.","zh":"这部纪录片紧张得像小说一样。"},{"en":"Their meeting was fiction-like—too perfect to be true.","zh":"他们的相遇像小说情节一样——完美得不像真的。"},{"en":"He wrote in a fiction-like style, with vivid scenes and dialogue.","zh":"他的写作风格很“小说化”，有生动的场景和对话。"}]},{"partOfSpeech":"adj.","definition":{"en":"using techniques typical of fiction (such as character building, dialogue, and scenic detail), even in nonfiction","zh":"（尤指非虚构写作）采用小说常见写法的，如塑造人物、加入对话、描写场景细节等"},"examples":[{"en":"The biography takes a fiction-like approach to retell key events.","zh":"这本传记用较“小说化”的方式重述关键事件。"},{"en":"Some readers dislike fiction-like narration in news reports.","zh":"有些读者不喜欢新闻报道里出现“小说式”的叙述。"}]}],"synonyms":["novel-like","story-like","drama-filled","cinematic","stylized"],"phonetic":"/ˈfɪkʃənˌlaɪk/","extraExplanation":["“fiction-like”是由 fiction + like 组成的形容词，常用连字符表示复合形容词（尤其放在名词前时）：a fiction-like story。放在系动词后也常见：It feels fiction-like。","语感上它通常强调“像小说一样戏剧化/不太真实”，与更中性的“fictional（虚构的）”不同：fictional 更强调“并非真实发生”，fiction-like 更强调“风格或感觉像小说”。"]}
{"word":"fictional","summary":{"en":"“Fictional” means invented or imaginary, or related to stories that are not factual.","zh":"“fictional”指“虚构的、想象的”，也可指“与非事实的故事/小说有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not real; invented or imagined, especially in stories, films, or games.","zh":"虚构的；想象出来的（尤指故事、电影或游戏中的）。"},"examples":[{"en":"Sherlock Holmes is a fictional character created by Arthur Conan Doyle.","zh":"夏洛克·福尔摩斯是阿瑟·柯南·道尔创造的虚构人物。"},{"en":"The movie is based on a fictional world with its own rules.","zh":"这部电影基于一个有自己规则的虚构世界。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to works of fiction (stories that are not factual).","zh":"与小说/虚构作品有关的。"},"examples":[{"en":"She prefers fictional books to biographies.","zh":"比起传记，她更喜欢小说类的书。"},{"en":"The class discussed fictional narratives and how authors build tension.","zh":"课堂讨论了虚构叙事以及作者如何营造紧张感。"}]}],"synonyms":["imaginary","invented","made-up","fictitious"],"phonetic":"/ˈfɪkʃənəl/","extraExplanation":["“fictional”来自“fiction（虚构、小说）+ -al（形容词后缀）”，强调“属于虚构/想象的”。\n常见对比：fictional（虚构的）≠ factual（事实的）；fictional character（虚构人物）≠ real person（真人）。\n用法提醒：说“based on a true story（根据真实故事改编）”时，作品仍可能包含一些fictional elements（虚构元素）。"]}
{"word":"fictional character","summary":{"en":"An invented person in a story or made-up context.","zh":"故事或虚构情境中被创造出来的人物。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A person in a story (such as a novel, film, TV show, comic, or game) who is invented and not real.","zh":"（小说、电影、电视剧、漫画、游戏等中的）虚构人物；并非真实存在的人。"},"examples":[{"en":"Sherlock Holmes is a famous fictional character.","zh":"夏洛克·福尔摩斯是一个著名的虚构人物。"},{"en":"The movie is based on a fictional character from a comic book.","zh":"这部电影改编自漫画中的一个虚构人物。"}]},{"partOfSpeech":"phrase","definition":{"en":"Someone who is described or presented in a made-up way, especially in jokes, ads, or examples, rather than a real individual.","zh":"（在笑话、广告或举例中）被虚构出来的人物形象；并非具体真实个体。"},"examples":[{"en":"The brand created a fictional character to represent its product.","zh":"这个品牌创造了一个虚构人物来代表它的产品。"},{"en":"In textbooks, a fictional character is sometimes used to explain a grammar point.","zh":"在教材里，有时会用虚构人物来解释语法点。"}]}],"synonyms":["imaginary character","made-up character","fictional figure","imaginary person","story character"],"phonetic":"/ˈfɪkʃənəl ˈkærɪktɚ/","extraExplanation":["常见对比：fictional character（虚构人物） vs. real person（真人/真实人物）。如果是“由真人改编但有夸张或改动”，也可能说 loosely based on a real person（松散地基于真人）。","相关表达：main character（主角）、supporting character（配角）、character in a novel/film（小说/电影中的人物）。"],"etymology":"“fictional”来自拉丁语词根 fiction-，意为“虚构、编造”；“character”原指“刻痕/符号”，后来引申为“人物/角色”。合起来就是“虚构出来的角色/人物”。","mnemonic":["fiction ≈ “fiction（虚构）”看起来像中文“虚构”的音/形联想；fictional 就是“虚构的”。","character 可联想到“角色（jué sè）”：在故事里扮演的“人物”。两词合起来=“故事里的角色”。"]}
{"word":"fictional-style","summary":{"en":"Fictional-style describes writing or speaking that feels like fiction—story-like, vivid, and imaginative rather than strictly factual.","zh":"fictional-style 指“小说式/虚构式”的表达：像讲故事一样生动、有画面感和想象力，而不强调严格按事实呈现。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is typical of fiction (imagined stories), especially using storytelling techniques rather than strict factual reporting.","zh":"以小说/虚构作品的方式；带有叙事与想象色彩，而不是严格按事实报道的方式。"},"examples":[{"en":"The article is written in a fictional-style, with scenes and dialogue that make it feel like a short story.","zh":"这篇文章用虚构式写法来写，有场景和对话，让人感觉像一篇短篇小说。"},{"en":"She described the city in a fictional-style, turning ordinary streets into something magical.","zh":"她用虚构式的笔法描写这座城市，把普通的街道写得充满魔力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the characteristics of fictional writing (e.g., vivid characters, dramatic scenes, a narrative voice).","zh":"具有小说/虚构写作特征的（如人物鲜明、场景戏剧化、叙述口吻明显）。"},"examples":[{"en":"The podcast has a fictional-style opening, as if the host is narrating a mystery novel.","zh":"这个播客的开场很“小说式”，仿佛主持人在讲一部推理小说。"},{"en":"His fictional-style descriptions made the biography feel more like literature than a textbook.","zh":"他那种小说式的描写让这本传记读起来更像文学作品，而不像教科书。"}]}],"synonyms":["story-like","novelistic","narrative","dramatic","cinematic"],"phonetic":"/ˈfɪkʃənəl staɪl/","extraExplanation":["“fictional-style”常见于写作/评论语境，用来强调：内容可能基于事实，但表达方式借用了小说技巧（如镜头感场景、内心独白、悬念、对白等）。在新闻或学术写作里，若使用这种风格，通常需要注意不要让读者误以为细节都是可核实的事实。"]}
{"word":"fictionality","summary":{"en":"Fictionality means the quality (or degree) of being fictional, especially discussed in literature and media.","zh":"Fictionality 指“虚构性”，即某事物是虚构的这种性质或程度，常用于文学与媒体讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being fictional; the fact that something is invented rather than real","zh":"虚构性；虚构的状态（指某事物是编造的而非真实发生的）"},"examples":[{"en":"The novel’s fictionality is clear from its impossible events and talking animals.","zh":"这部小说的虚构性很明显，因为里面有不可能发生的事件和会说话的动物。"},{"en":"Readers can enjoy a story even when they fully recognize its fictionality.","zh":"即使读者完全意识到故事的虚构性，他们仍然可以享受阅读。"}]},{"partOfSpeech":"n.","definition":{"en":"(in literary studies) the degree to which a text signals that it is a constructed story, not a factual report","zh":"（文学研究中）文本“表明自己是被建构的故事而非事实报道”的程度"},"examples":[{"en":"The author plays with fictionality by having the narrator admit that some scenes were invented.","zh":"作者让叙述者承认某些场景是编造的，从而在“虚构性”上做文章。"},{"en":"Meta-fiction often increases the sense of fictionality by reminding you that you are reading a book.","zh":"元小说常常通过提醒你“你在读一本书”来增强虚构性的感觉。"}]}],"synonyms":["fictionalness","inventedness","imaginariness"],"phonetic":"/fɪkˈʃænəˌlɪti/","extraExplanation":["“fictionality”在日常英语里不算常用，更常见的是“fiction”（小说/虚构作品）或“fictional”（虚构的）。它多出现在文学批评、叙事学、媒体研究等语境中，用来讨论作品如何让读者意识到“这是故事”。","相关对比：\n- fictionality（虚构性：一种性质/程度）\n- fiction（虚构作品/虚构内容：作品或内容本身）\n- fictionality vs. factuality（虚构性 vs. 事实性）","常见搭配：the fictionality of the story/text（故事/文本的虚构性）；a high/low degree of fictionality（虚构性程度高/低）；signal/mark fictionality（显示/标记虚构性）。"]}
{"word":"fictionalization","summary":{"en":"Fictionalization means changing real life into fiction, or a work that does this.","zh":"fictionalization 指把真实内容小说化改编的过程，或指这种改编作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of turning real events, people, or facts into a fictional story (often by adding imagined scenes, dialogue, or details).","zh":"把真实事件、人物或事实改编成虚构故事的行为或过程（常通过加入想象的情节、对话或细节）。"},"examples":[{"en":"The movie is a fictionalization of the athlete’s early life.","zh":"这部电影是对那位运动员早年生活的小说化改编。"},{"en":"Some readers enjoyed the fictionalization, but others wanted a more factual account.","zh":"一些读者喜欢这种小说化处理，但也有人更想要更真实的记述。"}]},{"partOfSpeech":"n.","definition":{"en":"A work (book, film, etc.) that retells real events in a fictional way.","zh":"以虚构方式重述真实事件的作品（如书、电影等）。"},"examples":[{"en":"Her latest novel is a fictionalization of a famous court case.","zh":"她的新小说是对一起著名法庭案件的小说化再创作。"},{"en":"The documentary includes scenes from a fictionalization to help viewers imagine the past.","zh":"这部纪录片加入了改编的虚构场景，帮助观众想象过去。"}]}],"synonyms":["dramatization","novelization","adaptation","creative retelling"],"phonetic":"/ˌfɪkʃənələˈzeɪʃən/","extraExplanation":["“fictionalization”常见于出版、影视与新闻讨论中，强调“基于真实但进行了艺术加工”。如果作者或作品没有清楚说明哪些部分是虚构的，可能会引发关于真实性、误导性与伦理的争议。","与之相近但更中性的词是“dramatization”（戏剧化再现），通常指为了更有戏剧效果而改写呈现；而“fabrication”更偏负面，指捏造不存在的事实。"]}
{"word":"fictionalize","summary":{"en":"“Fictionalize” means to turn real events or facts into a fictional story by adding imagined details.","zh":"“fictionalize”指把真实事件或事实加入虚构元素进行改编，使其成为虚构故事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn real events or facts into a story by adding imagined details; to make something fictional","zh":"把真实事件或事实改编成故事，加入虚构情节；使之小说化/虚构化"},"examples":[{"en":"The director fictionalized the true story to make the plot more dramatic.","zh":"导演把真实故事小说化了，让情节更戏剧化。"},{"en":"Many novels fictionalize history, mixing real people with invented characters.","zh":"很多小说会将历史小说化，把真实人物与虚构角色混在一起。"}]},{"partOfSpeech":"vt.","definition":{"en":"to present something as fiction (for example, for privacy or legal reasons)","zh":"把某事以“虚构作品”的方式呈现（例如为保护隐私或出于法律原因）"},"examples":[{"en":"She fictionalized parts of her memoir to protect her family’s privacy.","zh":"她把回忆录中的一些部分虚构化，以保护家人的隐私。"}]}],"synonyms":["dramatize","novelize","fictionize","adapt"],"phonetic":"/ˈfɪkʃənəˌlaɪz/","extraExplanation":["“fictionalize”常用于改编：把新闻、传记、历史事件变成小说、电影或电视剧的叙事。它不一定表示“完全捏造”，更多是“在真实基础上加工”。","拼写上美式英语常用 -ize（fictionalize），英式英语也常见 -ise（fictionalise）。"]}
{"word":"fictionalized","summary":{"en":"Fictionalized means real events are retold as a story with added or changed details.","zh":"fictionalized 指把真实事件以故事方式改写，加入或改动细节。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changed from real events or facts into a story form by adding or altering details (while often keeping the main idea true).","zh":"把真实事件或事实改写成更像故事的形式（通常保留主线，但会增添或改动细节）。"},"examples":[{"en":"The movie is fictionalized, so some characters and scenes didn’t happen exactly that way.","zh":"这部电影是“虚构化”的，所以有些人物和场景并不是完全那样发生的。"},{"en":"She wrote a fictionalized account of her childhood to protect her family’s privacy.","zh":"她把童年经历写成了虚构化的版本，以保护家人的隐私。"}]},{"partOfSpeech":"adj.","definition":{"en":"Written or presented as fiction rather than as strict history, journalism, or documentary.","zh":"以小说/虚构作品的方式呈现，而不是严格的历史、新闻或纪录片。"},"examples":[{"en":"It’s a fictionalized biography, not an academic history book.","zh":"这是一部虚构化的传记，不是学术历史著作。"},{"en":"The podcast uses fictionalized dialogue to make the story easier to follow.","zh":"这个播客用虚构化的对话让故事更容易理解。"}]}],"synonyms":["dramatized","novelized","adapted","embellished"],"phonetic":"/ˈfɪkʃənəˌlaɪzd/","extraExplanation":["“fictionalized”来自动词“fictionalize”（把……虚构化/小说化）。常见搭配：fictionalized version（虚构化版本）、fictionalized account（虚构化叙述）、fictionalized biography（虚构化传记）。","语感提示：它通常暗示“有真实基础但不完全真实”。如果你想强调“完全虚构”，更常用“fictional”；想强调“基于真实”，可用“based on a true story / dramatized”。"]}
{"word":"fictionalizes","summary":{"en":"“Fictionalizes” means ‘makes something more like fiction,’ often by inventing or changing details for storytelling.","zh":"“fictionalizes”意为“把……小说化”，常指为叙事效果而虚构或改动细节。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a story, event, or person more like fiction by adding invented details or changing facts (often for storytelling)","zh":"将故事、事件或人物“小说化”：加入虚构细节或改动事实（多用于增强叙事效果）"},"examples":[{"en":"The film fictionalizes parts of the author’s childhood to create a stronger plot.","zh":"这部电影把作者童年的一些部分小说化，以形成更强的剧情。"},{"en":"The book fictionalizes real historical figures, so some scenes didn’t happen exactly that way.","zh":"这本书把真实的历史人物小说化了，所以有些情节并非完全按史实发生。"}]},{"partOfSpeech":"v.","definition":{"en":"to present something in a way that feels like a novel—more dramatic, simplified, or emotionally shaped—even if it is based on real life","zh":"把真实内容处理得像小说一样：更戏剧化、简化或更强调情绪表达，即使素材源于现实"},"examples":[{"en":"News reports sometimes fictionalize complex events by turning them into a simple hero-versus-villain story.","zh":"新闻报道有时会把复杂事件“小说化”，把它讲成简单的英雄对反派的故事。"},{"en":"He worries that the memoir fictionalizes his family and makes them seem unreal.","zh":"他担心这本回忆录把他的家人写得过于小说化，显得不真实。"}]}],"synonyms":["fictionalize","dramatize","embellish","romanticize"],"phonetic":"/ˈfɪkʃənəˌlaɪzɪz/","extraExplanation":["“fictionalizes”是动词“fictionalize”的第三人称单数（he/she/it fictionalizes）。常见搭配：fictionalize a story/event/character；be (heavily/loosely) fictionalized（被大量/较为宽泛地小说化）。","语气提示：fictionalize通常是中性或偏批评的词，暗示“与事实有出入”。如果只是“用小说写作手法改编”但不强调真假冲突，也可说“novelize”（把故事写成小说）或“dramatize”（戏剧化处理）。"]}
{"word":"fictionalizing","summary":{"en":"“Fictionalizing” means turning real people/events into a more fictional story by adding or changing details.","zh":"“fictionalizing”指把真实人物/事件进行小说化处理，通过添加或改变细节来更像虚构故事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making a real story, person, or event more like fiction by adding invented details or changing facts (often in writing or film).","zh":"（常用于写作或影视）把真实的故事、人物或事件“小说化”，加入虚构细节或改动事实。"},"examples":[{"en":"The movie is fictionalizing the scientist’s life to make the plot more dramatic.","zh":"这部电影正在把那位科学家的生平小说化，让剧情更戏剧化。"},{"en":"She worried that the article was fictionalizing the accident instead of reporting it accurately.","zh":"她担心那篇文章是在把事故小说化，而不是准确报道。"}]},{"partOfSpeech":"v.","definition":{"en":"creating or presenting something as fictional; inventing a fictional version of something.","zh":"把某事当作虚构来创作或呈现；编造出一个虚构版本。"},"examples":[{"en":"He is fictionalizing his childhood into a series of short stories.","zh":"他正把自己的童年虚构化，写成一系列短篇小说。"},{"en":"The author avoids fictionalizing real victims’ names out of respect.","zh":"出于尊重，作者避免把真实受害者的姓名拿来进行虚构化处理。"}]}],"synonyms":["dramatizing","romanticizing","embellishing","inventing","making up"],"phonetic":"/ˈfɪkʃənəˌlaɪzɪŋ/","extraExplanation":["“fictionalizing”来自动词“fictionalize”。写作讨论中常用于提示：作品对事实做了艺术加工（creative liberties），因此不应当被当作严格的历史或新闻来理解。","英式英语更常见拼写“fictionalising”，美式英语常用“fictionalizing”。"]}
{"word":"fictionally","summary":{"en":"“Fictionally” means “in a fictional way” or “within an invented story, not as a fact.”","zh":"“fictionally”表示“以虚构的方式”或“在虚构故事设定中（并非事实）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that belongs to or is true within a story that is invented (not real); as part of fiction.","zh":"以虚构的方式；在（虚构的）故事世界里成立、发生的。"},"examples":[{"en":"The film is based on a real event, but many scenes are fictionally recreated.","zh":"这部电影取材于真实事件，但许多场景是以虚构方式再现的。"},{"en":"Fictionally, the city is located on an island, even though the real city is inland.","zh":"在虚构设定中，这座城市位于一座岛上，尽管现实中的城市在内陆。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is not factual; imaginatively rather than accurately.","zh":"非事实地；想象性地（而非准确地）叙述或描述。"},"examples":[{"en":"The article describes the conversation fictionally, adding details that were never confirmed.","zh":"这篇文章以非事实的方式描写了那次对话，加入了从未被证实的细节。"},{"en":"He fictionally portrays himself as a hero online.","zh":"他在网上把自己虚构成英雄形象。"}]}],"synonyms":["in fiction","in a fictional way","imaginarily","not factually","inventively"],"phonetic":"/ˈfɪkʃənəli/","extraExplanation":["“fictionally”常见于评论、研究或写作讨论中，用来强调“在虚构作品内部（in the fiction）”或“并非依据事实”。日常口语更常用“in the story / in the novel / in fiction”。","与“fictional”不同：fictional是形容词（a fictional character 虚构人物）；fictionally是副词，修饰动词/整句（The character is fictionally based on… 在虚构层面上以……为原型）。"]}
{"word":"fictionary","summary":{"en":"“Fictionary” is a nonstandard, playful word meaning a fictional or invented dictionary; it is also sometimes a typo for “dictionary.”","zh":"“fictionary”是一个非标准的玩笑式用词，指“虚构/编造的词典”；也常见作“dictionary”的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a playful, nonstandard word meaning a “fictional dictionary” or a dictionary made up of invented (made-up) entries","zh":"一个带玩笑性质的非标准词，指“虚构的词典/虚拟词典”，也可指由作者编造词条组成的词典"},"examples":[{"en":"The website is a fic·tion·ar·y full of invented words and funny definitions.","zh":"这个网站像一本“虚构词典”，里面都是编造的词和搞笑的释义。"},{"en":"In the novel, the author adds a short fictionary at the end to explain the made-up terms.","zh":"在小说里，作者在结尾加了一小段“虚构词典”，用来解释自创术语。"}]},{"partOfSpeech":"other","definition":{"en":"a misspelling of “dictionary” (common in typing)","zh":"“dictionary”的常见拼写/输入错误"},"examples":[{"en":"Did you mean “dictionary” instead of “fictionary”?","zh":"你想写的是“dictionary”而不是“fictionary”吗？"}]}],"synonyms":["fictional dictionary","invented lexicon","mock dictionary"],"phonetic":"/ˈfɪkʃəˌnɛri/","extraExplanation":["“fictionary”常被看作是 fiction + dictionary 的混成词（portmanteau），带有创意、幽默或实验写作的感觉，因此在正式写作里通常不建议使用，除非你刻意要这种风格。","如果你的意思是“词典”，标准拼写是 dictionary；如果你的意思是“虚构/小说”，常用词是 fiction（不可数名词）或 a work of fiction（可数表达）。"]}
{"word":"fictioneer","summary":{"en":"A fictioneer is a person who writes or creates fiction (a somewhat old-fashioned term).","zh":"fictioneer 指写作或创作小说等虚构作品的人（较老派的说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a writer or creator of fiction; a novelist or storyteller (often a slightly old-fashioned or playful word).","zh":"虚构作品的作者；小说家／讲故事的人（常带一点老派或戏谑色彩）。"},"examples":[{"en":"She started as a journalist but later became a respected fictioneer.","zh":"她一开始是记者，后来成了一位受人尊敬的小说家。"},{"en":"As a fictioneer, he builds believable characters from everyday life.","zh":"作为一名虚构作品作者，他从日常生活中塑造出可信的人物。"}]}],"synonyms":["novelist","fiction writer","storyteller","author"],"phonetic":"/fɪkˌʃəˈnɪr/","extraExplanation":["“fictioneer”由 fiction（虚构、小说）+ -eer（表示从事某种职业或活动的人，如 engineer）构成，但在现代英语里不算常用，更多见于较旧的文本、评论或带点幽默的语境。","语感上，“fiction writer / novelist”更中性、常见；“fictioneer”可能带有“会编故事的人”的轻微调侃意味，使用时注意场合。"]}
{"word":"fictioneering","summary":{"en":"Fictioneering means strategically inventing or spinning stories, often to persuade or mislead.","zh":"Fictioneering 指带策略性地编造/包装故事，常用于劝服或误导他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of inventing or spinning stories—often in a strategic, persuasive, or propaganda-like way—to influence how people think about events","zh":"（为影响他人看法而）编造、包装故事的行为；常带有策略性或宣传色彩"},"examples":[{"en":"The report criticized the campaign’s fictioneering about the economy.","zh":"这份报告批评该竞选团队在经济问题上的“编故事式”宣传。"},{"en":"People grew tired of the fictioneering and asked for simple facts.","zh":"人们厌倦了那些包装出来的说法，开始要求直接的事实。"}]},{"partOfSpeech":"v.","definition":{"en":"inventing or shaping a narrative (especially for effect), rather than describing events accurately","zh":"（为了效果而）编造或塑造叙事，而不是如实描述事情"},"examples":[{"en":"He was fictioneering in the meeting, turning a small mistake into a heroic struggle.","zh":"他在会议上在“编叙事”，把一个小失误说成了英勇奋斗。"},{"en":"It’s easy to start fictioneering when the real story feels too messy.","zh":"当真实故事显得太复杂时，人很容易开始“编叙事”。"}]}],"synonyms":["spin","fabrication","inventing","story-spinning","propaganda"],"phonetic":"/ˌfɪkʃəˈnɪrɪŋ/","extraExplanation":["“fictioneering”通常带有批评意味：不是单纯“写小说”，而是把虚构当作一种手段，用来操控印象、制造合理化解释或推动某种立场。","词形上可理解为 fiction（虚构）+ engineering（工程/操控），暗示“把故事像工程一样设计出来”。常见于政治评论、媒体批评、公关语境。","在正式写作中，这个词较少见；更常见的近义表达有 spin（带倾向的解读/话术）、fabrication（捏造）、storytelling（叙事/讲故事，偏中性或褒义）。"]}
{"word":"fictioner","summary":{"en":"Fictioner is a rare noun meaning a fiction writer, or someone who makes up stories (sometimes implying lying).","zh":"fictioner 是个罕见名词，指小说作者，或编造故事/编造事实的人（有时带“说谎”含义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes fiction; a fiction writer (rare).","zh":"（罕用）小说作者；虚构作品的写作者。"},"examples":[{"en":"She started as a poet but later became a well-known fictioner.","zh":"她最初写诗，后来成了一位知名的小说作者。"},{"en":"The magazine is looking for new fictioners to submit short stories.","zh":"这家杂志正在寻找新的小说作者投稿短篇故事。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who invents stories or makes things up; a storyteller or (in older use) someone who lies.","zh":"编故事的人；虚构事实的人；（旧用）说谎者。"},"examples":[{"en":"Don’t be a fictioner—tell us what really happened.","zh":"别编了——把真实发生的事告诉我们。"},{"en":"In folktales, the fictioner shapes ordinary life into something magical.","zh":"在民间故事里，讲故事的人把平凡生活塑造成神奇的世界。"}]}],"synonyms":["fiction writer","novelist","storyteller","fabricator"],"phonetic":"/ˈfɪkʃənər/","extraExplanation":["“fictioner”在现代英语中非常少见；更常用的说法是“fiction writer”“novelist（小说家）”“short-story writer（短篇小说作者）”。","词形来自“fiction（虚构/小说）+ -er（做某事的人）”。在一些较旧或带批评意味的语境里，它也可指“编造事实的人”，接近“inventor”或“liar”。"]}
{"word":"fictionisation","summary":{"en":"Fictionisation means turning real facts or events into a fictional story, or the fictionalized version that results.","zh":"fictionisation 指把真实事实/事件虚构化改写成故事的过程，或改写后的虚构化版本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of turning real events or facts into a fictional story (often by adding imagined details)","zh":"（把真实事件或事实）改写成小说/虚构故事的过程；虚构化"},"examples":[{"en":"The film is a fictionisation of a true crime case.","zh":"这部电影是对一起真实罪案的虚构化改编。"},{"en":"Some readers disliked the fictionisation of history in the novel.","zh":"一些读者不喜欢这部小说对历史的虚构化处理。"}]},{"partOfSpeech":"n.","definition":{"en":"a fictionalized version of something real; the resulting story or depiction","zh":"（对真实内容的）虚构化版本；改编后的虚构作品/呈现"},"examples":[{"en":"Her memoir later inspired a fictionisation for television.","zh":"她的回忆录后来启发了一个电视虚构化改编版本。"},{"en":"This is a gentle fictionisation, not a strict documentary account.","zh":"这是一种较温和的虚构化呈现，并非严格的纪录片式叙述。"}]}],"synonyms":["fictionalization","dramatization","novelization","embellishment"],"phonetic":"/ˌfɪkʃənəˈzeɪʃən/","extraExplanation":["“fictionisation”更常见于英式拼写；美式拼写通常是“fictionization”。两者意思相同。","这个词常用于评论影视/小说对真实人物、案件或历史的“改编程度”，暗含“并非完全忠于事实”的意味，语气可中性也可带批评。"]}
{"word":"fictionise","summary":{"en":"Fictionise means to make something into fiction by adding invented details.","zh":"Fictionise 指把真实材料加入虚构细节进行改写，使其小说化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn real events or facts into a story by adding invented details; to fictionalize","zh":"把真实事件或事实改写成故事，加入虚构细节；使小说化"},"examples":[{"en":"The director fictionised the historical trial to make the plot more dramatic.","zh":"导演把那场历史审判小说化，以让剧情更戏剧化。"},{"en":"Some memoirs are heavily fictionised, so readers should be careful about what is fact.","zh":"有些回忆录被大量小说化，所以读者要谨慎分辨哪些是事实。"},{"en":"She fictionised her childhood experiences into a short novel.","zh":"她把童年经历小说化，写成了一部短篇小说。"}]}],"synonyms":["fictionalize","dramatize","novelize","romanticize"],"phonetic":"/ˈfɪkʃəˌnaɪz/","extraExplanation":["“fictionise”常见于英式拼写；美式更常用“fictionalize”。两者意思相同，只是拼写习惯不同。","这个词在写作与影视领域常用于讨论“基于真实事件改编”的作品：它暗示加入了创作与虚构成分，因此不等同于“accurately record（如实记录）”。","相关表达：based on a true story（根据真实故事改编）、take artistic liberties（进行艺术加工/自由改编）、dramatize（戏剧化处理）。"]}
{"word":"fictionised","summary":{"en":"Fictionised means changed into a fictional story, often based on real events but with invented or altered details.","zh":"fictionised 指“被小说化的”：通常以真实事件为基础，但加入虚构或改动的细节。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(BrE spelling) Made into fiction; turned from real events or facts into a story with imagined or changed details.","zh":"（英式拼写）被小说化的；把真实事件或事实改写成带有虚构或改动细节的故事。"},"examples":[{"en":"The film is a fictionised version of the author’s childhood.","zh":"这部电影是作者童年经历的小说化版本。"},{"en":"Some names were changed because the account was fictionised for privacy.","zh":"为了保护隐私，一些名字在小说化改写时被改掉了。"},{"en":"It’s based on real history, but parts are clearly fictionised.","zh":"它基于真实历史，但有些部分明显经过小说化处理。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “fictionise” (to turn facts or real events into fiction).","zh":"“fictionise”的过去式/过去分词：把事实或真实事件小说化（改写成虚构作品）。"},"examples":[{"en":"The writer fictionised the court case to create a more dramatic plot.","zh":"作者把那起庭审案件小说化处理，以写出更戏剧性的情节。"},{"en":"The biography was heavily fictionised, so it shouldn’t be treated as a reliable source.","zh":"这本传记被大量小说化改写，因此不应被当作可靠来源。"}]}],"synonyms":["fictionalized","dramatized","novelized","romanticized"],"phonetic":"/ˈfɪkʃəˌnaɪzd/","extraExplanation":["“fictionised”是英式拼写；美式更常见写法是“fictionized”。两者意思相同。","“fictionised”常用于说明作品“以真实为基础但做了艺术加工”，尤其在电影、小说、传记改编、历史题材中常见。"]}
{"word":"fictionising","summary":{"en":"Fictionising means turning real life or facts into a story by adding invented details; it can also mean creating fiction in general (less common).","zh":"fictionising 指把真实生活或事实通过加入虚构细节改写成故事；也可指进行虚构创作（较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"turning real events, people, or facts into a story by adding invented details; dramatizing or embellishing reality","zh":"把真实事件/人物/事实改写成故事，加入虚构细节；将现实戏剧化、文学化"},"examples":[{"en":"The film is fictionising a true court case to make the plot more dramatic.","zh":"这部电影把一桩真实的庭审案件进行了虚构化处理，让情节更戏剧化。"},{"en":"When writing memoir, be careful that you’re not fictionising other people’s lives without permission.","zh":"写回忆录时要小心，不要在未经允许的情况下把别人的人生“虚构化”。"},{"en":"Some headlines end up fictionising the science, which misleads readers.","zh":"有些标题会把科学结论“故事化/夸张化”，从而误导读者。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) writing or presenting something as fiction; producing fiction","zh":"（较少见）以虚构作品的方式写作或呈现；创作小说/虚构文本"},"examples":[{"en":"She is fictionising again after years of academic writing.","zh":"她在多年学术写作之后又开始进行虚构创作了。"},{"en":"The workshop focuses on fictionising everyday experiences into short stories.","zh":"这个工作坊重点教你把日常经验虚构化，写成短篇故事。"}]}],"synonyms":["fictionalizing","dramatizing","embellishing","romanticizing","novelizing"],"phonetic":"/ˈfɪkʃəˌnaɪzɪŋ/","extraExplanation":["“fictionising”来自动词 fictionise（英式拼写），美式更常写作 fictionize / fictionizing。两者意思相同。","在新闻、传记、纪录片语境里，fictionising 常带一点批评意味：指为了好看或好卖而“加戏”、模糊事实与虚构的边界。"]}
{"word":"fictionist","summary":{"en":"“Fictionist” means a person who writes fiction.","zh":"“fictionist”指写虚构文学作品的人（较少见说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes fiction; a fiction writer (similar to a novelist or short-story writer).","zh":"写虚构文学的人；小说家／虚构作品作者。"},"examples":[{"en":"She is a fictionist who specializes in psychological thrillers.","zh":"她是一位专写心理惊悚题材的虚构作品作者。"},{"en":"Many fictionists start with short stories before attempting a novel.","zh":"许多写小说的人会先从短篇小说开始，再尝试长篇。"}]}],"synonyms":["novelist","fiction writer","storyteller","author"],"phonetic":"/ˈfɪkʃənɪst/","extraExplanation":["“fictionist”在现代英语中相对少见，日常更常用“novelist”（小说家）、“fiction writer”（虚构文学作者）或“author”（作者）。在正式写作里，用更常见的词通常更自然、更地道。"]}
{"word":"fictionistic","summary":{"en":"“Fictionistic” means fiction-like or characteristic of fiction, often suggesting a story-like, not strictly factual style.","zh":"“fictionistic”指“像小说/虚构作品一样的”，常暗示叙述很故事化、未必完全符合事实。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or characteristic of fiction; having a story-like (not strictly factual) quality.","zh":"与小说/虚构作品有关的；像虚构故事一样的；带有不完全真实、偏故事化色彩的。"},"examples":[{"en":"The article had a fictionistic tone, full of dramatic scenes and dialogue.","zh":"这篇文章带有一种“小说化”的语气，充满戏剧化的场景和对白。"},{"en":"His description felt fictionistic, as if it came from a novel rather than real life.","zh":"他的描述让人觉得很“小说化”，仿佛来自小说而不是真实生活。"}]}],"synonyms":["fictional","novelistic","story-like","made-up"],"phonetic":"/ˌfɪkʃəˈnɪstɪk/","extraExplanation":["“fictionistic”不是非常常见的英语词，更常用的表达是“fictional”（虚构的）、“novelistic”（小说般的/具有小说风格的）、“story-like”（像故事一样的）。","在学术或评论语境里，“novelistic”常用来形容写作手法（如细节铺陈、人物塑造、叙事节奏）很像小说；而“fictional”更直接表示“并非真实”。"]}
{"word":"fictionization","summary":{"en":"Fictionization is the process of turning real life into fiction by altering or inventing details.","zh":"Fictionization 指把真实素材通过改动或虚构细节改写成虚构作品的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of turning real events or people into a fictional story, often by adding, changing, or inventing details","zh":"把真实事件或人物改写成虚构故事的行为或过程，常通过添加、改动或虚构细节来实现"},"examples":[{"en":"The film is a fictionization of a true crime case, so some details were changed.","zh":"这部电影是对一起真实刑案的“虚构化”改编，所以一些细节被改动了。"},{"en":"Readers should remember that fictionization can blur the line between fact and imagination.","zh":"读者要记住，虚构化可能会模糊事实与想象之间的界线。"},{"en":"Her memoir includes a light fictionization of conversations she can’t fully recall.","zh":"她的回忆录对一些记不清的对话做了轻微的虚构化处理。"}]}],"synonyms":["fictionalization","dramatization","novelization"],"phonetic":"/ˌfɪkʃənəˈzeɪʃən/","extraExplanation":["“fictionization”在英语里相对少见，更常见的说法是“fictionalization”。两者意思基本相同，都是“把真实素材写成小说/影视叙事”的过程。","在新闻与纪实写作语境中，这个词常带有提醒意味：经过虚构化的作品不应被当作纯事实记录；在文学、影视改编语境中则更中性，强调创作手法。","常见相关表达：“a fictionalized account”（虚构化的叙述/版本）、“based on a true story”（基于真实故事，但不保证细节完全真实）。"]}
{"word":"fictionize","summary":{"en":"“Fictionize” means to make something into fiction by altering or adding details.","zh":"“fictionize”指把真实内容小说化：加入虚构细节或改动事实来写成故事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn real events, people, or information into fiction by adding imagined details or changing facts for a story","zh":"把真实事件、人物或信息“小说化”，为叙事加入想象细节或改动事实"},"examples":[{"en":"The director fictionized the athlete’s life to make the plot more dramatic.","zh":"导演把这位运动员的人生小说化，让情节更戏剧化。"},{"en":"Some historians worry that the film fictionizes the war and misleads viewers.","zh":"一些历史学者担心这部电影把战争小说化，会误导观众。"}]}],"synonyms":["fictionalize","dramatize","novelize"],"phonetic":"/ˈfɪkʃəˌnaɪz/","extraExplanation":["“fictionize”在日常英语里不算常见，更常见的表达是“fictionalize”。两者意思非常接近：把真实材料改写成小说/影视故事。","它常用于讨论传记电影（biopic）、历史剧、改编作品：当作品为了戏剧性而改变事实时，就可能被说成“fictionize”了某段历史。","写作上可与“dramatize（戏剧化）”“romanticize（浪漫化、美化）”对比：前者强调戏剧呈现，后者强调美化或理想化，而“fictionize”强调把事实改成虚构叙事。"]}
{"word":"fictionized","summary":{"en":"Fictionized means made into a fictional version of real events, or the act of turning real events into fiction.","zh":"fictionized 指把真实事件“小说化”，或指将真实事件改编成虚构故事的行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changed from real events or facts into a story with invented details; made more like fiction.","zh":"把真实事件或事实改编成带虚构细节的故事；被“小说化”的。"},"examples":[{"en":"The movie is fictionized, but it is based on a true story.","zh":"这部电影经过小说化处理，但仍取材于真实故事。"},{"en":"Her memoir was criticized for being too fictionized.","zh":"她的回忆录因过度小说化而受到批评。"}]},{"partOfSpeech":"v.","definition":{"en":"To change real events into a fictional story; to add imagined characters or scenes.","zh":"把真实事件改写成虚构故事；加入想象的人物或情节。"},"examples":[{"en":"The author fictionized the court case to protect people’s privacy.","zh":"作者将那起法院案件小说化，以保护当事人的隐私。"},{"en":"Many historical dramas fictionize timelines for dramatic effect.","zh":"许多历史剧会为戏剧效果而小说化时间线。"}]}],"synonyms":["fictionalized","dramatized","novelized","romanticized"],"phonetic":"/ˈfɪkʃəˌnaɪzd/","extraExplanation":["“fictionized”常见于出版、影视、新闻评论等语境，表示“基于真实但经过改编”。它往往暗示：作品可能更好看，但真实性会降低。","学习提示：更常见的表达是“fictionalized / fictionalised”（英式拼法），日常英语里“fictionized”相对少见。"]}
{"word":"fictionizing","summary":{"en":"Fictionizing means turning real material into fiction or adding invented details so it feels like a made-up story.","zh":"fictionizing 指把真实素材小说化，或添加编造细节让内容更像虚构故事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of fictionize) Turning real events or information into a fictional story, often by adding invented characters, scenes, or details.","zh":"（fictionize 的现在分词）把真实事件或资料改写成小说/虚构故事，常通过加入虚构人物、情节或细节。"},"examples":[{"en":"The film is fictionizing a true historical事件, so some scenes are imagined.","zh":"这部电影把一段真实历史进行了小说化处理，所以有些场景是虚构的。"},{"en":"When fictionizing her family history, she changed names to protect privacy.","zh":"在把家族史小说化时，她改了名字以保护隐私。"},{"en":"He was criticized for fictionizing news reports and confusing readers about what was factual.","zh":"他因把新闻报道“小说化”、让读者分不清事实而受到批评。"}]},{"partOfSpeech":"v.","definition":{"en":"Inventing or exaggerating details so that something sounds like fiction rather than strict fact.","zh":"编造或夸大细节，让内容听起来更像虚构而非严格事实。"},"examples":[{"en":"Stop fictionizing the story—just tell me what actually happened.","zh":"别再把故事编得像小说了——直接告诉我到底发生了什么。"},{"en":"He has a habit of fictionizing small problems into dramatic disasters.","zh":"他习惯把小问题编得像戏剧性的大灾难。"}]}],"synonyms":["fictionalizing","dramatizing","embellishing","romanticizing"],"phonetic":"/ˈfɪkʃəˌnaɪzɪŋ/","extraExplanation":["“fictionize”在日常口语里不算高频，更常见的表达有：“turn … into a novel / dramatize / embellish”。“fictionizing”多见于评论、写作、影视改编讨论中。","注意区分：fictionizing（小说化/虚构化处理）不等于 lying（撒谎）。前者常用于艺术改编或叙事加工；后者强调有意欺骗。"]}
{"word":"fictionkin","summary":{"en":"“Fictionkin” is an internet/fandom term for someone who strongly identifies with or feels deeply connected to a fictional character.","zh":"“fictionkin”是网络/同人圈用语，指与某个虚构角色有强烈认同或深度连结的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who feels a strong personal connection to a fictional character (or sometimes a fictional species/group), sometimes describing it as part of their identity in fandom/online communities.","zh":"（网络/同人圈用语）指对某个虚构角色（有时也指虚构种族/群体）有强烈个人连结的人；有些人会把这种连结描述为自我认同的一部分。"},"examples":[{"en":"She says she’s fictionkin with a character from an anime, so she relates to their personality a lot.","zh":"她说自己是某部动漫角色的 fictionkin，所以她很能共鸣那个角色的性格。"},{"en":"In that server, people share their fictionkin experiences and talk about coping strategies.","zh":"在那个群组里，大家会分享 fictionkin 的感受，也会聊一些调适方法。"},{"en":"I’m not fictionkin, but I understand why the character matters to you.","zh":"我不是 fictionkin，但我能理解那个角色为什么对你很重要。"}]}],"synonyms":["kin (slang)","otherkin (related term)","strongly identify with (phrase)","relate to (phrase)"],"phonetic":"ˈfɪkʃənˌkɪn","extraExplanation":["“fictionkin”常见于英文网络社群（如Tumblr、Discord等）。其中“kin”来自“kindred（同类/亲缘）”的概念延伸，圈内也常用动词“kin/kinning”表示“与某角色产生强烈认同/代入”。","它通常是一种自我表达或社群身份标签，不等同于临床诊断；不同社群对其含义与边界也可能有差异。交流时尊重对方的自我称呼、避免嘲讽或强行贴标签，会更合适。","相关用语：otherkin（更广义的“kin”概念，常指非人类/神话等身份认同）、kin list（自己认同的角色列表）、comfort character（带来安慰的角色；不一定是fictionkin）。"]}
{"word":"fictionmonger","summary":{"en":"A person who spreads or peddles invented stories, often with a negative sense.","zh":"散播或兜售虚构故事的人，常含贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who invents, sells, or spreads fictional stories—often implying that the stories are misleading or untrustworthy.","zh":"编造、兜售或散播虚构故事的人（常带贬义，暗示内容不可信或误导）。"},"examples":[{"en":"The reporter denied being a fictionmonger and pointed to official documents.","zh":"那名记者否认自己是在散布虚构消息，并拿出了官方文件。"},{"en":"Online, it’s easy for a fictionmonger to turn rumors into “news.”","zh":"在网上，造谣者很容易把谣言包装成“新闻”。"}]}],"synonyms":["rumormonger","fearmonger","liar","peddler of misinformation"],"phonetic":"/ˈfɪkʃənˌmʌŋɡər/","extraExplanation":["“fictionmonger”由 fiction（虚构）+ monger（贩卖者/兜售者）组成；-monger 这个后缀在英语里常带负面色彩，表示“靠兜售某种东西的人”，如 fearmonger（散播恐惧者）、rumormonger（散播谣言者）。","这个词不算常用，更常见的表达包括 liar（说谎者）、rumormonger（造谣者）、spreader of misinformation（散播错误信息的人）。在正式写作中，用 “rumormonger” 或 “peddler of misinformation” 往往更自然。"]}
{"word":"fictions","summary":{"en":"“Fictions” can mean multiple fictional works (stories/novels) or multiple false ideas presented as true.","zh":"“fictions”可指多部虚构作品（故事/小说），也可指多种被当作真实的虚假说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stories, books, or films that are invented (not factual); imaginative literature.","zh":"虚构作品；小说类（非纪实的、想象出来的故事/文学作品）。"},"examples":[{"en":"She enjoys reading fiction before bed.","zh":"她喜欢睡前读小说。"},{"en":"This library has a large fiction section.","zh":"这家图书馆有很大的小说区。"},{"en":"Science fiction often explores future technology.","zh":"科幻小说常常探索未来科技。"}]},{"partOfSpeech":"n.","definition":{"en":"Things that are not true; false ideas presented as if they were facts.","zh":"虚假之事；被当作事实来讲的谎言或不真实的说法。"},"examples":[{"en":"The rumor turned out to be pure fiction.","zh":"那个谣言结果证明完全是假的。"},{"en":"Don’t confuse fiction with reality.","zh":"不要把虚构和现实混为一谈。"}]}],"synonyms":["novels","stories","imaginary tales","fabrications","falsehoods"],"phonetic":"/ˈfɪkʃənz/","extraExplanation":["“fiction”通常是不可数名词，表示“小说/虚构文学”这一类：read fiction / fiction section。说“一本小说”常用 a novel 或 a work of fiction。","“fictions”多用于两种情况：①指“多部（或多种）虚构作品”，如 modern fictions（现代小说作品）；②指“多种虚构说法/谎言”，常见搭配 legal fictions（法律拟制）。"]}
{"word":"fictious","summary":{"en":"Fictitious means ‘not real; invented or made up.’ It can also mean ‘assumed for convenience’ in formal contexts.","zh":"fictitious 意为“虚构的、捏造的、不真实的”；在正式语境中也可指“为方便而假定/拟制的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not real; invented or made up (especially in a story, report, or name).","zh":"虚构的；捏造的（尤指故事、报道或名字等并非真实）。"},"examples":[{"en":"The novel is based on a fictitious country.","zh":"这部小说以一个虚构的国家为背景。"},{"en":"He gave the police a fictitious name.","zh":"他向警方报了一个假名字。"},{"en":"The rumor turned out to be fictitious.","zh":"结果证明那个谣言是捏造的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Assumed for convenience in discussion, law, or accounting, even if not literally true.","zh":"（为讨论、法律或会计等方便而）假定的；拟制的（未必完全符合事实）。"},"examples":[{"en":"The report uses a fictitious example to explain the rule.","zh":"报告用一个假设的例子来解释这条规则。"},{"en":"In law, a court may rely on a fictitious person for illustration.","zh":"在法律语境中，法院有时会用一个拟制的人物来作说明。"}]}],"synonyms":["false","imaginary","invented","made-up","fabricated","fictional"],"phonetic":"/fɪkˈtɪʃəs/","extraExplanation":["你输入的 **fictious** 常见为拼写错误；正确拼写是 **fictitious**。","词根提示：来自拉丁语 *fingere*（塑造、捏造）。因此它常与“故事、谣言、假名字、虚构人物/地点”等搭配。","易混词：**fictional**（文学/影视作品中的“虚构的”更常用） vs **fictitious**（更强调“捏造、不真实”，也常用于假名、假信息）。"]}
{"word":"fictitious","summary":{"en":"“Fictitious” means not real—made up or invented, often for stories, examples, or false names.","zh":"“fictitious”表示“不真实、虚构的”，常用于故事情节、举例情境或化名等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not real; invented or imagined, often used for stories, characters, names, or situations.","zh":"虚构的；不真实的；（为故事、人物、名字或情境）编造的。"},"examples":[{"en":"The novel is full of fictitious characters, but it reflects real emotions.","zh":"这部小说充满了虚构人物，但它反映了真实的情感。"},{"en":"For privacy, she used a fictitious name when signing up online.","zh":"为了保护隐私，她在网上注册时用了一个虚构的名字。"},{"en":"Don’t base your decisions on fictitious rumors.","zh":"不要根据虚构的谣言做决定。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Legal/official) Created for a specific purpose but not based on an actual person or event.","zh":"（法律/正式语境）为特定目的而设立的，但并非基于真实人物或事件的。"},"examples":[{"en":"The report used a fictitious case to explain how the policy works.","zh":"报告用一个虚构案例来说明政策如何运作。"},{"en":"The company’s training includes fictitious scenarios for practice.","zh":"公司的培训包含用于练习的虚构情景。"}]}],"synonyms":["fictional","imaginary","made-up","invented","fabricated"],"phonetic":"/fɪkˈtɪʃəs/","extraExplanation":["“fictitious”常用于对比“real / true（真实的）”。它偏正式，常见搭配有：fictitious character（虚构人物）, fictitious name（化名/假名）, fictitious story（虚构故事）, fictitious account（虚构叙述）。","词源来自拉丁语 root “fingere”（塑造、捏造、编造），也与“fiction（小说/虚构）”“fictional（虚构的）”同源。语感上：fictional更常用于文学影视角色与情节；fictitious也可用于“假名字、假说法、假指控”等更广的“非真实”场景。"]}
{"word":"fictitiously","summary":{"en":"Fictitiously means “in a fictional/imaginary way” or “in a falsely invented way.”","zh":"fictitiously 意为“以虚构/想象的方式”，也可指“以编造的不真实方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a fictional or imaginary way; not based on real facts.","zh":"以虚构的方式；基于想象而非真实事实。"},"examples":[{"en":"The film depicts the city fictitiously, combining landmarks that are miles apart.","zh":"这部电影以虚构的方式呈现这座城市，把相距很远的地标拼在一起。"},{"en":"She wrote fictitiously about a war to explore fear and courage.","zh":"她以虚构的方式描写战争，用来探讨恐惧与勇气。"}]},{"partOfSpeech":"adv.","definition":{"en":"Not truthfully; falsely (often implying the story is invented rather than mistaken).","zh":"不真实地；虚假地（常暗示是编造的，而不是无意弄错）。"},"examples":[{"en":"The witness described the event fictitiously, and the timeline didn’t match the evidence.","zh":"证人对事件的描述是编造的，时间线与证据对不上。"},{"en":"He was accused of fictitiously reporting hours he never worked.","zh":"他被指控虚报自己从未工作过的工时。"}]}],"synonyms":["fictionally","imaginarily","made-up","falsely","inventedly"],"phonetic":"/fɪkˈtɪʃəsli/","extraExplanation":["“fictitiously”来自形容词“fictitious”（虚构的、捏造的）+ 副词后缀“-ly”。语气上常比“imaginarily”更偏“编造/不真实”，在新闻、法律、学术语境里也常用来指出内容不属实。"]}
{"word":"fictitiousness","summary":{"en":"“Fictitiousness” means the quality of being made up rather than real.","zh":"“fictitiousness”表示“虚构性”，即某事是编造的而非真实的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being fictitious; the state of being invented or not real.","zh":"虚构性；并非真实而是被编造出来的特性。"},"examples":[{"en":"The novel’s charm comes from its fictitiousness, not its realism.","zh":"这部小说的魅力来自它的虚构性，而不是写实。"},{"en":"We should separate the fictitiousness of the story from the factual details in the report.","zh":"我们应把故事的虚构性与报告中的事实细节区分开。"}]}],"synonyms":["fictionality","unreality","fabrication","inventedness"],"phonetic":"/fɪkˈtɪʃəsnəs/","extraExplanation":["“fictitiousness”是由形容词fictitious（虚构的）+ 名词后缀 -ness（……的状态/性质）构成的抽象名词。","在日常英语中，这个词相对少见；更常用的表达是“fictionality”或直接说“it’s fictional / it’s made up”。在学术写作（文学研究、叙事学）里，“fictionality”更常见。","注意语气：说某事的“fictitiousness”通常带有“它不是真的”的强调；如果谈文学作品的虚构属性，很多语境下用“fictionality”更中性。"]}
{"word":"fictive","summary":{"en":"Fictive means imaginary or invented, especially in stories; in academic use it can also mean relating to fiction and narrative techniques.","zh":"Fictive 指“虚构的、想象的”，多用于故事语境；在学术用法中也可指“与小说/叙事创作相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Imaginary; created by the mind rather than based on real life (often used in books, movies, or stories).","zh":"虚构的；想象出来的（常用于书籍、电影或故事中），并非真实发生。"},"examples":[{"en":"Sherlock Holmes is a fictive character, but many people know his name.","zh":"夏洛克·福尔摩斯是个虚构人物，但很多人都知道他的名字。"},{"en":"The film uses a fictive town to avoid blaming a real community.","zh":"这部电影使用一个虚构小镇，以避免让真实社区被指责。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary/academic) Related to fiction or storytelling as an art form, emphasizing narrative invention.","zh":"（文学/学术）与小说或叙事创作相关的；强调叙事性的虚构建构。"},"examples":[{"en":"In class, we discussed how the author’s fictive world reflects real social issues.","zh":"在课堂上，我们讨论了作者的虚构世界如何反映真实的社会问题。"},{"en":"The essay examines fictive techniques like unreliable narrators.","zh":"这篇文章分析了诸如“不可靠叙述者”等虚构叙事技巧。"}]}],"synonyms":["fictional","imaginary","invented","made-up","mythical"],"phonetic":"/ˈfɪk.tɪv/","extraExplanation":["“fictive”常见于文学评论、学术写作或较正式的语境；日常英语里更常用“fictional”（虚构的）或“imaginary”（想象的）。","词源上与“fiction”（虚构/小说）同源，来自拉丁语“fingere”（塑造、捏造）。在学术语境中，“fictive”有时更强调“叙事建构”的性质，而不只是“是否真实”。"]}
{"word":"fictively","summary":{"en":"“Fictively” means “in a fictional/imaginary way,” often used when talking about writing, storytelling, or artistic representation.","zh":"“fictively”意为“以虚构/想象的方式”，常用于谈论写作、叙事或艺术呈现。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a fictional or imaginary way; not based on real events or facts.","zh":"以虚构的方式；想象的；不基于真实事件或事实。"},"examples":[{"en":"The novel is fictively set in a future city, but the emotions feel real.","zh":"这部小说以虚构的未来城市为背景，但情感很真实。"},{"en":"He described the meeting fictively to protect people’s privacy.","zh":"他用虚构的方式描述那次会议，以保护他人的隐私。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that involves making up details (often in storytelling, writing, or art).","zh":"以编造细节的方式（常见于讲故事、写作或艺术创作）。"},"examples":[{"en":"The filmmaker fictively combined several true stories into one character.","zh":"导演用虚构的方式把几个真实故事融合成一个角色。"},{"en":"She wrote fictively about her hometown, changing names and places.","zh":"她以虚构手法写家乡故事，改了人名和地点。"}]}],"synonyms":["fictionally","imaginatively","in an imagined way","inventively"],"phonetic":"/ˈfɪk.tɪv.li/","extraExplanation":["“fictively”比较少见，更常用的是“fictionally”（以虚构方式）或“in fiction”。在学术或文学评论里，fictively 有时用来强调“通过虚构手段来呈现/叙述”。","注意与“fictitiously”区分：fictitiously 常带有“假的、伪造的（可能有欺骗性）”的语气；而 fictively 通常更中性，偏向创作或叙事。"]}
{"word":"fictor","summary":{"en":"Fictor is a rare word meaning a maker or creator, especially one who shapes something into form.","zh":"Fictor 是个罕见词，意思是“塑造者/创造者”，强调把事物“加工成形”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A maker or creator; someone who shapes or forms something (often used in scholarly or literary contexts).","zh":"（罕用）塑造者；创造者；制作某物并加以“成形”的人（多见于学术或文学语境）。"},"examples":[{"en":"In the essay, the poet is described as a fictor who shapes language into new worlds.","zh":"在这篇文章里，诗人被描写为一位fictor，把语言塑造成新的世界。"},{"en":"The sculptor worked like a fictor, giving rough stone a human face.","zh":"那位雕塑家像一名fictor一样，让粗糙的石头呈现出人的面孔。"}]}],"synonyms":["creator","maker","shaper","fashioner","author"],"phonetic":"/ˈfɪktər/","extraExplanation":["“fictor”源自拉丁语，和“塑造、捏造”的词根有关，强调“把原材料加工成形”的动作。它在现代英语中非常少见，更多出现在古典研究、文学批评或拉丁语影响较强的写作里。","容易和“fiction（小说/虚构）”“fictitious（虚构的）”联想到一起：它们都来自相近词根，但现代英语里日常更常用的是“creator / maker / shaper”。"]}
{"word":"ficula","summary":{"en":"Ficula is mainly a scientific term: a genus name for certain marine sea snails; more rarely it can mean a small fig in older/Latin-influenced usage.","zh":"Ficula主要是科学用语：指一类海洋海螺的属名；更少见时在旧文献/受拉丁语影响的用法中可指“小无花果”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of marine sea snails (gastropod mollusks) in the family Ficidae; used mainly in scientific naming.","zh":"（生物学）Ficula：无盾海螺科（Ficidae）的一属海洋螺类；主要用于科学分类名称中。"},"examples":[{"en":"Scientists recorded a Ficula species living on sandy seabeds.","zh":"科学家记录到一种Ficula属的螺生活在沙质海底。"},{"en":"The shell was identified as belonging to the genus Ficula.","zh":"这枚贝壳被鉴定为属于Ficula属。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a small fig; a diminutive form related to Latin/Italian words for “fig,” sometimes seen in older texts or botanical contexts.","zh":"（罕见）小无花果；与拉丁语/意大利语中“无花果”相关的指小形式，有时出现在旧文献或植物学语境中。"},"examples":[{"en":"In older writing, ficula can refer to a small fig.","zh":"在较早的写作中，ficula有时指“小无花果”。"}]}],"synonyms":["sea snail (general)","genus name (taxonomy)"],"phonetic":"/ˈfɪkjələ/","extraExplanation":["“ficula”在日常英语里几乎不用，更多见于拉丁化的学名（尤其是软体动物分类）或较旧的词源/植物学语境。","如果你是在阅读某篇文章或看到一个标签（比如贝壳/化石/博物馆说明），把上下文或照片发来，我可以帮你判断这里的“ficula”具体指哪一类。"]}
{"word":"ficus","summary":{"en":"A ficus is a plant in the fig family, often a popular indoor tree like the weeping fig.","zh":"ficus 指榕属/无花果属植物，常见为室内观叶树（如垂叶榕）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tropical tree or houseplant in the fig family (genus Ficus), often grown indoors for its glossy leaves (e.g., weeping fig)","zh":"榕属植物；无花果属植物（Ficus），一种热带树木或常见室内观叶植物（如垂叶榕）"},"examples":[{"en":"She keeps a ficus by the window because it likes bright, indirect light.","zh":"她在窗边养了一盆榕树，因为它喜欢明亮的散射光。"},{"en":"The office lobby has a tall ficus tree that makes the space feel greener.","zh":"办公楼大厅里有一棵很高的榕树，让空间显得更绿。"}]}],"synonyms":["fig tree","weeping fig","rubber plant"],"phonetic":"/ˈfaɪkəs/","extraExplanation":["“Ficus”是拉丁语词，英语里常用来指“榕属植物”这一类，也常被口语化地用来特指室内常见的“垂叶榕（weeping fig）”。","在文学与文化里，“榕树/榕属”在一些热带地区常象征庇荫、长寿与庇护；不过在日常英语中更常见的语境是室内绿植与园艺护理（如浇水、光照）。","常见相关词：rubber plant（橡皮树，常被误叫成ficus的一种室内植物）、fig（无花果，Ficus carica的果实）。"]}
{"word":"ficus-like","summary":{"en":"“Ficus-like” means “similar in appearance to a ficus (fig) plant,” especially its glossy oval leaves.","zh":"“ficus-like”表示“外观像榕属（无花果属）植物的”，常指油亮的椭圆叶片等特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a ficus plant (a type of fig tree), especially in having glossy, oval leaves or a similar overall look.","zh":"像榕属植物（无花果属的一类植物，常见为室内观叶植物）的；尤指叶片光亮、椭圆或整体外观相似的。"},"examples":[{"en":"The lobby had ficus-like plants with shiny, dark green leaves.","zh":"大堂里摆着一些像榕树一样的植物，叶子油亮、深绿色。"},{"en":"She chose a ficus-like pattern for the wallpaper—simple branches and oval leaves.","zh":"她选了一个“榕树风”的壁纸图案：简洁的枝条和椭圆叶片。"}]}],"synonyms":["ficus-shaped","fig-like","leafy","plantlike"],"phonetic":"/ˈfaɪkəs laɪk/","extraExplanation":["“ficus-like”是由名词“ficus（榕属/无花果属植物）”加“-like（像……的）”构成的形容词，常用于园艺、室内装饰或描述图案/造型。常见的室内“ficus”包括 weeping fig（垂叶榕）和 rubber plant（橡皮树，常被归在榕属相关的观叶植物语境中）。"]}
{"word":"ficuses","summary":{"en":"“Ficuses” means more than one ficus plant (a fig-family plant often grown indoors).","zh":"“Ficuses”指不止一株 ficus（榕属/无花果科植物），常作为室内观叶植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ficus: a tropical or subtropical plant/tree in the fig family, often grown as a houseplant (for example, the rubber plant or weeping fig).","zh":"ficus 的复数：榕属植物（无花果科）的统称，常见于热带/亚热带，也常被当作室内观叶植物（如橡皮树、垂叶榕）。"},"examples":[{"en":"She keeps two ficuses by the window because they like bright, indirect light.","zh":"她在窗边养了两盆榕属植物，因为它们喜欢明亮的散射光。"},{"en":"The office ficuses started dropping leaves when the air got too dry.","zh":"空气太干时，办公室的榕属植物开始掉叶子。"}]}],"synonyms":["fig trees (general)","ficus plants"],"phonetic":"/ˈfaɪkəsɪz/","extraExplanation":["“ficus”是一个拉丁语来源的植物学用词，英语里单数是 ficus，复数常见两种写法：ficuses（更常用、更口语）和 ficī（较少见、偏书面/仿拉丁复数）。","日常语境里，人们常用具体品种名来称呼，如 rubber plant（橡皮树）、weeping fig（垂叶榕）、fiddle-leaf fig（琴叶榕）。"]}

