{"word":"fie","summary":{"en":"“Fie” is an old-fashioned exclamation of disgust or strong disapproval, often seen in older literature (e.g., “Fie on…”).","zh":"“fie”是表示厌恶或强烈不满的古语感叹词，常见于旧文学里，也常用在“fie on/upon …”结构中。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An old-fashioned exclamation used to express strong disapproval, disgust, or scorn (similar to “shame!” or “ugh!”).","zh":"（古语）感叹词，用来表示强烈的不赞成、厌恶或轻蔑（类似“真可耻！”“呸！”）。"},"examples":[{"en":"Fie! How could you lie to your friend?","zh":"呸！你怎么能对朋友撒谎？"},{"en":"“Fie on this cowardice!” the knight cried.","zh":"“可耻的懦弱！”骑士喊道。"}]},{"partOfSpeech":"phrase","definition":{"en":"(In the phrase “fie on/upon…”) Used to condemn someone or something.","zh":"（用于短语“fie on/upon …”）用来谴责某人或某事。"},"examples":[{"en":"Fie upon such selfishness.","zh":"这种自私真可耻。"},{"en":"Fie on the plan—it will hurt innocent people.","zh":"这计划真该骂——会伤害无辜的人。"}]}],"synonyms":["shame","shame on you","ugh","tsk","for shame"],"phonetic":"/faɪ/","extraExplanation":["“Fie”在现代英语里很少见，多见于莎士比亚等早期文学或刻意复古的台词中；日常口语更常用“shame on you,” “ugh,” “gross,” “that’s awful”等。","常见搭配是“fie on (someone/something)”或较古的“fie upon…”。","发音通常押韵“my / I”。"]}
{"word":"fied","summary":{"en":"“fied” is usually the past-tense/participle ending in words like “simplified,” meaning “made/turned into.”","zh":"“fied”通常是如“simplified”等词里的过去式/过去分词结尾，表示“使成为/转变为”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common written ending (past tense / past participle) of verbs that end in **-fy**, meaning “made into,” “caused to become,” or “changed into.” It is usually seen inside longer words (not used alone).","zh":"常见的书写结尾（以 **-fy** 结尾动词的过去式/过去分词），表示“使成为”“使变得”“转变为”。通常出现在更长的单词里，不太单独使用。"},"examples":[{"en":"The teacher **simplified** the instructions so everyone could understand.","zh":"老师把说明**简化**了，让大家都能明白。"},{"en":"The town has become more **gentrified** over the last ten years.","zh":"这座小镇在过去十年变得更**绅士化/高档化**了。"},{"en":"Use this setting to **humidify** the air; the room will be more **humidified** in an hour.","zh":"用这个设置给空气**加湿**；一小时后房间会更**湿润/加湿过**。"}]}],"synonyms":["made","turned into","changed into"],"phonetic":"/faɪd/","extraExplanation":["“-fy”来自拉丁语词源，常表示“使……成为/使……变得”（如 simplify, beautify, classify）。其过去式/过去分词常写作 “-fied”（simplify → simplified；beautify → beautified）。如果你看到单独的 “fied”，通常是从更长的单词里截出来的部分，而不是一个常用独立单词。"]}
{"word":"fiedlerite","summary":{"en":"Fiedlerite is a rare lead chloride mineral.","zh":"Fiedlerite 是一种稀有的含铅氯化物矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a lead chloride compound) that forms small crystals, usually found in oxidized lead ore deposits.","zh":"一种稀有矿物（含铅的氯化物化合物），常以小晶体形式出现，通常产于铅矿氧化带中。"},"examples":[{"en":"Fiedlerite is a rare mineral often collected by mineral enthusiasts.","zh":"Fiedlerite 是一种稀有矿物，常被矿物爱好者收藏。"},{"en":"The museum display included fiedlerite crystals from an old lead mine.","zh":"博物馆展柜里有来自一处老铅矿的 fiedlerite 晶体。"}]}],"synonyms":["lead chloride mineral","mineral"],"phonetic":"/ˈfiːdləˌraɪt/","extraExplanation":["词源：以人名命名的矿物名，通常来自发现者或相关研究者的姓氏（Fiedler + -ite，-ite 常用于矿物名后缀）。","语境提示：这是专业矿物学用词，日常英语中几乎不会遇到；在阅读矿物图鉴、地质报告或博物馆标牌时更常见。"]}
{"word":"fief","summary":{"en":"A fief is land or income granted by a lord to a vassal in the Middle Ages; figuratively, it can mean someone’s personal area of control.","zh":"fief 指中世纪领主赐给附庸的封地/收益权；引申为某人的势力范围或“私人地盘”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In the European Middle Ages, a piece of land (or a right to income) given by a lord to a vassal in exchange for loyalty and service, especially military service.","zh":"（欧洲中世纪）封地；领主赐给附庸的土地（或收益权），作为效忠与服役（尤指军事服役）的交换。"},"examples":[{"en":"The knight held a fief from the duke and promised to fight when called.","zh":"这名骑士从公爵那里获得一块封地，并承诺在被召唤时参战。"},{"en":"Under feudalism, land was divided into fiefs controlled by lords and worked by peasants.","zh":"在封建制度下，土地被分成由领主控制、由农民耕作的封地。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) An area of power or control that someone treats as their own domain, often in politics or business.","zh":"（引申义）势力范围；某人当作“地盘”的权力或控制区域（常用于政治或商业语境）。"},"examples":[{"en":"The department became his personal fief, and no one questioned his decisions.","zh":"这个部门成了他的私人地盘，没人敢质疑他的决定。"},{"en":"Local leaders sometimes protect their fiefs by blocking outside influence.","zh":"地方领导人有时会通过阻止外来影响来保护自己的势力范围。"}]}],"synonyms":["feudal estate","domain","territory","stronghold","sphere of influence"],"phonetic":"/fiːf/","extraExplanation":["“fief”与“feudalism（封建制度）”“vassal（附庸/臣属）”“lord（领主）”常一起出现。它强调的是一种以土地/收益换取效忠与服务的关系，不只是“土地”本身。","引申义在现代新闻或评论里很常见，通常带一点批评意味：暗示某人把公共资源当成私人领地来经营。"]}
{"word":"fief-holder","summary":{"en":"A fief-holder is someone who holds land granted by a lord in a feudal system, in exchange for loyalty or service.","zh":"fief-holder 指封建制度中持有领主授予封地的人，通常以效忠或服役作为交换。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who holds a fief (land or rights granted by a lord) in the feudal system, usually owing service or loyalty in return.","zh":"在封建制度中持有“封地/采邑”（由领主授予的土地或权利）的人，通常需要以服役或效忠作为回报。"},"examples":[{"en":"In medieval Europe, a fief-holder might supply soldiers to the lord during war.","zh":"在中世纪欧洲，封地持有人可能在战争时期为领主提供士兵。"},{"en":"The novel describes a fief-holder collecting rents from the villagers.","zh":"小说描写了一位封地持有人向村民收取地租。"}]}],"synonyms":["vassal","feudal tenant","tenant-in-chief"],"phonetic":"/ˈfif ˌhoʊldɚ/","extraExplanation":["“fief-holder”常用于历史语境，尤其是谈到欧洲的封建制度（feudalism）。fief 指领主授予的土地或特权；holder 意为“持有者/拥有者”。在不同地区与时期，fief-holder 的义务可能包括军事服务、缴纳贡赋或出席领主法庭等。","相关词汇：vassal（附庸/封臣，常与 fief-holder 接近但不完全等同）、liege lord（宗主/领主）、tenure（土地占有制度）。文学与历史写作中常见于描绘中世纪社会结构。"]}
{"word":"fief-holders","summary":{"en":"Fief-holders are people who hold land granted by a lord in a feudal system and owe duties in return.","zh":"fief-holders 指封建制度中持有领主所赐封地、并需履行相应义务的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who holds a fief (land granted by a lord) in a feudal system; a feudal vassal or landholder owing service or loyalty in return for the land.","zh":"（封建制度中）持有封地的人；封臣／领主的属臣，因获封土地而承担效忠或服役义务。"},"examples":[{"en":"In medieval Europe, fief-holders often had to provide soldiers when the lord called for war.","zh":"在中世纪欧洲，封地持有人常常需要在领主征召时提供士兵参战。"},{"en":"The king tried to limit the power of fief-holders by strengthening royal courts and taxes.","zh":"国王试图通过强化王室法庭与税收来限制封地持有人的权力。"}]}],"synonyms":["vassals","feudal tenants","landholders (feudal)"],"phonetic":"/ˈfiːf ˌhoʊldər/","extraExplanation":["“fief-holder(s)”多见于历史、学术或文学语境，指封建体系（feudalism）里的土地—义务关系：领主授予封地（fief），持有人则以军事服务、贡赋或政治忠诚作为回报。","写法上常见连字符 fief-holder（复数 fief-holders）；也可写作 fief holder。与更常见的相关词有 vassal（封臣）、feudal lord（封建领主）、serf（农奴），但这些角色地位不同，不能混用。"]}
{"word":"Fiefdom","summary":{"en":"A fiefdom is either a medieval feudal landholding (a fief) or, more commonly today, a “personal territory” controlled by someone like their private domain.","zh":"fiefdom 指中世纪封建制度下的封地；现代更常指某人像经营私人领地一样控制的“地盘/势力范围”（常含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A territory or organization controlled by one person or a small group, often with strong personal power and little outside oversight.","zh":"被某个人或小团体牢牢控制的“地盘/势力范围”，常带有个人专断、外部难以监管的含义。"},"examples":[{"en":"The marketing department became his personal fiefdom, and no one questioned his decisions.","zh":"市场部成了他的私人地盘，没人敢质疑他的决定。"},{"en":"Some critics say the agency turned into a political fiefdom.","zh":"一些批评者说，这个机构变成了政治势力的地盘。"}]},{"partOfSpeech":"n.","definition":{"en":"In medieval Europe, an estate of land granted by a lord to a vassal in exchange for loyalty and service; a “fief.”","zh":"（中世纪欧洲）领主授予封臣的封地（fief），以换取效忠与服役。"},"examples":[{"en":"The knight received a fiefdom from the lord and pledged military service.","zh":"那位骑士从领主那里获得封地，并宣誓提供军事服务。"},{"en":"Many fiefdoms were passed down through families over generations.","zh":"许多封地在家族中世代相传。"}]}],"synonyms":["domain","territory","realm","stronghold","sphere of influence","fief"],"phonetic":"/ˈfiːfdəm/","extraExplanation":["“fiefdom”来自“fief”（封地）+“-dom”（……的领域/状态，如 kingdom）。现代英语里常用作比喻，强调“像封建领地一样被某人当成私产经营”，常带批评语气。","常见搭配：a personal fiefdom（私人地盘）；turn/degenerate into a fiefdom（变成某人的地盘）；run something like a fiefdom（把某事物当封建领地来管）。","相关词：fief（封地）、vassal（封臣）、feudal（封建的）。文学或历史语境中更接近第2义；新闻与职场语境中多用第1义（比喻义）。"]}
{"word":"fiefdom","summary":{"en":"A fiefdom is either a feudal landholding (historical) or, more commonly today, any area someone controls like a personal territory.","zh":"fiefdom 指（历史上的）封地；现代更常比喻某人控制的“私人地盘/势力范围”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A territory or organization controlled by one powerful person (often used critically, suggesting unfair or overly personal control).","zh":"由某个强势人物控制的领地或势力范围（常带批评意味，暗示管理不公或过度个人化）。"},"examples":[{"en":"Some employees felt the department had become the manager’s fiefdom.","zh":"一些员工觉得这个部门已经变成了经理的“私人地盘”。"},{"en":"The local official ran the district like a fiefdom, rewarding loyal supporters.","zh":"那位地方官员把辖区当作封地来经营，奖赏忠诚的支持者。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A piece of land granted by a lord to a vassal in return for loyalty and service in the feudal system.","zh":"（历史）封建制度中领主授予附庸的土地，以换取效忠与服役。"},"examples":[{"en":"In medieval Europe, a knight might receive a fiefdom for military service.","zh":"在中世纪欧洲，骑士可能因服兵役而获得一块封地。"},{"en":"The novel describes nobles fighting over fiefdoms and titles.","zh":"这部小说描写贵族为封地和头衔而争斗。"}]}],"synonyms":["domain","turf","stronghold","personal empire"],"phonetic":"/ˈfiːf.dəm/","extraExplanation":["“fiefdom”来自“fief”（封地）+ “-dom”（表示领域、状态，如 kingdom）。现代英语里更常见的是比喻用法：形容某人把部门、公司、项目当成“自己的地盘”，强调权力集中、排外、任人唯亲等负面感受。","近义表达：personal empire（个人帝国，偏口语/比喻）、turf（地盘，口语）、domain（领域，中性）、stronghold（据点/势力范围）。文学或历史语境中也会出现 related term：feudalism（封建制度）、vassal（附庸）、lord（领主）。"]}
{"word":"fiefdoms","summary":{"en":"“Fiefdoms” is the plural of “fiefdom,” meaning feudal territories or, figuratively, areas controlled like someone’s personal domain.","zh":"“fiefdoms”是“fiefdom”的复数，指封建社会的封地；也常比喻由某人/某团体像“私人地盘”一样控制的势力范围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fiefdom; a territory, organization, or area controlled by one person or group, often with strong personal power and little outside oversight.","zh":"封地；（比喻）由某个人或团体牢牢掌控的地盘/势力范围，常带有个人权力很强、外部监督较少的含义。"},"examples":[{"en":"In the Middle Ages, nobles ruled their fiefdoms and collected taxes from the local people.","zh":"在中世纪，贵族统治自己的封地，并向当地居民征税。"},{"en":"The company became a set of competing fiefdoms, with each department protecting its own budget.","zh":"这家公司变成了互相竞争的“山头”，各部门都在保护自己的预算。"}]}],"synonyms":["domains","territories","enclaves","strongholds","spheres of influence"],"phonetic":"/ˈfiːfˌdəmz/","extraExplanation":["“fiefdom”原指封建制度中的“封地”（fief），由君主或上级领主分封给下级贵族/骑士。现代英语里常用作比喻，语气多偏负面，强调“各自为政、资源被私有化、缺乏协作或透明”。","常见搭配：a personal fiefdom（个人地盘）、corporate fiefdoms（公司内部的山头）、run something like a fiefdom（把某事当作自己的地盘来管）。"]}
{"word":"fiefs","summary":{"en":"“Fiefs” are lands/estates granted by a lord to a vassal for loyalty and service in medieval feudal society.","zh":"“fiefs”指中世纪封建社会中领主授予附庸、以换取效忠与服务的封地/采邑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Estates or lands granted by a lord to a vassal in exchange for loyalty and service (especially military service) in the medieval feudal system.","zh":"（中世纪封建制度中）领主授予附庸的封地/采邑，作为效忠与服务（尤其军事服务）的交换。"},"examples":[{"en":"In medieval Europe, knights often received fiefs for their military service.","zh":"在中世纪欧洲，骑士常因服兵役而获得封地。"},{"en":"The king divided conquered territory into fiefs to reward his supporters.","zh":"国王把征服来的领土分封为封地，以奖赏支持者。"}]}],"synonyms":["feudal estates","land grants","benefices"],"phonetic":"/fifs/","extraExplanation":["“fiefs”是“fief”的复数。理解它最关键的是把它放在“feudalism（封建制度）”框架里：领主给土地与保护，附庸提供效忠、税赋或兵役。","常见搭配：hold a fief（持有/拥有封地）、grant a fief（授封地）、a hereditary fief（世袭封地）。","文学与历史书写中常见：如谈到中世纪法国、英格兰或十字军国家的政治结构时，会用“fief/fiefs”来说明土地与权力的分配方式。"]}
{"word":"fiel","summary":{"en":"“fiel” is usually a typo; you likely mean “file” or “field.”","zh":"“fiel”通常是拼写错误；你可能想写“file”或“field”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most often a typo for “file” or “field.”","zh":"非标准拼写；最常见是把“file（文件/归档）”或“field（田野/领域）”拼错成“fiel”。"},"examples":[{"en":"I think you meant “file”: Please attach the file to the email.","zh":"我想你是要写“file”：请把文件附在邮件里。"},{"en":"Or you may have meant “field”: She works in the field of education.","zh":"或者你可能想写“field”：她在教育领域工作。"}]}],"synonyms":["file","field","feel"],"phonetic":"/fiːl/","extraExplanation":["“fiel”本身不是常见英文单词（少数人名/缩写除外）。如果你告诉我你的句子或你想表达的意思（比如“文件/归档”还是“田野/领域”，或“感觉 feel”），我可以给出更准确的词条、发音和用法。"]}
{"word":"field","summary":{"en":"Field most commonly means open land (a farm field), and it also means an area of study or work, real-life work outside the office, a sports playing area/competitor group, or a force area in physics.","zh":"Field 最常见指“田地/草地”，也可指“领域/学科”、办公室外的“实地/现场”、体育的“赛场/参赛者”，以及物理中的“场（如磁场）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An area of open land, especially used for farming, grazing animals, or growing crops.","zh":"田地；（尤指）用于耕作、放牧或种植作物的开阔土地。"},"examples":[{"en":"They grow corn in the field behind the house.","zh":"他们在房子后面的田里种玉米。"},{"en":"Cows were grazing in a green field.","zh":"牛群正在一片绿草地上吃草。"}]},{"partOfSpeech":"n.","definition":{"en":"A subject or area of study, work, or activity.","zh":"领域；学科；（工作或活动的）范围。"},"examples":[{"en":"She works in the field of education.","zh":"她在教育领域工作。"},{"en":"This is a new field for me, so I’m still learning.","zh":"这对我来说是个新领域，所以我还在学习。"}]},{"partOfSpeech":"n.","definition":{"en":"The place where an activity happens in real life (not in an office or laboratory), especially for research, business, or the military.","zh":"现场；野外；（相对办公室/实验室的）实地，尤指调查、商业或军事行动的地点。"},"examples":[{"en":"The scientists collected samples in the field.","zh":"科学家在野外采集样本。"},{"en":"He’s a field reporter, so he often travels for interviews.","zh":"他是驻外（现场）记者，经常出差采访。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports, the playing area; also the group of competitors who are taking part in a race or event.","zh":"（体育）赛场；（比赛）参赛选手（整体）。"},"examples":[{"en":"The players ran onto the field.","zh":"球员跑进了球场。"},{"en":"She beat a strong field in the tournament.","zh":"她在锦标赛中击败了一批强劲的对手。"}]},{"partOfSpeech":"n.","definition":{"en":"An invisible area where a force works, such as a magnetic field or electric field.","zh":"（物理）场；力场（如磁场、电场）。"},"examples":[{"en":"A magnet creates a magnetic field around it.","zh":"磁铁在周围产生磁场。"}]},{"partOfSpeech":"vt.","definition":{"en":"To catch, stop, and throw a ball cleanly in sports (especially baseball/softball).","zh":"（体育，尤指棒球/垒球）接（球）；守备处理（球）。"},"examples":[{"en":"He fielded the ground ball and threw it to first base.","zh":"他接住滚地球并把球传到一垒。"}]}],"synonyms":["area","domain","discipline","ground","pasture"],"phonetic":"/fiːld/","extraExplanation":["在英语里，“in the field”常常表示“在现场/实地（工作或研究）”，例如 field study（实地研究）、field trip（实地考察/校外教学）。","field 也常出现在复合词中：fieldwork（田野/实地工作）、field guide（野外/实地指南）、field office（外地/现场办公室）、field test（实地测试）。"]}
{"word":"field biologist","summary":{"en":"A biologist who does outdoor, on-site research in nature.","zh":"在自然环境中进行实地研究的生物学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies plants, animals, or ecosystems outdoors in their natural environment (not mainly in a laboratory).","zh":"在野外（自然环境中）研究动植物或生态系统的生物学家（主要不在实验室工作）。"},"examples":[{"en":"As a field biologist, she spends months tracking wolves in remote forests.","zh":"作为一名野外生物学家，她会花几个月在偏远森林里追踪狼群。"},{"en":"The field biologist collected water samples to test the health of the wetland.","zh":"这位野外生物学家采集了水样来检测湿地的健康状况。"}]}],"synonyms":["field researcher","ecologist","naturalist","wildlife biologist"],"phonetic":"/fiːld baɪˈɑːlədʒɪst/","extraExplanation":["常见搭配：field biologist / fieldwork（野外工作）/ field study（实地研究）/ in the field（在野外；在该领域）。","与 wildlife biologist（野生动物学家）相比，field biologist 更强调“工作地点与研究方式”（野外实地）；研究对象可以是动物、植物、微生物、栖息地等。"],"etymology":"短语由 field（“野外、实地”）+ biologist（“生物学家”）组成。field 在这里表示“在自然环境中进行的实地工作”，与 lab（实验室）相对。","mnemonic":["把 field 记成“田野/野外”，field biologist 就是“在野外干活的生物学家”。","联想“field trip（实地考察）”：field biologist 经常做 field trips 和 fieldwork。"]}
{"word":"field event","summary":{"en":"a jumping or throwing event in track and field","zh":"田径中的跳跃或投掷类田赛项目"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A track-and-field competition that happens in the field area (not on the running track), such as jumping or throwing events.","zh":"田径比赛中在场地（不在跑道上）进行的项目，如跳跃类或投掷类项目。"},"examples":[{"en":"In high school track, she competed in a field event: the long jump.","zh":"在高中田径赛中，她参加了一个田赛项目：跳远。"},{"en":"Shot put and discus are classic field events.","zh":"铅球和铁饼是经典的田赛项目。"},{"en":"The meet schedule lists the track events first, then the field events.","zh":"比赛日程先列径赛项目，然后列田赛项目。"}]}],"synonyms":["field athletics","jumping event","throwing event"],"phonetic":"/ˈfiːld ɪˈvɛnt/","extraExplanation":["在田径语境里，field events 通常包括：跳跃（跳远、三级跳、跳高、撑杆跳）和投掷（铅球、铁饼、标枪、链球）。英语里经常用复数 field events 来泛指这些项目。"],"etymology":"来自田径术语“track and field（径赛与田赛）”。field 在这里指“比赛场地/内场”，用来区分在跑道上进行的 track events（径赛）与在内场进行的 field events（田赛）。","mnemonic":["把它拆开记：field（场地/内场）+ event（项目/比赛）→“在场地里进行的项目”，对应中文“田赛”。"]}
{"word":"field events","summary":{"en":"jumping and throwing competitions in track and field","zh":"田径中的跳跃与投掷类田赛项目"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Athletics (track and field) competitions that take place on the infield area, mainly jumps and throws (not running races).","zh":"田径运动中在场地内进行的比赛项目，主要是跳跃和投掷类（不包括跑步径赛）。"},"examples":[{"en":"She competes in the field events, especially the long jump.","zh":"她参加田赛项目，尤其是跳远。"},{"en":"Field events at the meet include shot put, discus, and high jump.","zh":"这次运动会的田赛项目包括铅球、铁饼和跳高。"},{"en":"He switched from sprinting to field events after an injury.","zh":"受伤后，他从短跑转向了田赛项目。"}]}],"synonyms":["field competitions","jumps and throws","throwing events","jumping events"],"phonetic":"/fiːld ɪˈvɛnts/","extraExplanation":["在英语里，田径常说“track and field”。其中“track events”通常指径赛（各类跑步、跨栏、接力等），而“field events”指田赛（跳高、跳远、三级跳、撑杆跳；以及铅球、标枪、铁饼、链球等）。","在学校或比赛日程里也常见用法：例如“Field events start at 9 a.m.”表示田赛项目九点开始。"],"etymology":"“field”在田径里指跑道内侧的“场地/内场”（与“track”跑道相对）；“events”指比赛项目。合起来就是在内场进行的比赛项目，传统上以跳与投为主。","mnemonic":["把它拆开记：field=场地，events=项目 → “场地上的项目”=田赛。","联想“track vs. field”：track在跑道上跑；field在内场跳、投。"]}
{"word":"field hockey","summary":{"en":"a hockey game played on grass or turf with curved sticks and a ball","zh":"在草地/人造草场上用弯曲球杆和球进行的曲棍球运动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a team sport played on grass or artificial turf in which players use curved sticks to hit a ball into the opponent’s goal","zh":"曲棍球（草地/人造草场进行的团队运动；用弯曲球杆击球并攻入对方球门）"},"examples":[{"en":"She plays field hockey for her high school team.","zh":"她在高中校队打草地曲棍球。"},{"en":"Field hockey is popular in many countries, especially in Europe and South Asia.","zh":"草地曲棍球在许多国家很受欢迎，尤其是在欧洲和南亚。"},{"en":"They practice field hockey on an artificial turf field.","zh":"他们在一块人造草坪场地上练习草地曲棍球。"}]}],"synonyms":["hockey"],"phonetic":"/fiːld ˈhɑki/","extraExplanation":["英式英语里常直接说“hockey”来指草地曲棍球；美式英语中更常说“field hockey”，以免与“ice hockey（冰球）”混淆。","和“lacrosse（长曲棍球）”不同：field hockey 用球（硬球）与扁平球杆；lacrosse 用网兜球杆和较轻的球，规则与装备差异较大。"],"etymology":"“hockey”一词的来源不完全确定，可能与法语/荷兰语中表示弯棍或弯曲的词有关；“field hockey”用来区别于在冰上进行的“ice hockey（冰球）”。","mnemonic":["把 field 理解为“草地/场地”，所以 field hockey 就是“在场地上打的 hocky”，用来和 ice hockey（冰上冰球）区分。","联想：field=田地/草场；在“田地”上用杆打球→草地曲棍球。"]}
{"word":"field internship","summary":{"en":"a supervised internship in a real-world work setting","zh":"在真实工作场域进行的带指导的实践型实习"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A temporary, supervised work experience done in a real-world setting (outside the classroom), often required by a school program to gain practical skills in a specific field.","zh":"在真实工作环境（课堂之外）进行的、带指导与监督的短期实践经历，常作为学校项目要求，用于在某一专业领域获得实际技能。"},"examples":[{"en":"She completed a field internship at a community health clinic.","zh":"她在一家社区健康诊所完成了野外/现场实习（专业实践实习）。"},{"en":"The program requires a 12-week field internship before graduation.","zh":"该项目要求毕业前完成为期12周的专业实践实习。"},{"en":"During my field internship, I learned how to interview clients and write reports.","zh":"在我的专业实践实习期间，我学会了如何访谈来访者并撰写报告。"}]}],"synonyms":["practicum","field placement","work placement","externship","clinical placement"],"phonetic":"/fiːld ˈɪn.tɚn.ʃɪp/","extraExplanation":["在教育语境里，field internship 常见于社会工作、教育、公共卫生、心理咨询、环境科学等专业，意思更接近“专业实践/实习（在机构一线）”。","field 在这里多指“现场/实地/一线岗位”，不一定是“野外”。例如在医院、学校、社工机构的实习也可以叫 field internship。","有时也会写作 field placement（更强调“被安排到某机构/岗位”）或 practicum（更偏课程内的实践训练）。"],"etymology":"由 field（“现场、实地、工作一线”）+ internship（“实习”）组合而成；强调在真实场域中进行的实践型实习，与仅在课堂或实验室内的训练相对。","mnemonic":["把 field 理解成“第一线现场”，联想“到一线去实习”，就是 field + internship。","记忆对比：in the classroom（课堂） vs. in the field（现场）→ field internship 就是“在现场的实习”。"]}
{"word":"field method","summary":{"en":"A real-world, on-site way to collect data or carry out research or tests.","zh":"在真实现场进行数据收集、研究或检测的方法。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A way of collecting data or doing research directly in a real-world setting (not in a lab), often through observation, interviews, surveys, or measurements on site.","zh":"一种在真实环境中（而不是实验室里）直接收集数据或开展研究的方法，常通过现场观察、访谈、问卷或实地测量等进行。"},"examples":[{"en":"The team used a field method to record how people actually commute during rush hour.","zh":"团队用实地研究方法记录人们在高峰期真实的通勤方式。"},{"en":"Field methods like participant observation are common in anthropology.","zh":"像参与式观察这样的田野方法在人类学中很常见。"}]},{"partOfSpeech":"phrase","definition":{"en":"A practical on-site procedure for getting a result quickly (for example, a simple test or measurement performed outdoors or at the work site).","zh":"一种在现场快速得到结果的实用操作流程（例如在户外或工作现场进行的简易检测或测量）。"},"examples":[{"en":"They developed a field method to test water quality without bringing samples back to the lab.","zh":"他们开发了一种现场方法，不用把样本带回实验室也能检测水质。"},{"en":"This field method is less precise than the lab method but much faster.","zh":"这种现场方法不如实验室方法精确，但快得多。"}]}],"synonyms":["fieldwork","on-site method","in-situ method","observational method","empirical method"],"phonetic":"/fild ˈmɛθəd/","extraExplanation":["在社会科学里，field method 常和 fieldwork 连用，强调“去现场、看真实发生什么”。常见搭配：field methods course（田野方法课）、field methods training（田野方法训练）、field method(s) in anthropology/sociology（人类学/社会学的田野方法）。","在自然科学与工程中，field method 也可指“现场检测/现场测量”的流程，和 lab method（实验室方法）形成对比。"],"etymology":"由 field（“现场/野外/实地”）+ method（“方法”）组合而成；常见于学术语境，如“fieldwork（田野工作）”相关的研究与技术。","mnemonic":["把 field 记成“田野/现场”，method 记成“方法”→ 合起来就是“去现场用的方法”。","联想：fieldwork（田野工作）= 用 field methods 做 research（研究）。"]}
{"word":"field note","summary":{"en":"a quick on-site observation record","zh":"现场观察时随手记下的记录"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brief written record made on-site during direct observation or practical work, used to capture details while they are fresh","zh":"在现场进行观察或实践工作时当场记下的简短记录，用来趁记忆新鲜抓住细节"},"examples":[{"en":"The biologist wrote a field note about the birds’ feeding behavior.","zh":"这位生物学家写了一条现场记录，记录鸟类的取食行为。"},{"en":"Take field notes during the interview, but ask for permission first.","zh":"采访时可以做现场记录，但要先征得对方同意。"},{"en":"Her field notes later became the basis of the final report.","zh":"她的现场记录后来成了最终报告的基础。"}]}],"synonyms":["observation","record","log","memo","journal entry","notebook entry"],"phonetic":"/ˈfild ˌnoʊt/","extraExplanation":["常用复数 field notes，表示一整套现场笔记；也可说 take/make field notes（做现场记录）、field-note（作定语，如 field-note system“现场记录系统”）。","与 lab notes（实验室记录）相对：field notes 更强调自然环境或真实场景中的观察与细节（时间、地点、天气、对话、行为等）。"],"etymology":"由 field（“现场、野外”）+ note（“记录、笔记”）构成；常见于科学考察、人类学田野调查、新闻采访、工程巡检等语境，强调“在现场即时记录”。","mnemonic":["field=“现场/野外”，note=“笔记”：合起来就是“在现场写下来的笔记”。","联想“跑到田野(field)里立刻记(note)”——趁热打铁记细节。"]}
{"word":"field observation","summary":{"en":"Observing and recording events in a real-world setting.","zh":"在真实现场进行观察与记录。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The act of watching and recording what happens in a real, natural setting (not in a lab), especially for research or study.","zh":"在真实自然环境（非实验室）中进行的观察与记录，常用于研究或学习。"},"examples":[{"en":"The biologist conducted field observations of birds during migration season.","zh":"这位生物学家在迁徙季对鸟类进行了野外观察。"},{"en":"Field observation helps researchers understand how people actually behave in daily life.","zh":"实地观察能帮助研究者了解人们在日常生活中的真实行为。"}]},{"partOfSpeech":"phrase","definition":{"en":"A note or piece of data collected while observing something on-site.","zh":"在现场观察时记录下的一条观察笔记或一项数据。"},"examples":[{"en":"Her field observations suggested the soil was drier than expected.","zh":"她的现场观察表明土壤比预期更干。"},{"en":"We compared our field observations with the satellite images.","zh":"我们把现场观察与卫星图像进行了对比。"}]}],"synonyms":["on-site observation","in situ observation","direct observation","field study","fieldwork","site visit"],"phonetic":"/fiːld ˌɑbzɚˈveɪʃən/","extraExplanation":["常与实验室研究（lab experiment）对比：field observation更接近真实世界，优点是生态效度高，但变量不易控制。","常见搭配：do/make/conduct field observations；based on field observations；field observation notes/data。"],"etymology":"复合短语：field（“野外/现场”）+ observation（“观察”）。常见于科学研究、教育实习与社会调查语境，强调“在现场而非控制环境中”获取信息。","mnemonic":["把field理解为“田野/现场”，observation理解为“观察”：合起来就是“到现场去看”。","联想“实地考察=去现场看并记”，对应的英语表达就是field observation。"]}
{"word":"field of view","summary":{"en":"The visible area from a particular position; in optics/media, the angle a device can capture or display.","zh":"从某位置能看到的范围；在光学/影像中指设备可捕捉或显示的视角范围。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The area you can see at one time, especially without moving your head or eyes (often used in everyday description).","zh":"一次能看到的范围，尤其是不转动头或眼睛时（常用于日常描述）。"},"examples":[{"en":"I saw the deer at the edge of my field of view.","zh":"我在视野边缘看到了那只鹿。"},{"en":"Keep the door in your field of view while you wait.","zh":"等待时把门保持在你的视野范围内。"}]},{"partOfSpeech":"phrase","definition":{"en":"In photography, filmmaking, gaming, and optics, the angular extent of what a camera, lens, or viewer can capture or display (often shortened to FOV).","zh":"在摄影、电影、游戏和光学中，相机/镜头/观察者能拍到或显示的“视角范围”（常缩写为 FOV）。"},"examples":[{"en":"A wide-angle lens gives a larger field of view.","zh":"广角镜头能提供更大的视角范围。"},{"en":"Try increasing the field of view in the game settings if you feel motion sick.","zh":"如果你觉得晕3D，可以在游戏设置里调大视角范围。"},{"en":"The microscope’s field of view becomes smaller as you increase magnification.","zh":"显微镜放大倍数越高，视野范围越小。"}]}],"synonyms":["viewing area","visual range","sightline","scope","range"],"phonetic":"/ˌfiːld əv ˈvjuː/","extraExplanation":["常见搭配：wide/narrow field of view（宽/窄视角）；in/within/outside your field of view（在/在……范围内/不在视野内）。","相关概念区分：field of view 强调“能看到/能拍到的范围”；line of sight 强调“视线是否被遮挡、是否能直视到目标”。","在游戏里，FOV 调得更大通常能看到更多周边，但画面边缘可能更“拉伸”（变形感更明显）。"],"etymology":"由 field（“范围、领域”）+ view（“观看/视野”）组合而成；在光学与摄影领域中逐渐固定为术语，用来表示可见/可成像的范围（常用角度来量化）。","mnemonic":["把它拆开记：field=“一块范围/领域”，view=“看见”，合起来就是“你能看见的那一块范围”。","联想中文：视野=“看见的野（范围）”，field 和 “野” 都有“范围/旷野”的感觉。"]}
{"word":"field of vision","summary":{"en":"the visible range; the scope of what one notices or considers","zh":"视野范围；也可指注意到或考虑到的范围"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the area you can see at one time without moving your eyes or head","zh":"视野；在不移动眼睛或头部的情况下，一次能看到的范围"},"examples":[{"en":"A bright light entered my field of vision from the left.","zh":"左侧有一道强光进入了我的视野。"},{"en":"Keep the ball in your field of vision when you drive.","zh":"开车时要让球始终保持在你的视野范围内。"},{"en":"The cyclist suddenly appeared in his field of vision.","zh":"那位骑行者突然出现在他的视野里。"}]},{"partOfSpeech":"phrase","definition":{"en":"the range of sight that is possible or practical in a particular situation (often figurative)","zh":"（常比喻）在特定情境下可见、可注意到或可考虑的范围"},"examples":[{"en":"New opportunities entered her field of vision after she moved to the city.","zh":"她搬到城市后，新的机会进入了她的视野。"},{"en":"Try to keep the long-term goal in your field of vision.","zh":"尽量把长期目标放在你的视野里。"}]}],"synonyms":["visual field","view","sight range","scope","range"],"phonetic":"/ˌfiːld əv ˈvɪʒən/","extraExplanation":["常见搭配：enter/come into someone’s field of vision（进入某人的视野）；in/within someone’s field of vision（在某人的视野内）；leave/exit someone’s field of vision（离开某人的视野）。","近义表达对比：field of vision 更偏“范围/区域”；line of sight 更偏“视线通道”（中间是否被挡住）。","在医学/驾驶语境中也会说 peripheral vision（周边视力/余光）来强调视野边缘。"],"etymology":"“field”原意是“田地、区域”，引申为“范围”；“vision”来自拉丁语 videre（看见）。合起来表示“可视的范围”，后来也常用于比喻“注意力/认知范围”。","mnemonic":["把它想成“视野这块地”：field=一块地/一片范围，vision=看见；合起来就是“你能看见的那片范围”。","联想中文“进入视野”：enter/come into + field of vision = “进入视野”。"]}
{"word":"field practice","summary":{"en":"training done on a field or in real-world conditions","zh":"在场地或真实环境中进行的训练"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a training session done on a field (especially in sports) to practice skills and teamwork","zh":"（尤指体育）在场地上进行的训练课/场地训练"},"examples":[{"en":"We have field practice every Tuesday afternoon.","zh":"我们每周二下午都有场地训练。"},{"en":"Field practice helps the team improve passing and positioning.","zh":"场地训练能帮助球队提高传球和站位。"}]},{"partOfSpeech":"phrase","definition":{"en":"hands-on training carried out in real outdoor or working conditions, not just in a classroom (common in military, emergency response, or technical training)","zh":"（军队、应急、技术等）在真实环境中进行的实地训练/野外训练（区别于课堂训练）"},"examples":[{"en":"The new recruits will start field practice after basic instruction.","zh":"新兵在完成基础讲解后会开始实地训练。"},{"en":"Field practice teaches you how to handle unexpected situations.","zh":"实地训练会教你如何应对突发情况。"}]}],"synonyms":["practice","training","drill","field training","on-field training","hands-on training","outdoor training"],"phonetic":"/fiːld ˈpræk.tɪs/","extraExplanation":["常见搭配：have field practice（进行场地训练）；during field practice（在实地训练期间）。","易混：field practice（训练/演练）≠ fieldwork（实地工作/田野调查，更偏“做研究或收集数据”）。","在学校体育语境里，field practice 往往等同于 practice（训练），只是强调地点在场地上。"],"etymology":"由 field（场地；野外；实际工作环境）+ practice（练习；训练）组合而成。含义从“在场地上练习”自然扩展为“在真实环境中进行训练/演练”。","mnemonic":["把 field 想成“场地/野外”，practice 想成“练习”：合起来就是“到场地/野外去练”。","联想“实战=到现场”：field practice≈去现场练，离开教室更贴近真实情况。"]}
{"word":"field referee","summary":{"en":"An on-field sports official who enforces rules and makes calls.","zh":"在场上执法并作出判罚的体育裁判。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An official who supervises a game on the playing field, enforces the rules, and makes decisions during play.","zh":"（体育比赛中）在场上执法的裁判员；负责监督比赛、执行规则并在比赛过程中作出判罚。"},"examples":[{"en":"The field referee stopped the match after a dangerous tackle.","zh":"场上裁判在一次危险铲球后叫停了比赛。"},{"en":"Players must respect the field referee’s decision, even if they disagree.","zh":"即使不同意判罚，球员也必须尊重场上裁判的决定。"},{"en":"In rugby, the field referee communicates with the video official when needed.","zh":"在橄榄球比赛中，场上裁判需要时会与视频裁判沟通。"}]}],"synonyms":["referee","match official","official","on-field official"],"phonetic":"/fild ˌrɛfəˈri/","extraExplanation":["在不同运动里，类似角色的常见叫法不完全一样：足球和橄榄球多用 referee；棒球常用 umpire；篮球也常说 referee/official。\"field referee\"强调“场上那位裁判”，有时用来与 sideline referee（边线裁判）或 video referee（视频裁判）区分。"],"etymology":"由 field（场地、赛场）+ referee（裁判）构成的复合名词，用来强调“在场上执法”的那位裁判，以区别于场边或视频裁判等角色。","mnemonic":["field=“场地/田地”，referee=“裁判”；合起来就是“在场地上的裁判”。","把它记成“在field上吹哨的referee”，强调位置在场内而不是看回放的裁判。"]}
{"word":"field research","summary":{"en":"on-site, real-world investigation and data collection","zh":"在真实现场进行的调查研究与数据采集"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"research done outside a lab or office by going to real places to collect information directly (through observation, interviews, measurements, or samples).","zh":"在实验室或办公室之外，到真实现场直接收集信息的研究（通过观察、访谈、测量或采样等）。"},"examples":[{"en":"The team conducted field research in rural schools to understand how students learn English.","zh":"团队在农村学校做了实地研究，以了解学生如何学习英语。"},{"en":"Her field research included interviewing shop owners and mapping local traffic patterns.","zh":"她的实地研究包括采访店主并绘制当地交通模式。"}]},{"partOfSpeech":"phrase","definition":{"en":"study of plants, animals, rocks, or the environment carried out in nature rather than in a controlled setting.","zh":"在自然环境中（而非受控环境中）进行的动植物、岩石或环境方面的研究。"},"examples":[{"en":"Field research in ecology often requires long days outdoors.","zh":"生态学的实地研究常常需要长时间在户外。"},{"en":"They did field research to track bird migration routes.","zh":"他们做实地研究来追踪鸟类迁徙路线。"}]}],"synonyms":["fieldwork","on-site research","in-the-field study","empirical investigation","ground research"],"phonetic":"/fild ˈriˌsɝtʃ/","etymology":"“field”原义是“田野/野外”，引申为“现场、实地”；“research”来自法语/中古英语，意为“反复寻找、探究”。合起来就是“到现场去做研究”。","mnemonic":["把它拆开记：field=野外/现场；research=研究 → “到现场去研究”。","联想中文“田野调查/实地调研”，意思几乎一一对应。"]}
{"word":"field roller","summary":{"en":"A heavy farm roller used to level and press soil in a field.","zh":"用于田间压实、整平土壤的重型农用滚筒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A heavy cylindrical tool pulled over farmland to press down and level the soil (often after seeding), breaking small clods and improving seed-to-soil contact.","zh":"（农业）田间镇压滚筒；用于在播种后等把土壤压实、整平并压碎小土块，以利于种子与土壤紧密接触的重型圆筒工具。"},"examples":[{"en":"After sowing the grass seed, the farmer used a field roller to press the soil flat.","zh":"播下草籽后，农民用田间镇压滚筒把土壤压平压实。"},{"en":"A field roller can help reduce air pockets and improve germination.","zh":"田间镇压滚筒能减少土壤空隙，帮助提高发芽率。"}]}],"synonyms":["land roller","soil roller","cultipacker"],"phonetic":"/fiːld ˈroʊlər/","extraExplanation":["常见用途：播种后镇压（让种子更贴土、保墒）、压碎土块、整平地表；也可用于部分草地/牧草地维护。","注意不要与 road roller（压路机）混淆：field roller 一般是农具，通常由拖拉机牵引；road roller 多为自走式工程机械。"],"etymology":"由 field（田地）+ roller（滚筒/压路滚筒）构成的复合名词短语；在农业语境中专指用于田间压实与整平的“滚筒式农具”。","mnemonic":["把它拆开记：field=田地，roller=滚筒；合起来就是“田里用的滚筒（镇压整平）”。","联想中文“镇压滚筒”：滚过去把地“压”得更“整”。"]}
{"word":"field size","summary":{"en":"how large a field is, or how many participants are in a competition, depending on context","zh":"（因语境而异）场地/地块的大小，或比赛参赛人数规模"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the dimensions or area of a playing field (how big the field is)","zh":"（运动）比赛场地的尺寸或面积（场地有多大）"},"examples":[{"en":"The field size is smaller for youth soccer than for adults.","zh":"青少年足球的场地尺寸比成人的小。"},{"en":"Because of the field size, long passes are harder to defend.","zh":"由于场地较大，长传更难防守。"}]},{"partOfSpeech":"phrase","definition":{"en":"the area of a piece of farmland or an outdoor plot","zh":"（农业/土地）一块农田或地块的面积"},"examples":[{"en":"We adjust irrigation based on field size and soil type.","zh":"我们会根据地块面积和土壤类型来调整灌溉。"},{"en":"Small field sizes make it difficult to use large machines.","zh":"地块面积小会让大型机械难以使用。"}]},{"partOfSpeech":"phrase","definition":{"en":"the size of the visible or captured area in a device (such as a camera, microscope, or screen)","zh":"（光学/影像）设备可见或可拍摄范围的大小（如相机、显微镜或屏幕）"},"examples":[{"en":"A larger sensor usually gives a larger field size at the same magnification.","zh":"在相同放大倍率下，更大的传感器通常会带来更大的可视范围。"},{"en":"Decrease the zoom to increase the field size.","zh":"缩小变焦可以增大可视范围。"}]},{"partOfSpeech":"phrase","definition":{"en":"the number of competitors or entries in a race, tournament, or competition","zh":"（比赛）参赛者或参赛队伍的数量"},"examples":[{"en":"The marathon’s field size grew to over 20,000 runners.","zh":"这场马拉松的参赛人数增长到两万多名。"},{"en":"A smaller field size can change the strategy in a tournament.","zh":"参赛人数较少会改变锦标赛的策略。"}]}],"synonyms":["field dimensions","playing area","plot size","acreage","field of view","viewing area","number of entrants","entry count"],"phonetic":"/ˈfild saɪz/","extraExplanation":["提示：field 在英语里很“多义”。在体育里是“场地”，在农业里是“田地/地块”，在比赛新闻里常指“参赛阵容/全体选手”（the field）。因此 field size 可能是“场地大小”，也可能是“参赛人数”。看上下文（sports rules / farm management / camera specs / tournament report）最关键。"],"etymology":"由名词 field（“场地/田地/领域/参赛阵容”）+ size（“大小/尺寸”）构成的名词短语；含义会随 field 的语境变化而变化。","mnemonic":["把 field 想成“场（场地/赛场/田地）”，size 就是“大小”，合起来就是“场的大小”。","比赛报道里常见 the field=“参赛选手们”，所以 field size=“参赛规模/人数”。"]}
{"word":"field sketch","summary":{"en":"a quick on-site drawing used to record observations","zh":"用于记录观察结果的现场快速草图"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quick, rough drawing made on location to record what you observe (often for science, art, architecture, or archaeology)","zh":"在现场根据观察快速画下的草图（常用于科学记录、绘画、建筑或考古等）"},"examples":[{"en":"She made a field sketch of the bird before it flew away.","zh":"鸟飞走前，她在现场画下了这只鸟的速写。"},{"en":"The archaeologist’s field sketch showed where each artifact was found.","zh":"考古学家的现场草图标出了每件遗物的出土位置。"},{"en":"Bring a notebook for field sketches and short notes.","zh":"带上笔记本，用来画现场草图并做简短记录。"}]}],"synonyms":["on-site sketch","rough sketch","location sketch","field drawing","survey sketch"],"phonetic":"/fiːld sketʃ/","extraExplanation":["和普通“sketch”相比，field sketch 更强调“在现场”完成、以记录信息为目的，通常不追求精细上色或完美线条。","常见搭配：field sketchbook（野外速写本/现场记录本）、field sketch map（现场草图地图）、field sketch of…（……的现场草图）。"],"etymology":"由 field（“野外/现场”）+ sketch（“速写/草图”）组成，字面意思就是“在现场画的草图”。在自然观察、测绘与考古记录中很常见，用来快速捕捉形状、比例、位置关系等关键信息。","mnemonic":["把 field 理解成“野外/工地/现场”，sketch 是“速写”：合起来就是“现场速写/野外草图”。","联想：去“田野（field）”里“写（sketch≈写生/速写）”，就是在外面画下看到的东西。"]}
{"word":"field sketching","summary":{"en":"quick on-location sketching to record real-life scenes","zh":"在真实场景中进行的快速写生/速写"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"quick, on-site drawing done outdoors (or at a real location) to record what you see, often for art, design, architecture, or scientific observation","zh":"在户外或真实场景中进行的快速写生/速写，用来记录所见，常用于绘画、设计、建筑或科学观察"},"examples":[{"en":"Field sketching helps me capture the shape of the mountains before the light changes.","zh":"野外速写能帮我在光线变化前抓住山的形状。"},{"en":"In biology class, we practiced field sketching to record plant details.","zh":"在生物课上，我们练习野外写生来记录植物细节。"},{"en":"Bring a small sketchbook for field sketching during your trip.","zh":"旅行时带一本小速写本，方便随时写生。"}]}],"synonyms":["on-location sketching","outdoor sketching","plein air sketching","location drawing","observational drawing"],"phonetic":"/fild ˈskɛtʃɪŋ/","extraExplanation":["不一定只发生在“野外自然环境”，也可以指在城市街头、博物馆、建筑工地等真实地点的现场速写。","常见于“urban sketching（城市速写）”“nature journaling（自然观察笔记）”“field notes（野外记录）”等语境。"],"etymology":"由 field（野外、现场）+ sketching（速写、写生）组合而成；强调“在现场观察并快速画下”。","mnemonic":["把它拆开记：field＝野外/现场；sketching＝速写。合起来就是“到现场去速写”。","联想“实地考察=field trip”，在field trip上画sketch，就是field sketching。"]}
{"word":"field sobriety test","summary":{"en":"Roadside tasks used to check possible driver impairment.","zh":"用于判断驾驶者是否可能受损的路边测试。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A set of on-the-spot physical and mental tasks used by police to check whether a driver may be impaired (especially by alcohol).","zh":"（警方）在路边进行的一套简单身心测试，用来判断驾驶者是否可能受损（尤其是酒精影响）。"},"examples":[{"en":"The officer asked him to take a field sobriety test after noticing the smell of alcohol.","zh":"警察闻到酒味后，要求他做路边酒驾测试。"},{"en":"Refusing a field sobriety test can lead to additional suspicion and consequences, depending on local law.","zh":"拒绝做路边酒驾测试，可能会增加嫌疑并带来后果，具体取决于当地法律。"}]}],"synonyms":["roadside sobriety test","sobriety test","DUI checkpoint test","field test"],"phonetic":"/fiːld səˈbraɪəti tɛst/","extraExplanation":["常见项目包括：走直线并转身（walk-and-turn）、单脚站立（one-leg stand）、水平眼震测试（HGN, horizontal gaze nystagmus）。","它通常是“初步判断”工具，不等同于呼气酒精测试（breathalyzer）或抽血检测（blood test）。不同州/地区对“是否必须配合”和“拒绝的后果”规定不一。"],"etymology":"“field”在这里指“现场/路边”（非实验室环境），“sobriety”指“清醒/未醉”。该短语在美国执法语境中固定使用，常见于酒驾（DUI）检查。","mnemonic":["把它拆开记：field=现场/路边；sobriety=清醒；test=测试 → “路边测你清不清醒”。","联想场景：夜里路边检查，警察让你“走直线、单脚站”来判断是否酒驾。"]}
{"word":"field station","summary":{"en":"a research base in the field","zh":"野外/现场科研基地"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place (often a small facility) where scientists or students live and work temporarily to collect data and do research in a natural or real-world setting","zh":"（常指小型设施）供科学家或学生在野外/现场短期居住和工作，以收集数据、进行研究的基地"},"examples":[{"en":"The biology class spent two weeks at a field station studying local birds.","zh":"生物课在野外研究站待了两周，研究当地鸟类。"},{"en":"Researchers at the coastal field station monitor water quality every day.","zh":"海岸野外站的研究人员每天监测水质。"},{"en":"Before we go to the field station, we need to review safety rules.","zh":"去野外站之前，我们需要复习安全规定。"}]}],"synonyms":["research station","field research center","biological station","science station","observatory"],"phonetic":"/ˈfiːld ˌsteɪʃən/","extraExplanation":["常见搭配：field station staff（野外站工作人员）、field station director（野外站站长/主任）、at a field station（在野外站）、based at a field station（以野外站为基地）。","与 field trip（实地考察/春游式外出）不同：field station 更像“可住宿、可开展长期监测与实验的基地”；field trip 通常时间更短、以参观/采样为主。"],"etymology":"由 field（野外、现场）+ station（驻地、站点）组成，20世纪起在生态学、地质学、人类学等学科中常用，强调“在研究现场长期/阶段性驻扎的基地”。","mnemonic":["把它想成“野外的车站/站点”：人和设备在这里“驻站”，再出发去采样、观测。","field=野外；station=站点/驻地；合起来就是“野外驻地”。"]}
{"word":"field studies","summary":{"en":"research or learning done on-site in real-life conditions","zh":"在真实现场/实地环境中进行的研究或学习"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"research or observation done in real-world settings (outside a lab or classroom), often by collecting data directly from people, animals, places, or events","zh":"在真实环境（而非实验室或教室）中进行的研究/观察，通常通过到现场直接收集数据"},"examples":[{"en":"The biologists conducted field studies to track how birds migrate each spring.","zh":"生物学家进行野外研究来追踪鸟类每年春天如何迁徙。"},{"en":"Her field studies involved interviewing residents after the hurricane.","zh":"她的实地研究包括在飓风过后采访当地居民。"},{"en":"Field studies can reveal details that are hard to see in a laboratory.","zh":"实地研究能揭示一些在实验室里很难发现的细节。"}]},{"partOfSpeech":"phrase","definition":{"en":"a class activity or academic requirement that involves going to a site to learn through direct experience (e.g., a trip for observation, mapping, or sampling)","zh":"一种课程活动或学业要求：到现场通过直接体验来学习（如外出观察、测绘或采样）"},"examples":[{"en":"The geology course includes weekend field studies in the mountains.","zh":"这门地质课包含周末去山区做野外考察。"},{"en":"Students wrote reports based on their field studies at the museum and nearby neighborhood.","zh":"学生根据在博物馆和周边社区的实地考察写了报告。"}]}],"synonyms":["fieldwork","on-site research","in-situ study","field research","site visit","field observation"],"phonetic":"/ˈfiːld ˌstʌdiz/","extraExplanation":["常见搭配：conduct/do field studies（进行实地研究），field study site（实地研究地点），fieldwork（田野调查/野外工作，含义接近但更强调“工作过程”）。","学术语境里，field studies 多用于生物、生态、人类学、社会学、地理、教育等学科，强调“在自然/社会真实场景中收集一手资料”。"],"etymology":"“field”原指“田野/户外场地”，引申为“现场、实地”；“study”是“研究”。合起来指“在现场进行的研究/考察”。复数 field studies 常表示多次/多项实地研究。","mnemonic":["把 field 想成“野外/现场”，study 想成“学习/研究”——去“现场学习研究”就是 field study。","联想中文“实地调研/田野调查”：实地=field，调研=study。"]}
{"word":"field study","summary":{"en":"research done in real-world settings to gather firsthand information","zh":"在真实环境中获取一手资料的实地研究"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"research or learning done by going to real places to observe, measure, interview, or collect samples, rather than staying in a classroom or lab","zh":"到真实环境中进行的调查与学习（观察、测量、访谈、采样等），而不是只在教室或实验室里完成"},"examples":[{"en":"The biology class went on a field study to observe insects in a wetland.","zh":"生物课去湿地做实地考察，观察昆虫。"},{"en":"Her field study included interviews with local shop owners.","zh":"她的实地研究包括采访当地店主。"},{"en":"Field study helps students connect theory with real-world evidence.","zh":"实地考察能帮助学生把理论与真实世界的证据联系起来。"}]}],"synonyms":["fieldwork","on-site research","in-situ study","site visit","survey","ethnographic study"],"phonetic":"/ˈfiːld ˌstʌdi/","extraExplanation":["常见于环境科学、人类学、地理学、教育学等领域；可以是短期“实地考察”，也可以是较长期的“实地研究/田野调查”。","相关搭配：conduct a field study（开展实地研究）、field study site（实地研究地点）、field notes（田野笔记）、fieldwork（田野工作，含义更广、更常用）。"],"etymology":"由 field（“野外/现场/实地”）+ study（“研究/学习”）组合而成；强调在“现场”获得一手资料，与 desk study（案头研究）相对。","mnemonic":["把 field 想成“田野/现场”，field study 就是“到现场去学习/研究”，对应中文“实地/田野 + 研究”。","联想对比：desk study（案头研究）= 坐在桌前；field study = 走到野外/现场。"]}
{"word":"field survey","summary":{"en":"on-site data collection through direct investigation","zh":"在现场进行的直接调查与数据收集"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a survey or investigation carried out on-site (in the real environment) to collect data through direct observation, measurement, or interviews","zh":"在现场（真实环境中）进行的调查或勘测，通过直接观察、测量或访谈来收集数据"},"examples":[{"en":"The research team conducted a field survey to record bird species in the wetland.","zh":"研究团队进行了现场调查，记录湿地里的鸟类物种。"},{"en":"Before designing the road, engineers did a field survey to measure the slope and soil conditions.","zh":"在设计道路之前，工程师做了现场勘测，测量坡度和土壤状况。"},{"en":"We’ll start with a field survey to understand how residents use the park.","zh":"我们会先做一次现场调查，了解居民如何使用这个公园。"}]}],"synonyms":["on-site survey","site survey","field investigation","ground survey","reconnaissance","field study"],"phonetic":"/fild ˈsɝːveɪ/","extraExplanation":["常见于学术研究（地理、生态、人类学、社会学）、工程（测量、地质勘察）、市场调研等语境。","和 desk survey（案头调查/资料调查）相对：field survey 强调“亲自到现场收集一手数据”。","在一些专业里也会说 fieldwork（田野工作/现场工作），含义更广；field survey 更强调“调查/测量”这一环节。"],"etymology":"“field”原指“田野/野外/现场”，也可指“研究或工作的现场环境”；“survey”来自法语，原意与“俯瞰、查看”相关，后来发展为“系统调查/测量”。合起来指“到现场去做系统调查或测量”。","mnemonic":["把它拆开记：field=现场/野外，survey=调查/测量 → “去现场做调查”。","联想“地里(field)拿着尺子和问卷(survey)”：一边测量一边访问。"]}
{"word":"field system","summary":{"en":"An organized arrangement or model for how fields are structured and managed (in farming, archaeology, or science).","zh":"关于“田地/场”如何组织、呈现与管理（用于农业、考古或科学模型）的体系。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A planned way of organizing farmland—how fields are divided, used, and managed (often including boundaries, crop rotation, irrigation, etc.).","zh":"农田组织与管理的体系——包括田地如何划分、使用与管理（常涉及田界、轮作、灌溉等）。"},"examples":[{"en":"The village’s field system divides the land into long narrow strips.","zh":"这个村庄的农田制度把土地分成狭长的条状地块。"},{"en":"Crop rotation is an important part of a sustainable field system.","zh":"轮作是可持续农田管理体系的重要部分。"}]},{"partOfSpeech":"phrase","definition":{"en":"In archaeology and history, a pattern of ancient fields and boundaries that shows how people farmed the land in the past.","zh":"（考古/历史）古代田地与田界的分布格局，用来反映过去人们如何耕作与利用土地。"},"examples":[{"en":"Aerial photos revealed a prehistoric field system beneath the modern farms.","zh":"航拍照片显示，在现代农田之下有一套史前的古田地系统。"},{"en":"Researchers mapped the field system to understand settlement and land use.","zh":"研究人员绘制古田地系统的分布，以理解聚落与土地利用方式。"}]},{"partOfSpeech":"phrase","definition":{"en":"In physics or engineering, a set of related fields (such as an electric field and magnetic field) described together as part of one model.","zh":"（物理/工程）在同一模型中一起描述的一组相关“场”（如电场与磁场）。"},"examples":[{"en":"The simulation treats the electromagnetic field system as a coupled model.","zh":"该仿真把电磁场系统作为一个耦合模型来处理。"}]}],"synonyms":["farming system","agricultural system","land-use system","cropping system","open-field system","field pattern","field network","electromagnetic system"],"phonetic":"/ˈfiːld ˌsɪstəm/","extraExplanation":["在英国史与考古中，field system 常指“open-field system（开放田制）”或某地区遗留的“古田界/田块格局”。如果你在文章里看到具体时代或地点（如 Roman、medieval、Celtic），通常就是考古/历史用法。"],"etymology":"由 field（田地；领域；场）+ system（系统）构成的复合短语。早期多用于农业与土地制度；在学术语境中也扩展到“古代田地格局”（考古）以及“场的组合模型”（物理）。","mnemonic":["把它拆开记：field=田/场，system=系统 → “田的系统/场的系统”。看到农业语境（farm、crop、rotation）多半是“农田管理体系”；看到 physics、electromagnetic 多半是“场系统”。"]}
{"word":"field test","summary":{"en":"a real-world trial to check practical performance","zh":"在真实环境中验证实际表现的测试"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trial of a product, system, or idea in real-world conditions to see how well it works outside the lab or office","zh":"在真实环境中对产品、系统或想法进行测试，以检验其在实验室/办公室之外的实际表现"},"examples":[{"en":"The new app is in field testing with a small group of users.","zh":"这款新应用正在由一小部分用户进行实地测试。"},{"en":"We ran a field test of the water filter in rural villages.","zh":"我们在乡村地区对净水器进行了实地测试。"}]},{"partOfSpeech":"v.","definition":{"en":"to test something in real-world conditions","zh":"在真实环境中测试某物"},"examples":[{"en":"Engineers will field-test the robot on a construction site next week.","zh":"工程师下周会在工地对机器人进行实地测试。"},{"en":"Before launch, we need to field-test the survey questions.","zh":"在发布之前，我们需要对问卷问题做实地测试。"}]}],"synonyms":["real-world test","pilot test","trial run","beta test","field trial"],"phonetic":"/ˈfild ˌtɛst/","extraExplanation":["对比：lab test（实验室测试）更可控、变量更少；field test（实地测试）更接近真实使用，但环境更复杂，结果更能反映“实际表现”。","常见搭配：conduct/run a field test（进行实地测试）；field-test a prototype（实地测试原型）。"],"etymology":"由 field（野外/现场、实际环境）+ test（测试）组合而成；含义从“在野外测试”引申为“在真实使用场景中验证”。常见于工程、产品开发、军事与社会科学研究语境。","mnemonic":["field = 现场/野外；field test 就是“把东西拿到现场去测”。","联想“下地干活”：产品不只在办公室PPT里好用，得去现场试一试。"]}
{"word":"field tests","summary":{"en":"Real-world, on-site testing to check performance and reliability.","zh":"在真实现场进行的实测，用来检验性能与可靠性。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Practical tests done in real-world conditions (not in a lab or office) to see how something works.","zh":"在真实环境（而非实验室/办公室）中进行的实际测试，用来检验某物的表现。"},"examples":[{"en":"The app went through field tests before the official launch.","zh":"这款应用在正式上线前进行了实地测试。"},{"en":"Engineers collected user feedback during the field tests.","zh":"工程师在实地测试期间收集了用户反馈。"}]},{"partOfSpeech":"phrase","definition":{"en":"Tests performed outdoors or on location, especially in science or engineering (e.g., equipment, vehicles, sensors).","zh":"在户外或现场进行的测试，尤用于科学或工程场景（如设备、车辆、传感器等）。"},"examples":[{"en":"They ran field tests on the new water filter in rural areas.","zh":"他们在农村地区对新净水器进行了现场测试。"},{"en":"The drone failed in early field tests because of strong winds.","zh":"这架无人机在早期现场测试中因大风而失败。"}]}],"synonyms":["real-world testing","on-site testing","in-situ testing","pilot testing","trial run","beta testing"],"phonetic":"/ˈfild ˌtɛsts/","extraExplanation":["常见搭配：conduct/run/carry out field tests（进行实地测试）；field test results（实测结果）；field-testing（动名词）。","对比：lab tests（实验室测试）更可控；field tests 更接近真实使用环境，变量更多。"],"etymology":"由 field（野外/现场）+ test（测试）组合而成；原意强调“离开实验室，在现场验证”。在科技与工程语境中逐渐固定为常用搭配。","mnemonic":["field=现场/野外，field tests=把东西“带到现场去考”。","联想“实地考察/实测”：不是纸上谈兵，而是到一线验证。"]}
{"word":"field trip","summary":{"en":"an educational visit outside the usual place of study or work","zh":"到课堂/办公地点之外进行学习或考察的外出活动"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a school or group visit to a place outside the classroom to learn by seeing and doing things directly","zh":"（学校或团体组织的）实地参观；校外教学活动"},"examples":[{"en":"Our class went on a field trip to the science museum.","zh":"我们班去科学博物馆进行了一次实地参观。"},{"en":"The field trip helped students understand the lesson better.","zh":"这次校外教学活动帮助学生更好地理解了课程内容。"},{"en":"Parents signed permission slips for the field trip.","zh":"家长为这次外出活动签了同意书。"}]},{"partOfSpeech":"phrase","definition":{"en":"a short journey made to do practical work, research, or observation outside an office, lab, or usual workplace","zh":"（为工作/研究/观察而进行的）外出考察；实地调研"},"examples":[{"en":"The researchers took a field trip to collect water samples.","zh":"研究人员外出考察去采集水样。"},{"en":"We scheduled a field trip to inspect the construction site.","zh":"我们安排了外出考察去检查施工现场。"}]}],"synonyms":["excursion","school outing","study trip","educational visit","outing","site visit"],"phonetic":"/ˈfiːld trɪp/","extraExplanation":["常见搭配：go on a field trip（去实地参观）、take students on a field trip（带学生去校外教学）、field trip permission slip（外出活动家长同意书）、field trip chaperone（随行家长/带队成人）。","与 excursion 接近，但 field trip 更强调“学习/观察/实践目的”，常用于学校或研究工作场景。"],"etymology":"由 field（“野外/实地”）+ trip（“出行/短途旅行”）组成；19世纪起在教育语境中常用，强调走出课堂到“现场”学习。","mnemonic":["把 field 记成“田野/现场”，trip 记成“出行”，合起来就是“去现场的出行”→实地参观/校外教学。","联想中文“下乡/下现场做调研”，就是不在教室或办公室里学，而是到真实环境里看一看。"]}
{"word":"field work","summary":{"en":"practical work done in real-world settings outside a classroom or office","zh":"在真实现场进行的实地工作或调查"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Practical work done outside an office, classroom, or laboratory—collecting information or doing tasks in real settings (often for science, research, journalism, or social work).","zh":"在办公室、教室或实验室之外进行的实地工作——在真实环境中收集信息或完成任务（常见于科研、调查、新闻或社会工作等）。"},"examples":[{"en":"The students did field work to record bird songs in the wetland.","zh":"学生们做了实地工作，在湿地里记录鸟鸣。"},{"en":"Good field work requires careful notes and respect for local communities.","zh":"好的实地工作需要认真记录，并尊重当地社区。"},{"en":"During field work, the archaeologists found pieces of pottery.","zh":"在实地考察中，考古学家发现了陶器碎片。"}]}],"synonyms":["field research","field study","on-site work","site visit","field investigation","groundwork","field survey"],"phonetic":"/ˈfiːld ˌwɝːk/","extraExplanation":["在学术语境中，field work常与“data collection（数据收集）”“interviews（访谈）”“observations（观察）”“sampling（采样）”一起出现。","与homework不同：homework是课后作业；field work是到现场完成的调查、观察或实践任务。"],"etymology":"“field”表示“野外/现场”，与“work（工作）”组合而成；最初强调在“现场”进行的工作，与室内或书面工作相对。","mnemonic":["把它拆开记：field=“田野/现场”，work=“工作”，合起来就是“去现场干活/做调查”。","联想“下地干活”：field像“田”，field work就是“下到田野/现场做事”。"]}
{"word":"field-army","summary":{"en":"A field army is a large army formation organized to fight and operate in the field.","zh":"field-army 指用于战场作战与机动作战的大型陆军编制（野战方面军）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large military force organized for operations in the field (not just for training or defense at a base), usually made up of several corps or divisions and commanded by a senior general.","zh":"（野战）方面军；在战场上执行作战任务的大型陆军部队，通常由多个军/师组成，由高级将领指挥。"},"examples":[{"en":"The field army advanced toward the border after weeks of preparation.","zh":"准备数周后，这支野战军向边境推进。"},{"en":"A field army may include infantry, armor, artillery, engineers, and logistics units.","zh":"一个野战军可能包含步兵、装甲兵、炮兵、工兵以及后勤部队。"}]}],"synonyms":["army formation","operational army","field force"],"phonetic":"/ˈfiːld ˌɑrmi/","extraExplanation":["“field-”在这里表示“在野外/战场上进行的”，与“驻防部队、守备部队”相对。常见相关词：field artillery（野战炮兵）、field hospital（战地医院）。","在不同国家与不同时期，“army”的编制规模差异很大；有些体系里“field army（方面军）”高于“corps（军/军团）”，但具体层级需结合语境理解。"]}
{"word":"field-based","summary":{"en":"“Field-based” describes activities done on-site in real-world settings rather than in an office, lab, or classroom.","zh":"“field-based”指在真实现场/一线环境中开展的活动，而不是在办公室、实验室或教室里进行。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(work, research, or learning) done in real-world settings outside an office, lab, or classroom, often on-site where the subject is located.","zh":"（工作、研究或学习）在真实环境中进行的；不在办公室、实验室或教室里，而是在现场或研究对象所在地点开展的。"},"examples":[{"en":"The program includes a field-based internship in a local hospital.","zh":"这个项目包含在本地医院进行的现场实习。"},{"en":"Field-based research helped the team understand how farmers actually use the technology.","zh":"实地研究帮助团队了解农民在现实中如何使用这项技术。"},{"en":"She is a field-based engineer who travels to repair equipment at customer sites.","zh":"她是一名驻现场的工程师，需要到客户现场维修设备。"}]}],"synonyms":["on-site","in-the-field","ground-level","practical","hands-on"],"phonetic":"/ˈfiːld ˌbeɪst/","extraExplanation":["“field-based”常用于学术与职场语境，强调“在现场/一线”而非在办公室或实验室：field-based study（实地研究）、field-based training（现场培训）、field-based staff（驻外/驻点人员）。","书写上多作定语时常加连字符：a field-based project；放在名词后作表语时有时不加连字符也可：The project is field based（不如加连字符常见）。"]}
{"word":"field-dress","summary":{"en":"To field-dress is to do basic on-site preparation—most often removing a hunted animal’s organs so it can be cooled and carried; less commonly, to bandage a wound in the field.","zh":"field-dress 指在现场做初步处理：最常见是狩猎时取出内脏以便降温搬运；较少见为在野外给伤口包扎急救。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Hunting) to prepare a killed animal in the field by removing the internal organs (and sometimes other parts) so the meat cools and can be transported safely.","zh":"（狩猎）在野外对猎获动物进行初步处理，取出内脏（有时还会去除其他部位），以便降温并安全搬运。"},"examples":[{"en":"After the deer was harvested, they field-dressed it before carrying it back to camp.","zh":"猎到那只鹿后，他们先在野外给它开膛取内脏，再把它搬回营地。"},{"en":"If you don’t field-dress the animal quickly, the meat can spoil in warm weather.","zh":"如果不尽快在野外处理取内脏，天气热时肉可能会变质。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Military, less common) to dress or bandage a wound in the field; to give first aid away from a hospital.","zh":"（军事用语，较少见）在野外为伤口包扎处理；进行现场急救。"},"examples":[{"en":"The medic field-dressed the wound and sent the soldier to the aid station.","zh":"卫生兵先在现场包扎处理伤口，然后把士兵送到救护站。"}]}],"synonyms":["gut (an animal)","eviscerate","dress (game)","clean (a deer/game)","treat (a wound)","bandage"],"phonetic":"/ˈfiːld ˌdrɛs/","extraExplanation":["“field-dress”最常见于北美狩猎语境，强调在“野外（field）”进行的第一步处理，目的是让肉尽快散热、减少污染、便于运输。日常更常见的相关形式是形容词“field-dressed”（已完成野外处理的）。","在军事语境中，更常见的名词是“field dressing”（急救敷料/包扎），动词表达通常也会说“dress the wound”。"]}
{"word":"field-driven","summary":{"en":"Field-driven means shaped by real-world conditions, observations, and needs from the field.","zh":"field-driven 指由一线现实环境、观察与需求所引导／推动的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Guided or shaped by real-world data, observations, or practical experience from the field (not just by theory or lab results).","zh":"由一线数据、现场观察或实际经验所引导／塑造的（不只是基于理论或实验室结果）。"},"examples":[{"en":"The team took a field-driven approach and redesigned the app based on customer feedback.","zh":"团队采用以现场为导向的方法，根据客户反馈重新设计了这个应用。"},{"en":"Our maintenance plan is field-driven: we prioritize problems engineers see most often on site.","zh":"我们的维护计划以现场为导向：优先处理工程师在现场最常遇到的问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Developed primarily by needs and constraints encountered in real working environments (e.g., farms, factories, hospitals, construction sites).","zh":"主要由真实工作环境中的需求与限制所推动／形成的（如农场、工厂、医院、工地等）。"},"examples":[{"en":"These safety rules are field-driven, created after repeated incidents in the plant.","zh":"这些安全规定源于现场需求，是在工厂多次事故后制定的。"},{"en":"The new tool is field-driven and built to work in dust, rain, and low light.","zh":"这款新工具以现场需求为驱动，能在灰尘、雨天和弱光环境下使用。"}]}],"synonyms":["real-world-driven","practice-driven","experience-driven","user-driven","field-led","customer-driven"],"phonetic":"/ˈfiːld ˌdrɪvən/","extraExplanation":["“field-driven”是一个常见的连字符复合形容词：field（现场、一线、实际环境）+ driven（驱动的、推动的）。它常出现在工程、产品、运维、科研应用等语境中，用来强调“从真实使用场景出发”。","含义上常与“data-driven（数据驱动）”相近，但“field-driven”更强调来自现场的经验、案例、条件限制（例如温度、灰尘、操作习惯），不一定是大量统计数据。","写法上多用连字符（field-driven）放在名词前作定语：a field-driven design；作表语时也可用：The design is field-driven。"]}
{"word":"field-dweller","summary":{"en":"A field-dweller is someone or something that lives in open fields; it can also describe things related to living in fields.","zh":"field-dweller 指生活在田野/开阔地带的人或动物；也可作形容词表示“田野栖居的；与田野有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that lives in fields or open countryside (rather than in a town, forest, or water).","zh":"住在田野或开阔乡间（而不是城镇、森林或水域）的人或动物。"},"examples":[{"en":"Many field-dwellers avoid bright lights and loud roads.","zh":"许多田野栖居者会避开强光和嘈杂的公路。"},{"en":"In the study, field-dwellers were more active at dusk.","zh":"在这项研究中，田野栖居的动物在黄昏时更活跃。"}]},{"partOfSpeech":"adj.","definition":{"en":"Living in or associated with fields (used before a noun).","zh":"生活在田野中的；与田野有关的（常作定语，放在名词前）。"},"examples":[{"en":"The farmer reported damage from field-dweller species.","zh":"农民报告说有田野栖居物种造成了破坏。"},{"en":"The novel describes a field-dweller community beyond the city walls.","zh":"小说描写了城墙外的一个田野居民社群。"}]}],"synonyms":["grassland dweller","country dweller","rural resident","field animal","open-country species"],"phonetic":"ˈfiːld ˌdwɛlər","extraExplanation":["“field-dweller”不是特别常见的固定词，更常见的表达有“field animal(s)”“grassland species”“country folk / rural residents”。作者或研究写作中用它，往往是为了对比“forest-dweller（林栖者）/ water-dweller（水栖者）/ city-dweller（城市居民）”。","连字符（-）常用于把两个词临时组合成一个更紧密的概念，尤其在作定语时更常见：a field-dweller species（一个“田野栖居”的物种）。作为名词时也可以写成 field dweller（不带连字符），但带连字符更强调它是一个整体概念。"]}
{"word":"field-dwelling","summary":{"en":"“Field-dwelling” means living in or typically found in open fields.","zh":"“field-dwelling”指“栖息于田野/原野的；通常在田野出没的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living in, growing in, or normally found in open fields (rather than forests, cities, or water).","zh":"居住在田野/原野的；生长在田野/原野的；通常出没于田野的（相对于森林、城市或水域）。"},"examples":[{"en":"Field-dwelling birds often build their nests on the ground.","zh":"田野栖息的鸟类常常在地面筑巢。"},{"en":"The scientist compared field-dwelling insects with forest insects.","zh":"科学家比较了田野栖息的昆虫和森林昆虫。"}]}],"synonyms":["field-living","open-country","grassland","rural (context-dependent)"],"phonetic":"/ˈfiːld ˌdwɛlɪŋ/","extraExplanation":["“field-dwelling”是由 field（田野）+ dwelling（居住的）组成的复合形容词，常见于生物学、生态学、自然观察写作中，用来描述某种动物或植物的典型栖息环境。","在正式写作中常用连字符（field-dwelling）来明确这是一个整体修饰语；放在名词后作表语时有时也可不加连字符：The species is field dwelling（较少见）。"]}
{"word":"field-goal","summary":{"en":"a three-point score made by kicking the ball through the goalposts during play","zh":"比赛中将球踢过球门柱得分（通常为三分）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a goal in American football scored by kicking the ball through the opponent’s goalposts during play","zh":"（美式橄榄球）任意球得分：在比赛进行中把球踢过对方球门柱之间并越过横梁而得分"},"examples":[{"en":"They won the game with a last-second field goal.","zh":"他们靠最后一秒的任意球赢下了比赛。"},{"en":"A field goal is worth three points in American football.","zh":"在美式橄榄球里，任意球值三分。"}]}],"synonyms":["three-pointer","kick","placekick"],"phonetic":"/ˈfiːld ˌɡoʊl/","extraExplanation":["文化小贴士：在美式橄榄球中，field goal 通常在进攻推进受阻、但已接近得分范围（field goal range）时使用，属于更稳妥的三分选择。","相关表达：kick a field goal（踢进任意球）；attempt a field goal（尝试任意球）；field goal range（任意球射程/得分范围）。"],"etymology":"由 field（比赛场地）+ goal（得分目标）组成，原意是“在场上踢进的得分”，用来区别于达阵后的“附加得分（extra point）”。","mnemonic":["把它拆开记：field=球场，goal=进球/得分目标 → “在球场上踢进去的得分”。","联想中文：任意球=“不是达阵也能得分的踢球”，通常就是三分。"]}
{"word":"field-portable","summary":{"en":"“Field-portable” means easy to carry and usable on site, especially during fieldwork.","zh":"“field-portable”指便于携带并可在现场（野外工作中）直接使用的设备。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to be easy to carry and use outside a normal office, lab, or home setting (often on location).","zh":"（设备等）便于携带、可在现场/户外使用的；现场便携式的。"},"examples":[{"en":"The team brought a field-portable water tester to the river.","zh":"团队带了一台现场便携式水质检测仪去河边。"},{"en":"Field-portable tools are useful when you can’t bring samples back to the lab.","zh":"当你无法把样本带回实验室时，现场便携式工具就很有用。"}]}],"synonyms":["portable","mobile","transportable","rugged (in context)","on-site"],"phonetic":"/ˌfiːld ˈpɔr.t̬ə.bəl/","extraExplanation":["“field-”在这里指“现场/野外工作环境”（fieldwork），不是“田地”的意思。比如 field-portable microscope（现场便携式显微镜）、field-portable power station（便携电源）。","这个词常见于工程、环境监测、地质勘探、医疗应急等语境，强调“可带到现场直接使用”，不仅是“轻”，还包括“耐用、易部署、可离网供电”等特点。","写作上常作定语：a field-portable device / field-portable equipment。也可不加连字符写作 field portable（较少见，科技写作中连字符更常见）。"]}
{"word":"field-ready","summary":{"en":"Field-ready means fully prepared to work in real-world, on-site conditions.","zh":"Field-ready 指已充分准备好，可在真实现场环境中投入使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Prepared and equipped to be used in real-world conditions (not just in testing or in theory).","zh":"已准备好并具备条件，可在真实环境中使用（不仅仅是测试或理论阶段）。"},"examples":[{"en":"The software update is field-ready, so technicians can install it on site.","zh":"这次软件更新已经可以用于现场，所以技术人员可以在工地直接安装。"},{"en":"We need a field-ready prototype that can handle dust, heat, and rough handling.","zh":"我们需要一个可用于现场的原型机，能应对灰尘、高温和粗暴搬运。"}]},{"partOfSpeech":"adj.","definition":{"en":"Ready to be deployed to a work site or operational area (for practical use, service, or duty).","zh":"已可部署到作业现场或执行区域（用于实际工作、服务或任务）。"},"examples":[{"en":"By Friday, the team should be field-ready and able to support the rollout.","zh":"到周五，团队应该能进入现场支持上线。"},{"en":"All equipment must be field-ready before it leaves the warehouse.","zh":"所有设备离开仓库前都必须达到可现场使用的状态。"}]}],"synonyms":["deployment-ready","operational","ready for use","production-ready","ruggedized"],"phonetic":"/ˈfiːld ˌrɛdi/","extraExplanation":["“field-ready”常用于工程、IT、军警、医疗与制造等语境，强调“经得起现场环境”的可靠性与可部署性。","写作中常用连字符（field-ready）作定语：a field-ready system。作表语时也可用：The system is field-ready。"]}
{"word":"field-responsive","summary":{"en":"Field-responsive describes something that works well on site in real-world conditions, or (in software) a form field that automatically reacts to input.","zh":"field-responsive 指能在现场真实条件下良好运行/可调整的；也可指（软件中）表单栏位会随输入自动联动响应的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be used, adjusted, or to work well in real-world, on-site conditions (not just in a lab, office, or controlled setting).","zh":"能在真实现场/实地条件下使用、调整或良好运行的（而不只是实验室、办公室等受控环境中）。"},"examples":[{"en":"The device is field-responsive, so technicians can calibrate it at the job site.","zh":"这台设备具备现场适应性，所以技术人员可以在工地直接校准。"},{"en":"We need a field-responsive plan that can change when the weather turns.","zh":"我们需要一个能适应现场情况的方案，天气变化时也能调整。"}]},{"partOfSpeech":"adj.","definition":{"en":"In data forms or software: reacting automatically to user input or changing conditions for a specific field (box) in a form.","zh":"（表单/软件中）对某个输入栏位的内容或变化作出自动响应的。"},"examples":[{"en":"Make the “State” field-responsive so it updates when the user selects a country.","zh":"让“州/省”这一栏位具备响应功能：用户选了国家后自动更新。"},{"en":"The checkout form is field-responsive and shows extra options only when needed.","zh":"结账表单具备栏位响应功能，只在需要时才显示额外选项。"}]}],"synonyms":["field-ready","field-adaptable","field-tested","site-ready","reactive","dynamic"],"phonetic":"/ˈfiːld rɪˈspɑnsɪv/","extraExplanation":["“field-responsive”通常是一个较新的复合形容词，常见于工程、产品说明、项目管理或软件需求文档中。它的含义依语境而定：有时强调“在现场可操作/可调整”，有时强调“表单字段会自动联动/响应”。写作中也常见作同义替换的表达：field-ready（可现场使用的）、in-the-field adaptable（可在现场适应的）、form-field reactive（表单字段联动的）。"]}
{"word":"field-specific","summary":{"en":"Field-specific means specialized for a particular subject or professional area, not general.","zh":"field-specific 指“针对某一特定学科/行业/专业领域的”，强调不通用、偏专业化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or designed for a particular area of study, industry, or profession (not general-purpose).","zh":"与某一特定学科、行业或专业领域相关的；针对某一领域的（而非通用的）。"},"examples":[{"en":"You may need field-specific knowledge to understand this medical report.","zh":"你可能需要特定领域的知识才能理解这份医疗报告。"},{"en":"The course teaches field-specific vocabulary for business English.","zh":"这门课教授商务英语中的行业/领域专用词汇。"}]}],"synonyms":["domain-specific","specialized","discipline-specific","industry-specific","area-specific"],"phonetic":"/ˌfiːld spəˈsɪfɪk/","extraExplanation":["“field-specific”通常用连字符，尤其在名词前作定语时更常见：field-specific terms（领域专用术语）。放在名词后作表语时有时也可写作 field specific，但学术写作和正式文体里更推荐保留连字符。","常见搭配：field-specific terminology/knowledge/skills/training/data/standards（领域专用术语/知识/技能/培训/数据/标准）。"]}
{"word":"field-specificity","summary":{"en":"Field-specificity means something is tied to a particular discipline and may not transfer well to other fields.","zh":"Field-specificity 指某事物具有学科/领域专属性，往往不容易跨领域通用或迁移。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being limited to, or strongly shaped by, a particular field (subject area, profession, or discipline).","zh":"（知识、术语、方法等）具有“领域限定性/学科专属性”的特征；即主要只适用于某一特定领域。"},"examples":[{"en":"Medical vocabulary has high field-specificity, so beginners may struggle outside a healthcare context.","zh":"医学词汇的领域专属性很强，所以在非医疗语境下初学者可能会觉得难。"},{"en":"The study discusses the field-specificity of critical thinking in science versus in history.","zh":"这项研究讨论了批判性思维在科学与历史中的学科专属性差异。"}]},{"partOfSpeech":"n.","definition":{"en":"(In research or testing) The degree to which a skill, effect, or result transfers across fields rather than staying within one domain.","zh":"（在研究或测评中）某种技能、效应或结果能否跨领域迁移的程度；越“field-specific”表示越不容易跨领域通用。"},"examples":[{"en":"If creativity shows low field-specificity, training in art might also help problem-solving in engineering.","zh":"如果创造力的领域专属性较低，那么艺术训练也可能帮助工程领域的问题解决。"},{"en":"The results suggest high field-specificity: students improved only in the tasks closely tied to their major.","zh":"结果显示领域专属性很高：学生只在与专业紧密相关的任务上有提升。"}]}],"synonyms":["domain-specificity","discipline-specificity","specialization","context-dependence"],"phonetic":"/ˈfiːld spəˌsɪfɪsəti/","extraExplanation":["“field-specificity”常见于学术写作（教育学、心理学、语言学、信息科学等），用来讨论“知识/能力是否可迁移（transfer）”。如果一项能力具有高领域专属性，通常意味着需要在该领域内的知识与经验支持（例如医学诊断、法律推理）。","写作中常与这些词搭配：high/low field-specificity（高/低领域专属性）、domain-specificity（领域专一性，近义）、transferability（可迁移性，反义方向）。","连字符形式 field-specificity 多见于论文标题或较正式的用法；在正文里也常写作 field specificity（不加连字符），含义相同。"]}
{"word":"field-sports","summary":{"en":"Outdoor country sports, especially hunting or shooting.","zh":"乡间的户外运动，尤指狩猎或射击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Outdoor sports done in the countryside, especially hunting or shooting (and sometimes fishing).","zh":"在乡间进行的户外运动，尤指狩猎或射击（有时也包括钓鱼）。"},"examples":[{"en":"He grew up around horses and field sports like hunting.","zh":"他从小在马匹和狩猎等野外运动的环境中长大。"},{"en":"The magazine covers country life, including field sports and farming.","zh":"这本杂志介绍乡村生活，包括野外运动和农业。"}]}],"synonyms":["country sports","hunting","shooting sports"],"phonetic":"/ˈfiːld spɔrts/","extraExplanation":["“field sports”在英式英语里更常见，通常与英国乡绅文化、乡村庄园（country estate）以及传统的“shooting season（射击季）”等语境相关。现代语境中也可能引发关于动物福利与伦理的讨论。","写法上可作连字符形式“field-sports”，但更常见的是不加连字符的“field sports”。"]}
{"word":"field-study","summary":{"en":"Real-world, on-site research.","zh":"在真实现场进行的研究。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A research activity done in real-world settings (not in a lab), involving observing, collecting data, or interviewing people on site.","zh":"在真实环境中（非实验室）进行的研究活动，通常包括现场观察、数据收集或访谈。"},"examples":[{"en":"The students did a field study of water quality in the local river.","zh":"学生们对当地河流水质进行了实地研究。"},{"en":"Her field study involved interviewing workers at several factories.","zh":"她的实地研究包括在几家工厂采访工人。"},{"en":"Field studies often reveal details that are hard to notice in a laboratory.","zh":"实地研究常常能发现一些在实验室里不容易注意到的细节。"}]}],"synonyms":["fieldwork","on-site research","in situ study","observational study","site investigation"],"phonetic":"/ˈfiːld ˌstʌdi/","extraExplanation":["常见于生物学、生态学、人类学、社会学、地理学、市场调研等领域。更偏“在现场获取一手资料”，区别于 desk research（案头/文献研究）和 lab study（实验室研究）。","写法上既可作 field study（常见），也可见到 field-study（多作定语或标题式写法）。例如：a field-study report（实地研究报告）。"],"etymology":"由 field（“野外/现场；实际环境”）+ study（“研究”）组成，强调“到现场做研究”，与在实验室或书本上研究相对。","mnemonic":["把它想成“field=田野/现场 + study=学习研究”：到“田野里”做研究。","联想“实地考察/田野调查”= field study，中文意思基本对齐。"]}
{"word":"field-study oriented","summary":{"en":"mainly focused on real-world, on-site research and hands-on learning","zh":"以真实环境中的实地调查与实践学习为重点"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Focused mainly on collecting information or doing research in real-world settings (outside the classroom, lab, or office).","zh":"以实地（真实环境）观察、调查与数据收集为主要重点的；偏向田野/实地研究的。"},"examples":[{"en":"The program is field-study oriented, so students spend many weekends interviewing local residents.","zh":"这个项目以实地研究为导向，所以学生很多周末都在采访当地居民。"},{"en":"We need a field-study oriented approach to understand how the policy works on the ground.","zh":"我们需要一种偏向实地调查的方法，才能理解这项政策在基层如何运作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed for learners or professionals who prefer hands-on, on-site learning and practical experience.","zh":"面向偏好动手、现场学习与实践经验的学习者/从业者而设计的。"},"examples":[{"en":"Her teaching style is field-study oriented: she takes the class to museums and communities instead of only using slides.","zh":"她的教学风格偏向实地学习：她带学生去博物馆和社区，而不只是用幻灯片上课。"},{"en":"The training is field-study oriented and includes guided observations at partner organizations.","zh":"该培训偏向实地学习，包含在合作机构的带队观察。"}]}],"synonyms":["hands-on","practical","experiential","fieldwork-oriented","practice-oriented","applied"],"phonetic":"/ˈfiːld ˌstʌdi ˈɔːriˌɛn.tɪd/","extraExplanation":["常见于学术与教育语境（如 anthropology 人类学、ecology 生态学、education 教育学、public health 公共卫生、social work 社工等）。强调“到现场/在情境中”获取一手资料，而不是只做文献阅读或实验室研究。","也可写作 field study–oriented（用短横连接）或 fieldwork-oriented（更口语/更常见于人类学等领域）。"],"etymology":"由 field study（实地研究/田野调查）+ oriented（以……为导向的）构成；oriented 源自拉丁语 oriens（“升起、东方”），后来引申为“把方向对准……/以……为目标”。","mnemonic":["把它拆开记：field（田野/现场）+ study（研究）+ oriented（导向）→“研究方向对准现场”。","联想中文固定搭配“以……为导向”：把“field study”塞进去→“以实地研究为导向”。"]}
{"word":"field-tripping","summary":{"en":"Field-tripping means going on or relating to a field trip—an organized learning visit outside the usual classroom or workplace.","zh":"field-tripping 指“参加或与实地考察/校外教学有关”，即为学习而组织的课堂/工作场所以外的外出参观活动。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"going on a field trip (an organized visit outside the classroom or workplace for learning, observation, or experience).","zh":"去参加实地考察/校外教学（为学习、观察或体验而组织的课堂/工作场所以外的参观活动）。"},"examples":[{"en":"We’re field-tripping to the science museum on Friday.","zh":"我们周五要去科学博物馆参加校外教学。"},{"en":"The class spent the day field-tripping in the wetlands to study birds.","zh":"全班在湿地进行实地考察，研究鸟类。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an activity, day, or group that is involved in a field trip.","zh":"形容与实地考察/校外教学有关的（活动、一天、团队等）。"},"examples":[{"en":"Bring water for our field-tripping day tomorrow.","zh":"明天我们校外教学那天记得带水。"},{"en":"The field-tripping students took notes on local history.","zh":"参加实地考察的学生记录了当地历史。"}]}],"synonyms":["going on a field trip","on a field trip","excursion (more formal)","educational outing","study trip"],"phonetic":"/ˈfiːld ˌtrɪpɪŋ/","extraExplanation":["“field-tripping”多用于口语或非正式写作，表示“在进行校外教学/实地考察”。更常见、更正式的表达是：“go on a field trip / be on a field trip”。","连字符（field-tripping）常见于作定语时（如field-tripping day），也有人写作field tripping（不加连字符）。","注意不要与“tripping”（绊倒）混淆；这里的trip是“旅行/外出活动”。"]}
{"word":"fieldball","summary":{"en":"A (rare) word meaning a ball used on a field, or an outdoor ball game.","zh":"一个较少见的词，表示在场地上使用的球，或在户外进行的球类游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ball used for playing sports or games on a field; sometimes used more generally to mean an outdoor game played with a ball (rare).","zh":"（在户外场地上使用的）球；有时也泛指在场地上进行的球类游戏（较少见）。"},"examples":[{"en":"Bring a fieldball if you want to play on the grass after school.","zh":"如果你想放学后在草地上玩，带一个球来。"},{"en":"They packed cones and a fieldball for a quick practice in the park.","zh":"他们带了标志桶和一个球，准备在公园里简单练习。"}]}],"synonyms":["ball","game ball","outdoor ball"],"phonetic":"/ˈfiːldˌbɔl/","extraExplanation":["“fieldball”不是一个非常常见、固定的英语词条，更像是由 field（场地/田野）+ ball（球）组成的合成词。在真实语境中，人们更常直接说具体球类名称（如 soccer ball, football, baseball）或用更通用的说法（a ball, a game ball）。如果你是在某个特定运动/品牌/地区用语里看到它，含义可能会更专门，建议结合上下文确认。"]}
{"word":"fieldbird","summary":{"en":"Fieldbird means a bird commonly found in open fields or farmland; it can also be a rare poetic descriptor.","zh":"fieldbird 指常见于田野或农田的鸟；也可作少见的诗意描写词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bird that lives in or is commonly seen in open fields or farmland (a general, non-technical term).","zh":"田野鸟；常见于开阔田地或农田的鸟（泛称，非严格学术分类用语）。"},"examples":[{"en":"In early spring, fieldbirds return to the farmland and begin singing.","zh":"早春时，田野鸟会回到农田里开始鸣唱。"},{"en":"The photographer waited quietly for a fieldbird to land on the fence.","zh":"摄影师安静地等着一只田野鸟落在篱笆上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/poetic) Used as a descriptive word for something associated with fields and birdsong.","zh":"（少见/诗意用法）用来描写带有田野与鸟鸣气息的事物。"},"examples":[{"en":"He wrote about the fieldbird morning—quiet grass, bright air, and thin songs.","zh":"他写到“田野鸟的清晨”——安静的草地、明亮的空气与细细的歌声。"}]}],"synonyms":["farmland bird","country bird","songbird"],"phonetic":"/ˈfiːldˌbɝd/","extraExplanation":["“fieldbird”不是现代英语里非常常用的固定词条，更常见的说法是“a bird in the field / birds in the fields”或更具体的鸟名（如 sparrow 麻雀、lark 云雀、skylark 云雀）。","如果你在诗歌、民谣或地方性文本中看到“fieldbird”，它往往带有一种田园、自然、质朴的意象，用来营造氛围，而不一定指某一种特定鸟类。"]}
{"word":"fieldcraft","summary":{"en":"Fieldcraft means practical outdoor skills, especially military skills for operating, moving, and staying hidden in the field.","zh":"fieldcraft 指野外实用技能，尤指军队在野外行动、移动、观察与隐蔽等技能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Practical skills and methods used outdoors—especially by soldiers—for moving, observing, hiding, surviving, and operating effectively in the field.","zh":"在野外（尤指军队行动中）使用的一套实用技能与方法，包括移动、观察、隐蔽、生存与执行任务等。"},"examples":[{"en":"Good fieldcraft helps soldiers avoid being seen and heard.","zh":"良好的 fieldcraft 能帮助士兵避免被看见或被听见。"},{"en":"The course covers fieldcraft, map reading, and basic survival.","zh":"这门课程涵盖野外技能（fieldcraft）、地图判读和基础生存。"},{"en":"Her fieldcraft improved after weeks of training in the forest.","zh":"在森林里训练了几周后，她的野外技能（fieldcraft）提升了。"}]},{"partOfSpeech":"n.","definition":{"en":"General know-how for working in natural outdoor settings, such as tracking, camping, and navigating.","zh":"在自然户外环境中活动的通用本领，例如追踪、露营与辨识方向。"},"examples":[{"en":"Hunters often learn fieldcraft like tracking and reading signs.","zh":"猎人常会学习追踪、读懂踪迹等野外本领（fieldcraft）。"},{"en":"Fieldcraft is useful for anyone who hikes in remote areas.","zh":"对在偏远地区徒步的人来说，野外本领（fieldcraft）很有用。"}]}],"synonyms":["field skills","tactical skills","outdoor skills","woodcraft","bushcraft"],"phonetic":"/ˈfiːld.kræft/","extraExplanation":["fieldcraft 由 field（野外/战场）+ craft（技艺/手艺）组成，常见于英式军事英语，指“在野外执行任务所需的一整套技巧”。在美式英语里也能看到，但更常用的近义表达包括 tactical skills、field skills、land navigation 等。","在军语语境中，fieldcraft 往往包含 camouflage（伪装）、concealment（隐蔽）、movement discipline（行动纪律）、observation（观察）等；并不等同于单纯的 “survival skills（生存技能）”，而是更偏向“战术性的野外能力”。"]}
{"word":"fielded","summary":{"en":"“Fielded” most commonly means “sent out/put into play” (a team or lineup) or “handled/responded to” (questions or calls).","zh":"“fielded”常见含义是“派上场/派出（队伍、阵容）”，或“应对/处理（问题、电话）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often used in sports/media) describing a team, lineup, or group that has been put together and sent out to play, compete, or participate.","zh":"（常用于体育/媒体）指“已排出上场的、已派出的”队伍、阵容或人员。"},"examples":[{"en":"The coach fielded a young team for the friendly match.","zh":"教练在这场友谊赛中派出了一支年轻的队伍。"},{"en":"They fielded their strongest lineup in the final.","zh":"他们在决赛中派出了最强阵容。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “field”: to put someone or something into a game, competition, or position to respond; also to receive and handle questions or phone calls.","zh":"“field”的过去式/过去分词：指“派上场、派出（人员）”；也可指“接听并处理（问题/来电）”。"},"examples":[{"en":"She fielded questions from reporters after the announcement.","zh":"发布会后，她回答了记者的提问。"},{"en":"Our customer-service team fielded hundreds of calls today.","zh":"我们的客服团队今天接听并处理了数百个来电。"}]}],"synonyms":["sent out","deployed","put in","handled","answered","responded to"],"phonetic":"/ˈfiːldɪd/","extraExplanation":["“field”在体育里本义和“球场/场地（the field）”有关，因此“to field a team”就是“把队伍送上场”。在职场语境里，“field questions/calls”常带有“当场应对、妥善处理”的感觉。","写作中如果你看到“fielded”修饰名词（如 fielded team / fielded lineup），通常当作形容词理解；如果后面跟宾语（fielded questions / fielded calls），则是动词用法。"]}
{"word":"fielden","summary":{"en":"Fielden is mainly used as an English surname.","zh":"Fielden 主要用作英国姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), originally from England","zh":"姓氏（家族姓），源自英国"},"examples":[{"en":"Her last name is Fielden.","zh":"她的姓是 Fielden。"},{"en":"John Fielden was a 19th-century British politician and mill owner.","zh":"约翰·菲尔登（John Fielden）是19世纪的英国政治家和纺织厂主。"}]}],"phonetic":"/ˈfiːldən/","extraExplanation":["“Fielden”多见于英格兰北部（尤其是兰开夏一带）的姓氏。拼写看起来像由 field（田野）+ -en 构成，但现代英语里它主要作为专有名词（姓）使用，而不是常见词汇。"]}
{"word":"fielder","summary":{"en":"A fielder is usually a player who defends in the field in baseball/cricket; less commonly, it means an outside worker who gathers information.","zh":"fielder 通常指棒球/板球的守备队员；较少见时指外勤人员、跑现场收集信息的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a player in sports like baseball or cricket who plays in the field (not the pitcher/bowler or the main batter at that moment), trying to catch or stop the ball","zh":"（棒球、板球等）守备队员；在场地上负责接球、拦球、传球的球员（通常不指投手/投球手或正在击球的主攻者）"},"examples":[{"en":"The fielder caught the ball near the fence.","zh":"那名守备员在围栏附近接住了球。"},{"en":"She is a strong fielder with a quick throw.","zh":"她守备能力很强，传球也很快。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who works or collects information outside an office, especially in journalism or politics","zh":"（尤指新闻或政治领域）外勤人员；外出跑现场、收集信息的人"},"examples":[{"en":"The newspaper sent a fielder to interview people at the scene.","zh":"报社派了一名外勤记者去现场采访。"},{"en":"They hired fielders to gather opinions in different neighborhoods.","zh":"他们雇了外勤人员在不同社区收集意见。"}]}],"synonyms":["defender","fielding player","infielder","outfielder","field worker"],"phonetic":"/ˈfiːldɚ/","extraExplanation":["在美式英语里，fielder 最常见于棒球语境，泛指“守备员”。如果要更具体，可以说 infielder（内野手）和 outfielder（外野手）。","第二个含义较少见，多见于组织管理或媒体行业口语中，含义接近 field worker（外勤人员）或 on-the-ground reporter（驻现场记者）。"]}
{"word":"fielders","summary":{"en":"“Fielders” is the plural of “fielder,” usually meaning defensive players who field the ball in sports like baseball or cricket.","zh":"“fielders”是“fielder”的复数，通常指棒球或板球等运动中负责接球、拦球和传球的守备队员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A player in sports like baseball or cricket who plays defense by catching, stopping, and throwing the ball (not the pitcher/bowler or the batter).","zh":"（棒球、板球等运动中的）守备队员；负责接球、拦球并传球的防守球员（不包括投手/投球手或击球员）。"},"examples":[{"en":"The fielders moved in closer to stop a bunt.","zh":"守备队员往前靠近，以防对方短打。"},{"en":"A great catch by the fielders saved two runs.","zh":"守备队员一次精彩接杀，避免了两分失分。"}]},{"partOfSpeech":"n.","definition":{"en":"People who work in the field doing hands-on tasks, such as collecting data or doing inspections (often in phrases like “fielders” in a team).","zh":"（团队中的）一线外勤人员；在现场做实际工作的人（如采集数据、巡检等，常见于团队语境）。"},"examples":[{"en":"The company sent fielders to check the equipment at each site.","zh":"公司派外勤人员到各个站点检查设备。"},{"en":"Our fielders reported the same problem in three different neighborhoods.","zh":"我们的一线人员在三个不同社区都报告了同样的问题。"}]}],"synonyms":["defenders","fielding players","outfielders","infielders"],"phonetic":"/ˈfiːldɚz/","extraExplanation":["“fielder”最常见于棒球和板球语境：baseball 里指防守方除投手与捕手之外的其他守备位置（如 infielders 内野手、outfielders 外野手）。在美式英语里，单说 fielders 往往让人联想到棒球。"]}
{"word":"fieldfare","summary":{"en":"A fieldfare is a European thrush often seen in winter flocks.","zh":"fieldfare 指一种欧洲的鸫科鸟类（田鸫），冬季常成群出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a European thrush (a medium-sized songbird) with a gray head and brown back, often seen in flocks in winter","zh":"田鸫（欧洲的一种鸫科鸣禽，灰色头、棕色背，冬季常成群出现）"},"examples":[{"en":"We saw a flock of fieldfares feeding on berries in the hedgerow.","zh":"我们看到一群田鸫在树篱边啄食浆果。"},{"en":"Fieldfares often visit gardens in winter when food is scarce.","zh":"食物短缺时，田鸫常在冬天到花园里觅食。"}]}],"synonyms":["thrush","European thrush"],"phonetic":"/ˈfildˌfer/","extraExplanation":["“fieldfare”主要是英式英语中较常见的鸟类名称，指田鸫（学名 *Turdus pilaris*）。在自然观察、鸟类图鉴和文学描写冬季景象时会出现。","词源上，“fare”在古英语里有“旅行、行程”的意思，所以这个词常被解释为与“在田野间迁徙/游走的鸟”相关联。","相关词汇：thrush（鸫科鸟类的总称）、songbird（鸣禽）、flock（鸟群）、migratory（迁徙的）。"]}
{"word":"fieldfight","summary":{"en":"Fieldfight means a battle or fight that happens in an open field; it’s uncommon and often written as “field fight” or “field-fight.”","zh":"fieldfight 指在开阔地发生的战斗/野战；该拼写较少见，常写作 field fight 或 field-fight。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fight or battle that happens in an open field (not inside a building or fort); a pitched battle in the open.","zh":"（在开阔地、野外发生的）打斗；野战；（非城堡或建筑内的）会战。"},"examples":[{"en":"The two armies met for a fieldfight on the plain.","zh":"两军在平原上展开了一场野战。"},{"en":"In old war stories, a fieldfight often decides who controls the land.","zh":"在旧时的战争故事里，野战常常决定谁能控制土地。"}]},{"partOfSpeech":"v.","definition":{"en":"to fight in the open field; to engage in a battle outside fortified places (rare).","zh":"在野外作战；进行野战（较少见）。"},"examples":[{"en":"The commander refused to fieldfight and stayed behind the walls.","zh":"指挥官拒绝野外作战，选择坚守城墙。"}]}],"synonyms":["open-field battle","pitched battle","battle","skirmish (smaller fight)"],"phonetic":"/ˈfiːldˌfaɪt/","extraExplanation":["“fieldfight”不是现代英语里很常见的固定拼写；更常见的写法是 **field fight**（分开写）或 **field-fight**（加连字符），尤其在军事史、小说或翻译腔文本中。日常口语里通常直接说 **battle**, **fight in the open**, **open-field battle**。"]}
{"word":"fieldhouse","summary":{"en":"A large indoor sports building, especially on a school or university campus.","zh":"大型室内体育馆，尤指学校或大学校园内的体育设施。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large indoor sports building (often on a school or campus) used for games, practices, and physical education; sometimes it includes courts, a track, or training areas.","zh":"（多指学校或校园内的）大型室内体育馆，用于比赛、训练和体育课；有时包含球场、跑道或训练区。"},"examples":[{"en":"The basketball team practiced in the fieldhouse after school.","zh":"篮球队放学后在体育馆训练。"},{"en":"The university fieldhouse can hold thousands of fans.","zh":"这所大学的体育馆可以容纳成千上万名观众。"}]}],"synonyms":["gym","gymnasium","sports hall","arena (often larger)"],"phonetic":"/ˈfiːldˌhaʊs/","extraExplanation":["“Fieldhouse”主要是美式英语，常见于学校、大学或社区体育设施的语境中。虽然字面上有“field（场地）”，但它通常指室内馆，而不是露天球场。","在美国校园文化里，fieldhouse 常与校队比赛、校内活动、毕业典礼或大型集会联系在一起；不同学校的场馆命名也可能用“gym/gymnasium”“arena”“sports center”等。"]}
{"word":"fieldie","summary":{"en":"“Fieldie” is a rare informal word, usually meaning a fielder in sports or someone who works on-site in the field.","zh":"“fieldie”是少见的非正式用法，通常指运动中的守备队员，或指在现场/一线工作的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) A fielder; a player whose job is to field the ball in sports such as cricket or baseball.","zh":"（非正式、少见）守备队员；在板球或棒球等运动中负责接球、处理来球的球员。"},"examples":[{"en":"Put your best fieldie at cover if the batter hits hard.","zh":"如果击球手力量很大，就把你最好的守备队员放在掩护位。"},{"en":"He’s a quick fieldie with safe hands.","zh":"他是个反应快、接球稳的守备队员。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, rare) Someone who works out in the field (doing practical, on-site work) rather than in an office.","zh":"（非正式、少见）在一线/现场工作的人（相对于坐办公室的人）。"},"examples":[{"en":"Ask a fieldie what customers actually need before you change the plan.","zh":"在你改计划前，先问问一线人员客户真正需要什么。"},{"en":"The fieldies reported the equipment problem right away.","zh":"一线人员立刻报告了设备问题。"}]}],"synonyms":["fielder","field worker","field staff"],"phonetic":"/ˈfiːldi/","extraExplanation":["“fieldie”不是常见标准英语词，更多像口语/地区性用法或昵称式表达。在很多语境里，人们更常说“fielder”（守备员）或“field worker/field staff”（现场工作人员）。如果你是在某篇文章或对话里看到它，告诉我上下文，我可以更准确判断它指的是哪一种。"]}
{"word":"fielding","summary":{"en":"Fielding most commonly means defensive play in sports (catching/stopping/throwing the ball), and it can also mean handling questions or requests, especially from the public or media.","zh":"Fielding 最常指体育中的守备（接球、拦截与传球），也可指在公开或媒体场合应对、回应问题或请求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or skill of catching, stopping, and throwing the ball while playing defense in sports such as baseball or cricket","zh":"（棒球、板球等运动中的）守备；接球、拦截与传球的技巧与表现"},"examples":[{"en":"Her fielding saved two runs in the last inning.","zh":"她的守备在最后一局阻止了对方得到两分。"},{"en":"The coach praised the team’s fielding as much as their batting.","zh":"教练称赞球队的守备表现不亚于打击。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity of answering questions or dealing with requests, especially in public or in the media","zh":"（尤指公开或媒体场合）应对、回应（问题或请求）的行为"},"examples":[{"en":"After the announcement, she spent an hour fielding questions from reporters.","zh":"发布消息后，她花了一个小时回应记者的提问。"}]}],"synonyms":["defense","defensive play","handling","dealing with","answering (questions)"],"phonetic":"/ˈfiːldɪŋ/","extraExplanation":["“fielding”最常见于体育语境：在美式英语里常指棒球的“守备”，在英联邦国家也常用于板球（cricket）。与之相对的进攻端常用“batting”（击球）。","在日常/职场语境里，“fielding questions”是很常见的固定搭配，表示“（在会议、发布会等）回答/应对问题”，语气比“answer”更强调连续应对、处理各种提问。","“Fielding”也可作姓氏（如英国小说家 Henry Fielding），但作为词汇学习时通常先掌握上述两种常用名词义。"]}
{"word":"fieldish","summary":{"en":"Fieldish means “somewhat like a field/countryside” or “a bit related to outdoor, on-site work,” usually in informal English.","zh":"Fieldish 指“有点像田野/乡间的感觉”，也可指“有点偏户外、现场（实地）工作的”，多用于非正式英语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat like a field; having the look or feeling of open countryside (often used informally).","zh":"有点像田野的；带有开阔乡间气息的（常为非正式用法）。"},"examples":[{"en":"The park feels surprisingly fieldish in the early morning, before the crowds arrive.","zh":"清晨人还不多时，这座公园意外地很有田野的感觉。"},{"en":"They chose a fieldish spot outside town for the picnic.","zh":"他们选了城外一个很有乡野气息的地方野餐。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to work done outdoors or in real-world conditions rather than in an office or laboratory.","zh":"与野外/现场工作有关的；指在真实环境中进行，而非在办公室或实验室里。"},"examples":[{"en":"The job is a bit fieldish—you’ll travel to sites and collect samples.","zh":"这份工作有点偏现场——你要去不同地点采集样本。"},{"en":"She prefers fieldish research because she likes talking to people face-to-face.","zh":"她更喜欢偏田野/实地的研究，因为她喜欢和人面对面交流。"}]}],"synonyms":["rural","pastoral","countrified","outdoorsy","field-based"],"phonetic":"/ˈfiːl.dɪʃ/","extraExplanation":["“-ish”是英语里很常见的后缀，意思是“有点……、带点……的”。所以 fieldish 往往带有“差不多像田野/户外那种感觉”的语气，听起来比较随意、口语化。","fieldish 不是高频标准词，更常见的表达有: rural（乡村的）, pastoral（田园的）, outdoorsy（喜欢户外的）, field-based（以现场/实地为主的）。在正式写作中通常会用这些更常见的词。"]}
{"word":"fieldleft","summary":{"en":"“fieldleft” usually means the left side of a sports field, especially “left field” in baseball.","zh":"“fieldleft”通常指体育场地的左侧区域，尤指棒球的“左外野（left field）”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the left side of a sports field (especially in baseball), or the area called “left field.”","zh":"（体育场地的）左侧区域；尤指棒球的“左外野/左外场”（left field）。"},"examples":[{"en":"He hit a fly ball to left field.","zh":"他击出一个高飞球到左外野。"},{"en":"The coach told her to play in left field today.","zh":"教练让她今天守左外野。"}]},{"partOfSpeech":"phrase","definition":{"en":"(cricket/general) the area on the left side of the field from the batter’s viewpoint; sometimes used informally to describe a fielder positioned there.","zh":"（板球/泛指）从击球者视角看球场左侧的区域；口语中也可指站在该区域的守场员位置。"},"examples":[{"en":"Place a fielder on the left side to stop singles.","zh":"在左侧布置一名守场员来阻止对方打一分。"},{"en":"Most of the shots went toward the left side of the field.","zh":"大多数击球都朝球场左侧过去。"}]}],"synonyms":["left field","the left side of the field","left side"],"phonetic":"/ˈfiːld ˌlɛft/","extraExplanation":["“fieldleft”并不是最常见的标准拼写。更常见的写法是分开写 **field left**，或在棒球语境中直接用 **left field**（左外野）。如果你是在看比赛数据/站位图，可能是把两个词连在一起的标签。"]}
{"word":"fieldman","summary":{"en":"Fieldman usually means an outdoor field worker, and sometimes a sports fielder.","zh":"Fieldman通常指在户外田野作业的工作人员；有时也指体育比赛中的守备员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works outdoors in fields, especially doing practical work such as farming, surveying, or field operations for a company.","zh":"在户外田野里工作的人，尤指从事农业、测量或公司外勤作业等实际工作的人。"},"examples":[{"en":"The fieldman checked the crops and reported the damage after the storm.","zh":"这位田间工作人员检查了庄稼，并在暴风雨后汇报了受损情况。"},{"en":"They sent a fieldman to measure the land before building the road.","zh":"他们派了一名外勤人员在修路前测量土地。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports) A player whose main job is to field the ball; a fielder.","zh":"（体育）主要负责接球、守备的队员；守备员。"},"examples":[{"en":"He was a quick fieldman and saved several runs.","zh":"他是一名动作敏捷的守备员，挽救了好几分。"},{"en":"The captain placed the fieldman closer to the boundary.","zh":"队长把守备员安排得更靠近边界线。"}]}],"synonyms":["field worker","outdoor worker","surveyor (context-dependent)","fielder"],"phonetic":"/ˈfildmən/","extraExplanation":["“fieldman”在现代英语里不算常见，更常用的说法是“field worker”（外勤人员/田间工作人员）或在体育语境中用“fielder”（守备员）。","在部分英式英语或板球语境中，你也可能看到更常见的形式“fieldsman”（守备员）。"]}
{"word":"fieldmen","summary":{"en":"“Fieldmen” is the plural of “fieldman,” meaning either outdoor field workers or (especially in cricket) players who are fielding.","zh":"“fieldmen”是“fieldman”的复数，可指在野外/田间工作的人员，也可（尤指板球）指守备队员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “fieldman”: a person who works outdoors in the field (for example in farming, surveying, or field research).","zh":"“fieldman”的复数：在野外/田间工作的人（如农业、测量或野外研究）。"},"examples":[{"en":"The fieldmen started work at sunrise to avoid the midday heat.","zh":"这些田间工人日出就开工，以避开正午的炎热。"},{"en":"We hired more fieldmen to collect samples during the field season.","zh":"在野外作业季，我们雇了更多外业人员来采集样本。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports, especially cricket) Players who are fielding (defending), not batting; plural of “fieldman.”","zh":"（体育，尤指板球）守备队员；“fieldman”的复数。"},"examples":[{"en":"Two fieldmen moved closer to the batter to catch a quick edge.","zh":"两名守备队员靠近击球手，准备接住擦边球。"},{"en":"The captain positioned the fieldmen to protect the boundary.","zh":"队长布置守备队员站位，以防球越界得分。"}]}],"synonyms":["fieldworkers","field hands","farmhands","fielders"],"phonetic":"/ˈfiːld.mən/","extraExplanation":["“fieldman”在现代英语里不算常用词。表示“野外工作人员”时，更常见的说法是 field worker / fieldworker（外业人员、实地工作人员）或 farmhand（农场工人）。","在板球语境里，“fieldman”指守备队员（fielder）。因此在体育新闻或解说中，你更常看到 fielder(s) 而不是 fieldman/fieldmen。","拼写提示：单数 fieldman，复数 fieldmen（类似 man → men）。"]}
{"word":"fieldmice","summary":{"en":"Fieldmice are small wild mice that live in fields or farmland.","zh":"Fieldmice 指生活在田野或农田里的小型野生老鼠（田鼠/野鼠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small wild mice that live in fields, grasslands, or farmland (plural of “field mouse”).","zh":"田鼠；野鼠（生活在田野、草地或农田里的小型野生老鼠；“field mouse”的复数）"},"examples":[{"en":"In autumn, fieldmice collect seeds and hide them in burrows.","zh":"秋天，田鼠会收集种子并把它们藏在洞里。"},{"en":"The farmer noticed fieldmice in the barn after the harvest.","zh":"收割后，农夫注意到谷仓里有田鼠。"},{"en":"Owls often hunt fieldmice at dusk.","zh":"猫头鹰常在黄昏时捕食田鼠。"}]}],"synonyms":["field mice","field mouse (singular)","wild mice"],"phonetic":"/ˈfiːldˌmaɪs/","extraExplanation":["“field mouse”在日常英语里常泛指住在野外、田地里的小鼠，并不一定对应某一种严格的生物学物种；不同地区也可能指不同的鼠类。","你写的“fieldmice”是复数形式的连写；更常见的写法是分开写：field mice。文学里有时会用“field mouse”营造朴素、乡野的意象，例如把它当作自然界中渺小却顽强的生命来描写。"]}
{"word":"fieldmouse","summary":{"en":"A fieldmouse is a small wild mouse that lives in fields or grassy farmland.","zh":"fieldmouse 指生活在田野或草地农田里的小型野鼠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small mouse that lives outdoors in fields, grass, or farmland (often a wild mouse rather than a pet).","zh":"田鼠；野鼠（生活在田野、草地或农田里的小老鼠，通常指野生的）"},"examples":[{"en":"A fieldmouse darted into the tall grass when we got close.","zh":"我们一走近，一只田鼠就窜进了高草里。"},{"en":"Owls often hunt fieldmice at night.","zh":"猫头鹰常在夜里捕食田鼠。"}]}],"synonyms":["field mouse","wood mouse (BrE, sometimes)","wild mouse"],"phonetic":"/ˈfildˌmaʊs/","extraExplanation":["“fieldmouse”也常写作两词 field mouse。在英式英语里，field mouse 有时特指一种小型野鼠（如 Apodemus sylvaticus，常译“林姬鼠/林鼠”），而在日常英语中它常泛指生活在田野里的小老鼠。","在文学中，“fieldmouse”常被用来营造乡野、朴素或脆弱的意象（例如描写农田、草丛、夜间捕食等场景）。"]}
{"word":"fieldName","summary":{"en":"“field name” means the label or identifier used to name a data field, especially in forms and programming.","zh":"“field name”指用于给数据字段命名的标签或标识符，常见于表单与编程/数据库中。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(computing) The name/label of a data field in a form, database, or file (often used in programming as an identifier, e.g., fieldName).","zh":"（计算机）数据字段在表单、数据库或文件中的名称/标签（在编程中常作为标识符，例如 fieldName）。"},"examples":[{"en":"Please enter your email in the field name “Email Address.”","zh":"请在字段名为“Email Address（邮箱地址）”的输入框里填写你的邮箱。"},{"en":"In the JSON file, the fieldName \"userId\" must be unique.","zh":"在这个 JSON 文件里，字段名“userId”必须是唯一的。"},{"en":"Our database column field name is \"created_at.\"","zh":"我们数据库的列字段名是“created_at”。"}]}],"synonyms":["attribute name","property name","key name","column name","parameter name"],"phonetic":"/ˈfiːld ˌneɪm/","extraExplanation":["在界面/表单里，field name 常指“字段标签”（用户看到的文字）；在数据库/代码里更常指“字段/属性的标识符”（开发者使用的名字）。两者有时不同：例如界面显示“Email Address”，代码里可能用 email 或 emailAddress。","你输入的 fieldName 属于常见的命名风格 camelCase（驼峰式命名）：第一个词小写，后续每个词首字母大写，如 userName、phoneNumber。其他常见风格还有 snake_case（如 created_at）和 PascalCase（如 UserName）。"]}
{"word":"fieldpiece","summary":{"en":"Fieldpiece means a piece of equipment used on-site, and it can also mean a field artillery gun in military contexts.","zh":"fieldpiece 可指现场/野外作业用的设备或工具；在军事语境中也可指野战火炮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tool or piece of equipment designed to be used outdoors or on-site (in the field), especially for technical or scientific work","zh":"（现场用的）工具；野外/工地用设备（尤指技术或科学现场作业用）"},"examples":[{"en":"The technician packed a fieldpiece to measure temperature and pressure on the job site.","zh":"技术员带上了一件现场工具，在工地测量温度和压力。"},{"en":"Bring a reliable fieldpiece when you collect data outside the lab.","zh":"在实验室外采集数据时，带上一件可靠的现场设备。"}]},{"partOfSpeech":"n.","definition":{"en":"(military) a piece of artillery used in the field; a field gun","zh":"（军事）野战火炮；野战炮"},"examples":[{"en":"The museum displays an old fieldpiece from the 1800s.","zh":"博物馆展出了一门19世纪的旧式野战火炮。"},{"en":"In the story, the army moved its fieldpieces to higher ground.","zh":"在故事中，军队把野战火炮转移到更高的地势。"}]}],"synonyms":["field instrument","field tool","portable meter","field gun","artillery piece"],"phonetic":"/ˈfiːldˌpiːs/","extraExplanation":["“fieldpiece”是由field（野外/现场）+ piece（器具/一件装备）组成的复合名词。现代日常英语里更常说“field tool”“field instrument”“portable meter”等；“fieldpiece”更像较泛的描述或在特定行业/品牌语境中出现。","军事义里的“fieldpiece”较偏历史或文学用法，现代更常用“field gun”“artillery piece”。"]}
{"word":"fieldpieces","summary":{"en":"Fieldpieces are mobile cannons used by an army in open-field battles.","zh":"fieldpieces 指军队在野战中使用、可机动部署的火炮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of artillery (a cannon or gun) designed to be moved and used in battle away from a fortress; mobile battlefield artillery.","zh":"野战炮；可在战场上机动使用的火炮（非要塞固定炮）。"},"examples":[{"en":"The army moved its fieldpieces up the hill before dawn.","zh":"军队在黎明前把野战炮推进了山坡。"},{"en":"In the museum, you can see old fieldpieces used in 19th-century wars.","zh":"在博物馆里，你可以看到19世纪战争中使用过的旧式野战炮。"}]}],"synonyms":["cannon","artillery piece","gun","field gun"],"phonetic":"/ˈfiːldˌpiːs/","extraExplanation":["“fieldpiece”常写作两词 field piece；复数为 fieldpieces / field pieces。","它多出现在历史、军事叙述中，强调火炮能随军队在“野外/战场（the field）”机动部署，而不是城堡或海军舰船上的炮。"]}
{"word":"fields","summary":{"en":"“Fields” most often means areas of farmland or open land, and it can also mean areas of study/work (fields of knowledge). As a verb, “field” means to handle questions, deploy a team, or play defense in ball sports.","zh":"“fields”最常指田地/原野，也可指学习或工作的领域/学科。作动词时，“field”可表示应对提问、派出队伍或在球类运动中防守接球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Open land used for farming or pasture; an area of grass or crops.","zh":"（农田、牧场等）田地；一片用于耕作或放牧的开阔地。"},"examples":[{"en":"Cows were grazing in the fields behind the barn.","zh":"牛在谷仓后面的牧场里吃草。"},{"en":"After the rain, the fields turned bright green.","zh":"下雨后，田野变得一片翠绿。"}]},{"partOfSpeech":"n.","definition":{"en":"A subject area of study or work; a discipline.","zh":"（学习或工作的）领域；学科；行业。"},"examples":[{"en":"She works in the field of education.","zh":"她在教育领域工作。"},{"en":"Medicine is a highly competitive field.","zh":"医学是一个竞争非常激烈的领域。"}]},{"partOfSpeech":"n.","definition":{"en":"An area where a force acts, such as a magnetic, electric, or gravitational field.","zh":"（物理）场；力起作用的区域，如磁场、电场或引力场。"},"examples":[{"en":"A magnet creates a magnetic field around it.","zh":"磁铁周围会产生磁场。"}]},{"partOfSpeech":"n.","definition":{"en":"All the people or teams competing in an event (especially in sports).","zh":"（比赛的）参赛者总称；全体选手（尤指体育）。"},"examples":[{"en":"The runner finished ahead of the rest of the field.","zh":"这名跑者领先其他所有选手到达终点。"}]},{"partOfSpeech":"vt.","definition":{"en":"To answer and handle a question or problem (often quickly and confidently).","zh":"（迅速、从容地）应对；回答；处理（问题/提问）。"},"examples":[{"en":"The spokesperson fielded tough questions from reporters.","zh":"发言人从容应对了记者的尖锐提问。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put a player or team into a game; to deploy.","zh":"派上场；派出（队员/队伍）。"},"examples":[{"en":"They fielded a young team this season.","zh":"他们本赛季派出了一支年轻的队伍。"}]},{"partOfSpeech":"v.","definition":{"en":"To play defense by catching and throwing the ball, especially in baseball or cricket.","zh":"（棒球/板球等）防守；接球并传球。"},"examples":[{"en":"He fielded the ball cleanly and threw to first base.","zh":"他稳稳接住球并传向一垒。"}]}],"synonyms":["farmland","pasture","meadow","area","domain","discipline","specialty","handle","address","deploy"],"phonetic":"/fiːldz/","extraExplanation":["“field(s)”在日常英语里最常见的两个意思是“田地/野外”和“领域/学科”。比如：in the field 常指“在野外（做研究/工作）”，也常指“在该行业里/在该领域”。需要看上下文判断。","学术写作里常用：a field of study（研究领域）。口语里也常说：That’s not my field.（那不是我的专业/我不擅长那个。）"]}
{"word":"fields be planted with trees","summary":{"en":"land having trees planted on it","zh":"（土地）被种上树"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Passive construction) Used to say that land or fields have trees put into the ground and grown there (often as part of planting, reforestation, or creating an orchard).","zh":"（被动结构）表示土地或田地上被种上树并让其生长，常用于造林、绿化或建果园等语境。"},"examples":[{"en":"The fields were planted with trees to prevent soil erosion.","zh":"这些田地被种上了树，以防止水土流失。"},{"en":"After the flood, large areas of farmland were planted with trees instead of crops.","zh":"洪水过后，大面积农田改种了树，而不是农作物。"},{"en":"In this region, many old fields are planted with fruit trees.","zh":"在这个地区，许多旧田地被种上了果树。"}]}],"synonyms":["be planted with","be filled with","be covered with","be set with","reforest"],"phonetic":"/bi ˈplæntɪd wɪð triz/","extraExplanation":["你写的“fields be planted with trees”不完整：英语里通常需要系动词的正确形式，如：\n- Fields are planted with trees.（一般事实/现在）\n- The fields were planted with trees.（过去发生）\n如果是命令/建议，可用：Let the fields be planted with trees. 或 Fields should be planted with trees.（更常见）","“plant … with …”与“plant … in …”的区别：\n- plant the field with trees：强调“用树把这块地种满/覆盖”（关注“填充什么”）\n- plant trees in the field：强调“地点在田里”（关注“在哪里”）"],"etymology":"“plant”来自拉丁语 plantare，原意与“插枝/栽种”有关；英语里“be planted with + 名词”是常见被动表达，用来强调“被种上……”。","mnemonic":["把“be planted with”理解成中文固定搭配“被……种上/种满……”。看到 with 就联想到“用……来种（填满）”。","with≈“用/配上”：field is planted with trees＝田地“配上”树＝种树造林。"]}
{"word":"fieldsman","summary":{"en":"A fieldsman is usually a fielder in sports (especially cricket); less commonly, it can mean a person who works in fields.","zh":"fieldsman通常指球类运动中的守备员（尤指板球）；较少见时也可指在田地里工作的劳动者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A player who fields the ball (a fielder), especially in cricket; sometimes used generally for baseball/softball.","zh":"（接球手）在球类运动中负责防守、接球与阻止对方得分的球员；尤用于板球（cricket），也可泛指棒球/垒球的守备员。"},"examples":[{"en":"He’s one of the best fieldsmen on the team, quick and reliable in the outfield.","zh":"他是队里最优秀的守备员之一，在外野反应快又稳。"},{"en":"The captain moved a fieldsman closer to the batter to catch an easy shot.","zh":"队长把一名守备员调到更靠近击球手的位置，好接住一记容易的球。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who works outdoors in fields, especially for agriculture (less common than “field worker” or “farmhand”).","zh":"在田地里工作的人，尤指从事农业劳动者（不如“field worker / farmhand”常用）。"},"examples":[{"en":"The fieldsmen started early to avoid the afternoon heat.","zh":"田间工人一大早就开工，以避开下午的高温。"},{"en":"During harvest season, the farm hired extra fieldsmen.","zh":"收获季节，农场雇了更多的田间工人。"}]}],"synonyms":["fielder","fielding player","outfielder","field worker","farmhand"],"phonetic":"/ˈfildz.mən/","extraExplanation":["“fieldsman”更常见于英式英语语境，尤其是板球（cricket）报道中，等同于“fielder”。在美式英语里，谈棒球/垒球通常直接说“fielder”，而不是“fieldsman”。","这个词也偶尔被用来指“田间劳动者”，但日常英语里更自然的说法通常是“field worker”“farm worker”或“farmhand”。"]}
{"word":"fieldsmen","summary":{"en":"“Fieldsmen” means the players who field the ball in sports (plural of “fieldsman”).","zh":"“Fieldsmen”指守场员（“fieldsman”的复数），即在运动中负责接球、拦球和回传的队员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who field (catch and stop the ball) in sports such as cricket or baseball; plural of “fieldsman.”","zh":"（板球、棒球等运动中的）守场员；“fieldsman”的复数。"},"examples":[{"en":"The fieldsmen moved closer when the batter started hitting softly.","zh":"当击球员开始轻打时，守场员们站得更近了。"},{"en":"In cricket, good fieldsmen can save many runs with quick throws.","zh":"在板球里，优秀的守场员可以用快速回传挡下许多得分。"}]}],"synonyms":["fielders","defenders"],"phonetic":"/ˈfiːldz.mən/","extraExplanation":["“Fieldsman”在英式英语和板球语境中更常见；美式英语里更常说“fielder(s)”。在棒球中通常用“fielders”，包括infielders（内野手）和outfielders（外野手）。","板球里“fieldsman/fieldsmen”指除投球手（bowler）和守门员（wicket-keeper）之外，负责接球、拦球、回传的场上队员；也可泛指所有防守队员。"]}
{"word":"fieldstone","summary":{"en":"Fieldstone is natural stone found in fields and commonly used to build rustic walls or buildings.","zh":"Fieldstone 指田地里捡到的天然石头，常用来建造乡村风格的墙或房屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural stone (often rounded) used for building walls, houses, or fences, usually without much shaping.","zh":"（常为圆润的）天然石头，用于砌墙、建房或做围栏，通常不怎么加工。"},"examples":[{"en":"The old farmhouse was built of fieldstone and wood.","zh":"那座老农舍是用田野石和木头建成的。"},{"en":"They repaired the garden wall with fieldstone collected from the nearby fields.","zh":"他们用从附近田地里捡来的田野石修补花园围墙。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of fieldstone; built using natural, rough stones.","zh":"由田野石制成的；用天然粗石建造的。"},"examples":[{"en":"A fieldstone wall lined the driveway.","zh":"车道旁是一道田野石砌成的墙。"},{"en":"The inn has a cozy fieldstone fireplace.","zh":"这家旅馆有一个温馨的田野石壁炉。"}]}],"synonyms":["rubble stone","natural stone"],"phonetic":"/ˈfiːldˌstoʊn/","extraExplanation":["在北美与欧洲乡村语境里，fieldstone 常指从农田里捡出的石头（耕作时会清理出来），直接用于砌墙或做地基。与 cut stone（切割整形石材）或 brick（砖）相比，它更“自然、粗犷、乡村风”。","常见搭配：fieldstone wall（田野石墙）、fieldstone foundation（田野石地基）、fieldstone farmhouse（田野石农舍）、fieldstone fireplace（田野石壁炉）。"]}
{"word":"fieldstones","summary":{"en":"Fieldstones are natural stones found in fields and commonly used for rustic building, especially stone walls.","zh":"Fieldstones指田地里捡出的天然石块，常用于朴素建筑材料，尤其是砌石墙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stones gathered from fields (often removed to clear land) and used for building walls, foundations, or rustic structures.","zh":"田间石（从农田里捡出、清理出来的石头，常用来砌墙、做地基或建造朴素建筑）。"},"examples":[{"en":"The farmer piled the fieldstones along the edge of the field to make a boundary wall.","zh":"农夫把田间石堆在田地边上，砌成一堵界墙。"},{"en":"Old New England stone walls were often built from fieldstones cleared from the soil.","zh":"新英格兰地区的老石墙常用从土地里清出来的田间石砌成。"}]}],"synonyms":["stones","field rocks","building stones","wall stones"],"phonetic":"/ˈfiːldstoʊnz/","extraExplanation":["“fieldstones”通常指未经切割加工的天然石块（rough, uncut stones），与切割整齐的“cut stone/ashlar”形成对比，因此常带有“乡村、质朴、传统”的风格联想。","在北美与欧洲部分地区，农民耕地时会不断捡出石头，久而久之就形成了大量用fieldstones砌成的石墙（stone walls），这在文学与地方叙事中常被用来象征“土地的历史、劳动与边界”。相关文化意象可联想到罗伯特·弗罗斯特（Robert Frost）的诗《Mending Wall》里关于石墙与邻里边界的讨论。"]}
{"word":"fieldstrip","summary":{"en":"“Fieldstrip” means to take a firearm apart into its main components for basic cleaning and maintenance (not a full disassembly).","zh":"“Fieldstrip”指把枪械等拆成主要部件进行基本清洁与保养（不是完全拆解）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take a firearm (or similar device) apart into its main parts for basic cleaning, inspection, or maintenance, without fully disassembling it","zh":"（对枪械等）进行战地分解；将其拆成主要部件以便基本清洁、检查或保养（非完全拆解）"},"examples":[{"en":"Before going to the range, he fieldstripped his pistol and checked the barrel.","zh":"去靶场前，他把手枪战地分解，检查了枪管。"},{"en":"The instructor showed us how to fieldstrip the rifle safely.","zh":"教官给我们演示了如何安全地对步枪进行战地分解。"}]},{"partOfSpeech":"vt.","definition":{"en":"basic disassembly of equipment in the field for quick maintenance (less common, broader use)","zh":"（较少见）在野外对装备进行快速拆解维护"},"examples":[{"en":"On the expedition, they had to fieldstrip the stove to remove dirt and soot.","zh":"在探险途中，他们不得不把炉子快速拆开，清理泥土和烟灰。"}]}],"synonyms":["strip down","disassemble","break down","take apart"],"phonetic":"/ˈfiːldˌstrɪp/","extraExplanation":["“Fieldstrip/field strip”最常见于枪械语境，源于“field（野外/战地）+ strip（拆开）”，强调在条件有限的情况下做“基础拆解”，通常不涉及更深层的零件拆卸。","出于安全与文化敏感性：真实操作需严格遵循当地法律与专业安全规范（例如确认空仓/无弹、移除弹匣、枪口指向安全方向等）。"]}
{"word":"fieldward","summary":{"en":"Fieldward means “toward the field” or “on the field side,” mainly used in descriptive or sports contexts.","zh":"fieldward 表示“朝向场地”或“在靠场地的一侧”，多见于描写性文字或体育语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the field (away from the building, boundary, or center), especially in sports contexts.","zh":"朝向场地的（远离建筑物、边界或中心），尤用于体育语境。"},"examples":[{"en":"The ball rolled fieldward, away from the stands.","zh":"球朝场地方向滚去，远离看台。"},{"en":"The fielder took a few steps fieldward to cut off the pass.","zh":"防守队员朝场地方向迈了几步来拦截传球。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located on or facing the field side; relating to the side toward the field.","zh":"位于或朝向场地一侧的；与场地方向那一侧有关的。"},"examples":[{"en":"They sat in a fieldward section of the stadium.","zh":"他们坐在体育场靠场地一侧的区域。"},{"en":"Keep your shoulder fieldward as you turn.","zh":"转身时让你的肩膀朝向场地方向。"}]}],"synonyms":["toward the field","fieldwards","on the field side","toward the outfield"],"phonetic":"/ˈfiːldwɚd/","extraExplanation":["“fieldward”是比较少见的词，更常见的说法是“toward the field / toward the outfield / onto the field”。在英式体育（如板球、足球）或较书面/描述性的叙述中偶尔会出现，用来强调“朝场地那边”的方向或位置。词形上相当于“field + -ward”（表示“朝……方向”，如 homeward, northward）。"]}
{"word":"fieldwards","summary":{"en":"“Fieldwards” means “toward the fields,” a rare/old-fashioned direction word.","zh":"“fieldwards”意为“朝向田野（向外）”，较少见，偏古旧或文学用法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"toward the fields; outward away from buildings or a town (rare, somewhat old-fashioned).","zh":"朝向田野；向外、远离建筑物或城镇（较少见，略带古旧/文学色彩）。"},"examples":[{"en":"The children ran fieldward, laughing as they left the village behind.","zh":"孩子们笑着向田野跑去，把村庄甩在身后。"},{"en":"He looked fieldward and saw a thin line of trees moving in the wind.","zh":"他朝田野方向望去，看见一排细细的树在风中摇动。"}]},{"partOfSpeech":"other","definition":{"en":"the plural form of “fieldward,” used when describing multiple movements or directions (very rare).","zh":"“fieldward”的复数形式，用于描述多个动作或方向（非常少见）。"},"examples":[{"en":"Their paths bent fieldwards, away from the road.","zh":"他们的路径向田野方向弯去，离开了大路。"}]}],"synonyms":["toward the fields","out into the fields","outward","away from town"],"phonetic":"/ˈfiːldwɚdz/","extraExplanation":["“fieldward(s)”多见于较旧的文学或描写性文字里，用来营造“从人居/城镇走向开阔自然”的画面感。现代英语中更常用的说法是 “toward the fields,” “out into the fields,” 或 “away from town.”","词形上它由 field（田野）+ -ward（表示“朝……方向”）构成，类似的词还有 “homeward（回家方向）”“seaward（向海）”。"]}
{"word":"fieldwork","summary":{"en":"Fieldwork is practical on-site work—especially research or data collection done in real-world settings, not in an office or classroom.","zh":"fieldwork 指在真实现场进行的实践性工作，尤其是为研究收集一手资料的实地工作（非办公室或课堂内）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Practical work done outside a classroom, office, or laboratory to collect information, observe, interview people, or gather samples—often for research or study.","zh":"（为研究或学习而进行的）实地工作；到现场收集资料、观察、访谈或采样等。"},"examples":[{"en":"The students did fieldwork to record birdsong in the wetland.","zh":"学生们做了实地工作，在湿地录制鸟鸣。"},{"en":"Her fieldwork included interviewing local shop owners about tourism.","zh":"她的实地工作包括采访当地店主，了解旅游业情况。"},{"en":"Before writing the report, we spent two weeks doing fieldwork in the village.","zh":"写报告前，我们在村里做了两周的实地调查。"}]},{"partOfSpeech":"n.","definition":{"en":"Work done on site in a job (for example, construction, engineering, or maintenance), rather than work done in an office.","zh":"（工作中的）现场作业；在工地/现场完成的工作（相对于办公室工作）。"},"examples":[{"en":"Most of the engineer’s time is spent on fieldwork, checking equipment at different sites.","zh":"这位工程师的大部分时间都在现场作业，到不同地点检查设备。"},{"en":"Fieldwork can be physically demanding, so wear proper safety gear.","zh":"现场作业可能很耗体力，所以要穿戴好安全防护装备。"}]}],"synonyms":["on-site work","site work","field research","field study"],"phonetic":"/ˈfiːldˌwɝːk/","extraExplanation":["“fieldwork”通常是不可数名词（do fieldwork），也可以用作可数名词（a fieldwork project）。在学术语境里常见于人类学（anthropology）、社会学、地理学、生态学等：强调“到现场获得一手资料”，与“desk research / lab work（案头/实验室研究）”形成对比。","常用搭配：do/conduct fieldwork（进行实地工作），fieldwork data/notes（田野数据/笔记），fieldwork site（田野点/实地地点）。在文学与纪实写作里，“fieldwork”常带有深入社区、观察与记录现实生活的意味。"]}
{"word":"fieldworker","summary":{"en":"A fieldworker is someone who does work or research in real-world settings outside an office, often collecting information directly from people or the environment.","zh":"fieldworker 指在办公室外到真实现场开展工作或研究的人，常直接向人群或环境收集信息。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works outside an office to collect information or do practical work directly in the community, environment, or real-world setting.","zh":"（在现场/基层）工作人员：在办公室外直接到社区、环境或实际场景中收集信息或开展实际工作的人。"},"examples":[{"en":"The fieldworker visited villages to interview residents about water access.","zh":"这位现场工作人员走访村庄，采访居民了解用水情况。"},{"en":"As a fieldworker, she spends most of her time outdoors collecting samples.","zh":"作为外业工作人员，她大部分时间都在户外采集样本。"}]},{"partOfSpeech":"n.","definition":{"en":"A researcher (especially in anthropology or sociology) who conducts fieldwork by observing and interacting with people in their everyday lives.","zh":"（尤指人类学/社会学的）田野研究者：通过在真实生活场景中观察并与人互动来进行田野调查的研究人员。"},"examples":[{"en":"The fieldworker lived with the community for six months to understand local customs.","zh":"这位田野研究者与当地社区同住六个月，以了解当地习俗。"},{"en":"Good fieldworkers take careful notes and ask respectful questions.","zh":"优秀的田野研究者会认真做记录，并提出尊重他人的问题。"}]}],"synonyms":["field agent","research assistant","survey worker","field researcher"],"phonetic":"/ˈfiːldˌwɝːkɚ/","extraExplanation":["“fieldworker”由 field（现场、野外）+ worker（工作者）组成，常见于“fieldwork（田野/外业工作）”语境。它强调“到现场去做”，与 office worker（办公室人员）形成对比。","学术语境里（尤其人类学），fieldworker 往往带有长期驻地、参与式观察（participant observation）的意味；在公共卫生、NGO、市场调研等领域，则更偏向上门走访、问卷访谈、数据采集等工作。"]}
{"word":"fieldworkers","summary":{"en":"Fieldworkers are people who work in the field (on-site), often collecting data or providing services directly in communities.","zh":"Fieldworkers 指在现场/基层一线工作的人员，常负责实地收集资料或直接向社区提供服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job involves working outside an office or laboratory, especially collecting information, doing surveys, or providing services directly in the community.","zh":"在户外或基层工作的人，尤指在社区一线收集信息、做调查或直接提供服务的工作人员。"},"examples":[{"en":"The fieldworkers visited each village to interview residents.","zh":"外勤人员走访每个村庄采访居民。"},{"en":"During the election, fieldworkers knocked on doors and registered new voters.","zh":"在选举期间，外勤人员挨家挨户敲门，帮助新选民登记。"},{"en":"Public health fieldworkers tracked contacts to prevent further infections.","zh":"公共卫生一线工作人员追踪密接者以防止进一步感染。"}]},{"partOfSpeech":"n.","definition":{"en":"In social sciences (such as anthropology or sociology), people who do “fieldwork,” meaning they observe, interview, and record real-life behavior and culture in the place being studied.","zh":"（社会科学中，如人类学、社会学）做“田野调查/实地研究”的人：在研究现场观察、访谈并记录真实的生活、行为与文化。"},"examples":[{"en":"The fieldworkers lived with the community for months to understand local customs.","zh":"田野调查者与当地社区同住数月，以了解地方习俗。"},{"en":"Fieldworkers kept detailed notes after every conversation.","zh":"田野工作者在每次谈话后都做了详细记录。"}]}],"synonyms":["field staff","outreach workers","survey workers","research assistants (field)","enumerators"],"phonetic":"/ˈfiːldˌwɝkɚz/","extraExplanation":["“fieldworkers”是复数形式；单数是“fieldworker”。","在英语里，“field-”常表示“在现场/第一线”，与“office work（办公室工作）”“lab work（实验室工作）”形成对比。","在学术语境里，fieldwork/fieldworker常见于人类学、社会学与语言学；在公共服务语境里，也常指基层走访、入户服务、外展（outreach）等工作人员。"]}
{"word":"fieldwort","summary":{"en":"Fieldwort is a rare, old word meaning a plant (often a weed) that grows in fields.","zh":"fieldwort 是一个罕见的旧词，指生长在田野里的植物（常指杂草）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) A herb or weed that grows in fields; a field plant.","zh":"（罕见/旧式用法）生长在田野里的草本植物或杂草；田野植物。"},"examples":[{"en":"In older writing, “fieldwort” can simply mean a weed growing among crops.","zh":"在较早的文字中，fieldwort 有时就是指庄稼间生长的杂草。"},{"en":"The farmer pulled up the fieldwort before it spread through the rows.","zh":"农夫在杂草蔓延到一行行作物之前把它拔掉了。"}]}],"synonyms":["weed","field weed","wild herb"],"phonetic":"/ˈfiːldˌwɝːt/","extraExplanation":["“wort” 是英语里一个很古老的词素，意思是“植物/草药”（如 St. John’s wort 圣约翰草）。因此 fieldwort 直译就是“田野里的草/草药”。","这个词在现代英语中很少使用，通常会用 weed（杂草）、wild herb（野生草本植物）或更具体的植物名称来表达。"]}
{"word":"fieldy","summary":{"en":"“Fieldy” is an uncommon adjective meaning (1) countryside/field-like, or (2) in sports, good at fielding.","zh":"“fieldy”是不太常见的形容词，意思是（1）田野/乡野风格的；或（2）体育语境中守备很强的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Like a field or the countryside; open, rural, or grassy in character.","zh":"（不常见）像田野/旷野的；具有乡村、开阔或草地特征的。"},"examples":[{"en":"We took a fieldy path through tall grass to reach the river.","zh":"我们走了一条很“田野风”的小路，穿过高草到达河边。"},{"en":"The painting has a calm, fieldy feel—wide sky and green land.","zh":"这幅画有一种宁静的田野感——广阔的天空与绿色的土地。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sports, informal) Skilled at fielding—good at catching and stopping the ball in games like cricket or baseball.","zh":"（体育，非正式）擅长守备/外场接球与拦截的；守备能力强的（如板球或棒球）。"},"examples":[{"en":"She’s quick and fieldy, so the coach put her in the outfield.","zh":"她反应快、守备很稳，所以教练让她去外场。"},{"en":"He’s not a big hitter, but he’s very fieldy.","zh":"他打击不算强，但守备很出色。"}]}],"synonyms":["rural","pastoral","grassy","open-country","good at fielding","strong defensively"],"phonetic":"ˈfiːldi","extraExplanation":["“fieldy”在现代英语里不算常用，更常见的表达是：\n- 描写风景：“rural / grassy / pastoral（田园的）/ open-country”。\n- 描写体育守备：在棒球里更常说“good fielder / strong defensively”；在板球里常说“good in the field”。","词形上它来自“field（田野/场地）+ -y（…的）”。“-y”常把名词变成形容词，表示“具有…特征”（如“cloudy 多云的”“rainy 多雨的”）。"]}
{"word":"fiend","summary":{"en":"Fiend means a demon, a very cruel person, or (informally) someone who is obsessed with something.","zh":"Fiend 指“恶魔/邪灵”、极其残忍的人，也可（口语）指对某事物上瘾或特别狂热的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evil spirit or demon (often used in stories, religion, or fantasy)","zh":"恶魔；邪灵（常用于宗教、故事或奇幻语境）"},"examples":[{"en":"In the legend, a fiend guards the treasure in the cave.","zh":"在传说里，一个恶魔守着洞穴里的宝藏。"},{"en":"The hero prays for protection from fiends.","zh":"英雄祈求免受邪灵侵害。"}]},{"partOfSpeech":"n.","definition":{"en":"a very cruel or wicked person","zh":"残忍的人；恶人"},"examples":[{"en":"The newspaper described the attacker as a fiend.","zh":"报纸把袭击者形容为恶人。"},{"en":"Don’t be a fiend—apologize and fix what you broke.","zh":"别那么缺德——道歉并把你弄坏的东西修好。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) someone who is extremely enthusiastic about something; an addict","zh":"（非正式）狂热爱好者；上瘾的人"},"examples":[{"en":"He’s a coffee fiend and drinks three cups before noon.","zh":"他是个咖啡狂，午饭前要喝三杯。"},{"en":"She’s a fitness fiend who never skips a workout.","zh":"她是个健身狂，从不缺席训练。"}]}],"synonyms":["demon","devil","monster","villain","addict","enthusiast"],"phonetic":"/fiːnd/","extraExplanation":["“fiend”来自古英语，最早有“敌人、仇敌”的意思，后来逐渐转为“恶魔、邪灵”。因此它既可以指超自然的“魔”，也可以用来强烈谴责某个“很坏的人”。","在口语里用作“……fiend”（例如 “a chocolate fiend”）时，多为夸张、带点幽默的说法，语气通常没那么严厉；但单独说某人“a fiend”在新闻或指控语境中往往很重。","常见搭配：“a fiend for + 名词”（对……特别着迷/上瘾）；“fiendish”（adj. 极其残忍的；刁钻的）。"]}
{"word":"fiendful","summary":{"en":"“Fiendful” means extremely cruel or devil-like (very rare/old-fashioned).","zh":"“fiendful”意为极其残忍、恶魔般的（较少见、偏古旧/文学用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cruel or wicked in a way that seems devil-like; resembling a fiend.","zh":"像恶魔一样残忍邪恶的；恶魔般的。"},"examples":[{"en":"The villain’s fiendful grin made everyone uneasy.","zh":"反派那恶魔般的笑容让所有人都不安。"},{"en":"They described the attack as fiendful and without mercy.","zh":"他们形容那次袭击残忍至极、毫不留情。"}]}],"synonyms":["fiendish","diabolical","demonic","devilish","savage"],"phonetic":"/ˈfiːndfəl/","extraExplanation":["“fiendful”在现代英语中非常少见，带有文学/古旧色彩；日常更常用的词是“fiendish”（恶魔般的、残忍的）。","词源上来自“fiend（恶魔/邪恶的人）+ -ful（充满……的）”，字面意思是“充满恶魔般特质的”。使用时语气很强，常用于渲染恐怖、残酷或极端邪恶的氛围。"]}
{"word":"fiendfully","summary":{"en":"“Fiendfully” means in a fiendish (evil/cruel) way, or (informally) extremely/terribly. It’s rare; “fiendishly” is much more common.","zh":"“fiendfully”意为“恶魔般地、残忍地”，也可在非正式语境中表示“极其、非常”。该词较少见，更常用的是“fiendishly”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a fiendish, cruel, or wicked way; like an evil spirit or villain.","zh":"以恶魔般的方式；残忍、邪恶地。"},"examples":[{"en":"The villain smiled fiendfully as the hero struggled.","zh":"英雄挣扎时，反派露出恶魔般的笑容。"},{"en":"She described the prank as fiendfully mean.","zh":"她形容那个恶作为“恶毒得像恶魔一样”。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Informal, emphatic) Extremely; terribly (used to intensify an adjective or adverb).","zh":"（非正式、强调）极其；非常（用于加强语气）。"},"examples":[{"en":"The puzzle was fiendfully difficult for a beginner.","zh":"对初学者来说，这个谜题难得要命。"},{"en":"He was fiendfully tired after the overnight shift.","zh":"他上完通宵班后累坏了。"}]}],"synonyms":["fiendishly","cruelly","wickedly","maliciously","diabolically","devilishly","extremely"],"phonetic":"/ˈfiːnd.fəli/","extraExplanation":["“fiendfully”非常少见，更常见的表达是“fiendishly”（如：fiendishly clever / fiendishly hard）。在正式写作中通常建议用“fiendishly”。","词源上来自“fiend（恶魔、恶人）+ -ful + -ly”，整体带有强烈的负面或夸张色彩，使用时注意语境，避免让人觉得过于尖刻。"]}
{"word":"fiendhead","summary":{"en":"“Fiendhead” is an informal slang noun meaning a person who is extremely addicted to something (often drugs) or intensely obsessed with something.","zh":"“fiendhead”是非正式俚语名词，指对某物（常指毒品）极度上瘾的人，也可泛指对某事物非常痴迷的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) A person who is extremely addicted to something (often drugs), similar to “junkie” or “addict.”","zh":"（俚语，非正式）对某物极度上瘾的人（常指毒品），类似“瘾君子/吸毒者”。"},"examples":[{"en":"He was a real fiendhead back then, always looking for his next fix.","zh":"他那时候真是个瘾君子，总在找下一次“解瘾”的机会。"},{"en":"The show portrays him as a fiendhead who eventually tries to get clean.","zh":"这部剧把他刻画成一个上瘾的人，后来努力戒断。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A person who obsessively loves or craves something (music, games, thrills), sometimes used humorously.","zh":"（非正式）对某事物痴迷、强烈渴望的人（如音乐、游戏、刺激），有时带玩笑语气。"},"examples":[{"en":"I’m a coffee fiendhead—don’t talk to me before my first cup.","zh":"我就是个咖啡狂热分子——第一杯咖啡前别跟我说话。"},{"en":"She’s a fitness fiendhead and goes to the gym every day.","zh":"她是个健身狂人，每天都去健身房。"}]}],"synonyms":["addict","junkie","fanatic","enthusiast","pothead"],"phonetic":"/ˈfiːndˌhɛd/","extraExplanation":["“fiendhead”并不是标准词典里常见的拼写，更常见的说法是“fiend”（瘾很大的人/痴迷者）或“(something) fiend”，例如“a coffee fiend”。","词源上，“fiend”原本指“恶魔、魔鬼”，在现代口语里常引申为“对某物上瘾到失控的人”。“head”在俚语中也常表示“某类人”（如“pothead”）。因此“fiendhead”大致可理解为把两种说法叠加的、较口语/自造的表达。","如果你是在歌词、网名或特定社群里看到它，可能是为了强化“上瘾/痴迷”的感觉；正式写作中建议改用“addict / fanatic / enthusiast”等更中性的词。"]}
{"word":"fiending","summary":{"en":"“Fiending” usually means craving something intensely (slang), often used as “fiending for …”.","zh":"“fiending”多指（俚语）非常强烈地渴望某物，常用结构是“fiending for …”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang) Craving something very strongly; desperate for it.","zh":"（俚语）非常渴望某物；特别想要、急着要。"},"examples":[{"en":"After a week without coffee, I was fiending for a latte.","zh":"一周没喝咖啡后，我特别想来一杯拿铁。"},{"en":"He’s been fiending for the new game since it was announced.","zh":"自从那款新游戏公布后，他就一直特别想玩。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “fiend”: to crave or seek something obsessively (often used with “for”).","zh":"“fiend”的现在分词：对某物上瘾般地追求/渴求（常与 for 连用）。"},"examples":[{"en":"She was fiending for attention during the meeting.","zh":"开会时她一直在渴求关注。"},{"en":"They’re fiending for gossip in the group chat.","zh":"他们在群聊里一心想听八卦。"}]},{"partOfSpeech":"adj.","definition":{"en":"Acting in a wild, aggressive, or “demon-like” way (less common today).","zh":"（较少用）表现得很凶、很疯狂，像“恶魔/疯子”一样。"},"examples":[{"en":"In old stories, the villain comes fiending out of the shadows.","zh":"在一些旧故事里，反派会像恶魔般从阴影中扑出来。"}]}],"synonyms":["craving","desperate for","yearning for","itching for","hungry for"],"phonetic":"/ˈfiːndɪŋ/","extraExplanation":["“fiending”在口语里非常常见，尤其是“fiending for + 名词”（特别想要/很馋/很想）。语气比“really want”更强，带一点“上瘾、控制不住”的感觉。","这个词在嘻哈歌词、网络语境里也常出现；正式写作中不太建议用，可换成“craving”“desperate for”“eager for”。"]}
{"word":"fiendish","summary":{"en":"Fiendish means either ‘evil and cruel’ or (humorously) ‘very difficult or tricky.’","zh":"fiendish既可指“邪恶残忍”，也可（常带幽默）指“非常难/刁钻”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely wicked, cruel, or evil; like a fiend (an evil spirit or devil).","zh":"极其邪恶的；残忍的；像恶魔一样的。"},"examples":[{"en":"The novel’s villain has a fiendish plan to harm the town.","zh":"小说里的反派有一个伤害小镇的恶毒计划。"},{"en":"They described the torture as fiendish cruelty.","zh":"他们把那种折磨形容为恶魔般的残忍。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often humorous) Very difficult, tricky, or cleverly complicated.","zh":"（常带幽默）非常困难的；刁钻的；巧妙复杂的。"},"examples":[{"en":"This puzzle is fiendish—I can’t solve it.","zh":"这个谜题太刁钻了——我解不出来。"},{"en":"She set a fiendish math question for the class.","zh":"她给全班出了一道很“刁钻”的数学题。"}]}],"synonyms":["evil","wicked","diabolical","cruel","devilish","tricky","devious","challenging"],"phonetic":"/ˈfiːndɪʃ/","extraExplanation":["“fiendish”来自“fiend”（恶魔、恶灵），因此它既可以严肃地表示“邪恶残忍”，也常在日常口语中夸张地表示“难得要命/非常刁钻”。使用时注意语境：描述真实暴力或犯罪时语气更强、更负面；描述题目、机关、游戏关卡时通常是半开玩笑的夸张。"]}
{"word":"fiendishly","summary":{"en":"“Fiendishly” means “extremely difficult/complex,” or “in a cruel, evil way,” depending on context.","zh":"“fiendishly”常表示“极其困难/复杂”，也可表示“阴险、邪恶地”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an extremely difficult or complicated way (so hard it feels almost “devilish”).","zh":"以极其困难或复杂的方式（难到让人感觉“像魔鬼一样”）。"},"examples":[{"en":"The puzzle is fiendishly hard, but it’s also fun.","zh":"这个谜题难得要命，但也很有趣。"},{"en":"She designed a fiendishly complex schedule to fit everyone’s needs.","zh":"她设计了一份极其复杂的日程安排来满足所有人的需求。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a cruel, wicked, or malicious way; like an evil person would.","zh":"以残忍、邪恶或恶意的方式；像坏人那样。"},"examples":[{"en":"The villain smiled fiendishly before revealing the trap.","zh":"反派在揭开陷阱前露出阴险的笑。"},{"en":"He laughed fiendishly at other people’s pain.","zh":"他对别人的痛苦发出残忍的笑。"}]}],"synonyms":["devilishly","diabolically","extremely","wickedly","maliciously"],"phonetic":"/ˈfiːndɪʃli/","extraExplanation":["“fiendishly”来自“fiend（恶魔、魔鬼）+ -ish + -ly”。日常英语里更常用在夸张地形容“难得离谱”（fiendishly difficult），不一定真的在说“邪恶”。","常见搭配：fiendishly difficult / fiendishly clever / fiendishly complicated。用于写作或评论时，语气通常偏夸张、有画面感。"]}
{"word":"fiendishness","summary":{"en":"Fiendishness means extreme wickedness or, more casually, extreme difficulty or trickiness.","zh":"Fiendishness 指“极端邪恶/残忍的特质”，也可较口语地指“极其棘手、刁钻的难度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being extremely cruel, wicked, or evil; a devil-like nature.","zh":"极其残忍、邪恶的特质；如恶魔般的本性。"},"examples":[{"en":"The novel explores the fiendishness of a dictator who values power over human life.","zh":"这部小说探讨了一位把权力置于生命之上的独裁者的邪恶本性。"},{"en":"People were shocked by the fiendishness of the crime.","zh":"人们对这起罪行的残忍程度感到震惊。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being extremely difficult, clever, or tricky (often used about problems or puzzles).","zh":"极其棘手、刁钻或巧妙的特性（常形容题目、谜题或难题）。"},"examples":[{"en":"The fiendishness of the math problem made even strong students pause.","zh":"这道数学题的刁钻程度让成绩很好的学生也停下来思考。"},{"en":"She enjoys the fiendishness of logic puzzles.","zh":"她喜欢逻辑谜题的“难到刁钻”的感觉。"}]}],"synonyms":["wickedness","cruelty","evil","malice","viciousness","diabolical nature","difficulty","trickiness"],"phonetic":"/ˈfiːn.dɪʃ.nəs/","extraExplanation":["构词：fiend（恶魔；残忍的人）+ -ish（“像……一样/带有……特征”）→ fiendish（邪恶的；也可指“难得要命的、刁钻的”）+ -ness（名词后缀，表示“……的性质/状态”）→ fiendishness。","语体与语感：用于“邪恶/残忍”时语气很强，常见于文学、新闻评论或严肃场景；用于“非常难”时更偏口语或书面夸张表达，带一点“让人抓狂但又佩服其巧妙”的意味。","相关文学语感：fiend/fiendish 常见于哥特小说或经典叙事中，用来营造“魔鬼般”的阴暗氛围；现代写作里也常把 fiendishness 用于描写反派的冷酷或计划的狠毒。"]}
{"word":"fiendism","summary":{"en":"Fiendism means extreme evil or cruel behavior—being like a fiend.","zh":"Fiendism 指极端的邪恶或残忍行为，带有“像恶魔一样”的强烈谴责意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Extreme wickedness or cruel, evil behavior; the quality of being like a fiend (a very evil or cruel person).","zh":"极端的邪恶或残忍；像“恶魔/恶棍”一样的品性或行为。"},"examples":[{"en":"The novel portrays the villain’s fiendism as a cold pleasure in hurting others.","zh":"这部小说把反派的“恶魔般残忍”写成一种冷酷的、以伤人为乐的快感。"},{"en":"People were shocked by the fiendism of the attack.","zh":"人们对这次袭击的残忍恶行感到震惊。"}]},{"partOfSpeech":"n.","definition":{"en":"In older or literary writing: a fiendish act or tendency—behavior showing savage cruelty or malice.","zh":"（较旧或文学用法）恶魔般的行为或倾向；表现出凶残或恶意的举动。"},"examples":[{"en":"He called the torture a piece of fiendism unfit for any civilized society.","zh":"他把这种折磨称为“恶魔行径”，任何文明社会都不应容忍。"}]}],"synonyms":["cruelty","evil","atrocity","fiendishness","savagery"],"phonetic":"/ˈfiːndɪzəm/","extraExplanation":["“fiendism”由 fiend（恶魔；极坏的人）+ -ism（表示某种特性/主义/倾向）构成。它不是日常高频词，更常见的替代说法有：cruelty（残忍）、evil（邪恶）、atrocity（暴行）、fiendishness（恶魔般的残忍）。在新闻或正式写作中，用“atrocity”往往更中性、也更常用；“fiendism”带强烈的道德谴责与文学色彩。"]}
{"word":"fiendlier","summary":{"en":"“Friendlier” means “more friendly” (kinder and warmer).","zh":"“Friendlier”表示“更友好、更亲切”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more friendly; showing more kindness, warmth, or willingness to help than someone/something else","zh":"更友好的；比其他人/事物更亲切、更友善、更愿意帮助"},"examples":[{"en":"This café feels friendlier than the one near my office.","zh":"这家咖啡馆感觉比我办公室附近那家更友好。"},{"en":"Try a friendlier tone in your email.","zh":"你在邮件里试着用更友好的语气。"}]}],"synonyms":["more friendly","kinder","warmer","more welcoming","more approachable"],"phonetic":"/ˈfrɛndliər/","extraExplanation":["“fiendlier”是拼写错误，正确拼写是 **friendlier**（friendly 的比较级）。","比较级常用于“A is friendlier than B”（A 比 B 更友好）。也可以用“more friendly”，但日常更常见的是“friendlier”。"]}
{"word":"fiendliest","summary":{"en":"“Friendliest” means “most friendly” (the superlative of “friendly”).","zh":"“Friendliest”表示“最友好”，是“friendly”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most friendly; the kindest and most welcoming (superlative form of “friendly”).","zh":"最友好的；最亲切、最热情的（“friendly”的最高级）。"},"examples":[{"en":"Our guide was the friendliest person in the whole city.","zh":"我们的导游是整座城市里最友好的人。"},{"en":"This café has the friendliest staff—they always remember my order.","zh":"这家咖啡馆的店员最亲切——他们总能记得我点什么。"},{"en":"She gave me the friendliest smile, so I felt relaxed right away.","zh":"她给了我一个最友好的微笑，我立刻就放松了。"}]}],"synonyms":["kindest","warmest","most welcoming","most cordial"],"phonetic":"/ˈfrɛndliəst/","extraExplanation":["“fiendliest”通常是拼写错误。正确拼写是 **friendliest**（friendly 的最高级）。","注意 **friend**（朋友）和 **fiend**（恶魔；坏人）只差一个字母，但意思完全相反：fiendly/fiendliest 在标准英语里一般不使用。"]}
{"word":"fiendlike","summary":{"en":"“Fiendlike” means ‘like a fiend’: frighteningly cruel or evil.","zh":"“fiendlike”意为“像恶魔一样”：令人恐惧的残忍或邪恶。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a fiend; extremely cruel, evil, or vicious in a frightening way.","zh":"像恶魔一样的；极其残忍、邪恶或凶狠（令人害怕）的。"},"examples":[{"en":"The story describes a fiendlike villain who enjoys causing pain.","zh":"故事描写了一个像恶魔一样的反派，喜欢制造痛苦。"},{"en":"She escaped from a fiendlike attacker and ran to the nearest house.","zh":"她从一个恶魔般凶狠的袭击者手中逃脱，跑向最近的房子。"}]}],"synonyms":["demonic","diabolical","monstrous","vicious","evil"],"phonetic":"/ˈfiːndlaɪk/","extraExplanation":["“fiendlike”由 fiend（恶魔、残忍的人）+ -like（像……一样）构成，语气很强，多用于文学、新闻或夸张的描写，用来强调某人行为“非人性”的残酷。","在西方文化里，fiend 原本指邪灵/恶魔，后来也可指“极其残忍的人”。写作中用 fiendlike 往往带有恐怖、哥特或戏剧化的氛围。","近义表达：demonic（恶魔般的，偏宗教/超自然语感）、diabolical（阴险邪恶的，较正式）、monstrous（残暴的/骇人的，强调“可怕”）。注意不要和非正式的“coffee fiend / fitness fiend”（对某物上瘾的人）混淆。"]}
{"word":"fiendliness","summary":{"en":"Friendliness means warm, kind behavior that makes others feel comfortable and welcome.","zh":"Friendliness 指让他人感到舒适、受欢迎的友善与热情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Kind and pleasant behavior toward others; being warm, welcoming, and easy to talk to.","zh":"对他人友善、和气的态度或行为；让人感到温暖、好相处。"},"examples":[{"en":"Her friendliness made the new students feel welcome.","zh":"她的友善让新同学感到很受欢迎。"},{"en":"A simple smile can show friendliness.","zh":"一个简单的微笑就能表达友善。"},{"en":"The hotel is known for its staff’s friendliness.","zh":"这家酒店以员工的热情友好而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being suitable and non-hostile toward someone or something (often used in phrases like “friendliness toward”).","zh":"对某人或某事持友好、不敌对的倾向（常用于“对……的友好态度”）。"},"examples":[{"en":"They showed friendliness toward their neighbors by sharing food.","zh":"他们通过分享食物来表达对邻居的友好。"},{"en":"The policy encourages friendliness toward visitors.","zh":"这项政策鼓励对来访者友好。"}]}],"synonyms":["kindness","warmth","friendliness","hospitality","goodwill","cordiality"],"phonetic":"/ˈfrendlinəs/","extraExplanation":["你输入的“fiendliness”常见是拼写错误，正确拼写通常是 friendliness（把 r 放在 i 后面：f-r-i-e-n-d-...）。","friendliness 是名词，来自形容词 friendly（友好的）+ 名词后缀 -ness（表示“……的状态/性质”）。"]}
{"word":"fiendly","summary":{"en":"Friendly means kind and pleasant like a friend; it can also mean safe/supportive (user-friendly), and as a noun it can mean a non-competitive sports match.","zh":"friendly 意为“友好的、亲切的”；也可指“无害/易用/对……有利”（如 user-friendly）；作名词时可指“友谊赛”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Kind, pleasant, and behaving like a friend; showing warmth or goodwill.","zh":"友好的；亲切的；像朋友一样的（表现出善意或热情）。"},"examples":[{"en":"She was very friendly to the new student.","zh":"她对新来的学生很友好。"},{"en":"The staff at the hotel were friendly and helpful.","zh":"酒店员工既亲切又乐于助人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not harmful; safe and supportive (often used for places, technology, or policies).","zh":"无害的；安全的；对……有利/友善的（常用于环境、技术或政策）。"},"examples":[{"en":"This app has a user-friendly design.","zh":"这个应用的设计很“用户友好”（易用）。"},{"en":"It’s a kid-friendly restaurant.","zh":"那是一家适合孩子的餐厅。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a friendly way; warmly (less common, used as an adverb).","zh":"友好地；亲切地（较少见的副词用法）。"},"examples":[{"en":"He greeted me friendly and offered a seat.","zh":"他很亲切地跟我打招呼，并让我坐下。"},{"en":"She spoke friendly to everyone in the room.","zh":"她对房间里每个人都很友好地说话。"}]},{"partOfSpeech":"n.","definition":{"en":"A game or match that is not part of an official competition (common in sports).","zh":"（体育）友谊赛；非正式比赛。"},"examples":[{"en":"They played a friendly before the season started.","zh":"赛季开始前他们踢了一场友谊赛。"}]}],"synonyms":["kind","nice","warm","welcoming","amicable","good-natured"],"phonetic":"/ˈfrɛndli/","extraExplanation":["你写的“fiendly”通常是“friendly”的拼写错误。记忆小技巧：friendly 来自 friend（朋友）+ -ly（……的/地），中间一定有“rend”。","在口语里，形容人时最常用 friendly；形容东西/系统时常见搭配是 user-friendly（易用的）、environmentally friendly / eco-friendly（环保的）。","作副词时（friendly=友好地）在现代英语里不算最标准，很多情况下更常说 in a friendly way 或用 warmly / kindly 来替换。"]}
{"word":"fiends","summary":{"en":"“Fiends” is the plural of “fiend”: either an evil/cruel person or (informally) someone obsessively devoted to something.","zh":"“fiends”是“fiend”的复数：可指邪恶残忍的人，也可（口语）指对某事极度痴迷的狂热者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is extremely wicked, cruel, or evil (often used in dramatic or literary style).","zh":"恶人；残忍邪恶的人（常见于较夸张或文学语境）"},"examples":[{"en":"The story describes the villain as a heartless fiend.","zh":"故事把反派描写成一个毫无怜悯的恶人。"},{"en":"Only a fiend would hurt someone for fun.","zh":"只有恶人才会以伤害别人为乐。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is obsessively devoted to something (often used informally, sometimes humorously).","zh":"狂热爱好者；痴迷者（口语，常带调侃或幽默）"},"examples":[{"en":"He’s a fitness fiend—he goes to the gym every day.","zh":"他是个健身狂，每天都去健身房。"},{"en":"My sister is a chocolate fiend.","zh":"我姐姐特别迷巧克力。"}]}],"synonyms":["villains","monsters","demons","fanatics","addicts","enthusiasts"],"phonetic":"/find/","extraExplanation":["“fiend”在现代英语里有两种常见用法：一种偏文学/戏剧化，强调“邪恶、残忍”；另一种偏口语，表示对某事“上瘾式的热爱/沉迷”，语气通常没那么严肃。","拼写注意：fiend（恶人/痴迷者）不要和 friend（朋友）混淆。发音也不同。","常见搭配：a fiend for sth（对某事很痴迷的人）；a fiend at sth（在某事上很厉害的人，带夸张口吻）。"]}
{"word":"fiendship","summary":{"en":"“Fiendship” is a playful informal word meaning a mischievous or villain-themed friendship (a pun on “friendship”).","zh":"“Fiendship”是非正式的玩笑说法，指带点“坏坏/捣蛋/反派味”的友谊，是对“friendship”的谐音梗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, playful) A friendship between “fiends” (mischievous or wicked people/characters); a bond framed as devilish, chaotic, or troublemaking—often used as a pun on friendship.","zh":"（非正式、带玩笑意味）“恶人/捣蛋鬼”之间的友谊；一种被描述成“邪气、混乱、爱惹事”的伙伴关系，常作为 friendship 的谐音梗使用。"},"examples":[{"en":"Their fiendship was built on late-night pranks and inside jokes.","zh":"他们的“fiendship”建立在深夜恶作剧和只有彼此懂的笑梗上。"},{"en":"Fans loved the villain duo’s fiendship, even when they caused chaos.","zh":"粉丝很喜欢那对反派组合的“fiendship”，哪怕他们总在制造混乱。"}]},{"partOfSpeech":"n.","definition":{"en":"A close relationship with a fiend (a cruel person, demon, or villain), especially in fiction or fandom talk.","zh":"（尤用于小说/同人语境）与恶人、恶魔或反派之间的亲密关系/交情。"},"examples":[{"en":"In the story, her fiendship with the demon puts the town in danger.","zh":"在故事里，她与恶魔的“fiendship”让小镇陷入危险。"},{"en":"The show hints at a fiendship between the two antagonists.","zh":"这部剧暗示两位反派之间有种“fiendship”。"}]}],"synonyms":["friendship","bond","camaraderie","villain duo","partners in crime"],"phonetic":"/ˈfindˌʃɪp/","extraExplanation":["“fiendship”不是标准词典里的常用词，多见于网络、同人圈或口语写作，是 fiend（恶魔/坏蛋/捣蛋鬼）+ friendship（友谊）的拼写混成与谐音梗。","语气通常偏戏谑：说“fiendship”不一定真骂人，更常是在强调“我们这段友谊有点坏坏的/爱搞事”。正式写作中一般用 friendship、bond、camaraderie 等更稳妥。"]}
{"word":"fient","summary":{"en":"Feint means a fake move or a deceptive action used to trick someone, especially in sports or fighting.","zh":"Feint 指用来迷惑对手的假动作或欺骗性举动，常见于运动或格斗中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden fake move meant to trick someone (especially in sports or fighting).","zh":"（尤指运动或格斗中的）假动作，用来欺骗对手。"},"examples":[{"en":"He used a quick feint and then dribbled past the defender.","zh":"他做了一个快速的假动作，然后带球过了防守队员。"},{"en":"With a feint to the left, she struck to the right.","zh":"她先向左虚晃一招，然后从右侧出击。"}]},{"partOfSpeech":"v.","definition":{"en":"To make a fake move to trick someone into reacting.","zh":"做假动作；佯攻，诱使对方做出反应。"},"examples":[{"en":"He feinted toward the door to distract the guard.","zh":"他佯装走向门口来分散守卫的注意力。"},{"en":"The boxer feinted twice before throwing the real punch.","zh":"拳击手先做了两次佯攻，然后才打出真正的一拳。"}]}],"synonyms":["fake","bluff","decoy","ruse"],"phonetic":"/feɪnt/","extraExplanation":["你输入的“fient”通常是“feint”的常见拼写错误；正确拼写是 feint。","feint 常见于拳击、击剑、篮球、足球等语境，也可用于更广义的“声东击西”的策略。"]}
{"word":"fier","summary":{"en":"“fier” is not standard English; it’s usually a misspelling of “fire” or “fir.”","zh":"“fier”不是标准英语；多半是“fire”或“fir”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling of “fire” (flames; burning) or “fir” (a kind of evergreen tree).","zh":"不是标准英语单词。通常是把“fire（火；燃烧）”或“fir（冷杉，一种常青树）”拼错了。"},"examples":[{"en":"Did you mean “fire”? The fire spread quickly.","zh":"你想说的是“fire”吗？火势蔓延得很快。"},{"en":"Or did you mean “fir”? We bought a fir tree for the holiday.","zh":"或者你想说的是“fir”吗？我们为节日买了一棵冷杉树。"}]}],"phonetic":"/faɪr/","extraExplanation":["“fier”在英语里不常作为单独词使用。如果你是在读文学或看到特殊拼写：\n- 在某些旧体/方言文本中，可能出现非标准拼写（如把 fire 写成类似形式），但现代标准英语不用。\n- 另外，“fier”是法语词，意思是“骄傲的/自豪的”，但这不属于英语常用词。"]}
{"word":"fierabras","summary":{"en":"Fierabras is a legendary giant warrior from a medieval French epic, and (rarely) a figurative term for a huge, intimidating person.","zh":"Fierabras 是中世纪法语史诗中的传奇巨人战士；（较少见）也可引申指身形巨大、令人生畏的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In medieval French literature) A legendary Saracen giant/warrior who fights Charlemagne’s knights and is later converted to Christianity; the hero of the chanson de geste “Fierabras.”","zh":"（中世纪法语史诗/骑士文学中）传说中的撒拉森巨人/战士，与查理曼的骑士交战，后来皈依基督教；《菲耶拉布拉斯》（Fierabras）这部“武功歌”（chanson de geste）的主角。"},"examples":[{"en":"In the medieval epic, Fierabras challenges Charlemagne’s knights in single combat.","zh":"在这部中世纪史诗里，Fierabras 向查理曼的骑士发起单挑挑战。"},{"en":"The story of Fierabras mixes battle scenes with themes of conversion and honor.","zh":"Fierabras 的故事把战争场面与皈依、荣誉等主题交织在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A very large, intimidating, or brutish person—like a “giant.”","zh":"（引申义，较少见）身形巨大、令人生畏或粗鲁的人；类似“巨人/大块头”。"},"examples":[{"en":"He looked like a Fierabras next to the smaller recruits.","zh":"站在身材较小的新兵旁边，他看起来像个 Fierabras。"},{"en":"The bouncer was described as a Fierabras guarding the door.","zh":"那名保安被形容为守门的 Fierabras。"}]}],"synonyms":["giant","brute","colossus"],"phonetic":"/ˈfjɛrəbrɑz/","extraExplanation":["“Fierabras”源自法语武功歌传统（chanson de geste），常与查理曼（Charlemagne）及其“十二圣骑士”传说体系相关。这个人物通常被塑造成强悍的“异教徒巨人”，故事推进中常出现对“骑士精神、荣耀与皈依”的讨论。","除了文学文本外，Fierabras 也出现在后世改编作品中，例如舒伯特（Franz Schubert）的歌剧《Fierabras》（1823），使这个中世纪题材在音乐舞台上延续传播。"]}
{"word":"fierasfer","summary":{"en":"A pearlfish (genus *Fierasfer*) known for living inside sea cucumbers or similar hosts.","zh":"一种珍珠鱼（*Fierasfer* 属），以栖身于海参等宿主体内而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of pearlfish (genus *Fierasfer*) that often lives inside sea cucumbers or other marine invertebrates, sometimes as a commensal or parasite","zh":"一种珍珠鱼（*Fierasfer* 属），常栖身于海参或其他海洋无脊椎动物体内，有时为共栖关系，有时带寄生性"},"examples":[{"en":"Scientists found a *Fierasfer* living inside a sea cucumber during a night dive.","zh":"科学家在一次夜潜时发现一条 *Fierasfer* 栖身在海参体内。"},{"en":"Some *Fierasfer* species use their host mainly for shelter and protection.","zh":"一些 *Fierasfer* 物种主要把宿主当作庇护所和保护。"}]}],"synonyms":["pearlfish","carapid (fish)"],"phonetic":"fiˈɛrəsfɚ","extraExplanation":["“Fierasfer”多见于生物学/海洋学文献中，是拉丁化的属名，日常英语里更常用统称“pearlfish（珍珠鱼）”或提到其科名“Carapidae（珍珠鱼科）”。","这类鱼常因“钻进海参肛门并住在体腔内”的特殊共生方式而被科普文章提及；不同物种对宿主的影响程度不一，有的基本不伤害宿主，有的可能取食宿主组织。"]}
{"word":"Fierasfer-like","summary":{"en":"Resembling the pearlfish genus Fierasfer, especially in shape or behavior (often associated with sea cucumbers).","zh":"类似 Fierasfer 属（珍珠鱼）的，尤指外形或习性（常与海参相关）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or characteristic of a fish of the genus Fierasfer (a type of pearlfish), especially in its slender shape or its habit of living in or near sea cucumbers and other marine animals.","zh":"像（或具有）Fierasfer 属（珍珠鱼的一类）特征的，尤指其细长外形，或其栖居在海参等海洋动物体内/体旁的习性。"},"examples":[{"en":"The biologist described the specimen’s long, thin body as Fierasfer-like.","zh":"生物学家把该标本细长的身体形态描述为“Fierasfer-like”（类似珍珠鱼）。"},{"en":"Some early reports mentioned Fierasfer-like fish found inside sea cucumbers.","zh":"一些早期报告提到在海参体内发现了类似 Fierasfer 的鱼。"}]}],"synonyms":["pearlfish-like","Fierasfer-like (also written fierasfer-like)"],"phonetic":"/ˈfɪrəsˌfɝr laɪk/","extraExplanation":["“Fierasfer”是一个鱼类属名（常被归入“珍珠鱼”类群）。这类鱼在科普或学术写作中常因“与海参等无脊椎动物共栖/寄居”的行为而被提及，因此“Fierasfer-like”多用于描述外形（细长、鳗状）或生态习性（躲入宿主体内）。","这种以属名 + “-like”构成的形容词在英语科技写作里很常见，用来表示“像某某那样的/具有某类生物特征的”。在非专业语境中较少见。"]}
{"word":"fierasferid","summary":{"en":"“fierasferid” is not recognized as a standard English word; it may be a misspelling or a name/foreign term.","zh":"“fierasferid”不是常见英语词，可能是拼写错误或专名/外语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a non-English/fictional term.","zh":"不是标准英语单词，可能是拼写错误、外语词，或是虚构/专有名词。"},"examples":[{"en":"I can’t find “fierasferid” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“fierasferid”——你能把看到它的句子发我吗？"},{"en":"If you meant “fierce,” the spelling is f-i-e-r-c-e.","zh":"如果你想写的是“fierce（凶猛的）”，拼写是 f-i-e-r-c-e。"}]}],"synonyms":["(If you meant “fierce”): ferocious, wild, intense","(If you meant “feral”): wild, untamed"],"extraExplanation":["这个串看起来像把两个词黏在一起或打错字了。你可以告诉我：\n1）它出现的上下文句子；\n2）你想表达的大意（例如“凶猛/野性/恐惧”等）；\n3）是否来自游戏、小说、用户名或某种语言（西班牙语/拉丁语等）。\n我就能更准确地判断你要查的词，并给出正确词条。"]}
{"word":"fierasferidae","summary":{"en":"Fierasferidae is a scientific name for a group (family) of pearlfishes, often associated with sea cucumbers and other marine invertebrates.","zh":"Fierasferidae 是珍珠鱼（pearlfishes）这一类群的学名（通常作“科”），以常与海参等海洋无脊椎动物共栖而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of slender, eel-like marine fishes (pearlfishes) known for living in close association with invertebrates, especially sea cucumbers and some starfishes, often using the host’s body cavity as shelter.","zh":"（鱼类分类）珍珠鱼科：一类细长、似鳗的海水鱼（珍珠鱼），常与无脊椎动物共生，尤其与海参、部分海星等同栖，常把宿主体腔当作藏身处。"},"examples":[{"en":"Some Fierasferidae are famous for hiding inside sea cucumbers to avoid predators.","zh":"一些珍珠鱼科的鱼以躲进海参体内避开捕食者而闻名。"},{"en":"The researcher recorded a pearlfish (Fierasferidae) entering its host at night.","zh":"研究人员记录到一条珍珠鱼科的鱼在夜间进入宿主。"}]}],"synonyms":["pearlfish","pearlfishes"],"phonetic":"/ˌfɪrəˈsæfərɪdiː/","extraExplanation":["“Fierasferidae”是拉丁化的生物分类名称，常见于学术文章与物种名录中；日常英语更常说“pearlfish/pearlfishes（珍珠鱼）”。","分类上不同资料可能把它当作“科（-idae）”，也有较新的系统把相关类群并入其他更大的类群（例如与 Carapidae/珍珠鱼科群相关的处理），因此在不同教材或数据库里地位可能略有差异。","这些鱼与宿主的关系常被描述为“共栖/共生（commensal/symbiotic）”：有的主要借宿主躲藏，有的则可能取食宿主体内的小生物或组织，具体取决于物种与研究观点。"]}
{"word":"fierasferoid","summary":{"en":"Fierasferoid means “pearlfish-like,” mainly used in zoological/scientific writing.","zh":"fierasferoid 意为“类似珍珠鱼（*Fierasfer* 类群）的”，主要用于动物学/科学写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Resembling or relating to a pearlfish of the group *Fierasfer* (pearlfishes), often used in scientific descriptions.","zh":"（动物学）类似于或与“珍珠鱼”（*Fierasfer* 类群）有关的；常用于科学描述中。"},"examples":[{"en":"The specimen was described as having a fierasferoid body shape, long and eel-like.","zh":"该标本被描述为具有“珍珠鱼式”的体型，细长并呈鳗形。"},{"en":"Some fierasferoid fishes live in close association with sea cucumbers.","zh":"一些“珍珠鱼式”的鱼类会与海参形成密切的共生关系。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A fish or organism described as fierasferoid in form or classification.","zh":"（较少见）指体形或分类上被描述为“珍珠鱼式”的鱼类或生物个体。"},"examples":[{"en":"The diver photographed a small fierasferoid near the reef at night.","zh":"潜水员在夜间的礁区附近拍到了一条小型“珍珠鱼式”鱼类。"}]}],"synonyms":["Fierasfer-like","pearlfish-like"],"phonetic":"/fɪˈræs.fə.rɔɪd/","extraExplanation":["这个词比较罕见，多见于动物学/分类学论文里，是用“‑oid（……样的）”构成的学术形容词：表示“像某一类/某一属（如 *Fierasfer*）那样”。日常英语里几乎不会用到。","“pearlfish（珍珠鱼）”常指隐居或共栖于海参、海星等棘皮动物体内/体表的鱼类；因此相关描述里可能会出现“共栖（commensal）/寄生（parasitic）”等生态词汇。"]}
{"word":"fierce","summary":{"en":"“Fierce” most often means very intense or aggressive; informally it can also mean impressively bold and confident.","zh":"“fierce”最常表示“强烈/激烈”或“凶猛/好斗”；在非正式语境里也可夸人“很有气场、很酷”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very strong, intense, or powerful (often describing feelings, weather, competition, etc.).","zh":"（常形容感情、天气、竞争等）非常强烈的、猛烈的、激烈的。"},"examples":[{"en":"There was fierce competition for the job.","zh":"这份工作竞争非常激烈。"},{"en":"A fierce storm hit the coast last night.","zh":"昨晚一场猛烈的暴风雨袭击了海岸。"}]},{"partOfSpeech":"adj.","definition":{"en":"Angry, aggressive, or ready to attack; threatening in a wild or violent way.","zh":"凶猛的；好斗的；带攻击性的（显得很危险或很可怕）。"},"examples":[{"en":"The dog looked fierce, so I kept my distance.","zh":"那只狗看起来很凶，我就保持了距离。"},{"en":"He gave me a fierce stare.","zh":"他狠狠地瞪了我一眼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Extremely good, impressive, or stylish; bold and confident.","zh":"（非正式）特别棒的、很酷的、很有气场/很自信的（常带夸赞）。"},"examples":[{"en":"She looks fierce in that outfit.","zh":"她穿那套衣服看起来特别有气场。"},{"en":"That performance was fierce!","zh":"那场表演太炸了！"}]}],"synonyms":["intense","strong","violent","aggressive","ferocious","brutal","fierce-looking","formidable","cutthroat (competition)","bold (informal praise)"],"phonetic":"/fɪrs/","extraExplanation":["“fierce”既可形容真实的“凶猛/残暴”（如动物、目光），也常用来形容抽象的“强烈/激烈”（如竞争、风暴、争论）。学习时可以先看它修饰的是“人/动物”还是“事情/状态”。","在流行文化与口语里，“fierce”常用于夸赞一个人很有气场、很自信、很抢眼（类似“slay”“太酷了”）。这种用法偏非正式，正式写作中更常用“confident / impressive / striking”。","词源上与“wild（野性的）”和“ferocious（凶猛的）”这类含义相近；如果你想表达更强的“残暴/凶残”，可以用“ferocious”。"]}
{"word":"fierce animals","summary":{"en":"very aggressive or dangerous animals","zh":"凶猛或危险的动物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"animals that are very aggressive, dangerous, or likely to attack","zh":"非常凶猛、危险、可能会攻击人的动物"},"examples":[{"en":"The warning sign says there are fierce animals in the forest.","zh":"警示牌写着森林里有凶猛动物。"},{"en":"Keep food inside the tent, or fierce animals may come near.","zh":"把食物放在帐篷里，不然凶猛动物可能会靠近。"},{"en":"The documentary shows how fierce animals protect their young.","zh":"纪录片展示了凶猛动物如何保护幼崽。"}]},{"partOfSpeech":"phrase","definition":{"en":"a strong description meaning the animals seem intense or powerful (sometimes used in stories or dramatic writing, not always literally dangerous)","zh":"强调“看起来很强悍/很有气势”的说法（常见于故事或夸张表达，不一定真的危险）"},"examples":[{"en":"In the fairy tale, fierce animals guard the hidden castle.","zh":"在童话里，凶猛的动物守护着隐藏的城堡。"},{"en":"The artist painted fierce animals with bright eyes and sharp teeth.","zh":"画家画了眼神明亮、牙齿锋利的凶猛动物。"}]}],"synonyms":["dangerous animals","wild animals","predators","ferocious beasts","hostile wildlife"],"phonetic":"/fɪrs ˈænɪməlz/","extraExplanation":["常见搭配对比：\n- fierce animals：强调“凶猛、会攻击”的特征。\n- wild animals：强调“野生的、未驯化的”，不一定凶猛（例如鹿是 wild animal，但通常不算 fierce）。","语感提醒：日常英语中更常说 “dangerous animals” 或 “wild animals”。“fierce animals”更有画面感，常用于故事、纪录片解说或强调危险时。"],"etymology":"“fierce”来自古法语，原意与“凶猛、激烈”相关；“animal”来自拉丁语 animal（“有生命的东西”）。两者组合后常用来形容“凶猛/危险的动物”。","mnemonic":["把 fierce 记成“费尔斯→费劲也要躲开”，表示“很凶、很危险”。","联想中文“凶猛(fierce) + 动物(animals)”：看到“尖牙利爪”的画面，就更容易记住。"]}
{"word":"fierce battle","summary":{"en":"an extremely intense fight or struggle","zh":"极其激烈的战斗或对抗"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a very intense, violent, or determined fight between people or groups, often in war or competition","zh":"激烈的战斗；非常紧张、残酷或拼死的交战（常指战争或竞争中的对抗）"},"examples":[{"en":"The two armies fought a fierce battle for control of the bridge.","zh":"两支军队为争夺那座桥展开了一场激烈的战斗。"},{"en":"After a fierce battle, the firefighters finally contained the wildfire.","zh":"经过一番激烈的“战斗”，消防员终于控制住了山火。"},{"en":"It was a fierce battle to win the championship, but the team stayed calm.","zh":"争夺冠军是一场激烈的较量，但这支队伍保持了冷静。"}]}],"synonyms":["intense fight","violent clash","bloody battle","hard-fought battle","heated struggle","fierce struggle","close contest"],"phonetic":"/fɪrs ˈbætəl/","extraExplanation":["搭配用法：常见结构是“a fierce battle for/over + 目标”（为/就……展开激烈争夺），如 a fierce battle for power（对权力的激烈争夺）。","语感区别：fierce battle 更强调“激烈/残酷/不相让”；类似表达 bitter battle 更强调“痛苦、长期、带怨气的斗争”；hard battle 更偏“艰难”。","比喻用法很常见：在新闻或日常表达中，可把救火、抗病、谈判、商业竞争说成“battle”，用 fierce 来突出强度。"],"etymology":"“fierce”来自古法语，含“凶猛、强烈、激烈”之意；“battle”来自古法语，原指“作战、打斗”。组合后常用来强调战斗的强度与残酷性，也可引申到非军事领域的激烈对抗。","mnemonic":["fierce 发音像“费尔斯”，联想“费尽全力也要死磕”的激烈劲。","battle=“打斗”，记成“把(to) + 斗(斗争)”：为目标“把”到手就得 battle。"]}
{"word":"fierce business competition","summary":{"en":"extremely intense rivalry among companies","zh":"企业之间极其激烈的竞争"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Very intense rivalry among companies, where each tries strongly to win customers, market share, or profit.","zh":"（企业之间）非常激烈的竞争；各方努力争夺客户、市场份额或利润。"},"examples":[{"en":"In the smartphone market, fierce business competition pushes companies to release new models every year.","zh":"在智能手机市场，激烈的商业竞争促使公司每年推出新机型。"},{"en":"Because of fierce business competition, the restaurant lowered prices and improved service.","zh":"由于激烈的商业竞争，这家餐厅降低了价格并提升了服务。"},{"en":"Fierce business competition can benefit consumers, but it can also pressure workers.","zh":"激烈的商业竞争可能让消费者受益，但也会给员工带来压力。"}]}],"synonyms":["intense competition","stiff competition","strong competition","cutthroat competition","heated rivalry","tough competition"],"phonetic":"/fɪrs ˈbɪznəs ˌkɑmpəˈtɪʃən/","extraExplanation":["常见搭配：fierce competition（激烈竞争）、cutthroat competition（你死我活/极端激烈的竞争）、intense competition（强烈竞争）。","语气对比：fierce 比 strong 更有“来势凶、压力大”的感觉，但不一定有 cutthroat 那么负面。"],"etymology":"短语组合：fierce（源自古法语，意为“凶猛的/强烈的”）+ business + competition（源自拉丁语 compete，原义“共同追求/争夺”）。现代搭配中常用来强调竞争“强度很高”。","mnemonic":["联想“fierce=像猛兽一样凶”：商业竞争像“猛兽抢食”，就表示“竞争非常激烈”。","记搭配：fierce 常和 competition 连用；看到 fierce 就想到“激烈竞争”。"]}
{"word":"fierce competition","summary":{"en":"very intense rivalry","zh":"非常激烈的竞争"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"very strong and intense rivalry, with many people or groups trying hard to win or succeed","zh":"激烈竞争；强烈而紧张的争夺（很多人或团体都在努力取胜/成功）"},"examples":[{"en":"There is fierce competition for jobs in big cities.","zh":"大城市的求职竞争非常激烈。"},{"en":"Startups face fierce competition from larger companies.","zh":"初创公司面临来自大公司的激烈竞争。"},{"en":"To survive fierce competition, the store improved its service and prices.","zh":"为了在激烈竞争中生存，这家店提升了服务并调整了价格。"}]}],"synonyms":["intense competition","strong competition","stiff competition","heated rivalry","cutthroat competition","hard-fought contest"],"phonetic":"/fɪrs ˌkɑmpəˈtɪʃən/","extraExplanation":["常见搭配：face fierce competition（面临激烈竞争）、fierce competition for + 名词（对……的激烈竞争，如 jobs/places）、in the face of fierce competition（在激烈竞争面前）。","语气区别：fierce competition 强调“强度大、压力高”；strong competition 更中性；cutthroat competition 更强调“残酷、你死我活”。"],"etymology":"“fierce”来自古法语，原意与“凶猛、激烈”相关；“competition”来自拉丁语，含“共同追求、争夺”的意思。组合在一起常用于描述市场、考试、职位等场景中强度很高的“竞争”。","mnemonic":["fierce ≈ “fire（火）+ ce”，像“火一样猛烈”→ 激烈；fierce competition 就是“像火一样猛烈的竞争”。","competition 可联想“compete（竞争）+ -ition（名词后缀）”，把动词变成“竞争（这件事）”。"]}
{"word":"fierce rays of","summary":{"en":"very intense beams of light (often sunlight)","zh":"（常指阳光）强烈、刺眼的光线"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"very strong, intense beams of light (especially sunlight)","zh":"（尤指阳光）强烈、刺眼的光束"},"examples":[{"en":"We had to close the curtains to keep out the fierce rays of the afternoon sun.","zh":"我们不得不拉上窗帘，挡住午后强烈的阳光。"},{"en":"The hikers rested under a tree to escape the fierce rays of the midday sun.","zh":"徒步者在树下休息，躲避正午刺眼的阳光。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) harsh or intense attention or pressure, like being under a spotlight","zh":"（比喻）强烈而令人不适的关注或压力，像被聚光灯照着"},"examples":[{"en":"After the scandal, he found himself under the fierce rays of media scrutiny.","zh":"丑闻之后，他发现自己处在媒体严厉审视的“强光”之下。"},{"en":"New employees can feel the fierce rays of expectation in their first week.","zh":"新员工在第一周可能会感到很强的期待压力。"}]}],"synonyms":["blazing rays of","scorching rays of","intense rays of","strong rays of","harsh rays of","the sun’s glare","searing sunlight","blinding light"],"phonetic":"fɪrs reɪz əv","extraExplanation":["常见搭配：fierce rays of the sun / fierce rays of sunlight / fierce rays of midday sun。","语气比 strong/bright 更“压迫感”更强，暗示刺眼、灼热、难以忍受；写作中常用来营造炎热、干旱或暴晒的氛围。","近义表达对比：blazing rays（更强调灼烧/火辣），scorching sun（更强调高温），harsh glare（更强调刺眼的眩光）。"],"etymology":"“fierce”源自古法语，原义接近“野性、凶猛”，后来引申为“强烈的、难以承受的”；“ray”来自拉丁语“radius”（光线、辐射线）。英语里常用“fierce + rays + of + sun/light”来强调光线强度。","mnemonic":["把“fierce”联想成“凶猛的”，阳光像“凶猛地”照下来＝“强烈的（阳光）”。","“rays”可联想“射线/光线（射过来）”，合起来就是“强烈的光线射过来”。"]}
{"word":"fierce-looking","summary":{"en":"Fierce-looking means having a scary, tough, or aggressive appearance.","zh":"fierce-looking 指“看起来很凶/很强势/很吓人”的外表印象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an intense, aggressive, or frightening appearance; looking as if you might attack or be very tough.","zh":"看起来很凶、很强势或有攻击性；给人一种不好惹、可能会动手的感觉。"},"examples":[{"en":"Don’t worry—he’s fierce-looking, but he’s actually very kind.","zh":"别担心——他看起来很凶，其实人很善良。"},{"en":"The fierce-looking dog was barking loudly at strangers.","zh":"那只看起来很凶的狗对陌生人大声吠叫。"},{"en":"She wore a fierce-looking expression to stop people from bothering her.","zh":"她摆出一副很凶的表情，好让别人别来打扰她。"}]}],"synonyms":["intimidating-looking","scary-looking","tough-looking","menacing-looking"],"phonetic":"/ˈfɪrs ˌlʊkɪŋ/","extraExplanation":["“fierce-looking”是由“fierce（凶猛的/强势的）+ looking（看起来……的）”组成的复合形容词，用来强调“外表给人的印象”，不一定代表真实性格。","日常口语里也常说“fierce-looking guy/dog”或用同类结构：“kind-looking（看起来和善的）”“tired-looking（看起来疲惫的）”。"]}
{"word":"fiercehearted","summary":{"en":"Fiercehearted means brave, strong-spirited, and determined.","zh":"fiercehearted 指勇敢坚定、内心强大、意志顽强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Brave and determined, with a strong, intense spirit; not easily frightened or discouraged.","zh":"勇敢坚定、内心强大；不容易被吓倒或打退堂鼓。"},"examples":[{"en":"She stayed fiercehearted even when the odds were against her.","zh":"即使胜算不大，她依然勇敢坚定。"},{"en":"The fiercehearted firefighter ran back into the building to help others.","zh":"那位勇敢无畏的消防员又冲回楼里去救人。"},{"en":"In the story, a fiercehearted child stands up to the bully.","zh":"在故事里，一个勇敢的孩子挺身对抗霸凌者。"}]}],"synonyms":["brave","courageous","fearless","dauntless","strong-willed","valiant"],"phonetic":"/ˈfɪrsˌhɑrtɪd/","extraExplanation":["“fiercehearted”更常见的写法是带连字符的“fierce-hearted”，属于偏文学/诗歌式的复合形容词，用来强调“心志强硬、勇敢无惧”的气质。日常口语里更常用“brave”“courageous”“strong-willed”“fearless”等。"]}
{"word":"fiercely","summary":{"en":"“Fiercely” means doing something with great intensity, force, or aggressive determination.","zh":"“fiercely”表示以强烈的力度、激烈的程度或带攻击性/强烈决心的方式去做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very strong, intense, or aggressive way; with great force or determination.","zh":"猛烈地；激烈地；（带有攻击性或强烈决心地）强势地。"},"examples":[{"en":"The two teams competed fiercely for the championship.","zh":"两支队伍为了冠军展开了激烈竞争。"},{"en":"She defended her ideas fiercely during the meeting.","zh":"她在会议上强有力地为自己的观点辩护。"},{"en":"The wind blew fiercely all night.","zh":"风整夜刮得很猛烈。"}]}],"synonyms":["intensely","strongly","aggressively","violently","ferociously"],"phonetic":"/ˈfɪrsli/","extraExplanation":["“fiercely”来自形容词“fierce”（凶猛的、激烈的）+ 副词后缀“-ly”。它既可形容“竞争/争论的激烈”，也可形容“自然力量（风、火、太阳等）的猛烈”。","语气上，“fiercely”常带有更强的情绪或冲突感；如果只想表达“非常努力/非常强”，有时也可用“intensely”或“strongly”来弱化攻击性。"]}
{"word":"fiercen","summary":{"en":"“fiercen” is likely a misspelling of “fierce” (very intense or aggressive).","zh":"“fiercen”很可能是“fierce”的拼写错误（非常强烈或凶猛）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard word) Likely a misspelling of “fierce,” meaning very strong, intense, or aggressive in a way that can seem frightening or impressive.","zh":"（不是标准单词）很可能是“fierce”的拼写错误，意思是非常强烈、激烈或带有攻击性，可能让人害怕或觉得很有气势。"},"examples":[{"en":"I think you meant “fierce,” not “fiercen.”","zh":"我觉得你想写的是“fierce”，不是“fiercen”。"},{"en":"There was fierce competition for the job.","zh":"那份工作竞争非常激烈。"},{"en":"The dog gave a fierce growl.","zh":"那只狗发出一声凶狠的低吼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very strong or intense (often about feelings, competition, storms, heat, etc.).","zh":"非常强烈的、激烈的（常用来形容情绪、竞争、风暴、炎热等）。"},"examples":[{"en":"They had a fierce argument but made up later.","zh":"他们激烈争吵了一场，但后来和好了。"},{"en":"A fierce storm hit the coast last night.","zh":"昨晚一场猛烈的风暴袭击了海岸。"}]},{"partOfSpeech":"adj.","definition":{"en":"Aggressive or ready to fight; showing anger or power.","zh":"凶猛的；好斗的；表现出愤怒或力量的。"},"examples":[{"en":"She has a fierce look when she’s focused.","zh":"她专注时眼神很凌厉。"},{"en":"The tiger is a fierce hunter.","zh":"老虎是凶猛的捕猎者。"}]}],"synonyms":["intense","violent","ferocious","aggressive","brutal","strong"],"phonetic":"/fɪrs/","extraExplanation":["“fiercen”不是常见英语单词。最可能的目标词是“fierce”（形容词）。如果你想表达“使变得更激烈/增强”，有时会用动词短语“make … fiercer”（让……更激烈）或名词“fierceness”（凶猛；激烈）。"]}
{"word":"fiercened","summary":{"en":"“Fiercened” is a rare (often literary) past form meaning “became fiercer” or “intensified.”","zh":"“fiercened”较少见（常偏文学），表示“变得更凶猛/更激烈”或“加剧”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle; rare/poetic) became fierce or more intense; intensified.","zh":"（过去式/过去分词；较少见/偏文学）变得更凶猛或更强烈；加剧。"},"examples":[{"en":"As the storm fiercened, the fishing boats hurried back to shore.","zh":"随着暴风雨愈发猛烈，渔船赶紧返回岸边。"},{"en":"Their argument fiercened when money was mentioned.","zh":"一提到钱，他们的争论就更激烈了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle; rare/poetic) made something fierce or harsher.","zh":"（过去式/过去分词；较少见/偏文学）使某事变得更凶猛/更严酷。"},"examples":[{"en":"The new policy fiercened competition among small businesses.","zh":"新政策加剧了小企业之间的竞争。"}]}],"synonyms":["intensified","escalated","grew fiercer","worsened","sharpened"],"phonetic":"ˈfɪrsənd","extraExplanation":["“fiercened”在现代英语中不常见，常见于较老的文本、诗歌或写作中用来表达“变得更猛烈/更激烈”。日常表达更常用：became fiercer / grew fiercer / intensified / escalated。","拼写提示：它来自形容词“fierce（凶猛的，激烈的）”，写作中多用来强调情势“升级、加剧”的感觉。"]}
{"word":"fierceness","summary":{"en":"Fierceness means the quality of being fierce—very intense, forceful, or aggressive; it can also describe strong passion or determination.","zh":"Fierceness 指“凶猛/激烈/强硬”的特质或程度；也可指强烈的热情与拼劲（决心、投入）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being fierce: intense, aggressive, or showing strong force or anger.","zh":"凶猛；激烈；（带攻击性的）强烈程度；凶悍之气。"},"examples":[{"en":"The fierceness of the storm knocked out the power.","zh":"暴风雨的猛烈程度导致停电。"},{"en":"She answered with a fierceness that surprised everyone.","zh":"她用一种出人意料的强硬语气回应。"},{"en":"The team played with fierceness and refused to give up.","zh":"球队打得很拼，很强悍，绝不放弃。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong intensity or passion (sometimes positive), especially in effort, loyalty, or love.","zh":"（有时偏正面）强烈的热情或投入程度，如努力、忠诚或爱之强烈。"},"examples":[{"en":"He defended his friend with fierce loyalty and fierceness.","zh":"他以强烈的忠诚和护友的劲头为朋友辩护。"},{"en":"Her fierceness in pursuing her goals inspired others.","zh":"她追求目标的那股狠劲激励了别人。"}]}],"synonyms":["ferocity","intensity","aggressiveness","savagery","strength","passion"],"phonetic":"/ˈfɪrsnəs/","extraExplanation":["“fierceness”来自形容词“fierce”（凶猛的、激烈的）+ 名词后缀“-ness”（表示“……的状态/性质”）。因此它强调的是一种“程度/特质”，常和天气（storm）、竞争（competition）、争论（argument）、神情/语气（look/voice）等搭配。","语感上，“fierceness”既可偏负面（愤怒、攻击性），也可在励志语境中偏正面（坚韧、拼劲）。若想更中性可用“intensity”（强度）或“strength”（力量）；若更强调“残暴/凶残”，可用“savagery”“ferocity”。"]}
{"word":"fiercenesses","summary":{"en":"“Fiercenesses” means multiple instances or kinds of fierceness—strong aggression or intensity.","zh":"“fiercenesses”表示“凶猛/强烈”的多种表现或多个例子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “fierceness”: the quality or state of being fierce (very strong, aggressive, or intense), in more than one case or aspect.","zh":"“fierceness”的复数形式：指“凶猛、强烈、激烈”的特质或状态（不止一个方面/多种表现）。"},"examples":[{"en":"The novel contrasts the fiercenesses of war and of grief.","zh":"这部小说对比了战争的残酷与悲伤的强烈。"},{"en":"Different animals show different fiercenesses when protecting their young.","zh":"不同动物在保护幼崽时会表现出不同程度的凶猛。"}]}],"synonyms":["intensities","severities","ferocities","aggressions"],"phonetic":"/ˈfɪrsnəsɪz/","extraExplanation":["“fierceness”通常是不可数名词，更常见的说法是“the fierceness of the storm（暴风雨的猛烈）”。用复数“fiercenesses”时，往往是在强调“多种不同的猛烈/强烈表现”，或用于文学、评论性写作中，让语气更有层次。"]}
{"word":"fiercening","summary":{"en":"“Fiercening” is a rare word meaning “becoming fiercer; intensifying.”","zh":"“fiercening”较少见，意思是“变得更凶猛/更激烈；加剧”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Becoming fierce; growing more intense, aggressive, or violent (rare/poetic).","zh":"变得更凶猛的；愈发激烈、强硬或暴力的（较少见/偏诗性用法）。"},"examples":[{"en":"With the sun setting, the wind rose, fiercening into a storm.","zh":"随着太阳落下，风越刮越大，渐渐变得凶猛，最终发展成暴风雨。"},{"en":"Their debate was calm at first, but it kept fiercening as more people joined in.","zh":"他们的争论起初很平静，但随着更多人加入，越来越激烈。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of becoming fierce; intensifying (used like a verb form in some writing, but uncommon).","zh":"变得更凶猛/更激烈的过程（有时当作动词形式使用，但不常见）。"},"examples":[{"en":"The fiercening of the waves made the small boat hard to control.","zh":"海浪逐渐变得更猛烈，使小船难以控制。"},{"en":"He described the crowd’s fiercening mood in the final minutes of the game.","zh":"他描述了比赛最后几分钟里人群情绪愈发激动（更强烈）的变化。"}]}],"synonyms":["growing fiercer","intensifying","escalating","worsening","strengthening"],"phonetic":"/ˈfɪrsənɪŋ/","extraExplanation":["“fiercening”不是现代英语里很常见的标准词，读者更常用：**growing fiercer**（越来越凶猛）、**intensifying**（加剧）、**escalating**（升级）、**worsening**（恶化）。","如果你是在写作里想表达“逐渐变得凶猛/激烈”，更自然的说法包括：**The wind grew fiercer.** / **The conflict intensified.**","它看起来像把形容词 **fierce** 加上“-ening”构成“逐渐变得……”，这种构词在诗歌或修辞性写作中偶尔会出现，用来强调变化过程。"]}
{"word":"fiercer","summary":{"en":"“Fiercer” means “more fierce”—more intense, aggressive, or powerful.","zh":"“fiercer”意为“更激烈/更凶猛/更强硬”，是“fierce”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “fierce”: more intense, aggressive, or violent in feeling, action, or competition.","zh":"“fierce”的比较级：更激烈的；更凶猛的；更强硬的（情绪、行动或竞争）。"},"examples":[{"en":"The competition got fiercer in the final round.","zh":"在决赛轮，竞争变得更激烈了。"},{"en":"She gave him a fiercer look to show she was serious.","zh":"她更严厉地看了他一眼，表示自己是认真的。"},{"en":"Winds became fiercer as the storm moved closer.","zh":"随着风暴逼近，风变得更猛烈。"}]},{"partOfSpeech":"adj.","definition":{"en":"More powerful or intense in energy, effort, or determination.","zh":"更强劲的；更有力的；更坚定的（指能量、努力或决心）。"},"examples":[{"en":"After the setback, he came back with fiercer determination.","zh":"遭遇挫折后，他以更坚定的决心重新振作。"},{"en":"They launched a fiercer campaign to raise awareness.","zh":"他们发起了一场更有力度的宣传活动来提高公众意识。"}]}],"synonyms":["more intense","more aggressive","stronger","more violent","more ferocious"],"phonetic":"/ˈfɪrsər/","extraExplanation":["“fiercer”是形容词“fierce”的比较级，常用来和“than”搭配：fiercer than…（比……更激烈/更凶猛）。","注意拼写：fierce → fiercer（直接加 -r），最高级是 fiercest。"]}
{"word":"fiercest","summary":{"en":"“Fiercest” means “the most fierce”—the strongest, most intense, or most aggressive.","zh":"“fiercest”表示“最凶猛/最强烈/最激烈的”，是“fierce”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “fierce”: the most intense, strong, or violent in feeling, action, or appearance.","zh":"“fierce”的最高级：最强烈的、最猛烈的（情绪/行动/外表等）。"},"examples":[{"en":"They faced the fiercest storm of the winter.","zh":"他们遭遇了这个冬天最猛烈的暴风雪。"},{"en":"She is her fiercest critic, always pushing herself to improve.","zh":"她是对自己最严厉的批评者，总是逼自己进步。"},{"en":"The two teams played their fiercest match in years.","zh":"两支队伍打出了多年来最激烈的一场比赛。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most intense in competition or determination; most aggressive or hard to defeat.","zh":"（竞争/意志）最强的；最有攻击性、最难对付的。"},"examples":[{"en":"In the final round, he became the fiercest opponent.","zh":"在决赛轮，他成了最难缠的对手。"},{"en":"Market competition is fiercest in big cities.","zh":"大城市的市场竞争最激烈。"}]}],"synonyms":["most intense","most violent","most aggressive","most ferocious","most brutal","most severe"],"phonetic":"/ˈfɪrsəst/","extraExplanation":["“fiercest”是形容词“fierce”的最高级，常见结构是：the fiercest + 名词（the fiercest battle/storm/competition）。比较级是“fiercer”。","“fierce”既可形容真实的猛烈（storm、fire、animal），也常用于比喻（fierce debate、fierce determination、fierce critic），语气通常偏强、带压力感。"]}
{"word":"fiercly","summary":{"en":"“Fiercely” means “in a fierce or very intense way.”","zh":"“fiercely”表示“凶猛地/猛烈地”，也可表示“非常强烈地（如忠诚、竞争）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a fierce, aggressive, or violent way; with strong force or anger.","zh":"凶猛地；激烈地；带有攻击性或强烈怒意地。"},"examples":[{"en":"The two dogs fought fiercely over the food.","zh":"两只狗为了食物凶猛地打斗。"},{"en":"The wind blew fiercely all night.","zh":"风整夜刮得很猛烈。"}]},{"partOfSpeech":"adv.","definition":{"en":"Very strongly or intensely (often about feelings, effort, or competition).","zh":"强烈地；十分激烈地（常指情感、努力或竞争程度）。"},"examples":[{"en":"She is fiercely loyal to her friends.","zh":"她对朋友非常忠诚。"},{"en":"They competed fiercely for the top spot.","zh":"他们为了第一名展开激烈竞争。"}]}],"synonyms":["aggressively","violently","intensely","strongly","ferociously"],"phonetic":"/ˈfɪrsli/","extraExplanation":["“fiercly”通常被视为拼写错误，标准拼写是“fiercely”。词根来自“fierce”（凶猛的/强烈的）+ 副词后缀“-ly”（……地）。","用法提示：描述“行为/力量”时多译为“凶猛地、猛烈地”；描述“态度/情感/竞争”时更自然译为“强烈地、非常……地”。"]}
{"word":"fierding","summary":{"en":"“Fierding” is likely a misspelling of “fielding”: defensive play in sports, or (as “field”) to handle questions/calls.","zh":"“fierding”很可能是“fielding”的拼写错误：指体育中的防守接球/传球，也可指（field）处理问题或来电。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) the act or skill of catching, stopping, and throwing the ball while playing defense in sports like baseball or cricket.","zh":"（很可能是拼写错误）在棒球、板球等运动中，防守时接球、拦球并把球传回的动作或技巧。"},"examples":[{"en":"Her fielding saved two runs in the last inning.","zh":"她的防守接球在最后一局阻止了对方拿到两分。"},{"en":"He practices fielding drills every day.","zh":"他每天练习防守接球的训练。"}]},{"partOfSpeech":"v.","definition":{"en":"(From the verb “field”) to receive or handle something, especially questions, calls, or offers.","zh":"（来自动词 field）接收并处理某事，尤指问题、电话或提议。"},"examples":[{"en":"Our staff will field questions after the presentation.","zh":"演讲结束后我们的工作人员会回答问题。"},{"en":"She fielded calls from customers all morning.","zh":"她一上午都在接听并处理客户来电。"}]}],"synonyms":["defense","catching","handling","dealing with"],"phonetic":"/ˈfiːldɪŋ/","extraExplanation":["“fierding”在英语里不常见，最可能是把 **fielding** 拼错了（把 *el* 写成 *ie*）。常见于体育语境：棒球里指外野/内野的防守接球与传球；板球里指守备。","动词 **field** 在职场/媒体语境也很常见，意思是“接住并处理（问题/电话/提议）”，带有“应对、妥善处理”的感觉。"]}
{"word":"fieri","summary":{"en":"Fieri is most commonly a surname in English (e.g., Guy Fieri), but it can also be Italian for “proud/fierce” (plural) or Latin for “to become/to happen.”","zh":"Fieri 在英语里最常见是姓氏（如 Guy Fieri）；也可能是意大利语中“骄傲的/凶猛的”（复数），或拉丁语“成为/发生”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A surname, best known in the U.S. from TV chef and host Guy Fieri.","zh":"（专有名词）姓氏；在美国最常见的联想是电视名厨/主持人 Guy Fieri（盖·菲耶里）。"},"examples":[{"en":"Guy Fieri is known for visiting casual restaurants on TV.","zh":"Guy Fieri 因在电视上探访平价餐馆而出名。"},{"en":"I saw a clip of Fieri trying spicy wings.","zh":"我看到一段 Fieri 试吃辣鸡翅的片段。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Italian) Masculine plural of fiero: proud; fierce; bold (used to describe people, looks, or even animals).","zh":"（意大利语）形容词 fiero 的阳性复数：骄傲的；凶猛的；大胆的（可形容人、神情，甚至动物）。"},"examples":[{"en":"They are fieri of their hometown.","zh":"他们为自己的家乡感到自豪。"},{"en":"The horses looked fieri and strong.","zh":"那些马看起来凶猛而强壮。"}]},{"partOfSpeech":"v.","definition":{"en":"(Latin) Infinitive meaning “to become” or “to happen” (often seen in older texts, mottos, or academic contexts).","zh":"（拉丁语）不定式，意为“成为/变成”或“发生”（常见于古典文本、格言或学术语境）。"},"examples":[{"en":"In Latin notes, you may see fieri glossed as “to become.”","zh":"在拉丁语笔记中，你可能会看到 fieri 被标注为“变成”。"}]}],"synonyms":["(Italian sense) orgogliosi","(Italian sense) audaci","(Latin sense) become","(Latin sense) happen"],"phonetic":"/ˈfjɛri/","extraExplanation":["在英语语境里，单独看到 **Fieri** 最常指 Guy Fieri（美食节目主持人）。读音通常按英语习惯读成 /ˈfjɛri/。","意大利语里 **fiero → fieri** 是形容词变复数：如 *un uomo fiero*（一个骄傲的男人）→ *uomini fieri*（一些骄傲的男人）。","拉丁语 **fieri** 常被解释为“成为/发生”，与英语里的 *become* 接近；你可能在古典文学、法律/哲学引用或校训里遇到。"]}
{"word":"fierier","summary":{"en":"“Fierier” means “more fiery”: more intense/angry/passionate, or more fire-like in appearance.","zh":"“fierier”表示“更fiery”：更激烈/更易怒/更热情，或外观更火红、更像火。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “fiery”: more intense, passionate, or emotional (often about a person, speech, or argument).","zh":"“fiery”的比较级：更激烈的；更热情的；更情绪化的（常用于形容人、言论或争论）。"},"examples":[{"en":"Her response got fierier as the discussion went on.","zh":"随着讨论继续，她的回应变得更激烈了。"},{"en":"He gave a fierier speech than last time, and the crowd cheered loudly.","zh":"他这次的演讲比上次更热情激昂，观众大声欢呼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “fiery”: more like fire in appearance (bright, glowing, flame-colored).","zh":"“fiery”的比较级：更像火的；更炽亮的；更火焰色的（指外观）。"},"examples":[{"en":"At sunset, the clouds looked fierier than ever.","zh":"日落时，云层看起来比以往更火红炽亮。"},{"en":"The painting uses fierier reds to create a stronger mood.","zh":"这幅画用了更火红的色调来营造更强烈的氛围。"}]}],"synonyms":["more intense","more passionate","more hot-tempered","more blazing","more flame-colored"],"phonetic":"/ˈfaɪriər/","extraExplanation":["“fierier”是形容词“fiery”的比较级，常用来比较两者谁更“火爆/激烈/热情”。最高级是“fieriest”。","拼写变化：fiery → fierier（去掉y加-ier）；发音里通常是三个音节：FI-er-i-er。","在日常表达里，形容人的脾气更常用“more hot-tempered / more temperamental”，但“fierier”更有画面感，也更常见于写作或叙述语气。"]}
{"word":"fieriest","summary":{"en":"“Fieriest” means “the most fiery”—either the most intense/emotional or the most burning/hot.","zh":"“fieriest”表示“最fiery的”——要么指最激烈/最情绪化，要么指最炽热/火势最旺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “fiery”: the most full of strong emotion, energy, or intensity (often describing debates, tempers, speeches, or personalities).","zh":"“fiery”的最高级：最充满强烈情绪、活力或强度的（常用来形容辩论、脾气、演讲或性格）。"},"examples":[{"en":"She gave the fieriest speech of the night, and the audience went silent.","zh":"她发表了当晚最激烈的一场演讲，观众都安静了下来。"},{"en":"Their fieriest arguments usually happen when they’re tired.","zh":"他们最激烈的争吵通常发生在他们疲惫的时候。"},{"en":"He’s known as the fieriest debater on the team.","zh":"他是队里公认最“火爆”的辩手。"}]},{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “fiery”: having the strongest burning heat or flame-like quality; most like fire (literal use).","zh":"“fiery”的最高级：火势最旺的、最炽热的；最像火的（字面意思）。"},"examples":[{"en":"The sunset was the fieriest red they had seen all summer.","zh":"那次日落呈现出他们整个夏天见过最火红的颜色。"},{"en":"They kept a safe distance from the fieriest part of the wildfire.","zh":"他们与野火火势最猛烈的区域保持安全距离。"}]}],"synonyms":["most fiery","most intense","most passionate","most heated","most blazing"],"phonetic":"/ˈfaɪriɪst/","extraExplanation":["“fieriest”是“fiery”的最高级：fiery → fierier → fieriest。拼写上通常直接加 -er/-est（不像以辅音结尾的短词那样需要双写最后一个字母）。","在比喻用法中，“fiery”常带有“火爆、激烈、充满激情甚至易怒”的语气；语境决定是褒义（passionate 热情）还是贬义（hot-tempered 易怒）。"]}
{"word":"fierily","summary":{"en":"“Fierily” means “in a fiery way,” describing either intense emotion or a fire-like glow.","zh":"“Fierily”表示“如火般地”，可形容情绪激烈，也可形容火焰般的明亮/炽热。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows strong emotion, especially anger, passion, or intensity.","zh":"激烈地；情绪强烈地（尤指愤怒、热情或强烈的态度）"},"examples":[{"en":"She spoke fierily about the unfair rule.","zh":"她激烈地谈到那条不公平的规定。"},{"en":"The fans argued fierily over which team was better.","zh":"球迷们激烈地争论哪支球队更强。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that looks or burns like fire; with a bright, flame-like quality.","zh":"如火般地；火焰般明亮地（形容颜色、光或燃烧方式）"},"examples":[{"en":"The sunset glowed fierily across the sky.","zh":"夕阳如火般在天空中燃烧发光。"},{"en":"Her hair shone fierily in the sunlight.","zh":"她的头发在阳光下闪着火焰般的光泽。"}]}],"synonyms":["passionately","angrily","heatedly","intensely","flamingly"],"phonetic":"/ˈfaɪrəli/","extraExplanation":["“fierily”来自形容词“fiery（如火的；暴烈的）”加副词后缀“-ly”。写作中常用来描写说话方式（fierily criticize/deny/protest）或视觉效果（fierily red/orange glow）。","它带有明显的情感色彩：用于人时多强调“激烈、易怒、充满激情”；用于景物时更偏“火红、炽亮”。注意与“angrily（生气地）”相比，“fierily”更强调“像火一样的强度/爆发力”。"]}
{"word":"fieriness","summary":{"en":"Fieriness means strong passion or intensity, or a fiery flame-like look.","zh":"Fieriness 指强烈的热情/激烈情绪，或像火焰般的外观与色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being intense, passionate, or full of strong emotion (often showing itself in speech or behavior).","zh":"激烈、热情或情绪强烈的特质（常表现在言语或行为中）。"},"examples":[{"en":"People admired her fieriness in the debate, even when they disagreed with her.","zh":"即使不同意她的观点，人们也钦佩她在辩论中的那股“火气”和激情。"},{"en":"His fieriness sometimes came across as impatience.","zh":"他的火爆劲儿有时会让人觉得是在不耐烦。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being fiery in appearance, like flames or bright red/orange color.","zh":"外观像火焰般的特质（如火焰般的光亮或红橙色的强烈色彩）。"},"examples":[{"en":"The sunset had a fieriness that filled the sky with orange and red.","zh":"日落带着一种火焰般的炽烈，把天空染成橙红色。"},{"en":"The painting’s fieriness made the room feel warmer.","zh":"这幅画火一般的色调让房间感觉更温暖。"}]}],"synonyms":["passion","intensity","spirit","ardor","vehemence","heat","temper"],"phonetic":"/ˈfaɪəɹinəs/","extraExplanation":["“fieriness”来自形容词“fiery”（像火的；激烈的；易怒的）加名词后缀“-ness”，表示“……的特质/状态”。常用来形容人的性格或表达方式（热烈、强硬、火爆），也可形容景色与颜色的“火焰感”。","语气提示：描述人时既可能是褒义（有激情、有斗志），也可能偏贬义（脾气急、火气大）。选择时可搭配更中性的词，如“passion/energy”，或更负面的“temper/irritability”。"]}
{"word":"fierinesses","summary":{"en":"“Fierinesses” is the plural of “fieriness,” meaning strong passion or a fiery temper, and sometimes a fire-like heat or brightness.","zh":"“Fierinesses”是“fieriness”的复数，常指强烈的激情或火爆脾气，也可指像火一样的热度或光亮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being fiery: showing strong passion, intensity, or easily provoked anger.","zh":"火热（火爆）的特质：指充满激情、强烈的情绪，或容易被激怒的脾气。"},"examples":[{"en":"Her fierinesses on stage made the performance unforgettable.","zh":"她在舞台上的火热激情让表演令人难忘。"},{"en":"His fierinesses sometimes turned small disagreements into big arguments.","zh":"他的火爆脾气有时会把小分歧变成大争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literal/figurative) The state of seeming like fire in color, heat, or energy.","zh":"（字面/引申）像火一样的状态：指颜色、热度或能量上呈现“火”的感觉。"},"examples":[{"en":"The sunset had a fierinesses that lit up the whole sky.","zh":"夕阳带着火一般的绚烂，点亮了整片天空。"},{"en":"The chili’s fierinesses hit me immediately.","zh":"那辣椒的火辣劲儿立刻冲上来。"}]}],"synonyms":["passions","intensities","tempers","spicinesses","heats"],"phonetic":"ˈfaɪəriˌnəsɪz","extraExplanation":["“fierinesses”是名词复数，单数是“fieriness”（/ˈfaɪəriˌnəs/）。在日常英语里更常见的是用单数抽象名词“fieriness”，或改用更自然的表达：\n- 表示“火爆脾气/易怒”：temper, anger, irritability\n- 表示“激情/热情”：passion, intensity, fire\n- 表示“火辣（食物）”：spiciness, heat\n复数“fierinesses”通常出现在需要强调“多种不同的火热特质/多次表现”的语境中（更偏写作或修辞）。"]}
{"word":"fiers","summary":{"en":"“fiers” is usually a misspelling of “fierce,” meaning intense/violent or boldly confident.","zh":"“fiers”通常是“fierce”的拼写错误；“fierce”表示“猛烈/激烈/凶猛”，也可指“强势自信、有气场”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Not a standard English word; people usually mean “fierce.”","zh":"（常见拼写错误）这不是标准英文单词；通常想写的是“fierce”。"},"examples":[{"en":"I think you mean “fierce,” not “fiers.”","zh":"我觉得你想写的是“fierce”，不是“fiers”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very strong, intense, or violent (often describing people, animals, weather, competition, or emotions).","zh":"非常强烈的；凶猛的；激烈的（常形容人/动物/天气/竞争/情绪）。"},"examples":[{"en":"A fierce storm hit the coast last night.","zh":"昨晚一场猛烈的暴风雨袭击了海岸。"},{"en":"They are fierce competitors, but they respect each other.","zh":"他们是激烈的竞争对手，但彼此尊重。"},{"en":"She gave him a fierce look.","zh":"她狠狠地瞪了他一眼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fearless, bold, and powerfully confident (often used as praise in modern English).","zh":"无畏的；强势自信的（现代英语中常作称赞）。"},"examples":[{"en":"She’s a fierce leader who speaks up for her team.","zh":"她是一位强势的领导者，会为团队发声。"},{"en":"That performance was fierce.","zh":"那个表演太炸裂/太有气场了。"}]}],"synonyms":["intense","violent","ferocious","strong","brutal","bold","confident"],"phonetic":"/fɪrs/","extraExplanation":["“fierce”在流行文化和日常口语里也常带有积极含义，类似“很有气场、很强、很酷”。但在正式语境中，它更多指“猛烈、激烈、凶猛”。","词源上，“fierce”来自法语/拉丁语体系，和“wild（野性的）/ferocious（凶猛的）”在感觉上接近。"]}
{"word":"fierte","summary":{"en":"“fierte” is usually a French-based spelling of fierté, meaning “pride,” and it’s not a standard everyday English word.","zh":"“fierte”多半是法语 fierté 的英语语境写法，意思是“自豪/骄傲”，但并非标准常用英语词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Borrowed from French) pride; a feeling of dignity, self-respect, or satisfaction in oneself or a group.","zh":"（源自法语的借词）自豪；骄傲；对自己或群体的尊严、自尊或成就感的感受。"},"examples":[{"en":"She spoke with fierté about her family’s history.","zh":"她谈起家族历史时带着自豪。"},{"en":"The parade was a celebration of fierté and community.","zh":"这场游行是在庆祝自豪与社群凝聚。"}]}],"synonyms":["pride","self-respect","dignity"],"phonetic":"/fjɛrˈteɪ/","extraExplanation":["“fierte”本身不是常见英语拼写，更常见的法语写法是 **fierté**（带重音符号 é）。在英语文章里偶尔会保留法语拼写，用来营造法语语感或讨论法语文化语境。","在法语语境中，**fierté**常指“自豪/自尊”，也常出现在表达 **Fierté (Pride)** 的活动名称中（如 LGBTQ+ Pride 的法语说法）。","如果你其实想查英语单词，可能是拼写接近的：**fierce**（凶猛的/激烈的），或 **fiery**（火热的/易怒的）。你告诉我你想表达的中文意思，我可以帮你定位正确的英语词。"]}
{"word":"fiery","summary":{"en":"Fiery means (1) burning hot or flame-like, or (2) intensely emotional—often angry or passionate.","zh":"Fiery 表示（1）炽热、像火焰般燃烧的；（2）情绪强烈的，常指愤怒或热情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of fire or intense heat; burning or glowing like flames.","zh":"炽热的；像火焰一样燃烧或发光的。"},"examples":[{"en":"The sunset turned the sky fiery red.","zh":"日落把天空染成了火红色。"},{"en":"Firefighters entered the fiery building.","zh":"消防员进入了着火的建筑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing strong emotion (often anger or passion); intense and energetic in a way that feels like fire.","zh":"（常指愤怒或热情）强烈的；激烈而有冲劲的。"},"examples":[{"en":"She gave a fiery speech about fairness.","zh":"她就公平问题发表了一场慷慨激昂的演讲。"},{"en":"He has a fiery temper and gets upset quickly.","zh":"他脾气火爆，很容易生气。"}]}],"synonyms":["burning","flaming","blazing","heated","passionate","hot-tempered"],"phonetic":"/ˈfaɪ(ə)ri/","extraExplanation":["“fiery”常用来做比喻，把情绪或风格说成“像火一样”。最常见的搭配有：fiery temper（火爆脾气）、fiery debate/argument（激烈争论）、fiery speech（慷慨激昂的演讲）、fiery red/orange（火红/橘红）。","语感提示：形容“人”时，fiery 往往带一点“容易发怒/冲动”的意味；形容“演讲/表演/性格”时，也可偏正面，表示“充满热情与力量”。"]}
{"word":"fieryness","summary":{"en":"Fieryness means the quality of being fiery—either passionate and intense, or literally hot and burning.","zh":"Fieryness 指“火热”的特质：可以是情感/表达上的热烈强烈，也可以是字面上的炽热灼烧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being fiery: having strong passion, energy, or intensity (in feelings, style, or expression).","zh":"火热的特质：指在情感、风格或表达上充满强烈的激情、能量或力度。"},"examples":[{"en":"Her fieryness in debates made people pay attention.","zh":"她在辩论中的火热劲儿让大家都注意到她。"},{"en":"The novel is remembered for the fieryness of its language.","zh":"这部小说因语言的火热与强烈而令人难忘。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being like fire in appearance or effect, such as being very hot, burning, or bright.","zh":"如火一般的性质：指非常炽热、灼烧或明亮等外观或效果。"},"examples":[{"en":"The fieryness of the desert wind surprised the hikers.","zh":"沙漠热风的炽热让徒步者很吃惊。"},{"en":"They stepped back from the fieryness of the flames.","zh":"他们从火焰的灼热中后退了一步。"}]}],"synonyms":["fieriness","passion","intensity","heat","ardor"],"phonetic":"/ˈfaɪəriˌnɛs/","extraExplanation":["“fieryness”在英语里能用，但更常见、更自然的名词形式是“fieryness/fiery quality”较少见，写作和正式表达中更常用“fieriness”。如果你想表达“脾气火爆/热烈的性格”，也常用“fire”或“passion”（如: She has a lot of fire/passion）。"]}
{"word":"fiesta","summary":{"en":"A fiesta is a lively party or festival, often with Spanish/Latin American flavor.","zh":"Fiesta 指热闹的派对或节庆活动，常带有西语/拉丁美洲文化氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A party or celebration, especially one with Spanish or Latin American style (often with music, dancing, and food).","zh":"（尤指西班牙或拉丁美洲风格的）庆典；聚会；节日活动（常有音乐、舞蹈和美食）。"},"examples":[{"en":"We’re having a small fiesta for my birthday this weekend.","zh":"这个周末我们要为我的生日办一个小庆祝派对。"},{"en":"The town held a fiesta with parades, dancing, and street food.","zh":"这个小镇举办了庆典，有游行、舞蹈和街头美食。"}]}],"synonyms":["party","festival","celebration","festivity"],"phonetic":"/fiˈɛstə/","extraExplanation":["“Fiesta”来自西班牙语，原意与“节日/宗教节庆日”相关；在英语里常用来指带有拉丁文化氛围的热闹庆祝活动。","文化使用上，它通常带有积极、热闹、色彩鲜明的感觉；在一些场合也可泛指任何派对，但会暗示“像拉丁派对那样欢乐”。","相关搭配：street fiesta（街头庆典）、fiesta atmosphere（节庆氛围）、have/throw a fiesta（办庆祝派对）。"]}
{"word":"fiestas","summary":{"en":"“Fiestas” means celebrations or festivals (plural of “fiesta”), often in a Spanish/Latin cultural style.","zh":"“fiestas”指庆典或节日活动（fiesta 的复数），常带有西语/拉丁文化风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"celebrations or festivals (plural of “fiesta”), often with music, dancing, food, and community events; commonly used in English to describe Spanish or Latin American-style festivities.","zh":"庆典；节日庆祝活动（“fiesta”的复数），通常有音乐、舞蹈、美食和社区活动；英语中常用来指西班牙语文化或拉丁美洲风格的庆祝。"},"examples":[{"en":"The town holds summer fiestas with parades and live music.","zh":"这个小镇夏天会举办庆典，有游行和现场音乐。"},{"en":"We tried street food during the fiestas and watched the dancers.","zh":"我们在庆典期间品尝了街头小吃，还观看了舞者表演。"},{"en":"Many cities host cultural fiestas to celebrate local traditions.","zh":"许多城市会举办文化庆典来庆祝当地传统。"}]}],"synonyms":["festivals","celebrations","fêtes","parties","carnivals"],"phonetic":"/fiˈɛstəz/","extraExplanation":["“fiesta”是西班牙语借词，原意是“节日/庆祝日”。在英语里常用来营造一种“热闹、色彩丰富、带有西语文化氛围”的感觉，因此你会在旅游、餐饮、城市活动宣传中经常看到。","英语里也可能把它泛指为“派对”，但最常见的语感仍偏向“节庆/民俗活动”而不只是普通聚会。"]}
{"word":"fieulamort","summary":{"en":"“fieulamort” is not a standard English word; it’s likely a coined name/handle and may echo French “(la) mort” = “death.”","zh":"“fieulamort”不是标准英语词；更可能是自造的名字/网名，并可能借用了法语“(la) mort”=“死亡”的意象。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a made-up term, a username/handle, or a stylized phrase (it visually resembles French “la mort,” meaning “death”).","zh":"不是标准英语单词。更可能是自造词、用户名/网名，或一种风格化拼写（外观上类似法语“la mort”，意为“死亡”）。"},"examples":[{"en":"My online handle is “fieulamort.”","zh":"我的网名是“fieulamort”。"},{"en":"I saw “fieulamort” credited as the artist name.","zh":"我看到“fieulamort”被署名为艺名。"}]}],"synonyms":["(none—proper/coinage)"],"phonetic":"/ˌfiːjuːləˈmɔrt/","extraExplanation":["从形式上看，它像是把几个片段连在一起的拼写，其中“mort / la mort”在法语里常与“死亡”相关（如“la mort”=“死亡”）。但“fieul”并不是常见的英语或法语标准词形，因此更像是个人创作/昵称/作品名。","如果你能告诉我它出现的语境（歌曲/小说/游戏/社交平台简介等）或你想表达的语言（英语/法语/越南语等），我可以更准确地判断含义与更自然的读法。"]}

