{"word":"fig","summary":{"en":"A fig is a sweet fruit (or the tree that produces it). Informally, “a fig” can mean “nothing/very little,” as in “I don’t give a fig.”","zh":"fig 指“无花果”或“无花果树”。在非正式且较旧的用法中，a fig 也可表示“没什么/一点也不”，如 I don’t give a fig（我一点也不在乎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, sweet fruit with many tiny seeds, often eaten fresh or dried.","zh":"无花果（一种柔软香甜、含许多小籽的水果，可鲜食或晒干食用）"},"examples":[{"en":"I like dried figs as a snack.","zh":"我喜欢把无花果干当零食。"},{"en":"She added figs to the salad for sweetness.","zh":"她在沙拉里加了无花果来增加甜味。"},{"en":"This cake is made with fig jam.","zh":"这款蛋糕用的是无花果酱。"}]},{"partOfSpeech":"n.","definition":{"en":"The tree that produces figs.","zh":"无花果树（结无花果的树）"},"examples":[{"en":"A fig tree grows in their backyard.","zh":"他们后院里长着一棵无花果树。"},{"en":"The fig tree needs lots of sun.","zh":"无花果树需要充足的阳光。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, old-fashioned) A small or no amount; used to show you do not care at all.","zh":"（非正式、较旧用法）一点点；用来表示“完全不在乎”"},"examples":[{"en":"I don’t give a fig what he thinks.","zh":"我才不在乎他怎么想。"},{"en":"She doesn’t care a fig about fame.","zh":"她对名气一点也不在乎。"}]}],"synonyms":["(fruit) fresh fig","(dried) dried fig","(informal sense) nothing","not a bit"],"phonetic":"/fɪɡ/","extraExplanation":["“fig”最常见指水果/果树。英语里也有固定说法：\n- a fig leaf：原指《圣经》中用无花果叶遮羞，引申为“遮羞布/借口”。\n- I don’t give a fig：较口语、带老派色彩，表示“我一点也不在乎”。在更中性的场合可用 I don’t care at all。"]}
{"word":"fig-filled","summary":{"en":"“Fig-filled” means made with a fig filling, especially in cookies or pastries.","zh":"“fig-filled”指（饼干或点心等）夹无花果馅的、以无花果为内馅的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing figs as a filling, especially in a cookie, pastry, or bar.","zh":"（尤指饼干、点心或条状糕点）以无花果为内馅的；夹无花果馅的。"},"examples":[{"en":"She packed a couple of fig-filled cookies for the trip.","zh":"她为旅行装了几块夹无花果馅的饼干。"},{"en":"The bakery’s fig-filled bars taste sweet and slightly earthy.","zh":"那家面包店的无花果夹心条甜甜的，带一点朴实的果香。"}]}],"synonyms":["fig-stuffed","filled with figs","fig-filled cookies","fruit-filled (more general)"],"phonetic":"/ˈfɪɡ fɪld/","extraExplanation":["“fig-filled”常见于食品包装或菜单描述，属于复合形容词：fig（无花果）+ filled（装满/夹馅的）。在美式英语里，你也可能看到类似表达：fruit-filled（水果夹心的）、cream-filled（奶油夹心的）。","在美国文化中，很多人会把fig-filled cookies联想到一种很常见的点心（如“fig newtons”这类无花果夹心饼干）。"]}
{"word":"fig-flavored","summary":{"en":"“Fig-flavored” means tasting or smelling like figs.","zh":"“fig-flavored”表示“无花果风味的”，有无花果的味道或香气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the taste, smell, or added flavor of figs (a sweet fruit).","zh":"带有无花果（甜水果）味道或香气的；无花果风味的。"},"examples":[{"en":"I bought a fig-flavored yogurt for breakfast.","zh":"我买了无花果风味的酸奶当早餐。"},{"en":"The tea is fig-flavored, so it tastes sweet and fruity.","zh":"这款茶是无花果风味的，所以喝起来甜甜的、很果香。"}]}],"synonyms":["fig-flavoured","figgy (informal)","with a fig flavor"],"phonetic":"/ˈfɪɡ ˌfleɪvərd/","extraExplanation":["“fig-flavored”是由名词 fig（无花果）+ 形容词 flavored（有……味道的）构成的复合形容词，常用来描述食品、饮料、糖果、电子烟烟油等的口味。","在包装或菜单上常见的近似表达还有：fig flavor / with fig flavor / fig-flavoured（英式拼写多用 -oured）。","注意：fig-flavored 通常表示“像无花果的味道”或“添加了无花果香精/风味”，不一定代表含有真正的无花果果肉或果汁；如果是“真的含无花果”，更常写 made with figs / contains real figs。"]}
{"word":"fig-like","summary":{"en":"“Fig-like” means resembling a fig, especially in shape or taste.","zh":"“fig-like”表示“像无花果的”，常指形状或味道类似无花果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a fig in shape, color, texture, or flavor.","zh":"像无花果的；在形状、颜色、质地或味道上类似无花果的。"},"examples":[{"en":"The pastry had a fig-like sweetness and a soft, seedy texture.","zh":"这款点心有一种无花果般的甜味，还有柔软、带籽的口感。"},{"en":"She described the fruit as fig-like, but slightly more tart.","zh":"她形容那种水果像无花果，但更酸一点。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a figurative or visual similarity to a fig (often used in descriptive writing).","zh":"（多用于描写性文字）在意象或外观描写上像无花果的。"},"examples":[{"en":"In the painting, the clouds form fig-like shapes near the horizon.","zh":"在那幅画里，地平线附近的云形成了无花果般的形状。"},{"en":"The stone had a fig-like bulge, rounded and slightly wrinkled.","zh":"那块石头有个无花果般的隆起，圆润且略带褶皱。"}]}],"synonyms":["figgy","fig-scented","fig-flavored","figgy (informal)"],"phonetic":"/ˈfɪɡ ˌlaɪk/","extraExplanation":["“fig-like”是由名词“fig（无花果）+ -like（像……一样）”构成的复合形容词。写作中常用来传达一种具体的感官印象（外形、口感、甜香、籽的颗粒感等）。","在饮食语境里，它通常暗示“蜂蜜样的甜、略带果酱感、细小籽粒、柔软黏润”的联想；在描写物体外观时，则常指“梨形/圆鼓、略有褶皱”的形态。"]}
{"word":"fig-marigold","summary":{"en":"A succulent ground-cover plant with bright daisy-like flowers; some types spread aggressively.","zh":"一种多肉质地被植物，开明亮的雏菊状花；部分类型蔓延性强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trailing plant with thick, fleshy leaves and bright daisy-like flowers, often grown as a ground cover in dry, sandy places; some kinds can spread aggressively","zh":"一种匍匐生长、叶片肥厚多汁、开雏菊状艳丽花的植物，常作耐旱地被植物；某些品种扩散力很强"},"examples":[{"en":"Fig-marigold is often planted on slopes to help cover the soil.","zh":"人们常把 fig-marigold 种在坡地上，用来覆盖地面。"},{"en":"Along the coast, fig-marigold can spread quickly and crowd out native plants.","zh":"在海岸地区，fig-marigold 可能快速蔓延，挤压本地植物的生长空间。"}]}],"synonyms":["ice plant","Carpobrotus","highway ice plant"],"phonetic":"/ˈfɪɡ ˌmærəˌɡoʊld/","extraExplanation":["“Fig-marigold”这个名字来自它的果实外形有点像无花果（fig），而花形又像金盏/万寿菊一类的“marigold”。不过它并不是真正的无花果或万寿菊。","常见的“fig-marigold”包括南非原产的冰花属（Carpobrotus）植物（如 highway ice plant）。在一些沿海地区它被当作观赏或固沙地被，但也可能成为入侵植物，影响生态。"]}
{"word":"fig-pecker","summary":{"en":"A regional/common-name term for a small bird known for pecking and eating figs.","zh":"一个带地域色彩的俗称，指以啄食无花果闻名的小型鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bird (often a white-eye) known for pecking and eating ripe figs; used as a common name in some regions.","zh":"无花果啄鸟；常指会啄食成熟无花果的小型鸟（在一些地区常用作“绣眼鸟”等的俗名）。"},"examples":[{"en":"A few fig-peckers were hopping in the fig tree, picking at the fruit.","zh":"几只无花果啄鸟在无花果树上跳来跳去，啄食果子。"},{"en":"The farmer netted the fig tree to keep fig-peckers from ruining the crop.","zh":"农夫给无花果树罩上网，防止无花果啄鸟把收成弄坏。"}]}],"synonyms":["white-eye (regional)","small fruit-eating bird","fruit pecker (informal)"],"phonetic":"/ˈfɪɡ ˌpɛkɚ/","extraExplanation":["“fig-pecker”并不是全球通用的标准鸟名，更常见于地方性英语（例如南非英语）里，用来指一些爱吃无花果的小鸟；不同地区可能指向不同物种。","这个词由 fig（无花果）+ pecker（啄食者）构成，语感偏口语、描述性，写作时若需要更正式或更准确，通常会用具体鸟类名称（如 white-eye 等）或直接说 “a bird that eats figs”。"]}
{"word":"fig-shaped","summary":{"en":"“Fig-shaped” means shaped like a fig—rounded or pear-like, wider at one end and narrower at the other.","zh":"“fig-shaped”指无花果形的：外形像无花果，近圆或梨形，一端较宽一端较窄。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a fig (the fruit): usually rounded or pear-like, wider at one end and narrower at the other.","zh":"呈无花果形的：形状像无花果（果实），通常近圆形或梨形，一端较宽、另一端较窄。"},"examples":[{"en":"The vase has a fig-shaped body with a narrow neck.","zh":"这个花瓶的瓶身呈无花果形，瓶颈较细。"},{"en":"She chose a fig-shaped pendant because it looked soft and natural.","zh":"她选了一个无花果形的吊坠，因为看起来柔和又自然。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in science or description) Resembling a fig in overall form; fig-like.","zh":"（常用于科学或描写）整体形态类似无花果的；无花果状的。"},"examples":[{"en":"Some bulbs are described as fig-shaped in older gardening guides.","zh":"一些球茎在较早的园艺指南里被描述为无花果状的。"},{"en":"The diagram shows a fig-shaped outline tapering toward the base.","zh":"图示显示出一个无花果状的轮廓，向底部逐渐变窄。"}]}],"synonyms":["fig-like","pear-shaped (similar)","teardrop-shaped (similar)"],"phonetic":"/fɪɡ ʃeɪpt/","extraExplanation":["“fig-shaped”是由名词fig（无花果）+ shaped（……形状的）构成的复合形容词，常用于描述器物、图形或生物结构的外形。写作中也常见类似结构：heart-shaped（心形的）、pear-shaped（梨形的）、bell-shaped（钟形的）。","连字符（-）常用于把“名词 + shaped”连成一个整体形容词，尤其在名词前作定语时更常见：a fig-shaped vase（一个无花果形的花瓶）。如果放在系动词后也可不加连字符，但加上更清晰：The vase is fig-shaped."]}
{"word":"figaro","summary":{"en":"Figaro is a famous fictional character from French theater and a major figure in well-known operas (Mozart and Rossini).","zh":"Figaro（费加罗）是法国戏剧中的著名人物，也是在莫扎特、罗西尼等经典歌剧中出现并常被引用的文化形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous fictional character (a clever, witty servant) from French plays by Pierre Beaumarchais; also used as a cultural reference in opera.","zh":"费加罗：法国剧作家博马舍（Beaumarchais）戏剧中的著名虚构人物（机智、聪明的仆人/理发师）；也常作为歌剧中的文化典故被提及。"},"examples":[{"en":"In Mozart’s opera The Marriage of Figaro, Figaro is smart and quick with words.","zh":"在莫扎特的歌剧《费加罗的婚礼》中，费加罗聪明机敏、能言善辩。"},{"en":"The teacher called him “a Figaro” because he always found a clever solution.","zh":"老师叫他“费加罗”，因为他总能想出聪明的解决办法。"}]},{"partOfSpeech":"n.","definition":{"en":"A well-known aria title used as a reference: “Largo al factotum” (“Figaro! Figaro! Figaro!”) from Rossini’s The Barber of Seville.","zh":"一个常被引用的咏叹调/唱段典故：罗西尼歌剧《塞维利亚的理发师》中的《Largo al factotum》（常听到“Figaro! Figaro! Figaro!”）。"},"examples":[{"en":"That “Figaro, Figaro” line comes from Rossini’s The Barber of Seville.","zh":"那句“Figaro, Figaro”出自罗西尼的《塞维利亚的理发师》。"},{"en":"In the movie, he hummed the Figaro aria to show off his singing.","zh":"电影里他哼起“费加罗”咏叹调来炫耀自己的歌喉。"}]}],"synonyms":["character","cultural reference","opera character"],"phonetic":"/ˈfɪɡəˌroʊ/","extraExplanation":["“费加罗”最早出自博马舍的三部曲（常被称为“费加罗三部曲”）：《塞维利亚的理发师》《费加罗的婚礼》《有罪的母亲》。其中《塞维利亚的理发师》被罗西尼改编成歌剧，《费加罗的婚礼》被莫扎特改编成歌剧。","在英语里，Figaro有时被借用来形容“机灵、善于周旋、反应快的人”（多带轻松、夸赞的语气），但这属于文化引用，用时要注意语境。"]}
{"word":"figary","summary":{"en":"“Figary” is a rare word meaning a whim or odd, unexpected idea/action.","zh":"“figary”是个很少见的词，意思是“怪念头/一时兴起的任性之举”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strange or unexpected idea or action; a whim or odd fancy (rare/old-fashioned).","zh":"古/罕用：奇特或出人意料的想法或行为；一时的怪念头、任性之举。"},"examples":[{"en":"Buying a dozen hats at once was just a figary—she didn’t even wear them.","zh":"一下子买了十几顶帽子只是她一时的怪念头——她甚至都不戴。"},{"en":"He’s full of little figaries that make life interesting.","zh":"他总有些小怪点子，让生活更有趣。"}]}],"synonyms":["vagary","whim","caprice","fancy"],"phonetic":"/ˈfɪɡəri/","extraExplanation":["“figary”在现代英语里非常少见，多见于较旧的文学或方言用法。含义通常接近更常用的“vagary / whim”（奇想、任性之举）。","拼写上也有人把它当作“vagary”的罕见变体；写作或考试中更建议用更常见的词（vagary, whim, caprice）。"]}
{"word":"figbird","summary":{"en":"A fruit-eating Australasian bird, especially the Australasian (Green) Figbird.","zh":"一种爱吃水果的澳大拉西亚鸟类，尤指澳洲的（绿）无花果鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of Australasian bird (genus *Sphecotheres*) that often feeds on figs and other fruit; especially the Australasian (Green) Figbird, common in parts of Australia and nearby regions.","zh":"一种澳大拉西亚地区的鸟（无花果鸟属 *Sphecotheres*），常吃无花果等水果；尤指澳洲常见的（绿）无花果鸟。"},"examples":[{"en":"We heard a figbird calling in the fig tree behind the house.","zh":"我们听到屋后那棵无花果树里有无花果鸟在叫。"},{"en":"Figbirds often visit gardens when fruit is ripe.","zh":"果子成熟时，无花果鸟常会到花园里觅食。"}]}],"synonyms":["Australasian figbird","green figbird"],"phonetic":"/ˈfɪɡˌbɝːd/","extraExplanation":["“figbird”主要是澳大利亚/大洋洲语境里的鸟名，在北澳、昆士兰、新南威尔士等地较常见。英文里也常写作“figbird”或“fig bird”。","它的名字很直观：fig（无花果）+ bird（鸟），强调这种鸟喜欢吃无花果和其他水果；观鸟文章中也常提到它们会出现在果树附近。"]}
{"word":"figboy","summary":{"en":"“figboy” is not a standard English word; it’s usually a literal “fig-loving boy” or an online nickname.","zh":"“figboy”不是标准常用词；通常是字面上的“爱无花果的男孩/卖无花果的男孩”，或是网络昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Literal) a boy or young man associated with figs (for example, someone who grows, sells, or really likes figs). Not a common fixed phrase in everyday English.","zh":"（字面义）“无花果男孩/爱吃无花果的男孩”：指与无花果有关的男孩或年轻男子（如种植、售卖或特别喜欢无花果的人）。这不是英语里常见的固定说法。"},"examples":[{"en":"At the farmers’ market, the fig boy always gives me the sweetest figs.","zh":"在农贸市场里，那个“无花果男孩”总会给我最甜的无花果。"},{"en":"He jokingly calls himself a fig boy because he eats figs every day.","zh":"他开玩笑说自己是“无花果男孩”，因为他每天都吃无花果。"}]},{"partOfSpeech":"n.","definition":{"en":"(Online use) a nickname/username built from “fig” + “boy,” often suggesting a playful or aesthetic persona rather than a dictionary meaning.","zh":"（网络用法）由“fig（无花果）+ boy（男孩）”组成的昵称/网名，通常是一种好玩或风格化的人设，并不一定有固定词典义。"},"examples":[{"en":"Figboy posted a new video about baking fig bars.","zh":"Figboy 发了一个关于烤无花果饼干的新视频。"},{"en":"My gamer tag is Figboy, but it doesn’t really mean anything.","zh":"我的游戏昵称是 Figboy，但其实没什么特别含义。"}]}],"synonyms":["fig lover","fig fan","nickname","username"],"phonetic":"/ˈfɪɡ ˌbɔɪ/","extraExplanation":["“figboy”不是常见的标准英语单词，更多情况下像是网名、昵称或临时起的绰号。","如果你是在某个短视频、游戏或社群里看到“figboy”，它可能有特定圈内含义；也有可能是把更常见的俚语“F-boy”（粗口缩写，指玩弄感情的花心男）误写成了“figboy”。如果你能提供句子语境，我可以更准确解释。"]}
{"word":"figeater","summary":{"en":"Fig-eater means someone (or an animal) that eats figs, and it can also be an older/common name for certain fruit-eating birds.","zh":"Fig-eater 指吃无花果的人或动物；也可作旧称/俗称，指某些爱吃水果（尤其无花果）的鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that eats figs (the fruit).","zh":"吃无花果的人或动物。"},"examples":[{"en":"The tortoise is a fig-eater and also enjoys other fruits.","zh":"这只陆龟爱吃无花果，也喜欢其他水果。"},{"en":"As a child, he was a devoted fig-eater during summer harvest season.","zh":"小时候在夏季收获期，他特别爱吃无花果。"}]},{"partOfSpeech":"n.","definition":{"en":"A common name for certain birds known for eating figs, especially in older or regional usage.","zh":"（旧称/地域用法）对某些以无花果为食的鸟类的俗称。"},"examples":[{"en":"In older travel writing, the golden oriole is sometimes described as a fig-eater.","zh":"在较早的游记中，金黄鹂有时被称为“fig-eater（食无花果的鸟）”。"},{"en":"The fig-eater was blamed for raiding orchards when fruit was ripe.","zh":"果子成熟时，人们把它怪罪成会偷吃果园果实的“fig-eater”。"}]}],"synonyms":["fig eater","fruit-eater","frugivore"],"phonetic":"/ˈfɪɡˌiːtɚ/","extraExplanation":["“fig-eater”更常见的写法是带连字符的 fig-eater，直观意思就是“吃无花果的（人/动物）”。","作为鸟类俗称时，它不是一个严格的物种学名称；在一些较老的英语文本里，会用来形容爱吃成熟水果（尤其无花果）的鸟，比如金黄鹂等。不同地区可能指代不同鸟类，因此在正式语境中更建议使用具体物种名。"]}
{"word":"figeaters","summary":{"en":"“Figeaters” usually means those that eat figs, and in U.S. usage it often refers to the figeater beetle.","zh":"“figeaters”通常指吃无花果的人或动物；在美国用法中常指“无花果甲虫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or animals that eat figs.","zh":"吃无花果的人或动物。"},"examples":[{"en":"In late summer, figeaters can be seen gathering under ripe fig trees.","zh":"夏末时，常能看到吃无花果的动物聚集在成熟的无花果树下。"},{"en":"The diary describes villagers as figeaters during the harvest season.","zh":"日记把村民描写成在收获季节“吃无花果的人”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in the U.S.) A common name for the figeater beetle, a large green scarab beetle often found around ripe fruit.","zh":"（尤指在美国）“无花果甲虫”的俗称：一种大型绿色金龟子，常出现在成熟水果附近。"},"examples":[{"en":"Figeaters buzz loudly around the patio when the fruit is overripe.","zh":"水果过熟时，无花果甲虫会在露台附近嗡嗡作响。"},{"en":"The gardener covered the peaches to keep figeaters away.","zh":"园丁把桃子罩起来，防止无花果甲虫靠近。"}]}],"synonyms":["fig eaters","figeater beetles","fruit-eating beetles"],"phonetic":"/ˈfɪɡˌiːtərz/","extraExplanation":["“figeaters”通常是复数形式，单数是“figeater”（也可写作“fig-eater”）。","在美国口语里，很多人说“figeater(s)”时指的是无花果甲虫（figeater beetle），常见于加州等地；它们也会取食桃子、葡萄等熟果，因此不一定只吃无花果。","在生物分类或更正式的语境中，人们可能会直接说“figeater beetle”以避免歧义。"]}
{"word":"figent","summary":{"en":"“figent” isn’t a standard English word; it’s likely meant to be “fidget” or “figment.”","zh":"“figent”不是标准英文单词；多半是想写 “fidget” 或 “figment”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a misspelling or typo. Common intended words are “fidget” (move restlessly) or “figment” (something imagined).","zh":"不是常见词典里的标准英文单词；更可能是拼写错误。常见的目标词可能是 “fidget”（坐立不安地动）或 “figment”（想象出来的事物）。"},"examples":[{"en":"If you meant “fidget,” you could say: “He started to fidget during the long meeting.”","zh":"如果你想写的是 “fidget”，可以说：“在漫长的会议中，他开始坐立不安地动来动去。”"},{"en":"If you meant “figment,” you could say: “That fear was just a figment of her imagination.”","zh":"如果你想写的是 “figment”，可以说：“那种恐惧只是她想象出来的。”"}]}],"synonyms":["fidget","squirm","wiggle","figment","illusion"],"phonetic":"/ˈfɪdʒɪt/","extraExplanation":["“figent”常见于打字误触或二语学习者的拼写混淆。你可以回想一下你想表达的是“坐立不安地动”（fidget）还是“虚构/想象出来的东西”（figment）。如果你告诉我一句包含 figent 的原句，我也可以帮你准确判断应该是哪一个词。"]}
{"word":"figeter","summary":{"en":"Likely intended: fidgeter — a person who makes small, restless movements.","zh":"很可能是想写：fidgeter——指爱做小动作、坐立不安的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who fidgets (keeps making small, restless movements, often because they feel nervous, bored, or impatient).","zh":"爱坐立不安的人；总爱小动作的人（常因紧张、无聊或不耐烦而不断做小动作）。"},"examples":[{"en":"I’m a fidgeter, so I like having a stress ball during meetings.","zh":"我很爱坐立不安，所以开会时我喜欢捏个减压球。"},{"en":"The teacher asked the fidgeter to sit near the front to stay focused.","zh":"老师让那个爱小动作的学生坐到前排，好更专心。"}]}],"synonyms":["restless person","squirmy person","wiggler"],"phonetic":"/ˈfɪdʒɪtər/","extraExplanation":["“figeter”更常见是拼写错误，正确拼法通常是 **fidgeter**（来自动词 *fidget*，意为“坐立不安/不停动”）。在正式写作里用 *restless person* 也可以更中性。"]}
{"word":"figged","summary":{"en":"“Figged” is the rare past form of “fig,” meaning “dressed up/decorated,” or (in an equestrian context) “made a horse artificially lively by figging.”","zh":"“figged”是罕见的“fig”的过去式，常指“打扮/装饰”，也可指马术语境中用“figging”让马看起来更兴奋。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “fig” (rare/archaic): dressed up or decorated; made something look showy.","zh":"“fig”的过去式/过去分词（罕见/古语）：把……打扮得花哨；装饰，使更显眼。"},"examples":[{"en":"He arrived figged out in his best coat for the ceremony.","zh":"他穿上自己最好的外套，把自己打扮得很体面去参加仪式。"},{"en":"The hall was figged with ribbons and flowers.","zh":"大厅用丝带和鲜花装饰得很华丽。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “fig” in an equestrian sense (rare): made a horse artificially lively by using ginger (“figging”).","zh":"“fig”的过去式/过去分词（马术用法，罕见）：用姜等刺激物让马看起来更精神/更兴奋（称为 figging）。"},"examples":[{"en":"The horse was figged to make it hold its tail higher in the ring.","zh":"为了在赛场上让马把尾巴抬得更高，那匹马被“figged”处理过。"}]}],"synonyms":["decorated","adorned","dressed up"],"phonetic":"/fɪɡd/","extraExplanation":["“figged”在现代英语里非常少见。很多时候人们写“figged”其实是把“figured”（如 figured out）拼错了：figured /ˈfɪɡjɚd/。","马术里的“figging”涉及对动物的不当刺激，在一些地方被视为不人道并可能被禁止；阅读历史文本时遇到该词要注意语境。"]}
{"word":"figgery","summary":{"en":"A rare word meaning a place where figs are grown (a fig orchard/plantation).","zh":"一个很少见的词，指种植无花果的地方（无花果园/种植园）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A place where figs are grown, such as a fig orchard or plantation.","zh":"（罕见）种植无花果的地方；无花果园、无花果种植园。"},"examples":[{"en":"They walked through the old figgery at the edge of the village.","zh":"他们走过村子边上一片古老的无花果园。"},{"en":"The farm added a small figgery to diversify its fruit crops.","zh":"农场新增了一小片无花果种植园，以丰富果树种类。"}]}],"synonyms":["fig orchard","fig grove","fig plantation"],"phonetic":"/ˈfɪɡəri/","extraExplanation":["“figgery”由 fig（无花果）+ 后缀 -ery 构成，-ery 常表示“某种事物聚集/经营的地方”（如 orangery 橘子温室、brewery 啤酒厂）。这个词在现代英语中非常少见，更常用的说法是 fig orchard / fig grove / fig plantation。"]}
{"word":"figgier","summary":{"en":"“Figgier” means “more figgy”—more like figs or containing more figs, usually describing food.","zh":"“figgier”表示“更有无花果味/更像无花果，或含更多无花果”，多用于描述食物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “figgy”: more like figs in taste/smell/appearance, or containing more figs (often used about food).","zh":"“figgy”的比较级：更像无花果（味道/气味/外观），或含有更多无花果（常用于食物）。"},"examples":[{"en":"This batch of jam tastes figgier than the last one.","zh":"这批果酱比上一批更有无花果味。"},{"en":"If you add a few more dried figs, the cake will be figgier.","zh":"如果你再加几颗无花果干，这个蛋糕会更“无花果味”。"}]}],"synonyms":["more figgy","more fig-like","more fig-flavored"],"phonetic":"/ˈfɪɡiər/","extraExplanation":["“figgier”来自形容词“figgy”（有无花果味/含无花果）。比较级拼写中把 g 双写（figgier），是为了保持短元音 /ɪ/ 的读音规则。","“figgy”常见于食物语境，尤其是英美文化里与节日甜点相关的表达，如 figgy pudding（无花果布丁）。"]}
{"word":"figgiest","summary":{"en":"Figgiest means “most figgy”: the strongest fig content or fig flavor, usually describing food.","zh":"Figgiest 表示“最 figgy”：无花果含量最多或无花果味最浓，通常用来形容食物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of figgy) having the most figs, or tasting/smelling the most like figs; richest in fig flavor.","zh":"（figgy 的最高级）最有无花果的；无花果味/香气最浓的。"},"examples":[{"en":"Of all the holiday cakes, this one is the figgiest—packed with dried figs.","zh":"在所有节日蛋糕里，这款最“figgiest”——塞满了干无花果。"},{"en":"I like the figgiest jam, with big pieces of fruit in it.","zh":"我喜欢无花果味最浓的果酱，里面还有大块果肉。"}]}],"synonyms":["the most figgy","most full of figs","most fig-flavored"],"phonetic":"/ˈfɪɡiɪst/","extraExplanation":["“figgiest”在现实英语中非常少见，更常见的表达是“the most figgy”。它属于规则变化：figgy → figgier → figgiest（y 变 i 再加 -er/-est）。","“figgy”常用于食物语境（如 figgy pudding、figgy cake），表示“带无花果的/有无花果风味的”，而不是指人的性格或外貌。"]}
{"word":"figging","summary":{"en":"“Figging” is a taboo term for inserting ginger to cause a burning sensation, historically used on horses and later appearing in some sexual contexts.","zh":"“Figging”是一个带禁忌色彩的词，指用生姜制造灼热感；历史上用于马匹，后来也出现在一些性相关语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often taboo) The practice of putting ginger (or a ginger-based substance) into the anus or vagina to cause a strong burning sensation; historically done to make a horse appear more energetic, and later used in some sexual/BDSM contexts.","zh":"（常被视为禁忌）将生姜（或含姜物质）放入肛门或阴道以产生强烈灼热感的做法；历史上曾用于让马看起来更“精神”，后来也出现在一些性/BDSM语境中。"},"examples":[{"en":"The novel mentions figging as an old, cruel trick used on horses.","zh":"小说提到“figging”是一种古老而残忍的给马用的伎俩。"},{"en":"Some online communities discuss figging, but many people consider it unsafe and taboo.","zh":"一些网络社群会讨论“figging”，但很多人认为它不安全且带有禁忌色彩。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of doing figging; the -ing form of the verb phrase “to fig” in this specific sense.","zh":"进行“figging”的行为；在该特定含义下，相当于动词用法的 -ing 形式。"},"examples":[{"en":"The article warns that figging can cause injury and should not be attempted.","zh":"文章警告说“figging”可能造成伤害，不应尝试。"}]}],"synonyms":["gingering"],"phonetic":"/ˈfɪɡɪŋ/","extraExplanation":["这个词在现代语境里常与露骨的性内容相关；在正式写作或公共场合使用时要注意受众与文化接受度。","历史上与马有关的用法有时也被称为 gingering（给马“上姜”），目的通常是让马因不适而抬尾、显得更有精神；这在许多地方被视为虐待动物。","从健康角度看，相关做法可能导致灼伤、感染或过敏反应；医学与安全建议通常不推荐。"]}
{"word":"figgle","summary":{"en":"“Figgle” is a rare informal verb meaning to fidget or fiddle with something.","zh":"“figgle”是一个少见的非正式动词，意思是“坐立不安地乱动/不停摆弄某物”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal, rare) To fidget or fuss with something; to keep adjusting or playing with it in a small, nervous, or unnecessary way.","zh":"（非正式且少见）不停地摆弄、乱动；为小事反复调整或“手欠”地玩弄某物。"},"examples":[{"en":"Stop figgling with the zipper—you’re making it worse.","zh":"别一直摆弄拉链了——你越弄越糟。"},{"en":"He kept figgling with his pen during the meeting.","zh":"开会时他一直在摆弄笔。"}]}],"synonyms":["fidget","fiddle","fuss","tinker"],"phonetic":"/ˈfɪɡəl/","extraExplanation":["“figgle”在现代标准英语里非常少见，很多时候会被当作口语/方言用法，或被认为是“fidget（坐立不安、手脚不停）”“fiddle（摆弄、乱拨）”的变体、误拼或创造性用词。","如果你是在课本、考试或正式写作中使用，通常更建议用更常见的“fidget”或“fiddle”，以免读者不认识。"]}
{"word":"figgum","summary":{"en":"“Figgum” is a rare, nonstandard word most often used playfully to mean something trivial or not important; it can also be a proper name (surname).","zh":"“figgum”是罕见的非标准用法，多用于玩笑或方言语气，表示“微不足道、不重要的东西/事”；也可能是专有名词（如姓氏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) A playful or dialect word meaning “a trifle; something of little value or importance,” similar to “a fig” in “not worth a fig.”","zh":"（罕见、非标准用法）一种玩笑式或方言词，表示“微不足道的小事/小物；不值一提的东西”，意思接近短语里的“a fig”（如 not worth a fig）。"},"examples":[{"en":"It’s just figgum—don’t let it bother you.","zh":"这点事不值一提——别放在心上。"},{"en":"He acted like my opinion was figgum to him.","zh":"他表现得好像我的意见对他来说一文不值。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often capitalized) A family name (surname) or place/name element; used as a proper noun in some contexts.","zh":"（常大写）用作姓氏或专有名词的一部分；在某些语境中是人名/地名。"},"examples":[{"en":"Ms. Figgum will lead today’s meeting.","zh":"Figgum 女士将主持今天的会议。"}]}],"synonyms":["trifle","nothing","nonsense","not worth a fig","insignificant"],"phonetic":"/ˈfɪɡəm/","extraExplanation":["“figgum”不是现代标准英语里的常用词，很多词典可能查不到。若你是在歌词、方言对话、或某本书里看到它，它很可能是作者为了口语感而造的“俏皮变体”，借用“not worth a fig（不值一提）”这种表达的语气。","如果你能提供原句或来源（书名/地区口音/上下文），我可以更准确判断它是方言词、拼写变体，还是专有名词。"]}
{"word":"figgy","summary":{"en":"Figgy means “with figs” or “fig-flavored,” and is especially common in the phrase “figgy pudding.”","zh":"Figgy 指“含无花果的/无花果味的”，尤其常见于短语“figgy pudding（无花果布丁）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing figs, made with figs, or flavored with figs.","zh":"含无花果的；用无花果制成的；带无花果风味的。"},"examples":[{"en":"We had a slice of figgy cake after dinner.","zh":"晚饭后我们吃了一块无花果蛋糕。"},{"en":"The figgy smell of the jam filled the kitchen.","zh":"无花果果酱的香味弥漫了整个厨房。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling a fig in shape or appearance (less common).","zh":"（较少用）像无花果的；形状或外观类似无花果的。"},"examples":[{"en":"The plant grows small, figgy fruits in late summer.","zh":"这种植物在夏末会结出小小的、像无花果一样的果实。"}]}],"synonyms":["fig-flavored","with figs","fig-filled"],"phonetic":"/ˈfɪɡi/","extraExplanation":["“figgy”最常见于固定搭配“figgy pudding（无花果布丁）”，在英美文化里与圣诞节相关，尤其因为圣诞颂歌《We Wish You a Merry Christmas》里有“Bring us some figgy pudding”这句歌词。","在现代日常英语中，“figgy”单独使用并不算高频，更常见的说法是“fig-flavored / with figs / made with figs”。"]}
{"word":"fight","summary":{"en":"Fight can mean to hit or struggle against someone, to resist something strongly, or the conflict itself.","zh":"fight 可以表示打架/斗争、抵抗某事，也可以指一场冲突或争吵本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to use physical force against someone, especially in anger or to win a conflict; to struggle or compete strongly","zh":"（用肢体力量）打架、搏斗；（为赢得冲突或胜利而）奋力争斗、竞争"},"examples":[{"en":"Two boys started to fight in the schoolyard.","zh":"两个男孩在学校操场打了起来。"},{"en":"They fought for control of the company.","zh":"他们为争夺公司的控制权而斗争。"},{"en":"She’s fighting to keep her job.","zh":"她正在努力保住工作。"}]},{"partOfSpeech":"v.","definition":{"en":"to try very hard to stop or resist something (like a disease, an unfair law, or bad habits)","zh":"努力阻止或抵抗（如疾病、不公正的法律、坏习惯等）"},"examples":[{"en":"He is fighting cancer.","zh":"他正在与癌症抗争。"},{"en":"We must fight discrimination.","zh":"我们必须反对歧视。"}]},{"partOfSpeech":"n.","definition":{"en":"a physical conflict in which people hit or try to hurt each other; also, a strong argument or struggle","zh":"打架、斗殴；（也可指）激烈争论或斗争"},"examples":[{"en":"A fight broke out after the game.","zh":"比赛后爆发了斗殴。"},{"en":"They had a fight about money.","zh":"他们因为钱吵了一架。"}]}],"synonyms":["battle","struggle","argue","brawl","combat"],"phonetic":"/faɪt/","extraExplanation":["“fight”既可以指真正的肢体冲突，也常用来比喻“为某个目标而努力、抗争”。在日常英语里，说“fight for + 目标”通常带有积极色彩（为权利、梦想而奋斗）；而“fight with + 人”更容易让人联想到争吵或打架（也可指与某人并肩作战，但需看语境）。","常见搭配：fight back（反击/反抗）、fight off（击退；抵御，如感染）、fight over（为……争吵/争夺）、pick a fight（找茬/挑衅）。"]}
{"word":"fight ... hammer and tongs","summary":{"en":"very fiercely and with great energy","zh":"非常激烈、拼命地（地进行）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to fight or argue very fiercely and continuously; with great energy and intensity","zh":"激烈地打斗或争吵；狠狠干、拼命地进行（带着很强的劲头）"},"examples":[{"en":"The two teams fought hammer and tongs for the entire second half.","zh":"两支球队在下半场一直拼得非常激烈。"},{"en":"They were arguing hammer and tongs about money and responsibilities.","zh":"他们为了钱和责任问题吵得不可开交。"},{"en":"The siblings went at it hammer and tongs over who would drive.","zh":"兄弟姐妹为了谁来开车吵得很凶。"}]}],"synonyms":["fiercely","vigorously","tooth and nail","all-out","with all one's might","intensely"],"phonetic":"/ˈhæmɚ ænd tɑŋz/","extraExplanation":["用法要点：常与 fight/argue/go at it 等动词搭配；强调“强度大、持续、毫不留情”，语气偏口语。","易混点：这里的 tongs 指“夹钳/钳子”，不是“舌头”或“语言”。"],"etymology":"源自铁匠打铁的意象：用“锤子（hammer）和钳子/夹钳（tongs）”猛烈、快速地敲打与夹持金属。后来比喻做事（尤其打斗、争吵）又猛又狠、持续不停。","mnemonic":["想象铁匠一手夹钳一手抡锤，火星四溅——对应“打得很猛、吵得很凶”。","记忆联想：hammer=锤（狠砸），tongs=钳（死夹）→“又砸又夹”，所以场面很激烈。"]}
{"word":"fight ... off","summary":{"en":"successfully resist or repel something unwanted","zh":"成功抵御或击退不想要的事物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to defend yourself successfully against an attack, danger, illness, or unwanted feeling; to make it go away","zh":"成功抵御（攻击、危险、疾病或不好的感觉）；把……赶走"},"examples":[{"en":"She fought off the attacker and ran to safety.","zh":"她击退了袭击者，跑到安全的地方。"},{"en":"He’s fighting off a cold this week.","zh":"他这周在努力抵抗感冒。"},{"en":"I drank coffee to fight off sleep during the night shift.","zh":"我喝咖啡来赶走夜班时的困意。"}]}],"synonyms":["repel","ward off","fend off","drive away","hold off","resist","shake off"],"phonetic":"/faɪt ɔf/","extraExplanation":["用法要点：常见结构是 fight off + 名词（fight off an attack/a cold/fear）。代词作宾语时通常放中间：fight it off（而不是 fight off it）。"],"etymology":"“fight”来自古英语，意为“战斗”；“off”表示“离开、脱离”。合起来就是“通过战斗把某物/某人赶走、挡开”，后来也常用于比喻（如抵抗疾病、困意、恐惧等）。","mnemonic":["把 off 理解成“赶走/离开”：fight + off = “打到让它离开”→击退、抵御。","联想“off=下线/离开”：把疾病、困意“打下线”。"]}
{"word":"fight ... tooth and nail","summary":{"en":"with maximum effort and determination, refusing to give up","zh":"拼尽全力、顽强到底（不轻易放弃）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to fight or try extremely hard, using every possible effort, especially in a difficult situation","zh":"拼尽全力地斗争/争取；竭尽所能（尤指在艰难情况下）"},"examples":[{"en":"She fought tooth and nail to keep her job.","zh":"她为了保住工作拼尽全力。"},{"en":"The community fought tooth and nail against the new highway plan.","zh":"社区居民为了反对新的高速公路计划进行了强硬而顽强的抗争。"},{"en":"We’ll fight tooth and nail to protect our rights.","zh":"我们会竭尽全力捍卫我们的权利。"}]}],"synonyms":["fight hard","struggle","battle","scrap","try one's hardest","go all out","leave no stone unturned"],"phonetic":"/faɪt tuθ ænd neɪl/","extraExplanation":["语气通常很强烈，强调“不惜一切代价地坚持/对抗”。既可指真实冲突，也常用于工作、诉讼、政治、谈判等“非暴力”的竞争场景。","常见搭配：fight tooth and nail to do sth / against sb or sth。"],"etymology":"源自把人或动物“用牙齿和指甲”撕咬抓挠的画面，比喻在没有退路时用尽一切手段奋战；该短语在英语中长期用于强调“极其顽强、毫不退让”的努力。","mnemonic":["把画面记住：牙(tooth)＋指甲(nail)都用上＝连“最后的武器”都拿出来了 → 拼命、死磕。","联想中文“拼到牙都咬碎、指甲都抓断”的夸张说法 → 竭尽全力。"]}
{"word":"fight a duel","summary":{"en":"to engage in a formal one-on-one fight, traditionally over honor","zh":"进行正式的一对一决斗（传统上多与名誉有关）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to take part in a formal one-on-one fight (traditionally with swords or guns), often to defend personal honor","zh":"参加正式的一对一决斗（传统上用剑或枪），常为维护个人名誉"},"examples":[{"en":"In old stories, a gentleman might fight a duel to defend his honor.","zh":"在旧故事里，绅士可能会为维护名誉而去决斗。"},{"en":"They fought a duel at dawn, away from the town.","zh":"他们在黎明时分、远离城镇的地方进行决斗。"}]},{"partOfSpeech":"phrase","definition":{"en":"(more generally) to compete or struggle directly with one person in a serious conflict","zh":"（更广义）与某人进行直接且严肃的对抗或较量"},"examples":[{"en":"The two teams are ready to fight a duel for first place.","zh":"两支队伍准备为第一名展开正面对决。"},{"en":"She fought a duel of words with her rival during the debate.","zh":"在辩论中，她和对手展开了言语上的对决。"}]}],"synonyms":["duel","have a duel","duel with","fight","face off","square off","clash","battle"],"phonetic":"/faɪt ə ˈduəl/","extraExplanation":["在英语文化里，“duel（决斗）”常和18—19世纪的“荣誉文化”相关：有人觉得名誉受辱，就约对方一对一比武（如用剑或手枪）。现代多数国家早已将决斗视为非法或不被接受。","注意区别：duel（决斗，常指正式的一对一） vs. fight（打架/战斗，范围更广）。日常口语更常说 “have a duel” 或 “duel with someone”，而不是经常用 “fight a duel”。"],"etymology":"“duel”来自拉丁语 duellum（古拉丁语中指“战争/战斗”，后与 duo“二”联系起来），逐渐专指“两人之间的战斗”。“fight a duel”就是“进行决斗”。","mnemonic":["duel 含有 “du-”≈ duo（两个），记成“两个⼈的战斗”。","联想中文“决斗”：一对一、讲“规矩/仪式感”的对打。"]}
{"word":"fight a losing battle","summary":{"en":"keep trying even though success is very unlikely","zh":"明知很难成功仍在坚持努力"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to keep trying to do something that is very unlikely to succeed, often because the situation or forces against you are too strong","zh":"做一件几乎不可能成功的事；明知胜算很小仍在苦撑（常因形势或阻力太强）"},"examples":[{"en":"Trying to change his mind is fighting a losing battle.","zh":"想改变他的主意是在打一场必败之仗。"},{"en":"They’re fighting a losing battle against rising costs.","zh":"他们在对抗不断上涨的成本，胜算很小。"},{"en":"If you don’t sleep enough, you’re fighting a losing battle to stay focused.","zh":"如果你睡不够，你想保持专注就是在打一场必败之仗。"}]}],"synonyms":["waste your breath","tilt at windmills","struggle in vain","fight an uphill battle","battle against the odds"],"phonetic":"/faɪt ə ˈluːzɪŋ ˈbæt̬əl/","extraExplanation":["语气通常带有“现实、无奈”的感觉，并不一定批评努力本身，而是强调“形势不利”。","常见搭配：fight a losing battle against + 名词（against time / inflation / bureaucracy 等）。也可说 be fighting a losing battle。"],"etymology":"源自军事比喻：battle（战役）本就是胜负分明的对抗；losing battle（必败的战役）引申为“对抗大势/强大阻力而难以取胜的努力”。","mnemonic":["把它想成“明知会输的战役还在打”：losing=会输，battle=战役，合起来就是“必败之仗”。","联想中文“逆风局/大势已去还硬扛”，帮助记住“阻力太大，成功概率低”。"]}
{"word":"fight about","summary":{"en":"argue or struggle over a specific issue","zh":"就某事争吵或争斗"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to argue angrily about something; to have a conflict over a topic","zh":"为某事争吵；就某个话题发生冲突"},"examples":[{"en":"They often fight about money.","zh":"他们经常因为钱吵架。"},{"en":"We fought about where to go for dinner.","zh":"我们为晚饭去哪里吃吵了起来。"},{"en":"Try not to fight about small things.","zh":"尽量别为小事争吵。"}]},{"partOfSpeech":"phrase","definition":{"en":"to use physical force against someone because of a disagreement over something; to fight over something","zh":"为某事动手打架；因某个争议而打起来"},"examples":[{"en":"The kids started fighting about a toy.","zh":"孩子们因为一个玩具打了起来。"},{"en":"Two men fought about who was first in line.","zh":"两名男子因为谁先排队而打了起来。"}]}],"synonyms":["argue about","quarrel over","bicker about","squabble over","dispute","fight over"],"phonetic":"/faɪt əˈbaʊt/","etymology":"“fight”来自古英语，原意与“打斗、争斗”有关；“about”表示“关于”。两者组合常用于表达“就某事争吵/争斗”。","mnemonic":["把它拆开记：fight（打/吵） + about（关于）= “关于某事打/吵”。","联想中文：‘为……打起来’，对应英语里常用 fight about + 事情。"]}
{"word":"fight against","summary":{"en":"to struggle to resist or defeat something","zh":"奋力抵抗或战胜某事"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to try hard to stop or defeat something (such as a problem, disease, or unfair system)","zh":"努力反对或战胜某事（如问题、疾病或不公制度）"},"examples":[{"en":"Many people are fighting against climate change by using less energy.","zh":"许多人通过减少能源使用来对抗气候变化。"},{"en":"She is fighting against cancer with support from her family.","zh":"她在家人的支持下与癌症抗争。"},{"en":"The workers fought against unfair pay cuts.","zh":"工人们反对不公平的减薪。"}]}],"synonyms":["resist","oppose","combat","struggle against","battle against","push back against"],"phonetic":"faɪt əˈɡɛnst","extraExplanation":["在语气上，fight against 强调“抵抗、反对”；如果更强调“为了目标而努力”，常用 fight for（如 fight for justice 为正义而战）。","用在疾病话题时，英语里常说 fight against cancer（与癌症抗争），也有人更偏好用 battle with / live with 来避免把生病者的经历简化成“输赢”。"],"etymology":"fight 源自古英语，意为“战斗、争斗”；against 源自古英语，表示“对着、反对”。合在一起常表示“为了阻止/战胜某事而斗争”，既可指真实冲突，也常用于抽象事物（疾病、制度、困难）。","mnemonic":["against=“反着来/对着干”（反=against），所以 fight against=“反着打”→对抗。","记搭配：fight against + 抽象名词（disease/problem/injustice），fight with + 人（和某人打架/争吵）。"]}
{"word":"fight against ...","summary":{"en":"to oppose or struggle to defeat something","zh":"对抗或努力战胜某事"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to try hard to stop, oppose, or defeat someone or something (an enemy, an idea, a law, a disease, etc.)","zh":"与……作斗争；反对/抵制；努力战胜（敌人、观念、法律、疾病等）"},"examples":[{"en":"Many people are fighting against the new law.","zh":"很多人在反对这项新法律。"},{"en":"Doctors are fighting against the spread of the virus.","zh":"医生们正在努力遏制病毒传播。"},{"en":"She fought against fear and kept speaking.","zh":"她克服恐惧，坚持把话讲完。"}]}],"synonyms":["oppose","resist","combat","struggle against","contend with"],"phonetic":"/faɪt əˈɡɛnst/","extraExplanation":["常见搭配：fight against disease/cancer（抗击疾病/癌症）、fight against injustice（反对不公）、fight against temptation（抵抗诱惑）、fight against time（与时间赛跑/争分夺秒）。","小语法点：fight against 后面多接“要反对/要战胜的对象”。如果想表达“为……而战”，通常用 fight for（fight for freedom 为自由而战）。"],"etymology":"源自古英语 fight（feohtan，“战斗”）与 against（由 on + gegn 演变而来，原意接近“面对、相对”）。合起来表示“面对……并与之对抗”。","mnemonic":["记忆法：against≈“顶着/对着”。fight against 就是“顶着……打”，=对抗。","联想：反（against）+打（fight）= 反着打 → 反对/抵抗。"]}
{"word":"fight against demons","summary":{"en":"To battle evil forces or to struggle with serious inner problems.","zh":"对抗恶势力；或（比喻）与严重的内心问题抗争。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To battle evil supernatural beings (demons), especially in stories, fantasy, religion, or games.","zh":"与恶魔作战；对抗邪恶的超自然存在（常见于故事、奇幻、宗教或游戏语境）。"},"examples":[{"en":"In the novel, the hero travels across the kingdom to fight against demons.","zh":"在小说里，英雄穿越王国去与恶魔作战。"},{"en":"The game’s main quest is to fight against demons and protect the city.","zh":"这款游戏的主线任务是对抗恶魔并保护城市。"}]},{"partOfSpeech":"phrase","definition":{"en":"To struggle against inner fears, addiction, guilt, or other painful personal problems (figurative).","zh":"（比喻）与内心的恐惧、成瘾、愧疚或其他痛苦问题抗争。"},"examples":[{"en":"After the accident, he had to fight against demons like anxiety and nightmares.","zh":"事故之后，他不得不与焦虑和噩梦等“心魔”抗争。"},{"en":"She’s been fighting against demons for years, but she keeps moving forward.","zh":"她与心魔抗争多年，但依然在向前走。"},{"en":"Therapy helped him fight against his demons instead of hiding them.","zh":"心理治疗帮助他正视并对抗心魔，而不是逃避。"}]}],"synonyms":["battle demons","fight your demons","battle your demons","confront evil","struggle with inner demons","wage war against","combat"],"phonetic":"/faɪt əˈɡenst ˈdiːmənz/","extraExplanation":["日常英语里，谈心理问题时更常说“fight your demons / battle your demons”。“fight against demons”也能表达，但听起来更像奇幻题材或更书面。","中文“心魔”对应英语常见的“inner demons / personal demons”。在表达心理健康话题时，用法更自然也更温和。"],"etymology":"“fight against”意为“与……对抗/抗争”；“demon(s)”源自希腊语 daimon，早期指“灵/神力”，后来在基督教语境中逐渐固定为“恶魔”。合起来既可指文学宗教中的“恶魔”，也常被引申为“心魔/心理困扰”。","mnemonic":["把 demons 联想成中文“心魔”：fight against demons = 和“心魔”打架。","against = “逆着/对着”，fight against = “迎着困难去打”。"]}
{"word":"fight against sb.","summary":{"en":"oppose or struggle with someone, physically or politically","zh":"与某人对抗或反对（可指打架或立场对立）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to use physical force or strong effort to oppose a person","zh":"与某人打架；（用武力或强烈手段）对抗某人"},"examples":[{"en":"He fought against the bully after school.","zh":"放学后他和那个霸凌者打了一架。"},{"en":"They trained every day to fight against their opponents in the ring.","zh":"他们每天训练，为了在拳台上对抗对手。"}]},{"partOfSpeech":"phrase","definition":{"en":"to oppose someone’s ideas, decisions, or actions; to try to stop them","zh":"反对某人（的想法、决定或行动）；努力阻止对方"},"examples":[{"en":"Many students fought against the new rule.","zh":"许多学生反对这条新规定。"},{"en":"She fought against him in the election campaign.","zh":"她在竞选中与他对抗。"},{"en":"You can disagree, but don’t fight against your teammates all the time.","zh":"你可以不同意，但别总是和队友对着干。"}]}],"synonyms":["oppose","resist","struggle against","combat","contend with","clash with","go up against","stand up to"],"phonetic":"/faɪt əˈɡenst/","extraExplanation":["用法提示：fight against sb. 强调“把某人当作对手/阻力”。如果是“为某人而战”，用 fight for sb.（为某人争取/支持某人）。","常见搭配：fight against an enemy（与敌人作战）、fight against an opponent（对抗对手）、fight against a rival（与竞争者较量）。"],"etymology":"“fight”来自古英语，原意与“战斗、争斗”有关；“against”表示“对着、反对”。合起来“fight against sb.”字面就是“对着某人去战斗”，引申为“反对/对抗某人”。","mnemonic":["against = “A 盖住/顶着”（联想“顶着……反着来”）→ fight against = “顶着某人打/反对某人”。","对比记忆：fight for = 为……而战；fight against = 与……对抗。"]}
{"word":"fight against sth.","summary":{"en":"to oppose or resist something strongly","zh":"强烈反对或抵抗某事"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to try hard to stop, oppose, or defeat something (such as a problem, disease, or unfair system)","zh":"努力阻止、反对或战胜某事（如问题、疾病或不公制度）"},"examples":[{"en":"Scientists are fighting against cancer with new treatments.","zh":"科学家正用新疗法对抗癌症。"},{"en":"Many people fought against unfair laws to win equal rights.","zh":"许多人反对不公的法律，争取平等权利。"},{"en":"He’s fighting against stress by exercising every day.","zh":"他每天运动来对抗压力。"}]}],"synonyms":["oppose","resist","combat","struggle against","stand up to","push back against"],"phonetic":"/faɪt əˈɡɛnst/","extraExplanation":["用法要点：fight against + 名词/代词（如 disease, injustice, poverty, temptation, time）。表示“对抗某物”。","对比：fight for 表示“为……而奋斗/争取”（fight for freedom）；fight against 表示“反对/对抗……”（fight against oppression）。两者方向相反：一个是争取目标，一个是抵抗障碍。"],"etymology":"“fight”源自古英语，原义与“战斗、争斗”有关；后面接“against（反对、对抗）”时，意思从具体打斗扩展到对抗抽象事物（疾病、困难、制度等）。","mnemonic":["against = “跟……对着干/站在对面”。fight against 就是“站在某事的对面去打”。","联想：anti-（反）+ fight（打）→ “反着打”＝对抗、反对。"]}
{"word":"fight against time","summary":{"en":"hurry to finish before time runs out","zh":"赶在时间用完前完成（争分夺秒）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to hurry and try to finish something before a deadline or before time runs out","zh":"与时间赛跑；争分夺秒（在截止时间前完成某事）"},"examples":[{"en":"The doctors fought against time to save the patient.","zh":"医生们争分夺秒地抢救病人。"},{"en":"We’re fighting against time to get the report done before Friday.","zh":"我们在与时间赛跑，得在周五前把报告做完。"},{"en":"During the storm, the crew fought against time to secure the ship.","zh":"暴风雨中，船员们争分夺秒地固定船只。"}]}],"synonyms":["race against time","work against the clock","beat the clock","rush","hurry"],"phonetic":"/faɪt əˈɡɛnst taɪm/","extraExplanation":["语气与使用场景：常用于紧急、压力大、后果重要的情境（救援、手术、灾害处理、临近截止日期）。","常见替换表达：race against time、work against the clock、beat the clock。","搭配提示：常与“to + 动词”连用（fight against time to do sth）。"],"etymology":"这是一个现代英语固定搭配，把“time（时间）”拟人化成对手；结构来自更常见的“fight against + 对手/困难”。含义接近“race against time（与时间赛跑）”。","mnemonic":["把 time 想成“敌人/对手”，fight against time 就是“跟时间打架”，自然联想到“争分夺秒”。","联想同义表达 race against time：race=赛跑，更直观地记住“与时间赛跑”。"]}
{"word":"fight back","summary":{"en":"to resist or respond to attack, harm, or difficulty","zh":"反击；反抗；与困境抗争"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to defend yourself by hitting, arguing, or taking action against someone who attacks or hurts you","zh":"反击；还手；反抗（用行动回应攻击或伤害你的人）"},"examples":[{"en":"If someone tries to rob you, the police say it’s often safer not to fight back.","zh":"如果有人想抢劫你，警方常说不反抗通常更安全。"},{"en":"She decided to fight back against the bullying by reporting it to the school.","zh":"她决定通过向学校举报来反击霸凌。"},{"en":"He fought back tears and kept talking.","zh":"他强忍住眼泪，继续说下去。"}]},{"partOfSpeech":"phrase","definition":{"en":"to resist a difficult situation such as illness, sadness, or fear","zh":"与（疾病、悲伤、恐惧等）抗争；努力克服"},"examples":[{"en":"She’s fighting back after a serious illness.","zh":"她在重病后努力恢复、顽强抗争。"},{"en":"The town fought back after the storm destroyed many homes.","zh":"风暴毁掉许多房屋后，小镇努力重建、挺了过来。"}]}],"synonyms":["retaliate","strike back","resist","push back","stand up to","defend yourself"],"phonetic":"/ˈfaɪt ˌbæk/","extraExplanation":["既可指身体上的“还手”，也常指非暴力的“反击”：用投诉、法律、媒体、谈判等方式反抗不公。","“fight back tears”是很常见的固定搭配，意思是“强忍眼泪/忍住哭”。这里的fight back更像“压下去、忍住”。"],"etymology":"“fight”来自古英语，表示“战斗/斗争”；“back”表示“向后、回击”。合起来就是“打回去、顶回去”，后来也扩展为“对抗困境、压住情绪”。","mnemonic":["把 back 想成“打回去”：别人打你，你把拳头“打回去”= fight back（反击/还手）。","记住固定搭配：fight back tears = “和眼泪打架，把它逼回去”→ 强忍泪水。"]}
{"word":"Fight Club","summary":{"en":"a secretive group (often as a movie reference) or a place for combat-sport training","zh":"常指电影梗中的“保密小圈子”，也可字面指搏击训练俱乐部"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a pop-culture reference to the underground fighting group in Chuck Palahniuk’s novel (1996) and the 1999 film adaptation; often used to mean a secret or rule-bound group that people shouldn’t talk about","zh":"指查克·帕拉尼克1996年小说及1999年同名电影中的“地下搏斗俱乐部”；也常被引申为“保密、有规矩、不能外传的小圈子/组织”"},"examples":[{"en":"People online call our private chat “Fight Club” because no one is supposed to talk about it.","zh":"大家在网上把我们的私密群聊叫作“Fight Club”，因为按规矩谁也不该对外说。"},{"en":"The movie Fight Club is famous for the line, “The first rule of Fight Club is: you do not talk about Fight Club.”","zh":"电影《搏击俱乐部》因那句台词而出名：“Fight Club 的第一条规则是：不要谈论 Fight Club。”"}]},{"partOfSpeech":"n.","definition":{"en":"(literal) a club or gym where people train and participate in combat sports such as boxing or MMA","zh":"（字面义）进行拳击、综合格斗等对抗性运动训练或比赛的俱乐部/馆"},"examples":[{"en":"He joined a fight club to learn boxing and improve his fitness.","zh":"他加入了一个搏击俱乐部，学习拳击并提高体能。"},{"en":"This fight club offers beginner classes and sparring sessions.","zh":"这家搏击俱乐部提供入门课程和对练。"}]}],"synonyms":["boxing gym","MMA gym","martial arts gym","secret society","inner circle","underground ring"],"phonetic":"/faɪt klʌb/","extraExplanation":["在日常英语里，提到“Fight Club”常带有“不能说、很神秘”的幽默语气，尤其在谈到私密群、内部项目或“只能内部知道”的规则时。","“The first rule of Fight Club…”常被当作网络梗，用来强调保密或别外传。","如果只是指真正的搏击训练场所，更自然的说法通常是“boxing gym / MMA gym / martial arts gym”；把普通健身房叫“fight club”可能会让人联想到电影梗或非法地下斗殴。"],"etymology":"“Fight”来自古英语，意为“打斗/战斗”；“club”来自中古英语，常指“社团/俱乐部”。作为专名“Fight Club”，最广为人知的来源是查克·帕拉尼克1996年的小说与其1999年电影改编，使其在英语中形成强烈的文化指代与引申用法。","mnemonic":["把它记成“Fight（打）+ Club（社团）= 打架社团”，再联想到经典梗：第一条规则——别说。","联想中文常见说法“不要外传/别声张”，就能想到它的引申义：秘密小圈子。"]}
{"word":"fight corruption and build a clean government","summary":{"en":"take action against corruption and improve public integrity","zh":"打击腐败并提升政府廉洁与透明度"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to take strong action against corruption and create an honest, transparent public administration","zh":"严厉打击腐败，建设廉洁透明的政府"},"examples":[{"en":"The new mayor promised to fight corruption and build a clean government.","zh":"新市长承诺要打击腐败，建设廉洁政府。"},{"en":"Citizens called for reforms to fight corruption and build a clean government.","zh":"市民呼吁改革，以打击腐败、建设廉洁政府。"},{"en":"Stronger oversight can help fight corruption and build a clean government.","zh":"更严格的监督有助于打击腐败、建设廉洁政府。"}]}],"synonyms":["combat corruption","crack down on corruption","promote clean governance","promote integrity in government","clean up government","strengthen government transparency"],"phonetic":"/faɪt kəˈrʌpʃən ænd bɪld ə kliːn ˈɡʌvərnmənt/","extraExplanation":["语用提示：在新闻、政策文件、演讲中很常见，语气正式、偏书面。","近义表达：也常见“combat corruption”“promote clean governance”“strengthen integrity in government”。","文化语境：英语里谈“廉洁政府”时，常用integrity（廉正）与transparency（透明）来具体说明“clean”的标准。"],"etymology":"这是政治与公共治理语境中的常用搭配：fight corruption（打击腐败）+ build a clean government（建设廉洁政府）。“clean government”中的clean是比喻用法，表示“廉洁、不受贿、透明”。","mnemonic":["把它拆成两步记：fight（打）corruption（腐败）→ build（建）a clean（干净=廉洁）government（政府）。","clean=“干净”在政治里引申为“不收钱、不走后门”，联想“手干净=不拿不该拿的”。"]}
{"word":"fight crisis","summary":{"en":"take active action to overcome a serious difficult situation","zh":"积极采取行动来克服严重困境（危机）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to work actively to stop, reduce, or overcome a serious difficult situation","zh":"积极采取行动来阻止、减轻或克服严重的困难局面（危机）"},"examples":[{"en":"The government introduced new measures to fight the economic crisis.","zh":"政府推出新措施来应对经济危机。"},{"en":"Hospitals worked around the clock to fight the public health crisis.","zh":"医院昼夜不停地努力应对公共卫生危机。"},{"en":"Local communities came together to fight the housing crisis.","zh":"当地社区团结起来共同应对住房危机。"}]}],"synonyms":["combat the crisis","tackle the crisis","address the crisis","deal with the crisis","manage the crisis","contain the crisis","respond to the crisis","overcome the crisis"],"phonetic":"/faɪt ˈkraɪsɪs/","extraExplanation":["常见搭配更自然的是 “fight the crisis” 或 “fight a crisis”（加冠词），也常用更正式的说法：“address the crisis”（着手解决危机）、“tackle the crisis”（着力处理危机）、“manage the crisis”（管理/控制危机）、“combat the crisis”（对抗危机）。","语气差别：fight/combat 更强调“对抗、抵抗”；address/tackle 更强调“着手处理问题”；manage/contain 更强调“控制影响”。"],"etymology":"“fight”来自古英语 feohtan（战斗、斗争）；“crisis”来自希腊语 krisis（决定、转折点），后来引申为“关键时刻的严重局面/危机”。合在一起常用于新闻与公共事务语境，表示“对抗/应对危机”。","mnemonic":["把 fight 记成“fight=奋力”，crisis 记成“危机(机=关键时刻)”，合起来就是“奋力扛过关键时刻”。","联想新闻标题：Fight the crisis（抗击危机）——常见于经济、疫情、能源等语境。"]}
{"word":"fight discrimination against sb.","summary":{"en":"take action to stop unfair treatment targeted at someone","zh":"采取行动制止针对某人的歧视性不公平对待"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to take action to stop unfair treatment of a person or group","zh":"采取行动制止对某人或某群体的不公平对待（歧视）"},"examples":[{"en":"We should fight discrimination against people with disabilities.","zh":"我们应该反对对残障人士的歧视。"},{"en":"The group works to fight discrimination against immigrants in hiring.","zh":"这个团体致力于反对招聘中对移民的歧视。"},{"en":"New policies were introduced to fight discrimination against women at work.","zh":"出台了新政策来反对职场对女性的歧视。"}]}],"synonyms":["combat discrimination","tackle discrimination","oppose discrimination","stand up to discrimination","challenge discrimination"],"phonetic":"/faɪt dɪˌskrɪməˈneɪʃən əˈɡɛnst/","extraExplanation":["用法提示：fight discrimination against sb. 强调“反对/打击针对某人的歧视”。也常说 fight against discrimination（不接具体对象）。","近义表达：combat discrimination / tackle discrimination / oppose discrimination。更正式的写法常见于新闻、报告与政策文本。"],"etymology":"这是一个常见搭配：fight（“对抗、斗争”）+ discrimination（“歧视”）+ against（“针对”）+ sb.（somebody，某人）。常用于法律、社会正义与公共政策语境。","mnemonic":["fight = “打/斗争”，discrimination = “区分→区别对待→歧视”：连起来就是“为反歧视而斗争”。","against = “对着/反对”，记成“反着来”，所以是“反对针对某人的歧视”。"]}
{"word":"fight down","summary":{"en":"suppress a strong emotion or urge","zh":"强忍；压下强烈情绪或冲动"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to force a feeling or reaction to become less strong; to suppress it (often used with emotions like fear, tears, anger)","zh":"压下（情绪或反应）；强忍住（常指恐惧、眼泪、愤怒等）"},"examples":[{"en":"She fought down tears and kept talking.","zh":"她强忍住眼泪，继续说下去。"},{"en":"He tried to fight down his panic before the interview.","zh":"面试前他努力压下恐慌。"},{"en":"I fought down the urge to shout.","zh":"我强忍住想喊叫的冲动。"}]}],"synonyms":["suppress","hold back","restrain","stifle","quell","subdue","bottle up"],"phonetic":"/faɪt daʊn/","extraExplanation":["常见搭配：fight down tears/fear/anger/panic/an urge（强忍眼泪/压下恐惧/抑制愤怒/压住恐慌/压下冲动）。","语气上强调“很不容易、需要用力克制”。如果只是普通地不表现出来，也可用 hide/conceal。"],"etymology":"由动词 fight（“搏斗、奋力对抗”）+ down（“往下、压低”）组合而成；把情绪想象成“往上涌”，用力把它“压下去”，因此引申为“强忍/抑制”。","mnemonic":["把情绪想成“往上涌”的水：fight（用力对抗）+ down（压下去）→ 用力把情绪压下。","联想“把眼泪按下去”：fight down tears（强忍眼泪）是最常见的固定搭配。"]}
{"word":"fight every corrupt phenomenon, punish every corrupt official","summary":{"en":"Oppose all corruption and hold every corrupt official accountable.","zh":"反对一切腐败，并追责惩处所有腐败官员。"},"definitions":[{"partOfSpeech":"sentense","definition":{"en":"A strong slogan meaning to oppose all forms of corruption and ensure every corrupt person in office is held accountable.","zh":"一句有力的口号，意思是反对一切腐败现象，并让每一个腐败官员都被追责惩处。"},"examples":[{"en":"The government promised to fight every corrupt phenomenon and punish every corrupt official.","zh":"政府承诺要反对一切腐败现象，并惩处每一个腐败官员。"},{"en":"The report calls for action: fight every corrupt phenomenon, punish every corrupt official.","zh":"报告呼吁采取行动：反对一切腐败现象，惩处每一个腐败官员。"}]}],"synonyms":["combat corruption","fight corruption","crack down on corruption","root out corruption","bring corrupt officials to justice","hold officials accountable"],"phonetic":"/faɪt ˈɛvri kəˈrʌpt fəˈnɑməˌnɑn ˈpʌnɪʃ ˈɛvri kəˈrʌpt əˈfɪʃəl/","extraExplanation":["语体偏正式、庄重，常用于政策文件、演讲、新闻标题。","结构上是平行/排比：fight + 宾语（腐败现象）/ punish + 宾语（腐败官员），读起来更有节奏感和号召力。","可替换表达：把 every 换成 all，可更口语；或用 root out（根除）、bring to justice（绳之以法）增强法治色彩。"],"etymology":"常见于政治语境的对偶式（parallelism）宣传口号：用两个结构相同的祈使句“fight… / punish…”来强化力度与决心；其中 phenomenon 源自希腊语，punish 源自拉丁语词根，表达“制止—惩戒”的递进关系。","mnemonic":["记两段动词递进：fight（先“斗争/抵制”现象）→ punish（再“惩罚”个人）。","every = “每一个”，对应中文口号常见的“一切…、每一个…”，一眼就能对上句式。"]}
{"word":"fight fires","summary":{"en":"Put out fires, or handle urgent problems as they come up.","zh":"扑灭火灾；或比喻救火式应付突发问题。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To work to stop and put out a fire (often as part of one’s job as a firefighter).","zh":"（通常指消防员）灭火、扑救火灾。"},"examples":[{"en":"Firefighters fought fires all night as the wind spread the flames.","zh":"大风助长火势，消防员整夜都在奋力灭火。"},{"en":"He trains every week so he’ll be ready to fight fires safely.","zh":"他每周训练，好在需要时能安全地扑救火灾。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Figurative) To deal with urgent problems as they arise, especially instead of doing planned work.","zh":"（比喻）救火式处理问题；不断应付突发状况，导致无法按计划推进工作。"},"examples":[{"en":"I spent the whole day fighting fires instead of finishing my report.","zh":"我一整天都在救火式处理问题，结果报告没写完。"},{"en":"Good planning helps a team stop fighting fires every week.","zh":"好的规划能让团队不再每周都在“救火”。"},{"en":"As a manager, she tries to fix root causes, not just fight fires.","zh":"作为管理者，她努力解决根因，而不只是一直“救火”。"}]}],"synonyms":["extinguish fires","put out fires","handle emergencies","deal with crises","troubleshoot","do damage control","put out spot fires"],"phonetic":"/faɪt faɪərz/","extraExplanation":["在英文职场里，fight fires常带有“反复救急、缺少规划、被问题牵着走”的含义；对比表达：prevent fires（防患于未然）、fix the root cause（治本）。"],"etymology":"源自字面义“扑灭火灾”。后来在职场与管理语境中被广泛借用，表示“哪里着火就先扑哪里”式的应急处理。","mnemonic":["把它想成中文的“救火”：事情一着急就先去灭火，但总在救火说明可能缺少预防。","fire=火，fight=打；“打火”联想到“打着火/打灭火”，帮助记住两层意思：既能真灭火，也能比喻处理烂摊子。"]}
{"word":"fight floods and provide relief","summary":{"en":"work to reduce flooding and help victims with aid","zh":"抗洪减灾并向受灾者提供救助"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to work to stop or reduce flooding and to help affected people by giving aid, supplies, or services","zh":"抗击洪水并提供救助（通过防洪/减灾，同时向受灾者提供援助、物资或服务）"},"examples":[{"en":"Volunteers worked around the clock to fight floods and provide relief to families who had lost their homes.","zh":"志愿者昼夜不停地抗击洪水，并为失去家园的家庭提供救助。"},{"en":"The government sent engineers to fight floods and provide relief in the hardest-hit towns.","zh":"政府派出工程人员到受灾最严重的城镇抗洪并开展救助。"},{"en":"Local charities raised funds to fight floods and provide relief after the river overflowed.","zh":"河水漫溢后，当地慈善机构筹款用于抗洪和救助。"}]}],"synonyms":["combat flooding","control floods","respond to flooding","provide aid","deliver relief","provide humanitarian assistance","carry out disaster relief"],"phonetic":"/faɪt flʌdz ænd prəˈvaɪd rɪˈlif/","extraExplanation":["在新闻与官方通告中，relief 常指“救灾援助”，包括食物、饮用水、临时住所、医疗服务、现金补助等；而 fight floods 更偏向“防洪/抗洪”措施，如加固堤坝、筑沙袋、排水、疏散等。","近义表达里，fight floods 更正式的说法可用 combat flooding 或 control floods；provide relief 也常说 provide humanitarian aid / disaster relief。"],"etymology":"这是现代英语中常见的动词并列搭配：fight（对抗）+ floods（洪水）与 provide relief（提供救助）。relief 在灾害语境中常指“救援/赈济”，搭配 provide、deliver、offer 等动词很常见。","mnemonic":["把 relief 记成“解除=缓解”：灾后要“解除痛苦、缓解困难”，所以 provide relief 就是“提供救助/赈济”。","fight floods：flood（洪水）里有“lood”可联想“水很多”，fight floods 就是“跟大水作战”。"]}
{"word":"fight for","summary":{"en":"work hard to achieve or defend something; strongly support someone or something","zh":"为某事努力争取或捍卫；坚定支持某人或某事"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to try very hard to get, keep, or achieve something; to defend it even when it is difficult","zh":"为（某事物）努力争取、捍卫或保住；即使很难也坚持"},"examples":[{"en":"She fought for equal pay at her company.","zh":"她在公司里为同工同酬而争取。"},{"en":"They are fighting for their freedom.","zh":"他们正在为自由而斗争。"},{"en":"I’ll fight for this project because I believe in it.","zh":"我会为这个项目据理力争，因为我相信它。"}]},{"partOfSpeech":"phrase","definition":{"en":"to support someone or something strongly; to stand up for them","zh":"坚定支持（某人/某事）；为其出头、撑腰"},"examples":[{"en":"A good manager fights for their team.","zh":"一个好的经理会为团队争取利益。"},{"en":"He fought for his friend when others blamed her.","zh":"当别人指责她时，他为朋友辩护。"}]}],"synonyms":["struggle for","campaign for","stand up for","advocate for","defend","battle for"],"phonetic":"/faɪt fɔr/","extraExplanation":["fight for 通常强调“为了一个目标而努力/抗争”，不一定是身体打架；很多时候用于权利、机会、原则（e.g., fight for justice/rights）。","对比：fight with 更常见于“和……打架/争吵”；fight against 强调“反对、与……作斗争”（e.g., fight against corruption）。"],"etymology":"fight 源自古英语，原意与“战斗、争斗”有关；与 for 连用时，for 表示“为了/为了得到”，所以 fight for 引申为“为……而奋斗/争取”。","mnemonic":["把 for 理解成“为了”：fight + for = “为了……而战/而拼”。","联想中文常说的“为……而战”“为……争取”，直接对应 fight for。"]}
{"word":"fight for ...","summary":{"en":"struggle or work hard to get, keep, or defend something","zh":"为获得、保住或维护某事而奋力争取"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to use effort (arguing, working, competing, or struggling) to get something, keep something, or support a cause or person","zh":"为……而努力争取/奋战（通过争辩、工作、竞争或抗争来获得、保住某物，或支持某个事业/某个人）"},"examples":[{"en":"They fought for equal rights.","zh":"他们为平等权利而斗争。"},{"en":"She’s fighting for a promotion.","zh":"她在为升职而努力争取。"},{"en":"He fought for his family when times were hard.","zh":"在艰难时期，他为家人而拼尽全力。"}]},{"partOfSpeech":"phrase","definition":{"en":"(legal/political) to defend someone or something strongly, often publicly","zh":"（法律/政治语境）为……据理力争/辩护（常公开地维护）"},"examples":[{"en":"The lawyer fought for his client in court.","zh":"律师在法庭上为当事人据理力争。"},{"en":"Activists fought for the new law to pass.","zh":"活动人士为推动新法通过而努力。"}]}],"synonyms":["struggle for","fight to defend","battle for","campaign for","stand up for","contend for"],"phonetic":"/faɪt fɔr/","extraExplanation":["常见搭配：fight for + 名词（rights/justice/freedom/a better life/a chance/a place）。","易混对比：fight for（为了得到/维护某物而斗争） vs. fight against（反对某事/与……作斗争）。例如：fight for peace（为和平而努力）/ fight against war（反对战争）。","语气强度：比“work for”更强调艰难、阻力和坚持；不一定是真打架，也可以是长期努力。"],"etymology":"“fight”源自中古英语，和古英语中表示“打斗、争斗”的词有关；后来意义从“身体打斗”扩展到“为目标/权利而努力抗争”。“fight for”中“for”表示“为了……（目标/对象）”。","mnemonic":["把“for”理解成中文“为了”。看到fight for，就直接联想“为……而战/为……而争取”。","联想短语：fight for your rights（为你的权利而战）——rights / fights 押尾音，方便记。"]}
{"word":"fight for freedom","summary":{"en":"struggle hard to gain or protect liberty or rights","zh":"为争取或捍卫自由与权利而艰苦斗争"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to try very hard (often for a long time) to gain or protect freedom or rights, sometimes using force or war","zh":"为争取或捍卫自由/权利而努力斗争（常常持续很久；有时也指通过武力或战争）"},"examples":[{"en":"Many people fought for freedom during the civil rights movement.","zh":"在民权运动期间，许多人为自由而斗争。"},{"en":"They organized protests and fought for freedom of speech.","zh":"他们组织抗议活动，为言论自由而斗争。"},{"en":"He believes we should fight for freedom through peaceful means.","zh":"他认为我们应该用和平方式为自由而奋斗。"}]}],"synonyms":["struggle for liberty","campaign for freedom","fight for rights","stand up for freedom","work for liberty"],"phonetic":"/faɪt fɔr ˈfriːdəm/","extraExplanation":["常见搭配：fight for freedom / fight for justice / fight for equality（为正义/平等而斗争）。","语气与场景：不一定指真实打架，更常指长期的抗争与努力（游行、诉讼、投票、倡议等）。","对比：fight for（为……而争取） vs. fight against（与……作斗争/反对……）。"],"etymology":"“fight”来自古英语，原意与“战斗、搏斗”相关；“freedom”来自古英语，指“免于束缚的状态”。合在一起常用于政治与社会语境，表示“为获得/维护自由而斗争”。","mnemonic":["把它拆开记：fight=“奋斗/斗争”，for=“为了”，freedom=“自由” → “为了自由而奋斗”。","联想中文短语“为自由而战/为自由而奋斗”，语感几乎一一对应。"]}
{"word":"fight for sth.","summary":{"en":"struggle hard to obtain or defend something","zh":"为获得或捍卫某事而奋力争取"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make a strong effort to get, keep, or achieve something, especially when it is difficult or when other people oppose you","zh":"为某事努力争取或捍卫（尤其在困难或有人反对时）"},"examples":[{"en":"She fought for equal pay at her company.","zh":"她在公司为同工同酬而争取。"},{"en":"They are fighting for a better future for their children.","zh":"他们正在为孩子们更好的未来而奋斗。"},{"en":"He fought for his place on the team after an injury.","zh":"受伤后，他为自己在队里的位置而努力争取。"}]}],"synonyms":["struggle for","campaign for","work for","push for","stand up for","battle for","contend for"],"phonetic":"/faɪt fɔr/","extraExplanation":["常见结构：fight for + 目标（rights, freedom, justice, a job, a chance, a cause）。","语气上比“work for”更强烈，强调阻力、对抗或强烈决心；不一定真的打架。","相关对比：fight against + 敌人/问题（fighting against discrimination 为反歧视而斗争）。"],"etymology":"“fight”源自古英语/日耳曼语系词根，原意与“打斗、争战”相关。后来引申出比喻义：为权利、目标、机会“抗争/努力”。“fight for + 名词”表示为某个对象或目标而战/而争取。","mnemonic":["把“for”理解成“为了”：fight for = 为了……去“拼/战”。","联想中文“为……而战/为……争取”，语气比“努力”更硬核。"]}
{"word":"fight for the cause of world peace","summary":{"en":"to work and campaign actively for global peace","zh":"为全球和平积极努力与争取"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to work very hard (sometimes through protest, activism, or political effort) to support the goal of peace among all countries","zh":"为世界和平的目标而努力奋斗（常指通过倡议、抗议、行动或政治努力来推动各国和平相处）"},"examples":[{"en":"Many people fight for the cause of world peace through education and dialogue.","zh":"许多人通过教育与对话为世界和平而努力。"},{"en":"She chose diplomacy as a career to fight for the cause of world peace.","zh":"她选择外交作为职业，以为世界和平的事业而奋斗。"},{"en":"They organized events to fight for the cause of world peace, not through violence but through cooperation.","zh":"他们组织活动为世界和平而努力，不靠暴力，而靠合作。"}]}],"synonyms":["campaign for world peace","work for world peace","advocate world peace","promote peace","strive for peace","peace activism"],"phonetic":"/faɪt fɔr ðə kɔz əv wɝld pis/","extraExplanation":["“fight for”在这类表达里通常表示“积极争取、努力推动”，语气比“work for”更强，更强调决心与行动（如倡议、公益、政治参与等）。","“cause”常指带有道德或社会意义的理念/事业，如 human rights（人权）、gender equality（性别平等）、world peace（世界和平）。"],"etymology":"这是一个现代英语常见搭配：fight for（为……而斗争/努力）+ cause（事业、理念）+ world peace（世界和平）。其中 fight 在这里多为比喻用法，强调“持续投入与争取”，不一定指真实打斗。","mnemonic":["把 cause 记成“口号/理念（cause）”：为一个口号背后的事业去 fight for（拼命努力）。","world peace＝“世界+和平”，整体可联想为“为了全世界都能和平相处而努力”。"]}
{"word":"fight hunger and poverty","summary":{"en":"work actively to reduce or end hunger and poverty","zh":"积极努力减少或消除饥饿与贫困"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to work actively to reduce or end hunger and poverty (often through policies, aid, education, or community programs)","zh":"积极努力减少或消除饥饿与贫困（常通过政策、援助、教育或社区项目等方式）"},"examples":[{"en":"Many charities fight hunger and poverty by providing meals and job training.","zh":"许多慈善机构通过提供餐食和职业培训来对抗饥饿与贫困。"},{"en":"The government launched a new plan to fight hunger and poverty in rural areas.","zh":"政府启动了一项新计划，旨在在农村地区对抗饥饿与贫困。"},{"en":"Local volunteers fight hunger and poverty by running a weekly food bank.","zh":"当地志愿者通过运营每周一次的食物救助站来对抗饥饿与贫困。"}]}],"synonyms":["combat hunger and poverty","tackle hunger and poverty","address hunger and poverty","reduce hunger and poverty","alleviate hunger and poverty","end hunger and poverty"],"phonetic":"/faɪt ˈhʌŋɡɚ ænd ˈpɑvɚti/","extraExplanation":["常见搭配：fight hunger and poverty worldwide（在全球范围对抗饥饿与贫困）、fight hunger and poverty in our community（在社区对抗饥饿与贫困）。","语气与场合：多用于正式/公共语境（政府报告、公益宣传、新闻）。日常口语也可以说 work to reduce hunger and poverty（努力减少饥饿与贫困）更中性。","相关概念：hunger 指“缺乏食物、挨饿”；poverty 指“缺乏金钱与资源的贫困”。两者常一起出现，因为它们往往相互影响。"],"etymology":"这是由常见动词 fight（“与……斗争/对抗”）加上名词 hunger 和 poverty 组成的固定表达。20世纪以来在新闻、公益与政策语境中非常常见，用来表示“采取行动解决社会问题”，不强调打架，而强调持续的努力。","mnemonic":["把 fight 记成“fight=奋战/对抗”，不一定是打架；这里是“和社会问题作斗争”。","联想中文公益口号：‘扶贫济困、消除饥饿’——对应 hunger（饥饿）+ poverty（贫困）。"]}
{"word":"fight off","summary":{"en":"resist and keep something or someone away","zh":"抵抗并把（威胁、疾病、影响等）挡开"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to resist or repel someone or something, so it does not harm you or affect you","zh":"抵抗；击退（某人或某物），使其不伤害或不影响你"},"examples":[{"en":"She fought off the attacker and ran to a safe place.","zh":"她击退了袭击者，跑到安全的地方。"},{"en":"He’s been taking medicine to fight off a cold.","zh":"他一直在吃药来抵抗感冒。"},{"en":"The company fought off competition by improving its service.","zh":"这家公司通过提升服务来抵御竞争。"}]}],"synonyms":["repel","resist","ward off","fend off","drive off","hold off","beat back","keep at bay"],"phonetic":"/faɪt ɔf/","etymology":"由动词 fight（战斗、对抗）+ 副词 off（离开、脱离）组成，字面是“把……打离开”，引申为“击退、挡住（攻击/疾病/压力等）”。","mnemonic":["把 off 想成“把东西打飞/赶走”：fight + off = “打到它离开”→击退/抵抗。","联想中文“把……挡回去/顶回去”：用力 fight，让它 off（离开你）。"]}
{"word":"fight off ...","summary":{"en":"to repel or resist something harmful or unwanted","zh":"击退；抵御（不良事物）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to resist or repel an attack, illness, or unwanted situation; to keep something from harming you or taking control","zh":"抵抗并击退（攻击、疾病或不良情况）；防止某事伤害你或控制你"},"examples":[{"en":"She fought off a cold with rest and warm soup.","zh":"她通过休息和喝热汤把感冒扛过去了。"},{"en":"The village tried to fight off the invaders.","zh":"村民们努力击退入侵者。"},{"en":"He drank coffee to fight off sleep during the night shift.","zh":"他在夜班时喝咖啡来抵抗困意。"}]}],"synonyms":["repel","ward off","fend off","resist","beat back","drive away"],"phonetic":"/faɪt ɔf/","extraExplanation":["常见搭配：fight off a cold/flu（扛住感冒/流感）、fight off an attack（击退攻击）、fight off sleep/hunger（抵抗困意/饥饿）、fight off temptation（抵制诱惑）。","语感区别：fight off 强调“把不好的东西挡在外面/赶走”；fight back 更强调“反击、回击”。"],"etymology":"由 fight（战斗、对抗）+ off（离开、远离）组成，字面意思是“把……打离开”，引申为“击退、抵御”。","mnemonic":["把 off 理解成“赶走/离开”：fight something off = “把它打走”。","联想中文“击退”：击= fight，退= off（退开）。"]}
{"word":"fight over ...","summary":{"en":"argue or compete about something","zh":"为某事争吵或争夺"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to argue strongly or compete with someone about who gets something or what should happen","zh":"为（某事/某物）激烈争吵或争夺"},"examples":[{"en":"The kids fought over the last piece of cake.","zh":"孩子们为了最后一块蛋糕争了起来。"},{"en":"They’re fighting over who should lead the team.","zh":"他们在为谁该带队而争执。"},{"en":"The two companies fought over the contract.","zh":"两家公司为这份合同展开争夺。"}]},{"partOfSpeech":"phrase","definition":{"en":"to physically fight about something (less common than the “argue/compete” meaning)","zh":"为（某事/某物）动手打架（较少见，多指口角/争夺）"},"examples":[{"en":"Two men fought over a parking space.","zh":"两名男子为了一个车位打了起来。"},{"en":"The brothers fought over the toy and one of them got hurt.","zh":"兄弟俩为玩具打起来，其中一个受了伤。"}]}],"synonyms":["argue over","quarrel over","dispute over","wrangle over","contend over","battle over","squabble over"],"phonetic":"faɪt ˈoʊvər","extraExplanation":["常见结构：fight over + 名词（money, inheritance, a seat）/ 疑问词从句（who/what/where）例如：fight over what to do next。","和 fight for 区别：fight for 更强调“为了支持/争取某个目标而努力”，不一定和别人吵；fight over 更强调“双方围绕同一件事发生冲突”。","口语里常见近义表达：argue over, quarrel over。正式写作可用：dispute over。"],"etymology":"“fight”来自古英语，意为“打斗/争斗”；“over”作介词时有“关于、为了、围绕”的含义。“fight over + 名词/从句”因此表示“围绕某事争吵或争夺”。","mnemonic":["把 over 理解成“围绕/关于”：大家“围着一件事转圈吵”，就是 fight over。","对比记忆：fight for（为了…去争取） vs. fight over（为…和别人起冲突）。"]}
{"word":"fight pollution with an iron hand","summary":{"en":"combat pollution with strict, forceful enforcement","zh":"以强硬执法手段治理污染"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To combat pollution very strictly and forcefully, using tough enforcement, strong penalties, and firm government action.","zh":"以强硬、严厉的手段治理污染（强调铁腕执法、重罚与强力推进）。"},"examples":[{"en":"The city vowed to fight pollution with an iron hand by shutting down illegal factories.","zh":"该市誓言以铁腕治理污染，关停非法工厂。"},{"en":"To fight pollution with an iron hand, the government increased inspections and fines.","zh":"为铁腕治污，政府加大了检查频次并提高了罚款力度。"},{"en":"Some residents support the plan to fight pollution with an iron hand, even if it raises costs.","zh":"一些居民支持铁腕治污的计划，即使这会增加成本。"}]}],"synonyms":["crack down on pollution","take tough measures against pollution","enforce environmental laws strictly","clamp down on polluters","zero-tolerance approach"],"phonetic":"/faɪt pəˈluʃən wɪð ən ˈaɪɚn hænd/","extraExplanation":["语气与含义：该表达强调“强硬、果断、严厉”的治理方式，常带有“高压监管/重罚”的意味；有时也可能让人联想到“过于强势”，因此在正式写作中可根据需要改用更中性的表达（如 strict enforcement, tough measures）。","常见搭配：fight/cut/curb pollution with an iron hand；crack down on polluters（严厉打击污染者）；zero tolerance for pollution（对污染零容忍）。"],"etymology":"“with an iron hand”源自英语中“iron hand / iron fist（铁腕/铁拳）”的比喻表达：iron（铁）象征坚硬、不可动摇；hand（手）象征控制与执行。合起来表示“以强硬手段掌控、严厉执行”。在公共治理语境中常用于强调强力执法与零容忍。","mnemonic":["把“iron hand”想成“铁做的手”，抓得更紧、更硬——对应“手段强硬、执法更严”。","联想中文固定说法“铁腕治污”，基本就是它的直译含义。"]}
{"word":"fight shoulder to shoulder","summary":{"en":"Unite closely with others to struggle or work for a shared cause.","zh":"与他人紧密团结，并肩为共同目标奋斗。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To stand or work closely side by side with others, especially in a difficult situation, to support a shared goal.","zh":"（尤指在困难情况下）与他人并肩站在一起、紧密合作，共同支持同一个目标。"},"examples":[{"en":"Workers fought shoulder to shoulder for safer conditions.","zh":"工人们并肩奋斗，争取更安全的工作条件。"},{"en":"In the crisis, neighbors fought shoulder to shoulder to protect their community.","zh":"在危机中，邻居们并肩抗争，守护他们的社区。"},{"en":"She promised to fight shoulder to shoulder with her teammates until the end.","zh":"她承诺会与队友并肩作战直到最后。"}]}],"synonyms":["stand together","unite","join forces","band together","stand side by side","fight side by side","act in solidarity"],"phonetic":"/faɪt ˈʃoʊldɚ tə ˈʃoʊldɚ/","extraExplanation":["语气多为积极、团结：强调“共同面对困难”的精神。","既可用于真实冲突（如战争、防卫），也常用于抽象语境（如维权、竞选、对抗困难、团队项目）。","相近表达：\"stand shoulder to shoulder\"（并肩站在一起，较少“斗争”意味）、\"work side by side\"（更中性，更偏合作）。"],"etymology":"源自“shoulder to shoulder（肩并肩）”这一形象表达，强调站得很近、彼此支撑；加上“fight”后，常用来比喻共同斗争或并肩努力，不一定真的是打架。","mnemonic":["把画面想成“肩靠肩挤在一起”，说明关系很紧密；再加上fight=“一起硬扛、一起拼”。","联想中文“并肩作战/并肩奋斗”，意思几乎一一对应。"]}
{"word":"fight the crisis","summary":{"en":"take active action to deal with a crisis","zh":"积极采取行动应对危机"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to take strong, active steps to deal with a serious difficult situation","zh":"采取强有力、积极的措施来应对严重困难局面（危机）"},"examples":[{"en":"The government promised to fight the crisis with emergency funding and new regulations.","zh":"政府承诺通过紧急拨款和新法规来应对这场危机。"},{"en":"Small businesses are fighting the crisis by cutting costs and moving sales online.","zh":"小企业通过削减成本并把销售转到线上来渡过危机。"},{"en":"Doctors worked day and night to fight the crisis in local hospitals.","zh":"医生们昼夜工作，帮助当地医院应对危机。"}]}],"synonyms":["combat the crisis","tackle the crisis","address the crisis","respond to the crisis","deal with the crisis","manage the crisis","weather the crisis","pull through the crisis"],"phonetic":"/faɪt ðə ˈkraɪsɪs/","extraExplanation":["语气上比 handle/manage the crisis 更强烈，强调“投入、对抗、行动”，常用于政治、经济、公共卫生等语境。","常见搭配：fight the economic/financial crisis（应对经济/金融危机）、fight the climate crisis（应对气候危机）、fight a crisis together（共同渡过危机）。","注意：fight the crisis 更偏“采取措施对抗危机本身”；fight in a crisis 则是“在危机中战斗/斗争”（含义不同）。"],"etymology":"这是一个比喻性搭配：fight 原意是“打仗/搏斗”，在英语里常用来表示“与抽象问题作斗争”（如 fight poverty / fight disease）。crisis 来自希腊语，指“关键转折点、决定性时刻”，后来泛指“危机”。","mnemonic":["把 fight 理解成“打怪”，crisis 想成“危机怪”：fight the crisis＝“打败危机怪，渡过难关”。","联想常用表达 fight disease（抗病）、fight poverty（反贫困），同样结构套到 crisis（危机）上。"]}
{"word":"fight to the finish","summary":{"en":"keep going without quitting until the very end","zh":"坚持到最后，不放弃直至结束"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to keep competing or struggling until one side wins or something ends, without quitting","zh":"坚持战斗/竞争到最后，不中途放弃，直到分出胜负或事情结束"},"examples":[{"en":"They promised to fight to the finish, even when the odds were against them.","zh":"他们承诺坚持到最后，即使胜算不大。"},{"en":"In the debate, she fought to the finish and defended her plan point by point.","zh":"在辩论中，她坚持到最后，逐点为自己的方案辩护。"},{"en":"The team fought to the finish, but still lost by one point.","zh":"球队拼到了最后，但还是以一分之差落败。"}]},{"partOfSpeech":"phrase","definition":{"en":"to continue a conflict in a harsh, uncompromising way until the other side is completely defeated (often about politics, business, or personal disputes)","zh":"（多指政治、商业或纠纷中）强硬到底、不妥协，直到对方彻底失败"},"examples":[{"en":"The two companies fought to the finish over the patent.","zh":"两家公司为这项专利强硬对抗到底。"},{"en":"He decided to fight to the finish rather than accept a weak settlement.","zh":"他决定硬抗到底，而不是接受一个软弱的和解方案。"}]}],"synonyms":["fight it out","go the distance","see it through","stick it out","persevere","battle to the end","hold out"],"phonetic":"/ˌfaɪt tə ðə ˈfɪnɪʃ/","extraExplanation":["语气通常比较强烈，强调“绝不退出”。在日常生活中也可用于中性场景（如比赛、辩论），但用于人际矛盾时可能带有“对抗到底”的冲突感。","常见搭配：fight to the finish over + 争议点（over the contract/patent）；promise/vow to fight to the finish（发誓坚持到底）。"],"etymology":"源自字面意义“战斗直到终点/最后”，其中 to the finish 来自赛跑等竞赛语境（跑到终点线），后来引申为“坚持到底、不放弃”。","mnemonic":["把 finish 想成“终点线/终点（终）”：fight + to the finish = “打到终点线”。","联想中文“拼到底 / 战到最后一刻”，就是它的核心感觉。"]}
{"word":"fight with","summary":{"en":"argue, physically struggle, or contend with a person or difficulty","zh":"与人争吵/打斗，或与困难抗争"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to argue angrily with someone; to have a quarrel","zh":"与某人争吵；吵架"},"examples":[{"en":"I don’t want to fight with you—let’s talk calmly.","zh":"我不想跟你吵架——我们冷静谈谈吧。"},{"en":"They fought with each other about money.","zh":"他们因为钱而互相争吵。"}]},{"partOfSpeech":"phrase","definition":{"en":"to use physical force against someone in a conflict","zh":"与某人打架；动手"},"examples":[{"en":"He got in trouble for fighting with a classmate.","zh":"他因为跟同学打架而惹了麻烦。"},{"en":"The soldiers fought with the enemy at dawn.","zh":"士兵们在黎明时与敌人交战。"}]},{"partOfSpeech":"phrase","definition":{"en":"to struggle to deal with something difficult, such as a feeling, illness, or problem","zh":"与（困难、情绪、疾病等）抗争；努力应对"},"examples":[{"en":"She’s been fighting with anxiety for years.","zh":"她多年来一直在与焦虑抗争。"},{"en":"I’m fighting with this math problem—it’s really hard.","zh":"我在跟这道数学题较劲——真的很难。"}]}],"synonyms":["argue with","quarrel with","have a fight with","brawl with","clash with","wrestle with","struggle with"],"phonetic":"/faɪt wɪð/","extraExplanation":["用法区别：fight with sb 常指“跟某人吵/打”（双方对立）；fight against sth/sb 更强调“反对、对抗”（如 fight against cancer/poverty）。fight for sth 表示“为……而奋斗/争取”（如 fight for your rights）。","语气提醒：在日常口语里，fight with 很容易被理解为“吵架或打架”；如果想表达“为共同目标并肩作战”，更常说 fight alongside 或 fight together (with)."],"etymology":"“fight”源自古英语/古诺斯语相关词，核心义是“战斗、搏斗”。“fight with”中“with”表示“与……一起/对着……”，因此可引申为“与某人争斗（口头或肢体）”，也可扩展为“与某个困难对抗”。","mnemonic":["with=“和/跟”。fight with=“跟……fight”，联想“跟某人杠上了”。","把 fight with 想成“跟……过不去”：既能是吵架/打架，也能是跟难题‘较劲’。"]}
{"word":"fight with crisis","summary":{"en":"struggle to handle and overcome a serious difficult situation","zh":"努力应对并克服严重困境"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to struggle to deal with a serious difficult situation; to try to overcome a crisis","zh":"与严重困境作斗争；努力应对并克服危机"},"examples":[{"en":"The company fought with the crisis by cutting costs and finding new customers.","zh":"这家公司通过削减成本并寻找新客户来应对危机。"},{"en":"Many families are fighting with a financial crisis after losing jobs.","zh":"许多家庭在失业后正与经济危机作斗争。"},{"en":"The government is fighting with the crisis by improving emergency supplies and communication.","zh":"政府正通过完善应急物资与信息沟通来应对危机。"}]}],"synonyms":["deal with a crisis","cope with a crisis","tackle a crisis","combat a crisis","overcome a crisis","fight through a crisis","respond to a crisis"],"phonetic":"/faɪt wɪð ˈkraɪsɪs/","extraExplanation":["更自然的英文说法通常是：fight a crisis（应对危机）、fight through a crisis（挺过危机）、fight against the crisis（对抗危机）。","“fight with + 人/事物”更常见的意思是“与……打架/争吵”（fight with someone），或“用……作战”（fight with a sword）。所以在正式写作中建议改用上面更地道的表达。"],"etymology":"“fight”源自古英语，意为“战斗、争斗”；“crisis”源自希腊语，原意为“关键时刻、转折点”。合在一起表达“在关键困境中奋力应对”。","mnemonic":["把 crisis 记成“危(危机) + 关键时刻”：遇到危机就要 fight（打）来扛过去。","联想中文“抗危机”：抗=fight，危机=crisis。"]}
{"word":"fight your way","summary":{"en":"make progress with great effort through difficulties; sometimes literally force a way through","zh":"在阻力中拼命推进并取得进展；有时也指用武力或强行挤出一条路"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make progress or succeed by using a lot of effort and determination, especially when there are many difficulties","zh":"通过顽强努力在困难中推进或取得成功（强调过程艰难）"},"examples":[{"en":"She fought her way to the top of the company despite many setbacks.","zh":"尽管遇到许多挫折，她还是一路拼到了公司的高层。"},{"en":"We had to fight our way through the paperwork to get the permit.","zh":"为了拿到许可，我们不得不硬着头皮把一堆手续扛过去。"},{"en":"He fought his way back after the injury.","zh":"受伤后他拼尽全力重新站了起来（状态恢复/重回赛场）。"}]},{"partOfSpeech":"phrase","definition":{"en":"to move forward through a place by using physical force, especially by fighting or pushing past people","zh":"通过打斗或强行挤开人群来向前推进（更字面、更动作化）"},"examples":[{"en":"They fought their way through the crowd to reach the exit.","zh":"他们一路挤开人群，才到达出口。"},{"en":"The soldiers fought their way into the city.","zh":"士兵们一路作战，打进了城里。"}]}],"synonyms":["struggle through","push through","battle through","work your way","force your way","make your way"],"phonetic":"/faɪt jʊr weɪ/","extraExplanation":["结构提示：fight + one’s way + 介词短语（to/into/through/back/out）。其中 one’s 会随主语变化：fight my/your/his/her/our/their way。","语气与搭配：比“work your way”更强调艰难、阻力大，甚至带一点“硬拼/硬闯”的感觉；既可褒义（拼搏），也可中性描述（费劲）。"],"etymology":"来自英语固定结构“fight one’s way”，字面意思是“用打斗开出一条路”。后来引申为“在困难中靠意志和努力闯出道路”，常用于职业、学业、康复等语境。","mnemonic":["把它想成“用打架（fight）开路（way）”：不一定真打架，也可以是“硬扛困难闯过去”。","联想中文：一路“拼”出一条“路”——“拼”= fight，“路”= way。"]}
{"word":"fightable","summary":{"en":"Fightable means something can be fought against or is worth fighting; it can also describe a person/team that shows fighting spirit.","zh":"Fightable 指“可以被对抗/值得去对抗的”，也可形容人或队伍“有斗志、能拼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be fought or resisted; possible or suitable to fight against.","zh":"可以被对抗的；值得或适合去打（对抗）的。"},"examples":[{"en":"The infection is serious, but it’s fightable with the right medicine.","zh":"这次感染很严重，但用对的药是可以对抗的。"},{"en":"Some problems feel overwhelming, but many are fightable step by step.","zh":"有些问题看起来很难，但很多都可以一步步去应对。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sports, informal) Showing the spirit or ability to keep fighting in a match.","zh":"（体育/口语）有斗志的；能坚持拼搏的。"},"examples":[{"en":"Even after a tough first round, she stayed fightable and kept moving forward.","zh":"第一回合很艰难，但她仍然很有斗志，继续向前。"},{"en":"The team looked more fightable in the second half.","zh":"球队在下半场看起来更能拼、更有斗志。"}]}],"synonyms":["beatable","manageable","resistible","winnable","defeatable"],"phonetic":"ˈfaɪtəbəl","extraExplanation":["“fightable”由“fight + -able”构成，意思是“能够被……的/值得……的”。它不是最常见的日常词；更常见的表达有：can be fought、beatable（可战胜的）、manageable（可应付的）。","语气上，“fightable”常带一点鼓励意味：强调“还有办法、还可以坚持”，在健康（fightable disease）或困难（fightable challenges）的语境里较常见。"]}
{"word":"fightback","summary":{"en":"Fight back means to resist by attacking or pushing against someone/something; as a noun (often written fightback), it means a strong comeback from a losing position.","zh":"fight back 指“还击/反抗”；作名词（常写作 fightback）指“从劣势中强势逆转/反扑”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to defend yourself by attacking someone who is hurting or threatening you; to resist forcefully","zh":"（在被伤害或威胁时）还击；反抗"},"examples":[{"en":"If someone grabs you, try to fight back and call for help.","zh":"如果有人抓住你，尽量还击并呼救。"},{"en":"The workers fought back against unfair pay cuts.","zh":"工人们反抗不公平的降薪。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong return to success after being in a losing position (common in sports, business, or politics)","zh":"（多用于体育/商业/政治）逆转；强势反扑；扭转颓势"},"examples":[{"en":"The team made an amazing fightback in the second half.","zh":"这支球队在下半场完成了惊人的逆转。"},{"en":"After months of losses, the company’s fightback surprised investors.","zh":"连续数月亏损后，这家公司的强势反扑让投资者很惊讶。"}]}],"synonyms":["retaliate","resist","strike back","push back","comeback"],"phonetic":"/faɪt bæk/","extraExplanation":["常见写法是两词的动词短语 **fight back**（“还击/反抗”）。在英式体育新闻里，也常把名词写成一个词 **fightback**（“逆转/反扑”）。美式英语里名词更常见写法是 **comeback**。","语气上，**fight back**（动词）强调“抵抗、反击”的动作；**fightback**（名词）更强调“从落后到扳回来的过程/结果”，尤其用于比赛报道。"]}
{"word":"fighter","summary":{"en":"“Fighter” means someone who fights (a boxer/soldier), someone who keeps fighting for a cause or doesn’t give up, or a military aircraft (fighter jet).","zh":"“fighter”可指斗士/战士（如拳击手、军人），也可指为某事业抗争或不轻易放弃的人，还可指战斗机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who fights, especially as a job (such as a boxer or soldier).","zh":"战士；斗士；（尤指以打斗为职业的）拳击手；军人。"},"examples":[{"en":"She trained hard to become a professional fighter.","zh":"她刻苦训练，想成为职业拳击手。"},{"en":"The fighters protected the city during the war.","zh":"战争期间，战士们保卫了这座城市。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who strongly resists or argues for something (a determined supporter).","zh":"（为某事）坚决抗争的人；坚定的拥护者。"},"examples":[{"en":"He’s a fighter for equal rights.","zh":"他是为平等权利而斗争的人。"},{"en":"Even when life is difficult, she stays a fighter.","zh":"即使生活很艰难，她也始终很坚强。"}]},{"partOfSpeech":"n.","definition":{"en":"A military aircraft designed for air-to-air combat (a fighter jet).","zh":"战斗机（用于空战的军用飞机）。"},"examples":[{"en":"A fighter flew over the coastline on patrol.","zh":"一架战斗机在海岸线上空巡逻。"},{"en":"The museum displayed an old fighter from World War II.","zh":"博物馆展出了一架二战时期的旧战斗机。"}]}],"synonyms":["combatant","warrior","boxer","battler","jet"],"phonetic":"/ˈfaɪtər/","extraExplanation":["“fighter”既可指“会打的人/战士”，也常用来形容性格与精神：a fighter 表示“很坚强、不轻易放弃的人”。口语里夸人有韧性时很常用。","搭配提示：fighter for + 事业/目标（为……而斗争的人）；fighter against + 问题/敌人（与……作斗争的人）。航空语境中常说 fighter jet（喷气式战斗机），也可简写为 fighter。"]}
{"word":"fighter-mage","summary":{"en":"A fantasy/RPG character who fights well and also uses magic.","zh":"指在奇幻/角色扮演语境中既擅长战斗又会施法的角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A character (especially in fantasy stories or role-playing games) who combines skilled physical combat with the ability to use magic.","zh":"（尤指奇幻故事或角色扮演游戏中的）战斗法师；兼具近战格斗能力与施法能力的角色。"},"examples":[{"en":"In the party, our fighter-mage can tank damage and still cast protective spells.","zh":"在队伍里，我们的战斗法师既能扛伤害，还能施放防护法术。"},{"en":"She built her character as a fighter-mage, using a sword for close fights and magic for range.","zh":"她把角色做成战斗法师：近身用剑，远程用魔法。"},{"en":"The fighter-mage archetype is popular because it feels versatile and heroic.","zh":"战斗法师这种原型很受欢迎，因为感觉很全能、很有英雄气质。"}]}],"synonyms":["spellsword","battle mage","battlemage","gish"],"phonetic":"/ˈfaɪtər meɪdʒ/","extraExplanation":["“fighter-mage”多见于桌游（如D&D）、电子游戏和奇幻小说的角色分类/玩家术语，通常表示“战士+法师”的混合职业或配装思路。","写法上常见带连字符的fighter-mage，也有人写作fighter mage。类似概念常用词还有spellsword、battle mage、gish（玩家俚语）。"]}
{"word":"fighteress","summary":{"en":"A rare, dated word meaning “a female fighter.”","zh":"一个较罕见、偏旧的词，意思是“女战士/女斗士”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, dated) A woman who fights, especially as a soldier, boxer, or combatant.","zh":"（罕见/较旧用法）女战士；女斗士；从事战斗或格斗的女性（如士兵、拳击手、战斗人员）。"},"examples":[{"en":"In older adventure stories, the heroine is sometimes described as a fighteress.","zh":"在一些较老的冒险故事里，女主角有时会被称为 fighteress（女斗士）。"},{"en":"She trained for years and became a fierce fighter—today we would usually say “female fighter,” not “fighteress.”","zh":"她训练多年，成了一名凶猛的斗士——如今我们通常会说“female fighter”，而不是“fighteress”。"}]}],"synonyms":["female fighter","woman fighter","woman warrior","warrior","combatant"],"phonetic":"ˈfaɪtərəs","extraExplanation":["“fighteress”由“fighter + -ess”构成；“-ess”是传统的女性后缀（如 actress, waitress）。在现代英语里，这类带性别后缀的职业/身份词越来越少用，因为可能显得过时或带有刻板印象；更常见的表达是“fighter”“woman fighter”或“female fighter”。","在写作中使用“fighteress”往往会带来一种复古、文学化或戏谑的语气；在正式或中性语境中一般不推荐。"]}
{"word":"fighters","summary":{"en":"“Fighters” means people who fight, either in war, sports, or by strongly resisting difficulties or supporting a cause.","zh":"“fighters”指“战斗的人”，可指战争或运动中的战士/选手，也可指在困境中坚强抗争的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who fight—such as soldiers, boxers, or anyone who struggles strongly for a cause.","zh":"战士；斗士；（如士兵、拳击手，或为某个事业奋力抗争的人）"},"examples":[{"en":"The firefighters are brave fighters against dangerous blazes.","zh":"消防员是与危险火灾搏斗的勇敢斗士。"},{"en":"She’s a fighter who never gives up, even when things are hard.","zh":"她是个从不轻言放弃的斗士，即使困难重重。"},{"en":"Many fighters joined the army during the war.","zh":"战争期间，许多战士加入了军队。"}]}],"synonyms":["warriors","combatants","boxers","contenders","survivors"],"phonetic":"/ˈfaɪtɚz/","extraExplanation":["“fighters”是“fighter”的复数形式。常见搭配有：freedom fighters（自由战士/为自由而战的人，语境可能带有立场差异）、street fighters（街头斗殴者）、professional fighters（职业格斗选手）。","在口语中，形容一个人生病或遇到困难时很坚强，也常说“He/She is a fighter.”（他/她很能扛、很坚韧）。"]}
{"word":"fightiness","summary":{"en":"Fightiness means an aggressive, combative tendency to fight or argue.","zh":"Fightiness 指“好斗性/对抗性”，即爱争吵或爱打架的倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tendency to want to fight, argue, or resist; an aggressive or combative attitude.","zh":"好斗性；爱争吵、爱对抗的倾向；强硬好战的态度。"},"examples":[{"en":"His fightiness often turns small disagreements into big arguments.","zh":"他的好斗性常常把小分歧变成大争吵。"},{"en":"The coach tried to channel her fightiness into focused competition.","zh":"教练试着把她的好斗劲引导到更专注的比赛上。"},{"en":"There was a fightiness in his tone that made the discussion tense.","zh":"他语气里带着一股好斗劲，让讨论变得紧张。"}]}],"synonyms":["aggressiveness","combativeness","pugnacity","contentiousness","belligerence"],"phonetic":"/ˈfaɪ.ti.nəs/","extraExplanation":["“fightiness”来自形容词“fighty”（爱打架的、好斗的）+ 名词后缀“-ness”（表示“性质/状态”）。它多用于描述人的“态度或性格倾向”，语气通常偏负面（像“爱杠、爱冲突”），但在体育或竞争语境里也可能带一点正面含义（像“斗志、拼劲”）。","常见搭配：show/display fightiness（表现出好斗）、a streak of fightiness（偶尔冒出的好斗劲）、tone/edge of fightiness（语气里的对抗感）。如果想表达更中性的“斗志/拼搏精神”，更常用“fighting spirit”或“grit”。"]}
{"word":"fighting","summary":{"en":"“Fighting” most often means physical conflict, or describes a determined, competitive spirit; in some Asian English contexts it’s also used to mean “Keep going!”","zh":"“fighting”常指打斗/战斗，也可形容不服输、拼搏的精神；在一些亚洲英语语境中还可用作“加油！”的鼓励语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of using physical force or weapons to try to hurt someone; a conflict or battle.","zh":"打斗；战斗；斗争（用武力或武器伤害对方的冲突）"},"examples":[{"en":"Fighting broke out after the game.","zh":"比赛结束后爆发了打斗。"},{"en":"The movie has a lot of fighting scenes.","zh":"这部电影有很多打斗场面。"}]},{"partOfSpeech":"adj.","definition":{"en":"Taking part in a fight, war, or strong competition; trying hard to win or achieve something.","zh":"好斗的；战斗中的；奋力争取的（积极参与竞争或努力达成目标）"},"examples":[{"en":"She has a fighting spirit and never gives up.","zh":"她有不服输的精神，从不放弃。"},{"en":"They’re a fighting team, even when they’re behind.","zh":"即使落后，他们也是一支拼到底的队伍。"}]},{"partOfSpeech":"int.","definition":{"en":"Used as an encouragement meaning “Keep going!” or “Don’t give up!”","zh":"（口语鼓励）加油！坚持住！不要放弃！"},"examples":[{"en":"You’ve studied hard—fighting! You can do it.","zh":"你很努力了——加油！你可以的。"},{"en":"Fighting! Just one more week until the exam.","zh":"加油！离考试就剩一周了。"}]}],"synonyms":["combat","conflict","brawl","battle","struggle","determined","tenacious"],"phonetic":"/ˈfaɪtɪŋ/","extraExplanation":["“Fighting!” 作为“加油/坚持”的用法，在东亚英语语境中很常见（受韩语“화이팅/파이팅”和中文网络用语影响）。在美国本土英语里，更自然的说法通常是 “You’ve got this!”, “Keep it up!”, “Hang in there!”, “Go for it!”。"]}
{"word":"fightingly","summary":{"en":"“Fightingly” means “in a combative, ready-to-fight way,” often describing tone or attitude (sometimes also a determined spirit in sports).","zh":"“fightingly”表示“好斗地、带着要争斗的态度”，常形容语气或态度；在体育语境也可指“很拼、很有斗志地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows a willingness to fight or argue; combatively or aggressively.","zh":"以好斗或愿意争斗/争辩的方式；挑衅地、咄咄逼人地。"},"examples":[{"en":"He replied fightingly when someone questioned his decision.","zh":"有人质疑他的决定时，他以好斗的口气回击。"},{"en":"The team played fightingly even after falling behind.","zh":"即使落后，这支队伍仍踢得很拼、很有斗志。"}]}],"synonyms":["combatively","aggressively","belligerently","pugnaciously","contentiously"],"phonetic":"/ˈfaɪtɪŋli/","extraExplanation":["“fightingly”并不常见，日常英语里更常用“combatively / aggressively / belligerently”。","构词上是“fighting + -ly”，表示“以……的方式”。在体育报道里也可引申为“顽强地、很拼地”。","语气提示：形容人说话时用“fightingly”往往带负面色彩（爱挑衅、爱吵架）；形容比赛态度时常偏正面（有斗志）。"]}
{"word":"fightings","summary":{"en":"“Fightings” is an uncommon plural noun meaning acts or periods of conflict (battles/hostilities).","zh":"“fightings”是不太常用的复数名词，表示多次或持续的战斗/战事（敌对行动）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Acts or periods of physical conflict; battles or hostilities.","zh":"（复数名词）打斗、战斗的行为或时期；战事、冲突。"},"examples":[{"en":"The fightings continued through the night.","zh":"战斗持续了整整一夜。"},{"en":"After several days of fightings, both sides agreed to a ceasefire.","zh":"经过几天的战事，双方同意停火。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) The plural of “fighting” meaning arguments or serious disputes (not necessarily physical).","zh":"（较少见）“fighting”的复数：争吵或严重争执（不一定是肢体冲突）。"},"examples":[{"en":"There were frequent fightings between the two groups at school.","zh":"学校里这两个团体之间经常发生争执。"}]}],"synonyms":["battles","hostilities","clashes","conflicts","fights"],"phonetic":"/ˈfaɪtɪŋz/","extraExplanation":["“fightings”在现代英语里不算常用。更自然的说法通常是：\n- 用不可数名词：fighting（战斗/打斗）\n- 用更常见的复数：fights（多次打架/争斗）、battles（战役）、hostilities（敌对行动）\n\n在新闻报道或较正式的叙述中，fightings偶尔会出现，用来强调“多次战斗/持续的战事”。"]}
{"word":"fights","summary":{"en":"“Fights” can mean multiple conflicts/arguments (noun plural) or “he/she/it fights” (verb).","zh":"“fights”既可表示多次冲突/争吵（名词复数），也可表示“他/她/它在打/在斗争”（动词第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Physical or verbal conflicts; arguments; battles.","zh":"（名词复数）打架；争吵；冲突；战斗。"},"examples":[{"en":"There were fights outside the stadium after the game.","zh":"比赛后，体育场外发生了打架冲突。"},{"en":"They had constant fights about money.","zh":"他们经常因为钱而争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) A strong will to resist or keep trying; determination.","zh":"（名词复数）斗志；不服输的劲；坚持到底的决心。"},"examples":[{"en":"Even when he was sick, he still had fights left in him.","zh":"即使生病了，他仍然有斗志。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, present tense—third person singular of “fight”) To use physical force against someone; to take part in a battle.","zh":"（动词，“fight”的第三人称单数现在时）打；打架；参战。"},"examples":[{"en":"He fights anyone who insults his friends.","zh":"谁侮辱他的朋友，他就跟谁打。"},{"en":"The army fights to defend the border.","zh":"军队为保卫边境而战。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, present tense—third person singular) To argue strongly; to quarrel.","zh":"（动词）激烈争论；吵架。"},"examples":[{"en":"She fights with her sister over small things.","zh":"她会因为小事跟妹妹吵架。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, present tense—third person singular) To struggle against a problem, illness, or unfair situation.","zh":"（动词）与（问题/疾病/不公）抗争；努力对抗。"},"examples":[{"en":"He fights cancer with treatment and support.","zh":"他通过治疗和支持来对抗癌症。"},{"en":"They fight for equal rights.","zh":"他们为平等权利而斗争。"}]}],"synonyms":["battles","conflicts","arguments","quarrels","struggles","clashes"],"phonetic":"/faɪts/","extraExplanation":["“fights”可以是名词复数（很多场冲突/争吵），也可以是动词第三人称单数（he/she/it fights）。","动词原形是 fight，过去式和过去分词是 fought（不规则变化）：fight → fought → fought。"]}
{"word":"fightwite","summary":{"en":"“Fight with” usually means to argue with someone, to physically fight someone, or to struggle with a difficult problem.","zh":"“fight with”通常表示与某人争吵、与某人打架，或与困难/问题作斗争。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to argue or have a quarrel with someone","zh":"与某人争吵；吵架"},"examples":[{"en":"I don’t want to fight with you—let’s talk calmly.","zh":"我不想跟你吵架——我们冷静聊聊。"},{"en":"They fought with each other about money.","zh":"他们因为钱的问题互相争吵。"}]},{"partOfSpeech":"phrase","definition":{"en":"to physically fight against someone; to get into a physical conflict with someone","zh":"与某人打架；发生肢体冲突"},"examples":[{"en":"He got in trouble for fighting with another student.","zh":"他因为跟另一名学生打架而惹上麻烦。"},{"en":"Two men were fighting with each other outside the bar.","zh":"酒吧外面有两个男人在互殴。"}]},{"partOfSpeech":"phrase","definition":{"en":"to struggle with a difficult problem or situation (common in everyday English)","zh":"与（困难/问题）搏斗；艰难应对"},"examples":[{"en":"She’s been fighting with anxiety for years.","zh":"她多年来一直在与焦虑作斗争。"},{"en":"I’m fighting with this math problem—I can’t solve it yet.","zh":"我在跟这道数学题较劲——还没解出来。"}]}],"synonyms":["argue with","quarrel with","have a fight with","struggle with","clash with"],"phonetic":"/faɪt wɪð/","extraExplanation":["“fightwite”不是标准英语拼写；最可能是把“fight with”连在一起打出来了。","小提示：当你说“fight with someone”，常见含义是“和某人吵架/打架”；而“fight against”更强调“对抗（某人/某事）”。另外“fight with + 情绪/疾病/困难”常表示“与……抗争/艰难应对”。"]}
{"word":"figitidae","summary":{"en":"Figitidae: a family of parasitoid wasps studied in entomology and biological control.","zh":"Figitidae：短腹寄生蜂科，一类寄生性小蜂，常用于昆虫学研究与生物防治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small parasitic (parasitoid) wasps, many of which lay their eggs in or on other insects (often fly larvae), and are important in ecosystems and biological control","zh":"（昆虫学）一类小型寄生蜂（更准确说是“拟寄生/寄生性”蜂）的科名；常把卵产在其他昆虫体内或体表（常见于蝇类幼虫等），在生态系统与生物防治中很重要"},"examples":[{"en":"Figitidae are tiny wasps, but they can have a big effect on insect populations.","zh":"Figitidae（短腹寄生蜂科）体型很小，但对昆虫种群数量可能有很大影响。"},{"en":"Some Figitidae parasitize flies that attack crops, so researchers study them for biological control.","zh":"有些短腹寄生蜂科会寄生危害作物的蝇类，因此研究人员会研究它们用于生物防治。"}]}],"synonyms":["figitid wasps"],"phonetic":"/fɪˈdʒɪtɪdi/","extraExplanation":["“Figitidae”是昆虫分类学里的拉丁化科名，通常不翻译成日常词汇；中文常见译名为“短腹寄生蜂科”（不同资料译名可能略有差异）。","这类蜂对人一般无害；它们主要把生命周期“投资”在其他昆虫身上，因此在农业害虫管理与生态研究中常被提及。"]}
{"word":"figless","summary":{"en":"Figless means “without figs” or, figuratively, “without a fig leaf”—with no concealment or excuse.","zh":"figless 表示“没有无花果的”，也可比喻为“没有遮羞布/不加掩饰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without figs (the fruit); having no figs.","zh":"没有无花果（这种水果）的；不含无花果的。"},"examples":[{"en":"The figless tree didn’t attract many birds this year.","zh":"这棵不结果无花果的树今年没吸引到多少鸟。"},{"en":"She ordered a figless salad because she doesn’t like dried fruit.","zh":"她点了不含无花果的沙拉，因为她不喜欢干果。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without a fig leaf; (figurative) without a cover-up or excuse—open, blunt, or unmasked.","zh":"没有“遮羞叶”（无花果叶）的；（比喻）不加掩饰的、没有遮掩或借口的。"},"examples":[{"en":"It was a figless attempt to hide the mistake—everyone could see what happened.","zh":"这次想掩盖错误的做法毫无遮掩——大家都看得出发生了什么。"},{"en":"His figless honesty sometimes made people uncomfortable.","zh":"他不加掩饰的坦率有时让人不自在。"}]}],"synonyms":["unfigged","without figs","uncovered","unmasked","undisguised","blunt"],"phonetic":"/ˈfɪɡləs/","extraExplanation":["“fig leaf（无花果叶）”在英语里常用作比喻，指用来遮掩尴尬、错误或不体面的事的“遮羞布/借口”。这一用法与《圣经》中亚当和夏娃用无花果叶遮体的故事有关。因此 figless 在比喻意义上可理解为“连遮羞布都没有”，强调赤裸裸、毫不掩饰。","figless 不是常见词，更常见的表达是 “without a fig leaf / with no fig leaf” 或直接用 “uncovered, unmasked, undisguised”。"]}
{"word":"figlike","summary":{"en":"Figlike means “resembling a fig,” often describing shape, color, or texture (especially in food or botany).","zh":"figlike 意为“像无花果的”，常用于描述形状、颜色或质地（尤其在食物或植物学语境中）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a fig (the fruit), especially in shape, color, or texture.","zh":"像无花果的；在形状、颜色或质地上类似无花果的。"},"examples":[{"en":"The small, figlike fruits turned purple as they ripened.","zh":"那些小小的、像无花果一样的果实成熟后变成了紫色。"},{"en":"She described the snack as figlike—soft, sweet, and slightly seedy.","zh":"她形容那种零食“像无花果一样”——柔软、甜，并带一点籽的口感。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having features similar to a fig or a fig structure (such as a fig-shaped fruit).","zh":"（植物学）具有类似无花果或无花果结构特征的（如无花果状的果实）。"},"examples":[{"en":"The field guide noted a figlike form in the plant’s fruit.","zh":"野外指南提到这种植物的果实呈无花果状。"}]}],"synonyms":["figgy","fig-shaped","figlike in appearance"],"phonetic":"/ˈfɪɡˌlaɪk/","extraExplanation":["“figlike”由“fig（无花果）+ -like（像……一样）”构成，属于很直观的描写性形容词，多见于自然观察、烹饪描述或植物学语境。","文化上无花果在英语语境里常与“甜、柔软、籽多（seedy）”的口感联想在一起，但“figlike”本身通常是客观的外观/口感描写，并不自带褒贬。"]}
{"word":"figment","summary":{"en":"A figment is something imagined or invented, not real—often used in the phrase “a figment of the imagination.”","zh":"figment 指“虚构的、想象出来的东西”，常用于短语“a figment of the imagination（纯属想象）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something invented by the imagination rather than based on real facts; an unreal idea or story.","zh":"想象出来的事物；虚构的念头或故事（不基于事实）。"},"examples":[{"en":"The rumor turned out to be a figment of someone’s imagination.","zh":"那个谣言后来证明只是某人的凭空想象。"},{"en":"She feared the shadows, but they were only a figment.","zh":"她害怕那些影子，但那只是幻象而已。"}]}],"synonyms":["illusion","fantasy","invention","fabrication","chimera"],"phonetic":"/ˈfɪɡmənt/","extraExplanation":["“Figment”常见搭配是 **a figment of (someone’s) imagination**，表示“纯属想象、子虚乌有”。","词源来自拉丁语 *fingere*（塑造、捏造），所以它带有“编造出来”的意味，语气通常是否定或怀疑：暗示某事“不真实”。","在文学或叙事中，“figment”常用来强调现实与幻想的界限，例如：某个角色的恐惧、记忆或传闻其实只是心理投射。"]}
{"word":"figmental","summary":{"en":"Figmental means “imaginary; existing only in the mind.” It’s rare; most people say “imaginary” or use the noun “figment.”","zh":"figmental 指“想象的、虚构的，只存在于脑中”。这个词很少用，更常见的是 imaginary，或名词 figment（如 figment of one’s imagination）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing only in the imagination; not real (often used like “imaginary”).","zh":"只存在于想象中；不真实的（常相当于“虚构的/想象的”）。"},"examples":[{"en":"The monsters were figmental, but her fear felt real.","zh":"怪物是想象出来的，但她的恐惧感却很真实。"},{"en":"He treated a figmental problem as if it were an emergency.","zh":"他把一个虚构的问题当成紧急事件来处理。"}]}],"synonyms":["imaginary","fictional","made-up","illusory"],"phonetic":"/ˈfɪɡmən(t)əl/","extraExplanation":["“figmental”在现代英语中非常少见，日常更常用的是“figment”（名词：虚构的事物、想象出来的东西）以及“figment of one’s imagination”（固定搭配：某人凭空想象出来的东西）。","你可能想写的是“figment”或“figmental”。如果你要表达“想象的、虚构的”，更自然的替代词是：imaginary / fictional / made-up。"]}
{"word":"figments","summary":{"en":"Figments are imagined things—ideas or details that aren’t real; sometimes it also means small traces or fragments (especially in plural).","zh":"figments 指“想象出来的东西、虚构之物”；复数时也可指零星片段/痕迹（多用于想法、记忆或故事）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something imagined rather than real; a product of the mind.","zh":"想象出来的东西；虚构之物（并非真实存在）。"},"examples":[{"en":"His fear of being followed was just a figment of his imagination.","zh":"他害怕被跟踪只是想象出来的。"},{"en":"The “monster” in the closet turned out to be a figment.","zh":"衣橱里的“怪物”原来只是想象出来的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural) Small pieces or traces of something, especially ideas, memories, or stories.","zh":"（复数）零星片段；些许痕迹（尤指想法、记忆或故事的碎片）。"},"examples":[{"en":"Only figments of the old legend remain in local stories.","zh":"那段古老传说只在地方故事里留下零星片段。"}]}],"synonyms":["fantasies","illusions","inventions","fabrications","fragments"],"phonetic":"/ˈfɪɡmənts/","extraExplanation":["“figment”最常见的固定搭配是“a figment of one’s imagination”（某人凭空想象出来的东西）。在日常英语里，“figments”有时会被用来强调“只是一些想象出来的片段”，语气往往带有否定或质疑：并不真实。","词源上，figment 来自拉丁语 figmentum，和“塑造/捏造（to form, to fashion）”有关，因此带有“编造出来”的感觉。"]}
{"word":"figo","summary":{"en":"“Figo” can mean “cool/attractive” in informal Italian/Portuguese slang, and it can also refer to the footballer Luís Figo as a proper name.","zh":"“figo”既可作意大利语/葡语俚语，表示“很酷/有魅力”，也可作专名指足球名将路易斯·菲戈（Luís Figo）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, from Italian/Portuguese slang) cool; stylish; attractive.","zh":"（非正式，源自意大利语/葡萄牙语俚语）很酷的；时髦的；有吸引力的。"},"examples":[{"en":"That jacket is so figo—where did you get it?","zh":"那件夹克太figo了——你在哪里买的？"},{"en":"She’s figo and confident on stage.","zh":"她在舞台上又figo又自信。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname, especially referring to Luís Figo, a famous Portuguese football (soccer) player.","zh":"一个姓氏，常指葡萄牙著名足球运动员路易斯·菲戈（Luís Figo）。"},"examples":[{"en":"Figo was known for his skillful dribbling and crossing.","zh":"菲戈以出色的盘带和传中而闻名。"},{"en":"My dad grew up watching Figo play for Portugal.","zh":"我爸爸从小看菲戈代表葡萄牙比赛。"}]}],"synonyms":["cool","stylish","awesome","attractive"],"phonetic":"/ˈfiɡoʊ/","extraExplanation":["“figo”在意大利语口语里常表示“很帅/很酷”，有时也带一点“很有型、很会穿搭”的感觉；在葡语网络语境中也可能被借用成类似的夸赞词。","它和意大利语“fico（无花果）”在口语演变上常被联系起来：从“甜/好”引申到“棒/酷”（属于俚语用法，正式场合慎用）。","在体育文化里，“Figo”常直接指球星Luís Figo；如果写作“Figo”，通常是专有名词而非俚语形容词。"]}
{"word":"figpecker","summary":{"en":"A “figpecker” is a bird that eats figs; in Australian usage it often means the figbird.","zh":"“figpecker”指吃无花果的鸟；在澳大利亚用法中常特指无花果鹂（figbird）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bird that feeds on figs; in Australia, this name often refers to the figbird (a type of oriole-like bird).","zh":"以无花果为食的鸟；在澳大利亚语境中常指“无花果鹂”（figbird，一种近似黄鹂的鸟）。"},"examples":[{"en":"A figpecker landed in the fig tree and started picking at the ripe fruit.","zh":"一只figpecker落在无花果树上，开始啄食成熟的果子。"},{"en":"In some parts of Australia, people call the figbird a “figpecker.”","zh":"在澳大利亚的一些地方，人们会把figbird叫作“figpecker”。"}]}],"synonyms":["figbird","(regional) fig-eater"],"phonetic":"/ˈfɪɡˌpɛkɚ/","extraExplanation":["“figpecker”多见于较口语或较旧的用法，带有地方色彩；更常见、更标准的名称通常是“figbird”（尤其在澳大利亚英语中）。","这个词是复合词：fig（无花果）+ pecker（啄食者/啄木鸟式的鸟），强调“啄食无花果”的习性，并不一定指真正的啄木鸟。"]}
{"word":"figs","summary":{"en":"“Figs” usually means more than one fig (the fruit). It can also appear in the idiom “not give a fig,” meaning “not care at all.”","zh":"“figs”通常是“无花果”的复数；也可见于习语“not give a fig”，表示“完全不在乎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of fig: a sweet, soft fruit with many small seeds, usually eaten fresh or dried.","zh":"fig（无花果）的复数：一种甜软、含许多小籽的水果，可鲜食或制成干果。"},"examples":[{"en":"She bought fresh figs at the farmers’ market.","zh":"她在农贸市场买了新鲜无花果。"},{"en":"Dried figs are often used in desserts and snacks.","zh":"无花果干常用于甜点和零食。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the expression “not give a fig,” a fig means something of very little value; the phrase means “not care at all.”","zh":"在短语“not give a fig”中，fig 指“不值一提的东西”；整句表示“完全不在乎”。"},"examples":[{"en":"He doesn’t give a fig what people think.","zh":"他根本不在乎别人怎么想。"},{"en":"I don’t give a fig about that rumor.","zh":"我对那个谣言一点也不在乎。"}]}],"synonyms":["fig (fruit)","dried figs","not care (for “not give a fig”)","not give a damn (similar idiom)"],"phonetic":"/fɪɡz/","extraExplanation":["“fig(s)”在饮食文化中很常见：无花果可以鲜吃，也常被晒干保存，用于烘焙、沙拉或搭配奶酪等。","“not give a fig”属于较口语、略带不屑的表达，语气类似“not give a damn / not give a crap”。在正式写作中不太常用。"]}
{"word":"figshell","summary":{"en":"“figshell” is a rare/nonstandard noun meaning the fig’s outer skin or a shell-like covering.","zh":"“figshell”是一个少见/不太规范的名词，指无花果的外皮或类似外壳的覆盖层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard word meaning the outer skin, rind, or shell-like covering of a fig (or something compared to it).","zh":"一个较少见或不太规范的词，指无花果的外皮/果皮，或比喻为“像无花果外壳一样的覆盖层”。"},"examples":[{"en":"The recipe asks you to keep the figshell on for extra texture.","zh":"这个食谱让你保留无花果的外皮，以增加口感。"},{"en":"He peeled away the figshell to reach the soft inside.","zh":"他剥开无花果的外皮，露出柔软的果肉。"}]}],"synonyms":["fig skin","fig rind","fig shell","rind","skin"],"phonetic":"/ˈfɪɡˌʃɛl/","extraExplanation":["“figshell”在现代英语里非常少见，很多情况下人们会直接写成 two words：\"fig shell\"，或更常用 \"fig skin\" / \"fig peel\" / \"fig rind\"。如果你是在某篇文章、诗歌或特定领域材料里看到它，它可能是作者为强调“外层/保护壳”的意象而临时造的复合词。","如果你想表达更自然的说法：\n- 食物语境：\"fig skin\"（无花果皮）、\"peel the fig\"（剥皮）\n- 更偏“果皮/外皮”：\"rind\"（果皮，较厚的外皮）"]}
{"word":"figulate","summary":{"en":"Figulate (rare) means made of clay or molded like pottery, often used in archaeology or art history.","zh":"figulate（罕见）指陶制的、由黏土塑形而成的，常见于考古或艺术史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Made of clay; shaped or molded (especially like pottery).","zh":"（罕见）陶制的；由黏土制成的；（尤指像陶器一样）塑形/模制而成的。"},"examples":[{"en":"Archaeologists found figulate vessels in the burial site.","zh":"考古学家在墓葬遗址中发现了陶制器皿。"},{"en":"The museum displays figulate art from ancient workshops.","zh":"博物馆展出了古代作坊制作的陶艺作品。"}]}],"synonyms":["ceramic","pottery","earthenware","clay-made"],"phonetic":"/ˈfɪɡjəˌleɪt/","extraExplanation":["“figulate”主要出现在考古、艺术史或博物馆说明文字中，用来指“陶器/陶制品”或“陶艺”。在日常英语里更常用的是“ceramic”“pottery”“earthenware”。","词源来自拉丁语 figulus（陶工、制陶者）/ figlina（陶器作坊、陶土场），因此带有“制陶、塑形”的语感。"]}
{"word":"figulated","summary":{"en":"Figulated means “made of clay/pottery-like” (rare), or the past form of a rare verb meaning “shaped, especially in clay.”","zh":"figulated 指“陶制的/像陶器的”（罕见），也可作罕见动词 figulate 的过去式，表示“（尤指用黏土）塑形、成形”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Made of clay; pottery-like; shaped or molded as if by a potter.","zh":"（罕见/文学用语）由黏土制成的；像陶器一样的；如同陶匠塑形般被塑造的。"},"examples":[{"en":"Archaeologists found a figulated vessel used for storing grain.","zh":"考古学家发现了一只用于储存谷物的陶制容器。"},{"en":"The poem describes a figulated body rising from the earth, half human and half clay.","zh":"诗中描写一个从土地里升起的“泥塑之躯”，半人半土。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of the rare verb “figulate”: to shape or form (something), especially in clay.","zh":"罕见动词 figulate 的过去式：塑造/成形（尤指用黏土）。"},"examples":[{"en":"The artisan figulated the clay into small lamps.","zh":"工匠把黏土塑造成小油灯。"}]}],"synonyms":["earthenware","ceramic","clay-made","molded","shaped"],"phonetic":"/ˈfɪɡjəˌleɪtɪd/","extraExplanation":["“figulated / figulate”非常少见，多见于旧式写作、诗歌或古文风格的描述。现代英语更常用的表达是：made of clay / earthenware / ceramic，或动词 mold / shape / form。","词源上与拉丁语 figulus（陶匠）有关，因此它常带有“陶匠手作、泥土塑形”的意象色彩，适合文学语境。"]}
{"word":"figuline","summary":{"en":"Figuline means “ceramic/pottery-related” or, less commonly, “pottery” itself.","zh":"figuline 指“与陶器/陶瓷有关的；陶制的”，较少见时也可指“陶器/陶制品”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to pottery or ceramics; made of clay and fired (like earthenware).","zh":"与陶器/陶瓷有关的；陶制的（用黏土烧制而成，如陶器）。"},"examples":[{"en":"Archaeologists found figuline vessels buried near the old settlement.","zh":"考古学家在古聚落附近发现了埋藏的陶制器皿。"},{"en":"The museum displays figuline art from the Roman period.","zh":"博物馆展出了罗马时期的陶艺作品。"}]},{"partOfSpeech":"n.","definition":{"en":"Pottery or ceramic ware (an uncommon, old-fashioned use).","zh":"陶器；陶制品（较少见、偏旧式的用法）。"},"examples":[{"en":"The collection includes glass, metalwork, and figuline.","zh":"这批藏品包括玻璃器、金属工艺品以及陶器。"}]}],"synonyms":["ceramic","pottery","earthenware","terracotta"],"phonetic":"/ˈfɪɡjəˌlaɪn/","extraExplanation":["“figuline”多见于考古、艺术史或较文学化的语境，日常英语里更常用“ceramic”“earthenware”“pottery”。","词源来自拉丁语“figulus”（陶工、制陶者），因此带有一种“与制陶工艺相关”的书面色彩。"]}
{"word":"figulines","summary":{"en":"Figuline means “related to pottery/clay,” and can also mean a piece of pottery (rare).","zh":"figuline 指“与陶器/陶土有关的、陶制的”，也可指“陶器”（较罕见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to pottery or earthenware; made of clay (a rare or literary word).","zh":"（罕见/文学用语）与陶器、陶土制品有关的；陶制的；泥土做的。"},"examples":[{"en":"The museum displayed figuline bowls from ancient villages.","zh":"博物馆展出了古代村落出土的陶碗。"},{"en":"She admired the figuline art—simple clay cups with beautiful patterns.","zh":"她很欣赏那种陶艺——朴素的泥杯上有美丽的纹样。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of pottery or earthenware (rare).","zh":"（罕见）陶器；陶土器物。"},"examples":[{"en":"Archaeologists uncovered small figulines used for daily cooking.","zh":"考古学家发现了用于日常烹饪的小陶器。"}]}],"synonyms":["pottery","ceramic","earthenware","clay"],"phonetic":"/ˈfɪɡjəˌlaɪn/","extraExplanation":["“figuline”较少见，多用于学术、考古或文学语境，日常英语更常用 pottery / ceramic / earthenware。","词源来自拉丁语 figulus（“制陶工”）与 figlina（“陶土作坊/制陶处”），因此带有“与制陶相关”的书面色彩。"]}
{"word":"figur","summary":{"en":"Figure can mean a number, a shape/person, or the verb “to think/estimate/calculate.”","zh":"Figure 可指数字、形状/人物，也可作动词表示“认为/估计/计算”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a number, especially written with digits (0–9); also a numerical value","zh":"数字（尤指用0–9写出的）；数值"},"examples":[{"en":"Write the figures clearly on the form.","zh":"请在表格上把数字写清楚。"},{"en":"Sales rose to six figures last year.","zh":"去年销售额涨到了六位数。"}]},{"partOfSpeech":"n.","definition":{"en":"the shape or outline of something; a form","zh":"（物体的）形状；轮廓"},"examples":[{"en":"In the fog, we could only see a dark figure.","zh":"在雾里，我们只能看到一个黑色的轮廓。"},{"en":"The artist drew a simple figure with a pencil.","zh":"画家用铅笔画了一个简单的形状。"}]},{"partOfSpeech":"n.","definition":{"en":"a person seen as an important character in society, history, art, etc.","zh":"重要人物（社会/历史/艺术等领域）"},"examples":[{"en":"She is a leading figure in modern jazz.","zh":"她是现代爵士乐的重要人物。"},{"en":"Abraham Lincoln is a major figure in U.S. history.","zh":"亚伯拉罕·林肯是美国历史上的重要人物。"}]},{"partOfSpeech":"v.","definition":{"en":"to think or believe something, after considering it","zh":"认为；估计（经过思考后）"},"examples":[{"en":"I figure it will take about an hour to get there.","zh":"我估计到那里大概需要一小时。"},{"en":"She figured he was too tired to talk.","zh":"她觉得他太累了，不想说话。"}]},{"partOfSpeech":"v.","definition":{"en":"to calculate or work out a number","zh":"计算；算出"},"examples":[{"en":"Can you figure the total cost?","zh":"你能算出总费用吗？"},{"en":"He figured out the tip quickly.","zh":"他很快算出了小费。"}]},{"partOfSpeech":"v.","definition":{"en":"to be part of a situation; to play a role","zh":"在…中出现；起作用"},"examples":[{"en":"Experience figured heavily in her decision.","zh":"经验在她的决定中起了很大作用。"},{"en":"Luck often figures in sports.","zh":"运气在体育比赛中常常起作用。"}]}],"synonyms":["number","digit","shape","form","person","calculate","estimate","think"],"phonetic":"/ˈfɪɡjər/","extraExplanation":["“figur”通常不是标准英语单词；最常见是把 **figure** 拼错了。标准拼写是 **figure**。","常见短语：**figure out**（弄明白/想出/算出），**figure in**（把…算进去），**figure on**（计划/指望）。","口语里 **I figure…** 很常用，意思接近 “我觉得/我估计…”，语气比 “I think” 更带一点“根据情况推断”的感觉。"]}
{"word":"figura","summary":{"en":"“Figura” is a borrowed word meaning “figure/shape,” sometimes used in art, music, or Italian-style expressions about the impression you make.","zh":"“figura”是外来词，常指“形象/形状/人物”，也可用于音乐的“音型”，或意大利语表达中指“给人的印象（体面与否）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Italian/Spanish/Portuguese) a figure; a shape or form; sometimes used in English when talking about art, design, or a person as a “figure” in society.","zh":"（源自意大利语/西班牙语/葡萄牙语）形象；外形；人物（有时在英语中用于艺术、设计或指社会中的“人物/代表性人物”）。"},"examples":[{"en":"In the painting, the central figura is outlined in bright gold.","zh":"在这幅画里，中心人物（figura）用亮金色勾勒出来。"},{"en":"The designer repeated the same figura to create a pattern.","zh":"设计师重复同一种形状（figura）来构成图案。"}]},{"partOfSpeech":"n.","definition":{"en":"(music, less common) a short musical figure or rhythmic pattern.","zh":"（音乐，较少见）短小的乐句；节奏型/音型。"},"examples":[{"en":"The drummer keeps a simple figura under the melody.","zh":"鼓手在旋律下方保持一个简单的节奏型（figura）。"},{"en":"Try repeating that figura more softly in the second verse.","zh":"试着在第二段把那个音型（figura）重复得更轻一些。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Italian expression, used in English contexts) an impression you make, often in phrases like “che figura!” meaning “what a scene/what an embarrassment!”","zh":"（意大利语表达，在英语语境中偶见）给人的印象；常见于“che figura!”表示“太尴尬了/出了大洋相！”"},"examples":[{"en":"He forgot her name—che figura!","zh":"他把她名字忘了——太尴尬了！（che figura!）"},{"en":"She worries about making a good figura at the interview.","zh":"她担心在面试中给人留下好印象（fare una buona figura）。"}]}],"synonyms":["figure","shape","form","silhouette","motif"],"phonetic":"/fiˈɡuɹə/","extraExplanation":["“figura”本身不是常见英语词；英语里通常用 figure（人物/图形/数字/身材）或 shape（形状）来表达。","在意大利文化里，“fare una (buona/brutta) figura”很常用，强调“给人留下（好/坏）印象”、以及在社交场合是否体面得体。英语写作中偶尔会保留 figura 来营造意大利语氛围。"]}
{"word":"figurability","summary":{"en":"Figurability means the quality or capacity of being shaped into an image, symbol, or narrative—often discussed in art, literature, and theory.","zh":"Figurability 指把经验或想法转化为形象、象征或叙事来表达的“可形象化性/可呈现性”，常见于艺术、文学与理论讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able to be represented, pictured, or expressed in a clear image, symbol, or narrative (often used in art, literature, or theory).","zh":"（常用于艺术、文学或理论语境）可被呈现、描绘或表达成清晰形象/象征/叙事的性质；可形象化性。"},"examples":[{"en":"The poet explores the figurability of grief by turning it into images of storms and empty rooms.","zh":"这位诗人通过“暴风雨”和“空房间”等意象来探讨悲伤的可形象化性。"},{"en":"In visual design, strong contrast increases the figurability of key ideas.","zh":"在视觉设计中，强对比能提升核心概念的可呈现性。"}]},{"partOfSpeech":"n.","definition":{"en":"in some academic writing (especially psychoanalysis and aesthetics), the mind’s capacity to form mental images and give shape to feelings or unconscious material.","zh":"（学术语境，尤见于精神分析与美学）心灵形成心理意象、把情感或无意识内容“塑形/成像”的能力。"},"examples":[{"en":"The therapist asked the client to describe a dream to support the figurability of difficult emotions.","zh":"治疗师请来访者描述梦境，以帮助把难以言说的情绪“成像/塑形”。"},{"en":"The essay argues that art offers figurability to experiences that feel unspeakable.","zh":"文章认为艺术能为那些难以言说的经历提供可呈现的形式。"}]}],"synonyms":["representability","depictability","imaginability","picturability","expressibility"],"phonetic":"/ˌfɪɡjərəbɪləti/","extraExplanation":["“Figurability”在日常英语里不常见，更常出现在艺术评论、文学研究、精神分析、哲学等学术写作中。","词源上与 figure（形象/图形/塑造）相关，核心含义是“能否被做成一个可感知的‘形’（图像、隐喻、故事框架等）”。","学习时可对照常见词：representation（表征/呈现）、imagery（意象）、figuration（形象化/比喻化的表达方式）。"]}
{"word":"figurable","summary":{"en":"Figurable means “able to be formed or represented (especially visually).”","zh":"figurable 意为“可成形的；可被表示（尤其可视化）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be shaped, formed, pictured, or represented (for example, in a diagram or in the mind).","zh":"可成形的；可描绘/可用图示或想象来表示的。"},"examples":[{"en":"The model is simple and easily figurable in a chart.","zh":"这个模型很简单，很容易用图表表示。"},{"en":"Some emotions are hard to describe but still figurable through art.","zh":"有些情绪很难用语言描述，但仍可以通过艺术表现出来。"}]}],"synonyms":["representable","depictable","picturable","illustrable","conceivable"],"phonetic":"/ˈfɪɡjərəbəl/","extraExplanation":["“figurable”在现代英语中较少见，常出现在较正式或学术性的写作里，意思接近“可被描绘/可被表示”。","不要和“figurative（比喻的/象征的）”混淆：figurative强调“不是字面意义”，而figurable强调“可以被画出来、形象化或表示出来”。"]}
{"word":"figurae","summary":{"en":"Figurae is a Latin plural meaning “figures/shapes,” sometimes used for “figures of speech” in rhetoric.","zh":"Figurae 是拉丁语复数，意为“形状/图像（诸形态）”，在修辞学中也可指“修辞格”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin plural) “figures; shapes; forms.” Used in academic or scientific writing when a Latin term is kept, especially in titles or descriptions.","zh":"（拉丁语复数）“形状；形态；形式；图像”。常见于学术或科学语境中保留拉丁语用法（如标题、描述）。"},"examples":[{"en":"The paper includes several figurae showing the structure of the specimen.","zh":"论文包含若干幅 figurae，用来展示标本的结构。"},{"en":"In old anatomical texts, you may see headings like “Figurae humani corporis.”","zh":"在旧的解剖学文献里，你可能会看到类似“Figurae humani corporis（人体形态图）”的标题。"}]},{"partOfSpeech":"n.","definition":{"en":"In classical rhetoric, “figurae” can refer to “figures (of speech),” i.e., rhetorical devices.","zh":"在古典修辞学中，figurae 也可指“修辞格（figures of speech）”，即各种修辞手法。"},"examples":[{"en":"The author analyzes figurae such as metaphor and irony in the poem.","zh":"作者分析了诗中的 figurae，例如隐喻和反讽。"},{"en":"Latin handbooks often list figurae to teach persuasive writing.","zh":"拉丁语修辞手册常列出 figurae 来教授如何写出更有说服力的文章。"}]}],"synonyms":["figures","forms","shapes","figures of speech","rhetorical devices"],"phonetic":"/fɪˈɡjʊriː/","extraExplanation":["“figurae”不是现代英语里常用的日常拼写；多见于保留拉丁语的学术写作。若你想表达英语“图表/人物/数字”，一般用 figures。","在拉丁语里，figura（单数）→ figurae（复数）。在引用原文、书名或章节标题时常保持这种复数形式。"]}
{"word":"figural","summary":{"en":"“Figural” means related to figures or shapes, or (in art) representational, or (in writing) involving figures of speech.","zh":"“figural”指与图形/形状有关；在艺术中指具象、可辨认的表现；在写作中指与修辞格（非字面表达）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to figures, shapes, or visual patterns; made up of lines and forms.","zh":"与图形、形状或视觉图案有关的；由线条和形状构成的。"},"examples":[{"en":"The artist used figural designs inspired by ancient pottery.","zh":"这位艺术家使用了受古代陶器启发的图形设计。"},{"en":"The rug has a figural pattern with repeated circles and triangles.","zh":"这块地毯有一种图形图案，重复出现圆形和三角形。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing people, animals, or recognizable objects (not purely abstract); representational.","zh":"描绘人物、动物或可辨认物体的（非纯抽象）；具象的。"},"examples":[{"en":"Her early work was figural, focusing on portraits.","zh":"她早期的作品是具象的，主要画肖像。"},{"en":"The museum displayed figural sculpture from the classical period.","zh":"博物馆展出了古典时期的具象雕塑。"}]},{"partOfSpeech":"adj.","definition":{"en":"In rhetoric or writing, relating to figures of speech (language used in a non-literal, imaginative way).","zh":"（修辞/写作中）与修辞格有关的；使用非字面、富于想象的表达方式的。"},"examples":[{"en":"“Time is a thief” is figural language, not a literal claim.","zh":"“时间是小偷”是修辞性的表达，并非字面陈述。"},{"en":"Poetry often relies on figural meanings to create emotion.","zh":"诗歌常依靠修辞性的含义来营造情感。"}]}],"synonyms":["representational","figurative","pictorial","non-abstract"],"phonetic":"/ˈfɪɡjərəl/","extraExplanation":["“figural”在艺术语境里常与“abstract（抽象的）”对比：figural强调“看得出是什么”（人/动物/物体）；abstract强调形与色本身，不一定指向具体对象。","在语言学习中，figural language常见搭配是“figurative language（修辞性语言）”。日常英语里更常用figurative；figural更偏学术或批评用语。","词根提示：figure（形象/图形/人物）→ figural（与形象/图形相关的）。"]}
{"word":"figurally","summary":{"en":"“Figurally” means “in a figurative, non-literal way.” It’s less common than “figuratively.”","zh":"“figurally”表示“以比喻的、非字面意义的方式”。它不如“figuratively”常用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a figurative (non-literal) way; using metaphor or symbolism rather than the exact, literal meaning.","zh":"以比喻的（非字面）方式；用隐喻或象征表达，而不是按字面意思理解。"},"examples":[{"en":"After the exam, she said her brain was “fried,” figurally, not actually.","zh":"考试后她说自己的大脑“炸了”，这里是比喻说法，并不是真的炸了。"},{"en":"The poem describes time as a river, speaking figurally to show how life keeps moving.","zh":"这首诗把时间写成一条河，这是比喻性的表达，用来说明人生不断向前。"}]}],"synonyms":["figuratively","metaphorically","symbolically","nonliterally"],"phonetic":"/ˈfɪɡjɚəli/","extraExplanation":["“figurally”在现代英语里比较少见；更常用的是“figuratively”。如果你想表达“不是字面意思”，日常写作与口语通常选“figuratively”。","容易和“literally（字面地）”对比使用：literally=按字面真实发生；figurally/figuratively=比喻地、引申地。","在阅读中看到“figurally”时，一般可直接理解为“figuratively”的同义替代。"]}
{"word":"figurant","summary":{"en":"A figurant is a background performer (an extra), usually with little or no speaking role.","zh":"figurant 指群众演员/临时演员，通常没有或只有很少台词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A background performer in a film, TV show, or theater production; an extra who appears in a crowd or small non-speaking role.","zh":"（电影/电视/戏剧中的）群众演员；临时演员（多为无台词或台词很少）"},"examples":[{"en":"She worked as a figurant in a historical drama, walking through the market scene.","zh":"她在一部古装剧里当群众演员，走过集市的那场戏。"},{"en":"The director asked the figurants to look busy and avoid staring at the camera.","zh":"导演让群众演员看起来忙一点，别盯着镜头看。"},{"en":"As a figurant, he spent most of the day waiting between takes.","zh":"作为临时演员，他一天的大部分时间都在镜头间隙等待。"}]}],"synonyms":["extra","background actor","background performer"],"phonetic":"/ˈfɪɡjɚənt/","extraExplanation":["“figurant”在英语里比较少见，多出现在欧洲语境或翻译文本中；在日常英语里更常用的是“extra”（群众演员/临时演员）或“background actor”。","词源上它与拉丁语“figure（形象/人物）”有关，强调“在画面里构成场面的人物”。在某些国家的片场用语中，“figurant”几乎就是“群众演员”的固定称呼。","用法提示：如果你在美国英语环境中说“figurant”，很多人可能不熟悉；写作或口语中用“extra / background actor”更自然。"]}
{"word":"figurante","summary":{"en":"A “figurante” is mainly a background actor (an extra), or figuratively someone present mostly for show.","zh":"“figurante”指群众演员；也可引申为只是充当陪衬、名义在场的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a background actor; an extra in a film, TV show, or stage production (not a main speaking role)","zh":"（电影、电视或舞台剧中的）群众演员；临时演员（通常不是主要台词角色）"},"examples":[{"en":"They hired dozens of figurantes to fill the café scene.","zh":"他们雇了几十名群众演员来把咖啡馆那场戏填满。"},{"en":"As a figurante, she spent hours waiting before appearing for a few seconds on camera.","zh":"作为群众演员，她等了好几个小时，结果镜头里只出现了几秒。"}]},{"partOfSpeech":"n.","definition":{"en":"someone included mainly for appearance, presence, or symbolism rather than real influence (figurative use)","zh":"（引申）主要是充当“摆设/陪衬”的人；名义上在场但影响不大的人"},"examples":[{"en":"In the meeting, he felt like a figurante with no real say in the decision.","zh":"在会议上，他感觉自己像个陪衬，对决定没有真正的发言权。"},{"en":"The committee added her as a figurante to look more inclusive.","zh":"委员会把她加进来更多是为了看起来更包容，像个“摆设”。"}]}],"synonyms":["extra","background actor","supernumerary","bit player"],"phonetic":"/ˌfɪɡjəˈrɑn.teɪ/","extraExplanation":["“figurante”常见于意大利语/西班牙语语境，英语里更常说 extra 或 background actor；在英语写作中直接用 figurante 会显得较为“外来词”或较正式/文艺。","在影视行业里，extra 通常指没有台词或台词很少的背景人物；若有较明确的小台词角色，英语更常用 supporting actor / bit part（小角色）。"]}
{"word":"figurants","summary":{"en":"Figurants are extras or minor background figures in performances, and sometimes small secondary figures in visual art.","zh":"Figurants 指演出中的群众演员／背景演员，也可指视觉艺术作品中的次要人物形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who appear in a performance (film, theater, opera, or ballet) in a non-speaking or minor role; extras or background performers.","zh":"（电影、戏剧、歌剧或芭蕾中）没有台词或戏份很少的演员；群众演员／背景演员。"},"examples":[{"en":"The director hired dozens of figurants to fill the street scene.","zh":"导演雇了几十个群众演员来把街景拍得更热闹。"},{"en":"In the opera, the figurants helped create the feeling of a busy market.","zh":"在歌剧里，群众演员营造出了热闹集市的氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"Small or secondary human figures included in a painting, drawing, or stage picture mainly to add life, scale, or atmosphere.","zh":"（绘画、素描或舞台画面中）用来增加生气、比例感或氛围的次要人物形象／小人物。"},"examples":[{"en":"The landscape looks larger because the artist added tiny figurants near the river.","zh":"画家在河边加了几个小人物，使风景显得更宏大。"},{"en":"The scene is full of figurants that guide your eye toward the main character.","zh":"画面里有许多次要人物形象，引导视线回到主角身上。"}]}],"synonyms":["extras","background actors","supernumeraries","walk-ons","supporting figures"],"phonetic":"/ˈfɪɡjərən(t)s/","extraExplanation":["“figurant”常见于法语语境（源自法语），在英语里较少见；更常用的说法是 film/theater “extra(s)” 或 “background actor(s)”。","在芭蕾或歌剧评论中，“figurants”有时特指“只走位、站位、做动作但不跳主要舞段/不演主要戏份的人”，强调其“衬托与填充画面”的功能。"]}
{"word":"figurate","summary":{"en":"“Figurate” is a rare word meaning “to shape/represent” or “decorated with figures,” but modern English usually uses “depict/represent” or “figured/patterned.”","zh":"“figurate”较少见，可指“塑造/表现”或“带图形装饰的”，现代英语更常用“depict/represent”或“figured/patterned”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Less common) to form, represent, or shape something; to give something a particular form (often used in passive forms like “is figurated”).","zh":"（较少见）形成、表现或塑造某物；使某物呈现特定形态（常见于被动用法，如“is figurated”）。"},"examples":[{"en":"The pattern is figurated as a spiral in the center of the cloth.","zh":"这个图案在布料中央被塑造成一个螺旋形。"},{"en":"In some older texts, virtues are figurated as women holding symbols.","zh":"在一些较早的文本中，美德被描绘成手持象征物的女性形象。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) decorated with figures or images; having a design made of shapes or pictures (more common words: “patterned,” “figured”).","zh":"（罕见）饰有图形或图像的；带有由形状或图画构成的花纹的（更常用：patterned / figured）。"},"examples":[{"en":"He wore a figurate robe with birds woven into the fabric.","zh":"他穿着一件织有鸟纹图案的花袍。"}]}],"synonyms":["depict","represent","portray","shape","form","figure","pattern"],"phonetic":"/ˈfɪɡjəˌreɪt/","extraExplanation":["“figurate”在现代英语里不常用，更常见的是：\n- 动词用“depict / represent / portray / form”（描绘/代表/塑造）\n- 形容词用“figured / patterned”（有花纹的）\n\n另外请注意它与“figurative”（比喻的、非字面意义的）不同：\n- figurative language = 比喻性语言（如隐喻、拟人）\n- a figured/ patterned shirt = 有花纹的衬衫"]}
{"word":"figurately","summary":{"en":"“Figurately” means “in a figurative (non-literal) way.” The more common form is “figuratively.”","zh":"“figurately”表示“以比喻/非字面的方式”。更常用、更标准的形式是“figuratively”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a non-literal way; using images, comparisons, or exaggeration to express an idea (not meant to be taken as exact fact).","zh":"以比喻（非字面）的方式；用形象化的比较或夸张来表达意思（不按字面理解）。"},"examples":[{"en":"When she said she was “drowning in work,” she meant it figuratively.","zh":"她说自己“被工作淹没了”，是比喻说法。"},{"en":"He figuratively opened the door to new opportunities for the team.","zh":"他可以说是“为团队打开了新机会之门”（比喻）。"}]}],"synonyms":["figuratively","metaphorically","symbolically","nonliterally"],"phonetic":"/ˈfɪɡjɚətɪvli/","extraExplanation":["“figuratively”常与“literally”对比使用：literally表示“按字面、真实发生”；figuratively表示“比喻地、象征地”。学习时可用一个小测试：如果按字面理解会显得荒谬或不可能，多半就是figuratively。","在口语里人们有时会把literally用作强调词（例如“I literally died laughing”），但严格意义上这句话应当是figuratively，因为并没有真的“笑死”。"]}
{"word":"figuration","summary":{"en":"Figuration means forming a shape or structure, or a representational style/pattern (especially in art); more rarely, it can mean figurative imagery in language.","zh":"Figuration 指形成某种形状或结构的过程/方式；也常指（尤其在艺术中）具象表现或图案；较少情况下指语言中的比喻性描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of forming something into a particular shape or structure; the way something is shaped or arranged","zh":"形成某种形状或结构的过程；形状、构造或布局方式"},"examples":[{"en":"The figuration of the statue took months of careful work.","zh":"这座雕像的塑形过程花了数月的精细工作。"},{"en":"The building’s figuration is simple, but it feels balanced and calm.","zh":"这栋建筑的构造很简洁，但给人一种平衡、宁静的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"a representation or pattern, especially in art or design (often contrasted with abstract work)","zh":"（尤指艺术或设计中的）具象表现或图案（常与抽象相对）"},"examples":[{"en":"Her paintings mix figuration and abstraction in the same scene.","zh":"她的绘画在同一画面中融合了具象与抽象。"},{"en":"The mural uses human figuration to tell a local story.","zh":"这幅壁画用人物的具象描绘来讲述一个本地故事。"}]},{"partOfSpeech":"n.","definition":{"en":"figurative expression or imagery in language; the use of figures of speech (rare in everyday English)","zh":"（语言中的）比喻性表达或形象化描写；修辞格的使用（较少用于日常英语）"},"examples":[{"en":"In the poem, the figuration makes ordinary feelings sound dramatic.","zh":"在这首诗中，修辞性的描写让普通情感听起来更有张力。"}]}],"synonyms":["formation","shaping","configuration","representation","depiction"],"phonetic":"/ˌfɪɡjəˈreɪʃən/","extraExplanation":["“figuration”在艺术评论里很常见，常指“具象绘画/具象表现”（与“abstraction 抽象”相对）。比如会看到“a return to figuration”（回归具象）的说法。","词源上与“figure（形状；人物形象；图形）”同源，所以它既可指“成形/构形的过程”，也可指“呈现出来的形象或形式”。"]}
{"word":"figurational","summary":{"en":"Figurational means “representing recognizable real-world forms,” especially in art (not abstract).","zh":"Figurational 指“具象的”，尤用于艺术中：呈现可辨认的现实形象（非抽象）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in art) Representing real, recognizable people, animals, or objects (not purely abstract).","zh":"（尤指艺术中）具象的；描绘真实可辨认的人、动物或物体的（非纯抽象）。"},"examples":[{"en":"The museum has a gallery for figurational painting, including portraits and landscapes.","zh":"这家博物馆有一个具象绘画展厅，包括肖像画和风景画。"},{"en":"Her style is mostly figurational, so you can clearly see the human body in her work.","zh":"她的风格主要是具象的，所以在作品中能清楚看到人体形象。"},{"en":"Some artists move from figurational art to abstract art over time.","zh":"有些艺术家会随着时间从具象艺术转向抽象艺术。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the use of visual figures or forms to communicate an idea (often in a symbolic or narrative way).","zh":"与用形象/造型来表达观念有关的（常带象征或叙事意味）。"},"examples":[{"en":"The figurational elements in the mural tell the story of the city’s history.","zh":"壁画中的具象元素讲述了这座城市的历史。"},{"en":"Even with modern colors, the work keeps a strong figurational structure.","zh":"即使用了现代色彩，这件作品仍保持了很强的具象结构。"}]}],"synonyms":["representational","realistic","non-abstract","literal (in art context)"],"phonetic":"/ˌfɪɡjəˈreɪʃənəl/","extraExplanation":["“figurational”常用于艺术评论，强调“具象/可辨认的形象”。不要和“figurative（比喻的）”混淆：figurative 多用于语言（比如修辞、隐喻），而 figurational 多用于视觉艺术（绘画、雕塑等）。"]}
{"word":"figurations","summary":{"en":"“Figurations” means multiple representations or forms—especially how something is shaped or portrayed in art, literature, theory, or (specialized) music patterns.","zh":"“Figurations”指多种“呈现/构形方式”或“表现形式”，常见于艺术、文学、理论语境；在专业音乐语境中也可指音型/装饰性音型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) ways of representing something in a particular shape, image, or pattern; portrayals or forms (often in art, literature, or theory).","zh":"（复数）对某物的呈现方式；某种形状、意象或结构形式（常用于艺术、文学或理论语境）。"},"examples":[{"en":"Different figurations of the hero appear across the novel—sometimes brave, sometimes broken.","zh":"小说中英雄有多种“呈现形式”——有时勇敢，有时脆弱。"},{"en":"The exhibition explores figurations of the body in modern painting.","zh":"该展览探讨现代绘画中人体的多种表现形式。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) figurative expressions or rhetorical “figures” used in language.","zh":"（较少见）语言中的修辞性表达；修辞格。"},"examples":[{"en":"The poet’s figurations turn ordinary weather into a symbol of grief.","zh":"诗人的修辞化表达把普通的天气写成了悲伤的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(Specialized) musical or artistic patterns created by arranging elements into a coherent design.","zh":"（专业用法）通过组织元素形成的音乐/艺术型态与结构模式。"},"examples":[{"en":"In Baroque music, repeated figurations can create a sense of forward motion.","zh":"在巴洛克音乐中，反复的音型（figurations）能带来推进感。"}]}],"synonyms":["representations","depictions","portrayals","forms","images","configurations","constructions"],"phonetic":"/ˌfɪɡjəˈreɪʃənz/","extraExplanation":["“figurations”是名词“figuration”的复数形式。日常英语里更常用的近义词通常是 representations（呈现/表征）、depictions（描绘）、forms（形式）、images（意象）。","在艺术史、文学评论、社会理论等学术语境中，“figuration(s)”较常见，强调“如何被构成/被呈现的方式”，而不只是“画了什么/说了什么”。","在音乐语境里，figuration 常译为“音型/装饰性音型”，指用分解和装饰形成的可辨识模式。"]}
{"word":"figurative","summary":{"en":"Figurative means non-literal, often using metaphor or symbolism; it can also mean not physically exact, used in a broad/approximate sense.","zh":"Figurative 指“比喻的、非字面意义的”（常用隐喻/象征）；也可指“非精确、泛指的”表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using words in an imaginative, non-literal way (often as a metaphor or symbol) to create a picture or express an idea.","zh":"（语言）比喻的；象征的；非字面意义的（常用隐喻或象征来表达想法或制造画面感）。"},"examples":[{"en":"When she said “I’m drowning in work,” she was speaking figuratively.","zh":"她说“我被工作淹没了”，是在用比喻的说法。"},{"en":"The poem uses figurative language to describe time as a thief.","zh":"这首诗用比喻性语言把时间写成小偷。"},{"en":"Don’t take his comment literally—it was meant figuratively.","zh":"别按字面理解他的话——那是比喻的意思。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not physically real or exact; describing something in a broad or approximate sense.","zh":"非真实或非精确的；泛指的；大概意义上的（不一定指实际发生或具体数字）。"},"examples":[{"en":"There were figurative walls between the two friends after the argument.","zh":"争吵后，两位朋友之间仿佛有道“无形的墙”。"},{"en":"He gave a figurative “ten out of ten” to show how much he loved it.","zh":"他给了一个“满分十分”的夸张说法来表达有多喜欢。"}]}],"synonyms":["nonliteral","metaphorical","symbolic","imagined"],"phonetic":"/ˈfɪɡjɚətɪv/","extraExplanation":["“figurative”常与“literal（字面的）”成对出现：literal强调按词面意思理解；figurative强调借助隐喻、拟人、夸张等修辞表达更深层的含义。","常见搭配：figurative language（比喻性语言/修辞性语言）、figurative meaning（比喻义）、speak figuratively（打个比方说）。","写作与文学中常见：例如莎士比亚常用隐喻与象征（figurative language）来强化情感与主题。"]}
{"word":"figurative language","summary":{"en":"non-literal, image-based expression using figures of speech","zh":"使用修辞手法的非字面表达，强调形象与意境"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Language that uses figures of speech (such as metaphor, simile, or personification) to create a vivid, imaginative, or non-literal meaning.","zh":"用比喻、拟人、夸张等修辞手法来表达的语言，意思通常不按字面理解，更形象、更有画面感。"},"examples":[{"en":"The poem is full of figurative language, like “time is a thief.”","zh":"这首诗充满了修辞性的表达，比如“时间是个小偷”。"},{"en":"When she said “I’m drowning in work,” she was using figurative language.","zh":"她说“我快被工作淹没了”，这是在用非字面意义的说法。"},{"en":"Teachers often ask students to identify figurative language in a story.","zh":"老师经常让学生在故事里找出修辞性的表达。"}]}],"synonyms":["nonliteral language","figurative speech","rhetorical language","imagery","figure of speech"],"phonetic":"/ˈfɪɡjərətɪv ˈlæŋɡwɪdʒ/","extraExplanation":["常见类型：metaphor（隐喻：A is B）、simile（明喻：like/as）、personification（拟人）、hyperbole（夸张）、idiom（习语）。","学习技巧：遇到“字面上不可能/不合理”的句子时，先问自己：作者想传达的感觉或强调点是什么？","在文学和演讲中很常见，用来增强画面感、情绪和说服力；但在说明书、法律文本等场景里通常更偏向 literal language（字面/直白语言）。"],"etymology":"源自拉丁语传统修辞学：figure of speech（修辞格）里的 figure 指“表达方式/形式”，不是“数字”。后来形成常用术语 figurative language，用来概括各种非字面表达。","mnemonic":["把 figurative 想成“有图（figure）有画”：不是直说，而是用“画面”来表达。","联想“修辞=让语言变漂亮”：figurative language 让句子更生动、更有感染力。"]}
{"word":"figuratively","summary":{"en":"“Figuratively” means “not literally; in a metaphorical way.”","zh":"“Figuratively”表示“不是字面意思；以比喻方式（修辞性）表达”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a non-literal way; using figures of speech (like metaphor or exaggeration) to express an idea.","zh":"以比喻（非字面）的方式；用修辞（如隐喻、夸张）来表达意思。"},"examples":[{"en":"When she said, “I’m drowning in work,” she meant it figuratively, not literally.","zh":"她说“我快被工作淹没了”是比喻说法，不是字面意思。"},{"en":"He figuratively slammed the door on their idea by refusing to discuss it.","zh":"他拒绝讨论他们的想法，相当于“比喻性地把门关上”。"},{"en":"The city never sleeps—at least, figuratively.","zh":"这座城市从不睡觉——至少是比喻意义上。"}]}],"synonyms":["metaphorically","symbolically","nonliterally"],"phonetic":"/ˈfɪɡjɚətɪvli/","extraExplanation":["“figuratively”常用来提醒听者/读者：接下来或刚才的话不是字面意思（literal），而是借助隐喻、夸张等方式传达情绪或强调重点。","常见搭配：mean/speak figuratively（意思是比喻地说）、not literally but figuratively（不是字面而是比喻）。在口语里也常与“literally”对比使用。"]}
{"word":"figurativeness","summary":{"en":"Figurativeness means the quality or degree of using figurative (non-literal, image-based) language.","zh":"Figurativeness 指语言或表达的比喻性/形象化程度，即偏向非字面、富含意象的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being figurative—using images, comparisons, or non-literal language (like metaphor or symbolism) to express meaning.","zh":"比喻性；形象化表达的特质——用意象、类比或非字面语言（如隐喻、象征）来传达意思。"},"examples":[{"en":"The poem’s figurativeness makes its emotions feel vivid and alive.","zh":"这首诗的比喻性让情感显得生动鲜活。"},{"en":"In academic writing, too much figurativeness can make your argument unclear.","zh":"在学术写作中，比喻性太强可能会让论证不够清晰。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The degree to which a statement, artwork, or expression is non-literal rather than straightforward.","zh":"（较少见）非直白程度；一句话、艺术作品或表达方式偏向非字面/不直接的程度。"},"examples":[{"en":"We discussed the figurativeness of the headline and what it implied.","zh":"我们讨论了标题的非直白程度以及它暗示的意思。"},{"en":"The teacher asked students to rate the figurativeness of each sentence.","zh":"老师让学生给每个句子的非直白程度打分。"}]}],"synonyms":["figurative language","non-literalness","metaphoricity","symbolism"],"phonetic":"/ˈfɪɡjərətɪvnəs/","extraExplanation":["“figurativeness”来自形容词“figurative（比喻的）”，常用于文学、修辞学、语言学和写作讨论中，强调表达是否依赖意象与隐含意义。","学习提示：它和“imagery（意象）”“metaphor（隐喻）”“symbolism（象征）”常一起出现；与“literalness（字面/直白）”相对。"]}
{"word":"figurato","summary":{"en":"“Figurato” is an Italian conversational response meaning “you’re welcome / don’t mention it,” and sometimes “as if / imagine that” when modestly rejecting praise.","zh":"“Figurato”是意大利语口语回应，常表示“不客气/别客气”，也可在谦虚或反驳称赞时表示“哪有/别这么说”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Italian, used in conversation) “You’re welcome,” “Don’t mention it,” or “No problem,” said in response to thanks.","zh":"（意大利语口语）“不客气 / 别客气 / 没事儿”，用于回应别人的感谢。"},"examples":[{"en":"“Grazie!” “Figurato!”","zh":"“谢谢！”“不客气！”"},{"en":"Thanks for helping me move. — Figurato, it was nothing.","zh":"谢谢你帮我搬家。——别客气，小事一桩。"}]},{"partOfSpeech":"int.","definition":{"en":"(Less common in English; from Italian) “Imagine that!” / “As if!” used to downplay a compliment or deny something politely.","zh":"（在英语语境中较少见；源自意大利语）“哪有啊！/ 别这么说！”用于谦虚地否认称赞或淡化说法。"},"examples":[{"en":"You’re so talented. — Figurato! I’m still learning.","zh":"你太有才了。——哪有啊！我还在学呢。"}]}],"synonyms":["you’re welcome","no problem","don’t mention it","it was nothing"],"phonetic":"/ˌfiɡuˈrɑtoʊ/","extraExplanation":["“Figurato”来自意大利语动词 figurare（呈现、显得；想象、设想）的过去分词。口语里常省略更完整的说法（类似“Ma figurati!”），语气通常友好随意。","在意大利语中更常见的回应感谢表达还有：“Prego”（不客气/请）、“Di niente”（没什么）、“Non c’è di che”（不必谢）。"]}
{"word":"figure","summary":{"en":"Figure can mean a number or diagram, a body shape, an important person, a statistical amount, or (as a verb) to think/calculate—often in the phrase “figure out.”","zh":"Figure 可指数字或图示、身材、重要人物、统计数值，也可作动词表示思考/计算，常见搭配是“figure out（弄明白/想出）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A number, shape, or symbol; also a picture, diagram, or illustration used to show information.","zh":"数字、图形或符号；也指用于展示信息的图片、图表或插图。"},"examples":[{"en":"The figure 8 looks like two circles stacked.","zh":"数字 8 看起来像两个圆上下叠在一起。"},{"en":"Look at Figure 2 on the next page.","zh":"请看下一页的图 2。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s body shape, especially in a general or attractive way.","zh":"（尤指整体或美观意义上的）身材、体态。"},"examples":[{"en":"She has a tall, athletic figure.","zh":"她身材高挑、很健美。"},{"en":"Regular exercise can help you maintain your figure.","zh":"规律运动可以帮助你保持身材。"}]},{"partOfSpeech":"n.","definition":{"en":"An important or famous person in society or history.","zh":"重要人物；（社会或历史上的）知名人物。"},"examples":[{"en":"Martin Luther King Jr. is a major figure in American history.","zh":"马丁·路德·金是美国历史上的重要人物。"},{"en":"She became a leading figure in the movement.","zh":"她成为这场运动的领军人物。"}]},{"partOfSpeech":"n.","definition":{"en":"A number that represents an amount, especially in money or statistics.","zh":"（尤指金额或统计中的）数目、数字。"},"examples":[{"en":"Sales figures increased this year.","zh":"今年的销售数据增加了。"},{"en":"The final figure was higher than expected.","zh":"最终数字比预期更高。"}]},{"partOfSpeech":"v.","definition":{"en":"To think or decide something after considering; to calculate.","zh":"经过思考后认为/判断；计算。"},"examples":[{"en":"I figured (that) you might be tired after work.","zh":"我猜想你下班后可能会累。"},{"en":"Can you figure out the answer?","zh":"你能算出/想出答案吗？"}]}],"synonyms":["number","diagram","illustration","shape","body","person","statistic","amount","calculate","work out","understand"],"phonetic":"/ˈfɪɡjɚ/","extraExplanation":["在美式英语里，口语中 figure 常常表示“理解/想出/弄明白”，最常见的搭配是 figure out（= understand/solve）。例如：I can't figure out how to use this app.（我搞不懂怎么用这个应用。）","在学术写作中，Figure 常用作“图（图表/插图）”的编号标题，如 Figure 1, Figure 2；与 Table（表格）区分。"]}
{"word":"figure ... in","summary":{"en":"include or take into account as part of a plan, calculation, or decision","zh":"纳入其中；计入；作为因素考虑"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to include someone or something in a plan, activity, group, or decision","zh":"把某人或某事纳入计划、活动、群体或决定之中"},"examples":[{"en":"We’re having dinner at 7—can we figure you in?","zh":"我们7点吃晚饭——能把你也算上吗？"},{"en":"Please figure me in on the meeting tomorrow.","zh":"请把我也算进明天的会议里。"}]},{"partOfSpeech":"phrase","definition":{"en":"to include something in a calculation (especially money, time, or cost)","zh":"（尤指钱、时间或成本）把某项计入计算"},"examples":[{"en":"Don’t forget to figure in taxes when you compare prices.","zh":"比较价格时别忘了把税算进去。"},{"en":"If you figure in travel time, the trip takes almost six hours.","zh":"如果把路上时间算进去，这趟行程将近六小时。"}]},{"partOfSpeech":"phrase","definition":{"en":"to consider something as an important factor when deciding","zh":"把某事作为重要因素加以考虑"},"examples":[{"en":"Her experience should be figured in when we choose a team leader.","zh":"我们选组长时应该把她的经验考虑进去。"},{"en":"Safety figures in heavily in our final decision.","zh":"安全在我们最终决定中占很大比重。"}]}],"synonyms":["include","count in","factor in","take into account","allow for","consider","incorporate"],"phonetic":"/ˈfɪɡjɚ ɪn/","extraExplanation":["常见结构：figure + 名词/代词 + in（把某人某物算进去）；figure in + 名词（把某项计入）。例如：figure you in；figure in the cost。","与“figure out（弄明白）”不同：figure out = 理解/解决；figure in = 纳入/计入/考虑。"],"etymology":"“figure”原义与“数字/形状”相关，后来引申出“计算、估算”。“figure … in”里的“in”表示“纳入其中”，合起来就是“算进去/考虑进去”。","mnemonic":["把“figure”记成“算数/算账”，把“in”记成“在里面” → “算到里面去”。","联想中文“把XX也算上/算进去”，英语就常用 figure … in。"]}
{"word":"figure ... out","summary":{"en":"understand, solve, discover, or calculate by thinking","zh":"通过思考来弄明白、解决、查明或计算"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To understand something or find the answer after thinking about it.","zh":"（经过思考后）弄明白；想出答案。"},"examples":[{"en":"I can’t figure out how to use this app.","zh":"我弄不明白这个应用怎么用。"},{"en":"Give me a minute—I’m trying to figure it out.","zh":"给我一分钟——我在努力搞明白。"},{"en":"She finally figured out why the computer kept freezing.","zh":"她终于弄清楚电脑为什么总是卡住。"}]},{"partOfSpeech":"phrase","definition":{"en":"To solve a problem or deal with a situation successfully.","zh":"解决（问题）；想办法处理（局面）。"},"examples":[{"en":"We’ll figure out a plan for the weekend.","zh":"我们会想出周末的计划。"},{"en":"Don’t worry—we’ll figure it out together.","zh":"别担心——我们一起想办法解决。"}]},{"partOfSpeech":"phrase","definition":{"en":"To discover the truth about something, often something hidden.","zh":"查明；看穿；发现真相。"},"examples":[{"en":"He figured out that the email was a scam.","zh":"他发现那封邮件是诈骗。"},{"en":"The police figured out who started the fire.","zh":"警方查明了是谁引发了火灾。"}]},{"partOfSpeech":"phrase","definition":{"en":"To calculate an amount (often money, time, or numbers).","zh":"计算（数量、金额、时间等）。"},"examples":[{"en":"Can you figure out the total cost including tax?","zh":"你能算一下含税总价吗？"},{"en":"I figured out how long the trip would take.","zh":"我算出了这趟旅行要花多久。"}]}],"synonyms":["work out","solve","understand","find out","determine","discover","calculate","make sense of"],"phonetic":"/ˈfɪɡjɚ aʊt/","extraExplanation":["可分离短语动词：名词作宾语时可放中间或后面（figure the answer out / figure out the answer）；代词必须放中间（figure it out，不说 figure out it）。","口语里非常常用：有时只是表达“我来想办法/我来处理”，并不一定真的在做数学计算。"],"etymology":"来自 figure（源于拉丁语 figura“形状、形象”），后来引申出“用头脑描绘/推理”的意思；与 out 结合形成短语动词，表示“推出来、弄清楚”。","mnemonic":["把它想成“把答案从脑子里‘想（figure）出来（out）’”。","联想中文“想出来/弄出来”：out=出来，figure=动脑想。"]}
{"word":"figure as","summary":{"en":"to be regarded or included as something","zh":"被视为；算作；被纳入"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to be considered as; to count as something (in a particular role or category)","zh":"被认为是；算作（某种身份/类别）"},"examples":[{"en":"Does volunteer work figure as job experience on your résumé?","zh":"志愿者工作在你的简历里算作工作经验吗？"},{"en":"In some countries, a handshake may figure as a formal agreement.","zh":"在一些国家，握手可能被视为一种正式协议。"}]},{"partOfSpeech":"phrase","definition":{"en":"to appear or be included as a part of something (such as a plan, story, or discussion)","zh":"作为一部分出现；被纳入（计划/故事/讨论等）"},"examples":[{"en":"He figured as a key witness in the trial.","zh":"他在审判中作为关键证人出现。"},{"en":"Environmental costs should figure as part of the final price.","zh":"环境成本应该被纳入最终价格的一部分。"}]}],"synonyms":["count as","be considered as","qualify as","be regarded as","be seen as","rank as","serve as","appear as"],"phonetic":"/ˈfɪɡjər æz/","etymology":"源自英语动词 figure（“描绘、呈现；计算；认为”），最早与拉丁语 figura（“形状、形态”）相关。短语 figure as 中的 as 表示“作为/以……身份”，合起来就是“算作/被当作”。","mnemonic":["把 as 理解成“作为”。figure as ≈ “把……当作一个 figure（角色/身份）”。","联想中文“算作”：figure（有“计算/认为”的意思）+ as（作为）→“算作/视为”。"]}
{"word":"figure in","summary":{"en":"be included or considered; appear as a factor","zh":"被纳入/被考虑；作为因素出现"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to be included as part of a group, plan, or calculation; to be taken into account","zh":"被包含在……之中；被纳入考虑/计算"},"examples":[{"en":"Delivery costs are figured in, so the final price won’t change.","zh":"运费已被计入，所以最终价格不会变。"},{"en":"Make sure taxes are figured in before you set the budget.","zh":"在制定预算前，务必把税费考虑进去。"},{"en":"Her experience was figured in when they chose the team leader.","zh":"他们选组长时把她的经验考虑进去了。"}]},{"partOfSpeech":"phrase","definition":{"en":"to appear in something (a story, discussion, report, or situation), often as an important element","zh":"在……中出现（常指作为重要因素/角色）"},"examples":[{"en":"The new policy figures in the report as a major turning point.","zh":"这项新政策在报告中被提到，作为一个重大转折点。"},{"en":"Luck figured in their success more than they wanted to admit.","zh":"运气在他们的成功中起的作用比他们愿意承认的更大。"}]}],"synonyms":["include","count in","take into account","factor in","consider","feature","appear","play a part"],"phonetic":"/ˈfɪɡjɚ ɪn/","extraExplanation":["与 figure out（“弄明白/解决”）不同，figure in 强调“把某因素算进去/考虑进去”或“在某事中出现并起作用”。","常见结构：figure A in / figure in A（A 为成本、时间、风险等）；被动更常用：A is figured in（A 被计入/被考虑）。"],"etymology":"源自 figure（“图形/形象”→“描绘、出现；计算”）+ in（“在其中”）。因此 figure in 发展出“被算进去/被纳入其中”“在……中出现并起作用”的含义。","mnemonic":["把它拆开记：figure（“算、计算”）+ in（“算在里面”）= “算进去/考虑进去”。","联想中文“把……算进来/把……包括在内”，就是 figure in 的核心感觉。"]}
{"word":"figure in ...","summary":{"en":"to be included or considered as part of something; to play a role","zh":"被纳入考虑/计算之中；在某事中出现并起作用"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to be included as part of a plan, list, decision, or calculation","zh":"被算在内；被纳入计划/名单/决定/计算之中"},"examples":[{"en":"Your travel time should figure in the schedule.","zh":"你的路程时间应该算进日程安排里。"},{"en":"Cost will figure in our final decision.","zh":"成本会被纳入我们最终的决定。"}]},{"partOfSpeech":"phrase","definition":{"en":"to appear in a story, situation, or discussion; to play a role","zh":"出现在（故事/情况/讨论中）；起作用；扮演角色"},"examples":[{"en":"The old village still figures in local legends.","zh":"那个老村庄仍然出现在当地传说里。"},{"en":"Her family figures in her new novel.","zh":"她的家人在她的新小说中占有一席之地（有出现/有影响）。"}]}],"synonyms":["include","factor in","take into account","count","consider","enter into","play a role","appear"],"phonetic":"/ˈfɪɡjɚ ɪn/","extraExplanation":["常见搭配：figure in + 名词（因素/成本/时间等）；或用被动：be figured in（被计入）。","近义辨析：figure in 强调“算进去、纳入考虑（像做决定时把它当作一个因素）”；而 “show up/appear” 更偏“出现”。"],"etymology":"“figure”源自拉丁语“figura”（形状、形象），后来引申为“数字/计算”。“figure in”最早常带“把某因素计入计算”的意思，进而扩展为“纳入考虑/包含在内”。","mnemonic":["把 figure 想成“数字/算账”：figure in = “算进去”。","联想“做决定时要把某因素放进公式里”：把它“in（放进去）”。"]}
{"word":"figure of speech","summary":{"en":"A “figure of speech” is a non-literal expression used for effect (like a metaphor). It can also mean skillful rhetorical style in speaking or writing.","zh":"“figure of speech”指为表达效果而使用的非字面说法（如隐喻），也可指演讲或写作中的修辞表达技巧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word or phrase used in a non-literal, imaginative way to create a special effect or meaning (for example, metaphor, simile, or personification).","zh":"（修辞）用非字面、带想象力的方式使用词语或短语，以产生特定效果或意义（如隐喻、明喻、拟人等）。"},"examples":[{"en":"Calling a busy city “a beehive” is a figure of speech.","zh":"把繁忙的城市称为“蜂巢”是一种修辞说法。"},{"en":"In poetry, figures of speech often make images feel more vivid.","zh":"在诗歌中，修辞手法常常让画面更生动。"},{"en":"Don’t take that figure of speech literally—it’s just a way to express an idea.","zh":"别把那句修辞说法当真——那只是表达观点的一种方式。"}]},{"partOfSpeech":"n.","definition":{"en":"In public speaking and writing, the style or skill of expressing ideas effectively (rhetoric).","zh":"（较正式）在演讲或写作中，有效表达思想的表达方式或技巧（修辞/雄辩术）。"},"examples":[{"en":"His figure of speech made the speech sound confident and persuasive.","zh":"他的措辞与表达技巧让演讲听起来自信且有说服力。"},{"en":"Good figure of speech can help an argument feel clearer and more engaging.","zh":"良好的表达与修辞能让论点更清晰、更吸引人。"}]}],"synonyms":["rhetorical device","figurative expression","trope","rhetoric"],"phonetic":"/ˈfɪɡjɚ əv spiːtʃ/","extraExplanation":["“figure of speech”是集合名词，常用单数来指某一种修辞（a figure of speech），也常用复数指多种修辞（figures of speech）。","常见类型包括：metaphor（隐喻）、simile（明喻，常用like/as）、personification（拟人）、hyperbole（夸张）、irony（反讽）、idiom（习语；也可算一种非字面表达）。","文学里常见例子：莎士比亚《皆大欢喜》中“All the world’s a stage”（整个世界是个舞台）是经典隐喻，常被用来说明figure of speech。"]}
{"word":"figure on","summary":{"en":"to expect, rely on, or include something in planning","zh":"预计/指望；把……考虑在计划中"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to expect or plan that something will happen; to count on something","zh":"预计/打算某事会发生；指望/依靠某事"},"examples":[{"en":"We’re figuring on about 30 people coming to the party.","zh":"我们预计大概会有30个人来参加派对。"},{"en":"Don’t figure on me to drive you home—I might have to leave early.","zh":"别指望我开车送你回家——我可能得早走。"}]},{"partOfSpeech":"phrase","definition":{"en":"to think about something carefully in order to decide or solve a problem; to take something into account","zh":"仔细考虑以便做决定/解决问题；把……考虑在内"},"examples":[{"en":"You should figure on the extra cost of parking when you plan your trip.","zh":"你计划旅行时要把额外的停车费考虑进去。"},{"en":"Give me a minute to figure on what to do next.","zh":"给我一分钟想想下一步该怎么办。"}]}],"synonyms":["count on","bank on","rely on","expect","anticipate","allow for","take into account","factor in"],"phonetic":"ˈfɪɡjɚ ɑn","extraExplanation":["常见搭配：figure on + 名词/动名词（figure on rain, figure on spending $50）。","和“figure out”不同：figure out 强调“弄明白/解决”；figure on 强调“预计/指望/把……算进去”。","语气多用于口语与日常写作，在美式英语中很常见。"],"etymology":"源自动词“figure”（原指“数字、形状”，后引申为“用数字计算/推断”）+ 介词“on”（表示“基于/依靠/指向”）。合起来逐渐固定为口语表达，含“把……作为依据来预期或考虑”。","mnemonic":["把 on 理解成“压在……上/靠在……上”：figure on = “把判断/计划压在某件事上”→“指望/预计”。","联想“算账”：figure（算）+ on（算在……上）→“把某项成本/情况算进去”。"]}
{"word":"figure on sth.","summary":{"en":"to plan for or expect something; to rely on someone or something","zh":"预计/计划把某事算进去；指望/依靠某人或某事"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to think about something carefully; to expect or plan for something","zh":"仔细考虑某事；预计/打算把某事算进去"},"examples":[{"en":"I’m figuring on staying in Beijing for two more weeks.","zh":"我打算在北京再待两周。"},{"en":"We’re figuring on about 20 people coming to the party.","zh":"我们预计大约会有20个人来参加派对。"},{"en":"Figure on it taking longer during rush hour.","zh":"要把高峰期会更久这件事考虑进去。"}]},{"partOfSpeech":"phrase","definition":{"en":"to rely on someone or something; to count on someone or something","zh":"依靠/指望某人或某事；相信某人或某事会发生"},"examples":[{"en":"You can figure on me to keep your secret.","zh":"你可以指望我替你保守秘密。"},{"en":"Don’t figure on the weather staying sunny all day.","zh":"别指望天气会一整天都晴。"}]}],"synonyms":["count on","rely on","depend on","expect","anticipate","plan on","bank on"],"phonetic":"/ˈfɪɡjɚ ɑn/","extraExplanation":["用法提示：figure on sth 常表示“把……算在内/预计……”，语气比 count on 更偏“估算、计划”。如果后面接人（figure on sb），常更接近“指望/依靠”。","常见结构：figure on + 名词/代词；figure on + -ing（如 figuring on staying）；也可用于祈使句表示提醒：Figure on delays.（要预料会耽搁。）"],"etymology":"“figure”原意与“形状、图形、数字”有关，后来引申出“计算、推断”。“figure on”里带有“算进去、预计”的意思，进一步发展出“指望、依赖”。","mnemonic":["把 figure 想成“算数的数字（figure）”，figure on = “把它算上/算进去”。","联想：on 有“在……上面”的感觉 → 把某事“放在计划上/考虑上”，就是预计、指望。"]}
{"word":"figure out","summary":{"en":"“Figure out” means to understand, solve, discover, or decide something after thinking or working on it.","zh":"“figure out”指通过思考/尝试后弄明白、解决、查明或做出决定。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to understand something after thinking about it; to solve a problem or find an answer","zh":"（经过思考后）弄明白；想出办法；解决（问题）"},"examples":[{"en":"I can’t figure out how to use this app.","zh":"我弄不明白怎么用这个应用。"},{"en":"We need to figure out a way to save money.","zh":"我们得想出一个省钱的办法。"},{"en":"She finally figured out the math question.","zh":"她终于把那道数学题弄懂了。"}]},{"partOfSpeech":"phrase","definition":{"en":"to discover or learn information (often something hidden or unclear)","zh":"查明；发现（常指原本不清楚或隐藏的信息）"},"examples":[{"en":"The police are trying to figure out what happened.","zh":"警方正在设法查明发生了什么。"},{"en":"I figured out his password was his birthday.","zh":"我发现他的密码是他的生日。"}]},{"partOfSpeech":"phrase","definition":{"en":"to decide or plan something by calculating or considering options","zh":"（通过计算或权衡）决定；规划"},"examples":[{"en":"Let’s figure out the schedule for next week.","zh":"我们来把下周的安排定一下。"},{"en":"He’s figuring out where to live after graduation.","zh":"他在考虑毕业后住哪儿。"}]}],"synonyms":["work out","understand","solve","find out","determine"],"phonetic":"/ˈfɪɡjɚ aʊt/","extraExplanation":["“figure out”是常见口语动词短语：figure（理解/计算）+ out（把结果“弄出来”）。语气通常比“understand”更强调“想了一会儿才懂/才解决”。","常用结构：figure out + 名词（figure out the answer）；figure out + 疑问词从句（figure out what/how/why...）。","注意与“find out”区别：find out更偏“得知/发现事实”（信息来源可能是别人或外部），figure out更偏“通过推理、尝试、思考弄明白”。"]}
{"word":"figure out ...","summary":{"en":"understand, discover, or calculate after thinking","zh":"通过思考弄明白、查明或算出"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to understand something after thinking; to find an answer or solution","zh":"（经过思考后）弄明白；想出答案/解决办法"},"examples":[{"en":"I can’t figure out how to use this app.","zh":"我弄不明白怎么用这个应用。"},{"en":"We finally figured out why the computer kept crashing.","zh":"我们终于弄清楚电脑为什么总是崩溃了。"}]},{"partOfSpeech":"phrase","definition":{"en":"to discover or learn something by investigation or experience","zh":"（通过调查或经验）发现；搞清楚真相/原因"},"examples":[{"en":"The police are trying to figure out what happened last night.","zh":"警方正在努力查清昨晚发生了什么。"},{"en":"She figured out the truth from a few small details.","zh":"她从几个小细节中发现了真相。"}]},{"partOfSpeech":"phrase","definition":{"en":"to calculate or estimate a number","zh":"计算；估算"},"examples":[{"en":"Can you figure out the total cost including tax?","zh":"你能把含税的总费用算出来吗？"},{"en":"I figured out that we need about three more hours.","zh":"我估算了一下，我们还需要大约三个小时。"}]}],"synonyms":["understand","work out","solve","find out","discover","determine","calculate","compute"],"phonetic":"/ˈfɪɡjər aʊt/","etymology":"由动词 figure（原意与“图形/数字”有关，后来有“推算、认为”之意）+ out（表示“出来、得到结果”）构成；合起来强调“经过思考/推算把答案弄出来”。","mnemonic":["把它拆开记：figure（数字/推算）+ out（出来）→“把答案算/想出来”。","联想中文“想出来、算出来”：结果从脑子里“出来(out)”。"]}
{"word":"figure out sth.","summary":{"en":"understand, discover, or solve by thinking","zh":"通过思考弄明白、找出原因或解决"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to understand or discover something by thinking carefully; to solve a problem or find an explanation","zh":"通过仔细思考来理解或发现某事；想明白；找出原因；解决问题"},"examples":[{"en":"I can’t figure out how to use this app.","zh":"我搞不懂怎么用这个应用。"},{"en":"She finally figured out the answer to the math problem.","zh":"她终于把那道数学题的答案想出来了。"},{"en":"We’re trying to figure out why the Wi‑Fi keeps disconnecting.","zh":"我们在试着弄清楚为什么无线网总是断线。"}]},{"partOfSpeech":"phrase","definition":{"en":"to plan or calculate something, especially money or time","zh":"（尤指在钱或时间上）计算、估算、把……算进去"},"examples":[{"en":"Have you figured out the total cost yet?","zh":"你把总费用算出来了吗？"},{"en":"I figured out the travel time and added an extra hour.","zh":"我估算了路程时间，又多预留了一小时。"}]},{"partOfSpeech":"phrase","definition":{"en":"to understand someone’s character, feelings, or intentions","zh":"看透（某人）；弄明白某人的性格、感受或意图"},"examples":[{"en":"It took me a while to figure him out.","zh":"我花了一段时间才看透他。"},{"en":"I can’t figure out what she really wants.","zh":"我搞不懂她真正想要什么。"}]}],"synonyms":["work out","solve","understand","find out","determine","calculate","make sense of"],"phonetic":"/ˈfɪɡjɚ aʊt/","extraExplanation":["常见搭配：figure out + 疑问词（how/why/what/where）或 + 名词（the problem/ the answer/ the truth）。","语气上比 solve 更口语、范围更广：solve 多指“解决题目/问题”；figure out 也可指“弄明白原因/搞懂用法/看透某人”。","口语中可省略宾语：I can’t figure it out.（我想不明白/搞不懂。）其中 it 指代前面提到的事。"],"etymology":"源自“figure”（数字、图形、形象）+ out（出来）：最初与“算出数字/结果”相关，后来引申为“想明白、弄清楚”。","mnemonic":["把 figure 想成“数字/图形/形象”，figure out 就是“把答案/真相从一团乱里‘算出来、想出来’”。","联想“算（figure）出来（out）”→“算出来/想明白”。"]}
{"word":"figure painting","summary":{"en":"art that mainly depicts human figures","zh":"以人物（人体形象）为主要描绘对象的绘画"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A type of art (especially painting or drawing) that focuses on depicting the human body or human figures.","zh":"人物画；以描绘人体或人物形象为核心的绘画类型。"},"examples":[{"en":"She specializes in figure painting and often uses live models.","zh":"她专攻人物画，经常使用真人模特写生。"},{"en":"The class begins with basic figure painting techniques like proportions and light.","zh":"这门课从人物画的基础技法开始，比如比例和光影。"},{"en":"In the gallery, the figure paintings felt more intimate than the landscapes.","zh":"在画廊里，那些人物画比风景画更显亲密。"}]}],"synonyms":["figurative art","figurative painting","human figure painting","life painting"],"phonetic":"/ˈfɪɡjɚ ˌpeɪntɪŋ/","extraExplanation":["在西方艺术传统里，figure painting 常与“life drawing / figure drawing（人体写生/人物速写）”相关，强调人体结构、比例、姿态与明暗塑造。","它不一定等于“portrait（肖像画）”：portrait 更强调特定人物的身份与面容特征；figure painting 可以画匿名人物、全身动作场景，甚至只强调人体形体与构图。"],"etymology":"“figure”来自拉丁语 figura（形状、形象），在艺术语境中常指“人物形体/人体”；“figure painting”作为术语用于区分以人物为主的绘画与风景画、静物画等题材。","mnemonic":["把 figure 记成“人形/身形”，figure painting 就是“画人形的画”。","联想中文“人物画”：figure ≈ 人物（形象），painting ≈ 绘画。"]}
{"word":"figure skate","summary":{"en":"do figure skating, or a skate made for figure skating","zh":"进行花样滑冰；或指花样滑冰鞋"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to skate in a style that uses precise moves, turns, and jumps, usually on ice (the sport of figure skating)","zh":"花样滑冰；以花样动作（转体、跳跃、步法等）在冰面上滑行（通常指这项运动）"},"examples":[{"en":"She learned to figure skate when she was six.","zh":"她六岁时开始学习花样滑冰。"},{"en":"He practices every morning to figure skate more smoothly.","zh":"他每天早上练习，让花样滑冰动作更流畅。"},{"en":"I can ice skate, but I can’t really figure skate yet.","zh":"我会滑冰，但还不太会花样滑冰。"}]},{"partOfSpeech":"n.","definition":{"en":"a skate (boot with a blade) designed for figure skating, often with toe picks at the front of the blade","zh":"花样滑冰鞋（用于花样滑冰的冰刀鞋，刀刃前端常有齿状“刀齿”）"},"examples":[{"en":"Her figure skates have toe picks for jumps and spins.","zh":"她的花样滑冰鞋前端有刀齿，便于跳跃和旋转。"},{"en":"These figure skates feel too tight around my ankles.","zh":"这双花样滑冰鞋在脚踝处太紧了。"}]}],"synonyms":["do figure skating","ice dance","ice skate","skate"],"phonetic":"/ˈfɪɡjɚ skeɪt/","extraExplanation":["在日常英语里，表示运动时更常说“do figure skating”或“go figure skating”；“figure skate”作动词也正确，但相对不如“do/go figure skating”常见。","花样滑冰鞋的刀刃前端“toe picks（刀齿）”是它和速度滑冰刀的显著区别之一，用于起跳、点冰等动作。"],"etymology":"“figure”在早期冰上运动里指冰面上滑出的“图形/轨迹”（比如画出8字形），后来发展为包含旋转、跳跃等技巧的“花样滑冰”。“figure skate”因此既可指这项滑行方式，也可指用于该项目的冰鞋。","mnemonic":["把 figure 理解成“图形/花样”（像“画图”），skate 是“滑冰”，合起来就是“滑出花样/图形”。","联想中文“花样滑冰”：figure ≈ 花样，skate ≈ 滑冰。"]}
{"word":"figure skater","summary":{"en":"a person who performs choreographed skating with jumps and spins on ice","zh":"在冰上进行跳跃、旋转等编排动作的花样滑冰选手"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who performs figure skating (skating on ice with jumps, spins, and choreographed routines).","zh":"花样滑冰运动员（在冰上进行跳跃、旋转和编排动作表演的人）。"},"examples":[{"en":"She became a figure skater when she was six years old.","zh":"她六岁时就开始成为一名花样滑冰运动员。"},{"en":"The figure skater landed the jump cleanly and smiled at the crowd.","zh":"这位花样滑冰运动员干净利落地落冰，朝观众微笑。"},{"en":"Many figure skaters train for years to compete at the Olympics.","zh":"许多花样滑冰运动员训练多年，才能参加奥运会。"}]}],"synonyms":["ice skater","skater"],"phonetic":"/ˈfɪɡjɚ ˌskeɪtɚ/","extraExplanation":["在日常英语里，“figure skater”通常指比赛或表演级别的选手；更泛的说法可以用“ice skater”（冰上滑冰者），但它不一定是花样滑冰。","常见相关表达：figure skating（花样滑冰）、ice rink（冰场）、routine（成套动作）、spin（旋转）、jump（跳跃）。"],"etymology":"“figure skating”原指在冰面上“画出图形”的滑行（早期会在冰上划出8字等轨迹），后来发展为包含跳跃、旋转与编排的竞技与表演项目；“figure skater”就是从事该项目的人。","mnemonic":["把它拆开记：figure（图形/造型）+ skater（滑冰者）= “在冰上做造型、画轨迹的滑冰者”。","联想中文“花样”：figure 不只是“数字”，也有“形状/造型”的意思，所以 figure skating≈“花样滑冰”。"]}
{"word":"figure skating","summary":{"en":"an ice sport with choreographed jumps and spins, often performed to music","zh":"一种常配乐、包含跳跃与旋转等编排动作的冰上运动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sport in which people skate on ice and perform jumps, spins, and other choreographed movements, often to music","zh":"花样滑冰：一种在冰上滑行并完成跳跃、旋转等编排动作（常配乐）的运动"},"examples":[{"en":"She started figure skating when she was six years old.","zh":"她六岁开始学花样滑冰。"},{"en":"Figure skating combines athletic skill with artistic expression.","zh":"花样滑冰把运动能力与艺术表现结合在一起。"},{"en":"They watched figure skating at the Winter Olympics.","zh":"他们在冬奥会上看了花样滑冰比赛。"}]}],"synonyms":["artistic skating","ice skating"],"phonetic":"/ˈfɪɡjɚ ˌskeɪtɪŋ/","extraExplanation":["日常口语里也常简称为“skating”，但在需要区分项目时会说“figure skating”（区别于 speed skating 速度滑冰、ice hockey 冰球等）。","比赛常见项目包括 singles（单人）、pairs（双人/双人滑）和 ice dance（冰舞）；动作术语如 jump（跳跃）、spin（旋转）、footwork（步法）。"],"etymology":"“figure”原指在冰面上刻画出的“图形/轨迹”（早期选手会滑出8字等花纹），后来这项运动逐渐加入跳跃与旋转等动作；“skating”来自“skate（溜冰鞋/滑冰）”。合起来就指“滑出花样的滑冰”。","mnemonic":["把“figure”记成“图形/花样”：figure skating = 在冰上滑出“花样”的滑冰。","联想“figure（人物/身形）+ skating（滑冰）”：像舞台表演一样强调“姿态与表现”。"]}
{"word":"figure sth. out","summary":{"en":"understand, solve, or discover an answer by thinking or investigating","zh":"通过思考或调查而弄明白、解决或查明"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to understand or solve something after thinking about it; to find an answer or explanation","zh":"想明白；弄清楚；（通过思考）解决某事；找出答案/原因"},"examples":[{"en":"I can’t figure out how to use this app.","zh":"我搞不懂怎么用这个应用。"},{"en":"We finally figured out why the internet kept dropping.","zh":"我们终于弄清楚了为什么网络总是断。"},{"en":"Give me a minute—I’ll figure it out.","zh":"给我一分钟——我会弄明白的。"}]},{"partOfSpeech":"phrase","definition":{"en":"to discover information, especially by looking carefully or investigating","zh":"查明；找出（信息），尤指通过调查/仔细观察"},"examples":[{"en":"The police are trying to figure out what happened.","zh":"警方正在设法查明发生了什么。"},{"en":"We need to figure out who’s responsible for the mistake.","zh":"我们得找出谁该为这个错误负责。"}]}],"synonyms":["understand","work out","solve","determine","find out","discover","make sense of"],"phonetic":"/ˈfɪɡjɚ aʊt/","extraExplanation":["口语里很常用。代词要放中间：figure it out / figure them out（不能说 figure out it）。名词两种都可以：figure out the problem / figure the problem out。","常见句型：figure out + 疑问词（how/why/what/where）：figure out what to do（弄清楚该做什么）。","与“work out”相近：work out 更强调“解决/进展顺利”，figure out 更强调“弄明白/搞清楚原因或方法”。"],"etymology":"源自“figure”（图形、形状；后来引申为“在头脑中形成/计算”）+ “out”（弄出来、弄明白）。合起来表示“把答案从复杂情况里‘算/想出来’”。","mnemonic":["把 figure 想成“画图/算数”：把问题“画一画、算一算”，答案就“out（出来）”了 → 弄明白。","联想中文“想出来”：out = 出来；figure = 思考/计算 → figure out = 想出来。"]}
{"word":"figure sth. up","summary":{"en":"understand or solve something after thinking","zh":"经过思考后弄明白或解决"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to understand or solve something after thinking about it; to work out an answer","zh":"（经过思考后）弄明白；想出；解决"},"examples":[{"en":"I can’t figure out how to use this app.","zh":"我搞不懂怎么用这个应用。"},{"en":"Give me a minute—I’m trying to figure it up.","zh":"给我一分钟——我在努力把它弄明白。"},{"en":"We finally figured out why the printer wasn’t working.","zh":"我们终于弄清楚打印机为什么不能用了。"}]}],"synonyms":["figure out","work out","solve","understand","sort out","make sense of","crack"],"phonetic":"/ˈfɪɡjɚ ʌp/","extraExplanation":["更自然的搭配通常是：figure something out（最常见）、work something out（也很常用）。","在口语里，代词要放中间：figure it out（不是 *figure out it）。如果用“up”，也常见为 figure it up。","常见句型：figure out + wh- 疑问词（how/why/what/where）+ 从句；figure out + 名词/代词。"],"etymology":"“figure out”原意与“数字/图形（figure）”有关：通过“计算、推理”把答案“算出来”。口语中更常说“figure out”，而“figure sth. up”较少见，多为地区/个人用法或非标准表达。","mnemonic":["把 figure 想成“算数/画图做题”，out 表示“把答案掏出来”：动脑→答案出来→弄明白。","联想：数学题算到最后把结果“算出来（out）”，就是 figure out。"]}
{"word":"figure up","summary":{"en":"calculate a total by adding numbers","zh":"把数字加总，算出总额"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To add numbers to get a total; to calculate the final amount.","zh":"把数字加起来得出总数；计算总金额。"},"examples":[{"en":"Can you figure up the total cost of these groceries?","zh":"你能把这些杂货的总价算出来吗？"},{"en":"I figured up my monthly expenses and realized I need to save more.","zh":"我算了一下每月开销，才发现需要多存点钱。"},{"en":"When you figure everything up, it comes to about $300.","zh":"把所有费用都加起来，大概是300美元。"}]}],"synonyms":["add up","total up","sum up","tally","calculate"],"phonetic":"/ˈfɪɡjər ʌp/","extraExplanation":["用法提示：更常见、更通用的说法是“add up”或“total up”。“figure up”偏美式口语，常见于较口语化或地区性表达。","注意区分：不要和“figure out（弄明白）”混淆；“figure up”主要讲“算总数”。"],"etymology":"“figure”原意与“数字/图形”有关，后来引申为“用数字计算”。“up”在口语里常有“做完、合计起来”的感觉，所以“figure up”就是“把数合起来算出总数”。","mnemonic":["把“up”理解成“往上堆起来=累加”，figure（数字）+ up（加起来）→“算总数”。","联想“sum up（总结/合计）”，意思接近：把数字“up”到一个总和。"]}
{"word":"figure up sth.","summary":{"en":"calculate a total; sometimes used to mean work out a plan","zh":"合计计算总数；有时也指盘算出办法"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to add numbers to find a total; to calculate a sum","zh":"把数字加起来求总数；计算总和"},"examples":[{"en":"Can you figure up the total cost for the groceries?","zh":"你能把这些杂货的总价算出来吗？"},{"en":"She figured up how much she spent last month.","zh":"她算了算上个月花了多少钱。"}]},{"partOfSpeech":"phrase","definition":{"en":"to think about something and reach an answer or plan (often used as “figure something out”)","zh":"想明白；想出答案或办法（更常见用法是 figure sth out）"},"examples":[{"en":"I need some time to figure up a better schedule.","zh":"我需要点时间想出一个更好的时间表。"},{"en":"We’ll figure up what to do next after the meeting.","zh":"会后我们再想想下一步做什么。"}]}],"synonyms":["add up","total","sum up","calculate","tally","work out","figure out"],"phonetic":"/ˈfɪɡjɚ ʌp/","extraExplanation":["“figure up”在现代英语里最常见的意思是“加总、合计”，带一点口语/老派（尤其是美式、乡村或商业口吻）。在正式写作中更常用 add up / total / calculate。","在很多地区，“想明白”的含义通常用 figure out，更自然、更常见；figure up 表示“想出/盘算”会显得不太标准或有地域色彩。","用法：figure up + 名词 / 疑问词从句。例：figure up the bill（把账单合计一下）；figure up how much...（算出/盘算出多少）。"],"etymology":"“figure”原义与“数字/图形”有关，来自拉丁语 figura（形状、形式）。在美式英语里，figure + up 形成口语用法，常指“把数字加起来算总数”。","mnemonic":["把 figure 想成“数字”，up 想成“往上加”，合起来就是“加上去算总数”。","联想：收银员把每一项价格“往上加”，最后得到 total（总计）。"]}
{"word":"figure-flattering","summary":{"en":"Figure-flattering describes clothes that make your body shape look attractive (often slimmer or more balanced).","zh":"Figure-flattering 指衣服“显身材”，让身形看起来更好（常更显瘦或更匀称）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of clothing) designed to make your body shape look attractive, often by emphasizing curves or creating a slimmer silhouette.","zh":"（指衣服）显身材的；让身形更好看（常通过强调曲线或视觉上更显瘦）。"},"examples":[{"en":"This dress is very figure-flattering, especially at the waist.","zh":"这条裙子很显身材，尤其是腰部的设计。"},{"en":"She chose a figure-flattering blazer for the interview.","zh":"她为面试选了一件显身材的西装外套。"},{"en":"Darker colors and structured fabric can be more figure-flattering.","zh":"深色和挺括的面料往往更显身材。"}]}],"synonyms":["flattering","slimming","form-fitting","well-tailored"],"phonetic":"/ˈfɪɡjɚ ˈflætərɪŋ/","extraExplanation":["“figure”在这里指“身形/体态”（body shape），不是“数字/人物”。“figure-flattering”多用于时尚、穿搭建议中，语气通常是正面的，但在不同文化语境里也可能让人联想到对身材的评价；与他人谈论时可更中性地说“a good fit（很合身）”或“well-tailored（剪裁得体）”。"]}
{"word":"figure-of-eight","summary":{"en":"an 8-shaped form, movement, or knot","zh":"“8”字形的形状、轨迹或绳结"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shape like the number 8, made of two connected loops.","zh":"“8”字形的图案；由两个相连的环组成的形状。"},"examples":[{"en":"The skater traced a figure-of-eight on the ice.","zh":"滑冰者在冰面上滑出了一个“8”字形。"},{"en":"Tie the rope in a figure-of-eight to make a secure knot.","zh":"把绳子打成“8”字结会更牢固。"}]},{"partOfSpeech":"n.","definition":{"en":"A movement, route, or pattern that repeatedly forms two loops, like an 8.","zh":"呈“8”字循环的动作、路线或轨迹（反复绕出两个环）。"},"examples":[{"en":"Practice driving in a figure-of-eight to improve control.","zh":"练习“8”字绕行有助于提升操控。"},{"en":"The bee flew in a figure-of-eight around the flowers.","zh":"那只蜜蜂在花丛周围以“8”字形飞行。"}]},{"partOfSpeech":"n.","definition":{"en":"A common knot used in climbing and sailing, shaped like an 8.","zh":"“8”字结（攀岩、航海常用的一种结，形状像数字8）。"},"examples":[{"en":"He checked the figure-of-eight before clipping into the rope.","zh":"他在把绳子扣上去之前检查了“8”字结。"},{"en":"Learning the figure-of-eight knot is a basic climbing skill.","zh":"学习“8”字结是攀岩的基础技能之一。"}]}],"synonyms":["figure eight","eight-shaped loop","lemniscate","infinity shape","figure-eight knot"],"phonetic":"/ˈfɪɡjɚ əv eɪt/","extraExplanation":["拼写里常见连字符：figure-of-eight。也可写作 figure eight（更口语/更常见），意思相同。","在不同领域含义会更具体：运动（滑冰/驾驶）多指轨迹；攀岩/航海多指“8”字结。具体含义看上下文。"],"etymology":"字面意思来自“数字8的形状”。英语里常用“figure”表示“形状/图形”（如 figure of speech 修辞格），再加“of eight”说明具体形状。","mnemonic":["联想：两个圈连在一起＝“8”。看到 figure-of-eight 就直接在脑中画一个“8”。","把 figure 当作“图形/形状”（类似中文“图形”），figure-of-eight＝“8字形图形”。"]}
{"word":"figured","summary":{"en":"“Figured” most often means “thought/understood/estimated” (past of figure), and it can also mean “patterned” or (old-fashioned) “well-shaped.”","zh":"“figured”最常见是“figure”的过去式/过去分词（认为、理解、估算）；也可作形容词表示“有花纹的”，或（较旧式）“身材匀称的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “figure”: to think, calculate, or understand (often used as “figure (that) …” or “figure out”).","zh":"“figure”的过去式/过去分词：认为、估算、理解（常用于“figure (that) …”或“figure out”）。"},"examples":[{"en":"I figured you might be tired after the trip.","zh":"我想你旅行之后可能会累。"},{"en":"She figured out how to fix the printer.","zh":"她弄明白了怎么修打印机。"},{"en":"We figured the total cost would be about $200.","zh":"我们估算总费用大约是200美元。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a pattern or design (especially on cloth, wallpaper, etc.).","zh":"有图案的；有花纹的（尤指布料、壁纸等）。"},"examples":[{"en":"He wore a figured shirt with small blue flowers.","zh":"他穿了一件有小蓝花图案的衬衫。"},{"en":"They chose figured wallpaper for the living room.","zh":"他们为客厅选了带图案的壁纸。"}]},{"partOfSpeech":"adj.","definition":{"en":"having an attractive or clearly shaped body (more old-fashioned).","zh":"体态优美的；身材匀称的（较旧式/偏书面）。"},"examples":[{"en":"In the novel, she is described as tall and well-figured.","zh":"小说里描写她身材高挑、体态匀称。"}]}],"synonyms":["thought","guessed","assumed","worked out","calculated","patterned"],"phonetic":"/ˈfɪɡjərd/","extraExplanation":["口语里“I figured (that) …”常表示“我想/我猜/我认为”，语气通常比“I thought …”更像是经过一点推理或根据线索得出的结论。","注意区分：figure out = 弄明白/解决；figure (that) = 认为/推断；figure = 估算（价格、时间、数量等）。","“figured”作形容词表示“有花纹的”时，多用于服装、布料、壁纸等；作“身材匀称的”时带一点老派/文学描写的感觉。"]}
{"word":"figuredly","summary":{"en":"“Figuredly” means “figuratively”—in a metaphorical, non-literal way, sometimes with a sense of symbolic representation.","zh":"“figuredly”意为“比喻地（figuratively）”，指非字面意义地表达，有时也强调象征性的表达方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a figurative or metaphorical way, not meant literally.","zh":"以比喻的方式；不是字面意义上的。"},"examples":[{"en":"When I said I was drowning in work, I meant it figuredly, not literally.","zh":"我说自己“被工作淹没”是比喻说法，并不是字面上的溺水。"},{"en":"He was figuredly walking on air after getting the job.","zh":"他拿到工作后简直是“脚不沾地”（比喻地）开心。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a symbolic or representational way; as an image, sign, or figure.","zh":"以象征／形象化的方式；作为符号或形象来表达。"},"examples":[{"en":"In the painting, the storm is figuredly used to show inner conflict.","zh":"在这幅画里，风暴被象征性地用来表现内心冲突。"},{"en":"The poem speaks of winter figuredly to suggest loneliness.","zh":"这首诗用“冬天”作象征来暗示孤独。"}]}],"synonyms":["figuratively","metaphorically","symbolically"],"phonetic":"/ˈfɪɡjərdli/","extraExplanation":["“figuredly”比较少见，更常见的是“figuratively”（比喻地）。在日常写作或考试中，用“figuratively”更自然、更标准。","词源上与 figure（形象、图形、人物）有关，所以它也可带有“以形象/象征方式表达”的意味。"]}
{"word":"figurehead","summary":{"en":"A “figurehead” is either a symbolic leader with little real power or a decorative carving on a ship’s front.","zh":"figurehead 指“名义上的领导/象征性人物”，也可指“船首的雕像装饰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is the official leader in name but has little real power; a symbolic head.","zh":"名义上的领导者；有头衔但几乎没有实权的“傀儡式”人物。"},"examples":[{"en":"The president became a figurehead while the generals made the real decisions.","zh":"总统成了名义上的领袖，而真正做决定的是将军们。"},{"en":"She was treated as a figurehead, asked to smile for photos but not included in meetings.","zh":"她被当作摆设，只被要求对着镜头微笑，却不被允许参加会议。"}]},{"partOfSpeech":"n.","definition":{"en":"A carved decoration (often a human or animal) on the front of a traditional ship.","zh":"（传统船只船首的）雕像装饰，常为人物或动物形象。"},"examples":[{"en":"The old sailing ship had a wooden figurehead shaped like a mermaid.","zh":"那艘古老的帆船船头有一个美人鱼形状的木雕像。"},{"en":"Visitors admired the figurehead at the bow in the maritime museum.","zh":"游客们在海事博物馆欣赏船头的雕像装饰。"}]}],"synonyms":["puppet leader","token leader","nominal leader","symbolic leader","front person"],"phonetic":"/ˈfɪɡjɚˌhɛd/","extraExplanation":["这个词本义来自船首的装饰雕像（figure + head），后来引申为“摆在前面给人看、象征意义大于实际权力的人”。在新闻里常见搭配：a ceremonial figurehead（礼仪性领袖）、a mere figurehead（纯粹的名义领袖）。"]}
{"word":"figureheadless","summary":{"en":"“Figureheadless” (rare) means lacking a figurehead—a symbolic or ceremonial leader.","zh":"“figureheadless”（较罕见）指缺少 figurehead（象征性/名义上的领袖、门面人物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Without a figurehead (a symbolic leader) or without a prominent person used mainly for appearance rather than real power.","zh":"（罕见）没有“傀儡领袖/象征性领袖”（figurehead）的；缺少主要用于象征或门面、但不一定掌权的人物。"},"examples":[{"en":"After the scandal, the organization became figureheadless and struggled to project unity.","zh":"丑闻之后，这个组织变得缺少象征性领袖，难以展现团结。"},{"en":"The committee was figureheadless, so decisions felt directionless to the public.","zh":"委员会缺少门面人物，因此公众觉得决策缺乏方向感。"}]}],"synonyms":["leaderless","headless","rudderless","without a figurehead"],"phonetic":"/ˈfɪɡjɚˌhɛdləs/","extraExplanation":["“figureheadless”不是常见词，更自然的说法通常是：without a figurehead、leaderless（没有领袖的）、headless（无首的/无领导的）、rudderless（缺乏方向的）。","figurehead 本义来自船头装饰雕像（船首像），引申为“名义上的领袖/门面人物”。因此 figureheadless 多用于描述组织在形象或象征层面缺少带头人，语气往往带有“缺乏凝聚力或对外形象”的暗示。"]}
{"word":"figureheads","summary":{"en":"“Figureheads” can mean either public representatives with little real power, or decorative carved figures on a ship’s bow.","zh":"“figureheads”既可指“有名无权的名义领袖”，也可指“船首的装饰雕像（船首像）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A well-known or respected person who represents a group, organization, or movement in public, but has little real power or control.","zh":"（组织/团体的）名义领袖，傀儡领袖；在公众面前代表某方但实际权力很小的人。"},"examples":[{"en":"After the merger, she stayed on as a figurehead while others made the key decisions.","zh":"合并后，她继续担任名义领袖，而关键决策由别人来做。"},{"en":"The country had an elected government, but the president was mostly a figurehead.","zh":"这个国家有民选政府，但总统大多只是名义上的领袖。"}]},{"partOfSpeech":"n.","definition":{"en":"A carved or decorative figure on the front of a ship (especially older sailing ships).","zh":"（旧式帆船船首的）雕像，船首像。"},"examples":[{"en":"The museum displayed a wooden figurehead from an 18th-century ship.","zh":"博物馆展出了一尊18世纪船只的木质船首像。"},{"en":"Sailors believed the figurehead could bring the ship good luck.","zh":"水手们相信船首像能给船带来好运。"}]}],"synonyms":["puppet leader","nominal leader","front person","symbolic leader","bow figure","ship carving"],"phonetic":"/ˈfɪɡjərˌhɛdz/","extraExplanation":["“figurehead”既可以是比喻义（名义领袖/傀儡），也可以是字面义（船首像）。比喻义常见于政治与公司治理语境，带一点“有名无权”的含义，语气有时偏批评。","词形提示：figurehead（单数），figureheads（复数）。在新闻里常见搭配：a ceremonial figurehead（礼仪性领袖）、a powerless figurehead（无实权的领袖）。"]}
{"word":"figureheadship","summary":{"en":"Figureheadship means holding a mainly symbolic leadership role with little real power.","zh":"Figureheadship 指担任主要象征性的领导角色，通常缺乏实际权力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, role, or period of being a figurehead (a leader with little real power who mainly represents an organization or country).","zh":"“傀儡领袖/名义领袖（figurehead）”的职位、角色或任期（主要起象征代表作用，实际权力很少）。"},"examples":[{"en":"After the revolution, the king’s figureheadship continued, but the elected council made all major decisions.","zh":"革命后，国王仍保留名义领袖的地位，但所有重大决策都由民选委员会做出。"},{"en":"The company kept her in figureheadship to reassure investors, while the new CEO ran daily operations.","zh":"公司让她保留名义领导职位以安抚投资者，而日常运营由新任CEO负责。"}]},{"partOfSpeech":"n.","definition":{"en":"(more generally) a leadership title that is mostly ceremonial, without meaningful control or responsibility.","zh":"（更广义）主要是礼仪性/象征性的领导头衔，缺乏实质性的控制权或责任。"},"examples":[{"en":"He accepted the figureheadship of the committee, but others wrote the policy and managed the budget.","zh":"他接受了委员会的名义主席头衔，但政策由别人起草，预算也由别人管理。"},{"en":"Many members disliked the figureheadship because it looked like leadership without accountability.","zh":"许多成员不喜欢这种“名义领导”，因为看起来像有领导权却不需要负责。"}]}],"synonyms":["ceremonial role","nominal leadership","titular leadership","symbolic leadership","figurehead role"],"phonetic":"ˈfɪɡjərˌhɛdʃɪp","extraExplanation":["“figureheadship”由 figurehead（名义领袖；也指船头雕像“船首像”）+ 后缀 -ship 构成。-ship 常表示“身份/职位/状态/任期”（如 friendship 友谊，leadership 领导地位）。","这个词多用于政治、公司治理或组织管理的语境，常带有“有头衔但没实权”的含义，语气有时略带批评或讽刺。"]}
{"word":"figureless","summary":{"en":"Figureless means “without figures/diagrams,” and more rarely “without a clear shape or form.”","zh":"Figureless 常指“没有图表/插图的”，较少情况下指“没有清晰形状或轮廓的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without figures, illustrations, or diagrams (especially in a book, article, or report).","zh":"（尤指书、文章或报告）没有图表、插图或示意图的。"},"examples":[{"en":"The figureless report was hard to follow because it lacked charts and graphs.","zh":"这份没有图表的报告很难读懂，因为缺少图表和曲线图。"},{"en":"Please submit a figureless version for blind review.","zh":"请提交一份不含图表的版本以便匿名评审。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking a clear shape or form; without a distinct figure (sometimes used in art or poetry).","zh":"没有清晰形状或轮廓的；无明确“人形/形体”的（有时用于艺术或诗歌语境）。"},"examples":[{"en":"In the fog, the crowd became a figureless mass.","zh":"在雾中，人群变成了一团没有清晰轮廓的影子。"},{"en":"The painting’s figureless background makes the main subject stand out.","zh":"这幅画无人物形象的背景让主体更突出。"}]}],"synonyms":["without illustrations","diagram-free","unillustrated","formless","shapeless"],"phonetic":"/ˈfɪɡjərləs/","extraExplanation":["“figureless”在日常口语中不算常见，更常见于学术写作、出版流程（如“figureless version”用于匿名审稿）或艺术评论中。","注意：这里的figure常指“图表/插图”，不只是“人物身材”。因此figureless更常理解为“无图（表）”。"]}
{"word":"figurer","summary":{"en":"Figurer is a rare noun meaning either someone who calculates/estimates or someone who makes figures (shapes), like a sculptor.","zh":"figurer 是较少见的名词，可指“进行计算/估算的人”，也可指“制作造型的人（如雕塑家）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who works with numbers, especially someone who calculates or estimates (rare in everyday English)","zh":"（较少见）计算或估算的人；擅长算数的人"},"examples":[{"en":"We need a good figurer to estimate the total cost before we sign the contract.","zh":"在签合同前，我们需要一个善于估算的人来估计总成本。"},{"en":"She’s a quick figurer, so she finished the budget in an hour.","zh":"她算得很快，所以一小时就做完了预算。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who makes figures (shapes), such as a sculptor or someone who models forms (rare/old-fashioned)","zh":"（较少见/旧用法）制作人像或造型的人（如雕塑家、塑形者）"},"examples":[{"en":"In the workshop, the figurer shaped small clay figures for the display.","zh":"在工坊里，这位塑形者为展览捏制小陶偶。"},{"en":"The museum hired a figurer to restore damaged statues.","zh":"博物馆雇了一位雕塑修复师来修复受损的雕像。"}]}],"synonyms":["calculator","estimator","number cruncher","sculptor","modeler"],"phonetic":"/ˈfɪɡjərər/","extraExplanation":["“figurer”在现代英语里不常用。日常表达里，人们更常说：\n- 会算的人：a good/quick calculator；someone who’s good with numbers；a number cruncher（较口语）\n- 进行估算的人：an estimator\n- 做雕塑/塑形的人：a sculptor / a modeler\n\n另外要注意：法语里有动词“figurer”（意为“表现、象征、出现在……中”），但那不是英语常用词；英语中通常用 represent / symbolize / appear (in) 来表达。"]}
{"word":"figurers","summary":{"en":"“Figurers” is a rare plural noun meaning people who calculate or figure things out; it can also mean people who create or design figures/shapes.","zh":"“figurers”是较少见的复数名词，通常指会计算或善于推理的人；也可指制作/设计造型或图形的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of figurer) A person who figures something out, especially someone who calculates or works with numbers.","zh":"（figurer 的复数）指会“算/推理”的人，尤指从事计算或擅长数字运算的人。"},"examples":[{"en":"The best figurers on the team checked the budget twice.","zh":"团队里最会算的人把预算核对了两遍。"},{"en":"We need quick figurers to estimate the costs.","zh":"我们需要反应快、会估算成本的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of figurer) Someone who makes or designs figures (shapes/images), such as in art or decoration.","zh":"（figurer 的复数）制作或设计“图形/人物造型”的人（如艺术或装饰领域）。"},"examples":[{"en":"The museum invited local figurers to create small clay figures for the exhibit.","zh":"博物馆邀请本地造型师为展览制作小型陶土人像。"},{"en":"Skilled figurers can turn simple lines into expressive forms.","zh":"熟练的造型师能把简单线条变成有表现力的形体。"}]}],"synonyms":["calculators","analysts","number-crunchers","problem-solvers","designers"],"phonetic":"/ˈfɪɡjərɚz/","extraExplanation":["“figurer(s)”在现代英语中比较少见，日常更常用的是“people who are good at math / calculators / analysts（会算的人/计算员/分析师）”。如果你想表达“人物/雕像”，常见词是“figures / figurines”。如果你想表达“想明白的人”，更自然的是“problem-solvers / thinkers”。"]}
{"word":"figures","summary":{"en":"“Figures” most commonly means numbers or statistics; it can also mean pictures/shapes, well-known people, or (as a verb) to calculate or figure out.","zh":"“figures”最常见意思是数字/统计数据；也可指图形/插图、知名人物，或作动词表示计算、估算或弄明白（figure out）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Numbers or amounts, especially in reports, prices, or statistics.","zh":"数字；数量（尤指报告、价格或统计中的数据）。"},"examples":[{"en":"The latest figures show inflation is slowing down.","zh":"最新数据显示通货膨胀正在放缓。"},{"en":"Sales figures rose by 12% last quarter.","zh":"上个季度的销售数据上涨了12%。"},{"en":"Do these figures include tax?","zh":"这些数字包含税费吗？"}]},{"partOfSpeech":"n.","definition":{"en":"Pictures, shapes, or forms in art, books, or diagrams; also the human body shape shown in art.","zh":"图形；插图；（艺术中的）人物形象/人体形态。"},"examples":[{"en":"The textbook has figures to explain the process.","zh":"这本教材有插图来解释这个过程。"},{"en":"She drew simple figures on the board.","zh":"她在白板上画了些简单的图形。"},{"en":"The artist is known for painting elegant figures.","zh":"这位艺术家以描绘优雅的人物形象而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"Important or well-known people (often used with an adjective).","zh":"人物；知名人士（常与形容词连用）。"},"examples":[{"en":"He’s a leading figure in modern jazz.","zh":"他是现代爵士乐领域的领军人物。"},{"en":"Public figures are often under pressure.","zh":"公众人物常常承受压力。"}]},{"partOfSpeech":"v.","definition":{"en":"To calculate or estimate numbers; to work out an answer (often used as “figure out”).","zh":"计算；估算；弄明白（常用 figure out）。"},"examples":[{"en":"She figures the total cost at around $200.","zh":"她估算总成本大约是200美元。"},{"en":"I can’t figure out how to open this file.","zh":"我弄不明白怎么打开这个文件。"},{"en":"He figured that it was safer to leave early.","zh":"他认为早点离开更安全。"}]}],"synonyms":["numbers","statistics","data","amounts","illustrations","diagrams","people","celebrities","calculate","estimate","work out"],"phonetic":"/ˈfɪɡjɚz/","extraExplanation":["“figures”在英语里常指“数据/统计数字”，尤其在新闻、商业报告中很常见。","常见搭配：latest figures（最新数据），official figures（官方数据），sales figures（销售数据），according to the figures（根据数据显示）。","与“figure”相关的高频短语是 figure out（弄明白/想出办法）。注意：figure out 更偏口语与日常表达。"]}
{"word":"figuresome","summary":{"en":"“Figuresome” means shapely or well-proportioned, and it often sounds old-fashioned or literary.","zh":"“figuresome”意为“身材匀称好看”，语气偏旧式或文学化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a pleasing, well-shaped figure; shapely (often used in older or literary English).","zh":"身材匀称好看的；体态优美的（多见于较旧或文学语境）。"},"examples":[{"en":"In the old novel, the heroine is described as “tall and figuresome.”","zh":"在那本旧小说里，女主角被描写为“身材高挑、体态优美”。"},{"en":"The actor was praised for his figuresome build and confident posture.","zh":"那位演员因身材匀称、站姿自信而受到称赞。"}]}],"synonyms":["shapely","well-proportioned","well-built","comely"],"phonetic":"/ˈfɪɡjərsəm/","extraExplanation":["“figuresome”在现代日常英语里不常用，带一点复古/文学味道；更常见的替代说法有 shapely、well-proportioned、well-built 等。","在描述外貌时要注意语境与礼貌：有些场合直接评价身材可能显得冒犯；更中性的表达可以用 “fit / athletic / elegant” 等。"]}
{"word":"figurette","summary":{"en":"Figurette means a small decorative figure, or a small human-outline drawing used in fashion/design.","zh":"Figurette 指小雕像/小摆件，也可指时尚设计中用于展示服装的人体小轮廓图。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small decorative figure or statue, often used as an ornament or collectible","zh":"小雕像；小摆件（常作装饰或收藏）"},"examples":[{"en":"She keeps a porcelain figurette on her desk.","zh":"她在桌上放着一个瓷制小雕像。"},{"en":"The museum shop sells figurettes inspired by ancient art.","zh":"博物馆商店出售受古代艺术启发的小摆件。"}]},{"partOfSpeech":"n.","definition":{"en":"(fashion/design) a small drawing or printed outline of a human figure used to show how clothing will look","zh":"（时尚/设计）人体小轮廓图；服装展示用的人形小稿"},"examples":[{"en":"The designer sketched the dress on a figurette before cutting the fabric.","zh":"设计师先在人体小轮廓图上画出裙子，再开始裁布。"},{"en":"These catalog pages use simple figurettes to display the outfits.","zh":"这些目录页用简化的人形小图来展示服装。"}]}],"synonyms":["figurine","statuette","ornament","miniature figure"],"phonetic":"/ˌfɪɡjəˈrɛt/","extraExplanation":["“figurette”较少见，更常见的近义词是“figurine”（小雕像/小塑像）。","词尾“-ette”常表示“小/较小”（源自法语），所以 figure + -ette 字面意思就是“较小的形象/人形”。","如果你想表达“比喻的/形象化的”，那通常是“figurative”，不是“figurette”。"]}
{"word":"figurial","summary":{"en":"“Figurial” is not standard English; it’s usually a misspelling of “figural” or “figurative.”","zh":"“figurial”不是标准英语用词；通常是把“figural”或“figurative”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or misspelled form; usually intended to mean “figural” (relating to shapes or figures) or “figurative” (not literal).","zh":"非标准或拼写错误的形式；通常是想写“figural”（与图形/形状有关）或“figurative”（比喻的、非字面意思的）。"},"examples":[{"en":"I couldn’t find “figurial” in a standard dictionary—did you mean “figural” or “figurative”?","zh":"我在标准词典里找不到“figurial”——你是想写“figural”还是“figurative”？"},{"en":"In art class, we studied figural drawing (drawing the human figure), not “figurial” drawing.","zh":"在美术课上，我们学习的是“figural drawing”（人物素描），而不是“figurial drawing”。"},{"en":"He used figurative language, so the sentence wasn’t meant literally.","zh":"他用了比喻性语言，所以那句话不是字面意思。"}]}],"synonyms":["figural","figurative"],"phonetic":"/fɪˈɡjʊriəl/","extraExplanation":["“figurial”在英语中几乎不作为标准词使用，常见于拼写混淆。最可能的目标词：\n1) figural：强调“形体/图形/人物形象”（如 figural art, figural drawing）。\n2) figurative：强调“比喻的、象征的、非字面意义”（如 figurative language）。\n如果你告诉我句子语境（你想表达“图形的”还是“比喻的”），我可以帮你选最自然的词并润色。"]}
{"word":"figurine","summary":{"en":"A figurine is a small decorative statue or model, often collected or displayed.","zh":"figurine 指小雕像/小塑像，常用于装饰、陈列或收藏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small model or statue of a person, animal, or character, often used for decoration or collecting","zh":"（人、动物或角色的）小雕像；小塑像（常用于装饰或收藏）"},"examples":[{"en":"She bought a porcelain figurine of a dancer for her bookshelf.","zh":"她买了一个瓷质舞者小雕像放在书架上。"},{"en":"The museum displayed ancient clay figurines from the tomb.","zh":"博物馆展出了墓葬出土的古代陶俑。"},{"en":"Kids often collect superhero figurines.","zh":"孩子们常常收集超级英雄手办/小人偶。"}]}],"synonyms":["statuette","small statue","model","ornament","figure"],"phonetic":"/ˌfɪɡjəˈrin/","extraExplanation":["“Figurine”常指较小的装饰性雕像或人偶；如果是可动、可换配件的收藏玩具，英语里也常用“action figure”。","在考古与历史语境中，“figurine”可指随葬的陶俑、泥塑小像等（如“clay figurines”）。"]}
{"word":"figurine-making","summary":{"en":"Figurine-making is the hobby or craft of making small decorative figures.","zh":"figurine-making 指制作小型装饰雕像/人偶的爱好或工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The craft or activity of creating small decorative figures (figurines), often from clay, resin, wood, metal, or similar materials.","zh":"制作小雕像（摆件人偶）的工艺或活动，常用黏土、树脂、木头、金属等材料。"},"examples":[{"en":"She got into figurine-making with air-dry clay and simple tools.","zh":"她用风干黏土和简单工具开始做小雕像。"},{"en":"Figurine-making requires patience, especially when painting tiny details.","zh":"做小雕像需要耐心，尤其是给细小的细节上色时。"},{"en":"The museum ran a weekend figurine-making workshop for families.","zh":"博物馆为家庭举办了周末小雕像制作工作坊。"}]}],"synonyms":["figurine crafting","miniature sculpture making","model-making (related)","sculpting (broader)"],"phonetic":"/ˈfɪɡjərˌin ˌmeɪkɪŋ/","extraExplanation":["“figurine”来自法语指“小型雕像”，后缀“-ine”常有“较小/可爱”的感觉，因此 figurine 通常比 statue 更小、更偏装饰或收藏用途。","写作时 figurine-making 常用连字符，尤其在作定语时更常见：a figurine-making class（小雕像制作课）。不用连字符也可以：figurine making。"]}
{"word":"figurines","summary":{"en":"Figurines are small decorative or collectible statues/models of people, animals, or characters.","zh":"Figurines 指用于装饰或收藏的小雕像/小模型（人物、动物或角色等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small statue or model of a person, animal, or character, made for decoration or collecting","zh":"（人物、动物或角色的）小雕像；小塑像（多用于装饰或收藏）"},"examples":[{"en":"She collects porcelain figurines of animals.","zh":"她收藏动物瓷质小雕像。"},{"en":"A tiny figurine sat on the shelf above the fireplace.","zh":"壁炉上方的架子上摆着一个小小的雕像。"}]},{"partOfSpeech":"n.","definition":{"en":"a small figure used to represent something in a scene, display, or model (for example, in a diorama)","zh":"（用于场景展示或模型中的）小模型人偶；小摆件（如立体场景模型里的小人）"},"examples":[{"en":"The museum display includes figurines showing daily life in ancient times.","zh":"博物馆的展陈里有一些小人偶，展示古代的日常生活。"},{"en":"He added figurines to the model village to make it feel more realistic.","zh":"他在模型村庄里加了一些小人偶，让它看起来更逼真。"}]}],"synonyms":["small statue","statuette","miniature figure","ornament","collectible figure"],"phonetic":"/ˌfɪɡjəˈrinz/","extraExplanation":["“Figurines” 是 “figurine” 的复数形式。常见材质有陶瓷（porcelain）、树脂（resin）、木头（wood）或金属（metal）。","在英语里，figurine 通常比 statue（雕像）更小、更精致；也常与 collectible（收藏品）、ornament（摆设）等词搭配。"]}
{"word":"figuring","summary":{"en":"“Figuring” usually means the process of thinking to understand something, often in “figure out.”","zh":"“figuring”通常表示通过思考来弄明白，多见于短语“figure out（弄清楚）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of thinking carefully to understand something or find an answer","zh":"思考、推理并弄清楚某事的过程"},"examples":[{"en":"I’m still figuring out how this app works.","zh":"我还在弄明白这个应用怎么用。"},{"en":"After figuring out the problem, she explained it clearly.","zh":"弄清楚问题后，她讲得很清楚。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “figure out”: thinking about something to understand it or decide what to do","zh":"（figure out 的现在分词）正在思考/推断以弄明白或决定怎么做"},"examples":[{"en":"He’s figuring out what to say in the meeting.","zh":"他正在想开会时该说什么。"},{"en":"We’re figuring out the best route to the airport.","zh":"我们正在规划/找出去机场的最佳路线。"},{"en":"I’m figuring out whether I should take this job.","zh":"我正在权衡要不要接这份工作。"}]}],"synonyms":["working out","thinking through","solving","reasoning"],"phonetic":"/ˈfɪɡjərɪŋ/","extraExplanation":["“figuring”最常见出现在口语里，通常是“figure out”的一部分：figure out + 名词/从句。比如：figure out the answer；figure out how to do it。","注意区别：figuring（动词/名词，和“思考、弄明白”有关） vs. figure（名词“数字/人物/图形”）。"]}
{"word":"figuring out","summary":{"en":"trying to understand, discover, or calculate something","zh":"努力弄明白、查明或算出某事"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"trying to understand something or find an answer by thinking carefully","zh":"努力理解某事或通过思考找出答案"},"examples":[{"en":"I’m figuring out how this app works.","zh":"我正在弄明白这个应用怎么用。"},{"en":"Give me a minute—I’m still figuring it out.","zh":"给我一分钟——我还在弄清楚。"},{"en":"She spent the evening figuring out what went wrong.","zh":"她花了整个晚上在弄清楚到底哪里出了问题。"}]},{"partOfSpeech":"phrase","definition":{"en":"finding out information or discovering the truth about something","zh":"查明信息；发现（真相）"},"examples":[{"en":"They’re figuring out who sent the message.","zh":"他们正在查明是谁发的那条消息。"},{"en":"We figured out the cause of the problem.","zh":"我们查明了问题的原因。"}]},{"partOfSpeech":"phrase","definition":{"en":"calculating a number or amount","zh":"计算（数量或金额）"},"examples":[{"en":"I’m figuring out the total cost.","zh":"我在算总费用。"},{"en":"Can you help me figure out how much we owe?","zh":"你能帮我算一下我们还欠多少吗？"}]}],"synonyms":["work out","understand","solve","find out","discover","determine","calculate","puzzle out"],"phonetic":"/ˈfɪɡjərɪŋ aʊt/","extraExplanation":["常见用法：figure out + 名词/从句（I can’t figure out why…）。也可用代词作宾语：figure it out（更自然），不说 figure out it。","语气较口语，表示“弄明白/想出办法”，比“understand”更强调过程：从不懂到懂。"],"etymology":"源自动词短语“figure out”。“figure”最早与“数字/计算”有关，后来引申为“想明白、理解”；“out”有“结果出来、弄清楚”的含义，所以整体就是“把答案想出来/弄出来”。","mnemonic":["把它想成“把答案从脑子里‘弄出来(out)’”：想→算→答案出来。","联想“figure=数字/公式”，所以 figure out 也常用于“算出来、推出来”。"]}
{"word":"figuring out a way","summary":{"en":"trying to find a workable solution or method","zh":"正在寻找可行的解决办法或方法"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"trying to find a solution, method, or plan (often by thinking, experimenting, or discussing)","zh":"正在想办法；正在设法找到解决方案/方法/计划（常通过思考、尝试或讨论）"},"examples":[{"en":"We’re figuring out a way to finish the project on time.","zh":"我们正在想办法按时完成这个项目。"},{"en":"She stayed calm and kept figuring out a way forward.","zh":"她保持冷静，一直在设法找到前进的路。"},{"en":"They’re figuring out a way to make the app easier to use.","zh":"他们正在想办法让这个应用更易用。"}]}],"synonyms":["finding a way","working out a solution","coming up with a plan","looking for a workaround","devising a method"],"phonetic":"/ˈfɪɡjərɪŋ aʊt ə weɪ/","extraExplanation":["语气与用法：常用于进行时（be figuring out...），强调“正在进行中的思考/尝试”，而不是已经找到答案。","常见搭配：figure out a way to + 动词（想办法去做……）；figure out a way around/through + 问题（想办法绕过/解决障碍）。","近义表达对比：\"find a way\" 更偏结果（找到办法）；\"work out a way\" 更强调通过努力协商制定方案；\"come up with a way\" 更强调提出点子。"],"etymology":"来自短语动词“figure out”（弄明白、想出、解决）。“figure”原意与“形状/图形/数字”有关，引申为“把事情理清、算出来”，再发展为“想出解决办法”。","mnemonic":["把 figure 理解成“数字/算”，figure out 就像“把题算出来”；a way=“办法”，合起来就是“算出一个办法”。","联想：out = “出来”，把解决方案“想出来”。"]}
{"word":"figurings","summary":{"en":"“Figurings” usually means calculations or estimates; less commonly, it means personal reasoning or conclusions.","zh":"“Figurings”通常指计算或估算的结果；较少情况下指个人的推断、思量后的结论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"calculations, estimates, or numbers you work out (plural of “figuring” in the sense of doing math or deciding an amount)","zh":"计算结果、估算数值；算出来的数字（“figuring”作“计算/估算”时的复数）"},"examples":[{"en":"Your figurings are close, but check the last step again.","zh":"你的计算结果很接近，但再检查一下最后一步。"},{"en":"We compared our figurings and got the same total.","zh":"我们对比了各自的计算结果，得到了相同的总数。"}]},{"partOfSpeech":"n.","definition":{"en":"ideas or conclusions formed by thinking carefully; your reasoning or interpretation (less common, often sounds literary or old-fashioned)","zh":"思考后形成的想法或结论；推断/理解（较不常见，略带文学或旧式语感）"},"examples":[{"en":"Her figurings about his motives turned out to be wrong.","zh":"她对他动机的推断后来证明是错的。"},{"en":"In his private figurings, he imagined a different future.","zh":"在他私下的想象与思量中，他设想了一个不同的未来。"}]}],"synonyms":["calculations","estimates","numbers","computations","reasonings"],"phonetic":"/ˈfɪɡjərɪŋz/","extraExplanation":["“figurings”在现代英语里最常见的用法偏向“算出来的数/估算”，类似口语里的 numbers / calculations。更口语的说法常见：my calculations、the math、our numbers。","注意：更常见的形式是单数“figuring”或动词短语“figure out（弄明白）/ figure it out”。“figurings”作复数时通常强调“多次计算/多份估算结果”。"]}
{"word":"figurism","summary":{"en":"Figurism is a historical interpretive method that reads Chinese classics as symbolic foreshadowings of Christian ideas, used especially by some Jesuits in early modern China.","zh":"Figurism（预表主义/象征预表解释）是一种历史诠释方法，尤其在近代早期部分在华耶稣会士中出现，用来把中国经典解读为对基督教观念的象征性预示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical approach (especially among some Jesuit missionaries in China in the 1600s–1700s) that interpreted Chinese classical texts and symbols as “figures” or foreshadowings of Christian revelations and Biblical events.","zh":"一种历史性的诠释取向（尤指17—18世纪在华的部分耶稣会传教士），把中国古典典籍与象征解读为基督教启示与《圣经》事件的“预表/象征性预告”。"},"examples":[{"en":"Some Jesuits promoted figurism to connect Confucian classics with Christian theology.","zh":"一些耶稣会士推行“预表主义/象征预表解释”，试图把儒家经典与基督教神学联系起来。"},{"en":"Critics argued that figurism sometimes forced Christian meanings onto Chinese texts.","zh":"批评者认为，“预表主义”有时会把基督教含义硬套到中国文本之上。"}]}],"synonyms":["figurist interpretation","Jesuit figurism","typological reading"],"phonetic":"/ˈfɪɡjəˌrɪzəm/","extraExplanation":["“Figurism”源自基督教的“预表（typology）”传统：认为《旧约》中的人物、事件可作为《新约》的“预像/预表”。在清初语境里，一些在华耶稣会士（如白晋 Joachim Bouvet 等）尝试用这种方式解读《易经》等经典，主张其中含有对基督教真理的隐含预示。","在中西交流史上，figurism 常被视为一种“文化翻译/对话策略”，既反映了传教士寻求共同语言的努力，也暴露了跨文化诠释可能出现的偏读与权力关系。"]}
{"word":"figurist","summary":{"en":"A figurist is either someone who interprets texts symbolically (not literally) or an artist who focuses on the human figure.","zh":"figurist 可指寓意／象征派解读者（尤其用于宗教文本），也可指以人物形象为主的具象艺术家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who interprets words or texts (especially religious texts) in a figurative or symbolic way rather than literally.","zh":"（尤指宗教文本的）寓意派／象征派解读者；主张用比喻、象征来解释文本的人（而非按字面解释）。"},"examples":[{"en":"Some early commentators were figurists who read the story as a symbol of moral change.","zh":"一些早期评注者是寓意派解读者，他们把这个故事理解为道德转变的象征。"},{"en":"He argues like a figurist, looking for hidden meanings in every line.","zh":"他的论证很像寓意派，总在每一句里寻找隐藏含义。"}]},{"partOfSpeech":"n.","definition":{"en":"An artist (or art style) that emphasizes the human figure; a painter or sculptor known for depicting figures.","zh":"人物画家／人物雕塑家；强调人体或人物形象的艺术家（或艺术风格）。"},"examples":[{"en":"She trained as a figurist, focusing on portraits and the human body.","zh":"她受训成为人物画家，专注于肖像与人体。"},{"en":"The gallery contrasts abstract works with a few figurists who paint realistic people.","zh":"画廊把抽象作品与几位画写实人物的艺术家作对照。"}]}],"synonyms":["allegorist","symbolist","nonliteral interpreter","figurative artist","portraitist"],"phonetic":"/ˈfɪɡjərɪst/","extraExplanation":["“figurist”在现代英语里比较少见，常见于两类语境：①神学／圣经诠释：与“literalist（字面主义者）”相对，强调象征、预表、寓意的解读；②艺术评论：指偏“具象人物（figurative）”创作的艺术家。","词源上来自“figure（形象；比喻）+ -ist（…主义者／从事者）”，所以核心含义是“以 figure 的方式理解或创作的人”。"]}
{"word":"figuriste","summary":{"en":"Figuriste is a French-derived noun used in film/theater, meaning either a costume designer or (in some contexts) a person who manages/casts extras.","zh":"Figuriste 是源自法语的名词，多用于影视/戏剧领域，可指“服装设计师”，也可在某些语境中指“群演统筹/群演选角负责人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Borrowed from French) A costume designer or someone who creates/chooses costumes for film, theater, or TV.","zh":"（法语外来词）服装设计师；负责为电影、戏剧或电视设计/挑选服装的人。"},"examples":[{"en":"The figuriste researched 19th-century clothing to make the costumes believable.","zh":"服装设计师研究了19世纪的服饰，让戏服更可信。"},{"en":"In the end credits, she is listed as the figuriste.","zh":"在片尾字幕里，她被标注为“figuriste（服装设计）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some French film/TV contexts) A person responsible for casting or managing background actors (extras).","zh":"（在一些法语影视语境中）群演统筹/群演选角负责人；负责安排背景演员（群众演员）的人。"},"examples":[{"en":"The figuriste asked the extras to line up by costume and height.","zh":"群演负责人让群众演员按服装和身高排队。"},{"en":"If you want to be an extra, you may need to contact the figuriste.","zh":"如果你想当群众演员，可能需要联系群演负责人。"}]}],"synonyms":["costume designer","wardrobe designer","extras casting","background casting"],"phonetic":"/ˌfɪɡjəˈrist/","extraExplanation":["“Figuriste”主要是法语用词，在英语里较少单独使用；你更常在法语片的字幕/演职员表中看到它。不同剧组/地区对它的职责划分不完全一致：有时更偏向“服装（costume designer）”，有时更偏向“群演管理/群演选角（extras casting）”。阅读字幕时可结合上下文判断。"]}
{"word":"figurize","summary":{"en":"“Figurize” is a rare verb meaning to represent something using figures/symbols (or, less commonly, to shape something into a figure).","zh":"“figurize”是个较少见的动词，主要指用数字/符号（或图表）来表示；较少见的意思是把东西塑造成某种形状。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to represent or express something by using figures, symbols, or numbers (rather than words); to put into a form of figures","zh":"用数字、符号或图表来表示（而不是用文字）；把……用“数字/图形化”的方式表达"},"examples":[{"en":"The report figurized the company’s growth with a simple chart.","zh":"报告用一张简单的图表把公司的增长表现出来。"},{"en":"Try to figurize the data so people can understand it quickly.","zh":"尽量把数据图表化，这样大家能更快理解。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to make something into a figure or shape; to form or outline","zh":"（罕见）把……做成某种形状；塑形；勾勒出轮廓"},"examples":[{"en":"In the sculpture workshop, the artist figurized the clay into a human form.","zh":"在雕塑工作坊里，艺术家把黏土塑成了人形。"}]}],"synonyms":["quantify","visualize","chart","express in figures","represent"],"phonetic":"ˈfɪɡjəˌraɪz","extraExplanation":["“figurize”在现代英语中相当少见，更常见的表达是：\n- 用图表/数字表示：visualize the data, chart the results, put it in figures\n- 把文字改成数字/统计口径：quantify\n如果你想表达“用比喻/形象化语言”，更常用 figurative / metaphorical，而不是 figurize。"]}
{"word":"figury","summary":{"en":"“Figury” is not standard English; it is usually Polish for “figures.” In English, use “figure” or “figures.”","zh":"“figury”不是标准英语；通常是波兰语，意为“figures（复数）”。英语请用“figure / figures”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly it is Polish, meaning “figures” (plural of Polish figura). In English, the usual word is “figures” or “figure.”","zh":"这不是标准英语单词；最常见的是波兰语，意思是“人物/图形/数字等的复数”（波兰语 figura 的复数）。英语中通常用 “figures” 或 “figure”。"},"examples":[{"en":"In Polish, “figury” can mean shapes in geometry.","zh":"在波兰语里，“figury”可以指几何“图形”。"},{"en":"If you meant English, you probably want “figures” (plural of “figure”).","zh":"如果你想表达英语，通常应该用“figures”（“figure”的复数）。"}]}],"synonyms":["figures","figure"],"phonetic":"/ˈfɪɡjɚ/","extraExplanation":["在英语学习语境中，如果你是在读英文文章时看到“figury”，它很可能是拼写错误、外来语（如波兰语文本/人名/标题），或是特定圈子里的用词。英语里最接近、最常用的对应词是 figure / figures。","英语的 figure 很常见，含义会随语境变化：可以指“数字/数据（figures）”、“人物（a public figure）”、“身材（a slim figure）”、“图形/图表（figures in a textbook）”。如果你告诉我你看到它的句子，我可以帮你判断该用哪一种。"]}
{"word":"figworm","summary":{"en":"A figworm is a larva that infests and eats figs.","zh":"figworm 指蛀食无花果的昆虫幼虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a caterpillar-like larva that feeds on figs, especially the larva of certain moths that infest fig fruit","zh":"无花果虫；以无花果为食、会蛀食果实的昆虫幼虫（常指某些蛾类的幼虫）"},"examples":[{"en":"The farmer found figworms inside some of the ripening figs.","zh":"农夫在一些快成熟的无花果里发现了无花果虫。"},{"en":"To prevent figworm damage, they removed fallen fruit and checked traps regularly.","zh":"为了防止无花果虫危害，他们清理落果并定期检查诱捕器。"}]}],"synonyms":["fig moth larva","moth larva","fruit-worm"],"phonetic":"/ˈfɪɡˌwɝm/","extraExplanation":["“figworm”在日常英语中很少见，更常见的说法是更具体的名称，例如“fig moth larva（蛾的幼虫）”或直接说“worms in figs（无花果里的虫）”。","不要和“figwort（玄参，一种植物）”混淆：一个是害虫/幼虫（worm），一个是植物（wort）。"]}
{"word":"figwort","summary":{"en":"Figwort is a wild flowering plant (Scrophularia) sometimes associated with traditional herbal use.","zh":"Figwort 指玄参属的一类野生开花植物，有时与传统草药用途相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of wild plant (genus *Scrophularia*) with small flowers, sometimes used in traditional herbal medicine","zh":"玄参属（*Scrophularia*）的一类野生植物，开小花；有时用于传统草药"},"examples":[{"en":"We saw figwort growing along the damp edge of the trail.","zh":"我们在小路潮湿的边缘看到玄参在生长。"},{"en":"In some traditions, figwort was used as an herbal remedy, though modern evidence is limited.","zh":"在一些传统中，玄参曾被当作草药使用，但现代证据有限。"}]}],"synonyms":["scrophularia"],"phonetic":"/ˈfɪɡˌwɝːt/","extraExplanation":["“figwort”里的“wort”是古英语来源，意思是“草本植物/药草”（现代英语里常出现在植物名中，如 *St. John’s wort*）。","figwort 这个名字与“fig（无花果）”并不是指它结无花果，而多半与植物形态或旧时的民间联想有关。","玄参属有些种在中药里也会出现，但具体“figwort”在英语语境下通常指野生的 *Scrophularia* 植物；不要把它等同于某一种固定的中药材。"]}
{"word":"figworts","summary":{"en":"Figworts are wild flowering plants in the genus *Scrophularia* (plural of figwort).","zh":"Figworts 指玄参属（*Scrophularia*）的野生开花植物，是 figwort 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of wild flowering plant (genus *Scrophularia*) with small greenish-brown or reddish flowers; the plural form of *figwort*","zh":"一种野生开花植物（玄参属 *Scrophularia*）；*figwort* 的复数形式"},"examples":[{"en":"Figworts often grow in damp, shady places like stream banks.","zh":"玄参属植物常生长在潮湿、阴凉的地方，比如溪流岸边。"},{"en":"Some gardeners plant figworts to attract pollinators and beneficial insects.","zh":"有些园丁会种玄参属植物来吸引传粉昆虫和益虫。"}]}],"synonyms":["figwort","Scrophularia","carpenter’s square (one species name)","common figwort"],"phonetic":"ˈfɪɡˌwɝt","extraExplanation":["“Figwort(s)” 里的 fig- 并不是说这种植物会结无花果，而是因为它的根部或结节在外形上有时被认为像“无花果”。","历史上它与英文医学名 *scrofula*（旧时对淋巴结结核等疾病的称呼）有关，因此学名属名为 *Scrophularia*。在传统草药里曾被用来外敷或入药，但现代使用应谨慎，最好咨询专业人士。","它在英语里也常见于植物图鉴、自然写作或园艺语境；日常口语中并不常用。"]}

