{"word":"fike","summary":{"en":"“Fike” is a regional word meaning to fuss or fidget, or the fussing itself.","zh":"“fike”是方言词，常指“忙乱/坐立不安”，也可指“一阵忙乱”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Scotland, Northern England) to fuss, fidget, or move about restlessly, often because you’re nervous, impatient, or trying to get something done.","zh":"（苏格兰、英格兰北部方言）忙乱、坐立不安、焦躁地动来动去；常因紧张、不耐烦或想把事情弄好。"},"examples":[{"en":"Stop fiking and sit still for a minute.","zh":"别再坐立不安了，先安静坐一会儿。"},{"en":"He was fiking around the room, looking for his keys.","zh":"他在房间里忙乱地走来走去找钥匙。"},{"en":"I always fike when I’m waiting for important news.","zh":"我在等重要消息时总会焦躁不安。"}]},{"partOfSpeech":"vt.","definition":{"en":"to handle something in a fussy, restless way; to keep fiddling with something.","zh":"（带着焦躁/小题大做的样子）摆弄、折腾某物；不停地弄来弄去。"},"examples":[{"en":"She kept fiking with the buttons on her coat.","zh":"她不停地摆弄外套上的纽扣。"},{"en":"Don’t fike the settings too much or it may stop working.","zh":"别一直乱调设置，不然可能会坏。"}]},{"partOfSpeech":"n.","definition":{"en":"a state of fussing or restless activity; a flurry.","zh":"忙乱；坐立不安的状态；一阵折腾。"},"examples":[{"en":"There was a right fike at the door when the taxi arrived.","zh":"出租车一到，门口就一阵忙乱。"},{"en":"All that fike over nothing made everyone tired.","zh":"为了没什么大事的一通折腾把大家都累坏了。"}]}],"synonyms":["fidget","fuss","flutter","bustle","fiddle"],"phonetic":"/faɪk/","extraExplanation":["“fike”多见于苏格兰与英格兰北部的口语/方言，在标准英语里不算常用。写作中常用来营造地域色彩或人物口吻。","容易与拼写相近的“fyke（鱼笼/网具）”混淆；在渔业语境里更常见的是“fyke net”。"]}
{"word":"fiked","summary":{"en":"“fiked” is not a standard English word; it is most likely a misspelling of “fixed” (repaired/corrected or not changing).","zh":"“fiked” 不是标准英文单词；最可能是把 “fixed”（修好的/纠正过的；或固定不变的）拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “fixed”) repaired, corrected, or made to work properly; not broken.","zh":"（可能想写：fixed）修好的；纠正过的；能正常运作的。"},"examples":[{"en":"The screen is fixed now, so it turns on normally.","zh":"屏幕现在修好了，所以能正常开机。"},{"en":"I fixed the spelling mistakes in your essay.","zh":"我把你作文里的拼写错误改好了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “fixed”) staying the same; not changing; set in place.","zh":"（可能想写：fixed）固定的；不变的；被设定好的。"},"examples":[{"en":"We have a fixed schedule every week.","zh":"我们每周都有固定的时间表。"},{"en":"The camera is in a fixed position.","zh":"相机在一个固定的位置。"}]},{"partOfSpeech":"vt.","definition":{"en":"(From the verb “fix”) to repair, correct, or arrange something.","zh":"（动词 fix）修理；纠正；安排/处理。"},"examples":[{"en":"Can you fix my bike before tomorrow?","zh":"你能在明天之前修好我的自行车吗？"},{"en":"Let’s fix a time to meet.","zh":"我们定个时间见面吧。"}]}],"synonyms":["repaired","corrected","set","stable"],"phonetic":"/fɪkst/","extraExplanation":["“fiked” 不是常见或标准的英文单词，通常是拼写错误。最常见的可能目标词是：\n1) fixed（修好的/固定的；fix 的过去式/过去分词）\n2) faked（伪造的；fake 的过去式/过去分词）\n如果你告诉我原句（例如：I fiked it.），我可以帮你判断到底想表达哪一个。"]}
{"word":"fikery","summary":{"en":"“Fikery” is not a standard spelling; it is most likely meant to be “fakery,” meaning deception or making fake things.","zh":"“fikery”不是标准拼写，多半是想写“fakery”，意思是造假、欺骗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled **fakery**) the act of faking something; dishonest imitation or deception.","zh":"（常见拼写为 **fakery**）造假行为；仿冒；欺骗。"},"examples":[{"en":"The online reviews were pure fakery, written by the seller.","zh":"这些网购评价完全是造假，是卖家自己写的。"},{"en":"The museum removed the painting after experts found signs of fakery.","zh":"专家发现有造假迹象后，博物馆把那幅画撤下了。"}]}],"synonyms":["deception","fraud","counterfeiting","trickery"],"phonetic":"/ˈfeɪkəri/","extraExplanation":["“fikery”并不是常见的标准英文拼写。你很可能想查的是 **fakery**（造假、欺骗）。","如果你想表达“漂亮的衣服/华丽装饰”，更常用的是 **finery**（华服；华丽的装饰）。","也可能是人名、店名或自造词；如果你能提供一句原文语境，我可以更准确判断你要找的词。"]}
{"word":"fikey","summary":{"en":"“fikey” isn’t a standard English word; it’s probably a typo or a name. Share context to identify the intended word.","zh":"“fikey”不是标准英语单词，多半是拼写错误或名字；给出上下文才能判断你想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/username. If you meant a different word, the meaning will depend on the intended spelling (for example, “finicky,” “spiky,” or “fickle”).","zh":"不是标准英语单词；更可能是拼写错误，或是人名/用户名等专有用法。若你想写的是其他单词（如 finicky、spiky、fickle 等），含义会取决于正确拼写。"},"examples":[{"en":"I couldn’t find “fikey” in a dictionary—can you share the sentence where you saw it?","zh":"我在词典里找不到“fikey”——你能把它出现的句子发我吗？"},{"en":"If you meant “fickle,” it describes someone who changes their mind easily.","zh":"如果你想写的是“fickle”，它形容一个人容易改变主意、态度不稳定。"}]}],"phonetic":"/ˈfaɪki/","extraExplanation":["“fikey”常见于拼写输入错误或网络用户名/昵称。为了帮你准确查词，请把它所在的完整句子贴出来，或告诉我你想表达的中文意思。","你也可以核对是否想写：fickle（善变的）、finicky（挑剔的/难伺候的）、spiky（尖刺的/棘手的，口语也可指“有点冲/带刺”）。"]}
{"word":"fikh","summary":{"en":"Fiqh (often misspelled as “fikh”) means Islamic jurisprudence—the study and interpretation of Islamic law.","zh":"Fiqh（常被拼作“fikh”）指伊斯兰教法学，即对伊斯兰法的研究与解释。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Islamic jurisprudence; the human understanding and interpretation of Islamic law (Sharia) based on sources like the Qur’an and the teachings/practices of the Prophet Muhammad (Hadith).","zh":"伊斯兰教法学；对伊斯兰法（沙里亚）的人的理解与解释，通常依据《古兰经》和圣训（先知穆罕默德的言行记录）。"},"examples":[{"en":"She is studying fiqh to understand how Islamic legal rulings are derived.","zh":"她在学习伊斯兰教法学，以了解伊斯兰法律裁决是如何推导出来的。"},{"en":"Different schools of fiqh may reach different conclusions on the same issue.","zh":"不同的教法学派可能会对同一问题得出不同结论。"}]}],"synonyms":["Islamic jurisprudence","Islamic legal theory"],"phonetic":"/fiːk/","extraExplanation":["“fikh”更常见的英语拼写是“fiqh”，来自阿拉伯语“فقه”。在英文语境中多用于学术讨论或宗教研究。","注意区分：Sharia（沙里亚）通常指“伊斯兰法/神圣法”的整体概念；fiqh（教法学）更强调“人对法律的解释与推理”，因此在不同学派之间可能出现差异。"]}
{"word":"fikie","summary":{"en":"“Fikie” is not a standard English word; it’s likely a typo or a name.","zh":"“fikie”不是标准英语词；多半是拼写错误或人名/网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name/username. If you meant a different word, please share the sentence you saw it in.","zh":"这不是标准英语单词；更可能是拼写错误，或是人名/网名。请提供它出现的句子，或告诉我你想查的词。"},"examples":[{"en":"I can’t find “fikie” in a regular English dictionary—could it be a typo?","zh":"我在常规英语词典里找不到“fikie”——它会不会是拼写错误？"},{"en":"If you paste the full sentence, I can guess what “fikie” was meant to be.","zh":"如果你把完整句子贴出来，我可以帮你判断“fikie”可能原本想写什么。"}]}],"phonetic":"/ˈfɪki/","extraExplanation":["“fikie”最常见的情况是把别的词打错了。几个可能的目标词（要看语境）：\n1) fickle（adj. 易变的，反复无常的）\n2) pixie（n. 小精灵；也可指“精灵感”的人）\n3) fakie（n./adj. 滑板/单板术语：反脚姿势或用反脚滑行）\n把你看到它的上下文发我（例如前后各一句），我就能更准确地确定。"]}
{"word":"fiking","summary":{"en":"“Fiking” isn’t a standard English word; it’s likely a misspelling (often “Viking” or “hiking,” depending on context).","zh":"“fiking”不是标准英文词，通常是拼写错误（常见可能是“Viking”或“hiking”，需看语境）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling/typo of another word (often “Viking” or “hiking,” depending on context).","zh":"不是标准英文单词。通常是把其他单词拼错了（常见可能是“Viking（维京人）”或“hiking（徒步旅行）”，取决于语境）。"},"examples":[{"en":"I can’t find “fiking” in the dictionary—did you mean “Viking” or “hiking”?","zh":"我在词典里找不到“fiking”——你是想写“Viking”还是“hiking”？"},{"en":"If you meant “hiking,” you could say: “We’re going hiking this weekend.”","zh":"如果你想写“hiking”，你可以说：“我们这周末去徒步。”"},{"en":"If you meant “Viking,” you could say: “Vikings were seafarers from Scandinavia.”","zh":"如果你想写“Viking”，你可以说：“维京人是来自斯堪的纳维亚的航海者。”"}]}],"phonetic":"/ˈfaɪkɪŋ/","extraExplanation":["“fiking”有时也可能是把英语粗口“f**king”打错了（少打/换了字母）。如果你是在表达情绪或强调语气，建议在正式场合避免使用粗口；也可以改用更礼貌的替代表达，如“really / very / extremely”。","如果你把你想表达的整句话发给我，我可以帮你判断最可能的正确拼写，并给出更自然的用法。"]}

