{"word":"FIM","summary":{"en":"FIM most commonly refers to the international governing body for motorcycle sport; it can also be an organization-specific abbreviation with a different meaning.","zh":"FIM 最常指摩托车运动的国际管理机构；也可能是某个组织内部使用的其他缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Fédération Internationale de Motocyclisme: the international governing body for motorcycle racing and related sports (it sets rules, issues licenses, and organizes world championships).","zh":"（缩写）国际摩托车联合会：摩托车竞赛及相关运动的国际管理机构（制定规则、发放执照并管理世界锦标赛等）。"},"examples":[{"en":"The FIM updated the safety rules for the new season.","zh":"FIM 更新了新赛季的安全规则。"},{"en":"He needs an FIM license to race internationally.","zh":"他需要 FIM 执照才能参加国际比赛。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Used in some workplaces/schools for internal terms (the exact meaning depends on the organization), such as “Final Inspection Meeting” or similar.","zh":"（缩写）在一些公司/学校中作为内部简称使用（具体含义因单位而异），例如“最终检查会议”等。"},"examples":[{"en":"The email says the FIM is scheduled for Friday—ask what it stands for in your company.","zh":"邮件说周五有 FIM——最好确认在你们公司里它具体代表什么。"}]}],"synonyms":["Fédération Internationale de Motocyclisme"],"phonetic":"/ˌɛf.aɪˈɛm/","extraExplanation":["在体育语境里，FIM 最常见指“国际摩托车联合会”（法语名称缩写）。在英文新闻中常见搭配有：FIM rules（规则）、FIM license（执照）、FIM World Championship（FIM 世界锦标赛）。","如果你是在工作/学习的邮件或表格里看到 FIM，它很可能是单位自定义缩写；最可靠的方法是查看术语表、会议议程或直接询问发件人。"]}
{"word":"fimble","summary":{"en":"Fimble is a rare old/dialect word meaning “thimble,” the small finger cap used for sewing.","zh":"Fimble 是一个罕见的旧式/方言词，意思是“顶针”（缝纫时保护手指的小护套）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, dialect/old-fashioned) A small protective cap worn on a finger when sewing; a thimble.","zh":"（罕见；方言/旧式用法）缝纫时戴在手指上的小护套；顶针。"},"examples":[{"en":"She pushed the needle through the cloth with a fimble to protect her finger.","zh":"她戴着顶针，用针穿过布料来保护手指。"},{"en":"In some old texts, fimble is just another spelling of thimble.","zh":"在一些旧文本中，fimble 只是 thimble（顶针）的另一种拼写。"}]}],"synonyms":["thimble"],"phonetic":"/ˈfɪmbəl/","extraExplanation":["“fimble”在现代英语里非常少见，多数学习者几乎不会在日常对话中遇到。更常见、标准的词是“thimble”。","它常被视为“thimble”的旧拼写或方言变体；阅读古文、地方故事或旧词典时可能会见到。"]}
{"word":"fimbles","summary":{"en":"“Fimbles” most commonly refers to the British children’s TV show/characters The Fimbles; as a normal noun, it can also be the rare plural of “fimble.”","zh":"“Fimbles”最常见是指英国儿童节目/角色《The Fimbles》；作为普通名词时，也可能是罕见词“fimble”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) A British children’s TV series (and its main characters) about small, furry creatures who explore the everyday world.","zh":"（专有名词）英国儿童电视节目《The Fimbles》（及其主要角色），讲的是一群毛茸茸的小生物探索日常世界。"},"examples":[{"en":"My younger cousin used to watch The Fimbles every morning.","zh":"我表弟以前每天早上都看《The Fimbles》。"},{"en":"The Fimbles are curious characters who learn by exploring.","zh":"Fimbles 这些角色很好奇，会通过探索来学习。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) The plural form of “fimble,” a rare word that can refer to something fringed or fibrous (often used in older/technical contexts).","zh":"（较少见）“fimble”的复数；这是个很少用的词，在较旧或较专业的语境中可指带流苏/纤维状的东西。"},"examples":[{"en":"In older descriptions, the plant was noted for its fimbles along the edge.","zh":"在较旧的描述里，这种植物被提到边缘有纤维状的“fimbles”。"}]}],"synonyms":["The Fimbles (TV show)"],"phonetic":"/ˈfɪmbəlz/","extraExplanation":["《The Fimbles》在英国（尤其是 2000 年前后）比较有名，常在 BBC/CBeebies 播出，风格偏温和、启蒙，适合学龄前儿童。很多英国人提到“Fimbles”会立刻联想到童年电视节目，而不是词典里的普通名词。"]}
{"word":"fimbria","summary":{"en":"Fimbria means a fringe-like border; in anatomy it often refers to small fingerlike structures (fimbriae) or the fimbria of the hippocampus.","zh":"Fimbria 指“流苏状的边缘/缘毛结构”；在解剖学中常指伞缘样的小突起（fimbriae）或“海马伞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fringe-like border or edge, especially a small, fingerlike or fringe-shaped structure in anatomy or biology.","zh":"（尤指解剖学/生物学中的）缘毛状结构；边缘的流苏状部分；指状的小突起。"},"examples":[{"en":"The doctor pointed out the fimbriae at the end of the fallopian tube.","zh":"医生指出输卵管末端的伞缘（fimbriae）。"},{"en":"In anatomy class, we learned that a fimbria can look like a fringe or a row of tiny fingers.","zh":"在解剖课上我们学到，fimbria 看起来像流苏或一排细小的“手指”。"}]},{"partOfSpeech":"n.","definition":{"en":"In neuroanatomy, a band of white-matter fibers along the hippocampus (often called the fimbria of the hippocampus).","zh":"（神经解剖）海马伞：位于海马旁的一束白质纤维带（常称 fimbria of the hippocampus）。"},"examples":[{"en":"The MRI report mentioned signal changes near the fimbria of the hippocampus.","zh":"核磁共振报告提到海马伞附近的信号改变。"},{"en":"The fimbria connects with other fiber pathways involved in memory processing.","zh":"海马伞与其他与记忆处理相关的纤维通路相连。"}]},{"partOfSpeech":"n.","definition":{"en":"In botany or zoology, a fringe, bristle, or borderlike appendage on a plant or animal structure.","zh":"（动植物学）植物或动物结构上的流苏状、缘毛状附属物。"},"examples":[{"en":"Some leaves have a fimbria along the margin that looks like fine hairs.","zh":"有些叶片边缘有缘毛（fimbria），看起来像细细的毛。"}]}],"synonyms":["fringe","border","edge","appendage"],"phonetic":"/ˈfɪm.bri.ə/","extraExplanation":["词源：来自拉丁语 fimbria，原意是“边缘、流苏”。所以在英语里它常用来描述“像流苏一样的边缘/缘毛”。","常见用法提示：医学语境里更常见复数 fimbriae（如输卵管伞缘）；神经解剖里常见搭配 fimbria of the hippocampus。"]}
{"word":"fimbria-related","summary":{"en":"Fimbria-related means connected to or involving a fimbria, especially the fringe-like ends of the fallopian tube in anatomy/medicine.","zh":"Fimbria-related 指“与伞缘/流苏状边缘结构（尤其是输卵管伞端）有关的”，常用于医学与解剖语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected to, involving, or affecting a fimbria (a fringe-like structure, especially in anatomy, such as the finger-like ends of the fallopian tube).","zh":"与伞缘/纤毛缘（fimbria，指边缘呈“流苏状/指状”的结构，尤指解剖学中的结构，如输卵管伞端）有关的；涉及或影响该结构的。"},"examples":[{"en":"The doctor discussed possible fimbria-related damage after the infection.","zh":"医生谈到了感染后可能出现的与输卵管伞端相关的损伤。"},{"en":"Researchers studied fimbria-related changes in the fallopian tube tissue.","zh":"研究人员分析了输卵管组织中与伞端相关的变化。"}]}],"synonyms":["fimbrial","fimbrial-related","related to the fimbriae"],"phonetic":"/ˈfɪm.bri.ə rɪˈleɪ.tɪd/","extraExplanation":["“fimbria”源自拉丁语，原意是“边缘、流苏”。在医学语境里常指“边缘呈流苏/指状的结构”。最常见的搭配是妇科解剖中的“输卵管伞（fimbriae of the fallopian tube）”，其作用是帮助“扫入/捕捉”卵子进入输卵管。","在学术写作中，“fimbria-related”通常作为复合形容词修饰名词（如 damage, inflammation, lesion, tissue changes）。更正式或更具体时也常直接写成“fimbrial”或“fimbrial-related”（例如：fimbrial inflammation）。","不要与“fimbriated”（意为“有流苏状边缘的”）混淆；“fimbria-related”强调“与……有关/相关”，而不是描述外观本身。"]}
{"word":"fimbriae","summary":{"en":"Fimbriae are small, hair-like structures—especially on bacteria—that help them attach to surfaces or cells; in anatomy, it can mean fringe-like projections.","zh":"Fimbriae 指细小的毛发状结构，尤指细菌上的菌毛，用于黏附表面或细胞；在解剖学中也可指流苏状的突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hair-like structures on some bacteria that help them stick to surfaces or host cells; often important in infection.","zh":"（细菌的）菌毛：一些细菌表面的毛发状结构，帮助其黏附在表面或宿主细胞上；常与感染有关。"},"examples":[{"en":"Some bacteria use fimbriae to attach to cells in the urinary tract.","zh":"一些细菌利用菌毛黏附在泌尿道细胞上。"},{"en":"Without fimbriae, the bacteria were less able to cling to the surface.","zh":"没有菌毛时，细菌就不太能黏在表面上。"}]},{"partOfSpeech":"n.","definition":{"en":"Fringe-like edges or small finger-like projections in anatomy (less common in everyday English).","zh":"（解剖学）流苏状边缘或小的指状突起（在日常英语中较少见）。"},"examples":[{"en":"In anatomy, the term may refer to fimbriae near the fallopian tube.","zh":"在解剖学中，这个词有时指输卵管附近的伞缘（伞状突起）。"}]}],"synonyms":["fimbria (singular form)","bacterial adhesion structures","pili (sometimes used in overlapping ways)"],"phonetic":"/ˈfɪm.bri.iː/","extraExplanation":["“Fimbriae”是复数形式，单数是“fimbria”。在微生物学里常用复数，因为细菌表面通常有许多根菌毛。","微生物学中常把“fimbriae”与“pili（菌毛/性菌毛）”区分：很多教材里fimbriae偏向“黏附用的短而多的结构”，而某些pili（尤其是sex pilus）更与细菌接合、DNA转移相关；不过不同资料的用法可能会有重叠。","词源来自拉丁语“fimbria”，意为“边缘、流苏”，因此在解剖学里也可表示“边缘像流苏的结构”。"]}
{"word":"fimbrial","summary":{"en":"Fimbrial means “related to fimbriae,” fringe-like or finger-like anatomical structures.","zh":"Fimbrial 指“与伞缘/缘毛（fimbriae）有关的”，描述流苏状或指状的解剖结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to fimbriae—small, finger-like or fringe-like structures, especially in anatomy (for example, the fimbriae at the end of the fallopian tube).","zh":"与“伞缘/缘毛（fimbriae）”有关的；指小的指状或流苏状结构，尤用于解剖学（如输卵管末端的伞缘）。"},"examples":[{"en":"The doctor examined the fimbrial end of the fallopian tube.","zh":"医生检查了输卵管末端的伞缘部位。"},{"en":"Inflammation near the fimbrial region can affect fertility.","zh":"伞缘附近的炎症可能影响生育能力。"}]}],"synonyms":["fringed (general)","fimbria-related (technical)"],"phonetic":"/ˈfɪm.bri.əl/","extraExplanation":["“Fimbrial”常见于医学与生物学语境，日常英语里很少用。它来自拉丁语 fimbria，意为“流苏、边饰”。在解剖学中最常被提到的是输卵管的 fimbriae（伞缘），其作用是帮助把卵子引导进输卵管。","不要和“fibrous（纤维性的）”混淆：fimbrial 强调“边缘有流苏/指状突起”的结构特征，而不是“纤维”。"]}
{"word":"fimbriate","summary":{"en":"Fimbriate describes something with a fringed, hair-like edge, mainly in scientific contexts; it can also mean to form or give such a fringe.","zh":"fimbriate 主要用于科学语境，指“边缘呈流苏/细毛状”的；也可作动词表示“使……呈流苏状”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a fringe or a border of fine, hair-like parts (especially in biology or botany).","zh":"（尤指生物学/植物学）有流苏状边缘的；边缘具细毛或穗状结构的。"},"examples":[{"en":"Under the microscope, the leaf edge looked fimbriate, with tiny hair-like projections.","zh":"在显微镜下，叶片边缘呈流苏状，有细小的毛状突起。"},{"en":"Some fungal structures are described as fimbriate because their margins appear fringed.","zh":"某些真菌结构会被描述为 fimbriate，因为它们的边缘看起来像带流苏。"}]},{"partOfSpeech":"v.","definition":{"en":"To fringe or decorate with a fringe; to form a fringed edge.","zh":"使成流苏状；在……边缘形成穗状/毛状边。"},"examples":[{"en":"The petals are fimbriated along the edges in some varieties.","zh":"在某些品种中，花瓣边缘呈流苏状（被“fimbriated”）。"},{"en":"Tiny cilia fimbriate the surface, giving it a feathery look.","zh":"细小的纤毛使表面呈流苏状，看起来像羽毛一样。"}]}],"synonyms":["fringed","ciliate","fimbriated"],"phonetic":"/ˈfɪm.bri.eɪt/","extraExplanation":["这是一个偏“学术/描述性”的词，常见于生物学、植物学、真菌学与医学解剖描述中；日常英语里很少用。","词源来自拉丁语 *fimbria*（意为“流苏、边饰”）。因此它常用来描述“边缘像流苏一样分裂或有细毛”。","相关词：*fimbria*（流苏状结构；如输卵管的伞端）、*fimbriated*（形容词：具流苏边的）、*fringed*（更日常的“有流苏的/有边饰的”）。"]}
{"word":"fimbriate-dentate","summary":{"en":"A botanical adjective meaning “fringed and toothed along the edge.”","zh":"植物学形容词，表示边缘“既流苏状又齿状”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a margin that is both fringed (with fine hair-like or thread-like projections) and toothed (with tooth-like points). Used mainly in botany to describe the edge of leaves, petals, bracts, etc.","zh":"（多用于植物学）边缘同时具有“流苏状/须状细裂”（fimbriate）和“齿状突起”（dentate）的形态；常用来描述叶片、花瓣、苞片等的边缘。"},"examples":[{"en":"Under the hand lens, the petal margin appears fimbriate-dentate.","zh":"用放大镜观察，花瓣边缘呈流苏状并带齿。"},{"en":"The field guide notes a fimbriate-dentate leaf margin as a key identification feature.","zh":"野外图鉴把“流苏状齿缘”记为重要的鉴别特征。"}]}],"synonyms":["fringed-toothed","fimbriate and dentate"],"phonetic":"/ˈfɪmbriˌeɪt ˈdɛnteɪt/","extraExplanation":["这是一个形态学复合形容词：fimbriate（边缘具细丝/流苏状裂片）+ dentate（边缘具较明显、向外突出的齿）。连字符表示两种特征同时存在，而不是二选一。","常见近义描述会写成“fimbriate and dentate margin / margins fimbriate, dentate”，但在植物志或检索表里常用这种紧凑的复合写法。","辨别小技巧：dentate 的“齿”通常比 serrate（锯齿状）更像‘牙齿’那样比较粗短、突起更明显；fimbriate 更像边缘长出细小的‘毛穗/流苏’。"]}
{"word":"fimbriated","summary":{"en":"Fimbriated means “fringed” or “having fimbriae,” especially used in biology.","zh":"fimbriated 指“带流苏状边缘的”或“带菌毛/绒毛等细小毛状结构的”，多用于生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a fringe or fringe-like edge; in biology, having small hair-like structures (fimbriae) on the surface.","zh":"带流苏（穗边）的；（生物学）表面带有细小毛状结构（菌毛/绒毛）的。"},"examples":[{"en":"The fimbriated leaf edges looked like they were lined with tiny threads.","zh":"叶缘呈流苏状，看起来像镶了一圈细细的线。"},{"en":"Some bacteria are described as fimbriated because they have fimbriae that help them attach to cells.","zh":"有些细菌被称为“fimbriated”，因为它们有菌毛，能帮助其附着在细胞上。"}]}],"synonyms":["fringed","tasseled","ciliate (biological context)"],"phonetic":"/ˈfɪm.briˌeɪ.tɪd/","extraExplanation":["“fimbriated”来自拉丁语词根 fimbria（意为“流苏、穗边”）。在日常英语里较少见，更多出现在植物学、动物学、微生物学或医学写作中，用来描述“边缘呈穗状/流苏状”或“表面有菌毛（fimbriae）”。","生物学里 fimbriae（菌毛）不同于 flagella（鞭毛）：菌毛通常更短、更细，主要用于黏附和定植（例如帮助细菌黏在组织表面），而鞭毛更常与运动相关。"]}
{"word":"fimbriating","summary":{"en":"Fimbriating describes something that is fringed—having many small, threadlike projections (fimbriae), especially in biology or botany.","zh":"fimbriating 指“具缘毛的、边缘呈流苏状的”，常用于生物学或植物学中描述带细小丝状突起（缘毛/fimbriae）的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Botany) Having a fringe or many small threadlike projections (fimbriae); fringed along an edge.","zh":"（生物/植物）具缘毛的；边缘呈流苏状、带许多细小丝状突起（缘毛/fimbriae）的。"},"examples":[{"en":"Under the microscope, the bacterium showed a fimbriating surface used for attachment.","zh":"在显微镜下，这种细菌表面呈现具缘毛的结构，用于附着。"},{"en":"The description notes a fimbriating margin on the leaf, like tiny hairs along the edge.","zh":"描述指出叶片边缘具缘毛，像边上长着细小的毛一样。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) The act of forming fringes or fimbriae; developing a fringed edge.","zh":"（较少见）形成缘毛/流苏状边缘的过程；使边缘变成具缘毛的。"},"examples":[{"en":"In some species, the tissue begins fimbriating during early development.","zh":"在某些物种中，组织会在早期发育阶段开始形成缘毛状结构。"}]}],"synonyms":["fringed","fimbriate","ciliate (in some biological contexts)","hairy-edged (informal)"],"phonetic":"/ˈfɪm.briˌeɪ.tɪŋ/","extraExplanation":["“fimbriating”来自拉丁语 fimbria（“流苏、边饰”）。在日常英语里很少用，多见于生物学、医学与植物学的形态描述（例如细菌的菌毛/黏附结构、叶缘或器官边缘的细小突起）。","相关词：fimbriate（adj. 具缘毛的；也可作动词“使具缘毛”）、fimbriae（n. 复数，缘毛/菌毛）。"]}
{"word":"fimbriation","summary":{"en":"Fimbriation means a thin contrasting border (often in heraldry) or a fringe-like edge in biology/botany.","zh":"fimbriation 指（常见于纹章学的）细窄对比色镶边，或（生物/植物）流苏状边缘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A narrow border or edging added to a design (especially in heraldry), often in a contrasting color to make the main shape stand out.","zh":"（尤用于纹章学）在图案边缘加的一道窄边/镶边，常用对比色来突出主要图形。"},"examples":[{"en":"In the coat of arms, the cross is outlined with a thin silver fimbriation to separate it from the blue background.","zh":"在这枚纹章中，十字外沿加了一道细细的银色镶边，用来把它与蓝色底色区分开。"},{"en":"The designer used fimbriation around the emblem so it wouldn’t blend into the flag’s field.","zh":"设计者在徽记周围加了镶边，避免它和旗底融在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/botany, a fringe-like margin or the state of having a fringed edge.","zh":"（生物/植物）流苏状的边缘；具流苏边缘的状态。"},"examples":[{"en":"The petal’s fimbriation gives the flower a delicate, fringed look.","zh":"花瓣的流苏状边缘让花看起来更精致、带有蕾丝感。"},{"en":"Some leaves show slight fimbriation along the edges under a microscope.","zh":"在显微镜下，有些叶片边缘能看到轻微的流苏状结构。"}]}],"synonyms":["border","edging","outline","fringe","margin"],"phonetic":"/ˌfɪm.briˈeɪ.ʃən/","extraExplanation":["词源来自拉丁语 fimbria，意为“边缘、流苏”。因此它常与“边、缘、镶边、流苏”相关。","在纹章学里，fimbriation 的作用很实用：用一条很细的对比色线把图形从背景中“分离”出来，提升辨识度。"]}
{"word":"fimbriatum","summary":{"en":"Fimbriatum is a Scientific Latin term in species names meaning “fringed” (having a fringe-like edge).","zh":"Fimbriatum 是生物学命名中的科学拉丁语用词，意思是“具流苏状边缘的／有缘毛的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Scientific Latin, used in biological names) “Fringed” or “having a fringe,” describing an edge or surface with fine projections or hair-like parts.","zh":"（科学拉丁语，用于生物学命名）“具流苏状边缘的／有缘毛的”，形容边缘或表面带有细小突起、绒毛或“流苏”般结构。"},"examples":[{"en":"In the species name *Epidendrum fimbriatum*, **fimbriatum** means the plant has fringed parts.","zh":"在物种名 *Epidendrum fimbriatum* 中，**fimbriatum** 表示这种植物的某些部位具有“流苏状边缘”。"},{"en":"The description notes a **fimbriatum** margin, meaning the edge looks finely frayed or fringed.","zh":"描述中提到 **fimbriatum** 的边缘，意思是边缘看起来细细裂散、呈流苏状。"}]}],"synonyms":["fringed","fimbriate"],"phonetic":"/fɪm.briˈeɪ.təm/","extraExplanation":["**词源**：来自拉丁语 *fimbriatus*（“有流苏的、具缘毛的”），与 *fimbria*（“流苏、边饰”）同源。","**命名用法小提示**：在生物分类学中，*fimbriatum* 常作为“种加词/种小名”（specific epithet）。它是拉丁语中性单数形式，用来和属名的语法性别与格一致（因此你也会见到 *fimbriata*、*fimbriatus* 等不同形式）。","**相关常见词**：英语形容词 *fimbriate* 也表示“具流苏状边缘的”，在植物学与动物学形态描述中很常见。"]}
{"word":"fimbricate","summary":{"en":"Fimbricate describes something fringed or (especially in botany) overlapping in layers like shingles.","zh":"Fimbricate 指“具流苏状边缘的”，或（尤指植物学）“像屋瓦一样层层重叠的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having a fringe or fringed edge; often with small, threadlike projections along the margin.","zh":"（植物学/动物学）具流苏状边缘的；边缘有细小丝状突起的。"},"examples":[{"en":"The leaf margins are fimbricate, with tiny hair-like strands.","zh":"这种叶片的边缘呈流苏状，带有细小的毛状丝。"},{"en":"Under the microscope, the structure looks fimbricate along the rim.","zh":"在显微镜下，这个结构的边缘看起来呈流苏状。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany) Overlapping in layers, like shingles or tiles.","zh":"（植物学）层层重叠的，像屋瓦一样覆盖的。"},"examples":[{"en":"The bud scales are fimbricate, forming a tight protective cover.","zh":"芽鳞呈层层重叠状，形成紧密的保护层。"},{"en":"Some petals appear fimbricate where they overlap near the base.","zh":"有些花瓣在基部重叠处呈层叠状。"}]},{"partOfSpeech":"v.","definition":{"en":"To make or arrange so that parts overlap in layers or form a fringed edge (rare in everyday English).","zh":"使……呈层叠或流苏状排列（日常英语中较少见）。"},"examples":[{"en":"The illustrator fimbricated the scales to show how they overlap.","zh":"插画师把鳞片画成层叠状，以展示它们如何重叠。"}]}],"synonyms":["fringed","ciliate","shingled","imbricate","overlapping"],"phonetic":"/ˈfɪm.brɪˌkeɪt/","extraExplanation":["词源来自拉丁语 fimbria，意为“流苏、边饰”。因此在生物学语境中，fimbricate 常用来描述“边缘有细小流苏/纤毛”的外观。","它属于偏学术的描述词，多见于植物形态学（叶缘、芽鳞、苞片等）或动物/解剖学的观察记录中，日常对话里不常用。"]}
{"word":"fimbricated","summary":{"en":"“Fimbricated” means arranged in overlapping layers, especially in scientific descriptions.","zh":"“fimbricated”指“覆瓦状、层层重叠排列”，多用于科学（如植物学、解剖学）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overlapping in layers, like shingles on a roof or scales on a fish.","zh":"（呈）覆瓦状的；层层重叠的（像屋瓦或鱼鳞那样）。"},"examples":[{"en":"The botanist described the plant’s leaves as fimbricated along the stem.","zh":"植物学家描述这株植物的叶子沿着茎呈覆瓦状排列。"},{"en":"Under a microscope, the tiny structures looked fimbricated, with each layer partly covering the next.","zh":"在显微镜下，这些微小结构看起来呈覆瓦状，每一层都部分覆盖下一层。"}]}],"synonyms":["imbricated","overlapping","layered","shingled","scaled"],"phonetic":"/ˈfɪm.brɪˌkeɪ.tɪd/","extraExplanation":["“fimbricated”常见于生物学/植物学/解剖学的描写（学术语体），用来强调“像瓦片一样一片压一片”的排列方式。","词源上与拉丁语 *fimbria*（边缘、流苏）相关；在相关术语里你也会见到 *fimbriae*（纤毛/伞状缘毛）等词，但“fimbricated”本身主要指“重叠排列”，不一定指“有流苏”。"]}
{"word":"fimbrilla","summary":{"en":"A biological term meaning a very small fimbria—a tiny fringe or hair-like structure.","zh":"生物学用语，指非常小的“缘毛/流苏状结构”，即细小的边缘毛状或流苏状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small fimbria; a tiny fringe-like structure, especially in biology (e.g., a delicate fringe on a membrane or a small hair-like appendage in microorganisms).","zh":"小缘毛；（尤指生物学中）细小的流苏状结构，如膜边缘的细小缘毛或微生物表面的细小毛状附属物。"},"examples":[{"en":"Under the microscope, the bacterium showed several fimbrillae that helped it attach to the surface.","zh":"在显微镜下，这种细菌可见数条小缘毛，帮助它附着在表面。"},{"en":"The tissue edge appeared fringed with a fine fimbrilla.","zh":"组织边缘看起来带着细细的小缘毛。"}]}],"synonyms":["fimbria","small fringe","fringe","hair-like appendage"],"phonetic":"/fɪmˈbrɪlə/","extraExplanation":["“fimbrilla”是较少见、偏学术的词，常见于解剖学、微生物学或组织学写作中；更常用的相关词是“fimbria”（缘毛、流苏状边缘）。","复数常写作“fimbrillae”。在一些语境里它可指比“fimbria”更小、更细的结构（相当于“小型缘毛/细小流苏”）。"]}
{"word":"fimbrillae","summary":{"en":"“Fimbrillae” are tiny fringe-like fibers/appendages, mainly used in scientific or medical contexts.","zh":"“Fimbrillae”指细小的流苏状纤维/附属结构，主要用于科学或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, fringe-like fibers or tiny appendages (often microscopic), especially in biology/anatomy; plural of “fimbrilla.”","zh":"（尤指生物/解剖学中）细小的流苏状纤维或微小附属结构；为“fimbrilla”的复数。"},"examples":[{"en":"Under the microscope, the fimbrillae appeared as fine, hairlike fringes along the surface.","zh":"在显微镜下，fimbrillae 看起来像表面的一圈细小毛状流苏。"},{"en":"The diagram labels fimbrillae near the edge of the tissue to show their fringe-like shape.","zh":"图示在组织边缘标注了 fimbrillae，用来说明它们呈流苏状的形态。"}]}],"synonyms":["tiny fringes","minute fibers","small filaments"],"phonetic":"/fɪmˈbrɪliː/","extraExplanation":["这是一个偏学术/医学用词，常见于解剖学、组织学或微生物学资料中。日常英语里很少使用。","词根与拉丁语 fimbria（“流苏、边饰”）有关，因此它的核心画面感就是“边缘的细小流苏”。","注意拼写与读音：fimbrillae 为复数形式；单数是 fimbrilla（“一条/一小簇流苏状结构”）。"]}
{"word":"fimbrillate","summary":{"en":"Fimbrillate means “finely fringed with tiny threadlike edges,” mainly in scientific descriptions.","zh":"fimbrillate 指“边缘带细小丝状缘毛、细流苏状”，多用于植/动物学等科学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having a fringe of very small, threadlike projections; finely fringed.","zh":"（植/动物学）具细小丝状缘毛的；细缘毛状的（边缘像细流苏一样）。"},"examples":[{"en":"Under the microscope, the leaf margin looked fimbrillate.","zh":"在显微镜下，叶缘看起来呈细缘毛状。"},{"en":"Some seeds have a fimbrillate coat that helps them catch on fur.","zh":"有些种子的外皮带细缘毛，有助于黏附在动物毛上。"}]},{"partOfSpeech":"v.","definition":{"en":"To make or become finely fringed with small, threadlike margins.","zh":"使（或变得）呈细缘毛状；在边缘形成细小丝状缘毛。"},"examples":[{"en":"As the tissue dried, the edges began to fimbrillate.","zh":"组织干燥后，边缘开始出现细缘毛状裂散。"},{"en":"The specimen’s rim fimbrillated after long exposure to salt water.","zh":"标本边缘在长期接触盐水后变得细缘毛化。"}]}],"synonyms":["fimbriate","fringed","ciliate","frayed"],"phonetic":"/ˈfɪm.brəˌleɪt/","extraExplanation":["“fimbrillate”非常少见，常见的近义词是 **fimbriate**（有缘毛的、流苏状的）。在阅读学术材料时也要小心不要和 **fibrillate**（形成纤维/纤丝；或指心脏‘心室颤动’）混淆：两者拼写接近，但含义与使用领域不同。","词根提示：*fimbria* 在拉丁语中有“流苏、边饰”的意思，因此该词多用于描述边缘像“细流苏”一样的结构（常见于植物形态学或显微描述）。"]}
{"word":"fimbrilliferous","summary":{"en":"Fimbrilliferous means “fringed with fine, hair-like projections,” mainly used in scientific descriptions.","zh":"fimbrilliferous 指“具缘毛的、边缘呈细毛流苏状的”，主要用于科学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having fimbriae; fringed with many small, thread-like or hair-like projections.","zh":"（植物学/动物学）具缘毛的；带有许多细小丝状或毛状流苏（缘毛）的。"},"examples":[{"en":"Under the microscope, the margin looked fimbrilliferous, like a tiny fringe.","zh":"在显微镜下，边缘看起来具缘毛，像一圈细小的流苏。"},{"en":"The researcher described the seed coat as fimbrilliferous along the edges.","zh":"研究者描述这种种子的种皮边缘具缘毛。"}]}],"synonyms":["fringed","fimbriate","ciliate"],"phonetic":"/ˌfɪm.brɪlˈɪf.ɚ.əs/","extraExplanation":["这是一个非常少见、偏学术的形容词，多用于显微观察、分类描述（尤其是植物形态学）。","词源可拆解为拉丁语系构词：fimbria（“流苏、缘饰”）+ -ferous（“携带…的、具有…的”）。意思就是“带有缘毛/流苏状结构”。","日常英语中更常见的替代表达是 fringed（有流苏的/有缘饰的）或 having a fringe of fine hairs（边缘有细毛）。"]}
{"word":"fimbrillose","summary":{"en":"Fimbrillose describes something with very fine fringe-like fibers, especially in scientific descriptions of plants and fungi.","zh":"Fimbrillose 指带有非常细的流苏状纤维/丝状边缘的形态，常用于植物与真菌的科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having fine fringe-like fibers or threads along an edge or surface; covered with small hairlike projections (used especially in botany and mycology).","zh":"（尤用于植物学、真菌学）边缘或表面带有细小的流苏状纤维/丝状物；具细小毛状突起的。"},"examples":[{"en":"Under the microscope, the mushroom’s cap margin appeared fimbrillose.","zh":"在显微镜下，这种蘑菇的菌盖边缘看起来呈细流苏状（fimbrillose）。"},{"en":"The leaf base is slightly fimbrillose, with tiny threadlike fringes.","zh":"叶基部略呈细流苏状，带有微小的丝状边缘。"}]}],"synonyms":["fringed","fimbriate","ciliate","hairy-edged"],"phonetic":"/fɪmˈbrɪloʊs/","extraExplanation":["词源来自拉丁语 fimbria（“流苏、穗边”）。在描述形态时，fimbrillose 强调“很细、很多的小流苏/细纤维”，比常见的 fimbriate（具流苏状边缘）更偏“细小、毛丝状”的感觉。多见于植物学、苔藓/地衣学与真菌学的形态描述。"]}
{"word":"fimbrin","summary":{"en":"Fimbrin is an actin-binding protein that bundles actin filaments to support cell structure and movement.","zh":"Fimbrin 是一种结合并捆束肌动蛋白丝的蛋白质，用于支持细胞结构与运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein that binds and bundles actin filaments inside cells, helping form structures like microvilli and supporting cell shape and movement","zh":"（生物）纤毛蛋白／丝状蛋白（fimbrin）：一种能结合并“捆束”肌动蛋白丝（actin filaments）的蛋白质，帮助形成如微绒毛等细胞结构，并支持细胞形状与运动"},"examples":[{"en":"Fimbrin helps bundle actin filaments in the microvilli of intestinal cells.","zh":"Fimbrin 有助于把肠道上皮细胞微绒毛中的肌动蛋白丝捆束在一起。"},{"en":"Researchers studied how fimbrin affects cell movement by changing the actin cytoskeleton.","zh":"研究人员通过改变肌动蛋白细胞骨架来研究 fimbrin 如何影响细胞运动。"}]}],"synonyms":["actin-bundling protein","actin-binding protein","plastin (related family term)"],"phonetic":"/ˈfɪm.brɪn/","extraExplanation":["Fimbrin 是细胞骨架相关蛋白，常见于真核细胞（如人体细胞）。在文献中也常用基因/蛋白家族名称描述：例如哺乳动物中有 plastin（如 L-plastin、T-plastin），与 fimbrin 在功能上密切相关。","词源提示：fimbrin 与拉丁语 fimbri-（“边缘、流苏”）有关，联想到微绒毛（microvilli）这种“边缘刷状”的结构。"]}
{"word":"fimbriodentate","summary":{"en":"Fimbriodentate describes a plant edge that is both toothed and fringed.","zh":"fimbriodentate 指植物边缘既呈锯齿状又带缘毛（流苏状）的形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a margin that is both toothed (dentate) and fringed with small, hair-like or thread-like projections (fimbriae).","zh":"（植物学）边缘同时具“锯齿状”（dentate）和“流苏/缘毛状”（fimbriate）特征，即有齿状突起且齿间或边缘带细小毛状/丝状缘毛。"},"examples":[{"en":"The botanist described the leaf margin as fimbriodentate under the hand lens.","zh":"植物学家用放大镜观察后，将叶缘描述为 fimbriodentate（缘毛锯齿状）。"},{"en":"In the field guide, the species is identified by its small, fimbriodentate bracts.","zh":"在野外图鉴中，该物种通过其细小的 fimbriodentate（缘毛锯齿状）苞片来辨认。"}]}],"synonyms":["fimbriate-dentate","fringed and toothed"],"phonetic":"/ˌfɪm.bri.oʊˈdɛn.teɪt/","extraExplanation":["这是一个较少见的专业形容词，多用于植物形态描述（如叶缘、苞片边缘）。它结合了两种常见术语：fimbriate（具缘毛、流苏状）+ dentate（具较粗、向外的齿状突起）。","记忆法：fimbrio- 联想到“fringe（流苏）”，-dentate 联想到“dent（牙齿）”。也就是“有流苏又有齿”。","在一般英语写作中几乎不用，主要出现在植物志、分类检索表、标本描述等学术语境。"]}
{"word":"fimbrioplasty","summary":{"en":"Fimbrioplasty is surgery to repair the fimbriae at the end of a fallopian tube, often to help fertility.","zh":"Fimbrioplasty 指修复输卵管伞端的手术，常用于改善生育相关的拾卵功能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure to repair or reconstruct the fimbriae (the finger-like ends) of a fallopian tube, usually to improve the tube’s ability to pick up an egg and support fertility.","zh":"一种修复或重建输卵管伞端（输卵管末端的指状结构）的手术，通常用于改善拾卵功能并帮助提高生育能力。"},"examples":[{"en":"After the infection damaged the end of the tube, the doctor discussed fimbrioplasty as one possible treatment.","zh":"感染损伤了输卵管末端后，医生提出“输卵管伞端成形术（fimbrioplasty）”作为一种可能的治疗方案。"},{"en":"Fimbrioplasty may be considered when the fimbriae are scarred but the tube is not completely blocked.","zh":"当伞端有瘢痕但输卵管并未完全阻塞时，可能会考虑进行伞端成形术。"}]}],"synonyms":["tubal fimbrioplasty","fimbrial plasty","fimbrial reconstruction"],"phonetic":"/fɪmˈbri.oʊˌplæs.ti/","extraExplanation":["这是一个较专业的妇科/生殖医学术语：fimbri- 来自拉丁语 fimbria（“流苏、边缘”，引申为“伞端的边缘状结构”），-plasty 表示“成形/修复手术”。","临床上常与不孕相关的输卵管问题一起讨论（如炎症后粘连、伞端瘢痕）。是否适合手术需结合输卵管损伤程度、年龄、其他不孕因素等综合评估。"]}
{"word":"fimbristylis","summary":{"en":"Fimbristylis is a botanical genus of wetland sedges in the Cyperaceae family.","zh":"Fimbristylis 指莎草科中常见于湿地的一类莎草植物属（蔺草属/纤刺草属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of sedge-like plants (family Cyperaceae), often found in wetlands or moist ground; some species are considered weeds and some are used in habitat restoration.","zh":"（植物）蔺草属/纤刺草属植物的一个属（莎草科），多生于湿地或潮湿土壤；部分种类被视为杂草，也有用于生态修复的。"},"examples":[{"en":"Fimbristylis species often grow in marshy areas and along riverbanks.","zh":"蔺草属的植物常生长在沼泽地和河岸边。"},{"en":"The field guide lists Fimbristylis as a common wetland sedge.","zh":"野外植物图鉴将蔺草属列为常见的湿地莎草类植物。"}]}],"synonyms":["sedge (general term)","Cyperaceae (family name, broader category)"],"phonetic":"/ˌfɪm.brɪˈstaɪ.lɪs/","extraExplanation":["词源提示：Fimbristylis 来自拉丁语词根 fimbria（“流苏、边缘”）+ stylis（与“花柱 style”相关），名称常被解释为“具流苏状花柱/花柱基部结构的植物”，属于植物学命名中常见的形态描述。","使用场景：该词主要出现在植物学、生态学、湿地调查、除草与农田杂草管理等语境中；日常英语中不常用。"]}
{"word":"fimetarious","summary":{"en":"Fimetarious is a rare adjective meaning “related to manure or dung.”","zh":"fimetarious 是个罕见形容词，意思是“与粪肥/粪便有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to dung or manure; having the nature of manure.","zh":"（罕见）与粪肥/粪便有关的；像粪肥一样的。"},"examples":[{"en":"The gardener used fimetarious compost to enrich the soil.","zh":"园丁用含粪肥的堆肥来让土壤更肥沃。"},{"en":"In older texts, “fimetarious” may describe a manure pile or its smell.","zh":"在较老的文本中，“fimetarious”有时用来形容粪堆或其气味。"}]}],"synonyms":["manurial","dungy","fecal"],"phonetic":"/ˌfɪməˈtɛriəs/","extraExplanation":["这是一个非常少见的词，多见于旧文献或专业/古典语境里；日常英语更常用 manure (粪肥)、dung (粪便)、fertilizer (肥料) 等。","词源上与拉丁语 fimus（粪便）有关，含义偏“粪肥的/与粪堆相关的”。","容易被误看成与 foment（煽动、激起）有关，但两者词源和意思无关。"]}
{"word":"fimetic","summary":{"en":"“Fimetic” isn’t standard English; it’s likely a misspelling of “phonetic” or “mimetic.”","zh":"“fimetic” 不是标准英文词；很可能是把 “phonetic” 或 “mimetic” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “phonetic” (about speech sounds) or “mimetic” (imitative).","zh":"不是标准英文单词。很可能是拼写错误，想写的是 “phonetic”（与语音/音标有关）或 “mimetic”（模仿性的）。"},"examples":[{"en":"I think you meant “phonetic,” as in “phonetic spelling.”","zh":"我觉得你想写的是 “phonetic”，比如 “phonetic spelling（按发音拼写）”。"},{"en":"If you meant “mimetic,” it describes something that imitates real life or nature.","zh":"如果你想写的是 “mimetic”，它形容“模仿真实生活或自然”的东西。"}]}],"phonetic":"/faɪˈmɛtɪk/","extraExplanation":["“phonetic” 常用于语言学习：phonetic symbols（音标）、phonetic transcription（音标转写）、phonetic spelling（按发音拼写）。","“mimetic” 常见于文学/艺术讨论：mimetic art（写实/模仿现实的艺术）、mimetic desire（模仿性欲望，常见于人文社科语境）。","如果你告诉我你是在什么句子里看到/想用 “fimetic”，我可以更准确判断你想要的词。"]}
{"word":"fimicolous","summary":{"en":"Fimicolous means living in or growing on animal dung, mainly in scientific contexts.","zh":"Fimicolous 指“生活在或生长在动物粪便上的（粪生的）”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living in or growing on animal dung; dung-dwelling (used mainly in biology, especially for fungi and insects).","zh":"生活在或生长在动物粪便上的；粪生的（主要用于生物学语境，尤指真菌和昆虫）。"},"examples":[{"en":"Some fimicolous fungi grow quickly on cow dung after rain.","zh":"一些粪生真菌在雨后会很快在牛粪上生长。"},{"en":"Researchers collected fimicolous insects from dried manure in the field.","zh":"研究人员在野外从干燥的粪肥中采集了粪生昆虫。"}]}],"synonyms":["dung-dwelling","coprophilous","coprophagic (related, not identical)"],"phonetic":"/faɪˈmɪkəˌləs/","extraExplanation":["词源提示：fimicolous 来自拉丁语 fimus（粪便）+ -colous（居住/栖居），字面意思是“住在粪上的”。","使用场景：这是偏学术的词，常见于生态学、真菌学（mycology）、昆虫学等文章；日常英语里通常会用更直白的 dung-dwelling / growing on dung 来表达。","相关常见词：coprophilous 也表示“嗜粪的/粪生的”，在学术写作中比 fimicolous 更常见一些。"]}

