{"word":"fip","summary":{"en":"“FIP” is usually an acronym. Most commonly in baseball it means Fielding Independent Pitching, a pitching metric. In other contexts it can stand for different terms depending on the field.","zh":"“FIP”通常是缩写。最常见的是棒球里的FIP（Fielding Independent Pitching），一种评估投手表现的指标；在其他语境下也可能代表不同术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Fielding Independent Pitching: a baseball statistic that estimates a pitcher’s performance using outcomes mostly under the pitcher’s control (strikeouts, walks, hit batters, and home runs), aiming to reduce the effect of defense and luck.","zh":"（缩写）FIP（Fielding Independent Pitching）：棒球数据统计指标，用主要由投手自身可控的结果（如三振、保送、触身球、本垒打）来评估投手表现，尽量排除守备与运气的影响。"},"examples":[{"en":"His ERA is high, but his FIP is much lower, so he may have been unlucky.","zh":"他的防御率很高，但FIP低很多，所以他可能只是运气不好。"},{"en":"Analysts often use FIP to compare pitchers across different teams and defenses.","zh":"分析师常用FIP来比较不同球队、不同守备环境下的投手。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, general) Used as an abbreviation for different phrases in different fields; meaning depends on context (for example, finance, IT, or aviation).","zh":"（缩写，泛用）在不同领域可代表不同词组；具体含义取决于语境（如金融、IT或航空等）。"},"examples":[{"en":"What does FIP stand for in this document?","zh":"在这份文件里，FIP代表什么？"},{"en":"In this chat, ‘FIP’ could mean something different than in baseball.","zh":"在这段对话里，“FIP”的意思可能和棒球里的不同。"}]}],"synonyms":["Fielding Independent Pitching (baseball)"],"phonetic":"/ˌɛf aɪ ˈpi/","extraExplanation":["“FIP”在英语里最常见的固定用法之一确实是棒球统计（Fielding Independent Pitching）。但它也是一个常见缩写，很多行业都会用到，所以如果你告诉我上下文（例如：体育、工作文件、软件界面），我可以给出更精准的释义。","读法通常是把字母一个个念：F-I-P。"]}
{"word":"fipenny","summary":{"en":"“Fipenny” is a nonstandard spelling of “fivepenny,” meaning “worth/costing five pence,” or (less commonly) a fivepence coin in older British usage.","zh":"“fipenny”多为“fivepenny”的非标准拼写，意思是“值/花五便士的”；较少情况下也可指旧式英式用法中的“五便士硬币”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(British, informal/old-fashioned) Worth five pence; costing five pennies.","zh":"（英式，非正式/旧式）值五便士的；五便士价位的。"},"examples":[{"en":"He bought a fivepenny bag of sweets from the corner shop.","zh":"他在街角小店买了一袋五便士的糖果。"},{"en":"A fivepenny ticket was all she could afford.","zh":"她只买得起一张五便士的票。"}]},{"partOfSpeech":"n.","definition":{"en":"(British, old-fashioned) A fivepence coin (especially in older usage when Britain used pence/pennies more visibly in daily speech).","zh":"（英式，旧式）五便士硬币（尤指过去更常在日常口语中这样说的时候）。"},"examples":[{"en":"Have you got a fivepenny for the meter?","zh":"你有一枚五便士硬币投进计时器吗？"},{"en":"He found a fivepenny in his pocket.","zh":"他在口袋里摸到一枚五便士硬币。"}]}],"synonyms":["fivepenny","five-penny","five pence (amount)"],"phonetic":"/ˈfaɪvˌpɛni/","extraExplanation":["“fipenny”更常见的标准拼写是 **fivepenny**（也写作 *five-penny*）。在一些方言或口语书写中，*five-* 可能被写成更接近发音的形式。","英式货币中 *penny*（便士）复数常见两种：指“数量”时常用 **pence**（如 *five pence*），指“硬币”时常用 **pennies**（如 *five pennies*）。因此 *fivepenny* 属于比较口语/旧式的压缩说法。","文学或旧小说里常见类似结构：*twopenny, threepenny, sixpenny* 等，用来描写当时物价与生活细节（比如“几便士的面包/报纸”）。"]}
{"word":"fippence","summary":{"en":"“Fippence” is a dialect word meaning five pence (a 5p coin).","zh":"“fippence”是方言词，意思是五便士（5p硬币）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, chiefly British) Five pence; a five‑pence coin (5p).","zh":"（方言，多见于英式用法）五便士；五便士硬币（5p）。"},"examples":[{"en":"I’ve only got a fippence left—can you lend me a pound?","zh":"我只剩一枚五便士了——你能借我一英镑吗？"},{"en":"Back then, a fippence could still buy a small sweet.","zh":"那时候，一枚五便士还买得到一颗小糖果。"}]}],"synonyms":["fivepence","five pence","5p"],"phonetic":"/ˈfɪpəns/","extraExplanation":["“fippence”是英语方言里的拼写/读法，通常对应标准写法“fivepence / five pence”。在英国货币里，pence（便士）是英镑的辅币：100 pence = 1 pound。","在较老的语境里，你也可能看到与旧币制相关的词（如 sixpence），但“fippence”一般就是“5p”的口语/方言形式。"]}
{"word":"fipple","summary":{"en":"A fipple is the internal plug/channel that directs air to make sound in instruments like recorders and tin whistles.","zh":"fipple 指竖笛、锡哨等乐器内用于导风发声的气塞/气道结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small plug or channel inside certain wind instruments that directs the airstream onto an edge to create sound (common in recorders, tin whistles, and some organ pipes).","zh":"（某些木管/管风琴音管中的）气塞/气道结构，用来把气流引向发声边缘以产生声音（常见于竖笛、锡哨以及部分管风琴音管）。"},"examples":[{"en":"A recorder makes sound when air passes through the fipple and hits the sharp edge.","zh":"竖笛的声音来自气流通过 fipple 并撞击锋利的吹口边缘。"},{"en":"Many tin whistles are called fipple flutes because of this built-in air channel.","zh":"许多锡哨被称为“fipple flute（气塞长笛）”，就是因为它有内置的气道结构。"}]}],"synonyms":["windway","duct","block (instrument part)"],"phonetic":"/ˈfɪpəl/","extraExplanation":["发音上要注意：在英语中这个词常与“nipple”押韵，元音相同。","乐器分类里常说“fipple flute（气塞长笛/导风道笛）”，指像竖笛、哨子这类通过固定气道导风发声的乐器；相对的，长笛（flute）一般是用嘴唇在吹口处形成气流（不是固定气道）。","词源：来自中古英语，和“pipe（管子）”同源的方言词有关；现在主要用于乐器学/音乐工艺语境。"]}
{"word":"fipples","summary":{"en":"“Fipples” means the whistle-like mouthpieces used in instruments like recorders and tin whistles (plural of “fipple”).","zh":"“Fipples”指竖笛、锡哨等乐器上的哨口式吹嘴结构（“fipple”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the whistle-like mouthpiece of some wind instruments (such as a recorder, tin whistle, or some organ pipes), where air is directed against an edge to make a sound","zh":"（某些管乐器的）哨口／吹口结构；一种像口哨的吹嘴装置（如竖笛、锡哨、某些风琴管），通过导风道让气流冲击锐边发声"},"examples":[{"en":"Recorders and tin whistles use fipples to create a clear, focused tone.","zh":"竖笛和锡哨用“哨口（fipple）”来产生清晰集中的音色。"},{"en":"The maker adjusted the fipple to improve the instrument’s response.","zh":"制作者调整了哨口结构，让乐器的反应更灵敏。"},{"en":"Some organ pipes are called “fipple pipes” because their sound is produced by this same mechanism.","zh":"有些风琴管叫作“哨口音管（fipple pipes）”，因为它们用同样的发声机制。"}]}],"synonyms":["duct mouthpieces","whistle mouthpieces","fipple mouthpieces"],"phonetic":"/ˈfɪpəlz/","extraExplanation":["“fipples”是名词复数形式，单数是“fipple”。在乐器学里，fipple指一种“导风道＋切口边缘”的结构：你吹气后，气流被引导去冲击一个锐边（类似口哨），从而振动空气柱并发声。","常见含有fipple结构的乐器：竖笛（recorder）、锡哨（tin whistle）、某些排箫/牧笛类以及风琴的部分管（organ fipple pipes）。它通常不需要像长笛那样用嘴唇精确控制气流，因此对初学者更友好。"]}

