{"word":"fiqh","summary":{"en":"Fiqh means Islamic jurisprudence—the scholarly interpretation of Islamic law in practice.","zh":"Fiqh 指“伊斯兰法学”，即对伊斯兰教法在实践中的学术性解释与推导。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Islamic jurisprudence: the human understanding and interpretation of Islamic law (Sharia) as developed by Muslim scholars, covering worship practices and everyday conduct.","zh":"伊斯兰法学：穆斯林学者对伊斯兰教法（沙里亚）的理解与解释体系，涵盖礼拜等宗教实践以及日常行为规范。"},"examples":[{"en":"She is studying fiqh to better understand how Islamic rulings are derived.","zh":"她正在学习伊斯兰法学，以更好地理解宗教裁决是如何推导出来的。"},{"en":"Different schools of fiqh may reach different conclusions on the same issue.","zh":"不同的伊斯兰法学学派可能会对同一问题得出不同结论。"}]}],"synonyms":["Islamic jurisprudence","Islamic legal theory (broader)","jurisprudence (general)"],"phonetic":"/fɪk/","extraExplanation":["“Fiqh”来自阿拉伯语，字面有“理解、洞察”之意。日常使用中常与“Sharia（沙里亚）”一起出现：Sharia通常指被认为源自启示的总体原则；fiqh更强调学者运用《古兰经》、圣训等来源进行推理而形成的具体规则，因此在不同地区或学派之间可能存在差异。","常见搭配：schools of fiqh（法学学派），fiqh ruling（法学裁决/判例式结论），study fiqh（学习法学）。在英语写作中通常不加冠词或以“Islamic fiqh/Islamic jurisprudence”解释更清楚。"]}
{"word":"fique","summary":{"en":"Fique is a strong plant fiber (similar to sisal), used for rope and sacks.","zh":"Fique是一种结实的植物纤维（类似剑麻），常用于绳索和麻袋等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, coarse fiber obtained from the leaves of the fique plant (a type of agave), used to make rope, sacks, twine, and other rough textiles","zh":"从“fique（菲克）”植物（类似龙舌兰的一类植物）叶片中提取的粗而结实的纤维，用于制作绳索、麻袋、捆扎绳等粗纺制品"},"examples":[{"en":"The farmers used fique rope to tie the bags securely.","zh":"农民用fique绳把袋子牢牢绑住。"},{"en":"Some coffee sacks are traditionally made from fique fiber.","zh":"有些咖啡麻袋传统上是用fique纤维制作的。"},{"en":"The artisan wove a rustic mat from fique.","zh":"那位手工艺人用fique编织了一张质朴的垫子。"}]}],"synonyms":["sisal","agave fiber","hemp (roughly similar use)"],"phonetic":"/fik/","extraExplanation":["“Fique”这个词在英语里多用于拉丁美洲语境，尤其与哥伦比亚相关：当地常把这种植物纤维用于制作麻袋（如咖啡、农产品包装）和绳索。","它和“sisal（剑麻纤维）”很像：两者都来自类似龙舌兰的植物、都很耐用，但来源植物与产地传统不同。"]}
{"word":"fiques","summary":{"en":"“fiques” is the plural of “fique,” a strong plant fiber used for rope, sacks, and twine.","zh":"“fiques”是“fique”的复数，指一种坚韧的植物纤维，用于制作绳索、麻袋和捆扎绳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong plant fiber (from Furcraea plants, related to agave), used to make rope, sacks, and twine; often produced in Colombia and other parts of Latin America","zh":"一种坚韧的植物纤维（来自Furcraea属植物，和龙舌兰近缘），常用于制作绳索、麻袋和捆扎绳；常见于哥伦比亚等拉丁美洲地区"},"examples":[{"en":"The sacks were made from fique fiber.","zh":"这些麻袋是用fique纤维制成的。"},{"en":"Farmers use fique to make strong twine for tying crops.","zh":"农民用fique制作结实的捆扎绳来绑作物。"}]}],"synonyms":["sisal (similar fiber)","agave fiber"],"phonetic":"/fik/","extraExplanation":["“fiques”通常是“fique”的复数形式（表示多种/多批fique纤维）。这个词在一般英语里不常见，更常出现在与农业、纺织、手工制品或拉丁美洲贸易相关的语境中。","容易混淆：如果你想查的是法语“figues”（无花果的复数）或英语“fixes / fakes”，请告诉我上下文或原句，我可以帮你确认正确拼写与词义。"]}

