{"word":"fiuman","summary":{"en":"Fiuman means “from Fiume (Rijeka)”—either a person from there or something related to its culture/history/dialect.","zh":"Fiuman 指“来自阜姆（今里耶卡）的人”，或“与阜姆/里耶卡的文化、历史、方言有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Fiume (the Italian name for Rijeka, Croatia) or someone belonging to the historical Italian-speaking community there.","zh":"来自阜姆（Fiume，今克罗地亚里耶卡 Rijeka 的意大利语名）的人；也可指当地历史上的意大利语社群成员。"},"examples":[{"en":"Her grandparents were Fiumans who later moved to Trieste.","zh":"她的祖父母是阜姆人，后来搬到了的里雅斯特。"},{"en":"Some Fiumans still maintain cultural ties with Italy.","zh":"一些阜姆人仍与意大利保持文化联系。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Fiume/Rijeka, especially its local culture, history, or dialect.","zh":"与阜姆/里耶卡有关的（尤指当地文化、历史或方言的）。"},"examples":[{"en":"He studies Fiuman history in the early 20th century.","zh":"他研究20世纪初的阜姆历史。"},{"en":"They collected words from the Fiuman dialect.","zh":"他们收集了阜姆方言的词汇。"}]}],"synonyms":["from Rijeka","Rijeka’s","Rijekan (rare)"],"phonetic":"/ˈfjuːmən/","extraExplanation":["“Fiume”是里耶卡（Rijeka）的意大利语地名；因此“Fiuman”常见于历史、族群与语言文化语境中，用来指该城及其周边曾长期存在的意大利语社群。","20世纪初该地经历多次政权更迭（包括“阜姆自由邦”等短暂政体），所以在家族史、迁徙史与边界史研究中也会看到“Fiuman”这一称呼。","现代英语里更常直接说“from Rijeka / Rijeka’s”来表达地理来源；“Fiuman”则更带有历史与文化身份色彩。"]}
{"word":"fiumara","summary":{"en":"A southern-Italian seasonal river/stream (and its stony riverbed) that may be dry for long periods but runs fast after heavy rain.","zh":"意大利南部常见的季节性河流/溪流（及其多石河床）：旱季常干涸，雨后则急速奔流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In southern Italy) a river or stream that flows strongly after heavy rain but may be dry for long periods; also the wide, stony riverbed it leaves behind.","zh":"（意大利南部）一种季节性河流/溪流：大雨后水势很强，但长时间可能干涸；也可指其宽阔、多石的干河床。"},"examples":[{"en":"After the storm, the fiumara rushed down from the mountains and flooded the fields.","zh":"暴风雨过后，fiumara 从山上奔涌而下，淹没了田地。"},{"en":"In summer the fiumara was mostly dry, and people walked across the stony riverbed.","zh":"夏天 fiumara 大多干涸，人们可以走过那片布满石子的河床。"}]}],"synonyms":["seasonal stream","dry riverbed","wadi"],"phonetic":"/fjuˈmɑːrə/","extraExplanation":["“Fiumara”是意大利语借词，来自意大利语 fiume（河）。多见于描述西西里岛、卡拉布里亚等地的地貌与水文：雨季急流、旱季干涸，河道常呈宽阔碎石河床。","在英语里它属于较少见的地理/文学用词，常用于旅行写作、地貌学或地区性描写；类似概念可类比中东与北非的“wadi（干河谷/季节河道）”。"]}

