{"word":"five","summary":{"en":"“Five” most commonly means the number 5, and it can also be used as a noun to mean a ‘5’ or a group of five in some contexts.","zh":"“five”最常用的意思是数字5；在一些语境中也可作名词，表示“一个5（五点/五号等）”或“五个一组”。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"The number 5.","zh":"数字5；五。"},"examples":[{"en":"I have five apples.","zh":"我有五个苹果。"},{"en":"She wakes up at five o’clock.","zh":"她五点钟起床。"}]},{"partOfSpeech":"n.","definition":{"en":"A group or set of five people or things.","zh":"五个人或五个事物组成的一组。"},"examples":[{"en":"A five of us went to the park.","zh":"我们五个人去了公园。"},{"en":"He ordered a five of donuts.","zh":"他点了五个甜甜圈。"}]}],"synonyms":["5","V (Roman numeral)"],"phonetic":"/faɪv/","extraExplanation":["在英语里，数字作“名词”时常用于口语或特定场景（如体育比赛、骰子、牌类等），例如：He rolled a five.（他掷出了一个五点。）更自然的日常表达通常是：five people / five donuts，而不是“a five of …”。"]}
{"word":"Five Classics","summary":{"en":"the five core Confucian classical texts","zh":"儒家核心经典“五经”"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(In Chinese culture) the five ancient Confucian texts that became core works for education and civil service learning.","zh":"（中国文化中）“五经”，指儒家传统中最重要的五部古代经典，是传统教育与科举学习的核心文本。"},"examples":[{"en":"In traditional China, students memorized the Five Classics as part of their education.","zh":"在传统中国，学生会背诵“五经”作为教育的一部分。"},{"en":"The Five Classics influenced Chinese politics, ethics, and literature for centuries.","zh":"“五经”数百年来深刻影响了中国的政治、伦理与文学。"}]}],"synonyms":["Wu Jing","Confucian classics","the Five Confucian Classics"],"phonetic":"/faɪv ˈklæsɪks/","extraExplanation":["“五经”一般指：《诗经》(Classic of Poetry)、《书经/尚书》(Classic of Documents)、《礼记》(Record of Rites)、《易经》(I Ching / Classic of Changes)、《春秋》(Spring and Autumn Annals)。不同书目体系在译名与归类上偶有差异。","在英语里需注意：Five Classics 多为专名，常写作 The Five Classics，并大写。它不是泛指“任何五本经典名著”。"],"etymology":"源自中文“五经”的英语译法（Five＝五，Classics＝经/经典）。在英语学术语境中通常特指儒家传统的五部经典。","mnemonic":["把 Five Classics 直接联想成“五经”：Five＝五；Classics＝经典/经。看到大写就想到“专指儒家那一套”。","记成“诗书礼易春秋”六个字的顺口溜（其中‘诗书礼易春秋’对应五部经典）。"]}
{"word":"Five concepts of development","summary":{"en":"Five key ideas used to explain how something grows and changes over time.","zh":"用于解释事物如何随时间成长与变化的五个关键观点。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"The request is unclear: “five concepts of development” can mean different things depending on the subject (e.g., child development, economic development, software development, community development).","zh":"你的问题不够明确：“发展的五个概念”在不同学科里含义不同（如儿童发展、经济发展、软件开发、社区发展等）。"},"examples":[{"en":"In child psychology, “development” often includes physical, cognitive, and social-emotional change.","zh":"在儿童心理学中，“发展”常包括身体、认知与社会情绪方面的变化。"},{"en":"In economics, development can refer to growth, poverty reduction, and improvements in living standards.","zh":"在经济学中，发展可能指增长、减贫以及生活水平的提升。"}]},{"partOfSpeech":"other","definition":{"en":"Commonly used five broad concepts (general-purpose): growth, change over time, stages, influence of nature and nurture, and individual differences.","zh":"一种常见的“通用版”五个概念是：增长、随时间变化、阶段性、先天与后天的共同影响、个体差异。"},"examples":[{"en":"Development involves change over time, not just getting bigger.","zh":"发展包含随时间的变化，不只是“变大”。"},{"en":"People may pass through stages, but the timing can differ across individuals.","zh":"人们可能会经历阶段，但每个人的时间点可能不同。"},{"en":"Both genes and environment shape development.","zh":"基因与环境都会影响发展。"}]}],"synonyms":["growth","progress","advancement","evolution","maturation"],"phonetic":"/dɪˈvɛləpmənt/","extraExplanation":["如果你告诉我你的学科/场景（例如：儿童发展、经济发展、软件开发、社会工作、教育学），我可以给出该领域最标准、最常用的“五个概念”并配上例子与关键词。","如果你是要写作/考试，最好提供题目原文或教材/课程名称，因为不同教材的“5个概念”列表可能不一样。"],"etymology":"“development”来自法语 développer（意为“展开、解开”），引申为“使某事逐步显现/成长”。","mnemonic":["把 development 记成“de- + velop + -ment”：像把东西“展开(velop)”后，内容逐步“显现”，就像“发展”一步步展开。","联想中文“发展=展开+变强”：对应词源里“展开”的意思。"]}
{"word":"five elements","summary":{"en":"a set of five key components, especially the Chinese five phases (wood, fire, earth, metal, water)","zh":"五个关键要素；尤指中国传统的“五行”（木火土金水）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the five basic forces or phases in traditional Chinese thought (wood, fire, earth, metal, and water), used to explain change in nature, medicine, feng shui, and other systems","zh":"中国传统思想中的“五行”（木、火、土、金、水），用来解释自然变化，也常用于中医、风水等体系"},"examples":[{"en":"In traditional Chinese medicine, the five elements are used to describe patterns of balance in the body.","zh":"在中医里，五行常用来描述身体的平衡模式。"},{"en":"The chart explains how the five elements generate and control one another.","zh":"这张图解释了五行之间的相生与相克。"}]},{"partOfSpeech":"phrase","definition":{"en":"the five most important parts or components of something (a general, non-technical use)","zh":"（泛指）某事物最关键的五个部分/要素"},"examples":[{"en":"The training lists five elements of good customer service.","zh":"这份培训列出了优质客户服务的五个要素。"},{"en":"Her presentation focused on five elements that make a story memorable.","zh":"她的演讲聚焦于让故事令人难忘的五个要素。"}]}],"synonyms":["the five phases","Wuxing","five components","key elements","core elements"],"phonetic":"/faɪv ˈɛləmənts/","extraExplanation":["文化提示：中文“五行”在英文里常译为 “the Five Elements” 或 “the Five Phases”。“phases”更强调“变化与运行规律”，更接近“五行”的原意。","易混点：西方传统里也有“classical elements”（古典元素），常见是“四元素”earth, water, air, fire；有时会加上 aether 变成“五元素”。这与中文“五行”不是同一体系。"],"etymology":"“five elements”直译为“五个元素/要素”。在东亚文化语境中，它常被用来对应中文“五行”（更接近“阶段/运行方式”而不只是“物质元素”）；在普通英语里则常作“构成某事的五个关键部分”的泛称。","mnemonic":["记忆法：把它直接联想到“五行”——木火土金水（5个字=5个要点）。","分解记忆：five=5；elements=元素/要素，合起来就是“5个要素/元素”。"]}
{"word":"Five Great Mountains","summary":{"en":"China’s traditional set of five sacred mountains tied to directions and state rituals.","zh":"中国传统与方位、礼制相关的五座名山（五岳）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The five sacred mountains of China (a traditional group of peaks linked to directions and imperial/state rituals).","zh":"中国传统文化中的“五岳”（与五方方位对应、与祭祀和国家礼制相关的五座名山）。"},"examples":[{"en":"In Chinese history, emperors performed major ceremonies at the Five Great Mountains to show legitimacy.","zh":"在中国历史上，皇帝常在五岳举行重要仪式，以显示统治的正当性。"},{"en":"Mount Tai is often considered the most famous of the Five Great Mountains.","zh":"泰山常被认为是五岳中最著名的一座。"}]}],"synonyms":["Five Sacred Mountains","Wu Yue"],"phonetic":"/faɪv ɡreɪt ˈmaʊn(t)ənz/","extraExplanation":["五岳通常指：东岳泰山（山东）、西岳华山（陕西）、南岳衡山（湖南）、北岳恒山（山西）、中岳嵩山（河南）。","“五岳”不仅是地理概念，也带有宗教与政治象征：与五方（东南西北中）相配，古代帝王祭祀（如封禅）与国家礼制常与之相关。"],"etymology":"源自中文“五岳”的英译：五=五个，岳=大山/名山；在英语中常译为 Five Great Mountains 或 Five Sacred Mountains。","mnemonic":["把它当作固定搭配记：Five（五）+ Great（大/重要）+ Mountains（山）≈ 五岳。","联想“东南西北中”五个方向各有一座代表名山：五个方向=五座“Great Mountains”。"]}
{"word":"five o'clock shadow","summary":{"en":"late-day facial stubble after shaving","zh":"傍晚出现的短胡茬（刮胡后又长出来的胡渣）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short growth of facial hair (stubble) that appears by late afternoon on someone who shaved earlier that day.","zh":"（早上刮过胡子后）到傍晚又长出来的一层短胡茬，通常指“傍晚胡渣”。"},"examples":[{"en":"He shaved this morning, but by evening he already had a five o’clock shadow.","zh":"他今天早上刮了胡子，但到傍晚就已经有一层胡茬了。"},{"en":"The actor kept a five o’clock shadow to look tougher on screen.","zh":"这位演员留着傍晚胡渣，让自己在镜头里看起来更硬朗。"}]}],"synonyms":["stubble","beard shadow","facial stubble"],"phonetic":"ˌfaɪv əˈklɑk ˈʃædoʊ","extraExplanation":["这是较口语、带画面感的说法，常用于描述“刚刮过但又冒出来的胡茬”，也常被用来营造“随性/粗犷/疲惫”的形象。","有时也可更宽泛地指“胡茬造型”（stubble look），但核心意象仍是“到了傍晚又显出来”。"],"etymology":"源自英语口语：传统“朝九晚五”的工作日里，许多人早上刮胡子，到下午五点左右又会显出胡茬，因此用“五点的影子”来比喻脸上的暗暗胡渣。","mnemonic":["把它想成“下班时间（5点）脸上出现的‘影子’”：刮过的胡子又长出一层暗影。","shadow=影子 → 胡茬会让脸看起来有一层灰灰的“阴影”。"]}
{"word":"Five Principles of Peaceful Coexistence","summary":{"en":"Guidelines for peaceful state-to-state relations based on respect, non-aggression, and non-interference.","zh":"强调尊重主权、互不侵犯与互不干涉等的国家间和平相处准则。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A set of guidelines in international relations emphasizing mutual respect, non-aggression, non-interference, equality, mutual benefit, and peaceful relations between countries.","zh":"国际关系中的一套准则，强调相互尊重、互不侵犯、互不干涉、平等互利，以及国家间以和平方式相处。"},"examples":[{"en":"The two countries said their partnership follows the Five Principles of Peaceful Coexistence.","zh":"两国表示其伙伴关系遵循和平共处五项原则。"},{"en":"In his speech, he referenced the Five Principles of Peaceful Coexistence to argue against military blocs.","zh":"他在演讲中提到和平共处五项原则，以反对军事集团。"},{"en":"The conference discussed how the Five Principles of Peaceful Coexistence can apply to trade and technology disputes.","zh":"会议讨论了和平共处五项原则如何适用于贸易与科技争端。"}]}],"synonyms":["Panchsheel","principles of peaceful coexistence","non-interference","mutual respect for sovereignty","peaceful relations"],"phonetic":"/faɪv ˈprɪnsəpəlz əv ˈpisfəl ˌkoʊɪɡˈzɪstəns/","extraExplanation":["“五项原则”通常指：①互相尊重主权和领土完整；②互不侵犯；③互不干涉内政；④平等互利；⑤和平共处。","在英语语境中常出现在国际政治、外交史、亚非会议与不结盟运动相关讨论中；表达的是一种强调国家主权平等与避免冲突升级的外交理念。"],"etymology":"源自20世纪50年代的外交语境，常与“Panchsheel/潘查希拉”（梵语意为“五项戒律/五条原则”）相关。1954年中印关于西藏地区的协定中提出并推广，随后在亚非国家外交与不结盟语境中被广泛引用。","mnemonic":["记忆法：把“Peaceful Coexistence”拆成“co-（共同）+ exist（存在）+ -ence（名词）”，=“共同存在/和平相处”。","联想“五项原则”=“五个不/一平一和”：不侵、不犯、不干涉 + 平等互利 + 和平共处（用中文顺口溜帮助记忆）。"]}
{"word":"five-and-dime","summary":{"en":"A “five-and-dime” is an old term for a low-priced variety store, and it can also describe something cheap.","zh":"“five-and-dime”指早期卖五分/十分商品的廉价百货小店，也可形容东西很便宜（常带怀旧或略贬义语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very cheap store that originally sold many items for five or ten cents; later, any low-priced variety store","zh":"（最初许多商品卖五美分或十美分的）廉价杂货/百货小店；后来泛指低价杂货店"},"examples":[{"en":"My grandma said she bought sewing needles at the local five-and-dime.","zh":"我奶奶说她以前在本地的五分十分店买缝衣针。"},{"en":"The town’s old five-and-dime is now a café.","zh":"镇上那家老五分十分店现在变成了咖啡馆。"}]},{"partOfSpeech":"adj.","definition":{"en":"cheap or low-cost (often with a slightly old-fashioned or critical tone)","zh":"廉价的、便宜的（常带一点过时感或略带贬义）"},"examples":[{"en":"He complained about the five-and-dime souvenirs.","zh":"他抱怨那些廉价纪念品。"}]}],"synonyms":["variety store","dime store","discount store","five-and-ten"],"phonetic":"/ˌfaɪv ən ˈdaɪm/","extraExplanation":["“five-and-dime”主要是20世纪美国文化里的词：当年通货膨胀较低，许多日用品真的能用5美分或10美分买到。后来价格上涨，这类店不一定只卖5或10美分，但名称保留下来，带有怀旧、老美国小镇的气息。","常见关联品牌/语境：Woolworth’s（伍尔沃斯）曾是典型的“five-and-dime”连锁。词里用连字符（five-and-dime）更像固定名词/形容词；口语里也会说“a five-and-dime store”。","在文学与歌曲里，它常用来营造“普通人、平价生活、旧时光”的意象；例如有人会写“from the five-and-dime”来暗示东西很便宜、很日常。"]}
{"word":"five-angled","summary":{"en":"“Five-angled” means having five angles or corners; pentagonal.","zh":"“five-angled”意为“有五个角/顶点的；五边形的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five angles or corners; shaped like a five-sided figure (pentagonal).","zh":"有五个角（或五个顶点）的；五边形的。"},"examples":[{"en":"The temple has a five-angled layout with entrances on each side.","zh":"这座寺庙是五角布局，每一边都有入口。"},{"en":"He drew a five-angled star inside a circle.","zh":"他在圆里画了一个五角星。"}]}],"synonyms":["pentagonal","five-cornered"],"phonetic":"/faɪv ˈæŋɡəld/","extraExplanation":["“five-angled”较偏书面或技术用语，常见于几何、建筑、艺术描述中；日常英语里更常说“pentagonal”（五边形的）或“with five corners”（有五个角的）。","相关词源提示：penta- 表示“五”，angle 表示“角”。在描述规则五边形时也可说“regular pentagon（正五边形）”。"]}
{"word":"five-animal exercises","summary":{"en":"Traditional Chinese qigong movements imitating five animals for health.","zh":"模仿五种动物的传统气功养生功法。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A traditional Chinese qigong health practice (also called “Wu Qin Xi”) that imitates five animals—typically the tiger, deer, bear, monkey, and crane—through gentle movements and breathing to improve strength, flexibility, and well-being.","zh":"一种传统的中国气功养生功法（也称“五禽戏”），通过模仿五种动物（常见为虎、鹿、熊、猿/猴、鹤）的动作与呼吸来强身健体、提升柔韧性与身心健康。"},"examples":[{"en":"My physical therapist recommended five-animal exercises to help me loosen my shoulders and back.","zh":"我的理疗师推荐我练五禽戏，帮助放松肩背。"},{"en":"We practiced five-animal exercises in the park every morning, moving slowly and breathing deeply.","zh":"我们每天早晨在公园练五禽戏，动作缓慢、呼吸深长。"},{"en":"In some cultural classes, students learn five-animal exercises as part of traditional Chinese wellness training.","zh":"在一些文化课程中，学生会把五禽戏作为传统养生训练的一部分来学习。"}]}],"synonyms":["Five Animal Frolics","Wu Qin Xi","Wuqinxi","Five-Animal Qigong"],"phonetic":"/faɪv ˈænɪməl ˈɛksərsaɪzɪz/","extraExplanation":["常见的“五禽”说法是虎、鹿、熊、猿（或猴）、鹤；不同流派或教材在动物名称与动作细节上可能略有差异。","英语里也常用“qigong”来概括这类结合呼吸、意念与缓慢动作的练习：例如“Five-Animal Qigong”。"],"etymology":"“five-animal exercises”是对中文“五禽戏”的直译式英文说法；“five animals”指五种动物形象，“exercises”指成套的练习动作。更常见的英文名称包括“Five Animal Frolics”和拼音“Wu Qin Xi / Wuqinxi”。","mnemonic":["记忆法：five（五）+ animal（禽/兽）+ exercises（戏/练习）→ 直接联想到“五禽戏”。","把它想成“像五种动物一样活动身体”的养生操：虎的力量、鹿的舒展、熊的稳重、猴的灵活、鹤的轻盈。"]}
{"word":"five-atom","summary":{"en":"“Five-atom” describes something (especially a molecule or structure) made of five atoms.","zh":"“five-atom”用于描述（尤指分子或结构）由五个原子构成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of or involving five atoms (often used in chemistry to describe a molecule, ion, or group).","zh":"由五个原子构成的；涉及五个原子的（常用于化学中描述分子、离子或原子团）。"},"examples":[{"en":"A five-atom molecule can have very different properties from a three-atom molecule.","zh":"五原子分子可能与三原子分子的性质非常不同。"},{"en":"In the diagram, the ring is a five-atom structure.","zh":"在图中，这个环是一个五原子结构。"}]}],"synonyms":["pentatomic","five-atom structure","five-atom ring"],"phonetic":"/ˌfaɪv ˈætəm/","extraExplanation":["“five-atom”不是最常见的标准术语，更学术/常用的对应词通常是 **pentatomic**（五原子的）。在化学写作中，也常见表达如 “a molecule with five atoms”（含五个原子的分子）或 “five-atom ring”（五元环/五原子环）。"]}
{"word":"five-bar","summary":{"en":"“Five-bar” describes something (especially a gate) made with five horizontal bars, and it can also refer to a five-link mechanism in engineering.","zh":"“five-bar”多指由五根横杆组成的结构（尤其是农场门），也可指工程中的五杆连杆机构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a gate or fence) made with five horizontal bars or rails.","zh":"（指门或栅栏）由五根横杆/横档组成的。"},"examples":[{"en":"They installed a five-bar gate at the entrance to the field.","zh":"他们在田地入口处装了一扇五横杆的农场门。"},{"en":"A five-bar fence is common in rural areas.","zh":"五横杆栅栏在乡村地区很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"A gate (often wooden or metal) built with five horizontal bars; common at the entrance to fields or farms.","zh":"五横杆门（常为木制或金属制的农场门，常见于田地/农场入口）。"},"examples":[{"en":"Please close the five-bar behind you so the sheep don’t escape.","zh":"请把你身后的五横杆门关上，免得羊跑出来。"},{"en":"The horse leaned over the five-bar to look at us.","zh":"那匹马把头伸到五横杆门上方看着我们。"}]},{"partOfSpeech":"n.","definition":{"en":"In engineering, a mechanism or linkage made of five connected bars (links).","zh":"（工程）五杆机构/五杆连杆机构（由五个连杆连接组成的机构）。"},"examples":[{"en":"The robot arm uses a five-bar linkage to control its motion.","zh":"这条机械臂用五杆连杆机构来控制运动。"},{"en":"A five-bar mechanism can provide precise planar movement.","zh":"五杆机构可以实现较精确的平面运动。"}]}],"synonyms":["five-bar gate","field gate","farm gate","five-bar linkage","five-link mechanism"],"phonetic":"/ˈfaɪv bɑr/","extraExplanation":["“five-bar gate”更常见于英式英语的乡村语境（农场、牧场入口）。在美式英语中也能理解，但有时会直接说“farm gate”或“field gate”。","工程里的“five-bar linkage/mechanism”属于更专业的用法，常见于机器人、机械臂、平面机构等讨论。"]}
{"word":"five-battle-group","summary":{"en":"A five-battle-group is a battle group consisting of five units/teams, usually in military, gaming, or fictional contexts.","zh":"five-battle-group 指由五个单位/小队组成的战斗编组，多见于军事、游戏或虚构语境。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a group made up of five battle units/teams (often used in military, gaming, or fictional settings).","zh":"由五个作战单位/小队组成的战斗编组（常见于军事、游戏或虚构作品语境）。"},"examples":[{"en":"The commander deployed a five-battle-group to secure the bridge.","zh":"指挥官派出一个五战斗群去夺控那座桥。"},{"en":"In the game, you can customize a five-battle-group with different roles like tank, healer, and scout.","zh":"在游戏里，你可以自定义一个五战斗群，分配坦克、治疗和侦察等不同角色。"}]}],"synonyms":["five-unit battle group","battle group of five units","five-team task group"],"phonetic":"/ˈfaɪv ˈbætl ɡruːp/","extraExplanation":["这是一个较不固定、偏“临时造词/设定用语”的组合词：five（五）+ battle group（战斗群/战斗编组）。常见写法有 three-battle-group / five-battle-group 等，用来强调“数量=5”。","连字符（five-battle-group）常用于把数量词和名词组合成一个“整体概念”，多用于标题、设定说明或作定语时（例如：a five-battle-group formation）。在正式军事英语中更常见的说法可能是 “a battle group of five units/teams”。"]}
{"word":"five-bumped","summary":{"en":"“Five-bumped” means having five bumps or raised areas.","zh":"“five-bumped”表示“有五个凸起/隆起”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five bumps (raised rounded parts) on the surface; with five noticeable raised areas.","zh":"有五个凸起的；表面有五处明显隆起的。"},"examples":[{"en":"The five-bumped surface made the toy ball easier to grip.","zh":"这个表面有五个凸起的玩具球更容易握住。"},{"en":"We found a five-bumped shell on the beach.","zh":"我们在海滩上发现了一个有五个凸起的贝壳。"}]}],"synonyms":["five-knobbed","five-lobed","bumpy (less specific)"],"phonetic":"/faɪv bʌmpt/","extraExplanation":["“five-bumped”是由数字 + 过去分词构成的复合形容词（five + bumped），常用连字符连接，用来放在名词前作定语：a five-bumped rock / a five-bumped pattern。","如果放在名词后面作表语，连字符有时也会省略，但在正式写作或需要清晰表达时仍建议保留：The shell is five-bumped.（也可写作 five bumped，但不如前者常见、清晰）。"]}
{"word":"five-capsular","summary":{"en":"A botanical adjective meaning “having five capsules or five capsule-like parts.”","zh":"植物学用语，指“有五个蒴果或五个类似蒴果的部分”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five capsules, or divided into five capsule-like parts (seed pods/compartments).","zh":"（植物学）具五个蒴果的；或分成五个类似蒴果的部分（如种荚/隔室）的。"},"examples":[{"en":"The botanist described the fruit as five-capsular, with each capsule holding several seeds.","zh":"植物学家把这种果实描述为 five-capsular（五蒴果的），每个蒴果里都有几粒种子。"},{"en":"In some older plant descriptions, “five-capsular” is used to classify the shape of the seed pod.","zh":"在一些较早的植物描述中，“five-capsular”用来归类种荚的形态。"}]}],"synonyms":["pentacapsular","five-celled (in some contexts)"],"phonetic":"/ˌfaɪv ˈkæpsjələr/","extraExplanation":["这是一个比较少见、偏专业的复合形容词，常见于植物学或旧式的分类描述中。","构词：five（五）+ capsular（蒴果的/囊状的）。写作时常用连字符 five-capsular 来强调它是一个整体形容词。"]}
{"word":"five-capsuled","summary":{"en":"A botanical adjective meaning “having five capsules or five capsule-like compartments.”","zh":"一个植物学形容词，意思是“具有五个蒴果或五个蒴状分室的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five capsules (seed pods) or five capsule-like compartments.","zh":"（植物学）具有五个蒴果（种子囊）或五个蒴状分室的。"},"examples":[{"en":"The botanist described the plant as five-capsuled, meaning its fruit splits into five parts.","zh":"植物学家把这种植物描述为 five-capsuled，意思是它的果实会分裂成五个部分。"},{"en":"In the field guide, a five-capsuled fruit is listed as a key identifying feature.","zh":"在野外图鉴中，“五蒴果”的果实被列为重要的识别特征。"}]}],"synonyms":["five-celled","five-loculed","pentacapsular"],"phonetic":"/ˌfaɪvˈkæp.suːld/","extraExplanation":["这是一个比较少见、偏“植物学描写”的复合形容词：five（五）+ capsul(e)（蒴果/囊）+ -ed（表示“具有……的”）。常见于植物形态描述（例如花或果实的结构），多用于学术写作、图鉴或标本记录。","capsule 在日常英语里也可指“胶囊（药丸）”或“太空舱”，但在这里指植物的“蒴果/蒴”，是一种成熟后会裂开散播种子的果实类型。"]}
{"word":"five-carbon","summary":{"en":"“Five-carbon” describes something (usually a molecule) that contains five carbon atoms.","zh":"“five-carbon”指（通常是分子）含有五个碳原子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five carbon atoms (often used in chemistry and biology to describe a molecule or chain).","zh":"含有五个碳原子（常用于化学、生物学中描述分子或碳链）。"},"examples":[{"en":"Ribose is a five-carbon sugar found in RNA.","zh":"核糖是一种存在于RNA中的五碳糖。"},{"en":"The pathway breaks glucose into smaller three-carbon and five-carbon compounds.","zh":"该代谢途径会把葡萄糖分解成更小的三碳与五碳化合物。"},{"en":"Scientists studied a five-carbon intermediate in the reaction.","zh":"科学家研究了该反应中的一种五碳中间体。"}]}],"synonyms":["C5","pent- (prefix, e.g., pentose/pentane)","five-carbon chain"],"phonetic":"/ˌfaɪv ˈkɑːrbən/","extraExplanation":["“five-carbon”常用作定语并带连字符，尤其在名词前：a five-carbon chain / a five-carbon sugar。放在名词后作表语时也可见到不加连字符的写法：The molecule is five carbon(s) long（表达方式会因学科与写作习惯而异）。","在化学中它常对应“C5”或“pent-”的概念：例如 pentane（戊烷）含5个碳；pentose（戊糖）是五碳糖。"]}
{"word":"five-carbonyl","summary":{"en":"“Five-carbonyl” means having five carbonyl (CO) ligands, often in metal carbonyl complexes (≈ pentacarbonyl).","zh":"“five-carbonyl”指含有五个羰基（CO）配体的结构，常见于金属羰基配合物（≈ pentacarbonyl）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having five carbonyl (CO) ligands or groups attached to a central atom, usually a metal; “pentacarbonyl.”","zh":"（化学）含有五个羰基（CO）配体或基团连接在中心原子（通常是金属）上的；相当于“pentacarbonyl（五羰基）”。"},"examples":[{"en":"Iron pentacarbonyl, Fe(CO)5, is a classic example of a five-carbonyl metal complex.","zh":"五羰基铁 Fe(CO)5 是典型的“五羰基”金属配合物。"},{"en":"The paper describes a five-carbonyl manganese compound used as a starting material in synthesis.","zh":"论文描述了一种“五羰基”锰化合物，作为合成中的起始原料。"}]}],"synonyms":["pentacarbonyl","penta-carbonyl"],"phonetic":"/faɪv ˈkɑr.bə.nəl/","extraExplanation":["在配位化学里，“carbonyl”常特指一氧化碳（CO）作为配体与金属配位，而不是有机化学里常说的“羰基（C=O）官能团”。因此 five-carbonyl 多见于金属羰基配合物语境。","更常见、规范的写法是 pentacarbonyl（五羰基）。有时也会写作 “penta-carbonyl” 或直接用化学式如 M(CO)5 来表达。"]}
{"word":"five-carpellate","summary":{"en":"A botanical adjective meaning a flower or ovary has five carpels.","zh":"植物学形容词，指花或子房具有五个心皮。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five carpels (the female reproductive units of a flower) in one flower/ovary.","zh":"（植物学）五心皮的；具有五个心皮（花的雌性生殖结构单位）或由五个心皮构成的（子房）。"},"examples":[{"en":"The species is described as having a five-carpellate ovary.","zh":"该物种被描述为具有五心皮的子房。"},{"en":"In some flowers, a five-carpellate gynoecium forms a star-like pattern in cross-section.","zh":"在一些花中，五心皮的雌蕊群在横切面上会呈现星形图案。"}]}],"synonyms":["pentacarpellate","five-carpelled"],"phonetic":"/ˌfaɪv kɑrˈpɛlət/","extraExplanation":["“carpellate”来自“carpel（心皮）”。心皮是花的雌性器官组成部分，通常包括柱头、花柱与子房；子房内含胚珠，成熟后形成果实与种子。","“five-carpellate”多见于植物分类学与形态学描述，用来帮助区分物种或类群。常与“ovary（子房）”“gynoecium（雌蕊群）”等词搭配。","相关常见形式：three-carpellate（三心皮的）、bi-carpellate/2-carpellate（两心皮的）、multi-carpellate（多心皮的）。注意：carpel 数量与“pistil（雌蕊）”的关系因花的结构（合生/离生）而不同。"]}
{"word":"five-carpelled","summary":{"en":"A botanical adjective meaning “having five carpels.”","zh":"植物学形容词，表示“具有五个心皮（五心皮）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five carpels (female reproductive units) in a flower’s ovary; made up of five carpels.","zh":"（植物学）五心皮的；花的子房由五个心皮组成的。"},"examples":[{"en":"The ovary is five-carpelled, which helps identify the species.","zh":"子房为五心皮，这有助于鉴定该物种。"},{"en":"In this genus, flowers are typically five-carpelled and form a single compound ovary.","zh":"在这个属中，花通常为五心皮，并形成一个合生子房。"}]}],"synonyms":["pentacarpellate","five-carpellate"],"phonetic":"/ˌfaɪv ˈkɑr.pəld/","extraExplanation":["“carpel（心皮）”是雌蕊的基本单位之一，可单独存在，也常多个合生形成一个子房。描述“five-carpelled”时，通常用于植物分类与形态学特征记录。","相关近义表达常见于学术写作：pentacarpellate / five-carpellate（均指“五心皮的”）。"]}
{"word":"five-celled","summary":{"en":"Five-celled describes something that has five cells or compartments.","zh":"five-celled 指“由五个细胞或五个隔间组成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five cells or separate compartments (often used in biology or technical descriptions).","zh":"有五个细胞或五个独立隔间的（常用于生物学或技术描述）。"},"examples":[{"en":"Under the microscope, the organism appears five-celled.","zh":"在显微镜下，这种生物看起来是五细胞的。"},{"en":"They stored samples in a five-celled tray to keep them separate.","zh":"他们把样本放在五格托盘里，以便彼此分开。"}]}],"synonyms":["five-chambered","five-compartment"],"phonetic":"/ˈfaɪv sɛld/","extraExplanation":["“five-celled”是由数字 + 过去分词/形容词（celled）构成的复合形容词，通常用连字符连接，用来修饰名词：a five-celled structure（一个五室/五细胞的结构）。","“celled”在这里表示“由……个细胞/小室组成”，不一定只指生物细胞，也可以指“隔间、牢房”等（如：a three-celled battery 三格电池）。"]}
{"word":"five-chambered","summary":{"en":"“Five-chambered” means having five separate chambers or enclosed spaces.","zh":"“five-chambered”意为“有五个腔/室的”，指具有五个分隔空间的结构或器官。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five chambers (separate enclosed spaces), especially used to describe an organ or structure.","zh":"有五个腔（彼此分隔的空间）的；尤用于描述器官或结构。"},"examples":[{"en":"Scientists described the insect’s five-chambered heart in the report.","zh":"科学家在报告中描述了这种昆虫的五腔心脏。"},{"en":"The story imagines a five-chambered palace hidden underground.","zh":"故事想象了一座隐藏在地下的五室宫殿。"}]}],"synonyms":["five-roomed","five-celled","pentacameral"],"phonetic":"/ˌfaɪv ˈtʃeɪmbərd/","extraExplanation":["“five-chambered”是由“five + chambered（有……腔/室的）”构成的复合形容词，常用于较正式或科学写作中。","在生物学语境里，chamber指“腔室”，常见于心脏（heart chambers）或某些器官结构的描述；在文学中也可能被用作隐喻，强调“层次很多、内心复杂”。"]}
{"word":"five-channel","summary":{"en":"“Five-channel” means having or using five separate channels, especially in audio systems.","zh":"“five-channel”指具有或使用五个独立通道，尤其常用于音频系统（五声道）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or using five separate channels (paths for signals, communication, or audio).","zh":"具有或使用五个独立“通道”（用于信号、通信或音频的路径）的。"},"examples":[{"en":"This receiver supports five-channel audio for a home theater setup.","zh":"这台接收机支持五声道音频，适合家庭影院。"},{"en":"The researchers recorded data using a five-channel sensor system.","zh":"研究人员使用五通道传感器系统记录数据。"}]}],"synonyms":["five-track","multichannel (five-channel)","5-channel"],"phonetic":"/ˈfaɪv ˌtʃænəl/","extraExplanation":["“channel（通道）”在不同领域含义相近：都指信息/信号传输的独立路径。在音频里，five-channel 常指 5.0（前左、前右、中置、环绕左、环绕右）这五个扬声器通道；如果再加一个低音炮通道（.1），就变成更常见的 5.1。写作上也常见 five-channel / five channel / 5-channel / five‑channel（作定语时常用连字符）。"]}
{"word":"five-character quatrain","summary":{"en":"A four-line Chinese poem with five characters per line.","zh":"四句、每句五字的中文诗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Chinese poetic form consisting of four lines, with five Chinese characters in each line (五言绝句).","zh":"一种中文诗体：每首四句，每句五个字（五言绝句）。"},"examples":[{"en":"Li Bai wrote many famous five-character quatrains that are still memorized today.","zh":"李白写过许多著名的五言绝句，至今仍被人背诵。"},{"en":"In class, we analyzed the rhythm and imagery of a five-character quatrain.","zh":"课上我们分析了一首五言绝句的节奏与意象。"},{"en":"Try writing a five-character quatrain about spring using simple words.","zh":"试着用简单的词写一首描写春天的五言绝句。"}]}],"synonyms":["wuyan jueju","five-word quatrain","five-character jueju"],"phonetic":"/ˌfaɪv ˈkærɪktɚ kwɑːˈtreɪn/","extraExplanation":["“五言绝句”常见于唐诗：全诗四句，每句五字；常见的格律要求包括押韵与平仄（在入门阶段可先关注意象与节奏）。","英语里的 quatrain 通常指“四行一节”，不一定像中文绝句那样严格定字数或格律；因此在英文语境中说明“each line has five characters”会更清楚。"],"etymology":"该短语是对中文诗体“五言绝句”的直译：five-character（每句五字）+ quatrain（四行诗/四句诗）。英语里 quatrain 源自法语，指“四行诗节”。","mnemonic":["记忆法：quatrain 含有 quat-（类似“四”），提醒你“四句”；five-character 提醒“每句五字”。","把它直接对应到“5言+绝句”：five（五）+ character（字）→ 五言；quatrain（四行）→ 绝句（四句）。"]}
{"word":"five-city","summary":{"en":"“five-city” describes something that includes or covers five cities, usually as a hyphenated adjective before a noun.","zh":"“five-city”表示“涉及/覆盖五个城市的”，通常以连字符形式作名词前的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"involving five cities (often used before a noun, as in travel, events, or business plans).","zh":"涉及五个城市的（常用作定语，如旅行、活动或商业计划中）。"},"examples":[{"en":"We planned a five-city tour across the West Coast.","zh":"我们计划了一次横跨西海岸的五城巡演。"},{"en":"The company launched a five-city campaign to promote the new product.","zh":"公司在五个城市开展了一场推广新产品的宣传活动。"},{"en":"She has a five-city business trip next month.","zh":"她下个月有一次跑五个城市的出差。"}]}],"synonyms":["five-city (tour/trip/campaign)","spanning five cities","covering five cities","across five cities"],"phonetic":"/faɪv ˈsɪti/","extraExplanation":["“five-city”通常是临时性的复合形容词（compound adjective），放在名词前面时常用连字符：a five-city tour / a five-city trip。","如果放在名词后面作表语，一般不加连字符：The tour is five cities long.（这次巡演跨五个城市。）","类似结构：two-day, three-week, ten-minute 等（数字 + 名词单数 + 连字符 + 名词）。"]}
{"word":"five-cleft","summary":{"en":"“Five-cleft” describes a plant part that is deeply split into five lobes.","zh":"“five-cleft”指植物的某个部位深裂成五个裂片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) divided into five clefts or deep lobes; split into five parts.","zh":"（植物）裂成五裂的；深裂为五部分的。"},"examples":[{"en":"The leaf is five-cleft, with each lobe narrow and pointed.","zh":"这片叶子是五裂的，每个裂片都很窄而且尖。"},{"en":"Look for five-cleft petals when identifying this wildflower.","zh":"辨认这种野花时，可以留意花瓣是否呈五裂。"}]}],"synonyms":["five-lobed","quinquefid","palmately lobed"],"phonetic":"/ˈfaɪv ˌklɛft/","extraExplanation":["“five-cleft”多见于植物学/自然观察的描述性写作，表示“深裂成五个裂片”，常用于叶片（leaf）、花瓣（petal）或萼片（sepal）。","形式上常用连字符（five-cleft）作定语；也可能看到不加连字符的写法（five cleft），但作形容词定语时加连字符更清晰。"]}
{"word":"five-color","summary":{"en":"Five-color means “having five colors” or “a design/item that uses five colors.”","zh":"five-color 指“有五种颜色的”，也可指“采用五种颜色的图案/款式或物品”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or showing five different colors.","zh":"五色的；由五种颜色组成的。"},"examples":[{"en":"The artist painted a five-color pattern on the wall.","zh":"艺术家在墙上画了一个五色图案。"},{"en":"She wore a five-color scarf that stood out in the crowd.","zh":"她戴着一条五色围巾，在人群中很显眼。"}]},{"partOfSpeech":"n.","definition":{"en":"A design, item, or style that uses five colors (often used as a descriptive label).","zh":"（作为名称/标签）五色图案、五色款式或由五种颜色构成的物品。"},"examples":[{"en":"This fabric comes in solid colors and in five-color prints.","zh":"这种布料既有纯色款，也有五色印花款。"},{"en":"They chose the five-color version for the festival decorations.","zh":"他们为节日装饰选择了五色款。"}]}],"synonyms":["multicolored","five-colored","colorful","polychrome"],"phonetic":"/ˈfaɪv ˌkʌlər/","extraExplanation":["“five-color / 五色”在中文文化语境中常与传统“正色”或五行观念相关联，不同传统会把五色对应为青（或绿）、赤（红）、黄、白、黑，用来表达方位、元素、礼制等象征意义。英语里说 five-color 通常只是字面意思“有五种颜色”，但在谈到东亚传统艺术、纹样、旗帜或节庆装饰时，可能带有这种文化联想。","在印刷或设计领域也可能见到类似说法（如多色印刷），但更常见的技术表达是 “four-color process（四色印刷）”；“five-color”更多是描述性用语。"]}
{"word":"five-colored","summary":{"en":"“Five-colored” means having five colors, and it can also be used in a literary way to mean vividly multicolored.","zh":"“five-colored”指“有五种颜色的”，也可在文学或描写中引申为“色彩绚丽、五彩斑斓的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five different colors; showing a mix of five colors.","zh":"有五种颜色的；呈现五色混合的。"},"examples":[{"en":"The artist used a five-colored palette to create a bold poster.","zh":"这位艺术家用了五色调色板来制作一张醒目的海报。"},{"en":"The flag was five-colored, with each stripe representing a region.","zh":"这面旗帜是五色的，每一条色带代表一个地区。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often literary) Brightly or richly colored; multicolored in a vivid way.","zh":"（常见于文学用法）色彩绚丽的；五彩斑斓的。"},"examples":[{"en":"In spring, the market becomes a five-colored sea of flowers.","zh":"到了春天，集市成了一片五彩斑斓的花海。"},{"en":"The poem describes a five-colored sky at sunset.","zh":"这首诗描写了日落时五彩斑斓的天空。"}]}],"synonyms":["multicolored","many-colored","varicolored","colorful"],"phonetic":"/ˌfaɪv ˈkʌlɚd/","extraExplanation":["“five-colored”在英语里通常是字面意思“有五种颜色”。在文学或描写性语境中，也常被用来泛指“色彩繁多、绚丽”，类似于“multicolored / many-colored”。","书写上常用连字符（five-colored）作定语：a five-colored scarf；也可在名词后作表语：The scarf is five-colored."]}
{"word":"five-column","summary":{"en":"“Five-column” describes something laid out in, or spanning, five columns (common in page and newspaper design).","zh":"“five-column”指以五栏（五列）排版，或宽度横跨五栏（常见于版面与报纸标题）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a page, layout, table, or headline) arranged across five vertical columns.","zh":"（页面、版式、表格或标题）按五个竖向栏（列）排版的；横跨五栏的。"},"examples":[{"en":"The report is formatted in a five-column table.","zh":"这份报告用五列表格来排版。"},{"en":"The newspaper ran a five-column headline on the front page.","zh":"那家报纸在头版用了一个横跨五栏的通栏标题。"}]}],"synonyms":["five-columned","in five columns","spanning five columns"],"phonetic":"ˌfaɪv ˈkɑləm","extraExplanation":["在英文排版与新闻写作里，常用“X-column”描述版面宽度或标题横跨的栏数（例如 two-column、three-column、five-column）。传统报纸一版往往分成多栏，所以“five-column headline”通常指宽度很大、很醒目的通栏标题。"]}
{"word":"five-compartment","summary":{"en":"“Five-compartment” describes something divided into five separate sections.","zh":"“five-compartment”指某物被分成五个独立隔间/分区。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five separate sections or compartments (parts) within one structure, system, or container.","zh":"（某结构、系统或容器）由五个独立的隔间/分区组成的；五隔间的；五分区的。"},"examples":[{"en":"The museum uses a five-compartment display case to separate fragile items.","zh":"博物馆使用五隔间的展示柜来分开放置易碎物品。"},{"en":"Researchers tested a five-compartment model to describe how a disease spreads through a population.","zh":"研究人员测试了一个五分区模型，用来描述疾病在人群中的传播。"},{"en":"In the report, the authors describe a five-compartment battery pack design.","zh":"在报告中，作者描述了一种五隔间电池组的设计。"}]}],"synonyms":["five-section","five-part","pentacompartmental"],"phonetic":"/faɪv kəmˈpɑrtmənt/","extraExplanation":["“five-compartment”常作定语形容词放在名词前（如 five-compartment model/case/pack），用连字符是英语里常见的“数字+名词”复合修饰语写法。","它多见于技术或学术语境（工程设计、物流收纳、流行病/生态等“分区模型”），表示把整体明确分成五个功能区或储存区。"]}
{"word":"five-component","summary":{"en":"“Five-component” describes something consisting of five parts or elements.","zh":"“five-component”表示“由五个部分或要素组成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made up of five parts, elements, or ingredients; having five main components.","zh":"由五个部分/要素/成分组成的；含有五个主要组成部分的。"},"examples":[{"en":"The lab developed a five-component mixture for the experiment.","zh":"实验室为该实验配制了一种五组分混合物。"},{"en":"We use a five-component scoring system to evaluate speaking skills.","zh":"我们使用一个五项评分体系来评估口语能力。"},{"en":"The device has a five-component design for easy repair.","zh":"这款设备采用五部件设计，便于维修。"}]}],"synonyms":["five-part","five-element","five-partite","five-piece"],"phonetic":"/ˌfaɪv kəmˈpoʊnənt/","extraExplanation":["“five-component”常作定语修饰名词，常见于科技、工程、管理等语境（如 five-component model/system）。在名词前通常用连字符：a five-component system；放在名词后或更偏描述时也可能不加连字符：The system is five component(s)，但这种用法较少，且常写作 five-component 或 five components（作名词短语）。"]}
{"word":"five-cubit","summary":{"en":"“Five-cubit” means “measuring five cubits,” an ancient unit of length.","zh":"“five-cubit”指“长（高/宽）为五肘”，其中“肘”是古代长度单位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"measuring five cubits in length (or height/width), using the ancient unit “cubit.”","zh":"长（或高/宽）为五肘（cubit）——使用古代长度单位“肘”来计量。"},"examples":[{"en":"The altar was described as five-cubit long and five-cubit wide.","zh":"这座祭坛被描述为长五肘、宽五肘。"},{"en":"A five-cubit wall would be about seven or eight feet high, depending on the cubit used.","zh":"一堵五肘高的墙大约有七到八英尺高，具体取决于“肘”的长度定义。"}]}],"synonyms":["five cubits long","five-cubit-long"],"phonetic":"/ˌfaɪv ˈkjuːbɪt/","extraExplanation":["“cubit（肘）”是古代常见的长度单位，原意大致为“从肘部到指尖”的距离；不同地区与时期的肘长不完全一致，所以“五肘”在现代换算会有一定范围。","“five-cubit”这类表达常见于《圣经》或古代文献的尺寸描述中（如建造祭坛、帐幕、器物等），用于营造一种古典、仪式化的测量语感。"]}
{"word":"five-cyano","summary":{"en":"“five-cyano” (usually written 5-cyano-) means a cyano group is attached at the 5-position in a chemical structure name.","zh":"“five-cyano”（通常写作5-cyano-）表示在化学结构命名中，氰基连接在第5位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry) Having a cyano group (–C≡N) attached at the 5-position on a ring or chain in a compound’s name (often written as “5-cyano-”).","zh":"（化学）指在化合物的环或碳链的第5位连接有一个氰基（–C≡N）的命名描述（常写作“5-cyano- / 5-氰基-”）。"},"examples":[{"en":"The report describes a 5-cyano pyridine derivative used as an intermediate.","zh":"报告描述了一种5-氰基吡啶衍生物，用作中间体。"},{"en":"In the name, “five-cyano” tells you where the –C≡N group is located on the ring.","zh":"在名称中，“five-cyano（5-氰基）”告诉你–C≡N基团在环上的位置。"}]}],"synonyms":["5-cyano-","5-cyano (substituted)"],"phonetic":"/faɪv ˈsaɪənoʊ/","extraExplanation":["在有机化学命名里，“5-”是位次编号，表示取代基连在母体结构的第5个位置；“cyano”表示氰基（–C≡N）。实际写法更常见的是“5-cyano-”而不是完整拼写“five-cyano”。","位次编号的起点和方向由命名规则决定（例如优先官能团、杂原子位置、最低位次原则等），所以“5位”是相对于该母体结构的标准编号体系而言的。"]}
{"word":"five-cyclic","summary":{"en":"“Five-cyclic” means having or repeating in five cycles; in technical contexts (especially chemistry) it may describe a five-ring or five-membered cyclic structure.","zh":"“five-cyclic”指“具有五个循环/以五个周期重复”的；在技术语境（尤其化学）中也可能指“五环的”或“与五元环有关的结构”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five cycles, repeating stages, or periodic patterns; occurring in a series of five cycles.","zh":"具有五个循环/周期的；以五个周期为一组重复发生的。"},"examples":[{"en":"The training plan is five-cyclic, repeating every five weeks.","zh":"这个训练计划是五周期循环的，每五周重复一次。"},{"en":"We analyzed the system’s five-cyclic behavior over time.","zh":"我们分析了该系统随时间变化的五周期循环特征。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, less common) Relating to a structure that involves five rings or a five-membered cyclic unit, depending on context.","zh":"（化学，较少见）与含五个环的结构或五元环（取决于语境）有关的。"},"examples":[{"en":"They studied a five-cyclic compound with multiple fused rings.","zh":"他们研究了一种含多个稠合环的“五环”化合物。"},{"en":"The molecule includes a five-cyclic core that affects its stability.","zh":"该分子包含一个五环核心，影响其稳定性。"}]}],"synonyms":["five-cycle","five-period","pentacyclic (chemistry)","periodic (general)"],"phonetic":"/faɪv ˈsaɪklɪk/","extraExplanation":["“five-cyclic”不是非常固定、常见的词典词条，更像是技术写作里临时组合出来的形容词（five + cyclic）。具体含义通常要看领域：在一般语境里多指“每五个周期重复一次”；在化学语境里可能指“五环的”或“与五元环有关的”。","书写上常见连字符（five-cyclic）用于强调它是一个整体修饰词；也有人写成 five cyclic（更口语/松散）或 five-cycle / five-cycled（不同作者偏好）。如果你能提供一句原文，我可以按该句语境给出更精准的释义。"]}
{"word":"five-day","summary":{"en":"lasting five days","zh":"为期五天的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lasting for five days; happening over a period of five days.","zh":"持续五天的；为期五天的。"},"examples":[{"en":"The conference is a five-day event with workshops and talks.","zh":"这次会议为期五天，包括工作坊和演讲。"},{"en":"She signed up for a five-day training program.","zh":"她报名参加了一个为期五天的培训项目。"}]}],"synonyms":["five-day-long","five-day-duration"],"phonetic":"/ˈfaɪv deɪ/","extraExplanation":["拼写要点：作定语时通常写作 five-day（a five-day trip）。如果放在名词后作表语，常写作 five days（The trip lasted five days.）。","发音要点：连字符不影响发音，读起来就像“five day”。"],"etymology":"由数字“five”和名词“day”构成的复合形容词；英语中这类“数字 + 单位名词”作定语时常用连字符（hyphen）连接，如 a three-hour call, a ten-minute break。","mnemonic":["把它当成“5天套餐/5天行程”：five（五）+ day（天）→ 为期五天的。","联想同类结构：three-day holiday（三天假）、two-week course（两周课程）→ 数字+单位常用来表达“为期……”"]}
{"word":"five-dentate","summary":{"en":"Five-dentate means having five tooth-like points along an edge.","zh":"five-dentate 指“边缘有五个齿状尖突/缺刻”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having five tooth-like points or notches along an edge (for example, on a leaf, petal, shell, or other structure).","zh":"（植物学/动物学）边缘有五个像牙齿一样的尖突或缺刻（例如叶片、花瓣、贝壳或其他结构的边缘）。"},"examples":[{"en":"The botanist described the leaf margin as five-dentate.","zh":"植物学家把叶缘描述为五齿状。"},{"en":"In the field guide, the petals are noted as five-dentate near the tip.","zh":"在野外图鉴中提到花瓣在尖端附近呈五齿状。"}]}],"synonyms":["five-toothed","pentadentate","five-notched"],"phonetic":"/faɪv ˈdɛn.teɪt/","extraExplanation":["“dentate”来自拉丁语 dens（牙齿），在生物形态描述里表示“有齿状边缘”。“five-”表示齿的数量，因此 five-dentate 是一种非常精确的形态学术语，多见于分类学或科学描写中。"]}
{"word":"five-digit","summary":{"en":"“Five-digit” describes something with five digits, especially a number between 10,000 and 99,999.","zh":"“five-digit”表示“五位数的”，尤其指 10,000 到 99,999 之间的数字或相关金额/编号等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five digits (usually referring to a number with five numerals, from 10,000 to 99,999).","zh":"五位数的（通常指由五个数字组成的数，范围一般为 10,000 到 99,999）。"},"examples":[{"en":"The invoice number is a five-digit code.","zh":"发票号码是一个五位数代码。"},{"en":"In the U.S., a ZIP Code is usually five digits.","zh":"在美国，邮政编码通常是五位数。"},{"en":"She got a five-digit raise this year.","zh":"她今年加薪达五位数（金额）。"}]}],"synonyms":["five-figure (for money)","10,000–99,999 (range)"],"phonetic":"/ˌfaɪv ˈdɪdʒɪt/","extraExplanation":["“five-digit”是复合形容词，常用连字符（hyphen）连接，放在名词前作定语：a five-digit number / a five-digit salary。放在名词后也可用不带连字符的形式：The number is five digits long（这个数有五位）。","口语里“five-digit salary/raise”常强调“金额达到五位数”，不一定透露具体数额；语境通常是以美元等货币计。"]}
{"word":"five-dotted","summary":{"en":"“Five-dotted” means marked with five dots or a five-dot pattern.","zh":"“five-dotted”表示“有五个点/五点图案的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five dots or dot-like marks (often describing a pattern).","zh":"有五个点（或点状标记）的；五点图案的。"},"examples":[{"en":"The tile has a five-dotted pattern like the five on a die.","zh":"这块牌上有五点的图案，就像骰子上的“五”。"},{"en":"She chose a five-dotted scarf with a simple, classic look.","zh":"她选了一条五点花纹的围巾，简洁又经典。"}]}],"synonyms":["five-spotted","dotted","spotted","speckled"],"phonetic":"/ˌfaɪv ˈdɑtɪd/","extraExplanation":["“five-dotted”不是特别常见的固定词，更像是临时组合出来的形容词（可写作 five-dotted / five dotted）。常用于描述图案：例如骰子（die）点数“5”的那种布局（四角加中间一点）。","如果你是在特定领域（如昆虫学、植物学、纹样设计）里看到它，它可能指某个物种或图案“带有五个斑点/点纹”。具体含义要结合上下文确认。"]}
{"word":"five-faced","summary":{"en":"“Five-faced” means having five faces/sides (literally), and can sometimes be used figuratively to mean multi-sided or complex.","zh":"“five-faced”主要指“有五个面/五个侧面”的（字面义），有时也可比喻“多面、复杂”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five faces or sides; shaped like something with five flat surfaces (a pentagonal form).","zh":"有五个面/五个侧面的；呈五面体或五边形结构的。"},"examples":[{"en":"The crystal was described as a five-faced prism in the lab report.","zh":"实验报告把这种晶体描述为“五面棱柱”。"},{"en":"A five-faced panel can create interesting angles in a small room.","zh":"五面板在小房间里能形成很有趣的角度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common, figurative) Showing several different sides or roles; multi-sided in character, often suggesting complexity.","zh":"（较少见，比喻）有多面性、扮演多种角色的；性格或立场复杂的。"},"examples":[{"en":"In the novel, the villain is five-faced—charming in public but cruel in private.","zh":"在小说里，反派“有五面性”——公众面前迷人，私下却残忍。"},{"en":"She gave a five-faced answer that avoided taking a clear position.","zh":"她给了一个“多面”的回答，回避了明确表态。"}]}],"synonyms":["five-sided","pentagonal","multi-sided","multifaceted"],"phonetic":"/ˌfaɪv ˈfeɪst/","extraExplanation":["“five-faced”并不是非常常见的日常词，更常见的表达是“five-sided / pentagonal（五边形的）”用于形状；如果想表达“多面性”，更自然的词通常是“multifaceted / many-sided”。","这个词常用连字符（hyphen）作复合形容词：a five-faced object / a five-faced design。"]}
{"word":"five-finger","summary":{"en":"“Five-finger” is mainly used in compounds: it can mean involving all five fingers (e.g., five-finger gloves/exercises), and in slang it appears in “five-finger discount,” meaning shoplifting.","zh":"“five-finger”多用于复合词：可指与五根手指有关（如五指手套/五指练习）；在俚语“five-finger discount”中指商店行窃。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in compounds) Describing something that uses or covers all five fingers of one hand.","zh":"（多用于复合词）形容“用到/覆盖一只手的五根手指”的。"},"examples":[{"en":"These are five-finger gloves, so each finger has its own sleeve.","zh":"这是五指手套，每根手指都有独立的指套。"},{"en":"The beginner practiced with a five-finger exercise on the piano.","zh":"初学者在钢琴上练习了五指练习。"}]},{"partOfSpeech":"phrase","definition":{"en":"(slang, informal) Used in expressions like “five-finger discount,” meaning shoplifting (stealing from a store).","zh":"（俚语，非正式）用于如“five-finger discount”等说法，指在商店行窃（顺手牵羊）。"},"examples":[{"en":"The store posted a sign warning against the “five-finger discount.”","zh":"商店贴了告示，警告不要“顺手牵羊”。"},{"en":"He got in trouble for trying to take a five-finger discount.","zh":"他因为想顺手偷东西而惹上麻烦。"}]}],"synonyms":["five-finger discount (shoplifting)","shoplifting","steal","five-finger exercise"],"phonetic":"/ˌfaɪv ˈfɪŋɡɚ/","extraExplanation":["“five-finger discount”是一种委婉又带讽刺意味的说法：把“用手拿走东西”说成“打折”。在正式场合不建议使用；写作或新闻中更常用 shoplifting / theft（行窃/盗窃）。"]}
{"word":"five-fingered","summary":{"en":"“Five-fingered” means having five fingers, or shaped like a hand with five fingers.","zh":"“five-fingered”指“有五个手指的”，也可指“形状像五指张开的手”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five fingers on a hand (or five digits on a limb); describing something shaped like a human hand.","zh":"（手）有五个手指的；（或肢体）有五个指（趾）的；也可形容“像人手一样”的形状。"},"examples":[{"en":"Humans are five-fingered primates.","zh":"人类是有五个手指的灵长类动物。"},{"en":"The five-fingered glove fits better than the mitten.","zh":"五指手套比连指手套更合手。"},{"en":"The leaf has a five-fingered shape, like an open hand.","zh":"这片叶子呈“五指状”，像张开的手。"}]}],"synonyms":["five-digit","five-toed (for feet)","hand-shaped"],"phonetic":"/ˌfaɪv ˈfɪŋɡɚd/","extraExplanation":["“five-fingered”通常用连字符作形容词，放在名词前：five-fingered glove / five-fingered hand。也可写作 five fingered（较少见）。","在生物学语境中，它常用来描述“每只手有五个指头”的特征；在日常语境中也常指“五指手套”（区别于 mitten 连指手套）。"]}
{"word":"five-fingeredness","summary":{"en":"Five-fingeredness means having five fingers (or toes) on a hand (or foot), often discussed in biology as pentadactyly.","zh":"five-fingeredness 指手（或脚）具有五个手指（或脚趾）的特征，生物学中常称为 pentadactyly（五指型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition or quality of having five fingers (or toes) on each hand (or foot); pentadactyly.","zh":"每只手（或脚）有五个手指（或脚趾）的特征或状态；五指（趾）性。"},"examples":[{"en":"In most humans, five-fingeredness is the normal pattern of the hands.","zh":"对大多数人来说，手部的五指性是正常的形态。"},{"en":"The textbook compared five-fingeredness in primates with other limb structures.","zh":"这本教材比较了灵长类的五指性与其他肢体结构。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, the state of having five digits on a limb in animals, especially in biology or evolution discussions.","zh":"更广义地指动物肢体具有五个“指/趾”（五个末端骨骼单位）的状态，常用于生物学或进化相关讨论。"},"examples":[{"en":"Scientists study how five-fingeredness evolved from earlier fin-like structures.","zh":"科学家研究五指性如何从更早期的鳍状结构进化而来。"},{"en":"Many vertebrates show traces of five-fingeredness even when the digits are reduced.","zh":"许多脊椎动物即使指（趾）数减少，也仍能看到五指性的痕迹。"}]}],"synonyms":["pentadactyly","five-digit structure","five-fingered condition"],"phonetic":"/ˌfaɪv ˈfɪŋɡɚdnəs/","extraExplanation":["“five-fingeredness”较少在日常口语中使用，更常见的科学术语是“pentadactyly（五指型）”。在进化生物学里，“五指型肢体”常被用作脊椎动物（尤其是四足动物）共有的基本结构框架。","该词有时也会被用于轻松或幽默的语境中，强调“像人手一样的五根手指”这一形象特征。"]}
{"word":"five-foliate","summary":{"en":"Five-foliate describes a plant part that has five leaves or five leaflets.","zh":"five-foliate 指植物部位为五叶的或具五个小叶的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five leaves or five leaflets; divided into five leaf-like parts.","zh":"（植物学）五叶的；具五个小叶的；分成五个叶状部分的。"},"examples":[{"en":"The vine has five-foliate leaves, with five leaflets radiating from one point.","zh":"这株藤本植物是五叶复叶，五个小叶从同一点向外展开。"},{"en":"In the field guide, the species is described as five-foliate and palmately compound.","zh":"在野外图鉴中，这个物种被描述为五叶的、掌状复叶。"}]}],"synonyms":["five-leaflet","quinquefoliate","palmately compound (often related)"],"phonetic":"/ˌfaɪv ˈfoʊ.li.eɪt/","extraExplanation":["“foliate”来自拉丁语 *folium*（叶子），在植物学里常用来描述“有多少叶/小叶”的特征，例如：three-foliate（三叶的）、five-foliate（五叶的）。","“five-foliate”常出现在植物鉴定、园艺说明或学术描述中；日常英语里更常见的说法是“having five leaflets / five leaves”。","注意区分：有些植物是一片“叶”分裂成五裂（five-lobed），而有些是“复叶”由五个“小叶”组成（five-foliate / five-leaflet）。"]}
{"word":"five-foot","summary":{"en":"“Five-foot” means measuring five feet in length/height, often used as a hyphenated adjective before a noun.","zh":"“five-foot”表示“五英尺长/高的”，常作带连字符的复合形容词放在名词前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a length or height of five feet (about 152 centimeters).","zh":"五英尺长/高的（约152厘米）。"},"examples":[{"en":"The fence is five-foot tall, so it’s easy to see over.","zh":"这道栅栏有五英尺高，所以很容易看过去。"},{"en":"She ordered a five-foot table for her studio.","zh":"她为工作室订了一张五英尺长的桌子。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is five feet tall.","zh":"身高五英尺的人（约152厘米）。"},"examples":[{"en":"He’s a five-foot, but he plays basketball with confidence.","zh":"他身高五英尺，但打篮球很有自信。"}]}],"synonyms":["five feet tall","five-foot-tall","five-foot-long"],"phonetic":"/ˌfaɪv ˈfʊt/","extraExplanation":["“five-foot”常用作复合形容词，放在名词前，并且通常用连字符：a five-foot wall（五英尺高的墙）。如果放在名词后，更多用不加连字符的表达：The wall is five feet tall（墙有五英尺高）。","英美口语里也会用“a five-footer”来指“五英尺高的人/物”，语气较随意；描述身高时更常说“She is five feet tall.”（她身高五英尺）。"]}
{"word":"five-footed","summary":{"en":"Five-footed means either “having five feet/legs” or, in poetry, “having five metrical feet per line” (pentameter).","zh":"five-footed 可指“有五只脚/腿的”，也可在诗歌中指“每行五个音步的”（五音步）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five feet (or legs).","zh":"有五只脚（或腿）的；五足的。"},"examples":[{"en":"The starfish is a five-footed sea creature.","zh":"海星是一种五足的海洋生物。"},{"en":"In the story, the monster is described as five-footed and fast.","zh":"在故事里，这个怪物被描写成有五只脚而且跑得很快。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Poetry) Written in lines that have five metrical “feet”; pentameter.","zh":"（诗歌）每行有五个音步的；五音步的（即“抑扬五音步”等）。"},"examples":[{"en":"Shakespeare often wrote in five-footed iambic lines.","zh":"莎士比亚经常用五音步的抑扬格诗行来写作。"},{"en":"Try reading the poem aloud to feel the rhythm of the five-footed line.","zh":"试着把诗朗读出来，感受五音步诗行的节奏。"}]}],"synonyms":["pentameter (poetry)","five-legged"],"phonetic":"/ˌfaɪv ˈfʊtɪd/","extraExplanation":["在诗歌里，“foot（音步）”不是“脚”的意思，而是节奏单位（由重读/轻读或长短音构成）。因此 five-footed 常指 pentameter（五音步），例如 iambic pentameter（抑扬五音步），在英语文学中非常常见。"]}
{"word":"five-fourths","summary":{"en":"Five-fourths means the fraction 5/4 (1.25), and it can also describe 5/4 time in music.","zh":"five-fourths 表示分数 5/4（一又四分之一），也可用于指音乐中的 5/4 拍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The fraction 5/4 (one and one quarter).","zh":"分数 5/4（也就是一又四分之一）。"},"examples":[{"en":"Five-fourths is equal to 1.25.","zh":"五分之四等于 1.25。"},{"en":"If you eat five-fourths of the cake, you ate more than a whole cake.","zh":"如果你吃了蛋糕的五分之四，你吃的就超过了一整个蛋糕。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something measured in a 5/4 unit, especially a musical rhythm with five quarter-note beats in each measure.","zh":"用于描述以 5/4 计量的事物，尤指音乐中的 5/4 拍（每小节五个四分音符的节拍）。"},"examples":[{"en":"This song is in five-fourths time, so the beat feels unusual.","zh":"这首歌是 5/4 拍，所以节奏听起来有点不寻常。"},{"en":"The drummer kept a steady five-fourths rhythm.","zh":"鼓手保持了稳定的 5/4 节奏。"}]}],"synonyms":["five fourths","five over four","5/4","one and one quarter","one-and-a-quarter"],"phonetic":"/ˌfaɪv ˈfɔrθs/","extraExplanation":["“five-fourths”在数学里常写作“five fourths”或“5/4”，读作“five fourths / five over four”。作为带连字符的形式（five-fourths）更像一个整体单位，常用于修饰名词（如 five-fourths time）。","在音乐语境中，5/4 拍属于不规则拍号（odd meter），听感常比 4/4 更“拧巴”或更有推进感。常见例子包括 Dave Brubeck 的《Take Five》。"]}
{"word":"five-globed","summary":{"en":"Five-globed means “having five globe-shaped parts,” and it can also be used poetically for something imagined as made of five globe-like realms.","zh":"five-globed 指“有五个球形部分的”，也可作诗意用法，表示被想象成由五个球状领域构成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five globes (round, ball-like parts); made up of five spherical sections.","zh":"有五个球体的；由五个圆球状部分组成的。"},"examples":[{"en":"The lamp had a five-globed shade, each globe casting a soft light.","zh":"这盏灯的灯罩是五球状的，每个球罩都投出柔和的光。"},{"en":"In the museum, a five-globed ornament hung from the ceiling.","zh":"在博物馆里，一个五球状的装饰物从天花板垂下。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/poetic) Describing something imagined as consisting of five “worlds” or globe-like realms.","zh":"（少见/诗意用法）形容某物被想象成由五个“世界”或球状领域构成的。"},"examples":[{"en":"The poet spoke of a five-globed cosmos, layered and mysterious.","zh":"诗人谈到一个“五球宇宙”，层层叠叠而神秘。"}]}],"synonyms":["five-sphered","five-balled","five-orbed"],"phonetic":"ˌfaɪv ˈɡloʊbd","extraExplanation":["“five-globed”是由数字 + 过去分词/形容词构成的连字符复合形容词（类似“two-story”“three-sided”）。这种形式在描述外观结构时很常见，但“five-globed”本身较少见，更多出现在对器物造型的描写或带有想象色彩的文学表达中。","“globe”在这里通常指“球形灯罩/球体部件”（如路灯的玻璃球罩），而不一定是“地球”。因此理解时要结合语境：是具体物件的五个球形部分，还是诗歌里夸张的“多个世界/领域”。"]}
{"word":"five-grade","summary":{"en":"“Five-grade” means “having five levels or categories,” usually describing a scale or classification system.","zh":"“five-grade”通常指“有五个等级/级别的”，多用来修饰量表或分类系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a system, scale, or classification) having five levels or categories.","zh":"（系统、量表或分类）有五个等级/级别的。"},"examples":[{"en":"The hospital uses a five-grade triage system to prioritize patients.","zh":"医院使用五级分诊系统来优先处理病人。"},{"en":"We evaluated the product on a five-grade scale from A to E.","zh":"我们用从A到E的五级量表来评估这个产品。"},{"en":"The teacher adopted a five-grade rating scheme for presentations.","zh":"老师对展示采用了五级评分方案。"}]},{"partOfSpeech":"adj.","definition":{"en":"having an education level up to (or relating to) fifth grade (less common; often written “fifth-grade”).","zh":"达到/与小学五年级（或五年级程度）有关的（较少见；更常写作“fifth-grade”）。"},"examples":[{"en":"The booklet is written at a fifth-grade reading level.","zh":"这本小册子以五年级的阅读水平撰写。"},{"en":"Try to explain the idea in simple, fifth-grade language.","zh":"尽量用简单的、五年级程度的语言来解释这个想法。"}]}],"synonyms":["five-level","five-tier","five-point (when it’s a rating scale)"],"phonetic":"/ˈfaɪv ˌɡreɪd/","extraExplanation":["“five-grade”常见于技术或正式语境，修饰名词（如 five-grade scale / system / classification）。在教育语境里更常见的写法是“fifth-grade”（表示五年级或五年级水平）。","连字符（-）通常用在名词前作定语：a five-grade scale；若放在名词后，有时可写作 without hyphen：The scale is five grade(s) (less common)，更自然的表达是：a five-level scale。"]}
{"word":"five-grid","summary":{"en":"“Five-grid” usually means a five-box grid layout; in many Chinese-learning contexts it especially refers to five-grid handwriting practice paper.","zh":"“five-grid”通常指由五个格子组成的网格布局；在中文学习语境中常特指用于书写练习的“五格纸”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often in East Asian learning contexts) Referring to a writing or practice sheet divided into five small squares/sections in each unit, used to guide handwriting (especially Chinese characters).","zh":"（常见于东亚学习语境）指每个单元被分成“五格”的练习纸/格子，用来辅助书写（尤其是汉字）。"},"examples":[{"en":"My teacher asked us to write each character on five-grid paper.","zh":"老师让我们把每个汉字写在五格纸上。"},{"en":"Five-grid practice helps beginners keep their strokes balanced.","zh":"五格练习能帮助初学者把笔画写得更匀称。"}]},{"partOfSpeech":"n.","definition":{"en":"A layout, chart, or form made of five main boxes/areas arranged in a grid.","zh":"由五个主要方格/区域组成的网格布局、图表或表格。"},"examples":[{"en":"The app uses a five-grid layout on the home screen.","zh":"这个应用在主屏幕上使用了五格布局。"},{"en":"Fill in the five-grid form with your name, date, and notes.","zh":"把你的姓名、日期和备注填进五格表里。"}]}],"synonyms":["five-box grid","five-square grid","5×5 grid (if that is the intended meaning)"],"phonetic":"/ˈfaɪv ɡrɪd/","extraExplanation":["“five-grid”不是非常固定的通用英语词条，更多见于把中文学习用品/排版方式直译成英语的场景，例如“五格纸/田字格/米字格”等。英语里更自然的说法常是：\"five-square grid\"、\"five-box grid\"、或直接说具体用途：\"handwriting practice paper\"。","如果你指的是数学/工程里的“网格分辨率为5×5（five-by-five grid）”，英语通常写作 \"5×5 grid\" 或 \"five-by-five grid\"，而不太说 \"five-grid\"。"]}
{"word":"Five-hundred-meter Aperture Spherical Radio Telescope","summary":{"en":"a giant radio telescope in China used to study signals from space","zh":"中国的一座巨型射电望远镜，用于研究来自宇宙的射电信号"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very large single-dish radio telescope in China, commonly known as FAST, used to detect and study radio signals from space (for example, pulsars, neutral hydrogen, and fast radio bursts).","zh":"中国的一座超大型单口径射电望远镜（常称 FAST），用于接收并研究来自宇宙的射电信号（如脉冲星、中性氢、快速射电暴等）。"},"examples":[{"en":"FAST has helped astronomers discover new pulsars by detecting faint radio signals.","zh":"FAST 通过捕捉微弱的射电信号，帮助天文学家发现了新的脉冲星。"},{"en":"The Five-hundred-meter Aperture Spherical Radio Telescope is located in Guizhou, China.","zh":"五百米口径球面射电望远镜位于中国贵州。"},{"en":"Researchers use FAST to listen for signals from distant galaxies.","zh":"研究人员利用 FAST“聆听”来自遥远星系的信号。"}]}],"synonyms":["FAST","Tianyan","Five-hundred-meter Aperture Spherical Telescope"],"phonetic":"/faɪv ˈhʌndrəd ˈmiːtər ˈæpərtʃər ˈsfɛrɪkəl ˈreɪdioʊ ˈtɛləˌskoʊp/","extraExplanation":["Aperture 在望远镜语境里通常指“口径/有效开口”（能收集信号的面积大小），口径越大，一般越“敏感”，更容易接收到微弱信号。","Spherical（球面）描述其主反射面几何形状；FAST 的反射面可通过主动变形形成不同的抛物面区域来指向目标。","FAST 常用于射电天文学观测，而不是拍“照片”；它更像是在不同频段“接收并分析电波数据”。"],"etymology":"这是一个现代科技机构名称：Five-hundred-meter（五百米）+ Aperture（口径/有效开口）+ Spherical（球面）+ Radio Telescope（射电望远镜）。英文缩写 FAST 来自首字母组合。中文常称“500 米口径球面射电望远镜”，昵称“天眼”。","mnemonic":["把名字拆开记：Five-hundred-meter=500 米；Aperture=口径；Spherical=球面；Radio Telescope=射电望远镜。合起来就是“500 米口径的球面射电望远镜”。","缩写 FAST 可联想“fast=快”：它能高效扫描天空、快速搜寻微弱的宇宙射电信号（联想用，含义不等同于“速度快”）。"]}
{"word":"five-hydrated","summary":{"en":"Five-hydrated means “pentahydrated”: a substance that contains five waters of crystallization.","zh":"five-hydrated 意为“五水合的（pentahydrated）”：含有五个结晶水的物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) containing five molecules of water per formula unit; having five waters of crystallization.","zh":"（化学）含有每个化学式单位五个结晶水；五水合的。"},"examples":[{"en":"Copper(II) sulfate is commonly found as a five-hydrated salt.","zh":"硫酸铜常见的形态是五水合盐。"},{"en":"The five-hydrated crystal can lose water when heated.","zh":"五水合晶体加热时会失去结晶水。"},{"en":"This compound is five-hydrated in its stable form at room temperature.","zh":"这种化合物在室温下的稳定形态是五水合的。"}]}],"synonyms":["pentahydrated","penta-hydrated"],"phonetic":"/faɪv ˈhaɪdreɪtɪd/","extraExplanation":["“five-hydrated”在化学里更常写作“pentahydrated（五水合的）”。你也会看到写法如：CuSO₄·5H₂O，其中“·5H₂O”表示每个CuSO₄配有5个结晶水。","注意区分：结晶水（waters of crystallization）通常是晶体结构的一部分，不等同于溶液里的“水分”或“湿”。加热可能使其变成较低水合物或无水物（anhydrous）。"]}
{"word":"five-hydroxy","summary":{"en":"“five-hydroxy-” is a chemistry naming part meaning “-OH at position 5.”","zh":"“five-hydroxy-”是化学命名成分，表示“第5位有羟基（-OH）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry) Used before a chemical name to mean “having a hydroxy group (-OH) on the 5th carbon/position of the molecule.”","zh":"（化学）用在化学名称前，表示“在分子第5位（第5个碳/位置）带有一个羟基（-OH）”。"},"examples":[{"en":"5-hydroxytryptophan is often written as five-hydroxytryptophan in some texts.","zh":"5-羟基色氨酸在一些文本中也会写作 five-hydroxytryptophan。"},{"en":"The report mentions a five-hydroxy compound, meaning an -OH group is attached at position 5.","zh":"报告提到一种 five-hydroxy 化合物，意思是在第5位连接了一个 -OH。"}]}],"synonyms":["5-hydroxy-"],"phonetic":"/faɪv haɪˈdrɑksi/","extraExplanation":["“five-hydroxy- / 5-hydroxy-”属于化学命名中的“位置号 + 取代基”写法：five/5 表示取代发生的位置，hydroxy 表示羟基（-OH）。具体“第5位”取决于该分子选定的编号规则（例如芳环或主链的编号方式）。","在正式科研写作里更常见的是数字形式“5-hydroxy-”，因为更精确、也更符合化学命名习惯。"]}
{"word":"five-hydroxyl","summary":{"en":"“Five-hydroxyl” means a molecule has an –OH group at its 5-position.","zh":"“five-hydroxyl”指分子在第5位带有羟基（–OH）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a hydroxyl group (–OH) attached at the 5-position of a molecule (especially in organic chemistry and biochemistry).","zh":"（尤用于有机化学与生物化学）指分子在第5位（5号位置）带有一个羟基（–OH）。"},"examples":[{"en":"This enzyme adds a five-hydroxyl group to the compound, changing its activity.","zh":"这种酶会在该化合物上引入一个5位羟基，从而改变其活性。"},{"en":"The five-hydroxyl substitution increases the molecule’s ability to form hydrogen bonds.","zh":"5位羟基取代会增强分子形成氢键的能力。"}]}],"synonyms":["5-hydroxyl","5-hydroxy-","C5 hydroxyl"],"phonetic":"/ˌfaɪv haɪˈdrɑk.səl/","extraExplanation":["“five-hydroxyl”常见于学术写作，更多也会写作“5-hydroxyl”或作为前缀“5-hydroxy-”。“5-”表示官能团连接的位置编号；编号规则取决于具体骨架（如糖环、嘌呤/嘧啶环或其他有机骨架）的命名体系。","在核酸与糖化学语境中，常见表达是“5′-hydroxyl（5′-OH）”，表示糖的5′碳上的羟基；注意这里的“5′”带撇号，用来区分糖链的编号，与芳香环等骨架的“5-”编号不同。"]}
{"word":"five-in-a-line","summary":{"en":"“Five-in-a-line” means five pieces in a straight line, often the winning pattern in gomoku (five-in-a-row), and it can also refer to the game itself.","zh":"“five-in-a-line”指五子连成一线（常为五子棋的制胜形），也可指五子棋这类游戏本身。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A line of five identical pieces in a row (horizontally, vertically, or diagonally), usually the winning condition in games like gomoku (five-in-a-row).","zh":"（同一种棋子）连成一条直线的五个（横/竖/斜），常指五子棋等游戏中的获胜条件。"},"examples":[{"en":"She won by making a five-in-a-line diagonally.","zh":"她用一条斜线连成五子获胜。"},{"en":"The goal is simple: get a five-in-a-line before your opponent does.","zh":"目标很简单：在对手之前先连成五子一线。"}]},{"partOfSpeech":"n.","definition":{"en":"The board game or puzzle in which players try to form a line of five pieces; another way to refer to “five-in-a-row / gomoku.”","zh":"一种以“先连成五子”为目标的棋类/益智游戏；也可指“五子棋（five-in-a-row / gomoku）”。"},"examples":[{"en":"Do you want to play five-in-a-line after dinner?","zh":"晚饭后想下五子棋吗？"},{"en":"This app teaches beginners how to play five-in-a-line.","zh":"这个应用教初学者怎么玩五子棋。"}]}],"synonyms":["five in a row","five-in-a-row","gomoku","five-in-a-row game"],"phonetic":"/ˌfaɪv ɪn ə ˈlaɪn/","extraExplanation":["“five-in-a-line”在英语里更像描述性说法，实际使用中更常见的是“five in a row”或日语借词“gomoku”。","带连字符（five-in-a-line）通常用于把它当作一个整体概念（像形容词/名词短语）来修饰或命名，比如“a five-in-a-line win”。"]}
{"word":"five-in-a-row","summary":{"en":"Five matching pieces in a straight line (often a win in board games), or five consecutive wins/successes.","zh":"五个相同棋子连成一线（常为游戏胜利条件），或连续五次胜利/成功。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Game) A line of five matching pieces in a row, usually the winning condition in games like Gomoku.","zh":"（游戏）五个相同棋子连成一线（通常是获胜条件，如五子棋）。"},"examples":[{"en":"In Gomoku, you win by getting five-in-a-row.","zh":"在五子棋里，先连成五个一线就赢。"},{"en":"She blocked his move, so he couldn’t make five-in-a-row.","zh":"她把他的路堵住了，所以他没法连成五个一线。"}]},{"partOfSpeech":"phrase","definition":{"en":"(By extension) Five consecutive successes, especially in sports (five wins in a row).","zh":"（引申）连续五次成功，尤其指体育比赛中的五连胜。"},"examples":[{"en":"The team is on a five-in-a-row winning streak.","zh":"这支球队正处于五连胜的连胜势头中。"},{"en":"After five-in-a-row victories, they finally reached the finals.","zh":"在取得五连胜后，他们终于打进了决赛。"}]}],"synonyms":["five in a row","five straight","five consecutive (wins)","five-in-a-row streak"],"phonetic":"/ˌfaɪv ɪn ə ˈroʊ/","extraExplanation":["“five-in-a-row”最常见在棋类/益智游戏语境，类似中文的“五子连珠/五连”。英文里也常说“five in a row”（不加连字符）；加连字符多用于作定语（如 a five-in-a-row win）。","相关游戏名：Gomoku（五子棋），有时也会看到“Connect Five”（五连棋）的说法。"]}
{"word":"five-jugate","summary":{"en":"“Five-jugate” means an area or holding measured as five medieval land units called jugates.","zh":"“five-jugate”指按中世纪土地单位 jugate 计量为“五个 jugate”的土地面积或地产。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Consisting of, measuring, or assessed as five jugates (an old unit of land area used in medieval documents, roughly the amount of land one yoke of oxen could plow).","zh":"由“五个 jugate（中世纪文书里的古老土地面积单位，大致相当于一副牛轭能耕作的土地量）”组成的；面积/税赋按“五个 jugate”计算的。"},"examples":[{"en":"The record describes a five-jugate holding granted to the abbey.","zh":"记录描述了一块授予修道院的“五 jugate”土地。"},{"en":"He paid rent on a five-jugate estate listed in the survey.","zh":"他为调查册上登记的一处“五 jugate”庄园缴纳租金/地租。"}]}],"synonyms":["quinquejugate","five-jugate holding","five-jugate estate"],"phonetic":"/ˌfaɪv ˈdʒuːɡeɪt/","extraExplanation":["“jugate”源自拉丁语 *jugum*（牛轭、轭），在中世纪英格兰等地的土地与税赋文书中出现，指按“可由一副牛耕作的面积”来估算的土地单位。它不是现代固定面积（会因地区、土质、时期而变动），所以翻译时常保留为 *jugate* 并在注释里说明。","在历史研究或古籍翻译中，*five-jugate* 多见于土地授予（grant）、清册/调查（survey）、地租与赋税（rent/assessment）语境。可对比同类古单位：*hide*、*carucate*。"]}
{"word":"five-kernel mooncake","summary":{"en":"a traditional mooncake filled with a mix of nuts and seeds","zh":"以多种坚果与籽类混合为馅的传统月饼"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A traditional Chinese mooncake filled with a mix of five kinds of nuts and seeds (often including walnuts, almonds, sesame seeds, pumpkin seeds, and melon seeds), usually bound with syrup or sweet paste.","zh":"一种传统中式月饼，内馅通常由五种坚果与籽类混合（常见如核桃、杏仁、芝麻、南瓜子、瓜子仁等），一般用糖浆或甜馅料黏合。"},"examples":[{"en":"My grandparents prefer five-kernel mooncakes because they’re less sweet and have a nutty fragrance.","zh":"我爷爷奶奶更喜欢五仁月饼，因为没那么甜，而且坚果香很浓。"},{"en":"This bakery makes a modern five-kernel mooncake with less oil and smaller pieces of nuts.","zh":"这家店做的改良版五仁月饼油更少，坚果也切得更小。"},{"en":"During the Mid-Autumn Festival, some families buy five-kernel mooncakes as a classic, old-fashioned choice.","zh":"中秋节时，有些家庭会买五仁月饼，作为一种经典又传统的选择。"}]}],"synonyms":["five-nut mooncake","mixed-nut mooncake","assorted nut mooncake","wuren mooncake"],"phonetic":"ˌfaɪv ˈkɝːnəl ˈmuːnˌkeɪk","extraExplanation":["文化背景：月饼常与中秋节（Mid-Autumn Festival）相关，象征团圆。五仁月饼在一些地区被视为“老派/传统口味”，口感偏扎实、有坚果颗粒感。","用词提示：英语里的 kernel 不是“操作系统内核”那个意思，而是“果仁/籽仁”。在点单或介绍时，说 “mixed nuts and seeds” 更清楚。"],"etymology":"“five-kernel mooncake”是对中文“**五仁月饼**”的直译式英文表达：five（五）+ kernel（仁/果仁，指坚果或籽的可食用部分）+ mooncake（月饼）。在英语里也常说 **five-nut mooncake** 或 **mixed-nut mooncake**。","mnemonic":["记忆法：把“仁”联想到“果仁”= kernel；五仁= five kernels（五种果仁/籽仁）。","联想：moon（月亮）+ cake（饼）= mooncake（月饼），中秋看月亮吃月饼。"]}
{"word":"five-language","summary":{"en":"“Five-language” means provided in five languages, often describing a multilingual edition or option.","zh":"“five-language”指“提供五种语言的”，常用来描述五语版本或五语选项。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a book, sign, app, etc.) available in five languages; multilingual in five languages.","zh":"（书籍、标识、应用等）提供五种语言版本的；五语的；五种语言的。"},"examples":[{"en":"The museum offers a five-language audio guide: English, Spanish, French, Chinese, and Korean.","zh":"博物馆提供五语语音导览：英语、西班牙语、法语、中文和韩语。"},{"en":"We printed five-language labels to meet export requirements.","zh":"我们印了五语标签来满足出口要求。"}]},{"partOfSpeech":"n.","definition":{"en":"a set or edition that includes five languages (often used in publishing or product descriptions).","zh":"五语版本；包含五种语言的套装/版本（常用于出版或产品说明）。"},"examples":[{"en":"I bought the five-language edition for my trip.","zh":"我买了五语版，出行更方便。"},{"en":"Their website provides a five-language option in the settings menu.","zh":"他们的网站在设置菜单里提供五语选项。"}]}],"synonyms":["five-lingual","multilingual (in five languages)","available in five languages"],"phonetic":"/ˈfaɪv ˈlæŋɡwɪdʒ/","extraExplanation":["“five-language”通常是修饰名词的复合形容词（hyphenated compound adjective），放在名词前更常见：a five-language menu / a five-language brochure。放在名词后也可以不加连字符：The brochure is available in five languages。","实际写作中，很多人会写成 five-language 或 five language（不太规范），也常用更自然的表达：available in five languages / in five languages。"]}
{"word":"five-leaf","summary":{"en":"“Five-leaf” describes something (especially a plant leaf) that has five leaves or five leaflets.","zh":"“five-leaf”多用于描述植物叶片，表示“有五片叶子/五个小叶（五出叶）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five leaves or five leaflets (parts of one leaf), especially in plants.","zh":"（尤指植物）有五片叶子或五个小叶的；五出叶的。"},"examples":[{"en":"The vine has a five-leaf pattern, so it may be Virginia creeper.","zh":"这条藤蔓呈五出叶的形状，所以它可能是五叶地锦（爬山虎的一种）。"},{"en":"Look for five-leaf leaves to help you identify the plant.","zh":"找一找五出叶的叶片，有助于你辨认这种植物。"}]},{"partOfSpeech":"n.","definition":{"en":"A leaf or plant part that has five leaflets; used mainly in descriptions (less common as a standalone noun).","zh":"五出叶的叶片（较少单独作名词使用，多见于描述中）。"},"examples":[{"en":"This plant shows a clear five-leaf in spring.","zh":"这种植物在春天会长出明显的五出叶叶片。"}]}],"synonyms":["five-leaved","five-leaflet","quinquefoliate"],"phonetic":"/ˈfaɪv liːf/","extraExplanation":["“five-leaf”常见于植物辨识语境，指“一个叶柄上长出五个小叶”的结构（英文也常说 five-leaflet / five-leaved）。在三叶草语境里，人们更熟悉 four-leaf clover（四叶草）象征好运；five-leaf clover（五叶草）也有人认为更稀有、更“幸运”，但这更多是民间说法。"]}
{"word":"five-leafleted","summary":{"en":"“Five-leafleted” describes a compound leaf made up of five leaflets.","zh":"“five-leafleted”指由五个小叶组成的复叶（具五小叶）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five leaflets (small leaf-like parts) in one compound leaf.","zh":"（复叶）由五个小叶组成的；具五小叶的。"},"examples":[{"en":"The plant has five-leafleted leaves, which makes it easy to recognize.","zh":"这种植物的叶子是五小叶复叶，所以很容易辨认。"},{"en":"A five-leafleted vine climbed the fence beside the garden.","zh":"一株五小叶的藤蔓沿着花园旁的篱笆攀爬。"}]}],"synonyms":["five-leaflet","quinquefoliolate","five-parted (leaf)"],"phonetic":"/ˌfaɪv ˈliːflətɪd/","extraExplanation":["这是一个偏植物学的形容词：leaflet 指“复叶上的小叶”，不同于 leaf（整片叶）。例如三叶草是 three-leafleted；某些植物（如部分五叶地锦/五叶爬山虎）常被描述为 five-leafleted。","拼写上也常见 five-leaflet（作定语）或 five-leafleted（作表语/后置定语）；两者意思接近。"]}
{"word":"five-leaved","summary":{"en":"“Five-leaved” describes something (especially a plant) that has five leaves or leaflets.","zh":"“five-leaved”指（尤指植物）具有五片叶或五个小叶的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five leaves, leaflets, or leaf-like parts (often used in botany to describe a plant or a compound leaf).","zh":"（多用于植物学）有五片叶、五个小叶或五个叶状部分的。"},"examples":[{"en":"A five-leaved vine was growing along the fence.","zh":"篱笆旁长着一株五叶的藤本植物。"},{"en":"This plant has five-leaved clusters, so it’s easy to recognize.","zh":"这种植物有五叶成簇的特征，所以很容易辨认。"}]}],"synonyms":["five-leafed","quinquefoliate","palmate (when leaflets spread like a hand)"],"phonetic":"/faɪv livd/","extraExplanation":["“five-leaved”常作定语，属于描述形态的复合形容词，通常用连字符连接（five-leaved + 名词）。","在植物学语境中，它可能指“复叶有五个小叶”（five leaflets），不一定是“整片叶子分成五片”。具体要看所描述的植物结构。"]}
{"word":"five-legged","summary":{"en":"“Five-legged” means having five legs, often used for unusual, fictional, or humorous descriptions.","zh":"“five-legged”意为“有五条腿的”，常用于描述不寻常、虚构或带幽默感的对象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five legs (usually describing an unusual animal, creature, object, or a humorous/imaginary situation).","zh":"有五条腿的（多用于描述不寻常的动物、怪物、物体，或带有幽默/幻想色彩的情境）。"},"examples":[{"en":"In the cartoon, a five-legged dog runs faster than the others.","zh":"在那部动画里，一只五条腿的狗跑得比其他狗都快。"},{"en":"They built a five-legged table by mistake, but it didn’t wobble.","zh":"他们不小心做了一张五条腿的桌子，但它并不晃。"},{"en":"The museum displayed a five-legged robot as a prototype.","zh":"博物馆展出了一台五条腿的机器人原型。"}]}],"synonyms":["pentapod (rare)","five-limbed","many-legged (broader)"],"phonetic":"/ˌfaɪv ˈlɛɡd/","extraExplanation":["“five-legged”是由数字+名词（five + legged）构成的形容词复合词，通常要加连字符（hyphen）来表示它作为一个整体修饰名词：a five-legged creature。","在现实语境中它较少见，更常用于科幻、童话、漫画或幽默表达，用来强调“不同寻常/怪诞”。"]}
{"word":"five-letter","summary":{"en":"“Five-letter” describes something (especially a word) that contains five letters.","zh":"“five-letter”表示（尤指单词）由五个字母组成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a word) having five letters.","zh":"（指单词）由五个字母组成的。"},"examples":[{"en":"“Apple” is a five-letter word.","zh":"“apple”是一个五个字母的单词。"},{"en":"Try a five-letter answer for this puzzle.","zh":"这道谜题试着用一个五个字母的答案。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More generally) made up of five letters; used as a quick description or clue in games, puzzles, or word lists.","zh":"（更广义）由五个字母构成；常用于游戏、字谜或单词表中作为快速描述或提示。"},"examples":[{"en":"The game asks you to guess a five-letter word.","zh":"这个游戏让你猜一个五个字母的单词。"},{"en":"Look for a five-letter name that starts with S.","zh":"找一个以S开头的五个字母的名字。"}]}],"synonyms":["five-lettered","five letters long"],"phonetic":"/ˈfaɪv ˌlɛtər/","extraExplanation":["“five-letter”常以连字符作形容词，放在名词前：a five-letter word / a five-letter clue。单独放在名词后时也可见：The answer is five letters long（更口语、自然）。","注意相关表达“four-letter word”更常用，常指粗口或不雅词的委婉说法；“five-letter word”有时也会被借用来做类似的委婉/幽默表达，但频率远低于“four-letter word”。"]}
{"word":"five-level","summary":{"en":"Five-level describes something that has five levels or stages, especially in systems, buildings, or rankings.","zh":"five-level指“有五个层级或阶段的”，常用于系统、建筑或等级划分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five levels, stages, floors, or degrees (often used as a compound adjective before a noun).","zh":"五个层级/阶段/楼层/等级的（常作复合形容词，放在名词前）。"},"examples":[{"en":"The company uses a five-level approval process for large purchases.","zh":"这家公司对大额采购使用五级审批流程。"},{"en":"They installed a five-level parking garage near the station.","zh":"他们在车站附近建了一座五层停车楼。"},{"en":"The course has a five-level grading system.","zh":"这门课有一个五级评分体系。"}]}],"synonyms":["five-tier","five-stage","five-tiered","having five levels"],"phonetic":"/ˈfaɪv ˌlɛvəl/","extraExplanation":["“five-level”通常用连字符，因为它作定语放在名词前（five-level system / five-level building）。如果放在名词后，常写作不加连字符：The system has five levels.","在口语和写作中也常见同义表达：five-tier / five-stage / five-tiered（视语境选择；tier更常用于“层级/等级”。）"]}
{"word":"five-lingual","summary":{"en":"Five-lingual means able to speak five languages.","zh":"five-lingual 指“会说五种语言的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to speak (or use) five languages","zh":"能说（或使用）五种语言的"},"examples":[{"en":"She’s five-lingual and works as an interpreter.","zh":"她会五种语言，在做口译员。"},{"en":"Being five-lingual helped him communicate easily while traveling.","zh":"会五种语言让他旅行时沟通更顺畅。"}]}],"synonyms":["quintilingual","multilingual","polyglot"],"phonetic":"ˌfaɪvˈlɪŋɡwəl","extraExplanation":["“five-lingual”在日常英语里不算最常见；更常见的说法是 **multilingual**（多语的）或更正式一些的 **quintilingual**（会五种语言的）。","“-lingual”来自拉丁语，和“language（语言）/ tongue（语言）”相关。英语里常用“数字 + -lingual”来表示会几种语言（如 bilingual 双语、trilingual 三语）。","拼写上常见两种：**five-lingual**（带连字符）和 **five-lingual person/speaker**。也有人写作不带连字符的 **five lingual**，但通常不如带连字符清晰、规范。"]}
{"word":"five-lobed","summary":{"en":"“Five-lobed” describes something that has five distinct lobes or sections, especially in plants.","zh":"“five-lobed”表示“有五个裂片/分叶的”，多用于植物等形状描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five lobes (five rounded or projecting parts), often used to describe leaves, flowers, or other shapes in biology and design.","zh":"五裂的；五叶状的（有五个裂片/叶裂的），常用于描述植物叶片、花朵或其他形状。"},"examples":[{"en":"Maple leaves are often five-lobed.","zh":"枫叶常常是五裂的。"},{"en":"The flower has a five-lobed corolla.","zh":"这朵花的花冠是五裂的。"}]}],"synonyms":["five-parted","quinquelobed","five-segmented"],"phonetic":"/ˌfaɪv ˈloʊbd/","extraExplanation":["“lobe”指“裂片/叶裂/（器官的）叶”。在植物学里，five-lobed 常用来形容叶片或花冠的形状；在解剖学里也可形容某些结构（如“肺叶”）的分叶情况。","写作中常见的近义表达有：five-lobed leaf（五裂叶）、with five lobes（有五个裂片）。注意它通常作定语，需要连字符：a five-lobed leaf。"]}
{"word":"five-loculed","summary":{"en":"“Five-loculed” describes a plant structure that has five internal chambers (locules).","zh":"“five-loculed”指植物结构内部有五个室（腔室/隔室）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five locules (five chambers/compartments) inside an ovary, fruit, or anther.","zh":"（植物学）五室的；具五个室（隔室/腔室）的（指子房、果实或花药内部的分隔腔）。"},"examples":[{"en":"The ovary is five-loculed, with numerous ovules in each chamber.","zh":"该子房为五室结构，每个室内都有许多胚珠。"},{"en":"This species produces a five-loculed capsule fruit.","zh":"这种植物结五室蒴果。"}]}],"synonyms":["five-chambered","quinquelocular"],"phonetic":"/ˌfaɪv ˈloʊ.kjuːld/","extraExplanation":["“locule”指植物器官内部由隔膜分开的“室/腔”，常用于描述子房（ovary）、花药（anther）或果实（fruit）的内部结构。","在植物分类与形态学描述中，“X-loculed”（如 three-loculed、five-loculed）是非常常见的组合形式；也可写作“5-loculed”。","该词多见于学术论文、植物志（flora）、鉴定检索表（key）等正式语境，日常英语中较少使用。"]}
{"word":"five-minute","summary":{"en":"about five minutes in length; brief","zh":"大约五分钟长；短暂"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lasting or taking about five minutes; very short.","zh":"持续或用时大约五分钟的；很短暂的。"},"examples":[{"en":"I’ll be there in five minutes—this is just a five-minute walk.","zh":"我五分钟就到——走路只要五分钟。"},{"en":"Let’s take a five-minute break and then continue.","zh":"我们休息五分钟，然后继续。"}]}],"synonyms":["brief","short","quick","momentary"],"phonetic":"/ˈfaɪv ˈmɪnɪt/","extraExplanation":["写作提示：放在名词前作定语时通常用连字符（a five-minute meeting）；放在名词后作表语时一般不加连字符（The meeting is five minutes long / It took five minutes）。","口语中也常说 five minutes’（所有格）来表达“……的五分钟”：a five minutes’ wait（也可写作 a five-minute wait）。两种都常见，但 five-minute 更常用、更简洁。"],"etymology":"由数字 five + 时间单位 minute 组合而成的复合形容词；作定语时常用连字符 five-minute（如 five-minute break）。","mnemonic":["把它当作“5 + 分钟”的公式：five-minute = “五分钟的”，专门用来修饰后面的名词。","记连字符用法：像中文里“5分钟+的+名词”（五分钟的休息）一样连起来——five-minute break。"]}
{"word":"five-mouthed","summary":{"en":"five-mouthed = having five openings/entrances/outlets (a rare, descriptive adjective).","zh":"five-mouthed 表示“有五个开口/入口/出口的”（较少见的描写性形容词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five “mouths” (openings), such as entrances, outlets, or orifices; five-opening.","zh":"有五个“口/开口/出口”的；五开口的（如入口、出水口、孔口等）。"},"examples":[{"en":"The old fortress was described as five-mouthed, with five separate gates facing the valley.","zh":"这座古堡被形容为“五口”的，有五座分别朝向山谷的城门。"},{"en":"In the report, the canal system was called five-mouthed because it emptied into the lake through five outlets.","zh":"报告中把这套运河系统称为“五口”的，因为它通过五个出水口汇入湖中。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Poetic or literary) Having five “mouth-like” parts or shapes; a vivid descriptive compound.","zh":"（诗歌/文学用法）具有五个“像嘴一样的”部位或形状的；一种形象化的复合形容词。"},"examples":[{"en":"The poet imagined a five-mouthed cave that seemed to whisper from every opening.","zh":"诗人想象了一座“五口洞穴”，仿佛每个洞口都在低语。"},{"en":"A five-mouthed flower is not a standard term, but it could be used creatively to suggest five openings or lobes.","zh":"“五口花”并不是标准术语，但可作为创意表达，暗示五个开口或裂片。"}]}],"synonyms":["five-opening","five-entranced","five-outleted"],"phonetic":"/faɪv maʊðd/","extraExplanation":["“five-mouthed”不是常见词，更多见于描写性文字（尤其是诗歌、古典叙述或地方志式的写法）。英语里常用“数字 + mouthed”的构词方式来表示“有……个口/开口/入口/出口”，例如：three-mouthed river（三口河）。","这里的 mouth 不仅指“嘴巴”，也常指“入口、出口、河口、洞口、炮口/枪口”等“开口处”。理解为“opening/outlet/entrance”通常更贴切。"]}
{"word":"five-nerved","summary":{"en":"“Five-nerved” describes leaves (or similar structures) that have five main veins.","zh":"“five-nerved”指（多用于叶片）具有五条主要叶脉的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five main veins or ribs, especially referring to a leaf.","zh":"（植物学）五脉的；有五条主要叶脉（或脉纹、隆脊）的，尤指叶片。"},"examples":[{"en":"The plant has five-nerved leaves with a slightly rough surface.","zh":"这种植物的叶子是五脉的，表面有点粗糙。"},{"en":"Look for a five-nerved leaf pattern to help identify the species.","zh":"要辨认这个物种，可以观察是否有五脉的叶脉形态。"}]}],"synonyms":["five-veined","quinquenerved"],"phonetic":"/ˌfaɪv ˈnɝvd/","extraExplanation":["这是一个偏植物学的形容词，常用于植物鉴定描述（field guides/植物志）。“nerved”在这里不是“紧张的”，而是指“有叶脉/脉纹的”。","常见写法有带连字符的 five-nerved（较强调作定语）以及不带连字符的 five nerved（较少见，或作表语/技术写法因风格而异）。"]}
{"word":"five-note","summary":{"en":"“Five-note” means “having five notes,” especially referring to a pentatonic (five-note) scale or a simple five-note musical pattern.","zh":"“five-note”指“由五个音组成的”，尤指五声音阶（pentatonic）或简单的五音音型/旋律。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Music) Made up of five notes; using a scale or pattern that has five different notes (often the pentatonic scale).","zh":"（音乐）由五个音组成的；使用只有五个不同音的音阶或音型（常指五声音阶/五音音阶）。"},"examples":[{"en":"Many folk songs use a five-note scale, so they sound simple and familiar.","zh":"很多民歌使用五声音阶，所以听起来简单又熟悉。"},{"en":"The melody is five-note, which makes it easy to sing.","zh":"这段旋律是五音的，所以很容易唱。"}]},{"partOfSpeech":"n.","definition":{"en":"A short musical pattern, melody, or scale that contains five notes.","zh":"由五个音构成的简短音型、旋律或音阶。"},"examples":[{"en":"The teacher asked us to practice a five-note pattern on the piano.","zh":"老师让我们在钢琴上练习一个五音音型。"},{"en":"He built the song’s hook from a simple five-note motif.","zh":"他用一个简单的五音动机写出了这首歌的副歌记忆点。"}]}],"synonyms":["pentatonic","five-tone"],"phonetic":"/ˈfaɪv noʊt/","extraExplanation":["“five-note”常用连字符作定语（five-note scale / five-note pattern）。在音乐里它经常指“pentatonic（五声音阶）”，这种音阶在中国民乐、苏格兰/爱尔兰民谣、非洲与美国蓝调等传统音乐中都很常见，听感往往更“顺耳”、更容易哼唱。"]}
{"word":"five-note scale","summary":{"en":"a scale with five notes in each octave","zh":"每个八度含五个音的音阶"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A musical scale made of five different notes per octave, common in many musical traditions (for example, folk music, blues, and much East Asian music).","zh":"一种每个八度由五个不同音组成的音阶，常见于多种音乐传统（如民歌、布鲁斯以及许多东亚音乐）。"},"examples":[{"en":"Many traditional Chinese melodies are based on a five-note scale.","zh":"许多中国传统旋律都以五声音阶为基础。"},{"en":"The singer improvised using a five-note scale to make the melody sound simple and natural.","zh":"歌手用五声音阶即兴演唱，让旋律听起来朴素自然。"},{"en":"Try playing a five-note scale on the piano; it’s easier to create pleasant-sounding tunes.","zh":"试着在钢琴上弹五声音阶；更容易写出好听的旋律。"}]}],"synonyms":["pentatonic scale","five-tone scale","pentatonic"],"phonetic":"/ˈfaɪv noʊt skeɪl/","extraExplanation":["在音乐课或教材里，“five-note scale”通常就是指“五声音阶（pentatonic scale）”。常见的大调五声音阶可用唱名表示为：do–re–mi–sol–la（缺少 fa 和 ti）。","五声音阶在不同文化中都很常见：东亚传统音乐、苏格兰/爱尔兰民谣、非洲音乐传统，以及西方流行与摇滚中的吉他即兴等。"],"etymology":"字面意思是“五个音的音阶”。音乐理论中更常用的标准术语是 pentatonic scale（penta- 表示“五”，-tonic 与“音/调”相关）。","mnemonic":["记成“five = 五 + note = 音符”：五个音符组成的音阶。","联想到“五声音阶=宫商角徵羽”（传统说法），帮助把“five-note”直接对应到“五声”。"]}
{"word":"five-oxide","summary":{"en":"“Five-oxide” is an informal way to refer to a pentoxide: an oxide containing five oxygen atoms (O5).","zh":"“five-oxide”是较口语/非正式的说法，通常指“五氧化物（pentoxide）”，即含有五个氧原子（O5）的氧化物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An oxide that contains five oxygen atoms per formula unit (often written as \u0005), such as phosphorus pentoxide (P\u0004O\u0001\u0010).","zh":"（化学）指每个化学式单位中含有五个氧原子的氧化物（常写作 \u0005），例如五氧化二磷（P\u0004O\u0001\u0010）。"},"examples":[{"en":"Phosphorus pentoxide is sometimes informally described as a “five-oxide.”","zh":"五氧化二磷有时会被非正式地称作“five-oxide（五氧化物）”。"},{"en":"In chemical naming, “five-oxide” corresponds to the prefix penta-, as in “pentoxide.”","zh":"在化学命名里，“five-oxide”对应的前缀是 penta-，如 pentoxide（五氧化物）。"}]}],"synonyms":["pentoxide","pentaoxide"],"phonetic":"/pɛnˈtɑkˌsaɪd/","extraExplanation":["“five-oxide”并不是英语里非常标准或常见的术语；更规范的说法通常是 **pentoxide / pentaoxide**（五氧化物）。在无机化学命名中，常用希腊数字前缀表示原子个数：mono-（一）、di-（二）、tri-（三）、tetra-（四）、penta-（五）。","有些化合物的常用名与实际经验式/分子式写法可能不同（例如“phosphorus pentoxide”常见写作 P4O10），学习时可同时记住名称与常见化学式。"]}
{"word":"five-paired","summary":{"en":"“Five-paired” means having five pairs of something.","zh":"“five-paired”表示“有五对的（共十个）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five pairs of something (ten in total), often used to describe repeated body parts, structures, or items arranged in pairs.","zh":"有五对的（共十个），常用于描述成对出现的身体部位、结构或物品。"},"examples":[{"en":"The insect has five-paired legs in the illustration.","zh":"插图中这只昆虫有五对腿。"},{"en":"Researchers described five-paired appendages along the body.","zh":"研究人员描述了身体两侧共有五对附肢。"}]}],"synonyms":["having five pairs","ten (in total)","paired (in five sets)"],"phonetic":"/ˌfaɪv ˈpɛrd/","extraExplanation":["“five-paired”常见于较正式或学术性的描述（尤其是生物学、解剖学、工程说明）。也可以写成“five paired”，但作定语放在名词前时通常用连字符（hyphen）更清晰：a five-paired structure。"]}
{"word":"five-part","summary":{"en":"“Five-part” means “made up of five parts,” often used before a noun (e.g., a five-part series).","zh":"“five-part”表示“由五个部分组成的”，常用于名词前作定语（如五集系列）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Consisting of five parts; divided into five sections or components.","zh":"由五个部分组成的；分成五段/五个组成部分的。"},"examples":[{"en":"The documentary is a five-part series.","zh":"这部纪录片是一部五集（五部分）的系列片。"},{"en":"We broke the project into a five-part plan: research, design, testing, launch, and review.","zh":"我们把项目拆成五个部分的计划：调研、设计、测试、上线和复盘。"},{"en":"The choir performed a five-part harmony.","zh":"合唱团演唱了五声部和声。"}]}],"synonyms":["five-section","five-piece","in five parts"],"phonetic":"/ˌfaɪv ˈpɑrt/","extraExplanation":["“five-part”通常用连字符，尤其是在名词前作定语时：a five-part series（五集系列）。如果放在名词后作表语，也常见不加连字符：The series is five part(s) / five-part（写法因风格而异，但定语位置更推荐加连字符）。","在音乐语境中，“five-part”常指“五声部”（如Soprano/Alto/Tenor/Bass再加一个声部），比日常“five parts”更专业。"]}
{"word":"five-parted","summary":{"en":"“Five-parted” means “divided into five parts,” often used to describe shapes or structures (like petals).","zh":"“five-parted”表示“分成五部分的”，常用于描述形状或结构（如花瓣五裂）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Divided into five parts; having five sections, segments, or lobes.","zh":"分成五部分的；有五个部分/分区/裂片的。"},"examples":[{"en":"The flower has five-parted petals, so it looks like a star.","zh":"这朵花的花瓣是五裂的，所以看起来像一颗星。"},{"en":"They used a five-parted chart to compare the five categories.","zh":"他们用一张五部分的图表来比较这五个类别。"}]}],"synonyms":["five-part","fivefold","pentapartite"],"phonetic":"/ˌfaɪvˈpɑɹtɪd/","extraExplanation":["“five-parted”是一个复合形容词，常见于描写结构或形态（尤其是植物学/生物学，如花瓣“five-parted”表示“五裂/分成五瓣”）。","英语里“-parted”表示“被分成……部分的”，类似的还有“two-parted”“three-parted”。写作时通常用连字符（hyphen）连接，放在名词前作定语。"]}
{"word":"five-pence","summary":{"en":"“Five-pence” means five pence (5p), a British coin/value worth £0.05.","zh":"“five-pence”指英国的五便士（5p），价值0.05英镑的硬币或金额。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A British coin or amount of money worth five pence (£0.05).","zh":"英国的“五便士”硬币；或指价值五便士（0.05英镑）的金额。"},"examples":[{"en":"I found a five-pence coin in my pocket.","zh":"我在口袋里发现了一枚五便士硬币。"},{"en":"The gum costs five pence.","zh":"这块口香糖要五便士。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The older British pre-decimal value called “fivepence,” used historically before the currency system changed.","zh":"（较少见）英国旧货币体系中的“五便士”面值，用于十进制改制之前的历史语境。"},"examples":[{"en":"In the novel, a loaf of bread costs fivepence.","zh":"小说里，一条面包卖五便士。"}]}],"synonyms":["five pence","5p","fivepence (UK)"],"phonetic":"/ˈfaɪvˌpɛns/","extraExplanation":["“pence”是“penny（便士）”的复数形式。现代英国货币中：1 pound（英镑）= 100 pence（便士），所以 five pence = £0.05。","英国在1971年进行了货币“十进制化”（decimalisation）。因此在旧书或历史语境里看到的“fivepence（五便士）”可能对应旧体系的价值与购买力，不一定等同于今天的5p。","日常更常见的说法有“five pence”或缩写“5p（five pee）”；“five-pence”作为定语也可见于写作中（如 five-pence coin）。"]}
{"word":"five-penny","summary":{"en":"Five-penny means ‘worth or costing five pence (5p)’ in British English, and can also refer to a five-pence coin or the amount of five pence.","zh":"five-penny 在英式英语中表示“价值/价格为五便士（5p）的”，也可指“五便士硬币”或“五便士这笔钱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(British) costing five pence; priced at 5p.","zh":"（英式）价值五便士的；标价为5便士（5p）的。"},"examples":[{"en":"He bought a five-penny stamp at the post office.","zh":"他在邮局买了一张五便士的邮票。"},{"en":"A five-penny fare used to be enough for a short bus ride.","zh":"以前坐一小段公交车，五便士的车费就够了。"}]},{"partOfSpeech":"n.","definition":{"en":"(British, informal, often historical) a five-pence coin or an amount of five pence.","zh":"（英式，非正式，常见于较旧用法）五便士硬币；五便士的钱数。"},"examples":[{"en":"Have you got a five-penny for the meter?","zh":"你有一枚五便士投一下停车表吗？"},{"en":"He handed the boy a five-penny and walked on.","zh":"他递给男孩五便士，然后继续往前走。"}]}],"synonyms":["five-pence","5p","five pence"],"phonetic":"/ˈfaɪv ˌpɛni/","extraExplanation":["“penny”的复数在英式英语里常见两种：表示“几枚硬币”时常用 **pennies**（two pennies），表示“金额”时常用 **pence**（two pence / 2p）。因此“five-penny”字面是“五便士的”。","“five-penny”多见于英式语境，尤其在较早的文学或历史描写里（例如描写旧时票价、邮票、零食、报纸等的价格）。现代日常更常直接说 **5p** 或 **five pence**。"]}
{"word":"five-petaled","summary":{"en":"Describes a flower or blossom that has five petals.","zh":"形容花朵有五片花瓣。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five petals (usually describing a flower).","zh":"五瓣的；有五片花瓣的（通常形容花朵）。"},"examples":[{"en":"The wild rose has a simple, five-petaled flower.","zh":"野蔷薇的花很朴素，是五瓣的。"},{"en":"She sketched a five-petaled blossom in her notebook.","zh":"她在笔记本上画了一朵五瓣的花。"}]}],"synonyms":["five-petalled","five-petal","pentamerous"],"phonetic":"/ˌfaɪv ˈpɛt̬əld/","extraExplanation":["“five-petaled”是由数字+名词（petal 花瓣）构成的复合形容词，常见于植物学、园艺、写作描景中。类似结构还有：three-legged（三条腿的）、two-story（两层的）。\n\n在植物学里，“五瓣”常与“fifteen/五数性（pentamerous）”相关，很多常见花（如野蔷薇、某些樱草等）会呈现五瓣或近似五瓣的结构。写作中用它能让画面更具体、细节更鲜明。"]}
{"word":"five-petalled","summary":{"en":"“Five-petalled” means having five petals, usually describing a flower.","zh":"“five-petalled”指“有五片花瓣的”，常用来形容花。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five petals (often used to describe a flower).","zh":"五瓣的；有五片花瓣的（常用来形容花）。"},"examples":[{"en":"The wild rose is a five-petalled flower with a simple, open shape.","zh":"野蔷薇是一种五瓣花，花形简单而开放。"},{"en":"She sketched a five-petalled blossom in the corner of her notebook.","zh":"她在笔记本角落里画了一朵五瓣的花。"}]}],"synonyms":["five-petaled","five-petal"],"phonetic":"/ˌfaɪv ˈpɛt̬əld/","extraExplanation":["“five-petalled”是英式拼写；美式更常见的是“five-petaled”。两者意思相同。","在植物学或自然描写中很常用：很多蔷薇科花（如野蔷薇、苹果花等）常见五瓣结构。文学里用它能传达“朴素、野生、自然”的视觉印象。","构词法：five（五）+ petal（花瓣）+ -ed（表示“具有……的”形容词后缀）。类似结构还有：three-sided（三边的）、long-haired（长发的）。"]}
{"word":"five-piece","summary":{"en":"“Five-piece” means either a group of five performers (especially a band) or something made of five parts.","zh":"“five-piece”可指五人编制的（尤指乐队/组合），也可指由五个部分/件组成的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of five musicians who perform together; a band with five members.","zh":"五人乐队；由五位音乐人组成的演出组合。"},"examples":[{"en":"The jazz five-piece played two long sets at the club.","zh":"那支五人爵士乐队在俱乐部演了两场很长的演出。"},{"en":"She sings in a five-piece band with two guitars, bass, drums, and keyboards.","zh":"她在一个五人乐队里唱歌，配置是两把吉他、贝斯、鼓和键盘。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made up of five parts or items.","zh":"由五个部分/件组成的；五件套的。"},"examples":[{"en":"He wore a five-piece suit with a vest.","zh":"他穿了一套五件套西装，还包括马甲。"},{"en":"We ordered a five-piece luggage set for the trip.","zh":"我们为旅行订了一套五件套行李箱。"}]}],"synonyms":["quintet","five-member band","set of five","five-part"],"phonetic":"/ˈfaɪv ˌpis/","extraExplanation":["“five-piece”常作复合形容词或名词，写作带连字符的形式更常见。作名词时，在音乐语境里很常指“五人编制的乐队/组合”。","“five-piece suit”在英美文化里通常指由五件组成的西装搭配（常见包含：外套、裤子、背心/马甲等；具体构成会因地区与时代略有差异）。","相关表达：three-piece band（三人乐队）、four-piece suit（四件套西装）、a five-piece set（五件套）。"]}
{"word":"five-pin","summary":{"en":"“Five-pin” means having five pins, especially a five-pin connector; it can also refer to a five-pin plug or the Canadian sport of five-pin bowling.","zh":"“five-pin”指“有五个针脚的”，常用于五针连接器/插头；也可指加拿大常见的五柱保龄球。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five pins (metal prongs or contact points), especially of a connector or plug.","zh":"（尤指插头/连接器）有五个针脚（插针/触点）的。"},"examples":[{"en":"This device uses a five-pin connector for power and data.","zh":"这个设备用五针连接器来传输电源和数据。"},{"en":"Make sure the five-pin plug matches the socket on the back of the speaker.","zh":"请确认五针插头与音箱背面的插座匹配。"}]},{"partOfSpeech":"n.","definition":{"en":"A connector or plug that has five pins.","zh":"五针连接器；五针插头。"},"examples":[{"en":"I ordered a five-pin to USB adapter online.","zh":"我在网上订了一个五针转 USB 的转接头。"},{"en":"The old microphone needs a five-pin, not the newer three-pin type.","zh":"这只老麦克风需要五针接口，不是更新的三针那种。"}]},{"partOfSpeech":"n.","definition":{"en":"A form of bowling played with five pins (most common in Canada).","zh":"五柱保龄球（用五个球瓶进行的保龄球玩法，多见于加拿大）。"},"examples":[{"en":"We went five-pin bowling after dinner.","zh":"晚饭后我们去打五柱保龄球了。"},{"en":"Five-pin is popular in Canada, while ten-pin is more common in the U.S.","zh":"五柱保龄球在加拿大更常见，而十柱在美国更常见。"}]}],"synonyms":["five-pin connector","5-pin","five-pin plug","five-pin bowling"],"phonetic":"/ˈfaɪv pɪn/","extraExplanation":["“five-pin”常见于电子/音频领域，表示“有五个触点的接口”。不同设备的“五针”外形可能相似但标准不同（例如音频设备、老式电脑接口等），购买线材时最好确认具体标准和针脚定义。","“five-pin bowling（五柱保龄球）”是加拿大较有代表性的玩法：球更小、通常不用手指孔，计分规则也和更常见的 ten-pin（十柱）不同。"]}
{"word":"five-pistillate","summary":{"en":"A botanical adjective meaning “having five pistils in a flower.”","zh":"植物学形容词，指“一朵花中有五个雌蕊（五雌蕊的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five pistils (female reproductive structures) in a single flower.","zh":"（植物）五雌蕊的；一朵花中具有五个雌蕊（雌性生殖结构）的。"},"examples":[{"en":"In the field guide, the species is described as five-pistillate with small, pale flowers.","zh":"在野外图鉴中，这个物种被描述为五雌蕊，花朵小而颜色浅。"},{"en":"A five-pistillate flower may produce several separate fruits because each pistil can develop into a fruit.","zh":"五雌蕊的花可能结出多个分离的果实，因为每个雌蕊都可能发育成果实。"}]}],"synonyms":["pentapistillate","five-carpellate (often related)"],"phonetic":"ˌfaɪv ˈpɪstɪlɪt","extraExplanation":["“five-”在植物形态学描述里常和身体部位或结构搭配，表示数量（如 five-petaled 五瓣、five-lobed 五裂）。","“pistillate”本身常表示“雌花的/具雌蕊的”。在一些旧式或专业的植物学写作中，会用“five-pistillate”这类复合形容词来精确描述花的结构。","注意区分：pistil（雌蕊）是一个整体结构；carpel（心皮）是构成雌蕊的单位。有些文献会更常用“five-carpellate（五心皮的）”来表达相近概念，具体取决于植物类型与作者的分类习惯。"]}
{"word":"five-pistilled","summary":{"en":"Five-pistilled describes a flower that has five pistils.","zh":"Five-pistilled 指一朵花具有五个雌蕊（五雌蕊的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five pistils (female reproductive organs) in one flower.","zh":"（植物学）五雌蕊的；一朵花中具有五个雌蕊的。"},"examples":[{"en":"In some descriptions, the flower is noted as five-pistilled, which helps distinguish it from similar species.","zh":"在一些描述中，这种花被注明为 five-pistilled（五雌蕊），这有助于把它与相似物种区分开来。"},{"en":"The botanist recorded the plant as five-pistilled and five-loculed.","zh":"植物学家记录该植物为 five-pistilled（五雌蕊）且 five-loculed（五室）。"}]}],"synonyms":["quinquepistillate","five-carpellate (sometimes, depending on structure)"],"phonetic":"/ˌfaɪv ˈpɪstɪld/","extraExplanation":["“pistil”指花的雌性生殖结构，通常由柱头（stigma）、花柱（style）和子房（ovary）组成。形容词 five-pistilled 多见于植物分类或形态学描写中，用来精确说明花的结构特征。","英语里这种结构描述常用“数字 + 过去分词/形容词”的复合形式（如 three-petaled 三瓣的、two-seeded 二籽的、five-lobed 五裂的），多用于较正式或科学语境。"]}
{"word":"five-ploid","summary":{"en":"“Five-ploid” means having five sets of chromosomes (pentaploid).","zh":"“five-ploid”指细胞具有五套染色体组，即五倍体（pentaploid）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five complete sets of chromosomes in each cell (same meaning as pentaploid).","zh":"（遗传学）细胞中具有五套完整染色体组的；五倍体的（同 pentaploid）。"},"examples":[{"en":"Some plants can be five-ploid and still grow normally.","zh":"有些植物可能是五倍体，但仍然能正常生长。"},{"en":"The researchers compared diploid and five-ploid lines to see how extra chromosome sets affect traits.","zh":"研究人员比较了二倍体和五倍体品系，以观察额外染色体组如何影响性状。"}]}],"synonyms":["pentaploid","5n"],"phonetic":"/ˈfaɪvˌplɔɪd/","extraExplanation":["“-ploid”来自希腊语词根，常用于遗传学，表示“染色体组（set of chromosomes）的数量”。例如：diploid（二倍体，2套）、triploid（三倍体，3套）、tetraploid（四倍体，4套）、pentaploid（五倍体，5套）。","在正式科研写作中，更常用“pentaploid”。“five-ploid”属于直译式或非正式/临时造词，用来让读者一眼看懂“5套染色体组”。"]}
{"word":"five-ploidy","summary":{"en":"Five-ploidy means having five sets of chromosomes in a cell (pentaploidy).","zh":"five-ploidy 指细胞具有五套染色体组的状态（五倍体/ pentaploidy）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Genetics) The condition of having five complete sets of chromosomes in each cell; also called pentaploidy.","zh":"（遗传学）五倍体状态：细胞中含有五套完整染色体组的情况；也称为五倍体（pentaploidy）。"},"examples":[{"en":"Some plant breeders study five-ploidy to see how extra chromosome sets affect size and fertility.","zh":"一些植物育种者研究五倍体状态，以了解额外的染色体组如何影响体型和生育力。"},{"en":"Five-ploidy is rare in animals but can occur in certain plants and lab-created lines.","zh":"五倍体在动物中较罕见，但在某些植物以及实验室培育的品系中可能出现。"}]}],"synonyms":["pentaploidy","pentaploid condition"],"phonetic":"/ˌfaɪv ˈplɔɪdi/","extraExplanation":["“ploidy（倍性）”表示一套染色体组的“套数”。例如：diploidy（二倍体，2套，常见于人类体细胞）、triploidy（三倍体，3套）、pentaploidy（五倍体，5套）。","在自然界里，多倍体在植物中更常见，可能带来更大的细胞、叶片或果实等性状，但也可能降低生育力；在动物中多倍体通常更难稳定存活。","“five-ploidy”并不是日常英语常用词，更常见的专业写法是“pentaploidy”。在学术写作中也可能写作“five ploidy”或“5n (pentaploid) condition”，取决于领域习惯。"]}
{"word":"five-point","summary":{"en":"“Five-point” describes something with five points (especially a star shape) or a system with five attachment/sections (like a five-point harness).","zh":"“five-point”指“有五个尖/角的”（常指五角星形状），或指“由五个固定点/部分构成的系统”（如五点式安全带）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five points or tips; made with five pointed parts (often used to describe a star shape).","zh":"有五个尖/角的；由五个尖端组成的（常用来形容五角星形状）。"},"examples":[{"en":"The police badge had a five-point star in the center.","zh":"警徽中央有一颗五角星。"},{"en":"She drew a five-point star on the notebook cover.","zh":"她在笔记本封面上画了一颗五角星。"}]},{"partOfSpeech":"n.","definition":{"en":"A five-point star shape or symbol.","zh":"五角星形状；五角星符号。"},"examples":[{"en":"The flag includes a five-point in each corner.","zh":"旗帜的每个角上都有一个五角星。"},{"en":"He carved a small five-point into the wood.","zh":"他在木头上刻了一个小五角星。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used in names for things that have five main sections or attachment points (for example, a safety harness).","zh":"用于指由五个主要部分/连接点构成的事物（例如安全带系统）。"},"examples":[{"en":"The child seat uses a five-point harness for safety.","zh":"儿童安全座椅使用五点式安全带以确保安全。"},{"en":"Check that the five-point harness is tightened correctly.","zh":"检查五点式安全带是否正确收紧。"}]}],"synonyms":["five-pointed","pentagonal (often for five-sided, not always ‘pointed’)","star-shaped (context-dependent)"],"phonetic":"/ˌfaɪv ˈpɔɪnt/","extraExplanation":["“five-point star（五角星）”在不同文化与国家里可能有不同象征意义：例如在一些国旗、军警徽章中代表国家、权威或统一；在某些场景也可能与特定组织或符号系统有关。理解时最好结合具体语境。","“five-point harness（五点式安全带）”常见于儿童安全座椅、赛车或特定工作防护装备：两肩、两髋加胯下共五个固定点，能更均匀分散冲击力。"]}
{"word":"five-pointed","summary":{"en":"Describes something with five points, especially a star.","zh":"形容某物有五个尖角，尤其指五角星形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five points or corners (often used to describe a star shape).","zh":"有五个尖角（或角）的；五角的（常用来形容五角星形状）。"},"examples":[{"en":"The flag has a five-pointed star in the center.","zh":"这面旗帜中央有一颗五角星。"},{"en":"She drew a five-pointed star on the notebook cover.","zh":"她在笔记本封面上画了一个五角星。"}]}],"synonyms":["five-cornered","pentagonal (often more general)","star-shaped (less specific)"],"phonetic":"/ˌfaɪv ˈpɔɪn.tɪd/","extraExplanation":["“Five-pointed”常作为复合形容词使用，后面常接名词：five-pointed star（五角星）、five-pointed crown（五尖冠）。","文化语境：五角星在不同文化中象征意义不同（如国家旗帜、军衔标志、装饰图案等）。在阅读或写作时，重点理解它描述的是“形状特征”，不一定带有特定政治或宗教含义。","拼写提示：作为形容词通常要加连字符（five-pointed），但在名词短语里也可能看到不加连字符的写法，尤其在较随意的文本中。"]}
{"word":"five-pointed star","summary":{"en":"a star shape with five points","zh":"有五个尖角的星形图案"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a star-shaped figure with five points, often drawn with five straight lines (a pentagram)","zh":"五角星（五个尖角的星形图案，常用五条直线画出；也可指五芒星）"},"examples":[{"en":"The flag has a five-pointed star in the center.","zh":"这面旗帜中央有一颗五角星。"},{"en":"She doodled a five-pointed star in the corner of her notebook.","zh":"她在笔记本角落随手画了一个五角星。"}]}],"synonyms":["pentagram","five-point star"],"phonetic":"/ˌfaɪv ˈpɔɪn.tɪd stɑr/","extraExplanation":["五角星在不同文化中都有象征意义：常见于国旗、徽章与军衔标志；在几何/符号语境中也可能指“五芒星”（pentagram）。具体含义要看出现的场合与文化背景。"],"etymology":"“five-pointed”由 five（五）+ pointed（有尖角的）构成；“star”指星形图案。英语里常用这种复合形容词来描述形状特征。","mnemonic":["记法：five=5；pointed=有“尖尖的点”。合起来就是“有五个尖尖点的星”。","联想：看到“point”想到“点/尖”，五个 point 就是五角。"]}
{"word":"five-power","summary":{"en":"“five-power” means 5× magnification, especially for optical devices; it can also mean a 5× lens/device.","zh":"“five-power”指五倍放大（5×），多用于光学设备；也可指五倍镜片/装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a magnifying power of five times (5×); used for lenses, microscopes, binoculars, etc.","zh":"（镜片、显微镜、望远镜等）五倍放大（5×）的。"},"examples":[{"en":"A five-power magnifier is enough to read the small print on this label.","zh":"用五倍放大镜就足够看清这张标签上的小字了。"},{"en":"He bought a five-power scope for beginner-level shooting practice.","zh":"他买了一个五倍瞄准镜，用来做入门级射击练习。"}]},{"partOfSpeech":"n.","definition":{"en":"A lens or device that magnifies five times (a 5× lens/device).","zh":"五倍放大镜（或五倍放大装置）。"},"examples":[{"en":"Try a five-power if the text still looks blurry.","zh":"如果文字还是模糊，试试用一个五倍放大镜。"},{"en":"The kit includes a five-power and a ten-power lens.","zh":"这套工具包含一个五倍镜片和一个十倍镜片。"}]}],"synonyms":["5x","five-times","fivefold","5-power"],"phonetic":"ˈfaɪv ˌpaʊər","extraExplanation":["“five-power”常见于光学与摄影语境，表示“5×放大倍率”。注意这里的power指“放大倍率”，不是“力量/权力”。","在一些领域（如眼镜/验光）power也可指“屈光度（diopter）”，但日常里说“five-power”更常被理解为“5×”。如果是屈光度，表达通常更明确（如“5 diopters”或“a +5 lens”）。","英语里这种结构常用连字符构成复合形容词（five-power lens / five-power magnifier）。也常写作“5-power”或更直接的“5x”。"]}
{"word":"Five-pronged overall plan","summary":{"en":"a comprehensive plan with five main components","zh":"包含五个主要要点的综合性总体规划"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A comprehensive strategy that has five main parts, steps, or areas of focus.","zh":"由五个主要部分/步骤/重点组成的总体规划（综合性策略）。"},"examples":[{"en":"The company announced a five-pronged overall plan to cut costs and improve service.","zh":"公司公布了一项五管齐下的总体规划，以降低成本并提升服务。"},{"en":"Her five-pronged overall plan focuses on safety, staffing, training, technology, and customer feedback.","zh":"她的五管齐下的总体规划聚焦于安全、人员配置、培训、技术和客户反馈。"},{"en":"The minister presented a five-pronged overall plan for economic recovery.","zh":"部长提出了一项经济复苏的五管齐下总体规划。"}]}],"synonyms":["five-point plan","five-part strategy","multi-pronged strategy","comprehensive plan","holistic strategy"],"phonetic":"/ˌfaɪv ˈprɔŋd ˈoʊvərˌɔl plæn/","extraExplanation":["写作中常见搭配：a five-pronged plan/strategy/approach（五管齐下的计划/策略/方法）。","和“five-step plan（五步计划）”不同：pronged 更强调“五个方向/支柱并行推进”，不一定按顺序执行。"],"etymology":"“prong”原指叉子或鹿角的“尖叉/叉齿”。英语里常用这种形象化比喻，把一个行动方案分成多个“叉”或“支点”（two-pronged/three-pronged 等）。 “overall plan”表示“总体规划”。合起来强调：整体方案由五个并行要点构成。","mnemonic":["把 prong 想成“叉子的一根叉齿”。five-pronged 就是“有五根叉齿”→ 五个方向一起发力。","联想中文成语“多管齐下/五管齐下”，含义非常接近。"]}
{"word":"five-protic","summary":{"en":"“Five-protic” means an acid can donate five protons (H⁺), i.e., it is pentaprotic.","zh":"“five-protic”指可释放五个H⁺的酸，即五元酸/五质子酸（pentaprotic）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Able to donate five protons (H⁺); describing an acid that can release five H⁺ ions per molecule through stepwise dissociation.","zh":"（化学）可释放五个质子（H⁺）的；指一种酸分子能通过逐步电离放出五个H⁺。"},"examples":[{"en":"A “five-protic” (pentaprotic) acid can lose up to five H⁺ ions in water, one step at a time.","zh":"“five-protic”（五元酸/五质子酸）在水中最多可逐步失去五个H⁺。"},{"en":"In acid–base problems, a five-protic acid has five dissociation steps (Kₐ1 to Kₐ5).","zh":"在酸碱题中，five-protic acid 有五步电离（Kₐ1 到 Kₐ5）。"}]}],"synonyms":["pentaprotic","polyprotic (with five ionizable protons)","five-proton-donating"],"phonetic":"ˌfaɪvˈproʊtɪk","extraExplanation":["“five-protic”在正式教材或论文中不算特别常见，更常见的说法是 **pentaprotic**（五元酸/五质子酸）或更一般的 **polyprotic**（多元酸/多质子酸）。","判断“几-protic”的关键是：一分子酸理论上有几个**可电离的H⁺**（通常写作HₙA），就可能是n-protic；但并不是所有氢原子都算，只有能以H⁺形式电离的才算。","多元酸通常是“逐步电离”：先失去第一个H⁺最容易，后面的越来越难，因此常见现象是 Kₐ1 > Kₐ2 > Kₐ3 …。","在写作中更自然的表达包括：a pentaprotic acid / a five-proton donor / a polyprotic acid with five ionizable protons。"]}
{"word":"five-quarters","summary":{"en":"“Five-quarters” usually means a 5/4 musical meter; literally it can also mean five quarter-dollar coins ($1.25).","zh":"“five-quarters”通常指音乐的5/4拍；字面上也可指五枚25美分硬币（1.25美元）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(music) A time signature/meter with five beats per measure (5/4), often felt as 3+2 or 2+3.","zh":"（音乐）5/4拍；每小节五拍的节拍/拍号，常被分组感受为3+2或2+3。"},"examples":[{"en":"This piece is written in five-quarters, so the rhythm feels slightly off-balance in a cool way.","zh":"这首曲子是5/4拍，所以节奏会有一种微微“不平衡”的酷感。"},{"en":"Try counting five-quarters as “ONE-two-three, ONE-two.”","zh":"可以把5/4拍数成“1-2-3，1-2”。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, literal) Five quarter-dollar coins, worth $1.25.","zh":"（非正式，字面）五枚25美分硬币；合计1.25美元。"},"examples":[{"en":"I only have five-quarters—will that cover the parking meter?","zh":"我只有五枚25美分硬币——够投停车计时器吗？"},{"en":"He gave me five quarters for the vending machine.","zh":"他给了我五枚25美分硬币去买自动售货机的东西。"}]}],"synonyms":["5/4 time","five-four time","one dollar and a quarter (literal meaning)"],"phonetic":"ˌfaɪv ˈkwɔrtərz","extraExplanation":["在音乐里更常见的说法是“5/4 time”或“five-four time”。“five-quarters”在口语中也能听到，但多出现在较随意的表达。著名的5/4例子包括爵士乐中常被提到的《Take Five》，它让很多人第一次注意到5/4拍的律动。"]}
{"word":"five-ranked","summary":{"en":"“Five-ranked” means ranked fifth (in 5th place).","zh":"“five-ranked”表示“排名第五（第五位）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Ranked fifth in a list, competition, or hierarchy; in the fifth position.","zh":"（在名单、比赛或等级中）排名第五的；处于第五位的。"},"examples":[{"en":"She is five-ranked in the national tennis standings.","zh":"她在全国网球排名中位列第五。"},{"en":"Our team finished five-ranked this season.","zh":"我们队本赛季最终排名第五。"}]}],"synonyms":["fifth-ranked","ranked fifth","No. 5"],"phonetic":"/ˈfaɪv ræŋkt/","extraExplanation":["“five-ranked”是由数字 + 过去分词（ranked）构成的复合形容词，常用连字符修饰名词（如 five-ranked player / five-ranked team）。在更正式或更常见的表达里，也可以说 “ranked fifth” 或 “the fifth-ranked”。"]}
{"word":"five-rayed","summary":{"en":"Five-rayed means having five radiating parts, like a five-pointed star or a sea star with five arms.","zh":"five-rayed 指“有五个向外放射的部分”，如五角星或有五条腕的海星。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five rays, arms, or radiating parts (for example, a five-pointed star shape or a sea star with five arms).","zh":"有五条射线／五个辐射部分的（例如五角星形状，或有五条腕的海星）。"},"examples":[{"en":"The diagram shows a five-rayed star inside a circle.","zh":"图示显示一个圆圈内的五角星。"},{"en":"Many sea stars are five-rayed, with one arm extending in each direction.","zh":"许多海星是五射状的，每条腕向不同方向伸展。"},{"en":"The flower has a five-rayed pattern when viewed from above.","zh":"从上方看，这朵花呈五射状的图案。"}]}],"synonyms":["five-pointed","pentaradiate","pentamerous"],"phonetic":"/ˌfaɪvˈreɪd/","extraExplanation":["“rayed”常用于描述“从中心向外放射”的结构（像光芒、辐条、花瓣或动物的腕）。因此 five-rayed 常见于生物学/植物学/动物学描述中，也可用于图案或徽章等视觉形状。"]}
{"word":"five-ribbed","summary":{"en":"“Five-ribbed” means having five raised ribs or ridges, especially in scientific descriptions.","zh":"“five-ribbed”指“有五条肋纹/棱脊/筋条的”，常见于科学或描述性文字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five ribs (raised lines, ridges, or supporting “strips”), often used to describe plants, shells, or anatomical structures.","zh":"（表面）有五条肋纹／棱脊／支撑条的；常用于描述植物、贝壳或解剖结构。"},"examples":[{"en":"The botanist described it as a five-ribbed leaf.","zh":"植物学家把它描述为一片五肋脉的叶子。"},{"en":"A five-ribbed shell pattern helps identify the species.","zh":"五肋纹的贝壳纹路有助于辨认物种。"},{"en":"The seed pod is small and five-ribbed along its length.","zh":"这种种荚很小，沿长度方向有五条肋脊。"}]}],"synonyms":["five-ridged","five-ribbed (with hyphen)","quinqueribbed (rare/technical)"],"phonetic":"/ˈfaɪv ˌrɪbd/","extraExplanation":["这是一个常见的英语复合形容词结构：数字 + 名词过去分词（five + ribbed）。在作定语时通常加连字符（five-ribbed leaf）；如果放在名词后作表语，有时可不加连字符（The leaf is five ribbed / five-ribbed），但写作中多仍保留连字符以避免歧义。","“rib”在这里不是“肋骨（肉）”的日常意思，而更接近“凸起的筋条/棱/脊”（如叶脉、贝壳的棱线、织物的罗纹等）。"]}
{"word":"five-ridged","summary":{"en":"“Five-ridged” means having five raised ridges or lines, often in scientific descriptions.","zh":"“five-ridged”指“有五条棱/脊（隆起的线）”，常见于科学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five ridges (raised lines), often used to describe a surface, seed, fruit, shell, or other natural object.","zh":"有五条棱（隆起的线/脊），常用于描述表面、种子、果实、贝壳等自然物体。"},"examples":[{"en":"The seed is five-ridged, with each ridge running from top to bottom.","zh":"这种种子有五条棱，每条棱都从上端延伸到下端。"},{"en":"Under the microscope, the pollen grain looks five-ridged.","zh":"在显微镜下，这粒花粉看起来有五条棱。"}]}],"synonyms":["five-keeled","with five ridges","quinqueridged"],"phonetic":"/ˈfaɪv rɪdʒd/","extraExplanation":["“five-ridged”是一个带连字符的复合形容词：five（五）+ ridged（有棱/有脊的）。在科学写作（尤其是植物学、动物学、地质学的形态描述）中很常见，用来快速、精确地说明“有几条棱/脊”。","ridged 指“有隆起的线条（ridges）”。在日常英语里也可以说 “with five ridges”，但在正式描述中常用这种简洁的复合形容词。"]}
{"word":"five-ring","summary":{"en":"“Five-ring” most commonly refers to the Olympic five rings, and it can also mean something extremely busy or spectacular (like a ‘five-ring circus’).","zh":"“five-ring”最常指奥运会的“五环”标志；也可引申形容场面特别忙乱或极其热闹（如 five-ring circus）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five connected rings; most often referring to the Olympic symbol (the five rings).","zh":"（通常指奥运会标志）由五个相连的环组成的；“五环”的。"},"examples":[{"en":"The five-ring flag is a well-known Olympic symbol.","zh":"五环旗是著名的奥运会标志。"},{"en":"The stadium was decorated with five-ring banners during the Games.","zh":"比赛期间，体育场挂满了五环横幅。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Very large, busy, or spectacular, like a circus with five rings happening at once.","zh":"（非正式）极其庞大、热闹或场面惊人的，像“五个场地同时表演的马戏团”那样。"},"examples":[{"en":"It felt like a five-ring circus in the office during the deadline week.","zh":"截止日期那周，办公室简直像个“五环马戏团”一样乱成一团。"},{"en":"Managing that event was a five-ring job—so many teams and details.","zh":"组织那个活动是个“五环级”的工作——团队多、细节也多。"}]}],"synonyms":["Olympic (context)","five-ringed","hectic (figurative)","chaotic (figurative)"],"phonetic":"ˌfaɪv ˈrɪŋ","extraExplanation":["“five-ring”最常见与奥林匹克相关（the five rings）。在英文里也常见写法为“five-ringed”（更强调“有五个环的”）。","“five-ring circus”原本指大型马戏团同时在五个表演圈里进行节目，后来引申为“特别忙乱/事情同时发生很多”的比喻说法。","拼写上常用连字符：five-ring（作定语），例如 five-ring symbol / five-ring banners。"]}
{"word":"five-rowed","summary":{"en":"“Five-rowed” means “having five rows; arranged in five parallel lines,” often in botany or agriculture.","zh":"“five-rowed”指“有五行/五列；排列成五列”，常见于植物学或农业描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five rows or arranged in five lines/series (often used to describe seeds, kernels, or parts lined up in parallel rows).","zh":"有五行的；排列成五列（常用于描述种子、籽粒或部件平行排列成五列）。"},"examples":[{"en":"This variety is a five-rowed barley with tightly packed kernels.","zh":"这个品种是五列大麦，籽粒排列得很紧密。"},{"en":"The fruit’s seeds are five-rowed when you cut it across.","zh":"把果实横切开时，种子呈五列排列。"}]}],"synonyms":["five-row","five-ranked","in five rows"],"phonetic":"/ˌfaɪv ˈroʊd/","extraExplanation":["“five-rowed”是复合形容词（数字 + 过去分词/形容词），常用连字符连接，用来修饰名词：five-rowed barley / five-rowed corn 等。","在农业与植物学语境中，row 指“（籽粒、穗、种子等的）一行/一列”；因此 five-rowed 强调“有五列”的结构特征。"]}
{"word":"five-seeded","summary":{"en":"“Five-seeded” means having or containing five seeds, often in botanical descriptions.","zh":"“five-seeded”意为“有五粒种子的/含有五粒种子的”，常见于植物学或描述性语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five seeds; containing five seeds (usually used in botanical or descriptive writing).","zh":"（通常用于植物学或描述性写作）有五粒种子的；含有五粒种子的。"},"examples":[{"en":"The botanist described the berry as five-seeded and slightly bitter.","zh":"植物学家把这种浆果描述为五籽的，味道略苦。"},{"en":"A five-seeded fruit may produce more seedlings if conditions are right.","zh":"如果条件合适，五籽的果实可能会长出更多幼苗。"}]}],"synonyms":["five-seeded","containing five seeds","five-seeded (botanical)"],"phonetic":"ˌfaɪv ˈsiːdɪd","extraExplanation":["“five-seeded”是由数字 + 过去分词（seeded）组成的复合形容词，常用连字符（-）连接，尤其放在名词前作定语时：a five-seeded fruit。放在系动词后作表语时有时也可不加连字符，但加上更清晰：The fruit is five-seeded。","这类结构在说明“某物含有多少个某物”时很常见：three-legged stool（三条腿的凳子）、two-story house（两层的房子）、many-seeded plant（多籽植物）。"]}
{"word":"five-segmented","summary":{"en":"Describes something divided into five separate segments or parts.","zh":"形容某物由五个分节/部分组成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Divided into five distinct parts or sections (segments).","zh":"分成五个清晰部分的；五节（段）组成的。"},"examples":[{"en":"The insect’s antennae are five-segmented.","zh":"这只昆虫的触角是五节的。"},{"en":"They described a five-segmented structure in the diagram.","zh":"他们在图中描述了一个五段结构。"}]}],"synonyms":["five-part","five-sectioned","pentasegmented"],"phonetic":"/ˌfaɪv sɛɡˈmɛn.tɪd/","extraExplanation":["这个词常见于生物学与解剖学描述，尤其用于昆虫学（如触角、足、腹部的“节”）或植物形态学（如分成若干“节/段”的结构）。在学术写作里也可用于更抽象的对象（例如“分成五部分的模型/流程”）。","写法上多用连字符（five-segmented）作定语：a five-segmented antenna；放在名词后作表语时也可不用连字符：The antenna is five segmented（但学术文本通常仍保留连字符以更清晰）。"]}
{"word":"five-sepal","summary":{"en":"A botanical adjective meaning “having five sepals.”","zh":"植物学形容词，表示“有五个萼片的（五萼的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five sepals (the small leaf-like parts that protect a flower bud).","zh":"（植物学）有五个萼片的；五萼的（萼片是保护花蕾的叶状结构）。"},"examples":[{"en":"The five-sepal flower bud was tightly closed before it opened in the morning.","zh":"这朵五萼的花蕾在早晨开放前紧紧闭合。"},{"en":"In the field guide, the plant is described as five-sepal with pale yellow petals.","zh":"在野外图鉴中，这种植物被描述为五萼、淡黄色花瓣。"}]}],"synonyms":["pentasepalous","five-sepaled"],"phonetic":"/ˌfaɪv ˈsɛpəl/","extraExplanation":["“five-sepal”多见于植物学描写，用来快速记录花部结构特征。日常英语里更常见的说法是“a flower with five sepals”（有五个萼片的花）。","萼片（sepal）通常是花的最外轮结构，常呈绿色，主要作用是保护未开放的花蕾；有些植物的萼片也会呈现花瓣状颜色。"]}
{"word":"five-sepaled","summary":{"en":"Five-sepaled means a flower has five sepals.","zh":"five-sepaled 指花有五片萼片（五萼）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five sepals (the small leaf-like parts that protect a flower bud).","zh":"（植物学）具五萼的；有五片花萼的（花苞外侧保护花蕾的叶状结构）。"},"examples":[{"en":"The plant has five-sepaled flowers with pale yellow petals.","zh":"这种植物的花为五萼，花瓣呈淡黄色。"},{"en":"In the diagram, label the five-sepaled calyx before identifying the petals.","zh":"在图中，先标注五萼的花萼，再辨认花瓣。"}]}],"synonyms":["pentasepalous","five-sepal(ed)"],"phonetic":"/ˌfaɪv ˈsɛpəld/","extraExplanation":["“five-sepaled”是较少见的拼写；更常见的写法有“five-sepaled / five-sepal(ed)”以及学术用语“pentasepalous（五萼的）”。","“sepal”指“花萼/萼片”，通常在花的最外层，用来保护花蕾；“calyx”是“花萼（整体）”。"]}
{"word":"five-sided","summary":{"en":"“Five-sided” describes something that has five sides, especially a 2D shape.","zh":"“five-sided”表示“有五条边的”，尤其用于描述二维图形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five sides (usually said about a flat shape).","zh":"五边的（通常指平面图形）。"},"examples":[{"en":"A regular pentagon is a five-sided shape.","zh":"正五边形是一个五边的图形。"},{"en":"The house has a five-sided window on the top floor.","zh":"这栋房子顶楼有一扇五边的窗户。"}]}],"synonyms":["pentagonal","five-edged"],"phonetic":"/ˌfaɪv ˈsaɪdɪd/","extraExplanation":["“five-sided”是一个复合形容词（number + past participle），常用于数学、几何或描述设计外形。写作时通常用连字符：five-sided。","在几何语境中，五边形是“pentagon”。“five-sided”更偏向直观描述（有五条边），而“pentagonal”更偏向正式/学术（五边形的）。"]}
{"word":"five-spherical","summary":{"en":"“Five-spherical” is a rare adjective that usually means related to a 5-sphere (a five-dimensional/hyperspherical object) or, less commonly, made up of five spheres.","zh":"“Five-spherical”是较少见的形容词，通常指与5-球（五维/超球体）相关；较少情况下指由五个球体组成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a five-dimensional sphere (a “5-sphere”), used in mathematics and physics to describe hyperspherical geometry.","zh":"（数理）与五维球体（“5-球 / 5-sphere”）有关的；用于描述超球几何。"},"examples":[{"en":"In topology, a five-spherical surface can be studied through its symmetry and curvature.","zh":"在拓扑学中，可以通过对称性和曲率来研究五维球面（five-spherical surface）。"},{"en":"Some models use five-spherical coordinates to simplify high-dimensional calculations.","zh":"一些模型会使用五维超球坐标（five-spherical coordinates）来简化高维计算。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of, involving, or arranged as five spheres (rare; usually clearer to say “five spheres” or “five spherical objects”).","zh":"由五个球体构成的；涉及或排列成五个球体的（较少见；通常直接说“five spheres / 五个球体”更清楚）。"},"examples":[{"en":"The sculpture has a five-spherical design: five small balls connected by thin rods.","zh":"这件雕塑是“五球式”的设计：五个小球用细杆连接。"},{"en":"They built a five-spherical cluster for the display.","zh":"他们为展览搭建了一个由五个球体组成的簇状结构。"}]}],"synonyms":["hyperspherical","five-dimensional","spherical (in a five-dimensional sense)"],"phonetic":"/ˌfaɪv ˈsfɛrɪkəl/","extraExplanation":["“five-spherical”不是常见日常词，更像是为了特定学科或写作需要临时组合出来的形容词。多数情况下，学术写作会更常用“5-sphere / five-dimensional sphere / hyperspherical（超球的）”。","在数学里，“5-sphere（五维球面）”通常写作 S^5，指存在于六维空间中的“单位球面”的边界（类比：普通球面 S^2 是三维空间中单位球的边界）。"]}
{"word":"five-spot","summary":{"en":"“Five-spot” is informal American English for a five-dollar bill or five dollars (and less commonly a five-cent coin).","zh":"“five-spot”是美式口语，指五美元纸币或五美元（较少见也可指五美分硬币）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, US) A five-dollar bill; by extension, five dollars.","zh":"（非正式，美式）五美元纸币；也可泛指五美元。"},"examples":[{"en":"Do you have a five-spot for the tip?","zh":"你有一张五美元（纸币）可以付小费吗？"},{"en":"I can lend you a five-spot, but that’s all I’ve got.","zh":"我可以借你五美元，但我就只有这么多了。"},{"en":"The sandwich costs a five-spot, tax included.","zh":"这个三明治五美元，含税。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) A five-cent coin (a nickel).","zh":"（较少见）五美分硬币（nickel）。"},"examples":[{"en":"Back then, a five-spot could buy you a soda.","zh":"那时候，五美分就能买一瓶汽水。"},{"en":"He dug around in his pocket for a five-spot.","zh":"他在口袋里翻找一枚五美分硬币。"}]}],"synonyms":["five","five dollars","fiver","five-dollar bill"],"phonetic":"/ˈfaɪv spɑt/","extraExplanation":["“five-spot / five spot”属于口语俚语，常见于美式英语，表示一张五美元纸币或“五块钱”。类似结构还有“ten-spot”（十美元）、“twenty-spot”（二十美元）。","写法上有时会写成five-spot（带连字符）或five spot（分开），口语里更常听到“a five spot”。"]}
{"word":"five-spotted","summary":{"en":"“Five-spotted” describes something that has five spots or markings, especially in nature descriptions.","zh":"“five-spotted”表示“有五个斑点/花纹的”，常用于自然界（动植物）外观描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five spots or five spot-like markings (often used to describe an animal, insect, or plant).","zh":"有五个斑点的；带有五处点状花纹的（常用于描述动物、昆虫或植物）。"},"examples":[{"en":"The five-spotted ladybug is easy to recognize by the pattern on its wings.","zh":"五斑瓢虫很容易通过翅膀上的花纹辨认出来。"},{"en":"We saw a five-spotted fish near the rocks in the shallow water.","zh":"我们在浅水区的岩石附近看到了一条五斑鱼。"},{"en":"A five-spotted leaf can indicate disease or insect damage.","zh":"叶子上出现五个斑点可能表示病害或虫害。"}]}],"synonyms":["five-marked","spotted (with five spots)","five-dotted"],"phonetic":"/ˌfaɪv ˈspɑtɪd/","extraExplanation":["“five-spotted”是由数字 + 过去分词（spotted）构成的复合形容词，通常要加连字符，用来在名词前作定语：a five-spotted beetle。","在生物学/博物学语境中，这类描述性形容词常用于物种的俗名或特征描写，强调外观标志（例如翅、叶、皮毛上的斑点数量）。"]}
{"word":"five-stage","summary":{"en":"“Five-stage” describes something organized into five stages or phases.","zh":"“five-stage”指由五个阶段/步骤组成的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five stages (steps or phases) as part of a process, system, plan, or model.","zh":"（过程、系统、计划或模型）由五个阶段（步骤/阶段）组成的。"},"examples":[{"en":"The company introduced a five-stage training program for new employees.","zh":"公司为新员工推出了一个五阶段的培训计划。"},{"en":"We used a five-stage model to describe how people adapt to change.","zh":"我们用一个五阶段模型来描述人们如何适应变化。"},{"en":"The project follows a five-stage review process before approval.","zh":"该项目在获批前要经过五阶段的审核流程。"}]}],"synonyms":["five-phase","five-step","consisting of five stages","in five stages"],"phonetic":"/ˈfaɪv ˌsteɪdʒ/","extraExplanation":["“five-stage”通常作定语放在名词前（a five-stage process）。也可写作“five stage”（不加连字符，较少见）或“five-stage”带连字符（更清晰、常见）。在英文中，数字+名词作复合形容词时，名词通常用单数形式：five-stage / three-step / two-year。"]}
{"word":"five-stamen","summary":{"en":"Five-stamen describes a flower that has five stamens.","zh":"five-stamen 用来描述花具有五枚雄蕊。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five stamens (the pollen-producing parts) in a flower.","zh":"（植物学）具五枚雄蕊的；五雄蕊的（花中产生花粉的部分为雄蕊）。"},"examples":[{"en":"This herb has small, five-stamen flowers that attract bees.","zh":"这种草本植物开小小的五雄蕊花，能吸引蜜蜂。"},{"en":"In the field guide, the plant is described as five-stamen with pale yellow petals.","zh":"在野外图鉴中，这种植物被描述为五雄蕊、淡黄色花瓣。"}]}],"synonyms":["pentandrous","five-androus"],"phonetic":"/ˌfaɪv ˈsteɪmən/","extraExplanation":["“stamen”是花的雄性生殖器官，通常由“花丝（filament）+ 花药（anther）”组成；花药产生花粉。识别“几雄蕊（如 five-stamen）”是植物分类与辨认时常用的特征。","同类的植物学表达还有：three-stamen（三雄蕊）、six-stamen（六雄蕊）等。更学术的同义词是“pentandrous（五雄蕊的）”。"]}
{"word":"five-stamened","summary":{"en":"Five-stamened describes a flower that has five stamens.","zh":"five-stamened 指花具有五个雄蕊。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five stamens (the pollen-producing parts) in a flower.","zh":"（植物学）五雄蕊的；花中有五个雄蕊（产生花粉的结构）。"},"examples":[{"en":"This species has five-stamened flowers and a five-lobed corolla.","zh":"这种植物的花是五雄蕊的，花冠也有五个裂片。"},{"en":"Look closely: each blossom is five-stamened, with the stamens surrounding the central pistil.","zh":"仔细看：每朵花都是五雄蕊的，雄蕊环绕着中央的雌蕊。"}]}],"synonyms":["pentandrous","five-stamen"],"phonetic":"/ˌfaɪv ˈsteɪmənd/","extraExplanation":["“stamen”是“雄蕊”，属于花的雄性生殖器官；“five-stamened”常见于植物学描述中，用来快速记录花的结构特征（常与“five-petaled 五瓣的”“five-lobed 五裂的”等并列出现）。","这个词是由“five + stamen + -ed”构成的复合形容词，常用连字符（five-stamened）连接，表示“具有……的”结构特征。","近义的更专业术语是“pentandrous”（五雄蕊的），常见于分类学或植物志写作。"]}
{"word":"five-star","summary":{"en":"Top-quality; rated at the highest level.","zh":"最高等级的；顶级的；五星评级的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Of the highest quality or level; excellent and luxurious.","zh":"五星级的；最高品质的；非常豪华的。"},"examples":[{"en":"They booked a five-star hotel for their anniversary.","zh":"他们为纪念日订了一家五星级酒店。"},{"en":"The restaurant offers five-star service at reasonable prices.","zh":"这家餐厅提供五星级服务，价格也合理。"},{"en":"She received five-star reviews for her new novel.","zh":"她的新小说获得了五星好评。"}]}],"synonyms":["top-notch","first-rate","premium","high-end","luxury","excellent","A-list"],"phonetic":"/ˌfaɪv ˈstɑɹ/","extraExplanation":["用法提示：常作定语放在名词前（five-star hotel/restaurant/service）。也可用于评论系统里表示“五星好评”（a five-star rating/review）。","拼写提示：英语里常写作带连字符的 five-star（尤其放在名词前作形容词时）。作名词短语时更常见 five stars / a five-star rating。"],"etymology":"源自“five star（五颗星）”的评级习惯：用星级数量来表示质量等级，五颗星通常代表最高等级（常见于酒店、餐厅、评价系统等）。","mnemonic":["记忆法：five=五，star=星，联想“星越多越好”，五颗星=最高级。","联想中文：看到“五⭐”，直接对应“五星级/五星好评”。"]}
{"word":"five-stones","summary":{"en":"Five-stones is a traditional toss-and-catch game played with five small objects, and it can also mean the pieces used to play it.","zh":"Five-stones 指一种用五个小物件进行抛接的传统游戏，也可指这五个游戏用的小物件本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional hand game in which players toss and catch five small objects (stones, beanbags, or plastic pieces) in a set of moves, similar to the game “jacks.”","zh":"一种传统的手部游戏：玩家用五个小物件（石子、布包或塑料小块）按固定动作抛接，玩法类似“挑小棍/抓子儿”(jacks)。"},"examples":[{"en":"We played five-stones during recess with small beanbags.","zh":"我们在课间用小布包玩五子游戏（five-stones）。"},{"en":"She taught her younger brother the basic five-stones moves: toss, grab, and catch.","zh":"她教弟弟五子游戏的基本动作：抛、抓、接。"}]},{"partOfSpeech":"n.","definition":{"en":"the five small pieces used to play this game.","zh":"指玩该游戏用的五个小物件（五颗石子/五个小包等）。"},"examples":[{"en":"I lost one of my five-stones, so we couldn’t finish the game.","zh":"我丢了一颗五子游戏用的石子，所以我们没法把游戏玩完。"},{"en":"These five-stones are made of cloth, so they’re easier to catch.","zh":"这些五子游戏用的小包是布做的，更容易接住。"}]}],"synonyms":["five stones","fivestones","jacks (similar game)","knucklebones (historical/related)"],"phonetic":"/ˌfaɪv ˈstoʊnz/","extraExplanation":["“five-stones”在不同地区也常写作 five stones / fivestones。它在英语里通常被用来指一种“抓子儿/五子棋式抛接”类的传统游戏，和西方的 jacks（用小球和金属钉状小件玩的游戏）很像。","不同文化里也有相近名称：如 knucklebones（早期用动物踝骨作“石子”的历史叫法），以及一些地区称作 “five pebbles”。在东亚、东南亚与大洋洲，类似玩法很常见，常作为童年游戏或民俗游戏出现。"]}
{"word":"five-surface","summary":{"en":"“Five-surface” is a technical compound adjective meaning “having or involving five surfaces.”","zh":"“five-surface”是技术性复合形容词，意思是“具有五个表面”或“涉及五个表面”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) Describing something that has five surfaces, or a process that works on/uses five surfaces (often used as a compound adjective before a noun).","zh":"（技术用语）形容某物有五个表面，或指在五个表面上进行/利用的工艺（常作复合形容词放在名词前）。"},"examples":[{"en":"The part is designed as a five-surface solid for easier inspection.","zh":"这个零件被设计成“五表面”的实体，以便更容易检验。"},{"en":"They used a five-surface machining setup to finish the component.","zh":"他们使用“五表面加工”的工装来完成该部件的加工。"}]}],"synonyms":["five-sided (approx.)","with five faces","five-face (technical)"],"phonetic":"/ˈfaɪv ˈsɝːfɪs/","extraExplanation":["“five-surface”不是日常英语里的固定词，更常见于工程、制造、CAD/3D建模、测量检验等语境，作为“数词 + surface”的复合形容词使用。","在英文中这类结构通常用连字符（five-surface）连接，放在名词前：a five-surface model / a five-surface inspection。若放在名词后或作表语，有时会写作“five surfaces”（例如：The object has five surfaces）。"]}
{"word":"five-syllable","summary":{"en":"“Five-syllable” means “having five syllables,” often used for words or lines in poetry and rhythm.","zh":"“five-syllable”意为“有五个音节的”，常用于描述单词或诗歌/歌词中的诗行节奏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five syllables; made up of five syllables (often said of a word, line, or phrase).","zh":"五音节的；由五个音节组成的（常用于描述单词、诗行或短语）。"},"examples":[{"en":"“Beautiful” is not five-syllable; it has three syllables.","zh":"“beautiful”不是五音节词；它有三个音节。"},{"en":"The poet wrote a five-syllable line to keep the rhythm steady.","zh":"诗人写了一句五音节的诗行来保持节奏稳定。"},{"en":"Try making a five-syllable phrase for your chant.","zh":"试着为你的口号写一个五音节短语。"}]}],"synonyms":["pentasyllabic"],"phonetic":"/faɪv ˈsɪləbəl/","extraExplanation":["在英语里，syllable（音节）大致是你说话时“自然分开的节拍”。five-syllable 常用于诗歌或歌词的节奏控制，例如写每行固定音节数。","更正式的同义词是 pentasyllabic（五音节的），但日常学习与写作中 five-syllable 更常见、更直观。"]}
{"word":"five-tentacled","summary":{"en":"“Five-tentacled” means “having five tentacles,” and it can also be used figuratively for something whose influence reaches out in multiple ways.","zh":"“five-tentacled”意为“有五条触手的”，也可作比喻，指影响力像触手一样向外延伸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five tentacles (long, flexible, arm-like parts), especially describing an animal or creature.","zh":"有五条触手的（触手指细长、可弯曲、像手臂一样的肢体），多用于描述动物或虚构生物。"},"examples":[{"en":"Scientists described the jellyfish as a five-tentacled species found near the reef.","zh":"科学家将这种水母描述为一种在珊瑚礁附近发现的五触手物种。"},{"en":"In the story, a five-tentacled monster rises from the sea.","zh":"在故事里，一个五触手的怪物从海里升起。"},{"en":"The illustrator drew a five-tentacled creature for the book cover.","zh":"插画师为书封面画了一个五触手的生物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Spreading influence in five different directions or reaching out in many ways (used creatively, not common in everyday speech).","zh":"（比喻，用法较文学/创意）影响力向五个方向伸展，或以多种方式“伸出触角”。"},"examples":[{"en":"The author portrays the company as five-tentacled, reaching into media, tech, finance, law, and politics.","zh":"作者把这家公司写成“伸出五条触角”，触及媒体、科技、金融、法律和政治。"},{"en":"Her five-tentacled plan connected five departments at once.","zh":"她的“五触手”计划把五个部门一下子联系起来了。"}]}],"synonyms":["five-armed","five-limbed","many-reaching","far-reaching"],"phonetic":"ˌfaɪv ˈtɛn.tə.kəld","extraExplanation":["“five-tentacled”是由数字+名词+过去分词构成的复合形容词：five + tentacle + -ed，意思是“带有……的”。写作中常用连字符（five-tentacled）来让读者一眼看懂它作为一个整体修饰名词。","“tentacle/触手”在英语里很常见的引申义是“势力范围、影响的延伸”（像触手一样伸出去），因此在新闻评论或小说里可能出现比喻用法。"]}
{"word":"five-times","summary":{"en":"“five-times” means “fivefold” (often before a noun), or “five times” meaning five times the amount or five occasions.","zh":"“five-times”多作定语表示“五倍的/五重的”；也可表示“五倍”或“五次”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Hyphenated, used before a noun) happening or measured five times in amount, number, size, or frequency; fivefold.","zh":"（连字符写法，常放在名词前作定语）在数量、程度、大小或频率上是五倍的；五重的。"},"examples":[{"en":"The new battery offers five-times longer life than the old one.","zh":"新电池的续航时间是旧电池的五倍。"},{"en":"They reported a five-times increase in online orders.","zh":"他们报告线上订单增长了五倍。"}]},{"partOfSpeech":"phrase","definition":{"en":"five times as much/many; on five occasions.","zh":"五倍；五次。"},"examples":[{"en":"This costs five times more than I expected.","zh":"这比我预期贵了五倍。"},{"en":"I’ve called you five times today.","zh":"我今天给你打了五次电话。"}]}],"synonyms":["fivefold","five times","quintuple"],"phonetic":"/faɪv taɪmz/","extraExplanation":["“five times / five-times”的区别：不加连字符的“five times”常作副词性短语（如 five times more / five times a day）。加连字符的“five-times”多用于名词前作定语（如 a five-times increase）。","更常见、更自然的定语表达是“fivefold”（如 a fivefold increase）。"]}
{"word":"five-toed","summary":{"en":"“Five-toed” describes an animal (or foot) that has five toes on each foot.","zh":"“five-toed”指（动物或脚）每只脚有五个脚趾。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five toes on each foot (the typical number for humans and many mammals).","zh":"（每只脚）有五个脚趾的（人类及许多哺乳动物的常见情况）。"},"examples":[{"en":"Humans are five-toed primates.","zh":"人类是五趾灵长类动物。"},{"en":"The fossil shows a five-toed foot, suggesting it walked in a familiar mammal-like way.","zh":"这块化石显示出五趾的脚，暗示它的行走方式与常见的哺乳动物相似。"}]}],"synonyms":["pentadactyl","five-toed (also: five-toed)","five-digit (less common for toes)"],"phonetic":"/ˌfaɪv ˈtoʊd/","extraExplanation":["“five-toed”常用于生物学/古生物学语境，用来描述动物足部结构（如“五趾型”）。很多脊椎动物的四肢在演化早期常见“五个指/趾”的基本结构，后来不同物种可能发生减少、融合或特化（如马的趾数减少）。","写法上常用连字符：five-toed（作定语时更常见），如 a five-toed animal。"]}
{"word":"five-tone","summary":{"en":"“Five-tone” means pentatonic—made of five tones/notes, especially in music scales and melodies.","zh":"“five-tone”指“五音的/五声音阶的”，即由五个音（音级）构成，常用于音乐语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or relating to five distinct tones (especially a scale with five notes); pentatonic.","zh":"（尤指音阶）由五个音/音级构成的；五声音阶的；五音的。"},"examples":[{"en":"Many traditional Chinese melodies use a five-tone scale.","zh":"许多中国传统旋律使用五声音阶。"},{"en":"The composer wrote a five-tone theme to give the piece a folk-like feeling.","zh":"作曲家写了一个五音主题，让作品带有民间风格的感觉。"},{"en":"This flute exercise practices a simple five-tone pattern.","zh":"这段长笛练习训练一个简单的五音型。"}]}],"synonyms":["pentatonic","five-note","five-note scale"],"phonetic":"/ˈfaɪv ˌtoʊn/","extraExplanation":["“five-tone”常见于音乐语境，指“五声音阶/五音音阶”，更常用的标准术语是“pentatonic”。","写作上可见连字符 five-tone（作定语时更常见），也可写作 five tone / five-note（语义接近）。"]}
{"word":"five-toothed","summary":{"en":"“Five-toothed” means having five tooth-like points or notches.","zh":"“five-toothed”表示“有五个齿状尖点或缺刻的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five tooth-like points, notches, or projections (often describing the edge of a leaf, a tool, or a pattern).","zh":"有五个“齿状”尖点/缺刻/突起的（常用于描述叶缘、工具或图案）。"},"examples":[{"en":"The leaf is five-toothed along the upper edge.","zh":"这片叶子的上缘是五齿状的。"},{"en":"A five-toothed rake head can grab more debris at once.","zh":"五齿的耙头一次能抓住更多杂物。"},{"en":"The border has a five-toothed design, like small repeated spikes.","zh":"边框是五齿状的设计，像重复的小尖刺。"}]}],"synonyms":["pentadentate","quinquedentate","five-notched","five-pointed (in some contexts)"],"phonetic":"/ˈfaɪv ˌtuːθt/","extraExplanation":["“five-toothed”是由数字+toothed（有齿的）组成的复合形容词，常用连字符。这里的“tooth/teeth”不是“牙齿”本身，而是指像牙一样的尖点、锯齿或缺刻。","在植物学/形态描述里，它常用来描述叶缘（leaf margin）或花萼等部位的“齿”。较正式的近义词有 pentadentate / quinquedentate（都表示“五齿的”）。"]}
{"word":"five-tubercled","summary":{"en":"“Five-tubercled” means having five small bump-like projections (tubercles), often used in scientific descriptions.","zh":"“five-tubercled”指“有五个小突起/结节的”，多用于科学或形态学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five small rounded bumps (tubercles) on a surface; five-knobbed.","zh":"表面有五个小圆突起（结节、瘤状突起）的；五突起的。"},"examples":[{"en":"The field guide describes the beetle as five-tubercled on the thorax.","zh":"这本野外指南把这种甲虫描述为胸部有“五突起”。"},{"en":"Under a microscope, the shell shows a five-tubercled pattern near the rim.","zh":"在显微镜下，贝壳边缘附近呈现出“五结节”的纹样。"}]}],"synonyms":["five-knobbed","five-bumped","pentatuberculate"],"phonetic":"/ˌfaɪv ˈtuːbərkəld/","extraExplanation":["“tubercle”常指“（表面）小圆疙瘩/小突起”，在生物学描述里很常见，用来精确说明昆虫外骨骼、贝壳、植物器官等的外形特征。","这是一个偏学术/描写性复合形容词：five（五个）+ tubercled（有结节的）。在日常英语中不常用，多见于动物学、昆虫学、植物形态学等文献或鉴定手册。"]}
{"word":"five-tuplet","summary":{"en":"A five-tuplet is a group of five items, especially five notes played in the time usually given to a different number of notes (a musical quintuplet).","zh":"five-tuplet 指“五个一组”，尤其可指音乐中的“五连音”（quintuplet）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of five things considered together; a set of five items.","zh":"五个一组；由五个事物组成的一组（五元组）。"},"examples":[{"en":"In the data table, each record is a five-tuplet of values.","zh":"在数据表中，每条记录都是由五个数值组成的五元组。"},{"en":"The experiment produced a five-tuplet of measurements for each sample.","zh":"这个实验为每个样本产生了一组五个测量值。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) A tuplet that fits five notes into the time normally given to a different number of notes (often four); also called a quintuplet.","zh":"（音乐）五连音：在通常分配给其他音符数量（常见为四个）的时值里演奏五个音符；也可称为 quintuplet（五连音）。"},"examples":[{"en":"The drummer plays a five-tuplet on the snare to create a rolling feel.","zh":"鼓手在军鼓上打出五连音，营造滚动的律动感。"},{"en":"That piano passage sounds fast because it uses five-tuplets in each beat.","zh":"那段钢琴听起来很快，因为每一拍都用了五连音。"}]}],"synonyms":["quintuplet","group of five","5-tuple"],"phonetic":"ˈfaɪv ˌtʌplət","extraExplanation":["“tuplet”常用于音乐节奏里，表示“把若干个音挤进同一段时值”。最常见的是 triplet（三连音）。五连音（five-tuplet/quintuplet）相对更少见，听感往往更“紧”“不平均”，能制造张力或特殊律动。","拼写上更常见的是 quintuplet；“five-tuplet”更直白，但在乐谱与音乐教学中可能不如 quintuplet 常用。"]}
{"word":"five-valence","summary":{"en":"“Five-valence” means having a valence of five (pentavalent), i.e., able to form five chemical bonds.","zh":"“five-valence”指“五价的（pentavalent）”，即价为五、可形成五个化学键。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a valence (combining capacity) of five; able to form five chemical bonds (often said of an atom or element).","zh":"（化学）五价的；价为五的；可形成五个化学键（常用于描述原子或元素）。"},"examples":[{"en":"Phosphorus can form five-valence compounds, such as phosphorus pentachloride (PCl₅).","zh":"磷可以形成五价化合物，例如五氯化磷（PCl₅）。"},{"en":"In some reactions, the element shifts from three-valence to five-valence states.","zh":"在一些反应中，该元素会从三价态转变为五价态。"}]},{"partOfSpeech":"n.","definition":{"en":"A five-valence state (a valence of five) of an element.","zh":"（某元素的）五价状态；价为五的状态。"},"examples":[{"en":"The diagram shows nitrogen in a five-valence state under specific conditions.","zh":"该图示显示氮在特定条件下呈现五价状态。"}]}],"synonyms":["pentavalent","five-valent"],"phonetic":"/ˌfaɪv ˈveɪləns/","extraExplanation":["“Valence”在化学里指元素在形成化合物时通常能结合（或“连结”）的数量。英语里也常写作“pentavalent（五价的）”，在学术写作与教材中更常见。","“Five-valence”更像一种描述性的合成形容词（five + valence），通常用于化学语境；日常英语里不太会用到。"]}
{"word":"five-valency","summary":{"en":"Five-valency refers to having valency five in chemistry—able to form five bonds (or the property of being five-valent).","zh":"five-valency 指化学中的“五价”（或“五价性”）：能形成五个化学键/具有五价的性质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) having a valency of five; able to form five chemical bonds.","zh":"（化学）五价的；具有五个化合价/能形成五个化学键的。"},"examples":[{"en":"Phosphorus often shows five-valency in compounds like phosphorus pentachloride (PCl₅).","zh":"磷在一些化合物中常表现为五价，例如五氯化磷（PCl₅）。"},{"en":"The diagram explains how five-valency allows the central atom to connect to five other atoms.","zh":"这张图解释了五价如何使中心原子与另外五个原子相连。"}]},{"partOfSpeech":"n.","definition":{"en":"the state or property of being five-valent (having valency five).","zh":"五价性；具有五价的性质/状态。"},"examples":[{"en":"Five-valency is discussed in the chapter on bonding and molecular structure.","zh":"关于键合与分子结构的章节中讨论了五价性。"}]}],"synonyms":["pentavalency","pentavalent","valence five"],"phonetic":"/ˌfaɪv ˈveɪlənsi/","extraExplanation":["“five-valency”多见于教材或较直白的写法；更常见的术语是“pentavalency（五价性）”或形容词“pentavalent（五价的）”。","“valency/valence”在化学里指原子通常能形成的键数或化合价概念；不同语境下（如经典价键、氧化态的讨论）可能会有细微差别，阅读时要看教材如何定义。"]}
{"word":"five-valent","summary":{"en":"Five-valent means having a valence of five (pentavalent) in chemistry.","zh":"five-valent 指（化学中）五价的（pentavalent），即具有五个价/能形成五个键。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having a valence of five; able to form five chemical bonds (pentavalent).","zh":"（化学）五价的；具有五个价（能形成五个化学键）的。"},"examples":[{"en":"Phosphorus is often five-valent in compounds like phosphorus pentachloride (PCl₅).","zh":"在五氯化磷（PCl₅）等化合物中，磷常常表现为五价。"},{"en":"The textbook explains why some elements can be five-valent in certain reactions.","zh":"这本教材解释了为什么某些元素在特定反应中可以呈现五价。"}]}],"synonyms":["pentavalent","quinquevalent"],"phonetic":"/ˌfaɪv ˈveɪlənt/","extraExplanation":["“valent/valence（价）”在入门化学里常用来表示原子通常会形成多少个键；“five-valent”就是“价为5”。在不同理论体系（如氧化态、价键、配位数）里，这个说法的严格含义可能会略有差别，但在基础语境中一般理解为“能形成五个键/五价”。","常见近义词是“pentavalent（五价的）”，在学术与教材中更常见；“five-valent”更直观，常用于解释性写作。"]}
{"word":"five-valved","summary":{"en":"“Five-valved” means having five valves—typically a fruit or seed capsule that splits into five sections.","zh":"“Five-valved”指“五瓣裂/五室裂”，多用于植物学，形容果实或蒴果成熟后裂成五个部分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having five valves (five parts that split open), especially describing a seed capsule or fruit that opens into five sections.","zh":"（植物学）五瓣裂的；五室裂的（尤指蒴果/果实成熟时裂成五个“瓣/裂片”）。"},"examples":[{"en":"The plant produces a five-valved capsule that releases tiny seeds when it dries.","zh":"这种植物会结出五瓣裂的蒴果，干燥后会释放出细小的种子。"},{"en":"In the field guide, the flower’s fruit is described as five-valved.","zh":"在野外植物图鉴里，这种花的果实被描述为五瓣裂的。"}]}],"synonyms":["pentavalved","five-parted (related)","five-lobed (related)"],"phonetic":"/ˌfaɪv ˈvælvd/","extraExplanation":["“valve”在植物学里常指蒴果成熟时裂开的“瓣/裂片”，不是日常生活中管道的“阀门”。因此 five-valved 多用于严谨的植物描述（如分类检索表、图鉴、论文）。","常见近似表达：five-parted（五裂的，较泛）、five-lobed（五裂片的，常指叶或花冠的裂片）。但 five-valved 更强调“果实裂开方式/裂片数”。"]}
{"word":"five-veined","summary":{"en":"“Five-veined” describes something (usually a leaf) that has five main veins.","zh":"“five-veined”通常形容叶子等具有五条主要叶脉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in botany) Having five main veins (lines) running through a leaf or similar plant part.","zh":"（尤用于植物学）具五条主要叶脉的；五脉的。"},"examples":[{"en":"The botanist described the plant as having five-veined leaves.","zh":"植物学家描述这种植物的叶子是五脉的。"},{"en":"Look for the five-veined pattern to help identify the species.","zh":"寻找“五脉”的叶脉形态来帮助辨认物种。"}]}],"synonyms":["five-nerved","quinquervate"],"phonetic":"/ˌfaɪv ˈveɪnd/","extraExplanation":["这是一个带连字符的复合形容词：five（五）+ veined（有……叶脉/纹理的）。在植物描写中常见，用来说明叶片“主脉”的条数；在日常英语里不算常用，多出现在植物学、自然观察或图鉴文字中。"]}
{"word":"five-verb","summary":{"en":"“Five” as a verb means to high-five someone (a friendly celebratory hand slap).","zh":"“five”作动词时表示与人击掌（多用于口语，如 high-five / give someone five）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to slap or touch someone’s hand as a quick friendly greeting or celebration (usually in the phrase “high-five” or “give (someone) five”).","zh":"（通常用于“high-five / give (someone) five”）与某人击掌，以表示友好、庆祝或鼓励。"},"examples":[{"en":"We five’d after the team won the game.","zh":"球队赢了比赛后，我们击掌庆祝。"},{"en":"Give me five! You did it!","zh":"来击个掌！你做到了！"},{"en":"The kids five each other in the hallway.","zh":"孩子们在走廊里互相击掌。"}]}],"synonyms":["high-five","slap hands"],"phonetic":"/faɪv/","extraExplanation":["“five”作动词主要来自口语与体育/校园文化：伸出五根手指的手掌去拍对方的手掌，因此有“击掌”的意思。更常见的说法是“high-five”（击掌）或“give someone five”（和某人击掌）。在正式写作中通常不用“five”单独作动词。"]}
{"word":"Five-Virtues Family","summary":{"en":"a household known for practicing core moral virtues, especially in a Confucian context","zh":"以核心道德（常指儒家五常/五德）为家风的家庭"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A family (or household) described as living by the Confucian “five constant virtues,” often referring to moral values such as benevolence, righteousness, propriety, wisdom, and trustworthiness.","zh":"（尤指儒家语境中）以“五常/五德”等核心道德为家风与生活准则的家庭，常指仁、义、礼、智、信等价值。"},"examples":[{"en":"In some communities, a “Five-Virtues Family” is praised for teaching children kindness, fairness, and honesty at home.","zh":"在一些社区里，“五德之家”因在家中教孩子善良、公正与诚实而受到称赞。"},{"en":"The school award recognized them as a Five-Virtues Family for their service, respect for others, and integrity.","zh":"学校的表彰把他们评为“五德家庭”，肯定他们的服务精神、尊重他人和正直品格。"}]}],"synonyms":["model family","virtuous family","Confucian family","ethical household"],"phonetic":"/ˌfaɪv ˈvɝtʃuːz ˈfæməli/","extraExplanation":["“五德/五常”的英文常见译法包括：benevolence (ren 仁), righteousness (yi 义), propriety/ritual (li 礼), wisdom (zhi 智), trustworthiness/integrity (xin 信)。不同译者会有细微差别。","如果你看到它出现在奖状、社区评选或学校活动里，它可能是一个“称号”，意思接近“模范文明家庭/道德家庭”。"],"etymology":"这是一个现代英语合成/翻译式表达：Five-Virtues（五德/五常）+ Family（家庭）。在中文文化语境中常对应儒家“仁义礼智信”等德目；在英语里多见于翻译、文化介绍或表彰称号，而非日常固定成语。","mnemonic":["把 Five-Virtues 记成“5个做人的好品质”，联想中文“仁义礼智信”= 做人有“底线与分寸”。","Family=家；Five-Virtues Family≈“五德传家”。看到 hyphen（连字符）就想到这是“组合概念/称号”。"]}
{"word":"five-winged","summary":{"en":"“Five-winged” describes something that has five wings or five wing-like sections.","zh":"“five-winged”用来形容某物有五个翅膀，或有五个翼状的部分/分区。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having five wings (or wing-like parts); shaped or structured with five wings.","zh":"有五个翅膀的；（或有五个类似翅膀的部分）呈五翼状/五个翼状结构的。"},"examples":[{"en":"In the story, a five-winged creature rises from the sea.","zh":"在故事里，一种五翼的生物从海里升起。"},{"en":"The architect sketched a five-winged building with a central courtyard.","zh":"建筑师画了一座五翼式建筑草图，中间有一个庭院。"}]}],"synonyms":["with five wings","five-wing (attributive)","five-limbed (depending on context)"],"phonetic":"/ˌfaɪv ˈwɪŋd/","extraExplanation":["“five-winged”是英语里常见的复合形容词（数字 + 名词 + -ed），用来描述“具有……的”。类似结构还有：two-headed（双头的）、three-legged（三条腿的）、one-eyed（独眼的）。通常用连字符连接，放在名词前作定语：a five-winged creature。"]}
{"word":"five-word","summary":{"en":"“Five-word” describes something that contains exactly five words, especially before a noun.","zh":"“five-word”指“由五个单词组成的”，多用于名词前作复合形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made up of five words; containing five words (often used before a noun).","zh":"由五个单词组成的；包含五个单词的（常用于名词前作定语）。"},"examples":[{"en":"Please write a five-word summary of the article.","zh":"请用五个单词写一段对文章的总结。"},{"en":"He answered with a five-word sentence: “I don’t know, ask her.”","zh":"他用一句五个单词的话回答：“I don’t know, ask her.”（我不知道，去问她。）"},{"en":"The headline is a five-word phrase that grabs attention.","zh":"这个标题是一个五个单词的短语，很吸引人。"}]}],"synonyms":["five-word-long","containing five words"],"phonetic":"/ˈfaɪvˌwɝd/","extraExplanation":["“five-word”通常加连字符，是因为它作为复合形容词放在名词前：a five-word summary。若放在名词后面，常不加连字符：The summary is five words long（这段总结长度为五个词）。","类似结构：two-page report（两页的报告）、ten-minute walk（十分钟的路程）。数字作定语时名词一般用单数：five-word phrase（不是 five-words phrase）。"]}
{"word":"five-year","summary":{"en":"Five-year describes something that lasts for, or is connected to, a period of five years.","zh":"five-year 用来描述“为期五年”或“与五年期间有关”的事物，常用于名词前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adjective) Lasting for five years, or relating to a period of five years (often used before a noun).","zh":"（形容词）为期五年的；与五年期间有关的（常作定语，放在名词前）。"},"examples":[{"en":"She signed a five-year contract with the company.","zh":"她与公司签了一份为期五年的合同。"},{"en":"The city launched a five-year plan to improve public transportation.","zh":"这座城市启动了一项五年计划来改善公共交通。"},{"en":"He is in a five-year program at the university.","zh":"他在大学读一个五年制项目。"}]}],"synonyms":["five-year-long","five-yearly","quinquennial"],"phonetic":"/ˌfaɪv ˈjɪr/","extraExplanation":["“five-year”通常作为复合形容词放在名词前，因此常用连字符：a five-year contract / a five-year plan。若放在名词后作表语，一般不加连字符：The contract is five years long. / The plan is for five years。","也常见近似表达：five-year-old（五岁的，修饰人或动物，如 a five-year-old child）。"]}
{"word":"five-year itch","summary":{"en":"restlessness or desire for change after about five years in a long-term situation","zh":"长期状态持续约五年后出现的厌倦与求变冲动"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a feeling of restlessness or dissatisfaction that often appears after about five years in a relationship, marriage, job, or other long-term situation, leading someone to want a change","zh":"在一段关系、婚姻、工作等长期状态持续约五年后常出现的烦躁与不满足感，使人想要改变或“换一种生活”"},"examples":[{"en":"After five years at the same company, he got the five-year itch and started looking for a new role.","zh":"在同一家公司干了五年后，他出现了“五年之痒”，开始找新岗位。"},{"en":"They loved each other, but the five-year itch made them rethink what they wanted from the marriage.","zh":"他们彼此相爱，但“五年之痒”让他们重新思考婚姻中真正想要的是什么。"}]}],"synonyms":["restlessness","wanderlust","mid-career slump","relationship slump","boredom","the seven-year itch"],"phonetic":"/ˌfaɪvˈjɪr ɪtʃ/","extraExplanation":["用法提示：通常加定冠词说 the five-year itch；也可用 get/have/feel the five-year itch（出现/感到五年之痒）。语气多为口语、媒体用语，不是医学或心理学的正式诊断。","相关文化：大众文化中常把“几年后进入倦怠期、想突破现状”当作一种常见人生阶段来讨论，因此该表达在谈论婚姻或职场时都很常见。"],"etymology":"“itch”在英语里常比喻“想做某事的冲动/躁动”（如 an itch to travel）。“five-year itch”把这种冲动和“约五年后出现的倦怠期”联系起来，常用来谈婚姻/感情或职业上的阶段性厌倦与求变。","mnemonic":["把 itch 记成“痒=想挠=想改变”：到了第五年“心里发痒”，就想换工作/换生活方式。","联想中文固定说法“五年之痒”，英语里对应就是 five-year itch。"]}
{"word":"Five-Year Plan","summary":{"en":"A government five-year program that sets national goals and targets.","zh":"政府制定的五年期国家目标与指标规划。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A government plan that sets major economic and social goals for the next five years, often including production targets, investment priorities, and policy directions.","zh":"（政府的）五年规划：为未来五年设定主要经济与社会目标的计划，常包含产量指标、投资重点和政策方向。"},"examples":[{"en":"The new five-year plan emphasizes clean energy and high-tech manufacturing.","zh":"新的五年规划强调清洁能源和高科技制造业。"},{"en":"Officials reviewed progress and adjusted targets midway through the five-year plan.","zh":"官员在五年规划中期回顾进展并调整目标。"}]},{"partOfSpeech":"phrase","definition":{"en":"Specifically, the series of national economic programs used in the Soviet Union and later adopted in other socialist states; often discussed as a historical and political-economic model.","zh":"（特指）苏联的“五年计划”及其在其他社会主义国家的沿用：常作为一种历史与政治经济模式来讨论。"},"examples":[{"en":"In history class, we studied the Soviet Five-Year Plans and their impact on industrialization.","zh":"在历史课上，我们学习了苏联的五年计划及其对工业化的影响。"},{"en":"The novel depicts life under a Five-Year Plan, where quotas shaped daily work.","zh":"这部小说描绘了五年计划下的生活，配额影响着日常工作。"}]}],"synonyms":["national plan","economic plan","development plan","medium-term plan","strategic plan","central plan"],"phonetic":"/ˌfaɪv jɪr ˈplæn/","extraExplanation":["英语里常写作“five-year plan”（普通名词短语）。当特指苏联历史上的项目时，常见大写“Five-Year Plan(s)”表示专有名词用法。","在不同国家语境中，这个词不一定意味着“命令经济”。在一些语境里它也可泛指政府的中期发展纲要或战略规划。"],"etymology":"源自英语短语“five-year”（五年的）+“plan”（计划）。作为政策术语在20世纪因苏联全国性经济规划而广为人知，后被许多国家用于描述中长期发展规划。","mnemonic":["把它直接对应到中文“十四五/十三五”这类说法：本质就是“一个跨五年的国家规划”。","记忆拆分：five-year（五年）+ plan（计划）= 五年计划/五年规划。"]}
{"word":"five-year-old","summary":{"en":"“Five-year-old” means a child aged five, or describes someone who is five years old.","zh":"“five-year-old”指五岁的孩子，也可形容“5岁的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A child who is five years old; also used as an adjective meaning ‘five years old’.","zh":"五岁的孩子；也可作形容词，表示“5岁（的）”。"},"examples":[{"en":"My sister has a five-year-old son.","zh":"我姐姐有一个五岁的儿子。"},{"en":"A five-year-old can learn basic reading and counting.","zh":"五岁的孩子可以学习基础阅读和数数。"},{"en":"The story is written for five-year-olds.","zh":"这个故事是写给五岁孩子看的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing someone (usually a child) who is five years old.","zh":"（多指儿童）五岁的。"},"examples":[{"en":"She has a five-year-old daughter.","zh":"她有一个五岁的女儿。"},{"en":"The five-year-old student was excited about school.","zh":"这位五岁的学生对上学很兴奋。"}]}],"synonyms":["five years old"],"phonetic":"/ˌfaɪv jɪr ˈoʊld/","extraExplanation":["英语里表示年龄时，常用“数字 + year(s) + old”作形容词，并用连字符连接：a five-year-old boy（一个五岁男孩）。这种结构放在名词前要加连字符；放在系动词后通常不加：The boy is five years old（男孩五岁）。","名词用法通常写成复数：five-year-olds（五岁的孩子们）。例如：Programs for five-year-olds（面向五岁儿童的项目）。"]}
{"word":"five-yearly","summary":{"en":"“Five-yearly” means happening once every five years.","zh":"“five-yearly”表示“每五年一次的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening once every five years.","zh":"每五年发生一次的；五年一次的。"},"examples":[{"en":"The committee holds a five-yearly election for chair.","zh":"委员会每五年举行一次主席选举。"},{"en":"They publish a five-yearly report on public health trends.","zh":"他们每五年发布一次公共健康趋势报告。"}]},{"partOfSpeech":"adv.","definition":{"en":"Occurring at five-year intervals; done every five years (used to describe how something is done).","zh":"以五年为间隔地；每五年一次地（用于描述做事的频率）。"},"examples":[{"en":"The data is reviewed five-yearly to track long-term changes.","zh":"这些数据每五年复盘一次，用来追踪长期变化。"}]}],"synonyms":["every five years","quinquennial"],"phonetic":"/ˌfaɪvˈjɪrli/","extraExplanation":["“five-yearly”是由“five-year（五年的）+ -ly（表示频率）”构成，常用于较正式的书面语（报告、统计、制度安排）。","更常见、更口语的表达是“every five years（每五年一次）”。在学术或正式写作中也可用同义词“quinquennial”。","拼写上通常带连字符：five-yearly。尤其在名词前作定语时（a five-yearly report）更常见。"]}
{"word":"five-yoked","summary":{"en":"Five-yoked describes something (often a chariot) pulled by five yokes—typically five pairs of animals.","zh":"five-yoked 指（常为战车等）由五副轭牵引，即通常由五对牲畜拉动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(poetic, rare) Drawn or pulled by five yokes—usually meaning five pairs of animals (often horses) harnessed together.","zh":"（诗歌/罕用）由“五副轭”牵引的；通常指五对（常为马）被套在一起拉车或拉战车。"},"examples":[{"en":"In the poem, the sun rides a five-yoked chariot across the sky.","zh":"在诗中，太阳乘着一辆“五轭”战车横越天空。"},{"en":"The hero’s five-yoked team suggests overwhelming speed and power.","zh":"英雄的“五轭”车队暗示了惊人的速度与力量。"}]}],"synonyms":["ten-horse (poetic)","many-harnessed (loose)","five-paired (rare)"],"phonetic":"/ˈfaɪv joʊkt/","extraExplanation":["“yoke”是“轭”，指把一对牲畜（如两匹马、两头牛）套在一起拉车/犁地的木制或金属器具。因此“five-yoked”常被理解为“五副轭”=五对动物（约十匹马）同拉一车。","这种用法多见于古典或仿古的文学语境（尤其描写战车、神话意象或夸张的力量），属于较少见的复合形容词。阅读时可把它当作一种“宏大、史诗式”的修饰语。"]}
{"word":"fivebar","summary":{"en":"“fivebar” usually means “five-bar”: either a five-bar (measure) musical phrase, or a five-bar linkage mechanism in engineering.","zh":"“fivebar”通常指“five-bar”：可表示音乐中的“五小节乐句/段落”，也可指工程中的“五杆机构”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(music/poetry) Made up of five bars (measures) or lines; lasting for five bars.","zh":"（音乐/诗歌）由五小节（或五行）组成的；持续五小节的。"},"examples":[{"en":"The melody has a five-bar phrase that feels slightly unexpected.","zh":"这段旋律有一个五小节的乐句，听起来有点出乎意料。"},{"en":"They wrote a five-bar intro before the singer comes in.","zh":"他们写了一个五小节的前奏，然后歌手才进入。"}]},{"partOfSpeech":"n.","definition":{"en":"(engineering) A mechanism with five rigid bars (links) connected by joints, used to guide motion.","zh":"（工程）五杆机构：由五根刚性连杆通过关节连接组成，用来引导或传递运动的机械结构。"},"examples":[{"en":"The robot arm uses a five-bar linkage to keep the tool moving smoothly.","zh":"这个机械臂使用五杆机构来让工具平稳运动。"},{"en":"We modeled the five-bar mechanism in CAD before building it.","zh":"我们先在CAD里建立了五杆机构模型，再进行制作。"}]}],"synonyms":["five-bar"],"phonetic":"/ˈfaɪv bɑr/","extraExplanation":["在英文里更常见的拼写是 five-bar（带连字符），尤其在表示“由五小节组成的/五杆的”这种复合形容词时。写成 fivebar 多见于非正式用法、用户名、产品名或工程笔记里的简写。","bar 在音乐里指“小节（measure）”，不是“酒吧”。所以 five-bar phrase = 五小节乐句。"]}
{"word":"fivefoil","summary":{"en":"Fivefoil usually means (1) a cinquefoil plant with five-part leaves, or (2) a five-leaf/petal decorative motif.","zh":"Fivefoil 通常指（1）委陵菜属的“cinquefoil/五叶草”类植物，或（2）五叶/五瓣的装饰纹样。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant of the genus *Potentilla* (cinquefoil), often with five-part leaves and small yellow, white, or pink flowers.","zh":"委陵菜属（*Potentilla*）植物（即“cinquefoil/五叶草”一类），常见特征是五小叶的叶片与小型黄/白/粉色花。"},"examples":[{"en":"Cinquefoil (fivefoil) grows along the trail in early summer.","zh":"初夏时，小路旁会长出委陵菜（fivefoil）。"},{"en":"The field guide describes fivefoil as having five leaflets like a small hand.","zh":"野外植物手册把 fivefoil 形容为“像一只小手”的五片小叶。"}]},{"partOfSpeech":"n.","definition":{"en":"a five-leaf or five-petal decorative design (often used in art, architecture, or heraldry).","zh":"五叶（或五瓣）装饰图案（常见于艺术、建筑或纹章设计）。"},"examples":[{"en":"The gate is topped with a fivefoil pattern carved in stone.","zh":"大门顶部雕着石刻的五叶纹样。"},{"en":"In the old manuscript, a fivefoil motif frames the title.","zh":"那本古手稿中，标题周围用五叶纹样作边饰。"}]}],"synonyms":["cinquefoil","Potentilla","five-petaled motif","five-leaf motif"],"phonetic":"/ˈfaɪvˌfɔɪl/","extraExplanation":["“fivefoil”字面意思是“five（五）+ foil（叶片/花瓣状图形）”。在植物学里，它常与更常见的同义词“cinquefoil”（来自法语 *cinq*，意为“五”）互换使用。","在欧洲中世纪与哥特式建筑装饰中，fivefoil/五叶纹样常与“trefoil（三叶纹）”“quatrefoil（四叶纹）”并列出现，用于窗饰、石雕、手稿装饰与纹章图案等。"]}
{"word":"fivefold","summary":{"en":"Fivefold means “five times as much” (adj.) or “by five times” (adv.).","zh":"fivefold 表示“五倍的/五重的”（形容词）或“增加/提高五倍地”（副词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Five times as much; multiplied by five.","zh":"五倍的；五重的。"},"examples":[{"en":"The new battery offers a fivefold increase in capacity.","zh":"新电池的容量提升了五倍。"},{"en":"During the holiday season, traffic can be fivefold higher than usual.","zh":"假日期间的车流量可能比平时高出五倍。"}]},{"partOfSpeech":"adv.","definition":{"en":"By five times; to a degree that is five times greater.","zh":"五倍地；成五倍地。"},"examples":[{"en":"Profits grew fivefold over the last decade.","zh":"过去十年里利润增长了五倍。"},{"en":"The risk increases fivefold if you don’t wear a seat belt.","zh":"如果不系安全带，风险会增加五倍。"}]}],"synonyms":["five times","quintuple","five-times"],"phonetic":"/ˈfaɪvˌfoʊld/","extraExplanation":["“fivefold”由“five（五）+ -fold（倍数/重数）”构成，-fold常见于表达倍数：twofold（两倍的/两重的）、threefold（三倍的/三重的）、manifold（多种的/多重的）。","在正式写作或新闻报道中很常见，通常可与“five times”互换：a fivefold increase ≈ an increase of five times。日常口语里更常说“five times”。"]}
{"word":"fivefoldness","summary":{"en":"Fivefoldness means the state of being fivefold—either having five parts/aspects or being five times as much.","zh":"fivefoldness 指“五重性/五倍性”：要么具有五个部分或层面，要么表示达到原来的五倍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being fivefold; having five parts, aspects, or layers.","zh":"五重性；五部分/五方面的特性（具有五个部分、层面或方面的状态）。"},"examples":[{"en":"The author explains the fivefoldness of the journey as five stages of growth.","zh":"作者把这段旅程的五重性解释为成长的五个阶段。"},{"en":"In the diagram, the fivefoldness of the structure is shown by five repeating sections.","zh":"在图示中，这个结构的五重性通过五个重复的部分表现出来。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being five times as much; a fivefold (quintuple) increase.","zh":"五倍性；增加到原来的五倍（五倍增长的特性）。"},"examples":[{"en":"They described the fivefoldness of the price jump compared with last year.","zh":"他们描述了与去年相比价格上涨到五倍的情况。"},{"en":"The report notes a fivefoldness in demand during the holiday season.","zh":"报告指出节日期间需求出现了五倍增长。"}]}],"synonyms":["quintuplicity","fivefold nature","five-part structure","quintuple increase"],"phonetic":"/ˈfaɪvˌfoʊldnəs/","extraExplanation":["“fivefoldness”由“fivefold（五重的/五倍的）+ -ness（名词后缀，表示‘……的状态/性质’）”构成，属于比较书面、少见的抽象名词。","日常英语里更常用的表达是“fivefold nature”（五重特性）、“fivefold increase”（五倍增长）或直接用“quintuple”作形容词/动词（如“a quintuple increase / demand quintupled”）。"]}
{"word":"fiveling","summary":{"en":"“Fiveling” is not standard English; it’s likely a typo (often for “fledgling”) or a playful coinage meaning “a five-year-old.”","zh":"“fiveling”不是标准英语；更可能是拼写错误（常见为“fledgling”）或俏皮造词，指“5岁的孩子”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a misspelling or a made-up term. If intended as an English word, it may be used informally to mean “a five-year-old child” (rare/nonstandard).","zh":"不是常见词典里的标准英语单词；更可能是拼写错误或人为造词。若勉强按英语用法理解，可能被少数人非正式地用来指“5岁的小孩”（很少见/不规范）。"},"examples":[{"en":"I couldn’t find “fiveling” in a standard dictionary—did you mean “fledgling”?","zh":"我在常见词典里找不到“fiveling”——你是不是想写“fledgling”（初出茅庐的人/新手）？"},{"en":"In some playful writing, a “fiveling” could mean a five-year-old.","zh":"在一些俏皮的写法里，“fiveling”可能指一个五岁的孩子。"}]}],"synonyms":["five-year-old","kindergartener","child (informal)"],"phonetic":"/ˈfaɪv.lɪŋ/","extraExplanation":["“fiveling”在标准英语里不常见，因此更可能是：\n1）把 fledgling（新手、初出茅庐的人/幼鸟）拼错了；\n2）把 “five-ling”（以 five 为核心临时造的词）当作昵称或幻想作品设定。\n如果你告诉我你看到它的句子/出处（书名、游戏、对话），我可以更准确判断意思。"]}
{"word":"fivepence","summary":{"en":"“fivepence” means a UK coin or amount worth 5 pence (5p), and can also refer to five old pence in historical contexts.","zh":"“fivepence”指英国价值5便士（5p）的硬币或金额；在历史语境中也可指旧币制的五旧便士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A British coin or amount of money worth five pence (5p) in the UK.","zh":"英国的“五便士”（5p）硬币，或等值的金额。"},"examples":[{"en":"I’ve only got fivepence—it's not enough for the bus.","zh":"我只有五便士——不够坐公交。"},{"en":"She found a fivepence coin in her pocket.","zh":"她在口袋里发现了一枚五便士硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, pre-decimal) An amount equal to five old pence in the former British currency system (before 1971).","zh":"（历史用法，英镑十进制化前）旧币制中的“五旧便士”（1971年之前）。"},"examples":[{"en":"In older stories, you may see prices like “fivepence” written as “5d.”","zh":"在较老的故事里，你可能会看到“fivepence”写作“5d.”（旧便士的记法）。"}]}],"synonyms":["five pence","5p","fivepence coin"],"phonetic":"/ˈfaɪvˌpɛns/","extraExplanation":["“fivepence”主要是英式用法。现代英国更常写作“five pence”或“a five-pence coin / a 5p coin”。","英国在1971年实行货币十进制化（decimalisation）。旧币制里“pence”常写作“d”（源自拉丁语denarius），所以“五便士”会写成“5d”。"]}
{"word":"fivepenny","summary":{"en":"Fivepenny means “worth five pence” and can also mean “cheap/low-value,” or refer to a British five-pence coin (“fivepenny bit”).","zh":"fivepenny 表示“值五便士的”，也可引申为“廉价/不值钱的”，还可指英国“五便士硬币”（常说 fivepenny bit）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Worth five pence (in British money); priced at five pence.","zh":"值五便士的；售价为五便士的（英式货币）。"},"examples":[{"en":"He bought a fivepenny loaf from the corner shop.","zh":"他在街角小店买了一条五便士的面包。"},{"en":"A fivepenny stamp used to be enough for a short letter.","zh":"过去一枚五便士的邮票就够寄一封短信了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often informal or slightly old-fashioned) Cheap, small, or of low value.","zh":"（常为非正式或略显旧式）便宜的；不起眼的；价值不高的。"},"examples":[{"en":"Don’t sell yourself for fivepenny praise.","zh":"别为了几句不值钱的夸奖就降低自己的价值。"},{"en":"They argued over some fivepenny detail that didn’t matter.","zh":"他们为一些无关紧要的小细节争来争去。"}]},{"partOfSpeech":"n.","definition":{"en":"A five-pence coin (especially in the phrase “fivepenny bit”).","zh":"五便士硬币（尤用于短语“fivepenny bit”）。"},"examples":[{"en":"He pulled a fivepenny bit from his pocket.","zh":"他从口袋里掏出一枚五便士硬币。"}]}],"synonyms":["five-pence","fivepence","5p","cheap (informal sense)","low-value"],"phonetic":"/ˈfaɪvˌpɛni/","extraExplanation":["“fivepenny”主要见于英式英语，常作定语（放在名词前）。现代英国更常写作“five-penny”或直接说“five pence / 5p”。","“fivepenny bit”指五便士硬币的俗称；在英国货币史中，旧式硬币与“十进制化”(1971年)之前的计价体系有关，因此这个词带一点时代感或文学/历史语境色彩。"]}
{"word":"fivepins","summary":{"en":"Fivepins is a Canadian style of bowling using five pins and a smaller ball.","zh":"Fivepins 指加拿大的一种保龄球玩法，使用五个球瓶和较小的球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Canadian form of bowling played with five smaller pins and a smaller ball (usually without finger holes).","zh":"一种加拿大常见的保龄球玩法：使用五个较小的球瓶和较小的球（通常没有指孔）。"},"examples":[{"en":"My family played fivepins every Friday night at the local bowling alley.","zh":"我家每周五晚上都会在附近的保龄球馆打五瓶保龄球（fivepins）。"},{"en":"Fivepins is especially popular in Canada, though ten-pin bowling is more common worldwide.","zh":"五瓶保龄球在加拿大特别流行，但在全球范围内十瓶保龄球更常见。"}]}],"synonyms":["five-pin bowling","five-pin"],"phonetic":"/ˈfaɪvˌpɪnz/","extraExplanation":["“fivepins”更常写作“five-pin(s)”或“five-pin bowling”。它是加拿大本土发展出的保龄球形式：球更小、球瓶只有五个，计分方式也和常见的ten-pin（十瓶）不同。","如果你看到“I play fivepins”，通常意思是“我打五瓶保龄球”，属于带有地域文化色彩的表达（偏加拿大）。"]}
{"word":"fiver","summary":{"en":"“Fiver” is an informal word for a five-unit banknote, usually $5 in the US or £5 in the UK.","zh":"“fiver”是口语中指“面值为五”的纸币，通常在美国指5美元，在英国指5英镑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A five-unit banknote or bill, especially a five-dollar bill (US) or a five-pound note (UK).","zh":"（非正式）面值为“五”的纸币，尤其指（美国）5美元纸币或（英国）5英镑纸币。"},"examples":[{"en":"Do you have a fiver? I need change for the parking meter.","zh":"你有一张五块的吗？我需要换零钱投停车计时器。"},{"en":"He handed the cashier a fiver and took the coffee to go.","zh":"他递给收银员一张五块的，然后把咖啡打包带走。"},{"en":"In the UK, you might hear people say “a fiver” for a £5 note.","zh":"在英国，你可能会听到人们用“a fiver”指一张5英镑纸币。"}]}],"synonyms":["five-dollar bill","five-pound note","five (informal)"],"phonetic":"/ˈfaɪvɚ/","extraExplanation":["“fiver”属于口语/俚语表达，常用于日常小额支付场景。对应的类似说法还有“tenner”（十块/十镑）以及“twenty”（二十）。","英美都能理解“fiver”，但具体指的是哪种货币要看语境：在美国多指$5，在英国多指£5。"]}
{"word":"fivers","summary":{"en":"“Fivers” is the plural of “fiver,” an informal word for five-unit banknotes (usually $5 in the U.S. or £5 in the U.K.).","zh":"“Fivers” 是 “fiver” 的复数，口语里指面值为“五”的纸币（美国多指5美元，英国多指5英镑）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) five-dollar or five-pound notes; bills/notes worth five units of currency.","zh":"（复数，俚语）面值为“五”的纸币；五美元或五英镑等的钞票。"},"examples":[{"en":"I’ve only got a couple of fivers—can we split the bill?","zh":"我只有两张五块的钞票——我们可以分开付吗？"},{"en":"He handed the cashier two fivers and some coins.","zh":"他递给收银员两张五块的钞票和一些硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, British English) the number five in a set, list, or sports team lineup (less common).","zh":"（非正式，英式英语，较少见）一组/名单/球队阵容中的“五号”。"},"examples":[{"en":"Put the fivers on the right side of the line.","zh":"把五号的那些放到队列右边。"}]}],"synonyms":["five-dollar bills","five-pound notes","fives (informal)"],"phonetic":"/ˈfaɪvɚz/","extraExplanation":["“fiver”最常见是钱的俚语：在英式英语里多指“五英镑纸币（a fiver = a £5 note）”，在美式英语里更常指“五美元纸币”。","和它相似的还有：tenner（十镑）、twenty（20元/镑的钞票，口语里常直接说）。注意这些都偏口语，正式场合可以说 “a five-dollar bill / a five-pound note”。"]}
{"word":"fives","summary":{"en":"“Fives” can mean multiple 5s, a British handball-like sport, or (informally) high fives.","zh":"“Fives”可指多个数字5、英国一种类似手球的传统运动，或（口语）多人击掌庆祝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The number 5 in plural form; several groups or sets of five.","zh":"数字“五”的复数形式；若干个“五”或五个一组的东西。"},"examples":[{"en":"She rolled three fives in a row.","zh":"她连续掷出了三个“五”（点数为5）。"},{"en":"The kids lined up in fives for the drill.","zh":"孩子们在演练时五个一组排队。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional British ball game played by striking a hard ball with a gloved hand (similar to handball), often played at schools or universities.","zh":"（英式）“fives”球类运动：用戴手套的手击打硬球的传统运动（类似手球），常见于英国学校或大学。"},"examples":[{"en":"He plays fives at his old school’s courts.","zh":"他在母校的球场上打 fives。"},{"en":"They watched a fives match after lunch.","zh":"午饭后他们观看了一场 fives 比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: high fives—slapping hands with someone to celebrate or agree.","zh":"（非正式）击掌庆祝（high fives 的复数）：与人击掌表示庆祝或认同。"},"examples":[{"en":"After the win, the team exchanged fives.","zh":"赢了之后，队员们互相击掌庆祝。"},{"en":"Give me fives if you’re ready!","zh":"准备好了就和我击掌！"}]}],"synonyms":["multiple fives","high fives","handball (similar)"],"phonetic":"/faɪvz/","extraExplanation":["“fives”（运动）主要在英国更常见，常见两种：Eton Fives（伊顿式）和 Rugby Fives（拉格比式），球场墙面结构略不同。","口语里说“give me fives”通常指“give me high fives（来个击掌）”，更完整的说法是“high five”（单数）或“high fives”（复数）。"]}
{"word":"fivescore","summary":{"en":"“Five score” is an old-fashioned way to say 100 (5 × 20).","zh":"“five score” 是一种较古老的说法，表示 100（5×20）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(archaic) One hundred; literally “five score,” because a score is twenty.","zh":"（古义）一百；字面意思是“五个二十”，因为 score 表示“二十”。"},"examples":[{"en":"The phrase “five score” means 100.","zh":"“five score” 这个短语意思是 100。"},{"en":"In old-fashioned writing, you might see “five score men” to mean one hundred men.","zh":"在较古老的写法里，你可能会看到 “five score men”，意思是“一百个人”。"}]}],"synonyms":["one hundred","a hundred"],"phonetic":"/faɪv skɔr/","extraExplanation":["“Score = 二十”来自早期英语里用“划痕/刻痕”做计数记号：每数到二十就刻一条记号，因此 score 引申为“二十”。","最著名的相关用法是林肯《葛底斯堡演说》开头的 “Four score and seven years ago…”（八十七年前）。所以在文学/演讲风格中，使用 “score” 会显得庄重、古典。"]}
{"word":"fivesome","summary":{"en":"“Fivesome” most commonly refers to a sexual encounter involving five people; a nonsexual “group of five” meaning exists but is rare and can sound awkward or suggestive.","zh":"“fivesome”最常见指五人参与的性行为；也可表示“五人一组”，但用法少且可能带有暧昧/成人联想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sexual activity involving five people.","zh":"（口语）五人参与的性行为（群交的一种）。"},"examples":[{"en":"In adult slang, a “fivesome” means a sexual encounter involving five people.","zh":"在成人俚语中，“fivesome”指五个人参与的性行为。"},{"en":"The word is usually used in explicit contexts, so avoid it in formal conversation.","zh":"这个词通常出现在露骨语境中，因此在正式场合应避免使用。"}]},{"partOfSpeech":"n.","definition":{"en":"Any group of five people considered as a unit (rare; most people say “group of five”).","zh":"五人一组／由五个人组成的团体（较少用；更常说“a group of five”）。"},"examples":[{"en":"A group of five volunteers arrived early.","zh":"一组五名志愿者很早就到了。"},{"en":"If you mean simply “five people,” it’s clearer to say “a group of five” rather than “a fivesome.”","zh":"如果只是想表达“五个人”，说“a group of five”通常比“a fivesome”更清楚。"}]}],"synonyms":["group of five","five-person group","party of five"],"phonetic":"/ˈfaɪv.səm/","extraExplanation":["“fivesome”由“five + -some”构成，类似于“twosome / threesome / foursome”。但在现代英语里，带“-some”的这类词（尤其是“threesome”）很容易被理解为性含义；因此“fivesome”最常见也最默认的联想就是成人语境。","如果你在运动或社交场景中想表达“五人一队/一组”，更自然的说法包括：“a group of five,” “five people,” “a five-person team,” “a party of five”。"]}
{"word":"fivestones","summary":{"en":"“fivestones” usually refers to the traditional hand game “five stones,” similar to jacks; it can also mean literally five stones.","zh":"“fivestones”通常指传统手部游戏“五石子/五粒石”（类似 jacks）；也可作字面义“5块石头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional hand game played with five small objects (often stones, beanbags, or plastic pieces), where you toss one piece into the air and pick up others in set patterns; similar to the game “jacks.”","zh":"一种传统的手部游戏，用五个小物件（常见为小石子、豆袋或塑料小块）进行：把一颗抛起的同时按规则捡起其他颗；类似英文游戏 jacks（掷小球捡子儿）。"},"examples":[{"en":"We played five stones at recess using tiny beanbags instead of rocks.","zh":"我们课间玩五石子，用的是小豆袋而不是石头。"},{"en":"She’s really good at five stones—her hands move so fast.","zh":"她玩五石子很厉害，手速特别快。"},{"en":"My aunt taught me five stones when I was a kid.","zh":"我小时候阿姨教我玩五石子。"}]},{"partOfSpeech":"phrase","definition":{"en":"literally, five separate stones (used when talking about quantity or objects).","zh":"字面义：五块石头（用于表达数量或指具体物品）。"},"examples":[{"en":"He picked up five stones and dropped them into the pond.","zh":"他捡起五块石头丢进池塘里。"},{"en":"I only need five stones to mark the corners.","zh":"我只需要五块石头来标记角落。"}]}],"synonyms":["five stones","five-stones","jacks (similar game)"],"phonetic":"/faɪv stoʊnz/","extraExplanation":["“Five Stones / Five-stones / fivestones”常见于新加坡、马来西亚、香港等地的英语语境，也有人写作“five stones game”。玩法通常分关卡：先捡单颗、再捡两颗、三颗等，同时要把“主石”抛起并在落下前完成动作。","在英语里更广为人知的近似游戏是“jacks”（通常用小球+金属小钉形玩具），所以向不熟悉该文化的人解释时，可以说“a game like jacks.”","拼写上你输入的“fivestones”更像社群、店名、账号名或游戏名的合写；在正式写法中更常见的是“five stones”。"]}
{"word":"fivish","summary":{"en":"“Fivish” means “around five,” especially when talking about time (around 5 o’clock). It’s informal.","zh":"“fivish（也常写作 five-ish）”意思是“大约五、五点左右”，语气非正式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Approximately five; around the number 5 (often used for time, age, or quantity).","zh":"大约五；接近数字5（常用于时间、年龄或数量）。"},"examples":[{"en":"Let’s meet at fiveish—maybe 5:10 or 5:15.","zh":"我们五点左右见吧——可能五点十分或五点一刻。"},{"en":"He’s fiveish, so he’s old enough to start kindergarten soon.","zh":"他差不多五岁了，所以很快就够年龄上幼儿园/学前班了。"}]},{"partOfSpeech":"adv.","definition":{"en":"At around five o’clock (informal, especially in conversation and texting).","zh":"在五点左右（非正式用法，常见于口语和短信）。"},"examples":[{"en":"I’ll get off work fiveish and head over.","zh":"我差不多五点下班，然后过去。"},{"en":"Dinner’s fiveish if everyone’s free.","zh":"如果大家都有空，晚餐大概五点左右。"}]}],"synonyms":["around five","about five","approximately five","five or so"],"phonetic":"/ˈfaɪvɪʃ/","extraExplanation":["“fiveish”常写作“five-ish”。后缀“-ish”表示“差不多、稍微、有点儿”，比如：greenish（有点绿）、childish（有点孩子气）、thirtyish（三十岁左右）。","语气上比较随意、友好，适合熟人之间的聊天；在正式写作或工作邮件里更建议用“around five / about five / approximately five”。"]}

