{"word":"fiz","summary":{"en":"“Fiz” is an informal spelling of “fizz,” meaning a bubbling/hissing sound or the action of making that sound.","zh":"“fiz”通常是“fizz”的非正式拼写，表示起泡的嘶嘶声，或发出这种声音的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal spelling) a soft hissing/bubbling sound made by gas escaping from a drink or liquid.","zh":"（非正式拼写）指饮料或液体中气体逸出时发出的“嘶嘶/咕嘟咕嘟”的起泡声。"},"examples":[{"en":"When I opened the soda, it made a quick fiz.","zh":"我打开汽水时，发出了一声短促的“嘶——”。"},{"en":"You can hear the fiz in sparkling water.","zh":"你能在气泡水里听到那种起泡声。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal spelling) to make a bubbling or hissing sound, especially like a carbonated drink.","zh":"（非正式拼写）发出起泡或嘶嘶声，尤指像碳酸饮料那样。"},"examples":[{"en":"The soda started to fiz as soon as it warmed up.","zh":"汽水一变暖就开始冒泡并发出嘶嘶声。"},{"en":"The tablet will fiz in water and dissolve.","zh":"这片剂放进水里会起泡并溶解。"}]}],"synonyms":["fizz","sizzle","hiss"],"phonetic":"/fɪz/","extraExplanation":["“fiz”多见于随意写法、拟声写法；标准拼写通常是“fizz”。在小说或对白里，作者有时用“fiz”来让声音更简短、更口语。"]}
{"word":"fizelyite","summary":{"en":"Fizelyite is a rare sulfosalt mineral name used mainly in geology/mineralogy.","zh":"Fizelyite 是一种罕见硫盐矿物的名称，主要用于地质与矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a sulfosalt) found in some ore deposits, studied mainly in mineralogy rather than used in everyday life","zh":"一种罕见矿物（硫盐类矿物），出现在某些矿床中，主要用于矿物学研究与收藏，日常生活中几乎不用"},"examples":[{"en":"The specimen label says the dark metallic crystals are fizelyite.","zh":"标本标签上写着这些深色金属光泽的晶体是 fizelyite（费泽利石）。"},{"en":"Fizelyite is usually mentioned in academic papers or mineral catalogs, not in everyday conversation.","zh":"fizelyite 通常出现在学术论文或矿物目录里，而不是日常对话中。"}]}],"phonetic":"/ˈfɪzəlaɪt/","extraExplanation":["这是一个矿物学术语，属于“硫盐矿物（sulfosalt）”这一类：通常含硫，并与铅、锑、银等金属元素相关（具体化学组成会因资料来源与测定结果而有更细的写法）。","很多这类矿物名称来自发现地、矿山或研究者姓名；因此在普通英语词典里往往查不到，但在矿物数据库与地质文献中更常见。"]}
{"word":"fizgig","summary":{"en":"Fizgig can mean an old-fashioned term for a silly, flirtatious person, a small noisy spinning toy, or (in pop culture) a creature from The Dark Crystal.","zh":"Fizgig 可以指（旧式）轻浮爱闹、爱调情的人，也可指会发声/旋转的小玩具；在流行文化中还指《黑水晶》里的小生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) A silly, giddy person—often someone who flirts a lot and doesn’t seem serious.","zh":"（旧式用法）轻浮、爱闹、很不正经的人；常指爱调情、举止轻佻的人。"},"examples":[{"en":"In the old novel, the aunt calls the young man a fizgig for flirting with everyone at the party.","zh":"在那本老小说里，阿姨骂那个年轻人是个“fizgig”，因为他在派对上见谁都调情。"},{"en":"Stop acting like a fizgig and pay attention in class.","zh":"别再这么轻浮胡闹了，上课认真点。"}]},{"partOfSpeech":"n.","definition":{"en":"A small toy or novelty that spins, buzzes, or makes a light popping sound; a playful trinket.","zh":"会旋转、嗡嗡响或“噗”地发声的小玩具/新奇小物件；小玩意儿。"},"examples":[{"en":"The street vendor sold fizgigs—little spinning toys that made a buzzing noise.","zh":"街头小贩卖一种“fizgig”——会嗡嗡响的旋转小玩具。"}]},{"partOfSpeech":"n.","definition":{"en":"(pop culture) A small furry creature called a Fizgig in the film The Dark Crystal.","zh":"（流行文化）电影《黑水晶》里一种叫 Fizgig 的小毛绒生物。"},"examples":[{"en":"My favorite character in The Dark Crystal is the Fizgig—it’s tiny but fierce.","zh":"我最喜欢《黑水晶》里的 Fizgig——个子小但很凶。"}]}],"synonyms":["flirt","scatterbrain","silly person","trinket","novelty toy"],"phonetic":"/ˈfɪzˌɡɪɡ/","extraExplanation":["“fizgig”在现代英语里比较少见，作为“轻浮的人”这一义项带一点旧时代的语感，常见于老作品或戏谑式表达。","词里包含“gig”（可联想到“giddy/闹腾”的感觉），整体听起来就有“叽叽喳喳、闹哄哄”的趣味色彩。","如果你在网络上看到它，很多时候是指《黑水晶》（The Dark Crystal）里的那只小生物；在这种语境下它更像专有名词。"]}
{"word":"fizgigs","summary":{"en":"“Fizgigs” is the plural of “fizgig,” meaning a fishing spear/harpoon; it can also be an old-fashioned insult for a flighty person, and it’s used for the creature “Fizgig” in *Labyrinth*.","zh":"“Fizgigs”是“fizgig”的复数：可指刺鱼用的鱼叉；也可作旧式贬称指轻佻的人；在《魔幻迷宫》（*Labyrinth*）粉丝语境中还可指名为Fizgig的毛茸茸小生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a barbed spear or harpoon used for fishing (especially for striking fish).","zh":"（尤指刺鱼用的）倒钩鱼叉；鱼矛。"},"examples":[{"en":"The fisherman threw a fizgig at the large fish near the surface.","zh":"渔夫把鱼叉掷向水面附近的一条大鱼。"},{"en":"In old texts, a “fizgig” is sometimes listed with other fishing tools.","zh":"在一些旧文本中，“fizgig”有时会和其他渔具一起被列出。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) a lively, flirtatious, or foolish young woman; a flighty person.","zh":"（旧式用法）轻浮、爱卖弄的年轻女子；轻佻的人。"},"examples":[{"en":"In the play, the character is dismissed as a fizgig by the older women.","zh":"在剧中，那名角色被年长的女性斥为“轻浮的人”。"},{"en":"This sense is archaic and can sound insulting today.","zh":"这个意思比较古旧，如今听起来可能带有贬义。"}]},{"partOfSpeech":"n.","definition":{"en":"(pop culture) a small, shaggy creature named Fizgig from Jim Henson’s film *Labyrinth*; “Fizgigs” can refer to these creatures as a group.","zh":"（流行文化）吉姆·汉森电影《魔幻迷宫》（*Labyrinth*）中的毛茸茸小生物“Fizgig”；“Fizgigs”可指一群这种生物。"},"examples":[{"en":"The toy line includes several different Fizgigs.","zh":"这套玩具系列里有好几种不同的Fizgigs。"},{"en":"Fans often remember the Fizgig for its big bark and fluffy look.","zh":"影迷常常记得Fizgig那夸张的叫声和蓬松的外形。"}]}],"synonyms":["harpoon","fish spear","gaff","(archaic) flirt"],"phonetic":"/ˈfɪzˌɡɪɡ/","extraExplanation":["“fizgig”是比较少见的词：在现代英语里更可能在历史/渔业语境或文学作品里见到。","流行文化用法来自1986年电影《Labyrinth》（中文常译《魔幻迷宫》）。如果你是在讨论电影或周边，“Fizgigs”多半就是指那种毛茸茸的小生物。"]}
{"word":"fizz","summary":{"en":"“Fizz” means to bubble and make a soft hissing sound (verb), or the bubbles/sound in a drink (noun). It can also mean lively excitement.","zh":"“Fizz”指（动词）起泡并发出嘶嘶声；（名词）气泡/嘶嘶声；也可指热闹的兴奋感（偏英式用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To make small bubbles and a soft hissing sound, especially in a drink or when a liquid touches something hot.","zh":"（尤指饮料）起小气泡并发出轻微的“嘶嘶”声；（液体遇热）发出嘶嘶声并冒泡。"},"examples":[{"en":"The soda fizzed when I opened the can.","zh":"我打开易拉罐时，汽水嘶嘶作响、冒着气泡。"},{"en":"Pour the vinegar in—listen, it’s fizzing!","zh":"把醋倒进去——听，它在嘶嘶起泡！"}]},{"partOfSpeech":"n.","definition":{"en":"A mass of small bubbles and the soft hissing sound they make, especially in carbonated drinks.","zh":"（尤指碳酸饮料中的）气泡；嘶嘶声。"},"examples":[{"en":"This sparkling water has a nice fizz.","zh":"这款气泡水的气很足，口感不错。"},{"en":"There was a fizz as the champagne was poured.","zh":"倒香槟时发出一阵嘶嘶声。"}]},{"partOfSpeech":"n.","definition":{"en":"Excitement, energy, or lively activity (often used in British English).","zh":"兴奋感；活力；热闹劲（多见于英式英语）。"},"examples":[{"en":"The room had a fizz of anticipation before the show.","zh":"演出开始前，房间里有种期待的兴奋劲。"},{"en":"Her ideas brought fizz to the discussion.","zh":"她的想法让讨论更有活力。"}]}],"synonyms":["bubble","sizzle","sparkle (figurative)","effervescence"],"phonetic":"/fɪz/","extraExplanation":["“fizz”常和碳酸饮料文化联系在一起：如soda（汽水）、sparkling water（气泡水）、champagne（香槟）等。形容“气很足”可说：It’s really fizzy.（气泡很多/很有汽）","常见搭配：fizz up（让饮料起泡/变得更有活力，较口语）、lose its fizz（饮料没气了；比喻失去热情/动力）。","相关词：fizzy（adj. 有气泡的），fizzing（adj./v-ing 正在冒泡的）。注意“fizz”与“buzz”（嗡嗡声/兴奋的传闻）不同。"]}
{"word":"fizzed","summary":{"en":"“Fizzed” means “made bubbles and a hissing sound,” and can also mean “made a hissing/buzzing sound” or “felt/was full of excitement.”","zh":"“Fizzed”是“fizz”的过去式/过去分词，常指（饮料）起泡并嘶嘶作响；也可指发出嘶嘶/嗡嗡声，或形容人/气氛兴奋有活力。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of a drink) to make small bubbles and a hissing sound; to effervesce.","zh":"（饮料）起泡、发出嘶嘶声；冒气泡（呈气泡状）。"},"examples":[{"en":"When I opened the soda, it fizzed loudly.","zh":"我打开汽水时，它嘶嘶作响，冒出很多气泡。"},{"en":"The sparkling water fizzed in the glass.","zh":"气泡水在杯子里不断冒泡。"}]},{"partOfSpeech":"v.","definition":{"en":"To make a soft hissing/buzzing sound, often from electricity, spray, or something frying.","zh":"（常指电流、喷雾或油炸等）发出嘶嘶声/嗡嗡声。"},"examples":[{"en":"The pan fizzed as the vegetables hit the hot oil.","zh":"蔬菜一下热油，锅里立刻嘶嘶作响。"},{"en":"The broken wire fizzed for a moment, then went quiet.","zh":"断掉的电线嗡嗡响了一会儿，然后安静了。"}]},{"partOfSpeech":"v.","definition":{"en":"To feel excited, energetic, or full of lively ideas (often used with “with”).","zh":"（常与 with 连用）兴奋、有活力；充满热情或点子。"},"examples":[{"en":"She fizzed with excitement before the trip.","zh":"出发前她兴奋得不得了。"},{"en":"The room fizzed with nervous energy on opening night.","zh":"首演之夜，整个房间充满紧张又兴奋的气氛。"}]}],"synonyms":["bubbled","effervesced","hissed","sizzled","buzzed","sparkled"],"phonetic":"/fɪzd/","extraExplanation":["“fizzed”是动词“fizz”的过去式/过去分词。最常见的场景是碳酸饮料开盖时的声音与气泡（fizz）。","口语里也常说“fizz out”（逐渐没劲/没气/不了了之），例如：The excitement fizzed out after a few days.（热度过了几天就消退了。）"]}
{"word":"fizzer","summary":{"en":"“Fizzer” is an informal noun meaning a complete failure or a disappointing result.","zh":"“fizzer”是个非正式名词，表示“彻底失败/令人失望的结果”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A complete failure; something (an event, plan, or performance) that does not succeed or impress.","zh":"（非正式）彻底失败；（活动、计划或表演）未能成功或令人满意的事。"},"examples":[{"en":"Their new product launch was a fizzer—almost nobody showed up.","zh":"他们的新产品发布会成了个大失败——几乎没人到场。"},{"en":"The party turned into a fizzer when the music system broke.","zh":"音响坏了，派对结果变得很失败。"},{"en":"His big speech was a bit of a fizzer; the audience stayed quiet.","zh":"他的重头演讲有点失败；观众反应很冷淡。"}]}],"synonyms":["failure","flop","dud","washout"],"phonetic":"/ˈfɪzər/","extraExplanation":["“fizzer”在澳大利亚和英国的口语里更常见，常用来评价一次“本来很有期待但结果很糟/很尴尬”的尝试。","它和“fizzle out（逐渐无力、不了了之）”有语感关联：像汽水的气泡（fizz）一下子没了，象征事情没劲了、没效果。"]}
{"word":"fizzers","summary":{"en":"“Fizzers” is the plural of “fizzer,” meaning fizzy sweets/tablets or small hissing fireworks, depending on context.","zh":"“fizzers”是“fizzer”的复数，常指会起泡的糖果/泡腾片，也可指会嘶嘶作响的小烟火，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Something (often a candy/sweet or tablet) that makes a fizzy, bubbling sound in your mouth or in liquid.","zh":"（非正式）会在嘴里或液体中产生“嘶嘶起泡”效果的东西（常见为汽泡糖/酸粉糖，或泡腾片）。"},"examples":[{"en":"In the UK, kids sometimes buy fizzer sweets that tingle on your tongue.","zh":"在英国，孩子们有时会买那种在舌头上“刺刺麻麻”起泡的汽泡糖。"},{"en":"Drop a fizzer into water and it starts bubbling right away.","zh":"把一片泡腾片丢进水里，它马上就开始冒泡。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A small firework that burns with a hissing, fizzing effect.","zh":"（非正式）一种会发出“嘶嘶”声、带火花的烟火/小鞭炮。"},"examples":[{"en":"They lit a couple of fizzers in the driveway on New Year’s Eve.","zh":"除夕夜他们在车道上点了几个会“嘶嘶”响的烟火。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) People or things that fizz; plural of “fizzer.”","zh":"（较少见）会发出嘶嘶气泡声的人或东西；“fizzer”的复数。"},"examples":[{"en":"The soda cans were little fizzers when we opened them.","zh":"我们打开汽水罐时，它们就像一个个小“冒泡器”。"}]}],"synonyms":["fizzy sweets","effervescent tablet","sparkler","firework"],"phonetic":"/ˈfɪzər/","extraExplanation":["“fizzer(s)”在英式英语里比较常见，常用来指会在嘴里起泡、带酸甜刺激感的糖果（类似“fizzy sweets”），也可能泛指泡腾片饮料或会嘶嘶作响的小烟火。具体含义通常要看上下文（在超市/糖果店更可能是糖；在节日/烟火场景更可能是烟火）。"]}
{"word":"fizzes","summary":{"en":"“Fizzes” means “makes a soft bubbling/hissing sound” (verb) or “the bubbling/hissing sounds” (plural noun).","zh":"“fizzes”可指“（液体）嘶嘶冒泡”（动词），也可指“嘶嘶的起泡声”（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To make small bubbles of gas, usually with a soft hissing sound (like soda).","zh":"（液体）冒小气泡并发出嘶嘶声（常见于汽水）。"},"examples":[{"en":"The soda fizzes when you open the can.","zh":"你打开罐子时，汽水会冒泡发出嘶嘶声。"},{"en":"The water fizzed as the tablet dissolved.","zh":"药片溶解时，水里冒起气泡。"}]},{"partOfSpeech":"n.","definition":{"en":"Bubbly, hissing sounds made by something that is fizzing.","zh":"嘶嘶的冒泡声；起泡声。"},"examples":[{"en":"I heard the fizzes of a freshly opened drink.","zh":"我听到刚打开饮料时的嘶嘶起泡声。"}]}],"synonyms":["bubbles","sizzles","hisses"],"phonetic":"/ˈfɪzɪz/","extraExplanation":["“fizzes”既可以是动词 fizz 的第三人称单数（He/She/It fizzes），也可以是名词 fizz 的复数（the fizzes）。","常见搭配：fizz up（更有活力/更兴奋，也可指饮料起泡更强）、fizz out（逐渐失去气泡或热情）。","注意区分：fizz（嘶嘶起泡） vs. bubble（更中性地“冒泡”） vs. sparkle（更偏“闪亮、带气泡的感觉”，常用于饮料）。"]}
{"word":"fizzier","summary":{"en":"“Fizzier” means more fizzy (more bubbles/carbonation), and informally it can mean more lively or exciting.","zh":"“fizzier”表示“更起泡/更有碳酸感”，口语中也可比喻“更活泼、更带劲”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More fizzy; having more bubbles or carbonation than something else.","zh":"更起泡的；比另一种东西含更多气泡/更多碳酸的。"},"examples":[{"en":"This soda is fizzier than the one we bought last week.","zh":"这款汽水比我们上周买的那款更起泡。"},{"en":"If you want it fizzier, chill it well and don’t shake the bottle.","zh":"如果你想更起泡，把它冰镇好，而且别摇瓶子。"}]},{"partOfSpeech":"adj.","definition":{"en":"More lively or exciting in a playful way (informal).","zh":"（非正式）更活泼的；更有趣、更带劲的。"},"examples":[{"en":"The second half of the movie is fizzier and more fun.","zh":"电影的后半段更带劲，也更好玩。"},{"en":"Her writing style feels fizzier after she adds more dialogue.","zh":"她加了更多对话后，写作风格显得更活泼。"}]}],"synonyms":["more carbonated","more bubbly","more sparkling","livelier","more upbeat"],"phonetic":"/ˈfɪziɚ/","extraExplanation":["“fizzier”是形容词“fizzy”（起泡的/有气泡的）的比较级，常用于比较饮料的碳酸感：fizzy → fizzier → fizziest。","在口语里用来形容气氛、风格“更有活力/更轻快”，属于比喻用法。"]}
{"word":"fizziest","summary":{"en":"“Fizziest” means the most bubbly/carbonated, and informally the most lively or excited.","zh":"“fizziest”表示“最有气泡/碳酸感最强的”，口语中也可指“最活泼、最兴奋的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most fizzy; having the most bubbles or strong carbonation.","zh":"最起泡的；最有气泡的；碳酸感最强的。"},"examples":[{"en":"This is the fizziest soda I’ve ever tried.","zh":"这是我喝过最起泡的汽水。"},{"en":"Sparkling water is usually fizzy, but this brand is the fizziest.","zh":"气泡水通常有气泡，但这个牌子最起泡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Most lively, excited, or full of energy.","zh":"（非正式）最活泼的；最兴奋的；精力最充沛的。"},"examples":[{"en":"She was the fizziest person at the party, talking to everyone.","zh":"派对上她最活泼，和每个人都聊得来。"},{"en":"After the good news, he became his fizziest self.","zh":"听到好消息后，他变得格外兴奋。"}]}],"synonyms":["most bubbly","most carbonated","most effervescent","most lively (informal)","most energetic (informal)"],"phonetic":"/ˈfɪziəst/","extraExplanation":["“Fizziest”是形容词“fizzy”（起泡的/有气泡的）的最高级：fizzy → fizzier → fizziest。常见于饮料（soda, sparkling water, champagne）等语境。","“fizzy”也可用来形容人的性格或气氛“很嗨、很有劲儿”，属于口语化表达。正式写作中可用“energetic / lively / exuberant”等替换。"]}
{"word":"fizzily","summary":{"en":"“Fizzily” means “in a fizzy, bubbly way,” and sometimes (more literary) “in a lively, excited way.”","zh":"“fizzily”表示“起泡地、冒泡地”，也可（较文学化）表示“活泼兴奋地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a fizzy way; with lots of small bubbles, often making a soft hissing sound (like soda).","zh":"起泡地；带很多小气泡地（常伴随“嘶嘶”声，如汽水）。"},"examples":[{"en":"The soda poured out fizzily and overflowed the glass.","zh":"汽水起泡地倒出来，溢出了杯子。"},{"en":"The lemonade bubbled fizzily after she opened the bottle.","zh":"她打开瓶子后，柠檬汽水起泡咕嘟咕嘟地冒着泡。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a lively, excited, or energetic way (less common; often used in writing to suggest a bright mood).","zh":"活泼兴奋地；充满活力地（较少见，常用于描写一种明快的气氛）。"},"examples":[{"en":"She laughed fizzily, as if the good news had bubbles in it.","zh":"她兴奋地笑了起来，仿佛好消息里也带着气泡。"}]}],"synonyms":["bubblily","effervescently","sparklingly","lively"],"phonetic":"/ˈfɪzəli/","extraExplanation":["“fizzily”来自形容词“fizzy”（起泡的、像汽水那样有气的）+ 副词后缀“-ly”。日常口语里更常用“fizzy”来形容饮料（a fizzy drink），而“fizzily”多见于描写性写作。","它既可以字面描写“冒泡的声音/状态”，也可以借喻人的情绪“像气泡一样轻快、兴奋”。这种把物理感觉用来写情绪的用法在英语写作中很常见。"]}
{"word":"fizziness","summary":{"en":"“Fizziness” means the bubbly quality of a carbonated drink, or (less commonly) a lively, cheerful energy.","zh":"“fizziness”指饮料的起泡感/气泡感；较少见时也指人或氛围的活泼、轻快的劲头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having many small bubbles (like in soda); a bubbly, slightly sharp feeling on the tongue.","zh":"（饮料等的）起泡感；嘶嘶的气泡特性（常指汽水那种在舌头上微刺的感觉）。"},"examples":[{"en":"I love the fizziness of sparkling water.","zh":"我喜欢气泡水的起泡感。"},{"en":"The soda lost its fizziness after the bottle was left open.","zh":"瓶子打开后放了一会儿，汽水就没气儿了。"},{"en":"This drink has a gentle fizziness, not too strong.","zh":"这款饮料的气泡感很柔和，不会太冲。"}]},{"partOfSpeech":"n.","definition":{"en":"A lively, excited, cheerful energy (often describing someone’s personality or mood).","zh":"（人或气氛的）活泼、兴奋、轻快的劲儿（常形容性格或情绪）。"},"examples":[{"en":"Her fizziness made the whole room feel more cheerful.","zh":"她那种活泼劲儿让整个房间都更欢快了。"},{"en":"He answered with his usual fizziness, even on a rainy day.","zh":"即使在雨天，他回答时也一如既往地充满活力。"}]}],"synonyms":["bubbliness","effervescence","sparkle (figurative)","liveliness (figurative)"],"phonetic":"/ˈfɪziˌnɛs/","extraExplanation":["“fizziness”来自形容词“fizzy”（有气泡的）+ 名词后缀“-ness”（表示性质/状态）。日常里最常用来形容碳酸饮料的口感；形容人的“活泼劲儿”时更偏口语、带一点俏皮感。","相关词：“fizzy”（adj. 有气泡的）、“fizz”（n./v. 嘶嘶作响；起泡）、“carbonation”（n. 碳酸化；更偏技术/食品标签用语）。"]}
{"word":"fizzing","summary":{"en":"“Fizzing” describes something bubbling and making a soft hissing sound, like soda or an active tablet in water.","zh":"“Fizzing”形容东西在冒泡并发出轻微嘶嘶声，常见于汽水或泡腾片入水时。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making a small, continuous hissing sound and forming bubbles (like soda, sparkling water, or a chemical reaction)","zh":"（像汽水、苏打水或化学反应一样）发出嘶嘶声并冒泡的"},"examples":[{"en":"The soda was still fizzing when I opened the can.","zh":"我打开罐子时，汽水还在冒泡起嘶嘶声。"},{"en":"The tablets started fizzing in the water.","zh":"片剂放进水里开始起泡。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “fizz”) producing bubbles or a soft hissing sound; bubbling","zh":"（动词 fizz 的现在分词）起泡、冒气泡并发出轻微嘶嘶声"},"examples":[{"en":"The drink is fizzing—be careful when you pour it.","zh":"饮料正在冒泡，倒的时候小心点。"},{"en":"Steam was fizzing where the water hit the hot pan.","zh":"水碰到热锅时冒出嘶嘶的蒸汽声。"}]}],"synonyms":["bubbling","effervescent","foaming","hissing"],"phonetic":"/ˈfɪzɪŋ/","extraExplanation":["“fizz”常用来描述含气饮料（carbonated drinks）开封时的声音和气泡；也可比喻“兴奋、活力”，例如：The room was fizzing with excitement（房间里充满兴奋的气氛）。注意“fizzing”既可以作形容词（fizzing water 起泡的水），也可以作动词的一部分（is fizzing 正在起泡）。"]}
{"word":"fizzle","summary":{"en":"“Fizzle” means to fade and end weakly (often disappointing), or to make a soft hissing sound.","zh":"“fizzle”常指事情逐渐没劲并以平淡/失望告终，也可指发出轻微的嘶嘶声。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to become weaker or less successful and then end, often in a disappointing way","zh":"（事情）逐渐变弱、变得不成功，最后（令人失望地）结束"},"examples":[{"en":"The negotiation started with excitement but fizzled after a few days.","zh":"谈判一开始很令人兴奋，但几天后就不了了之了。"},{"en":"His interest in learning guitar quickly fizzled out.","zh":"他学吉他的兴趣很快就消退了。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a quiet hissing sound, like a small firework, soda, or something cooking in oil","zh":"发出轻微的“嘶嘶”声（像小烟花、汽水或油里煎东西）"},"examples":[{"en":"The firework fizzled instead of exploding loudly.","zh":"烟花只嘶嘶作响，没有大声炸开。"},{"en":"Bacon sizzled and fizzled in the pan.","zh":"培根在锅里滋滋作响、嘶嘶作声。"}]},{"partOfSpeech":"n.","definition":{"en":"a quiet hissing sound or a weak ending instead of a strong finish","zh":"嘶嘶声；（没有气势的）草草收场、虎头蛇尾"},"examples":[{"en":"The show ended with a fizzle, not a bang.","zh":"演出以平淡收场，而不是高潮。"},{"en":"We heard a small fizzle from the wire and turned off the power.","zh":"我们听到电线发出轻微的嘶嘶声，就把电源关了。"}]}],"synonyms":["fade","die out","peter out","sputter","falter"],"phonetic":"/ˈfɪzəl/","extraExplanation":["“fizzle out”是最常见搭配，常用来形容计划、关系、热情或流行趋势“慢慢没了”。语气通常带一点失望或无力感。","常见对比表达是“end with a bang”（轰轰烈烈地结束）。固定搭配“end with a fizzle”表示“虎头蛇尾/不了了之”。"]}
{"word":"fizzle out","summary":{"en":"to gradually lose energy or intensity until it stops","zh":"逐渐失去热度或力量，最终停止/不了了之"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to gradually become weaker, less active, or less successful until it stops","zh":"（逐渐）减弱、失去动力或热度，最终停止/不了了之"},"examples":[{"en":"The protest started strong but quickly fizzled out after a few days.","zh":"抗议一开始声势很大，但几天后很快就逐渐平息了。"},{"en":"Our conversation fizzled out when we ran out of things to say.","zh":"我们没话可说后，聊天就慢慢冷场了。"},{"en":"The project fizzled out because no one had time to lead it.","zh":"因为没人有时间带头，这个项目最终不了了之。"}]},{"partOfSpeech":"phrase","definition":{"en":"(of a flame or fireworks) to stop burning with a weak, sputtering sound","zh":"（火焰/烟花）嘶嘶作响地变弱并熄灭"},"examples":[{"en":"The candle fizzled out in the wind.","zh":"蜡烛在风里嘶嘶地熄灭了。"},{"en":"The fireworks fizzled out before reaching the sky.","zh":"烟花还没升到空中就没劲儿地熄了。"}]}],"synonyms":["fade away","die out","peter out","taper off","dwindle","lose steam","fall flat"],"phonetic":"ˈfɪzəl aʊt","extraExplanation":["常用于描述计划、关系、流行趋势、讨论、冲突等“没有明确结局、但慢慢消散”的状态，语气比“fail”更像“渐渐冷掉/不了了之”。","近义对比：die out 更偏“逐渐消失（常指物种、习俗、声音等）”；peter out 常指“变小变弱（路、声音、资源）”；fizzle out 常带“本来有点期待但后来没劲”的感觉。"],"etymology":"“fizzle”原本是拟声词，模仿液体或火焰“嘶嘶作响”的声音；后来引申为事情“没劲了、没结果”，加上“out”强调“到最后完全停止”。","mnemonic":["联想“fizz=汽水的嘶嘶气泡声”：气泡越来越少→最后没气了=逐渐没劲、结束。","把它想成“放了个小烟花：先嘶嘶响（fizz），然后out（灭掉）”。"]}
{"word":"fizzled","summary":{"en":"“Fizzled” means something ended weakly or failed after seeming promising; literally, it can mean making a fizzing sound and stopping.","zh":"“Fizzled”常指事情虎头蛇尾、逐渐失败或不了了之；字面义也可指发出嘶嘶的气泡/火花声后停止。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of fizzle) to fail or end weakly, often after starting with promise or excitement.","zh":"（fizzle 的过去式/过去分词）指（事情）虎头蛇尾地失败或不了了之，常指一开始看起来很有希望或很热闹。"},"examples":[{"en":"The party fizzled when most people left early.","zh":"大多数人提前离开后，派对就变得冷清，最后不了了之。"},{"en":"Their big plan fizzled out because they ran out of money.","zh":"他们的宏大计划因为资金用尽而不了了之。"},{"en":"The negotiation fizzled after a strong start.","zh":"谈判开头势头很强，但后来逐渐失败了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Literal) to make a soft hissing/bubbling sound and then stop, like a drink losing its bubbles.","zh":"（字面义）发出轻微的嘶嘶/冒泡声然后停下来，比如汽水没气了。"},"examples":[{"en":"The soda fizzled when I opened the bottle too slowly.","zh":"我把瓶盖拧得太慢，汽水的气泡就“嘶嘶”地跑掉了。"},{"en":"The sparkler fizzled and went out.","zh":"仙女棒嘶嘶地响了一会儿就灭了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, adjective use) unsuccessful; no longer exciting or effective.","zh":"（非正式作形容词用）失败的；不再令人兴奋或不再奏效的。"},"examples":[{"en":"It was a fizzled attempt at a joke.","zh":"那是个失败的玩笑尝试。"},{"en":"He felt embarrassed after his fizzled presentation.","zh":"他的演讲搞砸后感到很尴尬。"}]}],"synonyms":["failed","fell flat","petered out","died down","fizzled out"],"phonetic":"/ˈfɪzəld/","extraExplanation":["“fizzle”原本是拟声词，模仿气泡或小火花的“嘶嘶”声；引申为“热闹劲儿慢慢没了、最终失败”。常见搭配是 fizzle out（逐渐消失/失败）。"]}
{"word":"fizzles","summary":{"en":"“Fizzles” commonly means “ends weakly or fails after starting well,” and it can also refer to bubbling/hissing sounds (like soda).","zh":"“fizzles”常指“开始不错但后来逐渐无力、不了了之”，也可指（像汽水一样）起泡的嘶嘶声。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to end weakly or fail after a promising start; to lose energy or stop happening","zh":"（起初看似不错但）逐渐无力、不了了之；失败收场"},"examples":[{"en":"The conversation fizzled after a few minutes of awkward silence.","zh":"那段对话在几分钟尴尬的沉默后就不了了之了。"},{"en":"Our weekend plans fizzled because everyone got busy.","zh":"我们的周末计划因为大家都忙而泡汤了。"},{"en":"The campaign started strong but fizzled near the end.","zh":"这场活动开局很强，但临近结束时却乏力收场。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a soft hissing sound like bubbles in a drink; to bubble and hiss","zh":"（像汽水气泡一样）发出嘶嘶声；起泡并嘶嘶作响"},"examples":[{"en":"The soda fizzles when you open the bottle.","zh":"你打开瓶子时汽水会嘶嘶作响。"},{"en":"Butter fizzled in the hot pan.","zh":"黄油在热锅里滋滋作响。"}]},{"partOfSpeech":"n.","definition":{"en":"a soft hissing/bubbling sound or the bubbles themselves (often in drinks)","zh":"嘶嘶的起泡声；（饮料中的）气泡/气泡感"},"examples":[{"en":"You could hear the fizzles from the freshly poured soda.","zh":"你能听到刚倒出来的汽水在冒泡的嘶嘶声。"},{"en":"The drink had no fizzles left and tasted flat.","zh":"这饮料已经没气泡了，喝起来很寡淡。"}]}],"synonyms":["peter out","die out","taper off","fade","fall flat","sputter"],"phonetic":"/ˈfɪzəlz/","extraExplanation":["“fizzles”可以是动词第三人称单数（He/She/It fizzles）或名词复数（many fizzles）。最常见的学习重点是动词用法：计划、关系、谈话、项目等“不了了之/泡汤”。","常见搭配：fizzle out（逐渐停止/逐渐失败），例如：The excitement fizzled out.（兴奋感慢慢消退了。）","语气上，“fizzle”比“fail”更强调“慢慢没劲、无声无息地结束”，不像“crash”那样突然或戏剧化。"]}
{"word":"fizzling","summary":{"en":"Fizzling means gradually failing or fading out, losing energy instead of ending strongly.","zh":"fizzling 指逐渐失败或慢慢消退，越来没劲，最后不了了之。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of fizzle) to gradually fail, lose energy, or end weakly instead of succeeding strongly.","zh":"（fizzle 的现在分词）逐渐失败、慢慢没劲，最后无声无息地结束。"},"examples":[{"en":"The party was lively at first, but it started fizzling after midnight.","zh":"派对一开始很热闹，但过了午夜就开始慢慢冷场了。"},{"en":"Their plan is fizzling because they ran out of money.","zh":"他们的计划正在泡汤，因为钱不够了。"}]},{"partOfSpeech":"adj.","definition":{"en":"becoming weaker, less exciting, or less effective; fading out.","zh":"逐渐变弱的；渐渐没效果的；慢慢散掉的。"},"examples":[{"en":"He made a fizzling attempt to apologize and then changed the subject.","zh":"他没什么诚意地试着道歉了一下，接着就转移话题了。"},{"en":"The team’s fizzling confidence showed in the second half.","zh":"球队在下半场表现出信心逐渐崩掉的样子。"}]}],"synonyms":["fading","dying out","petering out","tapering off","losing steam","falling flat"],"phonetic":"/ˈfɪzəlɪŋ/","extraExplanation":["“fizzle”原指气泡发出“嘶嘶”声（像汽水没气时的声音）。因此“fizzle out”常用来形容事情不是突然失败，而是像气泡一样慢慢消失、不了了之。常见搭配：a project/idea/romance fizzles (out)。"]}
{"word":"fizzwater","summary":{"en":"Fizzwater means carbonated water (water with bubbles).","zh":"Fizzwater 指“气泡水/苏打水”，也就是带气泡的水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Carbonated water; water with bubbles (like soda water or sparkling water).","zh":"苏打水/气泡水；带气泡的水。"},"examples":[{"en":"I ordered fizzwater instead of soda because I wanted something without sugar.","zh":"我点了气泡水而不是汽水，因为我想喝不含糖的。"},{"en":"Add a little fizzwater to the juice to make it fizzy.","zh":"在果汁里加一点气泡水，让它有气泡感。"}]}],"synonyms":["sparkling water","soda water","carbonated water","seltzer"],"phonetic":"/ˈfɪzˌwɔtɚ/","extraExplanation":["“fizzwater”更常见的写法是分开写成“fizz water”，属于比较口语、随意的说法；在菜单或超市里更常见的是“sparkling water”（气泡水）或“soda water”（苏打水）。","在英美文化中，“sparkling water”通常指瓶装的气泡矿泉水或气泡水；“soda water”常指用于调酒的苏打水（可能更“硬”一点、偏功能性）。"]}
{"word":"fizzy","summary":{"en":"“Fizzy” means “full of bubbles,” especially about carbonated drinks, and it can also mean “lively and energetic.”","zh":"“fizzy”主要指（饮料）有气泡的；也可形容人或氛围活泼、有活力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of bubbles; producing a lot of small bubbles (often about drinks).","zh":"（通常指饮料）起泡的；有很多小气泡的。"},"examples":[{"en":"I like fizzy water with lemon.","zh":"我喜欢加柠檬的气泡水。"},{"en":"This soda is too fizzy for me.","zh":"这汽水对我来说太起泡了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lively, excited, and energetic (often about a person’s personality).","zh":"（多形容人）活泼的；兴奋有活力的。"},"examples":[{"en":"She has a fizzy personality and talks to everyone.","zh":"她性格很活泼，跟谁都能聊起来。"},{"en":"The party felt bright and fizzy after the music started.","zh":"音乐一响起，派对气氛就变得轻快又热烈。"}]}],"synonyms":["bubbly","sparkling","carbonated","effervescent","lively"],"phonetic":"/ˈfɪzi/","extraExplanation":["“fizzy”来自“fizz”（嘶嘶作响、起泡声），常用来形容碳酸饮料（soda, sparkling water）。用于形容人时带有轻松、明快的褒义色彩，但在少数语境里也可能暗示“过于轻浮/不够稳重”。","常见搭配：fizzy drink（碳酸饮料）、fizzy water（气泡水/苏打水）、fizzy feeling（轻快兴奋的感觉）。"]}
{"word":"fizzy drinks","summary":{"en":"carbonated soft drinks","zh":"碳酸软饮料"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Carbonated beverages that release small bubbles (fizz), such as soda.","zh":"起泡的碳酸饮料（会冒小气泡“嘶嘶”作响），如汽水。"},"examples":[{"en":"I’m trying to cut down on fizzy drinks and drink more water.","zh":"我在尽量少喝碳酸饮料，多喝水。"},{"en":"Fizzy drinks can make you burp because of the carbonation.","zh":"碳酸饮料因为有气，会让人打嗝。"},{"en":"Do you have any fizzy drinks, like cola or lemon soda?","zh":"你们有碳酸饮料吗，比如可乐或柠檬汽水？"}]}],"synonyms":["soda","soft drinks","carbonated drinks","sparkling drinks","pop"],"phonetic":"/ˈfɪzi drɪŋks/","extraExplanation":["在英式英语中，“fizzy drinks”很常用；在美式英语里更常说“soda”或“soft drinks”。在餐馆点饮料时，说“a fizzy drink”通常表示“来一杯汽水/苏打饮料”。"],"etymology":"“fizzy”来自拟声词“fizz”，模仿气泡发出的“嘶嘶”声；“drink(s)”意为饮料。合在一起指“会起泡的饮料”，常见于英式英语表达。","mnemonic":["记“fizz”像气泡“嘶嘶”声：fizzy＝有气泡的。","联想中文“汽（气）水”：有“气”就会“fizz”，所以是碳酸饮料。"]}

