{"word":"fjarding","summary":{"en":"A rare Swedish-derived historical term meaning “a quarter,” used for older measures or administrative divisions.","zh":"一个源自瑞典语、在英语中很少见的历史词，意为“四分之一”，可指旧时计量单位或行政分区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Borrowed from Swedish, historical) a “quarter”; especially a traditional Swedish unit or division meaning one-fourth, used in measures or local administration.","zh":"（源自瑞典语，历史用法）“四分之一”；尤指瑞典传统中表示四分之一的单位或行政分区名称，可用于计量或地方划分。"},"examples":[{"en":"In older Swedish records, a fjarding could refer to a quarter of a larger unit.","zh":"在较早的瑞典文献记录中，fjarding 可以指某个更大单位的四分之一。"},{"en":"The village was listed under a fjarding in the local register.","zh":"该村庄在地方登记册中被归在一个 fjarding 之下。"}]}],"synonyms":["quarter","one-fourth"],"phonetic":"/ˈfjɑrdɪŋ/","extraExplanation":["这个词在现代英语里非常少见，更多出现在历史、家谱研究、北欧地区史料或翻译文本中。","拼写上也常见为 **fjärding**（带变音符 ä），英文文本里有时会把变音符省略写成 **fjarding**。","发音上，词首 **fj-** 在英语借词里通常类似 **fjord** 的开头音。若你是在某篇文章/表格里看到它，可以把上下文（句子或来源）发我，我可以更精准判断它是“计量单位”还是“行政分区”的意思。"]}
{"word":"fjarr","summary":{"en":"“Fjarr” isn’t a common English word; it’s usually a foreign-style spelling meaning “far/distant,” or a misspelling of “far.”","zh":"“fjarr”不是常见英语词；多为外来风格拼写（意为“远/遥远”）或把“far”误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a foreign spelling (e.g., Icelandic/Old Norse–style) meaning “far” or “distant.” In English writing it usually appears only in names, fantasy/worldbuilding, or as a misspelling of “far.”","zh":"不是标准英语单词；更常见为外来拼写（如冰岛语/古诺尔斯语风格），意思接近“遥远的、远方的”。在英文里通常只出现在人名/地名、奇幻设定中，或是把“far”误拼为“fjarr”。"},"examples":[{"en":"In the novel, “Fjarr” is the name of a northern kingdom beyond the sea.","zh":"在小说里，“Fjarr”是海那边一个北方王国的名字。"},{"en":"If you meant the English word, the usual spelling is “far,” not “fjarr.”","zh":"如果你想写英语单词，通常拼作“far”，不是“fjarr”。"}]}],"synonyms":["far","distant","remote"],"phonetic":"/fjɑr/","extraExplanation":["“fj-”这种拼写在英语里很少见，但在一些北欧语言中常见（对应类似 /fj/ 的发音）。因此在英文语境里看到“fjarr”，大概率是外来词、专有名词，或是把“far”写错。","如果你告诉我它出现的句子或来源（游戏/小说/字幕等），我可以更准确地判断它是不是某个专有名词、还是某种语言里的词。"]}
{"word":"fjeld","summary":{"en":"A Scandinavian word meaning a high, treeless mountain upland or plateau (especially in Norway).","zh":"源自斯堪的纳维亚语，指（尤指挪威）树木稀少的高山高原/荒凉高地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Norway) a high, rocky mountain plateau or barren upland; a mountain.","zh":"（尤指挪威）高而多岩石的山地高原/荒凉高地；山。"},"examples":[{"en":"We hiked across the fjeld above the village, where there were no trees.","zh":"我们徒步穿越村庄上方的山地高原，那里没有树。"},{"en":"In winter, the fjeld can be windy and dangerous.","zh":"冬天时，山地高原上风很大，很危险。"}]}],"synonyms":["mountain","upland","plateau","fell"],"phonetic":"/fjɛld/","extraExplanation":["“fjeld”是从斯堪的纳维亚语言（常见于挪威语）借入英语的词，指树木稀少、地势高而开阔的山地/高原地形。英语里它相对少见，更多出现在旅行写作、地理或文学描写中。","相关词：Norwegian “fjell”（同源词，常见拼写）；在苏格兰/英格兰北部更常用的近义词是“fell”（山、荒原山地）。"]}
{"word":"fjelds","summary":{"en":"“Fjelds” means rocky, treeless mountain uplands or plateaus, especially in Scandinavia.","zh":"“fjelds”指（尤指北欧的）多石、少树的山地高地或高原。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of fjeld: barren, rocky upland or mountain plateau (especially in Scandinavia).","zh":"fjeld 的复数：荒凉多石的高地或山地高原（尤指斯堪的纳维亚地区）。"},"examples":[{"en":"The hikers crossed the fjelds above the tree line.","zh":"徒步者穿越了林线以上的荒凉高地（fjelds）。"},{"en":"In winter, the fjelds can be windy and treeless.","zh":"冬天的 fjelds 往往多风而且几乎没有树。"}]}],"synonyms":["mountain uplands","highlands","plateau","fell","moorland"],"phonetic":"/fjɛldz/","extraExplanation":["“fjeld”是从挪威语/丹麦语借入英语的词，常见于描写北欧地理与旅行写作中，指高海拔、风大、植被稀少的岩石高地或山地高原。","英语里也常见拼写变体“fjell”（更接近挪威语拼写）；含义相近。"]}
{"word":"fjerding","summary":{"en":"Fjerding is an archaic word meaning a quarter, and it can also refer to an old Scandinavian unit equal to one fourth of a larger measure.","zh":"Fjerding 是一个古语，意为“四分之一”；也可指旧时斯堪的纳维亚的度量单位，通常等于更大单位的四分之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a fourth part; a quarter.","zh":"（古语）四分之一；一刻（四分之一部分）。"},"examples":[{"en":"In some old texts, a fjerding means one quarter of something.","zh":"在一些古老文本里，fjerding 指某物的四分之一。"},{"en":"They divided the land into fjerdings, each equal to a quarter.","zh":"他们把土地分成若干个 fjerding，每个相当于四分之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) an old Scandinavian measure, often referring to a quarter of a larger unit (especially for land or distance).","zh":"（历史用语）旧时斯堪的纳维亚地区的度量单位，常指某个更大单位的四分之一（尤其用于土地或距离）。"},"examples":[{"en":"The record lists farms by fjerding, not by modern kilometers.","zh":"这份记录用 fjerding 来标注农场位置，而不是用现代的公里。"},{"en":"Different regions used slightly different fjerding measurements.","zh":"不同地区的 fjerding 量值可能略有差异。"}]}],"synonyms":["quarter","fourth","one-fourth"],"phonetic":"/ˈfjɛrdɪŋ/","extraExplanation":["这个词源自古北欧语（Old Norse）中表示“四分之一/四分”的词根（与“fourth/quarter”的概念相关）。在英语里它非常罕见，多见于历史、地理或古文献语境。","由于各地历史度量体系不同，fjerding 作为“单位”时的具体长度/面积可能不完全一致；阅读史料时通常需要看同一文献中的换算或注释。"]}
{"word":"fjord","summary":{"en":"A fjord is a narrow sea inlet with steep sides, carved by glaciers.","zh":"fjord 指由冰川侵蚀形成、两侧陡峭的狭长海湾（峡湾）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, narrow inlet of the sea between steep cliffs or mountains, formed by glaciers","zh":"峡湾：由冰川侵蚀形成的、两侧多为陡峭山崖或群山的狭长海湾"},"examples":[{"en":"Norway is famous for its fjords.","zh":"挪威以峡湾闻名。"},{"en":"We took a boat tour through the fjord to see the waterfalls.","zh":"我们乘船游览峡湾去看瀑布。"}]}],"synonyms":["inlet","bay"],"phonetic":"/fjɔrd/","extraExplanation":["“fjord”一词来自挪威语（也与古诺尔斯语有关），因此常与斯堪的纳维亚地理文化联系在一起；英语中也常用来指类似地貌（如新西兰、智利、加拿大等地的峡湾）。","发音提示：英语里常见 /fjɔrd/，开头的“fj-”像把“f”和“y”快速连在一起（类似“fy-”的感觉）。"]}
{"word":"fjorded","summary":{"en":"“Fjorded” usually describes a coastline or landscape that has many fjords (long, narrow sea inlets). It can also be the past form of the rare verb “to fjord.”","zh":"“fjorded”通常形容海岸或地形“多峡湾的/被峡湾切割的”。也可作较少见动词“to fjord”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having fjords; cut or indented by long, narrow sea inlets (fjords).","zh":"有峡湾的；被狭长的海湾（峡湾）切割/凹入的。"},"examples":[{"en":"Norway is famous for its fjorded coastline.","zh":"挪威以其布满峡湾的海岸线而闻名。"},{"en":"They sailed along the fjorded shore at sunset.","zh":"他们在日落时分沿着多峡湾的海岸航行。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “fjord” (to form or create fjords; to cut into a coast like a fjord).","zh":"“fjord”的过去式/过去分词：形成峡湾；像峡湾那样切入海岸。"},"examples":[{"en":"Over thousands of years, glaciers fjorded the coast into deep inlets.","zh":"在数千年里，冰川把海岸切割成深邃的海湾（形成峡湾）。"}]}],"synonyms":["fjord-indented","deeply indented","inlet-cut","rugged (coastline)"],"phonetic":"/ˈfjɔrdɪd/","extraExplanation":["“fjord”一词来自挪威语/古诺斯语，常用来指冰川侵蚀形成的深而狭长的海湾。英语里更常见的表达是“a fjorded coast / fjord-indented coast（多峡湾的海岸）”。动词用法“to fjord”相对少见，多见于地理或科普写作中。"]}
{"word":"fjords","summary":{"en":"Fjords are long, narrow sea inlets with steep sides, carved by glaciers.","zh":"峡湾是由冰川雕刻形成的狭长海湾，两侧通常陡峭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, narrow sea inlet between steep cliffs or mountains, formed by glaciers (plural: fjords)","zh":"峡湾：由冰川侵蚀形成的、两侧多为陡峭山崖或山地的狭长海湾（复数：fjords）"},"examples":[{"en":"Norway is famous for its dramatic fjords and coastal scenery.","zh":"挪威以壮丽的峡湾和海岸风光闻名。"},{"en":"We took a boat tour through the fjords to see waterfalls and cliffs up close.","zh":"我们乘船游览峡湾，近距离观看瀑布和峭壁。"},{"en":"In winter, the fjords can look especially quiet and dark under low light.","zh":"冬天在微弱的光线下，峡湾看起来格外安静而深沉。"}]}],"synonyms":["glacial inlet","sea inlet","inlet"],"phonetic":"/fjɔrd/","extraExplanation":["“fjord”一词源自挪威语（也与古北欧语有关），常用来描述斯堪的纳维亚等高纬地区典型的冰川地貌。","注意拼写：fj- 开头在英语里不常见，发音时通常读作 /fy/ 或更接近 /fyo/ 的开头音（美式常见为 /fjɔrd/）。"]}
{"word":"fjorgyn","summary":{"en":"Fjorgyn (Fjörgyn) is a Norse-mythology name used poetically for the Earth goddess, often linked with Jörð, Thor’s mother.","zh":"Fjorgyn（Fjörgyn）是北欧神话中“大地女神/大地”的诗性称呼，常与 Jörð 视为同一位，并被认为是索尔的母亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norse mythology) A poetic name for the Earth as a goddess; often identified with Jörð, the mother of the god Thor.","zh":"（北欧神话）“大地女神”的诗体别称；常与“Jörð（约尔德）”视为同一位神祇，被认为是雷神索尔（Thor）的母亲。"},"examples":[{"en":"In some Old Norse poems, Fjorgyn is used as another name for the Earth itself.","zh":"在一些古诺尔斯诗歌中，Fjorgyn 被用作“大地”本身的另一个名字。"},{"en":"The text describes Thor as the son of Fjorgyn, emphasizing his connection to the land.","zh":"文本把索尔称作 Fjorgyn 之子，强调他与大地的联系。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common; variant form) A related mythic name appearing in Old Norse sources (often discussed alongside Fjörgynn), sometimes treated as a distinct figure in scholarly discussion.","zh":"（较少见；变体/相关形式）古诺尔斯资料中出现的相关神名（常与 Fjörgynn 一并讨论），在学术讨论中有时被视为不同人物。"},"examples":[{"en":"Different translations may spell the name as Fjorgyn or Fjörgyn, depending on how special letters are handled.","zh":"不同译本可能写作 Fjorgyn 或 Fjörgyn，取决于如何处理特殊字母。"}]}],"synonyms":["Jörð","Earth (personified)","Fjörgynn"],"phonetic":"/ˈfjɔrɡɪn/","extraExplanation":["Fjörgyn（含字母 ö 的拼写）常见于学术转写；英语读者有时写成 Fjorgyn 来避免变音符号。","在北欧诗体传统中，神名常作为“代称/隐喻”（类似称大海为“鲸之路”）；Fjörgyn 作为“大地”的诗性称呼，常用于凸显血缘或自然力量的意象。","需要注意：资料中还会见到 Fjörgynn（多被视作阳性形式），有的传统说他与弗丽嘉（Frigg）有关；这些差异多源于诗歌用法、手稿传统与后世整理方式不同。"]}
{"word":"fju","summary":{"en":"FJU is most often an abbreviation for Fu Jen Catholic University in Taiwan, but it can also be a context-dependent acronym or username.","zh":"FJU 最常见是“辅仁大学”（台湾）的缩写，也可能是依语境而定的首字母缩写或用户名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation most commonly used for Fu Jen Catholic University (a private university in New Taipei City, Taiwan).","zh":"常见缩写，通常指“辅仁大学”（台湾新北市的一所私立大学）。"},"examples":[{"en":"She studies sociology at FJU in Taiwan.","zh":"她在台湾的 FJU（辅仁大学）读社会学。"},{"en":"The conference will be hosted by FJU this year.","zh":"今年的会议将由 FJU（辅仁大学）主办。"}]},{"partOfSpeech":"other","definition":{"en":"A short form that may also be used as an informal acronym or username; meaning depends on context.","zh":"也可能是随意的首字母缩写或用户名；具体含义取决于语境。"},"examples":[{"en":"I saw “fju” in the chat, but I’m not sure what it stands for.","zh":"我在聊天里看到“fju”，但不确定它代表什么。"}]}],"synonyms":["Fu Jen","Fu Jen Catholic University"],"phonetic":"/ˌɛf dʒeɪ ˈjuː/","extraExplanation":["“FJU”作为“辅仁大学”的缩写在台湾相关语境（学校官网、校友社群、学术会议等）里比较常见；如果你是在其他场景（游戏、聊天、技术论坛）看到“fju”，可能是不同的缩写或只是用户ID。若你能告诉我出现的句子或场景，我可以更准确判断。"]}
