{"word":"foal","summary":{"en":"A foal is a young horse; as a verb, it means a mare gives birth to a foal.","zh":"foal 指“小马/马驹”；作动词时指“（母马）产驹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young horse (usually under one year old)","zh":"小马；马驹（通常指一岁以下的幼马）"},"examples":[{"en":"The foal stayed close to its mother in the field.","zh":"小马在牧场里紧紧跟着母马。"},{"en":"We saw a newborn foal learning to stand.","zh":"我们看到一匹新生马驹正在学站起来。"}]},{"partOfSpeech":"v.","definition":{"en":"to give birth to a foal (used of a mare)","zh":"（母马）产驹；生小马"},"examples":[{"en":"The mare foaled during the night.","zh":"那匹母马在夜里产驹了。"},{"en":"They built a quiet stall where the mare could foal safely.","zh":"他们搭了一个安静的马厩隔间，让母马能安全产驹。"}]}],"synonyms":["colt","filly","young horse"],"phonetic":"/foʊl/","extraExplanation":["“foal”是马科动物的幼崽统称，最常指小马；更具体时也会看到：colt（小公马驹）、filly（小母马驹）。","常见搭配：a foal is born（马驹出生）、a mare foals（母马产驹）、foal season（产驹季）。在文学或乡村题材中，“foal”常用来营造春天、新生与活力的意象。"]}
{"word":"foaled","summary":{"en":"“Foaled” means a mare gave birth to a foal, or it describes a horse as having been born in a particular place/year.","zh":"“foaled”表示母马产驹；也可作形容词，表示某匹马在某地/某年出生。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of a mare) to give birth to a foal; to produce a young horse.","zh":"（母马）产驹；生小马。"},"examples":[{"en":"The mare foaled early in the morning.","zh":"那匹母马清晨产下了小马。"},{"en":"They kept the mare in a quiet stall until she foaled.","zh":"他们把母马安置在安静的马厩里，直到它产驹。"}]},{"partOfSpeech":"adj.","definition":{"en":"Born as a foal; delivered by a mare (often used in descriptions of horses).","zh":"（小马）出生的；（马）产下的（常用于描述马匹信息）。"},"examples":[{"en":"He rides a colt foaled in Kentucky.","zh":"他骑的是一匹在肯塔基出生的小公马。"},{"en":"The horse was foaled in 2019 and trained in Florida.","zh":"这匹马2019年出生，在佛罗里达受训。"}]}],"synonyms":["gave birth","delivered (a foal)","birthed (a foal)"],"phonetic":"/foʊld/","extraExplanation":["“foaled”是动词“foal”的过去式/过去分词。日常更常见的是名词“foal”（小马驹）以及表达“a mare foaled”（母马产驹）。在赛马、育马资料里，“foaled in + 地点/年份”很常见，用来说明马匹的出生地或出生年份。"]}
{"word":"foalfoot","summary":{"en":"Foalfoot is a rare/old word, most commonly referring to the plant coltsfoot; it can also literally mean a young horse’s foot.","zh":"Foalfoot 是较少见的旧词，最常指植物“款冬”（coltsfoot）；也可按字面指“小马的蹄/脚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old or regional name for the plant coltsfoot (Tussilago farfara), a wild plant with yellow flowers that appear early in spring.","zh":"“款冬”（coltsfoot，学名 Tussilago farfara）的旧称或方言称呼；一种早春开黄花的野生植物。"},"examples":[{"en":"In some old herbals, foalfoot is listed as a spring plant with bright yellow blooms.","zh":"在一些古老的草药书里，foalfoot 被记为一种早春开亮黄色花的植物。"},{"en":"People sometimes confused foalfoot with similar-looking wildflowers.","zh":"人们有时会把 foalfoot 和外形相似的野花混淆。"}]},{"partOfSpeech":"n.","definition":{"en":"Literally, the foot of a foal (a young horse).","zh":"字面义：小马（幼驹）的脚/蹄。"},"examples":[{"en":"The vet checked the foalfoot for swelling after the run.","zh":"小马跑完后，兽医检查它的蹄子有没有肿胀。"}]}],"synonyms":["coltsfoot"],"phonetic":"/ˈfoʊlˌfʊt/","extraExplanation":["“Foalfoot”在现代英语里很少见，更多出现在旧文献、地方用语或植物志/草药书中；如今更常用的标准名称是“coltsfoot”。","这种用动物来给植物命名的方式在英语里很常见（例如 coltsfoot、lamb’s ear 等），通常与叶形、质感或民间联想有关。"]}
{"word":"foalfoots","summary":{"en":"Foalfoots is a rare plural form of foalfoot, an old/regional name for the plant coltsfoot.","zh":"Foalfoots 是罕见的复数形式，指 foalfoot（款冬/款冬花 coltsfoot 的旧称或方言称呼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) foalfoot; an old or regional name for the plant “coltsfoot” (Tussilago farfara), which has hoof-shaped leaves and yellow flowers and was traditionally used in herbal remedies for coughs.","zh":"（复数）foalfoot；“款冬（coltsfoot，款冬花）”的古老或方言名称之一（Tussilago farfara）。这种植物叶子像马蹄、开黄色花，传统草药中常用于缓解咳嗽。"},"examples":[{"en":"In older herbals, foalfoots were recommended in teas for sore throats.","zh":"在较早的草药书里，foalfoots 常被建议泡茶用来缓解喉咙痛。"},{"en":"The bank was covered with yellow coltsfoot—sometimes called foalfoot in old texts.","zh":"河岸上长满了黄色的款冬（coltsfoot），在一些旧文献中也叫 foalfoot。"}]}],"synonyms":["coltsfoot","Tussilago farfara"],"phonetic":"/ˈfoʊlˌfʊt/","extraExplanation":["“foalfoot(s)”是比较少见的拼写/叫法，更常见的是“coltsfoot”。两者都在用“小马（colt/foal）+ 蹄（foot）”来形容叶片形状像马蹄。","在现代英语里，这个词多见于植物学、旧草药书或文学仿古语境。日常表达建议用“coltsfoot”。"]}
{"word":"foalhood","summary":{"en":"Foalhood means the young stage of a horse’s life (when it is a foal).","zh":"Foalhood 指马还是小马驹时的幼年阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The early life or young age of a foal (a young horse).","zh":"小马驹时期；幼马的幼年阶段。"},"examples":[{"en":"The photo album shows the horse from foalhood to adulthood.","zh":"这本相册记录了这匹马从小马驹时期到成年的变化。"},{"en":"During foalhood, horses grow quickly and need gentle care.","zh":"在幼马时期，马长得很快，需要细心照料。"}]}],"synonyms":["colthood","youth","early life"],"phonetic":"/ˈfoʊlˌhʊd/","extraExplanation":["“foalhood”由“foal（小马驹）+ -hood（表示‘时期/状态’的后缀）”构成，类似的词还有“childhood（童年）”“adulthood（成年期）”。这个词在日常口语中不算常见，更多见于写作、马术或畜牧相关语境，用来强调“从幼年到成年的成长阶段”。"]}
{"word":"foaling","summary":{"en":"Foaling means a mare giving birth to a foal, or something connected to that period.","zh":"Foaling 指母马产驹（生小马）的过程，也可指与产驹期相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of a mare (female horse) giving birth to a foal","zh":"（母马）产驹；分娩小马的过程"},"examples":[{"en":"The vet will be on call during foaling in case the mare needs help.","zh":"在产驹期间兽医会随时待命，以防母马需要帮助。"},{"en":"Foaling usually happens at night on many horse farms.","zh":"在很多马场，母马产驹通常发生在夜间。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective) relating to the time or conditions when mares give birth","zh":"（作形容词）与产驹期有关的；分娩期的"},"examples":[{"en":"During the foaling season, the staff checks the mares more often.","zh":"在产驹季节，工作人员会更频繁地检查母马。"},{"en":"They prepared a clean foaling stall for the mare.","zh":"他们为母马准备了一个干净的产房马厩。"}]}],"synonyms":["giving birth (to a foal)","parturition (formal)","birthing"],"phonetic":"/ˈfoʊlɪŋ/","extraExplanation":["“foaling”来自动词“to foal”（产驹）。在马业语境中很常见：foaling stall（产房马厩）、foaling season（产驹季节）、foaling complications（产驹并发症）。","日常英语里也可以说“the mare is foaling”（母马正在产驹），但更多时候会用名词短语来描述整个过程或季节。"]}
{"word":"foals","summary":{"en":"“Foals” means young horses; it is the plural of “foal.”","zh":"“Foals”指小马驹，是“foal”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Young horse; a baby horse (male or female), especially under one year old.","zh":"小马；幼马（公母都可），通常指一岁以内。"},"examples":[{"en":"The mare stayed close to her foal in the field.","zh":"母马在草地里一直紧跟着它的小马驹。"},{"en":"We saw two foals learning to run beside their mothers.","zh":"我们看到两匹小马驹在母马身旁学着奔跑。"}]},{"partOfSpeech":"other","definition":{"en":"Plural form of “foal.”","zh":"“foal”的复数形式。"},"examples":[{"en":"In spring, many farms welcome new foals.","zh":"春天时，许多农场会迎来新出生的小马驹。"}]}],"synonyms":["young horses","colts (male foals)","fillies (female foals)"],"phonetic":"/foʊlz/","extraExplanation":["“foal”常见搭配：a foal is born（小马驹出生）、raise foals（饲养/养育小马驹）、mare and foal（母马和小马驹）。","文化/文学中，foal 常用来营造“新生、活力、纯真”的意象；在乡村或马术相关叙述里很常见。"]}
{"word":"foaly","summary":{"en":"Foaly is a proper name from the Artemis Fowl novels: a centaur tech genius and inventor.","zh":"Foaly是《Artemis Fowl》系列中的专有名词：一位半人马科技天才与发明家。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Foaly: a fictional character (a centaur and tech genius) in Eoin Colfer’s Artemis Fowl series; he is the LEP’s main inventor/engineer and often helps solve problems with technology.","zh":"Foaly：爱尔兰作家欧因·科尔弗（Eoin Colfer）《阿耳忒弥斯·福尔》（Artemis Fowl）系列中的虚构角色；一位半人马、科技天才，常作为LEP的主要发明家/工程师，用科技手段解决危机。"},"examples":[{"en":"Foaly designs new gadgets for the LEP to track Artemis.","zh":"Foaly为LEP设计新装备来追踪阿耳忒弥斯。"},{"en":"When the plan fails, they ask Foaly for a technical fix.","zh":"计划失败时，他们会找Foaly用技术手段补救。"}]}],"synonyms":["(proper name)"],"phonetic":"/ˈfoʊli/","extraExplanation":["“Foaly”主要作为专有名词使用，通常不当作普通英语词汇来查。最常见的语境是青少年奇幻小说《Artemis Fowl》中：LEP指“Lower Elements Police（下层元素警察）”，Foaly相当于团队里的“工程师/技术顾问”角色。","如果你原本想查的是普通单词，可能是拼写接近的：“folly”（愚蠢；蠢事）或“foal”（小马驹）。你可以告诉我你看到它的句子，我可以帮你确认。"]}
{"word":"foam","summary":{"en":"Foam is a mass of tiny bubbles (like on coffee or waves) or a soft, air-filled material; it can also mean “to produce bubbles.”","zh":"foam 可指“泡沫（细小气泡）”，也可指“泡沫材料/海绵类发泡物”，还可作动词表示“起泡、冒泡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mass of small bubbles in a liquid or on its surface (for example, on coffee, soap water, or the sea).","zh":"（液体中或表面的）泡沫；一团细小气泡（如咖啡奶泡、肥皂泡、海浪泡沫）。"},"examples":[{"en":"There was foam on top of the cappuccino.","zh":"卡布奇诺上面有一层奶泡。"},{"en":"The waves crashed and left white foam on the shore.","zh":"海浪拍打岸边，留下白色泡沫。"}]},{"partOfSpeech":"n.","definition":{"en":"A light, soft material full of tiny air holes, used for cushions, packaging, insulation, or cleaning sponges.","zh":"泡沫材料；发泡塑料/海绵（内部充满细小气孔，用于坐垫、包装、保温或清洁海绵等）。"},"examples":[{"en":"The helmet has a layer of foam inside for protection.","zh":"头盔里面有一层泡沫用于保护。"},{"en":"They packed the glass in foam to prevent breaking.","zh":"他们用泡沫把玻璃包好以防碎裂。"}]},{"partOfSpeech":"v.","definition":{"en":"To form foam or cover with foam; to produce many small bubbles (often used with “up” or “at the mouth”).","zh":"起泡；（使）产生泡沫；（常与 up 连用）冒泡；（口语也可说）口吐白沫。"},"examples":[{"en":"The soap will foam up when you add water.","zh":"加水后肥皂会起很多泡沫。"},{"en":"The dog was foaming at the mouth after the chase.","zh":"追逐之后那只狗嘴边起了白沫。"}]}],"synonyms":["froth","lather","suds","bubbles","spume"],"phonetic":"/foʊm/","extraExplanation":["“foam”既可指自然产生的泡沫（海浪、啤酒、肥皂水），也常指人造的“发泡材料”（如 memory foam 记忆棉、styrofoam 泡沫塑料）。学习时可根据语境判断：看到“on top of / on the surface”多为泡沫；看到“made of / layer of / padding”多为泡沫材料。","常见搭配：foam up（起泡）、shaving foam（剃须泡沫）、sea foam（海沫）、memory foam（记忆棉）、foam rubber（泡沫橡胶）。"]}
{"word":"foam-born","summary":{"en":"Foam-born is a poetic adjective meaning “born from sea foam,” especially associated with Aphrodite; it can also mean “formed from something fleeting or unstable.”","zh":"foam-born 是诗意形容词，意为“由海泡沫所生”（尤指阿佛洛狄忒）；也可引申为“由短暂不稳之物形成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(poetic) Born from sea foam; originating from the foam of the ocean (often used to describe Aphrodite/Venus or something imagined as emerging from the sea).","zh":"（诗意）由海浪泡沫所生；从海的泡沫中诞生（常用来指阿佛洛狄忒/维纳斯，或想象中从海里出现的事物）。"},"examples":[{"en":"In the myth, Aphrodite is the foam-born goddess of love.","zh":"在神话中，阿佛洛狄忒是“泡沫所生”的爱之女神。"},{"en":"The poet called the sunrise a foam-born light rising from the waves.","zh":"诗人把日出称作“泡沫所生”的光，从海浪中升起。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literary, extended) Created from something light, fleeting, or unstable—like foam; not solid or long-lasting.","zh":"（文学引申）由轻飘、短暂或不稳定之物“生成”；如泡沫般不牢固、不持久。"},"examples":[{"en":"Their foam-born hopes vanished after the first failure.","zh":"第一次失败后，他们那如泡沫般生成的希望就消散了。"},{"en":"The story warns against foam-born promises that sound good but collapse quickly.","zh":"这个故事告诫人们提防那些听起来动听却很快崩塌的“泡沫式承诺”。"}]}],"synonyms":["sea-born (close)","born of the sea (phrase)","ephemeral (for the extended sense)","fleeting (for the extended sense)"],"phonetic":"/ˈfoʊm bɔrn/","extraExplanation":["“foam-born”是较少见的诗性复合形容词，常见于文学或神话语境。最著名的背景来自希腊神话：阿佛洛狄忒（Aphrodite）从海中泡沫诞生，因此常被称为“foam-born”。在英语文学里，这个词也常用来营造古典、抒情、神秘的海洋意象。","实际写作中更常见的表达有“born of/from the sea foam”“foam-born goddess”。用于引申义时，通常带有“虚幻、短暂、不牢靠”的评价色彩。"]}
{"word":"foam-free","summary":{"en":"“Foam-free” means not producing foam, often used to describe cleansers, detergents, or liquids designed to avoid bubbles.","zh":"“foam-free”指“不起泡/无泡”，常用于描述洁面、洗涤剂或各类需要避免泡沫的液体配方。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a product or process) not producing foam; free from foam, especially in liquids such as soaps, cleaners, or industrial fluids.","zh":"（产品或过程）不产生泡沫的；无泡的（常用于肥皂、清洁剂或工业液体等）。"},"examples":[{"en":"This foam-free cleanser is easier to rinse off in hard water.","zh":"这种无泡洁面产品在硬水里更容易冲洗干净。"},{"en":"The factory switched to a foam-free detergent to reduce overflow in the tanks.","zh":"工厂改用无泡洗涤剂，以减少储罐溢出现象。"}]}],"synonyms":["non-foaming","no-foam","low-foam"],"phonetic":"/ˈfoʊm ˌfriː/","extraExplanation":["“foam-free”常见于商品标签与说明书（如cleanser、shampoo、detergent、additive等）。它强调“不会起泡/泡沫很少”，不一定代表“清洁力更强”或“更温和”，而是说明使用体验与工艺需求（例如避免设备起泡、便于冲洗）。","拼写上常用连字符（foam-free）作定语：a foam-free formula；放在名词后也可写作foam free：The formula is foam free."]}
{"word":"foam-maker","summary":{"en":"A foam-maker is a person or device that produces foam, often for milk, soap, or industrial products.","zh":"foam-maker 指制造泡沫的人或设备，常用于奶泡、洗手泡泡或工业泡沫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or device that makes foam (soft bubbles), especially for drinks, soap, or industrial uses.","zh":"制造泡沫的人或设备（产生柔软的气泡），常用于饮品、洗手液/肥皂或工业用途。"},"examples":[{"en":"This foam-maker turns warm milk into thick foam for cappuccinos.","zh":"这个泡沫机能把温牛奶打成浓厚的卡布奇诺奶泡。"},{"en":"We use a foam-maker bottle to create foamy soap for kids.","zh":"我们用起泡瓶把洗手液打成泡泡给孩子用。"}]}],"synonyms":["milk frother","soap foamer","foaming pump","aerator"],"phonetic":"/ˈfoʊmˌmeɪkɚ/","extraExplanation":["“foam-maker”是由 foam（泡沫）+ maker（制造者/制造器）组成的合成词，日常英语里更常见的说法会更具体：做咖啡奶泡常说 milk frother；做洗手泡泡常说 soap foamer / foaming pump。","书写上常见为 foam maker（不加连字符）或 foam-maker（加连字符作定语更清楚），例如：a foam-maker nozzle（起泡喷嘴）。"]}
{"word":"foam-suppressing","summary":{"en":"Foam-suppressing means intended to reduce or prevent foam.","zh":"foam-suppressing 指“用于减少或防止泡沫产生的（抑泡的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a substance, agent, or process) designed to reduce, prevent, or stop foam from forming.","zh":"（指物质、药剂或工艺）用于减少、预防或抑制泡沫产生的。"},"examples":[{"en":"The factory added a foam-suppressing agent to the wastewater tank.","zh":"工厂在废水池中加入了抑泡剂。"},{"en":"We chose a foam-suppressing detergent for the washing machine.","zh":"我们为洗衣机选择了抑泡型洗涤剂。"},{"en":"This coating has foam-suppressing properties during mixing.","zh":"这种涂层在搅拌时具有抑泡性能。"}]}],"synonyms":["antifoaming","defoaming","foam-inhibiting","anti-foaming"],"phonetic":"/ˈfoʊm səˌprɛsɪŋ/","extraExplanation":["“foam-suppressing”是由名词 foam（泡沫）+ 动词 suppress（抑制）+ -ing 组成的复合形容词，常见于工程、化学、食品加工、污水处理等说明性文字中。","写作中常见同义表达：foam-suppressing agent（抑泡剂）≈ antifoaming agent / defoamer（消泡剂/抑泡剂）。在有些行业里，defoamer 更强调“已经起泡后把泡消掉”，antifoaming/foam-suppressing 更强调“防止起泡或让泡不容易形成”。"]}
{"word":"foamability","summary":{"en":"Foamability means how easily a substance forms foam, often used in food, brewing, and chemical testing.","zh":"Foamability 指物质形成泡沫的能力，常用于食品、酿造与化学测试等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability of a liquid or mixture to produce foam (a mass of bubbles), especially when shaken, stirred, or aerated.","zh":"（液体或混合物在摇晃、搅拌或充气时）产生泡沫（大量气泡）的能力。"},"examples":[{"en":"Protein affects the foamability of egg whites.","zh":"蛋白质会影响蛋清的起泡能力。"},{"en":"The brewer tested the beer’s foamability to improve the head (foam) on top.","zh":"酿酒师测试啤酒的起泡性，以改善顶部的泡沫层。"},{"en":"This detergent has high foamability, so a small amount makes lots of suds.","zh":"这种洗涤剂起泡性很强，用一点就会产生很多泡沫。"}]},{"partOfSpeech":"n.","definition":{"en":"In technical testing, a measured property describing how easily and how much foam forms under specific conditions (e.g., time, agitation, temperature).","zh":"在技术测试中：在特定条件（如时间、搅动方式、温度）下，泡沫形成的难易程度和形成量这一可测性质。"},"examples":[{"en":"The lab report includes foamability values at 25°C and 40°C.","zh":"实验报告包含在25°C和40°C下的起泡性数值。"},{"en":"They compared foamability across different surfactant formulas.","zh":"他们比较了不同表面活性剂配方的起泡性。"}]}],"synonyms":["foaming ability","foaming capacity","frothability (technical)"],"phonetic":"/ˌfoʊməˈbɪləti/","extraExplanation":["“foamability”常见于食品科学（如蛋清、奶泡、啤酒泡沫）、化学与日化产品（洗涤剂、香波）、以及材料/工艺测试。日常英语中更常说“how well it foams / how foamy it is”。","相关但不同的词：foamability（起泡能力）强调“能不能/多容易起泡”；foam stability（泡沫稳定性）强调“泡沫能持续多久、不易消泡”。"]}
{"word":"foamable","summary":{"en":"“Foamable” means able to produce foam; it’s often used for cleansers, shampoos, or materials that can form bubbles.","zh":"“foamable”表示“可起泡的；能形成泡沫的”，常用于洁面、洗发水或能形成气泡的材料等描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to form foam (many small bubbles) when mixed, shaken, or used.","zh":"可起泡的；能形成泡沫的（与水混合、摇晃或使用时会产生许多小气泡）。"},"examples":[{"en":"Choose a foamable cleanser if you like a bubbly, fresh feeling when washing your face.","zh":"如果你喜欢洗脸时有丰富泡泡和清爽感，可以选择可起泡的洁面产品。"},{"en":"Some shampoos are highly foamable even in hard water.","zh":"有些洗发水即使在硬水中也非常容易起泡。"}]}],"synonyms":["foaming","able to foam","lathering","frothy"],"phonetic":"/ˈfoʊməbəl/","extraExplanation":["“foamable”常见于产品说明与工业/化学语境（如清洁剂、洗发水、发泡材料）。日常口语更常用“foamy”（多泡的）或“lathers well”（起泡多）。","在护肤品与洗护产品里，“foamable”通常只描述“能起泡”，并不一定等同于“清洁力更强”或“更温和”；这取决于配方与表面活性剂种类。"]}
{"word":"foambow","summary":{"en":"Foambow means the frothy foam at the bow of a moving boat.","zh":"foambow 指船只行进时船首处翻起的泡沫白浪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Foam that forms at the front (bow) of a moving boat or ship, often seen as frothy white water.","zh":"船只或轮船前部（船首）因行进而形成的泡沫状白浪（泡沫水）。"},"examples":[{"en":"The sailboat cut through the water, leaving a bright foambow in front of it.","zh":"帆船破浪前行，船首前方翻起一片明亮的泡沫白浪。"},{"en":"In the morning light, the foambow looked almost silver.","zh":"在晨光里，船首的泡沫白浪几乎呈银色。"}]}],"synonyms":["bow foam","frothy bow wave","bow wave foam"],"phonetic":"/ˈfoʊmˌbaʊ/","extraExplanation":["“foambow”是由 foam（泡沫）+ bow（船首）构成的复合词；在航海/描写海景的语境中更常见。日常英语里更常用的说法包括 “foam at the bow” 或 “frothy bow wave”。"]}
{"word":"foamed","summary":{"en":"“Foamed” means “produced foam” (past of foam) or “covered with foam/bubbles.”","zh":"“foamed”表示“起泡沫了/产生泡沫”（foam的过去式），也可作形容词指“布满泡沫的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “foam”; to produce or become covered with many small bubbles (foam), often on a liquid.","zh":"“foam”的过去式和过去分词；（使）起泡沫，产生或覆盖许多小气泡（泡沫），常见于液体表面。"},"examples":[{"en":"The soap foamed quickly when I added water.","zh":"我加了水之后，肥皂很快就起泡了。"},{"en":"The waves foamed against the rocks.","zh":"海浪拍打礁石，溅起白色泡沫。"},{"en":"He poured the soda too fast, and it foamed over the top.","zh":"他倒汽水太快了，结果泡沫溢出了杯口。"}]},{"partOfSpeech":"adj.","definition":{"en":"covered with foam; full of bubbles (often describing a drink, the sea, or cleaning products).","zh":"布满泡沫的；满是气泡的（常形容饮料、海面或清洁用品）。"},"examples":[{"en":"She wiped the foamed milk off the edge of the cup.","zh":"她把杯口边缘的奶泡擦掉了。"},{"en":"The sink was filled with foamed-up soap water.","zh":"水槽里满是起泡的肥皂水。"}]}],"synonyms":["bubbled","frothed","lathered","effervesced"],"phonetic":"/foʊmd/","extraExplanation":["“foam”常指比较轻、细的泡沫（如啤酒泡、奶泡、肥皂泡）；“froth”也表示泡沫，但更强调“打出来的泡”或“很多泡在表面翻滚”的感觉。"]}
{"word":"foamer","summary":{"en":"“Foamer” usually means a foam-making device (like a soap or milk foamer), and can also mean a person who makes/uses foam; informally, it can describe someone who gets extremely worked up.","zh":"“Foamer”通常指“起泡器/发泡装置”（如洗手液起泡瓶、奶泡器），也可指使用/制造泡沫的人；口语里还可贬义地指情绪过度激动的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who uses or produces foam (such as for cleaning, firefighting, or making drinks).","zh":"使用或制造泡沫的人（如清洁、消防或制作饮品起泡的人）。"},"examples":[{"en":"The foamer attached the nozzle and covered the car with soap foam.","zh":"起泡器操作员接上喷头，用肥皂泡沫覆盖了整辆车。"},{"en":"In training, the foamer practiced spreading foam to control a small fire.","zh":"在训练中，泡沫喷洒员练习用泡沫控制小火。"}]},{"partOfSpeech":"n.","definition":{"en":"A device or attachment that creates foam (often for soap, sanitizer, beer, or firefighting foam).","zh":"起泡器；发泡装置（常用于肥皂、消毒液、啤酒或消防泡沫）。"},"examples":[{"en":"This soap foamer makes it easier to wash your hands with less liquid.","zh":"这个洗手液起泡瓶能让你用更少的液体更容易洗手。"},{"en":"The barista cleaned the milk foamer after each drink.","zh":"咖啡师每做完一杯都会清洗奶泡器。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who becomes overly excited, angry, or fanatical (informal; from “foaming at the mouth”).","zh":"过度激动、愤怒或狂热的人（非正式；源自“口吐白沫/怒到喷沫”的形象）。"},"examples":[{"en":"He turned into a foamer about the referee’s call.","zh":"他对裁判的判罚激动得像“喷沫”的人一样。"},{"en":"Online arguments can attract foamers who just want to fight.","zh":"网络争论有时会吸引一些只想吵架的“激进喷子”。"}]}],"synonyms":["foam maker","frother","foaming dispenser"],"phonetic":"/ˈfoʊmɚ/","extraExplanation":["“foamer”在日常生活里最常见的是指“起泡装置”，例如洗手液起泡瓶（soap foamer）或咖啡用的奶泡器（milk foamer）。在工业/消防语境中也可能指负责喷洒泡沫的人或设备。","口语里把人叫作“foamer”通常带贬义，和“foaming at the mouth（气到口吐白沫）”的夸张画面有关，表示情绪失控、极端激动或好斗。使用时注意场合，避免冒犯。"]}
{"word":"foamers","summary":{"en":"Foamers can mean devices/products that make foam, or (slang) very overexcited fans—often train enthusiasts.","zh":"foamers 可指“起泡/发泡装置或产品”，也可作俚语指“过度狂热的粉丝”（常指铁路迷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device, tool, or chemical product that creates foam (for cleaning, firefighting, insulation, etc.)","zh":"起泡器；发泡装置；发泡剂（用于清洁、灭火、保温等）"},"examples":[{"en":"The mechanic used a foamer to apply thick soap foam to the engine bay.","zh":"技师用起泡器把浓厚的肥皂泡沫喷到发动机舱里。"},{"en":"Firefighters deployed a foamer to cover the fuel spill with foam.","zh":"消防员使用发泡装置用泡沫覆盖燃油泄漏处。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) an overly enthusiastic fan, especially a train/railroad enthusiast","zh":"（俚语）过度狂热的粉丝（尤指火车/铁路迷）"},"examples":[{"en":"Some foamers wait for hours just to photograph a rare locomotive.","zh":"有些“铁路狂热粉”会等好几个小时，只为拍一台罕见的机车。"},{"en":"He’s a bit of a foamer about transit maps and train schedules.","zh":"他对交通线路图和列车时刻表有点“过度着迷”。"}]}],"synonyms":["foam maker","foaming device","foaming agent","railfan (slang sense)","train enthusiast"],"phonetic":"/ˈfoʊmɚ/","extraExplanation":["“foamer”作俚语常见于北美铁路圈（railfans）。说法来自“foaming at the mouth”（兴奋到像“口吐白沫”），带一点调侃甚至贬义：指有人过分激动、上头、行为夸张。正式场合建议用更中性的话，如 “railfan / train enthusiast”。"]}
{"word":"foamflower","summary":{"en":"Foamflower is a shade-loving woodland plant (Tiarella) with frothy-looking clusters of small flowers.","zh":"foamflower 指耐阴的林地植物泡沫花（Tiarella），花簇轻盈像泡沫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small woodland plant (genus *Tiarella*) with airy clusters of tiny white or pale pink flowers; often grown as a shade-loving garden ground cover.","zh":"泡沫花（*Tiarella* 属植物）：一种林地小型植物，开成簇的细小白色或淡粉色花，看起来像泡沫；常作耐阴地被植物栽培。"},"examples":[{"en":"Foamflower grows well in shady gardens under trees.","zh":"泡沫花在树下的阴凉花园里长得很好。"},{"en":"The foamflower’s flowers look like soft white foam above the leaves.","zh":"泡沫花的花朵像叶子上方的柔白泡沫。"},{"en":"We planted foamflower as a ground cover along the north side of the house.","zh":"我们在房子北侧种了泡沫花当作地被植物。"}]}],"synonyms":["Tiarella"],"phonetic":"/ˈfoʊmˌflaʊɚ/","extraExplanation":["“foamflower”是合成词：foam（泡沫）+ flower（花），形容它开花时一团团轻盈细碎的花序像“泡沫”一样蓬松。","园艺语境里它常与hosta（玉簪）、fern（蕨类）、heuchera（珊瑚铃）等一起作为耐阴植物搭配。","学名属名*Tiarella*有时也会被直接当作同义词使用，尤其在植物标签或园艺书中。"]}
{"word":"foamier","summary":{"en":"“Foamier” means “more foamy”: having more foam, or (figuratively) more bubbly and lively.","zh":"“foamier”表示“更起泡/泡沫更多的”；也可比喻“更轻快活泼的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of foamy) Having more foam; more covered with bubbles or froth.","zh":"（foamy 的比较级）更起泡的；泡沫更多的；更充满泡泡/浮沫的。"},"examples":[{"en":"This soap makes the water foamier, so it feels easier to clean with.","zh":"这款肥皂会让水更起泡，所以用起来感觉更容易清洁。"},{"en":"If you shake the bottle, the drink will get foamier.","zh":"如果你摇晃瓶子，饮料会变得更起泡。"},{"en":"I prefer a foamier latte with lots of milk foam on top.","zh":"我更喜欢泡沫更厚的拿铁，上面要有很多奶泡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) More bubbly, lively, or full of light excitement (often describing talk, writing, or a mood).","zh":"（比喻）更轻快活泼的；更“有泡泡感”的（常形容谈话、文字或氛围）。"},"examples":[{"en":"Her foamier writing style makes the story feel fun and easy to read.","zh":"她更轻快活泼的写作风格让故事读起来有趣又轻松。"},{"en":"After the good news, the conversation became foamier and more upbeat.","zh":"听到好消息后，大家的聊天变得更轻松热闹、更积极。"}]}],"synonyms":["more foamy","frothier","bubblier","airier"],"phonetic":"/ˈfoʊmiər/","extraExplanation":["“foamier”是形容词“foamy”的比较级，常见构成是：以辅音字母+y结尾时，把y变i再加-er：foamy → foamier。最高级是“foamiest”。"]}
{"word":"foamiest","summary":{"en":"“Foamiest” means “having the most foam” or “most like foam.”","zh":"“Foamiest”表示“泡沫最多的”或“最像泡沫的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of foamy: having the most foam (many small bubbles on the surface of a liquid), or looking/feeling most like foam.","zh":"foamy 的最高级：泡沫最多的；（外观或触感）最像泡沫的。"},"examples":[{"en":"This latte is the foamiest one on the menu.","zh":"这杯拿铁是菜单上泡沫最多的一款。"},{"en":"After the storm, the waves were at their foamiest near the rocks.","zh":"暴风雨过后，靠近礁石的浪花泡沫最盛。"},{"en":"Use the foamiest part of the soap to clean the sink.","zh":"用肥皂泡沫最丰富的部分来刷洗水槽。"}]}],"synonyms":["most foamy","frothiest","bubblier (context-dependent)"],"phonetic":"/ˈfoʊmiəst/","extraExplanation":["“foamiest”是形容词“foamy”的最高级形式。以辅音字母+y结尾的形容词通常变级时把y变成i，再加-est：foamy → foamier → foamiest。","常见搭配：foamiest coffee/latte（泡沫最多的咖啡/拿铁）、foamiest waves（泡沫最多的浪）、foamiest soap（泡沫最丰富的肥皂）。"]}
{"word":"foamily","summary":{"en":"Family means your relatives (especially parents and children), and it can also mean a related group (like the cat family).","zh":"Family 指家人/家庭（尤指父母与子女），也可指具有共同特征的一组（如猫科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of people who are related to each other, especially parents and their children.","zh":"家；家庭（尤指父母和孩子）"},"examples":[{"en":"My family lives in California.","zh":"我的家人住在加利福尼亚州。"},{"en":"She wants to spend more time with her family.","zh":"她想花更多时间陪家人。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of related things, animals, plants, or languages that share similar features.","zh":"（事物/动植物/语言的）族；科；语系（具有共同特征的一组）"},"examples":[{"en":"Lions and tigers belong to the cat family.","zh":"狮子和老虎属于猫科动物。"},{"en":"Spanish and Italian are in the same language family.","zh":"西班牙语和意大利语属于同一个语系。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suitable for children; not containing sex, violence, or offensive language.","zh":"适合全家（尤其儿童）观看/使用的；健康文明的"},"examples":[{"en":"This movie is family-friendly.","zh":"这部电影适合全家观看。"},{"en":"We chose a family restaurant with a kids’ menu.","zh":"我们选了一家适合家庭的餐厅，有儿童菜单。"}]}],"synonyms":["relatives","household","kin","clan","lineage"],"phonetic":"/ˈfæməli/","extraExplanation":["“foamily” 常见于拼写错误，正确拼写是 **family**。在口语里 /ˈfæməli/ 的中间音节较弱，听起来像 “fam-uh-lee”，容易导致拼写混淆。"]}
{"word":"foaminess","summary":{"en":"Foaminess means the amount or degree of foam (tiny bubbles), especially on a liquid’s surface.","zh":"foaminess 指泡沫的多少/起泡的程度，常用于描述液体表面的细小气泡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of having a lot of foam (many small bubbles), especially on the surface of a liquid.","zh":"起泡性；泡沫很多的状态（尤指液体表面充满细小气泡）。"},"examples":[{"en":"The foaminess of the milk matters for a good cappuccino.","zh":"牛奶的起泡程度对做出一杯好的卡布奇诺很重要。"},{"en":"If the beer has unusual foaminess, the glass may not be clean.","zh":"如果啤酒的泡沫异常多，可能是杯子不够干净。"},{"en":"The shampoo’s foaminess makes it feel richer, but it doesn’t always mean it cleans better.","zh":"洗发水泡沫多会让人感觉更“浓”，但不一定代表清洁力更强。"}]}],"synonyms":["frothiness","bubbliness","foam formation"],"phonetic":"/ˈfoʊ.mi.nəs/","extraExplanation":["“foaminess”是由“foam（泡沫）+ -y（形容词后缀）→ foamy（多泡的）+ -ness（名词后缀）”构成，意思是“多泡的性质/程度”。","在饮品（咖啡拉花、啤酒泡沫）、清洁用品（肥皂/洗发水）和工业过程（发酵、污水处理）中很常见。日常表达里也可用更口语的说法：“how foamy it is（有多起泡）”。"]}
{"word":"foaming","summary":{"en":"Foaming means producing or full of foam; it can also describe extreme anger (“foaming at the mouth”).","zh":"Foaming 指“起泡的/充满泡沫的”，也可比喻“暴怒”（如 foaming at the mouth）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of small bubbles (foam); producing foam.","zh":"起泡的；充满泡沫的；会产生泡沫的。"},"examples":[{"en":"The waves were foaming as they hit the rocks.","zh":"海浪拍打岩石时泛起泡沫。"},{"en":"He poured the soap into the water until it was foaming.","zh":"他把肥皂倒进水里，直到水起泡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Extremely angry or excited, in a way that seems out of control.","zh":"（比喻）暴怒的；激动到失控的（常含负面语气）。"},"examples":[{"en":"She was foaming at the mouth with anger when she heard the news.","zh":"她听到消息后气得“口吐白沫”（形容极度愤怒）。"},{"en":"Online comments turned foaming and hostile within hours.","zh":"网上评论在几小时内就变得激烈而充满敌意。"}]},{"partOfSpeech":"n.","definition":{"en":"The action of forming foam; bubbling up (often in liquids).","zh":"起泡；冒泡（尤指液体产生泡沫的过程）。"},"examples":[{"en":"Foaming started as soon as the yeast was added.","zh":"一加入酵母就开始起泡了。"},{"en":"The foaming of the river was loud after the storm.","zh":"暴风雨过后，河水翻涌起泡的声音很大。"}]},{"partOfSpeech":"v.","definition":{"en":"To produce foam; to bubble with foam.","zh":"起泡；冒泡沫。"},"examples":[{"en":"The milk is foaming—turn the heat down.","zh":"牛奶在起泡了——把火调小。"},{"en":"The dog was foaming at the mouth, so they called a vet.","zh":"那只狗口吐白沫，所以他们叫了兽医。"}]}],"synonyms":["bubbly","frothy","fizzy","seething"],"phonetic":"/ˈfoʊmɪŋ/","extraExplanation":["“foam”本义是“泡沫”。“foaming at the mouth”字面是“口吐白沫”，在英语里既可用于真实情况（如癫痫、狂犬病等需要就医/就兽医），也常作比喻表示“气得发疯”。使用时注意语境，避免对健康状况作不当揣测或带偏见的表达。","写作中“foaming waves/sea”很常见，带有画面感，常用于描写风浪、激流或自然力量。"]}
{"word":"foamingly","summary":{"en":"“Foamingly” means “in a foamy/frothy way,” and can also mean “in an intensely angry or excited way” in literary use.","zh":"“foamingly”表示“起泡沫地/泡沫状地”，也可作文学性的引申，表示“情绪激烈（如同口吐白沫）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that produces foam or is full of foam; with froth.","zh":"起泡地；充满泡沫地；带着泡沫（泡沫状地）。"},"examples":[{"en":"The soap bubbled and spread foamingly across the sink.","zh":"肥皂起泡，泡沫状地在水槽里扩散开来。"},{"en":"The waves broke foamingly against the rocks.","zh":"海浪带着泡沫拍打着岩石。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative, often literary) In an excited, angry, or intense way, as if “foaming at the mouth.”","zh":"（引申，常见于文学/修辞）激动地、愤怒地或情绪强烈地，仿佛“口吐白沫”。"},"examples":[{"en":"He spoke foamingly about the unfair decision.","zh":"他激动（甚至带着怒气）地谈论那个不公平的决定。"},{"en":"The critic wrote foamingly, attacking every detail of the film.","zh":"那位评论家语气激烈地写作，抨击电影的每个细节。"}]}],"synonyms":["frothily","with foam","bubblingly","fiercely","heatedly"],"phonetic":"/ˈfoʊmɪŋli/","extraExplanation":["“foamingly”来自形容词“foaming（起泡的/冒泡的）”加副词后缀“-ly”。在现代英语里它相对少见，更常见的表达是“with foam / frothily（起泡地）”。","引申义与短语“foam at the mouth（口吐白沫；气得失控）”相关，常用于描写极端愤怒或激动的语气，带有夸张和文学色彩。"]}
{"word":"foamless","summary":{"en":"Foamless means having no foam or froth.","zh":"foamless 表示“无泡沫的；不起泡的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no foam; without a layer of bubbles or froth.","zh":"无泡沫的；不起泡的；没有气泡层的。"},"examples":[{"en":"I prefer foamless coffee because it feels smoother to drink.","zh":"我更喜欢无泡沫的咖啡，因为喝起来更顺滑。"},{"en":"The soap left the water almost foamless, so we added a bit more.","zh":"这款肥皂让水几乎不起泡，所以我们又加了一点。"},{"en":"The waves were strangely foamless on that calm morning.","zh":"那个平静的早晨，海浪异常地没有白色泡沫。"}]}],"synonyms":["nonfoaming","without foam","unfoamy"],"phonetic":"/ˈfoʊmləs/","extraExplanation":["“foamless”由“foam（泡沫）+ -less（无……的）”构成，意思是“没有泡沫”。在饮品场景里常用来描述“没有奶泡/没有泡沫层”，例如与“foamy（有泡沫的）”“with foam（加泡沫）”形成对比。"]}
{"word":"foamlike","summary":{"en":"Foamlike describes something that looks or feels like foam—light, frothy, and bubbly.","zh":"foamlike 表示“像泡沫一样”的：轻盈、绵密、起泡的外观或触感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling foam; having a light, bubbly, or frothy texture or appearance.","zh":"像泡沫的；具有轻盈、起泡或绵密泡状的质地/外观。"},"examples":[{"en":"The cappuccino had a foamlike layer on top.","zh":"这杯卡布奇诺上面有一层泡沫状的奶泡。"},{"en":"A foamlike substance formed on the surface of the water.","zh":"水面上形成了一种泡沫状的物质。"},{"en":"The cushion is filled with a foamlike material for comfort.","zh":"这个靠垫里填充了泡沫状材料，更舒服。"}]}],"synonyms":["frothy","bubbly","spongy","foamy"],"phonetic":"/ˈfoʊmˌlaɪk/","extraExplanation":["“foamlike”是由“foam（泡沫）+ -like（像……一样）”构成的形容词，常用于描述外观或触感：看起来“起泡、绵密、轻盈”，或摸起来“柔软、像海绵/泡棉”。","拼写上也可见到“foam-like”（加连字符）的形式，意思相同；在较正式的写作或为了清晰起见，有时会用连字符。"]}
{"word":"foams","summary":{"en":"“Foams” is the plural noun form of “foam” and also the third-person singular verb meaning “to form or produce bubbles.”","zh":"“foams”既是名词“foam（泡沫）”的复数，也可作动词第三人称单数，表示“起泡/产生泡沫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “foam”: a mass of small bubbles on the surface of a liquid (or made by soap/chemicals).","zh":"“foam”的复数：液体表面（或由肥皂/化学物质产生的）一团团泡沫、气泡。"},"examples":[{"en":"Sea foams gathered along the shore after the storm.","zh":"暴风雨过后，海边堆起了一团团海泡沫。"},{"en":"The barista topped the coffee with thick milk foams.","zh":"咖啡师在咖啡上加了厚厚的奶泡。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “foam”: to form a mass of small bubbles; to produce or be covered with foam.","zh":"“foam”的第三人称单数：起泡；产生泡沫；被泡沫覆盖。"},"examples":[{"en":"The soap foams quickly in warm water.","zh":"肥皂在温水里很快就起泡。"},{"en":"The river foams where it hits the rocks.","zh":"河水撞击岩石的地方会翻出泡沫。"},{"en":"He foams milk for a cappuccino.","zh":"他把牛奶打成奶泡做卡布奇诺。"}]}],"synonyms":["bubbles","lather","froth"],"phonetic":"/foʊmz/","extraExplanation":["“foam”既可作不可数名词（There’s foam on the water. 水面有泡沫），也可作可数名词（different foams 不同种类的泡沫；milk foams 多层/多次打出的奶泡）。","动词变形：foam–foams–foamed–foaming。口语中“foaming at the mouth（口吐白沫）”多用于形容极端愤怒或某些病症，使用时注意语境与礼貌。"]}
{"word":"foamy","summary":{"en":"Foamy describes something full of foam or bubbles; it can also (figuratively) mean overly excited or uncontrolled.","zh":"Foamy 指“起泡的/充满泡沫的”；也可比喻（常带批评）“过度激动、情绪失控的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with or full of foam; having a light, bubbly texture.","zh":"起泡的；充满泡沫的；呈轻盈气泡质感的。"},"examples":[{"en":"The ocean looked foamy near the rocks after the storm.","zh":"暴风雨过后，海浪拍打岩石附近看起来满是泡沫。"},{"en":"She poured the milk until it became foamy for her coffee.","zh":"她把牛奶打到起泡，用来做咖啡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a drink) producing a lot of foam on top, often from carbonation or pouring.","zh":"（饮料）泡沫很多的（常因碳酸或倒入方式产生）。"},"examples":[{"en":"The beer was too foamy, so he waited for the bubbles to settle.","zh":"啤酒泡沫太多了，他等气泡消下去。"},{"en":"Pour soda slowly so it doesn’t get foamy.","zh":"倒汽水时慢一点，避免起很多泡沫。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, often critical) Excited or emotional in a way that seems uncontrolled or exaggerated.","zh":"（比喻，常含批评）过度激动的；情绪“冒泡”的、失控的。"},"examples":[{"en":"The debate turned foamy, with people shouting instead of listening.","zh":"辩论变得情绪化，大家喊得多、听得少。"},{"en":"Some comments online felt foamy and unhelpful.","zh":"网上有些评论显得情绪过火，没什么帮助。"}]}],"synonyms":["frothy","bubbly","sudsy","fizzy"],"phonetic":"/ˈfoʊmi/","extraExplanation":["“foamy”来自“foam（泡沫）+ -y（表示“具有……特征的”）”，常用来描述海浪、肥皂泡、咖啡奶泡、啤酒等表面有很多细小气泡的状态。","比喻用法里，“foamy”带一点文学色彩，强调情绪像泡沫一样“涌起来”，多用于批评“过度激动、缺乏理性”。"]}

