{"word":"FOB","summary":{"en":"FOB is most commonly a trade/shipping term (“Free On Board”). It can also mean “fresh off the boat” (often offensive slang) or “forward operating base” (military).","zh":"FOB最常见是贸易/运输术语“离岸价（Free On Board）”。也可指带贬义的俚语“fresh off the boat”，或军事上的“前沿作战基地（forward operating base）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A shipping term meaning the seller’s responsibility ends when goods are loaded onto the ship (or otherwise delivered to the agreed shipping point); the buyer then takes over most risk and costs.","zh":"（贸易/物流）离岸价；指卖方在把货物装上船（或交到约定装运点）后责任完成，此后主要风险与费用由买方承担。"},"examples":[{"en":"The supplier quoted FOB Shanghai, so we paid the ocean freight and insurance.","zh":"供应商报的是FOB上海，所以海运费和保险费由我们承担。"},{"en":"Please confirm whether the price is FOB or CIF before we sign the contract.","zh":"签合同前请确认价格是FOB还是CIF。"}]},{"partOfSpeech":"other","definition":{"en":"A slang phrase meaning “fresh off the boat,” referring to a recent immigrant; often insulting or derogatory.","zh":"俚语“fresh off the boat”的缩写，指“刚下船/刚来不久的移民”；常带侮辱或贬义。"},"examples":[{"en":"Some people use “FOB” to mock new immigrants, which is disrespectful.","zh":"有些人用“FOB”嘲讽新移民，这是很不尊重的。"},{"en":"He stopped using the word after learning it can be offensive.","zh":"他了解到这个词可能冒犯人之后就不再用了。"}]},{"partOfSpeech":"other","definition":{"en":"A general abbreviation for “forward operating base,” a temporary military base used to support operations.","zh":"“forward operating base”的缩写，指用于支援行动的前线/前沿作战基地（临时基地）。"},"examples":[{"en":"Supplies were flown to the FOB overnight.","zh":"补给物资在夜间空运到前沿作战基地。"}]}],"synonyms":["Free On Board","FOB price","forward operating base"],"phonetic":"/ˌɛf.oʊˈbiː/","extraExplanation":["在国际贸易里，FOB常出现在合同或报价单中（如“FOB Shanghai”）。不同版本的Incoterms对细节有规定；实际以合同约定的装运港/交付点与Incoterms版本为准。","“FOB = fresh off the boat”在英语语境中常被视为带偏见的标签，尤其用于嘲笑口音、穿着或“外来者”。若要中性表达“新移民/刚到的人”，可用“new immigrant”“recent arrival”。"]}
{"word":"fob","summary":{"en":"“FOB” commonly means (1) a shipping term “Free On Board,” (2) a key fob remote, and (3) an often-offensive slang for “fresh off the boat.”","zh":"“FOB”常见含义包括：（1）贸易术语“装运港船上交货”，（2）钥匙遥控器/钥匙扣装置，（3）带冒犯意味的俚语“刚下船的新移民”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Shipping/Trade) “Free On Board”: a term in international trade meaning the seller’s responsibility ends when goods are loaded onto a ship at a named port; after that, the buyer takes on risk and costs (exact terms can vary by contract, e.g., FOB Shanghai).","zh":"（航运/贸易）FOB=“装运港船上交货”：国际贸易术语，通常指卖方在约定装运港把货物装上船后即完成主要交付义务；此后风险与费用通常转由买方承担（具体以合同/贸易术语规则为准，如 FOB 上海）。"},"examples":[{"en":"The price is FOB Ningbo, so we pay for ocean freight after loading.","zh":"价格是 FOB 宁波，所以装船后的海运费由我们承担。"},{"en":"Please quote FOB Los Angeles and include the expected loading date.","zh":"请按 FOB 洛杉矶报价，并注明预计装船日期。"}]},{"partOfSpeech":"n.","definition":{"en":"A small device attached to keys (a “key fob”), often used to lock/unlock a car or open a door remotely.","zh":"钥匙扣小装置（key fob），常用于遥控开/锁车门或门禁。"},"examples":[{"en":"I can’t start the car because I forgot the key fob.","zh":"我忘带钥匙遥控器，所以车启动不了。"},{"en":"Press the button on the fob to unlock the door.","zh":"按一下钥匙扣遥控器的按钮就能开门。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, often offensive) A person seen as an immigrant who is new to the U.S. culture; from “fresh off the boat.”","zh":"（俚语，常带冒犯）指被认为“刚到美国、很不融入”的移民；来自“fresh off the boat（刚下船）”。"},"examples":[{"en":"That word can be hurtful—try saying “new immigrant” instead.","zh":"那个词可能会伤人，建议改说“新移民”。"},{"en":"In some communities, people discuss how the term “FOB” affects identity.","zh":"在一些社群里，人们会讨论“FOB”这个词如何影响身份认同。"}]}],"synonyms":["Free On Board","key fob","remote key","new immigrant (preferred in neutral contexts)"],"phonetic":"/fɑb/","extraExplanation":["“FOB”有多个常见含义：贸易术语（Free On Board）、钥匙遥控器（key fob）、以及俚语“fresh off the boat”。阅读或听到时要结合语境判断。","作为俚语的“FOB”在很多场合带有嘲笑、排斥或歧视意味，尤其针对亚裔或其他移民群体；在正式或尊重的表达中，建议用“new immigrant / newly arrived immigrant（新移民/新到者）”等中性说法。","贸易中的 FOB 常与 Incoterms（国际贸易术语解释通则）相关；不同版本规则与合同条款会影响风险转移点与费用分担，实际业务中应以合同与所采用规则为准。"]}
{"word":"fob off sth.","summary":{"en":"to brush someone off or avoid responsibility with excuses or poor substitutes","zh":"用借口或劣质替代来敷衍推脱、打发走"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to get rid of someone or avoid dealing with something by giving an excuse, a poor answer, or something of low quality","zh":"用借口、敷衍的答复或劣质东西来打发人/敷衍了事，借此推脱不处理（某事）"},"examples":[{"en":"The company tried to fob off customers with a vague apology instead of fixing the problem.","zh":"公司试图用含糊的道歉来敷衍顾客，而不是解决问题。"},{"en":"He fobbed me off with an excuse and never answered my question.","zh":"他用一个借口把我打发了，根本没回答我的问题。"},{"en":"They tried to fob off an old model as the newest version.","zh":"他们想把旧款冒充成最新版本来糊弄人。"}]}],"synonyms":["brush off","put off","palm off","fob away","stonewall","dodge","evade"],"phonetic":"/fɑb ɔf/","extraExplanation":["常见结构：fob someone off (with something)（用……搪塞某人）；fob something off (on someone)（把劣质/不想要的东西塞给某人，常带“硬推销/坑人”的感觉）。","语气与场景：多用于负面评价，暗示对方不真诚、在推卸责任。英式英语里更常见，但美式英语也能理解。"],"etymology":"源自英语口语用法。fob 原本指“小物件/饰物（如表链末端的小坠子）”，后来发展出口语动词含义：用花言巧语或小把戏“搪塞、糊弄”，再加上 off 表示“推开、摆脱”，形成“把某事/某人打发走”的意思。","mnemonic":["把 fob 想成“糊弄（fo…）”，off 想成“推开/甩掉”：用借口把问题“推开”。","联想：售后把你“打发走”＝fob you off。"]}
{"word":"fob sth. off on sb.","summary":{"en":"to push an unwanted thing or responsibility onto someone","zh":"把不想要的东西或责任推给别人"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to get someone to accept something unwanted, inferior, or not their responsibility (often by persuasion or tricking)","zh":"把不想要的/次的东西或不该由对方负责的事推给某人（常带劝诱或欺骗意味）"},"examples":[{"en":"He tried to fob the broken phone off on me, saying it was “still fine.”","zh":"他想把坏掉的手机推给我，说“还能用”。"},{"en":"Don’t let them fob extra work off on you just because you’re new.","zh":"别因为你是新人就让他们把额外的工作推给你。"},{"en":"The company fobbed the problem off on a subcontractor.","zh":"公司把这个问题推给了分包商。"}]}],"synonyms":["dump on","palm off on","pass off","stick with","shift onto","foist on","offload onto"],"phonetic":"/fɑb/","extraExplanation":["语气与搭配：多用于口语/新闻评论，带明显负面评价，暗示对方在“甩锅/推责”或“塞给你烂摊子”。","结构：fob + 物(thing/problem/responsibility) + off + on + 人(sb). 代词通常放在中间：fob it off on me（不说 *fob off it on me）。","相关近义：fob someone off（=用借口打发某人走/敷衍某人），与本短语不同，后者强调“把东西/麻烦转嫁给别人”。"],"etymology":"“fob”早期有“欺骗、蒙混”的意思，可能与旧时表示“骗术/诡计”的用法有关；“fob off”逐渐固定为“搪塞、敷衍”，再延伸出“把不好的东西或麻烦推给别人”。","mnemonic":["联想“甩锅”：off = 甩开，on = 甩到别人身上 → 把麻烦“甩开”并“甩到”别人身上。","把 fob 想成“忽悠”(hu you)的感觉：用话术把不想要的东西忽悠给别人。"]}
{"word":"fobbed","summary":{"en":"“Fobbed” means “dealt with dishonestly or dismissively,” often in the phrase “fobbed off.”","zh":"“fobbed”指“用借口敷衍或欺骗”，常见搭配为“fobbed off（被搪塞/被打发走）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of fob) to trick or satisfy someone with an excuse, or to get rid of them by giving something of little value or by refusing to deal with the real issue (often used with “off”).","zh":"（fob 的过去式/过去分词）用借口敷衍、欺骗某人；用不值钱的东西搪塞人，或把人打发走（常与 off 连用）。"},"examples":[{"en":"The company fobbed customers off with a generic apology instead of offering refunds.","zh":"公司用一份套话式道歉来搪塞顾客，而不是退款。"},{"en":"He tried to ask for help, but he was fobbed off with, “I’m too busy.”","zh":"他想寻求帮助，却只得到一句“我太忙了”来敷衍。"},{"en":"They fobbed the old phone off on her as if it were new.","zh":"他们把那部旧手机冒充新手机塞给了她。"}]}],"synonyms":["brushed off","put off","palmed off","dismissed","deceived"],"phonetic":"/fɑbd/","extraExplanation":["“fobbed”最常见的搭配是 **fobbed off**（被敷衍/被打发走）或 **fobbed something off on someone**（把不想要的/不好的东西硬塞给某人）。","语气通常带负面评价，暗示对方没有认真对待你的问题，或在刻意推卸责任、蒙混过关。","常见于新闻、职场、投诉语境：比如顾客被商家用套话“应付”，员工被上级用借口“打发”。"]}
{"word":"fobbing","summary":{"en":"“Fobbing” means trying to deceive or brush someone off—most often in the phrase “fobbing off.”","zh":"“fobbing”多指“fob off”的进行式：用借口或次品糊弄人，或把人打发走、推脱责任。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"trying to deceive someone by giving an inferior thing or a false explanation (often used with “off”)","zh":"（常与 off 连用）用次品或虚假说法欺骗别人、敷衍过去"},"examples":[{"en":"The seller was fobbing customers off with cheap copies.","zh":"那位卖家用廉价仿品来糊弄顾客。"},{"en":"Don’t let them fob you off with excuses.","zh":"别让他们用借口把你打发了。"}]},{"partOfSpeech":"v.","definition":{"en":"trying to get rid of someone or avoid dealing with something by giving it to someone else or delaying it (often used with “off”)","zh":"（常与 off 连用）把人打发走；推脱处理（把事情推给别人或一拖再拖）"},"examples":[{"en":"He kept fobbing the complaint off on another department.","zh":"他一直把投诉推给别的部门。"},{"en":"She tried fobbing him off, but he wouldn’t leave.","zh":"她想把他打发走，但他就是不走。"}]}],"synonyms":["deceiving","brushing off","palming off","fobbing off","passing off","dodging","stalling"],"phonetic":"/ˈfɑbɪŋ/","extraExplanation":["“fobbing”通常出现在短语动词 **fob off** / **fob … off on …** 中：\n- **fob someone off (with …)**：用（借口/次品等）敷衍、糊弄某人\n- **fob something off on someone**：把（麻烦/责任/差事）推给某人\n语气多为负面，暗示对方不诚实或不负责任。"]}
{"word":"fobs","summary":{"en":"“Fobs” can mean small key/watch attachments (plural), or it can be the verb “fobs,” meaning to deceive or brush someone off (often: fob off).","zh":"“Fobs”可指多个钥匙扣/表坠等小饰物（复数），也可作动词，表示欺骗或敷衍打发（常用：fob off）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small ornaments or attachments (often on a chain), especially one carried with a watch or keys (a “key fob”).","zh":"（常系在链子上随身携带的）小饰物；（尤指）表坠/钥匙扣（key fob）。"},"examples":[{"en":"He keeps his house key on a leather fob.","zh":"他把家门钥匙挂在一个皮质钥匙扣上。"},{"en":"The antique watch came with a decorative fob.","zh":"那块古董怀表带着一个装饰性的表坠。"}]},{"partOfSpeech":"v.","definition":{"en":"To trick someone or get rid of them by giving an excuse; to deceive or “fob off” (often used with “off”).","zh":"欺骗；用借口敷衍（常与 off 连用：fob off）。"},"examples":[{"en":"Don’t let him fob you off with empty promises.","zh":"别让他用空头承诺来敷衍你。"},{"en":"They tried to fob off the faulty product on customers.","zh":"他们想把有故障的产品骗卖给顾客。"}]}],"synonyms":["keychain","key ring","trinket","deceive","brush off","palms off"],"phonetic":"/fɑb/","extraExplanation":["“fobs” 可能是名词复数（多个 fob，如多个钥匙扣/饰物），也可能是动词第三人称单数（He fobs…）。","常见搭配：fob someone off（敷衍/打发某人）；fob something off on someone（把不好的东西硬塞/骗给某人）。","现代生活中最常见的是 “key fob”（汽车/门禁遥控钥匙扣），有时也直接指小型遥控器本体。"]}

