{"word":"FOCAC","summary":{"en":"FOCAC is the Forum on China–Africa Cooperation, a China–Africa cooperation platform.","zh":"FOCAC指中非合作论坛，是中非合作的重要机制与平台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Forum on China–Africa Cooperation: a formal platform (summits, ministerial meetings, and programs) for cooperation between China and African countries.","zh":"中非合作论坛：中非之间开展合作的正式平台（包括峰会、部长级会议及相关合作项目）。"},"examples":[{"en":"Leaders met at FOCAC to discuss trade, infrastructure, and public health.","zh":"各国领导人在中非合作论坛上讨论贸易、基础设施和公共卫生等议题。"},{"en":"The report summarizes the commitments announced at the latest FOCAC summit.","zh":"这份报告总结了最近一次中非合作论坛峰会发布的承诺。"}]}],"synonyms":["Forum on China–Africa Cooperation","China–Africa cooperation forum"],"phonetic":"/ˈfoʊkæk/","extraExplanation":["“FOCAC”是英文缩写，常见读法接近“FOH-kak”。它通常指中国与非洲国家在多边框架下进行政策沟通、经贸合作与人文交流的机制。","FOCAC通常以定期峰会/部长级会议形式推进合作议程，相关讨论可能涉及投资融资、债务可持续性、基础设施建设、教育培训与卫生合作等。阅读新闻时可注意其语境：有时强调合作机遇，有时也会出现对项目影响与透明度的讨论。"]}
{"word":"focaccia","summary":{"en":"Focaccia is an Italian olive-oil flatbread, often topped with herbs like rosemary.","zh":"Focaccia 是一种意大利橄榄油扁面包，常配迷迭香等香草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of Italian flatbread baked with olive oil, often topped with herbs (like rosemary) and sometimes vegetables or cheese.","zh":"意大利的一种扁面包（佛卡夏），烤制时会用橄榄油，常撒香草（如迷迭香），有时还会加蔬菜或奶酪作配料。"},"examples":[{"en":"We ordered focaccia with rosemary and sea salt as an appetizer.","zh":"我们点了迷迭香海盐佛卡夏当开胃菜。"},{"en":"She used warm focaccia to make a sandwich.","zh":"她用热乎的佛卡夏做了三明治。"},{"en":"The bakery’s focaccia is crispy on the outside and soft inside.","zh":"这家面包店的佛卡夏外脆里软。"}]}],"synonyms":["Italian flatbread","flatbread"],"phonetic":"/fəˈkɑːtʃə/","extraExplanation":["“Focaccia”来自意大利语，常被认为与拉丁语 *focus*（炉火、灶火）有关，暗示它是早期在炉边烤制的面饼。","在英语语境里，focaccia 通常指较厚、表面会按出凹点并淋橄榄油的扁面包；和 pizza dough 相似但更偏“面包感”，油香更明显。","在意大利不同地区做法差异很大：比如利古里亚（Liguria）的迷迭香佛卡夏很有代表性；有些版本会做得更松软或加入洋葱、橄榄等。"]}
{"word":"focal","summary":{"en":"Focal means central or most important; it’s also used for focus-related terms like “focal point” and “focal length.”","zh":"focal 表示“中心的、最重要的、焦点的”；也常用于与聚焦相关的术语，如 focal point（焦点）和 focal length（焦距）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The most important or central point of interest, attention, or activity.","zh":"最重要的；中心的；焦点所在的。"},"examples":[{"en":"Education is the focal issue in the election.","zh":"教育是这次选举的焦点议题。"},{"en":"The meeting’s focal point was how to cut costs without layoffs.","zh":"会议的核心焦点是如何在不裁员的情况下削减成本。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to focus, especially in how clearly something is seen (often used in photography/optics).","zh":"与“聚焦/焦点”有关的（尤用于摄影、光学，指清晰成像或对焦）。"},"examples":[{"en":"Adjust the focal length to zoom in.","zh":"调整焦距来放大画面。"},{"en":"The camera has a 50mm focal lens.","zh":"这台相机配有50毫米焦距的镜头。"}]},{"partOfSpeech":"n.","definition":{"en":"A central point or focus (often in the phrase “focal point”).","zh":"中心点；焦点（常用于“focal point”）。"},"examples":[{"en":"The fountain is the focal point of the garden.","zh":"喷泉是花园的视觉中心。"},{"en":"Her smile became the focal point of the portrait.","zh":"她的微笑成了这幅肖像的焦点。"}]}],"synonyms":["central","main","key","primary","core","crucial"],"phonetic":"/ˈfoʊkəl/","extraExplanation":["“focal”来自“focus（焦点/聚焦）”。日常英语里最常见的搭配是“focal point（焦点、中心）”，既可指抽象的“关注重点”，也可指具体空间里的“视觉中心”。","在正式写作中，用“focal”能让表达更凝练，例如“the focal issue / focal problem / focal concern（核心议题/问题/关注点）”。"]}
{"word":"focal depth","summary":{"en":"How deep the earthquake source is, or the depth/position of a focus in an optical system.","zh":"地震的震源有多深，或光学系统中焦点所在的深度/位置。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Seismology) The depth below Earth’s surface where an earthquake starts (the focus or hypocenter).","zh":"（地震学）地震开始发生的地下深度，即震源（震源点/震源位置）的深度。"},"examples":[{"en":"The earthquake had a focal depth of 10 kilometers, so it was considered shallow.","zh":"这次地震的震源深度为10公里，因此被认为是浅源地震。"},{"en":"Deeper focal depths usually cause less surface shaking than shallow ones of the same magnitude.","zh":"在震级相同的情况下，较深的震源深度通常比浅震引起的地表震动更弱。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Optics/Photography) The distance along the optical axis from a lens to the point where light converges; sometimes used loosely in place of “depth of focus.”","zh":"（光学/摄影）沿光轴从镜头到光线汇聚成清晰焦点的距离；有时也被不严格地用来指“焦深/景深相关概念”。"},"examples":[{"en":"Changing the lens position shifts the focal depth, bringing a different plane into focus.","zh":"改变镜头位置会改变焦点所在的深度，使不同的平面变清晰。"},{"en":"In microscopy, a small change in focal depth can reveal details at different layers of the sample.","zh":"在显微镜观察中，焦点深度的微小变化就能显示样品不同层面的细节。"}]}],"synonyms":["hypocentral depth","source depth","earthquake depth","focus depth","focal distance"],"phonetic":"/ˈfoʊkəl dɛpθ/","extraExplanation":["地震新闻里常说的“震源深度”通常就是 focal depth。一般把约0–70公里称为浅源地震，70–300公里为中源，300公里以上为深源（不同机构划分略有差异）。","摄影/光学里更常见的术语是 depth of focus（像方/成像面的“焦深”）和 depth of field（物方“景深”）。有些资料会把 focal depth 作为非严格说法使用，阅读时注意语境。"],"etymology":"由 focal（“焦点的”，来自 focus“焦点/中心”）+ depth（“深度”）组成；在不同学科中分别指“震源深度”或与成像系统“焦点位置/对焦深度”相关的概念。","mnemonic":["把 focal 想成“focus（对焦）”，depth 想成“深度”：对焦发生在“多深的地方”= 震源有多深/焦点在多深。","记忆搭配：地震=“震源深度”最常用；相机/显微镜=跟“对焦位置的深浅”有关。"]}
{"word":"focal epilepsy","summary":{"en":"Epilepsy with seizures that begin in one localized brain area.","zh":"发作起源于大脑局部区域的癫痫类型。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A type of epilepsy in which seizures start in one specific area (focus) of the brain; symptoms depend on the brain region involved and may or may not affect awareness.","zh":"一种癫痫类型：发作从大脑某个特定区域（病灶）开始；表现取决于受影响的脑区，可能影响也可能不影响意识。"},"examples":[{"en":"She was diagnosed with focal epilepsy after several brief seizures affecting her right hand.","zh":"在几次影响右手的短暂发作后，她被诊断为局灶性癫痫。"},{"en":"In focal epilepsy, seizures can cause unusual sensations, sudden emotions, or repetitive movements.","zh":"在局灶性癫痫中，发作可能引起异常感觉、突然情绪变化或重复性动作。"},{"en":"The doctor explained that focal epilepsy can sometimes spread and become a generalized seizure.","zh":"医生解释说，局灶性癫痫有时会扩散并发展为全面性发作。"}]}],"synonyms":["localized epilepsy","partial epilepsy","focal seizure disorder"],"phonetic":"/ˈfoʊkəl ˈɛpəˌlɛpsi/","extraExplanation":["在临床语境中，focal epilepsy 常与“focal seizure（局灶性发作）”一起出现。旧称 partial seizures（部分性发作），现在更常用 focal 这一说法。","局灶性发作可能表现为：局部抽动、麻刺/异味/幻听等感觉改变、短暂的发愣或自动症（如反复咂嘴、摸衣角）。若意识受影响，常称 focal impaired awareness seizure。","这是医学术语；若用于真实健康情境，最好让医生根据症状、脑电图（EEG）与影像检查综合判断。"],"etymology":"源自两部分：focal（“焦点的、局部的”，来自拉丁语 focus “炉灶/火堆”，引申为“中心、焦点”）+ epilepsy（“癫痫”，源自希腊语 epilēpsia，意为“突然发作/被袭击”）。医学上用来强调“发作起源于大脑局部”。","mnemonic":["focal = “focus（焦点）”的联想：发作从一个“焦点”开始。","记成“FOCus + epilepsy”：局部（焦点）起源的癫痫。"]}
{"word":"focal length","summary":{"en":"distance to the focus that determines a lens’s angle of view and magnification","zh":"决定镜头视角与放大程度的到焦点距离"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the distance from a lens or mirror to the point where light rays meet (the focus); it affects how wide or zoomed-in the image looks","zh":"（镜头或镜面）到光线汇聚成像点（焦点）的距离；会影响画面视角有多广、放大多少"},"examples":[{"en":"A 50 mm focal length is often considered close to a “natural” perspective on a full-frame camera.","zh":"在全画幅相机上，50毫米焦距常被认为接近“自然”的视角。"},{"en":"With a longer focal length, the subject looks bigger and the background seems closer.","zh":"焦距越长，被摄体看起来越大，背景也显得更近。"},{"en":"The telescope’s focal length determines how much it can magnify objects in the sky.","zh":"望远镜的焦距决定了它能把天空中的物体放大多少。"}]}],"synonyms":["lens focal length","focal distance"],"phonetic":"/ˈfoʊkəl lɛŋθ/","extraExplanation":["在摄影里，焦距通常用毫米（mm）表示。一般来说：焦距短（如 14–24mm）视角更广、画面更“广角”；焦距长（如 85–200mm）视角更窄、画面更“长焦/远摄”。","同一焦距在不同画幅（传感器尺寸）相机上视角会不同，因此常会提到“等效焦距”。","焦距影响视角与画面压缩感；而“背景虚化（景深）”还与光圈、拍摄距离、画幅等因素有关，不只由焦距决定。"],"etymology":"来自拉丁语 focus（“炉火、火点”），后来用于光学中表示“光线汇聚的点”；focal 表示“焦点的”，length 表示“长度/距离”，合起来就是“到焦点的距离”。","mnemonic":["把 focal 理解成“焦点的”，length 就是“长度/距离”→“到焦点的距离”。","联想“对焦(focus) + 距离(length)”：焦距=与对焦点相关的距离。"]}
{"word":"focalisation","summary":{"en":"Focalisation is a narratology term for the viewpoint or ‘lens’ through which a story’s information is filtered.","zh":"Focalisation 是叙事学术语，指故事信息通过哪位角色/视角被过滤与呈现的“聚焦点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In storytelling or film, the perspective through which the audience receives information—whose knowledge, feelings, and point of view shape what is shown or told.","zh":"（叙事学/影视）“聚焦点/视角”的安排：观众通过谁的认知、情感与立场来获取信息；故事被“谁的眼睛与理解”所过滤。"},"examples":[{"en":"The novel uses internal focalisation, so we only know what the main character knows.","zh":"这部小说采用“内聚焦”，所以我们只能知道主角所知道的信息。"},{"en":"The film shifts focalisation from the detective to the suspect halfway through.","zh":"电影在中途把聚焦点从侦探转移到嫌疑人身上。"},{"en":"Because of limited focalisation, the reader is surprised by the final twist.","zh":"由于聚焦点受限，读者在结尾反转时会感到意外。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of bringing attention to a central point; focusing.","zh":"（较少见）使注意力集中在某一点上的过程；聚焦。"},"examples":[{"en":"The focalisation of the discussion on safety helped the team make a decision.","zh":"把讨论聚焦在安全问题上，帮助团队做出了决定。"}]}],"synonyms":["point of view (POV)","perspective","narrative viewpoint","focus","lens"],"phonetic":"/ˌfoʊkələˈzeɪʃən/","extraExplanation":["“focalisation”（英式拼写）常见于文学批评与叙事学；美式拼写更常见的是“focalization”。日常英语里，人们更可能说“point of view (POV)”“perspective”“focus”。","常见类型：内聚焦（internal：紧跟某个角色的感受与认知）、外聚焦（external：像镜头一样只描述可观察到的行为，不进入内心）、零聚焦（zero：类似全知视角，叙述者知道得比角色多）。这个概念常与法国叙事学家 Genette（热奈特）的分析框架一起出现。","文学/影视讨论中常把“who speaks（谁在讲）”与“who sees/knows（通过谁在看/知道）”区分开：前者更接近“narrator（叙述者）”，后者就是“focalisation（聚焦点/视角过滤器）”。"]}
{"word":"focalise","summary":{"en":"Focalise means to focus attention on something, or (in narrative theory) to tell/show a story from a particular character’s perspective.","zh":"Focalise 指把注意力聚焦到某事上；在叙事理论中也指以某个角色的视角来呈现故事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(British spelling) to focus attention on something; to make something become the center of interest or activity.","zh":"（英式拼写）把注意力集中在某事上；使某事成为关注或活动的中心。"},"examples":[{"en":"The discussion gradually focalised on the cost of the project.","zh":"讨论逐渐把焦点集中在项目成本上。"},{"en":"Her speech focalised public anger toward the new policy.","zh":"她的演讲把公众的愤怒聚焦到新政策上。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Literary/film theory) to present a story through a particular character’s perspective or point of view (also written as “focalize”).","zh":"（文学/电影理论）通过某个角色的视角来呈现叙事（也写作 focalize）。"},"examples":[{"en":"The novel is focalised through the child narrator, so we only know what the child understands.","zh":"这部小说以儿童叙述者为焦点来展开，所以我们只知道孩子能理解的内容。"},{"en":"In the film, the camera focalises the events through the detective’s eyes.","zh":"在这部电影中，镜头通过侦探的视角来聚焦事件。"}]}],"synonyms":["focus","center","concentrate","highlight","direct","focalize"],"phonetic":"/ˈfoʊkəˌlaɪz/","extraExplanation":["“focalise”是英式拼写；美式更常见“focalize”。在学术写作（尤其是叙事学）里，“focalisation/focalization（聚焦/视角化）”常用来区分“谁在看/感知（视角）”与“谁在讲述（叙述者）”。"]}
{"word":"focalised","summary":{"en":"Focalised means “focused” or “made to focus,” especially in British spelling.","zh":"focalised 意为“被聚焦的/被集中起来的”，多为英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Brought into clear focus; concentrated on one main point, place, or issue.","zh":"被聚焦的；集中在某一点/某个核心问题上的。"},"examples":[{"en":"After the accident, the discussion became focalised on road safety.","zh":"事故之后，讨论就聚焦在道路安全上。"},{"en":"The camera’s light is focalised on the actor’s face.","zh":"镜头的光线聚焦在演员的脸上。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “focalise”: to focus attention, effort, or light on something.","zh":"“focalise”的过去式/过去分词：使（注意力、精力或光线）聚焦于某物。"},"examples":[{"en":"The report focalised public attention on housing costs.","zh":"这份报告使公众注意力聚焦在住房成本上。"},{"en":"They focalised their efforts on improving customer service.","zh":"他们把精力集中在提升客户服务上。"}]}],"synonyms":["focused","concentrated","centered","targeted"],"phonetic":"/ˈfoʊkəˌlaɪzd/","extraExplanation":["“focalised”是英式拼写；美式更常写作“focalized”。意思相同，只是拼写习惯不同。","在文学/叙事分析里，相关术语“focalisation / focalization（聚焦/视角聚焦）”指故事信息是通过谁的视角被呈现出来的（例如“通过孩子的视角叙述”）。"]}
{"word":"focalises","summary":{"en":"“Focalises” means “focuses” (UK spelling): it makes something the main point, or in storytelling it presents events from a particular character’s viewpoint.","zh":"“focalises”相当于“focuses”（英式拼写）：指把重点放在某事上；在叙事中也可指从某个角色的视角来呈现内容。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “focalise”) to focus attention, effort, or resources on one thing; to make something the main point.","zh":"（focalise 的第三人称单数）把注意力、精力或资源集中在某件事上；使某事成为重点。"},"examples":[{"en":"The report focalises on three key risks: cost, safety, and timing.","zh":"这份报告聚焦于三个关键风险：成本、安全和时间安排。"},{"en":"Her question focalises the discussion on what really matters.","zh":"她的问题把讨论拉回到真正重要的点上。"}]},{"partOfSpeech":"vt.","definition":{"en":"(in writing, film, or literary studies) to present a story or scene through a particular character’s point of view.","zh":"（写作/影视/文学研究）通过某个角色的视角来呈现故事或场景。"},"examples":[{"en":"The novel focalises the war through a young nurse’s experience.","zh":"这部小说通过一位年轻护士的经历来呈现战争。"},{"en":"In this chapter, the narration focalises on the child, so we only know what he notices.","zh":"这一章叙述聚焦在孩子身上，所以我们只知道他注意到的东西。"}]}],"synonyms":["focuses","centers on","concentrates on","highlights","zeroes in on"],"phonetic":"/ˈfoʊkəˌlaɪzɪz/","extraExplanation":["“focalises”是英式拼写；美式更常写作“focalizes”。两者意思相同。","在叙事学里，focalise/focalize 常与“叙述者（narrator）”区分：narrator 是“谁在讲”，focalisation 是“谁在看/从谁的视角感知”。"]}
{"word":"focalising","summary":{"en":"Focalising means focusing attention on something, or (in storytelling) showing events from a particular viewpoint.","zh":"Focalising 指把注意力集中到某事上；在叙事中也指从特定人物的视角来呈现事件。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of focalise/focalize) directing attention to a particular point, issue, or goal; focusing.","zh":"（focalise/focalize 的现在分词）把注意力集中到某一点/某个问题或目标上；聚焦。"},"examples":[{"en":"We’re focalising on customer safety before adding new features.","zh":"在增加新功能之前，我们先把重点聚焦在客户安全上。"},{"en":"The teacher is focalising students’ attention on the main idea of the paragraph.","zh":"老师正把学生的注意力集中在段落的主旨上。"}]},{"partOfSpeech":"v.","definition":{"en":"(literature/film) presenting events from a particular character’s perspective or viewpoint (who “sees” or experiences the story).","zh":"（文学/影视）从某个角色的视角来呈现事件（由谁“看见”或经历故事）。"},"examples":[{"en":"The novel is focalising the story through the child narrator.","zh":"这部小说通过孩子叙述者的视角来呈现故事。"},{"en":"In this scene, the camera is focalising our attention through the detective’s eyes.","zh":"在这一幕里，镜头通过侦探的视角引导我们的注意力。"}]}],"synonyms":["focusing","concentrating","highlighting","emphasizing","centering","framing (in storytelling)"],"phonetic":"/ˈfoʊkəˌlaɪzɪŋ/","extraExplanation":["“focalising”是英式拼写；美式更常见“focalizing”。两者意思相同。","在叙事学里，“focalisation/focalization（聚焦/视角化）”常用来区分“谁在看（视角）”与“谁在说（叙述者）”。因此它不仅是“强调重点”，也指“通过谁的感受与信息来讲故事”。"]}
{"word":"focalization","summary":{"en":"Focalization means the perspective or “lens” that filters what the audience learns in a story (and, more generally, the act of focusing attention).","zh":"focalization 指故事中信息与体验由哪个视角来“过滤/呈现”（也可泛指“聚焦”的过程）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In storytelling (narratology), the lens or point of view through which a story’s events and information are presented—what the reader is allowed to see, know, and feel.","zh":"（叙事学）“聚焦/视角化”：故事通过谁的视角来呈现事件与信息——读者能看到、知道与感受到什么。"},"examples":[{"en":"The novel’s focalization shifts from the child to the mother in the final chapter.","zh":"小说在最后一章把聚焦从孩子转到母亲身上。"},{"en":"Even in third-person narration, the focalization stays close to the detective’s thoughts.","zh":"即使是第三人称叙述，聚焦仍紧贴侦探的内心想法。"},{"en":"Limited focalization creates suspense because the reader learns only what the character learns.","zh":"有限聚焦会制造悬念，因为读者只能知道角色所知道的。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, the act or process of bringing attention to a particular element; focusing.","zh":"更一般地说：把注意力集中到某个要素上的行为或过程；聚焦。"},"examples":[{"en":"The focalization on safety improved the team’s decision-making.","zh":"对安全的聚焦提升了团队的决策质量。"},{"en":"In the discussion, her focalization was on the most urgent problem.","zh":"在讨论中，她的聚焦点是最紧迫的问题。"}]}],"synonyms":["point of view (POV)","perspective","lens","focus","viewpoint"],"phonetic":"/ˌfoʊkəlaɪˈzeɪʃən/","extraExplanation":["“focalization”是叙事学常用术语，常与“narration（叙述）”区分：narration强调“谁在讲”（叙述者），focalization强调“谁在看/谁的意识在过滤信息”（感知者/视角）。","常见分类：\n- internal focalization（内聚焦）：信息受某个角色的认知限制（类似“有限视角”）。\n- external focalization（外聚焦）：只呈现可观察到的外在行为，不进入人物内心。\n- zero focalization（零聚焦/全知）：信息不受角色限制，接近“全知叙述”。","该词来自“focus（焦点）”，多用于文学批评、电影研究、叙事分析等学术语境；日常英语更常说“point of view (POV)”或“perspective”。"]}
{"word":"focalize","summary":{"en":"Focalize means to focus on a main point, to bring something into clear focus (optics), or (in literature) to present events through a particular character’s viewpoint.","zh":"Focalize 可指把重点集中到某一点上、（光学/摄影）对焦使清晰，或（文学研究）用某个角色的视角来呈现故事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To focus attention, effort, or discussion on one main point; to make something the center of interest.","zh":"把注意力、精力或讨论集中在一个重点上；使某事成为关注的中心。"},"examples":[{"en":"The meeting will focalize on improving customer service.","zh":"这次会议将把重点放在提升客户服务上。"},{"en":"Her speech focalized public attention on the problem.","zh":"她的演讲把公众的注意力集中到这个问题上。"}]},{"partOfSpeech":"v.","definition":{"en":"To bring into sharp focus (especially an image or lens setting); to adjust so something becomes clear.","zh":"（尤指影像或镜头）对焦；使画面/对象变得清晰。"},"examples":[{"en":"Focalize the camera on the child’s face before taking the photo.","zh":"拍照前先把镜头对焦在孩子的脸上。"},{"en":"It takes a moment for the microscope to focalize.","zh":"显微镜需要一点时间才能对焦清晰。"}]},{"partOfSpeech":"vt.","definition":{"en":"In literary studies, to present a story through a particular character’s perspective (a chosen “viewpoint”).","zh":"（文学研究）通过某个角色的视角来呈现故事（选择特定“叙述视点”）。"},"examples":[{"en":"The novel is mostly focalized through the daughter’s eyes.","zh":"这部小说大多通过女儿的视角来叙述。"},{"en":"The writer switches to focalize the scene through a new character.","zh":"作者切换视角，用一个新角色来“聚焦”这一场景。"}]}],"synonyms":["focus","center on","concentrate on","highlight","sharpen (optics)"],"phonetic":"/ˈfoʊkəˌlaɪz/","extraExplanation":["“focalize”在日常英语里不算常用，更常见的说法是 focus on（把重点放在……）或 concentrate on（集中于……）。","在叙事学（narratology）里，“focalize”常用于分析“谁在看/谁在感知”故事：例如同一事件可以通过不同人物的感受与信息范围来呈现，这会改变读者理解。","与“narrate（叙述）”不同，“focalize”强调的是视角与感知中心，不一定等同于“谁在讲述”。"]}
{"word":"focalized","summary":{"en":"Focalized means either ‘in sharp focus’ (optics) or ‘presented through a specific character’s viewpoint’ (storytelling).","zh":"focalized 可指“对好焦、清晰聚焦”（光学/摄影），也可指“通过特定角色视角来呈现/叙述”（文学影视）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Photography/optics) Adjusted so that the image is in clear focus; focused.","zh":"（摄影/光学）已调整到清晰焦点的；对好焦的。"},"examples":[{"en":"The microscope image is properly focalized, so the cells look sharp.","zh":"显微镜图像已经对好焦，所以细胞看起来很清晰。"},{"en":"Once the camera was focalized, she took the portrait.","zh":"相机对好焦后，她拍下了那张肖像照。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literature/film) Told or shown through a particular character’s perspective (a “point of view”).","zh":"（文学/电影）通过某个角色的视角来叙述或呈现的（“视角化”的）。"},"examples":[{"en":"The novel is focalized through the child narrator, so we only know what the child understands.","zh":"这部小说以孩子叙述者的视角来呈现，所以我们只能知道孩子能理解到的内容。"},{"en":"In this focalized scene, the audience experiences the fear as the main character does.","zh":"在这个视角化的场景里，观众像主角一样体验到恐惧。"}]}],"synonyms":["focused","in focus","sharpened","point-of-view (POV)","perspectival"],"phonetic":"ˈfoʊkəˌlaɪzd","extraExplanation":["“focalized”来自动词“focalize”（使聚焦/使以某视角呈现）。在叙事学里常见的是名词“focalization（视角化）”，常用来区分“谁在看/感知”（视角）与“谁在说”（叙述者）并不一定相同。这个用法常与法国叙事学家热奈特（Gérard Genette）的理论相关。"]}
{"word":"focalizes","summary":{"en":"“Focalizes” means “focuses/centers on,” and in storytelling it can mean presenting events through a particular character’s viewpoint.","zh":"“focalizes”表示“把……聚焦/集中在……上”；在叙事中也可指“以某个角色的视角来呈现故事”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to focus attention, discussion, or effort on one main point; to make something the center of interest","zh":"把注意力、讨论或努力集中在某一点上；使某事成为焦点"},"examples":[{"en":"The news report focalizes public attention on rising rent prices.","zh":"这则新闻报道把公众注意力集中在房租上涨上。"},{"en":"Her speech focalizes the debate on safety rather than politics.","zh":"她的演讲把辩论焦点放在安全而不是政治上。"}]},{"partOfSpeech":"v.","definition":{"en":"(literature/film) to present a story or scene from a particular character’s point of view; to use a specific perspective to filter what the audience knows","zh":"（文学/影视）以某个角色的视角来叙述或呈现场景；用特定视角“过滤”观众能知道的信息"},"examples":[{"en":"The novel often focalizes events through the child narrator, so adults’ motives stay unclear.","zh":"这部小说常通过孩子叙述者的视角来呈现事件，所以大人的动机不太清楚。"},{"en":"The camera work focalizes the chase through the hero’s eyes.","zh":"镜头语言把追逐戏集中在主角的视角上。"}]},{"partOfSpeech":"v.","definition":{"en":"(optics/photography) to bring into focus; to adjust so an image becomes clear","zh":"（光学/摄影）使成像对焦清晰；调整焦距使画面变清楚"},"examples":[{"en":"She focalizes the microscope on the sample before taking notes.","zh":"她先把显微镜对焦到样本上再做记录。"}]}],"synonyms":["focuses","centers on","highlights","concentrates on","zeroes in on"],"phonetic":"/ˈfoʊkəˌlaɪz/","extraExplanation":["“focalizes”是动词“focalize”的第三人称单数（he/she/it focalizes）。英式拼写也常见“focalise”。","在叙事学里，“focalization（聚焦/视角化）”区分“谁在看/谁的感知在主导”（视角）与“谁在说”（叙述者）。例如：同一个叙述者也可能用不同角色的视角来focalize不同段落。"]}
{"word":"focalizing","summary":{"en":"Focalizing means focusing attention on a main point, making something (like an image) come into focus, or (in storytelling) presenting events through a specific viewpoint.","zh":"Focalizing 指把注意力集中到重点上、使图像等清晰对焦，或（在叙事中）用特定角色/视角来呈现故事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"bringing attention, effort, or activity to one main point; focusing","zh":"把注意力、精力或活动集中到一个重点上；聚焦"},"examples":[{"en":"The meeting is focalizing on the budget cuts for next year.","zh":"会议正把重点聚焦在明年的预算削减上。"},{"en":"She is focalizing her research on childhood nutrition.","zh":"她把研究重点聚焦在儿童营养上。"}]},{"partOfSpeech":"v.","definition":{"en":"making something clearer or sharper (for example, an image or a lens); bringing into focus","zh":"使（图像、镜头等）更清晰；对焦"},"examples":[{"en":"The camera is focalizing on the bird’s eye as it moves.","zh":"镜头正在对焦那只鸟的眼睛。"},{"en":"Adjust the microscope slowly until the cells are focalizing clearly.","zh":"慢慢调显微镜，直到细胞清晰对焦为止。"}]},{"partOfSpeech":"v.","definition":{"en":"(literature/film) presenting a story through a particular character’s viewpoint; setting the perspective of what the audience knows and notices","zh":"（文学/影视）通过某个角色的视角来呈现叙事；设定观众“看到/知道”的范围"},"examples":[{"en":"The novel is focalizing the war through a child’s eyes.","zh":"这部小说用一个孩子的视角来呈现战争。"},{"en":"By focalizing on the detective, the film hides what other characters are doing.","zh":"影片聚焦侦探的视角，因此隐藏了其他角色在做什么。"}]}],"synonyms":["focusing","concentrating","highlighting","zeroing in (on)","bringing into focus"],"phonetic":"/ˈfoʊkəˌlaɪzɪŋ/","extraExplanation":["“focalizing”是动词“focalize”的现在分词/动名词形式。日常写作里更常见的是“focus on”。“focalize”更偏学术或正式语体。","叙事学里“focalization（聚焦/视角化）”常用来讨论“谁在看、谁知道多少”（视角）而不只是“谁在讲”（叙述者）。这个概念常与法国叙事学家热拉尔·热奈特（Gérard Genette）的分析框架相关。"]}
{"word":"focally","summary":{"en":"Focally means “at a focal point” or “in a localized, limited area,” especially in medical or technical writing.","zh":"focally 表示“在焦点处/围绕焦点”或“局部地、局灶性地”，多用于医学或技术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is related to a focus or focal point; centrally or at the main point of attention (often used in technical/medical contexts).","zh":"以与焦点/焦点中心有关的方式；在中心或主要关注点上（常见于技术或医学语境）。"},"examples":[{"en":"The pain was felt focally in the lower right abdomen.","zh":"疼痛主要集中在右下腹。"},{"en":"The camera adjusts focally to keep the subject sharp.","zh":"相机会在焦点上进行调整，以保持主体清晰。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a specific local area rather than throughout; locally or in a limited region (common in medicine: “focally distributed”).","zh":"局部地、在有限区域内（医学中常说“局灶性分布”）。"},"examples":[{"en":"Inflammation was present focally, not diffusely.","zh":"炎症是局部存在的，并非弥漫性。"},{"en":"The forest was damaged focally by the storm, not everywhere.","zh":"暴风雨对森林的破坏是局部的，并非到处都是。"}]}],"synonyms":["locally","centrally","specifically","in a localized way"],"phonetic":"/ˈfoʊkəli/","extraExplanation":["“focally”在日常口语中不算常见，更常出现在医学影像/病理报告或光学、摄影等技术文字里：例如“focally increased signal（局灶性信号增高）”“focally positive（局部阳性）”。","和“centrally”不同，“focally”强调“围绕某个焦点/局部点”而不是“在整体中心位置”；和“locally”相比，“focally”更有“像一个点/小灶一样集中”的感觉。"]}
{"word":"focaloid","summary":{"en":"Vocaloid is a voice-synth technology and community known for virtual singers like Hatsune Miku; it can also mean a song made with those voices.","zh":"Vocaloid 指歌声合成技术及其文化圈（如初音未来等虚拟歌手），也可指用这些音源制作的歌曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a singing voice synthesizer technology and the related music community, best known for virtual singers (voicebanks) like Hatsune Miku.","zh":"一种歌声合成（人声合成）技术及其相关音乐文化圈，最有名的是像初音未来等“虚拟歌手”（音源库）。"},"examples":[{"en":"She makes Vocaloid songs and posts them on YouTube.","zh":"她创作 Vocaloid 歌曲并发布到 YouTube。"},{"en":"Hatsune Miku is one of the most famous Vocaloid voices.","zh":"初音未来是最知名的 Vocaloid 音源之一。"},{"en":"The Vocaloid community often shares remixes, lyrics, and covers online.","zh":"Vocaloid 社群常在网上分享混音、歌词和翻唱。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) a song made using Vocaloid voicebanks.","zh":"（引申）用 Vocaloid 音源制作的歌曲。"},"examples":[{"en":"That track is a classic Vocaloid from the 2010s.","zh":"那首歌是 2010 年代很经典的一首 Vocaloid 作品。"},{"en":"I’m looking for upbeat Vocaloids to study to.","zh":"我在找适合学习时听的轻快 Vocaloid 歌。"}]}],"synonyms":["singing synthesizer","voice synthesizer","virtual singer (informal)"],"phonetic":"/ˈvoʊkəˌlɔɪd/","extraExplanation":["“Vocaloid”是雅马哈（Yamaha）的注册商标，常写作首字母大写；日常对话里也有人用小写“vocaloid”泛指这一类作品或圈子。","你输入的“focaloid”多半是拼写误差：英文里常见的是“Vocaloid”。另外“focal”是“焦点的”，意思完全不同。"]}
{"word":"foci","summary":{"en":"Foci is the plural of focus, meaning multiple points of attention or (in math/science) multiple focal points.","zh":"Foci 是 focus 的复数，表示多个“重点/关注点”，或（数学/科学中）多个“焦点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of focus; the main centers of attention, interest, or activity.","zh":"focus 的复数；注意力、兴趣或活动的主要焦点/中心。"},"examples":[{"en":"In this course, the main foci are reading and speaking.","zh":"在这门课里，主要的重点是阅读和口语。"},{"en":"The meeting has two foci: safety and cost.","zh":"这次会议有两个重点：安全和成本。"}]},{"partOfSpeech":"n.","definition":{"en":"In science and math, the plural of focus: the points where rays meet (optics) or special points related to a curve (e.g., an ellipse has two foci).","zh":"（科学/数学）focus 的复数；（光学）光线汇聚的点；（几何）曲线的特殊点（如椭圆有两个焦点）。"},"examples":[{"en":"A lens can have different foci depending on the distance.","zh":"镜头会因距离不同而有不同的焦点。"},{"en":"An ellipse is defined by two foci.","zh":"椭圆由两个焦点来定义。"}]}],"synonyms":["centers","focal points","points of emphasis","main concerns"],"phonetic":"/ˈfoʊ.saɪ/","extraExplanation":["“Foci”读写上是拉丁语复数形式（focus → foci）。在日常英语里，人们更常用规则复数“focuses”，尤其在“重点/关注点”这个意思上；但在数学、物理等学术语境里，“foci”非常常见且更显正式。","文学或正式写作中也可能用“the foci of the novel”表示“小说的多个关注中心/主题焦点”。"]}
{"word":"focimeter","summary":{"en":"A device used to measure the strength (optical power) of lenses, especially for eyeglasses.","zh":"用于测量镜片屈光度（度数/光学强度）的仪器，常见于验光与配镜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the optical power (strength) of eyeglass or contact lenses, often in optometry.","zh":"（验光用）焦度计；用于测量眼镜或隐形眼镜镜片的光学屈光度（镜片“度数/强度”的仪器）。"},"examples":[{"en":"The optician used a focimeter to check the prescription of my glasses.","zh":"验光师用焦度计检查了我眼镜的度数。"},{"en":"Before fitting the new lenses, the clinic measured them with a focimeter.","zh":"在装配新镜片前，诊所先用焦度计测量了镜片参数。"}]}],"synonyms":["lensmeter","lensometer"],"phonetic":"/foʊˈsɪmɪtər/","extraExplanation":["“Focimeter”在英式与一些专业语境中更常见；在美式英语里更常用的说法是“lensmeter”。两者通常指同一种设备，用来测量镜片的屈光度（diopter）、散光轴位等基本参数。"]}
{"word":"focimetry","summary":{"en":"Focimetry means measuring the focal power of lenses, especially eyeglass lenses.","zh":"focimetry 指对镜片（尤其眼镜镜片）的焦度/屈光度进行测量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of a lens’s focal power (especially for eyeglass or contact lenses).","zh":"（尤指眼镜或隐形眼镜镜片的）焦度/屈光度测量。"},"examples":[{"en":"Focimetry is used to check whether a pair of glasses matches the prescription.","zh":"焦度测量用于检查一副眼镜是否符合处方。"},{"en":"The lab performed focimetry on the lenses before shipping the order.","zh":"实验室在发货前对镜片进行了焦度测量。"}]}],"synonyms":["lensometry","lens measurement","lensmeter measurement"],"phonetic":"/foʊˈsɪmətri/","extraExplanation":["“focimetry”常见于验光/眼镜加工领域，常用工具是“lensmeter / focimeter（焦度计）”，用来测量镜片的球镜度数、柱镜度数和轴位等信息。","词源上与“focus（焦点）”相关；在日常英语里更常听到的是“lensometry”或“lensmeter measurement”，而“focimetry”更偏专业/书面。"]}
{"word":"fockle","summary":{"en":"“Fockle” is an informal/variant spelling of “forecastle,” meaning the front part of a ship (often crew quarters).","zh":"“fockle” 是 “forecastle（船首楼）” 的非正式/变体拼写，指船的前部区域（常为船员住处）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) The forecastle: the forward part of a ship, often where the crew’s living quarters are located.","zh":"（航海用语）船首楼；船的前部区域，常用于船员居住或存放设备。"},"examples":[{"en":"The sailors went back to the fockle after their watch ended.","zh":"值班结束后，水手们回到船首楼休息。"},{"en":"In old sea stories, the fockle is where the crew often eats and sleeps.","zh":"在旧时的海上故事里，船员常在船首楼吃饭睡觉。"}]}],"synonyms":["forecastle","fo'c'sle","focsle"],"phonetic":"/ˈfoʊk.səl/","extraExplanation":["“fockle” 多见于口语或方言式拼写，是 “forecastle” 的俗写/变体；在文学或海员口语里也常写作 “fo'c'sle” 或 “focsle”。","发音上常读作 “FOHK-səl”，与拼写差异很大，这是海事英语里一个常见的历史遗留现象。"]}
{"word":"focoids","summary":{"en":"Focoids are true seals (phocids), animals in the family Phocidae.","zh":"focoids 指真海豹（海豹科 Phocidae）的动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) True seals; animals in the seal family Phocidae.","zh":"（复数）真海豹；指海豹科（Phocidae）的动物。"},"examples":[{"en":"Focoids are well adapted to life in cold oceans.","zh":"真海豹很适应寒冷海域的生活。"},{"en":"Many focoids haul out on ice to rest and raise their pups.","zh":"许多真海豹会爬上冰面休息并哺育幼崽。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) Things related to true seals (phocids).","zh":"（较少见）与真海豹（海豹科）有关的事物。"},"examples":[{"en":"The museum has several focoid specimens.","zh":"博物馆里有几件真海豹相关的标本。"}]}],"synonyms":["phocoids","phocids","true seals"],"phonetic":"ˈfoʊkɔɪdz","extraExplanation":["“focoids”在英文中非常少见；更常见、更标准的拼写是 **phocoids**（源自 Phocidae / Phocoidea）。如果你是在学术文章、分类学或古生物资料里看到它，通常是在谈“真海豹”这一类群。","“true seals（真海豹）”与“sea lions（海狮）/fur seals（海狗）”常被对比：真海豹没有外耳廓，主要靠后肢与身体摆动在陆地上移动，水中游泳更依赖后肢与躯干。"]}
{"word":"focometer","summary":{"en":"A focometer is a device that measures a lens’s focal length or optical power, often used in optometry and eyewear labs.","zh":"focometer（焦度计）是测量镜片焦距或屈光度的仪器，常用于验光与配镜检测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the focal length or optical power of a lens (for example, eyeglass or contact lenses).","zh":"焦度计；用于测量镜片的焦距或屈光度（光学度数）的仪器（如眼镜片或隐形眼镜）。"},"examples":[{"en":"The optician used a focometer to check the prescription of my glasses.","zh":"验光师用焦度计检查我眼镜的处方度数。"},{"en":"Before fitting new lenses, the lab measures each lens with a focometer.","zh":"在装配新镜片前，实验室会用焦度计测量每一片镜片。"}]}],"synonyms":["focimeter","lensmeter"],"phonetic":"/foʊˈkɑːmɪtər/","extraExplanation":["“focometer”在专业领域也常写作“focimeter”。在配镜与眼视光行业里，更常见的名称是“lensmeter（镜度计/焦度计）”。","它通常用于读取镜片的屈光度（如 -2.00D）、柱镜度数与轴位等参数，用来核对处方或检验镜片是否符合标准。"]}
{"word":"focometry","summary":{"en":"Focometry means measuring a lens’s optical power (prescription), usually with a focometer/lensmeter.","zh":"focometry 指用焦度计/验镜仪测量镜片的光学度数（处方参数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of the optical power (especially the focusing power) of eyeglass lenses or other lenses; the practice of testing lenses with a focometer (lensmeter).","zh":"（验光/配镜领域）测定镜片等透镜的光学度数（尤其是屈光度/聚焦能力）；用焦度计（验镜仪、lensmeter）检测镜片的过程。"},"examples":[{"en":"The optician used focometry to confirm the prescription in the old glasses.","zh":"验光师用焦度测量来确认旧眼镜的度数。"},{"en":"After lens grinding, focometry checks whether the final lens power matches the order.","zh":"镜片磨制后，会用焦度测量检查最终度数是否符合订单。"}]}],"synonyms":["lensometry","lens measurement","lensmeter reading"],"phonetic":"/foʊˈkɑːmətri/","extraExplanation":["“Focometry”属于较专业的术语，日常英语里更常见的是“lensometry”或直接说“measure the lens power / check the prescription”。","相关仪器常叫“focometer”或“lensmeter”，用于读取镜片的球镜度数（sphere）、柱镜度数（cylinder）和轴位（axis）等参数。"]}
{"word":"focsle","summary":{"en":"“focsle / fo’c’sle” means the forecastle—the front part of a ship, often sailors’ quarters.","zh":"“focsle / fo’c’sle”指“forecastle（船首楼）”，即船的前部，常为水手居住区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) The forecastle: the forward part of a ship, often where sailors’ living quarters are located.","zh":"（航海）船首楼；船的前部（常指水手住的舱区）。"},"examples":[{"en":"The sailors slept in the fo’c’sle during the long voyage.","zh":"在漫长的航程中，水手们睡在船首楼里。"},{"en":"He went up to the fo’c’sle to check the lines.","zh":"他走到船首楼去检查缆绳。"}]}],"synonyms":["forecastle","fo'c'sle"],"phonetic":"ˈfoʊksəl","extraExplanation":["“fo’c’sle”是“forecastle”的口语/航海缩写写法，常见于海事小说、航海日志和电影台词中，体现水手口音与行话。","读音里省略了中间音节，所以看起来像拼写错误，但它是固定用法。也常写作“fo'c'sle”或“focsle”。"]}
{"word":"focus","summary":{"en":"“Focus” means to concentrate attention, or the main point/center of attention; it can also describe something clear and sharp (in focus).","zh":"“focus”表示“专注/集中注意力”，也可作名词表示“重点/焦点”，还可形容“（画面）清晰对焦”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To give your full attention to one person, task, or idea; to concentrate.","zh":"把全部注意力放在某人、某事或某个想法上；专注、集中注意力。"},"examples":[{"en":"Please focus on the main point of the story.","zh":"请专注于故事的要点。"},{"en":"I can’t focus when the music is too loud.","zh":"音乐太吵时我没法专心。"},{"en":"Let’s focus on what we can control.","zh":"让我们把注意力放在我们能控制的事情上。"}]},{"partOfSpeech":"n.","definition":{"en":"The center of attention or effort; the main point or topic.","zh":"注意力或努力的中心；焦点、重点、主题。"},"examples":[{"en":"Safety is the focus of today’s meeting.","zh":"安全是今天会议的重点。"},{"en":"The camera kept the singer in focus.","zh":"镜头一直把歌手对准焦点（成像清晰）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Clear and sharp (especially of an image); not blurry.","zh":"（尤指画面）清晰的、对焦准确的；不模糊的。"},"examples":[{"en":"The picture is finally in focus.","zh":"这张照片终于清晰了（对焦了）。"},{"en":"The text looks out of focus on this screen.","zh":"这屏幕上的文字看起来有点虚（没对上焦）。"}]}],"synonyms":["concentrate","center","attention","emphasis","spotlight"],"phonetic":"/ˈfoʊkəs/","extraExplanation":["“focus”原意与光学有关，指“焦点/对焦”。后来引申到学习与工作语境中，表示“把注意力集中到某处”。常见搭配：focus on（专注于）；focus your attention/energy on（把注意力/精力放在……）；stay focused（保持专注）；lose focus（走神）；in focus / out of focus（清晰/模糊）。"]}
{"word":"focus ... on","summary":{"en":"give attention to or emphasize something","zh":"专注于；把重点放在……上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give your attention to something; to concentrate on it","zh":"把注意力放在某事上；专注于"},"examples":[{"en":"Try to focus on your breathing for one minute.","zh":"试着把注意力放在呼吸上持续一分钟。"},{"en":"In class, it’s hard to focus on the lesson when you’re tired.","zh":"疲惫时在课堂上很难专注听课。"},{"en":"She focused on improving her pronunciation.","zh":"她专注于提升发音。"}]},{"partOfSpeech":"phrase","definition":{"en":"to emphasize or discuss one main thing (instead of many things)","zh":"把重点放在某方面；围绕某个核心点展开"},"examples":[{"en":"This report focuses on customer satisfaction.","zh":"这份报告重点关注客户满意度。"},{"en":"Let’s focus on solutions, not problems.","zh":"我们把重点放在解决方案上，而不是问题上。"}]}],"synonyms":["concentrate on","center on","zero in on","pay attention to","emphasize","keep your mind on"],"phonetic":"/ˈfoʊkəs ɑn/","extraExplanation":["常见搭配：focus on + 名词/动名词（-ing）。如：focus on studying（专注学习）。","近义表达对比：concentrate on 更强调“集中精力”；focus on 既可指“专注”，也常用于“强调/聚焦某话题”。"],"etymology":"“focus”来自拉丁语 focus，原意是“炉灶、火炉”，引申为“中心点”。后来在光学中表示“焦点”，再引申为“注意力的中心”。加上介词 on，表示“把注意力/重点放在……上”。","mnemonic":["把 focus 想成“对焦/焦点（焦）”，on 是“在……上”→ “把焦点放在……上”。","联想中文：聚焦=聚（集中）+焦（焦点），所以 focus on = “聚焦在……”"]}
{"word":"focus ... on ...","summary":{"en":"concentrate attention or effort on something","zh":"把注意力或精力集中在某事上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give most of your attention, effort, or interest to something; to concentrate on something","zh":"把主要注意力、精力或兴趣放在某事上；专注于某事"},"examples":[{"en":"Try to focus on your breathing for one minute.","zh":"试着把注意力集中在呼吸上一分钟。"},{"en":"The report focuses on customer satisfaction.","zh":"这份报告重点关注客户满意度。"},{"en":"Instead of blaming others, focus on what you can change.","zh":"与其责怪别人，不如专注于你能改变的事情。"}]},{"partOfSpeech":"phrase","definition":{"en":"to aim a camera, lens, or light so that something appears clear and sharp","zh":"（相机/镜头/灯光）对准并调焦，使画面清晰"},"examples":[{"en":"Focus on the subject’s eyes to get a sharper portrait.","zh":"拍人像时对焦在眼睛上，照片会更清晰。"},{"en":"The projector won’t focus on the screen.","zh":"投影仪无法在屏幕上对焦清楚。"}]}],"synonyms":["concentrate on","center on","zero in on","home in on","pay attention to"],"phonetic":"/ˈfoʊkəs/","extraExplanation":["写作与口语中常用结构：focus on + 名词/动名词（-ing）。如：focus on improving your English（专注于提升英语）。","搭配区别：focus on 强调“把注意力放在……上”；concentrate on 更强调“长时间用脑/集中精神”；pay attention to 常用于提醒别人“注意”。"],"etymology":"focus 源自拉丁语，原意是“炉灶、火炉”，后来引申为“中心点”，再发展出“注意力的中心/焦点”，以及光学里的“焦点/对焦”。","mnemonic":["把 focus 想成“焦（点）”：中文里“焦点/对焦”都和“focus”对应——focus on 就是“把焦点放在……上”。","记搭配：on = “在……上面”，focus on = “把注意力放在……上”。"]}
{"word":"focus ... onto","summary":{"en":"direct attention or effort toward a target, often emphasizing a shift onto it","zh":"把注意力或精力转向并集中到某个目标上（强调转移到其上）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to direct attention, effort, or a camera’s lens toward a particular target; used when you emphasize movement or directing something onto a new target","zh":"把注意力、精力或镜头对准某个目标；常用于强调“把……转向/投到”一个新的目标上"},"examples":[{"en":"Let’s focus our discussion onto the main problem: safety.","zh":"我们把讨论聚焦到主要问题上：安全。"},{"en":"The photographer focused the lens onto her face.","zh":"摄影师把镜头对焦到她的脸上。"},{"en":"After the first week, he focused his energy onto improving his listening.","zh":"第一周后，他把精力集中到提升听力上。"}]}],"synonyms":["concentrate on","focus on","direct attention to","turn to","zero in on","home in on","aim at"],"phonetic":"/ˈfoʊkəs ˈɑnˌtu/","extraExplanation":["更常见的搭配是 “focus on …”。“focus … onto …”在语法上也可用，但语气更强调“把……导向/转移到某个目标上”，常见于镜头对焦、把注意力从A转到B等场景。","“onto” vs “on”：onto 强调“到……上去/朝……上去”（有方向、移动）；on 更像静态位置。“focus on”通常已足够表达“集中在……上”，不一定需要 onto。","常见结构：focus on + 名词/动名词；focus (something) on/onto + 目标（something 常是 attention/energy/discussion/lens 等）。"],"etymology":"“focus”来自拉丁语 focus（“炉灶、火炉”），引申为“中心点、焦点”，再发展出“使聚焦/集中”的动词用法；“onto”表示“到……之上”，强调方向和落点。","mnemonic":["把 onto 理解成“on + to（到……上）”：有“转移到某处”的感觉，所以 focus … onto … = “把焦点/注意力转到……上”。","联想相机“对焦”：focus the lens onto a point（镜头对到某一点）。"]}
{"word":"focus attention on","summary":{"en":"direct concentration toward a specific target","zh":"把注意力集中到某个目标上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to direct your attention toward a particular person, thing, or issue; to concentrate on it","zh":"把注意力集中在某人、某事或某个问题上；专注于"},"examples":[{"en":"Let’s focus our attention on the main problem first.","zh":"我们先把注意力集中在主要问题上。"},{"en":"The report focuses attention on rising housing costs.","zh":"这份报告把注意力引向不断上涨的住房成本。"},{"en":"During the test, try to focus your attention on one question at a time.","zh":"考试时，尽量一次把注意力集中在一道题上。"}]}],"synonyms":["concentrate on","focus on","direct attention to","turn attention to","zero in on"],"phonetic":"/ˈfoʊkəs əˈtɛnʃən ɑn/","extraExplanation":["常见结构：focus (someone’s) attention on + 名词/代词/动名词。例如：focus attention on improving safety（把注意力放在提升安全上）。","对比：focus on 更口语、更简洁；pay attention to 更强调“留意/注意到”，不一定有“集中精力解决”的感觉。"],"etymology":"“focus”源自拉丁语 focus（炉灶、火堆），后来在光学里表示“焦点”，再引申为“把注意力/精力集中到一点上”。“focus attention on”是英语里常见的固定搭配，用来强调“把注意力明确指向某个对象”。","mnemonic":["“focus=对焦”，“attention=注意力”：像相机对焦一样，把注意力“对准”on 后面的对象。","记搭配：focus + attention + on（三件套），on 后面就是“你要专注的目标”。"]}
{"word":"focus group","summary":{"en":"A small, moderated discussion group used to gather opinions and reactions for research.","zh":"由主持人引导的小型讨论组，用于收集意见与反应（调研）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, guided discussion group used to learn people’s opinions, feelings, or reactions—often for marketing, product design, public policy, or research.","zh":"焦点小组（在主持人引导下进行的小型讨论组，用来了解人们的观点、感受或反应，常用于市场调研、产品设计、公共政策或研究）。"},"examples":[{"en":"The company ran a focus group to test the new packaging.","zh":"公司组织了一个焦点小组来测试新包装。"},{"en":"In the focus group, participants talked about what they liked and disliked about the app.","zh":"在焦点小组中，参与者讨论了他们对这款应用的喜欢与不喜欢之处。"},{"en":"We’ll use focus groups before we launch the campaign.","zh":"我们会在推出宣传活动之前使用焦点小组调研。"}]}],"synonyms":["discussion group","consumer panel","research group"],"phonetic":"/ˈfoʊkəs ɡruːp/","extraExplanation":["“focus group”通常有一位主持人（moderator），通过提问引导讨论；它更重视“深入的原因与想法”，而问卷调查（survey）更容易得到“可量化的数据”。","常见搭配：run/conduct a focus group（组织焦点小组）、recruit participants（招募参与者）、focus group findings/insights（焦点小组结果/洞察）。","注意：focus group 只能反映少数人的观点，不能直接代表整体人群，因此常与 survey、data analysis 等方法配合使用。"]}
{"word":"focus length","summary":{"en":"A lens/mirror measurement that controls viewing angle and magnification.","zh":"决定视角与“放大感”的镜头/镜面参数（焦距）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The distance from the center of a lens (or mirror) to the point where it brings light rays to a focus; it largely determines how wide or zoomed-in an image looks.","zh":"（镜头或镜面）把光线汇聚成焦点时，从镜头中心到焦点的距离；它在很大程度上决定画面是广角还是“拉近/放大”。"},"examples":[{"en":"A 24mm focal length gives a wide view that’s good for landscapes.","zh":"24毫米的焦距视角更广，适合拍风景。"},{"en":"With a longer focal length, the background looks closer and more blurred.","zh":"焦距更长时，背景看起来更“近”，也更容易虚化。"},{"en":"Check the focal length printed on the lens barrel before you shoot.","zh":"拍摄前先看看镜头筒身上标注的焦距。"}]}],"synonyms":["lens focal length","focal distance","lens length"],"phonetic":"/ˈfoʊkəl lɛŋθ/","extraExplanation":["易混点：标准术语是 focal length（焦距），不是 focus length。口语里有人会说 focus length，但在摄影/光学资料、镜头参数中几乎都写 focal length。","理解方式：焦距越短（如 14–24mm）→ 视角越广；焦距越长（如 85–200mm）→ 视角越窄、更像“放大”。","单位通常是毫米（mm）。变焦镜头会写成一个范围，比如 24–70mm。"],"etymology":"源自拉丁语 focus（“炉灶、火点”，引申为“焦点”）+ length（“长度”）。在光学中，focus 指光线汇聚的点，focal 表示“与焦点相关的”，形成术语 focal length（焦距）。日常中常被误说成 focus length，但标准用法是 focal length。","mnemonic":["记忆：focal = “焦点的/焦距的”（像 local→地方的），focal length 就是“焦点相关的长度”= 焦距。","把 focal length 想成“画面有多‘拉近’的长度”：数字越大越“拉近”。"]}
{"word":"focus less on ...","summary":{"en":"pay less attention to something","zh":"少关注某事；降低强调"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give something less attention, importance, or effort; to emphasize it less","zh":"较少关注/重视某事；减少对某事的强调"},"examples":[{"en":"Try to focus less on perfection and more on progress.","zh":"尽量少纠结完美，多关注进步。"},{"en":"The report focuses less on costs and more on long-term benefits.","zh":"这份报告较少谈成本，更强调长期收益。"},{"en":"I’m learning to focus less on what people think of me.","zh":"我正在学习少在意别人怎么看我。"}]}],"synonyms":["pay less attention to","emphasize less","de-emphasize","downplay","give less weight to","put less emphasis on"],"phonetic":"/ˈfoʊkəs lɛs ɑn/","extraExplanation":["常见搭配是“focus less on A and more on B”，用于表达“少强调A，多强调B”。","语气通常是温和的建议（如教练、老师、朋友的提醒），也可用于写作中的对比论证。","如果要表示“完全不关注”，更常用“stop focusing on…”或“don’t focus on…”。"],"etymology":"由“focus（聚焦、专注）+ less（更少）+ on（在……上）”组成；在现代英语中常用于建议或对比结构（less…more…），表示把注意力从A移向B。","mnemonic":["把它拆开记：focus=“聚焦”，less=“少一点”，on=“在……上”→“在……上少聚焦一点”。","联想句式：less on A, more on B（少A多B），很像中文“少……多……”。"]}
{"word":"focus more on ...","summary":{"en":"give extra attention or priority to something","zh":"更重视某事；把更多注意力放在某事上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give more attention, time, or importance to something (often compared with another thing)","zh":"更关注/更重视某事（常与另一件事作对比）"},"examples":[{"en":"This semester, I want to focus more on writing than on test-taking tricks.","zh":"这学期，我想把更多精力放在写作上，而不是应试技巧上。"},{"en":"We need to focus more on customer feedback to improve the product.","zh":"我们需要更重视客户反馈来改进产品。"},{"en":"Try to focus more on what you can control.","zh":"尽量把注意力更多放在你能控制的事情上。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in instructions or feedback) to pay extra attention to a particular aspect of your work","zh":"（用于建议/反馈）在某项工作中把更多注意力放在某个方面"},"examples":[{"en":"In your next draft, focus more on the main idea and cut unnecessary details.","zh":"在你的下一版草稿里，更突出中心思想，删掉不必要的细节。"},{"en":"Focus more on pronunciation, especially the /r/ sound.","zh":"更注意发音，尤其是/r/这个音。"}]}],"synonyms":["pay more attention to","put more emphasis on","prioritize","concentrate more on","devote more time to"],"phonetic":"/ˈfoʊkəs mɔr ɑn/","extraExplanation":["“focus more on …”后面通常接名词、代词或动名词：focus more on math / on it / on improving your skills。","常见结构：focus more on A (than on B) 表示“更侧重A（而不是B）”。","你输入的“...”表示后面内容未说完，实际使用时需要补全关注的对象。"],"etymology":"focus源自拉丁语focus，原意是“炉灶/火堆”，后来引申为“中心点”。英语里focus on表示“把注意力放在……上”，more表示程度增加，因此focus more on表示“更重视/更关注”。","mnemonic":["把focus想成“光束聚焦到一个点”；more on=“把更多光打到……上”，就记住“更多注意力放在……”"]}
{"word":"focus of ads","summary":{"en":"the main emphasis or selling point in advertising","zh":"广告的主要强调点/卖点"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the main thing that advertisements try to emphasize, promote, or make people notice","zh":"广告想要强调、推广或让人注意的核心点/重点"},"examples":[{"en":"The focus of ads for this phone is its camera quality.","zh":"这款手机广告的重点是它的相机质量。"},{"en":"Recently, the focus of ads has shifted from price to lifestyle.","zh":"最近广告的重点从价格转向了生活方式。"},{"en":"If the focus of ads is unclear, customers may not remember the brand.","zh":"如果广告重点不清晰，顾客可能记不住品牌。"}]}],"synonyms":["advertising focus","ad focus","main message","key message","selling point","main selling point","angle","hook","emphasis","central theme"],"phonetic":"ˈfoʊkəs əv ædz","extraExplanation":["ads 是 advertisements 的非正式缩写，适合口语、标题、社交媒体与日常写作；更正式的写法可用 the focus of advertising 或 the advertising focus。","常见搭配：shift the focus of ads（转移广告重点）、the focus of ads is on…（广告重点在……）、set/define the focus of ads（确定广告重点）。"],"etymology":"短语由 focus（“焦点、重点”，源自拉丁语 focus“炉火、火堆”，引申为“中心”）+ of + ads（advertisements 的口语缩写）组成；在市场营销语境中常用来指“广告主打点”。","mnemonic":["把 focus 记成“焦点/聚光灯照到哪里”，ads 就是“广告”，合起来就是“广告的聚光灯照哪里＝广告重点”。","ads≈“AD”海报；focus of ads＝“海报要你重点看什么”。"]}
{"word":"focus of the project","summary":{"en":"the project’s main aim or central attention","zh":"项目的主要目标或关注重点"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the main goal, central topic, or primary area of attention in a project","zh":"项目的重点；项目的核心目标/主要关注点"},"examples":[{"en":"The focus of the project is improving customer safety.","zh":"这个项目的重点是提升客户安全。"},{"en":"Our manager asked us to clarify the focus of the project before we start building anything.","zh":"经理让我们在开始做任何东西之前先明确项目的重点。"},{"en":"As the timeline changed, the focus of the project shifted from new features to stability.","zh":"随着时间表变化，项目重点从新功能转向稳定性。"}]}],"synonyms":["project focus","main objective","core objective","central goal","key priority","main aim","central theme"],"phonetic":"/ˈfoʊkəs əv ðə ˈprɑːdʒekt/","extraExplanation":["常见近义表达：the main goal / the core objective / the central theme / the key priority。","职场写作中常用来对齐团队方向：例如在计划书、汇报里用一句话说明“the focus of the project is …”。","注意与“scope（范围）”区分：focus 是“重点”，scope 是“包含哪些内容的范围”。"],"etymology":"“focus”源自拉丁语 focus，原意是“炉灶、火炉”，后来引申为“中心点”。在现代英语里常表示“注意力的中心/重点”。“the focus of + 名词”是常见结构，表示“……的重点/核心”。","mnemonic":["把 focus 想成“聚焦（fó-kè-sī）”：注意力像镜头一样对准一个点，就是“重点/焦点”。"]}
{"word":"focus on","summary":{"en":"to concentrate on or emphasize a particular thing","zh":"专注于；着重强调某一点"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give your attention and effort to a particular person, task, or idea; to concentrate on it","zh":"把注意力和精力放在某个人、任务或想法上；专注于"},"examples":[{"en":"Try to focus on your breathing for one minute.","zh":"试着把注意力放在呼吸上持续一分钟。"},{"en":"She needs to focus on her studies this semester.","zh":"这学期她需要专注于学业。"},{"en":"Let’s focus on what we can control.","zh":"我们把注意力放在能控制的事情上。"}]},{"partOfSpeech":"phrase","definition":{"en":"to emphasize or discuss one main point rather than others","zh":"强调或着重讨论某个重点，而不是其他方面"},"examples":[{"en":"The article focuses on the causes of the problem, not the solutions.","zh":"这篇文章着重讨论问题的原因，而不是解决方案。"},{"en":"In the meeting, we should focus on safety first.","zh":"在会议上，我们应该把安全放在第一位重点讨论。"}]}],"synonyms":["concentrate on","pay attention to","zero in on","home in on","center on","emphasize","highlight"],"phonetic":"/ˈfoʊkəs ɑn/","extraExplanation":["常见搭配：focus on doing sth（专注做某事）；focus on sth（专注某事）。","易混：concentrate on 更偏“集中注意力”；focus on 既可指“专注”，也常用于“强调/着重”。","写作/口语很常用：When it comes to…, we should focus on…（谈到……，我们应该重点关注……）。"],"etymology":"“focus”原指光学里的“焦点/聚焦”，来自拉丁语 focus（“炉火、火炉”）。后来引申为“注意力的中心”。“focus on”就是把注意力“对准/聚焦到”某处。","mnemonic":["把它想成相机“对焦”：镜头对准哪里，就清楚哪里——focus on = 把注意力对准那里。","联想中文“聚焦在/集中在”：两者语感非常接近。"]}
{"word":"focus on ...","summary":{"en":"concentrate attention or direct effort toward something","zh":"专注于；把注意力/重点放在……上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give your attention and effort to one specific thing; to concentrate on it","zh":"把注意力和精力放在某一件事上；专注于"},"examples":[{"en":"Let’s focus on the main idea, not the small details.","zh":"我们先专注于主要观点，不要纠结小细节。"},{"en":"She needs to focus on her health this year.","zh":"她今年需要把重点放在健康上。"},{"en":"To improve your English, focus on listening every day.","zh":"想提高英语，就每天专注练听力。"}]},{"partOfSpeech":"phrase","definition":{"en":"to aim or adjust something (such as a camera, light, or discussion) toward a particular point","zh":"把（镜头、光线、讨论等）对准/集中到某处或某个点"},"examples":[{"en":"Focus the camera on his face.","zh":"把镜头对准他的脸。"},{"en":"The meeting focused on solutions rather than blame.","zh":"会议把重点放在解决方案上，而不是追责。"}]}],"synonyms":["concentrate on","pay attention to","center on","zero in on","home in on","emphasize","target"],"phonetic":"/ˈfoʊkəs ɑn/","extraExplanation":["用法：focus on + 名词/代词/动名词（V-ing）。如：focus on the problem / focus on learning.","常见搭配：focus on a goal（专注目标）, focus on what matters（关注重要的事）, focus on solutions（聚焦解决方案）。","和 concentrate on 很接近；focus on 常强调“把重点放在……上”，也可用于讨论、计划、镜头等更广的语境。"],"etymology":"focus 来自拉丁语 focus，原意是“炉灶、火堆”，后来引申为“中心点”。在英语里 focus on 表示“把注意力/光线/镜头集中到某一点上”。","mnemonic":["把 focus 想成“焦点/对焦（焦）”，on=“在……上”：focus on=“把焦点放在……上”。","联想相机“对焦”：对准哪里，就 focus on 哪里。"]}
{"word":"focus on grades","summary":{"en":"Concentrate mainly on academic marks or performance.","zh":"主要专注于学业成绩/分数。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To pay attention mainly to school marks or academic performance (often more than other goals).","zh":"把注意力主要放在成绩/分数上（常常多于其他目标）。"},"examples":[{"en":"This semester I’m trying to focus on grades and study more regularly.","zh":"这学期我想把重心放在成绩上，更规律地学习。"},{"en":"If you only focus on grades, you may miss the joy of learning.","zh":"如果你只关注成绩，可能会错过学习的乐趣。"},{"en":"She focused on grades to improve her GPA.","zh":"她把重点放在成绩上来提高GPA。"}]},{"partOfSpeech":"phrase","definition":{"en":"To keep the camera’s or viewer’s attention on the score/grade area (less common; used in filming, design, or instructions).","zh":"把镜头或注意力对准“成绩/评分”区域（较少见，多用于拍摄、设计或说明）。"},"examples":[{"en":"When you take the photo, focus on grades so the numbers are clear.","zh":"拍照时对准成绩，让数字清楚一点。"},{"en":"The report layout focuses on grades at the top of the page.","zh":"这份报告的版式把成绩放在页面顶部作为重点。"}]}],"synonyms":["concentrate on grades","pay attention to grades","prioritize grades","aim for good grades"],"phonetic":"/ˈfoʊkəs ɑn ɡreɪdz/","extraExplanation":["在美式校园语境里，grades 通常指课程分数/字母等级（A/B/C…）或 GPA。说“focus on grades”往往暗示把结果（分数）当成主要目标；更中性的说法还可以是“focus on learning/skills”。","相关表达：focus on studying（专注学习过程），aim for good grades（以好成绩为目标），care too much about grades（过度在意成绩）。"],"etymology":"短语由动词 focus（“集中注意力”，来自拉丁语 focus“火炉、火堆”，引申为“中心”）+ on（“在……上”）+ grades（“成绩/评分”）组成。","mnemonic":["focus on = “把焦点放在……上”；grades = “成绩”。合起来就是“把焦点放在成绩上”。","可以联想中文“只盯分数”：盯（focus on）+ 分数/成绩（grades）。"]}
{"word":"focus on long-term matters","summary":{"en":"pay attention to future-important priorities rather than immediate concerns","zh":"关注未来更重要的优先事项，而不是只顾眼前"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to pay attention to goals, plans, or consequences that will matter in the future rather than what is urgent right now","zh":"把注意力放在长期目标、计划或未来影响上，而不是只顾眼前的紧急事情"},"examples":[{"en":"Good leaders focus on long-term matters, even when short-term results look disappointing.","zh":"优秀的领导者会关注长期事务，即使短期结果看起来不理想。"},{"en":"If you focus on long-term matters, you may save more money and stress less.","zh":"如果你把重点放在长期事务上，可能会存下更多钱，也会少一些焦虑。"},{"en":"She reminded the team to focus on long-term matters, not just this week’s deadline.","zh":"她提醒团队要关注长期事务，不要只盯着这周的截止日期。"}]}],"synonyms":["think long term","take the long view","plan ahead","prioritize the future","focus on long-term goals"],"phonetic":"/ˈfoʊkəs ɑn ˌlɔŋ ˈtɝm ˈmætɚz/","extraExplanation":["“long-term matters”常出现在职场与个人规划语境，带有“战略/长远打算”的意味；有时也可换成“long-term goals / long-term priorities / the long term”。","与之相对的常见说法是“short-term issues / short-term gains（短期问题/短期收益）”。"],"etymology":"这是由动词短语“focus on（专注于）”+形容词“long-term（长期的）”+名词“matters（事务/事情）”组合而成的常用表达，用来强调“长期视角”。","mnemonic":["把它拆开记：focus on=“聚焦在…上”；long-term=“长期”；matters=“事情/要紧的事”→“把注意力放在长期要紧的事上”。","联想中文“放长线钓大鱼”：提醒自己不要只看眼前小利益。"]}
{"word":"focus on sb.","summary":{"en":"give attention to a person; sometimes target them for criticism","zh":"关注某人；有时指把矛头对准某人"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give your attention to someone; to think about them carefully (often because they need help, feedback, or special consideration)","zh":"关注某人；把注意力集中在某人身上（常指需要帮助、反馈或特别照顾）"},"examples":[{"en":"Try to focus on the student who is struggling the most.","zh":"尽量关注那个最吃力的学生。"},{"en":"During the meeting, the manager focused on her and asked for her ideas.","zh":"会议中经理重点关注了她，并请她提想法。"},{"en":"We need to focus on him for a while after the surgery.","zh":"手术后我们需要一段时间重点照顾/关注他。"}]},{"partOfSpeech":"phrase","definition":{"en":"(sometimes) to criticize or blame someone in an unfair or repeated way","zh":"（有时）把矛头对准某人；反复或不公平地指责某人"},"examples":[{"en":"Don’t focus on him just because he made one mistake.","zh":"别因为他犯了一次错就一直盯着他不放。"},{"en":"The media focused on her and ignored the bigger issues.","zh":"媒体把焦点放在她身上，却忽视了更大的问题。"}]}],"synonyms":["pay attention to","concentrate on","center on","zero in on","single out","target"],"phonetic":"/ˈfoʊkəs ɑn ˈsʌmbədi/","extraExplanation":["常见搭配：focus on sb/sth（关注某人/某事）；focus on doing sth（专注做某事）；focus your attention on…（把注意力放在……）。","语气差异：focus on sb 多为中性“关注/重点照顾”，但在特定语境也可能带负面，接近“盯着某人、拿某人说事”。若想表达“照顾某人”，也可说 look after sb / take care of sb。"],"etymology":"来自拉丁语 focus，原意是“炉火、火炉”，后来引申为“中心点”。在英语里先用于光学“焦点”，再引申为注意力的“焦点/集中”。","mnemonic":["把 focus 想成“焦点（焦）”，focus on sb = “把焦点放在某人身上”。","联想相机对焦：镜头对准谁，谁就是你在 focus on 的人。"]}
{"word":"focus on sth.","summary":{"en":"give most attention to one thing","zh":"把主要注意力放在某事上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give your attention and effort mainly to a particular thing","zh":"把注意力和精力主要放在某件事上；专注于某事"},"examples":[{"en":"Try to focus on your homework for thirty minutes.","zh":"试着专心做三十分钟作业。"},{"en":"We need to focus on customer needs, not just profits.","zh":"我们需要关注客户需求，而不只是利润。"},{"en":"She focused on improving her English pronunciation.","zh":"她专注于提高英语发音。"}]}],"synonyms":["concentrate on","center on","pay attention to","zero in on","home in on"],"phonetic":"/ˈfoʊkəs ɑn/","extraExplanation":["常见结构：focus on + 名词/代词/动名词（V-ing）。例如：focus on the problem / focus on it / focus on studying。","常见同义结构：concentrate on（更强调“集中精神”）；pay attention to（强调“注意到/留意”）。","易错点：不要说 focus in sth；通常用 focus on。也可说 focus your attention on…（更正式）。"],"etymology":"focus 源自拉丁语，原意与“炉火、火点”有关，后来引申为“焦点（光学中的聚焦点）”，再进一步引申为“注意力的中心”。在英语里常用 focus on + 名词/动名词 来表达“把重点放在……上”。","mnemonic":["把 focus 想成“相机对焦”：对焦到哪里，画面（注意力）就清楚到哪里。","on = “在……上面”：focus on = 注意力“放在……上”。"]}
{"word":"focus on the central task of economic construction","summary":{"en":"prioritize economic development as the main objective","zh":"把经济发展作为首要目标"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To concentrate efforts and resources on developing the economy (especially on building and improving industry, infrastructure, and overall productive capacity).","zh":"把精力和资源集中到经济发展上（尤其指推进产业、基础设施和整体生产能力建设）。"},"examples":[{"en":"The government decided to focus on the central task of economic construction for the next five years.","zh":"政府决定在未来五年把工作重点放在经济建设这个中心任务上。"},{"en":"They shifted their attention from political campaigns to the central task of economic construction.","zh":"他们把注意力从政治运动转向了经济建设这个中心任务。"},{"en":"To improve living standards, the country must focus on the central task of economic construction.","zh":"为了提高生活水平，这个国家必须聚焦经济建设这个中心任务。"}]}],"synonyms":["prioritize economic development","focus on economic development","concentrate on economic development","make economic development a top priority","emphasize economic development"],"phonetic":"/ˈfoʊkəs ɑn ðə ˈsɛntrəl tæsk əv ˌiːkəˈnɑːmɪk kənˈstrʌkʃən/","extraExplanation":["语体与场景：这句话常见于政策文件、新闻报道、政府工作报告等正式语境。更“地道”的英文在不同场合会改写为：focus on economic development / prioritize economic development / concentrate on building the economy。","“construction”在这里不是“盖房子”那么窄，而是偏“建设、发展、打造”的抽象含义，类似 nation-building / economic development。"],"etymology":"多用于中文政治/政策语境的英译表达：“economic construction（经济建设）”在中文里常指国家层面的经济发展与现代化建设；“central task（中心任务）”强调首要、核心工作。整体更像固定搭配式翻译，在一般英语国家的日常语境中不算常见。","mnemonic":["把它拆开记：central task = 中心任务；economic construction = 经济建设。合起来就是“以经济建设为中心”。","联想“construction=建设”，不只修路盖楼，也包括“建设经济体系/产业”。"]}
{"word":"focus on the theoretical knowledge","summary":{"en":"Clarification needed about the target word/phrase or the preferred theory-focused approach.","zh":"需要澄清你要讲解的目标词/短语，或你希望采用的偏理论讲解方式。"},"extraExplanation":["你这句“focus on the theoretical knowledge”还不够明确：我可以把它当作一句英文短语来讲（含语法与用法），也可以按你的意思“请把讲解重点放在理论知识上”来调整后续讲解方式。","请你补充一个信息：\n1) 你要我讲解的目标词/短语是什么？（例如某个单词、短语、句子）\n或\n2) 你是在告诉我：接下来解释任何内容都要偏重理论？如果是，请给我一个主题（如词源学、语义学、语法、修辞、搭配、语用等）和一个例子词。"]}
{"word":"focus one's attention on","summary":{"en":"direct attention to a specific target","zh":"将注意力集中到特定对象上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to direct your attention and mental effort toward a particular person, thing, or activity","zh":"把注意力和精力集中到某个人、某件事或某项活动上"},"examples":[{"en":"Please focus your attention on the screen.","zh":"请把注意力集中在屏幕上。"},{"en":"She tried to focus her attention on her homework, but the noise was distracting.","zh":"她想把注意力集中在作业上，但噪音让她分心。"},{"en":"The report focuses attention on the risks of climate change.","zh":"这份报告把人们的注意力引向气候变化的风险。"}]}],"synonyms":["concentrate on","pay attention to","direct attention to","zero in on","home in on"],"phonetic":"/ˈfoʊkəs wʌnz əˈtɛnʃən ɑn/","extraExplanation":["常见搭配：focus one’s attention on sth / doing sth（把注意力放在某事/做某事上）。","与“concentrate on”很接近；但“focus … on”更强调“把注意力对准某一点”，像镜头对焦。也可用于让公众注意：focus attention on an issue（让大家关注某个议题）。"],"etymology":"“focus”原义与“焦点/火点”有关：来自拉丁语 focus（炉灶、火），后来在光学中引申为“焦点”，再进一步引申为“把注意力集中到某处”。该搭配中常用结构为 focus (one’s) attention on + 名词/动名词。","mnemonic":["联想“相机对焦”：镜头一对焦，画面清晰＝注意力对准一个点。","把 on 理解成“在……上”：attention 在什么上面，就“专注”在什么上。"]}
{"word":"focus one's mind on ...","summary":{"en":"concentrate attention seriously on something","zh":"专注于某事；把注意力和心思集中起来"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to concentrate your attention on something; to think about it carefully and seriously","zh":"把注意力集中在某事上；认真、专注地思考某事"},"examples":[{"en":"Try to focus your mind on the task, not on your phone.","zh":"尽量把注意力集中在任务上，而不是手机上。"},{"en":"She focused her mind on what to say in the interview.","zh":"她把心思集中在面试该说什么上。"}]}],"synonyms":["concentrate on","focus on","pay attention to","fixate on","direct one’s attention to","center on","zero in on"],"phonetic":"/ˈfoʊkəs/","extraExplanation":["常见句型：focus one’s mind on + 名词/动名词（-ing）。例如：focus your mind on improving your English（把心思放在提升英语上）。","也可用 focus on… 更口语：Focus on the task. / I need to focus on studying. “focus one’s mind on…”更强调“在心里努力把注意力拉回来”的感觉。","相近表达：set one’s mind on（下定决心要做某事，强调“目标/决心”）≠ focus one’s mind on（强调“注意力/思考”）。"],"etymology":"短语由动词 focus（“聚焦、集中”）+ 名词 mind（“头脑、心思”）构成。focus 本义与“光学聚焦”有关，后来引申为“把注意力集中到某处”。","mnemonic":["把 focus 想成“相机对焦”，mind 是“脑子”；“给脑子对焦到……上”。","联想中文“把心思放在……上”，几乎一一对应。"]}
{"word":"focus sth. on","summary":{"en":"direct attention or effort to a specific target","zh":"将注意力或精力集中到某个目标上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to direct your attention or effort toward a particular thing","zh":"把注意力或精力集中在某件事上"},"examples":[{"en":"Let’s focus our discussion on the main problem.","zh":"我们把讨论集中在主要问题上吧。"},{"en":"The training focuses on communication skills.","zh":"这项培训侧重于沟通技能。"},{"en":"Try to focus your mind on the task and ignore distractions.","zh":"尽量把注意力集中在任务上，忽略干扰。"}]}],"synonyms":["concentrate on","center on","focus on","zero in on","pay attention to","home in on"],"phonetic":"/ˈfoʊkəs ɑn/","extraExplanation":["常见搭配：focus on + 名词/动名词（-ing）。例如：focus on improving your English（专注于提升英语）。","与 focus in on 的区别：focus in on 更强调“锁定/逐步缩小范围到某一点”，语气更像“对准目标”。","易错点：focus on 后面一般不直接接从句；更自然的说法是 focus on what you can control（专注于你能控制的事情）。"],"etymology":"源自拉丁语 focus，原意是“炉灶、火堆”，后来引申为“中心点”，再发展出“使注意力集中”的含义；介词 on 表示“在……之上/指向……”，合起来就是“把注意力指向某事”。","mnemonic":["把 focus 想成“对焦/聚焦”，on 表示“对着……”，合起来就是“把镜头对着某件事”。","联想中文“聚焦在……上”，英语就是 focus on。"]}
{"word":"focus upon","summary":{"en":"concentrate attention or effort on something; (also) adjust to see clearly","zh":"把注意力/精力集中于某事；（也可指）对焦使之清晰"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to direct your attention, effort, or thinking toward a particular person, thing, or issue","zh":"把注意力、精力或思考集中在某人/某事/某个问题上"},"examples":[{"en":"In today’s meeting, we will focus upon customer feedback.","zh":"在今天的会议上，我们将把重点放在客户反馈上。"},{"en":"Try to focus upon one task at a time to avoid mistakes.","zh":"尽量一次只专注做一件事，以避免出错。"},{"en":"The essay focuses upon the causes of the conflict.","zh":"这篇文章重点讨论了冲突的原因。"}]},{"partOfSpeech":"phrase","definition":{"en":"to adjust a camera, lens, or eyes so that something becomes clear and sharp","zh":"（摄影/视觉）调整焦点，使某物清晰成像"},"examples":[{"en":"The photographer focused upon the child’s face.","zh":"摄影师把焦点对准了孩子的脸。"},{"en":"It took a second for my eyes to focus upon the text.","zh":"我的眼睛花了一秒才对焦到文字上。"}]}],"synonyms":["concentrate on","focus on","center on","pay attention to","zero in on","home in on","emphasize"],"phonetic":"/ˈfoʊkəs əˈpɑn/","extraExplanation":["“focus on”和“focus upon”意思几乎相同；“upon”更正式、更书面，常见于论文、报告、演讲稿中。日常口语里更常用“focus on”。","搭配提示：focus upon + 名词/动名词（focusing upon improving quality）；也常见于“focus upon the fact that…”（强调某个事实）。"],"etymology":"focus 来自拉丁语 focus（“炉火、火炉”），后引申为“中心点、焦点”；upon 是 on 的较正式形式。合起来表示“把注意力/焦点放在……之上”。","mnemonic":["把 upon 理解成“在……之上”：把注意力“放在……上面”= 集中于……。","focus 联想“相机对焦”：对焦后画面变清晰 → 做事时把注意力对准一个点。"]}
{"word":"focus upon sb.","summary":{"en":"to concentrate attention on a person","zh":"把注意力集中在某人身上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to direct your attention, interest, or effort toward a particular person","zh":"把注意力、兴趣或精力集中在某个人身上"},"examples":[{"en":"The camera focused upon her as she walked onto the stage.","zh":"她走上舞台时，镜头对准了她。"},{"en":"During the interview, the questions focused upon his leadership style.","zh":"在采访中，问题集中在他的领导风格上。"},{"en":"Please don’t focus upon one student—try to include everyone.","zh":"请不要只关注某一个学生——尽量照顾到每个人。"}]}],"synonyms":["concentrate on","center on","fixate on","zero in on","home in on","pay attention to"],"phonetic":"/ˈfoʊkəs əˈpɑn/","extraExplanation":["“sb.”是“somebody（某人）”的缩写，常见于词典、笔记或练习题中；真实写作里通常直接写“someone/somebody/具体人名”。","“focus on”与“focus upon”意思基本相同；“upon”更正式、更书面，在新闻、论文或较正式叙述中更常见。"],"etymology":"“focus”来自拉丁语，原意与“炉灶/火点”有关，后来引申为“中心点、焦点”，再发展出动词义“把注意力集中”。“upon”是较正式的“on”。","mnemonic":["把“focus”想成“焦点/镜头对焦（对准）”，所以“focus upon sb.”=镜头对准某人→注意力集中在某人身上。"]}
{"word":"focus upon sth.","summary":{"en":"give special attention; concentrate","zh":"专注；把注意力集中在"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give special attention to something; to concentrate on it","zh":"把注意力放在某事上；专注于某事"},"examples":[{"en":"In this lesson, we’ll focus upon pronunciation rather than grammar.","zh":"这节课我们将把重点放在发音上，而不是语法上。"},{"en":"Try to focus on one task at a time.","zh":"尽量一次只专注做一件事。"},{"en":"The report focuses on the causes of the problem.","zh":"这份报告重点讨论了问题的原因。"}]}],"synonyms":["concentrate on","pay attention to","zero in on","center on","home in on","fixate on"],"phonetic":"/ˈfoʊkəs əˈpɑn/","extraExplanation":["用法提示：focus on/upon + 名词/代词/动名词（-ing）。例如：focus on improving listening（专注于提升听力）。","语气差别：focus upon 比 focus on 更正式一些，写作或演讲中更常见；日常口语更常用 focus on。"],"etymology":"“focus”来自拉丁语，原义与“炉灶/火点”有关，后来引申为“焦点”，再进一步引申为“把注意力集中到一个点上”。“upon”是较正式的“on”，在现代英语中两者意思基本相同。","mnemonic":["把“focus”想成“相机对焦”：对准一个点，画面才清晰＝注意力集中在一件事上。","upon≈on：记成“更正式的 on”，写作时用 upon 会更书面。"]}
{"word":"focus-group","summary":{"en":"a guided small-group discussion for collecting feedback or opinions","zh":"用于收集反馈或观点的引导式小组讨论"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, guided discussion group used to collect opinions, attitudes, or feedback about a product, service, idea, or message","zh":"焦点小组：在主持人引导下进行讨论的小型群体，用来收集对产品、服务、理念或信息的看法与反馈"},"examples":[{"en":"The company ran a focus group to test reactions to the new packaging.","zh":"公司组织了一个焦点小组来测试大家对新包装的反应。"},{"en":"In the focus group, participants shared what they liked and disliked about the app.","zh":"在焦点小组里，参与者分享了他们对这款应用喜欢和不喜欢的地方。"},{"en":"We used focus groups to understand how students experience online learning.","zh":"我们用焦点小组来了解学生如何体验在线学习。"}]}],"synonyms":["discussion group","panel discussion","user group","consumer panel","market research group"],"phonetic":"/ˈfoʊkəs ˌɡruːp/","extraExplanation":["焦点小组通常有6–10人左右，由主持人（moderator）提问并引导讨论；常见于市场调研、用户体验（UX）研究、公共政策与社会研究。","与 survey（问卷）相比，焦点小组更适合挖掘原因、情绪和细节；但样本小，结果不一定能代表总体。"],"etymology":"由 focus（焦点、重点）+ group（群体）组合而成；20世纪中期在社会科学研究与市场调研中广泛使用，强调“围绕同一主题集中讨论”。","mnemonic":["把它想成“把人聚成一组，集中（focus）讨论同一个点”。","联想中文“焦点访谈/焦点讨论”：围绕焦点话题进行群体讨论。"]}
{"word":"focusable","summary":{"en":"Focusable means able to receive focus, especially in a UI for keyboard or other input.","zh":"Focusable 指“可获得焦点的”，常用于界面/无障碍语境，表示能被键盘等方式选中并操作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to receive focus (to be selected or activated), especially in a user interface so it can be controlled by keyboard, mouse, or touch.","zh":"可获得焦点的；（尤指在用户界面中）可被选中/激活，从而能用键盘、鼠标或触控进行操作的。"},"examples":[{"en":"Make the button focusable so users can reach it with the Tab key.","zh":"让这个按钮可获得焦点，这样用户就能用 Tab 键切换到它。"},{"en":"This link isn’t focusable, so keyboard users can’t open it easily.","zh":"这个链接不能获得焦点，所以使用键盘的用户不容易打开它。"},{"en":"The menu becomes focusable when it opens.","zh":"菜单打开后就会变得可获得焦点。"}]}],"synonyms":["able to receive focus","keyboard-accessible","tabbable (more specific)"],"phonetic":"/ˈfoʊkəsəbəl/","extraExplanation":["“focusable”最常见于网页/软件开发与无障碍（accessibility）语境。它通常描述一个元素是否能进入“焦点顺序”（tab order），也就是能否被 Tab/Shift+Tab 选中。","在日常英语里，人们较少用 focusable 来形容人或注意力；更常说“can focus / able to concentrate（能专注）”。"]}
{"word":"focused","summary":{"en":"“Focused” means concentrating on something, or (for images/eyes) being clear and sharp; it can also mean targeted toward a specific purpose.","zh":"“focused”主要指“专注的/注意力集中的”，也可指“清晰对焦的”，还可表示“有针对性的、聚焦的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to give full attention to one thing; concentrating without being distracted.","zh":"专注的；注意力集中在一件事上，不易分心的。"},"examples":[{"en":"She stayed focused during the exam and ignored the noise outside.","zh":"考试时她一直很专注，忽略了外面的噪音。"},{"en":"Try to keep focused on your goal, even when progress is slow.","zh":"即使进展缓慢，也要尽量专注于你的目标。"}]},{"partOfSpeech":"adj.","definition":{"en":"Clear and sharp (especially of an image, camera, or eyes); not blurry.","zh":"（图像/相机/视线等）清晰的；对焦准确的；不模糊的。"},"examples":[{"en":"The photo isn’t focused—everything looks blurry.","zh":"这张照片没对上焦——看起来都很模糊。"},{"en":"The camera finally focused on his face.","zh":"相机终于对准了他的脸并对上了焦。"}]},{"partOfSpeech":"adj.","definition":{"en":"Directed toward a particular purpose or group; specialized rather than general.","zh":"针对性的；面向特定目的或人群的；相对不那么泛泛的。"},"examples":[{"en":"The program offers focused support for new immigrants.","zh":"该项目为新移民提供有针对性的支持。"},{"en":"We need a focused plan, not a long list of ideas.","zh":"我们需要一个聚焦的计划，而不是一长串想法。"}]}],"synonyms":["concentrated","attentive","targeted","sharp"],"phonetic":"/ˈfoʊkəst/","extraExplanation":["“focused”常和介词搭配：be focused on + 名词/动名词（专注于……）；a focused effort/plan（集中力量的努力/有重点的计划）。","在口语里，“Stay focused.”常用作提醒或鼓励，意思是“别分心/保持专注”。"]}
{"word":"focusedly","summary":{"en":"“Focusedly” means doing something with strong concentration or with clear direction toward a goal.","zh":"“focusedly”表示“专注地”或“有针对性地（目标明确地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a focused way; with full attention and concentration.","zh":"专注地；集中注意力地。"},"examples":[{"en":"She listened focusedly to every word of the lecture.","zh":"她专注地听讲座中的每一句话。"},{"en":"He worked focusedly for two hours without checking his phone.","zh":"他专注地工作了两小时，没有看手机。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is directed toward one main goal or topic; with a clear purpose.","zh":"有针对性地；目标明确地。"},"examples":[{"en":"The team discussed the problem focusedly instead of jumping between topics.","zh":"团队有针对性地讨论问题，而不是在话题间跳来跳去。"},{"en":"She planned her study schedule focusedly around the exam dates.","zh":"她围绕考试日期有针对性地安排学习计划。"}]}],"synonyms":["intently","attentively","with focus","in a focused way","purposefully"],"phonetic":"/ˈfoʊkəsɪdli/","extraExplanation":["“focusedly”在现代英语中能用，但相对少见，更常见的表达是：with focus, intently, in a focused way, with full attention。写作中用这些替代通常更自然。","词形来源：focused（专注的）+ -ly（副词后缀）。如果你在正式写作里使用“focusedly”，读者一般能理解，但可能会觉得不如“intently / with focus”地道。"]}
{"word":"focuser","summary":{"en":"A focuser is either something that helps you concentrate, or a device that adjusts focus in optical equipment.","zh":"focuser 指帮助集中注意力的事物，或指光学设备上的对焦装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that helps you focus your attention or effort on a specific task or goal.","zh":"帮助你把注意力或精力集中到某个任务或目标上的人或事物。"},"examples":[{"en":"A simple checklist can be a good focuser when you feel overwhelmed.","zh":"当你觉得不知所措时，一份简单的清单可以成为很好的“注意力聚焦器”。"},{"en":"The coach used short drills as a focuser before the match.","zh":"教练在比赛前用简短的训练作为让队员进入状态的“聚焦工具”。"}]},{"partOfSpeech":"n.","definition":{"en":"A device (especially on a camera, telescope, or microscope) used to adjust the focus to make an image sharp.","zh":"（尤指相机、望远镜或显微镜上的）对焦装置，用来调节焦点使图像清晰。"},"examples":[{"en":"Turn the focuser slowly until the stars look sharp.","zh":"慢慢转动调焦器，直到星星看起来清晰。"},{"en":"This telescope has a smooth focuser that’s easy to adjust.","zh":"这台望远镜的调焦器很顺滑，调起来很方便。"}]}],"synonyms":["concentration aid","attention tool","focus mechanism","focus knob","adjuster"],"phonetic":"/ˈfoʊkəsɚ/","extraExplanation":["在摄影/天文语境中，focuser 常特指望远镜的“调焦座/调焦器”，通过旋钮推动目镜筒前后移动来实现对焦。日常英语里更常说 focusing mechanism 或 simply focus knob。"]}
{"word":"focusers","summary":{"en":"Focusers are devices that adjust focus in optical instruments, or (more generally) things that help concentrate attention.","zh":"focusers 指光学仪器上的对焦装置；也可泛指帮助集中注意力的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Devices on a camera, telescope, microscope, or similar instrument that adjust the focus (make an image sharper).","zh":"（相机、望远镜、显微镜等的）调焦装置；对焦器（使图像更清晰的部件）。"},"examples":[{"en":"Many telescopes come with smooth, precise focusers for fine adjustments.","zh":"很多望远镜都配有顺滑、精密的对焦器，方便进行微调。"},{"en":"If the image looks soft, check whether the focuser is slipping.","zh":"如果画面看起来发虚，检查一下对焦器是否在打滑。"}]},{"partOfSpeech":"n.","definition":{"en":"People or things that help direct attention toward a particular task, topic, or goal.","zh":"能帮助把注意力导向某个任务、话题或目标的人或事物；“注意力聚焦器”。"},"examples":[{"en":"Short deadlines can act as focusers when a team is distracted.","zh":"当团队分心时，较短的截止日期可以起到“聚焦注意力”的作用。"},{"en":"For some students, quiet music is a helpful focuser while studying.","zh":"对一些学生来说，安静的音乐是学习时很有帮助的“专注辅助”。"}]}],"synonyms":["focusing mechanisms","focusing units","attention aids","concentration aids"],"phonetic":"/ˈfoʊkəsərz/","extraExplanation":["“focusers”是名词“focuser”的复数形式。在英文里最常见于光学器材语境（望远镜、显微镜、相机配件等），指用于调节焦点的机械部件。第二个义项更偏口语/引申，用来形容能让人更专注的因素。"]}
{"word":"focuses","summary":{"en":"“Focuses” is the third-person singular form of “focus,” meaning to concentrate on something or to adjust something (like a lens) to be clear.","zh":"“Focuses”是“focus”的第三人称单数形式，常指“专注于某事”，也可指（镜头等）“对焦使清晰”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"gives special attention to something; concentrates on it","zh":"把注意力集中在某事上；专注于"},"examples":[{"en":"This course focuses on everyday English conversations.","zh":"这门课专注于日常英语会话。"},{"en":"She focuses on her homework after dinner.","zh":"她晚饭后专心写作业。"}]},{"partOfSpeech":"v.","definition":{"en":"makes something clear or sharp (like a camera lens); adjusts to see or show details","zh":"使（图像/镜头等）对焦清晰；调节以看清细节"},"examples":[{"en":"The camera focuses quickly in low light.","zh":"这台相机在弱光下也能很快对焦。"},{"en":"He focuses the microscope to see the cells clearly.","zh":"他调节显微镜对焦，以清楚地看到细胞。"}]}],"synonyms":["concentrates","centers","targets","fixes (one’s attention on)"],"phonetic":"/ˈfoʊkəsɪz/","extraExplanation":["“focuses”通常是动词 focus 的第三人称单数形式（he/she/it focuses）。常见搭配：focus on + 名词/动名词（focus on the problem / focus on improving）。","在写作中，focus（名词）也很常见：the focus of the article（文章的重点）。注意区分：v. focus on…（专注于……） vs. n. focus（重点/焦点）。"]}
{"word":"focuses on","summary":{"en":"give main attention to; concentrate on","zh":"集中注意力于；专注于"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to give most of your attention, effort, or thinking to a particular person, thing, or topic","zh":"把主要注意力/精力放在某人、某事或某个话题上；专注于"},"examples":[{"en":"This lesson focuses on everyday conversation.","zh":"这节课专注于日常会话。"},{"en":"She focuses on her studies during the week.","zh":"她在工作日把精力放在学习上。"},{"en":"The report focuses on ways to reduce waste.","zh":"这份报告重点讨论减少浪费的方法。"}]},{"partOfSpeech":"phrase","definition":{"en":"to adjust a lens so that an image is clear; to aim attention visually at something (often for photos, videos, or observation)","zh":"（摄影/观察）对焦；把镜头对准，使图像清晰"},"examples":[{"en":"The camera focuses on the child’s face.","zh":"镜头对焦在孩子的脸上。"},{"en":"The documentary focuses on the disappearing forests.","zh":"这部纪录片把镜头聚焦在正在消失的森林上。"}]}],"synonyms":["concentrate on","focus upon","center on","zero in on","home in on","emphasize","highlight","spotlight"],"phonetic":"ˈfoʊkəs ɑn","extraExplanation":["“focuses on”是第三人称单数（he/she/it focuses on）。原形是“focus on”。","常见搭配：focus on doing sth（专注做某事）；focus on sth（专注某事）；be focused on（处于专注于……的状态）。"],"etymology":"“focus”原意是“火点/焦点”，来自拉丁语 focus（炉灶、火）。后来引申为“光线汇聚的焦点”，再进一步比喻为“注意力的中心”。“focus on”表示“把注意力/镜头集中到……上”。","mnemonic":["把“focus”联想到中文“聚焦/焦点”：眼睛或镜头“聚”到一个“焦”点上。","记搭配：focus on = 把注意力“放在 on（在……上）”某件事上。"]}
{"word":"focusing","summary":{"en":"“Focusing” means giving your attention to one thing, or making an image clear (camera/eyes).","zh":"“focusing”表示把注意力集中在一件事上；也可表示（相机/眼睛等）对焦使画面清晰。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"giving your attention and mental effort to one thing, usually to do it well or understand it clearly","zh":"把注意力和精力集中在一件事上，通常为了把它做好或理解清楚"},"examples":[{"en":"She is focusing on her studies this semester.","zh":"这学期她把重心放在学习上。"},{"en":"Try focusing on one task at a time.","zh":"尽量一次只专注做一件事。"},{"en":"I’m focusing hard, but the noise is distracting.","zh":"我很努力在集中注意力，但噪音让人分心。"}]},{"partOfSpeech":"v.","definition":{"en":"directing attention, effort, or activity toward a particular goal or topic","zh":"把注意力、努力或行动导向某个目标或话题"},"examples":[{"en":"The meeting is focusing on customer feedback.","zh":"这次会议聚焦在客户反馈上。"},{"en":"The campaign is focusing on safety and health.","zh":"这项活动重点强调安全与健康。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of making an image clear (for example, with a camera, microscope, or your eyes)","zh":"（如相机、显微镜或眼睛）把图像调清晰、对焦"},"examples":[{"en":"The photographer is focusing the lens on the subject.","zh":"摄影师正在把镜头对焦在主体上。"},{"en":"The microscope isn’t focusing properly.","zh":"显微镜对焦不太正常。"}]}],"synonyms":["concentrating","paying attention","zeroing in","aiming","sharpening (an image)"],"phonetic":"/ˈfoʊkəsɪŋ/","extraExplanation":["“focusing”通常是动词 focus 的现在分词/动名词形式：\n- 现在进行时：I am focusing on…（我正在专注于……）\n- 动名词作主语/宾语：Focusing is hard. / I’m practicing focusing.（专注很难。/我在练习专注。）","常见搭配：\n- focus on + 名词/动名词：focus on learning（专注学习）\n- focus attention/effort on：focus your attention on the speaker（把注意力放在讲话者身上）\n- focus (something) on：focus the camera on the face（把镜头对准脸）\n- focus (something) + sharply/clearly（对焦得很清晰）","易混点：\n- focus on（强调“把注意力放在某处”）\n- concentrate on（更偏“集中精力、排除干扰”）\n两者很多场合可互换，但 concentrate 往往语气更“用力”。"]}
{"word":"focusing on","summary":{"en":"concentrating attention on something","zh":"把注意力集中在某事上"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"giving most of your attention to something; concentrating on it","zh":"把主要注意力放在……上；专注于……"},"examples":[{"en":"I’m focusing on my studies this semester.","zh":"这个学期我在专注学习。"},{"en":"The report focuses on customer satisfaction.","zh":"这份报告聚焦于客户满意度。"},{"en":"Try focusing on one task at a time.","zh":"尽量一次只专注做一件事。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in writing, speaking, or research) discussing a particular topic as the main point","zh":"（写作/演讲/研究中）以某个主题为重点展开"},"examples":[{"en":"Her presentation is focusing on climate solutions, not the problem itself.","zh":"她的演讲重点在气候解决方案，而不是问题本身。"},{"en":"The class is focusing on basic grammar today.","zh":"今天这节课重点讲基础语法。"}]}],"synonyms":["concentrating on","centering on","paying attention to","zeroing in on","fixating on","working on"],"phonetic":"ˈfoʊkəsɪŋ ɑn","extraExplanation":["常见搭配：focus on + 名词/动名词（focusing on improving…）。","与“focus in”不同：focus in常用于摄影/镜头或更字面意义的“聚焦进入”；日常表达大多用 focus on。"],"etymology":"“focus”源自拉丁语 focus，原意是“炉火、火炉”。后来在光学中指“焦点”，再引申为“注意力的焦点、专注”。“focus on”表示“把注意力/讨论焦点放在……上”。","mnemonic":["把 focus 记成“焦点/聚焦”，on 记成“在……上”，合起来就是“把焦点放在……上”。","联想中文“聚焦在……上”，几乎一一对应：focus ≈ 聚焦，on ≈ 在……上。"]}
{"word":"focusless","summary":{"en":"Focusless means not able to concentrate, or lacking a clear direction or main point.","zh":"focusless 指难以专注、容易分心，也可指缺乏明确方向或重点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unable to focus or concentrate; easily distracted.","zh":"无法专注的；注意力不集中的；容易分心的。"},"examples":[{"en":"I feel focusless today, so I’m going to take a short break and try again.","zh":"我今天感觉很难专注，所以我先休息一下再继续。"},{"en":"After a night of poor sleep, he was focusless in class and missed key points.","zh":"前一晚没睡好，他在课堂上注意力不集中，错过了重点。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking a clear goal, direction, or purpose; not well-defined.","zh":"缺乏明确目标或方向的；不够清晰的。"},"examples":[{"en":"The meeting became focusless and lasted much longer than planned.","zh":"会议变得没有重点，比计划时间长了很多。"},{"en":"Her essay felt focusless because it didn’t stick to one main idea.","zh":"她的文章显得没有中心，因为没有围绕一个核心观点展开。"}]}],"synonyms":["unfocused","distracted","inattentive","scatterbrained","aimless","lacking focus"],"phonetic":"/ˈfoʊkəsləs/","extraExplanation":["“focusless”由 focus + -less（表示“缺少……”）构成，意思是“缺乏专注/缺少焦点”。在日常英语里它能被理解，但更常见、更自然的说法通常是：\n- 形容人/状态：distracted, unfocused, unable to concentrate\n- 形容文章/讨论：unfocused, aimless, lacking focus\n写作或正式场合建议优先用“unfocused / distracted / lacking focus”。"]}
{"word":"focussed","summary":{"en":"“Focussed” means “focused”: concentrating attention or effort; it’s also the past form of “focus.”","zh":"“focussed”与“focused”同义：表示专注、集中注意力；也可作“focus”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Concentrating on one main thing; paying close attention; not easily distracted.","zh":"专注的；注意力集中的；不易分心的。"},"examples":[{"en":"She stayed focussed during the exam and finished early.","zh":"考试时她一直很专注，所以提前完成了。"},{"en":"A focussed plan can save time and money.","zh":"一个重点明确的计划能节省时间和金钱。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “focus”: to direct attention or effort toward something.","zh":"“focus”的过去式/过去分词：把注意力或努力集中在某事上。"},"examples":[{"en":"They focussed on improving customer service.","zh":"他们把重点放在提升客户服务上。"},{"en":"He focussed his mind on the next step.","zh":"他把注意力集中在下一步上。"}]}],"synonyms":["focused","concentrated","attentive","intent","single-minded"],"phonetic":"/ˈfoʊkəst/","extraExplanation":["“focussed”是英式拼写中常见的形式（也常见于澳式等），相当于美式更常用的“focused”。两者意思相同；写作时注意与所在地区或机构的拼写规范保持一致。","在现代英语里，“focused”越来越普遍，但“focussed”在英式出版物中依然常见，尤其在较正式的文本里。"]}
{"word":"focusses","summary":{"en":"“Focusses” means “focuses” (gives attention to something). It’s a less common, mainly British spelling variant.","zh":"“focusses”表示“focuses（专注；关注）”，是一种较少见、偏英式的拼写变体。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Third-person singular present of “focus”: to give attention to something; to concentrate.","zh":"“focus”的第三人称单数现在时：把注意力集中在某事上；专注。"},"examples":[{"en":"She focusses on her studies during the week.","zh":"她在工作日专注于学习。"},{"en":"The report focusses on climate risks.","zh":"这份报告重点关注气候风险。"}]},{"partOfSpeech":"other","definition":{"en":"(British spelling variant) The same as “focuses.”","zh":"（英式拼写变体）同“focuses”。"},"examples":[{"en":"In British English, you may see “focusses,” but “focuses” is also common.","zh":"在英式英语里你可能会看到“focusses”，但“focuses”也很常见。"}]}],"synonyms":["concentrates","centers (on)","targets","emphasizes"],"phonetic":"/ˈfoʊkəsɪz/","extraExplanation":["“focusses”来自英语动词变形规则：以 -s 结尾的动词有时会出现双写 -s 再加 -es 的拼写（如 bias → biasses/ biases）。但在现代英语中，“focuses”在美式英语里更标准、更常见；英式英语里两种拼法都能见到，写作时建议保持一致。"]}
{"word":"focussing","summary":{"en":"“Focussing” means concentrating on something or bringing an image into clear focus. It’s a common British spelling of “focusing.”","zh":"“focussing”表示专注于某事或（相机等）对焦使画面清晰；它是“focusing”的常见英式拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the present participle of “focus”: giving special attention to one thing; concentrating","zh":"“focus”的现在分词：把注意力集中在某一件事上；专注"},"examples":[{"en":"She is focussing on her exams this month.","zh":"这个月她正专注于备考。"},{"en":"Try focussing on one task at a time.","zh":"尽量一次只专注做一件事。"},{"en":"The report is focussing mainly on safety issues.","zh":"这份报告主要聚焦在安全问题上。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) adjusting a camera, telescope, or eyes so that an image is clear; bringing into focus","zh":"（较少见）调整相机、望远镜或视线，使画面清晰；对焦"},"examples":[{"en":"He kept focussing the camera, but the photo was still blurry.","zh":"他一直在给相机对焦，但照片还是很模糊。"},{"en":"She is focussing the microscope to see the cells clearly.","zh":"她正在调显微镜的焦距，以便看清细胞。"}]}],"synonyms":["concentrating","paying attention","zeroing in (on)","homing in (on)","bringing into focus"],"phonetic":"/ˈfoʊkəsɪŋ/","extraExplanation":["“focussing”是英式拼写中常见的形式；美式英语更常写作“focusing”（只写一个 s）。两者意思相同。","规则提示：以重读音节结尾且以“辅音字母+元音字母+辅音字母”结尾的动词，在加 -ing / -ed 时英式英语更常双写末尾辅音（如 travelling）；但“focus”在美式中通常不双写。"]}

