{"word":"fod","summary":{"en":"“FOD” most commonly means Foreign Object Debris/Damage in aviation and safety contexts; it can also be a typo for “food.”","zh":"“FOD”最常见指航空与安全领域的“外来异物碎片/异物损伤”；也可能只是把“food”打错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Foreign Object Debris (also called Foreign Object Damage): unwanted objects (like rocks, tools, or metal pieces) on runways or work areas that can cause harm, especially to aircraft.","zh":"外来异物碎片（也常指外来异物造成的损伤）：指跑道或作业区域里不该出现的物体（如石子、工具、金属碎片等），可能造成危害，尤其对飞机。"},"examples":[{"en":"Before takeoff, the crew checked the runway for FOD.","zh":"起飞前，机组检查跑道上是否有FOD（外来异物碎片）。"},{"en":"A small bolt on the tarmac became FOD and damaged an engine.","zh":"停机坪上的一颗小螺栓成了FOD，导致发动机受损。"}]},{"partOfSpeech":"other","definition":{"en":"An informal or mistaken spelling/typing of “food” in texting or casual writing.","zh":"在短信或随意书写中，把“food（食物）”误写/误打成“fod”。"},"examples":[{"en":"I typed “fod” by accident—I meant “food.”","zh":"我不小心打成“fod”，本来想写“food（食物）”。"}]}],"synonyms":["foreign object debris","foreign object damage","runway debris"],"phonetic":"/fɑd/","extraExplanation":["在航空与军工语境里，FOD 非常常见：机场会有“FOD walk”（集体巡查捡异物）来降低事故风险。","有时你会看到标语“FOD kills”（FOD会致命/会导致严重事故），强调异物管理的重要性。"]}
{"word":"fodda","summary":{"en":"“Fodda” is a Scottish dialect spelling meaning “father.”","zh":"“fodda”是苏格兰方言写法，意思是“父亲/爸爸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish/UK informal, dialect) “father”; a spelling that shows a Scottish accent in speech or writing.","zh":"（苏格兰/英国非正式·方言）“父亲”；一种用拼写来表现苏格兰口音的写法。"},"examples":[{"en":"He’s away to see his fodda this weekend.","zh":"他这周末要去看他的爸爸。"},{"en":"My fodda taught me how to fish.","zh":"我爸爸教我怎么钓鱼。"}]}],"synonyms":["father","dad","daddy","papa","da"],"phonetic":"/ˈfɑdə/","extraExplanation":["“fodda”常见于苏格兰英语（Scots/Scottish English）对口音的书写表现：标准英语的 father /ˈfɑðər/ 里的 “th” 音在一些口音里会弱化或变化，写成 -dd- 来模仿听感。","它多用于对话、歌词、小说台词或幽默/亲密的表达；在正式写作中一般用 father。"]}
{"word":"fodder","summary":{"en":"Fodder means animal feed, and figuratively it can mean material that people use for talk, jokes, criticism, or news.","zh":"Fodder 指（家畜的）饲料；也可比喻为被人拿来议论、开玩笑、批评或报道的“素材/谈资”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food for farm animals (such as cows, sheep, or horses).","zh":"（家畜的）饲料，草料。"},"examples":[{"en":"In winter, farmers store hay as fodder for the cattle.","zh":"冬天农民会储存干草作为牛的饲料。"},{"en":"The drought made it hard to find enough fodder for the animals.","zh":"干旱让动物很难找到足够的饲料。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that is used as material for a purpose—often for talk, criticism, jokes, or news (sometimes implying it will be consumed quickly or carelessly).","zh":"（用于某种目的的）素材；谈资；被批评/开玩笑/报道的对象（常含“被消耗、被随意利用”的意味）。"},"examples":[{"en":"His mistake became fodder for the late-night comedians.","zh":"他的失误成了深夜脱口秀的笑料。"},{"en":"The scandal provided fodder for endless gossip.","zh":"那起丑闻给无休止的八卦提供了谈资。"},{"en":"Small details can be fodder for a good story.","zh":"小细节也能成为好故事的素材。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In compounds) Related to animal feed, especially in agriculture.","zh":"（用于复合词）与饲料有关的，尤指农业语境。"},"examples":[{"en":"They planted fodder crops to feed their goats.","zh":"他们种了饲料作物来喂山羊。"}]}],"synonyms":["feed","animal feed","forage","provender","material","fuel"],"phonetic":"/ˈfɑdər/","extraExplanation":["“fodder”既可指真实的动物饲料，也常用于比喻：某事成了他人“消遣/议论/攻击”的材料（如媒体报道、网络评论、喜剧段子）。这种比喻用法带有一点“被拿来消费”的语气。","常见搭配：fodder for debate/criticism/jokes/gossip（成为争论/批评/笑话/八卦的素材）；cannon fodder（“炮灰”，指在战争或斗争中被当作可牺牲的人）。"]}
{"word":"fodder crop","summary":{"en":"a plant crop grown to feed livestock","zh":"用于喂养牲畜的饲料作物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a crop grown to feed farm animals (as hay, silage, or grazing plants)","zh":"（用于）饲养家畜的饲料作物（如干草、青贮饲料或牧草等）"},"examples":[{"en":"Corn can be grown as a fodder crop for cattle, especially when made into silage.","zh":"玉米可以作为牛的饲料作物种植，尤其是做成青贮饲料时。"},{"en":"The farm planted a fodder crop to get through the winter without buying extra feed.","zh":"农场种了饲料作物，以便过冬时不用额外购买饲料。"}]}],"synonyms":["feed crop","forage crop"],"phonetic":"/ˈfɑdər krɑp/","extraExplanation":["常见饲料作物包括苜蓿（alfalfa）、三叶草（clover）、黑麦草（ryegrass）、玉米（corn，用于青贮silage）、高粱（sorghum）等。","在农业语境里，fodder crop强调“种植目的：喂牲畜”，不同于主要供人食用的粮食作物（food crop）。"],"etymology":"“fodder”源自古英语，原意与“饲料/喂养”相关；“crop”指“作物”。合起来就是“用来做饲料的作物”。","mnemonic":["把“fodder”记成“food（食物）+ -er（用于…的）”，联想到“给动物吃的食物”。","“crop”=作物；“fodder crop”=“饲料+作物”，直译就好记。"]}
{"word":"fodder crops","summary":{"en":"crops grown to feed livestock","zh":"用于饲养家畜的作物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"plants grown specifically to feed livestock (such as cows, sheep, or horses), often harvested as hay, silage, or fresh forage","zh":"专门种来喂养家畜（如牛、羊、马等）的作物，常被收割做成干草、青贮或直接作为鲜草饲喂"},"examples":[{"en":"The farm grows fodder crops to feed cattle through the winter.","zh":"这家农场种植饲料作物，用来在冬天喂牛。"},{"en":"Corn and alfalfa are common fodder crops in many regions.","zh":"在许多地区，玉米和苜蓿是常见的饲料作物。"},{"en":"Because of drought, the supply of fodder crops dropped sharply this year.","zh":"由于干旱，今年饲料作物的供应量大幅下降。"}]}],"synonyms":["feed crops","forage crops","livestock feed","animal feed","forage"],"phonetic":"/ˈfɑdɚ krɑps/","extraExplanation":["常见类别包括：牧草/饲草（forage，如黑麦草、苜蓿）、青贮作物（silage crops，如青贮玉米）、以及用于制作干草的作物（hay crops）。","在农业语境里，“fodder crops”强调用途是“饲喂”，不一定用于人类食用；但有些作物（如玉米）既可做人食也可做饲料，需看具体用途。"],"etymology":"“fodder”源自古英语 fōdor，原意与“食物/饲料”相关；“crop”源自古英语 crop(p)，指“收成、收获的作物”。组合成短语后，专指“用来喂牲畜的作物”。","mnemonic":["把它拆开记：fodder≈“饲料”，crops≈“作物”，合起来就是“饲料作物”。","联想中文“草料”=草（crop）+料（fodder）：给牲畜吃的“料”。"]}
{"word":"foddered","summary":{"en":"“Foddered” means “fed with fodder,” or (figuratively) “used as material for gossip, news, jokes, or criticism.”","zh":"“foddered”表示“用饲料喂养过的”；也可比喻“被当作谈资/素材来消费或评论”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “fodder”) to feed farm animals with fodder (dry food such as hay or grain).","zh":"（“fodder”的过去式/过去分词）用饲料（如干草、谷物等）喂养家畜。"},"examples":[{"en":"The cattle were foddered before the storm arrived.","zh":"暴风雨来临前，牛已经被喂过饲料了。"},{"en":"In winter, the sheep are foddered indoors.","zh":"冬天，羊通常在室内喂养。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) used as material for discussion, criticism, jokes, news, or art—treated as something to “feed” an audience.","zh":"（比喻）被当作谈资、批评对象、笑料、新闻素材或艺术素材——像“喂给”观众/大众的材料。"},"examples":[{"en":"His small mistake was foddered for office gossip.","zh":"他的小失误成了办公室八卦的谈资。"},{"en":"The interview was foddered into headlines and memes.","zh":"那次采访被加工成了新闻标题和网络梗。"}]}],"synonyms":["fed","given fodder","supplied","used as material","exploited"],"phonetic":"ˈfɑdərd","extraExplanation":["“fodder”本义是“饲料”（名词），也可作动词表示“用饲料喂养”。在新闻与社交媒体语境里，常用比喻义：某事被“当作素材/谈资”，带有“被消费、被拿来做文章”的意味。"]}
{"word":"fodderer","summary":{"en":"A fodderer is someone who feeds or supplies fodder to livestock.","zh":"fodderer 指给牲畜喂草料或供应饲料的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supplies or feeds fodder (animal feed) to livestock; a feeder or farmhand who feeds animals","zh":"给牲畜供应或喂草料（饲料）的人；喂养牲畜的饲养员/农场工人"},"examples":[{"en":"The fodderer went out before dawn to feed the cattle.","zh":"喂草料的人天没亮就出去给牛喂食了。"},{"en":"On a small farm, one person may act as the herdsman and the fodderer.","zh":"在小农场里，一个人可能既是牧人也是喂饲料的人。"}]}],"synonyms":["feeder","farmhand","stable hand","herdsman"],"phonetic":"/ˈfɑdərər/","extraExplanation":["“fodderer”在现代英语里比较少见，更多时候会用更常见的说法，如“animal feeder”“farmhand”“stable hand”等；在较早的农业语境或方言中更容易看到。","词根来自“fodder”（饲料、草料）+ 后缀“-er”（做某事的人），字面意思就是“给（动物）饲料的人”。"]}
{"word":"foddering","summary":{"en":"“Foddering” means feeding livestock with fodder, or (figuratively) supplying material that fuels debate, rumors, or jokes.","zh":"“foddering”指用草料喂养牲畜；也可比喻为提供引发讨论、谣言或玩笑的素材。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"feeding animals with fodder (dry food such as hay or silage); the act of giving livestock food.","zh":"（用草料等）喂养牲畜；给家畜投喂饲料的行为。"},"examples":[{"en":"During winter, farmers spend a lot of time foddering the cattle.","zh":"冬天里，农民要花很多时间给牛喂草料。"},{"en":"Good foddering helps sheep stay healthy when fresh grass is not available.","zh":"当没有新鲜青草时，良好的投喂草料能帮助羊保持健康。"}]},{"partOfSpeech":"v.","definition":{"en":"providing someone or something with material to use (often ideas, stories, or information), sometimes implying it will be used for discussion, criticism, or entertainment.","zh":"（比喻）给某人/某事提供“素材”（常指观点、故事或信息）；有时暗示会被拿来讨论、批评或取乐。"},"examples":[{"en":"His careless comments kept foddering the rumors online.","zh":"他不经意的言论不断给网络谣言“提供素材”。"},{"en":"The report is foddering a public debate about housing costs.","zh":"这份报告正在为关于住房成本的公共讨论提供素材。"}]},{"partOfSpeech":"n.","definition":{"en":"the process or practice of feeding animals with fodder.","zh":"投喂草料的过程；喂养（牲畜）的做法。"},"examples":[{"en":"Foddering is essential on farms in cold climates.","zh":"在寒冷地区的农场，投喂草料是必不可少的。"}]}],"synonyms":["feeding","feeding livestock","supplying","providing","fueling"],"phonetic":"/ˈfɑdərɪŋ/","extraExplanation":["“foddering”更常见于农业语境，作为动词“fodder”的现在分词（foddering）或名词用法。日常英语里，人们更常说“feeding the animals / feeding cattle”。","比喻用法来自“fodder=（给动物吃的）草料/饲料”，引申为“可被消耗的材料”，常见搭配是“fodder for debate/criticism/jokes”（供讨论/批评/开玩笑的素材）。"]}
{"word":"fodderless","summary":{"en":"“Fodderless” means having no animal feed; more rarely, it can mean lacking resources or material.","zh":"“fodderless”指没有饲料（草料）的；较少见地也可指缺乏资源或素材的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no fodder (animal feed); without food for livestock.","zh":"（牲畜）没有饲料的；缺乏草料的。"},"examples":[{"en":"After the drought, many farms were fodderless and had to sell their cattle.","zh":"干旱过后，许多农场缺乏饲料，只好卖掉牛群。"},{"en":"The traveler found a fodderless stable and an exhausted horse.","zh":"旅行者发现马厩里没有草料，马也疲惫不堪。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, rare) Lacking material or support to work with; short of resources or ideas.","zh":"（比喻，少见）缺少可用材料/支撑的；资源或思路不足的。"},"examples":[{"en":"Without reliable data, the report felt fodderless and unconvincing.","zh":"没有可靠数据，这份报告显得“没有素材”，缺乏说服力。"},{"en":"The discussion became fodderless once everyone ran out of examples.","zh":"当大家都拿不出例子时，讨论就变得缺乏内容了。"}]}],"synonyms":["without fodder","unfed","feedless","lacking","short of","resource-poor"],"phonetic":"ˈfɑdɚləs","extraExplanation":["“fodderless”由 fodder（饲料、草料）+ -less（没有……的）构成，字面意思很直观，但在现代英语中较少见，更常用的说法是 “without fodder / no feed”。\n比喻用法也不常见；若想表达“缺少素材/论据”，更自然的表达包括 “thin on evidence,” “lacking support,” “short on material”。"]}
{"word":"fodders","summary":{"en":"Fodder means animal feed, and it can also mean material or information used as ‘fuel’ for discussion or jokes.","zh":"Fodder 指牲畜饲料；也可指可用来讨论或取笑的素材/谈资。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food for farm animals (especially dry food like hay or grain).","zh":"（尤指干草、谷物等）牲畜饲料。"},"examples":[{"en":"The farmer stored hay as fodder for the winter.","zh":"农民储存干草作为冬天的饲料。"},{"en":"They bought extra fodder when the drought reduced grazing land.","zh":"干旱导致牧草地减少，他们就多买了一些饲料。"}]},{"partOfSpeech":"n.","definition":{"en":"Information, ideas, or material that can be used for discussion, criticism, humor, or creative work.","zh":"（可用于讨论、批评、取笑或创作的）素材，谈资。"},"examples":[{"en":"His careless tweet became fodder for late-night comedy shows.","zh":"他那条草率的推文成了深夜脱口秀的素材。"},{"en":"New research provides fodder for the debate about education policy.","zh":"新的研究为教育政策的争论提供了素材。"}]}],"synonyms":["feed","forage","hay","provender","material","fuel (for discussion)","grist for the mill"],"phonetic":"/ˈfɑdɚ/","extraExplanation":["你输入的“fodders”是复数形式，基本词是“fodder”。在“饲料”这个意思上，fodder 常作不可数名词（much fodder），但在强调“不同种类/批次的饲料”时也会用复数 fodders。","比喻用法里（“谈资/素材”）很常见，语气中性，有时暗示“被拿来炒作或取笑”。常见搭配：fodder for debate/criticism/comedy。"]}
{"word":"foder","summary":{"en":"Fodder means animal feed, and more figuratively, material used for talk, jokes, or writing.","zh":"Fodder 指（家畜的）饲料；也可比喻指用于讨论、笑料或写作的素材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food for farm animals (such as hay, grass, or grain).","zh":"（家畜的）饲料（如干草、牧草或谷物）。"},"examples":[{"en":"The farmer stored hay as winter fodder for the cows.","zh":"农夫储存干草作为冬天喂牛的饲料。"},{"en":"Drought can reduce fodder and make it hard to feed animals.","zh":"干旱会减少饲料来源，让喂养牲畜变得困难。"}]},{"partOfSpeech":"n.","definition":{"en":"Material or ideas used to support discussion, jokes, criticism, or writing.","zh":"（用于讨论、笑料、批评或写作的）素材；话题来源。"},"examples":[{"en":"The scandal became fodder for late-night comedy shows.","zh":"那起丑闻成了深夜脱口秀的笑料素材。"},{"en":"Her travel notes provided fodder for a short story.","zh":"她的旅行笔记为一篇短篇小说提供了素材。"}]}],"synonyms":["feed","animal feed","forage","material","fuel (for discussion)"],"phonetic":"/ˈfɑdər/","extraExplanation":["你输入的“foder”通常是拼写错误；正确拼写更常见的是“fodder”（饲料/素材）。","“fodder”在比喻用法里常带一点“被拿来消费、拿来做文章”的感觉，例如“fodder for gossip”（八卦的谈资）。"]}
{"word":"fodge","summary":{"en":"“Fudge” means a sweet candy, or (as a verb) to avoid exact truth by being unclear or slightly dishonest.","zh":"“fudge”既指一种软糖，也可作动词表示含糊其辞或稍微不诚实地蒙混过去。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, rich candy made mainly from sugar, butter, and milk (often with chocolate or nuts)","zh":"软糖；（常含巧克力或坚果的）奶油糖"},"examples":[{"en":"Would you like a piece of chocolate fudge?","zh":"你想来一块巧克力软糖吗？"},{"en":"She bought some fudge as a gift from the seaside shop.","zh":"她从海边的小店买了些软糖当礼物。"}]},{"partOfSpeech":"v.","definition":{"en":"to deal with something in an unclear or slightly dishonest way; to avoid giving exact details","zh":"含糊其辞；（略带不诚实地）蒙混过去；回避给出精确信息"},"examples":[{"en":"He fudged the numbers to make the report look better.","zh":"他篡改了数据，让报告看起来更好。"},{"en":"When asked directly, she fudged her answer.","zh":"被直接问到时，她含糊地回答了。"}]}],"synonyms":["(n.) candy","(n.) confection","(v.) distort","(v.) manipulate","(v.) evade"],"phonetic":"/fʌdʒ/","extraExplanation":["“fodge”通常不是标准拼写；你可能想查的是 **fudge**。在英语里，fudge 作动词时常带有“把事实说得不精确、刻意模糊”的负面意味。","文化小知识：英语感叹词 **Fudge!** 有时用来代替更粗口的词（更委婉的骂法），类似“可恶！”但使用频率不如更常见的替代词（如 darn）。"]}
{"word":"fodgel","summary":{"en":"“Fodgel” is a rare dialect word, usually meaning a clumsy/stout person or to move awkwardly.","zh":"“fodgel”是罕见的方言词，常指笨拙/矮胖的人，或指笨拙地移动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, dialect; not standard modern English) A clumsy, awkward, or stout person; a dumpy fellow.","zh":"（罕见方言；非现代标准英语）笨拙、行动不灵活或矮胖的人；笨汉。"},"examples":[{"en":"In some old dialect writing, he’s described as a “fodgel” who keeps bumping into things.","zh":"在一些旧方言作品里，他被形容为一个总是撞来撞去的“fodgel”（笨拙的人）。"},{"en":"Don’t call people names like “fodgel”—it can sound insulting.","zh":"别用“fodgel”这种称呼来骂人——听起来很冒犯。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, dialect) To move in a clumsy or awkward way; to lumber about.","zh":"（罕见方言）笨拙地移动；踉跄、笨重地走动。"},"examples":[{"en":"He fodgelled across the muddy yard, trying not to slip.","zh":"他在泥泞的院子里笨拙地挪过去，尽量不滑倒。"}]}],"synonyms":["clumsy person","lumber (about)","lout (informal)"],"phonetic":"/ˈfɑdʒəl/","extraExplanation":["“fodgel”在现代常用词典里很少见，更多出现在旧方言/地方用语或仿方言的文学描写中，因此你在日常英语里几乎不会遇到。","也可能是拼写误差：你想查的可能是“fudge”（糊弄/软糖）、“fuddle”（把人灌糊涂/迷糊）、或别的相近拼写。若你能提供一句原文语境，我可以帮你更准确判断。"]}
{"word":"fodient","summary":{"en":"Fodient means “digging/burrowing,” a rare technical adjective used mainly in zoology.","zh":"Fodient 指“挖掘/掘洞的”，是主要用于动物学等领域的罕见形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Digging or burrowing; adapted for digging.","zh":"（罕见/技术用语）挖掘的；掘洞的；适于挖掘的。"},"examples":[{"en":"Badgers are fodient animals, using strong forelimbs to dig setts.","zh":"獾是掘洞动物，会用强壮的前肢挖掘洞穴。"},{"en":"The museum display compared cursorial (running) and fodient (digging) limbs.","zh":"博物馆展览对比了善跑（cursorial）和善挖（fodient）的四肢结构。"}]}],"synonyms":["burrowing","digging","excavating"],"phonetic":"/ˈfoʊdiənt/","extraExplanation":["“fodient”源自拉丁语动词 *fodere / fodio*（挖、掘）。在现代英语中非常少见，多见于动物学/形态学的描述，用来和 *cursorial*（善跑的）、*arboreal*（树栖的）、*aquatic*（水生的）等词并列。","读到“fodient mammals”之类表达时，通常指“擅长挖洞、以掘洞为重要生存方式或身体结构明显适应挖掘的哺乳动物”。"]}
{"word":"fodientia","summary":{"en":"Fodientia is a Latin form meaning “digging/burrowing,” used for creatures or things that dig.","zh":"fodientia 是拉丁语形式，意为“挖掘的/会打洞的”，多指会挖掘的生物或事物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) “digging; burrowing,” referring to things that dig (often used as a neuter plural participle/adjective, like “digging things” or “creatures that burrow”).","zh":"（拉丁语）“正在挖掘的；会打洞的”，指正在挖或会挖掘的事物（常作中性复数分词/形容词用法，可理解为“挖掘之物/会打洞的生物”）。"},"examples":[{"en":"In the Latin phrase “animalia fodientia,” it means “burrowing animals.”","zh":"在拉丁语短语“animalia fodientia”中，它表示“穴居/会打洞的动物”。"},{"en":"The text contrasts birds with “fodientia,” meaning creatures that dig in the earth.","zh":"文本把鸟类与“fodientia”作对比，意为在土里挖掘的生物。"}]}],"synonyms":["digging","burrowing","tunneling"],"phonetic":"/foʊdiˈɛntiə/","extraExplanation":["“fodientia”来自拉丁动词“fodere”（挖、掘）。它通常是现在分词“fodiens”的中性复数形式，用来当作形容词或名词化表达，描述“正在挖掘的（事物/生物）”。","这不是现代英语常用词；在英文资料里多见于引用拉丁原文、分类学/博物学语境或古典文献注释。"]}

