{"word":"foe","summary":{"en":"Foe means an enemy, often used in a more literary or formal way than “enemy.”","zh":"foe 指“敌人”，语气较文学或正式，比 enemy 更常见于故事或演讲中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enemy; someone who is actively against you, your group, or your goals.","zh":"敌人；与您（或您的团体、目标）对立的人。"},"examples":[{"en":"In the story, the hero must face his greatest foe.","zh":"在故事里，英雄必须面对他最强大的敌人。"},{"en":"They put aside old grudges and stopped treating each other like foes.","zh":"他们放下旧怨，不再把彼此当作敌人。"},{"en":"Fear can be your worst foe if you let it control you.","zh":"如果让恐惧控制你，它可能成为你最可怕的敌人。"}]}],"synonyms":["enemy","opponent","adversary","rival","antagonist"],"phonetic":"/foʊ/","extraExplanation":["“foe”带有较强的文学/正式语气，在小说、史诗、演讲中常见（如“face the foe”）。日常口语里更常用“enemy”。","常见搭配：arch-foe（宿敌/死对头）、a worthy foe（势均力敌的对手）、defeat one’s foe（击败敌人）。","词源上“foe”来自古英语，原意与“enemy”相近，但现代英语里更偏“对抗性的敌人/宿敌”的感觉。"]}
{"word":"foederal","summary":{"en":"Federal means “related to the national (central) government,” especially in a federal system (e.g., the U.S.).","zh":"Federal 指“联邦的、中央（国家）政府的”，尤常用于联邦制国家（如美国）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Correct spelling: federal) related to a central (national) government, especially in a country where power is shared between the national government and states/provinces.","zh":"（正确拼写：federal）联邦的；中央（国家）政府的，尤指在联邦制国家中，国家与州/省分享权力的体制。"},"examples":[{"en":"Federal law applies across the whole country.","zh":"联邦法律适用于全国范围。"},{"en":"She works for the federal government.","zh":"她在联邦政府工作。"},{"en":"The case was moved to federal court.","zh":"该案件被移送到联邦法院。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports a federal system of government (less common in everyday conversation).","zh":"支持联邦制的人（口语中相对少见）。"},"examples":[{"en":"In the debate, the federals argued for stronger national coordination.","zh":"在辩论中，联邦制支持者主张加强国家层面的协调。"}]}],"synonyms":["national","central-government","governmental","federated"],"phonetic":"/ˈfɛdərəl/","extraExplanation":["你输入的“foederal”通常是“federal”的拼写错误：f-e-d-e-r-a-l（不是 f-o-e-）。英语里很多人会把中间的元音写错，记忆方法是把它和“federation（联邦）/ federate（结成联邦）”联想在一起。","“federal”在美国语境中很常见：如 federal taxes（联邦税）、federal agencies（联邦机构，如 FBI）、federal court（联邦法院）。与之相对的常见词是“state（州的）”。"]}
{"word":"foederati","summary":{"en":"Foederati were treaty-based allied foreign troops/groups in the late Roman Empire.","zh":"Foederati 指罗马帝国晚期通过条约结盟、以军役换取利益的外邦盟军/部队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In the late Roman Empire, foreign allied groups or troops who made a treaty with Rome to provide military service, often in exchange for land, money, or autonomy.","zh":"（罗马帝国晚期）与罗马订立条约的外邦盟军/盟军部队，通常以提供军事服务换取土地、金钱或一定自治。"},"examples":[{"en":"Many foederati fought alongside Roman soldiers to defend the empire’s borders.","zh":"许多 foederati 与罗马士兵并肩作战，保卫帝国边境。"},{"en":"Some foederati settled inside the empire and later became powerful regional rulers.","zh":"一些 foederati 在帝国内定居，后来甚至成为强大的地方统治者。"}]}],"synonyms":["allied troops","treaty allies","Roman federates","auxiliaries (context-dependent)"],"phonetic":"/ˌfiːdəˈrɑːtaɪ/","extraExplanation":["foederati 是拉丁语复数（单数：foederatus），来自 foedus，意为“条约、盟约”。英语里常直接用复数 foederati 来指代这一类群体。","历史语境中，foederati 常与哥特人（Goths）、法兰克人（Franks）等“蛮族”部落联系在一起：他们名义上是罗马的盟友，但随着时间推移，有的逐渐脱离控制，成为西罗马衰亡过程中的关键因素之一。","在阅读历史著作时，可把 foederati 理解为“条约盟军/雇佣盟军”，但它不仅是雇佣兵概念，更强调“以条约为基础的互惠关系”。"]}
{"word":"foederatus","summary":{"en":"A treaty-bound ally (often a foreign group or soldier) in the late Roman Empire who provided military service to Rome.","zh":"（罗马晚期）通过条约与罗马结盟、并为其提供军事服务的外族部族或战士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In late Roman history, a foreign people or a warrior bound to Rome by a treaty (foedus), often providing military service in exchange for land or payment.","zh":"（罗马帝国晚期史）与罗马通过条约（foedus）结盟的外族部族或战士，常以提供军役换取土地或报酬。"},"examples":[{"en":"Some Gothic groups entered the empire as foederati and served in the Roman army.","zh":"一些哥特人集团以 foederati 的身份进入帝国，并在罗马军队中服役。"},{"en":"The general relied on foederati to reinforce his weakened legions.","zh":"这位将领依靠 foederati 来增援他实力削弱的军团。"}]}],"synonyms":["treaty ally","federate (historical)","allied troops"],"phonetic":"/ˌfiːdəˈrɑːtəs/","extraExplanation":["foederatus 是拉丁词，来自 foedus（“条约、盟约”）。复数常见为 foederati。英语里多用于历史语境，尤其指西罗马晚期把部分“蛮族”以盟约形式安置在帝国内、并让其承担军事义务的做法。","需要注意：foederati 并不一定等同于“雇佣兵”。他们往往是以群体（部族/军团）形式与罗马谈判，法律地位、义务和待遇会因条约内容而不同。"]}
{"word":"foederis","summary":{"en":"Foederis is Latin for “of a treaty/covenant” (genitive singular of foedus).","zh":"foederis 是拉丁语，意为“条约/盟约的”（foedus 的单数属格）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) “of a treaty/covenant”; the genitive singular form of foedus (“treaty, pact, alliance”).","zh":"（拉丁语）“条约/盟约的”；foedus（“条约、盟约、同盟”）的单数属格形式。"},"examples":[{"en":"The phrase is Latin: foederis means “of the covenant.”","zh":"这个短语是拉丁语：foederis 的意思是“盟约的/条约的”。"},{"en":"In classical texts, you may see foedus (treaty) and foederis (of a treaty) in the same paragraph.","zh":"在古典文本中，你可能会在同一段里看到 foedus（条约）和 foederis（条约的/关于条约的）。"}]}],"synonyms":["(Latin) foedus (base form)","treaty","covenant","pact"],"phonetic":"/ˈfiːdərɪs/","extraExplanation":["foederis 不是常见英语单词，而是拉丁语词形（属格），常出现在校训、徽章、法律或神学拉丁语短语中，用来表示“……的”。","词根 foedus 表示“条约、盟约、同盟”。因此 foederis 常可理解为“条约的 / 盟约的 / 同盟的”。具体翻译要看它后面所修饰的名词。","拼写里的 oe 来自拉丁语二合元音；在英语化读法里常被简化为单元音（有时读作 /iː/，类似 fetus/foetus 的关系）。"]}
{"word":"foeffment","summary":{"en":"Feoffment is a historical legal term for the formal transfer of land under the feudal system (or the document for it).","zh":"Feoffment 是法律史用语，指封建制度下土地的正式转让（或该转让文书）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, historical) The act of granting or transferring land (a freehold estate) under the old feudal system, traditionally by a formal ceremony; also, the document recording this transfer.","zh":"（法律·历史用语）在旧封建制度下授予或转让土地（自由保有地产）的行为，传统上常通过正式仪式完成；也指记录该转让的文书。"},"examples":[{"en":"In medieval England, a feoffment could be completed by a public ceremony on the land itself.","zh":"在中世纪的英格兰，feoffment 有时会在土地上通过公开仪式完成。"},{"en":"Modern property law uses deeds, so the word “feoffment” is mainly seen in older cases and textbooks.","zh":"现代不动产法使用 deed（契据），所以 “feoffment” 主要出现在旧判例和教材里。"}]}],"synonyms":["conveyance","grant","transfer (of land)","deed (modern equivalent)"],"phonetic":"/ˈfiːfmənt/","extraExplanation":["“foeffment”通常被视为“feoffment”的拼写变体或常见误拼。标准拼写更常见的是 feoffment。","feoffment 源自 feoff（封建领地授予），核心做法与“livery of seisin”（象征性移交占有/占有权的仪式）有关，例如当众在土地上交付一撮土、树枝等象征物，以表示土地占有的移转。","该术语多见于英美法的历史语境：今天土地转让通常通过签署并登记契据（deed）完成，因此 feoffment 在日常英语中非常少用，更多是法律史或古旧文献用词。"]}
{"word":"foehn","summary":{"en":"A foehn is a warm, dry downslope wind on the leeward side of mountains.","zh":"foehn 指山脉背风坡吹下来的温暖、干燥的下坡风（焚风）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warm, dry wind that blows down the leeward side of a mountain range, caused by air losing moisture as it rises and then warming as it descends","zh":"焚风：一种温暖、干燥的下坡风，常出现在山脉背风坡；空气上升时失去水分，下降时增温而变得更干燥"},"examples":[{"en":"A foehn wind can melt snow surprisingly fast in the valleys.","zh":"焚风会让山谷里的积雪融化得出奇地快。"},{"en":"The sudden warmth was explained by a foehn coming down from the mountains.","zh":"突如其来的暖意，是因为焚风从山上吹下来了。"}]}],"synonyms":["foehn wind","downslope wind","warm dry wind","Chinook (regional)"],"phonetic":"/fɝn/","extraExplanation":["“Foehn”一词来自德语，常用来描述阿尔卑斯山地区的这种下坡暖干风；英语里也会用更通用的说法“foehn wind”。","类似现象在不同地区有不同名称：北美落基山的“Chinook（奇努克风）”、南美安第斯山的“Zonda”等，都属于同一类“下坡增温、变干”的山地风。","发音上常见两种：较接近英语化的 /ˈfɜːn/，以及更贴近德语的“feɪn”式读法；学习时用一种稳定发音即可。"]}
{"word":"foehnlike","summary":{"en":"“Foehnlike” means resembling a warm, dry downslope mountain wind (a föhn).","zh":"“foehnlike”指“类似焚风的”，即山脉背风坡下沉增温、干燥的暖风/天气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of weather or wind) resembling a föhn: a warm, dry wind that blows down the leeward side of mountains.","zh":"（指天气或风）类似焚风的：指山脉背风坡向下吹的温暖、干燥的风。"},"examples":[{"en":"By afternoon, a foehnlike wind dried the valley quickly after the morning rain.","zh":"到下午，一阵类似焚风的暖干风很快把山谷里早晨的雨水蒸干了。"},{"en":"The forecast warns of foehnlike conditions, with unusually warm, dry air and low humidity.","zh":"预报提醒将出现类似焚风的状况：空气异常温暖干燥、湿度很低。"}]}],"synonyms":["föhn-like","chinook-like","downslope","warm and dry"],"phonetic":"/ˈfɝnˌlaɪk/","extraExplanation":["“Foehnlike”来自“föhn（焚风）”，常用于气象语境，强调“越过山脉后下沉增温、变得干燥”的风与天气特征。","英语里不同地区会用更本地化的词：如北美落基山脉常说“Chinook（奇努克风）”，南加州常说“Santa Ana winds（圣安娜风）”。“foehnlike”更像是概括性的学术/描述用语。","拼写上也常见“föhn-like / foehn-like / föhnlike”等变体；带变音符“ö”的写法更偏学术或欧式拼写。"]}
{"word":"foehns","summary":{"en":"Foehns are warm, dry downslope winds (especially in the Alps); less commonly, the word can mean hair dryers in some European usage.","zh":"Foehns 指（尤在阿尔卑斯山）温暖、干燥的下坡焚风；较少见时也可指吹风机（部分欧洲语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of foehn: a warm, dry wind that blows down the leeward side of mountains (especially the Alps), often causing rapid snowmelt and a sudden rise in temperature.","zh":"foehn 的复数：焚风（尤指阿尔卑斯山一带的“焚风”），一种从山脉背风坡吹下的温暖、干燥的下坡风，常导致气温骤升与积雪快速融化。"},"examples":[{"en":"In spring, foehns can melt snow surprisingly fast in Alpine valleys.","zh":"在春季，焚风会让阿尔卑斯山谷里的积雪以惊人的速度融化。"},{"en":"After several days of cold weather, the arrival of foehns brought clear skies and warmer air.","zh":"在连续几天寒冷天气之后，焚风的到来带来了晴朗天空和更温暖的空气。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) plural of foehn meaning a hair dryer; used mainly in some European contexts influenced by German.","zh":"（较少见）foehn 的复数：吹风机；多见于受德语影响的欧洲语境。"},"examples":[{"en":"The hotel provides towels and foehns in every bathroom.","zh":"酒店每间浴室都提供毛巾和吹风机。"}]}],"synonyms":["chinook","downslope wind","föhn wind","warm dry wind"],"phonetic":"/fɝn/","extraExplanation":["“Foehn / föhn”源自德语 Föhn，英语里常写作 foehn（不带变音符号 ö），复数可写 foehns。气象学上它属于“下坡增温、变干”的山地风类型；在北美与之相似的现象常被称为 chinook（奇努克风）。","在文学与旅行写作中，foehn 常用来营造“突然转暖、空气变干、天气转晴”的氛围；有时也会提到它让人感到头痛、烦躁等（民间说法较多，具体因人而异）。"]}
{"word":"foeish","summary":{"en":"“Foeish” means “hostile; like an enemy,” but it is very rare in modern English.","zh":"“foeish”意为“敌对的；像敌人一样的”，但在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Like a foe; hostile or unfriendly in attitude.","zh":"（罕用）像敌人一样的；敌对的；不友善的。"},"examples":[{"en":"His foeish tone made the conversation feel like an argument.","zh":"他那种敌对的语气让谈话听起来像在争吵。"},{"en":"They exchanged foeish looks across the room.","zh":"他们在房间里隔空交换了敌意的眼神。"}]}],"synonyms":["hostile","unfriendly","antagonistic","inimical","adversarial"],"phonetic":"/ˈfoʊ.ɪʃ/","extraExplanation":["“foeish”是由“foe（敌人）+ -ish（有点……的、像……的）”构成的形容词，但在现代英语里非常少见。日常更常用的是“hostile / unfriendly / antagonistic / inimical”。","如果你是在读诗歌、古文或较文学化的文本里看到“foeish”，它通常用来强调一种“带敌意、像对手一样”的气氛，而不一定指真实的战争或正式的敌人。"]}
{"word":"foeless","summary":{"en":"Foeless means having no enemies or opposition.","zh":"foeless 指“没有敌人或反对者的；无仇敌的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without enemies or opposition; having no foes.","zh":"没有敌人（或反对者）的；无仇敌的。"},"examples":[{"en":"They hoped for a foeless future after the treaty was signed.","zh":"条约签署后，他们希望迎来一个没有敌人的未来。"},{"en":"In the story, the hero dreams of a foeless land where people live in peace.","zh":"在故事里，英雄梦想着一个无仇敌、人人和平共处的国度。"}]}],"synonyms":["enemy-free","unopposed","peaceful"],"phonetic":"/ˈfoʊləs/","extraExplanation":["“foeless”由“foe（敌人）+ -less（无、没有）”构成，意思直观，但在现代英语中比较少见，更常见的表达是“without enemies / enemy-free / peaceful”。","这个词带一点文学/诗意色彩，常用于描写理想化的和平状态，而不是日常对话。"]}
{"word":"foelike","summary":{"en":"Foelike means ‘like an enemy’ or ‘hostile.’","zh":"foelike 意为“像敌人一样的；敌对的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an enemy; hostile in a way that feels like a foe.","zh":"像敌人一样的；敌对的；带有“仇敌般”敌意的。"},"examples":[{"en":"He gave me a foelike stare that made the room feel cold.","zh":"他用一种仇敌般的眼神盯着我，让房间都变得冷了。"},{"en":"The newspaper described the crowd’s foelike mood toward the speaker.","zh":"报纸形容人群对演讲者抱有敌对（仇敌般）的情绪。"}]}],"synonyms":["hostile","enemy-like","adversarial","antagonistic","unfriendly"],"phonetic":"/ˈfoʊlaɪk/","extraExplanation":["“foelike”由“foe（敌人）+ -like（像……一样的）”构成，语气偏文学/修辞，用来强调“像仇敌那样”的感觉。日常英语里更常用 hostile、enemy-like、adversarial 等表达。"]}
{"word":"foeman","summary":{"en":"Foeman means an enemy or opponent; it sounds old-fashioned and is common in literary or historical-style writing.","zh":"Foeman 指“敌人/对手”，语感偏古雅，常用于文学或历史风格的写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enemy or opponent, especially in a fight, war, or serious conflict.","zh":"敌人；对手（尤指战斗、战争或严重冲突中的）"},"examples":[{"en":"The hero faced his foeman on the battlefield.","zh":"英雄在战场上面对他的敌人。"},{"en":"In the story, the knight swore to protect the village from its foemen.","zh":"在故事里，骑士发誓要保护村庄免受敌人的侵害。"}]}],"synonyms":["enemy","foe","opponent","adversary"],"phonetic":"/ˈfoʊmən/","extraExplanation":["“foeman”是比较古雅/文学化的词，现代英语更常用“enemy”或“opponent”。因此它常出现在史诗、骑士故事、古风奇幻作品或较正式的写作里，用来营造庄重或古典的氛围。","词源上可拆看为“foe（敌人）+ man（人）”，意思就是“敌方的人”。在一些旧文本中也会出现复数“foemen”。"]}
{"word":"foemanship","summary":{"en":"Foemanship means (rarely, often humorously) the skill or tactics of being an effective opponent.","zh":"Foemanship 指（罕见，常带幽默）作为有效对手时的技巧或策略。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, often humorous) Skill or tactics in acting as an opponent or enemy; the art of opposing someone effectively.","zh":"（罕见，常带幽默）作为对手或敌人时的“本事/手段”；有效对抗他人的技巧。"},"examples":[{"en":"In the debate, her foemanship was impressive—she anticipated every counterargument.","zh":"在辩论中，她的“对手技巧”令人印象深刻——她预判了每一个反驳点。"},{"en":"The novel portrays political foemanship as a game of strategy rather than open war.","zh":"这部小说把政治上的“对敌手段”描写成一场策略游戏，而不是公开的战争。"}]}],"synonyms":["opposition tactics","enemy strategy","gamesmanship","hostile tactics","rivalry"],"phonetic":"/ˈfoʊmənʃɪp/","extraExplanation":["“foemanship”并不是常见词，更多像是由 foe（敌人/对手）+ -manship（……之道/技艺，如 sportsmanship 运动精神、gamesmanship 比赛小伎俩）临时组合出来的词，用来强调“像个对手那样”运用策略与手段。","语气通常不正式，带一点调侃或文学化色彩；日常更常用 opponent’s tactics（对手的策略）、hostile tactics（敌对手段）、enemy strategy（敌方策略）。"]}
{"word":"foemen","summary":{"en":"“Foemen” means “enemies,” and it sounds old-fashioned or literary.","zh":"“Foemen”意为“敌人”，语气偏古风或文学化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Enemies; people who are fighting against you (an old-fashioned or literary plural of “foeman”).","zh":"敌人；对手（较古老或文学用语，为“foeman”的复数）。"},"examples":[{"en":"The soldiers prepared to face their foemen at dawn.","zh":"士兵们准备在黎明时迎战敌人。"},{"en":"He spoke of foemen and friends as if the world were a battlefield.","zh":"他谈起敌人与朋友，仿佛世界就是战场。"}]}],"synonyms":["enemies","foes","opponents","adversaries"],"phonetic":"/ˈfoʊmən/","extraExplanation":["“foemen”是较少见的复数形式，来自“foe + man”。现代英语更常用“enemies”或“foes”。在史诗、骑士文学、古风叙事里更容易看到，用来营造庄重或古典的语气。"]}
{"word":"foeniculum","summary":{"en":"Foeniculum is the botanical genus name for fennel and related aromatic plants.","zh":"Foeniculum 是茴香及其近缘芳香植物的植物学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of aromatic plants in the carrot family (Apiaceae), best known for the species fennel (Foeniculum vulgare).","zh":"（植物）茴香属：伞形科（Apiaceae）的一属芳香植物，其中最著名的是茴香（Foeniculum vulgare）。"},"examples":[{"en":"Foeniculum vulgare is the scientific name for common fennel.","zh":"Foeniculum vulgare 是普通茴香的学名。"},{"en":"In botany class, we learned that Foeniculum belongs to the Apiaceae family.","zh":"在植物学课上，我们学到 Foeniculum 属于伞形科。"}]}],"synonyms":["fennel","genus Foeniculum"],"phonetic":"/fəˈnɪk.jə.ləm/","extraExplanation":["这是拉丁化的科学名称，常见于植物分类、药典、香料与园艺资料中；日常英文更常说 fennel（茴香）。","属名 Foeniculum 源自拉丁语，和“干草/草料（foenum）”有关，暗示其芳香气味与传统用途。"]}
{"word":"foenngreek","summary":{"en":"Fenugreek is an aromatic herb whose seeds and leaves are used as a spice, especially in South Asian and Middle Eastern cooking.","zh":"Fenugreek（葫芦巴）是一种芳香草本植物，其种子和叶子常用作香料，尤见于南亚与中东料理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant whose aromatic seeds and leaves are used as a spice and in herbal medicine (often in South Asian, Middle Eastern, and North African cooking)","zh":"葫芦巴；一种植物，其芳香的种子和叶子常用作香料，也常见于草本用途（多见于南亚、中东和北非料理）"},"examples":[{"en":"Fenugreek seeds add a warm, slightly bitter flavor to curry.","zh":"葫芦巴籽能给咖喱增添温暖、略带苦味的风味。"},{"en":"She soaked fenugreek seeds overnight before cooking them.","zh":"她把葫芦巴籽浸泡了一夜再下锅。"},{"en":"The recipe calls for fenugreek leaves to finish the dish.","zh":"这道食谱要求最后加入葫芦巴叶提香。"}]}],"synonyms":["methi","fenugreek seeds","fenugreek leaves"],"phonetic":"/ˈfɛn.jəˌɡriːk/","extraExplanation":["你输入的“foenngreek”很可能是“fenugreek”的拼写错误。","在印度菜中常见的“kasuri methi”指的是干燥的葫芦巴叶，常用于增香；而“fenugreek seeds”是葫芦巴籽，味道更浓、更苦一些。","葫芦巴带有类似枫糖/焦糖的香气，有些人觉得它闻起来像枫糖浆；这也是它在部分香料混合（如咖喱粉）里很有辨识度的原因。"]}
{"word":"foes","summary":{"en":"“Foes” means “enemies” or “opponents,” often with a slightly literary tone.","zh":"“foes”表示“敌人”或“对手”，语气常带一点文学/叙事色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Enemies; people who oppose you or try to harm you.","zh":"敌人；与你对立或可能伤害你的人。"},"examples":[{"en":"In the story, the hero must face many foes.","zh":"在故事里，英雄必须面对许多敌人。"},{"en":"She tried to turn her foes into friends through dialogue.","zh":"她试图通过对话把敌人变成朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"Opponents in a fight, game, or competition (not always personal enemies).","zh":"对手；在打斗、比赛或竞争中的对方（不一定是私人仇敌）。"},"examples":[{"en":"The two teams have been foes for years.","zh":"这两支队伍多年来一直是对手。"},{"en":"He respected his foe after a fair match.","zh":"在一场公平的比赛后，他尊重他的对手。"}]}],"synonyms":["enemies","opponents","adversaries","rivals"],"phonetic":"/foʊz/","extraExplanation":["“foes”是“foe”的复数。语气比“enemy”更偏文学/叙事风格，在小说、史诗、电影台词里很常见。","搭配很常见：face your foes（直面敌人/对手）、defeat your foes（击败敌人/对手）、old foes（宿敌/老对手）。","相关词：friend vs. foe（朋友还是敌人）、foe（单数）、enemy（更中性常用的“敌人”）、rival（竞争对手，常不含敌意）。"]}
{"word":"foeship","summary":{"en":"Foeship means a relationship of being enemies—hostility or enmity.","zh":"Foeship 指“为敌的关系/状态”，即敌意或仇恨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or relationship of being foes; hostility or enmity between people or groups","zh":"敌对关系；为敌的状态；敌意、仇恨"},"examples":[{"en":"Years of border disputes turned their neighbors into foeship rather than friendship.","zh":"多年的边境争端让他们的邻国关系从友好变成了敌对。"},{"en":"In the novel, the two families move from uneasy peace to open foeship.","zh":"在小说里，两大家族从勉强和平走向公开敌对。"}]}],"synonyms":["enmity","hostility","antagonism","animosity"],"phonetic":"/ˈfoʊʃɪp/","extraExplanation":["“foeship”比较少见，常见表达更偏向用“enmity / hostility / being enemies”。它由“foe（敌人）+ -ship（表示某种状态/关系，如 friendship, partnership）”构成，因此语感上带有“关系/状态”的意味，而不只是单纯的“敌人”这个身份。","在文学或较正式的语境里，作者有时会用它来与“friendship”形成对照，强调关系从友好转为对立。"]}
{"word":"foetal","summary":{"en":"Foetal means ‘related to a fetus’ and is the British spelling of fetal.","zh":"foetal 表示“与胎儿有关”，是 fetal 的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(British spelling) relating to a fetus (an unborn baby developing in the womb), especially during pregnancy.","zh":"（英式拼写）与胎儿有关的；（尤指）怀孕期间胎儿发育的。"},"examples":[{"en":"Foetal development is usually monitored through routine checkups and scans.","zh":"胎儿发育通常会通过常规检查和超声扫描来监测。"},{"en":"The doctor explained the foetal heartbeat findings in simple terms.","zh":"医生用简单的话解释了胎儿心跳的检查结果。"}]}],"synonyms":["fetal","embryonic (earlier stage, less exact)","prenatal (more general: before birth)"],"phonetic":"/ˈfiːtəl/","extraExplanation":["“foetal”是英式拼写；美式英语中更常见的拼写是“fetal”。两者意思相同，在医学、公共卫生与新闻报道中都很常见。","在涉及怀孕、流产或相关话题时，不同文化与个人可能有不同感受；正式写作中常用中性、医学化表达（如“fetal/foetal development”）。"]}
{"word":"foetalism","summary":{"en":"Foetalism means the persistence of fetal characteristics after birth (a rare, medical term).","zh":"Foetalism 指胎儿期特征在出生后仍持续存在（较少见的医学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The retention or development of fetal (unborn-baby) characteristics in a person after birth, especially into childhood or adulthood (used mainly in medical writing).","zh":"（医学用语）指出生后仍保留或出现胎儿期（未出生婴儿）的特征，尤其指延续到儿童期或成年期。"},"examples":[{"en":"Some older medical texts used the term foetalism to describe an adult body showing unusually fetal-like features.","zh":"一些较早的医学文献会用 foetalism 来描述成年人身体呈现出异常“胎儿样”的特征。"},{"en":"The report discusses whether the patient’s facial structure could be interpreted as foetalism.","zh":"报告讨论了患者的面部结构是否可以被解读为 foetalism（胎儿样特征的延续）。"}]}],"synonyms":["fetalism","retention of fetal characteristics","fetal-like development"],"phonetic":"ˈfitlˌɪzəm","extraExplanation":["foetalism 是一个相对少见、偏旧的医学词汇；现代医学更常用更具体的诊断名称（例如某些“发育迟缓/生长障碍/先天综合征”等）来描述类似现象。","英式拼写常见 foetal-，美式拼写更常见 fetal-；两者含义相同。"]}
{"word":"foetalization","summary":{"en":"Foetalization means a medical process where something becomes fetal-like in form or function (British spelling).","zh":"Foetalization 指医学上某些结构或表现变成“胎儿样”的过程（英式拼写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British spelling) The process by which a structure or disease pattern comes to resemble that of a fetus; in medicine, a return to fetal-like form or function.","zh":"（英式拼写）“胎儿化”：指某种结构或疾病表现变得类似胎儿时期的状态；医学上可指回到“胎儿样”的形态或功能。"},"examples":[{"en":"In some lung conditions, doctors may describe areas of tissue as showing foetalization.","zh":"在一些肺部疾病中，医生可能会描述某些组织区域出现“胎儿化”。"},{"en":"The report noted foetalization of gland-like structures under the microscope.","zh":"报告指出在显微镜下可见腺体样结构的“胎儿化”。"}]}],"synonyms":["fetalization","dedifferentiation (in some contexts)","embryonization (related term in some fields)"],"phonetic":"/ˌfiːt̬əl-aɪˈzeɪʃən/","extraExplanation":["该词多见于医学与病理学语境，属于较专业的术语；日常英语中很少使用。","拼写差异：英式常写 foetalization，美式通常写 fetalization。两者意思相同。","词源构成：foetal（胎儿的）+ -ization（……化/……的过程）。"]}
{"word":"foetation","summary":{"en":"Foetation means fetal formation and development; an older medical term for pregnancy/gestation.","zh":"Foetation 指胎儿的形成与发育；是较旧的医学用语，可指妊娠/孕期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation and development of a fetus; pregnancy or the state of carrying a fetus (medical, formal; now uncommon).","zh":"（医学/正式用语，较少见）胎儿的形成与发育；妊娠、怀胎状态。"},"examples":[{"en":"In older medical texts, foetation was used to describe the stages of fetal development.","zh":"在较早的医学文献中，foetation 用来描述胎儿发育的各个阶段。"},{"en":"The report discussed complications that can occur during foetation.","zh":"该报告讨论了在妊娠（foetation）期间可能出现的并发症。"}]}],"synonyms":["gestation","pregnancy","fetal development"],"phonetic":"/fiːˈteɪʃən/","extraExplanation":["foetation 是较老或较少见的医学词，多见于旧文献；现代更常用 gestation（妊娠/孕期）、pregnancy（怀孕）或 fetal development（胎儿发育）。","拼写上 foet- 常见于英式/传统拼写体系（与 foetus 对应），美式通常写作 fetus；因此在美式现代文本里更可能看到 fetation 或直接用 gestation。"]}
{"word":"foeti","summary":{"en":"“Foeti” is a rare plural of “foetus/fetus,” meaning unborn babies (fetuses).","zh":"“foeti”是“foetus/fetus（胎儿）”较少见的复数形式，意思是“多个胎儿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of foetus/fetus (an unborn baby or young animal before birth); a rare/technical plural, more common in British or Latin-style writing","zh":"foetus/fetus（胎儿；胚胎）的复数；较少见/偏学术的复数形式，在英式或带拉丁风格的写法中更常见"},"examples":[{"en":"Ultrasound images showed two foeti developing normally.","zh":"超声影像显示有两个胎儿发育正常。"},{"en":"The study examined foeti at different stages of development.","zh":"这项研究观察了不同发育阶段的胎儿。"}]}],"synonyms":["fetuses","foetuses"],"phonetic":"/ˈfiːtaɪ/","extraExplanation":["“foeti”来自拉丁式复数拼写（foetus → foeti），在现代英语里通常更推荐用更规则、更常见的复数：American English 多用 “fetuses”，British English 也常用 “foetuses”。在医学论文或较正式的英式文本中偶尔能见到 “foeti”。","拼写提示：American English 一般写 fetus / fetuses；British English 常写 foetus / foetuses。"]}
{"word":"foeticidal","summary":{"en":"Foeticidal means causing the death of a fetus; it’s a formal medical term (US spelling: feticidal).","zh":"foeticidal 指“导致胎儿死亡的/堕胎性的”，为正式医学用语（美式拼写：feticidal）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing the death of a fetus; intended or able to kill a fetus.","zh":"（使）胎儿死亡的；堕胎性的；可致胎死的。"},"examples":[{"en":"Some medications are avoided in pregnancy because they may have foeticidal effects.","zh":"有些药物在怀孕期间会被避免使用，因为它们可能具有致胎死的影响。"},{"en":"The report warned that high exposure levels could be foeticidal in animal studies.","zh":"报告警告说，在动物实验中，高剂量暴露可能会导致胎儿死亡。"}]}],"synonyms":["feticidal","abortifacient","fetotoxic"],"phonetic":"ˌfiːtəˈsaɪdəl","extraExplanation":["“foeticidal”是英式拼写（foet-），美式更常写作“feticidal”。两者含义相同。","这个词多见于医学、药理学、毒理学或法律/伦理讨论中，语气较为正式，日常英语里较少使用。","词根提示：fetus（胎儿）+ -cidal（杀…的，如 suicidal 自杀的、homicidal 杀人的）。"]}
{"word":"foeticide","summary":{"en":"Foeticide means the intentional killing of a fetus, often discussed in legal or medical contexts.","zh":"Foeticide 指故意杀死胎儿，常见于法律或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The deliberate killing of a fetus (an unborn baby), usually in a medical context.","zh":"故意杀死胎儿（未出生的婴儿），通常出现在医疗语境中。"},"examples":[{"en":"The report discussed allegations of foeticide during the conflict.","zh":"报告讨论了冲突期间有关“杀胎”的指控。"},{"en":"Some countries have laws that treat foeticide as a separate crime from abortion.","zh":"一些国家的法律将“杀胎”视为不同于堕胎的独立罪名。"},{"en":"In rare medical emergencies, doctors may face ethical questions related to foeticide.","zh":"在极少见的医疗紧急情况下，医生可能会面对与杀胎相关的伦理问题。"}]}],"synonyms":["feticide","destruction of a fetus","killing of a fetus"],"phonetic":"/ˈfiːtəˌsaɪd/","extraExplanation":["“foeticide”在英式拼写中更常见（含“oe”），美式常写作“feticide”。两者意思相同。","该词通常用于法律、医学与新闻报道等较正式的语境；日常口语中更常见的是“abortion（堕胎）”或“terminate a pregnancy（终止妊娠）”，但这些词并不总是等同于“foeticide”（因为“foeticide”强调“杀死胎儿”这一结果与意图）。","在不同国家与文化中，此词涉及高度敏感的伦理与法律议题；阅读或使用时要注意语境、法律定义以及当事人用词的差异。"]}
{"word":"foetid","summary":{"en":"Foetid means extremely bad-smelling, like something rotten.","zh":"foetid 指“极其难闻的腐臭味”，常形容腐败、令人作呕的气味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a very unpleasant, rotten smell (like decay or stale waste).","zh":"（气味）恶臭的、腐臭的、令人作呕的。"},"examples":[{"en":"The trash can had a foetid smell after a week in the heat.","zh":"垃圾桶在高温下放了一周后散发出腐臭味。"},{"en":"We opened the old refrigerator and a foetid odor rushed out.","zh":"我们打开旧冰箱，一股恶臭扑面而来。"},{"en":"The foetid air in the alley made him cover his nose.","zh":"小巷里腐臭的空气让他捂住了鼻子。"}]}],"synonyms":["fetid","stinking","foul-smelling","rank","malodorous","putrid"],"phonetic":"/ˈfiːtɪd/","extraExplanation":["“foetid”是英式拼写；美式常写作“fetid”。两者意思相同，发音也基本一致。","常用于较正式或书面语（如新闻、文学、医学/科学描述），比一般的“smelly/bad-smelling”更强调“腐败、令人反胃”的程度。","在文学或叙述中常用于营造氛围：例如描写战争、贫民窟、沼泽、腐烂食物或尸体等场景，突出“令人窒息的恶臭”。"]}
{"word":"foetiferous","summary":{"en":"Foetiferous means “giving off a strong, unpleasant smell.”","zh":"foetiferous 意为“散发强烈难闻气味的；恶臭的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something) having or producing a strong, unpleasant smell; stinking.","zh":"（指某物）散发强烈难闻气味的；恶臭的。"},"examples":[{"en":"A foetiferous odor rose from the trash can in the heat.","zh":"炎热中，垃圾桶里冒出一股恶臭。"},{"en":"The foetiferous swamp air made it hard to breathe comfortably.","zh":"沼泽里的臭气让人很难舒服地呼吸。"}]}],"synonyms":["foul-smelling","fetid","stinking","rank","malodorous"],"phonetic":"/fɪˈtɪfərəs/","extraExplanation":["这个词较少见，语气偏书面或文学描写，用来强调“令人作呕的臭味”。日常口语更常用 *stinky*, *smelly*, *foul-smelling*。","词源上可拆作 *foeti-*（与 *fetid*“恶臭的”同源）+ *-ferous*（“带有/产生……的”，如 *odoriferous*“有香味/气味的”）。因此 *foetiferous* 字面就是“产生臭味的”。"]}
{"word":"foetiparous","summary":{"en":"Foetiparous means ‘giving birth to live young’ (a rare term; often replaced by viviparous).","zh":"foetiparous 指“胎生的、产下活体幼崽的”（较少用，常用 viviparous）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Giving birth to live young (rather than laying eggs).","zh":"（生物）胎生的；产下活体幼崽的（而不是产卵）。"},"examples":[{"en":"Humans are foetiparous mammals, so babies develop inside the mother’s body before birth.","zh":"人类是胎生哺乳动物，所以婴儿会先在母体内发育再出生。"},{"en":"Most whales are foetiparous and nurse their young after delivery.","zh":"大多数鲸类是胎生的，生产后会哺乳幼崽。"}]}],"synonyms":["viviparous","live-bearing"],"phonetic":"/ˌfiːtəˈpærəs/","extraExplanation":["这个词在现代英语里很少见，日常与教材中更常用的是 viviparous（胎生的）来表达同样或非常接近的意思。","词源上可拆成 foeti-（与 fetus/foetus“胎儿”相关）+ -parous（“生产、繁殖”），常用于生物学分类中，与 oviparous（卵生）相对。"]}
{"word":"foetor","summary":{"en":"Foetor means a strong, unpleasant smell, often in medical or formal contexts.","zh":"foetor 指强烈的难闻气味，常见于医学或较正式的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, unpleasant smell; a foul odor (often used in medical or formal writing).","zh":"恶臭；难闻的气味（常用于医学或较正式的表达）"},"examples":[{"en":"The doctor noted a foetor on the patient’s breath.","zh":"医生记录到病人有口臭（呼气有恶臭）。"},{"en":"A foetor rose from the garbage left in the heat.","zh":"炎热中放置的垃圾散发出一股恶臭。"}]}],"synonyms":["stench","reek","odor","bad smell","smell"],"phonetic":"/ˈfiːtər/","extraExplanation":["“foetor”多见于英式拼写与医学语境（也常写作“fetor”）。在医学里可指特定来源的气味，如“foetor hepaticus”（与严重肝病相关的特殊口气）。","词源来自拉丁语，和“fetid”（恶臭的）同源。日常英语中更常用“bad smell / stench / odor”。"]}
{"word":"foetors","summary":{"en":"Foetors means very unpleasant smells (plural of fetor).","zh":"foetors 指“恶臭”（fetor 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) very strong, unpleasant smells; offensive odors.","zh":"（复数）恶臭；令人作呕的气味。"},"examples":[{"en":"The doctor noted fetors coming from the wound, suggesting infection.","zh":"医生注意到伤口散发出恶臭，这可能提示感染。"},{"en":"After the trash sat in the heat for days, the room filled with fetors.","zh":"垃圾在高温下放了好几天，房间里充满了恶臭。"}]}],"synonyms":["bad smells","stenches","odors","reek(s)"],"phonetic":"/ˈfiːtərz/","extraExplanation":["“foetors”是英式拼写“foetors/foetors”的复数形式；在美式英语中更常见拼写是“fetors”（单数：fetor）。","这个词多用于较正式或医学/文学语境，日常口语里更常说“bad smell(s)”或“stink”。"]}
{"word":"foeture","summary":{"en":"“Foeture” is not standard; it usually means “fetus/foetus,” an unborn baby in the womb.","zh":"“foeture”不是标准拼写，通常指“fetus/foetus（胎儿）”，即子宫中的未出生婴儿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled in American English) a fetus: an unborn baby in the womb, especially after the early embryo stage.","zh":"（美式常拼写）胎儿：在子宫中的未出生婴儿，尤其指胚胎早期之后的发育阶段。"},"examples":[{"en":"The ultrasound showed a healthy fetus.","zh":"超声检查显示胎儿很健康。"},{"en":"During pregnancy, the fetus grows rapidly in the second trimester.","zh":"怀孕期间，胎儿在妊娠中期生长很快。"}]},{"partOfSpeech":"other","definition":{"en":"(Spelling note) “foeture” is not a standard spelling; it is usually a misspelling of “fetus” (US) or “foetus” (UK).","zh":"（拼写提示）“foeture”不是标准拼写；通常是把“fetus”（美式）或“foetus”（英式）拼错了。"},"examples":[{"en":"In American English, write “fetus,” not “foetus” or “foeture.”","zh":"在美式英语里写“fetus”，不是“foetus”或“foeture”。"}]}],"synonyms":["fetus","foetus","unborn baby","developing baby"],"phonetic":"/ˈfitəs/","extraExplanation":["“fetus/foetus”都来自拉丁语 fetus，意为“后代、怀孕、分娩”。英式拼写常保留“oe（=古典写法）”，美式通常简化为“e”。","在医学语境里，人们有时用 embryo（胚胎，较早期）与 fetus（胎儿，较后期）来区分，但不同资料对分界周数的说明可能略有差异。"]}
{"word":"foetus","summary":{"en":"A foetus is an unborn baby developing in the uterus after the early embryo stage.","zh":"foetus 指子宫内发育中的未出生婴儿（胎儿），通常是胚胎早期之后的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) an unborn baby developing in the uterus, especially after about 8 weeks of pregnancy until birth.","zh":"（医学）胎儿：在子宫内发育的未出生婴儿，通常指怀孕约8周后到出生前这一阶段。"},"examples":[{"en":"The ultrasound showed the foetus moving its arms and legs.","zh":"超声检查显示胎儿在动胳膊和腿。"},{"en":"Smoking during pregnancy can harm the foetus.","zh":"怀孕期间吸烟可能会伤害胎儿。"},{"en":"Doctors monitored the foetus’s heartbeat throughout the labor.","zh":"医生在分娩过程中一直监测胎儿的心跳。"}]}],"synonyms":["fetus (US spelling)","unborn baby","developing baby"],"phonetic":"/ˈfiːtəs/","extraExplanation":["“foetus”是英式拼写；美式英语更常写作“fetus”。两者意思相同。","医学上常把怀孕前约8周称为“embryo（胚胎）”，8周之后到出生前称为“fetus/foetus（胎儿）”。在日常交流中，人们也常直接说“baby”。"]}
{"word":"foetuses","summary":{"en":"“Foetuses” means unborn babies developing in the womb; it is the plural of foetus/fetus.","zh":"“foetuses”意为“胎儿”，是 foetus/fetus 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of fetus/foetus: unborn babies developing inside the uterus, especially after about 8 weeks of pregnancy (until birth).","zh":"fetus/foetus 的复数：胎儿；在子宫内发育的未出生婴儿（通常指怀孕约8周之后到出生之前）。"},"examples":[{"en":"The ultrasound showed two fetuses, so she was expecting twins.","zh":"超声检查显示有两个胎儿，所以她怀的是双胞胎。"},{"en":"Doctors monitored the fetuses closely during the high-risk pregnancy.","zh":"在高风险妊娠期间，医生密切监测胎儿情况。"}]}],"synonyms":["fetuses","unborn babies (informal)","developing babies (informal)"],"phonetic":"ˈfitəsɪz","extraExplanation":["“foetus”是英式拼写，“fetus”是美式拼写；医学与日常英语里都常用“fetus”，而“foetus”多见于英联邦地区的写法。","“fetus/foetus”通常用于医学或较正式的语境；在日常谈论中，人们也会说“the baby”来表达更亲近或更少医学色彩的感觉。","与发育阶段相关的常见词：early pregnancy 常用“embryo（胚胎）”，较后阶段用“fetus/foetus（胎儿）”。"]}

