{"word":"fog","summary":{"en":"Fog is thick mist near the ground that reduces visibility; as a verb, it means to become foggy or to make something unclear.","zh":"fog 指贴近地面的浓雾、会降低能见度；作动词可表示“起雾/使变模糊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick cloud of tiny water drops near the ground that makes it hard to see.","zh":"（贴近地面的）雾；由细小水滴组成、会影响能见度的云状水汽。"},"examples":[{"en":"A dense fog covered the highway, so drivers slowed down.","zh":"浓雾笼罩着高速公路，所以司机们都减速了。"},{"en":"The city disappeared into the morning fog.","zh":"城市隐没在清晨的雾里。"}]},{"partOfSpeech":"v.","definition":{"en":"To become covered with fog, or to make something unclear, as if covered by fog.","zh":"起雾；（比喻）使变得模糊不清，仿佛被雾遮住。"},"examples":[{"en":"The bathroom mirror fogged up after a hot shower.","zh":"洗完热水澡后，浴室镜子起雾了。"},{"en":"Stress can fog your thinking and make decisions harder.","zh":"压力会让你的思路变得模糊，做决定更困难。"}]}],"synonyms":["mist","haze","vapor"],"phonetic":"/fɑːɡ/","extraExplanation":["“fog”常用于文学里营造神秘、迷失或不确定的氛围；例如伦敦常被写成“foggy”的城市意象。注意区分：fog（雾，更浓、能见度更低）与 mist（薄雾，更轻、更易散）。"]}
{"word":"fog-free","summary":{"en":"Fog-free means “without fog” or “resistant to fogging,” often used to describe clear views or anti-fog products.","zh":"fog-free 表示“无雾的”或“防起雾的”，常用于描述清晰视野或防雾产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a surface, place, or view) not covered by fog; clear and easy to see.","zh":"（指表面、地方或视野）无雾的；清晰可见的。"},"examples":[{"en":"The windshield stayed fog-free even in the rain.","zh":"即使下雨，挡风玻璃也保持无雾。"},{"en":"We finally got a fog-free view of the mountains.","zh":"我们终于看到了无雾的群山景色。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of glasses, a mirror, or a device) designed or treated to resist fogging.","zh":"（指眼镜、镜子或设备）防起雾的；具有防雾设计/涂层的。"},"examples":[{"en":"These fog-free goggles are great for swimming.","zh":"这副防雾泳镜很适合游泳。"},{"en":"I bought a fog-free bathroom mirror with a heated pad.","zh":"我买了一面带加热垫的防雾浴室镜。"}]}],"synonyms":["clear","mist-free","anti-fog","non-fogging"],"phonetic":"/ˈfɑɡ friː/","extraExplanation":["“fog-free”常用连字符（hyphen）作定语放在名词前：fog-free glasses / fog-free view。放在系动词后作表语时，有时也会写成不加连字符的“fog free”（例如：The glass is fog free），但加连字符也很常见。","含义上可能指“环境本身没有雾”（clear weather），也可能指“物品不容易起雾/有防雾功能”（anti-fog）。根据上下文判断。"]}
{"word":"fog-resistant","summary":{"en":"Fog-resistant means designed to resist fogging or condensation, especially on lenses or mirrors.","zh":"fog-resistant 指“防雾的/不易起雾的”，多用于镜片、镜子等表面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not likely to become covered with fog or condensation; designed to prevent fogging (for example, lenses, mirrors, goggles, or windshields).","zh":"不易起雾的；防雾的（指镜片、镜子、护目镜、挡风玻璃等，能减少或防止起雾/凝结水汽）。"},"examples":[{"en":"These fog-resistant goggles stay clear even when you’re sweating.","zh":"这副防雾护目镜即使你出汗也能保持清晰。"},{"en":"I bought a fog-resistant bathroom mirror so I can shave after a hot shower.","zh":"我买了一面防雾浴室镜子，这样我洗完热水澡后也能刮胡子。"},{"en":"The car’s fog-resistant coating helps improve visibility in humid weather.","zh":"汽车的防雾涂层有助于在潮湿天气中提高能见度。"}]}],"synonyms":["anti-fog","fogproof","non-fogging"],"phonetic":"/ˈfɑɡ rɪˌzɪstənt/","extraExplanation":["“fog-resistant”是由名词 fog（雾/起雾）+ 形容词 resistant（抗……的）组成的复合形容词，常用连字符（-）放在名词前作定语：fog-resistant lenses/mirror。放在名词后作表语时也常见：These lenses are fog-resistant。","日常也常说“anti-fog”（防雾），在商品说明里很常见；“fog-resistant”强调“较不容易起雾”，不一定表示“完全不会起雾”。"]}
{"word":"fogas","summary":{"en":"“Fogas” is generally not an English word; it’s commonly a simplified spelling of Hungarian “fogás,” meaning a catch, a grip/move, or a course/dish depending on context.","zh":"“fogas”一般不是英语词；它常是匈牙利语“fogás”的简写写法，可指渔获、握法/招式，或一道菜/餐次中的一道，取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) A Hungarian word—usually written “fogás”—that can mean a “catch” (as in fishing), a “move/hold/grip” (in sports like wrestling), or a “dish/course” (in a meal), depending on context.","zh":"（不是标准英语词）一个匈牙利语词，通常写作“fogás”，根据语境可表示“捕获/渔获”、“动作/招式/握法（如摔跤等运动）”，或“一道菜/一餐中的一道（菜）”。"},"examples":[{"en":"In Hungarian, “fogás” can mean the fish you caught.","zh":"在匈牙利语里，“fogás”可以指你钓到的渔获。"},{"en":"The menu lists several “fogás” (courses).","zh":"菜单上列出了好几道“fogás”（菜品/餐次中的一道）。"}]}],"synonyms":["catch","grab","grip","move (sports)","course (meal)","dish"],"phonetic":"ˈfoʊɡɑʃ","extraExplanation":["“fogás”里的长音符号“á”很重要：没有重音符号写成“fogas”时，常被当作省略标记的写法，但在匈牙利语里正规拼写是“fogás”。","在匈牙利语语境中，它的核心概念是“抓/握/拿住”延伸出来的：抓到鱼→渔获；抓握的动作→招式/握法；一餐“拿出来的一道”→一道菜/一道餐次。"]}
{"word":"fogbank","summary":{"en":"A fogbank is a large, dense mass of fog, often like a wall; it can also mean a “cloud” of confusion (figuratively).","zh":"fogbank 指大片浓雾/雾墙；也可比喻使人困惑、看不清真相的“迷雾”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, dense mass of fog, often seen as a thick “wall” that can reduce visibility, especially near coasts or over water.","zh":"（常见于海岸或水面上的）雾墙；大片浓雾，像一堵墙一样遮挡视线。"},"examples":[{"en":"A fogbank rolled in from the ocean and swallowed the harbor.","zh":"一片雾墙从海上涌来，吞没了港口。"},{"en":"Drivers slowed down as they approached a fogbank on the highway.","zh":"司机们接近高速路上的雾墙时都减速了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Something that makes a situation unclear or hard to understand, like confusion or uncertainty.","zh":"（比喻）使情况变得不清楚的东西；迷雾般的困惑或不确定性。"},"examples":[{"en":"A fogbank of rumors made it hard to know what was true.","zh":"谣言像一片迷雾，让人很难分辨真相。"},{"en":"After the shock, he felt as if a fogbank had settled over his thoughts.","zh":"受到打击后，他觉得思绪仿佛被一层迷雾笼罩。"}]}],"synonyms":["bank of fog","dense fog","fog wall","mist (less specific)"],"phonetic":"/ˈfɑːɡˌbæŋk/","extraExplanation":["“fogbank”常用于航海、沿海天气报道和文学描写：它强调雾的“成片、成墙”感，比单说“fog（雾）”更形象。","常见搭配有：a fogbank rolls in（雾涌来/起雾）、a fogbank lifts（雾散开）、a fogbank hangs over（雾笼罩在……上）。","在叙事写作中，fogbank常用来营造神秘、危险或不确定的氛围（例如航行迷失、人物心境迷茫）。"]}
{"word":"fogbound","summary":{"en":"Fogbound means covered or trapped by fog; it can also describe unclear thinking or writing.","zh":"fogbound 指被浓雾笼罩或因雾受困；也可比喻思路或表达不清。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Surrounded, covered, or limited by thick fog, so that visibility is low.","zh":"被浓雾包围、笼罩或限制（能见度很低）的。"},"examples":[{"en":"The airport was fogbound all morning, and many flights were delayed.","zh":"机场整个上午都被浓雾笼罩，许多航班延误了。"},{"en":"We drove slowly along the fogbound highway.","zh":"我们在浓雾笼罩的公路上慢慢开车。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Mentally or emotionally unclear; confused, as if your thinking is “in a fog.”","zh":"（比喻）思路不清、迷糊；像“脑子起雾”一样困惑的。"},"examples":[{"en":"After the long night shift, I felt fogbound and couldn’t focus.","zh":"上完漫长的夜班后，我感觉脑子发雾，无法专注。"},{"en":"The article is fogbound with jargon, so it’s hard to understand.","zh":"这篇文章术语太多、表达晦涩，很难看懂。"}]}],"synonyms":["foggy","misty","shrouded","hazy","obscured","clouded"],"phonetic":"/ˈfɑɡˌbaʊnd/","extraExplanation":["“fogbound”常见于天气、航运和航空语境，强调因雾导致的“受困/受限”（bound）状态：例如港口、船只或机场因雾无法正常运行。","在文学或描写性写作中，它也常用来营造氛围：雾带来神秘、隔绝、迷失方向等意象，因此“fogbound streets / coast / town”在叙述中很常见。"]}
{"word":"fogbow","summary":{"en":"A fogbow is a usually white, rainbow-like arc seen in fog or mist.","zh":"fogbow 指在雾或薄雾中出现的、通常呈白色的“雾虹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pale, usually whitish rainbow-like arc seen in fog or mist, formed when light (often sunlight or moonlight) is scattered by very small water droplets.","zh":"雾虹；在雾或薄雾中出现的、通常呈白色或淡色的“彩虹”状光弧，由光（常为日光或月光）被极小水滴散射形成。"},"examples":[{"en":"We spotted a fogbow over the bay just after sunrise.","zh":"日出后不久，我们在海湾上空看见了一道雾虹。"},{"en":"Unlike a bright rainbow, the fogbow looked almost colorless.","zh":"不同于鲜艳的彩虹，那道雾虹看起来几乎没有颜色。"},{"en":"A faint fogbow appeared as the ship moved through thick mist.","zh":"船穿过浓雾时，一道淡淡的雾虹出现了。"}]}],"synonyms":["white rainbow","fog rainbow"],"phonetic":"/ˈfɑːɡˌboʊ/","extraExplanation":["雾虹之所以常常“发白”，主要是因为雾滴比雨滴更小，导致光的散射更强、颜色分离不明显；有时在边缘仍可看到很淡的红或蓝。","它常出现在海边、湖面、山谷等易起雾的地方；夜间由月光形成的雾虹也存在，英语里常说 moon fogbow 或 moonbow（更常指月虹）。"]}
{"word":"fogbows","summary":{"en":"A fogbow is a faint, often whitish rainbow-like arc seen in fog.","zh":"fogbow 指雾中出现的淡色、常近乎白色的“彩虹状”光弧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pale, often nearly colorless rainbow-like arc that appears in fog (formed by sunlight or moonlight shining through tiny water droplets).","zh":"雾虹；雾中出现的、颜色很淡（常几乎无色）的彩虹状光弧（由阳光或月光穿过细小雾滴形成）。"},"examples":[{"en":"We saw a fogbow over the bay just after sunrise.","zh":"日出后不久，我们在海湾上方看到了雾虹。"},{"en":"A fogbow can look white because the droplets in fog are much smaller than raindrops.","zh":"雾虹看起来可能是白色的，因为雾滴比雨滴小得多。"}]}],"synonyms":["white rainbow","fog bow"],"phonetic":"/ˈfɔɡˌbaʊ/","extraExplanation":["“Fogbow”由 fog（雾）+ bow（弓形光带/彩虹）构成，也有人称它为“white rainbow（白虹）”。","雾虹的颜色不明显，主要因为雾滴很小，光发生衍射与散射后，颜色更容易“混在一起”，所以常呈现白色或淡淡的粉绿边缘。","“Fogbows”是复数形式；单数是“a fogbow”。"]}
{"word":"fogdog","summary":{"en":"A rare term for a bright patch of light seen in fog near the Sun, similar to a sun dog.","zh":"一个罕见词，指雾中靠近太阳出现的亮斑，类似“幻日（sun dog）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bright spot or patch of light seen in fog near the Sun (or sometimes the Moon), caused by light scattering—similar to a “sun dog,” but formed in fog.","zh":"（罕见）雾狗：在雾中、靠近太阳（有时也可在月亮附近）出现的亮斑/光斑，由光的散射造成；类似“幻日（sun dog）”，但形成于雾中。"},"examples":[{"en":"We could just make out a fogdog to the left of the Sun as the mist lifted.","zh":"雾气渐散时，我们勉强看见太阳左侧有一处“雾狗”的亮斑。"},{"en":"Sailors sometimes described fogdogs as warning signs of changing weather.","zh":"水手们有时把“雾狗”说成天气变化的预兆。"}]}],"synonyms":["sun dog","parhelion","moon dog","atmospheric optical phenomenon"],"phonetic":"/ˈfɑːɡ ˌdɔːɡ/","extraExplanation":["“fogdog”由“fog（雾）+ dog（狗）”构成，属于英语里对某些大气光学现象的传统叫法（类似的还有“sun dog”“moon dog”）。这里的“dog”不是指动物本身，而是延续了古老的比喻：这些光斑像“跟在”太阳旁边一样。","它非常少见、偏文学或地方性用法；在科学或更常见的英语里，人们更可能说“sun dog / parhelion（幻日）”或更笼统地说“an optical phenomenon in fog（雾中的光学现象）”。"]}
{"word":"fogdogs","summary":{"en":"Fogdogs are rare-term plural nouns meaning bright white arcs/spots seen in fog, like sundogs but produced by fog droplets.","zh":"fogdogs（少见用法）指雾中出现的明亮白色光弧/光斑，类似幻日，但由雾滴造成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Bright white spots or arcs that appear in fog, similar to “sundogs” but caused by light scattering in tiny fog droplets (often near a fogbow).","zh":"（复数）雾中出现的明亮白色光斑或光弧，类似“幻日（sundog）”，但由雾滴散射光形成（常出现在雾虹附近）。"},"examples":[{"en":"We could see a faint fogbow, and two fogdogs on either side of it.","zh":"我们看到了隐约的雾虹，左右两侧还有两道雾幻日。"},{"en":"Fogdogs are easier to notice when the fog is thick and the light is behind you.","zh":"当雾很浓、光源在你身后时，雾幻日更容易被注意到。"}]}],"synonyms":["fogbow (related)","sundogs (similar phenomenon)","optical phenomenon"],"phonetic":"/ˈfɔɡˌdɔɡz/","extraExplanation":["“fogdog”比较少见，更常见的相关术语是“fogbow（雾虹）”。和“sundog（幻日）”不同，雾幻日通常颜色很淡、偏白，因为雾滴比冰晶更容易把颜色“混在一起”。","常出现在清晨或海边/山谷起雾时；如果你在阅读航海、登山或气象类英文材料，偶尔会遇到这个词。"]}
{"word":"fogdom","summary":{"en":"Fogdom is a rare, creative noun meaning a realm of fog, or figuratively a confused, foggy mental state.","zh":"Fogdom 是一个罕见、偏文学的名词，可指“雾的领域/雾境”，也可比喻“迷茫、脑雾般的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A foggy region or realm; an area dominated by fog.","zh":"（罕见／非标准用法）“雾之境、雾国”；被浓雾笼罩的区域。"},"examples":[{"en":"By dawn the valley turned into a gray fogdom, swallowing the road.","zh":"天亮时山谷变成一片灰色的“雾之境”，把道路都吞没了。"},{"en":"The lighthouse was the only clear point on the edge of the fogdom.","zh":"灯塔是雾境边缘唯一清晰的点。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A mental “fog”—a state of confusion, uncertainty, or dull thinking.","zh":"（比喻，罕见）“脑雾般的状态”；指困惑、迷茫或思维迟钝。"},"examples":[{"en":"After the long meeting, I walked out in a fogdom and forgot where I parked.","zh":"开完那场漫长的会议后，我脑子一片雾，连车停哪儿都忘了。"},{"en":"Stress can trap you in a fogdom where simple choices feel hard.","zh":"压力会把人困在“迷雾状态”里，让简单的选择都变得困难。"}]}],"synonyms":["foggy realm","misty land","haze","brain fog","confusion"],"phonetic":"/ˈfɔɡdəm/","extraExplanation":["“fogdom”不是常见词，更像是创造出来的词（poetic/creative coinage）。它由 fog（雾）+ -dom（表示“领域/状态”，如 kingdom 王国、freedom 自由）组成，所以字面感觉就是“雾的领域”。","如果你是在某本书、游戏、地名或用户名里看到 Fogdom，它也可能是专有名词（专名），含义通常仍与“雾、朦胧、迷失”相关。"]}
{"word":"foge","summary":{"en":"“foge” is not standard English; you may mean “fogey/fogy,” meaning an old-fashioned, change-resistant person.","zh":"“foge”不是标准英语拼写；你可能想写“fogey/fogy”，意思是守旧、抗拒变化的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “fogey”) an old-fashioned person who resists new ideas or changes.","zh":"（可能想写的是：fogey）守旧的人；老古板（不愿接受新观念或改变的人）。"},"examples":[{"en":"My uncle is a bit of a fogey—he still refuses to use a smartphone.","zh":"我叔叔有点老古板——他到现在还拒绝用智能手机。"},{"en":"Some people call her a fogey because she prefers handwritten letters to emails.","zh":"有些人说她守旧，因为她更喜欢手写信而不是电子邮件。"}]}],"synonyms":["traditionalist","conservative","stick-in-the-mud","old-timer"],"phonetic":"/ˈfoʊɡi/","extraExplanation":["“foge”在英语里通常不是一个标准单词，最常见的可能是拼写成了“fogey”（也常写作“fogy”）。","“fogey/fogy”带一点调侃或轻微贬义，语气从开玩笑到不太客气都有，使用时注意场合和对象。"]}
{"word":"fogeater","summary":{"en":"Fogeater is a rare, creative noun meaning something that clears fog—literally (wind/sun/device) or figuratively (a clarifying person/idea).","zh":"Fogeater 是较少见、带创造性的名词，指能驱散雾的事物（字面：风/阳光/装置）或能消除困惑的人/观点（比喻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(creative/rare) Something that “eats” or clears away fog; a thing (such as wind, sun, or a machine) that makes fog disappear.","zh":"（创造性/少见）“吃掉”或驱散雾气的东西；能让雾散去的事物（如风、阳光或机器）。"},"examples":[{"en":"A strong ocean breeze is the best fogeater—by noon, the whole coast is clear.","zh":"强劲的海风就是最好的“雾食者”——到中午海岸一带就全都放晴了。"},{"en":"The airport installed new fans as a fogeater to improve visibility on the runway.","zh":"机场安装了新风扇作为“驱雾装置”，以提高跑道能见度。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) A person or idea that clears confusion, fear, or uncertainty—like cutting through a “fog.”","zh":"（比喻）驱散困惑、恐惧或不确定的人或观点——像穿透“迷雾”一样带来清晰。"},"examples":[{"en":"Her calm explanation was a fogeater for the whole team.","zh":"她冷静的解释为整个团队驱散了迷雾。"},{"en":"Good data can be a fogeater when rumors start spreading.","zh":"当谣言开始传播时，可靠的数据能起到“驱雾”的作用。"}]}],"synonyms":["fog disperser","mist clearer","fog clearer","clarifier"],"phonetic":"/ˈfɔːɡˌiːtər/","extraExplanation":["“fogeater”不是常见词，更常见的写法是带连字符的“fog-eater”，多见于文学描写、诗歌或口语中的创造性比喻，用来强调“驱散雾/迷雾”的形象感。","如果你是在小说、游戏或某个特定社群里看到它，它也可能是专有名词（角色名/生物名/装备名）；这种情况下含义要以原出处设定为准。"]}
{"word":"fogey","summary":{"en":"A fogey is an old-fashioned person who resists change.","zh":"fogey 指守旧、老派、抗拒改变的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old-fashioned person who resists change, especially in ideas, habits, or tastes.","zh":"守旧的人；老古板（尤指思想、习惯或品味上抗拒改变的人）。"},"examples":[{"en":"My uncle is a bit of a fogey—he still insists that handwritten letters are the only “proper” way to communicate.","zh":"我叔叔有点老古板——他仍然坚持手写信才是唯一“正经”的沟通方式。"},{"en":"Some people call her a fogey because she doesn’t like social media.","zh":"有些人因为她不喜欢社交媒体就说她很守旧。"}]}],"synonyms":["old-timer","traditionalist","stick-in-the-mud","conservative"],"phonetic":"/ˈfoʊɡi/","extraExplanation":["“fogey”通常带有轻微贬义或打趣的语气，意思接近“old-fashioned / conservative（守旧的）”。在英美文化里，用它形容一个人不愿接受新科技、新潮流或新观念。说别人是fogey可能显得不太礼貌，更委婉的说法有“traditional”或“set in their ways（习惯难改）”。"]}
{"word":"fogeys","summary":{"en":"Fogeys means old-fashioned people (or informally, old people), often with a teasing or slightly negative tone.","zh":"fogeys指“守旧、老派的人”（或非正式指“老人”），常带调侃或轻微负面语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old-fashioned person who resists new ideas or modern ways.","zh":"守旧的人；顽固守着老观念、老做法的人。"},"examples":[{"en":"Some people call him a fogey because he refuses to use a smartphone.","zh":"有人说他是个守旧的人，因为他拒绝用智能手机。"},{"en":"The new policy upset a few fogeys who preferred the old system.","zh":"新政策惹恼了几位守旧的人，他们更喜欢旧制度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) An old person; an elderly man (sometimes mildly insulting).","zh":"（非正式）老年人；老头（有时带轻微贬义）。"},"examples":[{"en":"The kids laughed and said, “Look at that fogey!”","zh":"孩子们笑着说：“看那个老头！”"},{"en":"He joked that he was becoming a fogey now that he went to bed early.","zh":"他开玩笑说自己现在早睡，快变成老古董了。"}]}],"synonyms":["old-timer","traditionalist","conservative","old-fashioned person","dinosaur"],"phonetic":"/ˈfoʊɡi/","extraExplanation":["“fogeys”是“fogey”的复数形式。日常更常见的用法是单数fogey，或复数the fogeys来泛指“一群守旧的人”。","语气提示：fogey通常带调侃或轻微贬义，尤其用来形容“跟不上时代、讨厌新事物”的人；想更中性可用“traditionalist（传统主义者）”“old-fashioned person（老派的人）”。"]}
{"word":"fogfruit","summary":{"en":"Fogfruit is usually a plant name (Phyla nodiflora), a spreading groundcover with small clustered flowers; rarely, it can be used poetically to mean something unreal or hard to grasp.","zh":"Fogfruit 通常是植物名（Phyla nodiflora），一种会蔓延的地被植物、开小型簇状花；极少情况下也可作诗意比喻，指虚幻或难以捉摸的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low-growing flowering plant (Phyla nodiflora) with small purple-and-white flower heads, often used as groundcover in warm climates; also called (frogfruit).","zh":"一种匍匐生长的开花植物（学名 Phyla nodiflora），花小、常呈紫白色花球，常被用作温暖地区的地被植物；也常被称为“frogfruit”。"},"examples":[{"en":"Fogfruit spreads quickly and can replace part of a lawn in hot weather.","zh":"fogfruit 蔓延很快，在炎热地区可以部分替代草坪。"},{"en":"Bees often visit fogfruit flowers for nectar.","zh":"蜜蜂常来访 fogfruit 的花朵采蜜。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, poetic) something imagined as “fruit of fog,” meaning a vague or unreal result or hope.","zh":"（罕见，诗意用法）“雾之果实”，比喻虚幻、不真实或难以捉摸的结果/希望。"},"examples":[{"en":"His promises felt like fogfruit—pretty to picture, impossible to hold.","zh":"他的承诺像“雾之果实”——想象时很美，却抓不住。"}]}],"synonyms":["frogfruit","Phyla nodiflora","turkey-tangle fogfruit"],"phonetic":"/ˈfɑɡˌfrut/","extraExplanation":["“fogfruit”在日常英语里非常少见；更多时候你会看到拼写为“frogfruit”。两者在一些资料中被当作同一种植物的常见名（多指 Phyla nodiflora）。如果你是在园艺/植物百科中看到这个词，通常就是指这种地被植物。"]}
{"word":"fogfruits","summary":{"en":"“Fogfruits” is not a standard English word; it’s a creative compound meaning fruits associated with fog, often used in poetic or fictional contexts.","zh":"“fogfruits”不是标准常用英语词，更像创作合成词，指“与雾相关的水果”，常用于诗歌或虚构设定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard dictionary word) A creative or informal compound meaning “fruits associated with fog,” such as fruit growing in a foggy climate or fruit described as misty/gray in appearance or mood.","zh":"（非标准词，偏创作/口语）由“fog（雾）+ fruits（水果）”组成的合成词，泛指“与雾相关的水果”，比如在多雾气候中生长的水果，或在描写中带有朦胧、灰雾氛围的水果。"},"examples":[{"en":"In the poem, the orchard offers “fogfruits,” making the scene feel quiet and dreamlike.","zh":"在这首诗里，果园献上“fogfruits”，让场景显得安静而梦幻。"},{"en":"Coastal farms sometimes grow excellent citrus in cool, foggy air—someone might jokingly call them “fogfruits.”","zh":"沿海农场在凉爽、多雾的空气里有时能种出很棒的柑橘——有人可能会开玩笑把它们叫作“fogfruits”。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used in fiction, games, or brand-like contexts for an imagined fruit connected with mist, mystery, or magic.","zh":"（虚构/游戏/品牌语境）一种被设定为与薄雾、神秘或魔法有关的“想象水果”的名称。"},"examples":[{"en":"The story says fogfruits only appear at dawn, when the valley is covered in mist.","zh":"故事里说fogfruits只在黎明出现，那时山谷被薄雾笼罩。"},{"en":"Players collect fogfruits to brew a potion that hides their footsteps.","zh":"玩家收集fogfruits来酿制一种能隐藏脚步声的药剂。"}]}],"synonyms":["mist-fruits","foggy fruits","coastal fruit","fictional fruit"],"phonetic":"/ˈfɑːɡˌfruːts/","extraExplanation":["“fogfruits”更像是临时造词/设定用词，而不是英语里固定存在的常用词。写作中它常用来营造氛围（朦胧、清冷、神秘）。如果你是在某本书、游戏或某个产品上看到它，告诉我出处/上下文句子，我可以帮你确定它在该语境下的准确含义与更自然的翻译。","如果你本来想查的是别的拼法，常见可能是：fog fruit（分开写，强调“多雾环境里的水果”）、foggy fruit（形容词+名词）、或某个专有名词（品牌/角色/道具名）。"]}
{"word":"fogga","summary":{"en":"“fogga” isn’t standard English; it’s likely a typo or a proper name (e.g., Foggia) or you may mean “fogger.”","zh":"“fogga” 不是标准英语；多半是拼写错误或专有名词（如 Foggia），也可能你想写的是 “fogger”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a name. Common possibilities include “Foggia” (a city in Italy) or “fogger” (a machine or person that produces fog).","zh":"不是标准英语单词；更可能是拼写错误或专有名词。常见可能包括 “Foggia”（意大利城市）或 “fogger”（制造雾气的机器/人）。"},"examples":[{"en":"I can’t find “fogga” in an English dictionary—did you mean “fogger” or “Foggia”?","zh":"我在英语词典里找不到 “fogga”——你是不是想说 “fogger” 或 “Foggia”？"},{"en":"If you meant Foggia, it’s a city in southern Italy.","zh":"如果你指的是 Foggia，它是意大利南部的一座城市。"}]}],"phonetic":"/ˈfɑːɡə/","extraExplanation":["“Fogga”本身不常见于英语。它可能来自：\n1）拼写/输入法误差（如 fogger, Foggia）。\n2）特定社群/游戏/昵称用语。\n如果你告诉我它出现的句子或语境（聊天、歌曲、游戏、文章等），我可以更准确地解释。"]}
{"word":"foggage","summary":{"en":"Foggage means the regrowth of grass after cutting (or grass left standing), often saved for later grazing.","zh":"foggage 指割草后再生的二茬草，或为之后放牧而保留的草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Second growth of grass (or other herbage) after a field has been cut or grazed, often used later for grazing or hay.","zh":"（草地在割草或放牧后）再生的草、二茬草；常用于之后放牧或做干草。"},"examples":[{"en":"After the first hay cutting, the sheep were turned out onto the foggage.","zh":"第一茬干草收割后，人们把羊赶到二茬草地上放牧。"},{"en":"Good summer rain produced plenty of foggage for autumn grazing.","zh":"夏季充足的降雨让二茬草长得很好，够秋天放牧。"}]},{"partOfSpeech":"n.","definition":{"en":"Grass or rough herbage left standing in a field, especially for later feeding.","zh":"（田地里）留着不割的草或较粗的草，尤指为之后喂养牲畜而保留的草。"},"examples":[{"en":"They kept the foggage in the lower field until the first frost.","zh":"他们把低洼地里的留草一直保留到初霜来临。"},{"en":"The cattle moved slowly through the foggage, eating what they could.","zh":"牛群慢慢穿过留草地，能吃多少就吃多少。"}]}],"synonyms":["aftermath","regrowth","second growth","stubble (related)"],"phonetic":"/ˈfɑɡɪdʒ/","extraExplanation":["“foggage”多见于英式/农业语境，在现代日常英语里很少用；在乡村写作或农业报告中更常见。","它和“aftermath（割草后的再生草/二茬草）”意义很接近；不同地区可能更偏好其中一个词。"]}
{"word":"foggages","summary":{"en":"“Foggages” is the plural of the rare word “foggage,” meaning regrown grass after mowing, used for pasture or animal feed.","zh":"“Foggages”是罕见词 foggage 的复数，指割草后再长出的二茬草，常用于放牧或作饲料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Second growth of grass (aftermath) that appears after mowing or harvesting; often used as late-season pasture or fodder.","zh":"（割草或收割后长出的）二茬草、再生草；常用作晚季放牧或饲料。"},"examples":[{"en":"After the hay was cut, the sheep grazed on the foggage in early autumn.","zh":"干草割完后，羊在初秋吃二茬草放牧。"},{"en":"The farmer saved the foggage for winter feed.","zh":"农夫把二茬草留作冬季饲料。"}]},{"partOfSpeech":"n.","definition":{"en":"The amount or supply of such regrown grass used for grazing or feeding animals (often plural: foggages).","zh":"（常用复数 foggages）二茬草的数量或储备；可供放牧/饲喂的再生草料。"},"examples":[{"en":"This year’s foggages were thin because the summer was so dry.","zh":"因为夏天太干旱，今年的二茬草长得稀薄。"}]}],"synonyms":["aftermath (grass)","regrowth","second growth","pasture","fodder"],"phonetic":"/ˈfɑɡɪdʒɪz/","extraExplanation":["“foggages”是罕见词，通常是名词 foggage 的复数形式，多见于英式乡村语境、农业/畜牧语境（有时带地区色彩，如苏格兰或英格兰北部）。","注意它和常见的 fog（雾）没有直接关系；这里的 fog- 词根在部分方言里可指“后长的草/枯草”。"]}
{"word":"foggara","summary":{"en":"A foggara is a North African (especially Algerian) underground irrigation channel system that carries groundwater to oases and farms.","zh":"foggara 指北非（尤指阿尔及利亚）的地下引水灌溉系统，把地下水输送到绿洲与农田。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional underground irrigation system (a series of tunnels and vertical shafts) used especially in the Sahara—particularly in Algeria—to bring groundwater to farms and villages by gravity.","zh":"一种传统的地下引水灌溉系统（由地下水道与竖井组成），尤其用于撒哈拉地区（特别是阿尔及利亚），利用重力把地下水引到农田与村落。"},"examples":[{"en":"The oasis relied on a foggara to bring water from the aquifer to the date palms.","zh":"这片绿洲依靠一条 foggara 把含水层的水引到椰枣林。"},{"en":"Engineers mapped the old foggara tunnels to restore the community’s water supply.","zh":"工程师绘制了古老 foggara 地道的地图，以恢复社区供水。"}]}],"synonyms":["qanat","khettara","underground irrigation channel","water tunnel system"],"phonetic":"/foʊˈɡɑːrə/","extraExplanation":["“Foggara”多见于北非语境，尤其是阿尔及利亚撒哈拉绿洲地区；在英语资料中常与中东/伊朗的“qanat（坎儿井/地下渠）”并列，用来指同类的地下引水技术。","这种系统通常由缓坡地下通道+一连串竖井组成：竖井便于施工、通风与清理；水则在地下流动以减少蒸发，非常适合干旱环境。","拼写上也常见 foggara / fouggara 等变体；在阅读学术或旅游资料时可留意不同地区用不同名称（如摩洛哥常说 khettara）。"]}
{"word":"fogged","summary":{"en":"“Fogged” means made unclear or covered with mist (often on glass), and it can also mean mentally unclear or confused.","zh":"“fogged”表示变得不清楚或被雾/水汽覆盖（常见于玻璃起雾），也可指头脑发懵、思路不清。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “fog”: to make something less clear or harder to see (literally or figuratively).","zh":"“fog”的过去式/过去分词：使某物变得不清楚、更难看见（可指字面或比喻）。"},"examples":[{"en":"The kitchen window fogged up while I was cooking.","zh":"我做饭时，厨房窗户起雾了。"},{"en":"Painkillers fogged his memory of the accident.","zh":"止痛药让他对事故的记忆变得模糊。"}]},{"partOfSpeech":"adj.","definition":{"en":"Covered with fog or with a mist of tiny water drops (often on glass).","zh":"被雾覆盖的；（常指玻璃等）起雾的、蒙上一层水汽的。"},"examples":[{"en":"We drove slowly on the fogged road.","zh":"我们在有雾的路上慢慢开车。"},{"en":"He wiped his fogged glasses.","zh":"他擦了擦起雾的眼镜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not clear in thinking; confused or unable to concentrate (often from fatigue, stress, illness, or medication).","zh":"（思维）不清晰的；迷糊的、难以集中注意力的（常因疲劳、压力、生病或药物导致）。"},"examples":[{"en":"I felt fogged after staying up all night.","zh":"熬了一整夜后，我感觉脑子发懵。"},{"en":"Her mind was fogged by grief.","zh":"悲伤让她思绪混乱。"}]}],"synonyms":["misted","clouded","blurred","hazy","confused"],"phonetic":"/fɑɡd/","extraExplanation":["英语里常见搭配是 “fogged up”，特别指玻璃、镜子因为温差和水汽而“起雾”。","比喻用法很常见：fogged memory / fogged mind 表示“记忆/思路变得模糊”。写作中也常用“雾”来表达情绪、困惑或不确定感。"]}
{"word":"fogger","summary":{"en":"A fogger is usually a device that makes fog or mist, especially a fog machine or a pesticide fogger.","zh":"fogger通常指制造雾/喷雾的装置，尤指烟雾机或杀虫烟雾装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine or device that produces a fine mist or “fog,” often used for special effects, cooling, or humidity.","zh":"制造细雾/“烟雾”的机器或装置，常用于舞台特效、降温或增加湿度。"},"examples":[{"en":"The concert used a fogger to create a dramatic atmosphere on stage.","zh":"演唱会用烟雾机在舞台上营造戏剧性的氛围。"},{"en":"In summer, some outdoor cafés run a fogger to cool the air.","zh":"夏天一些户外咖啡馆会开喷雾降温装置来降温。"}]},{"partOfSpeech":"n.","definition":{"en":"A device that sprays pesticide as a fog to kill insects (often for mosquitoes).","zh":"把杀虫剂以“烟雾”形式喷出以灭虫的装置（常用于灭蚊）。"},"examples":[{"en":"We used a fogger in the backyard to reduce mosquitoes.","zh":"我们在后院用烟雾杀虫器来减少蚊子。"},{"en":"Follow the label carefully before using a pesticide fogger indoors.","zh":"在室内使用杀虫烟雾剂前要仔细阅读并遵守标签说明。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who fogs something (sprays it with a mist or fog).","zh":"喷雾/喷烟的人；进行“烟雾喷洒”的人。"},"examples":[{"en":"The technician was the fogger for the film set’s special effects.","zh":"那位技术人员负责电影片场的烟雾特效喷洒。"}]}],"synonyms":["fog machine","mister","misting machine","vaporizer","pesticide fogger"],"phonetic":"/ˈfɑɡər/","extraExplanation":["“Fogger”在日常英语里最常指两类设备：舞台/派对用的“fog machine（烟雾机）”，以及灭虫用的“bug bomb / pesticide fogger（杀虫烟雾剂/烟雾杀虫器）”。在安全语境中，后者常和“ventilate（通风）”“follow the label（按说明使用）”一起出现。"]}
{"word":"foggers","summary":{"en":"“Foggers” usually means devices (or operators) that create a fine mist/fog, often for pest control, disinfection, or special effects.","zh":"“foggers”通常指制造细雾的设备（或操作人员），常用于灭虫、消杀或舞台特效。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Machines or devices that produce a fine mist or “fog,” often to spread insecticide, disinfectant, deodorizer, or water vapor.","zh":"喷雾机／烟雾机：会产生细小雾状喷雾的机器或装置，常用于喷洒杀虫剂、消毒剂、除味剂或水雾。"},"examples":[{"en":"We used foggers in the greenhouse to control whiteflies.","zh":"我们在温室里用烟雾机来防治粉虱。"},{"en":"After the flood, the hotel hired a crew with foggers to disinfect the rooms.","zh":"洪水过后，酒店请了带喷雾机的人员来给房间消毒。"},{"en":"Turn off the smoke alarm before running the foggers, and follow the label directions.","zh":"使用烟雾机前先关闭烟雾报警器，并按标签说明操作。"}]},{"partOfSpeech":"n.","definition":{"en":"People who operate fogging equipment (for pest control, sanitation, or effects).","zh":"操作喷雾／烟雾设备的人（用于病媒防治、消杀或效果制造）。"},"examples":[{"en":"The foggers arrived at dawn to treat the area for mosquitoes.","zh":"喷雾人员天一亮就到了，给这片区域做灭蚊处理。"},{"en":"Event staff asked the foggers to reduce the haze during the concert.","zh":"活动工作人员请制造烟雾效果的人在演唱会期间减少烟雾。"}]}],"synonyms":["fogging machines","misters","sprayers","ULV foggers","smoke machines (stage use)","haze machines (related)"],"phonetic":"/ˈfɑːɡɚz/","extraExplanation":["“Fogger”常见两类：①家用或专业“杀虫烟雾弹/喷雾罐”（bug bomb），用于一次性喷放药剂；②专业“冷雾机/热烟雾机”（ULV fogger等），可持续喷雾。使用时要注意通风、人员宠物撤离、覆盖食物/餐具，并严格按产品标签操作。","在舞台/影视里也会用“fogger”制造薄雾效果；如果雾很浓、像低烟贴地，常会另外称为“hazer”（薄雾机）或“smoke machine”（烟雾机），但口语里有时也会混用。"]}
{"word":"foggier","summary":{"en":"“Foggier” is the comparative form of “foggy,” meaning more foggy (literal) or more unclear/confusing (figurative).","zh":"“foggier”是“foggy”的比较级，表示“雾更浓”（字面）或“更不清楚/更迷糊”（比喻）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More foggy; having thicker fog or more mist, so it is harder to see.","zh":"更有雾的；雾更浓的（能见度更低）。"},"examples":[{"en":"It’s foggier this morning than it was yesterday.","zh":"今天早上比昨天更有雾。"},{"en":"The road gets foggier near the river, so drive slowly.","zh":"靠近河边的路雾更浓，所以要慢慢开。"}]},{"partOfSpeech":"adj.","definition":{"en":"Less clear or more confusing (often about thinking, memory, or explanations).","zh":"更不清晰的；更迷糊的（常指思路、记忆或说明）。"},"examples":[{"en":"I feel foggier when I don’t get enough sleep.","zh":"睡不够的时候我会更迷糊。"},{"en":"His explanation became foggier after more questions.","zh":"被问了更多问题后，他的解释反而更不清楚了。"}]}],"synonyms":["mistier","hazier","more unclear","more confusing"],"phonetic":"/ˈfɑɡiər/","extraExplanation":["“foggier”是形容词“foggy”的比较级，常见规则是把-y结尾变成-ier（foggy → foggier；happy → happier）。在口语里，它既可描述真实的天气，也常用来比喻“脑子像起雾一样不清楚”。"]}
{"word":"foggiest","summary":{"en":"“Foggiest” is most often used in the idiom “not the foggiest,” meaning “no idea at all,” and less commonly means “most foggy” in the literal sense.","zh":"“foggiest”最常见于习语“not the foggiest”，表示“完全不知道”；较少情况下作字面义，指“雾最大、最起雾的”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The smallest or slightest amount (usually used in the phrase “not the foggiest”).","zh":"一丁点、丝毫（通常用于短语“not the foggiest”，表示“完全不知道”）。"},"examples":[{"en":"I haven’t the foggiest idea where my keys are.","zh":"我完全不知道我的钥匙在哪儿。"},{"en":"She didn’t have the foggiest clue what he meant.","zh":"她一点也不明白他是什么意思。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most foggy; covered with the thickest fog (literal meaning, less common in everyday speech).","zh":"雾最大的；最起雾的（字面意思，日常口语中较少这样单独使用）。"},"examples":[{"en":"Early morning is often the foggiest time of day near the river.","zh":"在河边，清晨往往是一日中雾最大的时候。"}]}],"synonyms":["not the slightest (idea)","no clue","most foggy","mistiest"],"phonetic":"/ˈfɑːɡiəst/","extraExplanation":["“not the foggiest”是比较英式口语的表达，用“fog（雾）”来比喻“看不清、想不明白”。常见搭配：not the foggiest idea / not the foggiest clue。语气通常较随意，有时带一点夸张。"]}
{"word":"foggily","summary":{"en":"“Foggily” means ‘unclearly’ (in thought, memory, or speech) or ‘in a foggy, misty way’ (in appearance).","zh":"“foggily”表示“模糊不清地”（思路、记忆、表达）或“雾蒙蒙地/朦胧地”（外观景象）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not clear or is hard to understand; vaguely or confusedly.","zh":"模糊不清地；含糊地；（思路或表达）不清楚地。"},"examples":[{"en":"He explained the plan foggily, so nobody knew what to do next.","zh":"他含糊不清地解释了计划，所以没人知道下一步该做什么。"},{"en":"I remember foggily what happened after the accident.","zh":"事故之后发生了什么，我只模模糊糊地记得。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is covered with or like fog; mistily.","zh":"雾蒙蒙地；像雾一样地（景象不清）。"},"examples":[{"en":"The mountains appeared foggily in the distance.","zh":"远处的群山在雾中隐约可见。"},{"en":"The streetlights glowed foggily through the mist.","zh":"路灯在薄雾中朦胧地发着光。"}]}],"synonyms":["vaguely","unclearly","dimly","hazeily","mistily"],"phonetic":"/ˈfɑɡəli/","extraExplanation":["“foggily”来自形容词“foggy（有雾的；头脑不清的）”，加上副词后缀“-ly”。除了描述天气/景象的“雾蒙蒙”，更常用来形容记忆、表达、思路“模糊不清”。","常见搭配：remember foggily（模糊地记得）、explain/speak foggily（含糊地解释/说话）、see something foggily（朦胧地看见）。"]}
{"word":"fogginess","summary":{"en":"Fogginess means either foggy weather/low visibility or a feeling of mental confusion and unclear thinking.","zh":"Fogginess 指“有雾、能见度低”的天气状态，也可指“头脑不清醒、思路混乱”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of being foggy; low visibility because of fog or haze.","zh":"有雾的状态；因雾或薄霾导致能见度低的情况。"},"examples":[{"en":"The fogginess this morning made it hard to see the road.","zh":"今天早上的大雾让人很难看清路。"},{"en":"Flights were delayed due to fogginess near the airport.","zh":"机场附近起雾导致航班延误。"}]},{"partOfSpeech":"n.","definition":{"en":"A lack of mental clarity; a feeling of confusion or difficulty thinking clearly.","zh":"头脑不清醒；思路混乱、难以清晰思考的感觉。"},"examples":[{"en":"After staying up late, I felt fogginess all day.","zh":"熬夜之后，我一整天都觉得脑子昏昏沉沉的。"},{"en":"Some people report fogginess when they’re under a lot of stress.","zh":"有些人在压力很大时会觉得头脑发懵。"}]}],"synonyms":["mistiness","haziness","cloudiness","muddledness","confusion"],"phonetic":"/ˈfɑɡinəs/","extraExplanation":["“fogginess”既可指真实天气中的“雾气/能见度差”，也常用来比喻“脑子像起雾一样不清楚”。日常口语中与之相近的表达有“brain fog（脑雾）”“mental fog（精神迷雾）”。","词形上，“foggy（有雾的/不清楚的）+ -ness”构成名词，表示“……的状态”。"]}
{"word":"fogging","summary":{"en":"“Fogging” most often means things are getting covered in fog/steam (or making them cloudy), and it can also mean making thoughts or judgment unclear.","zh":"“Fogging”通常指（自己）起雾或（把别的东西）弄得起雾/变浑浊；也可比喻让思路或判断变得不清晰。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of **fog**) becoming covered with fog, or causing something to be covered with fog; also, becoming unclear or “clouded.”","zh":"（**fog** 的现在分词）起雾；使……起雾；也可指（想法、视线等）变得不清楚、变得“模糊”。"},"examples":[{"en":"My glasses kept **fogging** when I walked into the warm room.","zh":"我走进温暖的房间时，眼镜一直在**起雾**。"},{"en":"Steam from the soup is **fogging** the window.","zh":"汤的热气把窗户**熏得起雾**了。"},{"en":"Strong emotions were **fogging** his judgment.","zh":"强烈的情绪正在**影响/模糊**他的判断。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of making something cloudy/unclear, especially on glass, lenses, or in the air; sometimes used in photography or daily life.","zh":"**起雾**的现象或过程；（尤指玻璃、镜片、空气等）变得雾蒙蒙、浑浊；日常与摄影语境中常见。"},"examples":[{"en":"**Fogging** on the camera lens ruined a few photos.","zh":"相机镜头的**起雾**毁了几张照片。"},{"en":"Anti-fog spray helps reduce **fogging**.","zh":"防雾喷剂有助于减少**起雾**。"}]}],"synonyms":["misting","clouding","steaming up","obscuring","blurring"],"phonetic":"/ˈfɑɡɪŋ/","extraExplanation":["“fogging”最常见就是动词 fog 的 -ing 形式：既可以表示“正在起雾/变雾”，也可以表示“把……弄得起雾”。很多生活场景会用：glasses fogging（眼镜起雾）、window fogging（窗户起雾）、lens fogging（镜头起雾）。","比喻用法也常见：fogging someone’s mind/judgment 表示“让头脑/判断变得不清醒、被情绪或信息干扰”。这种用法偏书面或正式，但日常也能用。","区分 fog / mist：fog 通常更“浓”、能见度更低；mist 往往更“薄”。但口语里两者有时会混用。"]}
{"word":"foggish","summary":{"en":"Foggish means foggy or misty; it can also mean mentally unclear or vague (less common).","zh":"foggish 指多雾、朦胧的；也可指头脑或表达不清晰（较少用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of weather or air) full of fog; misty; hazy.","zh":"（指天气或空气）多雾的；有薄雾的；朦胧的。"},"examples":[{"en":"It was a foggish morning, so the trains were running slowly.","zh":"那是个多雾的早晨，所以火车开得很慢。"},{"en":"The foggish air made the city lights look soft and blurred.","zh":"朦胧的空气让城市灯光看起来柔和又模糊。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) unclear in thought or expression; confused; vague.","zh":"（较少用）思路或表达不清晰的；糊涂的；含糊的。"},"examples":[{"en":"His explanation was a bit foggish, so I asked him to repeat it more clearly.","zh":"他的解释有点含糊，所以我请他再说清楚一点。"},{"en":"I’m still foggish after waking up early.","zh":"我起得太早，醒来后脑子还不太清醒。"}]}],"synonyms":["foggy","misty","hazy","murky","vague"],"phonetic":"/ˈfɑɡɪʃ/","extraExplanation":["“foggish”通常偏文学或较旧的用法；日常口语里更常见的是“foggy”。不过“foggish”带一点描写氛围的感觉，常用来营造阴冷、朦胧、神秘的场景。","含义延伸到“思路不清晰”与英语里常见的隐喻一致：fog（雾）遮挡视线 → 头脑像被雾罩住一样不清楚。"]}
{"word":"foggy","summary":{"en":"Foggy means either ‘full of fog’ (hard to see) or ‘mentally unclear/confused.’","zh":"foggy既可指“有雾的、视线不清”，也可指“头脑不清醒、思路模糊”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of fog; covered with thick mist that makes it hard to see.","zh":"有雾的；雾气很重的（视线不清）。"},"examples":[{"en":"It was a foggy morning, so the driver turned on the headlights.","zh":"那是个有雾的早晨，所以司机打开了车灯。"},{"en":"The city looked mysterious in the foggy air.","zh":"城市在雾气中显得很神秘。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not clear in the mind; confused or unable to think clearly.","zh":"头脑不清醒的；迷糊的；思路不清的。"},"examples":[{"en":"I felt foggy after staying up too late.","zh":"熬夜太晚后我觉得脑子很迷糊。"},{"en":"The explanation was foggy, so I asked for a simpler one.","zh":"这个解释不够清楚，所以我请对方用更简单的话再说一遍。"}]}],"synonyms":["misty","hazy","cloudy","unclear","confused"],"phonetic":"/ˈfɑːɡi/","extraExplanation":["“foggy”既可以形容真实天气（雾很大），也常用作比喻来形容“思路像被雾挡住一样不清楚”。在日常英语里，“feel foggy / brain fog（脑雾）”很常见，用来描述疲劳、生病、压力大或睡眠不足导致的注意力不集中。","文学与文化中，雾常象征不确定、神秘或危险。例如英国文学里常写“foggy London（雾都伦敦）”，营造朦胧、悬疑的氛围。"]}
{"word":"foggy-headed","summary":{"en":"“Foggy-headed” means mentally unclear or confused, often from tiredness, illness, stress, alcohol, or medicine.","zh":"“foggy-headed”指头脑不清醒、思路模糊，常因疲劳、生病、压力、酒精或药物导致。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unable to think clearly; mentally confused or slow, as if your mind is in a fog.","zh":"头脑不清醒的；思路模糊的（像脑子里起了雾一样）。"},"examples":[{"en":"I felt foggy-headed after staying up too late.","zh":"熬夜太久后，我觉得头脑很不清醒。"},{"en":"If you’re foggy-headed, it’s better to rest before making big decisions.","zh":"如果你头脑不清醒，最好先休息再做重大决定。"},{"en":"The medicine made him a little foggy-headed for a few hours.","zh":"那种药让他有几个小时有点头脑发昏。"}]}],"synonyms":["confused","groggy","dazed","muddle-headed","hazy"],"phonetic":"/ˈfɔɡi ˈhɛdɪd/","extraExplanation":["这个词是复合形容词：foggy（有雾的、模糊的）+ headed（“头脑……的”）。常用来形容疲劳、感冒、压力、饮酒或某些药物带来的“脑子转不动”的状态。","语气通常偏口语、日常；在更正式的场合，也可用 mental fog / brain fog（脑雾）来表达类似意思。"]}
{"word":"foggy-headedness","summary":{"en":"Foggy-headedness means mental fog—difficulty thinking clearly or focusing.","zh":"foggy-headedness 指“脑子像起雾一样”，思路不清、难以专注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of mental confusion or lack of clear thinking; feeling as if your mind is “in a fog.”","zh":"头脑昏沉、思路不清的状态；像“脑子起雾”一样不够清醒。"},"examples":[{"en":"After the long flight, I had a bad case of foggy-headedness and couldn’t focus on emails.","zh":"长途飞行后我特别头脑昏沉，连邮件都没法专心看。"},{"en":"The medication caused foggy-headedness, so she avoided driving.","zh":"这种药会让人头脑昏沉，所以她避免开车。"},{"en":"His foggy-headedness lifted after he ate and drank some water.","zh":"他吃了点东西、喝了些水后，头脑昏沉就缓解了。"}]}],"synonyms":["brain fog","mental fog","muddled thinking","confusion","grogginess"],"phonetic":"/ˌfɑɡiˈhɛdɪdnəs/","extraExplanation":["“foggy-headedness”由形容词“foggy-headed（头脑不清醒的）”加名词后缀“-ness（……的状态）”构成，语气偏描述性，常见于口语和健康/生活语境。","常见搭配：a feeling of foggy-headedness（昏沉感）、mental fog/brain fog（脑雾；更常用的说法）。"]}
{"word":"foghorn","summary":{"en":"A foghorn is a very loud warning horn used in fog, especially on ships or near the coast.","zh":"foghorn 指雾天用于警示的巨大喇叭声，常见于船只或海岸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very loud horn used as a warning signal, especially on a ship or near the coast in foggy weather.","zh":"（尤指雾天在船上或海岸附近使用的）雾号，雾笛；一种非常响的警示喇叭。"},"examples":[{"en":"The foghorn sounded every few minutes as the ship approached the harbor.","zh":"船靠近港口时，雾号每隔几分钟就响一次。"},{"en":"We could hear a foghorn in the distance through the thick fog.","zh":"在浓雾中，我们能听到远处的雾笛声。"}]},{"partOfSpeech":"v.","definition":{"en":"To warn or signal with a foghorn; to make a loud horn sound.","zh":"用雾号发出警告/信号；（发出）雾号般的巨响。"},"examples":[{"en":"The lighthouse foghorned all night during the storm.","zh":"暴风雨期间，灯塔的雾号响了一整夜。"},{"en":"A ship foghorned to warn smaller boats to keep clear.","zh":"一艘船鸣雾号警告小船避让。"}]}],"synonyms":["horn","warning horn","signal horn","ship’s horn"],"phonetic":"/ˈfɑɡˌhɔrn/","extraExplanation":["“foghorn”常让人联想到海边或港口的氛围：低沉、穿透力强的声音用来在能见度很低时传递位置与警告。","在流行文化里，英语里有时会用“like a foghorn”来形容某人声音特别大或很有穿透力（带一点夸张或幽默）。"]}
{"word":"foghorns","summary":{"en":"Foghorns are loud warning horns used in fog or low visibility, especially on ships and lighthouses.","zh":"foghorns 指在大雾或低能见度时用于警示的巨大喇叭声，常见于船只和灯塔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very loud horn (often on a ship or lighthouse) used to warn other vessels in fog or low visibility.","zh":"（常见于船只或灯塔的）雾号/雾笛：在大雾或能见度低时发出巨大声响，用来警示其他船只。"},"examples":[{"en":"In the thick fog, we could hear foghorns from the harbor.","zh":"在浓雾里，我们能听到港口传来的雾号声。"},{"en":"The captain ordered the crew to sound the foghorns every two minutes.","zh":"船长命令船员每两分钟鸣一次雾号。"}]}],"synonyms":["fog signal","horn","warning horn"],"phonetic":"/ˈfɔɡˌhɔrn/","extraExplanation":["“foghorns”是“foghorn”的复数形式。单数：a foghorn；复数：foghorns。","常见搭配：sound/blow a foghorn（鸣雾号）；hear the foghorn（听到雾号）；foghorn blast（雾号的鸣响）。","文化用法：英文里会用“like a foghorn”来形容声音特别大、很响亮（有时带一点夸张或幽默）。例如：“He talks like a foghorn.”（他说话声音像雾号一样大）。"]}
{"word":"fogie","summary":{"en":"A fogie (fogey) is an old-fashioned person who resists change.","zh":"fogie（fogey）指守旧、抗拒改变的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old-fashioned person who is slow to accept new ideas or changes; a “stick-in-the-mud.” (Also spelled: fogey.)","zh":"守旧的人；跟不上时代、难以接受新观念的人。（也拼作：fogey）"},"examples":[{"en":"My grandpa calls himself an old fogie because he still uses a flip phone.","zh":"我爷爷说自己是个老古板，因为他还在用翻盖手机。"},{"en":"Don’t be a fogie—try the new app for a week before judging it.","zh":"别那么守旧——先试用这个新应用一周再下结论。"}]}],"synonyms":["fogey","old fogey","stick-in-the-mud","traditionalist","conservative (informal)"],"phonetic":"/ˈfoʊɡi/","extraExplanation":["“fogie”是“fogey”的常见变体拼写；更常见的搭配是“old fogey”（老古板）。","这个词通常带一点调侃或轻微贬义，语气可能不太礼貌；对不熟的人使用要注意场合。"]}
{"word":"fogies","summary":{"en":"“Fogies” means old-fashioned, conservative people (plural), often said jokingly or critically.","zh":"“fogies”指“老古板、守旧的人”（复数），常带调侃或批评语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Old-fashioned or conservative people (plural of “fogey”), often said in a mildly teasing or critical way.","zh":"老古板；守旧的人（“fogey”的复数），常带点调侃或批评的语气。"},"examples":[{"en":"The younger staff joked that the senior managers were a bunch of fogies who hated change.","zh":"年轻员工开玩笑说，高层经理是一群讨厌改变的老古板。"},{"en":"Don’t be such a fogey—try the new app before you complain about it.","zh":"别这么守旧——先试试这个新应用再抱怨。"},{"en":"At the family dinner, the teenagers teased their parents for being fogies about social media.","zh":"家庭聚餐时，青少年笑父母在社交媒体方面太老古板。"}]}],"synonyms":["old fogies","old-timers","traditionalists","conservatives (context-dependent)","stick-in-the-muds"],"phonetic":"/ˈfoʊɡiz/","extraExplanation":["“fogey”通常指思想或生活方式很传统、对新事物不太接受的人；语气多为非正式，常带轻微贬义或开玩笑的感觉。正式写作里更常用“old-fashioned people”“conservatives（视语境）”等。","词源上与18世纪的俚语有关，后来固定为形容“守旧的人”。在英美文化里，年轻人用它来吐槽长辈或上司“跟不上时代”。"]}
{"word":"fogily","summary":{"en":"“Fogily” means “vaguely or unclearly,” either in what you see (like through fog) or in how you think/remember.","zh":"“fogily”表示“模糊地、不清楚地”，既可指视觉上朦胧，也可指思维或记忆不清。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not clear or sharply defined; vaguely, as if seen through fog.","zh":"模糊地；朦胧地（像隔着雾看，不清晰）。"},"examples":[{"en":"The mountains rose fogily in the distance.","zh":"远处的群山朦胧地隐约可见。"},{"en":"She could see the streetlights only fogily through the rain on the window.","zh":"透过窗上的雨水，她只能朦胧地看到路灯。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a confused or unclear way, especially when thinking or remembering.","zh":"糊里糊涂地；不清楚地（尤指思考或回忆时）。"},"examples":[{"en":"He remembered the accident only fogily.","zh":"他对那场事故只记得很模糊。"},{"en":"I was still half-asleep and thinking fogily.","zh":"我还半睡半醒，脑子很不清楚。"}]}],"synonyms":["vaguely","dimly","unclearly","hazy","indistinctly"],"phonetic":"/ˈfɑɡəli/","extraExplanation":["“fogily”常用来写氛围或心理状态：既可以描绘视觉上的“朦胧”，也可以描绘记忆/思路的“模糊”。","常见搭配：fogily in the distance（在远处隐约可见）；remember/recall fogily（模糊地记得）；think fogily（思绪不清）。"]}
{"word":"foginess","summary":{"en":"Foginess means a lack of clarity—either literal misty conditions or mental/expressive vagueness.","zh":"Foginess 指“不清晰”的状态，可指真实的雾蒙蒙，也可指思维、记忆或表达的含糊不清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of being unclear or hard to see, think about, or remember (literally or figuratively).","zh":"（字面或比喻）模糊、不清楚的状态；难以看清、想清或记清。"},"examples":[{"en":"The morning foginess made it difficult to see the road.","zh":"清晨的雾蒙蒙让路很难看清。"},{"en":"I felt mental foginess after staying up too late.","zh":"熬夜太久后，我感觉脑子有点发蒙。"}]},{"partOfSpeech":"n.","definition":{"en":"Uncertain or imprecise quality in writing, speech, or ideas; vagueness.","zh":"（表达或想法的）含糊、不够明确；不精确。"},"examples":[{"en":"The foginess of his explanation confused the class.","zh":"他解释得含含糊糊，把全班都弄糊涂了。"},{"en":"Try to reduce foginess by giving specific examples.","zh":"试着用具体例子来减少表达的含糊。"}]}],"synonyms":["haze","mistiness","vagueness","unclearness","muddiness"],"phonetic":"/ˈfɑːɡinəs/","extraExplanation":["“foginess”来自“fog（雾）+ -iness（表示状态/性质的后缀）”。常见搭配有：mental foginess（脑雾/思维不清）、morning foginess（晨雾般的迷蒙感）、foginess in memory（记忆模糊）。","在健康语境里，“mental foginess”有时会被口语化称为“brain fog（脑雾）”，更常见也更口语。正式写作中用“foginess”偏书面、偏描述状态。"]}
{"word":"fogle","summary":{"en":"“Fogle” most commonly appears as a surname; as an old/dialect word, “fogle” means “handkerchief.”","zh":"“Fogle”最常见是姓氏；作为旧式/方言词，“fogle”可表示“手帕”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, old-fashioned) A handkerchief; a small cloth used for wiping your nose or face.","zh":"（方言/旧式用法）手帕；用于擦鼻子或脸的小布巾。"},"examples":[{"en":"He pulled a fogle from his pocket and wiped his forehead.","zh":"他从口袋里掏出一块手帕，擦了擦额头。"},{"en":"In some older stories, a ‘fogle’ is just a handkerchief.","zh":"在一些较老的故事里，“fogle”指的就是手帕。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), e.g., Fogle.","zh":"姓氏，例如 Fogle。"},"examples":[{"en":"Ms. Fogle will be our guest speaker today.","zh":"Fogle 女士今天将作为我们的嘉宾演讲者。"}]}],"synonyms":["handkerchief","hanky","kerchief"],"phonetic":"/ˈfoʊɡəl/","extraExplanation":["“fogle”作“手帕”主要见于英国/苏格兰等地区的方言或较旧的英语文本中；在现代日常英语里更常用的是“handkerchief”或口语“hanky”。","首字母大写“Fogle”通常是姓氏。现实文化中也出现过这一姓氏的知名人物；若你是在特定新闻/人物语境里看到它，可以告诉我原句，我能帮你判断含义。"]}
{"word":"fogless","summary":{"en":"Fogless means “without fog,” and it can also mean “clear and easy to understand.”","zh":"fogless 意为“无雾的”，也可引申为“清晰明了的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without fog; clear and not misty.","zh":"无雾的；清澈不朦胧的。"},"examples":[{"en":"It was a fogless morning, so we could see the mountains clearly.","zh":"那是个无雾的早晨，所以我们能清楚地看到群山。"},{"en":"Drivers prefer fogless conditions on this highway.","zh":"司机更喜欢在这条高速上遇到无雾的路况。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Clear and not confused or obscured.","zh":"（比喻）清晰明了的；不含糊、不被遮蔽的。"},"examples":[{"en":"She gave a fogless explanation of the rules.","zh":"她把规则解释得清清楚楚。"},{"en":"After the discussion, his goals felt fogless.","zh":"讨论之后，他的目标变得更加清晰明确。"}]}],"synonyms":["clear","mist-free","haze-free","unclouded","lucid"],"phonetic":"/ˈfɑɡləs/","extraExplanation":["“fogless”由“fog（雾）+ -less（无……的）”构成，意思直观，属于比较常见的英语构词方式。","在日常表达中，人们更常用“clear”“mist-free”“free of fog”来替代“fogless”；“fogless”在描写天气、视野或文学描写中更显书面一些。"]}
{"word":"foglietto","summary":{"en":"Foglietto (Italian) means a small piece of paper—usually a note, slip, or sometimes a leaflet/handout.","zh":"foglietto（意大利语）指“小纸片”，常见意思是便条/纸条/票据，也可指小传单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small sheet of paper; a note or slip (often used for a ticket, memo, or brief written message)","zh":"小纸片；便条（常指票据、备忘或简短留言）"},"examples":[{"en":"He handed me a foglietto with the address written on it.","zh":"他递给我一张写着地址的便条。"},{"en":"Keep the foglietto—it's your ticket for the museum entrance.","zh":"把那张小纸票留好——那是你进博物馆的门票。"}]},{"partOfSpeech":"n.","definition":{"en":"a leaflet or small handout (a short printed piece of information)","zh":"小传单；宣传页（简短的印刷说明）"},"examples":[{"en":"They gave out a foglietto explaining the event schedule.","zh":"他们发了一张小传单，说明活动日程。"}]}],"synonyms":["note","slip","ticket","memo","leaflet","handout"],"phonetic":"/foʊˈjɛtoʊ/","extraExplanation":["“foglietto”是意大利语，来自“foglio”（纸张/一页纸）的指小形式，字面意思是“更小的一张纸”。在意大利日常语境里，它既可以指随手写的便条，也常用于“票据/号单/入场券”等场景。"]}
{"word":"fogman","summary":{"en":"Fogman is a rare, story-like word meaning a mysterious “man in the fog,” and it can also be a surname.","zh":"Fogman 是较少见、偏故事化的词，可指“雾中人/雾里的神秘男子”，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/creative) A man who is seen in or associated with fog; sometimes used in stories to mean a mysterious figure appearing out of the fog.","zh":"（罕见/文学化用法）“雾中人”；指在雾里出现或与雾有关的男人，有时在故事里指从雾中走出的神秘人物。"},"examples":[{"en":"In the novel, the fogman appears at the harbor whenever something bad is about to happen.","zh":"在那本小说里，“雾中人”总会在码头出现，预示将有坏事发生。"},{"en":"She thought she saw a fogman on the road, but it was only a sign covered in mist.","zh":"她以为自己在路上看见了“雾中人”，结果只是被薄雾遮住的路牌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A family name (surname).","zh":"（专有名词）姓氏：Fogman（福格曼）。"},"examples":[{"en":"Dr. Fogman will speak at the conference tomorrow.","zh":"福格曼博士明天将在会议上发言。"}]}],"synonyms":["figure in the fog","mysterious stranger","apparition"],"phonetic":"/ˈfɑɡmæn/","extraExplanation":["“fogman”不是常见标准词汇，更常见的表达是“a man in the fog”（雾中的男人）或“a figure in the fog”（雾中的身影）。在创作写作里，把它写成一个合成词（fog + man）会更像“角色名/意象”，营造悬疑或超自然氛围。"]}
{"word":"fogmen","summary":{"en":"Fogmen is the plural of fogman, usually meaning a railway worker who sets track warnings in fog; more rarely it can mean men moving through fog in a literary sense.","zh":"Fogmen 是 fogman 的复数，通常指在大雾中放置轨道警示装置的铁路工作人员；更少见时可作文学化的“雾中人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of fogman) A railway worker who, in foggy weather, places warning devices (such as detonators/“fog signals”) on the tracks so train drivers know to slow down or stop.","zh":"（fogman 的复数）在大雾天气里负责在铁轨上放置警示装置（如爆炸警示器/“雾信号”）的铁路工作人员，用来提醒列车司机减速或停车。"},"examples":[{"en":"In the old days, fogmen walked the line and set fog signals when visibility dropped.","zh":"过去能见度下降时，雾信号工会沿着线路巡查并放置雾信号装置。"},{"en":"The report mentions fogmen being stationed near the junction during heavy fog.","zh":"报告提到在浓雾期间，雾信号工被安排驻守在道岔附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Men seen or imagined moving through fog; people associated with foggy conditions.","zh":"（罕用）在雾中出现或被想象为穿行于雾中的人；与雾天情景相关的人。"},"examples":[{"en":"In the novel, the fogmen emerge from the river mist like shadows.","zh":"小说里，“雾中人”从河面的薄雾里像影子一样浮现出来。"}]}],"synonyms":["fog signalman","railway signalman (historical context)","track worker (approx.)"],"phonetic":"/ˈfɑɡmən/","extraExplanation":["“fogman / fogmen”多见于英国铁路的历史语境。过去没有现代信号与自动防护系统时，浓雾会让司机看不清信号灯；雾信号工会在轨道上放置会发出爆响的“detonators（爆炸警示器）”，列车碾过时发出巨响提醒减速。如今该岗位多已被技术手段取代，但在历史记载、文学描写或博物馆资料中仍会出现。"]}
{"word":"fogo","summary":{"en":"“Fogo” usually means “fire” in Portuguese, and it’s also used as a place name (e.g., Fogo Island).","zh":"“Fogo”通常是葡萄牙语“火”的意思，也常作为地名使用（如福戈岛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Portuguese word meaning “fire,” sometimes seen in names or branding (often implying heat, flames, or grilling).","zh":"葡萄牙语里“火”的意思；在名字或品牌中常见，常暗示火焰、高温或炭火烤制。"},"examples":[{"en":"In Portuguese, “fogo” means “fire.”","zh":"在葡萄牙语中，“fogo”表示“火”。"},{"en":"The restaurant name suggests food cooked over an open fire.","zh":"这个餐厅名字暗示食物是用明火烹调的。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name for places, especially Fogo Island (in Canada) and Fogo (a volcanic island in Cape Verde).","zh":"地名专有名词，尤其指加拿大的福戈岛（Fogo Island）以及佛得角的火山岛福戈岛（Fogo）。"},"examples":[{"en":"She visited Fogo Island to see the coastal scenery.","zh":"她去福戈岛看海岸风景。"},{"en":"Fogo in Cape Verde is known for its volcano.","zh":"佛得角的福戈岛以火山闻名。"}]}],"synonyms":["fire","flame"],"phonetic":"/ˈfoʊɡoʊ/","extraExplanation":["英语里“fogo”本身不算常用词，更多是作为葡萄牙语借词或专有名词出现（比如地名、餐厅/品牌名）。如果你是在某个句子、歌曲、菜单或游戏里看到它，把原句发来我可以帮你判断具体含义。","常见搭配：葡语里“fogo”还会出现在短语“fogo de chão”（直译“地上的火”），指以炭火/明火烤制的烹饪方式，因此在巴西烤肉语境中很常见。"]}
{"word":"fogon","summary":{"en":"Fogon means a hearth/stove for cooking, or an outdoor cooking fire, often as a Spanish loanword (fogón).","zh":"fogon 指做饭的灶台/炉灶，也可指户外做饭用的篝火；常见为西语借词 fogón。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cooking hearth or stove (often a traditional wood- or charcoal-fired cooking area), especially in Spanish-speaking cultures","zh":"（常见于西语文化中的）灶台、炉灶；（传统的）柴火/炭火烹饪处"},"examples":[{"en":"Grandma cooked beans slowly over the fogon all morning.","zh":"奶奶整个上午都在灶台上慢慢炖豆子。"},{"en":"The small house had a fogon in the corner of the kitchen.","zh":"那间小房子的厨房角落里有一个炉灶。"}]},{"partOfSpeech":"n.","definition":{"en":"a campfire or open fire used for cooking outdoors","zh":"（户外做饭用的）篝火、明火"},"examples":[{"en":"They made coffee on a fogon by the river.","zh":"他们在河边的篝火上煮咖啡。"}]}],"synonyms":["hearth","stove","cookstove","fireplace","campfire","cooking fire"],"phonetic":"/foʊˈɡoʊn/","extraExplanation":["“fogon”常见于英语中作为西班牙语借词，原本多写作带重音的 **fogón**。重音表示重读音节在最后一节（-gón）。在不同地区，它既可指家中的传统灶台，也可泛指户外生火做饭的火堆。"]}
{"word":"fogou","summary":{"en":"“Forgo” means to choose to give up or not do/use something, often for a reason.","zh":"“forgo”表示选择放弃、不做或不用某事物，常带“为了某个原因/目标”的含义。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to choose not to have, use, or do something (to give it up, often for a reason)","zh":"选择放弃（某物或某事）；决定不做/不用（常因某种原因）"},"examples":[{"en":"I decided to forgo dessert to eat healthier.","zh":"为了吃得更健康，我决定不吃甜点。"},{"en":"She forgave herself for having to forgo the trip because of work.","zh":"因为工作不得不放弃旅行，她也学会了不再苛责自己。"}]},{"partOfSpeech":"vt.","definition":{"en":"to go without something; to abstain from something","zh":"没有……也能过；克制不用（某物）"},"examples":[{"en":"During the meeting, please forgo side conversations.","zh":"开会期间，请不要私下交谈。"},{"en":"He had to forgo sleep to finish the project on time.","zh":"为了按时完成项目，他不得不熬夜少睡。"}]}],"synonyms":["give up","go without","skip","abstain from","waive"],"phonetic":"/fɔrˈɡoʊ/","extraExplanation":["“forgo”常被拼成“forego”。在现代英语里两者有时混用，但更常见的区分是：forgo = 放弃/不做；forego = 在前/先行（较少用，常见于“the foregoing”= 前述的）。","“forgo”语气偏正式，常用于说明“为了某个目标而放弃某种享受/机会”。"]}
{"word":"fogproof","summary":{"en":"Fogproof means “resistant to fogging,” especially for lenses or glass so your view stays clear.","zh":"Fogproof 指“防起雾的”，常用于镜片或玻璃等，能保持清晰视野。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to fogging (not likely to become covered with mist or condensation that blocks visibility), especially on lenses or glass surfaces.","zh":"防起雾的；不易起雾的（尤指镜片或玻璃表面不容易因水汽凝结而变得模糊）。"},"examples":[{"en":"These goggles are fogproof, so you can see clearly while swimming.","zh":"这副泳镜是防起雾的，所以游泳时视野更清晰。"},{"en":"Look for a fogproof coating if you wear glasses in cold weather.","zh":"如果你在寒冷天气戴眼镜，建议选择带防起雾涂层的产品。"}]}],"synonyms":["anti-fog","anti-fogging","fog-resistant"],"phonetic":"/ˈfɔɡˌpruːf/","extraExplanation":["“fogproof”常见于产品说明与广告（如护目镜、相机镜头、车灯罩、浴室镜等）。日常口语里也常用“anti-fog / anti-fogging（防雾的）”来表达同样意思。","构词：fog（雾；起雾）+ -proof（“防……的/不受……影响的”），类似：waterproof（防水的）、soundproof（隔音的）。","拼写提示：有时也写作“fog-proof”（加连字符），意思不变。"]}
{"word":"fogram","summary":{"en":"“Fogram” isn’t a standard English word; it’s usually a typo for “program.”","zh":"“fogram” 不是标准英语词，通常是 “program” 的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “program.”","zh":"不是标准英语词；最常见是把 “program（程序/计划）” 拼错成 “fogram”。"},"examples":[{"en":"I think you meant “program,” not “fogram.”","zh":"我觉得你想写的是 “program”，不是 “fogram”。"},{"en":"Can you check the spelling? “Fogram” doesn’t appear in the dictionary.","zh":"你能检查一下拼写吗？“fogram” 不在词典里。"}]}],"extraExplanation":["“f” 和 “p” 在键盘上位置接近，打字时容易把 program 误打成 fogram。","如果你是在特定领域/游戏/社群里看到 “fogram”，它可能是昵称、品牌名或内部梗；你可以把原句发我，我可以根据语境判断意思。"]}
{"word":"fogramite","summary":{"en":"“Fogramite” is not a recognized English word; it’s probably a typo or invented spelling.","zh":"“fogramite”不是公认的英语单词；很可能是拼写错误或自造拼法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up term; meaning depends on what you intended to write.","zh":"不是标准英语单词。很可能是拼写错误或自造词；具体含义取决于你原本想写的词。"},"examples":[{"en":"“Fogramite” doesn’t appear in major English dictionaries—could you check the spelling?","zh":"“fogramite”在主流英语词典里找不到——你能检查一下拼写吗？"},{"en":"If you meant “programmer,” the meaning changes completely.","zh":"如果你想写的是“programmer（程序员）”，意思就完全不同了。"}]}],"phonetic":"/ˈfoʊɡrəˌmaɪt/","extraExplanation":["“fogramite”可能是键盘输入或听写导致的拼写偏差。你可以告诉我：它出现在哪个句子里（上下文），或你想表达的中文意思，我就能更准确地判断你要找的词。","一些常见的相近拼写/读音可能性：programmer（程序员）、programming（编程）、fugitive（逃犯/逃亡者）、format（格式/格式化）、fogram（极少见/非标准）。"]}
{"word":"fogramity","summary":{"en":"“Fogramity” is not a standard English word; it’s likely a misspelling (often of “programming” or “formality”).","zh":"“fogramity”不是标准英语单词；很可能是拼写错误（常见是把“programming/编程”或“formality/正式性、礼节”写错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or a made-up form. In writing, it most often appears when someone intended a different word (for example, “programming” or “formality”).","zh":"不是标准英语单词；通常是拼写错误或临时造词。在写作中多半是把别的词写错了（例如想写“programming/编程”或“formality/正式性、礼节”）。"},"examples":[{"en":"“Fogramity” isn’t in most dictionaries—did you mean “programming”?","zh":"“fogramity”在大多数词典里找不到——你是不是想写“programming（编程）”？"},{"en":"The email had a lot of formality, not “fogramity.”","zh":"那封邮件很正式（formality），不是“fogramity”。"}]}],"phonetic":"/foʊˈɡræmɪti/","extraExplanation":["“fogramity”没有固定词源和公认用法，所以最好先确认你的原意或原句。常见的可能目标：\n1) programming（编程）—和计算机、写代码相关；\n2) formality（正式性/礼节）—和礼貌、正式场合的规矩相关。\n如果你把原句发我，我可以帮你准确判断该用哪个词，并改写成自然英语。"]}
{"word":"fogrum","summary":{"en":"“Fogrum” isn’t a recognized English word; it’s likely a typo (often of “fulcrum”) or a proper name.","zh":"“fogrum”不是常见英语词；多半是拼写错误（常见为“fulcrum”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a name/brand.","zh":"不是标准英语单词；更可能是拼写错误，或是人名/品牌名。"},"examples":[{"en":"I couldn’t find “fogrum” in a dictionary—did you mean “fulcrum”?","zh":"我在词典里找不到“fogrum”——你是不是想写“fulcrum”？"},{"en":"If “fogrum” is a product name, please share the sentence where you saw it.","zh":"如果“fogrum”是产品名，请把你看到它的句子发我。"}]}],"phonetic":"/ˈfɑɡrəm/","extraExplanation":["“fogrum”很可能是把 **fulcrum**（支点/关键点）拼错了。fulcrum 常用于比喻：the fulcrum of the debate（争论的核心/关键点）。","也可能是把 **fog room**（雾室/烟雾室，一般指特定装置或有雾气的房间）连写造成的。如果你能提供上下文（整句话、出处、领域），我可以更准确判断。"]}
{"word":"fogs","summary":{"en":"“Fogs” is the plural form of the noun “fog,” and it can also be the verb form meaning “makes (something) foggy or unclear.”","zh":"“fogs”既可以是名词“fog（雾）”的复数，也可以是动词形式，表示“使起雾/使变得不清晰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of fog: a mass of tiny water droplets in the air that makes it hard to see clearly.","zh":"fog 的复数：空气中由微小水滴组成的雾，使视线不清。"},"examples":[{"en":"Morning fogs are common near the coast.","zh":"海岸附近清晨常有雾。"},{"en":"Heavy fogs can make driving dangerous.","zh":"浓雾会让开车变得危险。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of fog: to cover with fog, or to make something less clear (literally or figuratively).","zh":"fog 的第三人称单数：使起雾、被雾笼罩；也指（比喻）使不清晰、使思路混乱。"},"examples":[{"en":"Cold air fogs the window when you breathe on it.","zh":"你对着窗户呼气时，冷空气会让玻璃起雾。"},{"en":"Stress fogs his thinking during exams.","zh":"压力让他在考试时思路变得不清晰。"},{"en":"The hills fogs over in the early evening.","zh":"傍晚时分山丘开始起雾。"}]}],"synonyms":["mists","haze (similar but not the same)","clouds (as a verb, figurative)"],"phonetic":"/fɑɡz/"}
{"word":"fogscoffer","summary":{"en":"“fogscoffer” is not a standard English word; it’s likely a coined name or a misspelling. If coined, it may suggest “someone who scoffs at fog/uncertainty.”","zh":"“fogscoffer”不是标准英语单词；更可能是自造名称或拼写错误。若为自造词，可能暗示“嘲笑迷雾/不确定性的人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a made-up term, username, fantasy name, or a misspelling. Meaning depends on the context where you saw it.","zh":"不是标准英语单词；很可能是自造词、用户名/网名、奇幻作品里的名称，或拼写错误。具体含义取决于你看到它的语境。"},"examples":[{"en":"I can’t find “fogscoffer” in a dictionary—do you mean “scoffer” or “coffer”?","zh":"我在词典里找不到“fogscoffer”——你是不是想写“scoffer（嘲笑者）”或“coffer（保险箱/金库）”？"},{"en":"In the game chat, FogScoffer was a player name, not a vocabulary word.","zh":"在游戏聊天里，FogScoffer 是玩家名字，不是词汇单词。"}]},{"partOfSpeech":"n.","definition":{"en":"(Possible interpretation if coined) A person who “scoffs at fog,” i.e., someone who mocks confusion/mystery or claims to see clearly through uncertainty.","zh":"（若为自造词的可能理解）“嘲笑雾的人”：指嘲笑迷雾/混乱/神秘的人，或自称能看穿不确定性的人。"},"examples":[{"en":"In the novel, the FogScoffer refuses to believe in rumors and hidden plots.","zh":"在小说里，“FogScoffer”不相信谣言和暗中的阴谋。"},{"en":"Don’t be a fogscoffer—some problems really are unclear at first.","zh":"别当“fogscoffer”——有些问题一开始确实不清楚。"}]}],"phonetic":"/ˈfɑɡˌskɔfɚ/","extraExplanation":["这个词看起来像把 fog（雾、迷雾）+ scoffer（嘲笑者）拼在一起，或是 fog + coffer（保险箱/金库）之类的混合造词；但英语里并没有固定词条。","如果你把它出现的句子/截图发我，我可以根据上下文判断它到底是人名、账号名、地名，还是某个词的拼写错误。","你也可以检查是否想表达：scoffer（嘲笑者）、goffer（高尔夫球童/挖洞的动物口语）、coffer（（多用复数）资金、国库）等相近拼写。"]}
{"word":"fogus","summary":{"en":"“Fogus” is mainly a surname/proper name; in some contexts it may be a misspelling of “bogus” or “focus.”","zh":"“Fogus”主要是姓氏/专有名词；在某些语境中也可能是“bogus”或“focus”的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), often seen in the U.S.; it may also appear as an online username or as the name of a public figure.","zh":"一个姓氏（家族姓），在美国较常见；也可能作为网名，或指某位公众人物的名字。"},"examples":[{"en":"Chris Fogus wrote books about programming and functional thinking.","zh":"Chris Fogus 写过关于编程与函数式思维的书。"},{"en":"I saw “Fogus” as the author name on the article.","zh":"我在文章上看到作者署名是“Fogus”。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, nonstandard) a misspelling or misreading of “bogus” or “focus,” depending on context.","zh":"（非标准用法）可能是对“bogus（假的）”或“focus（专注）”的拼写或识读错误，需看上下文判断。"},"examples":[{"en":"If you meant “bogus,” you could say: That rumor is bogus.","zh":"如果你想表达“bogus（假的）”，可以说：That rumor is bogus.（那个谣言是假的。）"},{"en":"If you meant “focus,” you could say: Please focus on your work.","zh":"如果你想表达“focus（专注）”，可以说：Please focus on your work.（请专心工作。）"}]}],"synonyms":["(as a name) none","(if you meant “bogus”) fake","(if you meant “focus”) concentrate"],"phonetic":"ˈfoʊɡəs","extraExplanation":["“Fogus”在英语里更像专有名词（姓氏/用户名），并不是常见词汇，所以在阅读或写作中最好结合上下文确认：是指某个人/账号，还是把“bogus / focus”拼错了。","如果你是想查某位名叫 Fogus 的作者/人物（例如 Chris Fogus），告诉我你看到它的句子或链接标题，我可以帮你判断具体指代与更自然的表达。"]}
{"word":"fogy","summary":{"en":"A “fogy” is an old-fashioned person who resists change (often said as “old fogy”).","zh":"“fogy”指守旧、抗拒改变的人（常说“old fogy”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old-fashioned person who is set in their ways and resistant to new ideas or changes.","zh":"守旧的人；墨守成规、抗拒新事物的人（常带调侃或轻微贬义）。"},"examples":[{"en":"My uncle is a real fogy—he still refuses to use a smartphone.","zh":"我叔叔很守旧——他到现在还拒绝用智能手机。"},{"en":"Don’t be a fogy; give the new system a chance.","zh":"别那么守旧；给新系统一个机会吧。"},{"en":"She joked that she was becoming an old fogy because she preferred books to apps.","zh":"她开玩笑说自己快变成“老古板”了，因为她更喜欢纸质书而不是应用软件。"}]}],"synonyms":["fogey","old fogey","traditionalist","stick-in-the-mud","conservative (informal)"],"phonetic":"/ˈfoʊɡi/","extraExplanation":["“fogy”常见于固定说法“old fogy”，语气多为半开玩笑的批评，指人思想或生活方式跟不上时代。","词源上与“fogey”同义，19世纪英语里逐渐形成“守旧、落伍的人”的含义；现代写法以“fogey”更常见，“fogy”较少见但仍可用。"]}
{"word":"fogydom","summary":{"en":"Fogeydom means old-fashioned attitudes or the world of people who resist change.","zh":"Fogeydom 指守旧的态度/作风，或指抗拒变化的老派守旧者的圈子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The attitudes, habits, or group of people who are old-fashioned and resistant to change (the world of “old fogeys”).","zh":"守旧风气；老派守旧者的群体或作风（“老顽固/老古板”的世界）。"},"examples":[{"en":"The young designers tried to break away from the fogeydom of the traditional fashion house.","zh":"年轻设计师试图摆脱那家传统时装屋的守旧风气。"},{"en":"To her, the rules about “proper” behavior felt like pure fogeydom.","zh":"在她看来，那些关于“得体”行为的规矩简直就是十足的守旧观念。"}]}],"synonyms":["old-fashionedness","conservatism","stuffiness","traditionalism"],"phonetic":"/ˈfoʊɡiˌdəm/","extraExplanation":["“fogeydom”常写作“fogeydom”，你输入的“fogydom”很可能是拼写变体或误拼。","词根来自“fogey”（老古板、守旧的人），加后缀“-dom”（表示“领域/状态/群体”，如“kingdom王国”“freedom自由”），因此整体意思是“老古板的作风/圈子”。","语气通常带一点调侃或批评，常用于谈论文化、时尚、礼仪、政治等领域对变化的抗拒。"]}
{"word":"fogyish","summary":{"en":"“Fogyish” means old-fashioned or out of date, like an “old fogey.”","zh":"“fogyish”表示守旧、老派、过时，像“old fogey（老古板）”那样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Old-fashioned; like an “old fogey” (someone who is out of date in tastes or ideas).","zh":"守旧的；老派的；像“老顽固/老古板”（在品味或观念上落伍的人）那样的。"},"examples":[{"en":"His fogyish opinions about work-from-home annoyed his younger coworkers.","zh":"他对远程办公的守旧看法让年轻同事很不耐烦。"},{"en":"The restaurant’s fogyish decor felt charming to some people and outdated to others.","zh":"这家餐厅的老派装潢，有人觉得很有味道，也有人觉得过时。"},{"en":"She teased him for his fogyish taste in music.","zh":"她拿他老派的音乐品味开玩笑。"}]}],"synonyms":["old-fashioned","outdated","behind the times","traditional","conservative"],"phonetic":"/ˈfoʊɡiɪʃ/","extraExplanation":["“fogyish”来自名词“fogey”（也常写作“fogy”）。“old fogey”指思想、审美或做事方式非常传统、跟不上时代的人。语气通常带一点调侃或轻微贬义，但在轻松语境里也可能是半开玩笑的。","用法提示：它常用来形容“opinions / attitudes / tastes / style / decor（观点/态度/品味/风格/装潢）”等。更中性的替代词可以用“old-fashioned”。"]}
{"word":"fogyishness","summary":{"en":"Fogyishness means an old-fashioned, out-of-date, or overly conservative attitude or style.","zh":"Fogyishness 指一种老派、过时或过于保守的态度或作风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being old-fashioned, conservative, or out of touch with modern ideas; the behavior or attitude of a (sometimes mildly humorous) “old fogey.”","zh":"守旧、老派或与现代观念脱节的特质；带点（常为轻微调侃的）“老古板”式态度或作风。"},"examples":[{"en":"Some people find his constant complaints about new music to be pure fogyishness.","zh":"有人觉得他老是抱怨新音乐，完全就是一种老古板作风。"},{"en":"The office’s strict dress code feels like leftover fogyishness from another era.","zh":"办公室严格的着装规定，像是从另一个年代遗留下来的守旧做法。"}]}],"synonyms":["old-fashionedness","stodginess","conservatism","hideboundness","behind-the-times attitude"],"phonetic":"/ˈfoʊɡiɪʃnəs/","extraExplanation":["“fogyishness”来自形容词“fogyish”（像老古板一样的），而“fogyish”又与名词“fogey / fogy”（老古板、守旧的人）有关。这个词多用于带一点幽默或轻微讽刺的语气，强调“过于老派、跟不上时代”。在正式写作里更常见的是“old-fashionedness / stodginess / conservatism”。"]}
{"word":"fogyism","summary":{"en":"Fogyism means old-fashioned, outdated attitudes or practices.","zh":"fogyism 指守旧、过时的观念或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Old-fashioned thinking or devotion to outdated customs and ideas; the attitude of a “fogy” (a very traditional, stuck-in-the-past person).","zh":"守旧思想；对过时习俗与观念的执着（“老顽固/守旧派”的作风）。"},"examples":[{"en":"The company finally moved past its old fogyism and started testing new ideas.","zh":"这家公司终于摆脱了旧式守旧作风，开始尝试新点子。"},{"en":"Some critics said the school’s strict dress code was pure fogyism.","zh":"一些批评者说学校严格的着装规定完全是守旧思想。"}]}],"synonyms":["old-fashionedness","conservatism","traditionalism","outdatedness","stuck-in-the-past attitude"],"phonetic":"/ˈfoʊɡiˌɪzəm/","extraExplanation":["“fogyism”来自“fogy”（常见于“old fogy”，意为守旧的人）+ “-ism”（表示某种思想/作风）。语气常带批评或调侃。","在现代英语中比较少见，更常用的表达有“old-fashionedness”“traditionalism”（中性或褒/贬皆可）以及更口语的“being stuck in the past”。"]}
{"word":"fogyisms","summary":{"en":"“Fogyisms” are outdated, overly traditional ideas or habits.","zh":"“Fogyisms”指过时、过于守旧的观念或习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Old-fashioned or stubbornly traditional ideas, habits, or attitudes (often seen as out of date).","zh":"守旧思想；老派作风；顽固的传统观念（常带贬义，指过时）。"},"examples":[{"en":"Some of his workplace rules feel like old-fashioned fogyisms that slow everyone down.","zh":"他的一些职场规定像是过时的守旧作风，让大家做事变慢。"},{"en":"She challenged the school’s fogyisms about what girls “should” study.","zh":"她质疑学校里关于女生“应该”学什么的守旧观念。"}]}],"synonyms":["old-fashionedness","traditionalism","conservatism","outmoded ideas","old-school attitudes"],"phonetic":"/ˈfoʊɡiˌɪzəm/","extraExplanation":["“fogyism”来自“(old) fogey”（守旧的人、老古板）。它通常用于批评某种观念或做法太保守、跟不上时代。","用法提示：常见搭配有“old-fashioned fogyisms / Victorian fogyisms / social fogyisms”等；语气多为讽刺或批判。"]}

