{"word":"foh","summary":{"en":"“FOH” most commonly means “front of house” (customer-facing staff/area). In slang, it can also mean the rude phrase “fuck out of here.”","zh":"“FOH”最常见指“Front of House（前场/前台）”即面向顾客的区域或员工；在俚语中也可指粗鲁的“fuck out of here（滚开/别扯了）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in restaurants, hotels, and theaters) “front of house”: the public/customer-facing area and the staff who serve guests (e.g., servers, hosts, bartenders).","zh":"（尤指餐厅、酒店、剧院）“前场/前台（Front of House）”：面向顾客的区域，以及负责接待与服务顾客的员工（如服务员、迎宾、酒保）。"},"examples":[{"en":"I started in FOH as a host before I learned to bartend.","zh":"我一开始在FOH做迎宾，后来才学会当酒保。"},{"en":"FOH staff handle guests, while BOH staff work in the kitchen.","zh":"FOH员工负责接待顾客，BOH员工在后厨工作。"}]},{"partOfSpeech":"phrase","definition":{"en":"Slang (often rude): “fuck out of here,” used to show strong disbelief, rejection, or to tell someone to leave.","zh":"俚语（常粗鲁/冒犯）：“滚开/别扯了/你在开什么玩笑”（字面是粗口“fuck out of here”），用于强烈表示不信、否定，或让对方走开。"},"examples":[{"en":"FOH—there’s no way that happened.","zh":"FOH——这不可能发生。"},{"en":"If you’re going to insult me, FOH.","zh":"如果你要侮辱我，那就滚开。"}]}],"synonyms":["front of house","FOH staff","(slang) no way","(slang) get out of here"],"phonetic":"ˌɛf oʊ ˈeɪtʃ","extraExplanation":["FOH在不同行业含义差异很大：在餐饮/演出行业里通常是“Front of House（前场）”，是相对中性的工作术语。","在社交媒体、聊天或说唱语境中，FOH也常被当作粗口缩写（“fuck out of here”）。这个用法语气很冲，容易冒犯他人；正式场合或不熟的人之间建议避免使用。"]}
{"word":"fohat","summary":{"en":"“fohat” is not a standard English word; it’s likely a typo (e.g., “format” or “for that”).","zh":"“fohat”不是标准英语单词，可能是拼写错误（如“format”或“for that”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a mistyped word/phrase (for example, “format,” “for that,” or “fohat” as a name).","zh":"不是标准英语单词。更可能是拼写/输入错误或某个词组（例如“format”“for that”，或作为名字/用户名）。"},"examples":[{"en":"I couldn’t find “fohat” in an English dictionary—did you mean “format”?","zh":"我在英语词典里找不到“fohat”——你是不是想写“format”？"},{"en":"If you meant “for that,” you can write: “Thanks for that.”","zh":"如果你想表达“for that”，可以写：“Thanks for that.”"}]}],"phonetic":"/foʊhæt/","extraExplanation":["“fohat”在常见英语词典中没有对应词条。最常见的情况是：\n1) 你想输入的是 **format**（格式/排版/格式化）；\n2) 你想写的是短语 **for that**（为此/就那件事）；\n3) 它可能是人名、网名、品牌名或其他语言的词。\n把你看到“fohat”的完整句子发我，我可以根据上下文判断你真正想查的词。"]}
{"word":"fohawk","summary":{"en":"Fauxhawk: a mohawk-like hairstyle with a raised center strip but not fully shaved sides.","zh":"Fauxhawk：类似莫霍克头、但两侧不剃光的发型（中间竖起一条）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hairstyle similar to a mohawk: the hair is styled up in a strip along the middle of the head, but the sides are not completely shaved (often just cut shorter).","zh":"“仿莫霍克头”（类似莫霍克头的发型）：头发沿头顶中间梳起成一条竖起的“脊”，但两侧通常不会剃光（多为剪短或压平）。"},"examples":[{"en":"He got a fauxhawk for the summer because it looks edgy but isn’t too extreme.","zh":"他夏天剪了个仿莫霍克头，因为看起来很酷很有个性，但又不会太夸张。"},{"en":"She styled her fauxhawk with gel before the concert.","zh":"她在演唱会前用发胶把仿莫霍克头定型。"}]}],"synonyms":["faux hawk","fake mohawk","mohawk-inspired hairstyle"],"phonetic":"/ˈfoʊhɔk/","extraExplanation":["“fauxhawk”里的 faux 是法语借词，意思是“假的、仿的”，所以 fauxhawk 字面意思是“仿（假）莫霍克”。常见于流行文化与时尚语境，用来表达“有莫霍克的感觉，但更日常、较容易接受”。","你输入的“fohawk”通常是对“fauxhawk”的拼写误写/口语化写法；正式拼写更常用 fauxhawk。"]}
{"word":"fohn","summary":{"en":"A fohn is a warm, dry downslope wind on the leeward side of mountains (especially the Alps).","zh":"fohn 指焚风：山脉背风坡吹下的温暖、干燥下坡风（尤指阿尔卑斯地区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warm, dry wind that blows down the leeward (downwind) side of mountains, especially in the Alps, often causing a sudden rise in temperature and faster snowmelt","zh":"焚风；一种温暖、干燥的下坡风，常见于阿尔卑斯山脉背风坡，会导致气温突然升高并加速融雪"},"examples":[{"en":"A fohn wind can make the weather feel surprisingly springlike in the middle of winter.","zh":"焚风会让冬天的天气突然感觉像春天一样温暖。"},{"en":"After the fohn arrived, the snow on the slopes began to melt quickly.","zh":"焚风一来，山坡上的积雪就开始迅速融化。"}]}],"synonyms":["Foehn wind","downslope wind","Chinook (similar phenomenon)"],"phonetic":"/fɑn/","extraExplanation":["“fohn”常写作“Föhn”（德语），指一种典型的地形影响风：湿空气爬上迎风坡时降水并释放热量，越过山顶后下沉增温、变得更干燥，于是背风坡出现又暖又干的风。","英语里它多用于气象与地理语境；在北美，类似现象更常用“Chinook”来指代（尤其落基山脉一带）。"]}
{"word":"fohns","summary":{"en":"“Fohns” means warm, dry downslope winds (plural of “foehn/föhn”).","zh":"“fohns”指“焚风”的复数：从山脉背风坡下吹的暖干风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of foehn (also spelled föhn): a warm, dry wind that blows down the leeward side of mountains (often in the Alps), sometimes causing rapid warming and snowmelt.","zh":"foehn（也拼作 föhn）的复数：一种从山脉背风坡下吹的温暖、干燥的风（阿尔卑斯山区常见），常会导致气温迅速升高、积雪加速融化。"},"examples":[{"en":"In spring, fohns can melt snow surprisingly fast.","zh":"在春天，fohns 会让积雪融化得出奇地快。"},{"en":"The forecast mentioned strong fohns coming off the mountains.","zh":"天气预报提到将有强劲的 fohns 从山上下吹下来。"}]}],"synonyms":["foehn winds","chinooks (similar phenomenon, North America)"],"phonetic":"/fɝnz/","extraExplanation":["“foehn/föhn”常见于地理与气象语境，尤其指阿尔卑斯山区的焚风现象；英语里也可用作普通名词，泛指类似的下坡暖干风。","拼写上你输入的“fohns”是不带变音符号的复数形式；单数常写作 foehn 或 föhn。"]}

