{"word":"foible","summary":{"en":"A foible is a minor, usually harmless personal weakness or quirky habit.","zh":"foible 指（通常无伤大雅的）小缺点或古怪小习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small weakness or minor fault in someone’s character; a harmless (sometimes even endearing) eccentricity","zh":"（性格上的）小缺点；小毛病（通常不算严重，有时甚至让人觉得可爱）"},"examples":[{"en":"One of his foibles is that he checks his phone every few minutes.","zh":"他的一个小毛病是每隔几分钟就要看一次手机。"},{"en":"She’s brilliant, and her little foibles just make her more human.","zh":"她很聪明，而她那些小缺点反而让她更有人情味。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a minor weakness in a plan, system, or argument","zh":"（较少见）计划、系统或论点中的小漏洞；小弱点"},"examples":[{"en":"The proposal is promising, but it has a few foibles that need fixing.","zh":"这个提案很有前景，但还有一些小漏洞需要修正。"}]}],"synonyms":["quirk","weakness","eccentricity","idiosyncrasy","minor flaw"],"phonetic":"/ˈfɔɪbəl/","extraExplanation":["“foible”常带有比较温和、带点幽默或宽容的语气，强调“无伤大雅的小缺点”。如果是更严重的缺点，英语里更常用“flaw / vice / defect”等词。","词源上与法语有关，早期含义和“（剑的）较弱部分”相关，后来引申为“人的薄弱点、性格弱点”。"]}
{"word":"foibles","summary":{"en":"Foibles are small, usually harmless personal flaws or quirky habits.","zh":"Foibles 指通常无伤大雅的个人小缺点或怪癖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, harmless personal weaknesses or quirky habits; minor flaws that are often more amusing than serious.","zh":"（通常无伤大雅的）小缺点；怪癖；小毛病。"},"examples":[{"en":"Everyone has foibles, and that’s part of being human.","zh":"每个人都有些小缺点，这也是人之常情。"},{"en":"His foibles—like always arriving five minutes early—made him kind of charming.","zh":"他的小毛病——比如总是提前五分钟到——反而让人觉得挺可爱。"},{"en":"The novel describes the characters’ foibles with gentle humor.","zh":"这部小说用温和的幽默描写人物的小缺点。"}]}],"synonyms":["quirks","idiosyncrasies","weaknesses","eccentricities","minor flaws"],"phonetic":"/ˈfɔɪbəlz/","extraExplanation":["“Foibles”常用复数形式，尤其在谈论一个人“各种小毛病”时很自然。单数是 foible。","语气通常比“fault/defect”更轻，带一点宽容或调侃；但在正式批评时也可能暗示“不够成熟/不够专业”的小弱点。","搭配建议：human foibles（人性的弱点/小毛病）、personal foibles（个人小毛病）、endearing foibles（惹人喜欢的小毛病）。"]}
{"word":"foiblesse","summary":{"en":"Foiblesse is a rare word meaning a minor weakness or character flaw, similar to “foible,” and sometimes refers to general frailty.","zh":"foiblesse 是个较罕见的词，意思是小弱点/小缺点（类似 foible），有时也指一般的虚弱或脆弱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A weakness, small fault, or minor character flaw; a foible.","zh":"（罕见）弱点、小毛病；性格上的小缺点（同 foible）。"},"examples":[{"en":"Everyone has a foiblesse or two, so try to be patient with your coworkers.","zh":"每个人都有一两个小毛病，所以尽量对同事多些耐心。"},{"en":"Her foiblesse is talking too fast when she gets excited.","zh":"她的一个小缺点是兴奋时说话太快。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Physical or mental weakness; frailty.","zh":"（罕见）身体或精神上的虚弱；脆弱。"},"examples":[{"en":"After the long illness, he still felt a lingering foiblesse.","zh":"久病之后，他仍感到挥之不去的虚弱。"},{"en":"The novel portrays the hero’s foiblesse as well as his courage.","zh":"这部小说既描写了主人公的脆弱，也描写了他的勇气。"}]}],"synonyms":["foible","weakness","flaw","failing","frailty"],"phonetic":"/ˌfwɑːbəlˈɛs/","extraExplanation":["“Foiblesse”源自法语，常被看作是“foible（小缺点）”的较少见变体或带有法语色彩的写法。现代英语里更常用“foible”或“weakness”。","使用建议：如果你在写正式或现代英文，通常用“foible/weakness”更自然；“foiblesse”会显得很文艺、古典或带一点刻意的法语风格。"]}
{"word":"foil","summary":{"en":"Foil can mean a thin metal sheet (like aluminum foil), a contrasting character/thing that highlights another (literary foil), or the verb meaning to prevent a plan from succeeding.","zh":"Foil既可指铝箔/锡纸等金属薄片，也可指文学中的“反衬/陪衬”，还可作动词表示“挫败、阻止（计划得逞）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thin sheet of metal (often aluminum) used for wrapping, cooking, or covering things","zh":"（常指铝制的）金属薄片/金属箔，用于包装、烹饪或覆盖物品"},"examples":[{"en":"Wrap the leftovers in aluminum foil and put them in the fridge.","zh":"把剩菜用铝箔包起来，然后放进冰箱。"},{"en":"Cover the tray with foil so the food doesn’t dry out.","zh":"用锡纸盖住烤盘，这样食物就不会变干。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that contrasts with another and makes that other seem clearer or stronger","zh":"（衬托主角特质的）对照人物/陪衬；反衬物"},"examples":[{"en":"In the story, the calm friend acts as a foil to the impulsive hero.","zh":"在故事里，那位冷静的朋友用来衬托冲动的英雄。"},{"en":"Her seriousness is a foil for his playful personality.","zh":"她的严肃反衬出他的爱玩性格。"}]},{"partOfSpeech":"vt.","definition":{"en":"to stop or prevent someone’s plan or attempt from succeeding","zh":"挫败；阻止（计划/企图得逞）"},"examples":[{"en":"The police foiled the robbery before anyone was hurt.","zh":"警方在无人受伤前挫败了这起抢劫。"},{"en":"A sudden storm foiled our hiking plans.","zh":"一场突如其来的暴风雨打乱了我们的徒步计划。"}]}],"synonyms":["aluminum foil","wrap","contrasting character","counterpart","thwart","prevent"],"phonetic":"/fɔɪl/","extraExplanation":["“foil”有两个很常见但不相关的用法：一个是日常生活里的“铝箔/锡纸”，另一个是文学与写作中的“反衬（陪衬）”。写作里说A is a foil to B，意思是A通过对比让B的性格或特点更突出（不一定是敌人，也不一定是负面角色）。","历史上“foil”在文学义项里，和“放在宝石下面的金属薄片（用来反光、显得更闪）”有关，因此引申为“衬托、反衬”。"]}
{"word":"foil-lined","summary":{"en":"Foil-lined describes something that has an inner layer of metal foil, usually for freshness, protection, or heat reflection.","zh":"foil-lined 指内部有金属箔（多为铝箔）衬里的物品，常用于保鲜、防护或反射热量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lined or covered on the inside with metal foil (usually aluminum foil), often to reflect heat, keep food fresh, or provide a moisture/grease barrier.","zh":"（内部）用金属箔（通常是铝箔）衬里/覆盖的，常用于反射热量、保鲜或防潮防油。"},"examples":[{"en":"Use a foil-lined baking sheet to make cleanup easier.","zh":"用一张铝箔衬里的烤盘可以更容易清理。"},{"en":"The snack comes in a foil-lined bag to help keep it fresh.","zh":"这种零食用内衬铝箔的袋子包装，有助于保持新鲜。"},{"en":"She stored the leftovers in a foil-lined container.","zh":"她把剩菜放在内衬铝箔的容器里保存。"}]}],"synonyms":["lined with foil","aluminum-foil-lined","foil backed"],"phonetic":"/ˈfɔɪl laɪnd/","extraExplanation":["“foil-lined”是由名词“foil（金属箔）”+ 过去分词“lined（衬里的）”构成的复合形容词，常见于包装（foil-lined pouch/bag）和烘焙（foil-lined pan/sheet）。","在英美语境里，foil多指“aluminum foil（铝箔）”。也常写作不加连字符的“foil lined”，但作定语时加连字符更常见、更清晰：a foil-lined bag。"]}
{"word":"foilable","summary":{"en":"Foilable means “able to be foiled (stopped/defeated),” and in sailing it can mean “able to use or be fitted with hydrofoils.”","zh":"foilable 指“可被挫败/阻止的”；在航海语境中也可指“可使用或可加装水翼的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be prevented, stopped, or defeated (can be “foiled”).","zh":"可被挫败的；可被阻止或阻挠的（能被“foil”打破/破坏的）。"},"examples":[{"en":"The plan was foilable because it depended on a single weak password.","zh":"这个计划是可被挫败的，因为它依赖一个薄弱的密码。"},{"en":"With better security, many online attacks become foilable.","zh":"加强安全措施后，许多网络攻击就变得可被阻止。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sailing/boats) Able to be fitted with foils (hydrofoils) or capable of foiling.","zh":"（航海/船艇）可加装水翼的；可进行“水翼滑行”的。"},"examples":[{"en":"Some small racing boats are foilable, but they don’t always fly in light wind.","zh":"有些小型竞赛船是可加装水翼的，但在微风时不一定能“飞起来”。"}]}],"synonyms":["preventable","stoppable","thwartable","defeatable"],"phonetic":"/ˈfɔɪləbəl/","extraExplanation":["“foilable”由动词 foil（挫败、阻止；也指给船装水翼/使用水翼）+ 形容词后缀 -able 构成，意思是“能够被……的”。在日常英语里更常见的表达是 can be foiled、preventable（可预防的）或 stoppable（可阻止的），所以 “foilable” 本身比较少见，多出现在技术写作或特定运动/器材语境中。"]}
{"word":"foiled","summary":{"en":"“Foiled” usually means a plan or crime was prevented from succeeding; it can also mean something was wrapped in metal foil (as the past form of “foil”).","zh":"“foiled”通常指计划或犯罪被阻止、被挫败；也可指（作为动词foil的过去式）用金属箔/锡纸包裹。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a plan, attempt, or crime) stopped from succeeding; prevented.","zh":"（计划、尝试或犯罪）被挫败的；未能得逞的。"},"examples":[{"en":"The bank robbery was foiled by the police.","zh":"这起银行抢劫被警方挫败了。"},{"en":"Their attempt to cheat on the test was quickly foiled.","zh":"他们考试作弊的企图很快就被阻止了。"},{"en":"We changed our route because bad weather foiled our hiking plans.","zh":"因为恶劣天气打乱了我们的徒步计划，我们改了路线。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “foil”: to stop (someone) from doing something; to defeat a plan or effort.","zh":"“foil”的过去式/过去分词：阻止（某人）做某事；挫败某个计划或努力。"},"examples":[{"en":"The guards foiled the escape attempt.","zh":"守卫挫败了越狱企图。"},{"en":"Her quick thinking foiled the scam.","zh":"她的机智反应挫败了这场骗局。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “foil”: to cover or wrap with thin metal foil (often for cooking or protection).","zh":"“foil”的过去式/过去分词：用（金属）箔包裹或覆盖（常用于烹饪或防护）。"},"examples":[{"en":"I foiled the leftovers to keep them fresh.","zh":"我用锡纸把剩菜包起来保鲜。"},{"en":"The baked potato was foiled and kept warm.","zh":"烤土豆用锡纸包着保温。"}]}],"synonyms":["thwarted","prevented","stopped","blocked","frustrated","defeated"],"phonetic":"/fɔɪld/","extraExplanation":["“foiled”最常见于新闻、侦探故事、动作片等语境，表示阴谋或犯罪“未遂/被挫败”。常见搭配：a foiled plot（被挫败的阴谋）、foiled attempt（未遂）、foiled by…（被……挫败）。","注意不要和名词“foil（陪衬/对照人物）”混淆：在文学里，a foil 是用来衬托主角性格的角色，但它和“foiled（被挫败的）”是不同概念。"]}
{"word":"foiler","summary":{"en":"A foiler is most commonly someone who stops a plan from succeeding; it can also mean a foil fencer, or (less commonly) hydrofoil equipment or its rider.","zh":"foiler最常指“阻挠者/挫败者”；也可指“花剑选手”；较少情况下指水翼艇/水翼板或其使用者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who prevents a plan or crime from succeeding; someone who foils (stops) something","zh":"阻挠者；挫败他人计划/阴谋的人"},"examples":[{"en":"The quick-thinking guard was the foiler of the robbery.","zh":"那位反应迅速的保安挫败了抢劫。"},{"en":"In the story, she becomes the foiler of the villain’s plot.","zh":"在故事里，她成了反派阴谋的破坏者。"}]},{"partOfSpeech":"n.","definition":{"en":"a fencer who competes using a foil (the light thrusting sword used in fencing)","zh":"（击剑）花剑选手"},"examples":[{"en":"He’s a skilled foiler with fast footwork.","zh":"他是一位技术娴熟的花剑选手，步法很快。"},{"en":"The tournament includes foilers, épée fencers, and sabre fencers.","zh":"这项比赛包括花剑选手、重剑选手和佩剑选手。"}]},{"partOfSpeech":"n.","definition":{"en":"a boat, board, or aircraft designed to rise on a hydrofoil; also, a person who rides/uses such equipment (less common)","zh":"（水上翼）水翼艇/水翼板等；（较少）使用或驾驶水翼装备的人"},"examples":[{"en":"The foiler lifted smoothly above the water as it gained speed.","zh":"它加速后，水翼艇平稳地抬升到水面之上。"},{"en":"More beginners are becoming foilers as e-foils get popular.","zh":"随着电动水翼板流行，越来越多新手开始玩水翼。"}]}],"synonyms":["preventer","stopper","thwarter","spoiler","foil fencer"],"phonetic":"/ˈfɔɪlər/","extraExplanation":["“foiler”来自动词“foil”（阻止、挫败）。在体育语境中，它也常指“使用花剑（foil）的击剑选手”；击剑三种常见武器是foil（花剑）、épée（重剑）、sabre（佩剑）。","在水上运动里，“foiler”有时用来指能“上翼”（靠水翼抬升离开水面）的艇/板，或玩水翼运动的人；这种用法更偏口语和圈内表达。"]}
{"word":"foiling","summary":{"en":"Foiling most often means the act of preventing a plan or attack from succeeding; it can also refer to decorative use of metal foil in printing/packaging.","zh":"Foiling 最常指“挫败、阻止（计划或袭击等）”；也可指印刷/包装中的“烫箔、贴箔”等金属箔装饰工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of stopping someone’s plan or preventing something from succeeding","zh":"挫败；阻止（某人的计划或某事成功）"},"examples":[{"en":"The police announced the foiling of a bank robbery.","zh":"警方宣布挫败了一起银行抢劫案。"},{"en":"Better security played a key role in the foiling of the attack.","zh":"更好的安保在阻止这次袭击中起了关键作用。"}]},{"partOfSpeech":"n.","definition":{"en":"using or adding thin metal foil (especially for decoration or backing materials)","zh":"用金属箔装饰；加贴金属箔作衬底（尤指装饰用途）"},"examples":[{"en":"The packaging uses foiling to make the logo shine.","zh":"这款包装用金属箔工艺让标志更闪亮。"},{"en":"Foiling is common in greeting cards and book covers.","zh":"贺卡和书封面上常见烫箔/贴箔工艺。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “foil”: stopping a plan, attempt, or attack","zh":"“foil”的现在分词：挫败（计划/企图/袭击等）"},"examples":[{"en":"They are foiling attempts to cheat on the exam.","zh":"他们正在挫败考试作弊的企图。"},{"en":"Quick action helped in foiling the scam.","zh":"迅速行动有助于挫败这场骗局。"}]}],"synonyms":["thwarting","preventing","stopping","frustrating","blocking"],"phonetic":"/ˈfɔɪlɪŋ/","extraExplanation":["“foiling (a plot/attack/robbery)”在新闻里非常常见，通常搭配动词“announce/report”或名词“attempt/plot”。语气较正式。","“foil”还有“金属箔（如 aluminum foil）”的意思；因此“foiling”也可指烫箔/贴箔等工艺。根据上下文判断：新闻安全类多是“挫败”，印刷包装类多是“烫箔/贴箔”。"]}
{"word":"foils","summary":{"en":"Foils can mean metal wrapping sheets (like aluminum foil), or it can come from “foil” meaning to stop a plan; it can also mean a contrasting character in a story, or a fencing sword.","zh":"Foils 常指金属箔（如铝箔/锡纸）；也可来自动词 foil，表示“挫败计划”；还可指文学中的“陪衬/对照”，或击剑器材“花剑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) Thin sheets of metal, especially aluminum, used for wrapping, covering, or cooking.","zh":"（常用复数）金属薄片，尤指铝箔，用于包裹、覆盖或烹饪。"},"examples":[{"en":"Wrap the leftovers in foil and put them in the fridge.","zh":"把剩菜用铝箔包起来，放进冰箱。"},{"en":"Cover the pan with foil to keep the food from drying out.","zh":"用铝箔盖住烤盘，防止食物变干。"}]},{"partOfSpeech":"vt.","definition":{"en":"To prevent someone’s plan from succeeding; to stop or defeat an attempt.","zh":"挫败（计划）；阻止某事成功；击败（企图）。"},"examples":[{"en":"The police foiled the robbery before anyone was hurt.","zh":"警方在无人受伤前挫败了这起抢劫。"},{"en":"Her careful planning foiled their attempt to trick her.","zh":"她周密的计划挫败了他们想骗她的企图。"}]},{"partOfSpeech":"n.","definition":{"en":"A character or thing that contrasts with another, making the other seem clearer or stronger (common in stories).","zh":"（文学/叙事中）陪衬；对照人物/事物，用来凸显另一方的特征。"},"examples":[{"en":"In the novel, the brave sister serves as a foil to her cautious brother.","zh":"在小说里，勇敢的姐姐作为陪衬，凸显了谨慎的弟弟。"},{"en":"The calm setting is a foil for the chaos that follows.","zh":"平静的环境为随后发生的混乱形成对照。"}]},{"partOfSpeech":"n.","definition":{"en":"A light sword used in the sport of fencing.","zh":"（击剑用的）花剑。"},"examples":[{"en":"She practices with a foil twice a week.","zh":"她每周用花剑训练两次。"},{"en":"In fencing class, we learned basic foil attacks.","zh":"在击剑课上，我们学习了花剑的基本进攻。"}]}],"synonyms":["aluminum foil","wrap","thwart","prevent","stop","frustrate","counter","contrast","fencing foil"],"phonetic":"/fɔɪl/","extraExplanation":["“Foil”作名词时很常见的是“铝箔/锡纸”。日常里你会更常听到“aluminum foil”（美式）或“tin foil”（口语里常用，但现代多为铝）。","“foil”作动词“挫败”常用于新闻或正式语境：foil a plan/attempt/plot（挫败计划/企图/阴谋）。","文学里的“foil（陪衬）”指通过对比来突出主角特点的角色或元素，是写作与文学分析中常见术语。"]}
{"word":"foilsman","summary":{"en":"A foilsman is a fencer who competes in foil fencing.","zh":"foilsman 指主练花剑项目的击剑运动员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fencer who specializes in the foil (a light thrusting sword used in the sport of fencing).","zh":"（击剑中）使用花剑并以花剑项目为主的击剑手。"},"examples":[{"en":"She trained as a foilsman before switching to épée.","zh":"她起初主练花剑，后来改练重剑。"},{"en":"The coach paired the foilsman with a sabre fencer for footwork drills.","zh":"教练让花剑选手和佩剑选手一起做步法训练。"}]}],"synonyms":["foil fencer","fencer"],"phonetic":"/ˈfɔɪlz.mən/","extraExplanation":["“Foilsman”常见于较传统或较少见的用法，现代英语里更常说“foil fencer”（花剑选手）或直接说“fencer”（击剑运动员）。","击剑三种主要武器：foil（花剑）、épée（重剑）、sabre（佩剑）。花剑以“刺（thrust）”得分，且通常有特定有效得分部位（target area）的规则。"]}
{"word":"foilsmen","summary":{"en":"Foilsmen are fencers who compete using the foil.","zh":"foilsmen 指使用花剑参赛的击剑选手（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) fencers who specialize in the foil (a light thrusting sword used in the sport of fencing).","zh":"（复数）花剑选手；专攻花剑（击剑项目中一种较轻、以刺为主的剑）的击剑运动员。"},"examples":[{"en":"The foilsmen practiced footwork and quick lunges before the match.","zh":"这些花剑选手在比赛前练习步法和快速刺击。"},{"en":"In the final bout, the foilsmen scored with precise touches to the torso.","zh":"在决赛回合中，花剑选手用精准的“得分触碰”击中躯干而得分。"}]}],"synonyms":["foil fencers","fencers (foil)"],"phonetic":"/ˈfɔɪlzmən/","extraExplanation":["“Foilsmen”来自“foilsman”（花剑选手）的复数形式。现代英语里也常用更中性的表达：foil fencers（花剑击剑运动员）。","击剑三种常见武器是 foil（花剑）、épée（重剑）和 sabre（佩剑）。花剑一般只算躯干有效部位（不同规则/赛事细节可能略有差异），强调速度、节奏与准确性。"]}
{"word":"foin","summary":{"en":"“Foin” is a rare/old word meaning “hay,” and it can also mean “to thrust or lunge,” especially in fencing-like contexts.","zh":"“foin”是少见的古体词，常指“干草”；也可作动词表示“突刺/冲刺”（常见于类似击剑的语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/poetic) hay; dried grass used as animal feed.","zh":"（古体/诗歌用语）干草；用来喂牲畜的干燥牧草。"},"examples":[{"en":"The barn was stacked high with foin for the winter.","zh":"谷仓里堆满了干草，够过冬用。"},{"en":"In old poems, you may see “foin” where we would say “hay.”","zh":"在一些旧诗里，你可能会看到用“foin”来表示我们现在说的“hay（干草）”。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Archaic) to thrust or lunge, especially as in fencing; to make a quick attacking move.","zh":"（古体）刺击、突刺（尤指击剑时）；做出快速的进攻动作。"},"examples":[{"en":"He foined at his opponent with a sudden forward thrust.","zh":"他突然向前突刺，攻击对手。"},{"en":"The actor foined dramatically, as if in a duel.","zh":"演员夸张地做出突刺动作，仿佛在决斗。"}]}],"synonyms":["hay","fodder","thrust","lunge"],"phonetic":"/fɔɪn/","extraExplanation":["“foin”在现代英语里非常少见，更常见的是“hay（干草）”。作为“干草”的意思来自法语 foin（干草）。","作为动词“foin（突刺）”也属于古体用法，现代更常用“thrust / lunge / stab”（视语境而定）。"]}
{"word":"foined","summary":{"en":"“Fo(i)ned” is an archaic form meaning “thrust/stab” (past tense of “foin”).","zh":"“foined”是古用形式，表示“刺/戳”（“foin”的过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) Past tense/past participle of “foin”: to thrust or stab (especially with a sword or similar weapon).","zh":"（古用）“foin”的过去式/过去分词：刺、戳、猛刺（尤指用剑等武器）。"},"examples":[{"en":"He foined at his opponent with a rapier.","zh":"他用细剑朝对手猛刺。"},{"en":"In the old tale, the knight foined once and the duel ended.","zh":"在古老故事里，骑士一刺，决斗就结束了。"}]}],"synonyms":["thrust","stab","lunge"],"phonetic":"/fɔɪnd/","extraExplanation":["“foined”在现代英语中非常少见，主要出现在较旧的文学作品、历史题材写作或仿古风格中。更常用的现代词是 thrust（刺/戳）、stab（刺伤）、lunge（猛冲刺）。","如果你是在聊天/网络语境里看到“foined”，也有可能是拼写错误（例如把 found / joined 之类的词打错）。若你愿意，可以把原句发出来，我可以帮你判断它在语境里最可能是什么意思。"]}
{"word":"foining","summary":{"en":"“Foin” is a rare word meaning a quick thrust or stabbing attack, especially in fencing. “Foining” is the -ing form.","zh":"“foin”是较少见的词，指（尤指击剑中）快速的刺击/猛刺；“foining”是其-ing形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to thrust or stab (especially in fencing); to make a quick attacking move","zh":"（尤指击剑中）刺、戳；做出快速的攻击动作"},"examples":[{"en":"In fencing practice, she kept foiling his attacks and then foining toward his chest.","zh":"在击剑训练中，她不断化解他的进攻，然后刺向他的胸口。"},{"en":"He foigned with the knife, but she stepped back in time.","zh":"他用刀猛刺过来，但她及时后退躲开了。"}]},{"partOfSpeech":"n.","definition":{"en":"a thrust or quick stabbing attack (especially in fencing)","zh":"（尤指击剑中的）刺击；猛刺的一下"},"examples":[{"en":"With one sudden foin, he scored the point.","zh":"他突然一刺，得了分。"},{"en":"The duel ended after a single well-timed foin.","zh":"决斗在一次恰到好处的刺击后结束。"}]}],"synonyms":["thrust","stab","lunge","jab"],"phonetic":"/fɔɪn/","extraExplanation":["“foining”通常是动词“foin”的现在分词/动名词形式（foin + -ing）。","“foin/foining”在现代英语里很少见，更常见于文学、历史叙述或击剑语境中；在莎士比亚等早期作品里也能见到，常带有“猛刺、虚刺/试探性进攻”的感觉。","日常表达里，人们更常用“thrust / stab / lunge（刺/戳/猛冲刺）”来替代。"]}
{"word":"foiningly","summary":{"en":"“Fawningly” means acting in an overly flattering, servile way to gain approval.","zh":"“fawningly” 指以过分奉承、卑躬屈膝的方式讨好他人以获得认可。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly flattering, servile, or attention-seeking way (often to gain favor).","zh":"以过分奉承、卑躬屈膝或讨好（通常为了讨人喜欢或获取好处）的方式。"},"examples":[{"en":"He spoke fawningly to the boss, laughing at every joke.","zh":"他对老板说话时一味奉承，老板每讲个笑话他都笑得很夸张。"},{"en":"The reporter asked fawningly if the celebrity ever makes mistakes.","zh":"记者用近乎谄媚的口吻问那位明星是否从不犯错。"}]}],"synonyms":["servilely","obsequiously","sycophantically","ingratiatingly"],"phonetic":"/ˈfɔːnɪŋli/","extraExplanation":["“foiningly” 不是常见英语单词，通常被认为是拼写错误；你可能想写的是 **fawningly**（最常见）或其他近形词（如 **knowingly** / **fondly**，但意思不同）。","**fawningly** 多带负面语气，暗示“讨好、拍马屁”，而不是单纯的“友好/亲切”。如果你想表达“温柔地/深情地”，更常用 **fondly**。"]}
{"word":"foins","summary":{"en":"Foins is an uncommon form of foin, meaning a quick thrust (especially in fencing) or the act of thrusting.","zh":"Foins 是不常见的形式，来自 foin，指（尤指击剑中的）快速刺击，或“刺击”这一动作本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(literary, fencing) to thrust or stab quickly, especially with a sword; to make a quick forward attack.","zh":"（文学用语/击剑）迅速刺击（尤指用剑）；做出快速向前的攻击。"},"examples":[{"en":"The fencer foins toward his opponent’s chest.","zh":"这名击剑手向对手的胸口快速刺去。"},{"en":"In old stories, the hero foins, then steps back before the counterattack.","zh":"在老故事里，英雄刺出一剑后迅速后撤，避开反击。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary, fencing) a quick thrust or stab.","zh":"（文学用语/击剑）快速的一刺；刺击动作。"},"examples":[{"en":"With a sudden foin, he ended the duel.","zh":"他突然一刺，结束了决斗。"},{"en":"The knight’s foin glanced off the armor.","zh":"骑士的一刺擦过盔甲，没有刺入。"}]}],"synonyms":["thrust","stab","lunge","jab"],"phonetic":"/fɔɪn/","extraExplanation":["“foins”通常是动词“foin”的第三人称单数（he/she foins），也可能是名词“foin”的复数（two foins），但这两个用法都比较少见、偏文学或击剑语境。","这个词在现代日常英语里不常用；更常见的表达是thrust、stab、lunge、jab。你可能会在古典小说、骑士/决斗描写或戏剧台词中见到。"]}
{"word":"foism","summary":{"en":"“Foism” isn’t a standard English word; it’s most likely a misspelling of “Fauvism,” the bold-color art movement.","zh":"“foism”不是标准英语词；多半是把“Fauvism（野兽派）”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A likely misspelling of “Fauvism,” an early 20th‑century art movement known for bold, vivid colors and simplified forms.","zh":"很可能是“Fauvism（野兽派）”的拼写错误：20世纪初的艺术流派，以强烈、鲜艳的色彩和简化的造型为特征。"},"examples":[{"en":"Many people type “foism” when they mean “Fauvism,” the style associated with Henri Matisse.","zh":"很多人把“Fauvism（野兽派）”误打成“foism”；野兽派常与亨利·马蒂斯联系在一起。"},{"en":"In class, we compared Impressionism with Fauvism’s more intense color choices.","zh":"课上我们比较了印象派与野兽派更强烈的用色。"}]}],"synonyms":["Fauvism","modern art movement","expressionistic color"],"phonetic":"ˈfoʊvɪzəm","extraExplanation":["“Fauvism（野兽派）”一词来自法语“les fauves（野兽们）”。1905年巴黎秋季沙龙上，一位评论家用“野兽”形容这些画家大胆、近乎“野性”的色彩与笔触，于是名称流传下来。","野兽派并不强调写实光影，而更重视色彩的情绪表达；常见代表人物包括 Henri Matisse（马蒂斯）与 André Derain（德兰）。"]}
{"word":"foison","summary":{"en":"Foison means “an abundant supply; plenty,” especially in the literary phrase “in foison.”","zh":"Foison 表示“充足；大量”，尤用于较文学的短语 “in foison”（丰富地）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Abundant supply; plenty (often used in the phrase “in foison”).","zh":"充足；大量（常见于短语“in foison”）。"},"examples":[{"en":"Wildflowers grew in foison after the spring rains.","zh":"春雨过后，野花大量生长。"},{"en":"The market had fruit in foison during harvest season.","zh":"收获季节市场上水果非常充足。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary/rare) Abundant; plentiful.","zh":"（文学/罕用）丰富的；充足的。"},"examples":[{"en":"In foison fields, the farmers worked from dawn to dusk.","zh":"在丰饶的田野里，农民从清晨忙到黄昏。"}]}],"synonyms":["abundance","plenty","profusion","copiousness"],"phonetic":"/ˈfɔɪ.zən/","extraExplanation":["“foison”是一个较古雅的词，多见于文学或诗意表达。现代英语中更常用“abundance / plenty / profusion”。","常见搭配“in foison”表示“丰富地、成群地、源源不断地”，语气带有一种书面、带点诗意的感觉。","词源来自古法语，和“收成/丰收”的概念有关，因此常用来描写自然生长、产出丰盛或事物大量出现。"]}
{"word":"foisonless","summary":{"en":"Foisonless means lacking abundance or richness; scant or barren.","zh":"foisonless 指“缺乏丰盛或富饶”，即贫乏、稀少、贫瘠。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking abundance; not rich, plentiful, or fruitful; scant.","zh":"缺乏丰盛；不富饶、不充足；贫乏的。"},"examples":[{"en":"After months of drought, the fields looked foisonless and tired.","zh":"经历了数月干旱后，田地看起来贫瘠而疲惫。"},{"en":"The report’s data section was foisonless, offering very few details.","zh":"报告的数据部分很贫乏，几乎没有提供细节。"},{"en":"In winter, the garden can feel foisonless compared with summer.","zh":"冬天的花园与夏天相比会显得不那么丰盛。"}]}],"synonyms":["scant","sparse","meager","barren","thin"],"phonetic":"/ˈfɔɪzənləs/","extraExplanation":["“Foisonless”非常罕见，多见于较旧或文学化的英语写作。它来自名词“foison”（意为“丰收、富饶、充沛”），加上形容词后缀“-less”（表示“缺少……”），字面意思就是“缺少丰盛/缺少富饶”。","“Foison”源自中古法语，带有“收获、丰产”的意味，因此“foisonless”也常用来形容土地、花园、作品内容等“缺乏产出或内容”。现代英语里更常用的替代词有：scant, barren, sparse, meager。"]}
{"word":"foisons","summary":{"en":"Foison means “abundance” (noun) or “to abound” (verb). “Foisons” is usually the plural or an inflected form of foison.","zh":"foison 表示“丰富、大量”（名词）或“盛产、充沛存在”（动词）；foisons 通常是 foison 的复数或变形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large amount; plenty; abundance","zh":"大量；充足；丰富"},"examples":[{"en":"The market had a foison of fresh vegetables in summer.","zh":"夏天市场里有大量新鲜蔬菜。"},{"en":"Her notebook is a foison of ideas for stories.","zh":"她的笔记本里满是写故事的点子。"}]},{"partOfSpeech":"v.","definition":{"en":"to have in great quantity; to abound","zh":"大量存在；盛产；非常丰富"},"examples":[{"en":"Wildflowers foison in the fields after spring rains.","zh":"春雨过后，田野里野花大量生长。"},{"en":"In this region, apples foison in early autumn.","zh":"在这个地区，苹果在初秋时节盛产。"}]}],"synonyms":["abundance","plenty","profusion","a wealth of","to abound"],"phonetic":"/ˈfɔɪzən/","extraExplanation":["“foisons”通常不是词典里的基本形式：它多半是“foison”的复数名词（foisons）或动词第三人称单数/复数形式（较少见，用于表示“充沛/盛产”）。查词和写作时一般用原形“foison”。","“foison”是较文学化、较少见的词，常见于描写自然、收成或“充满”某种事物的语境；日常英语更常用“abundance / plenty / a lot of”。","词源与法语有关（法语中有“foison”表示“丰盛、丰收”），因此它在英语里也带一点“书面、诗意”的色彩。"]}
{"word":"foist","summary":{"en":"Foist means to force something unwanted on someone, often by trickery, or to push blame/responsibility onto another person.","zh":"Foist 指（常带欺骗地）把不受欢迎的东西强加给别人，或把责任/过错硬推给别人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to force something unwanted, inferior, or dishonest on someone (often by tricking them)","zh":"（常指用欺骗手段）把不想要的、劣质的或不真实的东西强加给某人"},"examples":[{"en":"The seller tried to foist a broken phone on me.","zh":"卖家想把一部坏掉的手机硬塞给我。"},{"en":"Don’t let anyone foist their mistakes on you.","zh":"别让别人把他们的错误推到你头上。"},{"en":"The report was foisted on the public without proper review.","zh":"这份报告在未经充分审查的情况下被强行推出给公众。"}]},{"partOfSpeech":"vt.","definition":{"en":"to falsely claim that someone else is responsible for something","zh":"把（责任/罪责等）冒充、栽赃到别人身上；把…硬推给别人"},"examples":[{"en":"He foisted the blame on his coworker.","zh":"他把责任推给了同事。"},{"en":"They tried to foist the scandal onto a junior staff member.","zh":"他们试图把丑闻栽到一名初级员工身上。"}]}],"synonyms":["impose","pawn off","dump","stick (with)","shift (the blame)"],"phonetic":"/fɔɪst/","extraExplanation":["“foist”常与介词搭配：foist something on/upon someone（把某物强加给某人），foist something off on someone（把不好的东西哄骗着转手给别人）。","语感上，“foist”比“give”或“offer”更负面，通常暗含“对方不想要/不该承担”以及“带有欺骗或不公平”的意味。"]}
{"word":"foisted","summary":{"en":"“Foisted” means something unwanted was pushed onto someone, often unfairly or deceptively.","zh":"“Foisted”表示把别人不想要的东西（或责任等）不公平地强加给某人，常带欺骗意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “foist”: to force something unwanted on someone, often by tricking them or taking advantage of them","zh":"“foist”的过去式/过去分词：把（不想要的东西）强加给某人，常带有欺骗或趁人不备的意味"},"examples":[{"en":"They foisted extra fees on customers without clearly explaining them.","zh":"他们在没有清楚说明的情况下，把额外费用强加给顾客。"},{"en":"He felt the broken laptop had been foisted on him in the sale.","zh":"他觉得卖家在交易中把一台坏笔记本“坑”给了他。"},{"en":"The team was foisted with tasks that weren’t part of their job.","zh":"团队被硬塞了不属于他们职责的任务。"}]}],"synonyms":["imposed","saddled (with)","dumped on","palmed off","shoved onto"],"phonetic":"/fɔɪstɪd/","extraExplanation":["“foist”常见搭配是 foist something on/upon somebody，语气偏负面，强调“强塞/硬推/骗塞”。和普通的“give/offer”不同，它暗含对方并不想要或并不知情。","你写的“foisted”多见于被动语态：be foisted on/upon someone（被强加给某人）。","在文学或新闻语境里也可用于抽象事物：foist blame/responsibility/ideas on someone（把责任/想法硬推给某人）。"]}
{"word":"foister","summary":{"en":"Foister means a person who deceives others by forcing something unwanted or fake on them.","zh":"foister 指通过欺骗手段把不想要的或假的东西强加给别人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who tricks someone into accepting something unwanted, false, or inferior (someone who “foists” things on others)","zh":"把不想要的、假的或较差的东西硬塞给别人的人；行骗者（指“foist”的施事者）"},"examples":[{"en":"The seller was a foister who pushed counterfeit goods onto tourists.","zh":"那个卖家是个行骗者，专门把假货硬塞给游客。"},{"en":"Don’t let a foister talk you into paying for services you didn’t ask for.","zh":"别让行骗者把你说服去付你根本没要求的服务费。"}]}],"synonyms":["swindler","con artist","cheat","scammer"],"phonetic":"/ˈfɔɪstər/","extraExplanation":["“foister”比较少见，更常用的是动词“foist”（例如：foist something on someone 把某物强加给某人）或名词短语“someone who foists…”。如果你是在写作或正式表达中，通常用“foist”更自然。"]}
{"word":"foistiness","summary":{"en":"Foistiness means a musty, stale, slightly unpleasant old smell.","zh":"Foistiness 指霉味、陈腐味等略难闻的旧味道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being musty, stale, or having a slightly unpleasant old smell (often like a closed-up room or old clothes).","zh":"（气味的）霉味、陈腐味；带点难闻的旧味道（常见于久未通风的房间或旧衣物）。"},"examples":[{"en":"The foistiness in the attic disappeared after we opened the windows.","zh":"阁楼里的霉味在我们打开窗户后就散了。"},{"en":"I could smell the foistiness of damp books in the basement.","zh":"我闻到地下室里潮湿书本的霉味。"}]}],"synonyms":["mustiness","staleness","mugginess","stagnancy"],"phonetic":"/ˈfɔɪsti.nəs/","extraExplanation":["“foistiness”来自形容词“foisty”，在英式英语里更常见，语气通常偏口语/略带幽默，用来形容“闷久了的霉味、陈味”。","注意不要和动词“foist”（把……强加给别人）混淆：两者词形相近，但意义不同。"]}
{"word":"foisting","summary":{"en":"Foisting means forcing something unwanted on someone or deceptively passing something off as genuine.","zh":"Foisting 指把不想要的东西强加给别人，或用欺骗手段把某物冒充真货/真相塞给别人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"forcing something unwanted on someone; pressuring someone to accept it.","zh":"把（不受欢迎的东西）强加给某人；逼人接受。"},"examples":[{"en":"They were foisting extra work on the new employee.","zh":"他们把额外的工作强加给新员工。"},{"en":"Don’t let anyone foist their responsibilities on you.","zh":"别让任何人把他们的责任推给你。"}]},{"partOfSpeech":"v.","definition":{"en":"tricking someone by passing something off as real, valuable, or correct.","zh":"以欺骗手段把某物冒充成真的/有价值的/正确的东西塞给别人。"},"examples":[{"en":"Someone tried foisting a fake ticket on me at the entrance.","zh":"有人在入口处想把假票冒充真票塞给我。"},{"en":"The seller was accused of foisting counterfeit goods on customers.","zh":"这名卖家被指控把假货冒充正品卖给顾客。"}]}],"synonyms":["impose","push","dump (on)","pawn off","pass off","burden"],"phonetic":"/fɔɪstɪŋ/","extraExplanation":["“foist”常与介词 on/upon 连用：foist something on/upon someone（把某物强加给某人）。语气通常带负面评价，暗示对方不想要或被蒙骗。","词源上与“偷偷塞、暗中放入”的含义有关，因此常带“强塞/硬推/蒙混过关”的感觉。"]}
{"word":"foists","summary":{"en":"“Foists” means forces something unwanted on someone, or passes off something fake/inferior as acceptable.","zh":"“foists” 指把不受欢迎的东西强加给别人，或把假/劣质的东西冒充成可接受的。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to force someone to accept something unwanted, unfair, or not asked for (often used with “on/upon”)","zh":"把（不受欢迎的、不公平的或没人要的东西）强加给（某人）（常与 on/upon 连用）"},"examples":[{"en":"They foisted extra fees on customers without clearly explaining them.","zh":"他们在没有清楚说明的情况下，把额外费用强加给顾客。"},{"en":"I don’t want you to foist your unfinished work on me.","zh":"我不想让你把没做完的工作硬塞给我。"}]},{"partOfSpeech":"vt.","definition":{"en":"to pass off a fake, inferior, or unwanted thing as if it were real or acceptable (often used with “off”)","zh":"把假货/劣质品/不合意之物冒充成真的或合格的（常与 off 连用）"},"examples":[{"en":"The seller tried to foist off a counterfeit watch as genuine.","zh":"卖家试图把一块假表冒充成真货卖出去。"},{"en":"He foisted off the blame on his teammate.","zh":"他把责任推给了队友。（常见搭配：foist the blame on）"}]}],"synonyms":["impose","force","push","palm off","dump (on)"],"phonetic":"/fɔɪst/","extraExplanation":["“foists” 是动词 “foist” 的第三人称单数现在时（he/she/it foists）。","这个词通常带明显的负面含义：强调“别人不想要/不该承担，却被迫接受”。常见搭配：foist something on/upon someone；foist something off (on someone)；foist the blame/responsibility/cost on someone。"]}
{"word":"foisty","summary":{"en":"Foisty means (1) smelling stale and musty, or (2) old-fashioned and stuffy in attitude.","zh":"foisty 常指（1）有陈腐霉味、闷臭味；也可指（2）观念或风格守旧古板。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an unpleasant, stale, musty smell, often because a room has been closed up and lacks fresh air.","zh":"有霉味的；有陈腐、闷臭味的（常因房间久闭不通风）。"},"examples":[{"en":"The basement smelled foisty after the long, rainy week.","zh":"下了一周雨后，地下室闻起来有股霉味。"},{"en":"Open a window—the bedroom is a bit foisty.","zh":"开扇窗吧——卧室有点闷霉味。"}]},{"partOfSpeech":"adj.","definition":{"en":"Old-fashioned, stuffy, or out of date in style or attitude.","zh":"（风格或观念）守旧的、古板的、过时的。"},"examples":[{"en":"Some people think the club’s rules are foisty and need updating.","zh":"有些人觉得这个俱乐部的规矩很守旧，需要更新。"},{"en":"He has a foisty idea of what a “proper job” should be.","zh":"他对“体面工作”该是什么样有种很守旧的看法。"}]}],"synonyms":["musty","stale","stuffy","moldy","old-fashioned","prim","hidebound"],"phonetic":"/ˈfɔɪsti/","extraExplanation":["“foisty”在英式英语里更常见；美式英语里表示“发霉的、闷臭的”时更常用 musty / stale / stuffy。表示“守旧、古板”时常用 stuffy / old-fashioned。","拼写提醒：不是 “foisty/foystie” 两种都见得到，但更标准常见的拼写是 foisty。","语感提示：这个词带一点口语色彩，常用来轻微抱怨环境气味或吐槽某种“老派作风”。"]}
{"word":"foiter","summary":{"en":"“Foiter” is an old or dialect word meaning “to loiter or dawdle,” and it’s rare in modern English.","zh":"“foiter”是一个古语/方言词，意思是“闲逛或磨蹭”，在现代英语中很少见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic or dialect) To wander about aimlessly; to loiter; to dawdle.","zh":"（古语或方言）闲逛；游荡；磨蹭。"},"examples":[{"en":"He would foiter around the market instead of going straight home.","zh":"他会在集市里闲逛，而不是直接回家。"},{"en":"Stop foitering and finish your homework.","zh":"别再磨蹭了，把作业做完。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A person who loafs or loiters.","zh":"（较少见）游手好闲的人；闲逛者。"},"examples":[{"en":"The shopkeeper chased away the foiters at the door.","zh":"店主把门口闲逛的人赶走了。"}]}],"synonyms":["loiter","dawdle","linger","wander","loaf"],"phonetic":"/ˈfɔɪtər/","extraExplanation":["“foiter”在现代英语里非常少见，常被视为古语/方言用法；在当代更常用的是“loiter”（闲逛）或“dawdle”（磨蹭）。","学习时要注意拼写：它有时会被误写/误读为“foist”（偷塞；硬推给）或“fritter”（浪费时间/金钱）。如果你是在现代文章里看到“foiter”，也可能是作者刻意使用古风词，或是拼写错误。"]}

