{"word":"fol","summary":{"en":"“fol” is usually an abbreviation meaning either “following” (next items) or “folio” (a page/leaf in a manuscript).","zh":"“fol”通常是缩写：可指“following（以下/接下来的）”，也可指“folio（书稿的一张/页）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) short for “following”; used in notes or references to mean the next item(s) after the one mentioned.","zh":"（缩写）“following”的缩写；常用于笔记或引用中，表示“以下的/接下来的（内容）”。"},"examples":[{"en":"See the fol. pages for more details.","zh":"更多细节请看以下几页。"},{"en":"Bring your passport and the fol. documents: a photo and a bank statement.","zh":"请带上护照以及以下文件：一张照片和一份银行对账单。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) short for “folio”; used in publishing or academic references to mean a leaf/page of a book or manuscript.","zh":"（缩写）“folio”的缩写；用于出版或学术引用中，指书或手稿的一张（页/纸叶）。"},"examples":[{"en":"The note appears on fol. 12 of the manuscript.","zh":"这条注释出现在手稿的第12张（页）。"},{"en":"The illustration is on fol. 3r.","zh":"插图在第3叶正面（3r）。"}]}],"synonyms":["following","next","subsequent","folio","page","leaf"],"phonetic":"/fɑl/","extraExplanation":["“fol.”在英文里通常出现在正式写作（脚注、书目、学术引用）中；日常聊天里很少用。","学术手稿引用里常见“fol. 3r/3v”：r = recto（正面），v = verso（背面）。如果你是在课堂讲义或论文里看到“fol.”，多数情况下是“following”的意思。"]}
{"word":"folacin","summary":{"en":"Folacin means folate (vitamin B9), a nutrient found in foods and sometimes taken as a supplement.","zh":"Folacin 指叶酸（维生素B9），存在于食物中，也可作为补充剂摄入。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a B vitamin (vitamin B9), especially in its natural form found in foods; also called folate","zh":"叶酸；维生素B9（多指食物中天然存在的形式），也叫folate"},"examples":[{"en":"Leafy greens are a good source of folacin.","zh":"绿叶蔬菜是叶酸（folacin）的良好来源。"},{"en":"The doctor recommended enough folacin during pregnancy.","zh":"医生建议孕期摄入足够的叶酸（folacin）。"}]},{"partOfSpeech":"n.","definition":{"en":"a folate-based supplement or amount of vitamin B9 in the body (less common use)","zh":"叶酸补充剂；（较少用法）体内叶酸/维生素B9的含量"},"examples":[{"en":"Blood tests can check folacin levels.","zh":"验血可以检查叶酸（folacin）水平。"},{"en":"Some people take folacin tablets if their diet is lacking.","zh":"有些人如果饮食不足，会服用叶酸（folacin）片。"}]}],"synonyms":["folate","vitamin B9","folic acid (related)"],"phonetic":"/foʊˈleɪsɪn/","extraExplanation":["“Folacin”在现代英语里不如“folate”常用，更常见于较早的营养学/医学材料。日常表达通常说“folate（叶酸）”。","叶酸与孕期神经管发育相关，因此在公共健康宣传中经常出现（如“folic acid/folate supplementation”）。注意“folic acid（叶酸片中的合成形式）”与“folate/folacin（食物中的天然形式）”在叫法上有区别，但日常交流中常被统称为“叶酸”。"]}
{"word":"folacins","summary":{"en":"“Folacin” means folate (vitamin B9), often referring to folic acid or a folate supplement; “folacins” is its plural form.","zh":"“Folacin”指叶酸/维生素B9（常泛指叶酸或补充剂中的叶酸），“folacins”为其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of folate (vitamin B9), especially the vitamin found in foods or used as a nutritional supplement; folic acid","zh":"叶酸；维生素B9（常指食物中的叶酸或作为营养补充剂的叶酸；亦可泛指叶酸/叶酸盐）"},"examples":[{"en":"Leafy greens are rich in folacin, such as spinach and romaine lettuce.","zh":"绿叶蔬菜富含叶酸，例如菠菜和长叶莴苣。"},{"en":"The doctor recommended a folacin supplement before pregnancy.","zh":"医生建议在备孕前补充叶酸。"},{"en":"The label lists folacin under B vitamins.","zh":"标签把叶酸列在维生素B族之下。"}]}],"synonyms":["folate","folic acid","vitamin B9"],"phonetic":"ˈfoʊləsɪn","extraExplanation":["“Folacin”在现代英语里不如“folate/folic acid”常见，更偏学术或较旧的营养学用语；你写的“folacins”通常是复数，表示“多种来源/多种形式的叶酸”或“不同产品里的叶酸含量”。","区分：folate（天然存在于食物中的形式） vs. folic acid（常见于强化食品与补充剂的合成形式）。日常交流多用这两个词。","文化与使用场景：在公共健康宣传中，叶酸常与孕前/孕早期营养相关，因为它与胎儿神经管发育有关；但是否需要补充、补充剂量应以医生建议为准。"]}
{"word":"folate","summary":{"en":"Folate is vitamin B9, important for making DNA and red blood cells, and commonly found in leafy greens and other foods.","zh":"Folate 指叶酸（维生素B9），对合成DNA和生成红细胞很重要，常见于绿叶蔬菜等食物中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a B vitamin (vitamin B9) that helps the body make DNA and red blood cells; it is naturally found in foods such as leafy green vegetables, beans, and citrus fruits","zh":"叶酸（维生素B9）：一种B族维生素，帮助人体合成DNA并生成红细胞；天然存在于绿叶蔬菜、豆类、柑橘类水果等食物中"},"examples":[{"en":"Spinach and lentils are good sources of folate.","zh":"菠菜和小扁豆是叶酸的良好来源。"},{"en":"Doctors often recommend enough folate before and during early pregnancy.","zh":"医生常建议在怀孕前以及孕早期摄入足够的叶酸。"}]}],"synonyms":["vitamin B9","folacin"],"phonetic":"/ˈfoʊleɪt/","extraExplanation":["“folate”通常指食物中“天然存在的叶酸”。而“folic acid（叶酸片/合成叶酸）”多指补充剂或强化食品中的合成形式。日常英语里两者有时会被混用，但在营养学语境中区分更常见。","常见搭配：folate intake（叶酸摄入量）、folate deficiency（叶酸缺乏）、folate-rich foods（富含叶酸的食物）。","词源小提示：folate 来自拉丁语 folium（“叶子”），因为它最早与绿叶蔬菜中的营养成分相关。"]}
{"word":"folate-related","summary":{"en":"“Folate-related” means connected with folate (vitamin B9) and its effects, especially in medical or nutrition contexts.","zh":"“Folate-related”指与叶酸（维生素B9）及其影响有关，常用于医学或营养学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with folate (vitamin B9), its functions in the body, or conditions caused by too little folate.","zh":"与叶酸（维生素B9）及其在体内的作用有关的；或与叶酸不足引起的情况有关的。"},"examples":[{"en":"The doctor ordered folate-related blood tests to check for anemia.","zh":"医生安排了与叶酸相关的血液检查，以确认是否贫血。"},{"en":"Folate-related deficiencies during pregnancy can increase health risks for the baby.","zh":"怀孕期间与叶酸相关的缺乏可能会增加宝宝的健康风险。"},{"en":"They published a study on folate-related changes in DNA synthesis.","zh":"他们发表了一项研究，讨论叶酸相关的DNA合成变化。"}]}],"synonyms":["folate-associated","folate-linked","vitamin B9–related"],"phonetic":"/ˈfoʊˌleɪt rɪˈleɪtɪd/","extraExplanation":["“folate-related”常见于医学、营养学与公共卫生语境。folate（叶酸/叶酸盐）是维生素B9的天然形式之一；补充剂里常见的是 folic acid（合成叶酸）。两者在日常表达里有时会被混用，但在科研或临床文本中会区分。","叶酸与红细胞生成、DNA合成以及胎儿神经管发育密切相关，因此你会看到如 folate-related anemia（叶酸相关性贫血）、folate-related neural tube defects（与叶酸相关的神经管缺陷风险）等搭配。","写作上它是复合形容词，通常加连字符：folate-related complications / folate-related biomarkers。"]}
{"word":"folates","summary":{"en":"Folates are forms of vitamin B9 found in foods, important for DNA and red blood cells.","zh":"Folates 指食物中的维生素B9（叶酸类），对DNA合成和红血球生成很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of B vitamins (vitamin B9) that the body needs to make DNA and red blood cells; found naturally in many foods (plural of “folate”).","zh":"叶酸盐；叶酸类（维生素B9的一类），人体用于合成DNA和红细胞；多天然存在于食物中（“folate”的复数）。"},"examples":[{"en":"Leafy greens like spinach are good sources of folates.","zh":"像菠菜这样的绿叶蔬菜是叶酸类的重要来源。"},{"en":"Low folates can cause tiredness and anemia.","zh":"叶酸不足可能导致疲劳和贫血。"},{"en":"During pregnancy, doctors often check folates and iron levels.","zh":"怀孕期间，医生常会检查叶酸与铁的水平。"}]}],"synonyms":["vitamin B9","folic acid (related)","B9"],"phonetic":"/ˈfoʊleɪts/","extraExplanation":["“Folate(s)”通常指食物中“天然存在”的维生素B9形式；“folic acid（叶酸）”常指补充剂或强化食品中的“合成形式”。日常健康语境里，这两者常被一起提到，但在营养学中会区分来源与形式。","文化与健康语境中，英语里常会说“take folic acid”来强调补充剂（尤其备孕/孕期）；而说“get folates from food”更强调从饮食摄取。常见食物来源包括绿叶蔬菜、豆类、柑橘类水果等。"]}
{"word":"folboat","summary":{"en":"A folboat is a folding kayak that can be disassembled and carried easily.","zh":"folboat 指可拆解、便于携带的折叠皮划艇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a folding kayak (a lightweight boat with a collapsible frame and a skin cover), designed to be taken apart and carried for travel.","zh":"折叠皮划艇（可拆解的轻量小艇，通常由可折叠骨架和外皮组成，便于携带与旅行使用）。"},"examples":[{"en":"They packed the folboat into two bags and took it on the train.","zh":"他们把折叠皮划艇装进两个包里，带上火车。"},{"en":"A folboat is useful for trips where you need to hike before you can paddle.","zh":"如果行程需要先徒步再划船，折叠皮划艇就很实用。"}]}],"synonyms":["folding kayak","collapsible kayak","Faltboot"],"phonetic":"/ˈfoʊl.boʊt/","extraExplanation":["“folboat”在英语里常指“折叠皮划艇”，既可以是通用名词，也常被当作某些早期折叠艇品牌（如 Folboat）带来的泛称用法。","这种艇的概念与德语“Faltboot”（意为“可折叠的船”）有关：骨架可拆装，外层多为防水布/合成材料，适合旅行、探险或需要携行的水上活动。"]}
{"word":"folc","summary":{"en":"“folc” is a rare/old spelling of “folk” (people; traditional culture). In modern English, use “folk.”","zh":"“folc”是“folk”的罕见/旧式拼写，意为“人们；民间传统文化”。现代英语中建议用“folk”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nonstandard/rare) A spelling variant of “folk,” meaning ordinary people as a group; also used for people of a particular place or culture.","zh":"（非标准/罕见）“folk”的拼写变体，指“人们/大众”；也可指某个地方或文化中的人。"},"examples":[{"en":"In some old texts, you may see “folc” used where modern English uses “folk.”","zh":"在一些较旧的文本中，你可能会看到用“folc”来表示现代英语中的“folk”。"},{"en":"The festival celebrates the music and stories of local folk.","zh":"这个节日庆祝当地民众的音乐和故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to traditional culture, especially traditional music, stories, or art.","zh":"与传统文化相关的，尤指民间音乐、故事或艺术。"},"examples":[{"en":"She plays folk songs on the guitar.","zh":"她用吉他弹唱民谣。"},{"en":"We visited a folk museum to learn about village life.","zh":"我们参观了民俗博物馆，了解乡村生活。"}]}],"synonyms":["people","common people","the public","traditional"],"phonetic":"/foʊk/","extraExplanation":["“folc”在现代英语中几乎不使用，更常见的是“folk”。你输入“folc”很可能是拼写错误，或来自古英语/苏格兰英语等较旧的拼写传统。写作与考试中建议使用“folk”。","常见搭配：folk music（民谣/民间音乐）、folk tale（民间故事）、folk art（民间艺术）。口语里也常说folks（大家/各位），语气更亲切。"]}
{"word":"folcgemot","summary":{"en":"A historical Anglo-Saxon public meeting of local people to discuss and decide community matters.","zh":"指盎格鲁-撒克逊时期民众参与的地方公共集会，用于讨论并决定社区事务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A public assembly or meeting of the people in an Anglo-Saxon community, where local matters were discussed and decisions were made; a “folk-moot.”","zh":"（历史）英格兰盎格鲁-撒克逊时期的民众大会/公共集会，用于讨论并决定地方事务；“民众议会（folk-moot）”。"},"examples":[{"en":"In some Anglo-Saxon settlements, disputes could be brought before the folcgemot.","zh":"在一些盎格鲁-撒克逊定居点，纠纷可以提交到 folcgemot 处理。"},{"en":"The folcgemot gathered freemen to hear announcements and settle local issues.","zh":"folcgemot 会召集自由民听取公告并处理地方事务。"}]}],"synonyms":["folk-moot","folkmoot","moot","assembly"],"phonetic":"/ˈfoʊlkɡəˌmoʊt/","extraExplanation":["“folcgemot”来自古英语：folc（人民、民众）+ gemōt（集会、会议）。现代英语中更常见的对应形式是“folkmoot/folk-moot”。","它属于早期英格兰地方治理与司法传统的一部分，可与后来的“shire moot（郡议会）”“hundred moot（百户区议会）”等地方集会并列理解。","该词多见于历史研究、古英语文献讨论或仿古/奇幻文学语境，日常英语中几乎不用。"]}
{"word":"fold","summary":{"en":"Fold means to bend something over itself (or bend naturally), to cross your arms, or a bent part/crease; as a noun it can also mean a group of sheep/goats.","zh":"fold常指把东西折叠（或自然折起）、抱臂；名词可指折痕/褶，也可指（尤指羊/山羊的）畜群。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bend something over on itself so that one part covers another","zh":"（把某物）折叠；对折（使一部分覆盖另一部分）"},"examples":[{"en":"Fold the paper in half.","zh":"把纸对折。"},{"en":"She folded the blanket neatly on the bed.","zh":"她把毯子整齐地叠在床上。"}]},{"partOfSpeech":"vi.","definition":{"en":"to bend, close, or lie over itself (often describing something that naturally bends)","zh":"折起；弯曲；合拢（常指自然弯曲的东西）"},"examples":[{"en":"The chair folds flat for easy storage.","zh":"这把椅子可以折平，方便收纳。"},{"en":"The leaves folded in the cold wind.","zh":"树叶在冷风中卷起（折起）。"}]},{"partOfSpeech":"v.","definition":{"en":"to bring your arms or hands together across your chest (often showing you are waiting, thinking, or displeased)","zh":"交叉双臂；抱臂（常表示等待、思考或不满）"},"examples":[{"en":"He folded his arms and said nothing.","zh":"他抱起双臂，一言不发。"}]},{"partOfSpeech":"n.","definition":{"en":"a line or place where something has been bent; a part that folds","zh":"折痕；褶；折叠处"},"examples":[{"en":"There was a fold in the corner of the map.","zh":"地图角上有一道折痕。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of animals (especially sheep or goats) kept together","zh":"（尤指羊/山羊的）畜群；羊群"},"examples":[{"en":"The shepherd led the fold back to the barn.","zh":"牧羊人把羊群赶回了谷仓。"}]}],"synonyms":["bend","crease","double","collapse","cross (one’s arms)"],"phonetic":"/foʊld/","extraExplanation":["“fold”作名词表示“羊圈/羊群”时，常见于较文学或宗教语境，例如“return to the fold”（回到团体/回归信仰或组织）。在日常生活里更常用的是“fold clothes / fold paper”（叠衣服/折纸）。","常见搭配：fold up（折起来/收起来），fold down（折下/放倒，如折叠座椅），fold over（把……折过去）。在牌类游戏里，fold也可指“弃牌”（较口语：I’ll fold. 我弃牌）。"]}
{"word":"fold-down","summary":{"en":"“Fold-down” describes something that can be folded down to save space, or the foldable part itself (like a seat or bed).","zh":"“fold-down”指可向下折叠以节省空间的东西，也可指这种可折叠部件本身（如座椅或折叠床的一部分）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of furniture or a feature) able to be folded down into a flat or lower position to save space.","zh":"（指家具或装置）可向下折叠到较平或较低的位置，用来节省空间。"},"examples":[{"en":"The van has fold-down seats, so you can carry more luggage.","zh":"这辆面包车有可向下折叠的座椅，所以能装更多行李。"},{"en":"A fold-down table is handy in a small apartment.","zh":"在小公寓里，可向下折叠的桌子很实用。"}]},{"partOfSpeech":"n.","definition":{"en":"a part (such as a seat, bed, table, or armrest) that folds down.","zh":"可向下折叠的部件（如座椅、床、桌板或扶手等）。"},"examples":[{"en":"Pull the fold-down and it becomes a bed.","zh":"把折叠部件放下来，就变成一张床。"},{"en":"The fold-down in the movie theater is an extra armrest.","zh":"电影院里那个可折下的部件是额外的扶手。"}]}],"synonyms":["folding","foldaway","collapsible","drop-down"],"phonetic":"/ˈfoʊld ˌdaʊn/","extraExplanation":["“fold-down”常用于说明书、产品介绍和日常口语中，描述“可折叠收纳”的结构。也常写作不加连字符的“fold down”（作动词短语，如“Fold down the seats.” 把座椅放倒）。作为形容词修饰名词时更常见连字符：fold-down bed/table/seats。"]}
{"word":"fold-winged","summary":{"en":"Fold-winged describes an animal (often an insect like a wasp) whose wings are folded when it is resting.","zh":"fold-winged 指（常见于黄蜂等昆虫）在休息时把翅膀折起收拢的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having wings that are folded (usually along the body) when at rest.","zh":"（通常在休息时）把翅膀折起、贴在身体旁的。"},"examples":[{"en":"Wasps are fold-winged insects, so their wings lie flat along their backs when they land.","zh":"黄蜂是折翅的昆虫，所以它们停下来时翅膀会平贴在背上。"},{"en":"The fold-winged bird tucked its wings tightly before hopping onto the branch.","zh":"那只折翅的鸟把翅膀收紧，然后跳上树枝。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Entomology) Belonging to a group of insects—especially many wasps and bees—whose wings fold lengthwise when not flying.","zh":"（昆虫学）指某些昆虫类群（尤指许多黄蜂与蜜蜂）：不飞行时翅膀会沿长度方向折叠。"},"examples":[{"en":"Many fold-winged wasps can fold their hind wings lengthwise, making them look narrow at rest.","zh":"许多折翅黄蜂能把后翅沿长度方向折起，因此休息时看起来翅膀更窄。"},{"en":"The guidebook described the species as fold-winged, which helped us tell it from a fly.","zh":"指南把这种昆虫描述为“折翅的”，这帮助我们把它和苍蝇区分开。"}]}],"synonyms":["folded-wing","wings-folded","folded-winged"],"phonetic":"/ˈfoʊld ˌwɪŋd/","extraExplanation":["“fold-winged”常见于自然观察、昆虫学与科普写作中，尤其用来描述黄蜂、蜜蜂等膜翅目昆虫的一个辨识特征：停歇时翅膀会贴背并可沿长度方向折叠。","在较正式的分类语境里，有时会对应到“折翅亚目/折翅类（Apocrita）”这类说法，但日常英语里更多是字面意义的形容词，用来帮助观察者描述外形。"]}
{"word":"foldability","summary":{"en":"Foldability means how easy something is to fold, especially for storage or carrying.","zh":"foldability 指物品“有多可折叠/多容易折叠”，常用于强调便于收纳或携带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be folded easily, often for storage or portability.","zh":"可折叠性；容易折叠并便于收纳或携带的特性。"},"examples":[{"en":"I chose this stroller for its foldability—it fits in a small trunk.","zh":"我选这款婴儿车是因为它很可折叠——能放进小后备箱。"},{"en":"The laptop’s foldability makes it convenient for travel.","zh":"这台笔记本的可折叠性让出行更方便。"}]}],"synonyms":["folding capability","portability (related)","compactness (related)"],"phonetic":"/foʊl.dəˈbɪl.ə.ti/","extraExplanation":["“foldability”常见于产品说明、评测与工程/设计语境，尤其谈到“可折叠设计”（foldable design）时，例如折叠椅、折叠自行车、折叠手机等。","构词上是 fold（折叠）+ -able（能够……的）→ foldable（可折叠的）+ -ity（……的性质）→ foldability（可折叠性）。日常口语里也常用“how easily it folds”（它折起来有多容易）来表达同样意思。"]}
{"word":"foldable","summary":{"en":"“Foldable” means able to be folded for easier storage or carrying; it can also refer to a folding product.","zh":"“foldable”表示“可折叠的、便于收纳携带的”；也可指“可折叠产品/设备”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be folded (so it can be stored, carried, or made smaller).","zh":"可折叠的；可折起来便于收纳或携带的。"},"examples":[{"en":"She bought a foldable bike for commuting.","zh":"她买了一辆可折叠自行车用来通勤。"},{"en":"This table is foldable, so it fits in a small apartment.","zh":"这张桌子可折叠，所以很适合小户型。"}]},{"partOfSpeech":"n.","definition":{"en":"A product (such as a chair, phone, or stroller) designed to fold.","zh":"（产品名词用法）可折叠物品；指设计成能折叠的产品（如椅子、手机、婴儿车等）。"},"examples":[{"en":"The store sells foldables like portable chairs and carts.","zh":"这家店卖一些可折叠用品，比如便携椅和手推车。"},{"en":"Foldables are popular with travelers because they save space.","zh":"可折叠用品很受旅行者欢迎，因为省空间。"}]}],"synonyms":["folding","collapsible","portable","compact"],"phonetic":"/ˈfoʊldəbəl/","extraExplanation":["“foldable”由 fold（折叠）+ -able（能够……的）组成，常用于商品描述与日常口语，强调“能折起来、便于收纳/携带”。","近年科技语境中，foldable 也常指“可折叠屏手机/设备”（foldable phone/device），有时直接用作名词：a foldable。"]}
{"word":"foldage","summary":{"en":"Foldage means the act/process of folding, a folded arrangement, or (in geology) the degree/pattern of rock folding.","zh":"Foldage 指折叠的过程、折叠后的褶皱/折痕排列，或（地质）岩层褶皱的形态与发育程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of folding something; folding as a method or technique","zh":"折叠的行为或过程；（作为方法/技巧的）折叠"},"examples":[{"en":"The foldage of the paper has to be precise for the model to work.","zh":"纸张的折叠必须很精确，模型才能成功。"},{"en":"Traditional bookbinding includes careful foldage of the printed sheets.","zh":"传统装订工艺包括对印张进行细致的折叠。"}]},{"partOfSpeech":"n.","definition":{"en":"a folded state or arrangement; a set of folds","zh":"折叠后的状态或排列方式；一组褶皱/折痕"},"examples":[{"en":"You can see the foldage along the edge where the fabric was creased.","zh":"你可以在边缘看到布料被压出的褶皱（折痕）。"},{"en":"The scarf’s foldage gave it a layered look.","zh":"围巾的折叠层次让它看起来更有层叠感。"}]},{"partOfSpeech":"n.","definition":{"en":"(geology) the pattern or extent of folding in rock layers in an area","zh":"（地质）某地区岩层褶皱的形态或褶皱发育程度"},"examples":[{"en":"The map shows intense foldage near the mountain belt.","zh":"地图显示山脉带附近的褶皱非常强烈。"},{"en":"Researchers compared foldage across different parts of the basin.","zh":"研究人员比较了盆地不同区域的褶皱发育情况。"}]}],"synonyms":["folding","fold","crease","pleating","crumpling (less exact)"],"phonetic":"/ˈfoʊldɪdʒ/","extraExplanation":["“foldage”在现代日常英语中很少见，更常用的说法是“folding”（折叠/折痕）或“folds”（褶皱）。它多见于较正式、技术性语境（如装帧、纺织或地质学）。","构词上可理解为 fold（折叠）+ -age（表示“行为、过程或结果”的名词后缀），类似的例子有“breakage”（破损）。“-age”常让词显得更书面或专业。"]}
{"word":"foldaway","summary":{"en":"“Foldaway” describes something that can be folded up and put away (often furniture like a bed).","zh":"“foldaway”指可折叠收起、便于收纳的物品或设计（常指折叠床等家具）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be folded and stored away when not in use; designed to save space.","zh":"可折叠收起的；不用时可收纳以节省空间的（设计）。"},"examples":[{"en":"We bought a foldaway bed for guests.","zh":"我们买了一张可折叠收起的客床。"},{"en":"The apartment has a foldaway table in the kitchen.","zh":"这套公寓的厨房里有一张可折叠收纳的桌子。"}]},{"partOfSpeech":"n.","definition":{"en":"A foldaway item, especially a bed, that can be folded and stored.","zh":"可折叠收纳的物品（尤指折叠床）。"},"examples":[{"en":"There’s a foldaway in the closet if you need an extra bed.","zh":"衣橱里有一张折叠床，需要加床的话可以用。"}]}],"synonyms":["folding","collapsible","stowable","space-saving"],"phonetic":"/ˈfoʊlˌdeɪ/","extraExplanation":["“foldaway”常用于家居与旅行场景（如 foldaway bed/table/chair），强调“节省空间、方便收纳”。拼写上常见两种：foldaway（合写）与 fold-away（加连字符）；意思相同。"]}
{"word":"foldboat","summary":{"en":"A foldboat is a portable folding (often kayak-like) boat that can be packed up and assembled for use.","zh":"foldboat 指一种可携带的折叠（常为皮划艇式）小船，可收纳打包并在使用前组装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small boat (often a kayak) designed to be folded or taken apart for easy transport and storage, then assembled for use on the water","zh":"可折叠或可拆装的小船（常指折叠皮划艇），便于携带与收纳，下水前再组装使用"},"examples":[{"en":"They packed the foldboat into two bags and carried it onto the train.","zh":"他们把折叠船装进两个袋子里，带上了火车。"},{"en":"After a few minutes of assembly, the foldboat was ready to launch.","zh":"组装几分钟后，这艘折叠船就可以下水了。"},{"en":"A foldboat is convenient for travelers who don’t have room for a full-size kayak.","zh":"对没有空间放全尺寸皮划艇的旅行者来说，折叠船很方便。"}]}],"synonyms":["folding kayak","collapsible boat","collapsible kayak","folboat"],"phonetic":"/ˈfoʊldˌboʊt/","extraExplanation":["“foldboat”多见于英式或较旧的用法，尤其指早期的折叠皮划艇；在现代英语里更常说“folding kayak”“collapsible kayak”。","该词与德语“Faltboot”（折叠船）有关：20世纪初在欧洲流行，常用木质骨架配防水布/皮套，便于远足与探险携带。"]}
{"word":"foldboater","summary":{"en":"A foldboater is usually a person who uses a foldboat (a collapsible kayak/canoe). Less commonly, it can mean the foldboat itself.","zh":"foldboater通常指使用折叠艇（可折叠皮划艇/独木舟）的人；较少情况下也可指折叠艇本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who paddles or uses a foldboat (a collapsible kayak/canoe with a frame and fabric skin)","zh":"折叠艇（可折叠皮划艇/独木舟）使用者；划折叠艇的人"},"examples":[{"en":"The foldboater packed the boat into two bags and carried them onto the train.","zh":"这位折叠艇使用者把船收进两只包里，带上了火车。"},{"en":"As a beginner foldboater, she practiced entering and exiting the boat near the shore.","zh":"作为新手折叠艇玩家，她在岸边练习上下船。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a foldboat; a collapsible kayak/canoe","zh":"（较少见）折叠艇；可折叠的皮划艇/独木舟"},"examples":[{"en":"He repaired the foldboater’s fabric skin before the long river trip.","zh":"长途河流旅行前，他修补了这条折叠艇的布皮。"}]}],"synonyms":["foldboat paddler","folding-kayak paddler","kayaker (general)"],"phonetic":"/ˈfoʊldˌboʊtɚ/","extraExplanation":["“foldboater”在英语里相对偏小众，更多时候人们会说“folding kayak / folding canoe（折叠皮划艇/独木舟）”，或直接用品牌/型号来称呼。","折叠艇在20世纪早期到中期较常见：木/铝合金骨架＋防水布皮，便于拆装运输；在探险旅行与部分军事侦察（如需要隐蔽携行、快速下水）中也出现过。"]}
{"word":"foldboating","summary":{"en":"Foldboating means traveling or paddling in a foldboat (a packable folding kayak/canoe).","zh":"Foldboating 指用折叠舟（可打包携带的折叠皮划艇/独木舟）进行划行或旅行的活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity or sport of traveling in a foldboat (a kayak/canoe with a collapsible frame and skin that can be packed for transport).","zh":"使用折叠舟（可折叠骨架与外皮、便于打包携带的皮划艇/独木舟）进行出行或运动的活动。"},"examples":[{"en":"They went foldboating along the coast during summer vacation.","zh":"他们暑假沿海岸进行折叠舟旅行。"},{"en":"Foldboating is popular with people who want a kayak they can carry on public transport.","zh":"折叠舟活动在想要能搭公共交通携带的皮划艇爱好者中很受欢迎。"}]}],"synonyms":["folding-kayak paddling","foldboat touring","foldboat kayaking"],"phonetic":"/ˈfoʊldˌboʊtɪŋ/","extraExplanation":["“foldboating”来自“foldboat”（折叠舟）。折叠舟通常由可拆装/可折叠的框架（木或铝等）加上防水外皮组成，装好后像皮划艇一样下水，拆开后可装入背包或箱子，适合旅行与探险。","在英语语境里，这个词较偏“户外圈/航行运动”用语；更常见的日常说法是“folding kayak”或“packable kayak”。经典品牌如德国的 Klepper（早期折叠舟很有名），也常出现在相关历史与探险叙述中。"]}
{"word":"foldboats","summary":{"en":"Foldboats are portable boats—often folding kayaks—that can be folded or disassembled for easy transport; “foldboats” is the plural form.","zh":"foldboats 是 foldboat 的复数，指可折叠或可拆装、便于携带的船（常见为折叠皮划艇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural form of foldboat: a boat (often a kayak) that can be folded or taken apart for easy carrying and storage, then assembled for use on the water.","zh":"foldboat 的复数：一种可折叠或可拆装、便于携带与收纳的船（常见为折叠皮划艇），使用时可组装下水。"},"examples":[{"en":"They packed two foldboats into the car and drove to the lake.","zh":"他们把两艘折叠船装进车里，开去湖边。"},{"en":"Foldboats are popular with travelers because they fit in a suitcase-sized bag.","zh":"折叠船很受旅行者欢迎，因为它们能装进像行李箱大小的袋子里。"}]}],"synonyms":["folding kayaks","folding boats","portable kayaks","collapsible boats"],"phonetic":"/ˈfoʊldˌboʊt/","extraExplanation":["“foldboat”在英语里也常指“折叠皮划艇”（folding kayak），一些款式是骨架（frame）+外皮（skin）的结构，便于携带但需要一定时间组装。","在英式英语中也会看到“folding boat”；在户外运动语境里，相关词还有“packraft”（打包充气艇）与“kayak”（皮划艇）。"]}
{"word":"foldcourse","summary":{"en":"“Foldcourse” is not a standard English word; it’s usually a name or a misspelling/variant of “fold course” (a class about folding).","zh":"“foldcourse”不是标准英文词；通常是名称用法，或是“fold course”（折叠相关课程）的连写/误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare spelling; in most dictionaries, “foldcourse” is not an established English word. It is often seen as a name (brand/username) or a misspelling of “fold course.”","zh":"一种不规范或非常少见的拼写；多数词典不收录“foldcourse”作为标准英文词。它常见于名称（品牌/用户名）或是把“fold course”连写的误写。"},"examples":[{"en":"I couldn’t find “foldcourse” in a standard dictionary—do you mean “fold course”?","zh":"我在常见词典里查不到“foldcourse”——你是不是想写“fold course”？"},{"en":"Foldcourse is the name of a small online project, not a common English word.","zh":"Foldcourse 是某个小型线上项目的名字，并不是常用英文词。"}]},{"partOfSpeech":"phrase","definition":{"en":"(As “fold course”) A course/class about folding (e.g., paper-folding/origami, folding techniques).","zh":"（作“fold course”理解）关于“折叠”的课程/课（例如折纸、折叠技巧）。"},"examples":[{"en":"She signed up for a fold course to learn basic origami.","zh":"她报名了一门折叠课程来学基础折纸。"},{"en":"This fold course covers how to fold clothes for travel.","zh":"这门折叠课程讲如何为旅行折叠衣物。"}]}],"synonyms":["fold course","origami class","folding class"],"phonetic":"ˈfoʊldˌkɔrs","extraExplanation":["“foldcourse”更像是把两个常见词 fold（折叠）和 course（课程/路线/一道菜/（砖石）一层）连在一起的写法。是否应分开写、以及具体意思，通常需要看你看到它的上下文（比如教育平台、建筑描述、品牌名等）。如果你把原句贴出来，我可以帮你准确判断是哪一种用法。"]}
{"word":"folded","summary":{"en":"“Folded” usually means something was bent and laid over itself (as the past form of “fold”) or describes something that is in a folded state.","zh":"“folded”常指“fold”的过去式/过去分词（把东西折叠起来），也可作形容词表示“处于折叠状态的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “fold” (to bend or lay one part over another).","zh":"“fold”的过去式和过去分词（把某物对折、折叠，或把一部分覆盖到另一部分上）。"},"examples":[{"en":"She folded the letter and put it in an envelope.","zh":"她把信折好，放进信封里。"},{"en":"I folded the towels and stacked them in the closet.","zh":"我把毛巾叠好，整齐地放在柜子里。"},{"en":"He folded his arms and waited quietly.","zh":"他抱起双臂，安静地等着。"}]},{"partOfSpeech":"adj.","definition":{"en":"Arranged or shaped with one part bent over another; not spread out flat.","zh":"折叠起来的；有一部分向内/向上折起的；非平铺展开的。"},"examples":[{"en":"The map was folded in his pocket.","zh":"那张地图折着放在他口袋里。"},{"en":"She wore a skirt with a folded waistband.","zh":"她穿了一条腰头翻折的裙子。"},{"en":"Please return the blankets folded neatly.","zh":"请把毯子叠整齐后归还。"}]}],"synonyms":["creased","bent","tucked","doubled (over)","collapsed (context-dependent)"],"phonetic":"/ˈfoʊldɪd/","extraExplanation":["“folded arms”常用来描述姿态：可以表示在等待、思考，也可能暗示防备、不同意或不耐烦，具体语气取决于上下文和表情。","在衣物与纸张语境里，folded更偏“对折/叠好”；而“bent”更偏“弯曲但不一定整齐地叠起来”。"]}
{"word":"folded-brained","summary":{"en":"“Folded-brained” is informal slang meaning very smart/complex-minded, or (jokingly) overly complicated and overthinking.","zh":"“folded-brained”是非正式网络俚语，常指很聪明、思维复杂；也可（带玩笑）指把事情想得过于复杂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, internet slang) Having a very intelligent or complex mind; clever in a way that suggests lots of “brain folds” (wrinkles) like a human cerebral cortex.","zh":"（非正式／网络俚语）形容非常聪明、思维很复杂；用“脑子有很多褶皱”来暗示智力高。"},"examples":[{"en":"That solution was really folded-brained—I never would have thought of it.","zh":"那个解法太“褶皱脑”了——我根本想不到。"},{"en":"She’s folded-brained when it comes to puzzles and logic games.","zh":"她在解谜和逻辑游戏方面特别“褶皱脑”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, often joking) Overly complicated or overthinking; needlessly complex in reasoning or style.","zh":"（非正式，常带玩笑）想太多、把事情弄得过于复杂；推理或表达过度绕。"},"examples":[{"en":"Your explanation is a bit folded-brained—can you say it more simply?","zh":"你的解释有点太“褶皱脑”了——能不能讲得更简单点？"},{"en":"We don’t need a folded-brained plan for a simple weekend trip.","zh":"一个简单的周末出行，不需要这么“褶皱脑”的计划。"}]}],"synonyms":["brainy","sharp","clever","big-brained","overcomplicated","overthinking"],"phonetic":"/ˌfoʊldɪd ˈbreɪnd/","extraExplanation":["“folded-brained”不是标准词典里常见的固定词，更像是网络上的创造性说法，通常拿来和“smooth-brained（光滑脑＝不聪明/没动脑）”做对比。","它借用了“人类大脑皮层有很多褶皱（folds）”这一形象来夸人聪明或讽刺人想得太复杂。语气多半偏口语、调侃，正式写作中不建议使用。"]}
{"word":"folded-crested","summary":{"en":"Describes something whose crest or top ridge/tuft is folded down.","zh":"形容某物的冠、脊或顶部隆起部分是折下/贴伏的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a crest (a raised top part, ridge, or tuft of feathers) that is folded down rather than standing upright.","zh":"（顶部的）冠、脊或羽冠是折下/贴伏的，而不是竖起的。"},"examples":[{"en":"The cockatoo looked calm, its folded-crested head giving it a gentle expression.","zh":"那只凤头鹦鹉看起来很平静，贴伏的羽冠让它显得很温柔。"},{"en":"In the windless air, the folded-crested waves rolled quietly toward the shore.","zh":"在无风的空气里，浪头像折起的“浪冠”一样安静地向岸边涌来。"}]}],"synonyms":["droop-crested","down-crested","folded-up (crest)","flattened-crested"],"phonetic":"ˌfoʊldɪd ˈkrɛstɪd","extraExplanation":["“folded-crested”是带连字符的复合形容词：folded（折起的/贴伏的）+ crested（有冠的/有脊的）。多见于描写性写作（自然观察、文学描写）中，用来强调“冠”此刻不是竖立状态，而是收起、贴着。","“crest”既可指鸟类的羽冠，也可指山脊、波峰等的“顶端”。因此这个词可以用于动物外形，也可作比喻性描写（如云、浪、山的“顶端”像折起来一样）。"]}
{"word":"folded-tooth","summary":{"en":"“Folded-tooth” describes a tooth (often in scientific contexts) with folded/infolded layers, especially enamel, forming ridges or complex patterns.","zh":"「folded-tooth」多用於學術語境，指牙（常指牙釉質）具有褶皺或內折層狀結構，形成脊狀或複雜紋理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a tooth structure with folded or infolded layers (especially enamel), creating ridges or complex patterns.","zh":"（尤指牙釉質）具有「褶皺／內折」結構的牙；因層狀組織內折而形成脊狀或複雜紋理的牙。"},"examples":[{"en":"Some fossil reptiles are described as having folded-tooth enamel.","zh":"一些爬行類化石會被描述為具有褶皺牙釉質（folded-tooth enamel）。"},{"en":"Under the microscope, the folded-tooth pattern looks like repeated ridges.","zh":"在顯微鏡下，褶皺牙的紋理看起來像反覆出現的脊狀結構。"}]}],"synonyms":["plicated-tooth","folded-enamel","infolded enamel"],"phonetic":"ˈfoʊldɪd tuθ","extraExplanation":["「folded-tooth」不是日常英語常見詞，更常見的寫法是 folded-tooth enamel（褶皺牙釉質）或用更專門的詞 plicated enamel（褶皺狀牙釉質）。","這種描述常見於古生物學與比較解剖學：牙釉質或象牙質出現內折（infolding），能增加咬合邊緣與耐磨性；有時也會用來討論某些化石兩棲類（如迷齒類的“labyrinthodont”意象）或其他脊椎動物的牙齒微觀結構。"]}
{"word":"folded-winged","summary":{"en":"“Folded-winged” describes an insect or bird with its wings folded, not spread out.","zh":"“folded-winged”指（昆虫或鸟）翅膀收拢、没有展开的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the wings folded (not spread out), especially describing an insect or bird at rest.","zh":"（尤指昆虫或鸟）翅膀收拢的；翅膀折叠着的。"},"examples":[{"en":"A folded-winged moth rested on the window screen.","zh":"一只翅膀收拢的飞蛾停在纱窗上。"},{"en":"The folded-winged bird looked calm, perched quietly on the branch.","zh":"那只翅膀收拢的鸟安静地停在树枝上，看起来很平静。"}]}],"synonyms":["wings-folded","closed-winged","folded-wing"],"phonetic":"/ˌfoʊldɪd ˈwɪŋd/","extraExplanation":["“folded-winged”是由过去分词folded + 名词wing构成的复合形容词，常用连字符（hyphen）连接，用来放在名词前作定语：a folded-winged insect（翅膀收拢的昆虫）。也可以不用连字符，改写成更口语的表达：with its wings folded / with folded wings。"]}
{"word":"foldedly","summary":{"en":"“Foldedly” means ‘in a folded manner’ or (rarely) ‘with arms folded.’ It’s uncommon in modern English.","zh":"“foldedly”表示“以折叠的方式”，或（少见）“双臂抱着地”。在现代英语中不常用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a folded way; with folds (for example, arranged or lying in layers).","zh":"以折叠的方式；带褶皱地（例如成层叠放或呈折痕状）。"},"examples":[{"en":"The letter was tucked foldedly into his coat pocket.","zh":"那封信被折叠着塞进了他的外套口袋里。"},{"en":"A scarf lay foldedly on the chair, neat and compact.","zh":"一条围巾整齐地折叠着放在椅子上，小巧紧凑。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative, rare) With arms or hands folded, often suggesting waiting, restraint, or quiet disapproval.","zh":"（比喻义，少见）双臂/双手抱起（或交叠）地，常暗示等待、克制或默默不满。"},"examples":[{"en":"She stood foldedly by the door, saying nothing.","zh":"她双臂抱着站在门边，一言不发。"},{"en":"He watched foldedly as others argued.","zh":"他双臂抱着旁观别人争论。"}]}],"synonyms":["in folds","folded up","with arms folded","cross-armed"],"phonetic":"/ˈfoʊldɪdli/","extraExplanation":["“foldedly”在现代英语中非常少见，更常见的表达是：in folds / folded up / with (his/her) arms folded。","它由形容词/过去分词“folded”加副词后缀“-ly”构成，写作上偶尔用于营造一种更“文学化”的节奏或画面感。"]}
{"word":"foldedness","summary":{"en":"Foldedness means the quality of being folded, and in science it can mean how folded a protein or molecule is.","zh":"Foldedness 指“折叠的特性/程度”；在科学语境中也可指蛋白质或分子的“折叠程度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being folded; having many folds or layers","zh":"折叠的状态或特性；有许多褶皱或层次的程度"},"examples":[{"en":"The foldedness of the fabric made it look thicker than it really was.","zh":"布料的折叠感让它看起来比实际更厚。"},{"en":"You can reduce the foldedness by smoothing the cloth with your hands.","zh":"你可以用手把布抚平来减少褶皱。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/chemistry) the degree to which a protein or molecule is folded into a stable 3D shape","zh":"（生物/化学）蛋白质或分子折叠成稳定三维结构的程度"},"examples":[{"en":"Heat can change a protein’s foldedness and stop it from working properly.","zh":"高温会改变蛋白质的折叠程度，使其无法正常工作。"},{"en":"Researchers measured foldedness to understand why the mutation causes disease.","zh":"研究人员测量折叠程度，以了解这种突变为何会致病。"}]}],"synonyms":["folding","creasedness","wrinkliness","layering"],"phonetic":"/ˈfoʊldɪdnəs/","extraExplanation":["“foldedness”由“folded（折叠的）+ -ness（名词后缀，表示性质/状态）”构成，常见于较正式或学术语境。日常表达里更常用“folds / wrinkles（褶皱）”或“the way it’s folded（折法）”。","在蛋白质语境中，“foldedness”常与“protein folding（蛋白质折叠）”“misfolding（错误折叠）”“unfolding（解折叠）”一起出现。"]}
{"word":"folden","summary":{"en":"“Folden” is a rare/old form meaning “folded,” sometimes used poetically to mean “wrapped/enclosed in folds.”","zh":"“Folden”是“folded（折叠的）”的罕见/古体形式，也可在诗意用法中表示“裹住、被层层包裹”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic or dialect) Past participle of “fold”; meaning “folded.”","zh":"（罕见/古体或方言）动词 fold 的过去分词形式，意思是“折叠了的/合拢了的”。"},"examples":[{"en":"In older writing, you may see “folden” where modern English would use “folded.”","zh":"在较老的文本中，你可能会看到用 “folden” 来表示现代英语中的 “folded（折叠的）”。"},{"en":"He kept the letter folden in his pocket.","zh":"他把信折好（folden）放在口袋里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/poetic) Enclosed or gathered in folds; wrapped.","zh":"（罕见/诗意）被折叠包裹的；层层合拢/裹住的。"},"examples":[{"en":"The child lay folden in a blanket.","zh":"孩子裹在毯子里（folden）。"}]}],"synonyms":["folded","wrapped","enfolded"],"phonetic":"/ˈfoʊldən/","extraExplanation":["“folden”在现代日常英语里几乎不用，更多见于古体、方言或文学仿古表达。学习时更实用的形式是：fold（动词：折叠）→ folded（过去式/过去分词/形容词：折叠的）。","如果你是在某篇文章或歌词里遇到“folden”，通常可以先按“folded”理解；具体含义还要结合上下文（是“折叠”还是“裹住/包住”）。"]}
{"word":"folder","summary":{"en":"A folder is a container used to organize documents or computer files.","zh":"Folder 指用来整理和存放纸质文件或电脑文件的“文件夹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A container (paper or digital) used to organize and store documents or files, often grouped by topic or project.","zh":"（纸质或电子的）文件夹；用于按主题或项目整理、存放文件/资料的容器。"},"examples":[{"en":"Please put the contract in the blue folder.","zh":"请把合同放进蓝色文件夹里。"},{"en":"I saved the photos in a folder called “Vacation.”","zh":"我把照片保存在一个叫“Vacation（假期）”的文件夹里。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or device that folds something (used less commonly).","zh":"折叠者；折叠装置（较少用）。"},"examples":[{"en":"This machine is a paper folder.","zh":"这台机器是折页机（纸张折叠机）。"}]}],"synonyms":["directory","file folder","binder (similar)","portfolio (similar)"],"phonetic":"/ˈfoʊldɚ/","extraExplanation":["“folder”在电脑里常指“目录（directory）”：你在文件管理器里看到的文件夹就是用来分类存放文件的“容器”。口语里也常说“create a folder / open a folder / move a file into a folder”。","在办公语境里，“folder”还可以指用来夹纸的“资料夹/档案夹”（如presentation folder）。不同地区也会说“file”或“file folder”。"]}
{"word":"folder-gluer","summary":{"en":"A folder-gluer is a packaging machine that folds carton blanks and glues them into finished cartons.","zh":"folder-gluer 指包装生产中把纸盒坯折叠并上胶糊合成成品纸盒的机器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine used in packaging to fold flat cardboard (carton blanks) into shape and glue the seams, producing finished cartons or boxes","zh":"（包装行业的）折叠糊盒机；用于把纸板/纸盒坯折成型并在接缝处上胶粘合，做成成品纸盒/纸箱的机器"},"examples":[{"en":"The factory installed a new folder-gluer to increase carton output.","zh":"工厂安装了一台新的折叠糊盒机来提高纸盒产量。"},{"en":"After printing and die-cutting, the blanks go to the folder-gluer for folding and gluing.","zh":"印刷和模切之后，盒坯会送到折叠糊盒机进行折叠和糊合。"},{"en":"We need to adjust the folder-gluer because the side seam isn’t sticking well.","zh":"我们需要调一下折叠糊盒机，因为侧边接缝粘得不牢。"}]}],"synonyms":["carton folder-gluer","folding carton gluer","carton gluer"],"phonetic":"/ˈfoʊldɚ ˈɡluːɚ/","extraExplanation":["“folder-gluer”是包装印刷行业的专业术语，常见于“纸盒（folding carton）”生产线。典型流程是：印刷（printing）→ 上光/覆膜（coating/lamination）→ 模切压痕（die-cutting & creasing）→ 折叠糊盒（folder-gluer）。","在实际沟通中也常写作“folder gluer”或“folding carton folder-gluer”。不同机型可做直线盒（straight-line）、反向盒（crash-lock / auto-bottom）等结构。"]}
{"word":"folderol","summary":{"en":"Folderol means nonsense or unnecessary fuss/frills.","zh":"Folderol 指“胡扯/废话”，也可指“不必要的排场或华而不实的装饰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"nonsense or silly talk; something unimportant that shouldn’t be taken seriously","zh":"胡言乱语；无稽之谈；不重要、没必要当回事的东西"},"examples":[{"en":"Ignore the online rumors—they’re just folderol.","zh":"别理网上的谣言——那都是胡扯。"},{"en":"He dismissed the complaint as folderol and changed the subject.","zh":"他把那项抱怨当作无稽之谈，立刻换了话题。"}]},{"partOfSpeech":"n.","definition":{"en":"unnecessary fuss or show; trivial decoration or frills","zh":"不必要的排场/折腾；华而不实的装饰、花边"},"examples":[{"en":"The report is clear and direct, with no folderol.","zh":"这份报告清晰直接，没有多余的花架子。"},{"en":"She prefers simple design over folderol.","zh":"她更喜欢简洁的设计，而不是那些华而不实的装饰。"}]}],"synonyms":["nonsense","baloney","hogwash","bunk","claptrap","tomfoolery","frills","fuss"],"phonetic":"/ˈfɑl.dəˌrɔl/","extraExplanation":["“folderol”在现代英语里带点幽默或轻微讽刺的语气，常用于把某事说得“太夸张、太无聊、太不值得认真”。","词源不太确定，但在19世纪的英语中常见，有人认为它可能模仿当时歌曲/戏剧里无意义的衬词（类似“啦啦啦”），所以逐渐引申为“废话、花架子”。"]}
{"word":"folderols","summary":{"en":"Folderols means nonsense or pointless, showy stuff.","zh":"folderols 指“胡言乱语/废话”，也可指“华而不实的点缀”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nonsense or silly talk; empty, meaningless stuff.","zh":"胡言乱语；废话；无意义的东西。"},"examples":[{"en":"Don’t listen to his folderols—he’s just trying to sound important.","zh":"别听他的胡扯——他只是想显得很重要。"},{"en":"The article was full of folderols instead of clear facts.","zh":"那篇文章满是废话，而不是清楚的事实。"}]},{"partOfSpeech":"n.","definition":{"en":"Useless or showy details added mainly for decoration or attention, not for real value.","zh":"华而不实的点缀；无用的装饰性细节。"},"examples":[{"en":"We removed the folderols and kept the design simple and readable.","zh":"我们去掉了那些华而不实的装饰，让设计简洁易读。"},{"en":"The speech had too much folderol and not enough solutions.","zh":"那篇演讲华丽辞藻太多，解决办法太少。"}]}],"synonyms":["nonsense","baloney","rubbish","hogwash","poppycock","fluff"],"phonetic":"/ˈfɑldəˌrɔl/","extraExplanation":["“folderol”常用作复数“folderols”，语气偏口语、带一点讽刺，表示“胡扯/废话”或“花架子”。在正式写作中也能用，但更常见于评论、吐槽或带幽默感的表达。","词源上带有拟声/儿语色彩（像随口编的无意义音节），因此天然就有“无聊、没内容”的感觉。"]}
{"word":"folders","summary":{"en":"“Folders” is the plural of “folder,” meaning paper document holders or computer/email places used to organize files.","zh":"“folders”是“folder”的复数，指纸质文件夹，或电脑/邮箱中用来整理文件与信息的文件夹（目录）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A paper or cardboard cover (often with pockets) used to hold and organize documents.","zh":"（纸或硬纸板做的）文件夹，用来夹放和整理纸张文件。"},"examples":[{"en":"Please put the signed contract back in the blue folder.","zh":"请把签好的合同放回蓝色文件夹里。"},{"en":"She carried a folder full of notes to the meeting.","zh":"她带着一夹子会议笔记去开会。"}]},{"partOfSpeech":"n.","definition":{"en":"A place on a computer or phone where files are stored and organized (also called a “directory”).","zh":"（电脑/手机上的）文件夹/目录，用来存放并分类文件。"},"examples":[{"en":"Save the photos in a new folder called “Vacation.”","zh":"把照片保存到一个叫“Vacation”的新文件夹里。"},{"en":"I can’t find the report—it might be in the Downloads folder.","zh":"我找不到报告——可能在“下载”文件夹里。"}]},{"partOfSpeech":"n.","definition":{"en":"A category in an email app used to group messages (e.g., Inbox, Spam, Archive).","zh":"（电子邮箱里的）邮件文件夹/分类，用来归类邮件（如收件箱、垃圾邮件、归档）。"},"examples":[{"en":"Check your Spam folder to see if the email landed there.","zh":"去垃圾邮件文件夹看看邮件是不是被放到那里了。"},{"en":"I moved the message to the Archive folder.","zh":"我把那封邮件移到了归档文件夹。"}]}],"synonyms":["directories","binders","file holders","sections"],"phonetic":"/ˈfoʊldɚ/","extraExplanation":["“folders”是“folder”的复数形式：一个folder，两个或更多folders。电脑语境里常把folder理解为“文件夹/目录（directory）”，而纸质语境里则是“装文件的夹子”。"]}
{"word":"folding","summary":{"en":"“Folding” can mean the act of making folds, the action of folding something, or describe something that can be folded (e.g., a folding chair).","zh":"“folding”可表示“折叠的过程/动作”，也可作形容词表示“可折叠的”（如折叠椅）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of bending something so that one part lies over another; the process of making folds","zh":"折叠；把一部分向另一部分弯折覆盖的过程"},"examples":[{"en":"Folding the map neatly makes it easier to put in your pocket.","zh":"把地图整齐地折好，更容易放进口袋里。"},{"en":"After folding, the paper fits into the envelope.","zh":"折好之后，纸就能放进信封里。"}]},{"partOfSpeech":"adj.","definition":{"en":"able to be folded; designed so it can be folded and stored","zh":"可折叠的；设计成可以折起来收纳的"},"examples":[{"en":"She bought a folding chair for camping.","zh":"她买了一把露营用的折叠椅。"},{"en":"A folding phone can fit in smaller bags.","zh":"折叠手机能放进更小的包里。"}]},{"partOfSpeech":"v.","definition":{"en":"the action of bending or turning something over on itself","zh":"折叠；把某物向内翻折"},"examples":[{"en":"He is folding the blanket at the end of the bed.","zh":"他正在把毯子在床尾折起来。"},{"en":"Folding the dough gently helps keep it light.","zh":"轻轻折叠面团有助于保持松软。"}]}],"synonyms":["bending","creasing","collapsing (adj., for objects)","foldable"],"phonetic":"/ˈfoʊldɪŋ/","extraExplanation":["“folding”既可以指“折叠这个动作/过程”（名词、动名词用法），也可以作形容词表示“可折叠的”（常见于产品：folding chair/table/bike）。","在烘焙里，fold (the dough) 指“把面团翻折、拌匀但不压扁”，强调动作轻柔，用来保留空气感。"]}
{"word":"foldless","summary":{"en":"“Foldless” means having no folds—smooth, flat, or uncreased.","zh":"“foldless”表示“无褶的、平整无折痕的（不易折叠的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no folds; smooth, flat, or not able/likely to be folded.","zh":"无褶的；平整的；（不）易折叠的。"},"examples":[{"en":"She wore a foldless skirt with a clean, simple line.","zh":"她穿了一条无褶的裙子，线条干净利落。"},{"en":"For the photo, he tried to keep the sheet as foldless as possible.","zh":"为了拍照，他尽量让床单保持没有折痕。"},{"en":"Some products advertise “foldless packaging” to reduce creases during shipping.","zh":"有些产品宣传“无折包装”，以减少运输中的折痕。"}]}],"synonyms":["uncreased","wrinkle-free","smooth","flat","unfolded"],"phonetic":"ˈfoʊldləs","extraExplanation":["“foldless”不是特别常见的日常词，但构词很透明：fold（折叠/褶）+ -less（没有……的）。在描述衣物（无褶裙、平整的衬衫）、纸张/布料（无折痕）、包装（避免压折）等场景里更常见。更口语的表达常用：no folds / without wrinkles / uncreased / flat。"]}
{"word":"foldout","summary":{"en":"“Foldout” means a folded section that opens out (often in books/maps), or something made to unfold into a larger form.","zh":"“Foldout”指可折叠并展开的部分（常见于书/地图等），也可作形容词表示“可展开的、展开后更大的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of a book, map, brochure, or newspaper that is folded and can be opened out to show more information (for example, a large picture or diagram).","zh":"（书、地图、宣传册或报纸中）可折叠并展开的页/部分（常用于展示更大的图片或图表）。"},"examples":[{"en":"The guidebook has a foldout map of the subway system.","zh":"这本指南书有一张可展开的地铁线路折页地图。"},{"en":"There’s a foldout diagram at the back showing how the machine works.","zh":"书后面有一张可展开的示意图，展示机器如何运作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed so it can be folded out or unfolded to become larger or to reveal something.","zh":"可折叠展开的；展开后更大或能呈现内容的。"},"examples":[{"en":"The magazine included a foldout poster.","zh":"这本杂志附带一张可展开的海报。"},{"en":"We used a foldout table to save space in the small apartment.","zh":"我们用了一张可折叠展开的桌子来节省小公寓的空间。"}]}],"synonyms":["pull-out","folding","expandable"],"phonetic":"/ˈfoʊlˌdaʊt/","extraExplanation":["“foldout”常见于出版物：foldout map（折页地图）、foldout chart/diagram（折页图表/示意图）、foldout poster（折页海报）。在家居语境里也常见：foldout bed/sofa（折叠床/沙发床）、foldout table（折叠桌）。","拼写提示：美式英语里常写作一个词“foldout”；也可能见到连字符形式“fold-out”，尤其作形容词时。两者含义相同。"]}
{"word":"foldouts","summary":{"en":"“Foldouts” are folded sections that open out (often in print) to show larger content; it can also describe items that fold out, like a table or sofa bed.","zh":"“foldouts”指可展开的折页（常见于印刷品中）以展示更大内容；也可形容可展开的物品，如折叠桌或沙发床。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A section of paper (in a magazine, book, brochure, or newspaper) that is folded and can be opened out to show extra space for a large picture, map, chart, or information.","zh":"（杂志、书籍、宣传册或报纸中）可展开的折页，用来呈现更大的图片、地图、图表或更多信息。"},"examples":[{"en":"The magazine’s foldouts include a detailed map of the city.","zh":"这本杂志的折页里有一张很详细的城市地图。"},{"en":"Please be careful when opening the foldouts so they don’t tear.","zh":"打开折页时请小心，别把它撕破了。"},{"en":"The book has foldouts that show the full timeline on one wide page.","zh":"这本书有折页，可以在一张展开的宽页上展示完整时间线。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made to open outward by folding (used before a noun).","zh":"可向外折叠展开的（常作定语，置于名词前）。"},"examples":[{"en":"We ordered a foldout table for the small apartment.","zh":"我们为小公寓订了一张可折叠展开的桌子。"},{"en":"She slept on a foldout sofa in the living room.","zh":"她睡在客厅的折叠沙发床上。"}]}],"synonyms":["gatefolds","pullouts","folding inserts","folding sections"],"phonetic":"ˈfoʊlˌdaʊt","extraExplanation":["“Foldout”在出版物里很常见，尤其是地图、海报或大幅广告。打开时通常需要沿着折痕慢慢展开，避免纸张在折痕处撕裂。"]}
{"word":"folds","summary":{"en":"“Folds” can mean creases/layers (plural noun) or the action “folds” = bends or closes something (3rd-person singular verb).","zh":"“folds”既可作名词复数表示“折痕/褶皱”，也可作动词第三人称单数表示“折叠/合上（某物）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Creases or bent parts made when something is folded; also areas of loose fabric that hang in layers.","zh":"（名词复数）折痕；折叠处；（衣物等的）褶皱、褶裥。"},"examples":[{"en":"The map has deep folds from being kept in my pocket.","zh":"这张地图因为一直放在我口袋里，留下了很深的折痕。"},{"en":"She smoothed the folds of her dress before the interview.","zh":"面试前她把裙子的褶皱抚平了。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) Bends something over itself so it becomes smaller or forms a crease; also closes or brings parts together by folding.","zh":"（动词第三人称单数）把……折叠起来；使……弯折形成折痕；（也可指）合上、折起。"},"examples":[{"en":"He folds the letter and puts it in an envelope.","zh":"他把信折好放进信封里。"},{"en":"This chair folds flat for easy storage.","zh":"这把椅子可以折平，方便收纳。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) In cooking, gently mixes one ingredient into another (often to keep air in).","zh":"（动词第三人称单数，烹饪）把（某种材料）轻轻“拌入/翻拌”另一种材料中（通常为了保留空气感）。"},"examples":[{"en":"She folds the egg whites into the batter to make it light.","zh":"她把蛋白轻轻翻拌进面糊里，让口感更松软。"}]}],"synonyms":["creases","pleats","bends","tucks","folds up","closes","collapses","mixes in (cooking)"],"phonetic":"/foʊldz/","extraExplanation":["“folds”常见于两种语法形式：①名词复数（fold 的复数）；②动词第三人称单数（he/she/it folds）。看句子里前面是冠词/数量词（the/two）多半是名词；主语是 he/she/it/单数名词且后面接宾语或副词，多半是动词。"]}
{"word":"foldskirt","summary":{"en":"A foldskirt is a skirt with folds (pleats); it can also mean to fold a skirt to form pleats.","zh":"foldskirt 指有褶的裙子（褶裙/百褶裙）；也可指把裙子折出褶子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a skirt made with folds (pleats), so the fabric is gathered into repeated, neat lines","zh":"有褶（百褶）的裙子；用折褶/打褶做出来的裙子"},"examples":[{"en":"She wore a foldskirt to the school ceremony because it looked neat and classic.","zh":"她在学校典礼上穿了一条褶裙，因为看起来整洁又经典。"},{"en":"A foldskirt moves nicely when you walk.","zh":"褶裙走路时摆动起来很好看。"}]},{"partOfSpeech":"v.","definition":{"en":"to fold a skirt (often to create pleats)","zh":"把裙子折起来（常指折出褶子/打褶）"},"examples":[{"en":"The tailor folded the skirt carefully to make even pleats.","zh":"裁缝小心地把裙子折好，做出均匀的褶子。"},{"en":"You can fold the skirt along the lines before ironing.","zh":"你可以先沿着褶线把裙子折好再熨。"}]}],"synonyms":["pleated skirt","skirt with folds","pleat","pleated"],"phonetic":"ˈfoʊldˌskɝt","extraExplanation":["“foldskirt”不是非常常见的标准单词；更常见的说法是“pleated skirt（百褶裙/打褶裙）”或“a skirt with folds”。写作时也可能见到“fold skirt”分开写，或用连字符“fold-skirt”。在服装语境里，谈到这种裙子通常用“pleat/pleated”。"]}
{"word":"foldstool","summary":{"en":"A foldstool is a small folding stool that’s easy to carry and store.","zh":"foldstool 指可折叠、便于携带与收纳的小凳子（折叠凳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small stool with legs that can be folded so it is easy to carry or store","zh":"折叠凳；（腿可折起、便于携带或收纳的）小凳子"},"examples":[{"en":"She sat on a foldstool by the campfire.","zh":"她在营火旁坐在一张折叠凳上。"},{"en":"Bring a foldstool if the seats might be full.","zh":"如果可能没有座位，就带一张折叠凳。"}]}],"synonyms":["folding stool","camp stool","portable stool"],"phonetic":"/ˈfoʊldˌstuːl/","extraExplanation":["“Foldstool”在现代英语里不算常用，更常见的说法是“folding stool”或“folding chair”。","在较老的文本（包括《圣经》英译本）里，“foldstool”有时指“脚凳/踏脚凳”，带有“脚下之物、象征臣服或权威”的意象，例如“make his enemies his footstool（使仇敌作他的脚凳）”这类表达。"]}
{"word":"foldure","summary":{"en":"“Folder” means a place (digital or paper) for organizing and keeping files/documents.","zh":"“Folder”指用于整理和存放文件/文档的地方（电脑文件夹或纸质文件夹）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A container (especially on a computer) used to organize and hold files.","zh":"（尤指电脑上的）文件夹；用于整理和存放文件的容器。"},"examples":[{"en":"Save the photo in a new folder called “Travel.”","zh":"把这张照片保存到一个叫“Travel（旅行）”的新文件夹里。"},{"en":"This folder contains all the homework files.","zh":"这个文件夹里有所有作业文件。"}]},{"partOfSpeech":"n.","definition":{"en":"A paper cover or holder used to keep documents together.","zh":"（纸质）文件夹；用于夹放和整理纸张文件的封套/夹子。"},"examples":[{"en":"Please put the contract in the blue folder.","zh":"请把合同放进蓝色文件夹里。"},{"en":"She carried a folder of notes to the meeting.","zh":"她带着一文件夹笔记去开会。"}]}],"synonyms":["directory","file","binder"],"phonetic":"/ˈfoʊldər/","extraExplanation":["“foldure”不是常见的英语单词；最可能是把 **folder** 拼错了。","词源提示：**folder** 来自 **fold**（折叠）。早期纸质文件夹常通过“对折/折叠纸张”来夹住文件，因此得名。"]}
{"word":"foldwards","summary":{"en":"“foldwards” isn’t standard English; it’s probably a misspelling of “forwards/forward” (“ahead; toward the front”).","zh":"“foldwards”不是标准英语；很可能是“forwards/forward”（“向前；朝前”）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; “foldwards” is not a recognized word in modern English. It is most likely a misspelling of “forwards” (also “forward”), meaning toward the front or ahead.","zh":"非标准拼写；“foldwards”在现代英语中不是公认单词。它很可能是“forwards”（或“forward”）的拼写错误，表示“向前、朝前、往前”。"},"examples":[{"en":"Did you mean “forwards”? For example: “Move forwards two steps.”","zh":"你是不是想写“forwards”？例如：“Move forwards two steps.”（向前走两步。）"},{"en":"Please send the email forwards to your manager.","zh":"请把这封邮件转发给你的经理。"}]},{"partOfSpeech":"adv.","definition":{"en":"(If you meant “forwards”) in the direction in front; ahead; onward.","zh":"（如果你要写的是“forwards”）朝前的方向；向前；继续向前。"},"examples":[{"en":"Keep walking forwards until you see the bank.","zh":"一直往前走，直到你看到银行。"},{"en":"We need to look forwards, not backwards.","zh":"我们要向前看，不要往回看。"}]}],"synonyms":["ahead","onward","forward"],"phonetic":"/ˈfɔɹwɚdz/","extraExplanation":["“foldwards”在日常英语、词典和主流语料中几乎不出现；更常见的正确形式是“forward/forwards”。","美式英语里，“forward”既可作形容词/副词（go forward）也可作动词（forward an email=转发邮件）；“forwards”作副词也常见，但在正式写作中常用“forward”。"]}
{"word":"foldy","summary":{"en":"Foldy means “full of folds/wrinkles” or, informally, “easy to fold; foldable.”","zh":"Foldy 指“有褶皱/起皱的”，也可作非正式说法表示“容易折叠的；可折叠的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having folds; wrinkled or creased; showing many fold-like layers.","zh":"有褶皱的；起皱的；有很多折叠层次的。"},"examples":[{"en":"The fabric looks a bit foldy after being packed in the suitcase.","zh":"这块布料装进行李箱后看起来有点起褶了。"},{"en":"He wore a foldy raincoat that had been stuffed into his backpack.","zh":"他穿着一件被塞进背包、皱巴巴的雨衣。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Easy to fold; designed to be folded or compacted.","zh":"（非正式）容易折叠的；可折叠、便于收纳的。"},"examples":[{"en":"I want a foldy chair for camping—something I can carry easily.","zh":"我想要一把露营用的可折叠椅，最好方便携带。"},{"en":"This map is foldy, so it fits in your pocket.","zh":"这张地图很好折，能放进口袋里。"}]}],"synonyms":["wrinkly","creased","folded","foldable","collapsible"],"phonetic":"/ˈfoʊldi/","extraExplanation":["“foldy”不是非常标准、固定的词（更偏口语/临时造词），常见于随意对话、产品描述或网络语境，用来表达“很多褶”“皱皱的”或“很容易折叠”。更正式的表达通常用：wrinkled（起皱的）、creased（有折痕的）、foldable（可折叠的）。"]}
{"word":"fole","summary":{"en":"“Fole” is an archaic spelling of “foal,” meaning a young horse.","zh":"“fole”是“foal”的古拼法，意思是“小马/幼马”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic spelling) a foal; a young horse.","zh":"（古拼法）小马；幼马。"},"examples":[{"en":"In some older texts, you may see “fole” meaning a young horse.","zh":"在一些较旧的文本里，你可能会看到“fole”，意思是“小马”。"},{"en":"The mare stayed close to her fole in the field. (archaic)","zh":"母马在田里紧挨着她的小马。（古用法）"}]}],"synonyms":["foal","young horse"],"phonetic":"/foʊl/","extraExplanation":["“fole”在现代英语里几乎不用，主要出现在中古英语或较早的拼写中；现代标准拼写是 foal。","现代读音与 foal 相同；如果你是在作业或写作中看到“fole”，通常可以理解为历史/文学语境下的拼写差异。"]}
{"word":"foley","summary":{"en":"“Foley” most commonly means post-production sound effects in film/TV; it can also mean a Foley catheter in medicine, or be a surname.","zh":"“Foley”最常指影视后期的拟音音效；在医学语境也可指Foley导尿管；还可以作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sound effects recorded and added to a film, TV show, or video in post-production (for example, footsteps, cloth movement, door sounds).","zh":"（影视/视频后期制作中）拟音效果；拟音音效（如脚步声、衣料摩擦声、开关门声等）。"},"examples":[{"en":"The movie feels more realistic because the foley is so detailed.","zh":"这部电影因为拟音做得很细致而显得更真实。"},{"en":"They recorded foley for the fight scene using gloves and a leather bag.","zh":"他们用手套和皮革袋子为打斗场景录制拟音。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of urinary catheter used in medicine (often called a “Foley catheter”).","zh":"（医学）导尿管的一种（常称“Foley导尿管”）。"},"examples":[{"en":"The nurse inserted a Foley catheter after the surgery.","zh":"手术后护士置入了Foley导尿管。"},{"en":"The doctor explained how long the Foley catheter would stay in place.","zh":"医生解释了Foley导尿管需要留置多久。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"（姓氏）福利 / 福利（Foley）。"},"examples":[{"en":"My teacher’s last name is Foley.","zh":"我老师的姓是Foley。"}]}],"synonyms":["sound effects","SFX","post-production sound","foley effects"],"phonetic":"/ˈfoʊli/","extraExplanation":["“foley（拟音）”在影视行业里来自人名：Jack Foley（杰克·福利），他是早期电影拟音技术的重要推动者之一，因此这类“用道具现场制造并录制的音效”就以他的姓来命名。","学习时注意：普通语境里说“foley”多半指影视拟音；在医院语境里提到“a Foley”通常是指“Foley导尿管”。"]}
{"word":"foleye","summary":{"en":"“Foleye” is not a common English word; it is most likely a misspelling of “Foley,” meaning film/TV sound effects created to match on-screen actions, or it may be a name.","zh":"“foleye”不是常见英语词；多半是“Foley”的误拼，指影视中配合画面动作制作的拟音音效，也可能是人名/地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely) a misspelling or variant spelling of “Foley,” meaning sound effects created and recorded to match actions in films, TV, or games.","zh":"（很可能）“Foley”的拼写变体或误拼，指为电影、电视或游戏配合画面动作而制作并录制的拟音/音效（拟音艺术）。"},"examples":[{"en":"The Foley artist added footsteps and door creaks to make the scene feel real.","zh":"拟音师加上脚步声和门吱呀声，让场景更真实。"},{"en":"This movie’s Foley work is so detailed that you can hear every fabric movement.","zh":"这部电影的拟音做得非常细，你甚至能听到衣料摩擦的声音。"}]},{"partOfSpeech":"other","definition":{"en":"A surname or place name (e.g., “Foley” as a last name or a town name). “Foleye” may be a nonstandard spelling.","zh":"姓氏或地名（如“Foley”作为姓，或作为城镇名）。“foleye”可能是不规范拼写。"},"examples":[{"en":"Dr. Foley will see you now.","zh":"Foley 医生现在要见你。"},{"en":"They moved to Foley, Alabama for work.","zh":"他们为了工作搬到了阿拉巴马州的 Foley。"}]}],"synonyms":["sound effects","SFX","Foley effects"],"phonetic":"/ˈfoʊli/","extraExplanation":["“Foley（拟音）”一词来自好莱坞早期拟音师 Jack Foley 的姓氏，后来演变成行业通用名词。","如果你本来想查的是人名/非英语词（例如某些语言中的名字拼法），可以告诉我它的来源或你看到它的句子，我可以按具体语境解释。","也有可能你想输入的是 “Foley” 而不是 “foleye”。如果你需要，我也可以对比常见近似拼写（Foley / folio / volley 等）帮你确认。"]}
{"word":"folgen","summary":{"en":"“folgen” is a German verb meaning “to follow,” and it can also mean “to happen next/ensue” or “to obey/comply.”","zh":"“folgen”是德语动词，意思是“跟随”，也可表示“随之发生/接着发生”或“遵从/照做”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(German, verb) to follow; to go after someone or something.","zh":"（德语，动词）跟随；跟在……后面。"},"examples":[{"en":"The dog follows its owner everywhere.","zh":"那只狗到处都跟着主人。"},{"en":"Please follow me to the meeting room.","zh":"请跟我到会议室。"}]},{"partOfSpeech":"v.","definition":{"en":"(German, verb) to result from; to come next; to ensue.","zh":"（德语，动词）随之发生；接着发生。"},"examples":[{"en":"A storm followed the hot day.","zh":"炎热的一天之后紧接着来了一场暴风雨。"},{"en":"If you skip practice, mistakes will follow.","zh":"如果你不练习，就会随之出现错误。"}]},{"partOfSpeech":"v.","definition":{"en":"(German, verb) to obey; to comply with rules or advice (often used with an object like instructions).","zh":"（德语，动词）遵从；照做（常接“指示/规则”等宾语）。"},"examples":[{"en":"Follow the instructions carefully.","zh":"请仔细遵照说明。"},{"en":"He didn’t follow the rules.","zh":"他没有遵守规则。"}]}],"synonyms":["follow","come after","ensue","obey","comply"],"phonetic":"/ˈfɔlɡən/","extraExplanation":["“folgen”是德语动词，常见变位：ich folge, du folgst, er/sie/es folgt；过去式 folgte；过去分词 gefolgt。","常见搭配：jemandem folgen（跟随某人），etwas folgen（某事随后发生），einem Rat/Regeln folgen（遵从建议/规则）。","对应英语最常见是 follow；在“随之发生”义时也可对应 ensue / come after（语境不同选择不同）。"]}
{"word":"folgerite","summary":{"en":"A fulgurite is natural glass made when lightning melts sand or soil.","zh":"fulgurite 指闪电把沙或土熔化后形成的天然玻璃状物（闪电熔岩管）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tube- or crust-shaped piece of natural glass formed when lightning strikes sand or soil and melts it.","zh":"闪电击中沙子或土壤并将其熔化后形成的天然玻璃状物，常呈管状或壳状。"},"examples":[{"en":"After the storm, they found a fulgurite in the sand near the beach.","zh":"暴风雨过后，他们在海滩附近的沙地里发现了一块闪电熔岩管。"},{"en":"A fulgurite is like nature’s “lightning fossil.”","zh":"闪电熔岩管就像大自然留下的“闪电化石”。"}]}],"synonyms":["lightning glass","lightning tube"],"phonetic":"/ˈfʊlɡjəˌraɪt/","extraExplanation":["你输入的 **folgerite** 多半是 **fulgurite** 的拼写误差；在科普、地质学语境中更常见的是 *fulgurite*。","词源来自拉丁语 *fulgur*（闪电）+ 后缀 *-ite*（矿物/岩石），因此字面意思就是“由闪电形成的矿物/物质”。","它通常内部是中空的（闪电通道留下的管状结构），外表可能粗糙、像烧结的沙子；颜色从浅褐到深色不等，取决于砂/土的成分。"]}
{"word":"folia","summary":{"en":"Folia usually means “leaves” (a Latin plural), and it can also refer to the well-known music theme “La Folia.”","zh":"Folia 通常指“叶子/叶状结构”（拉丁语复数），也可指著名的音乐主题“La Folia（佛利亚）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany/biology) Leaves; leaf-like parts (the plural of Latin-derived “folium”).","zh":"（植物学/生物学）叶子；叶状结构（源自拉丁语“folium”的复数）"},"examples":[{"en":"The cactus has reduced folia to conserve water.","zh":"仙人掌的叶（folia）退化以减少水分流失。"},{"en":"Some plants have thick, waxy folia that help them survive dry climates.","zh":"有些植物的叶片（folia）厚且有蜡质层，有助于在干旱气候中生存。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) “La Folia”: a famous old harmonic pattern and melody type used in many European compositions.","zh":"（音乐）“La Folia（佛利亚）”：欧洲音乐中著名的古老和声进行与旋律类型，许多作曲家都曾采用"},"examples":[{"en":"The violin piece is a set of variations on La Folia.","zh":"这首小提琴曲是以《La Folia》为主题的变奏曲。"},{"en":"Baroque composers often wrote dazzling variations on Folia.","zh":"巴洛克时期的作曲家常写出华丽的《Folia》主题变奏。"}]}],"synonyms":["leaves","leaflets","(music) La Folia","Folia theme"],"phonetic":"/ˈfoʊliə/","extraExplanation":["“folia”常见于学术或专业语境（如植物学、解剖学）中，日常英语更常说“leaves”。","音乐里的“La Folia/La Folía”大约起源于文艺复兴到巴洛克时期的舞曲传统，后来成为固定的和声框架与变奏主题；像科雷利（Corelli）、维瓦尔第（Vivaldi）等都写过相关作品。"]}
{"word":"foliaceous","summary":{"en":"Foliaceous means “leaflike,” often used in biology and geology to describe leaf-shaped forms or thin layered structures.","zh":"foliaceous 意为“叶状的/像叶子的”，多用于生物和地质语境，描述叶片般形态或薄片层状结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the form, texture, or arrangement of leaves; leaflike.","zh":"叶状的；像叶子的（形状、质地或排列）"},"examples":[{"en":"The moss has a foliaceous texture, spreading like tiny overlapping leaves.","zh":"这种苔藓呈叶状质地，像一片片细小的叶子重叠铺开。"},{"en":"Some corals look foliaceous, forming thin, leaflike plates.","zh":"有些珊瑚看起来呈叶状，会形成薄薄的、像叶片一样的板状结构。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Geology) Having a layered, sheetlike structure, often referring to minerals that split into thin leaves or layers.","zh":"（地质）具薄片状/层状结构的；常指矿物可分裂成薄如叶的层片"},"examples":[{"en":"Mica is a foliaceous mineral that can be peeled into very thin sheets.","zh":"云母是一种薄片状矿物，可以剥离成很薄的片。"},{"en":"The rock showed a foliaceous pattern, with layers visible along the surface.","zh":"这块岩石呈层片状纹理，表面能看到明显的层理。"}]}],"synonyms":["leaflike","foliate","laminated","layered"],"phonetic":"/ˌfoʊliˈeɪʃəs/","extraExplanation":["词源提示：foliaceous 来自拉丁语 folium（“叶子”）。在科学写作里常用来描述“像叶子一样的形态”或“薄片层状结构”，比 leaflike 更正式。","使用场景：常见于生物学（植物、苔藓、珊瑚等形态描述）和地质学（矿物/岩石的层片结构）。日常口语中不常用。"]}
{"word":"foliaceousness","summary":{"en":"Foliaceousness means the quality of being leafy or leaf-like in form.","zh":"foliaceousness 指“叶状性/叶质”，即具有叶子般形态或结构的特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being made of leaves, having leaf-like parts, or having a leafy (leaf-shaped) appearance.","zh":"叶状性；叶质；呈叶子般的特征（由叶构成、具有叶状部分或外观像叶子）。"},"examples":[{"en":"The botanist noted the foliaceousness of the plant’s bracts, which looked like small leaves.","zh":"植物学家注意到这株植物苞片的叶状性，看起来像一片片小叶子。"},{"en":"Under the microscope, the mineral showed a thin, layered foliaceousness.","zh":"在显微镜下，这种矿物呈现出薄而分层的叶状特征。"}]}],"synonyms":["leafiness","leaf-like quality","foliated character"],"phonetic":"/ˌfoʊliˈeɪʃəsnəs/","extraExplanation":["词源提示：来自形容词 foliaceous（“叶状的、似叶的”），再加名词后缀 -ness，表示“……的性质/状态”。","使用场景：多见于植物学、古生物学、地质/矿物学等较正式的描述中；日常英语更常用 leafy（叶茂的/多叶的）或 leaf-like（像叶子的）。"]}
{"word":"foliage","summary":{"en":"Foliage means the leaves of plants or trees, especially when viewed as a mass.","zh":"Foliage 指植物或树木的叶子，尤指成片可见的叶丛/树叶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Leaves on plants or trees, especially when seen together as a mass (often used in nature writing and everyday descriptions).","zh":"（植物或树木的）叶子；（尤指成片可见的）树叶、叶丛。"},"examples":[{"en":"The hillside was covered in autumn foliage.","zh":"山坡上覆盖着一片秋天的彩叶。"},{"en":"We planted shrubs to add more foliage to the garden.","zh":"我们种了灌木，让花园更有叶子、更茂盛。"}]}],"synonyms":["leaves","greenery","vegetation"],"phonetic":"/ˈfoʊ.li.ɪdʒ/","extraExplanation":["“foliage”通常是不可数名词，用来指“叶子（整体）”。若要表达“不同种类的叶子/植被”，可以说 “types of foliage”。","在园艺、景观设计和自然写作中很常见：如 “dense foliage（茂密的叶丛）”、“lush foliage（郁郁葱葱的叶子）”。","词源与拉丁语“folium（叶子）”有关；英语里与“leaf/ leaves”相比，“foliage”更偏正式，也更强调“成片的视觉效果”。"]}
{"word":"foliage-filled","summary":{"en":"“Foliage-filled” describes a place that is richly covered with leaves and greenery.","zh":"“foliage-filled”用来形容某处枝叶繁茂、绿意满满。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of foliage (many leaves and plants); richly covered with greenery.","zh":"充满枝叶与植物的；绿叶繁茂的、被绿意覆盖的。"},"examples":[{"en":"They walked through a foliage-filled garden behind the museum.","zh":"他们穿过博物馆后面一座绿叶繁茂的花园。"},{"en":"The cottage sat in a foliage-filled valley, hidden from the road.","zh":"小屋坐落在一片枝叶葱茏的山谷里，从路上几乎看不见。"},{"en":"In summer, the hillside becomes foliage-filled and bright green.","zh":"夏天时，山坡变得草木繁盛、一片翠绿。"}]}],"synonyms":["leafy","lush","green","verdant","covered in foliage"],"phonetic":"/ˈfoʊliɪdʒ fɪld/","extraExplanation":["这是一个由名词+过去分词构成的复合形容词（foliage + filled），通常用连字符放在名词前作定语：a foliage-filled park。放在系动词后作表语时，有时可不加连字符：The park is filled with foliage（更常见的说法是“filled with foliage”）。","语感上它比单独说“leafy/green”更强调“被枝叶塞满、覆盖很密”的画面感，常用于描写自然风景、庭院、山谷等。"]}
{"word":"foliage-leaved","summary":{"en":"“Foliage-leaved” means “leafy; having abundant leaves,” mainly used to describe plants.","zh":"“Foliage-leaved”指“多叶的、叶子繁茂的”，主要用来形容植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having many leaves; leafy (often used in descriptions of plants).","zh":"多叶的；叶子繁茂的（常用于描写植物）。"},"examples":[{"en":"A foliage-leaved shrub can provide shade and privacy in a garden.","zh":"多叶的灌木能在花园里提供遮阴和私密性。"},{"en":"The path was lined with foliage-leaved trees that stayed green through summer.","zh":"小路两旁是夏季一直葱绿的多叶树木。"}]}],"synonyms":["leafy","lush-leaved","well-leaved"],"phonetic":"/ˈfoʊliɪdʒ ˌlivd/","extraExplanation":["“foliage-leaved”不算特别常见，更常见的写法是“foliage-leaved plants/trees（多叶的植物/树）”或直接用“leafy”。在园艺或植物学语境里，它有时用来强调“是正常叶（f\\u200boliage leaves）而不是苞片/花叶（bracts）”。"]}
{"word":"foliage-related","summary":{"en":"“Foliage-related” means connected with plant leaves or leafy growth.","zh":"“foliage-related”意为“与（植物的）枝叶/叶子有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with foliage (the leaves of plants and trees) or the study/description of leaves in nature, gardening, art, etc.","zh":"与（植物、树木的）叶子/枝叶有关的；与描写或研究叶子有关的（用于自然、园艺、艺术等语境）。"},"examples":[{"en":"The museum has a foliage-related exhibit featuring leaf patterns in traditional textiles.","zh":"博物馆有一个与枝叶相关的展览，展示传统纺织品中的叶纹图案。"},{"en":"The app can identify foliage-related diseases by analyzing photos of leaves.","zh":"这个应用可以通过分析叶子的照片来识别与叶片相关的病害。"},{"en":"In autumn, many tourists come for foliage-related activities like leaf-peeping and hiking.","zh":"秋天，很多游客会来参加与赏叶有关的活动，比如观赏秋叶和徒步。"}]}],"synonyms":["leaf-related","leafy","vegetation-related","plant-related"],"phonetic":"/ˈfoʊliɪdʒ rɪˈleɪtɪd/","extraExplanation":["“Foliage-related”是由名词“foliage（枝叶、叶丛）+ related（相关的）”构成的复合形容词，常用于更正式或说明性的表达（如报告、展览介绍、产品说明）。日常口语里也常直接说“leaf-related（与叶子有关的）”或“about the leaves（关于叶子的）”。","在北美语境中，秋季“fall foliage（秋叶景色）”非常常见，因此你会看到“foliage-related tourism/activities（赏叶相关的旅游/活动）”这类搭配。"]}
{"word":"foliage-rich","summary":{"en":"Full of abundant leaves or greenery; heavily covered with plant growth.","zh":"叶子/植被很多、绿意浓、枝叶繁密。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a lot of leaves and plant growth; covered with abundant greenery.","zh":"树叶（植被）茂密的；绿色植物繁盛的。"},"examples":[{"en":"They chose a foliage-rich route through the park to stay cool in the shade.","zh":"他们选择了一条树叶茂密的公园路线，以便在树荫下保持凉爽。"},{"en":"The hotel is surrounded by foliage-rich gardens and tall trees.","zh":"酒店四周是植被茂密的花园和高大的树木。"}]}],"synonyms":["lush","leafy","green","verdant","dense","well-vegetated"],"phonetic":"/ˈfoʊliɪdʒ rɪtʃ/","extraExplanation":["“foliage-rich”是由名词“foliage（树叶；叶丛）”加上“rich（丰富的）”构成的复合形容词，常用连字符连接，用来更紧凑地描述“叶子很多、绿意浓”。在更正式或更常见的表达中，也可以说“lush（郁郁葱葱的）”“leafy（多叶的）”“dense with foliage（枝叶繁密）”。"]}
{"word":"foliaged","summary":{"en":"“Foliaged” means covered with leaves or having abundant leafy growth.","zh":"“foliaged”指“长满叶子、枝叶茂密的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with leaves; having a lot of leafy growth.","zh":"长满叶子的；枝叶茂密的。"},"examples":[{"en":"The foliaged hills looked bright green after the spring rains.","zh":"春雨过后，那些枝叶茂密的山丘显得格外翠绿。"},{"en":"We walked through a foliaged path where the trees formed a cool canopy.","zh":"我们走在一条树叶繁茂的小路上，树冠连成一片，十分阴凉。"}]}],"synonyms":["leafy","lush","verdant"],"phonetic":"/ˈfoʊliɪdʒd/","extraExplanation":["“foliaged”常见作形容词，表示“被树叶覆盖/枝叶繁茂”。它与名词“foliage（树叶；枝叶）”相关，常用于描写自然景观、园林、森林等，语气偏书面或文学描写。","有时也可理解为“带有（特定）叶形装饰的”，例如在建筑或艺术中指带叶状纹饰，但日常最常用的是“长满叶子的”这一义。"]}
{"word":"foliageous","summary":{"en":"Foliageous means “leafy” or “full of leaves.”","zh":"foliageous 意为“多叶的、枝叶繁茂的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a lot of leaves; leafy; covered with foliage.","zh":"叶子很多的；多叶的；被枝叶覆盖的。"},"examples":[{"en":"The path was shaded by foliageous trees on both sides.","zh":"小路两旁的多叶树木遮出一片阴凉。"},{"en":"After the rains, the hills turned green and foliageous.","zh":"雨后，山丘变得翠绿而多叶。"},{"en":"They built the cabin near a foliageous forest for privacy.","zh":"他们把小屋建在一片枝叶繁茂的森林旁，以获得私密感。"}]}],"synonyms":["leafy","lush","verdant","green","leaf-covered"],"phonetic":"/foʊˈliː.dʒəs/","extraExplanation":["“foliageous”较少见，更常用的表达是“leafy”（多叶的）或“lush”（繁茂的）。在写作中用它会显得更文学化、稍带古典气息。","词源上与“foliage”（树叶、枝叶）同根，来自拉丁语“folium”（叶子）。"]}
{"word":"foliages","summary":{"en":"“Foliages” is the plural of “foliage,” meaning plant leaves/leafy growth; the plural is less common and often used to mean different kinds of foliage.","zh":"“foliages”是“foliage”的复数，表示植物的枝叶；复数较少见，常用于强调不同种类的观叶植物/叶丛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Leaves of a plant or tree collectively; leafy growth.","zh":"（植物或树木的）叶子（总称）；枝叶、叶丛。"},"examples":[{"en":"The garden is famous for its autumn foliage.","zh":"这座花园因秋天的彩叶而闻名。"},{"en":"Dense foliage provided shade along the path.","zh":"茂密的枝叶为小路提供了阴凉。"},{"en":"A bird disappeared into the foliage.","zh":"一只鸟钻进了枝叶中不见了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Different kinds or areas of plant leaves, especially when talking about landscaping or decoration.","zh":"（较少用）不同种类的叶类植物/叶丛；常用于园艺、景观或装饰语境。"},"examples":[{"en":"They chose tropical foliages for the hotel lobby display.","zh":"他们为酒店大堂陈列选择了热带叶类植物。"},{"en":"Mix light and dark foliages to create contrast.","zh":"把浅色和深色的叶丛搭配起来制造对比。"}]}],"synonyms":["leaves","leafy growth","greenery","vegetation"],"phonetic":"/ˈfoʊliɪdʒ/","extraExplanation":["“foliage”通常是不可数名词（uncountable），表示“枝叶、叶子总称”，所以更常见的说法是“a lot of foliage / dense foliage”。“foliages”作为复数更少见，多用于园艺、景观设计等领域，强调“不同种类/不同片区的叶类植物”。","常见搭配：dense/lush foliage（茂密的枝叶）、autumn/fall foliage（秋叶/彩叶）、foliage plant（观叶植物）。"]}
{"word":"foliaging","summary":{"en":"Foliaging most commonly refers to the activity of searching for and gathering wild foods (often spelled “foraging”). Less commonly, it can relate to plants growing leaves (from “foliage”).","zh":"Foliaging 通常指在野外寻找并采集野生食物（更常见拼法为 foraging）。较少见时也可与“长叶/枝叶繁茂”（来自 foliage）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of searching for and collecting wild food or useful natural materials (such as berries, mushrooms, herbs, or edible plants)","zh":"（在野外）觅食；采集野生可食物或有用的自然资源（如浆果、蘑菇、香草、野菜等）"},"examples":[{"en":"We went foliaging for wild berries along the trail.","zh":"我们沿着小路去采集野生浆果。"},{"en":"Foliaging is popular in spring when many edible plants appear.","zh":"春天很多可食植物长出来时，觅食采集很受欢迎。"},{"en":"Before you go foliaging, learn which mushrooms are safe to eat.","zh":"去野外采集之前，要先学会分辨哪些蘑菇可以安全食用。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “foliage”: to cover with leaves or become leafy","zh":"“foliage”的现在分词：长叶；使（某处）被叶子覆盖、变得枝叶繁茂"},"examples":[{"en":"By early summer, the trees are fully foliaging.","zh":"到初夏时，树木已经长满叶子了。"},{"en":"The vines are foliaging over the fence.","zh":"藤蔓在篱笆上长满了叶子。"}]}],"synonyms":["foraging","wildcrafting","gathering"],"phonetic":"/ˈfoʊliˌeɪdʒɪŋ/","extraExplanation":["日常英文里更常见的拼法是 **foraging**（觅食/采集）；**foliaging** 有时会被用来特指“采集植物叶子类食材”或作为“foraging”的变体，但在正式或通用语境中建议优先用 **foraging**。","野外觅食在英语文化里常与“sustainable living（可持续生活）”“farm-to-table（从农场到餐桌）”等理念相连；但也强调安全与法规：不要在受保护区域采摘，避免误食有毒植物，并注意对生态环境的影响。"]}
{"word":"folial","summary":{"en":"“Folial” means “related to leaves,” mainly used in botanical or scientific contexts.","zh":"“Folial”意为“与叶子有关的”，主要用于植物学或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a leaf or leaves (especially in botany).","zh":"（尤指植物学中）与叶子有关的；叶的。"},"examples":[{"en":"Folial characteristics can help identify a plant species.","zh":"叶片特征可以帮助鉴定植物种类。"},{"en":"The researcher compared folial patterns under a microscope.","zh":"研究人员在显微镜下比较了叶片的纹理/形态。"}]}],"synonyms":["leaf-related","foliaceous","leafy (less formal)"],"phonetic":"/ˈfoʊliəl/","extraExplanation":["“folial”较常用于植物学或学术写作；日常英语更常说“leaf”或“leafy”（多叶的）。","词源来自拉丁语 *folium*（叶子），同根词有 *foliage*（树叶、叶丛）、*foliate*（长叶的；用叶形装饰）、*folio*（对开本；页）。","注意拼写：容易和“*floral*”（花的）混淆；*folial* 是“叶的”，*floral* 是“花的”。"]}
{"word":"foliar","summary":{"en":"Foliar mainly means “related to plant leaves,” often used in gardening and agriculture (e.g., foliar spray).","zh":"Foliar 主要表示“与植物叶片有关的”，常用于园艺与农业（如叶面喷施）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to leaves of a plant; occurring on or applied to leaves.","zh":"叶子的；与植物叶片有关的；发生在或施用于叶片上的。"},"examples":[{"en":"The farmer used a foliar spray to give the plants extra nutrients.","zh":"农民用了叶面喷施来给植物补充额外养分。"},{"en":"This disease causes foliar damage, so the leaves turn yellow and drop early.","zh":"这种病害会造成叶片损伤，所以叶子会发黄并提前脱落。"}]},{"partOfSpeech":"n.","definition":{"en":"A leaf, especially one in a book or manuscript (less common).","zh":"（较少用）一页；（尤指）书或手稿中的一张纸/一叶。"},"examples":[{"en":"The librarian found a torn foliar in the old manuscript.","zh":"图书管理员在那份古老手稿里发现了一页被撕破的纸。"}]}],"synonyms":["leaf","leafy","of the leaves"],"phonetic":"/ˈfoʊliər/","extraExplanation":["“foliar”来自拉丁语 folium（叶子）。在园艺和农业语境中非常常见，比如 foliar spray（叶面喷施）、foliar feeding（叶面施肥）、foliar disease（叶部病害）。","与之相关的常见搭配：foliage（叶子/枝叶的总称）、foliate（长叶的；有叶的/使长叶）、defoliate（使落叶/使脱叶）。"]}
{"word":"foliary","summary":{"en":"Foliary means “related to leaves or foliage,” often used in formal or artistic descriptions.","zh":"foliary 表示“与叶子/树叶有关的”，常用于较正式或艺术性的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to leaves or foliage; made of or decorated with leaf shapes.","zh":"与叶子或树叶（叶丛）有关的；由叶构成的；用叶形图案装饰的。"},"examples":[{"en":"The artist used foliary patterns to decorate the borders of the painting.","zh":"艺术家用叶形（foliary）图案来装饰画作的边框。"},{"en":"In the garden guide, you’ll see foliary details like leaf size and shape.","zh":"在园艺指南里，你会看到叶片大小和形状等叶部（foliary）细节。"}]}],"synonyms":["leafy","foliage-related","foliate (related)","botanical (broader)"],"phonetic":"/ˈfoʊliˌɛri/","extraExplanation":["“foliary”常见于植物学、园艺写作和艺术/建筑评论中（尤其是描述“叶形装饰”）。它比更常见的“leafy”更偏正式、更书面。","词源上与拉丁语“folium（叶子）”有关，同根词包括：foliage（树叶/叶丛）、foliate（有叶的/用叶形装饰的）、folio（书页，原义与“叶片/页”相关）。","文学与艺术语境里，常见搭配有“foliary ornament / foliary motif（叶形装饰/叶形母题）”，常用于描述中世纪手抄本边饰、哥特式建筑雕刻等。"]}
{"word":"foliate","summary":{"en":"Foliate means “to grow leaves” or “to decorate/make something with leaf-like patterns,” and it can also describe something as leafy or leaf-shaped.","zh":"Foliate 可指“长叶/生叶”，也可指“用叶形纹样装饰/使呈叶状”，还可作形容词表示“多叶的、叶状的”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to produce or develop leaves; to become leafy","zh":"长叶；生叶；变得枝叶繁茂"},"examples":[{"en":"In early spring, the trees begin to foliate.","zh":"早春时，树木开始长叶。"},{"en":"Warm, wet weather helps many plants foliate quickly.","zh":"温暖潮湿的天气会让许多植物很快长叶。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover, decorate, or shape with leaf-like patterns (often in art, architecture, or design)","zh":"用叶形图案覆盖/装饰；使呈叶状（常用于艺术、建筑或设计语境）"},"examples":[{"en":"The stone arch was foliated with carved vines and leaves.","zh":"那座石拱门上雕刻着藤蔓与叶片纹样作为装饰。"},{"en":"The designer chose a foliated border for the invitation.","zh":"设计师为请柬选了叶形花边。"}]},{"partOfSpeech":"adj.","definition":{"en":"leafy; having leaf-like parts or patterns","zh":"叶状的；多叶的；带叶形纹样的"},"examples":[{"en":"The cathedral columns have foliated capitals.","zh":"大教堂的柱头带有叶形雕饰。"},{"en":"We saw a foliated plant with wide, shiny leaves.","zh":"我们看到一种多叶植物，叶片宽大而有光泽。"}]}],"synonyms":["leaf out","become leafy","adorn","decorate","embellish","ornamented","leafy"],"phonetic":"/ˈfoʊliˌeɪt/","extraExplanation":["词源：来自拉丁语 folium（“叶子”）。因此它常见于较正式或文学/学术语境，而日常英语更常说 leaf out（长叶）或 leafy（多叶的）。","在建筑与艺术中，foliated 常用来形容“叶形雕刻/纹样”（比如柱头、边饰、石雕花纹），与 floral（花卉纹样）相近但更偏“叶子/藤蔓”元素。"]}
{"word":"foliated","summary":{"en":"Foliated means “having leaves or leaf-like parts,” and in geology it can mean “layered in thin sheets.”","zh":"foliated 常指“有叶的/呈叶状的”，在地质学中也可指“具片理、呈薄层状结构的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having leaves, or arranged like leaves; covered with leaf-like parts.","zh":"有叶的；呈叶状排列的；覆盖着叶状部分的。"},"examples":[{"en":"The plant has long, foliated stems that spread across the ground.","zh":"这种植物有细长的有叶茎，沿着地面蔓延。"},{"en":"In spring, the trees become fully foliated and the park turns green.","zh":"春天树木长满叶子，公园变得一片葱绿。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Geology) Having visible layers or a sheet-like structure, especially in certain metamorphic rocks.","zh":"（地质）具片理的；有明显层状或薄片状结构的（尤指某些变质岩）。"},"examples":[{"en":"Slate is a foliated rock that splits into thin sheets.","zh":"板岩是一种具片理的岩石，能劈裂成薄片。"},{"en":"The sample shows a strongly foliated texture under the microscope.","zh":"在显微镜下，这个样品呈现出明显的片理结构。"}]}],"synonyms":["leafy","leaf-covered","leaflike","layered","laminated"],"phonetic":"/ˈfoʊliˌeɪtɪd/","extraExplanation":["词源提示：foliated 来自拉丁语 folium（“叶子”）。在生物学里强调“长叶/叶状”，在地质学里则借用“像叶片一样一层层排列”的形象来描述岩石结构。"]}
{"word":"foliates","summary":{"en":"Foliates is usually the third-person singular form of foliate, meaning “to grow leaves,” “to decorate with leaf-like patterns,” or “to form layers (in geology).”","zh":"foliates 通常是动词 foliate 的第三人称单数形式，可指“长叶/抽叶”“用叶形纹样装饰”，或（地质）“形成片理层状结构”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a plant) to produce leaves; to put out leaves.","zh":"（植物）长出叶子；抽叶。"},"examples":[{"en":"In early spring, the trees begin to foliate after the last frost.","zh":"早春最后一场霜过后，树木开始抽叶。"},{"en":"These seedlings foliated quickly once they got enough light.","zh":"这些幼苗一旦光照充足，就很快长出了叶子。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover or decorate with leaf shapes or leaf-like patterns (often in art, architecture, or design).","zh":"（常用于艺术/建筑/设计）用叶形或类似叶子的图案装饰；加叶饰。"},"examples":[{"en":"The manuscript is foliated with gold leaf designs along the margins.","zh":"这份手稿的页边用金色叶饰图案装点。"},{"en":"The capital of the column is foliated with carved vines and leaves.","zh":"柱头雕刻了藤蔓与叶子纹样作装饰。"}]},{"partOfSpeech":"v.","definition":{"en":"to form thin layers or a layered structure, especially in geology (as in “foliated rock”).","zh":"（尤指地质）形成片理；呈层状结构（如“片理岩”）。"},"examples":[{"en":"Under pressure, some metamorphic rocks foliate into visible layers.","zh":"在压力作用下，一些变质岩会形成可见的片理层。"},{"en":"Slate is a foliated rock that splits into thin sheets.","zh":"板岩是一种片理岩，能劈成薄片。"}]}],"synonyms":["leaf out","sprout leaves","adorn","ornament","decorate","layer","laminate"],"phonetic":"ˈfoʊliˌeɪt","extraExplanation":["“foliate”来自拉丁语 folium（叶子）。在日常英语中它不算常用，更常见于植物学、艺术史与地质学语境。","在地质学里，foliated 常作形容词（如 foliated rock），表示岩石内部有“片理/层状”结构；学习时可把它联想到 fold（褶皱）与 layer（层）这类概念。"]}
{"word":"foliating","summary":{"en":"“Foliating” usually means “forming leaves” (in plants) or “developing layers” (in geology).","zh":"“foliating”通常指“长出叶子/形成叶状结构”（植物），或指“形成片理/层状构造”（地质）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of foliate) forming or producing leaves; becoming leafed.","zh":"（foliate 的现在分词）长出叶子；形成叶状结构。"},"examples":[{"en":"In spring, the trees are foliating quickly after the rain.","zh":"春天雨后，树木很快就开始长叶了。"},{"en":"The vine was foliating along the fence.","zh":"藤蔓沿着篱笆长出了叶子。"}]},{"partOfSpeech":"v.","definition":{"en":"(Geology) developing a layered structure (foliation) in rock, often under pressure.","zh":"（地质）岩石在压力等作用下形成片理/层状构造（foliation）。"},"examples":[{"en":"The metamorphic rock is foliating as minerals align under pressure.","zh":"随着矿物在压力下定向排列，这种变质岩正在形成片理。"},{"en":"In this region, schist is foliating strongly.","zh":"在这个地区，片岩的片理很明显。"}]}],"synonyms":["leafing","sprouting","forming leaves","layering (geology)","developing foliation"],"phonetic":"/ˈfoʊliˌeɪtɪŋ/","extraExplanation":["“foliating”在日常英语里并不常见；美妆护肤语境中人们更常说 **exfoliating**（去角质）。如果你想表达“去角质”，更自然的说法是 *exfoliating toner/scrub*（去角质爽肤水/磨砂）。","词根上 **foli-** 来自拉丁语 *folium*（叶子），所以 *foliate/foliating* 的核心意象是“叶子、叶状、层状”。"]}
{"word":"foliation","summary":{"en":"Foliation means a leaf-like arrangement or pattern—most commonly the way leaves are arranged on a stem, or layered banding in metamorphic rocks.","zh":"Foliation 指“叶状的排列或纹样”，常见于植物学的叶序，以及地质学中变质岩的层状片理结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The arrangement of a plant’s leaves (or similar structures) on a stem; leaf patterning.","zh":"（植物学）叶序；叶子在茎上的排列方式。"},"examples":[{"en":"Opposite foliation means two leaves grow at the same level on opposite sides of the stem.","zh":"对生叶序指两片叶子在同一高度、分别长在茎的两侧。"},{"en":"The field guide helps you identify plants by their foliation.","zh":"这本野外指南能帮助你通过叶序来辨认植物。"}]},{"partOfSpeech":"n.","definition":{"en":"In geology, a layered or banded structure in metamorphic rock, often created by pressure aligning minerals.","zh":"（地质学）片理；变质岩在压力作用下形成的层状或带状结构（矿物定向排列）。"},"examples":[{"en":"The slate shows strong foliation, so it splits into thin sheets.","zh":"这块板岩片理明显，所以容易劈成薄片。"},{"en":"Geologists look at foliation to understand how the rock was squeezed and heated.","zh":"地质学家会观察片理来判断岩石受挤压和受热的过程。"}]},{"partOfSpeech":"n.","definition":{"en":"A decorative pattern resembling leaves, often in art, architecture, or design.","zh":"（艺术/建筑）叶饰；类似叶片的装饰纹样。"},"examples":[{"en":"The column capitals feature foliation carved in stone.","zh":"柱头上有石雕的叶饰纹样。"},{"en":"The wallpaper uses foliation to create a classic, natural look.","zh":"这款壁纸用叶饰图案营造经典自然的感觉。"}]}],"synonyms":["leaf arrangement","leaf pattern","layering","banding","lamination"],"phonetic":"/ˌfoʊ.liˈeɪ.ʃən/","extraExplanation":["词源提示：foliation 来自拉丁语 folium（叶子）。因此在不同学科里都带有“叶状、层状、带状排列”的核心意象。","学习区分：植物学的 foliation 更强调“叶子如何长在茎上”；地质学的 foliation 强调“矿物被挤压后形成的层理/定向结构”。"]}
{"word":"foliato","summary":{"en":"“Foliato” is not a common English word; you probably mean “foliate/foliated,” relating to leaves or leaf-like decoration (and sometimes layered textures in geology).","zh":"“foliato”不是常见英语词；你可能想说“foliate/foliated”，与叶子或叶饰装饰有关（地质里也可指片理/层状纹理）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended) to cover with leaves or leaf-like ornament; to decorate with a leaf pattern (often in art, architecture, or book design).","zh":"（可能想表达）用叶子或叶状纹样覆盖/装饰；做成叶饰图案（常见于艺术、建筑或书籍装帧）。"},"examples":[{"en":"The stone column was foliated with carved vines and leaves.","zh":"那根石柱上雕刻了藤蔓和叶子纹样，做成了叶饰装饰。"},{"en":"The manuscript’s border is foliated with delicate gold patterns.","zh":"那份手稿的边框用精致的金色叶饰图案装点。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Botany/biology) to produce leaves; to become leafy.","zh":"（植物/生物）长出叶子；变得多叶。"},"examples":[{"en":"In spring, the trees begin to foliate quickly.","zh":"春天里，树木很快开始长叶。"},{"en":"The plant foliated after a week of warm weather.","zh":"暖和了一周后，那株植物开始长叶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective form: foliated) having a leaf-like pattern; arranged in thin layers (often in geology).","zh":"（形容词形式：foliated）具有叶状纹理的；（地质）呈薄层状排列的。"},"examples":[{"en":"We found foliated rock with clear banding.","zh":"我们发现了有明显条带的片理岩。"},{"en":"The designer chose a foliated motif for the wallpaper.","zh":"设计师为墙纸选了叶饰纹样。"}]}],"synonyms":["leafy","decorated with leaves","ornamented","embellish","adorn"],"phonetic":"/ˈfoʊli.eɪt/","extraExplanation":["“foliato”本身不太像常见英语单词，更像意大利语形式或拼写误差。英语里最接近、最常用的是 **foliate**（动词）和 **foliated**（形容词/过去分词）。如果你能提供看到它的句子或来源（书名、图片、课程内容），我可以帮你确认它到底是哪种用法。"]}
{"word":"foliator","summary":{"en":"A foliator is a person/device that numbers pages, or (less commonly) something that creates a layered structure (foliation).","zh":"foliator 指给文件编页码的人/设备；较少见时也指促成片理（层状结构）形成的因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or device that adds folio numbers (page numbers) to a book, manuscript, or document.","zh":"给书籍、手稿或文件加上页码（folio）的人员或设备。"},"examples":[{"en":"Before the archive scanned the letters, a foliator numbered every page in pencil.","zh":"在档案馆扫描这些信件之前，有人用铅笔把每一页都编了页码。"},{"en":"The shop used a mechanical foliator to mark invoices with page numbers.","zh":"那家店用机械式的页码机给发票标上页码。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that produces or promotes foliation (a layered or leaf-like structure), especially in geology or materials.","zh":"促成或形成“片理/层状结构”（foliation）的事物，尤用于地质或材料领域。"},"examples":[{"en":"In metamorphic rocks, pressure can act as a foliator and create visible layers.","zh":"在变质岩中，压力可能起到“成片理因素”的作用，形成可见的层理。"},{"en":"The researchers discussed which process was the main foliator in the sample.","zh":"研究人员讨论哪一种过程是该样品形成片理的主要因素。"}]}],"synonyms":["page numberer","pagination device","folio marker","agent of foliation"],"phonetic":"/ˈfoʊliˌeɪtər/","extraExplanation":["“foliator”来自词根 folio / foliate：folio 指“对开页、页码”，foliate 可表示“给书页编号”或“形成叶/层状结构（片理）”。因此 foliator 常指“编号页码的人/工具”，在专业语境里也可泛指“造成片理的因素”。","注意不要和更常见的“exfoliator（去角质产品/工具）”混淆：exfoliator 强调“去除表层”，而 foliator 通常与“编号”或“形成层状结构”有关。"]}
{"word":"foliature","summary":{"en":"Foliature usually means leaf-shaped decorative designs in art/architecture; more rarely, it can mean plant leaves (foliage).","zh":"foliature通常指艺术/建筑中的叶形装饰纹样；较少情况下也可指植物的叶子（同foliage）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Leafy decoration, especially a carved or painted design made of leaves and plant forms (often used in art and architecture).","zh":"叶饰；叶形装饰（尤指艺术或建筑中以树叶、植物形态雕刻或绘制的装饰图案）。"},"examples":[{"en":"The cathedral’s stone columns were covered with delicate foliature.","zh":"大教堂的石柱上布满了精致的叶形雕饰。"},{"en":"The frame is ornamented with gilded foliature and small flowers.","zh":"画框用镀金的叶饰和小花纹装点。"}]},{"partOfSpeech":"n.","definition":{"en":"The leaves of a plant; foliage (rare or formal use).","zh":"（植物的）叶子；叶丛（较少见或较正式用法）。"},"examples":[{"en":"In spring, the garden’s foliature becomes bright and dense.","zh":"春天时，花园里的叶丛变得明亮而茂密。"}]}],"synonyms":["foliage","leafage","leaf ornamentation","floral ornament","arabesque"],"phonetic":"/ˈfoʊliəˌtʃʊr/","extraExplanation":["“foliature”多见于艺术史、建筑史、装饰艺术的语境，强调“叶形纹样/装饰”，而日常谈“树叶/绿叶”更常用“foliage”。","词根来自拉丁语“folium（叶子）”。你可以把它理解为“leaf + decorative style（叶子+装饰风格）”。"]}
{"word":"folic","summary":{"en":"“Folic” means related to folate (vitamin B9), most commonly in “folic acid.”","zh":"“Folic”表示与叶酸/叶酸盐（维生素B9）有关，最常见于“folic acid（叶酸）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to folate (vitamin B9), especially in phrases like “folic acid,” a form of folate used in supplements and fortified foods.","zh":"与叶酸/叶酸盐（维生素B9）有关的，常见于“folic acid（叶酸）”，一种用于补充剂和强化食品中的叶酸形式。"},"examples":[{"en":"Many prenatal vitamins contain folic acid to support healthy fetal development.","zh":"许多孕期维生素含有叶酸，以支持胎儿健康发育。"},{"en":"Foods fortified with folic acid include some breads and breakfast cereals.","zh":"一些面包和早餐麦片等食品会添加（强化）叶酸。"}]}],"synonyms":["folate-related","vitamin B9-related"],"phonetic":"/ˈfoʊlɪk/","extraExplanation":["“Folic”几乎总是出现在固定搭配“folic acid”中；日常英语里更常用名词“folate/folic acid”，单独把“folic”当形容词用的场景相对少。","词源提示：fol- 来自拉丁语 folium（叶子），因为叶酸最早从菠菜等绿叶蔬菜中分离得到。"]}
{"word":"folie","summary":{"en":"Folie is a French loanword meaning either “madness” (literary/formal) or an ornamental garden building (architecture).","zh":"Folie是法语外来词，可指“疯狂”（文学/正式用法），也可指“园林中的装饰性建筑”（建筑语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"madness; a state of irrational behavior (often used in literary or formal contexts).","zh":"疯狂；非理性行为的状态（常见于文学或较正式语境）。"},"examples":[{"en":"In the novel, the hero’s jealousy turns into folie and ruins his life.","zh":"在小说中，男主的嫉妒变成了一种疯狂，毁了他的人生。"},{"en":"Some critics called the plan a folie—beautiful, but unrealistic.","zh":"一些评论家称这个计划是“疯狂之举”——很美，但不现实。"}]},{"partOfSpeech":"n.","definition":{"en":"an ornamental building in a garden or park, built mainly for decoration rather than practical use (architecture).","zh":"装饰性建筑（园林建筑）；主要为观赏而建、并非为了实用。"},"examples":[{"en":"They walked past a small stone folie at the edge of the estate garden.","zh":"他们走过庄园花园边缘一座小小的石质装饰亭。"},{"en":"In the 1700s, wealthy landowners sometimes built a folie to show taste and status.","zh":"在18世纪，一些富有的地主有时会修建装饰性建筑来展示品味与地位。"}]}],"synonyms":["madness","insanity","mania","folly","ornamental pavilion"],"phonetic":"/fəˈliː/","extraExplanation":["“folie”是法语外来词，来自法语“folie”（疯狂）。英语里多见于文学评论、艺术评论或较正式写作中，日常口语更常用“madness / insanity”。","园林建筑义的“folie”与“folly”关系密切：英语里更常见拼写是“folly”（同样可指“愚蠢的行为”或“装饰性建筑”）。在建筑与历史语境里偶尔会保留法语拼写“folie”。"]}
{"word":"folies","summary":{"en":"“Folies” is the plural of “folie,” meaning foolish/mad actions or, less commonly, ornamental garden buildings (similar to “follies”).","zh":"“Folies”是“folie”的复数，常指愚蠢/不理性的举动或一时疯狂；较少见时也可指园林中的装饰性建筑（类似“folly/follies”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “folie”) a foolish or irrational idea, action, or obsession; a moment of “madness” or extravagance.","zh":"（“folie”的复数）愚蠢或不理性的想法/行为/迷恋；一时的“疯狂”或奢靡之举。"},"examples":[{"en":"Buying another luxury bag felt like one of my folies.","zh":"又买一个奢侈包感觉像是我一时的“疯狂之举”。"},{"en":"His folies were harmless, but they sometimes worried his family.","zh":"他的那些“怪念头/癖好”并无恶意，但有时会让家人担心。"}]},{"partOfSpeech":"n.","definition":{"en":"(Architecture, less common in English) ornamental garden buildings or fanciful country retreats—similar to “follies.”","zh":"（建筑/园林用语，英语中较少见）装饰性的园林建筑或奇巧的乡间小屋；类似“folly（装饰性愚构）”。"},"examples":[{"en":"The estate is known for its small folies hidden among the trees.","zh":"这座庄园以藏在树林间的小型装饰性园林建筑而闻名。"},{"en":"They toured the park to see eighteenth-century folies and statues.","zh":"他们参观公园，去看十八世纪的装饰性小建筑和雕像。"}]}],"synonyms":["follies","foolishness","madness","eccentricities","obsessions","whims"],"phonetic":"/ˈfoʊliz/","extraExplanation":["“folie”是法语借词，字面与“疯狂、痴迷、愚行”相关；英语里更常见的对应词是“folly”（愚蠢；园林里的装饰性建筑）。","在文化语境中你可能会见到专有名词如“Folies Bergère”（法国巴黎著名歌舞表演场所）；此处“Folies”带有“热闹、放纵、轻狂娱乐”的色彩。"]}
{"word":"foliicolous","summary":{"en":"Foliicolous means “living or growing on leaves.”","zh":"foliicolous 指“生活在叶片上或生长在叶片表面的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living or growing on the surface of leaves (used especially in biology, botany, and mycology).","zh":"（尤用于生物学、植物学、真菌学）生活在叶片表面或生长在叶片上的。"},"examples":[{"en":"Some lichens are foliicolous, forming thin patches on tropical leaves.","zh":"有些地衣是叶生的，会在热带植物的叶片上形成薄薄的斑块。"},{"en":"The researcher recorded several foliicolous fungi on the underside of the leaves.","zh":"研究人员记录到几种叶生真菌生长在叶片背面。"}]}],"synonyms":["leaf-dwelling","leaf-inhabiting","on leaves"],"phonetic":"/ˌfoʊliˈɑːləs/","extraExplanation":["这个词比较学术，常见于研究论文或物种描述中，日常英语里很少用。","词源上可拆为：folii-（来自拉丁语 folium“叶子”）+ -colous（“栖居/生长于……的”，同源于“inhabit”相关概念）。","近义表达上，写作中也可能看到 on leaves / leaf-dwelling / leaf-inhabiting 等更直观的说法。"]}
{"word":"foliiferous","summary":{"en":"Foliiferous means “bearing or producing leaves,” used mainly in botanical descriptions.","zh":"foliiferous 指“生叶的/多叶的”，主要用于植物学或较正式的描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Bearing or producing leaves; leafy.","zh":"（植物）生叶的；多叶的；长叶的。"},"examples":[{"en":"In spring, the buds become foliiferous and the branches look fresh and green.","zh":"春天里，芽会变得生叶，树枝看起来清新翠绿。"},{"en":"This shrub is most attractive when it is fully foliiferous after the rainy season.","zh":"这灌木在雨季过后长满叶子时最漂亮。"}]}],"synonyms":["leafy","leaf-bearing","in leaf"],"phonetic":"/ˌfoʊliˈɪfərəs/","extraExplanation":["这是一个较少见、偏植物学的形容词，由拉丁语词根组成：folii-（叶，来自 folium“叶子”）+ -ferous（“携带/产生……的”，来自 ferre“携带”）。因此字面意思是“带叶的、产叶的”。","在现代日常英语里更常用的替代说法有：leafy（多叶的）、with leaves（有叶的）、in leaf（已长叶/处于叶期，常见于英式表达）。"]}
{"word":"foliiform","summary":{"en":"“Foliiform” means leaf-shaped or leaf-like, used mostly in scientific descriptions.","zh":"“foliiform”指“叶状的/像叶子的”，多用于科学或学术描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a leaf; leaf-like in form.","zh":"叶状的；形似叶子的。"},"examples":[{"en":"The plant has foliiform bracts that look like small leaves.","zh":"这种植物有叶状苞片，看起来像小叶子。"},{"en":"Under the microscope, the cells appeared foliiform—thin and leaf-like.","zh":"在显微镜下，这些细胞呈叶状——薄而像叶片。"}]}],"synonyms":["leaf-shaped","leaflike","foliaceous"],"phonetic":"/ˈfoʊliəˌfɔrm/","extraExplanation":["“foliiform”多见于植物学、解剖学或描述显微结构的学术语境。词根来自拉丁语：folium（叶）+ -form（形状），因此字面意思就是“叶子的形状”。写作中常用来精确描述结构外形，比一般的“leaf-shaped”更正式。"]}
{"word":"folily","summary":{"en":"Folily means “foolishly” or “in an unwise way,” but it is relatively rare in modern English.","zh":"folily 表示“愚蠢地/不明智地”，但在现代英语里比较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a foolish or unwise way; showing a lack of good judgment.","zh":"愚蠢地；不明智地；缺乏判断力地。"},"examples":[{"en":"He folily spent all his savings on a risky investment.","zh":"他愚蠢地把所有积蓄都花在一项高风险投资上。"},{"en":"She folily ignored the warning signs and kept driving.","zh":"她不明智地无视警告标志，仍继续开车。"}]}],"synonyms":["foolishly","unwisely","rashly","recklessly"],"phonetic":"/ˈfɑlɪli/","extraExplanation":["“folily”比较少见，更常用的说法是“foolishly”。它来自名词“folly”（愚行、蠢事），表示“以愚蠢/愚行的方式”。","在现代写作中，如果你想表达“做得很蠢/不明智”，用“foolishly”会更自然、更常见。"]}
{"word":"folio","summary":{"en":"A folio is a leaf/sheet in a book or manuscript, or a large book format; it can also mean a collected set of documents/works, and as a verb it means to number pages/leaves.","zh":"Folio 可指书或手稿中的一张纸/一叶（常含正反两面）、对开本的大开本书；也可指文件/作品等的汇编（类似 portfolio）；作动词可指给书或手稿编页码/标叶码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a single sheet of paper in a book or manuscript (often meaning one leaf, i.e., two pages: front and back)","zh":"（书或手稿中的）一张纸；一页（常指“一叶”，正反两面两页）"},"examples":[{"en":"The librarian found a missing folio in the old manuscript.","zh":"图书管理员在那本古老的手稿中发现缺了一张纸（少了一叶）。"},{"en":"Please turn to folio 12 for the illustration.","zh":"请翻到第12叶（或第12页）看插图。"}]},{"partOfSpeech":"n.","definition":{"en":"a large book size made by folding a printed sheet once (commonly called “folio” in publishing)","zh":"（出版印刷中）对开本；大开本（把一大张纸对折一次装订成书）"},"examples":[{"en":"The museum displayed a folio edition of the atlas.","zh":"博物馆展出了一套对开本的地图集。"},{"en":"Collectors often pay more for folio-size art books.","zh":"收藏者通常愿意为对开本的大型画册支付更高价格。"}]},{"partOfSpeech":"n.","definition":{"en":"a collection of work, documents, or financial holdings kept together in one place (a portfolio)","zh":"（文件或作品的）汇编/夹；（金融）资产组合（类似 portfolio）"},"examples":[{"en":"She organized her design folio before the interview.","zh":"面试前她整理了自己的设计作品集。"},{"en":"He reviewed the client’s investment folio for risk.","zh":"他审查了客户的投资组合以评估风险。"}]},{"partOfSpeech":"vt.","definition":{"en":"to number the pages or leaves of a manuscript or book","zh":"给（手稿或书）编页码/标叶码"},"examples":[{"en":"The archivist foliated the diary to make citation easier.","zh":"档案管理员给日记编了页码，方便引用。"}]}],"synonyms":["leaf","sheet","page (often, but not always equivalent)","volume","folio edition","portfolio (related)"],"phonetic":"/ˈfoʊlioʊ/","extraExplanation":["“folio”源自拉丁语 folium，意为“叶子”。因此在古书与手稿语境里，folio 常更接近“一叶纸”（正反两面），这也是为什么有时会感觉它和“page（页）”不完全等价。","文学与出版中很有名的例子是莎士比亚《First Folio》（1623），这是其戏剧作品的重要早期合集，对英语文学传播影响很大。"]}
{"word":"foliobranch","summary":{"en":"Foliobranch refers to an organism with leaf-like gills, or describes having such gills.","zh":"foliobranch 指具有叶片状鳃的动物，或形容“有叶状鳃”的特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) An animal (especially a type of sea slug or mollusk) that has leaf-like gills (branchiae) for breathing.","zh":"（动物学）具有叶片状鳃（branchiae，用于呼吸）的动物（尤指某些海蛞蝓或软体动物）。"},"examples":[{"en":"Many nudibranchs are foliobranchs, breathing through leaf-like gills on their backs.","zh":"许多裸鳃类海蛞蝓属于叶鳃型，通过背部叶片状的鳃呼吸。"},{"en":"The diver photographed a tiny foliobranch crawling over the coral.","zh":"潜水员拍到一只小小的叶鳃型动物在珊瑚上爬行。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having leaf-like gills; relating to organisms with leaf-shaped gill structures.","zh":"（形容）具有叶片状鳃的；与叶状鳃结构相关的。"},"examples":[{"en":"The species shows a foliobranch form of respiration.","zh":"该物种呈现叶鳃式的呼吸形态。"},{"en":"Researchers compared foliobranch and other gill types in the group.","zh":"研究人员比较了该类群中叶鳃型与其他鳃型。"}]}],"synonyms":["leaf-gilled","with leaf-like gills (phrase)"],"phonetic":"/ˈfoʊli.oʊˌbræŋk/","extraExplanation":["词源小提示：folio- 来自拉丁语，意为“叶”；-branch 源自希腊语 branchia，意为“鳃”。合起来就是“叶状鳃”。","这是偏专业的生物学词，常见于描述海洋无脊椎动物（如海蛞蝓/裸鳃类）的解剖结构与呼吸方式，在日常英语中很少使用。"]}
{"word":"foliobranchiate","summary":{"en":"“Foliobranchiate” means having leaf-like gills, a technical term used mainly in zoology.","zh":"“foliobranchiate”指“具叶状鳃的”，主要用于动物学等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having leaf-like gills (gill structures shaped like thin, flat “leaves”).","zh":"（动物）具叶状鳃的；鳃呈叶片状的。"},"examples":[{"en":"Many crustaceans have foliobranchiate gills that provide a large surface area for breathing.","zh":"许多甲壳动物有叶状鳃，能提供较大的呼吸表面积。"},{"en":"The paper describes the shrimp’s foliobranchiate gill arrangement under the microscope.","zh":"这篇论文描述了在显微镜下观察到的虾的叶状鳃排列。"}]}],"synonyms":["leaf-gilled","with leaf-like gills","phyllobranchiate (related term)"],"phonetic":"/ˌfoʊ.li.oʊˈbræŋ.ki.eɪt/","extraExplanation":["词源上可拆为 folio-（叶、叶片）+ branchia（鳃）。在动物学/分类学语境里常用来形容某些甲壳类（如虾、蟹等）的鳃形态；它更偏“技术词”，日常英语很少用。"]}
{"word":"foliocellosis","summary":{"en":"“foliocellosis” is not a standard English word; it is likely a misspelling or a coined term.","zh":"“foliocellosis”不是标准英语词；很可能是拼写错误或人为造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare term; it does not appear in major English dictionaries. It looks like a coined scientific-sounding word (folio- “leaf/page” + cell + -osis “condition”), but its meaning is not established in common English.","zh":"一个非标准或极罕见的词；在主要英语词典中通常查不到。它看起来像是人为拼造的“科学风”词（folio- 表示“叶/页” + cell “细胞” + -osis “……病/……状态”），但在英语中没有公认的含义。"},"examples":[{"en":"I couldn’t find “foliocellosis” in standard dictionaries; could it be a misspelling?","zh":"我在标准词典里找不到“foliocellosis”；会不会是拼写错误？"},{"en":"If this is from a medical report, ask the author for the exact spelling and context.","zh":"如果它来自医学报告，建议向作者确认准确拼写和上下文。"}]}],"synonyms":["(none—nonstandard term)"],"phonetic":"ˌfoʊ.li.oʊˌsɛlˈoʊ.sɪs","extraExplanation":["更可能的目标词（请对照你的原文拼写）：\n1) folliculosis /fəˌlɪk.jəˈloʊ.sɪs/：与“毛囊（follicle）”相关的病变/状态（医学用语较少见，但比 *foliocellosis* 更像真实词）。\n2) folliculitis：毛囊炎（更常见的医学词）。\n3) foliosis / foliosis：若出现在植物学或形态学语境，可能与“叶（folio-）”相关，但这也不常见。\n\n如果你把它出现的句子（或领域：医学/生物/材料/小说设定等）发来，我可以更准确判断它想表达的意思，并给出更合适的英文词和用法。"]}
{"word":"folioed","summary":{"en":"“Folioed” usually means pages/leaves have been numbered for reference, especially in archival or legal documents.","zh":"“Folioed”通常指文件或书的页面/纸叶已被编上页码，便于引用，常见于档案或法律语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of folio) To number the pages (or leaves) of a book, manuscript, or document.","zh":"（folio 的过去式/过去分词）给书、手稿或文件的页面（或纸叶）编号。"},"examples":[{"en":"The archivist folioed the manuscript so researchers could cite specific pages.","zh":"档案管理员给手稿编号，这样研究者就能引用具体页码。"},{"en":"Please check whether the contract has been properly folioed before filing it.","zh":"请在归档前检查合同是否已正确编号。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) Having pages or leaves numbered; marked with folio numbers.","zh":"（形容词）已编页码的；带有页码标记的。"},"examples":[{"en":"She consulted a folioed copy of the diary to track changes across entries.","zh":"她查阅了一份已编页码的日记副本，以追踪不同条目之间的变化。"},{"en":"We need the folioed version for accurate referencing in court.","zh":"法庭引用需要那份有页码的版本以确保准确。"}]}],"synonyms":["numbered","paginated","indexed (sometimes)"],"phonetic":"/ˈfoʊlioʊd/","extraExplanation":["“folio”在出版与文献工作中常见：既可以指“对（文件/书）编页码”（动词），也可以指一种大开本的装帧/版式（名词，如“folio edition”）。因此“folioed”多出现在档案、法律文书、图书馆与学术引用等语境中。","文化小知识：英语里很有名的《First Folio》（《莎士比亚第一对开本》，1623）使用的就是“folio”这种大开本概念；但“folioed”这个词本身更常指“已编页码”。"]}
{"word":"folioing","summary":{"en":"“Folioing” means numbering the pages/leaves of a document, or (less commonly) arranging text into folio format in printing/bookbinding.","zh":"“Folioing”指给文件的页面/叶编号；较少见时也指在印刷或装帧中按对开（folio）格式编排。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of numbering the pages (or leaves) of a manuscript, book, or document; adding folio numbers","zh":"给手稿、书籍或文件的页面（或叶）编号；添加页码（叶码）"},"examples":[{"en":"The archivist finished folioing the letters so researchers could cite them accurately.","zh":"档案管理员给这些信件逐页编号，方便研究者准确引用。"},{"en":"Before binding the volume, they spent an afternoon folioing each leaf in pencil.","zh":"装订成册之前，他们花了一下午用铅笔给每一叶编号。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of arranging or dividing text into folios (large sheets folded to make pages), especially in printing or bookbinding","zh":"（尤指印刷或装帧中）把文本按对开页（folio）来编排或分成若干对开张的过程"},"examples":[{"en":"In traditional printing, folioing affected how the pages would line up after folding.","zh":"在传统印刷中，按对开编排会影响纸张折叠后页面的对齐方式。"},{"en":"The workshop included a short lesson on folioing and other binding basics.","zh":"这次工坊还简要讲解了按对开编排以及其他装订基础。"}]}],"synonyms":["numbering pages","adding page numbers","pagination","leaf numbering"],"phonetic":"/ˈfoʊlioʊɪŋ/","extraExplanation":["“folio”原本指一种书的开本（对开本），也可指“页/叶”的编号（folio number）。在档案与古籍整理中，常区分 page（页面）与 leaf（叶：一张纸的正反两面）。因此有时会给“叶”编号，而不是给每一面编号。","现代英语里“folioing”多见于档案、图书馆学、古籍整理与装帧语境；日常写作更常用 “numbering the pages / adding page numbers”。"]}
{"word":"foliolate","summary":{"en":"Foliolate means “having leaflets,” and in botany it can also mean “to form leaflets.”","zh":"foliolate 指“具小叶的”；在植物学中也可作动词，表示“形成小叶/分裂成小叶”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having leaflets (a leaf divided into small leaf-like parts).","zh":"（植物学）具小叶的；叶片分裂成若干小叶的。"},"examples":[{"en":"Many legumes have foliolate leaves, meaning each “leaf” is made of several leaflets.","zh":"许多豆科植物有具小叶的叶子，也就是说每一片“叶”由多片小叶组成。"},{"en":"The plant’s foliolate structure helps you tell it apart from species with simple leaves.","zh":"这种植物的具小叶结构能帮助你把它与单叶（不分裂成小叶）的物种区分开。"}]},{"partOfSpeech":"v.","definition":{"en":"To form into leaflets; to become divided into leaflets.","zh":"形成小叶；（叶）分裂成小叶。"},"examples":[{"en":"As the seedling grows, the first true leaves begin to foliolate.","zh":"随着幼苗生长，第一批真叶开始分裂成小叶。"}]}],"synonyms":["compound-leaved","leafleted","pinnate (type)","palmate (type)"],"phonetic":"/foʊˈliəˌleɪt/","extraExplanation":["“foliolate”常见于植物学描述，用来对比“simple leaf（单叶）”与“compound leaf（复叶）”。复叶由多个“leaflet（小叶）”组成；注意：小叶通常没有腋芽（axillary bud），而整片叶在叶柄与茎连接处才有腋芽。","词源上与拉丁语 folium（叶子）相关；在野外识别植物时，看到三出复叶（trifoliolate）或羽状复叶等结构，经常会用到这个词。"]}
{"word":"foliole","summary":{"en":"A foliole is a small leaflet, especially one that is part of a compound leaf.","zh":"foliole 指“小叶”，尤其指复叶上的小叶片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small leaf or leaf-like part, especially one of the small leaflets that make up a compound leaf","zh":"小叶；（尤指）复叶上的小叶片"},"examples":[{"en":"A clover leaf has three folioles.","zh":"三叶草的叶子由三个小叶组成。"},{"en":"Under the microscope, each foliole shows a clear network of veins.","zh":"在显微镜下，每个小叶都能看到清晰的叶脉网。"}]}],"synonyms":["leaflet","pinnule (technical)"],"phonetic":"/ˈfoʊliˌoʊl/","extraExplanation":["“Foliole”是植物学用词，常用于描述“复叶（compound leaf）”的结构：整片复叶由多个“小叶（folioles / leaflets）”组成。日常英语里更常用的是“leaflet”，而“foliole”更偏学术或植物分类描述。"]}
{"word":"folioliferous","summary":{"en":"Folioliferous means “having leaflets,” used mainly in botanical descriptions.","zh":"folioliferous 指“具小叶的”，主要用于植物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) bearing or having leaflets (folioles), especially on a compound leaf.","zh":"（植物学）具小叶的；生有小叶（folioles）的，尤指复叶上的小叶。"},"examples":[{"en":"Many legumes have folioliferous leaves with several leaflets.","zh":"许多豆科植物的叶是具小叶的，由多片小叶组成。"},{"en":"The specimen is described as folioliferous, with three leaflets per leaf.","zh":"该标本被描述为具小叶的，每片叶有三枚小叶。"}]}],"synonyms":["compound-leaved","having leaflets","pinnate (in some contexts)"],"phonetic":"/ˌfoʊliəˈlɪfərəs/","extraExplanation":["这是一个非常少见、偏学术的植物学形容词，常见于分类描述或标本记录中；日常英语里更常用的是 compound-leaved（复叶的）或 having leaflets（有小叶的）。","词源上可拆为 foliole（小叶）+ -ferous（“携带/产生……的”）。“-ferous”也见于 coniferous（针叶树的/结球果的）等词。"]}
{"word":"foliolose","summary":{"en":"“foliolose” is a rare botanical adjective meaning “having small leaflets; composed of leaflet-like parts.”","zh":"“foliolose”是较少见的植物学形容词，意思是“具小叶的；由小叶状部分组成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, rare) Having small leaflets (folioles); made up of many leaflet-like parts.","zh":"（植物学，较少用）具小叶（folioles）的；由许多小叶状部分组成的。"},"examples":[{"en":"The plant has a foliolose leaf structure, with several tiny leaflets on one stem.","zh":"这种植物的叶子呈 foliolose（具小叶的）结构，一根叶柄上有好几片细小的小叶。"},{"en":"In some descriptions, the fronds are called foliolose because they look divided into many little leaflets.","zh":"在一些描写中，这些叶状体被称为 foliolose，因为它们看起来被分成许多小小的叶片。"}]}],"synonyms":["compound-leaved","leaflet-bearing","pinnate"],"phonetic":"/ˌfoʊliəˈloʊs/","extraExplanation":["“foliolose”是相对生僻的植物学形容词，来自“foliole（小叶）”。在更常见的英文植物描述里，人们通常会用“compound leaves（复叶）”“pinnate（羽状复叶）”或“leaflet-bearing（具小叶的）”来表达相近意思。"]}
{"word":"folios","summary":{"en":"“Folios” usually means pages/sheets in a book (especially in manuscripts), and it can also refer to large-format books or sets of pages in archives or printing.","zh":"“Folios”通常指书或手稿中的“页/纸张”（一张纸常算两页），也可指大开本书籍，或档案/印刷中的一组页面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of folio: a single sheet of paper in a book (often counted as two pages, front and back)","zh":"folio 的复数：书中的一张纸（通常正反两面合计为两页）"},"examples":[{"en":"The manuscript is missing three folios near the end.","zh":"这份手稿在末尾附近少了三张纸（folios）。"},{"en":"Each folio is numbered by hand in old books.","zh":"在旧书里，每一张纸（folio）常常是手写编号的。"}]},{"partOfSpeech":"n.","definition":{"en":"a large book or a book made in a large format (folio size)","zh":"开本很大的书；或指“大开本”（folio size）的书"},"examples":[{"en":"The library keeps the art folios in a special cabinet.","zh":"图书馆把那些大开本艺术画册（folios）放在专门的柜子里。"}]},{"partOfSpeech":"n.","definition":{"en":"a section or collection of pages (especially in publishing, archives, or printing)","zh":"（尤用于出版、档案或印刷）一组页面；一册/一叠页"},"examples":[{"en":"The archive catalog lists the letters by folios and date.","zh":"档案目录按页册（folios）和日期来列出这些信件。"}]}],"synonyms":["pages","leaves","sheets","manuscript pages","large-format books"],"phonetic":"/ˈfoʊlioʊz/","extraExplanation":["“folio”源自拉丁语 folium（叶子/纸页）。因此它常和书籍、手稿、档案、印刷相关，强调“像叶子一样的一张纸”。","在古籍与学术引用中，folio 常用于标注位置：例如“f. 12r / f. 12v”，r 表示正面（recto），v 表示背面（verso）。复数 folios 常见于描述缺页、装订、档案编号等情境。"]}
{"word":"foliose","summary":{"en":"Foliose means “leafy” or “leaf-like,” especially describing organisms such as lichens with flat, leaf-shaped lobes.","zh":"Foliose 意为“叶状的/像叶子的”，常用于描述地衣等生物具有扁平的叶状裂片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Leafy or leaf-like in shape; having many thin, flat lobes or layers (often used in biology, especially for lichens and algae).","zh":"叶状的；像叶子一样的；具有许多薄而扁平的裂片或层（常用于生物学，尤指地衣、藻类）。"},"examples":[{"en":"Foliose lichens often look like small leaves spreading over rocks or tree bark.","zh":"叶状地衣常常看起来像小叶片一样，铺展在岩石或树皮上。"},{"en":"The scientist described the organism as foliose, with broad, flat branches.","zh":"科学家把这种生物描述为叶状的，具有宽而扁平的分枝。"}]}],"synonyms":["leafy","leaf-like","foliaceous"],"phonetic":"/ˈfoʊ.li.oʊs/","extraExplanation":["“foliose”多见于自然科学语境，尤其是地衣分类：常与“crustose（壳状）”“fruticose（枝状/灌木状）”并列，用来描述地衣外形。","词源来自拉丁语“folium（叶子）”，因此与“foliage（叶子/叶丛）”“foliate（长叶的；用叶形装饰）”有同源关系。"]}
{"word":"foliosity","summary":{"en":"“Foliosity/foliosity” most commonly means a layered, sheet-like texture in rocks; very rarely it can mean “leafiness.”","zh":"“foliosity/foliosity”最常见指岩石的片状层理（片理）；极少数情况下可指“叶片繁茂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; usually spelled “foliosity”) The quality of being arranged in thin layers or sheets, especially in metamorphic rocks (a layered texture).","zh":"（罕见；通常拼作“foliosity”）呈薄层或片状排列的性质，尤指变质岩中的片理/层状构造。"},"examples":[{"en":"The geologist identified the rock by its strong foliosity and shiny layers of mica.","zh":"地质学家通过岩石明显的片理和云母发亮的层状结构来辨认它。"},{"en":"Pressure and heat can create foliosity as minerals line up into sheets.","zh":"压力和高温会使矿物定向排列成片，从而形成片理。"}]},{"partOfSpeech":"n.","definition":{"en":"The state of having many leaves; leafiness (very uncommon in modern English).","zh":"多叶的状态；叶片繁茂（现代英语中极少用）。"},"examples":[{"en":"In early descriptions of gardens, writers sometimes praised the foliosity of the trees.","zh":"在早期的园林描写中，作者有时会称赞树木的“叶繁”。"}]}],"synonyms":["foliation","layering","lamination","leafiness"],"phonetic":"/ˌfoʊliˈɑsəti/","extraExplanation":["“foliosity”在现代英语里非常少见；在地质学语境中，主流拼写是“foliosity”。如果你是在读地质或材料相关文本，建议优先使用“foliosity”，更容易被读者理解与检索。","词源提示：与拉丁语 folium（叶子）有关，因此既能引申为“多叶”，也能在地质中表示“像叶片一样成片的结构”。"]}
{"word":"foliot","summary":{"en":"A foliot is an early clock regulator: a weighted bar that swings back and forth to control timekeeping.","zh":"foliot 指早期机械钟的调速部件：带配重的横杆来回摆动以控制走时。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A horizontal bar with adjustable weights used in early mechanical clocks to regulate the speed of the escapement (especially in medieval verge-and-foliot clocks), before the pendulum and balance spring became common.","zh":"（钟表）摆轮出现之前，早期机械钟（尤其中世纪的“擒纵叉—横摆杆”结构）中用来调节擒纵机构速度的水平横杆，两端常带可移动的配重。"},"examples":[{"en":"The museum’s medieval clock uses a foliot instead of a pendulum.","zh":"博物馆里的那座中世纪机械钟用的是横摆杆（foliot），而不是钟摆。"},{"en":"By sliding the weights on the foliot, the clockmaker could make the clock run faster or slower.","zh":"钟匠通过移动横摆杆上的配重，就能让钟走得更快或更慢。"}]}],"synonyms":["verge-and-foliot regulator","clock regulator (early)"],"phonetic":"/ˈfoʊliˌɑt/","extraExplanation":["foliot 常出现在“verge-and-foliot escapement（擒纵叉—横摆杆擒纵机构）”这个搭配里，是中世纪塔钟和早期座钟常见的调速部件。","它的计时精度通常不如后来的“pendulum（钟摆）”或“balance wheel（摆轮）”，因此在17世纪以后逐渐被更稳定的调速系统取代。"]}
{"word":"folious","summary":{"en":"Folious (rare) means “leafy” or “leaf-like,” and sometimes describes something arranged in thin, leaf/page-like layers.","zh":"folious（较少见）意为“多叶的/叶状的”，有时也形容“像书页/叶片一样薄层叠”的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Leafy; having many leaves or shaped like leaves.","zh":"多叶的；叶状的。"},"examples":[{"en":"The folious branches made the street feel cooler in summer.","zh":"那些多叶的树枝让夏天的街道感觉更凉爽。"},{"en":"Some ferns have a very folious appearance.","zh":"有些蕨类植物看起来非常叶状。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Made of, consisting of, or arranged in thin layers or sheets (like leaves/pages).","zh":"（罕见）由薄层/薄页构成的；呈页状分层排列的。"},"examples":[{"en":"The mineral sometimes forms folious layers.","zh":"这种矿物有时会形成页状薄层。"},{"en":"The old book had a folious texture to its pages.","zh":"那本旧书的纸页有一种页状分层的质感。"}]}],"synonyms":["leafy","foliaceous","leaf-like"],"phonetic":"/ˈfoʊliəs/","extraExplanation":["“folious”在现代英语中很少见，更常见的相关词是“foliage（树叶/叶子）”“foliaceous（叶状的）”或“leafy（多叶的）”。如果你是在科学/植物学语境里看到，很多时候作者更倾向用“foliaceous”。","词源上来自拉丁语“folium（叶子）”。因为“leaf”也可以指“书页”，所以在较少见的用法里，“folious”也可引申为“像纸页一样薄层叠”的意思。"]}
{"word":"foliously","summary":{"en":"“Foliously” means “leafily” or “in a leafy manner,” describing something covered with or full of leaves.","zh":"“Foliously”意为“叶子般地/多叶地”，用于描写枝叶繁茂或呈叶状的样子。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a leafy way; with many leaves or resembling leaves.","zh":"叶子般地；多叶地；呈叶状地。"},"examples":[{"en":"The garden grew foliously after the spring rains.","zh":"春雨过后，花园长得郁郁葱葱、多叶繁茂。"},{"en":"Vines climbed foliously over the old fence.","zh":"藤蔓沿着旧篱笆爬得枝叶繁盛。"}]}],"synonyms":["leafily","lushly","in leafy growth"],"phonetic":"/ˈfoʊliəsli/","extraExplanation":["“foliously”非常少见，更常见的表达是“leafily”或“with lots of leaves / in leafy growth”。","词源上来自拉丁语“folium”（叶子）。你也可能在更常见的相关词里见到同一词根：foliage（树叶、叶丛）、foliated（有叶状结构的/成层的）。","使用场景：多见于较文学化或描写自然景观的写作中，用来营造“繁茂、绿意盎然”的画面感。"]}
{"word":"folium","summary":{"en":"Folium is a formal/academic word meaning “leaf,” and it can also mean a “leaf/sheet” of a complex mathematical surface.","zh":"folium 是较正式/学术的词，意为“叶子”；在数学中也可指复杂曲面的“一叶/一层”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A leaf; especially used in scientific or Latin-based names and descriptions.","zh":"（植物学）叶子；常用于科学术语或拉丁语体系的命名与描述中。"},"examples":[{"en":"In Latin, the word for “leaf” is folium.","zh":"在拉丁语中，“叶子”这个词是 folium。"},{"en":"The textbook uses folium to describe a single leaf structure.","zh":"这本教材用 folium 来描述单个叶片结构。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mathematics) A “leaf” or layer of a complex surface (for example, a sheet of a Riemann surface).","zh":"（数学）复杂曲面的一“叶”或一层（例如黎曼曲面的一个分支层/片）。"},"examples":[{"en":"Each folium represents one branch of the multi-valued function.","zh":"每个 folium 代表这个多值函数的一个分支层。"},{"en":"The curve can be described as having two folia in this model.","zh":"在这个模型中，这条曲线可描述为有两个 folia（两“叶”）。"}]}],"synonyms":["leaf","sheet (math context)","layer (math context)"],"phonetic":"/ˈfoʊliəm/","extraExplanation":["folium 源自拉丁语，基本义就是“叶子”。英语里它多见于学术/专业语境，而日常英语通常直接说 leaf。","复数常见两种形式：拉丁式复数 folia（更常见，尤其在学术写作中）以及英语化复数 foliums（也可用）。","在数学里把某些结构称为“leaf/folium”，是借用“树叶分层”的意象：同一整体表面像由多片“叶”叠加或分支组成。"]}
{"word":"foliums","summary":{"en":"“Foliums” is the plural of “folium,” meaning leaves or leaf-like folds/layers (often in science), and it can also refer to a math curve (the folium of Descartes).","zh":"“Foliums”是“folium”的复数，常指叶子或叶状的褶皱/层（多见于科学语境），也可指一种数学曲线（笛卡尔叶形线）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A leaf; sometimes used in scientific writing for a leaf-like part of a plant.","zh":"（植物学）叶；在科学写作中也可指植物中“叶状”的部分。"},"examples":[{"en":"The microscope showed tiny foliums on the aquatic plant.","zh":"显微镜下可以看到那种水生植物上有很小的叶（foliums）。"},{"en":"Some species have foliums that are thick and waxy to reduce water loss.","zh":"有些物种的叶（foliums）厚且带蜡质，以减少水分流失。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A thin, leaf-like fold or layer of tissue, especially in the brain (e.g., the cerebellar folia).","zh":"（解剖学）薄的、叶片状的组织褶皱或层；常指大脑中的小脑叶片状褶皱（如小脑 folia）。"},"examples":[{"en":"The scan revealed the pattern of foliums in the cerebellum.","zh":"扫描显示了小脑中叶片状褶皱（foliums）的纹理。"},{"en":"These foliums increase the surface area of the tissue.","zh":"这些叶片状褶皱（foliums）增加了组织的表面积。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mathematics) A specific type of curve, as in the well-known “folium of Descartes.”","zh":"（数学）一种特定的曲线类型，如著名的“笛卡尔叶形线（folium of Descartes）”。"},"examples":[{"en":"In class, we graphed the folium of Descartes.","zh":"课堂上我们画出了笛卡尔叶形线。"},{"en":"The folium has a loop that makes it easy to recognize.","zh":"这种叶形线有一个环状部分，很容易辨认。"}]}],"synonyms":["leaves","leaflets","folds","layers","folia"],"phonetic":"/ˈfoʊliəm/","extraExplanation":["“Folium”来自拉丁语，意思是“叶子”。在现代英语中多用于专业语境（植物学、解剖学、数学），日常英语更常直接用“leaf”。","复数传统形式是“folia”（读作类似 FOH-lee-uh），但你输入的“foliums”也是可用的英语复数形式，尤其在非严格拉丁复数的写作中。","在神经解剖里常见搭配是“cerebellar folia（小脑叶片状褶皱）”，强调“像叶子一样一片片折叠”的结构。"]}
{"word":"folivore","summary":{"en":"A folivore is an animal that mainly eats leaves.","zh":"folivore 指主要以树叶为食的动物（食叶动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a leaf-eating animal; an animal whose diet is mostly leaves","zh":"食叶动物；主要以树叶为食的动物"},"examples":[{"en":"Koalas are famous folivores that eat eucalyptus leaves.","zh":"考拉是著名的食叶动物，主要吃桉树叶。"},{"en":"Because leaves are low in energy, many folivores spend a lot of time resting.","zh":"因为树叶能量含量低，许多食叶动物会花很多时间休息。"}]}],"synonyms":["leaf-eater","herbivore"],"phonetic":"/ˈfoʊlɪˌvɔr/","extraExplanation":["“folivore”来自拉丁语词根：foli-（叶子）+ -vore（吃……的）。相关形容词是“folivorous”（食叶的）。","在生态学里，这个词常用来描述以叶片为主食的动物（如考拉、树懒、部分猴类）。因为叶子纤维多、能量低，这类动物往往需要更长的消化时间或更慢的生活节奏。"]}
{"word":"folivorous","summary":{"en":"Folivorous describes animals that mainly eat leaves.","zh":"Folivorous 用来形容主要以叶子为食的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal) feeding mainly on leaves; leaf-eating.","zh":"（指动物）主要以叶子为食的；食叶的。"},"examples":[{"en":"Koalas are folivorous mammals that rely heavily on eucalyptus leaves.","zh":"考拉是食叶性的哺乳动物，主要依赖桉树叶为食。"},{"en":"Because the leaves are low in energy, many folivorous animals spend long hours resting.","zh":"因为叶子的能量较低，许多食叶动物会花很长时间休息。"},{"en":"Some monkeys are partly folivorous, especially during seasons when fruit is scarce.","zh":"有些猴子在水果稀少的季节会部分以叶子为食。"}]}],"synonyms":["leaf-eating","folivorous (used in scientific writing)"],"phonetic":"/fəˈlɪvərəs/","extraExplanation":["词源提示：folivorous 来自拉丁语 folium（叶子）+ -vorous（“吃……的”，同源于 devour“吞食”）。因此它字面意思就是“吃叶子的”。","使用场景：常见于动物学、生态学文章，用来描述以叶子为主要食物来源的物种（如考拉、树懒、某些灵长类）。日常口语中更常说 leaf-eating。"]}
{"word":"folk","summary":{"en":"Folk means “people” (often ordinary people), a particular group (including “my folks” = my parents), or “traditional” in culture (folk music, folk tales).","zh":"folk可指“人们/大众”、某一类人（如my folks=父母），也可作形容词表示“民间的、传统的”（如folk music、folk tales）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people in general (often referring to ordinary people in a community); can be friendly and informal in tone","zh":"人们；大众（常指普通民众或某个社区的人，语气可亲切、口语化）"},"examples":[{"en":"The local folk are very welcoming to visitors.","zh":"当地人对游客很热情。"},{"en":"Some folks think the new rule is unfair.","zh":"有些人觉得新规定不公平。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular group of people connected by family, place, culture, or interest","zh":"（有共同联系的）一群人；某类人（按家庭、地区、文化或兴趣划分）"},"examples":[{"en":"City folk sometimes find farm life challenging.","zh":"城里人有时会觉得农场生活很不适应。"},{"en":"My folks live in Chicago.","zh":"我父母住在芝加哥。"}]},{"partOfSpeech":"adj.","definition":{"en":"traditional, passed down through generations (often used in phrases like “folk music” and “folk tales”)","zh":"民间的；传统的（常见于 folk music/folk tales 等搭配）"},"examples":[{"en":"She collects folk songs from different regions.","zh":"她收集不同地区的民歌。"},{"en":"This is a folk tale told to children for centuries.","zh":"这是一个流传了几个世纪、讲给孩子听的民间故事。"}]}],"synonyms":["people","folks","community","traditional"],"phonetic":"/foʊk/","extraExplanation":["“folks”在美式英语里非常常见，语气通常更口语、更亲近；对陌生人说“Hi, folks!”多用于非正式场合。若在非常正式的写作里，常用“people”更稳妥。","“my folks”在口语里经常指“我的父母”，但在某些语境也可能泛指“我的家人”。","“folk”作形容词时常与文化传统相关：folk music（民谣/民间音乐）、folk art（民间艺术）、folk medicine（民间疗法）。"]}
{"word":"folk song","summary":{"en":"A folk song is usually a traditional community song passed down over time, and it can also mean a song written in a folk style.","zh":"folk song 通常指代代相传的传统民歌，也可指具有民谣风格的歌曲。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A traditional song that comes from ordinary people in a community, often passed down orally and reflecting local life, history, or values.","zh":"民歌：源自民间、常由普通民众创作与传唱的传统歌曲，常以口耳相传，反映地方生活、历史或价值观。"},"examples":[{"en":"My grandmother taught me a folk song from her hometown.","zh":"我奶奶教我一首她家乡的民歌。"},{"en":"Many folk songs tell stories about work, love, and travel.","zh":"许多民歌讲述劳动、爱情与远行的故事。"},{"en":"The festival ended with everyone singing a folk song together.","zh":"节日以大家一起合唱民歌作结。"}]},{"partOfSpeech":"phrase","definition":{"en":"A song in the folk-music style (often with acoustic instruments and simple melodies), even if it is newly written.","zh":"民谣风格歌曲：指具有民谣音乐风格（常用原声乐器、旋律简洁）的歌曲，即使是新创作的也可这样称呼。"},"examples":[{"en":"He writes folk songs with guitar and harmonica.","zh":"他用吉他和口琴写民谣风格的歌曲。"},{"en":"This sounds like a modern folk song, not an old traditional one.","zh":"这听起来像一首现代民谣风格歌曲，而不是古老的传统民歌。"}]}],"synonyms":["traditional song","folk tune","ballad"],"phonetic":"/ˈfoʊk sɔŋ/","extraExplanation":["“folk song”既可以指“传统民歌”（强调民间传承、地区文化），也常被用来泛指“民谣歌曲”（强调音乐风格）。在语境里若出现“traditional/old/handed down”等词，通常更偏向“传统民歌”；若谈到吉他、独立音乐人、创作等，则多偏向“民谣风格”。","文化上，许多国家的民歌常与劳动、移民、抗争、节庆和地方方言有关；它们有时没有明确作者，因为会在传唱中不断变化。"]}
{"word":"folk-country","summary":{"en":"Folk-country is a genre that mixes folk and country music styles.","zh":"folk-country 指融合民谣与乡村音乐特色的一种音乐风格/类型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A style of music that blends folk music (storytelling lyrics, acoustic instruments) with country music (country rhythms, themes, and vocal style).","zh":"一种融合民谣（重叙事、原声乐器）与乡村音乐（节奏、主题与唱腔）的音乐风格。"},"examples":[{"en":"Their new album is folk-country, with acoustic guitar and simple, heartfelt stories.","zh":"他们的新专辑是民谣乡村风：以原声吉他为主，讲述朴实真挚的故事。"},{"en":"She grew up on folk-country and learned to sing harmonies from old records.","zh":"她从小听民谣乡村音乐，跟着老唱片学会了和声演唱。"}]},{"partOfSpeech":"n.","definition":{"en":"Music in the folk-country style; folk-country songs as a genre.","zh":"民谣乡村风格的音乐；作为一种类型的民谣乡村歌曲。"},"examples":[{"en":"I’ve been listening to a lot of folk-country lately.","zh":"我最近听了很多民谣乡村音乐。"},{"en":"The festival booked indie rock, blues, and some folk-country.","zh":"音乐节邀请了独立摇滚、布鲁斯，还有一些民谣乡村音乐人。"}]}],"synonyms":["country-folk","folk-country music","Americana (broader)"],"phonetic":"/ˌfoʊk ˈkʌntri/","extraExplanation":["“folk-country”常用于描述两种传统风格的“混合带”（blend）。在美国语境中，它可能让人联想到讲故事的歌词、原声吉他/班卓琴/小提琴等配器，以及乡村音乐常见的生活主题（家乡、旅途、爱情、失落等）。","与相近说法相比：\n- “country folk”常指更偏乡村的民谣取向；\n- “Americana”范围更大，可能包含蓝草、乡村、民谣、摇滚等多种根源音乐。具体用哪个词，取决于音乐更像哪一边。"]}
{"word":"folk-etymological","summary":{"en":"Folk-etymological describes a popular but mistaken idea about a word’s origin, or a form changed by such a misunderstanding.","zh":"folk-etymological 指与“民间词源”相关：大众误解词源，或词因这种误解而发生改形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a “folk etymology”: a popular but incorrect explanation of a word’s origin, or a change in a word’s form caused by such a misunderstanding.","zh":"与“民间词源”（folk etymology）有关的：指大众流行但不正确的词源解释，或因这种误解而导致词形发生变化。"},"examples":[{"en":"The spelling change was driven by a folk-etymological misunderstanding of the word.","zh":"这个拼写变化是由对该词的民间词源式误解造成的。"},{"en":"Some dictionaries label this form as folk-etymological rather than historically accurate.","zh":"一些词典把这种形式标注为“民间词源式”的，而非历史上准确的形式。"},{"en":"The story that the word comes from a famous person is a folk-etymological tale.","zh":"“这个词来自某位名人”的说法是一种民间词源式的传说。"}]}],"synonyms":["folk-etymology-related","popular-etymology (related)","pseudo-etymological"],"phonetic":"/ˌfoʊk ˌɛtəˈmɑlədʒɪkəl/","extraExplanation":["“folk-etymological”常用于语言学与词典学语境，强调“人们以为是这样来的”，但与真实历史演变不一致。","典型现象包括：为了让词“更像熟悉的词”而改写、改读。例如英语里有些词后来被拼写成更像另一个常见词的样子，这种改形就是民间词源作用的结果。"]}
{"word":"folk-inspired","summary":{"en":"Folk-inspired describes something shaped by traditional folk culture, especially in music, art, or design.","zh":"folk-inspired 指受民间传统文化影响的风格，常用于音乐、艺术或设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Influenced by traditional folk culture (such as folk music, stories, crafts, or design), often with a simple, rustic, or traditional feel.","zh":"受民间传统文化（如民谣、故事、手工艺或设计）影响的；带有朴素、传统风格的。"},"examples":[{"en":"They released a folk-inspired album with acoustic guitar and storytelling lyrics.","zh":"他们发行了一张民谣风格的专辑，用原声吉他和叙事性的歌词。"},{"en":"The café has folk-inspired decorations—handmade textiles and wooden carvings.","zh":"这家咖啡馆的装饰很有民间风格——手织布艺和木雕。"},{"en":"Her folk-inspired dress uses patterns common in Eastern European embroidery.","zh":"她那件民间风格的裙子采用了东欧刺绣中常见的图案。"}]}],"synonyms":["folk-influenced","folk-style","folk-inflected","traditional-inspired","rustic"],"phonetic":"/ˈfoʊk ɪnˈspaɪrd/","extraExplanation":["“folk-inspired”常用于音乐、时尚、室内设计、插画等领域，强调“借鉴民间传统元素”，但不一定是严格的“纯民俗/原生态（authentic folk）”。","语气通常是积极的，带有“质朴、手作感、怀旧、贴近土地与传统”的联想。","相关搭配：folk-inspired melody/design/patterns/decor; 近义表达可用 folk-influenced, folk-style, folk-inflected（更偏音乐评论用语）。"]}
{"word":"folk-like","summary":{"en":"Folk-like describes something that resembles folk traditions—simple, traditional, and earthy in style.","zh":"folk-like 指“带民间/民俗风格的”，整体感觉朴素、传统、接地气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling folk music, folk art, or folk traditions; simple, traditional, and “of the people” in style.","zh":"具有民间风格的；像民谣、民间艺术或民俗传统那样朴素、传统、带有“来自民间/大众”的气质。"},"examples":[{"en":"The singer’s voice has a folk-like warmth that suits acoustic songs.","zh":"这位歌手的嗓音有一种民谣般的温暖，很适合原声歌曲。"},{"en":"They decorated the café with folk-like patterns and hand-painted signs.","zh":"他们用民间风格的图案和手绘招牌装饰了这家咖啡馆。"},{"en":"The film’s soundtrack feels folk-like, even though it uses modern instruments.","zh":"这部电影的配乐有民间味道，尽管使用了现代乐器。"}]}],"synonyms":["folksy","rustic","traditional","vernacular","homespun"],"phonetic":"/ˈfoʊkˌlaɪk/","extraExplanation":["“folk-like”是由 folk（民间的、民俗的）+ like（像……的）构成的复合形容词，常见于艺术评论中，用来形容一种“质朴、传统、接地气”的审美感觉。","使用场景很广：除了音乐（旋律、唱法、乐器），也可形容绘画、图案、故事叙述方式、服饰设计等带有民俗/传统手工感的风格。"]}
{"word":"folk-moot","summary":{"en":"A historical term for a community assembly where local people met to discuss and decide public matters.","zh":"指历史上的地方民众集会，用于讨论并决定公共事务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) A public meeting or assembly of local people—especially in Anglo-Saxon or medieval England—held to discuss community business and make decisions.","zh":"（历史用语）民众大会；地方居民的公共集会（尤指盎格鲁-撒克逊或中世纪英格兰，用于讨论社区事务并作出决定）。"},"examples":[{"en":"In Anglo-Saxon England, the folk-moot could hear disputes and announce local rules.","zh":"在盎格鲁-撒克逊时期的英格兰，民众大会可以审理纠纷并公布地方规章。"},{"en":"The novel describes villagers gathering at the folk-moot to decide how to share the harvest.","zh":"小说描写村民在民众大会上聚集，决定如何分配收成。"}]}],"synonyms":["public assembly","town meeting","moot","council"],"phonetic":"/ˈfoʊkˌmut/","extraExplanation":["“moot”在古英语语境里常与“会议/集会”有关（如 *moot court* 模拟法庭）。因此 *folk-moot* 字面意思接近“人民的集会”。","该词带有强烈历史色彩，现代英语里多见于历史书写、古风文学或讨论早期地方治理（local governance）的语境。"]}
{"word":"folk-style","summary":{"en":"“Folk-style” describes something with a traditional, local folk look or sound, especially in music, art, clothing, or food.","zh":"“folk-style”指具有民间传统风格的事物，常用于音乐、艺术、服饰或饮食等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made in a traditional, local, or “folk” way; showing the look, sound, or feeling of folk art, folk music, or rural traditions.","zh":"具有民间传统风格的；呈现民间艺术、民谣或乡土传统的外观、声音或氛围。"},"examples":[{"en":"They performed a folk-style song with acoustic guitar and simple harmonies.","zh":"他们用木吉他和简单和声演唱了一首民谣风格的歌曲。"},{"en":"The restaurant serves folk-style dishes based on regional recipes.","zh":"这家餐厅供应以地方食谱为基础的民间风味菜肴。"},{"en":"She wore a folk-style dress with embroidered patterns.","zh":"她穿了一条带刺绣图案的民俗风连衣裙。"}]}],"synonyms":["traditional","folk-inspired","rustic","vernacular"],"phonetic":"/ˈfoʊk staɪl/","extraExplanation":["“folk-style”常用于描述音乐、服装、装饰、艺术或料理的“乡土/民间传统感”。在音乐里，它常让人联想到原声乐器（如吉他、小提琴、班卓琴等）、叙事性歌词和朴素自然的唱法。","用法上多作定语：a folk-style band / folk-style decorations。也可写作folk style（不加连字符）或folk-styled（更强调“被设计成某风格”）。","相近表达：folk-inspired（受民间风格启发，可能更现代/混搭）、traditional（传统的，更广泛，不一定“民间”）、rustic（乡村质朴的，偏“乡野”感觉）。"]}
{"word":"folkboat","summary":{"en":"A folkboat is a small, seaworthy sailboat design, especially the Nordic Folkboat, used for cruising and racing.","zh":"folkboat指一种小型、适航性强的帆船船型（尤指北欧民用帆船），常用于巡航与竞赛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, sturdy sailing boat design (especially the Nordic Folkboat), known for being seaworthy and used for cruising and racing","zh":"一种小型、结实、适航性强的帆船（尤指“北欧民用帆船”Nordic Folkboat），常用于巡航和比赛"},"examples":[{"en":"They learned to sail on a folkboat because it handles rough water well.","zh":"他们用一艘folkboat学习航海，因为它在风浪中操控性很好。"},{"en":"The club held a weekend regatta for folkboats on the bay.","zh":"俱乐部在海湾举办了folkboat周末帆船赛。"}]}],"synonyms":["Nordic Folkboat","sailboat","day sailer","keelboat"],"phonetic":"/ˈfoʊkˌboʊt/","extraExplanation":["“Folkboat”常指“Nordic Folkboat（北欧民用帆船）”，起源于20世纪中期的斯堪的纳维亚地区，最初目标是设计一款价格相对可负担、结构可靠、适合普通人航行的帆船。","在英文语境里它通常作为专有名词或船型名称使用；写作中你也会看到拼写为“Folkboat”或“folk boat”（较少见）。","它常与“one-design class（统一设计级别）”的比赛文化相关：同一船型、相近配置，比赛更强调技巧而非装备差异。"]}
{"word":"folkcraft","summary":{"en":"Folkcraft means traditional handmade crafts that reflect a community’s culture.","zh":"folkcraft 指体现地方文化与传统的民间手工艺/手工制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Traditional handmade art or objects made by ordinary people in a local community, often reflecting local culture and history.","zh":"民间手工艺；由当地普通人传统手工制作的艺术品或物件，常体现地方文化与历史。"},"examples":[{"en":"The museum has a room full of Appalachian folkcraft.","zh":"这家博物馆有一间展室专门展示阿巴拉契亚地区的民间手工艺。"},{"en":"She learned folkcraft from her grandmother, like quilting and simple weaving.","zh":"她跟奶奶学了民间手工艺，比如拼布和简单的织造。"},{"en":"Local markets are a great place to buy folkcraft and support artisans.","zh":"逛本地集市是购买民间手工艺、支持手艺人的好方式。"}]}],"synonyms":["traditional crafts","handicraft","folk art"],"phonetic":"/ˈfoʊkˌkræft/","extraExplanation":["在英语里，folkcraft 常与 folk art（民间艺术）一起出现。folkcraft 更强调“手工技艺/工艺品”（如编篮、木雕、陶器、拼布），而 folk art 的范围更广，也可能包括绘画、音乐、舞蹈等。","在北美语境中，你可能会在博物馆、文化节（heritage festival）、工艺展（craft fair）里看到 folkcraft，用来指代具有地域传统与代际传承的手工制作。"]}
{"word":"folkfree","summary":{"en":"“Folkfree” is a nonstandard, informal word that can mean either “open/free to everyone” or “not in a traditional folk style,” depending on context.","zh":"“folkfree”属于非标准、偏口语/网络的用法，可指“对大众免费/开放”，也可指“不是传统民谣风格”，具体看语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Free for ordinary people; open to everyone; not restricted or exclusive.","zh":"（非正式、非标准用法）对普通大众免费或开放的；不受限制、非专属的。"},"examples":[{"en":"The workshop is folkfree—anyone can join without paying.","zh":"这个工作坊是 folkfree 的——任何人都可以免费参加。"},{"en":"They want the museum to be more folkfree and welcoming to local families.","zh":"他们希望博物馆更 folkfree，更欢迎本地家庭。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard, arts) Not in a traditional folk style; free from folk conventions or “folky” sound.","zh":"（非正式、非标准用法，艺术/音乐）不走传统民谣风；不受“民谣风格”束缚的。"},"examples":[{"en":"Her new album is more electronic and folkfree than her earlier songs.","zh":"她的新专辑更偏电子，也比早期作品更 folkfree（不那么民谣）。"},{"en":"The band describes their sound as folkfree pop.","zh":"这支乐队把自己的风格称为“folkfree 流行”。"}]}],"synonyms":["open to everyone","free to the public","accessible","nonexclusive","not folky","unconventional"],"phonetic":"/ˈfoʊkˌfriː/","extraExplanation":["“folkfree”不是常见的标准英语词，更像是网络用语、品牌名、标题或个人造词。在正式写作中建议改成更清晰的表达。","如果你想表达“对大众免费/开放”，更自然的说法有：free to the public, open to everyone, free of charge, accessible to all。","如果你想表达“没有民谣味/不受民谣风格限制”，可以说：not folky, folk-influenced but not folk, beyond folk conventions。","拼写上也常见用连字符写成“folk-free”，读者更容易理解为复合形容词。"]}
{"word":"folkie","summary":{"en":"“Folkie” is an informal word for a folk-music person (performer or fan), and it can also describe something with a folk-music style.","zh":"“Folkie”是个非正式词，指民谣音乐圈的人（表演者或爱好者），也可形容带有民谣风格的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who plays, sings, or is very interested in folk music.","zh":"（非正式）民谣音乐的演唱者/演奏者，或非常喜欢民谣的人。"},"examples":[{"en":"My uncle is a folkie—he plays guitar at local folk nights.","zh":"我叔叔是个民谣迷（或民谣歌手）——他会在当地的民谣之夜弹吉他。"},{"en":"The festival is full of folkies swapping songs and stories.","zh":"音乐节到处都是民谣圈的人，大家互相分享歌曲和故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Related to folk music or the folk-music scene.","zh":"（非正式）与民谣音乐或民谣圈有关的。"},"examples":[{"en":"It’s a folkie vibe—acoustic guitars and simple melodies.","zh":"这很有民谣圈的氛围——原声吉他加上简单的旋律。"},{"en":"They played a folkie version of the pop song.","zh":"他们把那首流行歌改编成了更“民谣味”的版本。"}]}],"synonyms":["folk singer","folk musician","folk fan","folk-music lover"],"phonetic":"/ˈfoʊlki/","extraExplanation":["“folkie”多用于英语口语，常让人联想到20世纪60年代美国/英国的民谣复兴（folk revival），例如咖啡馆小舞台、原声乐器、注重歌词叙事的风格。","在语气上通常是中性或带点亲切感，但在特定语境里也可能被用来轻微调侃“民谣圈的人”。"]}
{"word":"folkies","summary":{"en":"“Folkies” is an informal plural noun meaning folk-music fans/musicians, and sometimes people with a folksy, traditional style.","zh":"“folkies”是非正式复数名词，指民谣音乐的乐迷/从业者，也可泛指风格朴实、传统、带乡土复古气的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) People who perform, enjoy, or are strongly involved in folk music; folk-music fans or musicians.","zh":"（非正式）民谣/民间音乐圈的人；演奏、喜爱或深度参与民谣（folk music）的人（歌手、乐手或乐迷）。"},"examples":[{"en":"The coffeehouse was packed with folkies singing along to old protest songs.","zh":"那家咖啡馆挤满了民谣圈的人，大家跟着老抗议歌曲一起唱。"},{"en":"In the 1960s, folkies helped bring traditional ballads back into the spotlight.","zh":"在20世纪60年代，民谣圈的人让传统民歌（叙事歌谣）重新受到关注。"},{"en":"She used to tour festivals with a group of folkies from the local scene.","zh":"她以前和本地民谣圈的一群人一起巡演各类音乐节。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) People who seem “folksy” in style—friendly, simple, and traditional in a way that feels rural or old-fashioned.","zh":"（非正式）看起来很“folk/folksy”的人——风格朴实、亲切、传统，带点乡村或复古气息。"},"examples":[{"en":"The shop attracts folkies who like handmade quilts and local crafts.","zh":"这家店吸引那些喜欢手工被子和本地工艺品的朴实派人群。"},{"en":"He calls them folkies because they prefer old recipes and homegrown produce.","zh":"他叫他们“folkies”，因为他们更喜欢老式食谱和自家种的农产品。"}]}],"synonyms":["folk-music fans","folk musicians","folk singers","folksy people","traditionalists"],"phonetic":"/ˈfoʊkiz/","extraExplanation":["“folkies”是口语、非正式用法，常见于谈论英语国家的民谣文化圈（如咖啡馆演出、民谣音乐节、60年代民谣复兴等）。在语气上多为中性或带点亲切感，但也可能被用来轻微调侃某群体的穿着/品味“很民谣、很复古”。","与其相关的常见说法：folk music（民谣/民间音乐）、the folk scene（民谣圈）、folksy（朴实的、乡土味的）、folk singer（民谣歌手）。"]}
{"word":"folkish","summary":{"en":"Folkish means “having a traditional, rustic folk style,” often used for art, design, music, or atmosphere.","zh":"folkish 指“具有民间风格、朴素传统/乡土气息”，常形容艺术、设计、音乐或整体氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the simple, traditional, or rustic style associated with ordinary people and local culture; like “folk” art, music, or stories.","zh":"具有民间（folk）风格的；带有朴素、传统、乡土气息的（如民间艺术、音乐或故事）。"},"examples":[{"en":"The café has a folkish charm, with handmade quilts and wooden tables.","zh":"这家咖啡馆有一种民间风的魅力：手工拼布被和木桌让人感觉很朴素。"},{"en":"Her illustrations use folkish patterns inspired by rural festivals.","zh":"她的插画采用了受乡村节庆启发的民间纹样。"}]},{"partOfSpeech":"adj.","definition":{"en":"In some contexts, relating to or characteristic of a particular ethnic or national group’s traditions (less common).","zh":"（较少见）与某个民族或国家群体的传统相关的；具有某群体民俗特征的。"},"examples":[{"en":"The exhibition explores folkish traditions from different regions of Eastern Europe.","zh":"这个展览探讨了东欧不同地区的民俗传统。"}]}],"synonyms":["folksy","rustic","traditional","folkloric","homespun"],"phonetic":"/ˈfoʊ.kɪʃ/","extraExplanation":["“folkish”由“folk（民间、民众）+ -ish（有点……的、带……风格的）”构成，语气通常比“folk”更强调“风格像、带点……味道”，常用于描述装饰、设计、音乐、叙事的氛围。","注意：在个别语境里，“folkish”可能被用得较随意，建议在正式写作中更多使用更常见的“folk”或“folkloric”（偏“民俗学/民俗传统”）来避免歧义。"]}
{"word":"folkishness","summary":{"en":"Folkishness means the quality of being folk-like—simple, traditional, rustic, and connected to folk culture.","zh":"Folkishness 指“民间风格/民俗气息”的特质：朴素、传统、乡土，并与民俗文化相连。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being folkish—having the simple, traditional, rural, or “of the people” style often associated with folk culture (songs, stories, crafts, speech, etc.)","zh":"具有“民间风格”的特质——带有常见于民俗文化（民歌、传说、手工艺、口语等）的朴素、传统、乡土或“属于大众”的气息"},"examples":[{"en":"The museum redesigned the room to increase its folkishness, using handmade quilts and wooden tools.","zh":"博物馆重新布置了展厅来增强民间风格，用了手工拼布被和木制工具。"},{"en":"Some critics felt the film’s folkishness made it warm and approachable, even if it was not very modern.","zh":"一些影评人觉得这部电影的民间气息让它温暖、亲切，尽管它不太现代。"},{"en":"Her writing has a quiet folkishness, like a story told by a grandparent.","zh":"她的写作有一种安静的民间质感，像长辈讲出来的故事。"}]}],"synonyms":["folk character","rustic charm","traditional feel","folksiness","homespun quality"],"phonetic":"ˈfoʊkɪʃnəs","extraExplanation":["“folkishness”由 folk（民众/民间）+ -ish（带有……的、稍微……的）+ -ness（名词后缀，表示“……性/特质”）构成，常用来评价风格或氛围，而不是指某个具体的“民俗”。","这个词在日常英语中不算常见，更常见的表达有“folk quality / rustic charm / traditional feel”。“folkish”有时会带一点“刻意营造的乡土感/民俗感”的意味，具体褒贬取决于语境。"]}
{"word":"folkland","summary":{"en":"“Folkland” is a rare, poetic word meaning a people’s homeland, or a folklore-like imagined realm.","zh":"“folkland”是罕见且偏诗意的词，可指某族群的故土/家园，也可指带民间传说氛围的想象世界。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, poetic) The homeland or country of a particular people (“folk”); a people’s native land.","zh":"（罕见、带诗意）某一族群（folk）的“家园/故土”；一个民族的国土。"},"examples":[{"en":"In the old ballad, the hero returns to his folkland after years at sea.","zh":"在那首古老的民谣里，英雄漂泊多年后回到自己的故土。"},{"en":"They spoke of protecting the folkland and keeping its traditions alive.","zh":"他们谈到要守护家园，让传统延续下去。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, creative writing) An imagined realm shaped by folklore, traditional stories, and rural life.","zh":"（罕见、文学/创作语境）由民间传说、传统故事与乡土生活构成的想象世界。"},"examples":[{"en":"The novel opens in a misty folkland where every hill has a legend.","zh":"小说开篇是一个雾气弥漫的民俗世界，每一座山丘都有传说。"},{"en":"Her paintings turn the countryside into a bright, dreamlike folkland.","zh":"她的画把乡村变成了明亮、梦幻的民间世界。"}]}],"synonyms":["homeland","native land","fatherland","home country","mythic realm","folklore world"],"phonetic":"/ˈfoʊkˌlænd/","extraExplanation":["“folkland”不是现代英语里的常用词，更常见的说法是“homeland（故乡/祖国）”“native land（故土）”“fatherland（祖国，带更强政治/历史色彩）”。因此它多见于诗歌、民谣风格文字，或奇幻/民俗题材的创作中，用来营造古朴、传说感的氛围。","构词上可理解为 folk（民众/族群/民间）+ land（土地/国土）。如果你在标题、人名、地名中看到“Folkland”，也可能是专有名词（比如项目、社群、品牌、虚构国度名），具体含义需看上下文。"]}
{"word":"folklike","summary":{"en":"“Folklike” means having the style or feeling of folk traditions, such as folk tales or songs.","zh":"“folklike”指具有民间传统（如民间故事或民谣）风格或氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In the style of traditional folk stories, folk songs, or folk art; simple, traditional, and often reflecting the culture of ordinary people.","zh":"具有民间传说、民谣或民间艺术风格的；朴素、传统，常反映普通人的文化与生活。"},"examples":[{"en":"The novel has a folklike tone, with repeating patterns and simple moral lessons.","zh":"这本小说有一种民间故事般的语气，有重复的结构和简单的道德寓意。"},{"en":"She sang a folklike melody that sounded as if it had been passed down for generations.","zh":"她唱了一段民谣般的旋律，听起来像是世代流传下来的。"}]}],"synonyms":["folkloric","folk-style","folk-inspired","traditional-sounding"],"phonetic":"/ˈfoʊkˌlaɪk/","extraExplanation":["“folklike”由 folk（民间的）+ like（像……的）构成，多用于描述作品的“氛围/风格”，如 tone（语气）、melody（旋律）、motif（母题）、tale（故事）。","它常带有“口耳相传、朴素、带有传统智慧或寓意”的联想，但不一定表示内容真实来自民间；也可能是作者刻意采用的民间风格（folk-inspired）。","近义表达可用：folkloric（更正式，偏“民俗学/民间传统的”）、folk-style、folk-inspired。"]}
{"word":"folklore","summary":{"en":"Folklore is the traditional stories, beliefs, and customs of a community, passed down over generations.","zh":"Folklore 指一个群体世代相传的民间故事、信仰与习俗等文化传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Traditional stories, beliefs, customs, and sayings passed down within a community, usually by word of mouth.","zh":"民间传说与民俗：在一个群体中代代相传的故事、信仰、习俗与俗语，通常以口头方式流传。"},"examples":[{"en":"Local folklore says a spirit protects the old bridge at night.","zh":"当地民间传说说，夜里有精灵守护那座老桥。"},{"en":"She studies the folklore of coastal fishing villages.","zh":"她研究沿海渔村的民俗与传说。"},{"en":"Many proverbs are part of a culture’s folklore.","zh":"许多谚语都是一种文化的民间传统的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of traditional tales and cultural practices associated with a particular place, people, or theme.","zh":"（某地/某群体/某主题的）传说体系与传统：与特定地区、族群或主题相关的一套民间故事与文化做法。"},"examples":[{"en":"The mountain has its own folklore about hidden treasure.","zh":"那座山有一套关于宝藏的民间传说。"},{"en":"Dragon folklore appears in many Asian cultures.","zh":"龙的传说在许多亚洲文化中都能看到。"}]}],"synonyms":["tradition","oral tradition","folk tales","myths","legends"],"phonetic":"/ˈfoʊkˌlɔr/","extraExplanation":["“Folklore”常涵盖：民间故事（folk tales）、神话（myths）、传说（legends）、童谣与歌谣（nursery rhymes/folk songs）、迷信（superstitions）、习俗与仪式（customs/rituals）、手工艺与传统技艺等。","区别小提示：myth 常与神祇/宇宙起源有关；legend 常与“可能有历史原型的人物或地点”有关；folk tale 更偏“民间故事/寓言式故事”。这些都可能被统称为 folklore。","常见搭配：local folklore（地方传说）、urban folklore/urban legend（都市传说）、folk music（民歌）、folk beliefs（民间信仰）。文学与影视里也常借用 folklore 来营造地域感与神秘感。"]}
{"word":"folklore-related","summary":{"en":"“Folklore-related” means connected with folklore—traditional stories, beliefs, and customs.","zh":"“folklore-related”表示“与民间传说/民俗相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or about folklore (traditional stories, beliefs, customs, and songs passed down in a community).","zh":"与民间传说/民俗有关的（指在某个群体中代代相传的故事、信仰、习俗、歌谣等）。"},"examples":[{"en":"The museum has a folklore-related exhibit about local legends.","zh":"这家博物馆有一个与民间传说相关的展览，主题是本地传说。"},{"en":"She is writing a folklore-related essay on myths and rituals.","zh":"她正在写一篇与民俗相关的文章，主题是神话与仪式。"}]}],"synonyms":["folkloric","traditional","myth-related","legend-related"],"phonetic":"/ˈfoʊkˌlɔr rɪˈleɪtɪd/","extraExplanation":["“folklore-related”是由名词folklore + related构成的复合形容词，常用连字符（-）来清晰表达“与……相关”。在更正式或更常见的写法中，也可以用“folkloric”（如：folkloric music 民间风格音乐）或“related to folklore / connected to folklore”。","语境上它常出现在学术写作、展览介绍、研究主题描述中，用来修饰名词：folklore-related research / materials / themes（与民俗相关的研究/材料/主题）。"]}
{"word":"folklores","summary":{"en":"“Folklores” means the traditional stories and customs of multiple cultures or communities (plural of “folklore”).","zh":"“folklores”是“folklore”的复数，指多个文化或社群各自的民间故事与传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “folklore”: the traditional stories, legends, customs, music, and beliefs of different communities or cultures.","zh":"“folklore”的复数：不同社群或文化的传统故事、传说、习俗、音乐与信仰等民间文化。"},"examples":[{"en":"The museum exhibit compares the folklores of coastal fishing villages and mountain towns.","zh":"这场博物馆展览比较了沿海渔村与山地城镇的民间传说与传统。"},{"en":"Her research focuses on folklores passed down through oral storytelling.","zh":"她的研究聚焦于通过口述讲故事代代相传的民间传统。"}]}],"synonyms":["traditional tales","legends","myths","oral traditions","cultural traditions"],"phonetic":"/ˈfoʊkˌlɔr/","extraExplanation":["“folklore”在英语中常用作不可数名词（much folklore），表示某一文化的整体民间传统；当你要强调“不同地区/族群的多套民间传统”时，才更常用复数“folklores”。","学术写作里也常见用法：one group’s folklore / the folklore of a region；而在比较研究中会用 folklores 来突出“多元体系”。"]}
{"word":"folkloric","summary":{"en":"Folkloric means connected to folklore or having the traditional, legendary feel of folk stories and customs.","zh":"Folkloric 指与民间传说/民俗传统有关，或具有民间故事与传统习俗那种传奇、传统的氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to traditional folk culture, especially old stories, songs, beliefs, and customs passed down in a community.","zh":"与民间传统文化有关的，尤指在一个群体中代代相传的故事、歌谣、信仰与习俗。"},"examples":[{"en":"The movie uses folkloric creatures and legends from Eastern Europe.","zh":"这部电影使用了东欧的民间生物与传说。"},{"en":"Her paintings have a folkloric style, full of village scenes and symbols.","zh":"她的画有一种民俗风格，充满乡村场景和象征。"}]},{"partOfSpeech":"adj.","definition":{"en":"In the style of, or resembling, folklore; having a mythical, legendary, or traditional feel.","zh":"具有民间传说风格的；带有神话、传奇或传统氛围的。"},"examples":[{"en":"The song’s lyrics feel folkloric, like something you would hear around a campfire.","zh":"这首歌的歌词很有民谣/民间传说的味道，像是你会在篝火旁听到的。"},{"en":"The town is famous for its folkloric image of a brave trickster hero.","zh":"这个小镇以一位勇敢的“狡黠英雄”民间形象而闻名。"}]}],"synonyms":["folklore-related","traditional","legendary","mythical","folk"],"phonetic":"/foʊkˈlɔrɪk/","extraExplanation":["“folkloric”常用于学术或文化语境（如folkloric studies/民俗学），也常见于艺术评论（folkloric motifs=民俗母题/图案，folkloric elements=民俗元素）。","与“folky”（偏口语、常形容音乐风格）不同，“folkloric”更强调来自传统与传承的内容；与“mythic”相比，“folkloric”更贴近“民间流传”，不一定宏大或宗教化。"]}
{"word":"folklorish","summary":{"en":"Folklorish means “like folklore”—having a folk-tale/traditional feel; sometimes it suggests a romanticized, not strictly factual style.","zh":"folklorish 指“像民俗/民间传说那样的”，带有民间故事或传统气息；有时也暗示叙述偏故事化、不够严谨。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling folklore; having the style, themes, or atmosphere of traditional folk tales, legends, or customs.","zh":"带有民俗/民间传说色彩的；像民间故事、传说或传统习俗那样的。"},"examples":[{"en":"The movie has a folklorish tone, with spirits, old songs, and village rituals.","zh":"这部电影有一种很“民俗传说式”的氛围：有精灵、古老的歌谣和村庄仪式。"},{"en":"Her paintings look folklorish, full of symbolic animals and simple patterns.","zh":"她的画看起来很有民间艺术/民俗风格，充满象征性的动物和朴素的图案。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes) Slightly informal or romanticized in a “folk-story” way, rather than strictly factual or academic.","zh":"（有时）带点不够严谨、偏“故事化/浪漫化”的民俗叙述风格，而非严格学术或完全纪实。"},"examples":[{"en":"His explanation was a bit folklorish—interesting, but not backed by evidence.","zh":"他的解释有点“民俗故事化”——很有趣，但缺乏证据支持。"},{"en":"The tour guide gave a folklorish version of the legend to entertain visitors.","zh":"导游用一种更“民间故事式”的版本来讲传说，以取悦游客。"}]}],"synonyms":["folkloric","folkloristic","traditional","mythic","legendary"],"phonetic":"/foʊkˈlɔrɪʃ/","extraExplanation":["“folklorish”在英语里不算常见，更常见的是“folkloric / folkloristic”。但“folklorish”非常直观：folklore（民俗/民间传说）+ -ish（“有点像……的”）。因此它往往带有“像民俗那样的、带点民间味道”的感觉。","语气方面：在赞美艺术风格时多为中性或正面；在讨论观点/解释时也可能暗示“更像传说或民间说法，未必严谨”。"]}
{"word":"folklorism","summary":{"en":"Folklorism means bringing folk traditions into modern or non-traditional contexts—often through performance, media, or tourism—sometimes in a simplified or stylized way.","zh":"Folklorism 指把民俗传统带入现代或非原生场景（如舞台、媒体、旅游展示），有时会出现风格化、简化或浪漫化的呈现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use, imitation, or revival of traditional folk culture (stories, music, dance, costumes, crafts) in modern or non-traditional settings, often for art, education, tourism, or national identity","zh":"将传统民俗文化（故事、音乐、舞蹈、服饰、手工艺等）在现代或非传统场景中加以运用、模仿或复兴的现象，常见于艺术、教育、旅游或民族认同建构"},"examples":[{"en":"The festival’s stage show is a form of folklorism: it presents village dances for an urban audience.","zh":"这个节日的舞台演出是一种“民俗化”：它把乡村舞蹈呈现给城市观众。"},{"en":"Some critics say the souvenir market turns local crafts into folklorism for tourists.","zh":"一些评论者认为纪念品市场把当地手工艺变成了面向游客的“民俗化”。"}]},{"partOfSpeech":"n.","definition":{"en":"a style or tendency that deliberately adds folk elements to make something feel traditional or “authentic,” sometimes in a simplified or romanticized way","zh":"一种刻意加入民俗元素以营造“传统感/真实感”的风格或倾向，有时会被简化或浪漫化"},"examples":[{"en":"The movie uses folklorism—old songs and costumes—to create a nostalgic mood.","zh":"这部电影用“民俗化”（老歌和传统服装）来营造怀旧氛围。"},{"en":"Her design avoids folklorism by working with contemporary forms instead of copying folk patterns.","zh":"她的设计通过采用当代表达而不是照搬民间纹样，来避免“民俗化”。"}]}],"synonyms":["revivalism","cultural revival","folk revival","heritage performance","heritage tourism"],"phonetic":"/ˈfoʊkˌlɔrɪzəm/","extraExplanation":["“folklorism”常用于民俗学、人类学与文化研究语境，关注的是“民俗在原生语境之外被再生产”的过程，比如：舞台化表演、旅游展示、媒体改编、校园或国家庆典中的民俗呈现。","它通常是中性描述，但在批评语境里可能带有“表演化、商品化、刻板化（把传统简化成好看的符号）”的意味；是否负面要看作者立场与具体案例。","可与“folklore（民俗本体）”区分：folklore指传统在社区中自然流传的表达；folklorism强调在新的场景中被有意识地搬用或改造。"]}
{"word":"folklorist","summary":{"en":"A folklorist studies and collects folklore (traditional stories, customs, and beliefs).","zh":"folklorist 指研究与采集民俗（传统故事、习俗、信仰等）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies or collects folklore, such as traditional stories, songs, customs, and beliefs of a community.","zh":"民俗学者；民间传说与传统文化的研究者（或采集者），研究民间故事、歌谣、习俗与信仰等。"},"examples":[{"en":"The folklorist recorded elders’ stories to preserve the village’s traditions.","zh":"这位民俗学者记录了长者们的故事，以保存村庄的传统。"},{"en":"A folklorist might collect folk songs and explain what they mean in local culture.","zh":"民俗学者可能会采集民歌，并解释它们在当地文化中的含义。"}]}],"synonyms":["folklore scholar","folk researcher","ethnographer"],"phonetic":"/ˈfoʊkˌlɔrɪst/","extraExplanation":["“folklorist”来自“folklore（民间传说/民俗）+ -ist（从事者）”。常见工作包括田野调查（采访、录音、拍摄）、整理档案、研究某个社群的口述传统与节庆仪式。","注意区分：folklorist（研究者/学者）≠ storyteller（讲故事的人）≠ anthropologist（人类学家，范围更广）。"]}
{"word":"folkloristic","summary":{"en":"Folkloristic means “related to folklore” and can sometimes imply an overly quaint or stereotyped ‘folk’ portrayal.","zh":"Folkloristic 指“与民间传说/民俗有关的（民俗学的）”，有时也暗示把文化过度“风情化/民俗化”的呈现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to folklore (traditional stories, beliefs, customs, songs, and sayings passed down in a community).","zh":"与民间传说/民俗有关的；民俗学的（指一个社群世代相传的故事、信仰、习俗、歌谣、谚语等）。"},"examples":[{"en":"The museum has a folkloristic exhibit about local harvest festivals.","zh":"这家博物馆有一个关于当地丰收节的民俗主题展览。"},{"en":"Her novel uses folkloristic motifs like enchanted forests and talking animals.","zh":"她的小说使用了民俗母题，比如魔法森林和会说话的动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes critical) Overly focused on folklore details, or treating something as quaint “folk” culture rather than as living, complex culture.","zh":"（有时带批评意味）过度强调民俗细节，或把某种文化“民俗化/风情化”，当成古朴的“民间风物”而忽略其作为当代复杂文化的面貌。"},"examples":[{"en":"Some critics say the film’s rural scenes feel folkloristic, not realistic.","zh":"一些评论者认为电影里的乡村场景很“民俗风”，但不够真实。"},{"en":"Be careful not to give a folkloristic portrayal that stereotypes the community.","zh":"要小心别用“民俗化”的方式呈现，导致对这个社群的刻板印象。"}]}],"synonyms":["folkloric","traditional","mythic","legendary"],"phonetic":"/ˌfoʊk.ləˈrɪs.tɪk/","extraExplanation":["“folkloristic”来自 folklore（民间传说/民俗）+ -istic（“……性质的/倾向于……”）。在学术语境中常与 folkloristic studies（民俗研究）等搭配。","同类词：folkloric 通常更偏“像民间故事那样的/带民间色彩的”，语感更常见；folkloristic 更偏“民俗学的/与民俗研究相关的”，也更书面。"]}
{"word":"folkloristics","summary":{"en":"Folkloristics is the academic study of folklore and the methods used to analyze it.","zh":"Folkloristics 指研究民俗及其分析方法的学科（民俗学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The academic study of folklore (traditional stories, songs, beliefs, customs, and other cultural expressions) and how it is collected, analyzed, and understood.","zh":"民俗学；对民间传说、歌谣、信仰、习俗等“民俗”以及其采集、分析与理解方式的学术研究。"},"examples":[{"en":"She is taking a course in folkloristics to learn how scholars study legends and local traditions.","zh":"她在上民俗学课程，学习学者如何研究传说和地方传统。"},{"en":"Folkloristics examines how stories change as they are passed from one generation to the next.","zh":"民俗学研究故事在代代相传的过程中如何发生变化。"}]}],"synonyms":["folklore studies","folklore scholarship"],"phonetic":"/ˌfoʊk.lɔːˈrɪs.tɪks/","extraExplanation":["“folkloristics”常见于学术语境，和更常见的“folklore studies（民俗研究）”意思接近，但“folkloristics”更强调作为一门学科的理论与方法。","词形上由“folklore（民俗）+ -istics（……学/……研究方法）”构成。","相关词：folklorist（民俗学者）；folklore（民俗、民间故事）。"]}
{"word":"folklorists","summary":{"en":"“Folklorists” means people who study and collect folklore—traditional stories, customs, and beliefs.","zh":"“folklorists” 指研究与采集民俗（民间故事、习俗与信仰等）的人，即民俗学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A folklorist is a person who studies folklore (traditional stories, songs, customs, beliefs, and everyday culture), often by collecting and analyzing them.","zh":"folklorist 指“民俗学者/民间文化研究者”，研究民间传说、歌谣、习俗、信仰与日常文化等，并常通过采集与分析来理解其意义。"},"examples":[{"en":"Folklorists recorded local legends from elders in the village.","zh":"民俗学者记录了村里长者讲述的地方传说。"},{"en":"Many folklorists study how stories change as they are retold.","zh":"许多民俗学者研究故事在反复讲述中如何发生变化。"}]}],"synonyms":["folk scholars","folklore researchers","ethnographers (related, but broader)"],"phonetic":"/ˈfoʊk.lɔr.ɪsts/","extraExplanation":["“folklorists” 是 “folklorist” 的复数形式（-s 结尾）。","词源小提示：folk（民众、民间）+ lore（知识、传说）。因此 folklore 指“民间流传的知识/故事/传统”。","常见相关词：folklore（民间传说/民俗）、folk tale（民间故事）、oral tradition（口头传统）、myth（神话）、legend（传说）。"]}
{"word":"folkmoot","summary":{"en":"Folkmoot means a (historical/old-fashioned) public assembly where local people meet to discuss and decide community matters.","zh":"Folkmoot 指一种带历史/古旧色彩的民众集会，地方居民聚在一起讨论并决定社区事务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A public meeting or assembly of local people (especially in medieval/Anglo-Saxon England) to discuss community matters or make decisions.","zh":"（尤指中世纪/盎格鲁-撒克逊时期英格兰的）民众集会、地方公共会议，用于讨论公共事务或作出决定。"},"examples":[{"en":"In the novel, the villagers gathered for a folkmoot to settle a dispute over land.","zh":"在小说里，村民们召开民众集会来解决土地纠纷。"},{"en":"The historian described the folkmoot as an early form of local self-government.","zh":"历史学家把这种民众集会描述为早期的地方自治形式。"}]}],"synonyms":["public meeting","town meeting","assembly","council meeting"],"phonetic":"/ˈfoʊkˌmuːt/","extraExplanation":["这个词较为古旧，常见于历史写作、奇幻文学或中世纪题材作品中。","词源可理解为 folk（民众）+ moot（集会/讨论；也见于 moot court“模拟法庭”）。在古英语与中古英语语境里，moot 有“会议、议事”的含义。","在现代英语里，更常用的表达是 public meeting, town meeting, local assembly 等；folkmoot 带有强烈的历史/复古色彩。"]}
{"word":"folkmooter","summary":{"en":"A (rare, archaic) word meaning someone who attends a folkmoot—an old local public assembly.","zh":"一个（罕见、古风）词，指参加 folkmoot（古代地方民众大会/集会）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who takes part in a folkmoot (a public meeting or assembly of local people), especially in medieval England; an attendee of a local civic gathering.","zh":"参加“folkmoot”（民众大会、地方集会，尤指中世纪英格兰）的人员；地方公共集会的与会者。"},"examples":[{"en":"In the old chronicles, a folkmooter might gather in the town square to hear local decisions.","zh":"在一些古代编年史里，folkmooter 可能会聚集在城镇广场，聆听地方事务的决定。"},{"en":"The novel describes villagers and folkmooters debating taxes and land use.","zh":"小说描写村民与 folkmooter 讨论税收与土地使用问题。"}]}],"synonyms":["attendee","participant","assembly member"],"phonetic":"/ˈfoʊkˌmuːtɚ/","extraExplanation":["“Folkmooter”来自“folkmoot”：folk（民众）+ moot（会议、集会、议事会）。moot 在古英语/中古英语里常指“开会讨论、议事”，因此 folkmoot 指地方民众大会；folkmooter 就是参加这种大会的人。","这是相当古风、罕见的词，现代英语里更常用 attendee / participant / member of an assembly 等表达；在历史题材、仿古写作或讨论古代制度时可能会见到。"]}
{"word":"folkmoots","summary":{"en":"Folkmoots are public assemblies of local people, especially in early English (Anglo-Saxon) society.","zh":"Folkmoots 指民众的地方集会或大会，尤用于早期英格兰（盎格鲁-撒克逊）社会的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) public meetings or assemblies where local people gather to discuss community matters, make decisions, or settle disputes (especially in early English/Anglo-Saxon history).","zh":"（复数）民众大会、地方集会：当地人聚集讨论社区事务、作出决定或处理争端的会议（尤指早期英格兰/盎格鲁-撒克逊时期）。"},"examples":[{"en":"In some histories of Anglo-Saxon England, folkmoots are described as important local assemblies.","zh":"在一些关于盎格鲁-撒克逊英格兰的历史著作中，folkmoots 被描述为重要的地方集会。"},{"en":"The novel mentions villagers speaking up at folkmoots to settle disputes.","zh":"小说提到村民在 folkmoots 上发言来解决纠纷。"}]}],"synonyms":["assemblies","town meetings","councils","gatherings"],"phonetic":"/ˈfoʊkˌmut/","extraExplanation":["这是一个较古旧、带历史色彩的词，通常出现在历史书写、学术文本或具有中古/古英语氛围的文学作品中。","词源上可拆为 folk（人民）+ moot（会议、议事会）。现代英语里 moot 更常见于短语 the moot point（有争议/未定的问题）或在法律/学术语境中表示“讨论”。"]}
{"word":"folkmot","summary":{"en":"A historical word for a local public assembly of the people (especially in Anglo-Saxon England).","zh":"指历史上的地方民众大会（尤指盎格鲁-撒克逊时期英格兰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A public meeting or local assembly of the people, especially in Anglo-Saxon England, where community matters were discussed and decisions were made.","zh":"（历史用语）民众大会、地方集会；尤指盎格鲁-撒克逊时期英格兰的民会，用来讨论并决定社区事务。"},"examples":[{"en":"In some old records, disputes were brought before the folkmot for judgment.","zh":"在一些古老的记录中，争端会被提交到民会（folkmot）裁决。"},{"en":"The village leaders called a folkmot to discuss land boundaries.","zh":"村里的领袖召集民会来讨论土地边界。"}]}],"synonyms":["folk-moot","folkmoot","assembly","public meeting","town meeting (similar idea)"],"phonetic":"ˈfoʊkˌmuːt","extraExplanation":["Folkmot 也常写作 folk-moot 或 folkmoot，其中 moot 有“会议、集会（尤指讨论公共事务）”的旧义。","它和现代的 town meeting（镇民大会）在“社区成员参与公共议题讨论”的感觉上有点相似，但 folkmot 更偏历史语境。","在阅读历史或古英语相关题材时见到该词，通常不是日常英语高频词。"]}
{"word":"folkmote","summary":{"en":"Folkmote is a historical word for a public meeting of the people in Anglo-Saxon England.","zh":"Folkmote 是一个历史词，指盎格鲁-撒克逊时期英格兰的民众公共集会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) A public assembly of the people in Anglo-Saxon England, where local matters were discussed and decisions were made.","zh":"（历史）英格兰盎格鲁-撒克逊时期的民众集会/公共议事会，用于讨论并决定地方事务。"},"examples":[{"en":"In some villages, disputes were brought before the folkmote for a community decision.","zh":"在一些村落里，纠纷会提交到 folkmote，由社区共同裁决。"},{"en":"The novel describes a folkmote where farmers and elders argue over land boundaries.","zh":"小说描写了一场 folkmote，农民与长者为土地边界争论不休。"}]}],"synonyms":["folkmoot","moot (historical)","assembly","gathering"],"phonetic":"/ˈfoʊkˌmoʊt/","extraExplanation":["该词也常写作 **folkmoot**。来自古英语：**folk**（人民）+ **mōt/moot**（会议、集会）。它指的是早期英格兰地方层级的公众议事集会，和后来更制度化的法庭/议会有历史关联。现代英语里很少日常使用，多见于历史写作、学术讨论或历史题材文学。"]}
{"word":"folkmoter","summary":{"en":"A rare archaic word meaning a participant in a folkmote (an old English public assembly).","zh":"一个罕见的古语词，指参加 folkmote（古代英格兰公共集会）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, archaic) A person who attends or takes part in a folkmote (a public assembly of local freemen in early medieval England).","zh":"（罕见／古语）参加 folkmote（早期中世纪英格兰地方自由民公共集会）的人；集会成员。"},"examples":[{"en":"In some histories, a folkmoter could speak for his village at the local gathering.","zh":"在一些历史记载中，folkmoter 可以在地方集会上代表自己的村庄发言。"},{"en":"The novel imagines a young folkmoter listening to disputes about land and law.","zh":"这部小说想象一位年轻的 folkmoter 听人们争论土地与法律纠纷。"}]}],"synonyms":["assembly member","delegate","attendee"],"phonetic":"ˈfoʊkˌmoʊtər","extraExplanation":["“folkmoter”在现代英语中几乎不用，很多情况下可能是把“folkmote”（集会）误写成了“folkmoter”。","Folkmote（也写作 folkmoot）指盎格鲁-撒克逊时期的地方公共集会，类似“乡民大会/民众议会”，用于讨论法律、土地、纠纷等公共事务。"]}
{"word":"folkmotes","summary":{"en":"“Folkmotes” are historical local assemblies (plural) in Anglo-Saxon England where free people met to make community decisions.","zh":"“Folkmotes”是历史用语，指盎格鲁-撒克逊英格兰的地方民众大会（复数），自由民众在此集会讨论并决定公共事务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) Local public assemblies where free people in an Anglo-Saxon community met to discuss and decide matters such as laws, disputes, or local governance.","zh":"（历史用语）盎格鲁-撒克逊时期的地方民众大会；自由民众聚集讨论并裁决法律、纠纷或地方事务的集会。"},"examples":[{"en":"In some histories, folkmotes are described as early forms of local government.","zh":"在一些历史著作中，folkmotes 被描述为早期的地方治理形式。"},{"en":"The novel mentions a village holding a folkmote to settle a dispute over land.","zh":"小说中提到村民召开 folkmote 来解决土地纠纷。"}]}],"synonyms":["folkmoots","public assembly","local council (approx.)"],"phonetic":"/ˈfoʊkˌmuːt/","extraExplanation":["“folkmotes”是“folkmote/folkmoot”的复数形式，属于古代/历史语境用词，现代英语中很少在日常对话出现。","词源上可理解为 folk（人民）+ mote/moot（会议、集会）。相关词：moot（讨论的，常用于短语 a moot point“有争议/未必重要的问题”）。","在英格兰中古时期的史料或历史题材文学/影视中，可能会用它来营造“古风”的政治与社会场景。"]}
{"word":"folkmots","summary":{"en":"Folkmote (also spelled folkmoot) is an old word for a community assembly where local people met to decide public matters.","zh":"Folkmote（亦作 folkmoot）是古语，指地方民众为处理公共事务而举行的集会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A public meeting or assembly of local people (especially in Anglo-Saxon England) to discuss community matters, make decisions, or settle disputes.","zh":"（古语）民众大会；地方公民集会（尤指盎格鲁-撒克逊时期英格兰的地方会议），用于讨论公共事务、作出决定或处理纠纷。"},"examples":[{"en":"In the novel, the villagers gather at the folkmote to choose a new leader.","zh":"在小说里，村民在民众大会上聚集，选出新的领袖。"},{"en":"The historian describes a folkmote where land boundaries were debated.","zh":"历史学家描述了一次民众大会，人们在会上争论土地边界问题。"}]}],"synonyms":["assembly","moot","council","town meeting"],"phonetic":"/ˈfoʊkˌmuːt/","extraExplanation":["你输入的 **folkmots** 多半是复数形式或拼写变体；更常见的词形是 **folkmote / folkmoot**（复数：folkmotes / folkmoots）。","词源上由古英语 **folc**（人民）+ **mōt**（会议、集会）构成。现代英语里多见于历史写作、奇幻文学或仿古语境中。"]}
{"word":"folknik","summary":{"en":"A folknik is a devoted fan or participant in folk music/culture, often with a 1960s-style vibe.","zh":"folknik 指热衷民谣或民俗文化的人，常带一点60年代民谣圈的时代感或调侃色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is very interested in folk music, folk dancing, or folk culture, especially in a devoted or trendy way.","zh":"民谣（或民俗）爱好者；热衷民间音乐/民间文化的人（常带一点“很迷、很跟风”的感觉）"},"examples":[{"en":"In the 1960s, folkniks packed coffeehouses to hear new protest songs.","zh":"在20世纪60年代，很多民谣迷挤满咖啡馆来听新的抗议歌曲。"},{"en":"She’s a folknik who collects old ballads and sings them at community events.","zh":"她是个民谣爱好者，会收集古老叙事歌谣，并在社区活动上演唱。"},{"en":"He moved from rock to folk and started hanging out with the local folkniks.","zh":"他从摇滚转向民谣，开始和当地的民谣圈子的人混在一起。"}]}],"synonyms":["folk fan","folk-music enthusiast","folkie"],"phonetic":"/ˈfoʊkˌnɪk/","extraExplanation":["这个词常见于美国英语，尤其和20世纪50–60年代的“民谣复兴”（folk revival）相关：咖啡馆演出、学生运动、抗议歌曲等语境里会出现。","后缀“-nik”带有“某类人/某种圈子的人”的味道，源自意第绪语并在英语中流行开来（例如 beatnik）。因此 folknik 有时会带一点调侃或时代感，并非特别正式。"]}
{"word":"folkright","summary":{"en":"Folkright means the customary rights and traditional local law of the people.","zh":"Folkright 指人民基于传统习俗而形成的权利与地方惯例法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the traditional or customary rights and laws of ordinary people in a community; rights based on long-established local practice rather than written law","zh":"（社群中）人民因长期习俗而形成的权利与规范；基于传统惯例而非成文法的权利"},"examples":[{"en":"The villagers defended their folkright to gather firewood in the forest.","zh":"村民维护他们在森林里拾柴的传统权利。"},{"en":"In medieval records, folkright often meant local custom that everyone accepted as law.","zh":"在中世纪文献中，folkright 常指被大众视为法律的地方习惯。"}]}],"synonyms":["customary law","custom","traditional rights","common law (approx.)","birthright (approx.)"],"phonetic":"/ˈfoʊkˌraɪt/","extraExplanation":["这个词较少见，常出现在历史、法律史或古英语/中古英语语境中，强调“习俗即法律”的观念。","与 common law（普通法）有相近之处，但 folkright 更强调“民间习惯、地方传统”带来的权利基础，而不一定是由法院体系发展出来的判例规则。"]}
{"word":"folks","summary":{"en":"“Folks” means people in general, your family (especially parents), or a friendly way to address a group.","zh":"“folks”可指人们/大家、家人（尤指父母），也可作对一群人的友好称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People in general; ordinary people (often used in a friendly, informal way).","zh":"人们；大家（常用于友好、非正式的说法）。"},"examples":[{"en":"Folks around here are very welcoming.","zh":"这里的人都很热情好客。"},{"en":"Some folks prefer tea, others prefer coffee.","zh":"有些人喜欢茶，有些人喜欢咖啡。"}]},{"partOfSpeech":"n.","definition":{"en":"Your family members, especially your parents (informal).","zh":"家人，尤指父母（非正式）。"},"examples":[{"en":"I’m visiting my folks this weekend.","zh":"这个周末我要去看望我爸妈。"},{"en":"Her folks live in Chicago.","zh":"她的父母住在芝加哥。"}]},{"partOfSpeech":"n.","definition":{"en":"A friendly way to address a group of people, especially in American English (often in the plural: “folks”).","zh":"对一群人的友好称呼，尤用于美式英语（常说“folks”）。"},"examples":[{"en":"Hi folks, thanks for coming!","zh":"大家好，感谢你们来参加！"},{"en":"Folks, please take your seats.","zh":"各位，请就座。"}]}],"synonyms":["people","persons","family","parents","everyone"],"phonetic":"/foʊks/","extraExplanation":["“Folks”语气通常更亲切、更口语，比“people”更有人情味；但在非常正式的写作中一般用“people”“individuals”。","在美式英语里，“folks”常用于主持、演讲或服务场景称呼听众/顾客。也常见到复合词：“folksy”（adj. 朴实亲切的、带乡土味的）。"]}
{"word":"folksay","summary":{"en":"“Folksay” means a traditional folk proverb or saying.","zh":"“Folksay”指民间流传的谚语/俗语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional saying (a folk proverb) passed down in a community","zh":"民间谚语；俗语（在群体中代代相传的说法）"},"examples":[{"en":"My grandma loved using old folksays to give advice.","zh":"我奶奶很爱用老一辈的民间谚语来给建议。"},{"en":"One common folksay is, “Don’t count your chickens before they hatch.”","zh":"一个常见的俗语是：“小鸡没孵出来别先数。”（比喻别高兴太早。）"}]}],"synonyms":["proverb","saying","adage","maxim","aphorism","folk saying"],"phonetic":"/ˈfoʊkˌseɪ/","extraExplanation":["“folksay”比较少见，更常见的写法是“folk saying”（分开写）或“folksaying”（合写）。在学术或民俗学语境里可能会用来指“民间流传的格言/谚语”。","注意不要和“folksy”（朴实亲切的、带乡土味的）混淆：folksy 是形容词，folksay/folk saying 是名词。"]}
{"word":"folksey","summary":{"en":"“Folksey” (usually spelled “folksy”) means friendly, informal, and down-to-earth in style.","zh":"“folksey”（通常写作“folksy”）指风格朴实亲切、随和接地气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Variant spelling of “folksy”) having a friendly, informal, down-to-earth style that feels like ordinary people (“folks”) rather than formal or elite.","zh":"（“folksy”的变体拼写）朴实亲切的；带有“民间/老百姓气息”的；不拘礼节、接地气的。"},"examples":[{"en":"The host has a folksy way of talking that makes guests feel relaxed.","zh":"这位主持人说话很朴实亲切，让嘉宾感到放松。"},{"en":"Her writing is warm and folksy, full of everyday details.","zh":"她的文字温暖又接地气，充满日常细节。"},{"en":"He used a folksy joke to break the ice at the meeting.","zh":"他用一个朴实的笑话在会议上缓和气氛。"}]}],"synonyms":["folksy","down-to-earth","homespun","friendly","informal","unpretentious"],"phonetic":"/ˈfoʊksi/","extraExplanation":["“folksey”更常见的是拼写错误或个人偏好的写法；标准拼写通常是“folksy”。","“folksy”有时也会带一点点语气：既可能是褒义（亲切自然），也可能是略带贬义（过于装朴实、刻意讨好大众）。写作时可根据上下文判断。"]}
{"word":"folksier","summary":{"en":"“Folksier” means more informal, down-to-earth, and like everyday people’s speech or style.","zh":"“Folksier”表示“更口语朴实、更接地气、更像普通人日常表达的风格”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More informal, friendly, and like ordinary people’s everyday speech or style (often in a warm, simple way).","zh":"更口语化、更亲切朴实的；更像普通人日常说话或表达风格（常带温暖、简单的感觉）。"},"examples":[{"en":"Her second book has a folksier tone, with short stories and plain language.","zh":"她的第二本书语气更朴实亲切，用短篇故事和直白的语言来写。"},{"en":"Try a folksier greeting like “Hi, everyone” instead of something very formal.","zh":"试试用更口语的问候，比如用“大家好”，别用太正式的说法。"}]}],"synonyms":["more down-to-earth","more informal","more homespun","more plainspoken","more rustic"],"phonetic":"/ˈfoʊk.si.ɚ/","extraExplanation":["“folksier”是形容词“folksy”的比较级（folksy → folksier → folksiest），表示“更……”。","“folksy/folksier”常用来形容语言风格（tone, expression, storytelling）、音乐/艺术风格（folk-style, country-style），或人给人的感觉（friendly, down-to-earth）。通常是褒义，但在少数语境里也可能暗示“过于装朴实、刻意接地气”。"]}
{"word":"folksiest","summary":{"en":"“Folksiest” means “the most folksy”: the most friendly and down-to-earth, sometimes with a hint of being overly or artificially ‘homey.’","zh":"“Folksiest”意为“最folksy（最接地气/最朴实亲切的）”，有时也可带讽刺，指过度或刻意装得很亲民。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “folksy”: the most friendly, simple, and down-to-earth in a way that seems like ordinary people (often used about a person’s style, speech, or manner).","zh":"“folksy”的最高级：最朴实亲切、接地气的（常形容一个人的风格、说话方式或举止像普通人一样）。"},"examples":[{"en":"Of all the candidates, she has the folksiest speaking style.","zh":"在所有候选人中，她的演讲风格最接地气。"},{"en":"That was the folksiest story in the whole book—warm, simple, and easy to relate to.","zh":"那是整本书里最朴实温暖、最容易让人产生共鸣的故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes critical) the most “homey” or “country-like” in a way that can feel exaggerated or not fully sincere.","zh":"（有时带批评）最“装朴实/装亲民”的；这种乡土、家常的感觉可能显得刻意或不够真诚。"},"examples":[{"en":"His folksiest jokes sounded a bit forced to me.","zh":"他那些最“亲民”的笑话在我听来有点刻意。"}]}],"synonyms":["most down-to-earth","most homespun","most informal","most friendly","most rustic"],"phonetic":"/ˈfoʊksiɪst/","extraExplanation":["“folksiest”来自形容词“folksy”（朴实亲切、像老百姓一样的），是其最高级形式：folksy → folksier → folksiest。","这个词常用于谈政治人物、主持人或作家的表达风格：可以是褒义（亲切、接地气），也可能带点讽刺（故意营造亲民形象）。"]}
{"word":"folksily","summary":{"en":"“Folksily” means speaking or acting in a warm, simple, down-to-earth way.","zh":"“folksily”指用朴实亲切、接地气的方式说话或行事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a friendly, simple, and informal way, like ordinary people speaking at home (often with a warm, down-to-earth tone).","zh":"以朴实亲切、随和口语的方式（常带温暖、接地气的语气）。"},"examples":[{"en":"He began the speech folksily, telling a short story about his neighbors.","zh":"他用很朴实亲切的方式开场，讲了一个关于邻居的小故事。"},{"en":"The host spoke folksily, making everyone feel comfortable.","zh":"主持人说话很随和亲切，让大家都很放松。"}]}],"synonyms":["plainly","simply","informally","in a homespun way","in a down-to-earth way"],"phonetic":"/ˈfoʊk.sɪ.li/","extraExplanation":["“folksily”来自形容词“folksy”（朴实亲切、带民间气息的），常用于描述说话、叙述或表达的风格。它有时也可能带一点“刻意装亲民”的语感，具体取决于语境。","在文学或演讲评论里，这个词常用来形容一种像讲故事一样的、贴近日常生活的表达方式。"]}
{"word":"folksiness","summary":{"en":"Folksiness means a warm, down-to-earth, ordinary style—sometimes genuinely friendly, sometimes deliberately ‘homespun’ to seem relatable.","zh":"Folksiness 指一种温暖、朴实、接地气的风格；既可能是真诚亲切，也可能是刻意营造的“家常亲民”口吻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A warm, friendly, and ordinary style that feels down-to-earth and approachable (often in speech, writing, or behavior).","zh":"（说话、写作或行为的）朴实亲切、接地气的风格；带有人情味、平易近人的气质。"},"examples":[{"en":"Her stories have a gentle folksiness that makes city life feel familiar.","zh":"她的故事带着温柔的朴实亲切感，让都市生活也显得很亲近。"},{"en":"The politician tried to project folksiness by telling small-town jokes.","zh":"那位政治人物试图用讲小镇笑话来营造亲民的朴实形象。"}]},{"partOfSpeech":"n.","definition":{"en":"A deliberately informal, homespun tone used to seem relatable; sometimes it can feel performative or patronizing.","zh":"一种刻意的随和、家常口吻，用来显得好亲近；有时会让人觉得做作或居高临下。"},"examples":[{"en":"Some viewers felt the host’s folksiness was forced.","zh":"一些观众觉得主持人的那种“朴实随和”有点刻意。"},{"en":"Too much folksiness in a serious report can weaken its credibility.","zh":"严肃报道里“家常化”太过头，可能会削弱可信度。"}]}],"synonyms":["down-to-earthness","warmth","approachability","homespun charm","plainspokenness"],"phonetic":"/ˈfoʊk.si.nəs/","extraExplanation":["“folksiness”来自“folksy”（朴实的、民间味的、亲切随和的）+ 名词后缀“-ness”。常用于评价语言风格（tone）、叙事方式、公众人物形象等。","语感提示：它通常是褒义（亲切、真诚、接地气），但在政治宣传或商业包装语境里也可能带贬义，暗示“装亲民/卖人设”。","相关词：down-to-earth（脚踏实地的/朴实的）、homespun（朴素的、乡土味的）、folksy（朴实随和的）。反义倾向：stiff/formal（拘谨/正式的）。"]}
{"word":"folksinger","summary":{"en":"A folksinger is a person who performs folk music, often telling stories with simple musical accompaniment.","zh":"folksinger指演唱民谣音乐的人，常用简单伴奏并以叙事与生活化主题见长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A singer (often also a songwriter) who performs folk music, usually with simple instruments and storytelling lyrics.","zh":"民谣歌手（常也指创作型歌手），演唱民谣音乐，常用简单乐器并以叙事性歌词为特色。"},"examples":[{"en":"She started as a folksinger in small coffeehouses before releasing her first album.","zh":"她最初在小咖啡馆当民谣歌手，后来才发行了第一张专辑。"},{"en":"The folksinger told stories about working people and everyday life.","zh":"这位民谣歌手讲述劳动者和日常生活的故事。"}]}],"synonyms":["folk singer","folk musician","balladeer"],"phonetic":"/ˈfoʊkˌsɪŋɚ/","extraExplanation":["“folksinger”在英语里常让人联想到20世纪中期的美国民谣复兴（folk revival），当时许多歌手用吉他、班卓琴等简单伴奏，歌曲主题常涉及民间传统、社会议题与生活叙事。","拼写上也常见“folk singer”（分开写）；含义相同，但分开写更常见，合写“folksinger”更像一个固定称呼。"]}
{"word":"folksinging","summary":{"en":"Folksinging is the tradition of singing folk songs within a community.","zh":"Folksinging 指在社区或民间传承的民歌演唱传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice or tradition of singing folk songs (traditional songs passed down within a community).","zh":"民歌演唱；唱民谣（指在社区或民间世代流传的传统歌曲的演唱传统）。"},"examples":[{"en":"She grew up around folksinging at family gatherings, so she learned many old songs by ear.","zh":"她从小在家庭聚会的民歌演唱氛围中长大，所以靠听就学会了很多老歌。"},{"en":"The festival features storytelling, dancing, and folksinging from different regions.","zh":"这个节日汇集了不同地区的讲故事、舞蹈和民歌演唱。"},{"en":"In the documentary, elders teach young people folksinging to keep the tradition alive.","zh":"在纪录片里，长者教年轻人唱民歌，以延续传统。"}]}],"synonyms":["folk singing","singing folk songs","traditional singing","folk-song performance"],"phonetic":"/ˈfoʊkˌsɪŋɪŋ/","extraExplanation":["“folksinging”常写作两词folk singing，也可用folk-singing（作定语）如a folk-singing tradition。","民歌演唱通常强调“口耳相传”、与地方生活/劳动/节庆相关；不一定是专业舞台演出，也可以是社区里的日常音乐活动。","在英语文化里，folk singing常让人联想到20世纪的“民谣复兴”（folk revival），与社会议题、抗议歌曲、以及吉他伴奏的独唱或合唱有关。"]}
{"word":"folksong","summary":{"en":"A traditional song passed down in a community; a folk song.","zh":"在民间流传的传统歌曲；民歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional song that is passed down among ordinary people, often reflecting a community’s daily life, history, or values.","zh":"民歌；传统歌曲（在民间流传，常反映一个群体的生活、历史或价值观）。"},"examples":[{"en":"My grandma taught me a folksong she learned as a child.","zh":"我奶奶教了我一首她小时候学的民歌。"},{"en":"The festival opened with a local folksong performed on simple instruments.","zh":"节日以一首用简单乐器演奏的当地民歌开场。"},{"en":"Many folksongs tell stories about love, work, or hardship.","zh":"许多民歌讲述爱情、劳动或艰难生活的故事。"}]}],"synonyms":["folk song","traditional song","ballad"],"phonetic":"/ˈfoʊkˌsɔŋ/","extraExplanation":["在英语里更常见的写法是 **folk song**（两词），**folksong** 也可以用，但相对少见。","“folk”指“民间的、普通人的”，很多英文民歌在早期并没有明确作者，常通过口耳相传而不断出现不同版本。","相关词：**ballad**（叙事民谣/歌谣，偏“讲故事”的歌）、**sea shanty**（水手号子/海员劳动歌）、**traditional music**（传统音乐）。"]}
{"word":"folksongs","summary":{"en":"Folksongs are traditional community songs passed down over time, often telling cultural or everyday stories.","zh":"Folksongs 指代代相传的民间传统歌曲，常讲述文化与日常生活故事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional song passed down in a community, usually by word of mouth, often reflecting everyday life, local history, or cultural values.","zh":"民歌；乡土歌曲：在某个群体中代代相传（多靠口耳相传）的传统歌曲，常反映日常生活、地方历史或文化价值。"},"examples":[{"en":"My grandmother taught me old folksongs from her village.","zh":"我奶奶教我她村里流传的老民歌。"},{"en":"The festival opened with folksongs sung in the local dialect.","zh":"音乐节以用当地方言演唱的民歌开场。"},{"en":"Many folksongs tell stories about work, love, and migration.","zh":"许多民歌讲述劳动、爱情与迁徙的故事。"}]}],"synonyms":["folk song","traditional song","ballad"],"phonetic":"/ˈfoʊk.sɔŋ/","extraExplanation":["“folksong(s)”常见于音乐、文化研究语境，强调“民间传统”而非“流行商业创作”。它们常有多种版本，歌词会随地区、时代与演唱者而变化。","拼写上也常见作一个词“folksong”，复数为“folksongs”。"]}
{"word":"folksy","summary":{"en":"“Folksy” describes something warm, simple, and traditional—like everyday speech or small-town life.","zh":"“Folksy”形容一种温暖、朴实、传统的风格，常让人联想到日常表达或小镇/乡村生活。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Friendly and simple in a way that feels traditional, rural, or like ordinary people’s everyday life.","zh":"（风格或表达）朴实亲切的；带有乡土气息、民间味的；像普通人日常生活那样自然的。"},"examples":[{"en":"The book has a folksy tone, full of small-town stories.","zh":"这本书语气很朴实亲切，充满小镇故事。"},{"en":"She gave a folksy explanation that everyone could understand.","zh":"她用一种很接地气的方式解释，让大家都听得懂。"},{"en":"The restaurant’s folksy décor made it feel warm and familiar.","zh":"餐厅朴实的装饰让人感觉温暖又亲切。"}]}],"synonyms":["down-to-earth","homespun","rustic","plainspoken","warm","informal"],"phonetic":"/ˈfoʊksi/","extraExplanation":["“folksy”通常带有正面含义：亲切、接地气、好理解。但有时也可能带一点点负面或讽刺意味，表示“过于刻意装朴实”“像在装亲民”。语境会决定听起来是夸奖还是吐槽。","常见搭配：folksy charm（朴实的魅力）、folksy wisdom（民间智慧/朴素的智慧）、folksy humor（朴实的幽默）、folksy stories（民间/乡土故事）、folksy style（朴素风格）。","相关词对比：rustic更强调“乡村/质朴的外观或环境”；homey强调“像家一样温馨舒适”；down-to-earth强调“务实、不装、不摆架子”。"]}
{"word":"folktale","summary":{"en":"A folktale is a traditional story from a community, usually passed down by word of mouth and often carrying a lesson or cultural values.","zh":"Folktale 指社区/民间口头流传的传统故事，常带有寓意或体现文化价值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional story passed down in a community, usually told for entertainment and to share values or life lessons","zh":"民间故事；口头流传的传统故事（常用于娱乐并传递价值观或人生道理）"},"examples":[{"en":"My grandmother told me a folktale about a clever rabbit who outsmarted a tiger.","zh":"我奶奶给我讲了一个民间故事：一只聪明的兔子智胜老虎。"},{"en":"Many folktales explain why an animal looks or behaves a certain way.","zh":"很多民间故事会解释为什么某种动物会长成那样或表现出某种习性。"},{"en":"The class compared a Chinese folktale with a European one and found similar themes.","zh":"全班把一个中国民间故事和一个欧洲民间故事作比较，发现主题很相似。"}]}],"synonyms":["folk story","traditional tale","oral tale"],"phonetic":"/ˈfoʊkˌteɪl/","extraExplanation":["“folktale”常与“fairy tale（童话）”混淆：folktale 更强调“民间/口头传统”，不一定有仙女或魔法；fairy tale 往往更偏幻想元素、常见“从前……”式结构。","常见搭配：traditional folktale（传统民间故事）、local folktale（地方民间故事）、a folktale about…（关于……的民间故事）。","相关词：myth（神话，常涉及神祇与宇宙起源）、legend（传说，常与历史人物/地点相关）、fable（寓言，通常短且有明确道德教训）。"]}
{"word":"folktales","summary":{"en":"Folktales are traditional community stories passed down over time, often with lessons or magical elements.","zh":"Folktales 指代代相传的民间故事，常带有寓意或神奇元素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Traditional stories passed down within a community, often featuring moral lessons, magical events, or explanations for nature and customs.","zh":"民间故事；口头流传的传统故事，常含道德寓意、神奇情节，或用来解释自然现象与风俗习惯。"},"examples":[{"en":"My grandmother used to tell us folktales from her village before bedtime.","zh":"我奶奶以前常在睡前给我们讲她家乡的民间故事。"},{"en":"Many folktales teach children to be honest and kind.","zh":"许多民间故事教孩子要诚实、善良。"},{"en":"This book collects folktales from around the world.","zh":"这本书收录了世界各地的民间故事。"}]}],"synonyms":["folk stories","traditional stories"],"phonetic":"/ˈfoʊkˌteɪlz/","extraExplanation":["“Folktales”是复数形式，单数是“folktale”。","民间故事通常以口头讲述的方式代代相传，因此不同地区可能会出现同一个故事的不同版本。","相关词汇区分：fairy tale（童话，常有精灵/魔法，偏儿童文学）、myth（神话，常与神祇与宇宙起源有关）、legend（传说，常与历史人物/地点有关，真假交织）。"]}
{"word":"folkvang","summary":{"en":"Folkvang (Fólkvangr) is a Norse-mythology place ruled by Freyja, where some battle-slain go after death.","zh":"Folkvang（Fólkvangr）是北欧神话中由芙蕾雅统治的原野，传说部分战死者死后会前往那里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norse mythology) Fólkvangr: the meadow/field ruled by the goddess Freyja, where some of the slain in battle are said to go in the afterlife.","zh":"（北欧神话）Fólkvangr（常写作 Folkvang 或 Folkvangr）：由女神芙蕾雅（Freyja）统治的“战死者之原/原野”，传说中部分战死者死后会去的地方。"},"examples":[{"en":"In Norse myth, not all warriors go to Valhalla; some are said to go to Folkvangr with Freyja.","zh":"在北欧神话中，并非所有战士都会去英灵殿；传说有些会随芙蕾雅前往 Folkvangr。"},{"en":"The poem mentions a hall called Sessrúmnir in Folkvangr, linked to the goddess Freyja.","zh":"诗歌中提到 Folkvangr 里有一座名为 Sessrúmnir 的殿堂，与女神芙蕾雅相关。"}]}],"synonyms":["Fólkvangr","Folkvangr","Fólkvang"],"phonetic":"/ˈfoʊlkˌvɑŋ/","extraExplanation":["“Folkvang”多半是对古诺尔斯语 **Fólkvangr** 的简写或拼写变体。它由 *fólk*（人群/军队/人民）+ *vangr*（田野/原野）构成，常被理解为“民众之原”或“战士之原”。","重要文化点：在一些资料（如《诗体埃达》）中，芙蕾雅被说成会“挑选”阵亡者，其中一部分归她去 Fólkvangr，另一部分归奥丁去英灵殿（Valhalla）。不同作品与学者解读会有差异。","文学/来源提示：Fólkvangr 出现在《诗体埃达》（如 *Grímnismál*）与《散文埃达》中，是现代奇幻文学与游戏常借用的北欧神话地名。"]}
{"word":"Folkvangr","summary":{"en":"Folkvangr is Freyja’s field in Norse mythology, a resting place for many warriors slain in battle.","zh":"Folkvangr 是北欧神话中芙蕾雅的“原野”，许多战死沙场的战士会在此安息。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Norse mythology, a meadow/field in the realm of the goddess Freyja, where she receives half of the warriors who die in battle (the other half go to Odin’s Valhalla).","zh":"在北欧神话中，女神芙蕾雅（Freyja）的居所之一，意为“民众的原野/草原”；据说阵亡战士的一半会被她接纳到此处（另一半进入奥丁的英灵殿 Valhalla）。"},"examples":[{"en":"In some versions of Norse myth, Freyja welcomes fallen warriors to Folkvangr.","zh":"在某些北欧神话版本中，芙蕾雅会在 Folkvangr 迎接阵亡的战士。"},{"en":"The poem contrasts Valhalla with Folkvangr as two destinations for the battle-dead.","zh":"诗歌把英灵殿 Valhalla 和 Folkvangr 对比为阵亡者的两种归宿。"}]}],"synonyms":["Freyja’s hall","Fólkvangr (alternate spelling)","Valhalla (related, not the same)"],"phonetic":"/ˈfoʊlkˌvɑŋɡər/","extraExplanation":["Folkvangr 常见于古诺尔斯资料《诗体埃达》（Poetic Edda）与《散文埃达》（Prose Edda）。它通常被理解为“folk（民众）+ vangr（田野、草地）”。","学习提示：英文里也常写作 Folkvang（省略词尾 -r），但在学术或更贴近古诺尔斯拼写的语境中常见 Folkvangr。","文化语境：很多现代奇幻作品会借用 Folkvangr/Valhalla 等概念来营造“战死者的归宿”这一主题。"]}
{"word":"folkvangr","summary":{"en":"Folkvangr is Freyja’s realm in Norse mythology where some battle-slain warriors go after death.","zh":"Folkvangr 是北欧神话中芙蕾雅的领域，部分战死的勇士死后会前往那里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norse mythology) Freyja’s meadow/realm where some of the warriors who die in battle are received after death (an alternative to Valhalla).","zh":"（北欧神话）女神芙蕾雅（Freyja）的“人民之原/战死者之原”，传说中部分战死的勇士死后会被接引至此（与英灵殿 Valhalla 相对）。"},"examples":[{"en":"In some retellings, the fallen are divided between Valhalla and Folkvangr.","zh":"在一些改写故事里，战死者会被分配到英灵殿和 Folkvangr。"},{"en":"The poem mentions Freyja welcoming warriors into Folkvangr.","zh":"诗歌中提到芙蕾雅在 Folkvangr 迎接战士。"}]}],"synonyms":["Fólkvangr","Freyja’s meadow","Freyja’s field"],"phonetic":"/ˈfoʊlkˌvɑŋɡər/","extraExplanation":["“Folkvangr”来自古诺尔斯语 *Fólkvangr*：*fólk*（人群、军队）+ *vangr*（平原、草地），字面意思可理解为“人民/军队的原野”。","主要见于《诗体埃达》（Poetic Edda）中的《格里姆尼尔之歌》（Grímnismál）等传统：常见说法是战死者一半归奥丁的英灵殿（Valhalla），一半归芙蕾雅的 Folkvangr。","Folkvangr 中常与“Sessrúmnir”（芙蕾雅的殿堂/居所）一起出现；在现代奇幻文学与游戏设定中也常被借用。"]}
{"word":"folkway","summary":{"en":"A folkway is a traditional custom or everyday social practice in a community.","zh":"folkway 指一个群体中传统的习俗或日常社会行为规范。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional way of behaving or doing things in a particular community or culture; a custom or everyday practice passed down over time.","zh":"（某个群体或文化中）传统的行为方式或做事方法；世代相传的习俗与日常做法。"},"examples":[{"en":"In the village, sharing food with neighbors is an important folkway.","zh":"在那个村子里，和邻居分享食物是一种重要的传统习俗。"},{"en":"Taking off your shoes before entering a home is a common folkway in many Asian cultures.","zh":"进屋前脱鞋在许多亚洲文化中是一种常见的民俗习惯。"},{"en":"She studied local folkways to understand how people showed respect and politeness.","zh":"她研究当地的传统习俗，以理解人们如何表达尊重与礼貌。"}]}],"synonyms":["custom","tradition","social practice","convention","usage"],"phonetic":"/ˈfoʊkˌweɪ/","extraExplanation":["“folkway”常见于社会学语境，指人们日常生活中“约定俗成”的规范（如打招呼方式、餐桌礼仪、穿着习惯）。它通常不如“mores（社会道德规范）”那样带有强烈的道德约束；不遵守folkway可能被认为“不礼貌/不合群”，但不一定被视为“严重不道德”。","词源上由“folk（民众）+ way（方式）”组成，常用复数“folkways”。"]}
{"word":"folkways","summary":{"en":"Folkways are a community’s traditional customs and everyday social habits; in sociology, they’re informal norms people follow because they’re customary, not legally required.","zh":"Folkways指一个群体的传统风俗与日常习惯；在社会学中，它指人们因“约定俗成”而遵守的非正式规范，而非法律强制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the traditional customs, habits, and everyday ways of life shared by a particular group or community","zh":"（某个群体或社区的）传统风俗、习惯与日常生活方式"},"examples":[{"en":"Learning local folkways can help you avoid offending people when you travel.","zh":"了解当地的传统习俗能帮助你在旅行时避免冒犯别人。"},{"en":"In her research, she compared the folkways of rural and urban communities.","zh":"在她的研究中，她比较了农村与城市社区的传统生活方式。"},{"en":"Greeting elders first is one of the folkways in many cultures.","zh":"在许多文化中，先向长辈问候是一种传统习俗。"}]},{"partOfSpeech":"n.","definition":{"en":"(in sociology) informal social norms and practices—things people usually do because “that’s how it’s done,” not because of strict laws","zh":"（社会学）非正式的社会规范与做法——人们通常遵守是因为“大家都这么做”，而不是因为法律强制"},"examples":[{"en":"Queueing politely is a folkway in many places, even when no one is enforcing it.","zh":"在许多地方，排队守秩序是一种非正式的社会规范，即使没有人强制执行。"},{"en":"Folkways can change over time as technology and lifestyles change.","zh":"随着科技与生活方式的变化，非正式社会规范也会随时间改变。"}]}],"synonyms":["customs","traditions","social norms","conventions","ways of life"],"phonetic":"/ˈfoʊkˌweɪz/","extraExplanation":["“Folkways”常用作复数名词，来自“folk（民众）+ ways（方式）”。在社会学里常与“mores（道德规范）”对比：folkways偏日常礼仪与习惯（不遵守通常只是显得不礼貌或不合群），mores更涉及道德判断（不遵守可能被强烈谴责）。","在美国文化语境中，人类学与民俗学研究也常用folkways来指一个群体的饮食、节庆、问候方式、穿着与家庭互动等“生活中的传统”。","此外，“Smithsonian Folkways”是美国一个知名的唱片与档案品牌，致力于保存与发行世界各地的民间与传统音乐；因此你可能会在音乐语境里看到这个词。"]}
{"word":"folky","summary":{"en":"Folky describes something with a folk-style feel—traditional, simple, and warmly down-to-earth.","zh":"Folky 用来形容带有民间/民谣风格的感觉：传统、朴实、亲切接地气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of music, stories, or style) simple, traditional, and friendly in a way connected with ordinary people and local culture; like folk music.","zh":"（指音乐、故事或风格）朴实亲切、带有传统民间气息的；像民谣/民间文化那样的。"},"examples":[{"en":"The café plays folky music with acoustic guitar and soft vocals.","zh":"这家咖啡馆播放带有民谣气息的音乐，有木吉他和轻柔的人声。"},{"en":"She told a folky story about her grandmother’s village.","zh":"她讲了一个很有民间味道的故事，关于她奶奶的村庄。"}]},{"partOfSpeech":"adj.","definition":{"en":"Warm, informal, and down-to-earth in a way that feels old-fashioned or homey.","zh":"亲切随和、接地气的；给人一种朴素、略带怀旧或“居家”感觉的。"},"examples":[{"en":"The inn has a folky charm—wooden tables, quilts, and homemade pie.","zh":"这家小旅馆有种朴实温暖的魅力——木桌、拼布被，还有自制派。"},{"en":"His folky humor made the audience relax.","zh":"他那种朴实的幽默让观众放松下来。"}]}],"synonyms":["folklike","rustic","homespun","down-to-earth","traditional"],"phonetic":"/ˈfoʊki/","extraExplanation":["“folky”来自“folk（民间的/民众的）”，常用来形容偏原声、传统元素多的音乐（如木吉他、小提琴、班卓琴等），也可形容某种“朴素、亲民、带点乡土味”的氛围。","语气通常是正面的（亲切、自然），但在少数语境里也可能带一点“土/过时”的感觉，需看上下文。"]}
{"word":"foll","summary":{"en":"“foll.” is a reference abbreviation meaning “following,” pointing to the next page(s) or section(s).","zh":"“foll.”是参考文献中的缩写，表示“以下/后续”，指接下来的页面或章节。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (often written as “foll.”) meaning “following,” used in references to point to the next page(s), line(s), or section(s).","zh":"缩写（常写作“foll.”），意思是“以下的/接下来的”，常用于参考文献或注释中，表示后续的页面、行或章节。"},"examples":[{"en":"See Chapter 3, p. 45 foll. for more details.","zh":"更多细节请见第3章，第45页及后续页面（p. 45 foll.）。"},{"en":"The poem is discussed on pp. 120 foll.","zh":"这首诗在第120页及后续页面（pp. 120 foll.）有讨论。"}]}],"synonyms":["following","and following","ff. (similar use)"],"phonetic":"/fɑl/","extraExplanation":["“foll.”多见于学术写作、书目、注释与法律文件中；意思接近“and following”。例如“p. 45 foll.”≈“第45页及之后几页”。","如果你想查的是动词“follow”（跟随/遵循）或名词“folly”（愚蠢/荒唐），告诉我你想要的完整拼写或句子语境，我可以按那个词解释。"]}
{"word":"foller","summary":{"en":"“foller” is a nonstandard/dialect spelling of “follow” (verb) or sometimes “follower” (noun).","zh":"“foller”是“follow”（动词）或有时“follower”（名词）的非标准/方言拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard, dialect) to follow; to go after someone/something or do what they do.","zh":"（非标准/方言）跟随；跟着走；照着某人/某事做。"},"examples":[{"en":"He told me to foller him down the road.","zh":"他叫我沿着路跟着他走。"},{"en":"If you foller the instructions, it should work.","zh":"如果你照着说明做，应该就能用。"}]},{"partOfSpeech":"n.","definition":{"en":"(Nonstandard, dialect) a follower; someone who follows another person or idea.","zh":"（非标准/方言）追随者；跟随他人或某种观点的人。"},"examples":[{"en":"He’s always been a foller, not a leader.","zh":"他一直是跟随者，不是领导者。"}]}],"synonyms":["follow","trail","go after","pursue","follower"],"phonetic":"/ˈfɑloʊ/","extraExplanation":["“foller”多见于英语口语方言或为了表现人物口音/身份的文学对白中（例如美国南部或乡村口语），在正式写作里通常用标准拼写“follow / follower”。","如果你是在作业、邮件或正式场合看到/想写这个词，建议改为“follow”（动词）或“follower”（名词）。"]}
{"word":"folles","summary":{"en":"“Folles” is the plural of “follis,” meaning large bronze coins from the late Roman and Byzantine periods.","zh":"“folles”是“follis”的复数，指罗马晚期与拜占庭时期的大型青铜币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of follis: a large bronze coin used in the later Roman and Byzantine Empires.","zh":"follis 的复数：罗马帝国晚期与拜占庭帝国使用的一种大型青铜（铜合金）货币。"},"examples":[{"en":"The archaeologists found several folles in the soil near the old road.","zh":"考古学家在旧路附近的土层里发现了几枚 folles（铜币）。"},{"en":"A single follis—or several folles—can help date a Byzantine site.","zh":"一枚 follis——或多枚 folles——可以帮助为拜占庭遗址断代。"}]}],"synonyms":["follises (also used)"],"phonetic":"/ˈfɑliz/","extraExplanation":["“follis”原意与“袋子、钱袋”有关，后来在罗马晚期成为一种较大的铜币名称；“folles”是其拉丁复数形式，因此多见于历史、考古、钱币学语境。","在现代英语里，人们也常直接用英语复数“follises”，但学术写作中“folles”更常见。"]}
{"word":"folletage","summary":{"en":"Folletage is a rare word meaning foliage—the mass of leaves on plants or trees.","zh":"Folletage 是个罕用词，意思是 foliage：植物或树木的叶子整体、枝叶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the leaves of plants considered as a mass; foliage.","zh":"（罕用）指植物的叶子整体；叶丛；树叶（同 foliage）。"},"examples":[{"en":"The garden was thick with folletage after the spring rains.","zh":"春雨过后，花园里枝叶（folletage）繁茂。"},{"en":"Birds hid in the folletage to escape the midday heat.","zh":"鸟儿躲在浓密的树叶间，避开正午的炎热。"}]}],"synonyms":["foliage","leafage","greenery","leaves"],"phonetic":"/ˈfɑlətɪdʒ/","extraExplanation":["“folletage”是“foliage”的少见变体，多见于较旧或较文学化的语境中。日常英语更常用“foliage”。","词源上与法语中表示“叶子/树叶”的表达有关（与“foliage”同源），因此带有一点书面、描写性的气质。"]}
{"word":"folletti","summary":{"en":"Folletti means “little goblins/elf-like spirits” in Italian (plural of folletto), often playful and mischievous in folklore.","zh":"Folletti 是意大利语，指“妖精/小精怪”（folletto 的复数），在民间传说里多为顽皮、爱恶作剧的精灵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian, plural) little goblins/house-spirits; mischievous elf-like creatures in folklore.","zh":"（意大利语，复数）小妖精/小精怪；民间传说中爱恶作剧、像精灵或地精一样的生物。"},"examples":[{"en":"In the story, the folletti hide your keys and laugh at night.","zh":"在故事里，folletti 会把你的钥匙藏起来，晚上还会偷笑。"},{"en":"The old legend says the folletti live in the woods and play tricks on travelers.","zh":"古老的传说说，folletti 住在森林里，会捉弄旅人。"}]}],"synonyms":["folletto (singular)","goblins","sprites","elves"],"phonetic":"/foˈlɛti/","extraExplanation":["“folletti”是意大利语名词“folletto”的复数形式。单数是 folletto（一个小妖精），复数是 folletti（一群小妖精）。","在意大利民间传统里，folletto/folletti 常被描写为顽皮、爱捉弄人的小精灵或家宅精怪，形象介于英语里的 “elf / goblin / sprite” 之间；翻译时可根据语境选择“妖精、地精、小精灵、小鬼”。","与英语“goblin”相比，folletti 不一定邪恶，更常见的是“恶作剧、调皮”的气质。"]}
{"word":"folletto","summary":{"en":"Folletto is an Italian word meaning a mischievous little goblin/imp, and in Italy it’s also widely used to mean a Vorwerk vacuum cleaner.","zh":"Folletto 是意大利语，指调皮的小妖精／小鬼怪；在意大利也常用来指福维克（Vorwerk）的吸尘器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) a little goblin, imp, or elf-like spirit in Italian folklore.","zh":"（意大利语）小妖精／小鬼怪；意大利民间传说中的精灵般小生灵。"},"examples":[{"en":"In the story, a folletto hides the keys and giggles in the dark.","zh":"在故事里，一个 folletto 把钥匙藏起来，在黑暗中咯咯笑。"},{"en":"Italian folktales often describe a folletto as mischievous rather than truly evil.","zh":"意大利民间故事常把 folletto 描写成爱恶作剧，但不一定很邪恶。"}]},{"partOfSpeech":"n.","definition":{"en":"(Italy) a brand name commonly used for a Vorwerk vacuum cleaner (often used like a common noun).","zh":"（意大利）常用来指福维克（Vorwerk）吸尘器的品牌名（有时像普通名词一样使用）。"},"examples":[{"en":"My aunt says, “Pass me the Folletto,” meaning the vacuum cleaner.","zh":"我阿姨会说“把 Folletto 递给我”，意思是吸尘器。"},{"en":"In Italy, some people call any similar vacuum a “Folletto,” like how some say “Kleenex.”","zh":"在意大利，有些人会把类似的吸尘器也叫“Folletto”，有点像有人把纸巾都叫“Kleenex”。"}]}],"synonyms":["goblin","imp","sprite","elf","house spirit"],"phonetic":"/foʊˈlɛtoʊ/","extraExplanation":["“Folletto”在意大利语里带有“小精灵、小妖怪”的感觉，常见形象是调皮、爱捉弄人（例如藏东西、制造声响），更偏向“淘气的精灵”而不一定是恐怖怪物。","作为品牌名时，Folletto在意大利非常家喻户晓，所以会出现“品牌名泛化”的现象：用品牌名直接指代物品本身，类似英语里把纸巾叫Kleenex、把创可贴叫Band-Aid。"]}
{"word":"follicle","summary":{"en":"A follicle is a small sac-like structure, most commonly a hair follicle in the skin or an ovarian follicle that develops an egg.","zh":"follicle 指“小囊状结构”，最常见是皮肤中的毛囊，也可指卵巢中帮助卵子发育的卵泡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small sac in the skin (or an organ) that produces something, especially a hair root in the skin.","zh":"小囊；（皮肤或器官中的）小袋状结构，用来生成某物，尤指皮肤里的毛囊（长出头发/体毛的根部）。"},"examples":[{"en":"Shaving can irritate hair follicles and cause red bumps.","zh":"刮毛可能会刺激毛囊，导致红色小疙瘩。"},{"en":"This shampoo is designed to keep the scalp clean and support healthy follicles.","zh":"这款洗发水旨在保持头皮清洁并帮助毛囊更健康。"}]},{"partOfSpeech":"n.","definition":{"en":"A small structure in an ovary that contains and helps a developing egg.","zh":"（卵巢）卵泡：包含并帮助卵子发育的小结构。"},"examples":[{"en":"An ultrasound showed a growing follicle in the ovary.","zh":"超声检查显示卵巢里有一个正在生长的卵泡。"},{"en":"During the cycle, a mature follicle releases an egg.","zh":"在月经周期中，成熟卵泡会释放卵子。"}]}],"synonyms":["sac","pore (hair pore, informal)","ovarian follicle (specific term)"],"phonetic":"/ˈfɑlɪkəl/","extraExplanation":["“Follicle”来自拉丁语“folliculus”（小袋子/小囊），所以它常用来指“袋状、囊状”的生物结构。日常英语里最常见的是“hair follicle（毛囊）”。在医学或生物课本里，也常见“ovarian follicle（卵巢卵泡）”。"]}
{"word":"follicle-associated","summary":{"en":"“Follicle-associated” means related to a follicle—most often a hair follicle in skin, or a lymphoid follicle in immunology.","zh":"“follicle-associated”意为“与滤泡/毛囊有关的”，最常见指皮肤中的毛囊；在免疫学中也可指淋巴滤泡相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, located near, or happening in relation to a follicle (a small sac-like structure, especially a hair follicle in the skin).","zh":"与“滤泡/毛囊”等小囊状结构有关的；与其相连、靠近或发生在其周围的（尤指皮肤中的毛囊）。"},"examples":[{"en":"Follicle-associated bacteria can cause small bumps and irritation on the skin.","zh":"与毛囊相关的细菌可能引起皮肤上小丘疹和刺激。"},{"en":"The doctor examined a follicle-associated rash on his scalp.","zh":"医生检查了他头皮上一种与毛囊相关的皮疹。"}]},{"partOfSpeech":"adj.","definition":{"en":"In immunology, related to lymphoid follicles in tissues (clusters of immune cells), often describing immune cells or areas connected to these follicles.","zh":"（免疫学）与淋巴组织中的淋巴滤泡（免疫细胞的聚集区）有关的；常用于描述与滤泡相连的免疫细胞或区域。"},"examples":[{"en":"Follicle-associated T cells help support antibody-producing responses.","zh":"滤泡相关的T细胞有助于支持产生抗体的免疫反应。"},{"en":"The report described follicle-associated epithelium in the intestine.","zh":"报告描述了肠道中的滤泡相关上皮。"}]}],"synonyms":["follicular","follicle-related","hair-follicle–associated","lymphoid follicle–associated"],"phonetic":"/ˈfɑlɪkəl əˈsoʊsieɪtɪd/","extraExplanation":["这是一个复合形容词：follicle（滤泡/毛囊）+ associated（相关的）。在医学和生物学写作中很常见，属于“X-associated（与X相关的）”这种高频结构。","具体指哪种“follicle”要看语境：皮肤科多指“毛囊（hair follicle）”；免疫/病理学多指“淋巴滤泡（lymphoid follicle）”。读论文或检验报告时，先确认领域再确定译法更准确。"]}
{"word":"follicle-related","summary":{"en":"Follicle-related means connected with or affecting a follicle, especially a hair follicle.","zh":"Follicle-related 指与滤泡有关的，尤其常指与毛囊有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, involving, or affecting a follicle (most often a hair follicle, but sometimes an ovarian follicle).","zh":"与“滤泡”有关的；涉及或影响滤泡的（最常指毛囊，有时也指卵巢滤泡）。"},"examples":[{"en":"The doctor said the bumps were follicle-related irritation from shaving.","zh":"医生说这些小疙瘩是剃毛引起的毛囊相关刺激。"},{"en":"She switched to a gentler cleanser to reduce follicle-related breakouts.","zh":"她换了更温和的洁面产品来减少毛囊相关的痘痘/爆痘。"},{"en":"The report discussed follicle-related changes seen in ultrasound images.","zh":"报告讨论了超声图像中看到的滤泡相关变化。"}]}],"synonyms":["follicular","hair-follicle-related","follicle-associated"],"phonetic":"/ˈfɑlɪkəl rɪˌleɪtɪd/","extraExplanation":["“follicle-related”是由名词“follicle（滤泡/毛囊）+ related（相关的）”构成的复合形容词，常见于医学、皮肤科与健康科普写作中。","日常表达里也可不用连字符，写作“follicle related”。在正式/学术写作中，加连字符更清晰，表示它们共同修饰后面的名词（如“follicle-related inflammation”）。","语境上如果谈皮肤问题，通常默认指“hair follicles（毛囊）”；如果谈生殖与激素、排卵、超声检查等，才更可能指“ovarian follicles（卵巢滤泡）”。"]}
{"word":"follicles","summary":{"en":"Follicles are small sacs or structures in the body, commonly hair follicles (where hair grows) or ovarian follicles (in the ovary).","zh":"Follicles 指体内的小囊状结构，常见为毛囊（长头发的地方）或卵泡（卵巢里的结构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small sacs in the skin (especially on the scalp) where hair grows; also, a tiny structure in the body that can produce or hold something (such as an egg cell in the ovary).","zh":"“囊/小囊”，常指皮肤里（尤其头皮上）长出毛发的毛囊；也可指体内产生或容纳某物的微小结构（如卵巢中的卵泡）。"},"examples":[{"en":"Blocked hair follicles can cause acne or small bumps on the skin.","zh":"毛囊堵塞可能导致痤疮或皮肤上出现小疙瘩。"},{"en":"The doctor checked her ovaries and noted several healthy follicles.","zh":"医生检查了她的卵巢，并记录到几个健康的卵泡。"}]}],"synonyms":["hair roots","pores","ovarian follicles"],"phonetic":"/ˈfɑlɪkəlz/","extraExplanation":["“Follicles”是“follicle”的复数形式。日常语境里最常见的是“hair follicles（毛囊）”，而在医学/生殖健康语境中常指“ovarian follicles（卵泡）”。","和头发相关的常见搭配：hair follicle（毛囊）、follicle damage（毛囊受损）、follicle inflammation/folliculitis（毛囊炎）。注意：folliculitis 是感染/炎症的医学术语。"]}
{"word":"follicular","summary":{"en":"Follicular means “related to a follicle,” especially a small sac-like structure in the body (often hair follicles or ovarian follicles).","zh":"Follicular 指“与滤泡/毛囊等小囊状结构有关的”，常用于医学与生物学（如毛囊或卵巢滤泡）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a follicle (a small sac or cavity in the body), especially in biology or medicine.","zh":"与“滤泡/毛囊”等小囊状结构有关的（尤用于生物学或医学）。"},"examples":[{"en":"The report described a follicular pattern under the microscope.","zh":"报告描述了显微镜下的滤泡样结构。"},{"en":"Follicular cells help support and develop the egg in the ovary.","zh":"卵巢中的滤泡细胞帮助支持并促进卵子发育。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating specifically to the hair follicle (the tiny structure in the skin where hair grows).","zh":"特指与毛囊有关的（头发从皮肤里生长的微小结构）。"},"examples":[{"en":"The dermatologist examined the follicular openings on his scalp.","zh":"皮肤科医生检查了他头皮上的毛囊开口。"},{"en":"Some skin bumps are caused by inflammation around a follicle (follicular inflammation).","zh":"有些皮肤小疙瘩是由毛囊周围发炎引起的（毛囊性炎症）。"}]}],"synonyms":["follicle-related","follicle-associated"],"phonetic":"/fəˈlɪk.jə.lɚ/","extraExplanation":["“follicular”常见于医学/生物语境：例如“follicular phase（卵泡期）”“follicular lymphoma（滤泡性淋巴瘤）”“follicular thyroid cancer（滤泡型甲状腺癌）”。这些都强调“呈滤泡结构”或“来源于滤泡细胞”。","词根小提示：follicle 来自拉丁语 *folliculus*（小袋子）。所以 follicular 的核心含义就是“像小囊/小袋结构那样的；与小囊结构相关的”。"]}
{"word":"folliculate","summary":{"en":"Folliculate means “having follicles” or “follicle-like,” used mostly in scientific descriptions.","zh":"Folliculate 指“具有小囊/卵泡/毛囊等结构的；呈小囊状的”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Having follicles (small sac-like structures), or covered with follicles; follicular.","zh":"（生物）具小囊（卵泡/毛囊等）的；有卵泡的；呈小囊状结构的（=follicular）。"},"examples":[{"en":"In some plants, the fruit is described as folliculate because it develops from a follicle.","zh":"在一些植物中，果实可被描述为“folliculate（具小囊的）”，因为它由小囊（蓇葖）发育而来。"},{"en":"The report mentioned a folliculate surface under the microscope.","zh":"报告提到在显微镜下可见“folliculate（具小囊的）”表面结构。"}]}],"synonyms":["follicular","saclike","pouched"],"phonetic":"/fəˈlɪkjəˌleɪt/","extraExplanation":["“folliculate”较少用于日常英语，多见于植物学、解剖学或显微结构描述。更常见的对应词是“follicular”（如：follicular cyst 卵泡囊肿；follicular phase 卵泡期）。","词根来自拉丁语 *folliculus*（小袋、小囊），与“follicle（小囊/毛囊/卵泡）”同源。"]}
{"word":"folliculated","summary":{"en":"“Folliculated” means having or looking like follicles (small sac-like structures), used mainly in scientific/medical contexts.","zh":"“folliculated”指“具滤泡的/呈滤泡状的”，主要用于医学或生物学等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or covered with small sac-like structures (follicles), such as hair follicles or gland follicles; (in biology/botany) marked by follicle-like cavities or structures.","zh":"具滤泡的；被小囊状结构（滤泡）覆盖的（如毛囊、腺体滤泡）；（生物/植物学）呈滤泡状结构或带滤泡样腔隙的。"},"examples":[{"en":"Under the microscope, the glandular tissue looked distinctly folliculated.","zh":"在显微镜下，这块腺体组织看起来明显呈滤泡状。"},{"en":"Some insects have a folliculated surface texture that helps protect their body.","zh":"有些昆虫的体表呈滤泡状纹理，有助于保护身体。"}]}],"synonyms":["follicular","pitted","saclike","glandular (context-dependent)"],"phonetic":"/fəˈlɪk.jəˌleɪ.tɪd/","extraExplanation":["“folliculated”多见于医学、组织学和生物学写作，日常英语中很少用。它来自拉丁语词根 *folliculus*（“小囊、囊状物”），因此常用来描述“像小囊一样分布的结构”。","学习时可顺带记：**follicle**（滤泡/毛囊）→ **follicular**（滤泡的）→ **folliculated**（呈滤泡状的、带滤泡的）。其中 *follicular* 更常见，*folliculated* 更偏“形态描述”。"]}
{"word":"follicule","summary":{"en":"A follicle is a small sac in the body, most commonly a hair follicle in the skin; in medicine it can also mean structures like ovarian follicles.","zh":"follicle 指人体内的小囊状结构，最常见是皮肤里的毛囊；在医学中也可指卵泡等结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small sac (pouch) in the body that holds or produces something, especially a hair root in the skin.","zh":"人体中的小囊状结构，用来包裹或生成某种东西；尤指皮肤里的毛囊（毛根所在处）。"},"examples":[{"en":"Each hair grows from a follicle under the skin.","zh":"每根头发都从皮肤下面的一个毛囊里长出来。"},{"en":"Clogged follicles can lead to acne.","zh":"毛囊堵塞可能会导致痘痘。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/medicine, a small cavity or gland-like sac, such as an ovarian follicle that contains and helps develop an egg.","zh":"（生物/医学）一种小腔或腺样囊，如卵巢卵泡，内含卵细胞并帮助其发育。"},"examples":[{"en":"An ovarian follicle releases an egg during ovulation.","zh":"排卵时，卵巢卵泡会释放卵子。"},{"en":"The doctor monitored follicle growth with ultrasound.","zh":"医生用超声监测卵泡的生长情况。"}]}],"synonyms":["sac","pouch","cavity"],"phonetic":"/ˈfɑlɪˌkjuːl/","extraExplanation":["词源来自拉丁语 folliculus，意为“装小东西的小袋子”。因此在英语里它常用来指“囊、袋状结构”。","日常生活中最常见的搭配是 hair follicle（毛囊）。在医学语境里也常见 ovarian follicle（卵泡）。"]}
{"word":"folliculin","summary":{"en":"Folliculin is a protein encoded by the FLCN gene, studied mainly in medical genetics and cell growth regulation.","zh":"Folliculin 是由 FLCN 基因编码的蛋白质，主要在医学遗传学与细胞生长调控领域讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein made by the FLCN gene; it helps regulate how cells grow and use energy, and changes (mutations) in this gene can be linked to certain inherited conditions.","zh":"由FLCN基因产生的一种蛋白质；它参与调控细胞生长与能量利用；该基因的突变可能与某些遗传性疾病有关。"},"examples":[{"en":"Researchers study folliculin to understand how cells control growth signals.","zh":"研究人员研究folliculin，以了解细胞如何控制生长信号。"},{"en":"A mutation in the FLCN gene can affect the function of folliculin.","zh":"FLCN基因的突变会影响folliculin的功能。"},{"en":"Folliculin is often discussed in medical genetics rather than everyday English.","zh":"Folliculin常见于医学遗传学语境，而不是日常英语。"}]}],"synonyms":["FLCN","folliculin protein"],"phonetic":"/fəˈlɪk.jə.lɪn/","extraExplanation":["Folliculin 通常缩写为 FLCN（基因名也叫 FLCN）。在临床与研究中，它常与一种罕见的遗传病 Birt–Hogg–Dubé（伯特–霍格–迪贝）综合征相关，该综合征可出现皮肤纤维毛囊瘤、肺囊肿/自发性气胸，以及肾脏肿瘤风险增加。","这是偏专业的生物医学词汇：日常交流中几乎不会用到，多见于论文、遗传检测报告、或医学科普。"]}
{"word":"folliculina","summary":{"en":"Folliculina is a genus of aquatic ciliates that often live in small bottle-like cases attached to surfaces.","zh":"Folliculina 是一种水生纤毛虫属，常在附着表面建造并居住于瓶状小壳（管居）中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of ciliated protozoans (single-celled organisms) that live in water and often build a small, bottle-shaped case (a tube) attached to surfaces such as plants, shells, or other animals","zh":"（纤毛虫的一属）一种生活在水中的单细胞原生生物，常会建造并居住在附着于水草、贝壳或其他动物表面的“瓶状/管状小壳（管居）”中"},"examples":[{"en":"Under the microscope, we saw Folliculina living inside tiny, vase-like cases on the algae.","zh":"在显微镜下，我们看到藻类表面有住在小小“花瓶状”外壳里的 Folliculina。"},{"en":"The biologist noted that Folliculina can form dense patches on submerged surfaces in calm water.","zh":"生物学家指出，Folliculina 在平静水域的水下表面可能形成密集的附着斑块。"}]}],"synonyms":["ciliate","protozoan","ciliophoran"],"phonetic":"/fəˌlɪkjəˈlaɪnə/","extraExplanation":["词源提示：名称可能与拉丁语 *folliculus*（小囊、小袋）有关，用来形容它常见的“囊/瓶状”居所外形。","学习提示：这是生物分类学中的属名，写作 **Folliculina**（首字母大写），复数或泛指时常仍用同形；在非正式语境也有人用小写指代这一类群。"]}
{"word":"folliculitis","summary":{"en":"Folliculitis is inflammation or infection of hair follicles, often causing small red, itchy or tender bumps.","zh":"Folliculitis（毛囊炎）是毛囊的炎症或感染，常表现为小红疙瘩，可能发痒或疼痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation or infection of one or more hair follicles (the tiny pockets in the skin where hair grows), often causing small red bumps or pimples.","zh":"毛囊炎：一个或多个毛囊（皮肤里长毛的微小“口袋”）发生炎症或感染，常出现小红疙瘩或像痘痘一样的丘疹。"},"examples":[{"en":"After shaving, I got folliculitis on my neck—small red bumps that felt itchy.","zh":"剃完胡子后，我脖子上起了毛囊炎——一片小红疙瘩，很痒。"},{"en":"The doctor said the hot tub likely caused folliculitis and recommended keeping the area clean and dry.","zh":"医生说很可能是泡热水浴导致的毛囊炎，并建议保持患处清洁干燥。"}]}],"synonyms":["hair follicle inflammation","infected hair follicle","razor bumps (related)"],"phonetic":"/fəˌlɪk.jəˈlaɪ.tɪs/","extraExplanation":["“folliculitis”常见诱因包括：剃毛/脱毛后的摩擦与细菌进入毛囊、穿太紧或不透气的衣物造成闷热出汗、共用或清洁不佳的热水浴池（有时会出现“hot-tub folliculitis”）。","日常表达里也会说“razor bumps（剃刀疙瘩）”或“ingrown hairs（内生毛）”，但它们不一定完全等同于毛囊炎：剃刀疙瘩/内生毛更强调毛发倒长或刺激；毛囊炎更强调毛囊的炎症/感染。","注意这是医学词汇；如果出现明显疼痛、脓包扩散、发烧或反复发作，通常建议就医评估。"]}
{"word":"folliculose","summary":{"en":"Folliculose means “having many small follicles,” mainly used in scientific or medical contexts.","zh":"folliculose 指“有许多小囊状结构（毛囊/滤泡等）的”，主要用于医学或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Having or covered with small follicles (tiny sac-like structures), such as hair follicles or gland follicles.","zh":"（生物/医学）有（许多）小囊状结构（毛囊、腺泡等）的；布满小“囊/泡”的。"},"examples":[{"en":"The dermatologist noted a folliculose pattern around the hairline, suggesting irritation of the hair follicles.","zh":"皮肤科医生注意到发际线周围呈现毛囊样分布，提示毛囊受刺激。"},{"en":"Some plants have folliculose surfaces, dotted with small gland-like pits.","zh":"有些植物表面呈囊泡状/毛囊状，布满类似小腺体的凹点。"}]}],"synonyms":["follicular","folliculated","pitted (in botanical descriptions)"],"phonetic":"/fəˈlɪk.jəˌloʊs/","extraExplanation":["“folliculose”较少见，多出现在医学或植物学等专业语境里。它来自拉丁语词根 follicul-（小袋、小囊），与 follicle（毛囊/滤泡）同源。日常英语中更常用的表达通常是 “follicular”（毛囊的/滤泡的）或 “with follicles”（有毛囊的/有滤泡的）。"]}
{"word":"folliculosebaceous","summary":{"en":"A medical adjective meaning “related to hair follicles and oil (sebaceous) glands.”","zh":"医学形容词：指“与毛囊和皮脂腺（油脂腺）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hair follicles and sebaceous (oil) glands of the skin.","zh":"（皮肤学）与毛囊及皮脂腺（分泌油脂的腺体）有关的。"},"examples":[{"en":"Acne is a common disorder of the folliculosebaceous unit.","zh":"痤疮是一种常见的毛囊皮脂腺单位疾病。"},{"en":"The medicine reduces inflammation in the folliculosebaceous area.","zh":"这种药物可减轻毛囊皮脂腺区域的炎症。"}]}],"synonyms":["follicular and sebaceous","pilosebaceous (more common in dermatology)"],"phonetic":"/fəˌlɪk.jəˌloʊ.səˈbeɪ.ʃəs/","extraExplanation":["这是一个医学/皮肤科用语，常见搭配是 **folliculosebaceous unit**（毛囊皮脂腺单位），指“毛囊 + 皮脂腺 + 导管（以及常包含立毛肌）”作为一个功能整体。痤疮、毛囊炎等问题常与这个“单位”的堵塞或炎症有关。","词形可拆解理解：**folliculo-**（毛囊）+ **sebaceous**（皮脂的/皮脂腺的）。日常英语里很少用，主要出现在医学教材、论文或皮肤科说明中。"]}
{"word":"folliculosis","summary":{"en":"Folliculosis is a medical term for an abnormal condition affecting hair follicles, often seen as bumps around follicles.","zh":"Folliculosis 是指毛囊出现异常状况的医学术语，常表现为毛囊周围的小疙瘩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) A condition in which hair follicles become inflamed or develop abnormal changes, often showing as small bumps or pimples around hair follicles.","zh":"（医学）毛囊发生炎症或出现异常改变的状况，常表现为毛囊周围的小丘疹、痘样小疙瘩。"},"examples":[{"en":"The doctor said the itchy bumps were likely folliculosis caused by irritation and sweat.","zh":"医生说这些发痒的小疙瘩很可能是由刺激和出汗引起的毛囊病变（folliculosis）。"},{"en":"Good hygiene and avoiding tight clothing helped reduce her folliculosis on the thighs.","zh":"保持清洁并避免穿太紧的衣物，帮助她减轻了大腿上的毛囊问题（folliculosis）。"}]}],"synonyms":["follicular disorder","follicular disease","folliculitis (often used in similar contexts)"],"phonetic":"/fəˌlɪk.jəˈloʊ.sɪs/","extraExplanation":["这个词在日常英语中非常少见，更多出现在医学或皮肤科语境里。有时会与更常见的“folliculitis（毛囊炎）”混用或被用来笼统指“毛囊相关的病变”。如果你是在化验单/病历/论文里看到它，最好结合上下文或请医生确认具体指的是炎症、感染，还是其他毛囊异常。","词根提示：follicul- 来自拉丁语，意思是“小囊/小袋”，医学上常指“毛囊”；-osis 常表示“疾病/状态”。"]}
{"word":"folliculous","summary":{"en":"“Folliculous” means having follicles or a follicle-like, pouchy structure (a rare technical adjective).","zh":"“Folliculous”指“具有滤泡/囊状结构的”，是较少见的学术形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small sacs or pouches (follicles), or covered with/formed by follicles; follicle-like.","zh":"具有小囊（滤泡/卵泡/毛囊等）结构的；由许多小囊构成的；呈囊状的。"},"examples":[{"en":"Some plants produce a folliculous fruit that splits open to release seeds.","zh":"有些植物会结出囊状的果实，成熟后裂开释放种子。"},{"en":"Under the microscope, the tissue shows a folliculous pattern.","zh":"在显微镜下，这种组织呈现出滤泡样的结构。"}]}],"synonyms":["follicular","pouched","saclike"],"phonetic":"/fəˈlɪkjələs/","extraExplanation":["“Folliculous”是比较少见的学术用词，多见于植物学、解剖学或病理学语境，用来描述“由许多小囊/小泡构成”的外观或结构。","词根来自拉丁语“folliculus”（小袋、小囊），和常见词“follicle（毛囊/卵泡/滤泡）”同源。"]}
{"word":"follied","summary":{"en":"“Follied” is a rare past form meaning “acted foolishly,” and in older use it can mean “made someone look foolish.”","zh":"“follied”较少见，主要表示“做了蠢事/行为愚蠢”；较古老用法还可指“愚弄某人、让人出丑”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “folly”: to act in a foolish or silly way (rare in modern English).","zh":"“folly”的过去式/过去分词：做蠢事；行为愚蠢、傻气（现代英语中较少用作动词）。"},"examples":[{"en":"He follied away the afternoon instead of studying.","zh":"他下午一直在胡闹混时间，而不是学习。"},{"en":"They knew they had follied, and they apologized.","zh":"他们知道自己做了蠢事，于是道歉了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(archaic) To make someone look foolish; to trick or ridicule someone.","zh":"（古义）让某人显得很傻；愚弄或嘲弄某人。"},"examples":[{"en":"He felt he had been follied by false promises.","zh":"他觉得自己被虚假的承诺给愚弄了。"}]}],"synonyms":["acted foolishly","messed around","behaved stupidly","made a fool of (someone)","tricked"],"phonetic":"/ˈfɑlid/","extraExplanation":["“follied”来自名词“folly（愚蠢、蠢事）”的动词用法，但这种动词在当代并不常见。更自然的表达通常是：acted foolishly / did something foolish / messed around。","拼写上遵循英语规则：以辅音字母 + y 结尾的动词变过去式时，y 变 i 再加 -ed：folly → follied。"]}
{"word":"follies","summary":{"en":"“Follies” can mean foolish actions or mistakes, and it can also mean decorative garden buildings built for show.","zh":"“follies”既可指愚蠢的行为/过失，也可指园林中为观赏而建的装饰性建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Foolish actions, mistakes, or lack of good judgment (plural of “folly”).","zh":"愚蠢的行为；过失；缺乏判断力的做法（“folly”的复数）。"},"examples":[{"en":"In her memoir, she writes openly about the follies of youth.","zh":"在她的回忆录里，她坦率地写到了年轻时的种种愚蠢之举。"},{"en":"History is full of leaders whose follies caused unnecessary suffering.","zh":"历史上不乏领导人的愚蠢决策造成了不必要的苦难。"}]},{"partOfSpeech":"n.","definition":{"en":"Ornamental buildings (often in gardens or parks) built mainly for decoration rather than practical use.","zh":"（常见于花园/公园的）装饰性建筑；“奇趣建筑”（主要为观赏而建，实用性不强）。"},"examples":[{"en":"The estate is famous for its 18th-century garden follies.","zh":"这座庄园以其18世纪的花园装饰性建筑而闻名。"},{"en":"They walked past a mock ruin—one of the park’s most photographed follies.","zh":"他们走过一处仿造的废墟——那是公园里最常被拍照的装饰性建筑之一。"}]}],"synonyms":["mistakes","foolishness","errors","blunders","indiscretions","vanities","ornamental structures","garden buildings"],"phonetic":"/ˈfɑliz/","extraExplanation":["“folly”来自法语词源，核心含义是“愚蠢/缺乏判断”。在文学里常用来带一点反思或讽刺的语气，如谈“the follies of mankind（人类的愚行）”。","建筑意义上的“folly”在18—19世纪英国贵族园林中很常见，比如仿古神庙、假废墟、小塔等，用来营造风景和气氛，而不是为居住或防御。"]}
{"word":"folliful","summary":{"en":"“folliful” isn’t a recognized English word; it’s likely a misspelling (possibly “foliage,” “fruitful,” or “follicle”).","zh":"“folliful”不是常见或标准英语词；很可能是拼写错误（可能想写“foliage / fruitful / follicle”等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling.","zh":"不是标准英语单词；很可能是拼写错误。"},"examples":[{"en":"I can’t find “folliful” in an English dictionary—did you mean “foliage” or “fruitful”?","zh":"我在英语词典里找不到“folliful”——你想说的是“foliage（树叶/叶子）”还是“fruitful（富有成效的/多产的）”吗？"}]}],"phonetic":"/ˈfɑːlɪfəl/","extraExplanation":["“folliful”在常见词典（如 Merriam-Webster、Cambridge）中通常查不到。最接近的可能是：\n1) foliage /ˈfoʊliɪdʒ/：指“（树木的）叶子、枝叶”。\n2) fruitful /ˈfruːtfəl/：指“多产的；富有成果的”。\n3) follicle /ˈfɑːlɪkəl/：指“毛囊；卵泡”（偏医学/生物）。\n如果你能提供一句包含它的原句或你想表达的意思（比如“长满叶子的”还是“有成果的”），我可以帮你确定正确单词并给出准确用法。"]}
{"word":"follily","summary":{"en":"“Follily” (rare/archaic) means “foolishly; without good judgment.”","zh":"“follily”（罕见/古用）表示“愚蠢地；不明智地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare/archaic) In a foolish way; without good judgment.","zh":"（罕见/古用）愚蠢地；欠考虑地；缺乏判断地。"},"examples":[{"en":"He acted follily and lost the trust of his friends.","zh":"他行事愚蠢，失去了朋友们的信任。"},{"en":"It would be follily to spend all your savings on a risky plan.","zh":"把所有积蓄都花在一个高风险计划上会很不明智。"}]}],"synonyms":["foolishly","stupidly","recklessly","unwisely"],"phonetic":"/ˈfɑːlɪli/","extraExplanation":["“follily”是非常少见的拼写/用法，多见于较老的英语文本；现代英语里更常用的是“foolishly”（愚蠢地、不明智地）。如果你在写作或考试中使用，建议优先选“foolishly”，读者更容易理解。"]}
{"word":"follis","summary":{"en":"Follis most commonly means an ancient Roman (late Roman/Byzantine) bronze coin.","zh":"Follis最常见的意思是古罗马（晚期/拜占庭）的一种青铜硬币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of ancient Roman coin, especially a late Roman/Byzantine bronze coin (often fairly large and sometimes silver-washed).","zh":"一种古罗马硬币，尤指罗马晚期/拜占庭时期的青铜币（通常较大，有时表面带银色镀层）。"},"examples":[{"en":"The museum displayed a follis from the reign of Diocletian.","zh":"博物馆展出了一枚戴克里先统治时期的follis（福利斯）硬币。"},{"en":"Collectors often study the inscriptions on a follis to date it.","zh":"收藏者常通过研究follis上的铭文来为其断代。"}]},{"partOfSpeech":"n.","definition":{"en":"(anatomy, less common) a small bag- or sac-like structure; a pouch.","zh":"（解剖学，较少见）囊状/袋状的小结构；小囊。"},"examples":[{"en":"In some older anatomical texts, the term follis refers to a small sac.","zh":"在一些较早的解剖学文献中，follis可指一个小囊。"}]}],"synonyms":["ancient coin","bronze coin","Roman coin"],"phonetic":"/ˈfɑlɪs/","extraExplanation":["“Follis”来自拉丁语，原意与“皮囊/钱袋”有关，后来被用于指代特定时期的一类货币，因此在钱币学（numismatics）里最常见。","发音与常见英语词不太像，学习时可把它当作专有名词：用于罗马晚期到拜占庭的钱币分类。"]}
{"word":"follises","summary":{"en":"Likely intended word: follicle—a small sac in the body (e.g., hair follicle or ovarian follicle); also a type of plant fruit.","zh":"你可能想写的是 follicle（复数 follicles）：体内的小囊状结构（如毛囊、卵泡）；也可指一种植物果实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small sac or pocket in the body, especially one that produces something (such as hair or eggs).","zh":"（生物）小囊、小腔；尤指能生成某物的结构（如毛发或卵细胞）。"},"examples":[{"en":"Hair grows from follicles under the skin.","zh":"毛发从皮肤下的毛囊中生长出来。"},{"en":"The doctor examined the ovarian follicles on the ultrasound.","zh":"医生在超声检查中观察了卵巢卵泡。"}]},{"partOfSpeech":"n.","definition":{"en":"In plants, a dry fruit that opens on one side to release seeds.","zh":"（植物）蓇葖果；一种干果，成熟后从一侧裂开散播种子。"},"examples":[{"en":"Some plants produce seeds in follicles that split open when mature.","zh":"有些植物的种子长在蓇葖果里，成熟后果实会裂开。"}]}],"synonyms":["sac","pouch","gland (related in biology, not identical)"],"phonetic":"/ˈfɑlɪkəl/","extraExplanation":["“follises”不是常见英文单词，最可能是拼写想写“follicles”（follicle 的复数：毛囊/卵泡等）。","也有人把它误写成“follies”（folly 的复数，意为“愚蠢的行为/荒唐的事”）。如果你想查的是“follies”，告诉我语境我可以另给词条。"]}
{"word":"follow","summary":{"en":"Follow most commonly means to go after someone/something, obey instructions, understand an explanation, or happen next; it can also mean to subscribe to updates online.","zh":"Follow 最常见的意思是“跟随/跟着走、遵守指示、听懂/跟得上、随后发生”；在网络语境中也可表示“关注”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to go behind someone or something, or move in the same direction after them","zh":"跟在……后面走；跟随（同方向移动）"},"examples":[{"en":"The little boy followed his mother into the store.","zh":"小男孩跟着妈妈走进了商店。"},{"en":"A car followed us all the way home.","zh":"有一辆车一路跟着我们到家。"}]},{"partOfSpeech":"vt.","definition":{"en":"to do what someone says, or obey a rule, instruction, or plan","zh":"遵守；照着做（规则、指示、计划等）"},"examples":[{"en":"Please follow the instructions on the label.","zh":"请按照标签上的说明去做。"},{"en":"If you follow the rules, everyone stays safe.","zh":"如果你遵守规则，大家都会更安全。"}]},{"partOfSpeech":"vt.","definition":{"en":"to understand or pay attention to what is being said or what is happening","zh":"听懂；理解；跟得上（谈话或进展）"},"examples":[{"en":"Sorry—I didn’t quite follow your point.","zh":"不好意思——我没太听懂你的意思。"},{"en":"It’s a fast lecture, but try to follow.","zh":"这节课讲得很快，但尽量跟上。"}]},{"partOfSpeech":"vi.","definition":{"en":"to happen after something in time; come next","zh":"随后发生；接着发生"},"examples":[{"en":"A short silence followed his answer.","zh":"他回答后，随之而来的是短暂的沉默。"},{"en":"Spring follows winter.","zh":"冬去春来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to keep track of updates from a person, topic, or account (especially online)","zh":"关注（社交媒体上的人/话题/账号）"},"examples":[{"en":"I follow a few science channels on YouTube.","zh":"我在 YouTube 上关注了几个科普频道。"},{"en":"Do you follow this news story?","zh":"你有在关注这条新闻吗？"}]}],"synonyms":["trail","go after","obey","comply (with)","understand","keep up with"],"phonetic":"/ˈfɑloʊ/","extraExplanation":["“follow”在文学/叙事中常用来制造节奏感：如“A hush followed.”（随之而来的是一阵寂静），用“follow”表示某事发生后的自然结果或氛围变化。","口语里“Do you follow?”常用于确认对方是否理解，语气比“Do you understand?”更柔和、更像是在一起推进思路。","在社交媒体语境中，“follow”对应“关注”，名词形式是“follower”（粉丝/关注者）。"]}
{"word":"follow-ons","summary":{"en":"“Follow-ons” means later actions, events, or effects that come after something else; in investing, it can mean additional funding after an initial investment.","zh":"“follow-ons”指某事之后的后续行动/事件/影响；在投资语境中也可指首轮投资后的追加融资/追加投资。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that happen or are done after something else as a result or continuation; follow-up events, actions, or effects.","zh":"后续事项；随之而来的行动/事件/影响；延伸出来的结果。"},"examples":[{"en":"The meeting went well, but we still have several follow-ons to complete next week.","zh":"会议进展顺利，但下周我们还有好几个后续事项要完成。"},{"en":"A change in schedule can create follow-ons for the whole team.","zh":"日程的变动可能会给整个团队带来一连串后续影响。"},{"en":"The policy had unexpected follow-ons, including higher costs.","zh":"这项政策带来了意想不到的连锁后果，包括成本上升。"}]},{"partOfSpeech":"n.","definition":{"en":"In business and investing: additional rounds or add-on investments made after an initial investment (often called “follow-on funding”).","zh":"（商业/投资）追加投资；在首次投资之后进行的后续融资（常称“follow-on funding”）。"},"examples":[{"en":"The startup raised a seed round and later secured follow-ons from the same investors.","zh":"这家初创公司完成了种子轮，之后又从同一批投资人那里拿到了追加投资。"},{"en":"We’re reserving capital for follow-ons in our strongest portfolio companies.","zh":"我们预留资金，用于对表现最强的被投公司进行后续追加投资。"}]}],"synonyms":["follow-ups","aftermath","consequences","next steps","add-ons","subsequent actions"],"phonetic":"/ˈfɑˌloʊ ɑnz/","extraExplanation":["“follow-on / follow-ons”常见于职场和项目管理语境，强调“主事件之后必须处理的延伸任务/影响”。在风险投资语境里，它常指“后续融资/追加投资”，与“seed/Series A”等轮次概念一起出现。","拼写上也常见写法：follow-on（单数/形容词用法）、follow-ons（复数名词）。有时也会写作 follow on（较口语或较少见的分写形式）。"]}
{"word":"follow-the-leader","summary":{"en":"“Follow-the-leader” is a children’s copying game, and it can also describe mindless imitation in groups.","zh":"“follow-the-leader”既指儿童模仿领头人的游戏，也可比喻群体中的盲从/跟风行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A children’s game where one person (the leader) does an action or movement and everyone else copies it.","zh":"（儿童游戏）“跟着领头人做”，一个人当领头做动作/行为，其他人模仿。"},"examples":[{"en":"At recess we played follow-the-leader around the playground.","zh":"课间休息时，我们在操场上玩“跟着领头人做”。"},{"en":"She became the leader, and we all did silly walks in follow-the-leader.","zh":"她当了领头人，我们在“跟着领头人做”里一起学着搞笑走路。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a situation where people copy what someone else does instead of thinking or deciding for themselves.","zh":"（比喻）形容盲从、照着别人做，而不是自己思考或做决定。"},"examples":[{"en":"The meeting felt like follow-the-leader—everyone just agreed with the boss.","zh":"那次会议感觉像“跟着领头人做”——大家只是附和老板。"},{"en":"Don’t do follow-the-leader buying; research before you invest.","zh":"别盲目跟风买入；投资前先做调查。"}]}],"synonyms":["copycat","imitative","bandwagon behavior","monkey see, monkey do"],"phonetic":"/ˌfɑːloʊ ðə ˈliːdɚ/","extraExplanation":["这个说法最常见的语境是儿童游戏：领头人做动作（走路方式、拍手、跳跃、转弯等），其他人按顺序模仿。后来常被用作比喻，指“跟风/盲从”的群体行为。书写上常见连字符形式 follow-the-leader，也有人写作 follow the leader。"]}
{"word":"follow-through","summary":{"en":"Follow-through means completing what you start (and, in sports, the motion after a hit or throw).","zh":"Follow-through 指把事情做到底、落实执行；在体育中也指击球/投掷后的随挥动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of finishing what you start; continuing effort until a plan or task is completed","zh":"（把事情）做到底；贯彻到底；后续执行"},"examples":[{"en":"Good ideas are common, but follow-through is rare.","zh":"好点子很常见，但能贯彻到底的人很少。"},{"en":"She promised to help, and her follow-through was excellent.","zh":"她答应帮忙，而且后续执行做得非常到位。"}]},{"partOfSpeech":"n.","definition":{"en":"in sports, the continued motion after you hit, throw, or swing, which helps control power and accuracy","zh":"（体育运动中）随挥动作；跟进动作（击球/投掷/挥拍后的继续动作，有助于力量与准确性）"},"examples":[{"en":"Keep your eyes on the ball and finish your follow-through.","zh":"盯住球，并把随挥动作完成。"},{"en":"A smooth follow-through can improve your tennis serve.","zh":"流畅的随挥动作能提升你的网球发球。"}]}],"synonyms":["follow-up","completion","execution","carry-through","throughput"],"phonetic":"/ˈfɑˌloʊ ˌθru/","extraExplanation":["“follow-through”常用于职场与日常表达，强调“承诺之后的行动与落实”。比如：follow-through on a promise（兑现承诺）、lack of follow-through（缺乏执行力）。","在高尔夫、棒球、网球等运动里，它指动作完成后的“顺势延伸”，体现技术是否到位。"]}
{"word":"follow-up","summary":{"en":"A follow-up is a later action or event that continues or checks on something that happened earlier; it can also describe something done afterward (like a follow-up call or appointment).","zh":"follow-up 指在前一件事之后进行的后续行动/安排（如跟进电话、后续会议、复诊），也可作形容词表示“后续的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something done after an earlier action (such as a meeting, call, test, or interview) to check progress, get results, or continue the process.","zh":"在先前行动（如会议、电话、检查或面试）之后进行的后续行动，用于了解进展、获取结果或继续推进。"},"examples":[{"en":"The doctor scheduled a follow-up to discuss my test results.","zh":"医生安排了一次复诊（后续预约）来讨论我的检查结果。"},{"en":"Please send a follow-up email after the meeting.","zh":"会议后请发一封跟进邮件。"},{"en":"We need a follow-up to make sure the plan is working.","zh":"我们需要后续跟进，确保计划有效。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done after an earlier event to continue, confirm, or improve something.","zh":"在之前事件之后进行的，用于继续推进、确认情况或改进的。"},"examples":[{"en":"I have a follow-up appointment next week.","zh":"我下周有一次复诊（后续预约）。"},{"en":"The team held a follow-up meeting to finalize the details.","zh":"团队召开了后续会议来敲定细节。"}]}],"synonyms":["check-in","update","next step","review","revisit","return visit","follow-up call","follow-up meeting"],"phonetic":"/ˈfɑloʊˌʌp/","extraExplanation":["“follow-up”作名词时常见搭配：a follow-up call/email/visit/appointment/meeting。","书写上有三种常见形式：follow-up（名词/形容词最常见）、follow up（动词短语，如 “I will follow up with you.”）、followup（较少见，多见于某些英式或旧式写法）。","在商务语境里，“follow-up”通常强调“推进下一步/促成结果”；在医疗语境里常译为“复诊/复查”。"]}
{"word":"follow-ups","summary":{"en":"“Follow-ups” means later questions or actions after something earlier, especially to get more information or continue progress.","zh":"“follow-ups”指在先前事情之后进行的后续问题或跟进行动，用来补充信息或推进进展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Additional questions, actions, or contacts that happen after an earlier event or conversation to get more information or continue progress.","zh":"在先前事件或对话之后，为获取更多信息或推进事情而进行的追加问题、行动或联系。"},"examples":[{"en":"After the interview, the recruiter sent a few follow-ups by email.","zh":"面试后，招聘人员通过邮件发了几条后续跟进。"},{"en":"I have two follow-ups: When will the report be ready, and who will review it?","zh":"我有两个后续问题：报告什么时候完成？谁来审核？"},{"en":"The doctor scheduled follow-ups to check how the treatment was working.","zh":"医生安排了复诊随访来检查治疗效果。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of “follow-up” meaning follow-up contacts or steps in business, research, healthcare, or customer service.","zh":"“follow-up”的复数形式，指多次后续联系或后续步骤（常用于商务、研究、医疗、客服等场景）。"},"examples":[{"en":"We did follow-ups with customers to see if they were satisfied.","zh":"我们对客户做了后续回访，看看他们是否满意。"},{"en":"The study included follow-ups at three and six months.","zh":"该研究包含在三个月和六个月时的随访。"}]}],"synonyms":["subsequent questions","check-ins","next steps","updates","additional contacts"],"phonetic":"/ˈfɑˌloʊ ˌʌps/","extraExplanation":["“follow-up”既可以作名词（a follow-up / follow-ups），也常作形容词（a follow-up call 后续电话；follow-up questions 追问）。动词表达更常用“follow up (on/with)”，例如：I’ll follow up with you tomorrow.（我明天再跟你确认/联系。）","书写上：作名词或形容词时常见连字符“follow-up”；作动词短语时通常分开写“follow up”。不同机构风格指南可能略有差异，但这是最常见、最安全的用法。","语气与场景：在商务邮件里“follow-up(s)”很中性，表示礼貌推进；在医疗语境中常译为“复诊/随访”；在会议里常指“后续事项/行动项”。"]}
{"word":"followable","summary":{"en":"“Followable” means easy to follow—clear instructions or logic that people can understand and do.","zh":"“followable”表示“容易照着做/容易理解的”，常用于说明、步骤或逻辑清晰、让人跟得上。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Easy to understand and use; clear enough that someone can follow the steps, rules, or logic.","zh":"容易理解并照着做的；清晰到让人能跟得上步骤、规则或逻辑。"},"examples":[{"en":"The instructions are followable even for beginners.","zh":"这些说明即使对初学者来说也很容易照着做。"},{"en":"Try to write your code in a followable way, with clear comments.","zh":"尽量把代码写得容易读懂、能跟得上思路，并加上清楚的注释。"},{"en":"Her argument was simple and followable.","zh":"她的论点很简单，也很容易理解。"}]}],"synonyms":["easy to follow","clear","straightforward","understandable","coherent"],"phonetic":"/ˈfɑːləwəbəl/","extraExplanation":["“followable”在英语里可用，但不如“easy to follow”“clear”“straightforward”“user-friendly（更偏用户体验）”常见。写作更正式时通常改用这些更自然的表达。","词形来源：follow + -able（表示“能够被……的”）。因此“followable”直观上就是“能被跟随/照做的”。","语感小提醒：如果强调“说明/步骤”是否好执行，用“easy to follow / clear instructions”更地道；如果强调“逻辑/叙述”是否好理解，可用“clear / coherent / easy to understand”。"]}
{"word":"followed","summary":{"en":"“Followed” usually means “went after” or “came next,” and it can also appear in the set phrase “the following…” meaning “the next / listed below.”","zh":"“followed”通常表示“跟随”或“随后发生”；在固定搭配“the following…”中表示“接下来的/如下的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “follow” (to go after someone/something, or to come next in order).","zh":"“follow”的过去式和过去分词（跟随；接着发生/出现）。"},"examples":[{"en":"She followed her friend into the library.","zh":"她跟着朋友走进了图书馆。"},{"en":"A long silence followed his question.","zh":"他问完之后，紧接着是一阵长久的沉默。"}]},{"partOfSpeech":"adj.","definition":{"en":"used like an adjective to describe someone/something that comes after (often in formal writing: “the following day/word”).","zh":"作类似形容词的用法，表示“随后/下一个的”（常见于较正式表达：the following day/word）。"},"examples":[{"en":"We met again the following week.","zh":"我们在接下来的一周又见面了。"},{"en":"Please read the following instructions carefully.","zh":"请仔细阅读以下说明。"}]}],"synonyms":["came after","went after","pursued","trailed","ensued"],"phonetic":"ˈfɑloʊd","extraExplanation":["“followed”最常见是动词的过去式/过去分词：follow → followed。它既可以表示动作上的“跟着走”，也常用来表示事件顺序上的“随后发生”（A followed B）。","当你看到“the following + 名词”（如 the following day / the following reasons），它不是动词时态，而是一种固定搭配，意思接近“接下来的/如下的”。在学习中要把它和“followed”区分开。"]}
{"word":"follower","summary":{"en":"A follower is someone who follows or supports a person or idea; today it commonly means a social-media subscriber.","zh":"follower 指追随或支持某人/某种理念的人；在当代也常指社交媒体的关注者/粉丝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports, admires, or regularly pays attention to someone (often a leader, celebrity, or creator).","zh":"追随者；拥护者；粉丝（经常关注或支持某人，如领导者、名人或内容创作者的人）。"},"examples":[{"en":"She has thousands of followers on Instagram.","zh":"她在 Instagram 上有成千上万的粉丝。"},{"en":"The teacher’s followers appreciated her clear, patient style.","zh":"那位老师的拥护者很欣赏她清晰而有耐心的风格。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who comes after or walks behind another person; someone who follows.","zh":"跟随在后的人；后面的人（跟在他人后面走或后来到的人）。"},"examples":[{"en":"The guide walked ahead, and the followers stayed close behind.","zh":"向导走在前面，跟随的人紧紧跟在后面。"}]},{"partOfSpeech":"n.","definition":{"en":"In social media, an account that subscribes to or tracks another account’s updates.","zh":"（社交媒体）关注者（订阅或接收另一个账号更新的人或账号）。"},"examples":[{"en":"He gained new followers after posting the video.","zh":"他发布那段视频后新增了很多关注者。"},{"en":"Brands often measure success by likes and followers.","zh":"品牌常用点赞数和关注者数量来衡量成效。"}]}],"synonyms":["supporter","fan","admirer","disciple","subscriber"],"phonetic":"/ˈfɑl.oʊ.ɚ/","extraExplanation":["“follower”来自动词“follow”（跟随）。在传统语境里常指“追随者/信徒/拥护者”；在当代网络语境中非常常见，特指社交媒体的“关注者/粉丝”。","用法上，“followers of + 人/思想/宗教”强调理念或信仰层面的追随；“followers on + 平台”更偏向平台数据与受众。"]}
{"word":"follower-like","summary":{"en":"“Follower-like” means ‘like a follower’—more imitative or subordinate than leading.","zh":"“Follower-like”意为“像追随者一样”，更偏模仿或从属，而非领导。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling a follower; acting in a way that is loyal, subordinate, or imitative rather than leading.","zh":"像追随者的；表现得忠诚、从属或模仿他人，而不是带头。"},"examples":[{"en":"In meetings, he stays quiet and takes notes, which can seem follower-like.","zh":"在会议上他总是安静做笔记，这会显得有点“追随者式”的。"},{"en":"The team wanted more leadership, not a follower-like attitude.","zh":"团队希望有更多领导力，而不是一种追随者式的态度。"},{"en":"Her follower-like behavior made it hard for her to negotiate confidently.","zh":"她那种追随者式的做法让她很难自信地谈判。"}]}],"synonyms":["submissive","deferential","pliant","imitative","docile"],"phonetic":"/ˈfɑloʊɚ laɪk/","extraExplanation":["“-like”是英语里很常见的后缀，意思是“像……一样/具有……的特点”，如 childlike（孩子般的）、businesslike（公事公办的）。因此 follower-like 通常表示“有追随者特征”，语气可能带一点评价色彩：暗示不够主动、缺少主见。正式写作中也常用更自然的表达，如 submissive（顺从的）、deferential（谦恭听从的）、follow-the-leader（只会跟风的，口语/形容用法）。"]}
{"word":"followers","summary":{"en":"“Followers” most often means people who support or pay attention to someone—especially on social media; it can also mean religious followers.","zh":"“followers”通常指追随/关注某人的人（尤其是社交媒体粉丝），也可指宗教信徒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who choose to follow someone (a leader, teacher, celebrity, or influencer) and support, admire, or pay attention to them.","zh":"追随者；拥护者（选择跟随某位领袖/老师/名人/网红并支持、仰慕或关注的人）。"},"examples":[{"en":"The speaker thanked her followers for their support.","zh":"演讲者感谢她的追随者们的支持。"},{"en":"He has millions of followers on Instagram.","zh":"他在 Instagram 上有数百万粉丝。"}]},{"partOfSpeech":"n.","definition":{"en":"In a religion, people who believe in and practice the teachings of a faith or teacher.","zh":"（宗教）信徒；门徒（信仰并践行某宗教或某位导师教义的人）。"},"examples":[{"en":"The temple welcomes followers of many traditions.","zh":"这座寺庙欢迎不同传统的信徒。"}]}],"synonyms":["fans","supporters","subscribers","admirers","disciples","believers"],"phonetic":"/ˈfɑləwərz/","extraExplanation":["“followers”是“follower”的复数形式。日常语境里常指社交媒体上的“粉丝/关注者”；更正式或历史语境中也可指“追随者、门徒”。","注意区分：follower（关注者/追随者）不一定是friend（朋友）。在社媒里，“followers”通常表示看到你内容的人数，而不表示现实关系亲近。"]}
{"word":"followership","summary":{"en":"Followership means either (1) the skill/practice of being an effective follower, or (2) the group of people who follow someone.","zh":"followership 指（1）有效追随与支持的能力/实践（跟随力），或（2）追随某人的人群（拥护者/粉丝群体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the role, practice, or ability of being a good follower; supporting and carrying out a leader’s direction","zh":"追随者的角色/实践；良好的“跟随力”：支持并执行领导者方向的能力"},"examples":[{"en":"Good followership means asking clarifying questions and then doing the work well.","zh":"良好的跟随力意味着先提出澄清问题，然后把工作高质量地完成。"},{"en":"The training program focused on both leadership and followership.","zh":"这个培训项目同时强调领导力与跟随力。"}]},{"partOfSpeech":"n.","definition":{"en":"the people who follow a leader or belong to a group of supporters","zh":"追随者群体；拥护者（整体）"},"examples":[{"en":"The coach’s followership stayed loyal even during a losing season.","zh":"即使在连败的赛季里，这位教练的拥护者仍然很忠诚。"},{"en":"She built a large online followership by sharing study tips.","zh":"她通过分享学习技巧建立了庞大的线上粉丝群体。"}]}],"synonyms":["followers","supporters","fan base","audience","subordinates (in organizations)"],"phonetic":"/ˈfɑːloʊərˌʃɪp/","extraExplanation":["“followership”常见于组织管理、军队、社团等语境，用来强调：团队成功不只靠领导者，也靠成员的责任感、主动沟通与可靠执行。","在网络语境中，“followership”有时接近“粉丝群体/关注者”，但更正式；日常更常说“followers”或“fan base”。"]}
{"word":"followeth","summary":{"en":"“followeth” is an archaic form meaning “follows.”","zh":"“followeth”是古体用法，意思相当于“follows（跟随/随后发生）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) third-person singular present form of “follow”; means “follows,” “comes after,” or “goes with.”","zh":"（古体）动词“follow”的第三人称单数现在时形式，相当于“follows”，表示“跟随、随后发生/出现、紧接着”。"},"examples":[{"en":"He that followeth me shall not walk in darkness.","zh":"跟从我的，就不在黑暗里行走。"},{"en":"Winter followeth autumn in this part of the world.","zh":"在这个地区，秋天之后就是冬天。"},{"en":"Trouble often followeth careless words.","zh":"粗心的话语后面常常会带来麻烦。"}]}],"synonyms":["follows","comes after","ensues"],"phonetic":"/ˈfɑloʊɪθ/","extraExplanation":["“followeth”常见于《钦定版圣经》（King James Version）等较早的英文文本。现代英语通常用“follows”。","词尾“-eth”是早期现代英语中第三人称单数现在时的一种形式（如：he speaketh=he speaks）。如今除了仿古、宗教文体或文学模仿外很少使用。"]}
{"word":"following","summary":{"en":"“Following” most often means “next” or “below/coming up,” and it can also mean “a group of followers” or “the act of tracking someone.”","zh":"“following”最常表示“接下来的/以下的”，也可指“追随者群体”或“跟踪/跟随的行为”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"coming after something in time, order, or position; next","zh":"接下来的；随后发生的；在顺序或位置上紧接其后的"},"examples":[{"en":"In the following week, sales increased quickly.","zh":"在接下来的那一周，销量迅速增长。"},{"en":"Please read the following instructions carefully.","zh":"请仔细阅读以下说明。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of people who support and are interested in someone (such as an artist, leader, or influencer)","zh":"追随者群体；拥趸；粉丝（支持并关注某人，如艺术家、领袖或网红的人群）"},"examples":[{"en":"The writer has a large following online.","zh":"这位作家在网上有大量追随者。"},{"en":"Her speeches gained a loyal following.","zh":"她的演讲吸引了一批忠实的追随者。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of going after someone or something; tracking","zh":"跟随；追踪（跟在后面走或追查）"},"examples":[{"en":"The following of the suspect continued for hours.","zh":"对嫌疑人的跟踪持续了好几个小时。"}]}],"synonyms":["next","subsequent","ensuing","below","followers","fan base"],"phonetic":"/ˈfɑloʊɪŋ/","extraExplanation":["“following”作形容词时很常见，尤其在书面或说明文里：the following + 名词（the following day/week/reasons），或固定搭配“the following:”表示“如下：”。","“following”作名词表示“追随者”时，通常是不可数概念（a large following），不太常说“a following person”。","注意区分“following”和“followed”：following强调“接下来/以下的（正在跟随的）”，followed更像“被跟随/之后的（已经发生过的）”，语气与语法环境不同。"]}
{"word":"following-day","summary":{"en":"Following-day means “the next day,” especially used as an adjective before a noun (e.g., following-day delivery).","zh":"following-day 表示“第二天/次日”，常作形容词用于名词前（如次日送达）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(before a noun) happening on the next day; the day after.","zh":"（用于名词前）发生在第二天的；次日的。"},"examples":[{"en":"I got a following-day appointment with the doctor.","zh":"我约到了医生的次日门诊。"},{"en":"The store offers following-day delivery in some cities.","zh":"这家店在一些城市提供次日送达。"}]},{"partOfSpeech":"n.","definition":{"en":"the next day; the day after (less common; often written as “the following day”).","zh":"第二天；次日（较少见；更常写作 the following day）。"},"examples":[{"en":"We arrived late, and the following day we started work.","zh":"我们到得很晚，第二天就开始工作。"},{"en":"She called him the following day to apologize.","zh":"她第二天打电话向他道歉。"}]}],"synonyms":["next-day","the next day","the following day","day-after"],"phonetic":"/ˈfɑːloʊɪŋ deɪ/","extraExplanation":["“following-day”常见于较正式或商务语境（如物流、服务承诺：following-day delivery/response）。在日常表达中，更自然的说法通常是“next-day”或直接说“the next day / the following day”。","连字符（-）多用于把两个词合在一起当作一个形容词放在名词前：following-day delivery。若放在名词后，通常不加连字符：delivery the following day。"]}
{"word":"followingly","summary":{"en":"“Followingly” means “as what comes next; as follows,” but it’s somewhat uncommon in modern English; “as follows” is usually more natural.","zh":"“followingly”意为“如下；随后”，但在现代英语中较少用，通常用“as follows”更自然。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that comes next; subsequently; as what follows (often used to introduce a list or explanation).","zh":"以接下来的方式；随后；如下（常用于引出列表或说明）。"},"examples":[{"en":"I will answer your questions followingly: first about cost, then about timing.","zh":"我将如下回答你的问题：先谈费用，再谈时间。"},{"en":"The steps are described followingly in the report.","zh":"报告中如下描述这些步骤。"}]}],"synonyms":["as follows","subsequently","next","thereafter"],"phonetic":"/ˈfɑloʊɪŋli/","extraExplanation":["“followingly”在现代英语中比较少见，很多情况下更自然的说法是“as follows”或“in the following way”。例如：\n- 更自然：“The steps are as follows …”\n- 也可用：“I will explain it in the following order …”\n在正式写作里，“as follows”尤其常见。"]}
{"word":"followings","summary":{"en":"“Followings” most commonly means groups of supporters/fans; it’s also a less common plural form used for multiple sets of “the following” items.","zh":"“followings”最常见指一群追随者/粉丝；也可作较少见的复数形式，表示多组“如下/以下所列”的内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of people who support, admire, or regularly pay attention to someone or something (fans, subscribers, supporters).","zh":"（某人/某事的）追随者、拥护者、粉丝群体（如订阅者、支持者）。"},"examples":[{"en":"The singer has a huge following on social media.","zh":"这位歌手在社交媒体上有庞大的粉丝群体。"},{"en":"The brand built a loyal following by offering great customer service.","zh":"这个品牌通过出色的客户服务培养了一批忠实拥护者。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “following” in the sense of ‘things that follow’; often used in formal writing (e.g., “the following” meaning ‘the items listed next’).","zh":"“following”在“接下来/如下所列的内容”的含义下的复数形式；多见于较正式的表达。"},"examples":[{"en":"Please review the followings carefully: the schedule changes and the new rules.","zh":"请仔细查看以下内容：日程变更和新规定。"},{"en":"In formal English, people more often say “the following items” instead of “the followings.”","zh":"在正式英语里，人们更常说“the following items”，而不是“the followings”。"}]}],"synonyms":["fans","supporters","followers","audience","subscribers"],"phonetic":"/ˈfɑloʊɪŋz/","extraExplanation":["“following”更常见的用法是不可数或不加复数：a large following（很多粉丝）；the following + 名词/内容（如下/以下）。因此“followings”不算常用，除非你明确在说“多个不同的粉丝群体”或“多组如下内容”。","常见替换：fans（粉丝）、supporters（支持者）、audience（受众）、the following items（以下项目）、the points below（以下几点）。"]}
{"word":"follows","summary":{"en":"“Follows” means “go after,” “come next,” “obey,” “understand,” or “result from” (third-person singular present of “follow”).","zh":"“follows”是“follow”的一般现在时第三人称单数，可表示“跟随、接着发生、遵守、理解、由……导致”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present simple, third-person singular of “follow”) to go or come after someone or something, especially in the same direction.","zh":"（follow 的一般现在时第三人称单数）跟随；跟在……后面（同方向移动）。"},"examples":[{"en":"The dog follows me everywhere.","zh":"那只狗到处都跟着我。"},{"en":"Please stay close—this path is tricky, so everyone follows the guide.","zh":"请走近一点——这条路不好走，所以大家都跟着向导。"}]},{"partOfSpeech":"v.","definition":{"en":"to happen after something in time or order; to come next.","zh":"（时间或顺序上）在……之后发生；接着发生。"},"examples":[{"en":"A short discussion follows the presentation.","zh":"报告结束后会有一个简短的讨论。"},{"en":"Winter follows fall.","zh":"秋天之后是冬天。"}]},{"partOfSpeech":"v.","definition":{"en":"to obey, accept, or act according to rules, advice, or instructions.","zh":"遵守；听从；按（规则/建议/指示）行事。"},"examples":[{"en":"She follows the safety rules at work.","zh":"她在工作中遵守安全规定。"},{"en":"He follows his doctor’s advice.","zh":"他听从医生的建议。"}]},{"partOfSpeech":"v.","definition":{"en":"to understand or pay attention to what is being said or done.","zh":"理解；听懂；跟得上（内容/思路）。"},"examples":[{"en":"Sorry, I didn’t follow—can you explain again?","zh":"不好意思，我没听懂——你能再解释一遍吗？"},{"en":"The students follow the lesson easily.","zh":"学生们很容易跟上这节课。"}]},{"partOfSpeech":"v.","definition":{"en":"to result from something; to be a logical consequence.","zh":"由……产生；接踵而来；是……的结果。"},"examples":[{"en":"It follows that we should leave early to avoid traffic.","zh":"因此我们应该早点出发以避开堵车。"},{"en":"If the data is wrong, errors follow.","zh":"如果数据错了，错误就会随之出现。"}]}],"synonyms":["comes after","goes after","trails","pursues","obeys","observes","understands","results from"],"phonetic":"/ˈfɑloʊz/","extraExplanation":["“follows”是动词“follow”的一般现在时第三人称单数形式，用于主语是he/she/it或单数名词：He follows…, The rule follows…","口语里表示“听懂/理解”时，常用否定：I don’t follow.（我没听懂/没跟上。）更礼貌可说：I’m not following—could you clarify?（我有点跟不上，能解释一下吗？）"]}
{"word":"followup","summary":{"en":"“Followup / follow-up” means a later action to continue or check something (noun/adj), or the act of contacting/acting again later (verb: follow up).","zh":"followup / follow-up 指“后续行动/跟进”（名词/形容词），也可指“再次联系或处理以推进进展”（动词：follow up）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a later action, call, email, or meeting done to check progress, get more information, or continue something","zh":"后续行动；跟进（如后续电话、邮件或会面，用来确认进展或继续处理）"},"examples":[{"en":"I’ll send a followup email tomorrow to confirm the details.","zh":"我明天会发一封后续邮件来确认细节。"},{"en":"We scheduled a followup meeting for next week.","zh":"我们安排了下周的后续会议。"}]},{"partOfSpeech":"v.","definition":{"en":"to do something again later in order to get an answer or continue dealing with a person or issue","zh":"跟进；追踪处理（为得到答复或继续处理某事/某人而再次联系或采取行动）"},"examples":[{"en":"I’ll follow up with the client this afternoon.","zh":"我今天下午会跟进那位客户。"},{"en":"She followed up on the complaint to make sure it was resolved.","zh":"她对那项投诉进行了跟进，以确保问题已解决。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to a later action that continues or checks on something","zh":"后续的；跟进的（用于描述后续处理或检查的事情）"},"examples":[{"en":"Do you have any followup questions?","zh":"你还有什么后续问题吗？"},{"en":"The doctor ordered a followup test.","zh":"医生安排了一个复查（后续）检查。"}]}],"synonyms":["follow-up","check-in","continuation","further action","pursue","follow through"],"phonetic":"/ˈfɑloʊˌʌp/","extraExplanation":["在写法上常见三种：follow-up（最规范、常见，尤其作名词或形容词：a follow-up email / a follow-up call）；follow up（作动词短语：to follow up with someone / on something）；followup（不带连字符的拼写也能见到，偏非正式或在商务邮件里常用）。","搭配很重要：follow up with + 人（跟进某人）；follow up on + 事（跟进某事）。"]}
{"word":"folly","summary":{"en":"Folly most commonly means foolish behavior or a foolish decision; it can also mean a foolish person (literary) or a decorative, impractical garden building.","zh":"folly最常指愚蠢的行为或决定；也可指（文学用法）愚人，或指园林中用于观赏、缺乏实用性的装饰性建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A foolish action, decision, or idea; lack of good judgment.","zh":"愚蠢的行为、决定或想法；缺乏判断力。"},"examples":[{"en":"It was a folly to spend all his savings on a risky investment.","zh":"把所有积蓄都投到高风险投资上是愚蠢之举。"},{"en":"Looking back, she realized her quick decision was pure folly.","zh":"回头看，她意识到自己当时的仓促决定完全是愚蠢。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) A person who behaves in a foolish way; a fool.","zh":"（文学/较正式）行为愚蠢的人；傻子。"},"examples":[{"en":"He played the folly who ignored honest advice.","zh":"他无视诚恳的建议，活像个傻子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Architecture) A decorative building with little or no practical purpose, often built for beauty in gardens or estates.","zh":"（建筑）装饰性建筑（多用于园林/庄园），通常几乎没有实际用途，只为观赏。"},"examples":[{"en":"They walked past a stone folly built to look like an ancient ruin.","zh":"他们走过一座石头建的装饰性建筑，被刻意设计得像古代遗迹。"},{"en":"The estate’s folly became a popular spot for photos.","zh":"那座庄园里的观赏性建筑成了热门拍照点。"}]}],"synonyms":["foolishness","stupidity","rashness","recklessness","blunder"],"phonetic":"/ˈfɑli/","extraExplanation":["“folly”常带有较强的评价色彩，语气比一般的“mistake（错误）”更重，暗示“本可避免、却因为判断失误或冲动而做了”。","园林建筑里的“folly”在18—19世纪的英国尤其常见，贵族会在花园里建“仿古遗迹、塔楼、小庙”等，主要为了营造浪漫或古典氛围。"]}
{"word":"follyer","summary":{"en":"“Follyer” is a rare, nonstandard noun meaning someone who acts foolishly; it’s often a misspelling of “foolier” or “follower.”","zh":"“follyer”是罕见的非标准名词，指做蠢事的人；很多时候其实是把“foolier”或“follower”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) A person who behaves foolishly; someone who commits folly.","zh":"（罕见、非标准用法）做蠢事的人；愚行的实施者。"},"examples":[{"en":"In the old story, the king punished the follyer who wasted the village’s food.","zh":"在那个古老的故事里，国王惩罚了那个浪费村庄食物的蠢人。"},{"en":"He called himself a follyer for trusting the scam.","zh":"他因为相信诈骗而称自己是个做蠢事的人。"}]}],"synonyms":["fool","simpleton","reckless person"],"phonetic":"/ˈfɑliər/","extraExplanation":["“follyer”在现代英语里几乎不用，也不算常见的标准拼写。多数情况下，人们想写的是：\n- “foolier”（更傻的）：foolish 的比较级，如 “This plan is foolier than the last one.”\n- “follower”（追随者）：如 “She has many followers online.”\n如果你告诉我你看到它的句子/上下文，我可以帮你判断到底是哪一个词。"]}
{"word":"follying","summary":{"en":"“Follying” means behaving foolishly or messing around (a rare form from the verb “folly”).","zh":"“Follying”指做傻事、胡闹（源自动词“folly”，较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “folly”) acting in a foolish or silly way; doing something that shows poor judgment.","zh":"（动词“folly”的现在分词）做傻事；愚蠢地行事；表现出判断力差。"},"examples":[{"en":"He kept follying around instead of finishing his homework.","zh":"他一直在胡闹，而不是把作业完成。"},{"en":"They were follying in the park, laughing too loudly for the quiet neighborhood.","zh":"他们在公园里胡闹，笑得太大声，影响了安静的社区。"}]},{"partOfSpeech":"v.","definition":{"en":"(literary/rare) taking part in a “folly,” meaning a foolish action or decision.","zh":"（文学/少见）参与一件“愚行”（folly），指愚蠢的行为或决定。"},"examples":[{"en":"She later regretted follying with people who didn’t respect her.","zh":"她后来后悔当初跟不尊重她的人一起做傻事。"}]}],"synonyms":["messing around","fooling around","acting foolishly","goofing off"],"phonetic":"/ˈfɑliɪŋ/","extraExplanation":["“follying”在现代英语里比较少见；更常见的是用“acting foolishly / messing around / fooling around”。","很多学习者会把“follying”看成“following”（跟随）。两者发音和意思都不同：following /ˈfɑloʊɪŋ/；follying /ˈfɑliɪŋ/。","“folly”更常用作名词，表示“愚蠢的行为/决定”（例如：It was a folly to trust him.）。"]}
{"word":"follyproof","summary":{"en":"Follyproof (rare) means designed to prevent foolish mistakes; often used like foolproof.","zh":"Follyproof（罕见）指“防止愚蠢错误的”；常被当作 foolproof 的一种写法或创造性表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Designed to prevent foolish mistakes; not easily spoiled by someone’s poor judgment.","zh":"（罕见）为防止愚蠢错误而设计的；不容易因判断失误而搞砸。"},"examples":[{"en":"The checklist is meant to be follyproof, so even a tired worker won’t miss a step.","zh":"这份清单旨在做到“防蠢”（follyproof），这样即使工人很累也不会漏掉步骤。"},{"en":"They tried to build a follyproof process, but people still found a way around it.","zh":"他们试图建立一个“防蠢”的流程，但人们还是找到了绕开的办法。"}]}],"synonyms":["foolproof","error-proof","fail-safe","idiot-proof"],"phonetic":"/ˈfɑliˌpruf/","extraExplanation":["“follyproof”不是常见英语词，更常见、自然的说法是“foolproof”（意为“万无一失的 / 不易出错的”）。如果你在文章里看到“follyproof”，多半是作者的创造性用词、幽默表达，或是把“foolproof”写错了。","词根提示：folly = 愚蠢的行为/愚行；-proof = “可抵御……的 / 不受……影响的”。组合起来就是“能抵御愚行带来错误的”。"]}
{"word":"folsom","summary":{"en":"Folsom is most commonly a proper name: a city in Northern California; it can also refer to Folsom State Prison or be a surname.","zh":"Folsom常见为专有名词：加州北部的一座城市；也可指福尔瑟姆州立监狱，或作为姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Northern California (near Sacramento), known for Folsom Lake and a historic role in the Gold Rush era.","zh":"（美国）加利福尼亚州北部的一座城市（靠近萨克拉门托），以福尔瑟姆湖闻名，并与淘金热时期的历史有关。"},"examples":[{"en":"We spent the weekend biking around Folsom Lake.","zh":"我们周末去福尔瑟姆湖附近骑行了。"},{"en":"Folsom is a suburb of Sacramento with many tech jobs.","zh":"福尔瑟姆是萨克拉门托附近的郊区，有不少科技类工作机会。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for Folsom State Prison, a well-known California prison located in the area.","zh":"（常指）福尔瑟姆州立监狱，加州一座很有名的监狱，位于当地。"},"examples":[{"en":"The documentary discussed life inside Folsom.","zh":"那部纪录片讨论了福尔瑟姆监狱里的生活。"},{"en":"He mentioned visiting Folsom State Prison on a history tour.","zh":"他提到在历史之旅中参观了福尔瑟姆州立监狱。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"一个姓氏。"},"examples":[{"en":"Dr. Folsom will see you now.","zh":"福尔瑟姆医生现在可以为您看诊了。"}]}],"phonetic":"/ˈfoʊlsəm/","extraExplanation":["“Folsom”在美国文化里常让人联想到两件事：一是加州的福尔瑟姆州立监狱；二是歌手Johnny Cash的现场专辑《At Folsom Prison》（1968），以及歌曲《Folsom Prison Blues》。因此在阅读或听到“Folsom”时，要根据上下文判断是城市、监狱还是姓氏。"]}

