{"word":"foment","summary":{"en":"“Foment” means to stir up or encourage trouble, conflict, or strong feelings—often in a negative sense.","zh":"“foment”指煽动、挑起或助长动乱、冲突或强烈情绪，常带负面含义。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To encourage or stir up (especially trouble, conflict, or strong feelings).","zh":"煽动；挑起；助长（尤指动乱、冲突或强烈情绪）。"},"examples":[{"en":"The group was accused of fomenting unrest in the city.","zh":"该组织被指控在城市里煽动骚乱。"},{"en":"He tried to calm the crowd instead of fomenting anger.","zh":"他试图让人群冷静下来，而不是助长愤怒。"},{"en":"False rumors can foment fear during a crisis.","zh":"在危机期间，虚假谣言会助长恐慌。"}]}],"synonyms":["incite","stir up","provoke","agitate","fuel"],"phonetic":"/foʊˈmɛnt/","extraExplanation":["“foment”常用于较正式/新闻报道的语境，多与“unrest（骚乱）/violence（暴力）/rebellion（叛乱）/hatred（仇恨）/dissent（异议）”等搭配，语气偏负面，暗示“把事情搞得更糟”。","词源上与“加热、使温热”有关（早期含义是用温热敷布处理伤处），后来引申为“使情绪或事态升温”，因此现代常用于“把矛盾加剧/把情绪煽起来”的意思。"]}
{"word":"fomentation","summary":{"en":"Fomentation most commonly means deliberate incitement of unrest; less commonly, it’s a warm moist compress treatment in medicine.","zh":"fomentation 常指（蓄意）煽动骚乱；较少见时指医学上的温热湿敷疗法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of stirring up trouble, protest, or strong feelings (often secretly or deliberately); incitement.","zh":"（常指暗中或蓄意）煽动、挑起骚乱/抗议/强烈情绪的行为。"},"examples":[{"en":"The leader was arrested for fomentation of violence.","zh":"这名领袖因煽动暴力而被逮捕。"},{"en":"Online misinformation can lead to fomentation of anger and distrust.","zh":"网络虚假信息可能引发对立情绪，煽动愤怒与不信任。"}]},{"partOfSpeech":"n.","definition":{"en":"A medical treatment using warm, moist cloths on a body part to relieve pain or inflammation.","zh":"（医疗）温热湿敷法：用温热潮湿的布敷在身体部位以缓解疼痛或炎症。"},"examples":[{"en":"The nurse applied fomentation to reduce swelling in the ankle.","zh":"护士为脚踝做了温热湿敷以减轻肿胀。"},{"en":"Warm fomentation can help soothe sore muscles.","zh":"温热湿敷能帮助缓解肌肉酸痛。"}]}],"synonyms":["incitement","agitation","provocation","instigation","stirring up"],"phonetic":"/ˌfoʊ.mɛnˈteɪ.ʃən/","extraExplanation":["“fomentation”有两个常见语域：一是新闻/政治语境里的“煽动”（更常见），二是较旧或较专业的医学用语“湿敷”。因此在阅读时可通过上下文判断：若出现 protest/violence/unrest 等词，多半是“煽动”；若出现 nurse/swelling/inflammation 等词，多半是“湿敷”。","词根提示：foment- 来自拉丁语，原意与“加热、温热”有关，这也解释了为什么它既能指“湿敷”，也能引申为“把事态‘煽热’、挑起来”。"]}
{"word":"fomentations","summary":{"en":"“Fomentations” means either attempts to stir up unrest, or (medical) warm moist compresses.","zh":"“fomentations”既可指“煽动动乱的行为”，也可指（医学）“温热湿敷/热敷”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Acts of stirring up trouble, anger, or resistance; attempts to encourage unrest or rebellion.","zh":"煽动骚乱、愤怒或反抗的行为；挑起动荡或叛乱的企图。"},"examples":[{"en":"The government blamed the protests on outside fomentations.","zh":"政府把抗议活动归咎于外部势力的煽动。"},{"en":"His speeches were seen as fomentations against public order.","zh":"他的演讲被视为对公共秩序的煽动。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine, warm moist packs or compresses applied to the body to relieve pain or inflammation.","zh":"（医学）热敷、温湿敷布（用来缓解疼痛或炎症的温热湿敷）。"},"examples":[{"en":"The nurse applied fomentations to reduce the swelling.","zh":"护士给患处热敷以减轻肿胀。"},{"en":"Warm fomentations can soothe sore muscles.","zh":"温热湿敷可以缓解肌肉酸痛。"}]}],"synonyms":["agitation","incitement","provocation","stirring up","warm compresses","hot packs"],"phonetic":"/ˌfoʊmɛnˈteɪʃənz/","extraExplanation":["“fomentations”是名词复数，单数是“fomentation”。在新闻/政治语境中常指“煽动、挑拨”，语气偏负面；在医疗语境中则是较正式或偏旧的说法，指“温热湿敷/热敷”。","词源上与拉丁语“fomentum”（温敷、热敷材料）有关，所以它既有“热敷”的本义，也引申出“助长、煽起（情绪或动乱）”的意思。"]}
{"word":"fomented","summary":{"en":"Fomented means ‘stirred up or encouraged,’ usually trouble or strong emotions; less commonly, it can mean ‘applied warm liquid as a soothing treatment.’","zh":"Fomented 指“煽动、挑起、助长”（多指动乱或强烈情绪）；较少见时也可指“温敷/热敷（用温热液体缓解疼痛）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Often disapproving) to stir up or encourage trouble, unrest, or strong feelings, especially toward conflict or rebellion.","zh":"（常含贬义）煽动、挑起或助长麻烦、动乱或强烈情绪，尤指引向冲突或叛乱。"},"examples":[{"en":"Some leaders fomented anger to gain support.","zh":"一些领导人煽动愤怒来获取支持。"},{"en":"False rumors fomented panic in the city.","zh":"虚假谣言在城里助长了恐慌。"},{"en":"The article was accused of fomenting hatred.","zh":"那篇文章被指责在煽动仇恨。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause a situation or feeling to grow more intense or more active.","zh":"使某种局势或情绪加剧、变得更活跃。"},"examples":[{"en":"The unfair decision fomented frustration among workers.","zh":"那项不公平的决定加剧了工人的挫败感。"},{"en":"The incident fomented debates about privacy.","zh":"这起事件引发并加剧了关于隐私的讨论。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common, historical) to apply warm liquids to a body part to soothe pain; to bathe with warm water.","zh":"（较少见，历史用法）用温热液体敷洗身体部位以缓解疼痛；温水浴敷。"},"examples":[{"en":"The nurse fomented the sore knee with warm cloths.","zh":"护士用温热的布为酸痛的膝盖做热敷。"}]}],"synonyms":["incited","stirred up","provoked","agitated","kindled","sparked"],"phonetic":"/foʊˈmɛn.tɪd/","extraExplanation":["“fomented”是动词“foment”的过去式/过去分词。现代英语里最常见的是“煽动、挑起（动乱/仇恨/反抗）”，语气通常偏负面，常与riot, unrest, rebellion, hatred, panic 等搭配。","该词源自拉丁语，原意与“加热、温敷”有关，所以保留了较少见的医学/护理语境含义（热敷、温敷）。在新闻与历史写作中，“foment”常用于描述有人“刻意制造矛盾或不满”。"]}
{"word":"fomenter","summary":{"en":"A fomenter is someone who deliberately stirs up trouble or unrest.","zh":"fomenter 指故意煽动、挑起事端或骚乱的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who stirs up trouble, conflict, or strong feelings (often secretly or deliberately).","zh":"煽动者；挑起事端的人（常指暗中或故意引发冲突、骚乱或强烈情绪的人）。"},"examples":[{"en":"The government accused him of being a fomenter of unrest.","zh":"政府指控他是煽动骚乱的人。"},{"en":"She was labeled a fomenter after she spread rumors in the office.","zh":"她在办公室散布谣言后，被贴上“挑事者”的标签。"},{"en":"Online fomenters can turn a small disagreement into a big fight.","zh":"网络上的煽动者可能把小分歧变成大争吵。"}]}],"synonyms":["agitator","instigator","provocateur","rabble-rouser"],"phonetic":"/foʊˈmɛn.tɚ/","extraExplanation":["“fomenter”来自动词 “foment”（煽动、挑起），语气通常偏负面，常见搭配有：fomenter of violence/unrest/hatred（暴力/动乱/仇恨的煽动者）。","在新闻与政治语境中很常见，有时也用来指“挑拨离间的人”或“带节奏的人”。","近义词里，agitator（煽动者）较常见；instigator（挑起者）偏“起因/发起”；rabble-rouser（蛊惑民众者）更口语且带强烈贬义。"]}
{"word":"fomenters","summary":{"en":"“Fomenters” are people who deliberately stir up trouble or unrest.","zh":"“Fomenters”指故意煽动事端或动乱的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who intentionally stir up trouble, anger, or rebellion; instigators.","zh":"故意煽动麻烦、愤怒或叛乱的人；煽动者。"},"examples":[{"en":"The leader warned that outside fomenters were trying to create conflict in the community.","zh":"领导人警告说，外来的煽动者正试图在社区制造冲突。"},{"en":"The rumor spread quickly, helped by fomenters who wanted people to panic.","zh":"谣言迅速扩散，一些想让人们恐慌的煽动者也在推波助澜。"}]}],"synonyms":["instigators","agitators","rabble-rousers","troublemakers"],"phonetic":"/foʊˈmɛn.tɚz/","extraExplanation":["“fomenter(s)”来自动词 “foment”（煽动、挑起）。它常用于政治或社会新闻语境，语气偏负面，暗示对方不是“正常表达意见”，而是在刻意把矛盾激化。","容易混淆：fomenter（煽动者）不是 fermenter（发酵罐/发酵器）。两者拼写相近，但含义完全不同。"]}
{"word":"fomenting","summary":{"en":"“Fomenting” means deliberately stirring up or encouraging trouble, conflict, or strong feelings (and less commonly, helping something develop).","zh":"“fomenting”表示（常带刻意地）煽动、挑起冲突或强烈情绪；较少情况下也可指促成某事发展。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"stirring up or encouraging (often anger, conflict, or trouble), especially in a deliberate way","zh":"煽动、挑起（通常指愤怒、冲突或麻烦），多带有刻意之意"},"examples":[{"en":"Some people accused the politician of fomenting fear during the campaign.","zh":"有人指责那位政治人物在竞选期间煽动恐惧。"},{"en":"Online rumors can end up fomenting conflict between communities.","zh":"网络谣言最终可能挑起社群之间的冲突。"},{"en":"The report warned that outside groups were fomenting unrest.","zh":"报告警告说有外部团体在煽动动乱。"}]},{"partOfSpeech":"v.","definition":{"en":"promoting or helping something develop (less common; often used in formal writing)","zh":"促成、助长某事发展（较少见；多用于正式文体）"},"examples":[{"en":"Good leaders focus on fomenting trust within a team.","zh":"好的领导者会专注于在团队中促成信任。"},{"en":"The program aims at fomenting interest in science among teenagers.","zh":"该项目旨在激发青少年对科学的兴趣。"}]}],"synonyms":["stirring up","inciting","fueling","sparking","agitating","egging on"],"phonetic":"/foʊˈmɛn.tɪŋ/","extraExplanation":["“foment”常出现在新闻、政治评论等语境里，语气偏正式，且经常带负面色彩（如fomenting hatred/violence/unrest）。日常口语里更常用“stirring up”“fueling”“inciting”。","词源来自拉丁语 *fomentum*，原意与“热敷、敷药”有关，后来引申为“使某种情绪或局势发酵、加剧”。因此它常和强烈情绪或社会动荡搭配使用。"]}
{"word":"fomento","summary":{"en":"Fomento is a Spanish/Portuguese word used in English-language contexts to mean “promotion/encouragement” of development, or a development-focused institution or fund.","zh":"Fomento 是西语/葡语词，在英语语境中多指“促进/扶持发展”，也可指以发展为宗旨的机构或基金/银行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly in Spanish/Portuguese contexts) encouragement or promotion of an activity, industry, or development; support meant to stimulate growth.","zh":"（多用于西语/葡语语境）对某项活动、产业或发展的鼓励与推动；旨在促进增长的扶持/支持。"},"examples":[{"en":"The program provides fomento for small businesses through low-interest loans.","zh":"该项目通过低息贷款为小企业提供扶持（fomento）。"},{"en":"The ministry focuses on the fomento of renewable energy and local innovation.","zh":"该部门重点推动可再生能源和本地创新的发展（fomento）。"}]},{"partOfSpeech":"n.","definition":{"en":"an organization, fund, or bank whose mission is to promote economic development (often seen in names like “Banco de Fomento”).","zh":"以促进经济发展为宗旨的机构、基金或银行（常见于名称中，如“发展银行/Banco de Fomento”）。"},"examples":[{"en":"She works at a Banco de Fomento that finances infrastructure projects.","zh":"她在一家发展银行工作，为基础设施项目提供融资。"},{"en":"The startup received seed funding from a national fomento agency.","zh":"这家初创公司获得了国家级发展促进机构的种子资金。"}]}],"synonyms":["promotion","encouragement","support","stimulus","development funding","economic development agency"],"phonetic":"/foʊˈmɛntoʊ/","extraExplanation":["“fomento”来自拉丁语 *fomentum*，原意与“促进、刺激、助长”有关。在当代西班牙语里常用于政府政策、经济与产业语境，例如“fomento del empleo（促进就业）”。在英语文章中多作为外来词出现，通常不翻译或在括号里解释。"]}
{"word":"foments","summary":{"en":"“Foment” means to stir up or encourage trouble or strong feelings; an older meaning is to apply warm compresses.","zh":"“foment”主要指“煽动/挑起/助长（动乱或强烈情绪）”；较旧的意思是“热敷”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to stir up or encourage (especially trouble, violence, or strong feelings)","zh":"煽动；挑起；助长（尤指动乱、暴力或强烈情绪）"},"examples":[{"en":"Some leaders tried to foment unrest by spreading rumors.","zh":"一些领导人试图通过散布谣言来煽动动乱。"},{"en":"The article was accused of fomenting hatred between groups.","zh":"这篇文章被指责助长了群体之间的仇恨。"},{"en":"They worked quietly to foment a rebellion.","zh":"他们暗中活动，试图挑起叛乱。"}]},{"partOfSpeech":"vt.","definition":{"en":"(older/medical) to apply warmth or a warm, moist cloth to a body part to relieve pain","zh":"（较旧/医学用法）热敷；用温热湿布敷在身体部位以缓解疼痛"},"examples":[{"en":"The nurse said to foment the sore area with warm compresses.","zh":"护士说可以用温热敷布给疼痛部位热敷。"}]}],"synonyms":["incite","stir up","provoke","agitate","inflame"],"phonetic":"/foʊˈmɛnt/","extraExplanation":["“foments”通常是动词“foment”的第三人称单数（He/She foments...）或在某些语境里作为复数形式出现。更常见的基本词条是“foment”。","常见搭配：foment unrest/violence/hatred/dissent（煽动动乱/暴力/仇恨/异议）。该词多用于较正式的新闻、政治或历史语境。","词源上与“给……热敷”的旧义相关：来自拉丁语，原意与“温热、敷布”有关；后来引申为“助长、促使（事态）发酵”。"]}
{"word":"fomes","summary":{"en":"Fomes is a medical term for an object or material that can carry germs and spread infection (a fomite).","zh":"Fomes 是医学用语，指可携带病原体并传播感染的物体或材料（即 fomite）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) Any substance or object that can carry germs (pathogens) and spread infection, such as clothing, towels, or door handles; a “fomite.”","zh":"（医学）可携带病原体并传播感染的物质或物体，如衣物、毛巾、门把手等；即“污染物/带菌载体（fomite）”。"},"examples":[{"en":"During flu season, shared keyboards and phones can act as fomes for viruses.","zh":"流感季节，共用的键盘和手机可能成为病毒的 fomes（带菌载体）。"},{"en":"Hospitals disinfect surfaces to reduce the risk of fomes spreading bacteria.","zh":"医院会对表面进行消毒，以降低 fomes 传播细菌的风险。"}]}],"synonyms":["fomite","contaminated surface","infectious material","carrier object"],"phonetic":"/ˈfoʊmiːz/","extraExplanation":["在现代英语里，**fomes**多见于医学/公共卫生语境，常与更常用的 **fomite / fomites** 并列出现；日常表达里通常直接说“contaminated surface/object（被污染的表面/物品）”。","词源来自拉丁语 **fōmes**，原意与“引火物、火绒（tinder）”相关，引申为“引发疾病/传播感染的媒介”。"]}
{"word":"fomite","summary":{"en":"A fomite is an inanimate object that can carry germs and spread infection by touch.","zh":"fomite 指能携带病原体并通过接触导致传播的非生命物体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An object or surface that can carry infectious germs (like viruses or bacteria) and potentially spread disease through touch.","zh":"（可传播疾病的）污染物体；带菌物体（如门把手、手机等表面可携带病毒或细菌，通过接触传播）。"},"examples":[{"en":"Door handles and phones can become fomites if they are not cleaned regularly.","zh":"如果不定期清洁，门把手和手机都可能变成带菌物体（fomites）。"},{"en":"During flu season, people are advised to disinfect common fomites like light switches and remote controls.","zh":"流感季节，人们常被建议消毒常见的带菌物体，比如电灯开关和遥控器。"}]}],"synonyms":["contaminated surface","disease-carrying object","inanimate vector"],"phonetic":"/ˈfoʊmaɪt/","extraExplanation":["“fomite”常见于医学、公共卫生与新闻报道中，尤其在讨论“间接接触传播”时出现；相比之下，日常英语更常说“contaminated surface/object（被污染的表面/物体）”。","发音里常见重音在第一音节。这个词来自拉丁语，原意与“引火物（tinder）”相关，后来引申为“能引发感染的载体”。","近义表达：“contaminated surface/object”“disease-carrying object”。相关概念：airborne transmission（空气传播）、droplet transmission（飞沫传播）、hand hygiene（手部卫生）。"]}
{"word":"fomites","summary":{"en":"Fomites are objects or surfaces that can carry germs and help spread infection through touch.","zh":"Fomites 指可携带病原体并可能通过接触造成间接传播的物体或表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Objects or surfaces that can carry germs (such as viruses or bacteria) and potentially spread infection when people touch them.","zh":"可携带病原体（如病毒或细菌）并可能通过接触传播感染的物体或表面（称为“污染媒介/间接传播物”）。"},"examples":[{"en":"Door handles, phones, and shared keyboards can act as fomites in busy places.","zh":"在人多的地方，门把手、手机和共用键盘都可能成为 fomites（污染媒介）。"},{"en":"Washing hands after touching public surfaces helps reduce fomite transmission.","zh":"触摸公共表面后洗手有助于减少通过 fomites 的传播。"}]}],"synonyms":["contaminated surfaces","carriers","vehicles of transmission"],"phonetic":"/ˈfoʊmaɪts/","extraExplanation":["“Fomite”常用于公共卫生与医学语境，强调“间接传播”：病原体先落在物体表面，人再通过触摸把病原体带到口、鼻、眼等部位。","词源来自拉丁语 *fomes*，本义接近“引火物/火绒”，引申为“使疾病‘燃起’的媒介”。在现代语境中它特指能携带病原体的物体表面。"]}
{"word":"fomo","summary":{"en":"FOMO means “fear of missing out”: anxiety that you’re missing something others are doing.","zh":"FOMO 指“害怕错过”：担心自己错过别人正在经历的事而产生的焦虑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of anxiety that you might miss something fun, important, or interesting that other people are doing","zh":"害怕错过（他人正在经历的有趣、重要或新鲜事）的焦虑感"},"examples":[{"en":"I had serious FOMO when I saw everyone’s vacation photos.","zh":"看到大家的度假照片时，我有很强的“害怕错过”的感觉。"},{"en":"His FOMO made him say yes to every invitation, even when he was tired.","zh":"他的FOMO让他每个邀请都答应了，即使很累也一样。"},{"en":"I turned off social media for a week to reduce my FOMO.","zh":"我关掉社交媒体一周来减轻我的FOMO。"}]},{"partOfSpeech":"v.","definition":{"en":"to feel anxious about missing out on something (informal, often used humorously)","zh":"（非正式、常带玩笑语气）感到害怕错过；因怕错过而焦虑"},"examples":[{"en":"Don’t FOMO into buying tickets—think first.","zh":"别因为怕错过就冲动买票——先想清楚。"},{"en":"I’m trying not to FOMO over every new trend.","zh":"我在努力不对每个新潮流都产生“怕错过”的焦虑。"}]}],"synonyms":["fear of missing out","social anxiety (informal context)","comparison anxiety (informal)"],"phonetic":"/ˈfoʊmoʊ/","extraExplanation":["FOMO 是缩写，来自 “fear of missing out”。在口语和社交媒体上很常见，常与“刷动态/朋友圈”“活动邀请”“限时优惠”等情境相关。","常见搭配：have FOMO（有FOMO）、FOMO hits（FOMO来袭）、FOMO-driven（被FOMO驱动的）、FOMO purchase（因怕错过而买的东西）。","相关词：JOMO（joy of missing out，享受错过/享受不参与的快乐），用来表达与FOMO相反的心态。"]}

