{"word":"fop","summary":{"en":"A (often old-fashioned) word for a man who is overly focused on fashionable appearance and manners.","zh":"（偏老派、常带贬义）指过分在意时髦外表与举止的男人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man who is too concerned with his clothes, appearance, and fashionable manners (often in a silly or annoying way).","zh":"（常带贬义）过分讲究穿着和举止、爱卖弄时髦的男人；纨绔子弟。"},"examples":[{"en":"He walked into the party like a fop, adjusting his tie every few seconds.","zh":"他像个花花公子似的走进派对，每隔几秒就整理一次领带。"},{"en":"In the novel, the hero’s rival is a rich fop who cares more about style than character.","zh":"小说里，男主的对手是个富有的纨绔子弟，比起品格更在意排场。"}]}],"synonyms":["dandy","peacock","vain man","fashionslave"],"phonetic":"/fɑp/","extraExplanation":["“fop”是比较老派、文学感更强的词，现代日常口语里不算常用；常见于小说、戏剧或评论文章，用来讽刺一个人“只重外表、不重内在”。","语气通常带轻蔑或嘲笑色彩，使用时要注意礼貌与场合。更中性的说法可以用“fashion-conscious (person)”或“well-dressed man”。","相关近义词（语气从中性到贬义不等）：“dandy”（花花公子/讲究打扮的人，较文学）、“peacock”（爱炫耀的人，口语）、“vain person”（虚荣的人，更通用）。"]}
{"word":"fopdoodle","summary":{"en":"“Fopdoodle” is an old-fashioned, humorous insult meaning a foolish person.","zh":"“fopdoodle”是较古旧、带戏谑色彩的辱称，意思是“傻瓜/蠢人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foolish or silly person; a simpleton (often used as a humorous insult, now rare/old-fashioned).","zh":"傻瓜；蠢人（多作幽默或讥讽的称呼，如今较罕见、偏古旧）"},"examples":[{"en":"Don’t be a fopdoodle—read the instructions before you start.","zh":"别当傻瓜——开始之前先把说明书读一遍。"},{"en":"In the old satirical pamphlet, the politician is mocked as a “fopdoodle.”","zh":"在那本旧讽刺小册子里，那位政客被嘲讽成“蠢货”。"}]}],"synonyms":["fool","simpleton","nitwit","blockhead","nincompoop"],"phonetic":"/ˈfɑpˌduːdəl/","extraExplanation":["“fopdoodle”是较古旧的英语辱骂词，带有喜剧/讽刺色彩，常见于早期文学、讽刺文章或仿古文风中；现代口语里很少用。","词形上可理解为把“fop（浮夸的纨绔/花花公子）”与表示“人/家伙”的俚俗成分组合成一种贬义称呼，整体语气偏戏谑。使用时要注意场合，避免冒犯他人。"]}
{"word":"fopling","summary":{"en":"A rare, old-fashioned insult meaning a young or minor fop—someone vainly obsessed with fashion.","zh":"一个较古旧的贬义词，指“小花花公子/爱装扮而虚浮的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young or minor fop; a foolish, vain person who tries too hard to look fashionable (often used as an insult and now rare/old-fashioned).","zh":"（多为侮辱、较古旧）小花花公子；装腔作势、爱炫耀打扮的愚蠢之人。"},"examples":[{"en":"The novelist mocks the fopling who cares more about ribbons than real work.","zh":"小说嘲讽那个小花花公子，宁可在意丝带也不愿认真干活。"},{"en":"Don’t be a fopling—dress neatly, but focus on what you can do.","zh":"别当个只会装样子的家伙——穿整洁就好，更重要的是能力。"}]}],"synonyms":["fop","dandy","peacock (figurative)","poseur"],"phonetic":"/ˈfɑp.lɪŋ/","extraExplanation":["“fopling”由“fop（爱打扮、虚浮的男子）+ -ling（表示‘小的/年轻的’）”构成，语气带轻蔑或讽刺，现代英语中很少用，更常见的是“fop”。在文学或历史语境里出现时，通常用来嘲笑一个人过分在意外表与时髦、缺乏实质能力或品格。"]}
{"word":"fopped","summary":{"en":"“Fopped” means “dressed in an overly fancy/showy way” (past tense of the rare verb “fop”).","zh":"“fopped”指“打扮得过分讲究/花哨”（较少见动词 fop 的过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of fop) to dress up in an overly fancy or showy way; to make oneself look like a “fop” (a man overly concerned with fashion and appearance).","zh":"（fop 的过去式/过去分词）过分讲究穿着、打扮得花枝招展；把自己装扮成“花花公子/纨绔子弟”那样。"},"examples":[{"en":"He fopped around in a velvet jacket and a cane, trying to look important.","zh":"他穿着天鹅绒夹克、拄着手杖到处招摇，想显得很了不起。"},{"en":"The actor was fopped up for the period drama, with a wig and lace cuffs.","zh":"为了那部年代剧，这位演员被打扮得很“纨绔”，戴上假发、配上蕾丝袖口。"}]}],"synonyms":["dressed up","decked out","dolled up","gussied up"],"phonetic":"/fɑpt/","extraExplanation":["“fop”在18世纪英语里更常见，指过度追求时髦、讲究外表的男性，带一点讽刺意味；“fopped (up/out)”多见于较文学、戏剧或历史题材的表达，日常英语里更常用“dress up”或“get all dressed up”。"]}
{"word":"fopperies","summary":{"en":"“Fopperies” means silly, trivial nonsense, or showy/pretentious behavior—often about fashion and appearances.","zh":"“fopperies”指愚蠢琐碎的无聊事，也可指浮华爱打扮、装腔作势的做派（常带讽刺语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Silly or trivial actions, ideas, or talk that are not worth taking seriously.","zh":"愚蠢或琐碎的行为、想法或言谈；不值得认真对待的事。"},"examples":[{"en":"He dismissed the argument as fopperies and changed the subject.","zh":"他把那套论点当作无聊的蠢话，便转移了话题。"},{"en":"In a crisis, small fopperies don’t matter.","zh":"在危机时刻，小小的虚荣或琐事并不重要。"}]},{"partOfSpeech":"n.","definition":{"en":"Showy, overly fashionable dress or behavior; exaggerated concern with looking stylish.","zh":"浮华的穿着或举止；对时髦外表的过度在意。"},"examples":[{"en":"The novel pokes fun at the aristocracy’s fopperies—perfume, lace, and endless posing.","zh":"这部小说嘲讽贵族的浮华做派——香水、蕾丝以及无休止的摆姿势。"},{"en":"He grew tired of court fopperies and wanted a simpler life.","zh":"他厌倦了宫廷的浮华矫饰，想过更朴素的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"Affected, pretentious manners meant to impress others.","zh":"装腔作势、矫揉造作的举止；为博人眼球而摆出的姿态。"},"examples":[{"en":"Her warm honesty cut through his fopperies.","zh":"她的真诚温暖刺破了他的矫饰。"},{"en":"The speaker’s fopperies distracted from the main point.","zh":"演讲者的装腔作势分散了人们对重点的注意。"}]}],"synonyms":["nonsense","trivialities","frivolities","vanities","affectation","pretension"],"phonetic":"/ˈfɑpəri/","extraExplanation":["“fopperies”是“foppery”的复数，语气通常带嘲讽或轻蔑，常见于较正式或文学性的语境。","词根来自“fop”（花花公子、浮夸爱打扮的男人），因此它常与“过分讲究外表、矫饰”相关，但也可泛指“无关紧要的蠢事”。","在文学里，这个词常用来讽刺上流社会的表面功夫与虚荣，例如描写宫廷、贵族社交场合的“浮华与做派”。"]}
{"word":"fopperly","summary":{"en":"“Fopperly” means “in an overly fashionable, showy, vain way,” often with a humorous or mocking tone.","zh":"“fopperly”表示“过分讲究时髦、爱炫耀（带讽刺/调侃语气）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is overly concerned with fashionable clothes or appearance; showily dressed and a bit vain.","zh":"（举止、穿着）过分讲究时髦、爱炫耀，带点虚荣地。"},"examples":[{"en":"He was dressed fopperly in a bright jacket and polished shoes.","zh":"他穿得很“花哨讲究”，亮色夹克配擦得锃亮的皮鞋。"},{"en":"The character speaks fopperly, as if trying too hard to sound elegant.","zh":"这个角色说话很“矫饰”，像是太用力想显得优雅。"}]}],"synonyms":["foppishly","showily","flashily","vainly","ostentatiously"],"phonetic":"/ˈfɑpərli/","extraExplanation":["“fopperly”来自名词“fop”（花花公子、纨绔子弟；过分讲究打扮的人）。在18—19世纪英国文学与戏剧里常用来讽刺某些男性角色过度追求外表与社交姿态。","用法提示：这是较少见、带讽刺色彩的副词。更常见的表达有“in a foppish way / flamboyantly / vainly / showily”。","文学语境：在描写“dandy / fop”类型人物（比如喜剧中被嘲弄的“爱打扮先生”）时，这个词能快速营造讽刺的语气。"]}
{"word":"foppery","summary":{"en":"Foppery means showy, silly overattention to fashion and appearance, or overly fancy, unnecessary clothes and decorations.","zh":"Foppery 指对穿着外表的浮夸讲究（矫饰做派），也可指过分花哨而不必要的服饰或装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Showy or silly concern with fashionable clothes, appearance, and manners; behavior typical of a “fop” (a man overly focused on looking stylish).","zh":"对时髦服饰、外表与举止的浮夸或愚蠢的讲究；“花花公子/纨绔子弟式”的矫饰做派。"},"examples":[{"en":"The novel mocks the character’s foppery—his fancy clothes and empty talk.","zh":"这部小说嘲讽了这个人物的矫饰做派——华丽的衣服与空洞的言谈。"},{"en":"She rolled her eyes at his foppery and asked him to be practical for once.","zh":"她对他的装腔作势翻了个白眼，叫他难得务实一点。"}]},{"partOfSpeech":"n.","definition":{"en":"Clothes, accessories, or decorative items that seem overly fancy or unnecessary.","zh":"过分华丽或不必要的服饰、饰品等“花里胡哨的东西”。"},"examples":[{"en":"He spent his money on foppery instead of saving for rent.","zh":"他把钱花在花里胡哨的东西上，而不是存起来付房租。"}]}],"synonyms":["vanity","affectation","dandyism","pretension","ostentation"],"phonetic":"/ˈfɑpəri/","extraExplanation":["“foppery”来自“fop”（指过度讲究打扮、显得轻浮的人，常见于18世纪英国的社会讽刺语境）。因此它常带有批评、嘲弄的语气，尤其在文学评论或描写上流社会虚饰时出现。","搭配上常见：mere/empty foppery（空洞的矫饰）、vain foppery（虚荣的做派）、courtly foppery（宫廷式矫饰）。"]}
{"word":"fopping","summary":{"en":"“Fopping” is a rare word meaning behaving or dressing in a showy, overly fashionable way (like a “fop”).","zh":"“fopping”较少见，指像“fop（爱装、过分讲究打扮的人）”那样举止或穿着：浮夸、矫饰、过分追求时髦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Acting or dressing like a fop; being very concerned with fashionable clothes and appearance in a showy way.","zh":"（少见）像“花花公子/纨绔子弟（fop）”一样行事或穿着；过分讲究时髦、打扮得很张扬。"},"examples":[{"en":"He walked in with fopping confidence, adjusting his tie every few seconds.","zh":"他带着一种很“浮夸讲究”的自信走进来，每隔几秒就整理一下领带。"},{"en":"The novel mocks a fopping young gentleman who cares more about style than character.","zh":"小说嘲讽了一个“爱装、爱打扮”的年轻绅士，比起品格更在意外表。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “fop” (rare): to behave in an affected, overly fashionable way.","zh":"“fop”的现在分词（少见）：举止矫饰、过分追求时髦地表现自己。"},"examples":[{"en":"He was fopping about the room, checking his reflection in every mirror.","zh":"他在房间里装模作样地转来转去，对着每面镜子都要照一照。"}]}],"synonyms":["foppish","dandyish","overdressed","showy","affected"],"phonetic":"/ˈfɑpɪŋ/","extraExplanation":["“fop”常见于18—19世纪的英语语境，指过分讲究衣着、举止矫饰的男性（类似“花花公子/纨绔”但更强调装扮与做作）。现代英语里更常用“foppish”（adj. 过分讲究的、矫饰的）或直接说“overdressed / showy”。"]}
{"word":"foppish","summary":{"en":"“Foppish” describes a man who is showily fashionable and affected in a way that seems silly.","zh":"“foppish”形容男性衣着打扮与举止过分讲究、矫饰浮夸，带讽刺意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a man) overly concerned with his clothes, appearance, and stylish manners in a way that seems silly or affected","zh":"（指男性）过分讲究穿着与仪表、举止矫饰，给人轻浮做作的感觉"},"examples":[{"en":"He arrived in a foppish suit with a bright scarf and a cane.","zh":"他穿着一身花哨的西装，围着亮色围巾，还拄着手杖，显得很“纨绔/做作”。"},{"en":"The novel makes fun of a foppish gentleman who talks more about fashion than ideas.","zh":"小说讽刺了一位轻浮做作的绅士，他谈论的多是时尚而不是思想。"}]}],"synonyms":["dandyish","affected","overdressed","prissy"],"phonetic":"/ˈfɑpɪʃ/","extraExplanation":["“foppish”来自名词“fop”（纨绔子弟、浮华矫饰的男子）。这个词常见于文学、戏剧或带讽刺意味的描写，强调“做作、浮夸”的气质，而不仅仅是“穿得好看”。","在英国18—19世纪的社会讽刺作品中，常用“fop / foppish”来讽刺只重外表与社交礼仪、缺乏深度的人物类型（有点像“dandy”但更偏贬义）。"]}
{"word":"foppishly","summary":{"en":"“Foppishly” means doing something in an overly stylish, showy, and affected way.","zh":"“foppishly”表示以过分时髦、卖弄且矫饰的方式行事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly fashionable, showy, or affectedly elegant way (often suggesting someone cares too much about appearance).","zh":"以过分讲究穿着、卖弄时髦或矫揉造作的方式（常含贬义，暗示太在意外表）。"},"examples":[{"en":"He dressed foppishly, with a bright scarf and polished shoes.","zh":"他穿得很“花哨讲究”，亮色围巾配擦得锃亮的皮鞋。"},{"en":"She spoke foppishly, as if trying to sound more refined than everyone else.","zh":"她说话带着矫饰的腔调，仿佛想显得比别人更“高雅”。"}]}],"synonyms":["dandily","vainly","affectedly","pretentiously"],"phonetic":"/ˈfɑpɪʃli/","extraExplanation":["“foppishly”来自形容词“foppish”，而“fop”在18—19世纪英语里常指“花花公子/纨绔子弟”式的人物：过度注重衣着与姿态。这个词在文学或影视评论中较常见，用来带点讽刺地描写一个人的外表与做派。"]}
{"word":"foppishness","summary":{"en":"“Foppishness” means an overly showy concern with fashion and appearance, often in a silly or vain way.","zh":"“foppishness”指过度、夸张地在意时尚与外表，常带“虚荣、做作、可笑”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being foppish: being overly concerned with clothes, appearance, and stylish manners in a way that seems vain or ridiculous.","zh":"“纨绔/花花公子式”的特质：过度在意穿着、外表和时髦举止，显得虚荣或可笑。"},"examples":[{"en":"His foppishness showed in the way he adjusted his tie every few minutes.","zh":"他那种纨绔气表现在每隔几分钟就要整理一下领带。"},{"en":"The novel pokes fun at the foppishness of wealthy young men in the city.","zh":"这部小说讽刺了城里富家公子的矫饰与浮华。"}]}],"synonyms":["vanity","affectation","pretentiousness","dandyism"],"phonetic":"/ˈfɑpɪʃnəs/","extraExplanation":["“foppishness”来自“fop”（花花公子、爱打扮的男人）。在英美文化中常带轻微嘲讽色彩，常见于描写18—19世纪上流社会或喜剧作品里，强调“矫饰、装腔作势”的外表风格，而不只是“穿得好看”。","语气提示：它通常不是中性夸奖（不像“stylish”），更接近“vain/pretentious”（虚荣/做作）。如果只想表达“很会穿、很有品味”，更自然的词是“well-dressed”“fashionable”或“dapper”（偏褒）。"]}
{"word":"foppy","summary":{"en":"“Foppy” is a rare informal adjective meaning “foppish”—showily fashionable or too concerned with appearance.","zh":"“foppy”是罕见的非正式形容词，意思接近“foppish”：爱炫耀时髦、过分在意外表。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, informal) Like a fop; overly concerned with fashionable clothes and appearance in a showy way.","zh":"（罕见，非正式）像“纨绔/花花公子”那样的；过分讲究穿着外表、爱炫耀时髦的。"},"examples":[{"en":"He wore a foppy jacket with shiny buttons, trying too hard to look stylish.","zh":"他穿着一件很“纨绔气”的亮扣夹克，太刻意想显得时髦。"},{"en":"The character is written as foppy and self-absorbed.","zh":"这个角色被写成爱打扮又自恋的类型。"}]}],"synonyms":["foppish","dandyish","showy","vain","affected"],"phonetic":"/ˈfɑpi/","extraExplanation":["“foppy”并不是常见标准拼写，更常用的是 **foppish**（adj. 过分讲究穿戴的）或名词 **fop**（n. 过分讲究穿着、举止浮夸的男人）。如果你本来想写的是“软塌塌/松垮的”，那通常是 **floppy**（adj.）。"]}
{"word":"fops","summary":{"en":"“Fops” is the plural of “fop”: a man mocked for being too focused on fashion and appearance.","zh":"“fops”是“fop”的复数：指（常带嘲讽）过分讲究穿着外表、爱摆派头的男人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man who is overly concerned with his clothes, appearance, and fashionable manners (often used in a mocking or critical way).","zh":"（常带嘲讽）过分讲究穿着外表、举止浮夸的男人；纨绔子弟；花花公子。"},"examples":[{"en":"In the novel, he’s portrayed as a fop who cares more about his hair than his work.","zh":"在小说里，他被描写成一个只在乎发型胜过工作的纨绔子弟。"},{"en":"Don’t be such a fop—dress neatly, but focus on the meeting.","zh":"别这么爱摆派头——穿得整洁就好，把注意力放在会议上。"},{"en":"The play makes fun of a group of fops showing off their fancy coats.","zh":"这出戏讽刺了一群花花公子炫耀他们华丽的外套。"}]}],"synonyms":["dandy","fashion plate","fop (singular)","peacock (informal)","vain man"],"phonetic":"/fɑp/","extraExplanation":["“fop”在17—18世纪英国文本中很常见，常用来讽刺那些追逐时髦、举止矫饰的上层或城市男性形象。在文学与戏剧里，这类角色经常被当作喜剧对象，强调“外表胜过内在”的反差。","单数是“a fop”，复数是“fops”。如果你是在句子里看到“fops”，通常就是指“这些花花公子/纨绔子弟（复数）”。"]}
{"word":"fopship","summary":{"en":"Fopship means dandiness—the showy, overly fashionable behavior of a fop.","zh":"Fopship 指“花花公子/纨绔式的做派”，即过度炫耀时髦与外表的风格或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the behavior, style, or state of being a fop (a man who is overly concerned with fashionable clothes and appearance); dandiness","zh":"纨绔/花花公子式的做派；过度讲究穿着打扮的风格或状态；“卖弄时髦”"},"examples":[{"en":"He mocked the actor’s fopship—perfect curls, perfume, and a too-bright waistcoat.","zh":"他嘲笑那位演员的“纨绔做派”——卷得完美的头发、香水味，还有一件过于鲜艳的马甲。"},{"en":"The novel uses fopship to satirize empty social status and shallow manners.","zh":"这部小说用“花花公子式的做派”来讽刺虚浮的社会地位与肤浅的礼仪。"}]}],"synonyms":["dandiness","foppishness","affectation","vanity"],"phonetic":"/ˈfɑpˌʃɪp/","extraExplanation":["“fopship”是较为古旧、带讽刺意味的词，多见于18—19世纪的文学或评论中，用来嘲弄某些男性把精力过多放在外表、时髦与社交姿态上。","构词上类似于“friendship / leadership”：在“fop”后加“-ship”，表示“……的状态/特质”。"]}

