{"word":"FOS","summary":{"en":"FOS is an abbreviation. In online slang it often means “full of shit” (vulgar). In technical contexts it can mean other things (e.g., “factor of safety”).","zh":"FOS 是缩写。网络俚语里常指粗俗的“full of shit（胡扯）”；在专业语境中也可能表示其他含义（如工程里的“安全系数”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang, vulgar) “full of shit”—used to say someone is lying, exaggerating, or talking nonsense.","zh":"（网络俚语，粗俗）“满嘴胡说/在胡扯”——用来表示某人在撒谎、夸大或说废话。"},"examples":[{"en":"Ignore him—he’s FOS.","zh":"别理他——他在胡扯。"},{"en":"That story sounds FOS to me.","zh":"我觉得那个故事不靠谱，像是在瞎编。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used in different fields; meanings vary by context (e.g., “factor of safety” in engineering, or other specialized uses).","zh":"一个在不同领域使用的缩写；具体含义取决于语境（例如工程里的“安全系数”等）。"},"examples":[{"en":"The report lists FOS values for each component.","zh":"报告列出了每个部件的 FOS 数值。"},{"en":"What does FOS stand for in this document?","zh":"在这份文件里，FOS 代表什么？"}]}],"synonyms":["nonsense (informal)","BS (informal, vulgar)","lying (contextual)"],"phonetic":"/ˌɛf oʊ ˈɛs/","extraExplanation":["“FOS”最常见的日常用法之一是粗口缩写（full of shit）。在正式写作、工作邮件或不熟悉的场合建议避免使用，以免冒犯他人。","缩写很依赖场景：如果你告诉我它出现在哪句话/哪个领域（聊天、工程报告、学校文件、游戏等），我可以帮你确定最可能的含义。"]}
{"word":"fosh","summary":{"en":"“fosh” is informal slang meaning “for sure,” and it can also refer to the acronym FOSH (Free and Open Source Hardware).","zh":"“fosh”多为口语/网络用语，表示“当然、肯定（for sure）”；也可指缩写 FOSH（自由与开源硬件）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, texting) Short for “for sure,” used to strongly agree or confirm.","zh":"（非正式/短信用语）“for sure”的缩写，表示强烈同意或确认。"},"examples":[{"en":"—You’re coming tonight, right? —Fosh.","zh":"——你今晚会来吧？——当然。"},{"en":"Fosh, I can help you with that homework.","zh":"当然，我可以帮你写那个作业。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) Free and Open Source Hardware (often written as FOSH).","zh":"（首字母缩写）自由与开源硬件（常写作 FOSH）。"},"examples":[{"en":"This project releases its design files under a FOSH license.","zh":"这个项目在自由与开源硬件许可下发布设计文件。"},{"en":"FOSH communities share schematics so others can build and modify devices.","zh":"FOSH 社群分享电路图，让他人能制作并改造设备。"}]}],"synonyms":["for sure","definitely","sure","of course"],"phonetic":"/fɑʃ/","extraExplanation":["“fosh”本身不是标准英语词，更多见于聊天/弹幕里作为“for sure”的随手缩写；也有人把“fosho/fo sho”写成“fosh”。语气通常很口语，正式写作不建议使用。","作为缩写词 FOSH（Free and Open Source Hardware）时，通常按字母读（F-O-S-H），常见于工程/开源社区语境。"]}
{"word":"fosie","summary":{"en":"“fosie” is not a common English word; it’s usually a surname or a misspelling of a similar name.","zh":"“fosie”不是常见英语词；通常是姓氏或相近名字的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word; most often seen as a surname or a misspelling of a similar-looking name (for example, “Fossey” or “Fozzie”).","zh":"不是标准英语词汇；最常见于姓氏，或作为相近拼写名字的误拼（例如“Fossey”或“Fozzie”）。"},"examples":[{"en":"I couldn’t find “fosie” in the dictionary—did you mean “Fossey” or “foxy”?","zh":"我在词典里找不到“fosie”——你是想写“Fossey”还是“foxy”？"},{"en":"Fosie is used here as a family name, not a common vocabulary word.","zh":"这里的 Fosie 用作姓氏，不是常见词汇。"}]}],"extraExplanation":["“fosie”在英语里不常作为普通词使用。你可能想查的是：\n1) Fossey：常指人名（如著名灵长类动物学家 Dian Fossey）。\n2) Fozzie：常指《布偶秀》（The Muppet Show）里的角色 Fozzie Bear。\n3) foxy（形容词）：意思是“狡猾的；（口语）性感的”。\n如果你能告诉我它出现的句子或上下文（聊天、书名、人名、地名等），我可以帮你精准判断。"]}
{"word":"fosite","summary":{"en":"Fosite is a mythological name for a Germanic deity connected with justice and peace, often related to the Norse god Forseti.","zh":"Fosite 是神话中的名称，指与正义与和平相关的日耳曼神祇，常与北欧神 Forseti 相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Germanic mythology) a deity associated with justice, peace, and reconciliation; often considered a Frisian name/form related to the Norse god Forseti.","zh":"（日耳曼神话中）与正义、和平与调解相关的神祇；常被认为是与北欧神“Forseti（福塞提）”有关的弗里西亚名称/形式。"},"examples":[{"en":"In some accounts, Fosite is described as a god who settles disputes peacefully.","zh":"在一些记载中，Fosite 被描述为以和平方式解决纷争的神。"},{"en":"The name Fosite is sometimes linked to Forseti in discussions of Germanic mythology.","zh":"在讨论日耳曼神话时，“Fosite”这个名字有时会与“Forseti”联系起来。"}]}],"synonyms":["Forseti"],"phonetic":"/ˈfoʊziːt/","extraExplanation":["“Fosite”常见于关于弗里西亚（Frisia）地区与北欧传统比较研究的语境中；在更常见的北欧神话体系里，对应或更广为人知的名字通常是“Forseti”。","如果你是想查日常英语单词，可能是拼写错误：例如 *faucet*（水龙头）或 *foresight*（远见）。你可以告诉我你想表达的意思或提供一句例句，我可以帮你确定正确单词。"]}
{"word":"foss","summary":{"en":"FOSS most commonly means “Free and Open Source Software.”","zh":"FOSS 最常见的意思是“自由及开源软件”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Acronym) Free and Open Source Software; software whose source code is available to the public to use, modify, and share under an open license.","zh":"（缩写）自由及开源软件；指源代码公开、允许在开放许可证下使用、修改与分享的软件。"},"examples":[{"en":"Many startups use FOSS tools like Linux and Git to reduce costs.","zh":"许多初创公司使用 Linux、Git 等 FOSS 工具来降低成本。"},{"en":"Our team chose a FOSS library so we could inspect and change the code if needed.","zh":"我们团队选择了一个 FOSS 库，这样需要时可以检查并修改代码。"},{"en":"Some governments encourage the use of FOSS in public projects.","zh":"一些政府鼓励在公共项目中使用 FOSS。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A surname or name element in some family names (e.g., Foss).","zh":"（较少见）姓氏或姓名的一部分（如 Foss）。"},"examples":[{"en":"She emailed Dr. Foss about the research project.","zh":"她给 Foss 博士发邮件讨论研究项目。"}]}],"synonyms":["open-source software","FLOSS","open-source"],"phonetic":"/fɑs/","extraExplanation":["在科技语境里，常见写法是大写 **FOSS**。有时你也会看到 **FLOSS**（Free/Libre and Open Source Software），其中 *Libre* 强调“自由（权利）”而不只是“免费（价格）”。","FOSS 通常与具体许可证相关（如 GPL、MIT、Apache），不同许可证对“再发布、修改、是否必须开源衍生作品”等要求不一样。"]}
{"word":"fossa","summary":{"en":"Fossa most commonly means a hollow or depression in anatomy; it can also refer to the fossa, a carnivorous mammal from Madagascar.","zh":"fossa 最常见指解剖学中的“凹窝/凹陷”；也可指马达加斯加的一种食肉动物“马岛獴（马岛灵猫）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small pit, groove, or hollow in the body, especially in a bone or organ (common in anatomy).","zh":"（解剖）小凹陷、凹窝、沟；尤指骨或器官上的凹陷。"},"examples":[{"en":"The doctor pointed to the fossa behind the knee on the anatomy chart.","zh":"医生在解剖图上指着膝后方的腘窝（fossa）。"},{"en":"In the skull, several fossae help hold and protect parts of the brain.","zh":"在颅骨中，有多个凹窝用来承托并保护脑的部分结构。"}]},{"partOfSpeech":"n.","definition":{"en":"A carnivorous mammal from Madagascar (Cryptoprocta ferox), similar in shape to a cat and known for hunting lemurs.","zh":"（动物）马岛獴（又称“马岛灵猫”，学名 Cryptoprocta ferox），一种马达加斯加的食肉动物，外形有点像猫，以捕食狐猴闻名。"},"examples":[{"en":"The fossa is Madagascar’s largest native carnivore.","zh":"马岛獴是马达加斯加本土最大的食肉动物。"},{"en":"In wildlife documentaries, a fossa is sometimes shown climbing trees to hunt lemurs.","zh":"在野生动物纪录片里，常能看到马岛獴爬树捕猎狐猴。"}]}],"synonyms":["anatomical: hollow","anatomical: depression","anatomical: cavity (general)"],"phonetic":"/ˈfɑsə/","extraExplanation":["“fossa”来自拉丁语，意思是“沟、坑”。英语中多用于医学/解剖学术语，常见搭配如：popliteal fossa（腘窝，膝后凹窝）、cranial fossa（颅窝）、iliac fossa（髂窝）。","动物名“fossa”源自马达加斯加当地语言的转写；在英语语境中通常读作与“FOSS-uh”相近。"]}
{"word":"fossa-like","summary":{"en":"“Fossa-like” means shaped like a fossa—i.e., a hollow, pit, or shallow anatomical depression.","zh":"“fossa-like”指“像凹窝/凹陷/浅坑那样的”，常用于医学解剖或生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a fossa (a hollow, pit, or depression), especially a shallow anatomical groove or basin-like cavity.","zh":"像“fossa（凹窝/凹陷/窝）”的；尤指像解剖学中的浅沟、凹陷或盆状腔那样的。"},"examples":[{"en":"The scan showed a fossa-like depression near the joint surface.","zh":"扫描显示关节表面附近有一个类似凹窝的凹陷。"},{"en":"Some insects leave fossa-like pits in soft wood.","zh":"有些昆虫会在软木上留下类似凹坑的孔洞。"}]}],"synonyms":["pit-like","hollowed","depressed","concave","basin-shaped"],"phonetic":"/ˈfɑsə laɪk/","extraExplanation":["“fossa”是拉丁语，原意是“沟/坑”。在医学与解剖学里非常常见，用来指骨头或器官表面的凹陷（如 cranial fossa 颅窝）。因此“fossa-like”多见于医学、解剖、古生物或生物学描述中。","写作上常用连字符表示“像……一样”的复合形容词：fossa-like。也可写作 fossal（较少见、偏专业）。"]}
{"word":"fossae","summary":{"en":"Fossae means multiple anatomical depressions or hollow spaces (plural of fossa).","zh":"fossae 指多个解剖学上的凹陷/窝/腔（fossa 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of fossa) Anatomical depressions, grooves, or hollow spaces in a bone or organ.","zh":"（fossa 的复数）解剖学中指骨头或器官上的“凹陷、窝、沟、腔”。"},"examples":[{"en":"The surgeon inspected the fossae at the base of the skull.","zh":"外科医生检查了颅底的各个凹窝。"},{"en":"Several fossae in the pelvis provide space for muscles and nerves.","zh":"骨盆内的多个凹窝为肌肉和神经提供空间。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, general use) Pits or trenches; hollowed-out places.","zh":"（较少见的一般用法）坑、沟；被挖空或凹下的地方。"},"examples":[{"en":"Ancient fossae were dug to help drain the fields.","zh":"古代人挖掘排水沟（fossae）来帮助田地排水。"}]}],"synonyms":["depressions","grooves","hollows","cavities"],"phonetic":"/ˈfɑːsiː/","extraExplanation":["“fossae”来自拉丁语复数形式（单数：fossa）。在英语里多见于医学、解剖学与生物学写作，常直接用拉丁复数而不用规则的 -s 复数。","常见搭配（多为解剖名词）：cranial fossae（颅窝）、nasal fossae（鼻腔/鼻窝）、infratemporal fossa（颞下窝，单数更常见）。"]}
{"word":"fossage","summary":{"en":"Fossage is an archaic word meaning a ditch or defensive trench (a moat), and more rarely the work of digging such a ditch.","zh":"fossage 是一个古义词，指沟渠/壕沟（类似护城河），更少见时也可指挖沟这项工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A ditch or trench, especially one used as a defensive moat around a place.","zh":"（古义）沟渠；壕沟（尤指用于防御、类似护城河的壕沟）。"},"examples":[{"en":"In the old chronicle, the castle is described as being protected by a deep fossage.","zh":"在那部古老的编年史里，城堡被描述为有一条很深的壕沟保护着。"},{"en":"They crossed the fossage before reaching the outer wall.","zh":"他们在到达外墙之前先跨过了壕沟。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) The act of digging a ditch; ditch-digging work.","zh":"（罕见/古义）挖沟的行为；挖壕沟的工程。"},"examples":[{"en":"The villagers were ordered to do fossage along the road after the heavy rains.","zh":"暴雨过后，村民被命令沿路进行挖沟排水的工程。"}]}],"synonyms":["ditch","trench","moat","fosse","excavation"],"phonetic":"/ˈfɑsɪdʒ/","extraExplanation":["“fossage”在现代英语中非常少见，多见于历史文本、古法律/军事语境或仿古写作。","词源上与法语“fossé”（沟、壕）同源，核心意象都是“挖出来的沟槽”。阅读时可把它理解为更古旧的“ditch / moat”。","如果你是在现代文章里看到它，也有可能是拼写误差，常见被误写/误读的词包括“foliage（树叶、枝叶）”“forage（觅食）”“postage（邮资）”等；你可以把原句发我，我帮你判断。"]}
{"word":"fossane","summary":{"en":"“fossane” is not a recognized common English word; it’s likely a misspelling or a proper name, so meaning depends on context.","zh":"“fossane”不是常见的英语词；多半是拼写错误或专有名词，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling or a proper name (e.g., a surname, place name, or brand).","zh":"不是标准英语单词；可能是拼写错误，或是专有名词（如姓氏、地名、品牌名）。"},"examples":[{"en":"I couldn’t find “fossane” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英文词典里找不到“fossane”——你能把它出现的句子发我吗？"},{"en":"It might be a name, so the meaning could depend on the context (a person, a place, or a product).","zh":"它可能是名字，所以含义要看语境（人名、地名或产品名）。"}]}],"extraExplanation":["“fossane”很可能是拼写误差。你可以：\n1）把它所在的整句话发来（最有效）；\n2）确认是否应为更常见的单词，比如：\n- “forsaken”（被遗弃的；被抛弃的）\n- “fountain”（喷泉；源泉）\n- “fossil”（化石；守旧的人）\n- “Foshan”（佛山，地名，常见拼写）\n不同目标词意思差别很大，需要语境才能准确判断。"]}
{"word":"fossarian","summary":{"en":"Fossarian is a name from *Catch-22*, referring to Captain John Yossarian, and by extension something “Catch-22-like” in its absurdity.","zh":"Fossarian 出自《第二十二条军规》，指主角约翰·约瑟瑞安；引申也可形容带有“第二十二条军规式”荒诞与黑色幽默的情境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The main fictional character in Joseph Heller’s novel *Catch-22*: Captain John Yossarian, a U.S. Army Air Forces bombardier who tries to survive World War II and resists the military’s absurd rules.","zh":"（专有名词）约瑟夫·海勒小说《第二十二条军规》（*Catch-22*）中的主角：约翰·约瑟瑞安（John Yossarian）上尉，一名美军轰炸机投弹手，为了活下去而反抗军队荒诞的规则。"},"examples":[{"en":"Fossarian keeps asking to be grounded because he believes the missions are deadly and senseless.","zh":"Fossarian 一直请求停飞，因为他认为那些任务致命又毫无意义。"},{"en":"In *Catch-22*, Fossarian becomes a symbol of someone trapped by a system that punishes common sense.","zh":"在《第二十二条军规》中，Fossarian 成了被一个“惩罚常识”的体制困住的人的象征。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Relating to Fossarian/Yossarian or to the kind of darkly humorous, anti-bureaucratic situation associated with *Catch-22*.","zh":"（形容词）与 Fossarian/约瑟瑞安有关的；或指带有《第二十二条军规》式黑色幽默、反官僚荒诞感的。"},"examples":[{"en":"The office’s policy felt Fossarian—no matter what you did, you were somehow “in the wrong.”","zh":"办公室的政策很“Fossarian 式”——不管你怎么做，似乎都会“做错”。"},{"en":"People use the name Fossarian to evoke the survival instinct of an antihero in a ridiculous system.","zh":"人们会用 Fossarian 这个名字来唤起那种在荒诞体制中求生的“反英雄”本能。"}]}],"synonyms":["Yossarian","antihero","Catch-22-like"],"phonetic":"/fɑːˈsɛriən/","extraExplanation":["“Fossarian”在书里常见，但主角更广为人知的名字是“Yossarian”。有些读者会把这两个写法混用；如果你在英语文本里看到“Fossarian”，通常是在指《第二十二条军规》及其主角所代表的“被制度困住的荒诞处境”。","《Catch-22》是英语文化里非常有影响力的反战讽刺小说；“Catch-22 / 第二十二条军规”后来也成了常用词，指“自相矛盾、让人无法脱身的规则陷阱”。"]}
{"word":"fossate","summary":{"en":"Fossate means “having a defensive ditch” and can also refer to the ditch itself (rare).","zh":"fossate 指“有防御壕沟的”，也可指“壕沟本身”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in archaeology or old descriptions) surrounded or protected by a ditch (a moat-like trench).","zh":"（尤用于考古或旧式描述）被壕沟/护城河般的沟渠环绕的；有壕沟防护的。"},"examples":[{"en":"The settlement was described as fossate, with a ditch encircling the outer wall.","zh":"这处聚落被描述为有壕沟防护，外墙周围有一圈沟渠。"},{"en":"Archaeologists found evidence that the fort may have been fossate in its earliest phase.","zh":"考古学家发现证据表明，这座堡垒在最早期可能有壕沟环绕。"}]},{"partOfSpeech":"n.","definition":{"en":"A ditch or trench, especially one used for defense.","zh":"壕沟；沟渠（尤指用于防御的沟）。"},"examples":[{"en":"A shallow fossate marked the boundary of the site.","zh":"一条浅浅的壕沟标出了遗址的边界。"}]}],"synonyms":["ditched","moated","trenched","moat","ditch","trench"],"phonetic":"/ˈfɑːseɪt/","extraExplanation":["这个词很少见，多出现在考古报告、古代军事工事或旧文献里。日常英语更常用 moat（护城河）或 ditch/trench（沟/壕沟）。","词源与拉丁语 fossa（“挖出的沟；壕沟”）有关，因此常与“防御工事、围绕式沟渠”这一语境搭配。"]}
{"word":"fosse","summary":{"en":"A “fosse” is a trench or moat (often defensive); in anatomy, it can mean a small hollow.","zh":"“fosse”指（多用于防御的）壕沟/护城河；在解剖学中也指小凹陷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ditch, trench, or moat (often defensive), sometimes filled with water.","zh":"（常指防御用的）壕沟、沟渠或护城河；有时注水。"},"examples":[{"en":"The castle was protected by a deep fosse.","zh":"城堡被一条很深的护城河保护着。"},{"en":"Archaeologists found traces of a fosse around the ancient settlement.","zh":"考古学家发现古代聚落周围有壕沟的遗迹。"}]},{"partOfSpeech":"n.","definition":{"en":"In anatomy, a small hollow or depression in a bone or organ.","zh":"【解剖】骨或器官上的凹陷、窝。"},"examples":[{"en":"The doctor pointed to a small fosse in the skull.","zh":"医生指着颅骨上的一个小凹陷。"}]}],"synonyms":["moat","ditch","trench","excavation","hollow","depression"],"phonetic":"/fɑs/","extraExplanation":["“Fosse”是较正式、偏学术/文学的词，日常英语里更常用“ditch / trench / moat”。在英国等地，“Fosse”也常见于地名（例如古罗马道路“Fosse Way”），带有历史色彩。"]}
{"word":"fossed","summary":{"en":"“Fossed” is usually a nonstandard spelling of “fussed” (worried or made a fuss). Very rarely, it can be the past tense of a dialect verb “foss” (to rummage).","zh":"“fossed”通常是把“fussed”（过分担心/小题大做）拼错了；极少数情况下也可能是方言动词“foss”（翻找）的过去式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A misspelling of “fussed” (past tense of fuss), meaning you worried too much or made too much trouble over something.","zh":"（非标准）常见的拼写错误：把“fussed”（fuss 的过去式）写成了“fossed”，意思是“过分担心/小题大做/为小事忙乱”。"},"examples":[{"en":"I think you meant “fussed”: She fussed over the details all morning.","zh":"你大概是想写“fussed”：她整个上午都在为细节操心。"},{"en":"Don’t be so hard on yourself—you fussed, but you were trying to help.","zh":"别对自己太苛刻——你是有点小题大做，但你是想帮忙。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very rare, dialect) Past tense of “foss,” meaning to rummage or search around for something.","zh":"（非常少见，方言）动词“foss”的过去式，意为“翻找/到处找”。"},"examples":[{"en":"He fossed in the drawer for his keys.","zh":"他在抽屉里翻找钥匙。"}]}],"synonyms":["fussed (intended)","worried","fretted","made a fuss","rummaged (rare sense)","searched around"],"phonetic":"/fɑst/","extraExplanation":["“fossed”在现代英语里几乎不作为标准词使用；你在作业、邮件或正式写作中通常应改为“fussed”。","如果你是在某些地区口语/方言材料里看到“fossed”，它可能来自罕见的动词“foss”（类似 rummage / root around），但这用法很不常见。"]}
{"word":"fosses","summary":{"en":"“Fosses” means ditches/trenches (plural of “fosse”), often in historical or defensive contexts.","zh":"“fosses”指壕沟、沟渠（“fosse”的复数），常用于历史或防御工事语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “fosse”: a ditch or trench, especially one used for defense (like a moat) or as part of earthworks.","zh":"“fosse”的复数：沟渠、壕沟，尤指用于防御（类似护城河）或土方工事的一部分。"},"examples":[{"en":"The old fort was protected by deep fosses and high walls.","zh":"这座古堡靠深壕沟和高墙来防御。"},{"en":"Archaeologists found several fosses marking the edge of the settlement.","zh":"考古学家发现了几条壕沟，标示出聚落的边界。"}]}],"synonyms":["ditches","trenches","moats"],"phonetic":"/fɑs/","extraExplanation":["“fosse”常见于历史、考古与军事防御语境，指围绕城堡/要塞的壕沟或土方工事中的沟渠。词源来自法语/拉丁语，和“挖掘、沟槽”的概念相关。现代日常英语里更常用“ditch”“trench”或“moat”（护城河）。"]}
{"word":"fosset","summary":{"en":"Fosset is a rare, old/dialect word meaning a small ditch or trench.","zh":"Fosset 是一个少见的古语/方言词，指小沟渠或小壕沟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or dialect, especially Scots/English) a small ditch or trench, sometimes like a little moat or drainage channel.","zh":"（古语或方言，尤见于苏格兰英语/英式用法）小沟渠；小壕沟（有时类似小护城河或排水沟）。"},"examples":[{"en":"A narrow fosset ran along the edge of the field to carry rainwater away.","zh":"田地边缘有一条狭窄的小沟渠，用来把雨水排走。"},{"en":"In older descriptions of castles, a fosset might be mentioned outside the wall.","zh":"在较早的城堡描写里，城墙外有时会提到一道小壕沟。"}]}],"synonyms":["ditch","trench","moat","fosse","drainage ditch"],"phonetic":"/ˈfɑsɪt/","extraExplanation":["“fosset”在现代英语里很少见，更多出现在旧文献、地名/姓氏、或苏格兰等地区性用法中。","词源上与法语/中古英语里的“fosse”（壕沟、沟渠）有关，因此意思接近 ditch / trench / moat。若你是在现代日常语境里看到它，也可能是拼写误差（常见混淆词是“faucet”水龙头）。"]}
{"word":"fossette","summary":{"en":"Fossette means a small dimple (often in the cheek) and, less commonly, a small ditch.","zh":"fossette 指小酒窝（更常见），也可指小沟（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dimple (especially a cute hollow in the cheek when someone smiles); also, a small hollow or pit","zh":"（尤指微笑时脸颊上的）小酒窝；也可指小凹坑、小坑洼"},"examples":[{"en":"She has a little fossette on her left cheek when she smiles.","zh":"她笑的时候左脸颊有一个小酒窝。"},{"en":"The child’s chin had a tiny fossette.","zh":"那个孩子的下巴有一个小小的凹窝。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a small ditch or trench","zh":"（较少见）小沟、小壕沟"},"examples":[{"en":"Water collected in a fossette beside the path.","zh":"小路旁的一条小沟里积了水。"}]}],"synonyms":["dimple","hollow","pit","small ditch","trench"],"phonetic":"/foʊˈsɛt/","extraExplanation":["“fossette”是法语词（常作外来词使用），来自“fosse”（沟、坑）加上表示“小”的后缀“-ette”，所以字面感觉就是“一个小坑/小沟”。在英语语境里多用于描述“酒窝”这一种可爱的小凹陷，带有一点文艺或法式风格的色彩。"]}
{"word":"fossettes","summary":{"en":"“Fossettes” (from French) means “dimples,” especially cheek dimples that show when someone smiles.","zh":"“fossettes”（源自法语）意为“酒窝”，尤指微笑时出现在脸颊上的酒窝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dimples; small natural hollows in the cheeks or skin, especially visible when someone smiles. (French plural form, often seen in English texts.)","zh":"酒窝；皮肤（尤指脸颊）上的小凹陷，常在微笑时更明显。（法语复数形式，在英文文章中也常见。）"},"examples":[{"en":"When she smiled, her fossettes appeared on both cheeks.","zh":"她一笑，两颊的酒窝就显现出来。"},{"en":"The portrait highlights the child’s rosy cheeks and tiny fossettes.","zh":"这幅肖像突出描绘了孩子红润的脸颊和小小的酒窝。"}]}],"synonyms":["dimples","cheek dimples"],"phonetic":"/foʊˈsɛts/","extraExplanation":["“fossettes”是法语名词“fossette”的复数，意思是“小凹陷/小窝”，在描写面部特征（尤其是酒窝）时常见。英文里更常用的对应词是“dimples”。","在英文文学或时尚描写中，作者有时用法语词来营造更“精致/浪漫”的语气；但在日常英语里一般直接说“dimples”。"]}
{"word":"fossick","summary":{"en":"Fossick means to rummage or search around for something, often something small or valuable; in Australian/NZ English it can also mean hobbyist searching for gold or gems.","zh":"fossick 指翻找、搜寻（常为小而有价值的东西）；在澳大利亚/新西兰英语中也可指业余淘金或找宝石。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to search around in a place, especially among things, in a casual but careful way to find something (often something small or valuable)","zh":"（尤指在一堆东西里）随意但仔细地翻找、搜寻，通常为了找小而有价值的东西"},"examples":[{"en":"She fossicked in her bag for her keys.","zh":"她在包里翻找钥匙。"},{"en":"We fossicked through the box and found some old photos.","zh":"我们在箱子里翻找，发现了一些旧照片。"},{"en":"He spent the afternoon fossicking for coins under the sofa.","zh":"他花了一下午在沙发底下翻找硬币。"}]},{"partOfSpeech":"v.","definition":{"en":"to look for gold or gems by searching the ground or riverbeds, usually as a hobby rather than a full-time job","zh":"（多指业余）在地面或河床里淘金、找宝石"},"examples":[{"en":"Tourists fossick for opals in parts of Australia.","zh":"在澳大利亚的一些地区，游客会去淘欧泊（蛋白石）。"},{"en":"They went fossicking along the creek after the rain.","zh":"雨后他们到小溪边去淘找宝石。"}]}],"synonyms":["rummage","search","root around","scavenge","prospect (for)"],"phonetic":"/ˈfɑsɪk/","extraExplanation":["“fossick”在澳大利亚和新西兰英语中特别常见，既可指日常生活里的“翻找”，也常带有“淘金/寻宝”的文化联想（与淘金热、矿区旅游有关）。美式英语里更常说 rummage / search around；英式英语也常用 rummage。","词源上与早期殖民地俚语和“挖掘、搜寻”的用法有关；在澳洲语境里，fossicking 常被当作一种休闲活动（hobby）。"]}
{"word":"fossicked","summary":{"en":"“Fossicked” means “searched around carefully,” especially for small valuable things (like gold), and can also mean “rummaged” in everyday situations.","zh":"“fossicked”表示“仔细地到处找”，尤指找金子等小贵重物；也可指日常生活中的“翻翻找找”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense of “fossick”: to search around (often in a casual, careful way) for something, especially small valuable items like gold or gemstones.","zh":"“fossick”的过去式：四处仔细找（常指随意但认真地翻找），尤其指寻找金子、宝石等小而有价值的东西。"},"examples":[{"en":"They fossicked along the riverbank for tiny pieces of gold.","zh":"他们沿着河岸翻找细小的金粒。"},{"en":"On our trip, we fossicked for opals in the hot sun.","zh":"旅行时，我们在烈日下翻找欧泊（蛋白石）。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense of “fossick”: to rummage or poke around looking for something (not necessarily valuable).","zh":"“fossick”的过去式：翻翻找找、东摸西找（不一定是贵重物品）。"},"examples":[{"en":"She fossicked in her bag and finally found her keys.","zh":"她在包里翻找了一会儿，终于找到了钥匙。"},{"en":"I fossicked through the drawer for an old photo.","zh":"我在抽屉里翻找一张旧照片。"}]}],"synonyms":["rummaged","searched","hunted","scavenged","dug around"],"phonetic":"/ˈfɑsɪkt/","extraExplanation":["“fossick”常见于澳大利亚与新西兰英语，和淘金、寻宝（在河床、矿区找小块矿物或宝石）有很强的文化联想；在日常语境也可泛指“翻翻找找”。","词源与“fossil（化石）/ foss-（挖掘）”同源，核心意象是“在地里或杂物中挖着找”。写作时若面向国际读者，可用更通用的说法如 “rummage” 或 “search around”。"]}
{"word":"fossicker","summary":{"en":"A fossicker is someone who searches for gold, gems, or other valuables by carefully sifting through soil or rocks, especially in Australia/NZ.","zh":"fossicker 指淘金/寻宝的人，细细翻找土砂或岩石中的黄金、宝石等，常见于澳新英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who searches for something valuable (especially gold, gems, or minerals) by looking carefully through soil, sand, or rocks, often as a hobby or small-scale activity.","zh":"淘金者；寻宝者（尤指在泥土、沙砾或岩石中细细翻找黄金、宝石或矿物的人，常为爱好或小规模行为）。"},"examples":[{"en":"Tourists sometimes become fossickers and pan for gold in the river.","zh":"游客有时会当起淘金者，在河里淘洗黄金。"},{"en":"He spent weekends fossicking for opals in the Australian outback.","zh":"他周末在澳大利亚内陆翻找欧泊（蛋白石）。"}]}],"synonyms":["prospector","gold panner","treasure hunter"],"phonetic":"/ˈfɑsɪkər/","extraExplanation":["“fossicker”主要用于澳大利亚和新西兰英语，带有一点“业余淘金/业余寻宝”的地方色彩；在美式英语里更常见的近义说法是“prospector”（勘探者/淘金者）或“gold panner”（淘金淘洗者）。","词源与“fossick”（翻找、搜寻）有关，含义偏“仔细翻翻找找”。日常语境里也可引申为“在杂物里翻找东西”，但名词“fossicker”最典型还是指找矿或找宝的人。"]}
{"word":"fossicking","summary":{"en":"Fossicking means searching casually—especially for gold or gems, or more generally rummaging to find something.","zh":"Fossicking 指（多为业余）淘金/找宝石等，或泛指随意翻找、到处搜寻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of searching for gold, gemstones, or other valuable things, usually in a casual or hobby way (often by digging or sifting soil)","zh":"（多指以兴趣或业余方式）淘金、淘宝石等，在泥土或砂砾中挖掘、筛找有价值的东西"},"examples":[{"en":"Tourists go fossicking for opals in parts of Australia.","zh":"在澳大利亚的一些地区，游客会去淘欧泊（蛋白石）。"},{"en":"Fossicking is allowed here, but you may need a permit.","zh":"这里可以淘宝，但你可能需要许可证。"}]},{"partOfSpeech":"vi.","definition":{"en":"rummaging around; searching in a messy or unplanned way (present participle of “fossick”)","zh":"翻找；东找西找（动词 fossick 的现在分词，指随意、没计划地搜寻）"},"examples":[{"en":"She was fossicking in her bag for her keys.","zh":"她在包里翻找钥匙。"},{"en":"I spent the morning fossicking through old boxes in the garage.","zh":"我花了一上午在车库里的旧箱子中翻找。"}]}],"synonyms":["prospecting (informal/hobby sense)","panning (for gold)","rummaging","searching","ferreting around"],"phonetic":"/ˈfɑsɪkɪŋ/","extraExplanation":["“fossicking”在澳大利亚和新西兰英语里很常见，常与淘金热、矿区旅游和周末户外爱好相关（如淘金、找欧泊、找化石等）。","在一些地区，fossicking 有明确的法律含义：只能在指定地点、用规定工具（如小铲子、筛网）进行，并可能需要购买许可（permit）。"]}
{"word":"fossicks","summary":{"en":"“Fossick(s)” means to rummage around or search casually, often for gold or gemstones (Australian English).","zh":"“fossick(s)”指随意翻找、淘找，常用于澳大利亚英语中，尤其指找金子或宝石。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to search around (especially in an unorganized, casual way) for something such as gold, gems, or useful items; to rummage and pick through","zh":"（尤指随意地）搜寻、翻找（常指找金子、宝石或有用的东西）；翻捡"},"examples":[{"en":"They went fossicking for opals in the Australian outback.","zh":"他们去澳大利亚内陆翻找欧泊（蛋白石）。"},{"en":"I fossicked through the drawer to find my old passport.","zh":"我在抽屉里翻找我的旧护照。"}]},{"partOfSpeech":"n.","definition":{"en":"a casual search for something valuable or interesting, especially gold or gemstones","zh":"（尤指寻金、寻宝石的）随意搜寻；淘找"},"examples":[{"en":"We spent the morning on a fossick by the creek.","zh":"我们在小溪边花了一上午随意淘找。"}]}],"synonyms":["rummage","search","scavenge","prospect","poke around"],"phonetic":"/ˈfɑsɪk/","extraExplanation":["“fossick”是澳大利亚英语里很常见的词，常与淘金、找宝石（如opals）相关；在日常口语中也可泛指“翻箱倒柜式地找东西”。","你写的“fossicks”通常是第三人称单数动词（He fossicks…）或名词复数（two fossicks）。在澳式口语里也有人用“fossicks”指一些零碎小东西，但最核心含义仍是“翻找/淘找”。"]}
{"word":"fossified","summary":{"en":"Fossified means (1) turned into a fossil, or (2) so fixed that it won’t change; in language learning, it can describe a mistake that becomes permanent.","zh":"fossified 可指（1）变成化石的；也可指（2）僵化不变的；在语言学习中还可形容（3）错误“固化”、难以改正。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preserved as a fossil (e.g., bones or plants turned into stone over a very long time).","zh":"（动植物遗体等）变成化石的；被石化保存下来的。"},"examples":[{"en":"Scientists found a fossilified fish in the rock.","zh":"科学家在岩石中发现了一条鱼的化石。"},{"en":"The desert air helped keep the footprints fossilified.","zh":"干燥的沙漠空气帮助这些脚印保存成了化石。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fixed and unable (or unwilling) to change; old-fashioned in a negative way.","zh":"僵化的；因循守旧的（常含贬义）。"},"examples":[{"en":"Some schools still use fossilified teaching methods.","zh":"一些学校仍在使用僵化的教学方法。"},{"en":"He has a fossilified view of what “good jobs” look like.","zh":"他对“好工作”该是什么样子抱有僵化的看法。"}]},{"partOfSpeech":"adj.","definition":{"en":"In language learning, (of an error) becoming permanent because it is repeated and no longer corrected.","zh":"【语言学习】（错误）固化的；因反复使用而变得难以改正的。"},"examples":[{"en":"Her pronunciation error became fossilified after years of practice without feedback.","zh":"因为多年练习缺少反馈，她的发音错误逐渐固化了。"},{"en":"To prevent fossilified mistakes, get correction early and often.","zh":"为了避免错误固化，要尽早并经常获得纠正。"}]}],"synonyms":["fossilized","petrified","hardened","rigid","entrenched"],"phonetic":"/ˈfɑsəˌfaɪd/","extraExplanation":["在应用语言学里常说“fossilized errors / fossilization（错误固化/固化现象）”。美式英语里更常见的拼写是 fossilized；fossified 也能用，但更偏向“变成化石/被石化”的字面含义。","词根提示：fossil 来自拉丁语 fossilis，意为“挖出来的”。所以 fossilified 的核心画面感是“像化石一样被时间固定住”。"]}
{"word":"fossiform","summary":{"en":"A rare adjective meaning “fossa-shaped” (pit- or groove-like), mainly in anatomical descriptions; often confused with “fusiform.”","zh":"一个较罕见的形容词，意为“呈窝/凹陷/沟槽状”，多见于解剖学描述；常与“fusiform（纺锤形）”混淆。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having the shape of a fossa—a hollow, pit, or trench-like depression (especially in anatomy).","zh":"（罕见）呈“窝/凹陷/沟槽”（fossa）形的；像坑、凹陷或沟状凹陷的（尤用于解剖学）。"},"examples":[{"en":"The report described a fossiform depression on the bone surface.","zh":"报告描述了骨表面一个窝状（fossiform）的凹陷。"},{"en":"In some older texts, you may see “fossiform” used to mean “fossa-shaped.”","zh":"在一些较旧的文本里，你可能会看到 fossiform 用来表示“呈窝状/凹陷状”。"}]}],"synonyms":["fossa-like","pit-shaped","groove-like","depressed"],"phonetic":"/ˈfɑsəˌfɔrm/","extraExplanation":["“fossiform”不是常用词，现代英语里更常见的是用更明确的表达，如“fossa-like”“pit-shaped”“groove-like”。","学习提醒：很多人把 fossiform 误写成 fusiform。fusiform（纺锤形的）是常见词，常用于生物学/医学；如果你想表达“两端细、中间粗的纺锤形”，通常应写 fusiform。"]}
{"word":"fossify","summary":{"en":"Fossify means to become a fossil, or (figuratively) to become rigid and unchanging; in language learning, it can mean a mistake becomes fixed.","zh":"Fossify 指变成化石；也可比喻变得僵化不变；在语言学习中还可指错误“固化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of remains, traces, or objects) to become preserved in rock as a fossil over a very long time.","zh":"（遗骸、痕迹或物体）经过极长时间被岩石保存下来，形成化石。"},"examples":[{"en":"Over millions of years, the dinosaur bones fossilized in sedimentary rock.","zh":"经过数百万年，恐龙骨骼在沉积岩中变成了化石。"},{"en":"Footprints can fossilize if they are quickly covered by mud and later hardened.","zh":"如果脚印很快被泥覆盖并随后变硬，它们也可能形成化石。"}]},{"partOfSpeech":"v.","definition":{"en":"To become fixed, rigid, or old-fashioned; to stop changing or developing.","zh":"变得僵化、固化或过时；停止改变或发展。"},"examples":[{"en":"Some classroom rules have fossilized and no longer fit modern students’ needs.","zh":"一些课堂规则已经僵化，不再适合现代学生的需求。"},{"en":"If a company fossilizes, it may lose creative people to more flexible workplaces.","zh":"如果一家公司变得僵化，可能会把有创意的人才流失到更灵活的工作环境。"}]},{"partOfSpeech":"v.","definition":{"en":"(In language learning) to develop a persistent mistake that becomes hard to correct.","zh":"（语言学习中）错误长期固着，变得很难纠正。"},"examples":[{"en":"My pronunciation of “th” fossilized because I practiced it wrong for years.","zh":"我把“th”的发音练错了好几年，结果错误固化了。"},{"en":"Teachers try to correct fossilized grammar errors early through feedback.","zh":"老师会尽早用反馈来纠正固化的语法错误。"}]}],"synonyms":["petrify","harden","ossify","become rigid","calcify"],"phonetic":"/ˈfɑsəˌfaɪ/","extraExplanation":["“fossify”来自“fossil（化石）”。它既可用于科学语境（真正变成化石），也常用于比喻：某些观念、制度或习惯“僵化”。","语言学习里的“fossilized error（固化错误）”很常见，意思是某个错误因为长期重复而定型。常用搭配：fossilized mistakes / fossilized pronunciation / fossilized grammar.","文学与写作中常用它来批评“思想停滞”：例如“ideas fossilize”暗示缺乏更新、失去活力。"]}
{"word":"fossil","summary":{"en":"A fossil is usually the preserved remains or traces of ancient life; it can also mean something (or someone) outdated.","zh":"fossil 通常指“古生物的遗体或痕迹的保存物（化石）”，也可引申为“过时的老古董”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The preserved remains, impression, or trace of an ancient plant or animal, usually found in rock.","zh":"（通常在岩石中发现的）化石：古代动植物遗体、印痕或痕迹的保存物。"},"examples":[{"en":"Scientists found a dinosaur fossil in the desert.","zh":"科学家在沙漠里发现了一块恐龙化石。"},{"en":"This museum has fossils that are millions of years old.","zh":"这家博物馆有数百万年前的化石。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing seen as old-fashioned, outdated, or no longer useful (often humorous or critical).","zh":"（常带戏谑或批评）老古董；过时的人或事物。"},"examples":[{"en":"He still uses a flip phone—he calls it a fossil.","zh":"他还在用翻盖手机——他把它称作“老古董”。"},{"en":"Some people think the old rules are fossils from another era.","zh":"有些人觉得那些旧规矩是另一个时代留下的“化石”。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something or someone become fixed, old-fashioned, or stuck in old ways.","zh":"使僵化；使变得过时；使停留在旧方式里。"},"examples":[{"en":"Fear can fossilize a company’s thinking.","zh":"恐惧会让公司的思维僵化。"}]}],"synonyms":["remain","trace","relic","artifact","dinosaur (informal, for an outdated person)"],"phonetic":"/ˈfɑsəl/","extraExplanation":["“fossil”来自拉丁语词根，和“挖出来的东西”有关，因为早期人们常把化石理解为从地下挖出的奇特物品。","在科学语境里，fossil 不仅是“骨头”，也可以是脚印、叶子印痕、皮肤纹理等“痕迹（trace）”。","相关搭配：fossil record（化石记录）、fossil fuels（化石燃料：煤、石油、天然气）、living fossil（活化石：外形长期变化很小的物种，如鲎）。"]}
{"word":"fossil fuel","summary":{"en":"Coal, oil, and natural gas—nonrenewable fuels formed from ancient life and burned for energy.","zh":"煤、石油、天然气等由古代生物形成、用于燃烧发电的不可再生燃料。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A natural fuel such as coal, oil, or natural gas that formed over millions of years from the remains of plants and animals and is burned to produce energy.","zh":"化石燃料：如煤、石油或天然气等自然燃料，由古代动植物遗骸在数百万年间形成，燃烧后可产生能量。"},"examples":[{"en":"Coal, oil, and natural gas are all fossil fuels.","zh":"煤、石油和天然气都属于化石燃料。"},{"en":"Many countries are trying to reduce fossil fuel use to cut air pollution.","zh":"许多国家正努力减少化石燃料的使用，以降低空气污染。"},{"en":"Electric buses can help cities depend less on fossil fuels.","zh":"电动公交车可以帮助城市减少对化石燃料的依赖。"}]}],"synonyms":["nonrenewable fuel","coal","oil","natural gas"],"phonetic":"/ˈfɑsəl ˌfjuəl/","extraExplanation":["“fossil fuel”这个说法强调它来自“古老生物遗骸”（fossil=化石），形成极慢，但人类消耗很快，所以常被描述为“不可再生能源”。","在环境与公共政策语境中，它常与“greenhouse gas emissions（温室气体排放）”“renewable energy（可再生能源）”“energy transition（能源转型）”等词一起出现。"]}
{"word":"fossil-based","summary":{"en":"“Fossil-based” means made from or dependent on fossil fuels like oil, coal, or natural gas.","zh":"“fossil-based”表示由或依赖石油、煤、天然气等化石燃料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made from or relying on fossil fuels (coal, oil, or natural gas).","zh":"由化石燃料（煤、石油、天然气）制成的；依赖化石燃料的。"},"examples":[{"en":"Many countries are trying to reduce fossil-based energy use.","zh":"许多国家正努力减少对化石能源的使用。"},{"en":"This company is developing alternatives to fossil-based plastics.","zh":"这家公司正在开发化石基塑料的替代品。"}]}],"synonyms":["fossil-fuel-based","petroleum-based","oil-based"],"phonetic":"/ˈfɑsəl beɪst/","extraExplanation":["“fossil-based”常见于环保与产业语境，强调材料或能源的来源来自化石燃料体系。与之相对的常见说法有“bio-based”（生物基）与“renewable”（可再生的）。","用法上常放在名词前：fossil-based energy/fuels/plastics/chemicals。也可说“fossil-fuel-based”，意思更明确。"]}
{"word":"fossil-bearing","summary":{"en":"“Fossil-bearing” means containing fossils, especially in rocks or layers of earth.","zh":"“fossil-bearing”指“含有化石的”，常用于岩石或地层等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing fossils (the preserved remains or traces of ancient plants or animals).","zh":"含有化石的；带有化石的（指含有古代动植物遗骸或痕迹）。"},"examples":[{"en":"The team collected fossil-bearing rocks from the cliff.","zh":"团队从悬崖上采集了含化石的岩石。"},{"en":"Fossil-bearing layers can help scientists date the history of an area.","zh":"含化石的地层能帮助科学家推断一个地区的历史年代。"}]}],"synonyms":["fossiliferous","containing fossils"],"phonetic":"/ˈfɑsəl ˌbɛrɪŋ/","extraExplanation":["常见搭配有 fossil-bearing rock(s)/strata/sediment(s)（含化石的岩石/地层/沉积物）。在地质与古生物学写作里常用来说明某一层或某类岩石“产出化石”。","构词：fossil + bearing。这里 bearing 表示“带有、含有”（= containing），不是“轴承”或“忍受”的意思。","近义表达：fossiliferous（更偏学术/专业），也可说 containing fossils。"]}
{"word":"fossil-bird","summary":{"en":"A fossil-bird is an extinct bird known from fossils.","zh":"fossil-bird 指通过化石记录所知的已灭绝鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prehistoric bird known mainly from fossils; an extinct bird species discovered and studied through fossil remains","zh":"主要通过化石被发现与研究的史前鸟类；已灭绝的鸟类化石物种"},"examples":[{"en":"Scientists described a new fossil-bird from rocks that are more than 90 million years old.","zh":"科学家从超过九千万年前的岩层中描述了一种新的鸟类化石。"},{"en":"The museum display compares a fossil-bird’s wing bones with those of modern birds.","zh":"博物馆展览把鸟类化石的翅骨与现代鸟类的翅骨作对比。"},{"en":"This fossil-bird helps researchers understand how flight evolved.","zh":"这种鸟类化石帮助研究人员理解飞行是如何进化的。"}]}],"synonyms":["prehistoric bird","extinct bird","fossil bird"],"phonetic":"ˈfɑsəl bɝd","extraExplanation":["“fossil-bird”常见于古生物学、博物馆说明或科普文章中，强调“通过化石记录所知的鸟类”，而不一定指某一个特定物种。","如果特指著名的早期鸟类，文章里可能会直接用学名或常见名，比如 Archaeopteryx（始祖鸟），它常被用来讨论鸟类与恐龙的演化关系。","写作上也常见不加连字符的形式“fossil bird”；加连字符有时是为了让读者更快把它当作一个整体概念来读。"]}
{"word":"fossil-bird-related","summary":{"en":"“Fossil-bird-related” means connected with or about birds known from fossils.","zh":"“fossil-bird-related”表示“与化石鸟有关/关于化石鸟的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or about fossil birds (birds known from fossils, including extinct species).","zh":"与“化石鸟”（通过化石被认识的鸟类，包括已灭绝物种）有关的；关于化石鸟的。"},"examples":[{"en":"The museum has a small fossil-bird-related exhibit about early birds.","zh":"博物馆有一个小型的化石鸟相关展览，介绍早期鸟类。"},{"en":"She wrote a fossil-bird-related article comparing ancient feathers to modern ones.","zh":"她写了一篇化石鸟相关的文章，把古代羽毛和现代羽毛作比较。"}]}],"synonyms":["related to fossil birds","about fossil birds","fossil avian–related","paleornithological"],"phonetic":"/ˈfɑsəl ˌbɝd rɪˈleɪtɪd/","extraExplanation":["这是一个临时性的复合形容词（ad hoc compound adjective），常见于学术写作或说明文字中，用连字符把“fossil + bird + related”连在一起，强调它们作为一个整体来修饰名词。","更自然的替代表达包括：related to fossil birds / about fossil birds / fossil bird–related（有时也写作 fossil-bird–related，使用更长的破折号）。如果不是紧跟名词作定语，也可以不用连字符：This topic is related to fossil birds.（这个话题与化石鸟有关。）"]}
{"word":"fossil-derived","summary":{"en":"“Fossil-derived” means coming from fossil fuels (most common) or, less often, based on fossil evidence.","zh":"“fossil-derived”指来源于化石燃料（最常见），较少也可指基于化石证据推得的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made from, produced using, or coming from fossil fuels (such as oil, coal, or natural gas).","zh":"由化石燃料（如石油、煤、天然气）制成、生产或来源于化石燃料的。"},"examples":[{"en":"Many plastics are fossil-derived materials made from petroleum.","zh":"许多塑料是由石油制成的化石燃料来源材料。"},{"en":"The company is trying to replace fossil-derived chemicals with bio-based alternatives.","zh":"这家公司正尝试用生物基替代品取代化石燃料来源的化学品。"},{"en":"Fossil-derived carbon contributes to higher net greenhouse gas emissions.","zh":"化石燃料来源的碳会导致更高的净温室气体排放。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Obtained or inferred from fossils or fossil evidence.","zh":"（较少见）从化石或化石证据中获得或推断出来的。"},"examples":[{"en":"The museum displayed fossil-derived data about ancient climates.","zh":"博物馆展示了从化石证据推断出的远古气候数据。"},{"en":"Researchers used fossil-derived clues to reconstruct the species’ diet.","zh":"研究人员用来自化石的线索重建该物种的饮食。"}]}],"synonyms":["petroleum-based","fossil-fuel-based","oil-based","non-renewable-derived"],"phonetic":"/ˈfɑsəl dɪˈraɪvd/","extraExplanation":["“fossil-derived”常见于气候、材料科学与供应链语境，用来强调来源是化石燃料而非可再生资源（如“bio-based/plant-derived”）。","写作中常用连字符是因为它是复合形容词，放在名词前更清晰：fossil-derived plastics / fossil-derived carbon。放在名词后有时可不加连字符：the plastics are fossil derived（但正式写作仍常保留连字符）。"]}
{"word":"fossil-descriptive","summary":{"en":"“Fossil-descriptive” means focused on describing fossils (their features and classification) rather than interpreting them.","zh":"“fossil-descriptive”指以描述化石特征与分类为主，而非进行解释性分析。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of writing, analysis, or language) describing fossils—their form, features, and classification—rather than focusing on causes, processes, or interpretation.","zh":"（指写作、分析或语言）以“描述化石”为主，侧重化石的形态特征与分类，而不是解释原因、过程或深度解读。"},"examples":[{"en":"The paper is mainly fossil-descriptive, listing measurements and visible traits of the specimen.","zh":"这篇论文主要是化石描述型的，列出了标本的测量数据和可见特征。"},{"en":"Her fossil-descriptive notes include detailed drawings of the tooth and skull fragments.","zh":"她的化石描述型笔记包含对牙齿和头骨碎片的细致图示。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the descriptive study of fossils in paleontology (focused on describing and naming fossil material).","zh":"与古生物学中“化石描述研究”相关的（强调对化石材料的描述与命名）。"},"examples":[{"en":"He works in fossil-descriptive paleontology, preparing formal descriptions for new species.","zh":"他从事化石描述研究方向的古生物学工作，负责新物种的正式描述。"},{"en":"A fossil-descriptive approach is useful when a fossil is newly discovered and needs a baseline record.","zh":"当新发现化石、需要建立基础记录时，化石描述型的方法很有用。"}]}],"synonyms":["descriptive","taxonomic","morphological (in focus)","classification-focused"],"phonetic":"/ˈfɑsəl dɪˈskrɪptɪv/","extraExplanation":["这个词更常见于学术语境，尤其是古生物学写作中；日常英语里不太常用。","连字符（-）把两个形容成分连接成一个复合形容词：fossil（化石的）+ descriptive（描述性的）。在更正式或不需要强调复合关系的语境里，也可能写成 fossil descriptive。"]}
{"word":"fossil-fish","summary":{"en":"A fossil-fish is a fish preserved as a fossil, studied to learn about ancient life.","zh":"fossil-fish 指“鱼类化石”，即被保存为化石的鱼，用于研究古代生命。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fish preserved as a fossil (often seen as an imprint in rock), used to study ancient life","zh":"鱼类化石；被保存为化石的鱼（常以岩石中的印痕形式出现），用于研究古代生命"},"examples":[{"en":"The museum displayed a fossil-fish from the Jurassic period.","zh":"博物馆展出了一条侏罗纪时期的鱼类化石。"},{"en":"Scientists compared the fossil-fish to modern species to understand how fins evolved.","zh":"科学家将鱼类化石与现代物种对比，以了解鱼鳍如何演化。"}]}],"synonyms":["fossil fish","fish fossil"],"phonetic":"/ˈfɑsəl fɪʃ/","extraExplanation":["“fossil-fish”是由fossil（化石的）+ fish（鱼）组成的复合名词，常见于博物馆说明、古生物学文章或科普读物中。","英语里更常见的写法是不加连字符的“fossil fish”。加连字符多用于强调它作为一个整体名词概念，尤其在标题、标签或较老的出版物中。"]}
{"word":"fossil-forming","summary":{"en":"“Fossil-forming” means able to form fossils or helping fossils form.","zh":"“fossil-forming”指能够形成化石的，或有利于化石形成的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to become a fossil, or suitable for forming fossils (often describing an organism, material, or environment).","zh":"（常形容生物、物质或环境）能够形成化石的；有利于化石形成的。"},"examples":[{"en":"Hard shells are more fossil-forming than soft tissues.","zh":"坚硬的外壳比柔软的组织更容易形成化石。"},{"en":"Fine mud in calm water can create fossil-forming conditions.","zh":"平静水域中的细泥沉积可以创造有利于化石形成的条件。"}]}],"synonyms":["fossilizable","fossil-bearing (related)","fossil-producing"],"phonetic":"/ˈfɑsəl ˌfɔrmɪŋ/","extraExplanation":["这是一个由 fossil（化石）+ forming（形成的）组成的复合形容词，常用连字符（hyphen）连接，尤其在学术或科普写作中更常见。","在地质与古生物语境里，它多与 conditions（条件）、environment（环境）、material（物质）、organism（生物体）等搭配。化石形成通常需要快速掩埋、缺氧环境、较少扰动等条件。"]}
{"word":"fossil-fragmental","summary":{"en":"Describes rock or sediment made of or containing broken fossil pieces.","zh":"指由化石碎屑组成或含化石碎屑的岩石或沉积物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) Made of, or containing, broken pieces of fossils (fossil fragments), often used to describe sedimentary rocks such as limestone.","zh":"（地质）由化石碎屑组成或含有化石碎屑的，常用于描述沉积岩（如石灰岩）。"},"examples":[{"en":"The quarry exposes a fossil-fragmental limestone full of shell pieces.","zh":"这座采石场露出一层化石碎屑石灰岩，里面满是贝壳碎片。"},{"en":"Under the microscope, the rock looks fossil-fragmental rather than made of whole fossils.","zh":"在显微镜下，这块岩石看起来是化石碎屑状的，而不是由完整化石构成的。"}]}],"synonyms":["bioclastic","fossiliferous (related)","shell-fragmental (related)"],"phonetic":"/ˈfɑsəl fræɡˈmɛntəl/","extraExplanation":["“fossil-fragmental”多见于地质与古生物学写作，属于描述性复合形容词：fossil（化石的）+ fragmental（碎屑状的）。它强调“化石被打碎后形成的颗粒/碎片”，而不是“保存完整的化石”。","相关术语：bioclastic（生屑的，常指由生物碎屑组成的沉积物/岩石）、fossiliferous（含化石的，强调“有化石”，不一定是碎屑）、shell-fragmental（贝壳碎屑的）。"]}
{"word":"fossil-free","summary":{"en":"“Fossil-free” means not using fossil fuels, or made without fossil-based materials.","zh":"“fossil-free”指不使用化石燃料，或产品在材料/成分/工艺上不依赖化石来源原料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not using or derived from fossil fuels (like coal, oil, or natural gas).","zh":"不使用或不依赖化石燃料（如煤、石油、天然气）的。"},"examples":[{"en":"Our city wants a fossil-free bus system by 2035.","zh":"我们城市希望在2035年前实现无化石燃料的公交系统。"},{"en":"She chose a fossil-free electricity plan powered by wind and solar.","zh":"她选择了由风能和太阳能供电的无化石燃料电力方案。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made without fossil-based ingredients, materials, or processes (often used for products like plastics, clothing, or cosmetics).","zh":"在成分、材料或生产过程上不含/不使用化石来源原料的（常用于塑料、服装、化妆品等产品）。"},"examples":[{"en":"The company introduced fossil-free packaging made from plant-based materials.","zh":"这家公司推出了由植物基材料制成的无化石燃料包装。"},{"en":"I’m looking for fossil-free alternatives to traditional plastic bottles.","zh":"我在寻找传统塑料瓶的无化石燃料替代品。"}]}],"synonyms":["non-fossil","petroleum-free","oil-free"],"phonetic":"/ˈfɑsəl friː/","extraExplanation":["“fossil-free”常见于环保与气候行动语境，强调减少温室气体排放与对石油、煤炭、天然气的依赖。","与之相关但不完全等同的说法有：renewable（可再生的）、carbon-free（无碳排的，常指使用过程不排放二氧化碳）、net-zero（净零排放，允许部分排放但通过抵消等方式实现净值为零）。"]}
{"word":"fossil-illustrative","summary":{"en":"“Fossil-illustrative” describes something that explains or demonstrates an idea by using fossils as examples or visuals.","zh":"“fossil-illustrative”指通过化石作为例子或图示来说明/阐明某个观点的（多用于学术或科普语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(compound adjective) Using fossils as examples or visuals to explain something; showing or clarifying a point through fossils.","zh":"（复合形容词）用化石作为例子或图示来说明某事；通过化石来阐明某个观点。"},"examples":[{"en":"The museum created a fossil-illustrative timeline to explain how life changed over millions of years.","zh":"博物馆制作了一条“化石示例式”的时间线，用来解释生命在数百万年间如何演化。"},{"en":"In class, we used fossil-illustrative evidence to compare ancient and modern animals.","zh":"在课堂上，我们用“化石可说明性的”证据来比较古代动物和现代动物。"}]}],"synonyms":["illustrated with fossils","fossil-based","fossil-supported","fossil-informed"],"phonetic":"ˈfɑsəl ɪˈlʌstrətɪv","extraExplanation":["“fossil-illustrative”不是日常英语中的固定词汇，更常见于学术或科普写作里，作为临时组合的连字符形容词使用。它通常表示“以化石为例来说明……”。","连字符（-）常用来把两个词临时组合成一个形容词，放在名词前更清晰：a fossil-illustrative chart（一个用化石来说明的图表）。如果放在名词后，有时可以不加连字符：The chart is fossil illustrative（较少见，且读起来不如前者自然）。","更常见、更地道的替代表达包括：illustrated with fossils（用化石来配图/说明）、fossil-based examples（基于化石的例子）、fossils that illustrate…（能说明……的化石）。"]}
{"word":"fossil-insect","summary":{"en":"A fossil insect is an insect preserved as a fossil from long ago, often found in rock or amber.","zh":"fossil insect 指“昆虫化石”，即久远年代的昆虫以化石形式被保存下来，常见于岩层或琥珀中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An insect preserved as a fossil (for example, in rock or amber) from a past geological age.","zh":"昆虫化石；指被保存为化石的昆虫（例如封存在岩石或琥珀中），来自久远的地质年代。"},"examples":[{"en":"The museum displayed a fossil insect trapped in amber.","zh":"博物馆展出了一只被琥珀困住的昆虫化石。"},{"en":"Scientists studied the fossil insect to learn what the ancient climate was like.","zh":"科学家研究这种昆虫化石，以了解古代气候的样子。"},{"en":"A tiny fossil insect can reveal surprising details about evolution.","zh":"一只微小的昆虫化石也能揭示关于进化的惊人细节。"}]}],"synonyms":["insect fossil","fossilized insect","amber inclusion (if in amber)"],"phonetic":"/ˈfɑsəl ˈɪnˌsɛkt/","extraExplanation":["“fossil insect”更常见的写法是不加连字符；加连字符（fossil-insect）多见于标题、标签或作为复合形容词前置修饰时的排版选择。","在科普与博物馆语境中，最常见的保存方式之一是“amber fossil”（琥珀化石），因为树脂能把昆虫细节封存得非常清晰。"]}
{"word":"fossil-like","summary":{"en":"“Fossil-like” means resembling a fossil in appearance or texture, and figuratively it can mean old-fashioned or stuck in the past.","zh":"“fossil-like”表示外观或质感像化石；也可作比喻，指老派守旧、停留在过去。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a fossil; having the look or hardness of something preserved in rock for a very long time.","zh":"像化石的；具有化石般的外观或坚硬、被长期“封存”的感觉。"},"examples":[{"en":"The desert wind carved the bones into a fossil-like shape.","zh":"沙漠的风把骨头雕刻成了化石般的形状。"},{"en":"The shell had a fossil-like texture, rough and stone-hard.","zh":"贝壳带着化石般的质感，粗糙而像石头一样坚硬。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Old-fashioned and resistant to change; as if stuck in the past.","zh":"（比喻）老派、顽固不变的；仿佛停留在过去。"},"examples":[{"en":"Some people call the company’s policies fossil-like because they haven’t changed in decades.","zh":"有人说这家公司的政策“像化石一样”，因为几十年都没变过。"},{"en":"His fossil-like attitude toward technology made teamwork difficult.","zh":"他对科技那种“化石般”的态度让团队合作变得困难。"}]}],"synonyms":["fossilized","stone-like","petrified","ancient-looking","old-fashioned"],"phonetic":"/ˈfɑsəl laɪk/","extraExplanation":["“fossil-like”是由名词 fossil（化石）+ like（像……一样）构成的复合形容词。英文里常用 “X-like” 来表示“像X的”，比如 childlike（像孩子般的）、stone-like（像石头般的）。","比喻义里，“fossil”有时会用来形容人或制度“过时、跟不上时代”（语气通常偏负面或带点讽刺）。因此 fossil-like 用在形容观点/制度时，也可能带有批评意味。"]}
{"word":"fossil-plant","summary":{"en":"A plant preserved as a fossil, studied to understand ancient life and environments.","zh":"被保存为化石的植物，用于研究古代生命与环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant preserved as a fossil (for example, as a leaf imprint, petrified wood, or other remains) that scientists study to learn about ancient environments.","zh":"植物化石；被保存为化石的植物（如叶片印痕、硅化木等），科学家用来研究古代环境。"},"examples":[{"en":"The museum displayed a fossil plant preserved as a detailed leaf imprint.","zh":"博物馆展出了一件植物化石，以清晰的叶片印痕形式保存下来。"},{"en":"By comparing fossil plants with modern species, researchers can estimate past climates.","zh":"通过把植物化石与现代植物对比，研究人员可以推测过去的气候。"}]}],"synonyms":["plant fossil","fossilized plant","petrified plant (when specifically stone-like)"],"phonetic":"/ˈfɑsəl plænt/","extraExplanation":["“fossil-plant”常见于学术或技术写作中，也可写作“fossil plant”。连字符通常用于把它当作复合名词，强调“化石的植物”这一整体概念。","植物化石研究属于“古植物学（paleobotany）”。常见类型包括：叶片或茎的印模（impression）、压痕（compression）、以及石化木（petrified wood）。这些证据能帮助重建古生态与地质年代的植被面貌。"]}
{"word":"fossil-related","summary":{"en":"Fossil-related means connected with fossils or the study of fossils.","zh":"fossil-related 指与化石或化石研究有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with fossils (the preserved remains or traces of ancient plants or animals).","zh":"与化石有关的（指古代动植物遗骸或痕迹的保存物）。"},"examples":[{"en":"The museum has a fossil-related exhibit about dinosaurs.","zh":"这家博物馆有一个与化石有关的恐龙展览。"},{"en":"She chose a fossil-related topic for her science project.","zh":"她为科学作业选择了一个与化石有关的主题。"},{"en":"Fossil-related discoveries can help scientists understand ancient climates.","zh":"与化石有关的发现能帮助科学家了解古代气候。"}]}],"synonyms":["fossil-associated","fossil-connected","paleontological"],"phonetic":"/ˈfɑsəl rɪˈleɪtɪd/","extraExplanation":["“fossil-related”是由名词“fossil（化石）+ related（相关的）”组成的复合形容词，常用连字符连接，用来在名词前作定语（如：fossil-related research）。放在名词后时也可写作不加连字符的“fossil related”（如：The research is fossil related）。"]}
{"word":"fossil-rich","summary":{"en":"Fossil-rich describes rocks or places that contain many fossils.","zh":"fossil-rich 用来形容岩层或地点“化石很多、化石丰富”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing many fossils; having a lot of fossil remains in it (often said of rock layers, sediments, or places).","zh":"化石丰富的；含有大量化石的（常用于描述岩层、沉积物或某个地区）。"},"examples":[{"en":"This fossil-rich limestone layer helps scientists date the ancient sea floor.","zh":"这层化石丰富的石灰岩帮助科学家为古老的海底地层定年。"},{"en":"The desert is fossil-rich, so digging is carefully controlled to protect the site.","zh":"这片沙漠化石丰富，因此挖掘会被严格管理以保护遗址。"},{"en":"They collected samples from a fossil-rich bed of shale.","zh":"他们从一处化石丰富的页岩层采集了样本。"}]}],"synonyms":["fossiliferous","fossil-laden","fossil-bearing","rich in fossils"],"phonetic":"/ˈfɑsəl rɪtʃ/","extraExplanation":["“fossil-rich”是由名词+形容词构成的复合形容词，常用连字符（hyphen）连接，特别是在名词前作定语时：a fossil-rich area。放在系动词后作表语时也可见无连字符的写法，但学术写作里通常仍保留连字符以保持清晰。"]}
{"word":"fossil-wood","summary":{"en":"Fossil-wood is ancient wood preserved as a fossil, often petrified into stone.","zh":"fossil-wood 指被保存成化石的古老木材，常常会石化成“石头木”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wood that has been preserved as a fossil, often turned into stone over a very long time (petrified wood).","zh":"木材的化石；经过极长时间保存下来、常常矿化成石头的木头（常称“硅化木/石化木”）。"},"examples":[{"en":"The museum has a display of fossil-wood from ancient forests.","zh":"博物馆展出了来自远古森林的木化石。"},{"en":"In some deserts, you can find fossil-wood scattered on the ground.","zh":"在一些沙漠里，你会看到地面上散落着木化石。"},{"en":"Please don’t take fossil-wood from the park; it’s protected.","zh":"请不要从公园带走木化石；这是受保护的。"}]}],"synonyms":["petrified wood","fossil wood"],"phonetic":"/ˈfɑsəl wʊd/","extraExplanation":["“fossil-wood”在日常英语里更常写作 petrified wood（石化木/硅化木）。严格说来，petrified wood 指木材被矿物（常见是二氧化硅）替代而“变成石头”；而 fossil wood 有时也可更宽泛地指被埋藏保存下来的古木材料。","拼写上可见 fossil wood（不加连字符）或 fossil-wood（加连字符）；加连字符多见于较旧的写法或作为复合定语时。"]}
{"word":"fossilage","summary":{"en":"Fossilage means fossil remains or a collection/layer of fossils, especially in geology or paleontology.","zh":"Fossilage 指化石遗骸或化石集合/化石层，多用于地质学或古生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fossil material, fossil remains, or a collection/layer of fossils found in rock or sediment.","zh":"化石物质；化石遗骸；（岩层或沉积物中的）化石集合/化石层。"},"examples":[{"en":"The cliff face contains rich fossilage from the Jurassic period.","zh":"这处悬崖岩壁含有丰富的侏罗纪化石群。"},{"en":"Researchers compared the fossilage in different layers to understand how the environment changed.","zh":"研究人员对比不同地层中的化石集合，以了解环境如何变化。"}]}],"synonyms":["fossils","fossil remains","fossil assemblage","fossil deposit"],"phonetic":"/ˈfɑsəlɪdʒ/","extraExplanation":["“fossilage”在现代英语中相对少见，更常见的表达是“fossils”（化石，复数）或“fossil assemblage”（化石群/化石组合）。","不要把“fossilage”（化石集合/化石物质）和“fossilization”（成化石的过程）混淆：前者偏“结果/产物”，后者偏“过程”。"]}
{"word":"fossilated","summary":{"en":"“Fossilated” is a rare form meaning “fossilized,” used for things preserved as fossils or (figuratively) ideas that are rigid and old-fashioned.","zh":"“fossilated”是较少见的形式，意思基本同“fossilized”：可指“已成化石的”，也可比喻“观念或制度僵化守旧的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Turned into a fossil, or preserved in rock over a very long time (a rare variant of the more common word “fossilized”).","zh":"变成化石的；（经极长时间）被岩石保存下来的（较少用，多用 fossilized）。"},"examples":[{"en":"Scientists found fossilated shells in the limestone.","zh":"科学家在石灰岩中发现了已成化石的贝壳。"},{"en":"The museum displays fossilated bones from ancient animals.","zh":"博物馆展出了古代动物的化石骨骼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fixed and unable (or unwilling) to change; old-fashioned in thinking (less common than “fossilized” in this figurative sense).","zh":"僵化的；因循守旧的（比喻义中也较少用，多用 fossilized）。"},"examples":[{"en":"Some rules feel fossilated and don’t fit modern life.","zh":"有些规定显得僵化，已经不适应现代生活。"},{"en":"His fossilated opinions made teamwork difficult.","zh":"他那些僵化的观点让团队合作变得困难。"}]}],"synonyms":["fossilized","petrified","preserved","rigid","old-fashioned"],"phonetic":"/ˈfɑsəˌleɪtɪd/","extraExplanation":["“Fossilated”在现代英语里很少见，通常会用“fossilized”。如果你是在写作或考试中使用，建议优先选“fossilized”，更自然、更标准。","比喻用法（形容观念、制度“僵化”）在英语里很常见，但同样更常用“fossilized traditions/ideas”。"]}
{"word":"fossilation","summary":{"en":"Fossilization is the process of becoming a fossil; figuratively, it can mean becoming rigid or unable to change.","zh":"Fossilization 指“形成化石的过程”；比喻用法可指“变得僵化、难以改变”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(More common spelling: fossilization) The process by which the remains or traces of plants and animals become preserved as fossils over a long time, usually in rock.","zh":"（更常见拼写：fossilization）动植物遗骸或痕迹经过漫长时间被保存下来并形成化石的过程，通常发生在岩石中。"},"examples":[{"en":"Fossilization can happen when an animal is quickly buried by mud or sand.","zh":"当动物迅速被泥沙掩埋时，就可能发生化石形成。"},{"en":"The museum show explains how fossilization preserves bones and footprints.","zh":"博物馆展览解释了化石形成如何保存骨骼和脚印。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) The process of becoming rigid, old-fashioned, or unable to change.","zh":"（比喻）变得僵化、守旧或难以改变的过程。"},"examples":[{"en":"He worried that fossilization of the rules would stop the team from improving.","zh":"他担心规则的僵化会阻碍团队进步。"},{"en":"Languages change constantly; fossilization can happen when learners repeat the same mistakes for years.","zh":"语言不断变化；当学习者多年重复同样的错误时，就可能出现“固化”（僵化）。"}]}],"synonyms":["preservation","petrification","calcification","rigidification","ossification"],"phonetic":"/ˌfɑsəlɪˈzeɪʃən/","extraExplanation":["你输入的 **fossilation** 不太常见；标准拼写通常是 **fossilization**（美式）或 **fossilisation**（英式）。","词根提示：**fossil**（化石）+ **-ize/-ise**（使……成为）+ **-ation**（过程/结果），所以整体意思就是“形成化石的过程/使……僵化的过程”。"]}
{"word":"fossildom","summary":{"en":"“Fossildom” is a rare noun meaning the realm/community of fossils or (less commonly) the state of being fossilized.","zh":"“fossildom”是个较少见的名词，指与化石相关的领域/圈子；较少见时也可指“成为化石的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the collective world, realm, or community connected with fossils (fossils, fossil study, or fossil enthusiasts)","zh":"与化石相关的整体领域/圈子（化石本身、化石研究，或化石爱好者群体）"},"examples":[{"en":"In fossildom, small discoveries can change big ideas about ancient life.","zh":"在“化石圈/化石领域”里，小发现也可能改变我们对远古生命的大认识。"},{"en":"She became well known in fossildom after describing a new species.","zh":"她在描述了一种新物种之后，在化石领域里变得很有名。"}]},{"partOfSpeech":"n.","definition":{"en":"the state or condition of being fossilized; “fossil-ness” (rare)","zh":"成为化石的状态；“化石化/化石性”（较少见）"},"examples":[{"en":"The essay explores the slow path into fossildom—how bone becomes stone over time.","zh":"这篇文章探讨了走向“化石状态”的缓慢过程——骨头如何在时间中变成石头。"}]}],"synonyms":["the world of fossils","paleontology","fossil community","fossil realm"],"phonetic":"/ˈfɑsəlˌdəm/","extraExplanation":["“fossildom”比较少见，更常见的是“the world of fossils / paleontology”。它由“fossil（化石）+ -dom（……的领域/状态）”构成，类似于“kingdom（王国）”“stardom（明星地位）”。在写作中用它会带一点俏皮或文学化的语气。"]}
{"word":"fossiled","summary":{"en":"“Fossiled” is a rare spelling meaning fossilized (turned into a fossil) or figuratively rigid/outdated.","zh":"“fossiled”是较少见的拼写，意思相当于 fossilized（化石化的），也可比喻“僵化、过时”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon spelling) turned into a fossil; preserved in rock as a fossil.","zh":"（不常见拼写）成了化石的；以化石形式被岩石保存的。"},"examples":[{"en":"Scientists found fossiled fish bones in the limestone.","zh":"科学家在石灰岩中发现了鱼骨化石。"},{"en":"The fossiled leaf shows tiny veins clearly.","zh":"这片叶子的化石清楚地显示出细小的叶脉。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) old-fashioned and unable (or unwilling) to change; rigid and outdated.","zh":"（比喻）陈旧僵化的；不愿改变的；过时的。"},"examples":[{"en":"Some people think the school’s rules are fossiled and need an update.","zh":"有些人认为学校的规定已经僵化过时，需要更新。"},{"en":"His ideas seemed fossiled in the past.","zh":"他的想法似乎停留在过去、难以改变。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of fossil (rare); to preserve as a fossil or make something seem fixed and outdated.","zh":"fossil 的过去式/过去分词（罕见）；使成化石；使固定僵化、显得过时。"},"examples":[{"en":"Over time, the remains fossiled into stone.","zh":"随着时间推移，遗骸逐渐石化成岩。"},{"en":"The habit fossiled after years of repetition.","zh":"这个习惯经过多年重复，变得根深蒂固、难以改变。"}]}],"synonyms":["fossilized","petrified","preserved","rigid","outdated"],"phonetic":"/ˈfɑsəld/","extraExplanation":["“fossiled”在现代英语里很少见；更常见、更标准的拼写是 **fossilized**（美式）或 **fossilised**（英式）。写作时建议用 fossilized。","在科学语境里通常说“fossilized remains/bones/leaf（化石化的遗骸/骨骼/叶子）”；比喻用法常指“观点、制度、习惯变得僵化”。"]}
{"word":"fossiliferous","summary":{"en":"Fossiliferous means “containing fossils,” especially used for rocks or sediment layers.","zh":"fossiliferous 表示“含有化石的”，尤用于描述岩石或沉积地层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing fossils (preserved remains or traces of ancient organisms), often used to describe rocks or sediment layers.","zh":"含化石的；多化石的（常用来形容岩石或沉积层中含有化石）。"},"examples":[{"en":"The scientists collected fossiliferous limestone from the cliff.","zh":"科学家从悬崖上采集了含化石的石灰岩。"},{"en":"This fossiliferous layer helps date the surrounding rocks.","zh":"这一含化石的地层有助于判定周围岩石的年代。"}]}],"synonyms":["fossil-bearing","fossil-rich"],"phonetic":"/ˌfɑsəˈlɪfərəs/","extraExplanation":["词源：fossiliferous = fossil（化石）+ -ferous（“携带/含有”的后缀，来自拉丁语 ferre “携带”）。因此字面意思就是“带着化石的”。","使用场景：多见于地质学、古生物学写作与科普文章中，属于较正式、学术的形容词。日常口语中更常说 “rocks with fossils / fossil-rich rocks”（有化石的岩石/化石丰富的岩石）。","常见搭配：fossiliferous limestone（含化石石灰岩）、fossiliferous shale（含化石页岩）、fossiliferous strata/layers（含化石地层/层位）。"]}
{"word":"fossilification","summary":{"en":"Fossilification means the process of becoming a fossil.","zh":"Fossilification 指“形成化石的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process by which the remains or traces of an organism become preserved as a fossil over a long time (for example, by mineral replacement, compression, or being trapped in resin).","zh":"（生物遗骸或痕迹）经过很长时间被保存并形成化石的过程（如矿物置换、压印/压缩，或被树脂包裹等）。"},"examples":[{"en":"Fossilification usually requires quick burial so the body is protected from decay.","zh":"化石化通常需要迅速掩埋，这样遗体才能免于腐烂。"},{"en":"Different environments—like river mud or volcanic ash—can lead to different kinds of fossilification.","zh":"不同环境（如河泥或火山灰）会导致不同类型的化石化。"},{"en":"The fossilification of soft tissues is rare because they break down easily.","zh":"软组织的化石化很罕见，因为它们很容易分解。"}]}],"synonyms":["fossilization","petrification (more general/figurative)"],"phonetic":"/ˌfɑsələfəˈkeɪʃən/","extraExplanation":["“fossilification”常用于古生物学与地质学写作，属于偏学术的名词。日常英语里更常见的说法是“fossilization”。两者意思基本相同。","常见的化石化方式包括：矿化/矿物置换（permineralization / replacement）、压印/碳化（compression / carbonization）、模铸（molds and casts）、以及被琥珀包裹（amber preservation）。不同方式会影响化石能保留多少细节。"]}
{"word":"fossilify","summary":{"en":"Fossilify means to become a fossil or to preserve something in a fossil-like, lasting way; figuratively, it can mean to become rigid or outdated.","zh":"Fossilify 指（某物）化石化或把某物以类似化石的方式长期保存；比喻义可指变得僵化、过时。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to turn (something) into a fossil, or to become a fossil over a long period of time","zh":"使（某物）变成化石；（某物）逐渐形成化石"},"examples":[{"en":"Over millions of years, the bones fossilify in sediment.","zh":"经过数百万年，骨骼在沉积物中逐渐化石化。"},{"en":"Minerals can replace organic material as the remains fossilify.","zh":"遗骸在化石化时，矿物质可能会替代有机物。"}]},{"partOfSpeech":"vt.","definition":{"en":"to preserve (a shape, trace, or evidence) in a lasting, fossil-like way","zh":"以类似化石的方式把（形状、痕迹或证据）永久保存下来"},"examples":[{"en":"The volcanic ash fossilified footprints from an ancient walk.","zh":"火山灰将远古行走留下的脚印“化石化”并保存了下来。"},{"en":"A sudden flood can fossilify delicate details in the rock record.","zh":"突发洪水可能在岩石记录中“化石化”并保存细微的细节。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to make someone or something become rigid, outdated, or stuck in old ways; to become that way","zh":"（比喻）使某人/某事变得僵化、过时、固守旧法；变得如此"},"examples":[{"en":"If a company refuses to change, its culture can fossilify.","zh":"如果公司拒绝改变，它的文化可能会变得僵化。"},{"en":"He worried that routine would fossilify his creativity.","zh":"他担心日常规律会让他的创造力僵化。"}]}],"synonyms":["petrify","mineralize","preserve","entomb","ossify (figurative)"],"phonetic":"/ˈfɑsəˌlaɪˌfaɪ/","extraExplanation":["“fossilify”由“fossil（化石）+ -ify（使……化）”构成，常见于地质/古生物语境；比喻用法表示“观念或制度变得僵化”。拼写上是 fossilify（双 s），不要写成 *fossilfy*。"]}
{"word":"fossilis","summary":{"en":"“Fossil” most commonly means preserved ancient remains; informally it can mean something very old-fashioned. Related verb: “fossilize.”","zh":"fossil 最常指“化石”，也可非正式表示“老古董/过时的人或事”。相关动词是 fossilize（僵化、固化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fossil: the preserved remains, imprint, or trace of an ancient plant or animal (often found in rock).","zh":"化石：古代动植物遗骸、印痕或痕迹的保存形态（常见于岩石中）。"},"examples":[{"en":"Scientists found a dinosaur fossil in the desert.","zh":"科学家在沙漠里发现了一块恐龙化石。"},{"en":"This museum has fossils from millions of years ago.","zh":"这家博物馆里有数百万年前的化石。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing seen as very old-fashioned or out of date (informal).","zh":"（非正式）老古董；过时的人或事物。"},"examples":[{"en":"He still uses a flip phone—he calls himself a fossil.","zh":"他还在用翻盖手机——他自嘲自己是个老古董。"},{"en":"That rule is a fossil from another era.","zh":"那条规定是另一个时代留下的“化石”（早该淘汰）。"}]},{"partOfSpeech":"v.","definition":{"en":"To preserve or become fixed in an old form; to become outdated and resistant to change.","zh":"使（或变得）僵化、固化成旧形式；变得过时、不易改变。"},"examples":[{"en":"Over time, an organization’s habits can fossilize.","zh":"随着时间推移，一个组织的习惯可能会僵化。"},{"en":"Don’t fossilize your skills—keep learning.","zh":"别让你的技能僵化——要持续学习。"}]}],"synonyms":["relic","remains","artifact","old-timer","dinosaur (informal)"],"phonetic":"/ˈfɑsəl/","extraExplanation":["“fossilis”本身更像拉丁语形式，意思接近“挖出来的”（与拉丁语动词 fodere“挖”有关）。现代英语里常用的是 fossil（名词/形容词）以及 fossilize（动词）。如果你是在生物学/地质学语境里看到 fossilis，它可能是学名或拉丁文描述中的词形。"]}
{"word":"fossilisable","summary":{"en":"“Fossilisable” means “able to become a fossil.”","zh":"“fossilisable”意思是“可形成化石的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to become a fossil (preserved in rock over a very long time).","zh":"可形成化石的；能够在漫长时间中被岩石保存下来的。"},"examples":[{"en":"Hard parts like shells and bones are more easily fossilisable than soft tissue.","zh":"像贝壳和骨骼这类坚硬部分比软组织更容易形成化石。"},{"en":"The lake’s muddy bottom created conditions that made small fish more fossilisable.","zh":"湖底的泥质沉积创造了条件，使小鱼更可能形成化石。"}]}],"synonyms":["fossilizable","capable of fossilization"],"phonetic":"/ˈfɑsəˌlaɪzəbəl/","extraExplanation":["“fossilisable”是英式拼写；美式拼写常见为“fossilizable”。","在古生物学里，能否“fossilisable”常取决于：是否有坚硬结构（骨、壳、牙）、是否迅速被沉积物掩埋、环境是否缺氧以减缓腐烂，以及后续是否发生矿化等过程。","词形来源：fossil（化石）+ -ise/-ize（使……化石化）+ -able（可……的）。日常英语里不算常用，多见于科学写作。"]}
{"word":"fossilisation","summary":{"en":"Fossilisation means either the formation of fossils over time or (in language learning) the fixing of persistent errors that become hard to change.","zh":"fossilisation 指化石形成的过程；也可指语言学习中某些错误长期固化、难以改变的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process by which a living organism (or its traces) becomes preserved as a fossil over a long period of time.","zh":"（生物或其痕迹）在漫长时间里被保存并形成化石的过程。"},"examples":[{"en":"Fossilisation usually requires quick burial in mud or sand.","zh":"化石形成通常需要生物迅速被泥或沙掩埋。"},{"en":"The fossilisation of bones is more common than the fossilisation of soft tissues.","zh":"骨骼形成化石比软组织更常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(In language learning) The process where a learner’s incorrect language form becomes fixed and hard to change.","zh":"（语言学习中）学习者的错误用法变得固化、难以纠正的过程（语误固化）。"},"examples":[{"en":"If incorrect pronunciation is repeated for years, it can lead to fossilisation.","zh":"如果错误发音反复多年，就可能导致语误固化。"},{"en":"Regular feedback helps prevent fossilisation in second-language learning.","zh":"定期反馈有助于避免二语学习中的语误固化。"}]}],"synonyms":["fossilization","preservation (geology sense)","error fossilization (language learning)"],"phonetic":"/ˌfɑsəlaɪˈzeɪʃən/","extraExplanation":["英式拼写常见为 fossilisation；美式拼写通常为 fossilization。两者意思相同，只是拼写习惯不同。","语言学里常说 “fossilisation of errors”（错误固化）。意思不是你“学不会”，而是某些错误因为长期不被注意或缺少纠正与输入，变得自动化；通过刻意练习、针对性纠音/纠错、增加高质量输入，通常可以改善。"]}
{"word":"fossilise","summary":{"en":"Fossilise means to become or make something become a fossil, and figuratively to become rigid or outdated.","zh":"fossilise 指形成/使形成化石；也可比喻变得僵化、过时。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to become a fossil (or to be preserved as a fossil) over a very long time","zh":"（动植物遗骸等）经过漫长时间形成化石；被保存为化石"},"examples":[{"en":"Over millions of years, the bones fossilised in the sediment.","zh":"经过数百万年，这些骨骼在沉积物中形成了化石。"},{"en":"Some plants fossilise more easily than others.","zh":"有些植物比其他植物更容易形成化石。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to become a fossil; to preserve it as a fossil","zh":"使……形成化石；将……保存为化石"},"examples":[{"en":"Minerals can slowly fossilise animal remains.","zh":"矿物质会慢慢使动物遗骸形成化石。"},{"en":"The ash layer helped fossilise the ancient forest.","zh":"火山灰层帮助这片古老森林形成了化石。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to become fixed, rigid, or outdated and resistant to change","zh":"（比喻）变得僵化、固定不变；变得过时且抗拒改变"},"examples":[{"en":"Without new ideas, the company’s culture can fossilise.","zh":"如果没有新想法，这家公司的文化可能会变得僵化。"},{"en":"He worried that his skills had fossilised after years in the same job.","zh":"在同一份工作做了多年后，他担心自己的技能已经固化、跟不上变化了。"}]}],"synonyms":["fossilize","petrify","preserve","harden","ossify"],"phonetic":"/ˈfɑsəˌlaɪz/","extraExplanation":["英式拼写是 fossilise；美式常写作 fossilize，但读音与用法基本相同。","词根 fossil- 来自“化石”，-ise/-ize 表示“使成为/变成”。在日常英语中，比喻义（观念、制度“僵化”）也很常见。"]}
{"word":"fossilised","summary":{"en":"“Fossilised” means either preserved as a fossil, or (figuratively) outdated and resistant to change.","zh":"“fossilised”既可指“形成化石的”，也可比喻“陈旧僵化、抗拒改变的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Turned into a fossil over a very long time; preserved in rock.","zh":"经历漫长时间形成化石的；被保存在岩石中的。"},"examples":[{"en":"Scientists found fossilised bones in the desert.","zh":"科学家在沙漠里发现了已化石化的骨头。"},{"en":"The museum displays fossilised wood from millions of years ago.","zh":"博物馆展出了数百万年前的木化石。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Very old-fashioned and unwilling to change; rigid and stuck in the past.","zh":"（比喻）陈旧僵化的；固守过去、不愿改变的。"},"examples":[{"en":"Some people think the rules are fossilised and need updating.","zh":"有些人认为这些规定已经僵化，需要更新。"},{"en":"He has fossilised ideas about what a “proper” job should be.","zh":"他对“体面工作”该是什么样有些陈腐僵化的想法。"}]}],"synonyms":["fossilized","petrified","preserved","outdated","old-fashioned","rigid"],"phonetic":"/ˈfɑsəˌlaɪzd/","extraExplanation":["“fossilised”是英式拼写；美式更常见“fossilized”。两者意思相同。","比喻义在新闻评论、职场或社会话题中常见，用来批评制度或观念“过时、难以改变”。"]}
{"word":"fossilising","summary":{"en":"Fossilising means becoming a fossil, or (figuratively) becoming fixed and hard to change.","zh":"fossilising 指“逐渐变成化石”，也可比喻“逐渐僵化、难以改变”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “fossilise/fossilize”) becoming preserved as a fossil; turning into a fossil over time.","zh":"（“fossilise/fossilize”的现在分词）逐渐变成化石；在时间作用下被保存为化石。"},"examples":[{"en":"The mud helped with fossilising the animal’s bones.","zh":"泥浆有助于动物骨骼的化石形成。"},{"en":"Scientists study fossilising conditions to understand ancient environments.","zh":"科学家研究化石形成的条件，以了解远古环境。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) becoming fixed and unchanging; turning into a rigid habit or pattern.","zh":"（比喻）变得僵化、不再改变；固化成习惯或模式。"},"examples":[{"en":"Without feedback, the team’s mistakes kept fossilising into routine.","zh":"没有反馈，团队的错误不断固化成惯例。"},{"en":"He worried that his study method was fossilising and no longer effective.","zh":"他担心自己的学习方法正在僵化，已经不再有效。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) causing something to become fossil-like or fixed; related to the process of fossil formation.","zh":"（形容词）使……化石化/固化的；与化石形成过程有关的。"},"examples":[{"en":"Mineral-rich water can have a fossilising effect on organic material.","zh":"富含矿物质的水可能对有机物产生促成化石形成的作用。"},{"en":"They examined fossilising sediments from the ancient lakebed.","zh":"他们研究了来自古湖床、能促成化石形成的沉积物。"}]}],"synonyms":["fossilizing","preserving","petrifying","hardening","becoming fixed","solidifying"],"phonetic":"/ˈfɑsəlaɪzɪŋ/","extraExplanation":["“fossilising”多见于英式拼写（fossilise）；美式更常写作“fossilizing”（fossilize）。意思相同，只是拼写差异。","语言学习里也会说“a fossilized expression/grammar mistake（僵化表达/固化错误）”，指某种说法或错误因为反复使用而变得很难改掉。"]}
{"word":"fossilism","summary":{"en":"Fossilism means becoming fixed and outdated—like ideas or language that stop changing; in linguistics it can describe errors that become permanent habits.","zh":"Fossilism 指变得僵化守旧、停滞不前；在语言学中也可指错误“化石化”，变成难以改正的固定习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or practice of becoming outdated and fixed in old ways; resistance to change (often in ideas, language, or institutions).","zh":"因循守旧、僵化；观念、语言或制度停留在旧模式中而不愿改变。"},"examples":[{"en":"Some critics say the school system suffers from fossilism and needs modern teaching methods.","zh":"一些评论者说学校制度因循守旧，需要更现代的教学方法。"},{"en":"In language learning, fossilism can happen when mistakes become permanent habits.","zh":"在语言学习中，“化石化”可能发生：错误变成固定习惯，难以改正。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/linguistics, more specific) The process by which something becomes fossilized—fixed, preserved, and hard to change.","zh":"（生物/语言学，更具体）“化石化”的过程：变得固定、被保留且难以改变。"},"examples":[{"en":"The fossilism of certain grammatical patterns is common in second-language acquisition.","zh":"在二语习得中，某些语法模式的化石化很常见。"},{"en":"Over time, repeated exposure led to the fossilism of the same pronunciation errors.","zh":"随着时间推移，反复接触导致同样的发音错误被“化石化”。"}]}],"synonyms":["rigidity","stagnation","ossification","conservatism","fossilization"],"phonetic":"/ˈfɑsəˌlɪzəm/","extraExplanation":["“fossilism”在日常英语里比较少见，更常见的相关词是“fossilization（化石化）”“fossilized（僵化的/定型的）”。在二语习得领域，“fossilism”有时被用来指学习者错误长期定型、难以纠正的现象。","词根提示：fossil（化石）+ -ism（主义/倾向/现象）。因此它常带有“变成像化石一样固定”的比喻色彩，语气多偏批评或学术描述。"]}
{"word":"fossilist","summary":{"en":"A fossilist is mainly someone who studies or collects fossils; rarely, it can mean a person seen as old-fashioned.","zh":"fossilist主要指研究或收集化石的人；少见情况下也可指被认为思想守旧的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who collects, studies, or is an expert on fossils; a fossil collector or paleontology enthusiast.","zh":"研究、收集或精通化石的人；化石收藏者或古生物学爱好者。"},"examples":[{"en":"The fossilist showed the students a trilobite found near the river.","zh":"那位化石研究者给学生们展示了一块在河边发现的三叶虫化石。"},{"en":"As a young fossilist, she spent weekends searching for shells in ancient rock layers.","zh":"她年轻时是个化石爱好者，周末常去古老的岩层里寻找贝壳化石。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person whose ideas or tastes are old-fashioned; someone seen as stuck in the past.","zh":"（罕见）思想或品味过时的人；被认为停留在过去的人。"},"examples":[{"en":"Some critics called him a fossilist because he refused to use modern design tools.","zh":"一些评论家称他为“守旧派”，因为他拒绝使用现代设计工具。"}]}],"synonyms":["paleontologist","fossil collector","fossil hunter","traditionalist (rare sense)"],"phonetic":"/ˈfɑsəlɪst/","extraExplanation":["“fossilist”由“fossil（化石）+ -ist（从事者/爱好者）”构成，结构上类似“artist（艺术家）”“scientist（科学家）”。在现代英语里更常见的说法是“paleontologist（古生物学家）”或“fossil collector（化石收藏者）”。第二个“守旧的人”的用法带有贬义色彩，且不常见，日常表达通常会用“old-fashioned”或“stuck in the past”。"]}
{"word":"fossilizable","summary":{"en":"Fossilizable means “able to become a fossil” or, in language learning, “likely to become a fixed, hard-to-correct error.”","zh":"fossilizable 指“可形成化石的”，也可用于语言学习，指“容易化石化、变得难以纠正的错误/习惯”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to become a fossil; likely to be preserved as a fossil over a long time.","zh":"可形成化石的；可能在很长时间后被保存为化石的。"},"examples":[{"en":"Hard shells and bones are more fossilizable than soft tissues.","zh":"坚硬的贝壳和骨骼比软组织更容易形成化石。"},{"en":"Scientists study which environments make organisms more fossilizable.","zh":"科学家研究哪些环境会让生物更容易形成化石。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Language learning) Likely to become “fossilized,” meaning an incorrect habit that becomes fixed and hard to change.","zh":"（语言学习）容易“化石化”的：指错误习惯变得固定、很难改正。"},"examples":[{"en":"Without feedback, small pronunciation errors can be fossilizable.","zh":"如果缺少反馈，小的发音错误可能会变得容易化石化。"},{"en":"He worried that his fossilizable grammar mistakes would stay forever.","zh":"他担心自己那些容易化石化的语法错误会一直存在。"}]}],"synonyms":["fossil-forming","fossilizing (language-learning sense)","preservable"],"phonetic":"/ˈfɑsəˌlaɪzəbəl/","extraExplanation":["在古生物学里，fossilizable 常与 “fossilization（化石形成过程）”“preservation（保存）”一起出现，强调“是否容易留下可研究的痕迹”。影响因素包括：是否有硬组织（骨、壳）、是否迅速被沉积物掩埋、是否缺氧（减缓腐烂）等。","在二语习得（SLA）中，“fossilization（语言化石化）”是常见概念：学习者的某些错误（发音、语法、用词）长期重复后变得稳定。此时说 fossilizable，强调“这种错误具有很强的固化倾向”，需要有针对性的纠正、更多输入与输出练习来打破。"]}
{"word":"fossilization","summary":{"en":"Fossilization is the process of becoming a fossil; in language learning, it also means errors becoming fixed and hard to correct.","zh":"fossilization 指变成化石的过程；在语言学习中也指错误逐渐固化、难以纠正。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process by which something becomes a fossil or is preserved as a fossil.","zh":"（生物/遗体等）变成化石、被保存为化石的过程。"},"examples":[{"en":"Fossilization usually happens when an organism is quickly buried by mud or sand.","zh":"化石化通常发生在生物迅速被泥沙掩埋的时候。"},{"en":"The fossilization of plants can preserve fine details like leaf veins.","zh":"植物的化石化可能保存叶脉等精细细节。"}]},{"partOfSpeech":"n.","definition":{"en":"In language learning, the tendency for certain mistakes or non-native patterns to become fixed and hard to change.","zh":"（语言学习）某些错误或非母语表达方式逐渐固化、变得难以纠正的现象。"},"examples":[{"en":"Pronunciation fossilization can make an accent difficult to change later.","zh":"发音的固化可能让口音在以后很难改变。"},{"en":"If you always say a phrase the wrong way without feedback, fossilization may occur.","zh":"如果你一直用错误方式说某个短语又缺少反馈，就可能出现错误固化。"},{"en":"Regular correction and practice can reduce fossilization in speaking.","zh":"规律的纠正和练习能减少口语中的固化现象。"}]}],"synonyms":["preservation","petrification","ossification","entrenchment","fixation"],"phonetic":"/ˌfɑsələˈzeɪʃən/","extraExplanation":["在二语习得（SLA）里，“fossilization（固化）”常指学习者的中介语（interlanguage）在某些点上停滞：即使继续学习或输入增加，这些错误仍反复出现。常见诱因包括：缺少及时反馈、长期只追求“能沟通就行”、对某些语音/语法差异不敏感、以及长期使用同一套表达。","学习建议：想避免或减轻语言固化，可以通过（1）录音对照母语者或标准发音，（2）让老师/伙伴指出“高频错误”，（3）刻意练习同一结构的正确版本（deliberate practice），（4）在真实交流中有意识地替换旧表达。"]}
{"word":"fossilize","summary":{"en":"“Fossilize” means to turn into a fossil (literally) or to become rigid and unable to change (figuratively).","zh":"“fossilize”既指（字面）化石化，也指（比喻）僵化、固定不变。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of plants or animals) to become preserved as a fossil, or to turn something into a fossil.","zh":"（动植物）变成化石；使……化石化。"},"examples":[{"en":"Over millions of years, the bones fossilized in the mud.","zh":"经过数百万年，这些骨头在泥中化石化了。"},{"en":"Volcanic ash can fossilize leaves by preserving their shape.","zh":"火山灰可以通过保留叶子的形状使其化石化。"}]},{"partOfSpeech":"v.","definition":{"en":"To become fixed and unchanging; to make an idea, habit, or system stay the same for too long.","zh":"（比喻）变得僵化、固定不变；使观念/习惯/制度长期不变。"},"examples":[{"en":"Their management style has fossilized and no longer fits the market.","zh":"他们的管理方式已经僵化，不再适应市场。"},{"en":"If we never question our routines, they can fossilize into bad habits.","zh":"如果我们从不反思日常习惯，它们可能会僵化成坏习惯。"}]}],"synonyms":["petrify","preserve","harden","ossify","calcify","stagnate","become rigid"],"phonetic":"/ˈfɑsəˌlaɪz/","extraExplanation":["“fossilize”源自“fossil（化石）”。它既可用于科学语境（岩层、骨骼、植物印痕等的保存过程），也常用于比喻语境，表示“思想/制度僵化”。在比喻用法中，语气通常带有批评：暗示缺乏更新与适应。","常见搭配：fossilize into + 名词（僵化成……）；become/get fossilized（变得僵化）；fossilized remains（化石遗骸）；fossilized attitudes（僵化的观念）。"]}
{"word":"fossilized","summary":{"en":"Fossilized means either literally preserved as a fossil, or figuratively fixed and hard to change (like habits, rules, or language).","zh":"fossilized既可指“化石化的（被保存为化石）”，也可引申为“僵化的、固定不变的”（如习惯、规则或语言表达）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Turned into a fossil (preserved as ancient remains in rock).","zh":"变成化石的；被石化保存的（古代遗骸保存在岩石中）。"},"examples":[{"en":"Scientists found a fossilized fish in the rock.","zh":"科学家在岩石中发现了一条鱼的化石。"},{"en":"The museum displays fossilized dinosaur bones.","zh":"博物馆展出了恐龙骨骼化石。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of language, habits, or customs) Fixed and unchanging for a long time; old-fashioned and resistant to change.","zh":"（指语言、习惯或习俗）长期固定不变的；陈旧僵化的；难以改变的。"},"examples":[{"en":"Some fossilized expressions are still used in formal writing.","zh":"一些固定化的表达仍用于正式写作。"},{"en":"The company’s fossilized rules made it hard to innovate.","zh":"公司僵化的规章制度让创新变得困难。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something become fossilized; to preserve or cause to become fixed and unchanging.","zh":"使化石化；使固定化、僵化。"},"examples":[{"en":"These traditions have fossilized over centuries.","zh":"这些传统在几个世纪中逐渐固化下来。"},{"en":"Fear can fossilize our thinking.","zh":"恐惧会让我们的思维变得僵化。"}]}],"synonyms":["petrified","preserved","fixed","rigid","entrenched"],"phonetic":"/ˈfɑsəˌlaɪzd/","extraExplanation":["在语言学习里，“fossilized”常见于术语“fossilized errors（僵化错误）”，指某些错误因为长期反复使用而“定型”，即使学到正确用法也很难改。一个常见策略是：有意识地慢速输出（说/写），针对单一错误做集中纠正与重复练习。","搭配提示：fossilized remains（化石遗骸）、fossilized bones（骨骼化石）、fossilized rule/system（僵化的规则/体系）、fossilized expression（固定表达）。"]}
{"word":"fossilizes","summary":{"en":"“Fossilizes” means “becomes a fossil,” “turns something into a fossil,” or figuratively “becomes rigid/outdated.”","zh":"“fossilizes”表示“变成化石/化石化”“使……化石化”，也可比喻“变得僵化、陈旧”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a plant, animal, or its remains) to become preserved in rock as a fossil over a very long time.","zh":"（植物、动物或其遗骸）经过漫长时间被岩石保存下来，变成化石。"},"examples":[{"en":"Sometimes a dead fish fossilizes in mud that later turns into stone.","zh":"有时死鱼会在泥中逐渐化石化，而这些泥后来会变成石头。"},{"en":"Most soft tissue decays, so only a small number of organisms fossilize.","zh":"大多数软组织会腐烂，所以只有少数生物能形成化石。"}]},{"partOfSpeech":"vt.","definition":{"en":"To preserve a plant or animal (or its traces) as a fossil; to turn something into a fossil.","zh":"把（动植物或其痕迹）保存为化石；使某物化石化。"},"examples":[{"en":"Minerals can fossilize bones by slowly replacing the original material.","zh":"矿物质可以通过缓慢替代原有物质来使骨头化石化。"},{"en":"The fine ash helped fossilize the footprints.","zh":"细腻的火山灰帮助脚印得以化石化保存。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Figurative) To become fixed, old-fashioned, or unable to change.","zh":"（比喻）变得僵化、老旧、难以改变。"},"examples":[{"en":"If a company never listens to customers, its ideas fossilize.","zh":"如果公司从不听取客户意见，它的想法就会僵化。"},{"en":"Her teaching style fossilizes when she refuses to try new methods.","zh":"当她拒绝尝试新方法时，她的教学风格就会变得陈旧僵化。"}]}],"synonyms":["petrifies","preserves","hardens","becomes rigid","ossifies"],"phonetic":"/ˈfɑsəˌlaɪzɪz/","extraExplanation":["“fossilizes”是动词“fossilize”的第三人称单数现在时（he/she/it fossilizes）。例如：“This organism fossilizes easily.”","化石形成通常需要快速掩埋、缺氧环境、以及矿物质逐步填充或替换（矿化作用）。因此“能否化石化”往往取决于环境条件，而不是只看生物本身。","比喻用法里，fossilize常带有负面语气，暗示“停滞不前、跟不上变化”。"]}
{"word":"fossilizing","summary":{"en":"Fossilizing means becoming fixed and hard to change, or (literally) turning into a fossil over time.","zh":"Fossilizing 指逐渐固定、难以改变；也可指（字面）在时间作用下形成化石。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"becoming fixed and hard to change (used especially for habits, ideas, systems, or language mistakes).","zh":"逐渐固定下来、难以改变（尤用于习惯、观念、制度或语言错误）。"},"examples":[{"en":"Without feedback, small mistakes can start fossilizing and become hard to correct.","zh":"如果缺少反馈，小错误可能会开始“固化”，变得很难纠正。"},{"en":"Some old rules are fossilizing, even though society has changed.","zh":"尽管社会已经改变，一些旧规则却在逐渐僵化。"}]},{"partOfSpeech":"v.","definition":{"en":"turning into a fossil or preserving something as a fossil over a long time (in geology/paleontology).","zh":"形成化石；使某物在漫长时间里被保存为化石（地质/古生物语境）。"},"examples":[{"en":"The mud helped in fossilizing the animal’s bones.","zh":"泥沙有助于动物骨骼的化石形成。"},{"en":"Under the right conditions, plant material can be fossilizing for millions of years.","zh":"在合适条件下，植物材料可能经历数百万年的化石形成过程。"}]}],"synonyms":["hardening","becoming entrenched","ossifying","solidifying","petrifying"],"phonetic":"/ˈfɑsəˌlaɪzɪŋ/","extraExplanation":["“fossilizing”常见的引申义来自“化石”给人的印象：一旦形成就很难再改变，所以它常用来形容观念、制度或行为变得僵化。","语言学习里常说“错误固化（fossilization）”：指某些错误因为长期重复、缺少纠正或输入不足，变成了稳定的说法习惯。搭配词常见有 fossilized errors（固化错误）、prevent fossilization（防止固化）。"]}
{"word":"fossillike","summary":{"en":"Fossillike (often written fossil-like) means “resembling a fossil,” or figuratively “very old-fashioned and rigid.”","zh":"fossillike（常写作 fossil-like）意思是“像化石的”，也可比喻“非常守旧僵化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a fossil in appearance (for example, looking like something preserved in rock).","zh":"（外观上）像化石的；看起来像被保存在岩石里的东西。"},"examples":[{"en":"The museum displayed a fossillike imprint of a leaf on stone.","zh":"博物馆展出了一块石头上叶子的化石状印痕。"},{"en":"From a distance, the coral looked fossillike under the gray light.","zh":"在灰暗的光线下，远看那珊瑚像化石一样。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Extremely old-fashioned, rigid, or stuck in the past.","zh":"（比喻）非常守旧的；僵化的；停留在过去的。"},"examples":[{"en":"Some people think his management style is fossillike.","zh":"有些人觉得他的管理方式像“化石”一样老旧僵化。"},{"en":"They criticized the company’s fossillike rules.","zh":"他们批评公司那些陈旧僵化的规章制度。"}]}],"synonyms":["fossil-like","petrified-looking","ancient-looking","old-fashioned","outdated","hidebound"],"phonetic":"/ˈfɑsəlˌlaɪk/","extraExplanation":["“fossillike”更常见的写法是带连字符的 **fossil-like**。口语和写作中两种都能见到，但正式写作里用 **fossil-like** 更清晰。","构词上是 **fossil（化石）+ -like（像……一样）**。在比喻义里，它常带轻微贬义，用来形容观念/制度“老掉牙、难改变”。"]}
{"word":"fossilogist","summary":{"en":"“Fossilogist” is a rare, nonstandard word meaning “a person who studies fossils,” usually called a “paleontologist.”","zh":"“fossilogist”是一个少见且偏不规范的词，意为“研究化石的人”，通常称为“paleontologist（古生物学家）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies fossils; a paleontologist (this word is uncommon and often treated as a nonstandard variant).","zh":"研究化石的人；古生物学家（该词不常见，常被视为不规范的变体）。"},"examples":[{"en":"The fossilogist examined the fossil teeth to identify the ancient animal.","zh":"这位“fossilogist”检查了化石牙齿，以辨认这种远古动物。"},{"en":"In most academic writing, you would say “paleontologist” instead of “fossilogist.”","zh":"在大多数学术写作中，通常用“paleontologist”而不是“fossilogist”。"}]}],"synonyms":["paleontologist","paleontology researcher","fossil expert"],"phonetic":"/ˌfɑsəˈlɑdʒɪst/","extraExplanation":["“fossilogist”在英语里很少见，很多词典不收录；更标准、最常用的说法是“paleontologist（古生物学家）”。","构词上可理解为 fossil（化石）+ -logist（……学者/研究者），但在正式场合建议改用“paleontologist”或“paleontology（古生物学）”相关表达。"]}
{"word":"fossilogy","summary":{"en":"Fossilogy is a rare word meaning the study of fossils (paleontology).","zh":"fossilogy 是一个较少用的词，意思是“研究化石”，相当于 paleontology（古生物学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The study of fossils; paleontology.","zh":"（较少用）化石学；对化石的研究；即古生物学（paleontology）。"},"examples":[{"en":"She became interested in fossilogy after finding shells in the rocks near her hometown.","zh":"她在家乡附近的岩石里发现贝壳化石后，对化石学产生了兴趣。"},{"en":"Fossilogy helps scientists understand what kinds of animals lived long ago.","zh":"化石学帮助科学家了解很久以前生活过哪些动物。"}]}],"synonyms":["paleontology","palaeontology","the study of fossils","paleobiology"],"phonetic":"/fɑˈsɑlədʒi/","extraExplanation":["“fossilogy”这个词在现代英语里不算常见；更标准、使用更广的是“paleontology”（古生物学/化石研究）或“the study of fossils”（对化石的研究）。在写作或学术场景中，通常建议用“paleontology”。"]}
{"word":"fossilological","summary":{"en":"An uncommon adjective meaning “related to the study of fossils; paleontological.”","zh":"一个较少见的形容词，意思是“与化石研究有关的；古生物学的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the study of fossils; connected with fossils or paleontology.","zh":"与化石研究有关的；与化石或古生物学相关的。"},"examples":[{"en":"The museum’s fossilological collection includes trilobites and dinosaur teeth.","zh":"博物馆的化石学藏品包括三叶虫和恐龙牙齿。"},{"en":"She wrote a fossilological note comparing shells from two rock layers.","zh":"她写了一则化石学记录，对比了两层岩石中的贝壳化石。"}]}],"synonyms":["paleontological","fossil-related","paleontic (rare)"],"phonetic":"/ˌfɑsəˌləˈlɑdʒɪkəl/","extraExplanation":["“fossilological”在现代英语中非常少见，日常与学术写作里更常用的是“paleontological（古生物学的）”或“fossil-related（与化石相关的）”。","词形上可理解为 fossil（化石）+ -logy（学科/研究）+ -ical（……的），意思相当于“关于化石研究的”。在正式场合建议优先使用更常见的“paleontological”。"]}
{"word":"fossilologist","summary":{"en":"“Fossilologist” means someone who studies fossils, but the common standard word is “paleontologist.”","zh":"“fossilologist”指研究化石的人，但标准常用说法是“paleontologist（古生物学家）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies fossils; a paleontologist (this word is rare and not commonly used in modern English).","zh":"研究化石的人；古生物学家（这个词很少见，现代英语中不常用）。"},"examples":[{"en":"The museum hired a paleontologist (sometimes jokingly called a “fossilologist”) to identify the bones.","zh":"博物馆聘请了一位古生物学家（有时会开玩笑叫“fossilologist”）来鉴定这些骨骼。"},{"en":"She dreamed of becoming a fossilologist and discovering a new dinosaur species.","zh":"她梦想成为一名“fossilologist”，并发现一种新的恐龙物种。"}]}],"synonyms":["paleontologist","fossil expert","paleobiologist"],"phonetic":"/ˌfɑːsəˈlɑːlədʒɪst/","extraExplanation":["“fossilologist”在英语里并不是标准、常见的职业名称，更多见于非正式写法、玩笑或误用。正式用语通常是“paleontologist（古生物学家）”。","词形上看，它由“fossil（化石）+ -ologist（……学者）”构成，所以意思很容易猜到，但在学术与职业语境中仍建议使用“paleontologist”。"]}
{"word":"fossilology","summary":{"en":"“Fossilology” is a rare, nonstandard word meaning the study of fossils; the usual term is “paleontology.”","zh":"“fossilology”是罕见且不太规范的说法，指研究化石；更常用、标准的词是“paleontology（古生物学）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) The study of fossils; paleontology.","zh":"（罕见、非标准用法）化石学；古生物学。"},"examples":[{"en":"In casual speech, someone might say “fossilology,” but the standard word is “paleontology.”","zh":"在随意口语中有人可能会说“fossilology”，但更标准的词是“paleontology（古生物学）”。"},{"en":"She became interested in fossilology after finding a shell fossil on the beach.","zh":"她在海滩上发现一枚贝壳化石后，对“fossilology（化石学）”产生了兴趣。"}]}],"synonyms":["paleontology","palaeontology","study of fossils","paleobiology"],"phonetic":"/ˌfɑsəˈlɑlədʒi/","extraExplanation":["“fossilology”一般不作为规范学术用语出现，多被视为把 fossil（化石）+ -ology（……学）临时拼出来的词。正式写作或课程名称中通常使用“paleontology”（古生物学）或更具体的“paleobiology”（古生物学/古生物生物学）。"]}
{"word":"fossils","summary":{"en":"Fossils are preserved remains or traces of ancient life; informally, a “fossil” can mean someone or something very old-fashioned.","zh":"Fossils 指古代生命的遗骸或痕迹（化石）；口语中也可指非常老派、过时的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The preserved remains, impressions, or traces of ancient plants or animals, usually found in rock.","zh":"（通常在岩石中发现的）古代动植物的遗骸、印痕或痕迹（即化石）。"},"examples":[{"en":"Scientists found dinosaur fossils in the desert.","zh":"科学家在沙漠里发现了恐龙化石。"},{"en":"This museum has fossils that are millions of years old.","zh":"这家博物馆有数百万年前的化石。"},{"en":"Fossils help us learn what life was like long ago.","zh":"化石帮助我们了解很久以前的生命是什么样的。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing considered very old-fashioned or out of date (informal, sometimes humorous).","zh":"（非正式，常带幽默）被认为很老派、过时的人或事物。"},"examples":[{"en":"He still uses a flip phone—he calls himself a fossil.","zh":"他还在用翻盖手机——他自嘲自己是个“化石”。"},{"en":"That rule is a fossil from another era.","zh":"那条规定是另一个时代遗留下来的“老古董”。"}]}],"synonyms":["remains","imprints","traces","relics","old-timer (informal)"],"phonetic":"/ˈfɑsəlz/","extraExplanation":["“Fossil”来自拉丁语，和“挖掘出来的东西”有关，所以化石常与地层、岩石和考古/古生物学联系在一起。","学习时可顺便记常见搭配：fossil record（化石记录）、fossil fuels（化石燃料：coal/coal煤、oil石油、natural gas天然气）。注意：fossil fuels里的“fossil”是形容词用法。","文化语境里把人叫“a fossil”多为玩笑或轻微吐槽，指“思想/习惯很老派”，使用时注意场合与语气。"]}
{"word":"fosslfying","summary":{"en":"Fossilizing means becoming a fossil (or making something into a fossil), and figuratively it can mean becoming rigid or outdated.","zh":"Fossilizing 指“化石化”（变成/使变成化石）；也可比喻“僵化、因循守旧”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle) Becoming a fossil, or turning something into a fossil over a long time (usually by minerals replacing the original material).","zh":"（现在分词）正在“化石化”：逐渐变成化石，或使某物在很长时间里变成化石（通常通过矿物质替代原来的组织）。"},"examples":[{"en":"Over millions of years, buried bones can end up fossilizing into stone-like material.","zh":"在数百万年里，被掩埋的骨头最终可能会化石化，变成类似石头的物质。"},{"en":"The museum studies animals that were fossilizing in ancient lake sediment.","zh":"博物馆研究那些在古代湖泊沉积物中正在化石化的动物。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative) Becoming rigid, outdated, or stuck in old ways; losing the ability to change.","zh":"（比喻）变得僵化、过时、因循守旧；失去改变与更新的能力。"},"examples":[{"en":"If a company stops listening to customers, its culture can start fossilizing.","zh":"如果一家公司不再倾听顾客，它的文化就可能开始僵化。"},{"en":"He worried that his teaching style was fossilizing and needed fresh ideas.","zh":"他担心自己的教学方式正在变得僵化，需要新的想法。"}]}],"synonyms":["fossilizing","petrifying","preserving","hardening","ossifying","becoming rigid"],"phonetic":"/ˈfɑsəlaɪzɪŋ/","extraExplanation":["你输入的 **fosslfying** 很可能是拼写错误；常见拼法是 **fossilizing**（美式更常用）或 **fossilising**（英式拼法）。","动词原形通常写作 **fossilize**；也有较少见的 **fossilify**，意思相近，但日常与学术语境里 **fossilize** 更常见。"]}
{"word":"fosslify","summary":{"en":"“fosslify” is likely a misspelling of “fossilize”: to turn into a fossil or, figuratively, to become rigid and outdated.","zh":"“fosslify” 很可能是 “fossilize” 的拼写错误：指（使）形成化石，也可比喻变得僵化守旧。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended: “fossilize”) to become a fossil, or to preserve something as a fossil over a long time.","zh":"（你可能想写：fossilize）使变成化石；（自身）变成化石；长期保存而成化石。"},"examples":[{"en":"Over millions of years, the bones fossilize in the rock.","zh":"经过数百万年，这些骨头在岩石中逐渐化石化。"},{"en":"Volcanic ash can fossilize plants by covering and protecting them.","zh":"火山灰可以覆盖并保护植物，使其形成化石。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative) to become fixed, old-fashioned, or unable to change.","zh":"（比喻）变得僵化、守旧、不再改变。"},"examples":[{"en":"Some workplace rules have fossilized and no longer fit modern life.","zh":"有些职场规则已经僵化，不再适合现代生活。"},{"en":"He worries his thinking will fossilize if he stops learning.","zh":"他担心如果停止学习，自己的思维会变得僵化。"}]}],"synonyms":["petrify","preserve","harden","ossify","become rigid"],"phonetic":"/ˈfɑsəˌlaɪz/","extraExplanation":["“fosslify” 不是常见英语单词，最可能是把 “fossilize” 拼错了。","“fossilize” 常用于科学语境（化石形成/保存），也常用于比喻语境（观念、制度变得僵化）。","相关词：fossil (n. 化石), fossilization (n. 化石形成/僵化), fossilized (adj. 已成化石的；僵化的)。"]}
{"word":"fosslology","summary":{"en":"“Fossilology” is a rare/nonstandard word for the study of fossils; the usual term is “paleontology.”","zh":"“Fossilology” 是指研究化石的少见/不规范说法；常用标准词是 “paleontology（古生物学）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard term meaning the study of fossils; most people use “paleontology” instead.","zh":"一个较少见或不规范的词，意思是“研究化石的学科”；更常用、更标准的说法是“paleontology（古生物学）”。"},"examples":[{"en":"She said she was interested in fossilology, but her professor called it paleontology.","zh":"她说自己对 fossilology 感兴趣，但她的教授说应称为 paleontology（古生物学）。"},{"en":"In most textbooks, you won’t see the word “fossilology.”","zh":"在大多数教材里，你不会看到“fossilology”这个词。"}]}],"synonyms":["paleontology","palaeontology"],"phonetic":"/ˌfɑsəˈlɑlədʒi/","extraExplanation":["你输入的 **fosslology** 很可能是拼写错误。更可能想写的是 **fossilology**，但这个词在现代英语里很少用；学术与日常最常见的标准词是 **paleontology**（美式拼写；英式常写作 *palaeontology*）。","构词理解：*fossil*（化石）+ *-logy*（……学/研究）。不过因为“古生物学”不仅研究化石本身，也研究古代生物及其演化，所以通常用 *paleontology* 更准确、更自然。"]}
{"word":"fossor","summary":{"en":"Fossor means a digger—especially a gravedigger—or, in zoology, an animal that lives by digging and burrowing.","zh":"fossor 指“挖掘者”（尤指掘墓人），也可指（动物学）以掘洞穴居为主的动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a digger; especially a person whose job is to dig, such as a gravedigger or excavator (rare/learned word)","zh":"挖掘者；尤指以挖掘为业的人，如掘墓人或挖土工（较少见、书面用词）"},"examples":[{"en":"In the old cemetery, a fossor opened a new grave at dawn.","zh":"在那座老墓园里，一位掘墓人黎明时分挖开了一座新坟。"},{"en":"Archaeologists hired a skilled fossor to help clear the trench safely.","zh":"考古学家雇了一位熟练的挖掘工，帮助安全地清理沟槽。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology) an animal that digs and lives mainly underground; a burrower","zh":"（动物学）善于掘土并主要在地下生活的动物；穴居、掘洞动物"},"examples":[{"en":"The mole is a classic fossor, built for life underground.","zh":"鼹鼠是典型的穴居掘洞动物，天生适合在地下生活。"},{"en":"Some reptiles become fossors during the dry season to escape heat.","zh":"一些爬行动物在旱季会变得更穴居，以躲避高温。"}]}],"synonyms":["digger","gravedigger","excavator","burrower","fossorial animal"],"phonetic":"/ˈfɑsɚ/","extraExplanation":["这个词源自拉丁语 fossor（“挖掘者”），来自动词 fodere（“挖”）。现代英语中不算常用，日常更常说 digger / gravedigger。","在生物学语境里，常见的相关形容词是 fossorial（“善掘洞的、穴居的”），用来描述动物的习性或身体结构（如“fossorial mammals”穴居哺乳动物）。"]}
{"word":"fossores","summary":{"en":"Fossores is the plural of fossor, meaning “diggers”—especially gravediggers (notably in early Christian catacombs) or, in zoology, burrowing animals.","zh":"Fossores 是 fossor 的复数，意为“挖掘者”，常指掘墓人（尤其早期基督教地下墓穴的掘墓者）；在动物学中也指穴居掘洞动物（统称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of fossor) a digger; especially a person who digs graves, or (historically) an early Christian catacomb gravedigger.","zh":"（fossor 的复数）挖掘者；尤指掘墓人；也可指（历史上）早期基督教地下墓穴里负责挖掘与安葬的掘墓者。"},"examples":[{"en":"In the Roman catacombs, the fossores prepared burial niches for the dead.","zh":"在罗马的地下墓穴中，fossores 会为逝者挖掘安葬壁龛。"},{"en":"Some inscriptions mention the fossores who worked for the early Christian community.","zh":"一些铭文提到为早期基督徒社群服务的 fossores。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoology) burrowing animals considered as a group; “diggers.”","zh":"（动物学）穴居、善于掘洞的动物（统称）；“掘洞者”。"},"examples":[{"en":"Moles are classic fossores because they live and hunt underground.","zh":"鼹鼠是典型的 fossores，因为它们在地下生活并觅食。"},{"en":"The exhibit compared climbers, runners, swimmers, and fossores.","zh":"展览比较了攀爬者、奔跑者、游泳者与掘洞型动物。"}]}],"synonyms":["diggers","gravediggers","burrowers","tunnelers"],"phonetic":"/fɑˈsɔːriz/","extraExplanation":["词源来自拉丁语 fossor（“挖掘者”），与动词 fodere（“挖、掘”）同源。","在历史语境中，fossores 常与早期基督教的“地下墓穴（catacombs）”相关：他们既是体力劳动者，也往往属于教会社群的一部分，因此在铭文与研究著作中会作为一个职业/群体被提到。","在动物学语境里，它可泛指“掘洞生活的动物类型”，与“arboreal（树栖）”“cursorial（奔跑型）”等生态/形态分类并列出现。"]}
{"word":"fossoria","summary":{"en":"Fossoria means burrowing animals considered as a group.","zh":"fossoria 指“穴居/掘洞动物”的统称（多见于动物学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Burrowing animals as a group; animals adapted for digging and living underground.","zh":"（统称）穴居/掘洞动物；指适应挖掘并在地下生活的一类动物。"},"examples":[{"en":"Moles and some rodents are often discussed as part of the fossoria because of their digging lifestyle.","zh":"鼹鼠和一些啮齿类常被归入“fossoria（穴居动物）”，因为它们以挖掘为生。"},{"en":"In the museum display, the fossoria section explains how claws and forelimbs change for digging.","zh":"在博物馆展区里，“fossoria（穴居动物）”部分讲解了爪子和前肢如何为了挖掘而演化。"}]}],"synonyms":["burrowers","fossorial animals","burrowing animals"],"phonetic":"/fɑˈsɔriə/","extraExplanation":["“Fossoria”常见于较旧或较宽泛的动物学写法，用来指“挖洞生活的动物群”。更常见、现代的表达是形容词 **fossorial**（穴居的、善掘洞的），如 *fossorial mammals*（穴居哺乳动物）。","词根来自拉丁语 **fossor**（掘土者），与动词 **fodere**（挖）有关；因此它在学术语境里带有“掘洞/地下生活”的核心含义。"]}
{"word":"fossorial","summary":{"en":"Fossorial describes animals adapted to digging and living underground, or anything related to burrowing.","zh":"fossorial 指（動物）適於挖掘、主要在地下生活的，也可指與掘洞行為相關的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Adapted for digging and living mostly underground.","zh":"（動物）擅長挖掘、主要在地下生活的。"},"examples":[{"en":"Moles are fossorial mammals that spend most of their lives underground.","zh":"鼴鼠是穴居（擅長挖掘）的哺乳動物，一生大多在地下度過。"},{"en":"The fossorial lifestyle helps the animal avoid predators and heat.","zh":"穴居的生活方式能幫助動物躲避天敵並避開高溫。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to burrowing behavior or to animals that dig.","zh":"與掘洞行為或掘穴動物有關的。"},"examples":[{"en":"Scientists studied fossorial behavior by tracking the animal’s tunnels.","zh":"科學家透過追蹤動物的地道來研究其掘洞行為。"}]}],"synonyms":["burrowing","subterranean (related)","digging (related)"],"phonetic":"/fɑˈsɔriəl/","extraExplanation":["詞源來自拉丁文 fossor（挖掘者），與動詞 fodere（挖、掘）相關。在生物學文章裡常見於描述「穴居」或「擅掘」的適應特徵，例如前肢強壯、爪子發達、眼睛較小等。","常見相關詞：burrowing（會掘洞的，較口語/一般用法）、subterranean（地下的，強調位置）、tunnel（地道，名詞/動詞）。"]}
{"word":"fossorious","summary":{"en":"Fossorious describes something adapted for digging or burrowing, especially animals.","zh":"fossorious 用来形容“适于挖掘或穴居”的（尤指动物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal or body part) adapted for digging and living underground; burrowing.","zh":"（动物或身体部位）适于挖掘并在地下生活的；穴居的；善于掘洞的。"},"examples":[{"en":"Moles have fossorious forelimbs built for powerful digging.","zh":"鼹鼠的前肢是典型的掘洞型肢体，专为强力挖掘而生。"},{"en":"The fossorious claws help the animal break through hard soil.","zh":"这种掘洞用的爪子能帮助动物破开坚硬的土壤。"},{"en":"Some rodents show fossorious behavior during the winter.","zh":"一些啮齿动物在冬季会表现出掘洞（穴居）行为。"}]}],"synonyms":["fossorial","burrowing","digging","subterranean"],"phonetic":"/fɑˈsɔriəs/","extraExplanation":["“fossorious”较少见，更常用的近义词是“fossorial”。两者都可用于生物学语境，描述“适于挖掘/穴居”的形态特征或生活方式。","词源来自拉丁语词根 foss-（与挖掘有关），常见相关词还有“fossil（化石）”“excavate（挖掘）”。"]}
{"word":"fossors","summary":{"en":"“Fossors” means diggers (often animals adapted for digging) and can also mean historical gravediggers, especially in catacombs.","zh":"“fossors”指“挖掘者”（常指善于挖洞的动物），也可指历史上的“掘墓人”，尤指地下墓穴中的工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of fossor: a digger; someone or something that digs (for example, an animal adapted for digging).","zh":"fossor 的复数：挖掘者；会挖洞的动物或用于挖掘的事物。"},"examples":[{"en":"Moles are fossors that spend much of their lives digging tunnels.","zh":"鼹鼠是典型的“挖掘者”（fossors），一生中很大一部分时间都在打洞挖隧道。"},{"en":"In biology class, we compared different fossors and their strong forelimbs.","zh":"在生物课上，我们比较了不同的挖掘动物（fossors）以及它们强壮的前肢。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of fossor: (historical) a gravedigger, especially one who dug burial chambers (such as in ancient catacombs).","zh":"fossor 的复数：（历史）掘墓人，尤指在地下墓穴等地挖掘墓室的人。"},"examples":[{"en":"The guide explained that fossors worked in the catacombs to create burial spaces.","zh":"导游解释说，掘墓人（fossors）在地下墓穴里工作，开凿安葬的空间。"},{"en":"Some inscriptions mention fossors by name, showing their role in the community.","zh":"一些碑刻上写有掘墓人（fossors）的名字，显示了他们在社群中的角色。"}]}],"synonyms":["diggers","burrowers","gravediggers"],"phonetic":"/ˈfɑsərz/","extraExplanation":["“fossor”来自拉丁语“fodere”（挖掘）。在早期基督教语境中，fossors 常指在罗马地下墓穴（catacombs）里开凿墓室、负责安葬相关工作的掘墓人。现代英语里这个词较少见，更常见的相关词是“fossorial”（adj. 善于挖掘的、穴居的），用来描述动物的生活方式或身体特征。"]}
{"word":"fossula","summary":{"en":"A scientific term meaning a small depression or pit on a surface, especially in anatomy/biology.","zh":"科学用语，指表面上的小凹陷或小坑，尤用于解剖学/生物学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pit, hollow, or depression on a surface, especially in anatomy or biology (e.g., on a bone or an organ).","zh":"（尤指解剖学/生物学中的）小凹陷、小坑、小窝。"},"examples":[{"en":"The anatomist noted a small fossula on the inner surface of the bone.","zh":"解剖学家注意到骨头内侧表面有一个小凹陷。"},{"en":"Under the microscope, the structure showed several tiny fossulae.","zh":"在显微镜下，该结构呈现出几个细小的凹窝。"}]}],"synonyms":["small pit","depression","hollow","fovea","groove"],"phonetic":"/fɑˈsjuːlə/","extraExplanation":["词源：来自拉丁语 fossula（fossa 的指小形式），意思是“小沟/小坑”。因此它常出现在较正式的科学语境（解剖学、昆虫学、植物学等）中，用来指表面的细小凹陷。","复数形式常见为 fossulae（拉丁式复数），在学术文章里可能会看到。"]}
{"word":"fossulae","summary":{"en":"Fossulae are small pits or depressions, mainly used as a technical term in anatomy and zoology.","zh":"fossulae 指“小凹窝/小凹陷”，主要见于解剖学和动物学等专业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small pits, depressions, or grooves (especially in anatomy or zoology), often seen on bones, teeth, or the surface of an organ","zh":"（尤用于解剖学/动物学）小凹窝、小凹陷或小沟槽，常见于骨、牙或器官表面"},"examples":[{"en":"The skull shows several fossulae where muscles once attached.","zh":"这个头骨上有几个小凹窝，是肌肉曾经附着的位置。"},{"en":"Under a microscope, tiny fossulae can be seen on the surface of the specimen.","zh":"在显微镜下，可以看到标本表面有细小的凹窝。"}]}],"synonyms":["small pits","depressions","dimples","pits","indentations"],"phonetic":"/fɑˈsuːli/","extraExplanation":["“fossulae”是拉丁语复数形式（单数：fossula），相当于英文里“多个小凹陷/小窝”。很多生物学与医学术语会保留这种 -ae 结尾的复数形式（如 larva → larvae）。在一般英语写作中，也常用更直白的说法，如 “small pits/depressions”。"]}
{"word":"fossulate","summary":{"en":"Fossulate is a rare verb meaning “to dig or make trenches,” or “to form/mark with grooves.”","zh":"fossulate 是个罕见动词，主要指“挖沟开槽”，也可指“使表面形成沟槽/凹纹”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To dig or make a ditch; to trench or excavate.","zh":"（罕见）挖沟；开沟；挖掘成沟槽。"},"examples":[{"en":"The workers fossulated a shallow channel to guide the rainwater away.","zh":"工人们挖了一条浅沟，把雨水引走。"},{"en":"In older texts, you may find “fossulated” describing land that has been trenched.","zh":"在较老的文本里，你可能会看到“fossulated”用来形容被开沟的土地。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare, usually in biology/description) To mark with grooves or trenches; to make something furrowed.","zh":"（罕见，常见于生物或描写）使有沟槽；使出现凹沟/条纹。"},"examples":[{"en":"The shell surface appears fossulated, with fine grooves along the ridges.","zh":"贝壳表面看起来有沟槽，脊线上有细细的凹纹。"},{"en":"Time and erosion had fossulated the soft stone into narrow channels.","zh":"时间和侵蚀把软石刻蚀出狭窄的沟槽。"}]}],"synonyms":["dig","trench","excavate","furrow","groove"],"phonetic":"/ˈfɑs.jəˌleɪt/","extraExplanation":["“fossulate”来自拉丁语词根 foss-（与挖掘有关，类似于“fossil（化石）”同源的“被挖出/被埋藏后显现”的意象）。","现代英语中这个词非常少见，写作时更常用 dig, trench, excavate（挖掘/开沟），或用形容词 fossulated / fossulate（有沟槽的）出现在地质、生物形态描述里。"]}
{"word":"fossule","summary":{"en":"Fossule means a small ditch/groove, or (in biology) a small pit-like depression on an animal’s surface.","zh":"Fossule 指小沟/凹槽；在生物学中也可指动物体表的小坑状凹陷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small ditch, trench, groove, or furrow (often used in technical or biological descriptions)","zh":"（常用于技术或生物学描述的）小沟、小壕沟、凹槽、细沟"},"examples":[{"en":"Archaeologists noted a shallow fossule running along the edge of the site.","zh":"考古学家注意到遗址边缘有一道浅浅的小沟（fossule）。"},{"en":"A narrow fossule separated the two planted rows so water could drain away.","zh":"两排植物之间有一条细沟（fossule），便于排水。"}]},{"partOfSpeech":"n.","definition":{"en":"(in entomology/zoology) a small pit or depression on the surface of an animal’s body, especially on an insect","zh":"（昆虫学/动物学）动物体表的小坑、小凹陷（尤指昆虫体表）"},"examples":[{"en":"Under the microscope, the beetle’s head showed a distinct fossule near the antenna base.","zh":"在显微镜下，这只甲虫头部触角基部附近有一个明显的小凹陷（fossule）。"}]}],"synonyms":["groove","furrow","trench","ditch","depression","pit"],"phonetic":"/ˈfɑs.juːl/","extraExplanation":["“fossule”来自拉丁语词根 foss-（意为“挖”），与“fossil（化石）”“excavate（挖掘）”在词源上有联系。日常英语中很少用，更多见于考古、地质或昆虫/动物形态学的学术写作。","不要和“follicle（毛囊/滤泡）”混淆：两者拼写相近，但意思和用法完全不同。"]}
{"word":"fossulet","summary":{"en":"A rare word meaning a small pit or depression, usually in scientific description.","zh":"一个较罕见的词，指小凹坑/小凹陷，多用于科学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small pit, hollow, or little depression on a surface (often used in scientific or anatomical descriptions).","zh":"（表面上的）小凹坑；小凹陷（常用于科学或解剖学描述）。"},"examples":[{"en":"Under the microscope, the shell showed a tiny fossulet near the edge.","zh":"在显微镜下，贝壳边缘附近可以看到一个微小的凹坑。"},{"en":"The insect’s wing has a shallow fossulet that helps identify the species.","zh":"这种昆虫的翅膀上有一个浅浅的凹陷，可用于辨识物种。"}]}],"synonyms":["pit","depression","dimple","hollow","indentation"],"phonetic":"ˈfɑs.jə.lət","extraExplanation":["这个词非常少见，多出现在解剖学、昆虫学、古生物学等较“书面/学术”的语境里。","词源上与拉丁语有关：fossa（沟、坑）+ 表示“小”的词缀，整体意思就是“很小的坑/凹处”。日常英语里更常用 pit / depression / dimple / hollow 来表达类似意思。"]}
{"word":"fostell","summary":{"en":"“Fostell” is usually a misspelling of “forestall” = to prevent something by acting early.","zh":"“fostell”通常是“forestall”的拼写错误：指通过提前行动来预先阻止某事。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) “Fostell” is not a common English word. It is most often a misspelling of “forestall,” meaning to prevent something by acting in advance.","zh":"（非标准）“fostell”不是常见英语单词。它最常见的是“forestall”的拼写错误，意思是通过提前行动来阻止（某事）发生。"},"examples":[{"en":"I couldn’t find “fostell” in the dictionary—did you mean “forestall”?","zh":"我在词典里找不到“fostell”——你是不是想写“forestall”？"},{"en":"They took quick action to forestall a crisis.","zh":"他们迅速采取行动以防止危机发生。"}]}],"synonyms":["forestall","prevent","avert","preempt"],"phonetic":"/fɔrˈstɔl/","extraExplanation":["“Forestall”常见于较正式的英语写作（新闻、商务、学术），语气比“prevent/stop”更书面，强调“提前一步”。","常用搭配：forestall a problem/crisis/attack/complaint（防止问题/危机/袭击/投诉发生）。","容易混淆：foster（培养、促进）≠ forestall（先发制人、预先阻止）。"]}
{"word":"FOSTER","summary":{"en":"Foster means to encourage growth or development, or to temporarily care for a child/animal; it can also describe things related to foster care.","zh":"foster 可指“促进/培养（发展）”，也可指“寄养/代养（孩子或动物）”，并可作形容词表示“寄养相关的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to help something develop or grow; to encourage or promote","zh":"促进；培养；鼓励（某事发展或成长）"},"examples":[{"en":"The program aims to foster teamwork and leadership.","zh":"这个项目旨在培养团队合作和领导力。"},{"en":"Good teachers foster curiosity in their students.","zh":"好的老师会培养学生的好奇心。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take care of a child (or sometimes an animal) for a period of time without being the legal parent","zh":"代养；寄养（孩子，有时也指动物；并非法律上的父母）"},"examples":[{"en":"They decided to foster a child while the child’s parents got back on their feet.","zh":"他们决定在孩子父母重新稳定生活期间寄养这个孩子。"},{"en":"Our family fosters rescue dogs until they are adopted.","zh":"我们家会临时寄养救助犬，直到它们被领养。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to temporary care provided by someone who is not the child’s parent (foster care)","zh":"寄养的；代养的（与寄养照护有关）"},"examples":[{"en":"She grew up in a foster family.","zh":"她在寄养家庭中长大。"},{"en":"He works with foster parents in the community.","zh":"他与社区里的寄养父母合作。"}]}],"synonyms":["encourage","promote","cultivate","nurture","support","bring up (a child)","care for"],"phonetic":"/ˈfɑstɚ/","extraExplanation":["在美国语境中，foster care（寄养照护）通常指由政府/机构安排、由寄养家庭临时照顾未成年人；它与 adoption（收养）不同：寄养一般是临时的，收养通常会建立永久的法律亲子关系。","foster 作“促进/培养”时，常与抽象名词搭配：foster interest/understanding/trust/innovation（培养兴趣/增进理解/建立信任/促进创新）。"]}
{"word":"Foster","summary":{"en":"Foster means (1) to encourage growth or development, or (2) to temporarily care for a child as a substitute parent; it also describes things related to foster care.","zh":"Foster 表示（1）促进/培育发展，或（2）寄养/代养孩子；也可作形容词表示与寄养照护有关。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to help something grow, develop, or become stronger (an idea, relationship, skill, or feeling)","zh":"促进；培育（想法、关系、技能或情感等的发展）"},"examples":[{"en":"The program aims to foster teamwork and leadership.","zh":"这个项目旨在培养团队合作和领导力。"},{"en":"Good teachers foster curiosity in their students.","zh":"好的老师会激发学生的好奇心。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take care of a child for a period of time as a substitute parent (not legally your own child)","zh":"寄养；代养（在一段时间内照顾不属于自己法律子女的孩子）"},"examples":[{"en":"They decided to foster two siblings until a permanent home was found.","zh":"他们决定寄养两位兄妹，直到找到永久的家。"},{"en":"She has fostered children for over ten years.","zh":"她寄养孩子已经十多年了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a parent/organization) providing temporary care for someone (often used before a noun)","zh":"（常作定语）寄养的；代养的"},"examples":[{"en":"He grew up in a foster home.","zh":"他在寄养家庭中长大。"},{"en":"The child was placed with a foster family.","zh":"这个孩子被安置在一个寄养家庭。"}]}],"synonyms":["encourage","promote","cultivate","nurture","support","raise (a child)","care for"],"phonetic":"/ˈfɑstər/","extraExplanation":["在英美语境里，foster 常与儿童福利系统相关：foster care（寄养照护）指政府或机构把孩子临时安置在寄养家庭中；与 adoption（收养/领养）不同，寄养通常是“临时的”，法律亲子关系一般不改变。","词义上，foster 也常用于较“抽象”的对象，如 foster trust/peace/understanding（增进信任/和平/理解）。写作中它比 help 更正式，强调“长期培养、促成”。"]}
{"word":"foster","summary":{"en":"Foster means to encourage development (ideas, skills, relationships) or to care for someone temporarily through foster care; as an adjective it describes a non-biological family relationship.","zh":"foster 表示“促进/培养（发展）”或“寄养/代养（暂时照顾）”；作形容词时指“寄养关系的、非血缘的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To help something develop or grow; to encourage (an idea, relationship, skill, etc.).","zh":"促进；培养；鼓励（想法、关系、技能等）发展。"},"examples":[{"en":"The school tries to foster a love of reading in every child.","zh":"这所学校努力培养每个孩子对阅读的热爱。"},{"en":"Regular meetings can foster trust between coworkers.","zh":"定期开会可以增进同事之间的信任。"}]},{"partOfSpeech":"vt.","definition":{"en":"To take care of a child, animal, or person for a period of time, usually not as a legal parent/owner.","zh":"（在非亲生或非正式监护的情况下）寄养；代养；暂时照顾（孩子、动物或某人）。"},"examples":[{"en":"They decided to foster a child while the parents worked to regain custody.","zh":"在亲生父母努力恢复监护权期间，他们决定寄养一个孩子。"},{"en":"She fosters rescue dogs until they are adopted.","zh":"她寄养救助来的狗，直到它们被领养。"}]},{"partOfSpeech":"adj.","definition":{"en":"Provided by fostering, not by blood; connected through foster care (e.g., foster parent, foster child, foster home).","zh":"寄养的；代养的；（与寄养关系相关的，如寄养父母、寄养儿童、寄养家庭）。"},"examples":[{"en":"He grew up in a foster home.","zh":"他在寄养家庭中长大。"},{"en":"Her foster mother supported her through college.","zh":"她的寄养母亲支持她读完了大学。"}]}],"synonyms":["encourage","promote","cultivate","nurture","support"],"phonetic":"/ˈfɑstɚ/","extraExplanation":["“Foster”作动词时常与抽象名词搭配：foster growth/innovation/understanding/trust（促进增长/创新/理解/信任）。语气通常偏积极，表示“帮助某事自然地发展起来”。","“Foster care”指由政府或机构安排的寄养体系；“to foster a child”在日常语境里通常意味着暂时照顾与抚养，而不等于法律意义上的“adopt（收养）”。","文学与正式写作中常见搭配“foster + virtue/hope/peace”等，强调通过环境、教育或制度来“培育”某种品质或氛围。"]}
{"word":"fosterable","summary":{"en":"Fosterable means “able to be fostered”—able to be nurtured or encouraged; in some contexts, it can mean “suitable for foster care.”","zh":"fosterable 指“可被培养/促进的”；在特定语境下也可指“适合寄养的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be fostered, developed, encouraged, or nurtured (often used with skills, relationships, habits, or qualities).","zh":"可被培养的；可被促进的；可被扶持/孕育的（常用于技能、关系、习惯或品质等）。"},"examples":[{"en":"A child’s curiosity is fosterable when adults answer questions patiently.","zh":"当大人耐心回答问题时，孩子的好奇心是可以被培养的。"},{"en":"Trust is fosterable through honest communication and consistent actions.","zh":"信任可以通过坦诚沟通和持续一致的行动来建立与促进。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be placed in foster care or supported by a foster system (a less common, more specialized use).","zh":"可被安排寄养的；可进入寄养体系获得照护的（较少见、偏专业用法）。"},"examples":[{"en":"The agency considers whether the pet is fosterable before listing it for temporary homes.","zh":"在为宠物寻找临时家庭前，机构会评估它是否适合被寄养。"},{"en":"They assessed which cases were fosterable given the available families.","zh":"他们根据现有寄养家庭资源评估哪些个案可以安排寄养。"}]}],"synonyms":["nurturable","developable","cultivable","encourageable","supportable"],"phonetic":"/ˈfɑstərəbəl/","extraExplanation":["“fosterable”是由动词foster（促进、培养；也指寄养）加上形容词后缀“-able”（可……的）构成，因此整体意思就是“可被培养/促进的”或在特定语境下“可寄养的”。","在日常英语里，“foster”更常见；“fosterable”相对少用，常见于写作、研究报告或机构/政策语境（如儿童福利、动物救助）。"]}
{"word":"fosterage","summary":{"en":"Fosterage is the practice or system of raising a child in someone else’s household, often by arrangement or tradition.","zh":"Fosterage 指把孩子交由他人家庭抚养的做法或制度，常由安排或传统所形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of raising a child who is not your own, usually arranged by the child’s parents or by an authority (such as a court or social service).","zh":"寄养；抚养非亲生子女的做法（通常由父母或政府/机构安排，如法院或社会服务机构）。"},"examples":[{"en":"After the accident, the children lived in fosterage with their aunt.","zh":"事故之后，孩子们由姑妈寄养照顾。"},{"en":"In some communities, fosterage is a traditional way to strengthen family ties.","zh":"在一些社群中，寄养是一种用来加深家族联系的传统方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical/literary) The upbringing of a child in another household as part of a social or political system (for example, in clans or noble families).","zh":"（历史/文学）把孩子送到他人家庭中抚养的制度性做法（例如氏族或贵族家庭中，用于社会或政治安排）。"},"examples":[{"en":"In medieval stories, fosterage often created lifelong loyalty between two families.","zh":"在中世纪故事里，寄养常常让两个家族结下终身的忠诚关系。"},{"en":"The young heir was sent into fosterage to learn another household’s customs.","zh":"年轻的继承人被送去寄养，以学习另一个家族的礼俗。"}]}],"synonyms":["fostering","foster care","guardianship (overlapping in meaning)"],"phonetic":"/ˈfɑstərɪdʒ/","extraExplanation":["“fosterage”与“foster care（寄养照护）”相关，但语感更偏“制度/习俗/做法”，常见于历史、社会人类学或文学语境；现代日常英语里更常说“foster care”或“to be in foster care”。","词源上来自“foster（抚养、养育）”，后缀“-age”表示“行为/状态/制度”（类似“marriage”“peerage”）。"]}
{"word":"fostered","summary":{"en":"“Fostered” means “encouraged or helped develop,” or “raised a child in foster care.”","zh":"“Fostered”意为“促进/培养（发展）”，也可指“寄养（照顾非亲生孩子）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “foster”: to encourage or help something grow or develop (such as an idea, relationship, or skill).","zh":"“foster”的过去式/过去分词：促进、培养某事物的发展（如想法、关系或技能）。"},"examples":[{"en":"The teacher fostered a love of reading in her students.","zh":"这位老师培养了学生对阅读的热爱。"},{"en":"The program fostered stronger ties between the two communities.","zh":"这个项目促进了两个社区之间更紧密的联系。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense and past participle of “foster”: to raise and care for a child who is not your own, usually for a limited time (foster care).","zh":"“foster”的过去式/过去分词：在寄养体系下抚养、照顾非亲生的孩子（通常是暂时的）。"},"examples":[{"en":"They fostered two siblings for a year.","zh":"他们寄养了两位兄妹一年。"},{"en":"She was fostered by a family in another town.","zh":"她被另一个城镇的一户人家寄养。"}]}],"synonyms":["encouraged","nurtured","cultivated","promoted","supported","raised (in foster care)"],"phonetic":"/ˈfɔstərd/","extraExplanation":["在日常英语里，fostered 很常用于抽象事物（如“fostered trust/innovation/hope”=“促进信任/创新/希望”）。","与“adopted（收养）”不同，foster（寄养）通常不改变法律上的亲子关系，多为临时照护；具体制度因国家/地区而异。"]}
{"word":"fosterer","summary":{"en":"A fosterer is someone who temporarily cares for a child/animal, or more broadly someone who promotes growth or development.","zh":"fosterer 指寄养照护者（临时照顾孩子/动物的人），也可泛指促进某事发展的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who fosters a child or animal; a foster parent or foster carer.","zh":"寄养者；（临时）抚养他人孩子或动物的人；寄养父母/寄养照护者。"},"examples":[{"en":"After the puppies were rescued, each fosterer took one home until they were adopted.","zh":"小狗获救后，每位寄养者都带一只回家照顾，直到它们被领养。"},{"en":"The agency trained every fosterer before placing a child in their care.","zh":"机构在把孩子交由照护前，会培训每一位寄养者。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who helps something develop, grow, or succeed; someone who encourages or promotes an idea, activity, or relationship.","zh":"促进者；推动某事发展、成长或成功的人；鼓励或推广某种想法、活动或关系的人。"},"examples":[{"en":"She became a fosterer of young writers by running free workshops.","zh":"她通过举办免费工作坊，成了青年写作者的扶持者。"},{"en":"Community leaders can be fosterers of trust during difficult times.","zh":"在艰难时期，社区领袖可以成为建立信任的促进者。"}]}],"synonyms":["foster parent","carer","caregiver","guardian (in some contexts)","supporter","promoter","encourager"],"phonetic":"/ˈfɑstərər/","extraExplanation":["“fosterer”来自动词 foster（抚养、培养、促进）+ 表示“做……的人”的后缀 -er。日常英语里更常见的说法是 foster parent（寄养父母）、foster carer（寄养照护者，英式更常用）或 foster family（寄养家庭）；“fosterer”比较少见，偏书面或概括性表达。","在社会服务语境中，foster care 指“寄养照护”（通常是临时安置），与 adoption（收养，法律上成为永久父母/监护人）不同。"]}
{"word":"fosterers","summary":{"en":"“Fosterers” means people who foster—either caring for a child who isn’t their own or helping something develop.","zh":"“fosterers”指“寄养者/代养者”，也可指“培育者、促进者”，即帮助某人或某事成长发展的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who foster someone or something; especially adults who take care of a child who is not their own (often through a foster-care system)","zh":"寄养者；（尤指）代养他人孩子的人（常与寄养体系相关）"},"examples":[{"en":"The fosterers provided a safe home until the child could return to his family.","zh":"寄养者提供了一个安全的家，直到孩子能回到自己的家庭。"},{"en":"Social workers check in regularly to support both the child and the fosterers.","zh":"社工会定期探访，支持孩子和寄养者双方。"}]},{"partOfSpeech":"n.","definition":{"en":"people who encourage, develop, or help something grow (such as talent, learning, or good relationships)","zh":"促进者；培育者；推动某事发展的人（如才能、学习或关系）"},"examples":[{"en":"Good teachers are fosterers of curiosity.","zh":"好老师是好奇心的培育者。"},{"en":"Community leaders can be fosterers of trust and cooperation.","zh":"社区领袖可以成为信任与合作的推动者。"}]}],"synonyms":["foster parents","caregivers","guardians","supporters","nurturers","promoters"],"phonetic":"/ˈfɑstərərz/","extraExplanation":["“fosterer”来自动词 foster（抚养、培养、促进）。在美国语境中，fosterers 常指通过政府或机构安排、短期照顾未成年人的“寄养家长/寄养家庭成员”。它通常强调临时照护与支持，而不是法律上的收养（adoption）。"]}
{"word":"fosterhood","summary":{"en":"Fosterhood means the experience or state of foster parenting or living in foster care.","zh":"Fosterhood 指寄养父母（或寄养家庭/寄养儿童）所经历的寄养状态与生活阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or experience of being a foster parent or being in a foster family; foster care as a lived role or period.","zh":"寄养身份或经历；作为寄养父母（或寄养家庭成员）的状态；也可指“寄养这段时期/生活”。"},"examples":[{"en":"During her years in fosterhood, she moved between several homes but kept up with school.","zh":"在她寄养的那些年里，她辗转过好几户人家，但一直坚持上学。"},{"en":"They learned a lot about fosterhood before applying to become foster parents.","zh":"在申请成为寄养父母之前，他们先认真了解了寄养相关的生活与责任。"}]}],"synonyms":["foster care","fostering","the foster care experience","being in foster care","foster parenting"],"phonetic":"/ˈfɑstərˌhʊd/","extraExplanation":["“fosterhood”在日常英语中不算常见，更常用的说法是“foster care”（寄养照护体系）、“being in foster care”（处于寄养中）或“being a foster parent”（成为寄养父母）。","它通常出现在讨论寄养体验、家庭照护与儿童福利的语境里，带有“作为一种人生阶段/社会角色”的意味，类似于“parenthood（为人父母）”这种构词方式。"]}
{"word":"fostering","summary":{"en":"“Fostering” means encouraging growth or development; it can also refer to providing nurturing support, or to temporary care in foster care.","zh":"“fostering”指促进成长与发展；也可指提供支持性的培育环境；还可指寄养体系中的临时照护。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Helping something (a skill, relationship, idea, or feeling) grow and develop; encouraging.","zh":"促进某事（技能、关系、想法或情感）成长与发展；培育、推动。"},"examples":[{"en":"The program focuses on fostering creativity in children.","zh":"这个项目重点在于培养孩子的创造力。"},{"en":"Good managers foster trust by being honest and consistent.","zh":"优秀的管理者通过诚实和一致来建立（培养）信任。"},{"en":"Reading widely can foster critical thinking.","zh":"广泛阅读能培养批判性思维。"}]},{"partOfSpeech":"adj.","definition":{"en":"Providing care and a supportive environment; nurturing (often used to describe relationships, workplaces, or learning settings).","zh":"提供关怀与支持性的环境；滋养、营造（常用于描述关系、工作氛围或学习环境）。"},"examples":[{"en":"They try to create a fostering classroom environment.","zh":"他们努力营造一个支持性的课堂环境。"},{"en":"A fostering community helps newcomers feel welcome.","zh":"一个包容互助的社区能让新来的人感到受欢迎。"}]},{"partOfSpeech":"v.","definition":{"en":"Temporarily caring for a child or animal that is not your own (foster care).","zh":"临时照料不属于自己的孩子或动物（寄养、代养）。"},"examples":[{"en":"She is fostering two kittens until they are adopted.","zh":"她在两只小猫被领养前暂时寄养它们。"},{"en":"They are fostering a child through the local foster care system.","zh":"他们通过当地的寄养体系在寄养一名孩子。"}]}],"synonyms":["encouraging","promoting","nurturing","cultivating","supporting","developing"],"phonetic":"/ˈfɑstərɪŋ/","extraExplanation":["“fostering”来自动词“foster”，核心含义是“让……成长/发展”。在日常语境中，最常见的是搭配抽象名词：foster trust/understanding/innovation/relationships 等。","与“raise（抚养长大）”相比，“foster”更强调“提供支持、促成成长”的过程；在社会服务领域，“foster care”特指“寄养照护”，通常是暂时性的、由机构安排的照料。"]}
{"word":"fosteringly","summary":{"en":"“Fosteringly” means “in a nurturing/supportive way,” and sometimes “in a foster-care manner.”","zh":"“fosteringly”表示“以培育/扶持的方式”，有时也指“以寄养照护的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that supports growth, development, or improvement; nurturingly.","zh":"以促进成长、发展或改善的方式；培育地、扶持地。"},"examples":[{"en":"The teacher spoke fosteringly to the shy student, encouraging her to share her ideas.","zh":"老师以鼓励、扶持的方式对那位害羞的学生说话，鼓励她分享自己的想法。"},{"en":"A fosteringly designed environment can help new employees learn faster.","zh":"以“促进成长”为导向设计的环境能帮助新员工更快学习。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the manner of a foster parent or foster care; as part of providing foster support.","zh":"以寄养父母/寄养照护的方式；在提供寄养支持的过程中。"},"examples":[{"en":"They treated the child fosteringly, offering stability and care until the family situation improved.","zh":"他们以寄养照护的方式对待这个孩子，在家庭情况好转前提供稳定与关爱。"}]}],"synonyms":["nurturingly","supportively","encouragingly","beneficially","helpfully"],"phonetic":"/ˈfɑstərɪŋli/","extraExplanation":["“fosteringly”在现代英语中比较少见，更常见的表达是“nurturingly（培育地）”“supportively（支持地）”或直接用短语“in a nurturing/supportive way”。","与“foster”相关的两大核心含义是：①促进、培养（foster growth/innovation）；②寄养（foster child/foster care）。具体含义通常要靠上下文判断。"]}
{"word":"fosterite","summary":{"en":"Forsterite is a magnesium silicate mineral (Mg₂SiO₄), the magnesium-rich end member of the olivine group.","zh":"Forsterite（镁橄榄石）是一种镁硅酸盐矿物（Mg₂SiO₄），是橄榄石族中富镁的端元。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral, magnesium silicate (Mg₂SiO₄), that is the magnesium-rich end member of the olivine group; it is common in some igneous and metamorphic rocks and can form gem-quality crystals.","zh":"一种矿物：镁硅酸盐（Mg₂SiO₄），是橄榄石族中富镁的端元；常见于某些火成岩与变质岩中，也可能形成宝石级晶体。"},"examples":[{"en":"Forsterite is the magnesium-rich member of the olivine group.","zh":"镁橄榄石是橄榄石族中富镁的一员。"},{"en":"The sample contains forsterite crystals mixed with other minerals.","zh":"这份样品含有镁橄榄石晶体，并与其他矿物混合在一起。"}]}],"synonyms":["magnesium olivine","Mg-rich olivine"],"phonetic":"ˈfɔrstəˌraɪt","extraExplanation":["你输入的拼写“fosterite”在英文中更常见的标准拼写是 **forsterite**（镁橄榄石）。如果你是在地质或材料学语境里看到它，通常指橄榄石（olivine）体系中富镁的那一端，与富铁端元 **fayalite**（铁橄榄石）相对应。","词源上，forsterite 以博物学家 Johann Reinhold Forster 的姓氏命名，属于科学命名中常见的“以人名命名矿物/物种”的传统。"]}
{"word":"fosterland","summary":{"en":"Fosterland is a rare, poetic word meaning one’s homeland or native country.","zh":"Fosterland 是一个少见且偏文学的词，意思是“祖国/故乡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/poetic) A person’s native country; homeland; fatherland.","zh":"（古语/诗歌用语）祖国；故乡；家国。"},"examples":[{"en":"He wrote poems praising his fosterland and its mountains.","zh":"他写诗赞美自己的祖国和那里的群山。"},{"en":"Many emigrants kept a deep love for the fosterland they left behind.","zh":"许多移民仍然深深眷恋他们离开的祖国。"}]}],"synonyms":["homeland","native country","fatherland","motherland"],"phonetic":"/ˈfɑstɚˌlænd/","extraExplanation":["“fosterland”在现代英语里非常少见，更多出现在翻译作品、历史/文学语境中，用来对应北欧语言（如挪威语、瑞典语）的“fosterland”（意为“祖国”）。日常英语更常用“homeland”“native country”“motherland/fatherland”。","注意不要把它误解为“foster”（收养、培养）+“land”（土地）=“寄养之地”。这里的“fosterland”是固定用法，整体表示“祖国/家国”。"]}
{"word":"fosterling","summary":{"en":"“Fosterling” means a foster child; it’s a literary/old-fashioned term.","zh":"“fosterling”意为“寄养孩子”，属于偏文学或较旧的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a child who is raised by someone who is not their biological parent; a foster child (often a literary or old-fashioned word).","zh":"由非亲生父母抚养长大的孩子；寄养孩子（常见于文学或较旧的用法）。"},"examples":[{"en":"After the war, the couple took in a fosterling and treated him as their own son.","zh":"战后，这对夫妻收养（寄养）了一名寄养孩子，把他当作亲生儿子一样对待。"},{"en":"In the novel, the hero grows up as a fosterling in a remote village.","zh":"在小说中，主人公在偏远村庄里以寄养孩子的身份长大。"}]}],"synonyms":["foster child","ward","adoptee (not always the same)"],"phonetic":"/ˈfɔstɚlɪŋ/","extraExplanation":["“fosterling”由“foster（抚养、寄养）+ -ling（常表示“小的/年轻的/某类人”）”构成，语气带一点文学感或古风；日常英语更常说“foster child”。在一些文学作品或较正式的叙述中，用“fosterling”会更有故事感。"]}
{"word":"fosterlings","summary":{"en":"Fosterlings are children raised by foster parents, or figuratively, people who are nurtured and supported by someone or an institution.","zh":"fosterlings 指寄养儿童；也可比喻被某人或机构扶持、栽培的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a child who is being raised by foster parents (not their biological parents), usually for a temporary period","zh":"寄养儿童；由寄养父母抚养的孩子（通常是暂时的）"},"examples":[{"en":"The couple opened their home to two fosterlings during the summer.","zh":"这对夫妇在夏天接纳了两名寄养儿童到家里生活。"},{"en":"Social workers visited the fosterlings regularly to check on their well-being.","zh":"社工定期探访这些寄养儿童，了解他们的生活状况。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) someone who is helped, trained, or supported by a person or group; a protégé","zh":"（比喻）受扶持、栽培的人；门生；被提携者"},"examples":[{"en":"Many young artists were once fosterlings of the city’s cultural program.","zh":"许多年轻艺术家曾是该市文化项目扶持培养的对象。"},{"en":"He spoke proudly of his former fosterlings who had become teachers themselves.","zh":"他自豪地谈起自己曾扶持过的人，如今也成了老师。"}]}],"synonyms":["foster children","foster kids","wards","charges","protégés"],"phonetic":"/ˈfɑstərˌlɪŋ/","extraExplanation":["“fosterling”来自“foster（抚养、培养）+ -ling（表示‘小的/…的人’）”。在现代英语中更常见的说法是“foster child”。“fosterling(s)”略带文学或正式语气，在叙事、纪实或较旧的文本中更容易见到。","在英美语境里，“foster care（寄养照护）”通常指由政府或授权机构安排的临时照护；与“adoption（收养）”不同，寄养不一定改变法律上的亲子关系。阅读或写作时可注意两者的区别。"]}
{"word":"fosters","summary":{"en":"“Fosters” most commonly means “encourages/promotes” (as in “Good habits foster health”), and it can also mean “provides temporary care as a foster parent.”","zh":"“fosters”最常见表示“促进/培养”（如“好习惯促进健康”），也可表示“寄养/代养”（作为寄养父母提供暂时照护）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “foster”) to encourage or help something grow or develop; to promote.","zh":"（foster 的第三人称单数）促进；培养；助长（某事发展）。"},"examples":[{"en":"The program fosters creativity in young students.","zh":"这个项目培养年轻学生的创造力。"},{"en":"Good communication fosters trust.","zh":"良好的沟通能促进信任。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “foster”) to care for a child (or animal) temporarily as a substitute parent/owner.","zh":"（foster 的第三人称单数）代养；寄养（儿童或动物，通常是暂时的）。"},"examples":[{"en":"She fosters two children through a local agency.","zh":"她通过当地机构寄养了两个孩子。"},{"en":"Our neighbor fosters rescue dogs until they are adopted.","zh":"我们邻居会代养救援犬，直到它们被领养。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of “foster”: people who provide foster care (often used as “fosters” in informal context).","zh":"foster 的复数：寄养者；代养家庭（多见于较口语的表达）。"},"examples":[{"en":"The fosters receive training before taking in a child.","zh":"寄养家庭在接收孩子之前会接受培训。"}]}],"synonyms":["encourages","promotes","supports","nurtures","cultivates"],"phonetic":"/ˈfɔstərz/","extraExplanation":["在英语里，“foster”常和“development / growth / trust / understanding”等抽象名词搭配，强调“创造更有利的环境”，而不只是“直接造成”。\n\n“foster care（寄养照护）”是英美社会中的常见制度：孩子因家庭原因无法与亲生父母同住时，政府或机构会安排其在寄养家庭暂住。日常表达中要注意：foster parents 是“寄养父母”，不同于 adoptive parents（养父母，法律上永久收养）。"]}
{"word":"fostership","summary":{"en":"Fostership means the role or state of being a foster parent, or a foster care arrangement.","zh":"fostership 指“寄养父母的身份/职责”，也可指一种寄养安置关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The role or status of being a foster parent; the arrangement of caring for a child who is not your biological or legal child, usually through a foster care system.","zh":"寄养父母的身份或职责；通过寄养制度照顾非亲生或非法定子女的安排。"},"examples":[{"en":"After years of training, she began her fostership with two siblings in need of a safe home.","zh":"经过多年的培训后，她开始了寄养工作，照顾两名需要安全家庭的兄妹。"},{"en":"The agency reviewed their fostership every six months to make sure the children were doing well.","zh":"机构每六个月会评估一次他们的寄养安排，以确保孩子们状况良好。"}]}],"synonyms":["foster parenting","foster parenthood","foster care arrangement"],"phonetic":"/ˈfɑstərˌʃɪp/","extraExplanation":["“fostership”在日常英语里不算常见，更多见于社工、福利机构或政策讨论中。更常用的说法是“foster parenting”（寄养育儿/做寄养父母）或“foster care”（寄养照护制度/寄养安置）。","词尾“-ship”常表示“身份、状态或关系”（如 friendship 友谊、leadership 领导力），因此 fostership 强调“寄养父母这一身份/关系”而不只是照护行为。"]}
{"word":"fostor","summary":{"en":"“Fostor” is usually a misspelling of “foster,” meaning to encourage development or to care for a child temporarily (foster care).","zh":"“fostor”通常是“foster”的拼写错误，表示“促进发展/培养”，或“寄养（暂时照顾孩子）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Common misspelling) The correct word is “foster”: to help something grow or develop; to encourage.","zh":"（常见拼写错误）正确拼写是“foster”：促进某事发展、成长；鼓励。"},"examples":[{"en":"Good teachers foster curiosity in their students.","zh":"好的老师会培养学生的好奇心。"},{"en":"The program aims to foster better communication at work.","zh":"这个项目旨在促进工作中的更好沟通。"}]},{"partOfSpeech":"vt.","definition":{"en":"(of a parent or family) to take care of a child for a time without becoming the child’s legal parent; to provide temporary care.","zh":"（指寄养父母/家庭）在未成为法定父母的情况下，暂时照顾并抚养儿童；寄养。"},"examples":[{"en":"They decided to foster a child through a local agency.","zh":"他们决定通过当地机构寄养一名孩子。"},{"en":"She fosters two teenagers at the moment.","zh":"她目前寄养着两名青少年。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to raising a child who is not your biological child (e.g., foster parents, foster care).","zh":"与抚养非亲生孩子有关的（如寄养父母、寄养照护）。"},"examples":[{"en":"He grew up in a foster home.","zh":"他在寄养家庭中长大。"},{"en":"Foster parents receive training and support.","zh":"寄养父母会接受培训和支持。"}]}],"synonyms":["encourage","promote","nurture","cultivate","support"],"phonetic":"/ˈfɑstɚ/","extraExplanation":["“fostor”通常是把“foster”拼错了：常见原因是把 -er 结尾误写成 -or。","常见搭配：foster + 名词（foster trust 培养信任；foster growth 促进增长；foster a sense of belonging 培养归属感）。","名词用法也很常见：a foster child（寄养儿童），the foster system（寄养体系）。"]}
{"word":"fostress","summary":{"en":"“Fostress” isn’t a standard word; you probably mean “fortress,” a strong defensive place or (figuratively) a well-protected situation.","zh":"“fostress”不是标准词；你很可能想写“fortress”，指要塞/堡垒，也可比喻很难进入或改变的“坚固处境”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) a strongly built defensive building or place; a fort.","zh":"（多半是你想写）要塞；堡垒：用于防御、非常坚固的建筑或地点。"},"examples":[{"en":"The old fortress overlooks the harbor.","zh":"那座古老的要塞俯瞰着港口。"},{"en":"The city built a fortress to protect the border.","zh":"这座城市修建了一座堡垒来保卫边境。"},{"en":"In the story, the heroes sneak into the fortress at night.","zh":"在故事里，英雄们夜里潜入堡垒。"}]},{"partOfSpeech":"n.","definition":{"en":"a place or situation that feels strongly protected or difficult to change (figurative).","zh":"（比喻）坚不可摧的据点；很难被改变或进入的环境/状态。"},"examples":[{"en":"For her, the library was a fortress of quiet and focus.","zh":"对她来说，图书馆是安静与专注的“堡垒”。"},{"en":"The company treated its data center like a fortress.","zh":"公司把数据中心当作一座堡垒来防护。"}]}],"synonyms":["fort","stronghold","citadel","bulwark"],"phonetic":"/ˈfɔrtrəs/","extraExplanation":["“fostress”不是常见英语单词，最接近的常用词通常是 **fortress**（堡垒/要塞）。如果你本来想表达“培养、促进、领养”，可能是 **foster**（v./adj.）。你想查哪一个，我也可以再给对应词条。"]}
{"word":"fostrian","summary":{"en":"“Fostrian” is not a standard word; it’s likely a misspelling of “Faustian” or a rare proper-name adjective.","zh":"“fostrian”不是标准词；多半是把“Faustian”拼错了，或是与专名相关的罕见形容词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “Faustian” (a deal that brings short-term gain but serious moral/spiritual cost) or “Fosterian/Fosterianism” (rare; relating to someone named Foster).","zh":"不是标准英语单词。很可能是拼写错误，常见的目标词是 “Faustian”（为短期利益付出严重道德/精神代价的交易），或较少见的 “Fosterian / Fosterianism”（罕见；与名为 Foster 的人或其观点有关）。"},"examples":[{"en":"I couldn’t find “fostrian” in major dictionaries—did you mean “Faustian”?","zh":"我在主流词典里找不到 “fostrian”——你是不是想写 “Faustian”？"},{"en":"The novel warns about a Faustian bargain: power now, suffering later.","zh":"这部小说警示一种“浮士德式交易”：现在得到权力，后来付出痛苦代价。"}]}],"synonyms":["Faustian (likely intended)","Faustian bargain","Faustian pact"],"phonetic":"ˈfɔstriən","extraExplanation":["“Faustian”来自德国传说人物 Faust（浮士德）。在许多文学作品中，他与魔鬼做交易以换取知识或享乐，因此 “Faustian bargain/ pact” 常用来形容“得利但代价极大”的选择。","如果你告诉我你看到 “fostrian” 的句子或出处（书名/网页/截图），我可以帮你判断它到底是拼写错误、专有名词，还是某个小众用法。"]}

