{"word":"FOV","summary":{"en":"FOV most commonly means “field of view,” the visible area through a lens or on a screen.","zh":"FOV 最常见的意思是“视场／视野”，指通过镜头或屏幕能看到的范围。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Field of view: the area you can see through a camera lens, microscope, telescope, or on a screen (often discussed in photography, VR, and video games).","zh":"（缩写）视场／视野：通过镜头、显微镜、望远镜或屏幕一次能看到的范围（常用于摄影、VR 和游戏）。"},"examples":[{"en":"This lens has a wider FOV, so it can fit more of the scene into the shot.","zh":"这支镜头的 FOV 更宽，所以能把更多画面拍进去。"},{"en":"In VR, a larger FOV often feels more immersive.","zh":"在 VR 里，更大的 FOV 往往更有沉浸感。"},{"en":"Try increasing your FOV setting in the game if you feel motion sickness.","zh":"如果你在游戏里觉得晕，可以试试调大 FOV 设置。"}]}],"synonyms":["field of view","viewing angle","viewable area"],"phonetic":"/ˌɛf oʊ ˈviː/","extraExplanation":["FOV 是英文缩写，读作字母音（\"F-O-V\"），在技术语境里非常常见。","在游戏里常见的 “FOV slider/setting” 指“视野范围”的调节；数值越大通常看得更广，但画面边缘可能更变形、人物看起来更小。","在摄影/光学里，FOV 常与 focal length（焦距）和 sensor size（感光元件尺寸）相关：焦距越短（广角），FOV 通常越大。"]}
{"word":"fovea","summary":{"en":"Fovea means a small pit; most commonly it refers to the retinal spot for the sharpest central vision.","zh":"fovea 指“小凹窝”；最常见指视网膜的中央凹，是最清晰中心视力所在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pit or depression in the body, especially a tiny area in the retina responsible for the sharpest central vision","zh":"（身体的）小凹窝；尤指视网膜上的中央凹，负责最清晰的中心视力"},"examples":[{"en":"When you read, you rely on your fovea to see the letters sharply.","zh":"阅读时，你主要依靠中央凹来清晰辨认字母。"},{"en":"Damage near the fovea can make it hard to recognize faces or read fine print.","zh":"靠近中央凹的损伤可能会让人难以辨认人脸或阅读小字。"}]}],"synonyms":["central fovea","retinal pit"],"phonetic":"/ˈfoʊviə/","extraExplanation":["“fovea”源自拉丁语，意思是“小坑/小凹”。在日常英语里，如果不在医学或解剖学语境中，最常见的指代就是“眼睛的中央凹（fovea centralis）”。","中央凹是视网膜上视觉最敏锐的区域，因此常与“中央视力（central vision）”一起出现；与之相对的是“周边视力（peripheral vision）”。"]}
{"word":"fovea-based","summary":{"en":"“Fovea-based” describes something designed around the eye’s fovea—the center of sharp vision.","zh":"“fovea-based”指以眼睛中央凹（最清晰视力的中心区域）为基础或围绕其设计的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"based on the fovea (the small central area of the retina responsible for the sharpest vision), or designed to use information from that area","zh":"以中央凹（视网膜中心、负责最清晰视力的小区域）为基础的；基于中央凹信息设计的"},"examples":[{"en":"Fovea-based models predict where people will look in an image.","zh":"基于中央凹的模型可以预测人们在图像中会看向哪里。"},{"en":"The study used fovea-based measurements to analyze reading behavior.","zh":"该研究使用基于中央凹的测量方法来分析阅读行为。"},{"en":"Some compression methods are fovea-based, keeping the center sharp while reducing detail in the periphery.","zh":"有些压缩方法是基于中央凹的：让中心保持清晰，同时降低周边细节。"}]}],"synonyms":["fovea-centered","foveal-based","fovea-driven"],"phonetic":"ˈfoʊviə beɪst","extraExplanation":["“fovea-based”常见于视觉科学、眼动追踪（eye-tracking）、计算机视觉与VR/AR领域，例如“fovea-based rendering（基于中央凹的渲染）/ foveated rendering（中央凹渲染）”。其核心想法是：人眼只有中央凹区域分辨率最高，因此系统把计算/带宽优先分配给注视点附近。"]}
{"word":"foveae","summary":{"en":"Foveae is the plural of fovea, meaning small pits/depressions, especially anatomical ones like those in the retina.","zh":"Foveae 是 fovea 的复数，指小凹窝/小凹陷，尤指解剖结构中的凹（如视网膜中央凹区域）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small pits or depressions in a tissue or structure, especially in anatomy (for example, in the retina).","zh":"（组织或结构中的）小凹窝、小凹陷；尤指解剖学中的凹（如视网膜上的凹）。"},"examples":[{"en":"The doctor examined the retina and noted changes near the foveae.","zh":"医生检查了视网膜，并记录了靠近中央凹（foveae）的变化。"},{"en":"Some bones have tiny foveae where ligaments attach.","zh":"有些骨头上有微小的凹窝（foveae），用于韧带附着。"}]}],"synonyms":["pits","depressions","dimples","indentations"],"phonetic":"/ˈfoʊviˌi/","extraExplanation":["“foveae”是拉丁语来源的复数形式，单数是“fovea”。在日常英语中更常见的说法是“fovea (singular)”或“the fovea of the eye”。","在眼科语境里，“the fovea”通常特指“中央凹”，负责最清晰的中心视力；因此医学文章里常见“foveal (adj.)”如“foveal vision / foveal region”。"]}
{"word":"foveal","summary":{"en":"Foveal means “related to the fovea,” the part of the retina that gives the sharpest central vision.","zh":"foveal 指“与中央凹有关的”，中央凹是视网膜上负责最清晰中央视力的区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the fovea (the small central area of the retina responsible for the sharpest, most detailed vision).","zh":"与中央凹有关的（中央凹是视网膜中央的一小块区域，负责最清晰、最精细的视觉）。"},"examples":[{"en":"Reading small print relies heavily on foveal vision.","zh":"阅读小字很大程度依赖中央凹视觉。"},{"en":"The doctor checked whether the patient’s foveal area was damaged.","zh":"医生检查患者的中央凹区域是否受损。"}]}],"synonyms":["central-vision","retinal (context-dependent)"],"phonetic":"/ˈfoʊviəl/","extraExplanation":["“foveal”主要用于医学与视觉科学语境（如眼科、神经科学、心理学实验）。日常英语里更常说“central vision（中央视力）”来表达类似意思。","词源提示：来自拉丁语“fovea”（意为“小凹/小坑”）。视网膜的中央凹因其凹陷形态得名。","对比理解：foveal vision（中央凹视觉）强调“最清晰的中心点”，peripheral vision（周边视觉）强调“视野边缘、对运动更敏感但细节较弱”。"]}
{"word":"foveas","summary":{"en":"“Foveas” is the plural of “fovea,” most often meaning the retinal pits responsible for the sharpest central vision.","zh":"“foveas”是“fovea”的复数，最常指视网膜的中央凹，负责最清晰的中央视力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small pit in the retina (the fovea centralis) where vision is sharpest; it is responsible for detailed, central vision used for reading and recognizing faces.","zh":"（视网膜的）中央凹：视网膜上一个小凹陷，是视觉最清晰的区域，负责阅读、识别人脸等精细的中央视力。"},"examples":[{"en":"When you read, your eyes place each word on the fovea for the clearest focus.","zh":"阅读时，你的眼睛会把每个词对准中央凹，以获得最清晰的焦点。"},{"en":"Damage near the fovea can make it hard to recognize faces even if side vision is still okay.","zh":"中央凹附近受损会让人难以识别人脸，即使周边视力仍然正常。"}]},{"partOfSpeech":"n.","definition":{"en":"Small pits or depressions in a surface, especially in anatomy (plural of “fovea”).","zh":"（表面上的）小凹或凹陷，尤指解剖学上的小凹（fovea 的复数）。"},"examples":[{"en":"The diagram labels several foveas on the bone surface.","zh":"图中标出了骨表面的几个小凹。"},{"en":"In anatomy class, we learned that some structures have foveas where other parts fit or attach.","zh":"在解剖课上，我们学到有些结构会有小凹，用来让其他部分嵌合或附着。"}]}],"synonyms":["retinal pits","central pits"],"phonetic":"/ˈfoʊviəz/","extraExplanation":["“fovea”来自拉丁语，意思是“小坑、小凹”。在日常英语里最常见的用法是指眼睛视网膜的“中央凹”。","拼写提醒：单数是 fovea，复数是 foveas（也常见较学术的复数 foveae）。"]}
{"word":"foveate","summary":{"en":"Foveate means “having small pits (foveae),” especially in biology/anatomy; it can also mean “to become or make pitted.”","zh":"foveate 指“具有小凹窝/凹点的”，常用于生物学与解剖学；也可作动词表示“形成或使形成凹点”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology/anatomy) Having a fovea (a small pit or depression), or marked by small pits.","zh":"（生物/解剖）具有凹窝（小凹陷）或表面带有小凹点的。"},"examples":[{"en":"Humans have a foveate retina, with a central pit that supports sharp vision.","zh":"人类的视网膜具有中央凹，因此能获得更清晰的视觉。"},{"en":"The botanist described the leaf surface as foveate because it had many tiny pits.","zh":"植物学家把叶片表面描述为“具凹点的”，因为上面有许多细小的凹坑。"}]},{"partOfSpeech":"v.","definition":{"en":"To make pitted; to form or develop small pits (foveae).","zh":"使出现凹点；形成或发展出小凹窝。"},"examples":[{"en":"Over time, the tissue may foveate as the depression deepens.","zh":"随着时间推移，组织可能会逐渐形成凹窝，因为凹陷加深了。"}]}],"synonyms":["pitted","dimpled","depressed","foveated"],"phonetic":"ˈfoʊviˌeɪt","extraExplanation":["“Foveate”来自拉丁语 fovea（小坑、凹窝）。在医学里最常见的相关词是 fovea（中央凹），指眼底视网膜上负责精细视觉的部位；在植物学/昆虫学等描述形态时，也常用它表示“表面带小凹点”。","用法提示：日常英语很少用 foveate，多出现在学术写作或标本描述中。口语里更常见的是 pit/pitted（有坑的）或 dimpled（有酒窝状凹陷的）。"]}
{"word":"foveated","summary":{"en":"Foveated means “center-focused”: highest detail in the middle (where you look), lower detail in the periphery; common in VR/graphics and also used in biology.","zh":"foveated 表示“以中心为重点”：中心（注视处）更清晰、周边较低清晰度；常用于 VR/图形领域，也可用于生物学中“具有中央凹”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed or processed so that the center (where you look) has higher detail than the edges, similar to how human vision is sharpest in the fovea of the retina.","zh":"采用“中央更清晰、周边较低清晰度”的设计或处理方式，类似人眼视网膜中央凹（fovea）处最清晰、周边较模糊的视觉特点。"},"examples":[{"en":"Many VR headsets use foveated rendering to keep images sharp where you’re looking.","zh":"许多 VR 头显使用“注视点渲染”（foveated rendering），让你注视的位置更清晰。"},{"en":"The game supports foveated graphics, so it runs smoother without losing detail in the center.","zh":"这款游戏支持“中央清晰、周边降质”的图形处理，因此运行更流畅，同时不太影响中心细节。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a fovea (a small central pit), especially in anatomy or biology.","zh":"具有中央凹（fovea）的；（尤用于）解剖学或生物学语境。"},"examples":[{"en":"Humans are foveated, meaning our sharpest vision is concentrated in a small central region.","zh":"人类是“具有中央凹”的，这意味着最清晰的视觉集中在一个很小的中心区域。"},{"en":"Foveated vision helps animals focus on details when hunting or reading signals.","zh":"“中央凹视觉”能帮助动物在捕猎或辨识信号时聚焦细节。"}]}],"synonyms":["center-focused","gaze-centered","fovea-based","acuity-centered"],"phonetic":"/ˈfoʊviˌeɪtɪd/","extraExplanation":["“foveated”来自拉丁语 fovea，意为“坑/小凹陷”。在科技语境里最常见的搭配是 foveated rendering（注视点渲染/中央凹渲染）：通常结合眼动追踪，把计算资源集中在你正在看的区域，以提升帧率、降低功耗。","相关词：fovea（中央凹），peripheral vision（周边视觉），gaze-tracking/eye-tracking（注视/眼动追踪）。"]}
{"word":"foveation","summary":{"en":"Foveation is focusing the eyes so an image lands on the fovea for sharp vision; in tech, it can mean concentrating image detail where you’re looking.","zh":"Foveation 指把视线对准目标，使影像落在中央凹以获得最清晰视觉；在技术领域也可指把图像细节集中在注视点附近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of directing the eyes so that an object’s image falls on the fovea (the center of the retina), where vision is sharpest.","zh":"将视线对准目标，使其影像落在中央凹（视网膜中心、视力最清晰处）上的过程。"},"examples":[{"en":"During reading, foveation happens on each word you focus on.","zh":"阅读时，你会对准每一个正在注视的词，这就是注视（foveation）。"},{"en":"Good foveation helps you see fine details, like small print.","zh":"良好的注视能帮助你看清细节，比如小号字体。"}]},{"partOfSpeech":"n.","definition":{"en":"In imaging and graphics, a method of showing high detail near the viewer’s point of gaze and lower detail in the periphery (foveated rendering).","zh":"在成像与图形学中：在注视点附近呈现高细节、在周边视野降低细节的一种方法（如注视点渲染）。"},"examples":[{"en":"VR headsets may use foveation to reduce computer workload.","zh":"VR 头显可能用注视点相关技术来降低计算负担。"},{"en":"With eye tracking, foveation can keep the center sharp while saving power.","zh":"结合眼动追踪，系统可以让中心区域保持清晰，同时节省功耗。"}]}],"synonyms":["fixation","visual fixation","gaze focusing","foveated viewing","foveated rendering"],"phonetic":"/ˌfoʊviˈeɪʃən/","extraExplanation":["“Foveation”来自“fovea”（中央凹）。中央凹位于视网膜中心，负责最清晰的中心视力；而周边视野更擅长感知运动与大致形状，所以人眼会不断通过“扫视（saccades）+停留注视（fixations/foveation）”来获取细节。","在英语里，日常更常见的相关词是“fixation”（注视/凝视），而“foveation”更偏学术与技术语境（视觉科学、眼动研究、VR/AR 渲染等）。"]}
{"word":"foveiform","summary":{"en":"Foveiform means “shaped like a small pit or depression,” used mostly in scientific/medical descriptions.","zh":"foveiform 指“呈小凹/小坑状的”，多用于科学或医学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a shape like a fovea: a small pit or depression, especially one that is shallow and rounded.","zh":"呈小凹（fovea）形的；像小坑/小洼一样的（通常指浅而圆的凹陷）。"},"examples":[{"en":"Under the microscope, the surface looks foveiform, with many tiny pits.","zh":"在显微镜下，这个表面呈小凹形，有许多细小的凹坑。"},{"en":"The doctor described a foveiform change in the tissue.","zh":"医生描述组织出现了小凹形的改变。"}]}],"synonyms":["pit-shaped","depressed","dimpled","foveate"],"phonetic":"/foʊˈviːəˌfɔrm/","extraExplanation":["“foveiform”多见于医学、生物学、解剖学或材料学等较专业语境；日常英语中很少使用。","词源理解：fovea（拉丁语，意为“小坑/小凹”）+ -form（形状）→ “像小凹那样的形状”。","相关词：fovea（名词，小凹/中央凹）、foveal（形容词，与小凹相关的；如 retinal fovea 视网膜中央凹）。"]}
{"word":"fovent","summary":{"en":"Foment means to deliberately stir up trouble or to make negative feelings grow stronger.","zh":"Foment 指蓄意煽动/挑起麻烦，或助长负面情绪使其加剧。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to encourage or stir up (especially trouble, protest, or violence), often secretly or deliberately","zh":"煽动；挑起（尤指骚乱、抗议或暴力），常带有暗中或蓄意的意味"},"examples":[{"en":"Some leaders used social media to foment anger against immigrants.","zh":"一些领导人利用社交媒体煽动对移民的愤怒。"},{"en":"The report warned that false rumors could foment unrest.","zh":"报告警告说，虚假谣言可能会挑起动荡。"},{"en":"He was accused of fomenting conflict between the two groups.","zh":"他被指控在两派之间挑起冲突。"}]},{"partOfSpeech":"vt.","definition":{"en":"to promote the development of a feeling or idea (such as fear or hatred) so that it grows stronger","zh":"助长（某种情绪或观念，如恐惧、仇恨等）使其加剧"},"examples":[{"en":"The constant criticism fomented doubt in her mind.","zh":"持续的批评助长了她内心的怀疑。"},{"en":"Unfair policies can foment resentment over time.","zh":"不公平的政策会随着时间推移助长怨恨。"}]}],"synonyms":["incite","stir up","provoke","instigate","inflame"],"phonetic":"/foʊˈmɛnt/","extraExplanation":["你输入的“fovent”很可能是拼写错误；常见的目标词是 foment（煽动、挑起）。另一个容易混淆的词是 fervent（热烈的、热情的），但含义不同。","foment 常用于较正式的新闻、政治或法律语境，语气偏负面，多与 unrest（动荡）、violence（暴力）、hatred（仇恨）等搭配。","文学/正式写作里常见搭配：foment rebellion（煽动叛乱）、foment discord（挑起不和）、foment a crisis（制造/挑起危机）。"]}
{"word":"foveola","summary":{"en":"Foveola means a very small anatomical pit; in eye anatomy, it is the tiny central depression responsible for the sharpest vision.","zh":"foveola 指解剖学中的小凹陷；在眼科学中，特指中央凹中心的微小凹窝，负责最清晰的视力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small pit or depression (a tiny hollow), especially in anatomy (e.g., in an organ or tissue).","zh":"（小）凹陷；小窝（尤指解剖学中器官或组织上的小凹）"},"examples":[{"en":"Under the microscope, the tissue showed a small foveola near the surface.","zh":"在显微镜下，这块组织表面附近可见一个小凹（foveola）。"},{"en":"The report mentions several foveolae in the mucosal lining.","zh":"报告提到黏膜内衬上有数个小窝（foveolae）。"}]},{"partOfSpeech":"n.","definition":{"en":"In the eye, a very small depression in the center of the fovea (the foveola) that provides the sharpest vision.","zh":"（眼）中央凹小窝：位于中央凹中心的微小凹陷，负责最清晰的视力"},"examples":[{"en":"When you read small print, you rely heavily on the foveola for detail.","zh":"阅读小字号时，你很依赖中央凹小窝（foveola）来分辨细节。"},{"en":"Damage near the foveola can reduce fine visual acuity.","zh":"中央凹小窝附近受损会降低精细视力。"}]}],"synonyms":["small depression","small pit","tiny hollow"],"phonetic":"/ˌfoʊviˈoʊlə/","extraExplanation":["“foveola”来自拉丁语词根：fovea（坑、凹）+ -ola（小词后缀），字面就是“一个小小的凹”。","复数常见形式是“foveolae”（读作类似“foh-vee-OH-lee”），学术写作里常出现。","日常英语中很少用到，多见于医学、解剖学、眼科学或病理报告。"]}
{"word":"foveolae","summary":{"en":"Foveolae are tiny pits or depressions, especially the small central retinal pits responsible for the sharpest vision.","zh":"Foveolae 指微小的凹陷，尤指视网膜中央负责最清晰视力的“小凹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"tiny pits or small depressions; especially the very small central pit in the retina (the foveola) where vision is sharpest (plural of foveola).","zh":"小凹（小凹陷）；尤指视网膜中央最细小的凹陷“中央凹小凹（foveola）”，是视力最清晰的区域（foveola 的复数）。"},"examples":[{"en":"In anatomy class, we learned that the foveolae are crucial for sharp central vision.","zh":"在解剖课上，我们学到中央凹小凹（foveolae）对清晰的中央视力非常关键。"},{"en":"Under the microscope, the tissue surface showed many foveolae—tiny pits scattered across it.","zh":"在显微镜下，组织表面可见许多小凹（foveolae），像细小的坑点散布其上。"}]}],"synonyms":["small pits","tiny depressions","(retinal) foveal pits"],"phonetic":"/ˌfoʊviˈoʊli/","extraExplanation":["“foveola”来自拉丁语，含义是“很小的凹/小坑”，是“fovea（凹）”的指小形式；复数写作“foveolae”，是拉丁式复数拼写，常见于医学与生物学术语中。","在视觉科学里常见搭配是“(central) foveola”，指黄斑中心最精细的区域，负责阅读、辨识细节等高分辨率视觉。日常英语更常用“fovea”，而“foveola(e)”更偏学术与医学语境。"]}
{"word":"foveolar","summary":{"en":"Foveolar means “related to a small pit (foveola),” most commonly the pits in the stomach lining.","zh":"foveolar 指“与小凹/小窝（foveola）有关的”，最常见于描述胃黏膜的胃小凹结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a small pit or depression (a foveola), especially the tiny pits in the stomach lining (gastric foveolae) or similar structures in anatomy.","zh":"与“小凹/小窝”（foveola）有关的；尤指胃黏膜表面的胃小凹（胃小窝）等解剖结构。"},"examples":[{"en":"The biopsy showed foveolar epithelium with mild inflammation.","zh":"活检显示胃小凹上皮，并伴有轻度炎症。"},{"en":"Pathologists often describe changes in the gastric mucosa as foveolar when the surface pit region is involved.","zh":"当胃黏膜表层的小凹区域受累时，病理学家常用“foveolar（胃小凹相关的）”来描述这些改变。"}]}],"synonyms":["foveolate (related term)","pit-related (general paraphrase)"],"phonetic":"/foʊˈviːələr/","extraExplanation":["“foveolar”主要出现在医学/病理学语境中，最常见的搭配是“foveolar epithelium”（胃小凹上皮）和“foveolar hyperplasia”（胃小凹上皮增生），用于描述胃黏膜表面与胃小凹区域的细胞与形态变化。","词根来自拉丁语“fovea”（小坑、凹陷）；“foveola”是其指小形式（更小的凹）。在不同解剖部位也可能借用这一“凹/窝”概念，但临床上最常指胃的结构。"]}
{"word":"foveolarious","summary":{"en":"A very rare adjective meaning “related to a foveola (a tiny pit),” mainly in anatomical/medical contexts.","zh":"一个非常罕见的形容词，意为“与小凹（foveola）有关的”，主要见于解剖/医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/nonce) Relating to a foveola—a very small pit or depression, especially in anatomy (such as the tiny pit in the retina or small pits in stomach lining).","zh":"（罕见/临时造词）与“小凹（foveola）”有关的；指非常小的凹陷或小窝，常见于解剖学语境（如视网膜中央凹的小凹或胃黏膜的小凹）。"},"examples":[{"en":"The report described a foveolarious pattern in the gastric lining under the microscope.","zh":"报告描述了在显微镜下胃黏膜呈现一种与胃小凹相关的形态模式。"},{"en":"He jokingly called the subtle indentation a “foveolarious” detail.","zh":"他开玩笑把那道细微的凹陷称作“foveolarious”的小细节。"}]}],"synonyms":["foveolar","foveolate","pitted"],"phonetic":"/ˌfoʊviəˈlɛriəs/","extraExplanation":["这个词在标准英语里非常少见，更多像是基于医学/解剖学词根 foveola（小凹）加上形容词后缀 -ous 临时造出来的词；正式写作中更常用 foveolar（与小凹有关的）。","foveola 常见于两类语境：①眼科：指黄斑中心凹内更小的“中央小凹”；②病理/胃肠：指胃黏膜表面的“胃小凹（foveolae）”。如果你是在论文或病理报告里看到它，很可能作者想表达“foveolar（小凹样/与小凹相关）”。"]}
{"word":"foveolas","summary":{"en":"“Foveolas” means small pit-like depressions, often used in anatomy (e.g., tiny areas in the retina).","zh":"“Foveolas”指“小凹/小凹陷”，常用于解剖学语境（如视网膜中的微小凹状区域）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small pits or depressions; especially tiny pit-like areas in anatomy (such as in the retina).","zh":"小凹；小凹陷（尤指解剖学中的微小凹状结构，如视网膜中的小凹区）。"},"examples":[{"en":"The surgeon examined the foveolas in the retina for signs of damage.","zh":"外科医生检查视网膜中的小凹区（foveolas），看是否有受损迹象。"},{"en":"Under the microscope, the tissue surface showed many foveolas.","zh":"在显微镜下，组织表面显示出许多小凹陷。"}]}],"synonyms":["small pits","depressions","dimples","indentations"],"phonetic":"/ˌfoʊviˈoʊləz/","extraExplanation":["“Foveolas”是“foveola”的复数。词根来自拉丁语 *fovea*（“坑、凹”），加上表示“更小”的后缀，强调“非常小的凹陷”。","在视觉解剖语境中，*foveola* 常用来指黄斑中心最精细视力所在的更小区域（与 *fovea* 相关但范围更小），因此多见于医学/生物学文章。"]}
{"word":"foveolate","summary":{"en":"Foveolate means “minutely pitted,” describing a surface with many tiny shallow depressions, often in scientific descriptions.","zh":"Foveolate 指“表面布满细小浅凹点”，多用于科学语境中描述表面纹理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small pits or shallow depressions on the surface; minutely pitted (often used in biology/botany to describe texture).","zh":"表面有许多细小凹点的；微凹的（常用于生物学/植物学描述表面质地）。"},"examples":[{"en":"Under the microscope, the seed coat looked distinctly foveolate.","zh":"在显微镜下，种皮看起来明显呈微凹状。"},{"en":"The insect’s shell is foveolate, with tiny pits that catch the light.","zh":"这种昆虫的外壳是微凹的，细小凹点会反光。"}]}],"synonyms":["minutely pitted","pitted","foveate","punctate"],"phonetic":"/foʊˈviːəˌleɪt/","extraExplanation":["词源提示：foveolate 来自拉丁语 fovea（“小坑、凹穴”），后缀 -ate/-olate 有“具有……特征”的意思。它比 pitted 更偏学术/描写性，常见于植物学、昆虫学等对表面纹理的精确描述。","相关词辨析：foveolate 通常指“许多细小浅坑”；若凹坑更深更明显，学术写作中也可能用 foveate（凹坑状）或 punctate（点状/点刻状）来区分。"]}
{"word":"foveolated","summary":{"en":"Foveolated means “finely pitted,” describing a surface covered with many tiny shallow depressions, often in scientific descriptions.","zh":"Foveolated 指“表面布满细小凹点/小坑”的，多用于科学描写（如植物、昆虫等的表面纹理）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having many small pits or shallow depressions on the surface; finely pitted.","zh":"（表面）有许多小凹点的；细小坑洼状的。"},"examples":[{"en":"Under the microscope, the seed coat looks foveolated, with tiny pits across its surface.","zh":"在显微镜下，种皮呈现出小凹点密布的 foveolated（细小坑洼状）表面。"},{"en":"The beetle’s wing covers are foveolated, which helps scientists identify the species.","zh":"这种甲虫的鞘翅表面呈 foveolated（细小凹点状），这有助于科学家鉴定物种。"}]}],"synonyms":["pitted","dimpled","punctate","foveate"],"phonetic":"/foʊˈviəleɪtɪd/","extraExplanation":["这个词多见于生物学、植物学、昆虫学等描述性写作中，用来精确描写“表面纹理”。日常英语里很少用。","词源来自拉丁语 foveola（“小坑、小窝”），相关词有 fovea（“凹窝；中央凹”）。"]}
{"word":"foveole","summary":{"en":"A rare anatomical term meaning a tiny pit or depression; often a variant of “foveola.”","zh":"较少见的解剖学词，指微小凹陷/小窝；常被当作 foveola 的变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pit or depression in a surface, especially a tiny anatomical depression (often used in medical/anatomy contexts).","zh":"（表面上的）小凹陷、小窝；尤指解剖学上的微小凹陷（常见于医学/解剖语境）。"},"examples":[{"en":"Under the microscope, the tissue showed several tiny foveoles.","zh":"在显微镜下，这些组织呈现出几个微小的凹窝。"},{"en":"The doctor explained that a foveole is simply a small natural indentation.","zh":"医生解释说，foveole 只是一个自然形成的小凹陷。"}]}],"synonyms":["foveola","fovea","pit","depression","indentation"],"phonetic":"/ˌfoʊviˈoʊl/","extraExplanation":["foveole 是比较少见的词形，常被视为 foveola 的变体（都来自拉丁语 fovea，意为“坑、凹陷”）。在眼科里更常见的是 fovea / foveola：它们指视网膜黄斑中央的凹陷区域，与最清晰的中央视力有关。"]}
{"word":"foveoles","summary":{"en":"Foveoles are small pits or tiny depressions on a surface (plural of foveole), often used in anatomy or biology.","zh":"Foveoles 指表面上的细小凹点/凹陷（foveole 的复数），常见于解剖学或生物学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small pits or depressions on a surface, especially in anatomy or biology (plural of foveole).","zh":"（foveole 的复数）小凹点、小坑洼；指表面上的细小凹陷，尤用于解剖学或生物学语境。"},"examples":[{"en":"Under the microscope, the leaf surface shows many tiny foveoles.","zh":"在显微镜下，叶片表面可以看到许多细小的凹点。"},{"en":"The report describes foveoles in the tissue as a normal structural feature.","zh":"报告把该组织中的小凹陷描述为一种正常的结构特征。"}]}],"synonyms":["small pits","tiny depressions","pits","dimples (sometimes)"],"phonetic":"/ˈfoʊvi.oʊlz/","extraExplanation":["“foveole”来自拉丁语 *foveola*（“小坑、小凹处”），与更常见的“fovea”（如视网膜中央凹 *fovea*）同源。学术写作里常用其复数形式“foveoles”来描述许多微小凹陷。"]}
{"word":"foveolet","summary":{"en":"A scientific term meaning a very small pit or depression, a tiny fovea-like structure.","zh":"学术用语，指非常小的凹坑/凹陷，即微小的“凹窝（中央凹样结构）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pit, depression, or tiny fovea (especially a small fovea-like structure in anatomy, such as on the retina, or in scientific descriptions of surfaces).","zh":"（尤用于解剖学或科学描写中）小凹、小窝；类似“中央凹”的微小凹陷结构。"},"examples":[{"en":"Under the microscope, the tissue showed a small foveolet on its surface.","zh":"在显微镜下，这块组织表面显示出一个小凹窝（foveolet）。"},{"en":"The report describes a foveolet-like depression near the center of the retina.","zh":"报告描述了视网膜中央附近一个类似小凹的凹陷结构。"}]}],"synonyms":["foveola","small depression","pit","dimple"],"phonetic":"/ˌfoʊviˈoʊlɪt/","extraExplanation":["词源提示：foveolet 来自拉丁语词根 fovea（“凹坑、凹窝”），加上表示“小”的后缀，意思就是“很小的凹陷”。在现代英语中它偏学术/科技用语，常见于解剖学、医学或形态学描述，而不是日常口语。"]}
{"word":"foveolets","summary":{"en":"“Foveolets” means tiny pits or depressions, mainly used in anatomical or medical contexts.","zh":"“Foveolets”指微小的凹陷/小窝，多用于解剖或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small pits or depressions (the plural of foveolet), especially tiny pit-like structures in anatomy (for example, on the retina or on a surface of an organ).","zh":"（foveolet 的复数）小凹、小窝；尤指解剖学中的微小凹陷结构（例如视网膜或器官表面的细小坑状结构）。"},"examples":[{"en":"Under the microscope, the tissue showed several foveolets along the surface.","zh":"在显微镜下，这段组织的表面可见数个小凹。"},{"en":"Some anatomy texts describe foveolets near the main fovea in the retina.","zh":"一些解剖学教材会描述视网膜主凹附近的小凹结构。"}]}],"synonyms":["small pits","tiny depressions","dimples","pits"],"phonetic":"/ˈfoʊviəˌlɛts/","extraExplanation":["词源提示：fovea 意为“凹、窝”（源自拉丁语），-olet 是表示“较小”的后缀，因此 foveolet 可理解为“很小的凹陷”。","使用提醒：这个词在日常英语中极少见，多出现在医学、解剖学或显微结构的学术语境；写作时若面向普通读者，常用 small pits / tiny depressions 来替换更清楚。"]}
{"word":"fovilla","summary":{"en":"“Fovilla” isn’t a standard English word; it’s likely a name or a misspelling of a similar word.","zh":"“fovilla”不是标准英语单词；更可能是专名或与相近词的拼写混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, or a proper name (e.g., a brand or surname).","zh":"不是标准英语单词。可能是拼写错误、用户名，或专有名词（如品牌/姓氏）。"},"examples":[{"en":"I couldn’t find “fovilla” in a dictionary—did you mean “villa” or “flotilla”?","zh":"词典里查不到“fovilla”——你是不是想写“villa（别墅）”或“flotilla（小舰队）”？"},{"en":"If “Fovilla” is a product or place name, please share the context or a sentence.","zh":"如果“Fovilla”是产品名或地名，请提供上下文或造句。"}]}],"synonyms":["villa","flotilla","fovea"],"phonetic":"/foʊˈvɪlə/","extraExplanation":["“fovilla”在常见英语词典中一般查不到。你可能想输入的是：\n- villa /ˈvɪlə/：别墅；度假屋\n- flotilla /floʊˈtɪlə/：小舰队；（小型）船队\n- fovea /ˈfoʊviə/：中央凹（眼睛视网膜上的部位）\n如果你告诉我它出现在哪（文章、游戏、品牌、聊天记录等），我可以更准确判断意思与用法。"]}

