{"word":"fox","summary":{"en":"Fox most commonly means the animal; it can also mean a clever/tricky person, or (as a verb) to confuse or trick someone.","zh":"fox 最常见指“狐狸”这种动物；也可指“狡猾精明的人”，作动词时可表示“使困惑/欺骗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small wild animal with reddish-brown fur, a pointed face, and a bushy tail; known for being quick and clever","zh":"狐狸：一种小型野生动物，常为红褐色毛皮，尖嘴、蓬松大尾巴；常被认为敏捷、聪明"},"examples":[{"en":"We saw a fox at the edge of the forest at dusk.","zh":"黄昏时我们在森林边缘看到了一只狐狸。"},{"en":"A fox’s thick tail helps it stay warm in winter.","zh":"狐狸厚厚的尾巴能帮助它在冬天保暖。"}]},{"partOfSpeech":"n.","definition":{"en":"a very clever or tricky person","zh":"狡猾的人；很精明、很会耍手段的人"},"examples":[{"en":"He’s an old fox—he knows how to get what he wants.","zh":"他是个老狐狸——很懂得怎么达到目的。"}]},{"partOfSpeech":"vt.","definition":{"en":"to confuse or trick someone","zh":"使困惑；欺骗、耍弄（某人）"},"examples":[{"en":"The puzzle really foxed me at first.","zh":"这个谜题一开始把我难住了。"}]}],"synonyms":["vixen","trickster","outwit","confuse"],"phonetic":"/fɑks/","extraExplanation":["在英语文化里，fox 常象征“狡黠、机敏”。在欧洲民间故事（如《列那狐 Reynard the Fox》）里，狐狸常以聪明、爱耍计谋的形象出现，因此 fox 也可以引申为“老狐狸”。","口语里有时会说 someone is a fox，表示“（外貌）很有魅力/很性感”，但这用法较随意，也可能带有物化或不够正式的感觉，使用时要注意场合与对象。"]}
{"word":"fox-proof","summary":{"en":"Fox-proof means built or protected so foxes can’t get in or cause harm.","zh":"fox-proof 指“防狐狸的”，能阻止狐狸进入或造成破坏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed or built so that foxes cannot get in (or cannot damage it); protected against foxes.","zh":"防狐狸的；能阻止狐狸进入或破坏的。"},"examples":[{"en":"They built a fox-proof fence around the chicken coop.","zh":"他们在鸡舍周围建了防狐狸的围栏。"},{"en":"Keep the feed in a fox-proof container so animals can’t steal it.","zh":"把饲料放在防狐狸的容器里，免得动物偷走。"}]}],"synonyms":["fox-resistant","predator-proof (broader)","secure","protected"],"phonetic":"/ˈfɑksˌpruːf/","extraExplanation":["这是一个由名词 + “-proof”构成的复合形容词，意思是“能防……的 / 不受……影响的”，常见类似表达有：waterproof（防水的）、childproof（防儿童误开/防孩子的）、soundproof（隔音的）。","“fox-proof”多见于农业、养殖或户外生活语境（如鸡舍、兔舍、围栏、垃圾桶等），强调结构要足够牢固、缝隙要小、并能防挖洞（狐狸会钻缝和掘洞）。拼写上常用连字符，尤其作定语时：a fox-proof coop。"]}
{"word":"fox-tailed","summary":{"en":"Fox-tailed means having a tail like a fox (long and bushy) or having a foxtail-like shape, often in nature descriptions.","zh":"Fox-tailed 指“像狐狸尾巴一样又长又蓬松的”，也可指“呈狗尾草/狐尾状形状的”，常用于描写外形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a tail like a fox—long and bushy; often used to describe an animal, costume, or anything shaped like a fox’s tail.","zh":"像狐狸尾巴的——又长又蓬松；常用来形容动物、装扮或任何外形像狐狸尾巴的东西。"},"examples":[{"en":"The cat looked almost fox-tailed in winter, with a thick, fluffy tail.","zh":"冬天那只猫的尾巴又厚又蓬松，看起来几乎像狐狸尾巴一样。"},{"en":"She wore a fox-tailed costume for the school play.","zh":"她在学校话剧里穿了一套带狐狸尾巴造型的服装。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shaped like a foxtail (a bushy, tapering shape), especially in descriptions of plants or grasses.","zh":"呈“狗尾草/狐尾状”的（前端渐细、看起来毛茸茸的一种形状），尤用于描写植物或草类。"},"examples":[{"en":"Foxtail grasses have fox-tailed seed heads that can look soft but may be sharp.","zh":"狗尾草的穗看起来像狐尾一样柔软，但有时其实很扎。"}]}],"synonyms":["bushy-tailed","brush-tailed","foxtail-like"],"phonetic":"/ˈfɑksˌteɪld/","extraExplanation":["“fox-tailed”是一个带连字符的复合形容词（fox + tailed），表示“长着……尾巴的/尾巴像……的”。英文里这类结构常用于更生动的描写，比如：long-tailed（长尾的）、white-tailed（白尾的）。","在自然写作或诗歌里，用“fox-tailed”能快速让读者联想到狐狸尾巴的典型意象：蓬松、灵动、野性。"]}
{"word":"foxbane","summary":{"en":"Foxbane is a rare word for a poisonous plant said to repel or kill foxes, sometimes used like “wolfsbane/aconite.”","zh":"Foxbane 是个较少见的词，指一种据说能驱赶或毒死狐狸的植物；有时类似于“狼毒/乌头（wolfsbane/aconite）”的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant believed to be poisonous or harmful to foxes; sometimes used as another name for wolfsbane (aconite) in older or fantasy contexts","zh":"一种被认为对狐狸有毒或有害的植物；在较旧或奇幻语境中有时也用来指“乌头/狼毒”（wolfsbane, aconite）"},"examples":[{"en":"In the old tale, the hunter scattered foxbane near the chicken coop to keep the fox away.","zh":"在那个古老的故事里，猎人把“foxbane”撒在鸡舍附近，想把狐狸赶走。"},{"en":"The fantasy novel mentions foxbane as a dangerous herb kept in a locked cabinet.","zh":"那本奇幻小说里提到“foxbane”是一种危险的草药，被锁在柜子里。"}]}],"synonyms":["wolfsbane","aconite","poisonous herb"],"phonetic":"/ˈfɑːksbeɪn/","extraExplanation":["“-bane”在英语里常表示“祸害、克星、致命之物”（如：wolfsbane“狼毒/乌头”、bane of my life“我人生的克星”）。因此foxbane字面就是“狐狸的克星/毒物”。","在现代日常英语中，foxbane并不常见；更常见的相关词是wolfsbane或aconite。很多时候foxbane出现在民间传说、诗歌或奇幻作品里，用来营造神秘或古风的感觉。"]}
{"word":"foxberries","summary":{"en":"Foxberries are tart red berries, commonly known as lingonberries or cowberries.","zh":"Foxberries 指一种酸味红色浆果，通常也叫 lingonberries（越橘/红莓）或 cowberries（牛莓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, tart red berry (also called a lingonberry or cowberry), used in jams, sauces, and desserts; the fruit of a low evergreen shrub.","zh":"一种小而酸的红色浆果（也叫越橘/红莓、牛莓），常用于果酱、酱汁和甜点；来源于一种矮生常绿灌木。"},"examples":[{"en":"In Sweden, foxberries (lingonberries) are often served as a sauce with meatballs.","zh":"在瑞典，foxberries（越橘/红莓）常被做成酱汁搭配肉丸。"},{"en":"She bought a jar of foxberry jam to spread on toast.","zh":"她买了一罐foxberry果酱抹在吐司上。"},{"en":"The hiking trail was lined with shrubs bearing foxberries in late summer.","zh":"夏末时，这条徒步小径旁的灌木结着foxberries。"}]}],"synonyms":["lingonberries","cowberries","lingonberry","cowberry"],"phonetic":"/ˈfɑksˌbɛriz/","extraExplanation":["“foxberry”在英语里不如“lingonberry”常见，多见于某些地区或旧一些的称呼。日常生活、食谱和包装上更常写“lingonberry”。","这种浆果在北欧与北美部分地区很常见，味道偏酸，常与甜味（糖、蜂蜜）或肉类一起搭配，以平衡口感。"]}
{"word":"foxberry","summary":{"en":"Foxberry is a name for a small red berry—often the lingonberry/cowberry—and the plant it grows on.","zh":"Foxberry 指一种红色小浆果（常对应 lingonberry/cowberry）以及结这种果的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small red berry (often referring to the lingonberry/cowberry) and the low evergreen shrub that produces it","zh":"（常指越橘属的）狐莓；也可指结这种红色小浆果的矮常绿灌木（多对应“越橘/红莓”类，如 lingonberry/cowberry）"},"examples":[{"en":"She made jam from foxberries she picked in the woods.","zh":"她用在林子里采到的狐莓做了果酱。"},{"en":"Foxberry plants grow well in cool northern climates.","zh":"狐莓植株在寒冷的北方气候里长得很好。"}]}],"synonyms":["lingonberry","cowberry"],"phonetic":"/ˈfɑksˌbɛri/","extraExplanation":["“foxberry”不是最常见的标准食物名称，更常见的说法是“lingonberry”或“cowberry”。在不同地区/方言中，“foxberry”可能被用来指代不同的野生浆果（有时也会与 cranberry 等混用），所以在阅读食谱、植物书或旅行信息时，最好结合拉丁学名（如 Vaccinium vitis-idaea）或图片确认具体是哪一种。"]}
{"word":"foxchop","summary":{"en":"“Foxchop” is not a standard English word; it’s most likely a name/handle or a creative coined term.","zh":"“Foxchop”不是标准英文词；更可能是名字/网名或创作出来的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/rare term in English; most commonly seen as a name, handle, or made-up word rather than a dictionary word. If you meant “fox chop” (two words), it could literally mean “a chop (cut of meat) from a fox,” though that usage is extremely uncommon.","zh":"英语中的非标准/罕见用法；最常见是作为名字、网名或自造词出现，而不是词典里的常用词。如果你指的是分开的“fox chop”，字面可理解为“狐狸的排/肉块”，但这种用法极少见。"},"examples":[{"en":"‘Foxchop’ isn’t a standard dictionary word; it may be a username or brand name.","zh":"“Foxchop”不是标准词典词；它可能是用户名或品牌名。"},{"en":"If you meant “fox chop,” it would be a very literal phrase, not a common expression.","zh":"如果你想说“fox chop”（分开写），那会是非常字面的短语，并不是常见表达。"}]}],"phonetic":"ˈfɑkstʃɑp","extraExplanation":["这类拼合词（如把“fox”和“chop”连写）在英文里常见于网名、游戏ID、品牌名或作品中的虚构词。若你能提供出现的语境（例如一句话、标题、游戏技能名等），我可以更准确判断它想表达的含义与用法。"]}
{"word":"foxed","summary":{"en":"“Foxed” most commonly means confused or puzzled; it can also describe old paper/books with brown age spots, or be the past form of “fox” meaning to outsmart/trick.","zh":"“Foxed”常指“困惑/被难住”；也可形容旧纸张或书籍出现褐色斑点；还可作动词“fox”的过去式/过去分词，表示“智胜/欺骗”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Confused, puzzled, or not sure what to do (often after being tricked or surprised).","zh":"困惑的；摸不着头脑的（常指被难住或被耍后）。"},"examples":[{"en":"I was completely foxed by the last question on the test.","zh":"我被考试的最后一道题彻底难住了。"},{"en":"Her sudden change of plan left me foxed.","zh":"她突然改变计划让我很困惑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of paper, photos, or books) marked with brownish spots caused by age, humidity, or chemical changes.","zh":"（纸张、照片或书籍）因年代久远、潮湿或化学变化出现褐色斑点的（即“foxing”）。"},"examples":[{"en":"The pages are foxed, but the text is still clear.","zh":"书页有褐色斑点，但文字仍然清晰。"},{"en":"Collectors prefer copies that aren’t foxed or stained.","zh":"收藏者更喜欢没有斑点或污渍的版本。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “fox”: to trick, outsmart, or defeat by cleverness.","zh":"“fox”的过去式/过去分词：欺骗；智胜；用计难倒。"},"examples":[{"en":"He foxed his opponent with a clever move.","zh":"他用巧妙的一招智胜了对手。"},{"en":"The detective was foxed by the suspect’s alibi at first.","zh":"起初侦探被嫌疑人的不在场证明难住了。"}]}],"synonyms":["puzzled","baffled","confused","perplexed","outwitted","tricked"],"phonetic":"/fɑkst/","extraExplanation":["在旧书与纸品收藏领域，foxed/foxing 是常见术语：指纸面出现黄褐色小斑点或斑块，常与潮湿环境、霉菌活动、纸张中的金属杂质或氧化反应有关。描述品相时常会写“slightly foxed（轻微斑点）”“heavily foxed（严重斑点）”。"]}
{"word":"foxer","summary":{"en":"Foxer usually means a fox hunter; more rarely, it can mean a tricky, sly person.","zh":"Foxer 通常指“猎狐者”；较少见的用法是指“狡猾、爱耍弄人的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fox hunter; someone who hunts foxes (often on horseback with hounds).","zh":"猎狐者；进行猎狐活动的人（常指骑马带猎犬的猎人）。"},"examples":[{"en":"In the countryside, the foxer rode out early with the hounds.","zh":"在乡间，那位猎狐者一大早就带着猎犬出发了。"},{"en":"The film shows a young foxer learning the traditions of the hunt.","zh":"这部电影展示了一位年轻的猎狐者学习狩猎传统。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who tricks or outwits others; someone who “foxes” people.","zh":"（罕见）狡猾地欺骗或智胜他人的人；耍弄他人的人。"},"examples":[{"en":"He wasn’t a villain, just a clever foxer who liked word games.","zh":"他并非反派，只是个喜欢文字游戏、很会耍小聪明的人。"},{"en":"Don’t let a foxer talk you into signing without reading.","zh":"别让狡猾的人把你忽悠得不看清楚就签字。"}]}],"synonyms":["fox hunter","hunter","trickster","schemer","con artist"],"phonetic":"/ˈfɑksər/","extraExplanation":["“foxer”不是现代英语里很常见的日常词。它通常是由“fox（狐狸）”加上表示“……的人”的后缀“-er”构成，所以意思多与“猎狐的人”或“像狐狸一样狡猾的人”相关。","如果你是在口语或网络上看到“foxer”，也可能是人名/网名，或是把别的词（如“boxer”拳击手）写错了；如果能提供一句上下文，我可以帮你更准确判断。"]}
{"word":"foxery","summary":{"en":"Foxery means cunning, sly trickery (and rarely, fox-related activity such as fox-hunting).","zh":"foxery 指“狡猾、诡计（像狐狸一样）”，也可罕见地指与狐狸相关的活动（如猎狐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cunning or tricky behavior; slyness (like a fox).","zh":"狡猾；诡计多端（像狐狸一样的机灵与狡诈）。"},"examples":[{"en":"She saw through his foxery and refused to sign the contract.","zh":"她看穿了他的狡猾伎俩，拒绝签合同。"},{"en":"In the story, the villain wins by foxery rather than strength.","zh":"在故事里，反派靠狡计而不是力量取胜。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Things connected with foxes, especially fox-hunting; fox-related activity.","zh":"（罕见）与狐狸有关的事物，尤指猎狐活动；与狐狸相关的行为。"},"examples":[{"en":"Old memoirs mention “the foxery of the countryside,” meaning local fox-hunting life.","zh":"一些旧回忆录提到“乡间的猎狐生活”（the foxery of the countryside），指当地的猎狐风尚。"}]}],"synonyms":["cunning","trickery","slyness","craftiness","guile"],"phonetic":"/ˈfɑk.sə.ri/","extraExplanation":["“foxery”在现代英语中很少用，更常见的是“cunning / trickery / slyness”。它带有文学或带点戏谑的味道，用来形容“像狐狸一样的狡黠”。","词根“fox-”来自“fox（狐狸）”，后缀“-ery”常表示“行为、做法或相关事物”（如 “trickery”）。因此“foxery”直观上就是“狐狸式的做法/狡计”。"]}
{"word":"foxes","summary":{"en":"“Foxes” is the plural form of “fox,” usually referring to the animal; it can also (informally and somewhat dated) refer to attractive people.","zh":"“Foxes”是“fox”的复数，通常指“狐狸”这种动物；也可在较口语且偏旧的用法里指“很有魅力的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “fox”: a small wild animal with a pointed face, thick fur, and a bushy tail.","zh":"“fox”的复数：狐狸，一种小型野生动物，嘴尖、毛厚、尾巴蓬松。"},"examples":[{"en":"Foxes often come out at dusk to look for food.","zh":"狐狸常在黄昏出来觅食。"},{"en":"We saw foxes crossing the road near the forest.","zh":"我们看到几只狐狸在森林附近过马路。"}]},{"partOfSpeech":"n.","definition":{"en":"In informal speech, “foxes” can mean very attractive people (less common today and can sound dated).","zh":"在非正式用法中，“foxes”可指非常有魅力/好看的人（如今较少见，可能显得有点过时）。"},"examples":[{"en":"In old movies, you might hear someone call a glamorous actress “a fox.”","zh":"在老电影里，你可能会听到有人称一位光彩照人的女演员为“a fox”。"}]}],"synonyms":["fox (singular)","vixen (female fox)"],"phonetic":"/ˈfɑːksɪz/","extraExplanation":["“Fox”在英语文化里常象征“狡猾、机灵”，因此在童话、寓言和文学作品中很常见（例如伊索寓言里的狐狸形象）。","常见搭配：arctic fox（北极狐）、red fox（赤狐）、foxhole（散兵坑/战壕小洞，词源与狐狸洞有关）。"]}
{"word":"foxfeet","summary":{"en":"“foxfeet” means the feet (paws) of a fox, and by extension the tracks or light steps a fox makes.","zh":"“foxfeet”指狐狸的脚（爪子），也可引申为狐狸的足迹或轻快的脚步。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the feet (paws) of a fox; also written as “fox feet.”","zh":"狐狸的脚（爪子）；也可写作“fox feet”。"},"examples":[{"en":"We found foxfeet prints in the snow near the fence.","zh":"我们在栅栏附近的雪地里发现了狐狸脚印。"},{"en":"In the story, the hunter followed the foxfeet tracks into the woods.","zh":"在故事里，猎人沿着狐狸的足迹走进了森林。"}]},{"partOfSpeech":"n.","definition":{"en":"(poetic or descriptive) a fox’s quick, light steps or the trail it leaves behind.","zh":"（诗意/描写用法）指狐狸轻快敏捷的步伐，或它留下的踪迹。"},"examples":[{"en":"The poem describes foxfeet stitching a thin line across the winter field.","zh":"诗里写狐狸的脚步像缝线一样，在冬日的田野上缝出一条细细的轨迹。"},{"en":"At dawn, foxfeet marked the garden beds like quiet signatures.","zh":"黎明时分，狐狸的足迹在花圃上留下安静的“签名”。"}]}],"synonyms":["fox paws","fox tracks","fox prints","fox paw prints"],"phonetic":"/ˈfɑksˌfit/","extraExplanation":["“foxfeet”并不是最常见的标准拼写；更常见的是分开写“fox feet”。在英语里，foot 的复数是 feet，所以“fox + feet”组合时就会出现这种不规则复数形式。","如果你是想表达“狐狸脚印”，更自然的说法是：fox tracks / fox prints / fox paw prints。"]}
{"word":"foxfinger","summary":{"en":"“Foxfinger” is not a standard English word; it’s usually a creative/proper name and is understood from context.","zh":"“Foxfinger”不是标准常用英语词，多半是自造词或专有名词，需要结合语境理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare/Nonstandard) A compound word that would literally mean “a fox’s finger.” It is not a common English vocabulary word and is usually understood only by context (e.g., a nickname, fantasy term, or creative writing).","zh":"（罕见/非标准用法）复合词，字面意思是“狐狸的手指/爪指”。它不是常见英语词汇，通常只能依靠语境理解（如昵称、奇幻作品用语或文学创作）。"},"examples":[{"en":"In the story, Foxfinger was the thief’s nickname.","zh":"在故事里，Foxfinger 是那个小偷的绰号。"},{"en":"The game includes a character called Foxfinger.","zh":"这款游戏里有个角色叫 Foxfinger。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A name (e.g., a surname, username, or brand name).","zh":"（专有名词）人名/姓氏、用户名或品牌名等。"},"examples":[{"en":"I found the account under the name Foxfinger.","zh":"我在 Foxfinger 这个名字下找到了那个账号。"}]}],"synonyms":["nickname","screen name","proper name"],"phonetic":"/ˈfɑksˌfɪŋɡɚ/","extraExplanation":["“foxfinger”在词典中通常查不到，更多见于用户名、角色名或自造词。如果你是在阅读中遇到它，最可靠的办法是看上下文：它是在指人名/外号，还是某个物品/角色？","也可能是拼写或听写误差：你想找的词有时可能是“foxglove”（一种植物，中文常译“毛地黄”）或其他以“fox-”开头的词。你可以把遇到它的句子发来，我可以帮你判断更准确的意思。"]}
{"word":"foxfire","summary":{"en":"Foxfire is a faint natural glow on decaying wood (from bioluminescent fungi), and it can also mean a mysterious folkloric light.","zh":"foxfire 指腐朽木头上由发光真菌产生的微光，也可指民间传说中的神秘“鬼火”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural greenish-blue light sometimes seen at night over decaying wood, caused by bioluminescent fungi.","zh":"（自然现象）“狐火”：夜间在腐朽木头上有时可见的蓝绿色微光，通常由会发光的真菌生物发光引起。"},"examples":[{"en":"We saw a faint foxfire glow on the fallen log during our night hike.","zh":"我们夜间徒步时，在倒下的木头上看到了微弱的狐火。"},{"en":"Old stories called it foxfire, but scientists explain it as fungal bioluminescence.","zh":"老故事把它叫作“狐火”，但科学家解释这是由真菌生物发光造成的。"}]},{"partOfSpeech":"n.","definition":{"en":"A mysterious, ghostlike light (often in folklore), similar to the idea of “will-o’-the-wisp.”","zh":"（民间传说）神秘、像鬼火一样的光，常与“will-o’-the-wisp（鬼火）”的概念相近。"},"examples":[{"en":"In the folktale, travelers followed foxfire and got lost in the swamp.","zh":"在民间故事里，旅人追着狐火走，结果在沼泽里迷了路。"},{"en":"The poem compares her lantern to foxfire—beautiful but hard to trust.","zh":"诗中把她的灯比作狐火——美丽，却不太可靠。"}]}],"synonyms":["bioluminescence","will-o'-the-wisp","ignis fatuus"],"phonetic":"/ˈfɑksˌfaɪr/","extraExplanation":["“foxfire”在现代更常指“腐木发光”（由发光真菌造成），属于自然界的生物发光现象；民俗意义上的“狐火/鬼火”则更偏向传说与象征。","英语里也常用“will-o’-the-wisp”指引人误入歧途的“鬼火”，在写作中常被借喻为“迷人的假象、难以捉摸的希望”。"]}
{"word":"foxfires","summary":{"en":"“Foxfire” is the faint natural glow on rotting wood caused by bioluminescent fungi; it can also mean a dim, eerie light in literature.","zh":"“Foxfire”指腐木上由发光真菌产生的微弱磷光；在文学中也可比喻幽微、诡异的光。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural, faint greenish glow seen on decaying wood, caused by bioluminescent fungi (especially in dark forests).","zh":"（尤指黑暗森林里）腐朽木头上出现的微弱绿色磷光，由会发光的真菌（生物发光）引起。"},"examples":[{"en":"We noticed a soft foxfire shining on the fallen log after sunset.","zh":"日落后，我们注意到倒下的树干上有柔和的腐木磷光。"},{"en":"The campsite was quiet, and the foxfire made the woods look magical.","zh":"营地很安静，腐木磷光让树林看起来像魔法世界。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) A dim, eerie light or glow, used metaphorically to describe something ghostly, weak, or mysterious.","zh":"（文学用法）幽微、诡异的光芒；常作比喻，形容鬼魅般、微弱或神秘的亮光。"},"examples":[{"en":"A foxfire of hope remained in his voice even after the bad news.","zh":"即使听到坏消息，他的声音里仍残留一丝微弱的希望。"},{"en":"The old hallway held only the foxfire of a dying lantern.","zh":"老走廊里只剩下一盏将熄灯笼的幽微光亮。"}]}],"synonyms":["bioluminescence","faint glow","cold light","eerie glow"],"phonetic":"/ˈfɑksˌfaɪɚ/","extraExplanation":["“foxfire”并不是“狐狸的火”。它指的是腐木上真菌发出的冷光（生物发光）。这种现象在英语里常被写进森林、夜晚、神秘氛围的描写中。","常见用法：单数 foxfire；复数 foxfires（你输入的就是复数形式）。","相关词：bioluminescence（生物发光，较正式/科学），glow-in-the-dark fungi（会发光的真菌，较口语说明）。"]}
{"word":"foxfish","summary":{"en":"“Foxtfish/foxfish” is an uncommon, regional common name for certain fish; what it refers to can vary by place.","zh":"“foxfish/foxfish”是不太常见的地区性鱼类俗名，具体指哪种鱼会因地区而不同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common-name (non-scientific) term for certain fish species in some regions, often fish thought to look “fox-like” (for example, having a pointed snout or reddish color). Usage is uncommon and can vary by location.","zh":"（非学名的）俗名：在某些地区用来称呼某些鱼类的名称，通常指外形被认为“像狐狸”的鱼（如嘴部较尖或颜色偏红等）。该词较少见，且因地区而异。"},"examples":[{"en":"Local fishermen call this species a foxfish, but field guides may list it under a different common name.","zh":"当地渔民把这种鱼叫作 foxfish，但在图鉴里它可能用的是另一个俗名。"},{"en":"I searched for “foxfish,” and the results depended on the country and the website.","zh":"我搜索“foxfish”，结果会因国家和网站不同而变化。"}]}],"synonyms":["foxfish"],"phonetic":"ˈfɑːksˌfɪʃ","extraExplanation":["“foxfish/foxfish”并不是一个非常标准或全球通用的英语鱼名，常见于地方性叫法或少量资料中；不同地区可能指向不同物种。","它也很容易与更常见的鱼名混淆，例如 boxfish（箱鲀/箱鱼）或 foxface（狐面兔鱼，常写作 foxface rabbitfish）。如果你能提供图片、产地或上下文（海水/淡水、外观特征），我可以帮你更准确地对照对应物种或更常用的英文名。"]}
{"word":"foxfishes","summary":{"en":"“Foxfishes” means more than one foxfish (a local/common name for certain fish).","zh":"“foxfishes”表示“foxfish”的复数，即多条被俗称为“狐鱼/狐狸鱼”的鱼（具体物种可能因地区而异）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of foxfish: fish that are called “foxfish” (the exact species can vary by region and local naming).","zh":"“foxfish”的复数：被称为“狐鱼/狐狸鱼”的鱼类（具体指哪一种鱼会因地区与俗名而不同）。"},"examples":[{"en":"Local fishermen say foxfishes are more common near the rocky shore in spring.","zh":"当地渔民说，春天在多岩的海岸附近更常见到foxfishes（狐鱼/狐狸鱼）。"},{"en":"The menu listed grilled foxfishes, but the server couldn’t name the exact species.","zh":"菜单上写着烤foxfishes（狐鱼/狐狸鱼），但服务员说不出确切是哪种鱼。"}]}],"synonyms":["foxfish (singular)","local/common-name fish (context-dependent)"],"phonetic":"/ˈfɑksˌfɪʃɪz/","extraExplanation":["“foxfish”不是一个非常标准、全球通用的鱼类学名称，更常见于地方俗称或旧文献中；因此你在不同地区看到的“foxfish”可能对应不同物种。","如果你是在科学/水产语境里使用，建议补充学名（拉丁名）或上下文地点，以避免歧义。"]}
{"word":"foxglove","summary":{"en":"Foxglove is a tall flowering plant with tube-shaped blossoms, popular in gardens but poisonous if eaten.","zh":"Foxglove 指毛地黄：一种管状花序的高大观赏植物，但误食有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall plant with long spikes of tube-shaped flowers (often purple, pink, or white); it is commonly grown in gardens but is poisonous if eaten","zh":"毛地黄（一种高大的开花植物，花呈管状，常为紫/粉/白色；常见于花园，但误食有毒）"},"examples":[{"en":"Foxgloves bloom in early summer and attract bees to the garden.","zh":"毛地黄在初夏开花，会吸引蜜蜂来到花园。"},{"en":"Keep children and pets away from foxglove plants because they are poisonous.","zh":"要让孩子和宠物远离毛地黄，因为它有毒。"}]}],"synonyms":["digitalis"],"phonetic":"/ˈfɑksˌɡlʌv/","extraExplanation":["“foxglove”直译像“狐狸的手套”。一种常见说法是花朵像手指套/手套，因此得名；也有人把它与民间传说中的精灵（fairies）联系起来。","毛地黄（Digitalis）含有强心苷类成分，曾被用于提取强心药物（如地高辛 digoxin）。这属于医疗用途的专业领域：植物本身不可随意食用或自制药物。"]}
{"word":"foxgloves","summary":{"en":"Foxgloves are tall, bell-flowered plants (Digitalis); the word can also refer to the plant as the historical source of the heart medicine digitalis.","zh":"Foxgloves 指毛地黄（Digitalis）这类高大钟形花植物；也可指其作为强心药“洋地黄（digitalis）”的历史来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of foxglove) A tall flowering plant with long spikes of bell-shaped flowers, often grown in gardens; many species are in the genus Digitalis.","zh":"（foxglove 的复数）一种高大的开花植物，花呈钟形并成穗状生长，常见于花园；多属毛地黄属（Digitalis）。"},"examples":[{"en":"Foxgloves bloom in early summer and attract bees.","zh":"毛地黄在初夏开花，会吸引蜜蜂。"},{"en":"The garden path was lined with pink and purple foxgloves.","zh":"小径两旁种着粉色和紫色的毛地黄。"}]},{"partOfSpeech":"n.","definition":{"en":"A source of the heart medicine digitalis (historically made from foxglove leaves); used in medical contexts.","zh":"（医学/历史用法）毛地黄是强心药“洋地黄（digitalis）”的来源之一（传统上由叶片提取）。"},"examples":[{"en":"Early physicians studied foxgloves for their effects on the heart.","zh":"早期的医生研究毛地黄对心脏的作用。"},{"en":"Today, drugs derived from foxgloves must be carefully dosed.","zh":"如今，由毛地黄提取或相关的药物必须严格控制剂量。"}]}],"synonyms":["foxglove","Digitalis","bellflower (informal, not exact)"],"phonetic":"/ˈfɑksˌɡlʌvz/","extraExplanation":["“Foxglove”这个名字常被解释为“狐狸的手套”，带有民间传说色彩；在英国等地也与精灵（fairies）故事有关。","毛地黄植物具有毒性，误食可能危险；在学习或园艺语境里常会提醒“漂亮但有毒”。","在文学描写中，foxglove 常用来营造林地、乡间花园的浪漫或神秘氛围（常与野花、林缘环境一起出现）。"]}
{"word":"foxhole","summary":{"en":"A foxhole is a small dugout shelter soldiers use for cover in combat.","zh":"foxhole 指士兵在战斗中挖的散兵坑，用来隐蔽和防护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small hole dug in the ground for a soldier to hide in and protect themselves from enemy fire; a simple defensive shelter.","zh":"（战场上的）散兵坑；士兵挖在地上的小坑，用来隐蔽并躲避敌方火力的简易防御掩体。"},"examples":[{"en":"The soldiers waited in their foxholes until the shelling stopped.","zh":"士兵们躲在散兵坑里，直到炮击停止。"},{"en":"He lay low in a foxhole, listening for footsteps.","zh":"他趴在散兵坑里，侧耳听是否有人靠近。"}]}],"synonyms":["fighting hole","dugout (military)","defensive position","shelter pit"],"phonetic":"/ˈfɑksˌhoʊl/","extraExplanation":["“foxhole”字面是“狐狸洞”，因为它像动物的洞一样低矮、隐蔽。现代英语里主要是军事用语，常让人联想到一战、二战以及战壕战的场景。","它也常出现在引申表达里，例如：\"There are no atheists in foxholes\"（常被译为“炮火下没有无神论者”），意思是在极端危险和恐惧中，人们往往会寻求信仰或精神依靠。"]}
{"word":"foxholes","summary":{"en":"Foxholes are small protective holes dug by soldiers; figuratively, they can mean any terrifying, high-pressure situation.","zh":"Foxholes 指士兵为躲避火力挖的散兵坑；也可比喻令人恐惧、压力极大的处境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hole or small trench dug in the ground to protect a soldier from enemy fire.","zh":"（战场上的）散兵坑；单兵掩体（挖在地面上用来躲避敌方火力）"},"examples":[{"en":"The soldiers stayed in their foxholes during the artillery attack.","zh":"炮击时，士兵们待在散兵坑里躲避。"},{"en":"They dug foxholes along the ridge before nightfall.","zh":"天黑前，他们沿着山脊挖好了散兵坑。"}]},{"partOfSpeech":"n.","definition":{"en":"A difficult or dangerous situation where people act out of fear, often used in the phrase “there are no atheists in foxholes.”","zh":"（比喻）极度危险或恐惧的处境；常见于“战壕里没有无神论者”（指人在生死关头更容易寻求信仰或慰藉）"},"examples":[{"en":"In the foxholes of the recession, many families cut every expense they could.","zh":"在经济衰退的“战壕”里，许多家庭把能省的开销都省了。"},{"en":"He quoted “there are no atheists in foxholes” to describe how fear can change people.","zh":"他用“战壕里没有无神论者”来说明恐惧如何改变人。"}]}],"synonyms":["fighting position","defensive position","trench","dugout"],"phonetic":"/ˈfɑkˌshoʊlz/","extraExplanation":["“Foxhole”原指为隐蔽与防护而挖的浅坑，词里有“fox（狐狸）+ hole（洞）”的形象感：像狐狸一样躲进洞里以求安全。复数是foxholes。","“There are no atheists in foxholes”常被认为源于二战时期的口语表达（后被牧师与作家反复引用）。它并非严谨的宗教论证，更像是一句强调“生死关头人会寻找精神依靠”的俗语；使用时注意语境与尊重不同信仰/无信仰立场。","在文学与战争报道中，foxhole常用来传达前线的紧张与脆弱感；引申义则把任何“高压、不得不自保的处境”比作战场掩体。"]}
{"word":"foxhound","summary":{"en":"A foxhound is a scent-tracking hunting dog bred to chase foxes.","zh":"foxhound 指一种靠嗅觉追踪、专为追赶狐狸培育的猎犬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, fast dog (or breed of dog) trained to track and chase foxes, usually by scent","zh":"（通常指靠嗅觉追踪的）猎狐犬；用于追踪和追赶狐狸的大型快跑猎犬"},"examples":[{"en":"A foxhound can follow a scent trail for miles.","zh":"猎狐犬能沿着气味踪迹追出好几英里。"},{"en":"The pack of foxhounds waited for the hunt to begin.","zh":"一群猎狐犬等着狩猎开始。"}]}],"synonyms":["hound","scent hound","hunting dog"],"phonetic":"/ˈfɑkˌshaʊnd/","extraExplanation":["“foxhound”常和英国传统的“fox hunting（猎狐）”文化相关：骑马的人带着一群猎狐犬追踪狐狸。由于动物福利争议，英国在2004年通过《Hunting Act》对以犬群追猎野生哺乳动物作出严格限制，所以现在更多在历史、文学或讨论传统习俗时出现。"]}
{"word":"foxhounds","summary":{"en":"Foxhounds are dogs (often a pack) trained to track and chase foxes, traditionally for fox hunting.","zh":"Foxhounds 指受训练追踪并追逐狐狸的猎狐犬（常成群出现），传统上用于猎狐活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dogs (hounds) trained to track and chase foxes, traditionally used in fox hunting.","zh":"（传统猎狐用的）猎狐犬；受训练用来追踪并追逐狐狸的猎犬。"},"examples":[{"en":"The foxhounds picked up the scent and ran into the woods.","zh":"猎狐犬闻到气味后冲进了树林。"},{"en":"In old stories, the foxhounds howled as the hunt began.","zh":"在一些古老故事里，猎狐犬在狩猎开始时嚎叫。"}]},{"partOfSpeech":"n.","definition":{"en":"A group (pack) of foxhounds owned or kept together for hunting or sport.","zh":"（作为一个群体的）一群猎狐犬；（同一主人饲养的）猎狐犬队。"},"examples":[{"en":"A pack of foxhounds can cover a lot of ground quickly.","zh":"一群猎狐犬能很快搜遍很大的范围。"},{"en":"The local club maintained foxhounds for weekend hunts.","zh":"当地俱乐部为周末狩猎饲养猎狐犬。"}]}],"synonyms":["hounds","hunting dogs","pack hounds"],"phonetic":"/ˈfɑkshaʊndz/","extraExplanation":["“foxhounds”是复数形式，单数是“foxhound”。","猎狐在英国上层社会历史中较常见，但因动物福利与环保争议，现代很多地区已限制或禁止传统“以犬追狐”的狩猎方式。文学与影视中常把“foxhounds”用来营造乡村庄园、贵族传统或追逐紧张感的氛围。"]}
{"word":"foxhunt","summary":{"en":"Foxhunt means hunting foxes—often referring to the traditional sport with horses and hounds—and it can be both a noun (the event) and a verb (to do it).","zh":"foxhunt 指“猎狐”，常特指骑马带猎犬的传统活动；既可作名词表示活动本身，也可作动词表示去猎狐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hunt for a fox, traditionally using riders on horseback and a pack of hounds (dogs)","zh":"猎狐；（传统上）骑马带猎犬追捕狐狸的活动"},"examples":[{"en":"The village held a traditional foxhunt every autumn.","zh":"这个村庄每年秋天都会举办一次传统的猎狐活动。"},{"en":"Foxhunts are often discussed in debates about animal welfare.","zh":"猎狐常常出现在有关动物福利的讨论中。"}]},{"partOfSpeech":"v.","definition":{"en":"to hunt foxes, especially in the traditional horseback-and-hounds style","zh":"猎狐；（尤指）以骑马带猎犬的传统方式追捕狐狸"},"examples":[{"en":"They used to foxhunt on weekends when he lived in the countryside.","zh":"他住在乡下时，他们过去周末会去猎狐。"}]}],"synonyms":["fox hunting","hunt","hunting"],"phonetic":"/ˈfɑːksˌhʌnt/","extraExplanation":["“foxhunt/fox hunting”在英国历史与乡绅文化中很常见，常与骑马、猎犬、红色猎装等形象相连，因此在文学与影视作品里常被用来表现阶层、传统与乡村生活。","在一些地区，传统“用猎犬追逐并杀死狐狸”的做法因动物保护争议而受到限制或改为不致死的形式（例如“drag hunting”沿人工气味路线追踪）。因此在阅读新闻或文章时，要注意它可能带有社会与伦理讨论的语境。"]}
{"word":"foxie","summary":{"en":"“Foxie” is an informal spelling of “foxy,” meaning playfully attractive; it can also be a flirty nickname.","zh":"“foxie”是“foxy”的非正式拼写，表示俏皮地迷人；也可作带调情意味的昵称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Attractive in a playful, sexy way (informal spelling of “foxy”).","zh":"性感、迷人（非正式拼写，等同于“foxy”）。"},"examples":[{"en":"That jacket looks really foxie on you.","zh":"那件夹克你穿起来真的很迷人。"},{"en":"He gave a foxie smile and walked away.","zh":"他露出一个撩人的微笑就走开了。"}]},{"partOfSpeech":"n.","definition":{"en":"A playful nickname for someone seen as cute or attractive (informal; can sound flirty).","zh":"对某个可爱或有魅力的人的昵称（非正式；可能带调情意味）。"},"examples":[{"en":"Morning, foxie—how did you sleep?","zh":"早啊，小迷人——睡得怎么样？"},{"en":"She texted, “Hey foxie, are you free tonight?”","zh":"她发短信说：“嗨，小迷人，今晚有空吗？”"}]}],"synonyms":["foxy","cute","hot","sexy","attractive"],"phonetic":"/ˈfɑksi/","extraExplanation":["“foxie”更多见于随意聊天、社交媒体或亲密关系中，带俏皮和调情色彩；在正式写作里通常用“foxy”或直接用更中性的词（如 attractive / good-looking）。","用来形容别人“foxie/foxy”有时会显得在评价外貌，尤其对不熟的人可能不礼貌或带物化感；对方是否接受、场合是否合适很重要。"]}
{"word":"foxier","summary":{"en":"“Foxier” is the comparative form of “foxy,” meaning either more cunning or (informally) more sexually attractive.","zh":"“foxier”是“foxy”的比较级，表示“更狡猾/更精明”，也可在口语中表示“更性感/更有魅力”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More clever and skillful at getting what you want, sometimes in a slightly dishonest or tricky way; more cunning.","zh":"更狡猾的；更会耍手段的（有时带一点不太光明正大的意味）。"},"examples":[{"en":"After a few negotiations, she got foxier and started asking for better terms.","zh":"经过几次谈判后，她变得更精明狡猾，开始争取更好的条件。"},{"en":"The scammers are getting foxier, so be careful with unknown links.","zh":"诈骗手法越来越狡猾，所以要小心不明链接。"}]},{"partOfSpeech":"adj.","definition":{"en":"More sexually attractive in a bold, stylish way; more “sexy.”","zh":"更性感的；更撩人的（偏大胆、时髦的性感）。"},"examples":[{"en":"That jacket makes the outfit look foxier.","zh":"那件夹克让这身穿搭看起来更性感更有型。"},{"en":"He tried a new haircut and thought it made him foxier.","zh":"他换了个新发型，觉得自己更迷人了。"}]}],"synonyms":["more cunning","more sly","more crafty","more sexy (informal)","more attractive (informal)"],"phonetic":"/ˈfɑksiər/","extraExplanation":["“foxier”是形容词“foxy”的比较级，常见两种意思：①像狐狸一样“狡猾/机灵”；②口语里表示“性感/有魅力”。具体含义通常要看语境。","语气提醒：说别人“foxier”在“狡猾”义时可能带贬义；在“性感”义时通常是夸奖，但也可能显得轻佻，正式场合慎用。"]}
{"word":"foxiest","summary":{"en":"Foxiest is the superlative of foxy, meaning either the most clever/sly or (informally) the most sexy/attractive.","zh":"Foxiest 是 foxy 的最高级，可指“最机灵/最狡猾的”，也可在口语中指“最性感/最迷人的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most clever, sly, or good at getting what you want (often in a playful or slightly suspicious way).","zh":"最狡猾的；最机灵的；最会“耍聪明”的（多为调侃或略带怀疑的语气）。"},"examples":[{"en":"Of all the negotiators on the team, Maya is the foxiest.","zh":"在团队所有谈判者里，玛雅最机灵、最会谈判。"},{"en":"That was the foxiest excuse I’ve ever heard.","zh":"那是我听过最“狡猾”的借口了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Most attractive in a sexy way; hottest-looking.","zh":"（非正式）最性感的；最迷人的。"},"examples":[{"en":"Everyone said he looked the foxiest in a black suit.","zh":"大家都说他穿黑西装时最性感、最有魅力。"},{"en":"She felt foxiest after her new haircut.","zh":"她剪了新发型后觉得自己最迷人。"}]}],"synonyms":["slyest","canniest","shrewdest","sexiest","hottest"],"phonetic":"/ˈfɑk.si.əst/","extraExplanation":["“foxiest”是形容词“foxy”的最高级：foxy → foxier → foxiest。","“foxy”原意与“fox（狐狸）”相关，英语里狐狸常象征“狡黠、机灵”，所以“foxy”可以表示“狡猾/精明”。","表示“性感/迷人”的“foxy”比较口语化，使用时要注意场合与对象；对不熟的人直接说可能显得冒犯。"]}
{"word":"foxily","summary":{"en":"“Foxily” means “in a sly, cunning way.”","zh":"“foxily”表示“狡猾地、狡诈地（狡黠地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a sly, cunning way; like a fox (often suggesting cleverness mixed with deception).","zh":"狡猾地；狡诈地（像狐狸一样，常暗示聪明但带点欺骗）。"},"examples":[{"en":"He smiled foxily and changed the subject.","zh":"他狡黠地一笑，转移了话题。"},{"en":"She foxily pretended not to understand the question.","zh":"她狡猾地假装听不懂这个问题。"}]}],"synonyms":["slyly","cunningly","craftily","deviously"],"phonetic":"/ˈfɑːk.sə.li/","extraExplanation":["“foxily”来自形容词“foxy”（像狐狸的），而狐狸在英语文化里常被当作“狡猾、机灵”的象征。它既可能是轻微的调侃（机智），也可能带负面评价（耍心机）。","常见搭配：smile/look/say foxily（狡黠地笑/看/说）。在正式写作中不算常用，更常见于叙述故事、描写人物神态。"]}
{"word":"foxiness","summary":{"en":"Foxiness means crafty cleverness, and in informal speech it can also mean sexual attractiveness.","zh":"Foxiness既可指狡黠精明，也可在口语中指性感有魅力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cleverness in a slightly sneaky or strategic way; being crafty or shrewd.","zh":"（带点狡黠或策略性的）机灵、狡猾、精明。"},"examples":[{"en":"Her foxiness helped her negotiate a better deal without sounding pushy.","zh":"她的机灵让她在不显得强势的情况下谈到了更好的条件。"},{"en":"The villain’s foxiness made it hard for anyone to predict his next move.","zh":"反派的狡猾让人很难预测他的下一步。"}]},{"partOfSpeech":"n.","definition":{"en":"A playful way to say someone is sexually attractive or “sexy.”","zh":"（较口语/俏皮）指某人很性感、很有魅力。"},"examples":[{"en":"People kept talking about the foxiness of the lead actor in the new series.","zh":"大家一直在聊那部新剧男主角有多性感。"},{"en":"She laughed at the comment, taking it as a joke about her foxiness.","zh":"她笑着听那句话，把它当作夸她性感的玩笑。"}]}],"synonyms":["cunning","craftiness","shrewdness","slyness","sexiness","attractiveness"],"phonetic":"/ˈfɑk.si.nəs/","extraExplanation":["“foxiness”来自“fox”（狐狸）。在英语文化里，狐狸常被描绘成聪明、狡猾的形象，所以“foxy/foxiness”可以表示“狡黠机灵”。","“foxy”也常用来形容人“性感”，这种用法更口语、带一点调侃。对不熟的人使用时要注意场合与礼貌，避免让对方不舒服。"]}
{"word":"foxinesses","summary":{"en":"“Foxinesses” is the plural of “foxiness”: sly cleverness, (informally) sexual attractiveness, or (rarely) a musky taste/odor in some wines.","zh":"“foxinesses”是“foxiness”的复数：可指狡黠机灵；（口语）性感魅力；或（较少见）某些葡萄酒的“狐味”气味/风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being clever, sly, or good at getting what you want in a tricky way","zh":"狡黠、机灵、善于用计达到目的的特质"},"examples":[{"en":"In the story, the hero survives by using his foxinesses rather than his strength.","zh":"在故事里，主角靠的是各种狡黠机灵，而不是蛮力才活下来。"},{"en":"Her foxinesses helped her negotiate a better deal.","zh":"她的机灵和手腕让她谈到了更好的条件。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being sexually attractive in a bold, confident way (informal)","zh":"（非正式）性感、有魅力（通常带点大胆自信）的特质"},"examples":[{"en":"The ad tried to sell the product by highlighting the model’s foxinesses.","zh":"这则广告试图通过突出模特的性感魅力来推销产品。"},{"en":"People joked about his “foxinesses,” but he felt the comments were too personal.","zh":"大家拿他的“性感魅力”开玩笑，但他觉得这种评论太私人了。"}]},{"partOfSpeech":"n.","definition":{"en":"a musky, “grapey” odor or taste (especially used about some wines, now uncommon)","zh":"（尤指某些葡萄酒中）带麝香感、像葡萄皮/野味的气味或味道（较少见用法）"},"examples":[{"en":"Some tasters described foxinesses in the wine as earthy and musky.","zh":"有些品酒者形容这款酒带有“狐味”，偏土壤气息、略带麝香感。"}]}],"synonyms":["cunning","slyness","craftiness","cleverness","sex appeal (informal)","allure"],"phonetic":"/ˈfɑksinəsɪz/","extraExplanation":["“foxinesses”是名词复数，单数是“foxiness”。最常见的意思来自形容词“foxy”，既可以指“像狐狸一样狡黠”，也可以在口语里指“性感/有魅力”。用在描述人时，第二种含义容易带有物化或冒犯色彩，建议在不熟的人际场合谨慎使用。","关于葡萄酒的“foxiness”多见于描述某些美洲葡萄品种（如 Concord）带来的特殊香气；在现代品酒语境中不算主流词，常会改用更具体的风味词（如“musky”“grapey”）。"]}
{"word":"foxing","summary":{"en":"Foxing usually means the brown spots/discoloration you see on old paper, books, or prints.","zh":"Foxing 通常指旧纸张、旧书或版画上常见的褐色斑点/变色（霉斑、褐斑）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Of paper, old books, or prints) brownish spots or discoloration caused by age, moisture, or oxidation (often seen in older pages).","zh":"（纸张、旧书或版画上的）霉斑/褐斑；因年代久远、受潮或氧化等造成的褐色斑点或变色。"},"examples":[{"en":"The pages have foxing along the edges, but the text is still clear.","zh":"书页边缘有霉斑/褐斑，但文字仍然清晰。"},{"en":"Collectors prefer copies with minimal foxing and no water damage.","zh":"收藏者更喜欢霉斑较少且没有水渍的版本。"},{"en":"The conservator treated the print to reduce the appearance of foxing.","zh":"修复师处理了这幅版画，以减轻褐斑的明显程度。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of developing foxing on paper or similar materials.","zh":"（纸张等材料）出现霉斑/褐斑的过程。"},"examples":[{"en":"High humidity speeds up the foxing of paper stored in basements.","zh":"高湿度会加速地下室里存放纸张出现霉斑/褐斑的过程。"},{"en":"Proper storage helps prevent foxing.","zh":"妥善保存有助于防止出现霉斑/褐斑。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “fox” meaning to deceive or outsmart (less common in modern use).","zh":"“fox”的现在分词：欺骗、使困惑或智胜（现代较少见）。"},"examples":[{"en":"He kept foxing his opponents with unexpected moves.","zh":"他用出人意料的招数不断迷惑/智胜对手。"}]}],"synonyms":["brown spotting","age spots (on paper)","paper discoloration"],"phonetic":"/ˈfɑk.sɪŋ/","extraExplanation":["在古籍与收藏领域，foxing 很常见，用来描述纸张上“像狐狸毛色一样”的褐色斑点。其成因常与潮湿、霉菌或纸中金属杂质（如铁）氧化有关，但并非每一处褐斑都一定是霉菌造成。","在书籍品相描述中，你可能会看到“light foxing（轻微褐斑）”“moderate/heavy foxing（中度/重度褐斑）”等说法。良好保存方式包括：低湿度、稳定温度、无酸纸/档案级材料与避免阳光直射。"]}
{"word":"foxings","summary":{"en":"“Foxings” most often means the brown age-spots seen on old paper; it can also mean the rubber side strips on certain shoes.","zh":"“foxings”最常指旧纸张上的褐色老化斑点；也可指某些鞋子底边的橡胶包边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Brownish spots or stains that appear on old paper, books, prints, or photographs (often from aging, humidity, or reactions involving impurities in the paper).","zh":"（旧纸张、书籍、版画、照片上的）褐色斑点/霉斑；多与老化、潮湿或纸张杂质反应有关。"},"examples":[{"en":"The librarian noted heavy foxings along the page edges.","zh":"图书管理员注意到书页边缘有很多霉斑（褐色斑点）。"},{"en":"This vintage poster has some foxings, but the image is still clear.","zh":"这张复古海报有一些褐色斑点，但画面仍然清晰。"}]},{"partOfSpeech":"n.","definition":{"en":"Rubber or protective strips on the lower edge of a shoe (especially on sneakers/canvas shoes), sometimes called a “foxing strip.”","zh":"（尤指帆布鞋/运动鞋底边的）橡胶包边/护条；也常称“foxing strip”。"},"examples":[{"en":"Check the foxings on both shoes for cracks or peeling.","zh":"检查两只鞋的橡胶包边有没有开裂或脱落。"},{"en":"The new pair has thicker foxings for better durability.","zh":"这双新鞋的包边更厚，更耐穿。"}]}],"synonyms":["age spots (on paper)","brown spots","stains","foxing strip (shoes)","rubber strip"],"phonetic":"ˈfɑksɪŋz","extraExplanation":["“foxing”指纸上褐色斑点时，常见于旧书收藏、档案与修复领域；通常属于自然老化现象，不一定表示书本“发霉得很严重”。","关于“foxing（褐斑）”一词来源有不同说法（并非确定与“fox 狐狸”有关）；学习时可把它当作固定术语记忆：old paper + brown spots = foxing。"]}
{"word":"foxish","summary":{"en":"Foxish means fox-like—either sly/clever in behavior or fox-like in appearance.","zh":"foxish 指“像狐狸的”：可形容行为上狡黠机灵，也可形容外貌上有狐狸般特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a fox—clever, sly, or craftily attractive.","zh":"像狐狸一样的；狡黠的、机灵的（有时也可指带点狡猾的魅力）。"},"examples":[{"en":"He gave a foxish smile and changed the topic before anyone could question him.","zh":"他露出一个狡黠的微笑，在别人来得及追问之前就把话题岔开了。"},{"en":"The salesperson sounded foxish, as if they were hiding something.","zh":"那个销售说话听起来有点狡猾，像是在隐瞒什么。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having fox-like physical features, especially a sharp, narrow face or reddish coloring.","zh":"长相或外形像狐狸的（尤指脸型尖窄、神态机敏，或带红棕色调）。"},"examples":[{"en":"With her foxish face and bright eyes, she stood out in every photo.","zh":"她脸型有点狐狸样，眼睛又亮，在每张照片里都很显眼。"},{"en":"The dog’s foxish ears and pointed muzzle made people think it was part fox.","zh":"那只狗的耳朵和尖嘴很像狐狸，让人以为它有狐狸的血统。"}]}],"synonyms":["sly","cunning","wily","shrewd","crafty"],"phonetic":"/ˈfɑk.sɪʃ/","extraExplanation":["“foxish”来自“fox + -ish”。后缀“-ish”常表示“有点……的、像……的”（如 childish=孩子气的，greenish=略带绿色）。","语气提示：形容人时，foxish 往往带一点“不太完全可信/有心机”的暗示；如果想更中性或偏褒义，可以用 clever（聪明）、witty（机智）、shrewd（精明）等。"]}
{"word":"foxite","summary":{"en":"A “foxite” is an informal term for a Firefox user or enthusiast.","zh":"“foxite”是指火狐（Firefox）浏览器的用户或爱好者的非正式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A user or fan of the Mozilla Firefox web browser; someone active in Firefox-related communities.","zh":"（非正式）Mozilla Firefox（火狐）浏览器的用户或粉丝；活跃于火狐相关社群的人。"},"examples":[{"en":"Many foxites prefer Firefox because of its privacy features.","zh":"很多 foxite 喜欢火狐，因为它的隐私功能更强。"},{"en":"The forum is full of foxites sharing tips and add-ons.","zh":"论坛里有很多 foxite 在分享技巧和扩展插件。"}]}],"synonyms":["Firefox user","Firefox fan","Firefox enthusiast"],"phonetic":"/ˈfɑkˌsaɪt/","extraExplanation":["“foxite”通常是网络用语，由“Firefox（火狐）+ -ite（表示‘某类人/拥护者’的后缀）”构成，类似于“sports-fan”那种身份标签。它不是标准常用词，更多见于论坛、社群用户名或帖子里。"]}
{"word":"foxlike","summary":{"en":"Foxlike means ‘like a fox,’ especially sly, clever, and alert.","zh":"foxlike 表示“像狐狸一样的”，常指狡黠、聪明、机警。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a fox in appearance or behavior; often suggesting cleverness, slyness, or alertness.","zh":"像狐狸的；（外貌或行为）带有狐狸的特征，常含“聪明、狡黠、机警”的意味。"},"examples":[{"en":"He gave a foxlike smile and didn’t answer the question directly.","zh":"他露出一种狡黠的笑容，没有直接回答问题。"},{"en":"With her foxlike quickness, she noticed the mistake immediately.","zh":"她反应机敏，一下就发现了错误。"},{"en":"The character is described as foxlike—quiet, watchful, and hard to fool.","zh":"这个角色被形容为“像狐狸一样”——安静、警觉、不容易被骗。"}]}],"synonyms":["sly","cunning","wily","crafty","shrewd"],"phonetic":"/ˈfɑːkslaɪk/","extraExplanation":["“foxlike”通常带有比“clever”更强的“狡猾/狡黠”暗示，但语气不一定是强烈贬义；具体褒贬取决于语境（例如赞赏机敏，或批评狡诈）。","英语文化里，fox（狐狸）常象征聪明、狡猾与善于周旋；因此“foxlike”常用于描写人的眼神、笑容、动作或处事方式。"]}
{"word":"foxly","summary":{"en":"“Foxly” is a rare, old-fashioned word meaning foxlike—cunning or sly (as an adjective or adverb).","zh":"“foxly”是较少见的古语，表示“像狐狸一样狡猾/狡黠”，可作形容词或副词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Cunning or sly in a way associated with a fox; foxlike.","zh":"（罕见/古语）像狐狸一样狡猾的；狡黠的。"},"examples":[{"en":"He gave a foxly smile and changed the subject.","zh":"他露出一抹狡黠的笑容，然后转移了话题。"},{"en":"The story’s villain is described as foxly and quick to deceive others.","zh":"故事里的反派被描写得狡猾善骗。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare/archaic) In a cunning or sly way; like a fox.","zh":"（罕见/古语）狡猾地；像狐狸一样地。"},"examples":[{"en":"She spoke foxly, hinting at a secret without saying it directly.","zh":"她说得很狡猾，暗示秘密却不明说。"},{"en":"The salesman nodded foxly and offered a “special deal.”","zh":"推销员狡黠地点头，提出一个“特价优惠”。"}]}],"synonyms":["sly","cunning","crafty","wily","foxy"],"phonetic":"ˈfɑːksli","extraExplanation":["“foxly”由“fox（狐狸）+ -ly”构成，但现代英语里更常用“foxy（狡猾的/性感的，视语境）”或“sly / cunning”。“foxly”多见于较旧的文学描写，用来营造带点讽刺或隐喻的语气。","阅读时若遇到“foxly”，通常可理解为“狡黠、诡计多端”，语气比中性词“clever”更偏向“耍心机”。"]}
{"word":"foxproof","summary":{"en":"Foxproof means “made so foxes can’t get in or attack.”","zh":"foxproof 指“能防止狐狸进入或袭击的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed or built so that foxes cannot get in or cause harm (especially used for chicken coops, fences, or enclosures).","zh":"防狐狸的；能防止狐狸进入或造成伤害的（常用于鸡舍、围栏等）。"},"examples":[{"en":"We built a foxproof coop to protect the chickens at night.","zh":"我们建了一个防狐狸的鸡舍，晚上保护鸡群。"},{"en":"Make sure the fence is foxproof before you bring the ducks home.","zh":"把鸭子带回家之前，先确认围栏能防狐狸。"}]}],"synonyms":["fox-proof","predator-proof (broader)","secure","animal-proof (broader)"],"phonetic":"/ˈfɑːksˌpruːf/","extraExplanation":["“foxproof”更常见的拼写是连字符形式“fox-proof”。在英式/美式的农场或后院养鸡语境里很常用，强调结构上要做到：网眼足够小、门闩牢靠、底部最好有埋入地面的防挖措施等。"]}
{"word":"foxship","summary":{"en":"“Foxship” is a rare, playful word meaning the quality of being fox-like (foxiness).","zh":"“foxship”是个罕见的玩笑式/自造词，表示“像狐狸一样的特质（狐性、机灵或狡黠感）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, informal) The quality or state of being fox-like; “foxiness.” Often used as a playful or invented word rather than standard vocabulary.","zh":"（罕见，非正式）像狐狸一样的特质；“狐性 / 狐狸般的机灵或狡黠”。多为玩笑式或自造词，用法不算标准。"},"examples":[{"en":"In the story, the thief survives by pure foxship—quick thinking and quiet steps.","zh":"在故事里，小偷靠的就是十足的“foxship”——反应快、走路轻。"},{"en":"Her costume had a bit of foxship: a clever grin and a swishing tail.","zh":"她的装扮带点“foxship”：狡黠的笑和一条摆来摆去的尾巴。"}]}],"synonyms":["foxiness","cunning","slyness","craftiness"],"phonetic":"/ˈfɑkʃɪp/","extraExplanation":["“-ship”常见于表示“状态/性质/关系”的名词后缀（如 friendship 友谊、leadership 领导力）。把它加在 fox 后面形成 foxship，语感上像“狐狸的特质/狐狸式的风格”。","这个词不属于常见标准词汇；更自然的表达通常是 foxiness（狐媚/性感/狡黠感，视语境而定）、cunning（狡黠）、craftiness（诡计多端）、slyness（狡猾）。","如果你是在某个小说、游戏、社群（例如同人/兽圈）里看到 foxship，它也可能是作者或圈内的特定用法；可以把原句发我，我能按语境帮你确定最合适的意思。"]}
{"word":"foxskin","summary":{"en":"Foxskin means the fur/pelt of a fox, typically used for clothing.","zh":"foxskin 指狐狸的毛皮/皮张，通常用于制作或装饰衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The skin (fur/pelt) of a fox, used especially as a material for clothing or trimming.","zh":"狐狸皮；（尤指用于衣物或镶边的）狐狸毛皮。"},"examples":[{"en":"The collar was trimmed with foxskin.","zh":"衣领用狐狸皮镶了边。"},{"en":"In older fashions, a foxskin stole was sometimes worn in winter.","zh":"在较早的时尚里，冬天有时会戴狐狸皮披肩。"}]}],"synonyms":["fox fur","fox pelt","pelt","fur"],"phonetic":"/ˈfɑkssˌkɪn/","extraExplanation":["在现代英语里，更常见的说法是 **fox fur**（狐狸毛皮）或 **fox pelt**（狐狸皮张）。**foxskin** 也能理解，但比较少见，语感偏“老式/商品目录用语”。","与动物皮草相关的话题在不同文化中可能较敏感：在一些地区它被视为奢侈品或传统服饰材料，在另一些地区则涉及动物福利与环保争议。"]}
{"word":"foxskins","summary":{"en":"Foxskins are fox pelts/furs, especially when used as material for clothing.","zh":"foxskins 指狐狸的毛皮/皮张，常用于制作或装饰衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skins (pelts or furs) of foxes, often used to make clothing or trim","zh":"狐狸皮；狐狸毛皮（常用于做衣物或装饰）"},"examples":[{"en":"In the past, foxskins were used to line coats and hats for warmth.","zh":"过去，人们常用狐狸皮给大衣和帽子做内衬保暖。"},{"en":"The museum displayed foxskins from the 19th century fur trade.","zh":"博物馆展出了19世纪毛皮贸易时期的狐狸皮。"}]}],"synonyms":["fox pelts","fox fur","pelts","furs"],"phonetic":"/ˈfɑksskɪnz/","extraExplanation":["“foxskins”是复数形式，单数是“foxskin”。在历史上，“foxskin/fox fur”常与毛皮贸易（fur trade）相关，尤其在北美与欧洲部分地区曾是重要商品。现代语境中，谈到动物毛皮可能涉及动物福利与环保议题；一些人会选择人造毛皮（faux fur）作为替代。"]}
{"word":"foxtail","summary":{"en":"Foxtail mainly refers to a grass with a fuzzy seed head resembling a fox’s tail; it can also mean an actual fox tail or a fox-tail-like shape.","zh":"foxtail主要指穗状像狐狸尾巴的狗尾草等；也可指真正的狐尾或类似狐尾形状的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant with a bushy, bristle-like seed head that looks like a fox’s tail (often a type of grass).","zh":"一种种子穗（花序）像狐狸尾巴一样蓬松、带刺的植物（常见为某些禾本科草）。"},"examples":[{"en":"Foxtail grass grows along the roadside in late summer.","zh":"狗尾草常在夏末长在路边。"},{"en":"The foxtails in the field turned golden in the sun.","zh":"田里的狗尾草在阳光下变成金黄色。"}]},{"partOfSpeech":"n.","definition":{"en":"The tail of a fox, or something shaped like it (used in names of plants, tools, or designs).","zh":"狐狸的尾巴；或指形状像狐狸尾巴的东西（常用于植物、工具或图案名称中）。"},"examples":[{"en":"The design includes a foxtail-like brush shape at the end.","zh":"这个设计的末端有一个像狐尾一样的刷状造型。"}]}],"synonyms":["foxtail grass","bristle grass"],"phonetic":"/ˈfɑkˌsteɪl/","extraExplanation":["“Foxtail”常用来指“狗尾草”等一类穗状像狐狸尾巴的草。不同地区可能指不同物种；在北美也常见“foxtail barley（大麦狗尾草）”等名称。","在日常语境里，提到“foxtails”有时也与宠物健康相关：某些foxtail草的带刺种子容易粘在狗猫的毛里、钻进耳朵或皮肤，引起不适，户外活动后可检查宠物。"]}
{"word":"foxtailed","summary":{"en":"“Foxtailed” describes something that has or resembles a fox-like tail—often bushy and tapering—or looks like a foxtail grass spike.","zh":"“foxtailed”指“像狐狸尾巴的”（常强调蓬松、末端渐细），也可指像狗尾草/狐尾草那样的穗状外形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a tail like a fox, or (more generally) having a bushy, fox-like tail.","zh":"像狐狸尾巴的；（更常泛指）有蓬松、狐狸般尾巴的。"},"examples":[{"en":"The costume had a foxtailed hood and bright orange fur.","zh":"这套服装的帽子上有一条狐狸尾巴般的装饰，还配了亮橘色的毛。"},{"en":"In the story, the foxtailed creature disappears into the forest.","zh":"在故事里，那只长着狐狸尾巴的生物消失在森林中。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shaped like a fox’s tail; tapering and fluffy or brush-like (often used in description of hair, fabric, or design).","zh":"形状像狐狸尾巴的；（常指头发、布料或设计）逐渐变细且蓬松、刷状的。"},"examples":[{"en":"She wore her hair in a foxtailed braid that narrowed toward the end.","zh":"她把头发编成狐狸尾巴般的辫子，越到末端越细。"},{"en":"The dancer’s shawl had foxtailed fringes that swayed with each step.","zh":"舞者的披肩流苏呈狐狸尾巴般的形状，每一步都随之摇曳。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling a foxtail plant’s bristly spike (used especially in botany or nature writing).","zh":"像“狗尾草/狐尾草”那种带刺毛的穗状花序（尤用于植物学或自然描写）。"},"examples":[{"en":"Foxtailed grasses lined the path, catching the evening light.","zh":"小路旁长满了狗尾草般的草穗，映着傍晚的光。"},{"en":"The field was dotted with foxtailed seed heads in late summer.","zh":"夏末的田野里点缀着许多狗尾草似的种子穗。"}]}],"synonyms":["fox-tailed","bushy-tailed","brush-tailed","tapering","bristly"],"phonetic":"/ˈfɑkˌsteɪld/","extraExplanation":["“foxtailed”多见于描写性文字（文学、自然写作、服装/造型描述），强调“狐狸尾巴式的外形”：常见联想是蓬松、刷状、末端变细。","与名词“foxtail”（狐狸尾巴；狗尾草/狐尾草）相关；有时也可写作“fox-tailed”（尤在强调“像狐狸的尾巴”时更直观）。"]}
{"word":"foxtails","summary":{"en":"Foxtails are fox-tail-shaped grass seed heads (or the grasses that produce them), often mentioned because they can stick to clothes and irritate pets.","zh":"Foxtails 指形似狐狸尾巴的草穗（或产生这种草穗的禾草），常因会粘衣物并可能伤到宠物而被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The seed heads of certain grasses (often called “foxtail grasses”) that look like a fox’s tail; they can stick to clothing or animal fur and may irritate pets.","zh":"某些禾草（常称“狗尾草/狐尾草”）的穗状种子头，外形像狐狸尾巴；容易粘在衣物或动物毛上，可能刺激宠物。"},"examples":[{"en":"Foxtails stuck to my socks after our hike through the dry field.","zh":"我们穿过干燥的草地徒步后，狗尾草的穗子粘在了我的袜子上。"},{"en":"The vet warned that foxtails can get into a dog’s ears or nose.","zh":"兽医提醒说，狗尾草的穗子可能钻进狗的耳朵或鼻子里。"}]},{"partOfSpeech":"n.","definition":{"en":"A plant (or group of grasses) that produces foxtail-like seed heads; in North America this often refers to weedy foxtail grasses.","zh":"会长出“狐尾状”穗子的植物（或一类禾草）；在北美常指常见的杂草类狗尾草。"},"examples":[{"en":"Foxtails spread quickly along the edge of the parking lot.","zh":"停车场边缘的狗尾草蔓延得很快。"},{"en":"In summer, foxtails turn golden and dry out.","zh":"夏天狗尾草会变成金黄色并逐渐干枯。"}]}],"synonyms":["foxtail grass","grass awns","seed heads"],"phonetic":"/ˈfɑkˌsteɪlz/","extraExplanation":["在美国日常语境里，foxtails 常和宠物安全一起出现：干燥季节它们的“芒”（带倒刺的细刺）容易扎进皮肤或钻入耳鼻、脚趾缝，引发感染。带狗散步后检查毛发、脚掌很常见。","词源上是形象比喻：seed head（种穗）看起来像 fox’s tail（狐狸尾巴）。也常见单数 foxtail；复数 foxtails。"]}
{"word":"foxtongue","summary":{"en":"A rare plant name, usually referring to a foxtail-like grass with a long, narrow spike.","zh":"一种罕见的植物俗名，多指穗状细长、类似狗尾草一类的草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A common name for certain plants—especially grasses—with long, narrow leaves or flower spikes thought to resemble a fox’s tongue.","zh":"（罕见用法）某些植物（尤其是禾本科草类）的俗名，因其细长的叶片或穗状花序被认为形似“狐狸的舌头”而得名。"},"examples":[{"en":"Foxtongue grows along the edges of fields in late summer.","zh":"“foxtongue”常在夏末生长在田地边缘。"},{"en":"The guide pointed out a patch of foxtongue and explained it’s a local name for a foxtail-like grass.","zh":"向导指着一片“foxtongue”，解释说这是当地对一种像狗尾草的草的叫法。"}]}],"synonyms":["foxtail (grass)","foxtail grass","foxtail"],"phonetic":"/ˈfɑːksˌtʌŋ/","extraExplanation":["“foxtongue”不是标准、固定指向某一种植物的常见英文词，更像是地方性俗名或少见写法。在不同地区，它可能被用来指代不同的“穗状像狐狸舌头/尾巴”的草类。若你是在书里或植物名录中看到它，最好结合上下文或同时出现的拉丁学名（scientific name）来确认具体指哪一种植物。"]}
{"word":"foxtrot","summary":{"en":"Foxtrot can mean a classic ballroom dance, or the code word for the letter F in the NATO phonetic alphabet; it can also be a verb meaning to dance the foxtrot.","zh":"Foxtrot既可指经典的社交舞“狐步舞”，也可指北约音标中代表字母F的读法；还可作动词表示“跳狐步舞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a smooth ballroom dance in 4/4 time, usually traveling around the floor with long, walking steps.","zh":"（社交舞）狐步舞：一种4/4拍的平滑舞步，常用较长、像走路一样的步伐沿舞池移动。"},"examples":[{"en":"They learned the foxtrot for their wedding dance.","zh":"他们为婚礼舞蹈学了狐步舞。"},{"en":"The band switched to a slow foxtrot.","zh":"乐队换成了一首慢狐步舞。"}]},{"partOfSpeech":"n.","definition":{"en":"the letter F in the NATO phonetic alphabet, used to spell words clearly over radio or phone.","zh":"（北约音标字母）Foxtrot 表示字母 F，用于在电话或无线电中清晰拼读。"},"examples":[{"en":"My last name starts with F—Foxtrot.","zh":"我的姓以F开头——Foxtrot。"},{"en":"Please confirm: Foxtrot–India–Lima–Echo.","zh":"请确认：Foxtrot–India–Lima–Echo。"}]},{"partOfSpeech":"v.","definition":{"en":"to dance the foxtrot.","zh":"跳狐步舞。"},"examples":[{"en":"They foxtrotted across the ballroom.","zh":"他们在舞厅里跳着狐步舞滑过舞池。"}]}],"synonyms":["(dance) slow foxtrot","(NATO F) F (spoken as “Foxtrot”)"],"phonetic":"/ˈfɑkstrɑt/","extraExplanation":["“Foxtrot”作为“字母F”的读法常见于航空、军队、航海、无线电通话等场景，用来避免听错（例如F与S、X等混淆）。","“狐步舞”兴起于20世纪初的美国流行舞文化，后来成为经典标准舞之一；节奏与步伐通常给人优雅、从容的感觉。"]}
{"word":"foxtrots","summary":{"en":"“Foxtrots” most commonly means the dance/music called the foxtrot, or it can be the verb form meaning “dances the foxtrot.” Less commonly, it can mean multiple “Foxtrot” codes for the letter F in the NATO alphabet.","zh":"“Foxtrots”通常指狐步舞/狐步舞曲的复数；也可作动词，表示“（他/她）跳狐步舞”。较少见时可指北约音标中代表字母F的“Foxtrot”多次出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “foxtrot”: a smooth, partnered ballroom dance (and the music for it), usually in 4/4 time.","zh":"“foxtrot”的复数：狐步舞（一种流畅的双人交际舞）以及其舞曲，通常为四四拍。"},"examples":[{"en":"They practiced foxtrots and waltzes for the wedding reception.","zh":"他们为婚礼晚宴练习狐步舞和华尔兹。"},{"en":"Classic foxtrots are often played by big bands.","zh":"经典的狐步舞曲常由大乐队演奏。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “foxtrot”: to dance the foxtrot.","zh":"“foxtrot”的第三人称单数：跳狐步舞。"},"examples":[{"en":"On Fridays, she foxtrots with her dad at the community center.","zh":"每周五，她在社区中心和爸爸跳狐步舞。"},{"en":"He foxtrots confidently, even as a beginner.","zh":"即使是初学者，他跳狐步舞也很自信。"}]},{"partOfSpeech":"n.","definition":{"en":"In the NATO phonetic alphabet, “Foxtrot” means the letter F; “foxtrots” can refer to multiple instances of the letter/code word (less common).","zh":"在北约音标字母中，“Foxtrot”代表字母F；“foxtrots”可指多次出现的F或该报码（较少见）。"},"examples":[{"en":"The caller repeated two foxtrots to confirm the spelling: F-F.","zh":"来电者重复了两个“Foxtrot”来确认拼写：F-F。"}]}],"synonyms":["ballroom dances","partner dances","dance (verb)","do the foxtrot"],"phonetic":"/ˈfɑkstrɑt/","extraExplanation":["“Foxtrot（狐步舞）”起源于20世纪初的美国流行舞蹈文化，常被认为与当时舞台表演者Harry Fox的表演风格有关；后来在舞厅文化中发展成更标准化的交际舞。","在北约音标字母（NATO phonetic alphabet）里，用“Foxtrot”表示字母F，常用于无线电或嘈杂环境中避免听错字母。"]}
{"word":"foxwood","summary":{"en":"Foxwood is usually a proper name (often seen as “Foxwoods”); rarely, it can mean a woodland associated with foxes.","zh":"Foxwood 多用于专名（常见拼作“Foxwoods”）；少见情况下可指与狐狸有关的林地。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A place name or business name; most famously associated with Foxwoods Resort Casino in Connecticut, USA (often spelled “Foxwoods”).","zh":"（专有名词）地名或机构名；最知名的是美国康涅狄格州的 Foxwoods 度假村赌场（常拼作“Foxwoods”）。"},"examples":[{"en":"We stayed near Foxwoods for the weekend.","zh":"我们周末住在 Foxwoods 附近。"},{"en":"The conference is being held at Foxwoods Resort Casino.","zh":"会议将在 Foxwoods 度假村赌场举行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/poetic) A wooded area where foxes live, or a woodland associated with foxes.","zh":"（少见/带文学色彩）狐狸栖息的林地；或与狐狸相关联的树林。"},"examples":[{"en":"At dusk, the fox slipped back into the foxwood.","zh":"黄昏时，狐狸悄悄回到了那片林子里。"},{"en":"They followed the narrow path along the foxwood’s edge.","zh":"他们沿着那片林子边缘的一条小路走。"}]}],"synonyms":["woodland","forest","the woods","thicket"],"phonetic":"ˈfɑksˌwʊd","extraExplanation":["“Foxwood”本身在日常英语里不算常见词；更多时候你会在专有名词里看到它（例如美国的“Foxwoods”）。","英语里“woods”常用复数表示“树林/林地”（像 the woods），所以著名地点更常见拼法是“Foxwoods”。","如果你是想表达普通意义的“树林”，更常用的词是 “wood” 或 “woodland”；“foxwood”作为普通名词更偏诗意或自创用法。"]}
{"word":"foxy","summary":{"en":"“Foxy” most often means (1) clever and sly like a fox, or (2) informally, sexually attractive and stylish.","zh":"“foxy”常指（1）像狐狸一样狡猾机灵；（2）非正式地指性感迷人、有型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clever, sly, and good at getting what you want (often in a slightly dishonest or tricky way).","zh":"狡猾的；机灵而带点诡计的（常含一点不太诚实或耍手段的感觉）。"},"examples":[{"en":"The foxy salesman talked everyone into buying the upgrade.","zh":"那个狡猾的推销员把大家都说服去买升级版了。"},{"en":"She gave a foxy smile and changed the subject.","zh":"她狡黠地一笑，把话题岔开了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sexually attractive in a confident, stylish way (informal; can be flirtatious, and may feel objectifying depending on context).","zh":"性感迷人的（非正式；带挑逗意味，用在某些语境里可能显得物化、冒犯）。"},"examples":[{"en":"He thinks that jacket makes him look foxy.","zh":"他觉得那件夹克让自己看起来很性感。"},{"en":"They called the actor “foxy” in the magazine review.","zh":"杂志影评里称那位演员“很迷人/很性感”。"}]}],"synonyms":["cunning","sly","wily","shrewd","sexy","attractive","good-looking"],"phonetic":"/ˈfɑːksi/","extraExplanation":["“foxy”最初与“fox（狐狸）”相关，狐狸在英美文化中常象征“狡猾、聪明、会耍计谋”，所以“foxy”很自然就有了“狡猾的”含义。","表示“性感迷人”的用法多见于口语和流行文化（尤其是20世纪后半叶），更常用来评价外表与气质；对不熟的人直接说“foxy”可能显得轻浮，较稳妥的替代说法有“attractive / good-looking / stylish”。"]}

