{"word":"foy","summary":{"en":"“Foy” is a rare word: in older English it meant “faith/loyalty,” and in Scottish use it can mean a small tip; it’s also a common surname.","zh":"“foy”较少见：古义可指“信仰/忠诚”，苏格兰用法可指“小费”，也常见作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(obsolete) Faith; trust; loyalty.","zh":"（古义）信仰；信任；忠诚。"},"examples":[{"en":"He pledged his foy to his king.","zh":"他向国王宣誓效忠（古体表达）。"},{"en":"In old writings, “foy” could mean faith or trust.","zh":"在旧时文献里，“foy”有时表示“信任/信仰”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, formal/older use) A small gratuity or tip given for a service.","zh":"（苏格兰，较正式/旧用法）小费；酬金。"},"examples":[{"en":"The messenger received a small foy for delivering the letter.","zh":"信使因送信得到一笔小费。"},{"en":"In some Scottish contexts, a “foy” is a customary tip.","zh":"在一些苏格兰语境中，“foy”指习惯性给的小费。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), e.g., “Foy.”","zh":"姓氏（如：Foy）。"},"examples":[{"en":"Chris Foy was listed as the referee.","zh":"裁判被登记为 Chris Foy。"}]}],"synonyms":["faith","trust","loyalty","tip","gratuity"],"phonetic":"/fɔɪ/","extraExplanation":["“foy”作为“信仰/忠诚”的意思，多见于中古或早期近代英语文本，来源与法语“foi（信仰）”有关；现代英语中基本不用，更多作为历史用词或文学仿古用法出现。","苏格兰用法里，“foy”指“小费/酬金”，带有地方色彩；在当代更常用的词是“tip”“gratuity”。"]}
{"word":"foyaite","summary":{"en":"Foyaite is a nepheline syenite–type igneous rock named after Foya (Foia) in Portugal.","zh":"Foyaite（福雅岩）是一种霞石正长岩类的火成岩，名称源自葡萄牙的 Foya（Foia）地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of light-colored igneous rock (a variety of nepheline syenite) containing minerals like nepheline and alkali feldspar.","zh":"一种浅色火成岩（霞石正长岩的一种），常含霞石与碱性长石等矿物。"},"examples":[{"en":"The sample was identified as foyaite based on its nepheline-rich composition.","zh":"根据其富含霞石的成分，这个样品被鉴定为 foyaite（福雅岩）。"},{"en":"Foyaite is discussed in petrology when classifying alkaline intrusive rocks.","zh":"在岩石学中分类碱性侵入岩时，常会提到 foyaite（福雅岩）。"}]}],"synonyms":["nepheline syenite (variety)"],"phonetic":"/ˈfɔɪ.aɪt/","extraExplanation":["“foyaite”一词来自葡萄牙的地名 Foya（Foia，蒙希克山脉一带），最初用于命名在那里研究到的这种霞石正长岩变种。","它属于“碱性侵入岩”相关的术语，更多出现在地质学/岩石学教材、论文或野外报告中，日常英语里很少用到。"]}
{"word":"foyaitic","summary":{"en":"“foyaitic” does not appear to be a recognized English word; it is likely a misspelling.","zh":"“foyaitic”看起来不是公认的英语单词，更可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a very rare/technical term that is not found in major dictionaries.","zh":"不是标准英语单词。更可能是拼写错误，或非常罕见/专业领域用语，在主流词典中查不到。"},"examples":[{"en":"I couldn’t find “foyaitic” in a dictionary—could it be a misspelling?","zh":"我在词典里找不到“foyaitic”——会不会是拼写错了？"},{"en":"If you share the sentence where you saw it, I can guess the intended word.","zh":"如果你把它出现的句子发我，我可以帮你推测原本想表达的词。"}]}],"extraExplanation":["你可能想写的是下面这些更常见的词（取决于语境）：\n1) phreatic /ˈfriːætɪk/（地质）“潜水的；地下水的”，如 phreatic eruption（潜水/地下水爆发）。\n2) probiotic /ˌproʊbaɪˈɑːtɪk/ “益生菌的”。\n3) phonetic /fəˈnɛtɪk/ “语音的；音标的”。\n4) poetic /poʊˈɛtɪk/ “诗意的；诗歌的”。\n\n把你看到的原句、来源（书/论文/游戏/聊天）、或你想表达的意思告诉我，我可以精确给出正确词、发音和用法。"]}
{"word":"foyboat","summary":{"en":"A foyboat is an old term for a small hired harbor boat that helps bigger ships with lines, towing, or mooring.","zh":"foyboat 是个较旧的词，指港口雇用的小型勤务船，协助大船送缆、拖带或系泊等作业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small harbor service boat hired to help larger ships, especially for carrying lines, towing short distances, or assisting with mooring and unmooring","zh":"（旧时）港口雇用的小型勤务船，用来协助大船作业，常见于送缆、短距离拖带、协助靠泊或离泊"},"examples":[{"en":"The tanker called for a foyboat to help bring her alongside the dock.","zh":"那艘油轮叫来一艘港口勤务小船，帮她靠上码头。"},{"en":"A foyboat carried the mooring lines from the ship to the bollards.","zh":"勤务小船把系泊缆从船上运到岸边的系船柱上。"}]}],"synonyms":["harbor boat","service boat","line boat","tugboat (sometimes)"],"phonetic":"/ˈfɔɪˌboʊt/","extraExplanation":["“foyboat”是较旧、较少见的词，多出现在英式海事语境与历史资料中；现代英语里更常用更通用的说法是“harbor boat / service boat”，具体用途也可能分别称为“line boat（送缆船）”“tugboat（拖船）”“pilot boat（引航艇）”。","词中“foy-”来自旧时港口雇工/雇船协助作业的概念，带有“付费雇来帮忙”的历史色彩，因此常与港口装卸、系泊等工作场景相关。"]}
{"word":"foyer","summary":{"en":"A foyer is the entrance hall or lobby of a building, especially in theaters, hotels, and apartment buildings.","zh":"foyer 指建筑物的门厅/前厅，常见于剧院、酒店和公寓楼等场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the entrance hall or lobby of a building, especially a theater, hotel, or apartment building","zh":"（建筑物的）门厅；（尤指剧院、酒店、公寓楼的）前厅/大厅"},"examples":[{"en":"We waited in the foyer until the doors to the theater opened.","zh":"我们在门厅等着，直到剧院的门打开。"},{"en":"Take off your shoes in the foyer, please.","zh":"请在门厅把鞋脱掉。"}]},{"partOfSpeech":"n.","definition":{"en":"a lounge or lobby area in a theater where people can meet during intermission","zh":"（剧院中场休息时人们聚集的）休息厅；前厅"},"examples":[{"en":"During intermission, people chatted in the foyer and bought snacks.","zh":"中场休息时，人们在前厅聊天并买零食。"}]}],"synonyms":["lobby","entrance hall","entryway","vestibule"],"phonetic":"/ˈfɔɪ.ɚ/","extraExplanation":["“foyer”常见于英式与美式英语，尤多用于公共建筑（剧院/酒店）或住宅的“入口处的室内空间”。在美国家庭语境里，也可能用“entryway / entry hall / front hall”来表达更口语的“玄关/门厅”。","来源上，foyer来自法语，原意与“火炉/火”的概念有关（可理解为早期建筑里靠近取暖处的入口空间），因此在文化语境中常带有“迎接来客的第一空间”的感觉。"]}
{"word":"foyers","summary":{"en":"“Foyers” is the plural of “foyer,” meaning entrance halls or lobbies of buildings.","zh":"“foyers”是“foyer”的复数，意思是建筑的门厅/前厅/大厅（入口处的等候空间）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The entrance hall or lobby of a building (especially a theater, hotel, or apartment building).","zh":"（建筑的）门厅；前厅；大厅（尤指剧院、酒店或公寓楼的入口处）"},"examples":[{"en":"We waited in the theater foyer until the doors opened.","zh":"我们在剧院的门厅里等着，直到大门打开。"},{"en":"The hotel foyer was bright and full of plants.","zh":"酒店的前厅很明亮，摆满了植物。"}]}],"synonyms":["lobbies","entrance halls","vestibules","reception areas"],"phonetic":"/ˈfɔɪ.eɪz/","extraExplanation":["“foyers”是名词“foyer”的复数形式，表示不止一个门厅/前厅。","在美式英语里，日常也常用“lobby”表示类似空间；“foyer”更常让人联想到住宅或剧院等的入口前厅，语气更偏正式一点。","词源来自法语“foyer”，原意与“火炉、炉边”相关，后来引申为人们在入口处聚集、等候的空间。"]}
{"word":"foys","summary":{"en":"“Foys” is an uncommon plural of “foy,” meaning farewell parties or small tips (mainly Scottish, old-fashioned).","zh":"“foys”很少见，是“foy”的复数，主要指送别聚会或小费/赏钱（多见于苏格兰英语、较旧用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “foy”: a farewell party or send-off (mainly Scottish English; old-fashioned).","zh":"“foy”的复数：送别宴会、送行聚会（主要见于苏格兰英语；较旧/较少用）。"},"examples":[{"en":"Before the ship sailed, the crew enjoyed a few foys in town.","zh":"船出航前，船员们在镇上参加了几场送别聚会。"},{"en":"They held foys for the workers who were leaving at the end of the season.","zh":"他们为季末要离开的工人们办了送别聚会。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “foy”: a small gift or tip (also mainly Scottish English; old-fashioned).","zh":"“foy”的复数：小礼物、赏钱/小费（也主要见于苏格兰英语；较旧/较少用）。"},"examples":[{"en":"The porter received a few foys for carrying luggage.","zh":"搬运行李的搬运工收到了一些赏钱。"},{"en":"In old stories, servants sometimes hoped for foys after a long day.","zh":"在一些旧故事里，仆人忙了一天后有时会盼着得到一点赏钱。"}]}],"synonyms":["send-offs","farewell parties","gratuities","tips"],"phonetic":"/fɔɪz/","extraExplanation":["“foys”非常少见，通常只在苏格兰英语或较旧的文字里出现。现代英语更常说 send-off / farewell party（送别会）或 tip / gratuity（小费/赏钱）。","很多学习者会把“foys”看成“foes（敌人）”的拼写错误；如果你想查的是“foes”，意思是“敌人/对手”。如果你能提供一句原文，我也可以帮你判断。"]}
{"word":"foysen","summary":{"en":"“foysen” is likely a misspelling of “foison,” meaning “abundance” or “a plentiful supply.”","zh":"“foysen”很可能是“foison”的拼写错误，意思是“丰富、大量、充足的供给”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“foysen” is not a standard English word; it is most likely a misspelling of “foison,” meaning a large amount (abundance).","zh":"“foysen”不是标准英语词；很可能是把“foison”（意为“大量、丰富”）拼错了。"},"examples":[{"en":"I couldn’t find “foysen” in a dictionary—did you mean “foison” (abundance)?","zh":"我在词典里找不到“foysen”——你是不是想写“foison”（大量、丰富）？"},{"en":"After the rain, the fields had a foison of wildflowers.","zh":"下雨后，田野里野花繁盛、数量很多。"}]},{"partOfSpeech":"n.","definition":{"en":"(foison, n.) a plentiful supply; abundance.","zh":"（foison，名词）充足的供给；丰富；大量。"},"examples":[{"en":"The library offers a foison of resources for language learners.","zh":"这座图书馆为语言学习者提供了大量资源。"},{"en":"She spoke with a foison of enthusiasm.","zh":"她说话时热情洋溢。"}]}],"synonyms":["abundance","plenty","a wealth (of)","a profusion (of)","an ample supply"],"phonetic":"/ˈfɔɪzən/","extraExplanation":["“foison”较偏文学/书面语，在现代英语里更常用的近义词是“abundance / plenty / a wealth of”。","词源上来自法语“foison”，和“丰收、富饶”的意思相关，因此在描写自然、收获、资源充足时尤其常见。"]}

