{"word":"gcd","summary":{"en":"gcd = greatest common divisor (the largest number that divides two or more integers exactly).","zh":"gcd = 最大公约数（能整除两个或多个整数的最大数）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) greatest common divisor: the largest positive integer that divides two or more integers with no remainder.","zh":"（缩写）最大公约数：能同时整除两个或多个整数且不留余数的最大正整数。"},"examples":[{"en":"The gcd of 12 and 18 is 6.","zh":"12 和 18 的最大公约数（gcd）是 6。"},{"en":"To simplify the fraction, divide the numerator and denominator by their gcd.","zh":"要约分这个分数，把分子和分母都除以它们的最大公约数。"}]},{"partOfSpeech":"other","definition":{"en":"(computing/math) A function or operation that returns the greatest common divisor, often written as gcd(a, b).","zh":"（计算/数学）表示“求最大公约数”的函数或运算，常写作 gcd(a, b)。"},"examples":[{"en":"In Python, you can compute it with math.gcd(a, b).","zh":"在 Python 里，可以用 math.gcd(a, b) 来计算。"},{"en":"We use gcd(a, b) in the algorithm to reduce numbers quickly.","zh":"我们在算法中使用 gcd(a, b) 来快速化简数字。"}]}],"synonyms":["greatest common divisor","greatest common factor (GCF)","highest common factor (HCF)"],"phonetic":"/ˌdʒiː siː ˈdiː/","extraExplanation":["gcd 通常读作字母 “G-C-D”。在数学课或写代码时很常见。","求 gcd 的经典方法是“欧几里得算法（辗转相除法）”：反复用较大数除以较小数，取余数，再用较小数除以余数，直到余数为 0；此时最后一个非 0 的余数（或最后的除数）就是 gcd。","在分数约分、化简比例、以及数论（比如互质/公因数）里，gcd 是非常核心的概念。"]}
{"word":"gconv","summary":{"en":"gconv refers to glibc’s character-encoding conversion modules (and sometimes the directory that contains them).","zh":"gconv 指 glibc 的字符编码转换模块（有时也指存放这些模块的目录）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Computing, Linux) A GNU C Library (glibc) component and set of modules used to convert text between character encodings (for example, UTF-8, ISO-8859-1).","zh":"（计算机/Linux）GNU C 函数库（glibc）中的字符集转换组件与模块集合，用于在不同文字编码之间转换文本（如 UTF-8、ISO-8859-1）。"},"examples":[{"en":"The app crashed because the required gconv module for that encoding wasn’t installed.","zh":"这个应用崩溃了，因为缺少该编码所需的 gconv 模块。"},{"en":"On some systems, glibc loads gconv modules automatically when converting strings to UTF-8.","zh":"在一些系统上，glibc 在把字符串转换为 UTF-8 时会自动加载 gconv 模块。"}]},{"partOfSpeech":"n.","definition":{"en":"The folder or path where glibc searches for these encoding-conversion modules (often seen as “gconv” in system directories).","zh":"glibc 用来查找这些编码转换模块的文件夹/路径（在系统目录中常以 “gconv” 的形式出现）。"},"examples":[{"en":"Check the gconv directory to see which encodings are supported on this machine.","zh":"检查 gconv 目录，看看这台机器支持哪些编码。"},{"en":"A misconfigured gconv path can cause character conversion errors.","zh":"gconv 路径配置错误可能导致字符转换出错。"}]}],"synonyms":["iconv (related)","character encoding conversion","glibc gconv modules"],"phonetic":"/ˈdʒiːkɑnv/","extraExplanation":["“gconv”常见于 Linux/Unix 环境，和“iconv”密切相关：iconv 是进行编码转换的接口/命令，而 glibc 可能通过 gconv 模块来实现具体的编码转换。","你可能会在报错信息里看到它，例如与环境变量（如 GCONV_PATH）或缺失的转换模块有关。日常写作英语中很少用到，它更多是系统/开发语境下的术语。"]}
{"word":"gconvert","summary":{"en":"gconvert usually refers to a computing tool/command for converting data—often text encodings—from one format to another.","zh":"gconvert 通常指一个用于转换数据（常见为文本编码）的计算机工具/命令。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing) The name of a software tool/command used to convert data from one format to another (often referring to converting character encodings).","zh":"（计算机）一个软件工具/命令的名称，用于把数据从一种格式转换成另一种格式（常见指字符编码转换）。"},"examples":[{"en":"I used gconvert to change the text file from UTF-16 to UTF-8.","zh":"我用 gconvert 把文本文件从 UTF-16 转成 UTF-8。"},{"en":"If gconvert fails, check the input encoding first.","zh":"如果 gconvert 失败，先检查输入的编码。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To convert something using the gconvert tool.","zh":"（非正式）用 gconvert 工具来转换某物。"},"examples":[{"en":"Can you gconvert these subtitles to UTF-8?","zh":"你能用 gconvert 把这些字幕转成 UTF-8 吗？"}]}],"synonyms":["convert","transcode","re-encode","transform"],"phonetic":"/ˈdʒiːkənˌvɝt/","extraExplanation":["“gconvert”一般不是日常英语词汇，更常见于技术语境（例如作为某个程序/脚本/命令名）。在不同系统或项目里，gconvert 可能指不同的具体工具；如果你告诉我你看到它的上下文（哪套软件、哪条命令、错误信息），我可以给出更精确的解释与用法。"]}
