{"word":"gru-gru","summary":{"en":"a spiny tropical palm (and sometimes the edible larva associated with it)","zh":"一种带硬刺的热带棕榈（有时也指与之相关的可食幼虫）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very spiny tropical palm tree native to parts of the Caribbean and Central/South America, often used locally for food, oil, and materials","zh":"一种长满硬刺的热带棕榈树，原产加勒比及中南美部分地区，当地常用其果实/油脂与材料"},"examples":[{"en":"Be careful near the gru-gru—the trunk is covered with sharp spines.","zh":"靠近gru-gru要小心，它的树干布满尖刺。"},{"en":"In some Caribbean areas, people harvest fruit from the gru-gru palm for oil.","zh":"在加勒比一些地区，人们采收gru-gru棕榈的果实来榨油。"}]},{"partOfSpeech":"n.","definition":{"en":"the edible larva found in certain palms (especially the gru-gru palm), eaten as a traditional food in some regions","zh":"（尤指在gru-gru棕榈中发现的）可食用的棕榈幼虫；在一些地区被当作传统食物"},"examples":[{"en":"The guide explained that gru-gru larvae are considered a local delicacy.","zh":"导游解释说，gru-gru幼虫在当地被视为美食。"},{"en":"They roasted the gru-gru over a small fire.","zh":"他们把gru-gru放在小火上烤。"}]}],"synonyms":["grugru palm","macaw palm","macaúba"],"phonetic":"/ˈɡruː ɡruː/","etymology":"多认为来自加勒比地区的本地语言（如阿拉瓦克语族/加勒比语族）对这种带刺棕榈的称呼，后被西语/英语等吸收并拼写为 gru-gru / grugru。","mnemonic":["记成“gru-gru = 咕噜咕噜”，像走近这种棕榈时要很小心、动作放轻；不然会被“刺”到。","联想“gru-gru palm（带刺棕榈）”→ 看到连字符就想“重复提醒：有刺有刺”。"]}
{"word":"gruau","summary":{"en":"Gruau is a French-origin word sometimes used in Canada to mean oatmeal or a simple grain porridge.","zh":"Gruau 源自法语，在加拿大语境中有时用来指燕麦片/燕麦粥或简单的谷物粥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Canadian French/borrowed use) oatmeal; a hot cereal made from oats, often cooked with water or milk.","zh":"（尤指加拿大法语借词用法）燕麦片；用燕麦加水或牛奶煮成的热麦片粥。"},"examples":[{"en":"In Québec, many people eat gruau for breakfast in winter.","zh":"在魁北克，很多人冬天早餐会吃燕麦粥（gruau）。"},{"en":"She topped her gruau with bananas and a little maple syrup.","zh":"她在燕麦粥上加了香蕉和一点枫糖浆。"}]},{"partOfSpeech":"n.","definition":{"en":"A coarse porridge or gruel (a simple, soft food made by boiling grains).","zh":"粗麦粥；（把谷物煮软煮稀的）粥或糊状食物。"},"examples":[{"en":"After the hike, a bowl of warm gruau was comforting.","zh":"徒步之后，一碗热乎乎的粗麦粥让人很舒服。"}]}],"synonyms":["oatmeal","porridge","gruel"],"phonetic":"/ɡruˈoʊ/","extraExplanation":["“gruau”本来是法语词，在加拿大（尤其是魁北克）的英语/双语语境里偶尔会直接借用，最常见指“燕麦粥/燕麦片（oatmeal）”。在一般英语写作中，更常用 oatmeal 或 porridge。","发音在英语里常被英文化；如果你是在法语语境中看到，它的法语发音会和英语近似读法不太一样。"]}
{"word":"grub","summary":{"en":"“Grub” most often means casual food; it can also mean to dig/search for something, or an insect larva.","zh":"“grub”最常指口语里的“吃的/食物”；也可指“翻找/刨着找”，或指“幼虫/蛆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"food (especially simple or not very fancy food); something to eat.","zh":"食物（尤指简单、不太精致的食物）；吃的东西。"},"examples":[{"en":"We grabbed some grub after the movie.","zh":"电影结束后我们去弄点吃的。"},{"en":"There’s plenty of grub in the fridge.","zh":"冰箱里有很多吃的。"}]},{"partOfSpeech":"v.","definition":{"en":"to search for or dig for something, often in a persistent or slightly messy way.","zh":"（常指坚持地、略显狼狈地）翻找；挖掘寻找。"},"examples":[{"en":"He grubbed around in his bag for his keys.","zh":"他在包里翻找钥匙。"},{"en":"The dog grubbed in the dirt looking for a bone.","zh":"那只狗在土里刨来刨去找骨头。"}]},{"partOfSpeech":"n.","definition":{"en":"a short, ugly-looking insect larva (the young form of some insects).","zh":"蛆；幼虫（某些昆虫的幼体，外形短胖、常被认为不美观）。"},"examples":[{"en":"A grub can grow into a beetle.","zh":"幼虫可以长成甲虫。"},{"en":"Birds often eat grubs from the soil.","zh":"鸟常从土里啄食幼虫。"}]}],"synonyms":["food","chow","eat","forage","dig","larva"],"phonetic":"/ɡrʌb/","extraExplanation":["“grub”作“食物”时是很口语的美式英语，语气随意，常见于朋友间：grab some grub（去找点吃的）。在更正式场合可用 food / meal。","动词“grub (around)”常搭配 around，强调“到处翻找/乱翻”，语感比 search 更生活化。"]}
{"word":"grub sth. out","summary":{"en":"dig or rummage something out with effort","zh":"费力地把某物挖出/翻出"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to dig something out of the ground (or out of something) using your hands, a tool, or effort; often used for roots, weeds, or buried objects","zh":"把某物挖出来、刨出来（常指从土里或某处费力挖出；常用于草根、树根或埋着的东西）"},"examples":[{"en":"We grubbed the old roots out before planting new flowers.","zh":"我们先把旧根挖出来，再种新花。"},{"en":"The dog grubbed a bone out of the sand.","zh":"那只狗把一根骨头从沙子里刨了出来。"},{"en":"He used a spade to grub the stones out of the soil.","zh":"他用铁锹把土里的石头挖出来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to find and pull something out from a hidden or cluttered place after searching","zh":"（在杂乱或隐蔽处）翻找并拿出某物"},"examples":[{"en":"She grubbed her keys out of the bottom of her bag.","zh":"她从包底翻出了钥匙。"},{"en":"I finally grubbed the receipt out of a pile of papers.","zh":"我终于从一堆文件里翻出了那张收据。"}]}],"synonyms":["dig out","root out","pull out","extract","rummage out","ferret out"],"phonetic":"/ɡrʌb aʊt/","extraExplanation":["用法提示：常写作“grub sth out”。宾语通常放在中间（grub the roots out / grub them out）。语气偏口语，强调“费力地挖/翻”。","易混：与“dig sth out”相近，但“grub … out”更有“用手/工具在土里刨、连根弄出”或“在乱堆里翻找”的感觉。"],"etymology":"“grub”作动词原义与“像蛆一样在土里拱、刨”有关，后来引申为“挖掘、刨出”；加上“out”强调“挖出来/拿出来”的结果。","mnemonic":["联想“grub（蛆）在土里拱来拱去”，所以“grub … out”就是“拱着把东西挖出来”。","把它记成“刨（grub）+ 出来（out）= 刨出来/翻出来”。"]}
{"word":"grub-axe","summary":{"en":"a heavy tool for chopping and removing roots and brush.","zh":"用于砍断并清除树根、灌木的重型工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heavy axe used for grubbing—cutting roots, stumps, or brush close to the ground (often with a blade shaped for chopping and digging).","zh":"一种用于“掘根/清根”的重型斧头，用来砍断树根、树桩或贴地灌木（常见为适合劈砍与挖掘的斧刃造型）。"},"examples":[{"en":"He used a grub-axe to cut through the roots before pulling the stump out.","zh":"他用掘根斧先砍断树根，然后再把树桩拉出来。"},{"en":"A grub-axe is useful for clearing thick brush along a fence line.","zh":"清理篱笆线旁的浓密灌木时，掘根斧很管用。"}]}],"synonyms":["grubbing axe","grub axe","brush axe","root axe"],"phonetic":"/ˈɡrʌb ˌæks/","extraExplanation":["在北美的农场/林地清理里，这类工具常用于“开荒、清根”。不同品牌和地区外形略有差异，有的更像短柄鹤嘴锄与斧头的结合，用于既砍又挖。"],"etymology":"由动词 grub（“刨出、掘出；清除根部/灌木”）+ axe（“斧头”）组成的复合词。常见于林业、农场与土地清理语境；也常写作 grub axe 或 grubbing axe。","mnemonic":["把 grub 记成“刨/掘”，axe 是“斧头”：grub-axe = “用来刨根的斧头”。","联想中文场景：清理树根、灌木时用的“掘根斧/清根斧”。"]}
{"word":"grub-like","summary":{"en":"resembling an insect larva in shape or look","zh":"外形像昆虫幼虫的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a grub (the soft, worm-like larva of some insects); fat, pale, and wriggly in appearance.","zh":"像蛆/幼虫（昆虫幼虫）的；外形肥胖、苍白、蠕动感强的。"},"examples":[{"en":"In the soil, we found several grub-like larvae curled into a C-shape.","zh":"在土里，我们发现了几只像幼虫一样的幼体，蜷成一个C字形。"},{"en":"The creature had a grub-like body with tiny legs near the head.","zh":"那生物身体像幼虫，头部附近有很小的腿。"}]}],"synonyms":["larva-like","wormlike","maggotlike"],"phonetic":"/ˈɡrʌbˌlaɪk/","extraExplanation":["常见于自然科普、昆虫学、奇幻/科幻描写中，用来强调“幼虫般的外形与质感”。","日常口语里较少用；如果形容人，容易带有贬义或让人不适，写作时注意语境与礼貌。"],"etymology":"“grub”（昆虫幼虫）一词在英语里可追溯到中古英语，原意与“挖掘、翻动土”相关（幼虫常在土里）；“-like”表示“像……一样”，合起来就是“像幼虫的”。","mnemonic":["记忆法：grub=“土里挖出来的虫”，-like=“像……”，合起来就是“像土里那种幼虫的”。"]}
{"word":"grubbed","summary":{"en":"“Grubbed” means “looked for food in a rummaging way” or “dug up/removed roots or weeds,” depending on context.","zh":"“grubbed”是“grub”的过去式/过去分词，可指“翻找/觅食”，也可指“把杂草或树根等连根挖起、清除”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “grub”: to look for food (or small items) in an eager, sometimes messy way; to scavenge.","zh":"“grub”的过去式/过去分词：急切地（有时带点狼吞虎咽或邋遢地）找吃的；捡食、觅食。"},"examples":[{"en":"After the hike, we grubbed around in our bags for snacks.","zh":"徒步之后，我们在包里翻找零食。"},{"en":"The raccoon had grubbed through the trash during the night.","zh":"浣熊夜里翻过垃圾桶找吃的。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “grub”: to dig something up from the ground; to remove roots or stumps (often in “grub out”).","zh":"“grub”的过去式/过去分词：把东西从土里挖出来；清除树根/树桩（常见于短语“grub out”）。"},"examples":[{"en":"They grubbed up the weeds and cleared the garden bed.","zh":"他们把杂草连根挖起，清理了花坛。"},{"en":"The workers grubbed out the old stump to make room for the new fence.","zh":"工人把旧树桩清除掉，给新栅栏腾地方。"}]}],"synonyms":["scavenged","rummaged","foraged","dug up","rooted out"],"phonetic":"/ɡrʌbd/","extraExplanation":["“grub”作名词时还可以表示“食物”（很口语）：We grabbed some grub.（我们去弄点吃的。）所以“grubbed”在语境里常带一点“到处翻找/随便吃点”的随意感。","与“dig”相比，“grub up/out”更强调“连根挖起、彻底清除”（比如杂草、树根、树桩），常用于园艺或清理土地的场景。"]}
{"word":"grubber","summary":{"en":"Grubber usually means a person who digs for things; it can also mean a soil-loosening tool, or (informally) a greedy person.","zh":"grubber 通常指“挖掘者”；也可指“松土/除草工具”，或（非正式）“贪财的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who digs in the ground to find or collect something (for example, roots, insects, or buried items).","zh":"挖掘者；在地里翻挖寻找或收集东西的人（如挖根、找虫或找埋藏物）。"},"examples":[{"en":"As a child, he was a grubber, always digging for worms after the rain.","zh":"他小时候像个挖掘小能手，雨后总爱挖蚯蚓。"},{"en":"Truffle grubbers work with trained dogs to find mushrooms underground.","zh":"松露挖掘者会和受训的狗一起寻找地下的菌类。"}]},{"partOfSpeech":"n.","definition":{"en":"A farm or garden tool used to loosen soil or remove weeds (a type of cultivator).","zh":"（农具/园艺工具）松土或除草的器具（类似中耕机/耙耧）。"},"examples":[{"en":"He ran a grubber between the rows to break up the hard soil.","zh":"他用松土除草器在作物行间操作，把板结的土弄松。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often negative) Someone who greedily tries to get money or benefits; a money-grubber.","zh":"（非正式，常带贬义）一味贪图钱财或好处的人；财迷。"},"examples":[{"en":"Don’t be such a grubber—help because you care, not because you’ll profit.","zh":"别这么财迷——帮忙是因为在乎，而不是为了占便宜。"}]}],"synonyms":["digger","forager","cultivator","money-grubber","greedy person"],"phonetic":"/ˈɡrʌbər/","extraExplanation":["“grubber”来自动词“grub”（挖掘、翻找）+ 表示“做某事的人/物”的后缀“-er”。在比喻义里，它常和“money-grubber”一起出现，语气偏贬，表示“唯利是图”。","作为“工具”义时，多见于农业/园艺语境；日常对话里更常听到的是“money-grubber”（拜金的人/财迷）。"]}
{"word":"grubberies","summary":{"en":"“Grubberies” means cheap, simple places to eat (small low-cost eateries), often with an informal or slightly old-fashioned tone.","zh":"“Grubberies”指便宜简陋的吃饭地方（平价小馆/小吃店），语气较口语，略带旧式色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cheap, simple place to eat; a small low-cost restaurant or eatery (often used in the plural: “grubberies”).","zh":"（常用复数）便宜简陋的吃饭地方；小而廉价的餐馆/小吃店。"},"examples":[{"en":"After the show, we looked for one of the little grubberies near the station.","zh":"演出结束后，我们在车站附近找了一家便宜的小吃店。"},{"en":"The guidebook mentions a few late-night grubberies where students eat cheaply.","zh":"旅行指南提到几家深夜营业的平价小馆子，学生常去那里省钱吃饭。"}]}],"synonyms":["cheap eatery","diner","cafe","greasy spoon","canteen"],"phonetic":"/ˈɡrʌbəri/","extraExplanation":["“Grub”在口语里可表示“食物/吃”（偏随意，有点俏皮），因此“grubbery”带有“随便吃点、便宜填饱肚子”的感觉；在英式英语里更常见，且有点旧式/文学化的色彩。"]}
{"word":"grubbers","summary":{"en":"Grubbers are (1) people who dig or search hard, and (2) informally, people seen as greedy—especially for food or money.","zh":"grubbers 可指（1）挖掘/费力搜寻的人；（2）口语中指贪吃或贪财、让人反感的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who grub: people who dig in the ground, search for something with effort, or work in a rough/dirty way (often used informally).","zh":"挖掘者；苦苦搜寻者：指在地里挖掘、费力寻找东西的人，或做粗重脏活的人（常为非正式用法）。"},"examples":[{"en":"The grubbers searched the riverbank for old coins and bottles.","zh":"这些“寻宝挖掘者”在河岸边寻找旧硬币和瓶子。"},{"en":"In the old mining town, grubbers worked long days in the dirt and dust.","zh":"在那座老矿镇里，挖掘工人们在尘土和泥土中干一整天。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often disapproving) People who are overly focused on getting food or money; greedy or grasping people.","zh":"（非正式，常含贬义）只顾吃喝或捞钱的人；贪婪、斤斤计较的人。"},"examples":[{"en":"He called the corrupt officials grubbers who cared only about money.","zh":"他把那些贪腐官员称为只顾捞钱的“贪财鬼”。"},{"en":"Don’t be a grubber—share the snacks with everyone.","zh":"别那么馋/别那么自私，把零食分给大家。"}]}],"synonyms":["diggers","searchers","scavengers","money-grubbers","gluttons"],"phonetic":"/ˈɡrʌbər/","extraExplanation":["“grub”本义与“在土里翻找/挖掘”和“食物（俚语）”有关，所以“grubber(s)”既可指“挖掘的人”，也可能在口语里引申为“只顾吃或只顾捞的人”。具体含义要看语境与语气。"]}
{"word":"grubbery","summary":{"en":"“Grubbery” means an area of shrubs or low bushes (similar to “shrubbery”).","zh":"“grubbery”指一片灌木丛/灌木带，意思接近“shrubbery”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group or area of shrubs and low bushes; shrubbery (often used in gardening/landscaping).","zh":"（常用于园艺/景观）一片灌木丛；灌木植被（同 shrubbery）。"},"examples":[{"en":"The path was hidden by thick grubbery on both sides.","zh":"小路被两旁茂密的灌木丛遮住了。"},{"en":"They planted new grubbery along the fence for privacy.","zh":"他们沿着篱笆种了新的灌木来增加私密性。"}]}],"synonyms":["shrubbery","bushes","undergrowth"],"phonetic":"/ˈɡrʌbəri/","extraExplanation":["“grubbery”较少见，更常用的是“shrubbery”。在写作中它带有一点“茂密、低矮植物丛生”的画面感，常见于描写花园、乡间小路或庄园景观。","词根上可联想到“grub”（可表示“挖掘/刨出（植物根）”或“食物”），但“grubbery”在现代语境里主要按“灌木丛/灌木带”来理解，不是“食物”的意思。"]}
{"word":"grubbier","summary":{"en":"“Grubbier” means “more grubby”: dirtier or more unpleasant/low-quality than something else.","zh":"“grubbier”意为“更脏的/更邋遢的”，也可引申为“更不体面、更低劣的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative of \"grubby\": dirtier, more stained, or less clean.","zh":"“grubby”的比较级：更脏的、更有污渍的、不那么干净的。"},"examples":[{"en":"After playing outside all day, his hands were even grubbier than before.","zh":"在外面玩了一整天后，他的手比之前更脏了。"},{"en":"This shirt looks grubbier in the sunlight, so I’ll change it.","zh":"这件衬衫在阳光下看起来更脏了，所以我要换一件。"}]},{"partOfSpeech":"adj.","definition":{"en":"More unpleasant or low in quality (often describing places, behavior, or situations).","zh":"更不体面/更低劣/更令人反感的（常形容地方、行为或情境）。"},"examples":[{"en":"He started doing grubbier jobs just to make quick money.","zh":"为了赚快钱，他开始做更不体面的工作。"},{"en":"The second hotel was cheaper but much grubbier.","zh":"第二家酒店更便宜，但脏乱得多。"}]}],"synonyms":["dirtier","filthier","grimer","messier","shabbier","seedier"],"phonetic":"/ˈɡrʌbiər/","extraExplanation":["“grubbier”是形容词“grubby”的比较级，用来和另一人/物对比：A is grubbier than B。最高级是“grubbiest”。","“grubby”既可指“沾了污垢、看起来脏”，也可引申指“令人不舒服/不体面”的氛围或行为；语气通常偏负面、带一点嫌弃。"]}
{"word":"grubbies","summary":{"en":"“Grubbies” is an informal plural noun meaning dirty hands/handprints or dirty clothes/messy, grimy things.","zh":"“grubbies”是非正式复数名词，指脏手/手印，或脏衣服、脏兮兮的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dirty hands (especially a child’s hands), or dirty marks from them; an informal plural noun.","zh":"脏手（尤指小孩的手）或手上的脏污痕迹；非正式复数名词。"},"examples":[{"en":"Go wash your grubbies before dinner.","zh":"晚饭前去把你的脏手洗干净。"},{"en":"He left little grubbies on the white wall.","zh":"他在白墙上留下了小小的脏手印。"}]},{"partOfSpeech":"n.","definition":{"en":"dirty clothes or messy, grimy things (used humorously or casually).","zh":"脏衣服或又乱又脏的东西（常带玩笑/随口的语气）。"},"examples":[{"en":"Throw your grubbies in the laundry basket.","zh":"把你的脏衣服扔进洗衣篮里。"},{"en":"After camping, we came home with all our grubbies.","zh":"露营回来后，我们带着一堆脏兮兮的东西回家了。"}]}],"synonyms":["dirty hands","grime","smudges","dirty clothes","laundry"],"phonetic":"/ˈɡrʌbiz/","extraExplanation":["“grubbies”来自形容词“grubby”（脏的、邋遢的），在口语里把“脏手/脏东西”说得更轻松、更可爱一点，常见于对孩子说话或家庭场景。","使用时通常带有轻微的幽默或亲昵感；在正式写作中更常用“dirty hands / dirty clothes”。"]}
{"word":"grubbiest","summary":{"en":"“Grubbiest” means the dirtiest or most untidy (the superlative form of “grubby”).","zh":"“grubbiest”表示“最脏的/最邋遢的”，是“grubby”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “grubby”: the dirtiest or most untidy, often in a way that looks neglected or unclean.","zh":"“grubby”的最高级：最脏的、最邋遢的（常带有显得疏于打理、不干净的含义）。"},"examples":[{"en":"After the camping trip, my sneakers were the grubbiest thing in my bag.","zh":"露营回来后，我的运动鞋是包里最脏的东西。"},{"en":"That corner of the kitchen is the grubbiest because nobody cleans behind the fridge.","zh":"厨房那个角落最邋遢，因为没人清理冰箱后面。"},{"en":"He showed up in his grubbiest jacket, covered in paint and dust.","zh":"他穿着自己最脏的夹克出现了，上面全是油漆和灰尘。"}]}],"synonyms":["dirtiest","filthiest","grimiest","messiest","most unkempt"],"phonetic":"/ˈɡrʌbiəst/","extraExplanation":["“grubbiest”来自形容词“grubby”（肮脏的、邋遢的）的最高级形式：grubby → grubbier → grubbiest。常用于衣物、房间、手、鞋等，看起来脏兮兮的；语气多为口语，带一点嫌弃或抱怨。"]}
{"word":"grubbily","summary":{"en":"“Grubbily” means “in a dirty or untidy way,” often describing someone’s clothes or appearance.","zh":"“grubbily”表示“肮脏或邋遢地”，常用来形容衣着或外表。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a dirty, untidy, or unclean way; in a manner that looks like it needs washing or cleaning.","zh":"以肮脏、邋遢、不洁的方式；看起来需要清洗或打扫的样子。"},"examples":[{"en":"He was dressed grubbily after working in the garage all day.","zh":"他在车库干了一整天活儿后，穿得很邋遢。"},{"en":"The children came home grubbily, with mud on their hands and faces.","zh":"孩子们回家时脏兮兮的，手和脸上都是泥。"}]}],"synonyms":["dirtily","messily","untidily","filthily"],"phonetic":"/ˈɡrʌbəli/","extraExplanation":["“grubbily”来自形容词“grubby”（脏的、邋遢的），常用来形容衣着、外表或环境给人的“不干净、需要清理”的印象。语气通常带一点负面评价，但也可以只是客观描述。","近义词提示：dirty（一般“脏”）、filthily（更强烈，强调“污秽”）、shabbily（更偏“破旧寒酸/不体面”，不一定脏）。"]}
{"word":"grubbiness","summary":{"en":"Grubbiness means the condition of being dirty, and it can also describe a shabby or morally unpleasant quality.","zh":"Grubbiness 指“肮脏、不洁的状态”，也可引申为“寒酸、低劣或不体面的气质/氛围”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being dirty or slightly unpleasant because of dirt or poor cleanliness","zh":"肮脏；不洁（因灰尘、污垢或卫生差而显得不干净、让人不舒服的状态）"},"examples":[{"en":"The grubbiness of the kitchen made everyone lose their appetite.","zh":"厨房的肮脏让大家都没了食欲。"},{"en":"He complained about the grubbiness of the hotel room and asked to change rooms.","zh":"他抱怨酒店房间太脏，要求换房。"}]},{"partOfSpeech":"n.","definition":{"en":"a low, cheap, or morally unpleasant quality; shabbiness","zh":"卑劣感；寒酸/下作的气质（带有“廉价、不体面、令人反感”的感觉）"},"examples":[{"en":"The movie shows the grubbiness of city life at its worst.","zh":"这部电影展现了都市生活最不堪的一面。"},{"en":"She disliked the grubbiness of the argument and walked away.","zh":"她不喜欢那场争吵的低劣气息，转身离开了。"}]}],"synonyms":["dirtiness","filth","griminess","shabbiness","sleaziness"],"phonetic":"/ˈɡrʌbinəs/","extraExplanation":["词源与构词：grubbiness 来自形容词 grubby（“脏兮兮的；邋遢的；寒酸的”）+ 名词后缀 -ness（表示“……的状态/性质”）。所以 grubbiness 就是“grubby 的状态”。","语气与使用场景：grubbiness 常带一点轻蔑或不舒服的评价，比中性的 dirtiness 更有“邋遢、让人嫌弃”的感觉；第二个义项可用于形容环境、氛围或行为的“低俗/不体面”。","相关词汇：grime（污垢，常指积累很久的黑垢）、filth（污秽，语气更强、更厌恶）、shabbiness（破旧寒酸；也可指不体面）、sleazy（肮脏下流的，偏“道德/作风”）。"]}
{"word":"grubbinesses","summary":{"en":"“Grubbinesses” is the plural of “grubbiness,” meaning states or instances of dirtiness/untidiness; less commonly, it can mean a shabby or unpleasant quality.","zh":"“grubbinesses”是“grubbiness”的复数，指多种/多次的肮脏邋遢状态；较少见时也可指卑劣寒酸、令人不快的气质或氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being dirty or untidy; a condition of being grubby (often used to talk about visible dirt on clothes, hands, rooms, etc.)","zh":"肮脏、邋遢的状态；脏兮兮的状况（常指衣服、手、房间等看得见的污垢）"},"examples":[{"en":"After the camping trip, the kids came home covered in mud and general grubbiness.","zh":"露营回来后，孩子们满身泥巴，一副脏兮兮的样子。"},{"en":"The kitchen’s grubbiness made it hard to feel comfortable eating there.","zh":"厨房太脏了，让人很难放心在那里吃东西。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a mean, shabby, or unpleasant quality, especially in behavior or atmosphere","zh":"（较少见）卑劣、寒酸或令人不快的气质/氛围（尤指行为或环境给人的感觉）"},"examples":[{"en":"He disliked the grubbiness of the deal and refused to join in.","zh":"他讨厌这笔交易的龌龊劲儿，所以拒绝参与。"},{"en":"The film shows the grubbiness behind the glamorous image of fame.","zh":"这部电影展现了名利光鲜外表背后的肮脏与不堪。"}]}],"synonyms":["dirtiness","filth","grime","messiness","shabbiness"],"phonetic":"/ˈɡrʌbinəs/","extraExplanation":["“grubbinesses”是名词“grubbiness”的复数形式，但在实际英语里很少用复数；更常见的说法是用不可数名词“grubbiness”，或改说“signs/levels of grubbiness（脏的迹象/程度）”。","词根来自形容词“grubby（脏兮兮的）”，口语里常用于描述手、衣服或地方“看起来不干净”。"]}
{"word":"grubbing","summary":{"en":"Grubbing usually means digging or rooting around; informally it can also mean struggling for small gains or looking for food.","zh":"Grubbing 通常指翻挖、刨找；口语里也可指为一点收益辛苦奔波，或到处找吃的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"digging in the ground (or in something messy) to find or remove something; rooting around.","zh":"在地里（或杂乱的东西里）翻挖、刨找；搜寻/清理。"},"examples":[{"en":"We spent the afternoon grubbing in the garden to pull out weeds.","zh":"我们整个下午都在花园里翻挖，把杂草拔掉。"},{"en":"The dog was grubbing in the dirt, trying to find a buried bone.","zh":"那只狗在泥土里刨来刨去，想找出埋着的骨头。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) doing hard, sometimes unpleasant work to get money or small gains; struggling to earn a living.","zh":"（非正式）辛苦、甚至有点卑微地干活挣钱；为一点小收益而费力。"},"examples":[{"en":"He’s been grubbing for extra cash after work.","zh":"他下班后一直在辛苦赚点外快。"},{"en":"They’re tired of grubbing just to pay the bills.","zh":"他们厌倦了为了付账单而苦苦打拼。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) looking for food or a place to eat; getting something to eat.","zh":"（非正式）找吃的/去弄点吃的。"},"examples":[{"en":"We went grubbing around the neighborhood for a late-night snack.","zh":"我们在附近转了一圈，找点夜宵吃。"},{"en":"Are you grubbing for something, or are you actually hungry?","zh":"你是在找东西吃，还是你真的饿了？"}]}],"synonyms":["digging","rooting around","scrabbling","scavenging","scraping by"],"phonetic":"/ˈɡrʌbɪŋ/","extraExplanation":["“grubbing”来自动词“grub”。“grub”原意与“挖、刨”有关，后来在口语里也可指“食物”（比如：There’s some grub in the fridge 冰箱里有点吃的）。因此“grubbing”既可指“在土里刨”，也可延伸为“为糊口而辛苦奔波”或“到处找吃的”。","常见相关搭配：grub up（挖出来；弄到/凑到——如 grub up enough money 凑够钱）、grub out（把……挖出来/清除——如 grub out the roots 把根挖掉）。"]}
{"word":"grubble","summary":{"en":"“Grubble” means to rummage or grope around to find something, usually by hand.","zh":"“grubble”指用手摸索或翻找来寻找东西，多为方言或较少见用法。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to search for something by feeling around with your hands; to rummage or grope, often in a messy or hidden place","zh":"（用手）摸索着寻找；翻找、乱翻（常在杂乱或看不见的地方）"},"examples":[{"en":"I grubbled in my bag for my keys, but they weren’t there.","zh":"我在包里摸索着找钥匙，但不在里面。"},{"en":"The child grubbled under the sofa to find the lost coin.","zh":"孩子在沙发底下摸索着找丢失的硬币。"},{"en":"He grubbled through the drawer until he found the old photo.","zh":"他把抽屉翻了个遍，直到找到那张旧照片。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a rough or clumsy search; a rummage","zh":"（较少见）粗略、笨拙的翻找；乱翻"},"examples":[{"en":"After a quick grubbling in the toolbox, she pulled out the screwdriver.","zh":"她在工具箱里随便翻找了一下，就拿出了螺丝刀。"}]}],"synonyms":["rummage","grope","fumble around","scrabble","poke around"],"phonetic":"/ˈɡrʌbəl/","extraExplanation":["“grubble”属于方言/较少见用词，在英式英语（尤其苏格兰与英格兰北部方言）中更常见；在现代标准英语里通常用更常见的“rummage / grope / fumble around”来表达类似意思。拼写上也可见变体“gruble”。"]}
{"word":"grubby","summary":{"en":"“Grubby” means dirty with grime, or (informally) slightly dishonest or unpleasant.","zh":"“grubby”指“脏兮兮的、沾满污垢的”，也可口语指“有点不光彩/不太正派的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Dirty; covered with grime; not clean.","zh":"肮脏的；沾满污垢的；不干净的。"},"examples":[{"en":"His hands were grubby after working in the garden.","zh":"他在花园干活后，手变得脏兮兮的。"},{"en":"Don’t put your grubby shoes on the couch.","zh":"别把你脏兮兮的鞋子放到沙发上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Somewhat dishonest, cheap, or morally unpleasant; “shady.”","zh":"（非正式）有点不诚实的；卑鄙的；让人不舒服的（“不太光彩的”）。"},"examples":[{"en":"He tried a grubby trick to win the argument.","zh":"他用了个不太光彩的小伎俩来赢得争论。"},{"en":"The deal felt grubby, so she walked away.","zh":"这笔交易让人觉得不太干净，她就走开了。"}]}],"synonyms":["dirty","grimy","filthy","soiled","shabby","shady","sleazy"],"phonetic":"/ˈɡrʌbi/","extraExplanation":["“grubby”常用来形容“看起来脏、摸起来黏/油”的感觉，比“dirty”更口语，也更强调“污垢/油渍/灰尘”的具体质感。","用于形容人品或行为时，是一种带批评意味的委婉说法，接近“shady / sleazy”，但语气通常没那么强烈。"]}
{"word":"Grube","summary":{"en":"“Grube” is mainly a German-derived word meaning “pit/mine,” and in English it’s most often seen as a surname or in names.","zh":"“Grube”主要源自德语，意为“坑/矿坑”；在英语中多作为姓氏或出现在专有名称里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword from German) a pit, ditch, or excavated hole; sometimes used in place names or surnames related to a mine or pit.","zh":"（德语借词）坑、沟或挖出的洞；有时出现在地名或姓氏中，含“矿坑/坑洞”之意。"},"examples":[{"en":"In the old maps, the area marked “Grube” indicated a mining pit.","zh":"在旧地图上，标注“Grube”的区域表示一个矿坑。"},{"en":"His family name likely came from an ancestor who worked near a grube (pit).","zh":"他的姓氏可能源于祖先在坑洞（grube）附近工作。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Dr. Grube will present the research findings today.","zh":"Grube 博士今天将展示研究结果。"}]}],"synonyms":["pit","mine","excavation","ditch"],"phonetic":"/ˈɡruːbə/","extraExplanation":["“Grube”在德语里很常见，基本义是“坑、矿坑”。在英语语境中多见于专有名词（人名、地名、机构名）或引用德语文本时出现，因此具体含义常要看上下文。","发音上，英语使用者常把它读成类似“GROO-buh”，第二个音节较轻。"]}
{"word":"grubhood","summary":{"en":"Grubhood is a rare word meaning the larval “grub” stage; figuratively, it can mean an immature early period in life.","zh":"Grubhood 是个罕见词，指昆虫的“幼虫期”；比喻用法可指人生中青涩、不成熟的早期阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, informal) The stage or condition of being a grub (a larva), especially before becoming an adult insect.","zh":"（罕见，非正式）“蛴螬/幼虫”的阶段或状态，尤指昆虫变成成虫之前的时期。"},"examples":[{"en":"In the larva’s grubhood, it eats constantly and stores energy for metamorphosis.","zh":"在幼虫的“grubhood（幼虫期）”里，它不断进食，为变态储存能量。"},{"en":"The writer described the beetle’s grubhood as a hidden life underground.","zh":"作者把甲虫的“grubhood（幼虫期）”描写成一种在地下隐秘的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare, figurative) An early, undeveloped period of a person’s life, suggesting awkwardness or immaturity.","zh":"（非常罕见，比喻）人生中尚未成熟的早期阶段，暗示笨拙或不成熟。"},"examples":[{"en":"He joked that his awkward teenage years were his grubhood before he grew into himself.","zh":"他开玩笑说自己尴尬的青春期就是“grubhood”，后来才慢慢成熟起来。"},{"en":"The memoir contrasts her grubhood with the confidence she gained as an adult.","zh":"这本回忆录把她的“grubhood（青涩期）”与成年后的自信作了对比。"}]}],"synonyms":["larval stage","grub stage","infancy (figurative)","immaturity (figurative)"],"phonetic":"ˈɡrʌbˌhʊd","extraExplanation":["“grubhood”不是常用词，多见于个人写作或创造性用法。它由“grub（蛴螬/幼虫；也可指‘粗吃’或‘食物’的俚语）+ -hood（表示‘时期/状态’，如 childhood, adulthood）”构成，因此字面意思就是“幼虫时期/幼虫状态”。","如果你本来想查的是“childhood（童年）”或“brotherhood（兄弟情谊/兄弟会）”之类的常用词，也可以告诉我，我可以对比讲解。"]}
{"word":"grubless","summary":{"en":"Grubless means having no food, or (informally) being broke and unable to afford food or small expenses.","zh":"grubless 指“没吃的；缺少食物”，也可（非正式）指“没钱、手头很紧”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no food to eat; without a meal available.","zh":"没吃的；缺少食物的。"},"examples":[{"en":"We were grubless after the long hike, so we stopped for sandwiches.","zh":"长途徒步后我们都没吃的了，所以就停下来买三明治。"},{"en":"The campers realized they were grubless when the stove wouldn’t light.","zh":"当炉子点不着时，露营的人才发现自己没吃的了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Having little or no money—often implying you can’t afford food or small expenses.","zh":"（非正式）没钱的；手头很紧的（常暗示连吃饭或小开销都负担不起）。"},"examples":[{"en":"I’m grubless until payday, so I’ll skip eating out this week.","zh":"发薪日前我手头很紧，所以这周就不出去吃了。"},{"en":"He felt grubless in the new city, counting every dollar.","zh":"在新城市里他觉得很拮据，每一美元都要精打细算。"}]}],"synonyms":["hungry","without food","foodless","broke","penniless"],"phonetic":"/ˈɡrʌb.ləs/","extraExplanation":["“grub”在美式英语口语里常指“食物、吃的”，也可以泛指“生活费/零用钱”。“-less”表示“没有……的”，所以“grubless”字面意思就是“没有吃的/没有生活费的”。","这个词偏口语、带点幽默或夸张色彩；正式写作中更常用“hungry / without food / broke / penniless”等表达。"]}
{"word":"grubroot","summary":{"en":"Grubroot is a rare word meaning an edible root dug up for food, sometimes used as a regional name for certain wild plants with edible roots.","zh":"Grubroot是个少见词，指可挖来食用的根（野生块根），有时也作某些根可食野生植物的地方俗名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A root eaten as food, especially a wild, starchy root dug up and cooked (often written “grub root”).","zh":"（少见）可食用的根，尤指可挖来煮食的野生淀粉类块根（也常写作“grub root”）。"},"examples":[{"en":"In the story, the travelers survived on berries and grubroot they dug from the ground.","zh":"故事里，旅人靠浆果和他们从地里挖出的grubroot（可食块根）活了下来。"},{"en":"Some early settlers learned to cook grubroot when other food was scarce.","zh":"一些早期定居者在食物短缺时学会了烹饪grubroot（野生可食根）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Botany, regional) A common name for certain wild plants with edible roots (the exact plant varies by region).","zh":"（植物学／地域用法）某些“根可食”的野生植物的俗名（具体指哪种植物会因地区而异）。"},"examples":[{"en":"Local guides pointed out the grubroot, but warned us not to confuse it with look‑alike plants.","zh":"当地向导指给我们看grubroot，但提醒不要把它和外形相似的植物搞混。"}]}],"synonyms":["grub root","edible root","wild tuber","wild potato (in some regions)"],"phonetic":"/ˈɡrʌbˌruːt/","extraExplanation":["“grubroot / grub root”在现代英语里非常少见，更常见于历史叙事、边疆/荒野题材或地方志文字中，用来营造“靠采集野生食物度日”的语境。","词源上，“grub”有“挖掘、翻找”的意思（也可指“食物”作俚语），因此“grub root”字面就是“挖来当食物的根”。","如果你在某本书里遇到这个词，最好结合上下文或注释确认它在当地究竟指哪一种植物；不要据此自行辨认或食用野外植物。"]}
{"word":"grubs","summary":{"en":"“Grubs” most often means insect larvae; informally it can also mean food. It can also be a verb meaning to dig or search around.","zh":"“grubs”最常指昆虫幼虫；口语中也可指“吃的/食物”。它还可作动词，表示刨挖或到处翻找。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of grub) the larvae of insects, especially beetles; small worm-like creatures often found in soil or rotting wood.","zh":"（grub 的复数）昆虫幼虫，尤指甲虫幼虫；常在土壤或腐木中发现的“虫子”。"},"examples":[{"en":"Birds pull grubs out of the ground to eat.","zh":"鸟会从地里啄出幼虫来吃。"},{"en":"The gardener found grubs in the soil near the roots.","zh":"园丁在靠近根部的土里发现了幼虫。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) food, especially simple or casual food.","zh":"（非正式）食物；尤指简单、随便的吃的。"},"examples":[{"en":"Let’s grab some grubs before the movie.","zh":"看电影前我们先去吃点东西吧。"},{"en":"There’s plenty of grubs at the party—help yourself.","zh":"聚会上吃的很多——别客气。"}]},{"partOfSpeech":"v.","definition":{"en":"(from the verb grub) to search for or dig out something, often with effort (as in “grubs around”).","zh":"（源自动词 grub）费力地翻找/挖出（常用于“grub(s) around”表示到处翻找）。"},"examples":[{"en":"He grubs around in the drawer for his keys.","zh":"他在抽屉里翻来翻去找钥匙。"},{"en":"The dog grubs at the dirt, trying to uncover a bone.","zh":"那只狗在土里刨来刨去，想把骨头刨出来。"}]}],"synonyms":["larvae","insect larvae","food (informal: grub)","dig","rummage"],"phonetic":"/ɡrʌbz/","extraExplanation":["“grub(s)”表示“食物”是口语/俚语用法，语气比较随意，常出现在朋友间的对话中，如“grab some grub(s)”。","注意：表示幼虫时更偏字面、偏自然/园艺语境；表示“食物”时通常不用在正式场合。"]}
{"word":"grubstake","summary":{"en":"A grubstake is funding or supplies to help someone start a venture, often in exchange for a share of the profits.","zh":"grubstake 指为某人启动或继续某项事业提供的资金或物资支持，通常交换未来收益分成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money, supplies, or other support given to someone so they can start or continue a project (especially prospecting for gold or oil), usually in return for a share of any profits.","zh":"资助金；启动资金；（尤指淘金、勘探等的）食宿与资金支持，通常作为交换，资助者可分得未来收益的一部分。"},"examples":[{"en":"An investor offered her a grubstake to explore the new mining site.","zh":"一位投资人给她提供了启动资金，让她去勘探新的矿区。"},{"en":"They set out with a small grubstake and a big hope of striking it rich.","zh":"他们带着不多的资助金出发，却怀着一夜暴富的巨大希望。"}]},{"partOfSpeech":"v.","definition":{"en":"To provide someone with money or supplies to begin or continue a venture, often for a share of future returns.","zh":"资助；提供启动资金（常以分享未来收益为条件）。"},"examples":[{"en":"A local business owner grubstaked the team’s first expedition.","zh":"一位本地企业主资助了团队的首次探险。"},{"en":"He was grubstaked by a friend and promised to split any earnings.","zh":"他由朋友出资支持，并承诺平分任何收入。"}]}],"synonyms":["seed money","backing","funding","stake","sponsorship","support"],"phonetic":"/ˈɡrʌbˌsteɪk/","extraExplanation":["这个词源自美国西部淘金热时期：grub 指“食物/口粮”，stake 指“赌注、股份、押金”。最初常指资助淘金者的口粮与基本用品，后来引申为对任何冒险项目的“启动资金/资源支持”。在文学和电影里，它常带有“西部拓荒、冒险一搏”的文化氛围。"]}
{"word":"grubstaked","summary":{"en":"“Grubstaked” means “supported with startup money/food/supplies (often for prospecting), usually for a share of future profits.”","zh":"“grubstaked”指“提供启动资金/口粮/补给来资助某人（常见于淘金/勘探），通常换取未来利润分成”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “grubstake”: to provide someone with money, food, or supplies so they can start or continue a project (especially mining or prospecting), often in return for a share of the profits.","zh":"“grubstake”的过去式/过去分词：为某人提供启动或继续某项计划所需的钱、食物或补给（尤指淘金/勘探），通常作为交换，资助者可分享未来利润。"},"examples":[{"en":"A local merchant grubstaked the two prospectors for the winter in exchange for a cut of any gold they found.","zh":"一位当地商人给两名淘金者提供过冬的补给，作为交换要分走他们找到的黄金的一部分。"},{"en":"She was grubstaked by friends who believed in her small business idea.","zh":"她的朋友们看好她的小生意点子，于是资助了她。"}]}],"synonyms":["bankrolled","financed","funded","backed","sponsored","seeded"],"phonetic":"/ˈɡrʌbsteɪkt/","extraExplanation":["“Grub”在口语里可指“食物”，而“stake”有“赌注/投入、本金”的意思。19世纪北美淘金热时期，商人或投资人常用“grubstake”给淘金者提供装备与口粮；若淘到金子，再按约定分成。现代也可引申为“给创业/项目提供启动资金或资源”。"]}
{"word":"grubstaker","summary":{"en":"A grubstaker is someone who finances or supplies another person’s venture—especially a prospector—usually for a share of profits.","zh":"grubstaker 指为他人的冒险（尤指淘金/勘探）提供资金或物资的人，通常以分成收益为回报。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who provides money, supplies, or equipment to support someone else’s venture (especially a miner or prospector), usually in exchange for a share of any profits.","zh":"（尤指为矿工/淘金者）提供资金、口粮或装备以支持其冒险的人，通常作为交换获得未来收益的一部分。"},"examples":[{"en":"The young prospector found a grubstaker who paid for tools and food.","zh":"那位年轻的淘金者找到了一位出资人，为他支付工具和食物的费用。"},{"en":"In return for backing the trip, the grubstaker asked for half of the gold discovered.","zh":"作为资助这次行程的回报，出资人要求获得发现黄金的一半。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, a sponsor or backer who helps someone get started on a plan or project.","zh":"（更广义）资助者、支持者：帮助某人启动计划或项目的人。"},"examples":[{"en":"She was his grubstaker when he opened his first small business.","zh":"他开第一家小店时，她就是他的资助者。"},{"en":"Every artist needs a grubstaker at some point—someone who believes enough to fund the work.","zh":"每位艺术家在某个阶段都需要一个资助者——一个愿意出钱支持创作的人。"}]}],"synonyms":["backer","sponsor","patron","investor"],"phonetic":"/ˈɡrʌbˌsteɪkər/","extraExplanation":["“grubstake”原指淘金热时期给淘金者的一笔“口粮与启动资金”（grub=口粮/食物；stake=押注/股份）。因此 grubstaker 常带有“以分成作为回报”的含义，语感比单纯的 donor（捐赠者）更接近 investor/backer（投资人/出资人）。","这个词带有明显的美国西部拓荒与淘金文化背景，如在谈到 19 世纪的 gold rush、prospectors（勘探者/淘金者）时更常见。现代口语中偶尔会借用作比喻，但不算高频。"]}
{"word":"grubstakes","summary":{"en":"A grubstake is start-up support (money/supplies) given in exchange for a share of future profits; it can also mean to provide such support.","zh":"grubstake 指为他人提供启动资金/补给并换取未来收益分成；也可作动词表示“以分成方式资助”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money, supplies, or equipment given to someone (often a miner or prospector) to support them while they work, in exchange for a share of any profits.","zh":"（常指给矿工/淘金者的）资金、口粮或装备，用来支持其外出工作；作为交换，资助者通常可分得将来收益的一部分。"},"examples":[{"en":"During the gold rush, he went north on a grubstake from a local businessman.","zh":"在淘金热时期，他带着当地商人提供的“口粮资金”（grubstake）去北方淘金。"},{"en":"They offered her a small grubstake to start the expedition, asking for 20% of what she found.","zh":"他们给她一笔小额启动资助，让她出发探险，并要求分得她发现成果的20%。"}]},{"partOfSpeech":"vt.","definition":{"en":"To provide someone with a grubstake; to fund or supply them in return for a share of future profits.","zh":"给某人提供“口粮资金/启动资助”；以换取未来收益分成的方式资助或供给。"},"examples":[{"en":"An investor agreed to grubstake the team for the summer search.","zh":"一位投资者同意为团队的夏季搜寻提供grubstake资助。"},{"en":"She was grubstaked by friends who believed in her project.","zh":"她得到朋友们的grubstake资助，因为他们看好她的项目。"}]}],"synonyms":["stake","backing","seed money","sponsorship","funding"],"phonetic":"/ˈɡrʌbˌsteɪk/","extraExplanation":["这个词来自美国西部淘金时代的口语：grub 表示“食物、口粮”，stake 有“赌注/投入的本钱”的意思。合在一起就是“用口粮和本钱支持你去闯，但要分你赚到的”。","在现代英语里，它也可比喻为“给某人一点启动资金/资源，让他去试一把”，尤其在创业、拍片、探险等语境中仍可见。"]}
{"word":"grubstaking","summary":{"en":"Grubstaking means providing start-up support (money/supplies) for a risky venture, usually for a share of future profits—originally tied to gold prospecting.","zh":"Grubstaking 指为有风险的事业提供启动资金或物资，通常换取未来利润分成；最初多与淘金勘探有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving someone money, supplies, or equipment to help them start a risky venture (especially prospecting), usually in exchange for a share of future profits","zh":"（为他人开展有风险的事业而）提供启动资金或物资/装备的行为，通常以未来利润分成为回报（尤指资助淘金勘探）"},"examples":[{"en":"During the gold rush, grubstaking was common: a merchant would supply tools and food in exchange for part of the gold found.","zh":"在淘金热时期，“grubstaking”很常见：商人提供工具和食物，换取未来所找到黄金的一部分。"},{"en":"The team survived on a small grant and informal grubstaking from friends.","zh":"团队靠一笔小额资助和朋友们非正式的“grubstaking”才撑了下来。"}]},{"partOfSpeech":"v.","definition":{"en":"the ongoing action of grubstake: to fund or supply someone’s venture in exchange for a share of results","zh":"（grubstake 的进行式）资助/供给他人创业或探险所需，以换取成果分成"},"examples":[{"en":"An investor was grubstaking the expedition, hoping for a cut of any discoveries.","zh":"一位投资人正在为这次探险提供资金支持，希望能分到发现成果的一部分。"},{"en":"She spent the summer grubstaking her cousin’s small business by covering rent and equipment costs.","zh":"她整个夏天都在“grubstaking”表哥的小生意——替他付房租和设备费用。"}]}],"synonyms":["backing","seed funding","sponsorship","stakeholding","financing"],"phonetic":"/ˈɡrʌbˌsteɪkɪŋ/","extraExplanation":["“grubstake”原指给淘金者的“口粮（grub）+启动份额/筹码（stake）”。在19世纪北美淘金热中很常见：资助者提供食物、工具、马匹或现金；淘金者外出寻找矿脉，若成功则按约定分成。","现代英语里，这个词也可用于创业、创作、科研等语境，强调“以承担前期成本换取未来收益的一部分”，带有一定冒险/不确定性。"]}
{"word":"grubstreet","summary":{"en":"“Grub Street” refers to hack, low-paid writing and publishing (and originally a London street linked to such work).","zh":"“Grub Street”指低薪的“枪手写作”/低质量写作出版圈（原本是伦敦一条与此相关的旧街名）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(often written “Grub Street”) the world of low-paid, routine, or low-quality writing and publishing, especially work done mainly for money rather than art.","zh":"（常写作 Grub Street）指低薪、应付式或质量不高的写作与出版圈，尤指为了赚钱而写的“枪手写作”/商业化写作。"},"examples":[{"en":"He started in Grub Street, writing short articles just to pay the rent.","zh":"他一开始混迹于“Grub Street”，写一些短文章只为付房租。"},{"en":"The novelist wanted to escape Grub Street and write something more original.","zh":"这位小说家想摆脱“Grub Street”式的写作，写出更有原创性的作品。"},{"en":"She mocked the Grub Street reviewers who copied each other’s opinions.","zh":"她嘲讽那些“Grub Street”式的评论人，彼此抄袭观点。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a former street in London (near Moorfields), historically associated with poor writers, printers, and cheap publications; now mainly used in the figurative sense above.","zh":"伦敦旧街名（靠近 Moorfields），历史上与贫困作家、印刷商和廉价出版物相关；如今多用作上义的比喻说法。"},"examples":[{"en":"In the eighteenth century, Grub Street was linked with pamphlets and struggling writers.","zh":"在18世纪，Grub Street 常与小册子出版和挣扎求生的作家联系在一起。"},{"en":"The essay traces how Grub Street became a symbol of hack writing.","zh":"这篇文章追溯了 Grub Street 如何变成“枪手写作”的象征。"}]}],"synonyms":["hack writing","pulp writing","potboiler (informal)","literary hack (person)","the popular press (sometimes)"],"phonetic":"/ˈɡrʌb ˌstriːt/","extraExplanation":["“Grub Street”原是伦敦一条街名，17—18世纪时聚集了许多靠稿费维生的写手、印刷作坊与廉价小报/小册子，因此逐渐在英语里演变为“为生计而写、质量参差的写作圈”的代称。","文学与文化提及：18世纪英国作家亚历山大·蒲柏（Alexander Pope）等人常用“Grub Street”带讽刺意味地指那些迎合市场、互相攻讦的写手与评论圈。现代写作里多为比喻用法，未必指真实地点。"]}
{"word":"grubworm","summary":{"en":"A grubworm is a beetle larva living in soil, often known for damaging plant roots.","zh":"grubworm 指生活在土壤中的甲虫幼虫，常因啃食植物根部而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, white, C-shaped larva (baby stage) of certain beetles (especially scarab beetles) that lives in soil and may feed on plant roots","zh":"（某些甲虫，尤指金龟子科的）幼虫；白色、柔软、常呈C形的土中幼虫，可能啃食植物根部"},"examples":[{"en":"Grubworms can damage lawns by chewing on grass roots underground.","zh":"蛴螬可能在地下啃食草根，从而破坏草坪。"},{"en":"The gardener dug up the soil and found several fat grubworms.","zh":"园丁翻开土壤，发现了几条又肥又胖的蛴螬。"}]}],"synonyms":["grub","beetle larva","white grub"],"phonetic":"/ˈɡrʌbˌwɝm/","extraExplanation":["“Grubworm”在日常英语里常出现在园艺/草坪护理语境中，因为它们会导致草坪出现一块块枯黄（根被咬断，草皮容易被掀起）。在昆虫学里更常用更具体的说法是“grub”（幼虫）或指明是哪种甲虫的larva。"]}
{"word":"grubworms","summary":{"en":"Grubworms are insect larvae in soil (often beetle grubs) that may damage plant roots.","zh":"Grubworms 指土壤中的昆虫幼虫（常为甲虫幼虫），可能危害植物根系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Larvae (young forms) of certain insects—especially beetles—that look like small, soft “grubs” and often live in soil, where they may feed on plant roots.","zh":"某些昆虫（尤指甲虫）的幼虫，外形像白胖的“蛴螬/幼虫”，常生活在土壤中，可能啃食植物根部。"},"examples":[{"en":"The lawn turned brown because grubworms were eating the grass roots.","zh":"草坪变黄枯萎，是因为蛴螬在啃食草根。"},{"en":"Gardeners sometimes treat the soil to control grubworms before they damage seedlings.","zh":"园丁有时会在幼苗受害前处理土壤来控制蛴螬。"},{"en":"Birds pulled up the turf to hunt for grubworms.","zh":"鸟儿为了找蛴螬，把草皮都翻了起来。"}]}],"synonyms":["grubs","beetle larvae","white grubs"],"phonetic":"/ˈɡrʌbˌwɝmz/","extraExplanation":["“grubworm”常见于园艺与草坪养护语境；很多时候指的是金龟子（scarab beetles）等甲虫的幼虫。它们和earthworms（蚯蚓）不同：蚯蚓通常对土壤有益，而grubworms可能危害根系。","口语里也可能泛指“肥胖的幼虫/蛆状虫”，但在北美日常用法中，多与草坪、花园害虫相关。"]}
{"word":"grucche","summary":{"en":"“grucche” isn’t standard English; it probably means “crutches.”","zh":"“grucche”不是标准英语；很可能指“crutches（拐杖）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “crutches” (walking supports used when someone has an injured leg).","zh":"这不是标准英语词。它很可能是“crutches”（拐杖/腋拐，用于腿脚受伤时行走支撑）的拼写错误。"},"examples":[{"en":"After the accident, he had to use crutches for six weeks.","zh":"事故后，他不得不用拐杖走了六周。"},{"en":"She leaned on her crutches and slowly climbed the steps.","zh":"她靠着拐杖，慢慢爬上台阶。"}]}],"synonyms":["walking aids","cane (not the same, but related)"],"phonetic":"/ˈkrʌtʃɪz/","extraExplanation":["“grucche”看起来不像英语，更像是拼写误差。最常见的对应是英语“crutches”（拐杖）。另外，它也有点像意大利语“grucce”（衣架）的变体拼写，但那不是英语。你想表达的是“拐杖(crutches)”还是“衣架(hangers)”？"]}
{"word":"grudge","summary":{"en":"A grudge is a long-term resentment; to grudge is to keep resentment or to give something unwillingly.","zh":"grudge 指长期的怨恨；作动词可指记恨不放，或不情愿地给予/付出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long-lasting feeling of anger or resentment toward someone because of something they did.","zh":"（因对方做过某事而）长期的怨恨、积怨。"},"examples":[{"en":"He still holds a grudge against his old boss.","zh":"他仍然对以前的老板怀恨在心。"},{"en":"It’s hard to work together when you carry a grudge.","zh":"心里有怨气时，很难一起合作。"}]},{"partOfSpeech":"v.","definition":{"en":"To keep feeling angry at someone for a past wrong; to hold resentment.","zh":"对某人一直记恨；怀怨不放。"},"examples":[{"en":"Try not to grudge them for a small mistake.","zh":"尽量别因为一个小错误就一直记恨他们。"},{"en":"She doesn’t grudge—she prefers to talk things out.","zh":"她不爱记仇——更愿意把话说开。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give something unwillingly or resent having to give it (often used with “grudge someone something”).","zh":"不情愿地给；舍不得给；对给出某事感到不快（常用于“grudge someone something”）。"},"examples":[{"en":"I don’t grudge you your success—you earned it.","zh":"我不嫉妒你的成功——那是你应得的。"},{"en":"He grudged paying the extra fee.","zh":"他很不情愿付那笔额外费用。"}]}],"synonyms":["resentment","hard feelings","rancor","spite","begrudge"],"phonetic":"/ɡrʌdʒ/","extraExplanation":["“hold a grudge”是最常见的搭配，意思是“怀恨在心”。如果想表达“放下怨恨”，常说“let go of a grudge”或“forgive and forget”。","词形相关：grudging（勉强的、不情愿的，如：a grudging apology 勉强的道歉；grudgingly 勉强地）。","在英语文化语境里，“grudge”常带有“长期、难以释怀”的感觉，比“be upset”更重、时间更久。"]}
{"word":"grudge-bearer","summary":{"en":"someone who keeps resentment and doesn’t forgive easily","zh":"爱记仇、长期怀恨不放的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who keeps resentment and does not forgive past wrongs","zh":"记仇的人；怀恨在心、不轻易原谅的人"},"examples":[{"en":"He’s not a grudge-bearer, so he apologized and moved on.","zh":"他不爱记仇，所以道歉后就翻篇了。"},{"en":"A grudge-bearer may smile in public but feel angry inside.","zh":"记仇的人可能在公开场合微笑，心里却一直生气。"}]}],"synonyms":["resentful person","grudger","someone who holds a grudge"],"phonetic":"/ˈɡrʌdʒ ˌbɛrɚ/","extraExplanation":["语气通常偏负面，暗示这个人不愿放下不快、容易长期计较。日常更常见的说法是 hold a grudge（记仇）或 someone who holds a grudge（爱记仇的人）。"],"etymology":"由 grudge（怨恨、积怨）+ bearer（承受者/携带者）构成的复合词，字面意思是“背着怨恨的人”，引申为“记仇的人”。","mnemonic":["把它拆开记：grudge（怨）+ bearer（背着/扛着的人）＝“背着怨气走的人”→ 记仇的人。"]}
{"word":"grudge-holder","summary":{"en":"someone who keeps resentment and won’t forgive","zh":"记仇、难以原谅他人的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who keeps resentment and does not forgive past wrongs.","zh":"记仇的人；怀恨在心、不轻易原谅的人。"},"examples":[{"en":"He’s a grudge-holder, so one small insult can last for years.","zh":"他很记仇，所以一句小小的冒犯可能会记好多年。"},{"en":"If you’re a grudge-holder, conflicts in relationships tend to grow instead of ending.","zh":"如果你总是记仇，关系里的冲突往往会越积越大而不是结束。"}]}],"synonyms":["resentful person","grudger","score-keeper","vindictive person"],"phonetic":"/ˈɡrʌdʒ ˌhoʊldɚ/","extraExplanation":["常见搭配：be a grudge-holder（是个记仇的人）。","语气通常偏负面，用来形容不愿放下过去的人。更中性的说法可以用 someone who finds it hard to forgive（不太容易原谅的人）。","相关表达：hold a grudge（怀恨在心/记仇），bear a grudge（记恨）。"],"etymology":"由 grudge（“怨恨、积怨”）+ holder（“持有者”）构成的复合词，字面意思是“握着怨恨的人”，引申为“记仇的人”。","mnemonic":["把它拆开记：grudge（怨气）+ holder（拿着的人）= “手里一直拿着怨气的人”→记仇。","联想中文：\"怀\"（怀里揣着）\"恨\"——一直揣着不放，就是 grudge-holder。"]}
{"word":"grudge-holders","summary":{"en":"people who hold onto resentment and don’t forgive easily","zh":"爱记仇、难以轻易原谅的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who keep resentment for a long time and find it hard to forgive","zh":"长期记仇、很难原谅别人的人"},"examples":[{"en":"He’s not a grudge-holder; he gets over conflicts quickly.","zh":"他不是那种记仇的人；冲突很快就能放下。"},{"en":"Grudge-holders often replay old arguments in their minds.","zh":"记仇的人常常会在脑中反复回想过去的争吵。"},{"en":"If you’re dealing with grudge-holders at work, keep communication clear and respectful.","zh":"如果你在工作中要面对记仇的人，就要保持沟通清晰且尊重。"}]}],"synonyms":["resentful person","grudger","unforgiving person","score-keeper","bitter person"],"phonetic":"/ˈɡrʌdʒ ˌhoʊldɚz/","extraExplanation":["grudge-holder 常用于口语或写作中，描述一种性格倾向：不容易放下被冒犯的感觉，会把旧事记很久。它通常带一点负面评价，但也可用于中性描述（例如心理学或人际沟通语境）。","近义表达里，hold a grudge 是更常见的动词短语（“记仇”）；grudge-holder 是名词，强调“这种人”。"],"etymology":"由 grudge（“怨恨、积怨”，来自中古英语，含“抱怨/不满”的意思）+ holder（“持有者/保持者”）组合而成，字面意思是“把怨恨一直拿在手里的人”。复数为 grudge-holders。","mnemonic":["把 grudge 想成“古早的怨（旧怨）”，holder 是“拿着的人”：一直“拿着旧怨不放”的人。","联想中文“怀恨在心/记小本本”：grudge-holder 就是总在心里记账的人。"]}
{"word":"grudged","summary":{"en":"“Grudged” is the past tense/participle of “grudge,” meaning (1) to feel resentment or (2) to give something reluctantly.","zh":"“grudged”是“grudge”的过去式/过去分词，表示（1）心怀怨恨/不满，或（2）勉强给出、很不情愿付出。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of “grudge”: to feel resentment or lasting annoyance about something.","zh":"“grudge”的过去式/过去分词：对某事心怀怨恨、长期不满。"},"examples":[{"en":"He grudged her success for years.","zh":"他多年都对她的成功心怀怨恨。"},{"en":"She grudged the time she spent on pointless meetings.","zh":"她对花在无意义会议上的时间感到很不甘心、很不满。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of “grudge”: to give something reluctantly (you don’t really want to give it).","zh":"“grudge”的过去式/过去分词：勉强给出（不太情愿）。"},"examples":[{"en":"I grudged him the last piece of cake, but I gave it to him anyway.","zh":"我其实不太愿意把最后一块蛋糕给他，但还是给了。"},{"en":"They grudged every dollar they had to spend on repairs.","zh":"他们对每一笔维修开销都很不情愿。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) resentful; holding a grudge.","zh":"（较少用）怀恨的；心存不满的。"},"examples":[{"en":"He sounded grudged and bitter when he talked about the past.","zh":"他谈到过去时听起来既怀恨又苦涩。"}]}],"synonyms":["resented","begrudged","envied","regretted","reluctantly gave"],"phonetic":"ˈɡrʌdʒd","extraExplanation":["“grudge”既可作动词也可作名词。名词常见搭配：hold a grudge（记仇）、bear a grudge（怀恨）、a grudge against someone（对某人的怨恨）。","动词“grudge”常见两种用法：①grudge + 人 + 事物（不愿让/不愿给）：I don’t grudge you your success.（我并不嫉妒/怨恨你的成功。）②grudge + 事物/时间/金钱（不情愿付出）：He grudged the effort.","注意与“begrudge”的区别：begrudge更常用于“嫉妒/不愿让别人拥有”：She begrudged him his promotion. 在现代英语里，“begrudge”比“grudge（动词）”更常见。"]}
{"word":"grudgeful","summary":{"en":"Grudgeful means resentful and likely to hold on to anger or past hurts.","zh":"grudgeful 指“心怀怨恨、爱记仇”的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling resentment and likely to hold a grudge; not easily forgiving.","zh":"心怀怨恨的；爱记仇的；不容易原谅人的。"},"examples":[{"en":"He became grudgeful after the argument and stopped speaking to his friend.","zh":"争吵之后他变得很记仇，开始不再跟朋友说话。"},{"en":"A grudgeful attitude can damage relationships over time.","zh":"记仇的态度会随着时间推移伤害人际关系。"}]}],"synonyms":["resentful","bitter","spiteful","vindictive","unforgiving"],"phonetic":"/ˈɡrʌdʒ.fəl/","extraExplanation":["“grudgeful”在现代英语里不算常用，更常见的表达是“resentful”“bitter”或“holding a grudge”。","词形上是“grudge（怨恨/嫌隙）+ -ful（充满……的）”，意思就是“充满怨恨的”。","在写作中用“grudgeful”会带一点文学/较正式的感觉；日常口语通常会换成更常见的词。"]}
{"word":"grudgefully","summary":{"en":"“Grudgefully” means “resentfully” or “unwillingly, with lingering bitterness.”","zh":"“grudgefully”意为“带着怨恨地、愤愤不平地”，也可指“勉强地、不情愿地（带不满）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a resentful way; showing that you still feel angry or bitter about something.","zh":"以怨恨（记恨）的方式；表现出仍然对某事感到愤怒或苦涩。"},"examples":[{"en":"He spoke grudgefully about his former boss.","zh":"他带着怨气谈起他的前老板。"},{"en":"She accepted the apology grudgefully, not fully ready to forgive.","zh":"她勉强带着怨气接受了道歉，还没准备好真正原谅。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an unwilling way, as if you feel forced to do something (often because you resent it).","zh":"不情愿地（仿佛被迫去做），常带有不满或怨气。"},"examples":[{"en":"They grudgefully agreed to pay the extra fee.","zh":"他们不情愿地同意支付额外费用。"},{"en":"He grudgefully helped, making it clear he didn’t want to.","zh":"他不情愿地帮了忙，并明确表示自己并不想帮。"}]}],"synonyms":["resentfully","bitterly","spitefully","grudgingly","unwillingly"],"phonetic":"/ˈɡrʌdʒfəli/","extraExplanation":["“grudgefully”在现代英语中比较少见；更常用、更自然的说法是“grudgingly”（勉强地；不情愿地；带怨气地）。","词形上，“grudge + -fully”表示“带着grudge（怨恨/不满）地”。写作时若想更地道，通常优先选“grudgingly”。"]}
{"word":"grudgefulness","summary":{"en":"Grudgefulness means the habit or quality of holding onto resentment and not forgiving easily.","zh":"Grudgefulness 指“怀恨在心”的习惯或特质，难以轻易原谅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of holding a grudge; a tendency to feel lasting resentment and to be unwilling to forgive or forget a past wrong.","zh":"怀恨在心的性格或状态；对过去的不快长期怨恨、不愿原谅或忘记。"},"examples":[{"en":"His grudgefulness made it hard for the team to work together after the argument.","zh":"他怀恨的性格让争吵之后团队很难继续合作。"},{"en":"Years later, her grudgefulness still showed whenever she mentioned her former boss.","zh":"多年后，她一提到前老板仍会流露出记恨。"}]}],"synonyms":["resentment","bitterness","spite","vindictiveness","ill will"],"phonetic":"/ˈɡrʌdʒ.fəl.nəs/","extraExplanation":["“Grudgefulness”来自“grudge”（怨恨、积怨）+ “-fulness”（表示“充满……的状态/特质”）。在日常英语中，这个名词不算常用，更常见的说法是用“resentment”（怨恨）或用形容词“grudge-holding / resentful”来表达。","语气上，“grudgefulness”通常带负面评价，暗示一个人把过去的伤害一直放在心上，影响人际关系与情绪。"]}
{"word":"grudgekin","summary":{"en":"“Grudgekin” is a rare, informal (often invented) noun for a resentful relative or a group that shares and keeps grudges.","zh":"“Grudgekin”是少见的非正式（常为自造）名词，指带着旧怨的亲属，或共同记仇的一群人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal, rare; often a playful made-up word) A family member or close relative connected to a long-standing resentment (a “grudge”).","zh":"（非正式、少见；常为俏皮的自造词）与长期怨恨（grudge）有关的亲属；带着旧怨的“亲人/亲戚”。"},"examples":[{"en":"At reunions, my grudgekin always brings up the same argument from ten years ago.","zh":"每次家庭聚会，我那个“grudgekin”总会提起十年前的那场争吵。"},{"en":"He tries to keep the peace, even when his grudgekin starts complaining.","zh":"即使他的“grudgekin”开始抱怨，他也努力维持和气。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of people who share the same grievance and keep it alive together.","zh":"共同抱怨、一起“记仇”的一群人；因同一桩不满而结成的小圈子。"},"examples":[{"en":"The grudgekin online kept reposting the old rumor.","zh":"网上那群“grudgekin”不断转发那条旧谣言。"},{"en":"Don’t join the grudgekin—talk it out and move on.","zh":"别加入“grudgekin”的阵营——把话说开，往前走。"}]}],"synonyms":["resentful relative","someone who holds a grudge","grudge-holder","resentful clique"],"phonetic":"/ˈɡrʌdʒkɪn/","extraExplanation":["“grudgekin”不是常见标准词，更像由 grudge（怨恨）+ kin（亲属/同类）拼出来的俏皮复合词，常用于幽默或讽刺语境。","如果你想用更自然的表达：对亲属可说 “a resentful relative / a relative who holds a grudge”；对群体可说 “people who hold grudges / a resentful clique”。"]}
{"word":"grudgeless","summary":{"en":"“Grudgeless” means forgiving and not holding resentment.","zh":"“grudgeless”表示宽容、不记仇、不怀怨。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not holding grudges; willing to forgive and move on without lasting resentment.","zh":"不记仇的；不怀怨的；愿意原谅并放下不满的。"},"examples":[{"en":"She was grudgeless after the argument and greeted him warmly the next day.","zh":"争吵之后她不记仇，第二天还热情地和他打招呼。"},{"en":"A grudgeless attitude can help friendships recover from small mistakes.","zh":"不记仇的态度能帮助友谊从小失误中恢复过来。"},{"en":"He tried to be grudgeless, even though the comment hurt his feelings.","zh":"尽管那句话伤了他的感情，他还是努力做到不记仇。"}]}],"synonyms":["forgiving","unresentful","magnanimous","big-hearted","without rancor"],"phonetic":"/ˈɡrʌdʒləs/","extraExplanation":["“grudgeless”由“grudge（怨恨/记仇）+ -less（没有……的）”构成，语气通常较正面，强调宽容、心胸开阔。","在日常英语里更常见的说法是“not holding a grudge / forgiving / not resentful”。“grudgeless”偏书面或修辞性用法。"]}
{"word":"grudgeons","summary":{"en":"“Grudgeons” means resentful people who hold grudges; it’s a rare, old-fashioned plural form.","zh":"“grudgeons”指爱记仇、心怀怨恨的人；是一个较罕见、略带旧式文风的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who are habitually resentful or who hold grudges (plural of the rare word “grudgeon”).","zh":"经常心怀怨恨、爱记仇的人（罕见词 grudgeon 的复数）。"},"examples":[{"en":"Try not to become a grudgeon—talk about the problem before it grows into resentment.","zh":"尽量别变成一个爱记仇的人——在问题变成怨气之前就把话说开。"},{"en":"The story’s grudgeons refuse to forgive even small mistakes.","zh":"故事里的这些“记仇的人”连小错误都不肯原谅。"}]}],"synonyms":["people who hold grudges","resentful people","grudgers","grumps"],"phonetic":"/ˈɡrʌdʒən/","extraExplanation":["“Grudgeon”在现代英语里非常少见，多数情况下人们会用更常见的词来表达，比如：someone who holds a grudge（爱记仇的人）、resentful person（心怀怨恨的人）、grump（脾气坏的人）。","如果你是在文学作品或较旧的文本里看到“grudgeons”，通常带有一种“古旧/文风化”的色彩，用来强调人物长期的不满与不肯释怀。"]}
{"word":"grudger","summary":{"en":"A grudger is someone who holds onto resentment and doesn’t easily forgive.","zh":"grudger 指“记仇、怀恨不放的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who holds a grudge—someone who stays angry or resentful about a past wrong for a long time.","zh":"记仇的人；怀恨在心的人——对过去的不公平或伤害长期生气、怨恨的人。"},"examples":[{"en":"He’s a real grudger; he still won’t talk to me about what happened last year.","zh":"他很记仇；他到现在还因为去年的事不跟我说话。"},{"en":"Don’t be a grudger—tell me what upset you so we can fix it.","zh":"别记仇——告诉我哪里让你不开心，我们可以一起解决。"},{"en":"She isn’t a grudger, so she forgave him quickly.","zh":"她不爱记仇，所以很快就原谅了他。"}]}],"synonyms":["grudge-holder","resentful person","bearer of grudges","malcontent"],"phonetic":"/ˈɡrʌdʒɚ/","extraExplanation":["“grudger”由“grudge（怨恨、积怨）+ -er（做……的人）”构成，但在现代英语里不算特别常见；更常见的说法是“someone who holds a grudge”或“a grudge-holder”。在语气上，“grudger”多带一点批评或负面评价。"]}
{"word":"grudgers","summary":{"en":"“Grudgers” means people who hold grudges and stay resentful for a long time.","zh":"“grudgers”指爱记仇、长期怀恨在心的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who keep feeling angry or resentful about something for a long time; people who hold grudges","zh":"长期记仇的人；怀恨在心的人"},"examples":[{"en":"Life is easier when you don’t live like a grudger.","zh":"不当个爱记仇的人，生活会轻松很多。"},{"en":"Some grudgers never forget a small insult.","zh":"有些记仇的人连小小的冒犯都不会忘。"},{"en":"In the story, the grudgers refuse to forgive even after many years.","zh":"在故事里，这些记仇的人即使过了很多年也不肯原谅。"}]}],"synonyms":["grudge-holders","resentful people","the unforgiving"],"phonetic":"/ˈɡrʌdʒɚz/","extraExplanation":["“grudgers”是复数形式，单数是“grudger”。它来自名词“grudge”（怨恨、旧怨）。在日常英语里更常说“someone who holds a grudge / people who hold grudges”，而“grudger”这个名词本身相对少见，带一点评价色彩，暗示这个人很难放下。"]}
{"word":"grudgery","summary":{"en":"Grudgery means dull, repetitive hard work that feels unpleasant or unrewarding.","zh":"Grudgery 指枯燥、重复、费力且让人不快或缺乏成就感的苦差事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hard, boring, and repetitive work, especially work that takes a lot of time and energy but feels unrewarding.","zh":"苦差事；繁重又乏味的重复劳动（常指耗时费力却缺乏成就感的工作）。"},"examples":[{"en":"Filling out the same forms every day felt like pure grudgery.","zh":"每天填同样的表格感觉完全是苦差事。"},{"en":"He wanted a job with creativity, not office grudgery.","zh":"他想要一份有创意的工作，而不是办公室里的苦差事。"},{"en":"Good tools can reduce the grudgery of cleaning.","zh":"好的工具能减少打扫卫生的苦差事。"}]}],"synonyms":["drudgery","grind","routine work","menial work","toil"],"phonetic":"/ˈɡrʌdʒəri/","extraExplanation":["“grudgery”常和“tedium（单调乏味）”“drudgery（苦工）”放在一起理解；其中drudgery更常见，意思非常接近。","词源上与“drudge（做苦工的人；苦干）”有关，强调的是“辛苦但不体面/不令人满足”的劳动。"]}
{"word":"grudges","summary":{"en":"“Grudges” means long-lasting resentments (or the act of holding them) about past wrongs.","zh":"“grudges”指对过去的不快长期记在心里的怨恨（或指怀恨的行为）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, long-lasting feeling of anger or resentment toward someone because of something they did (often remembered for a long time).","zh":"因他人做过的事而产生并长期记在心里的怨恨、积怨。"},"examples":[{"en":"He still holds a grudge against his former boss.","zh":"他仍然对前老板怀恨在心。"},{"en":"Old grudges can damage friendships.","zh":"旧怨会伤害友谊。"}]},{"partOfSpeech":"v.","definition":{"en":"To hold a grudge: to continue feeling resentful and unwilling to forgive.","zh":"怀恨在心；不肯原谅。"},"examples":[{"en":"Try not to grudge; it only hurts you in the end.","zh":"尽量别总记仇；到头来受伤的往往是你自己。"},{"en":"She doesn’t grudge him for leaving—she understands why he did it.","zh":"她并不怨他离开——她理解他的原因。"}]}],"synonyms":["resentments","bitterness","animosity","ill will"],"phonetic":"/ˈɡrʌdʒɪz/","extraExplanation":["“grudge”常用搭配：\n- hold a grudge（记仇、怀恨在心）\n- bear a grudge（心怀怨恨，较正式）\n- have a grudge against someone（对某人有怨气）\n\n易混点：\n- grudge（长期、个人化的怨恨，强调“放不下”）\n- resentment（更宽泛的“愤懑/不满”，不一定针对某个具体事件或人）\n\n词形：你输入的“grudges”通常是复数名词（many grudges），也可能是动词第三人称单数（He grudges…)."]}
{"word":"grudging","summary":{"en":"“Grudging” means reluctant or unwilling, often with some annoyance; it can describe feelings/actions (adj.) or the way you do something (adv.: grudgingly).","zh":"“grudging”表示不情愿、勉强（常带不满）；既可作形容词描述态度/行为，也可对应副词“grudgingly”表示勉强地。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Done, given, or felt unwillingly; with reluctance (often because you feel annoyed or don’t think it’s deserved).","zh":"不情愿的；勉强的（常带有不满或觉得不值得）。"},"examples":[{"en":"She gave him a grudging apology after realizing she was wrong.","zh":"她意识到自己错了之后，才勉强向他道歉。"},{"en":"He earned a grudging respect from his rivals because he worked so hard.","zh":"因为他非常努力，甚至对手也对他产生了几分勉强的敬意。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a reluctant or unwilling way.","zh":"勉强地；不情愿地。"},"examples":[{"en":"I grudgingly agreed to help, even though I was exhausted.","zh":"虽然我很累，但还是勉强同意帮忙。"},{"en":"They grudgingly admitted that the plan had worked.","zh":"他们不情愿地承认这个计划确实奏效了。"}]}],"synonyms":["reluctant","unwilling","begrudging","resentful","halfhearted"],"phonetic":"/ˈɡrʌdʒɪŋ/","extraExplanation":["“grudge”作名词是“怨恨/芥蒂”，作动词有“对……不满；舍不得给/让”。因此“grudging”常暗示：表面上同意或给予，但心里并不痛快。常见搭配：grudging respect/admiration/applause（勉强的尊重/赞赏/掌声），grudging approval（勉强同意）。"]}
{"word":"grudgingly","summary":{"en":"“Grudgingly” means doing something unwillingly and with annoyance.","zh":"“grudgingly”表示“勉强去做、心里不情愿且带着怨气”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a reluctant, unwilling way; with annoyance because you do not want to do it","zh":"勉强地；不情愿地；带着怨气地（因为不想做而仍然去做）"},"examples":[{"en":"He grudgingly apologized after his teacher insisted.","zh":"在老师坚持要求后，他才不情愿地道了歉。"},{"en":"She grudgingly admitted that the plan might work.","zh":"她勉强承认这个计划也许行得通。"},{"en":"They paid the fee grudgingly, complaining the whole time.","zh":"他们一边抱怨一边勉强把费用付了。"}]}],"synonyms":["reluctantly","unwillingly","resentfully","begrudgingly"],"phonetic":"/ˈɡrʌdʒɪŋli/","extraExplanation":["“grudgingly”来自动词“grudge”（怨恨；吝惜；不情愿给/做）。它常用来表达：事情做了，但心里不服气或很不甘愿。常见搭配有：grudgingly agree/admit/apologize/pay/give.","语气上比“reluctantly”（不情愿地）更“带情绪”：不仅不想做，还可能觉得委屈、吃亏或心里不平衡。"]}
{"word":"grudgingness","summary":{"en":"Grudgingness means unwillingness—often with a hint of resentment.","zh":"grudgingness 指“勉强、不情愿”，常带一点怨气或酸意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A reluctant, unenthusiastic attitude; the quality of doing or giving something unwillingly.","zh":"勉强；不情愿的态度；（做或给某事时的）不乐意。"},"examples":[{"en":"He agreed to help, but with clear grudgingness.","zh":"他同意帮忙，但明显很勉强。"},{"en":"Her grudgingness disappeared after she understood the reason.","zh":"她明白原因后，那种不情愿就消失了。"}]},{"partOfSpeech":"n.","definition":{"en":"Resentment or ill will that makes someone slow to forgive or to give praise.","zh":"怨气；不情愿背后的不满或恶意，使人不容易原谅或称赞。"},"examples":[{"en":"There was grudgingness in his voice when he congratulated her.","zh":"他祝贺她时语气里带着不情愿和不满。"},{"en":"Try to let go of grudgingness and focus on what you can change.","zh":"尽量放下怨气，把注意力放在你能改变的事情上。"}]}],"synonyms":["reluctance","resentment","unwillingness","bitterness"],"phonetic":"/ˈɡrʌdʒɪŋnəs/","extraExplanation":["“grudgingness”来自形容词“grudging”（勉强的、带怨气的）加名词后缀“-ness”（表示“……的状态/性质”）。常见搭配：with grudgingness（带着勉强/不甘愿）、a sense of grudgingness（不情愿感）、grudgingness in one’s voice（语气里的不情愿/酸意）。","语感上，“grudgingness”通常比“reluctance”（单纯不愿意）更负面一些，常暗含“心里不舒服、觉得不公平、带点怨”的味道。类似词：resentment（怨恨，更强烈）、begrudging（vt. 嫉妒/不甘心给）。"]}
{"word":"grudgment","summary":{"en":"“Grudgment” isn’t standard English. You probably mean “judgment/judgement” (a decision/opinion) or “grudge” (long-lasting resentment).","zh":"“grudgment”不是标准英文。你大概率想写“judgment/judgement（判断/判决）”或“grudge（怨恨）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “judgment/judgement” (an opinion/decision) or a blend with “grudge” (a resentful feeling).","zh":"不是标准英文单词。很可能是把“judgment/judgement（判断/裁决）”拼错了，或把它和“grudge（怨恨）”混在一起了。"},"examples":[{"en":"I think you meant “judgment”: Please don’t judge him too quickly.","zh":"我觉得你想写的是“judgment”：请不要太快评判他。"},{"en":"If you meant “grudge”: She still holds a grudge about what happened.","zh":"如果你想表达“grudge”：她仍然对那件事怀恨在心。"}]},{"partOfSpeech":"n.","definition":{"en":"judgment (also spelled “judgement”): the ability to form opinions or make good decisions; also, a formal decision by a judge.","zh":"judgment（英式拼写也常见为judgement）：判断力；也指法官作出的裁决/判决。"},"examples":[{"en":"Use your best judgment when you choose a school.","zh":"选择学校时要运用你最好的判断力。"},{"en":"The court’s judgment will be announced tomorrow.","zh":"法院的判决将于明天宣布。"},{"en":"I try not to pass judgment on people I don’t know well.","zh":"我尽量不对不太了解的人妄下评断。"}]},{"partOfSpeech":"n.","definition":{"en":"grudge: a feeling of anger or resentment that lasts for a long time; to continue to feel resentful (often: “hold a grudge”).","zh":"grudge：长期的怨恨；（动词）一直记恨（常见搭配：hold a grudge）。"},"examples":[{"en":"He holds a grudge against his former boss.","zh":"他对前老板一直怀恨在心。"},{"en":"Try not to grudge other people’s success.","zh":"尽量不要对别人的成功心怀不满。"}]}],"synonyms":["judgment","judgement","opinion","decision","verdict","grudge","resentment"],"phonetic":"/ˈdʒʌdʒmənt/","extraExplanation":["“judgment”在美式英语中更常见；“judgement”是英式拼写，两者意思相同。","如果你想表达“带着怨恨去评判”的感觉，英语里更自然的说法是：“a biased judgment,” “a judgment colored by resentment,” 或“to judge grudgingly.”"]}
{"word":"grue","summary":{"en":"Grue most commonly means a fictional monster from classic text-adventure games; it can also refer to Goodman’s philosophy term for a time-defined property, and very rarely an old word for a crane (bird).","zh":"Grue 最常见指经典文字冒险游戏里的虚构怪物；也可指古德曼哲学中“按时间定义的性质”；极少数情况下是“鹤”的古用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(fiction, especially classic text-adventure games) A dangerous imaginary creature said to live in dark places and attack people who are not in the light.","zh":"（虚构，尤指经典文字冒险游戏）一种危险的想象生物，据说栖息在黑暗处，会袭击不在光照中的人。"},"examples":[{"en":"It’s too dark—if you don’t light a torch, you might be eaten by a grue.","zh":"太黑了——如果你不点火把，你可能会被 grue 吃掉。"},{"en":"The game warns you to stay in the light because of the grue.","zh":"游戏警告你要待在光里，因为有 grue 出没。"}]},{"partOfSpeech":"adj.","definition":{"en":"(philosophy/logic) Describing a property that changes by a time rule (famously: something is “grue” if it is green before a certain time and blue afterward).","zh":"（哲学/逻辑）指一种按时间规则变化的性质（著名例子：某物在某个时间之前是绿色、之后是蓝色，就称为“grue”）。"},"examples":[{"en":"In the puzzle, an object can be called grue if it’s green before 2050 and blue after 2050.","zh":"在这个思想实验中，如果一个物体在2050年前是绿色、2050年后是蓝色，就可以称它为 grue。"},{"en":"The term grue is used to discuss how we justify predictions from past observations.","zh":"“grue”这个术语用来讨论我们如何从过去的观察来证明预测的合理性。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) A crane (the bird).","zh":"（罕见/古用）鹤（鸟）。"},"examples":[{"en":"In some older texts, grue could mean a crane by the river.","zh":"在一些较旧的文本里，grue 可能指河边的鹤。"}]}],"synonyms":["(monster) imaginary creature","(monster) game monster","(logic) time-defined predicate","(rare) crane"],"phonetic":"/ɡruː/","extraExplanation":["“grue（怪物）”最出名的来源是早期文字冒险游戏《Zork》系列：玩家在黑暗中行动会收到类似“你可能会被 grue 吃掉”的提示。这句话后来成为英文网络文化里的经典梗，用来幽默地表示“在未知/黑暗处很危险”。","哲学里的“grue”来自哲学家 Nelson Goodman 的“新归纳之谜（New riddle of induction）”。他用“grue/bleen”这类人为定义的词，提醒人们：仅靠过去观察到的规律，并不总能保证未来预测在逻辑上“必然”成立。","“grue=鹤”属于非常少见的古用法；现代英语里几乎不会这样用，学习时主要记住前两个含义更实用。"]}
{"word":"gruel","summary":{"en":"Gruel most commonly means a thin porridge; informally, it can also mean to punish or beat someone harshly.","zh":"gruel 最常指“稀粥”；在非正式用法中也可指“严厉惩罚/打得很惨”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple, thin porridge (usually oats or another grain boiled in water or milk), often considered plain or not very tasty","zh":"（通常用燕麦或其他谷物加水或牛奶煮成的）稀粥；常带有“清淡、寡味”的感觉"},"examples":[{"en":"For breakfast, he ate a bowl of warm gruel.","zh":"早餐他吃了一碗温热的稀粥。"},{"en":"The prisoners were given only bread and gruel.","zh":"囚犯们只得到面包和稀粥。"}]},{"partOfSpeech":"vt.","definition":{"en":"to punish or criticize someone very harshly; to beat someone badly (informal)","zh":"严厉惩罚/痛骂；把某人打得很惨（非正式）"},"examples":[{"en":"The coach really grueled the team after the terrible loss.","zh":"惨败之后，教练把全队狠狠训了一顿。"},{"en":"The boxer got grueled in the final round.","zh":"那名拳击手在最后一回合被打得很惨。"}]}],"synonyms":["porridge","oatmeal (often thicker)","thin porridge","punish","criticize harshly","thrash (informal)"],"phonetic":"/ˈɡruːəl/","extraExplanation":["在英语文化里，gruel 常让人联想到贫困、艰难的生活环境，因为它便宜、做法简单、营养有限。文学作品《雾都孤儿》（Oliver Twist）中有著名情节：孤儿们长期只能吃稀粥（gruel），Oliver 说出 “Please, sir, I want some more.”（先生，请再给我一点。）用来凸显当时救济院的苛刻与饥饿。","作为动词表示“狠狠惩罚/折磨”时，多见于口语或体育语境，带有夸张色彩；正式写作中更常用 punish, criticize severely, defeat badly 等。"]}
{"word":"gruel-eating","summary":{"en":"Living on thin porridge; suggesting poverty or hardship.","zh":"以稀粥充饥的；暗示贫穷或艰苦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Eating gruel (a thin porridge), often suggesting a poor, simple, or harsh diet.","zh":"吃麦片粥/稀粥（gruel）为生的；常带有“贫困、简陋或艰苦饮食”的暗示。"},"examples":[{"en":"The novel portrays gruel-eating orphans in a cold, crowded workhouse.","zh":"这部小说描写了在寒冷拥挤的济贫院里、以稀粥充饥的孤儿。"},{"en":"He described his early years as a gruel-eating struggle for survival.","zh":"他形容自己早年的日子像“靠稀粥度日”那样艰难求生。"}]}],"synonyms":["porridge-eating","meager","impoverished","underfed","destitute"],"phonetic":"/ˈɡruːəl ˌiːtɪŋ/","extraExplanation":["gruel 在英美文化里常与“济贫院/孤儿院/监狱”等场景联系在一起，因为历史上这种稀薄的粥类曾被当作最便宜、最基础的配给食物之一。狄更斯《雾都孤儿》（Oliver Twist）里那种“稀粥配给”的意象非常经典。"],"etymology":"由 gruel（稀粥、麦片粥）+ eating（吃……的）构成的复合形容词；常用于文学或叙述中，以“食物贫乏”来烘托贫困与艰苦。","mnemonic":["把它拆开记：gruel（听起来像“咕噜”）= 肚子咕噜但只能喝稀粥；gruel-eating = “咕噜咕噜喝稀粥的”。","联想中文表达“喝稀粥度日/清汤寡水”，很贴近它常带的“贫困艰苦”语感。"]}
{"word":"gruel-fed","summary":{"en":"fed on thin porridge; poorly provided for","zh":"以稀粥为主喂养的；（引申）供给不足、被苛待的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fed mainly on gruel (a thin porridge); given very simple, poor food.","zh":"以（稀）麦片粥/米粥等清淡稀粥为主食喂养的；吃得很简陋的。"},"examples":[{"en":"The orphan was gruel-fed and always hungry.","zh":"那个孤儿长期只吃稀粥，被喂得很寒酸，总是很饿。"},{"en":"In the old workhouse, children were kept gruel-fed to cut costs.","zh":"在旧时的救济院里，为了省钱，孩子们常被迫只吃稀粥。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Poorly provided for; treated in a harsh, stingy way.","zh":"（比喻）供给不足的；被苛待、被“省着养”的。"},"examples":[{"en":"The staff felt gruel-fed by the tiny budget and endless demands.","zh":"在微薄预算和无休止要求下，员工觉得自己被“省着用”。"},{"en":"A gruel-fed program can’t deliver big results without support.","zh":"一个资源匮乏的项目，没有支持就很难做出大成果。"}]}],"synonyms":["undernourished","ill-fed","poorly fed","half-starved","destitute","impoverished"],"phonetic":"ˈɡruːəl fɛd","extraExplanation":["gruel 常让英语读者联想到狄更斯《雾都孤儿》（Oliver Twist）里救济院孩子们吃得很差的情景，因此 gruel-fed 往往带有“贫穷、被苛刻对待”的情感色彩。"],"etymology":"由 gruel（稀粥）+ fed（被喂养的）构成的复合形容词；字面意思就是“以稀粥喂养”。gruel 在英语里常与贫困、节俭或惩罚式供食的语境相关。","mnemonic":["把它拆开记：gruel（稀粥）+ fed（喂养的）= “只给稀粥吃的”。","联想《雾都孤儿》里“Please, sir, I want some more.”（还想再要一点），画面感强，容易记住这种“吃得很差”的含义。"]}
{"word":"grueled","summary":{"en":"“Grueled” is the past form of the verb “gruel,” meaning made extremely tired by harsh or demanding work or conditions (rarely, fed with gruel).","zh":"“grueled”是动词“gruel”的过去式/过去分词，常指在严苛或高强度的工作/环境下被折磨得精疲力尽（很少也可指被喂稀粥）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “gruel”: to make someone very tired by demanding work, training, or conditions.","zh":"“gruel”的过去式/过去分词：用高强度的工作、训练或环境把人折磨得精疲力尽。"},"examples":[{"en":"After three back-to-back shifts, she was grueled and could barely stay awake.","zh":"连续上了三个班后，她被折磨得精疲力尽，几乎睁不开眼。"},{"en":"The long hike in the heat grueled the whole group.","zh":"高温下的长途徒步把整个队伍都累垮了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare, historical) Past tense/past participle of “gruel”: to feed someone with gruel (a thin porridge).","zh":"（罕见、较旧用法）“gruel”的过去式/过去分词：给某人喂稀粥（燕麦粥等）。"},"examples":[{"en":"In older accounts, patients were often grueled when they couldn’t handle solid food.","zh":"在较早的记载里，病人无法进食固体食物时常被喂稀粥。"}]}],"synonyms":["exhausted","worn out","drained","fatigued"],"phonetic":"/ˈɡruːəld/","extraExplanation":["很多学习者会把 **grueled** 和 **grueling** 搞混：\n- **grueled** 是动词过去式/过去分词（“被累垮了/被折磨了”）。\n- **grueling** 通常是形容词，表示“艰苦的、让人筋疲力尽的”（如 *a grueling exam* 艰难的考试）。\n日常英语里更常见的是 **grueling**，而 **grueled** 相对少见。"]}
{"word":"grueler","summary":{"en":"“Grueler” means an extremely hard and exhausting task or contest.","zh":"“grueler”指一件或一场极其艰难、令人疲惫的任务/经历/比赛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very difficult, tiring experience, task, or contest that requires a lot of effort and endurance","zh":"非常艰难、令人筋疲力尽的经历、任务或比赛（需要很大的努力与耐力）"},"examples":[{"en":"The team played a grueler in the summer heat and barely won.","zh":"球队在酷暑中打了一场苦战，勉强获胜。"},{"en":"It was a grueler of a hike, but the view at the top was worth it.","zh":"这次徒步非常折磨人，但山顶的景色很值得。"},{"en":"Finals week can be a real grueler if you leave everything until the last minute.","zh":"如果把事情都拖到最后，期末周真的会很煎熬。"}]}],"synonyms":["ordeal","marathon","battle","grind","slog"],"phonetic":"/ˈɡruːlər/","extraExplanation":["“grueler”多用于美式口语，常见于体育报道或日常聊天，强调“又累又难、像硬仗/苦战一样”的感觉。它来自形容词“grueling（艰苦的、累人的）”。也常见写法：*grueller*（较少见）。"]}
{"word":"gruelers","summary":{"en":"“Gruelers” is the plural of “grueler,” meaning very tough, exhausting tasks or events.","zh":"“gruelers”是“grueler”的复数，指非常艰难、耗人的任务或事件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very difficult, tiring, or demanding task, event, or experience (often used about games, tests, trips, or work).","zh":"非常艰难、令人筋疲力尽或要求很高的任务／事件／经历（常用于比赛、考试、旅程或工作）。"},"examples":[{"en":"That final exam was a real grueler—I studied all night.","zh":"期末考试真是个“苦战”，我学习到通宵。"},{"en":"The team won after a three-hour grueler in the heat.","zh":"球队在炎热天气里打了三个小时的苦战后获胜。"},{"en":"It was a grueler of a hike, but the view was worth it.","zh":"那次徒步非常艰苦，但风景很值得。"}]}],"synonyms":["ordeal","marathon","backbreaker","killer (informal)","hard slog"],"phonetic":"/ˈɡruːlɚ/","extraExplanation":["“grueler”在美式英语里很常见于体育口语与新闻写作，指“苦战”“硬仗”。也可更广泛地形容任何让人身心耗尽的事。","这个词来自动词“to gruel”（使极度疲惫、折磨），而“gruel”也指一种稀粥；两者都有“让人吃不消”的联想。"]}
{"word":"grueling","summary":{"en":"“Grueling” means extremely difficult and exhausting, physically or mentally, usually over a long period.","zh":"“Grueling”指极其艰难、耗尽体力或心力的（通常持续时间较长）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely tiring and demanding; requiring great effort over a long time.","zh":"极其累人且艰难的；需要长时间付出很大努力的。"},"examples":[{"en":"The hikers finished a grueling 12-hour trek through the mountains.","zh":"徒步者完成了一段艰苦的12小时山地跋涉。"},{"en":"Studying for the bar exam can be grueling, especially while working full-time.","zh":"备考律师资格考试可能非常煎熬，尤其是还要全职工作的时候。"},{"en":"She maintained focus during the grueling final minutes of the match.","zh":"在比赛最后那段艰难的几分钟里，她仍然保持专注。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very hard to endure emotionally or mentally, not just physically.","zh":"（不仅身体上）在情绪或心理上也非常难熬的。"},"examples":[{"en":"The long wait for the diagnosis was grueling for the family.","zh":"对这个家庭来说，等待诊断结果的漫长过程非常煎熬。"},{"en":"It was a grueling decision, but he chose to leave for his own health.","zh":"那是一个很难下的决定，但为了健康他选择离开。"}]}],"synonyms":["exhausting","arduous","backbreaking","punishing","taxing"],"phonetic":"/ˈɡruːəlɪŋ/","extraExplanation":["“Grueling”来自动词“gruel”（使筋疲力尽），常用来形容训练、比赛、工作、行程等“强度很大、持续很久”的事。语气比“tiring/ exhausting”更强调“折磨人、消耗巨大”。","常见搭配：a grueling schedule（魔鬼行程/紧凑到让人崩溃的日程）、grueling workout（高强度训练）、grueling journey（艰辛旅程）、grueling hours（漫长辛苦的工时）。"]}
{"word":"gruelingly","summary":{"en":"“Gruelingly” means “in an extremely exhausting and demanding way.”","zh":"“gruelingly”表示“以极其辛苦、耗尽体力精力的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very difficult, exhausting, and demanding way.","zh":"以非常艰难、令人筋疲力尽、要求很高的方式。"},"examples":[{"en":"They worked gruelingly long hours to finish the project.","zh":"为了完成项目，他们以极其辛苦的方式加班了很长时间。"},{"en":"The training schedule was gruelingly intense.","zh":"训练安排强度大得令人吃不消。"}]}],"synonyms":["exhaustingly","strenuously","ardously","tirelessly","laboriously"],"phonetic":"/ˈɡruːlɪŋli/","extraExplanation":["“gruelingly”来自形容词“grueling”，常用来形容工作、训练、比赛、旅程等“强度大、耗体力/耗精力”。它带有明显的主观感受：不仅“难”，而且“累到快撑不住”。","词源上与“gruel（稀粥）”有关：早期“gruel”也可指一种惩罚性或令人难熬的经历（像只能喝稀粥一样苦）。现代英语里更常用“grueling”，而不是单独用“gruel”来表达“折磨”。"]}
{"word":"gruelings","summary":{"en":"“Gruelings” usually means multiple extremely tiring, demanding things or experiences (plural of “grueling”).","zh":"“Gruelings”通常指多件极其疲惫、艰难的事情或经历（“grueling”的复数）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Plural of grueling) extremely tiring and demanding; requiring great effort for a long time.","zh":"（grueling 的复数）极其疲惫且艰难的；需要长时间付出很大努力的。"},"examples":[{"en":"The team went through several gruelings practices before the championship.","zh":"在锦标赛之前，这支队伍经历了几次极其艰苦的训练。"},{"en":"She survived two gruelings days of travel with delayed flights and no sleep.","zh":"她熬过了两天折腾人的旅程：航班延误，还几乎没睡。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) very difficult experiences or tasks that test your strength or patience.","zh":"（较少见）严峻的考验；让人身心受压的艰难任务或经历。"},"examples":[{"en":"The interview process included multiple gruelings: tests, panels, and long wait times.","zh":"面试流程包含多重“折磨式”考验：测试、多人面试，以及漫长等待。"}]}],"synonyms":["exhausting","draining","backbreaking","punishing","arduous"],"phonetic":"/ˈɡruːəlɪŋ/","extraExplanation":["“grueling”常被误以为和食物“gruel（稀粥）”直接相关，其实更公认的来源是“to gruel”=“使精疲力竭/惩罚性地折磨”，强调把人“耗干”。现代英语里最常用的是形容词，用来形容训练、工作、考试、行程等“非常累、非常耗”的事情。"]}
{"word":"gruelled","summary":{"en":"“Gruelled” means exhausted after something very demanding; it’s also the British past form of the verb “gruel” (to wear someone down).","zh":"“Gruelled”表示经历艰苦折磨后精疲力尽；也可作动词“gruel”（把人累垮/折磨）的英式过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(past participle/adj.) Extremely tired or worn out after very hard work, effort, or suffering; exhausted.","zh":"（过去分词/形容词）因非常艰苦的工作、努力或痛苦而精疲力尽的；筋疲力竭的。"},"examples":[{"en":"After the 12-hour shift, the nurses were gruelled but proud of their work.","zh":"12小时轮班后，护士们筋疲力尽，但仍为自己的工作感到自豪。"},{"en":"He looked gruelled after weeks of studying for the exam.","zh":"为考试复习了好几周后，他看起来疲惫不堪。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of “gruel,” vt.) To exhaust someone through long, difficult work or harsh conditions; to wear down.","zh":"（“gruel”的过去式/过去分词，及物动词）用长期艰苦的劳动或严苛环境把某人累垮；使精疲力尽。"},"examples":[{"en":"The training programme gruelled new recruits in the summer heat.","zh":"在夏季酷暑中，这套训练计划把新兵折腾得够呛。"},{"en":"Years of farm work had gruelled him.","zh":"多年的农活把他累垮了。"}]}],"synonyms":["exhausted","worn out","drained","spent","fatigued"],"phonetic":"/ɡruːld/","extraExplanation":["“gruelled”是英式拼写；美式更常写作“grueled”。两者意思相同。","这个词来自形容词“gruelling/ grueling”（艰苦的、折磨人的）。在现代英语里，动词“to gruel”较少单独使用，但在新闻、回忆录、体育/训练语境中仍会见到。"]}
{"word":"grueller","summary":{"en":"“Grueller” (also spelled “grueler”) means a very hard, exhausting task or contest.","zh":"“grueller”（也可拼作 grueler）指非常艰苦、令人精疲力尽的任务或比赛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A very difficult, tiring, or demanding task, contest, or experience.","zh":"（非正式）非常艰苦、令人疲惫或要求很高的任务、比赛或经历。"},"examples":[{"en":"That marathon was a real grueler—I could barely walk the next day.","zh":"那场马拉松真是个苦差事——我第二天几乎走不动路。"},{"en":"The final exam was a grueler, but I’m glad it’s over.","zh":"期末考试太折磨人了，不过总算结束了。"},{"en":"They won after a grueler of a game that went into overtime.","zh":"那场比赛打到加时，异常艰苦，他们最终赢了。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A person who makes or serves gruel (a thin porridge).","zh":"（罕见）制作或提供麦片粥/稀粥（gruel）的人。"},"examples":[{"en":"In the old tale, the grueler served a warm bowl to the hungry traveler.","zh":"在那个老故事里，熬粥的人给饥饿的旅人端上一碗热粥。"}]}],"synonyms":["ordeal","slog","marathon","grind","trial"],"phonetic":"/ˈɡruːələr/","extraExplanation":["“grueller”常见于英式拼写习惯（类似 traveller / traveler），美式更常写作“grueler”。","这个词多用于口语，尤其在体育报道或日常聊天里，形容“特别难熬的一场比赛/一次经历”。","来源上与形容词“grueling（艰苦的）”同根；“a grueler”基本等于“a grueling experience/contest”的名词化说法。"]}
{"word":"gruellers","summary":{"en":"“Gruellers” means very tough, exhausting tasks or experiences (often written “gruelers” in American English).","zh":"“gruellers”指非常艰难、令人精疲力尽的任务或经历（美式英语常拼作“gruelers”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: gruellers) an extremely difficult, long, or tiring task, event, or experience.","zh":"（复数：gruellers）极其艰难、漫长或令人筋疲力尽的任务、活动或经历。"},"examples":[{"en":"That final exam was a real grueller—I studied all night.","zh":"期末考试真是个“硬仗”（太折磨人了）——我复习了一整夜。"},{"en":"The hike turned into a grueller when it started raining and the trail got muddy.","zh":"开始下雨、路变泥泞后，这次徒步就变成了一场艰苦的折磨。"},{"en":"They completed three gruellers in one week: a marathon, a night shift, and a major presentation.","zh":"他们一周内完成了三件“硬仗”：一场马拉松、一个夜班和一次重要汇报。"}]}],"synonyms":["ordeal","marathon","killer (informal)","grind","trial"],"phonetic":"/ˈɡruːlər/","extraExplanation":["“grueller”多见于英式拼写，对应的美式更常写作“grueler”。两者意思相同，常用于口语或新闻写作中，强调“特别难熬/特别消耗体力或精力”。","词源上与形容词“gruelling/grueling（折磨人的）”相关，来自动词“gruel（使筋疲力尽）”；现代用法里基本不再与名词“gruel（稀粥）”产生实际语义联系。"]}
{"word":"gruelling","summary":{"en":"“Gruelling” means extremely tiring and demanding (US spelling: “grueling”).","zh":"“gruelling”表示“极其累人、艰苦的”（美式拼写为“grueling”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely tiring and demanding; requiring a lot of effort, time, or endurance.","zh":"极其累人且艰苦的；需要大量努力、时间或耐力的。"},"examples":[{"en":"They completed a gruelling 12-hour shift at the hospital.","zh":"他们在医院完成了艰苦的12小时轮班。"},{"en":"Training for a marathon can be gruelling, especially in hot weather.","zh":"马拉松训练可能非常艰苦，尤其是在炎热天气里。"},{"en":"After a gruelling journey, she finally arrived home and fell asleep immediately.","zh":"经历了一段艰苦的旅程后，她终于到家，立刻睡着了。"}]}],"synonyms":["exhausting","arduous","strenuous","taxing","backbreaking"],"phonetic":"/ˈɡruːəlɪŋ/","extraExplanation":["“gruelling”（英式拼写）在美式英语中常写作“grueling”。两者意思相同，只是拼写习惯不同。","这个词常用来形容工作、训练、考试准备、长途旅行等“消耗身心、让人筋疲力尽”的经历，比“tiring”更强调强度和持续时间。"]}
{"word":"gruellingly","summary":{"en":"in an extremely exhausting and demanding way","zh":"以极其辛苦、耗人精力的方式"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an extremely tiring, difficult, or demanding way.","zh":"以极其疲惫、艰难或高强度的方式；苦苦地。"},"examples":[{"en":"They worked gruellingly long hours to finish the project.","zh":"为了完成项目，他们以极其漫长又辛苦的工时工作。"},{"en":"The team trained gruellingly through the summer heat.","zh":"球队在夏季酷暑中进行高强度、非常辛苦的训练。"},{"en":"She climbed gruellingly up the steep trail, stopping often to breathe.","zh":"她艰难地爬上陡峭的山路，常常停下来喘气。"}]}],"synonyms":["exhaustingly","ardously","strenuously","laboriously","tiringly"],"phonetic":"/ˈɡruːəlɪŋli/","extraExplanation":["用法提示：常用来修饰“时间/训练/旅程/工作强度”等，如 gruellingly long hours（长到让人崩溃的工时）、gruellingly hot（热得让人受不了）。","语气与搭配：语感比 very hard / extremely tiring 更“带画面”，强调持续的体力或精神消耗。"],"etymology":"源自形容词【grueling / gruelling】（“艰苦的、使人筋疲力尽的”），其词根与【gruel】有关：gruel 指“稀粥”，早期有“用稀粥般单薄的食物折磨/消耗体力”的联想，后来引申为“令人精疲力竭的”。-ly 构成副词，表示“以……方式”。（英式拼写常见 gruellingly，美式多见 gruelingly。）","mnemonic":["把它拆开记：gruel（稀粥）+ -ling + -ly。想象“只喝稀粥还要干活”，当然会“苦苦地、累到不行”。","联想中文：gruellingly ≈ “苦哈哈地 / 硬撑着地”。"]}
{"word":"gruellings","summary":{"en":"“Gruellings” means exhausting, difficult ordeals or tasks (plural), but it’s uncommon; “grueling/gruelling” is more common as an adjective.","zh":"“gruellings”指“令人筋疲力尽的艰难考验/任务”（复数），但不常见；更常见的是形容词 grueling/gruelling。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"very difficult, exhausting experiences or tasks (plural; uncommon—more often you see the adjective “grueling/gruelling”).","zh":"非常艰难、令人筋疲力尽的经历或任务（复数；不太常见——更常用的是形容词 grueling/gruelling）。"},"examples":[{"en":"After two days of gruellings in training camp, everyone slept early.","zh":"在训练营经历了两天高强度的折磨式训练后，大家都早早睡了。"},{"en":"The team survived several gruellings before the final match.","zh":"在决赛前，这支队伍挺过了好几次艰苦的考验。"}]}],"synonyms":["ordeals","trials","hardships","punishing tasks","tough challenges"],"phonetic":"/ˈɡruːəlɪŋz/","extraExplanation":["“gruellings”多半是把更常见的拼写/用法混用了：美式英语通常写 grueling（形容词），英式英语常写 gruelling（形容词）。形容词用法最常见：a grueling exam（一次很折磨人的考试）、a grueling schedule（很紧凑辛苦的日程）。","作为名词时更自然的说法通常是：a grueling experience / a grueling task，或用 ordeal / trial 来表达“艰难的考验”。"]}
{"word":"gruelly","summary":{"en":"“Gruelly” is an uncommon word meaning “like gruel”—thin, watery, and porridge-like.","zh":"“gruelly”是不常用词，意思是“像稀粥一样”——稀薄、含水、略糊状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Resembling gruel; thin, watery, and porridge-like in texture.","zh":"（不常用）像稀粥（gruel）一样的；质地稀薄、带点糊状。"},"examples":[{"en":"The soup was gruelly and needed more vegetables.","zh":"这汤稀得像稀粥，需要多加点蔬菜。"},{"en":"After boiling too long, the oatmeal turned gruelly.","zh":"煮太久后，燕麦粥变得很稀糊。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Very rare) In a gruel-like way; with a thin, watery consistency.","zh":"（很少见）以稀粥般的方式；呈稀薄含水的状态。"},"examples":[{"en":"The mixture poured out gruelly from the pot.","zh":"混合物从锅里倒出来时稀稀糊糊的。"}]}],"synonyms":["watery","thin","soupy","porridge-like","sloppy"],"phonetic":"/ˈɡruːəli/","extraExplanation":["“gruelly”在现代英语里非常少见，多见于描述食物质地的语境。很多人想表达“极其辛苦的”时会误写成gruelly，但正确拼写是 **grueling**（/ˈɡruːəlɪŋ/）。","词根来自 **gruel**（稀粥）。因此gruelly的核心意思是“像稀粥一样稀薄/糊状”，而不是“艰苦的”。"]}
{"word":"gruels","summary":{"en":"“Gruels” most commonly means thin porridges (plural of gruel). Less commonly, it can be the verb form meaning “makes extremely tired.”","zh":"“gruels”最常见意思是“稀粥”（gruel 的复数）；较少见时也可作动词形式，表示“使人筋疲力尽”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of gruel: a thin porridge, usually made by boiling oats, rice, or other grains in water or milk.","zh":"gruel 的复数：一种稀粥（常用燕麦、米或其他谷物加水或牛奶煮成）。"},"examples":[{"en":"The hospital served warm gruels for patients who couldn’t eat solid food.","zh":"医院为无法吃固体食物的病人提供温热的稀粥。"},{"en":"In old stories, poor families often lived on soups and gruels during winter.","zh":"在旧故事里，贫困家庭冬天常靠汤和稀粥度日。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of gruel (verb, less common): to make someone extremely tired or worn out.","zh":"gruel 的第三人称单数（动词，较少见）：使某人极度疲惫、筋疲力尽。"},"examples":[{"en":"Long hours on the road gruels the drivers.","zh":"长时间在路上会把司机累得筋疲力尽。"},{"en":"The schedule gruels her, especially during busy season.","zh":"这个日程把她折磨得很累，尤其在旺季。"}]}],"synonyms":["porridge","oatmeal (often thicker)","thin cereal","exhaust (verb sense)","wear out (verb sense)"],"phonetic":"/ˈɡruːəl/","extraExplanation":["“gruel”（稀粥）在英语里常带有“简单、清淡、甚至有点清苦”的联想，旧时与贫穷、病后调养或清淡饮食相关。","动词“to gruel（使筋疲力尽）”现在不太常用，更常见的表达是 “exhaust / wear out / tire out”。"]}
{"word":"grues","summary":{"en":"“Grues” is usually the plural of “grue,” most often meaning a dark-dwelling fantasy monster; it can also be a philosophy term (Goodman’s ‘grue’) and, rarely, an old word for a crane.","zh":"“grues”通常是“grue”的复数，最常指住在黑暗中会袭击人的奇幻怪物；也可指哲学术语（Goodman 的“grue”）；极少数情况下是古语，指“鹤”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in some fantasy stories and games) A dangerous creature that attacks people in the dark.","zh":"（一些奇幻故事或游戏中）一种会在黑暗中袭击人的危险怪物。"},"examples":[{"en":"In the game, you should not walk into the cave without a light, or the grues will find you.","zh":"在游戏里，你不该没带光源就走进洞穴，否则那些 grue 会找到你。"},{"en":"The story uses a grue to represent fear of the unknown.","zh":"这个故事用 grue 来象征对未知的恐惧。"}]},{"partOfSpeech":"n.","definition":{"en":"(philosophy) An invented term meaning “green until a certain time, then blue,” used to discuss how we make predictions from past evidence.","zh":"（哲学）一个人为造出的术语，意思是“在某个时间点之前是绿色，之后变成蓝色”，用来讨论我们如何根据过去证据进行预测。"},"examples":[{"en":"The professor explained the ‘grue’ problem to show why induction can be tricky.","zh":"教授用“grue”问题来说明归纳推理为何会很棘手。"},{"en":"Something can be green today but ‘grue’ according to the definition.","zh":"某物今天可能是绿色，但按定义也可以是“grue”。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) A crane (the bird).","zh":"（罕见/古语）鹤；鹭类等长腿涉禽（尤指“crane”）。"},"examples":[{"en":"In older writing, a grue may refer to a crane near the river.","zh":"在较早的作品中，grue 有时指河边的鹤。"}]}],"synonyms":["monster","creature","predator"],"phonetic":"/ɡruː/","extraExplanation":["“grue”在现代英语里并不常见；很多人看到“grues”是因为它作为名词复数（多个怪物）出现在经典文字冒险游戏《Zork》中：著名提示是“It's dark. You might be eaten by a grue.”，因此在游戏文化里很有辨识度。","哲学用法来自美国哲学家 Nelson Goodman 提出的“归纳的新谜题（New riddle of induction）”。他用“grue/bleen”这类人为定义的词，挑战“用过去观察来预测未来”的直觉，让人思考我们为什么更相信‘green（一直是绿色）’而不是‘grue（到某时刻前绿色、之后蓝色）’。"]}
{"word":"gruesome","summary":{"en":"Gruesome means extremely shocking or unpleasant, especially with violent or bloody details; it can also (informally) mean very bad.","zh":"Gruesome 指“骇人/触目惊心的”，尤指带有暴力或血腥细节；口语中也可指“非常糟糕”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely unpleasant or shocking, especially because it involves death, injury, or violence.","zh":"令人极度不适或震惊的，尤其因涉及死亡、受伤或暴力而显得可怕的。"},"examples":[{"en":"The movie includes some gruesome scenes, so it’s not for kids.","zh":"这部电影有一些血腥可怕的场景，所以不适合孩子。"},{"en":"The newspaper avoided printing gruesome photos of the accident.","zh":"报纸避免刊登那场事故的血腥照片。"},{"en":"Police described the crime as gruesome and difficult to investigate.","zh":"警方形容这起案件骇人且难以侦办。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very bad or unpleasant in a strong, informal way (often used for emphasis).","zh":"非常糟糕、令人不快（较口语，常用于强调）。"},"examples":[{"en":"The weather was gruesome all weekend—cold, wet, and windy.","zh":"整个周末天气糟透了——又冷又湿还刮风。"},{"en":"We made a gruesome mistake on the first question.","zh":"我们第一题就犯了个很严重的错误。"}]}],"synonyms":["horrifying","ghastly","grisly","macabre","shocking"],"phonetic":"/ˈɡruːsəm/","extraExplanation":["“gruesome”最常见的语境是描述带有“血腥/暴力细节”的事物（如 gruesome murder, gruesome injuries）。如果只是一般“吓人”，更常用 scary/terrifying；如果是“恶心”，可用 disgusting/gross。","词源上与“让人发抖/恐惧”的含义有关，因此它不仅是“可怕”，还带有“令人作呕、触目惊心”的感觉。","文学和新闻写作中常用来渲染强烈画面感，但日常对人使用时要谨慎：说 someone is gruesome 往往显得很不礼貌，通常改说 the details are gruesome。"]}
{"word":"gruesomely","summary":{"en":"“Gruesomely” means “in a very gruesome way,” often describing something shockingly violent or bloody.","zh":"“gruesomely”意为“以非常骇人/血腥的方式”，常用来形容令人震惊的不适暴力细节或描述方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very gruesome way; extremely and unpleasantly violent, bloody, or shocking to look at or think about.","zh":"以非常骇人的方式；极其血腥、暴力或令人不适、令人震惊地（修饰动作或描述方式）。"},"examples":[{"en":"The film ends with a gruesomely violent scene.","zh":"这部电影以一幕极其血腥暴力的场景结束。"},{"en":"The victim was gruesomely murdered, according to the report.","zh":"据报告称，受害者以极其残忍血腥的方式被杀害。"},{"en":"The accident was described gruesomely in the tabloid.","zh":"这起事故在小报中被描写得十分骇人。"}]}],"synonyms":["horribly","shockingly","brutally","savagely","graphically"],"phonetic":"/ˈɡruːsəmli/","extraExplanation":["“gruesomely”来自形容词“gruesome”（骇人的、血腥的）+ 副词后缀“-ly”。常见搭配有：gruesomely murdered / wounded / injured / described / graphic（以极其骇人的方式被谋杀/受伤/被描写/画面露骨）。","语体与使用场景：多用于新闻报道、犯罪/恐怖题材、严肃叙述或批评“过度渲染”的写法。日常聊天中频率不高，若想更委婉可用“horribly”“terribly”。","文化提示：英语语境中它强调“令人反胃或心理冲击的细节”，常带有对“血腥细节”的负面评价；描述真实事件时使用需注意尊重受害者与读者感受。"]}
{"word":"gruesomeness","summary":{"en":"“Gruesomeness” means the quality or degree of being gruesome—shocking and disturbing, often because of blood, injury, or death.","zh":"“Gruesomeness”指“血腥恐怖、令人不适”的性质或程度，常与血、伤害或死亡相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being extremely unpleasant or shocking, especially because something involves blood, injury, or death","zh":"（尤指因涉及血腥、伤害或死亡而）令人震惊、令人不适的可怕程度；血腥恐怖感"},"examples":[{"en":"The film’s gruesomeness was too much for some viewers.","zh":"这部电影的血腥恐怖程度让一些观众难以接受。"},{"en":"News reports avoided graphic details to reduce the gruesomeness of the story.","zh":"新闻报道避免使用过于直观的细节，以降低故事的血腥恐怖感。"}]}],"synonyms":["ghastliness","horror","macabreness","grisly nature","repulsiveness"],"phonetic":"/ˈɡruːsəm.nəs/","extraExplanation":["“gruesomeness”来自形容词“gruesome”（可怕的、血腥的），后缀“-ness”把形容词变成名词，表示“……的性质/程度”。常用于谈电影、小说、犯罪现场描述等内容的“血腥程度”。","语体上多见于书面语或评论（影评、书评、新闻写作）。在日常口语中，人们更常说“how gruesome it is”（有多血腥/多可怕）或直接用“gruesome”作形容词。"]}
{"word":"gruesomer","summary":{"en":"“Gruesomer” means “more gruesome” (more shocking or horrifying, often in a violent/bloody way).","zh":"“gruesomer”表示“更gruesome”，即更令人震惊或恐惧（常指更血腥、更暴力）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “gruesome”: more extremely unpleasant, shocking, or horrifying (often because it involves violence, blood, or death).","zh":"“gruesome”的比较级：更加令人不适、震惊或恐惧的（常因涉及暴力、血腥或死亡）。"},"examples":[{"en":"The second scene is even gruesomer than the first.","zh":"第二个场景比第一个更血腥、更吓人。"},{"en":"The book gets gruesomer as the mystery is revealed.","zh":"随着谜团揭开，这本书的内容变得更令人毛骨悚然。"}]}],"synonyms":["more gruesome","gorier","more horrifying","more grisly","more macabre"],"phonetic":"/ˈɡruːsəmɚ/","extraExplanation":["“Gruesomer”在口语里能用，但书面语更常见的比较级是“more gruesome”。如果你写作文/正式文本，通常建议用“more gruesome”。","词根上，“gruesome”来自较早的英语/苏格兰英语用法，与“恐怖、令人战栗”的感觉有关；现代英语中多用于形容血腥或令人反胃的画面、细节。"]}
{"word":"gruesomest","summary":{"en":"“Gruesomest” means “the most gruesome”—the most disturbing or horrifying, often involving violence or death.","zh":"“gruesomest”意为“最gruesome的”，即最令人不适或最骇人的，常与暴力或死亡相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “gruesome”: the most shocking, disturbing, or unpleasant (often because it involves death, violence, or injury).","zh":"“gruesome”的最高级：最令人震惊、反感或不适的（常因涉及死亡、暴力或伤害）。"},"examples":[{"en":"It was the gruesomest scene in the film, so I looked away.","zh":"那是电影里最血腥/最骇人的一幕，所以我把视线移开了。"},{"en":"The documentary avoids showing the gruesomest images out of respect for the victims.","zh":"这部纪录片出于对受害者的尊重，避免展示最骇人的画面。"}]}],"synonyms":["most gruesome","most horrifying","most grisly","most ghastly","most macabre"],"phonetic":"/ˈɡruːsəmɪst/","extraExplanation":["“gruesomest”是形容词“gruesome”加“-est”构成的最高级，表示“三者或以上中最……”。在口语和写作中，人们也常用“most gruesome”来表达同样意思，尤其当形容词较长或需要更正式的语气时。"]}
{"word":"gruf","summary":{"en":"“Gruf” is usually a misspelling of “gruff,” meaning rough or unfriendly in voice or manner.","zh":"“gruf”通常是“gruff”的误拼，意思是（声音或态度）粗哑的、生硬的、不太友善的。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) “gruf” is usually a misspelling of “gruff.”","zh":"（非标准拼写）“gruf”通常是“gruff”的拼写错误。"},"examples":[{"en":"I think you mean “gruff,” not “gruf.”","zh":"我想你是想写“gruff”，不是“gruf”。"},{"en":"His voice sounded gruff, but he was kind.","zh":"他的声音听起来很粗哑/生硬，但他人很善良。"}]},{"partOfSpeech":"adj.","definition":{"en":"Rough, stern, or not very friendly in voice or manner (often describing how someone speaks).","zh":"（形容声音或态度）粗哑的；生硬的；不太友善的（多指说话方式）。"},"examples":[{"en":"The teacher gave a gruff answer and walked away.","zh":"老师生硬地回答了一句就走开了。"},{"en":"Don’t worry—she can seem gruff at first.","zh":"别担心——她一开始可能显得有点不友善。"},{"en":"He greeted us in a gruff tone.","zh":"他用粗哑/生硬的语气跟我们打招呼。"}]}],"synonyms":["gruff","brusque","stern","rough","abrupt"],"phonetic":"/ɡrʌf/","extraExplanation":["“gruff”常用来描述“外表/语气凶、但未必坏心”的感觉：例如一个人说话很冲、声音很粗，但其实很可靠。","拼写提示：gruff 结尾是 -ff。常见近义词：brusque（更正式，偏“唐突/简短无礼”）、stern（更偏“严厉”）、rough（更泛）。"]}
{"word":"gruff","summary":{"en":"“Gruff” describes a rough, unfriendly-sounding manner or a hoarse, rough voice.","zh":"“gruff”指说话/态度生硬不友好，或嗓音粗哑低沉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Rough, harsh, or unfriendly in voice or manner (often sounding a little angry).","zh":"（声音或态度）粗声粗气的；生硬不友好的（常带点不耐烦或生气）。"},"examples":[{"en":"He gave a gruff reply and walked away.","zh":"他粗声粗气地回了一句就走开了。"},{"en":"Don’t take it personally—she can sound gruff when she’s busy.","zh":"别往心里去——她忙的时候说话会显得很生硬。"},{"en":"The coach was gruff, but he cared about the team.","zh":"教练说话很严厉生硬，但他很关心球队。"}]},{"partOfSpeech":"n.","definition":{"en":"A hoarse, low, rough sound (especially a voice).","zh":"（尤指嗓音）沙哑低沉的粗哑声。"},"examples":[{"en":"His voice came out in a gruff whisper.","zh":"他的声音带着沙哑低沉的耳语。"},{"en":"She answered with a gruff laugh.","zh":"她用一声粗哑的笑回应。"}]}],"synonyms":["brusque","rough","grumpy","curt","stern"],"phonetic":"/ɡrʌf/","extraExplanation":["“gruff”常用来形容“外冷内热”的感觉：表面上语气冲、态度硬，但不一定真的刻薄。英语里很常见的搭配有：a gruff voice（粗哑的嗓音）、a gruff manner（生硬的举止/态度）、be gruff with someone（对某人说话粗声粗气）。"]}
{"word":"gruffed","summary":{"en":"“Gruffed” usually means “spoke in a gruff, curt way.” It’s an uncommon form in modern usage.","zh":"“gruffed”通常指“用生硬粗声的语气说话”。这个形式在现代英语中不太常见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of gruff) spoke in a rough, abrupt, or unfriendly way.","zh":"（gruff 的过去式/过去分词）用粗声粗气、简短生硬或不太友善的方式说话。"},"examples":[{"en":"He gruffed a quick “No” and walked away.","zh":"他粗声粗气地丢下一句“不要”，就走开了。"},{"en":"The guard gruffed that we had to leave immediately.","zh":"警卫生硬地说我们必须立刻离开。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) made to seem rough, stern, or harsh in tone; sounded gruff.","zh":"（较少见）使语气显得粗硬、严厉；听起来很不客气。"},"examples":[{"en":"Her voice was gruffed by exhaustion, but she wasn’t angry.","zh":"她因为疲惫声音变得粗硬，但并不是在生气。"}]}],"synonyms":["snapped","barked","growled","muttered","grumbled"],"phonetic":"/ɡrʌft/","extraExplanation":["“gruffed”在现代英语里不算常见，更常见的说法是“said gruffly / answered gruffly（粗声粗气地说/回答）”。在口语里也常见短语“gruffed out”（生硬地挤出一句话）。","相关形容词“gruff”常用来形容“外表/语气凶、其实可能心地不坏”的人（有点像“刀子嘴豆腐心”的语感，但不完全等同）。"]}
{"word":"gruffer","summary":{"en":"“Gruffer” means “more gruff”: more blunt or rough in tone or manner.","zh":"“gruffer”表示“更gruff”：语气或态度更生硬、更不客气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “gruff”: more rough, blunt, or unfriendly in voice or manner (often sounding a bit angry or impatient).","zh":"“gruff”的比较级：更粗声粗气的；更生硬/不客气的（常带点生气或不耐烦的感觉）。"},"examples":[{"en":"He sounded gruffer on the phone than he did in person.","zh":"他在电话里听起来比当面更粗声粗气。"},{"en":"Don’t worry—her voice is gruffer when she’s tired.","zh":"别担心——她累的时候声音会更生硬。"}]}],"synonyms":["more blunt","more brusque","more curt","rougher","more surly"],"phonetic":"/ˈɡrʌfər/","extraExplanation":["“gruff”多形容声音、说话方式或态度：语气短促、直接，甚至有点吓人，但不一定真的坏心肠。有时也带一点“外冷内热”的文化印象（比如看起来凶，其实很关心人）。"]}
{"word":"gruffest","summary":{"en":"“Gruffest” means “the most gruff”—the roughest, bluntest, or least friendly-sounding in voice or manner.","zh":"“gruffest”表示“最gruff的”：语气/态度最粗声粗气、最生硬直率、最不友好的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “gruff”: the most rough-sounding, blunt, or unfriendly in manner or voice.","zh":"“gruff”的最高级：在语气或态度上最粗声粗气、最生硬直率、看起来最不友好。"},"examples":[{"en":"Of all the coaches, he had the gruffest voice, but he cared about the team.","zh":"在所有教练里，他的声音最粗哑、语气最生硬，但他很关心球队。"},{"en":"Her gruffest reply still meant “yes”—she just didn’t like small talk.","zh":"她最生硬的回答其实还是表示“同意”——她只是不喜欢寒暄。"}]}],"synonyms":["roughest","bluntest","grimmest","most brusque"],"phonetic":"/ˈɡrʌfəst/","extraExplanation":["“gruffest”是“gruff（粗声粗气/生硬的）”的最高级。常见比较级/最高级：gruff → gruffer → gruffest。","“gruff”常用来形容声音（gruff voice）或说话方式（gruff manner）。它可以表示“听起来凶/不耐烦”，但不一定代表这个人真的坏，有时是“外冷内热”的感觉。"]}
{"word":"gruffier","summary":{"en":"“Gruffier” means “more gruff”—harsher or less friendly in voice or manner.","zh":"“gruffier”表示“更粗哑/更生硬”，多用于形容语气或态度更不友好。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “gruff”: more rough, low, or harsh in voice or manner; less friendly-sounding.","zh":"“gruff”的比较级：声音或态度更粗哑、更生硬、更不客气（听起来不太友好）。"},"examples":[{"en":"He sounded gruffier on the phone than he did in person.","zh":"他在电话里听起来比当面更生硬。"},{"en":"Don’t take it personally—she gets gruffier when she’s tired.","zh":"别往心里去——她累的时候说话会更冲。"},{"en":"The coach’s gruffier tone was meant to push the team, not insult them.","zh":"教练更严厉的语气是为了激励队伍，不是为了羞辱人。"}]}],"synonyms":["harsher","rougher","more brusque","more curt"],"phonetic":"/ˈɡrʌfiər/","extraExplanation":["“gruffier”常形容“说话的语气/态度”更不客气或更粗声粗气，但不一定表示这个人更坏；很多语境里只是“更直接、更严厉、缺少客套”。","拼写小提示：gruff → gruffier（以 -y 结尾的形容词常用 -ier 构成比较级）。"]}
{"word":"gruffiest","summary":{"en":"“Gruffiest” means “the most gruff”: the most rough or abrupt in voice or manner.","zh":"“gruffiest”表示“最粗声粗气/最生硬的”：在声音或态度上最不友好、最冲。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “gruff”: the most rough, abrupt, and not very friendly in voice or manner (though not necessarily unkind).","zh":"“gruff”的最高级：声音或态度最粗哑、最生硬、最不友好（但不一定是坏心）。"},"examples":[{"en":"Of all the coaches, Mr. Harris is the gruffiest, but he really cares about the team.","zh":"在所有教练里，哈里斯先生最粗声粗气，但他真的很关心球队。"},{"en":"The gruffiest voice on the phone turned gentle when he heard the child crying.","zh":"电话里最粗哑生硬的声音，在听到孩子哭后也变得温柔了。"}]}],"synonyms":["most abrupt","most brusque","most curt","most rough-spoken","most grumpy-sounding"],"phonetic":"ˈɡrʌfiəst","extraExplanation":["“gruffiest”是形容词“gruff”的最高级（gruff → gruffer → gruffiest）。常用来描述说话方式或态度“听起来不太友好、很冲”，但语境里常带有“外冷内热/刀子嘴豆腐心”的感觉。","在英语叙事里，作者有时会用“the gruffiest …”制造反差：表面最凶的人，往往在关键时刻最可靠或最温柔。"]}
{"word":"gruffily","summary":{"en":"“Gruffily” means speaking or acting in a rough, blunt, unfriendly way.","zh":"“gruffily”表示用粗声粗气、直截了当但不太友好的方式说话或行事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rough, blunt, and not very friendly way, often because someone is annoyed, tired, or trying to sound strict.","zh":"以粗声粗气、直截了当且不太友好的方式（常因生气、疲惫，或想显得严厉）。"},"examples":[{"en":"He answered gruffily, ‘I’m busy. Come back later.’","zh":"他粗声粗气地回答：“我很忙，晚点再来。”"},{"en":"The guard gruffily told us to show our IDs.","zh":"警卫粗声粗气地让我们出示证件。"},{"en":"She spoke gruffily, but she later apologized.","zh":"她说话很粗鲁，但后来道歉了。"}]}],"synonyms":["brusquely","roughly","bluntly","curtly"],"phonetic":"/ˈɡrʌfəli/","extraExplanation":["“gruffily”来自形容词“gruff”（粗哑的；粗鲁的）加副词后缀“-ly”。它强调“说话的方式/语气”不友好，但不一定表示这个人本质坏；有时只是压力大、赶时间或性格外冷内热。","常见搭配：answer/say/speak gruffily（粗声粗气地回答/说道/说话）。","近义词有时可用“roughly”“brusquely”，但“gruffily”更突出“低沉、粗哑、带刺的语气”。"]}
{"word":"gruffiness","summary":{"en":"“Gruffiness” means a blunt, rough, slightly unfriendly manner or voice.","zh":"“Gruffiness”指说话/态度粗声粗气、生硬，听起来有点不友好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being gruff: having a rough, blunt, or slightly unfriendly-sounding manner or voice.","zh":"粗声粗气、态度生硬（听起来有点不友好）的特质；粗鲁感。"},"examples":[{"en":"His gruffiness scared me at first, but he was actually kind.","zh":"一开始他的粗声粗气让我有点害怕，但他其实很善良。"},{"en":"Don’t take her gruffiness personally—she’s just tired today.","zh":"别把她的生硬态度往心里去——她今天只是累了。"},{"en":"The coach’s gruffiness hid how much he cared about the team.","zh":"教练的生硬语气掩盖了他对球队的在乎。"}]}],"synonyms":["bluntness","roughness","brusqueness","harshness"],"phonetic":"/ˈɡrʌfinəs/","extraExplanation":["“gruffiness”通常指“语气/态度听起来很冲、很硬”，不一定等于真的“刻薄”或“坏心”。很多语境里带有“外冷内热”的感觉。","常见搭配：someone’s gruffiness（某人的粗声粗气）、a touch of gruffiness（有点生硬）、beneath the gruffiness（在生硬外表之下）。","近义词细微差别：bluntness 更强调“直来直去”；rudeness 更接近“无礼”；harshness 更强调“刺耳/严厉”。"]}
{"word":"gruffing","summary":{"en":"“Gruffing” means speaking in a gruff (rough, abrupt) way; it’s an uncommon verb form, and “gruff” is more often used as an adjective.","zh":"“gruffing”指用粗哑、生硬、很冲的语气说话；这种动词形式不太常见，更常见用形容词“gruff”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"speaking or responding in a rough, abrupt, or unfriendly-sounding way (present participle of the rare verb “to gruff”).","zh":"（罕见动词 to gruff 的现在分词）用粗哑、生硬、带点不耐烦或不友好的语气说话/回应。"},"examples":[{"en":"He was gruffing at the waiter, even though the waiter was trying to help.","zh":"他对服务员用很冲、很生硬的语气说话，尽管服务员在努力帮忙。"},{"en":"Stop gruffing and tell me what’s wrong.","zh":"别再用那么冲的语气了，告诉我到底怎么了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) saying something in a gruff voice.","zh":"（较少见）用粗哑生硬的嗓音说出某句话。"},"examples":[{"en":"“No more questions,” she said, gruffing the words through clenched teeth.","zh":"“别再问了。”她咬紧牙关，用粗哑生硬的声音挤出这句话。"}]}],"synonyms":["snapping","barking","growling","speaking gruffly","being curt"],"phonetic":"/ˈɡrʌfɪŋ/","extraExplanation":["“gruffing”在现代英语里不算常见写法；更常见的是用形容词“gruff”来描述语气或声音（a gruff voice / a gruff reply），或用更自然的动词表达：snap, bark, growl, speak gruffly。","学习时可以把它理解为“用很冲、很硬、很不耐烦的语气在说话”。在口语与写作中，改用“being gruff / speaking gruffly”通常更地道。"]}
{"word":"gruffish","summary":{"en":"“Gruffish” means slightly gruff—somewhat rough or blunt in tone or manner.","zh":"“gruffish” 指“有点粗声粗气/态度生硬”，但程度较轻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat gruff; a little rough, blunt, or unfriendly in manner or voice (but not extremely so).","zh":"有点粗鲁或生硬的；语气或态度略显不友好（但不算特别严重）。"},"examples":[{"en":"He sounded gruffish on the phone, but he was actually trying to help.","zh":"他在电话里听起来有点生硬，但其实是在帮忙。"},{"en":"Her gruffish reply made me nervous at first.","zh":"她有点粗鲁的回答一开始让我紧张。"},{"en":"The coach gave a gruffish warning and then smiled.","zh":"教练用略显严厉的语气警告了一句，然后又笑了。"}]}],"synonyms":["somewhat gruff","a bit gruff","blunt","brusque","rough-spoken"],"phonetic":"/ˈɡrʌfɪʃ/","extraExplanation":["“-ish” 常表示“有点……、带点……的感觉”，语气比原词更弱、更含蓄。例如：greenish（有点绿）、childish（有点孩子气，常带贬义或评价）。所以 gruffish 通常比 gruff（粗声粗气、态度生硬）更轻一些，也可能暗示“只是听起来这样”，不一定真的不友善。","gruffish 不是特别常见的标准词汇，更常见的说法是 “a bit gruff / kind of gruff / somewhat gruff”。写作或对话中用 gruffish 会带一点口语、轻描淡写的味道。"]}
{"word":"gruffly","summary":{"en":"Gruffly means speaking in a rough, blunt, or slightly rude-sounding way.","zh":"gruffly 指说话（或回应）时语气粗硬、直硬，听起来有点不客气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rough, blunt, or slightly rude way, often sounding unfriendly.","zh":"以粗声粗气、直硬甚至有点不客气的方式（说话/回应），听起来不太友好。"},"examples":[{"en":"“What do you want?” he asked gruffly.","zh":"“你想干什么？”他粗声粗气地问。"},{"en":"She answered gruffly, but she wasn’t angry—just tired.","zh":"她回答得很生硬，但她并不生气——只是太累了。"},{"en":"The guard gruffly told us to step back.","zh":"保安粗声粗气地让我们退后。"}]}],"synonyms":["roughly","bluntly","brusquely","harshly"],"phonetic":"/ˈɡrʌfli/","extraExplanation":["“gruffly”通常描述说话的语气（tone of voice），不一定表示这个人真的坏或生气；有时只是嗓音低沉、态度直接、或者疲惫。","常见搭配：say/ask/reply/answer/tell (someone) gruffly；也常与but连用形成反差：He spoke gruffly, but his eyes were kind.（语气硬，但内心善）"]}
{"word":"gruffness","summary":{"en":"Gruffness means a rough, abrupt, or unfriendly-sounding manner—often just in tone, not true hostility.","zh":"Gruffness 指说话或态度粗声粗气、简短生硬的特质，常是语气上的“不好亲近”，不一定代表恶意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of sounding rough, abrupt, or unfriendly in voice, manner, or speech (often without truly bad intentions).","zh":"（声音、态度或说话方式）粗声粗气、简短生硬、显得不太友善的特质（有时并非真的恶意）。"},"examples":[{"en":"Don’t mistake his gruffness for anger—he’s actually very kind.","zh":"别把他的粗声粗气当成生气——他其实很善良。"},{"en":"Her gruffness made the meeting feel tense at first.","zh":"她说话生硬，让会议一开始显得有点紧张。"},{"en":"The coach’s gruffness was meant to push the team to work harder.","zh":"教练的严厉生硬是为了督促队员更努力。"}]}],"synonyms":["abruptness","gruff manner","roughness","sternness","brusqueness"],"phonetic":"/ˈɡrʌfnəs/","extraExplanation":["“gruffness”来自形容词“gruff”（粗哑的；生硬的）。常用来形容一个人的“外冷内热”气质：表面说话冲、语气硬，但内心未必不友好。","语感上，“gruffness”更强调“声音/语气粗硬、话少而直接”；如果强调“刻意无礼”，更常用“rudeness”（粗鲁）或“harshness”（严厉/刺耳）。","常见搭配：his/her gruffness；a hint/touch of gruffness（有点生硬）；beneath the gruffness（在生硬外表之下）。"]}
{"word":"gruffs","summary":{"en":"“Gruffs” is usually a form of “gruff”: either plural noun (“gruff remarks”) or a verb form, but “gruff” is most commonly used as an adjective meaning rough and not very friendly in tone.","zh":"“gruffs”通常是“gruff”的一种变形：可作名词复数（粗声粗气的话）或少见动词形式；但“gruff”最常见作形容词，表示语气/态度粗声粗气、不太友好。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(plural form of “gruff”) Rough and unfriendly in voice or manner; not gentle or polite.","zh":"（“gruff”的复数/变化形式）嗓音或态度粗声粗气的；不太客气、缺少温和感的。"},"examples":[{"en":"The coach’s comments can sound gruffs at first, but he really wants you to improve.","zh":"教练的话一开始听起来可能有点粗声粗气，但他其实是希望你进步。"},{"en":"She answered in gruffs tones because she was tired, not angry.","zh":"她因为太累，用了有点粗声粗气的语气回答，并不是在生气。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of the noun “gruff”) Short rough-sounding remarks or responses.","zh":"（名词“gruff”的复数）粗声粗气的短话/生硬的回应。"},"examples":[{"en":"His gruffs were meant as jokes, but they didn’t land well.","zh":"他那些粗声粗气的话本来是开玩笑，但效果不太好。"},{"en":"After a few gruffs, he softened and apologized.","zh":"粗声粗气地说了几句后，他语气缓和下来并道了歉。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of the rare verb “gruff”) To speak in a rough, abrupt way.","zh":"（少见动词“gruff”的第三人称单数）用生硬、粗短的方式说话。"},"examples":[{"en":"He gruffs a quick “no” and walks away.","zh":"他生硬地快速说了句“不要”，就走开了。"}]}],"synonyms":["brusque","grumpy","abrupt","curt","rough-spoken","growly"],"phonetic":"/ɡrʌf/","extraExplanation":["“gruffs”更常见的情况是：你看到的是原形词“gruff”的一种变形（第三人称单数或名词复数），但在实际英语里更常用“gruff”作形容词（a gruff voice / a gruff manner）。","发音与拼写提示：词尾 -s 在清辅音 /f/ 后通常读作 /s/，所以“gruffs”听起来像 /ɡrʌfs/（但词条常以原形“gruff”收录）。"]}
{"word":"gruffy","summary":{"en":"“Gruffy” means somewhat gruff: rough, brusque, and unfriendly in tone (informal).","zh":"“gruffy”表示有点“gruff”：语气粗硬、态度不太友好（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"rough and unfriendly in manner; speaking in a short, brusque way (informal).","zh":"态度粗鲁不友好；说话生硬简短（非正式用法）。"},"examples":[{"en":"The clerk sounded gruffy on the phone, but he was helpful in the end.","zh":"店员在电话里听起来很“gruffy”（语气生硬），但最后还是帮了忙。"},{"en":"Don’t take her gruffy tone personally—she’s just tired.","zh":"别把她生硬的语气往心里去——她只是累了。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a rough, untidy, or scruffy look (less common).","zh":"外表粗糙、邋遢或不修边幅（较少见）。"},"examples":[{"en":"After the long trip, he looked a bit gruffy and needed a shower.","zh":"长途旅行后，他看起来有点邋遢，需要洗个澡。"}]}],"synonyms":["gruff","brusque","curt","crabby","snappish"],"phonetic":"/ˈɡrʌfi/","extraExplanation":["“gruffy”并不是最标准、最常见的词形，更常用的是“gruff”。“gruffy”多见于口语或较随意的写法，用来强调一种“有点凶/有点粗声粗气”的感觉。","“gruff / gruffy”常形容“表面上不太客气，但不一定坏心肠”的人：语气硬、话少，但可能仍然会帮忙。"]}
{"word":"gruft","summary":{"en":"“Gruft” is a German loanword meaning a tomb or crypt (burial chamber).","zh":"“Gruft”是德语借词，意思是“墓穴/墓室（crypt, tomb）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tomb or crypt (a burial chamber), especially in German contexts; sometimes used in English as a German loanword.","zh":"（德语借词）墓穴；地窖式墓室（尤指“墓穴/灵柩室”一类的埋葬空间）。"},"examples":[{"en":"The museum display mentioned an old family Gruft beneath the church.","zh":"博物馆的展板提到教堂下面有一处古老的家族墓穴（Gruft）。"},{"en":"In the novel’s German setting, the characters visit the Gruft to pay their respects.","zh":"在这部以德国为背景的小说里，人物去墓穴（Gruft）致意。"}]}],"synonyms":["crypt","tomb","vault","sepulcher"],"phonetic":"/ɡrʊft/","extraExplanation":["“Gruft”来自德语，常见意思是“墓穴/灵柩室”，在英语里多出现在涉及德语文化、历史、宗教建筑（如教堂地下的墓室）的语境中。","在日常英语里更常用的对应词是“crypt”或“tomb”。如果你是在乐队名、作品名、游戏/角色名里看到“Gruft”，它可能借用了“墓穴”带来的阴森、哥特风格的联想。"]}
{"word":"grufted","summary":{"en":"Grifted is slang for having swindled someone or made money through dishonest hustles.","zh":"Grifted 是俚语，指“骗钱/行骗了”，或“靠不诚实的小手段捞钱”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(slang) Tricked someone out of money or valuables; swindled.","zh":"（俚语）骗取（他人）钱财或贵重物；诈骗。"},"examples":[{"en":"He grifted tourists by selling fake “VIP” tickets.","zh":"他靠卖假的“VIP”门票来骗游客的钱。"},{"en":"They say the caller grifted elderly people out of their savings.","zh":"他们说那个来电者骗走了老年人的积蓄。"}]},{"partOfSpeech":"vi.","definition":{"en":"(slang) Made money through small-time scams or dishonest hustles.","zh":"（俚语）靠小骗局或不诚实的“捞钱手段”赚钱。"},"examples":[{"en":"After losing his job, he grifted for a while before finding steady work.","zh":"失业后，他靠歪门邪道捞了一阵子钱，后来才找到稳定工作。"},{"en":"She admitted she’d grifted online using made-up stories.","zh":"她承认自己在网上编故事行骗。"}]}],"synonyms":["scammed","swindled","conned","hustled"],"phonetic":"/ˈɡrɪftɪd/","extraExplanation":["“grifted”通常是动词“grift”的过去式/过去分词，属美国英语俚语，意思接近“scam（诈骗）/swindle（骗钱）/con（行骗）”。","你输入的“grufted”并不常见；很多情况下是把“grifted”拼错了。若你本来想写的是“grafted”（嫁接/移植/辛勤工作）或“gruft”（德语：地窖、墓室/家族墓穴），告诉我语境我可以按正确词条解释。"]}
{"word":"grugous","summary":{"en":"“Grugous” is not a standard word; it likely means “gorgeous.”","zh":"“grugous”不是标准词；多半是想写“gorgeous（很美/极好）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “gorgeous” (very beautiful; wonderful).","zh":"不是标准英语单词。很可能是把 “gorgeous”（非常漂亮；极好）拼错了。"},"examples":[{"en":"I can’t find “grugous” in a dictionary—did you mean “gorgeous”?","zh":"我在词典里找不到 “grugous”——你是不是想写 “gorgeous”？"},{"en":"She wore a gorgeous dress to the party.","zh":"她穿了一条非常漂亮的裙子去参加派对。"}]}],"synonyms":["beautiful","stunning","lovely"],"phonetic":"/ˈɡɔr.dʒəs/","extraExplanation":["“grugous”常见原因是把 gorgeous 的拼写搞混了：正确拼写是 g-o-r-g-e-o-u-s（中间有 -geous）。","如果你原本想表达“健谈/话多”，可能想写的是 garrulous；如果想表达“可怕的/令人不适的”，可能是 gruesome。可以告诉我你的句子，我来帮你确认最合适的词。"]}
{"word":"grugru","summary":{"en":"Grugru is a Caribbean word referring either to a spiny tropical palm (gru-gru palm) or to the edible palm-weevil larva (“grugru worm”) found in palm trunks.","zh":"Grugru 是加勒比地区用语，可指一种带刺的热带棕榈（gru-gru palm），也可指生活在棕榈树干里的可食用象鼻虫幼虫（grugru worm）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Caribbean, Guyana) A tropical palm (often the gru-gru palm), or the hard, spiny trunk of that palm.","zh":"（加勒比、圭亚那）一种热带棕榈（常指“gru-gru palm”），也可指这种棕榈坚硬、带刺的树干。"},"examples":[{"en":"The path was blocked by a fallen grugru, covered with sharp spines.","zh":"小路被倒下的 grugru 挡住了，上面满是锋利的刺。"},{"en":"In some villages, grugru palms grow near the coast.","zh":"在一些村庄里，海边附近会生长 grugru 棕榈。"}]},{"partOfSpeech":"n.","definition":{"en":"(Caribbean) The edible larva of a palm weevil found in palm trees (often called the “grugru worm”).","zh":"（加勒比）生长在棕榈中的象鼻虫幼虫，可食用，常被称为“grugru worm”（grugru 虫）。"},"examples":[{"en":"Some people roast grugru worm as a traditional snack.","zh":"有些人会把 grugru 虫烤来吃，当作传统小吃。"},{"en":"He tried grugru for the first time at a local market.","zh":"他在当地市场第一次尝了 grugru。"},{"en":"The guide explained how grugru larvae live inside palm trunks.","zh":"导游解释了 grugru 幼虫如何生活在棕榈树干里。"}]}],"synonyms":["gru-gru (variant spelling)","grugru worm","palm weevil larva"],"phonetic":"/ˈɡruːɡruː/","extraExplanation":["“grugru”在英语里属于地区性词汇，主要见于加勒比地区（如特立尼达和多巴哥、圭亚那等）。有时也写作“gru-gru”。在当地饮食文化中，“grugru worm”常被视为高蛋白的传统食材（可烤、可炸），但在其他英语地区并不常见。","如果你是在音乐、昵称、网络用语里看到“grugru”，也可能只是拟声或自造词；给我一句原句/语境，我可以帮你判断具体意思。"]}
{"word":"grugrus","summary":{"en":"“grugrus” is not recognized as a standard English word; it may be a typo or an invented term.","zh":"“grugrus”不是标准英语单词；可能是拼写错误或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo, a username, an invented word, or a misspelling of a similar-looking word.","zh":"不是标准英语单词。它很可能是拼写错误、用户名、自造词，或与某个相似单词混淆了。"},"examples":[{"en":"“Grugrus” doesn’t appear in most English dictionaries—could you share the sentence where you saw it?","zh":"“grugrus”在大多数英语词典里找不到——你能把看到它的句子发我吗？"},{"en":"If you meant “guru,” it refers to an expert or spiritual teacher.","zh":"如果你想写的是“guru”，它指“专家”或“精神导师”。"},{"en":"If you meant “grouse,” it can mean “to complain” in informal English.","zh":"如果你想写的是“grouse”，在非正式英语里它可以表示“抱怨”。"}]}],"phonetic":"/ˈɡruːɡruːz/","extraExplanation":["“grugrus”可能是键盘连打或重复输入造成的（例如把某个词打成了两遍）。","你可以告诉我：1）它出现的上下文句子；2）你想表达的意思（人/物/动作/情绪）；3）是否来自游戏、小说、账号名或某种特定圈子。这样我能更准确判断你原本想写的词（比如 guru / grouse / Grug 等）。"]}
{"word":"gruidae","summary":{"en":"Gruidae is the scientific family name for cranes.","zh":"Gruidae 是“鹤科”的科学名称，即鹤所属的鸟类家族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the bird family that includes cranes (long-legged, long-necked birds often found in wetlands and grasslands); a scientific (Latin) taxonomic name","zh":"鹤科（包含各种“鹤”的鸟类家族；常见于湿地与草原的长腿长颈鸟）；一种拉丁化的科学分类名称"},"examples":[{"en":"Cranes belong to the family Gruidae.","zh":"鹤属于鹤科（Gruidae）。"},{"en":"The reserve protects several Gruidae species during migration.","zh":"这个保护区在迁徙季保护多种鹤科鸟类。"}]}],"synonyms":["cranes (common name)"],"phonetic":"/ˈɡruːɪdiː/","extraExplanation":["“Gruidae”是生物分类学中的“科名”，常见于学术文章与鸟类图鉴；日常英语更常说“cranes（鹤）”。","词尾“-idae”表示“某某科”（family），来源于拉丁/希腊的命名传统；因此Gruidae字面上就是“鹤这一科”。","在很多文化中（尤其东亚），鹤常象征长寿、高雅与吉祥；但在英文里，象征意义不一定随“Gruidae”这个科学词一起出现，更多用于客观分类。"]}
{"word":"gruiform","summary":{"en":"“Gruiform” describes birds that belong to the order Gruiformes, such as cranes and rails.","zh":"“gruiform”指属于鹤形目（如鹤、秧鸡等）的鸟类，或与该类群有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or belonging to the bird order Gruiformes (a group that includes cranes, rails, coots, and their relatives).","zh":"（形容词）与鹤形目（Gruiformes）鸟类有关的；属于鹤形目的（包括鹤、秧鸡、骨顶鸡等及其近缘类群）。"},"examples":[{"en":"Cranes are a well-known gruiform group found on several continents.","zh":"鹤类是著名的鹤形目鸟类群，分布在多个大洲。"},{"en":"The field guide lists rails as gruiform birds.","zh":"这本野外图鉴把秧鸡列为鹤形目的鸟类。"}]}],"synonyms":["gruiform bird (phrase)","member of Gruiformes (phrase)"],"phonetic":"/ˈɡruːɪfɔːrm/","extraExplanation":["“gruiform”来自拉丁语词根：grus（鹤）+ -form（形态/类型），字面意思接近“像鹤的”。","在现代鸟类分类中，“鹤形目（Gruiformes）”是一个科学分类单元；不同研究与分类体系对其范围可能略有调整，因此在学术或图鉴语境里使用更常见。","这是偏专业的动物学/鸟类学用词，日常英语里更常说具体鸟名（crane, rail, coot）而不是用“gruiform”。"]}
{"word":"Gruiformes","summary":{"en":"a taxonomic order of birds including cranes and rails.","zh":"包含鹤与秧鸡等的鸟类分类“目”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific order of birds that includes cranes, rails, coots, and their relatives (used in biological classification).","zh":"鸟类的一个（生物分类）目，包含鹤、秧鸡、骨顶鸡等及其近缘类群（科学分类用语）。"},"examples":[{"en":"Cranes are commonly placed in the order Gruiformes in traditional classifications.","zh":"在传统分类中，鹤通常被归入鹤形目（Gruiformes）。"},{"en":"The museum label lists the bird as Gruiformes, family Rallidae.","zh":"博物馆标签把这只鸟标为鹤形目（Gruiformes）、秧鸡科（Rallidae）。"}]}],"synonyms":["crane order","Gruiform birds","cranes and rails"],"phonetic":"ˈɡruːɪfɔːrmiːz","extraExplanation":["这是一个拉丁化的科学名称，常见于论文、博物馆标签和野外图鉴；口语里更常说“cranes and rails（鹤和秧鸡类）”。","现代分子系统学研究对这一“目”的范围有过调整；不同资料可能会把某些类群分到其他目中，这是分类学更新造成的差异。"],"etymology":"源自新拉丁语：grus（“鹤”）+ -formes（“……形的/……类的”），字面意思是“鹤形的（鸟类）”。","mnemonic":["拆开记：gru- ≈ grus（鹤）+ -formes（形/类）→ “鹤形目”。","联想“form=形”：-formes 就是“某种形态的一类”。"]}
{"word":"gruiformes","summary":{"en":"Gruiformes is the bird order name often used for cranes, rails, and related species.","zh":"Gruiformes 指鸟类的“鹤形目”，常用来统称鹤、秧鸡等相关鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (taxonomic) order of birds that traditionally includes cranes, rails, coots, and their relatives","zh":"（鸟类分类学中的）鹤形目：传统上包括鹤、秧鸡、骨顶鸡等及其近缘鸟类的一个鸟类“目”"},"examples":[{"en":"Cranes belong to the order Gruiformes in many traditional classification systems.","zh":"在许多传统分类系统中，鹤属于鹤形目（Gruiformes）。"},{"en":"The field guide lists rails under Gruiformes.","zh":"这本野外图鉴把秧鸡归在鹤形目（Gruiformes）下面。"}]}],"synonyms":["order Gruiformes","gruiform birds"],"phonetic":"/ˈɡruɪfɔːrmiːz/","extraExplanation":["“Gruiformes”来自拉丁语词根：grus（鹤）+ -formes（“……形的/……类的”）。因此它字面意思接近“像鹤的（鸟）”。","分类学会随研究方法（尤其是DNA系统发育研究）而调整：有些现代分类把部分传统“鹤形目”成员拆分到其他类群中；读到不同资料时，目（order）的范围可能不完全一致。"]}
{"word":"gruine","summary":{"en":"Genuine means “real/authentic” or “sincere/honest.”","zh":"genuine 表示“真实正宗的”，也可表示“真诚坦率的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"truly real; not fake or copied; authentic.","zh":"真实的；非假冒的；正宗的。"},"examples":[{"en":"This is a genuine leather wallet, not synthetic material.","zh":"这是一个真皮钱包，不是合成材料。"},{"en":"Be careful online—some “brand-name” products are not genuine.","zh":"网购要小心——有些“名牌”产品并不正宗。"}]},{"partOfSpeech":"adj.","definition":{"en":"sincerely felt or expressed; honest and heartfelt.","zh":"真诚的；由衷的；诚恳的。"},"examples":[{"en":"She gave a genuine apology for being late.","zh":"她为迟到做出了真诚的道歉。"},{"en":"His smile seemed genuine.","zh":"他的笑容看起来很真诚。"}]}],"synonyms":["real","authentic","legitimate","sincere","true"],"phonetic":"/ˈdʒɛn.ju.ɪn/","extraExplanation":["你输入的“gruine”在英语里不常见，最可能是拼写错误，常见目标词是“genuine”。如果你想查的是别的词（例如人名、品牌或外来词），可以告诉我你看到它的句子或语境。","词源提示：genuine 来自拉丁语，核心含义是“出生/来源正当的”，后来引申为“真正的、可信的”。常见搭配：genuine leather（真皮）、genuine interest（真兴趣/真心关注）、genuine concern（真切关心）。"]}
{"word":"gruis","summary":{"en":"“Gruis” is used in astronomy in star names, meaning “of the constellation Grus (the Crane).”","zh":"“Gruis”多用于天文学恒星命名中，表示“属于天鹤座（Grus）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Astronomy) The Latin genitive form of Grus, used in star names to mean “of the constellation Grus (the Crane).” For example, “Alpha Gruis” means “Alpha of Grus.”","zh":"（天文学）Grus（天鹤座）的拉丁文属格形式，用在恒星名称中，表示“属于天鹤座”。例如“Alpha Gruis”意为“天鹤座的α星”。"},"examples":[{"en":"Alpha Gruis is a bright star in the southern constellation Grus.","zh":"Alpha Gruis 是南天星座天鹤座中的一颗亮星。"},{"en":"In catalogs, the word “Gruis” shows which constellation a star belongs to.","zh":"在星表中，“Gruis”用来标明一颗恒星属于哪个星座。"}]}],"synonyms":["of Grus","Grus (constellation)"],"phonetic":"/ˈɡruːɪs/","extraExplanation":["“Gruis”不是常见英文单词，多见于天文学命名体系：星座用拉丁文命名，恒星常用“希腊字母 + 拉丁属格（表示‘……的’）”来标记归属，例如 Alpha Gruis、Beta Gruis。","如果你本来想查的是英语单词“gruesome”（可怕的、令人毛骨悚然的）或法语“gruis”（可能与“crane/鹤”相关），告诉我你要的语境/句子，我可以帮你确认。"]}
{"word":"grulla","summary":{"en":"Grulla describes a mouse-gray horse color (often with black points and a dorsal stripe), and it can also mean a horse of that color.","zh":"Grulla 指一种马的毛色：灰鼠色/钢灰色（常见黑色端部与背线等斑纹），也可指这种毛色的马。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a horse coat color: mouse-gray or steel-gray body with black points (mane, tail, lower legs), often with primitive markings like a dorsal stripe","zh":"（马的毛色）鼠灰色/钢灰色的身躯，鬃尾与四肢下部为黑色（“黑色端部”），常见原始斑纹如背线"},"examples":[{"en":"She rode a grulla mare with a dark stripe down its back.","zh":"她骑着一匹灰鼠色的母马，背上有一道深色背线。"},{"en":"The ranch is known for breeding grulla horses.","zh":"这家牧场以培育灰鼠色马而闻名。"},{"en":"Under the sun, the grulla coat looked almost silver.","zh":"在阳光下，灰鼠色的马毛看起来几乎像银色。"}]},{"partOfSpeech":"n.","definition":{"en":"a horse that has the grulla coat color","zh":"灰鼠色马（指具有这种毛色的马）"},"examples":[{"en":"They bought a young grulla for trail riding.","zh":"他们买了一匹年轻的灰鼠色马用来越野骑行。"},{"en":"The grulla in the paddock has a black mane and tail.","zh":"围栏里的那匹灰鼠色马有黑色的鬃毛和尾巴。"}]}],"synonyms":["grullo","mouse-gray (horse color)","blue dun (informal)"],"phonetic":"/ˈɡruːjə/","extraExplanation":["“grulla”来自西班牙语（常用于美国西部的牧场语境）。在英文里多见于马匹品种与毛色描述，尤其在夸特马（Quarter Horse）、野马、以及与西部文化相关的语境中。","它通常与“dun（浅黄褐/稀释色）”相关：grulla 常被理解为“black dun”（黑色基因被稀释后呈灰鼠色），因此常伴随“背线、肩部横纹、腿部条纹”等原始斑纹描述。","拼写上也常见变体“grullo”（在一些用法里与 grulla 互换；有时也被用来区分公母，但英语里并不严格）。"]}
{"word":"grullo","summary":{"en":"a smoky mouse-gray horse coat color (blue dun), often with a dark dorsal stripe","zh":"一种马的烟灰/灰鼠色毛色（常称蓝沙色），常带深色背线"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a horse) having a smoky or mouse-gray coat, usually with primitive markings like a dark dorsal stripe; a “blue dun” shade.","zh":"（马的毛色）灰鼠色/烟灰色，常见原始斑纹（如背上的深色背线）；也常被称为“蓝沙色（blue dun）”。"},"examples":[{"en":"The mare is grullo, with a clear dark stripe down her back.","zh":"这匹母马是灰鼠色（grullo），背上有一条明显的深色背线。"},{"en":"Many people confuse grullo with gray, but grullo is a dun-based color.","zh":"很多人把 grullo 和灰色（gray）弄混，但 grullo 属于沙色（dun）体系。"}]},{"partOfSpeech":"n.","definition":{"en":"A horse with a grullo coat color.","zh":"灰鼠色（grullo）毛色的马。"},"examples":[{"en":"They bought a grullo for trail riding.","zh":"他们买了一匹灰鼠色的马用来骑行越野。"}]}],"synonyms":["blue dun","dun","mouse-gray"],"phonetic":"/ˈɡruːjoʊ/","extraExplanation":["发音上常接近西语感觉（类似“GROO-yo”）。在马色分类里，grullo 通常指黑色基因 + 沙色稀释（dun）造成的灰烟感，并常伴随“原始斑纹”（背线、腿部条纹、肩部阴影等）。这也是它和普通的“gray（会随年龄变白）”很容易混淆的原因：grullo 通常不会像 gray 那样逐年变白。"],"etymology":"源自西班牙语 grullo（指一种灰鼠色/烟灰色的马毛色）。在北美马术用语中常用来指“蓝沙色（blue dun）”这一类颜色。","mnemonic":["联想中文“咕噜咕噜（grullo）”像灰尘在空气里滚动：烟灰灰、鼠灰灰的感觉。","把它拆成“gru-”≈“gray 的感觉”，再记关键点：不是变白的 gray，而是偏烟灰的 dun 系颜色。"]}
{"word":"grum","summary":{"en":"“Grum” is a rare dialect word meaning gloomy or sullen, similar to “glum.”","zh":"“grum”是较少见的方言词，意思是“阴沉/闷闷不乐”，类似“glum”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dialect/Scottish, informal) Gloomy, sullen, or bad-tempered; not cheerful.","zh":"（方言/苏格兰英语，非正式）阴沉的；闷闷不乐的；脾气不太好、不爱搭理人的。"},"examples":[{"en":"He looked grum all morning and didn’t say much.","zh":"他一早上都一脸阴沉，也没怎么说话。"},{"en":"Don’t be so grum—let’s go get some coffee.","zh":"别这么闷闷不乐的——我们去买杯咖啡吧。"}]}],"synonyms":["glum","gloomy","sullen","morose","grim"],"phonetic":"/ɡrʌm/","extraExplanation":["“grum”在现代标准英语里很少见，多见于苏格兰英语或文学/方言描写中，含义接近更常用的“glum”（闷闷不乐的）或“grim”（阴沉严肃的）。如果你是在课本、考试或正式写作中想表达这种情绪，通常用“glum / gloomy / sullen”更自然。"]}
{"word":"grumble","summary":{"en":"“Grumble” means to complain in a low, annoyed way, or to make a low rumbling sound (like thunder or a stomach).","zh":"“grumble”指小声不满地抱怨、嘟囔；也可指发出低沉的隆隆声（如雷声、肚子叫）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to complain in a quiet, annoyed way (often not directly to the person involved)","zh":"（常指不直接对当事人）小声抱怨、嘟囔埋怨"},"examples":[{"en":"He grumbled about the long meeting but still stayed until the end.","zh":"他嘟囔着抱怨会议太长，但还是坚持到了最后。"},{"en":"Stop grumbling and tell me what you actually need.","zh":"别再嘟囔了，直接告诉我你真正需要什么。"}]},{"partOfSpeech":"n.","definition":{"en":"a low, unhappy sound; the sound of complaining","zh":"低沉不满的声音；抱怨声"},"examples":[{"en":"There was a grumble from the back of the classroom when more homework was announced.","zh":"宣布要加作业时，教室后排传来一阵不满的嘟囔声。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a low rumbling sound (like thunder or a stomach)","zh":"发出低沉隆隆声（如雷声或肚子叫）"},"examples":[{"en":"Thunder grumbled in the distance.","zh":"远处传来低沉的雷声。"},{"en":"My stomach started to grumble during the lecture.","zh":"上课时我的肚子开始咕噜作响。"}]}],"synonyms":["complain","mutter","grouse","moan","rumble"],"phonetic":"/ˈɡrʌmbəl/","extraExplanation":["“grumble”语气通常比“complain”更“低声、带情绪、略显不情愿”，有时也暗示抱怨的人并没有打算真正解决问题，只是在发泄不满。","常见搭配：grumble about + 事（grumble about the weather/price）；grumble at + 人/话（grumble at the waiter / grumble at being told what to do）。","文学与日常描写中常用来塑造人物性格：比如“老是爱嘟囔的老人”“嘴上抱怨但还是会做事的人”（grumble but do it anyway）。"]}
{"word":"grumbled","summary":{"en":"“Grumbled” means spoke with unhappy, low-voiced complaints, or made a low rumbling sound.","zh":"“grumbled”表示低声不满地抱怨/嘟囔，或指发出低沉的轰隆声。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Complained or spoke in a low, rough, unhappy voice (past tense or past participle of “grumble”).","zh":"（grumble 的过去式/过去分词）嘟囔着抱怨；用低沉、粗哑、不满的声音说话。"},"examples":[{"en":"He grumbled about the long wait.","zh":"他嘟囔着抱怨等得太久。"},{"en":"“Fine,” she grumbled, without looking up.","zh":"“好吧。”她不耐烦地嘟囔了一句，头也不抬。"}]},{"partOfSpeech":"v.","definition":{"en":"Made a low, continuous sound like distant thunder or a stomach rumble (past tense of “grumble”).","zh":"（grumble 的过去式）发出低沉、持续的轰隆声（如远处雷声或肚子咕噜声）。"},"examples":[{"en":"Thunder grumbled in the distance.","zh":"远处传来低沉的雷声。"},{"en":"My stomach grumbled during the meeting.","zh":"开会时我的肚子咕噜直叫。"}]}],"synonyms":["muttered","complained","groused","moaned","rumbled"],"phonetic":"/ˈɡrʌmbəld/","extraExplanation":["“grumble”常表示“嘴上抱怨但不一定真的反对”，语气比“complain”更随口、更小声，常带一点不情愿的情绪。","在文学描写里，thunder/stomach 等也会 “grumble”，用拟声和拟人让场景更有画面感：低沉、断断续续、带着不满的“轰隆/咕噜”。"]}
{"word":"grumbler","summary":{"en":"A grumbler is someone who frequently complains.","zh":"grumbler 指经常抱怨、发牢骚的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who often complains in an annoyed or unhappy way.","zh":"爱抱怨的人；牢骚精（经常以不满或烦躁的语气抱怨的人）。"},"examples":[{"en":"Don’t be a grumbler—tell us what you need so we can fix it.","zh":"别当牢骚精——直接告诉我们你需要什么，我们才能解决。"},{"en":"He’s not a bad coworker, but he can be a grumbler when things change.","zh":"他不是个坏同事，但遇到变化时就很爱抱怨。"}]}],"synonyms":["complainer","whiner","grouch"],"phonetic":"/ˈɡrʌmblər/","extraExplanation":["“grumbler”来自动词“grumble”（嘟囔、抱怨）。语气通常偏负面，暗示抱怨频繁、声音低沉或带着不满。","常见近义词的语气差别：complainer（中性一点，泛指抱怨者）、whiner（更负面，强调“哼哼唧唧/撒娇式抱怨”）、grouch（脾气坏、爱发牢骚的人）。"]}
{"word":"grumblers","summary":{"en":"“Grumblers” means people who often grumble—habitual complainers.","zh":"“grumblers”指经常发牢骚、爱抱怨的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who often complain or express dissatisfaction in a low, unhappy way.","zh":"经常抱怨、发牢骚的人（多指低声不满地嘟囔）。"},"examples":[{"en":"The meeting went fine, but a few grumblers still complained about the schedule.","zh":"会议进展得不错，但仍有几个爱抱怨的人在抱怨日程安排。"},{"en":"Don’t let the grumblers discourage you—keep practicing.","zh":"别让爱抱怨的人打击你——继续练习。"}]}],"synonyms":["complainers","moaners","whiners","gripe artists"],"phonetic":"/ˈɡrʌmblərz/","extraExplanation":["“grumblers”是“grumbler”的复数；动词“grumble”带有“低声、带情绪地抱怨/嘟囔”的感觉，比“complain”更口语、更像发牢骚。","常见搭配：constant grumblers（总爱抱怨的人）、office grumblers（办公室里的抱怨者）。"]}
{"word":"grumbles","summary":{"en":"“Grumbles” is the third-person singular verb meaning “complains quietly,” or the plural noun meaning “quiet complaints.”","zh":"“grumbles”可作动词（他/她/它低声抱怨）或名词复数（一些低声的抱怨）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of grumble) to complain in a quiet, annoyed way; to mutter dissatisfaction.","zh":"（动词，grumble 的第三人称单数）低声抱怨；咕哝着表示不满。"},"examples":[{"en":"He grumbles about the weather every morning.","zh":"他每天早上都在抱怨天气。"},{"en":"She grumbles that the meeting is a waste of time.","zh":"她嘟囔着说这个会议是在浪费时间。"},{"en":"Dad grumbles when the internet is slow.","zh":"网速慢的时候爸爸就会抱怨。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) low, annoyed complaints or murmurs of dissatisfaction.","zh":"（名词复数）低声的不满与抱怨；咕哝声。"},"examples":[{"en":"There were grumbles from the crowd about the long wait.","zh":"人群里传来对漫长等待的不满抱怨。"},{"en":"We heard a few grumbles, but most people agreed with the plan.","zh":"我们听到一些抱怨，但大多数人同意这个计划。"}]}],"synonyms":["complains","mutters","grouses","gripes","murmurs"],"phonetic":"/ˈɡrʌmbəlz/","extraExplanation":["“grumble”通常指声音不大、带着烦躁情绪的抱怨，语气比“complain”更像“嘟囔/咕哝”，不一定想让别人听得很清楚。","它也可以形容肚子发出的“咕噜”声（stomach grumbles），属于拟声用法。","在文学或叙述中，作者常用“grumble”来表现人物性格：有点不耐烦、爱抱怨，但未必真的生气。"]}
{"word":"grumblesome","summary":{"en":"Grumblesome means ‘prone to grumbling or complaining.’","zh":"grumblesome 表示“爱嘟囔抱怨的、容易不满的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Often grumbling; easily annoyed or complaining in a low, unhappy way.","zh":"爱抱怨的；动不动就嘟囔不满的；脾气有点坏的。"},"examples":[{"en":"He can be grumblesome in the morning before coffee.","zh":"他早上没喝咖啡前常常爱抱怨。"},{"en":"The grumblesome customer kept complaining about the wait.","zh":"那位爱抱怨的顾客一直在嫌等太久。"},{"en":"Try not to sound grumblesome when you give feedback—be specific and calm.","zh":"提建议时尽量别显得爱抱怨；说清楚、语气平和一点。"}]}],"synonyms":["grumpy","grouchy","crabby","complaining","cantankerous"],"phonetic":"ˈɡrʌmbəlsəm","extraExplanation":["“grumblesome”在现代英语里很少见，属于较口语/带点幽默的用法。更常见的说法是：grumpy（脾气坏的）、grouchy（爱发牢骚的）、complaining（爱抱怨的）。","词形上它由 grumble（嘟囔、抱怨）+ -some（“有……倾向/带有……”）构成，语感类似 tiresome（烦人的）、troublesome（麻烦的）。在写作中用它会显得有点俏皮或刻意。"]}
{"word":"grumbletonian","summary":{"en":"Grumbletonian means a habitual complainer, or describing someone/something full of complaints, often in a humorous tone.","zh":"Grumbletonian 指“习惯性抱怨的人”，或形容“爱抱怨、牢骚不断的”，常带幽默调侃语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who habitually complains; a chronic grumbler (often used humorously).","zh":"爱抱怨的人；习惯性发牢骚的人（常带幽默或调侃语气）。"},"examples":[{"en":"Don’t be such a Grumbletonian—tell us what you’d do to fix the problem.","zh":"别老当个“抱怨派”了——说说你会怎么解决这个问题。"},{"en":"In every office there’s at least one Grumbletonian who gripes about meetings.","zh":"每个办公室里至少都有一个爱抱怨的人，总是吐槽开会。"}]},{"partOfSpeech":"adj.","definition":{"en":"habitually complaining; marked by constant grumbling (often humorous).","zh":"爱抱怨的；动不动就牢骚不断的（常带幽默语气）。"},"examples":[{"en":"His Grumbletonian comments drained the energy from the discussion.","zh":"他那些爱抱怨的评论把讨论的气氛都搞低落了。"},{"en":"She gave a Grumbletonian sigh when the plan changed again.","zh":"计划又变了，她发出一声“抱怨式”的叹气。"}]}],"synonyms":["complainer","grumbler","malcontent","grouch","chronic complainer"],"phonetic":"/ˌɡrʌmbəlˈtoʊniən/","extraExplanation":["这是一个比较少见、带戏谑色彩的词，常用来把某人说成“职业吐槽/抱怨派”。它由“grumble（抱怨）”加上类比政治派别的后缀“-ian”构成，听起来像某种“阵营/派系”的成员，因此语气往往更夸张、更幽默。","在写作或评论中，它有时也可泛指“唱反调、动辄批评的人”，但通常不算正式用语。"]}
{"word":"grumbling","summary":{"en":"“Grumbling” means quiet, annoyed complaining, or a low rumbling sound.","zh":"“grumbling”指低声不满地抱怨，也可指低沉的隆隆声。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Complaining in a low, annoyed way (often not loudly or directly).","zh":"低声地、带着不满地抱怨（通常不大声或不直接）。"},"examples":[{"en":"He was grumbling about the long line at the store.","zh":"他在抱怨商店里排队太长。"},{"en":"She did the chores, grumbling the whole time.","zh":"她做家务时一直在嘟囔抱怨。"},{"en":"There was grumbling among the students about the new rule.","zh":"学生们对新规定有不少怨言。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of complaining in a low, unhappy voice; quiet complaints.","zh":"（低声的）抱怨行为；嘟囔式的不满。"},"examples":[{"en":"We heard grumbling from the back of the room.","zh":"我们听到房间后面传来嘟囔的抱怨声。"},{"en":"Despite some grumbling, the team accepted the plan.","zh":"尽管有些怨言，团队还是接受了这个计划。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “grumble”: to complain in a low voice; to make a low, rumbling sound.","zh":"“grumble”的现在分词：低声抱怨；（也可指）发出低沉的隆隆声。"},"examples":[{"en":"He sat there, grumbling under his breath.","zh":"他坐在那里，小声嘟囔抱怨。"},{"en":"The thunder was grumbling in the distance.","zh":"远处的雷声在低沉地隆隆作响。"}]}],"synonyms":["complaining","muttering","grousing","whining","rumbling"],"phonetic":"ˈɡrʌmblɪŋ","extraExplanation":["“grumble / grumbling”常带有一种“心里不爽但又不想（或不敢）大声说”的感觉，比complain更口语、更带情绪，也常暗示声音比较低。","既可用于人（抱怨），也可用于事物的声音（如thunder、stomach）表示“低沉的隆隆声”。"]}
{"word":"grumblingly","summary":{"en":"“Grumblingly” means doing or saying something in an annoyed, complaining way.","zh":"“grumblingly”表示“以不满、抱怨的口吻/方式（去做或去说）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a complaining, annoyed, or dissatisfied way; while grumbling.","zh":"以抱怨的、嘀咕不满的方式；一边嘟囔一边做某事。"},"examples":[{"en":"He paid the bill grumblingly and walked out.","zh":"他一边嘟囔抱怨一边把账单付了，然后走了出去。"},{"en":"She grumblingly agreed to help with the chores.","zh":"她不情不愿、抱怨着同意帮忙做家务。"}]}],"synonyms":["complainingly","begrudgingly","grouchily","resentfully"],"phonetic":"/ˈɡrʌmblɪŋli/","extraExplanation":["“grumblingly”来自动词/名词“grumble”（嘟囔、抱怨）。常用来描写语气或态度：人表面上照做，但情绪上不满。写作里它能让人物更立体，比如表现“嘴上抱怨、行动配合”的矛盾感。"]}
{"word":"grumblings","summary":{"en":"quiet complaints or low rumbling sounds","zh":"低声抱怨或低沉的隆隆声"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"quiet, low complaints (often expressing dissatisfaction without openly confronting someone)","zh":"（低声的）抱怨；嘟囔式的不满（通常不直接当面表达）"},"examples":[{"en":"There were grumblings about the new schedule, but no one spoke up at the meeting.","zh":"大家对新排班有些抱怨，但在会议上没人直接说出来。"},{"en":"After the price increase, grumblings spread through the office.","zh":"涨价之后，办公室里到处都是不满的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"a low, rumbling sound (for example, from thunder or your stomach)","zh":"低沉的隆隆声（如雷声或肚子叫）"},"examples":[{"en":"We heard distant grumblings of thunder across the hills.","zh":"我们听到远处山丘那边传来隐隐的雷声。"},{"en":"His stomach’s grumblings made everyone laugh during the quiet exam.","zh":"安静的考试中他肚子的咕噜声让大家都笑了。"}]}],"synonyms":["complaints","murmurs","mutterings","gripes","rumblings"],"phonetic":"ˈɡrʌmblɪŋz","extraExplanation":["grumblings 通常暗示“有人不满意但没有公开抗议”，语气比 complaint 更“私下、含蓄”。在职场或组织语境里，常见搭配有: grumblings about/over…（对……的抱怨）、hear grumblings（听到抱怨声）、cause grumblings（引起不满）。"],"etymology":"源自英语动词 grumble（抱怨、发牢骚/发出低沉声），可能与表示“低声咕哝”的拟声词有关；-ing 可名词化为 grumbling（抱怨/隆隆声），加 -s 构成复数 grumblings，表示“一些抱怨/一些隆隆声”。","mnemonic":["把 grumble 想成“咕噜咕噜”的声音：像肚子饿在咕噜，也像人在小声嘟囔抱怨。","联想中文“咕哝/嘟囔”，都是低声、不太公开的抱怨；grumblings 就是“一堆嘟囔声”。"]}
{"word":"grumbly","summary":{"en":"Grumbly means mildly complaining and irritable (informal).","zh":"grumbly 指（非正式）有点爱抱怨、嘟囔着不开心、脾气不太好。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Complaining in a low, unhappy way; cranky or irritable (informal).","zh":"（非正式）嘟囔着抱怨的；爱发牢骚的；有点烦躁易怒的。"},"examples":[{"en":"He was a little grumbly before breakfast.","zh":"他早餐前有点爱抱怨、脾气不太好。"},{"en":"Don’t be grumbly—tell me what’s bothering you.","zh":"别一直抱怨啦——告诉我你在烦什么。"},{"en":"The baby got grumbly when she missed her nap.","zh":"宝宝没睡午觉就开始闹情绪、哼哼唧唧的。"}]}],"synonyms":["grumpy","cranky","grouchy","irritable","complaining"],"phonetic":"/ˈɡrʌmbli/","extraExplanation":["“grumbly”来自动词“grumble（咕哝抱怨）”，语气偏口语，常用来形容“有点不爽、一直嘟囔”的状态。","它和“grumpy”很接近，但“grumbly”更强调“在抱怨/哼哼唧唧”的行为表现；“grumpy”更偏“脾气差/不高兴”的情绪。"]}
{"word":"grume","summary":{"en":"Grume means a clot or thick clump (often of blood), and it can also mean “to clot” (rare).","zh":"grume 指（常为血液的）凝块，也可作动词表示“凝结成块”（较少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick clump or clot, especially a clot of blood; a thickened mass of a liquid","zh":"（尤指血液的）凝块；（液体变稠后形成的）块状物"},"examples":[{"en":"The cut stopped bleeding once a grume formed.","zh":"一旦形成血凝块，伤口就不再出血了。"},{"en":"In the lab, the sample contained small grumes that made it hard to measure.","zh":"在实验室里，样本里有一些小凝块，导致不易测量。"}]},{"partOfSpeech":"v.","definition":{"en":"to form into a clot or thick clumps; to coagulate (rare)","zh":"凝结成块；凝固（较少用）"},"examples":[{"en":"If the blood grumes too quickly, it can block the tube.","zh":"如果血液凝得太快，可能会堵住管子。"},{"en":"The sauce began to grume when it cooled.","zh":"酱汁冷却后开始结块。"}]}],"synonyms":["clot","clump","lump","coagulum","coagulate"],"phonetic":"/ɡrum/","extraExplanation":["“grume”是一个比较文学化/专业的词，日常英语里更常见的是“clot”（血块）或“clump/lump”（块状物）。","词源与法语有关，常见于医学、解剖学或较老的文学文本中，用来强调“凝结成团的厚重感”。"]}
{"word":"grumes","summary":{"en":"“Grumes” means clots or thick lumps, especially of clotted blood (plural of “grume”).","zh":"“grumes”指凝块或稠厚的块状物，尤指凝血块（“grume”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “grume”: thick clots or lumps, especially clotted blood.","zh":"“grume”的复数：凝结的块状物，尤指血液凝块。"},"examples":[{"en":"The lab report noted grumes in the blood sample.","zh":"化验报告注明血样中有凝块。"},{"en":"After the injury, small grumes formed around the wound.","zh":"受伤后，伤口周围形成了小的血凝块。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The state or process of clotting into a thick mass; clots formed.","zh":"（少见）凝结成稠厚块状的过程或状态；形成的凝块。"},"examples":[{"en":"In older medical writing, “grumes” may describe clotted blood seen during surgery.","zh":"在较早的医学写作中，“grumes”可能用来描述手术中看到的凝血块。"}]}],"synonyms":["clots","coagula","lumps"],"phonetic":"ɡruːm","extraExplanation":["“grume”较偏医学/文学用词，日常英语里更常用的说法是 blood clots（血栓/血凝块）或 clots（凝块）。","注意不要和 “grooms”（新郎们/打理毛发的人）混淆：拼写和读音都不同。"]}
{"word":"grumium","summary":{"en":"“Grumium” is not a recognized standard English word; it’s likely a misspelling (e.g., grommet, gremium, or chromium).","zh":"“grumium”不是标准英语词；多半是拼写错误（例如 grommet、gremium 或 chromium）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a made-up term; meaning depends on the context.","zh":"不是标准英语单词。很可能是拼写错误或自造词；具体含义需要结合上下文判断。"},"examples":[{"en":"I couldn’t find “grumium” in a dictionary—did you mean a different word?","zh":"我在词典里找不到“grumium”——你是不是想写另一个词？"},{"en":"Please share the full sentence so I can guess what “grumium” is meant to be.","zh":"请把完整句子发我，我才能判断“grumium”可能指什么。"}]}],"phonetic":"/ˈɡruːmiəm/","extraExplanation":["“grumium”看起来像把常见词拼错了。你可能想写：\n1) grommet（n. 金属/塑料扣眼；帆布或鞋带孔上的金属圈；也可指某些机械用的橡胶护圈）\n2) grem**i**um / gremium（n. 委员会；核心成员团体，偏正式/学术）\n3) chromium（n. 铬，化学元素）——如果你看到的是类似“...um”的元素名，尤其要检查是否其实是 chromium。\n把你看到它的来源（句子/图片/学科：化学、机械、游戏等）发来，我可以帮你精准匹配。"]}
{"word":"grumly","summary":{"en":"“Grumly” is not standard; it usually means “grumbly,” describing someone who complains in an annoyed, low way.","zh":"“grumly”不是标准拼写；通常指“grumbly”，表示一个人带着不耐烦低声抱怨。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) Usually meant to be **grumbly**: complaining in a low, annoyed way; a bit irritable.","zh":"（非标准拼写）通常想表达 **grumbly**：低声抱怨、带点不耐烦或烦躁。"},"examples":[{"en":"I’m a little grumbly this morning because I didn’t sleep well.","zh":"我今天早上有点爱抱怨/有点烦躁，因为没睡好。"},{"en":"Don’t mind him—he gets grumbly when he’s hungry.","zh":"别介意他——他饿的时候就会变得爱抱怨。"}]}],"synonyms":["grumbly","grumpy","irritable","cranky","complaining"],"phonetic":"/ˈɡrʌmbli/","extraExplanation":["“grumly”在现代英语里不常见，通常是把 **grumbly**（爱抱怨的、嘟囔的）拼错了，或者把 **grumpy**（脾气坏的、易怒的）和 **grumbly** 混在一起了。","语气区别：**grumbly** 更强调“嘟囔式抱怨（声音低、碎碎念）”；**grumpy** 更像“心情不好、脸臭、易怒”。"]}
{"word":"grummel","summary":{"en":"“Grummel” usually means to grumble—complain quietly in an unhappy way; it can also mean a low rumbling/complaining sound.","zh":"“grummel”通常指像“grumble”一样低声抱怨；也可指低沉的抱怨声或隆隆声。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to complain in a low, unhappy way; a less common spelling of “grumble.”","zh":"低声抱怨、嘟囔；是“grumble”的不常见拼写。"},"examples":[{"en":"He grummeled about the long line but stayed anyway.","zh":"他对排很长的队低声抱怨，但还是继续等。"},{"en":"Don’t grummel—tell me clearly what’s wrong.","zh":"别嘟囔了——清楚告诉我哪里不对。"}]},{"partOfSpeech":"n.","definition":{"en":"a low, complaining sound or rumble.","zh":"低沉的抱怨声；咕哝声；（也可指）低沉的隆隆声。"},"examples":[{"en":"A grummel of dissatisfaction spread through the room.","zh":"房间里传开一阵不满的嘟囔声。"},{"en":"We heard a distant grummel of thunder.","zh":"我们听到远处雷声的低沉隆隆。"}]}],"synonyms":["grumble","mutter","complain","gripe"],"phonetic":"/ˈɡrʌməl/","extraExplanation":["“grummel”在现代英语里比较少见，更多时候你会看到“grumble”。在一些较旧的书面语、方言拼写或特定作者的文风里，可能会用“grummel”来表现人物说话时含混不清、带情绪的抱怨声。写作时如果不是刻意营造风格，建议用更常见的“grumble”。"]}
{"word":"grummels","summary":{"en":"“Grummels” is a rare form related to “grumbles,” meaning to complain quietly or the complaints themselves.","zh":"“grummels”是与“grumbles”相关的罕见形式，指低声抱怨或这些抱怨本身。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare/nonstandard) To grumble; to complain in a low, muttering way.","zh":"（罕见/非标准用法）咕哝抱怨；低声嘟囔着表示不满。"},"examples":[{"en":"He grummels about the weather every morning.","zh":"他每天早上都会嘟囔抱怨天气。"},{"en":"The customers grummelled when the bus was late.","zh":"公交车晚点时，乘客们低声抱怨。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Complaints or muttered grumbling sounds.","zh":"（罕见）抱怨的话；咕哝的抱怨声。"},"examples":[{"en":"There were grummels from the back of the room when the meeting ran long.","zh":"会议拖得很久时，房间后面传来一阵嘟囔抱怨。"}]}],"synonyms":["grumble","complain","mutter","grouse"],"phonetic":"/ˈɡrʌməl/","extraExplanation":["“grummels”多半是动词“grummel”的第三人称单数（he/she grummels）或名词复数（many grummels）。它在现代英语里不常见，通常用更标准的“grumbles”。在一些较老的文本或方言书写中可能会看到“grummel/grummle”。"]}
{"word":"grummer","summary":{"en":"Grammar is the system of rules for forming words and sentences in a language, and it can also mean a grammar book.","zh":"Grammar 指一门语言的语法规则与结构，也可指语法书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the rules and patterns of a language (how words change and how sentences are formed)","zh":"语法；一门语言的规则与结构（词形变化与造句方式）"},"examples":[{"en":"English grammar includes tenses like past, present, and future.","zh":"英语语法包括过去式、现在式和将来时等时态。"},{"en":"I’m studying grammar to write clearer emails.","zh":"我在学习语法，这样能写出更清晰的邮件。"}]},{"partOfSpeech":"n.","definition":{"en":"a book or guide that explains the grammar of a language","zh":"语法书；讲解某种语言语法的书或指南"},"examples":[{"en":"This grammar is helpful for beginners.","zh":"这本语法书对初学者很有帮助。"},{"en":"Our teacher recommended a grammar for self-study.","zh":"老师推荐了一本适合自学的语法书。"}]}],"synonyms":["syntax","usage","language rules","grammar book"],"phonetic":"/ˈɡræmər/","extraExplanation":["你输入的 **grummer** 很可能是 **grammar** 的常见拼写错误。","如果你其实想找的是 **groomer**（美容师/梳理动物毛发的人，或“培养某人成为……”的人），告诉我语境，我也可以解释那个词。"]}
{"word":"grummest","summary":{"en":"“Grummest” is a rare/archaic superlative meaning “most gloomy or sullen,” and it’s often a misspelling of “grimmest.”","zh":"“grummest”很罕见/偏古旧，意思是“最阴郁/最闷闷不乐的”，也常被用作“grimmest”的误拼。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) The superlative form of “grum” (Scottish/archaic): most gloomy, sullen, or stern-looking.","zh":"（非标准/罕见）“grum”（苏格兰用语/古旧用法）的最高级：最阴郁的、闷闷不乐的，或最严厉/冷峻的（表情）。"},"examples":[{"en":"After the argument, he wore his grummest face and spoke to no one.","zh":"争吵之后，他摆出最阴沉的表情，谁也不理。"},{"en":"The grummest guard at the gate still nodded politely.","zh":"门口最冷峻的守卫还是礼貌地点了点头。"}]}],"synonyms":["gloomiest","sulleniest","morosest","sternest"],"phonetic":"/ˈɡrʌməst/","extraExplanation":["“grummest”在现代英语里非常少见，很多时候其实是把更常见的词“grimmest”（最严酷的/最可怕的/最阴森的）拼错了。","“grum”更像是地方性或文学/古旧表达；如果你是在普通文章、新闻或考试材料里看到“grummest”，建议先核对原文是否应为“grimmest”。"]}
{"word":"grummet","summary":{"en":"A grummet is a ring used for fastening—especially a rope ring in nautical use; it can also mean a reinforcing eyelet (more commonly spelled “grommet”).","zh":"grummet 指用于固定的“环”，航海中多指“绳制环”；也可指孔眼的加固扣眼（更常见拼写为 grommet）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) A ring made of rope (often from a short piece spliced into a circle), used for fastening, attaching, or reinforcing something on a ship.","zh":"（航海）用绳子做成的环（常把一小段绳接成圆圈），用于系固、连接或加固船上的物件。"},"examples":[{"en":"The sailor tied the line to a grummet on the deck.","zh":"水手把绳子系在甲板上的一个绳环（grummet）上。"},{"en":"A grummet can act like a strong loop for securing gear.","zh":"grummet 可以像结实的绳圈一样用来固定装备。"}]},{"partOfSpeech":"n.","definition":{"en":"A small reinforcing ring or eyelet (often metal or rubber) around a hole, especially in fabric, sails, or tarps; in everyday use this is usually spelled “grommet.”","zh":"（在孔周围的）加固环/扣眼（常为金属或橡胶，见于布料、船帆、防水布等）；日常英语中通常拼作 grommet。"},"examples":[{"en":"The tarp has grummets along the edges for tying it down.","zh":"防水布边缘有加固扣眼（grummets），方便把它固定住。"},{"en":"These are usually called “grommets” in modern manuals.","zh":"在现代说明书里，这些通常叫 “grommets”。"}]}],"synonyms":["grommet","eyelet","ring","loop"],"phonetic":"/ˈɡrʌmɪt/","extraExplanation":["“Grummet”在现代英语里相对少见，更常见的拼写是“grommet”。在航海语境中，grummet 常指“绳制的环”；在更广泛的日常语境中，人们说 grommet 时多指“金属/橡胶的扣眼、孔眼加固圈”。阅读老的航海资料或英式/专业文本时更可能遇到 grummet。"]}
{"word":"grummeter","summary":{"en":"“Grummeter” is not standard; it’s probably a misspelling of “grommet” or “groomer.”","zh":"“grummeter”不是标准用词；很可能是“grommet”或“groomer”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling of “grommet” (a small metal/rubber ring that reinforces a hole) or “groomer” (a person who grooms animals; also used online in a harmful context).","zh":"不是标准英语单词；很可能是拼写错误，想写的是“grommet”（用来加固孔洞的小金属/橡胶圈、扣眼）或“groomer”（给动物做美容的人；在网络语境中也可能指对未成年人进行诱骗的施害者）。"},"examples":[{"en":"I can’t find “grummeter” in the dictionary—did you mean “grommet”?","zh":"我在词典里找不到“grummeter”——你是不是想写“grommet”？"},{"en":"The tarp has metal grommets along the edge.","zh":"防水布边缘有一排金属扣眼（grommets）。"},{"en":"She works as a dog groomer.","zh":"她是一名宠物美容师（groomer）。"}]}],"phonetic":"/ˈɡrʌmɪtər/","extraExplanation":["“grummeter”在常见词典、通用语料中基本不出现，因此更像是拼写误差。最常见的接近词是：\n1) grommet：常见于服装、帆布、鞋带孔、帐篷/防水布等，指加固孔洞的“扣眼/金属圈”。\n2) groomer：日常多指“（宠物）美容师/梳洗者”。但在网络安全语境中，groomer也可能指对未成年人进行“诱骗、建立信任以实施伤害”的人；如果你在这种语境看到该词，需要谨慎理解。","如果你告诉我你看到“grummeter”的句子或领域（五金、服装、宠物、美容、网络等），我可以帮你确定最可能的正确词。"]}
{"word":"grummets","summary":{"en":"Grommets are reinforcing or protective rings placed in holes, especially in fabric (curtains, shoes) or to protect cables.","zh":"grommets 指装在孔上的加固或保护用“圈/环”，常见于窗帘、鞋带孔等，也可指电缆护线圈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small metal or plastic rings used to reinforce a hole in fabric, leather, plastic, or metal (for example, in curtains, shoes, belts, or tarps).","zh":"（常指金属或塑料的）扣眼圈、鸡眼、铆眼，用来加固布料、皮革、塑料或金属上的孔（如窗帘、鞋子、腰带、防水布等）。"},"examples":[{"en":"These curtains have metal grommets at the top, so they slide easily on the rod.","zh":"这副窗帘顶部有金属扣眼圈，所以在杆子上很好拉动。"},{"en":"Add grommets to the tarp so the rope won’t tear the holes wider.","zh":"在防水布上加装鸡眼，这样绳子就不会把孔越扯越大。"}]},{"partOfSpeech":"n.","definition":{"en":"Plastic or rubber rings that protect cables where they pass through a hole in a panel or wall.","zh":"（电缆用）护线圈、护套圈：让电线/电缆穿过板材或墙孔时避免磨损。"},"examples":[{"en":"Use grommets to keep the cable from rubbing against the sharp edge of the metal.","zh":"用护线圈能防止电缆与金属锐边摩擦。"}]}],"synonyms":["eyelets","reinforcing rings","cable grommets"],"phonetic":"/ˈɡrɑmɪts/","extraExplanation":["你写的 **grummets** 常见于把 **grommets**（扣眼圈/鸡眼）拼错成双 m。日常英语里更常用的拼写是 **grommet(s)**。","词源上与“ring（环）”的概念相关，最早用于指加固孔眼或起保护作用的“圈/环”。"]}
{"word":"grumness","summary":{"en":"“Grumness” means a gloomy or grumpy mood; it’s rare and often replaced by “grumpiness.”","zh":"“grumness”指阴郁或坏脾气的情绪；这个词较少见，常用“grumpiness”替代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gloomy, sullen, or bad-tempered mood; moroseness (an uncommon/rare word, often seen as a variant of “grumpiness”).","zh":"阴郁、闷闷不乐或坏脾气的情绪；乖戾/郁闷（较少见的词，常被视为“grumpiness”的变体）。"},"examples":[{"en":"There was a quiet grumness about him all morning, and he barely spoke.","zh":"他整个上午都有种沉闷的阴郁感，几乎不怎么说话。"},{"en":"Her grumness faded after she had some tea and a short walk.","zh":"她喝了点茶、散了会儿步后，那股闷闷的不快就消退了。"}]}],"synonyms":["grumpiness","moroseness","gloominess","sulkiness","ill humor"],"phonetic":"/ˈɡrʌm.nəs/","extraExplanation":["“grumness”在现代英语中非常少见，更常用的是“grumpiness”（坏脾气、爱抱怨的情绪）或“gloominess / sulkiness”（阴沉/闷闷不乐）。如果你是在写作或考试中使用，通常建议改用更常见的词。","词形上可理解为“grum-（阴沉/不快的感觉）+ -ness（名词后缀，表示状态/性质）”，所以整体就是“阴沉/不快的状态”。"]}
{"word":"grumose","summary":{"en":"Grumose means clotted or lumpy (often in medical/scientific contexts), and sometimes cloudy with particles.","zh":"grumose 指“凝结成块/结团的”（常用于医学或科学描述），有时也指“因颗粒而浑浊的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a clotted, lumpy, or curdled texture; made of small clots (often used in medical or scientific writing).","zh":"（质地）凝结成块的；结成小团的；（常用于医学/科学语境）有凝块的。"},"examples":[{"en":"The lab report described the sample as grumose, suggesting it had started to clot.","zh":"化验报告把样本描述为 grumose，暗示它开始凝结成块了。"},{"en":"Under the microscope, the fluid appeared grumose rather than smooth.","zh":"在显微镜下，这种液体看起来是凝块状的，而不是均匀顺滑的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Cloudy or thick with suspended particles; not clear or uniform.","zh":"浑浊的；因悬浮颗粒而显得浓稠、不清澈的。"},"examples":[{"en":"After shaking, the solution became grumose and hard to see through.","zh":"摇晃后，溶液变得浑浊呈颗粒状，几乎看不清。"}]}],"synonyms":["lumpy","clotted","curdled","chunky","coagulated","cloudy","turbid"],"phonetic":"ˈɡruːmoʊs","extraExplanation":["“grumose”比较少见，多出现在医学、病理或实验室描述里，用来形容血液、分泌物、沉淀等“结块/凝团”的外观。日常英语里更常用的说法是“lumpy / clotted / curdled / chunky / cloudy”。","词源来自拉丁语 *grumosus*（多块的、结团的），与“grume”（凝块）同源。"]}
{"word":"grumous","summary":{"en":"Grumous means thick and clotted, especially used for blood in medical or formal writing.","zh":"Grumous 指（尤指血液）浓稠并凝结成块的，多用于医学或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of blood or other liquid) thick, clotted, and sometimes dark in color.","zh":"（尤指血液或其他液体）浓稠的、凝结成块的（常带暗色）。"},"examples":[{"en":"The report described grumous blood in the wound.","zh":"报告描述伤口里有凝结成块的血液。"},{"en":"A grumous fluid collected at the bottom of the container after it cooled.","zh":"液体冷却后，容器底部聚集了浓稠凝块状的沉积物。"}]}],"synonyms":["clotted","coagulated","thick","viscous","curdled"],"phonetic":"/ˈɡruːməs/","extraExplanation":["“grumous”多见于医学、法医学或较正式的描写中，用来强调液体（尤其是血）呈现“凝结、块状、黏稠”的状态，比日常的 thick / clotted 更书面、更专业。","词源上与拉丁语 grumus（“小堆、团块”）有关，所以核心画面感就是“成团、成块”。在普通对话里更常说：clotted blood（凝血）、thick/dark blood（浓稠/发黑的血）。"]}
{"word":"grumousness","summary":{"en":"Grumousness means a thick, clotted, lumpy condition—most often used for blood or bodily fluids.","zh":"Grumousness 指浓稠、凝结、结块的状态，常用于描述血液或体液。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being thick, clotted, or curdled (especially referring to blood or other bodily fluids).","zh":"（尤指血液或体液）呈浓稠、凝结、结块的状态。"},"examples":[{"en":"The doctor noted the grumousness of the blood in the sample.","zh":"医生注意到样本中的血液呈凝结、浓稠的状态。"},{"en":"Grumousness can make a fluid look dark and lumpy rather than smooth.","zh":"凝结的浓稠感会让液体看起来发暗、结块，而不是顺滑。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A heavy, muddy thickness in a liquid or mixture.","zh":"（罕见）液体或混合物中浑浊、泥状般的黏稠感。"},"examples":[{"en":"After standing overnight, the sauce developed an unpleasant grumousness.","zh":"静置一夜后，这种酱汁变得浑浊黏稠，口感不佳。"}]}],"synonyms":["clottedness","thickness","coagulation","curdling","lumpiness"],"phonetic":"/ˈɡruːməsnəs/","extraExplanation":["“grumousness”来自形容词“grumous”（浓稠凝结的），常见于医学或生物学语境，用来描述血液、脓液等出现“凝块/结团”的质地变化。","词源可追溯到拉丁语 *grumus*（小堆、团块），因此带有“结成团、成块”的形象含义。日常英语中很少用，更常用的表达是“clotting / clotted (blood)”或“thick and clumpy”。"]}
{"word":"grump","summary":{"en":"“Grump” means a bad-tempered person or to complain irritably.","zh":"“grump”指爱发脾气/爱抱怨的人，也可作动词表示不高兴地抱怨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is easily annoyed or often complains; someone with a bad-tempered mood","zh":"脾气坏的人；爱抱怨、容易生气的人"},"examples":[{"en":"Don’t mind him—he’s a grump before his morning coffee.","zh":"别介意他——他早上没喝咖啡前就爱发脾气。"},{"en":"She can be a bit of a grump when she’s tired.","zh":"她累的时候可能会有点爱发牢骚。"}]},{"partOfSpeech":"v.","definition":{"en":"to complain in an annoyed way; to be in a bad mood and speak irritably","zh":"（因不爽而）抱怨；不高兴地嘟囔、说话带刺"},"examples":[{"en":"He kept grumping about the slow Wi‑Fi.","zh":"他一直在抱怨 Wi‑Fi 太慢。"},{"en":"Stop grumping and tell me what’s wrong.","zh":"别再嘟囔抱怨了，告诉我到底怎么了。"}]}],"synonyms":["complainer","grouch","crank","grumble"],"phonetic":"/ɡrʌmp/","extraExplanation":["“grump / grumpy”在语气上通常偏口语、略带玩笑（不算很严重的骂人），常用来形容“心情不好、爱发牢骚”的状态。","常见搭配：a grumpy old man（爱发脾气的老头）、grump about + 事情（抱怨某事）、in a grumpy mood（心情很烦）。","文化提示：在儿童文学/动画里常出现“Grumpy”这类角色名（例如《白雪公主与七个小矮人》里的 Grumpy），强调“外冷内热、嘴硬心软”的刻板形象。"]}
{"word":"grumped","summary":{"en":"“Grumped” usually means “complained in an annoyed way,” and can also describe someone being in a grumpy mood (informal).","zh":"“grumped”通常指“带着不耐烦地抱怨/嘟囔”，也可口语里形容“情绪不佳、很烦”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “grump”) to complain in a low, annoyed way; to speak grumpily.","zh":"（grump 的过去式/过去分词）抱怨；用不耐烦、闷闷的语气嘟囔。"},"examples":[{"en":"He grumped about the weather all morning.","zh":"他一整个早上都在抱怨天气。"},{"en":"She grumped that the meeting was a waste of time.","zh":"她不满地嘟囔说这场会议是在浪费时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) annoyed or complaining; in a grumpy mood.","zh":"（非正式）心情不佳的；爱抱怨的；闷闷不乐的。"},"examples":[{"en":"He was a little grumped after the long flight.","zh":"长途飞行后他有点闷闷不乐。"},{"en":"Don’t mind her—she’s grumped because she didn’t sleep well.","zh":"别介意她——她没睡好，所以有点不爽。"}]}],"synonyms":["complained","grumbled","moaned","groused","muttered"],"phonetic":"/ɡrʌmpt/","extraExplanation":["“grumped”更常见的用法是动词过去式/过去分词（= 抱怨、嘟囔）。作形容词时偏口语，有时也会说“grumpy / grumpish”。在正式写作中更常用“complained”或“was grumpy”。"]}
{"word":"grumph","summary":{"en":"“Grumph” is a rare exclamation or noun for a grumpy, annoyed sound—like “humph!”","zh":"“grumph”是较少见的感叹词/名词，表示不满的“哼”声，类似“humph!”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(rare) An exclamation or sound used to show annoyance, impatience, or disapproval—similar to “humph!” or “harrumph!”","zh":"（较少见）表示恼火、不耐烦或不赞同的感叹声/拟声词，类似“哼！”或“harrumph!”"},"examples":[{"en":"Grumph! I can’t believe the meeting got moved again.","zh":"哼！我真不敢相信会议又被改期了。"},{"en":"He answered with a grumph and went back to work.","zh":"他“哼”了一声，又继续干活了。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A grumbling sound or short complaint expressing annoyance.","zh":"（较少见）表示不满的咕哝声；简短的抱怨。"},"examples":[{"en":"There was a quiet grumph from the back of the line.","zh":"队伍后面传来一声轻轻的抱怨。"},{"en":"She responded with a little grumph, but she agreed to help.","zh":"她小声抱怨了一下，但还是同意帮忙。"}]}],"synonyms":["humph","harrumph","grumble","ugh"],"phonetic":"/ɡrʌmf/","extraExplanation":["“grumph”在现代英语里很少作为标准拼写出现，更常见的是“humph”“harrumph”，或直接用动词/名词“grumble”。它常见于小说对话或文字里，用来写出人物不耐烦的声音效果（拟声/语气词）。如果你是在聊天或写作中使用，更自然的选择通常是“humph!”或“ugh!”（语气更强时）或“grumble”（描述动作时）。"]}
{"word":"grumphie","summary":{"en":"“Grumphie” is a Scottish dialect word meaning “pig.”","zh":"“grumphie”是苏格兰方言词，意思是“猪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) a pig; sometimes used humorously or as a nickname.","zh":"（苏格兰方言）猪；有时带幽默感地用作外号或称呼。"},"examples":[{"en":"In Scots stories, a “grumphie” often wanders into the yard looking for scraps.","zh":"在苏格兰故事里，“grumphie”常常会晃进院子里找残羹剩饭。"},{"en":"He called the muddy little pig a grumphie and laughed.","zh":"他把那只沾满泥的小猪叫作 grumphie，然后笑了。"}]}],"synonyms":["pig","hog","swine (formal)","piglet (young pig)"],"phonetic":"/ˈɡrʌmfi/","extraExplanation":["“grumphie”主要出现在苏格兰英语（Scots）与苏格兰方言写作中，属于地域性词汇；在现代日常美式英语里几乎不用。","在文学或民间故事语境中，它常用来营造乡村、朴素、带点调侃的氛围。阅读时可直接理解为“pig（猪）”。"]}
{"word":"grumphies","summary":{"en":"“Grumphies” is a Scots dialect plural meaning “pigs.”","zh":"“grumphies”是苏格兰方言中“猪”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) a pig; a hog.","zh":"（苏格兰方言）猪；野猪/家猪（常指猪这种动物）。"},"examples":[{"en":"In the Scots tale, the farmer fed the grumphies behind the barn.","zh":"在那则苏格兰故事里，农夫在谷仓后面喂猪。"},{"en":"The yard was noisy with grumphies squealing for food.","zh":"院子里很吵，猪在尖叫着要吃的。"}]}],"synonyms":["pigs","hog(s)","swine"],"phonetic":"/ˈɡrʌmfi/","extraExplanation":["“grumphie / grumphies”主要见于苏格兰英语（Scots）的口语或文学描写中，属于地域性用词；在现代通用英语里更常说“pig(s)”或“hog(s)”。","拼写容易让人联想到常见形容词“grumpy（脾气坏的）”，但两者含义不同。"]}
{"word":"grumphy","summary":{"en":"“Grumphy” is usually a misspelling of “grumpy,” meaning easily annoyed or in a bad mood.","zh":"“grumphy”通常是“grumpy”的拼写错误，意思是“易烦躁、心情不好”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common misspelling) The correct spelling is “grumpy”: easily annoyed and in a bad mood.","zh":"（常见拼写错误）正确拼写是“grumpy”：脾气不太好、容易不耐烦或心情不好。"},"examples":[{"en":"I’m a little grumpy before I’ve had my coffee.","zh":"我没喝咖啡前会有点暴躁/不耐烦。"},{"en":"Don’t mind him—he’s just grumpy today.","zh":"别介意他——他今天只是心情不好。"}]}],"synonyms":["grumpy","grouchy","cranky","irritable"],"phonetic":"ˈɡrʌmpi","extraExplanation":["“grumphy”在英语里通常不算标准拼写；日常写作与考试中建议用“grumpy”。","语气对比：grumpy 常指“心情不好、爱抱怨”；grouchy 更偏“爱发牢骚、闹情绪”；cranky 常指“易怒、脾气急”（也可指机器“运转不稳定”）。"]}
{"word":"grumpier","summary":{"en":"“Grumpier” means “more grumpy”—more easily annoyed or in a bad mood than someone/something else.","zh":"“grumpier”表示“更不高兴/更爱抱怨”，是“grumpy”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “grumpy”: more bad-tempered, easily annoyed, or complaining more than someone/something else.","zh":"“grumpy”的比较级：比……更爱发牢骚/更暴躁/更容易不耐烦。"},"examples":[{"en":"He’s grumpier in the morning before coffee.","zh":"他早上没喝咖啡前会更爱发脾气。"},{"en":"The weather got colder, and everyone seemed grumpier.","zh":"天气更冷了，大家看起来也更烦躁。"},{"en":"She’s grumpier than usual because she didn’t sleep well.","zh":"她比平时更不高兴，因为没睡好。"}]}],"synonyms":["more irritable","more cranky","more grouchy","more bad-tempered"],"phonetic":"/ˈɡrʌmpiər/","extraExplanation":["“grumpier”是形容词“grumpy”的比较级。以辅音字母+y结尾的形容词，变比较级时通常把y变成i再加-er：grumpy → grumpier（最高级是 grumpiest）。","常见搭配：feel grumpier（感觉更烦躁）、get grumpier（变得更烦躁）、seem/look grumpier（看起来更不高兴）。语气通常较口语、带点不太严重的抱怨意味。"]}
{"word":"grumpiest","summary":{"en":"“Grumpiest” means the most bad-tempered or easily annoyed.","zh":"“grumpiest”表示“最暴躁/最爱抱怨/最容易不耐烦的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most grumpy; having the strongest bad-tempered, complaining, or easily annoyed mood (superlative form of “grumpy”).","zh":"最爱抱怨的；最暴躁的；最容易不耐烦的（“grumpy”的最高级）。"},"examples":[{"en":"Dad is the grumpiest in the morning before he has coffee.","zh":"爸爸早上没喝咖啡前最容易暴躁。"},{"en":"Of all my classmates, Ben is the grumpiest when he’s hungry.","zh":"在我所有同学里，本饿的时候最爱发牢骚。"}]}],"synonyms":["most irritable","most grouchy","most cranky","most bad-tempered"],"phonetic":"/ˈɡrʌmpiəst/","extraExplanation":["“grumpiest”是形容词“grumpy”的最高级：grumpy → grumpier → grumpiest。常见搭配：the grumpiest person/face/mood，“feel/look grumpy”。","语气通常偏口语、带一点调侃，但也可能显得不礼貌；描述他人时，若不熟悉对方，可用更委婉的说法如 “a bit irritable / not in a great mood”。"]}
{"word":"grumpily","summary":{"en":"“Grumpily” means doing or speaking in an annoyed, bad-tempered way.","zh":"“grumpily”表示以不耐烦、脾气差、爱抱怨的方式说话或做事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a bad-tempered, annoyed, or complaining way.","zh":"脾气不好地；恼火地；抱怨地。"},"examples":[{"en":"He answered grumpily and went back to his work.","zh":"他不耐烦地回答了一句，又回去继续工作。"},{"en":"She grumpily said she didn’t want to go.","zh":"她没好气地说她不想去。"}]}],"synonyms":["irritably","crossly","crankily","peevishly"],"phonetic":"/ˈɡrʌmpəli/","extraExplanation":["“grumpily”来自形容词“grumpy”（爱抱怨的、脾气坏的）+ 副词后缀“-ly”。语气比“angrily”（生气地）更轻一些，更像“有点不耐烦、闹情绪”的感觉。","常见搭配：say/speak/answer grumpily（没好气地说/回答）、complain grumpily（嘟囔着抱怨）。","在写作或叙事中，“grumpily”常用来表现人物情绪，不一定代表真正的愤怒，也可能是累了、没睡好、被打扰后的反应。"]}
{"word":"grumpiness","summary":{"en":"Grumpiness means a bad-tempered, easily annoyed mood or personality.","zh":"Grumpiness 指“脾气坏、容易烦躁”的情绪或性格状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being easily annoyed, bad-tempered, or in a sour mood","zh":"脾气坏、容易烦躁或心情不佳的状态；爱抱怨、爱生气的性情"},"examples":[{"en":"His grumpiness in the morning usually disappears after coffee.","zh":"他早上的坏脾气通常喝完咖啡就消失了。"},{"en":"I tried not to take her grumpiness personally—she was just tired.","zh":"我尽量不把她的烦躁当成针对我——她只是累了。"},{"en":"The long delay added to everyone’s grumpiness at the airport.","zh":"长时间的延误让机场里每个人都更烦躁了。"}]}],"synonyms":["irritability","bad temper","crankiness","grouchiness","surliness"],"phonetic":"/ˈɡrʌm.pinəs/","extraExplanation":["“grumpiness”来自“grumpy”（脾气坏的、闷闷不乐的）+ 名词后缀“-ness”（表示“……的状态/性质”），因此它强调一种持续或反复出现的“爱发牢骚/易恼火”的气质或状态。","语气上，“grumpiness”多用于日常、轻微的负面情绪描述，比“anger”（愤怒）弱，也比“hostility”（敌意）更不强烈；有时带一点“吐槽式的可爱/无伤大雅”的感觉，取决于语境。","常见搭配：morning grumpiness（起床气/早晨的烦躁）、a bout of grumpiness（一阵烦躁）、hide/cover one’s grumpiness（掩饰坏情绪）、grumpiness fades（烦躁消退）。"]}
{"word":"grumping","summary":{"en":"“Grumping” means complaining in an annoyed, bad-tempered way, or the act/sound of such complaining.","zh":"“grumping”指带着不耐烦、坏脾气地抱怨，也可指这种抱怨的行为或声音。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “grump”) complaining in an annoyed way; speaking or acting with bad-tempered dissatisfaction.","zh":"（动词 grump 的现在分词）以不耐烦、闹情绪的方式抱怨；带着坏脾气地表达不满。"},"examples":[{"en":"He was grumping about the traffic all the way home.","zh":"他一路回家都在抱怨交通。"},{"en":"Stop grumping and help me carry these boxes.","zh":"别再闹情绪抱怨了，来帮我搬这些箱子。"}]},{"partOfSpeech":"n.","definition":{"en":"informal complaining or bad-tempered remarks (the act or sound of grumping).","zh":"非正式：抱怨的话；闹情绪的嘀咕（抱怨的行为或声音）。"},"examples":[{"en":"There was a lot of grumping in the line at the ticket counter.","zh":"在售票窗口排队的人抱怨声一片。"},{"en":"Her grumping didn’t change the decision.","zh":"她再怎么抱怨也改变不了决定。"}]}],"synonyms":["complaining","grousing","griping","moaning","whining"],"phonetic":"/ˈɡrʌmpɪŋ/","extraExplanation":["“grump”常指带点孩子气或情绪化的抱怨，语气比“complain”更不耐烦、更“闹脾气”。类似词有“grouch”（更爱发牢骚、脾气更臭）和“whine”（更像撒娇式、带哭腔的抱怨）。"]}
{"word":"grumpish","summary":{"en":"“Grumpish” means slightly grumpy or bad-tempered.","zh":"“grumpish”表示“有点爱发牢骚/略显脾气不好”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bad-tempered, easily annoyed, and often showing it in your face or voice; somewhat grumpy.","zh":"脾气不太好、容易烦躁（常会表现在表情或语气上）；有点爱发牢骚的。"},"examples":[{"en":"He looked grumpish in the morning before he’d had his coffee.","zh":"他早上没喝咖啡前看起来有点闷闷不乐、脾气不佳。"},{"en":"Don’t take it personally—she’s just feeling grumpish today.","zh":"别往心里去——她今天只是有点烦躁而已。"}]}],"synonyms":["grumpy","cranky","irritable","testy"],"phonetic":"/ˈɡrʌm.pɪʃ/","extraExplanation":["“grumpish”来自“grump”（爱抱怨的人/发牢骚的人）+ 形容词后缀“-ish”。“-ish”常表示“有点……、略微……”，所以语气通常比“grumpy”更弱一点，带有“稍微不耐烦/有点不高兴”的感觉。"]}
{"word":"grumpishness","summary":{"en":"Grumpishness means a tendency to be easily annoyed or in a bad mood.","zh":"grumpishness 指“爱烦躁、爱抱怨、闷闷不乐”的性格或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being grumpish: often slightly angry, easily annoyed, or in a bad mood.","zh":"脾气坏、爱抱怨或容易不耐烦的状态；闷闷不乐、爱发牢骚的样子。"},"examples":[{"en":"His grumpishness in the morning disappears after a cup of coffee.","zh":"他早上的坏脾气在喝完一杯咖啡后就消失了。"},{"en":"I tried not to take her grumpishness personally—she was just tired.","zh":"我尽量不把她的爱发牢骚当回事——她只是太累了。"}]}],"synonyms":["grumpiness","grouchiness","irritability","crankiness"],"phonetic":"/ˈɡrʌm.pɪʃ.nəs/","extraExplanation":["“grumpishness”来自形容词“grumpish”（脾气坏的、爱抱怨的）+ 名词后缀“-ness”（表示“……的性质/状态”），常用来描述一种比较轻微、日常化的“闹情绪/不耐烦”，语气通常比“anger（愤怒）”更弱、也更口语。","近义词里，“grumpiness”更常见、更自然；“grumpishness”偏少见，但含义基本相同。"]}
{"word":"grumps","summary":{"en":"“Grumps” usually means a bad mood (as in “the grumps”), and less commonly refers to grumpy, complaining people.","zh":"“grumps”通常指坏情绪（常见于“the grumps”），较少也可指爱抱怨、脾气差的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bad mood; irritability (usually used in the phrase “the grumps”)","zh":"坏情绪；烦躁（多用于短语“the grumps”）"},"examples":[{"en":"She’s in the grumps this morning, so I’ll talk to her later.","zh":"她今天早上心情很差，所以我晚点再跟她说。"},{"en":"Don’t be in the grumps—let’s take a short walk.","zh":"别闹情绪了——我们出去走走吧。"},{"en":"He got the grumps after the meeting ran long.","zh":"会议拖得太久后，他就开始心烦意乱。"}]},{"partOfSpeech":"n.","definition":{"en":"people who complain a lot; grumpy people (informal, less common)","zh":"爱抱怨的人；脾气不好的家伙们（非正式，用得较少）"},"examples":[{"en":"Ignore the grumps online and focus on the helpful comments.","zh":"别理网上那些爱抱怨的人，专注于有帮助的评论。"},{"en":"Every office has a few grumps, but most people are friendly.","zh":"每个办公室都有几个爱抱怨的人，但大多数人都很友好。"}]}],"synonyms":["bad mood","irritability","grouchiness","the blues (not exact)","grouches (people)","complainers"],"phonetic":"/ɡrʌmps/","extraExplanation":["“grumps”最常见的固定用法是：be in the grumps（在闹情绪/心情很差）或 get the grumps（变得烦躁）。它通常带一点轻松、调侃的语气，比“angry”更像“烦、闷、不耐烦”。","注意：英语里更常用形容词“grumpy”（脾气坏的/不高兴的）来形容人；“grumps”更像是在说一种“情绪状态”或“抱怨的人”。"]}
{"word":"grumpy","summary":{"en":"“Grumpy” means being in a bad mood and easily annoyed.","zh":"“grumpy”指心情不好、容易烦躁或爱发脾气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bad-tempered or easily annoyed; often showing an unhappy mood.","zh":"脾气坏的；爱抱怨的；容易生气的（常表现出不高兴的情绪）。"},"examples":[{"en":"He gets grumpy when he’s hungry.","zh":"他一饿就会变得很暴躁/很爱发脾气。"},{"en":"Don’t be grumpy—let’s talk about it calmly.","zh":"别闹情绪了——我们冷静聊一聊。"},{"en":"She sounded grumpy on the phone this morning.","zh":"她今天早上在电话里听起来情绪很差。"}]}],"synonyms":["cranky","irritable","grouchy","testy","cross"],"phonetic":"/ˈɡrʌmpi/","extraExplanation":["“grumpy”通常用来形容“脾气差、情绪不佳”的状态，比“angry（愤怒）”语气更日常、程度通常更轻，但可能持续一阵子。","常见搭配：feel grumpy（感觉心情差）、get grumpy（变得烦躁）、a grumpy old man（爱发牢骚的老头，带一点刻板印象，用时注意语气）。","文化提示：在流行文化里，“Grumpy”也常用作幽默标签（例如《白雪公主》七个小矮人之一叫 Grumpy），强调“爱抱怨/臭脸”的性格特征。"]}
{"word":"grumus","summary":{"en":"Grumus is a rare noun meaning a small heap or lump (a clump or clustered mass).","zh":"Grumus 是个罕见名词，指一小堆或一小团（团块/聚集物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A small heap, lump, or clump; sometimes used for a small clustered mass (for example, a clot or compacted bit of material).","zh":"（罕见）一小堆、块或团；有时指小型的聚集物（例如凝块或压实的一团物质）。"},"examples":[{"en":"A grumus of soil clung to the gardener’s boot after the rain.","zh":"雨后，园丁的靴子上粘着一小团泥土。"},{"en":"The sauce had a few grumuses, so she whisked it again to make it smooth.","zh":"酱汁里有几团结块，所以她又搅打了一次让它更顺滑。"}]}],"synonyms":["lump","clump","heap","mass","clot"],"phonetic":"/ˈɡruːməs/","extraExplanation":["“grumus”在现代英语中非常少见，更常见的表达是“lump / clump / heap”。","它与拉丁语词源有关，核心概念是“团块、堆积”。在一些旧文献或专业语境里偶尔可见，用来指小块聚集物。","学习与使用时建议优先用更常见的同义词；读到“grumus”时可按“a small lump/clump”理解。"]}
{"word":"grun","summary":{"en":"“Grun” is a dialect form meaning “ground” (the past participle of “grind”).","zh":"“grun”是方言形式，意思相当于“ground”（“grind”的过去分词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Dialect, mainly Scots/Northern English) Past participle of “grind”; means “ground” (made into powder by grinding).","zh":"（方言，多见于苏格兰英语/英格兰北部）“grind”的过去分词形式，意思是“被磨碎的/磨成粉的”（相当于标准英语的 ground）。"},"examples":[{"en":"The oats were grun into fine flour.","zh":"燕麦被磨成了细面粉。"},{"en":"I used grun pepper in the soup.","zh":"我在汤里用了磨碎的胡椒粉。"}]}],"synonyms":["ground","milled","powdered"],"phonetic":"ɡrʌn","extraExplanation":["“grun”不是标准现代英语里常见的拼写；在学习和考试中一般用“ground”（grind 的过去分词）。","很多学习者把“grun”和“grunt”（咕哝/发出哼声）混淆：拼写只差一个 t，但意思完全不同。"]}
{"word":"grunch","summary":{"en":"Grunch is an informal, onomatopoeic word meaning “to crunch noisily” or “a harsh crunching sound.”","zh":"Grunch 是较少见的拟声/非正式用词，表示“嘎吱作响地咬碎/碾碎”，也可指“粗硬的嘎吱声”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to crunch or grind with a rough, noisy sound (often used playfully or informally)","zh":"（非正式、带拟声意味）嘎吱嘎吱地咬碎/碾碎；发出粗硬的“咯吱”声"},"examples":[{"en":"He grunched the chips loudly during the movie.","zh":"他在看电影时把薯片咬得咯吱作响。"},{"en":"Boots grunched on the gravel as she walked up the driveway.","zh":"她沿车道走上去时，靴子踩在碎石上发出咯吱声。"}]},{"partOfSpeech":"n.","definition":{"en":"a rough crunching or grinding sound","zh":"嘎吱嘎吱的咬碎声/碾压声"},"examples":[{"en":"There was a grunch as the door scraped against the floor.","zh":"门擦过地面时发出一声刺耳的刮擦/咯吱声。"}]}],"synonyms":["crunch","grind","gnash","chomp"],"phonetic":"/ɡrʌntʃ/","extraExplanation":["“grunch”不是常见标准词，更像是由“crunch（咬碎/嘎吱响）”类比出来的拟声词，写作中偶尔用来强调声音的粗硬、难听或带点滑稽感。","在美国作家 Robert Anton Wilson 的小说（如 *The Illuminatus! Trilogy*）里，“grunch”还被用作一种带幽默感的概念，指“事情莫名其妙地出错/像有小鬼捣乱一样的倒霉或混乱”。这属于文学里的用法，不是日常常用义。"]}
{"word":"Grund","summary":{"en":"In English, “grund” is rare; it most often refers to a shallow (sandbank) in the sea, and it also appears in names.","zh":"在英语中，“grund”较少见；最常指海中的浅滩/沙洲，也常见于人名或地名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shallow area in the sea or a sandbank (a place where the water is not deep and ships may run aground).","zh":"（海中的）浅滩；沙洲（容易使船搁浅的浅水区）。"},"examples":[{"en":"The fishing boats avoided the grund near the harbor entrance.","zh":"渔船避开了港口入口附近的浅滩。"},{"en":"At low tide, the grund becomes visible as a strip of sand.","zh":"退潮时，这片浅滩会露出一条沙带。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name or place-name element in some European languages, especially in Germanic contexts.","zh":"（常见于欧洲语言中的）姓氏或地名成分，尤见于日耳曼语境。"},"examples":[{"en":"She met Dr. Grund at the conference.","zh":"她在会议上见到了格伦德博士。"},{"en":"The village name ends with -grund, suggesting low or marshy land.","zh":"这个村名以 -grund 结尾，暗示地势较低或靠近湿地。"}]}],"synonyms":["shoal","sandbank","shallow"],"phonetic":"/ɡrʌnd/","extraExplanation":["在现代英语里，grund 不是常用词，更多见于方言、航海/地理语境或专有名词。","德语里的 Grund 很常见，意思包括“原因、理由；基础；地面/土地”。如果你是在学德语或看德语文本，通常就是这个词。"]}
{"word":"grund","summary":{"en":"“Grund” is usually a surname in English; as a German loanword, it can mean “reason/basis.”","zh":"“Grund”在英语里通常是姓氏；作为德语借词时，可表示“理由/根据”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A surname (family name), sometimes seen in English-language contexts because of German or Scandinavian origin.","zh":"（专有名词）姓氏（家族名），常见于具有德语或北欧背景的人名中。"},"examples":[{"en":"Dr. Grund will present the research at the conference.","zh":"Grund 博士将在会议上展示这项研究。"},{"en":"I saw the name Grund on the list of authors.","zh":"我在作者名单上看到了 Grund 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(From German, used in English mainly in language/culture contexts) A “reason,” “basis,” or “ground” for something.","zh":"（源自德语，在英语里多用于语言/文化语境）指“理由、根据、基础”。"},"examples":[{"en":"In German, “Grund” can mean “reason” or “ground,” depending on context.","zh":"在德语里，“Grund”根据语境可表示“理由”或“地面/基础”。"},{"en":"She explained the Grund for the change using a German expression.","zh":"她用一个德语表达解释了这次改变的理由（Grund）。"}]}],"synonyms":["reason","basis","ground","justification"],"phonetic":"/ɡrʌnd/","extraExplanation":["“grund”不是常见的英语单词；在英语文本里更常见的是大写的“Grund”（人名/姓氏）。如果你本来想查的是英语“ground”，拼写应为 ground（如：the ground 地面；grounds 理由）。","德语中常见搭配：aus gutem Grund（有充分理由）、Grund genug（足够的理由）、im Grunde（本质上/实际上）。"]}
{"word":"grundel","summary":{"en":"“Grundel” is a rare word in English, usually meaning a goby fish, and it can also be a surname.","zh":"“grundel”在英语中较少见，通常指虾虎鱼（goby），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bottom-dwelling fish; a goby (a term borrowed from German, used mainly in names or specialized contexts).","zh":"一种生活在水底的小型鱼；虾虎鱼（源自德语的用法，多见于名称或专业语境）。"},"examples":[{"en":"In the field guide, the fish was labeled as a grundel (goby).","zh":"在野外图鉴里，这种鱼被标注为 grundel（虾虎鱼）。"},{"en":"Some regional texts use “grundel” where modern English would say “goby.”","zh":"一些地方性的文本会用“grundel”，而现代英语更常说“goby（虾虎鱼）”。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Grundel published a paper on freshwater ecology.","zh":"Grundel 博士发表了一篇关于淡水生态的论文。"}]}],"synonyms":["goby"],"phonetic":"/ˈɡrʊndəl/","extraExplanation":["“Grundel”主要是德语词，在英语里并不常见；你更常在德语地名/俗名、鱼类学资料，或作为姓氏时看到它。日常英语里通常直接说“goby”。"]}
{"word":"grundified","summary":{"en":"“Grundified” is an informal, nonstandard word meaning “made rough/dirty/grungy,” often used jokingly and sometimes as a variant of “grungified.”","zh":"“Grundified”是非正式、非标准用法，常指“被弄得粗糙、邋遢、很颓很脏”，多带玩笑语气，也常被当作“grungified”的变体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal, nonstandard) Made rough, messy, or “grungy” in appearance; changed in a crude or less polished way. Often used humorously, and sometimes appears as a misspelling/variant of grungified (“made grunge-style”).","zh":"（非正式、非标准用法）被弄得粗糙、邋遢或“很颓/很脏”的；以不太精致、比较粗糙的方式被改造（常带调侃语气，也常被当作 grungified 的变体/误拼）。"},"examples":[{"en":"After the road trip, my sneakers were totally grundified.","zh":"公路旅行回来后，我的运动鞋彻底变得又脏又邋遢。"},{"en":"They grundified the room with dark paint and thrift-store furniture.","zh":"他们用深色油漆和二手店家具把房间改造成偏粗粝的风格。"}]}],"synonyms":["grungy","grungified","messy","dirty","shabby","roughened","uglified"],"phonetic":"/ˈɡrʌn.də.faɪd/","extraExplanation":["“grundified”并不是常见的标准英语词，更多见于网络/口语里的玩笑式用法。你如果想表达“变得很颓、很脏、很粗粝”，更常用的词是：grungy（adj. 颓/脏乱的）、grungified（adj. 被弄成颓风/脏乱风格的）、dirty / messy（脏/乱）。","如果你原本想表达“变得更扎实/更接地气/更脚踏实地”，也可能是想说 grounded（adj. 脚踏实地的）或 down-to-earth（adj. 接地气的）。"]}
{"word":"grundlov","summary":{"en":"“Grundlov” is Danish for “constitution,” especially the Danish Constitution.","zh":"“Grundlov”是丹麦语的“宪法”，尤指《丹麦宪法》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Danish) a constitution; especially the Danish Constitution (often written as “Grundloven”).","zh":"（丹麦语）宪法；尤指《丹麦宪法》（常写作 Grundloven）。"},"examples":[{"en":"Denmark’s Grundlov was adopted in 1849.","zh":"丹麦的《宪法》（Grundlov）于 1849 年通过。"},{"en":"The journalist explained how the Grundlov protects basic rights.","zh":"那位记者解释了《宪法》（Grundlov）如何保护基本权利。"},{"en":"On Grundlovsdag, some Danes attend speeches about democracy and the Grundlov.","zh":"在“宪法日”（Grundlovsdag）这天，一些丹麦人会参加关于民主与宪法的演讲。"}]}],"synonyms":["constitution","basic law","fundamental law","Grundloven"],"phonetic":"/ˈɡrʊnˌdlɔv/","extraExplanation":["“Grundlov”来自丹麦语：grund-（基础）+ lov（法律），字面意思是“基本法/根本法”，相当于英语的 constitution。","丹麦语中常见形式是定冠词形式“Grundloven”（the Constitution）。每年 6 月 5 日为“Grundlovsdag”（宪法日），纪念 1849 年宪法的颁布与丹麦民主制度的发展。"]}
{"word":"Grundloven","summary":{"en":"Denmark’s constitution; a fundamental law","zh":"丹麦宪法；根本法"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Constitution of Denmark (the fundamental law that sets up the Danish state system and citizens’ basic rights)","zh":"丹麦宪法（规定国家制度与公民基本权利的根本法律）"},"examples":[{"en":"In Denmark, the Constitution is called Grundloven.","zh":"在丹麦，宪法叫作 Grundloven。"},{"en":"The Danish Constitution was signed in 1849.","zh":"丹麦宪法于 1849 年签署。"}]},{"partOfSpeech":"n.","definition":{"en":"a constitution or fundamental law (used in Danish in a general sense, though most commonly referring to Denmark’s Constitution)","zh":"宪法；根本法（丹麦语里也可作泛指，但最常见是指丹麦宪法）"},"examples":[{"en":"They discussed how a new constitution should protect civil rights.","zh":"他们讨论新的宪法应如何保护公民权利。"}]}],"synonyms":["constitution","fundamental law","basic law"],"phonetic":"/ˈɡɹʊndlɔvən/","extraExplanation":["在丹麦语文化语境中，Grundloven 往往特指 1849 年确立的丹麦宪法（之后多次修订）。6 月 5 日是丹麦的“宪法日”（Grundlovsdag）。","英文文章中常写作 “the Danish Constitution (Grundloven)”。"],"etymology":"来自丹麦语：grund（“基础、根基”）+ lov（“法律”）+ -en（定冠词后缀，表示“这部/这条”），字面意思是“根本之法/基础法律”。","mnemonic":["拆开记：grund=“ground（地基）”，lov≈“law（法律）”，合起来就是“地基一样的法律”→“宪法/根本法”。"]}
{"word":"grundsil","summary":{"en":"A groundsill is a base timber/plate near the ground that supports wall studs or posts (often called a sill plate).","zh":"groundsill 指靠近地面的底部水平木梁/底板，用来支撑墙体立柱或柱子（常称 sill plate）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Construction) A horizontal timber or base plate laid on or near the ground that supports the lower ends of studs or posts; also called a sill plate or ground sill.","zh":"（建筑）地梁/底槛：贴近地面铺设的水平木梁（或底板），用于支撑墙体立柱（studs）或柱子（posts）的下端；也常叫 sill plate（底板）或 ground sill。"},"examples":[{"en":"The carpenter checked the ground sill to make sure it was level before framing the wall.","zh":"木工在搭墙体框架前先检查地梁是否水平。"},{"en":"Moisture can damage a ground sill if it isn’t properly protected.","zh":"如果没有做好防护，潮气会损坏地梁。"}]}],"synonyms":["sill plate","mud sill","sole plate"],"phonetic":"/ˈɡraʊndˌsɪl/","extraExplanation":["“grundsil”不是常见的标准英语拼写，更常见的是 groundsill（也写作 ground sill）或 sill plate。在北美建筑语境里，sill plate 特别常用，指固定在地基/混凝土基础上的底部木构件。","词源上，sill 指“门槛/底槛/底梁”，在建筑里引申为墙体最底部的水平构件。"]}
{"word":"grundy","summary":{"en":"Grundy usually refers to “Mrs Grundy,” a symbol of strict conventional morality and judgmental public opinion; it can also be a surname.","zh":"Grundy通常指“Mrs Grundy”，象征刻板保守的道德标准与爱评判的社会舆论；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually in the phrase “Mrs Grundy”) a person who represents strict, conventional ideas about what is proper; someone who is easily shocked and quick to judge others.","zh":"（常用于短语“Mrs Grundy”）象征刻板、保守“体面观念”的人；容易大惊小怪、爱评头论足的人。"},"examples":[{"en":"She didn’t post the photo online because she worried what Mrs Grundy would say.","zh":"她没有把照片发到网上，因为担心“Mrs Grundy”会怎么说。"},{"en":"Ignore the Grundys and live your life.","zh":"别理那些保守爱指责的人，过好自己的生活。"},{"en":"The novel quietly challenges Mrs Grundy’s rules about romance and reputation.","zh":"这部小说悄然挑战了“Mrs Grundy”关于爱情与名声的规矩。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（格兰迪/格伦迪等）。"},"examples":[{"en":"Dr. Grundy will see you now.","zh":"格兰迪医生现在见你。"}]}],"synonyms":["prude","moralist","busybody","conventionalist","judgmental person"],"phonetic":"/ˈɡrʌndi/","extraExplanation":["“Mrs Grundy”来自18世纪英国喜剧《Speed the Plough》（1798，Thomas Morton）。剧中人物总担心“Mrs Grundy会怎么说”，后来就演变成对“社会舆论/道德警察式评判”的代称。","这个用法在英式英语里更常见，带一点讽刺意味；在美式英语中也能见到，但可能更像文学或文化引用。"]}
{"word":"grundyism","summary":{"en":"Grundyism means narrow, conventional moralism and fear of social judgment about what is “proper.”","zh":"Grundyism 指狭隘守旧的道德观与对社会评判的过度在意（讲“体面”、爱指责、常带迂腐意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strict, conventional moral attitudes—especially a narrow, judgmental concern with what society considers “proper” (often implying prudishness).","zh":"格守传统、狭隘而爱评判的道德观；特别在意社会眼光与“得体/体面”（常含迂腐、假正经之意）。"},"examples":[{"en":"Her novel was criticized for challenging the grundyism of the small town.","zh":"她的小说因挑战小镇那种狭隘守旧的道德观而受到批评。"},{"en":"Grundyism can make people hide problems instead of asking for help.","zh":"这种“体面至上”的守旧观念可能让人把问题藏起来，而不是寻求帮助。"}]}],"synonyms":["prudery","puritanism","moralism","respectability politics","conventionalism"],"phonetic":"ˈɡrʌndiˌɪzəm","extraExplanation":["“Grundyism”源自英国戏剧里虚构人物“Mrs. Grundy（格兰迪太太）”——一个象征社会闲言碎语与道德评判的“想象的邻居”。因此这个词常用来批评那种过分在意别人怎么看、动辄以传统道德标准指责他人的风气。","语域偏正式、带批判色彩；在现代英语里不算高频，但在讨论社会风俗、保守主义、审查与道德恐慌时会出现。"]}
{"word":"grundyist","summary":{"en":"“Grundyist” describes a person—or an attitude—that is overly strict and judgmental about conventional morality and what is ‘proper.’","zh":"“Grundyist”指对传统道德与“得体”标准过分保守、苛刻、爱评判的人或态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is very strict about conventional morality and what is considered “proper,” and who often judges others by those standards","zh":"（对传统道德与“得体”标准）非常保守、苛刻且爱以此评判他人的人"},"examples":[{"en":"Some critics called the film’s opponents Grundyists who couldn’t tolerate any social change.","zh":"一些评论家称这部电影的反对者是“Grundyist”，无法容忍任何社会变化。"},{"en":"He worried that the Grundyists in his town would gossip about her clothes.","zh":"他担心镇上的“道德卫道士”会对她的穿着说闲话。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing strict, conventional, judgmental ideas about morality and social behavior","zh":"（观点/态度）保守拘谨、道德化、爱评判的"},"examples":[{"en":"Her Grundyist attitude made it hard for her to accept modern dating culture.","zh":"她那种保守道德化的态度让她很难接受现代约会文化。"},{"en":"The school’s rules felt a bit Grundyist to many students.","zh":"在许多学生看来，学校的规定有点过分保守与拘谨。"}]}],"synonyms":["puritanical","prudish","moralistic","straitlaced","judgmental"],"phonetic":"/ˈɡrʌndiɪst/","extraExplanation":["“Grundyist”来自英国戏剧中的虚构人物“Mrs. Grundy”（格兰迪太太）。她象征那种总在意“别人会怎么说”（What will Mrs. Grundy say?）的社会压力与道德审判。这个词常带批评意味，强调的是狭隘、爱管闲事式的道德观，而不只是“有原则”。"]}
{"word":"grundyite","summary":{"en":"Grundyite is a rare clay mineral (a hydrated aluminum silicate) named after Grundy County, Illinois.","zh":"Grundyite（格伦迪石）是一种较罕见的黏土矿物（含水铝硅酸盐），名称源自美国伊利诺伊州格伦迪县。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare clay mineral (a hydrated aluminum silicate), found in some sedimentary deposits and named after Grundy County, Illinois","zh":"一种较罕见的黏土矿物（含水铝硅酸盐），见于某些沉积矿床中，名称源自美国伊利诺伊州的格伦迪县（Grundy County）"},"examples":[{"en":"The sample contained kaolinite with traces of grundyite.","zh":"该样品含有高岭石，并带有微量的格伦迪石（grundyite）。"},{"en":"Grundyite is mainly discussed in mineralogy texts rather than everyday English.","zh":"“grundyite”主要出现在矿物学文献中，而不是日常英语里。"}]}],"synonyms":["clay mineral"],"phonetic":"/ˈɡrʌn.daɪ.aɪt/","extraExplanation":["这是矿物名称，属于高度专业词汇，日常交流中几乎不会用到。","英语里很多矿物名以“-ite”结尾（如 calcite, graphite），表示“某种矿物/岩石”。“Grundyite”就是按常见命名法，用地名（Grundy）+ -ite 构成。"]}
{"word":"grunerite","summary":{"en":"Grunerite is an iron-rich amphibole mineral; fibrous forms may be asbestos-like and hazardous.","zh":"Grunerite（绿铁角闪石）是一种富铁角闪石类矿物；其纤维状形态可能类似石棉并具有危害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gray-green to brown mineral (an iron-rich amphibole) that can form long fibers; some fibrous forms are considered a type of asbestos and can be hazardous if inhaled.","zh":"一种灰绿色到棕色的矿物（富铁角闪石类），可形成长纤维；其中一些纤维状形态被视为石棉的一种，吸入粉尘可能有健康危害。"},"examples":[{"en":"The rock sample contained grunerite along with quartz and magnetite.","zh":"这块岩石样品中含有绿铁角闪石（grunerite），同时还有石英和磁铁矿。"},{"en":"Workers must avoid breathing dust from fibrous grunerite because it may behave like asbestos.","zh":"工人必须避免吸入纤维状绿铁角闪石的粉尘，因为它可能具有类似石棉的危害。"}]}],"synonyms":["iron-rich amphibole","amphibole mineral"],"phonetic":"/ˈɡruːnəˌraɪt/","extraExplanation":["grunerite 常见于变质作用形成的富铁岩石中，也可出现在某些铁矿床附近。","词源来自矿物学家 Louis Gruner 的姓氏（以人名命名的矿物在英文里很常见）。","在环境与职业健康语境中，人们尤其关注其“纤维状”形态；并非所有 grunerite 都呈纤维状，但涉及粉尘时仍应按安全规范处理。"]}
{"word":"gruneritization","summary":{"en":"Gruneritization is a geological process where rocks are altered to form or contain the mineral grunerite.","zh":"Gruneritization 指岩石发生蚀变/变质而形成或富集绿闪石（grunerite）的地质过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) A type of mineral alteration in which rocks are changed (often by metamorphism or hydrothermal fluids) to contain significant amounts of the amphibole mineral grunerite.","zh":"（地质）一种矿物蚀变/变质作用，指岩石在变质或热液作用下转变为含有大量“绿闪石（grunerite）”这种角闪石类矿物的过程。"},"examples":[{"en":"In the iron-formation, gruneritization commonly accompanies metamorphism at medium grade.","zh":"在含铁建造中，绿闪石化常常伴随中等变质级的变质作用出现。"},{"en":"Microscopic study showed gruneritization along fractures where fluids could circulate.","zh":"显微研究显示裂隙附近发生了绿闪石化，因为流体更容易在这些通道中循环。"}]}],"synonyms":["grunerite alteration","grunerite metasomatism","amphibole alteration"],"phonetic":"/ˌɡruːnəraɪtəˈzeɪʃən/","extraExplanation":["“gruneritization”不是日常英语词汇，更常见于地质学论文或勘探报告中。它由矿物名 grunerite（绿闪石）+ -ization（……化/……作用）构成，意思就是“形成/转变为绿闪石的作用”。","绿闪石属于角闪石族矿物；某些形态与石棉类纤维有关。在环境与职业健康语境中，可能会讨论其粉尘风险，但具体危险性取决于矿物形态与暴露条件。","如果你是在文献里看到该词，也可能出现拼写变体如 gruneritisation（英式拼写）。"]}
{"word":"grunge","summary":{"en":"Grunge can mean a 1990s rock genre, the related casual ‘messy’ fashion style, or simply dirt/grime.","zh":"Grunge 可以指90年代的垃圾摇滚、相关的随性“邋遢风”穿搭，也可以泛指污垢/脏东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A style of rock music that became popular in the early 1990s, known for a heavy guitar sound and honest, sometimes gloomy lyrics (often linked with Seattle bands like Nirvana).","zh":"垃圾摇滚（90年代初流行的摇滚风格），特点是厚重的吉他音色与真诚、略阴郁的歌词（常与西雅图乐队如 Nirvana 相关）。"},"examples":[{"en":"Nirvana helped bring grunge to a global audience.","zh":"Nirvana 帮助垃圾摇滚走向全球。"},{"en":"She’s been listening to grunge since high school.","zh":"她从高中起就一直在听垃圾摇滚。"}]},{"partOfSpeech":"n.","definition":{"en":"A fashion style inspired by grunge music, often featuring loose, casual clothes like flannel shirts, ripped jeans, and boots.","zh":"“垃圾摇滚风”穿搭（受垃圾摇滚影响的时尚风格），常见宽松休闲的法兰绒衬衫、破洞牛仔裤、靴子等。"},"examples":[{"en":"His grunge look included a flannel shirt and worn-out sneakers.","zh":"他的垃圾摇滚风穿搭包括法兰绒衬衫和旧运动鞋。"},{"en":"Grunge fashion came back into style for a while.","zh":"垃圾摇滚风时尚曾一度回潮。"}]},{"partOfSpeech":"n.","definition":{"en":"Dirt or a grimy layer on something; general uncleanliness (informal).","zh":"污垢；脏东西（口语）。"},"examples":[{"en":"There was grunge on the windows from years of dust and rain.","zh":"窗户上有多年灰尘和雨水留下的污垢。"},{"en":"Use a brush to scrub the grunge off the tiles.","zh":"用刷子把瓷砖上的污垢刷掉。"}]}],"synonyms":["grime","dirt","filth","gunk"],"phonetic":"/ɡrʌndʒ/","extraExplanation":["“grunge”一词原本就有“脏、邋遢”的感觉，所以用来命名这种音乐与穿搭风格也很贴切：它强调反主流、真实、不修饰。","文化上常把“grunge”与1990年代美国太平洋西北地区（尤其西雅图）的青年文化联系在一起；文学/媒体中常用它来营造“粗粝、现实、不光鲜”的氛围。"]}
{"word":"grunge-inspired","summary":{"en":"influenced by the grunge aesthetic","zh":"受格朗吉（脏酷）风格影响的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Influenced by the grunge movement (especially 1990s alternative rock), often shown through a casual, slightly messy, edgy style in fashion, design, or art.","zh":"受“垃圾摇滚/格朗吉（grunge）”文化影响的（尤其指90年代另类摇滚），常体现在穿搭、设计或艺术上的随意、略凌乱、叛逆的风格。"},"examples":[{"en":"She wore a grunge-inspired outfit: a flannel shirt, ripped jeans, and heavy boots.","zh":"她穿了一身格朗吉风穿搭：法兰绒衬衫、破洞牛仔裤和厚底靴。"},{"en":"The cafe’s grunge-inspired interior uses dark colors and raw metal textures.","zh":"这家咖啡馆的格朗吉风室内设计用了深色和粗粝的金属质感。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a rough, gritty, worn-looking aesthetic that suggests “unpolished cool,” even if it is not directly connected to the music scene.","zh":"呈现粗糙、脏酷、旧旧的质感与“未打磨的酷”（即使不一定和音乐圈直接相关）。"},"examples":[{"en":"The photos are grunge-inspired, with grainy lighting and muted tones.","zh":"这些照片有格朗吉风：颗粒感光线和低饱和的色调。"},{"en":"He chose grunge-inspired typography to make the poster feel raw and rebellious.","zh":"他选了格朗吉风字体，让海报更“原始”也更叛逆。"}]}],"synonyms":["grungy","alternative","edgy","casual","distressed","rough-edged","punk-influenced"],"phonetic":"/ˈɡrʌndʒ ɪnˈspaɪɚd/","extraExplanation":["“Grunge”常让人联想到：法兰绒衬衫（flannel）、层叠穿搭（layering）、宽松或旧化（distressed）的衣物、重靴，以及偏阴郁/冷淡的色调。文化上也与“反主流、反精致、真实感”相关。"],"etymology":"“grunge”源自俚语，意为“脏、污垢”，后来成为1990年代以西雅图为中心的音乐与文化标签；“-inspired”表示“受……启发/影响的”。合起来就是“受格朗吉风格影响的”。","mnemonic":["把它拆开记：grunge（脏脏的酷）+ inspired（受启发）→“被脏酷风影响”。","联想中文：格朗吉=“旧、糙、随意但有态度”；看到破洞牛仔+法兰绒就想到它。"]}
{"word":"grunges","summary":{"en":"“Grunges” is usually the plural of “grunge”: dirt/grime, or the grunge rock style and culture (and it can also be a verb meaning “make dirty”).","zh":"“grunges”通常是“grunge”的复数：指污垢/油泥，也可指垃圾摇滚风格与文化；它还可作动词表示“弄脏”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dirt, grime, or something that looks dirty and unpleasant; a generally “grimy” look or substance","zh":"污垢；油泥；脏兮兮的东西（或整体“脏乱”的感觉）"},"examples":[{"en":"There was grunge on the windows, so the room looked darker than it really was.","zh":"窗户上有一层污垢，所以房间看起来比实际更暗。"},{"en":"Wipe the grunge off your hands before you touch the keyboard.","zh":"摸键盘前先把手上的污垢擦掉。"}]},{"partOfSpeech":"n.","definition":{"en":"a style of rock music and youth culture from the late 1980s–1990s, known for a rough, raw sound and casual, worn clothing","zh":"（20世纪80年代末至90年代的）垃圾摇滚/颓废摇滚风格及其青年文化；特点是粗粝直接的音乐与随意、旧旧的穿着风格"},"examples":[{"en":"Nirvana helped bring grunge into the mainstream in the early 1990s.","zh":"涅槃乐队在90年代初把垃圾摇滚带入主流。"},{"en":"She likes the grunge look—flannel shirts and worn jeans.","zh":"她喜欢垃圾摇滚风的穿搭——法兰绒衬衫配旧牛仔裤。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something dirty or messy (informal)","zh":"把……弄脏；弄得乱糟糟（非正式）"},"examples":[{"en":"Don’t grunge up your nice jacket with paint.","zh":"别让油漆把你那件好外套弄脏。"},{"en":"His shoes got grunged up after the rainy walk.","zh":"雨天走了一段路后，他的鞋子变得脏兮兮的。"}]}],"synonyms":["grime","dirt","filth","crud","muck"],"phonetic":"/ɡrʌndʒ/","extraExplanation":["“grunge”最早常指“污垢/脏乱”，后来在美国西雅图兴起的音乐场景中被用来形容一种“粗粝、反精致”的声音与审美，于是形成了“grunge music / grunge style”。","你输入的“grunges”通常是名词复数（多个“污垢/脏东西”或不同类型的“脏乱”），也可能是动词第三人称单数（he/she grunges）。"]}
{"word":"grungier","summary":{"en":"“Grungier” means more dirty/shabby, or more in a grunge-style aesthetic.","zh":"“Grungier”表示更脏、更破旧/邋遢，或更偏油渍摇滚（颓废风）的审美风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “grungy”: dirtier, more shabby, or more neglected in appearance.","zh":"“grungy（邋遢的/脏兮兮的）”的比较级：更脏、更破旧、更显得不整洁或无人打理。"},"examples":[{"en":"After camping for a week, our clothes looked even grungier than before.","zh":"露营一周后，我们的衣服看起来比之前更邋遢了。"},{"en":"The alley gets grungier the farther you walk from the main street.","zh":"离主街越远，那条小巷就越显得脏乱。"}]},{"partOfSpeech":"adj.","definition":{"en":"More in the style of “grunge” (especially a 1990s rock/music-and-fashion aesthetic): rough, worn, and deliberately undone.","zh":"更“grunge（油渍摇滚/颓废风）”的：更粗粝、旧旧的、刻意不修边幅的风格（常指音乐或穿搭审美）。"},"examples":[{"en":"She chose a grungier look—ripped jeans and a faded band T-shirt.","zh":"她选择了更偏颓废风的造型——破洞牛仔裤和褪色的乐队T恤。"},{"en":"This remix sounds grungier, with heavier guitars and a raw vocal.","zh":"这个混音听起来更有油渍摇滚味：吉他更厚重，人声更粗粝。"}]}],"synonyms":["dirtier","shabbier","grimier","seedier","more rundown","more grunge-style"],"phonetic":"/ˈɡrʌndʒiər/","extraExplanation":["“grungy”常用来描述“脏、破、旧、阴暗”的感觉；在流行文化里也可指90年代“grunge”相关的音乐与穿衣风格（如西雅图乐队文化、法兰绒衬衫、旧牛仔、随性不修边幅）。在语境中要看是在说“环境/外表更脏乱”，还是在说“风格更偏grunge”。"]}
{"word":"grungiest","summary":{"en":"“Grungiest” means the most dirty/messy, or the most strongly “grunge-style” (raw, rugged, unpolished).","zh":"“grungiest”是“grungy”的最高级，表示“最脏最邋遢”，也可表示“最有grunge风（粗粝、不修边幅）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most dirty, messy, or unpleasant-looking; having the strongest “grunge” (dirtiness/roughness) among a group.","zh":"最肮脏的；最邋遢的；最“脏乱粗糙”的（在一组事物中程度最高）。"},"examples":[{"en":"After the festival, the campground was the grungiest place I’d ever seen.","zh":"音乐节结束后，露营地成了我见过最邋遢的地方。"},{"en":"He wore the grungiest sneakers, but they were comfortable.","zh":"他穿着最脏的运动鞋，但很舒服。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most strongly associated with the grunge style (1990s alternative rock culture): casual, rugged, and intentionally unpolished.","zh":"最具“垃圾摇滚/颓废摇滚（grunge）风格”的：随意、粗犷、刻意不精致的（常指90年代另类摇滚文化相关穿搭/氛围）。"},"examples":[{"en":"That flannel-and-boots outfit is the grungiest look in the whole photo shoot.","zh":"那套法兰绒衬衫配靴子的穿搭，是整组拍摄里最有grunge风的造型。"},{"en":"They played their grungiest set of the tour, loud and raw.","zh":"他们在巡演中演了最“grunge”的一场，声音很大、很原始粗粝。"}]}],"synonyms":["dirtiest","messiest","filthiest","shabbiest","most unpolished","most grunge-style"],"phonetic":"/ˈɡrʌn.dʒi.əst/","extraExplanation":["“grungiest”是形容词“grungy”的最高级（grungy → grungier → grungiest）。","“grunge”原意与“污垢、脏东西”有关；后来也指90年代以西雅图为代表的一种摇滚音乐与审美（如宽松衣物、法兰绒衬衫、破洞牛仔、刻意不修边幅）。在语境里要根据是在说“脏”还是在说“风格”。"]}
{"word":"grungified","summary":{"en":"made deliberately gritty, messy, or grunge-styled","zh":"被刻意处理成粗粝、凌乱的颓废风"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to look or feel like grunge—rough, gritty, messy, or intentionally “worn-in,” especially in fashion, design, music, or photo editing.","zh":"被弄成“垃圾摇滚/颓废风（grunge）”的感觉——粗粝、脏感、随意凌乱、刻意做旧（常见于穿搭、设计、音乐或修图风格）。"},"examples":[{"en":"The designer grungified the clean white outfit with a distressed jacket and heavy boots.","zh":"设计师用做旧夹克和厚重靴子把原本干净的白色穿搭变成了颓废风。"},{"en":"The photos were grungified with darker shadows and a grainy filter.","zh":"照片通过加深阴影和颗粒滤镜被处理成了粗粝的颓废风。"},{"en":"His room looked grungified after the party—clothes everywhere and cups on the floor.","zh":"派对之后他的房间看起来像“被弄得很脏乱”——衣服到处都是，杯子也在地上。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “grungify”: to make something look grungy, gritty, or deliberately rough.","zh":"“grungify”的过去式：把某物弄成粗粝、脏感、刻意随性的颓废风。"},"examples":[{"en":"They grungified the set to match the band’s underground image.","zh":"他们把舞台布景做成粗粝颓废的风格，以贴合乐队的地下气质。"},{"en":"The editor grungified the cover art to give it a raw feel.","zh":"编辑把封面图做成粗糙的颓废风，让它更有原始感。"}]}],"synonyms":["grungy","distressed","weathered","roughened","gritty","worn","tattered","shabby","dirty","messy"],"phonetic":"/ˈɡrʌndʒɪˌfaɪd/","extraExplanation":["“grunge”不仅指一种音乐流派（如Nirvana等相关文化语境），也常指一种审美：旧旧的、磨损的、带颗粒噪点的、反精致的风格。","“grungified”多见于时尚、平面设计、摄影/后期、室内布置等语境；口语里也可泛指“弄得很脏很乱”，但通常带有“刻意做出粗糙效果”的意味。"],"etymology":"来自“grunge（垃圾摇滚/邋遢粗粝风格）+ -ify（使变成……）+ -ed（过去式/过去分词）”。“grunge”在1990年代因西雅图音乐与穿搭文化而广泛流行，后来延伸到视觉设计与审美语境。","mnemonic":["把它拆开记：grunge（颓废风/脏感）+ ify（使变成）+ ed（已被……）→“已经被做成颓废风了”。","联想中文“脏脏风/做旧风”：一加滤镜、一做旧处理，就变成 grungified。"]}
{"word":"grungy","summary":{"en":"Grungy means dirty and unpleasant, or (in style) rough, messy, and rebellious—often linked to grunge music and fashion.","zh":"Grungy 指脏兮兮、令人不快的；也可指风格粗粝随性、凌乱带叛逆感，常与垃圾摇滚及其穿搭审美相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Dirty and a bit unpleasant, often from dust, grease, or lack of cleaning.","zh":"（因灰尘、油污或缺乏清洁而）脏兮兮的、邋遢的。"},"examples":[{"en":"After the long trip, our clothes looked grungy and wrinkled.","zh":"长途旅行后，我们的衣服看起来又脏又皱。"},{"en":"The kitchen floor got grungy from spilled oil.","zh":"厨房地板因为洒了油变得油腻脏污。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a rough, messy style that feels raw and rebellious (often used for clothes, music, or design).","zh":"（风格）粗粝、随性凌乱、带叛逆感的（常形容穿搭、音乐或设计）。"},"examples":[{"en":"She wore a grungy jacket and old boots.","zh":"她穿着一件很“grungy”的外套和旧靴子。"},{"en":"The band is known for its grungy rock sound.","zh":"这支乐队以粗粝的“垃圾摇滚”风格而闻名。"}]}],"synonyms":["dirty","filthy","grim y","messy","scruffy","unkempt","grunge-inspired"],"phonetic":"/ˈɡrʌndʒi/","extraExplanation":["“grungy”来自名词“grunge”（污垢、脏东西）。1990年代美国西雅图的“grunge（垃圾摇滚）”文化让这个词更常用来形容一种随性、不修边幅、略带反主流的审美与音乐风格。"]}
{"word":"grunian","summary":{"en":"Grunion: a small California coastal fish known for coming onto beaches to spawn at night.","zh":"Grunion（常被误写为grunian）：一种加州沿岸小鱼，以夜间上岸在沙滩产卵而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small silvery fish found along the coast of California and Baja California, famous for coming onto sandy beaches at night to spawn.","zh":"一种生活在加州与下加州沿岸的小型银色鱼类，以夜间上岸到沙滩产卵的行为而闻名。"},"examples":[{"en":"People went to the beach at night to watch the grunion run.","zh":"人们夜里去海滩观看银汉鱼上岸产卵的“跑潮”。"},{"en":"Grunion spawn in the sand during certain high tides.","zh":"银汉鱼会在某些大潮时把卵产在沙里。"}]}],"synonyms":["silverside (family name)"],"phonetic":"/ˈɡrʌniən/","extraExplanation":["你输入的“grunian”更常见的正确拼写是“grunion”。“grunion run”是南加州很有名的自然现象：在特定潮汐与月相的夜晚，成群的银汉鱼会游上沙滩产卵，常被当地人当作季节性活动去观看。","在加州部分地区，抓捕grunion有特定规定（例如季节、时间与方式限制），如果你在当地旅行，最好查一下官方渔猎部门的最新规则。"]}
{"word":"grunion","summary":{"en":"Grunion is a small Pacific coast fish known for coming onto beaches at night to spawn.","zh":"Grunion 指北美太平洋沿岸一种小鱼，以夜间上岸沙滩产卵闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small silvery fish found along the Pacific coast of North America, famous for coming onto sandy beaches at night to spawn (lay eggs)","zh":"银色小鱼（加州等北美太平洋沿岸常见），以夜间成群上岸到沙滩产卵而闻名"},"examples":[{"en":"We went to the beach to watch the grunion run.","zh":"我们去海滩看银汉鱼（grunion）上岸产卵的景象。"},{"en":"Grunion are protected by rules, so you may not be allowed to catch them during spawning season.","zh":"银汉鱼在产卵季常受法规保护，所以可能不允许捕捉。"}]}],"synonyms":["California grunion","grunion run (event)"],"phonetic":"/ˈɡrʌn.jən/","extraExplanation":["“grunion”常出现在美国加州的海边文化里，尤其是“grunion run”（银汉鱼上岸产卵潮）。在一些夜晚，它们会随着潮汐爬上沙滩，雌鱼把卵埋在沙里，雄鱼在旁受精；这是当地很有名的自然景观。","词源来自西班牙语，和“gruñón”（意为“爱抱怨的人/嘟囔的人”）有关，据说是因为这种鱼被抓起时会发出类似咕哝的声音。"]}
{"word":"grunions","summary":{"en":"Grunions are small Pacific-coast fish, best known for coming onto beaches at night to spawn.","zh":"Grunions（银汉鱼）是太平洋沿岸的小型海鱼，最有名的是夜间上岸到沙滩产卵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small silvery fish found along the Pacific coast of North America (especially California); grunions are famous for coming onto sandy beaches at night to spawn (lay eggs).","zh":"银白色的小型海鱼（北美太平洋沿岸，尤以加州常见）；以夜间上岸在沙滩产卵而闻名。"},"examples":[{"en":"We went to the beach at night to watch the grunions run.","zh":"我们晚上去海滩看银汉鱼（grunion）“上岸产卵”。"},{"en":"During a grunion run, the fish wriggle onto the sand to lay eggs.","zh":"在银汉鱼上岸产卵的季节，它们会扭动着爬上沙滩产卵。"},{"en":"Grunions are protected in some places, so check local rules before trying to catch them.","zh":"在一些地方银汉鱼受到保护，所以想捕捉前要先查看当地规定。"}]}],"synonyms":["grunion"],"phonetic":"/ˈɡrʌnjən/","extraExplanation":["“grunion”一词常见于美国西海岸文化语境，尤其是加州。最有名的现象叫 **grunion run**（银汉鱼上岸产卵潮）：它们会在特定潮汐与月份的夜晚成群上岸，母鱼钻进沙里产卵，公鱼在旁受精，场面很独特，也常成为自然观察活动。","拼写上你输入的是复数 **grunions**；单数是 **grunion**。发音里常听到类似“GRUN-yun”的节奏。"]}
{"word":"grunswel","summary":{"en":"Groundswell means a strong rise in public support, or (less commonly) a long ocean swell.","zh":"Groundswell 指民意/支持的强烈上升；也可指（较少见）海洋的长涌浪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, widespread increase in support or public opinion (often for a cause, movement, or idea)","zh":"（对某个事业/运动/观点的）广泛而强烈的支持浪潮；民意高涨"},"examples":[{"en":"There was a groundswell of support for the new environmental policy.","zh":"对新环保政策的支持出现了广泛高涨的趋势。"},{"en":"The campaign grew quickly thanks to a groundswell among young voters.","zh":"由于年轻选民中支持浪潮迅速形成，这场竞选很快壮大起来。"}]},{"partOfSpeech":"n.","definition":{"en":"an ocean swell that continues even when local winds have died down","zh":"（海洋）涌浪；长涌（即使当地风停了仍持续的海浪）"},"examples":[{"en":"Surfers waited for the groundswell to arrive.","zh":"冲浪者等待涌浪到来。"},{"en":"A long groundswell rolled in from a distant storm.","zh":"来自远处风暴的长涌浪滚滚而来。"}]}],"synonyms":["surge","upswing","wave of support","momentum","swell"],"phonetic":"/ˈɡraʊndˌswɛl/","extraExplanation":["“grunswel”不是常见英语单词，很可能是拼写错误。它看起来最接近“groundswell”（支持浪潮/涌浪）。如果你想表达“草根力量带来的支持上升”，用 groundswell 很自然。"]}
{"word":"grunt","summary":{"en":"“Grunt” is a low, short sound (or the act of making it), and informally it can mean a low-ranking worker or soldier.","zh":"“grunt”指短促低沉的“哼声/哼”，也可指发出这种声音；口语里还可指基层干粗活的人或低阶士兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, low sound made by a person or animal, often showing effort, pain, or annoyance","zh":"（人或动物发出的）短促、低沉的哼声，常表示用力、疼痛或不耐烦"},"examples":[{"en":"He lifted the box with a grunt.","zh":"他哼了一声，用力把箱子抬起来。"},{"en":"The pig gave a grunt and went back to eating.","zh":"那头猪哼哼了一声，又继续吃东西。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a short, low sound, especially when doing something difficult","zh":"（尤指在做费力的事时）发出短促低沉的哼声"},"examples":[{"en":"He grunted as he stood up.","zh":"他站起来时哼了一声。"},{"en":"She just grunted in reply, not wanting to talk.","zh":"她不想说话，只哼了一声当作回答。"}]},{"partOfSpeech":"n.","definition":{"en":"a simple worker or low-ranking soldier who does hard work (informal)","zh":"干粗活的人；低阶士兵（非正式）"},"examples":[{"en":"He started as a grunt and worked his way up.","zh":"他从干粗活的基层做起，一步步升上去。"},{"en":"In the movie, the grunts do the dangerous jobs while the boss stays safe.","zh":"电影里，底层打手干危险活儿，老大却躲在安全处。"}]}],"synonyms":["groan","snort","grumble","mutter","laborer (informal sense)"],"phonetic":"/ɡrʌnt/","extraExplanation":["“grunt”常用于描写“带情绪的低声回应”，比如不耐烦、敷衍或不想多说时的“哼/嗯”。在对话描写里，比起“said”，它更能传达态度，但用多了会显得人物粗鲁或不礼貌。","口语里“grunts”也可指军队或组织里的“底层执行者”。这种用法带一点轻视或调侃色彩，使用时注意语境与尊重。"]}
{"word":"grunt-fish","summary":{"en":"a marine fish that makes a grunting sound","zh":"会发出哼哼声的海鱼（石鲈科一类鱼的俗称）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Any of various tropical and subtropical marine fishes (family Haemulidae) known for making a grunting sound, often heard when they are taken out of the water.","zh":"石鲈科（拟石鲈科）的一类海鱼的俗称，常见于热带和亚热带海域；因离水或受惊时会发出“咕噜/哼哼”般的声音而得名。"},"examples":[{"en":"Fishermen call them grunt-fish because they make a grunting noise when handled.","zh":"渔民叫它们“grunt-fish”，因为抓在手里时会发出哼哼的声音。"},{"en":"The reef was full of schools of grunt-fish hiding under ledges.","zh":"礁石下面藏着一群群成群结队的grunt-fish。"},{"en":"We spotted a juvenile grunt-fish near the mangroves.","zh":"我们在红树林附近看到了一条幼年的grunt-fish。"}]}],"synonyms":["grunt","grunter","haemulid"],"phonetic":"ˈɡrʌntˌfɪʃ","extraExplanation":["在英语里，“grunts”常作为石鲈科（Haemulidae）鱼类的统称；不同地区也可能用“grunt”指具体某一种（如白石鲈、蓝条石鲈等），所以在菜单或钓鱼语境中，具体指哪种鱼要看当地用法。"],"etymology":"由“grunt（哼哼声、咕噜声）+ fish（鱼）”构成的复合词；名称直接来自这种鱼会发出类似“打呼噜/哼哼”的声音这一特征。","mnemonic":["把它拆开记：grunt＝“哼哼声”，fish＝“鱼”→“会哼哼叫的鱼”。","联想中文：像“咕噜鱼/哼哼鱼”——一离水就会发声。"]}
{"word":"grunt-maker","summary":{"en":"someone or something that makes grunting sounds","zh":"发出哼哧/咕哝等喘哼声的人或东西"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that makes grunting sounds (often used humorously or informally).","zh":"（非正式/带点幽默）发出“哼哧/咕哝”之类喘哼声的人或动物。"},"examples":[{"en":"After the long hike, I became a real grunt-maker going up the last hill.","zh":"爬完那段长途徒步后，我上最后那个坡时简直成了“喘哼制造机”。"},{"en":"The pig was the loudest grunt-maker on the farm.","zh":"那头猪是农场里最响的“哼哧声制造者”。"}]},{"partOfSpeech":"n.","definition":{"en":"A thing (such as a toy, tool, or device) that produces a grunt-like sound.","zh":"（玩具/工具/装置等）能发出类似“哼哧/咕哝”声音的东西。"},"examples":[{"en":"This squeaky toy is a perfect grunt-maker for the dog.","zh":"这个会发声的玩具很适合当狗狗的“哼哧声制造器”。"},{"en":"The costume came with a hidden grunt-maker to sound more “monster-like.”","zh":"这套服装还配了个隐藏的发声器，让声音更像“怪物”。"}]}],"synonyms":["noisemaker","grunter","groaner"],"phonetic":"/ˈɡrʌnt ˌmeɪkɚ/","extraExplanation":["这种带连字符的复合词（如 trouble-maker, decision-maker）很常见；grunt-maker 更像是临时造出来的描述性词，通常出现在口语、网文或轻松语境里，不算固定的标准词条。"],"etymology":"由 grunt（“哼哧声/咕哝声”）+ maker（“制造者/制造器”）构成的复合词。英语里常用这种“X-maker”临时造词来表达“制造X的人/物”，语气多偏口语、幽默。","mnemonic":["把它拆开记：grunt=“哼哧/咕哝”，maker=“制造者/机器”→“制造哼哧声的家伙/东西”。","联想中文：累到爬楼只会“哼哧哼哧”——你就是自己的“grunt-maker”。"]}
{"word":"grunt-makers","summary":{"en":"makers of grunting sounds; or people who do the hard, basic work","zh":"发出哼声的来源；或指做辛苦基础活的一线劳动力"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) Someone or something that makes a low, rough sound (“a grunt”), such as a person, animal, or device.","zh":"（非正式）发出“哼/咕哝”这类低沉粗短声音的人、动物或装置。"},"examples":[{"en":"The old engine was a real grunt-maker when it started in winter.","zh":"那台旧发动机冬天启动时特别“哼哧哼哧”，简直是个“咕噜声制造机”。"},{"en":"In the video, the pig is the main grunt-maker.","zh":"视频里那只猪是主要的“哼哼声来源”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, figurative) People who do basic, tiring, routine work—the “grunts” of an organization.","zh":"（非正式，借喻）做基础、辛苦、重复性工作的普通劳动力；组织里的“苦力/基层干活的人”。"},"examples":[{"en":"The project looked glamorous, but the grunt-makers did most of the real work.","zh":"这个项目看起来很光鲜，但真正干大部分活的是那些基层苦干的人。"},{"en":"Good leaders respect the grunt-makers, not just the stars.","zh":"好领导会尊重一线苦干的人，而不只看那些明星人物。"}]}],"synonyms":["noisemakers","groaners","laborers","workhorses","rank and file"],"phonetic":"/ˈɡrʌnt ˌmeɪkərz/","extraExplanation":["这个词不是非常固定的标准词汇，更像是口语里临时造出来的复合词（creative compound）。具体含义通常靠语境判断：是在讲“声音”，还是在讲“干粗活的人”。","如果语境与军队有关，grunt 有时指“步兵/大头兵”，因此 grunt-makers 可能被用来指“培养/训练大头兵的人或体系”，但这种用法较少见，需结合上下文。"],"etymology":"由复合词构成：grunt（“低沉短促的哼声”，也可指“苦力般的基础劳动/大头兵”）+ maker（“制造者/产生者”）。加复数 -s，并常用连字符表示整体概念。","mnemonic":["把它拆开记：grunt＝“哼一声/哼哧干活”，maker＝“制造者”。合起来就是“制造哼声的/制造苦力活的”。","联想中文：干活累到只能“哼”出来的人＝grunt；这些人就是组织里的 grunt-makers。"]}
{"word":"grunted","summary":{"en":"“Grunted” means made a short low sound or spoke in a rough, unclear way; it’s the past form of “grunt.”","zh":"“grunted”表示发出短促低沉的哼声，或用粗声含糊地说话；是“grunt”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"made a short, low sound (often to show effort, pain, or annoyance); past tense/past participle of “grunt.”","zh":"发出短促、低沉的声音（常表示用力、疼痛或不耐烦）；“grunt”的过去式/过去分词。"},"examples":[{"en":"He lifted the heavy box and grunted with effort.","zh":"他抬起沉重的箱子，用力地哼了一声。"},{"en":"She grunted in annoyance and turned away.","zh":"她不耐烦地哼了一声，转身走开。"},{"en":"The injured player grunted in pain.","zh":"受伤的球员疼得哼了一声。"}]},{"partOfSpeech":"v.","definition":{"en":"said something in a rough, unclear way, with few words (often sounding unfriendly).","zh":"用粗声、含糊而简短的方式说话（常给人不友善的感觉）。"},"examples":[{"en":"“Fine,” he grunted, without looking up.","zh":"“行吧，”他粗声含糊地应了一句，头也没抬。"},{"en":"The guard grunted a warning and pointed to the sign.","zh":"警卫含糊地哼了一句警告，指了指牌子。"}]}],"synonyms":["snorted","groaned","muttered","grumbled"],"phonetic":"/ˈɡrʌn.tɪd/","extraExplanation":["“grunt”常用来描写一种“不是完整说话”的声音：像猪的哼声，也像人用力或不耐烦时发出的低沉短音。写作里用“he grunted”往往暗示这个人不想多说、态度冷淡或情绪烦躁。","搭配很常见：grunt with effort（用力哼声）、grunt in pain/annoyance（疼/烦时哼声）、grunt a reply（哼一声算回答）。"]}
{"word":"grunten","summary":{"en":"“Grunten” is not standard English; it’s usually a misspelling of “grunt,” meaning a short low sound or to make such a sound.","zh":"“grunten”不是标准英语，通常是“grunt”的误拼，意思是（发出）短促低沉的哼声。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or misspelled form of “grunt.” In standard English, use “grunt” (verb/noun).","zh":"“grunt”的非标准拼写或拼写错误。标准英语中应使用“grunt”（动词/名词）。"},"examples":[{"en":"I think you meant “grunt,” not “grunten.”","zh":"我想你想写的是“grunt”，不是“grunten”。"},{"en":"He answered with a grunt instead of words.","zh":"他用一声哼声回应，而不是用语言。"}]},{"partOfSpeech":"v.","definition":{"en":"To make a short, low sound (often showing effort, pain, or disapproval).","zh":"发出短促、低沉的声音（常表示用力、疼痛或不满）。"},"examples":[{"en":"She grunted as she lifted the heavy box.","zh":"她抬起沉重的箱子时哼了一声。"},{"en":"The man grunted in pain when he stood up.","zh":"那人站起来时痛得哼了一声。"}]},{"partOfSpeech":"n.","definition":{"en":"A short, low sound made by a person or an animal (like a pig).","zh":"人或动物（如猪）发出的短促、低沉的声音。"},"examples":[{"en":"The pig gave a loud grunt.","zh":"那头猪发出一声响亮的哼叫。"},{"en":"He replied with a grunt and kept working.","zh":"他哼了一声作为回应，然后继续干活。"}]}],"synonyms":["snort","groan","grumble"],"phonetic":"/ɡrʌnt/","extraExplanation":["“grunten”在英语里不常见，通常是把“grunt”的动词形式误写成了“grunten”。正确用法：grunt / grunted / grunting。","“grunt”也常用来形容说话很少、只用哼声回应的人：例如 “He just grunts.”（他只会哼哼，不怎么说话。）"]}
{"word":"grunter","summary":{"en":"A “grunter” is someone (or an animal) that makes a low grunting sound; informally it can mean a basic manual worker, and in some regions it can name certain fish.","zh":"“grunter”指会发出低沉哼声的人或动物；口语中也可指做基础辛苦体力活的人；在部分地区还可作为某些会发声鱼类的俗称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or animal that makes a low, rough sound (a grunt)","zh":"发出“哼/咕哝”这类低沉粗短声音的人或动物"},"examples":[{"en":"The pig was a constant grunter in the pen.","zh":"猪圈里的那头猪一直在哼哼。"},{"en":"I could hear a grunter behind me in the dark.","zh":"黑暗中我听到身后有人发出低沉的哼声。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) someone who does hard, basic work, especially in a physical job","zh":"（非正式）做辛苦、基础体力活的人；苦力"},"examples":[{"en":"He started as a grunter on the construction site before becoming a supervisor.","zh":"他一开始在工地干最辛苦的活，后来当上了主管。"},{"en":"They treated the new staff like grunters, giving them all the heavy tasks.","zh":"他们把新员工当苦力使唤，把重活都丢给他们。"}]},{"partOfSpeech":"n.","definition":{"en":"a type of fish known for making grunting noises (used in some regional names)","zh":"（部分地区用法）一种会发出“咕噜/哼声”的鱼（俗称中含 grunter）"},"examples":[{"en":"Local fishermen call this species a grunter because it makes noises when handled.","zh":"当地渔民把这种鱼叫 grunter，因为抓起来会发出声音。"}]}],"synonyms":["grunt-maker","snorter","manual worker","laborer"],"phonetic":"/ˈɡrʌn.tɚ/","extraExplanation":["“grunter”来自动词“grunt”（哼哼、咕哝）。日常英语里最常见的是“会哼的人/动物”。","第二个义项（把人称作 grunter）带有口语色彩，有时略显轻视，暗示对方只是做苦活、没什么话语权；使用时注意语气与场合。","在海鲜或地区用语中，grunter 也可指某些会发声的鱼类（例如石首鱼/石鲈类等的俗称之一）；具体指哪种鱼常因地区不同而变化。"]}
{"word":"grunters","summary":{"en":"“Grunters” means those that grunt—people/animals making a low rough sound; informally it can also mean pigs.","zh":"“grunters”指会发出低沉粗哑“哼哧/咕哝”声的人或动物；口语里也可戏称“猪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or animals that make a low, rough sound (“grunt”), often when working hard, annoyed, or in pain.","zh":"发出“咕哝/哼哧”低沉声音的人或动物（常因用力、烦躁或疼痛而发声）。"},"examples":[{"en":"After the long hike, we were all grunters when we climbed the last hill.","zh":"长途徒步后，我们爬最后那段坡时都只能哼哧哼哧地喘着、发出低沉的声音。"},{"en":"The trainer said the grunters in the gym were actually working the hardest.","zh":"教练说，健身房里那些会哼哧出声的人其实练得最狠。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often humorous) Pigs; hogs.","zh":"（非正式，常带幽默）猪；野猪/家猪。"},"examples":[{"en":"The farmer fed the grunters early in the morning.","zh":"农夫一大早就去喂猪了。"},{"en":"You could hear the grunters in the barn from the road.","zh":"在路上都能听到谷仓里猪的哼哧声。"}]}],"synonyms":["grunt-makers","pigs","hogs"],"phonetic":"/ˈɡrʌntər/","extraExplanation":["“grunters”来自动词“grunt”（咕哝、哼哧），把“会发出grunt声音的东西/人”叫作“grunter”。","在口语里用来指“猪”时通常是戏谑说法，语气不正式；对人使用时可能带一点调侃或不礼貌，取决于语境与语气。"]}
{"word":"grunth","summary":{"en":"“Grunth” is most likely a misspelling of “grunt,” meaning a short low sound or the act of making it.","zh":"“grunth”多半是“grunt”的拼写错误，指短促低沉的哼声，或发出这种声音的动作。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Likely a misspelling of “grunt”: to make a short, low sound (often showing effort, pain, or disapproval).","zh":"很可能是“grunt”的拼写错误：发出短促、低沉的声音（常表示用力、疼痛或不满）。"},"examples":[{"en":"He grunted as he lifted the heavy box.","zh":"他抬起重箱子时哼了一声。"},{"en":"She didn’t answer—she just grunted and kept working.","zh":"她没回答，只是哼了一声继续干活。"}]},{"partOfSpeech":"n.","definition":{"en":"A short, low sound made by a person or an animal.","zh":"（人或动物发出的）短促、低沉的声音。"},"examples":[{"en":"I heard a grunt from the next room.","zh":"我听到隔壁房间传来一声低哼。"},{"en":"The pig gave a loud grunt.","zh":"那头猪发出响亮的哼声。"}]}],"synonyms":["groan","snort","mutter"],"phonetic":"/ɡrʌnt/","extraExplanation":["“grunth”在现代英语中不是常见标准拼写。最常见的目标词是“grunt”。如果你是在游戏、昵称、品牌或方言文本里看到“grunth”，它也可能是人为改拼的写法，用来营造更粗犷/更有力量的感觉。","“grunt”常带有语气：不是完整讲话，而是用声音表达情绪或反应；写作里常用于描写人物“懒得说话/不耐烦/很费力”的状态。"]}
{"word":"grunting","summary":{"en":"“Grunting” means making (or the sound of) short, low throat noises, often showing effort or annoyance.","zh":"“grunting”指发出短促低沉的喉音（或这种声音），常表示用力、疼痛或不耐烦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, low sound made in the throat (often showing effort, pain, annoyance, or agreement), like the sound a pig makes","zh":"（短促、低沉的）咕哝声/哼声；常表示用力、疼痛、不耐烦或勉强同意，也常指猪的叫声"},"examples":[{"en":"He answered with a grunt and went back to work.","zh":"他哼了一声算作回答，又继续干活。"},{"en":"I heard grunting from the gym as people lifted heavy weights.","zh":"我听到健身房里有人举重时发出的哼哧声。"}]},{"partOfSpeech":"adj.","definition":{"en":"making short, low throat sounds (often while working hard, lifting, or showing annoyance)","zh":"发出（低沉短促的）哼声/哼哧声的；（常在用力或不耐烦时）咕哝着的"},"examples":[{"en":"The grunting runner pushed through the last mile.","zh":"那个气喘哼哧的跑者咬牙跑完了最后一英里。"},{"en":"A grunting reply isn’t very polite.","zh":"用“哼”来回应并不太礼貌。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of making short, low throat sounds; present participle of “grunt”","zh":"发出哼声/咕哝声的动作；“grunt”的现在分词"},"examples":[{"en":"Stop grunting and use your words.","zh":"别光哼哼，用话说清楚。"},{"en":"He was grunting as he carried the boxes upstairs.","zh":"他把箱子搬上楼时一直哼哧哼哧的。"}]}],"synonyms":["groaning","snorting","huffing","muttering"],"phonetic":"/ˈɡrʌn.tɪŋ/","extraExplanation":["“grunting”既可以当名词（a grunt）、形容词（a grunting reply/runner），也可以当动词形式（be grunting）。在口语里，grunting 常暗示“懒得说话/态度不耐烦”，所以在社交场合描述别人“just grunted”通常带有轻微负面评价。","和其他拟声词的区别：更轻的、表示同意或犹豫的声音常用“hmm”；表示不满的鼻音哼声常用“hmph”；表示用力时的“哼哧/喘”可用“grunt”或“pant”（pant更偏喘气）。"]}
{"word":"gruntingly","summary":{"en":"“Gruntingly” means doing or speaking with a low, short grunt, often showing effort, pain, or annoyance.","zh":"“gruntingly”表示以低沉短促的“哼/咕哝”声来做事或说话，常体现用力、疼痛或不耐烦。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that makes a short, low sound in the throat (a grunt), often showing effort, pain, or annoyance","zh":"以发出“哼/咕哝”这类低沉短促喉音的方式；常表示用力、疼痛或不耐烦"},"examples":[{"en":"He lifted the box gruntingly and set it on the table.","zh":"他哼哼地把箱子抬起来，放到桌上。"},{"en":"She stood up gruntingly, as if her knees hurt.","zh":"她哼了一声站起来，好像膝盖很疼。"},{"en":"“Fine,” he said gruntingly, clearly annoyed.","zh":"“行吧。”他哼哼地说，明显很不耐烦。"}]}],"synonyms":["roughly","gruffly","with a grunt","gutturally"],"phonetic":"/ˈɡrʌn.tɪŋ.li/","extraExplanation":["“gruntingly”来自动词“grunt”（发出低沉短促的喉音）+ 副词后缀“-ly”。它常用来描写动作或说话的语气，带有“粗声、带情绪、费力”的画面感。","它在文学描写里经常用来塑造人物性格：比如显得粗鲁、疲惫、年纪大或身体不适，也可能暗示不愿意多说。写作时可以与“with effort / in pain / in annoyance”等语境搭配更自然。"]}
{"word":"gruntle","summary":{"en":"“Gruntle” is rare: historically it meant “to grumble,” and in modern playful use it can mean “to make satisfied,” as the humorous opposite of “disgruntle.”","zh":"“gruntle”很少见：旧义是“嘟囔抱怨”，现代也常被幽默地用作“使满意”，当作“disgruntle”的反义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare; dialect/old-fashioned) To complain or grumble in a low, muttering way.","zh":"（罕见；方言/旧用法）低声抱怨、嘟囔。"},"examples":[{"en":"He sat by the door and gruntled about the cold weather.","zh":"他坐在门边，嘟囔着抱怨天气太冷。"},{"en":"Don’t just gruntle—tell me what’s wrong.","zh":"别只会嘟囔抱怨——告诉我到底怎么了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Humorous; modern) To make someone feel pleased or satisfied (a playful opposite of “disgruntle”).","zh":"（幽默；现代用法）使人满意、使人高兴（把“disgruntle”当作反义来玩笑式地造出的动词）。"},"examples":[{"en":"A warm thank-you note really gruntled the team.","zh":"一封温暖的感谢便条让团队很满意。"},{"en":"The refund policy will gruntle many customers.","zh":"退款政策会让很多顾客感到满意。"}]}],"synonyms":["grumble","complain","mutter","please","satisfy","delight"],"phonetic":"/ˈɡrʌn.təl/","extraExplanation":["“gruntle”最常见的出现方式其实是在“disgruntle（使不满）”的影子里：很多人以为dis-是否定前缀，于是幽默地把“gruntle”当作“使满意”的动词使用。这种现象叫“逆构词/回造词”（back-formation），类似把“editor”误解成“edit+or”而产生动词“edit”的感觉。","如果你在正式写作中想表达“使满意/使高兴”，更常用的是“please, satisfy, delight”。“gruntle=嘟囔抱怨”的旧义在现代英语里很少见。"]}
{"word":"gruntled","summary":{"en":"“Gruntled” means satisfied or pleased, usually used humorously as the opposite of “disgruntled.”","zh":"“Gruntled”表示“满意的、满足的”，多作幽默用法，常被当作“disgruntled（不满的）”的反义词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Satisfied, content, or pleased (often used humorously, and much less common than “disgruntled”).","zh":"满意的；心满意足的（多带幽默语气，用得远不如“disgruntled”常见）。"},"examples":[{"en":"After the meeting, everyone seemed gruntled with the decision.","zh":"会议结束后，大家看起来都对这个决定很满意。"},{"en":"He left the restaurant gruntled—full and happy.","zh":"他离开餐厅时很满足——吃饱了也很开心。"},{"en":"The team was surprisingly gruntled despite the tight deadline.","zh":"尽管截止时间很紧，团队却出奇地满意。"}]}],"synonyms":["content","satisfied","pleased","happy"],"phonetic":"/ˈɡrʌn.t̬əld/","extraExplanation":["“Gruntled”在现代英语里多被当作对“disgruntled（不满的）”的幽默“逆推词”（back-formation）：既然有disgruntled，就开玩笑造出gruntled来表示“满意”。因此它常见于轻松语境、媒体或口语玩笑中，正式写作更常用content / satisfied / pleased。","历史上“gruntle”曾与“抱怨、嘟囔”相关，但现代读者通常不会按这个历史来源理解，而是直接把gruntled当作“disgruntled的反义词”来用。"]}
{"word":"gruntles","summary":{"en":"“Gruntles” is a rare verb form meaning “complains/grumbles,” and it’s also used humorously to mean “is satisfied.”","zh":"“gruntles”是罕见动词形式，常表示“抱怨/嘟囔”，也可作幽默用法表示“感到满意”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare) to complain or grumble; “gruntles” is the third-person singular present form (he/she/it gruntles).","zh":"（罕见）抱怨，咕哝；“gruntles”是第三人称单数现在时（he/she/it gruntles）。"},"examples":[{"en":"He gruntles about the traffic every morning.","zh":"他每天早上都会抱怨交通。"},{"en":"She gruntles whenever the meeting runs late.","zh":"只要会议拖延，她就会嘟囔抱怨。"}]},{"partOfSpeech":"vi.","definition":{"en":"(humorous, very rare) to be satisfied or content (often used as a playful opposite of “disgruntled”).","zh":"（幽默用法，极罕见）感到满足、心情不错（常作为“disgruntled 不满的”的玩笑式反义）。"},"examples":[{"en":"After the raise, he finally gruntles at work.","zh":"加薪之后，他终于在工作中变得“心满意足”。"},{"en":"I’m pleased to report the team is gruntled today.","zh":"我很高兴地报告：团队今天很“满意”。"}]}],"synonyms":["grumbles","complains","moans","murmurs","(humorous) is content","(humorous) is satisfied"],"phonetic":"/ˈɡrʌn.təlz/","extraExplanation":["“gruntle”本身在现代英语里非常少见；多数人只熟悉“disgruntled（不满的）”。因此把“gruntled/ gruntles”当作“满意的/感到满意”常带有玩笑或文字游戏的味道。","在正式写作中，建议用更常见的词：complain / grumble（抱怨），或 content / satisfied / pleased（满意）。"]}
{"word":"gruntling","summary":{"en":"“Gruntling” is a rare noun meaning a small pig (piglet), and sometimes an insulting word for a crude or insignificant person.","zh":"“gruntling”是个少见名词，常指“小猪（猪崽）”，也可作贬义词指“粗鲁或无足轻重的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pig; a piglet","zh":"小猪；猪崽"},"examples":[{"en":"The farmer showed the children a gruntling sleeping beside its mother.","zh":"农夫给孩子们看了一只靠着母猪睡觉的小猪崽。"},{"en":"In the story, a lost gruntling wanders away from the pen.","zh":"在故事里，一只走失的小猪崽从猪圈里溜了出去。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, derogatory) a person seen as crude, rude, or insignificant—someone who “grunts” instead of speaking politely","zh":"（非正式，贬义）粗鲁、没教养或无足轻重的人；只会“哼哼”不礼貌说话的人"},"examples":[{"en":"He dismissed the hecklers as a bunch of gruntlings who didn’t listen.","zh":"他把那些起哄的人打发成一群不听人话的粗鲁家伙。"},{"en":"Don’t be a gruntling—use your words and explain what you need.","zh":"别当个只会哼哼的人——好好用语言说明你需要什么。"}]}],"synonyms":["piglet","shoat","underling (figurative)"],"phonetic":"/ˈɡrʌntlɪŋ/","extraExplanation":["“gruntling”非常少见，更多见的是“piglet（小猪）”。在文学或带点戏谑的语境里，作者可能用它来加强“咕噜叫（grunt）”这种声音的画面感。","词尾“-ling”常带有“小的 / 年幼的 / 带点轻蔑或戏谑”的意味（如 duckling 小鸭、underling 小喽啰）。因此“gruntling”字面上就是“会哼哼叫的小东西”。"]}
{"word":"grunts","summary":{"en":"“Grunts” are short, rough sounds (plural), or the verb form meaning “makes that sound.”","zh":"“grunts”可指（复数）短促粗哑的哼声/咕哝声，也可作动词表示“发出这种声音”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun) short, low, rough sounds, often made when someone is annoyed, in pain, or using physical effort; also the similar sound made by some animals (especially pigs).","zh":"（复数名词）咕哝声/哼声：短促、低沉、粗哑的声音，常表示不耐烦、疼痛或用力时发出；也指某些动物（尤其是猪）发出的类似声音。"},"examples":[{"en":"All I got was a few grunts when I asked him a question.","zh":"我问他问题时，他只哼了几声。"},{"en":"The weightlifter let out a couple of grunts and lifted the bar.","zh":"举重运动员哼了几声，把杠铃举起来了。"},{"en":"We heard grunts coming from the pigpen.","zh":"我们听到猪圈里传来哼哼声。"}]},{"partOfSpeech":"v.","definition":{"en":"(Verb, third-person singular) makes a short, low, rough sound, often to show effort, annoyance, or pain.","zh":"（动词第三人称单数）发出短促、低沉、粗哑的声音，常用来表示用力、不耐烦或疼痛。"},"examples":[{"en":"He grunts when he stands up because his back hurts.","zh":"他站起来时会哼一声，因为背疼。"},{"en":"She grunts an answer without looking up.","zh":"她头也不抬地哼了一声算作回答。"}]}],"synonyms":["snorts","groans","grumbles","murmurs"],"phonetic":"/ɡrʌnts/","extraExplanation":["在口语里，\"a grunt\" 常带有“懒得说话、态度冷淡”的感觉，比如 \"He replied with a grunt\"（他哼了一声算作回答）。","写作时可以用 \"grunt\" 来表现人物的情绪或动作的“粗粝感”，比单纯的 \"say\" 更有画面感。"]}
{"word":"grunzie","summary":{"en":"A Scots word meaning “snout/face (nose and mouth),” often used humorously or rudely.","zh":"苏格兰方言词，指“口鼻/嘴脸”，常带调侃或略粗鲁语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots) A snout; the nose and mouth area of a person or animal (often used humorously or a bit rudely, like “mug” or “kisser”).","zh":"（苏格兰英语）口鼻部；鼻口（常带调侃或略粗鲁语气，类似“脸/嘴/鼻子”）。"},"examples":[{"en":"He fell on his grunzie and scraped his nose.","zh":"他摔了个嘴啃地，把鼻子擦破了。"},{"en":"Wipe your grunzie—there’s sauce on your face.","zh":"把你嘴脸擦一擦——脸上沾了酱。"}]}],"synonyms":["snout","nose","muzzle","face","mug","kisser"],"phonetic":"/ˈɡrʌnzi/","extraExplanation":["“grunzie”主要见于苏格兰方言（Scots），在日常口语里常带一点戏谑、嫌弃或亲昵的吐槽语气。放到正式写作中不太常见。","有时会特指动物的“口鼻”（比如猪的鼻子），也可以指人的“脸/嘴巴”这一块。使用时注意语境与礼貌程度。"]}
{"word":"gruppetto","summary":{"en":"Grupetto most commonly means a dropped group of cyclists behind the peloton; it can also mean a musical ornament called a “turn.”","zh":"gruppetto 常指公路自行车中落后于主集团的“掉队小集团”；在音乐中也可指装饰音“回旋音（turn）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In road cycling, a group of riders who have fallen behind the main pack (the peloton), often working together to finish within the time limit.","zh":"（公路自行车）“落后小集团/追尾集团”：从主集团（大集团 peloton）掉队的一群车手，常常合作骑行以赶在关门时间内完赛。"},"examples":[{"en":"He got dropped on the climb and spent the rest of the stage in the gruppetto.","zh":"他在爬坡时掉队，赛段后半程一直待在落后小集团里。"},{"en":"The gruppetto worked together on the flats to make the time cut.","zh":"落后小集团在平路上轮流带骑，努力赶在关门时间内通过。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, an ornament (also called a “turn”) that quickly moves from the main note to the note above, back to the main note, to the note below, and back again (often indicated by a small symbol).","zh":"（音乐）装饰音“回旋音/回音”（turn）：围绕主音快速上、回、下、回的一种装饰（常用小符号标记）。"},"examples":[{"en":"The melody includes a gruppetto that adds a light, decorative feel.","zh":"旋律里有一个回旋音，让听感更轻巧华丽。"},{"en":"She played the gruppetto cleanly without rushing the rhythm.","zh":"她把回旋音弹得很干净，而且没有把节奏弹快。"}]}],"synonyms":["dropped group","the autobus","turn (music)"],"phonetic":"/ɡruˈpɛtoʊ/","extraExplanation":["gruppetto 是意大利语“gruppo（小组）”的指小形式，字面就是“小团体”。自行车语境里多见于环法等大环赛：爬坡被甩下去的车手会在后方形成“互助小火车”，目标往往不是争冠，而是“过关/保住时间”。","音乐里的 gruppetto 常译为“回旋音”，英文里更常见的叫法是 turn。不同乐派与时期对演奏方式（从主音开始还是从上方音开始、是否有时值变化等）可能略有差别，最好参考乐谱标记与演奏传统。"]}
{"word":"gruppo","summary":{"en":"“Gruppo” is an Italian word meaning “group,” and it can also mean a band.","zh":"“gruppo”是意大利语，意思是“团体/小组”，也可指“乐队”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) a group; a set of people or things considered together.","zh":"（意大利语）“一组 / 一群 / 团体”；把人或事物看作整体的集合。"},"examples":[{"en":"In Italian, “gruppo” means “group.”","zh":"在意大利语里，“gruppo”就是“group（团体/小组）”的意思。"},{"en":"The tour guide spoke to the gruppo before the museum visit.","zh":"参观博物馆前，导游先对这群人（gruppo）讲了几句。"}]},{"partOfSpeech":"n.","definition":{"en":"(Italian) a musical group or band.","zh":"（意大利语）乐队；音乐团体。"},"examples":[{"en":"My favorite gruppo is playing in Rome tonight.","zh":"我最喜欢的乐队（gruppo）今晚在罗马演出。"}]}],"synonyms":["group","team","cluster","band"],"phonetic":"/ˈɡruːpoʊ/","extraExplanation":["“Gruppo”是意大利语名词，来源与英语“group”同源（都和“集合、成群”这一概念有关）。在意大利语里它既可指人群/小组，也常指“乐队”。如果你是在英语语境中看到“gruppo”，通常表示在借用意大利语（比如旅行、餐厅、艺术或音乐相关场景）。"]}
{"word":"Grus","summary":{"en":"a Latin-based name used for cranes in taxonomy and for the constellation “the Crane.”","zh":"源自拉丁语的名称，用于（旧/部分）鹤类分类的属名以及天鹤座的星座名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name used in older classifications for cranes; now mostly treated as part of the crane family (with some species still placed in the genus Grus in certain systems).","zh":"（旧分类中）鹤属的属名；在现代分类里多被调整/拆分，但在某些体系中仍可见到把部分鹤类归入“Grus”。"},"examples":[{"en":"In older field guides, the Sandhill Crane is listed as Grus canadensis.","zh":"在较老的野外指南中，沙丘鹤常被列为 Grus canadensis。"},{"en":"Some sources still use Grus for certain crane species, while others split them into different genera.","zh":"有些资料仍用 Grus 来归类部分鹤类，而另一些则把它们拆分到不同属。"}]},{"partOfSpeech":"n.","definition":{"en":"the Latin name of the constellation “Grus,” meaning “the Crane.”","zh":"天文学中“天鹤座”的拉丁名，字面意思是“鹤”。"},"examples":[{"en":"Grus is a southern constellation introduced in early modern star maps.","zh":"Grus（天鹤座）是早期近代星图中引入的南天星座。"},{"en":"From the Southern Hemisphere, you can spot Grus near Piscis Austrinus.","zh":"在南半球，你可以在南鱼座附近找到天鹤座（Grus）。"}]}],"synonyms":["crane","Grus (constellation)","crane constellation"],"phonetic":"ɡrʌs","extraExplanation":["大小写很关键：Grus（首字母大写）常见于拉丁学名或星座名；grus（小写）在英语里较少单独当普通词使用。","生物分类会随研究更新：你可能会在不同书籍/数据库中看到同一种鹤被归到不同属，这是分类学调整造成的。"],"etymology":"源自拉丁语 grūs（“鹤”）。在生物学中被用作属名；在天文学中被用作星座拉丁名。","mnemonic":["把 Grus 记成“鹤”的拉丁名：看到字母 G + rus，可联想“G（鹤的属名/星座名）”。","联想中文“鹤（hè）”常与星空意象相关：Grus 既是鹤的属名，也是一片“鹤”的星座。"]}
{"word":"grus","summary":{"en":"Grus is used mainly as (1) a Latin genus name for cranes (older taxonomy) and (2) a geology term for coarse sand/gravel from weathered granite.","zh":"Grus 主要有两种用法：（1）鹤的拉丁属名（多见于旧分类）；（2）地质术语，指花岗岩风化形成的粗砂/砾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A Latin scientific name used for a group (genus) of cranes; often seen in older classifications (some species are now placed in other genera).","zh":"（生物）拉丁学名，用于“鹤”的一个属名（Grus）；常见于较早的分类体系中（部分物种后来被划入其他属）。"},"examples":[{"en":"In older field guides, the Common Crane is listed as Grus grus.","zh":"在较早的野外图鉴里，灰鹤常被标为 Grus grus。"},{"en":"The paper discusses species formerly classified under Grus.","zh":"这篇论文讨论了曾被归入 Grus 属的物种。"}]},{"partOfSpeech":"n.","definition":{"en":"(Geology) Coarse, gritty sand or gravel formed by the weathering of granite.","zh":"（地质）花岗岩风化后形成的粗砂或砾质砂（颗粒粗、手感砂砾状）。"},"examples":[{"en":"The slope is covered with grus that breaks down from the granite outcrop.","zh":"山坡上覆盖着由花岗岩露头风化分解形成的 grus（粗砂）。"},{"en":"Grus drains quickly, so plants may need more frequent watering.","zh":"grus 排水很快，因此植物可能需要更频繁浇水。"}]}],"synonyms":["crane (in taxonomy context)","granite sand","granitic grit","gravel (general)"],"phonetic":"/ɡrʌs/","extraExplanation":["“Grus”来自拉丁语，意为“鹤”。在现代分类中，许多“鹤”仍属于鹤科（Gruidae），但属的划分有调整，所以你可能会在旧资料与新资料里看到不同的学名组合。","地质学里的 grus 指花岗岩在风化过程中“碎解”成的粗颗粒砂/砾（常见于花岗岩山区的坡面或冲沟），园艺与土壤学里也会提到它的排水性强、保水性差。"]}
{"word":"grush","summary":{"en":"Grush is a dialect word meaning gravel/rubble, and it can also mean crushed ore or the action ‘to crush.’","zh":"Grush 是一个方言词，常指碎石/瓦砾；也可指碎矿渣，或作动词表示“压碎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, especially Scots/Northern English) loose stones, gravel, or rubble; small broken pieces of rock.","zh":"（方言，尤指苏格兰/英格兰北部）碎石、砂砾、瓦砾；小块的碎岩。"},"examples":[{"en":"The path was covered with grush after the storm.","zh":"暴风雨过后，小路上铺满了碎石。"},{"en":"His boots crunched on the grush near the quarry.","zh":"他在采石场附近的碎石上走路，靴子发出咯吱声。"}]},{"partOfSpeech":"n.","definition":{"en":"(mining) broken ore or coal; stony waste produced by digging or crushing.","zh":"（采矿）碎矿石或碎煤；开采或碾碎后产生的石质废料。"},"examples":[{"en":"Workers cleared the grush from the tunnel entrance.","zh":"工人把隧道口的碎矿渣清理掉。"}]},{"partOfSpeech":"vt.","definition":{"en":"(dialect) to crush, bruise, or grind into small pieces.","zh":"（方言）压碎；捣烂；磨碎成小块。"},"examples":[{"en":"Don’t grush the berries too much, or the juice will turn bitter.","zh":"别把浆果捣得太碎，不然汁水会发苦。"}]}],"synonyms":["gravel","rubble","stone chips","crush"],"phonetic":"/ɡrʌʃ/","extraExplanation":["“grush”在现代标准英语里很少见，多见于苏格兰及英格兰北部方言，常用于描述“碎石/瓦砾”这种脚下踩起来会“嘎吱作响”的材料。","它在意义上与更常见的“crush（压碎）”相近；在阅读地方文学、矿业记录或方言对话时可能遇到。"]}
{"word":"grushie","summary":{"en":"“Grushie” isn’t standard English; it’s probably a misspelling (often of “slushie”) or a name/username.","zh":"“grushie”不是标准英语；多半是拼写错误（常见为“slushie”）或人名/昵称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name/username.","zh":"不是标准英语单词。更可能是拼写错误，或是人名/昵称/用户名。"},"examples":[{"en":"I couldn’t find “grushie” in a dictionary—did you mean “slushie”?","zh":"我在词典里找不到“grushie”——你是不是想写“slushie”？"},{"en":"“Grushie” might be a username or a brand name in your context.","zh":"在你的语境里，“Grushie”可能是用户名或品牌名。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) slushie: a drink made of flavored crushed ice; also spelled “slushie/slushy.”","zh":"（可能你想表达）slushie：用碎冰加调味糖浆做的冰沙饮料；也常拼作“slushie/slushy”。"},"examples":[{"en":"Let’s get a cherry slushie after school.","zh":"放学后我们去买杯樱桃味冰沙吧。"},{"en":"The gas station sells slushies in summer.","zh":"夏天加油站会卖冰沙。"}]}],"synonyms":["slushie","slushy"],"phonetic":"/ˈslʌʃi/","extraExplanation":["“grushie”本身在常见英语语料和主流词典中几乎不出现；如果你是在社交媒体/游戏里看到的，很可能是昵称、品牌、或把“slushie / slushy”拼错了。","如果你能提供一句原文（看到它的句子/对话截图），我可以更准确判断它的意思。"]}
{"word":"grusian","summary":{"en":"“Grusian” is a rare word meaning “Georgian,” connected to the older name “Grusia” for the country of Georgia.","zh":"“Grusian”较少见，意思接近“Georgian（格鲁吉亚的）”，与格鲁吉亚的旧称“Grusia”有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Georgia (the country in the Caucasus region); often used in older or Russia-influenced contexts from the name “Grusia.”","zh":"与格鲁吉亚（高加索地区的国家）有关的；常见于较旧或受俄语影响的语境，源自“Grusia（格鲁吉亚的旧称/俄语称呼）”。"},"examples":[{"en":"Some older books use “Grusian” to refer to Georgian culture.","zh":"一些较旧的书会用“Grusian”来指格鲁吉亚文化。"},{"en":"The museum displayed Grusian (Georgian) textiles from the 1800s.","zh":"博物馆展出了19世纪的格鲁吉亚（Grusian/Georgian）纺织品。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Georgia (the country); a Georgian (rare).","zh":"格鲁吉亚人（较少见用法）。"},"examples":[{"en":"In that novel, the traveler meets a Grusian who guides him through the mountains.","zh":"在那部小说里，旅行者遇到一位格鲁吉亚人，带他穿越群山。"}]}],"synonyms":["Georgian"],"phonetic":"/ˈɡruːʒən/","extraExplanation":["“Grusian”在现代英语里非常少见，更常用的是“Georgian”。使用时要注意歧义：英语里的“Georgian”也可能指英国乔治王时代（Georgian era）或美国乔治亚州（Georgia）的相关事物，具体要看上下文。","“Grusian/Grusia”与俄语传统称呼有关；如今在国际场合通常建议用“Georgia / Georgian”，更标准也更礼貌。"]}
{"word":"grusinian","summary":{"en":"Grusinian means “Georgian,” relating to or from the country of Georgia (formerly called Grusinia in some contexts).","zh":"Grusinian意为“格鲁吉亚的/格鲁吉亚人”，其中Grusinia是格鲁吉亚（国家）的旧称之一。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Grusinia (an older name for the country of Georgia in the Caucasus); Georgian.","zh":"与“Grusinia”（格鲁吉亚这一旧称，指高加索地区的国家“格鲁吉亚”）有关的；格鲁吉亚的。"},"examples":[{"en":"Grusinian literature is often discussed alongside Russian and Armenian traditions of the Caucasus.","zh":"谈到高加索地区时，人们常把格鲁吉亚（Grusinian）文学与俄罗斯和亚美尼亚传统放在一起讨论。"},{"en":"The museum has a small collection of Grusinian folk music recordings.","zh":"这家博物馆收藏了一小批格鲁吉亚（Grusinian）民间音乐录音。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Grusinia (Georgia); a Georgian person.","zh":"格鲁吉亚（Grusinia/Georgia）人；格鲁吉亚人。"},"examples":[{"en":"Many Grusinians speak Georgian as their first language.","zh":"许多格鲁吉亚人（Grusinians）的第一语言是格鲁吉亚语。"}]}],"synonyms":["Georgian"],"phonetic":"/ɡruːˈzɪniən/","extraExplanation":["“Grusinian”在现代英语中非常少见，更多见于旧式地名或历史/苏联时期语境；现在更常用的是“Georgian”。","注意不要与美国的“Georgia（乔治亚州）”混淆：这里的“Grusinia/Georgia”指的是高加索地区的国家“格鲁吉亚”。"]}
{"word":"gruss","summary":{"en":"“Gruss” is a German-derived word meaning “greeting” or “regards,” often seen in German messages as a sign-off.","zh":"“Gruss”源自德语，意思是“问候/致意”，常见于德语信息或邮件结尾的署名前。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from German) a greeting; regards (often used in writing, similar to “best regards”).","zh":"（源自德语）问候；致意/敬意（常用于书信结尾，类似“此致敬礼/顺颂时祺/致以问候”）。"},"examples":[{"en":"He ended the postcard with “Viele Grüsse” (“many greetings”).","zh":"他在明信片结尾写了“Viele Grüsse”（“致以许多问候”）。"},{"en":"In German emails, you may see “Gruss” or “Gruß” before the person’s name.","zh":"在德语邮件里，你可能会在署名前看到“Gruss”或“Gruß”。"}]}],"synonyms":["greetings","regards","best regards"],"phonetic":"/ɡrʊs/","extraExplanation":["“Gruss”更常见的德语规范拼写是“Gruß”（带“ß”）。在不方便使用“ß”的场合（如某些键盘、旧系统或全部大写），常写作“Gruss”。","读音和拼写会因地区/系统而变化；在英语里它多作为外来词出现，用来保留德语风格。","相关常见表达：\n- “Viele Grüße / Viele Gruesse”= “Many regards / Best regards”（常见邮件结尾）\n- “Mit freundlichen Grüßen”= “Yours sincerely / Kind regards”（更正式）\n- “Grüß Gott”= 德语区（尤其巴伐利亚、奥地利）常见问候语，直译“愿上帝问候你”，相当于“你好”。"]}
{"word":"grutch","summary":{"en":"“Grutch” (dialect) means to complain/grumble, or to begrudge; it can also mean a complaint or resentment.","zh":"“grutch”（方言）可指抱怨/嘟囔，也可指计较、不情愿给；作名词可指抱怨或怨气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to complain or grumble (often about something small), especially in Scottish or Northern English usage","zh":"（尤见于苏格兰或英格兰北部方言）抱怨、嘟囔（常指小事）"},"examples":[{"en":"He always grutches about the weather, even when it’s sunny.","zh":"即使天气晴朗，他也总爱抱怨天气。"},{"en":"Don’t grutch—tell me what you need and we’ll fix it.","zh":"别嘟囔了——告诉我你需要什么，我们一起解决。"}]},{"partOfSpeech":"v.","definition":{"en":"to resent or begrudge; to be unwilling to give or share something","zh":"怨恨；吝于给予或分享（不情愿给）"},"examples":[{"en":"She doesn’t grutch the time it takes to help a friend.","zh":"她并不计较花时间去帮助朋友。"},{"en":"He grutched every penny he had to spend.","zh":"他对花出去的每一分钱都很计较。"}]},{"partOfSpeech":"n.","definition":{"en":"a complaint or a grumble; a resentful feeling","zh":"抱怨；嘟囔；不满/怨气"},"examples":[{"en":"I’ve no grutch with you—I just misunderstood.","zh":"我对你没有怨气——只是我误会了。"}]}],"synonyms":["grumble","complain","begrudge","grudge","moan"],"phonetic":"/ɡrʌtʃ/","extraExplanation":["“grutch”多见于苏格兰英语（Scots）及英格兰北部方言，日常标准美式英语里不常用。在更通用的英语中，常用“grumble / complain / begrudge / grudge”来表达相近意思。","它在意义上与“grudge（怨恨、计较）”很接近，也可带有“爱抱怨、爱嘀咕”的语气，具体含义常依上下文判断。"]}
{"word":"grutched","summary":{"en":"“Grutched” is a dialect past tense meaning “complained/grumbled” or “begrudged.”","zh":"“grutched”多为方言用法，作过去式，常指“抱怨/嘟囔”或“不情愿给、心里不服气”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense of dialect verb “grutch”: to complain or grumble (often in Scots or Northern English).","zh":"方言动词“grutch”的过去式：抱怨、嘟囔（常见于苏格兰或英格兰北部方言）。"},"examples":[{"en":"He grutched about the weather all morning.","zh":"他一整个早上都在抱怨天气。"},{"en":"Don’t grutch—just tell me what you need.","zh":"别嘟囔了，直接告诉我你需要什么。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense of dialect verb “grutch”: to begrudge someone something; to feel resentful about giving or sharing.","zh":"方言动词“grutch”的过去式：吝于给人、觉得“凭什么要给/要分”，心里不情愿。"},"examples":[{"en":"She grutched every penny she had to spend.","zh":"她对花出去的每一分钱都很不情愿。"},{"en":"He grutched them the praise they deserved.","zh":"他不太情愿地给了他们应得的称赞。"}]}],"synonyms":["grumbled","complained","moaned","begrudged","resented"],"phonetic":"/ɡrʌtʃt/","extraExplanation":["“grutched”不是最常见的标准英语拼写；它多见于方言/地域英语写作中。更通用的表达通常用“complained / grumbled”（抱怨）或“begrudged”（不情愿给、嫉妒/不服气）。","如果你是在阅读文学作品、苏格兰口音对白、或地方性故事时遇到“grutched”，通常是在营造人物的地域身份与口语感。"]}
{"word":"grutches","summary":{"en":"“Crutches” means walking supports (plural of crutch), and it can also mean something you rely on too much.","zh":"“crutches”指（crutch 的复数）拐杖，也可比喻过度依赖的支撑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of crutch: devices (usually sticks with supports) used to help someone walk after an injury.","zh":"crutch 的复数：拐杖（通常带支撑的手杖），用于在受伤后帮助行走。"},"examples":[{"en":"After the surgery, she walked with crutches for six weeks.","zh":"手术后，她拄拐走了六周。"},{"en":"He leaned his crutches against the wall.","zh":"他把拐杖靠在墙边。"}]},{"partOfSpeech":"v.","definition":{"en":"Supports or helps someone move forward (less common; from the verb “to crutch”).","zh":"支撑或帮助某人前进（较少见；来自动词 to crutch）。"},"examples":[{"en":"The injured player was crutched off the field by staff.","zh":"受伤的球员在工作人员搀扶下拄拐离开了球场。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, things someone depends on too much (emotional or practical support).","zh":"（比喻）过度依赖的“拐杖”（情感或现实中的支撑）。"},"examples":[{"en":"Some people use alcohol as a crutch when they feel stressed.","zh":"有些人压力大时会把酒精当作“拐杖”。"},{"en":"Try not to rely on subtitles as a crutch while learning English.","zh":"学英语时尽量别把字幕当作“拐杖”来过度依赖。"}]}],"synonyms":["walking sticks","supports","aid","prop"],"phonetic":"/ˈkrʌtʃɪz/","extraExplanation":["“grutches”不是常见英文拼写；你可能想写的是“crutches”。英语里 /kr/ 这个开头组合（如 crutch, crash, cross）对学习者来说容易被误写成 g- 或加多余字母。","“crutches”常用作复数，因为人受伤时经常需要“两根拐”。如果只指一根，用“a crutch”。比喻用法里也常见：a crutch（依赖、替代真正能力的东西）。"]}
{"word":"grutching","summary":{"en":"“Grutching” is a dialect word meaning grumbling/complaining, or giving something unwillingly (begrudging).","zh":"“grutching”是方言用法，常指嘟囔抱怨，或不情愿地给出（勉强、心不甘情不愿）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scotland, Northern England; informal) complaining in an irritated way; grumbling.","zh":"（苏格兰、英格兰北部；非正式）抱怨、嘟囔，带着不满地埋怨。"},"examples":[{"en":"He sat there grutching about the weather all morning.","zh":"他一早就坐在那儿一直抱怨天气。"},{"en":"Stop grutching and tell me what you actually need.","zh":"别再抱怨了，直接告诉我你到底需要什么。"}]},{"partOfSpeech":"v.","definition":{"en":"(Scotland, Northern England; informal) unwillingly giving something, or feeling resentful about having to give it; begrudging.","zh":"（苏格兰、英格兰北部；非正式）不情不愿地给出（东西），或对不得不给出而心生不满；吝于给、勉强给。"},"examples":[{"en":"She was grutching every penny she spent.","zh":"她花每一分钱都很不情愿、心疼。"},{"en":"He helped, but in a grutching way.","zh":"他是帮了忙，但态度很勉强、带着不满。"}]}],"synonyms":["grumbling","complaining","grousing","begrudging","resentful"],"phonetic":"/ˈɡrʌtʃɪŋ/","extraExplanation":["“grutching”来自方言动词“grutch”。在标准英语里更常见的说法是：\n- “grumbling/complaining”（抱怨）\n- “begrudging (something)”（不情愿地给/心不甘情不愿）\n另外，拼写上也常被误写/误读成“grudging”（勉强的、不情愿的）或“clutching”（紧抓的）。如果你是在某段文字里看到它，告诉我上下文一句话，我可以帮你判断具体是哪一种意思。"]}
{"word":"grutten","summary":{"en":"Grutten means coarse ground grain (groats), often used to make porridge; it’s a rare/older word in English.","zh":"Grutten 指粗磨的谷物（类似 groats），常用来煮粥；在现代英语中较少见、偏旧用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"coarse ground grain (especially oats) used for porridge; groats. (Rare/older usage.)","zh":"粗磨的谷物（尤指燕麦）常用来煮粥；燕麦碎粒。（较少见/较旧用法）"},"examples":[{"en":"In some older recipes, you’ll see grutten listed as the base for porridge.","zh":"在一些较老的食谱里，你会看到 grutten 被写作煮粥的主要原料。"},{"en":"They cooked grutten slowly with milk and a little salt.","zh":"他们把 grutten 加牛奶和一点盐慢慢熬煮。"}]}],"synonyms":["groats","oatmeal","coarse meal"],"phonetic":"ˈɡrʌtən","extraExplanation":["“grutten”在现代英语里非常少见，更常见的是“groats”（燕麦/小麦等的粗粒）或“oatmeal”（燕麦片/燕麦粥原料）。在阅读旧食谱、方言材料或与北欧/荷兰语境相关的文本时可能会遇到。"]}
{"word":"gruyere","summary":{"en":"Gruyère is a Swiss cheese known for a nutty flavor and excellent melting quality.","zh":"Gruyère 是一种瑞士奶酪，以坚果香和良好的融化性而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Gruyère: a firm, slightly salty Swiss cheese with a nutty flavor, often used for melting in dishes like fondue, gratins, and French onion soup.","zh":"格吕耶奶酪：一种瑞士硬质奶酪，略带咸味、坚果香，常用于融化烹饪，如奶酪火锅、焗烤和法式洋葱汤。"},"examples":[{"en":"French onion soup is traditionally topped with bread and melted Gruyère.","zh":"法式洋葱汤传统上会在面包上铺一层融化的格吕耶奶酪。"},{"en":"I bought Gruyère to make a creamy gratin.","zh":"我买了格吕耶奶酪来做奶油焗烤。"}]}],"synonyms":["Swiss cheese","Comté (similar)","Emmental (similar)"],"phonetic":"/ɡruːˈjɛr/","extraExplanation":["“Gruyère”来自瑞士弗里堡州的小镇/地区“Gruyères”，读写时常见重音符号：Gruyère。","在欧洲，名称“Gruyère”有产地与制作规范的保护；在不同国家/地区，市场上“Gruyère”可能风味与熟成程度略有差异。","烹饪搭配上，它以“融化性好、拉丝顺滑”著称；如果买不到，常见替代有Emmental（埃曼塔尔）、Comté（孔泰）等，风味会略不同。"]}
{"word":"gruyeres","summary":{"en":"Gruyère is a Swiss cheese known for its nutty flavor and excellent melting quality.","zh":"Gruyère（格吕耶尔奶酪）是一种瑞士奶酪，以坚果香风味和良好的融化性著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a firm, pale-yellow Swiss cheese with a nutty, slightly sweet flavor that melts smoothly (often used in fondue, French onion soup, and gratins).","zh":"格吕耶尔奶酪（瑞士硬质淡黄色奶酪），带有坚果香与微甜风味，融化性很好（常用于奶酪火锅、法式洋葱汤、焗烤等）。"},"examples":[{"en":"I bought some Gruyère for French onion soup.","zh":"我买了些格吕耶尔奶酪来做法式洋葱汤。"},{"en":"Gruyère melts well, so it’s great for grilled cheese sandwiches.","zh":"格吕耶尔奶酪很容易融化，所以很适合做芝士烤三明治。"},{"en":"The recipe calls for Gruyère, but you can also use Emmental in a pinch.","zh":"这道菜需要用格吕耶尔奶酪，但临时找不到的话也可以用埃门塔尔奶酪代替。"}]}],"synonyms":["Swiss cheese","Emmental (similar, not the same)"],"phonetic":"/ɡruˈjɛr/","extraExplanation":["“Gruyère”来自瑞士弗里堡州的格吕耶尔（Gruyères）地区名称。在欧洲，正宗“Gruyère”通常受原产地保护（PDO/AOP），不同产区与熟成时间会影响风味（更久熟成会更浓郁、带更明显坚果香）。","拼写提示：英语里常写作“Gruyère”（带变音符），但也常见简写“Gruyere”。你输入的“gruyeres”多半是指复数（几块/几种格吕耶尔奶酪），或把地名/奶酪名写成复数形式。"]}
{"word":"gruys","summary":{"en":"“gruys” is not a standard modern English word; it is likely a misspelling or a name/handle (often intended as “Gruyère” or “grues”).","zh":"“gruys”不是现代英语的标准词；更可能是拼写错误或姓名/网名（常见误写目标为“Gruyère”或“grues”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/rare form that is not recognized as a common modern English word; most often it appears as a misspelling or a name/handle. In many cases, writers may have meant “Gruyère” (the cheese) or “grues” (plural of “grue,” rare/poetic: shudders).","zh":"一个不常见、非标准的写法，现代英语中并不是常用词；多见于拼写错误、姓名/网名等。很多情况下可能是想写“Gruyère”（格吕耶奶酪）或“grues”（少见/诗意用法：grue 的复数，指战栗/寒颤）。"},"examples":[{"en":"I can’t find “gruys” in a dictionary—did you mean “Gruyère” cheese?","zh":"我在词典里找不到“gruys”，你是不是想写“Gruyère”（格吕耶奶酪）？"},{"en":"If you meant “grues,” it’s a rare word; most people would say “shivers.”","zh":"如果你想写“grues”，那是个很少见的词；大多数人会说“shivers（寒颤）”。"}]}],"phonetic":"/ɡruɪz/","extraExplanation":["“Gruyère”读音类似 /ɡruːˈjɛr/（常见于英文菜单/食谱），指瑞士的格吕耶奶酪。","“grue”是较古旧/文学性的动词，表示因寒冷或恐惧而“战栗”，现代更常用 shiver / tremble。","如果你是在特定文本、游戏、用户名或方言里看到“gruys”，把上下文句子发来，我可以帮你判断它具体想表达什么。"]}

