{"word":"gry","summary":{"en":"“gry” is a nonstandard short form of “gray/grey.”","zh":"“gry”是“gray/grey（灰色）”的非标准简写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an informal/abbreviated spelling of “gray/grey” (the color); sometimes seen in usernames, tags, or casual typing","zh":"“gray/grey（灰色）”的非正式/缩写拼写；有时出现在用户名、标签或随意输入中"},"examples":[{"en":"I like the gry hoodie better than the black one.","zh":"我更喜欢那件灰色连帽衫，而不是黑色那件。"},{"en":"The room is painted a light gry color.","zh":"这个房间刷成了浅灰色。"}]}],"synonyms":["gray","grey","ash-colored"],"phonetic":"/ɡreɪ/","extraExplanation":["“gry”不是标准英语拼写；正式写作中应使用“gray”（美式）或“grey”（英式）。在聊天、游戏ID、文件名或标签里，人们有时会用“gry”来省字母。"]}
{"word":"gryde","summary":{"en":"“gryde” is a Scandinavian word meaning a cooking pot; it’s not common in standard English.","zh":"“gryde”是北欧语言中“锅/炖锅”的意思，在标准英语中并不常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard English) A Scandinavian word (Danish/Norwegian) meaning a cooking pot; in English it may appear in Scandinavian recipes, product names, or place/family names.","zh":"（非标准英语）源自斯堪的纳维亚语（丹麦语/挪威语）的词，意思是“锅、炖锅”；在英语里多见于北欧食谱、商品名称或地名/姓氏中。"},"examples":[{"en":"The recipe says to simmer the soup in a heavy gryde for two hours.","zh":"食谱说要把汤放在厚重的 gryde（炖锅）里小火炖两小时。"},{"en":"I bought a cast-iron gryde from a Danish kitchen brand.","zh":"我从一家丹麦厨具品牌买了一个铸铁 gryde（锅）。"}]}],"synonyms":["pot","cooking pot","stewpot","casserole","Dutch oven"],"phonetic":"/ˈɡriːdə/","extraExplanation":["“gryde”在英语词典里通常不算常见词，更像是直接借用的丹麦语/挪威语词（基本义：锅、炖锅）。如果你是在英文写作里使用，读者可能不认识，建议改写成更通用的 pot / cooking pot / casserole (dish) / Dutch oven（铸铁珐琅锅/焖烧锅）等。","如果你本来想查的是英文单词，可能是拼写接近的词：griddle（烤盘/煎盘）、grid（网格）、greed（贪婪）。你可以告诉我你看到“gryde”的句子或语境，我可以帮你确认。"]}
{"word":"grylle","summary":{"en":"A rare art-history word meaning a grotesque hybrid figure (part human/part animal) used for decorative or humorous effect.","zh":"一个较少见的艺术史词，指装饰性或带幽默感的怪诞“人兽混合”形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a grotesque or fanciful figure in art, often a humorous monster made by mixing human and animal parts (common in medieval manuscript margins and later Renaissance “grotesques”).","zh":"（艺术）怪诞形象；常指把人和动物等部位拼接成的滑稽怪物形象（中世纪手抄本边饰及后来的“怪诞风格”中常见）。"},"examples":[{"en":"The manuscript’s margins are filled with grylles—tiny hybrid creatures that look half-human and half-bird.","zh":"这部手抄本的页边装饰满是 grylle——看起来半人半鸟的小型混合怪物。"},{"en":"In the museum, a stone carving of a grylle turns the serious scene into dark comedy.","zh":"在博物馆里，一尊 grylle 的石雕让原本严肃的场景带上了黑色幽默。"}]}],"synonyms":["grotesque figure","hybrid creature","chimera"],"phonetic":"/ˈɡrɪl/","extraExplanation":["“grylle”是一个偏学术/艺术史用词，日常英语里不常见。谈到中世纪插图、怪诞装饰（grotesque）、边饰（marginalia）或文艺复兴时期的奇异装饰图案时更可能遇到。","相关常见词：grotesque（怪诞的/怪诞装饰）、chimera（神话混合怪物）、hybrid creature（混合生物）、marginalia（书页边注/边饰）。"]}
{"word":"grylli","summary":{"en":"Grylli are grotesque hybrid figures (often multi-faced heads) used as decorative motifs in ancient and later art.","zh":"grylli 指艺术史中的怪诞混合形象（常见为多脸头像），用于古代及后世艺术装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(art history) Grotesque little figures—often heads made from a mix of human and animal parts, sometimes with multiple faces—seen in ancient Roman art and later revived in Renaissance and modern decorative art.","zh":"（艺术史）“怪诞小像/怪诞头像”：常把人和动物的部分拼合在一起，有时是一颗带多张脸的头；见于古罗马艺术，后来在文艺复兴及近现代装饰艺术中也被重新流行。"},"examples":[{"en":"The mosaic includes grylli—odd hybrid heads that look both comic and unsettling.","zh":"这幅马赛克里有一些 grylli——怪诞的混合头像，看起来既滑稽又让人不安。"},{"en":"Renaissance artists sometimes copied grylli from ancient gems and wall paintings.","zh":"文艺复兴时期的艺术家有时会从古代宝石雕刻和壁画中临摹 grylli。"}]}],"synonyms":["grotesques","hybrid figures","monstrous heads"],"phonetic":"/ˈɡrɪlaɪ/","extraExplanation":["“grylli”通常被当作拉丁语来源的复数形式（单数常写作 gryllus）。在英语艺术史写作里，它多指一种“怪诞拼接”的装饰形象：把人脸、动物嘴喙、四肢等元素组合成夸张的头像或小怪物。","这种形象在古罗马的小型雕刻（如刻宝石、浮雕）与装饰艺术中较常见，后来在“怪诞风”（grotesque）装饰传统里也能看到相似审美。","如果你是在某本画册或博物馆说明里看到它，它几乎总是一个艺术史术语，而不是日常英语单词。"]}
{"word":"gryllid","summary":{"en":"A scientific term for a cricket, especially one belonging to the family Gryllidae.","zh":"偏学术的说法，指蟋蟀，尤指蟋蟀科（Gryllidae）的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cricket; especially an insect in the cricket family (Gryllidae).","zh":"蟋蟀；尤指蟋蟀科（Gryllidae）的昆虫。"},"examples":[{"en":"The biologist recorded several gryllids calling at night.","zh":"生物学家记录了几只蟋蟀在夜间鸣叫。"},{"en":"Gryllids often hide in grass and leaf litter during the day.","zh":"蟋蟀白天常躲在草丛和落叶层里。"}]}],"synonyms":["cricket"],"phonetic":"/ˈɡrɪlɪd/","extraExplanation":["“Gryllid”是一个偏学术/科普的用词，来自分类学：蟋蟀属相关的拉丁化词根（如 Gryllus）+ “-id”（表示“……类/……科的成员”）。日常英语更常说“cricket”。","在昆虫学语境里，gryllid 通常指“蟋蟀科（Gryllidae）成员”，而不一定包括所有广义的“crickets”（有时口语会把外形相似的种类也统称为 cricket）。"]}
{"word":"gryllidae","summary":{"en":"Gryllidae is the scientific family name for true crickets.","zh":"Gryllidae 是“蟋蟀科”的科学名称，指真蟋蟀这一科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of insects known as true crickets (order Orthoptera), including many chirping cricket species","zh":"（生物分类）蟋蟀科：直翅目中的一科昆虫，俗称“真蟋蟀”，包含许多会鸣叫的蟋蟀种类"},"examples":[{"en":"Gryllidae includes many of the crickets that make chirping sounds at night.","zh":"蟋蟀科包含许多会在夜间发出鸣叫声的蟋蟀。"},{"en":"In this field guide, several Gryllidae species are identified by their songs.","zh":"在这本野外图鉴中，若干蟋蟀科物种是通过鸣声来辨认的。"}]}],"synonyms":["true crickets","crickets (common name)"],"phonetic":"/ˈɡrɪlɪˌdiː/","extraExplanation":["“Gryllidae”是拉丁化的科学名称，常用于学术写作、昆虫学教材和物种鉴定报告中；日常英语更常直接说“crickets（蟋蟀）”。","生物分类层级中，family（科）位于order（目）之下、genus（属）之上；因此Gryllidae指的是“蟋蟀这一大类的科”，而不是某一个具体物种。"]}
{"word":"gryllos","summary":{"en":"Gryllos is a rare proper name from ancient Greek history and literature, sometimes spelled Gryllus.","zh":"Gryllos是一个罕见的古希腊专有名词（人名），也常拼作Gryllus。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A name in ancient Greek history and literature; most often it refers to a figure called Gryllus/Gryllos, known from Greek texts (e.g., a man turned into a pig by Circe, or a pig who speaks in later retellings).","zh":"（专有名词）古希腊历史与文学中的人名；最常见指Gryllus/Gryllos这一人物，在希腊文本中出现（例如被喀耳刻把人变成猪的人，或在后世改写中会说话的猪）。"},"examples":[{"en":"In some retellings, Gryllos is the pig who refuses to become human again.","zh":"在一些改写版本中，Gryllos是那只拒绝再变回人类的猪。"},{"en":"Plutarch’s dialogue is often discussed under the name “Gryllus” (sometimes spelled “Gryllos”).","zh":"普鲁塔克的那篇对话常以“Gryllus”（有时拼作“Gryllos”）为题被讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun, less common) Gryllos: the name of Xenophon’s son in ancient Greece, remembered in accounts of the Battle of Mantinea.","zh":"（专有名词，较少见）Gryllos：古希腊作家色诺芬（Xenophon）之子的名字，在曼提尼亚战役（Battle of Mantinea）的记载中出现。"},"examples":[{"en":"Some ancient sources mention Gryllos as Xenophon’s son.","zh":"一些古代史料会提到Gryllos是色诺芬的儿子。"}]}],"synonyms":["Gryllus"],"phonetic":"/ˈɡrɪloʊs/","extraExplanation":["“Gryllos/Γρύλλος”是希腊拼法，对应的拉丁化拼法常见为“Gryllus”。英文学术写作里两种拼法都可能出现，检索资料时可以同时搜两种。","与喀耳刻（Circe）把人变成猪的故事有关的“Gryllos”形象，常被用来讨论“人类理性 vs. 动物本性”“文明 vs. 自然”等主题。"]}
{"word":"gryllotalpa","summary":{"en":"Gryllotalpa is the scientific genus name for mole crickets—burrowing insects with shovel-like front legs.","zh":"Gryllotalpa 是蝼蛄（mole cricket）的科学属名，指一种会钻土、前足像铲子一样的昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of mole crickets (in the family Gryllotalpidae), insects that live mostly underground and dig with spade-like front legs","zh":"蝼蛄属（蝼蛄科的一属）；多为穴居昆虫，前足呈铲状，善于在地下挖掘"},"examples":[{"en":"Gryllotalpa species are often found in moist soil near gardens and fields.","zh":"蝼蛄属的物种常见于花园和农田附近的湿润土壤中。"},{"en":"The farmer noticed plant roots damaged by a Gryllotalpa mole cricket.","zh":"农民发现有一只蝼蛄属的蝼蛄咬坏了植物根部。"}]}],"synonyms":["mole cricket (common name)"],"phonetic":"/ˌɡrɪləˈtælpə/","extraExplanation":["这是一个拉丁化的科学属名，常用于生物学/昆虫学语境，而不是日常英语。常见英文俗名是 mole cricket（蝼蛄）。","词源上可拆理解读：gryllo- 与 cricket（蟋蟀类）相关；-talpa 来自拉丁语 talpa，意为“鼹鼠”，形象地表达“像鼹鼠一样会钻土的蟋蟀”。"]}
{"word":"Gryllus","summary":{"en":"a scientific genus name for many true crickets","zh":"蟋蟀属的生物学属名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of true crickets (family Gryllidae), including many common field crickets","zh":"蟋蟀属（蟋蟀科的一属），包含许多常见的田野蟋蟀"},"examples":[{"en":"In this region, Gryllus crickets often sing at night in late summer.","zh":"在这个地区，蟋蟀属的蟋蟀常在夏末的夜里鸣叫。"},{"en":"The study compared the calling songs of several Gryllus species.","zh":"这项研究比较了几种蟋蟀属物种的鸣叫声。"}]}],"synonyms":["cricket","field cricket"],"phonetic":"ˈɡrɪləs","extraExplanation":["Gryllus 是生物学里的“属名”（genus），通常在写作时首字母大写并用斜体：Gryllus；如果指具体物种，会写成两段式学名，例如 Gryllus campestris。","日常英语里更常用的普通名是 cricket（蟋蟀）。在论文或自然观察记录中，才更常看到 Gryllus 这种拉丁学名。"],"etymology":"源自拉丁化的新拉丁学名 Gryllus，来自拉丁语 gryllus，意为“蟋蟀”（更早可追溯到希腊语相关词）。在生物分类中被用作属名。","mnemonic":["把 Gryllus 记成“grill（烤架）+ us”：夏夜烧烤时常听到“我们（us）”周围的蟋蟀叫声。","联想中文“蟋蟀”的“蟋”像细碎的摩擦声；Gryllus 也常用于研究“鸣叫/摩擦发声”的蟋蟀。"]}
{"word":"gryllus","summary":{"en":"Gryllus usually means a scientific genus of crickets; it can also refer to a classical literary figure turned into a pig by Circe.","zh":"Gryllus 通常指“蟋蟀属”（学名）；也可指古典文学中被喀耳刻变成猪的“格律罗斯”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of crickets (insects), including some common field crickets.","zh":"（昆虫）蟋蟀属：一种蟋蟀的属，包含一些常见的田野蟋蟀。"},"examples":[{"en":"Scientists identified the insect as a Gryllus species after examining its wings.","zh":"科学家通过观察它的翅膀，确认这种昆虫属于蟋蟀属（Gryllus）的某个物种。"},{"en":"You may hear Gryllus crickets chirping loudly on warm summer nights.","zh":"温暖的夏夜里，你可能会听到蟋蟀属（Gryllus）的蟋蟀发出很响的鸣叫。"}]},{"partOfSpeech":"n.","definition":{"en":"(in classical literature) Gryllus, a man turned into a pig by Circe in a story connected with Odysseus; used in later writing to discuss human nature.","zh":"（古典文学）格律罗斯（Gryllus）：在与奥德修斯相关的故事中被喀耳刻（Circe）变成猪的人物；后世常借此讨论“人性/兽性”等主题。"},"examples":[{"en":"Plutarch’s dialogue \"Gryllus\" uses the character to question whether humans are truly better than animals.","zh":"普鲁塔克的对话《格律罗斯》（Gryllus）借该人物探问：人类是否真的比动物更高贵。"},{"en":"In some essays, Gryllus appears as a symbol for the blurred line between civilized and wild behavior.","zh":"在一些文章中，格律罗斯常被当作“文明与野性界线模糊”的象征。"}]}],"synonyms":["cricket (genus)","field cricket (general)"],"phonetic":"/ˈɡrɪləs/","extraExplanation":["在生物学里，Gryllus 是拉丁化的属名，常见于学术写作（如物种命名 Gryllus campestris 等）。日常英语里更常直接说 cricket（蟋蟀），除非是在讲分类学。","在古典文学传统中，普鲁塔克（Plutarch）的《Gryllus》（又译《格律罗斯》）是一篇对话体作品：一头被变成猪的“格律罗斯”与奥德修斯对话，借动物之口批评人类的缺点。"]}
{"word":"grypanian","summary":{"en":"“Grypanian” usually means “related to (or from) Grypania,” often in fictional or specialized contexts.","zh":"“Grypanian”通常表示“与（或来自）Grypania（格里帕尼亚）有关”，多见于虚构或特定设定语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Proper adjective / demonym) Relating to a place, group, or fictional nation called “Grypania,” or a person from there. This word is not standard in general English and usually appears only in specific stories, games, or world-building contexts.","zh":"（专有形容词/族称）与名为“Grypania（格里帕尼亚）”的地方、群体或虚构国家有关的；或指来自那里的人。该词不属于常见英语词汇，通常只在特定小说、游戏或世界观设定中出现。"},"examples":[{"en":"In the novel, Grypanian merchants control much of the coastal trade.","zh":"在小说里，格里帕尼亚商人掌控了大部分沿海贸易。"},{"en":"She speaks with a Grypanian accent in the game’s English dub.","zh":"在游戏的英语配音里，她带着格里帕尼亚口音。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from “Grypania.” (Used less often than the adjective.)","zh":"“Grypania（格里帕尼亚）”人；来自格里帕尼亚的人。（作名词用法较少，通常更常见的是形容词用法）"},"examples":[{"en":"He’s a Grypanian who moved abroad as a child.","zh":"他是格里帕尼亚人，小时候移居海外。"}]}],"synonyms":["(context-dependent)"],"phonetic":"/ɡrɪˈpeɪniən/","extraExplanation":["“grypanian”在主流英语词典中通常查不到，更像是基于地名/设定名“Grypania”构成的形容词（类似 Italian, Canadian）。如果你能提供它出现的句子或作品名称，我可以把含义解释得更精确，并给出更贴近语境的同义表达。","你可能想找的拼写也许是：Gryphon（狮鹫）相关的“gryphon/griffin + -ian”（如 gryphonian，表示“狮鹫的/与狮鹫有关的”），或其他近形词。请告诉我你的原句。"]}
{"word":"grype","summary":{"en":"“Grype” is a rare spelling of “gripe,” meaning to complain or (less commonly) to have stomach cramps; it can also mean a complaint or a cramp.","zh":"“grype”是“gripe”的罕见拼写，常指“抱怨/发牢骚”，也可指“（腹部）绞痛”；名词可表示“抱怨”或“一阵绞痛”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare spelling) to complain in an annoyed way; to grumble.","zh":"（罕见拼写）抱怨；发牢骚。"},"examples":[{"en":"He kept gryping about the slow service.","zh":"他一直在抱怨服务太慢。"},{"en":"Try not to grype—let’s look for a solution.","zh":"尽量别抱怨了——我们来想办法解决。"}]},{"partOfSpeech":"v.","definition":{"en":"to feel or cause a sudden, sharp pain in the stomach or intestines (cramps).","zh":"（使）腹部绞痛；肠胃痉挛。"},"examples":[{"en":"Spicy food can sometimes grype your stomach.","zh":"辛辣食物有时会让你的胃绞痛。"},{"en":"She had a bad grype after eating street food.","zh":"她吃了路边摊后胃绞痛得厉害。"}]},{"partOfSpeech":"n.","definition":{"en":"a complaint, especially a small or repeated one; something you grumble about.","zh":"抱怨（尤指小事或反复的抱怨）；牢骚。"},"examples":[{"en":"My only grype is that the room is too noisy.","zh":"我唯一的抱怨是房间太吵。"},{"en":"Customers shared their grypes online.","zh":"顾客在网上分享了他们的抱怨。"}]},{"partOfSpeech":"n.","definition":{"en":"a sharp stomach pain; a cramp.","zh":"（腹部）绞痛；痉挛。"},"examples":[{"en":"He doubled over with a grype.","zh":"他因一阵绞痛而弯下了腰。"}]}],"synonyms":["gripe","complain","grumble","moan","whine"],"phonetic":"/ɡraɪp/","extraExplanation":["“grype”多见于较旧或非标准拼写，现代英语里几乎都写作“gripe”。在美式英语中，“gripe”很常用来表示“抱怨”，语气通常带点不耐烦或挑剔。","与“complain”相比，“gripe”更口语、更像“发牢骚”；与“grip（抓紧）”不同，“gripe”主要不是“握住”的意思（尽管词源相关）。"]}
{"word":"gryph","summary":{"en":"“Gryph” is a rare word meaning a gryphon/griffin (a lion-eagle mythical creature).","zh":"“gryph”是很少见的词，意思是狮鹫/鹰狮（狮身鹰头的神话生物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare/poetic short form of “gryphon/griffin,” a mythical creature with the body of a lion and the head and wings of an eagle","zh":"（罕见/诗意用法）“gryphon/griffin（狮鹫）”的简写：一种神话生物，狮身、鹰头并有翅膀"},"examples":[{"en":"In the old tale, a gryph guards the mountain treasure.","zh":"在那个古老的故事里，一只狮鹫守护着山中的宝藏。"},{"en":"The artist carved a gryph on the gate as a symbol of strength.","zh":"艺术家在大门上雕了一只狮鹫，象征力量。"}]}],"synonyms":["griffin","gryphon"],"phonetic":"/ɡrɪf/","extraExplanation":["“gryph”在现代英语中非常少见，多出现在幻想文学、诗歌或仿古风格里。日常写作更常用“griffin”或“gryphon”。","狮鹫常见于欧洲纹章与中世纪艺术中，常象征守护、威严与力量；在一些故事里也与“守护宝物”这一主题联系紧密。"]}
{"word":"gryphaea","summary":{"en":"Gryphaea is an extinct fossil oyster (often called “devil’s toenails”), known for its strongly curved shell and common in Jurassic rocks.","zh":"Gryphaea是一种已灭绝的弯壳牡蛎化石（俗称“魔鬼脚趾甲”），以壳体强烈弯曲著称，常见于侏罗纪地层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct fossil oysters with a strongly curved shell, common in Jurassic rocks; often called “devil’s toenails.”","zh":"一种已灭绝的牡蛎属（化石），壳体强烈弯曲，常见于侏罗纪地层；俗称“魔鬼脚趾甲（化石）”。"},"examples":[{"en":"We found Gryphaea fossils in the limestone layer during our field trip.","zh":"我们在野外考察时，在石灰岩层里发现了Gryphaea（弯壳牡蛎）的化石。"},{"en":"The rock unit is dated partly by the presence of Gryphaea.","zh":"这个岩层单元的年代部分通过Gryphaea化石来判断。"},{"en":"In England, people sometimes call Gryphaea fossils “devil’s toenails.”","zh":"在英国，人们有时把Gryphaea化石称为“魔鬼脚趾甲”。"}]}],"synonyms":["devil’s toenails","fossil oyster"],"phonetic":"/ɡraɪˈfiːə/","extraExplanation":["“Gryphaea”来自希腊语词根 gryph-（与“griffin/狮鹫”同源），用来形容这种化石外形弯曲、像爪或趾甲。","“devil’s toenails（魔鬼脚趾甲）”是英国民间对这类弯曲牡蛎化石的俗称；在地质学里常用它们来帮助识别和对比侏罗纪的沉积地层。"]}
{"word":"gryphite","summary":{"en":"Gryphite means a fossil shell, especially a fossil oyster of the genus *Gryphaea*.","zh":"Gryphite 指一种化石贝壳，尤指 *Gryphaea* 属的牡蛎化石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fossil shell (especially from the extinct oyster genus *Gryphaea*), often found in sedimentary rocks","zh":"（尤指已灭绝的牡蛎属 *Gryphaea* 的）化石贝壳，常见于沉积岩中"},"examples":[{"en":"We found a gryphite while hiking near the limestone cliffs.","zh":"我们在石灰岩峭壁附近徒步时发现了一枚 gryphite（牡蛎化石）。"},{"en":"The museum display includes ammonites and gryphites from the Jurassic period.","zh":"博物馆展柜里有侏罗纪的菊石和 gryphite（牡蛎化石）。"}]}],"synonyms":["Gryphaea fossil","fossil oyster","devil’s toenail (informal)"],"phonetic":"/ˈɡrɪˌfaɪt/","extraExplanation":["“gryphite”在现代英语里很少见，更多时候会直接说 *Gryphaea fossil* 或用俗名 *devil’s toenail*（“魔鬼脚趾甲”，指某些外形弯曲、厚重的牡蛎化石）。","词源与属名 *Gryphaea* 相关，来自希腊语里表示“弯曲/钩状（像喙）”的含义，用来形容这种化石贝壳常见的弯曲外形。"]}
{"word":"gryphon","summary":{"en":"A gryphon is a mythical lion-eagle creature; it’s an alternate spelling of “griffin.”","zh":"gryphon 指神话中的狮鹫（狮身鹰首有翼）；是“griffin”的另一种拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mythical creature with the body of a lion and the head and wings of an eagle (a common figure in medieval stories and heraldry); a spelling variant of “griffin.”","zh":"狮鹫（神话生物）：狮子的身体、鹰的头和翅膀（中世纪故事与纹章学中常见）；也是“griffin”的另一种拼写。"},"examples":[{"en":"The castle gate was decorated with stone gryphons to symbolize protection.","zh":"城堡大门上装饰着石雕狮鹫，用来象征守护。"},{"en":"In the fantasy novel, a gryphon carries the hero across the mountains.","zh":"在那本奇幻小说里，一只狮鹫驮着主角飞越群山。"},{"en":"The museum label notes that “gryphon” is an alternate spelling of “griffin.”","zh":"博物馆说明牌写道：“gryphon”是“griffin”的另一种拼写。"}]}],"synonyms":["griffin","mythical beast"],"phonetic":"ˈɡrɪfən","extraExplanation":["“gryphon/griffin”常出现在欧洲中世纪的纹章（家族徽章、盾徽）里，象征力量、警觉与守护，因此你会在城堡、教堂、古建筑装饰上见到它的形象。","拼写上，“griffin”在现代英语里更常见；“gryphon”常给人更古典或奇幻文学风格的感觉（例如游戏、小说的命名）。"]}
{"word":"gryphon-like","summary":{"en":"having the appearance or style of a mythical gryphon.","zh":"具有狮鹫这种神话生物的外形或风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a gryphon (a mythical creature with an eagle’s head and wings and a lion’s body).","zh":"像狮鹫的（狮鹫：神话生物，鹰头与翅膀、狮身）。"},"examples":[{"en":"The statue had a gryphon-like head and powerful feline legs.","zh":"那座雕像有狮鹫般的头部和强壮的猫科动物腿部。"},{"en":"She designed a gryphon-like emblem for the fantasy kingdom.","zh":"她为那个奇幻王国设计了一个狮鹫风格的徽章。"},{"en":"Gryphon-like guardians stood at the gate in the story.","zh":"故事里大门前站着狮鹫般的守卫。"}]}],"synonyms":["griffin-like","gryphonic","mythical","chimera-like"],"phonetic":"ˈɡrɪfən laɪk","extraExplanation":["常见于奇幻文学、游戏、美术评论或建筑装饰描述（如门环、柱头雕刻）中，用来表达“带有狮鹫特征的、狮鹫风格的”。","拼写上 *gryphon* 与 *griffin* 都表示“狮鹫”；因此也可能看到 *griffin-like* 作为同义表达。"],"etymology":"来自“gryphon/griffin（狮鹫）+ -like（像……的）”。“gryphon”源自拉丁语 *gryphus*，更早可追溯到希腊语 *gryps*，指神话中的狮鹫。","mnemonic":["把它拆开记：gryphon（狮鹫）+ like（像）→“像狮鹫的”。","联想“狮(gryphon的狮身) + 鹰(头和翅膀)”两种动物混合的形象：看到“混合猛兽”就想到 gryphon-like。"]}
{"word":"gryphonhood","summary":{"en":"the identity or state of being a gryphon","zh":"作为狮鹫的身份或状态"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state, condition, or identity of being a gryphon (a mythical creature with an eagle’s head and wings and a lion’s body), often used in fantasy writing or fandom contexts","zh":"“狮鹫（鹰头有翼、狮身的神话生物）”的身份、状态或特质；常见于奇幻作品或同人/圈内语境"},"examples":[{"en":"In the novel, she embraces her gryphonhood after learning her family’s ancient curse.","zh":"在小说里，她得知家族古老的诅咒后，开始接纳自己“狮鹫之身/狮鹫身份”。"},{"en":"The story explores gryphonhood as both a gift and a burden.","zh":"故事把“狮鹫身份”写成既是天赋也是负担。"},{"en":"Artists in the fandom celebrate gryphonhood through wings, talons, and lionlike strength in their designs.","zh":"同人画师会用翅膀、利爪和狮子的力量感等元素来表现“狮鹫特质”。"}]}],"synonyms":["griffinhood","gryphon identity","gryphon nature","gryphon state"],"phonetic":"/ˈɡrɪfənˌhʊd/","extraExplanation":["gryphon/griffin 指同一种神话生物：英语里两种拼写都常见；gryphon 在奇幻圈、角色设定里更常用来营造“古典/奇幻”气氛。","-hood 这个后缀常把“某种身份或状态”名词化：比如 personhood（人格/人之为人的地位）、brotherhood（兄弟情谊/兄弟会）。因此 gryphonhood 通常强调“作为狮鹫的身份认同”或“狮鹫化的状态”。"],"etymology":"由 gryphon（狮鹫，亦作 griffin）+ 后缀 -hood（表示“身份/状态/时期”，如 childhood）构成；多为现代奇幻写作与圈内用语的造词。","mnemonic":["记后缀：-hood = “身份/状态”（childhood 童年）。所以 gryphonhood = “狮鹫的身份/状态”。","把 gryphon 联想成“grip + phon(像 phone)”的音：被神话生物“抓住（grip）”的命运 → 进入狮鹫的身份状态。"]}
{"word":"gryphons","summary":{"en":"“Gryphons” are mythical lion-eagle creatures (plural form of gryphon/griffin).","zh":"“gryphons”指神话中的狮鹫（gryphon/griffin 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “gryphon” (also spelled “griffin”): a mythical creature with the body of a lion and the head and wings of an eagle.","zh":"“gryphon”（也拼作“griffin”）的复数：一种神话生物，通常有狮子的身体、鹰的头与翅膀。"},"examples":[{"en":"In the story, gryphons guard the entrance to the lost city.","zh":"在故事里，狮鹫守护着失落之城的入口。"},{"en":"Many fantasy games use gryphons as flying mounts.","zh":"许多奇幻游戏把狮鹫设定为可骑乘的飞行坐骑。"},{"en":"The artist painted two gryphons facing each other on the shield.","zh":"画家在盾牌上画了两只相对而立的狮鹫。"}]}],"synonyms":["griffins"],"phonetic":"/ˈɡrɪfənz/","extraExplanation":["“gryphon”和“griffin”是同一种生物的不同拼写：现代奇幻作品里“gryphon”更常见于游戏/设定用语；在古典或学术语境中“griffin”也很常见。","狮鹫在欧洲与近东神话与纹章（家族徽章）中常被视为力量与守护的象征，常出现在宝藏、神殿或王权的相关叙事里。"]}
{"word":"gryphosaurus","summary":{"en":"“Gryphosaurus” is not a standard scientific dinosaur name; it is usually a misspelling of “Gryposaurus,” or a fictional name in creative works.","zh":"“Gryphosaurus”并非标准的科学恐龙名称；通常是把“Gryposaurus（格里波龙）”拼错，或是在虚构作品中使用的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling or mistaken form of “Gryposaurus,” a genus of duck-billed dinosaur (a hadrosaur).","zh":"常见的拼写误写或误用形式，通常指“Gryposaurus（格里波龙）”，一种鸭嘴龙类（冠龙类）恐龙属。"},"examples":[{"en":"I searched for “gryphosaurus,” but the correct dinosaur name is usually “Gryposaurus.”","zh":"我搜索了“gryphosaurus”，但正确的恐龙名称通常是“Gryposaurus”。"},{"en":"Some websites list “gryphosaurus,” but scientific sources use “Gryposaurus.”","zh":"有些网站会写“gryphosaurus”，但科学资料一般用“Gryposaurus”。"}]},{"partOfSpeech":"other","definition":{"en":"A rare, nonstandard name that may be used in fiction or games for a dinosaur-like creature.","zh":"一个较少见、非标准的名称，可能在小说、游戏等虚构作品中用来指“像恐龙的生物”。"},"examples":[{"en":"In the game, the Gryphosaurus is a fast predator with a hooked snout.","zh":"在游戏里，Gryphosaurus 是一种长着钩状鼻子的快速掠食者。"}]}],"synonyms":["Gryposaurus"],"phonetic":"/ˌɡrɪfoʊˈsɔrəs/","extraExplanation":["“Gryposaurus”来自希腊语词根：grypos-（弯钩的、鹰钩鼻的）+ -saurus（蜥蜴/恐龙），常被理解为“钩鼻蜥蜴”。“gryphosaurus”看起来像把 grypos- 误写成 grypho-（容易让人联想到 griffin/gryphon“狮鹫”），因此在非正式文本里偶尔出现。"]}
{"word":"gryphus","summary":{"en":"Gryphus is a rare, old-fashioned word for a griffin/gryphon, a mythical lion-eagle creature.","zh":"gryphus 是一个较罕见的古体词，指“狮鹫/鹰狮”（griffin/gryphon），一种狮身鹰头（常有翅膀）的神话生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A griffin (also spelled gryphon): a mythical creature with the body of a lion and the head and wings of an eagle, often used in art and heraldry as a symbol of strength and guardianship.","zh":"（罕见/古体）狮鹫（亦作 gryphon/griffin）：一种神话生物，通常描绘为狮子的身体、鹰的头与翅膀；常见于艺术与纹章中，象征力量与守护。"},"examples":[{"en":"A gryphus was carved above the castle gate to symbolize protection.","zh":"城堡大门上方雕刻着一只狮鹫，用来象征守护。"},{"en":"In the story, the hero rides a gryphus across the mountains.","zh":"在故事里，英雄骑着狮鹫飞越群山。"}]}],"synonyms":["griffin","gryphon"],"phonetic":"/ˈɡrɪfəs/","extraExplanation":["“gryphus” 多见于拉丁文或古英语/学术性文本中，相当于更常见的 “griffin/gryphon”。词源来自拉丁语 gryphus，进一步可追溯到古希腊语中表示“狮鹫”的词。现代英语里日常更常用 griffin（尤其在北美常见）或 gryphon（也常见于奇幻作品的拼写）。"]}
{"word":"Gryposaurus","summary":{"en":"a duck-billed hadrosaur dinosaur genus with a distinctive hooked-nose skull profile","zh":"一种头骨呈“钩鼻”轮廓的鸭嘴龙类恐龙属"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of duck-billed (hadrosaur) dinosaurs known for a distinctive arched, “hook-nosed” profile; it lived in western North America in the Late Cretaceous period","zh":"一种鸭嘴龙类（鸭嘴恐龙科）的恐龙属，以头骨前部拱起、像“钩鼻”一样的轮廓著称；生活在白垩纪晚期的北美西部"},"examples":[{"en":"Gryposaurus fossils have been found in parts of Canada and the United States.","zh":"人们在加拿大和美国的一些地区发现了Gryposaurus的化石。"},{"en":"The museum display compares Gryposaurus with other hadrosaurs to show differences in skull shape.","zh":"博物馆展览把Gryposaurus和其他鸭嘴龙类放在一起对比，展示头骨形状的差异。"},{"en":"Many illustrations show Gryposaurus traveling in herds and grazing on low plants.","zh":"许多复原图会画出Gryposaurus成群活动、取食低矮植物的场景。"}]}],"synonyms":["hadrosaur","duck-billed dinosaur"],"phonetic":"/ˌɡraɪpoʊˈsɔrəs/","extraExplanation":["读作一个“属名”（genus name），常用于古生物学与博物馆解说中；写作时通常首字母大写并用斜体（如 *Gryposaurus*）。","它属于“鸭嘴龙类”（hadrosaurs），多为植食性恐龙；“钩鼻”的外形主要来自鼻部与上颌区域的骨骼结构。"],"etymology":"源自希腊语：grypos（弯曲的、钩状的鼻子/喙）+ sauros（蜥蜴）。名称强调其头骨前部呈拱起“钩鼻”外形。","mnemonic":["把 gry- 联想成“拐/钩（弯的）”，-saurus 就是常见的“蜥蜴/恐龙”后缀：=“钩鼻的恐龙”。","记住同一家族词：很多恐龙名都以 -saurus 结尾（如 Tyrannosaurus），看到后缀就先想到“恐龙”。"]}
{"word":"gryposis","summary":{"en":"“Gryposis” is a rare term meaning the state of having a hooked (aquiline) nose.","zh":"“gryposis”是个较罕见的词，指具有钩状鼻（鹰钩鼻）的状态或特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) A condition or trait of having a hooked or strongly curved nose; the state of being “aquiline” or “hook-nosed.”","zh":"（医学，较罕见）钩状鼻/鹰钩鼻的特征或状态；鼻梁明显向下弯曲的情况。"},"examples":[{"en":"In older medical writing, “gryposis” described an unusually hooked nose shape.","zh":"在较早期的医学文献中，“gryposis”用来描述异常明显的鹰钩鼻外形。"},{"en":"The report noted facial features such as gryposis and a prominent nasal bridge.","zh":"报告记录了面部特征，例如鹰钩鼻以及突出的鼻梁。"}]}],"synonyms":["aquiline nose","hooked nose","beaked nose"],"phonetic":"/ɡraɪˈpoʊsɪs/","extraExplanation":["这个词非常少见，多见于较老的医学或人类学写作中；现代英语更常用 aquiline nose（鹰钩鼻）/hooked nose（钩状鼻）来表达。","词源来自希腊语 grypos（弯曲的、钩状的）+ -osis（表示“状态/病态”的后缀）。需要注意：描述外貌时在社交语境可能带有冒犯性，最好使用中性表达或放在医学/客观描述中。"]}
{"word":"grypotherium","summary":{"en":"Grypotherium is the scientific name of an extinct genus of large ground sloths from Ice Age South America.","zh":"Grypotherium是冰河时期南美洲一种已灭绝的巨型地懒属的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of large ground sloths that lived in South America during the Ice Age (Pleistocene).","zh":"一种已灭绝的巨型地懒属，生活在南美洲的冰河时期（更新世）。"},"examples":[{"en":"Fossils of Grypotherium have been found in parts of South America.","zh":"在南美洲的一些地区发现了Grypotherium（巨型地懒）的化石。"},{"en":"Grypotherium is often discussed in studies of Pleistocene megafauna.","zh":"Grypotherium常出现在关于更新世大型动物群的研究中。"}]}],"synonyms":["ground sloth","extinct sloth (general)"],"phonetic":"/ˌɡrɪpoʊˈθɪriəm/","extraExplanation":["词源上可拆成希腊语元素：gryp-（意为“钩状的、弯曲的”，常见于griffin/gryphon相关词根）+ -therium（意为“兽、动物”，见于许多古生物名称）。因此整体带有“钩状的兽/动物”之意，属于学术命名风格。","这是古生物学里的属名（genus），通常出现在博物馆标牌、论文或科普书中；日常英语里并不常用。阅读时可把它当作“某种已灭绝的地懒”的专有名词来理解。"]}
{"word":"gryps","summary":{"en":"“gryps” is not standard English; it is usually a misspelling of “grips.”","zh":"“gryps”不是标准英语，通常是“grips”的拼写错误。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of “grips,” meaning holds tightly or seizes firmly (3rd-person singular of the verb “grip”).","zh":"（非标准拼写）通常是“grips”的拼写错误，表示“紧握/抓住”（动词 grip 的第三人称单数）。"},"examples":[{"en":"She grips the railing when the train starts moving.","zh":"火车开始移动时，她紧紧抓住扶手。"},{"en":"He grips the pen so tightly that his hand hurts.","zh":"他把笔握得太紧，手都疼了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of “grips,” the plural of “grip”: a firm hold, or control/understanding of something.","zh":"（非标准拼写）通常是“grips”的拼写错误，即名词 grip 的复数：牢牢的抓握；也可指对某事的掌控/理解。"},"examples":[{"en":"The gloves have rubber grips on the palms.","zh":"这副手套的手心有橡胶防滑抓握面。"},{"en":"After practice, she finally got a better grip on the new software.","zh":"练习之后，她终于更好地掌握了这个新软件。"}]}],"synonyms":["holds","clutches","grasps","seizes"],"phonetic":"/ɡrɪps/","extraExplanation":["“gryps”在现代英语里不是常见标准拼写；大多数情况下你想写的是“grips”。发音相同：/ɡrɪps/。","另外，“gryps”在波兰语语境里有时指监狱暗语或秘密纸条（属于特定文化用法），但这不是常见英语词汇。"]}
{"word":"grysbok","summary":{"en":"A small South African antelope called a grysbok.","zh":"一种产于南非的小型羚羊，称为灰小羚羊（grysbok）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small South African antelope (a kind of tiny, shy deer-like animal), usually referring to either the Cape grysbok or Sharpe’s grysbok","zh":"一种南非的小型羚羊（外形像小鹿、较胆小），通常指“开普灰小羚羊”或“夏普灰小羚羊”"},"examples":[{"en":"We spotted a grysbok hiding in the bushes near the trail.","zh":"我们在小路旁的灌木丛里看到一只灰小羚羊躲着。"},{"en":"The grysbok is active mostly at night, so it can be hard to see.","zh":"灰小羚羊多在夜间活动，所以不太容易看到。"}]}],"phonetic":"/ˈɡreɪzˌbɑk/","extraExplanation":["“grysbok”来自南非荷兰语/南非语（Afrikaans）：grys=“灰色”，bok=“羚羊/山羊”。所以字面意思是“灰色的小羚羊”。","它们体型很小、行动谨慎，常生活在灌木和草丛里；在英文自然纪录片或非洲野生动物相关语境中更常见。"]}
{"word":"gryvna","summary":{"en":"Ukraine’s currency unit","zh":"乌克兰的货币单位"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic unit of money used in Ukraine","zh":"乌克兰的货币基本单位（格里夫纳/赫里夫尼亚）"},"examples":[{"en":"I exchanged dollars for gryvna before traveling to Kyiv.","zh":"去基辅旅行前，我把美元换成了格里夫纳。"},{"en":"The price is 200 gryvna for a one-day museum pass.","zh":"一日博物馆通票价格是200格里夫纳。"},{"en":"The invoice lists the total in gryvna (UAH).","zh":"发票上用格里夫纳（UAH）标出了总额。"}]}],"synonyms":["hryvnia","UAH"],"phonetic":"/ˈrɪvniə/","extraExplanation":["在英文中更常见的拼写是 hryvnia（乌克兰官方转写），gryvna 属于另一种转写方式。ISO 货币代码是 UAH。"],"etymology":"源自乌克兰语 hryvnia（也常拼作 hryvna）。更早可追溯到斯拉夫语词根，与“颈部/项圈、项饰”有关：古时指戴在颈上的金属环状饰物，后来引申为一定重量的银锭，再发展为货币单位名称。","mnemonic":["联想“Ukraine”→货币代码 UAH；看到 UAH 就想到是格里夫纳。","把 gryvna 读成“griv-na”，像“griv(格里夫)+na(拿)”：在乌克兰用它来“拿”东西（购买）。"]}

