{"word":"ha","summary":{"en":"“Ha” is a short written laugh or exclamation showing amusement, mild sarcasm, surprise, or triumph.","zh":"“ha”是书写中的短笑声/感叹词，可表示好笑、轻微讽刺、惊讶或得意。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A small laugh sound used in writing to show amusement, light sarcasm, or a relaxed tone.","zh":"（书写中）表示轻笑的声音，用来表达好笑、轻微的讽刺或轻松的语气。"},"examples":[{"en":"Ha! That joke actually made me laugh.","zh":"哈！那个笑话真的把我逗笑了。"},{"en":"Ha, you thought I forgot—but I didn’t.","zh":"哈，你以为我忘了——但我没有。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show surprise or triumph, like a quick shout when you succeed or notice something.","zh":"（表示惊讶或得意）像成功或突然发现什么时的一声短喊。"},"examples":[{"en":"Ha! I knew I was right.","zh":"哈！我就知道我对。"},{"en":"Ha—there you are!","zh":"哈——原来你在这儿！"}]}],"synonyms":["haha","heh","aha"],"phonetic":"/hɑ/","extraExplanation":["“ha”在聊天里常带语气：单独的“ha”可能显得冷淡或有点嘲讽；“haha”更像真笑；“hahaha”更强烈。不同文化里对“ha”的解读也会不同，正式场合尽量不用单独“ha”。","文学或戏剧里常见“Ha!”用来表现人物突然明白、嘲弄对方或得意（例如对话里突然插入的感叹）。"]}
{"word":"HA1c","summary":{"en":"HbA1c (A1C) is a blood test showing your average blood sugar over about 2–3 months.","zh":"HbA1c（A1C）是一项反映约2–3个月平均血糖水平的血液检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A lab test that measures your average blood sugar level over the past ~2–3 months by checking how much glucose is attached to hemoglobin in red blood cells; used to diagnose and monitor diabetes.","zh":"（医学）糖化血红蛋白检测：通过测量红细胞中血红蛋白与葡萄糖结合的比例，反映过去约2–3个月的平均血糖水平；用于诊断与监测糖尿病。"},"examples":[{"en":"My doctor ordered an HbA1c test to see my average blood sugar for the last few months.","zh":"医生给我开了HbA1c检查，用来看看我过去几个月的平均血糖。"},{"en":"Her A1C improved from 8.2% to 7.1% after changing her diet and exercise routine.","zh":"她调整饮食和运动后，A1C从8.2%改善到7.1%。"}]}],"synonyms":["HbA1c","A1C","glycated hemoglobin","hemoglobin A1c"],"phonetic":"/eɪ wʌn siː/","extraExplanation":["你输入的“HA1c”更常见的写法是 **HbA1c** 或 **A1C**（其中Hb表示血红蛋白hemoglobin）。","A1C通常以百分比（%）或 mmol/mol 表示；数值越高，代表长期平均血糖越高。很多地区常用它来辅助诊断糖尿病并评估控制情况。","A1C反映的是“平均水平”，可能掩盖血糖的大起大落；某些情况（如贫血、近期大量失血、某些血红蛋白变异）会影响结果，需由医生解读。"]}

