{"word":"haab","summary":{"en":"Haab (Haab’) is the ancient Maya 365-day solar (civil) calendar.","zh":"Haab（Haab’）是古代玛雅人的365天太阳（民用）历。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Haab (also written Haab’) is the ancient Maya solar calendar of 365 days, used to track the civil year (months and seasons).","zh":"Haab（也写作 Haab’）是古代玛雅人的365天太阳历，用来记录民用年的月份与季节。"},"examples":[{"en":"The Haab calendar has 365 days, similar to the length of a solar year.","zh":"Haab 历有365天，长度与太阳年相近。"},{"en":"Maya inscriptions sometimes record dates using both the Tzolk’in and the Haab.","zh":"玛雅碑铭有时会同时用卓尔金历（Tzolk’in）和 Haab 历来记录日期。"}]}],"synonyms":["Haab’ calendar","Maya solar calendar","Maya civil calendar"],"phonetic":"/hɑb/","extraExplanation":["Haab 通常由18个“月”（每月20天）加上最后5天组成；这5天常被称为 Wayeb（或 Uayeb），在一些传统观念里被视为不太吉利、需要谨慎行事的日子。","玛雅历法系统里，Haab 常与260天的卓尔金历（Tzolk’in）一起使用；两者组合形成“历法轮”（Calendar Round），用于在一定周期内更精确地标记日期。","拼写上你可能会看到 Haab 或 Haab’；末尾的撇号常用来表示玛雅语中的喉塞音（glottal stop），但在英文资料里有时会省略。"]}
{"word":"haaf","summary":{"en":"Haaf is a regional Scots word meaning the open sea or offshore fishing grounds; it can also appear as a variant spelling of “half.”","zh":"Haaf 是苏格兰部分地区的方言词，主要指外海/远海渔场；也可能作为“half（半）”的变体拼写出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Shetland/Orkney Scots) the open sea, especially fishing grounds far offshore.","zh":"（设得兰/奥克尼苏格兰方言）外海、公海；尤指远海渔场。"},"examples":[{"en":"In the old days, many men went out to the haaf to fish for cod.","zh":"过去很多男人会出海到外海去捕鳕鱼。"},{"en":"The weather turned rough before they reached the haaf.","zh":"他们还没到外海，天气就变得很恶劣。"}]},{"partOfSpeech":"other","definition":{"en":"a spelling variant of “half” in some names or dialect writing.","zh":"在一些姓名或方言拼写中，“half（半）”的变体写法。"},"examples":[{"en":"In some dialect texts, you may see haaf used where standard English would write half.","zh":"在一些方言文本里，你可能会看到用 haaf 来写标准英语的 half。"}]}],"synonyms":["open sea","offshore waters","fishing grounds","half (variant spelling)"],"phonetic":"/hɑːf/","extraExplanation":["这个词在苏格兰设得兰群岛一带很有地域特色，常见搭配是 da haaf（意为“外海/远海渔场”），与传统的“haaf fishing（远海捕鱼）”有关。","词源上常被认为与古诺尔斯语（Old Norse）的 haf（“海洋”）有关，反映了当地受北欧语言与海洋文化影响较深。"]}
{"word":"haafs","summary":{"en":"“haafs” is the plural of “haaf,” a Shetland Scots word for offshore deep-sea fishing or the distant fishing grounds.","zh":"“haafs”是“haaf”的复数，属设得兰方言，指远海捕鱼或远海渔场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish, Shetland) Deep-sea fishing (especially far from shore); the offshore fishing grounds used for this.","zh":"（苏格兰设得兰方言）远海捕鱼（尤指离岸较远）；用于远海捕鱼的海域。"},"examples":[{"en":"In the old days, many Shetlanders went out to the haaf for cod and ling.","zh":"在过去，许多设得兰人会出海到远海渔场捕鳕鱼和西鳕。"},{"en":"Bad weather could keep the boats from the haaf for weeks.","zh":"恶劣天气可能让渔船好几周都无法去远海渔场。"}]}],"synonyms":["offshore fishing","deep-sea fishing","fishing grounds"],"phonetic":"/hɑf/","extraExplanation":["“haafs”通常是名词“haaf”的复数形式，出现在设得兰（Shetland）相关的历史、民俗或文学语境中。它不是现代通用英语里常见的词。","词源来自古诺斯语（Old Norse）中表示“海”的词，反映了设得兰群岛深受北欧文化影响。","如果你原本想查的是拼写相近的常用词（例如 halves / laughs / haves），告诉我句子语境，我可以帮你确认。"]}
{"word":"haak","summary":{"en":"“haak” usually means “hook” in Dutch/Afrikaans; it’s not a common everyday English word.","zh":"“haak”在荷兰语/南非荷兰语里通常表示“钩子/勾住”；在日常英语中并不常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mostly Dutch/Afrikaans) a hook; something curved for catching or hanging things.","zh":"（多见于荷兰语/南非荷兰语）钩子；用于勾住或悬挂物品的弯曲工具。"},"examples":[{"en":"In Dutch, “haak” means “hook.”","zh":"在荷兰语里，“haak”意思是“钩子”。"},{"en":"He hung the bag on a haak by the door.","zh":"他把包挂在门边的钩子上。"}]},{"partOfSpeech":"v.","definition":{"en":"(Mostly Dutch/Afrikaans) to hook; to catch or attach with a hook.","zh":"（多见于荷兰语/南非荷兰语）用钩子勾住；钩住或挂住。"},"examples":[{"en":"She tried to haak the rope onto the metal ring.","zh":"她试着把绳子钩到金属环上。"},{"en":"The fish can haak the line and pull hard.","zh":"鱼可能会钩住鱼线并用力拉扯。"}]}],"synonyms":["hook","clasp","catch"],"phonetic":"/hɑk/","extraExplanation":["“haak”不是常见英语单词，更常见于荷兰语和南非荷兰语；在英语语境里它可能是人名/姓氏、地名，或出现在外来语、品牌名中。","如果你是在英文文章里看到“haak”，可以把原句发我，我可以帮你判断它是外来语含义，还是专有名词。"]}
{"word":"haar","summary":{"en":"Haar means a cold, wet sea fog, especially in Scotland and northeast England.","zh":"haar 指冷湿的海雾，尤常见于苏格兰及英格兰东北部的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cold, damp sea fog or mist that blows in from the ocean, especially on the east coast of Scotland and northeast England","zh":"（尤指苏格兰东海岸及英格兰东北部的）海雾；从海上吹来的又冷又湿的雾气"},"examples":[{"en":"A haar rolled in from the North Sea and covered the town by noon.","zh":"一阵海雾从北海涌来，到中午就把小镇笼罩住了。"},{"en":"The morning started sunny, but the haar quickly turned the beach gray and chilly.","zh":"早晨还阳光明媚，但海雾很快让海滩变得灰蒙蒙、冷飕飕的。"},{"en":"Drivers slowed down because the haar reduced visibility on the coastal road.","zh":"因为海雾降低了能见度，司机们在海岸公路上都放慢了速度。"}]}],"synonyms":["sea fog","coastal fog","mist","sea mist"],"phonetic":"/hɑr/","extraExplanation":["“haar”是一个带有强烈地域色彩的词，常见于英国（尤其苏格兰）天气描写中，指冷湿的海雾。来源通常认为与古诺尔斯语/斯堪的纳维亚语系有关，因此在北海沿岸更常用。","在文学与旅游写作里，“haar”常用来营造阴冷、朦胧的海边氛围；日常英语里更常用的说法是“sea fog / coastal fog / mist”。"]}
{"word":"haars","summary":{"en":"“Haars” means cold coastal sea fogs (plural of “haar”), especially in Scotland/NE England.","zh":"“haars”指寒冷的沿海海雾（“haar”的复数），尤见于苏格兰/英格兰东北部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “haar”: a cold, thick sea fog (often from the North Sea) that drifts onto the land, especially in Scotland and northeastern England.","zh":"“haar”的复数：一种寒冷、浓厚的海雾（常来自北海）飘到陆地上，尤指苏格兰和英格兰东北部一带。"},"examples":[{"en":"In spring, haars can roll in from the sea and make the coast feel suddenly chilly.","zh":"在春天，海雾（haars）会从海上涌来，让海岸突然变得很冷。"},{"en":"The morning haars hid the lighthouse until the sun warmed the air.","zh":"清晨的海雾把灯塔遮住了，直到太阳把空气晒暖。"}]}],"synonyms":["sea fog","coastal fog","sea mist"],"phonetic":"/hɑrz/","extraExplanation":["“haar”是带有地域色彩的词，常见于描写苏格兰/英格兰东北海岸天气的文学与新闻中；在美国英语里更常用的说法是“sea fog / coastal fog”。","与之相关的近义表达有：sea mist（海雾/海霭，偏轻薄）、fog（雾，泛指）、mist（薄雾）。在语感上，“haar”更偏“冷、湿、从海上来的浓雾”。"]}

