{"word":"hab","summary":{"en":"“Hab” is an informal abbreviation meaning either “habit” or “habitat,” and it can also refer to the Montreal Canadiens (more often “Habs”).","zh":"“hab”多为非正式缩写，可指“habit（习惯）”或“habitat（栖息地）”，也可指蒙特利尔加拿大人队（更常写作“Habs”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “habit” (a repeated behavior), used mainly in notes, texting, or jargon.","zh":"（非正式）“habit（习惯）”的缩写，多见于笔记、短信或特定圈内用语。"},"examples":[{"en":"I’m trying to break a bad hab of checking my phone at night.","zh":"我在努力改掉晚上刷手机的坏习惯。"},{"en":"Good hab: drink water before coffee.","zh":"好习惯：先喝水再喝咖啡。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially ecology/gaming) Short for “habitat” (the natural home of an animal or plant).","zh":"（非正式，尤用于生态/游戏）“habitat（栖息地）”的缩写，指动植物的自然生活环境。"},"examples":[{"en":"Protecting the wetland hab helps birds survive.","zh":"保护湿地栖息地有助于鸟类生存。"},{"en":"The quest marker shows the wolf hab on the map.","zh":"任务标记在地图上显示了狼的栖息地。"}]},{"partOfSpeech":"n.","definition":{"en":"(sports, mainly Canada) A Montreal Canadiens player or fan; more commonly seen as “Habs.”","zh":"（体育用语，主要在加拿大）指蒙特利尔加拿大人队（Montreal Canadiens）的球员或球迷；更常见写法是 “Habs”。"},"examples":[{"en":"The Habs play tonight—are you watching the game?","zh":"加拿大人队今晚比赛——你看吗？"},{"en":"He’s a lifelong Hab and never misses a home game.","zh":"他是终身加拿大人队球迷，从不缺席主场比赛。"}]}],"synonyms":["habit","habitat","Habs"],"phonetic":"/hæb/","extraExplanation":["“hab”单独出现并不算标准常用词，更像是口语/速记式缩写；正式写作里建议写全：habit / habitat。","体育里的“Habs”来自法语称呼“Les Habitants”（早期对当地居民/球队的称呼），因此更常见复数形式。"]}
{"word":"habab","summary":{"en":"“Habab” is generally not an English word; it is most often a name or an Arabic transliteration whose meaning depends on context.","zh":"“habab”通常不是英语单词；更常见为姓名/地名，或阿拉伯语音译词，具体含义需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often seen as a transliteration of an Arabic word (depending on context).","zh":"不是标准英语单词；常见于把阿拉伯语音译成拉丁字母时（具体含义取决于语境）。"},"examples":[{"en":"I saw “habab” in a chat message, but it wasn’t clear what language it was.","zh":"我在聊天消息里看到了“habab”，但不确定它是哪种语言。"},{"en":"In English text, “Habab” may appear as a name (a person, family name, or place).","zh":"在英文文本里，“Habab”可能作为名字出现（人名、姓氏或地名）。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Arabic transliterations, “habāb/ḥabāb” can refer to “bubbles/foam” (meanings vary by dialect and spelling).","zh":"在一些阿拉伯语音译中，“habāb/ḥabāb”可指“气泡/泡沫”（不同方言与拼写含义可能不同）。"},"examples":[{"en":"The word was explained as referring to bubbles on the surface of water.","zh":"有人解释说这个词指水面上的气泡。"},{"en":"Different spellings (habab, habaab, habāb) can point to the same Arabic source word.","zh":"不同拼写（habab、habaab、habāb）可能指向同一个阿拉伯语词源。"}]}],"synonyms":["transliteration","name"],"phonetic":"/həˈbɑb/","extraExplanation":["“habab”更像是阿拉伯语的拉丁字母转写，而不是英语词汇。因为阿拉伯语里有一些辅音（如 ح/ḥ）英文没有完全对应的音，所以转写时常出现多种拼法（habab / ḥabab / habaab 等），含义也可能随方言变化。","如果你是在特定句子、歌词、聊天语境里看到它，发我完整句子或来源（哪国/哪种语言），我可以更准确判断它的意思与用法。"]}
{"word":"habaera","summary":{"en":"Habanera is a slow Cuban dance and its syncopated music.","zh":"habanera 指源自古巴的慢速舞蹈及其带切分节奏的舞曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slow, rhythmic Cuban dance and the music for it, usually in 2/4 time with a distinctive syncopated beat","zh":"哈巴涅拉舞；哈巴涅拉舞曲（源自古巴的一种节奏鲜明、带切分律动的慢速舞蹈及其音乐）"},"examples":[{"en":"They danced the habanera with small, controlled steps and a strong hip rhythm.","zh":"他们跳哈巴涅拉时步伐小而稳，胯部节奏很强。"},{"en":"In class, we listened to a habanera to practice counting the syncopated beat.","zh":"课堂上我们听了一段哈巴涅拉，用来练习数切分节奏。"},{"en":"The opera includes a famous habanera aria that many people recognize instantly.","zh":"这部歌剧里有一段著名的“哈巴涅拉”咏叹调，很多人一听就认得出来。"}]}],"synonyms":["Cuban dance","dance rhythm","Latin dance (broad)"],"phonetic":"/ˌhɑːbəˈnɛrə/","extraExplanation":["你输入的“habaera”更常见的拼写是 **habanera**。它来自西班牙语，字面意思与“哈瓦那（Havana）的人/风格”有关，和古巴的舞蹈与音乐传统紧密相连。","文学与音乐文化中最有名的例子之一，是比才歌剧《卡门》（Carmen）里的咏叹调 **“L’amour est un oiseau rebelle”**，常被称为“哈巴涅拉”。","相关词：**tango**（探戈，常更戏剧化）、**bolero**（波莱罗，常更抒情）、**rumba**（伦巴，古巴舞曲的一类）。"]}
{"word":"habakkuk","summary":{"en":"Habakkuk is a biblical prophet and also the name of a short Old Testament book traditionally linked to him.","zh":"Habakkuk（哈巴谷）既指旧约中的一位先知，也指与他相关的一卷短篇旧约经书《哈巴谷书》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prophet in the Hebrew Bible (Old Testament), traditionally believed to have written the Book of Habakkuk.","zh":"《希伯来圣经》（旧约）中的一位先知，传统上被认为是《哈巴谷书》的作者。"},"examples":[{"en":"Habakkuk is remembered for asking why injustice is allowed to continue.","zh":"哈巴谷以追问“为何不公仍被容许存在”而为人所知。"},{"en":"In the Bible study, we discussed Habakkuk’s dialogue with God.","zh":"在查经时，我们讨论了哈巴谷与上帝的对话。"}]},{"partOfSpeech":"n.","definition":{"en":"The Book of Habakkuk, a short biblical text in the Old Testament (one of the Minor Prophets).","zh":"《哈巴谷书》：旧约中的一卷短篇经书（“小先知书”之一）。"},"examples":[{"en":"Our reading this week is Habakkuk, especially chapter 2.","zh":"我们这周读《哈巴谷书》，尤其是第二章。"},{"en":"The phrase “the righteous shall live by faith” is famously associated with Habakkuk.","zh":"“义人必因信得生”这句话常与《哈巴谷书》联系在一起。"}]}],"synonyms":["the Book of Habakkuk","Minor Prophets"],"phonetic":"/həˈbækək/","extraExplanation":["“Habakkuk”在英文里通常作为专有名词使用，因此在写作中多半首字母大写（Habakkuk）。中文常译作“哈巴谷”。","《哈巴谷书》的文学特点之一是以提问与回应的形式展开：先知向上帝提出关于邪恶与苦难的疑问，随后出现回应与盼望的信息。","在英语语境中，人们有时会引用《哈巴谷书》2:4（常见译法：the righteous shall live by his faith）来谈“信心/信仰与坚持”。"]}
{"word":"habanera","summary":{"en":"A habanera is a Cuban-origin dance and musical style with a distinctive dotted rhythm, often associated with Spanish and classical music.","zh":"habanera 指一种起源于古巴、带典型附点节奏的舞曲与音乐风格，常见于西班牙语与古典音乐语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Spanish dance and music style in 2/4 time, originally from Cuba, with a distinctive dotted rhythm","zh":"哈巴涅拉舞／哈巴涅拉曲：一种节奏鲜明、通常为2/4拍的西班牙语系舞曲与音乐风格，起源于古巴，常带有附点节奏"},"examples":[{"en":"The opera includes a famous habanera sung by the main character.","zh":"这部歌剧里有一段主角演唱的著名哈巴涅拉唱段。"},{"en":"The pianist played a habanera rhythm with a steady, dancing feel.","zh":"钢琴家弹出了哈巴涅拉的节奏，稳定而有舞蹈感。"}]}],"synonyms":["dance","dance tune","rhythm"],"phonetic":"/ˌhɑːbəˈnɛrə/","extraExplanation":["“Habanera”来自西班牙语，意为“哈瓦那的（舞/歌）”，与古巴首都哈瓦那（La Habana）有关。","在西方古典音乐语境中，最著名的例子之一是比才歌剧《卡门》（Carmen）中的唱段《哈巴涅拉》（“L’amour est un oiseau rebelle”）。","在音乐学习中，常用“habanera rhythm”指一种典型节型：长—短—长—长（常写作附点八分音符—十六分音符—两个八分音符的感觉），能带来摇摆、行进般的律动。"]}
{"word":"habaneras","summary":{"en":"“Habaneras” is the plural of “habanera,” a Cuban-origin dance and music style with a distinctive rhythm.","zh":"“habaneras”是“habanera”的复数，指源自古巴、节奏鲜明的哈巴涅拉舞曲／舞蹈风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lively dance and musical style in slow duple time (often with a distinctive “long–short–long–long” rhythm), originally from Cuba and popular in Spain and beyond in the 1800s.","zh":"哈巴涅拉舞曲／哈巴涅拉舞（一种源自古巴的舞曲与舞蹈风格，通常为较慢的二拍子，并常带有“长—短—长—长”的典型节奏；19世纪在西班牙等地流行）。"},"examples":[{"en":"Bizet used a habanera rhythm in the famous aria “L’amour est un oiseau rebelle.”","zh":"比才在著名咏叹调《爱情是一只自由的小鸟》中运用了哈巴涅拉的节奏。"},{"en":"They played habaneras at the festival, and some people even danced along.","zh":"音乐节上演奏了哈巴涅拉舞曲，有些人还跟着跳了起来。"}]}],"synonyms":["Cuban dance","dance rhythm"],"phonetic":"/ˌhɑːbəˈnɛrəz/","extraExplanation":["“habanera”来自西班牙语，意思与“哈瓦那（Havana）”有关，常被理解为“来自哈瓦那的（音乐/舞蹈）”。它在19世纪从古巴传播到西班牙，并影响了后来的探戈等拉丁音乐风格。","英语里你输入的“habaneras”是复数形式：one habanera（一个哈巴涅拉舞曲/段落），two habaneras（两首/两段）。在音乐语境中也常指“几段哈巴涅拉节奏/作品”。"]}
{"word":"habban","summary":{"en":"Habban is an Old English verb meaning “to have; to possess/hold,” the historical source of modern English have.","zh":"habban 是古英语动词，意思是“拥有；持有”，是现代英语 have 的历史来源。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Old English; archaic) to have; to possess or hold.","zh":"（古英语；古义）拥有；持有；占有。"},"examples":[{"en":"Old English: Ic habbe bōc. (From habban)","zh":"古英语：Ic habbe bōc.（源自动词 habban，意为“我有一本书”。）"},{"en":"In modern English, habban corresponds to “have.”","zh":"在现代英语中，habban 大致相当于 have（“有”）。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Old English; archaic) to keep, maintain, or hold on to (something).","zh":"（古英语；古义）保有；保存；维持；握住（某物）。"},"examples":[{"en":"Old English (gloss): Habbað þone frēodōm. ≈ “Keep the peace/freedom.”","zh":"古英语（释义）：Habbað þone frēodōm.≈“保持和平/保有自由。”"}]}],"synonyms":["have","possess","hold","keep"],"phonetic":"/ˈhɑːbɑn/","extraExplanation":["“habban”是古英语（Old English）里的动词词条形式，常见于古英语语法书/词典中；它在现代英语中演变为“have”。因此你通常不会在现代英文写作里用 habban，除非是在讨论古英语、历史语言学或引用古文本。","古英语的人称变化常见如：ic habbe（我有）、hē hæfð（他有）、wē habbað（我们有）。这些形式与现代英语 have/has 的对应关系，能帮助理解英语动词在历史上的变化。"]}
{"word":"habbe","summary":{"en":"“Habbe” is an archaic spelling of “have,” mainly found in Middle English or old-style writing.","zh":"“habbe”是“have”的古体拼写，主要出现在中古英语或仿古写作中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Archaic/Middle English spelling) “have”; used in older texts where spelling was not yet standardized.","zh":"（古英语/中古英语拼写）相当于现代英语的“have（有；拥有；已经）”，常见于早期英文文本中，当时拼写尚未统一。"},"examples":[{"en":"I habbe no silver ne gold. (old-style spelling)","zh":"I habbe no silver ne gold.（古体拼写：我没有金银。）"},{"en":"Modern English: I have no silver or gold.","zh":"现代英语：I have no silver or gold."},{"en":"In some old writings you may see “I habbe” where today we write “I have.”","zh":"在一些古老的文字里，你可能会看到“I habbe”，而现代写作中会写成“I have”。"}]}],"synonyms":["have","possess"],"phonetic":"/ˈhæbə/","extraExplanation":["“habbe”常被认为是中古英语里“have”的一种拼写（也可见到类似形式如“ich habbe”一类的古体表达）。在现代英语里几乎不用；如果你是在古文、手稿或仿古作品中看到它，通常直接按“have”的意思理解即可。","如果你本来想查的是现代常用词，可能是拼写误差：最常见的目标词是“have”（拥有；已经），也可能是人名/昵称（在某些语言或地区会出现）。"]}
{"word":"habble","summary":{"en":"Habble means to speak in a confused, stumbling way (to babble or stammer).","zh":"Habble 指说话含混、结结巴巴或语无伦次（类似 babble / stammer）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to speak in a confused, stumbling way; to babble or stammer","zh":"（说话）含混不清、结结巴巴；语无伦次地嘟囔/胡扯"},"examples":[{"en":"Nervous in front of the class, he began to habble and lost his place.","zh":"在全班同学面前紧张起来，他开始结结巴巴，说着说着就忘词了。"},{"en":"She habbled an apology, but no one could quite understand it.","zh":"她含含糊糊地道了个歉，但大家都没太听懂。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to confuse or muddle by talking; to talk at in a rambling way","zh":"（不常用）用絮叨/胡乱的话把人说糊涂；喋喋不休地说"},"examples":[{"en":"He tried to explain, but only habbled the issue further.","zh":"他想解释，却把问题越说越糊涂。"}]}],"synonyms":["babble","stammer","mumble","gabble","ramble"],"phonetic":"/ˈhæbəl/","extraExplanation":["“habble”在现代英语里非常少见，多见于方言或较旧的文字中；日常更常用的是“babble”“stammer”“mumble”。","它的感觉接近“babble（胡言乱语）”和“gabble（急促地乱说）”，通常带有“紧张、慌乱、说不清”的语气。"]}
{"word":"habbub","summary":{"en":"A habbub (more commonly spelled haboob) is a powerful desert dust storm.","zh":"habbub（更常见拼作 haboob）指一种强烈的沙漠沙尘暴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Also spelled haboob) a strong dust storm common in deserts, especially in the Middle East and the U.S. Southwest.","zh":"（也拼作 haboob）哈布布：一种强烈的沙尘暴，常见于沙漠地区，尤其是中东和美国西南部。"},"examples":[{"en":"A haboob rolled into Phoenix and turned the sky brown within minutes.","zh":"一场哈布布沙尘暴席卷到凤凰城，几分钟内天空就变成了棕色。"},{"en":"Drivers pulled over because the haboob made it hard to see the road.","zh":"因为哈布布沙尘暴让能见度很差，司机们把车停到路边。"}]}],"synonyms":["haboob","dust storm","sandstorm"],"phonetic":"/həˈbuːb/","extraExplanation":["“haboob/ habbub”来自阿拉伯语 هبوب（habūb），意思与“吹起的风、突然刮起”相关，常用来描述墙状推进的沙尘暴。英语里更常见的拼写是 **haboob**，而 **habbub** 多被视为不常见拼写或误拼。"]}
{"word":"habdalah","summary":{"en":"Havdalah is a Jewish end-of-Shabbat ceremony marking the transition from the holy day to the regular week.","zh":"Havdalah（哈夫达拉）是犹太教在安息日结束时举行的仪式，用来标志从圣日过渡到日常一周。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish ceremony held at the end of Shabbat (the Sabbath) that marks the separation between the holy day and the ordinary week, usually using blessings over wine, fragrant spices, and a braided candle.","zh":"犹太教在安息日（Shabbat）结束时举行的仪式，用来“区分/分别”圣日与平日；通常包括对酒、香料与编织蜡烛的祝福。"},"examples":[{"en":"We stayed for Havdalah after Shabbat dinner.","zh":"安息日晚餐后，我们留下来参加哈夫达拉（Havdalah）仪式。"},{"en":"During Havdalah, they held a braided candle and recited blessings over wine and spices.","zh":"在哈夫达拉仪式中，他们点燃编织蜡烛，并为酒与香料诵读祝福。"}]}],"synonyms":["end-of-Shabbat ceremony","Shabbat closing ritual","separation ceremony"],"phonetic":"/hɑvˈdɑlə/","extraExplanation":["“Havdalah”（常见拼写也有“Habdalah”）来自希伯来语，核心含义是“分别/区分”。仪式通常在周六夜晚、安息日结束后进行。","常见元素：一杯葡萄酒（或葡萄汁）、象征平日工作重新开始的编织蜡烛、以及香料盒（闻香用来带来安慰与振奋）。","在英语语境里，它多用于宗教/文化描述（如家庭、会堂活动或文学作品中的安息日场景）。"]}
{"word":"habdalahs","summary":{"en":"Havdalah is a Jewish ceremony that ends Shabbat and separates it from the regular week.","zh":"Havdalah 是犹太教在安息日结束时举行的仪式，表示从圣日进入平日。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Havdalah: a Jewish ceremony held at the end of Shabbat (the Sabbath) to mark the separation between the holy day and the regular week, usually using wine, spices, and a braided candle.","zh":"哈夫达拉（Havdalah）：犹太教在安息日（Shabbat）结束时举行的仪式，用来标志圣日与平日的“分别/区分”，通常会用到葡萄酒、香料和编织蜡烛。"},"examples":[{"en":"After Shabbat dinner on Saturday night, our family does Havdalah with a candle and spices.","zh":"周六晚上安息日用餐后，我们家会用蜡烛和香料来做哈夫达拉仪式。"},{"en":"The Havdalah blessing marks the transition back to the everyday week.","zh":"哈夫达拉的祝福词标志着回到日常一周的开始。"}]}],"synonyms":["Jewish end-of-Shabbat ceremony"],"phonetic":"/hɑːvˈdɑːlə/","extraExplanation":["你输入的“habdalahs”很可能是拼写变体或拼错了“havdalah”。英语里通常写作 Havdalah（也可见 Havdala/Habdalah 等转写），来源是希伯来语，意思是“分开、区分”。","复数一般写作 Havdalahs（表示“多次哈夫达拉仪式”或“不同场合的哈夫达拉”）。"]}
{"word":"habe","summary":{"en":"“habe” is German for “I have,” not an English word.","zh":"“habe”是德语“我有/我已经……”，不是英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“habe” is a German word meaning “I have” (first-person singular of the verb “haben”). It is not a standard English word.","zh":"“habe”是德语，意思是“我有/我已经……”（动词“haben”的第一人称单数）。它不是标准英语单词。"},"examples":[{"en":"Ich habe ein Buch. (German) = I have a book.","zh":"Ich habe ein Buch.（德语）= 我有一本书。"},{"en":"Ich habe gegessen. (German) = I have eaten / I ate.","zh":"Ich habe gegessen.（德语）= 我吃过了 / 我吃了。"}]}],"synonyms":["have"],"phonetic":"/ˈhɑːbə/","extraExplanation":["“habe”常见于德语日常表达：Ich habe…（我有……）或 Ich habe + 过去分词（完成时，表示“已经……”）。\n学习英语时，如果你想表达同样意思，通常用 “I have … / I’ve …”。很多人会把“habe”误写成英语的 “have”。"]}
{"word":"habeas","summary":{"en":"“Habeas” is a legal term, usually short for “habeas corpus,” meaning a court order/petition to review whether someone’s detention is lawful.","zh":"“Habeas”是法律用语，通常是“habeas corpus（人身保护令）”的简称，指法院用来审查拘押是否合法的令状/申请。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) Short for “habeas corpus”: a court order (writ) requiring that a detained person be brought before a judge so the court can decide whether the detention is legal.","zh":"（法律）“habeas corpus（人身保护令）”的简称：法院发出的命令（令状），要求将被拘押者带到法官面前，以审查拘押是否合法。"},"examples":[{"en":"His lawyer filed a habeas petition to challenge the imprisonment.","zh":"他的律师提交了人身保护令（habeas）申请来质疑这次监禁是否合法。"},{"en":"The judge granted habeas relief and ordered a new hearing.","zh":"法官准许人身保护令救济，并下令重新举行听证。"},{"en":"The case raised questions about access to habeas for detainees.","zh":"这起案件引发了关于被拘押者是否能获得人身保护令救济的讨论。"}]}],"synonyms":["habeas corpus","writ of habeas corpus","habeas petition"],"phonetic":"/ˈheɪbiəs/","extraExplanation":["“Habeas”来自拉丁语，常见完整形式是“habeas corpus”，直译接近“你应当带来（此人身）”。现代英语里单独说“habeas”多出现在美国法律语境，指“habeas corpus petition / writ”。","它的核心作用是让法院审查政府或机构的拘押是否有合法依据，因此常与“due process（正当程序）”“unlawful detention（非法拘禁）”等概念一起出现。","学习时注意：日常英语里很少单独用“habeas”，更常见的说法是完整的“habeas corpus”。"]}
{"word":"habena","summary":{"en":"Habena is a rare, formal word meaning a rein or a rein-like band (sometimes in anatomical naming).","zh":"Habena 是一个罕见而正式的词，意为“缰绳”，也可指“缰绳状的带状结构”（有时见于解剖学命名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, formal) A rein; a strap or band used to guide or control something (especially a horse).","zh":"（罕见，正式）缰绳；用来引导或控制的带子/束带（尤指马的缰绳）。"},"examples":[{"en":"The rider tightened the habena to slow the horse.","zh":"骑手收紧缰绳（habena）让马慢下来。"},{"en":"In older texts, “habena” may appear as a poetic word for a rein.","zh":"在较早的文本中，“habena”可能作为“缰绳”的诗性用词出现。"}]},{"partOfSpeech":"n.","definition":{"en":"(anatomy, rare) A band- or rein-like structure; used in names for narrow connective or nerve-like bands.","zh":"（解剖，罕见）形似缰绳的带状结构；用于某些狭长结缔组织或神经样束带的命名。"},"examples":[{"en":"Some anatomical terms use Latin-style words like habena for a rein-like band.","zh":"一些解剖学术语会用类似拉丁语的词，如 habena，来指“缰绳状”的束带。"}]}],"synonyms":["rein","strap","band"],"phonetic":"/həˈbiːnə/","extraExplanation":["“Habena”来自拉丁语，原意是“缰绳、牵引带”。因此在英语里它多见于较古旧、文学化或学术化（尤其是命名）语境。","你可能更常见到相关词：habenular / habenula（“小缰绳”之意），常用于神经解剖学术语，如 the habenula（缰核）。"]}
{"word":"habenal","summary":{"en":"Habernal (often misspelled as “habenal”) means “relating to winter; wintry.”","zh":"Habernal（常被误拼为“habenal”）意为“与冬季有关的；冬天的；寒冬般的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to winter; wintry.","zh":"（罕见）与冬季有关的；冬天的；寒冬般的。"},"examples":[{"en":"The valley took on a habernal silence after the first snowfall.","zh":"第一场雪后，山谷呈现出一种冬日般的寂静。"},{"en":"They prepared for habernal weather with extra blankets and hot tea.","zh":"他们用额外的毯子和热茶来应对寒冬天气。"}]}],"synonyms":["wintry","wintery","hibernal","winter","cold-season"],"phonetic":"/həˈbɝːnəl/","extraExplanation":["“habenal”在英语里不常见；更可能是拼写误差，常见的对应词是 **habernal**（意为“冬季的、寒冷的”）。","**Habernal** 源自拉丁语 *hibernus*（“冬天的”），和 **hibernate**（冬眠）同源。现代英语中更常用 **wintry / wintery**、**winter**（作形容词）、或 **hibernal**（也表示“冬季的”，但更常见于书面/科学语境，如“hibernal dormancy”冬季休眠）。","如果你原本想查的是别的词（例如人名、地名、或其他语言的词），告诉我上下文/完整句子，我可以帮你定位正确拼写和意思。"]}
{"word":"habenar","summary":{"en":"Habanera is a slow Cuban dance and a music style/song associated with a distinctive rhythm from Havana.","zh":"Habanera 指源自古巴、与哈瓦那相关的一种缓慢舞曲及其音乐风格/歌曲，特点是独特的节奏型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slow Cuban dance in 2/4 time with a distinctive rhythm (often linked to Havana).","zh":"一种源自古巴的缓慢舞曲（2/4拍），节奏型很有辨识度（常与哈瓦那相关）。"},"examples":[{"en":"The tango was influenced by the habanera rhythm.","zh":"探戈受到哈巴涅拉（habanera）节奏的影响。"},{"en":"They learned a simple habanera step in dance class.","zh":"他们在舞蹈课上学了一个简单的哈巴涅拉舞步。"}]},{"partOfSpeech":"n.","definition":{"en":"a piece of music written in the style of a habanera (often sung or played as a song).","zh":"以哈巴涅拉风格写成的一段音乐（常以歌曲形式演唱或演奏）。"},"examples":[{"en":"Bizet’s famous “Habanera” is sung in the opera Carmen.","zh":"比才在歌剧《卡门》中那首著名的《哈巴涅拉》非常经典。"},{"en":"The pianist performed a habanera with a gentle, swaying beat.","zh":"钢琴家演奏了一首哈巴涅拉，节拍温柔而摇曳。"}]}],"synonyms":["Cuban dance","Latin dance (general)","dance rhythm"],"phonetic":"/ˌhɑːbəˈnɛrə/","extraExplanation":["你输入的“habenar”更常见的拼写可能是 **habanera**（哈巴涅拉）。它来自西班牙语，字面意思与“哈瓦那（Havana）”有关。","哈巴涅拉的节奏型对拉丁音乐影响很大，后来也影响了探戈等音乐风格；在英语文化语境里，很多人第一次接触这个词是通过歌剧《卡门》里的名曲《Habanera》。"]}
{"word":"habenaria","summary":{"en":"Habenaria is a genus of orchids, commonly known as rein orchids.","zh":"Habenaria 是一种兰科植物属，常被称为“rein orchids（流苏兰类）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of orchids (family Orchidaceae), often called rein orchids, found in many parts of the world","zh":"一种兰科植物属（Habenaria，常称“流苏兰/兜兰类的rein orchids”），分布于世界多地"},"examples":[{"en":"Habenaria orchids often grow in moist meadows and woodland edges.","zh":"Habenaria 属的兰花常生长在潮湿的草地和林缘。"},{"en":"The botanist recorded a Habenaria species during the summer survey.","zh":"植物学家在夏季调查中记录到一种 Habenaria 属植物。"}]}],"synonyms":["rein orchid (common name)","orchid (general category)"],"phonetic":"/ˌhæbəˈnɛriə/","extraExplanation":["词源：Habenaria 来自拉丁语 *habena*（“缰绳、带子”），常被认为与该属一些花部结构细长如带状有关。","用法提示：在英语里它通常作为学名使用，首字母大写（Habenaria），斜体常见于正式写作；指“该属”或“该属的一种植物”。"]}
{"word":"habendum","summary":{"en":"A legal clause in a deed or lease that defines the rights or interest being granted, often starting with “to have and to hold.”","zh":"契据或租约中的法律条款，用来界定授予的权利或财产权性质，常以“to have and to hold”开头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) The clause in a deed or lease that states what rights, interest, or estate is being granted—often introduced by “to have and to hold.”","zh":"（法律）契据或租赁合同中的“持有/享有条款”，用来说明授予的权利、利益或财产权性质（常以“to have and to hold”引出）。"},"examples":[{"en":"The lawyer checked the habendum to confirm the buyer received a fee simple estate.","zh":"律师查看了 habendum 条款，以确认买方取得的是完全所有权（fee simple）。"},{"en":"In the lease, the habendum specifies how long the tenant may hold the property.","zh":"在租约中，habendum 会说明承租人可以持有（使用）该房产多久。"}]}],"synonyms":["to-have-and-to-hold clause","tenure clause","grant clause (related)"],"phonetic":"/həˈbɛndəm/","extraExplanation":["habendum 来自拉丁语 habendum（意为“将要持有/应当持有”）。在英美不动产法律文件里，habendum 通常紧跟在“granting clause（授予条款）”之后，用来进一步限定“授予了什么、给谁、以什么形式、多久”等。","常见固定搭配是 “to have and to hold”（意为“由某人持有并享有”），在婚礼誓词里也会出现，但在法律语境中更偏向正式的财产或权利授予表述。"]}
{"word":"habenula","summary":{"en":"The habenula is a small brain structure linked to reward/aversion and mood-related circuits.","zh":"缰核是脑内一个小结构，与奖励/厌恶及情绪相关的神经回路有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small structure in the brain (part of the epithalamus), involved in linking the limbic system with midbrain areas and helping regulate reward, aversion, mood, and some types of learning.","zh":"脑内一个小结构（位于上丘脑/上丘脑区的一部分），与边缘系统和中脑通路相连，参与奖励与厌恶反应、情绪调节以及某些学习过程。"},"examples":[{"en":"Some studies suggest the habenula helps the brain learn from disappointment or negative outcomes.","zh":"一些研究认为，缰核有助于大脑从失望或负面结果中学习。"},{"en":"In neuroanatomy, the habenula is often discussed together with dopamine and serotonin pathways.","zh":"在神经解剖学中，缰核常与多巴胺和血清素通路一起讨论。"}]}],"synonyms":["habenular nucleus","habenulae (plural)","lateral habenula","medial habenula"],"phonetic":"/ˌhæbəˈnuːlə/","extraExplanation":["“habenula”源自拉丁语，原意接近“小缰绳/小缰带”（habenula = little rein），形象地指一种“连接/束带”样的结构。","在科研与医学语境里，常见搭配是“lateral habenula（外侧缰核）”和“medial habenula（内侧缰核）”。其中外侧缰核在“厌恶/负性预测误差（事情比预期更糟）”相关研究中尤其常被提到。"]}
{"word":"habenulae","summary":{"en":"Habenulae are the plural form of *habenula*, most often referring to the pair of small brain structures involved in reward/aversion processing.","zh":"Habenulae 是 *habenula* 的复数，最常指大脑中的一对缰核结构，参与奖赏/厌恶等信息的处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the paired small structures in the brain (part of the epithalamus) that connect forebrain/limbic areas with midbrain systems; they are involved in processing reward, motivation, and aversion","zh":"脑内一对小结构（属丘脑上部/上丘脑的一部分），连接前脑/边缘系统与中脑通路；与奖赏、动机和厌恶等情绪与学习过程有关"},"examples":[{"en":"Researchers studied how the habenulae respond to negative outcomes.","zh":"研究人员考察了缰核在负面结果出现时的反应。"},{"en":"Signals from the habenulae can influence dopamine and serotonin activity.","zh":"来自缰核的信号会影响多巴胺和血清素的活动。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of *habenula*: a small, strap-like part or “little rein” in anatomy (for example, a small band of tissue connecting or guiding another structure)","zh":"*habenula* 的复数：解剖学中指细小带状结构，像“缰绳”一样起连接或牵引、引导作用的组织"},"examples":[{"en":"The anatomy text mentions several tiny habenulae as connective bands.","zh":"这本解剖学教材提到若干细小的带状组织（habenulae）作为连接带。"}]}],"synonyms":["habenulas","habenular nuclei"],"phonetic":"/həˈbɛn.jəˌliː/","extraExplanation":["词源来自拉丁语 *habēnula*，意为“细小的缰绳/小缰绳”（*habēna* = 缰绳）。在神经科学语境中，*habenulae* 通常特指“左右缰核”这一对脑区；而在更广义的解剖学语境中，也可指任何形似小带子的连接结构。"]}
{"word":"habenular","summary":{"en":"Habenular means “related to the habenula,” a small brain area involved in reward and emotion-related processing.","zh":"habenular 指“与缰核有关的”，缰核是与奖赏、情绪等处理相关的大脑小结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the habenula, a small brain structure involved in processing reward, motivation, and negative outcomes.","zh":"与缰核（habenula）有关的；缰核的。缰核是大脑中的一个小结构，常与奖赏、动机以及对负面结果的处理有关。"},"examples":[{"en":"Researchers found differences in habenular activity in people with depression.","zh":"研究人员发现抑郁症患者的缰核活动存在差异。"},{"en":"The paper discusses habenular circuits and how they influence decision-making.","zh":"这篇论文讨论了缰核回路以及它们如何影响决策。"}]}],"synonyms":["habenula-related","of the habenula"],"phonetic":"/həˈbɛn.jə.lɚ/","extraExplanation":["“Habenular”是一个比较专业的解剖/神经科学形容词，常见于学术文章（如fMRI研究、动物实验）中。词根来自拉丁语“habenula”（意为“小缰绳/小带子”），因为缰核附近的结构形态像细带。日常英语里很少用，更多会直接说“the habenula / habenular nucleus / habenular pathway”。"]}
{"word":"habeo","summary":{"en":"Habeo is a Latin verb meaning “I have,” and by extension “I hold/keep” or “I consider/regard.”","zh":"habeo 是拉丁语动词，基本义为“我有”，并可引申为“我拿着/保管”或“我认为/视为”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) “I have; I possess.” Used to talk about having/owning something.","zh":"（拉丁语）“我有；我拥有。”用于表达拥有某物。"},"examples":[{"en":"Latin: Habeo librum. (I have a book.)","zh":"拉丁语：Habeo librum.（我有一本书。）"},{"en":"Latin: Habeo duas sorores. (I have two sisters.)","zh":"拉丁语：Habeo duas sorores.（我有两个姐妹。）"}]},{"partOfSpeech":"v.","definition":{"en":"(Latin) “I hold; I keep; I carry.” Used for physically holding/keeping something or keeping it with you.","zh":"（拉丁语）“我拿着；我保管；我携带。”可指手里拿着、保存或随身带着。"},"examples":[{"en":"Latin: Habeo clavem. (I’m holding/keeping the key.)","zh":"拉丁语：Habeo clavem.（我拿着/保管着钥匙。）"},{"en":"Latin: Habeo te in corde. (I hold you in my heart.)","zh":"拉丁语：Habeo te in corde.（我把你放在心里/铭记于心。）"}]},{"partOfSpeech":"v.","definition":{"en":"(Latin) “I consider; I regard.” Used to express an opinion about someone or something (often with an object + complement).","zh":"（拉丁语）“我认为；我把……看作……。”用于表达看法或评价（常见“宾语＋补语”的结构）。"},"examples":[{"en":"Latin: Te amicum habeo. (I consider you a friend.)","zh":"拉丁语：Te amicum habeo.（我把你当作朋友。）"},{"en":"Latin: Hoc verum habeo. (I consider this true.)","zh":"拉丁语：Hoc verum habeo.（我认为这是真的。）"}]}],"synonyms":["possess","hold","keep","regard","consider"],"phonetic":"/ˈhɑː.beɪ.oʊ/","extraExplanation":["“habeo”是拉丁语动词“habēre”的第一人称单数现在时，核心意思是“我有/我持有”。学拉丁语时常把它当作高频基础动词来背：habeo（我有）- habes（你有）- habet（他/她有）等。","它也出现在一些英语法律/文化用语中，例如 habeas corpus（人身保护令），字面可理解为“你应当有（被带来）身体/本人”，引申为“要求将被拘押者带到法庭审查拘押是否合法”。"]}
{"word":"haberdash","summary":{"en":"Haberdash is a rare word meaning to sell (or the goods sold) small sewing/clothing items, and sometimes menswear.","zh":"haberdash 较少见，指售卖（或所售）缝纫/服装用的小配件；有时也与男装销售相关。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to sell small items used in sewing or clothing, such as buttons, ribbons, needles, or (in some uses) men’s clothing","zh":"（罕用）售卖缝纫或服装用的小商品（如纽扣、丝带、针等）；在某些用法中也指售卖男装"},"examples":[{"en":"In the old market, a few shops still haberdash buttons and thread.","zh":"在老市场里，仍有几家店在卖纽扣和线。"},{"en":"His family once haberdashed menswear in a small town.","zh":"他家过去在一个小镇上做过男装生意。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) goods sold by a haberdasher; items like sewing notions and accessories","zh":"（罕用）杂货店/服饰辅料店所售之物；如缝纫小配件与服饰辅料"},"examples":[{"en":"The drawer was filled with haberdash—pins, hooks, and spare buttons.","zh":"抽屉里装满了各类辅料——别针、挂钩和备用纽扣。"}]}],"synonyms":["sell","supply","deal in","merchandise"],"phonetic":"/ˈhæbərˌdæʃ/","extraExplanation":["这个词在现代英语里不常单独用作动词或名词；你更常见到的是 haberdashery（英式英语里常指“服饰辅料/缝纫用品”，美式英语里也可指“男装用品”）以及 haberdasher（卖这些东西的商人/店主）。","文化语境小提示：在英国传统语境中，haberdashery 往往更偏“缝纫用品与辅料”；在美国语境中，有时会更偏“男装与配饰”。阅读时可结合上下文判断。"]}
{"word":"haberdasher","summary":{"en":"A haberdasher is a seller of men’s clothing and accessories (US), or sewing notions (often in the UK).","zh":"haberdasher 指出售男装及男士配饰的人/店（美式），或常指售卖缝纫辅料的小店（英式较常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or shop that sells men’s clothing and small clothing items such as hats, ties, socks, and gloves (in American English); in British English it often means a seller of sewing items like buttons, ribbons, and thread","zh":"（美式英语）男装店老板或出售男装及配饰（如帽子、领带、袜子、手套等）的人/店；（英式英语）常指出售缝纫用品（如纽扣、丝带、线等）的人/店"},"examples":[{"en":"He bought a tie from a local haberdasher.","zh":"他在当地的男装店买了一条领带。"},{"en":"In old movies, a haberdasher might also sell hats and gloves.","zh":"在老电影里，男装店往往也卖帽子和手套。"},{"en":"In British English, a haberdasher’s shop may carry buttons and sewing notions.","zh":"在英式英语里，haberdasher 的店里可能会卖纽扣和各种缝纫小物件。"}]}],"synonyms":["men’s outfitter","menswear shop","clothier","notions shop (UK sense)"],"phonetic":"/ˈhæbɚˌdæʃɚ/","extraExplanation":["这个词在美式与英式英语中的“卖什么”不完全一样：美国多指男装与男士配饰的零售商；英国传统上更偏“缝纫辅料/针线小百货”。读小说或看年代剧时要结合语境判断。","词源上与法语有关，早期指“兜售小商品的人”。因此它带有一种“传统老店/老行当”的文化气息，常出现在描写旧城区商业街或复古服饰文化的语境中。","文学与影视里常见的相关搭配有：a corner haberdashery（街角男装小店）、haberdasher’s window display（橱窗陈列），用于营造年代感。"]}
{"word":"haberdasheress","summary":{"en":"A dated word meaning a woman who runs or works in a haberdashery (a shop selling men’s clothing or small clothing goods).","zh":"旧用词，指经营或在服饰杂货店（卖男装、帽子及缝纫小物等）工作的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who sells men’s clothing, hats, or small clothing goods (like buttons, ribbons, and sewing items); a female haberdasher (dated).","zh":"（多为旧用）女服饰杂货商；女男装/帽子/缝纫小物（如纽扣、丝带等）商人；即 haberdasher 的女性形式。"},"examples":[{"en":"In the old shopping street, a haberdasheress sold ties, gloves, and hatbands.","zh":"在那条老商业街上，一位女服饰杂货商卖领带、手套和帽带。"},{"en":"The novel mentions a haberdasheress who knows every customer by name.","zh":"小说里提到一位女服饰杂货商，她能叫出每位顾客的名字。"}]}],"synonyms":["haberdasher (gender-neutral)","shopkeeper","clothier (sometimes)","milliner (hats; not the same)"],"phonetic":"/ˈhæbɚˌdæʃərəs/","extraExplanation":["“haberdasheress”是“haberdasher（服饰杂货商）+ -ess（女性后缀）”构成的词，带有明显的时代色彩。现代英语里更常用中性说法haberdasher或shopkeeper，也可能用clothing retailer等。","英式英语中haberdasher常指经营男装或服饰杂货的店家；在美式英语里，这个词整体较少见，更多出现在历史语境、文学作品或复古风格的描述中。"]}
{"word":"haberdasheries","summary":{"en":"“Haberdasheries” is the plural of “haberdashery,” meaning clothing/accessory shops (especially men’s) or, in UK use, sewing notions.","zh":"“Haberdasheries”是“haberdashery”的复数，可指男装及配饰店/男装杂货；在英式英语中也常指缝纫辅料（针线杂货）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) stores that sell clothing, especially men’s clothing and accessories; also the goods sold there.","zh":"（复数）卖服装的店（尤指男装及配饰店）；也可指所售卖的服装杂货。"},"examples":[{"en":"He stopped by a few haberdasheries to look for a tie and cufflinks.","zh":"他去几家男装配饰店逛了逛，想找领带和袖扣。"},{"en":"Old photos show haberdasheries on nearly every main street.","zh":"老照片显示几乎每条商业主街上都有男装配饰店。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural, less common in US; common in UK use) small sewing items such as buttons, needles, thread, ribbons, and zippers.","zh":"（复数；美式较少见，英式常见）缝纫小用品，如纽扣、针、线、丝带、拉链等。"},"examples":[{"en":"She bought haberdasheries like buttons and thread for the repair.","zh":"她买了纽扣和线等缝纫小物来修补。"},{"en":"The shop sells fabric on one side and haberdasheries on the other.","zh":"这家店一边卖布料，另一边卖缝纫辅料。"}]}],"synonyms":["men’s outfitter(s)","men’s shop(s)","clothier(s)","notions (UK sense)","sewing supplies"],"phonetic":"/ˈhæbɚˌdæʃɚiz/","extraExplanation":["“Haberdashery”在美式英语里多指“男装及配饰店/男装杂货”（如领带、帽子、手套等）；在英式英语里更常指“缝纫辅料/针线杂货”。同一个词在不同地区侧重点不同，读到时可结合上下文判断。","形式上，“haberdasheries”通常是复数：既可以指“多家店”，也可以泛指“多种商品/辅料”。"]}
{"word":"haberdashers","summary":{"en":"Haberdashers are people who sell men’s clothing and accessories; in British English it can also mean sellers of small sewing items.","zh":"Haberdashers 指售卖男装与配饰的商人；在英式英语中也可指售卖缝纫小杂货的商人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who sells men’s clothing and accessories (especially in British English, also small items like buttons, ribbons, and sewing supplies)","zh":"男装及配饰的店主/商人（英式英语中也常指售卖纽扣、丝带等小杂货或缝纫用品的商人）"},"examples":[{"en":"He bought a tie from a local haberdasher.","zh":"他在当地一家男装店买了一条领带。"},{"en":"In older British shops, haberdashers often sold buttons, needles, and ribbons.","zh":"在较早的英国商店里，haberdashers 常常也卖纽扣、针和丝带。"}]}],"synonyms":["menswear shopkeeper","outfitter","clothier","mercer (BrE, related)"],"phonetic":"/ˈhæbərˌdæʃər/","extraExplanation":["“Haberdashers” 是复数形式，单数是 “haberdasher”。在美式英语里，这个词比较偏旧或偏正式；日常更常说 “men’s clothing store” 或直接说 “a store that sells men’s clothes”。","词义在英美有差异：美式多指“男装及配饰商”；英式传统上更接近“杂货/缝纫小用品商”（haberdashery）。在阅读英国文学或老电影台词时尤其常见。"]}
{"word":"haberdashery","summary":{"en":"Haberdashery refers to a shop selling small sewing items, or the sewing notions themselves (buttons, thread, zippers, etc.).","zh":"Haberdashery 指售卖缝纫小用品的店铺，或这些缝纫辅料本身（如纽扣、针线、拉链等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shop that sells small sewing items (like buttons, needles, thread, zippers), and sometimes accessories","zh":"（英式常用）缝纫小用品店；（也指）售卖纽扣、针线、拉链等缝纫辅料的店，有时也卖一些配饰"},"examples":[{"en":"I stopped by the haberdashery to buy needles and thread.","zh":"我去那家缝纫辅料店买了针和线。"},{"en":"The old haberdashery on the corner still sells buttons in little drawers.","zh":"街角那家老缝纫辅料店还用小抽屉卖纽扣。"}]},{"partOfSpeech":"n.","definition":{"en":"the small sewing items sold in such a shop (haberdashery goods)","zh":"缝纫辅料；针线纽扣等小件缝纫用品（统称）"},"examples":[{"en":"The tailor keeps a box of haberdashery for quick repairs.","zh":"那位裁缝留着一盒缝纫辅料，方便快速修补。"},{"en":"You can find all kinds of haberdashery—zippers, ribbons, and pins—on this aisle.","zh":"这条过道里有各种缝纫辅料——拉链、丝带和别针。"}]}],"synonyms":["notions","notions shop","sewing supplies","trimmings"],"phonetic":"ˌhæbɚˈdæʃɚi","extraExplanation":["在英式英语里，haberdashery 通常更偏向“缝纫小用品/缝纫辅料（含店铺）”；在美式英语中更常见的对应说法是 notions（缝纫小物件）或 a notions shop。","词源与 haberdasher（旧时指卖帽子、丝带等小物件的商人）有关，所以在不同地区/时期也可能与“男装小配饰”（如领带、手套等）产生关联。阅读老小说或历史语境时，含义有时会更偏“服饰小配件店”。"]}
{"word":"haberdine","summary":{"en":"Haberdine is a strong, tightly woven fabric often used for coats and suits.","zh":"Haberdine 指一种结实、密织的布料，常用于外套和西装等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of strong, closely woven fabric, traditionally made of wool (sometimes cotton), often used for coats, suits, and uniforms","zh":"一种结实、织得很密的布料（传统上多为羊毛，也可为棉），常用于外套、西装或制服等"},"examples":[{"en":"The tailor recommended haberdine for a durable coat.","zh":"裁缝推荐用华达呢来做一件耐穿的外套。"},{"en":"Her vintage trench coat is made of haberdine.","zh":"她那件复古风衣是用华达呢做的。"}]}],"synonyms":["gabardine","twill (type of weave)"],"phonetic":"/ˈhæbɚˌdin/","extraExplanation":["“haberdine”常译作“华达呢”。它与“gabardine（华达呢/华达呢类斜纹布）”在拼写和发音上很像，日常英语里也常见gabardine更普遍；有时人们会把两者混用，但在材料史和服装语境中通常指类似的结实外套布料。","在文学与服装描写中，haberdine/gabardine常带有“耐磨、实用、偏正式或职业/制服感”的气质，比如风衣、军装或城市通勤外套。"]}
{"word":"habere","summary":{"en":"“Habere” is a Latin verb meaning “to have/hold,” and by extension “to keep/maintain” or “to consider/regard as.” It is a key root behind many English words.","zh":"“habere”是拉丁语动词，基本义为“拥有/持有”，并可引申为“保持/维持”或“认为/视为”。它也是许多英语词的常见词根。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to have; to possess; to hold.","zh":"（拉丁语）拥有；持有；握住。"},"examples":[{"en":"In Latin, “habere” means “to have,” as in “librum habēre” (to have a book).","zh":"在拉丁语中，“habere”意为“拥有”，例如“librum habēre”（拥有一本书）。"},{"en":"Some English words relate to this idea of “having,” like “habit” (something you ‘have’ regularly).","zh":"一些英语词与“拥有/持有”的概念有关，比如“habit”（习惯，指你经常“拥有”的行为）。"}]},{"partOfSpeech":"v.","definition":{"en":"(Latin) to keep; to maintain; to hold onto (an opinion, a state, or control).","zh":"（拉丁语）保持；维持；坚持（观点、状态或控制）。"},"examples":[{"en":"A Latin text might say someone “habēt spem” (keeps/has hope).","zh":"拉丁文中可能会说“habēt spem”（保持/拥有希望）。"},{"en":"In English, “to hold a belief” is similar in meaning to this use of “habere.”","zh":"英语里“hold a belief（坚持某种信念）”在意义上与这种用法相近。"}]},{"partOfSpeech":"v.","definition":{"en":"(Latin, broader use) to regard or consider (someone/something) as…","zh":"（拉丁语，延伸用法）把……看作；认为……是……"},"examples":[{"en":"Latin can use “habēre” in the sense of “consider,” like “eum amīcum habēre” (to regard him as a friend).","zh":"拉丁语中“habēre”也可表示“认为/视为”，如“eum amīcum habēre”（把他视为朋友）。"}]}],"synonyms":["(Latin) tenēre (to hold)","(Latin) possidēre (to possess)"],"phonetic":"/hɑˈbɛreɪ/","extraExplanation":["“habere”是一个重要的拉丁语词根，进入英语后常出现在派生词里：habit（习惯）、inhabit（居住在……）、exhibit（展示，原义有“拿出来让人看到”）、prohibit（禁止，原义有“拿到前面阻止”）等。理解“habere≈have/hold”能帮助你记忆这些词的核心感觉。","你可能在法律或格言中间接遇到它：例如“habeas corpus”（人身保护令）里的“habeas”来自同一词根，字面有“你应当有/带来（此人）”的意思。"]}
{"word":"habergeon","summary":{"en":"A habergeon is a sleeveless chain-mail shirt used as medieval armor.","zh":"habergeon 指中世纪使用的无袖锁子甲（链甲背心）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sleeveless shirt of chain mail (linked metal rings) worn as armor, especially in the Middle Ages.","zh":"（尤指中世纪的）锁子甲背心；无袖的链甲上衣。"},"examples":[{"en":"The museum displayed a habergeon next to a knight’s helmet.","zh":"博物馆把一件锁子甲背心和骑士头盔摆在一起展出。"},{"en":"In the novel, the guard pulled on his habergeon before the city gates opened.","zh":"小说里，守卫在城门打开前穿上了他的锁子甲背心。"}]}],"synonyms":["chain mail","mail shirt","hauberk (related)"],"phonetic":"/ˈhæbərˌdʒɑn/","extraExplanation":["这个词在现代英语里比较少见，多出现在历史题材、奇幻文学或游戏中。它通常指比“hauberk”（常带袖、可能更长的锁子甲）更短、无袖或较轻便的一种链甲。","词源来自中古法语，和表示“护颈/喉部保护”的词有历史关联，因此有时也会让人联想到对颈部与躯干的防护。"]}
{"word":"habet","summary":{"en":"“Habet” is not an English word; it’s usually Latin for “he/she/it has.”","zh":"“habet” 不是英语词，通常是拉丁语，意思是“他/她/它有”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most commonly seen as a Latin form meaning “(he/she/it) has,” from the verb “habere” (to have).","zh":"不是标准英语单词；最常见的是拉丁语形式，来自动词 habere（“拥有/有”），habet 表示“（他/她/它）有”。"},"examples":[{"en":"In Latin class, students learn that “habet” means “he/she/it has.”","zh":"在拉丁语课上，学生会学到 “habet” 的意思是“他/她/它有”。"},{"en":"The phrase “habeas corpus” is Latin; it is related to “habere” (to have), not an English verb form.","zh":"“habeas corpus（人身保护令）”是拉丁语，和 habere（拥有）有关，并不是英语动词形式。"}]}],"phonetic":"/ˈhɑː.bɛt/","extraExplanation":["你输入的 “habet” 很可能是拼写误差：如果你想查的是英语 “habit（习惯）”，请告诉我，我可以给出它的发音、词义、例句、同义词等。","“habet” 主要出现在拉丁语学习、法律术语或古典文本中；日常英语里不会用它表达“有”。"]}
{"word":"habilable","summary":{"en":"Habitable means “safe or suitable to live in” or “able to support life.”","zh":"Habitable 表示“适合居住的/可安全生存的（宜居的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Suitable or safe for people (or animals) to live in; able to support life.","zh":"适合居住的；（对人或动物）可安全生存的；宜居的。"},"examples":[{"en":"After repairs, the apartment was finally habitable.","zh":"修理后，这套公寓终于可以住人了。"},{"en":"Scientists are searching for habitable planets outside our solar system.","zh":"科学家正在寻找太阳系外适合生命居住的行星。"},{"en":"The house had no heat, so it wasn’t habitable in winter.","zh":"房子没有暖气，所以冬天不适合居住。"}]}],"synonyms":["livable","fit to live in","inhabitable (opposite)"],"phonetic":"/ˈhæbɪtəbəl/","extraExplanation":["“habilable”在英语里不常见，通常是把 **habitable** 拼错了。","**habitable** 来自拉丁语词根 *habitare*（居住），和 **habitat**（栖息地）、**inhabit**（居住于）有同源关系。","日常英语里更常说 “safe to live in / fit to live in”。在法律或房屋检查语境中，**habitable** 很常用（如 *a habitable home*）。"]}
{"word":"habilant","summary":{"en":"“Habitant” means a person (or animal) that lives in a particular place—an inhabitant.","zh":"“habitant”指居住在某地的人或动物，即“居民/栖居者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that lives in a particular place; an inhabitant.","zh":"居住在某地的人或动物；居民；栖居者。"},"examples":[{"en":"The forest is home to many inhabitants, including deer and owls.","zh":"这片森林是许多栖居者的家，包括鹿和猫头鹰。"},{"en":"Paris has millions of inhabitants.","zh":"巴黎有数百万居民。"}]}],"synonyms":["inhabitant","resident","dweller"],"phonetic":"/ˈhæbɪtənt/","extraExplanation":["“habilant”在英语中不是常见或标准拼写；你很可能想写的是 **habitant**（更常见写法）或 **inhabitant**。","在加拿大英语/历史语境中，**habitant** 也可特指“法裔加拿大的早期农民/定居者”，但在现代日常英语里通常就等同于 **inhabitant**（居民）。"]}
{"word":"habilatory","summary":{"en":"Habilatory is a rare adjective meaning “related to habilitation” (formal academic qualification) or more generally “qualifying/empowering for a role.”","zh":"habilatory 是个罕见形容词，主要指“与教授资格认证/学术任职资格（habilitation）有关”，也可泛指“使具备资格或能力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to habilitation; qualifying someone to teach or hold a formal academic position (especially in some European university systems).","zh":"（罕用）与“教授资格认证/学术任职资格”（habilitation）有关的；指使某人获得在大学任教或担任正式学术职位资格的。"},"examples":[{"en":"In some countries, a habilatory thesis is written after the PhD.","zh":"在一些国家，博士毕业后还需要撰写教授资格认证论文（habilatory thesis）。"},{"en":"The university introduced new habilatory requirements for senior lecturers.","zh":"这所大学为高级讲师设立了新的任职资格要求。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Giving or granting qualification, ability, or readiness for a role or task.","zh":"（罕用）使具备资格/能力/准备就绪的；赋予胜任条件的。"},"examples":[{"en":"The training served a habilatory function for new employees.","zh":"这项培训对新员工起到了“使其具备胜任能力”的作用。"},{"en":"Her mentorship was habilatory, helping interns become confident presenters.","zh":"她的指导具有“赋能”作用，帮助实习生成为自信的演讲者。"}]}],"synonyms":["qualifying","certifying","credentialing","enabling","empowering"],"phonetic":"/həˈbɪləˌtɔri/","extraExplanation":["“habilatory”在现代英语里非常少见，更多时候你会看到名词“habilitation”（教授资格认证/任职资格认证）以及相关搭配：habilitation thesis（资格论文）、to obtain/gain habilitation（获得资格）。","它常出现在讨论欧洲（尤其德语区）高校制度的语境中；在英美学术体系里并不是常用术语，因此阅读时可把它理解为“与获得任教/学术任职资格有关的”。"]}
{"word":"habile","summary":{"en":"Habile means clever and skillful, often in practical tasks or handling situations smoothly.","zh":"habile 表示“灵巧机敏、能干”，常指做事熟练或处事圆滑有效。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clever and skillful, especially in using your hands or dealing with situations in a quick, effective way.","zh":"灵巧的；机敏能干的（尤指手工技巧或处事圆滑、反应快）。"},"examples":[{"en":"She is habile with a needle and can repair clothes in minutes.","zh":"她用针线很灵巧，几分钟就能把衣服补好。"},{"en":"The manager gave a habile answer that calmed everyone down.","zh":"经理给出了一个机敏的回答，让大家都冷静下来。"}]}],"synonyms":["skillful","adept","nimble","capable","adroit"],"phonetic":"/ˈhæbəl/","extraExplanation":["“Habile”较偏书面、文学或正式语境，日常英语中更常用的词是“skillful / adept / nimble / capable”。","词源来自拉丁语 habilis，意为“适合的、灵巧的”，与“able（能干的）”有同源关系。","常见搭配：habile hands（灵巧的双手），habile mind（机敏的头脑），habile at + 技能（在……方面很熟练）。"]}
{"word":"habilement","summary":{"en":"Habilement (French) means “skillfully” or “cleverly,” often used in a literary or stylized way in English.","zh":"Habilement（法语）意为“熟练地/巧妙地”，在英语中多用于文学或风格化表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(from French) skillfully; cleverly; with dexterity.","zh":"（法语借词）熟练地；巧妙地；灵巧地。"},"examples":[{"en":"The negotiator responded habilement, calming both sides without conceding too much.","zh":"谈判代表回答得很巧妙，在不让步太多的情况下安抚了双方。"},{"en":"She habilement avoided the tricky question and guided the conversation back to the main point.","zh":"她巧妙地避开了棘手的问题，把谈话引回到主题上。"}]}],"synonyms":["skillfully","cleverly","deftly","adroitly"],"phonetic":"/ˌæbɪlˈmɑ̃/","extraExplanation":["“habilement”是法语副词，来自形容词“habile”（能干的、熟练的）。在英语里它并不常用，更多出现在文学、评论或带有法式风格的写作中，用来强调“处理得很有手腕/很有技巧”。","在日常英语中，更自然的替换通常是：skillfully, cleverly, deftly, adroitly。"]}
{"word":"habiliment","summary":{"en":"Habiliment means clothing or attire, usually in a formal or literary style.","zh":"habiliment 指“衣着/服装”，多用于正式或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clothing; garments (often used in a formal, literary, or old-fashioned way).","zh":"衣着；服装（常见于正式、文学或略显古旧的用法）。"},"examples":[{"en":"The guests arrived in their finest habiliment for the ceremony.","zh":"宾客们穿着最精美的礼服出席典礼。"},{"en":"In the novel, the knight’s habiliment shows his rank and wealth.","zh":"在小说中，骑士的衣着显示了他的身份与财富。"}]}],"synonyms":["attire","clothing","garb","dress","raiment"],"phonetic":"/həˈbɪləmənt/","extraExplanation":["“habiliment”较少用于日常口语，更常见于文学描写、历史语境或带点戏仿/夸张的正式文体，用来强调“盛装、装束”的感觉。","词源来自法语 *habillement*（意为“穿着、衣服”），与英语 *habit*（旧义也可指“衣着/习惯性穿着”）同源。现代英语中更常用的表达是 *clothes*, *clothing*, *attire*, *garb*。"]}
{"word":"habilimental","summary":{"en":"Habilimental means “related to clothing or dress.” It’s formal and uncommon in everyday speech.","zh":"habilimental 意为“与服装、穿着有关的”。语体较正式，日常不常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to clothing or dress; pertaining to what someone wears.","zh":"与衣着、服装有关的；指穿着打扮的。"},"examples":[{"en":"The museum’s exhibit focused on the habilimental styles of the 1800s.","zh":"博物馆的展览聚焦于19世纪的服饰风格。"},{"en":"She made a few habilimental changes before the formal dinner.","zh":"参加正式晚宴前，她对穿着做了些调整。"}]}],"synonyms":["clothing-related","vestimentary","sartorial","attire-related"],"phonetic":"/həˌbɪləˈmɛn.təl/","extraExplanation":["这个词比较少见，偏正式或文学化。它来自名词 habiliment（意为“衣服、装束”，常用复数 habiliments），再加上形容词后缀 -al，表示“与……有关”。日常英语里更常用 clothing, dress, attire, outfit 等。"]}
{"word":"habilimentary","summary":{"en":"Habilimentary means “related to clothing or dress,” but it is rare and formal.","zh":"habilimentary 意为“与衣着/服饰有关的”，但用法少见且较正式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to clothing or dress; connected with what someone wears.","zh":"与衣着或服饰有关的；与穿着相关的。"},"examples":[{"en":"The museum’s exhibit focused on the habilimentary styles of the 1800s.","zh":"博物馆的展览聚焦于19世纪的服饰风格。"},{"en":"Her habilimentary choices were simple: a dark coat, plain shoes, and a scarf.","zh":"她的穿衣选择很简单：深色外套、朴素的鞋子和一条围巾。"}]}],"synonyms":["clothing-related","dress","sartorial","vestimentary","apparel"],"phonetic":"/həˌbɪləˈmɛntri/","extraExplanation":["“habilimentary”非常少见，日常英语里更常用的说法是“clothing / dress / sartorial / related to clothing”。它来自“habiliment(s)”（衣服、装束），词根与拉丁语“habere”（拥有、穿戴）有关。","在写作中用“habilimentary”会显得比较正式或古雅，常见于学术/历史语境（如服装史、博物馆说明文字）。"]}
{"word":"habilimentation","summary":{"en":"Habilimentation means clothing or an outfit, usually in a formal or old-fashioned style.","zh":"habilimentation 指“衣着/服装/装束”，多见于较正式或偏古的文风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"clothing; garments; an outfit (a formal or old-fashioned word).","zh":"衣着；服装；一套装束（较正式或偏古的用法）。"},"examples":[{"en":"In the old novel, the duke’s habilimentation is described in rich detail.","zh":"在那部老小说里，公爵的衣着被描写得非常细致。"},{"en":"Her habilimentation for the ceremony included a dark coat and polished shoes.","zh":"她参加仪式的装束包括一件深色外套和擦得发亮的鞋子。"}]}],"synonyms":["clothing","clothes","attire","garments","outfit","dress"],"phonetic":"/həˌbɪləməˈteɪʃən/","extraExplanation":["这个词来自法语（与“to habilitate/ habiliment”同源），在现代英语中比较少见，常见于文学、历史描写或刻意使用的正式文风中。日常英语里更常说 clothes, clothing, outfit, attire。"]}
{"word":"habilimented","summary":{"en":"“Habilimented” means “dressed/clothed,” especially in an old-fashioned or literary style.","zh":"“habilimented”意为“穿着（衣服）”，多用于古旧或文学语境，常带“盛装/装束”之意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) dressed or clothed, often in a noticeable or formal way.","zh":"（古旧或文学用语）穿着衣服的；（常指）穿着显眼或正式服装的。"},"examples":[{"en":"The guests arrived habilimented in their finest clothes for the ceremony.","zh":"宾客们穿着最精美的衣服来参加典礼。"},{"en":"In the old tale, the prince was richly habilimented in velvet and gold.","zh":"在那则古老的故事里，王子身着天鹅绒与金饰，衣着华丽。"},{"en":"A lone traveler, poorly habilimented, walked through the winter streets.","zh":"一个衣衫单薄的旅人走在冬日的街头。"}]}],"synonyms":["dressed","clothed","attired","garbed","appareled"],"phonetic":"/həˈbɪləməntɪd/","extraExplanation":["“habilimented”源自名词“habiliment”（衣服、装束），带有较强的古典/文学色彩，现代英语中更常用“dressed”“clothed”“attired”。","常见搭配有“richly habilimented”（盛装、华服）或“poorly habilimented”（衣着寒酸），多用于描写人物外观与时代氛围。"]}
{"word":"habiliments","summary":{"en":"Habiliments means clothing (often formal or distinctive), and in older/literary use it can also mean equipment or gear.","zh":"habiliments 指衣着（常带正式或有特色的语气）；在较旧或文学用法中也可指装备/用具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clothing, especially formal or distinctive clothes; attire.","zh":"衣着；（尤指）正式或有特色的服装；装束。"},"examples":[{"en":"He arrived in his finest habiliments for the wedding.","zh":"他穿着最讲究的礼服参加婚礼。"},{"en":"The museum displayed the king’s habiliments from the 18th century.","zh":"博物馆展出了这位国王18世纪的服饰。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary or old-fashioned) Equipment or gear; the things needed for a particular activity.","zh":"（文学/旧式）装备；用具；某项活动所需之物。"},"examples":[{"en":"They packed their travel habiliments and set out at dawn.","zh":"他们收拾好旅行用具，拂晓出发。"}]}],"synonyms":["clothing","clothes","attire","garments","outfit"],"phonetic":"/həˈbɪləmənts/","extraExplanation":["“Habiliments”语气偏文学、带点古典感，日常英语更常用 clothing / clothes / outfit / attire。","词源与法语有关（habillement，意为“穿着、衣装”），因此常出现在描写仪式、宫廷、戏剧服装等较正式的语境里。"]}
{"word":"habilitas","summary":{"en":"“habilitas” is a Latin term meaning ability or aptitude, mostly used in academic or historical writing.","zh":"“habilitas”是拉丁语词，意为“能力/资质”，多用于学术或历史写作中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, used in academic or historical contexts) ability; skill; aptitude.","zh":"（拉丁语，常见于学术/历史语境）能力；技能；资质/天赋。"},"examples":[{"en":"In medieval texts, “habilitas” often means a person’s fitness or ability to do a task.","zh":"在中世纪文献中，“habilitas”常指一个人完成某项任务的适任性或能力。"},{"en":"The author contrasts natural talent with learned “habilitas.”","zh":"作者把天生的天赋与后天习得的“habilitas（能力）”进行对比。"}]}],"synonyms":["ability","aptitude","capability","skill"],"phonetic":"ˌhæbɪˈlɪtəs","extraExplanation":["“habilitas”来自拉丁语形容词“habilis”（意为“灵巧的、适合的”）。它与英语里的词根“habil-”同源，常见于：\n- ability（能力，词源相关但形式不同）\n- habilitate / rehabilitation（使具备能力；康复/复健）\n在现代日常英语中很少直接用“habilitas”，多见于引文、法律/哲学讨论或历史研究。"]}
{"word":"habilitate","summary":{"en":"Habilitate means to help someone gain or regain functional abilities—especially building basic skills that were never developed; it is less common than rehabilitate.","zh":"habilitate 指帮助某人获得或恢复功能性能力，尤其强调建立原本未发展出的基本技能；该词比 rehabilitate 更少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to help a person regain health, strength, skills, or normal daily functioning after illness, injury, addiction, or time in prison; to rehabilitate","zh":"使（某人）恢复健康/能力/正常生活功能；（尤指）通过康复训练、戒治或社会支持帮助其重新适应生活"},"examples":[{"en":"After the stroke, she worked with therapists to habilitate her speech and movement.","zh":"中风后，她和治疗师一起训练，帮助她恢复语言和动作能力。"},{"en":"The program aims to habilitate people returning from prison by providing job training and counseling.","zh":"该项目通过职业培训和心理辅导，帮助刑满释放人员重新融入社会。"}]},{"partOfSpeech":"vt.","definition":{"en":"(in medicine/education) to teach or build basic life skills that a person has never developed (often used for children with developmental disabilities)","zh":"（医学/教育）帮助（从未获得过的）基本生活技能的建立与学习（常用于发展性障碍儿童）"},"examples":[{"en":"Special education services can habilitate children by teaching communication and daily living skills.","zh":"特殊教育服务可以通过教授沟通与日常生活技能来帮助孩子建立基本能力。"},{"en":"Therapists worked to habilitate his feeding and self-care routines.","zh":"治疗师帮助他建立进食和自我照护的常规能力。"}]}],"synonyms":["rehabilitate","restore","train","retrain","reinstate","help someone reintegrate"],"phonetic":"/həˈbɪlɪˌteɪt/","extraExplanation":["“habilitate”和“rehabilitate”很像，但学习重点在区别：rehabilitate 通常强调“恢复曾经拥有的能力”（re- = again），habilitate 更常指“获得/建立原本没有发展的能力”。不过在日常英语里，habilitate 比较少见，很多场合人们会直接用 rehabilitate。","词源提示：来自拉丁语 habilis（“适合的、有能力的”），相关词还有 able（能干的）、ability（能力）、habilitate（使具备能力）。"]}
{"word":"habilitated","summary":{"en":"“Habilitated” means officially restored to legal rights or status; it’s the past form of “habilitate” and can also be used as an adjective.","zh":"“habilitated”指在法律或官方层面恢复权利、身份或资格；是“habilitate”的过去式/过去分词，也可作形容词表示“已复权/已恢复资格的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of habilitate) to officially give someone legal rights, status, or the ability to act again—especially after a restriction or disqualification.","zh":"（habilitate 的过去式/过去分词）使某人在法律上恢复权利、资格或行为能力，尤指在被限制或被取消资格之后。"},"examples":[{"en":"After completing the required process, he was habilitated and could practice law again.","zh":"完成规定程序后，他被恢复资格，可以再次执业。"},{"en":"The court order stated that the company was habilitated to operate under the new license.","zh":"法院命令说明该公司在新执照下已获准恢复经营资格。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) having been officially restored to rights, status, or capacity; legally reinstated.","zh":"（形容词）已被正式恢复权利、身份或能力的；（法律上）已复权/已恢复资格的。"},"examples":[{"en":"A habilitated citizen may regain the right to vote, depending on local law.","zh":"在某些地区，复权的公民可能会重新获得投票权。"},{"en":"She is now a fully habilitated professional, with her license restored.","zh":"她现在已完全恢复执业资格，执照也已恢复。"}]}],"synonyms":["reinstated","restored","requalified","readmitted","reestablished"],"phonetic":"/həˈbɪlɪˌteɪtɪd/","extraExplanation":["“habilitate”在现代英语中比较少见，更多见于法律或行政语境；日常表达里更常用“reinstate”（恢复职务/资格）、“restore rights”（恢复权利）或“rehabilitate”（更偏“改造/康复/社会重返”）。","词源上与“able / ability（有能力）”同源，来自拉丁语“habilis”（适合的、有能力的）。因此它强调“使具备资格/能力（多为法律意义）”。"]}
{"word":"habilitatem","summary":{"en":"*habilitatem* is a Latin form meaning “ability/aptitude” (object form of *habilitas*), not a standard English word.","zh":"*habilitatem* 是拉丁语形式，意思是“能力/才能”（*habilitas* 的宾格形式），不是标准英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; accusative singular of *habilitas*) “ability, skill, aptitude”; used as the object of a verb, meaning “(someone’s) ability/fitness.”","zh":"（拉丁语；*habilitas* 的宾格单数）“能力、技能、才能/适合度”；在句子里通常作动词的受词，表示“（某人的）能力/胜任程度”。"},"examples":[{"en":"Medieval Latin texts might say: *ad habilitatem regendi* (“for the ability to govern”).","zh":"中古拉丁文中可能会写：*ad habilitatem regendi*（“为了治理的能力”）。"},{"en":"In a legal/academic context: *probavit habilitatem suam* (“he proved his ability”).","zh":"在法律/学术语境中：*probavit habilitatem suam*（“他证明了自己的能力”）。"}]}],"synonyms":["ability","aptitude","skill","fitness","competence"],"phonetic":"/ˌhæbɪˈlɪtɑːtɛm/","extraExplanation":["“habilitatem”不是英语单词，而是拉丁语名词 *habilitas*（能力、适合度）的“宾格单数”形式。拉丁语里宾格常用来表示动词的直接受词，所以它常出现在“证明/展示/获得……能力”这类结构中。","英语里的 **habilitation**（学术任职资格、大学教师资格）与 *habilitas* 同源，核心含义也与“具备胜任某项工作的能力/资格”有关。"]}
{"word":"habilitating","summary":{"en":"“Habilitating” means making someone fit/qualified, and in clinical contexts, helping someone develop new skills (not just regain lost ones).","zh":"“habilitating”指使某人具备能力/合格；在临床语境中特指帮助个体习得新的生活或沟通技能（而非仅恢复已失去的能力）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) Making someone or something able, fit, or ready to do a particular job or purpose; equipping or qualifying.","zh":"（较少用）使某人/某物具备能力、合格或适合某种用途；使其得到装备或资格。"},"examples":[{"en":"The program focuses on habilitating new technicians through hands-on training.","zh":"该项目通过实践培训来使新技术员具备上岗能力。"},{"en":"The course is aimed at habilitating students for entry-level research work.","zh":"这门课程旨在使学生具备从事入门级研究工作的能力。"}]},{"partOfSpeech":"v.","definition":{"en":"In healthcare and education: helping a person (often a child with developmental disabilities) gain new skills for daily living and communication (different from rehabilitation, which restores lost skills).","zh":"在医疗与教育语境中：帮助个体（常指有发育障碍的儿童）获得新的生活与沟通技能（不同于“rehabilitation”侧重恢复已失去的技能）。"},"examples":[{"en":"Therapists are habilitating children to communicate with picture cards and simple speech.","zh":"治疗师正在帮助孩子通过图片卡和简单语言来建立沟通能力。"},{"en":"Early intervention services work on habilitating basic self-care skills like dressing and eating.","zh":"早期干预服务致力于建立穿衣、进食等基本自理技能。"}]}],"synonyms":["training","preparing","qualifying","equipping","developing"],"phonetic":"/həˈbɪlɪˌteɪtɪŋ/","extraExplanation":["“habilitating”来自动词“habilitate”的现在分词形式；在日常英语中相对少见，更常见的表达是“train/prepare/qualify/equip”。","在临床与特殊教育领域，“habilitation（能力建构/习得训练）”与“rehabilitation（康复）”常成对出现：前者强调“从无到有地学会新技能”，后者强调“把失去的能力恢复回来”。","如果你是在写学术或医疗相关内容，用“habilitating”会更精准；如果是一般语境，换成更常用的动词会更自然。"]}
{"word":"habilitation","summary":{"en":"Habilitation means (1) training to develop new abilities, or (2) a postdoctoral qualification to teach at a university (especially in Europe).","zh":"habilitation 指（1）帮助发展新能力的训练；或（2）（尤指欧洲）大学任教与指导研究的博士后资格认证。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine/Education) Training that helps a person develop new skills or abilities that they did not previously have (often used for children or people with developmental disabilities).","zh":"（医学/教育）帮助一个人发展以前没有的技能或能力的训练（常用于儿童或发育障碍者）。"},"examples":[{"en":"The clinic offers habilitation to help children build communication and daily-living skills.","zh":"该诊所提供能力建构训练，帮助孩子培养沟通和日常生活技能。"},{"en":"Unlike rehabilitation, habilitation focuses on learning skills for the first time.","zh":"与康复训练不同，能力建构训练强调“第一次”学习技能。"}]},{"partOfSpeech":"n.","definition":{"en":"(Academia, especially Europe) A postdoctoral qualification that certifies someone’s ability to teach and supervise research at a university.","zh":"（学术领域，尤指欧洲）一种博士后任职资格认证，用于证明某人具备在大学授课并指导研究的能力。"},"examples":[{"en":"After completing her habilitation, he was eligible to apply for a professorship in Germany.","zh":"完成任职资格认证后，他就有资格在德国申请教授职位。"},{"en":"In some countries, habilitation is a major step between a PhD and a full professorship.","zh":"在一些国家，任职资格认证是从博士到正教授之间的重要一步。"}]}],"synonyms":["qualification","certification","habilitation training","skills training","postdoctoral qualification"],"phonetic":"/həˌbɪlɪˈteɪʃən/","extraExplanation":["“habilitation”来自拉丁语词根 habil-（与“able”相关），核心含义是“使之具备能力/资格”。","医学语境里常与“rehabilitation（康复）”对比：re- 表示“再次”，康复是恢复曾经拥有的功能；habilitation 更强调“从无到有”地建立技能。","学术语境里的“habilitation”在德语区较常见（如德国、奥地利、部分瑞士高校），具体制度因国家与学科不同而有差异。"]}
{"word":"habilitator","summary":{"en":"A habilitator is someone who helps people develop or regain functional abilities; in some European academia, it can also refer to someone connected to the habilitation qualification.","zh":"habilitator 指帮助他人发展或恢复功能能力的人；在部分欧洲学术语境中，也可指与“任教资格（habilitation）”相关的指导或授予者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or professional who helps someone gain, regain, or develop abilities and daily-life skills (especially in healthcare or education).","zh":"帮助他人获得、恢复或发展能力与生活技能的人（尤指医疗或教育领域的专业人员）。"},"examples":[{"en":"After the stroke, a habilitator worked with him on speaking and dressing skills.","zh":"中风之后，一位能力复健师帮助他练习说话和穿衣等技能。"},{"en":"The school hired a habilitator to support students with developmental delays.","zh":"学校聘请了一位能力复健师来支持发育迟缓的学生。"}]},{"partOfSpeech":"n.","definition":{"en":"someone involved in granting or supervising “habilitation” (a postdoctoral qualification) in some European academic systems.","zh":"在部分欧洲学术体系中，参与授予或指导“大学任教资格（habilitation）”的人。"},"examples":[{"en":"In that university system, the habilitator mentors candidates preparing for habilitation.","zh":"在那种大学体系里，habilitator 会指导准备申请任教资格的候选人。"}]}],"synonyms":["therapist","rehabilitator","occupational therapist","skills trainer","coach"],"phonetic":"/həˈbɪləˌteɪtər/","extraExplanation":["“habilitator”在日常英语里不常见，更常见的是“rehabilitator/rehab therapist（康复治疗师）”。“habilitation”通常指帮助先天或发展过程中尚未建立的能力（如儿童发展训练）；“rehabilitation”多指恢复曾经拥有但因受伤或疾病丧失的能力。","学术语境里的“habilitation”主要见于德国等欧洲国家，英语材料中也会保留这一术语；但“habilitator”作为对应名词并不固定、使用频率较低，具体称呼常因机构而异。"]}
{"word":"hability","summary":{"en":"“Hability” is a misspelling; the correct word is “ability,” meaning the power, skill, or talent to do something.","zh":"“hability” 是拼写错误；正确词是 “ability”，意思是做某事的能力、技能或才能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) The correct English word is “ability”: the power or skill to do something.","zh":"（常见拼写错误）正确的英文是 “ability”：做某事的能力或技能。"},"examples":[{"en":"She has the ability to learn languages quickly.","zh":"她有快速学习语言的能力。"},{"en":"Your ability to stay calm helps the whole team.","zh":"你保持冷静的能力帮助了整个团队。"}]},{"partOfSpeech":"n.","definition":{"en":"A natural talent or a high level of skill in a specific area.","zh":"（尤指某方面）天赋；才能；高超的本领。"},"examples":[{"en":"He showed great ability in math from an early age.","zh":"他很小就展现出很强的数学才能。"},{"en":"The job requires leadership ability.","zh":"这份工作需要领导能力。"}]}],"synonyms":["skill","capability","talent","capacity","competence"],"phonetic":"/əˈbɪləti/","extraExplanation":["“hability” 不是标准英语拼写。很多学习者会受西班牙语影响：西班牙语里 “habilidad”=“技能/能力”，所以容易误写成 “hability”。英语里请用 “ability”。","拼写小提示：ability 以 a- 开头，中间是 -bil-，结尾是 -ity（常见名词后缀，如: activity, creativity）。"]}
{"word":"habille","summary":{"en":"“habille” is a French form of *habiller*: to dress (someone), get dressed, or outfit; it’s not a common standalone English word.","zh":"“habille”是法语 *habiller* 的变位：给人穿衣/自己穿衣/装扮；并非常见的英语单词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"“habille” is a French verb form of *habiller*, meaning “to dress (someone),” “to get dressed,” or “to outfit.” In English it is usually seen only in French contexts (fashion, literature, menus, labels).","zh":"“habille”是法语动词 *habiller* 的一种变位，意思是“给（某人）穿衣服 / 穿上衣服”“（自己）穿衣”“为……装扮/配备”。在英语里一般只在法语语境（时尚、文学、标签等）中出现。"},"examples":[{"en":"She *habille* the child in a warm coat before school. (French: “She dresses the child…”)","zh":"她在上学前给孩子穿上暖和的外套。（法语：她给孩子穿衣……）"},{"en":"*Habille-toi !* We’re leaving in five minutes. (French: “Get dressed!”)","zh":"*Habille-toi！* 我们五分钟后出门。（法语：快穿衣服！）"}]}],"synonyms":["dress","clothe","outfit"],"phonetic":"/aˈbij/","extraExplanation":["法语里 **habille** 常见两种用法：\n1) 直陈式现在时第三人称单数：*Il/Elle habille…*（他/她给……穿衣/装扮……）\n2) 命令式（tu）：*Habille-toi !*（你快穿衣服！）\n对应的不定式是 **habiller**（穿衣/装扮）。","如果你想表达“穿得很讲究/正式”，法语常用 **bien habillé(e)**（穿得体面）。英语里更常说 *well-dressed / dressed up*。"]}
{"word":"habiri","summary":{"en":"Habari is a Swahili word used as a friendly greeting (“hello/what’s up?”) and also means “news.”","zh":"Habari 是斯瓦希里语词，既可作友好的问候（“你好/最近怎么样？”），也可表示“新闻、消息”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(From Swahili) a greeting meaning “hello,” “what’s up?” or “what’s the news?”","zh":"（源自斯瓦希里语）问候语，意思相当于“你好”“最近怎么样？”“有什么新消息吗？”"},"examples":[{"en":"Habari! How are you today?","zh":"Habari！你今天怎么样？"},{"en":"Habari gani? (What’s the news?/How are things?)","zh":"Habari gani？（有什么新消息吗？/近况如何？）"}]},{"partOfSpeech":"n.","definition":{"en":"(From Swahili) news; information about what is happening","zh":"（源自斯瓦希里语）新闻；消息；近况"},"examples":[{"en":"I have habari from home.","zh":"我有来自家里的消息。"},{"en":"Any habari about the meeting time?","zh":"有关于开会时间的消息吗？"}]}],"synonyms":["hello","what's up","news","information"],"phonetic":"/hɑˈbɑri/","extraExplanation":["“Habari”（有时也会被拼作 habiri）来自斯瓦希里语，在肯尼亚、坦桑尼亚等东非地区非常常见。它既可以指“消息/新闻”，也常被用作问候语。","最常见的固定搭配是“Habari gani?”，直译是“什么消息？”，实际就是在问“你怎么样/最近如何”。在日常口语里语气通常很友好、随意。"]}
{"word":"habiru","summary":{"en":"Habiru: a historical term for socially marginal, mobile groups in the ancient Near East (also spelled Apiru).","zh":"Habiru：古代近东对社会边缘、具流动性人群的一种历史称呼（也写作 Apiru）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A group of socially marginal, often mobile people mentioned in Near Eastern texts from the 2nd millennium BCE; sometimes spelled Apiru.","zh":"（历史）公元前二千纪近东文献中提到的一类社会边缘、常带流动性的人群；也常拼作 Apiru。"},"examples":[{"en":"Some Egyptian and Mesopotamian records describe conflict with the Habiru.","zh":"一些埃及和美索不达米亚的记录记载了与 Habiru 的冲突。"},{"en":"In class, we discussed how the term Habiru may refer to a social status rather than one ethnic group.","zh":"课堂上我们讨论了 Habiru 这个词可能指的是一种社会身份，而不是单一民族。"}]}],"synonyms":["Apiru","’Apiru","Hapiru"],"phonetic":"/həˈbɪruː/","extraExplanation":["“Habiru/Apiru”更多被学者当作社会类别（如逃亡者、雇佣兵、无地者、流民等）而非固定族群名称，因此不同地区文本里的所指可能不完全相同。","它常被拿来与“Hebrews（希伯来人）”作比较，但两者并不等同；是否存在直接关联在学界仍有争议。"]}
{"word":"habit","summary":{"en":"A habit is something you do regularly, often automatically; it can also mean a traditional outfit, especially a religious one.","zh":"habit 指经常做、常常不自觉的“习惯”；也可指传统服装，尤指宗教人士的修会服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A regular behavior you do often, sometimes without thinking.","zh":"习惯；经常做的行为（有时会不自觉地做）。"},"examples":[{"en":"Drinking a glass of water after waking up is a healthy habit.","zh":"起床后喝一杯水是个健康的习惯。"},{"en":"She has a habit of checking her phone during meals.","zh":"她有个习惯：吃饭时会看手机。"},{"en":"Try to replace the bad habit with a better one.","zh":"试着用更好的习惯来替换坏习惯。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of clothing worn by a particular group, especially in the past or by religious members (a robe/uniform style).","zh":"（某群体的）传统服装；（尤指）修会服、僧袍一类的制服式服装。"},"examples":[{"en":"The monk wore a simple black habit.","zh":"那位僧人穿着一件朴素的黑色僧袍。"},{"en":"In the painting, the nun’s habit is clearly shown.","zh":"在这幅画里，修女的修会服很明显。"}]}],"synonyms":["routine","custom","practice","pattern"],"phonetic":"/ˈhæbɪt/","extraExplanation":["“Habit”既可指个人长期重复的行为（最常用），也可指某些群体的传统服装，尤其与修道院、修女/僧侣等宗教语境相关。","常见搭配：break a habit（戒掉习惯），form/develop a habit（养成习惯），get into the habit of doing sth（养成做某事的习惯），by habit（出于习惯）。","词源上与“住/居住（inhabit）”同源，暗示一种“长期停留在你生活里”的行为模式。"]}
{"word":"habitability","summary":{"en":"Habitability means how suitable a place is for living—either for people (livability) or for life in general (e.g., on other planets).","zh":"habitability 指一个地方的适居性/宜居程度：既可指人类居住的宜居性，也可指（如行星）是否能支持生命存在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the degree to which a place is suitable for living in (comfortable, safe, and able to support life)","zh":"（某地）适居性；宜居程度（指是否适合居住：舒适、安全，并能支持生命或生活）"},"examples":[{"en":"The report ranks cities by their habitability, including safety and access to healthcare.","zh":"这份报告按宜居程度对城市进行排名，包括安全性和医疗可及性。"},{"en":"Good public transportation can improve a neighborhood’s habitability.","zh":"良好的公共交通能提高一个社区的宜居性。"},{"en":"Scientists study the habitability of Mars by looking for water and stable temperatures.","zh":"科学家通过寻找水源和稳定的温度来研究火星的适居性。"}]}],"synonyms":["livability","suitability for living","residential quality","life-supporting potential"],"phonetic":"/ˌhæbɪˈtæbɪləti/","extraExplanation":["在天文学/生命科学里，habitability 常指“是否能支持生命存在”的条件（如液态水、合适温度、大气等）；在城市规划/住房语境里，则更偏“宜居”（如治安、污染、交通、住房质量）。","词形关系：habitable（adj. 可居住的/适合居住的）→ habitability（n. 适居性）。注意它与 habit（习惯）拼写相近，但意义无关。"]}
{"word":"habitable","summary":{"en":"Habitable means “fit to live in” (safe enough and with basic living conditions).","zh":"habitable 指“适合居住/可生存的”，强调具备基本居住或生存条件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Suitable for people, animals, or plants to live in; safe enough and providing basic conditions like air, water, and tolerable temperatures.","zh":"适合居住的；（对人/动物/植物）可生存的；具备空气、水和适宜温度等基本条件的。"},"examples":[{"en":"The apartment is small, but it’s clean and habitable.","zh":"这套公寓很小，但很干净，适合居住。"},{"en":"Scientists are searching for habitable planets beyond our solar system.","zh":"科学家正在寻找太阳系外可能宜居的行星。"},{"en":"After the repairs, the house became habitable again.","zh":"修好之后，这房子又可以住人了。"}]}],"synonyms":["livable","inhabitable (opposite)","fit for habitation"],"phonetic":"/ˈhæbɪtəbəl/","extraExplanation":["“habitable”来自拉丁语词根 habit-（居住），与 habit（习惯/居住方式）、inhabit（居住于）、habitat（栖息地）同源。","在新闻或正式语境中常见搭配：habitable conditions（可居住的条件）、make something habitable（使……适合居住）、habitable zone（宜居带，指恒星周围可能存在液态水的区域）。","语气上偏正式、客观，强调“基本生存/居住条件”，不等于 comfortable（舒适的）或 cozy（温馨的）。"]}
{"word":"habitableness","summary":{"en":"“Habitableness” means the state of being suitable to live in; the level of comfort and safety for living.","zh":"“habitableness”表示“宜居性/适居性”，即某处是否适合居住、是否安全舒适。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or condition of being fit to live in; suitability for people to live comfortably and safely","zh":"宜居性；适合居住的程度（是否舒适、安全、适合人类生活）"},"examples":[{"en":"The report measures the habitableness of the apartments, including heat, water, and ventilation.","zh":"这份报告评估了公寓的宜居性，包括供暖、供水和通风。"},{"en":"After the storm, inspectors checked the home’s habitableness before the family moved back in.","zh":"暴风雨过后，检查人员先确认房屋是否具备宜居条件，家人才搬回去。"}]}],"synonyms":["habitability","livability","inhabitability (opposite)"],"phonetic":"/həˈbɪtəb(ə)lnəs/","extraExplanation":["“Habitable”是更常见的形容词（a habitable planet / habitable room）。名词“habitableness”较少见，日常与新闻、法律或建筑语境中更常用“habitability”（宜居性/可居住性）。","在住房与租赁法律里，常会出现“warranty of habitability”（居住适宜性保证/适居性担保）：房东必须提供基本安全、卫生与可居住的居所（如供水、供暖、结构安全等）。"]}
{"word":"habitably","summary":{"en":"“Habitably” means “in a livable way/condition.”","zh":"“habitably”表示“以可居住的方式/处于可住的状态”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is suitable for people (or other living things) to live in; in a livable condition.","zh":"以适合（人或其他生物）居住的方式；处于可居住的状态。"},"examples":[{"en":"After repairs, the apartment was finally habitably warm in winter.","zh":"修好之后，这间公寓冬天终于暖到能住人了。"},{"en":"They tried to keep the shelter habitably clean with limited supplies.","zh":"在物资有限的情况下，他们尽量让避难所保持到能住人的干净程度。"}]}],"synonyms":["livably","comfortably","in livable condition"],"phonetic":"/ˈhæbɪtəbli/","extraExplanation":["“habitably”来自形容词“habitable（可居住的）”，常见于正式或书面语（例如房屋、住宿条件、法律/安全标准）。日常口语里更常说“livably / comfortably / in livable condition”。","它常带有“勉强达到基本居住标准”的语气：不是豪华舒适，而是“至少能住”。"]}
{"word":"habitacle","summary":{"en":"Habitacle means the enclosed interior cabin of a vehicle, especially a car or aircraft.","zh":"habitacle 指车辆（尤指汽车或飞机）的封闭内部空间，即乘员舱/驾驶舱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the enclosed interior space of a vehicle (especially a car or aircraft), where people sit; the cabin","zh":"（车辆，尤指汽车或飞机的）密闭内部空间；乘员舱；驾驶舱"},"examples":[{"en":"The engineer measured the noise level inside the habitacle of the new car.","zh":"工程师测量了新车乘员舱内的噪音水平。"},{"en":"Smoke entered the aircraft’s habitacle, so the crew put on oxygen masks.","zh":"烟雾进入了飞机的驾驶舱/客舱，因此机组人员戴上了氧气面罩。"}]}],"synonyms":["cabin","cockpit","passenger compartment","interior"],"phonetic":"/ˌhæbəˈtækəl/","extraExplanation":["“habitacle”在英语中较少见，更常见的表达是 car “cabin / passenger compartment” 或 aircraft “cockpit / cabin”。它源自法语（与“居住/栖息”相关），在工程、交通工具设计或较正式的技术语境中更容易看到。"]}
{"word":"habitacule","summary":{"en":"Habitacle means the enclosed space inside a vehicle where people sit (especially a cockpit/cabin); it can also mean a shelter or living module in technical contexts.","zh":"habitacle 指车辆内供人乘坐的封闭空间（尤指驾驶舱/客舱）；在技术语境中也可指居住舱或庇护空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in aviation) the enclosed space where people sit inside a vehicle, such as the cockpit or passenger cabin.","zh":"（尤指航空）车辆内供人乘坐的封闭空间，如驾驶舱或客舱。"},"examples":[{"en":"The pilot checked the instruments before anyone entered the habitacle.","zh":"飞行员在任何人进入驾驶舱（座舱）前检查了仪表。"},{"en":"Heat and noise can build up quickly inside a small habitacle.","zh":"在狭小的座舱里，热量和噪音会很快积聚。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, technical) a living space or shelter; a habitat-like dwelling.","zh":"（罕见，技术用语）居住空间或庇护所；类似“栖居地”的住所。"},"examples":[{"en":"Researchers designed a sealed habitacle for long-term desert testing.","zh":"研究人员设计了一个密封的居住舱，用于长期沙漠测试。"}]}],"synonyms":["cabin","cockpit","compartment","interior"],"phonetic":"/ˈhæbɪtækəl/","extraExplanation":["这个词在英语里较少见，更常见于航空、车辆工程或科幻语境。常见拼写是 **habitacle**；你输入的 **habitacule** 可能是拼写变体或误拼。","词源上与法语 *habitacle* 有关，来自拉丁语词根，和 *inhabit*（居住）、*habitat*（栖息地）同源，因此都带有“居住/容纳人”的含义。"]}
{"word":"habitally","summary":{"en":"Habitually means “as a habit; regularly and repeatedly.”","zh":"habitually 表示“习惯性地；经常反复地（由于习惯）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that happens regularly because it is a habit; usually and repeatedly","zh":"习惯性地；由于习惯而经常、反复地"},"examples":[{"en":"She habitually checks her phone before bed.","zh":"她睡前习惯性地查看手机。"},{"en":"He is habitually late for meetings.","zh":"他开会总是习惯性迟到。"},{"en":"I habitually take a short walk after lunch.","zh":"我午饭后习惯性地散步一会儿。"}]}],"synonyms":["usually","regularly","routinely","customarily","typically"],"phonetic":"/həˈbɪtʃuəli/","extraExplanation":["“habitually”比“usually/often”更强调“习惯”这个原因：不是偶然频繁，而是长期形成的行为模式。","常见搭配：habitually + 动词（habitually smoke/drink/check），或 be + habitually + 形容词/过去分词（be habitually late/absent）。","语气上可中性，也可能带轻微批评（如 habitually rude/late），使用时注意场合。"]}
{"word":"habitan","summary":{"en":"Habitatant means a living being that lives in a particular place (a resident).","zh":"habitant 指居住在某个地方的生物（居民、居住者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that lives in a particular place; an inhabitant.","zh":"（人或动物）某地的居住者；居民。"},"examples":[{"en":"The island’s first human habitant arrived over 1,000 years ago.","zh":"这个岛最早的人类居住者在一千多年前来到这里。"},{"en":"Polar bears are Arctic habitants adapted to extreme cold.","zh":"北极熊是适应严寒环境的北极居住动物。"}]}],"synonyms":["inhabitant","resident","dweller","occupant"],"phonetic":"/ˈhæbɪtənt/","extraExplanation":["“habitan”在英语里通常不是标准拼写；你可能想查的是 **habitant**。如果你是在看西班牙语，**habitan** 是动词 *habitar* 的变位，意思是“（他们/她们/你们）居住”。","历史与文化：在加拿大历史语境中，**Habitants**（常大写、复数）特指早期法裔加拿大的农民/定居者，尤其与魁北克的乡村社会相关。"]}
{"word":"habitance","summary":{"en":"Habitance is a rare noun meaning habitation/residence, or (rarely) the inhabitants of a place.","zh":"habitance 是较少见的名词，意为“居住/栖居”，或（更罕见地）指“某地居民”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or state of living in a place; habitation or residence","zh":"居住；栖居（在某地生活的状态或行为）"},"examples":[{"en":"Human habitance in this region increased after the new road was built.","zh":"新公路修好后，这一地区的人类居住活动增加了。"},{"en":"The report studies habitance patterns near the river.","zh":"这份报告研究了河流附近的居住分布模式。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the people living in a place; inhabitants","zh":"（罕见）居住者；居民（某地的人群）"},"examples":[{"en":"The island’s habitance depends on fishing and tourism.","zh":"该岛居民依靠渔业和旅游业生活。"},{"en":"Local habitance opposed the plan to cut down the forest.","zh":"当地居民反对砍伐森林的计划。"}]}],"synonyms":["habitation","residence","dwelling","occupancy","inhabitants"],"phonetic":"ˈhæbɪtəns","extraExplanation":["“habitance”在现代英语中非常少见，多数情况下会用更常见的词：**habitation**（居住/住所，较正式）、**residence**（居住/住所，常用）、**inhabitants**（居民）。在学术或报告体里偶尔能看到“habitance”用来表达“居住状态/居住分布”。","注意不要和 **habit**（习惯）混淆：habitance 主要和“居住/栖居”有关，而不是“习惯”。"]}
{"word":"habitancies","summary":{"en":"“Habitancies” is the plural of “habitancy,” meaning residence or occupancy, though it’s rare in modern usage.","zh":"“habitancies”是“habitancy”的复数，意思是居住或占用状态，但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of living in a place; residence or occupancy (plural: habitancies).","zh":"居住（在某地）的状态；居住权或占用状态（复数：habitancies）。"},"examples":[{"en":"The report listed long-term habitancies in the coastal villages.","zh":"报告列出了沿海村落的长期居住情况。"},{"en":"Seasonal habitancies are common in tourist towns.","zh":"旅游城镇里季节性居住很常见。"}]}],"synonyms":["residence","residency","habitation","occupancy"],"phonetic":"/ˈhæbɪtənsi/","extraExplanation":["“habitancy / habitancies”在现代英语里比较少见，更常用的表达是“habitation”（居住）、“residency/residence”（居住/住所）或“occupancy”（占用、入住率，常用于房屋/酒店/法律或统计语境）。","构词上来自“habit”（习惯）同源的拉丁词根，含义偏向“居住/栖居的状态”，但不等于“习惯（habit）”。看到时不要误解成“习惯们”。"]}
{"word":"habitancy","summary":{"en":"Habitancy means the state of living in or occupying a place, especially in formal or legal writing.","zh":"habitancy 指“居住/占用某地的状态”，多用于正式或法律书面语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of living in or occupying a place; residence or occupancy (often used in formal or legal contexts).","zh":"居住（于某地）的状态；居住权/占用状态（多见于正式或法律语境）。"},"examples":[{"en":"The permit requires proof of habitancy at the address for at least six months.","zh":"该许可要求提供在此地址至少居住六个月的证明。"},{"en":"Seasonal habitancy increases when the weather turns warm.","zh":"天气转暖时，季节性居住会增加。"}]}],"synonyms":["occupancy","residence","habitation","dwelling"],"phonetic":"/ˈhæbɪtənsi/","extraExplanation":["“habitancy”在现代英语中相对少见，更常见的对应词是“occupancy”（占用、入住率）和“residence”（居住）。","在法律/行政语境里，它可能与“habitability（适居性）”混淆：habitancy强调“有人居住/占用的事实”，habitability强调“房屋是否适合居住的条件”。"]}
{"word":"habitans","summary":{"en":"“Habitans” is a Latin form used mainly in scientific contexts meaning “inhabiting; living in (a place).”","zh":"“habitans”是主要用于科学语境的拉丁语形式，意思是“栖居于……的；生活在……的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(mainly in biology/taxonomy) a Latin word meaning “inhabiting” or “living in,” used in scientific names to describe where an organism lives.","zh":"（主要用于生物学/分类学）拉丁语词，意为“栖居于……的、生活在……的”，常作为生物学学名中的词形，用来描述生物的栖息地。"},"examples":[{"en":"In some scientific names, “habitans” suggests the species lives in a particular habitat.","zh":"在一些生物学学名中，“habitans”暗示该物种栖居于某种特定环境。"},{"en":"You may see “habitans” in older Latin descriptions of organisms.","zh":"你可能会在较早的拉丁文生物描述中看到“habitans”。"}]}],"synonyms":["inhabiting","dwelling (in)","living in"],"phonetic":"/ˈhæbɪtænz/","extraExplanation":["“habitans”源自拉丁语动词 habitare（居住、栖居）的现在分词，字面意思是“正在居住的/栖居的”。在现代英语里它不是常规词汇，更多出现在学名、拉丁文描写或学术语境中。","读学名时它常被当作拉丁词直接使用；如果你想用英语表达同样意思，更常用 inhabiting / dwelling (in) / living in 等说法。"]}
{"word":"habitant","summary":{"en":"Habitatant means a person who lives in a place; in Canadian history it can refer specifically to early French-speaking settlers in Quebec.","zh":"habitant 指居住在某地的人（居民）；在加拿大历史语境中也可特指魁北克早期的法语定居者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives in a particular place; a resident (often used in formal writing).","zh":"居住在某地的人；居民（常用于较正式的表达）。"},"examples":[{"en":"The city has more than one million inhabitants.","zh":"这座城市有一百多万居民。"},{"en":"The inhabitants of the island rely on fishing and tourism.","zh":"岛上的居民依靠捕鱼和旅游业为生。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, Canada) a French-speaking settler or farmer in early Canada, especially in Quebec.","zh":"（历史用法，加拿大）早期加拿大（尤指魁北克）的法语移民/定居者，常指农民。"},"examples":[{"en":"In the novel, the habitant works the land along the St. Lawrence River.","zh":"在小说中，这位habitants在圣劳伦斯河沿岸耕作。"},{"en":"Traditional music and stories often describe the life of the habitants of Quebec.","zh":"传统音乐和故事常描写魁北克habitants的生活。"}]}],"synonyms":["resident","inhabitant","dweller","local"],"phonetic":"/ˈhæbətənt/","extraExplanation":["“habitant”来自法语，字面意思是“居住者”。在现代英语中较正式，日常更常用 resident / local / people who live there。","在加拿大历史语境里，habitant 常带有文化色彩：指早期法裔加拿大农村定居者（尤其与魁北克乡村生活相关）。阅读历史或文学作品时更常见。"]}
{"word":"habitants","summary":{"en":"“Habitants” means residents—people who live in a place, often used in historical or French-Canadian contexts.","zh":"“habitants”指某地的居民/居住者，常带历史或法裔加拿大语境色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live in a particular place; residents or inhabitants.","zh":"（某地的）居民；居住者。"},"examples":[{"en":"The habitants of the island depend on fishing for their livelihood.","zh":"岛上的居民以捕鱼为生。"},{"en":"The book describes the daily life of the habitants of rural Quebec.","zh":"这本书描写了魁北克乡村居民的日常生活。"}]}],"synonyms":["residents","inhabitants","locals"],"phonetic":"/ˈhæbɪtənts/","extraExplanation":["“habitants”是“habitant”的复数，来自法语（habitant＝居住者）。在英语里它有点偏文学/历史用法，常见于描述旧时的法国殖民地（尤其是加拿大魁北克）乡村农民与居民。日常英语中更常用“residents”或“inhabitants”。"]}
{"word":"habitare","summary":{"en":"HabItare is a Latin verb meaning “to live/dwell” or “to inhabit.”","zh":"habitare是拉丁语动词，意思是“居住/生活”或“栖居于（某处）”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Latin, intransitive) to live or dwell (in a place).","zh":"（拉丁语，不及物）居住；生活在（某地）。"},"examples":[{"en":"In Latin texts, “habitare” often describes people living in a city or region.","zh":"在拉丁语文本中，“habitare”常用来描述人们居住在某座城市或某个地区。"},{"en":"You may see it glossed as “to dwell” in old dictionaries.","zh":"在一些旧词典里，你可能会看到它被解释为“dwell（居住）”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Latin, transitive) to inhabit; to occupy as a home.","zh":"（拉丁语，及物）居住于；栖居于；把……作为居所。"},"examples":[{"en":"The phrase can be translated as “to inhabit the island.”","zh":"这个短语可以译为“居住在那座岛上”。"},{"en":"In nature writing, it can refer to animals inhabiting a region.","zh":"在自然主题写作中，它也可指动物栖居于某地。"}]}],"synonyms":["live","dwell","reside","inhabit"],"phonetic":"/ˈhæbɪˌtɑreɪ/","extraExplanation":["“habitare”是英语habitat（栖息地）、inhabit（居住于）、habitation（居所）等词的词源之一，核心概念都是“住在某处/让某处成为家”。","严格来说它不是现代英语单词，更多出现在拉丁语学习、古典文献、词源学或学术注释中。"]}
{"word":"habitat","summary":{"en":"A habitat is the natural home or environment where a living thing normally lives; it can also mean a designed living environment (e.g., in a zoo).","zh":"Habitat 指生物通常生活的自然栖息地，也可指人为设计的生活环境（如动物园的饲养环境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the natural home or environment of an animal, plant, or other organism; the place where it normally lives and grows","zh":"（动植物等的）栖息地；自然生境；其正常生活与生长的环境"},"examples":[{"en":"Pandas live in the mountain forests, which are their natural habitat.","zh":"熊猫生活在山地森林中，那是它们的自然栖息地。"},{"en":"Protecting wetlands helps preserve the habitat of many birds and fish.","zh":"保护湿地有助于保存许多鸟类和鱼类的栖息地。"},{"en":"This species can’t survive if its habitat is destroyed.","zh":"如果栖息地被破坏，这个物种就无法生存。"}]},{"partOfSpeech":"n.","definition":{"en":"a place designed or used as a living environment for people or animals (often in a science, zoo, or housing context)","zh":"（人为设计或使用的）居住环境；（动物园/科研等的）饲养环境；（某类人群的）生活空间"},"examples":[{"en":"The zoo built a new habitat for the polar bears.","zh":"动物园为北极熊建了一个新的生活环境（栖息环境）。"},{"en":"Scientists created a habitat that can support plants on Mars-like soil.","zh":"科学家创造了一个能在类火星土壤上支持植物生长的环境。"}]}],"synonyms":["home","natural environment","ecosystem","living environment"],"phonetic":"/ˈhæbɪtæt/","extraExplanation":["“Habitat”常用于环保与生态语境，搭配很固定：natural habitat（自然栖息地）、loss of habitat（栖息地丧失）、habitat destruction（栖息地破坏）、protect/preserve a habitat（保护/保存栖息地）。","词源来自拉丁语 habitare（居住），因此也可引申为“居住环境”，但最常见仍是指动植物的自然生境。"]}
{"word":"habitatal","summary":{"en":"“Habitatal” is an uncommon word meaning “related to a habitat.” In most writing, use “habitat,” “habitat-related,” or “environmental” instead.","zh":"“habitatal”很少见，意思是“与栖息地有关的”。多数写作中更建议用“habitat / habitat-related / environmental”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon/nonstandard) Relating to a habitat (the natural home or environment of an animal, plant, or other organism).","zh":"（不常见/非规范用法）与“栖息地”有关的；栖息地的。"},"examples":[{"en":"Researchers compared habitatal conditions in the wetlands and the nearby forest.","zh":"研究人员比较了湿地与附近森林的栖息地条件。"},{"en":"Protecting habitatal diversity helps many species survive.","zh":"保护栖息地多样性有助于许多物种生存。"}]}],"synonyms":["habitat-related","habitat-specific","environmental"],"phonetic":"/ˌhæbəˈtætəl/","extraExplanation":["“habitatal”在标准英语里非常少见，很多情况下更常用的是：\n- habitat (n.) 栖息地：the habitat of pandas\n- habitat-related / habitat-specific (adj.) 与栖息地相关/特定栖息地的\n- environmental (adj.) 环境的（更泛）\n如果你是在论文或报告里写作，建议优先用“habitat-related”或直接用“habitat”搭配名词（如 habitat conditions / habitat loss）。"]}
{"word":"habitate","summary":{"en":"“Habitate” is a rare, sometimes nonstandard verb meaning “to inhabit/live in,” or (rarely) “to provide habitat for.”","zh":"“habitate”是较少见、在某些语境下不太标准的动词，可表示“居住/栖息”，或（更少见）“为……提供栖息地”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare or nonstandard) to live in a place; to inhabit.","zh":"（少见或不太标准）居住在某地；栖息在某处。"},"examples":[{"en":"Few people use “habitate” in everyday English; “inhabit” is more common.","zh":"“habitate”在日常英语中很少用；更常见的是“inhabit”。"},{"en":"Some articles say certain animals habitate near rivers, but “live” or “inhabit” sounds more natural.","zh":"有些文章会写某些动物“habitate”在河边，但用“live”或“inhabit”更自然。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Ecology, rare) to provide a habitat for; to make an environment suitable for living.","zh":"（生态学中，少见）为……提供栖息地；使环境适合生存。"},"examples":[{"en":"Wetlands can habitate many kinds of birds.","zh":"湿地可以为许多种鸟类提供栖息地。"},{"en":"In most writing, people would say wetlands “provide habitat for” wildlife.","zh":"在多数写作中，人们会说湿地“provide habitat for（为……提供栖息地）”野生动物。"}]}],"synonyms":["inhabit","live (in)","reside","occupy","provide habitat for"],"phonetic":"/ˈhæbɪˌteɪt/","extraExplanation":["“habitate”在现代英语里不常见，很多读者会把它看成不太规范的用法。想表达“居住/栖息”，更推荐：inhabit / live in；想表达“提供栖息地”，更推荐：provide habitat for / support wildlife。","容易混淆的词：habitat（n. 栖息地）是常用词；inhabit（v. 居住/栖息）是更标准、更常见的动词。"]}
{"word":"habitatio","summary":{"en":"Habitatio is a rare, formal noun meaning a legal right to live in a dwelling (especially in Roman/civil law), or more generally “habitation.”","zh":"Habitatio 是一个罕见且正式的名词，主要指（尤在罗马法/大陆法系中）对住宅的居住权，也可泛指“居住/居所生活”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, formal) A right to live in or occupy a house or dwelling (especially in Roman/civil law), often without owning it.","zh":"（法律/正式）居住权：在不拥有房屋所有权的情况下，依法在某处住宅中居住或占用的权利（尤见于罗马法/大陆法系语境）。"},"examples":[{"en":"Under Roman law, habitatio allowed someone to live in a house even if they did not own it.","zh":"在罗马法中，habitatio 允许某人即使不拥有房屋，也可以在其中居住。"},{"en":"The will granted her habitatio of the apartment for life.","zh":"遗嘱授予她对该公寓的终身居住权（habitatio）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Habitation; living or dwelling in a place.","zh":"（罕见）居住；居所生活。"},"examples":[{"en":"The author used the Latin word habitatio to mean “dwelling” in an old text.","zh":"作者在一篇古旧文本中用拉丁词 habitatio 表示“居住/居所”。"}]}],"synonyms":["right of residence","right of habitation","habitation","occupancy (right)"],"phonetic":"/ˌhæbəˈteɪʃiˌoʊ/","extraExplanation":["habitatio 来自拉丁语，字面与 “居住” 有关。在英语里它非常少见，多出现在讨论罗马法或大陆法系概念的文章中。日常英语更常用 habitation（居住/居所）或 right of residence（居住权）。","不要把 habitatio 当作 habitat（栖息地）。habitat 是现代英语常用词，指动植物的自然生境；habitatio 则更偏法律/古典用语。"]}
{"word":"habitation","summary":{"en":"“Habitation” means a home/dwelling or the act/state of living somewhere, often in formal or legal writing.","zh":"“habitation”指“住所/住处”或“居住（的行为与状态）”，多见于正式或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place where someone lives; a home or dwelling (often used in formal or legal contexts).","zh":"居所；住所；住处（常用于较正式或法律语境）"},"examples":[{"en":"The campsite is not intended for permanent habitation.","zh":"这个营地不适合长期居住。"},{"en":"The law protects the habitation of a tenant.","zh":"法律保护房客的居住权（及其住所）。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or state of living in a place; occupancy.","zh":"居住；居住状态；占用（某处）"},"examples":[{"en":"Human habitation of the island began thousands of years ago.","zh":"人类对这座岛的居住始于数千年前。"},{"en":"The building shows signs of long habitation.","zh":"这栋楼显示出长期有人居住的迹象。"}]}],"synonyms":["dwelling","residence","home","occupancy","lodging"],"phonetic":"/ˌhæbɪˈteɪʃən/","extraExplanation":["“habitation”比较书面，常见于法律、政府文件、新闻或学术写作。日常口语里更常说 “home / house / place to live / live (somewhere)”。","词根提示：habit- 与 “habit（习惯）”同源，都来自拉丁语，含“经常待在/居住”的意思；-ation 表示“行为/状态”，因此 habitation 可理解为“居住的状态/行为”。"]}
{"word":"habitational","summary":{"en":"Habitational means “related to living/housing; residential,” and is used mostly in formal or academic contexts.","zh":"habitational 指“与居住/住房有关的；住宅的”，多用于正式或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to habitation (living in a place) or housing; residential in nature","zh":"与居住（在某地生活）或住房有关的；居住性的；住宅的"},"examples":[{"en":"The report focuses on habitational conditions, such as crowding and indoor air quality.","zh":"该报告关注居住条件，例如拥挤程度和室内空气质量。"},{"en":"They are studying habitational patterns in coastal villages.","zh":"他们正在研究沿海村落的居住模式。"}]}],"synonyms":["residential","housing-related","domestic","habitative"],"phonetic":"/ˌhæbɪˈteɪʃənəl/","extraExplanation":["“habitational”在日常英语中不算常见，更多出现在学术、统计、公共卫生、城市规划、房地产法律/政策等语境里。日常表达里通常用更自然的词：residential（住宅的）、housing（住房的/与住房有关的）、living conditions（生活/居住条件）。","词源上与habit（习惯）不同，它来自habitation（居住、住所），核心含义是“居住/可居住”。如果你想表达“适合居住的”，更常用habitable（可居住的）。"]}
{"word":"habitations","summary":{"en":"“Habitations” means homes/dwellings or places where people/animals live; it can also mean the state of living in a place (formal).","zh":"“habitations”指住所/居住地（也可指动物栖息地）；也可指“居住”这一状态（较正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Places where people or animals live; homes or dwellings (plural of “habitation”).","zh":"（habitation 的复数）居住地；住所；栖息地。"},"examples":[{"en":"The researchers recorded the habitats and habitations of local wildlife near the river.","zh":"研究人员记录了河流附近当地野生动物的栖息地和居住地。"},{"en":"In the old village, the stone habitations were built to stay cool in summer.","zh":"在那个古老的村庄里，石头住所建造得能在夏天保持凉爽。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or state of living in a place; residence (less common, often in formal writing).","zh":"居住的行为或状态；居住（较少见，多用于较正式的表达）。"},"examples":[{"en":"The report discussed human habitations in the coastal region over the past century.","zh":"报告讨论了过去一个世纪里沿海地区人类的居住情况。"},{"en":"Early habitations along the trail changed as new roads were built.","zh":"随着新道路修建，步道沿线早期的居住状况发生了变化。"}]}],"synonyms":["dwellings","homes","residences","abodes","living quarters","settlements"],"phonetic":"/ˌhæbəˈteɪʃənz/","extraExplanation":["“habitation/habitations”属于偏书面、偏正式的词。日常口语里更常说 home, house, place to live, living area；讲动物时更常说 habitat（栖息地）。","在文学或历史语境中，habitation 常用来描写“人类居住的痕迹/聚落”，带一点“长久生活过”的感觉，比如古代遗址、边疆定居点等。"]}
{"word":"habitative","summary":{"en":"“Habitative” means “related to living or habitation,” often used in scientific or formal contexts.","zh":"“habitative”意为“与居住/栖居有关的”，多见于正式或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to living in a place (habitation), especially the conditions or features of a place that make it suitable to live in.","zh":"与居住/栖居有关的；尤指某地适合居住的条件或特征。"},"examples":[{"en":"Researchers studied the habitative needs of the species before releasing it into the wild.","zh":"研究人员在将该物种放归野外前，先研究了它的栖居需求。"},{"en":"The report focuses on habitative conditions such as clean water and safe shelter.","zh":"报告重点讨论清洁用水和安全住所等居住条件。"}]}],"synonyms":["habitable","residential","inhabited","housing-related","habitat-related"],"phonetic":"/ˈhæbɪˌteɪtɪv/","extraExplanation":["“habitative”并不是日常英语里很常见的词，更常见的说法是：**habitable**（适合居住的）、**residential**（居住的/住宅的）、或在生态学语境中用 **habitat / habitat-related**（栖息地/与栖息地相关的）。","词根来自拉丁语 *habitare*（居住），和 **habit**（习惯）同源：原义都与“经常住在/常驻”有关。"]}
{"word":"habitator","summary":{"en":"Habitator means an inhabitant; it’s a rare, old-fashioned word for someone (or an animal) living in a place.","zh":"habitator 指“居住者/居民（或某地的动物栖息者）”，属于较少用、略带古典或旧式色彩的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or animal that lives in a particular place; an inhabitant (rare).","zh":"居住在某地的人或动物；居住者、居民（较少用）。"},"examples":[{"en":"The island’s early habitators depended on fishing and trade.","zh":"这座岛早期的居住者依靠捕鱼和贸易为生。"},{"en":"In the novel, the forest habitators seem to know every hidden path.","zh":"在小说里，森林的居住者似乎知道每一条隐秘小路。"},{"en":"Many habitators of the valley left after the flood.","zh":"洪水过后，山谷里的许多居民离开了。"}]}],"synonyms":["inhabitant","resident","dweller","occupant"],"phonetic":"/ˈhæbɪˌteɪtər/","extraExplanation":["“habitator”在现代英语里非常少见，更常用的词是“inhabitant”“resident”“dweller”。在诗歌、旧文或带有古典（拉丁语）风格的写作中可能会见到，用来强调“栖居/居住者”的感觉。","词源可追溯到拉丁语 habitator（居住者），与“inhabit（居住）”“habitat（栖息地）”同源，因此有时也可指动物的“栖息者”。"]}
{"word":"habitats","summary":{"en":"Habitats are the natural places where living things live; it can also mean a familiar place where people like to spend time.","zh":"Habitat(s) 指动植物的自然栖息地；也可引申为人们常待且感到自在的环境或场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the natural home or environment where an animal, plant, or other living thing normally lives and grows","zh":"（动植物等的）栖息地；生境"},"examples":[{"en":"Polar bears’ habitats are shrinking because of warming temperatures.","zh":"由于气温升高，北极熊的栖息地正在缩小。"},{"en":"Protecting wetlands helps many birds that share the same habitat.","zh":"保护湿地有助于许多共享同一栖息地的鸟类。"}]},{"partOfSpeech":"n.","definition":{"en":"a place where a person spends time, especially one that feels comfortable or familiar","zh":"（人经常待的）活动场所；舒适或熟悉的环境"},"examples":[{"en":"The local café became their favorite habitat for studying and chatting.","zh":"那家本地咖啡馆成了他们学习和聊天最喜欢的去处。"},{"en":"For many artists, the studio is a creative habitat.","zh":"对许多艺术家来说，工作室是一个充满创意的“栖居地”。"}]}],"synonyms":["environment","home","natural home","living space"],"phonetic":"ˈhæbəˌtæt","extraExplanation":["“Habitat”常用于环保与生态语境：如 natural habitat（自然栖息地）、loss of habitat（栖息地丧失）、habitat protection（栖息地保护）。","词形：habitat（单数）→ habitats（复数）。常见搭配：a marine/desert/forest habitat（海洋/沙漠/森林栖息地）。","相关词：ecosystem（生态系统，强调系统与相互关系），environment（环境，更广泛，含人类生活条件），niche（生态位，强调“角色/位置”，更专业）。"]}
{"word":"habited","summary":{"en":"Habited means ‘dressed in a particular way’ (often religious clothing); rarely, it can mean ‘inhabited’ in literary use.","zh":"habited通常指“穿着某种服饰”（常见于宗教服装语境）；少见的文学用法中也可指“有人居住的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually in the passive) dressed or clothed in a particular way, especially wearing a religious or formal outfit.","zh":"（多用于被动）穿着某种衣服；尤指穿着宗教服饰或正式制服。"},"examples":[{"en":"The monks were habited in simple brown robes.","zh":"僧侣们穿着朴素的棕色长袍。"},{"en":"She was habited like a nun for the play.","zh":"在那出戏里，她装扮得像一位修女。"},{"en":"The guard was neatly habited in a dark uniform.","zh":"那名警卫穿着深色制服，十分整洁。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary, rare) lived in; inhabited.","zh":"（文学用法，罕见）有人居住的；有人栖居的（= inhabited）。"},"examples":[{"en":"Beyond the river lay a habited valley.","zh":"河的那一边是一片有人居住的山谷。"},{"en":"They searched for a habited island, not an empty rock.","zh":"他们寻找的是有人居住的岛屿，而不是一块荒岩。"}]}],"synonyms":["clothed","dressed","robed","attired","garbed"],"phonetic":"/ˈhæbɪtɪd/","extraExplanation":["“habited”来自名词/动词habit（习惯；衣着）。在较常见的用法里，它指“穿着（某种衣服）”，尤其出现在宗教或文学语境中（例如修道士/修女的长袍）。","学习时要小心和“inhabited”（有人居住的）区分：现代英语里表示“有人居住”通常用inhabited；habited用这个意思偏文学、较少见。"]}
{"word":"habiting","summary":{"en":"“Habiting” usually means “making something a habit / getting used to something,” and more rarely “dressing someone in a particular style (especially religious or uniform clothing).”","zh":"“habiting”通常表示“使……成为习惯/让……习惯于……”，较少见时表示“给……穿上某种特定服饰（尤指法衣或制服）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “habit”: to make something a habit; to accustom (someone/oneself) to something.","zh":"“habit”的现在分词：使……成为习惯；使（某人/自己）习惯于……"},"examples":[{"en":"Over time, the coach is habiting the team to start practice exactly on time.","zh":"随着时间推移，教练在让球队养成准时开始训练的习惯。"},{"en":"She’s habiting herself to drink more water every day.","zh":"她正在让自己习惯每天多喝水。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of a rarer sense of “habit”: to dress or clothe, especially in a particular style or uniform.","zh":"“habit”的较少见用法的现在分词：给……穿衣/穿上制服（尤指某种特定样式）。"},"examples":[{"en":"The actors are habiting themselves in period costumes for the play.","zh":"演员们正在为这部戏穿上年代服装。"},{"en":"The monks were habiting new members in simple robes.","zh":"僧侣们为新成员穿上朴素的袍服。"}]}],"synonyms":["forming (a habit)","accustoming","conditioning","dressing","clothing","robbing"],"phonetic":"/ˈhæbɪtɪŋ/","extraExplanation":["“habit”最常见的名词义是“习惯”；同时它也可以指宗教人士的“法衣/修会服”（a monk’s habit）。因此在较文学或历史语境里，habit 也可作动词表示“给……穿上某种服饰/制服”。在现代日常英语里，这个动词用法较少见，更常说 dress / clothe / put on。"]}
{"word":"habits","summary":{"en":"“Habits” is the plural of “habit,” meaning regular behaviors (often automatic); it can also mean hard-to-stop behaviors (bad habits) or special clothing like a nun’s habit.","zh":"“habits”是“habit”的复数，指经常性的（常不自觉的）行为习惯；也可指难以戒掉的习性（坏习惯）；还可指如修女服等特定制服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A usual way of behaving; something you do regularly, often without thinking about it.","zh":"习惯；经常性的行为方式（常常是不自觉的）。"},"examples":[{"en":"Drinking water first thing in the morning is a healthy habit.","zh":"早上起床先喝水是个健康的习惯。"},{"en":"She has a habit of checking her phone during meetings.","zh":"她有个习惯：开会时总会看手机。"}]},{"partOfSpeech":"n.","definition":{"en":"A pattern of behavior that is hard to stop, especially a negative one (often used in plural: bad habits).","zh":"（尤指难以戒掉的）习性；恶习（常用复数：bad habits）。"},"examples":[{"en":"He’s trying to break some bad habits like staying up too late.","zh":"他在努力改掉一些坏习惯，比如熬夜太晚。"},{"en":"Good habits take time to build.","zh":"好习惯需要时间养成。"}]},{"partOfSpeech":"n.","definition":{"en":"Regular clothing worn by a group for a specific role, especially by nuns or monks (a “religious habit”).","zh":"（特定身份的）制服；（尤指）修女/僧侣的服装（religious habit）。"},"examples":[{"en":"The nun wore a simple black habit.","zh":"这位修女穿着朴素的黑色修女服。"}]}],"synonyms":["routines","customs","practices","patterns"],"phonetic":"/ˈhæbɪts/","extraExplanation":["“habit”来自拉丁语 habitus，原意与“状态、样貌、穿着方式”有关，所以它既能表示“行为习惯”，也能表示“（修女等的）服装”。","常见搭配：form/develop a habit（养成习惯）、break a habit（改掉习惯）、get into the habit of + V-ing（养成做……的习惯）、creature of habit（习惯成自然的人）。"]}
{"word":"habitu","summary":{"en":"A habitué is a regular, frequent visitor of a particular place.","zh":"habitué 指某个地方的常客、熟客。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a regular customer or frequent visitor of a particular place (such as a café, bar, or theater)","zh":"（某处的）常客；熟客（如咖啡馆、酒吧、剧院等的常去者）"},"examples":[{"en":"She’s a habitué of the small jazz club downtown.","zh":"她是市中心那家小爵士俱乐部的常客。"},{"en":"The café’s habitués knew the owner by name.","zh":"那家咖啡馆的熟客都认识老板的名字。"},{"en":"As a habitué, he always gets the same seat by the window.","zh":"作为常客，他总能坐到靠窗的同一个位子。"}]}],"synonyms":["regular","frequent visitor","patron","clientele member"],"phonetic":"/həˌbɪtʃuˈeɪ/","extraExplanation":["“habitué”是从法语借词进入英语的，原意与“习惯/常常去”有关。在英语里多用于较正式或带点文艺气息的语境（如谈论咖啡馆、酒吧、艺术场所的熟客）。","拼写上常见带重音符号的“habitué”（有时也写作habitue）。重音符号在英语文本里有时会省略，但读音和意思不变。"]}
{"word":"habitual","summary":{"en":"Habitual means something you do regularly as a habit; it can also describe repeated bad behavior (e.g., habitual smoker/offender).","zh":"habitual 表示“习惯性的、经常的、一贯的”；也常用于描述反复的不良行为（如 habitual smoker/offender）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"done regularly or repeatedly; typical of someone because it happens often.","zh":"习惯性的；经常发生的；某人一贯的（因为常常如此）。"},"examples":[{"en":"She’s a habitual early riser, so she’s usually at her desk by 7 a.m.","zh":"她习惯早起，所以通常早上7点就到工位了。"},{"en":"His habitual response was to apologize, even when it wasn’t his fault.","zh":"他的惯常反应是道歉，即使不是他的错。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a bad behavior) repeated so often that it feels like a fixed pattern, sometimes suggesting addiction.","zh":"（尤指不良行为）反复到像固定模式一样；有时暗示成瘾或难以改掉。"},"examples":[{"en":"The clinic offers support for habitual smokers who want to quit.","zh":"这家诊所为想戒烟的长期/习惯性吸烟者提供支持。"},{"en":"The law can treat someone as a habitual offender if they commit similar crimes repeatedly.","zh":"如果某人反复实施类似犯罪，法律可能将其视为“惯犯”。"}]}],"synonyms":["customary","regular","usual","routine","ingrained"],"phonetic":"/həˈbɪtʃuəl/","extraExplanation":["“habitual”常用于较正式的书面语，强调“长期形成的习惯/一贯如此”。口语里也常用“usual / regular / always”来表达类似意思，但“habitual”更强调“习惯造成的固定模式”。","常见搭配：habitual + action/behavior（habitual behavior 习惯性行为）；habitual + person（a habitual liar 惯于说谎的人）；habitual + noun（habitual smoker 长期吸烟者；habitual offender 惯犯，偏法律用语）。","词源上与“habit（习惯）”同源；注意不要把它和“habitat（栖息地）”混淆。"]}
{"word":"habituality","summary":{"en":"Habituality means the quality of doing something regularly as a habit; in linguistics, it refers to the “habitual” meaning/aspect (repeated or typical actions over time).","zh":"Habituality 指“习惯性、经常反复做某事的特征”；在语言学中也指“习惯体/习惯意义”，表达某动作长期反复或通常如此。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being habitual; doing something regularly as a habit","zh":"习惯性；经常反复做某事的状态（形成习惯的性质）"},"examples":[{"en":"Morning exercise became part of her habituality after a few months.","zh":"几个月后，晨练成了她生活中的一种习惯性。"},{"en":"The study looked at the habituality of phone-checking during meals.","zh":"这项研究考察了人们在吃饭时查看手机的习惯性。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) the meaning or grammatical feature that expresses an action or state happening repeatedly or typically over time (the “habitual” aspect)","zh":"（语言学）“习惯体/习惯意义”：表示某动作或状态在一段时间内反复发生或通常如此的语法意义"},"examples":[{"en":"In some languages, habituality is marked by special verb forms.","zh":"在一些语言中，“习惯体”会用特殊的动词形式来标记。"},{"en":"“I walk to work” can suggest habituality when used to mean a regular routine.","zh":"“I walk to work”当表示日常规律时，可以带有“习惯性”的意思。"}]}],"synonyms":["habitual nature","habitualness","regularity","routineness","habitual aspect"],"phonetic":"/həˌbɪtʃuˈælɪti/","extraExplanation":["“habituality”比“habit”更抽象：habit 是“一个具体习惯”（比如咬指甲），habituality 是“习惯性的特征/程度”（比如某行为有多规律、是否长期反复）。","语言学里常与 habitual（习惯体/习惯意义）一起出现。英语通常不靠专门词形变化来标记“习惯体”，更多依赖语境或频率副词（often, usually 等）；而有些语言会有专门的动词形式或助词来表达 habituality。"]}
{"word":"habitualize","summary":{"en":"Habitualize means to make something become a habit (or, less commonly, to become habitual).","zh":"habitualize 指“使某事习惯化、养成习惯”（较少也可指“变成习惯”）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something become a habit through repeated practice; to train yourself (or someone) to do something regularly and automatically","zh":"使（某事）习惯化；通过反复练习让自己（或他人）养成习惯、变得自然而然"},"examples":[{"en":"She habitualized a short walk after dinner, and now she does it without thinking.","zh":"她把晚饭后散步变成了习惯，现在几乎不假思索就会去走。"},{"en":"The app helps users habitualize healthy eating by sending reminders and tracking meals.","zh":"这个应用通过提醒和记录饮食，帮助用户把健康饮食习惯化。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become habitual; to turn into a regular pattern of behavior (less common)","zh":"变成习惯；形成固定的行为模式（较少见）"},"examples":[{"en":"Over time, checking his phone first thing in the morning habitualized.","zh":"久而久之，他一早醒来就看手机这件事变成了习惯。"}]}],"synonyms":["form a habit","build a habit","make it a habit","habituate","condition"],"phonetic":"/həˈbɪtʃuəˌlaɪz/","extraExplanation":["“habitualize”并不算常用词，写作和口语里更常见的是“form a habit / build a habit / make it a habit”，或更正式的“habituate”。","词形提示：habit（习惯）+ -ual（…的）+ -ize（使…化）。因此它的核心含义就是“让某事变成习惯”。"]}
{"word":"habitually","summary":{"en":"“Habitually” means “as a habit; regularly in a usual pattern,” often suggesting a long-term repeated behavior.","zh":"“habitually”表示“习惯性地；经常以固定模式发生”，常强调长期反复的行为模式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that happens regularly or as a usual habit.","zh":"习惯性地；经常地（以固定习惯或常态的方式发生）。"},"examples":[{"en":"He habitually checks his phone as soon as he wakes up.","zh":"他一醒来就习惯性地查看手机。"},{"en":"She habitually speaks softly, even in noisy places.","zh":"她即使在很吵的地方也习惯性地轻声说话。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Legal or formal) Repeatedly and often, so that it can describe a long-standing pattern of behavior.","zh":"（法律/正式语境）反复地、经常地（强调长期形成的行为模式）。"},"examples":[{"en":"The report described him as habitually absent from work.","zh":"报告称他长期以来经常缺勤。"},{"en":"The law may treat habitually offending more seriously.","zh":"法律可能会更严肃地对待屡犯者。"}]}],"synonyms":["usually","regularly","often","customarily","routinely"],"phonetic":"/həˈbɪtʃuəli/","extraExplanation":["“habitually”常带有“长期如此、几乎不经思考就会这样做”的含义，有时会暗示这是一个不太好的习惯（例如 habitually late 习惯性迟到），但也可以是中性或好的习惯。","常见搭配：habitually late（总是迟到）、habitually absent（经常缺席）、habitually + 动词（habitually smoke/drink/check）。","词源提示：来自 habit（习惯）+ -ual（……的）+ -ly（副词）。与“usually/often”相比，“habitually”更强调“习惯驱动、固定模式”。"]}
{"word":"habitualness","summary":{"en":"Habitualness means the state or quality of being habitual—happening regularly as a habit.","zh":"habitualness 指“习惯性”，强调某事经常、反复发生的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being habitual; doing something regularly or automatically as a habit","zh":"习惯性；经常性的状态（指某事经常或下意识地反复发生）"},"examples":[{"en":"The habitualness of his morning routine made him feel calm and focused.","zh":"他早晨例行活动的习惯性让他感到平静而专注。"},{"en":"In language learning, the habitualness of daily practice matters more than long study sessions once a week.","zh":"在语言学习中，每天练习的习惯性比每周一次的长时间学习更重要。"},{"en":"The report noted the habitualness of late arrivals and suggested clearer expectations.","zh":"报告指出迟到具有习惯性，并建议设定更明确的要求。"}]}],"synonyms":["regularity","routineness","habitual behavior","customariness","automaticity"],"phonetic":"/həˈbɪtʃuəl.nəs/","extraExplanation":["“habitualness”由 habitual（习惯性的）+ -ness（名词后缀，表示“……的性质/状态”）构成，但在日常英语中比较少见。更常用的表达是：habit / habit-forming behavior / regularity / routine。","语域上更偏正式或学术写作，用来强调“某种行为的持续性、反复性”这一特征，而不只是“一个习惯”本身。"]}
{"word":"habitualnesses","summary":{"en":"“Habitualnesses” means repeated, customary patterns or the state of being habitual (plural). It’s uncommon; “habits” or “habitual behaviors” is more natural.","zh":"“habitualnesses”指多种“习惯性/常态化”的特质或模式（复数）。较少使用，更自然的说法是“habits”或“habitual behaviors”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the qualities or states of being habitual; repeated, customary patterns (plural of “habitualness”)","zh":"习惯性；常态化的特质或状态（“habitualness”的复数），指反复出现、按习惯进行的模式"},"examples":[{"en":"Different workplaces have different habitualnesses, like how meetings usually start on time or run late.","zh":"不同的工作场所有不同的“习惯性”，比如会议通常准时开始还是经常拖延。"},{"en":"She studied the habitualnesses of his speech, noticing he always apologized before disagreeing.","zh":"她观察了他说话的习惯性，注意到他总是在反对之前先道歉。"}]}],"synonyms":["habits","routines","patterns","customary behaviors","regularities"],"phonetic":"/həˈbɪtʃuəlˌnɛsɪz/","extraExplanation":["“habitualnesses”在实际英语中非常少见，更多时候母语者会说：habits（习惯）、habitual behavior(s)（习惯性行为）、routine(s)（日常惯例）、patterns（模式）。","构词提示：habit（习惯）→ habitual（习惯性的）→ habitualness（习惯性这一特质）→ habitualnesses（多个“习惯性特质/模式”）。通常只有在学术写作或刻意强调“多种不同的习惯性特征”时才可能用复数。"]}
{"word":"habituate","summary":{"en":"Habituate means to become used to something, or to make someone/something become used to it through repeated experience.","zh":"Habituate 指（通过反复经历）逐渐习惯/适应某事，也可指使某人或动物习惯于某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to become used to something through repeated experience; to adjust so it feels normal","zh":"（因反复经历而）习惯于；适应，使之变得“正常/不陌生”"},"examples":[{"en":"It takes time to habituate to a new routine.","zh":"适应新的作息需要时间。"},{"en":"Residents quickly habituated to the noise of the city.","zh":"居民很快就习惯了城市的噪音。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause a person or animal to become used to something (often used in passive form)","zh":"使（人或动物）习惯于（常用于被动语态）"},"examples":[{"en":"The baby was gradually habituated to sleeping without a night light.","zh":"宝宝逐渐习惯了不开小夜灯睡觉。"},{"en":"The monkeys have been habituated to humans and no longer run away.","zh":"这些猴子已经习惯了人类，不再逃跑。"}]}],"synonyms":["get used to","become accustomed to","acclimate (to)","adapt (to)","condition"],"phonetic":"/həˈbɪtʃuˌeɪt/","extraExplanation":["在日常英语中，人们更常说 get used to / become used to（习惯于），或 acclimate/adjust to（适应）。habituate 更偏书面语，也常见于心理学与动物行为学语境（如野生动物“对人类习惯化”）。","搭配提示：habituate to + 名词/动名词（habituate to the cold / habituate to getting up early）。也常用被动：be habituated to…（已经习惯于……）。","词源上与 habit（习惯）同源，核心含义是“通过重复形成习惯/让某事变成常态”。"]}
{"word":"habituated","summary":{"en":"Habituated means “used to something” because it happens often, especially in formal contexts.","zh":"Habituated 指“因为经常发生而习惯/适应”，语气较正式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"accustomed to something because you have experienced it often; used to it","zh":"因为经常经历而习惯于某事；对……已经适应"},"examples":[{"en":"After a few months, she became habituated to the early mornings.","zh":"几个月后，她就习惯了早起。"},{"en":"He was habituated to the noise of the city and slept easily.","zh":"他已经适应了城市的噪音，所以很容易入睡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(especially in formal or academic English) regularly using or taking something, so it feels normal","zh":"（尤用于正式或学术语境）经常使用或摄入某物，以至于觉得很正常"},"examples":[{"en":"Some people become habituated to caffeine and need more to feel awake.","zh":"有些人会对咖啡因产生习惯（耐受），需要更多才能清醒。"},{"en":"The body can become habituated to a certain level of stress.","zh":"身体可能会适应某种程度的压力。"}]}],"synonyms":["accustomed","used to","adapted","conditioned"],"phonetic":"/həˈbɪtʃuˌeɪtɪd/","extraExplanation":["“habituated”常和介词to连用：be habituated to + 名词/动名词（doing）。意思接近“be used to”，但语气更正式、书面。","词根habit（习惯）来自拉丁语habitus（状态、习性）。在心理学里，habituation（习惯化）指对重复刺激反应减弱。"]}
{"word":"habituates","summary":{"en":"“Habituates” means “makes someone/animals used to something through repeated exposure.”","zh":"“habituates”表示“通过反复接触使（人/动物）习惯、适应”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular of “habituate”) to make someone (or an animal) used to something through repeated experience; to acclimate.","zh":"（habituate 的第三人称单数）使（人或动物）因反复接触而习惯某事；使适应。"},"examples":[{"en":"The trainer habituates the dogs to loud noises so they won’t panic.","zh":"训练员让狗反复接触大噪音，使它们习惯后不再惊慌。"},{"en":"Daily practice habituates students to speaking English in class.","zh":"每天练习让学生习惯在课堂上说英语。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Less common) to become used to something; to form a habit.","zh":"（较少见）变得习惯某事；形成习惯。"},"examples":[{"en":"Over time, she habituates to the new routine.","zh":"久而久之，她逐渐习惯了新的作息。"}]}],"synonyms":["accustoms","conditions","acclimates","trains","desensitizes"],"phonetic":"/həˈbɪtʃuˌeɪts/","extraExplanation":["“habituate”更常用作及物动词：habituate someone/animal to something（使……习惯于……）。也常见反身用法：habituate oneself to…（让自己适应……）。","和“get used to”相比，“habituate”更正式，常用于心理学、动物行为学、训练与研究语境。"]}
{"word":"habituating","summary":{"en":"“Habituating” means accustoming someone/something to something, or gradually becoming used to something through repetition.","zh":"“habituating”表示“使……逐渐习惯/适应”，或“自己逐渐习惯”，强调通过反复接触形成习惯的过程。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle of “habituate”) making someone or something become used to a situation, place, or behavior; accustoming.","zh":"（“habituate”的现在分词）使（某人/某物）逐渐习惯于某种情境、环境或行为；使适应。"},"examples":[{"en":"The program is habituating new employees to the company’s routines.","zh":"这个项目正在让新员工逐渐习惯公司的日常流程。"},{"en":"Parents sometimes worry that constant screen time is habituating kids to instant entertainment.","zh":"父母有时担心持续的屏幕时间会让孩子习惯于即时娱乐。"}]},{"partOfSpeech":"vi.","definition":{"en":"(present participle of “habituate”) becoming used to something through repeated experience; getting accustomed.","zh":"（“habituate”的现在分词）因反复经历而逐渐习惯；逐渐适应。"},"examples":[{"en":"She is habituating to the early mornings after a few weeks on the new job.","zh":"新工作做了几周后，她正在逐渐适应早起。"},{"en":"If you keep practicing, you’re habituating to the rhythm of the language.","zh":"如果你持续练习，你会逐渐习惯这门语言的节奏。"}]}],"synonyms":["accustoming","conditioning","adapting","getting used to"],"phonetic":"/həˈbɪtʃuˌeɪtɪŋ/","extraExplanation":["“habituating”常见于较正式的写作或学术语境，比“getting used to”更书面。日常口语里更常说：get used to / get accustomed to。","常见搭配：habituate someone to sth（使某人习惯于……）；be habituated to sth（已习惯于……）。例如：He is habituated to working late（他已经习惯加班）。","注意：habituating（正在使/正在变得习惯）强调过程；habituated（已习惯）强调结果状态。"]}
{"word":"habituation","summary":{"en":"Habituation is the process of getting used to something through repetition, often described in psychology as reduced response to a repeated harmless stimulus.","zh":"Habituation 指因反复接触而逐渐“习惯”，在心理学中常指对重复且无害的刺激反应减弱的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming used to something through repeated exposure, so you react less strongly over time","zh":"（因反复接触而）习惯化；逐渐适应，以至反应变弱的过程"},"examples":[{"en":"After a few weeks of living near the train tracks, habituation made the noise easier to ignore.","zh":"在铁路旁住了几周后，习惯化让火车噪音更容易被忽略。"},{"en":"Therapists sometimes use gradual exposure to support habituation to feared situations.","zh":"治疗师有时会用逐步暴露来帮助人们对恐惧情境产生习惯化。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/psychology) a simple form of learning in which an organism reduces its response to a repeated, harmless stimulus","zh":"（生物/心理）一种简单的学习形式：对重复且无害的刺激反应逐渐减弱"},"examples":[{"en":"In experiments, snails show habituation when they stop pulling back after repeated gentle touches.","zh":"在实验中，蜗牛在反复被轻触后不再缩回去，表现出习惯化。"},{"en":"Habituation helps animals save energy by ignoring signals that don’t matter.","zh":"习惯化帮助动物忽略无关信号，从而节省能量。"}]}],"synonyms":["acclimatization","desensitization","adjustment"],"phonetic":"/həˌbɪtʃuˈeɪʃən/","extraExplanation":["常见搭配：habituation to + 名词/动名词（对……的习惯化/适应）。如 habituation to noise（对噪音的习惯化）。","区分：habituation（反应变弱）≠ addiction（成瘾，需要更多刺激）≠ adaptation（更广义的适应，可能包含身体或行为变化）。"]}
{"word":"habituations","summary":{"en":"“Habituations” means repeated processes or cases of becoming accustomed, especially the psychological/biological reduction in response to repeated harmless stimuli.","zh":"“Habituations”指多种或多个“习惯化/适应”的过程或案例，尤指心理学/生物学中对重复且无害刺激的反应逐渐减弱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of habituation) the process of becoming used to something through repeated experience; becoming accustomed.","zh":"（habituation 的复数）指通过反复接触而逐渐习惯某事物的过程；逐渐适应。"},"examples":[{"en":"After a few weeks of habituations to the new schedule, waking up early felt normal.","zh":"对新作息适应了几周后，早起就变得很正常了。"},{"en":"The team studied habituations to background noise in open-plan offices.","zh":"团队研究了在开放式办公室里人们对背景噪音的习惯化过程。"}]},{"partOfSpeech":"n.","definition":{"en":"(psychology/biology; plural) learning processes in which a person or animal responds less to a repeated, harmless stimulus over time.","zh":"（心理学/生物学；复数）指对重复且无害的刺激反应逐渐减弱的学习过程（习惯化）。"},"examples":[{"en":"These habituations help explain why people stop noticing a ticking clock.","zh":"这些习惯化现象能解释为什么人们后来会不再注意到钟表的滴答声。"},{"en":"Wildlife researchers avoid causing habituations that make animals too comfortable around humans.","zh":"野生动物研究者会避免引发让动物对人类过度“习惯化”的过程。"}]}],"synonyms":["habituation","acclimatization","adaptation","desensitization"],"phonetic":"/həˌbɪtʃuˈeɪʃən/","extraExplanation":["“Habituations”是“habituation”的复数形式，但在日常英语里更常直接用不可数名词“habituation”来泛指这一过程；当你要强调“多种不同的习惯化过程/案例”时，才更常见复数。","词根提示：habit（习惯）+ -uation（……化/过程），理解为“形成习惯/变得习惯的过程”。"]}
{"word":"habitude","summary":{"en":"Habitude means a habitual way of acting or a long-established custom; it’s more formal/literary than “habit.”","zh":"habitude 指“习惯/习性/惯例”，语气更正式或偏文学，比常用的 habit 更书面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A usual way of behaving; a habit, especially one that feels natural or automatic.","zh":"习惯；惯常的行为方式（尤指变得很自然、下意识的习惯）"},"examples":[{"en":"She has a habitude of reading before bed every night.","zh":"她有个习惯：每天睡前都要读书。"},{"en":"Over time, politeness became his habitude, not something he had to think about.","zh":"久而久之，礼貌成了他的习惯，不再需要刻意思考。"}]},{"partOfSpeech":"n.","definition":{"en":"Habitual state or condition; long-established practice (often in more formal or literary writing).","zh":"习性；习惯状态；长期形成的做法（常见于较正式或文学语境）"},"examples":[{"en":"In the habitude of the town, shops closed early on Sundays.","zh":"按照这个小镇的惯例，周日商店很早就关门。"},{"en":"Travel can break the old habitudes that quietly shape our days.","zh":"旅行能打破那些悄悄塑造我们日常的旧习性。"}]}],"synonyms":["habit","custom","practice","routine","pattern","manner"],"phonetic":"/ˈhæbɪˌtud/","extraExplanation":["“habitude”在现代英语中不算常用，更常见的是“habit”。它在语气上更偏正式/文学，有时用来强调“习惯已成自然的状态”。","词源上来自法语（habitude），与“habit”同源。写作中如果想更自然，日常场景多用“habit”；需要更书面、更强调“习惯状态”时才会看到“habitude”。"]}
{"word":"habitudes","summary":{"en":"“Habitudes” means a person’s usual habits or characteristic ways of behaving (formal, often plural). It can also mean being accustomed to something.","zh":"“habitudes”指（较正式、常用复数）一个人的习性/习惯性行为方式；也可指对某事逐渐“习惯、适应”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a usual way of behaving; a settled habit or characteristic tendency (often used in the plural: “habitudes”).","zh":"（常用复数）习性；习惯性的行为方式；（较固定的）做事风格"},"examples":[{"en":"Her morning habitudes include making tea and reading the news.","zh":"她早晨的习惯包括泡茶和看新闻。"},{"en":"The writer’s habitudes—careful observation and simple words—make the story feel real.","zh":"这位作家的写作习性——细致观察和朴素用词——让故事显得真实。"},{"en":"Changing long-standing habitudes can take time.","zh":"改变长期形成的习性可能需要时间。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being used to something; acclimation through repeated experience.","zh":"习惯化；由于反复经历而产生的适应（对某事变得“习惯了”）"},"examples":[{"en":"Habitude to the cold comes slowly if you’re new to winter weather.","zh":"如果你不习惯冬天，适应寒冷会比较慢。"},{"en":"With time, she developed habitude to the noisy city.","zh":"随着时间推移，她逐渐适应了喧闹的城市。"}]}],"synonyms":["habits","customs","routines","ways","tendencies","mannerisms"],"phonetic":"/ˈhæbɪˌtuːd/","extraExplanation":["“habitude”比较正式、文学感更强，日常英语里更常说“habit”。“habitudes”在写作中常用来强调一个人或群体“反复、稳定的生活方式或作风”。","词源来自法语/拉丁语，和“habit（习惯）”同源，但语气更偏“长期形成的习性/性情”。"]}
{"word":"habitudinal","summary":{"en":"Habitudinal means “habitual; describing what regularly happens,” mainly used in linguistics.","zh":"habitudinal 指“习惯性的、经常发生的”，主要用于语言学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Describing an action or state that happens regularly or typically—something that is a person’s habit.","zh":"（语言学）表示某个动作或状态经常、通常发生——也就是“习惯性的”。"},"examples":[{"en":"In some languages, a special verb form marks the habitudinal meaning: something you do regularly.","zh":"在一些语言里，会用特殊的动词形式来表达 habitudinal（习惯性）意义：表示你经常做的事。"},{"en":"The sentence “She walks to work” often has a habitudinal reading (it’s her routine).","zh":"句子 “She walks to work” 常常可以理解为 habitudinal（习惯性）：这是她的日常习惯。"},{"en":"Researchers compared the simple present and the habitudinal interpretation in everyday speech.","zh":"研究者比较了日常口语中一般现在时与“习惯性（habitudinal）”解读的关系。"}]}],"synonyms":["habitual","customary","regular","typical"],"phonetic":"/həˈbɪtʃuədnəl/","extraExplanation":["这个词在日常英语里很少单独出现，更多见于语言学/语法研究（academic writing）。在英语学习中，你更常遇到的相关表达是：habitual（更常用的形容词）以及“simple present / used to / would (in the past)”等用来表达习惯或经常发生的结构。"]}
{"word":"habitue","summary":{"en":"A habitué is a regular visitor to a particular place, often known by the staff or community there.","zh":"habitué 指经常光顾某个地方、在那儿很熟的“常客/老主顾”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who regularly goes to a particular place (such as a bar, café, club, or theater) and is well known there; a regular customer or attendee","zh":"（常去某地并为人熟知的）常客；老主顾；常到访者（如酒吧、咖啡馆、俱乐部、剧院等）"},"examples":[{"en":"She’s a habitué of the small coffee shop on the corner.","zh":"她是街角那家小咖啡馆的常客。"},{"en":"The bartender greeted the habitués by name.","zh":"酒保会叫出那些常客的名字来打招呼。"},{"en":"He became a habitué of the local theater after moving downtown.","zh":"搬到市中心后，他成了当地剧院的常客。"}]}],"synonyms":["regular","frequent visitor","patron","customer","steady"],"phonetic":"/həˌbɪtʃuˈeɪ/","extraExplanation":["“habitué”来自法语，意思与“经常去某处的人”有关；英语里多用于比较“文艺/社交场景”的语境（咖啡馆、酒吧、剧院等）。","拼写上常见法语重音符号：habitué；在英文写作中有时也会写作habitue（不带重音）。","注意与“habitual（习惯性的）/habit（习惯）”同源，但habitué指“人”，而habitual多形容“行为或模式”。"]}
{"word":"habitues","summary":{"en":"“Habitues” means people who are regular visitors to a particular place—regulars.","zh":"“habitues”指某个地方的常客、经常出入的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who regularly go to a particular place (such as a café, bar, gym, or theater); regular customers or frequent visitors.","zh":"常客；经常出入某处的人（如咖啡馆、酒吧、健身房、剧院等）。"},"examples":[{"en":"The café’s habitués started arriving early for their usual morning coffee.","zh":"这家咖啡馆的常客们一大早就来喝他们习惯的晨间咖啡。"},{"en":"She became one of the bookstore’s habitués after moving into the neighborhood.","zh":"她搬到附近后，成了那家书店的常客。"}]}],"synonyms":["regulars","frequenters","patrons","customers","regular customers"],"phonetic":"/həˌbɪtʃuˈeɪz/","extraExplanation":["“habitués”是法语借词“habitué”的复数形式，英语里常用来强调一种“经常光顾、很熟门熟路”的感觉，语气比“regulars（常客）”更带一点文雅或书面色彩。","在英文排版中有时会保留重音符号：habitué / habitués；但在日常英语里也常写作不带重音的“habitue / habitues”。","常见搭配：the habitués of + 地点（某地的常客们），a habitué of + 地点（某地的常客）。"]}
{"word":"habiture","summary":{"en":"Habiture is a rare word meaning either “clothing/attire” or, less commonly, a “habitual state.”","zh":"Habiture 是一个很少见的词，常指“衣着/服装”，较少也可指“习惯性的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, formal) clothing; attire; the way someone is dressed.","zh":"（罕见、正式）衣着；服装；穿着方式。"},"examples":[{"en":"In older writing, “habiture” can mean a person’s dress or outward appearance.","zh":"在较早的文字中，“habiture”可以指一个人的衣着或外在形象。"},{"en":"The actor’s habiture helped him look like a 19th-century gentleman.","zh":"那位演员的服饰让他看起来像一位19世纪的绅士。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a habitual state or condition; being accustomed to something.","zh":"（罕见）习惯性的状态；对某事已经习以为常。"},"examples":[{"en":"Over time, her habiture of early mornings became natural.","zh":"久而久之，她早起的习惯变得很自然。"},{"en":"He tried to change his habiture of checking his phone every few minutes.","zh":"他试着改变自己每隔几分钟就看手机的习惯状态。"}]}],"synonyms":["attire","outfit","dress","clothing","habit","habituation"],"phonetic":"/ˈhæbɪtʃɚ/","extraExplanation":["“habiture”在现代英语里非常少见，多数学习者和母语者更常用 habit（习惯/习性；也可指“穿着”但更少见）、attire/outfit（衣着），或 habituation（习惯化、适应）。","它也常被误写/误读为法语借词 habitué（常客、老主顾），例如：a café habitué（咖啡馆常客）。如果你想表达“常客”，更可能要用 habitué。"]}
{"word":"habitus","summary":{"en":"Habitus means a person’s characteristic posture/appearance, or (in sociology) the internalized dispositions that shape how they think and act.","zh":"habitus 指人的典型体态/举止，也可指社会学中的“惯习”：内化的倾向与思维方式，影响认知与行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s usual way of carrying their body or behaving, especially as shown by posture or appearance.","zh":"（人的）习惯性姿态或举止；尤指从体态、外表表现出来的惯常风貌。"},"examples":[{"en":"The doctor noted his habitus: a relaxed posture and steady breathing.","zh":"医生记录了他的体态特征：姿势放松、呼吸平稳。"},{"en":"Her confident habitus made her seem older than she was.","zh":"她自信的举止风貌让她看起来比实际年龄更成熟。"}]},{"partOfSpeech":"n.","definition":{"en":"In sociology (especially Pierre Bourdieu), the deep, learned habits and ways of thinking that shape how people perceive the world and act within it.","zh":"（社会学，尤指布迪厄）“惯习”：人们在成长与社会化中内化的深层习惯与思维方式，影响其看法与行动。"},"examples":[{"en":"School and family life help form a person’s habitus.","zh":"学校与家庭生活会共同塑造一个人的“惯习”。"},{"en":"His habitus led him to feel out of place in elite settings.","zh":"他的“惯习”使他在精英场合感到格格不入。"}]}],"synonyms":["demeanor","bearing","disposition","posture","way of being"],"phonetic":"/ˈhæbɪtəs/","extraExplanation":["“habitus”来自拉丁语，原意是“状态、姿态、外表”。在日常英语里它相对正式，常见于医学（描述体型/体态特征）或学术写作。","在布迪厄理论中，habitus 不是简单的“习惯（habit）”，而是一套被社会环境长期塑造、并在不知不觉中指导选择与判断的倾向（如品味、说话方式、对机会的直觉）。","常与这些词搭配：cultural habitus（文化惯习）、class habitus（阶层惯习）、embodied habitus（身体化惯习）、socialization（社会化）。"]}
{"word":"hable","summary":{"en":"“Hable” is Spanish for “speak,” used as a formal command or in the present subjunctive.","zh":"“hable”是西班牙语“说话”的一种形式，可表示正式命令“请说”，或用于现在虚拟式表达要求/愿望。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Spanish) A form of the verb “hablar,” meaning “(that you/they) speak” (present subjunctive) or “Speak!” (formal command to one person).","zh":"（西班牙语）动词“hablar（说话）”的变位形式，可表示“（希望/要求）您/他/她说”（现在虚拟式），也可作对一人的正式命令“请说/说吧！”"},"examples":[{"en":"(Spanish) Por favor, hable más despacio.","zh":"（西）请说慢一点。"},{"en":"(Spanish) Es importante que hable con el doctor.","zh":"（西）重要的是您要和医生谈谈。"},{"en":"In some U.S. settings, you might see “Hable con…” on signs, meaning “Speak with… / Talk to…”.","zh":"在美国一些场合，你可能在标牌上看到“Hable con…”，意思是“请与……沟通/交谈”。"}]}],"synonyms":["(Spanish) habla","(Spanish) hable usted","(Spanish) hablemos"],"phonetic":"/ˈɑbleɪ/","extraExplanation":["“hable”来自动词“hablar”（说话）。它常见于两种语法：\n1）现在虚拟式：常跟在“Es importante que…（重要的是……）”“Quiero que…（我希望……）”等结构后，表示愿望、要求、不确定。\n2）正式命令（usted）：对不熟悉或需要礼貌的对象说“请说/说吧”。\n日常对朋友常用非正式命令是“habla”。"]}
{"word":"habnab","summary":{"en":"“Hobnob” means to socialize, especially with important or famous people.","zh":"“hobnob”指社交往来，常带“结交名流/拉人脉、应酬”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to spend time socially with someone (often in a friendly or slightly “networking” way), especially with people who are important or famous","zh":"（尤指带点“应酬/结交”的意味）与某人社交来往、打成一片；常指与有名或有地位的人交往"},"examples":[{"en":"At the conference, she hobnobbed with CEOs and investors.","zh":"在会议上，她和各家公司CEO及投资人应酬、结识。"},{"en":"He loves to hobnob with artists and writers at gallery openings.","zh":"他很喜欢在画廊开幕酒会上与艺术家和作家们社交来往。"}]},{"partOfSpeech":"n.","definition":{"en":"friendly socializing or mixing with others (less common than the verb form)","zh":"社交往来；与人打成一片（名词用法较少）"},"examples":[{"en":"The party was more about hobnob than about serious discussion.","zh":"这场聚会更多是社交应酬，而不是认真讨论。"}]}],"synonyms":["socialize","mingle","mix","network"],"phonetic":"/ˈhɑbˌnɑb/","extraExplanation":["“habnab”在标准英语里不常见，较可能是拼写或听写成了“hobnob”。","“hobnob”源自早期表达“to hob or nob”（大意是一起喝酒/碰杯、来往），后来引申为“（尤其与名人或权贵）社交结交”。","语气提示：hobnob常带一点“社交应酬、攀关系/拉人脉”的感觉，不只是普通的hang out。"]}
{"word":"haboob","summary":{"en":"A haboob is a sudden, powerful dust storm that can quickly reduce visibility to near zero.","zh":"haboob 指一种突发、强烈且移动迅速的沙尘暴，常使能见度在短时间内降到几乎为零。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, fast-moving dust storm, especially common in deserts (often seen in the Middle East, North Africa, and the southwestern U.S.)","zh":"（常见于沙漠地区的）哈布布沙尘暴；一种移动迅速、规模很大的沙尘暴（常见于中东、北非和美国西南部）"},"examples":[{"en":"A haboob rolled into the city, turning the sky brown in minutes.","zh":"一场哈布布沙尘暴席卷进城，几分钟内就把天空变成了棕色。"},{"en":"Drivers pulled over because the haboob made visibility almost zero.","zh":"司机们靠边停车，因为哈布布沙尘暴让能见度几乎为零。"},{"en":"Meteorologists warned that strong winds could trigger a haboob this afternoon.","zh":"气象学家警告说，强风今天下午可能引发哈布布沙尘暴。"}]}],"synonyms":["dust storm","sandstorm","wall of dust"],"phonetic":"/həˈbuːb/","extraExplanation":["“haboob”源自阿拉伯语（常解释为与“吹/刮”相关的词根），原本多用于描述苏丹等地在雷暴外流风（gust front）推动下形成的“墙状”尘土云。","在美国西南部（如亚利桑那州凤凰城）也常用这个词，新闻里会用“wall of dust（尘墙）”来形容其外观。遇到这种天气通常建议尽快进入室内、关闭门窗；开车时若能见度骤降，应安全靠边停车并打开双闪，避免在车道上突然刹停。"]}
{"word":"haboobs","summary":{"en":"“Haboobs” means large, dense dust storms—often a moving wall of dust—common in dry regions.","zh":"“haboobs”指大型、浓密的沙尘暴/尘暴，常呈“尘土墙”推进，常见于干旱地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, thick wall of dust or sand blown by strong winds, often in dry regions and sometimes linked to thunderstorms","zh":"（干旱地区常见的）哈布风暴；由强风卷起、像“墙”一样推进的巨大沙尘/尘土云，有时与雷暴有关"},"examples":[{"en":"Several haboobs rolled across the desert, turning the sky brown within minutes.","zh":"几场哈布风暴席卷沙漠，几分钟内就把天空染成了褐色。"},{"en":"Drivers pulled over because the haboob reduced visibility to almost zero.","zh":"司机们把车停到路边，因为哈布风暴几乎让能见度降为零。"},{"en":"The weather report warned of possible haboobs this evening after the thunderstorms.","zh":"天气预报警告说今晚雷暴过后可能出现哈布风暴。"}]}],"synonyms":["dust storm","sandstorm","dust cloud"],"phonetic":"/həˈbuːb/","extraExplanation":["“haboob”来自阿拉伯语（常译作“刮起/猛烈吹”的意思），英语里多用于气象报道，尤其在美国西南部（如亚利桑那）常见。","和一般的“sandstorm/dust storm”相比，haboob 常强调那种前缘很整齐、像一堵移动的尘土墙的视觉效果；遇到时通常建议尽快离开道路、开双闪并关闭外循环以减少吸入尘土。"]}
{"word":"haboub","summary":{"en":"A haboob is a powerful dust storm that looks like a moving wall of dust.","zh":"haboob 指一种强烈的沙尘暴，常呈“移动的尘墙”状推进。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large wall of dust and sand blown by strong winds, usually in deserts or dry regions (a type of dust storm)","zh":"（常见于沙漠或干旱地区的）哈布布风暴；由强风卷起、像“墙”一样推进的巨大沙尘/尘土风暴"},"examples":[{"en":"A haboob rolled into the city and turned the sky brown in minutes.","zh":"一场哈布布风暴卷进城市，几分钟内就把天空变成了棕色。"},{"en":"During the haboob, visibility dropped so quickly that drivers had to pull over.","zh":"哈布布风暴来时能见度下降得很快，司机不得不靠边停车。"}]}],"synonyms":["dust storm","sandstorm","wall of dust"],"phonetic":"/həˈbuːb/","extraExplanation":["你写的“haboub”常见拼写是“haboob”。这个词来自阿拉伯语，常用来指美国亚利桑那等地夏季雷暴外流（outflow）推动的“尘墙”式沙尘暴。","在新闻、气象预警中常见搭配：a haboob moves in / a haboob rolls through / a wall of dust."]}
{"word":"habronema","summary":{"en":"Habronema is a genus of parasitic nematodes, mainly in horses.","zh":"Habronema 指主要寄生于马等动物的一属寄生性线虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic roundworms (nematodes) that infect mainly horses and other equids; some species can cause skin or stomach disease (habronemiasis)","zh":"哈布罗线虫属：一类寄生性线虫（圆虫），主要感染马等马科动物；某些种可引起皮肤或胃部疾病（哈布罗线虫病）"},"examples":[{"en":"The veterinarian suspected Habronema after seeing non-healing sores in the horse during summer.","zh":"兽医在夏季看到马身上久不愈合的溃疡后，怀疑是哈布罗线虫感染。"},{"en":"Habronema larvae can be spread by flies that land on wounds.","zh":"苍蝇落在伤口上时，可能传播哈布罗线虫的幼虫。"}]}],"synonyms":["horse stomach worm (general, not exact)"],"phonetic":"/ˌhæbɹəˈniːmə/","extraExplanation":["“Habronema”多见于兽医学与寄生虫学语境。它与“habronemiasis（哈布罗线虫病）”相关：幼虫常由苍蝇传播，落在伤口或湿润部位后可引发炎症，造成所谓“summer sores（夏季疮）”。"]}
{"word":"habronemiasis","summary":{"en":"Habronemiasis is a Habronema worm infection, mainly in horses, affecting the stomach or causing skin sores.","zh":"Habronemiasis 指由 Habronema 线虫引起的寄生虫感染，主要见于马，可累及胃部或造成皮肤溃疡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a parasitic infection (mostly in horses) caused by Habronema worms, often affecting the stomach and sometimes causing skin sores when larvae enter wounds.","zh":"（多见于马的）哈布罗内马寄生虫感染，由Habronema线虫引起；常侵犯胃部，也可因幼虫进入伤口而导致皮肤溃疡/肉芽肿。"},"examples":[{"en":"The vet suspected habronemiasis because the horse had chronic, itchy skin sores in summer.","zh":"兽医怀疑是habronemiasis，因为这匹马在夏天出现了长期、瘙痒的皮肤溃疡。"},{"en":"Gastric habronemiasis can cause stomach irritation and poor appetite in horses.","zh":"胃部的habronemiasis可能引起马胃部刺激和食欲下降。"}]}],"synonyms":["summer sores","cutaneous habronemiasis","gastric habronemiasis"],"phonetic":"/həˌbrɑːnoʊˌmaɪˈeɪsiəsɪs/","extraExplanation":["这是一个偏兽医学/寄生虫学的词，日常英语很少用。马的“皮肤型”常被俗称为 summer sores（夏季疮），通常与苍蝇叮咬、幼虫污染伤口有关。预防上常强调控蝇、及时处理伤口与驱虫。"]}
{"word":"habronemic","summary":{"en":"A rare technical adjective meaning “related to Habronema worms or the disease they cause.”","zh":"一个少见的专业形容词，意思是“与 Habronema（哈布罗内马属）线虫或其引起的疾病有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the parasitic nematode (roundworm) genus Habronema, or to infection caused by these worms.","zh":"与寄生线虫（蛔虫类）属 Habronema（哈布罗内马属）有关的；或指由其引起的感染（哈布罗内马病）。"},"examples":[{"en":"The veterinarian suspected a habronemic infection in the horse’s stomach.","zh":"兽医怀疑这匹马的胃里有哈布罗内马属线虫感染。"},{"en":"Habronemic larvae can cause skin lesions when deposited in wounds.","zh":"哈布罗内马属线虫的幼虫若落在伤口处，可能导致皮肤病灶。"}]}],"synonyms":["habronemal","Habronema-related","parasitic (context-dependent)"],"phonetic":"/ˌhæbrəˈniːmɪk/","extraExplanation":["“habronemic”多见于兽医学/寄生虫学语境，属于非常少用的专业形容词。更常见的写法是“Habronema (infection)”或“habronemiasis（哈布罗内马病）”。","在马匹中，Habronema 常与“胃虫”相关；幼虫可能通过苍蝇传播，并在皮肤伤口处引发所谓的“summer sores（夏季疮）”。"]}
{"word":"habrowne","summary":{"en":"“habrowne” isn’t a recognized English word; it’s likely a typo, a username, or a proper name (possibly related to “Browne/Brown”).","zh":"“habrowne”不是常见英语词汇；更可能是拼写错误、用户名，或专有名词（可能与“Browne/Brown”有关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/handle, or a proper name (e.g., a surname like “Browne”).","zh":"不是标准英语单词。可能是拼写错误、用户名/网名，或专有名词（例如姓氏“Browne”）。"},"examples":[{"en":"I couldn’t find “habrowne” in a dictionary—did you mean “Brown” or “Browne”?","zh":"我在词典里找不到“habrowne”——你是不是想写“Brown”或“Browne”？"},{"en":"If “habrowne” is a username, it may not have a dictionary meaning.","zh":"如果“habrowne”是用户名，它可能没有词典里的固定含义。"}]}],"extraExplanation":["“Browne”常见作姓氏，是“Brown”的一种拼写变体。很多变体拼写来自家族传统或地区习惯。","如果你想查的是某个文学/历史人物（如 Thomas Browne）或某个短语，请把上下文句子发来，我可以按语境解释。"]}
{"word":"habsburg","summary":{"en":"Habsburg: a major European royal dynasty, centered in Austria, influential for centuries.","zh":"Habsburg：以奥地利为核心、影响欧洲数百年的重要皇室王朝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a powerful European royal family (dynasty) that ruled Austria and many other territories for centuries, especially from the Middle Ages to the early 1900s","zh":"哈布斯堡王朝（欧洲强大的皇室家族/王朝），数百年间统治奥地利及许多其他领地，尤其中世纪至20世纪初"},"examples":[{"en":"The Habsburgs ruled the Austrian Empire for centuries.","zh":"哈布斯堡王朝统治奥地利帝国长达数百年。"},{"en":"Many European wars involved Habsburg lands and alliances.","zh":"许多欧洲战争都牵涉到哈布斯堡的领地与联盟。"},{"en":"In history class, we studied the Habsburg dynasty and the rise of modern Europe.","zh":"在历史课上，我们学习了哈布斯堡王朝以及现代欧洲的形成。"}]}],"synonyms":["House of Habsburg","Habsburg dynasty","Austrian dynasty"],"phonetic":"/ˈhæpsbɝːɡ/","extraExplanation":["“Habsburg”也常写作“House of Habsburg（哈布斯堡家族）”。英文里有时会用复数“Habsburgs”来指这一家族的成员整体。","名称来自瑞士的哈布斯堡城堡（Habsburg Castle）。这个王朝与“奥地利”“西班牙（西班牙哈布斯堡）”“神圣罗马帝国”等历史主题常一起出现。","常见搭配：the Habsburg Empire（哈布斯堡帝国，常泛指其统治下的广阔领地）；Habsburg monarchy（哈布斯堡君主国）。"]}
{"word":"habu","summary":{"en":"A habu is a venomous pit viper from Okinawa and nearby Ryukyu Islands in Japan.","zh":"habu 指日本冲绳及琉球群岛一带的有毒蝮蛇（波布蛇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a venomous pit viper native to Japan’s Ryukyu Islands (especially Okinawa), known for its danger and cultural symbolism there","zh":"波布蛇：日本琉球群岛（尤其冲绳）特有的有毒蝮蛇，以危险性和当地文化象征而闻名"},"examples":[{"en":"People in Okinawa learn how to stay safe around the habu.","zh":"在冲绳，人们会学习如何在波布蛇出没的地方保持安全。"},{"en":"The habu is one of the best-known snakes in Okinawan folklore.","zh":"波布蛇是冲绳民间传说中最有名的蛇之一。"},{"en":"Some shops sell “habu-shu,” a liquor made with habu as a novelty item.","zh":"有些商店会卖“波布酒”（habu-shu），把波布蛇用于泡制的酒，当作一种新奇商品。"}]}],"synonyms":["Okinawan habu","pit viper"],"phonetic":"/ˈhɑːbuː/","extraExplanation":["“habu”来自日语（ハブ），在英语里多用于指冲绳的特定毒蛇（Okinawa habu）。在旅游语境中也常出现在“habu-shu（波布酒）”“habu warning sign（波布蛇警示牌）”等搭配里。"]}
{"word":"habub","summary":{"en":"“Haboob” (often misspelled “habub”) means a large dust storm, especially in desert areas.","zh":"“haboob”（常被误写为“habub”）指沙漠地区常见、由强风卷起的大型沙尘暴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large dust storm (often a wall of sand and dust) caused by strong winds, especially in desert regions.","zh":"（常见于沙漠地区的）哈布风沙；由强风引起、像“沙墙”一样推进的大型沙尘暴。"},"examples":[{"en":"A haboob rolled in from the desert and turned the sky brown within minutes.","zh":"一场哈布风沙从沙漠席卷而来，几分钟内天空就变成了棕色。"},{"en":"Drivers pulled over because the haboob made visibility near zero.","zh":"司机们因为哈布风沙导致能见度几乎为零而靠边停车。"}]}],"synonyms":["dust storm","sandstorm"],"phonetic":"/həˈbuːb/","extraExplanation":["你输入的“habub”更常见的标准拼写是 **haboob**。这个词来自阿拉伯语（与“吹/刮风暴”的意思相关），在美国英语里常用来描述亚利桑那等地夏季雷暴外流风触发的巨大沙尘墙。","常见搭配：a haboob **hits/rolls in/sweeps across**（袭来/卷来/横扫）；**wall of dust**（尘土墙）；**dust storm**（沙尘暴）。","文化语境：在美国西南部新闻播报里很常见，属于带地域色彩的词；在其他英语地区更常用 dust storm 或 sandstorm。"]}
{"word":"habuka","summary":{"en":"“Habuka” isn’t standard English; it usually points to Japanese habuku, meaning “to omit/leave out.”","zh":"“habuka”不是标准英语；多半是指日语 habuku，意为“省略/略去”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard English word; most often seen as a romanization of the Japanese word 省く (habuku), meaning “to omit; to leave out; to exclude.”","zh":"非标准英语词；最常见的是日语“省く（habuku）”的罗马字写法，意思是“省略；略去；排除在外”。"},"examples":[{"en":"In Japanese notes, habuka/habuku can mean “omit this step.”","zh":"在日语笔记里，habuka/habuku 可以表示“把这一步省略掉”。"},{"en":"The editor decided to habuka (leave out) a few unnecessary details.","zh":"编辑决定把一些不必要的细节省略掉。"}]}],"synonyms":["omit","leave out","exclude","skip"],"phonetic":"/hɑˈbuːkə/","extraExplanation":["“habuka”本身不是常见的英语词条，更像是日语词“省く（habuku）”的罗马字转写；你也可能是想查“habook/habuka”的拼写或某个专有名词。若你能提供出现它的句子或语境（比如动漫台词、笔记、歌曲、地名/人名），我可以更准确判断含义。"]}
{"word":"habus","summary":{"en":"“Habus” usually means more than one “habu,” a venomous pit viper from Japan (especially Okinawa).","zh":"“Habus”通常指不止一条“habu（哈布蛇）”，即产于日本（尤其冲绳）的有毒蝮蛇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “habu”: a venomous pit viper native to parts of Japan (especially Okinawa) and nearby islands.","zh":"“habu”的复数：一种产于日本（尤其冲绳）及周边岛屿的有毒蝮蛇（响尾蛇科中的蝮亚科——蝮蛇类）。"},"examples":[{"en":"The guide warned us to watch for habus on the forest trail at night.","zh":"导游提醒我们晚上走森林小路时要小心哈布蛇。"},{"en":"Local signs explain what to do if you see habus near your home.","zh":"当地告示牌会说明如果在家附近看到哈布蛇该怎么办。"}]}],"synonyms":["pit viper","viper"],"phonetic":"/ˈhɑːbuː/","extraExplanation":["“habu”是日语外来词（常见写法为 habu / ハブ），英语里多用于旅游、自然生态或冲绳当地语境。你也可能在“habu sake”（把蛇放入酒中的冲绳烈酒/药酒）等表达里见到它。","如果你本来想拼的是 **habeas**（如 *habeas corpus*）或其他词，请告诉我你看到它的句子，我可以帮你确认正确拼写和意思。"]}
{"word":"habutae","summary":{"en":"Habutae is a smooth, lightweight Japanese silk (or similar fabric).","zh":"Habutae 指光滑轻薄的日本丝织物（或类似面料）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lightweight, smooth Japanese silk (or fabric made to imitate it), often used for linings, scarves, and blouses","zh":"羽二重（日本的一种轻薄、光滑的丝织物；也可指仿羽二重的面料），常用于里衬、围巾和衬衫等"},"examples":[{"en":"She chose habutae silk for the dress lining because it felt soft and smooth.","zh":"她选择用羽二重真丝做裙子的里衬，因为它触感柔软光滑。"},{"en":"The scarf is made of habutae, so it drapes lightly and shines a little.","zh":"这条围巾是羽二重材质，所以垂坠感轻盈，还带一点光泽。"}]}],"synonyms":["Japanese silk","silk habutai","habutai"],"phonetic":"/ˌhɑːbuːˈteɪ/","extraExplanation":["“Habutae（羽二重）”源自日语，传统上指一种平纹、质地细密、手感柔滑的丝织物。英文里多用于服装与纺织领域，有时也会把仿制的同类面料称为 habutae。","在服装描述中，habutae 常强调“轻、滑、垂坠好”的特性；与较硬挺的绸缎（如 duchess satin）或更薄更透明的纱（如 chiffon）在手感和用途上有所不同。"]}
{"word":"habutai","summary":{"en":"Habutai is a light, smooth plain-weave silk fabric used especially for linings and scarves.","zh":"Habutai（羽二重）是一种轻薄、光滑的平纹真丝面料，常用于里料、围巾等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lightweight, smooth, plain-weave silk fabric, often used for linings, scarves, blouses, and sometimes as a base for painting or dyeing.","zh":"羽二重（丝绸）：一种轻薄、光滑的平纹丝织物，常用于里料、围巾、衬衫等，也常作为绘画或染色的底布。"},"examples":[{"en":"She chose habutai for the dress lining because it feels soft and light.","zh":"她选用羽二重做裙子的里衬，因为手感柔软又轻薄。"},{"en":"The artist paints on habutai silk to create flowing, watercolor-like effects.","zh":"这位艺术家在羽二重丝绸上作画，能呈现出像水彩一样流动的效果。"},{"en":"This scarf is made from habutai, so it drapes beautifully.","zh":"这条围巾是羽二重材质的，所以垂坠感很好。"}]}],"synonyms":["habutai silk","plain-weave silk","silk habutai"],"phonetic":"/ˌhɑːbuːˈtaɪ/","extraExplanation":["“Habutai”来自日语「羽二重（はぶたい）」；字面意象与“羽毛的轻”和“重叠的层次”有关，用来形容这种布料轻柔、细密、贴肤的质感。","在英文里常见搭配是 “habutai silk”。在服装语境中，它经常与更有光泽的 satin（缎）或更硬挺的 organza（欧根纱）对比：habutai通常更朴素、平滑、轻薄，适合做里料或需要自然垂坠的单品。"]}
{"word":"habutaye","summary":{"en":"Habutaye is a smooth Japanese silk fabric often used as a lining or for lightweight clothing.","zh":"Habutaye（羽二重）是一种光滑的日本丝绸面料，常用于里衬或轻薄衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fine, smooth Japanese silk fabric, often used for linings, scarves, and lightweight garments","zh":"一种细密光滑的日本丝绸面料（羽二重），常用于衣物里衬、围巾和轻薄服装"},"examples":[{"en":"The dress is lined with habutaye silk for a softer feel.","zh":"这条裙子用羽二重丝绸做里衬，触感更柔滑。"},{"en":"She bought a habutaye scarf because it drapes beautifully.","zh":"她买了一条羽二重围巾，因为垂坠感很好。"}]}],"synonyms":["habutae silk","Japanese silk"],"phonetic":"/ˌhɑːbuːˈtaɪ/","extraExplanation":["“habutaye”源自日语“羽二重（はぶたえ）”，传统上指一种织得很紧密、表面非常平滑的丝织物。英语里也常见拼写“habutae”。","在服装语境中，它常让人联想到“轻薄、顺滑、适合做里料/衬里（lining）”的丝绸材质。"]}

