{"word":"had","summary":{"en":"“Had” is the past form of “have,” used for possession/experience and as an auxiliary in the past perfect (“had + past participle”).","zh":"“Had”是“have”的过去式/过去分词，可表示拥有或经历，也常作助动词构成过去完成时（had + 过去分词）。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"past tense and past participle of “have,” used to show possession, experience, or completion (often with another verb).","zh":"“have”的过去式和过去分词，用来表示“拥有、经历”或“已经完成”（常与另一个动词连用）。"},"examples":[{"en":"I had a cold last week.","zh":"我上周感冒了。"},{"en":"She had three cats when she was a kid.","zh":"她小时候养过三只猫。"},{"en":"They had already left when we arrived.","zh":"我们到的时候，他们已经离开了。"}]},{"partOfSpeech":"aux.","definition":{"en":"used to form the past perfect tense: “had + past participle,” meaning an earlier past action before another past moment.","zh":"用于构成过去完成时：“had + 过去分词”，表示在过去某个时间点之前就已发生的动作。"},"examples":[{"en":"By 8 p.m., we had finished dinner.","zh":"到晚上八点时，我们已经吃完晚饭了。"},{"en":"He had never seen snow before he moved to Boston.","zh":"在搬到波士顿之前，他从没见过雪。"}]},{"partOfSpeech":"v.","definition":{"en":"informal: used to say someone experienced something unpleasant or difficult.","zh":"（非正式）表示“遭遇了不愉快或困难的事”。"},"examples":[{"en":"We had a rough day at work.","zh":"我们工作上过了很辛苦的一天。"},{"en":"She had a hard time finding a job.","zh":"她找工作时吃了不少苦。"}]}],"synonyms":["owned (in some contexts)","experienced (in some contexts)"],"phonetic":"/hæd/","extraExplanation":["“had”既可以是实义动词的过去式（如：had a car = 曾经有一辆车），也可以是助动词（如：had finished = 已经完成）。学习时重点看它后面接的结构：如果后面是名词/名词短语，多半是“拥有/经历”；如果是“had + 过去分词”，就是过去完成时。","在口语里，“had”常出现在固定表达中：had to（不得不，过去时），had better（最好……，语气强），have had it（受够了/完蛋了，视语境）。"]}
{"word":"hadada","summary":{"en":"Hadada is a name for an African ibis famous for its loud “ha-da-da” call, and it can also mean the call itself.","zh":"hadada 指一种以“ha-da-da”大声叫唤闻名的非洲鹮，也可指这种鸟的叫声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large African ibis (Hadeda ibis) known for its loud “ha-da-da” call; also called the hadeda ibis","zh":"非洲的一种大型鹮（哈达达鹮），以响亮的“ha-da-da”叫声著称；也叫 hadeda ibis"},"examples":[{"en":"A hadada flew over the park, calling loudly at dawn.","zh":"一只哈达达鹮从公园上空飞过，黎明时分叫得很响。"},{"en":"In many parts of southern Africa, you can hear hadadas in suburban gardens.","zh":"在非洲南部的许多地方，你在郊区花园里也能听到哈达达鹮的叫声。"}]},{"partOfSpeech":"n.","definition":{"en":"the loud, harsh call made by this bird (often described as sounding like “ha-da-da”)","zh":"这种鸟发出的响亮、沙哑的叫声（常被形容为“ha-da-da”的声音）"},"examples":[{"en":"The hadada woke me up before my alarm.","zh":"哈达达鹮的叫声在闹钟响之前就把我吵醒了。"},{"en":"We heard the hadada from across the river.","zh":"我们隔着河都听到了那哈达达鹮的叫声。"}]}],"synonyms":["hadeda ibis","Hadeda ibis","ibis"],"phonetic":"/həˈdɑːdə/","extraExplanation":["“hadada / hadeda”这个词带有拟声色彩，来自对鸟叫声的模仿；在南部非洲英语里很常见。","在不同地区拼写可能见到 hadada 或 hadeda；两者通常都指同一种鸟。"]}
{"word":"hadal","summary":{"en":"Hadal describes the very deepest ocean zone, especially deep-sea trenches below ~6,000 meters.","zh":"Hadal 指海洋最深处的超深渊带，尤其是约6000米以下的深海海沟区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the deepest parts of the ocean (the hadal zone), typically deeper than about 6,000 meters, such as deep-sea trenches.","zh":"与海洋最深处（超深渊带/哈达尔带）有关的；通常指水深约6000米以下的海域，例如深海海沟。"},"examples":[{"en":"Scientists sent a robot to study hadal ecosystems in the Mariana Trench.","zh":"科学家派出机器人研究马里亚纳海沟的超深渊带生态系统。"},{"en":"Hadal sediments can contain unique microorganisms adapted to extreme pressure.","zh":"超深渊带的沉积物中可能含有适应极端压力的独特微生物。"}]}],"synonyms":["trench-depth","deep-ocean (contextual)"],"phonetic":"/ˈheɪdəl/","extraExplanation":["“hadal”常见于海洋学/海洋生物学写作，来源与希腊神话中的冥界“Hades”有关，用来暗示“深不可测、如同冥界”的海底深处。","“hadal zone（超深渊带）”一般指约6000米到11000米深的海域，多见于海沟（trench）区域，是海洋分层术语的一部分（如：bathyal、abyssal、hadal）。"]}
{"word":"hadarim","summary":{"en":"Hadarim is usually a Hebrew transliteration meaning “rooms,” or it can be a proper name (often a place name).","zh":"Hadarim 通常是希伯来语音译，意为“房间”（复数）；也可能是专有名词（常见为地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a transliterated Hebrew word meaning “rooms” (plural of ḥéder/cheder), sometimes seen in Jewish or Israeli contexts rather than standard English.","zh":"希伯来语的音译词，意思是“房间”（ḥéder/cheder 的复数），多见于犹太/以色列语境中，而非标准英语。"},"examples":[{"en":"The old house was divided into several hadarim for different families.","zh":"那座老房子被分成几个 hadarim，供不同家庭居住。"},{"en":"In some Hebrew texts, you may see hadarim used to refer to rooms or chambers.","zh":"在一些希伯来语文本中，你可能会看到 hadarim 用来指“房间”或“内室”。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name (e.g., a place name in Israel) written as “Hadarim.”","zh":"专有名词：可作为地名等使用（例如以色列的某些地点名写作 “Hadarim”）。"},"examples":[{"en":"They drove toward Hadarim on the coastal road.","zh":"他们沿着海岸公路开车前往 Hadarim。"}]}],"synonyms":["rooms (when used in the “rooms” sense)","chambers"],"phonetic":"/hɑˈdɑrɪm/","extraExplanation":["这个词通常来自希伯来语 חדרים（ḥadarim），是 חדר（ḥeder，“房间/内室”）的复数形式。英语里多在讨论以色列、犹太文化、宗教文本或地名时出现。","若你是在特定文章/地图/小说里看到 hadarim，它的确切含义可能取决于上下文：要么是“房间”（普通名词复数），要么是某个地点或机构的名称（专名）。"]}
{"word":"hadassah","summary":{"en":"Hadassah is a Hebrew female name meaning “myrtle,” also used as the Hebrew name of Esther; it can also refer to the Jewish women’s organization Hadassah.","zh":"Hadassah是一个希伯来语女性名字，意为“桃金娘/香桃木”，也是以斯帖的希伯来名；也可指犹太女性组织Hadassah。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name of Hebrew origin, meaning “myrtle” (a fragrant evergreen plant); in the Bible, it is the Hebrew name of Queen Esther.","zh":"一个源自希伯来语的女性名字，意思是“桃金娘/香桃木”（一种芳香的常绿植物）；在《圣经》中也是以斯帖王后的希伯来名。"},"examples":[{"en":"Her parents chose the name Hadassah because of its biblical connection.","zh":"她的父母选择“Hadassah”这个名字，是因为它与《圣经》有关。"},{"en":"In the story, Esther’s Hebrew name is Hadassah.","zh":"在故事里，以斯帖的希伯来名字是Hadassah。"}]},{"partOfSpeech":"n.","definition":{"en":"Hadassah: an American Jewish women’s volunteer organization (The Women’s Zionist Organization of America), known for supporting health and social programs, including Hadassah Medical Center in Jerusalem.","zh":"Hadassah：美国犹太女性志愿组织（美国妇女犹太复国主义组织），以支持医疗与社会项目而闻名，包括耶路撒冷的哈达萨医疗中心。"},"examples":[{"en":"She volunteers with Hadassah to support community health projects.","zh":"她在Hadassah做志愿者，支持社区健康项目。"},{"en":"Hadassah helped fund medical training and hospitals in Israel.","zh":"Hadassah曾帮助资助以色列的医学培训与医院建设。"}]}],"synonyms":["Esther (related name)","Myrtle (meaning/translation, as a name)"],"phonetic":"/həˈdæsə/","extraExplanation":["“Hadassah/הֲדַסָּה”(哈达萨)在希伯来语里与“桃金娘/香桃木”(myrtle)有关。该植物在犹太文化中象征芬芳、生命力与祝福（也常出现在住棚节相关传统中）。","《圣经·以斯帖记》中，以斯帖在犹太人群体中的名字是Hadassah；她在波斯宫廷中使用“Esther”这一名字。这个双名背景让Hadassah常带有“身份与文化传承”的含义。","组织“Hadassah”（1912年在美国成立）与医疗公益联系紧密，最著名的相关机构之一是耶路撒冷的Hadassah Medical Center（哈达萨医疗中心）。"]}
{"word":"hadaway","summary":{"en":"“Hadaway” is mainly used as a surname; it’s also sometimes a misspelling of the singer name “Haddaway.”","zh":"“Hadaway”主要用作姓氏；有时也会被当作歌手名 “Haddaway” 的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏（家族名）。"},"examples":[{"en":"Ms. Hadaway will lead the meeting today.","zh":"Hadaway 女士今天将主持会议。"},{"en":"I saw the name Hadaway on the class list.","zh":"我在班级名单上看到了 Hadaway 这个姓。"}]},{"partOfSpeech":"other","definition":{"en":"(Often confused with “Haddaway”) A stage name of a German-Trinidadian singer best known for the 1990s song “What Is Love.”","zh":"（常与 “Haddaway” 混淆）一位德裔特立尼达歌手的艺名，以 90 年代歌曲《What Is Love》最出名。"},"examples":[{"en":"Some people misspell Haddaway as Hadaway when searching for “What Is Love.”","zh":"有些人在搜索《What Is Love》时，会把 Haddaway 拼成 Hadaway。"}]}],"synonyms":["(surname)","(proper name)"],"phonetic":"/ˈhædəweɪ/","extraExplanation":["“Hadaway”在英语里主要作为姓氏使用，不是常见词汇，因此通常没有像普通单词那样的词义变化。","如果你本来想表达短语“had away”（把……拿走/带走），那是比较少见或较旧的表达方式；现代英语更常说“took away”或“carried away”。","如果你指的是歌手，正确拼写通常是“Haddaway”（双 d）。"]}
{"word":"hadbot","summary":{"en":"“Hadbot” isn’t a standard English word; it’s most likely a misspelling of “chatbot” (a conversational AI program).","zh":"“hadbot” 不是标准英语词；最可能是把 “chatbot（聊天机器人）” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; most commonly a typo for “chatbot,” meaning a computer program (often AI-powered) designed to have text or voice conversations with people.","zh":"非标准拼写；最常见是把 “chatbot（聊天机器人）” 拼错了，指一种（通常由 AI 驱动的）能与人进行文字或语音对话的计算机程序。"},"examples":[{"en":"I think you meant “chatbot,” not “hadbot.”","zh":"我觉得你想写的是 “chatbot”，不是 “hadbot”。"},{"en":"Many websites use a chatbot to answer simple customer questions.","zh":"很多网站会用聊天机器人来回答简单的客户问题。"}]}],"synonyms":["conversational agent","virtual assistant","bot"],"phonetic":"/ˈtʃætˌbɑt/","extraExplanation":["“hadbot” 不是常见英语单词。如果你是在游戏、公司产品名、用户名或某个特定领域看到的，请告诉我上下文（完整句子/出处），我可以按那个语境解释。","“chatbot” 由 chat（聊天）+ bot（机器人程序的简称，源自 robot）构成；口语里也常说 bot，指自动程序或“机器人账号”。"]}
{"word":"hadbote","summary":{"en":"Hadbote is a rare historical word meaning compensation paid for injury or harm in early Anglo‑Saxon/Germanic law.","zh":"Hadbote 是一个罕见的历史词，指早期盎格鲁-撒克逊/日耳曼法律中为伤害或损失支付的赔偿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, historical) Compensation or payment made to a person or family for injury, harm, or death; a kind of legal restitution in early Germanic/Anglo‑Saxon law.","zh":"（古语/历史用语）因伤害、损失或死亡而支付给受害者或其家属的赔偿金；早期日耳曼/盎格鲁-撒克逊法律中的一种法律补偿。"},"examples":[{"en":"In some early laws, a killer could avoid further retaliation by paying hadbote to the victim’s family.","zh":"在一些早期法律中，凶手可以通过向受害者家属支付 hadbote 来避免进一步的报复。"},{"en":"The text describes different amounts of hadbote depending on the seriousness of the injury.","zh":"该文本描述了根据伤势严重程度不同而设定的不同 hadbote 赔偿数额。"}]}],"synonyms":["compensation","restitution","damages","wergild"],"phonetic":"/ˈhæd.boʊt/","extraExplanation":["这个词非常罕见，主要出现在中世纪法律史、古英语研究或历史文献里。拼写也可能见到 hadbot / hadbote 等变体。","可与更常被提到的 wergild（命价金）类比理解：都是用“金钱赔偿”来替代私人复仇、平息冲突的制度安排。"]}
{"word":"hadden","summary":{"en":"“Hadden” is not standard English; it’s mainly a dialect form meaning “had,” or a misspelling of “hadn’t.”","zh":"“hadden”不是标准英语；多为方言里表示“had”，或是把“hadn’t”误拼成“hadden”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/dialect) past tense or past perfect form of “have,” meaning “had.”","zh":"（非标准/方言）动词“have”的过去式或过去完成时形式，相当于“had（有；已经）”。"},"examples":[{"en":"They hadden already left when we arrived.","zh":"我们到的时候，他们已经离开了。（方言/非标准用法）"},{"en":"If I hadden known, I would have helped.","zh":"要是我早知道，我就会帮忙了。（方言/非标准用法）"}]},{"partOfSpeech":"other","definition":{"en":"A common misspelling of “hadn’t” (= had not), especially in fast typing or informal writing.","zh":"常见的拼写错误，用来误写“hadn’t（= had not，没/不曾）”，多见于打字很快或非正式写作。"},"examples":[{"en":"Incorrect: I hadden seen it before.  Correct: I hadn’t seen it before.","zh":"错误：I hadden seen it before. 正确：I hadn’t seen it before.（我以前没看过。）"},{"en":"If you mean “had not,” write “hadn’t,” not “hadden.”","zh":"如果你的意思是“had not”，应写“hadn’t”，不要写“hadden”。"}]}],"synonyms":["had","hadn't (if the intended meaning is negative)"],"phonetic":"/ˈhædən/","extraExplanation":["“hadden”在现代标准英语里通常不被认为是正确形式；更常见的是“had”。在一些地区方言（如苏格兰英语或部分爱尔兰英语的书面模仿）中，作者可能用“hadden”来表现口语语感或人物口音。","如果你是在做英语写作或考试，建议一律用标准形式：过去式/过去完成都用“had”；否定用“hadn’t”。"]}
{"word":"hadder","summary":{"en":"“Hadder” is usually nonstandard: it can mean Scots “heather,” or it can be a spelling that represents the sound of “had her” or “harder” in some accents.","zh":"“hadder”通常不是标准拼写：它可能是苏格兰方言里“石南（heather）”，也可能是按读音拼写，用来表示口语里的“had her”连读或某些口音下的“harder”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) Heather; a small purple-flowering plant common on moorland.","zh":"（苏格兰方言）石南（常见于荒原、开紫色小花的植物）。"},"examples":[{"en":"The hills were covered in hadder in late summer.","zh":"夏末时，山坡上满是石南。"},{"en":"Bees feed on hadder and make dark, strong honey.","zh":"蜜蜂采石南花蜜，会酿出颜色较深、味道浓的蜂蜜。"}]},{"partOfSpeech":"other","definition":{"en":"(Nonstandard/informal spelling) Used to represent the sound of “had her” in fast speech.","zh":"（非标准/口语拼写）用来表示快速口语中“had her”的连读发音。"},"examples":[{"en":"In the transcript it says “hadder,” meaning “had her.”","zh":"在这份口述记录里写“hadder”，意思是“had her”。"},{"en":"He’d hadder call him back, but he forgot.","zh":"他本来已经给她打过电话让她回拨，但他忘了。（此处“hadder”≈“had her”）"}]},{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard/informal spelling) Sometimes used to reflect an accent where “harder” sounds like “hadder.”","zh":"（非标准/口语拼写）有时用来模仿某些口音里“harder”听起来像“hadder”的读音。"},"examples":[{"en":"He said “hadder,” but he meant “harder.”","zh":"他说“hadder”，其实指的是“harder”。"},{"en":"You’ve got to work hadder to pass the test.","zh":"你得更努力才能通过考试。（此处“hadder”≈“harder”）"}]}],"synonyms":["heather (Scots meaning)"],"phonetic":"/ˈhædɚ/","extraExplanation":["“hadder”不是现代标准英语里的常用拼写；如果你在文学作品、方言对话或口语转写（transcript）里看到它，通常是在“按声音拼写”。","苏格兰语/苏格兰方言里，“hadder”指“heather（石南）”，在描写苏格兰荒原、山地景色的文本中比较常见。"]}
{"word":"haddest","summary":{"en":"“Haddest” is an archaic form meaning “you had,” used with “thou.”","zh":"“haddest”是古语形式，表示“你曾有/你已经有（you had）”，常与“thou”连用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) second-person singular past tense of “have,” used with “thou”; it means “you had.”","zh":"（古语）“have”的第二人称单数过去式，和“thou”连用；意思是“你曾有/你已经有（你有过）”。"},"examples":[{"en":"Thou haddest a chance to speak, but thou stayed silent.","zh":"你本有机会说话，但你却保持沉默。"},{"en":"If thou haddest listened, this might not have happened.","zh":"要是你当时听了，这也许就不会发生。"},{"en":"Thou haddest gone before I arrived.","zh":"我到之前你就已经离开了。"}]}],"synonyms":["had","possessed","owned"],"phonetic":"/ˈhædɪst/","extraExplanation":["“haddest”主要出现在中古/早期近代英语（如《圣经》英译本、莎士比亚作品）中，常与“thou（你）”搭配；现代英语通常用“you had”。","它既可表示“拥有/经历过（had）”，也常作为助动词构成过去完成时（had + 过去分词），例如“thou haddest gone（你已经走了）”。"]}
{"word":"haddie","summary":{"en":"“Haddie” can mean a haddock in Scottish English, or it can be a nickname (often for Harriet).","zh":"“Haddie”在苏格兰英语中可指黑线鳕，也可作人名昵称（常为 Harriet 的简称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish English, informal) A haddock (a type of North Atlantic fish), often used especially when talking about food.","zh":"（苏格兰英语，非正式）黑线鳕（一种北大西洋的鱼），常用于谈论食物。"},"examples":[{"en":"In some Scottish fish shops, you might hear people order a haddie and chips.","zh":"在一些苏格兰的炸鱼店里，你可能会听到人点“haddie and chips”（黑线鳕配薯条）。"},{"en":"Smoked haddie is popular in traditional dishes.","zh":"熏制的“haddie”在传统菜肴中很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name or nickname, often used as a short form of Harriet (sometimes also a family nickname).","zh":"人名或昵称，常作为 Harriet 的简称（有时也作为家族昵称使用）。"},"examples":[{"en":"Haddie is a nickname for Harriet in her family.","zh":"在她家里，Haddie 是 Harriet 的昵称。"},{"en":"Haddie introduced herself and shook my hand.","zh":"Haddie 自我介绍并和我握手。"}]}],"synonyms":["haddock","Harriet (as the full name)"],"phonetic":"/ˈhædi/","extraExplanation":["“haddie”作为“黑线鳕”的意思主要见于苏格兰英语（Scots/Scottish English），在英国其他地区更常说“haddock”。如果你在菜单、影视对白或方言对话里看到它，多半与苏格兰语境有关。","作为人名时，“Haddie”更像口语昵称，正式文件里通常仍写作“Harriet”（或家庭原名）。"]}
{"word":"haddin","summary":{"en":"“Haddin” is mainly a Scots/dialect form meaning “holding/keeping,” and it can also appear as a nonstandard spelling of fast speech (e.g., for “hadn’t” or “having”).","zh":"“haddin”主要是苏格兰英语/方言形式，意思接近“holding/keeping（握住/保持）”；也可能是口语快速发音的非规范拼写（如代替“hadn’t”或“having”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots / dialect) holding; keeping; staying in control of something (the -in form of “hadd” = “hold”).","zh":"（苏格兰英语/方言）握住；保有；维持控制（相当于“holding”，来自方言动词“hadd”=“hold”）。"},"examples":[{"en":"He was haddin the rope tight so the boat wouldn’t drift.","zh":"他把绳子握得很紧，这样船就不会漂走。"},{"en":"She’s haddin on to hope, even on hard days.","zh":"即使在艰难的日子里，她也仍在坚持希望。"}]},{"partOfSpeech":"other","definition":{"en":"(Very informal spelling) Sometimes written to represent the sound of “hadn’t” or “having” in fast speech, but this is nonstandard and can confuse readers.","zh":"（非常口语的拼写）有时用来模仿快速口语里“hadn’t”或“having”的发音，但不规范，容易让读者误解。"},"examples":[{"en":"Informal text: “I haddin time to call.” (More standard: “I didn’t have time to call.”)","zh":"口语短信：“I haddin time to call.”（更规范：I didn’t have time to call. / I didn’t have time to call.）"},{"en":"If you mean “hadn’t,” write: “I hadn’t seen it before.”","zh":"如果你想表达“hadn’t”，应写：I hadn’t seen it before."}]}],"synonyms":["holding","keeping","hanging on (to)"],"phonetic":"/ˈhædɪn/","extraExplanation":["“haddin”在标准英语里不是常见词，更多见于苏格兰英语（Scots）或方言拼写；在文学/民谣里可能为了表现口音而出现。","如果你是在学日常英语写作，通常建议用标准形式：holding / having / hadn’t（取决于你想表达的意思）。你也可以告诉我原句，我帮你判断该用哪一个。"]}
{"word":"haddo","summary":{"en":"“haddo” is not a standard English word; it’s most often an informal spelling meant to sound like “had to” in fast speech, or it can be a proper name (e.g., a place name).","zh":"“haddo”不是标准英语单词；多见于用来模拟快速口语中“had to”的非正式拼写，也可能是专有名词（如地名）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(nonstandard, informal spelling) A written way to show the fast, spoken pronunciation of “had to,” meaning past necessity/obligation.","zh":"（非标准、口语拼写）用来表示快速口语中“had to”的读法，意思是“过去不得不 / 必须”。"},"examples":[{"en":"I haddo leave early because I was sick. (Standard: I had to leave early.)","zh":"我haddo早点走，因为我生病了。（标准：I had to leave early.）"},{"en":"She said she “haddo do it,” even though she didn’t want to.","zh":"她说她“haddo去做”，尽管她不想。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name (e.g., Haddo), used for places or family names (less common in everyday English).","zh":"专有名词（如Haddo），可作地名或姓氏（日常英语中较少见）。"},"examples":[{"en":"Haddo House is a historic estate in Scotland.","zh":"Haddo House 是苏格兰的一处历史庄园。"}]}],"synonyms":["had to","needed to","was required to"],"phonetic":"/ˈhædə/","extraExplanation":["“haddo”这种写法属于 eye dialect（“拟音式方言拼写”）：作者用不标准拼写来模仿口语语速很快时的连读/弱读。美式英语里 “had to” 常弱读成 /ˈhædə/（t 变成类似 d 的音）。","如果你是在聊天、歌词、小说对白里看到“haddo”，通常不建议在正式写作中使用；正式写作请用 “had to”。","如果你指的是某个特定的人名/地名（比如苏格兰的 Haddo House），告诉我上下文句子，我可以帮你确认含义。"]}
{"word":"haddock","summary":{"en":"Haddock is an edible sea fish similar to cod, commonly eaten fresh or smoked.","zh":"Haddock 指一种可食用的海鱼（黑线鳕），与鳕鱼相近，常鲜食或熏制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of edible sea fish (related to cod), often sold fresh, smoked, or fried","zh":"一种可食用的海鱼（与鳕鱼同科），常见于鲜鱼、熏制或油炸食品中"},"examples":[{"en":"I ordered haddock and chips for dinner.","zh":"我晚餐点了黑线鳕鱼和薯条。"},{"en":"Smoked haddock is common in some British dishes.","zh":"熏黑线鳕在一些英国菜里很常见。"},{"en":"This recipe uses haddock because it has a mild flavor.","zh":"这道食谱用黑线鳕，因为它味道比较清淡。"}]}],"synonyms":["cod (similar fish)","whitefish (general category)"],"phonetic":"/ˈhædək/","extraExplanation":["“Haddock”常译为“黑线鳕”。在英式饮食文化中，它经常出现在炸鱼薯条（fish and chips）里；“smoked haddock”（熏黑线鳕）也常用于汤或奶油类菜肴。","在流行文化里，英国漫画《丁丁历险记》中的角色 Captain Haddock（哈达克船长）名字就来自这种鱼。"]}
{"word":"haddocker","summary":{"en":"“Haddocker” is rare; it usually refers to someone connected with haddock fishing/selling, or it can be a surname.","zh":"“Haddocker”较少见；通常指与黑线鳕捕捞/售卖相关的人，也可能是姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard word, usually understood as “a person who catches, sells, or works with haddock (a type of Atlantic fish).”","zh":"一个很少见或不规范的词，通常可理解为“捕捞、售卖或处理黑线鳕（大西洋的一种鱼）的人”。"},"examples":[{"en":"In old harbor records, a “haddocker” might be listed among the fish sellers.","zh":"在一些旧港口记录里，“haddocker”可能会被列在鱼贩之中。"},{"en":"The market had cod sellers, herring sellers, and the occasional haddocker.","zh":"市场里有卖鳕鱼的、卖鲱鱼的，也偶尔有卖黑线鳕的。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) in some contexts.","zh":"在某些情况下用作姓氏。"},"examples":[{"en":"Ms. Haddocker signed the guest book at the event.","zh":"Haddocker 女士在活动现场签到簿上签了名。"}]}],"synonyms":["haddock fisherman","fishmonger","fish seller"],"phonetic":"/ˈhædɑkər/","extraExplanation":["“haddocker”在现代英语里并不常见，很多情况下可能是拼写错误或误写。你可能想查的是：\n1) haddock（黑线鳕，一种常见食用鱼）；\n2) docker（码头工人/装卸工，或“Docker”容器技术）。\n如果你告诉我你看到这个词的句子或语境，我可以帮你判断更准确的意思。"]}
{"word":"haddocks","summary":{"en":"Haddocks are plural for haddock: a North Atlantic cod-family fish, or its meat as food.","zh":"Haddocks 是 haddock 的复数：指北大西洋的鳕科鱼类“黑线鳕”，也可指其鱼肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a haddock (plural): a type of saltwater fish in the cod family, common in the North Atlantic, often eaten as food.","zh":"黑线鳕（复数）：一种鳕科海鱼，常见于北大西洋，常被食用。"},"examples":[{"en":"Haddocks are often sold as white fillets in supermarkets.","zh":"黑线鳕常以白色鱼片的形式在超市出售。"},{"en":"The fisherman brought in three haddocks this morning.","zh":"渔夫今天早上带回了三条黑线鳕。"}]},{"partOfSpeech":"n.","definition":{"en":"the meat of this fish used as food.","zh":"（食用）黑线鳕鱼肉。"},"examples":[{"en":"We ordered grilled haddock with lemon and herbs.","zh":"我们点了柠檬香草烤黑线鳕。"},{"en":"Smoked haddock is popular in some British dishes.","zh":"烟熏黑线鳕在一些英式菜肴中很受欢迎。"}]}],"synonyms":["haddock","cod (related family)","whitefish (general category)"],"phonetic":"/ˈhædək/","extraExplanation":["“haddocks”是“haddock”的复数形式；在菜单或市场语境里也常用来泛指这种鱼的多个个体。","黑线鳕属于鳕科（cod family），味道较清淡、肉质细；常见做法有烤、煎、裹粉炸，以及“smoked haddock（烟熏黑线鳕）”。"]}
{"word":"hade","summary":{"en":"“Hade” is a technical geology/mining term meaning the tilt (angle) away from vertical, or to slope that way.","zh":"“hade”是地质/采矿领域的术语，指偏离垂直方向的倾角（或倾向），也可作动词表示“倾斜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology/Mining) The angle or degree to which a rock layer, ore vein, or fault is tilted away from the vertical; the direction of that tilt.","zh":"（地质/采矿）岩层、矿脉或断层偏离垂直方向的倾斜角度；也可指倾斜的方向。"},"examples":[{"en":"The vein has a steep hade to the east.","zh":"这条矿脉向东有很陡的倾角。"},{"en":"Engineers measured the hade before planning the tunnel.","zh":"工程师在规划隧道前先测量了倾角。"}]},{"partOfSpeech":"v.","definition":{"en":"(Geology/Mining) To slope or lean away from the vertical.","zh":"（地质/采矿）向一侧倾斜，偏离垂直方向。"},"examples":[{"en":"The fault plane hades slightly to the south.","zh":"断层面略微向南倾斜。"}]}],"synonyms":["slope","tilt","inclination","lean"],"phonetic":"/heɪd/","extraExplanation":["“hade”是一个比较专业、少见的词，主要出现在地质学与采矿工程语境里。日常英语里更常用的表达是“slope/tilt/inclination”。","容易与“had”（have 的过去式）或“(the) Hades”（希腊神话中的冥界/冥王）混淆；如果你想查的是其中一个，也可以告诉我你的句子，我帮你确认。"]}
{"word":"hadean","summary":{"en":"Hadean means “of the earliest eon of Earth” (or the eon itself), describing a very hot, harsh early Earth.","zh":"Hadean 指“与地球最早的冥古宙有关的”（或指冥古宙本身），常用来描述早期地球炽热而恶劣的环境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Hadean Eon, the earliest period of Earth’s history (about 4.6 to 4.0 billion years ago), when Earth was extremely hot and hostile to life","zh":"与“冥古宙”（地球历史中最早的时期，约46亿到40亿年前）有关的；指当时地球极其炽热、环境恶劣、不利于生命的"},"examples":[{"en":"Scientists study Hadean rocks to understand how the early Earth formed.","zh":"科学家研究冥古宙的岩石，以了解早期地球是如何形成的。"},{"en":"The Hadean environment likely included intense volcanism and frequent impacts.","zh":"冥古宙的环境很可能包含强烈的火山活动和频繁的天体撞击。"}]},{"partOfSpeech":"n.","definition":{"en":"the Hadean Eon itself (used as a noun, especially in geology)","zh":"冥古宙（用作名词，尤用于地质学语境）"},"examples":[{"en":"Life, if it existed at all, would have faced extreme conditions during the Hadean.","zh":"即使冥古宙存在生命，它也将面对极端的环境条件。"},{"en":"The boundary between the Hadean and the Archean is still discussed in Earth science.","zh":"在地球科学中，冥古宙与太古宙的分界仍有讨论空间。"}]}],"synonyms":["primordial","early-Earth","prebiotic"],"phonetic":"/ˈheɪdiən/","extraExplanation":["“Hadean”来自希腊神话中的“冥界”Hades，暗示早期地球像“地狱般”炽热、黑暗、充满火山与撞击。","在地质学里，Hadean 属于地球“宙（eon）”级别的划分；之后依次是 Archean（太古宙）、Proterozoic（元古宙）、Phanerozoic（显生宙）。","文学/文化上偶尔会用“hadean”作比喻，表示“地狱般的、原始而恶劣的”，但在日常英语中更常见的是词形相近的“hades-like / hellish”。"]}
{"word":"haded","summary":{"en":"“Haded” is not standard English; it’s usually a misspelling of “hated” or “headed.”","zh":"“haded”不是标准英语拼写，通常是把“hated”或“headed”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or mistaken spelling in modern English; it is most commonly a typo for “hated” (past tense of hate) or “headed” (moving toward; past tense of head).","zh":"现代英语中不规范/错误的拼写；最常见是把“hated”（hate 的过去式）或“headed”（head 的过去式/表示“朝……方向去”）写错成“haded”。"},"examples":[{"en":"I think “haded” is a typo—did you mean “hated” in your sentence?","zh":"我觉得“haded”可能是打错字——你的句子里是不是想写“hated”？"},{"en":"If you meant direction, write “headed”: “We headed home after class.”","zh":"如果你想表达方向，用“headed”：“下课后我们朝家走去。”"}]}],"synonyms":["hated","headed"],"phonetic":"ˈheɪdɪd","extraExplanation":["“haded”不是常见的标准词形，所以在写作或考试中应避免使用。建议先根据上下文判断：\n- 表达“讨厌/憎恨（过去）”→ 用 hated\n- 表达“朝……去/以……为目标（过去）”→ 用 headed\n- 也可能是输入法/拼写检查导致的误拼。"]}
{"word":"hadendoa","summary":{"en":"“hadendoa” is not a recognized English word; it’s likely a misspelling or a name.","zh":"“hadendoa”不是常见英语单词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name, so the meaning depends on what you intended to write.","zh":"不是标准英语单词。可能是拼写错误或专有名词（人名/地名等），具体含义需要看你的原意。"},"examples":[{"en":"I can’t find “hadendoa” in an English dictionary—did you mean another word?","zh":"我在英语词典里查不到“hadendoa”——你是不是想写另一个词？"},{"en":"If you tell me the sentence, I can guess the correct word.","zh":"如果你把它放进句子里，我可以帮你判断你想表达的词。"}]}],"extraExplanation":["我可能的猜测（请你确认）：\n1) **hacienda**（西语借词）：指“庄园/大农场（尤指西班牙或拉美的）”。\n2) **handover**：指“移交/交接”。\n3) **Haden**：常见英文姓氏/人名。\n\n你可以把原句发我，或告诉我它来自哪里（作业/游戏/小说/人名地名），我就能更准确地解释。"]}
{"word":"hadendowa","summary":{"en":"Hadendowa refers to a Beja-speaking ethnic group in eastern Sudan, or anything related to them.","zh":"Hadendowa 指苏丹东部一个说贝贾语系语言的民族（哈登多瓦人），也可作形容词表示与其相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Hadendowa, a Beja-speaking ethnic group mainly in eastern Sudan (and nearby areas).","zh":"哈登多瓦人（Hadendowa），主要分布在苏丹东部（及周边地区）的一个贝贾语系民族。"},"examples":[{"en":"The Hadendowa have a long history in eastern Sudan.","zh":"哈登多瓦人在苏丹东部有悠久的历史。"},{"en":"Some Hadendowa communities traditionally practiced pastoralism.","zh":"一些哈登多瓦社群传统上从事游牧畜牧业。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Hadendowa people or their culture.","zh":"与哈登多瓦人或其文化有关的。"},"examples":[{"en":"The museum displayed Hadendowa jewelry and clothing.","zh":"博物馆展出了哈登多瓦人的首饰和服饰。"},{"en":"She is studying Hadendowa oral traditions.","zh":"她正在研究哈登多瓦人的口述传统。"}]}],"synonyms":["Beja (broader term)"],"phonetic":"/ˌhɑːdɛnˈdoʊwə/","extraExplanation":["“Hadendowa”也常见拼写为“Hadendoa”。它通常被视为贝贾人（Beja）的一个重要分支/部族名称。","在英语历史书写中，这个名称有时会出现在19世纪末苏丹与红海地区相关的殖民史叙述里；现代语境更常用于人类学、语言学与地区研究。"]}
{"word":"hadentomoid","summary":{"en":"“hadentomoid” is not a recognized English word; it’s likely a misspelling (possibly of “entomoid,” meaning insect-like).","zh":"“hadentomoid”不是公认的英语单词；很可能是拼写错误（可能想写“entomoid”，意为“昆虫状的/像昆虫的”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up term.","zh":"不是标准英语单词；很可能是拼写错误或自造词。"},"examples":[{"en":"“hadentomoid” doesn’t appear in major English dictionaries; could you check the spelling?","zh":"“hadentomoid”在主要英语词典中查不到；你能再确认一下拼写吗？"},{"en":"If you meant “entomoid,” it means “insect-like.”","zh":"如果你想写的是“entomoid”，它的意思是“像昆虫的 / 昆虫状的”。"}]}],"phonetic":"/ˌhæd.ɛnˈtoʊ.mɔɪd/","extraExplanation":["这个词在常见语料库和主流词典里基本找不到，因此更像是拼写误差。最接近的真实词是 **entomoid**（形容词，意为“昆虫状的/像昆虫的”），由 *entomo-*（昆虫）+ *-oid*（像……的）构成。","你可以告诉我：你是从哪里看到这个词的（书、论文、游戏、聊天记录等），以及上下文句子。我可以据此判断它到底想表达什么，并给出最可能的正确拼写。"]}
{"word":"hadentomoidea","summary":{"en":"Hadentomoidea is a Latin-style scientific name used for an insect taxonomic group, mainly seen in academic or database contexts.","zh":"Hadentomoidea 是一种拉丁化的科学分类名称，用于指代某个昆虫类群，多见于学术文献或数据库。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hadentomoidea: a scientific (Latin-style) taxonomic name used in biology, referring to a group in the classification of insects (most likely within moths/butterflies, depending on the source). It is typically used in academic contexts such as research papers, specimen labels, or databases.","zh":"Hadentomoidea：一种生物学中的拉丁化学名（分类学名称），用来指代昆虫分类中的一个类群（具体范围因资料来源而异，常见于蛾/蝶相关文献）。通常出现在论文、标本标签或数据库中。"},"examples":[{"en":"The database lists Hadentomoidea as a higher-level taxon for several related species.","zh":"该数据库把 Hadentomoidea 列为若干相关物种的高阶分类单元。"},{"en":"In older literature, the placement of Hadentomoidea may differ from modern classifications.","zh":"在较早的文献中，Hadentomoidea 的分类位置可能与现代分类不同。"}]}],"phonetic":"/ˌhædɛn.toʊˈmɔɪ.di.ə/","extraExplanation":["这类以 -oidea 结尾的名称通常表示“总科/超科（superfamily）”层级，是动物分类学里常见的后缀（例如 Noctuoidea）。不过不同数据库或年代的分类系统可能会调整范围、合并或拆分，因此你在不同来源看到的 Hadentomoidea 含义可能略有出入。","如果你是在某篇论文、物种名录或网站上看到 Hadentomoidea，建议同时查看它在该来源中的上一级（例如目/亚目）与下一级（例如科）来确定具体指的是哪一群昆虫。"]}
{"word":"hadephobia","summary":{"en":"Hadephobia means an intense fear of Hades/the Underworld (often understood as “hell” or a frightening afterlife).","zh":"hadephobia 指对哈迪斯/冥界（常被理解为“地狱”或可怕来世）的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of Hades (the Underworld) or of “hell”/the afterlife as imagined as an underworld","zh":"对“哈迪斯（冥界）”或“地狱/地下世界式的来世”的强烈恐惧"},"examples":[{"en":"After watching a movie about the Greek Underworld, she said she felt hadephobia for days.","zh":"看完一部讲希腊冥界的电影后，她说自己好几天都有种“冥界恐惧症”的感觉。"},{"en":"His hadephobia made it hard for him to read myths about Hades at night.","zh":"他的“冥界恐惧症”让他晚上很难读关于哈迪斯的神话。"},{"en":"In class, the teacher explained that hadephobia is a fear of the underworld, not a fear of darkness (nyctophobia).","zh":"课堂上老师解释说，hadephobia 是对冥界的恐惧，不是对黑暗的恐惧（nyctophobia）。"}]}],"synonyms":["fear of the underworld","fear of hell","afterlife anxiety","thanatophobia (broader: fear of death)"],"phonetic":"/ˌheɪdiˈfoʊbiə/","extraExplanation":["词源：Hades（哈迪斯，希腊神话中的冥界/冥王）+ -phobia（恐惧症）。在英语里它更常见于词汇表、兴趣科普或非正式语境；临床心理学中更常用更宽泛的说法，如“对死亡/来世的焦虑”或具体的恐惧类型描述。","文化提示：在希腊神话里，Hades 既指“冥界”也指“冥王哈迪斯”本人；因此 hadephobia 既可能指对“冥界这个地方/概念”的恐惧，也可能指对与冥王相关意象的恐惧。"]}
{"word":"Hades","summary":{"en":"Hades is the Greek god of the underworld, and it can also mean the underworld itself.","zh":"Hades指希腊神话中的冥王哈迪斯，也可指冥界（亡者之地）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the god who rules the underworld (the realm of the dead).","zh":"（希腊神话）冥王哈迪斯，统治冥界与亡者之国的神。"},"examples":[{"en":"In Greek myths, Hades is one of the three brothers who divided the world.","zh":"在希腊神话中，哈迪斯是三兄弟之一，他们共同瓜分了世界。"},{"en":"Many stories describe Hades as a strict ruler, not a devil.","zh":"许多故事把哈迪斯写成严厉的统治者，而不是“魔鬼”。"}]},{"partOfSpeech":"n.","definition":{"en":"The underworld itself (the place of the dead) in Greek mythology; sometimes written as “hades” in a general sense.","zh":"（希腊神话）冥界、阴间（亡者之地）；有时也可小写表示“冥界/阴间”的泛称。"},"examples":[{"en":"In the story, the hero travels down into Hades to rescue a friend.","zh":"在故事里，英雄下到冥界去救朋友。"},{"en":"Ancient writers often used “Hades” to mean the world of the dead.","zh":"古代作家常用“Hades”指亡者的世界。"}]}],"synonyms":["the Underworld","the world of the dead"],"phonetic":"/ˈheɪdiːz/","extraExplanation":["“Hades”在英语里既可指“冥王哈迪斯（这位神）”，也可指“冥界（这个地方）”。很多中文读者会把他和基督教语境中的“Hell（地狱）/撒旦”混为一谈，但在古希腊观念里，Hades更像是死后世界的管理者，冥界也不一定等同于“永恒受罚之地”。","常见相关词：Persephone（珀耳塞福涅，冥后）、Underworld（冥界/地下世界）、the River Styx（冥河斯堤克斯）、Cerberus（三头犬刻耳柏洛斯）。现代作品里“Hades”也常作为地狱式场景或冥界势力的文化意象。"]}
{"word":"hadhramautian","summary":{"en":"Hadhramautian means a person from Hadhramaut (eastern Yemen) or something related to that region and its people/culture.","zh":"Hadhramautian 指哈德拉毛（也门东部）地区的人，或与该地区及其人民/文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Hadhramaut (a region in eastern Yemen), or someone of Hadhrami descent","zh":"哈德拉毛地区（也门东部）的人；或具有哈德拉米（Hadhrami）血统的人"},"examples":[{"en":"Many Hadhramautians have family ties across the Indian Ocean region.","zh":"许多哈德拉毛人和印度洋周边地区有着家族联系。"},{"en":"He is a Hadhramautian who grew up in Yemen and later moved abroad.","zh":"他是哈德拉毛人，在也门长大，后来移居海外。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Hadhramaut, its people, culture, or dialect","zh":"与哈德拉毛地区、其人民、文化或方言有关的"},"examples":[{"en":"Hadhramautian culture is known for distinctive poetry and music traditions.","zh":"哈德拉毛文化以独特的诗歌与音乐传统而闻名。"},{"en":"They serve Hadhramautian dishes at the restaurant on weekends.","zh":"他们在周末供应哈德拉毛风味的菜肴。"}]}],"synonyms":["Hadhrami"],"phonetic":"/ˌhɑːdrəˈmɔːtiən/","extraExplanation":["“Hadhramautian”在英语中相对少见，更常见、也更地道的说法是“Hadhrami”（既可作名词也可作形容词）。","Hadhramaut（哈德拉毛）是也门东部的一个历史地理区域；历史上当地人有较多经商与迁徙传统，因此在东非、南亚与东南亚等地也能见到哈德拉米侨民社群。","拼写与用法提示：地区名常写作“Hadhramaut”，对应的形容词/族群名更常用“Hadhrami”；“Hadhramautian”属于可理解但不那么常用的派生形式。"]}
{"word":"hading","summary":{"en":"“hading” is not standard English; it’s usually a misspelling of “heading” or “hiding.”","zh":"“hading”不是标准英语词，通常是把“heading”或“hiding”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a misspelling of “heading” (a title at the top of a page) or “hiding” (the act of keeping out of sight).","zh":"不是标准英语单词。它最常见的是拼写错误，可能想写“heading”（标题/页眉）或“hiding”（躲藏/隐藏的行为）。"},"examples":[{"en":"I think you meant “heading”: Please put a heading on your essay.","zh":"我觉得你想写“heading”：请在你的作文上加一个标题。"},{"en":"Or you may have meant “hiding”: The cat is hiding under the bed.","zh":"或者你可能想写“hiding”：猫正躲在床底下。"}]}],"synonyms":["heading","hiding"],"phonetic":"/ˈhɛdɪŋ/","extraExplanation":["“hading”在常见词典里一般查不到；更像是打字/拼写错误。","如果你想表达“标题/栏目名/页眉”，通常用 heading（也可以指“方向/前往的地方”：We’re heading home）。","如果你想表达“躲起来/隐藏”，用 hide（动词）或 hiding（动名词/现在分词）。","你也可以告诉我你看到“hading”的句子或上下文，我可以帮你判断最可能的正确词。"]}
{"word":"hadit","summary":{"en":"“Had it” is the past of “have it,” and informally it can mean being exhausted, fed up, or that something is no longer working.","zh":"“had it”是“have it”的过去式；在口语中也可表示“累坏了/受够了”，或指某物“坏了、不行了”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(past tense of “have it”) to possess or experience something at a past time.","zh":"（have it 的过去式）过去某个时间“拥有/经历”某事。"},"examples":[{"en":"She had it all: a stable job and supportive friends.","zh":"她曾经什么都有：稳定的工作和支持她的朋友。"},{"en":"I had it in my bag a minute ago, but now I can’t find it.","zh":"我刚才还把它放在包里，但现在找不到了。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) “have had it / had it” used to say you are extremely tired or unable to continue.","zh":"（非正式）have had it / had it：累到不行、撑不下去了。"},"examples":[{"en":"After the long hike, I’d had it—I just wanted to sleep.","zh":"长途徒步之后我累坏了——只想睡觉。"},{"en":"We’ve had it for today. Let’s stop and continue tomorrow.","zh":"我们今天到此为止吧。休息一下，明天再继续。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) “have had it / had it” used to say you are fed up with someone or something and won’t tolerate it anymore.","zh":"（非正式）have had it / had it：受够了、忍无可忍。"},"examples":[{"en":"I’ve had it with the constant noise next door.","zh":"我受够了隔壁一直吵。"},{"en":"He’d had it with being blamed for everything.","zh":"他受够了什么都怪到他头上。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) “have had it” can mean something is broken, finished, or no longer useful.","zh":"（非正式）have had it：坏了/寿终正寝/不再好用。"},"examples":[{"en":"My old laptop has had it—it won’t even turn on.","zh":"我的旧笔记本电脑不行了——连开机都开不了。"},{"en":"This sofa has had it. We need a new one.","zh":"这张沙发不行了，我们得换新的。"}]}],"synonyms":["was exhausted","was fed up","was done","was broken"],"phonetic":"hæd ɪt","extraExplanation":["“had it”本身更常见于口语里，通常是“(have) had it”的省略或在上下文中省掉主语（例如在抱怨或喊累时：Had it!）。","如果你想表达“我受够了某人/某事”，最自然的结构是：I’ve had it with + 名词/动名词（with the mess / with waiting）。","注意不要和“had it coming”（自作自受）混淆；那是另一个固定搭配。"]}
{"word":"hadith","summary":{"en":"A hadith is a recorded report of the Prophet Muhammad’s sayings and actions, important in Islamic tradition.","zh":"Hadith 指记录先知穆罕默德言行的“圣训”，在伊斯兰传统中非常重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A report of what the Prophet Muhammad said, did, or approved; used as an important source for Islamic teaching and law.","zh":"（伊斯兰）圣训：关于先知穆罕默德的言行或默许的记述；是伊斯兰教义与法律的重要依据之一。"},"examples":[{"en":"She studied hadith to better understand Islamic ethics.","zh":"她学习圣训，以更好地理解伊斯兰伦理。"},{"en":"In class, we read a hadith about kindness to neighbors.","zh":"课堂上，我们读了一则关于善待邻里的圣训。"},{"en":"Some hadith collections are widely known, like Sahih al-Bukhari.","zh":"有些圣训汇编很有名，例如《布哈里圣训实录》。"}]}],"synonyms":["prophetic tradition","report","narration"],"phonetic":"/həˈdiːθ/","extraExplanation":["“Hadith”来自阿拉伯语，常被音译为“圣训”。复数形式常见为“hadiths”（英语化复数）或“ahadith”（阿拉伯语复数）。","在伊斯兰传统中，圣训通常包含两部分：传述链（isnad，说明是谁传给谁）和正文（matn，具体内容）。不同圣训因传述可靠性不同而有分级。","与《古兰经》不同：古兰经被视为启示经典；圣训是对先知言行的记录，用来帮助理解与实践信仰。"]}
{"word":"hadiths","summary":{"en":"Hadiths are reports of the Prophet Muhammad’s sayings and actions, an important source in Islam.","zh":"Hadiths 指“圣训”的复数：关于先知穆罕默德言行的传述，是伊斯兰的重要文献来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hadith: reports or collections of the sayings, actions, and approvals of the Prophet Muhammad, used (with the Qur’an) as an important source for Islamic belief, law, and daily practice.","zh":"hadith（圣训/圣谕）的复数：记录先知穆罕默德的言行与默许的传述或汇编，在伊斯兰信仰、法律与日常实践中（与《古兰经》一起）是重要依据。"},"examples":[{"en":"Many Islamic scholars study hadiths to understand religious law and ethics.","zh":"许多伊斯兰学者研究圣训，以理解宗教法律与伦理。"},{"en":"Different hadiths may be judged strong or weak depending on the reliability of the chain of transmitters.","zh":"不同圣训可能因传述链的可靠性而被评为可靠或薄弱。"},{"en":"The book compares a Qur’anic verse with related hadiths for context.","zh":"这本书把一段《古兰经》经文与相关圣训进行对照，以补充背景。"}]}],"synonyms":["traditions","prophetic traditions","reports"],"phonetic":"/hɑːˈdiːθs/","extraExplanation":["“Hadith / hadiths”在英语里常见两种复数：hadiths 和 ahadith（更偏学术、阿拉伯语化）。日常英文写作中用 hadiths 很常见。","在伊斯兰传统中，圣训常按可靠性分级（如 sahih 可靠、hasan 良好、da‘if 薄弱），也常提到 isnad（传述链）与 matn（正文内容）。","书写时“Hadith”有时会大写，用来指“圣训文献/圣训学”这一整体传统；小写 hadith(s) 多指具体的一则或多则圣训。"]}
{"word":"hadj","summary":{"en":"Hadj is an uncommon spelling of hajj, the Islamic pilgrimage to Mecca.","zh":"Hadj 是 hajj 的不常见拼写，指伊斯兰教前往麦加的朝觐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a less common spelling of “hajj,” the Muslim pilgrimage to Mecca that adults who are able are expected to do at least once in their lifetime","zh":"“hajj（朝觐）”的不太常见拼写：指穆斯林前往麦加的宗教朝圣之旅；有能力的成年人一生至少应完成一次"},"examples":[{"en":"Millions of Muslims travel to Saudi Arabia each year for the hadj (hajj).","zh":"每年有数以百万计的穆斯林前往沙特阿拉伯参加hadj（hajj，朝觐）。"},{"en":"After completing the hadj, he felt a deep sense of peace.","zh":"完成hadj（朝觐）后，他感到内心格外平静。"}]}],"synonyms":["hajj","pilgrimage (general sense)"],"phonetic":"/hɑdʒ/","extraExplanation":["“hadj”多见于较早的英语/法语转写传统；现代英语中更常用拼写是“hajj”。","“Hajj（朝觐）”是伊斯兰教五功之一，通常在伊斯兰历的特定月份进行；与之相关的节日是“Eid al-Adha（宰牲节）”。","学习时注意大小写：作为普通名词常写作“the hajj / the hadj”；指活动本身而非某个地点。"]}
{"word":"hadjee","summary":{"en":"Hadjee means a person who has completed the Hajj pilgrimage to Mecca (often an honorific).","zh":"Hadjee 指完成前往麦加朝觐的人（常作尊称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled hajji/hadji) a Muslim who has completed the Hajj (pilgrimage) to Mecca; often used as an honorific title before a person’s name in some communities.","zh":"（也拼作 hajji/hadji）已完成前往麦加的朝觐（Hajj）的穆斯林；在一些社群中常作为尊称加在姓名前。"},"examples":[{"en":"After he completed the Hajj, people in his community began calling him Hadjee Ali.","zh":"他完成朝觐后，社群里的人开始称他为“Hadjee Ali”。"},{"en":"In some countries, “hadjee” is used like a respectful title.","zh":"在一些国家，“hadjee”会像尊称一样使用。"}]}],"synonyms":["hajji","hadji"],"phonetic":"/ˈhædʒi/","extraExplanation":["“Hadjee”是“Hajji”的一种拼写变体，源自阿拉伯语中指“完成朝觐者”的词。","语体与使用场合很重要：在许多穆斯林社群中它是尊称，但在某些地区或历史语境中也可能被外群体当作标签甚至带有贬义；使用时应尊重当事人偏好。"]}
{"word":"hadjees","summary":{"en":"“Hadjees” means people who have completed the Hajj pilgrimage to Mecca (a variant spelling of “hajji,” plural).","zh":"“Hadjees”指已完成前往麦加朝觐（Hajj）的人（“hajji”的复数，属变体拼法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural, variant spelling of “hajji”/“hadji”) Muslims who have completed the Hajj (pilgrimage) to Mecca; often used as an honorific title before a person’s name in some cultures.","zh":"（复数，亦作 hajji / hadji）已完成前往麦加朝觐（Hajj）的穆斯林；在一些文化中也常作为对其的尊称/头衔，用在姓名前。"},"examples":[{"en":"In the village, the hadjees were treated with special respect because they had completed the Hajj.","zh":"在村里，这些 hadjees（完成朝觐的人）因完成了 Hajj 而受到特别尊重。"},{"en":"He was known as Hajji Abdullah after his pilgrimage; older books might spell it as “hadjee.”","zh":"他朝觐后被称为“Hajji Abdullah”；一些旧书里可能拼作“hadjee”。"}]}],"synonyms":["hajjis","hajis","hajji (plural)"],"phonetic":"/ˈhɑːdʒiːz/","extraExplanation":["“hadjee/hadji/hajji”属于较旧或不同地区的转写拼法，现代英语里更常见的是“hajji”或“haji”。","使用时要注意语境与尊重：它在一些地方是正式的敬称，但在少数英语文本（尤其殖民时期或带偏见的写作）中也可能被用作刻板印象标签。若不确定，使用“a person who has completed the Hajj”更中性清晰。"]}
{"word":"hadjemi","summary":{"en":"Hadjemi is typically a North African proper name (often a surname), not a common English word.","zh":"Hadjemi 通常是北非语境中的人名（多为姓氏），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname) of North African (often Algerian) origin; not a standard English vocabulary word.","zh":"专有名词（多为姓氏），常见于北非（尤其阿尔及利亚）语境；不是标准英语词汇。"},"examples":[{"en":"Professor Hadjemi published a paper on renewable energy.","zh":"Hadjemi 教授发表了一篇关于可再生能源的论文。"},{"en":"I met someone named Hadjemi at the conference.","zh":"我在会议上认识了一个叫 Hadjemi 的人。"}]}],"synonyms":["(no direct English synonyms; proper name)"],"phonetic":"/hædˈʒɛmi/","extraExplanation":["“Hadjemi”更像是人名/姓氏的拼写（拉丁字母转写），而不是英语里常用的单词；因此在英英词典里通常查不到标准释义。","如果你是在某篇文章、名单或社交媒体里看到它，最可靠的理解方式是：把它当作姓名来用（首字母大写），并结合上下文判断是姓还是名。","它可能与阿拉伯语文化圈中“Hadj/Haj”（指完成朝觐的人）这一称谓有关，但不同地区、不同转写方式会导致拼写差异；没有上下文很难确定其确切来源与含义。","如果你愿意，告诉我它出现的句子或你想表达的意思（是人名、地名，还是你想查的单词），我可以帮你更准确地解释或纠正拼写。"]}
{"word":"hadjes","summary":{"en":"“Hadjes” is likely a spelling/number variant of “haji/hadji,” meaning a Muslim who has completed the Hajj pilgrimage to Mecca.","zh":"“hadjes”很可能是“haji/hadji”的拼写或复数变体，指完成过去麦加朝觐（Hajj）的一位穆斯林。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim who has completed the Hajj (the pilgrimage to Mecca); also used as an honorific title for such a person (often capitalized as “Haji/Hadji”).","zh":"完成过朝觐（Hajj，去麦加的宗教朝圣）的一位穆斯林；也可作对这类人的尊称（常大写为“Haji/Hadji”）。"},"examples":[{"en":"After he returned from Mecca, people in his community called him Haji Ahmed.","zh":"他从麦加回来后，社区里的人称他为“Haji Ahmed（哈吉·艾哈迈德）”。"},{"en":"My neighbor is a haji, and he often shares stories about the pilgrimage.","zh":"我的邻居是一位哈吉，他常常分享朝觐的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the title “Haji/Hadji” used before or after a person’s name, especially in some Muslim-majority cultures.","zh":"（较少见）“Haji/Hadji”作为头衔加在姓名前后使用，尤其见于一些穆斯林占多数的文化中。"},"examples":[{"en":"In some places, “Haji” is added before a person’s name as a respectful title.","zh":"在一些地方，“Haji”会加在姓名前作为一种尊称。"}]}],"synonyms":["haji","hadji","pilgrim"],"phonetic":"/ˈhɑːdʒi/","extraExplanation":["“hadjes”更像是拼写变体或复数形式：英语里常见写法是 **haji / hajis** 或 **hadji / hadjis**（不同转写系统导致拼写不同）。如果你是在特定语言环境（如荷兰语/法语）里看到“hadjes”，它可能是当地对该词的拼写或复数形式。","使用时注意文化敏感性：这是一个宗教身份与荣誉称号，写作中通常应尊重地使用，并根据对方/地区习惯决定是否大写（Haji/Hadji）。"]}
{"word":"hadji","summary":{"en":"Hadji means a person who has completed the Hajj pilgrimage to Mecca, often used as an honorific; in some contexts it can be offensive slang, so use with care.","zh":"Hadji 指完成过前往麦加朝觐（哈吉）的人，常作尊称；但在某些语境中也可能是侮辱性俚语，用时需谨慎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Muslim who has completed the Hajj (the pilgrimage to Mecca); also used as an honorific title for such a person.","zh":"完成过哈吉（前往麦加的朝觐）的穆斯林；也可作为对这类人的尊称/头衔。"},"examples":[{"en":"My neighbor became a hadji after he returned from the Hajj in Mecca.","zh":"我的邻居从麦加完成朝觐回来后，就成了一位 hadji（朝觐者）。"},{"en":"In some communities, people may address him as Hadji Ahmad as a sign of respect.","zh":"在一些社群里，人们可能会称他为“Hadji Ahmad”以示尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"(Offensive, slang) A disrespectful term for an Arab or Muslim person.","zh":"（冒犯性俚语）对阿拉伯人或穆斯林的侮辱性称呼。"},"examples":[{"en":"That word can be offensive in English; it’s better to use “Muslim,” “Arab,” or the person’s nationality.","zh":"这个词在英语里可能带有侮辱性；更好的说法是用“Muslim（穆斯林）”“Arab（阿拉伯人）”或对方的国籍。"}]}],"synonyms":["haji","hajji","pilgrim"],"phonetic":"/ˈhɑːdʒi/","extraExplanation":["“hadji / haji / hajji”源自阿拉伯语“ḥājj”，意思是“完成朝觐的人”。英语里多种拼写都常见。","在正式或尊重的语境中，它通常是头衔（类似“完成朝觐者”）。但在某些战争/冲突相关的英语俚语中，它被用作贬义称呼，容易冒犯他人；学习和使用时应特别注意语境。"]}
{"word":"hadjis","summary":{"en":"“hadjis” means people who have completed the Hajj pilgrimage (plural of hajji/hadji).","zh":"“hadjis”指完成麦加朝觐（Hajj）的人（hajji/hadji 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hajji (also spelled hadji): Muslims who have completed the Hajj (the pilgrimage to Mecca), sometimes used as an honorific title.","zh":"hajji（也拼作 hadji）的复数：指完成了朝觐（Hajj，前往麦加的伊斯兰朝圣）的人；有时也用作一种尊称/头衔。"},"examples":[{"en":"Many hadjis in the village were respected for their experience and faith.","zh":"村里许多完成朝觐的 hadjis 因他们的经历与信仰而受到尊敬。"},{"en":"After returning from Mecca, he was known as a hajji; several other hadjis welcomed him home.","zh":"从麦加回来后，他被称为 hajji；其他几位完成朝觐的人也来欢迎他回家。"}]}],"synonyms":["hajjis","pilgrims (in the context of the Hajj)","al-hajj (title, context-dependent)"],"phonetic":"/ˈhædʒiz/","extraExplanation":["“hadji / hajji”源自阿拉伯语中与“朝觐（Hajj）”相关的词。不同地区和英语写法会出现 hadji、hajji、haji 等拼法。","在一些语境里它是对完成朝觐者的尊称（类似“朝觐归来者”的头衔）。但在少数英语文本或流行文化中也可能被误用为刻板印象或带贬义的称呼；使用时建议尊重当事人偏好的称谓与拼法。"]}
{"word":"hadjs","summary":{"en":"“Hadjs” is the plural of “hadj,” a less common spelling of “hajj,” the Muslim pilgrimage to Mecca.","zh":"“hadjs”是“hadj”的复数；“hadj”是“hajj（朝觐）”的较少见拼写，指穆斯林前往麦加的朝觐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a less common spelling of “hajj,” the Muslim pilgrimage to Mecca (usually one of the Five Pillars of Islam). “hadjs” is the plural form.","zh":"“hajj（朝觐）”的不太常见拼写，指穆斯林前往麦加的朝觐（通常被视为伊斯兰教五功之一）；“hadjs”为其复数。"},"examples":[{"en":"Millions of Muslims hope to complete the hajj (also spelled hadj) at least once in their lives.","zh":"数以百万计的穆斯林希望一生至少完成一次朝觐（hajj，也可拼作 hadj）。"},{"en":"The museum displayed photos taken during several hadjs in the early 1900s.","zh":"博物馆展出了多次朝觐（hadjs）期间拍摄的照片，时间在20世纪初。"}]}],"synonyms":["hajj","pilgrimage (general)"],"phonetic":"/hɑːdʒ/","extraExplanation":["在现代英文中更常见、也更标准的拼写是 hajj；hadj 属于较旧或较少见的转写方式（源自不同语言/体系对阿拉伯语词的拼写转写差异）。","这是一个宗教文化含义很强的词：写作或讨论时建议保持尊重，并尽量使用常见拼写 hajj 以便读者理解。"]}
{"word":"hadland","summary":{"en":"Hadland is most commonly a surname (family name) and is sometimes used as a less-common place name.","zh":"Hadland 最常见是姓氏，有时也会作为较少见的地名使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Ms. Hadland will join the meeting at 2 p.m.","zh":"Hadland 女士将于下午两点参加会议。"},{"en":"I saw the name Hadland on the class list.","zh":"我在班级名单上看到了 Hadland 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in some contexts (used as a proper noun), though it is less common than the surname.","zh":"在某些语境中作地名使用（专有名词），但不如作为姓氏常见。"},"examples":[{"en":"They traced the records back to Hadland on an old map.","zh":"他们在一张旧地图上把记录追溯到 Hadland。"}]}],"synonyms":["(none—proper name)"],"phonetic":"ˈhæd.lənd","extraExplanation":["“Hadland”通常需要首字母大写，因为多作专有名词（人名/姓氏或地名）。","如果你是在文章、公司名、网站或游戏里看到“Hadland”，它也可能是品牌名或虚构设定名；提供上下文我可以帮你判断更准确的含义。"]}
{"word":"hadnt","summary":{"en":"“hadnt” is an informal spelling of “hadn’t,” meaning “had not.”","zh":"“hadnt”是“hadn’t（had not）”的非正式拼写。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"A contraction of “had not.” It is used to form the negative in the past perfect (had + past participle) or with “had” in reported speech and conditional structures.","zh":"“had not”的缩写形式，用于构成否定：常见于过去完成时（had + 过去分词），也常见于转述语和条件句结构中。"},"examples":[{"en":"I hadn’t seen her before that day.","zh":"在那天之前我没见过她。"},{"en":"By the time we arrived, the movie hadn’t started yet.","zh":"我们到的时候，电影还没开始。"},{"en":"He said he hadn’t finished the report.","zh":"他说他还没完成报告。"}]}],"synonyms":["had not"],"phonetic":"/ˈhædənt/","extraExplanation":["标准拼写是“hadn’t”，中间需要撇号（apostrophe）表示省略了 not 中的 “o”。在短信或快速打字中有人会写成 “hadnt”，但正式写作通常要加撇号。","“hadn’t”最常见的用法是过去完成时：hadn’t + 过去分词（e.g., hadn’t eaten / hadn’t gone）。不要把它当作一般过去时的否定；一般过去时是否定用“didn’t”。"]}
{"word":"hadramautian","summary":{"en":"Hadramautian means “from or related to Hadramaut (eastern Yemen),” and it can also mean a person from there.","zh":"Hadramautian 指“来自或与也门东部哈德拉毛地区有关的”，也可指“哈德拉毛人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adjective) Relating to Hadramaut (also spelled Hadhramaut), a region in eastern Yemen, or to its people, culture, or dialect.","zh":"（形容词）与哈德拉毛地区（也拼作 Hadhramaut，位于也门东部）或其人民、文化、方言有关的。"},"examples":[{"en":"Hadramautian traders once traveled widely across the Indian Ocean.","zh":"哈德拉毛的商人曾经在印度洋地区广泛往来。"},{"en":"She is studying Hadramautian Arabic in order to read local poems.","zh":"她正在学习哈德拉毛方言的阿拉伯语，以便阅读当地诗歌。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) A person from Hadramaut, or someone of Hadramautian origin.","zh":"（名词）哈德拉毛人；来自哈德拉毛地区的人，或具有哈德拉毛血统的人。"},"examples":[{"en":"Many Hadramautians formed communities in Indonesia and East Africa.","zh":"许多哈德拉毛人在印度尼西亚和东非形成了侨居社群。"},{"en":"He identifies as a Hadramautian and keeps family records from Yemen.","zh":"他认同自己是哈德拉毛人，并保存着来自也门的家族记录。"}]}],"synonyms":["Hadhrami"],"phonetic":"/ˌhɑːdrəˈmɔːtiən/","extraExplanation":["“Hadramautian”源自地名 Hadramaut（哈德拉毛），历史上该地区以商贸、宗教与移民网络闻名，很多人迁居到南亚、东南亚与东非沿海。","拼写与用法上，你也可能看到更常见的形容词/名词 “Hadhrami”（指哈德拉毛人或哈德拉毛相关），在学术与新闻语境里更常用。"]}
{"word":"hadrom","summary":{"en":"A hadron is a quark-made subatomic particle such as a proton or neutron.","zh":"hadron（强子）是由夸克组成的亚原子粒子，例如质子或中子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of subatomic particle made of quarks and held together by the strong force; examples include protons and neutrons","zh":"强子；一种由夸克组成并由强相互作用力束缚在一起的亚原子粒子，例如质子和中子"},"examples":[{"en":"Protons and neutrons are hadrons found in the nucleus of an atom.","zh":"质子和中子是原子核中的强子。"},{"en":"In particle physics, scientists study how hadrons are produced in high-energy collisions.","zh":"在粒子物理学中，科学家研究强子如何在高能碰撞中产生。"}]}],"synonyms":["baryon","meson"],"phonetic":"/ˈhæd.rɑn/","extraExplanation":["你输入的“hadrom”很可能是拼写错误，正确拼写通常是 **hadron**。","强子（hadron）是一个物理学术语：凡是由夸克组成、受强力束缚的粒子都属于强子。常见的两大类是 **重子（baryons）**（如质子、 中子）和 **介子（mesons）**。","该词来自希腊语词根 *hadros*，有“厚、强、粗大”的意思，用来暗示这类粒子与轻子（leptons）相比“更重/更强”。"]}
{"word":"hadrome","summary":{"en":"Hadrome is a botany term for the xylem—the plant tissue that conducts water.","zh":"Hadrome 是植物学术语，指木质部（输水组织）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) The water-conducting part of the vascular tissue in plants, essentially the xylem (especially the tracheary elements).","zh":"（植物学）植物维管组织中负责输导水分的部分，基本相当于木质部（尤其指导管、管胞等输水细胞）。"},"examples":[{"en":"In older botany texts, the hadrome is contrasted with the leptome (phloem).","zh":"在较早的植物学教材中，hadrome 常与 leptome（韧皮部）相对。"},{"en":"Damage to the hadrome can reduce a plant’s ability to move water upward.","zh":"hadrome 受损会降低植物向上运输水分的能力。"}]}],"synonyms":["xylem"],"phonetic":"/ˈhædroʊm/","extraExplanation":["hadrome 主要出现在较传统或历史性的植物解剖学/形态学文献中；现代教材更常直接使用 xylem（木质部）。","词根上常见的 had- 有“厚、坚实”的含义倾向，用来强调这部分组织细胞壁较厚、偏“木质化”的特征；与之相对的 leptome（lepto- 有“薄、细”之意）指韧皮部。"]}
{"word":"hadromerina","summary":{"en":"Hadromerina is a historical scientific name for a taxonomic group of demosponges used in older classification systems.","zh":"Hadromerina 是旧分类体系中用于寻常海绵的一种历史性分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former taxonomic group (often treated as an order or suborder) of demosponges, described in older sponge classification systems.","zh":"（旧分类法中）一类海绵动物（多为寻常海绵纲 Demospongiae），常被当作“目/亚目”使用的分类群名称。"},"examples":[{"en":"In older zoology texts, Hadromerina was used to group several demosponges with similar skeletal features.","zh":"在一些较早的动物学教材中，Hadromerina 用来归入若干骨骼特征相近的寻常海绵。"},{"en":"Modern references may list Hadromerina only as a historical name, replaced by updated classifications.","zh":"在现代资料里，Hadromerina 常仅作为历史名称出现，已被更新的分类体系取代。"}]}],"synonyms":["Hadromerida (related taxon name)","hadromerid sponges"],"phonetic":"ˌhædroʊməˈriːnə","extraExplanation":["Hadromerina 属于“历史性分类名”，在不同年代与不同学者的体系里等级可能不一致（如目、亚目或更高/更低的单元）。读到该词时，最好同时查看文献使用的分类体系与出版年份。","这类拉丁化分类名多用于学术写作；日常英语里几乎不会出现。检索时可尝试相关拼写与近似分类名（如 Hadromerida / hadromerid sponges）。"]}
{"word":"hadromycosis","summary":{"en":"Hadromycosis is a rare, older medical term for a chronic fungal skin/tissue infection, often referring to chromoblastomycosis.","zh":"Hadromycosis 是一种少见的医学旧称，指慢性皮肤/皮下组织真菌感染，常与“着色芽生菌病”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare/older term) A chronic fungal infection of the skin and underlying tissue, typically producing slowly growing, warty or nodular lesions; often used historically for what is now called chromoblastomycosis.","zh":"（医学；少见/旧称）一种慢性的真菌感染，常累及皮肤及皮下组织，病灶缓慢增大，可呈疣状或结节样；历史上常用来指现在多称为“着色芽生菌病（chromoblastomycosis）”。"},"examples":[{"en":"The dermatologist considered hadromycosis because the lesion was chronic, warty, and slow to heal.","zh":"由于病灶长期存在、呈疣状且愈合缓慢，皮肤科医生考虑真菌性疾病（如 hadromycosis）的可能。"},{"en":"In older case reports, the term hadromycosis may appear where modern texts would say chromoblastomycosis.","zh":"在较早的病例报告中，可能会看到 hadromycosis 这个词，而现代教材通常写作 chromoblastomycosis（着色芽生菌病）。"}]}],"synonyms":["chromoblastomycosis","mycosis","fungal infection"],"phonetic":"/ˌhæd.roʊ.maɪˈkoʊ.sɪs/","extraExplanation":["词源拆解：hadro-（来自希腊语，意为“厚、粗/坚实”）+ mycosis（真菌病）。这种构词强调病灶常呈“较厚、增生/疣状”的外观。","这是非常少见的术语，更多见于旧文献或特定历史语境。实际交流中更常用的说法是“chromoblastomycosis（着色芽生菌病）”或更泛化的“chronic cutaneous fungal infection（慢性皮肤真菌感染）”。"]}
{"word":"hadron","summary":{"en":"A hadron is a quark-based particle (like a proton or neutron) held together by the strong nuclear force.","zh":"强子是由夸克构成并由强相互作用束缚在一起的粒子，如质子和中子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In particle physics, a particle made of quarks held together by the strong nuclear force (for example, protons and neutrons).","zh":"（粒子物理）强子：由夸克组成并通过强相互作用力束缚在一起的粒子（如质子和中子）。"},"examples":[{"en":"Protons and neutrons are hadrons found in the nucleus of an atom.","zh":"质子和中子是原子核中常见的强子。"},{"en":"In high-energy collisions, new hadrons can be created from energy.","zh":"在高能碰撞中，能量可以转化并产生新的强子。"}]}],"synonyms":["baryon","meson"],"phonetic":"/ˈhæd.rɑn/","extraExplanation":["“Hadron”来自希腊语词根 hadrós，意思是“厚的、强壮的、结实的”，用来强调它们参与强相互作用（strong force）。","强子主要分为两大类：重子（baryons，如质子、 中子）和介子（mesons）。与之相对的是“轻子”（leptons，如电子、μ子），轻子不参与强相互作用。"]}
{"word":"hadronic","summary":{"en":"Hadronic means “related to hadrons (protons, neutrons, etc.) or strong-force particle interactions.”","zh":"hadronic 意为“与强子（如质子、中子等）或强相互作用相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hadrons (particles such as protons and neutrons that are made of quarks) or to interactions involving the strong nuclear force.","zh":"与强子有关的；指由夸克构成的粒子（如质子、中子）或与强核力相关的相互作用。"},"examples":[{"en":"Protons and neutrons are hadronic particles.","zh":"质子和中子是强子粒子。"},{"en":"The experiment studies hadronic interactions at very high energy.","zh":"该实验研究超高能下的强子相互作用。"},{"en":"Physicists measured the hadronic cross section to test their model.","zh":"物理学家测量强子散射截面以检验他们的模型。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involving particle “showers” or matter made mainly of hadrons (common in cosmic-ray and collider physics).","zh":"（常用于宇宙线与对撞机物理）指主要由强子构成的物质，或由强子产生的“簇射/级联”现象。"},"examples":[{"en":"A hadronic shower forms when a high-energy particle hits the detector material.","zh":"当高能粒子撞击探测器材料时，会形成强子簇射。"},{"en":"The team separated electromagnetic signals from hadronic background.","zh":"团队将电磁信号与强子本底区分开来。"}]}],"synonyms":["strong-interaction","hadron-related","nuclear (context-dependent)"],"phonetic":"/hæˈdrɑnɪk/","extraExplanation":["“hadronic”来自“hadron（强子）”。hadron一词源自希腊语 hadrós（意为“厚重、强壮”），用来强调这类粒子会参与强相互作用（强核力）。","学习时可以把它与“leptonic（轻子相关的）”对比：轻子（如电子、μ子）不参与强相互作用，而强子（如质子、中子、介子）会参与。","常见搭配：hadronic matter（强子物质）、hadronic interaction（强子相互作用）、hadronic shower（强子簇射）、hadronic cross section（强子截面）。"]}
{"word":"hadrons","summary":{"en":"Hadrons are quark-based particles (like protons and neutrons) bound by the strong nuclear force.","zh":"强子是由夸克组成并受强核力束缚的粒子（如质子和中子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of subatomic particle made of quarks and held together by the strong nuclear force (for example, protons and neutrons)","zh":"一种由夸克组成、通过强相互作用（强核力）结合在一起的亚原子粒子（例如质子和中子）"},"examples":[{"en":"Protons and neutrons are hadrons found in the nucleus of an atom.","zh":"质子和中子是原子核中常见的强子。"},{"en":"In particle physics, hadrons are grouped into baryons and mesons.","zh":"在粒子物理学中，强子通常分为重子和介子。"},{"en":"The experiment studied how hadrons form after high-energy collisions.","zh":"该实验研究了高能碰撞后强子如何形成。"}]}],"synonyms":["strongly interacting particles","baryons","mesons"],"phonetic":"ˈhædrɑn","extraExplanation":["“Hadron”一词来自希腊语 *hadros*，意为“厚的、强的”，强调这类粒子会参与强相互作用。该术语在20世纪60年代被物理学家推广使用，用来统称“强相互作用粒子”。","学习提示：你输入的 **hadrons** 是复数形式；单数是 **hadron**。"]}
{"word":"hadrosaur","summary":{"en":"A hadrosaur is a duck-billed, plant-eating dinosaur from the Late Cretaceous.","zh":"hadrosaur 指白垩纪晚期的鸭嘴龙类植食性恐龙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a duck-billed dinosaur (a plant-eater) that lived in the Late Cretaceous period; hadrosaurs are known for their broad, flat snouts and complex teeth for chewing plants","zh":"鸭嘴龙类（植食性恐龙），生活在白垩纪晚期；以宽扁的“鸭嘴”口鼻和适合咀嚼植物的复杂牙齿著称"},"examples":[{"en":"Hadrosaurs traveled in groups and grazed on many kinds of plants.","zh":"鸭嘴龙类常成群活动，吃多种植物。"},{"en":"The museum display shows a hadrosaur skeleton with a long tail and a duck-like bill.","zh":"博物馆展品展示了一具鸭嘴龙类骨架，有长尾巴和类似鸭嘴的口鼻。"},{"en":"Scientists study hadrosaur footprints to learn how these dinosaurs moved.","zh":"科学家通过研究鸭嘴龙类的足迹来了解它们如何移动。"}]}],"synonyms":["duck-billed dinosaur","hadrosaurid"],"phonetic":"/ˈhædrəˌsɔr/","extraExplanation":["词源：Hadrosaur 来自希腊语 hadros（“粗壮的、厚实的”）+ sauros（“蜥蜴”），字面意思接近“粗壮的蜥蜴”。","相关概念：hadrosaur 通常既可泛指“鸭嘴龙类（Hadrosauridae 及其近亲）”，也常在科普语境中被当作“鸭嘴龙”这一类恐龙的统称。常见例子包括 Edmontosaurus（埃德蒙顿龙）和 Parasaurolophus（副栉龙）。"]}
{"word":"hadrosaurus","summary":{"en":"Hadrosaurus is a duck-billed, plant-eating dinosaur.","zh":"Hadrosaurus 指一种鸭嘴状口部的食草恐龙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large plant-eating dinosaur known for its duck-like bill; a member of the duck-billed dinosaurs (hadrosaurs)","zh":"一种大型食草恐龙，以类似鸭嘴的口部闻名；属于“鸭嘴龙类”（hadrosaur）"},"examples":[{"en":"Hadrosaurus was a duck-billed dinosaur that ate plants.","zh":"Hadrosaurus 是一种鸭嘴类恐龙，以植物为食。"},{"en":"In museums, a Hadrosaurus skeleton helps people imagine what dinosaurs looked like.","zh":"在博物馆里，Hadrosaurus 的骨架能帮助人们想象恐龙长什么样。"}]}],"synonyms":["duck-billed dinosaur","hadrosaur"],"phonetic":"/ˌhædrəˈsɔrəs/","extraExplanation":["“Hadrosaurus”来自希腊语词根：hadros-（粗壮的、厚实的）+ -saurus（蜥蜴/蜥蜴状爬行动物，常用于恐龙名字）。所以名字大意是“粗壮的蜥蜴”。","它与更广义的“hadrosaur（鸭嘴龙类）”有关：Hadrosaurus 是一个具体的属名（genus），而 hadrosaur 是一大类相近恐龙的统称。"]}
{"word":"hadst","summary":{"en":"“Hadst” is an archaic form meaning “you had,” used with “thou.”","zh":"“hadst”是古体形式，意思是“你曾有/你已经有”，与“thou”连用。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"(archaic) Second-person singular past tense of “have,” used with “thou,” meaning “you had.”","zh":"（古体）“have”的第二人称单数过去式，与“thou”连用，意思是“你曾有／你已经有”。"},"examples":[{"en":"Thou hadst a kind heart, even when no one noticed.","zh":"你曾有一颗善良的心，即使无人察觉。"},{"en":"If thou hadst listened, we might have avoided trouble.","zh":"如果你当时听了，我们也许就能避免麻烦。"}]},{"partOfSpeech":"v.","definition":{"en":"(archaic) Used as the main verb “had,” meaning “you possessed” or “you experienced” (with “thou”).","zh":"（古体）作实义动词“had”用，表示“你拥有／你经历过”（与“thou”连用）。"},"examples":[{"en":"Thou hadst the chance to speak, but you stayed silent.","zh":"你当时有机会发言，但你保持了沉默。"},{"en":"Thou hadst many hardships in those years.","zh":"那些年你经历了许多艰难。"}]}],"synonyms":["you had","had (with you)"],"phonetic":"/hædst/","extraExplanation":["“hadst”几乎只出现在古英语/早期现代英语文本中（常见于《圣经》英译、莎士比亚等文学作品），与主语“thou（你）”搭配。现代英语里通常用“you had”。","常见对应：thou hast（你有，现在式）、thou hadst（你有过/你曾有，过去式）。"]}

