{"word":"hae","summary":{"en":"“Hae” is chiefly a Scottish dialect form of “have,” and it can also appear as an informal misspelling of “hey.”","zh":"“hae”主要是苏格兰方言中“have”的写法；也可能是把“hey”误拼成“hae”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scottish English, dialect) a form of “have,” used especially in writing or speech that reflects Scots/Scottish usage.","zh":"（苏格兰英语/方言）“have”的一种形式，常见于反映苏格兰口语或文学写法的表达中。"},"examples":[{"en":"I hae a question for you.","zh":"我有个问题想问你。"},{"en":"We hae been waiting a long time.","zh":"我们已经等了很久。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal text) sometimes a misspelling of “hey,” used as a greeting.","zh":"（非正式网络用语）有时是“hey”的拼写错误，用作打招呼。"},"examples":[{"en":"Hae! Are you free today?","zh":"嗨！你今天有空吗？"}]}],"synonyms":["have","hey"],"phonetic":"/heɪ/","extraExplanation":["“hae”在苏格兰文学和诗歌里很常见，比如罗伯特·彭斯（Robert Burns）的作品中会用这种拼写来呈现口音与地方色彩。日常标准英语写作中通常不用，改用“have”。","如果你本来想写的是打招呼的“hey”，标准拼写是“hey”（更自然、通用）。"]}
{"word":"haec","summary":{"en":"Haec is a Latin demonstrative meaning “this” (feminine singular) or “these” (neuter plural), depending on context.","zh":"haec 是拉丁语指示代词，依语境可表示“这/这个（阴性单数）”或“这些（中性复数）”。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"(Latin) “this” (feminine singular nominative), used to point to a specific woman/thing close to the speaker or just mentioned.","zh":"（拉丁语）“这/这个”（阴性单数主格），用于指代离说话者较近或刚提到的女性/事物。"},"examples":[{"en":"Haec femina docta est.","zh":"这个女人很有学问。"},{"en":"Haec est mea domus.","zh":"这是我的家。"}]},{"partOfSpeech":"pron.","definition":{"en":"(Latin) “these” (neuter plural nominative/accusative), used to point to specific things.","zh":"（拉丁语）“这些”（中性复数主格/宾格），用于指代特定的事物。"},"examples":[{"en":"Haec verba memoriae mando.","zh":"我把这些话记在心里。"},{"en":"Haec vidi et credidi.","zh":"我看到了这些，并相信了。"}]}],"synonyms":["this","these"],"phonetic":"/haɪk/","extraExplanation":["“haec”来自指示代词 hic, haec, hoc（这个/这位/这一件）。它不是英语单词，常见于拉丁语文本、法律/学术引文或古典作品里。","常用搭配：haec est…（这是……）；post haec（在这之后）；inter haec（在此期间/与此同时）。","在拉丁语里，同一个形式可能对应不同性/数/格：haec 既可作阴性单数主格“这位/这个（女）”，也可作中性复数主/宾格“这些（东西）”。需要结合句子里的名词与动词来判断。"]}
{"word":"haecceities","summary":{"en":"Haecceities means the unique “thisness” that makes something a particular individual, a term mostly used in philosophy.","zh":"Haecceities 指使某物成为“这一个具体个体”的独特“此性/这一个性”，主要用于哲学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the unique qualities that make a particular person or thing this exact individual, not just a member of a group; “thisness” (a term used in philosophy)","zh":"使某个事物成为“这个具体个体”的独特性质；“此性/这一个性”（哲学术语）"},"examples":[{"en":"In medieval philosophy, haecceities explain why two identical-looking objects can still be different individuals.","zh":"在中世纪哲学中，“haecceities（此性）”用来解释为什么两个看起来完全一样的物体仍然是不同的个体。"},{"en":"The novelist tries to capture each character’s haecceity through small habits and personal memories.","zh":"小说家试图通过细微的习惯和个人记忆来呈现每个角色独有的“此性”。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular individual thing understood as a unique “this” (less common; often used as a countable noun)","zh":"被理解为独一无二“这一个”的具体个体（较少见；有时可数）"},"examples":[{"en":"The museum’s collection includes many haecceities—objects valued for their singular history, not just their type.","zh":"博物馆的馆藏包含许多“独特个体之物”——它们的价值来自独一无二的历史，而不只是类别。"}]}],"synonyms":["thisness","individuality","uniqueness"],"phonetic":"/hiːk.siːˈiː.tiz/","extraExplanation":["这个词常与中世纪经院哲学相关，尤其是邓斯·司各脱（Duns Scotus）。他用“haecceitas/haecceity”来说明：除了“共同的本质/种类”（例如“人性”“猫性”）之外，还需要某种“个体化原则”来解释为什么某个实体是“这一个具体的人/猫”。","词形来源于拉丁语 haec（“这个”）+ -ceitas（表示性质/状态）。日常英语很少用，多见于哲学、文学批评或强调“个体独特性”的写作中。"]}
{"word":"haecceity","summary":{"en":"Haecceity means the “thisness” that makes something a unique individual, discussed especially in philosophy of identity.","zh":"Haecceity 指“此性/这一个性”，即使某物成为独一无二的具体个体的特质，常见于同一性与个体化的哲学讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy) The quality that makes something a particular, unique individual—its “thisness,” not just its general type or category.","zh":"（哲学）使某个事物成为“这个具体个体”的特质，即它的“此性/这一个性”，而不仅是某一类事物的共性。"},"examples":[{"en":"In medieval philosophy, haecceity is what makes Socrates this one person, not just a human being.","zh":"在中世纪哲学中，haecceity 指的是让苏格拉底成为“这个人”的东西，而不仅仅是“一个人类”。"},{"en":"The novelist tried to capture each character’s haecceity through small, specific details.","zh":"这位小说家试图通过细小而具体的细节来呈现每个角色独一无二的“此性”。"}]},{"partOfSpeech":"n.","definition":{"en":"A term used in discussions of identity and individuation: the principle or feature that distinguishes one entity from all others.","zh":"用于讨论同一性与个体化的术语：区分某个实体与其他所有实体的原则或特征。"},"examples":[{"en":"Two identical twins may look alike, but philosophers ask what grounds each twin’s haecceity.","zh":"同卵双胞胎可能长得很像，但哲学家会问：是什么奠定了每个人各自的 haecceity？"},{"en":"The debate focused on whether haecceity depends on physical facts or something more abstract.","zh":"争论聚焦于：haecceity 是取决于物理事实，还是取决于更抽象的东西。"}]}],"synonyms":["thisness","individuality","particularity","unique identity"],"phonetic":"/hɛkˈsiːɪti/","extraExplanation":["这个词常与中世纪经院哲学家邓斯·司各脱（Duns Scotus）联系在一起。他用它来解释“个体之所以是这个个体”的根据，与强调“共相/共性”的观点形成对照。","词源来自拉丁语 *haec*（“这个”）+ 词缀 *-ceitas*（表示性质），直观理解就是“这个性/这一个性”。","在现代哲学与文学批评中，它也常被用来谈“个体身份”“不可替代性”，有时带一点诗意或强调细节的写法。"]}
{"word":"haeckelian","summary":{"en":"Haeckelian means “related to Ernst Haeckel,” especially his evolutionary/embryology ideas or his distinctive scientific-art illustration style.","zh":"Haeckelian 指“与恩斯特·海克尔有关的”，常见于他的进化/胚胎学观点（如复演说）或他标志性的科学艺术插图风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the German biologist Ernst Haeckel, especially his ideas about evolution and embryology (often referring to the “recapitulation theory”).","zh":"（形容词）与德国生物学家恩斯特·海克尔（Ernst Haeckel）有关的，尤指他关于进化与胚胎学的观点（常指“复演说/重演论”）。"},"examples":[{"en":"Some textbooks mention the Haeckelian idea that embryos repeat evolutionary history, though modern biology rejects it as too simplistic.","zh":"一些教材会提到海克尔式的观点：胚胎会重复进化史，但现代生物学认为这过于简化而不成立。"},{"en":"The museum display included a Haeckelian illustration of marine organisms.","zh":"博物馆展览中有一幅海克尔式的海洋生物插图。"}]},{"partOfSpeech":"adj.","definition":{"en":"having features, style, or imagery similar to Haeckel’s famous scientific drawings (often intricate, symmetrical, and nature-inspired).","zh":"（形容词）具有类似海克尔著名科学绘图的特征、风格或意象的（常见特点：精细、对称、自然灵感）。"},"examples":[{"en":"Her poster used Haeckelian patterns to show the beauty of microscopic life.","zh":"她的海报用海克尔式的图案来展示微观生命之美。"},{"en":"The wallpaper’s Haeckelian look mixes science and art.","zh":"这款壁纸的海克尔式风格把科学与艺术融合在一起。"}]}],"synonyms":["Haeckel-related","Haeckelian"],"phonetic":"/hɛˈkɛliən/","extraExplanation":["“Haeckelian”来自人名 Haeckel（海克尔）。学术写作中多用于描述与海克尔相关的理论、方法或图像风格。","海克尔曾提出著名但已被否定的“复演说/重演论”（ontogeny recapitulates phylogeny，常译“个体发育重演系统发育”）。今天提到 “Haeckelian” 在胚胎学语境里往往带有历史性或批判性的意味。","海克尔的作品《自然的艺术形态》（Kunstformen der Natur）以精美的生物插图闻名，因此在设计、艺术评论里，“Haeckelian”也可指那种精细对称、带有自然几何美感的视觉风格。"]}
{"word":"haeckelism","summary":{"en":"Haeckelism is Ernst Haeckel’s set of evolutionary and philosophical ideas, especially the claim that development repeats evolution and a monistic view of nature.","zh":"海克尔主义指海克尔的一套进化与哲学思想，常与“个体发育重演系统发育”和一元论自然观相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ideas or doctrines associated with the German biologist Ernst Haeckel, especially his evolutionary views (such as “ontogeny recapitulates phylogeny”) and a monistic philosophy that treats mind and matter as one.","zh":"海克尔主义：与德国生物学家恩斯特·海克尔（Ernst Haeckel）相关的一套观点或学说，尤其指他的进化论主张（如“个体发育重演系统发育”）以及把精神与物质视为一体的“一元论”哲学。"},"examples":[{"en":"In early biology classes, some students encountered Haeckelism through the idea that embryos repeat evolutionary history.","zh":"在早期的生物学课堂里，有些学生是通过“胚胎会重复进化历史”的说法接触到海克尔主义的。"},{"en":"The article criticizes Haeckelism for oversimplifying how development and evolution relate.","zh":"这篇文章批评海克尔主义过度简化了“发育”和“进化”之间的关系。"}]}],"synonyms":["Haeckelian doctrine","recapitulation theory (historical)"],"phonetic":"/ˈhɛkəlɪzəm/","extraExplanation":["“Haeckelism”源自恩斯特·海克尔（1834–1919）。他提出的“个体发育重演系统发育”（ontogeny recapitulates phylogeny）在历史上影响很大，但在现代生物学中被认为过于绝对；今天更常见的观点是：发育过程可能保留某些进化痕迹，但并不会简单地“重演”祖先形态。","海克尔还推广一种带有哲学色彩的“进化一元论”（monism），试图用自然科学统一解释生命、意识与宇宙。该词在学术写作中多用于历史回顾或批判性讨论，而不是作为现代主流理论标签。"]}
{"word":"haed","summary":{"en":"“Haed” is a nonstandard/Scots spelling of “head.”","zh":"“haed”是“head”的非标准/苏格兰英语拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/Scots spelling) “head”: the part of the body above the neck that contains the brain, eyes, nose, and mouth; also used to mean a person’s mind or thoughts.","zh":"（非标准/苏格兰英语拼写）“head”：头部（颈部以上、包含大脑和五官的部位）；也可引申指“头脑/想法”。"},"examples":[{"en":"He hit his head on the door frame.","zh":"他的头撞到了门框上。"},{"en":"I can’t get that song out of my head.","zh":"那首歌一直在我脑子里挥之不去。"}]},{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/Scots spelling) “head”: to lead or be at the front of something; to go in a particular direction.","zh":"（非标准/苏格兰英语拼写）“head”：带领/位居前列；朝某个方向前进。"},"examples":[{"en":"She will head the team next year.","zh":"明年她将带领这个团队。"},{"en":"We’re heading home now.","zh":"我们现在正往家走。"}]}],"synonyms":["head","mind (figurative)","leader (as a noun, in some contexts)"],"phonetic":"/hɛd/","extraExplanation":["“haed”常见于苏格兰英语（Scots）或带方言色彩的写法，用来表现口音/地域身份；在标准英语写作里通常用“head”。","如果你是在看文学作品或歌词里遇到“haed”，多半是作者刻意保留方言拼写来增强真实感。"]}
{"word":"haeing","summary":{"en":"“haeing” is not a standard word; it’s usually a misspelling of “having.”","zh":"“haeing” 不是标准单词，通常是 “having” 的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“haeing” is not a standard English word. It is usually a misspelling of “having” (the -ing form of “have”).","zh":"“haeing” 不是标准英语单词，通常是把 “having”（have 的 -ing 形式）拼错了。"},"examples":[{"en":"Incorrect: I am haeing dinner now. / Correct: I am having dinner now.","zh":"错误：I am haeing dinner now. / 正确：I am having dinner now.（我正在吃晚饭。）"},{"en":"Incorrect: Thanks for haeing me. / Correct: Thanks for having me.","zh":"错误：Thanks for haeing me. / 正确：Thanks for having me.（谢谢你的招待/邀请我来。）"}]}],"synonyms":["having"],"phonetic":"/ˈhævɪŋ/","extraExplanation":["这类拼写错误常见于把 “v” 漏掉或打字手滑（having → haeing）。","如果你原本想表达“晒干的草/干草相关”，也可能是想写 “haying”（制作/收割干草）。你可以告诉我原句，我帮你确认最合适的词。"]}
{"word":"haem","summary":{"en":"Haem is the British spelling of heme, the iron-containing part of hemoglobin that helps carry oxygen.","zh":"Haem 是 heme 的英式拼写，指血红蛋白中含铁、帮助携氧的部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the iron-containing part of hemoglobin and some enzymes; it helps carry oxygen in blood (British spelling of “heme”).","zh":"（血红素/血基质）血红蛋白及某些酶中含铁的部分；帮助血液携带氧气（英式拼写，对应美式 heme）。"},"examples":[{"en":"Hemoglobin contains haem, which binds oxygen in the lungs.","zh":"血红蛋白含有 haem，它在肺部与氧结合。"},{"en":"A defect in making haem can lead to certain forms of porphyria.","zh":"合成 haem 的过程出现问题，可能导致某些类型的卟啉症。"}]}],"synonyms":["heme","haem group","prosthetic group (in some contexts)"],"phonetic":"/him/","extraExplanation":["“haem”常见于英式英语与医学/生物化学写作；在美式英语里更常写作“heme”。","词根来自希腊语 haima（“血”），所以你会在很多与血有关的词里看到 haem-/hem-（如 haematology/hematology：血液学）。","不要把 haem（heme）和 hem（衣服的“下摆/卷边”）混淆；两者发音和含义都不同。"]}
{"word":"haema","summary":{"en":"Haema- is a medical combining form meaning “blood,” common in British spelling.","zh":"haema- 是医学中表示“血”的构词成分，常见于英式拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form (mainly British/Commonwealth spelling) meaning “blood,” used in medical terms.","zh":"（主要为英式/英联邦拼写的）词根/构词成分，表示“血、与血有关”，常见于医学词汇中。"},"examples":[{"en":"Haema- appears in words like haematology (the study of blood).","zh":"haema- 常见于 haematology（血液学）等词中。"},{"en":"In American English, the same idea is usually spelled hema- or hemo-, as in hematology.","zh":"在美式英语中，同一词根通常写作 hema- 或 hemo-，如 hematology。"}]}],"synonyms":["hema-","hemo-","haem-","blood-"],"phonetic":"/ˈhiːmə/","extraExplanation":["“haema-”来自希腊语 haima（意为“血”）。现代英语里它多作为前缀/构词形式出现，而不是独立单词。","拼写差异很常见：英式常写 haem-（haemoglobin），美式常写 hem-（hemoglobin）。因此你可能更常在词典里查到 haem- / hema- / hemo-。"]}
{"word":"haemachrome","summary":{"en":"Haemachrome is a rare scientific word for a brown pigment formed from aging/breaking-down hemoglobin.","zh":"Haemachrome 是一个罕见的科学词，指血红蛋白随时间分解/变化形成的棕褐色色素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brownish pigment formed from hemoglobin as blood breaks down or ages (a rare, technical term used in chemistry/biology).","zh":"（罕见、技术性用语）由血红蛋白在分解或陈旧过程中形成的棕褐色血色素类色素。"},"examples":[{"en":"In an old bloodstain, some hemoglobin can convert into haemachrome-like pigments.","zh":"在陈旧的血迹中，部分血红蛋白会转变成类似 haemachrome 的色素。"},{"en":"The report mentioned haemachrome when describing changes in blood color over time.","zh":"报告在描述血液颜色随时间变化时提到了 haemachrome。"}]}],"synonyms":["hemachrome","(related) hemichrome","(related) hemochromogen"],"phonetic":"/ˈhiːməˌkroʊm/","extraExplanation":["这个词非常少见，更多时候会看到拼写变体 hemachrome（美式）或相关术语如 hemichrome。它们都与血红蛋白在氧化、变性或与其他分子结合后产生的颜色变化有关。","在法医学或生物化学的语境里，这类术语可能用于解释“血迹变旧后为何从鲜红变为褐色”等现象，但不同作者对具体化学定义的用法可能不完全一致。"]}
{"word":"haemacytometer","summary":{"en":"A haemacytometer is a microscope counting chamber used to measure cell concentration in a sample.","zh":"haemacytometer 是一种显微镜下的计数室/计数板，用于测定样品中的细胞浓度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A laboratory instrument (a special thick glass slide with a ruled grid) used to count cells in a known volume of fluid, such as blood cells, yeast, or cultured cells under a microscope.","zh":"血细胞计数板（血球计数板）：一种实验室仪器（带刻度网格的加厚玻片），用于在显微镜下对一定体积液体中的细胞进行计数，如血细胞、酵母或培养细胞。"},"examples":[{"en":"We used a haemacytometer to count the yeast cells before starting the fermentation.","zh":"发酵开始前，我们用血细胞计数板来统计酵母细胞数量。"},{"en":"After staining, the technician loaded the sample into the haemacytometer and counted cells under the microscope.","zh":"染色后，技术员把样品加到血细胞计数板里，并在显微镜下进行细胞计数。"}]}],"synonyms":["hemacytometer","(cell) counting chamber","Neubauer chamber"],"phonetic":"/ˌhiːməˈsaɪtɑːmɪtɚ/","extraExplanation":["“haemacytometer”常见于英式拼写；美式英语更常写作“hemacytometer”。词根方面：haema-（血）+ cyto-（细胞）+ -meter（测量器），因此最初多用于血细胞计数，但现在也广泛用于各类细胞计数。","常见搭配：use a haemacytometer；count cells with a haemacytometer；load/charge the haemacytometer；grid squares（网格方格）；dilution factor（稀释倍数）。"]}
{"word":"haemad","summary":{"en":"“haemad” is not a standard English word; it’s probably a misspelling or a non-dictionary form.","zh":"“haemad”不是标准英语单词；很可能是拼写错误或非词典形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a non-dictionary form (for example, a name, a typo, or a shortened form).","zh":"不是标准英语单词。更可能是拼写错误或非词典形式（例如人名、打字错误或缩写）。"},"examples":[{"en":"I couldn’t find “haemad” in the dictionary—did you mean “haemoglobin” or “haematology”?","zh":"我在词典里找不到“haemad”——你想写的是“haemoglobin（血红蛋白）”还是“haematology（血液学）”吗？"},{"en":"Please check the spelling of “haemad” in your notes.","zh":"请检查你笔记里“haemad”的拼写。"}]}],"extraExplanation":["“haem-”是英式拼写中常见的医学词根，来自希腊语，意思与“血”有关（美式通常写作“hem-”）。常见词：haemoglobin/hemoglobin（血红蛋白）、haemorrhage/hemorrhage（出血）、haematology/hematology（血液学）。","如果你能告诉我它出现的句子或领域（医学、化学、名字、游戏ID等），我可以更准确判断它想表达的词。"]}
{"word":"haemagglutinate","summary":{"en":"To cause (or undergo) clumping of red blood cells, especially in immunology/virology tests.","zh":"指使（或发生）红细胞凝集，常用于免疫学/病毒学检测语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of antibodies, viruses, or other substances) to cause red blood cells to clump together; to make blood cells stick to each other.","zh":"（抗体、病毒或其他物质）使红细胞发生凝集；使血细胞黏在一起、成团。"},"examples":[{"en":"Some viruses can haemagglutinate red blood cells in a lab test.","zh":"某些病毒在实验室检测中会使红细胞发生凝集。"},{"en":"The antibody caused the sample to haemagglutinate within minutes.","zh":"这种抗体使样本在几分钟内出现红细胞凝集。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) to clump together as red blood cells; to undergo haemagglutination.","zh":"（较少用）红细胞自身发生凝集；出现血凝现象。"},"examples":[{"en":"At high antibody levels, the cells may haemagglutinate quickly.","zh":"在抗体浓度较高时，这些细胞可能会迅速发生凝集。"}]}],"synonyms":["hemagglutinate","agglutinate","clump","cause agglutination"],"phonetic":"/ˌhiː.məˈɡluː.təˌneɪt/","extraExplanation":["英式拼写为 haemagglutinate；美式常写作 hemagglutinate（haema-/hema- 都表示“血”）。","这个词常见于免疫学/病毒学语境，例如“血凝试验（hemagglutination assay）”，用于观察病毒或抗体是否会让红细胞结团，从而辅助鉴定或测量活性。"]}
{"word":"haemagglutinated","summary":{"en":"Haemagglutinated means red blood cells have clumped together, often due to antibodies or viruses.","zh":"haemagglutinated 指红细胞发生凝集成团，常由抗体或病毒引起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical/biology) Clumped together (of red blood cells), usually because of antibodies or viruses causing hemagglutination.","zh":"（医学/生物）指红细胞被凝集成团，通常由于抗体或病毒引起血凝反应。"},"examples":[{"en":"The sample showed haemagglutinated red blood cells under the microscope.","zh":"在显微镜下，这份样本显示红细胞发生了血凝（凝集成团）。"},{"en":"In the lab report, “haemagglutinated” indicates that the red blood cells clumped rather than staying evenly suspended.","zh":"在实验报告里，“haemagglutinated”表示红细胞发生了聚集，而不是均匀悬浮。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of haemagglutinate: to cause red blood cells to clump together.","zh":"haemagglutinate 的过去式/过去分词：使红细胞发生凝集。"},"examples":[{"en":"The virus haemagglutinated the red blood cells in the assay.","zh":"在该测定中，病毒使红细胞发生了凝集。"},{"en":"The antibodies had haemagglutinated the cells within minutes.","zh":"这些抗体在几分钟内就使细胞发生了凝集。"}]}],"synonyms":["agglutinated","clumped","hemagglutinated"],"phonetic":"/ˌhiːməˈɡluːtəˌneɪtɪd/","extraExplanation":["这是一个非常专业的实验/医学用词，常见于血清学检测与病毒学（例如流感病毒的“血凝试验”）。","英式拼写多用 haem-（haemagglutinated），美式更常见 hem-（hemagglutinated）。","词根提示：haemo-/hemo- 表示“血”，agglutinate 表示“凝集、黏结成团”。"]}
{"word":"haemagglutinating","summary":{"en":"Haemagglutinating describes something (often a virus or protein) that makes red blood cells clump together.","zh":"Haemagglutinating 指（常为病毒或蛋白）能使红细胞凝集结团的特性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology/medicine) Causing red blood cells to clump together (agglutinate).","zh":"（生物/医学）使红细胞发生凝集（结团）的。"},"examples":[{"en":"Some viruses have haemagglutinating proteins that make red blood cells clump.","zh":"一些病毒具有血凝蛋白，会使红细胞结团。"},{"en":"The lab reported strong haemagglutinating activity in the sample.","zh":"实验室报告该样本具有很强的血凝活性。"}]}],"synonyms":["hemagglutinating","agglutinating (red blood cells)","haemagglutinative"],"phonetic":"/ˌhiːməˈɡluːtɪneɪtɪŋ/","extraExplanation":["“haemagglutinating”常见于病毒学与免疫学文献，描述某些病毒表面蛋白（如流感病毒的 hemagglutinin/HA，血凝素）能与红细胞表面受体结合，导致红细胞凝集。","英式拼写常用 haem-（如 haemagglutinating），美式更常见 hem-（hemagglutinating）；两者含义相同。","相关检测：HA（血凝）试验会利用“红细胞是否形成网格状铺展/是否沉降”来判断样本是否具有血凝活性。"]}
{"word":"haemagglutination","summary":{"en":"Haemagglutination is the clumping of red blood cells, often triggered by antibodies or viruses.","zh":"haemagglutination 指红细胞在抗体或病毒等作用下发生的凝集现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The clumping together of red blood cells (RBCs), usually caused by antibodies or viruses binding to molecules on the cell surface.","zh":"红细胞凝集：红细胞聚集成团的现象，通常由抗体或病毒与红细胞表面分子结合而引起。"},"examples":[{"en":"The lab test showed haemagglutination when the patient’s serum was mixed with red blood cells.","zh":"将患者血清与红细胞混合后，实验显示发生了红细胞凝集。"},{"en":"Some viruses can cause haemagglutination by attaching to receptors on red blood cells.","zh":"有些病毒会通过附着在红细胞受体上而引起红细胞凝集。"}]}],"synonyms":["hemagglutination","red blood cell agglutination","RBC agglutination"],"phonetic":"/ˌhiːməˌɡluːtəˈneɪʃən/","extraExplanation":["英式拼写 haemagglutination 对应美式拼写 hemagglutination；医学与生物学文献中两种拼写都常见。","该词常出现在免疫学与病毒学检测中，例如“血凝试验（hemagglutination assay）”用来观察是否发生凝集，以帮助判断某些病毒或抗体的存在与活性。","词源可拆解理解：haem-/hem-（血）+ agglutination（黏合、凝集），因此字面意思就是“血细胞的凝集”。"]}
{"word":"haemagglutinative","summary":{"en":"Haemagglutinative means “causing or related to the clumping of red blood cells,” mainly used in medical/biological contexts.","zh":"haemagglutinative 指“引起或与红细胞凝集有关的”，主要用于医学/生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to cause hemagglutination (the clumping of red blood cells), or relating to this effect (often used in biology/medicine).","zh":"能引起红细胞凝集（红细胞结块）的；或与这种作用有关的（多用于生物学/医学语境）。"},"examples":[{"en":"Some influenza viruses have haemagglutinative proteins that help them attach to cells.","zh":"一些流感病毒具有可引起红细胞凝集的蛋白质，帮助它们附着在细胞上。"},{"en":"The lab tested the serum for haemagglutinative activity using red blood cells.","zh":"实验室用红细胞检测该血清是否具有红细胞凝集活性。"}]}],"synonyms":["hemagglutinative","agglutinating (of red blood cells)","hemagglutinating"],"phonetic":"/ˌhiːməˈɡluːtənətɪv/","extraExplanation":["拼写提示：haemagglutinative 是英式拼写；美式更常见 hemagglutinative（haema- → hema- 都表示“血”）。","常见相关词：hemagglutination（红细胞凝集，名词）、hemagglutinin（血凝素/凝集素，名词；如流感病毒表面的 HA 蛋白）。","使用场景：多见于免疫学、病毒学、血清学检测等专业文本；日常英语中很少使用。"]}
{"word":"haemagglutinin","summary":{"en":"Haemagglutinin is a protein—often on viruses like influenza—that causes red blood cells to clump and helps the virus attach to cells.","zh":"Haemagglutinin（血凝素）是一种蛋白质，常见于流感等病毒表面，可引起红细胞凝集，并帮助病毒与细胞结合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein (especially on some viruses) that can cause red blood cells to clump together (agglutinate); in influenza, it is the “H” protein on the virus surface that helps the virus attach to host cells","zh":"一种（尤其存在于某些病毒表面的）蛋白质，可使红细胞发生凝集；在流感病毒中，它就是病毒表面的“H”蛋白，帮助病毒黏附并进入宿主细胞"},"examples":[{"en":"Influenza haemagglutinin helps the virus bind to cells in the respiratory tract.","zh":"流感病毒的血凝素帮助病毒与呼吸道细胞结合。"},{"en":"Scientists study haemagglutinin to understand how new flu strains spread.","zh":"科学家研究血凝素，以了解新的流感毒株如何传播。"}]},{"partOfSpeech":"n.","definition":{"en":"any substance (such as an antibody or plant protein) that makes red blood cells clump together","zh":"任何能使红细胞凝集的物质（如某些抗体或植物蛋白）"},"examples":[{"en":"The lab used a haemagglutinin test to observe red blood cell clumping.","zh":"实验室用血凝素相关测试来观察红细胞凝集现象。"}]}],"synonyms":["hemagglutinin","HA (influenza context)"],"phonetic":"/ˌhiːməˈɡluːtənɪn/","extraExplanation":["“Haemagglutinin”是英式拼写；美式更常写作“hemagglutinin”。在流感命名里常看到H和N（如H1N1）：H指haemagglutinin/hemagglutinin，N指neuraminidase（神经氨酸酶）。","在流感病毒中，HA（血凝素）是疫苗和免疫研究的重要靶点之一，因为它位于病毒表面，容易被免疫系统识别；同时它也会发生变异，所以不同季节的流感疫苗配方可能会更新。"]}
{"word":"haemagogue","summary":{"en":"Haemagogue means a (now rare) substance believed to stimulate bleeding, especially to bring on menstruation.","zh":"Haemagogue 指一种（现已罕用的）被认为能促进出血的药物或物质，尤指用于催经。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug or substance believed to promote the flow or discharge of blood (especially to stimulate menstruation); an old/rare medical term","zh":"（旧/罕见医学用语）被认为能促进出血或使血液排出体外的药物或物质；尤指用于“催经”的东西"},"examples":[{"en":"In older medical texts, certain herbs were described as haemagogues used to bring on menstruation.","zh":"在较早的医学文献中，一些草药被称为 haemagogue，用来促使月经来潮。"},{"en":"The term haemagogue is rare in modern medicine and is mostly seen in historical writing.","zh":"haemagogue 这个词在现代医学中很少使用，多见于历史性的写作中。"}]}],"synonyms":["emmenagogue (related term)","blood-moving agent (informal explanation)"],"phonetic":"/ˈhiːməˌɡɑːɡ/","extraExplanation":["词源：haema- / haem- 表示“血”（见于 haemoglobin=血红蛋白），-agogue 来自希腊语，含“引导、促使……发生”的意思（类似 demagogue 中的 -agogue）。","现代语境：如今更常用更具体的表述，如 “a medication that induces menstruation（诱发月经的药物）” 或 “a substance that promotes bleeding（促进出血的物质）”。该词在当代临床中基本不用。"]}
{"word":"haemal","summary":{"en":"Haemal means “related to blood,” mainly used in scientific contexts.","zh":"haemal 意为“与血液有关的”，主要用于科学/学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to blood (often used in biology and anatomy, especially in terms like “haemal/hemal system” in some animals).","zh":"与血液有关的；血的（常用于生物学/解剖学语境，尤其见于如“haemal/hemal system 血液系统”等表达）。"},"examples":[{"en":"In some invertebrates, nutrients are carried through a haemal system.","zh":"在一些无脊椎动物中，营养物质通过血液系统运输。"},{"en":"The paper describes haemal circulation in the species.","zh":"这篇论文描述了该物种的血液循环。"}]}],"synonyms":["hemal","blood-related","sanguineous"],"phonetic":"/ˈhiːməl/","extraExplanation":["“haemal”是英式拼写，对应美式更常见的“hemal”。同类拼写差异还有：haemoglobin（英）= hemoglobin（美）。","这个词在日常英语里很少用，更多出现在生物学、动物学或解剖学的学术写作中。"]}
{"word":"haemamoeba","summary":{"en":"An old scientific term for a blood parasite, especially the malaria organism (now called Plasmodium).","zh":"旧称：血液寄生虫，尤其指疟疾病原体（现多称 Plasmodium，疟原虫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology) A blood-dwelling amoeba-like protozoan; historically used as a name for the malaria parasite (now generally classified in the genus Plasmodium).","zh":"（生物）生活在血液中的类阿米巴原生生物；历史上曾用作疟原虫的名称（现一般归入疟原虫属 Plasmodium）。"},"examples":[{"en":"Early medical texts sometimes described the malaria organism as a haemamoeba living inside red blood cells.","zh":"早期医学文献有时把疟疾病原体描述为生活在红细胞内的 haemamoeba。"},{"en":"Under a microscope, doctors looked for haemamoeba-like forms in blood smears when malaria was suspected.","zh":"当怀疑疟疾时，医生会在血涂片显微镜下寻找类似 haemamoeba 的形态。"}]}],"synonyms":["Plasmodium","malaria parasite"],"phonetic":"/ˌhiːməˈmiːbə/","extraExplanation":["“Haemamoeba”属于较旧的科学用语，常见于19世纪到20世纪早期的医学与寄生虫学文献中。现代分类学通常用“Plasmodium（疟原虫属）”来指代引起疟疾的寄生虫。","词根提示：haema-/haemo- 表示“血”，amoeba 表示“阿米巴（变形虫）”，合起来字面意思接近“血中的阿米巴样生物”。"]}
{"word":"haemangioma","summary":{"en":"A haemangioma is a benign growth formed by extra blood vessels, often appearing as a red/purple skin mark in infants.","zh":"haemangioma（血管瘤）是由血管异常增生形成的良性肿块，婴儿皮肤上常见红/紫红色印记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a non-cancerous (benign) growth made of an abnormal cluster of blood vessels, often seen on the skin (especially in babies) as a red or purple mark; it can also occur inside the body","zh":"血管瘤：由异常增生的血管聚集形成的良性肿块，常见于皮肤（婴儿较多）呈红色或紫红色印记；也可能发生在体内"},"examples":[{"en":"The pediatrician said the red spot on the baby’s cheek is a haemangioma and will likely fade with time.","zh":"儿科医生说宝宝脸颊上的红点是血管瘤，可能会随着时间慢慢变淡。"},{"en":"Most haemangiomas are harmless, but a doctor should check any fast-growing lump.","zh":"大多数血管瘤是无害的，但任何快速增大的肿块都应让医生检查。"}]}],"synonyms":["hemangioma","birthmark (informal, not exact)","vascular tumor (medical)"],"phonetic":"/hiːˌmæn.dʒiˈoʊ.mə/","extraExplanation":["“haemangioma”是英式拼写；美式更常写作“hemangioma”。两者含义相同。","医学上常见的类型之一是“infantile haemangioma（婴幼儿血管瘤）”，多在出生后数周出现，先增大后逐渐自行消退；但若影响视力、呼吸、进食或出现溃破出血，应及时就医。"]}
{"word":"haemangiomas","summary":{"en":"Haemangiomas are benign blood-vessel growths, commonly seen as red/purple marks on infants’ skin.","zh":"Haemangiomas（血管瘤）是由血管增生造成的良性肿块，常见为婴儿皮肤上的红紫色印记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Benign growths made of extra blood vessels, often appearing on the skin (especially in babies) as a red or purple “strawberry” mark; many shrink over time.","zh":"（复数）血管瘤：由血管增生形成的良性肿块，常见于皮肤，婴儿身上常呈红紫色“草莓样”印记；很多会随时间自行缩小。"},"examples":[{"en":"Many infant haemangiomas fade or shrink as the child grows.","zh":"很多婴儿血管瘤会随着孩子长大而变淡或缩小。"},{"en":"The doctor monitored the haemangiomas to make sure they didn’t affect her vision.","zh":"医生会观察这些血管瘤，确保它们不会影响她的视力。"}]}],"synonyms":["hemangiomas","vascular birthmarks","blood-vessel tumors"],"phonetic":"/həˌmæn.dʒiˈoʊ.məz/","extraExplanation":["“haemangioma”是英式拼写；美式更常写作“hemangioma”。两者意思相同。","血管瘤通常是良性的，但如果长在眼周、口鼻附近或快速增大，可能影响功能，需要医疗评估。","常见类型包括婴幼儿血管瘤（infantile hemangioma）与先天性血管瘤（congenital hemangioma）；处理方式可能是观察、药物或少数情况下手术，由医生决定。"]}
{"word":"haemangiomata","summary":{"en":"“Haemangiomata” is the plural of “haemangioma,” meaning benign growths/birthmarks formed by extra blood vessels.","zh":"“haemangiomata”是“haemangioma（血管瘤）”的复数，指由血管异常增生形成的良性肿块或胎记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of haemangioma: benign (non-cancerous) tumors or birthmarks made of an abnormal buildup of blood vessels, often seen on the skin (especially in infants).","zh":"haemangioma（血管瘤）的复数：由血管异常增生形成的良性肿瘤或胎记，常见于皮肤（尤其是婴儿）。"},"examples":[{"en":"The dermatologist explained that most infantile haemangiomata shrink on their own over time.","zh":"皮肤科医生解释说，大多数婴儿血管瘤会随着时间自行缩小。"},{"en":"Imaging was used to check whether the haemangiomata affected deeper tissues.","zh":"医生使用影像检查以确认这些血管瘤是否影响到更深层的组织。"}]}],"synonyms":["hemangiomas","vascular birthmarks","(medical) hemangiomata"],"phonetic":"/hɪˌmæn.dʒiˈoʊ.mə.tə/","extraExplanation":["“haemangiomata”是较偏英式/医学文献的拼写与复数形式：haem-（血）+ angi-（血管）+ -oma（肿瘤）。在美式英语中更常见的是拼写“hemangioma”，复数通常写作“hemangiomas”。","这是医学用词，日常交流中可能会用更口语的说法，如“a benign blood vessel tumor/birthmark（良性的血管性肿块/胎记）”。"]}
{"word":"haemangiomatosis","summary":{"en":"Haemangiomatosis is a rare condition involving multiple hemangiomas (benign blood-vessel growths) in the body.","zh":"Haemangiomatosis（血管瘤病）是一种较罕见的疾病，表现为身体多处出现多发性血管瘤（血管性良性增生）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare medical condition in which many hemangiomas (benign growths made of blood vessels) develop in the skin, soft tissues, bones, or internal organs","zh":"（医学）血管瘤病：一种较罕见的疾病，特点是在皮肤、软组织、骨骼或内脏等部位出现多发性血管瘤（由血管组成的良性增生）"},"examples":[{"en":"The doctors diagnosed haemangiomatosis after imaging showed multiple vascular lesions.","zh":"影像检查显示多发血管性病灶后，医生诊断为血管瘤病。"},{"en":"In severe cases of haemangiomatosis, internal organs may be affected.","zh":"在严重的血管瘤病病例中，内脏器官也可能受累。"}]}],"synonyms":["hemangiomatosis","angiomatosis"],"phonetic":"/hiˌmændʒi.oʊˌmæt.oʊsɪs/","extraExplanation":["英式拼写为 haemangiomatosis，美式更常写作 hemangiomatosis；两者含义相同。","该词多用于医学语境，常见于影像学报告或病理描述；一般不用于日常口语。","与单个“hemangioma/血管瘤”不同，-matosis 常表示“多发/弥漫性”的状态，因此 haemangiomatosis 强调“多发性血管瘤”。"]}
{"word":"haemanthus","summary":{"en":"Haemanthus is a group of bulb plants (blood lilies) known for round clusters of vivid flowers.","zh":"Haemanthus 指血百合属：一类球根观赏植物，以球状花簇和鲜艳花色著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of bulb plants from southern Africa, often called the blood lily, grown for its round clusters of red (sometimes white) flowers.","zh":"一种原产于非洲南部的球根植物属，常称“血百合”，因其成团球状的红色（有时为白色）花而被栽培观赏。"},"examples":[{"en":"Haemanthus is sometimes grown as a houseplant because it can bloom indoors with enough light.","zh":"Haemanthus 有时会被当作室内植物栽培，因为光照足够时它也能在室内开花。"},{"en":"The blood lily (Haemanthus) produces a striking, brush-like flower head.","zh":"血百合（Haemanthus）会开出很醒目的、像刷子一样的花序。"}]}],"synonyms":["blood lily","paintbrush lily"],"phonetic":"/hiːˈmænθəs/","extraExplanation":["“Haemanthus”来自希腊语：haima（血）+ anthos（花），因此常见英文俗名是 blood lily（血百合）。","它是一个“属名”（genus name），写作时首字母大写并用斜体（Haemanthus）。常见种包括 Haemanthus albiflos（常见的白缘血百合，较耐室内环境）。"]}
{"word":"haemaphysalis","summary":{"en":"Haemaphysalis is a scientific genus name for certain hard ticks, some of which can transmit disease.","zh":"Haemaphysalis（血蜱属）是某些硬蜱的科学属名，其中一些可能传播疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of hard ticks (family Ixodidae), some species of which can bite humans and animals and may spread diseases.","zh":"血蜱属（硬蜱科）的一属蜱虫；其中一些物种会叮咬人和动物，并可能传播疾病。"},"examples":[{"en":"Researchers collected Haemaphysalis ticks from deer to test for pathogens.","zh":"研究人员从鹿身上采集血蜱属蜱虫，以检测病原体。"},{"en":"In some regions, Haemaphysalis species are monitored because they can carry disease.","zh":"在一些地区，由于血蜱属物种可能携带疾病，因此会对其进行监测。"}]}],"synonyms":["tick genus","hard tick (general category)"],"phonetic":"/ˌhiːməˈfɪzəlɪs/","extraExplanation":["这是一个拉丁化的科学属名，常见于医学、兽医学与生态学文献中；在日常英语里很少使用，通常会直接说 tick（蜱虫）。","与其相关的公共卫生概念包括“媒介（vector）”“病原体（pathogen）”和“蜱传疾病（tick-borne disease）”。如在户外活动后进行“蜱虫检查”并正确移除蜱虫，是常见的预防建议。"]}
{"word":"haemapophysis","summary":{"en":"A haemapophysis is a chevron-like bone/projection under tail vertebrae in some animals, protecting blood vessels and supporting muscles.","zh":"haemapophysis 指某些动物尾椎下方的人字形骨/骨突（血弓结构），主要用于保护血管并支撑肌肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bony projection or bone on the underside of a tail (caudal) vertebra in some animals (especially reptiles and many fossil vertebrates), helping protect blood vessels and support muscles; also called a chevron bone or part of the hemal arch","zh":"（尤指爬行动物及许多化石脊椎动物尾椎腹侧的）血弓突/血弓骨性突起；常用于保护血管并支撑肌肉，也常称“人字骨/chevron bone（血弓的一部分）”"},"examples":[{"en":"In many reptiles, a haemapophysis forms a chevron-shaped bone under the tail vertebrae.","zh":"在许多爬行动物中，haemapophysis 会在尾椎下方形成一个人字形的骨结构。"},{"en":"The fossil shows well-preserved haemapophyses, which helps identify the tail region.","zh":"这块化石保存了清晰的 haemapophyses，这有助于判断尾部的位置与结构。"}]}],"synonyms":["chevron bone","hemal arch","haemal arch"],"phonetic":"/ˌhiːməˈpɑːfəsɪs/","extraExplanation":["词源上，haema-（血）+ apophysis（骨的“突起/突突”）。因此它和“血（haemal）”相关，指位于尾椎腹侧、与血管（如尾部主要血管）相邻、起保护作用的骨结构。","该词多见于比较解剖学与古生物学文献；日常英语中更常用的说法是 chevron bone 或 hemal arch。"]}
{"word":"haemaspectroscope","summary":{"en":"A haemaspectroscope is a device for viewing and analyzing the spectrum of blood, especially hemoglobin.","zh":"haemaspectroscope 指用于观察与分析血液（尤其血红蛋白）光谱的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to examine the light spectrum of blood (especially hemoglobin) to help identify or analyze blood pigments","zh":"血液分光镜；用于观察血液（尤其是血红蛋白）光谱、以帮助识别或分析血液色素的仪器"},"examples":[{"en":"In the lab, the technician used a haemaspectroscope to compare the spectra of different blood samples.","zh":"在实验室里，技术员用血液分光镜来比较不同血样的光谱。"},{"en":"Early researchers studied hemoglobin with a haemaspectroscope to understand how blood carries oxygen.","zh":"早期研究者用血液分光镜研究血红蛋白，以了解血液如何携带氧气。"}]}],"synonyms":["blood spectroscope","hemoglobin spectroscope","spectroscope (general)"],"phonetic":"/ˌhiːməˈspɛk.troʊˌskoʊp/","extraExplanation":["这是一个较少见、偏历史与专业的术语，常见于早期生理学、法医学或医学检验相关的文献中。现代语境里更常直接说“spectroscope / spectrometer for blood”或具体到“hemoglobin spectroscope”。","词源上由 haema-（血）+ spectroscope（分光镜）构成；英式拼写有时写作 haemo-，美式科学写作更常见 hemo-。"]}
{"word":"haemat","summary":{"en":"Haemat- is a medical word part meaning “blood.”","zh":"haemat- 是表示“血液”的医学构词成分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (combining form) meaning “blood,” used to form medical and scientific terms","zh":"词根/构词成分，表示“血、血液”，常用于构成医学和科学词汇"},"examples":[{"en":"Hematology is the study of blood and blood diseases.","zh":"Hematology（血液学）是研究血液及血液疾病的学科。"},{"en":"A hematoma is a collection of blood under the skin.","zh":"A hematoma（血肿）是皮下聚集的一团血。"},{"en":"The doctor checked his hematocrit level in a blood test.","zh":"医生在血液检查中查看了他的 hematocrit（红细胞比容）水平。"}]}],"synonyms":["hemat-","hemo-","hem-","haem-"],"phonetic":"/hiːˈmæt/","extraExplanation":["“haemat-”多见于英式拼写（haem- / haemat-），而美式英语通常写作“hemat- / hem-”。例如：英式 haematology = 美式 hematology。","它来自希腊语 haima（意为“血”）。常见相关词：hemoglobin/haemoglobin（血红蛋白）、hemorrhage/haemorrhage（出血）。"]}
{"word":"haematal","summary":{"en":"Haematal is a rare technical adjective meaning “related to blood,” and in anatomy/zoology it can mean “toward the ventral (blood-side) part of the body.”","zh":"haematal 是较少见的技术性形容词，表示“与血液有关”；在解剖/动物学中也可指“朝向腹侧（血侧）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical, rare) Related to blood; of or involving the blood system.","zh":"（技术用语，较少见）与血液有关的；涉及血液系统的。"},"examples":[{"en":"The study focused on haematal factors that influence clotting.","zh":"这项研究聚焦于影响凝血的血液相关因素。"},{"en":"In some older texts, you may see “haematal” used where modern writing prefers “hemal.”","zh":"在一些较早的文献中，你可能会看到用“haematal”，而现代写作更常用“hemal”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Zoology) Situated on or toward the ventral side of the body (opposite of neural/dorsal), especially in vertebrates.","zh":"（解剖/动物学）位于或朝向身体腹侧（与神经侧/背侧相对），尤指脊椎动物。"},"examples":[{"en":"The haematal arch lies on the ventral side of the vertebra.","zh":"血弓位于椎骨的腹侧。"},{"en":"They compared neural and haematal structures to describe the specimen’s anatomy.","zh":"他们比较神经侧与血侧结构来描述标本的解剖特征。"}]}],"synonyms":["hemal","haemal","blood-related","ventral (in anatomy)"],"phonetic":"/hiˈmætəl/","extraExplanation":["“haematal”非常少见，多见于较早或较专业的解剖/动物学文献。现代英语里更常见的对应词是“hemal”（美式拼写）或“haemal”（英式拼写）。","词根“haem-/hemat-”来自希腊语 haima（血）。因此带有 haem-/hem- 的词常与血液相关，如 hematology/haematology（血液学）。"]}
{"word":"haematein","summary":{"en":"Haematein is a purple dye used mainly for staining biological tissues, especially cell nuclei.","zh":"Haematein 是一种紫色染料，主要用于生物组织染色，尤其常用于染细胞核。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark purple dye made by oxidizing hematoxylin, commonly used in biology and medicine to stain cell nuclei in microscope slides (as in hematoxylin–haematein stains).","zh":"一种深紫色染料，由苏木精（hematoxylin）氧化而成，常用于生物学与医学的显微染色，尤其用于染细胞核（如苏木精/苏木精氧化物相关染色）。"},"examples":[{"en":"The lab used haematein to stain the nuclei so they were easier to see under the microscope.","zh":"实验室用 haematein 给细胞核染色，这样在显微镜下更容易观察。"},{"en":"Haematein-based stains are common in histology for examining tissue samples.","zh":"在组织学中，基于 haematein 的染色法很常见，用于观察组织切片。"}]}],"synonyms":["hematein","(related) hematoxylin"],"phonetic":"/ˈhiːməˌteɪɪn/","extraExplanation":["“haematein”是英式拼写；美式常见拼写为“hematein”。它来自“hematoxylin（苏木精）”的氧化产物，历史上与“logwood（苏木）”染料传统有关。","在病理与组织学里，它与金属离子（如铝、铁）形成“媒染复合物（mordant complex）”后更容易牢固地结合到细胞核等结构上，因此常出现在经典的组织染色流程中。"]}
{"word":"haematemesis","summary":{"en":"Haematemesis means vomiting blood, usually from bleeding in the upper digestive tract.","zh":"haematemesis 指“呕血/吐血”，多与上消化道出血有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"vomiting blood (blood in the vomit), usually from bleeding in the upper digestive tract such as the stomach or esophagus","zh":"呕血；吐血（呕吐物中带血），通常来自上消化道（如食管或胃）的出血"},"examples":[{"en":"The doctor asked whether she had had any haematemesis or black stools.","zh":"医生询问她是否出现过呕血或黑便。"},{"en":"Haematemesis can be a sign of a bleeding ulcer and needs urgent medical attention.","zh":"呕血可能是消化性溃疡出血的信号，需要紧急就医。"}]}],"synonyms":["hematemesis","vomiting blood"],"phonetic":"/ˌhiːməˈtɛməsɪs/","extraExplanation":["英式拼写为 haematemesis，美式更常写作 hematemesis；两者读音和含义相同。","在医学语境里，它通常提示上消化道出血；与 hemoptysis（咯血，来自呼吸道）不同：haematemesis 是“吐出来”的血，常伴恶心、呕吐。","属于偏专业的医学词汇，日常英语里更常说 “vomiting blood”。"]}
{"word":"haematherm","summary":{"en":"A rare zoology term meaning a warm-blooded animal that maintains a fairly constant body temperature.","zh":"一个少见的动物学词，指能维持相对恒定体温的温血/恒温动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warm-blooded animal (one that keeps its blood/body temperature relatively constant, usually by producing internal heat)","zh":"恒温动物；温血动物（通常依靠体内产热，使血液/体温相对稳定的动物）"},"examples":[{"en":"Most mammals are haematherms because they can maintain a steady body temperature.","zh":"大多数哺乳动物是恒温动物，因为它们能维持相对稳定的体温。"},{"en":"Birds are also haematherms, so they stay active in cold weather.","zh":"鸟类也属于恒温动物，所以在寒冷天气里仍然能保持活跃。"}]}],"synonyms":["endotherm","homeotherm","warm-blooded animal"],"phonetic":"/ˈhiːməˌθɝːm/","extraExplanation":["这个词非常少见，更常见的说法是 endotherm（内温动物）或 homeotherm（恒温动物）。","词源可拆成 haema-（血）+ therm（热），字面意思接近“血液保持热/有热量”。在现代教材与科普文章里一般不用它。","容易与 poikilotherm（变温动物，如多数鱼类、两栖类和爬行类）形成对比。"]}
{"word":"haemathermal","summary":{"en":"“Haemathermal” is a rare scientific adjective meaning “warm-blooded; able to keep a stable body temperature.”","zh":"“haemathermal”是一个罕见的科技术语形容词，意思是“温血/恒温的（能维持较稳定体温）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, scientific) Having warm blood; warm-blooded (maintaining a relatively constant internal body temperature).","zh":"（罕见，科技术语）血液温热的；温血的；（能维持较恒定体温的）恒温的。"},"examples":[{"en":"Humans and most birds are haemathermal animals, keeping their core temperature steady.","zh":"人类和大多数鸟类都是 haemathermal（温血/恒温）动物，能保持核心体温稳定。"},{"en":"In older biology texts, “haemathermal” may appear where modern writers prefer “endothermic” or “homeothermic.”","zh":"在较早的生物学书籍里，可能会用“haemathermal”，而现代作者更常用“endothermic（内温）”或“homeothermic（恒温）”。"}]}],"synonyms":["warm-blooded","endothermic","homeothermic"],"phonetic":"/ˌhiːməˈθɝːməl/","extraExplanation":["这个词非常少见，多见于旧式或专业文献。构词上可理解为 haema-/haemo-（血）+ thermal（热的），字面意思接近“血是热的”，所以用来表达“温血/恒温”。现代生物学更常用 endothermic（通过代谢产热）与 homeothermic（体温相对恒定）来更精确地区分概念。"]}
{"word":"haemathermous","summary":{"en":"Haemathermous means “warm-blooded,” a rare biology term.","zh":"haemathermous 指“温血的”，是一个较罕见的生物学用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, biology) Warm-blooded; having blood that stays relatively warm and a body temperature that is mostly constant.","zh":"（罕用，生物学）温血的；血液温度相对较高、体温大致恒定的。"},"examples":[{"en":"Humans are haemathermous animals, so our body temperature stays near 37°C in normal conditions.","zh":"人类是温血动物，因此在正常情况下体温通常维持在约 37°C 左右。"},{"en":"Most birds are haemathermous and can stay active even in cold weather.","zh":"大多数鸟类都是温血动物，即使在寒冷天气里也能保持活动。"}]}],"synonyms":["warm-blooded","endothermic","homeothermic"],"phonetic":"/ˌhiːməˈθɝːməs/","extraExplanation":["这个词非常少见，在现代英语里更常用的是 endothermic（内温的/恒温的，强调“靠自身代谢产热”）和 warm-blooded（温血的，日常用法），以及 homeothermic/homeothermous（恒温的，强调“体温稳定”）。","词源可拆为 haema-/haemo-（血）+ therm-（热）+ -ous（形容词后缀），字面意思接近“血热的/血温较高的”。","拼写注意：英式拼写常见 haem-，美式对应常见 hemo-；但无论哪种，这个词本身都偏学术且罕见。"]}
{"word":"haematic","summary":{"en":"Haematic means “related to blood,” mainly used in medical contexts (more common in British English).","zh":"Haematic 意为“与血液有关的”，主要用于医学语境（英式拼写更常见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) related to blood; involving the blood.","zh":"（医学）与血液有关的；涉及血液的。"},"examples":[{"en":"The doctor ordered a haematic test to check for anemia.","zh":"医生安排了一个血液相关的检测来检查是否贫血。"},{"en":"Some medicines can cause haematic side effects, such as changes in blood cells.","zh":"有些药物可能引起血液方面的副作用，比如血细胞变化。"}]}],"synonyms":["hemat(ic)","hematological","blood-related"],"phonetic":"/hiˈmætɪk/","extraExplanation":["“haematic”是英式拼写（BrE），美式英语中更常见的是“hemat(ic)”或直接用“blood/blood-related”。例如：hematologic/hematological（血液学的）。","词根来自希腊语 haima（血），常见相关词：hematology（血液学）、hematoma（血肿）。","在日常英语里，这个词偏医学文献/报告用语；口语通常说 blood test、blood disorder、blood-related effects。"]}
{"word":"haematics","summary":{"en":"Haematics usually refers to medicines/substances that improve or affect the blood; less commonly, it can mean the study of blood (hematology).","zh":"Haematics通常指改善或影响血液的药物/物质；较少情况下也可指血液学（hematology）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine, often in the plural) Medicines or substances that affect the blood, especially those used to improve blood quality (for example, by treating anemia).","zh":"（医学，常用复数）影响血液的药物或物质，尤指用于改善血液状况的药物（如治疗贫血）。"},"examples":[{"en":"The doctor prescribed haematics to help correct her iron-deficiency anemia.","zh":"医生开了改善血液状况的药物来纠正她的缺铁性贫血。"},{"en":"In older medical texts, haematics were grouped with tonics and nutritional supplements.","zh":"在较早的医学文献中，改善血液的药物常与补药和营养补充剂归为一类。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) The study of blood; hematology.","zh":"（较少见）血液学；研究血液的学科。"},"examples":[{"en":"He specialized in haematics during his medical training.","zh":"他在医学培训期间专攻血液学。"}]}],"synonyms":["hematics","hematology","hematinics"],"phonetic":"/hiˈmætɪks/","extraExplanation":["“haematics”是英式拼写（美式常写作“hematics”），但在现代英语中更常见的是“hematology”（血液学）和“hematinics”（补血药、造血/改善血液的药物，尤其指补铁等）。","在当代医学语境里，如果你想表达“血液学”，建议优先用“hematology”；如果想表达“补血类药物”，更常用“hematinics”。"]}
{"word":"haematid","summary":{"en":"“Haematid” is a rare term meaning a red blood cell (erythrocyte).","zh":"“haematid”是较少见的词，意思是红细胞（erythrocyte）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a red blood cell; an erythrocyte (a cell in the blood that carries oxygen).","zh":"红细胞；红血球（血液中负责携带氧气的细胞）。"},"examples":[{"en":"Under a microscope, a haematid looks like a small, round disc.","zh":"在显微镜下，红细胞看起来像一个小小的圆盘。"},{"en":"The lab report noted that the patient’s haematids were lower than normal.","zh":"化验报告指出患者的红细胞数量低于正常值。"}]}],"synonyms":["red blood cell","RBC","erythrocyte"],"phonetic":"/hɪˈmætɪd/","extraExplanation":["“haematid”是较少见的医学/生物学用词，更常见的说法是“red blood cell (RBC)”或“erythrocyte”。","拼写上“haemat-”多见于英式传统拼写（对应美式常写作“hemat-”）。词根来自希腊语 haima（血）+ 后缀 -id（表示某类事物/个体）。"]}
{"word":"haematin","summary":{"en":"Hematin (haematin) is an oxidized form of heme, a dark iron-containing pigment associated with blood breakdown and lab/medical use.","zh":"Haematin（美式作hematin）是血红素（heme）的氧化形式，一种深色含铁色素，常与血液分解及实验/医学用途相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, iron-containing pigment formed when heme (from hemoglobin) is oxidized; found in old blood and used in laboratory and medical contexts.","zh":"（生化）血红素被氧化后形成的深色含铁色素；可见于陈旧血液中，也常用于实验室与医学相关语境。"},"examples":[{"en":"In the lab, the sample turned brown as heme was converted to hematin.","zh":"在实验室里，随着血红素转化为血红素氧化物（haematin），样本变成了棕色。"},{"en":"Researchers measured hematin levels to study how blood breaks down over time.","zh":"研究人员测量haematin的水平，以研究血液随时间分解的过程。"}]}],"synonyms":["hematin","oxidized heme"],"phonetic":"/ˈhiːmətɪn/","extraExplanation":["“haematin”是英式拼写；美式拼写更常见的是“hematin”。两者指同一种物质。","它与“hemin”相关但不完全相同：两者都来自“heme（血红素）”，但化学形式与生成条件不同，在专业文章里不要混用。"]}
{"word":"haematinic","summary":{"en":"Haematinic (also spelled hematinic) refers to a blood-building substance—often an iron supplement—used to help form hemoglobin and red blood cells.","zh":"Haematinic（美式常拼作 hematinic）指“补血/促红细胞生成”的物质，常为铁剂，用于帮助生成血红蛋白和红细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often an iron supplement) that helps the body make hemoglobin and red blood cells, used to treat or prevent anemia","zh":"补血剂；促红细胞生成剂（常指铁剂等，帮助身体生成血红蛋白和红细胞，用于治疗或预防贫血）"},"examples":[{"en":"The doctor prescribed an oral haematinic to treat her iron-deficiency anemia.","zh":"医生开了口服补血剂来治疗她的缺铁性贫血。"},{"en":"Foods rich in iron can act as natural haematinics.","zh":"富含铁的食物可以起到天然补血的作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a substance or treatment that promotes the formation of blood (especially red blood cells)","zh":"补血的；促红细胞生成的（指能促进造血，尤其是红细胞生成的物质或治疗）"},"examples":[{"en":"Iron tablets have a haematinic effect when iron levels are low.","zh":"当体内铁水平偏低时，铁片具有补血作用。"},{"en":"She was advised to follow a haematinic diet including leafy greens and legumes.","zh":"她被建议采用补血饮食，包括绿叶蔬菜和豆类。"}]}],"synonyms":["hematinic","iron supplement","blood builder"],"phonetic":"/ˌhiːməˈtɪnɪk/","extraExplanation":["词形与拼写：haematinic 是英式拼写；美式更常写作 hematinic。","词源提示：haemato- 来自希腊语，意为“血”；-inic 表示“具有……性质/作用的”。","常见语境：临床上多与缺铁性贫血相关，常见“haematinic therapy（补血治疗）”“haematinic agents（补血药物）”。"]}
{"word":"haematinon","summary":{"en":"“Haematinon” is a rare/nonstandard word usually referring to hematin, an oxidized heme pigment related to hemoglobin.","zh":"“haematinon”是一个罕见/非标准词，通常用来指 hematin（与血红蛋白相关的、血红素的氧化色素）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare or nonstandard term referring to a blood-related pigment, used as a variant name for hematin (an oxidized form of heme, the iron-containing part of hemoglobin).","zh":"一个罕见或非标准用词，指与血液有关的色素，常被当作 hematin（血红素 heme 的氧化形式，含铁、与血红蛋白有关）的变体名称。"},"examples":[{"en":"In older laboratory notes, “haematinon” may appear as a name for hematin formed from hemoglobin.","zh":"在较早的实验记录里，“haematinon”有时会被用来指由血红蛋白形成的 hematin。"},{"en":"The report likely meant hematin rather than a separate substance called “haematinon.”","zh":"这份报告很可能指的是 hematin，而不是一种名为“haematinon”的独立物质。"}]}],"synonyms":["hematin","haematin"],"phonetic":"/hiːˈmætɪnɑːn/","extraExplanation":["“haematinon”在现代英语与现代生物化学/医学文献中几乎不使用，很多情况下属于拼写变体、旧译名或误拼。更常见的标准写法是 **hematin/haematin**（美式/英式）。","如果你是在某篇论文、老教材或化验单中看到这个词，建议你提供上下文句子或来源领域（如病理、血液学、化学），我可以帮你判断它具体对应的是不是 **hematin**，或是否其实想表达 **hematin(e)**、**hematinic** 等相关词。"]}
{"word":"haematins","summary":{"en":"Haematins are iron-containing pigments formed from oxidized heme (plural of haematin).","zh":"haematins 是由氧化的血红素形成的含铁色素（haematin 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Haematins (plural of haematin) are dark, iron-containing pigments formed from heme (the non-protein part of hemoglobin) when it is oxidized; they are used in biology/medicine to describe certain breakdown or reaction products of blood pigments.","zh":"haematins（haematin 的复数）指由血红素（heme，血红蛋白的非蛋白部分）被氧化后形成的深色含铁色素；在生物学/医学中用于描述某些血液色素的分解或反应产物。"},"examples":[{"en":"In the lab report, the sample was described as containing haematins derived from oxidized heme.","zh":"在实验报告中，该样本被描述为含有来自氧化血红素的 haematins。"},{"en":"Researchers tracked how hemoglobin breaks down into different pigments, including haematins.","zh":"研究人员追踪了血红蛋白如何分解成不同色素，包括 haematins。"}]}],"synonyms":["hematins","heme pigments","blood pigments"],"phonetic":"/ˈhiːməˌtɪnz/","extraExplanation":["“haematin”是英式拼写；美式更常写作“hematin”。你输入的“haematins”是其复数形式，通常出现在学术论文、实验记录或医学/生化语境中。"]}
{"word":"haematinum","summary":{"en":"Haematinum is a rare, Latin-style term referring to haematin (a blood pigment derived from hemoglobin), and it may also appear as a homeopathic remedy name.","zh":"Haematinum 是较少见的拉丁式用词，通常指 haematin（由血红蛋白形成的血色素相关色素）；也可能作为顺势疗法中的药名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scientific/Latinized term) hematin/haematin: an iron-containing dark pigment formed from hemoglobin (a blood pigment), used in some older scientific writing.","zh":"（科学/拉丁化用语）haematin/hematin：由血红蛋白转化形成的一种含铁深色血色素（血液色素），多见于较早的科学文献。"},"examples":[{"en":"In older texts, “haematinum” may appear as a Latin-style name for haematin.","zh":"在较旧的文献中，“haematinum”可能作为 haemat(in) 的拉丁式名称出现。"},{"en":"The report mentioned haematin (sometimes written as haematinum) derived from hemoglobin.","zh":"报告提到由血红蛋白生成的 haematin（有时也写作 haematinum）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Homeopathy) a remedy name based on “haematin,” referring to a preparation historically associated with blood pigment.","zh":"（顺势疗法）以“haematin（血色素相关物质）”命名的一种制剂/药名，历史上与血液色素概念相关。"},"examples":[{"en":"Some homeopathic lists include Haematinum as a remedy name.","zh":"一些顺势疗法的目录中会收录 Haematinum 作为药名。"},{"en":"Always consult a qualified medical professional rather than self-treating with products labeled “Haematinum.”","zh":"不要仅凭“Haematinum”标签自行用药，应咨询合格的医疗专业人士。"}]}],"synonyms":["haematin","hematin"],"phonetic":"/hiːˈmætɪnəm/","extraExplanation":["这个词在现代英语里非常少见，更常见的写法是 haematin（英式拼写，含 haem-）或 hematin（美式拼写，含 hem-）。haematinum 往往带有“拉丁化命名/旧文献用词”的感觉，常出现在历史文献、旧式化学/医学材料或某些替代疗法的条目中。"]}
{"word":"haematite","summary":{"en":"Haematite is a common iron-oxide mineral, often reddish-brown to black, widely used as an iron ore and sometimes as a gemstone or pigment.","zh":"Haematite（赤铁矿）是一种常见的氧化铁矿物，常呈红褐色到黑色，是重要铁矿石来源，也可用于宝石或颜料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common iron oxide mineral (Fe₂O₃), usually reddish-brown to black, often used as an ore of iron and sometimes as a gemstone or pigment.","zh":"一种常见的氧化铁矿物（Fe₂O₃），颜色常为红褐色到黑色，是重要的铁矿石来源，也可用作宝石或颜料。"},"examples":[{"en":"Haematite is an important ore because it contains a high percentage of iron.","zh":"赤铁矿很重要，因为它含有较高比例的铁。"},{"en":"The rock looked dark, but it left a red-brown streak—typical of haematite.","zh":"这块岩石看起来很深色，但它留下红褐色的条痕——这正是赤铁矿的典型特征。"},{"en":"Some jewelry uses polished haematite beads that shine like metal.","zh":"有些首饰会用抛光的赤铁矿珠子，看起来像金属一样发亮。"}]}],"synonyms":["hematite","iron oxide"],"phonetic":"/ˈhiːməˌtaɪt/","extraExplanation":["“Haematite”是英式拼写；美式更常写作“hematite”。两者指同一种矿物。","词源来自希腊语，和“blood（血）”有关，因为赤铁矿研磨成粉或留下条痕时常呈血红色/红褐色。","在地质学里，人们常用“streak test（条痕测试）”来辨认它：外观可能是黑色或银灰色，但在未上釉瓷板上划过会出现红褐色条痕。"]}
{"word":"haematitic","summary":{"en":"“Haematitic” means related to or containing hematite, often describing a reddish-brown iron-oxide color in rocks or soil.","zh":"“haematitic”意为“与赤铁矿有关的/含赤铁矿的”，常用来描述岩石或土壤中由铁氧化物造成的红褐色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or containing hematite (a common iron oxide mineral), often reddish-brown in color.","zh":"与赤铁矿有关的；含赤铁矿的（赤铁矿是一种常见的氧化铁矿物），常呈红褐色。"},"examples":[{"en":"The rock shows haematitic staining along its fractures.","zh":"岩石的裂隙处可见赤铁矿染色（红褐色斑痕）。"},{"en":"Haematitic sandstone often appears red because of iron oxide minerals.","zh":"含赤铁矿的砂岩常因氧化铁矿物而呈红色。"}]}],"synonyms":["hematitic","iron-rich","ferruginous"],"phonetic":"/ˌhiːməˈtɪtɪk/","extraExplanation":["“haematitic”是英式拼写；美式更常写作“hematitic”。两者意义相同。","赤铁矿（hematite）常见于沉积岩、变质岩与铁矿床中；地质描述里说“haematitic staining/haematitic coloration”通常指表面被铁氧化物染成红褐色，并不一定表示整块岩石都是赤铁矿。"]}
{"word":"haemato","summary":{"en":"“haemato-” is a medical prefix meaning “blood.”","zh":"“haemato-”是表示“血液”的医学前缀。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a medical word part (combining form/prefix) meaning “blood,” used to form terms related to blood and blood diseases","zh":"（医学构词成分/前缀）表示“血、血液”，用于构成与血液及血液疾病有关的术语"},"examples":[{"en":"Haematology is the study of blood and blood diseases.","zh":"Haematology（血液学）是研究血液及血液疾病的学科。"},{"en":"The doctor suspected a haematoma after the injury.","zh":"医生在受伤后怀疑出现了 haematoma（血肿）。"},{"en":"This test checks haematocrit, the percentage of red blood cells in blood.","zh":"这项检查测量 haematocrit（红细胞压积），即红细胞在血液中所占的比例。"}]}],"synonyms":["hemato-"],"phonetic":"/ˌhiː.mə.toʊ-/","extraExplanation":["“haemato-”常见于英式拼写；美式更常写作“hemato-”。两者意义相同，都来自希腊语 haima（血）。","它通常不单独作为一个完整单词使用，而是和其他词根/后缀组合：haemato- + -logy（学科）→ haematology（血液学）；haemato- + -crit（分离/判断）→ haematocrit（红细胞压积）。"]}
{"word":"haematoblast","summary":{"en":"A haematoblast is an early, immature blood-forming cell (an old/rare medical term).","zh":"haematoblast 指早期未成熟的造血细胞（较旧/少见的医学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early, immature blood-forming cell; a primitive cell in bone marrow (or embryonic tissue) that develops into blood cells.","zh":"（早期）造血细胞；未成熟的原始细胞，可在骨髓（或胚胎组织）中分化为各种血细胞。"},"examples":[{"en":"In older medical texts, a haematoblast is described as a precursor to red and white blood cells.","zh":"在较早的医学文献中，haematoblast 常被描述为红细胞和白细胞的前体。"},{"en":"Researchers once debated whether the haematoblast was a single stem cell type or several different precursors.","zh":"研究者曾争论 haematoblast 究竟是单一的干细胞类型，还是多种不同的前体细胞。"}]}],"synonyms":["hematoblast","hemoblast","blood-forming cell","hematopoietic stem cell (modern term)"],"phonetic":"/hiːˈmætəˌblæst/","extraExplanation":["这是一个偏旧式或少见的医学/组织学术语。现代生物医学更常用 hematopoietic stem cell（造血干细胞）、hematoblast/hemoblast（较少见）或具体的 progenitor cell（祖细胞）来表达更精确的阶段。","拼写 haematoblast 属于英式传统拼写（haema-），美式更常见 hema-（hematoblast）。两者词源都来自希腊语 haima（血）+ blastos（芽、胚芽；引申为“未成熟的细胞”）。"]}
{"word":"haematobranchia","summary":{"en":"Haematobranchia is an older zoological term referring to gastropods described as having blood-rich gills.","zh":"Haematobranchia 是动物学中的旧术语，指被描述为具有血液供应丰富鳃部的腹足类类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical zoological term for certain marine gastropod mollusks described as having “blood gills” (gills richly supplied with blood); used mainly in older scientific classification.","zh":"（动物学旧术语）指一类被描述为具有“血鳃”（血液供应丰富的鳃）的海洋腹足类软体动物；主要见于较早的科学分类文献。"},"examples":[{"en":"In some older texts, Haematobranchia is listed as a group within sea slugs.","zh":"在一些较早的文献中，Haematobranchia 被列为海蛞蝓中的一个类群。"},{"en":"The term Haematobranchia is rarely used in modern taxonomy.","zh":"Haematobranchia 这个术语在现代分类学中很少使用。"}]}],"synonyms":["Hematobranchia","hematobranchs"],"phonetic":"/hiˌmætəˈbræŋkiə/","extraExplanation":["词源上可拆为 haemat-/hemat-（血）+ branchia（鳃），字面意思接近“血鳃”。英式拼写常见 haemat-，美式对应写法常见 hemato-。","这是偏历史性的分类名称：在当代生物分类中，你更常看到更新的类群名称；因此它多出现在旧论文、老式动物学书或博物学文献里。"]}
{"word":"haematobranchiate","summary":{"en":"A rare zoological adjective meaning “having blood-supplied (vascular) gills.”","zh":"一个罕见的动物学形容词，指“具有血液供给、血管丰富的鳃（血鳃）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having gills that are supplied with blood (i.e., “blood gills”), used to describe certain aquatic animals whose gills are richly vascularized.","zh":"（动物学）具“血鳃”的；鳃部血管丰富、由血液供给的（用于描述某些水生动物的鳃结构）。"},"examples":[{"en":"Some textbooks describe certain marine worms as haematobranchiate because their gills are full of blood vessels.","zh":"一些教材把某些海洋蠕虫描述为 haematobranchiate，因为它们的鳃部布满血管。"},{"en":"The specimen was noted as haematobranchiate, with reddish gill structures visible under the microscope.","zh":"该标本被记录为 haematobranchiate，在显微镜下可见带红色的鳃状结构。"}]}],"synonyms":["blood-gilled","vascular-gilled","haemobranchiate"],"phonetic":"/hiˌmætəˈbræŋkiˌeɪt/","extraExplanation":["这是一个非常罕见的专业词，多见于动物学/解剖学旧文献或分类描述中。词根可拆为 haemato-（血）+ branchi-（鳃，来自希腊语）+ -ate（形容词后缀），字面意思就是“与血鳃有关的/具有血鳃的”。","现代写作中更常见的表达通常会直接说 “blood gills” 或 “vascularized gills（血管化的鳃）”。"]}
{"word":"haematocele","summary":{"en":"Haematocele means a pocket/collection of blood in a cavity, especially blood around a testicle in the scrotum.","zh":"Haematocele 指体腔/囊腔内的积血，尤指阴囊内睾丸周围的积血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a collection of blood in a body cavity or sac, especially blood trapped in the scrotum around a testicle (often after injury or surgery).","zh":"体腔或囊腔内的积血；尤指阴囊内、睾丸周围的积血（常见于外伤或手术后）。"},"examples":[{"en":"After the sports injury, the doctor suspected a haematocele and ordered an ultrasound.","zh":"运动受伤后，医生怀疑有阴囊积血（haematocele），并安排了超声检查。"},{"en":"Pain and swelling may occur if a haematocele forms around the testicle.","zh":"如果睾丸周围形成阴囊积血，可能会出现疼痛和肿胀。"}]}],"synonyms":["hematocele","scrotal hematoma (related)","hematoma (general)"],"phonetic":"/hiːˈmætəˌsiːl/","extraExplanation":["词源：haemato- 表示“血”（英式拼写；美式常写作 hemato-），-cele 来自希腊语，意为“肿胀/囊状膨出”。合起来就是“由血造成的囊状肿胀/积血”。","临床语境中它更常指“阴囊内积血（睾丸周围）”。通常与外伤、手术、或出血性疾病有关；诊断常借助超声来区分积血与积液（如 hydrocele，鞘膜积液）。"]}
{"word":"haematocrit","summary":{"en":"Haematocrit is the proportion of your blood that is made up of red blood cells.","zh":"Haematocrit（血细胞比容）指血液中红细胞所占的比例。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the percentage (or fraction) of blood volume made up of red blood cells; used in blood tests to assess hydration, anemia, or polycythemia","zh":"（血细胞比容）血液中红细胞所占的体积百分比（或比例）；用于血液检查，评估脱水、贫血或红细胞增多等情况"},"examples":[{"en":"My haematocrit was low, so the doctor checked for anemia.","zh":"我的血细胞比容偏低，所以医生进一步检查是否贫血。"},{"en":"Dehydration can make the haematocrit level appear higher than normal.","zh":"脱水会让血细胞比容看起来比正常值更高。"},{"en":"The lab report lists haematocrit (Hct) along with hemoglobin.","zh":"化验单上把血细胞比容（Hct）和血红蛋白一起列出。"}]}],"synonyms":["hematocrit","Hct","packed cell volume (PCV)"],"phonetic":"/hiˈmætəˌkrɪt/","extraExplanation":["“haematocrit”是英式拼写；美式更常写作“hematocrit”。临床上常简写为“Hct”，也叫“packed cell volume (PCV)”。","它通常来自全血细胞计数（CBC）的一部分：数值偏低常见于贫血或出血后；偏高可能与脱水、吸烟、高海拔适应或红细胞增多症有关。具体正常范围会因实验室、性别与年龄而略有差异，应以检验单参考区间为准。"]}
{"word":"haematocrya","summary":{"en":"Haematocrya means “bloody tears” (shedding tears mixed with blood), a rare medical term.","zh":"Haematocrya 指“血泪/流血泪”（眼泪混有血），是较罕见的医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, medical) The shedding of bloody tears; tears mixed with blood.","zh":"（罕见/医学）流血泪；眼泪中带血。"},"examples":[{"en":"The case report described a patient with haematocrya after a facial injury.","zh":"这份病例报告描述了一名患者在面部受伤后出现了“haematocrya”（血泪）。"},{"en":"Doctors first ruled out infection and trauma before labeling the symptom as haematocrya.","zh":"医生先排除了感染和外伤，才将这种症状称为“haematocrya”（血泪）。"}]}],"synonyms":["hemolacria","bloody tears","haemolacria"],"phonetic":"/hiːˌmætəˈkraɪə/","extraExplanation":["“Haematocrya”多见于较旧或较少使用的医学英语中，更常见的医学术语是“hemolacria”（也写作 haemolacria / hematolacria），日常表达常说“bloody tears”。","词源可拆解理解：haemato-（血）+ -cry(a)（与“哭/泪”相关，源自希腊语）。","在医学语境中，它通常被当作一种“症状”而非独立疾病；可能与外伤、炎症、血管问题、凝血异常等相关，需由专业医生评估。"]}
{"word":"haematocryal","summary":{"en":"Haematocryal means “related to sweating blood,” an extremely rare medical condition.","zh":"haematocryal 指“与血汗（出汗带血）有关的”，属于极罕见的医学用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the sweating or oozing of blood (a very rare medical phenomenon).","zh":"与“出血性出汗/汗中带血”（极罕见的医学现象）有关的；血汗的。"},"examples":[{"en":"The case report mentioned haematocryal episodes during periods of extreme stress.","zh":"该病例报告提到患者在极度压力时期出现过血汗（haematocryal）发作。"},{"en":"Because haematocryal symptoms are so uncommon, doctors usually rule out other causes first.","zh":"由于血汗（haematocryal）症状非常罕见，医生通常会先排除其他原因。"}]}],"synonyms":["hematocryal","blood-sweating (informal)"],"phonetic":"/hiˌmætəˈkraɪəl/","extraExplanation":["“haematocryal”非常少见，多见于医学写作中，来源可追溯到希腊语词根：haemat-（血）+ -cry-（分泌/流出）之类的构词传统，用来对应名词“haematocrya/hematocrya”（血汗现象）。日常英语中几乎不会用到。","拼写上“haemat-”是英式/医学拉丁化拼法（相当于美式常见的“hemat-”）。你在文献里也可能看到“hematocryal”。"]}
{"word":"haematocyst","summary":{"en":"A medical term meaning a blood-filled cyst.","zh":"医学用词：指内含血液的囊肿（血囊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cyst or sac filled with blood (a blood-filled cyst), often described in medical contexts.","zh":"（医学）血囊；血性囊肿（内含血液的囊或囊肿）。"},"examples":[{"en":"The surgeon noted a small haematocyst near the site of the previous injury.","zh":"外科医生注意到在先前受伤的部位附近有一个小的血囊。"},{"en":"Imaging suggested a blood-filled cyst, consistent with a haematocyst.","zh":"影像检查提示为血性囊肿，符合血囊的表现。"}]}],"synonyms":["hematocyst","blood-filled cyst","blood cyst"],"phonetic":"/hiːˈmætəˌsɪst/","extraExplanation":["“haematocyst”是英式拼写；美式更常见写法是“hematocyst”。","这是相对少见、偏医学文献用词；日常临床中有时会用更常见的相关词来描述（如根据具体情况说“blood-filled cyst”“hematoma（血肿）”等），但两者并不总是完全等同。"]}
{"word":"haematocystis","summary":{"en":"Haematocystis means a blood-filled cyst (a rare medical term).","zh":"Haematocystis 指“充血的囊肿/血囊肿”，属于较少见的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cyst or swelling filled with blood; a blood cyst (a rare medical term).","zh":"充满血液的囊肿或肿胀；血囊肿（较少见的医学用语）。"},"examples":[{"en":"The surgeon described the lesion as a haematocystis, meaning it was filled with blood.","zh":"外科医生将该病灶描述为 haematocystis，意思是里面充满了血液。"},{"en":"Imaging was used to distinguish haematocystis from other fluid-filled cysts.","zh":"医生用影像检查来区分 haematocystis 和其他含液体的囊肿。"}]}],"synonyms":["blood cyst","hematocystis"],"phonetic":"/hiːˌmæt.oʊˈsɪs.tɪs/","extraExplanation":["这个词较罕见，多见于较旧或专业的医学文献。词根可拆解理解：haemato-（血）+ cystis（囊/囊肿）。","拼写上 haemat- 常见于英式拼写（对应美式 hemat-）；在检索资料时也可尝试搜索 hematocystis。"]}
{"word":"haematocyte","summary":{"en":"A scientific term for a blood cell (British spelling: haematocyte; American spelling: hematocyte).","zh":"表示“血细胞”的科学用语（英式拼写 haematocyte；美式拼写 hematocyte）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blood cell; especially a cell found in the blood or blood-like fluid of an animal.","zh":"血细胞；（尤指）存在于动物血液或类似血液体液中的细胞。"},"examples":[{"en":"Under the microscope, the researcher counted the haematocytes in the sample.","zh":"在显微镜下，研究人员统计了样本中的血细胞数量。"},{"en":"Some insects use haematocytes to help fight infection.","zh":"一些昆虫会利用血细胞来帮助抵抗感染。"}]}],"synonyms":["blood cell","hematocyte","haemocyte"],"phonetic":"/hiːˈmætəˌsaɪt/","extraExplanation":["“haematocyte”常见于英式拼写与较专业的生物学/动物学语境；美式更常写作“hematocyte”。词根来自希腊语：haima（血）+ kytos（细胞）。","在昆虫学与无脊椎动物研究中，“haematocytes”也常泛指体液（血淋巴 hemolymph）中的免疫相关细胞；在人类医学里更常直接说“blood cell”，并按类型称“red blood cell / white blood cell / platelet”。"]}
{"word":"haematogenesis","summary":{"en":"Haematogenesis means the production of blood cells (blood formation), mainly in the bone marrow.","zh":"haematogenesis 指“造血/血细胞生成”，主要在骨髓中进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of forming blood cells (blood cell production), especially in the bone marrow; also called blood formation","zh":"造血；血细胞生成（血液细胞的产生过程），多指在骨髓中进行"},"examples":[{"en":"In adults, most haematogenesis occurs in the bone marrow.","zh":"在成年人中，大多数造血过程发生在骨髓里。"},{"en":"Chemotherapy can suppress haematogenesis and lead to anemia.","zh":"化疗可能抑制造血功能并导致贫血。"}]}],"synonyms":["hematopoiesis","hematogenesis","blood cell formation"],"phonetic":"/hiˌmætoʊˈdʒɛnəsɪs/","extraExplanation":["“haematogenesis”是英式拼写；美式更常见对应词为“hematopoiesis/hematogenesis”。词根：haemato-（血）+ genesis（起源、产生）。在医学语境中常与“bone marrow（骨髓）”“stem cells（干细胞）”“anemia（贫血）”等一起出现。"]}
{"word":"haematogenous","summary":{"en":"Haematogenous means “spread or carried through the bloodstream.”","zh":"haematogenous 指“经血液传播/由血行带来的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) carried or spread through the bloodstream.","zh":"（医学）经血液携带或通过血液传播的。"},"examples":[{"en":"The infection was haematogenous, spreading from the lungs to other organs through the blood.","zh":"这次感染是经血行传播的，从肺部通过血液扩散到其他器官。"},{"en":"Doctors suspected haematogenous spread of bacteria after the blood culture came back positive.","zh":"血培养结果呈阳性后，医生怀疑细菌发生了血行播散。"}]}],"synonyms":["blood-borne","hematogenous"],"phonetic":"/ˌhiːməˈtɑːdʒənəs/","extraExplanation":["该词常见于医学论文和病历记录，描述“病原体/肿瘤细胞通过血液循环转移或播散”的途径。也可写作（美式）hematogenous，英式拼写更常见为 haematogenous。词源来自希腊语：haima（血）+ -genous（产生/起源于）。"]}
{"word":"haematoid","summary":{"en":"“Haematoid” means blood-like in appearance or color (a technical/medical word).","zh":"“haematoid”指外观或颜色像血的（偏医学/学术用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling blood in color or appearance; blood-like (often describing a reddish stain, fluid, or tissue).","zh":"（颜色或外观）像血的；血样的（常形容红色污渍、液体或组织）。"},"examples":[{"en":"The lab report noted a haematoid discoloration around the wound.","zh":"实验室报告指出伤口周围有血样变色。"},{"en":"Under the microscope, the sample looked haematoid but contained no actual blood cells.","zh":"在显微镜下，样本看起来像血样，但并不含真正的血细胞。"}]}],"synonyms":["bloodlike","blood-red","sanguineous"],"phonetic":"/ˌhiːməˈtɔɪd/","extraExplanation":["“haematoid”来自希腊语词根：haemato-（血）+ -oid（……状、类似）。在美式英语中更常见拼写是“hematoid”。","这是偏医学/生物学语域的词，日常英语更常用“bloodlike”或“blood-red”。"]}
{"word":"haematoidin","summary":{"en":"Haematoidin is a yellow-orange pigment (often crystalline) formed from the breakdown of blood in old hemorrhage or bruises.","zh":"Haematoidin 指血液在组织中分解后形成的黄色至橙黄色色素（常呈结晶），多见于陈旧性出血或瘀伤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow-orange pigment (often forming crystals) produced when blood breaks down in tissues, especially in old bruises or old bleeding; chemically similar to bilirubin","zh":"（血液在组织中分解后形成的）黄色至橙黄色色素，常呈结晶；多见于陈旧性瘀伤或旧出血处，化学性质与胆红素相近"},"examples":[{"en":"Under the microscope, the pathologist noted haematoidin crystals in the old hematoma.","zh":"在显微镜下，病理学家在陈旧性血肿中观察到了血黄素结晶。"},{"en":"Haematoidin can appear in tissues where bleeding happened a long time ago.","zh":"血黄素可出现在很久以前发生过出血的组织中。"}]}],"synonyms":["hematoidin","haematoidin crystals","hematoidin crystals"],"phonetic":"/hiˌmætəˈɔɪdɪn/","extraExplanation":["该词多用于病理学/显微镜观察的语境，日常英语中几乎不使用。","英式拼写为 haematoidin，美式拼写更常见为 hematoidin；都源于 hema-/haema-（血）+ -oid（类似）+ -in（物质/蛋白类后缀）。","在一些资料中会强调它常见于“陈旧性出血”并以结晶形式出现，帮助与急性出血的其他表现区分。"]}
{"word":"haematoin","summary":{"en":"Haematoin is a rare, older term for a pigment produced when blood breaks down, especially in old bruises or hemorrhage sites.","zh":"Haematoin 是一个罕见的旧术语，指血液分解后形成的色素，常见于陈旧淤青或出血部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare/older scientific term for a pigment formed from the breakdown of blood (especially hemoglobin), seen as yellow-to-reddish-brown crystals in old bruises or hemorrhages.","zh":"（罕见/较旧的科学用语）由血液（尤其是血红蛋白）分解产生的色素，常见于陈旧性淤血或出血灶中，可呈黄至红褐色结晶。"},"examples":[{"en":"The pathologist noted haematoin deposits in the tissue from an old hemorrhage.","zh":"病理学家在来自陈旧性出血的组织中观察到血色素沉积（haematoin）。"},{"en":"In older textbooks, haematoin was discussed as a pigment related to blood breakdown.","zh":"在较旧的教材里，haematoin 被作为与血液分解相关的色素来讨论。"}]}],"synonyms":["hematoidin","hematin"],"phonetic":"/hiːˈmætɔɪn/","extraExplanation":["这个词在现代英语医学文献中非常少见，很多时候会被更常用的术语替代，例如 hematoidin（血黄素，常指陈旧出血后形成的结晶色素）或 hematin（血红素衍生的色素）。不同作者/年代的用法可能不完全一致。","拼写上带 ae（haemat-）通常更偏英式传统写法；美式常见对应形式是 hemat-。"]}
{"word":"haematologic","summary":{"en":"Medical: relating to blood or blood-forming organs; British spelling of “hematologic.”","zh":"医学用语：与血液或造血器官有关；为“hematologic”的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the blood and to the organs or tissues that make blood (such as bone marrow), especially in medical contexts.","zh":"（医学）血液的；血液学的；与造血器官/组织（如骨髓）有关的。"},"examples":[{"en":"The doctor ordered haematologic tests to check for anemia.","zh":"医生安排了血液学检查来确认是否贫血。"},{"en":"Some infections can cause haematologic problems like low white blood cell counts.","zh":"一些感染会引发血液方面的问题，比如白细胞计数偏低。"},{"en":"The study focused on haematologic cancers, including leukemia.","zh":"这项研究聚焦于血液系统肿瘤，包括白血病。"}]}],"synonyms":["hematologic","hematological","blood-related"],"phonetic":"/ˌhiːməˈtɑːlədʒɪk/","extraExplanation":["“haematologic”是英式拼写；美式更常写作“hematologic”。两者意思相同。","常见搭配：haematologic/hematologic tests（血液检查）、haematologic disorder（血液疾病）、haematologic malignancy（血液恶性肿瘤）。","词源：来自希腊语“haima”（血）+ “-logy”（学科/研究）+ “-ic”（……的）。医学论文中常见。"]}
{"word":"haematological","summary":{"en":"Haematological means “related to blood or the medical study of blood.”","zh":"haematological 指“与血液或血液学（血液的医学研究）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to hematology—the study of blood and blood diseases.","zh":"血液学的；与血液及血液疾病研究有关的。"},"examples":[{"en":"The doctor ordered haematological tests to check for anemia.","zh":"医生安排了血液学检查来排查贫血。"},{"en":"Haematological disorders can affect how your blood carries oxygen.","zh":"血液系统疾病会影响血液携带氧气的能力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involving the blood (its cells, clotting, or other blood functions), especially in a medical context.","zh":"（医学）与血液（血细胞、凝血或其他功能）有关的。"},"examples":[{"en":"The medicine may cause haematological side effects, such as low white blood cell counts.","zh":"这种药物可能引起血液学副作用，例如白细胞计数偏低。"},{"en":"They monitored haematological parameters during treatment.","zh":"治疗期间他们监测了血液学指标。"}]}],"synonyms":["hematologic","hematological","blood-related"],"phonetic":"/ˌhiːməˈtɑːlədʒɪkəl/","extraExplanation":["英式拼写常见为 haematological（含 ae），美式多写作 hematological。两者意思相同。","常见搭配：haematological test（血液学检查）、haematological disorder（血液系统疾病）、haematological malignancy（血液系统恶性肿瘤，如白血病、淋巴瘤）。"]}
{"word":"haematologist","summary":{"en":"A haematologist is a doctor who specializes in blood and blood diseases.","zh":"haematologist 指“血液科医生”，专治血液及相关疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A doctor who specializes in hematology—the study, diagnosis, and treatment of blood disorders.","zh":"血液科医生；专门研究、诊断和治疗血液疾病的医生。"},"examples":[{"en":"She was referred to a haematologist after her blood test showed abnormal results.","zh":"她的血液检查结果异常后，被转诊去看血液科医生。"},{"en":"A haematologist can treat conditions like anemia, leukemia, and clotting problems.","zh":"血液科医生可以治疗贫血、白血病以及凝血问题等疾病。"}]}],"synonyms":["hematologist","blood specialist"],"phonetic":"/ˌhiːməˈtɑːlədʒɪst/","extraExplanation":["英式拼写是 haematologist，美式常写作 hematologist（意思相同）。词根来自希腊语：haima/haem- 表示“血”，-logist 表示“某领域的专家”。"]}
{"word":"haematology","summary":{"en":"Haematology is the medical study of blood and blood diseases; the British spelling is haematology (US: hematology).","zh":"Haematology 指血液学（研究血液及血液疾病）；英式拼写为 haematology（美式：hematology）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of blood and blood-forming organs, and the diseases related to them; also the medical field that diagnoses and treats blood disorders","zh":"血液学：研究血液、造血器官及其相关疾病的学科；也指诊断和治疗血液疾病的医学专科"},"examples":[{"en":"She decided to specialize in haematology after seeing patients with leukemia.","zh":"她在接触白血病患者后决定专攻血液学。"},{"en":"The haematology report showed that his hemoglobin level was low.","zh":"血液学报告显示他的血红蛋白水平偏低。"},{"en":"Haematology clinics often monitor conditions like anemia and clotting disorders.","zh":"血液学门诊常常监测贫血和凝血障碍等问题。"}]}],"synonyms":["hematology","blood medicine (informal)"],"phonetic":"/ˌhiːməˈtɑːlədʒi/","extraExplanation":["英式拼写为 haematology，美式常写作 hematology（去掉 ae）。两者含义相同。","词源来自希腊语 haima（血）+ -logy（学科/研究）。在医学语境中常见搭配有：haematology department（血液科）、haematology test(s)（血液学检查）、haematologist（血液科医生/血液学家）。"]}
{"word":"haematolysis","summary":{"en":"Haematolysis means the breakdown of blood cells (especially red blood cells), i.e., hemolysis.","zh":"Haematolysis 指血细胞（尤指红细胞）的破裂分解，即“溶血”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the breaking down (lysis) of blood cells, especially red blood cells; hemolysis","zh":"（医学）血细胞的破裂与分解（溶解），尤指红细胞；溶血"},"examples":[{"en":"Severe haematolysis can lead to anemia because red blood cells are destroyed faster than the body can replace them.","zh":"严重的 haematolysis（溶血）会导致贫血，因为红细胞被破坏的速度快于身体补充的速度。"},{"en":"The lab checked the sample for signs of haematolysis before reporting the test results.","zh":"实验室在出具检验结果前，会检查样本是否有 haematolysis（溶血）的迹象。"}]}],"synonyms":["hemolysis","red blood cell lysis","erythrocyte lysis"],"phonetic":"/ˌhiː.məˈtɑːl.ə.sɪs/","extraExplanation":["这是一个较少见、偏专业的医学名词；更常用的同义词是 hemolysis。","英式拼写常写作 haematolysis（含 ae），美式更常写作 hematolysis（简化为 e）。"]}
{"word":"haematoma","summary":{"en":"A haematoma is a swelling caused by blood pooling under the skin or inside the body after injury.","zh":"haematoma 指因受伤等原因导致血液在皮下或体内聚集形成的肿胀/肿块（血肿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A swollen area caused by blood collecting under the skin or inside the body, usually after an injury; a large bruise or blood clot-like swelling.","zh":"（通常因受伤导致的）血肿；血液在皮下或体内组织中聚集形成的肿块，像较大的淤青/肿胀。"},"examples":[{"en":"After the fall, she developed a large haematoma on her thigh.","zh":"摔倒后，她的大腿上出现了一个很大的血肿。"},{"en":"The doctor checked the scan to make sure there was no haematoma in the brain.","zh":"医生查看影像检查，以确认脑内没有血肿。"}]}],"synonyms":["hematoma","bruise (informal/less precise)","contusion (medical, often similar)"],"phonetic":"/ˌhiːməˈtoʊmə/","extraExplanation":["“haematoma”是英式拼写；美式更常写作“hematoma”。两者意思相同，医学语境中非常常见。","血肿通常与外伤、手术或用药（如抗凝药）有关；轻微者可自行吸收，严重或位置危险（如颅内）需要及时就医评估。","复数可写作“haematomas / hematomas”。日常口语里有时会用“bad bruise（很重的淤青）”来泛指，但医学上“haematoma”更具体。"]}
{"word":"haematomas","summary":{"en":"Haematomas are swellings caused by pooled blood under the skin or in tissue, usually after injury; it’s the British spelling (US: hematomas).","zh":"haematomas 指外伤后血液在皮下或组织内聚集形成的“血肿/深部瘀伤”，为英式拼写（美式：hematomas）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A swelling or lump caused by blood collecting outside a blood vessel, usually after an injury (often called a deep bruise).","zh":"（外伤后）血液渗出并在血管外聚集形成的肿块或肿胀，常被称为“深部瘀伤/血肿”。"},"examples":[{"en":"He hit his head, and the doctor found a small hematoma under the skin.","zh":"他撞到了头，医生发现皮下有一个小血肿。"},{"en":"The bruise looked minor, but the pain suggested a deeper hematoma.","zh":"表面看只是小淤青，但疼痛提示可能有更深的血肿。"},{"en":"The nurse checked the injection site for bleeding or a hematoma.","zh":"护士检查注射部位是否有出血或血肿。"}]}],"synonyms":["bruises (general)","contusions (medical)","blood clot (not always exact)"],"phonetic":"/ˌhiːməˈtoʊməz/","extraExplanation":["“haematomas”是英式拼写“haematoma”的复数；美式拼写更常见为“hematoma / hematomas”。两者意思相同。","在医学语境中，hematoma 常用来强调“血液聚集成团”的情况，和一般的 bruise（淤青）相比，可能更深、更肿或范围更大；严重或位置特殊（如头部）时需要及时就医。"]}
{"word":"haematomata","summary":{"en":"Haematomata means “hematomas”: multiple blood collections under the skin or in tissue, usually after injury.","zh":"haematomata 意为“多个血肿”：通常因受伤导致的皮下或组织内积血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of haematoma (a collection of blood outside a blood vessel, usually caused by injury and seen as a swelling or bruise).","zh":"haematoma 的复数（血肿：血液从血管内渗出后在组织中聚集，通常由外伤引起，可表现为肿胀或瘀青）。"},"examples":[{"en":"CT scans showed multiple haematomata after the car accident.","zh":"车祸后，CT 显示有多个血肿。"},{"en":"The doctor monitored the haematomata to make sure they were not expanding.","zh":"医生监测这些血肿，以确保它们没有继续扩大。"}]}],"synonyms":["hematomas","haematomas","bruises"],"phonetic":"/ˌhiːməˈtoʊmətə/","extraExplanation":["“haematomata”是较少见的复数形式，来自希腊语复数结尾 -mata；日常英语和多数医学写作中更常用复数“haematomas”。","英式拼写为“haematoma/haematomata”（含 ae）；美式通常写作“hematoma/hematomas”。"]}
{"word":"haematometer","summary":{"en":"A haematometer is a device for measuring blood, especially hemoglobin or blood cell amounts.","zh":"haematometer 指用于测量血液指标（尤指血红蛋白或血细胞数量/体积）的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to measure or estimate properties of blood (especially the amount of hemoglobin or the number/volume of blood cells).","zh":"血量计；血液测量仪（用于测量或估算血液的某些指标，尤指血红蛋白含量或血细胞的数量/体积）。"},"examples":[{"en":"The lab used a haematometer to estimate the patient’s hemoglobin level.","zh":"实验室用血量计来估算病人的血红蛋白水平。"},{"en":"In older medical manuals, the haematometer is mentioned as a tool for quick blood assessment.","zh":"在较早的医学手册中，血量计被提到是一种用于快速评估血液状况的工具。"}]}],"synonyms":["hematometer","hemoglobinometer","blood analyzer"],"phonetic":"/ˌhiːməˈtɑːmɪtər/","extraExplanation":["“haematometer”是英式拼写（haema-），美式更常写作“hematometer”（hema-）。","这个词在现代临床语境中相对少见，实际工作中常用更具体的设备名称（如用于测血红蛋白的仪器、血细胞计数设备等）；在历史文献或旧式检验方法介绍中更容易见到。"]}
{"word":"haematophilina","summary":{"en":"A Latin-style biological taxonomic name formed from roots meaning “blood” + “loving/attracted to,” used for certain organism groups in scientific classification.","zh":"一种拉丁化的生物分类名称，词根含“血”与“喜爱/趋向”，用于科学分类中指代某些与血相关的生物类群。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin-style scientific (taxonomic) name used in biology; it refers to a group whose name is built from Greek roots meaning “blood” + “loving/attracted to,” so it generally relates to organisms associated with blood (for example, blood-feeding or blood-associated species).","zh":"一种拉丁化的生物学“分类学名称”；其词根来自希腊语，含义为“血（haema-）+ 喜爱/趋向（-phil-）”，因此通常与“与血有关的生物”相关（例如吸血、嗜血或与血环境相关的物种群）。"},"examples":[{"en":"In some older biology texts, Haematophilina appears as a classification label rather than a common word.","zh":"在一些较早的生物学文献中，Haematophilina 常作为分类标签出现，而不是日常词汇。"},{"en":"Because it is a taxonomic name, its exact meaning depends on the author’s classification system.","zh":"由于它是分类学名称，具体指代会随作者采用的分类系统而变化。"}]}],"synonyms":["hematophagous (related term)","blood-feeding (related term)","haematophilous (related term)"],"phonetic":"/ˌhiːmətoʊˈfɪlɪnə/","extraExplanation":["Haematophilina 不是常见英语词汇，更像是“学名/分类名”（可能用于属、亚科、族等不同层级）。如果你能提供它出现的句子、学科（昆虫学/微生物学等）或参考书来源，我可以更准确地对应它的分类层级与指向对象。","词源提示：haema-/haemat- 表示“血”，-phil- 表示“喜爱、趋向”，-ina 常见于拉丁化分类名的后缀（用于构成某一类群名称）。相关常见英语词有 hematophagous（吸血的/食血的）、hemophilic（嗜血环境的/与血友病相关的，注意语义不同）。"]}
{"word":"haematophiline","summary":{"en":"A rare histology term meaning “hematoxylin-loving”: it stains blue/purple with hematoxylin.","zh":"一个较罕见的组织学用语，意思是“嗜苏木精性”：会被苏木精染成蓝紫色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Histology) A substance or tissue component that has an affinity for hematoxylin dye and therefore stains dark blue/purple in common microscope slides (H&E staining).","zh":"（组织学）对苏木精（hematoxylin）染料有亲和力、因此在常见显微染色（H&E）中会呈深蓝/紫色的物质或组织成分。"},"examples":[{"en":"In an H&E slide, the nucleus looks hematophiline because it binds hematoxylin strongly.","zh":"在H&E切片里，细胞核看起来呈“haematophiline（嗜苏木精性）”，因为它会牢固结合苏木精。"},{"en":"Pathologists often describe DNA-rich areas as hematophiline (deep blue/purple).","zh":"病理医生常把DNA含量高的区域描述为haematophiline（深蓝/紫色）。"}]}],"synonyms":["hematophilic","haematophilic","basophilic"],"phonetic":"/ˌhiːməˈtɑːfɪlɪn/","extraExplanation":["这个词非常罕见，很多教材与论文更常用拼写 **hematophilic / haematophilic**（嗜苏木精性、苏木精亲和的），意思基本相同；也有人写作 **hematophilin / haematophiline** 指“能被苏木精染深色的成分”。在实际学习与写作中，用 **hematophilic/haematophilic** 会更标准、更容易被读者理解。"]}
{"word":"haematophyte","summary":{"en":"A rare, older term for an organism (often a parasite) that lives in the blood.","zh":"一个较少见的旧术语，指生活在血液中的生物（常指寄生生物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, rare/older use) An organism—especially a parasite—found living in the blood of an animal.","zh":"（生物学，较少见/旧用法）生活在动物血液中的生物，尤指寄生生物。"},"examples":[{"en":"Some older medical texts use “haematophyte” for blood-dwelling parasites.","zh":"一些较早的医学文献会用“haematophyte”指血液中的寄生生物。"},{"en":"The researcher looked for haematophytes in blood samples under a microscope.","zh":"研究人员在显微镜下检查血样，寻找血液寄生生物。"}]}],"synonyms":["hematophyte","blood parasite","blood-dwelling parasite"],"phonetic":"/hiːˈmætoʊfaɪt/","extraExplanation":["这个词非常少见，更多见到的是更常用的表达，如 blood parasite（血液寄生虫）、blood-borne parasite（血源性寄生生物），或在更专业语境里用具体名称（例如某些原虫）。","词源来自希腊语：haima（血）+ phyton（植物）。早期科学文献有时会把某些微小生物用“植物/藻类”式的后缀来命名，因此带有历史色彩。","拼写上，英式英语常写 haematophyte，美式英语更常见 hematophyte。"]}
{"word":"haematopoiesis","summary":{"en":"Haematopoiesis is the body’s process of producing new blood cells, mainly in the bone marrow.","zh":"Haematopoiesis 指人体生成新血细胞的“造血”过程，主要在骨髓中进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making new blood cells (red blood cells, white blood cells, and platelets), mainly in the bone marrow","zh":"造血作用；生成新的血细胞（红细胞、白细胞和血小板）的过程，主要发生在骨髓中"},"examples":[{"en":"Chemotherapy can damage the bone marrow and reduce haematopoiesis.","zh":"化疗可能损伤骨髓，从而降低造血功能。"},{"en":"Iron, vitamin B12, and folate are important for healthy haematopoiesis.","zh":"铁、维生素B12和叶酸对健康的造血过程很重要。"}]}],"synonyms":["hematopoiesis","blood cell formation"],"phonetic":"/hiˌmæt̬oʊpɔɪˈsis/","extraExplanation":["英式拼写为 haematopoiesis，美式常写作 hematopoiesis；两者意思相同。","词源可拆解理解：haemato-（血）+ -poiesis（制造、生成）。医学写作中常与 bone marrow（骨髓）、stem cells（干细胞）、anemia（贫血）等词一起出现。"]}
{"word":"haematopoietic","summary":{"en":"Haematopoietic means “blood-forming,” describing the process or tissues that produce blood cells.","zh":"Haematopoietic 意为“造血的/产血的”，用于描述生成血细胞的过程或组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the production and development of blood cells (especially in bone marrow).","zh":"与血细胞的生成和发育有关的（尤指在骨髓中）。"},"examples":[{"en":"The bone marrow contains haematopoietic stem cells that can make new blood cells.","zh":"骨髓中含有造血干细胞，可以生成新的血细胞。"},{"en":"Doctors measured haematopoietic recovery after chemotherapy.","zh":"医生评估了化疗后的造血功能恢复情况。"}]}],"synonyms":["hematopoietic","blood-forming","blood-producing"],"phonetic":"/hiˌmætəpoʊˈiːtɪk/","extraExplanation":["“haematopoietic”常见于英式拼写；美式通常写作“hematopoietic”。两者意思完全相同。","词源来自希腊语：haima（血）+ poiein（制造、产生），所以可理解为“造血的/产血的”。","在医学语境中常与“stem cell（干细胞）”“bone marrow（骨髓）”“transplant（移植）”连用，如“haematopoietic stem cell transplant（造血干细胞移植）”。"]}
{"word":"haematopus","summary":{"en":"Haematopus is the scientific genus name for oystercatchers, coastal birds that often feed on shellfish.","zh":"Haematopus 是“蛎鹬（蚝鸟）”的属名，指常在海岸活动、常取食贝类的鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shorebirds known as oystercatchers, with strong orange-red bills used for feeding on shellfish","zh":"蛎鹬属（Haematopus），一类滨海涉禽，常称“蛎鹬/蚝鸟”，喙粗壮多为橙红色，善于取食贝类等"},"examples":[{"en":"Haematopus includes several oystercatcher species found along coasts worldwide.","zh":"蛎鹬属包含多种蛎鹬，分布在世界各地的海岸带。"},{"en":"Researchers recorded Haematopus feeding on mussels at low tide.","zh":"研究人员记录到蛎鹬属鸟类在退潮时取食贻贝。"}]}],"synonyms":["oystercatcher (common name)"],"phonetic":"/hiːˈmætəpəs/","extraExplanation":["词源来自希腊语：haima（血）+ pous（脚）。这个名字指的是某些蛎鹬腿脚呈红色或粉红色的特征。","在英文科普或观鸟语境中，更常用的是通用名 oystercatcher（蛎鹬）；Haematopus 多见于学术写作、物种名和拉丁学名中（如 Eurasian oystercatcher: Haematopus ostralegus）。"]}
{"word":"haematorrhachis","summary":{"en":"A rare medical term meaning bleeding in or around the spinal cord/spinal canal.","zh":"一个较少见的医学词，指脊髓或椎管内/周围出血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bleeding (hemorrhage) in or around the spinal cord/spinal canal; a spinal hemorrhage.","zh":"（医学）脊髓或椎管内/周围的出血；脊髓（椎管）出血。"},"examples":[{"en":"After the accident, doctors considered haematorrhachis because of sudden severe back pain and weakness.","zh":"事故后，由于突发的剧烈背痛和无力，医生考虑可能是脊髓/椎管出血（haematorrhachis）。"},{"en":"MRI can help confirm haematorrhachis and show where the bleeding is located.","zh":"核磁共振（MRI）可帮助确认脊髓/椎管出血，并显示出血部位。"}]}],"synonyms":["spinal hemorrhage","intraspinal hemorrhage","spinal bleeding"],"phonetic":"/ˌhiːˌmætəˈreɪkɪs/","extraExplanation":["这个词非常少见，更多见的拼写是 hematorrhachis（美式）或 haematorrhachis（英式）。","词源可拆解为 hema-/haema-（血）+ -rrhachis/-rhachis（脊柱/脊髓相关）。临床上更常用的说法是 “spinal hemorrhage / intraspinal hemorrhage（脊髓/椎管内出血）”。"]}
{"word":"haematosepsis","summary":{"en":"Haematosepsis is an old/rare medical term meaning a severe infection of the blood (blood sepsis), essentially related to sepsis or septicemia.","zh":"Haematosepsis 是较旧/少见的医学词，指严重的血液感染（血源性败血症），含义与 sepsis 或 septicemia 接近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a severe infection of the blood; sepsis caused by bacteria or other pathogens in the bloodstream (an older/rare term, similar to “septicemia” or “blood sepsis”).","zh":"血液严重感染；由细菌或其他病原体进入血液并引发的败血症（较旧/少见用语，含义接近“septicemia/菌血症-败血症”“blood sepsis/血源性败血症”）。"},"examples":[{"en":"The notes used the term haematosepsis to describe a dangerous blood infection.","zh":"病历记录用 haematosepsis 来描述一种危险的血液感染。"},{"en":"Without prompt treatment, haematosepsis can lead to organ failure.","zh":"如果不及时治疗，haematosepsis 可能导致器官衰竭。"}]}],"synonyms":["sepsis","septicemia","blood poisoning (informal/old)"],"phonetic":"/hiːˌmæt.oʊˈsɛp.sɪs/","extraExplanation":["这个词主要出现在较早的医学文献中，现代临床更常用 sepsis（败血症/脓毒症）或 septicemia（旧称“败血症/菌血症”，但在不同地区与学科里用法可能不完全一致）。","词源上可拆为 haemato-（血）+ sepsis（腐败、感染），理解为“血液中的感染/败血”。","属于严肃的医学急症语境，日常英语中很少见；如在学习或翻译中遇到，通常可按“血液感染导致的败血症”来把握含义。"]}
{"word":"haematosin","summary":{"en":"Haematosin is a rare medical term for a brown pigment produced when blood (hemoglobin) breaks down, especially in old bleeding.","zh":"Haematosin 是较少见的医学词，指血液（血红蛋白）分解后形成的褐色色素，常与旧出血有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brownish pigment formed from the breakdown of hemoglobin (from old blood), sometimes described in older medical writing as a blood-derived coloring matter found in tissues after bleeding or blood-cell destruction","zh":"（医学）由血红蛋白分解形成的褐色血源性色素（多见于旧出血或红细胞破坏后的组织中）；一些较早期医学文献中用于指血液分解后的着色物质"},"examples":[{"en":"The pathologist noted a brown pigment consistent with haematosin in the area of old hemorrhage.","zh":"病理学家指出旧出血区域可见与 haematosin 相符的褐色色素。"},{"en":"In older texts, haematosin was used to describe pigments produced when blood breaks down in tissues.","zh":"在较早的文献中，haematosin 用来描述血液在组织中分解后产生的色素。"}]}],"synonyms":["hematin","hemosiderin (related)","blood pigment"],"phonetic":"/ˌhiːməˈtoʊsɪn/","extraExplanation":["这是一个相对少见、偏旧的医学词汇；现代更常见的相关术语包括 **hematin（血红素衍生物）**、**hemosiderin（含铁血黄素）**、以及更广义的 **hematoidin（血红素结晶/血红素样色素）**。不同书籍对这些词的界定可能不完全一致。","拼写上 **haematosin** 属于英式写法（haema-），美式常见对应拼写为 **hematosin**，但在当代临床与病理报告中本词并不常用。"]}
{"word":"haematosis","summary":{"en":"Haematosis is a medical term for the oxygenation of blood, especially in the lungs (an older/less common term).","zh":"Haematosis 是医学术语，指血液（尤其在肺部）的氧合过程，属于较旧/较少见的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) the oxygenation of blood (especially in the lungs); sometimes used more broadly for the process by which blood becomes “blood-like” or properly formed.","zh":"（医学）血液的氧合（尤指在肺部）；有时也泛指血液逐渐“成血”、变得符合血液特性的过程。"},"examples":[{"en":"In older physiology texts, haematosis refers to the oxygenation of blood in the lungs.","zh":"在较早的生理学教材中，haematosis 指的是血液在肺部的氧合过程。"},{"en":"Any condition that impairs lung function can reduce haematosis.","zh":"任何影响肺功能的情况都可能降低血液氧合（haematosis）。"}]}],"synonyms":["oxygenation","gas exchange","hematosis"],"phonetic":"/ˌhiːməˈtoʊsɪs/","extraExplanation":["这个词比较少见，多出现在较旧或较专业的生理学语境中；现代医学写作里更常直接用 oxygenation（氧合）或血气交换（gas exchange）来表达相同概念。","拼写上 haem- 是英式拼法（与 hem- 对应），在美式英语中常写作 hematosis。不要和 hemochromatosis（血色病/铁过载）混淆，后者是完全不同的疾病名称。"]}
{"word":"haematotherma","summary":{"en":"Haematotherma is a rare term meaning a warm-blooded (temperature-regulating) animal.","zh":"Haematotherma 是一个罕见词，指温血/恒温（能调节体温）的动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, biology) a warm-blooded animal; an organism that maintains a relatively constant internal body temperature (a “warm-blooded” organism).","zh":"（罕见，生物学）恒温动物；能维持较稳定体温的“温血”生物。"},"examples":[{"en":"Birds and mammals are often described as haematotherma because they can regulate their body temperature.","zh":"鸟类和哺乳动物常被描述为 haematotherma，因为它们能调节体温。"},{"en":"In older scientific writing, you may see terms like haematotherma contrasted with cold-blooded animals.","zh":"在较早的科学写作中，你可能会看到 haematotherma 与冷血动物相对照的用法。"}]}],"synonyms":["warm-blooded animal","endotherm","homeotherm"],"phonetic":"/ˌhiːmətoʊˈθɝːmə/","extraExplanation":["这个词非常少见，多出现在较早或较边缘的科学术语中；现代英语更常用 warm-blooded animals（温血动物）、endotherms（内温动物）或 homeotherms（恒温动物）。","拼写上你也可能会遇到 hematotherma（美式去掉 ae）或相关词形；如果你是在课本/论文里看到它，建议对照上下文确认作者是否在谈“内温/恒温”概念。"]}
{"word":"haematothermal","summary":{"en":"Haematothermal means “connected with blood temperature or heat regulation through blood circulation.”","zh":"haematothermal 指“与血液温度有关，或与通过血液循环进行热量/体温调节有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the temperature of the blood, or to heat regulation/distribution in the body via blood circulation","zh":"与血液温度有关的；或指通过血液循环进行体温调节/热量分布的"},"examples":[{"en":"Researchers measured the haematothermal gradient between core blood and peripheral tissues.","zh":"研究人员测量了核心血液与外周组织之间的血液温度梯度。"},{"en":"In cold conditions, changes in blood flow can have haematothermal effects on the hands and feet.","zh":"在寒冷环境下，血流变化会对手脚产生血液热相关的影响。"}]}],"synonyms":["hematothermal","blood-temperature-related","blood-mediated thermal"],"phonetic":"/hiˌmætoʊˈθɝːməl/","extraExplanation":["这个词非常少见，多见于生理学/医学语境。词根拆解：haemato-（血）+ thermal（热的、温度的），英美拼写也常见作 hematothermal。","在实际写作中，很多场合会用更常见的表达替代，比如 blood temperature（血液温度）、thermal regulation via blood flow（通过血流的热调节）、blood-borne heat transfer（经血液传递热量）。"]}
{"word":"haematoxylic","summary":{"en":"Haematoxylic means “related to hematoxylin,” a tissue-staining dye used in microscopy.","zh":"haematoxylic 指“与苏木精有关的”，常用于显微镜下的组织染色语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hematoxylin (also spelled haematoxylin), a dye used especially in microscopy to stain tissues (often turning cell nuclei blue-purple).","zh":"与苏木精（也拼作 haematoxylin）有关的；指一种常用于显微镜下组织染色的染料（常使细胞核呈蓝紫色）。"},"examples":[{"en":"The lab used a haematoxylic stain to make the cell nuclei easier to see.","zh":"实验室使用了苏木精相关的染色方法，使细胞核更容易观察。"},{"en":"Haematoxylic solutions are common in routine histology work.","zh":"在常规组织学工作中，苏木精相关的溶液很常见。"}]}],"synonyms":["hematoxylin-related","hematoxylin (attributive)"],"phonetic":"/ˌhiːmətoʊˈzɪlɪk/","extraExplanation":["这个词主要出现在医学与生物学语境（组织学/病理学）。最常见的搭配是 “hematoxylic stain（苏木精染色）”。日常英语中几乎不会用到，更多是专业术语。","在显微镜染色中，苏木精常与伊红（eosin）搭配形成 H&E stain（苏木精-伊红染色），用于区分细胞核与细胞质等结构。"]}
{"word":"haematoxylin","summary":{"en":"Haematoxylin is a dye/stain widely used in microscopy to color cell nuclei blue-purple.","zh":"Haematoxylin 是一种显微观察中常用的染料/染色剂，用于把细胞核染成蓝紫色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural dye (and lab stain) used mainly in microscopy to color cell nuclei a blue-purple color, especially in tissue sections.","zh":"一种天然染料（也是实验室常用染色剂），主要用于显微镜观察中，把细胞核等结构染成蓝紫色，常用于组织切片。"},"examples":[{"en":"The pathologist used haematoxylin to stain the nuclei before examining the biopsy slide.","zh":"病理医生先用 haematoxylin 给细胞核染色，再观察活检切片。"},{"en":"Haematoxylin and eosin (H&E) staining is common in histology.","zh":"haematoxylin 和 eosin（H&E）染色在组织学中非常常见。"}]}],"synonyms":["hematoxylin","logwood dye"],"phonetic":"/ˌhiːməˈtɑːksəlɪn/","extraExplanation":["英式拼写 haematoxylin 美式常写作 hematoxylin（少了 ae）。两者指同一种染色剂。","它最早来源于“木蓝/苏木”（logwood）树的心材提取物；在实验中常与 eosin 搭配形成 H&E 染色：haematoxylin 主要让细胞核呈蓝紫色，eosin 常让细胞质等呈粉红色，便于区分组织结构。"]}
{"word":"haematoxylon","summary":{"en":"Haematoxylon is the logwood tree (or its wood/dye), historically important for making dark dyes and still relevant in lab staining via related compounds.","zh":"Haematoxylon 指洋苏木（logwood）这种树（或其木材/染料），历史上用于制深色染料，并通过相关化合物在实验室染色中仍有影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree (especially Haematoxylum campechianum, “logwood”) whose heartwood is used to make a dark dye and pigments.","zh":"一种热带树（尤指洋苏木/墨水木 Haematoxylum campechianum，即“logwood”），其心材可用来制成深色染料和颜料。"},"examples":[{"en":"In the past, haematoxylon (logwood) was exported to produce purple-black dyes for cloth.","zh":"过去，人们会出口 haematoxylon（洋苏木）来制作用于布料的紫黑色染料。"},{"en":"The heartwood of haematoxylon yields a coloring substance used in dyes and inks.","zh":"haematoxylon 的心材能产生用于染料和墨水的着色物质。"}]},{"partOfSpeech":"n.","definition":{"en":"the wood or dye material obtained from logwood (Haematoxylon), used for coloring textiles and in some laboratory stains.","zh":"指从洋苏木（Haematoxylon）获得的木材或染料材料，用于纺织品染色，也用于某些实验室染色。"},"examples":[{"en":"The museum noted that some older textiles were colored with haematoxylon-based dyes.","zh":"博物馆指出，一些较早的纺织品使用了以 haematoxylon 为基础的染料上色。"},{"en":"In histology, related compounds from haematoxylon are used to stain cell nuclei dark blue or purple.","zh":"在组织学中，源自 haematoxylon 的相关化合物常用于把细胞核染成深蓝或紫色。"}]}],"synonyms":["logwood","hematoxylon"],"phonetic":"/ˌhiːməˈtɑːksɪlɑːn/","extraExplanation":["这个词来自希腊语词根：haima（血）+ xylon（木），大意是“血色的木头”，指它能产生红紫色到黑紫色的染料。","在现代生物/医学实验里更常见的是“hematoxylin/haematoxylin（苏木精）”，它与伊红（eosin）搭配形成常见的 H&E 染色；但 haematoxylon 指的是树/木材来源本身。"]}
{"word":"haematozoa","summary":{"en":"Haematozoa are parasites that live in the blood, often referring to protozoa like malaria parasites.","zh":"haematozoa 指寄生在血液中的寄生虫（常指疟原虫等原生动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"blood-dwelling parasites (especially microscopic protozoa) that live in the bloodstream, such as malaria parasites.","zh":"（尤指显微镜下的原生动物）寄生在血液中的寄生虫；如疟原虫等血液寄生虫。"},"examples":[{"en":"The doctor examined a blood smear to check for haematozoa.","zh":"医生检查了血涂片以确认是否有血液寄生虫。"},{"en":"Some haematozoa are transmitted by mosquitoes or ticks.","zh":"一些血液寄生虫通过蚊子或蜱传播。"}]}],"synonyms":["hematozoa","blood parasites","blood protozoa"],"phonetic":"/ˌhiːˌmætəˈzoʊə/","extraExplanation":["“haematozoa”是复数形式，单数常见为“haematozoon”。在现代医学/生物学写作中，这个词偏学术且略带旧式色彩，更常见的说法是“blood parasites（血液寄生虫）”或直接指具体病原体（如“Plasmodium 疟原虫”）。","拼写“haemato-”是英式（British）写法；美式通常写作“hemato-”（如“hematozoa”）。"]}
{"word":"haematozoal","summary":{"en":"“Haematozoal” means related to blood parasites found in the bloodstream.","zh":"“haematozoal”指“与血液中寄生虫有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to blood-dwelling animal parasites (especially protozoa) found in the bloodstream, such as those that cause malaria.","zh":"与血液中寄生的动物性寄生虫（尤指原虫）有关的；指存在于血流中的寄生虫（如疟疾相关寄生虫）。"},"examples":[{"en":"The lab reported a haematozoal infection after examining the blood smear.","zh":"实验室在检查血涂片后报告为血液寄生虫感染（haematozoal infection）。"},{"en":"Haematozoal parasites can be transmitted by mosquitoes or ticks.","zh":"血液寄生虫可能通过蚊子或蜱虫传播。"}]}],"synonyms":["blood-parasitic","hematozoan","bloodborne parasitic"],"phonetic":"/hiːˌmætəˈzoʊ.əl/","extraExplanation":["该词较少见，多用于医学/兽医学与寄生虫学语境，常见于学术写作或检验报告中。","构词上来自 haemato-（血）+ -zoal（与动物/生物体有关），与 haematozoa（血中寄生虫的统称）同源。"]}
{"word":"haematozoic","summary":{"en":"Haematozoic describes organisms (especially parasites) that live in the blood.","zh":"haematozoic 指（尤指寄生虫）生活在血液中的，或与血液寄生虫相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a parasite or organism) living in the blood; relating to blood-dwelling parasites.","zh":"（指寄生虫或生物）生活在血液中的；与血液寄生虫有关的。"},"examples":[{"en":"Malaria is caused by a haematozoic parasite that infects red blood cells.","zh":"疟疾是由一种生活在血液中的寄生虫引起的，它会感染红细胞。"},{"en":"The lab report noted haematozoic organisms in the patient’s blood sample.","zh":"化验报告指出在患者的血样中发现了血液寄生生物。"}]}],"synonyms":["blood-dwelling","hematozoic","haematogenous (related, not identical)"],"phonetic":"/ˌhiːmətoʊˈzoʊɪk/","extraExplanation":["这是一个较少见的医学/生物学词汇，常出现在寄生虫学或血液学语境中。","英式拼写常见 haemato-，美式更常见 hemato-（如 hematologic）。词根：haemato-/hemato- 表示“血”，-zoic 与“动物/生物”相关。"]}
{"word":"haematozoon","summary":{"en":"A haematozoon is a parasite (often a protozoan) that lives in the blood.","zh":"haematozoon 指寄生在血液中的寄生虫（常为原生动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blood-dwelling parasitic microorganism (especially a protozoan) found in the bloodstream of humans or animals","zh":"血液寄生虫；寄生于血液中的微生物（尤指原生动物）"},"examples":[{"en":"Malaria is caused by a haematozoon that lives in human red blood cells.","zh":"疟疾是由一种生活在人体红细胞中的血液寄生虫引起的。"},{"en":"The lab report noted a haematozoon in the blood smear.","zh":"化验报告在血涂片中记录到血液寄生虫。"}]}],"synonyms":["blood parasite","hematozoon","hematozoan"],"phonetic":"/hiːˈmætəˌzoʊən/","extraExplanation":["“haemato-”是英式拼写，对应美式“hemato-”。因此你也会看到更常见的拼写“hematozoon / hematozoan”。","这个词多见于较旧或较专业的医学/寄生虫学语境，常用来泛指在血液中生活的寄生原生动物，例如疟原虫（Plasmodium）。现代文献更常直接使用具体病原体名称（如Plasmodium）或说“blood parasite”。"]}
{"word":"haematozzoa","summary":{"en":"Haematozoa are blood-dwelling protozoan parasites.","zh":"Haematozoa 指寄生在血液中的原生动物（血液原虫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) Protozoa (single-celled parasites) that live in the blood of humans or animals.","zh":"（生物）血液原虫：生活在人或动物血液中的原生动物（单细胞寄生虫）。"},"examples":[{"en":"Some haematozoa are transmitted by mosquitoes and can cause serious disease.","zh":"一些血液原虫由蚊子传播，可能引起严重疾病。"},{"en":"The lab examined a blood smear to check for haematozoa.","zh":"实验室检查了血涂片以确认是否有血液原虫。"}]}],"synonyms":["hematozoa","blood protozoa","blood parasites"],"phonetic":"/ˌhiːmətoʊˈzoʊə/","extraExplanation":["你输入的拼写“haematozzoa”更常见的标准拼法是 **haematozoa**（英式拼写），美式也常写作 **hematozoa**（去掉 a）。","词源可拆解为：**haemato- / hemato-**（血）+ **-zoa**（动物/生物的复数形式）。在学术语境里多用于寄生虫学、兽医学、热带医学等领域，常见相关例子包括疟原虫（Plasmodium）等。"]}
{"word":"haematuria","summary":{"en":"Haematuria means blood in the urine; it’s a medical term (US: hematuria).","zh":"haematuria 指“血尿/尿液中带血”，是医学用语（美式拼写：hematuria）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"blood in the urine (pee).","zh":"血尿；尿液中带血。"},"examples":[{"en":"The doctor ordered a urine test because she had haematuria.","zh":"因为她出现血尿，医生安排了尿检。"},{"en":"Haematuria can be visible (red or brown urine) or only found under a microscope.","zh":"血尿可能是肉眼可见（尿液发红或呈褐色），也可能只能在显微镜下发现。"}]}],"synonyms":["hematuria","blood in the urine"],"phonetic":"/ˌhiːməˈtjʊriə/","extraExplanation":["这是医学术语，英式拼写为 haematuria，美式更常写作 hematuria。","常见原因包括：尿路感染、肾结石、剧烈运动、某些药物，以及肾脏或泌尿系统的其他疾病。多数情况并非紧急，但如果伴随剧烈腰痛、发烧、排尿疼痛、血块，或持续反复出现，应尽快就医。","词源：haem- 表示“血”（来自希腊语 haima），-uria 表示“尿/尿液状况”。"]}
{"word":"haemia","summary":{"en":"Haemia is a medical suffix meaning “blood” or “a blood condition,” often seen in British spelling.","zh":"Haemia 是一个医学后缀，表示“血”或“血液状态”，常见于英式拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medical suffix) “blood” or “a condition of the blood,” used to form terms meaning something is in the blood or the blood has a certain state.","zh":"（医学后缀）表示“血”或“血液的某种状态”，用于构成医学术语，表示某物存在于血液中或血液呈现某种状况。"},"examples":[{"en":"Anaemia means a condition in which the blood has too few red blood cells or too little hemoglobin.","zh":"Anaemia（贫血）指血液中红细胞过少或血红蛋白不足的状态。"},{"en":"Bacteraemia means bacteria are present in the blood.","zh":"Bacteraemia（菌血症）表示细菌存在于血液中。"},{"en":"Hyperglycaemia refers to high levels of glucose in the blood.","zh":"Hyperglycaemia（高血糖）指血液中的葡萄糖水平偏高。"}]}],"phonetic":"/ˈhiːmiə/","extraExplanation":["“haemia”多见于英式拼写（haem-），美式拼写通常写作“-hemia”。例如：anaemia（英）= anemia（美），hyperglycaemia（英）= hyperglycemia（美）。","它通常不是独立使用的单词，而是作为后缀出现在医学术语里，用来说明“与血液有关/在血中”。"]}
{"word":"haemic","summary":{"en":"“Haemic” means “related to blood,” and is a British-style spelling of “hemic.”","zh":"“haemic”意为“与血液有关的”，是“hemic”的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to blood (especially to substances or conditions found in the blood).","zh":"与血液有关的；（尤指）存在于血液中的物质或血液相关状况的。"},"examples":[{"en":"The doctor ordered tests to check the patient’s haemic iron levels.","zh":"医生安排检查以确认病人的血液中铁含量（血铁水平）。"},{"en":"Some medicines can cause haemic side effects, so follow the dosage instructions.","zh":"一些药物可能引起与血液相关的副作用，因此要遵照用药剂量说明。"}]}],"synonyms":["hemic","blood-related","hematologic","haematologic"],"phonetic":"/ˈhiːmɪk/","extraExplanation":["“haemic”是“haemic/haem-”这种英式拼写体系的一部分（对应美式多为“hemic/hem-”）。两者意思相同：都与血液有关。医学与生物学写作中更常见的是“hemic”或直接用更具体的词（如“blood-borne 血源性的”、“hematologic/haematologic 血液学的”）。","词根来自希腊语“haima（血）”，因此你会在很多相关词里看到 hem-/haem-：hemoglobin/haemoglobin（血红蛋白）、hemorrhage/haemorrhage（出血）。"]}
{"word":"haemin","summary":{"en":"Haemin is a Korean name; in English it often refers to the author and Buddhist monk Haemin Sunim.","zh":"Haemin 是一个韩国名字；在英文里常用来指作者兼僧人 Haemin Sunim（慧敏法师）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Korean given name (often romanized as Haemin). In English contexts, it most commonly refers to Haemin Sunim, a Korean Buddhist monk and bestselling author known for writings on mindfulness and comfort.","zh":"一个韩国名字（常见罗马拼写为 Haemin）。在英语语境中，它最常指韩国僧人兼畅销书作者 Haemin Sunim（慧敏法师），以关于正念与疗愈的文字闻名。"},"examples":[{"en":"I’m reading a book by Haemin Sunim about slowing down.","zh":"我在读慧敏法师（Haemin Sunim）写的一本关于慢下来的书。"},{"en":"Haemin is a Korean name, so different people may spell it slightly differently in English.","zh":"Haemin 是韩文名字，所以不同的人在英文里可能会有不同的拼写方式。"}]}],"synonyms":["Haemin Sunim"],"phonetic":"/ˈheɪmɪn/","extraExplanation":["“Haemin”通常是韩文音译名；不同的罗马化系统会导致拼写差异。你也可能见到与其相关的写法或称呼，如 “Haemin Sunim”。“Sunim”是对佛教出家人的敬称，可理解为“法师/师父”。"]}
{"word":"haemins","summary":{"en":"“Haemins” means iron-containing heme compounds (plural of haemin/hemin), used in lab research and sometimes in medicine for porphyria.","zh":"“haemins”指含铁的血红素类化合物（haemin/hemin 的复数），常用于实验研究，也可用于治疗某些卟啉症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of haemin (also spelled hemin): iron-containing heme compounds (often heme chloride) derived from hemoglobin, used in biology/chemistry research and sometimes as a medicine to treat certain porphyrias.","zh":"haemin 的复数（也拼作 hemin）：一种含铁的血红素类化合物（常指氯化血红素），来源于血红蛋白分解产物，用于生物/化学研究，也可作为药物用于治疗某些卟啉症。"},"examples":[{"en":"The lab ordered haemins as standards for the spectroscopy experiment.","zh":"实验室订购了 haemins 作为光谱实验的标准品。"},{"en":"In medical settings, haemin can be administered to treat an acute porphyria attack.","zh":"在医疗中，haemin 可用于治疗急性卟啉症发作。"}]}],"synonyms":["hemins","haemin","hemin"],"phonetic":"/ˈhiːmɪnz/","extraExplanation":["“haemin”是英式拼写，常见的美式/科研文献拼写是“hemin”。两者通常指同一类物质或非常接近的制剂。","临床上常见相关制剂有 heme arginate / hemin（不同国家用法不同），主要用于抑制卟啉合成途径中某些中间产物的过度生成，从而缓解急性卟啉症症状。"]}
{"word":"haemo","summary":{"en":"Haemo- is a prefix meaning “blood,” mainly seen in British spellings of medical terms.","zh":"haemo- 是表示“血液”的前缀，主要见于英式医学词汇拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix meaning “blood,” used to form medical/scientific terms (British spelling of hemo-).","zh":"表示“血、血液”的前缀，用于构成医学/科学词汇（英式拼写，对应美式 hemo-）。"},"examples":[{"en":"Haemoglobin carries oxygen in the blood.","zh":"血红蛋白在血液中携带氧气。"},{"en":"A haematology lab tests blood samples.","zh":"血液学实验室会检测血液样本。"},{"en":"In American English, these words are usually spelled with hemo-, like hemoglobin.","zh":"在美式英语里，这类词通常用 hemo- 拼写，比如 hemoglobin。"}]}],"synonyms":["hemo-","hem-"],"phonetic":"/ˈhiːmoʊ/","extraExplanation":["“haemo-”来自希腊语 haima（血）。在英式拼写中常见：haemoglobin, haematology, haemorrhage；对应的美式拼写通常去掉字母 a：hemoglobin, hematology, hemorrhage。读写时要注意英美差异，但含义相同。"]}
{"word":"haemoblast","summary":{"en":"A haemoblast is an immature, early blood-forming cell (an older biological/medical term).","zh":"haemoblast 指未成熟的早期造血细胞（较旧的生物/医学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology/medicine) An immature precursor cell that develops into a blood cell; an early blood-forming cell (an older term, sometimes used for embryonic or stem-like blood cells).","zh":"（生物/医学）血细胞的未成熟前体细胞；早期造血细胞（较旧的术语，有时用于指胚胎期或类似干细胞的造血细胞）。"},"examples":[{"en":"In some older textbooks, a haemoblast is described as an early cell that later becomes a red or white blood cell.","zh":"在一些较早的教材中，haemoblast 被描述为一种早期细胞，后来会发育成红细胞或白细胞。"},{"en":"The paper notes that the term haemoblast is not common in modern clinical writing.","zh":"论文指出，haemoblast 这个词在现代临床写作中并不常见。"}]}],"synonyms":["hemoblast","hematoblast","blood progenitor cell","hematopoietic stem cell"],"phonetic":"/ˈhiːməˌblæst/","extraExplanation":["“haemo- / haema-”来自希腊语，意为“血”；“-blast”在生物学里常指“未成熟的前体细胞/芽细胞”（如 osteoblast 成骨细胞、neuroblast 神经母细胞）。因此 haemoblast 字面就是“血的前体细胞”。","该词在当代医学中较少作为标准术语使用；现代更常见的相关说法包括 hematopoietic stem cell（造血干细胞）、blood progenitor cell（血系祖细胞）等。阅读文献时可把 haemoblast 理解为“早期造血细胞”的概括性旧称。"]}
{"word":"haemochrome","summary":{"en":"A technical term for a heme-based pigment/compound related to hemoglobin, often mentioned in biochemistry and meat-color studies.","zh":"一个技术性很强的词，指与血红蛋白/血红素相关的血红素色素或化合物，常见于生化与肉类颜色研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heme-based pigment (a form of hemoglobin-related compound) produced when heme binds with other molecules; often discussed in biochemistry and food science (e.g., meat color changes).","zh":"（生化/食品科学）一种以“血红素（heme）”为核心的色素/化合物，常指血红素与其他分子结合后形成的血红蛋白相关产物；常用于解释肉类颜色变化等现象。"},"examples":[{"en":"During heating, some heme compounds can change into haemochromes, affecting the color of cooked meat.","zh":"加热时，一些血红素化合物会转变成 haemochromes，从而影响熟肉的颜色。"},{"en":"The researcher measured haemochrome formation to track changes in hemoglobin-derived pigments.","zh":"研究人员通过测量 haemochrome 的生成来追踪血红蛋白来源色素的变化。"}]}],"synonyms":["hemochrome","heme pigment"],"phonetic":"/ˈhiːmoʊˌkroʊm/","extraExplanation":["这是一个非常专业的词，主要出现在生物化学、血红蛋白/血红素研究以及食品科学（尤其是肉制品颜色）相关文献中。日常英语里几乎不会用到。","拼写上 haemochrome 是英式写法；美式更常见对应写法是 hemochrome。词根 hemo-/haemo- 来自希腊语，表示“血”。"]}
{"word":"haemocoel","summary":{"en":"A body cavity in many invertebrates where hemolymph circulates and bathes organs.","zh":"许多无脊椎动物的体腔，血淋巴在其中循环并直接浸润器官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) The main body cavity of many invertebrates (especially arthropods and most mollusks) where hemolymph circulates and directly bathes internal organs.","zh":"（生物）血腔：许多无脊椎动物（尤其是节肢动物和大多数软体动物）的主要体腔，体液（血淋巴）在其中循环，并直接浸润、包围内脏器官。"},"examples":[{"en":"In insects, the haemocoel contains hemolymph instead of blood in closed vessels.","zh":"在昆虫中，血腔里循环的是血淋巴，而不是在封闭血管中流动的血液。"},{"en":"The heart pumps hemolymph into the haemocoel to deliver nutrients and remove wastes.","zh":"心脏将血淋巴泵入血腔，以输送营养并带走代谢废物。"}]}],"synonyms":["hemocoel"],"phonetic":"/ˈhiːməˌsiːl/","extraExplanation":["词源：haemo-（血）+ -coel（体腔）。美式英语更常拼作 hemocoel；英式/学术场合也常见 haemocoel。","概念对比：haemocoel 通常与“开放式循环系统”相关；与脊椎动物那种血液主要在血管内循环的“封闭式循环系统”不同。","相关词：hemolymph（血淋巴）、open circulatory system（开放式循环系统）、coelom（真体腔）。"]}
{"word":"haemoconcentration","summary":{"en":"Haemoconcentration is a medical term for blood becoming more concentrated because plasma (fluid) decreases, often due to dehydration.","zh":"Haemoconcentration 指由于血浆（液体）减少而使血液变得更“浓”，常见原因是脱水等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an increase in the concentration of red blood cells and other blood components because the liquid part of the blood (plasma) has decreased","zh":"（血液）血液浓缩；由于血浆减少而导致红细胞及其他成分在血液中的浓度升高"},"examples":[{"en":"Dehydration can cause haemoconcentration, making the blood thicker.","zh":"脱水会导致血液浓缩，使血液变得更黏稠。"},{"en":"The doctor monitored signs of haemoconcentration after severe vomiting.","zh":"严重呕吐后，医生监测是否出现血液浓缩的迹象。"}]}],"synonyms":["hemoconcentration","blood concentration (medical context)"],"phonetic":"/ˌhiːmoʊˌkɑnsənˈtreɪʃən/","extraExplanation":["英式拼写：haemoconcentration（美式更常写作 hemoconcentration）。","构词提示：haemo-（血）+ concentration（浓缩）。医学语境里常与“脱水、休克、烧伤、利尿”相关，用于描述血浆减少导致的“相对性”血细胞比例升高。","相关检测指标常见有 hematocrit/haematocrit（血细胞比容）升高；与之相对的概念是 hemodilution/haemodilution（血液稀释）。"]}
{"word":"haemocyanin","summary":{"en":"Haemocyanin is a copper-based oxygen-carrying protein in many invertebrates, often linked to blue-looking blood.","zh":"Haemocyanin（血蓝蛋白）是许多无脊椎动物体内含铜的载氧蛋白，常与“蓝色体液/血液”现象相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A copper-containing protein in the blood (or other body fluid) of many invertebrates that carries oxygen; it often makes the blood look blue when oxygenated.","zh":"一种含铜的载氧蛋白，存在于许多无脊椎动物的血液或体液中，用来运输氧气；在含氧状态下常使体液呈蓝色。"},"examples":[{"en":"Octopuses use haemocyanin to transport oxygen through their bodies.","zh":"章鱼用血蓝蛋白（haemocyanin）在体内运输氧气。"},{"en":"Unlike human hemoglobin, haemocyanin contains copper instead of iron.","zh":"与人类的血红蛋白不同，血蓝蛋白含的是铜而不是铁。"},{"en":"The crab’s blood can appear blue because of oxygenated haemocyanin.","zh":"螃蟹的体液可能呈蓝色，是因为含氧的血蓝蛋白。"}]}],"synonyms":["hemocyanin","blood protein","oxygen-carrying protein"],"phonetic":"/ˌhiːməˈsaɪənɪn/","extraExplanation":["haemocyanin 是英式拼写；美式更常写作 hemocyanin。","它常见于软体动物（如章鱼、贝类）和节肢动物（如螃蟹、蜘蛛）的血液/血淋巴中；与脊椎动物主要使用的 hemoglobin（血红蛋白）不同。","由于结合氧时呈蓝色，常被科普文章用来解释“蓝色的血”现象；但这并不意味着动物的血液像颜料那样纯蓝，颜色也会受浓度与环境影响。"]}
{"word":"haemocyte","summary":{"en":"A haemocyte is a blood cell, especially in invertebrates, important for immunity and healing.","zh":"haemocyte 指血细胞，尤指无脊椎动物体内的血细胞，与免疫和修复有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blood cell, especially one found in invertebrates (such as insects, crustaceans, and mollusks), involved in immunity and wound healing","zh":"血细胞；（尤指）无脊椎动物（如昆虫、甲壳类、软体动物）体内的血细胞，参与免疫防御与伤口修复"},"examples":[{"en":"Researchers counted haemocytes to measure the insect’s immune response.","zh":"研究人员通过计数血细胞来衡量昆虫的免疫反应。"},{"en":"Haemocytes can help seal a wound by forming a clot-like plug in some invertebrates.","zh":"在一些无脊椎动物中，血细胞可通过形成类似凝块的堵塞物来帮助封闭伤口。"}]}],"synonyms":["hemocyte","blood cell"],"phonetic":"/ˈhiːməˌsaɪt/","extraExplanation":["词源上，haemo- 表示“血”，-cyte 表示“细胞”，合起来就是“血细胞”。在生物学论文中常见，尤其是昆虫学与无脊椎动物免疫学。","拼写 haemocyte 多见于英式英语；美式英语中也可能写作 hemocyte，含义相同。"]}
{"word":"haemocytoblast","summary":{"en":"A haemocytoblast is an early blood-forming cell that can develop into different types of blood cells.","zh":"haemocytoblast 指早期的造血原始细胞，可分化为多种血细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very early blood-forming cell in the bone marrow that can develop into different kinds of blood cells (similar to a hematopoietic stem cell).","zh":"（骨髓中的）造血母细胞/血细胞原始细胞：一种非常早期的造血细胞，可分化为多种血细胞（类似“造血干细胞”）。"},"examples":[{"en":"In basic biology, a haemocytoblast can give rise to red blood cells, white blood cells, and platelets.","zh":"在基础生物学中，haemocytoblast 可以分化产生红细胞、白细胞和血小板。"},{"en":"The diagram shows a haemocytoblast at the start of the blood cell development pathway.","zh":"这张示意图展示了血细胞发育路径起点的 haemocytoblast。"}]}],"synonyms":["hemocytoblast","hematopoietic stem cell","blood stem cell"],"phonetic":"/ˌhiːməˈsaɪtəˌblæst/","extraExplanation":["该词多见于较旧或英式拼写的教材与资料：haemo- 为英式写法，美式常写作 hemo-。在现代医学与生物学语境中，更常用的对应术语是 “hematopoietic stem cell（造血干细胞）” 或 “hemocytoblast（血细胞原始细胞）”。","词源上：haemo-/hemo- 来自希腊语表示“血”，-cyto- 表示“细胞”，-blast 表示“未成熟/原始细胞”。"]}
{"word":"haemocytoblastic","summary":{"en":"A medical adjective meaning “related to early blood-forming stem cells (hemocytoblasts) or blood-cell formation.”","zh":"医学用语：指“与早期造血干细胞（血细胞母细胞）或造血/形成血细胞过程有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hemocytoblast (an early blood-forming stem cell) or the process of forming blood cells from such cells.","zh":"与血细胞母细胞（早期造血干细胞）有关的；或指由这类细胞进行造血/形成血细胞的。"},"examples":[{"en":"The report discussed haemocytoblastic activity in the bone marrow.","zh":"报告讨论了骨髓中的血细胞母细胞造血活动。"},{"en":"Researchers measured haemocytoblastic differentiation into red and white blood cells.","zh":"研究人员测量了血细胞母细胞向红细胞和白细胞分化的过程。"}]}],"synonyms":["hematopoietic","haematopoietic","blood-forming","stem-cell-related"],"phonetic":"/ˌhiːməˌsaɪtoʊˈblæstɪk/","extraExplanation":["这是一个医学/生物学领域的罕见形容词，来自 haemocyte（血细胞）+ -blast（母细胞/胚芽细胞）+ -ic（……的）。常见近义表达通常用更通用的 haematopoietic/hematopoietic（造血的）。","英式拼写常用 haem-，美式多写 hem-（例如 haemoglobin vs hemoglobin）。"]}
{"word":"haemocytometer","summary":{"en":"A haemocytometer is a microscope slide with a ruled grid used to count cells in a known volume.","zh":"haemocytometer 指带刻线网格的显微计数板，用于在已知体积内计数细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A special counting chamber (a thick microscope slide) with a precise grid, used to count cells or tiny particles in a known volume of liquid under a microscope.","zh":"血细胞计数板（血球计数板）：一种带有精密刻线网格的加厚载玻片，用于在显微镜下在已知体积内计数细胞或微小颗粒。"},"examples":[{"en":"We used a haemocytometer to count yeast cells before starting the fermentation.","zh":"我们在开始发酵前用血细胞计数板来计数酵母细胞。"},{"en":"After mixing the sample with a dye, she loaded it into the haemocytometer and counted live cells.","zh":"将样品与染料混匀后，她把样品加到血细胞计数板上并统计活细胞数量。"}]}],"synonyms":["hemocytometer","counting chamber","Neubauer chamber"],"phonetic":"/ˌhiːməˈsaɪˌtɑːmɪtər/","extraExplanation":["英式拼写为 haemocytometer，美式更常见写法是 hemocytometer。","词源可拆分理解：haemo-/hemo-（血）+ cyto-（细胞）+ -meter（测量工具）。最早用于血细胞计数，后来也广泛用于细胞培养、酵母、藻类等的计数。","实验语境里常会提到 Neubauer chamber（纽鲍尔计数板），这是最常见的一种 haemocytometer 设计规格。"]}
{"word":"haemodialysis","summary":{"en":"Haemodialysis is a treatment that uses a machine to clean the blood when the kidneys are not working well.","zh":"Haemodialysis 指“血液透析”，用机器在肾功能不佳时帮助清除血液中的废物与多余水分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical treatment that uses a machine (dialyzer) to filter waste, extra water, and salts from the blood when the kidneys cannot do this well","zh":"血液透析：当肾脏无法良好过滤血液时，使用机器（透析器）把血液中的代谢废物、多余水分和盐分过滤掉的一种治疗方式"},"examples":[{"en":"My father goes to the hospital for haemodialysis three times a week.","zh":"我父亲每周去医院做三次血液透析。"},{"en":"Some people feel tired after haemodialysis, so they rest afterward.","zh":"有些人做完血液透析后会觉得疲惫，所以会休息一下。"},{"en":"The doctor explained how haemodialysis can help control fluid levels in the body.","zh":"医生解释了血液透析如何帮助控制体内的水分水平。"}]}],"synonyms":["hemodialysis","dialysis"],"phonetic":"/ˌhiːmoʊdaɪˈæləsɪs/","extraExplanation":["英式拼写为 haemodialysis；美式更常写作 hemodialysis（去掉 ae）。两者意思相同。","词源：haemo-/hemo- 表示“血”，dialysis 表示“透析、分离”。合在一起就是“血液透析”。","常见语境：多用于慢性肾病（尤其是终末期肾病）患者；一般在透析中心定期进行，也可能在医院急诊情况下使用。","相关词：peritoneal dialysis（腹膜透析，另一种透析方式）；dialyzer（透析器/人工肾）；fistula（动静脉内瘘，常见的血管通路）。"]}
{"word":"haemodilution","summary":{"en":"Haemodilution is the dilution of blood, often from added fluids, which lowers measured concentrations like hemoglobin.","zh":"Haemodilution 指血液被稀释，常因补液等导致，使血红蛋白等指标的测量浓度下降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of diluting the blood (lowering the concentration of red blood cells and other components), usually because extra fluid is added to the bloodstream","zh":"血液稀释（血液被稀释，使红细胞等成分的浓度下降），通常因血液中加入了更多液体而发生"},"examples":[{"en":"After receiving a large amount of IV fluids, the patient showed signs of haemodilution.","zh":"在输入大量静脉补液后，患者出现了血液稀释的迹象。"},{"en":"Haemodilution can make hemoglobin levels look lower than they truly are.","zh":"血液稀释可能让血红蛋白水平看起来比实际更低。"}]},{"partOfSpeech":"n.","definition":{"en":"a medical strategy in which blood is intentionally diluted to reduce blood viscosity and improve circulation in certain situations","zh":"（医疗策略）有意进行血液稀释，以降低血液黏稠度并在特定情况下改善循环"},"examples":[{"en":"In some surgeries, controlled haemodilution may be used to reduce the need for a blood transfusion.","zh":"在一些手术中，可能会采用控制性血液稀释来减少输血需求。"},{"en":"The doctor explained the risks and benefits of therapeutic haemodilution.","zh":"医生解释了治疗性血液稀释的风险与益处。"}]}],"synonyms":["hemodilution","blood dilution","dilution of blood"],"phonetic":"/ˌhiːmoʊdaɪˈluːʃən/","extraExplanation":["英式拼写为 haemodilution；美式更常写作 hemodilution（haemo- / hemo- 都与“血”有关）。","在化验结果解读上要注意：大量补液后，血红蛋白、红细胞压积（hematocrit）等可能因“被稀释”而下降，并不一定代表真正的失血或贫血恶化。"]}
{"word":"haemodoraceae","summary":{"en":"Haemodoraceae is the botanical family name for the bloodroot family, including plants like kangaroo paw.","zh":"Haemodoraceae 是血根科的植物学科名，包含袋鼠爪等植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flowering plants (the bloodroot family) that includes genera such as kangaroo paw and bloodroot, many of which have red pigments in their roots or sap","zh":"一类开花植物科（常称“血根科/血根类植物科”），包含袋鼠爪等属；其中不少植物的根或汁液带红色素"},"examples":[{"en":"Kangaroo paw belongs to the plant family Haemodoraceae.","zh":"袋鼠爪属于血根科（Haemodoraceae）。"},{"en":"Some Haemodoraceae species are grown as ornamental plants because of their unusual flowers.","zh":"一些血根科植物因花形独特而作为观赏植物栽培。"}]}],"synonyms":["bloodroot family"],"phonetic":"/ˌhiːməˌdoʊˈreɪsi.iː/","extraExplanation":["词源提示：haemo- 来自希腊语，意思是“血”；-dor- 与“皮/皮肤”相关，-aceae 是植物科名常见后缀（如 Rosaceae 蔷薇科）。该科名与一些成员根部或汁液呈红色这一特征有关。","用法说明：Haemodoraceae 多用于植物学/园艺学语境，通常首字母大写并作为拉丁学名科名使用。"]}
{"word":"haemodoraceous","summary":{"en":"“Haemodoraceous” means “related to the bloodwort family (Haemodoraceae).”","zh":"“haemodoraceous”意为“与血草科（Haemodoraceae）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Haemodoraceae (the bloodwort family).","zh":"（形容词）与血草科（Haemodoraceae，bloodwort family）植物有关的。"},"examples":[{"en":"Haemodoraceous plants are known for their sometimes red-staining roots or sap.","zh":"血草科植物有时以会染红的根或汁液而闻名。"},{"en":"The botanist compared haemodoraceous species from Australia and South Africa.","zh":"这位植物学家比较了来自澳大利亚和南非的血草科物种。"}]}],"synonyms":["Haemodoraceae-related","bloodwort-family (related)"],"phonetic":"/ˌhiːmədoʊˈreɪʃəs/","extraExplanation":["这是一个较少见的植物学形容词，来自科名 Haemodoraceae + -ous（“……的”）。主要用于学术写作或植物分类语境。","英式拼写常见 haem-，美式常见 hemo-（如 hemoglobin/haemoglobin）；两者指向同源的“血”这一词根。"]}
{"word":"haemodynamic","summary":{"en":"Haemodynamic means related to blood flow and the pressures/forces in the circulatory system.","zh":"Haemodynamic 指与血液循环中的血流及其压力/力学因素相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the movement (flow) of blood and the forces/pressures involved in circulation, especially in a medical context.","zh":"（医学）血流动力学的；与血液在循环中的流动及其压力、阻力等力学因素有关的。"},"examples":[{"en":"The patient is haemodynamically stable after surgery.","zh":"手术后该患者的血流动力学状况稳定。"},{"en":"Doctors monitored haemodynamic changes during anesthesia.","zh":"医生在麻醉过程中监测血流动力学变化。"},{"en":"Low blood pressure can cause haemodynamic compromise.","zh":"低血压可能导致血流动力学受损（循环不稳定）。"}]}],"synonyms":["hemodynamic","circulatory"],"phonetic":"/ˌhiːmədaɪˈnæmɪk/","extraExplanation":["“haemodynamic”是英式拼写；美式更常写作“hemodynamic”。两者意思相同，医学文章或病历里都很常见。","临床里常见搭配：haemodynamic stability（血流动力学稳定）、haemodynamic monitoring（血流动力学监测）、haemodynamic status（血流动力学状态）。"]}
{"word":"haemodynamics","summary":{"en":"Haemodynamics means the study and measurement of blood flow and circulation in the body, especially involving the heart and blood vessels.","zh":"Haemodynamics（血流动力学）指研究与评估人体血液循环与血流情况，尤其涉及心脏与血管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of how blood flows through the heart and blood vessels, including factors like blood pressure, blood volume, and resistance","zh":"血流动力学；研究血液在心脏与血管中如何流动的学科，包括血压、血容量与血管阻力等因素"},"examples":[{"en":"Doctors monitored the patient’s haemodynamics during surgery.","zh":"医生在手术过程中监测了患者的血流动力学情况。"},{"en":"Severe bleeding can cause unstable haemodynamics and lead to shock.","zh":"严重出血会导致血流动力学不稳定，并可能引发休克。"},{"en":"The drug improved haemodynamics by lowering blood pressure and reducing strain on the heart.","zh":"这种药物通过降低血压、减轻心脏负担来改善血流动力学。"}]}],"synonyms":["hemodynamics","blood flow dynamics","circulatory dynamics"],"phonetic":"/ˌhiːməˈdaɪnəmɪks/","extraExplanation":["“Haemodynamics”是英式拼写；美式更常写作“hemodynamics”。两者意义相同。","常见搭配：stable/unstable haemodynamics（血流动力学稳定/不稳定）、haemodynamic monitoring（血流动力学监测）、haemodynamic response（血流动力学反应）。","在医学语境里，它常用于重症监护、麻醉、心脏病学等领域，用来判断循环系统是否能有效供血与供氧。"]}
{"word":"haemoflagellate","summary":{"en":"A haemoflagellate is a flagellated protozoan that lives in the blood, often as a parasite.","zh":"haemoflagellate 指生活在血液中的鞭毛原生动物，常为寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flagellated protozoan (single-celled organism) that lives in the blood, often as a parasite in humans or animals","zh":"血液鞭毛虫（生活在血液中的鞭毛原生动物，常为人或动物的寄生虫）"},"examples":[{"en":"Trypanosoma is a haemoflagellate transmitted by the tsetse fly.","zh":"锥虫是一种由采采蝇传播的血液鞭毛虫。"},{"en":"The doctor ordered a blood smear to look for haemoflagellates.","zh":"医生要求做血涂片检查以寻找血液鞭毛虫。"}]}],"synonyms":["blood flagellate","hemoflagellate (US spelling)"],"phonetic":"/ˌhiːmoʊˈflædʒəleɪt/","extraExplanation":["这个词主要用于医学、寄生虫学和热带病学语境，日常英语里很少见。常见的“haemoflagellates/血液鞭毛虫”包括锥虫（Trypanosoma）和利什曼原虫（Leishmania 的某些阶段）；它们可通过昆虫叮咬传播，引起如非洲昏睡病、查加斯病、利什曼病等。","词形上：haemo- 表示“血”（美式拼写常写作 hemo-），flagellate 与“鞭毛（flagellum）”有关，强调这类微生物能用鞭毛运动。"]}
{"word":"haemoglobic","summary":{"en":"“Haemoglobic” means “related to hemoglobin.”","zh":"“haemoglobic”表示“与血红蛋白有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hemoglobin (the protein in red blood cells that carries oxygen).","zh":"与血红蛋白有关的；血红蛋白的（血红蛋白是红细胞中运输氧气的蛋白质）。"},"examples":[{"en":"The doctor ordered tests to check her haemoglobic levels.","zh":"医生安排了检查来检测她的血红蛋白水平。"},{"en":"Haemoglobic disorders can affect how well the body transports oxygen.","zh":"血红蛋白相关的疾病会影响身体运输氧气的能力。"}]}],"synonyms":["hemoglobin-related","haemoglobin-related","hemoglobinous"],"phonetic":"/ˌhiːməˈɡloʊbɪk/","extraExplanation":["“haemoglobic”较少见，更常见的写法/用法是“hemoglobin/haemoglobin”（名词）以及“hemoglobin-related / haemoglobin-related”（形容词短语）。","拼写提示：英式英语常用“haemo-”（如 haemoglobin），美式英语多用“hemo-”（如 hemoglobin）。"]}
{"word":"haemoglobin","summary":{"en":"Haemoglobin is the oxygen-carrying protein in red blood cells; US spelling: hemoglobin.","zh":"haemoglobin 指红细胞中运输氧气的蛋白质（血红蛋白）；美式拼写为 hemoglobin。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein in red blood cells that carries oxygen from the lungs to the rest of the body (and brings some carbon dioxide back). In American English, it is usually spelled “hemoglobin.”","zh":"血红蛋白：存在于红细胞中的一种蛋白质，负责把氧气从肺部运送到全身（并带回部分二氧化碳）。美式英语通常拼作 hemoglobin。"},"examples":[{"en":"Low haemoglobin can make you feel tired or weak.","zh":"血红蛋白偏低会让你感到疲劳或虚弱。"},{"en":"The doctor ordered a blood test to check her haemoglobin level.","zh":"医生开了血液检查来测她的血红蛋白水平。"},{"en":"Haemoglobin binds to oxygen in the lungs and releases it in the tissues.","zh":"血红蛋白在肺部与氧结合，并在组织中释放氧。"}]}],"synonyms":["hemoglobin","Hb"],"phonetic":"/ˌhiːməˈɡloʊbɪn/","extraExplanation":["“haemoglobin”是英式拼写；“haem-”源自希腊语，和“血”有关（同根词如 haemorrhage/hemorrhage 出血）。在医学检验里常写作 Hb（如 HbA1c 是糖化血红蛋白，用于评估一段时间内的血糖控制）。","你可能会看到“haemoglobin/hemoglobin”的不同形式：haemoglobin（英式）、hemoglobin（美式）；发音在口语中基本一致。"]}
{"word":"haemoglobinous","summary":{"en":"An adjective meaning “related to or containing hemoglobin.”","zh":"形容词：表示“与血红蛋白有关的；含血红蛋白的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, containing, or characterized by hemoglobin (the oxygen-carrying protein in red blood cells).","zh":"与血红蛋白有关的；含有血红蛋白的；以血红蛋白为特征的。"},"examples":[{"en":"Researchers measured haemoglobinous pigments in the blood sample.","zh":"研究人员测量了该血样中的含血红蛋白色素。"},{"en":"The stain was described as haemoglobinous, suggesting it came from blood.","zh":"该污渍被描述为含血红蛋白的，暗示它来自血液。"}]}],"synonyms":["hemoglobinous","hemoglobin-related","blood-related (context-dependent)"],"phonetic":"/ˌhiːməˈɡloʊbɪnəs/","extraExplanation":["“haemoglobinous”多见于医学/生物学写作，较正式且偏专业。日常英语里更常用的是 “hemoglobin/haemoglobin-related” 或直接说 “containing hemoglobin”。","拼写上，“haemoglobinous”使用英式/传统拼写 “haemo-”；美式通常写作 “hemoglobinous”（去掉 a）。"]}
{"word":"haemoglobinuria","summary":{"en":"Haemoglobinuria means hemoglobin is present in the urine, often causing dark or reddish urine, usually linked to red blood cell breakdown.","zh":"Haemoglobinuria 指尿液中出现血红蛋白，常导致尿色变深或发红，通常与红细胞破坏（溶血）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the presence of hemoglobin (the oxygen-carrying protein in red blood cells) in the urine, often making the urine look red, brown, or cola-colored","zh":"血红蛋白尿：尿液中出现血红蛋白（红细胞中携带氧气的蛋白质），常使尿液呈红色、棕色或可乐色"},"examples":[{"en":"The doctor suspected haemoglobinuria when the urine turned dark brown after severe hemolysis.","zh":"当出现严重溶血后尿液变成深棕色时，医生怀疑是血红蛋白尿。"},{"en":"Haemoglobinuria is different from blood in the urine because the red blood cells may not be intact.","zh":"血红蛋白尿不同于“尿中有血”，因为红细胞可能并不完整存在于尿液中。"}]}],"synonyms":["hemoglobinuria"],"phonetic":"/hiˌmoʊɡləˌbɪnˈjʊriə/","extraExplanation":["词源与拼写：haemoglobinuria 是英式拼写（haemo-）；美式更常写作 hemoglobinuria（hemo-）。","常见相关原因（学习用概览）：多与“溶血”有关，即红细胞被破坏后释放血红蛋白进入血液，随后经肾脏排出；也可见于某些感染、药物反应、输血反应、剧烈运动或罕见血液病等情境。","与 hematuria（血尿）的区别要点：hematuria 通常指尿里有完整红细胞；haemoglobinuria 指尿里主要是游离血红蛋白。临床上常通过尿检/显微镜检查来区分。"]}
{"word":"haemogram","summary":{"en":"A haemogram is a blood test report showing blood cell counts and related measures (similar to a CBC).","zh":"haemogram 指血象/血常规检查报告，显示血细胞计数及相关指标（与 CBC 类似）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical report or test result that shows counts and measurements of blood cells (such as red blood cells, white blood cells, hemoglobin, and platelets), often used to help diagnose illness or monitor treatment","zh":"（血液检查的）血象／血常规报告：显示血细胞计数与相关指标（如红细胞、白细胞、血红蛋白、血小板等），用于辅助诊断或监测治疗"},"examples":[{"en":"The doctor ordered a haemogram to check for infection and anemia.","zh":"医生开了血常规（血象）检查，以排查感染和贫血。"},{"en":"Her haemogram showed a high white blood cell count.","zh":"她的血常规显示白细胞计数偏高。"}]}],"synonyms":["hemogram","complete blood count (CBC)","blood count"],"phonetic":"/ˈhiːməˌɡræm/","extraExplanation":["“haemogram”多见于英式拼写；美式更常写作“hemogram”。在临床语境中，它通常与“CBC (complete blood count, 全血细胞计数/血常规)”含义非常接近，但具体项目可能因医院与地区而略有不同。"]}
{"word":"haemogregarina","summary":{"en":"Haemogregarina: a genus of protozoan blood parasites found especially in reptiles and amphibians.","zh":"Haemogregarina：血液孢子虫属，一类常见于爬行动物和两栖动物的原生动物血液寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of protozoan blood parasites (hemogregarines) that infect reptiles, amphibians, and some other animals, often transmitted by blood-sucking invertebrates such as ticks or leeches","zh":"血液孢子虫属：一类寄生在血液中的原生动物（血孢子虫类群），常感染爬行动物、两栖动物等，通常经蜱、蚂蟥等吸血无脊椎动物传播"},"examples":[{"en":"The vet suspected Haemogregarina infection after examining the reptile’s blood smear.","zh":"兽医在检查爬行动物的血涂片后，怀疑有血液孢子虫属（Haemogregarina）感染。"},{"en":"Some Haemogregarina parasites are linked to tick exposure in wild lizards.","zh":"一些血液孢子虫属寄生虫与野生蜥蜴接触蜱虫有关。"}]}],"synonyms":["hemogregarina","hemogregarine (broader group term)"],"phonetic":"/ˌhiːmoʊˌɡrɛɡəˈraɪnə/","extraExplanation":["该词常见拼写也有 hemogregarina（美式更常见用 hemo-），haemo- 是英式拼写，来自希腊语词根，表示“血”。","在科研或临床语境中，Haemogregarina 通常以属名出现（首字母大写、斜体书写），指特定分类单位；更宽泛的类群名称常用 hemogregarines（血孢子虫）。"]}
{"word":"haemogregarinidae","summary":{"en":"Haemogregarinidae is a scientific name for a family of blood-infecting protozoan parasites.","zh":"Haemogregarinidae 是一个科学分类名，指一科寄生于动物血液的原生动物寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of microscopic parasitic protozoa (haemogregarines) that infect the blood of animals, especially reptiles and amphibians, often transmitted by blood-sucking invertebrates.","zh":"血孢子虫科：一类微小的寄生原生动物（血孢子虫类），寄生在动物血液中，尤以爬行动物和两栖动物常见，常由吸血无脊椎动物传播。"},"examples":[{"en":"Haemogregarinidae parasites can be seen in blood smears of infected reptiles.","zh":"在受感染爬行动物的血涂片中，有时可以观察到血孢子虫科的寄生虫。"},{"en":"Some Haemogregarinidae species are transmitted by ticks or leeches.","zh":"部分血孢子虫科物种可由蜱或水蛭传播。"}]}],"synonyms":["haemogregarines (general group)","haemogregarinids (informal plural)"],"phonetic":"/ˌhiːmoʊˌɡrɛɡəˈrɪnɪˌdiː/","extraExplanation":["这是一个生物分类学名词（科名），多见于寄生虫学、兽医学与野生动物疾病研究。英文文献中常以斜体或首字母大写表示其分类地位（如 Haemogregarinidae）。","词形来源：haemo-/hemo- 表示“血”，gregarine 指一类孢子虫样寄生生物；整体含义可理解为“与血相关的格里加林类寄生虫”。"]}
{"word":"haemoid","summary":{"en":"Haemoid means “blood-like,” especially in scientific or medical descriptions.","zh":"haemoid 指“类似血的（血样的）”，多用于医学或科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a substance or structure) resembling blood in color or appearance; blood-like.","zh":"（指物质或结构）在颜色或外观上类似血的；血样的。"},"examples":[{"en":"The lab report mentioned a haemoid fluid in the sample.","zh":"实验室报告提到样本中有一种呈血样的液体。"},{"en":"Under the microscope, the tissue showed a haemoid staining pattern.","zh":"在显微镜下，这种组织呈现出血样的染色模式。"}]}],"synonyms":["bloodlike","hemoid","sanguineous"],"phonetic":"/ˈhiːmɔɪd/","extraExplanation":["“haemoid”较少见，更多时候会看到拼写变体“hemoid”。它由词根“haemo- / hemo-”（血）加后缀“-oid”（……样的、类似……的）构成，常见于医学或生物学的描述性语境。"]}
{"word":"haemolysin","summary":{"en":"Haemolysin is a microbe-produced substance that breaks open red blood cells.","zh":"Haemolysin（溶血素）是微生物产生、能使红细胞破裂并导致溶血的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often a toxin or enzyme) produced by some microbes that can break open red blood cells (cause hemolysis).","zh":"（常为毒素或酶类的）溶血素：由某些微生物产生、能破坏红细胞并导致溶血的物质。"},"examples":[{"en":"Some strains of Streptococcus produce haemolysin that damages red blood cells.","zh":"某些链球菌菌株会产生溶血素，从而损伤红细胞。"},{"en":"In the lab, haemolysin activity can be suggested by clear zones around colonies on blood agar.","zh":"在实验室里，血琼脂平板上菌落周围出现透明溶血环，可能提示存在溶血素活性。"}]}],"synonyms":["hemolysin","haemolytic toxin","erythrocyte-lysing toxin"],"phonetic":"/hiˈmɑːləsaɪn/","extraExplanation":["英式拼写为 haemolysin，美式拼写更常见的是 hemolysin；两者含义相同。","词源：haemo-（血）+ -lysin（溶解、裂解）。在微生物学中常用于解释细菌如何破坏宿主细胞并增强致病性。","与培养皿上的溶血类型相关：β-溶血通常表现为完全溶血（透明环），α-溶血为部分溶血（偏绿色），这些现象常用于初步鉴别细菌。"]}
{"word":"haemolysis","summary":{"en":"Haemolysis means the breaking of red blood cells, either in the body or in a blood sample.","zh":"Haemolysis（溶血）指红细胞破裂，可发生在体内，也可指血样在采集/处理时发生的溶血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the breaking (lysis) of red blood cells, which releases hemoglobin into the blood plasma","zh":"（红细胞的）溶血；红细胞破裂并把血红蛋白释放到血浆中"},"examples":[{"en":"In severe malaria, haemolysis can cause anemia.","zh":"在严重疟疾中，溶血会导致贫血。"},{"en":"The lab report noted signs of haemolysis in the blood sample.","zh":"化验报告指出该血样有溶血迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"damage to a blood sample in which red blood cells break during or after collection (for example, from rough handling), which can affect test results","zh":"（检验中）样本溶血；采血过程中或采血后因处理不当等导致红细胞破裂，从而影响检测结果"},"examples":[{"en":"The nurse repeated the test because haemolysis may have altered the potassium reading.","zh":"护士重新做了检测，因为样本溶血可能影响了钾的结果。"},{"en":"Avoid shaking the tube to reduce the risk of haemolysis.","zh":"避免摇晃采血管，以降低样本溶血的风险。"}]}],"synonyms":["hemolysis","red blood cell lysis","RBC lysis"],"phonetic":"/hiːˈmɑːlɪsɪs/","extraExplanation":["“haemolysis”是英式拼写；美式拼写更常见的是“hemolysis”。两者意思相同。","词源可拆分理解：haemo-/hemo-（血）+ -lysis（溶解、分解）。医学文章中常与“anemia（贫血）”“jaundice（黄疸）”“hemoglobin（血红蛋白）”等一起出现。"]}
{"word":"haemolytic","summary":{"en":"Haemolytic means “related to or causing the destruction of red blood cells.”","zh":"haemolytic 意为“与红细胞破坏（溶血）有关的；或引起溶血的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Relating to, or causing, the destruction (lysis) of red blood cells (hemolysis).","zh":"（医学）与红细胞破坏（溶血）有关的；或会引起红细胞破坏的。"},"examples":[{"en":"Some infections can trigger a haemolytic reaction in the body.","zh":"有些感染会在体内引发溶血反应。"},{"en":"The doctor suspected haemolytic anemia after seeing the lab results.","zh":"医生在看到化验结果后怀疑是溶血性贫血。"}]}],"synonyms":["hemolytic","blood-cell–destroying"],"phonetic":"/ˌhiːməˈlɪtɪk/","extraExplanation":["英式拼写是 haemolytic，美式更常写作 hemolytic；两者意思相同。","词根拆分有助记忆：haemo-/hemo-（血）+ -lytic（溶解、破坏）。常见搭配：haemolytic anemia（溶血性贫血）、haemolytic disease of the newborn（新生儿溶血病）、haemolytic transfusion reaction（溶血性输血反应）。"]}
{"word":"haemometer","summary":{"en":"A haemometer is an instrument for measuring hemoglobin in blood.","zh":"haemometer 指测量血液中血红蛋白含量的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used to measure the amount of hemoglobin in blood (often used in medical testing)","zh":"血红蛋白计；用于测量血液中血红蛋白含量的仪器（常用于医学检测）"},"examples":[{"en":"The clinic used a haemometer to estimate the patient’s hemoglobin level.","zh":"诊所用血红蛋白计来估算病人的血红蛋白水平。"},{"en":"A haemometer reading can help doctors check for anemia.","zh":"血红蛋白计的读数可以帮助医生检查是否贫血。"}]}],"synonyms":["hemometer","hemoglobinometer"],"phonetic":"/hiˈmɑːmɪtər/","extraExplanation":["该词主要见于英式拼写（haem-），美式拼写更常见为 hemometer。haem- 来自希腊语 haima（血）。在现代临床中，许多传统的“haemometer/hemometer”已被更自动化的血液分析仪或血红蛋白检测仪取代，但在历史或教学语境中仍会出现。"]}
{"word":"haemonchiasis","summary":{"en":"haemonchiasis: a Haemonchus worm infection (mainly in sheep/goats) that can cause anemia.","zh":"haemonchiasis：血矛线虫感染所致的寄生虫病（多见于羊），可引起贫血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a parasitic disease caused by infection with Haemonchus (blood-sucking stomach worms), especially in sheep and goats, often leading to anemia and weakness","zh":"由血矛线虫属（吸血性的胃寄生虫）感染引起的寄生虫病，常见于绵羊和山羊，可导致贫血与虚弱"},"examples":[{"en":"The vet diagnosed haemonchiasis after noticing severe anemia in the goats.","zh":"兽医在发现山羊严重贫血后诊断为血矛线虫病。"},{"en":"Good pasture management can reduce the risk of haemonchiasis in sheep.","zh":"良好的牧场管理能降低绵羊感染血矛线虫病的风险。"},{"en":"Lambs with haemonchiasis may become weak and lose weight quickly.","zh":"患血矛线虫病的羔羊可能会变得虚弱并迅速消瘦。"}]}],"synonyms":["Haemonchus infection","haemonchosis"],"phonetic":"/ˌhiːˌmɑːŋˈkaɪəˌsɪs/","extraExplanation":["“haemonchiasis”主要用于兽医学与畜牧业语境，指感染Haemonchus（常见种为Haemonchus contortus，俗称“barber pole worm/理发杆虫”）所致的疾病；该虫寄生在反刍动物的皱胃并吸血，因此典型后果是贫血、下颌水肿（俗称“bottle jaw/瓶颌”）、体况下降。","词形来源：Haemonchus（属名）+ -iasis（表示“疾病/病症”的后缀，如 psoriasis）。日常英语中较少见，多见于论文、检疫报告、用药说明等。"]}
{"word":"haemonchosis","summary":{"en":"Haemonchosis is a parasitic disease in ruminants (especially sheep/goats) caused by Haemonchus worms that often leads to severe anemia.","zh":"haemonchosis 指反刍动物（尤指羊/山羊）感染血矛线虫而致的寄生虫病，常引起严重贫血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a parasitic disease (mainly in sheep and goats) caused by Haemonchus worms, especially Haemonchus contortus, leading to stomach infection and often severe anemia.","zh":"（主要见于羊、山羊的）血矛线虫病/捻转血矛线虫病，由血矛线虫（尤其是捻转血矛线虫 Haemonchus contortus）寄生引起，感染胃部，常导致严重贫血。"},"examples":[{"en":"The vet suspected haemonchosis because the lambs had pale gums and weakness.","zh":"兽医怀疑是血矛线虫病，因为小羊牙龈发白、很虚弱。"},{"en":"Haemonchosis can cause rapid weight loss and anemia during warm, wet seasons.","zh":"在温暖潮湿的季节，血矛线虫病可能导致快速消瘦和贫血。"}]}],"synonyms":["Haemonchus infection","barber pole worm disease","haemonchiasis"],"phonetic":"/ˌhiːmənˈkoʊsɪs/","extraExplanation":["这是一个兽医学/畜牧学术语，常见于反刍动物（尤其是绵羊和山羊）。“barber pole worm（理发杆虫）”是 Haemonchus contortus 的俗名，因为雌虫体内红白相间、像理发店旋转灯柱。","感染通常发生在第四胃（abomasum，皱胃），虫体吸血引起贫血；临床上常见“下颌水肿（bottle jaw）”、黏膜苍白、精神沉郁等。预防常强调放牧管理与驱虫药合理使用，以减少抗药性风险。"]}
{"word":"haemonchus","summary":{"en":"Haemonchus is a genus of blood-sucking parasitic worms that infect grazing animals, especially sheep and goats.","zh":"Haemonchus（血矛线虫属）是一类吸血的寄生线虫，主要感染放牧动物，尤以绵羊和山羊常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic roundworms (nematodes) that live in the stomach of grazing animals (especially sheep and goats) and suck blood, often causing anemia and weight loss.","zh":"（寄生虫）一种寄生于放牧动物（尤指绵羊和山羊）胃内、以吸血为生的线虫属，常导致贫血、消瘦等问题。"},"examples":[{"en":"Haemonchus infections can cause severe anemia in sheep.","zh":"感染血矛线虫可能导致绵羊严重贫血。"},{"en":"The vet tested the goats for Haemonchus after several animals became weak.","zh":"几只山羊变得虚弱后，兽医检测它们是否感染了血矛线虫。"}]}],"synonyms":["barber pole worm (common name for Haemonchus contortus)","blood-sucking stomach worm"],"phonetic":"/hiːˈmɑːŋkəs/","extraExplanation":["“Haemonchus”常见于兽医学与畜牧业语境；最有名的种是 Haemonchus contortus，英文常称“barber pole worm（理发杆虫）”，因雌虫体内红白相间像理发店转柱。","该寄生虫在温暖潮湿地区更常见；控制通常结合粪检、轮牧与合理使用驱虫药，以减少抗药性风险。"]}
{"word":"haemony","summary":{"en":"Hegemony means dominance or leading influence, especially by one country or group over others.","zh":"Hegemony 指支配或主导影响力，尤指一个国家或团体对他者的霸权或领导地位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"leadership or dominance (especially by one country, group, or organization) over others","zh":"（尤指国家、集团或组织对他者的）领导地位；支配；霸权"},"examples":[{"en":"The country sought hegemony in the region through trade and military power.","zh":"这个国家试图通过贸易和军事力量在该地区取得霸权。"},{"en":"Some critics argue that cultural hegemony can shape what people see as “normal.”","zh":"一些批评者认为，文化霸权会影响人们把什么看作“正常”。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation where one idea, style, or way of thinking becomes the most influential and widely accepted","zh":"（某种观念、风格或思维方式的）主导地位；压倒性影响"},"examples":[{"en":"For years, the hegemony of one teaching method left little room for experimentation.","zh":"多年来，某一种教学法的主导地位几乎不给实验留空间。"},{"en":"The hegemony of English in international business is increasing.","zh":"英语在国际商务中的主导地位正在增强。"}]}],"synonyms":["dominance","supremacy","leadership","ascendancy"],"phonetic":"/hɪˈdʒɛməni/","extraExplanation":["你输入的“haemony”更常见是拼写错误；正确拼写通常是 **hegemony**。","词源与用法提示：hegemony 来自希腊语，原意与“领导/带头”有关。现代语境里常用于政治（地区或全球“霸权”）、文化研究（如“cultural hegemony/文化霸权”）等。"]}
{"word":"haemophil","summary":{"en":"“Haemophil” is a rare/nonstandard form meaning “a person with hemophilia”; the common spelling is hemophile/haemophile.","zh":"“haemophil”是非常少见/不规范的写法，意思是“血友病患者”；常见拼写为 hemophile（美式）/haemophile（英式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare form) a person with hemophilia; a hemophile.","zh":"（非常少见/不规范写法）血友病患者；血友病人。"},"examples":[{"en":"He is a hemophile, so even small cuts can bleed for a long time.","zh":"他是血友病患者，所以即使很小的伤口也可能出血很久。"},{"en":"Families sometimes learn they carry hemophilia through genetic testing.","zh":"有些家庭会通过基因检测发现自己携带血友病相关基因。"}]}],"synonyms":["hemophile","haemophile","person with hemophilia"],"phonetic":"/ˈhiːməˌfaɪl/","extraExplanation":["“haemophil”在现代英语中不常见，更多时候你会看到拼写为 **hemophile**（美式）或 **haemophile**（英式），意思是“血友病患者”。","词根提示：**haemo-/hemo-** 表示“血”，**-phile** 表示“爱好者/倾向于……的人或物”。不过在医学里，这个词指的是一种遗传性凝血障碍（hemophilia）患者，而不是字面意义上的“爱血”。","相关但不同的词：**Haemophilus**（一种细菌属，如 *Haemophilus influenzae*），不要与 hemophile/haemophile 混淆。"]}
{"word":"haemophile","summary":{"en":"A haemophile is a person with hemophilia (difficulty clotting blood).","zh":"haemophile 指血友病患者（凝血困难，容易出血）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has hemophilia, a medical condition in which the blood does not clot normally and bleeding can be hard to stop","zh":"血友病患者；（因凝血功能异常而）容易出血且不易止血的人"},"examples":[{"en":"He is a haemophile, so even small cuts can require medical attention.","zh":"他是血友病患者，所以即使是小伤口也可能需要就医处理。"},{"en":"Doctors taught the family how to care for a child who is a haemophile.","zh":"医生教这家人如何照顾一名血友病患儿。"}]}],"synonyms":["hemophile","person with hemophilia","hemophiliac"],"phonetic":"/ˈhiːməˌfaɪl/","extraExplanation":["“haemophile”是英式拼写；美式更常写作“hemophile”。这个词在日常交流中较少使用，更常见的说法是“a person with hemophilia（血友病患者）”，在表达上更尊重、也更符合现代医学与社会用语。","词源上，“haemo-/hemo-”与“血”有关，“-phile”有“喜爱/倾向于”的意思；这里不是“喜欢血”，而是历史上用于指“对出血有倾向（容易出血）的人”，属于较旧的医学构词方式。"]}
{"word":"haemophilia","summary":{"en":"Haemophilia is an inherited disorder where blood doesn’t clot properly, causing prolonged bleeding.","zh":"Haemophilia（血友病）是一种常见为遗传性的凝血障碍，会导致出血时间异常延长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which a person’s blood does not clot normally, so they may bleed for a long time after an injury (often an inherited disorder)","zh":"（血友病）一种凝血功能异常的疾病，受伤后出血不易停止（常为遗传性疾病）"},"examples":[{"en":"He has haemophilia, so even small cuts can be dangerous without proper treatment.","zh":"他患有血友病，所以如果没有恰当治疗，即使小伤口也可能有危险。"},{"en":"People with haemophilia may need clotting-factor medicine to prevent serious bleeding.","zh":"血友病患者可能需要补充凝血因子类药物来预防严重出血。"}]}],"synonyms":["hemophilia","bleeding disorder"],"phonetic":"/ˌhiːməˈfɪliə/","extraExplanation":["“haemophilia”是英式拼写，美式常写作“hemophilia”。词源来自希腊语：haima（血）+ philia（爱/倾向），意思是“容易出血的倾向”。","历史上，血友病因其在欧洲王室家族中传播而被称为“royal disease（王室病）”，但它并不只发生在王室家庭。","日常交流中，这个词多用于医学语境；如果只想表达“很容易流血/淤青”，更自然的说法是“bleed easily”或“bruise easily”。"]}
{"word":"haemophiliac","summary":{"en":"A haemophiliac is someone with hemophilia, a condition that makes bleeding hard to stop; it can also be used as an adjective meaning “related to hemophilia.”","zh":"haemophiliac 指血友病患者，也可作形容词表示“与血友病有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has hemophilia, a genetic condition in which the blood does not clot normally and bleeding can be hard to stop","zh":"血友病患者；患有血友病的人（多为遗传性凝血功能障碍，出血不易止住）"},"examples":[{"en":"He is a haemophiliac, so doctors are very careful during surgery.","zh":"他是血友病患者，所以医生在手术时会非常谨慎。"},{"en":"In the past, some haemophiliacs became ill from contaminated blood products.","zh":"过去，一些血友病患者因受污染的血液制品而患病。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or affecting someone with hemophilia","zh":"与血友病（患者）有关的；血友病的"},"examples":[{"en":"The clinic provides specialised care for haemophiliac patients.","zh":"这家诊所为血友病患者提供专门护理。"}]}],"synonyms":["person with hemophilia","hemophiliac"],"phonetic":"/ˌhiːməˈfɪliæk/","extraExplanation":["英式拼写为 haemophiliac，美式拼写通常为 hemophiliac；但读音与用法基本一致。","词源来自希腊语：haemo-（血）+ -philia（爱、倾向），字面含义接近“对出血有倾向”，用来描述容易出血且不易止血的体质。","文化/历史背景：血友病曾在欧洲王室家族中较为知名（被称为“王室病”），但它并不只发生在特定群体，现代医学可通过凝血因子治疗与预防性用药大幅改善生活质量。"]}
{"word":"haemophilic","summary":{"en":"“Haemophilic” means related to or affected by hemophilia (difficulty clotting blood).","zh":"“haemophilic”意为“与血友病有关的；患血友病的”，强调凝血困难、易/久出血。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or relating to hemophilia, a medical condition in which the blood does not clot normally (so bleeding can last longer than usual).","zh":"（患有）血友病的；与血友病有关的。血友病是一种凝血功能异常的疾病，出血后更难止血。"},"examples":[{"en":"He is haemophilic, so even a small cut can cause prolonged bleeding.","zh":"他患有血友病，所以即使是小伤口也可能出血很久。"},{"en":"The doctor noted a haemophilic tendency in the patient’s family history.","zh":"医生在病人的家族史中记录到血友病倾向。"}]}],"synonyms":["hemophilic","bleeder (informal, can be sensitive)","affected by hemophilia"],"phonetic":"/ˌhiːməˈfɪlɪk/","extraExplanation":["“haemophilic”是英式拼写；美式更常写作“hemophilic”。两者读音与含义相同。","词根提示：haemo-/hemo- 表示“血”，-philia 表示“偏爱/倾向”，合起来与“对出血的倾向（凝血困难）”相关。","文化/历史小知识：血友病曾因在欧洲王室家族中出现而被称为“royal disease（王室病）”。在医学或正式语境中常见该形容词。"]}
{"word":"haemopod","summary":{"en":"“Haemopod” is an extremely rare, nonstandard term meaning “blood-footed,” mostly seen (if at all) in obscure/older scientific contexts.","zh":"“haemopod”极其少见、非标准，字面为“血足的”，充其量只在少数冷门/早期科学语境中出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very rare, nonstandard scientific word formed from haemo- (“blood”) + -pod (“foot”), meaning “blood-footed”; occasionally used in obscure or older zoological/biological writing to describe an organism (or body part) associated with blood-filled, blood-colored, or blood-related “feet/appendages.”","zh":"一个非常少见、非标准的科学构词，由 haemo-（“血”）+ -pod（“足/肢”）组成，字面义为“血足的/与血有关的足”；偶见于较冷门或较早期的动物学/生物学写作中，用来描述与“足/附肢”呈血红色、充血或与血相关的生物（或结构）。"},"examples":[{"en":"The term “haemopod” is rarely used in modern biology texts.","zh":"“haemopod” 这个词在现代生物学教材中几乎不用。"},{"en":"In an old note, the author described a “haemopod” appendage, but the meaning was not clearly defined.","zh":"在一则旧笔记里，作者提到“haemopod”附肢，但并未清楚界定其含义。"}]}],"synonyms":["hemopod (variant spelling, rare)"],"phonetic":"/ˈhiːməˌpɑːd/","extraExplanation":["“haemopod”在当代英语与主流学术写作中几乎不出现，很多词典也不收录；更常见的是前缀拼写差异：英式 haemo-（如 haemoglobin）对应美式 hemo-（如 hemoglobin）。","你可能想查的是拼写或近形词：例如 haemopod / hemopod（若在某篇专业文章中出现）、或其他以 -pod 结尾的生物学词（如 arthropod 节肢动物、cephalopod 头足类）。如果你能提供句子上下文或出处（书名/论文/截图），我可以更准确判断它指的具体概念。"]}
{"word":"haemopoiesis","summary":{"en":"Haemopoiesis is the medical term for the formation of blood cells, mainly in the bone marrow.","zh":"Haemopoiesis 指“造血”，即血细胞的生成过程，主要在骨髓中进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making new blood cells (red blood cells, white blood cells, and platelets), mainly in the bone marrow","zh":"造血（产生新的血细胞的过程，包括红细胞、白细胞和血小板，主要发生在骨髓中）"},"examples":[{"en":"Haemopoiesis occurs primarily in the bone marrow in adults.","zh":"在成人中，造血主要发生在骨髓里。"},{"en":"Certain diseases can disrupt haemopoiesis and lead to anemia.","zh":"某些疾病会干扰造血过程并导致贫血。"},{"en":"Doctors may check blood counts to see whether haemopoiesis is recovering after treatment.","zh":"医生可能会检查血细胞计数，以判断治疗后造血功能是否在恢复。"}]}],"synonyms":["hematopoiesis","blood cell formation"],"phonetic":"/ˌhiːməpoʊˈiːsɪs/","extraExplanation":["“haemopoiesis”是英式拼写；美式医学写法更常见的是“hematopoiesis”。两者意思相同。","词源来自希腊语：haemo-/hema-（血）+ -poiesis（制造、形成）。因此可帮助记忆为“血的生成”。","在发育阶段，造血部位会变化：胎儿期常见于肝、脾；出生后逐渐以骨髓为主。这是医学课本里常见的背景知识。"]}
{"word":"haemoproteus","summary":{"en":"Haemoproteus is a genus of blood parasites, mainly in birds, often spread by biting insects.","zh":"Haemoproteus（血变形虫属）是主要寄生于鸟类血液的寄生虫属，常由叮咬昆虫传播。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic protozoa that live in the blood cells of birds (and sometimes reptiles), often spread by biting insects and studied in veterinary medicine and ecology","zh":"（血变形虫属）一类寄生性原生动物的属名，主要寄生在鸟类（有时也见于爬行动物）的血细胞中，常由叮咬昆虫传播，常见于兽医学与生态学研究"},"examples":[{"en":"Researchers tested wild sparrows for Haemoproteus infection.","zh":"研究人员检测野生麻雀是否感染血变形虫属寄生虫。"},{"en":"Haemoproteus parasites are often transmitted by biting midges.","zh":"血变形虫属寄生虫常由蠓等叮咬性昆虫传播。"}]}],"synonyms":["Haemoproteus (genus)"],"phonetic":"ˌhiːməˈproʊtiəs","extraExplanation":["词源上可拆为 haemo-（“血”）+ Proteus（普罗透斯：希腊神话中能变形的神名，常被用来表示“多变/变形”）。该属名体现了寄生虫与血液相关、形态阶段变化多的特点。","在学术写作中通常首字母大写并用斜体：*Haemoproteus*；指“该属的某种寄生虫”时，也常说 “a haemoproteus (parasite)”（不斜体、可小写），但以期刊规范为准。"]}
{"word":"haemoptysis","summary":{"en":"Haemoptysis means coughing up blood from the lungs or airways.","zh":"haemoptysis 指“咯血”，即从肺或呼吸道咳出血或带血痰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"coughing up blood or blood-stained mucus from the lungs or airways.","zh":"咯血；从肺或呼吸道咳出血或带血痰。"},"examples":[{"en":"The patient came to the clinic because of haemoptysis and shortness of breath.","zh":"病人因咯血和呼吸急促来到诊所。"},{"en":"If you cough up bright red blood, seek medical attention—haemoptysis can be a warning sign.","zh":"如果咳出鲜红的血，应尽快就医——咯血可能是危险信号。"},{"en":"Doctors asked whether the haemoptysis happened after exercise or during an infection.","zh":"医生询问咯血是在运动后发生，还是在感染期间出现。"}]}],"synonyms":["coughing up blood","hemoptysis"],"phonetic":"/hiˈmɑp.tə.sɪs/","extraExplanation":["词源：haemo-（血）+ -ptysis（吐出、咳出），字面意思是“咳出血”。","易混点：haemoptysis 指“从呼吸道咳出的血”；如果是呕吐出来的血通常称为 hematemesis（呕血）。","使用场景：多见于医学语境（病历、检查报告）。日常更常说 “coughing up blood”。"]}
{"word":"haemorrhage","summary":{"en":"Haemorrhage means severe bleeding, or (figuratively) a rapid, heavy loss of something like money.","zh":"haemorrhage 指严重出血；也可比喻某种东西（如金钱）迅速大量流失。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large loss of blood from a damaged blood vessel; heavy bleeding (inside or outside the body).","zh":"（因血管受损导致的）大量出血；严重出血（体内或体外）。"},"examples":[{"en":"The patient suffered a brain haemorrhage and needed emergency surgery.","zh":"病人发生了脑出血，需要紧急手术。"},{"en":"The doctor worked quickly to stop the haemorrhage.","zh":"医生迅速处理以止血。"}]},{"partOfSpeech":"v.","definition":{"en":"To lose a lot of blood.","zh":"大量出血。"},"examples":[{"en":"The wound was haemorrhaging, so we called an ambulance immediately.","zh":"伤口在大量出血，所以我们立刻叫了救护车。"}]},{"partOfSpeech":"v.","definition":{"en":"To lose a large amount of something valuable (especially money) quickly and continuously.","zh":"（尤指金钱）大量、持续地流失。"},"examples":[{"en":"The company has been haemorrhaging money since the new project failed.","zh":"自从新项目失败后，这家公司一直在亏损（资金大量流失）。"},{"en":"After the scandal, the team began haemorrhaging fans.","zh":"丑闻之后，这支队伍开始大量流失粉丝。"}]}],"synonyms":["bleeding","blood loss","hemorrhage","leak (money)","lose heavily"],"phonetic":"/ˈhɛmərɪdʒ/","extraExplanation":["英式拼写是 haemorrhage，美式常写作 hemorrhage；意思相同，只是拼写不同。","这个词来自希腊语：haima（血）+ -rrhagia（喷涌、流出），所以常用于医学语境，如 cerebral/brain haemorrhage（脑出血）。","在新闻或商业语境中用作比喻时，语气通常较强，强调“损失速度快、程度严重”（如 haemorrhage money）。"]}
{"word":"haemorrhaged","summary":{"en":"Haemorrhaged means “lost a lot of blood,” and it can also mean “lost money/people/resources quickly” in a strong metaphor.","zh":"haemorrhaged表示“（严重）大量出血”，也可作强烈比喻，指“资金/人员/资源快速大量流失”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a person or body part) to lose a large amount of blood, usually quickly and dangerously.","zh":"（人或身体部位）大量出血；（通常）出血严重、很危险。"},"examples":[{"en":"The patient haemorrhaged after the accident and needed emergency surgery.","zh":"病人在事故后大量出血，需要紧急手术。"},{"en":"If a wound keeps haemorrhaging, get medical help right away.","zh":"如果伤口一直在大量出血，请立刻就医。"}]},{"partOfSpeech":"vi.","definition":{"en":"(business, organization, or situation) to lose a lot of money, people, or support very quickly; to “bleed” resources.","zh":"（公司、组织或局势）快速大量流失（金钱、人手、支持等）；（比喻）“失血”。"},"examples":[{"en":"The company haemorrhaged cash during the crisis.","zh":"危机期间公司现金快速流失。"},{"en":"The team haemorrhaged talent after the merger.","zh":"并购后团队的人才大量流失。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone or something to lose a large amount of blood (less common).","zh":"使（某人/某物）大量出血（较少见）。"},"examples":[{"en":"The sharp metal edge haemorrhaged his leg.","zh":"锋利的金属边缘使他的腿大量出血。"}]}],"synonyms":["bled","lost blood","hemorrhaged","gushed","leaked (money/resources)","drained"],"phonetic":"/ˈhɛmərɪdʒd/","extraExplanation":["“haemorrhaged”是动词“haemorrhage”的过去式/过去分词。英式拼写常用“haem-”（haemorrhage），美式拼写更常见“hem-”（hemorrhage）。","发音与拼写差异：虽然英式写作里常见“haemorrhaged”，但在美国语境（医疗报道、新闻）中更常见“hemorrhaged”。","比喻用法很常见：把资金、人才、时间等的快速流失比作“出血”，语气通常较强，强调损失严重且难以控制。"]}
{"word":"haemorrhagia","summary":{"en":"A rare medical term meaning heavy or abnormal bleeding; hemorrhage.","zh":"较少见的医学用语，指大量或异常出血（严重出血）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Heavy or abnormal bleeding; a serious hemorrhage.","zh":"（医学）大量或异常出血；严重的出血（大出血）。"},"examples":[{"en":"The patient was treated urgently for haemorrhagia after the surgery.","zh":"手术后患者出现严重出血（haemorrhagia），需要紧急治疗。"},{"en":"Seek medical help immediately if you notice signs of haemorrhagia, such as uncontrolled bleeding.","zh":"如果出现无法控制的出血等严重出血征象，应立即就医。"}]}],"synonyms":["hemorrhage","haemorrhage","severe bleeding"],"phonetic":"/ˌhɛməˈreɪdʒiə/","extraExplanation":["“haemorrhagia”较少见，多见于医学或学术语境；日常英语更常用“hemorrhage/haemorrhage”（出血、出血量大）或“bleeding”（出血）。","拼写差异：英式常写“haem-”，美式常写“hem-”。因此在美式资料中更常见“hemorrhagia”。","相关术语（更常见）：menorrhagia（经量过多）、metrorrhagia（非经期子宫出血）；它们都用“-rrhagia”表示“（大量）出血”。"]}
{"word":"haemorrhagic","summary":{"en":"Haemorrhagic means related to, characterized by, or causing heavy bleeding, and it’s most often used in medical contexts (British spelling).","zh":"haemorrhagic 指“出血性的/与大量出血有关的”，多用于医学语境，是英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"involving heavy bleeding (hemorrhage), especially as a medical condition or symptom","zh":"（尤指医学上）与大量出血有关的；出血性的"},"examples":[{"en":"The patient was diagnosed with a haemorrhagic stroke.","zh":"患者被诊断为出血性中风。"},{"en":"Some viruses can cause haemorrhagic fever.","zh":"某些病毒会引起出血热。"}]},{"partOfSpeech":"adj.","definition":{"en":"causing bleeding or likely to cause bleeding","zh":"导致出血的；容易引起出血的"},"examples":[{"en":"Doctors monitored her for haemorrhagic complications after surgery.","zh":"手术后医生监测她是否出现出血性并发症。"},{"en":"This medication may increase the risk of haemorrhagic events.","zh":"这种药物可能会增加出血性事件的风险。"}]}],"synonyms":["hemorrhagic","bleeding","hemorrhaging"],"phonetic":"/ˌhiːməˈrædʒɪk/","extraExplanation":["英式拼写是 haemorrhagic，美式更常见拼写是 hemorrhagic；两者意思相同。","词源来自希腊语：haima（血）+ -rrhagia（“涌出/大出血”）。医学写作里常见于 stroke（中风）、fever（热）、shock（休克）等搭配。","在日常英语里这个词较少用于比喻，多用于医学、新闻或学术语境。"]}
{"word":"haemorrhaging","summary":{"en":"Haemorrhaging means bleeding heavily, or (figuratively) losing money/resources very fast.","zh":"haemorrhaging 指严重出血；也可比喻资金/资源等快速大量流失。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Medical) losing blood heavily and continuously; bleeding severely.","zh":"（医学）大量、持续地失血；严重出血。"},"examples":[{"en":"The paramedic said he was haemorrhaging and needed surgery right away.","zh":"急救人员说他正在严重出血，需要立刻手术。"},{"en":"Without quick treatment, the patient could keep haemorrhaging internally.","zh":"如果不及时治疗，病人可能会继续内出血。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative) losing something valuable very quickly and in large amounts (especially money, staff, or support).","zh":"（比喻）迅速大量流失（尤指资金、人员或支持）。"},"examples":[{"en":"The company has been haemorrhaging cash since the project failed.","zh":"自从项目失败后，公司一直在迅速烧钱（资金大量流失）。"},{"en":"After the scandal, the party was haemorrhaging supporters.","zh":"丑闻之后，该党支持者大量流失。"}]}],"synonyms":["bleeding","losing","draining","leaking","pouring out"],"phonetic":"/ˈhɛmərɪdʒɪŋ/","extraExplanation":["“haemorrhaging”是英式拼写；美式通常写作“hemorrhaging”。两者意思相同，只是拼写习惯不同。","在医学语境里，常见搭配有“haemorrhaging badly”（出血很严重）、“internal haemorrhaging”（内出血）。在商业或新闻语境里，常用来强调损失“快、猛、难以控制”的感觉。"]}
{"word":"haemorrhagy","summary":{"en":"Hemorrhage (BrE haemorrhage) means heavy bleeding, or to bleed heavily; it can also be used figuratively for rapid loss (e.g., money).","zh":"hemorrhage（英式拼写 haemorrhage）指“大出血”，也可作动词指“严重出血”；还可比喻“迅速大量流失”（如金钱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) heavy bleeding, especially sudden or uncontrolled bleeding from a blood vessel or organ.","zh":"（医学）大出血；（尤指）突然或无法控制的出血。"},"examples":[{"en":"The patient was treated immediately to stop the hemorrhage.","zh":"医护人员立刻处理以止住大出血。"},{"en":"Internal hemorrhage can be life-threatening.","zh":"内出血可能危及生命。"}]},{"partOfSpeech":"v.","definition":{"en":"to bleed heavily; to lose a large amount of blood (or, figuratively, to lose a lot of money/resources quickly).","zh":"大量出血；（比喻）迅速损失大量金钱/资源。"},"examples":[{"en":"He began to hemorrhage after the accident.","zh":"事故后他开始大量出血。"},{"en":"The company was hemorrhaging money during the crisis.","zh":"危机期间这家公司在快速亏钱。"}]}],"synonyms":["bleeding","severe bleeding","blood loss","bleed heavily","spill blood"],"phonetic":"/ˈhɛmərɪdʒ/","extraExplanation":["你输入的 **haemorrhagy** 通常被视为拼写错误；正确拼写是 **haemorrhage**（英式拼写，含 *ae*），美式常写作 **hemorrhage**。两者意思相同。","在日常英语里更常用动词短语 **bleed heavily**（大量出血）来表达；**hemorrhage/haemorrhage** 更偏医学或正式语境。"]}
{"word":"haemorrhoid","summary":{"en":"A hemorrhoid (haemorrhoid) is a swollen vein in or around the anus/rectum that may cause pain, itching, or bleeding.","zh":"haemorrhoid（痔疮）指肛门或直肠内/周围静脉肿胀，可能引起疼痛、瘙痒或出血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a swollen vein (or group of veins) in or around the anus/rectum that can cause pain, itching, or bleeding; also called a “piles”","zh":"痔疮：肛门或直肠内/周围的静脉（或静脉丛）肿胀，可能引起疼痛、瘙痒或出血；也叫“piles”"},"examples":[{"en":"Sitting for long periods can make hemorrhoids worse.","zh":"久坐可能会让痔疮加重。"},{"en":"He noticed a small amount of bleeding and went to see a doctor to check for hemorrhoids.","zh":"他发现少量出血，就去看医生检查是否是痔疮。"},{"en":"A high-fiber diet and drinking more water can help prevent hemorrhoids.","zh":"高纤维饮食和多喝水有助于预防痔疮。"}]}],"synonyms":["piles"],"phonetic":"/ˈhɛmərɔɪd/","extraExplanation":["拼写提示：英式常写作 haemorrhoid，美式更常见 hemorrhoid。","语境提示：这是医学/健康话题里的常用词。在日常对话中有时会用更委婉的说法，如 “I have an issue down there.” 但在就医或健康信息中直接说 hemorrhoids/haemorrhoids 很正常。","词源小知识：来自希腊语，含义与“出血”相关（因为痔疮可能导致便血）。如果出现持续出血或剧烈疼痛，通常建议及时就医以排除其他原因。"]}
{"word":"haemorrhoidal","summary":{"en":"Haemorrhoidal means relating to or caused by hemorrhoids.","zh":"haemorrhoidal 意为“与痔疮有关的；由痔疮引起的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or affected by hemorrhoids (swollen veins in or around the anus and lower rectum).","zh":"与痔疮有关的；受痔疮影响的（痔疮指肛门及直肠下段周围静脉肿胀）。"},"examples":[{"en":"The doctor diagnosed haemorrhoidal bleeding and recommended a high-fiber diet.","zh":"医生诊断为痔疮性出血，并建议采用高纤维饮食。"},{"en":"Warm baths can help relieve haemorrhoidal discomfort.","zh":"温水坐浴有助于缓解痔疮不适。"}]}],"synonyms":["hemorrhoidal","piles-related (informal)"],"phonetic":"/ˌhɛm.əˈrɔɪ.dəl/","extraExplanation":["“haemorrhoidal”多见于英式拼写；美式更常写作“hemorrhoidal”。两者意义相同，来自“haemorrhoid/hemorrhoid（痔疮）”。","这个词通常用于医学或较正式的语境；日常口语更常说“hemorrhoids / piles（痔疮）”。"]}
{"word":"haemorrhoidectomy","summary":{"en":"Haemorrhoidectomy is surgery to remove hemorrhoids.","zh":"Haemorrhoidectomy 指“痔切除术/切痔手术”，即通过手术切除痔疮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove hemorrhoids (swollen veins in or around the anus and lower rectum).","zh":"痔切除术；切痔手术（通过外科手术切除肛门或直肠下段周围肿胀的静脉——痔疮）。"},"examples":[{"en":"The doctor said a haemorrhoidectomy might be needed if other treatments don’t work.","zh":"医生说，如果其他治疗无效，可能需要做痔切除术。"},{"en":"After the haemorrhoidectomy, he was advised to rest and follow a high-fiber diet.","zh":"痔切除术后，他被建议休息并遵循高纤维饮食。"}]}],"synonyms":["hemorrhoidectomy","hemorrhoid surgery","surgery to remove hemorrhoids"],"phonetic":"/ˌhɛməˌrɔɪˈdɛk.tə.mi/","extraExplanation":["英式拼写为 haemorrhoidectomy，美式常写作 hemorrhoidectomy。发音在实际交流中差异不大。","这个词属于医学用语，日常更常说：hemorrhoid surgery / surgery to remove hemorrhoids（痔疮手术）。与之相关的常见词：hemorrhoids/haemorrhoids（痔疮），pile(s)（较口语/旧称）。"]}
{"word":"haemorrhoids","summary":{"en":"Haemorrhoids are swollen veins in or near the anus/rectum that can cause pain, itching, or bleeding.","zh":"Haemorrhoids（痔疮）是肛门或直肠附近静脉肿胀，可能引起疼痛、瘙痒或出血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Swollen veins in or near the anus and lower rectum that can cause discomfort, itching, bleeding, or pain, especially during bowel movements.","zh":"痔疮：肛门或直肠下段周围的静脉肿胀，可能引起不适、瘙痒、出血或疼痛，常在排便时更明显。"},"examples":[{"en":"Sitting for long periods can make haemorrhoids worse.","zh":"久坐可能会让痔疮加重。"},{"en":"She saw a doctor because her haemorrhoids were bleeding.","zh":"她因为痔疮出血而去看医生。"},{"en":"Drinking more water and eating more fiber may help prevent haemorrhoids.","zh":"多喝水、增加膳食纤维可能有助于预防痔疮。"}]}],"synonyms":["hemorrhoids","piles"],"phonetic":"/ˈhɛmərɔɪdz/","extraExplanation":["“haemorrhoids”是英式拼写，美式更常写作“hemorrhoids”。日常口语里也常说“piles”，但在医疗语境中用“haemorrhoids/hemorrhoids”更正式。","这是比较私密的健康话题：如果出现大量出血、剧烈疼痛、黑便、头晕，或症状持续不改善，通常建议尽快就医，以排除其他肠胃问题。","常见相关表达：internal haemorrhoids（内痔），external haemorrhoids（外痔），a flare-up（复发/加重）。"]}
{"word":"haemosporid","summary":{"en":"A haemosporid is a blood-dwelling protozoan parasite (such as Plasmodium) often transmitted by biting insects; the word can also describe anything related to these parasites.","zh":"haemosporid 指寄生于血液、常由吸血昆虫传播的原生动物寄生虫（如疟原虫）；也可作形容词表示“与血孢子虫相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) A protozoan parasite in the group Haemosporida (e.g., Plasmodium) that lives in the blood of vertebrates and is typically spread by blood-feeding insects.","zh":"（名词）血孢子虫类寄生虫（隶属血孢子虫目 Haemosporida，如疟原虫 Plasmodium），寄生于脊椎动物血液中，常由吸血昆虫传播。"},"examples":[{"en":"Researchers tested birds for haemosporids to study how malaria-like parasites spread.","zh":"研究人员检测鸟类体内的血孢子虫，以研究类似疟疾的寄生虫如何传播。"},{"en":"Mosquitoes can carry haemosporids from one host to another.","zh":"蚊子可能将血孢子虫从一个宿主传播到另一个宿主。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Related to or caused by haemosporid parasites.","zh":"（形容词）与血孢子虫有关的；由血孢子虫引起的。"},"examples":[{"en":"The team documented haemosporid infection rates across different seasons.","zh":"团队记录了不同季节的血孢子虫感染率。"},{"en":"They compared haemosporid diseases in wild and captive populations.","zh":"他们比较了野外与圈养种群中的血孢子虫性疾病。"}]}],"synonyms":["hemosporid","haemosporidian","blood parasite (general)"],"phonetic":"/ˌhiːməˈspɔːrɪd/","extraExplanation":["“haemo-”来自希腊语，意为“血”；“spore”指“孢子/孢子体”，合起来强调这类寄生虫与血液阶段有关。","在科普或医学语境中，你更常见到具体属名，比如 Plasmodium（疟原虫，导致人类疟疾）或 Haemoproteus（常见于鸟类）。因此，haemosporid 多见于论文、实验报告等学术英语。"]}
{"word":"haemosporidia","summary":{"en":"Haemosporidia are blood-dwelling parasitic protozoa, often insect-borne, including malaria-related parasites.","zh":"Haemosporidia 指一类寄生于血液、常由吸血昆虫传播的原生动物类群，包含与疟疾相关的寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of parasitic protozoa that live in the blood of vertebrates; many are transmitted by blood-sucking insects and include malaria-related parasites","zh":"（分类学）血孢子虫类群：一类寄生在脊椎动物血液中的原生动物，常由吸血昆虫传播，其中包括与疟疾相关的寄生虫"},"examples":[{"en":"Researchers studied Haemosporidia in wild birds to understand how parasites spread.","zh":"研究人员在野生鸟类中研究血孢子虫类群，以了解寄生虫如何传播。"},{"en":"Some Haemosporidia are transmitted by mosquitoes and infect red blood cells.","zh":"部分血孢子虫由蚊子传播，并感染红细胞。"}]}],"synonyms":["hemosporidia","haemosporidians"],"phonetic":"/ˌhiːməspəˈrɪdiə/","extraExplanation":["“Haemosporidia”常见于生物学与寄生虫学文献，是一个分类学名称（通常指“血孢子虫目/类群”）。在不同教材或分类体系中，层级与范围可能略有差异。","词形来源：haemo-（血）+ spore（孢子/繁殖体）+ -idia（复数/类群名常见后缀）。在英式拼写中常见“haemo-”，美式有时写作“hemo-”，但该类群名多沿用学术传统拼写。"]}
{"word":"haemosporidian","summary":{"en":"A haemosporidian is a malaria-like blood parasite (or something related to it), often transmitted by biting insects.","zh":"haemosporidian 指“疟疾样的血液寄生虫（或与其相关的事物）”，常由吸血昆虫传播。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a malaria-like blood parasite (a protozoan) in the group Haemosporida, which infects vertebrates (often birds, reptiles, or mammals) and is usually spread by blood-feeding insects (such as mosquitoes).","zh":"血孢子虫类寄生虫（原生动物）的一员，属于血孢子虫目（Haemosporida）；会感染脊椎动物（常见于鸟类、爬行动物或哺乳动物），通常由吸血昆虫（如蚊子）传播，类似疟疾寄生虫。"},"examples":[{"en":"Researchers tested wild birds for haemosporidians to understand disease spread.","zh":"研究人员检测野生鸟类体内的血孢子虫，以了解疾病传播情况。"},{"en":"Plasmodium is a well-known haemosporidian that causes malaria in humans.","zh":"疟原虫（Plasmodium）是一种著名的血孢子虫，会引起人类疟疾。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or caused by haemosporidian parasites.","zh":"与血孢子虫类寄生虫有关的；由血孢子虫引起的。"},"examples":[{"en":"The team studied haemosporidian infections in mosquito-rich areas.","zh":"团队研究了蚊虫密集地区的血孢子虫感染。"},{"en":"Haemosporidian disease can reduce a bird’s fitness during migration.","zh":"血孢子虫相关疾病可能在迁徙期间降低鸟类的生存与繁殖能力。"}]}],"synonyms":["hemosporidian","haemosporidan"],"phonetic":"/ˌhiːmoʊspɔːˈrɪdiən/","extraExplanation":["词源提示：haemo-（= blood，血）+ sporidian/“spore”（与“孢子/孢子体”相关的构词），整体指“寄生在血液中的孢子虫类”。","拼写差异：英式常见 haemosporidian；美式常见 hemosporidian（去掉 a）。","常见语境：生态学、兽医学、鸟类学、寄生虫学论文里常用来概括 Plasmodium、Haemoproteus 等一类“疟疾样”血液寄生虫。"]}
{"word":"haemosporidium","summary":{"en":"a blood parasite (haemosporidian protozoan), often insect-borne; includes malaria-related organisms.","zh":"一种常由昆虫传播的血液寄生原生动物（血孢子虫类），其中包括与疟疾相关的生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blood-dwelling protozoan parasite (a haemosporidian) that infects vertebrates and is usually transmitted by biting insects; the group includes malaria parasites.","zh":"一种寄生在血液中的原生动物（血孢子虫/血孢子虫类寄生虫），通常由叮咬性昆虫传播；该类群包括疟原虫等。"},"examples":[{"en":"Some haemosporidium species infect birds and can be spread by mosquitoes or biting midges.","zh":"一些血孢子虫类会感染鸟类，并可能由蚊子或蠓等叮咬性昆虫传播。"},{"en":"Researchers tested blood samples to check for haemosporidium infection.","zh":"研究人员检测血样以确认是否存在血孢子虫类感染。"}]}],"synonyms":["haemosporidian","hemosporidian parasite","blood protozoan parasite"],"phonetic":"/ˌhiːməspəˈrɪdiəm/","extraExplanation":["“haemosporidium”多见于生物学/寄生虫学语境，属于较专业的词。日常英语中更常用的相关词是“haemosporidian (parasite)”或更具体的属名如“Plasmodium（疟原虫）”。","词源上可拆为 haemo-（血）+ spor-（孢子/繁殖体）+ -idium（小的/相关的后缀），强调其与“血液中的孢子样阶段/传播方式”有关。","英式拼写常见 haem-；美式拼写常见 hem-。在文献中你可能会看到 “haemosporidian/hemosporidian”。"]}
{"word":"haemostasia","summary":{"en":"Haemostasia is most likely a misspelling of haemostasis/hemostasis: the process of stopping bleeding.","zh":"haemostasia 多半是 haemostasis/hemostasis 的误拼：指“止血/止血机制”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: haemostasis) the stopping of bleeding, especially by natural blood clotting or by medical treatment.","zh":"（多半指 haemostasis）止血；（尤指）通过凝血的自然过程或医疗手段使出血停止。"},"examples":[{"en":"The doctor applied pressure to achieve haemostasis.","zh":"医生加压处理以达到止血。"},{"en":"Platelets play an important role in haemostasis.","zh":"血小板在止血过程中起重要作用。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/medicine, the body’s process of keeping blood in the vessels and preventing excessive blood loss after injury.","zh":"（生物/医学）机体维持血液在血管内流动、在受伤后防止过度失血的调节过程（止血机制）。"},"examples":[{"en":"Problems with haemostasis can cause easy bruising or heavy bleeding.","zh":"止血机制出问题可能导致容易淤青或出血量过大。"},{"en":"Medications like anticoagulants affect haemostasis.","zh":"抗凝药等药物会影响止血机制。"}]}],"synonyms":["hemostasis","haemostasis","blood clotting (related)","coagulation (related)"],"phonetic":"/ˌhiːməˈstoʊsɪs/","extraExplanation":["“haemostasia”在英语中不常见，最常用的标准术语是 **haemostasis**（英式拼写，含 *ae*）或 **hemostasis**（美式拼写）。","词源：*haemo-*（血）+ *-stasis*（停止、静止）。在医学写作中常用于手术记录、急救处理与凝血相关内容。"]}
{"word":"haemostasis","summary":{"en":"Haemostasis is the body’s process of stopping bleeding after an injury to a blood vessel.","zh":"Haemostasis 指身体在血管受伤后通过一系列机制来“止血”的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process by which the body stops bleeding after a blood vessel is injured, mainly through blood vessel tightening, platelet plug formation, and blood clotting","zh":"（生理）止血：血管受伤后，身体通过血管收缩、血小板形成栓塞以及凝血等过程来停止出血"},"examples":[{"en":"Normal haemostasis prevents you from bleeding too much after a small cut.","zh":"正常的止血功能会防止你在小割伤后流血过多。"},{"en":"Doctors monitored her haemostasis during surgery to reduce the risk of severe bleeding.","zh":"医生在手术中监测她的止血情况，以降低大出血风险。"}]}],"synonyms":["hemostasis","blood clotting (related)","coagulation (related)"],"phonetic":"/ˌhiːməˈsteɪsɪs/","extraExplanation":["英式拼写为 haemostasis（美式常写作 hemostasis）。词源来自希腊语：haima（血）+ stasis（停止、静止）。","止血通常可分为三步：①血管收缩（减少血流）；②血小板聚集形成“血小板栓”；③凝血级联反应形成纤维蛋白网，使血块更稳固。","相关词：hemostatic/haemostatic（adj. 止血的）、coagulation（凝血）、platelet（血小板）。"]}
{"word":"haemostat","summary":{"en":"A surgical clamp used to stop bleeding by holding a blood vessel or tissue closed.","zh":"一种外科夹钳，用于夹闭血管或组织以止血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical instrument used to clamp a blood vessel or tissue to stop bleeding during surgery.","zh":"（外科）止血钳；用于夹住血管或组织以止血的医疗器械。"},"examples":[{"en":"The surgeon applied a haemostat to clamp the vessel and control the bleeding.","zh":"外科医生用止血钳夹住血管，以控制出血。"},{"en":"Please pass me a haemostat.","zh":"请把止血钳递给我。"}]}],"synonyms":["hemostat","artery forceps","clamp"],"phonetic":"/ˈhiːməˌstæt/","extraExplanation":["“haemostat”是英式拼写；美式更常见拼写为“hemostat”。","词源可拆分理解：haemo-/hemo- 表示“血”，-stat 表示“使停止/稳定”。在手术器械里，haemostat通常指带锁扣的夹钳（如Kelly clamp），夹住组织后可保持固定压力，从而减少出血。"]}
{"word":"haemostatic","summary":{"en":"“Haemostatic” means “stopping bleeding” (British spelling of “hemostatic”).","zh":"haemostatic 指“止血的”（hemostatic 的英式拼写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to stop bleeding, or relating to methods/medicines that stop bleeding by helping blood clot or by sealing a wound.","zh":"止血的；与止血方法/药物有关的（通过促进凝血或封闭伤口来止血）。"},"examples":[{"en":"The surgeon applied a haemostatic sponge to control the bleeding.","zh":"外科医生使用止血海绵来控制出血。"},{"en":"This gauze is haemostatic, so it can help in emergencies.","zh":"这种纱布是止血型的，所以在紧急情况下很有帮助。"}]}],"synonyms":["hemostatic","blood-staunching","coagulant"],"phonetic":"/ˌhiːməˈstætɪk/","extraExplanation":["英式拼写：haemostatic；美式更常写作 hemostatic（拼写差异来自英式常保留 “ae”，如 haemoglobin；美式多简化为 “e”，如 hemoglobin）。","词源提示：haemo- / hemo- 表示“血”，-static 表示“使停止/稳定”。在医疗语境中常见于 haemostatic agent（止血剂）、haemostatic clamp（止血钳）。"]}
{"word":"haemothorax","summary":{"en":"Haemothorax means blood in the pleural space (blood in the chest outside the lungs).","zh":"Haemothorax 指胸膜腔内积血（血胸）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which blood collects in the pleural space (the area between the lungs and the chest wall), often after injury or surgery, making it hard to breathe.","zh":"（医学）血胸：血液积聚在胸膜腔（肺与胸壁之间的空间）内，常见于外伤或手术后，可能导致呼吸困难。"},"examples":[{"en":"After the car accident, the patient developed a haemothorax and needed urgent treatment.","zh":"车祸后，患者出现血胸，需要紧急治疗。"},{"en":"The doctor ordered a chest X-ray to check for pneumothorax or haemothorax.","zh":"医生开了胸部X光检查，以排查气胸或血胸。"}]}],"synonyms":["hemothorax","pleural hemorrhage"],"phonetic":"/ˌhiːməˈθɔːræks/","extraExplanation":["“haemothorax”是英式拼写；美式更常写作“hemothorax”。其中“haemo-/hemo-”来自希腊语，表示“血”，“-thorax”表示“胸腔/胸部”。","血胸常与胸部外伤相关（如肋骨骨折刺破血管），也可能见于手术、凝血功能问题等。处理方式取决于出血量与原因，可能包括胸腔引流等（具体需由医生判断）。","相关词对比：pneumothorax（气胸，胸膜腔内是“气”），hydrothorax（胸腔积液，胸膜腔内是“液体/渗出液”）。"]}
{"word":"haemotoxic","summary":{"en":"Haemotoxic means toxic to blood, often describing venoms that damage blood or clotting.","zh":"Haemotoxic 指“对血液有毒的”，常形容会破坏血液或凝血功能的毒液/毒素。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Poisonous to blood (damaging blood cells, blood vessels, or the blood’s ability to clot), often used to describe certain venoms or toxins.","zh":"对血液有毒的（会伤害血细胞、血管或影响凝血功能），常用于描述某些毒液或毒素。"},"examples":[{"en":"Some snake venoms are haemotoxic and can cause internal bleeding.","zh":"一些蛇毒具有溶血/血毒作用，可能引起内出血。"},{"en":"Doctors monitored his blood tests because the toxin was suspected to be haemotoxic.","zh":"医生监测他的血液检查结果，因为怀疑这种毒素对血液有毒。"}]}],"synonyms":["hemotoxic","blood-toxic","hematotoxic"],"phonetic":"/ˌhiːməˈtɑːksɪk/","extraExplanation":["“haemotoxic”也常写作“hemotoxic”（美式拼写更常见）。前缀“haemo-/hemo-”来自希腊语，和“blood（血）”有关；“-toxic”表示“有毒的”。","在科普和医学语境里，haemotoxic 常用于对比 neurotoxic（神经毒性的）与 cytotoxic（细胞毒性的）：haemotoxic 更强调对血液与凝血系统的破坏。"]}
{"word":"haemotoxin","summary":{"en":"A haemotoxin is a blood-affecting toxin that damages red blood cells or interferes with clotting.","zh":"haemotoxin 指“影响血液的毒素”，会破坏红细胞或干扰凝血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toxin that damages red blood cells and/or disrupts blood clotting, often causing bleeding or tissue damage","zh":"溶血毒素；会破坏红细胞和/或干扰凝血的毒素，常导致出血或组织损伤"},"examples":[{"en":"Some snake venoms contain haemotoxins that can cause internal bleeding.","zh":"一些蛇毒含有溶血毒素，可能导致内出血。"},{"en":"Doctors monitored his blood clotting because haemotoxins can affect platelets and clotting factors.","zh":"医生监测他的凝血功能，因为溶血毒素可能影响血小板和凝血因子。"}]}],"synonyms":["hemotoxin","blood toxin"],"phonetic":"/ˌhiːməˈtɑːksɪn/","extraExplanation":["词源提示：haemo- 来自希腊语 haima（“血”），toxin 表示“毒素”。因此 haemotoxin 字面意思是“血毒素”。","拼写差异：英式拼写常见为 haemotoxin，美式拼写多为 hemotoxin。","使用场景：这是医学/毒理学术语，常用于描述蛇毒（如部分蝰蛇）、某些昆虫/蜘蛛毒液或实验室研究中的毒素成分。与“neurotoxin（神经毒素）”“cytotoxin（细胞毒素）”等词常一起对比。"]}
{"word":"haems","summary":{"en":"“Haems” is the plural of “haem” (British spelling of “heme”), referring to iron-containing heme groups in hemoglobin and related proteins.","zh":"“haems”是“haem”（heme 的英式拼写）的复数，指血红蛋白等蛋白质中的含铁血红素基团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of haem: iron-containing molecules (heme groups) found in hemoglobin and other proteins, important for carrying oxygen and for certain chemical reactions in the body","zh":"haem 的复数：血红素（heme）分子，含铁，存在于血红蛋白等蛋白质中，对携带氧气及体内一些化学反应很重要"},"examples":[{"en":"Hemoglobin contains several haems that help bind oxygen.","zh":"血红蛋白含有多个血红素（haems），帮助结合氧气。"},{"en":"Scientists studied how different haems affect enzyme activity.","zh":"科学家研究了不同血红素如何影响酶的活性。"}]}],"synonyms":["hemes","heme groups"],"phonetic":"/himz/","extraExplanation":["“haem”是英式拼写；美式更常写作“heme”。同样地，英式“haemoglobin”在美式中通常写作“hemoglobin”。","在生物/医学语境中，“heme/haem”常指血红素这一“含铁的辅基”（heme group），它是血红蛋白呈红色并能携氧的重要原因之一。"]}
{"word":"haemulidae","summary":{"en":"Haemulidae is the scientific name for the fish family known as grunts.","zh":"Haemulidae 是“石鲈科”的学名，英文俗称 grunts（石鲈/咕噜鱼）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family of marine fishes commonly called grunts, found in warm seas and known for making grunting sounds by rubbing their teeth together","zh":"（鱼类）石鲈科（Haemulidae）：一类常见于温暖海域的海水鱼，英文俗称“grunts（石鲈/咕噜鱼）”，因能通过摩擦咽喉部牙齿发出“咕噜”声而得名"},"examples":[{"en":"Many reef fish in the family Haemulidae gather in schools near coral structures.","zh":"许多石鲈科（Haemulidae）的珊瑚礁鱼类会在珊瑚结构附近成群活动。"},{"en":"In field guides, Haemulidae are often listed under the common name “grunts.”","zh":"在野外图鉴里，Haemulidae 常以俗名“grunts（石鲈/咕噜鱼）”出现。"}]}],"synonyms":["grunts (fish family)"],"phonetic":"/hiːˈmjuːlɪdiː/","extraExplanation":["“Haemulidae”是生物分类学中的“科”名（family），常见于学术文章、鱼类图鉴和水产资料中；日常英语更常用俗名“grunts”。","词形提示：以 -idae 结尾通常表示“某某科”（如 Felidae 猫科、Canidae 犬科）。","词源上与属名 Haemulon 有关；这类鱼的英文俗名“grunt”来自其能发出类似咕噜声的行为特征。"]}
{"word":"haemuloid","summary":{"en":"Haemuloid means “related to or resembling grunt fishes (Haemulidae).”","zh":"haemuloid 表示“与石鲈科（grunts，Haemulidae）鱼类有关的，或类似它们的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Related to the grunt fishes (family Haemulidae), or having characteristics like them.","zh":"（动物学）与石鲈科（也常称“拟石鲈/咕噜鱼科”，Haemulidae，英文常叫grunts）鱼类有关的；或具有其特征的。"},"examples":[{"en":"Some haemuloid fishes make a grunting sound by grinding their teeth.","zh":"一些haemuloid（石鲈科）鱼会通过磨擦牙齿发出“咕噜”声。"},{"en":"The guidebook lists several haemuloid species found near coral reefs.","zh":"这本指南列出了珊瑚礁附近的几种haemuloid（石鲈科）鱼类。"}]},{"partOfSpeech":"n.","definition":{"en":"A fish that belongs to, or resembles members of, the Haemulidae (grunt) group.","zh":"石鲈科（grunts）的一种鱼；或外形/特征类似该类群的鱼。"},"examples":[{"en":"The catch included a small haemuloid from shallow water.","zh":"渔获里有一条来自浅水区的小型haemuloid（石鲈科）鱼。"}]}],"synonyms":["haemulid","grunt-fish (related term)","-oid (suffix meaning “-like,” related idea)"],"phonetic":"/hiːˈmjuːlɔɪd/","extraExplanation":["“haemuloid”来自“Haemul-”这一类群名称（与石鲈科Haemulidae相关）+ “-oid”（表示“……样的/类似……的”）。因此它常见于科学写作、鱼类学和野外调查记录中，日常英语里很少用。"]}
{"word":"haemulon","summary":{"en":"Haemulon is a scientific genus name for several western Atlantic grunt fishes.","zh":"Haemulon 是西大西洋多种“咕噜鱼/石鲈”的属名（科学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of marine fish in the grunt family (Haemulidae), found mainly in the western Atlantic; several species are commonly called grunts.","zh":"（鱼类）石鲈科（Haemulidae，常称“咕噜鱼/石鲈”）中的一个海水鱼属，主要分布于西大西洋；其中多种鱼俗称“grunts（咕噜鱼）”。"},"examples":[{"en":"Biologists recorded Haemulon species on Caribbean coral reefs during the survey.","zh":"生物学家在调查中记录了加勒比珊瑚礁上的 Haemulon 属鱼类。"},{"en":"Some Haemulon grunts make a low sound by grinding their teeth.","zh":"一些 Haemulon 属的咕噜鱼会通过摩擦牙齿发出低沉的声音。"}]}],"synonyms":["grunt (fish)","Haemulon genus"],"phonetic":"/hiˈmjuːlɑn/","extraExplanation":["“Haemulon”是拉丁化的学名（属名），常见于科学论文、物种名（如 Haemulon flavolineatum）和渔业/生态调查报告中；日常英语里更常说“grunt（咕噜鱼）”。","发音上可把它拆成“hae-mu-lon”，其中“hae-”在英语学术读法里常近似“hee-”。"]}
{"word":"haen","summary":{"en":"“Haen” is not a standard English word; it’s usually a misspelling or a name/dialect form.","zh":"“haen”不是标准英文单词；通常是拼写错误，或姓名/方言写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or an uncommon/archaic form seen in names or dialect writing. In most everyday contexts, people likely mean “hen,” “hence,” or “Hain/Haen” as a surname.","zh":"不是标准英文单词；多见于拼写错误，或在姓名、方言/古体写法中出现。在日常语境里，人们更可能想写的是“hen（母鸡）”“hence（因此/从此）”，或把它当作姓氏 Hain/Haen。"},"examples":[{"en":"I think you meant “hen” (a female chicken), not “haen.”","zh":"我觉得你想写的是“hen（母鸡）”，不是“haen”。"},{"en":"“Haen” can appear as a family name, but it isn’t a common English vocabulary word.","zh":"“Haen”可能会作为姓氏出现，但它不是常见的英文词汇。"}]}],"phonetic":"/heɪn/","extraExplanation":["“haen”最常见的情况是拼写输入错误。你可以告诉我你看到它的句子/上下文（比如一整句话或出处），我就能更准确判断你想查的是哪个词：hen、hence，还是某个专有名词（人名/地名/品牌名）。"]}
{"word":"haer","summary":{"en":"“Haer” is an uncommon Scots/archaic word meaning “hare,” and it can also appear as an old spelling of “hair.”","zh":"“haer”在现代英语中很少见，主要见于苏格兰语/古用语，意为“野兔（hare）”，也可能是“hair”的旧拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots/archaic) A hare; a wild rabbit-like animal with long ears and long back legs.","zh":"（苏格兰语/古用）野兔；一种类似兔子的野生动物，耳朵长、后腿有力。"},"examples":[{"en":"In old Scots poems, you may see “haer” used for a hare on the moor.","zh":"在一些古老的苏格兰诗歌里，你可能会看到用“haer”来指荒原上的野兔。"},{"en":"The haer ran fast across the field.","zh":"野兔飞快地穿过田野。"}]},{"partOfSpeech":"n.","definition":{"en":"A spelling variant of “hair” (very uncommon today).","zh":"“hair”的一种拼写变体（如今很少见）。"},"examples":[{"en":"Older texts may write “haer” where modern English uses “hair.”","zh":"较老的文本里有时会用“haer”，而现代英语会写作“hair”。"}]}],"synonyms":["hare"],"phonetic":"/hɛr/","extraExplanation":["“haer”在现代英语里非常少见，更常见的是“hare（野兔）”或“hair（头发）”。如果你原本想查的是“hear（听见）/hair（头发）/hare（野兔）”，告诉我句子语境，我可以帮你确认。","发音上，“hare”和（常见口音中的）“hair”常常同音，因此拼写更容易混淆。","文学用法方面，苏格兰与英格兰北部的方言/古诗中更可能出现“haer”这种拼写。"]}
{"word":"haeredes","summary":{"en":"Haeredes is Latin for “heirs” (plural).","zh":"Haeredes 是拉丁语，意思是“继承人”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin, plural) heirs; people who legally inherit property, titles, or rights from someone who has died.","zh":"（拉丁语，复数）继承人；依法从逝者处继承财产、头衔或权利的人。"},"examples":[{"en":"In the will, the testator named his children as haeredes.","zh":"在遗嘱中，立遗嘱人指定他的孩子为 haeredes（继承人）。"},{"en":"The document lists the haeredes and describes how the land should be divided.","zh":"文件列出了 haeredes，并说明土地应如何分配。"}]}],"synonyms":["heirs","inheritors","successors"],"phonetic":"/hɛrˈiːdiːz/","extraExplanation":["“haeredes”是拉丁语单词“heres”（继承人）的复数形式，常见于罗马法、教会法或中世纪拉丁文文献中。现代英语法律语境更常用“heirs”。","在一些法律拉丁语表达或古文献翻译中，你可能会看到它用来强调“具有法定继承资格的人”（不仅仅是泛指家人）。"]}
{"word":"haeremai","summary":{"en":"“Here am I” means “I’m here,” often used when answering a call; it can also be a formal way to say you’re ready and willing to help.","zh":"“Here am I”意思是“我在这儿/我来了”，常用于回应别人叫你；也可在较正式语境表示“我愿意、我准备好帮忙/承担任务”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Used to answer when someone calls your name) I’m here; I’m present and ready.","zh":"（回应别人叫你时）我在这儿；我来了；我准备好了。"},"examples":[{"en":"—Jason! —Here am I!","zh":"——杰森！——我在这儿！"},{"en":"When the teacher called my name, I said, “Here am I.”","zh":"老师点到我的名字时，我说：“我在这儿。”"},{"en":"In the meeting, she spoke up: “Here am I, ready to help.”","zh":"在会议上，她站出来说：“我在这儿，愿意帮忙。”"}]},{"partOfSpeech":"phrase","definition":{"en":"(More formal/literary) I am available and willing to serve or accept a task.","zh":"（更正式/文学化）我愿意承担；我愿意效劳/接受任务。"},"examples":[{"en":"He wrote, “Here am I, send me,” to show he was willing to volunteer.","zh":"他写下“我在这儿，请差遣我”，表示他愿意做志愿者。"},{"en":"In stories, a hero may say “Here am I” to show courage and readiness.","zh":"在故事里，英雄可能会说“我在这儿”，表示勇气和准备就绪。"}]}],"synonyms":["Here I am","I’m here","Present","I’m ready"],"phonetic":"hɪr æm aɪ","extraExplanation":["你输入的“haeremai”很像英语短语“here am I”的连读音。标准写法是“here am I”。","“Here am I, send me”常见于《圣经》（以赛亚书 6:8）等宗教/文学语境，用来表达“我愿意被差遣、愿意承担使命”。日常口语里更常说“Here I am.”。"]}
{"word":"haerere","summary":{"en":"*haerere* (Latin) means “to cling/stick” and, by extension, “to be stuck or hesitate.”","zh":"*haerere*（拉丁语）意为“黏住/依附”，引申为“卡住、停滞或犹豫”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Latin) to cling, stick, or adhere closely (often used of something physically sticking or figuratively “remaining attached”).","zh":"（拉丁语）黏住；紧贴；依附（可指物理黏附，也可指比喻意义上的“纠缠/依恋/停留”）。"},"examples":[{"en":"In Latin texts, *haerere* can describe mud that sticks to your shoes.","zh":"在拉丁文里，*haerere* 可以用来形容泥巴黏在鞋上。"},{"en":"The poet says his mind “clings” to a memory—using *haerere* in a figurative sense.","zh":"诗人说他的心“依附/纠缠”在一段记忆上——这里用 *haerere* 作比喻用法。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Latin) to hesitate or be stuck, as if unable to move forward (literally or in decision-making).","zh":"（拉丁语）犹豫；卡住；停滞不前（字面或决策上的“迈不出去”）。"},"examples":[{"en":"He *haeret* before answering, unsure what to say.","zh":"他回答前 *haeret*（犹豫不决），不知道该说什么。"},{"en":"The plan *haeret* because the team can’t agree.","zh":"这个计划 *haeret*（陷入停滞），因为团队无法达成一致。"}]}],"synonyms":["cling","stick","adhere","remain","linger","hesitate"],"phonetic":"/ˈhɛr.ə.reɪ/","extraExplanation":["*haerere* 是一个拉丁语动词，常见的英语词源关联包括：**adhere**（黏附）、**cohere**（凝聚/连贯）、**inherent**（固有的、内在的）、**hesitate**（部分学术讨论与“停滞/卡住”的语义相关）。理解“黏住→卡住→犹豫”的语义链，有助于记忆这些英语词。","你也会在拉丁短语或学术写作里见到它的变体或相关派生，如 *adhaerere*（贴近、依附）等；它们常用于较正式或文学性的语境。"]}
{"word":"haeres","summary":{"en":"Haeres is a Latin term meaning “heir,” mainly used in discussions of Roman law or legal history.","zh":"Haeres 是拉丁语词，意为“继承人”，主要用于罗马法或法律史相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin legal term) an heir; a person who inherits property, rights, or responsibilities from someone who has died.","zh":"（拉丁法律术语）继承人；指从死者处继承财产、权利或义务的人。"},"examples":[{"en":"In Roman law, the haeres became responsible for both the assets and the debts of the estate.","zh":"在罗马法中，haeres 不仅继承遗产的资产，也要承担债务。"},{"en":"The will named her as the haeres of his estate.","zh":"遗嘱指定她为其遗产的 haeres（继承人）。"}]}],"synonyms":["heir","inheritor","successor"],"phonetic":"/ˈhɛəriz/","extraExplanation":["“haeres”是拉丁语词，常见于罗马法与后来的法律史、法学论文或古典文本讨论中；在现代英语法律文件里通常直接用“heir”（继承人），而不是“haeres”。","在罗马法语境中，“haeres”往往不只是“拿到财产的人”，还可能意味着承继整体法律地位（包括债务与某些义务），因此比日常英语“heir”更强调“全面承继”。"]}
{"word":"haes","summary":{"en":"HAES = Health at Every Size: a weight-neutral, body-respectful approach to health.","zh":"HAES = Health at Every Size：一种体重中立、尊重身体差异的健康观。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an acronym for “Health at Every Size,” a movement/framework that promotes respectful, weight-neutral healthcare and well-being for people of all body sizes, focusing on healthy behaviors rather than weight loss.","zh":"“Health at Every Size（任何体型皆可健康）”的缩写；一种倡议/理念，主张以尊重与不歧视为前提、以“体重中立”的方式看待健康，把重点放在可持续的健康行为上，而不是把减重当作唯一目标。"},"examples":[{"en":"Some clinics use a HAES approach and focus on habits like sleep and movement instead of the number on the scale.","zh":"有些诊所采用 HAES 方法，更关注睡眠和运动等习惯，而不是体重秤上的数字。"},{"en":"She follows HAES and tries to eat in a way that supports her energy and mood.","zh":"她认同 HAES，尽量用能支持精力和情绪的方式来饮食。"}]}],"synonyms":["weight-neutral approach","body-positive health (informal)","size-inclusive care"],"phonetic":"/ˌeɪtʃ.eɪ.iːˈɛs/","extraExplanation":["HAES 常见于英语健康与身心议题语境中，强调“减少体重偏见（weight stigma）”“尊重身体多样性”“直觉饮食（intuitive eating）”“为愉悦而动（joyful movement）”等理念。","读法上通常把它当字母缩写来念（H-A-E-S），也有人在口语中直接说“hays”，但在正式场合拼读更常见。"]}
{"word":"haesitare","summary":{"en":"Haesitare is a Latin verb meaning “to hesitate; to be unsure and pause,” and it is the source of the English word hesitate.","zh":"Haesitare 是拉丁语动词，意思是“犹豫、踌躇不决”，也是英语 hesitate 的词源。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Latin; verb) to hesitate; to be uncertain or pause because you are not sure what to do or say.","zh":"（拉丁语；动词）犹豫；踌躇不决；因不确定而停顿。"},"examples":[{"en":"In the story, the hero haesitat before entering the dark forest.","zh":"在故事里，英雄在走进黑森林前犹豫了。"},{"en":"Don’t haesitare—choose the safer path.","zh":"别犹豫——选更安全的路。"}]}],"synonyms":["hesitate","pause","waver","dither"],"phonetic":"/ˈhɛzɪˌteɪt/","extraExplanation":["“haesitare”（也常写作 *haesitāre*）是拉丁语动词，英语 **hesitate** 就来自它；拉丁语里的 *ae* 在后来的语言演变中常简化为 *e*，所以拼写从 *haes-* 变成了英语的 *hes-*.","如果你是在英语学习中遇到这个词形，它多半是用来说明词源（etymology），日常英语中不会写作 *haesitare*；现代英语请用 **hesitate**。"]}
{"word":"haesitatus","summary":{"en":"*Haesitatus* is a Latin form meaning “having hesitated; uncertain/paused.”","zh":"*haesitatus* 是拉丁语形式，意思是“已经犹豫过；不确定而停顿的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; past participle of *haesitāre*) “having hesitated; paused in uncertainty.” Often appears in older scholarly writing or quotations from Latin texts.","zh":"（拉丁语；*haesitāre* 的过去分词）“已经犹豫过的；因不确定而停顿的”。常见于学术写作或引用拉丁原文。"},"examples":[{"en":"In the Latin phrase, *haesitatus* describes someone who has already hesitated before acting.","zh":"在这句拉丁短语里，*haesitatus* 用来描述某人在行动前已经犹豫过。"},{"en":"The translator renders *haesitatus* as “hesitant” to keep the English natural.","zh":"译者把 *haesitatus* 译成“犹豫的”，让英文更自然。"}]}],"synonyms":["hesitated","hesitant","uncertain","wavering"],"phonetic":"/ˌhɛzɪˈteɪtəs/","extraExplanation":["*haesitatus* 通常是动词 *haesitāre*（犹豫、踌躇）的过去分词，字面上相当于英文的 “having hesitated”。在拉丁语里，过去分词会随所修饰的名词在性、数、格上变化；你看到的 *-us* 结尾通常对应阳性单数主格（也常作为词条引用形式）。","在英语文本中单独出现 *haesitatus* 多半是作者在引用拉丁原文或做词源/文献讨论；日常英语写作一般直接用 *hesitated*（动词过去式）或 *hesitant*（形容词）。"]}
{"word":"haest","summary":{"en":"“Haest” is not a standard modern spelling; it’s most likely “haste” (quick, often careless speed) or related to “hasten” (to hurry).","zh":"“haest”不是现代英语的标准拼写；多半是“haste”（匆忙、急速，常带欠考虑之意），或与动词“hasten”（赶紧）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “haste”) Speed in doing something, often too fast and without enough care.","zh":"（多半是想写：haste）匆忙；急速（常含“太快、欠考虑”的意思）。"},"examples":[{"en":"In her haste, she forgot her keys.","zh":"她一着急就忘了带钥匙。"},{"en":"Don’t act in haste; take a moment to think.","zh":"别急着做决定；先花点时间想想。"},{"en":"We left in haste when the storm started.","zh":"暴风雨一开始我们就匆忙离开了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(intransitive, formal) To hurry; to do something quickly.","zh":"（不及物，较正式）匆忙；赶紧做某事。"},"examples":[{"en":"He hastened to apologize after hearing what happened.","zh":"他听说发生了什么后赶紧道歉。"},{"en":"They hastened away before it got dark.","zh":"天还没黑他们就匆匆离开了。"}]}],"synonyms":["hurry","rush","urgency","speed","hasten"],"phonetic":"/heɪst/","extraExplanation":["“haest”不是现代英语里的常见拼写；你可能想输入的是“haste”（匆忙）或动词“hasten”（赶紧）。在现代英语中，“haste”更常作名词使用。","常见搭配：in haste（匆忙地）、make haste（赶快）、haste makes waste（谚语：欲速则不达/忙中出错）。"]}
{"word":"haet","summary":{"en":"“haet” is a Scots dialect word meaning “anything” or “even a little,” often seen in “not a haet” = “nothing at all.”","zh":"“haet”是苏格兰方言词，意为“任何东西/一点点”，常见于“not a haet”，表示“完全没有”。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"(Scots, dialect) Anything; something; even the smallest amount (a “bit” or “whit”).","zh":"（苏格兰方言）任何东西；某事物；一点点（哪怕是最小的量）。"},"examples":[{"en":"I didna see haet in the cupboard.","zh":"我在橱柜里什么也没看见。（苏格兰方言用法）"},{"en":"He knows haet about computers.","zh":"他对电脑一窍不通。（苏格兰方言用法）"}]},{"partOfSpeech":"phrase","definition":{"en":"Used in the fixed phrase “not a haet,” meaning “nothing at all.”","zh":"用于固定短语“not a haet”，意思是“什么也没有；一点也不”。"},"examples":[{"en":"There’s not a haet we can do till tomorrow.","zh":"在明天之前我们一点办法也没有。"},{"en":"She said not a haet about the argument.","zh":"她对那场争吵只字未提。"}]}],"synonyms":["anything (dialect sense)","aught (archaic)","a whit (dialect)","nothing at all (for “not a haet”)"],"phonetic":"/heɪt/","extraExplanation":["“haet”主要见于苏格兰英语（Scots）与较旧的英语写法，在现代日常美式英语里很少使用；如果你是在普通拼写里想写“heat（热）”或“hate（恨）”，那可能是拼写错误。","在苏格兰文学与民谣中比较常见（例如描写口语时），常与否定搭配形成强调：not a haet = “完全没有”。"]}
{"word":"haets","summary":{"en":"“haets” is not standard spelling; it most likely means “hates” (from “hate”).","zh":"“haets”不是标准拼写；最可能想写的是“hates”（来自“hate”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Common misspelling) Usually intended to mean “hates,” the third-person singular form of the verb “hate”: to dislike someone or something very strongly.","zh":"（常见拼写错误）通常想表达 “hates”，即动词 “hate” 的第三人称单数：非常强烈地不喜欢某人或某物。"},"examples":[{"en":"He hates loud noises at night.","zh":"他讨厌晚上很吵的声音。"},{"en":"She hates being late for class.","zh":"她很讨厌上课迟到。"}]},{"partOfSpeech":"n.","definition":{"en":"Hate: a very strong feeling of dislike.","zh":"Hate：强烈的厌恶感、憎恨。"},"examples":[{"en":"Hate can damage relationships.","zh":"憎恨会伤害人际关系。"},{"en":"Try not to speak out of hate.","zh":"尽量不要带着仇恨说话。"}]}],"synonyms":["dislike","detest","can’t stand","loathe"],"phonetic":"/heɪt/","extraExplanation":["“haets”不是标准英文拼写。最常见的目标词是“hates”（hate + s）。也有人本来想写“heats”（heat + s，意为“加热/变热”或“热量”），要看你的语境。","发音提示：hate /heɪt/ 结尾是清晰的 /t/ 音；拼写上常把 a 和 e 的位置写反。"]}

