{"word":"haf","summary":{"en":"“HAF” is most commonly internet slang meaning “hot as f***” (= extremely attractive). Sometimes “haf” is also a casual misspelling of “half” or “have.”","zh":"“HAF”最常见是网络俚语，表示“hot as f***”（非常性感/好看）。另外“haf”有时也只是“half”或“have”的随意误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(internet slang, abbreviation) “hot as f***”: extremely attractive (often said about a person or photo).","zh":"（网络俚语/缩写）“hot as f***”：非常性感、非常好看（常用来形容人或照片）。"},"examples":[{"en":"She looks HAF in that new outfit.","zh":"她穿那套新衣服看起来超辣。"},{"en":"This selfie is HAF—post it!","zh":"这张自拍太好看了——发吧！"}]},{"partOfSpeech":"other","definition":{"en":"(nonstandard spelling) A misspelling/short form people sometimes use for “half” or “have” in casual typing (not recommended in formal writing).","zh":"（非标准拼写）在随意打字中，有时被当作“half（半）”或“have（有/已经）”的误拼或简写（正式写作不建议）。"},"examples":[{"en":"I ate haf the pizza. (Better: I ate half the pizza.)","zh":"我吃了披萨的一半。（更好：I ate half the pizza.）"},{"en":"I haf no idea. (Better: I have no idea.)","zh":"我完全不知道。（更好：I have no idea.）"}]}],"synonyms":["very attractive","super hot","really good-looking","extremely"],"phonetic":"/hæf/","extraExplanation":["“HAF”通常全大写使用，语气很口语、带点粗口色彩（因为它省略了f-word）。在不熟悉对象或正式场合（工作、学校邮件等）尽量避免使用。","有时也会看到“cute af / cool af”等结构，表示“非常/超级……”，其中“af”=“as f***”。如果想更礼貌，可以用“really / extremely / so”来替换。"]}
{"word":"Hafez","summary":{"en":"the 14th-century Persian poet from Shiraz; also a name/title linked to memorizing the Qur’an","zh":"14世纪设拉子的波斯诗人；亦可指与背诵《古兰经》相关的人名/称号"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A famous Persian lyric poet (14th century) from Shiraz, best known for a collection of poems called the “Divan,” often quoted for themes of love, wine, spirituality, and wisdom.","zh":"波斯著名抒情诗人（14世纪），来自设拉子，以诗集《Divan（诗集）》闻名；其诗常涉及爱情、酒、灵性与智慧等主题。"},"examples":[{"en":"In Iranian culture, people often quote Hafez when they want comfort or guidance.","zh":"在伊朗文化中，人们常在需要安慰或指引时引用哈菲兹的诗句。"},{"en":"She kept an English translation of Hafez on her bedside table.","zh":"她在床头放着一本哈菲兹诗歌的英文译本。"}]},{"partOfSpeech":"other","definition":{"en":"A given name in some Muslim communities, from a word meaning someone who has memorized the Qur’an (often spelled “Hafiz”).","zh":"一些穆斯林社群中的人名，源自“背诵并牢记《古兰经》的人”（常拼作 Hafiz）。"},"examples":[{"en":"His first name is Hafez, named after his grandfather.","zh":"他名叫 Hafez，是以祖父的名字命名的。"},{"en":"In some places, “Hafiz/Hafez” is used as a respectful title for someone who memorizes the Qur’an.","zh":"在一些地区，“Hafiz/Hafez”也可作为对背诵《古兰经》者的尊称。"}]}],"synonyms":["Hafiz","Ḥāfeẓ"],"phonetic":"ˈhɑːfɛz","extraExplanation":["哈菲兹（约1315–1390）是波斯诗歌“加扎勒（ghazal）”体裁的代表人物之一。他的《哈菲兹诗集》（Divan of Hafez）在伊朗日常生活中影响很深，有些家庭会在节日或重要时刻“翻诗占卜”（fāl-e Hafez），随机翻开诗集来求指引。"],"etymology":"源自阿拉伯语 ḥāfiẓ（意为“守护者、记忆者”，也指背诵《古兰经》的人）。作为诗人名号“Ḥāfeẓ”，通常理解为其曾熟记《古兰经》；英语里常见拼写有 Hafez / Hafiz。","mnemonic":["把 Hafez 记成“哈菲兹（哈+费/菲+兹）”，中文音译稳定，看到就能联想到波斯诗人。","联想词根：ḥāfiẓ=“记住的人”。记忆法：Hafez≈“have”+“(memori)ze”→“把经文记住的人”。"]}
{"word":"haff","summary":{"en":"“Haff” is a rare/dialect spelling meaning “half,” and can also mean a portion or share (especially in Scottish contexts).","zh":"“haff”是较少见的方言/变体拼写，通常表示“half（半）”，在苏格兰语境中也可指“一份/份额”（尤指土地份额）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, Scots/English) A variant spelling or pronunciation of “half” (one of two equal parts).","zh":"（方言，苏格兰/英语）“half”的变体拼写或发音，指“两等份中的一份；一半”。"},"examples":[{"en":"In some Scots writing, you may see “haff” where standard English uses “half.”","zh":"在一些苏格兰英语的写法里，你可能会看到用“haff”来表示标准英语的“half（半）”。"},{"en":"He ate a haff of the sandwich and saved the rest.","zh":"他吃了三明治的一半，把剩下的留着。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, Scotland) A share or portion of something, especially land or an allotment.","zh":"（较少见，苏格兰）一份；一部分（尤指土地份额或分配到的一份）。"},"examples":[{"en":"The family kept a small haff of the land after the sale.","zh":"卖地之后，这家人还保留了一小份土地。"}]}],"synonyms":["half","portion","share"],"phonetic":"/hæf/","extraExplanation":["“haff”在现代标准英语里不常见，多出现在苏格兰相关的方言、地名或较古老的书写中。日常学习与写作中通常用“half”。如果你是想表达“半”，建议使用标准拼写“half”。"]}
{"word":"haffat","summary":{"en":"“haffat” is not a standard English word; it likely needs context (or a corrected spelling).","zh":"“haffat”不是标准英语单词；很可能需要上下文或修正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a surname/place name, or a word from another language.","zh":"不是标准英语单词；更可能是拼写错误、姓氏/地名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “haffat” in an English dictionary—could you mean “half” or “haft”?","zh":"我在英语词典里找不到“haffat”——你是不是想写“half（半）”或“haft（柄）”？ "},{"en":"If “Haffat” is a person’s name, please tell me the context (a sentence) so I can help more.","zh":"如果“Haffat”是人名，请给我一句上下文（完整句子），我才能更准确地帮你。"}]}],"phonetic":"/ˈhæfæt/","extraExplanation":["“haffat”常见情况有三种：\n1）拼写误差：最接近的常用英语词可能是 half（半）或 haft（工具/刀的柄）。\n2）专有名词：可能是姓氏、地名或品牌名，这种情况下“意思”取决于具体指代。\n3）外来词/音译：如果来自阿拉伯语、乌尔都语等语言，英语词典里可能查不到。\n把你看到它的句子或来源（比如书名、歌曲、网页）发我，我可以帮你确认最可能的词和含义。"]}
{"word":"haffet","summary":{"en":"“Haffet” is most likely a proper name (often a surname), not a common English word.","zh":"“Haffet”多半是专有名词（常见为姓氏），不是常用英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (usually a surname). It is not a standard English vocabulary word in most dictionaries.","zh":"一个较少见的专有名词（多为姓氏）。它通常不是英语词典里常见的标准词汇。"},"examples":[{"en":"Ms. Haffet will join the meeting at 3 p.m.","zh":"Haffet 女士将于下午三点参加会议。"},{"en":"I saw the name “Haffet” on the guest list.","zh":"我在来宾名单上看到了“Haffet”这个名字。"}]}],"phonetic":"/ˈhæfɪt/","extraExplanation":["“haffet”很可能是拼写误差或转写差异（比如你想找的是 *haft*、*haphazard*、或某个专有名词）。如果你能提供句子/上下文（它出现在哪一句话里、是哪本书或哪段对话），我可以更准确地判断它的意思和正确拼写。"]}
{"word":"haffets","summary":{"en":"“haffets” is a Scots dialect word meaning the temples/sides of the head.","zh":"“haffets”是苏格兰方言词，意思是太阳穴/头的两侧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) the sides of the head; temples (the area between the forehead and the ear).","zh":"（苏格兰方言）头两侧；太阳穴（额头与耳朵之间的部位）。"},"examples":[{"en":"He rubbed his haffets when the headache started.","zh":"头痛开始时，他揉了揉太阳穴。"},{"en":"The cold wind stung my haffets as I walked outside.","zh":"我走到外面时，冷风刺得我太阳穴发痛。"}]}],"synonyms":["temples","sides of the head"],"phonetic":"/ˈhæfɪts/","extraExplanation":["“haffets/haffits”主要见于苏格兰英语（Scots）和文学化的方言描写，在现代日常标准英语里不常用。标准英语更常说 temples 或 sides of the head。","拼写上有变体（如 haffets / haffits）。如果你是在别的语境里看到这个词，也可能是拼写误差；你可以把原句发我，我能帮你判断更准确的意思。"]}
{"word":"haffit","summary":{"en":"Haffit is a Scottish/Scots adjective meaning ‘foolish/half-witted,’ and in some dialect use it can also describe an animal with a white mark on one side of its face.","zh":"haffit 是苏格兰方言形容词，常指“傻、半吊子”；在某些方言用法中也可形容动物脸一侧有白色斑纹。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scottish English/Scots, informal) Not very intelligent; foolish; half-witted.","zh":"（苏格兰英语/苏格兰语，非正式）不太聪明的；傻的；有点“半吊子”的。"},"examples":[{"en":"He’s a bit haffit, but he means well.","zh":"他有点傻，但人不坏。"},{"en":"Don’t be haffit—read the instructions first.","zh":"别犯傻——先把说明书读了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scottish English/Scots, dialect) Having a white marking on one side of the face (often used for animals, especially sheep).","zh":"（苏格兰英语/苏格兰语，方言）脸的一侧有白色斑纹的（常用于动物，尤其是羊）。"},"examples":[{"en":"They kept a haffit ewe in the field near the road.","zh":"他们在靠路的田里养着一只半边脸有白斑的母羊。"}]}],"synonyms":["foolish","silly","half-witted","daft (Scot.)"],"phonetic":"/ˈhæfɪt/","extraExplanation":["“haffit”不是现代标准英语里的常用词，更多见于苏格兰地区的方言/口语。若你是在聊天、歌词或苏格兰背景的小说里看到它，上下文通常能判断是“有点傻/不聪明”的意思。","拼写上容易和标准英语的“half”混淆；在正式写作中，一般用“foolish / silly / not very smart”等更通用的词。"]}
{"word":"haffits","summary":{"en":"“Haffits” is likely a misspelling of “habits,” meaning regular routines or behaviors you do often.","zh":"“haffits”很可能是“habits”的拼写错误，意思是你经常做的日常规律或行为（习惯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) A regular behavior or routine—something you do often, sometimes without thinking.","zh":"（常用复数）习惯；常做的行为或日常规律——经常做、有时不经思考就会做的事。"},"examples":[{"en":"Brushing your teeth before bed is a good habit.","zh":"睡前刷牙是个好习惯。"},{"en":"I’m trying to build healthier habits, like walking every day.","zh":"我在努力养成更健康的习惯，比如每天走路。"},{"en":"She has a habit of checking her phone during meals.","zh":"她有个习惯：吃饭时看手机。"}]},{"partOfSpeech":"n.","definition":{"en":"A special set of clothes, especially worn by a nun, monk, or in some formal traditions.","zh":"（特定服装）制服；（尤指）修女或僧侣的服饰等。"},"examples":[{"en":"The nun wore a traditional habit.","zh":"那位修女穿着传统的修女服。"}]}],"synonyms":["routines","patterns","customs","practices"],"phonetic":"/ˈhæbɪts/","extraExplanation":["你输入的“haffits”在英语里不是常见拼写，最可能是“habits”的拼写错误（habit 的复数）。","发音与拼写提示：habit（单数）拼写是 h-a-b-i-t；复数 habits 结尾加 -s。","常见搭配：build/develop habits（养成习惯），break a habit（戒掉习惯），bad/good habits（坏/好习惯）；常见谚语：Old habits die hard（旧习难改）。"]}
{"word":"haffkinize","summary":{"en":"A rare historical verb meaning “to vaccinate,” especially with Haffkine’s cholera/plague vaccines.","zh":"一个罕见的历史用语，意为“接种疫苗”，尤指用哈夫金研制的霍乱/鼠疫疫苗进行接种。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to inoculate (vaccinate), especially using or in the manner of Waldemar Haffkine’s vaccines (historically, against cholera or plague).","zh":"给……接种疫苗；尤指使用或以哈夫金（Waldemar Haffkine）所研制疫苗的方式进行接种（历史上多指霍乱或鼠疫）。"},"examples":[{"en":"During the outbreak, doctors tried to haffkinize as many residents as possible.","zh":"在疫情暴发期间，医生尽量给更多居民接种（哈夫金式的）疫苗。"},{"en":"The records show that thousands were haffkinized in Bombay in the 1890s.","zh":"记录显示，19世纪90年代在孟买有成千上万人接受了哈夫金式接种。"}]}],"synonyms":["vaccinate","inoculate","immunize"],"phonetic":"/ˈhæfkɪˌnaɪz/","extraExplanation":["“haffkinize”来自科学家 Waldemar Haffkine（沃尔德马·哈夫金）的姓氏。他在19世纪末研发并推广了早期的霍乱与鼠疫疫苗，因此该词在历史语境中常指“用哈夫金的疫苗给人群接种”。","这是非常罕见、偏历史/学术的用词；现代英语通常直接说 vaccinate / inoculate。"]}
{"word":"haffle","summary":{"en":"Haffle is a rare dialect word meaning to hesitate or stammer, or the hesitation itself.","zh":"Haffle 是一个少见的方言词，指“犹豫/结巴”，也可指这种“犹豫或结巴的状态”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(dialect, rare) To hesitate, falter, or speak with stops and starts (as if stammering).","zh":"（方言，少见）犹豫、踌躇；说话结结巴巴、吞吞吐吐。"},"examples":[{"en":"He haffled for a moment before answering the question.","zh":"他在回答问题前犹豫了一下。"},{"en":"Don’t haffle—just tell me what happened.","zh":"别吞吞吐吐的，直接告诉我发生了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"(dialect, rare) A hesitation or faltering in speech; a stammer.","zh":"（方言，少见）犹豫/停顿；口吃、结巴。"},"examples":[{"en":"There was a haffle in his voice when he tried to explain.","zh":"他试图解释时，声音里带着一丝结巴和停顿。"}]}],"synonyms":["hesitate","falter","stammer"],"phonetic":"/ˈhæfəl/","extraExplanation":["“haffle”不是现代标准英语里的常用词，更常见于苏格兰英语/方言语境中，因此在大多数词典和日常交流里不常见。","如果你本来想写的是“hassle”（麻烦、烦扰）或“huffle”（噗噗喘气/慌乱挪动，较少见），告诉我你的句子，我可以帮你确认最合适的拼写与用法。"]}
{"word":"hafflins","summary":{"en":"Halfling usually means a small, human-like fantasy character (common in Tolkien and D&D).","zh":"Halfling 通常指奇幻作品中的“半身人”，一种矮小、外形似人类的种族（常见于托尔金与D&D）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, human-like person in fantasy stories (especially in Tolkien and Dungeons & Dragons); often cheerful, peace-loving, and fond of comfort and food","zh":"（奇幻作品中的）半身人；一种身材矮小、外形似人类的种族（常见于托尔金与《龙与地下城》）"},"examples":[{"en":"In The Lord of the Rings, Frodo is a halfling.","zh":"在《指环王》中，弗罗多是半身人。"},{"en":"Our D&D party has a halfling rogue who moves quietly.","zh":"我们D&D队伍里有个半身人盗贼，行动很安静。"},{"en":"Halflings in this world prefer peaceful villages to big cities.","zh":"在这个世界里，半身人更喜欢宁静的乡村而不是大城市。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal) a person who is smaller than average (can sound rude depending on context)","zh":"（罕见，非正式）个子比一般人矮小的人（视语境可能显得不礼貌）"},"examples":[{"en":"Avoid using halfling to describe real people—it may offend them.","zh":"不要用“halfling”来形容现实中的人——可能会冒犯对方。"}]}],"synonyms":["hobbit (often used in Tolkien contexts)","little folk","smallfolk"],"phonetic":"ˈhæfˌlɪŋ","extraExplanation":["你输入的“hafflins”很可能是拼写误差，常见正确拼写是 **halflings**（复数），单数为 **halfling**。","“Halfling”在现代英语里最常见的来源与影响是托尔金的作品（常与“Hobbit/霍比特人”相关联）以及《龙与地下城》（D&D）等桌游设定。不同作品对“halfling”的外形与性格细节会略有差异。","在一般英语交流中，“halfling”几乎总是指奇幻设定的种族；用它指现实中的矮个子人可能带有贬义或戏谑，不建议这样使用。"]}
{"word":"hafgan","summary":{"en":"Hafgan is a character in Welsh mythology (the Mabinogion), a rival in Annwn who is defeated by Pwyll.","zh":"Hafgan是威尔士神话《马比诺吉昂》中的人物，为Annwn的竞争对手，最终被Pwyll击败。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Welsh mythology) A rival ruler in Annwn (the Otherworld) in the medieval Welsh tales known as the Mabinogion; he is defeated by Pwyll while Pwyll is helping Arawn.","zh":"（威尔士神话）《马比诺吉昂》（Mabinogion，威尔士中世纪故事集）中的人物，传说中为“Annwn（冥界/异界）”的竞争对手统治者；在帮助Arawn时，Pwyll击败了他。"},"examples":[{"en":"In the First Branch of the Mabinogion, Pwyll fights Hafgan on Arawn’s behalf.","zh":"在《马比诺吉昂》第一支故事中，Pwyll代表Arawn与Hafgan决斗。"},{"en":"Hafgan is often described as Arawn’s enemy in summaries of Welsh mythology.","zh":"在许多威尔士神话梗概里，Hafgan常被称为Arawn的宿敌。"}]}],"phonetic":"ˈhævɡən","extraExplanation":["“Hafgan”通常作为专名出现，来自威尔士语传统故事。《马比诺吉昂》是了解威尔士神话与传说的重要文本来源之一。","如果你本来想查的是“Afghan（阿富汗的；阿富汗人）”，请告诉我，我可以给出对应词条与用法。"]}
{"word":"hafidh","summary":{"en":"someone who has memorized the entire Qur’an","zh":"背诵并牢记整部《古兰经》的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who has memorized the entire Qur’an (often honored with this title in Muslim communities).","zh":"（伊斯兰语境）背诵并牢记整部《古兰经》的人（常作为一种荣誉称号）。"},"examples":[{"en":"In many communities, becoming a hafidh is seen as a major spiritual achievement.","zh":"在许多社群里，成为一名 hafidh 被视为重要的精神成就。"},{"en":"She studied for years and was recognized as a hafidh after completing her memorization.","zh":"她学习多年，完成背诵后被认可为 hafidh。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, a keeper or memorizer of something (a less common, broader sense from the original Arabic).","zh":"（较少见）更泛指某事物的“守护者 / 牢记者 / 记忆者”（源自阿拉伯语原义的引申）。"},"examples":[{"en":"The word originally carries the sense of someone who preserves and protects knowledge.","zh":"这个词最初带有“保存并守护知识的人”的含义。"}]}],"synonyms":["Quran memorizer","memorizer"],"phonetic":"/ˈhɑːfɪð/","extraExplanation":["文化提示：在很多穆斯林社会里，成为 hafidh 往往需要长期学习与反复背诵，也常与诵读规则（tajwīd）训练相关；这一称号通常带有尊敬意味。","拼写与读音：-dh 常用来表示阿拉伯语字母 ذ 的音（接近英语 this 里的 /ð/）。不同地区转写不同，所以你也会看到 hafiz（以 -z 结尾）等形式。"],"etymology":"来自阿拉伯语 ḥāfiẓ（حافظ），本义为“守护者、保管者、牢记者”。在英语语境中多用于指“背诵整部《古兰经》的人”。拼写上也常见 hafiz / hafidh 等变体（与不同转写系统有关）。","mnemonic":["把 hafidh 记成“have it（都记住了）”：把整部经典都“拥有在脑子里”。","联想中文“护（hù）+ 记（jì）”：既“守护”又“牢记”。"]}
{"word":"hafis","summary":{"en":"Hafis is usually a noun meaning someone who has memorized the entire Qur’an; it can also be a personal name and a spelling variant of Hafiz/Hafez.","zh":"Hafis通常作名词，指完整背诵《古兰经》的人；也可作人名，并且是Hafiz/Hafez的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has memorized the entire Qur’an (often honored with the title “Hafiz/Hafiz”).","zh":"（伊斯兰文化中）背诵并牢记整部《古兰经》的人（常被尊称为“Hafiz/Hafiz”）。"},"examples":[{"en":"In many Muslim communities, a hafis is respected for memorizing the Qur’an.","zh":"在许多穆斯林社区里，hafis（哈菲兹/背诵者）因背诵《古兰经》而受到尊敬。"},{"en":"He studied for years to become a hafis.","zh":"他学习多年，努力成为一名hafis。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (especially in Muslim cultures); also a spelling variant of “Hafiz/Hafez.”","zh":"人名（常见于穆斯林文化）；也可视为“Hafiz/Hafez”的拼写变体。"},"examples":[{"en":"Hafis is a common name in some countries.","zh":"在一些国家，Hafis是比较常见的名字。"},{"en":"You may also see it written as Hafiz or Hafez in English.","zh":"英文里你也可能看到它写作Hafiz或Hafez。"}]}],"synonyms":["Hafiz","Hafez","Qur’an memorizer"],"phonetic":"hɑːˈfiːz","extraExplanation":["“Hafis/Hafiz”（也常音译为“哈菲兹”）源自阿拉伯语词根，核心含义与“守护、保存、牢记”有关，因此用来称呼“把《古兰经》完整背诵并记住的人”。不同地区的拉丁字母拼写会不一样：Hafiz、Hafis、Hafez 都可能出现。","文学与文化提示：英语里提到波斯诗人时常写作 “Hafez” 或 “Hafiz of Shiraz”（设拉子之哈菲兹），他是14世纪著名诗人；这与“背诵《古兰经》的人”这个称号在词源上相关，但在语境中通常指具体历史人物。"]}
{"word":"Hafiz","summary":{"en":"A celebrated Persian lyric poet; also a common male name in some cultures.","zh":"著名波斯抒情诗人；也可作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous 14th-century Persian lyric poet from Shiraz, best known for the collection of poems called the Divan; widely quoted in Persian-speaking cultures.","zh":"14世纪著名波斯抒情诗人，来自设拉子（Shiraz），代表作诗集《哈菲兹诗集》（Divan），在波斯语文化圈中被广泛引用。"},"examples":[{"en":"In our literature class, we read a few poems by Hafiz in translation.","zh":"在文学课上，我们读了几首哈菲兹的译诗。"},{"en":"Many people in Iran can recite lines from Hafiz from memory.","zh":"在伊朗，很多人能背诵哈菲兹的诗句。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name, common in Persian- and Arabic-speaking communities.","zh":"男性名字，在波斯语与阿拉伯语社群中较常见。"},"examples":[{"en":"Hafiz said he would call me after the meeting.","zh":"哈菲兹说他会在会后给我打电话。"},{"en":"Her brother’s name is Hafiz.","zh":"她哥哥叫哈菲兹。"}]}],"synonyms":["Hafez"],"phonetic":"/hɑːˈfiːz/","extraExplanation":["在伊朗与阿富汗等地，《哈菲兹诗集》（Divan-e Hafiz）不仅是文学经典，也常用于“抽诗占卜”（fal-e Hafez）：人们随手翻开诗集，以诗句来寄托当下的心愿与解释。","英文里也常见拼写变体 Hafez；两者通常指同一位诗人。"],"etymology":"源自阿拉伯语 ḥāfiẓ，原意是“守护者、保管者”，也常指“能背诵《古兰经》的人”。后来成为人名与尊称；诗人哈菲兹的名号也与此相关。","mnemonic":["记音：哈菲兹（Hafiz）≈“哈-菲-兹”，三拍很像中文音译，读顺口就不容易忘。","记义：把 Hafiz 联想成“能把经典背下来的人”（ḥāfiẓ 的本义），诗人之所以叫这个名号，也让人想到“诗句被人背诵传唱”。"]}
{"word":"hafiz","summary":{"en":"Hafiz can mean the celebrated Persian poet (often spelled Hafez) or a person who has memorized the entire Qur’an.","zh":"Hafiz 既可指著名的波斯诗人（也常拼作 Hafez），也可指背诵完整《古兰经》的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A famous 14th‑century Persian poet from Shiraz, best known for lyrical poems (ghazals) about love, spirituality, and the human heart; also spelled Hafez.","zh":"（专有名词）14世纪波斯（伊朗）设拉子著名诗人，以抒情短诗（加扎勒）闻名，主题常涉及爱情、灵性与人生；也常拼作 Hafez。"},"examples":[{"en":"In literature class, we read a translation of Hafiz’s poems about love and longing.","zh":"在文学课上，我们读了哈菲兹关于爱情与思念的诗歌译本。"},{"en":"Some English speakers discover Hafiz through modern poetry collections and quotes.","zh":"一些英语读者是通过现代诗歌选集和引文认识哈菲兹的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common noun, especially in Muslim contexts) A person who has memorized the entire Qur’an; also spelled hafidh/hafiz (varies by region).","zh":"（普通名词，常见于穆斯林语境）背诵完整《古兰经》的人；也可拼作 hafidh/hafiz（因地区而异）。"},"examples":[{"en":"He became a hafiz after years of study and recitation.","zh":"他经过多年的学习与诵读，成为一名哈菲兹（古兰经背诵者）。"},{"en":"The community invited a hafiz to lead recitations during Ramadan.","zh":"社区邀请一位哈菲兹在斋月期间带领诵读。"}]}],"synonyms":["Hafez","hafidh"],"phonetic":"/hɑːˈfiːz/","extraExplanation":["“Hafiz/Hafez”在英文里既可能指诗人，也可能指宗教头衔，具体含义要看上下文（如文学课/诗歌常指诗人；清真寺/斋月语境常指背诵者）。","哈菲兹的诗歌在波斯文化中影响很深；伊朗有“抽签问诗”（fal-e Hafez）的民俗：在重要时刻翻开《哈菲兹诗集》取诗句作象征性的指引。"]}
{"word":"haflin","summary":{"en":"Haflin is most likely a rare surname (a proper name), not a common English word.","zh":"Haflin 多半是较少见的姓氏（专有名词），不是常用英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper noun (usually a family name/surname). It is not a common English vocabulary word and may be a misspelling of a more common word.","zh":"一个较少见的专有名词（通常为姓氏）。它不是常见英语词汇，也可能是更常见单词的拼写错误。"},"examples":[{"en":"Ms. Haflin will join the meeting at 3 p.m.","zh":"Haflin 女士将于下午三点参加会议。"},{"en":"I found an author named Haflin in the library catalog.","zh":"我在图书馆目录里找到一位名为 Haflin 的作者。"}]}],"phonetic":"/ˈhæflɪn/","extraExplanation":["“Haflin”在常用英语词典中不算常见词条，更可能是人名/姓氏。","如果你想查的是幻想文学里常见的“halfling”（半身人/霍比特式小个子族群），拼写通常是 halfling。也有人把“laughing（笑）/hatching（孵化）/half in（半在……里）”之类的词组打错成类似拼法；你可以告诉我上下文句子，我能帮你确认。"]}
{"word":"hafnia","summary":{"en":"Hafnia is (1) a genus of bacteria (notably Hafnia alvei) and (2) a historical Latin name for Copenhagen.","zh":"Hafnia 可指（1）哈夫尼菌属（尤指 Hafnia alvei），也可指（2）哥本哈根的历史性拉丁名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of bacteria, especially known through the species Hafnia alvei, which can live in the intestines of humans and animals and may sometimes be linked to infections.","zh":"一种细菌属（哈夫尼菌属），常见代表为 H. alvei（哈夫尼菌），可存在于人和动物肠道中，偶尔与感染有关。"},"examples":[{"en":"The lab report identified Hafnia alvei in the stool culture.","zh":"实验室报告在粪便培养中鉴定出了 Hafnia alvei（哈夫尼菌）。"},{"en":"Hafnia is usually considered an opportunistic bacterium rather than a common cause of disease.","zh":"Hafnia 通常被视为机会性细菌，而不是常见致病原因。"}]},{"partOfSpeech":"n.","definition":{"en":"a Latin name for Copenhagen, Denmark (mainly historical or literary).","zh":"丹麦首都哥本哈根的拉丁名称（多见于历史或文学语境）。"},"examples":[{"en":"Some old texts refer to Copenhagen as Hafnia.","zh":"一些旧文献会把哥本哈根称作 Hafnia。"},{"en":"The university’s Latin motto includes a reference to Hafnia.","zh":"这所大学的拉丁格言中提到了 Hafnia（指哥本哈根）。"}]}],"synonyms":["Hafnia alvei (species, not a true synonym)","Copenhagen (for the place-name sense)"],"phonetic":"/ˈhæfniə/","extraExplanation":["“Hafnia”源自哥本哈根的拉丁名称；细菌属名也由此而来，体现了拉丁语在地名与生物命名中的传统影响。","在医学与微生物语境中，你更常见到的是具体物种名“*Hafnia alvei*”（双名法：属名 + 种加词）。"]}
{"word":"Hafnium","summary":{"en":"Hafnium is a metallic chemical element (Hf), best known for absorbing neutrons and being used in nuclear technology.","zh":"铪是一种金属化学元素（Hf），以强吸收中子、用于核技术而著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Hf) that is a shiny, silver-gray metal, used especially in nuclear reactors because it strongly absorbs neutrons and is resistant to corrosion","zh":"铪（化学元素，符号 Hf）：一种有光泽的银灰色金属，因强吸收中子且耐腐蚀，尤其用于核反应堆等领域"},"examples":[{"en":"Hafnium is used in control rods in some nuclear reactors to help regulate the reaction.","zh":"铪可用于某些核反应堆的控制棒，以帮助调节反应。"},{"en":"The symbol for hafnium is Hf on the periodic table.","zh":"在元素周期表上，铪的元素符号是 Hf。"}]}],"synonyms":["Hf (chemical symbol)"],"phonetic":"/ˈhæfniəm/","extraExplanation":["“hafnium”这个名字来自拉丁文 Hafnia，意为哥本哈根（Copenhagen）的拉丁名。因为铪是在丹麦科学界的研究中被确认并命名的。","学习提示：化学元素名在英语里通常首字母大写（Hafnium），但在句中也常见小写写法；更正式或在标题中常用大写。"]}
{"word":"hafnium","summary":{"en":"Hafnium is the chemical element Hf, a metal used especially in nuclear and high-temperature applications.","zh":"Hafnium（铪）是化学元素 Hf，一种金属，常用于核工业与耐高温相关用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Hf) that is a shiny, silver-gray metal, found naturally in zircon minerals and used in nuclear reactors and high-temperature alloys","zh":"化学元素“铪”（符号 Hf），一种有光泽的银灰色金属，常与锆矿物共生，常用于核反应堆与耐高温合金等"},"examples":[{"en":"Hafnium is used in control rods because it absorbs neutrons well.","zh":"铪常用于控制棒，因为它对中子的吸收能力很强。"},{"en":"Scientists separated hafnium from zircon minerals to study its properties.","zh":"科学家从含锆矿物中分离出铪来研究它的性质。"}]}],"synonyms":["Hf","hafnium (element)"],"phonetic":"/ˈhæfniəm/","extraExplanation":["“hafnium”这个名字来自拉丁语“hafnia”，指哥本哈根（Copenhagen）的拉丁名。铪在1923年于哥本哈根被确认发现，因此以此命名。","在材料科学里，铪常以“氧化铪”（hafnium oxide, HfO₂）的形式出现，用作高介电常数（high‑k）材料，常见于现代半导体工艺中。"]}
{"word":"hafniums","summary":{"en":"“Hafniums” is the plural of “hafnium,” the chemical element Hf.","zh":"“hafniums”是“hafnium（铪，元素符号Hf）”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the chemical element hafnium (symbol Hf), a hard, shiny, silver-gray metal used especially in nuclear technology and high-temperature alloys","zh":"化学元素“铪”（符号 Hf），一种坚硬、有金属光泽的银灰色金属，常用于核技术与耐高温合金等领域"},"examples":[{"en":"Hafnium is used in nuclear control rods because it absorbs neutrons.","zh":"铪常用于核反应堆的控制棒，因为它能吸收中子。"},{"en":"Scientists tested hafnium-based alloys for parts that must withstand very high heat.","zh":"科学家测试了含铪合金，用于必须承受极高温度的部件。"}]}],"synonyms":["hafnium","Hf","element 72"],"phonetic":"/ˈhæfniəm/","extraExplanation":["“hafnium”来自拉丁语“Hafnia”，是丹麦首都哥本哈根（Copenhagen）的拉丁名；该元素于1923年在哥本哈根被确认并命名。","拼写提示：单数 hafnium；复数 hafniums（也可写作 hafnia，但较少见，通常在学术语境中使用）。"]}
{"word":"hafnyl","summary":{"en":"“Half-nil” means a score of 1–0 in soccer/football (especially in British English).","zh":"“half-nil”表示足球比分1比0（多见于英式英语）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(BrE, football/soccer) A score of 1–0; one team has one goal and the other has none.","zh":"（英式英语，足球）比分1比0；一方进1球，另一方0球。"},"examples":[{"en":"At halftime, it was half-nil to the home side.","zh":"中场休息时，主队以1比0领先。"},{"en":"They won the match by a half-nil score.","zh":"他们以1比0的比分赢下了比赛。"}]}],"synonyms":["one-nil","1–0","one to nil"],"phonetic":"/ˌhæfˈnɪl/","extraExplanation":["“half-nil”（也常写作half nil）主要出现在英式英语的足球报道里：half = 1的一半（half a dozen=6的逻辑延伸），nil = 0（源自拉丁语nihil“无”）。因此half-nil表示“1比0”，类似的还有two-nil（2比0）、three-nil（3比0）。","你输入的“hafnyl”很可能是把“half-nil”连写并拼错了；标准写法通常是“half-nil”或“half nil”。"]}
{"word":"hafoc","summary":{"en":"“Hafoc” is likely a misspelling of “havoc,” meaning great damage, disorder, or trouble.","zh":"“hafoc”很可能是“havoc”的拼写错误，意思是严重的破坏、混乱或麻烦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Most likely) a misspelling of “havoc”: widespread disorder, destruction, or trouble.","zh":"（多半是拼写错误）应为“havoc”：大范围的混乱、破坏或麻烦。"},"examples":[{"en":"The storm caused havoc across the coast.","zh":"暴风雨在沿海地区造成了严重破坏。"},{"en":"A computer virus can wreak havoc on your files.","zh":"电脑病毒可能会对你的文件造成严重破坏。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause a lot of damage or problems (usually in the phrase “wreak havoc”).","zh":"造成大量破坏或问题（常用于短语“wreak havoc”）。"},"examples":[{"en":"The delayed shipment wreaked havoc on our schedule.","zh":"延迟的发货把我们的计划搅得一团糟。"},{"en":"Heavy rain can wreak havoc on traffic.","zh":"大雨会让交通陷入混乱。"}]}],"synonyms":["destruction","chaos","disorder","damage","mayhem","turmoil"],"phonetic":"/ˈhævək/","extraExplanation":["“hafoc”不是常见英语单词，最可能是把“havoc”拼错了（a 常被误写成 f 或打字失误）。","常见搭配是“wreak havoc (on…)”，意思是“对……造成严重破坏/带来混乱”。在新闻和书面英语中很常见。"]}
{"word":"haft","summary":{"en":"“Haft” means the handle of a tool or weapon, and as a verb it means to attach or fit a handle.","zh":"“Haft”指工具或武器的柄；作动词表示给工具/武器装柄或把刀刃等装到柄上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the handle of a tool or weapon, such as a knife, axe, or sword","zh":"（刀、斧、剑等工具或武器的）柄，把手"},"examples":[{"en":"The knife’s haft is made of wood.","zh":"这把刀的刀柄是木头做的。"},{"en":"Hold the axe by the haft, not by the head.","zh":"拿斧头要握住斧柄，不要握住斧头的头部。"}]},{"partOfSpeech":"v.","definition":{"en":"to fit a handle to a tool or weapon; to attach a blade/head to its handle","zh":"给（工具或武器）装柄；把（刀刃/斧头等）装到柄上"},"examples":[{"en":"They hafted the blade onto a new handle.","zh":"他们把刀刃装到一根新柄上。"},{"en":"The craftsman hafts knives by hand.","zh":"这位工匠用手工给刀装柄。"}]}],"synonyms":["handle","hilt (for swords/knives)","grip"],"phonetic":"/hæft/","extraExplanation":["“Haft”多用于较正式或偏文学/工艺语境；日常口语里更常说“handle”（把手、柄）。","词源与古英语/日耳曼语有关，原意接近“抓握的部分”。在历史或武器介绍中（如剑、匕首的结构）很常见。"]}
{"word":"haft-maker","summary":{"en":"a craftsperson who makes tool handles","zh":"制作工具手柄的工匠"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes hafts (handles) for tools, knives, or weapons","zh":"制作（刀具、工具或武器）手柄/柄部的人；制柄工"},"examples":[{"en":"The haft-maker shaped the wooden handle to fit the blade perfectly.","zh":"制柄工把木质手柄打磨得与刀刃严丝合缝。"},{"en":"In the old workshop, a haft-maker and a blacksmith often worked side by side.","zh":"在旧时的作坊里，制柄工常常与铁匠并肩工作。"}]}],"synonyms":["handle-maker","tool-handle maker","craftsperson"],"phonetic":"/ˈhæftˌmeɪkɚ/","extraExplanation":["“haft”常用于较传统或工艺语境，指刀、斧、锤等工具的“柄/把”。现代更常见的说法是 handle-maker 或直接说 handle。","在工艺与收藏领域（如刀具、传统木工工具），“haft”仍较常见，因为它强调“与刀刃/工具头相配的柄部结构”。"],"etymology":"“haft”源自古英语 hæft，意为“把手、柄部”；后与 “maker”（制作者）组合成复合词，指专门制作工具柄的人。","mnemonic":["把 haft 记成“hand 的亲戚”：都和“手握的部分”有关——haft 就是“手握的柄”。","haft-maker = haft（柄）+ maker（制造者）→ “做柄的人”。"]}
{"word":"haftara","summary":{"en":"A synagogue reading from the Prophets, usually read after the Torah portion on Shabbat and many holidays.","zh":"犹太会堂礼拜中在《妥拉》之后诵读的《先知书》选段，多见于安息日和许多节日。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a passage from the Hebrew Prophets (Nevi’im) that is read aloud in synagogue, usually after the Torah reading on Shabbat and many Jewish holidays","zh":"（犹太会堂礼拜中）在诵读《妥拉》之后朗读的一段《先知书》（《尼维因》）选段，通常在安息日和许多犹太节日进行"},"examples":[{"en":"After the Torah reading, the congregation listened to the haftara.","zh":"诵读完《妥拉》后，会众聆听了 haftara（先知书选段）的朗读。"},{"en":"Each week’s haftara is chosen to connect with the theme of the Torah portion.","zh":"每周的 haftara 通常会与当周的《妥拉》经文主题相呼应。"},{"en":"She practiced chanting the haftara for her bat mitzvah.","zh":"她为自己的成人礼（bat mitzvah）练习吟诵 haftara。"}]}],"synonyms":["Haftarah"],"phonetic":"/hɑfˈtɑrə/","extraExplanation":["“Haftara”更常见的英文拼写是“Haftarah”。来源与希伯来语相关，常被解释为“结束/告别”的意思，因为它在传统礼拜中接续并延伸了《妥拉》的诵读。","在许多社区中，haftara 会用特定的吟诵旋律（chanting trope）来朗读；在成人礼（bar/bat mitzvah）中，孩子常会学习并公开吟诵当周的 haftara。"]}
{"word":"Haftarah","summary":{"en":"a synagogue reading from the Prophets after the Torah portion","zh":"《妥拉》之后在会堂朗读的《先知书》选段"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a passage from the Hebrew Prophets read aloud in a synagogue service, usually after the Torah reading on Sabbaths and festivals","zh":"（犹太会堂礼拜中）在诵读《妥拉》之后朗读的《先知书》选段，常见于安息日与节期"},"examples":[{"en":"During the service, the Torah portion was followed by the Haftarah.","zh":"礼拜中，诵读《妥拉》经段之后接着朗读了《先知书》选段。"},{"en":"She practiced chanting the Haftarah for weeks before her bat mitzvah.","zh":"为了女成人礼（bat mitzvah），她提前几周练习吟唱《先知书》选段。"}]}],"synonyms":["prophetic reading","reading from the Prophets"],"phonetic":"/hɑfˈtɑrə/","extraExplanation":["文化小贴士：Haftarah 的选段通常与当天的《妥拉》经段在主题上有关联（例如共同的故事、意象或道德议题），不同犹太传统（如阿什肯纳兹、塞法迪）在具体选段与吟唱旋律上可能有所差异。"],"etymology":"源自希伯来语 haftara（הפטרה），本义与“结束、告一段落”相关；在礼拜中指《妥拉》诵读后的“补充/续读”经文（通常取自《先知书》）。","mnemonic":["把它拆成“haft + arah”来记：haft≈half（后半段/后续），Haftarah 常在《妥拉》之后“接着读”。","联想中文“哈夫塔拉”像“哈—附—他—拉”：附（附加）在《妥拉》之后的先知书选读。"]}
{"word":"haftarah","summary":{"en":"A synagogue reading from the Prophets, read after the weekly Torah portion.","zh":"会堂中在每周《妥拉》之后诵读的《先知书》经文选段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A selected passage from the Hebrew Bible’s Prophets (Nevi’im) that is read in synagogue after the weekly Torah portion on Sabbaths and certain holidays.","zh":"（犹太教）在安息日或某些节日礼拜中，紧接每周《妥拉》读经之后诵读的一段《先知书》（《尼维伊姆》）经文选段。"},"examples":[{"en":"After the Torah reading, the congregation listened to the haftarah.","zh":"在《妥拉》读经之后，会众聆听了《哈夫塔拉》读经。"},{"en":"This week’s haftarah comes from the Book of Isaiah.","zh":"本周的《哈夫塔拉》选自《以赛亚书》。"}]}],"synonyms":["prophetic reading"],"phonetic":"/hɑfˈtɑrə/","extraExplanation":["“Haftarah”来自希伯来语，常被解释为与“结束/总结”相关，因为它在《妥拉》读经之后进行。英语里也常见拼写变体：haftorah、haphtarah。","不同犹太社群（如阿什肯纳兹、塞法迪等）在同一周的《哈夫塔拉》选择与诵读旋律（chant/cantillation）上可能有所差异。","在许多会堂传统中，《哈夫塔拉》常由被称为“maftir”的读经者或一位会众成员诵读，并配有祝福词。"]}
{"word":"haftarahs","summary":{"en":"Haftarahs are the synagogue readings from the Prophets, read after the weekly Torah portion (plural of haftarah).","zh":"Haftarahs 指礼拜中在每周《妥拉》经文之后诵读的《先知书》选段（haftarah 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of haftarah: readings from the Prophets (Nevi’im) that are read in synagogue services, usually after the weekly Torah portion on Sabbaths and holidays.","zh":"haftarah 的复数：在犹太会堂礼拜中诵读的《先知书》（Nevi’im）选段，通常在安息日或节日的每周《妥拉》经文之后诵读。"},"examples":[{"en":"This week’s haftarahs focus on themes of comfort and renewal.","zh":"本周的 haftarahs 主要围绕安慰与更新的主题。"},{"en":"Different communities may choose slightly different haftarahs for the same Torah portion.","zh":"不同社群可能会为同一段《妥拉》经文选择略有不同的 haftarahs。"}]}],"synonyms":["prophetic readings","Haftarah portions","haftarot"],"phonetic":"/hɑfˈtɑrəz/","extraExplanation":["“Haftarah”来自希伯来语，意思接近“结束/收尾”，因为它传统上在《妥拉》诵读之后进行。","复数形式常见有两种：英文写法的 haftarahs，以及更贴近希伯来语音译的 haftarot（也写作 haftorot）。两者在英语语境中都能见到。","Haftarahs 往往与当周的《妥拉》经文在主题上呼应（例如救赎、审判、安慰），不同犹太传统（如阿什肯纳兹、塞法迪等）在具体选段上可能存在差异。"]}
{"word":"haftaras","summary":{"en":"“Haftaras” means Haftarah readings—selected passages from the Prophets read in synagogue after the Torah reading.","zh":"“haftaras”指“哈夫塔拉”读经（复数）：在会堂《托拉》读经后诵读的《先知书》选段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Haftarah (plural: haftaras/haftarot): a passage from the Prophets (Nevi’im) read publicly in the synagogue after the Torah reading on Sabbaths and some holidays.","zh":"哈夫塔拉（复数：haftaras/haftarot）：在犹太会堂礼拜中，于安息日及部分节日的《托拉》读经之后，公开诵读的一段《先知书》（《尼维因》）经文。"},"examples":[{"en":"After the Torah reading, the congregation listened to the Haftarah.","zh":"在诵读《托拉》之后，会众聆听了《哈夫塔拉》经文。"},{"en":"Different communities may have different haftaras for the same week.","zh":"不同社群在同一周可能会读不同的哈夫塔拉段落。"}]}],"synonyms":["haftarot","Haftarah readings","prophetic readings"],"phonetic":"/ˌhɑfˈtɑrəz/","extraExplanation":["“Haftarah/haftara”来自希伯来语，常见译作“哈夫塔拉”。英文里你输入的“haftaras”是较常见的拼写之一，表示复数；学术或更贴近希伯来语的复数也常写作“haftarot”。","哈夫塔拉通常与当周《托拉》章节（parashah）在主题或关键词上形成呼应；在礼拜中往往配合吟诵旋律（chant/cantillation）。","不同犹太传统（如阿什肯纳兹、塞法迪、也门等）对某些周次的哈夫塔拉选择可能不同；在部分特殊安息日（如与节期相关的安息日）也会更换相应段落。"]}
{"word":"Haftarot","summary":{"en":"plural synagogue readings from the Prophets after the Torah portion","zh":"《妥拉》之后的先知书选读（复数）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"readings from the Hebrew Bible (Prophets) recited or chanted in synagogue, usually after the Torah reading on Shabbat and some holidays; plural of “Haftarah.”","zh":"（犹太会堂礼拜中）在诵读《妥拉》之后所诵读/吟唱的《希伯来圣经》先知书选段；为“Haftarah”的复数。"},"examples":[{"en":"After the Torah portion, the congregation listened to the Haftarot for the day.","zh":"诵读完当天的《妥拉》章节后，会众聆听当天的先知书选读（Haftarot）。"},{"en":"Different communities may chant the Haftarot with different melodies.","zh":"不同社群吟唱先知书选读（Haftarot）时，旋律可能不同。"}]}],"synonyms":["Haftarahs","Prophetic readings"],"phonetic":"ˌhɑfˈtɑˌroʊt","extraExplanation":["在犹太教礼仪中，“Torah reading（妥拉诵读）”与“Haftarah/Haftarot（先知书选读）”通常成对出现：前者来自《摩西五经》，后者来自“Nevi'im（先知书）”。不同节日或特殊安息日会有对应的 Haftarah。拼写也常见 Haftarah / Haftorah；复数可见 Haftarot 或 Haftarahs。"],"etymology":"源自希伯来语 הַפְטָרָה (haftarah) ，常解释为“结束、结语/收尾（礼仪）”，指在《妥拉》诵读后接续的先知书选段；Haftarot 是其英语化复数形式。","mnemonic":["把它拆开记：haftar- + -ot（像很多希伯来语外来词的复数结尾），看到 -ot 就提醒自己“很多篇/多段选读”。","联想中文“哈夫塔罗特”里“罗特”像“若多篇”，帮助记住是复数（多段先知书选读）。"]}
{"word":"haftarot","summary":{"en":"Haftarot are the prophetic readings from the Hebrew Bible read in synagogue, usually after the Torah reading on Shabbat and some holidays.","zh":"Haftarot 指会堂礼拜中诵读的《先知书》选段，通常在安息日和部分节日的《妥拉》诵读之后进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) Plural of haftarah: selected passages from the Hebrew Bible’s Prophets that are read aloud in synagogue, usually after the Torah reading on Sabbaths and certain holidays.","zh":"（犹太教）haftarah 的复数：在会堂礼拜中朗读的《希伯来圣经》“先知书”选段，通常在安息日和某些节日的《妥拉》诵读之后进行。"},"examples":[{"en":"On Shabbat, the service includes a Torah portion and the haftarot read afterward.","zh":"在安息日的礼拜中，仪式包括《妥拉》经段以及随后诵读的 haftarot。"},{"en":"Different communities may use slightly different haftarot for the same week.","zh":"不同社群可能会为同一周使用略有不同的 haftarot。"}]}],"synonyms":["prophetic readings","haftarah readings"],"phonetic":"/ˌhɑfˈtɑroʊt/","extraExplanation":["“Haftarot”来自希伯来语，单数是“haftarah”。在犹太礼拜中，它与每周的《妥拉》经段（Torah portion / parashah）相配套，常被理解为对主题的呼应或延伸。","发音提示：英语里常听到“hahf-TAH-roht”的节奏；复数 -ot 是希伯来语常见的阴性复数词尾。"]}
{"word":"haftaroth","summary":{"en":"Haftaroth means the haftarah readings (plural): prophetic passages read in synagogue after the Torah reading.","zh":"Haftaroth 指 haftarah 读经的复数：在会堂中于《妥拉》之后诵读的《先知书》等选段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of haftarah: selected passages from the Hebrew Bible (Prophets) read in synagogue after the Torah reading on Sabbaths and holidays","zh":"haftarah 的复数：在犹太会堂中，于安息日或节日诵读《妥拉》之后所读的《希伯来圣经》（多为《先知书》）选段"},"examples":[{"en":"During the service, the rabbi announced which haftaroth would be read this month.","zh":"礼拜中，拉比宣布了这个月将诵读哪些 haftaroth。"},{"en":"Some communities chant the haftaroth with a special melody.","zh":"有些社群会用特定的旋律吟诵 haftaroth。"}]}],"synonyms":["haftarot","haftaras (less common)"],"phonetic":"/ˌhɑfˈtɑrəθ/","extraExplanation":["“Haftarot/Haftaroth”只是不同的英文转写方式：-ot 是希伯来语常见的阴性复数词尾；拼作 -oth 多见于较传统或旧式的英文拼写。","Haftarah 的选段通常与当周的《妥拉》读经主题相关联；不同犹太传统（如阿什肯纳兹、塞法迪、也门等）在具体配对与吟诵传统上可能略有差异。"]}
{"word":"hafted","summary":{"en":"Hafted means fitted with a handle, especially describing tools or weapons.","zh":"hafted 指“装有柄的”，多用于描述工具或武器。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a handle (a haft), especially of a tool or weapon; fitted with a handle.","zh":"（尤指工具或武器）装有柄的；带手柄的。"},"examples":[{"en":"The archaeologists found a hafted stone axe.","zh":"考古学家发现了一把带柄的石斧。"},{"en":"Use a hafted knife for better control when cutting.","zh":"切东西时用带柄的刀更好掌控。"},{"en":"The museum displayed hafted spears from the Iron Age.","zh":"博物馆展出了铁器时代的带柄长矛。"}]}],"synonyms":["handled","with a handle","shafted (for certain tools/weapons)"],"phonetic":"/ˈhæftɪd/","extraExplanation":["“hafted”来自名词/动词“haft”。“haft”指工具或武器的“柄、把手”（如斧柄、刀柄、矛柄），所以“hafted”常用于考古、历史或手工制作语境，强调“有柄”这一结构特征。日常英语里更常说“handled”（有把手的），但在描述武器/古器物时用“hafted”更地道。"]}
{"word":"hafter","summary":{"en":"Hafter is a rare word meaning a person (or sometimes a part) that fits a handle (“haft”) onto a tool or weapon.","zh":"Hafter 是个很罕见的词，指给工具/武器装上手柄（haft）的人（有时也指装柄部件）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who puts a handle (a “haft”) on a tool or weapon; someone who fits a blade or head into a handle","zh":"给工具或武器装上手柄（“haft”）的人；把刀刃/斧头等装入柄中的人"},"examples":[{"en":"The village hafter repaired old axes by fitting new wooden handles.","zh":"村里的装柄匠给旧斧头换上新的木柄来修理。"},{"en":"A skilled hafter can make a knife safer and easier to use.","zh":"熟练的装柄匠能让刀更安全、更顺手。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) something that provides a handle or holder; a device or part used to attach a handle","zh":"（罕见）用于提供握柄/固定握柄的部件；装柄用的装置或零件"},"examples":[{"en":"This metal hafter keeps the blade firmly in place.","zh":"这个金属装柄件能把刀刃牢牢固定住。"}]}],"synonyms":["haft-maker","handler","tool mounter"],"phonetic":"/ˈhæftər/","extraExplanation":["“hafter”非常少见，多数学习者几乎不会在日常英语里遇到。它来自动词“to haft”（给……装柄），而“haft”本身指工具或武器的“柄/把手”。","如果你想表达“在……之后”，常见且正确的词是“after”（/ˈæftər/）；“hafter”常被当作拼写错误。"]}
{"word":"hafters","summary":{"en":"“Hafters” means tool/weapon handles (a rare plural form related to “haft”).","zh":"“hafters”指工具或武器的手柄/握柄（较少见的复数形式，相关词是“haft”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"handles of tools or weapons; the part you hold (plural of “hafter”/“haft”).","zh":"（工具或武器的）柄、把手；握持的部分（“hafter/haft”的复数）。"},"examples":[{"en":"The carpenter replaced the cracked hafters on his chisels.","zh":"木匠把凿子上开裂的手柄换掉了。"},{"en":"The old knives had wooden hafters worn smooth from use.","zh":"那些旧刀有木制刀柄，被长期使用磨得很光滑。"}]}],"synonyms":["handles","hafts","grips"],"phonetic":"/ˈhæftɚz/","extraExplanation":["“hafters”在现代英语里比较少见，更常见的词是“haft”（柄、把手）或“handle”。它和古英语/日耳曼语系中表示“握住”的词根有关，因此常用来指刀、斧、凿等工具的握柄部分。","如果你本来想查的是“rafters”（椽子/屋架斜梁）或“haters”（讨厌者/黑粉），拼写不同、意思也完全不同。"]}
{"word":"hafting","summary":{"en":"“Hafting” mainly means attaching a handle to a tool or weapon head.","zh":"“hafting”主要指把手柄安装到工具或武器头部上（装柄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of attaching a handle (a haft) to a tool or weapon head (such as a knife blade, axe head, or spear point).","zh":"（把手柄/柄部）安装到工具或武器头部上的过程；装柄。"},"examples":[{"en":"Proper hafting makes an axe safer and easier to control.","zh":"正确的装柄会让斧头更安全、更容易控制。"},{"en":"In class, we practiced hafting a stone blade onto a wooden handle.","zh":"课上我们练习把石制刀刃装到木柄上。"}]},{"partOfSpeech":"n.","definition":{"en":"the handle/haft area of a tool or weapon; the part where a head or blade is fixed (less common).","zh":"工具或武器的柄部/把手处；用于固定刃或头部的部位（较少用）。"},"examples":[{"en":"The knife’s hafting is wrapped with leather for a better grip.","zh":"这把刀的柄部用皮革缠绕，握感更好。"}]}],"synonyms":["handle-fitting","mounting","haft attachment"],"phonetic":"/ˈhæftɪŋ/","extraExplanation":["在考古学与人类学里，hafting（装柄）是理解“复合工具”（由不同材料组合而成，如石刃+木柄+树脂胶）的关键概念。研究者会根据绑缚痕迹、树脂残留或磨损模式，推断古人如何把石器固定在柄上。"]}
{"word":"haftorah","summary":{"en":"A synagogue reading from the Prophets, recited after the Torah reading.","zh":"会堂礼拜中在妥拉之后诵读的《先知书》选段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A reading from the Hebrew Bible’s Prophets (Nevi’im) that is read or chanted in synagogue after the Torah reading on Sabbaths and certain holidays.","zh":"（犹太教礼仪中）在安息日或某些节日的会堂礼拜里，跟在《妥拉》（Torah）诵读之后吟唱或朗读的《先知书》（Nevi’im）选段。"},"examples":[{"en":"After the Torah portion, the congregation listened to the haftorah.","zh":"在诵读完妥拉经段后，会众聆听了 haftorah（先知书诵读）。"},{"en":"She practiced chanting the haftorah for her bat mitzvah.","zh":"她为自己的成人礼（bat mitzvah）练习吟唱 haftorah。"}]}],"synonyms":["Haftarah","prophetic reading"],"phonetic":"/hæfˈtɔrə/","extraExplanation":["“haftorah”更常见的拼写是“Haftarah”。两者都指同一项礼仪诵读。","Haftarah 的经段通常与当天的妥拉经段在主题上有关联；不同犹太传统（如阿什肯纳兹、塞法迪等）在具体选段上可能略有差异。"]}
{"word":"haftorahs","summary":{"en":"“Haftorahs” means multiple haftarah readings—selected passages from the Prophets read after the Torah reading in synagogue services.","zh":"“Haftorahs”指多段Haftarah（先知书选读）：在会堂礼拜中，妥拉诵读之后朗读的《先知书》经文选段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Readings from the Prophets (Nevi’im) that are read aloud in a synagogue after the Torah reading on Shabbat or Jewish holidays.","zh":"（复数）“先知书”选段（Haftarah）的诵读：在安息日或犹太节日，会堂里在诵读妥拉之后朗读的《先知书》经文选段。"},"examples":[{"en":"On Saturday morning, the congregation listened to the haftorahs after the Torah portion.","zh":"周六早晨，会众在诵读妥拉经段之后聆听了多段haftorahs（先知书选读）。"},{"en":"Different holidays have different haftorahs chosen to match the theme of the day.","zh":"不同节日会选取不同的haftorahs，以呼应当天的主题。"}]}],"synonyms":["haftarahs","prophetic readings","Haftarot"],"phonetic":"/hɑfˈtɔrə/","extraExplanation":["“Haftarah”是更常见的拼写；“Haftorah”也常见于某些英语转写传统。你输入的“haftorahs”是其复数形式。","在犹太礼仪中，Haftarah通常与当天的妥拉经段（Torah portion / parashah）在主题或关键词上有关联，用来加深会众对经文的理解。","朗读Haftarah在不同社群（如阿什肯纳兹、塞法迪等）之间可能有不同的旋律（cantillation/chanting）传统。"]}
{"word":"haftorot","summary":{"en":"Haftorot are the prophetic readings recited in synagogue after the weekly Torah portion.","zh":"Haftorot 指会堂礼拜中在每周《妥拉》经文段之后诵读的《先知书》选段（haftarah 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) Plural of haftarah: the selected readings from the Hebrew Bible’s Prophets that are read publicly in synagogue after the weekly Torah portion (especially on Shabbat and holidays).","zh":"（犹太教）haftarah 的复数：在会堂礼拜中，紧接每周《妥拉》经文段之后诵读的《先知书》选段（尤指安息日与节日）。"},"examples":[{"en":"This week’s haftorot are linked thematically to the Torah portion.","zh":"本周的 haftorot（先知书选段）在主题上与《妥拉》经文段相呼应。"},{"en":"The rabbi explained why the holiday haftorot are different from the regular weekly reading.","zh":"拉比解释了为什么节日的 haftorot 与平常每周的诵读不同。"}]}],"synonyms":["haftarot","haftarahs"],"phonetic":"/hɑfˈtɔrət/","extraExplanation":["“Haftorot”是较常见的英语拼写变体之一；你也会看到“haftarot”（更贴近学术转写）或英文复数“haftarahs”。","来源于希伯来语“haftarah”（意为“结束/结语”之类的概念），传统上用于礼拜中《妥拉》之后的补充诵读。不同社群（如阿什肯纳兹、塞法迪等）在具体选段与发音/拼写上可能略有差异。"]}
{"word":"haftoroth","summary":{"en":"*Haftoroth* means the haftarah readings (plural)—prophetic passages read in synagogue, usually after the weekly Torah reading.","zh":"*Haftoroth* 指“先知书选读”（复数）——犹太会堂礼拜中通常在每周妥拉经文之后诵读的《先知书》选段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of *haftarah*: selected readings from the Prophets (Nevi’im) read in synagogue, usually after the weekly Torah portion on Shabbat or on certain holidays.","zh":"*haftarah*（先知书选读）的复数：在犹太会堂礼拜中诵读的《先知书》（Nevi’im）选段，通常在安息日（Shabbat）每周妥拉经文之后或某些节日诵读。"},"examples":[{"en":"This week’s service includes the Torah portion and the haftarah; next week the haftoroth will be different.","zh":"本周礼拜包括妥拉经文和先知书选读；下周的先知书选读（haftoroth）会不同。"},{"en":"In some communities, the haftoroth are chanted with a special melody.","zh":"在一些社群中，先知书选读（haftoroth）会用特定旋律吟诵。"}]}],"synonyms":["haftarot","haftarah readings","prophetic readings"],"phonetic":"/ˌhɑfˈtɔrəθ/","extraExplanation":["“haftoroth”是“haftarot/haftaroth”的一种拼写，源自希伯来语；英语里更常见的写法是 **haftarot**（也会看到单数 **haftarah**）。","它通常与每周的妥拉章节（parashah）在主题上形成呼应或对照；不同传统（如阿什肯纳兹、塞法迪等）在具体选段与吟诵传统上可能略有差异。"]}
{"word":"hafts","summary":{"en":"“Hafts” usually means the handles of tools or weapons (plural of haft); it can also be the verb form meaning “attaches a handle.”","zh":"“hafts”通常指工具或武器的“柄/把手”（haft 的复数）；也可作动词，表示“给……装柄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the handles of tools or weapons (plural of “haft”), especially the handle of a knife, sword, axe, or spear","zh":"（haft 的复数）工具或武器的柄、把手；尤指刀、剑、斧、矛等的柄"},"examples":[{"en":"The museum displayed stone axes with wooden hafts.","zh":"博物馆展出了带木柄的石斧。"},{"en":"Check the knife’s hafts for cracks before using them.","zh":"使用前检查刀柄是否有裂纹。"}]},{"partOfSpeech":"v.","definition":{"en":"fits or provides with a handle; attaches a handle to (third-person singular of “haft”)","zh":"（动词 haft 的第三人称单数）给……装柄；把……装上把手"},"examples":[{"en":"A craftsperson hafts the blade carefully to keep it secure.","zh":"工匠小心地给刀刃装柄，以确保牢固。"},{"en":"In traditional workshops, the master hafts each tool by hand.","zh":"在传统作坊里，师傅会手工给每件工具装柄。"}]}],"synonyms":["handles","hilts","grips","shafts"],"phonetic":"/hæfts/","extraExplanation":["“haft”多见于较正式或文学/历史语境（如考古、博物馆说明、传统工艺），日常口语里更常说 handle（把手/柄）。","在武器或工具语境中，haft 特别强调“连接刃/头部与手握部分的那一段”，比如 axe haft（斧柄）、spear haft（矛柄）。"]}

