{"word":"hag","summary":{"en":"A “hag” is an offensive word for an unpleasant old woman, and it can also mean a witch or evil spirit in folklore (e.g., “night hag”).","zh":"“hag”多用于贬义（且冒犯）指令人讨厌的老太婆，也可指民间传说中的女巫或邪恶女妖（如“night hag”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(offensive) An old woman who is considered ugly or unpleasant.","zh":"（冒犯性）指被认为丑陋或令人讨厌的老女人。"},"examples":[{"en":"That word is insulting—don’t call her a hag.","zh":"那个词很侮辱人——别叫她“hag”。"},{"en":"In the movie, the villain is portrayed as a cruel hag living alone.","zh":"在电影里，反派被塑造成一个独居的残忍老太婆。"}]},{"partOfSpeech":"n.","definition":{"en":"A witch or evil female spirit in stories and folklore.","zh":"（故事/民间传说中）女巫；邪恶的女妖/女鬼。"},"examples":[{"en":"The hero must defeat the hag who guards the magic well.","zh":"英雄必须打败守护魔法井的女巫。"},{"en":"Old tales warn children about hags in the forest.","zh":"古老的故事警告孩子们森林里有女妖。"}]},{"partOfSpeech":"n.","definition":{"en":"In folklore, a spirit that sits on a person’s chest during sleep and causes nightmares (often in the phrase “night hag”).","zh":"（民俗）会在睡眠时压在胸口、引发噩梦的妖灵（常用于短语“night hag”，与“鬼压床”传说相关）。"},"examples":[{"en":"He described his sleep paralysis as feeling like a night hag was on his chest.","zh":"他形容自己的睡眠瘫痪像是有“night hag”压在胸口。"}]}],"synonyms":["witch","crone","old witch","night hag"],"phonetic":"/hæɡ/","extraExplanation":["“hag”在现实生活中指人时通常非常不礼貌，带有强烈的贬低和厌女色彩。更中性的说法可用“an elderly woman / an older woman”，描述性但不侮辱可用“a strict woman / a mean woman”等。","“night hag”这一说法源于欧洲民间传说，用来解释噩梦或睡眠瘫痪（俗称“鬼压床”）的体验；现代科学通常用“sleep paralysis（睡眠瘫痪）”来描述。"]}
{"word":"hag-likeness","summary":{"en":"a witch-like, harshly ugly appearance","zh":"巫婆般、枯槁丑陋的外貌特征"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of looking like a hag; a witch-like, harshly ugly, or withered appearance (often used for dramatic or insulting description).","zh":"像“老巫婆/丑老太婆”那样的特征或样子；带有巫婆式、刻薄而枯槁的外貌（多用于夸张或侮辱性的描写）。"},"examples":[{"en":"In the dim light, the costume gave her a convincing hag-likeness.","zh":"在昏暗的灯光下，那套服装让她看起来很有“老巫婆样”。"},{"en":"The novel describes the villain’s hag-likeness with heavy shadows and tangled hair.","zh":"小说用浓重的阴影和蓬乱的头发来描写反派那种“巫婆般的丑态”。"}]}],"synonyms":["ugliness","hideousness","witchlike appearance","gauntness","haggardness"],"phonetic":"/ˈhæɡˌlaɪknəs/","extraExplanation":["“hag”在英语里常指民间传说中的女巫形象，或带强烈贬义地指“又老又丑/刻薄的女人”。在现代语境中，用来形容真实的人可能带有明显的性别歧视和年龄歧视色彩；更中性的替代说法可以用 “gaunt look”（憔悴的样子）、“weathered appearance”（饱经风霜的外貌）等。"],"etymology":"由 hag（“巫婆、丑老太婆”）+ likeness（“相似性、样子”）构成的复合词；常见于文学或修辞性写作中，用来强调外貌“像某类人/形象”。","mnemonic":["把它拆开记：hag（老巫婆）+ likeness（像……的样子）= “巫婆样/老巫婆般的样子”。","联想中文：看到“hag”就想到“巫婆”，再加“-likeness”就是“长得像巫婆的那种感觉”。"]}
{"word":"hag-ness","summary":{"en":"an insulting quality of seeming like a hag","zh":"带侮辱色彩的“像老巫婆一样”的特质"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being a hag (an old, ugly, or witch-like woman); used rarely and often insultingly.","zh":"“像老巫婆/丑老太婆一样”的状态或特质；较少使用，且常带侮辱性。"},"examples":[{"en":"The novel describes the character’s “hag-ness” to show how cruelly society judges aging women.","zh":"小说用“hag-ness（老巫婆般的特质）”来表现社会如何苛刻地评判变老的女性。"},{"en":"He used the word to mock her appearance, but it came off as needlessly cruel.","zh":"他用这个词嘲笑她的外貌，但听起来非常刻薄、毫无必要。"}]}],"synonyms":["ugliness","witchiness","cronehood","malice","harshness"],"phonetic":"/ˈhæɡnəs/","extraExplanation":["注意语用：hag 本身在现代英语里多用于贬损女性外貌或年龄，带强烈性别偏见与冒犯性。“hag-ness”因此也不适合在日常场合描述真人。","更中性表达可用：unkindness（刻薄）、harshness（苛刻）、aged appearance（显老的外观）、witch-like look（像女巫的样子，仍需谨慎）。"],"etymology":"由 hag（“老巫婆；丑老太婆”等贬义称呼）+ 名词后缀 -ness（表示“……的性质/状态”）构成；属于按构词规则临时造出来的词，日常英语中并不常见。","mnemonic":["把它拆开记：hag（“老巫婆/丑老太婆”的贬义词）+ -ness（“……性/状态”）→ “老巫婆感/丑老太婆感”。"]}
{"word":"hagada","summary":{"en":"Haggadah: the Jewish Passover Seder book that tells the Exodus story and guides the ritual meal.","zh":"Haggadah（常写作 Haggadah，也见 hagada）：逾越节家宴上诵读的犹太文本，讲述出埃及故事并指导仪式流程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish text read at the Passover Seder that tells the story of the Exodus from Egypt and guides the ritual meal with prayers, songs, and instructions.","zh":"犹太教在逾越节家宴（Seder）上诵读的文本，用来讲述《出埃及记》的故事，并指导仪式性晚餐（祷文、歌曲与流程说明等）。"},"examples":[{"en":"During Passover, many families read the Haggadah at the Seder table.","zh":"在逾越节期间，许多家庭会在家宴桌旁诵读《哈加达》（Haggadah）。"},{"en":"She bought a bilingual Haggadah so her children could follow the story.","zh":"她买了一本双语《哈加达》，让孩子们能跟上故事内容。"}]}],"synonyms":["Passover Haggadah","Seder book"],"phonetic":"/həˈɡɑdə/","extraExplanation":["你输入的 “hagada” 常见拼写是 **Haggadah**（也可见 Haggada 作为变体拼写）。它来自希伯来语，意思接近“讲述/叙述”，与逾越节“讲述出埃及”的传统密切相关。","在英语里通常会加定冠词说 **the Haggadah**（那本用于逾越节家宴的文本）；也常见搭配：**a Passover Haggadah**, **a family Haggadah**, **a bilingual Haggadah**。"]}
{"word":"hagadic","summary":{"en":"Haggadic means “related to the narrative and ethical (non-legal) teachings in rabbinic Jewish tradition.”","zh":"haggadic 指“与拉比犹太传统中非法律性的叙事与伦理教导（哈加达/阿加达）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the non-legal, narrative, ethical, and interpretive traditions in rabbinic Judaism (as opposed to legal discussions).","zh":"与犹太教拉比传统中的“哈加达/阿加达”（非法律部分）相关的；指叙事、寓言、伦理教导与解释性传统（相对于法律性的讨论）。"},"examples":[{"en":"The lecture compared halakhic debates with haggadic stories in the Talmud.","zh":"这场讲座比较了《塔木德》中哈拉卡式（法律性）的辩论与哈加达式（叙事性）的故事。"},{"en":"Many readers find haggadic passages easier to approach because they read like stories and moral teachings.","zh":"许多读者觉得哈加达式段落更容易读，因为它们更像故事和道德教诲。"}]}],"synonyms":["aggadic","midrashic (sometimes, in broader use)"],"phonetic":"/həˈɡædɪk/","extraExplanation":["更常见的拼写是 **haggadic** 或 **aggadic**（也见 *Hagadah/Haggadah* 相关拼写），都源自希伯来语“叙述/讲述”的词根，指拉比文献中偏叙事、寓言、神学思辨与伦理劝导的材料。","在犹太教文本讨论里，常见对比是：**halakhic**（哈拉卡：法律、规范、实践规则） vs. **haggadic/aggadic**（哈加达/阿加达：故事、比喻、价值观与解释）。这种区分有助于理解《米示拿》《塔木德》《米德拉什》等作品中不同类型的内容。"]}
{"word":"hagadist","summary":{"en":"A haggadist is someone who leads the telling of the Passover story from the Haggadah at a Seder.","zh":"haggadist 指在逾越节家宴上领读并讲述《哈加达》逾越节故事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who narrates, recites, or leads the telling of the Passover story from the Haggadah (especially at a Seder).","zh":"（尤指在逾越节家宴 Seder 上）领读、讲述《哈加达》（Haggadah）中逾越节故事的人。"},"examples":[{"en":"At our Seder, my aunt was the haggadist and guided everyone through the story of the Exodus.","zh":"在我们家的逾越节家宴上，我阿姨担任 haggadist，带大家一起讲述《出埃及记》的故事。"},{"en":"The haggadist paused to explain a difficult line so the children could follow along.","zh":"haggadist 停下来解释一句较难的内容，好让孩子们也能听懂。"}]}],"synonyms":["Seder leader","Haggadah leader","narrator"],"phonetic":"/ˈhɑːɡəˌdɪst/","extraExplanation":["“Haggadist”来自“Haggadah”（哈加达），指逾越节家宴上用来讲述以色列人出埃及故事的文本。这个词在日常英语里比较少见，更常见的说法是“the person leading the Seder / leading the Haggadah”或直接说“the Seder leader”。","拼写提醒：你写的“hagadist”有时也会见到，但更常见的是带双 g 的“haggadist”，与“Haggadah”一致。"]}
{"word":"hagadists","summary":{"en":"A (rare) term for someone who tells or studies Jewish traditional narrative teachings (Aggadah/Haggadah).","zh":"（较罕见）指讲述或研究犹太传统叙事性教导（Aggadah/Haggadah）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who tells, writes, or studies Jewish non-legal stories and teachings (Aggadah/Haggadah), especially traditional tales and interpretations found in rabbinic literature","zh":"讲述、撰写或研究犹太教非律法性故事与教义（Aggadah/Haggadah）的人，尤指拉比文献中的传统故事与诠释"},"examples":[{"en":"The scholar was known as a hagadist who collected moral tales from the Talmud.","zh":"这位学者以收集《塔木德》中寓意故事的“哈加达叙事者/研究者”而闻名。"},{"en":"In his lectures, he spoke like a hagadist, using stories to explain difficult ideas.","zh":"在讲座中，他像哈加达叙事者一样，用故事来解释难懂的观点。"}]}],"synonyms":["aggadist","haggadist","storyteller","folklorist"],"phonetic":"/ˈhɑːɡəˌdɪst/","extraExplanation":["“hagadist”较罕见，更常见的拼写是 **aggadist** 或 **haggadist**。它来自 **Aggadah/Haggadah**（希伯来语相关词），指犹太传统中偏叙事、伦理劝诫、寓言与解释性的内容，与强调宗教律法的 **Halakhah** 相对。","在英语语境里，这个词多出现在宗教学、犹太研究或古典文献讨论中；日常对话里通常会用更通用的词，如 *storyteller*（讲故事的人）或 *folklorist*（民俗学者）。"]}
{"word":"haganah","summary":{"en":"Haganah: a Jewish underground defense organization in British Mandate Palestine (1920–1948), later forming part of the IDF’s foundation.","zh":"Haganah（哈加纳）：英属托管巴勒斯坦时期的犹太地下防卫组织，后来成为以色列国防军的重要基础之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Jewish underground defense/paramilitary organization in British Mandate Palestine (1920–1948) that later became the core of the Israel Defense Forces (IDF).","zh":"“哈加纳”（Haganah）：英属托管巴勒斯坦时期（1920–1948）的犹太地下防卫/准军事组织，后来成为以色列国防军（IDF）的重要基础。"},"examples":[{"en":"Many history books describe the Haganah as a key force in the final years of the British Mandate.","zh":"许多历史书把“哈加纳”描述为英属托管末期的一支关键力量。"},{"en":"The Haganah operated mostly in secret and focused on protecting Jewish communities.","zh":"“哈加纳”多在秘密状态下活动，重点是保护犹太社区。"}]}],"synonyms":["Jewish defense organization","Jewish militia (historical context)"],"phonetic":"/hɑːˈɡɑːnə/","extraExplanation":["词源：Haganah 来自希伯来语 הֲגָנָה（haganah），意思是“防御/守护”。","语境提示：这个词常见于关于中东近现代史、犹太复国主义、英属托管时期与1948年前后冲突的讨论中。不同叙事中对其角色评价可能差异很大；写作或讨论时建议注明时间与来源立场。"]}
{"word":"hagar","summary":{"en":"Hagar is best known as a biblical figure: Sarah’s Egyptian servant who became the mother of Ishmael; it is also used as a female given name.","zh":"Hagar 最常指《圣经》人物“夏甲”（撒拉的埃及婢女、以实玛利之母）；也可作女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In the Bible) an Egyptian servant of Sarah who became Abraham’s concubine and the mother of Ishmael.","zh":"（《圣经》中）夏甲：撒拉的埃及婢女，后成为亚伯拉罕的妾，生下以实玛利。"},"examples":[{"en":"In Genesis, Hagar flees into the desert and later returns.","zh":"在《创世记》中，夏甲逃到旷野，后来又回去。"},{"en":"Hagar is often discussed in literature as a symbol of exile and survival.","zh":"在文学讨论中，夏甲常被视为流离与坚韧求生的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name (used in English, often with biblical associations).","zh":"女性名字（英语中使用，常带有圣经色彩）。"},"examples":[{"en":"Her grandmother’s name was Hagar, after the biblical story.","zh":"她祖母叫夏甲（Hagar），取自圣经故事。"}]}],"phonetic":"/ˈheɪɡɑr/","extraExplanation":["“Hagar”最常见的文化来源是《圣经·创世记》。故事中她与撒拉（Sarah）和亚伯拉罕（Abraham）的关系，常被用来讨论权力不平等、被迫迁徙、母子求生等主题。","在英语文学里，“Hagar”有时会被引用来唤起“被驱逐/在荒野中挣扎却仍然坚强”的意象（例如诗歌、小说或宗教题材写作）。"]}
{"word":"Hagarene","summary":{"en":"Relating to Hagar and, in older texts, to Ishmaelites (sometimes used for Arabs or Muslims).","zh":"与夏甲及其后裔有关；旧文献中有时指以实玛利人，并引申用于指阿拉伯人或穆斯林。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often capitalized, historical) Relating to Hagar (in the Bible) or to her descendants, especially Ishmaelites; by extension in older texts, relating to Arabs or Muslims.","zh":"（常大写，历史用语）与《圣经》中的夏甲（Hagar）或其后裔有关，尤指以实玛利人；在一些较早的英语文本中也被引申用来指阿拉伯人或穆斯林。"},"examples":[{"en":"In medieval European writings, “Hagarene” was sometimes used for Arab peoples.","zh":"在中世纪欧洲的一些文献里，“Hagarene”有时被用来指阿拉伯民族。"},{"en":"The poem contrasts the “Hagarene” desert with the biblical promised land imagery.","zh":"这首诗把“哈甲后裔的”荒漠与《圣经》中“应许之地”的意象作对照。"}]},{"partOfSpeech":"n.","definition":{"en":"A person described as a descendant of Hagar; in older usage, an Arab or Muslim (now often felt as archaic or potentially offensive depending on context).","zh":"被描述为夏甲后裔的人；旧时用法中可指阿拉伯人或穆斯林（现多属古旧用语，语境不当可能带冒犯性）。"},"examples":[{"en":"The chronicle refers to the invaders as “Hagarenes,” reflecting the author’s religious viewpoint.","zh":"该编年史把入侵者称为“Hagarenes”，反映了作者的宗教立场。"}]}],"synonyms":["Ishmaelite","Arab","Muslim"],"phonetic":"/ˌhæɡəˈriːn/","extraExplanation":["用法提示：在现代英语中，这个词主要出现在历史研究、宗教文本或文学作品里。若用来指现实中的族群或宗教群体，容易显得过时、带偏见或被视为不尊重；更中性的说法通常是 “Arab(s)” 或 “Muslim(s)”（按实际所指选择）。"],"etymology":"来自拉丁语 Medieval Latin “Hagarenus / Agarenus”，源自 Hagar（夏甲），《圣经》人物；词义从“与夏甲有关”扩展到“其后裔（以实玛利人）”，并在部分欧洲历史文本中进一步泛指阿拉伯人/穆斯林。","mnemonic":["把它拆成 Hagar + -ene（表示“……的/……族的”），联想到“夏甲→夏甲的后裔”。","联想《圣经》人物关系：Hagar（夏甲）→ Ishmael（以实玛利）→（旧文献中）“Hagarene”。"]}
{"word":"hagarene","summary":{"en":"Hagarene means “related to Hagar” and, in older texts, “a descendant of Hagar,” sometimes used for Arabs/Muslims (archaic).","zh":"Hagarene 指“与夏甲有关的”，也可在旧文献中指“夏甲的后裔”，曾被用来泛指阿拉伯人/穆斯林（古旧用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hagar, a figure in the Hebrew Bible/Old Testament (the servant of Sarah and the mother of Ishmael).","zh":"与夏甲（《希伯来圣经/旧约》人物：撒拉的婢女、以实玛利的母亲）有关的；夏甲的。"},"examples":[{"en":"The poem uses a Hagarene image to suggest exile and hardship.","zh":"这首诗用“夏甲式”的意象来暗示流亡与艰辛。"},{"en":"Some older religious writings describe the story in Hagarene terms.","zh":"一些较早的宗教著作会用“夏甲相关”的说法来描述这个故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) A descendant of Hagar, traditionally identified with Ishmaelites; historically used to refer to Arabs or Muslims (often in older European texts).","zh":"（古旧用法）夏甲的后裔，传统上与以实玛利的后代（以实玛利人）相联系；历史上在一些旧欧洲文献中用来指阿拉伯人或穆斯林（带有时代色彩）。"},"examples":[{"en":"In medieval chronicles, the term “Hagarene” sometimes appears for Arab groups.","zh":"在中世纪编年史中，“Hagarene”有时被用来指一些阿拉伯族群。"},{"en":"Modern historians avoid “Hagarene” because it can be imprecise and outdated.","zh":"现代历史学者通常避免使用“Hagarene”，因为它不够准确且过时。"}]}],"synonyms":["Ishmaelite (archaic)","Hagarenes (plural, archaic)"],"phonetic":"/ˌhæɡəˈriːn/","extraExplanation":["“Hagarene”源自《创世记》中的夏甲（Hagar）。在一些基督教/犹太教传统的解读里，夏甲之子以实玛利（Ishmael）被视为某些阿拉伯民族的祖先之一，因此旧文献可能用“Hagarene（夏甲后裔）”泛指阿拉伯人或穆斯林。","这种用法属于历史语境中的称呼，容易带有宗教视角与概括化色彩；在当代英语写作里，通常用更具体的族群或宗教名称（如 Arab, Muslim）更合适、更尊重。"]}
{"word":"Hagarenes","summary":{"en":"an archaic term for Hagar’s descendants; later used historically for Arabs/Muslims","zh":"古称“夏甲的后裔”；后在历史语境中指阿拉伯人/穆斯林"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A name used in the Bible and later in medieval/Christian writings for the descendants of Hagar (especially Ishmael’s line); later often used to refer to Arabs or Muslims (now mainly historical and can be offensive).","zh":"（古义）《圣经》及后来的中世纪/基督教文献中对夏甲（Hagar）后裔（尤其以实玛利一支）的称呼；后来常被用来指阿拉伯人或穆斯林（现多用于历史语境，且可能带冒犯性）。"},"examples":[{"en":"In some medieval chronicles, the term was used to describe Muslim armies.","zh":"在一些中世纪编年史中，这个词被用来指穆斯林军队。"},{"en":"Modern historians usually avoid the word except when quoting older sources.","zh":"现代历史学者通常避免使用这个词，除非是在引用旧文献。"}]}],"synonyms":["Ishmaelites","Arabs","Muslims"],"phonetic":"ˌhæɡəˈriːnz","extraExplanation":["使用提醒：这是带有强烈历史与宗教视角的旧称，现代英语中很少用于日常指称真实群体；在当代语境直接称呼他人可能被视为不尊重或冒犯。更中性的表达通常是 Arabs / Muslims，且需按具体对象与语境选择。","常见于历史文本（如十字军相关记述）或宗教讨论中，现代写作多在引文、注释或史学分析里出现。"],"etymology":"源自《圣经》人物“夏甲”(Hagar)：亚伯拉罕之妾、以实玛利之母。后世（尤其在中世纪欧洲基督教语境中）把“夏甲后裔”与阿拉伯人/穆斯林联系起来，形成该称呼。","mnemonic":["把它拆开记：Hagar（夏甲）+ -enes（表示“……的人/后裔”的复数形式）→“夏甲的后裔”。"]}
{"word":"Hagarite","summary":{"en":"a person (or description) linked to Hagar; historically used for Ishmaelites and sometimes Arabs/Muslims in older texts","zh":"与夏甲相关的人或描述；旧文献中常指以实玛利人，并有时用来指阿拉伯人/穆斯林"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a descendant of Hagar (especially understood as an Ishmaelite) in Biblical genealogy; by extension, an Arab or Muslim in some historical Christian writings","zh":"《圣经》族谱中夏甲（Hagar）的后裔（常被理解为以实玛利人）；在某些历史性的基督教著作中也被引申用来指阿拉伯人或穆斯林"},"examples":[{"en":"In some medieval chronicles, the term was used to refer to Muslim armies.","zh":"在一些中世纪编年史里，这个词被用来指穆斯林军队。"},{"en":"The writer connects the Hagarites with Ishmael in a traditional Biblical genealogy.","zh":"作者按传统《圣经》族谱把夏甲后裔与以实玛利联系起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Hagar or (in older texts) to the people thought to descend from her","zh":"与夏甲有关的；（旧文献中）与被认为出自她的族群有关的"},"examples":[{"en":"The poem uses Hagarite imagery drawn from the Old Testament.","zh":"这首诗使用了取自《旧约》的“夏甲”意象。"},{"en":"The historian discusses Hagarite traditions in early sources.","zh":"历史学者讨论了早期文献中的“夏甲相关”传统。"}]}],"synonyms":["Hagarene","Hagarenes","Ishmaelite"],"phonetic":"/ˈhæɡəˌraɪt/","extraExplanation":["语用提醒：在中世纪到近代早期的部分欧洲基督教文献中，这类称呼常把复杂的族群与宗教身份简单归为“某祖先的后裔”，带有强烈的时代观念；现代学术写作中多作为历史用语引用，日常称呼他人通常不合适。","相关文学/宗教用法：可与《圣经》中的 Hagar（夏甲）与 Ishmael（以实玛利）叙事联系起来理解，属于典故/族谱框架中的称名。"],"etymology":"来自 Hagar（夏甲，《圣经》人物名）+ -ite（表示“……的追随者/后裔/成员”的后缀）。该词在不同历史语境中被用作族群称呼，含义随时代与作者立场而变化。","mnemonic":["记后缀 -ite：常见于“某人/某地的成员或后裔”（如 Israelite）。所以 Hagar + ite ≈ “夏甲的后裔/相关的人”。","联想《圣经》人物：Hagar（夏甲）→ “Hagarite”就是“和夏甲有关的一群人/后代”。"]}
{"word":"hagarite","summary":{"en":"Hagarite means “related to Hagar or her descendants” (Biblical), and can also mean a member of the Hagarites mentioned in the Bible.","zh":"Hagarite 指“与夏甲或其后裔有关”（圣经语境），也可指《圣经》中提到的“夏甲人/哈加人”成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biblical) Relating to Hagar (Abraham’s Egyptian servant) or to her descendants, especially Ishmaelites; sometimes used historically to mean “Arab” in older religious writing.","zh":"（《圣经》用语）与夏甲（亚伯拉罕的埃及婢女）或其后裔有关，尤指以实玛利的后代；在较旧的宗教语境中有时被用来泛指“阿拉伯人”。"},"examples":[{"en":"In some older commentaries, “Hagarite” is used to refer to Ishmael’s descendants.","zh":"在一些较旧的注释书里，“Hagarite”用来指以实玛利的后裔。"},{"en":"The text contrasts the Israelites with the Hagarite tribes.","zh":"文本将以色列人和夏甲后裔的部族作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"A person believed to be descended from Hagar (especially an Ishmaelite); also, in the Bible, a member of a group called the Hagarites/Hagarenes.","zh":"被认为出自夏甲后裔的人（尤指以实玛利的后代）；也指《圣经》中称为“Hagarites/Hagarenes（夏甲人）”的群体成员。"},"examples":[{"en":"The chronicler mentions the Hagarites as neighbors and opponents.","zh":"《历代志》的作者提到夏甲人是邻居也是对手。"},{"en":"The term “Hagarite” appears mainly in biblical or historical discussions today.","zh":"如今“Hagarite”主要出现在圣经或历史讨论中。"}]}],"synonyms":["Hagarite(s)","Hagarene(s)","Hagarenes"],"phonetic":"/ˈhæɡəˌraɪt/","extraExplanation":["“Hagarite / Hagarites”主要见于《历代志上》（如 1 Chronicles 5）等经文，也常写作“(Ha)garene(s)”。现代英语日常交流中几乎不用，多属于宗教、历史或文献研究语境。","因为它在某些旧式宗教文本中曾被拿来笼统指代某些阿拉伯群体，现代写作中使用需注意语境与尊重，避免造成刻板印象或冒犯。"]}
{"word":"Hagatna","summary":{"en":"the capital municipality of Guam","zh":"关岛的首府城市（市镇）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"The capital city (municipality) of Guam, a U.S. territory in the western Pacific; often written as Hagåtña.","zh":"关岛（美国海外领地）的首府城市（市镇）；也常写作 Hagåtña。"},"examples":[{"en":"Hagåtña is the capital of Guam, but it is smaller than many people expect.","zh":"Hagåtña 是关岛的首府，不过规模比很多人想象的要小。"},{"en":"Many government offices are located in Hagåtña.","zh":"许多政府机构设在 Hagåtña。"},{"en":"You may see the name spelled as Hagåtña or Hagatna in English texts.","zh":"在英文资料里，你可能会看到 Hagåtña 或 Hagatna 这两种拼写。"}]}],"synonyms":["Hagåtña","Agana"],"phonetic":"/həˈɡɑːt.njə/","extraExplanation":["拼写提示：Hagåtña 中的 “å” 是查莫罗语正字法的一部分；美国联邦文件与一些英文资料里常把变音符省略写作 Hagatna。","文化与用法：这是关岛的政治中心，但人口与城市规模相对不大；旅游与日常语境中常与关岛其他地区（如 Tumon）一起被提及。"],"etymology":"源自查莫罗语（Chamorro）的地名；在英语里常见无变音符的写法 Hagatna。历史上也曾常用西班牙化拼写 Agana（今多被视为旧称）。","mnemonic":["把它记成“关岛的首府地名”：Hagåtña/Hagatna 两种写法指同一地方。可以用“哈嘎特纳=哈（关岛）+政府（首府）”来联想。"]}
{"word":"hagberries","summary":{"en":"Hagberries are the berries (or sometimes the trees) of the bird cherry, a regional/traditional term.","zh":"Hagberries 指鸟樱桃（bird cherry）的果实（有时也指这种树本身），属于地方性/传统用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of hagberry) the small, dark berries of the bird cherry tree.","zh":"（hagberry 的复数）鸟樱桃树（bird cherry）结的小而深色的浆果。"},"examples":[{"en":"In late summer, the branches were heavy with hagberries.","zh":"夏末时，树枝上挂满了鸟樱桃的果实（hagberries）。"},{"en":"Some birds feed on hagberries when other fruit is scarce.","zh":"当其他果实稀少时，一些鸟会以 hagberries 为食。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of hagberry) bird cherry trees themselves, especially in regional or traditional usage.","zh":"（hagberry 的复数）鸟樱桃树本身（多见于地方性或传统用法）。"},"examples":[{"en":"A line of hagberries grew along the riverbank.","zh":"河岸边长着一排鸟樱桃树（hagberries）。"}]}],"synonyms":["bird cherries","bird cherry (tree)","Prunus padus (scientific name)"],"phonetic":"/ˈhæɡˌbɛriz/","extraExplanation":["“Hagberry”主要是英式/苏格兰等地区的俗名；在现代更常见的名称是“bird cherry”，学名常写作 *Prunus padus*。","注意不要和“hackberry”（朴树属，*Celtis*）混淆：两者拼写相近，但指的是不同的树。"]}
{"word":"hagberry","summary":{"en":"Hagberry is a less common name for a hackberry tree or its fruit.","zh":"Hagberry 是 hackberry（朴树或其果实）较少见的别称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hackberry tree (a type of nettle tree), especially the common hackberry, or its small dark berry-like fruit","zh":"朴树（又称“hackberry”的一种榆科/朴树科树木）的俗称，也可指其小而深色、类似浆果的果实"},"examples":[{"en":"In late summer, the hagberry tree is covered with small purple-black fruits.","zh":"夏末时，hagberry（朴树）上会结满紫黑色的小果实。"},{"en":"Some birds feed on hagberries when other food is scarce.","zh":"当其他食物不足时，一些鸟类会以hagberry（朴树果）为食。"}]}],"synonyms":["hackberry","nettle tree"],"phonetic":"/ˈhæɡˌbɛri/","extraExplanation":["“hagberry”在现代英语中比较少见，多为地区性或较旧的说法；更常见的名称是“hackberry”。在阅读自然文学、地方植物志或老文本时更容易遇到。","不同地区对“hackberry/hagberry”的指代可能略有差异，但通常都指朴树属（Celtis）的树或其果实。"]}
{"word":"hagboat","summary":{"en":"A rare/nonstandard term, usually used in fiction to mean a “witch/hag’s boat.”","zh":"罕见/非标准用语，多见于虚构作品，指“女巫/老妖婆的船”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard word; usually a made-up or fantasy term meaning “a boat associated with a hag (a witch-like old woman),” for example a magical boat used in folklore or fiction.","zh":"一个很少见、非标准的词；多为自造或奇幻用语，通常指“与女巫/老妖婆（hag）有关的船”，例如民间传说或小说中的魔法船。"},"examples":[{"en":"In the story, the children escape across the swamp in a hagboat.","zh":"在故事里，孩子们乘着一艘“hagboat”穿过沼泽逃走。"},{"en":"The game describes a hagboat as a cursed boat that appears at midnight.","zh":"游戏里把“hagboat”描述成一艘会在午夜出现的诅咒之船。"}]}],"synonyms":["witch boat","cursed boat","magic boat"],"phonetic":"/ˈhæɡˌboʊt/","extraExplanation":["“hagboat”不常见于主流英语词典，现实生活中几乎不会用到；更可能出现在奇幻小说、桌游/网游设定、角色名称或地方性/个人化用语里。","如果你是在某个文本里看到它，建议你提供上下文句子：它可能是作者的自创词，也可能是拼写误差（例如把别的词看错/打错）。"]}
{"word":"hagbolt","summary":{"en":"Hagbolt is a rare folklore word for a stone (often a flint arrowhead) believed to be shot by a witch to cause harm.","zh":"Hagbolt 是一个很少见的民俗用词，指被认为是女巫射出、会致害的小石头（常为燧石箭头）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Folklore, rare/archaic) A small stone (often a flint arrowhead) believed to be a magic projectile shot by a witch (“hag”) to cause illness, pain, or bad luck.","zh":"（民间传说，少见/古语）被认为是女巫（hag）射出的“魔法弹丸”的小石头（常指燧石箭头），据说会带来疾病、疼痛或厄运。"},"examples":[{"en":"In old village stories, a sudden sickness might be blamed on a hagbolt.","zh":"在古老的乡村故事里，突如其来的疾病可能会被归咎于“hagbolt”。"},{"en":"They kept the sharp flint in a box, calling it a hagbolt and treating it like evidence of witchcraft.","zh":"他们把那块锋利的燧石放在盒子里，称之为“hagbolt”，并把它当作巫术的证据。"}]}],"synonyms":["elf-shot","witch’s bolt","(related) hagstone"],"phonetic":"/ˈhæɡboʊlt/","extraExplanation":["这个词很罕见，多见于英国（尤其苏格兰、英格兰北部一带）关于“巫术致病”的民俗语境。人们把古代石器时代的箭头/燧石器物捡到后，误以为是女巫或精灵射出的“暗器”，用来解释无法理解的疼痛、牲畜生病等现象。相关民俗词还有 elf-shot（精灵之箭/精灵射伤）。"]}
{"word":"hagborn","summary":{"en":"Hagborn describes someone (often in fantasy) who is “born of a hag” and is seen as cursed or unnatural.","zh":"Hagborn多用于奇幻语境，指“女巫所生/有女巫血统的”，常暗含“受诅咒、不祥”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Fantasy, literature) Born from a hag (an ugly or evil old witch), or having a hag as a parent; often implying a cursed or monstrous origin.","zh":"（奇幻/文学）“女巫所生的；有女巫血统的”；常带有“受诅咒、怪异出身”的含义。"},"examples":[{"en":"In the novel, the hagborn child is feared by the villagers.","zh":"在小说里，这个女巫所生的孩子让村民们感到恐惧。"},{"en":"He calls her “hagborn” to insult her, suggesting her family is cursed.","zh":"他用“hagborn”骂她，暗示她家族受了诅咒。"}]}],"synonyms":["witch-born","cursed-born","demon-born","accursed"],"phonetic":"/ˈhæɡ.bɔrn/","extraExplanation":["“hagborn”不是日常英语里常见的词，更常出现在奇幻小说、角色扮演游戏（RPG）、或世界观设定中，用来制造“出身可疑/带诅咒血统”的氛围。","构词很直观：hag（丑陋或邪恶的老巫婆/女巫）+ born（出生的）。语气通常偏贬义或带恐惧色彩。"]}
{"word":"hagbush","summary":{"en":"A rare word for a tangled bush or thicket, often used with witchy/folklore imagery.","zh":"一个罕见词，指杂乱的灌木/灌丛，常带“女巫/民俗怪谈”的氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A wild, tangled bush or thicket, especially one linked in folklore with a hag (witch) or something spooky.","zh":"（罕见）杂乱丛生的灌木或灌丛，尤指在民间传说中与“女巫/老妖婆（hag）”等诡异意象相关的灌木。"},"examples":[{"en":"The children dared each other to run past the hagbush at dusk.","zh":"孩子们互相怂恿，黄昏时跑过那丛“女巫灌木”。"},{"en":"In the story, a hagbush marked the edge of the cursed field.","zh":"在故事里，一丛“女巫灌木”标示着被诅咒的田地边界。"}]}],"synonyms":["bramble","thornbush","thicket"],"phonetic":"/ˈhæɡˌbʊʃ/","extraExplanation":["“hagbush”并不是现代英语里的常用词，更常见的表达是 bramble（荆棘丛）、thornbush（带刺灌木）、thicket（灌丛/密林）。如果你是在文学、民俗或奇幻语境里见到它，通常是在营造阴森、带有女巫意象的氛围。","构词很直观：hag（老妖婆/女巫，带贬义或恐怖色彩）+ bush（灌木）。在正式写作中建议谨慎使用，以免读者不熟悉。"]}
{"word":"hagbushes","summary":{"en":"“Hagbushes” is a rare word meaning thick, tangled bushes or thickets; in folklore-like writing it can suggest eerie, witch-associated shrubs.","zh":"“hagbushes”较少见，指浓密纠结的灌木丛/荆棘丛；在民俗或奇幻语境中也可带“阴森、像与女巫有关”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of hagbush) a thick, tangled, often thorny bush or clump of shrubs; a brambly thicket (rare or dialect).","zh":"（hagbush 的复数）指一丛浓密、纠结、常带刺的灌木；荆棘丛（较少见或方言用法）。"},"examples":[{"en":"The path disappeared into hagbushes and brambles.","zh":"小路消失在荆棘灌木丛和荆棘藤里。"},{"en":"Birds hid in the hagbushes along the fence.","zh":"鸟儿躲在篱笆旁的乱灌木丛里。"}]},{"partOfSpeech":"n.","definition":{"en":"In folklore-style writing, bushes imagined as eerie or “witchy,” as if associated with a hag (an old witch).","zh":"在民俗/奇幻风格写作中，指带有阴森、“女巫气息”的灌木丛，仿佛与 hag（老巫婆）有关。"},"examples":[{"en":"They camped near the hagbushes, where the wind sounded like whispers.","zh":"他们在“女巫灌木丛”旁扎营，风声像低语。"},{"en":"The old story warned children not to wander into the hagbushes at night.","zh":"老故事告诫孩子们夜里别走进那片“女巫灌木丛”。"}]}],"synonyms":["thickets","brambles","scrub","bushes","undergrowth"],"phonetic":"/ˈhæɡˌbʊʃ/","extraExplanation":["“hagbush / hagbushes”不是现代英语里的常用词，更常见的说法是 thicket（灌木丛）、brambles（荆棘藤）、scrub（矮灌木地）。如果你是在小说/诗歌里看到它，往往带有一种阴森、民俗传说的气氛。","也有可能是拼写或断词造成的误读（例如把“hag bushes”当成一个词），建议你提供原句，我可以按上下文判断更贴切的意思。"]}
{"word":"hagbut","summary":{"en":"An archaic word for an early long gun; a rare spelling of “hackbut.”","zh":"表示一种早期长管火器的古词；是“hackbut”的少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old type of long gun used in Europe (especially in the 1500s–1600s); a variant spelling of “hackbut,” an early firearm similar to an arquebus.","zh":"一种旧式长管火器（主要见于16–17世纪欧洲）；是“hackbut”的变体拼写，属于早期火枪，类似火绳枪。"},"examples":[{"en":"The museum displayed a hagbut from the 16th century beside other early firearms.","zh":"博物馆展出了一把16世纪的hagbut（旧式火枪），旁边还有其他早期火器。"},{"en":"In historical novels, soldiers may carry a hagbut before muskets became common.","zh":"在历史小说里，火枪普及之前的士兵可能会携带hagbut。"}]}],"synonyms":["hackbut","arquebus"],"phonetic":"/ˈhæk.bət/","extraExplanation":["“hagbut”在现代英语里非常少见，多出现在历史研究、博物馆说明或历史小说中；更常见的拼写是“hackbut”。","这类武器常被视为“arquebus（火绳枪/早期火枪）”一类的早期火器名称之一，具体形制会因地区与时期而有所不同。"]}
{"word":"hagbuts","summary":{"en":"“Hagbuts” is an old, rare word meaning early long guns; it’s the plural of “hagbut.”","zh":"“hagbuts”是一个很少见的旧词，指早期的长枪火器；是“hagbut”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of early long gun (an early form of musket), used in Europe in the 15th–16th centuries; plural of “hagbut”","zh":"一种早期的长枪（火绳枪/早期滑膛枪的一种），约15—16世纪在欧洲使用；“hagbut”的复数"},"examples":[{"en":"The soldiers carried hagbuts and pikes into battle.","zh":"士兵们带着火绳枪（hagbuts）和长矛上战场。"},{"en":"In the museum, you can see hagbuts from the early days of firearms.","zh":"在博物馆里，你可以看到早期火器时代的火绳枪（hagbuts）。"}]}],"synonyms":["arquebuses","muskets (historical/loose)"],"phonetic":"/ˈhækbʊts/","extraExplanation":["“Hagbut / hackbut”是古英语与欧洲语言中对早期火器的称呼之一，现代英语里非常少见，更多出现在历史书、博物馆说明、或历史题材小说/游戏中。","它常与“arquebus（火绳枪）”“musket（火枪/火绳枪）”等词一起出现，具体指称在不同地区和时期可能有重叠。"]}
{"word":"hagden","summary":{"en":"Hagden is not a common English vocabulary word; it’s usually a proper name (surname/place) or a misspelling in context.","zh":"Hagden 不是常见英语词汇；通常是专有名词（姓/地名），也可能是在语境中拼写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/nonstandard word in modern English; most often seen as a proper name (a surname or place name).","zh":"现代英语中不常见/非标准用词；多见作专有名词（姓氏或地名）。"},"examples":[{"en":"My teacher’s last name is Hagden.","zh":"我老师的姓是 Hagden。"},{"en":"Hagden appears in some family history records.","zh":"Hagden 出现在一些家族史记录中。"}]}],"phonetic":"/ˈhæɡdən/","extraExplanation":["“Hagden”通常不是常用词汇，因此字典里可能查不到。若你是在文章、字幕或聊天中看到它，它很可能是人名/地名，或是拼写错误。","常见的相近拼写包括：Hadgen / Haddon / Haldane / Hagen；如果你能提供一句原文语境，我可以更准确判断它想表达的词与意思。"]}
{"word":"hagdin","summary":{"en":"“Hagdin” is mainly used as a proper name (often a surname), not a common English word.","zh":"“Hagdin”主要用作专有名词（常见为姓氏），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (usually a surname). It is not a common standard English vocabulary word.","zh":"一个较少见的专有名词（多作姓氏）。它不是常见的标准英语词汇。"},"examples":[{"en":"Ms. Hagdin will join the meeting at 3 p.m.","zh":"Hagdin 女士将在下午三点参加会议。"},{"en":"I saw the name “Hagdin” in the list of authors.","zh":"我在作者名单里看到了“Hagdin”这个名字。"}]}],"synonyms":["(proper name)"],"phonetic":"ˈhæɡdɪn","extraExplanation":["“hagdin”作为普通英文单词并不常见：如果你是在查词，可能是拼写听写造成的误差。常见的相近拼写包括：\n- haggard（adj. 憔悴的；疲惫的）\n- haggle（v. 讨价还价）\n- had been（短语，常听成“hagdin”）\n如果你能提供一句原文或它出现的场景（人名/地名/口语/歌词等），我可以更准确地判断。"]}
{"word":"hagdon","summary":{"en":"Hagdon is usually a rare proper name (often a surname), not a common English vocabulary word.","zh":"Hagdon 通常是较少见的专有名词（多为姓氏），并非常见英文词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (most often a family name). It is not a common dictionary word in modern English.","zh":"一个较少见的专有名词（最常见为姓氏）。它不是现代英语里常见的词典词汇。"},"examples":[{"en":"Ms. Hagdon will join the meeting at 3 p.m.","zh":"Hagdon 女士将于下午三点参加会议。"},{"en":"I found the name Hagdon in an old record.","zh":"我在一份旧档案里发现了 Hagdon 这个名字。"}]}],"phonetic":"/ˈhæɡdən/","extraExplanation":["“Hagdon”在常见英语词典中通常不会作为普通词条出现，更像是人名/姓氏或地名的拼写。如果你是想查某个常用英文单词，可能存在拼写误差。","你可以确认一下是否想输入：haggard（憔悴的）、haggle（讨价还价）、had gone（口语里“已经走了/去了”的拆分写法）等。把上下文句子发我，我可以帮你精准判断。"]}
{"word":"hagdons","summary":{"en":"“Hagdons” is not a common dictionary word; it usually refers to the Hagdon family (plural of the surname “Hagdon”).","zh":"“Hagdons”不是常见词典词；通常指“Hagdon（哈格登）”这个姓氏的复数，用来表示“哈格登一家/哈格登们”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a plural form of the proper name “Hagdon” (a family name).","zh":"不是标准英语单词；最常见的用法是专有名词“Hagdon”（姓氏）的复数形式。"},"examples":[{"en":"The Hagdons have lived in this town for generations.","zh":"哈格登一家（Hagdons）在这个镇上住了好几代。"},{"en":"I met the Hagdons at a community event.","zh":"我在一次社区活动中认识了哈格登一家。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/unclear) A misspelling of another word or name; meaning depends on the intended spelling.","zh":"（少见/不明确）可能是其他单词或名字的拼写错误；含义取决于你原本想写的形式。"},"examples":[{"en":"Did you mean “Hagdon,” “Haldons,” or “haggadons”?","zh":"你想写的是“Hagdon”“Haldons”还是“haggadons（某种变体拼写）”吗？"},{"en":"Please check the spelling in the original document.","zh":"请核对原文件里的拼写。"}]}],"synonyms":["the Hagdon family","the Hagdons (plural surname)"],"phonetic":"/ˈhæɡdənz/","extraExplanation":["“Hagdons”更像是姓氏复数（表示“哈格登一家/哈格登们”），而不是词典里常见的普通词。","如果你是在小说、游戏、家谱或地名中看到它，它很可能是人物/家族/地点的名称；这类专名通常需要具体上下文才能确认含义。","如果你告诉我看到它的句子或来源（例如一整句话/截图），我可以帮你判断它到底指的是人名、地名，还是拼写错误。"]}
{"word":"hagdown","summary":{"en":"“Hang down” means to droop or dangle downward.","zh":"“hang down”表示“向下垂挂/耷拉”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to hang downward; to droop or dangle (often because of weight, tiredness, or lack of support)","zh":"向下垂挂；下垂、耷拉（常因重量、疲惫或缺乏支撑）"},"examples":[{"en":"Wet branches hung down over the path.","zh":"湿漉漉的树枝垂在小路上方。"},{"en":"His head hung down after hearing the bad news.","zh":"听到坏消息后，他低下了头。"},{"en":"The curtain is hanging down too low—can you fix it?","zh":"窗帘垂得太低了——你能调整一下吗？"}]}],"synonyms":["droop","dangle","sag","hang"],"phonetic":"/ˌhæŋ ˈdaʊn/","extraExplanation":["“hagdown”不是常见英语单词；你可能想写的是 **hang down**（更常见）或 **hangdown**（较少见，偶尔作形容词/名词复合形式出现）。在日常英语里更推荐写成两词 **hang down**。","常见搭配：**hang down from**（从……垂下来）、**let your arms hang down**（让手臂自然下垂）、**hang your head down**（低头，常含“沮丧/羞愧”的情绪色彩）。"]}
{"word":"hageen","summary":{"en":"“hageen” isn’t a standard English word; it’s most likely a misspelling of “hygiene.”","zh":"“hageen” 不是标准英文单词；很可能是 “hygiene”（卫生/清洁）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most often a misspelling of “hygiene” (cleanliness and healthy habits).","zh":"非标准拼写；最常见是把 “hygiene”（卫生、清洁与健康习惯）拼错成 “hageen”。"},"examples":[{"en":"Correct: Good hygiene helps prevent illness.","zh":"正确：良好的卫生习惯有助于预防疾病。"},{"en":"Many people misspell “hygiene” because its spelling doesn’t match how it sounds.","zh":"很多人会把 “hygiene” 拼错，因为它的拼写和发音不太一致。"}]}],"synonyms":["cleanliness","sanitation"],"phonetic":"/ˈhaɪdʒiːn/","extraExplanation":["“hygiene” 的常见错误拼法很多（例如 *higene, hygene* 等）。你写的 “hageen” 也可能只是想按发音拼出来。","如果你其实想查的是人名/地名 **Hagen**（常见姓氏或地名），或其他单词，请告诉我上下文句子，我可以帮你确认。"]}
{"word":"hagein","summary":{"en":"“hagein” isn’t a standard English word; you probably mean “again” (= one more time).","zh":"“hagein” 不是标准英语单词；你很可能想写 “again”（= 再一次）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “again,” meaning “one more time.”","zh":"不是标准英语单词。很可能是把 “again” 拼错了，意思是“再一次”。"},"examples":[{"en":"Did you mean “again”? For example: Please say that again.","zh":"你是不是想写 “again”？例如：Please say that again.（请再说一遍。）"},{"en":"I tried again after I made a mistake.","zh":"我犯错后又试了一次。"}]},{"partOfSpeech":"adv.","definition":{"en":"(again) once more; another time; back to a previous state.","zh":"（again）再一次；又一次；回到之前的状态。"},"examples":[{"en":"Can we meet again tomorrow?","zh":"我们明天能再见一次吗？"},{"en":"It’s raining again.","zh":"又下雨了。"},{"en":"After a short break, she felt calm again.","zh":"短暂休息后，她又平静下来了。"}]}],"synonyms":["once more","another time","one more time","afresh"],"phonetic":"əˈɡɛn","extraExplanation":["“hagein” 在英语里没有常见词条记录。如果你是在聊天或打字时写的，最常见的情况是把 “again” 多打了一个 h 或把字母顺序打乱。","美式英语里 “again” 的读音常见有两种：/əˈɡɛn/（更常见）和 /əˈɡeɪn/（也能听到，带点强调或地区差异）。如果你希望我按你的目标口音或语境（考试/写作/口语）来建议用法，可以告诉我。"]}
{"word":"Hagenia","summary":{"en":"a scientific name for an African plant genus","zh":"非洲植物属的学名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African trees in the rose family, best known for the species used in traditional medicine in Ethiopia and nearby regions","zh":"蔷薇科的一个非洲树木属，最著名的物种在埃塞俄比亚及周边地区的传统医药中有应用"},"examples":[{"en":"Hagenia is native to highland areas of East Africa.","zh":"Hagenia 原产于东非的高海拔地区。"},{"en":"In some historical accounts, extracts from Hagenia were used in traditional remedies.","zh":"在一些历史记载中，Hagenia 的提取物被用于传统疗法。"}]}],"synonyms":["Hagenia abyssinica"],"phonetic":"/həˈɡiːniə/","extraExplanation":["常见物种是 Hagenia abyssinica（有时也被称作“非洲红木/高地树”等的地方性俗名，但不同地区叫法不一）。它生长在东非山地森林带，历史上在民间草药中出现过相关用法。现代使用应遵循医学与安全规范，避免自行尝试。"],"etymology":"词源来自拉丁化的新拉丁语（New Latin）学名，用于植物分类命名；一般认为是为了纪念欧洲学者/自然科学相关人物而造的属名（学名常见做法），后作为植物属名固定使用。","mnemonic":["把它想成“哈-根-尼亚”：听起来像“哈，根呢呀？”——提示这是植物学名，和“根/植物”有关。","记成“Ha + gen(属/类) + ia(拉丁属名常见结尾)”：看到 -ia 结尾，常是生物分类学名。"]}
{"word":"hagenia","summary":{"en":"Hagenia is a botanical genus of African trees, especially Hagenia abyssinica, known for traditional medicinal associations.","zh":"Hagenia 是一个非洲树木的植物属名，尤以阿比西尼亚海格尼亚闻名，并与传统药用用途有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African trees in the rose family (Rosaceae), especially known for the species Hagenia abyssinica, traditionally used in Ethiopian herbal medicine.","zh":"（植物）海格尼亚属：蔷薇科的非洲树木属，尤指“阿比西尼亚海格尼亚”（Hagenia abyssinica），在埃塞俄比亚传统草药中较有名。"},"examples":[{"en":"Hagenia is best known through the species Hagenia abyssinica, a tree native to the Ethiopian highlands.","zh":"海格尼亚属最广为人知的是阿比西尼亚海格尼亚，这种树原产于埃塞俄比亚高地。"},{"en":"Researchers study Hagenia for its traditional medicinal uses, but it should not be used without expert guidance.","zh":"研究者会研究海格尼亚的传统药用用途，但不应在缺乏专业指导的情况下使用。"}]}],"synonyms":["Hagenia abyssinica","kosso"],"phonetic":"/həˈɡiːniə/","extraExplanation":["“Hagenia”是拉丁化的植物学名称，日常英语里不常见；更常见的是具体物种名“Hagenia abyssinica”。","该树在东非一些地区与传统驱虫（尤其是绦虫）民间疗法相关；但民间用法可能存在副作用或毒性风险，现代医学并不建议自行尝试。"]}
{"word":"hagfish","summary":{"en":"A hagfish is a slime-producing, eel-like marine animal, famous for its defense slime and primitive body features.","zh":"盲鳗是一种会分泌黏液的鳗形海洋动物，以强力自卫黏液和原始的身体结构而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, eel-like sea animal that produces a lot of slime for defense; it is a very primitive fish-like creature that often feeds on dead or dying animals on the ocean floor","zh":"盲鳗（又称黏液鳗）：一种像鳗鱼一样细长的海洋动物，会分泌大量黏液用来自卫；属于非常原始的“鱼类近亲”，常在海底取食死亡或濒死动物"},"examples":[{"en":"When threatened, a hagfish can release slime that clogs a predator’s mouth and gills.","zh":"受到威胁时，盲鳗会释放黏液，堵住捕食者的口和鳃。"},{"en":"Scientists study hagfish to learn about early vertebrate evolution.","zh":"科学家研究盲鳗，以了解早期脊椎动物的进化。"},{"en":"Hagfish often live in deep water and feed by scavenging on the seafloor.","zh":"盲鳗常生活在深海，通过在海底捡食腐肉为生。"}]}],"synonyms":["slime eel"],"phonetic":"/ˈhæɡˌfɪʃ/","extraExplanation":["“hagfish”这个名字来自它看起来像鳗鱼（fish）又有点“丑/怪”（历史上hag也可指“丑老太婆”，带贬义），但现代科学语境里它只是中性动物名称，不是在骂人。","盲鳗以“会出大量黏液”出名：黏液遇水会迅速膨胀成网状结构，帮助它逃脱。英语里常见表达是“hagfish slime”（盲鳗黏液）。","有时会与“lamprey（七鳃鳗）”混淆：两者都无颌、外形相似，但七鳃鳗多为寄生，盲鳗多为食腐。"]}
{"word":"hagfish-related","summary":{"en":"connected with hagfish","zh":"与盲鳗有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, about, or involving hagfish (eel-like marine animals known for producing slime)","zh":"与盲鳗（hagfish，一种会分泌黏液的鳗状海洋动物）有关的；涉及盲鳗的"},"examples":[{"en":"The lab studies hagfish-related proteins that may have medical uses.","zh":"实验室研究与盲鳗有关的蛋白质，这些蛋白可能有医学用途。"},{"en":"A hagfish-related slime sample was collected for testing.","zh":"研究人员采集了一个与盲鳗相关的黏液样本用于检测。"}]}],"synonyms":["hagfish-associated","hagfish-derived","hagfish-linked","myxinoid"],"phonetic":"ˈhæɡˌfɪʃ rɪˈleɪtɪd","extraExplanation":["“related”在这里表示“有关联/相关”，常用于把某个研究主题和对象连接起来：如 cancer-related（与癌症相关的）、stress-related（与压力相关的）。","盲鳗以“遇到威胁时分泌大量黏液”著名，因此 hagfish-related 在语境中常指“盲鳗黏液、盲鳗纤维/蛋白、盲鳗生态或进化”等话题。"],"etymology":"由“hagfish（盲鳗）+ related（相关的）”构成的复合形容词；常用于科研或新闻写作中，表示“与盲鳗有关的”。","mnemonic":["把它拆开记：hagfish（盲鳗）+ related（related=有关的）→ “盲鳗相关的”。","联想科研标题常用结构：A-related B = “与A相关的B”（如 hagfish-related slime）。"]}
{"word":"hagfishes","summary":{"en":"Hagfishes are eel-like, jawless sea animals famous for producing slime.","zh":"hagfishes 指盲鳗：像鳗鱼、无下颌、以分泌大量黏液闻名的海洋动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Any of several eel-like, jawless marine animals that produce a lot of slippery mucus (slime) and often feed on dead or dying fish.","zh":"盲鳗（又称“黏液鳗”）：一种像鳗鱼、没有下颌的海洋动物，会分泌大量黏液，常以死亡或将死的鱼为食。"},"examples":[{"en":"Hagfishes can release thick slime to protect themselves from predators.","zh":"盲鳗会释放浓稠的黏液来保护自己免受捕食者伤害。"},{"en":"Scientists study hagfishes because they are among the most ancient-looking living vertebrates.","zh":"科学家研究盲鳗，因为它们被认为是现存最“古老形态”的脊椎动物之一。"}]}],"synonyms":["hagfish","slime eel"],"phonetic":"/ˈhæɡˌfɪʃɪz/","extraExplanation":["“hagfish”通常也写作一个词（hagfish），复数可以是 hagfish（不变）或 hagfishes（加 -es）。在科普文章里两种复数都能见到，hagfish 更常用。","名称里的 hag 在现代英语里常指“老巫婆/丑老太婆”，带一点贬义色彩；这里更多是形象化命名，用来强调它外形怪异，并不用于指人。","盲鳗以“黏液”闻名：遇到威胁时能迅速分泌大量黏液，让捕食者难以下口；有些报道会提到它们能钻进鱼体内取食，这是它们在海洋清道夫生态位的一部分。"]}
{"word":"haggada","summary":{"en":"A Jewish Passover Seder book that tells the Exodus story and guides the ritual.","zh":"犹太教逾越节家宴（Seder）使用的读本，讲述出埃及故事并指导仪式流程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) A book or text used at the Passover Seder that tells the story of the Exodus from Egypt and guides the order of the ritual, prayers, songs, and discussion.","zh":"（犹太教）《逾越节哈加达》（常写作 Haggadah）：逾越节家宴（Seder）中使用的仪式读本，讲述出埃及记的故事，并指导家宴的流程、祷文、歌曲与讨论。"},"examples":[{"en":"During the Seder, everyone followed along in the Haggadah.","zh":"在逾越节家宴上，大家都跟着《哈加达》一起阅读。"},{"en":"Our family has an old Haggadah with notes in the margins.","zh":"我们家有一本很旧的《哈加达》，页边还有做过的笔记。"},{"en":"She brought a bilingual Haggadah so the guests could understand the prayers and story.","zh":"她带来一本双语《哈加达》，让客人能看懂祷文和故事。"}]}],"synonyms":["Passover Haggadah","Seder book"],"phonetic":"/həˈɡɑːdə/","extraExplanation":["常见拼写是 **Haggadah**（你写的 *haggada* 也会出现，但较少见）。词源来自希伯来语 **haggadah**，意为“讲述/叙述”，对应逾越节中“讲述出埃及故事”的核心命令。","Haggadah 通常包含“四个问题”（Four Questions）、十灾、杯酒与洗手等仪式提示，以及《Dayenu》等传统歌曲。不同家庭与社群会使用不同版本（传统、现代、女权/平权、双语等）。","注意不要与 **Aggadah/Haggadah**（犹太拉比文献中的“叙事/传说性”内容）混淆；那是更广义的术语，而 Passover Haggadah 特指逾越节家宴用的读本。"]}
{"word":"haggadah","summary":{"en":"The Haggadah is the book used at the Passover Seder to retell the Exodus story and guide the ritual.","zh":"《哈加达》是逾越节家宴上使用的书，用来讲述出埃及故事并指导仪式流程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish text that sets out the order of the Passover (Pesach) Seder and tells the story of the Exodus from Egypt, with prayers, readings, songs, and rituals.","zh":"《哈加达》：犹太教文本，规定逾越节（Pesach）家宴（Seder）的流程，并讲述以色列人出埃及的故事，包含祷文、诵读、歌曲与仪式。"},"examples":[{"en":"During Passover, many families read the Haggadah at the Seder table.","zh":"在逾越节期间，许多家庭会在家宴桌上诵读《哈加达》。"},{"en":"They used a bilingual Haggadah so everyone could follow the story.","zh":"他们用一本双语《哈加达》，这样每个人都能跟上故事内容。"}]}],"synonyms":["Passover Haggadah","Seder book"],"phonetic":"/həˈɡɑːdə/","extraExplanation":["“Haggadah”来自希伯来语，意思与“讲述/叙述”有关；它的核心目的是把出埃及的故事一代代“讲出来”，并通过提问与讨论让孩子和新成员参与。","不同社群（如阿什肯纳兹、塞法迪）常有不同版本与传统内容；也有现代版本会加入当代主题（如自由、移民、人权）的讨论。","常见搭配：the Passover Haggadah（逾越节《哈加达》）、a children’s Haggadah（儿童版）、a bilingual/illustrated Haggadah（双语/插图版）。"]}
{"word":"Haggadahs","summary":{"en":"Passover Seder texts (plural) that guide the ritual and retell the Exodus story.","zh":"（复数）逾越节家宴的仪式读本，用来引导流程并讲述出埃及故事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jewish texts (plural) used at the Passover Seder, containing the order of the meal, prayers, songs, and the story of the Exodus.","zh":"（复数）逾越节家宴（Seder）使用的《哈加达》文本，包含仪式流程、祷文、歌曲与出埃及记的讲述。"},"examples":[{"en":"Different families use different Haggadahs at the Seder.","zh":"不同的家庭会在家宴上使用不同版本的《哈加达》。"},{"en":"The library has a collection of illustrated Haggadahs from many countries.","zh":"图书馆收藏了许多国家的插图版《哈加达》。"}]}],"synonyms":["Passover booklets","Seder guides","Seder books","ritual texts"],"phonetic":"/həˈɡɑdə/","extraExplanation":["文化提示：逾越节（Passover）期间的 Seder 是家庭/社群的仪式晚餐，《哈加达》会引导参与者按顺序进行诵读、提问（如“四个问题”）、饮酒、吃象征性食物等。不同版本可能加入现代译文、注释或艺术插图。"],"etymology":"来自希伯来语 haggadah，意为“讲述、叙述”，指在逾越节家宴中“讲述出埃及的故事”的文本与仪式内容。","mnemonic":["把它想成“哈—讲—答”：逾越节时要“讲述”（tell）出埃及故事；Haggadah 的核心就是“讲述”。","联想 Hebrew 根 haggad- ≈ “to tell（讲）”，和中文“讲故事”的“讲”对应。"]}
{"word":"haggadal","summary":{"en":"Haggadah: the Jewish text read at the Passover Seder, telling the Exodus story and guiding the rituals.","zh":"Haggadah：《哈加达》，逾越节家宴上诵读的犹太文本，讲述出埃及故事并指导仪式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish text read during the Passover meal (the Seder) that tells the story of the Exodus from Egypt and explains the rituals.","zh":"《哈加达》（逾越节家宴读本）：犹太人在逾越节家宴（Seder）中诵读的文本，讲述《出埃及记》的故事，并解释相关仪式。"},"examples":[{"en":"During the Seder, the family read from the Haggadah and discussed its meaning.","zh":"在逾越节家宴上，全家人会诵读《哈加达》，并讨论其中的意义。"},{"en":"Many communities use a bilingual Haggadah with both Hebrew and English.","zh":"许多社群会使用希伯来语和英语对照的《哈加达》。"}]}],"synonyms":["Passover Haggadah","Seder service book"],"phonetic":"/həˈɡɑdə/","extraExplanation":["你写的 “haggadal” 通常是拼写误差；更常见、规范的拼法是 **Haggadah**（也常写作 *Haggada*）。","词源来自希伯来语，意思接近“讲述/叙述”。在逾越节家宴中，核心主题是“讲述出埃及的故事”，因此这本读本叫 Haggadah。","在英语语境里常会看到搭配：**Passover Haggadah**（逾越节《哈加达》）、**to read the Haggadah**（诵读《哈加达》）、**Seder plate**（家宴盘）等。"]}
{"word":"haggadas","summary":{"en":"“Haggadas” means multiple Haggadah texts used to guide the Passover Seder.","zh":"“haggadas”指多本《哈加达》，即用于指导逾越节家宴（Seder）的文本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of Haggadah: Jewish texts (books or booklets) used at the Passover (Seder) meal to tell the story of the Exodus and guide the ceremony.","zh":"Haggadah（逾越节《哈加达》）的复数：犹太人在逾越节家宴（Seder）中使用的文本（书或小册子），用于讲述《出埃及记》的故事并指导仪式流程。"},"examples":[{"en":"Every family brought their own Haggadas to the Seder table.","zh":"每个家庭都把各自的《哈加达》带到逾越节家宴的餐桌上。"},{"en":"The library has several illustrated Haggadas from different centuries.","zh":"这家图书馆收藏了几本来自不同世纪的插图《哈加达》。"}]}],"synonyms":["Haggadahs","Haggadot","Passover Haggadahs"],"phonetic":"/həˈɡɑdə/","extraExplanation":["“Haggadah”（哈加达）来自希伯来语，意为“讲述/叙述”，核心用途是在逾越节家宴中按顺序朗读与讨论，内容通常包括出埃及的故事、祝福词、诗歌与仪式指引。","英文里常见拼写是 Haggadah；复数可以写作 Haggadot（更接近希伯来语复数形式）或 Haggadahs（英语化复数）。你输入的“haggadas”通常指同一个复数概念，只是较少见的拼写。"]}
{"word":"haggaday","summary":{"en":"Haggadah: the book/text used at the Passover Seder to tell the Exodus story and guide the ceremony.","zh":"Haggadah：《逾越节读本》，在 Seder 仪式餐中讲述出埃及故事并引导仪式流程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “Haggadah”) A Jewish text used at the Passover (Pesach) meal, telling the story of the Exodus from Egypt and guiding the order of the Seder ceremony.","zh":"（通常拼作 “Haggadah”）犹太教逾越节（Pesach）家宴/仪式餐（Seder）中使用的读本，讲述《出埃及记》的故事，并指导整个仪式流程。"},"examples":[{"en":"We read from the Haggadah during the Passover Seder.","zh":"我们在逾越节的 Seder 仪式餐上诵读《Haggadah》。"},{"en":"Different families may use different versions of the Haggadah.","zh":"不同家庭可能会使用不同版本的《Haggadah》。"}]}],"synonyms":["Passover Haggadah","Seder book"],"phonetic":"/həˈɡɑːdə/","extraExplanation":["你输入的 “haggaday” 很可能是 “Haggadah” 的拼写误差或音译写法；英语里最常见的拼法是 Haggadah（也常见 Haggada）。","Haggadah 的核心作用是“带领”Seder：包含固定的祝福语、问答（如“四个问题”）、象征食物的说明，以及叙事与讨论提示。不同社群与年代会有不同版本（传统、现代、儿童版等）。","这个词来自希伯来语，含义与“讲述/叙述”有关，因此常被理解为“讲述出埃及故事的书/文本”。"]}
{"word":"Haggadic","summary":{"en":"connected with Jewish rabbinic narrative and ethical interpretation rather than law","zh":"与犹太拉比传统中偏叙事与伦理阐释（非律法）的内容有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the narrative, moral, and interpretive (non-legal) traditions in Jewish rabbinic literature, especially as contrasted with legal discussion.","zh":"指与犹太拉比文献中的“故事性、劝诫性、解释性（非律法）传统”有关，常与偏律法讨论的内容相对。"},"examples":[{"en":"The lecture focused on Haggadic stories that convey ethical lessons rather than legal rules.","zh":"这场讲座聚焦于带有伦理教训的哈加迪克故事，而不是律法条文。"},{"en":"In the Talmud, Haggadic passages often include legends, parables, and reflections on biblical characters.","zh":"在《塔木德》中，哈加迪克段落常包含传说、寓言，以及对《圣经》人物的反思。"}]}],"synonyms":["aggadic","narrative","interpretive","homiletic"],"phonetic":"/həˈɡɑːdɪk/","extraExplanation":["在犹太传统里常用对比：*Halakhic*（偏“律法/规范/怎么做”） vs. *Haggadic*（偏“故事/价值/意义/为什么”）。因此 *Haggadic* 往往和寓言、传说、伦理劝勉、经文阐释等内容相关。","拼写上你可能也会见到 *Aggadic*（更常见）；两者通常指同一概念，只是转写（音译）习惯不同。"],"etymology":"源自希伯来语/亚兰语词根 *Aggadah/Haggadah*（意为“叙述、讲述、传说”），进入英语后形成形容词 *Haggadic/Aggadic*，用来指拉比传统中偏叙事与阐释的部分。","mnemonic":["把它联想成“哈加达（Haggadah）里的故事”：看到 *Haggadic* 就想到“讲故事、讲道理（非律法）”。","记住对照组：*Halakhic*（规矩/法律）→ *Haggadic*（故事/寓言/启发）。"]}
{"word":"haggadic","summary":{"en":"Haggadic means “related to Jewish aggadah”—the story-based, non-legal rabbinic tradition.","zh":"haggadic 指“与犹太教阿加达（叙事性的、非律法的拉比传统）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Jewish aggadah: the non-legal parts of rabbinic tradition (stories, legends, moral teachings, interpretations).","zh":"与犹太教“阿加达/哈加达”（aggadah）有关的：指拉比传统中非律法性的内容，如故事、传说、道德教诲与寓意式解释。"},"examples":[{"en":"The article compares halakhic rules with haggadic storytelling in the Talmud.","zh":"这篇文章比较了《塔木德》中“哈拉卡”（律法）规则与 haggadic（阿加达式）的叙事。"},{"en":"Her lecture focused on haggadic passages that teach ethics through narrative.","zh":"她的讲座聚焦于通过叙事传达伦理的 haggadic 段落。"},{"en":"The rabbi used a haggadic parable to explain a difficult idea.","zh":"拉比用一个 haggadic（寓言式）的故事来解释一个难懂的概念。"}]}],"synonyms":["aggadic","non-legal (rabbinic)","narrative (rabbinic)"],"phonetic":"/həˈɡɑdɪk/","extraExplanation":["“Haggadic”来自“aggadah/ haggadah”（常译“阿加达/哈加达”），指犹太经典与拉比文献中偏叙事、寓言、劝诫、神学与民间传说的部分；它常与“halakhic”（哈拉卡式，偏律法与规范）相对。","拼写提示：也常见写法为“aggadic”（以 a- 开头），两者在学术语境中多可互换；具体用哪种常取决于作者或出版传统。"]}
{"word":"haggadical","summary":{"en":"Haggadical usually means “haggadic”: related to the Haggadah or the narrative/ethical (non-legal) side of rabbinic Judaism.","zh":"Haggadical 通常指更常见的 haggadic：与《哈加达》或拉比犹太传统中叙事、伦理等“非法律性”内容相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Haggadah or to the non-legal, story-and-ethics parts of rabbinic Jewish tradition (as opposed to legal discussion).","zh":"与《哈加达》（Haggadah）或犹太拉比传统中“非法律性”的叙事、寓言、伦理教导部分有关的（相对法律讨论而言）。"},"examples":[{"en":"The rabbi told a haggadic story to explain the meaning of kindness.","zh":"拉比讲了一个哈加达式的故事来说明善良的意义。"},{"en":"Her essay compares legal arguments with haggadic teaching.","zh":"她的文章把法律论证与哈加达式的教导作了比较。"}]}],"synonyms":["haggadic","aggadic"],"phonetic":"/həˈɡɑːdɪk/","extraExplanation":["你输入的“haggadical”在英语里较少见，更常见的拼法是 **haggadic**（也写作 **aggadic**）。两者通常指向同一概念：犹太口传传统/塔木德相关文献中偏叙事、寓言、道德劝导的部分。","在犹太传统里常用对比是：**halakhic**（法律/规范层面） vs. **haggadic/aggadic**（故事、神学思考、伦理与民间传说等）。"]}
{"word":"haggadist","summary":{"en":"A haggadist is a storyteller or writer of Jewish aggadah—rabbinic legends and moral narratives (non-legal teachings).","zh":"haggadist 指讲述或撰写犹太“哈加达/阿加达”（拉比传统中的故事、传说与伦理叙事等非律法内容）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who composes, teaches, or retells Jewish aggadah (non-legal rabbinic stories, legends, and moral teachings), or who writes in a narrative/folkloric style within Jewish tradition","zh":"哈加达（犹太拉比传统中的故事、传说与伦理教诲等“非律法”内容）的讲述者、编纂者或作者；亦指以此类叙事/民间故事风格进行写作的人"},"examples":[{"en":"In his lectures, the rabbi spoke like a haggadist, using stories to make ethical ideas memorable.","zh":"在讲座中，那位拉比很像一位哈加达讲述者，用故事让伦理观念更容易记住。"},{"en":"Scholars sometimes compare a medieval haggadist’s tales with later folk stories from the same communities.","zh":"学者有时会把中世纪哈加达作者的故事与同一社群后来流传的民间故事作比较。"}]}],"synonyms":["aggadist","rabbinic storyteller","Jewish storyteller"],"phonetic":"/ˈhɑːɡəˌdɪst/","extraExplanation":["“Haggadist”来自“haggadah/aggadah”。在犹太传统里，aggadah（常译作“哈加达/阿加达”）指与律法（halakhah）相对的叙事性内容：寓言、传说、历史轶事、道德劝诫等。","不要把它与逾越节（Passover）的《Haggadah》（餐桌上诵读的仪式文本）混为一谈：两者同源，但一个更偏“广义叙事传统”，一个更偏“特定节日文本”。","该词较少见，多出现在宗教学、犹太研究或文学研究语境中。更常见的近义表达是“storyteller (of aggadah)”或直接说“rabbinic storyteller”。"]}
{"word":"haggadistic","summary":{"en":"Haggadistic means “related to Jewish narrative/ethical teaching traditions (Aggadah), not Jewish law.”","zh":"haggadistic 指“与犹太拉比传统中的叙事/伦理教诲（阿加达）相关，而非法律规条部分”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Haggadah (Aggadah): the non-legal, narrative, ethical, and interpretive traditions in Jewish rabbinic literature (e.g., stories, parables, moral teaching).","zh":"与“哈加达/阿加达（Haggadah/Aggadah）”有关的：指犹太拉比文献中非法律性的叙事、伦理教诲与诠释传统（如故事、寓言、劝诫、讲解）。"},"examples":[{"en":"The rabbi’s sermon included a haggadistic story to teach kindness.","zh":"拉比的讲道中用了一个哈加达式的故事来教导仁慈。"},{"en":"Scholars often contrast haggadistic passages with legal discussions in the Talmud.","zh":"学者常把塔木德中的哈加达式段落与法律性讨论作对比。"}]}],"synonyms":["aggadic","aggadistic","narrative","didactic"],"phonetic":"ˌhæɡəˈdɪstɪk","extraExplanation":["词形说明：haggadistic 来自 Haggadah/Aggadah（常译“哈加达/阿加达”）。在犹太传统中，Aggadah 多指拉比文献里的“故事性、劝诫性、解释性”内容，与 Halakhah（哈拉哈：法律/规条部分）相对。","用法提示：该词主要出现在学术写作（宗教学、犹太研究、文献研究）中，日常英语里较少见。拼写上也常见 aggadic / aggadistic 等变体。"]}
{"word":"Haggadot","summary":{"en":"Passover Seder guidebooks (plural).","zh":"逾越节家宴（Seder）用的仪式读本（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jewish books or booklets used at the Passover Seder that guide the ritual meal and contain the story of the Exodus, prayers, songs, and instructions.","zh":"逾越节（Passover）家宴/仪式晚餐（Seder）上使用的犹太传统读本（多本/多版本），包含《出埃及记》故事讲述、祷文、歌曲与流程指引。"},"examples":[{"en":"Each guest at the Seder had a different Haggadot, with slightly different translations.","zh":"逾越节家宴上，每位宾客手里都有不同版本的《哈加达》，翻译略有差异。"},{"en":"The family brought out their old Haggadot, marked with notes from past Passovers.","zh":"这家人拿出了旧版《哈加达》，上面还有往年逾越节留下的笔记。"},{"en":"Some communities print bilingual Haggadot to help everyone follow along.","zh":"有些社群会印双语《哈加达》，方便所有人跟上仪式流程。"}]}],"synonyms":["Haggadah","Seder texts","Passover guides","ritual booklets"],"phonetic":"/ˌhɑɡəˈdoʊt/","extraExplanation":["在英语中你也会看到单数形式 Haggadah（一本/一册）。Haggadot 是其希伯来语复数，用来指多本、多个版本或多种文本。","它通常在 Passover Seder（逾越节家宴/仪式晚餐）中使用，带领参与者按顺序完成诵读、提问、象征性食物、祝福与歌曲等环节。"],"etymology":"源自希伯来语复数形式“haggadot”，单数为“haggadah”，词根含义与“讲述/叙述（the telling）”相关，指在逾越节仪式中“讲述出埃及的故事”。","mnemonic":["把它记成“哈加达=讲故事的书”；逾越节要“讲出埃及故事”，所以需要 Haggadah；很多本就是 Haggadot。","联想中文“哈（h）+嘎（ga）+达（da）”：像在聚会里‘哈哈地讲故事’，对应它的核心功能“telling”。"]}
{"word":"haggadot","summary":{"en":"Haggadot are Passover seder books (plural of haggadah).","zh":"Haggadot 指逾越节 seder 使用的礼仪读本（haggadah 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Haggadah: books or booklets used at the Passover (Pesach) seder that guide the ritual meal and retell the story of the Exodus from Egypt, with prayers, readings, and songs","zh":"Haggadah（逾越节礼仪书）的复数：指在犹太教逾越节（Pesach）家宴礼仪（seder）中使用的仪式读本/小册子，用来引导流程，并讲述《出埃及记》的故事，包含祷文、诵读与歌曲"},"examples":[{"en":"Our family keeps several haggadot so everyone can follow the seder.","zh":"我们家备了好几本 haggadot，这样每个人都能跟上 seder（逾越节家宴礼仪）的流程。"},{"en":"The library displayed illustrated haggadot from different centuries.","zh":"图书馆展出了不同时代的插图版 haggadot。"}]}],"synonyms":["Passover Haggadot","seder books","Haggadahs"],"phonetic":"/həˈɡɑːdoʊt/","extraExplanation":["“Haggadot”是希伯来语词的英语转写复数；单数是“haggadah”。在英语里也常见写法“haggadas / haggadahs”（用英语规则加复数）。","Haggadah的核心内容围绕逾越节家宴（seder）的次序与讲述出埃及的故事；许多家庭会选择不同版本（传统、现代、儿童版、带注释或插图版）。","在文化与艺术史中，著名的中世纪手抄本“Passover Haggadah”（如“Barcelona Haggadah”等）常被研究与展览，因此你可能在博物馆或学术写作中看到“haggadot”。"]}
{"word":"Haggai","summary":{"en":"a biblical prophet and the book named after him","zh":"圣经先知之名及其同名书卷"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prophet in the Hebrew Bible (Old Testament) who encouraged the rebuilding of the Temple in Jerusalem after the exile.","zh":"《希伯来圣经》（《旧约》）中的先知，鼓励被掳归回后的犹太人重建耶路撒冷圣殿。"},"examples":[{"en":"In the Bible, Haggai urges the people to rebuild the Temple.","zh":"在《圣经》中，哈该敦促百姓重建圣殿。"},{"en":"The message of Haggai focuses on restoring worship and community life.","zh":"哈该的信息强调恢复敬拜与群体生活。"}]},{"partOfSpeech":"n.","definition":{"en":"The short biblical book traditionally attributed to this prophet.","zh":"《圣经》中传统上归于该先知的一卷短书（《哈该书》）。"},"examples":[{"en":"We read Haggai alongside Zechariah to understand the post-exilic period.","zh":"我们把《哈该书》和《撒迦利亚书》一起读，以理解被掳归回后的时期。"},{"en":"Haggai is one of the Minor Prophets in the Old Testament.","zh":"《哈该书》属于《旧约》中的“小先知书”之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name, especially used in Jewish and Christian contexts.","zh":"男性名字，常见于犹太与基督教文化语境。"},"examples":[{"en":"They named their son Haggai to honor the biblical prophet.","zh":"他们给儿子取名哈该，以纪念圣经中的先知。"}]}],"phonetic":"/ˈhæɡaɪ/","extraExplanation":["在英语里它通常作为专有名词使用：指“哈该”本人或《哈该书》。阅读宗教、历史或文学评论时，常见写法为 the Book of Haggai（《哈该书》）。","历史背景常被概括为：波斯时期、被掳归回后，重建圣殿的动员与劝勉。"],"etymology":"源自希伯来语“Ḥaggay”，常被解释为与“节期/庆典（ḥag）”有关，可能有“属节期的、与庆典相关的”之意；英语通过圣经传统进入。","mnemonic":["联想中文“哈该”≈“哈（呼喊）该（应该）”：他在书中“呼喊大家应该”重建圣殿。","把它和“节期/庆典”联系：ḥag（节日）→ Haggai（与节日有关的名字）。"]}
{"word":"haggai","summary":{"en":"Haggai is a biblical prophet and also the name of a short Old Testament book about rebuilding the Second Temple.","zh":"Haggai（哈该）既指《圣经》中的先知哈该，也可指旧约中的《哈该书》，主题与重建第二圣殿有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Hebrew prophet in the Bible, traditionally credited with the Book of Haggai, who encouraged the rebuilding of the Second Temple in Jerusalem (about 520 BCE).","zh":"《圣经》中的希伯来先知，传统上被认为是《哈该书》的作者；他鼓励重建耶路撒冷的第二圣殿（约公元前520年）。"},"examples":[{"en":"In the Bible, Haggai urges the people to rebuild the temple after returning from exile.","zh":"在《圣经》中，哈该敦促百姓在流亡归回后重建圣殿。"},{"en":"Our reading today included a passage from Haggai.","zh":"我们今天的阅读包含《哈该书》中的一段经文。"}]},{"partOfSpeech":"n.","definition":{"en":"The Book of Haggai, a short book in the Old Testament (Hebrew Bible).","zh":"《哈该书》：旧约（希伯来圣经）中的一卷短书。"},"examples":[{"en":"Haggai is one of the shorter prophetic books in the Old Testament.","zh":"《哈该书》是旧约中较短的先知书之一。"},{"en":"She studied Haggai alongside Zechariah for a history class.","zh":"她在历史课上把《哈该书》和《撒迦利亚书》一起学习。"}]}],"synonyms":["the Book of Haggai","Haggai (prophet)"],"phonetic":"/ˈhæɡaɪ/","extraExplanation":["“Haggai”常译为“哈该”。在宗教与学术语境中，它既可指“哈该这位先知”，也可直接指《圣经》中的《哈该书》。","名字可能与希伯来语中“节日/庆典”的含义有关；因此在注释或文化背景介绍里，有时会提到其名字的词源联想。"]}
{"word":"haggard","summary":{"en":"Haggard describes a person (or sometimes an animal) who looks extremely tired, worn, or unwell.","zh":"haggard 用来形容人（有时也指动物）看起来非常疲惫、憔悴、状态很差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Looking very tired, worried, or unwell, often because of stress, illness, or lack of sleep.","zh":"看起来非常疲惫、憔悴或不舒服（常因压力、疾病或睡眠不足）。"},"examples":[{"en":"After the night shift, he looked haggard and could barely keep his eyes open.","zh":"上完夜班后，他看起来很憔悴，几乎睁不开眼。"},{"en":"She gave a haggard smile and said she hadn’t slept for days.","zh":"她勉强露出疲惫的笑容，说自己好几天没睡了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Wild-looking and thin or worn-out (often used for animals, or for people in a more literary style).","zh":"（多用于动物，或文学语境中的人）形容瘦弱、破败、神情凶乱/憔悴的。"},"examples":[{"en":"A haggard dog wandered the street, searching for food.","zh":"一只瘦骨嶙峋的狗在街上游荡，寻找食物。"},{"en":"In the novel, a haggard stranger appears at the door in the rain.","zh":"在小说里，一个憔悴的陌生人在雨中出现在门口。"}]}],"synonyms":["exhausted","worn-out","weary","gaunt","drawn"],"phonetic":"/ˈhæɡɚd/","extraExplanation":["“haggard”常用来形容“脸色差、精神被掏空”的状态，比“tired”更强烈，也更带有“长期压力/折磨”的感觉。","常见搭配：haggard face（憔悴的脸）、look haggard（看上去憔悴）、a haggard expression（疲惫的神情）。","近义词辨析：exhausted（精疲力尽，偏体力/精力耗尽）、worn out（累坏了/用旧了，口语常用）、gaunt（消瘦凹陷，强调“瘦”而不一定疲惫）。"]}
{"word":"haggardly","summary":{"en":"“Haggardly” means “in a haggard (worn-out, exhausted) way.” It’s mainly an adverb; as an adjective it’s rare.","zh":"“haggardly”表示“以憔悴、疲惫不堪的方式”。主要作副词；作形容词较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that looks tired, thin, or worn out (often from stress, illness, or lack of sleep).","zh":"以一种憔悴、消瘦或疲惫不堪的样子（常因压力、疾病或缺乏睡眠）。"},"examples":[{"en":"She smiled haggardly after the long night at the hospital.","zh":"在医院熬了一整夜后，她憔悴地笑了笑。"},{"en":"He spoke haggardly, as if he hadn’t slept for days.","zh":"他说话时显得很憔悴，仿佛好几天没睡。"}]},{"partOfSpeech":"adj.","definition":{"en":"Looking haggard; showing exhaustion or suffering. (Rare; more commonly you use the adjective “haggard.”)","zh":"显得憔悴的；呈现出疲惫或受苦的样子。（较少见；更常用形容词“haggard”。）"},"examples":[{"en":"Her haggardly face in the mirror scared her.","zh":"镜子里那张憔悴的脸把她吓了一跳。"}]}],"synonyms":["wearily","gauntly","drawnly","exhaustedly"],"phonetic":"/ˈhæɡɚdli/","extraExplanation":["“haggardly”来自形容词“haggard”（憔悴的）加上副词后缀“-ly”。在现代英语里，人们更常说“look haggard / a haggard look”，而“haggardly”多用于文学或更强调“以……方式”的写法。","语气上，“haggard/haggardly”通常暗示长期消耗（压力、病痛、贫困、失眠），比“tired”更强，也更带画面感。"]}
{"word":"haggardness","summary":{"en":"Haggardness means the state of looking worn out, worried, or unhealthy.","zh":"haggardness 指“看起来憔悴、疲惫、忧虑或不健康的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of looking very tired, worried, or ill, often with a thin face or stressed expression.","zh":"憔悴、消瘦、面容疲惫的状态（常带有忧虑或病容）。"},"examples":[{"en":"After weeks of night shifts, there was a clear haggardness in his face.","zh":"连续上了几周夜班后，他脸上明显带着憔悴。"},{"en":"The photo captured the haggardness of people who had lived through the storm.","zh":"这张照片捕捉到了经历风暴后人们的憔悴神情。"}]}],"synonyms":["gauntness","weariness","exhaustion","drawn look","pallor"],"phonetic":"/ˈhæɡərdnəs/","extraExplanation":["“haggardness”来自形容词“haggard”（憔悴的、面容枯槁的）加名词后缀“-ness”（表示“……的状态/性质”）。更常见的表达是直接用“haggard”作形容词，例如：He looked haggard。","它通常描述“外表呈现出的疲惫/压力痕迹”，语气偏负面，常出现在叙事、新闻或文学描写中，用来强调长期劳累、焦虑、疾病或艰难经历对人的影响。"]}
{"word":"haggards","summary":{"en":"“Haggards” is the plural of “haggard,” meaning people who look very tired and worn out; “haggard” can also mean a wild hawk in older usage.","zh":"“haggards”是“haggard”的复数，常指一群看起来非常疲惫憔悴的人；“haggard”在较旧用法中也可指未驯服的野鹰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"looking tired, thin, or worn out, often because of worry, hunger, or lack of sleep","zh":"（因忧虑、饥饿或睡眠不足而）憔悴的，消瘦疲惫的"},"examples":[{"en":"After the long flight, she looked haggard and pale.","zh":"长途飞行后，她看起来憔悴而苍白。"},{"en":"He gave a haggard smile after working all night.","zh":"通宵工作后，他勉强露出一个疲惫的笑容。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who looks very tired or worn out","zh":"憔悴不堪的人；疲惫的人"},"examples":[{"en":"The hikers arrived as a group of haggards, exhausted and hungry.","zh":"徒步者们到达时个个疲惫不堪，又饿又累。"}]},{"partOfSpeech":"n.","definition":{"en":"a wild (uncaptured) hawk, especially one used in falconry contexts","zh":"（尤指猎鹰术语境中）未驯服的野鹰"},"examples":[{"en":"In old falconry writings, a “haggard” was a hawk caught after it had lived freely in the wild.","zh":"在古老的猎鹰术著作中，“haggard”指在野外自由生活过、后来被捕获的鹰。"}]}],"synonyms":["gaunt","worn-out","exhausted","drawn","wan","emaciated"],"phonetic":"/ˈhæɡərd/","extraExplanation":["“haggard(s)”常见于文学或新闻描写人的外貌，用来强调长期压力、贫困、战争或疾病带来的“被消耗感”。","词源上与猎鹰术有关：haggard原指“野生未驯的鹰”，后来引申为“外表像被风雨磨损一样的、憔悴的”。"]}
{"word":"hagged","summary":{"en":"“Hagged” means looking very worn-out and gaunt; it’s also a rare past form of “hag” meaning to harass.","zh":"“hagged”常指看起来非常疲惫、憔悴、消瘦；也可作罕见的“hag”的过去式，表示不断烦扰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Looking very tired, worn, or old (often from stress, illness, or lack of sleep); gaunt.","zh":"（常因压力、疾病或睡眠不足而）看起来非常疲惫、憔悴、显老的；消瘦的。"},"examples":[{"en":"After the overnight flight, she looked hagged and pale.","zh":"坐了一整夜的航班后，她看起来很憔悴，脸色也很苍白。"},{"en":"The long weeks of worry left him hagged and quiet.","zh":"连续几周的担忧让他变得憔悴而沉默。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hag” (rare): to harass or nag persistently.","zh":"“hag”的过去式/过去分词（少见）：不断纠缠、烦扰、唠叨。"},"examples":[{"en":"They said the critics had hagged him for years about his early mistakes. (rare)","zh":"他们说那些批评者多年一直揪着他早年的错误不放。（少见）"}]}],"synonyms":["haggard","gaunt","worn","drawn","exhausted"],"phonetic":"/hæɡd/","extraExplanation":["“hagged”主要来自名词“hag”（常指“丑陋/邪恶的老女巫或老太婆”这一刻板形象）。因此它带有较强的负面色彩，日常更常用更中性的词如：tired, exhausted, worn, haggard。","注意拼写与更常见的“haggard”（更标准、使用频率更高，意为“憔悴的”）很接近；写作时若想表达“憔悴”，通常优先用 haggard。"]}
{"word":"haggeis","summary":{"en":"Haggis is a traditional Scottish dish made from sheep offal mixed with oats and spices.","zh":"Haggis 是苏格兰传统食物，用羊内脏拌燕麦和香料制成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Haggis: a traditional Scottish dish made from sheep’s offal (especially heart, liver, and lungs) mixed with oats, spices, and fat, and cooked (traditionally in the animal’s stomach).","zh":"哈吉斯（苏格兰传统菜）：用羊的内脏（常见为心、肝、肺）与燕麦、香料和油脂混合后煮熟（传统上装在羊胃里）的一种食物。"},"examples":[{"en":"We tried haggis at a Scottish restaurant in Edinburgh.","zh":"我们在爱丁堡的一家苏格兰餐馆尝了哈吉斯。"},{"en":"Haggis is often served with “neeps and tatties” (turnips and potatoes).","zh":"哈吉斯常配“neeps and tatties”（芜菁和土豆）一起吃。"},{"en":"For Burns Night, many people eat haggis and listen to poetry.","zh":"在彭斯之夜，很多人会吃哈吉斯并欣赏诗歌。"}]}],"synonyms":["Scottish pudding","savory pudding"],"phonetic":"/ˈhæɡɪs/","extraExplanation":["你输入的“haggeis”更常见的拼写是 **haggis**。","文化背景：哈吉斯常与苏格兰诗人罗伯特·彭斯（Robert Burns）相关；在 **Burns Night（彭斯之夜）** 的庆祝活动中，人们会朗诵《Address to a Haggis》并享用这道菜。","用法提示：haggis 通常作不可数名词（吃“haggis”），但也可以指“一份/一个”haggis（如一个做好的整只）。"]}
{"word":"hagger","summary":{"en":"“Hagger” is uncommon in standard English; it can mean (rarely) a person who haggles, or it may simply be a surname.","zh":"“hagger”在标准英语中不常见；它（罕见地）可指爱讨价还价的人，也可能只是一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, nonstandard) A person who haggles; someone who bargains persistently over price.","zh":"（罕见/非标准用法）爱讨价还价的人；在价格上反复争论的人。"},"examples":[{"en":"At the market, he became a real hagger, arguing over every dollar.","zh":"在市场里，他简直成了个“hagger”，每一块钱都要争半天。"},{"en":"Some sellers avoid haggers because negotiations take too long.","zh":"有些卖家会避开爱讨价还价的人，因为谈价太耗时间。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Ms. Hagger will join the meeting at 2 p.m.","zh":"Hagger 女士将于下午两点参加会议。"}]}],"synonyms":["bargainer","haggler (common)"],"phonetic":"/ˈhæɡər/","extraExplanation":["“hagger”在现代英语里不是常见的标准词。日常表达“讨价还价”更常用动词 **haggle**（如：*to haggle over the price*）。","如果你想表达“被折磨得很疲惫/憔悴”，常见词是 **haggard**；如果你指某个品牌或人名，也可能是拼写接近但不同的词（例如 Haggar 作为商标/姓氏）。"]}
{"word":"hagging","summary":{"en":"“Hagging” is a very rare form meaning “harassing/wearing down,” or (even more rarely) acting like a “hag.” In most real-life writing, people mean “haggling” or “nagging.”","zh":"“Hagging”很少见，可能表示“不断折磨/纠缠”，更罕见时指“像老巫婆一样”。实际写作中很多人想表达的是“haggling（讨价还价）”或“nagging（唠叨/催促）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) the act of harassing, troubling, or wearing someone down; being a persistent nuisance (from the verb “to hag”).","zh":"（罕见/古旧）指不断骚扰、折磨或把人“磨得很疲惫”；持续纠缠（动词 to hag 的进行形式）。"},"examples":[{"en":"The critic wrote that worry was hagging him day and night.","zh":"评论家写道，忧虑日夜折磨着他。"},{"en":"Years of stress were hagging at her confidence.","zh":"多年的压力不断消磨她的自信。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very rare) behaving like a “hag” (an ugly or wicked old woman in folklore).","zh":"（极罕见）表现得像“hag”（民间传说中的丑陋或邪恶的老妇）。"},"examples":[{"en":"In the story, the witch is hagging around the village at night.","zh":"在故事里，女巫夜里像“老巫婆”一样在村子附近游荡。"}]}],"synonyms":["harassing","tormenting","wearing down","plaguing"],"phonetic":"/ˈhæɡɪŋ/","extraExplanation":["“hagging”在现代英语里非常少见。很多时候人们其实想写的是：\n1) “haggling”/ˈhæɡlɪŋ/：讨价还价（常见于买东西、谈合同）。\n2) “nagging”/ˈnæɡɪŋ/：唠叨、不断催促或抱怨。\n如果你告诉我你看到“hagging”的上下文句子，我可以帮你判断更可能是哪一个词。"]}
{"word":"haggiographal","summary":{"en":"Hagiographical means related to saints’ biographies, or (often critically) overly praising writing that ignores flaws.","zh":"hagiographical 指与圣徒传相关的；也常（带批评）指过度吹捧、回避缺点的写法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of writing) related to hagiography—stories or biographies about saints or very holy people.","zh":"（文章/写作）与“圣徒传”（描写圣人或非常圣洁人物的故事/传记）有关的。"},"examples":[{"en":"The book includes several hagiographical accounts of early Christian saints.","zh":"这本书收录了几篇关于早期基督教圣徒的圣徒传式记述。"},{"en":"Medieval writers often used hagiographical stories to teach moral lessons.","zh":"中世纪作家常用圣徒传式故事来传达道德教训。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often negative) praising someone in an unrealistic way, like a biography that ignores faults.","zh":"（常带贬义）对某人不切实际地歌颂；像传记那样只写优点、刻意忽略缺点。"},"examples":[{"en":"The article felt hagiographical—it mentioned her achievements but skipped every controversy.","zh":"那篇文章读起来像“歌功颂德”——只提她的成就，却跳过了所有争议。"},{"en":"He wanted an honest profile, not a hagiographical portrait.","zh":"他想要的是一篇诚实的特写，而不是歌功颂德式的肖像。"}]}],"synonyms":["hagiographic","laudatory","panegyrical","uncritical","idolizing"],"phonetic":"/ˌhæɡiəˈɡræfɪkəl/","extraExplanation":["你输入的 **haggiographal** 很可能是拼写错误；常见正确拼写是 **hagiographical**（也可见 hagiographic）。","词根提示：**hagio-** 来自希腊语，意为“神圣/圣人”；**-graph-** 与“写作/记录”有关，所以整体与“写圣人传记式的写法”相关。","文学与文化语境：在学术写作或新闻评论里，说某篇作品 **hagiographical** 往往是在批评它“过度吹捧、缺乏批判性”。"]}
{"word":"haggis","summary":{"en":"Haggis is a famous traditional Scottish dish made with organ meats, oatmeal, and spices, cooked in a casing and often eaten on Burns Night.","zh":"Haggis 是著名的苏格兰传统食物，用内脏、燕麦和香料做成，装入外壳煮熟，常在彭斯之夜食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Scottish dish made from sheep’s organ meats (especially heart, liver, and lungs), mixed with oatmeal, onion, spices, and stock, then cooked—traditionally in the animal’s stomach (now often in a casing).","zh":"哈吉斯（苏格兰传统料理）：用羊的内脏（常见为心、肝、肺）与燕麦、洋葱、香料和肉汤混合后烹煮；传统上装在羊胃里（现代多用肠衣或人造外壳）。"},"examples":[{"en":"Many people in Scotland eat haggis on Burns Night in January.","zh":"在一月的彭斯之夜，苏格兰许多人会吃哈吉斯。"},{"en":"I tried haggis for the first time and was surprised that it tasted warm and peppery, not scary at all.","zh":"我第一次吃哈吉斯时很惊讶：味道温暖又带胡椒香，一点也不可怕。"}]}],"synonyms":["Scottish pudding","savory pudding","offal pudding"],"phonetic":"/ˈhæɡɪs/","extraExplanation":["文化背景：haggis 常与苏格兰民族认同联系在一起，尤其在纪念诗人 Robert Burns（罗伯特·彭斯）的 Burns Night（1月25日前后）会上，会朗诵《Address to a Haggis》并把 haggis 作为主菜，通常配 “neeps and tatties”（芜菁/萝卜泥与土豆泥）。","语言点：haggis 在英语里通常是不可数概念（eat haggis），但也可以数作一个成品（a haggis）。发音里重音在第一个音节。"]}
{"word":"haggises","summary":{"en":"“Haggises” means more than one haggis, a traditional Scottish dish.","zh":"“Haggises”是 haggis 的复数，指多份/多种苏格兰传统菜肴 haggis（羊杂碎布丁）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of haggis: a traditional Scottish dish made from minced sheep organs (usually heart, liver, and lungs) mixed with oats, onions, spices, and fat, traditionally cooked in a sheep’s stomach (now often in a casing).","zh":"haggis 的复数：一种传统苏格兰菜肴，把剁碎的羊内脏（常见为心、肝、肺）与燕麦、洋葱、香料和油脂混合，传统上装入羊胃中煮熟（现代也常用肠衣/袋装代替）。"},"examples":[{"en":"At the festival, they served haggises with mashed potatoes and turnips.","zh":"在节庆上，他们供应了配土豆泥和芜菁泥的羊杂碎布丁（haggis）。"},{"en":"Some tourists try haggises for the first time on Burns Night in Scotland.","zh":"一些游客会在苏格兰的彭斯之夜（Burns Night）第一次尝试吃 haggis（羊杂碎布丁）。"}]}],"synonyms":["(plural) haggis","Scottish pudding","offal pudding"],"phonetic":"/ˈhæɡɪsɪz/","extraExplanation":["“Haggis”在英语里既可作不可数名词指这道菜（I ate haggis.），也常作可数名词指“一份/一个”（a haggis）。因此复数“haggises”通常出现在谈到多份或不同种类时（two haggises / vegetarian haggises）。","文化背景：haggis 常与苏格兰诗人罗伯特·彭斯（Robert Burns）相关。每年1月25日的 Burns Night 常会朗诵《Address to a Haggis》，并在仪式感很强的晚宴上端上这道菜。"]}
{"word":"haggish","summary":{"en":"Haggish means ‘hag-like’: thin, ugly, or witch-like in appearance, often in an old-fashioned or harsh tone.","zh":"haggish 意为“像老巫婆一样的”：形容人憔悴瘦削、丑陋或巫婆般，多为刻薄且较古旧的用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Describing a person, especially an older woman) looking like a hag; thin, ugly, or witch-like in appearance (often used in a harsh or old-fashioned way).","zh":"（形容人，尤指年长女性）像“老巫婆/丑老太婆”般的；憔悴瘦削、丑陋、带点“巫婆样”的（语气常刻薄，较古旧）。"},"examples":[{"en":"In the dim light, the actor’s makeup made him look haggish and frightening.","zh":"在昏暗的灯光下，演员的妆容让他看起来很“巫婆样”，挺吓人。"},{"en":"After weeks without sleep, she said she felt haggish—but her friends told her she still looked fine.","zh":"连续几周没睡好，她说自己感觉都“憔悴得像个老巫婆”了——但朋友们告诉她看起来还是不错。"},{"en":"The novel describes a haggish figure at the edge of the village, whispering curses.","zh":"小说描写村子边缘有个“巫婆般”的身影，低声念着诅咒。"}]}],"synonyms":["haglike","witch-like","gaunt","haggard","crone-like"],"phonetic":"/ˈhæɡɪʃ/","extraExplanation":["“haggish”来自名词“hag”（常指传说中的女巫或令人不快的丑老太婆）。因此它带有明显的贬义，也容易涉及年龄与外貌歧视；写作或日常交流中一般更建议用中性表达，如“tired-looking（显得很疲惫）”“gaunt（瘦削憔悴）”。","这是较少见、偏文学/古旧的词；现代英语里更常见的是“hag-like”或直接用“gaunt / witch-like”。"]}
{"word":"haggishly","summary":{"en":"“Haggishly” means “in a haggish (hag-like) way,” usually describing a worn, gaunt, or witch-like look or manner.","zh":"“haggishly”意为“以老巫婆般的样子/方式”，多指憔悴、瘦削或阴森、像女巫的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a haggish way; looking or behaving like a “hag” (an ugly, frightening old woman), often meaning worn, gaunt, or witch-like.","zh":"以“老巫婆/丑老太婆”般的样子或方式；常指面容憔悴、瘦削、显得阴森或像女巫。"},"examples":[{"en":"After weeks without sleep, he stared haggishly into the mirror.","zh":"连续几周没睡好后，他憔悴地盯着镜子里的自己。"},{"en":"The villain smiled haggishly from the shadows.","zh":"反派在阴影里露出阴森的笑。"}]}],"synonyms":["gauntly","wearily","tiredly","grimly","witch-like (in a ... way)"],"phonetic":"/ˈhæɡɪʃli/","extraExplanation":["“haggishly”来自形容词 haggish（“像hag一样的”）+ -ly。Hag 在英语里带有强烈贬义与年龄歧视色彩，常用在文学/恐怖/童话语境中塑造可怕或阴暗的形象；现实交流中用来形容真实人物可能很冒犯。","更中性、更常用的替代说法包括：tiredly（疲惫地）, wearily（倦怠地）, gauntly（瘦削地）, grimly（阴沉地）。"]}
{"word":"haggishness","summary":{"en":"Haggishness means a hag-like ugliness or a harsh, bitter vibe.","zh":"haggishness 指“像女巫/妖婆般”的丑陋阴森感，或（比喻）刻薄阴冷的气质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of looking or seeming like a hag (old, ugly, or witch-like), often suggesting a harsh or unpleasant appearance","zh":"“像女巫/老太婆一样”的特质（常指显得苍老、丑陋或阴森），带有刻薄不悦的外表意味"},"examples":[{"en":"The makeup was meant to be funny, but it gave the actor a kind of haggishness.","zh":"这个妆容本来是为了搞笑，却让演员看起来带着一种“女巫般”的阴森感。"},{"en":"After weeks of illness, she worried that her face had taken on haggishness.","zh":"病了好几周后，她担心自己的脸变得“像老太婆一样”憔悴难看。"}]},{"partOfSpeech":"n.","definition":{"en":"a harsh, bitter, or unfriendly vibe in someone’s manner or expression (figurative use)","zh":"（比喻）言行或神情中显出的刻薄、阴冷或不友善的感觉"},"examples":[{"en":"There was a touch of haggishness in his smile, as if he enjoyed other people’s problems.","zh":"他的笑里带着一丝刻薄阴冷，仿佛乐于看别人倒霉。"},{"en":"The character’s haggishness made her seem more frightening than powerful.","zh":"这个角色的阴冷刻薄让她显得更吓人，而不是更强大。"}]}],"synonyms":["hag-likeness","ugliness","ghastliness","sourness","bitterness","malevolence"],"phonetic":"/ˈhæɡɪʃnəs/","extraExplanation":["“haggishness”来自形容词“haggish”（像hag一样的），而“hag”在英语里常指“丑陋、刻薄的老太婆”或民间传说中的“女巫/妖婆”。因此这个词通常带强烈贬义，用来形容外貌或气质时要注意语境与礼貌。"]}
{"word":"haggister","summary":{"en":"Haggister is a rare/archaic word meaning “bachelor; unmarried man,” often used in old texts or records.","zh":"haggister 是非常罕见的古语，意思是“单身汉；未婚男子”，多见于旧文本或档案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a bachelor; an unmarried man (often implying he has remained unmarried for a long time).","zh":"（古语）单身汉；未婚男子（常暗示长期未婚）。"},"examples":[{"en":"In old records, he is described as a haggestor with no heirs.","zh":"在旧档案里，他被记作一位没有继承人的单身汉。"},{"en":"The village saw him as a lifelong bachelor—a haggestor.","zh":"村里人把他看作终身未婚的单身汉。"}]}],"synonyms":["bachelor","single man","unmarried man"],"phonetic":"/ˈhæɡstɚ/","extraExplanation":["“haggister”非常少见，多数情况下是对更常见古语拼写 **haggestor / hagester** 的误拼或变体。","词源可追溯到古英语，和“长期独身、未成家的人”有关；现代英语里通常直接用 **bachelor**（中性）或更口语的 **single man**。","如果你是在现代语境里看到“haggister”，也可能是拼写错误（例如想写 *haggis* 或其他词）。如果你能提供原句，我可以帮你精准判断。"]}
{"word":"haggle","summary":{"en":"Haggle means to bargain over price, or to argue back and forth over small details.","zh":"haggle 指为价格讨价还价，也可指为小细节反复争执。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to argue about the price of something in order to pay less (or sometimes to get better terms)","zh":"为压低价格（或争取更优惠条件）而讨价还价"},"examples":[{"en":"I haggled with the seller and got the price down by $10.","zh":"我和卖家讨价还价，把价格砍了10美元。"},{"en":"It’s common to haggle in some street markets, but not in most supermarkets.","zh":"在一些街头市场讨价还价很常见，但在大多数超市里通常不这样做。"}]},{"partOfSpeech":"v.","definition":{"en":"to argue for a long time over small details, often in an annoying or unproductive way","zh":"为一些小细节争执不休（常带有烦人或没有效率的感觉）"},"examples":[{"en":"We wasted an hour haggling over who should pay for parking.","zh":"我们为谁该付停车费争来争去，浪费了一个小时。"},{"en":"Let’s not haggle about tiny points—let’s focus on the main goal.","zh":"别在小问题上纠缠了，我们把重点放在主要目标上。"}]}],"synonyms":["bargain","negotiate","quibble","wrangle"],"phonetic":"/ˈhæɡəl/","extraExplanation":["“haggle”最常见于购物或谈判语境，语气通常比“negotiate（谈判）”更口语、更“为小钱/小细节拉扯”的感觉。","文化小提示：在美国的固定标价商店（如超市、连锁零售店）一般不讨价还价；但在二手交易（如跳蚤市场、二手车、部分服务报价）更可能出现。礼貌用语如 “Could you do $X?”（能不能卖X美元？）比直接砍价更得体。","常见搭配：haggle over the price（就价格讨价还价）；haggle with a vendor/seller（和商贩/卖家砍价）；haggle about/over details（为细节争论）。"]}
{"word":"haggle with sb. over sth.","summary":{"en":"bargain repeatedly about a price or terms","zh":"就价格或条件反复讨价还价"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to bargain with someone about the price or terms of something, often by going back and forth","zh":"（就某物的价格或条件）与某人讨价还价、反复协商"},"examples":[{"en":"I haggled with the seller over the price of the jacket.","zh":"我和卖家就那件夹克的价格讨价还价。"},{"en":"They haggled with the landlord over the rent and the move-in date.","zh":"他们和房东就租金和入住日期反复协商。"},{"en":"She didn’t want to haggle with him over a few dollars.","zh":"她不想为了几块钱跟他讨价还价。"}]}],"synonyms":["bargain","negotiate","dicker","quibble","wrangle"],"phonetic":"/ˈhæɡəl/","extraExplanation":["常见搭配：haggle with sb over sth（和某人就某事讨价还价）。","语气提示：在英语里 haggle 往往带一点“为小钱争来争去”的感觉；如果想更中性，可以用 negotiate (with sb) over/for sth。","使用场景：集市、二手交易、租房、合同条款等都常用。正式商务场景更常用 negotiate。"],"etymology":"源自中古英语 hagelen / haglen，早期含义与“争论、争吵”相关，后来逐渐固定为“就价格或条件讨价还价”。","mnemonic":["把 haggle 想成“哈（ha）着嗓子来回讲（gle）”，就是来回还价。","联想中文“砍价”：haggle 的 h- 开头像“砍价”时那种“哼哼哈哈”的来回拉扯。"]}
{"word":"haggled","summary":{"en":"“Haggled” means bargained repeatedly (often about price) or argued back and forth about details.","zh":"“haggled”表示反复讨价还价（常指价格），或为细节来回争执。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “haggle”: to bargain or negotiate repeatedly, especially about the price of something.","zh":"“haggle”的过去式/过去分词：反复讨价还价；（尤指）就价格进行来回协商。"},"examples":[{"en":"She haggled with the vendor and got the scarf for $10.","zh":"她和小贩讨价还价，最后用10美元买到了那条围巾。"},{"en":"We haggled over the rent for a week before signing the lease.","zh":"我们就房租来回谈了一周才签合同。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “haggle”: to argue or dispute in a stubborn, back-and-forth way about details.","zh":"“haggle”的过去式/过去分词：为细节反复争执、纠缠不休。"},"examples":[{"en":"They haggled about who should do the dishes.","zh":"他们为谁该洗碗争来争去。"},{"en":"The committee haggled over the wording of the final sentence.","zh":"委员会为最后一句的措辞反复争论。"}]}],"synonyms":["bargained","negotiated","wrangled","quibbled","bickered"],"phonetic":"/ˈhæɡəld/","extraExplanation":["“haggle”常带一点负面语气：强调来回拉扯、斤斤计较的感觉。中性表达可以用“negotiate / bargain”。","文化提示：在一些集市或路边摊还价很常见；但在大多数固定标价的商店（超市、连锁店）通常不还价。可以礼貌地问：“Is the price firm?”（价格固定吗？）或 “Can you do any better?”（能便宜点吗？）"]}
{"word":"haggler","summary":{"en":"A haggler is someone who tries to negotiate the price or terms of a deal.","zh":"haggler 指“讨价还价的人”，会就价格或交易条件进行谈判。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who bargains over the price of something, trying to pay less (or sometimes to get better terms).","zh":"讨价还价的人；砍价的人（试图把价格谈低，或争取更好的条件）。"},"examples":[{"en":"The haggler at the flea market offered half the asking price.","zh":"跳蚤市场里那个砍价的人只出对方要价的一半。"},{"en":"As a skilled haggler, she always gets a discount.","zh":"她很会砍价，总能拿到折扣。"},{"en":"The seller got tired of the haggler and ended the negotiation.","zh":"卖家被这个砍价的人弄烦了，结束了谈价。"}]}],"synonyms":["bargainer","negotiator","trader","deal-maker"],"phonetic":"/ˈhæɡlər/","extraExplanation":["“haggler”来自动词“haggle”（讨价还价）。在一些文化和场景（如集市、二手交易、旅游纪念品店）砍价很常见；但在多数大型商店、超市等明码标价的地方通常不砍价。","语气提示：说某人是“a haggler”多为中性描述（会砍价的人），但在某些语境也可能带一点负面含义，暗示“太爱砍、纠缠不休”。"]}
{"word":"hagglers","summary":{"en":"“Hagglers” means people who bargain over prices.","zh":"“hagglers”指讨价还价、砍价的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who bargain over a price, especially by repeatedly offering lower amounts or asking for a better deal","zh":"（尤指反复压价或讨价还价的）讨价还价者；砍价的人"},"examples":[{"en":"The street market is full of hagglers trying to get the lowest price.","zh":"街头市场里到处都是想把价格砍到最低的砍价者。"},{"en":"Some sellers enjoy hagglers, but others prefer fixed prices.","zh":"有些卖家喜欢遇到爱砍价的顾客，但也有人更喜欢明码标价。"}]}],"synonyms":["bargainers","negotiators","deal-seekers","shoppers (informal, context-dependent)"],"phonetic":"/ˈhæɡlər/","extraExplanation":["“haggler”来自动词“haggle（讨价还价）”。在不同文化中，砍价的礼貌程度差异很大：有些地方砍价很常见且被视为交流的一部分；而在超市、连锁店或“fixed price（固定价格）”商店里反复砍价可能会显得不合时宜。可以先用“Is the price negotiable?”（这个价格可以商量吗？）来确认是否能砍价。"]}
{"word":"haggles","summary":{"en":"“Haggles” means bargains about price or terms.","zh":"“haggles”指为价格或条件讨价还价。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bargain or argue about the price, terms, or conditions of a deal","zh":"（为价格或条件）讨价还价；争论协商"},"examples":[{"en":"He haggles with the seller over the price of the jacket.","zh":"他和卖家为那件夹克的价格讨价还价。"},{"en":"She always haggles at flea markets, but she stays polite.","zh":"她在跳蚤市场总会砍价，但一直很有礼貌。"},{"en":"My dad haggles for a discount when he buys a used car.","zh":"我爸爸买二手车时会讨个折扣。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bargain with someone directly (more formal or written use)","zh":"（更正式/书面）与某人讨价还价"},"examples":[{"en":"The company haggles with suppliers to lower costs.","zh":"公司与供应商讨价还价以降低成本。"},{"en":"The landlord haggles with tenants about the rent increase.","zh":"房东和租客就涨租问题讨价还价。"}]}],"synonyms":["bargains","negotiates","barters","wrangles"],"phonetic":"/ˈhæɡəlz/","extraExplanation":["“haggle”常用于买卖场景，语气通常中性，但如果在不适合议价的场合（如固定价商店、正式服务）反复砍价，可能会被认为不礼貌。与之相对，英语里也常说“negotiate”（更正式、范围更广）或“bargain”（更口语）。"]}
{"word":"haggling","summary":{"en":"Haggling means bargaining—going back and forth to agree on a price or terms.","zh":"Haggling 指讨价还价或对条件反复协商，直到达成一致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of negotiating a price (especially in markets) by making offers and counteroffers","zh":"（尤指在集市等场合）通过来回出价与还价来谈价、讨价还价的行为"},"examples":[{"en":"There was a lot of haggling over the price of the souvenir.","zh":"大家为了纪念品的价格讨价还价了很久。"},{"en":"In some places, haggling is expected, not rude.","zh":"在一些地方，讨价还价是常态，并不失礼。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of arguing back and forth about details to reach an agreement","zh":"为了达成一致而对细节反复争论、拉锯式协商"},"examples":[{"en":"After hours of haggling, they finally agreed on the contract terms.","zh":"经过数小时的拉锯协商，他们终于就合同条款达成一致。"},{"en":"The team wants to avoid endless haggling and make a quick decision.","zh":"团队想避免无休止的争论，尽快做决定。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “haggle”: negotiating by bargaining or arguing over a price or terms","zh":"“haggle”的现在分词：通过讨价还价或反复争论来协商价格或条件"},"examples":[{"en":"She was haggling with the vendor for a lower price.","zh":"她正在和摊贩讨价还价，想便宜一点。"},{"en":"They’re haggling over who pays for the repairs.","zh":"他们正在为谁来付维修费而争来争去。"}]}],"synonyms":["bargaining","negotiating","wrangling","bartering"],"phonetic":"/ˈhæɡlɪŋ/","extraExplanation":["“Haggling”在文化上常与露天市场、跳蚤市场、旅游购物等场景相关。在一些文化里适度砍价被视为交流的一部分；但在固定标价的商店（如大型连锁店）强行讨价还价可能会让人觉得不合适。可以用更礼貌的方式表达：\"Is that your best price?\"（这是最低价了吗？）或 \"Could you do any better?\"（还能便宜点吗？）。"]}
{"word":"haggly","summary":{"en":"Haggly is a rare dialect adjective meaning either “haggard-looking” or “uneven/gnarled.”","zh":"Haggly 是一个少见的方言形容词，可指“憔悴的”，也可指“参差不齐/嶙峋多结的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dialect, rare) Looking tired, thin, and a bit rough; haggard.","zh":"（方言/少见）看起来疲惫、消瘦、略显憔悴的；面容枯槁的。"},"examples":[{"en":"After the long trip, he looked haggly and hungry.","zh":"长途旅行后，他看起来很憔悴，也很饿。"},{"en":"She gave a haggly smile and said she hadn’t slept much.","zh":"她勉强露出一个憔悴的笑，说自己没怎么睡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(dialect, rare) Uneven, jagged, or gnarled (often describing wood, trees, or land).","zh":"（方言/少见）不平整的、参差不齐的、嶙峋多结的（常形容树木、木头或地形）。"},"examples":[{"en":"They walked through haggly bushes and rough ground.","zh":"他们穿过参差的灌木丛和崎岖的地面。"},{"en":"The old fence was made of haggly branches.","zh":"那道旧篱笆是用多结不齐的树枝做的。"}]}],"synonyms":["haggard","gaunt","weathered","gnarled","jagged","uneven"],"phonetic":"/ˈhæɡli/","extraExplanation":["“haggly”在现代标准英语里非常少见，更常见的是“haggard（憔悴的）”。在苏格兰英语或英格兰北部方言里，“haggly”有时既可形容人“憔悴”，也可形容树木/地形“参差、嶙峋”。","学习时要注意它容易被当成拼写错误：如果你想表达“讨价还价”，正确拼写是“haggle（v.）”。"]}
{"word":"haggy","summary":{"en":"“Haggy” means looking like a hag—very old-looking, worn, or unattractive; it’s rare and often negative in tone.","zh":"“haggy”指像“老巫婆/丑老太婆”一样，显得非常苍老、憔悴或难看；用法较少且语气常带贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Looking like a hag; very old-looking, worn, or unattractive (a rare/old-fashioned word).","zh":"像“老巫婆/丑老太婆”一样的；显得又老又憔悴、难看（较少见、偏旧式的用法）。"},"examples":[{"en":"After weeks without rest, he looked haggy and exhausted.","zh":"连续几周没休息后，他看起来憔悴又疲惫。"},{"en":"The mirror made her face seem haggy in the harsh light.","zh":"刺眼的光线让镜子里的她显得格外苍老难看。"}]}],"synonyms":["haggard","worn","gaunt","weathered","tired-looking"],"phonetic":"/ˈhæɡi/","extraExplanation":["“haggy”来自名词“hag”（常指丑陋、刻薄的老太婆，也可指民间传说中的女巫）。因为带有贬义和以外貌评价人的色彩，现代英语中使用较少；日常更常用“tired-looking / worn / haggard / gaunt”等较中性或更常见的词。","拼写上不要和“haggie / haggis”混淆；“haggis”是苏格兰的一种传统食物。"]}
{"word":"haghood","summary":{"en":"the state or period of being seen as a “hag” (insulting, literary/rare).","zh":"被视为“丑老太婆/女巫般老妇”的状态或时期（侮辱性、文学性且较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a hag; the condition of looking or being regarded as an ugly, old, or witch-like woman (usually insulting and old-fashioned).","zh":"成为“丑老太婆/女巫般老妇”（hag）的状态或时期；指外貌或形象被看作又老又丑、像女巫（多为侮辱性、较陈旧的说法）。"},"examples":[{"en":"The novel uses the word “haghood” to show how society cruelly labels aging women.","zh":"这部小说用“haghood”来呈现社会如何残酷地给年长女性贴标签。"},{"en":"She rejected the idea that turning fifty meant slipping into haghood.","zh":"她拒绝“到五十岁就会变成丑老太婆”的说法。"}]}],"synonyms":["hagdom","old age","cronehood"],"phonetic":"/ˈhæɡˌhʊd/","extraExplanation":["语感与使用提醒：hag 是强烈贬义词，常带性别歧视色彩；haghood 也因此常用于批判这种偏见、或在文学中制造尖刻效果。日常交流中避免用来指真人，可用 older woman / elderly woman / witch-like figure（在描写虚构角色时）等更中性表达。"],"etymology":"源自 hag（“丑老太婆；女巫”）+ -hood（表示“状态/身份/时期”，如 childhood 童年、neighborhood 社区）。因此 haghood 字面义为“成为 hag 的状态”。该词较少见，多见于文学或讽刺语境。","mnemonic":["记成“childhood=童年；haghood=‘hag’的时期/状态”。-hood 就是“……之道/……阶段”。","把 hag 联想成“哈（hag）+巫婆的形象”，haghood 就是“进入这种被贴标签的阶段”。"]}
{"word":"hagi","summary":{"en":"Hagi is most often seen as the root hagi- (“saint/holy”) in words like hagiography, and it can also be the name of a city in Japan.","zh":"Hagi 最常见作为词根 hagi-（“圣徒的/神圣的”）出现在 hagiography 等词中；也可指日本的城市名（萩市）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “saint” or “holy,” used mainly in words about saints’ lives and writings","zh":"构词成分，表示“圣徒的 / 神圣的”，多用于与圣徒生平与相关著作有关的词"},"examples":[{"en":"The word hagiography begins with hagi-, meaning “saint.”","zh":"hagiography（圣徒传）这个词以 hagi- 开头，表示“圣徒”。"},{"en":"In academic writing, you may see hagi- in terms related to saints and religious biography.","zh":"在学术写作中，你可能会看到 hagi- 出现在与圣徒或宗教传记有关的术语里。"}]},{"partOfSpeech":"n.","definition":{"en":"a city name in Japan (Hagi, Yamaguchi Prefecture), sometimes seen in English texts about history or pottery","zh":"日本城市名（萩市，位于山口县）；在英文材料中常见于历史或陶器（萩烧）相关语境"},"examples":[{"en":"Hagi is known for Hagi ware pottery.","zh":"萩市以萩烧陶器闻名。"},{"en":"The guidebook recommended visiting Hagi for its preserved samurai-era streets.","zh":"导游书推荐去萩市看看保存良好的武士时代街区。"}]}],"phonetic":"/ˈhæɡi/","extraExplanation":["“hagi-”来自希腊语 *hagios*（意为“神圣的、圣者的”）。在英语里它最常见于 **hagiography**（圣徒传/圣徒传记文学）等较正式、学术性的词汇中。日常英语里单独写 “hagi” 并不常见，更多是作为词根或专有名词出现。"]}
{"word":"hagia","summary":{"en":"“Hagia” is a Greek-derived element meaning “holy,” used mostly in proper names (e.g., Hagia Sophia).","zh":"“Hagia”源自希腊语，意为“神圣的”，多见于专有名词中（如 Hagia Sophia）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from Greek, used mainly in names) “holy” (feminine form), often referring to a saint or something sacred.","zh":"（源自希腊语，多用于专有名词中）“神圣的、圣洁的”（阴性形式），常指圣人或神圣之物。"},"examples":[{"en":"Hagia Sophia literally means “Holy Wisdom.”","zh":"Hagia Sophia 字面意思是“神圣的智慧”。"},{"en":"In some Orthodox contexts, “Hagia” can refer to a holy woman or a female saint.","zh":"在一些东正教语境中，“Hagia”可指一位圣洁的女性或女性圣徒。"}]}],"synonyms":["holy","saint","sacred"],"phonetic":"/ˈhɑːɡiə/","extraExplanation":["“Hagia”来自希腊语 Ἁγία（hagia），是“holy（神圣的）”的阴性形式。英语里它通常不是独立的日常词汇，而是出现在历史/宗教建筑或称号中（如 Hagia Sophia、Hagia Irene）。","Hagia Sophia 位于伊斯坦布尔，曾为拜占庭大教堂，后改为清真寺与博物馆（不同历史阶段有变化）。在英语文化语境中，提到 “Hagia” 最常见的联想就是这座建筑及其希腊语含义。"]}
{"word":"hagiarchies","summary":{"en":"“Hagiarchies” means systems of rule led by saints or officially holy religious figures (plural).","zh":"“hagiarchies” 指由圣人或被视为神圣的宗教人物掌权的统治/政体（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of hagiarchy) a system of rule or government led by saints or officially “holy” religious figures; the leadership of holy people.","zh":"（hagiarchy 的复数）由圣人或被正式视为“圣洁”的宗教人物掌权的统治/政体；圣职圣人式的统治。"},"examples":[{"en":"Some writers use the term “hagiarchies” to describe imagined societies governed by saints.","zh":"有些作者用 “hagiarchies” 来形容由圣人统治的想象社会。"},{"en":"In the novel, the prophet dreams of hagiarchies where moral law replaces political ambition.","zh":"在小说中，先知梦见一种“圣人政体”，在那里道德律取代政治野心。"}]}],"synonyms":["theocracy","clerical rule","hierocracy","rule by saints"],"phonetic":"/ˈhæɡiˌɑrki/","extraExplanation":["词源提示：hagiarchy 来自希腊语 hagios（“圣的、神圣的”）+ -archy（“统治、政体”）。","用法提醒：这是非常少见、偏学术或文学的词，多用于历史/宗教政治讨论或讽喻式写作；日常英语更常说 “rule by religious leaders” 或 “theocracy（神权政治）”。"]}
{"word":"hagiarchy","summary":{"en":"Hagiarchy means rule or government by saints or holy religious figures.","zh":"Hagiarchy 指由圣徒、圣人或宗教权威人物进行统治的政体或统治方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"government or rule by saints, holy people, or religious authorities (often used in a historical or critical tone).","zh":"由圣徒、圣人或宗教权威统治的政体／统治（常用于历史讨论或带批评色彩的语境）。"},"examples":[{"en":"Some critics described the early community as a kind of hagiarchy led by revered monks.","zh":"一些批评者把那个早期社群形容为一种由受崇敬的僧侣领导的“圣人统治”。"},{"en":"The novel imagines a future hagiarchy in which spiritual leaders control law and education.","zh":"这部小说想象了一个未来的“圣人统治”社会：精神领袖掌控法律与教育。"}]}],"synonyms":["theocracy","clerocracy","hierocracy"],"phonetic":"/ˌhæɡiˈɑrki/","extraExplanation":["词源提示：hagi- 来自希腊语 *hagios*（“圣的、圣人”），-archy 来自 *arkhein*（“统治”）。因此字面意思就是“由圣者统治”。","使用场景：该词非常罕见，多见于宗教学、历史写作或批评性论述中，用来强调“宗教人物掌权”的特征，有时带有讽刺或质疑的语气。"]}
{"word":"hagigah","summary":{"en":"Hagigah refers to a Jewish festival offering in ancient Temple times, and it is also the name of a Talmudic tractate about pilgrimage festivals.","zh":"Hagigah 指古代犹太教在圣殿时期的节期献祭，也可指塔木德中讨论朝圣节期的一卷《Hagigah》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) A festive sacrificial offering brought to the Temple in Jerusalem on major pilgrimage festivals (especially Passover, Shavuot, and Sukkot).","zh":"（犹太教）在耶路撒冷圣殿于重要朝圣节期（尤指逾越节、七七节、住棚节）献上的节期祭（节日献祭）。"},"examples":[{"en":"In ancient times, some pilgrims brought a hagigah offering when they traveled to Jerusalem for the festival.","zh":"在古代，一些朝圣者在节期前往耶路撒冷时会带上 hagigah（节期祭）作为献祭。"},{"en":"The text mentions rules about the hagigah, such as who must bring it and when.","zh":"这段文字提到关于 hagigah 的规定，例如哪些人需要献祭以及应在何时献祭。"}]},{"partOfSpeech":"n.","definition":{"en":"Hagigah: a tractate (section) of the Mishnah and Talmud that discusses pilgrimage festivals and related laws.","zh":"《Hagigah》：密西拿与塔木德中的一卷（论题），讨论朝圣节期及其相关律法。"},"examples":[{"en":"We studied Hagigah to understand traditions connected to pilgrimage festivals.","zh":"我们学习《Hagigah》来理解与朝圣节期有关的传统。"},{"en":"In Hagigah, the rabbis debate how certain festival obligations should be practiced.","zh":"在《Hagigah》中，拉比们辩论某些节期义务应如何实行。"}]}],"synonyms":["festival offering","pilgrimage offering","Tractate Hagigah"],"phonetic":"/hɑˈɡiɡə/","extraExplanation":["“Hagigah”常见的英语拼写也有“Chagigah / Ḥagigah”。它来自希伯来语“חֲגִיגָה (ḥagigah)”，与“节日/节期（ḥag）”同源，因此核心含义与“节庆、节期献祭”有关。","在现代日常英语里，这个词多出现在宗教学、犹太研究或学术语境中；如果只是想表达“庆祝/庆典”，更常用的是“celebration”“festival”。"]}
{"word":"hagio","summary":{"en":"“hagio-” is a Greek-based word part meaning “holy” or “saint,” used in terms like “hagiography.”","zh":"“hagio-”是源自希腊语的构词成分，表示“神圣的/圣徒的”，常见于如“hagiography”等词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “holy” or “saint,” used in words related to saints, holiness, or sacred things (from Greek).","zh":"构词成分，表示“神圣的 / 圣徒的”，用于与圣人、圣洁或宗教神圣事物相关的词（源自希腊语）。"},"examples":[{"en":"The word “hagiography” originally meant writing about saints’ lives.","zh":"“hagiography（圣徒传记）”最初指书写圣徒生平。"},{"en":"In academic writing, “hagiographic” can mean overly admiring, as if someone is a saint.","zh":"在学术写作中，“hagiographic”可指过度吹捧，好像把某人当圣人一样。"}]}],"synonyms":["holy-","saint-","sacred-"],"phonetic":"/ˈhæɡioʊ/","extraExplanation":["“hagio-”来自希腊语 hágios（意为“圣的、神圣的”）。它常见于较正式或学术词汇中，比如：hagiography（圣徒传/对人物的过度美化描写）、hagiographic（带有圣徒式颂扬的）。","注意：单独写成“hagio”在日常英语里不太常用；更多时候它作为词的前半部分出现。如果你是在某个句子里看到它，我也可以帮你判断具体含义。"]}
{"word":"hagiocracies","summary":{"en":"Hagiocracies are governments ruled by saints or “saintly” religious figures.","zh":"hagiocracies 指由圣人或“圣人式”宗教人物主导的统治／政体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Governments or systems of rule dominated by saints or people regarded as extremely holy (or by religious leaders treated as “saintly”).","zh":"由圣人或被视为极其圣洁的人（或被当作“圣人”般的宗教领袖）主导的统治／政体。"},"examples":[{"en":"Some critics describe certain theocratic regimes as hagiocracies, where “saintly” figures hold real power.","zh":"一些批评者把某些神权政体称为“hagiocracies”，意指被“圣人式”人物掌握实权。"},{"en":"In the novel, the revolution ends in hagiocracies that silence anyone who questions the holy leaders.","zh":"在小说中，革命最终变成由“圣人”统治的政体，任何质疑神圣领袖的人都会被压制。"}]}],"synonyms":["theocracies","clerical rule","hierocracy","priestly rule"],"phonetic":"/ˌheɪdʒiˈɑːkrəsiz/","extraExplanation":["这个词比较罕见，多见于学术或评论性写作，用来强调一种“以圣洁/圣徒权威为核心”的统治方式，有时带批判或讽刺语气。","词源上可拆成 hagio-（圣的、神圣的，来自希腊语）+ -cracy（统治、政体）。单数是 hagiocracy，复数是 hagiocracies。"]}
{"word":"hagiocracy","summary":{"en":"Hagiocracy means a form of rule or government dominated by saints or people revered as holy.","zh":"hagiocracy 指由圣徒或被奉为圣者的宗教人物主导的统治/政体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Government or rule by saints or religiously revered holy people; a political system dominated by people regarded as saints.","zh":"圣人统治；由被奉为圣徒/圣者的宗教人物所主导的统治或政治体系。"},"examples":[{"en":"The writer criticized the movement for aiming at a hagiocracy rather than a pluralistic democracy.","zh":"作家批评该运动追求的是“圣人统治”，而不是多元民主。"},{"en":"In the novel, the city’s laws were set by a council of holy figures, creating a kind of hagiocracy.","zh":"在小说里，这座城市的法律由一群圣者制定，形成了一种类似“圣人统治”的体制。"}]}],"synonyms":["theocracy","hierocracy","clerical rule"],"phonetic":"/ˌhæɡiˈɑːkrəsi/","extraExplanation":["这是一个相当罕见、偏学术的词，常用于政治评论或历史/宗教讨论中，带有批判或讽刺意味：暗示政治权力被“道德权威/圣洁形象”垄断。","词源：hagio- 来自希腊语，意为“圣的、圣者”；-cracy 表示“统治、政体”（如 democracy, bureaucracy）。","注意区分：hagiocracy 指“圣人统治”；theocracy 指“神权政治”（以神或宗教法为最高权威，不一定由“圣徒”个人掌权）。"]}
{"word":"hagiographa","summary":{"en":"Hagiographa most commonly means the “Writings” (Ketuvim), the third section of the Hebrew Bible; more broadly it can mean sacred writings, especially writings about saints.","zh":"Hagiographa 最常指《希伯来圣经》（塔纳赫）的第三部分“圣录/著作”（Ketuvim）；更宽泛时也可指宗教圣典，尤指圣徒传记类著作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Jewish tradition) the third main section of the Hebrew Bible (the Tanakh), also called the Writings (Ketuvim).","zh":"（犹太传统中）《希伯来圣经》（塔纳赫）的第三部分，又称“圣录/著作”（Ketuvim）。"},"examples":[{"en":"In the Tanakh, the books are grouped into the Torah, the Prophets, and the Hagiographa.","zh":"在《塔纳赫》中，书卷通常分为《托拉》（律法书）、《先知书》和 Hagiographa（圣录/著作）。"},{"en":"Psalms and Proverbs are commonly listed in the Hagiographa.","zh":"《诗篇》和《箴言》通常被列入 Hagiographa（圣录/著作）。"}]},{"partOfSpeech":"n.","definition":{"en":"(broader, less common) sacred writings or religious literature, especially writings about saints.","zh":"（更宽泛、较少见）宗教圣典或宗教著作，尤指关于圣徒的记述。"},"examples":[{"en":"Medieval hagiographa often mixed history with moral teaching.","zh":"中世纪的 hagiographa 常把历史叙述与道德教化融合在一起。"}]}],"synonyms":["the Writings","Ketuvim","sacred writings","religious literature"],"phonetic":"/ˌhæɡiˈɑːɡrəfə/","extraExplanation":["Hagiographa 是拉丁化的学术用语，源自希腊语词根：hagio-（“神圣的/圣徒的”）+ -grapha（“写作/著作”）。","在英语圣经研究中，它多用来指 Ketuvim（“Writings”）。不过在一般语境里并不常用；更常见的说法是 “the Writings” 或直接用 “Ketuvim”。","注意：hagiographa 在形式上像复数（-a 结尾），因此常与复数动词搭配；但在现代学术写作中也有人把它当作集合名词使用。"]}
{"word":"hagiographal","summary":{"en":"Hagiographal means related to saints’ biographies, or (more commonly in modern criticism) overly praising and uncritical.","zh":"hagiographal 指与圣徒传相关；也常用于批评某种写法/评价过度颂扬、缺乏批判性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hagiography (writing about saints or revered religious figures).","zh":"与圣徒传（关于圣人或受尊崇的宗教人物的传记写作）有关的。"},"examples":[{"en":"The course compared historical biographies with hagiographal texts about early saints.","zh":"这门课比较了历史传记与早期圣徒的圣徒传文本。"},{"en":"Medieval libraries preserved many hagiographal stories to inspire faith.","zh":"中世纪的图书馆保存了许多圣徒传故事，用来激励信仰。"}]},{"partOfSpeech":"adj.","definition":{"en":"Overly admiring and uncritical; praising someone as if they were perfect.","zh":"（描写或评论）过度颂扬而缺乏批判性；把人写得近乎完美。"},"examples":[{"en":"The review felt hagiographal, ignoring the leader’s mistakes.","zh":"那篇评论显得过度颂扬，完全忽略了这位领导的错误。"},{"en":"She wanted a balanced portrait, not a hagiographal tribute.","zh":"她想要的是一幅平衡的画像，而不是歌功颂德式的致敬。"}]}],"synonyms":["hagiographical","laudatory","panegyric","uncritical","idolizing"],"phonetic":"/ˌhæɡiəˈɡræfəl/","extraExplanation":["“hagiographal”来自“hagiography（圣徒传）”。词根可追溯到希腊语：hagios（神圣的、圣者）+ graphein（书写）。在现代英语里，这个词常见于学术或评论语境，尤其用来批评某些传记/报道“只歌颂、不反思”。","更常见的形式是“hagiographical”；“hagiographal”较少见，但意思基本相同。"]}
{"word":"hagiographer","summary":{"en":"A hagiographer writes saints’ lives or an overly admiring, often uncritical biography.","zh":"hagiographer 指写圣徒传记的人，也可指对人物过度赞美、缺乏批判性的传记作者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes a biography of a saint; more broadly, someone who writes highly praising (often uncritical) biographies or descriptions of a person.","zh":"圣徒传记作者；也可泛指对某人进行高度赞美（往往缺乏批判性）的传记作者或吹捧者。"},"examples":[{"en":"In the Middle Ages, a hagiographer might record miracles and virtues to inspire faith.","zh":"在中世纪，圣徒传记作者可能会记录奇迹与美德来激发信仰。"},{"en":"Some critics say the film is more hagiographer than historian because it ignores the leader’s failures.","zh":"一些评论家说这部电影更像“吹捧式传记作者”而非历史学家，因为它忽略了那位领袖的失败。"}]}],"synonyms":["biographer","panegyrist","admirer"],"phonetic":"/ˌhæɡiˈɑɡrəfɚ/","extraExplanation":["词源：来自希腊语 *hagios*（圣者）+ *graphein*（书写）。因此它最早与宗教文本相关，尤其是记述圣徒生平与事迹的作品。","语用提醒：在现代英语里，*hagiographer* 常带一点贬义或讽刺，暗示“过度美化、选择性叙述”。如果想中性表达“传记作者”，通常用 *biographer*。","相关词：*hagiography*（n. 圣徒传记；对人物的过度颂扬式描写）。在学术写作中常见搭配：*a hagiographic account*（过度颂扬的叙述）。"]}
{"word":"hagiographers","summary":{"en":"Hagiographers are writers of saintly biographies, and more broadly, people who portray someone in an overly praising, uncritical way.","zh":"hagiographers 指撰写圣徒传的人；也可泛指以过度颂扬、缺乏批判的方式塑造人物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who write hagiographies—biographies that praise saints or other admired religious figures (often in a very idealized way).","zh":"圣徒传（或圣人传）作者；为圣徒或受敬仰的宗教人物撰写带有强烈颂扬、常较理想化的传记的人。"},"examples":[{"en":"Medieval hagiographers often described miracles to show a saint’s holiness.","zh":"中世纪的圣徒传作者常用描写奇迹来表现圣徒的神圣。"},{"en":"Some historians criticize early hagiographers for focusing more on praise than on facts.","zh":"一些历史学者批评早期的圣徒传作者更重颂扬而非事实。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) Writers or supporters who present a person’s life in an overly admiring, uncritical way.","zh":"（引申）对某人的生平进行过度赞美、缺乏批判的写作者或拥护者；“吹捧式传记作者”。"},"examples":[{"en":"The article reads like it was written by hagiographers, not reporters.","zh":"这篇文章读起来像是出自吹捧者之手，而不是记者。"},{"en":"Her hagiographers ignore her mistakes and highlight only her successes.","zh":"她的吹捧式传记作者对她的错误避而不谈，只强调成功。"}]}],"synonyms":["biographers (of saints)","panegyrists","admirers","eulogists","uncritical supporters"],"phonetic":"/ˌhæɡiˈɑɡrəfərz/","extraExplanation":["“hagiographer”来自希腊语词根：hagios（圣的）+ -graph-（书写）。因此它最初指写“圣徒传”的人。现代英语里常用作带批评意味的比喻：指把人物写得过于完美、几乎像“圣人”一样的写法。"]}
{"word":"hagiographic","summary":{"en":"“Hagiographic” usually means unrealistically, uncritically praising someone as if they were a saint; it can also mean relating to saints’ biographies.","zh":"hagiographic 通常指把某人不切实际地“神化/圣人化”、缺乏批判地歌颂；也可指与圣徒传记相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overly praising someone or something in a way that treats them as perfect or saint-like, often ignoring faults.","zh":"（对某人或某事）过度颂扬、把对方写得像圣人一样，往往忽略缺点。"},"examples":[{"en":"The biography was criticized for being hagiographic and leaving out the politician’s scandals.","zh":"这本传记被批评过于“圣人化”，把那位政治人物的丑闻都略过了。"},{"en":"Her article took a hagiographic tone, portraying the CEO as a flawless visionary.","zh":"她的文章语气很“神化”，把那位CEO塑造成毫无瑕疵的远见者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the writing or study of saints’ lives (hagiography).","zh":"与圣徒传记（hagiography，圣徒生平记述）相关的。"},"examples":[{"en":"He studies hagiographic texts from the Middle Ages.","zh":"他研究中世纪的圣徒传记类文本。"},{"en":"The library has a collection of hagiographic manuscripts.","zh":"这家图书馆收藏了一批圣徒传记手稿。"}]}],"synonyms":["overly flattering","uncritical","idolizing","laudatory","panegyrical"],"phonetic":"/ˌhæɡiəˈɡræfɪk/","extraExplanation":["词源提示：hagiographic 来自希腊语 hágios（“圣洁的、圣人”）+ -graphy（“书写、记录”）。因此它既可指“写圣徒传记的”，也常被引申为“把人写得像圣人一样完美”的批评用语。","语用提醒：在新闻评论、人物传记、影评中，hagiographic 往往带负面意味，暗示“缺乏批判性/不够客观”。与之相近的表达有 overly flattering（过分吹捧）、uncritical（不加批判的）、whitewashing（洗白）。"]}
{"word":"hagiographical","summary":{"en":"Hagiographical means (1) overly praising someone like a saint, or (2) relating to writings about saints’ lives.","zh":"hagiographical 可指（1）对某人过度颂扬、像写圣人一样；或（2）与圣徒传（圣徒生平的写作/研究）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Praising someone in an overly admiring way, as if they were a saint; not critical.","zh":"（对某人）过度赞美的，像写圣徒传一样的；缺乏批判性的。"},"examples":[{"en":"The biography was criticized for being too hagiographical and ignoring his mistakes.","zh":"这本传记被批评过于“圣徒式”歌颂，忽视了他的错误。"},{"en":"Her hagiographical account made the leader seem perfect.","zh":"她那种过度颂扬的叙述把这位领袖写得完美无缺。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the writing or study of saints’ lives (hagiography).","zh":"与圣徒传（圣徒生平的写作或研究）有关的。"},"examples":[{"en":"The researcher analyzed hagiographical texts from the Middle Ages.","zh":"研究者分析了中世纪的圣徒传文本。"},{"en":"Hagiographical literature often highlights miracles and moral lessons.","zh":"圣徒传文学常常强调奇迹和道德教训。"}]}],"synonyms":["overly admiring","uncritical","eulogistic","panegyric","saint-like (in tone)"],"phonetic":"/ˌhæɡiəˈɡræfɪkəl/","extraExplanation":["词源来自希腊语：hagio-（圣的）+ -graphy（书写）。在现代英语里，它既可用于宗教语境（圣徒传文本），也常用于批评某些传记、报道或评论“过度吹捧、缺少客观性”。","语气提示：说某作品是 hagiographical 往往带有负面或警惕意味，暗示作者在“造神”。如果只想表达“很赞赏”但不带批评，可用 admiring / appreciative。"]}
{"word":"hagiographies","summary":{"en":"Hagiographies are writings about saints’ lives, and more generally any overly admiring, idealized biographies.","zh":"hagiographies 指圣徒生平的传记，也可泛指对人物过度美化、近乎歌颂的传记或描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Biographies or writings that describe the lives of saints, usually emphasizing their holiness and miracles.","zh":"（圣徒）传记；圣人行传，通常强调其圣洁与奇迹。"},"examples":[{"en":"Medieval monasteries copied hagiographies to teach religious ideals.","zh":"中世纪的修道院抄写圣徒传记来传播宗教理想。"},{"en":"The course compares hagiographies with ordinary historical biographies.","zh":"这门课比较圣徒传记与一般历史传记的写法。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) Very admiring, idealized biographies or stories that present someone as almost flawless.","zh":"（引申）过度颂扬的传记/描写，把某人写得近乎完美无瑕。"},"examples":[{"en":"Some critics say the book reads like hagiographies rather than serious history.","zh":"一些评论家认为这本书读起来更像颂圣式传记，而不是严肃的历史。"},{"en":"The article avoided hagiographies and included the leader’s mistakes.","zh":"那篇文章避免一味歌颂，也写到了这位领袖的失误。"}]}],"synonyms":["saints' lives","vitae","biographies","panegyrics","eulogies"],"phonetic":"/ˌhæɡiˈɑɡrəfiz/","extraExplanation":["词源来自希腊语 *hagios*（“圣的”）+ *-graphy*（“写作/记录”）。因此 *hagiography* 原义就是“记录圣徒生平的写作”，后来才引申为“把人写得过于完美的传记/报道”。","在学术或新闻语境中，说某作品“is hagiography / reads like hagiography”通常带有批评意味，暗示缺乏客观性与细节的复杂度。"]}
{"word":"hagiographist","summary":{"en":"A hagiographist is someone who writes idealizing biographies of saints or revered religious figures.","zh":"hagiographist 指撰写圣徒传（往往带理想化、颂扬色彩）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes hagiographies (biographies of saints or highly admired religious figures), usually emphasizing holiness and virtue.","zh":"撰写“圣徒传/圣传文学”（hagiography）的人；通常会强调圣洁与美德的传记作者。"},"examples":[{"en":"The hagiographist described the saint’s life as a model of humility and charity.","zh":"这位圣传作者把这位圣徒的一生写成谦卑与慈善的典范。"},{"en":"Medieval monasteries often kept records that later hagiographists turned into popular saints’ lives.","zh":"中世纪的修道院常保存记录，后来被圣传作者改写成广为流传的圣徒传记。"},{"en":"Some critics argue the hagiographist left out the leader’s flaws to protect his reputation.","zh":"一些评论者认为这位圣传作者为了维护那位领袖的名声，刻意略去了他的缺点。"}]}],"synonyms":["hagiographer","biographer","chronicler"],"phonetic":"/ˌhæɡiˈɑɡɹəfɪst/","extraExplanation":["词源：来自希腊语 *hagios*（圣的）+ *graphein*（写作）。因此它字面意思就是“写圣者的人”。","用法提示：*hagiographist* 比 *biographer* 更带有“颂扬、理想化”的倾向，常见于宗教史、文学研究或批评语境。","相关区分：*hagiography* 指“圣徒传/歌功颂德式传记（作品或写作风格）”，*hagiographist* 指“写这种作品的人”。"]}
{"word":"hagiography","summary":{"en":"Hagiography is a type of biography or writing that praises someone excessively, often downplaying their flaws.","zh":"Hagiography 指对人物过度颂扬的传记或写作，常常淡化其缺点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A biography that praises its subject in an almost saint-like way, often ignoring faults or problems.","zh":"对某人的传记式颂扬，把对象写得近乎圣人般完美，常常淡化或忽略缺点与争议。"},"examples":[{"en":"The film felt more like hagiography than a balanced biography—it barely mentioned her mistakes.","zh":"这部电影更像是颂圣式传记，而不是客观传记——几乎没提到她的错误。"},{"en":"Critics accused the book of being hagiography because it avoided any serious discussion of his failures.","zh":"评论家指责这本书是“颂圣式传记”，因为它回避了对他失败的严肃讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"Writing or speech that praises a person too strongly, as if they are a saint.","zh":"过度吹捧某人的写作或言论，仿佛把对方当成圣人。"},"examples":[{"en":"The article turned into pure hagiography, calling the CEO a genius without offering evidence.","zh":"那篇文章变成了纯粹的吹捧，把CEO称为天才，却没有提供证据。"},{"en":"We need honest criticism, not hagiography.","zh":"我们需要诚实的批评，而不是一味的歌功颂德。"}]}],"synonyms":["panegyric","glorification","whitewashing"],"phonetic":"/ˌhæɡiˈɑɡrəfi/","extraExplanation":["词源上来自希腊语：hagios（“圣徒”）+ -graphy（“书写/记述”）。最初指“圣徒传”（例如中世纪基督教传统里记录圣徒生平与奇迹的文本）。","现代英语里常带有批评意味：说某作品是 hagiography，通常暗示它“过度美化、缺乏批判性”。","常见搭配：a hagiography of + 人物；verge on/descend into hagiography（“几乎/沦为吹捧”）。"]}
{"word":"hagiolater","summary":{"en":"A hagiolater is someone who worships or excessively venerates saints.","zh":"hagiolater 指崇拜或过度敬仰圣徒的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships or excessively reveres saints (especially in a religious context)","zh":"圣徒崇拜者；对圣徒进行崇拜或过度敬仰的人（多用于宗教语境）"},"examples":[{"en":"Some reformers criticized hagiolaters for treating saints as if they had divine power.","zh":"一些宗教改革者批评圣徒崇拜者，把圣徒当作拥有神力一般。"},{"en":"He was accused of being a hagiolater because he prayed to many saints for help.","zh":"他被指责为圣徒崇拜者，因为他向许多圣徒祈求帮助。"}]}],"synonyms":["saint-worshipper","venerator of saints"],"phonetic":"/ˈhædʒiəˌleɪtər/","extraExplanation":["这个词比较罕见，常见相关词是 hagiolatry（圣徒崇拜）。词根来自希腊语：hagios（“神圣的、圣徒”）+ latreia/latreuein（“崇拜、敬拜”）。在英语里通常带有批评或争议色彩，尤其出现在宗教辩论、历史或神学写作中。"]}
{"word":"hagiolatrous","summary":{"en":"Hagiolatrous means excessively worshipful or overly reverent, especially toward saints or a person treated like a saint.","zh":"hagiolatrous 指“过度崇拜/过度敬仰”，尤其是对圣徒或被当作圣人般神化的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing excessive admiration or worship toward saints, holy figures, or (more generally) treating someone as perfectly holy and beyond criticism","zh":"对圣徒、圣人等表现出过度崇拜；（更广义）把某人神化到不容批评的地步"},"examples":[{"en":"The biography was criticized for being hagiolatrous, praising the leader while ignoring his mistakes.","zh":"这本传记被批评为“神化式”的写法，只夸赞那位领袖，却忽略了他的错误。"},{"en":"Her hagiolatrous tone made the article feel more like worship than journalism.","zh":"她那种过度崇拜的语气让文章更像在膜拜，而不是新闻报道。"}]}],"synonyms":["idolizing","overly reverent","hagiographic","adulatory"],"phonetic":"/ˌhædʒiˈlɑːtrəs/","extraExplanation":["词源提示：hagio- 来自希腊语，意思是“圣的、神圣的”（如 hagiography“圣徒传记”）；-latry/-latrous 与“崇拜、礼拜”有关（类似 idolatry“偶像崇拜”）。因此 hagiolatrous 直译可理解为“对圣者的崇拜”。","使用场景：这个词偏正式、学术或批评语境，常用于评价写作/叙述“过度颂扬、把人写得完美无缺”。与 hagiographic（把人写得像圣人一样的）语气很接近。"]}
{"word":"hagiolatry","summary":{"en":"Hagiolatry means the worship of saints, often implying excessive or inappropriate devotion.","zh":"hagiolatry 指对圣徒的崇拜，常含“过度或不当虔敬”的批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The worship of saints (especially in a way that treats them almost like gods).","zh":"对圣徒的崇拜（尤其指把圣徒近乎当作神来敬拜的做法）。"},"examples":[{"en":"Some critics argued that the church’s traditions slipped into hagiolatry.","zh":"一些批评者认为教会的传统逐渐滑向了对圣徒的崇拜。"},{"en":"In certain debates, people use the word “hagiolatry” to warn against excessive devotion to saints.","zh":"在一些争论中，人们用“hagiolatry”来提醒不要对圣徒过度虔敬。"}]}],"synonyms":["saint-worship"],"phonetic":"/ˌhædʒiˈɑːlətri/","extraExplanation":["词源：来自希腊语 *hagios*（“神圣的、圣徒”）+ *latreia*（“敬拜、崇拜”）。所以它字面意思就是“对圣者的崇拜”。","语境与语气：这是一个偏学术/宗教讨论用词，常带批评意味，强调“崇敬（veneration）”与“敬拜（worship）”之间的界限。在基督教语境中，许多传统认为“只应敬拜上帝”，而对圣徒只能“尊崇/敬礼”，因此这个词常出现在争论或批判文本中。","相关词：*hagiography* 指“圣徒传/圣人传”（也可引申为对某人的过度颂扬的传记写法），与 *hagiolatry* 都含 *hagio-* 前缀，但一个偏“写/记述”，一个偏“崇拜”。"]}
{"word":"hagiolith","summary":{"en":"Hagiolith means a sacred/holy stone associated with religious veneration or a saint (rare usage).","zh":"hagiolith 指“圣石/圣物之石”，与宗教敬礼或圣徒相关（用法罕见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sacred or “holy” stone, especially one connected with a saint or used in religious veneration (a rare word).","zh":"圣石；圣物之石（较罕见的词），尤指与圣徒有关或用于宗教敬礼的石头。"},"examples":[{"en":"In the old chapel, locals spoke of a hagiolith that pilgrims once touched for blessings.","zh":"在那座古老的小教堂里，当地人说曾有一块“圣石”，朝圣者会触摸它以求祝福。"},{"en":"The museum label described the carved slab as a hagiolith linked to a local saint’s legend.","zh":"博物馆的说明牌把那块雕刻石板描述为与本地圣徒传说有关的“圣石”。"}]}],"synonyms":["sacred stone","holy stone","relic stone"],"phonetic":"/ˈhæɡiəˌlɪθ/","extraExplanation":["这个词来自希腊语词根：hagio-（神圣的、圣徒的）+ -lith（石头）。在现代英语里非常少见，更常见的表达是 sacred stone（圣石）、holy stone（圣石）或 relic（圣物）。","在基督教文化语境中，它有时可指与圣徒遗迹、传说地点或礼拜实践相关的石头（例如刻有圣像、被认为具有纪念或祝福意义的石块）。具体含义会因文本与地区传统而不同。"]}
{"word":"hagiologic","summary":{"en":"Hagiologic means “related to hagiology,” the study or writings about saints and holy people.","zh":"hagiologic 指“与圣徒研究/圣徒传记学有关”，通常用于较学术、中性的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hagiology: the study, writing, or collection of stories about saints and holy people (often focusing on their lives, miracles, and virtues).","zh":"与“圣徒传记学/圣徒研究”（hagiology）有关：研究、撰写或收集有关圣徒与圣洁人物的故事（常强调其生平、奇迹与德行）。"},"examples":[{"en":"She wrote a hagiologic essay about early Christian martyrs.","zh":"她写了一篇关于早期基督教殉道者的圣徒研究类文章。"},{"en":"The library has many hagiologic texts describing saints’ lives.","zh":"这座图书馆藏有许多记述圣徒生平的圣徒传记类文献。"}]}],"synonyms":["hagiological","hagiographic"],"phonetic":"/ˌhæɡiəˈlɑːdʒɪk/","extraExplanation":["词源小提示：hagio- 来自希腊语，意思是“神圣的、圣徒的”；-log- 与“学说/研究”（如 biology 生物学）相关。整体可理解为“关于圣徒研究/圣徒传记的”。","容易混淆：hagiographic 更常见，既可指“与圣徒传记有关”，也常带批评意味，指“过度颂扬、把人写得完美无缺的传记式吹捧”。hagiologic 通常更中性、更学术。"]}
{"word":"hagiological","summary":{"en":"Hagiological means related to saints or writings about saints, and it can also describe overly idealized praise that treats someone like a saint.","zh":"hagiological 指“与圣徒/圣徒传记相关的”；也可指“把人过度美化、像写圣人一样歌颂”的（常带批评意味）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hagiology (the study of saints) or to writings about saints’ lives and miracles.","zh":"与圣徒学（研究圣徒的学科）有关的；或与记述圣徒生平与神迹的作品有关的。"},"examples":[{"en":"She wrote a hagiological article about Saint Francis for a religious studies journal.","zh":"她为一本文学与宗教学期刊写了一篇关于圣方济各的圣徒学相关文章。"},{"en":"The library has many hagiological texts from the Middle Ages.","zh":"这座图书馆收藏了许多中世纪的圣徒传记类文本。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often critical) Excessively praising someone, presenting them as perfect or saint-like.","zh":"（常带批评色彩）过度颂扬某人，把对方写得完美无缺、如同圣人。"},"examples":[{"en":"The biography felt hagiological, ignoring his mistakes and failures.","zh":"这本传记读起来像是在造神，完全忽略了他的错误与失败。"},{"en":"Her tone was so hagiological that it didn’t sound objective.","zh":"她的语气太过歌功颂德，听起来不够客观。"}]}],"synonyms":["hagiographic","saintly (in tone)","idealizing","overpraising"],"phonetic":"/ˌhæɡiəˈlɑːdʒɪkəl/","extraExplanation":["词源提示：hagiological 来自 hagiology（圣徒学），其词根 hagio- 源于希腊语 hagios（“神圣的/圣徒的”）。","语用提醒：在学术语境中它多为中性（指“与圣徒研究/圣徒传记相关”）；但在评论传记、报道或人物塑造时，hagiological 常含贬义，指“过度美化、缺乏批判性”。"]}
{"word":"hagiologically","summary":{"en":"“Hagiologically” means “in a saint-biography style,” often implying overly idealized praise.","zh":"“hagiologically”指“以圣徒传式的方式”，常暗示过度美化、偏颇赞美。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to hagiology (the study or writing of saints’ lives); in a manner that treats someone as a saint-like figure.","zh":"以圣徒传（圣徒生平研究或写作）的方式；用把某人写得像圣人一样的口吻。"},"examples":[{"en":"The biography describes the leader almost hagiologically, focusing only on virtues and ignoring mistakes.","zh":"这本传记几乎是用“圣徒传”的口吻来写这位领袖，只强调优点而忽略错误。"},{"en":"Some early accounts speak hagiologically about the monk, attributing miracles to him.","zh":"一些早期记载以圣徒传式的方式描写那位僧侣，把奇迹归于他。"}]}],"synonyms":["saintly","reverently","idealizingly","uncritically"],"phonetic":"/ˌhæɡiəˈlɑdʒɪkli/","extraExplanation":["“hagiologically”来自 hagiology（圣徒传、圣徒学），词根 hagio- 源自希腊语 hagios（“神圣的、圣徒的”），-logy 表示“学科/研究”。在学术写作或评论中，这个词常带一点批评意味：暗示叙述过度美化、缺乏平衡。常见搭配：hagiologically portrayed / written / treated（被以圣徒传式描写/书写/对待）。"]}
{"word":"hagiologies","summary":{"en":"Hagiologies are studies or collections of writings about saints’ lives.","zh":"Hagiologies 指对圣徒生平的研究，或圣徒传记类文献的汇编/总称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study, writing, or collection of biographies of saints and holy people","zh":"圣徒传记学；对圣徒、圣人等“圣德人物”的传记研究、撰写或汇编"},"examples":[{"en":"The professor specializes in medieval hagiologies and how they shaped popular faith.","zh":"这位教授专攻中世纪圣徒传记研究，以及它们如何塑造大众信仰。"},{"en":"In the library, she compared different hagiologies of the same saint.","zh":"在图书馆里，她对比了同一位圣徒的不同传记版本。"}]},{"partOfSpeech":"n.","definition":{"en":"saints’ lives (hagiographies) as a body of texts; hagiographical writings in general","zh":"（总称）圣徒传记作品；圣徒传记类文献"},"examples":[{"en":"These hagiologies often include miracles and moral lessons.","zh":"这类圣徒传记作品常常包含奇迹故事和道德教诲。"},{"en":"Scholars read the hagiologies not only for history but also for storytelling style.","zh":"学者阅读圣徒传记文献，不只为了历史信息，也为了分析叙事风格。"}]}],"synonyms":["hagiography (close in meaning)","saints' lives","hagiographical writings"],"phonetic":"/ˌhæɡiˈɑlədʒiz/","extraExplanation":["“hagiologies”是复数形式；单数是“hagiology”。与“hagiography（圣徒传记/圣徒传记写作）”关系很近：hagiography更常指“具体的传记文本或写作行为”，hagiology更偏向“研究/学科或文献总体”。","词源来自希腊语：hagios（圣的）+ -logy（研究、学说）。在基督教传统中，这类文本常用于敬礼、教化或塑造共同体认同，因此会出现理想化描写（这也是学术研究常讨论的重点）。"]}
{"word":"hagiologist","summary":{"en":"A hagiologist is someone who studies or writes about saints’ lives.","zh":"hagiologist 指研究或撰写圣徒生平的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, writes about, or specializes in the lives of saints (especially in Christian tradition).","zh":"圣徒传作者；圣徒学研究者（尤指基督教传统中研究或撰写圣徒生平的人）。"},"examples":[{"en":"The hagiologist spent years comparing different versions of a saint’s life story.","zh":"这位圣徒传研究者花了多年比较同一位圣徒生平故事的不同版本。"},{"en":"In the library’s religion section, you can find works by medieval hagiologists.","zh":"在图书馆的宗教区，你可以找到中世纪圣徒传作者的作品。"}]}],"synonyms":["hagiographer","saints’ biographer","religious historian"],"phonetic":"/ˌhæɡiˈɑlədʒɪst/","extraExplanation":["词源：来自希腊语 *hagios*（圣的）+ *-logist*（……学者/研究者），字面意思是“研究圣者的人”。","相关学科/名词：*hagiology* 指“圣徒学、圣徒传研究”；*hagiography* 常指“圣徒传记/圣徒传文学”。注意 *hagiography* 在现代英语里也可引申为“过度吹捧的传记/文章”（带一点批评意味），但 *hagiologist* 通常仍指较中性的研究者或作者。"]}
{"word":"hagiology","summary":{"en":"Hagiology means the study of saints or writings about saints (especially in Christianity).","zh":"hagiology 指“圣徒学”（研究基督教圣徒）或“圣徒传集”（关于圣徒的传记作品集合）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of saints—especially their lives, writings, and how they are honored (in Christianity)","zh":"圣徒学；圣徒传研究（主要研究基督教圣徒的生平、著作与崇敬方式）"},"examples":[{"en":"She wrote her dissertation in hagiology, focusing on early Christian martyrs.","zh":"她的博士论文研究圣徒学，重点关注早期基督教殉道者。"},{"en":"In the course on medieval religion, we read hagiology alongside church history.","zh":"在中世纪宗教课程中，我们把圣徒传研究与教会史一起阅读。"}]},{"partOfSpeech":"n.","definition":{"en":"a collection of writings about saints (saints’ biographies or “saints’ lives”)","zh":"圣徒传集；关于圣徒的传记作品集合"},"examples":[{"en":"The monastery library preserved a hagiology of local saints.","zh":"修道院图书馆保存着一部本地圣徒的圣徒传集。"},{"en":"His translation included several texts from a Latin hagiology.","zh":"他的译本收录了若干篇出自拉丁文圣徒传集的文本。"}]}],"synonyms":["study of saints","saints' lives (as a genre)","hagiography (related term)"],"phonetic":"/ˌhæɡiˈɑlədʒi/","extraExplanation":["词源：来自希腊语 *hagios*（圣的、神圣的）+ *-logy*（学科、研究）。因此它字面意思就是“关于圣者的研究”。","用法提示：在学术语境中，*hagiology* 通常指“研究圣徒的学科”；在文献学/书目学语境中，也可指“圣徒传记作品的集合”。注意不要和 *agiology* 混淆（后者更常指“血管学”，即对血管的研究）。","风格与语气：*hagiographic*（形容词）有时带一点批评意味，指“把人物写得过分神化、只赞不批”。例如：*a hagiographic biography*（过度颂扬式传记）。"]}
{"word":"hagiophobia","summary":{"en":"Hagiophobia means an intense fear of holy or sacred things.","zh":"hagiophobia 指对神圣或宗教圣物的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of holy things or sacred objects (such as saints, religious symbols, or places), sometimes linked to anxiety about religion or spirituality","zh":"对神圣事物或宗教圣物（如圣人、宗教符号、圣地等）的强烈恐惧；有时与对宗教或灵性相关的焦虑有关"},"examples":[{"en":"After a traumatic experience in a strict religious setting, he developed hagiophobia and avoided churches.","zh":"在严格宗教环境中的一次创伤经历后，他产生了“恐惧神圣事物症”，开始回避教堂。"},{"en":"Her hagiophobia made her feel uneasy around statues of saints and religious icons.","zh":"她对神圣事物的恐惧让她在圣人雕像和宗教圣像旁感到不安。"}]}],"synonyms":["fear of holy things","fear of religious symbols","religious phobia (broader)"],"phonetic":"/ˌhæɡiəˈfoʊbiə/","extraExplanation":["词源上可拆成 hagio-（“神圣的、圣人”，源自希腊语）+ -phobia（“恐惧”）。在日常英语里较少见，更常见的表达是 “fear of religious symbols/holy things”。","注意区分：它不是“害怕宗教”本身（那更接近 general fear of religion），而是对“神圣/圣物”这一类事物产生恐惧或强烈不适。若涉及心理健康情境，英文里也常用更通俗的描述来表达。"]}
{"word":"hagioscope","summary":{"en":"A hagioscope is a small church opening that allows a view of the altar (also called a squint).","zh":"hagioscope 指教堂墙上的小窥窗/斜孔，用来从侧面看见祭坛（也叫 squint）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small opening (often slanted) in a church wall that lets someone see the altar from a side chapel or another area; also called a “squint.”","zh":"（教堂墙上的）斜开小孔/窥窗，使人在侧礼拜堂或其他区域也能看见祭坛；也叫“squint（祭坛窥窗）”。"},"examples":[{"en":"Through the hagioscope, worshippers in the side chapel could watch the priest at the altar.","zh":"透过hagioscope（祭坛窥窗），侧礼拜堂的礼拜者也能看见祭坛前的司祭。"},{"en":"The guide pointed out a medieval hagioscope cut into the stone wall.","zh":"导游指出石墙上凿出的中世纪hagioscope（祭坛窥窗）。"}]}],"synonyms":["squint","church squint","altar squint"],"phonetic":"ˈhæɡiəˌskoʊp","extraExplanation":["词源上可分解为希腊语 hagio-（“圣的”）+ -scope（“观看的工具/装置”）。它常见于中世纪欧洲教堂建筑中，用于在视线受阻的情况下仍能“看见圣坛/圣礼”。","在英国教堂建筑语境里更常用的通俗说法是 squint。部分地区还会把类似的开口与“leper window（麻风病人窗）”混称，但严格来说两者用途与历史背景不一定相同。"]}
{"word":"hagioscopic","summary":{"en":"Relating to a church ‘squint’: a small opening that allows a view of the altar.","zh":"与教堂“窥窗”有关：让人能看到祭坛的小开口/小窗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A small opening (usually in a church wall) that lets someone see the altar from another room or from outside, often so a person who could not enter could still watch the service.","zh":"（常见于教堂墙壁上的）窥视孔/小窗口，使人在另一个房间或室外也能看见祭坛，通常用于让不能进入的人仍可观看礼拜。"},"examples":[{"en":"The guide pointed out a hagioscopic window that gave a clear view of the altar.","zh":"导游指着一个 hagioscopic 小窗，说从那里能清楚看到祭坛。"},{"en":"In some medieval churches, a hagioscopic opening allowed people in a side chapel to follow the Mass.","zh":"在一些中世纪教堂里，hagioscopic 开口让侧礼拜堂里的人也能跟随弥撒。"}]}],"synonyms":["squint (church window)","squint window","sacring bell opening (related, not exact)"],"phonetic":"/ˌhæɡiəˈskɑpɪk/","extraExplanation":["这个词多用于建筑史/教会建筑语境，常见搭配是“hagioscopic window/opening”。它与常说的“squint”有关：在英国教堂建筑里，这种让人“斜眼偷看”祭坛的小窗也常被称为“squint（教堂窥窗）”。词源可拆为希腊语 *hagios*（神圣的、圣徒的）+ *skopein*（观看），字面意思接近“观看神圣之物的（孔/窗）”。"]}
{"word":"haglet","summary":{"en":"“Haglet” is a rare noun meaning a small/young hag—often used in fairy-tale or fantasy contexts, and can sound insulting if aimed at a real person.","zh":"“Haglet”是个罕见名词，指“小/年轻的女巫或丑老太婆”，多见于童话奇幻语境；若用来指真人，容易显得冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A small or young hag; a little witch-like old woman (usually insulting or playful in tone).","zh":"（罕见）小女巫；小老太婆般的“丑婆子”（多为侮辱或半开玩笑的说法）。"},"examples":[{"en":"The story describes a haglet living in a hut at the edge of the woods.","zh":"故事描写了一位住在森林边小屋里的“小女巫”。"},{"en":"He muttered that the rude haglet had stolen his apples.","zh":"他嘟囔着说那个无礼的“小老太婆”偷了他的苹果。"}]}],"synonyms":["crone","hag","witch","old woman (derog.)"],"phonetic":"/ˈhæɡlət/","extraExplanation":["“haglet”是由“hag（女巫；丑老太婆）+ -let（表示‘小的/年轻的’的后缀）”构成的缩小词，整体语感更偏文学化、民间传说风，现代英语里很少见。","因为“hag”本身常带强烈贬义，使用“haglet”称呼真实的人容易显得刻薄；更常见的用法是在童话、奇幻作品里指“年轻的小巫婆/小妖婆”。"]}
{"word":"haglike","summary":{"en":"“Haglike” means looking like a hag—old, ugly, frightening, or witchlike.","zh":"“Haglike”指“像老巫婆一样的”，形容外表又老又丑、吓人或带有巫婆般气质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling a hag (an old, ugly, frightening woman in folklore); harsh-looking, witchlike, or worn and unattractive (often describing a face or appearance).","zh":"像“老巫婆/老妖婆”的；（外表、面容）又老又难看、令人害怕的；带有巫婆般气质的。"},"examples":[{"en":"In the dim light, her haglike silhouette frightened the children.","zh":"在昏暗的光线里，她那巫婆般的剪影把孩子们吓到了。"},{"en":"The makeup gave the actor a haglike face for the horror scene.","zh":"化妆让那位演员在恐怖场景里有了一张老巫婆般的脸。"},{"en":"After weeks without sleep, he looked pale and haglike.","zh":"连续几周没睡好后，他看起来苍白憔悴，像个老妖怪。"}]}],"synonyms":["witchlike","crone-like","haggard","gaunt","ghoulish"],"phonetic":"/ˈhæɡlaɪk/","extraExplanation":["“haglike”由 hag（常指民间传说中的“老巫婆/丑陋的老太婆”）+ -like（“像……一样”）构成。这个词带有明显贬义，形容人时容易冒犯；写作或描写角色气氛时更常见。"]}
{"word":"haglin","summary":{"en":"“Haglin” is usually a nonstandard spelling for “haggling,” meaning bargaining over a price; the standard verb is “haggle.”","zh":"“haglin”通常是“haggling”的非标准拼写，意思是为价格讨价还价；标准动词是“haggle”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An uncommon or nonstandard spelling that usually refers to “haggling” (bargaining over a price).","zh":"一种不常见/非标准拼写，通常指“haggling”（为价格讨价还价）。"},"examples":[{"en":"In some informal writing, “haglin” is used to mean “haggling,” but “haggling” is the standard spelling.","zh":"在一些非正式写法里，“haglin”会被用来表示“haggling”，但标准拼写是“haggling”。"},{"en":"They were haggling over the cost of the used bike.","zh":"他们在为二手自行车的价格讨价还价。"}]},{"partOfSpeech":"v.","definition":{"en":"To bargain or argue about the price or terms of a deal.","zh":"（为交易的价格或条件）讨价还价；争论不休。"},"examples":[{"en":"I don’t like to haggle, so I shop at stores with fixed prices.","zh":"我不喜欢讨价还价，所以我会去明码标价的商店购物。"},{"en":"We haggled for ten minutes and finally agreed on $50.","zh":"我们讨价还价了十分钟，最后以50美元成交。"},{"en":"The landlord and tenant haggled over the move-in date.","zh":"房东和租客就入住日期争论/协商了很久。"}]},{"partOfSpeech":"n.","definition":{"en":"A bargaining discussion or argument about price or terms.","zh":"讨价还价的过程；就价格/条件的争执。"},"examples":[{"en":"After a brief haggle, she got a small discount.","zh":"经过一番简短的讨价还价，她拿到了小折扣。"}]}],"synonyms":["bargain","negotiate","quibble (over)","wrangle (over)"],"phonetic":"/ˈhæɡ(ə)l/","extraExplanation":["“haglin”本身不是常见的标准英文单词；更常见的是拼作 “haggling”（haggle 的现在分词/动名词）。如果你是在聊天、歌词或方言/口语拼写里看到 “haglin”，多半是在表达“讨价还价”。在正式写作和考试中建议使用标准拼写：haggle / haggling。"]}
{"word":"hagmall","summary":{"en":"Hagmall is an old Scottish word meaning a rent or land-use fee paid to a landowner.","zh":"Hagmall 是苏格兰旧词，指向地主支付的地租或土地使用费用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, old-fashioned) A rent, fee, or tribute paid to a landowner—especially for the right to use land (such as grazing).","zh":"（苏格兰，旧用法）向地主支付的地租、费用或贡赋；尤指为使用土地（如放牧权）而付的款项。"},"examples":[{"en":"The tenant paid hagmall each year for the pasture.","zh":"佃户每年为那片牧场支付 hagmall。"},{"en":"In the record, hagmall is listed beside other dues and rents.","zh":"在记录中，hagmall 与其他税费和地租并列。"}]}],"synonyms":["rent","fee","due","tribute"],"phonetic":"/ˈhæɡmɔl/","extraExplanation":["这个词在现代英语里非常少见，多出现在苏格兰历史文献、地契或法律/庄园账簿里。日常交流中通常用 rent、fee、due、tribute 等更常见的词来表达。","词源与拼写在古文献中可能有变体（例如 hagmal 等），因此在阅读旧文本时要结合上下文判断其具体指“地租”还是某种“使用权费用”。"]}
{"word":"hagmane","summary":{"en":"Hogmanay is the Scottish celebration of New Year’s Eve.","zh":"Hogmanay 指苏格兰的新年前夜（跨年夜）庆祝活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Scottish celebration of New Year’s Eve (December 31), often involving parties, singing, and traditional customs.","zh":"（苏格兰）新年前夜的庆祝活动（12月31日），常伴随聚会、唱歌与传统习俗。"},"examples":[{"en":"Edinburgh is famous for its Hogmanay street party.","zh":"爱丁堡以其 Hogmanay 跨年街头派对而闻名。"},{"en":"They visited Scotland during Hogmanay to experience the New Year traditions.","zh":"他们在 Hogmanay 期间去苏格兰旅行，体验当地的新年传统。"}]}],"synonyms":["New Year’s Eve (general)"],"phonetic":"/ˌhɑɡməˈneɪ/","extraExplanation":["你输入的 “hagmane” 很可能是拼写误差；常见写法是 **Hogmanay**（首字母常大写，因为它指一个节庆名称）。","Hogmanay 在苏格兰文化里地位很高：传统活动包括唱《Auld Lang Syne》（《友谊地久天长》）、以及“first-footing”（新年后第一个进门的人带来好运，常会带小礼物如点心或饮品）。","词源并不完全确定，学者常提到可能与法语或北欧语言有关；现代英语里主要用来指苏格兰的跨年庆典。"]}
{"word":"hagmena","summary":{"en":"Hagmena is a Northern English dialect word for New Year’s Eve and its traditional celebrations, related to Scotland’s Hogmanay.","zh":"Hagmena 是英格兰北部方言里指“除夕/除夕庆祝”的词，与苏格兰 Hogmanay 相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly Northern England, especially Northumberland; dialect) New Year’s Eve, or the traditional celebration connected with it (similar to Scotland’s Hogmanay).","zh":"（主要用于英格兰北部，尤指诺森伯兰的方言）新年前夜；或与之相关的传统庆祝活动（类似苏格兰的 Hogmanay）。"},"examples":[{"en":"In some Northumberland villages, people still talk about Hagmena on December 31st.","zh":"在诺森伯兰的一些村庄里，人们到12月31日还会说“过 Hagmena”。"},{"en":"They kept the old Hagmena custom of visiting neighbors and sharing food.","zh":"他们保留了古老的 Hagmena 习俗：拜访邻居、分享食物。"}]}],"synonyms":["Hogmanay","New Year’s Eve","the New Year (dialectal context)"],"phonetic":"/ˌhɑɡməˈneɪ/","extraExplanation":["“Hagmena”常被认为是“Hogmanay”（苏格兰新年前夜庆祝）的地区变体或近亲词，主要见于英格兰北部方言中。","它多用于谈论地方传统与民俗语境：例如除夕夜走访邻里、唱歌祝福、分享点心或饮品等。","词源没有完全定论，民俗研究里常与法语或盖尔语影响联系起来；日常使用时可把它理解为“当地说法的除夕/除夕庆祝”。"]}
{"word":"hagmenay","summary":{"en":"Hogmanay is the Scottish New Year’s Eve celebration.","zh":"Hogmanay 指苏格兰的新年前夜庆祝活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hogmanay: the Scottish celebration of New Year’s Eve (December 31), often marked by parties, singing, and traditional customs.","zh":"Hogmanay：苏格兰对“新年前夜”（12月31日）的称呼与庆祝活动，常见聚会、唱歌与传统习俗。"},"examples":[{"en":"We spent Hogmanay in Edinburgh and watched the fireworks at midnight.","zh":"我们在爱丁堡过Hogmanay，午夜去看了烟花。"},{"en":"On Hogmanay, some families still sing “Auld Lang Syne” together.","zh":"在Hogmanay，一些家庭仍会一起唱《Auld Lang Syne》（《友谊地久天长》）。"}]}],"synonyms":["New Year’s Eve (Scottish)","Scottish New Year"],"phonetic":"/ˌhɑɡməˈneɪ/","extraExplanation":["你输入的“hagmenay”更常见的拼写是 **Hogmanay**（苏格兰用语）。发音和拼写在口语里容易听混。","Hogmanay 的传统习俗包括 **“first-footing”**（新年后第一个进门的人被认为会带来好运）、赠送小礼物或食物，以及在午夜合唱《Auld Lang Syne》。","这是带有浓厚地域文化色彩的词：在苏格兰，人们常说 “Happy Hogmanay!” 来祝福新年。"]}
{"word":"hagol","summary":{"en":"“hagol” is not a standard English word; it’s likely a misspelling or a name/foreign word.","zh":"“hagol”不是标准英语词；更可能是拼写错误，或人名/外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “haggle” (to bargain over a price) or “hag” (an ugly old witch/old woman, often offensive).","zh":"不是标准英语单词。很可能是“haggle”（讨价还价）或“hag”（丑老太婆/女巫，常带冒犯）的拼写错误。"},"examples":[{"en":"Did you mean “haggle” (bargain) or “hag” (an old witch—often offensive)?","zh":"你是想写“haggle”（讨价还价）还是“hag”（老女巫/丑老太婆——常带冒犯）？"},{"en":"If you can share the sentence you saw “hagol” in, I can identify the correct word.","zh":"如果你把看到“hagol”的句子发我，我可以帮你确定正确的词。"}]}],"extraExplanation":["“hagol”本身在常见英语词典里通常查不到；有时可能是打字错误（例如把 haggle 写成 hagol），也可能是人名、地名、网名或其他语言的词（比如希伯来语/阿拉伯语的转写）。把上下文句子或截图发来，我能更准确判断。"]}
{"word":"hagrid","summary":{"en":"Hagrid is best known as the name of a major character in the Harry Potter series.","zh":"Hagrid最广为人知的是《哈利·波特》中重要角色“海格”的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Rubeus Hagrid, a fictional character in the Harry Potter series: the warm-hearted Keeper of Keys and Grounds at Hogwarts (later Care of Magical Creatures professor).","zh":"（专有名词）海格（Rubeus Hagrid），《哈利·波特》系列中的虚构人物：霍格沃茨的钥匙管理员与猎场看守（后来任神奇动物保护课教授），性格善良、重情义。"},"examples":[{"en":"Hagrid helps Harry learn about the wizarding world.","zh":"海格帮助哈利了解魔法世界。"},{"en":"In the book, Hagrid introduces Harry to Diagon Alley.","zh":"在书中，海格带哈利去对角巷。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname used in fiction or as a reference to the character; in everyday English, it’s mostly recognized as the Harry Potter name.","zh":"作为姓氏在文学/流行文化中使用，或用来指代该角色；在日常英语里，人们主要把它当作《哈利·波特》里的名字来理解。"},"examples":[{"en":"My friend dressed up as Hagrid for Halloween.","zh":"我朋友万圣节扮成了海格。"},{"en":"That coat makes you look like Hagrid.","zh":"那件外套让你看起来像海格。"}]}],"phonetic":"/ˈhæɡrɪd/","extraExplanation":["“Hagrid”最常见的用法来自J.K.罗琳的《哈利·波特》系列（文学作品与后续电影改编）。在英语对话里，如果你说“like Hagrid”，通常是在借用他“体格高大、穿厚外套、外表粗犷但心地很软”的形象来做轻松的类比。"]}
{"word":"hagridden","summary":{"en":"Hagridden means deeply troubled or burdened for a long time; originally it referred to being oppressed by nightmares or a “hag” in folklore.","zh":"hagridden 指长期被忧虑/烦恼压得喘不过气；其本义来自民间传说，指被噩梦或“妖婆”折磨、像被压住一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) feeling worried, troubled, or burdened for a long time, as if something heavy is pressing on you.","zh":"（人）长期忧虑、烦恼或被重担压得喘不过气的；饱受困扰的。"},"examples":[{"en":"She looked hagridden after weeks of sleepless nights.","zh":"连续几周失眠后，她看起来忧心忡忡、疲惫不堪。"},{"en":"He was hagridden by guilt over what he had said.","zh":"他因自己说过的话而深感内疚，备受折磨。"}]},{"partOfSpeech":"adj.","definition":{"en":"(old-fashioned) oppressed by nightmares or an evil spirit (a “hag”), as in old stories and folklore.","zh":"（较旧式用法）被噩梦或“女巫/妖婆”（hag）折磨的；仿佛被邪灵压迫的（源自民间传说）。"},"examples":[{"en":"In the tale, the traveler wakes up hagridden and unable to move.","zh":"在故事里，旅人醒来时像被妖婆压住一样动弹不得。"},{"en":"The poem describes a hagridden night filled with fear.","zh":"这首诗描写了一个被噩梦纠缠、充满恐惧的夜晚。"}]}],"synonyms":["troubled","burdened","tormented","haunted","oppressed","anxious"],"phonetic":"/ˈhæɡˌrɪdən/","extraExplanation":["词源上由 hag（妖婆、女巫般的老妪）+ ridden（ride 的过去分词）构成，原意是“被妖婆骑在身上”。这与欧洲民间对“睡眠瘫痪/鬼压床”的解释有关：人醒了却动不了，感觉胸口被压住，于是想象有东西“骑”在身上。后来引申为“被焦虑、内疚、烦恼长期折磨”。","语域提示：hagridden 现在偏文学/书面、带强烈形象化色彩；日常口语更常用 stressed, anxious, burdened, haunted 等。"]}
{"word":"hagride","summary":{"en":"“Hagrid” is a character name from the Harry Potter series (Rubeus Hagrid).","zh":"“Hagrid”是《哈利·波特》系列中的角色名（鲁伯·海格）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Usually written “Hagrid”) A fictional character: Rubeus Hagrid, the half-giant gamekeeper and later Care of Magical Creatures teacher at Hogwarts in J.K. Rowling’s Harry Potter series.","zh":"（通常写作“Hagrid”）虚构人物名：鲁伯·海格（Rubeus Hagrid），J.K.罗琳《哈利·波特》系列中霍格沃茨的猎场看守，后来担任“神奇动物保护课”教师，是半巨人。"},"examples":[{"en":"Hagrid is one of Harry’s earliest and most loyal friends.","zh":"海格是哈利最早、也最忠诚的朋友之一。"},{"en":"In the story, Hagrid introduces Harry to the wizarding world.","zh":"在故事里，海格把哈利带进了魔法世界。"}]}],"synonyms":["Rubeus Hagrid","Hogwarts gamekeeper"],"phonetic":"/ˈhæɡrɪd/","extraExplanation":["“hagride”不是常见英语单词；最可能是把角色名“Hagrid”拼错了。","“Hagrid”在英语里主要作为专有名词使用（人名/角色名），不是普通词汇，因此没有像一般单词那样的多重词义。"]}
{"word":"hagrider","summary":{"en":"Hag-rider (often written with a hyphen) is a folklore term for a night spirit said to cause nightmares or sleep paralysis.","zh":"Hag-rider（常写作 hag-rider）是民间传说用语，指据说会造成噩梦或“鬼压床”的夜间精灵/恶灵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(folklore) A witch, spirit, or demon believed to “ride” a sleeping person at night, causing nightmares, breathing trouble, or sleep paralysis.","zh":"（民间传说）一种被认为会在夜里“骑”在熟睡者身上的女巫/精灵/恶魔，导致噩梦、呼吸困难或睡眠瘫痪（鬼压床）。"},"examples":[{"en":"In old stories, people blamed a hag-rider for terrifying nightmares.","zh":"在古老故事里，人们把可怕的噩梦归咎于“hag-rider”。"},{"en":"Some cultures explained sleep paralysis by saying a hag-rider sat on your chest.","zh":"在一些文化里，“鬼压床”会被解释为 hag-rider 坐在你胸口。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal) A person who is extremely unpleasant and rides (e.g., a horse or motorcycle).","zh":"（少见，非正式）指很讨厌的人，同时也“骑乘”（如骑马或骑摩托）。"},"examples":[{"en":"He called the rude biker a “hag-rider,” but it’s not common English.","zh":"他把那个无礼的摩托车骑手叫作“hag-rider”，但这并不是常见英语用法。"}]}],"synonyms":["night hag","mare (folklore)","sleep-paralysis demon"],"phonetic":"/ˈhæɡˌraɪdɚ/","extraExplanation":["“hag-rider”常与英语里的“night hag（夜魇/夜巫）”传说相关：人们用它来解释噩梦与睡眠瘫痪（胸口发闷、动不了）。在不同地区也会出现类似说法，比如把这种存在称为“mare”，并由此影响了“nightmare（噩梦）”一词的联想。","你输入的“hagrider”更常见的写法是带连字符的“hag-rider”。另外也可能是专有名词或拼写误差（如《哈利·波特》里的“Hagrid”），需要结合语境确认。"]}
{"word":"hagrides","summary":{"en":"“Hagrides” is most likely a misspelling of “Hagrid’s,” meaning “belonging to Hagrid” (from Harry Potter).","zh":"“hagrides”多半是“Hagrid’s”的误拼，表示“海格的……”（出自《哈利·波特》）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name, possessive) belonging to Hagrid; used to refer to something associated with the character Rubeus Hagrid (e.g., “Hagrid’s hut”).","zh":"（专有名词所有格）属于海格的；用于指与鲁伯·海格这个角色有关的事物（如“海格的小屋”）。"},"examples":[{"en":"We met at Hagrid’s hut near the edge of the forest.","zh":"我们在禁林边上的海格小屋见面。"},{"en":"Hagrid’s lessons often involve magical creatures.","zh":"海格的课经常会涉及神奇动物。"}]}],"synonyms":["Hagrid’s (correct form)"],"phonetic":"ˈhæɡrɪdz","extraExplanation":["“hagrides”很可能是拼写错误或少了撇号的写法，通常应写作 **Hagrid’s**（表示“海格的……”）。","**Hagrid** 是《哈利·波特》系列中的人物，全名 **Rubeus Hagrid**。英文里在专有名词后加 **’s** 表示所属关系：Hagrid → Hagrid’s。","如果你本来想查的是 **Hagrides** 作为一个真实英文单词，它在标准英语词典中并不常见；请确认是否来自某个文本、游戏或自创名词。"]}
{"word":"hagriding","summary":{"en":"Hagriding is a folklore word for a nightmare or sleep-paralysis-like experience said to be caused by a “hag” sitting on the sleeper.","zh":"hagriding 是民俗用语，指一种像睡眠瘫痪的恶梦体验，传统说法是女巫压在睡者身上所致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Folklore) A nightmare or an experience like sleep paralysis, traditionally believed to be caused by a witch (“hag”) sitting on a sleeping person’s chest.","zh":"（民俗）恶梦或类似“睡眠瘫痪”的体验；传统上认为是女巫（hag）压在熟睡者胸口导致的。"},"examples":[{"en":"He described the night as hagriding—awake but unable to move, as if something heavy pinned him down.","zh":"他形容那一夜像“hagriding”——人醒着却动不了，仿佛有东西沉沉压住他。"},{"en":"In old stories, hagriding was blamed on a hag who visited sleepers after midnight.","zh":"在古老传说里，人们把“hagriding”归咎于午夜后来访的女巫。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of “hag-riding”; to afflict someone with such a nightmare (rare/old-fashioned usage).","zh":"使人遭受“女巫压身”式的恶梦；进行“hag-riding”的行为（较少见/偏古旧用法）。"},"examples":[{"en":"The poem speaks of spirits hagriding the fearful traveler.","zh":"这首诗写到幽灵以“hag-riding”折磨惊恐的旅人。"}]}],"synonyms":["nightmare","sleep paralysis","incubus (literary/old)","night-hag (folklore)"],"phonetic":"/ˈhæɡˌraɪdɪŋ/","extraExplanation":["“Hag-riding / hagriding”源自欧洲民间对睡眠瘫痪的解释：人半醒却无法动弹、胸口压迫、呼吸困难，因而被想象成“老巫婆（hag）骑在身上”。现代医学通常将其视为睡眠瘫痪或与压力、作息紊乱相关的现象。","拼写常见作 hag-riding（带连字符）或 hag riding；hagriding 属于较少见的合写形式，多出现在文学或民俗语境中。"]}
{"word":"hagrode","summary":{"en":"“hagrode” isn’t an English word; it’s likely a misspelling (often “Hagrid” or “haggard”).","zh":"“hagrode” 不是英文单词；很可能是拼写错误（常见为 “Hagrid/海格” 或 “haggard/憔悴的”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of another word or name (commonly “Hagrid” or “haggard”).","zh":"不是标准英文单词。很可能是其他单词或名字的拼写错误（常见为 “Hagrid” 或 “haggard”）。"},"examples":[{"en":"I couldn’t find “hagrode” in an English dictionary—did you mean “Hagrid”?","zh":"我在英语词典里找不到 “hagrode”——你是不是想写 “Hagrid”？"},{"en":"If you meant “haggard,” it describes someone looking tired or worn out.","zh":"如果你想写的是 “haggard”，它形容某人看起来疲惫、憔悴。"}]}],"phonetic":"/ˈhæɡrɪd/","extraExplanation":["“Hagrid” 通常指《哈利·波特》系列中的角色 Rubeus Hagrid（海格），属于专有名词；而 “haggard” 是常见形容词，意思是“憔悴的、疲惫不堪的”。如果你告诉我你在哪个句子/场景里看到 “hagrode”，我可以更准确判断你想表达的词。"]}
{"word":"hagrope","summary":{"en":"“hagrope” is not a recognized standard English word; it likely needs context to identify the intended word.","zh":"“hagrope”不是标准英语词；通常需要上下文来判断你真正想表达/看到的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it is likely a misspelling, a name/username, or a word from a specific niche text.","zh":"在主流英语词典中不是标准词；很可能是拼写错误、姓名/用户名，或来自某个特定领域/文本的用词。"},"examples":[{"en":"I can’t find “hagrope” in a dictionary—could it be a typo?","zh":"我在词典里找不到“hagrope”——它会不会是拼写错了？"},{"en":"If you share the sentence where you saw “hagrope,” I can help figure out what it means.","zh":"如果你把看到“hagrope”的句子发给我，我可以帮你判断它可能是什么意思。"}]}],"phonetic":"/ˈhæɡroʊp/","extraExplanation":["如果你是从图片/OCR、手写体或旧书里看到的，常见情况是字母识别错误。你可以提供上下文（前后各一句）或截图，我可以帮你推测最可能的目标词。","按字面读成 hag + rope 时，可理解为“女巫/丑老太婆（hag）+ 绳子（rope）”，但这种组合在英语里并不是固定词或常用表达。","可能的相近词（需要上下文确认）：g rope（动词 grop e“摸索”相关）、hang rope（某些行业里可能出现的复合词）、或某个专有名词/品牌名。"]}
{"word":"hags","summary":{"en":"“Hags” is the plural of “hag,” usually meaning witch-like old women in stories, or a very rude insult for an old woman.","zh":"“hags”是“hag”的复数，常指故事里的老巫婆/女巫般的老妇；也可作非常无礼的辱骂用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ugly or frightening old women in stories or as an insult; the plural of “hag.”","zh":"（故事中或辱骂用语）丑陋、可怕的老女人；“hag”的复数。"},"examples":[{"en":"In the fairy tale, the hero meets three hags living in the woods.","zh":"在童话里，英雄遇到住在森林里的三个老巫婆。"},{"en":"Calling someone a hag is rude and disrespectful.","zh":"叫别人“老巫婆/丑老太婆”是很粗鲁、不尊重人的。"}]},{"partOfSpeech":"n.","definition":{"en":"A witch-like female figure (often in fantasy); used in the plural to mean a group of such characters.","zh":"（奇幻作品中）像女巫一样的女性形象；复数可指一群这类角色。"},"examples":[{"en":"The game features swamp hags that cast curses.","zh":"这款游戏里有会施诅咒的沼泽女巫。"}]}],"synonyms":["witches","crones","old witches"],"phonetic":"/hæɡz/","extraExplanation":["“hag”常见于民间传说与童话传统（英美文化中也常与“witch/witches”联想在一起），通常带有“丑陋、刻薄、可怕”的刻板印象。现实交流里用来形容真人会很冒犯，容易带有年龄与性别歧视色彩；更中性的表达可以用“an older woman / an elderly woman”，或描述具体行为（如“a rude person”）。","文学与流行文化里常见搭配：“old hag（老巫婆/丑老太婆）”“sea hag（海巫婆，常见于奇幻/海上传说）”“hag witch（女巫般的老妇形象）”。"]}
{"word":"hagseed","summary":{"en":"“Hagseed” is a harsh literary insult meaning “offspring of a hag,” used most famously in Shakespeare’s *The Tempest*.","zh":"“hagseed”是带强烈侮辱性的文学用语，意为“女巫/妖婆的后代”，最著名出自莎士比亚《暴风雨》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(an insult) the child of a hag (an ugly or evil old woman); by extension, a nasty, unpleasant, or “monstrous” person.","zh":"（侮辱用语）女巫/丑恶老妇的孩子；引申为令人厌恶、卑劣或“怪物般”的人。"},"examples":[{"en":"He cursed the man as a “hag-seed” and slammed the door.","zh":"他咒骂那个人是“hag-seed”，然后砰地一声把门摔上。"},{"en":"In the play, the word is used to insult Caliban and deny his humanity.","zh":"在戏剧里，这个词用来侮辱卡利班，并否认他的人性。"}]}],"synonyms":["spawn of a witch","witch’s brat","wretch","monster","miscreant"],"phonetic":"/ˈhæɡˌsiːd/","extraExplanation":["“Hag-seed”最有名的出处是莎士比亚《暴风雨》（The Tempest）：普洛斯彼罗用它辱骂卡利班（Caliban），意思大致是“女巫的孽种/妖婆的种”。这里的“hag”指丑陋或邪恶的老妇/女巫，“seed”指“后代、种”。","现代读者也可能因玛格丽特·阿特伍德（Margaret Atwood）的小说《Hag-Seed》（中文常译《女巫之子》或《妖婆之子》）而熟悉这个词。小说标题借用了《暴风雨》的侮辱语，但作品主题更偏向“如何看待被社会贴标签的人”。","语体提示：该词带强烈侮辱性、文学色彩较浓，现实交流中很少使用；写作或讨论文学时使用更合适。"]}
{"word":"hagship","summary":{"en":"“Hagship” isn’t standard English; you probably mean “flagship,” the most important or representative product/store/program.","zh":"“hagship”不是标准英语；你多半想写“flagship”，指最重要或最具代表性的产品/门店/项目。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most likely a misspelling of “flagship.”","zh":"不是标准英语单词。最可能是把“flagship”拼错了。"},"examples":[{"en":"I couldn’t find “hagship” in the dictionary—did you mean “flagship”?","zh":"我在词典里找不到“hagship”——你是不是想写“flagship”？"},{"en":"Our flagship store is in New York.","zh":"我们的旗舰店在纽约。"}]},{"partOfSpeech":"n.","definition":{"en":"flagship: the most important product, service, or store of a company (the best-known or top-level one).","zh":"flagship：某家公司最重要、最具代表性的产品/服务/门店（通常也是最知名或最高端的）。"},"examples":[{"en":"This phone is the company’s flagship model.","zh":"这款手机是这家公司的旗舰机型。"},{"en":"They opened a flagship store on Fifth Avenue.","zh":"他们在第五大道开了一家旗舰店。"},{"en":"The flagship program trains future leaders.","zh":"这个旗舰项目培养未来的领导者。"}]}],"synonyms":["leading product","top model","premier store","main","representative"],"phonetic":"/ˈflæɡʃɪp/","extraExplanation":["“flagship”原本指海军舰队中挂旗指挥的“旗舰”（lead ship），后来引申为“最具代表性/最重要的”。商业语境里非常常见：flagship product（旗舰产品）、flagship store（旗舰店）、flagship model（旗舰机型）。","如果你确实想表达“hag”（丑老太婆/女巫）相关的意思，那么“hagship”也不是常见构词；更可能需要用“hag”或其他词来表达。"]}
{"word":"hagstone","summary":{"en":"A hagstone is a naturally holed stone used in folklore as a protective charm.","zh":"hagstone 指一种天然带孔的石头，民俗中常被当作护身护符。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small stone with a natural hole through it, traditionally believed to protect against bad luck or evil and often worn or hung as a charm.","zh":"（护身石）一种天然带孔的小石头，民间传统认为它能驱邪避凶、带来好运，常被佩戴或悬挂作护符。"},"examples":[{"en":"She keeps a hagstone on a string by the front door for protection.","zh":"她把一块穿在绳子上的护身石挂在前门旁，图个保平安。"},{"en":"At the beach, they searched for a hagstone with a naturally drilled hole.","zh":"在海滩上，他们寻找那种天然形成孔洞的护身石。"},{"en":"In old folklore, a hagstone was said to ward off witches.","zh":"在古老民俗里，人们说护身石能防女巫。"}]}],"synonyms":["witch stone","holey stone","adder stone"],"phonetic":"/ˈhæɡˌstoʊn/","extraExplanation":["“hagstone”常见于英伦与北欧一带的民间传说；也叫“witch stone”“holey stone”“adder stone”。传统说法认为把它挂在门口、床头或牲畜圈旁可以避邪；有的故事还说透过孔看能“看见精灵/女巫”。","词源上，“hag”在古英语语境里常指“女巫/巫婆”，因此这个词带有明显的民俗色彩；现代使用多为兴趣、收藏或象征意义，并非科学概念。"]}
{"word":"hagtaper","summary":{"en":"Hagtaper is a rare, literary word for a spooky, candle-like flickering light (often a will-o’-the-wisp).","zh":"hagtaper 是少见的文学用词，指一种阴森、像蜡烛般闪烁的微光（常指沼泽鬼火）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(literary, old-fashioned) A mysterious, flickering light seen at night, especially over marshy ground; a will-o’-the-wisp.","zh":"（文学/古旧用法）夜间在沼泽等湿地上方出现的神秘闪烁微光；鬼火（will-o’-the-wisp）。"},"examples":[{"en":"In the mist, a hagtaper seemed to dance above the bog.","zh":"在薄雾中，一团鬼火似乎在沼泽上方跳动。"},{"en":"The traveler followed the hagtaper and soon lost the path.","zh":"旅人追着那团鬼火走，不久就迷了路。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A witch’s candle or a candle-like light linked with witches in folklore.","zh":"（罕见）传说中女巫的蜡烛；与女巫相关的烛光般光亮。"},"examples":[{"en":"The story speaks of a hag lighting a hagtaper at midnight.","zh":"故事里说女巫在午夜点起“女巫蜡烛”。"}]}],"synonyms":["will-o'-the-wisp","ignis fatuus","jack-o'-lantern (in the ‘marsh light’ sense)","corpse candle"],"phonetic":"/ˈhæɡˌteɪpər/","extraExplanation":["“hag-”常指“老巫婆/女巫”，而“taper”原意是“细长的蜡烛”。合起来的“hagtaper”多见于诗歌或古典叙述，用来营造阴森、迷离的氛围。","在民间传说里，这类光常被解释为“引人迷路的鬼火”。现代科普常把它和湿地中可燃气体导致的微弱发光等现象联系起来，但在文学中通常更偏向超自然意象。"]}
{"word":"hagueton","summary":{"en":"“hagueton” is not a standard English word; it’s likely a misspelling or a non-English term.","zh":"“hagueton”不是标准英语词汇；更可能是误拼或外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It does not appear in major English dictionaries; it is likely a misspelling, a name, or a word from another language.","zh":"不是标准英语词汇。在主要英语词典中一般查不到；很可能是拼写错误、人名/地名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “hagueton” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“hagueton”——你能把你看到它的句子发我吗？"},{"en":"It might be a typo; similar-looking words can have very different meanings.","zh":"它可能是拼写错误；看起来相近的词意思可能完全不同。"}]}],"phonetic":"/ˈhæɡwəˌtɑn/","extraExplanation":["“hagueton”很像下面这些词的误拼，你可以对照你原来的上下文确认：\n1) **Huguenot**（胡格诺派）：指16–17世纪法国的新教徒群体。\n2) 西班牙语 **juguetón**（爱闹、好玩、调皮的）：有时在非正式拼写里会被写得很乱。\n\n把你看到的原句或来源（书/歌词/游戏/聊天）发来，我可以更准确判断它到底想表达哪个词。"]}
{"word":"hagweed","summary":{"en":"Hagweed is a rare word, usually meaning ragweed (an allergy-causing plant) or, more generally, an unwanted weed.","zh":"Hagweed 是个很少见的词，通常指豚草（常致敏的植物），或泛指讨厌的杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A type of ragweed (a wild plant whose pollen commonly causes hay fever).","zh":"（罕见用法）豚草（一种野生植物，其花粉常引起花粉热/过敏性鼻炎）。"},"examples":[{"en":"Ragweed—sometimes called hagweed in older or regional speech—can trigger strong allergies in late summer.","zh":"豚草——在一些较旧或地区性的说法中也可能被叫作 hagweed——会在夏末引发严重过敏。"},{"en":"If you have seasonal allergies, avoid areas with ragweed (hagweed) when it’s releasing pollen.","zh":"如果你有季节性过敏，豚草（hagweed）散粉时要尽量避开其生长区域。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare/archaic) A coarse, unwanted weed; something seen as worthless or troublesome.","zh":"（非常罕见/古旧）粗劣的杂草；（比喻）无用或讨厌的东西。"},"examples":[{"en":"The old text calls the plant “hagweed,” meaning a common weed that farmers tried to clear.","zh":"那篇旧文把这种植物称作“hagweed”，意思是农人试图清除的普通杂草。"},{"en":"He dismissed the rumor as hagweed—nothing worth paying attention to.","zh":"他把那传言当成“hagweed”——不值得理会的东西。"}]}],"synonyms":["ragweed","weed","wild weed"],"phonetic":"/ˈhæɡˌwid/","extraExplanation":["“hagweed”在现代英语里非常不常见，很多时候可能是把“ragweed（豚草）”写错/听错了。日常写作和学习中，建议优先使用更常见的“ragweed”。","ragweed（豚草）在北美语境里非常常见，因为它是引发季节性过敏（hay fever）的主要花粉来源之一；这也是你更容易在健康科普、天气/花粉预报里看到“ragweed”的原因。"]}
{"word":"hagworm","summary":{"en":"Hagworm is an old or dialect word for a small snake (often a poisonous one, like an adder).","zh":"Hagworm 是古语或方言词，指一种小蛇，常指像蝮蛇/蝰蛇那样的毒蛇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or dialect) a small snake, especially a poisonous one such as an adder; sometimes used for a slowworm (a legless lizard) in older usage.","zh":"（古语或方言）小蛇，尤指像蝰蛇/蝮蛇（adder）这类有毒的蛇；在旧用法中有时也指“慢蛇”（slowworm，一种无足蜥蜴）。"},"examples":[{"en":"In old stories, a hagworm might be blamed for sudden illness after a bite.","zh":"在古老的故事里，人们可能把被咬后突然生病归咎于“hagworm”（一种小毒蛇）。"},{"en":"The word hagworm is rarely used today; most speakers would say “adder” or “viper.”","zh":"“hagworm”如今很少使用；大多数人会说“adder（蝰蛇/蝮蛇）”或“viper（毒蛇）”。"}]}],"synonyms":["adder","viper","snake","slowworm","blindworm"],"phonetic":"/ˈhæɡwɝːm/","extraExplanation":["这个词带有明显的“古老/民间叙事”的气息，多见于旧文学、地方方言或民俗语境，不是现代日常英语常用词。","词中 worm 在古英语里常可泛指“蛇/爬虫类”，不一定是现代意义的“蠕虫”；hag- 常让人联想到“女巫/妖婆”等民俗意象，因此 hagworm 在故事里有时也会显得阴森或带点迷信色彩。"]}

