{"word":"haj","summary":{"en":"Haj is a variant spelling of Hajj, the Islamic pilgrimage to Mecca.","zh":"Haj 是 Hajj 的拼写变体，指伊斯兰教前往麦加的朝觐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spelling variant of **Hajj**: the Islamic pilgrimage to Mecca that Muslims who are able are expected to perform at least once in their lifetime","zh":"**Hajj** 的一种拼写变体：指伊斯兰教前往麦加的朝觐；有能力的穆斯林一生应至少完成一次"},"examples":[{"en":"Millions of Muslims travel to Saudi Arabia each year for the Hajj.","zh":"每年都有数百万穆斯林前往沙特阿拉伯参加朝觐（Hajj）。"},{"en":"He saved money for years so he could go on Hajj with his family.","zh":"他多年存钱，只为能和家人一起去朝觐。"}]},{"partOfSpeech":"n.","definition":{"en":"a less common informal spelling of **hadj/hajj** used in some writing; it usually refers to the same pilgrimage","zh":"一种较少见的非正式拼写（见于部分文本）；通常仍指“朝觐”"},"examples":[{"en":"In older texts, you may see different spellings such as haj, hadj, or hajj.","zh":"在较旧的文本中，你可能会看到 haj、hadj 或 hajj 等不同拼写。"}]}],"synonyms":["Hajj","pilgrimage"],"phonetic":"/hɑdʒ/","extraExplanation":["常见标准拼写是 **Hajj**（也写作 **Haj**）。这是伊斯兰教“五功”之一，发生在伊斯兰历的特定时间段，并包含一系列固定仪式。由于来自阿拉伯语的音译方式不同，英文里会出现多种拼写。","使用时注意大小写：作为专有名词通常写 **Hajj**。在日常英文里说“去朝觐”常用 **go on Hajj** 或 **perform the Hajj**。"]}
{"word":"haje","summary":{"en":"“Haje” is not standard English; it is sometimes used as a rare spelling for **hajj** (the pilgrimage to Mecca) or, less commonly, a person who has completed it.","zh":"“haje”不是标准英语拼写；有时作为 **hajj（麦加朝觐）** 的少见拼写，较少情况下也可指完成过朝觐的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) A less common transliteration of **hajj / haj**: the annual Islamic pilgrimage to Mecca.","zh":"（非标准拼写）较少见的音译形式，常指 **hajj / haj（朝觐）**：伊斯兰教每年前往麦加的朝圣。"},"examples":[{"en":"Millions of Muslims travel to Saudi Arabia each year for the **haje (hajj)**.","zh":"每年都有数百万穆斯林前往沙特阿拉伯参加 **haje（hajj，朝觐）**。"},{"en":"He saved money for years so he could complete the **haje (hajj)**.","zh":"他攒了很多年钱，只为完成 **haje（hajj，朝觐）**。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) A term used in some communities to refer to a person who has completed the hajj (more commonly **haji / hajji**).","zh":"（很少见）在一些社群中指完成过朝觐的人（更常见的说法是 **haji / hajji**）。"},"examples":[{"en":"After returning from Mecca, he was called a **haje** by neighbors (more commonly, a **haji**).","zh":"从麦加回来后，邻居称他为 **haje**（更常见叫法是 **haji**）。"}]}],"synonyms":["hajj","haj","pilgrimage","haji","hajji"],"phonetic":"/hɑːdʒ/","extraExplanation":["“haje”并不是常见的英语标准拼写；英语里更常见的是 **hajj**（也写作 **haj**），以及表示“朝觐者”的 **haji/hajji**。不同拼写主要来自把阿拉伯语 **حجّ** 音译成拉丁字母时的差异。","如果你原本想查的是别的词（例如 **haze** /heɪz/ 或 **have** /hæv/），告诉我上下文句子，我可以帮你确认。"]}
{"word":"hajes","summary":{"en":"“Hajes” isn’t a standard English word; it’s likely a misspelling (often of “haze” or “Hajj”).","zh":"“hajes” 不是标准英语单词；多半是拼写错误（常见可能是 “haze” 或 “Hajj”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name. Common possibilities include “haze” (mist/confusion) or “Hajj” (the Muslim pilgrimage to Mecca).","zh":"不是标准英语单词；更可能是拼写错误或人名。常见可能包括 haze（薄雾/困惑）或 Hajj（穆斯林前往麦加的朝觐）。"},"examples":[{"en":"I can’t find “hajes” in an English dictionary—did you mean “haze”?","zh":"我在英语词典里找不到 “hajes”——你是不是想写 “haze”？"},{"en":"If you’re talking about the Islamic pilgrimage, the word is usually spelled “Hajj.”","zh":"如果你指的是伊斯兰教的朝觐，通常拼作 “Hajj”。"}]}],"phonetic":"/ˈhɑːdʒəz/","extraExplanation":["“hajes” 可能是键盘误触或把发音按自己语言的拼写习惯写出来了。你可以告诉我它出现在哪个句子里（或你想表达的中文意思），我就能更准确地帮你确认正确单词与用法。"]}
{"word":"haji","summary":{"en":"A respectful title for a Muslim who has completed the pilgrimage (Hajj) to Mecca.","zh":"对已完成前往麦加朝觐（Hajj）的穆斯林的尊称/称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim who has completed the Hajj (the pilgrimage to Mecca); used as a respectful title or form of address, often before a person’s name","zh":"（穆斯林）已完成朝觐（Hajj，前往麦加的朝圣）的人；常作尊称或称号（多置于姓名前）"},"examples":[{"en":"Haji Ahmad returned home after completing the Hajj.","zh":"哈吉·艾哈迈德在完成朝觐后回到了家。"},{"en":"People in the community addressed her as Haji Fatimah out of respect.","zh":"社区里的人出于尊重称她为“哈吉·法蒂玛”。"},{"en":"His grandfather is a haji, so the family asked him for advice on the pilgrimage.","zh":"他祖父是一位哈吉，所以家里向他请教朝觐的事。"}]}],"synonyms":["hajji","pilgrim"],"phonetic":"/ˈhɑːdʒi/","extraExplanation":["“Haji”源自阿拉伯语“ḥājj”（意为“朝觐者”）。英语里也常见拼写“hajji / hajji”。在许多穆斯林文化中，这是带敬意的称号，但在某些地区也可能只是描述身份；使用时最好尊重当地习惯。","书写上：作为称号/头衔时常大写（Haji）；泛指“一个完成朝觐的人”时可小写（a haji）。"]}
{"word":"hajib","summary":{"en":"“Hijab” is a headscarf worn by some Muslim women, covering the hair and neck in public.","zh":"“Hijab”指一些穆斯林女性在公共场合佩戴的头巾，通常遮住头发和颈部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A head covering worn by some Muslim women in public, usually a scarf that covers the hair and neck.","zh":"（常指穆斯林女性在公共场合佩戴的）头巾；通常为围巾样式，遮住头发和颈部。"},"examples":[{"en":"She wears a hijab to school every day.","zh":"她每天戴着头巾去学校。"},{"en":"The hijab can be styled in many different ways.","zh":"头巾可以有很多不同的戴法。"}]}],"synonyms":["headscarf","headscarf (for Muslim women)","veil (general)"],"phonetic":"/hɪˈdʒɑːb/","extraExplanation":["你输入的 **hajib** 常见是拼写误差，更常用的拼法是 **hijab**。","在英语语境中，**hijab** 既可指“头巾”这一物品，也可指“佩戴头巾的做法/规范”（如 *wearing the hijab*）。不同地区、家庭与个人对是否佩戴、如何佩戴的选择差异很大，属于个人与文化/宗教身份相关的议题，谈论时通常保持尊重与中性措辞较合适。"]}
{"word":"hajilij","summary":{"en":"“hajilij” is not a standard English word; it’s probably a misspelling or a proper name.","zh":"“hajilij”不是标准英文单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word (likely a misspelling, name, or a word from another language).","zh":"不是常见的英文单词（可能是拼写错误、人名/地名，或来自其他语言）。"},"examples":[{"en":"I can’t find “hajilij” in standard English dictionaries—could you tell me where you saw it?","zh":"我在常见英文词典里找不到“hajilij”——你是在哪里看到的？"},{"en":"If you meant a different spelling, please share the sentence so I can help.","zh":"如果你想写的是另一个拼法，请把完整句子发我，我就能帮你判断。"}]}],"phonetic":"/ˈhɑːdʒɪlɪdʒ/","extraExplanation":["“hajilij”看起来像随机字母组合，也可能是：\n1）某个词的误拼（例如把字母顺序打乱/漏字母）；\n2）专有名词（人名、地名、用户名、品牌名）；\n3）其他语言的音译或拼写（例如南亚、中东、东欧等语言）。\n\n你可以告诉我：它出现的上下文句子、所属领域（游戏/社交媒体/宗教/地理等）、以及你想表达的意思，我就能更准确地推测或纠正拼写。"]}
{"word":"hajis","summary":{"en":"“Hajis” is the plural of “haji/hajji,” meaning Muslims who have completed the Hajj, but it can also be an offensive slang term in some contexts.","zh":"“Hajis”是“haji/hajji”的复数，指完成过麦加朝觐的穆斯林；但在某些语境中也可能是带冒犯性的俚语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a title or honorific for a Muslim who has completed the pilgrimage to Mecca (the Hajj); plural of “haji/hajji.”","zh":"（haji/hajji 的复数）指已完成前往麦加朝觐（Hajj）的穆斯林；可作为尊称/头衔使用。"},"examples":[{"en":"In some communities, people may call him “Haji” after he completes the Hajj.","zh":"在一些社群里，他完成朝觐后，人们可能称他为“Haji”（一种尊称）。"},{"en":"Several hajis from the village traveled together to Mecca.","zh":"村里有几位完成朝觐的人一起去过麦加。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, often offensive) a derogatory term used (especially in some military contexts) to refer to Arabs or Muslims.","zh":"（俚语，常具冒犯性）在某些语境（尤其部分军事语境）中对阿拉伯人或穆斯林的贬称。"},"examples":[{"en":"That word is considered offensive; it’s better to say “local people” or name the group specifically.","zh":"那个词被认为带有冒犯性；更好的说法是“当地人”，或直接说清具体群体名称。"}]}],"synonyms":["hajjis","Muslim pilgrims (contextual)","people who have completed the Hajj (contextual)"],"phonetic":"/ˈhɑːdʒiz/","extraExplanation":["“Haji/Hajji”源自阿拉伯语，原本是与朝觐相关的宗教与社会身份称呼，很多地方带有尊敬意味。","在英语里，“haji(s)”有时被挪用为贬义俚语，容易造成伤害与刻板印象。写作或口语中建议避免用作泛指他者的称呼，改用更准确中性的表达（如：Muslim pilgrims / people who have completed the Hajj / local residents，或具体国籍、族群名称）。"]}
{"word":"Hajj","summary":{"en":"Hajj is the annual Islamic pilgrimage to Mecca, an important religious duty for Muslims who are able to perform it.","zh":"Hajj 指每年在特定时段前往麦加的伊斯兰教朝觐，是有能力的穆斯林重要的宗教功课。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the annual Islamic pilgrimage to Mecca in Saudi Arabia, performed during a specific time in the Islamic lunar calendar; it is a central religious duty for Muslims who are physically and financially able to do it at least once in their lifetime","zh":"（伊斯兰教的）朝觐：每年在伊斯兰历特定时间前往沙特阿拉伯麦加的宗教朝圣；对身体与经济条件允许的穆斯林而言，一生至少一次是重要宗教功课"},"examples":[{"en":"Millions of Muslims travel to Mecca each year for the Hajj.","zh":"每年都有数百万穆斯林前往麦加参加朝觐。"},{"en":"She saved money for years so she could perform Hajj with her parents.","zh":"她存了好多年钱，好和父母一起完成朝觐。"}]}],"synonyms":["pilgrimage (general)","Islamic pilgrimage to Mecca"],"phonetic":"/hædʒ/","extraExplanation":["“Hajj”源自阿拉伯语，意为“朝向/前往（某处）”。英语里常写作 Hajj（也可见 Haj）。","宗教语境中常见搭配：perform Hajj（完成朝觐）、go on Hajj（去朝觐）、Hajj pilgrimage（朝觐之旅）。","文化小提示：在穆斯林社群中，完成朝觐是一件非常庄重的事；在表达时用尊重、客观的语气最合适。","相关词：Umrah（副朝/小朝觐）也去麦加，但时间更灵活；而 Hajj 只在固定时段进行。"]}
{"word":"hajj","summary":{"en":"Hajj is the annual Islamic pilgrimage to Mecca, a major religious duty for Muslims who are able to do it.","zh":"Hajj 指穆斯林每年到麦加进行的朝觐，是有能力者的重要宗教义务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the annual Islamic pilgrimage to Mecca (Makkah) in Saudi Arabia, required at least once in a lifetime for Muslims who are physically and financially able","zh":"（伊斯兰教）哈吉/朝觐：穆斯林每年前往沙特阿拉伯麦加（Makkah）的朝圣之旅；对身体与经济条件允许者，一生中至少应履行一次"},"examples":[{"en":"My neighbor went on Hajj last year and shared photos of Mecca.","zh":"我的邻居去年去参加了哈吉（朝觐），还分享了麦加的照片。"},{"en":"Many Muslims save money for years to be able to perform Hajj.","zh":"许多穆斯林会攒钱多年，以便能够完成朝觐。"},{"en":"During Hajj, pilgrims follow specific rites over several days.","zh":"在朝觐期间，朝圣者会在数天内完成一系列特定仪式。"}]}],"synonyms":["pilgrimage","Islamic pilgrimage"],"phonetic":"/hædʒ/","extraExplanation":["“Hajj”是伊斯兰教“五功”（Five Pillars）之一，时间在伊斯兰历的“都尔黑哲月”（Dhu al-Hijjah）。常见表达是“perform Hajj”（完成朝觐）或“go on Hajj”（去朝觐）。","注意区分“Hajj”和“Umrah”（副朝/小朝觐）：Umrah一年中多数时间都可进行，而Hajj有固定季节。","英文里有时也写作“hadj”，但“Hajj”最常见。去朝觐的人可称为“a hajji / a haji”（完成朝觐者），在不同地区用法与拼写略有差异。"]}
{"word":"hajjes","summary":{"en":"“Hajjes” is an uncommon plural spelling of “hajj,” the Muslim pilgrimage to Mecca.","zh":"“Hajjes”是不常见的复数拼写，对应“hajj”，即穆斯林前往麦加的朝觐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) plural form of “hajj,” the Islamic pilgrimage to Mecca that Muslims who are able are expected to do at least once in their lifetime.","zh":"（不常见）“hajj”的复数形式，指伊斯兰教徒前往麦加的朝觐；有能力的穆斯林一生中应至少完成一次。"},"examples":[{"en":"Millions of Muslims complete the hajj each year; you may also see the plural written as “hajjes” in some texts.","zh":"每年有数以百万计的穆斯林完成朝觐；在某些文本中也可能看到复数写作“hajjes”。"},{"en":"The museum displayed photographs of different hajjes across history.","zh":"博物馆展出了不同时期朝觐活动的照片。"}]}],"synonyms":["hajj pilgrimages","pilgrimages to Mecca"],"phonetic":"/hædʒ/","extraExplanation":["“hajjes”在现代英语里并不常见；更常见的写法是把“hajj”当作集合名词直接用（单复数同形），或改写成更清晰的表达，如“hajj pilgrimages”。","相关词：hajj（朝觐本身）、hajji / haji（完成朝觐的人；有时也作为尊称使用）。注意这些词与宗教文化密切相关，使用时尽量尊重语境与称呼习惯。"]}
{"word":"hajji","summary":{"en":"A Muslim who has completed the pilgrimage to Mecca (Hajj), often used as a respectful title.","zh":"指完成麦加朝觐（Hajj）的穆斯林，也常作尊称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim who has completed the Hajj (the pilgrimage to Mecca); also used as an honorific title before or after a person’s name.","zh":"完成过朝觐（Hajj，前往麦加的伊斯兰朝圣）的人；也可作为对其的尊称（常用于姓名前或后）。"},"examples":[{"en":"After returning from Mecca, he was known as a hajji in his community.","zh":"从麦加回来后，他在社区里被称为 hajji（朝觐者）。"},{"en":"Hajji Fatima is respected for her devotion and service.","zh":"Hajji Fatima 因其虔诚与服务精神而受到尊敬。"}]}],"synonyms":["pilgrim","Hajj pilgrim","al-Hajj (title)"],"phonetic":"/ˈhædʒi/","extraExplanation":["“Hajji”源自阿拉伯语（常见转写为ḥājjī），与“Hajj（朝觐）”同源。在许多穆斯林社会中，它是一种带有敬意的称呼，表示此人完成了重要的宗教义务。","需要注意语境：在某些英语语境（例如部分军事俚语）里，“hajji”曾被用来泛指当地人或穆斯林，有时带有贬义或不尊重的色彩。写作或交流中，最好仅在宗教/称谓的准确含义下使用。"]}
{"word":"hajjis","summary":{"en":"“Hajjis” is the plural of “hajji,” usually meaning people who have completed the Hajj pilgrimage; in some slang contexts it can be derogatory, so use with care.","zh":"“hajjis”是“hajji”的复数，通常指完成麦加朝觐的人；但在某些俚语语境中可能带贬义，使用需谨慎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hajji: Muslims who have completed the Hajj (pilgrimage) to Mecca; a respectful title in many Muslim communities.","zh":"hajji 的复数：指完成了赴麦加朝觐（Hajj）的穆斯林；在许多穆斯林社群中是带有尊敬意味的称呼或头衔。"},"examples":[{"en":"After returning from Mecca, they were welcomed as hajjis in their community.","zh":"从麦加回来后，他们在社区里被当作完成朝觐的人（hajjis）热情欢迎。"},{"en":"In some families, becoming a hajji is a milestone people speak about with pride.","zh":"在一些家庭里，完成朝觐成为“hajji”是人们自豪谈起的重要里程碑。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, offensive in some contexts) a term some English speakers—especially in wartime slang—have used to refer to Middle Eastern or Muslim people in general; often considered derogatory and best avoided.","zh":"（非正式；在某些语境下带冒犯性）一些英语使用者（尤其在战争俚语中）用来泛指中东人或穆斯林的说法；常被视为贬义，建议避免使用。"},"examples":[{"en":"Some old military slang used “hajjis” in a way many people consider offensive.","zh":"一些旧的军队俚语里会用“hajjis”，但很多人认为这种用法带有冒犯性。"},{"en":"It’s more respectful to say “Muslim people,” “Iraqis,” or the specific group you mean.","zh":"更尊重的说法是用“Muslim people（穆斯林）”、“Iraqis（伊拉克人）”或你要指的具体群体名称。"}]}],"synonyms":["pilgrims (context: Hajj pilgrims)","people who completed the Hajj"],"phonetic":"/ˈhɑdʒi/","extraExplanation":["“Hajji”（也写作 haji）源自阿拉伯语，与“完成朝觐的人”有关。在很多地方，它类似一种荣誉称号（有点像对完成重要宗教旅程者的尊称），使用时通常要根据对方与当地文化习惯来判断是否合适。","但在部分英语语境（特别是某些战争报道/军队口语）里，这个词被挪用成对中东或穆斯林的泛称，容易带刻板印象甚至侮辱意味。写作或交流中，建议使用更具体、准确的族群/国籍/宗教称呼。"]}
{"word":"hajjs","summary":{"en":"“Hajj” is the annual Islamic pilgrimage to Mecca; “hajjs” is likely a nonstandard plural/typo of Hajj.","zh":"“Hajj”指伊斯兰教一年一度在麦加举行的朝觐；“hajjs”多半是非标准复数或拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the annual Islamic pilgrimage to Mecca in Saudi Arabia, which Muslims who are able are expected to perform at least once in their lifetime","zh":"（伊斯兰教）朝觐：穆斯林在具备条件时一生中应至少完成一次的、每年在沙特阿拉伯麦加举行的宗教朝圣"},"examples":[{"en":"My colleague is traveling to Saudi Arabia for the Hajj this year.","zh":"我同事今年要去沙特阿拉伯参加朝觐。"},{"en":"During Hajj, millions of pilgrims gather in Mecca.","zh":"朝觐期间，数以百万计的朝圣者聚集在麦加。"}]},{"partOfSpeech":"n.","definition":{"en":"(countable) one particular year’s Hajj pilgrimage","zh":"（可数）某一年的一次朝觐（如“2024年的朝觐”）"},"examples":[{"en":"The 2025 Hajj will take place in early June.","zh":"2025年的朝觐将在六月初举行。"}]}],"synonyms":["pilgrimage"],"phonetic":"hædʒ","extraExplanation":["你输入的“hajjs”通常不是标准拼写，更常见的词形是 **Hajj**（朝觐）。如果想表达“多次/多年的朝觐”，英语里有时会用 **Hajjes**（较少见）或直接说 **different Hajj seasons/years**。如果指“参加过朝觐的人”，常用 **hajji**（复数 **hajjis**）。","大写 **Hajj** 很常见，因为它指一个特定宗教活动；在非正式语境也可能写作小写 hajj。"]}

