{"word":"hak","summary":{"en":"“hak” is usually an informal/nonstandard form of “hack,” and can also be a regional South African word for “heel.”","zh":"“hak”通常是“hack”的非正式/非标准写法；在南非地区语境中也可指“鞋跟/脚后跟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard) A spelling/typing variant of “hack,” meaning a clever shortcut or an act of breaking into a computer system.","zh":"（非标准、口语）“hack”的拼写/输入变体，可指“技巧/捷径”，也可指“黑入电脑系统”。"},"examples":[{"en":"I found a quick hak to organize my notes—use tags and one master folder.","zh":"我找到一个快速的“hak”来整理笔记——用标签加一个总文件夹。"},{"en":"Don’t share “hak” tools online; hacking can be illegal and harmful.","zh":"别在网上分享“hak”工具；黑客行为可能违法并造成伤害。"}]},{"partOfSpeech":"n.","definition":{"en":"(regional, South African English, from Afrikaans) The heel of a shoe or foot; also used in compounds like “hakke.”","zh":"（地区用法，南非英语，源自南非荷兰语）鞋跟/脚后跟；也常见于相关复合词。"},"examples":[{"en":"My shoe’s hak is worn down, so I need new soles.","zh":"我鞋子的鞋跟磨平了，所以需要换鞋底。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, regional) To chop or hack at something.","zh":"（少见、地区用法）砍、劈；猛砍某物。"},"examples":[{"en":"He haked at the branches to clear the path.","zh":"他砍树枝来清出一条路。"}]}],"synonyms":["hack","shortcut","tip","chop","heel"],"phonetic":"/hæk/","extraExplanation":["“hak”在标准英语词典里通常不是常用词；在网络语境中常被当作“hack”的非正式写法或拼写错误。更正式的写法建议用“hack”。","如果你是在南非语境（受Afrikaans影响）看到“hak”，它可能指“鞋跟/脚跟”等含义。"]}
{"word":"haka","summary":{"en":"Haka is a Māori ceremonial dance with chanting, widely known today from New Zealand sports and used to express welcome, respect, pride, or challenge.","zh":"Haka（哈卡）是毛利人的仪式舞蹈与吟唱，如今因新西兰体育而广为人知，用于欢迎、致敬、表达自豪或发出挑战。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Māori ceremonial dance (often with chanting, strong movements, and facial expressions), used to welcome guests, show respect, celebrate, or prepare for conflict","zh":"哈卡：毛利人的传统仪式舞蹈（常伴随吟唱、有力动作和表情），用于欢迎来宾、表达敬意、庆祝或在冲突前鼓舞士气"},"examples":[{"en":"The team performed a haka before the match to show unity and pride.","zh":"球队在比赛前表演哈卡，以展示团结和自豪感。"},{"en":"At the ceremony, a haka welcomed the visitors to the community.","zh":"在仪式上，人们用哈卡欢迎来访者来到社区。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in New Zealand sports) a haka performed by a team or group as a pre-game challenge or statement of identity","zh":"（尤指新西兰体育语境）赛前由团队表演的哈卡，用作挑战对手或表达身份认同"},"examples":[{"en":"Fans recognized the All Blacks’ haka instantly.","zh":"球迷立刻认出了全黑队的哈卡。"},{"en":"Some schools teach a haka to build teamwork and cultural understanding.","zh":"一些学校教授哈卡来培养团队合作与文化理解。"}]}],"synonyms":["Māori ceremonial dance","challenge chant","war dance (informal)"],"phonetic":"/ˈhɑːkə/","extraExplanation":["“Haka”来自毛利语，并不只等同于“战争舞”。它可以用于多种场合：迎接贵宾、婚礼、葬礼、庆祝成就、表达哀悼或团结等。","在新西兰橄榄球队 All Blacks 的传播下，haka 在全球更广为人知。但在表演与使用时应尊重其文化意义与场合（例如内容、姿态、台词可能属于特定部族/群体）。"]}
{"word":"hakafoth","summary":{"en":"Hakafot are ceremonial circling processions or dances in Jewish worship, most famously on Simchat Torah.","zh":"Hakafot 指犹太教仪式性的绕行/巡行（常伴随歌舞），最常见于欢庆《妥拉》节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) plural of hakafah: ceremonial “circuits” or rounds—people walk or dance in a circle, often carrying Torah scrolls, especially on Simchat Torah (and in some traditions during Sukkot).","zh":"（犹太教）hakafah 的复数：指宗教仪式中的“绕行/巡行”（绕圈行走或跳舞），常见于欢庆《妥拉》节（Simchat Torah）时手持《妥拉》卷轴绕行；部分传统也用于住棚节（Sukkot）的相关仪式。"},"examples":[{"en":"On Simchat Torah, the congregation joined the hakafot, circling the synagogue with the Torah scrolls.","zh":"在欢庆《妥拉》节上，会众参加 hakafot，手持《妥拉》卷轴绕着会堂转圈。"},{"en":"They sang and danced through several hakafot before the reading began.","zh":"在诵读开始前，他们唱歌跳舞，进行了好几轮 hakafot。"}]}],"synonyms":["processions","circuits","ritual circling"],"phonetic":"/ˌhɑːkəˈfoʊt/","extraExplanation":["你输入的拼写“hakafoth”不太常见；更常见的英文转写是 **hakafot**（也有人写 **hakafoth** 来表示词尾的 /t/ 音或受其他转写习惯影响）。","这个词来自希伯来语，字面与“环绕、绕圈”有关。在英语文本中多用于描述犹太宗教与节庆场景，因此通常不翻译成普通的“walks”，而是保留音译来强调其仪式性与文化背景。"]}
{"word":"hakam","summary":{"en":"Hakam usually means a judge/arbitrator (especially in Arabic/Islamic contexts), and it can also be a personal name.","zh":"Hakam通常指（阿拉伯语/伊斯兰语境中的）法官或仲裁者，也可作人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Arabic and Islamic contexts) a judge, arbitrator, or ruler—someone who makes decisions or settles disputes.","zh":"（阿拉伯语/伊斯兰语境）法官、仲裁者或统治者；负责裁决与调解纠纷的人。"},"examples":[{"en":"In the village dispute, a hakam was chosen to hear both sides and make a fair decision.","zh":"在村庄纠纷中，人们选出一位hakam来听取双方意见并作出公正裁决。"},{"en":"The contract says a hakam will be appointed if the two parties cannot agree.","zh":"合同写明如果双方无法达成一致，将指定一位hakam进行仲裁。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name or surname (often from Arabic), used by people in many countries.","zh":"人名或姓氏（多源自阿拉伯语），在许多国家都有使用。"},"examples":[{"en":"Hakam is his family name.","zh":"Hakam是他的姓。"},{"en":"I met a student named Hakam in my English class.","zh":"我在英语课上认识了一位名叫Hakam的学生。"}]}],"synonyms":["judge","arbitrator","mediator","referee"],"phonetic":"/hɑˈkɑm/","extraExplanation":["“hakam”源自阿拉伯语词根 H-K-M，和“判断、治理、裁决”相关；因此它常与法律、调解、权威决策相连。","在英语里有时会看到拼写差异：hakam / hakam；另外还有相近词“hakham”（常见于犹太语境，意为“智者、拉比”），含义与用法不同，注意区分。"]}
{"word":"hakamim","summary":{"en":"Hakamim (more commonly spelled hakhamim) means Jewish sages or rabbinic scholars (plural).","zh":"hakamim（更常见拼写为 hakhamim）指“犹太教贤者/拉比学者”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jewish sages or rabbinic scholars (plural), especially the authoritative teachers quoted in classical Jewish writings.","zh":"（复数）犹太教的贤者、拉比学者；尤指在犹太经典文献中被引用、具有权威的教师与解释者。"},"examples":[{"en":"In the Talmud, the hakamim debate how a law should be understood.","zh":"在《塔木德》中，hakamim（贤者们）会辩论某条律法应如何理解。"},{"en":"Many traditions say the hakamim passed down teachings from earlier generations.","zh":"许多传统认为，hakamim 将早期世代的教导一代代传承下来。"}]}],"synonyms":["hakhamim","chachamim","sages","rabbis (in context)"],"phonetic":"/ˌhɑːxɑˈmim/","extraExplanation":["“hakamim”更常见的拼写是 **hakhamim**（也写作 *chachamim*），来自希伯来语 **חכמים**，意思是“智慧的人/贤者们”。不同拼写主要反映了把希伯来语音译成英文时的习惯差异。","在犹太传统语境里，它常用来泛指“拉比贤者们/我们的贤者”，尤其是《密西拿》《塔木德》等经典中被引用的权威意见来源。"]}
{"word":"hakdar","summary":{"en":"“Hakdar” means “rightfully entitled” or “a rightful claimant/owner,” commonly used in South Asian contexts.","zh":"“hakdar”常用于南亚语境，表示“有正当权利的/有资格的”，也可指“合法权利人/继承人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asian English/Urdu/Hindi) having a rightful claim; entitled to something by right or law.","zh":"（南亚英语/乌尔都语/印地语）“有正当权利的；有资格的；有权获得某物的”。"},"examples":[{"en":"Only the hakdar candidate will receive the scholarship.","zh":"只有真正有资格（有正当权利）的候选人才能获得奖学金。"},{"en":"She is hakdar of the property under the will.","zh":"根据遗嘱，她对这份财产有合法继承权。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asian English/Urdu/Hindi) a person who has a rightful claim; a rightful owner or claimant.","zh":"（南亚英语/乌尔都语/印地语）“有权利的人；合法继承人/权利主张者”。"},"examples":[{"en":"The court recognized him as the hakdar of the land.","zh":"法院承认他是这块土地的合法权利人。"},{"en":"We must pay the compensation to the real hakdar.","zh":"我们必须把赔偿金付给真正的权利人。"}]}],"synonyms":["entitled","rightful","lawful","claimant","beneficiary (context-dependent)"],"phonetic":"/ˈhɑːk.dɑːr/","extraExplanation":["“hakdar”常见于南亚语境的英语（尤其在巴基斯坦、印度的英语中），来源于乌尔都语/印地语：ḥaqq（权利）+ dār（持有者/拥有者），字面意思是“权利的持有者”。","在正式的国际英语里，更常用的对应词是：entitled（有权的）、rightful（合法的）、lawful claimant（合法主张者）、beneficiary（受益人/继承人，视语境而定）。"]}
{"word":"hake","summary":{"en":"“Hake” most commonly means a mild white ocean fish (related to cod). Rarely, it can mean “to rake together.”","zh":"“hake”最常见指一种清淡的白肉海鱼（与鳕鱼同科）；较少见时也可作动词，表示“用耙子拢在一起”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of ocean fish with white flesh, related to cod, often sold as food","zh":"一种海鱼（白肉），与鳕鱼同科，常作为食用鱼出售"},"examples":[{"en":"We had baked hake with lemon and herbs for dinner.","zh":"我们晚餐吃了柠檬香草烤无须鳕。"},{"en":"Hake is often used in fish and chips because it’s mild and flaky.","zh":"无须鳕常用来做炸鱼薯条，因为味道清淡、肉质松散。"}]},{"partOfSpeech":"vt.","definition":{"en":"to rake or scrape together (used rarely in modern English)","zh":"把……用耙子/刮具拢在一起（现代英语中较少用）"},"examples":[{"en":"He haked the leaves into a pile.","zh":"他把落叶耙成一堆。"}]}],"synonyms":["cod (similar type of fish)","rake (verb meaning)"],"phonetic":"/heɪk/","extraExplanation":["“hake”作鱼名时，在不同地区可能指不同种的“无须鳕/鳕形目海鱼”。在英美超市里常见冷冻鱼排或鱼柳；如果你在菜单上看到 hake，一般就是口感清淡的白肉鱼。","文学或写作中提到 hake 多与海洋、渔业、饮食场景有关；动词用法（=rake）相对古旧，现代更常用 rake。"]}
{"word":"hakea","summary":{"en":"Hakea is an Australian genus of shrubs or small trees, sometimes grown as ornamentals.","zh":"Hakea 指澳大利亚原生的哈凯亚属灌木或小乔木，有些可作观赏植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of Australian shrubs or small trees (family Proteaceae), often with tough leaves and showy flowers; some species are planted as ornamentals.","zh":"（哈凯亚属）澳大利亚原生的一类灌木或小乔木（山龙眼科），叶片较坚韧，花较显眼；部分物种可作观赏植物栽培。"},"examples":[{"en":"We planted a hakea in the dry part of the garden because it tolerates drought.","zh":"我们在花园较干燥的地方种了一株哈凯亚，因为它很耐旱。"},{"en":"Many hakea species are native to Western Australia.","zh":"许多哈凯亚属植物原产于西澳大利亚。"}]}],"synonyms":["(botany) genus Hakea"],"phonetic":"/ˈheɪkiə/","extraExplanation":["“Hakea”来自植物学命名：为纪念18世纪德国赞助人Baron von Hake（哈凯男爵）而得名。","在澳大利亚园艺语境里，hakea常被提到的特点是耐旱、适合贫瘠土壤，但不同物种的叶形和刺性差异很大，选购或栽培时通常需要确认具体的species（物种）。"]}
{"word":"hakeem","summary":{"en":"Hakeem is most commonly a male name meaning “wise,” and it can also refer to a wise person or (in some places) a physician or judge.","zh":"Hakeem 最常见是男性名字，含“睿智”之意；在某些语境里也可指智者，或（在一些地区）传统医生、法官等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (often of Arabic origin), meaning “wise” or “learned.”","zh":"男性名字（多见于阿拉伯语系文化），常含“睿智的、博学的”之意。"},"examples":[{"en":"Hakeem is my cousin’s name.","zh":"Hakeem 是我表弟的名字。"},{"en":"She named her son Hakeem because it means “wise.”","zh":"她给儿子取名 Hakeem，因为它有“睿智”的意思。"}]},{"partOfSpeech":"n.","definition":{"en":"(also spelled hakim) a wise person; in some cultures, a physician or a judge/ruler.","zh":"（也拼作 hakim）智者；在一些文化中也可指医生或法官/统治者。"},"examples":[{"en":"In some communities, the local hakeem was respected for his medical knowledge.","zh":"在一些社区里，当地的 hakeem 因医学知识而受人敬重。"},{"en":"Historically, a hakim could also serve as a judge.","zh":"历史上，hakim 也可能担任法官。"}]}],"synonyms":["Hakim","wise man","sage","physician"],"phonetic":"/hɑːˈkiːm/","extraExplanation":["“Hakeem”常见于英语世界对阿拉伯语名字/称号“ḥakīm（حكيم）”的音译写法，核心含义与“智慧、学识”相关。不同地区语境里，它既可能只是人名，也可能指传统医学从业者或有威望的智者。","在美国文化中，很多人会因为 NBA 球星 Hakeem Olajuwon 而熟悉这个名字。"]}
{"word":"hakeems","summary":{"en":"“Hakeems” is the plural of “hakeem,” meaning traditional doctors (often Unani practitioners) or, less commonly, wise men.","zh":"“hakeems”是“hakeem”的复数，主要指传统医生（常见为尤那尼医学医师），也可指智者（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hakeem: a traditional doctor (especially one practicing Unani medicine) in South Asia or the Middle East.","zh":"hakeem 的复数：指传统医生（尤指行医于尤那尼医学体系的医师），常见于南亚或中东地区。"},"examples":[{"en":"In the village, people often visit hakeems for herbal remedies.","zh":"在村里，人们常去找 hakeems 开草药方。"},{"en":"The family consulted both a hospital doctor and local hakeems.","zh":"这家人既咨询了医院医生，也请教了当地的 hakeems。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of hakeem: a wise person; a sage (less common in everyday English).","zh":"hakeem 的复数：智者、贤人（在日常英语中较少见）。"},"examples":[{"en":"In old stories, hakeems are shown as calm advisers to kings.","zh":"在古老故事里，hakeems 常被描写成国王身边沉稳的谋士。"}]}],"synonyms":["traditional healer","Unani doctor","physician","sage"],"phonetic":"/hɑːˈkiːm/","extraExplanation":["“hakeem / hakim”源自阿拉伯语 **ḥakīm**（حكيم），本义与“智慧、判断、医术”相关，因此既可指“智者”，也常指“医者”。在印度、巴基斯坦等地，“Hakeem”尤其常用来称呼从事尤那尼医学（Unani）的传统医师。"]}
{"word":"hakenkreuz","summary":{"en":"Hakenkreuz is a German word for the swastika, commonly referring to the Nazi symbol.","zh":"Hakenkreuz 是德语“卐字/万字”，常特指纳粹德国的卐字标志。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German word meaning “swastika,” especially referring to the swastika used as a symbol of Nazi Germany.","zh":"德语词，意为“卐字/万字”，但常特指纳粹德国使用的卐字标志（纳粹卐字）。"},"examples":[{"en":"In the museum, the exhibit explains how the Hakenkreuz became associated with Nazi ideology.","zh":"在博物馆里，展览解释了“Hakenkreuz（纳粹卐字）”如何与纳粹意识形态联系在一起。"},{"en":"German law restricts public display of the Hakenkreuz in many contexts.","zh":"在德国法律中，许多场合对公开展示“Hakenkreuz（纳粹卐字）”有限制。"}]}],"synonyms":["swastika","Nazi swastika"],"phonetic":"/ˈhɑkənˌkrɔɪts/","extraExplanation":["“Hakenkreuz”直译接近“钩十字”（haken=钩子，Kreuz=十字）。在英语里更常用的词是“swastika”。需要注意：在许多文化与宗教（如印度教、佛教、耆那教）中，卐字符号历史悠久，含义多与吉祥、太阳或祝福有关；但在西方语境里，“Hakenkreuz”通常指纳粹使用的版本，因此带有强烈的仇恨与极端主义联想。","在德国、奥地利等国家，公开传播或展示纳粹标志在很多情况下是违法的（通常会对教育、艺术、新闻报道等有例外）。写作或讨论时，最好明确语境，避免把宗教/传统符号与纳粹标志混为一谈。"]}
{"word":"hakenkreuzler","summary":{"en":"A German term meaning a Nazi or supporter of Nazism (literally, “swastika person”), used mainly in historical contexts.","zh":"德语词，指纳粹分子或纳粹主义支持者（字面义为“卍字的人”），主要见于历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Nazi or supporter of Nazism; literally, “swastika person.” (This term is German and is sometimes used in English historical writing, often with a strongly negative tone.)","zh":"纳粹分子；纳粹主义的支持者；字面义为“卍字（纳粹标志）的人”。（德语词，英语历史语境中偶见，语气强烈贬义。）"},"examples":[{"en":"The memoir describes how local Hakenkreuzler intimidated their neighbors during the 1930s.","zh":"这部回忆录描述了上世纪30年代当地的纳粹分子如何恐吓邻里。"},{"en":"In serious writing, it’s usually clearer to say “Nazi” rather than using the German word Hakenkreuzler.","zh":"在严肃写作中，一般直接说“Nazi（纳粹）”比使用德语词 Hakenkreuzler 更清晰。"}]}],"synonyms":["Nazi","Nazism supporter","fascist (broader)"],"phonetic":"ˈhɑkənˌkrɔɪtslər","extraExplanation":["这是德语合成词：Hakenkreuz（“卍字/万字”，纳粹使用的“勾十字”标志）+ -ler（表示“某类人/从事者”的后缀，相当于英语 -er）。","该词带有强烈历史与政治指向，常用于二战研究、回忆录或反纳粹语境中；在日常英语里非常少见，也可能被认为刺耳或挑衅，通常用更常见的 Nazi 来表达更合适。","关于符号本身：在纳粹之前，swastika（卍）在多种亚洲宗教与文化中是吉祥符号；纳粹使用的版本与其意识形态紧密相关，因此在西方语境中高度敏感。"]}
{"word":"hakes","summary":{"en":"“Hakes” most commonly means more than one hake (a white ocean fish). Much rarer: it can be a verb form in old/archaic English.","zh":"“hakes”最常见的意思是多条无须鳕（白肉海鱼）的复数；更少见的是旧/古义中可作动词形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hake: a type of ocean fish (cod family) often eaten as white fish.","zh":"hake 的复数：无须鳕（一类海鱼，鳕形目/鳕鱼近亲），常作为白肉鱼食用。"},"examples":[{"en":"The market had fresh hakes on ice.","zh":"市场里有新鲜的无须鳕，放在冰上保鲜。"},{"en":"We grilled hakes with lemon and herbs.","zh":"我们把无须鳕配柠檬和香草烤着吃。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of hake (rare/old-fashioned): to hack or cough roughly; to cut roughly (archaic).","zh":"hake 的第三人称单数（少见/旧用）：粗声咳嗽；粗略地砍削（古义）。"},"examples":[{"en":"Old texts describe a sailor who hakes and spits after a storm.","zh":"一些旧文本会描写：水手在暴风雨后粗咳并吐痰。"},{"en":"In archaic usage, a tool hakes through tough wood.","zh":"在古义中，工具会“粗砍”穿过坚硬的木头。"}]}],"synonyms":["hake (fish)","whitefish (general category)"],"phonetic":"/heɪks/","extraExplanation":["“hake”（无须鳕）在英语里更常见于餐饮与海鲜语境，常被当作价格较亲民的“白肉鱼”使用。","拼写上容易与“hacks”（砍、黑客/小把戏等）混淆；日常英语里你更可能遇到 hake/hakes 作为鱼类名称。"]}
{"word":"hakhamim","summary":{"en":"Jewish sages and rabbinic scholars (plural).","zh":"犹太传统中的贤者与拉比学者（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Judaism) sages or rabbinic scholars; the learned authorities of Jewish law and tradition (plural of “hakham”).","zh":"（犹太教）贤者、拉比学者；指精通犹太律法与传统的权威人物（为 hakham 的复数）。"},"examples":[{"en":"In some Sephardic communities, the hakhamim guided both religious practice and community decisions.","zh":"在一些塞法迪（Sephardic）社群中，hakhamim 不仅指导宗教实践，也参与社群决策。"},{"en":"The text quotes earlier hakhamim to support its interpretation of Jewish law.","zh":"这部文本引用早期的 hakhamim 来支持它对犹太律法的诠释。"},{"en":"Students studied under the hakhamim for years before teaching on their own.","zh":"学生常在 hakhamim 门下学习多年，之后才独立授课。"}]}],"synonyms":["sages","rabbis","scholars","wise men"],"phonetic":"/hɑːxɑːˈmiːm/","extraExplanation":["这个词在英语里多见于讨论犹太经典、拉比文献（如《塔木德》传统）或塞法迪社群语境。与一般英语的 “rabbis” 相比，hakham/hakhamim 更强调“学识与智慧”的身份，也常带有特定传统（尤其塞法迪/米兹拉希社群）的文化色彩。"],"etymology":"源自希伯来语 חכמים（ḥakhamim，“智者们/贤者们”），为 חכם（ḥakham，“智者；学者；拉比”）的复数形式。词根与“智慧”相关，在犹太传统中常用来指代律法与经典的学术权威。","mnemonic":["把它记成“ha + khamim”：中间的 kh 像在发“哈—（喉音）—咪姆”，联想到希伯来语常见的喉音字母。","联想中文“哈（ha）+ 学（kham≈学者）+ 们（-im 复数）”：=“学者们/贤者们”。"]}
{"word":"Hakim","summary":{"en":"a male name; in some contexts, a judge/ruler or a traditional doctor","zh":"男性名字；在部分语境中指法官/统治者或传统医师"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man’s name of Arabic origin; also used as a title in some cultures","zh":"阿拉伯语来源的男性名字；在一些文化中也可作头衔使用"},"examples":[{"en":"Hakim moved to Chicago for graduate school.","zh":"哈基姆去芝加哥读研究生了。"},{"en":"In the story, Hakim is a respected elder in the village.","zh":"在故事里，哈基姆是村里受人尊敬的长者。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Arabic and some Islamic historical contexts) a ruler, governor, or judge; more broadly, a wise authority figure","zh":"（阿拉伯语及部分伊斯兰历史语境）统治者、地方长官或法官；也可泛指“贤者/权威人士”"},"examples":[{"en":"The hakim settled disputes between families.","zh":"这位哈基姆（法官/裁决者）调解了家族纠纷。"},{"en":"Historical records mention a hakim appointed to oversee the city.","zh":"史料提到一位被任命来管理这座城市的哈基姆（长官）。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asian usage, from Arabic) a practitioner of traditional medicine; sometimes used to mean “doctor”","zh":"（南亚用法，源自阿拉伯语）传统医学医师；有时也泛指“医生”"},"examples":[{"en":"They visited a local hakim for herbal treatment.","zh":"他们去找当地的哈基姆（草药医师）治疗。"},{"en":"My grandfather still calls the neighborhood doctor “hakim.”","zh":"我爷爷至今还把社区医生叫作“hakim”。"}]}],"synonyms":["judge","ruler","governor","wise man","physician","doctor"],"phonetic":"/həˈkiːm/","extraExplanation":["英文里 **Hakim** 既常见作人名，也会在历史、宗教或地区文化描写中以普通名词出现（如“法官/长官/传统医师”）。阅读时可根据上下文判断是“名字”还是“职业/头衔”。"],"etymology":"源自阿拉伯语 **ḥakīm**，本义与“智慧、明智”相关，来自词根 **ḥ-k-m**（与“判断、裁决、治理”有关）。因此在不同地区与历史语境中可指“贤者、法官/裁决者、统治者”，并在南亚进一步发展出“传统医师/医生”的用法。","mnemonic":["联想中文“哈”=哈哈（聪明机智）+“kim/kim”像“King（国王）”→ 聪明的王/裁决者：对应“贤者、统治者/法官”。","看到 **hakim** 可想成“has a keen mind（头脑敏锐）”→ 与“智慧、裁决”相关。"]}
{"word":"hakim","summary":{"en":"Hakim most commonly means a judge in Islamic/Muslim legal contexts; in South Asia it can also mean a traditional Unani doctor. It is also used as a name meaning “wise” or “judge/ruler.”","zh":"Hakim 最常指伊斯兰/穆斯林法律语境中的法官；在南亚也可指传统的尤那尼医学医师。它也常作人名，含“智慧的”或“审判者/统治者”之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in many Muslim-majority countries) a judge, especially one who applies Islamic law (Sharia).","zh":"（在许多穆斯林为主的国家）法官，尤指依照伊斯兰法（沙里亚）审理案件的法官。"},"examples":[{"en":"The case was decided by a hakim in the local court.","zh":"这个案子由当地法院的一位hakim（法官）裁决。"},{"en":"In some systems, a hakim may handle family-law disputes.","zh":"在某些法律体系中，hakim 可能处理家庭法纠纷。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asia) a traditional doctor, especially one using Unani (Greco-Arab) medicine.","zh":"（南亚）传统医师，尤指行尤那尼医学（希腊—阿拉伯医药体系）的医生。"},"examples":[{"en":"Her grandfather consulted a hakim for herbal remedies.","zh":"她的祖父去找hakim 开草药方。"},{"en":"Some people use both a clinic and a hakim for different health needs.","zh":"有些人会同时去诊所和找hakim，以满足不同的健康需求。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name or title meaning “wise” or “ruler/judge,” found in Arabic and related cultures (e.g., Hakim, Al-Hakim).","zh":"人名或称号，源自阿拉伯语，含“智慧的/统治者/审判者”之意（如 Hakim、Al-Hakim）。"},"examples":[{"en":"Hakim is a common given name in many Arabic-speaking communities.","zh":"Hakim 在许多阿拉伯语社群中是常见的名字。"}]}],"synonyms":["judge","magistrate","qadi","physician (traditional)","healer"],"phonetic":"/hɑːˈkiːm/","extraExplanation":["“Hakim”来自阿拉伯语词根 ح-ك-م（与“判断、裁决、智慧”相关）。因此它既可以指“审判者/法官”，也常延伸出“智者”的含义。","在南亚语境里，hakim 常与尤那尼医学（Unani）联系在一起；不同地区的用法可能更偏“传统医师”，不一定等同于现代医学体系中的“doctor”。"]}
{"word":"hakims","summary":{"en":"Hakims are Muslim judges, or (in South Asia) traditional doctors/healers; “hakims” is the plural.","zh":"Hakims 是 hakim 的复数：可指伊斯兰法官；也可（在南亚语境中）指传统医生/医师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim judge, especially one who decides cases under Islamic law (Sharia)","zh":"（尤指依据伊斯兰法/沙里亚裁决案件的）伊斯兰法官、法学法官"},"examples":[{"en":"In the past, local disputes were often settled by hakims in the community.","zh":"过去，社区里的纠纷常常由哈基姆（伊斯兰法官）来调解裁决。"},{"en":"The hakim listened to both sides before giving a decision.","zh":"哈基姆在作出裁决前先听取了双方陈述。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asia) a traditional doctor or healer, especially one using Unani medicine","zh":"（南亚）传统医生/医师（尤指行尤那尼医学的人）"},"examples":[{"en":"She visited a hakim for herbal treatment.","zh":"她去找一位哈基姆（传统医师）做草药治疗。"},{"en":"Some families still consult hakims for everyday illnesses.","zh":"有些家庭遇到常见小病仍会咨询哈基姆（传统医师）。"}]}],"synonyms":["judge","magistrate","Islamic judge","healer","traditional doctor"],"phonetic":"/həˈkiːm/","extraExplanation":["“Hakim”一词源自阿拉伯语，原意与“智慧、贤明”相关，因此在不同地区既可指“法官/裁判者”，也可指“医者/智者”。","在英语语境中，若谈法律与宗教制度，多指“伊斯兰法官”；若谈南亚社会与传统医疗（如 Unani），则常指“传统医生”。阅读时可根据上下文判断。","复数形式是 hakims（也可见到更贴近阿拉伯语的复数写法，但英语里通常用 -s）。"]}
{"word":"hakka","summary":{"en":"Hakka refers to a Chinese ethnic subgroup and their language, and it can also describe anything related to Hakka culture.","zh":"Hakka 指客家人及其语言（客家话），也可作形容词表示与客家文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese ethnic subgroup traditionally associated with migration and a distinct language/dialect (Hakka), found mainly in southern China and many overseas Chinese communities","zh":"客家人：华人的一个族群，传统上以迁徙历史与独特语言/方言（客家话）著称，主要分布在中国南方及海外华人社区"},"examples":[{"en":"My neighbor is Hakka, and her family cooks amazing preserved vegetables.","zh":"我的邻居是客家人，她家做的梅菜（腌制蔬菜）特别好吃。"},{"en":"Many Hakka communities can be found in Guangdong, Fujian, and Taiwan.","zh":"在广东、福建和台湾都能找到许多客家人聚居的社区。"}]},{"partOfSpeech":"n.","definition":{"en":"the Hakka language (often considered a variety of Chinese), spoken by Hakka people","zh":"客家话：客家人使用的语言（常被视为汉语的一种方言/语支）"},"examples":[{"en":"Her grandparents speak Hakka at home.","zh":"她的祖父母在家里说客家话。"},{"en":"I can understand some Hakka, but I’m not fluent.","zh":"我能听懂一点客家话，但不算流利。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Hakka people, language, or culture","zh":"客家的：与客家人、客家话或客家文化相关的"},"examples":[{"en":"We tried Hakka-style stuffed tofu for dinner.","zh":"晚餐我们吃了客家风味的酿豆腐。"},{"en":"The museum has a Hakka cultural exhibition this month.","zh":"博物馆这个月有客家文化展。"}]}],"synonyms":["Hakka people","the Hakka language","Keja (less common romanization)"],"phonetic":"/ˈhɑːkɑː/","extraExplanation":["“Hakka”来自粤语/客家相关读音，对应汉字“客家”，字面意思类似“客人/外来者的家族”，反映了历史上多次迁徙与在新地方定居的经历。","常见文化关联：客家围屋/土楼（防御性聚落建筑）、客家山歌，以及客家菜（如酿豆腐、梅菜扣肉等）。这些在英语语境中常作为文化介绍出现。","用法提示：英语中可说“a Hakka person”“Hakka people”“the Hakka language”。描述文化时常用形容词：Hakka culture / Hakka cuisine / Hakka music。"]}
{"word":"hako","summary":{"en":"Hako is a Japanese loanword meaning “box/container,” used mainly in Japan-related contexts.","zh":"hako 是日语外来用法，意思是“箱子/盒子（容器）”，多用于日本相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Japanese) a box; a container or case, especially when talking about Japanese items, packaging, or slang in anime/game communities.","zh":"（源自日语）箱子；容器/盒子，常用于谈论日本物品、包装，或动漫/游戏圈的说法。"},"examples":[{"en":"Put the tea cups back in the hako when you finish.","zh":"用完茶杯后把它们放回盒子（hako）里。"},{"en":"The figurine came in a beautiful hako with gold letters.","zh":"这个手办装在一个印着金色字母的精美盒子（hako）里。"},{"en":"In some communities, people say “hako” to mean the product box or packaging.","zh":"在一些圈子里，人们会用“hako”来指产品的盒子或外包装。"}]}],"synonyms":["box","container","case","packaging"],"phonetic":"/ˈhɑkoʊ/","extraExplanation":["“hako（はこ）”在日语里通常写作「箱」，就是“箱子/盒子”的意思。英语里它不是常见词，更多出现在与日本文化相关的语境中（如动漫、手办、和风商品、包装开箱等）。如果你想用更自然的英文表达，多数情况下直接说 box / packaging 即可。"]}
{"word":"haku","summary":{"en":"Haku is most often a Japanese name in English contexts; it can also be the romanized Japanese verb meaning “to put on (shoes/pants)” and, in another kanji, “to spit.”","zh":"Haku 在英语里最常见是日语人名；它也可能是日语动词的罗马字：常指“穿（鞋/裤子等）”，在另一个汉字写法下也可指“吐出/吐痰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese given name, often seen in pop culture (for example, character names).","zh":"日语人名，在流行文化中很常见（例如角色名）。"},"examples":[{"en":"Haku is a character in the film Spirited Away.","zh":"Haku 是电影《千与千寻》中的一个角色。"},{"en":"Her son’s Japanese name is Haku.","zh":"她儿子的日文名字是 Haku。"}]},{"partOfSpeech":"vt.","definition":{"en":"(from Japanese “haku”) to put on or wear items worn on the lower body (such as pants, shoes, socks).","zh":"（源自日语“haku”）穿上/穿着下半身的衣物或鞋袜（如裤子、鞋子、袜子）。"},"examples":[{"en":"In Japanese, you use haku for shoes and pants.","zh":"在日语里，说“穿鞋、穿裤子”会用 haku。"},{"en":"He learned how to say “put on your shoes” using the verb haku.","zh":"他学会了用 haku 来说“穿上你的鞋”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(from Japanese “haku”) to spit (less common for learners; context-dependent).","zh":"（源自日语“haku”）吐出/吐痰（对学习者来说较少用，需看语境）。"},"examples":[{"en":"Some dictionaries also list haku as “to spit.”","zh":"一些词典也会把 haku 释义为“吐出/吐”。"}]}],"synonyms":["(name) —","(Japanese verb) put on/wear (lower-body items)","(Japanese verb) spit"],"phonetic":"/ˈhɑːkuː/","extraExplanation":["日语里“haku”常对应不同汉字：\n- 履く：多指穿“鞋、袜、裤子”等下半身穿戴物。\n- 吐く：指“吐出”（如吐气、呕吐、吐痰等）。\n同样读音在日语里很常见，具体含义要看写法（汉字）和语境。","英语环境中看到“Haku”时，更多是作为专有名词（人名/角色名）出现；当作动词用时通常是在学习日语或讲解日语语法的语境中。"]}

