{"word":"HAM","summary":{"en":"“Ham” most commonly means cured pork (a type of meat). It can also mean an overly dramatic performer, the act of exaggerating for attention, or an amateur radio operator.","zh":"“ham”最常见指“火腿”（腌制/熏制的猪肉）。也可指“表演夸张的人”、动词“故意夸张表演”，或指“业余无线电爱好者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"meat from the upper part of a pig’s leg, usually cured (salted/smoked) and eaten cold or cooked.","zh":"（猪的）火腿；通常指腌制/熏制后的猪后腿肉，可冷食或加热食用。"},"examples":[{"en":"We had ham and eggs for breakfast.","zh":"我们早餐吃了火腿和鸡蛋。"},{"en":"This sandwich comes with ham, cheese, and lettuce.","zh":"这个三明治有火腿、奶酪和生菜。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who acts in an exaggerated, overly dramatic way (often for attention).","zh":"（表演）夸张的人；爱“用力过猛”表演的人（常带调侃）。"},"examples":[{"en":"He’s a bit of a ham on stage, but the audience loves it.","zh":"他在舞台上有点夸张，但观众很买账。"},{"en":"Don’t be such a ham—just smile naturally for the photo.","zh":"别那么夸张——拍照自然一点就好。"}]},{"partOfSpeech":"v.","definition":{"en":"to act or behave in an exaggerated, theatrical way; to “play to” an audience.","zh":"夸张表演；故意做作地表现（讨好观众/博关注）。"},"examples":[{"en":"The kids hammed it up when they saw the camera.","zh":"孩子们一看到镜头就开始夸张卖萌。"},{"en":"He always hams up his stories to make people laugh.","zh":"他总把故事讲得很夸张来逗大家笑。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who uses amateur radio as a hobby.","zh":"业余无线电爱好者（火腿/“ham”电台爱好者）。"},"examples":[{"en":"My uncle is a ham who talks to people around the world on his radio.","zh":"我叔叔是个业余无线电爱好者，会用电台和世界各地的人聊天。"}]}],"synonyms":["(meat) cured pork","(person) show-off","(verb) exaggerate","(verb phrase) ham it up","(radio) amateur radio operator"],"phonetic":"/hæm/","extraExplanation":["“ham”表示“夸张表演的人/行为”常用于口语，常见搭配是 **ham it up**（故意夸张、卖力表演），语气多为轻松调侃。","“ham radio”（业余无线电）里的“ham”来源说法不止一种，常见解释是早期对业余爱好者的昵称，后来被广泛接受为正式用法。"]}
{"word":"ham","summary":{"en":"Ham commonly means cured pork (food), and it can also mean acting in an exaggerated way; in radio, a “ham” is an amateur radio operator.","zh":"ham最常见是“火腿”；也可指“夸张表演”；在无线电领域，ham指“业余无线电爱好者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Meat from the upper part of a pig’s leg, usually cured (salted/smoked) and eaten sliced or cooked.","zh":"火腿；猪后腿（上部）的肉，通常经过腌制或熏制后食用。"},"examples":[{"en":"I made a ham sandwich for lunch.","zh":"我午餐做了一个火腿三明治。"},{"en":"This soup tastes great with a little ham in it.","zh":"这汤里加一点火腿很好吃。"}]},{"partOfSpeech":"v.","definition":{"en":"To perform in an exaggerated, overly dramatic way (often to get attention), especially in acting.","zh":"夸张表演；装腔作势（常指为了吸引注意，尤其在表演时）。"},"examples":[{"en":"He kept hamming it up for the camera.","zh":"他一直对着镜头夸张表演、故意作秀。"},{"en":"Don’t ham it up during the presentation—keep it natural.","zh":"演示时别太夸张，保持自然就好。"}]},{"partOfSpeech":"n.","definition":{"en":"An amateur radio operator (short for “ham radio”).","zh":"业余无线电爱好者（“ham radio”的简称）。"},"examples":[{"en":"My grandpa is a ham who talks to people around the world.","zh":"我爷爷是个业余无线电爱好者，会和世界各地的人通话。"}]}],"synonyms":["cured pork","overact","play to the camera","amateur radio operator"],"phonetic":"/hæm/","extraExplanation":["“ham it up”是常见搭配，意思是“表演得很夸张/很做作”，语气通常带一点调侃或批评。","“ham radio”指业余无线电通信。这里的“ham”并不是“火腿”的意思，而是历史上形成的称呼。"]}
{"word":"ham-fisted","summary":{"en":"clumsy; lacking skill or finesse","zh":"笨拙的；缺乏技巧或细腻处理"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clumsy and awkward, especially in the way someone uses their hands or handles a task; lacking subtlety or skill.","zh":"（做事或用手）笨拙的、不得要领的；不够细腻、缺乏技巧的。"},"examples":[{"en":"His ham-fisted attempt to fix the watch made it worse.","zh":"他笨手笨脚地修表，结果越修越糟。"},{"en":"The report criticizes the government’s ham-fisted response to the protests.","zh":"这份报告批评政府对抗议的粗暴、不得法的应对。"}]}],"synonyms":["clumsy","awkward","heavy-handed","inept","bungling"],"phonetic":"/ˌhæmˈfɪstɪd/","extraExplanation":["语气通常带批评或嘲讽：既可指“手不灵巧”（字面动作笨），也常引申为“做事方式粗糙、缺乏分寸/技巧”（如政策、沟通、管理）。","常见搭配：ham-fisted attempt/approach/handling/response（笨拙的尝试/方式/处理/回应）。"],"etymology":"源自“ham”（火腿）+ “fisted”（握拳的）。比喻手像“火腿”一样又大又笨，做精细活不灵巧；20世纪英语中常用来形容动作粗笨或处理方式不够圆滑。","mnemonic":["把 ham 想成“火腿肠/大肉块”，手变得又大又笨——做细活就“ham-fisted（笨手笨脚）”。","联想中文：像“拿着火腿当手”去拧螺丝——怎么可能灵巧？"]}
{"word":"hamacratic","summary":{"en":"“hamacratic” is not a standard English word; it’s likely a misspelling (often of “democratic”).","zh":"“hamacratic” 不是标准英语单词；很可能是拼写错误（常见是 “democratic” 的误拼）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a mistaken form of another word (often “democratic”).","zh":"不是标准英语单词；很可能是拼写错误或误写（常见是把 “democratic” 写错）。"},"examples":[{"en":"“Hamacratic” isn’t found in standard dictionaries—did you mean “democratic”?","zh":"“hamacratic” 在常见词典里查不到——你是不是想写 “democratic”？"},{"en":"If you share the sentence you saw it in, I can help identify the intended word.","zh":"如果你把它出现的句子发出来，我可以帮你判断原本想表达的词。"}]}],"synonyms":["democratic","representative","popular"],"phonetic":"/ˌhæməˈkrætɪk/","extraExplanation":["“democratic”（/ˌdɛməˈkrætɪk/）意思是“民主的；民主政体的；符合民主原则的”。如果你的意思接近“由人民决定、大家投票、代表制”这类概念，通常用它。","也可能是你在输入法/听写时把开头的字母写错了。给我上下文（前后各一两句），我可以更准确地确认你想表达的是哪个词，并给出正确拼写与用法。"]}
{"word":"hamada","summary":{"en":"Hamada most commonly means a rocky, flat desert plateau with little sand; it can also be a personal name/surname in some cultures.","zh":"“Hamada”最常见指少沙、多岩石的平坦荒漠（常为高原）；也可作某些文化中的人名/姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rocky, flat desert area (often a high plateau) with very little sand, common in the Sahara and other deserts","zh":"（地理）岩石荒漠；多岩石、少沙的平坦沙漠地区（常为高原），常见于撒哈拉等地"},"examples":[{"en":"After days of dunes, the travelers reached a hamada covered with dark stones.","zh":"穿越了好几天沙丘后，旅行者到达了一片铺满黑色石块的岩石荒漠。"},{"en":"Plants are scarce on a hamada because there is little soil and water.","zh":"岩石荒漠上植物稀少，因为土壤和水分都很少。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name or family name in some cultures (e.g., Arabic or Japanese)","zh":"（人名）在一些文化中使用的名字或姓氏（如阿拉伯语或日语文化中）"},"examples":[{"en":"Mr. Hamada will speak at the conference tomorrow.","zh":"滨田先生明天将在会议上发言。"},{"en":"Hamada is a common surname in Japan.","zh":"“Hamada（滨田）”在日本是比较常见的姓氏。"}]}],"synonyms":["rocky desert","desert plateau","reg"],"phonetic":"/həˈmɑːdə/","extraExplanation":["“hamada”（地理义）来自阿拉伯语，常用来描述北非沙漠中“石头多、沙子少”的荒漠地形；与沙丘（dunes）形成对比。地理写作中有时会与“erg（沙海/沙丘区）”“reg（砾漠）”一起出现，用来区分不同类型的沙漠地表。"]}
{"word":"Hamadan","summary":{"en":"a historic city in western Iran","zh":"伊朗西部的一座历史名城"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in western Iran, known for its long history and as the modern area of ancient Ecbatana.","zh":"伊朗西部的一座城市，以悠久历史著称；其所在地区与古代的埃克巴坦那（Ecbatana）有关。"},"examples":[{"en":"Hamadan is one of Iran’s oldest cities, with a history that goes back thousands of years.","zh":"哈马丹是伊朗最古老的城市之一，历史可追溯到数千年前。"},{"en":"Many travelers visit Hamadan to learn about ancient Persian history and local culture.","zh":"许多旅行者去哈马丹了解古波斯历史与当地文化。"}]}],"synonyms":["Ecbatana"],"phonetic":"/ˈhɑːməˌdɑːn/","extraExplanation":["发音要点：重音通常在第一音节 HA-。英文中常见拼写为 Hamadan，也可能见到 Hamedan 这种转写差异（主要来自不同的罗马字母转写系统）。","文化/历史提示：哈马丹常被认为与古代米底王国的重要都城埃克巴坦那有关，因此在历史与考古语境中出现频率较高。"],"etymology":"源自波斯语地名传统写法；在古希腊文献中常与古名 Ecbatana（埃克巴坦那）相关联，后在英语中固定拼写为 Hamadan。","mnemonic":["联想“哈马丹”≈“哈（ha）-马（ma）-丹（dan）”，按中文音节分三段记拼写：Ha-ma-dan。","把结尾 -dan 记成“丹”，帮助记住最后是 d-a-n，而不是 -den。"]}
{"word":"hamadan","summary":{"en":"Hamadan is a historic city in western Iran, sometimes linked with ancient Ecbatana.","zh":"Hamadan 是伊朗西部一座历史悠久的城市，有时被认为与古代的 Ecbatana（埃克巴坦那）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in western Iran, known for its long history and as a regional cultural and economic center.","zh":"哈马丹（伊朗西部城市），历史悠久，是当地重要的文化与经济中心。"},"examples":[{"en":"Hamadan is one of Iran’s oldest cities.","zh":"哈马丹是伊朗最古老的城市之一。"},{"en":"They traveled from Tehran to Hamadan by bus.","zh":"他们坐大巴从德黑兰去哈马丹。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) the area identified with ancient Ecbatana, an important city in ancient Media and later Persian empires.","zh":"（历史）常与古代埃克巴坦那（Ecbatana）相联系的地区；在米底王国及后来的波斯帝国时期非常重要的城市。"},"examples":[{"en":"Some historians link Hamadan with ancient Ecbatana.","zh":"一些历史学家认为哈马丹与古代埃克巴坦那有关联。"},{"en":"The story mentions Ecbatana, often associated with modern Hamadan.","zh":"故事中提到埃克巴坦那，人们常把它与今天的哈马丹联系起来。"}]}],"synonyms":["Ecbatana (historical)"],"phonetic":"/ˌhæməˈdɑːn/","extraExplanation":["“Hamadan”是英文对波斯语地名“همدان”的常见拼写。","哈马丹在古代史中常被提到，尤其是与“Ecbatana（埃克巴坦那）”的对应关系；在一些希腊与古波斯相关记载里也会出现。","哈马丹以历史遗迹与文化景点闻名，例如阿维森纳（Avicenna，伊本·西那）的陵墓常被游客提及。"]}
{"word":"hamadas","summary":{"en":"“Hamadas” are rocky, stony desert plateaus with little sand.","zh":"“Hamadas”指多岩石、少沙的石质沙漠台地（hamada 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"stony desert plateaus or rocky, barren stretches of desert with little sand (plural of “hamada”)","zh":"（hamada 的复数）石质荒漠台地；多岩石、少沙、植被稀少的荒凉沙漠地带"},"examples":[{"en":"In parts of the Sahara, travelers cross hamadas where sand dunes are rare.","zh":"在撒哈拉的部分地区，旅行者会穿越很少见到沙丘的石质荒漠（hamadas）。"},{"en":"The route avoided the soft dunes and followed the hamadas for firmer ground.","zh":"这条路线避开松软的沙丘，沿着石质荒漠（hamadas）走，因为地面更坚实。"}]}],"synonyms":["rocky desert","stony desert","desert plateau"],"phonetic":"/həˈmɑːdəz/","extraExplanation":["“hamada”一词来自阿拉伯语，常用于地理与地貌描述，尤其是北非与中东沙漠。","沙漠地表常见三类词：erg（以沙丘为主的“沙海”）、reg（砾石覆盖的沙漠地面）、hamada（裸露岩石/石质台地）。hamada 通常更“硬”、更难长植物，但行走时不一定像沙丘那样陷脚。"]}
{"word":"hamadryad","summary":{"en":"A hamadryad is either a tree-bound nymph in Greek mythology or (in older usage) the king cobra.","zh":"hamadryad 指（1）希腊神话中与特定树共生的树精灵；（2）（旧称）眼镜王蛇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a wood nymph whose life is tied to a particular tree; if the tree dies, she dies too.","zh":"（希腊神话）树精灵/林中仙女，生命与某一棵树紧密相连；树死则她也会死。"},"examples":[{"en":"In the myth, the hamadryad begged the traveler not to cut down her tree.","zh":"在神话里，那位树精灵恳求旅人不要砍倒她的树。"},{"en":"The poem describes a hamadryad whispering in the leaves at dusk.","zh":"诗中描写一位树精灵在黄昏时于树叶间低语。"}]},{"partOfSpeech":"n.","definition":{"en":"A name sometimes used for the king cobra, a large highly venomous snake found in South and Southeast Asia.","zh":"（旧称/别称）眼镜王蛇；一种体型很大、毒性很强的蛇，分布于南亚与东南亚。"},"examples":[{"en":"Older books may call the king cobra a “hamadryad.”","zh":"较早的书籍里可能把眼镜王蛇称为“hamadryad”。"},{"en":"The guide warned us that a hamadryad can raise the front of its body high off the ground.","zh":"向导提醒我们，眼镜王蛇能把身体前段高高抬离地面。"}]}],"synonyms":["dryad","tree nymph","king cobra"],"phonetic":"/ˌhæməˈdraɪ.æd/","extraExplanation":["词源来自希腊语：hama（“一起/共同”）+ dryas（“树的仙女/森林女神”）。hamadryad 指“与树共生的树精灵”。","文学里常用 hamadryad 营造“自然有灵、人与森林相互依存”的意象；中文有时译作“树精”“树妖”（偏民间）或“树之仙女”（更中性）。","用来指眼镜王蛇的说法较旧，现代更常直接用 king cobra；在生物学语境里也会见到其学名 Ophiophagus hannah。"]}
{"word":"hamadryades","summary":{"en":"Hamadryades means “hamadryads”: tree nymphs in Greek mythology; rarely, it can also refer to the king cobra in older usage.","zh":"hamadryades 是 hamadryad 的复数：多指希腊神话中与树共生的树精；极少数情况下在旧用法中也指眼镜王蛇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) tree nymphs whose lives are tied to a particular tree; if the tree dies, the nymph dies too.","zh":"（希腊神话）树精／林中仙女，生命与某一棵树相连；树死则精灵也会死。"},"examples":[{"en":"In Greek myths, hamadryades protect the trees they are bound to.","zh":"在希腊神话中，hamadryades 守护与自己绑定的树木。"},{"en":"The poet describes hamadryades whispering in the forest at dusk.","zh":"诗人描写黄昏时分森林里 hamadryades 的低语。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) an older name for the king cobra; also used for a large, dangerous cobra in South Asia.","zh":"（罕见）对“眼镜王蛇”的旧称；也可泛指南亚体型巨大、危险的眼镜蛇。"},"examples":[{"en":"Some older travel writing calls the king cobra a “hamadryad.”","zh":"一些较早的游记会把眼镜王蛇称为 “hamadryad”。"},{"en":"The guide warned us about a hamadryad near the trail, meaning a king cobra.","zh":"向导提醒我们小径附近有“hamadryad”，指的就是眼镜王蛇。"}]}],"synonyms":["hamadryads","tree nymphs","dryads (related)"],"phonetic":"/ˌhæməˈdraɪəˌdiːz/","extraExplanation":["“hamadryades”是“hamadryad”的复数形式，带有古典/文学色彩；更常见的英语复数是“hamadryads”。","词源来自希腊语：hama-（一起、共同）+ dryas（树之精灵）。其核心概念是“与树共生”。","文学里常用来营造“古老森林、自然有灵”的氛围；现代日常英语中较少见。"]}
{"word":"hamadryads","summary":{"en":"Hamadryads are (1) tree nymphs in Greek mythology, and (2) a kind of tree-dwelling snake in zoology.","zh":"hamadryads可指（1）希腊神话中的树精（树之宁芙），也可指（2）动物学中的一种树栖蛇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, tree nymphs (especially oak-tree nymphs) whose lives are bound to a particular tree.","zh":"（希腊神话）树精；与某一棵树（尤指橡树）生命相连的树之宁芙（女神精灵）。"},"examples":[{"en":"In the myth, a hamadryad would suffer if her tree was harmed.","zh":"在神话里，如果她所依附的树受伤，一位树精也会受苦。"},{"en":"The poem describes hamadryads whispering in the ancient forest.","zh":"这首诗描写古老森林里树精低语。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoology) A type of tree-dwelling snake, especially the African boomslang.","zh":"（动物学）树栖蛇的一种；尤指非洲的树蛇（boomslang）。"},"examples":[{"en":"The guide warned that the hamadryad snake can be dangerous if disturbed.","zh":"向导警告说，这种树栖蛇若被惊扰可能很危险。"},{"en":"Researchers recorded the hamadryad moving quickly through the branches.","zh":"研究人员记录到这条树栖蛇在树枝间快速穿行。"}]}],"synonyms":["tree nymphs","dryads","nymphs"],"phonetic":"ˌhæməˈdraɪædz","extraExplanation":["“hamadryad”源自希腊语：hama（一起、共同）+ dryas（树之宁芙）。“同树共生”的含义强调：树精的生命与特定树木绑定。","在英语文学中，hamadryads常用来营造“森林有灵”的意象，象征自然之美、脆弱与需要被尊重的生态。"]}
{"word":"hamadryas","summary":{"en":"Hamadryas can refer to a baboon species, a tree nymph in Greek myth, or a genus of tropical butterflies.","zh":"Hamadryas 可指一种狒狒、希腊神话中的树精灵，或一个热带蝴蝶属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a species of baboon (Papio hamadryas) with a long cape-like mane (especially in males), native to the Horn of Africa and parts of Arabia","zh":"狒狒的一种（狒狒属 Papio hamadryas），雄性常有披肩般的长鬃毛，原产于非洲之角及阿拉伯半岛部分地区"},"examples":[{"en":"The hamadryas baboon is known for its striking silver mane.","zh":"哈马狄亚斯狒狒以醒目的银色鬃毛而闻名。"},{"en":"In some regions, hamadryas baboons live in large, complex social groups.","zh":"在一些地区，哈马狄亚斯狒狒生活在规模很大、结构复杂的群体中。"}]},{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) a tree nymph whose life is tied to a specific tree; a hamadryad","zh":"（希腊神话）与某一棵树生命相系的树精灵；树宁芙（hamadryad）"},"examples":[{"en":"In the myth, a hamadryas could not survive if her tree was cut down.","zh":"在神话里，如果那棵树被砍倒，哈马狄亚斯树精灵也无法存活。"},{"en":"The poet described the forest as guarded by a hamadryas.","zh":"诗人描写那片森林由一位哈马狄亚斯树精灵守护。"}]},{"partOfSpeech":"n.","definition":{"en":"a genus of tropical American butterflies, sometimes called “cracker butterflies,” named for the clicking sound some species make","zh":"美洲热带地区的一属蝴蝶（Hamadryas），有时称“爆裂蝶/响声蝶”，因部分种类会发出类似“咔嗒”的响声而得名"},"examples":[{"en":"We spotted a Hamadryas butterfly resting on tree bark, perfectly camouflaged.","zh":"我们看到一只哈马狄亚斯属蝴蝶停在树皮上，伪装得非常好。"}]}],"synonyms":["hamadryas baboon","hamadryad","tree nymph","cracker butterfly"],"phonetic":"/ˌhæməˈdraɪəs/","extraExplanation":["“Hamadryas”这个词在英语里有多重指代：既可指一种狒狒，也可指希腊神话中的“树精灵”，还可指一个蝴蝶属。阅读时要结合上下文判断。","哈马狄亚斯狒狒在古埃及文化中常被描绘与崇敬，相关形象可见于壁画与雕像等艺术作品中。"]}
{"word":"Hamal","summary":{"en":"the brightest star in Aries; also a male given name of Arabic origin meaning “lamb.”","zh":"白羊座最亮的恒星；也可作源自阿拉伯语、意为“羔羊”的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) The brightest star in the constellation Aries; its Bayer designation is Alpha Arietis.","zh":"（天文）白羊座中最亮的恒星；拜耳命名为白羊座α（Alpha Arietis）。"},"examples":[{"en":"Hamal is the brightest star in Aries and is often used in star charts.","zh":"Hamal 是白羊座最亮的恒星，经常出现在星图里。"},{"en":"On a clear autumn night, you can try to spot Hamal near the Aries constellation.","zh":"在晴朗的秋夜，你可以试着在白羊座附近找到 Hamal。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name used in some cultures; originally from Arabic, related to the meaning “lamb.”","zh":"一种男性名字；源自阿拉伯语，含义与“羔羊”相关。"},"examples":[{"en":"His name is Hamal, a name with Arabic roots.","zh":"他叫 Hamal，这是一个有阿拉伯语词源的名字。"},{"en":"They chose the name Hamal because they liked its meaning and sound.","zh":"他们选了 Hamal 这个名字，因为喜欢它的含义和发音。"}]}],"synonyms":["Alpha Arietis","lamb"],"phonetic":"/həˈmɑl/","extraExplanation":["白羊座（Aries）在西方传统里与黄道十二宫有关；Hamal 作为白羊座最亮星，常用于辨认季节星空与基础观星定位。","在英文语境里，Hamal 多作为恒星专名出现；作为人名则相对少见，主要见于与阿拉伯语文化相关的命名。"],"etymology":"源自阿拉伯语 ḥamal（حَمَل），意思与“羊羔/羔羊”相关；作为恒星名，常见于传统星名体系，对应白羊座α（Alpha Arietis）。","mnemonic":["联想“哈”+“mal（像‘毛’的音）”：白羊座的星名，和“羊毛”有关→更好记住它和“羊/白羊座”相关。"]}
{"word":"hamal","summary":{"en":"Hamal means a porter who carries goods or luggage (often in the Middle East/South Asia). It can also refer to Hamal, the brightest star in Aries (Alpha Arietis).","zh":"hamal 指（尤指中东/南亚的）搬运工；也可指天文中的 Hamal 星，即白羊座最亮的恒星（娄宿三，白羊座α星）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a porter or laborer (especially in the Middle East or South Asia) hired to carry goods or luggage","zh":"（尤指中东或南亚的）搬运工；受雇搬运行李或货物的人"},"examples":[{"en":"At the station, a hamal carried our suitcases to the taxi stand.","zh":"在车站，一位搬运工把我们的行李搬到出租车候车处。"},{"en":"The merchant paid a hamal to move the heavy sacks into the shop.","zh":"商人付钱请搬运工把沉重的麻袋搬进店里。"}]},{"partOfSpeech":"n.","definition":{"en":"(astronomy) the brightest star in the constellation Aries; Alpha Arietis","zh":"（天文学）白羊座最亮的恒星：娄宿三（Alpha Arietis，英文常称 Hamal）"},"examples":[{"en":"Hamal is a key star used to help locate the constellation Aries.","zh":"Hamal 是用来辨认白羊座的重要恒星之一。"},{"en":"On clear winter nights, you can spot Hamal near the stars of Taurus and Pisces.","zh":"在晴朗的冬夜，你可以在金牛座和双鱼座附近看到 Hamal。"}]}],"synonyms":["porter","baggage carrier","loader"],"phonetic":"/həˈmɑːl/","extraExplanation":["“hamal”源自阿拉伯语 **ḥammāl**，本义与“负载、搬运”有关。在英语里常用于描写中东/南亚市集、车站等场景中的传统职业（搬运工），带有一定地域文化色彩。","作为恒星名的 **Hamal** 也来自阿拉伯天文学传统；在英语天文语境中它通常专指白羊座α星。"]}
{"word":"hamald","summary":{"en":"“hamald” isn’t a standard English word; it is likely the misspelling of **hamal** (a porter).","zh":"“hamald”不是标准英语词；很可能是 **hamal**（搬运工）的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/likely misspelling) If you meant **hamal**, it means a hired porter or baggage carrier, especially in the Middle East or South Asia.","zh":"（非标准拼写／可能拼错）如果你想写的是 **hamal**，意思是“受雇的搬运工、行李搬运者”，多见于中东或南亚语境。"},"examples":[{"en":"At the station, a hamal offered to carry our suitcases for a small fee.","zh":"在车站，一位搬运工提出付点小费就帮我们提行李。"},{"en":"Travel accounts from the 1800s often mention hamals working in busy markets.","zh":"19世纪的旅行记述里常提到在热闹集市工作的搬运工。"}]}],"synonyms":["porter","baggage carrier","bearer"],"phonetic":"/həˈmɑl/","extraExplanation":["**hamal** 一词常见于描写中东/南亚城市生活的英语文本（旅行写作、历史叙述等），带有特定地域文化背景。它源自阿拉伯语/土耳其语等语系中“搬运、负重”的词根。","如果你原本想查的是别的词（例如 **herald**、**harassed** 等），请再发一次正确拼写，我可以按你的目标词解释。"]}
{"word":"hamals","summary":{"en":"“Hamals” is the plural of “hamal,” meaning porters who carry luggage or heavy loads, especially in the Middle East and South Asia.","zh":"“hamals”是“hamal”的复数，指（尤指中东和南亚的）搬运工，负责搬运行李或重物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a porter or laborer (especially in the Middle East or South Asia) who carries luggage or heavy loads for others","zh":"（尤指中东或南亚的）搬运工、挑夫；为他人搬运行李或重物的人"},"examples":[{"en":"At the station, hamals offered to carry our bags to the taxi stand.","zh":"在车站，搬运工主动提出把我们的行李搬到出租车候车点。"},{"en":"The hotel hired a hamal to move supplies from the truck into storage.","zh":"酒店雇了一名搬运工把物资从卡车搬到仓库里。"}]}],"synonyms":["porter","carrier","baggage handler","loader"],"phonetic":"/həˈmɑl/","extraExplanation":["“hamal”源自阿拉伯语 ḥammāl，意为“搬运者/负重者”。这个词在英语里多见于旅行写作、历史文本或描写当地生活的语境中，带有明显的地域色彩。","在现代日常英语中，人们更常用更中性的词如 “porter” 或 “baggage handler”。在描述具体国家或城市的传统职业时用 “hamal” 会更贴切，但在不确定对方是否熟悉该词时，建议先用通用词再补充说明。"]}
{"word":"Hamamelidaceae","summary":{"en":"the witch-hazel plant family","zh":"金缕梅科（女巫榛科）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family of flowering plants known as the witch-hazel family, including witch hazels and related shrubs/trees","zh":"（植物）金缕梅科；被称为“金缕梅/金缕梅属（witch-hazel）”相关植物的一个开花植物科"},"examples":[{"en":"Witch hazel belongs to the family Hamamelidaceae.","zh":"金缕梅（witch hazel）属于金缕梅科（Hamamelidaceae）。"},{"en":"Several ornamental trees in Hamamelidaceae are valued for their winter flowers.","zh":"金缕梅科里有些观赏树因冬季开花而受到喜爱。"}]}],"synonyms":["witch-hazel family"],"phonetic":"/ˌhæməˌmiːlɪˈdeɪsiˌiː/","extraExplanation":["这是植物分类学里的“科（family）”级别名称，常见于学术文章、植物志和园艺资料中；日常英语里更常说“the witch-hazel family（女巫榛/金缕梅科）”。","发音与拼写都偏学术；记住结尾 -aceae 通常读作“AY-see-ee/AY-see-ay”一类的节奏，在很多科名里都会出现（如 Rosaceae）。"],"etymology":"词形来自现代拉丁语的植物科名：Hamamelis（属名，指金缕梅/witch hazel）+ -aceae（“……科”这一植物分类后缀）。","mnemonic":["记法：把它拆成“Hamamelis（金缕梅属）+ -aceae（……科）”，看到 -aceae 就联想到“植物的某某科”。","联想：Hamamelis 常被译作“金缕梅”，所以 Hamamelidaceae ≈ “金缕梅的大家族（科）”。"]}
{"word":"hamamelidaceae","summary":{"en":"Hamamelidaceae is the botanical family of witch-hazels and related plants.","zh":"Hamamelidaceae 指金缕梅科，即金缕梅及其相关植物所属的植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes witch-hazels and related shrubs/trees, many known for fragrant flowers and some used in skincare (e.g., witch-hazel extract)","zh":"金缕梅科：一个植物科，包含金缕梅等相关的灌木或乔木；许多以芳香花朵闻名，部分植物可用于护肤（如金缕梅提取物）"},"examples":[{"en":"Witch-hazel belongs to the family Hamamelidaceae.","zh":"金缕梅属于金缕梅科（Hamamelidaceae）。"},{"en":"Some Hamamelidaceae plants bloom in winter and have a light, sweet smell.","zh":"一些金缕梅科植物会在冬季开花，带有淡淡的甜香。"}]}],"synonyms":["witch-hazel family"],"phonetic":"/ˌhæməˌmɛləˈdeɪsiˌi/","extraExplanation":["“Hamamelidaceae”来自拉丁化的属名“Hamamelis”（金缕梅属）+ 植物科常见后缀“-aceae”（表示“……科”）。","在日常英语里，这个词多出现在植物学、园艺或成分/药妆说明中；更常见的说法是“the witch-hazel family（金缕梅科/金缕梅家族）”。"]}
{"word":"hamamelidaceous","summary":{"en":"An adjective meaning “of the witch-hazel family (Hamamelidaceae).”","zh":"形容词：指“金缕梅科（巫婆榛科）相关的；金缕梅科的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Hamamelidaceae (the witch-hazel family).","zh":"与金缕梅科（Hamamelidaceae，常称“金缕梅/巫婆榛家族”）有关的；金缕梅科的。"},"examples":[{"en":"Witch hazel is a hamamelidaceous plant often used in skincare products.","zh":"金缕梅属于金缕梅科植物，常用于护肤产品中。"},{"en":"The garden includes several hamamelidaceous shrubs that bloom in late winter.","zh":"花园里种了几株金缕梅科灌木，会在冬末开花。"}]}],"synonyms":["of the witch-hazel family","Hamamelidaceae (related)"],"phonetic":"/ˌhæməˌmɛləˈdeɪʃəs/","extraExplanation":["“hamamelidaceous”来自植物科名 Hamamelidaceae（以属名 Hamamelis＝金缕梅/witch hazel 为基础）+ 形容词后缀 -aceous（表示“……类的/……科的”）。在日常英语里不常用，更常见的说法是 “of the witch-hazel family” 或直接说具体植物名（如 witch hazel）。"]}
{"word":"hamamelidanthemum","summary":{"en":"Hamamelidanthemum is an extremely rare botanical term, likely an obscure or outdated genus name connected to the witch-hazel group.","zh":"Hamamelidanthemum 是极少见的植物学术语，多半是较冷僻或已少用的属名，与金缕梅类群有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very rare, technical botanical name (an obscure or largely outdated genus name) referring to a type of flowering plant associated with the witch-hazel group","zh":"一种非常少见的植物学术语（较冷僻或多已少用的属名），指与金缕梅类群有关的一类开花植物"},"examples":[{"en":"The label used the name Hamamelidanthemum, but modern sources often treat it as an outdated classification.","zh":"标签上写着 Hamamelidanthemum，但现代资料往往把它视为较过时的分类。"},{"en":"In older botanical literature, Hamamelidanthemum may appear as a genus name connected to the witch-hazel family.","zh":"在较早的植物学文献中，Hamamelidanthemum 可能作为与金缕梅科相关的属名出现。"}]}],"synonyms":["obsolete genus name (context note)","witch-hazel group (related term)"],"phonetic":"/ˌhæməˌmiːlɪdænˈθiːməm/","extraExplanation":["这个词几乎不出现在日常英语里，主要可能见于旧的植物分类文献、标本标签或数据库条目中。不同资料库对它的地位可能不一致：有的把它当作已弃用（obsolete）的属名，有的会把它并入更常用的属名之下。","词形上可拆成 hamamelid-（与金缕梅类群/金缕梅科有关）+ anthemum/anthe-（与“花”相关的构词成分），整体带有“金缕梅类的花/植物”的字面暗示。若你告诉我它出现的上下文（论文、植物名录、标本信息等），我可以进一步帮你核对它对应的现代接受名（accepted name）。"]}
{"word":"hamamelidin","summary":{"en":"Hamamelidin is a plant compound from witch hazel, often mentioned in skincare and herbal contexts for soothing/anti-inflammatory potential.","zh":"Hamamelidin 是一种来自金缕梅的植物化合物，常见于护肤与草本语境中，因可能具有舒缓/抗炎作用而被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural plant compound found especially in witch hazel (Hamamelis), studied/used for its soothing, anti-inflammatory, and antioxidant effects in skincare and herbal products","zh":"一种天然植物化合物，尤其存在于金缕梅（Hamamelis，witch hazel）中；在护肤与草本制品中常因其舒缓、抗炎与抗氧化作用而被研究或使用"},"examples":[{"en":"Some witch hazel extracts list hamamelidin among their active components.","zh":"一些金缕梅提取物会把 hamamelidin 列为其活性成分之一。"},{"en":"Researchers have investigated hamamelidin for potential anti-inflammatory activity.","zh":"研究人员曾探讨 hamamelidin 可能具有的抗炎活性。"}]}],"synonyms":["witch hazel polyphenol","Hamamelis compound"],"phonetic":"ˌhæməˈmiːlɪdɪn","extraExplanation":["“Hamamelidin”这个词源于植物属名 Hamamelis（即金缕梅、witch hazel）加上常见的化学命名后缀（-in），通常表示“来自某种来源的化合物”。","在成分表中看到它时，多半意味着该产品含有金缕梅来源的多酚类/植物活性物质；但不同提取工艺会影响其含量与效果。"]}
{"word":"hamamelidoxylon","summary":{"en":"Hamamelidoxylon is a genus name used for fossil wood resembling the witch-hazel family (Hamamelidaceae).","zh":"Hamamelidoxylon 是用于指代与金缕梅科相似的化石木材的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for fossilized wood that shows features similar to the witch-hazel family (Hamamelidaceae).","zh":"（古植物学/化石木材学）一种化石木材的属名，指木材结构特征与金缕梅科（witch-hazel family, Hamamelidaceae）相似的化石木材。"},"examples":[{"en":"The specimen was identified as Hamamelidoxylon based on its wood anatomy.","zh":"研究者根据木材解剖结构将该标本鉴定为 Hamamelidoxylon。"},{"en":"Hamamelidoxylon fossils can help reconstruct ancient forests and climates.","zh":"Hamamelidoxylon 的化石有助于重建古代森林与气候。"}]}],"synonyms":["fossil witch-hazel wood (descriptive)"],"phonetic":"ˌhæməˌmiːlɪˈdɑːksɪlɑːn","extraExplanation":["这是一个较专业的拉丁化属名，常见于古植物学论文和博物馆标本标签，而不用于日常英语。","词源上可拆解为 Hamamelid-（指金缕梅科/金缕梅类群）+ -xylon（源自希腊语，意为“木材”）。在化石木材命名中，-xylon 很常见，用来表示“某类植物的木材化石”。"]}
{"word":"hamamelin","summary":{"en":"Hamamelin usually refers to an ingredient from witch hazel used in skincare for soothing and astringent effects.","zh":"Hamamelin 通常指源自金缕梅的护肤成分，常被用于舒缓与收敛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance/extract from witch hazel (Hamamelis), used especially in skin-care products for its soothing and astringent effects","zh":"金缕梅（Hamamelis）中的一种成分/提取物，常用于护肤品，具有舒缓、收敛等作用"},"examples":[{"en":"This toner contains hamamelin to help calm irritated skin.","zh":"这款化妆水含有 hamamelin，有助于舒缓受刺激的皮肤。"},{"en":"Hamamelin is often listed on labels as part of witch hazel extract.","zh":"hamamelin 常在成分表中作为金缕梅提取物的一部分出现。"}]}],"synonyms":["witch hazel extract","Hamamelis extract","astringent (in skincare context)"],"phonetic":"/ˌhæməˈliːn/","extraExplanation":["“Hamamelin”多见于护肤/药妆语境，和“witch hazel（金缕梅）”强相关；在更专业的化学/药理文献里，人们也可能用更具体的名称（例如金缕梅相关的鞣质类成分）来描述其有效物质。","如果你原本想查的是德国地名“(Ha)melin / Hamelin（哈默林）”，它与童话《The Pied Piper of Hamelin（哈默林的吹笛人）》有关；拼写不同，含义也完全不同。"]}
{"word":"hamamelis","summary":{"en":"Hamamelis is witch hazel—a flowering shrub/tree, and also the astringent made from it.","zh":"Hamamelis 指金缕梅（witch hazel）这种植物，也可指由其制成的金缕梅收敛剂（如金缕梅水）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub or small tree (genus Hamamelis), also called witch hazel, known for its ribbon-like yellow flowers and medicinally used bark and leaves","zh":"金缕梅属植物（Hamamelis），也叫“witch hazel / 北美金缕梅”，以带状黄色花著名，其树皮和叶子常被用于药用或护肤。"},"examples":[{"en":"Witch hazel (Hamamelis) blooms in late fall or winter, when many plants are bare.","zh":"金缕梅（Hamamelis）常在深秋或冬季开花，那时许多植物都已凋零。"},{"en":"The garden has a Hamamelis near the path, and it smells lightly sweet when it flowers.","zh":"花园小路旁有一株金缕梅，开花时会有淡淡的甜香。"}]},{"partOfSpeech":"n.","definition":{"en":"a skincare/medical astringent made from witch hazel, used to soothe minor irritation or reduce oiliness","zh":"金缕梅水／金缕梅提取液：由金缕梅制成的收敛剂，常用于舒缓轻微刺激或减少出油。"},"examples":[{"en":"She dabbed a little hamamelis on the irritated spot to calm the skin.","zh":"她在发红的部位点涂了一点金缕梅水，让皮肤舒服些。"},{"en":"This toner contains hamamelis to help control shine.","zh":"这款爽肤水含有金缕梅成分，有助于减少油光。"}]}],"synonyms":["witch hazel"],"phonetic":"/ˌhæməˈmiːlɪs/","extraExplanation":["“Hamamelis”是拉丁化的植物学名称，在日常英语里更常见的说法是“witch hazel”。","词源来自希腊语：hama（“同时”）+ mēlon（“果实/苹果”），指这种植物常出现“开花与结果同时存在”的现象。","在北美文化中，witch hazel 传统上被用作外用收敛剂（蒸馏液或提取物），常见于药房与护肤品；使用时应避免进入眼睛，敏感肌建议先少量测试。"]}
{"word":"hamamelites","summary":{"en":"Hamamelites are fossil plant remains—especially leaves—linked to or resembling witch-hazel (Hamamelis).","zh":"Hamamelites 指与金缕梅属相关或相似的植物化石（尤指叶化石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"fossil plant remains (especially leaves) that resemble or are classified with witch-hazel (genus Hamamelis); often used as a paleobotanical name for such fossils.","zh":"（古植物学）类似或归入金缕梅属（Hamamelis，俗称“巫婆榛/金缕梅”）的植物化石遗存，尤指叶片；常作为这类化石的名称使用。"},"examples":[{"en":"Researchers identified the leaf fossils as hamamelites based on their vein pattern.","zh":"研究人员根据叶脉结构把这些叶化石鉴定为 hamamelites。"},{"en":"Hamamelites are discussed in older paleobotany papers describing ancient temperate forests.","zh":"在一些较早的古植物学论文中，hamamelites 常被用来描述古代温带森林中的化石植物。"}]}],"synonyms":["witch-hazel fossils","Hamamelis-like fossils"],"phonetic":"/həˈmæməˌlaɪts/","extraExplanation":["“hamamelites”通常是复数形式；在古植物学/地质文献里，它多用于指一类与金缕梅（Hamamelis）相似的化石叶或化石植物。不同作者和年代的分类处理可能不一致：有时它被当作化石属名（fossil genus），有时更像是描述性用语。阅读论文时可结合上下文看它是“分类名”还是“泛称”。","金缕梅（witch-hazel）在英语文化中因其收敛、舒缓的药用提取物而常见；但“hamamelites”这个词本身主要出现在学术语境（古植物学、地层学），日常英语几乎不会用到。"]}
{"word":"haman","summary":{"en":"Haman most commonly refers to the biblical villain in the Book of Esther; it can also be a personal or family name.","zh":"“Haman”最常指《以斯帖记》中的反派人物；也可作人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A villain in the Hebrew Bible’s Book of Esther: a high official of the Persian king who plots to destroy the Jewish people but is eventually punished.","zh":"（专有名词）《希伯来圣经·以斯帖记》中的反派人物：波斯王的高官，曾策划灭绝犹太人，最终自食其果。"},"examples":[{"en":"In the Book of Esther, Haman plans to punish Mordecai and target the Jewish people.","zh":"在《以斯帖记》中，哈曼计划惩罚末底改，并把矛头指向犹太人。"},{"en":"Purim celebrations remember how Haman’s plot failed.","zh":"普珥节的庆祝纪念哈曼的阴谋如何失败。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name or family name in some cultures; the meaning depends on the language and family background.","zh":"某些文化中的男性名字或姓氏；具体含义取决于语言与家族背景。"},"examples":[{"en":"Haman is also used as a personal name in some communities.","zh":"在一些社群中，“Haman”也会被用作人名。"}]}],"synonyms":["(for the biblical figure) antagonist","villain"],"phonetic":"/ˈheɪmən/","extraExplanation":["“Haman”在英语里最常见的指代来自《以斯帖记》（Esther），因此它常带有“阴谋家/迫害者”的文化联想。","在犹太文化里，普珥节（Purim）会讲述以斯帖与末底改挫败哈曼阴谋的故事；在一些传统活动中，人们听到“Haman”会发出声响以表达对其反对（不同社区做法不一）。","作为人名/姓氏时，它未必与《以斯帖记》的角色有关，具体含义要看当事人的语言与文化来源。"]}
{"word":"hamantasch","summary":{"en":"A triangular filled cookie/pastry traditionally eaten at Purim.","zh":"普珥节传统食用的三角形夹馅犹太点心/饼干。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A triangular Jewish cookie or pastry, usually filled (often with poppy seeds, fruit jam, or chocolate), traditionally eaten during the holiday of Purim.","zh":"（普珥节期间常吃的）哈曼角／哈曼塔什，一种三角形的犹太甜点或饼干，通常包有馅料（常见如罂粟籽、果酱或巧克力）。"},"examples":[{"en":"We baked hamantaschen for Purim and filled them with apricot jam.","zh":"我们为普珥节烤了哈曼角，里面包了杏子果酱。"},{"en":"The bakery sells chocolate hamantaschen every spring.","zh":"那家面包店每年春天都会卖巧克力哈曼角。"}]}],"synonyms":["Purim cookie","Purim pastry","hamantaschen"],"phonetic":"/ˈhɑːmənˌtɑːʃ/","extraExplanation":["“Hamantasch”来自意第绪语（Yiddish）。复数常写作“hamantaschen”。在普珥节（Purim）食用它，和《以斯帖记》（Esther）中反派哈曼（Haman）的故事有关。","这种点心的三角形外形常被解释为象征哈曼的帽子或耳朵；不同社区有不同说法。","英语里也有人称它为“Purim cookie/pastry”。拼写有时会看到“hamantash/hamantasch”，都指同一种点心。"]}
{"word":"hamantaschen","summary":{"en":"Hamantaschen are Jewish triangular pastries, typically eaten on Purim and filled with sweet fillings like poppy seed or jam.","zh":"Hamantaschen（哈曼塔申）是犹太传统的三角形甜点，常在普珥节食用，内馅多为罂粟籽或果酱等甜馅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Jewish triangular pastry, usually filled with poppy seed, fruit jam, or chocolate, commonly eaten during the holiday of Purim.","zh":"一种传统的犹太三角形点心，通常包有罂粟籽、果酱或巧克力馅，常在普珥节（Purim）期间食用。"},"examples":[{"en":"We baked hamantaschen with apricot jam for Purim.","zh":"我们为普珥节烤了杏子果酱馅的哈曼塔申。"},{"en":"The bakery sells hamantaschen in many flavors every spring.","zh":"这家面包店每年春天都会卖多种口味的哈曼塔申。"}]}],"synonyms":["hamentashen","hamantasch (singular)"],"phonetic":"ˈhɑːmənˌtɑːʃən","extraExplanation":["“Hamantaschen”来自意第绪语（Yiddish），也常见拼写为“hamentashen”。它与《以斯帖记》里反派人物哈曼（Haman）的故事相关；三角形常被解释为象征“哈曼的帽子/口袋/耳朵”（不同地区说法不一）。","在英语里它通常作为复数名词使用（one hamantasch / two hamantaschen），但日常对话中也有人把“hamantaschen”当作单数来用。"]}
{"word":"hamantash","summary":{"en":"A triangular Jewish pastry eaten especially during Purim.","zh":"一种在普珥节期间常吃的犹太三角形馅点心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional triangular Jewish pastry, usually filled (commonly with poppy seed, fruit jam, or chocolate), eaten especially during the holiday of Purim.","zh":"哈曼塔申（哈曼耳朵）：一种传统的犹太三角形点心，通常有馅（常见如罂粟籽、果酱或巧克力），尤其在普珥节（Purim）期间食用。"},"examples":[{"en":"We baked hamantash for Purim and filled them with apricot jam.","zh":"我们为普珥节烤了哈曼塔申，里面包了杏子果酱。"},{"en":"Many bakeries sell hamantash in different flavors in early spring.","zh":"很多面包店会在初春推出各种口味的哈曼塔申。"}]}],"synonyms":["hamantashen"],"phonetic":"/ˈhɑmənˌtɑʃ/","extraExplanation":["常见拼写有 hamantasch（单数）与 hamantashen（复数，更常见），也有人写作 hamantash。发音和拼写会因家庭传统、地区与意第绪语（Yiddish）影响而不同。","这种点心与《以斯帖记》（Book of Esther）相关：普珥节纪念犹太人在古波斯得救的故事；“Haman”是故事中的反派人物。三角形的形状常被民间解释为“哈曼的帽子/口袋/耳朵”等象征说法。"]}
{"word":"hamantashen","summary":{"en":"Hamantaschen are traditional Jewish triangular pastries, especially eaten during Purim.","zh":"Hamantaschen（哈曼塔申）是传统犹太三角点心，尤其在普珥节期间食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Jewish triangular pastry, usually filled with poppy seed, fruit jam, or chocolate, commonly eaten during the holiday of Purim.","zh":"一种传统犹太三角形点心，常见馅料有罂粟籽、果酱或巧克力，通常在普珥节（Purim）期间食用。"},"examples":[{"en":"We baked hamantaschen for Purim and shared them with our neighbors.","zh":"我们为普珥节烤了哈曼塔申，并和邻居分享。"},{"en":"My favorite hamantaschen are filled with apricot jam.","zh":"我最喜欢杏子果酱馅的哈曼塔申。"},{"en":"The bakery sells hamantaschen every spring.","zh":"这家面包店每年春天都会卖哈曼塔申。"}]}],"synonyms":["hamantashen","Haman's pockets","oznei Haman"],"phonetic":"/ˌhɑːmənˈtɑːʃən/","extraExplanation":["“Hamantaschen”常被当作复数使用；单数有时写作“hamantasch”，但日常英语里很多人不严格区分。","这种点心与《以斯帖记》（Book of Esther）中的反派哈曼（Haman）有关；在普珥节，人们会吃它来纪念故事中的转危为安。形状常被解释为哈曼的三角帽、口袋或耳朵（希伯来语也常说“Oznei Haman”，意为“哈曼的耳朵”）。","拼写上也常见“hamantashen / hamantaschen”，属于从意第绪语/希伯来语进入英语后的不同转写方式。"]}
{"word":"hamara","summary":{"en":"our (used before a noun in Hindi/Urdu).","zh":"我们的（印地语/乌尔都语中作名词前限定词）。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"a word in Hindi/Urdu meaning “our,” used before a noun to show something belongs to “us.”","zh":"印地语/乌尔都语中表示“我们的”的词，用在名词前，表示“属于我们”。"},"examples":[{"en":"Hamara ghar yahan hai. (Our home is here.)","zh":"Hamara ghar yahan hai.（我们的家在这里。）"},{"en":"This is hamara plan—let’s do it together. (mixing languages)","zh":"This is hamara plan—let’s do it together.（英印混用：这是“我们的”计划，一起做吧。）"}]},{"partOfSpeech":"pron.","definition":{"en":"used as a casual way to refer to “our side/our people/ours” in conversation, especially in South Asian contexts.","zh":"口语里可泛指“我们这边/我们的人/我们这一方”，常见于南亚语境。"},"examples":[{"en":"Don’t worry—hamara will take care of it. (context-dependent, informal)","zh":"别担心——我们这边会处理的。（语境依赖、非正式）"}]}],"synonyms":["our","ours"],"phonetic":"/həˈmɑːrə/","extraExplanation":["严格来说，hamara 不是英语单词；在英语语境中多见于南亚移民社群的“夹杂语/混合语”(code-switching)，比如在一句英语里插入 hamara 来强调“我们自己的/咱们的”。","在印地语/乌尔都语里，“我们的”会随名词的性（阳/阴）与数（单/复）变化：如 hamārā（阳单）、hamārī（阴单）、hamāre（复数或敬语/某些格）。"],"etymology":"来自梵语系语言中的“我们”词根：印地语/乌尔都语常见形式为 hamārā（男性单数/通用作定语），在口语与不同性数格里还有 hamārī、hamāre 等变化。","mnemonic":["把它记成“ham + ara”：ham（火腿/ham）是“我们一起吃的”，所以是“我们的”。（只是记忆法，不是词源）","联想中文口语“咱们的/我们家的”：听到 hamara 就当作“咱们的”。"]}
{"word":"hamartia","summary":{"en":"Hamartia means a tragic mistake or fatal flaw that leads a character to downfall.","zh":"Hamartia 指导致角色走向悲剧结局的“悲剧性错误”或“致命缺陷”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fatal flaw or error in judgment that leads a main character toward downfall, especially in classical tragedy.","zh":"（尤指古典悲剧中的）致命缺陷；悲剧性错误（常指判断失误或性格弱点导致主角走向覆灭）"},"examples":[{"en":"In many tragedies, the hero’s hamartia isn’t pure evil but a mistake that snowballs into disaster.","zh":"在许多悲剧里，英雄的 hamartia 并不是纯粹的邪恶，而是一个会越滚越大的错误，最终酿成灾难。"},{"en":"People often say Macbeth’s hamartia is his ambition, because it drives him to make terrible choices.","zh":"人们常说《麦克白》的 hamartia 是野心，因为它驱使他做出可怕的选择。"},{"en":"When analyzing a story, look for the decision or trait that acts as the character’s hamartia.","zh":"分析故事时，可以找出那个起关键作用的决定或性格特质，它往往就是角色的 hamartia。"}]}],"synonyms":["fatal flaw","tragic flaw","tragic error","downfall-causing mistake"],"phonetic":"/ˌhɑːmɑːrˈtiːə/","extraExplanation":["hamartia 来自希腊语，原意接近“射偏了目标/犯错”。在亚里士多德《诗学》的悲剧理论中，它更像“错误或判断失误”，不一定是道德上的“罪”。\n\n现代英语里常被更宽泛地用作“致命缺陷（fatal flaw）”，所以你会看到它既指性格弱点（如傲慢、野心），也指一次关键的错误决定。两种用法都很常见，写文学分析时最好先说明你采用哪一种。"]}
{"word":"hamartias","summary":{"en":"Hamartia is a literary term for the fatal flaw or crucial mistake that leads a tragic character to downfall.","zh":"Hamartia 是文学术语，指悲剧人物导致其覆灭的致命缺陷或关键性错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in literature, especially Greek tragedy) a character’s fatal flaw or error in judgment that leads to their downfall","zh":"（文学用语，尤指希腊悲剧中）人物导致其覆灭的“致命缺陷/悲剧性错误（判断失误）”"},"examples":[{"en":"In many tragedies, the hero’s hamartia sets the whole disaster in motion.","zh":"在许多悲剧中，主人公的 hamartia 会引发整场灾难。"},{"en":"Pride is often described as a hamartia in stories where a powerful character refuses to listen.","zh":"在一些强势人物拒绝倾听他人的故事里，“傲慢”常被描述为一种 hamartia。"},{"en":"Teachers sometimes discuss Hamlet’s hamartia as hesitation and overthinking.","zh":"老师们有时会讨论《哈姆雷特》的 hamartia 是犹豫与过度思考。"}]}],"synonyms":["tragic flaw","fatal flaw","fatal error","downfall"],"phonetic":"/hɑːrˈmɑːrtiə/","extraExplanation":["“hamartia”来自古希腊语，亚里士多德在《诗学》中用它讨论悲剧人物的关键“错误/失误”。它不一定是纯粹的道德败坏，更常指一种性格弱点或判断偏差（例如傲慢、冲动、优柔寡断），在特定情境下被放大，最终导致悲剧结局。","英语课堂里常把它简单译为“tragic flaw（悲剧性缺陷）”。不过在更严格的文学讨论中，它也可强调“error（犯错）/misjudgment（误判）”而不只是“flaw（缺点）”。"]}
{"word":"hamartic","summary":{"en":"related to a fatal flaw or key error; also used medically for hamartoma","zh":"与致命缺陷/关键过失有关；医学上也指与错构瘤相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a character’s fatal error or tragic flaw (hamartia) that leads to downfall, especially in classical tragedy.","zh":"与“悲剧性过失/致命缺陷”（hamartia）有关的，尤指古典悲剧中导致人物覆灭的关键错误。"},"examples":[{"en":"In many Greek tragedies, a hamartic decision sets the hero on a path toward disaster.","zh":"在许多希腊悲剧中，一个带有hamartic性质的决定会把英雄推向灾难之路。"},{"en":"The novel treats pride as the hamartic trait that ruins the family.","zh":"这部小说把傲慢写成毁掉这个家庭的hamartic性格缺陷。"}]},{"partOfSpeech":"adj.","definition":{"en":"In medicine, relating to a hamartoma (a benign, tumor-like growth made of disorganized normal tissue).","zh":"（医学）与错构瘤（hamartoma，一种由“正常组织但排列紊乱”形成的良性肿块）有关的。"},"examples":[{"en":"The scan suggested a hamartic lesion rather than a malignant tumor.","zh":"影像检查提示这更像是hamartic病灶，而不是恶性肿瘤。"},{"en":"The report described hamartic changes in the tissue sample.","zh":"报告描述了样本组织中的hamartic改变。"}]}],"synonyms":["hamartial","tragic","fatal","flawed","hamartomatous"],"phonetic":"/həˈmɑrtɪk/","extraExplanation":["文学里常提到的 hamartia 见于亚里士多德《诗学》对悲剧的讨论：主角并非“纯坏”，而是因某个判断失误或性格弱点而走向悲剧结局；hamartic 用来形容这种“导致转折的致命错误/缺陷”。","医学里的 hamartoma 通常是良性的“类肿瘤”增生；因此 hamartic 在病理描述中多表示“错构瘤样/与错构瘤相关”。"],"etymology":"源自希腊语词根 hamart-（意为“犯错、射偏目标”），与 hamartia（悲剧中的“关键过失”）同源；在医学语境中也与 hamartoma（错构瘤）相关。","mnemonic":["把 hamart- 记成“哈马（hamar）= 误差/射偏”：hamartic 就是“跟关键错误有关的”。","联想 hamartia（悲剧缺陷）→ hamartic（悲剧缺陷的、致命错误的）。"]}
{"word":"hamartiologist","summary":{"en":"A hamartiologist is a scholar who studies sin, especially in Christian theology.","zh":"hamartiologist 指研究“罪”（尤其是基督教神学中的罪论）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies sin, especially in Christian theology; a specialist in hamartiology (the doctrine or study of sin).","zh":"研究“罪”（尤其在基督教神学语境中）的人；研究罪论（hamartiology）的学者。"},"examples":[{"en":"As a hamartiologist, she analyzes how different traditions define sin and moral failure.","zh":"作为一名罪论学者，她分析不同传统如何界定“罪”和道德失败。"},{"en":"The seminary invited a hamartiologist to lecture on the concept of original sin.","zh":"神学院邀请了一位罪论学者来讲授“原罪”的概念。"}]}],"synonyms":["hamartiology scholar","theologian (specializing in sin)","religious ethicist (in this context)"],"phonetic":"/hɑˌmɑrʃiˈɑlədʒɪst/","extraExplanation":["词源提示：hamartiologist 来自 hamartia（希腊语，常译为“罪/过失”，原义更接近“偏离目标、失手”）+ -logist（……学者）。因此它多见于神学、宗教学或伦理学讨论中。","使用场景：日常英语里很少用这个词；更常见的说法是 “a theologian who studies sin”（研究罪的神学家）或直接用领域名 “hamartiology”（罪论/罪的研究）。"]}
{"word":"hamartiology","summary":{"en":"Hamartiology is the theological study of sin, especially in Christian theology.","zh":"Hamartiology 指“罪论”，即基督教神学中对“罪”的系统研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The branch of Christian theology that studies sin—its origin, nature, effects, and how it relates to human life and salvation.","zh":"（基督教）“罪论”：研究“罪”的起源、本质、影响，以及罪与人类处境和救赎之间关系的神学分支。"},"examples":[{"en":"In systematic theology, hamartiology is often discussed alongside doctrines of salvation and grace.","zh":"在系统神学中，“罪论”（hamartiology）常与救恩论和恩典教义一起讨论。"},{"en":"Her paper compares Augustine’s hamartiology with modern views of moral responsibility.","zh":"她的论文把奥古斯丁的罪论与现代对道德责任的看法进行比较。"}]}],"synonyms":["the doctrine of sin","theology of sin","the study of sin"],"phonetic":"/hɑːˌmɑːrtiˈɑːlədʒi/","extraExplanation":["这个词来自希腊语词根 *hamartia*（常译为“罪”，也有“失误、偏离目标”之意）+ *-logy*（“……之学/学说”）。因此它在学术语境里通常指“关于罪的系统研究”，多见于神学院课程、神学著作和学术论文。","在日常英语里很少使用；普通表达更常说 *the doctrine of sin*（罪的教义）或 *the study of sin*（对罪的研究）。","不同传统（如天主教、新教、东正教）在“原罪、罪性、罪责与自由意志”等问题上会有差异，这些都属于罪论常讨论的范围。"]}
{"word":"hamartite","summary":{"en":"Hamartite (rare) means “related to hamartia,” a tragic mistake or flaw that leads to downfall.","zh":"hamartite（罕用）指“与 hamartia（悲剧性错误/缺陷）有关”，常用于文学与戏剧批评。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to **hamartia**—a mistake or “tragic flaw” that leads to someone’s downfall (especially in literature and drama).","zh":"（罕用）与 **hamartia（悲剧性错误/悲剧缺陷）**有关；指人物因某种关键错误或性格缺陷而走向失败（多用于文学、戏剧语境）。"},"examples":[{"en":"In some readings of Greek tragedy, the hero’s hamartite choice sets the catastrophe in motion.","zh":"在一些对希腊悲剧的解读中，主角那个带有“hamartite（悲剧性错误）”性质的选择启动了灾难的连锁反应。"},{"en":"The essay focuses on Hamlet’s hesitation as the play’s central hamartite element.","zh":"这篇文章把哈姆雷特的犹豫视为全剧最核心的“hamartite（悲剧性缺陷/因素）”。"}]}],"synonyms":["hamartic","tragic","flawed"],"phonetic":"/ˈhæmɑrˌtaɪt/","extraExplanation":["词源来自希腊语 *hamartia*（意为“失误、偏离正道”）。在文学批评里常见的是 **hamartia**（名词）以及更常用的形容词 **hamartic**。**hamartite** 属于非常少见的变体，用在学术或文学批评语境时更容易被理解。"]}
{"word":"hamartoma","summary":{"en":"A hamartoma is a benign, tumor-like mass made of normal local tissues arranged in an abnormal, disorganized way.","zh":"hamartoma（错构瘤）是由局部正常组织成分组成、但排列紊乱的良性“肿块样”病变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a benign (non-cancerous) growth made of a disorganized mixture of normal tissues that belong in that part of the body (often found in organs like the lung, liver, kidney, skin, or brain).","zh":"错构瘤（良性、非癌性肿块）：由“本来就属于该部位”的正常组织成分混合，但排列紊乱而形成的增生/肿块，常见于肺、肝、肾、皮肤或脑等部位。"},"examples":[{"en":"The CT scan showed a small lung hamartoma, and the doctor recommended regular follow-up.","zh":"CT 显示肺部有一个小的错构瘤，医生建议定期随访观察。"},{"en":"In many cases, a hamartoma grows slowly and causes no symptoms.","zh":"很多情况下，错构瘤生长缓慢，而且没有明显症状。"}]}],"synonyms":["benign mass","benign growth","tumor-like lesion"],"phonetic":"/ˌhɑːmɑːrˈtoʊmə/","extraExplanation":["词源：hamartoma 来自希腊语 *hamartia*（“错误、偏差”）+ *-oma*（“肿瘤/肿块”）。强调的是“组织构成对，但排列方式不对”。","医学要点：错构瘤通常是良性的，和“恶性肿瘤（cancer/malignant tumor）”不同；但在影像检查上可能与其他肿块相似，因此常需要结合影像特征、随访或病理检查来确认。","相关背景：在遗传综合征中也可能出现错构瘤（例如结节性硬化症等），具体风险与处理需由医生评估。"]}
{"word":"hamartophobia","summary":{"en":"Hamartophobia means a strong fear of sinning or doing something morally wrong.","zh":"hamartophobia 指对“犯罪/作恶/犯道德错误（罪）”的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of sinning or doing something morally wrong; sometimes also a strong fear of sin or wrongdoing in general","zh":"对“犯错/犯罪/作恶（尤其是道德或宗教意义上的罪）”的强烈恐惧；也可指对“罪或不义行为”本身的强烈恐惧"},"examples":[{"en":"His hamartophobia made him constantly worry that he had offended someone.","zh":"他的“恐罪症”让他总是担心自己冒犯了别人。"},{"en":"She avoids certain movies because her hamartophobia triggers feelings of guilt.","zh":"她会避开某些电影，因为“恐罪症”会引发强烈的内疚感。"}]}],"synonyms":["fear of sin","fear of wrongdoing","moral scrupulosity (related)"],"phonetic":"/həˌmɑr.t̬oʊˈfoʊ.bi.ə/","extraExplanation":["词源：来自希腊语 hamartia（“过失、罪”）+ -phobia（“恐惧”）。hamartia 也常见于文学/神学语境，指“悲剧性缺陷”或“致命的过失”。","用法提示：hamartophobia 在日常英语中很少见，更常见的表达是 “fear of sin” 或 “fear of doing something wrong”。如果用在心理健康语境，最好避免随意给人贴“诊断”标签，可说 “He has a strong fear of sin” 来更中性。"]}
{"word":"hamata","summary":{"en":"Hamata is a scientific, Latin-based plural term meaning “hook-shaped structures,” often seen in anatomy and biology descriptions.","zh":"Hamata 是源自拉丁语的科学用语（复数），意思是“钩状结构”，常见于解剖学与生物学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scientific/Latin plural) hook-shaped parts or structures; used in anatomy, botany, and zoology to refer to “hooks.”","zh":"（科学/拉丁语复数）钩状的部分或结构；在解剖学、植物学、动物学中用来指“钩/钩状结构”。"},"examples":[{"en":"Under the microscope, the insect’s hamata help it grip the surface.","zh":"在显微镜下，这种昆虫的 hamata（钩状结构）帮助它抓住表面。"},{"en":"Some scientific descriptions mention hamata along the edge of the leaf.","zh":"一些科学描述会提到叶缘有 hamata（钩状突起）。"}]},{"partOfSpeech":"other","definition":{"en":"A Latin form related to hamate (“hooked”); sometimes appears in technical names/descriptions.","zh":"与 hamate（“钩状的”）相关的拉丁语形式；有时出现在技术性名称或描述中。"},"examples":[{"en":"In older texts, you may see Latin wording like hamata to describe hooked features.","zh":"在较老的文献中，你可能会看到用拉丁语 hamata 来描述“钩状特征”。"}]}],"synonyms":["hooks","hook-like structures","hooked processes"],"phonetic":"/həˈmeɪtə/","extraExplanation":["“hamata”常见于学术语境，来源于拉丁语词根 ham-（与“钩子”有关）。日常英语里更常用的是形容词 hamate（意为“钩状的”），或直接说 hooks / hook-like structures。","如果你是在解剖学里看到它，可能与“钩骨（hamate bone）”相关；在植物/昆虫描述里，则多指各种“钩状突起/小钩”。"]}
{"word":"hamate","summary":{"en":"Hamate most commonly refers to a hook-shaped wrist bone (the hamate); it can also mean “hook-shaped.”","zh":"hamate 最常指手腕中带钩突的“钩骨”，也可作形容词表示“钩状的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A wrist (carpal) bone on the little-finger side that has a hook-like projection (the “hook of hamate”).","zh":"（解剖）腕骨之一，位于靠小指一侧，具有钩状突起（称“钩骨钩”）。"},"examples":[{"en":"The doctor suspected a hamate fracture after the patient fell on an outstretched hand.","zh":"病人手撑地摔倒后，医生怀疑是钩骨骨折。"},{"en":"Pain near the base of the little finger can sometimes involve the hamate.","zh":"小指根部附近的疼痛有时可能与钩骨有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"Hook-shaped; relating to a hook-like structure.","zh":"钩状的；与钩形结构有关的。"},"examples":[{"en":"Some anatomical terms describe a hamate (hook-shaped) process.","zh":"一些解剖学术语会描述“钩状”的突起。"},{"en":"The hamate projection helps form part of a tunnel for tendons and nerves in the wrist.","zh":"钩骨的钩状突起有助于形成手腕内肌腱与神经通过的通道的一部分。"}]}],"synonyms":["hook-shaped","uncinate (in some anatomical contexts)"],"phonetic":"/ˈheɪmeɪt/","extraExplanation":["“hamate”来自拉丁语 hamatus，意为“有钩的”，源自 hamus（钩）。在医学英语里，它最常指手腕的“钩骨（hamate bone）”，相关常见搭配有：hook of hamate（钩骨钩）、hamate fracture（钩骨骨折）。"]}
{"word":"hamated","summary":{"en":"“Hamated” means “hook-shaped” and is mostly used in scientific or medical descriptions.","zh":"“hamated”意为“钩状的”，多用于科学或医学的形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hooked; having a hook-like shape or a curved tip.","zh":"钩状的；带钩的；末端弯曲像钩子一样的。"},"examples":[{"en":"Some climbing plants have hamated spines that help them attach to other branches.","zh":"一些攀缘植物有钩状的刺，帮助它们附着在其他树枝上。"},{"en":"Under the microscope, the insect’s hamated claws are easy to recognize.","zh":"在显微镜下，这种昆虫的钩状爪很容易辨认。"}]}],"synonyms":["hooked","hook-shaped","uncinate"],"phonetic":"/ˈheɪmeɪtɪd/","extraExplanation":["“hamated”较少用于日常英语，多见于生物学、植物学和医学描述（形态学用语），意思就是“像钩子一样”。","词源来自拉丁语 hamatus（“有钩的”），与 hamus（“钩”）有关。","医学里常见相关词：hamate（钩骨，手腕的一块骨头）；以及形容它的 hamate/hamated（钩状的）。如果你原本想查的是手腕骨头，正确拼写多为 hamate。"]}
{"word":"hamates","summary":{"en":"Hamate (plural: hamates) is a wrist bone on the little-finger side, or an adjective meaning “hook-shaped.”","zh":"hamate（复数 hamates）指手腕小指侧的钩骨；也可作形容词，意为“钩状的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wrist bone (carpal bone) on the little-finger side of the hand, shaped with a hooklike projection","zh":"（解剖）钩骨：手腕小指侧的一块腕骨，因有钩状突起而得名"},"examples":[{"en":"The doctor suspected a hamate fracture after the patient fell on an outstretched hand.","zh":"病人手掌撑地摔倒后，医生怀疑是钩骨骨折。"},{"en":"Pain on the little-finger side of the wrist can be related to the hamate.","zh":"手腕小指侧疼痛可能与钩骨有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"hook-shaped; having a hooked form","zh":"钩状的；像钩子一样的"},"examples":[{"en":"The hamate process is named for its hooked shape.","zh":"“钩状突起”之所以这样命名，是因为它的形状像钩子。"},{"en":"Some species have hamate spines used for gripping.","zh":"有些物种有钩状刺，用来抓握。"}]}],"synonyms":["hook-shaped","uncinate"],"phonetic":"/ˈheɪmeɪt/","extraExplanation":["“hamates”是名词复数，指多个“hamate（钩骨）”。在医学语境里更常见的是说“hamate bone（钩骨）”或“fracture of the hamate（钩骨骨折）”。","词源来自拉丁语 hamatus（“带钩的”），与 hook（钩子）在意义上相近。"]}
{"word":"Hamathian","summary":{"en":"connected with the ancient city of Hamath or its people","zh":"与古城哈马特及其居民相关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hamath (an ancient city-state in the Levant, often mentioned in the Bible; associated with the area of modern Hama, Syria).","zh":"与哈马特（黎凡特地区的古城邦，《圣经》中常见；与今叙利亚哈马 Hama 一带相关）有关的；哈马特的。"},"examples":[{"en":"The inscription is sometimes described as Hamathian because it was found near ancient Hamath.","zh":"这段铭文有时被称为“哈马特的”，因为它是在古哈马特附近发现的。"},{"en":"Some scholars compare Hamathian material culture with that of neighboring kingdoms.","zh":"一些学者把哈马特的物质文化与周边王国进行比较。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Hamath; an inhabitant of the region of ancient Hamath (rare).","zh":"哈马特人；古哈马特地区的居民（较少见）。"},"examples":[{"en":"The text lists a Hamathian among the envoys sent to negotiate.","zh":"文本在使节名单中列到了一位哈马特人参与谈判。"}]}],"synonyms":["Hamathite"],"phonetic":"/həˈmeɪθiən/","extraExplanation":["Hamath 在古代近东史与《圣经》语境里较常出现；现代叙利亚城市 Hama 通常被视为其延续或对应地点。这个词多见于历史、考古、宗教研究写作中，日常英语里很少用。"],"etymology":"源自地名 Hamath（《圣经》中常见的古城名）+ 形容词/居民后缀 -ian，表示“……的、……人”。","mnemonic":["把它拆开记：Hamath + -ian（像 Canadian, Italian）。看到 -ian 就想到“某地的/某地人”。","联想中文“哈马特的/哈马特人”：地名音译“哈马特”+“-ian（人/的）”。"]}
{"word":"hamathite","summary":{"en":"Hamathite: a (rare) term meaning a person from the ancient city of Hamath, mainly used in biblical/historical contexts.","zh":"Hamathite：较少见，指来自古城哈马的人，主要用于《圣经》/历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Hamath (an ancient city in Syria), especially as mentioned in the Bible.","zh":"哈马人；哈马城（古叙利亚城市）的居民（尤指《圣经》中的称呼）。"},"examples":[{"en":"In some Bible translations, a Hamathite is listed among the peoples living in the region.","zh":"在一些《圣经》译本中，哈马人被列为当地居住的族群之一。"},{"en":"The text refers to contacts between Israel and the Hamathites to the north.","zh":"经文提到以色列与北方的哈马人之间的往来。"}]}],"synonyms":["Hamathian","person from Hamath"],"phonetic":"/həˈmæθaɪt/","extraExplanation":["“Hamathite”源自地名 Hamath（哈马），加上英语表示“某地的人/居民”的后缀 -ite（如 Israelite 以色列人、Moabite 摩押人）。","在现代英语中这个词非常少见，更多出现在宗教/历史语境（如《圣经》注释、古代近东历史）里；日常表达通常会说 “a person from Hamath” 或用更通用的 “Hamathian”（较少见）。"]}
{"word":"hamatum","summary":{"en":"Hamatum is an anatomical term meaning the hamate bone, a wrist bone on the little-finger side with a hook-shaped part.","zh":"hamatum 是解剖学用语，指钩骨：位于小指侧的腕骨，带有钩状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the hamate bone; a wedge-shaped carpal (wrist) bone on the little-finger side of the hand, with a hook-like projection","zh":"钩骨；手腕（腕骨）之一，位于小指侧，具有钩状突起"},"examples":[{"en":"The X-ray showed a fracture of the hamatum after he fell on his hand.","zh":"他手部摔倒后，X 光显示钩骨骨折。"},{"en":"Pain on the ulnar side of the wrist can involve the hamatum.","zh":"手腕尺侧疼痛可能与钩骨有关。"}]}],"synonyms":["hamate (bone)","os hamatum"],"phonetic":"/həˈmeɪtəm/","extraExplanation":["“hamatum”来自拉丁语，意思与“钩状/有钩的”相关；在医学英语中常见于拉丁式解剖名称“os hamatum”（钩骨）。","钩骨的“钩”（hook of hamate）在临床上很重要：如高尔夫、棒球等握杆运动可能造成钩突应力性损伤，症状常表现为小指侧腕部疼痛、握力下降。"]}
{"word":"hamaul","summary":{"en":"“Hamaul” isn’t a recognized English word; it’s likely a misspelling or a proper name, so context is needed.","zh":"“hamaul”不是常见英语词；多半是拼写错误或专名，需要语境才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name (proper noun), so its meaning depends on the context.","zh":"不是标准英语单词；可能是拼写错误或专有名词（人名/地名等），含义需要结合上下文判断。"},"examples":[{"en":"I couldn’t find “hamaul” in an English dictionary—did you mean “haul” or “hamal”?","zh":"我在英语词典里找不到“hamaul”——你想写的是“haul”还是“hamal”吗？"},{"en":"Can you share the sentence where you saw “hamaul”?","zh":"你能把看到“hamaul”的句子发出来吗？"}]}],"extraExplanation":["“hamaul”在常见英语词典中通常查不到。最可能的情况：\n1）拼写错误：你可能想写 haul（/hɔl/，表示“拖/拉/运送”或“搬运量”）。\n2）外来词/专名：也可能是人名、地名、品牌名，或来自其他语言的转写。\n把原句或来源（哪本书/网站、你想表达的意思、是否是人名地名）发我，我可以帮你精准判断并给出正确词条。"]}
{"word":"hamauls","summary":{"en":"“Haul” means to pull/transport something (often heavy), or the amount of goods caught/transported.","zh":"“haul” 常指费力拖拉或运输；作名词可指一次运载量或（尤指捕鱼、搜缴等）收获。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to pull or carry something heavy, often with effort; to transport goods or people from one place to another","zh":"（费力地）拖、拉、搬运；（用车辆等）运送"},"examples":[{"en":"They had to haul the boxes up the stairs.","zh":"他们不得不把箱子费力地搬上楼。"},{"en":"This truck hauls fruit from farms to the city market.","zh":"这辆卡车把水果从农场运到城市市场。"}]},{"partOfSpeech":"n.","definition":{"en":"a load that is transported, or the act of transporting something (often by truck, boat, etc.)","zh":"（一次）运载的货物；运输/搬运的行为"},"examples":[{"en":"The fisherman came back with a good haul.","zh":"那位渔民带着不错的渔获回来。"},{"en":"It was a short haul from the airport to the hotel.","zh":"从机场到酒店路程不远。"}]}],"synonyms":["pull","drag","tow","transport","carry","lug"],"phonetic":"/hɔl/","extraExplanation":["“hamauls” 不是常见英语单词，看起来更像拼写错误。你可能想写的是 **hauls**（haul 的第三人称单数/复数名词）或 **haul**。如果你原本想查别的词（比如某个专有名词/人名/地名），可以把上下文句子发我，我能更准确判断。"]}
{"word":"hamber","summary":{"en":"“Hamber” is usually a misspelling of “hamburger,” but it can also be a surname.","zh":"“hamber”通常是“hamburger（汉堡）”的拼写错误，但也可能是一个姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling or informal shortening of “hamburger” (a sandwich with a ground-beef patty in a bun).","zh":"“hamburger（汉堡）”的常见拼写错误或口语式缩写（夹牛肉饼的面包三明治）。"},"examples":[{"en":"I think you mean “hamburger,” not “hamber.”","zh":"我觉得你想写的是“hamburger”，不是“hamber”。"},{"en":"Let’s get a hamburger for lunch.","zh":"我们午饭去吃个汉堡吧。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), most often seen as a proper noun (Hamber).","zh":"姓氏（专有名词），常见写作 Hamber。"},"examples":[{"en":"Ms. Hamber will lead the meeting today.","zh":"Hamber 女士今天将主持会议。"}]}],"synonyms":["hamburger","burger"],"phonetic":"/ˈhæmˌbɝɡɚ/","extraExplanation":["“hamburger”这个词最初与德国城市 Hamburg（汉堡）有关，并不表示“ham（火腿）+ burger”。所以即使里面不是火腿，也可以叫 hamburger。","如果你是在点餐或写作里想表达“汉堡”，建议用标准拼写 hamburger；更口语的说法还有 burger（更常用）。"]}
{"word":"hambergite","summary":{"en":"Hambergite is a rare mineral (a beryllium borate) sometimes used as a gemstone.","zh":"hambergite（汉堡石）是一种稀有矿物（铍硼酸盐），有时用作宝石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a beryllium borate) that can form clear crystals and is sometimes cut as a gemstone","zh":"一种稀有矿物（含铍的硼酸盐矿物），可形成透明晶体，有时会被切割成宝石"},"examples":[{"en":"Hambergite is valued by collectors because its crystals can be very clear.","zh":"汉堡石因其晶体可能非常通透而受到收藏家重视。"},{"en":"The jeweler showed a small hambergite stone with bright sparkle.","zh":"珠宝商展示了一颗小小的汉堡石，火彩很亮。"}]}],"phonetic":"/ˈhæm.bɝˌɡaɪt/","extraExplanation":["发音提示：重音通常在第一个音节 HAM-，后面的 -berg- 类似“伯格”，-ite 常见于矿物名（如 calcite 方解石、granite 花岗岩），读作 /aɪt/。","词源/背景：hambergite 以瑞典矿物学家 Axel Hamberg 的姓氏命名；矿物命名中用人名 + “-ite” 很常见。","用法提醒：在日常英语里它非常少见，主要出现在矿物学、宝石学或收藏领域。"]}
{"word":"hamble","summary":{"en":"Hamble is most commonly a place name in southern England (River Hamble / Hamble-le-Rice); more rarely, it can mean to move clumsily (dialect).","zh":"Hamble 最常见是英国南部的地名（汉布尔河/汉布尔-勒-赖斯）；较少见时可作方言动词，表示笨拙地移动。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(proper name) A river and an area/village in Hampshire, southern England (e.g., the River Hamble; Hamble-le-Rice), known for boating and sailing.","zh":"（专有名词）英格兰南部汉普郡的一条河及其周边地区/村镇（如 Hamble-le-Rice、River Hamble），以游艇和航海活动闻名。"},"examples":[{"en":"We sailed down the River Hamble before heading out to the Solent.","zh":"我们沿着汉布尔河（River Hamble）航行，然后驶向索伦特海峡。"},{"en":"She lives in Hamble-le-Rice, a small village near Southampton.","zh":"她住在 Hamble-le-Rice，一个靠近南安普敦的小村庄。"}]},{"partOfSpeech":"vi.","definition":{"en":"(dialect, uncommon) To move or work in a slow, awkward, or clumsy way.","zh":"（方言，少见）动作笨拙地、慢吞吞地移动或做事。"},"examples":[{"en":"He hambled along in the heavy boots.","zh":"他穿着沉重的靴子，笨拙地往前走。"},{"en":"I was hambly with the tools because I was new to the job.","zh":"因为刚上手这份工作，我用工具时显得很笨拙。"}]}],"synonyms":["(place) River Hamble","(dialect verb) fumble","shuffle","stumble"],"phonetic":"/ˈhæmbəl/","extraExplanation":["“Hamble”在现代英语里最常见的是地名（专有名词），尤其指英国汉普郡的 Hamble-le-Rice 和 River Hamble；在航海语境中很常见。","作为动词的“hamble”属于较少见的方言/旧用法，日常英语更常用的表达是：walk clumsily（走得笨拙）、fumble（笨手笨脚地摸索/摆弄）、shuffle（拖着脚走）。"]}
{"word":"hambone","summary":{"en":"Hambone usually means a ham bone used in cooking, and it can also refer to a body-percussion rhythm style.","zh":"Hambone 通常指烹饪用的火腿骨，也可指一种通过拍打身体来打节奏的表演/节奏形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bone from a ham (often used to flavor soups, beans, and stews)","zh":"火腿骨（常用来给汤、豆子或炖菜增香）"},"examples":[{"en":"Save the hambone and use it to make bean soup.","zh":"把火腿骨留起来，用来做豆子汤。"},{"en":"The greens tasted smoky because they were cooked with a hambone.","zh":"这道绿叶菜有烟熏味，因为是用火腿骨一起炖的。"}]},{"partOfSpeech":"n.","definition":{"en":"a style of rhythm-making by slapping and patting the body (a form of African American percussion, related to “pattin’ juba”)","zh":"“拍打身体打节奏”的表演方式（非裔美国人的一种身体打击乐形式，与 pattin’ juba 相关）"},"examples":[{"en":"The dancers added hambone rhythms between the drum breaks.","zh":"舞者在鼓点间隙加入了“拍打身体”的 hambone 节奏。"},{"en":"In class, we learned a simple hambone pattern using claps and thigh slaps.","zh":"课上我们学了一个简单的 hambone 节奏，用拍手和拍大腿来完成。"}]}],"synonyms":["ham bone","ham hock (related in cooking)","body percussion"],"phonetic":"/ˈhæmˌboʊn/","extraExplanation":["“Hambone”作为身体打击乐的说法，常与美国非裔传统表演联系在一起；有时也会被称为“hambone percussion”或与“pattin’ juba”并提。使用时注意语境：在音乐/舞蹈课堂、民俗与表演艺术讨论中更常见。"]}
{"word":"hamboned","summary":{"en":"Hamboned is slang meaning “very drunk,” and less commonly can mean badly damaged or related to hambone body-percussion rhythms.","zh":"Hamboned 常作俚语表示“烂醉”，较少见时也可指“严重损坏/被打得很惨”，或与 hambone 身体打击节奏表演有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang) Very drunk; heavily intoxicated.","zh":"（俚语）醉得很厉害；烂醉。"},"examples":[{"en":"He got hamboned at the party and couldn’t find his phone.","zh":"他在派对上醉到不行，连手机都找不到。"},{"en":"If you’re going to drink, don’t get hamboned—get home safely.","zh":"如果你要喝酒，别喝到烂醉——安全回家最重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"(slang, less common) Beaten up or damaged badly; in rough shape.","zh":"（俚语，较少见）被打得很惨；损坏严重；状态很糟。"},"examples":[{"en":"After the crash, the front of the car was totally hamboned.","zh":"撞车后，车头几乎全毁了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, from “hambone”) Using rhythmic slaps on the body (thighs, chest) as percussion; related to hambone dancing.","zh":"（非正式，源自 hambone）用拍打身体（大腿、胸口等）做节奏打击；与“hambone”节奏舞有关。"},"examples":[{"en":"They did a hamboned rhythm—clapping and slapping their thighs in time.","zh":"他们用拍手和拍大腿打出“hambone”节奏。"}]}],"synonyms":["drunk","wasted","hammered","sloshed","plastered"],"phonetic":"/hæmboʊnd/","extraExplanation":["“hamboned”最常见的用法是表示“烂醉”。它属于口语/俚语，在朋友聊天、影视对白里更常见，正式写作里建议用 “drunk / intoxicated”。","“hambone”也指一种源自非裔美国人传统的身体打击节奏（拍手、拍腿、拍胸等），类似把身体当作“打击乐器”。所以在少数语境里，“hamboned”可能和这种节奏表演有关。"]}
{"word":"hambones","summary":{"en":"“Hambones” most commonly means ham bones used in cooking; it can also mean an overly showy performer, or a style of rhythmic body percussion.","zh":"“Hambones”最常指做菜用的火腿骨；也可指表演夸张的人，或一种身体打击乐节奏风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ham bone (often kept after eating ham) used to flavor soups, beans, greens, etc.","zh":"火腿骨（吃完火腿后留下的骨头），常用来给汤、豆类、青菜等增味"},"examples":[{"en":"She simmered a hambone in the bean soup to add a smoky flavor.","zh":"她把火腿骨放进豆汤里慢炖，增加烟熏香味。"},{"en":"Do you have any hambones left from the holiday ham?","zh":"节日火腿吃完后还有剩下的火腿骨吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a comedian or actor who tries too hard to be funny; an “over-the-top” performer","zh":"（非正式）用力过猛的搞笑演员；表演夸张、爱“抢戏”的人"},"examples":[{"en":"He can be a real hambone on stage, but the crowd loves it.","zh":"他在台上有时很夸张，但观众很买账。"},{"en":"The director told him not to act like a hambone in serious scenes.","zh":"导演叫他在严肃场景里别演得太浮夸。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in African American culture) a style of rhythmic body percussion (slapping thighs, chest, etc.); also the performer who does it","zh":"（尤指非裔美国人文化）一种用拍打大腿、胸口等做节奏的身体打击乐；也可指表演这种节奏的人"},"examples":[{"en":"They did hambone rhythms during the talent show.","zh":"他们在才艺表演中做了“hambone”身体打击乐节奏。"},{"en":"The kids learned a simple hambone pattern in music class.","zh":"孩子们在音乐课上学了一个简单的hambone节奏型。"}]}],"synonyms":["ham bone","soup bone","ham (informal)","show-off (informal)","body percussion"],"phonetic":"ˈhæmboʊn","extraExplanation":["“hambone(s)”既可以是字面意思的“火腿骨”，也可能是口语里的“夸张表演者”。在音乐/舞蹈语境中，“hambone”还指一种源于非裔美国人传统的身体打击乐节奏（用拍打身体制造节拍）。具体含义通常要看上下文：食谱/做饭→火腿骨；舞台/表演→夸张演员；音乐课/才艺表演→身体打击乐。"]}
{"word":"hambro","summary":{"en":"Hambro is usually informal slang for “bro” (a male friend), and it can also be a surname seen in business/history contexts.","zh":"Hambro 通常是口语俚语，表示“哥们儿/兄弟”；也可以是姓氏（在商业/历史语境中出现）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, slang) A male friend; “bro,” often used jokingly (sometimes with a food/burger vibe because it sounds like “ham” + “bro”).","zh":"（非正式俚语）男性朋友；相当于“兄弟/哥们儿”，常带玩笑语气（有时因听起来像“ham（火腿）+ bro（兄弟）”，会带一点“吃货/汉堡”梗的感觉）。"},"examples":[{"en":"What’s up, hambro? Want to grab lunch?","zh":"怎么啦，哥们儿？要不要一起吃午饭？"},{"en":"He calls everyone “hambro” when he’s in a silly mood.","zh":"他心情搞怪的时候，会把每个人都叫“hambro”。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) A surname; also seen in names of organizations (e.g., Hambros, a historic British bank/financial name).","zh":"（专有名词）姓氏；也常见于机构名称中（如 Hambros，英国历史上的银行/金融相关名称）。"},"examples":[{"en":"Hambro is a family name you may see in British business history.","zh":"Hambro 是一个你可能会在英国商业史中看到的姓氏。"}]}],"synonyms":["bro","buddy","dude","pal"],"phonetic":"/ˈhæm.broʊ/","extraExplanation":["“hambro”不是标准词典里非常常见的词，更多出现在网络口语或小圈子玩笑称呼中。正式场合一般用“bro / buddy / dude”。","它也很容易被误看成西语借词“hombre”（英语里常用来开玩笑指“哥们/家伙”，读音不同：hombre 更像 /ˈɑm.breɪ/ 一类的感觉）。如果你是想问“hombre”，告诉我语境我可以一起对比。"]}
{"word":"hambroline","summary":{"en":"“Hambroline” isn’t a recognized English word; it’s likely a misspelling (often of “hemoglobin”) or a proper name.","zh":"“hambroline”不是常见或标准英语词；更可能是拼写错误（常见为“hemoglobin/血红蛋白”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling (often of “hemoglobin”), or it may be a personal name/brand used in a specific context.","zh":"不是标准英语单词。更可能是拼写错误（常见误写为“hemoglobin/血红蛋白”），或是在特定语境中用作人名/品牌名。"},"examples":[{"en":"I can’t find “hambroline” in a dictionary—did you mean “hemoglobin”?","zh":"我在词典里找不到“hambroline”——你是不是想写“hemoglobin（血红蛋白）”？"},{"en":"If “Hambroline” is a product or a character name, tell me where you saw it so I can explain it accurately.","zh":"如果“Hambroline”是产品名或角色名，请告诉我你在哪里看到的，我才能更准确地解释。"}]}],"phonetic":"/ˈhæm.brəˌlaɪn/","extraExplanation":["“hemoglobin（血红蛋白）”是红细胞里的蛋白质，负责把氧气从肺部运到全身、并带回部分二氧化碳。它是医学和生物学里非常常见的词。","如果你愿意，把包含“hambroline”的原句/截图发来，我可以判断它究竟是拼写误差、专有名词，还是某个小众术语。"]}
{"word":"Hamburg","summary":{"en":"Hamburg is a major port city in northern Germany.","zh":"Hamburg 指德国北部的主要港口城市“汉堡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large port city in northern Germany, known for its harbor, trade, and culture.","zh":"汉堡（德国北部的重要港口城市），以海港、贸易与文化闻名。"},"examples":[{"en":"Hamburg is one of Germany’s biggest ports.","zh":"汉堡是德国最大的港口之一。"},{"en":"I’m traveling from Berlin to Hamburg by train.","zh":"我将从柏林坐火车去汉堡。"}]}],"synonyms":["Free and Hanseatic City of Hamburg (official name)"],"phonetic":"/ˈhæm.bɝːɡ/","extraExplanation":["“Hamburg”在英语里通常指德国城市“汉堡”。注意不要和“hamburger（汉堡包）”混淆：hamburger 这个词最初与“Hamburg（汉堡）”有关，意思是“来自汉堡的（食物/做法）”，后来才演变成今天常说的“汉堡包”。","Hamburg 常见搭配：the Port of Hamburg（汉堡港）、Hamburg Harbor（汉堡港/港湾）、Hamburg Central Station / Hamburg Hauptbahnhof（汉堡中央火车站/德语：Hauptbahnhof）。"]}
{"word":"hamburg","summary":{"en":"Hamburg is a major port city in northern Germany; it can also refer (less commonly) to “Hamburg steak,” a ground-beef patty.","zh":"Hamburg通常指德国北部的重要港口城市“汉堡”；也可（较少见）指“汉堡牛排”，即绞牛肉做成的肉饼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large port city in northern Germany, known for shipping, trade, and its historic Hanseatic (merchant-league) connections.","zh":"汉堡（德国北部的重要港口城市，以航运、贸易及历史上的汉萨同盟背景闻名）。"},"examples":[{"en":"Hamburg is one of Germany’s biggest ports.","zh":"汉堡是德国最大的港口之一。"},{"en":"She moved from Berlin to Hamburg for work.","zh":"她为了工作从柏林搬到汉堡。"}]},{"partOfSpeech":"n.","definition":{"en":"(In cooking, short for) “Hamburg steak,” a ground-beef patty; this sense is less common today than “hamburger.”","zh":"（烹饪用语，较少见）“汉堡牛排”（Hamburg steak）：一种用绞牛肉做成的肉饼；如今更常说 hamburger。"},"examples":[{"en":"The menu lists a Hamburg steak with onions and gravy.","zh":"菜单上写着一份配洋葱和肉汁的汉堡牛排。"},{"en":"Historically, Hamburg steak is related to the modern hamburger.","zh":"从历史上看，汉堡牛排与现代的汉堡包有关联。"}]}],"synonyms":["(city) Free and Hanseatic City of Hamburg (formal)"],"phonetic":"/ˈhæm.bɝːɡ/","extraExplanation":["“Hamburg”是德国城市名，英语中常直接用作专有名词。它在历史上属于“自由汉萨市”（Free and Hanseatic City），反映了中世纪汉萨同盟的商贸传统。","“hamburger（汉堡包）”这个词与Hamburg有关：早期“Hamburg-style beef（汉堡风味牛肉）/Hamburg steak（汉堡牛排）”传入美国后，逐渐演变成今天的hamburger。虽然名字相近，但在现代英语里Hamburg通常指城市，而hamburger指食物。"]}
{"word":"hamburger","summary":{"en":"A hamburger is a beef patty sandwich in a bun; it can also mean the beef patty itself.","zh":"hamburger 指夹牛肉饼的汉堡包，也可指牛肉饼本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sandwich made of a cooked ground-beef patty (often in a round bun), usually served with toppings like lettuce, tomato, onion, cheese, and sauces.","zh":"汉堡（包）：把煎/烤的牛肉碎肉饼夹在圆面包里做成的三明治，常配生菜、番茄、洋葱、芝士和酱料等。"},"examples":[{"en":"I’ll have a hamburger with cheese and no onions, please.","zh":"我想要一个加芝士、不加洋葱的汉堡，谢谢。"},{"en":"They grilled hamburgers in the backyard for the weekend cookout.","zh":"周末聚会他们在后院烤汉堡。"}]},{"partOfSpeech":"n.","definition":{"en":"The cooked ground-beef patty used in a hamburger (sometimes called a “burger patty”).","zh":"（汉堡里的）牛肉饼；汉堡肉饼。"},"examples":[{"en":"Put the hamburgers on the pan and cook them for about five minutes per side.","zh":"把肉饼放进平底锅里，每面煎大约五分钟。"}]}],"synonyms":["burger","beef burger"],"phonetic":"/ˈhæmˌbɝɡɚ/","extraExplanation":["“Hamburger”最初与德国城市 Hamburg（汉堡）有关：19世纪的“Hamburg steak”（汉堡牛排）指一种剁碎的牛肉饼。后来这种肉饼被夹进面包里，在美国逐渐发展成今天常见的“hamburger”。注意：hamburger 并不一定含火腿（ham），这是很多学习者容易误解的地方。","口语里常把 hamburger 简称为 burger。菜单上若写 cheeseburger（芝士汉堡）、veggie burger（素汉堡）、chicken burger（鸡肉汉堡，英美用法略有差异）等，都是“burger”的变体。"]}
{"word":"hamburgers","summary":{"en":"Hamburgers are the plural form of hamburger—popular beef-patty sandwiches served in buns with various toppings.","zh":"Hamburgers 是 hamburger 的复数，指常见的“牛肉饼夹面包”的汉堡，可搭配多种配料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hamburger: a sandwich made of a cooked ground-beef patty (often in a bun), usually served with toppings like lettuce, tomato, onion, cheese, and sauces.","zh":"hamburger 的复数：汉堡（包）；通常指夹着煎/烤过的牛肉饼的面包夹层三明治，常配生菜、番茄、洋葱、芝士和酱料等。"},"examples":[{"en":"We ordered two hamburgers and a large fries.","zh":"我们点了两个汉堡和一份大薯条。"},{"en":"She likes her hamburgers with cheese and pickles.","zh":"她喜欢在汉堡里加芝士和酸黄瓜。"},{"en":"The restaurant serves hamburgers made from fresh beef.","zh":"这家餐厅卖用新鲜牛肉做的汉堡。"}]}],"synonyms":["burgers","beef burgers"],"phonetic":"/ˈhæmˌbɝːɡɚz/","extraExplanation":["在美式英语里，hamburger 常被口语简化为 burger。菜谱上常见的变体有 cheeseburger（芝士汉堡）、veggie burger（素汉堡/植物肉汉堡）。","词源上与德国城市 Hamburg（汉堡）有关：早期“Hamburg steak（汉堡牛排）”在美国流行后，发展为夹在面包里的 hamburger。"]}
{"word":"hamburgs","summary":{"en":"“Hamburgs” usually means hamburgers (informal/rare spelling). Standard forms: “hamburgers” or “burgers.”","zh":"“hamburgs”通常指“汉堡包”（较口语且不太标准的拼写）。更常见的标准形式是“hamburgers”或“burgers”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural form of “hamburg” (informal for “hamburger”); meaning hamburgers (a sandwich with a cooked ground‑beef patty, usually in a bun).","zh":"“hamburg”的复数形式（口语中常指“hamburger”）；意思是“汉堡包/汉堡”。"},"examples":[{"en":"We grilled hamburgs for dinner.","zh":"我们晚餐烤了些汉堡。"},{"en":"Two hamburgs, please—no onions.","zh":"请来两个汉堡，不要洋葱。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) plural of “Hamburg,” the German city; used only when talking about multiple places/ships/teams named “Hamburg.”","zh":"（罕见）“Hamburg（汉堡市）”的复数；一般只在谈论多个叫“Hamburg”的地点/船名/队名等时使用。"},"examples":[{"en":"The fleet included two ships named Hamburgs.","zh":"这支舰队里有两艘船都叫“Hamburg”。"}]}],"synonyms":["hamburgers","burgers"],"phonetic":"/ˈhæm.bɝɡz/","extraExplanation":["“hamburgs”在现代英语里不算标准拼写；更常见、更自然的说法是“hamburgers”或更口语的“burgers”。","“hamburger”这个词并不一定表示“火腿（ham）”，而是历史上与德国城市Hamburg（汉堡）相关的命名。"]}
{"word":"hamdmaid","summary":{"en":"A handmaid is a female servant/attendant; in some literary contexts it can also mean a woman forced to bear children for others.","zh":"handmaid 指女仆/侍女；在某些文学语境中也可指被迫为他人孕育孩子的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female servant or attendant, especially one who helps a woman with personal tasks.","zh":"女仆；侍女（尤指帮助女性处理个人事务的女佣）。"},"examples":[{"en":"In the old story, the queen was always followed by a handmaid.","zh":"在那个古老的故事里，王后总有侍女跟随。"},{"en":"The bride thanked her handmaids for helping her get ready.","zh":"新娘感谢侍女们帮她做准备。"}]},{"partOfSpeech":"n.","definition":{"en":"A woman in a forced role of bearing children for others (a dystopian or historical-sounding use).","zh":"被迫为他人孕育孩子的女性（常见于反乌托邦作品或带历史色彩的用法）。"},"examples":[{"en":"The novel depicts a society where handmaids have no freedom.","zh":"这部小说描写了一个侍女生存毫无自由的社会。"}]}],"synonyms":["maid","servant","attendant","lady-in-waiting"],"phonetic":"/ˈhændˌmeɪd/","extraExplanation":["你输入的“hamdmaid”更可能是拼写错误，正确拼写是“handmaid”。","“handmaid”在现代日常英语里不算常用，更多见于宗教/历史语境（如《圣经》里“the handmaid of the Lord”）或文学作品中。","当代文化中，这个词常让人联想到 Margaret Atwood 的小说《使女的故事》(The Handmaid’s Tale)，因此第二个含义带有强烈的社会与权力压迫色彩。"]}
{"word":"hame","summary":{"en":"A “hame” is a curved strip on a draft animal’s collar used to attach harness straps; it can also mean to put these on the animal.","zh":"“hame”指役畜项圈外侧用于连接挽具的弓形夹板（项夹）；也可作动词，表示给役畜装上项夹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Either of a pair of curved metal or wooden strips that sit on the outside of a draft animal’s collar and help attach the harness to the traces (pulling straps).","zh":"（役畜项圈外侧的）弓形夹板；（一对中的）一根“项夹”（用于连接挽具与牵引带）。"},"examples":[{"en":"The driver checked the hames before hitching the horses to the wagon.","zh":"车夫在把马套到车上之前先检查了项夹。"},{"en":"The traces were fastened to the hames so the horse could pull the load.","zh":"牵引带固定在项夹上，这样马才能拉动货物。"}]},{"partOfSpeech":"v.","definition":{"en":"To fit a draft animal with hames (to put the hames on the collar).","zh":"给役畜装上项夹；把项夹装到项圈上。"},"examples":[{"en":"They hamed the horse and then attached the rest of the harness.","zh":"他们先给马装上项夹，然后再连接其他挽具。"}]}],"synonyms":["collar iron","harness fitting","harness hardware"],"phonetic":"/heɪm/","extraExplanation":["“hame”主要出现在传统农耕、马车、伐木等与挽具（harness）相关的语境中，现代日常英语里不常见。常见搭配有：a pair of hames（一副项夹）、fasten the traces to the hames（把牵引带系到项夹上）。注意不要与姓氏或地名混淆。"]}
{"word":"hameil","summary":{"en":"“hameil” is not a standard English word; it’s usually a misspelling or a proper name, sometimes intended to be “email” or “Hamail/hamā’il.”","zh":"“hameil”不是标准英语词；通常是拼写错误或人名，有时其实是想写“email”或文化转写词“Hamail/hamā’il”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a misspelling or a name (proper noun). People sometimes mean “email” or “Hamail/hamā’il” (a cultural term for an amulet case or protective pendant in some Muslim communities).","zh":"不是标准英语单词；最常见的情况是拼写错误或人名（专有名词）。有时人们其实想写“email（电子邮件）”，或“Hamail/hamā’il”（某些穆斯林社群中指护身符袋/护身挂饰的文化词）。"},"examples":[{"en":"I think you meant “email,” not “hameil.”","zh":"我觉得你想写的是“email”，不是“hameil”。"},{"en":"Hameil is also used as a family name in some contexts.","zh":"在一些语境里，Hameil 也会作为姓氏使用。"}]}],"synonyms":["email (if that was intended)","Hamail/hamā’il (alternate spelling, cultural term)"],"phonetic":"/hæˈmeɪl/","extraExplanation":["“hameil”本身在常见英语词典里通常查不到。如果你是在聊天或作业里看到它，最有效的做法是回到原句语境确认：\n1）如果在网络/工作沟通里，极可能是把 email 拼错了；\n2）如果在宗教/文化介绍里，可能是 Hamail/hamā’il 的转写（不同地区会有不同拼法）。\n把包含“hameil”的完整句子发我，我可以帮你判断最可能的意思与正确拼写。"]}
{"word":"hamel","summary":{"en":"“Hamel” is most commonly a surname or a place name; rarely, it can appear in older writing as a form related to “hamlet.”","zh":"“Hamel”最常见是姓氏或地名；较少情况下会在旧文本中作为与“hamlet（小村庄）”相关的写法出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（常见）姓氏：Hamel（哈梅尔/哈默尔等译法）"},"examples":[{"en":"Ms. Hamel will lead today’s meeting.","zh":"哈梅尔女士将主持今天的会议。"},{"en":"I’m looking for Dr. Hamel’s office.","zh":"我在找哈梅尔医生的办公室。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (used for towns/areas), especially in French-speaking regions and in North America.","zh":"地名：Hamel（常用于城镇/地区名），在法语地区及北美较常见"},"examples":[{"en":"He grew up near Hamel, Minnesota.","zh":"他在明尼苏达州的哈梅尔附近长大。"},{"en":"Their flight connected through Hamel on the map, but they didn’t stop there.","zh":"地图上显示他们的路线经过哈梅尔，但并没有在那里停留。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/old) a small village; a variant spelling related to “hamlet.”","zh":"（罕见/旧用）小村庄；与“hamlet（小村庄）”相关的异体拼写"},"examples":[{"en":"In older texts, you may see “hamel” used where modern English prefers “hamlet.”","zh":"在较旧的文本中，你可能会看到用“hamel”来表示现代英语更常用的“hamlet”。"}]}],"synonyms":["(rare/old) hamlet","(rare/old) village"],"phonetic":"/ˈhæməl/","extraExplanation":["“Hamel”在英语里多作为专有名词（姓氏或地名），因此通常不翻成一个固定的普通词义。","读音在不同家庭/地区可能不同：有人读作类似“HAM-uhl”（/ˈhæməl/），也有人更接近“hah-MEL”。如果你是在特定人名或地名里看到它，最好参考当事人或当地常用读法。","如果你的“hamel”来自文学/历史语境，最常见的关联普通词是“hamlet（小村庄）”。"]}
{"word":"hamelia","summary":{"en":"Hamelia is a tropical American shrub genus, especially the ornamental firebush (Hamelia patens).","zh":"Hamelia 指热带美洲的灌木属，尤指常见的观赏植物火灌木（Hamelia patens）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical American shrubs in the coffee family (Rubiaceae), especially the plant Hamelia patens, often grown as an ornamental with clusters of tubular red-orange flowers (also called firebush).","zh":"（植物）哈美利亚属（茜草科）的热带美洲灌木属；尤指常见的 Hamelia patens（常称“火灌木/火焰灌木”），因成簇的橙红色筒状花而常作观赏植物。"},"examples":[{"en":"We planted hamelia near the patio because hummingbirds love its tubular flowers.","zh":"我们在露台附近种了哈美利亚，因为蜂鸟很喜欢它的筒状花。"},{"en":"In warm climates, hamelia can grow into a large shrub with bright red blooms.","zh":"在温暖气候里，哈美利亚能长成较大的灌木，并开出鲜红的花。"}]}],"synonyms":["firebush","scarlet bush"],"phonetic":"/həˈmiːliə/","extraExplanation":["“Hamelia”常见于园艺与植物学语境里；在日常英语中，人们更常说具体物种名“firebush（火灌木）”或“scarlet bush”。","作为观赏植物时，通常强调其吸引蜂鸟、蝴蝶等传粉动物的特性；在热带/亚热带地区也可作绿篱或景观灌木使用。"]}
{"word":"hamelt","summary":{"en":"Hamlet is Shakespeare’s famous tragedy and its main character, the Prince of Denmark.","zh":"Hamlet 指莎士比亚的著名悲剧《哈姆雷特》以及剧中的丹麦王子哈姆雷特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hamlet: the main character (Prince of Denmark) in Shakespeare’s tragedy *Hamlet*; also the title of the play.","zh":"Hamlet（哈姆雷特）：莎士比亚悲剧《Hamlet》的主人公（丹麦王子）；也指这部戏剧的标题。"},"examples":[{"en":"We’re reading *Hamlet* in English class this semester.","zh":"这学期我们在英语课上读《哈姆雷特》。"},{"en":"Hamlet struggles with grief and the question of revenge.","zh":"哈姆雷特在悲伤与复仇的抉择中挣扎。"},{"en":"The actor played Hamlet with a quiet, thoughtful style.","zh":"那位演员用安静而沉思的风格来演哈姆雷特。"}]}],"synonyms":["Shakespeare’s Hamlet","the Prince of Denmark"],"phonetic":"ˈhæmlɪt","extraExplanation":["你输入的“hamelt”更常见的拼写是 **Hamlet**（哈姆雷特）。","《Hamlet》是莎士比亚最著名的悲剧之一，常被用来讨论“犹豫、道德选择、复仇与人性”等主题。","最经典的台词之一是 “**To be, or not to be**”（生存还是毁灭），常用于表达对人生与存在的深刻思考。"]}
{"word":"hamentashen","summary":{"en":"a triangular filled pastry traditionally eaten for Purim","zh":"普珥节常吃的三角夹馅酥饼"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A triangular Jewish pastry (often filled with poppy seed, fruit jam, or chocolate) traditionally eaten during the festival of Purim.","zh":"（犹太传统点心）三角形夹馅酥饼，常在普珥节（Purim）期间食用，内馅常见罂粟籽、果酱或巧克力。"},"examples":[{"en":"We baked hamantaschen with apricot jam for Purim.","zh":"我们为普珥节烤了杏子果酱馅的哈曼塔申。"},{"en":"The bakery sells hamantaschen every spring.","zh":"那家面包店每年春天都会卖哈曼塔申。"}]}],"synonyms":["Purim cookies","filled pastry","triangular pastry"],"phonetic":"/ˈhɑːmənˌtɑːʃən/","extraExplanation":["文化背景：普珥节纪念《以斯帖记》中犹太人脱险的故事。哈曼塔申的三角形外形常被民间解释为“哈曼的帽子/口袋/耳朵”等象征说法；不同社群说法不一，但都指向同一类节庆点心。","用法提示：英语里在菜单、食谱中最常见拼写是 hamantaschen（通常当作复数用），也有人把它当作不可数或单复同形来用。正式写作建议按单数 hamantasch、复数 hamantaschen 区分。"],"etymology":"源自意第绪语（Yiddish）hamantash / hamantaschen；常被解释为与《以斯帖记》中反派哈曼（Haman）相关的点心名称。英语里常用单数 hamantasch、复数 hamantaschen。你输入的 hamentashen 多半是拼写变体/误拼。","mnemonic":["把它想成“哈曼(Haman)+塔申(taschen=小口袋)”：三角小口袋里塞满馅料。","记形：三角形点心＝像把馅料“夹”在三个边里，联想到中文“三角夹馅酥”。"]}
{"word":"hamera","summary":{"en":"“Hamera” is usually a name in English; it may also be a misspelling of “camera” or a transliteration of Hindi/Urdu “hamara/hamera” (“our”).","zh":"“Hamera”在英语里通常是人名；也可能是“camera（相机）”的误拼，或印地语/乌尔都语“hamara/hamera（我们的）”的音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (proper noun). “Hamera” is not a common English vocabulary word; it is most often used as a given name or surname.","zh":"人名（专有名词）。“Hamera”不是常见英语词汇，更常见的用法是作为名字或姓氏。"},"examples":[{"en":"Hamera introduced herself at the meeting.","zh":"Hamera 在会议上做了自我介绍。"},{"en":"I saw the name Hamera on the class list.","zh":"我在班级名单上看到了 Hamera 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"In learner contexts, “hamera” is sometimes a misspelling of “camera” or a transliteration of the Hindi/Urdu word “hamara/hamera” meaning “our.”","zh":"在学习者语境中，“hamera”有时是 “camera（相机）” 的拼写错误，或是印地语/乌尔都语 “hamara/hamera（我们的）” 的音译写法。"},"examples":[{"en":"Did you mean “camera”?","zh":"你想写的是 “camera（相机）” 吗？"},{"en":"In Hindi/Urdu, “hamara/hamera” can mean “our,” as in “hamara ghar” (“our home”).","zh":"在印地语/乌尔都语里，“hamara/hamera” 可以表示“我们的”，例如 “hamara ghar”（“我们的家”）。"}]}],"synonyms":["(name)","camera (possible intended word)","hamara (Hindi/Urdu, “our”)"],"phonetic":"/həˈmɛrə/","extraExplanation":["“Hamera”作为英语词典词条并不常见，所以正确理解要看上下文：它是人名？还是你想写“camera”？如果你把原句发我，我可以帮你判断并改正拼写/用法。","关于“hamara/hamera（我们的）”：不同地区与拼写体系会造成转写差异（如 hamara/hamera/hamraa），但这属于南亚语言的用法，不是英语本身的词汇。"]}
{"word":"hamerkop","summary":{"en":"an African wetland bird with a hammer-shaped head, famous for huge nests","zh":"非洲湿地涉禽，头形似锤子，以巨大鸟巢闻名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medium-sized African wading bird with a distinctive hammer-shaped head and a crest, known for building very large nests; also called the hammerhead.","zh":"一种非洲的中型涉禽，头部侧面轮廓像“锤子”并有小冠羽，以筑造巨大鸟巢而闻名；也叫“锤头鹳/锤头鸟”（hammerhead）。"},"examples":[{"en":"We spotted a hamerkop standing still at the edge of the marsh, watching for frogs.","zh":"我们看到一只锤头鸟静静站在沼泽边，等着抓青蛙。"},{"en":"The guide pointed out a huge stick nest and said it belonged to a hamerkop.","zh":"向导指着一个巨大的树枝巢，说那是锤头鸟的巢。"}]}],"synonyms":["hammerhead","hammerhead bird"],"phonetic":"/ˈhɑmərˌkɑp/","extraExplanation":["常见栖息地包括非洲的湿地、河岸、稻田与水塘边，常单独活动，食物以鱼、小型两栖类与昆虫为主。","它们的巢非常夸张：用树枝搭成的大型“房子式”结构，有时大到能让其他动物也来借住，因此在一些地方文化与民间故事里也常被提到。"],"etymology":"来自南非荷兰语（Afrikaans）hamerkop，直译为“锤子头”（hamer=锤子，kop=头），因其头部形状得名。","mnemonic":["把它拆开记：hamer（锤子）+ kop（头）=“锤子头”，联想到它独特的“锤状头型”。","想象“锤子头”在水边“敲”鱼和青蛙吃，画面感强更好记。"]}
{"word":"hames","summary":{"en":"Hames are the two curved pieces on a horse’s collar that help connect it to the pulling straps.","zh":"hames 指马具颈圈两侧的弯曲硬质部件，用来连接牵引带以便拉车/犁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the two curved pieces of wood or metal attached to a horse’s collar, used to connect the collar to the traces (straps) for pulling a cart or plow","zh":"（马具）挽具颈圈两侧的弯曲木/金属条（用来连接牵引带，使马能拉车或犁）"},"examples":[{"en":"The farmer checked the hames before hitching the horse to the wagon.","zh":"农夫在把马套上车之前检查了挽具颈圈两侧的弯条。"},{"en":"The old harness had rusty hames but the leather was still strong.","zh":"那副旧马具的弯条生锈了，但皮带仍然结实。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to fit or attach hames to a horse’s collar","zh":"（罕见）给马的颈圈装上挽具弯条"},"examples":[{"en":"They hamed the horse and led it to the field.","zh":"他们给马装好挽具弯条，然后牵它到田里。"}]}],"synonyms":["hame (singular)","harness fittings","collar irons"],"phonetic":"/heɪmz/","extraExplanation":["“hames”多见于与农业、马车、传统畜力相关的语境；现代日常英语里不常用，更多会在历史题材、乡村生活描写或马具说明中出现。","辨析：hames 是硬质部件（木/金属），而 collar（颈圈）通常是垫在马颈部的软垫结构；traces 则是从马身连接到车辆/犁的牵引带。"]}
{"word":"hamesoken","summary":{"en":"Hamesoken (also spelled hamesucken) is a historical Scots law term for a violent home invasion—breaking into a home and assaulting the people inside.","zh":"Hamesoken（也作 hamesucken）是苏格兰法律中的历史术语，指带暴力的入室侵害：闯入住宅并袭击屋内人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots law, historical) The crime of violently breaking into someone’s home to assault or harm the people inside; home invasion with violence.","zh":"（苏格兰法律，历史用语）以暴力闯入他人住宅并袭击或伤害屋内人员的罪行；带暴力的入室侵害。"},"examples":[{"en":"In old Scots legal records, hamesoken was treated as a very serious offense because it attacked a person’s safety at home.","zh":"在古老的苏格兰法律记录中，hamesoken 被视为重罪，因为它侵犯了人在家中的安全。"},{"en":"The lawyer explained that hamesoken involved not just breaking in, but also violence against the occupants.","zh":"律师解释说，hamesoken 不仅是闯入，还包括对屋内居住者施暴。"}]}],"synonyms":["home invasion","violent break-in","hamesucken"],"phonetic":"/ˈheɪmˌsʌkən/","extraExplanation":["你输入的 **hamesoken** 很可能是 **hamesucken / hamesucken (也写作 hamesoken)** 的拼写变体，属于苏格兰法（Scots law）的历史术语，现代英语里很少在日常场景使用。","词源大意可理解为“家（home）+ 寻求/攻击（seek/attack）”，强调的是在“家宅”这一空间内发生的暴力侵害，因此比普通的 burglary（入室盗窃）更侧重“对屋内人的暴力”。","相关近义表达（现代更常见）：**home invasion**, **violent break-in**；在法律语境中可根据地区用 **aggravated burglary**（加重入室盗窃）等更通用的说法。"]}
{"word":"hamesucken","summary":{"en":"Hamesucken is a Scottish legal term for an assault committed against someone in their own home.","zh":"Hamesucken 是苏格兰法律术语，指在受害者自己家中对其实施的袭击（入宅行凶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish law) An assault or violent attack committed against someone in their own home (a serious offense historically treated as more aggravated than ordinary assault).","zh":"（苏格兰法律）“入宅行凶/家中袭击”：在受害者自己家中对其实施的袭击或暴力攻击（历史上通常被视为比一般袭击更严重的罪行）。"},"examples":[{"en":"The charge was hamesucken because the victim was attacked in his own house.","zh":"由于受害者是在自己家中遭到袭击，因此该指控属于 hamesucken（入宅行凶）。"},{"en":"In older Scottish cases, hamesucken was treated as an aggravated form of assault.","zh":"在较早的苏格兰判例中，hamesucken 常被视为加重的袭击罪。"}]}],"synonyms":["(home invasion)","aggravated assault (in the home)","assault in the victim’s dwelling"],"phonetic":"ˈheɪmˌsʌkən","extraExplanation":["这是一个主要出现在苏格兰法律语境中的古老术语：它强调“家庭/住所的神圣与安全”被侵犯，因此在传统观念里比一般街头斗殴更恶劣。","词源上来自苏格兰语（Scots），大意接近“到别人家里去（寻到家中）并施暴”。现代英语日常交流中极少使用，多见于法律史、判例讨论或苏格兰背景的文本。"]}
{"word":"hametugs","summary":{"en":"“hametugs” is not a recognized English word; it’s likely a typo or a coined term.","zh":"“hametugs”不是常见英语词；更可能是拼写错误或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a username, or a made-up term, so it doesn’t have an established dictionary meaning.","zh":"不是标准英语单词。更可能是拼写错误、用户名或自造词，因此没有公认的词典释义。"},"examples":[{"en":"I couldn’t find “hametugs” in a dictionary—did you mean “hamlets” or “hammertoes”?","zh":"我在词典里找不到“hametugs”——你是不是想写“hamlets（小村庄）”或“hammertoes（槌状趾）”？"},{"en":"Could you share the sentence where you saw “hametugs”? Context will help me identify the intended word.","zh":"你能把看到“hametugs”的句子发我吗？有上下文我更容易判断你想表达的词。"}]}],"phonetic":"/ˈhɑːməˌtʌɡz/","extraExplanation":["“hametugs”很可能是拼写误差（例如键盘误触/自动纠错失败）或特定圈子里的自造词。你可以：\n1）提供它出现的完整句子；\n2）说明它来自哪里（游戏、社交平台、书名、视频字幕等）；\n3）如果是你想拼的词，告诉我你想表达的中文意思（比如“拖拽/拽人/小村庄/脚趾疾病”等），我可以帮你匹配最可能的英文词。","一些可能的接近拼写（仅供参考，需看语境）：\n- hamlets（小村庄，复数）\n- hammertoes（槌状趾，医学）\n- hame（马具的一部分）+ tugs（牵引带/拉拽，复数）——这是“马具/缰具”相关搭配的可能性，但“hametugs”连写不常见。"]}
{"word":"hametz","summary":{"en":"Hametz is leavened/fermented grain food that Jewish law forbids during Passover.","zh":"Hametz 指犹太教律法中逾越节期间禁止的“发酵膨松的谷物食物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"in Jewish law, any food made from certain grains (especially wheat, barley, rye, oats, or spelt) that has been allowed to ferment and become leavened; it is forbidden to eat or keep during Passover (Pesach)","zh":"（犹太教律法）指由特定谷物（常见为小麦、大麦、黑麦、燕麦或斯佩耳特小麦）制成、经过发酵而“膨松”的食物；在逾越节（Pesach）期间禁止食用或持有"},"examples":[{"en":"Before Passover, many families clean the house to remove any hametz.","zh":"逾越节前，许多家庭会打扫房子，清除任何 hametz。"},{"en":"Bread and regular pasta are usually considered hametz during Passover.","zh":"逾越节期间，面包和普通意大利面通常都算是 hametz。"},{"en":"Some products are labeled “kosher for Passover” to show they contain no hametz.","zh":"有些商品会标注“逾越节可食用（kosher for Passover）”，表示不含 hametz。"}]}],"synonyms":["chametz","leavened food (during Passover)"],"phonetic":"/hɑˈmɛts/","extraExplanation":["hametz 也常见拼写为 chametz（不同转写方式）。在逾越节语境里，它不仅指“发酵的面食”，也常泛指一切与发酵/膨松有关、需要避免的谷物食品。","在实际生活中，人们会区分“含 hametz 的食物”与“逾越节可食用（kosher for Passover）”的食物；后者常见代表是 matzah（无酵饼）。","这是一个高度文化与宗教语境词汇，日常英语里多出现在谈论犹太节日、饮食规定、家庭清洁与仪式等话题中。"]}
{"word":"hamewith","summary":{"en":"“hamewith” isn’t an English word; it’s likely a typo for “same with” (“me too / same here”).","zh":"“hamewith”不是英文单词；多半是把“same with”（我也是/对我也一样）打错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“hamewith” is not a standard English word. It is most likely a typo for “same with” (meaning “me too / that is also true for me”) or for “ham with” (rare; usually just means “ham served together with something”).","zh":"“hamewith”不是标准英文单词。它很可能是把“same with”（表示“我也是/对我也一样”）或“ham with”（较少见，通常只是指“火腿搭配某物”）打错了。"},"examples":[{"en":"A: I can’t go today. B: Same with me.","zh":"A：我今天去不了。B：我也是。"},{"en":"A: I like coffee in the morning. B: Same with me.","zh":"A：我早上喜欢喝咖啡。B：我也是。"},{"en":"They ordered a sandwich: ham with cheese.","zh":"他们点了一个三明治：火腿配芝士。"}]}],"synonyms":["same here","me too","likewise"],"phonetic":"/seɪm/","extraExplanation":["“same with”更自然的口语说法常见有：\n- “Same here.”（我也是/我这边也一样）\n- “Me too.”（我也是）\n- “Same with me.”（也可以，但比“Same here”稍不口语、稍强调“对我也一样”）\n如果你想表达“和……一样”，通常用：\n- “the same as …” 例：This is the same as yesterday.（这和昨天一样）\n你可以告诉我你原句是什么，我能帮你确定到底想写哪一个。"]}
{"word":"hamfare","summary":{"en":"“Hamfare” is not a standard English word; it is probably a misspelling (often of “hamper”) or an intended phrase (“ham fare”).","zh":"“hamfare”不是标准英文单词；多半是拼写错误（常见为“hamper”）或想表达短语“ham fare”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a mistaken form. People most often mean “hamper” (to hinder) or the phrase “ham fare” (food made from ham).","zh":"不是常见词典中的标准英语单词；很可能是拼写错误或误写。最常见的可能是想写“hamper”（妨碍、阻碍）或短语“ham fare”（以火腿为主的食物）。"},"examples":[{"en":"I can’t find “hamfare” in a dictionary—did you mean “hamper” or “ham fare”?","zh":"我在词典里找不到“hamfare”——你是不是想写“hamper”或“ham fare”？"},{"en":"If you meant “hamper,” you could say: “The rain hampered our plans.”","zh":"如果你想表达“hamper”，可以说：“The rain hampered our plans.”（雨妨碍了我们的计划。）"},{"en":"If you meant “ham fare,” you could say: “They served simple ham fare at the picnic.”","zh":"如果你想表达“ham fare”，可以说：“They served simple ham fare at the picnic.”（野餐上提供了简单的火腿类食物。）"}]}],"phonetic":"/ˈhæmˌfɛr/","extraExplanation":["“hamfare”看起来像把两个词黏在一起（ham + fare），或把某个词拼错了。你可以把原句发我，我能根据上下文判断你要表达的是“hamper / hamper (n.)（篮子）”、还是“ham fare（火腿类食物）”，或其他词。"]}
{"word":"hamfat","summary":{"en":"“Hamfat” is informal slang meaning clumsy or heavy-handed, or a clumsy person.","zh":"“hamfat”是非正式俚语，指“笨拙/手法生硬”，也可指“笨手笨脚的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"clumsy, heavy-handed, or lacking skill (often describing a person’s actions, writing, or attempts to be subtle).","zh":"笨拙的；手法生硬的；缺乏技巧的（常形容做事、写作或想“含蓄”却很不自然）。"},"examples":[{"en":"His hamfat editing made the story harder to follow.","zh":"他生硬笨拙的剪辑让故事更难看懂。"},{"en":"That joke felt hamfat and obvious, not clever.","zh":"那个笑话显得很生硬、太直白，并不机智。"},{"en":"She tried to apologize, but it came out hamfat.","zh":"她想道歉，但表达得很笨拙。"}]},{"partOfSpeech":"n.","definition":{"en":"a clumsy or heavy-handed person; someone who lacks finesse (informal, mildly insulting).","zh":"笨手笨脚的人；做事粗糙的人（非正式，略带贬义）。"},"examples":[{"en":"Don’t let that hamfat handle the fragile equipment.","zh":"别让那个笨手笨脚的人去搬弄易碎设备。"},{"en":"He’s a bit of a hamfat with social situations.","zh":"他在社交场合有点笨拙。"}]}],"synonyms":["clumsy","awkward","heavy-handed","ham-fisted","inept"],"phonetic":"/ˈhæmˌfæt/","extraExplanation":["“hamfat”是非常口语、较少见的说法，常被理解为“ham-fisted（笨拙的／手法粗糙的）”的变体或缩略。ham-fisted 字面是“像火腿一样的拳头”，暗示手很大、动作不灵巧，因此引申为“做事粗”“不够细腻”。","语气提示：用来形容他人时可能显得不礼貌；更中性一点可以用 clumsy / awkward / heavy-handed。"]}
{"word":"hamfatter","summary":{"en":"Hamfatter is an old-fashioned slang noun meaning an overly dramatic, bad actor; less commonly, it can mean a ham radio operator.","zh":"hamfatter 是较老派的俚语名词，主要指夸张拙劣的演员；较少情况下也可指业余无线电（火腿）玩家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bad or overly dramatic actor; a “ham” performer (often used as an insult).","zh":"（贬义）拙劣或过度夸张的演员；“蹩脚的演技派”。"},"examples":[{"en":"The critic called him a hamfatter who turned every scene into melodrama.","zh":"影评人说他是个蹩脚夸张的演员，把每一场戏都演成了狗血剧。"},{"en":"She can be funny, but sometimes her acting slips into hamfatter territory.","zh":"她可以很搞笑，但有时演着演着就变得很浮夸、很“蹩脚”。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a ham radio operator.","zh":"（较少见）业余无线电爱好者（火腿无线电玩家）。"},"examples":[{"en":"At the meet-up, old-time hamfatters swapped stories about antennas and signals.","zh":"在聚会上，老火腿们交流天线和信号的故事。"}]}],"synonyms":["ham (actor)","hammy actor","overactor","bad actor"],"phonetic":"/ˈhæmˌfætɚ/","extraExplanation":["这个词比较老派、口语色彩强，常见于19—20世纪的美国舞台/杂耍（vaudeville）语境里，用来嘲讽“用力过猛、表演油腻”的演员。","“ham”本身就可指“浮夸的演员/表演”，hamfatter是更尖刻、更戏谑的说法；在现代英语里相对少见，更多会直接说ham actor / hammy.","少数情况下它也被用来指“ham radio（火腿无线电）玩家”，但这一用法不如直接说ham operator常见。"]}
{"word":"hamhung","summary":{"en":"Hamhung: a large city in northeastern North Korea, capital of South Hamgyong Province.","zh":"Hamhung（咸兴）：朝鲜东北部的大城市，咸镜南道首府。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Hamhung is a major city in northeastern North Korea and the capital of South Hamgyong Province.","zh":"咸兴是朝鲜东北部的一座重要城市，也是咸镜南道的首府。"},"examples":[{"en":"Hamhung is known as an industrial center in North Korea.","zh":"咸兴在朝鲜以工业中心而闻名。"},{"en":"The dish Hamhung naengmyeon originally comes from the Hamhung area.","zh":"“咸兴冷面”这道菜最初源自咸兴一带。"}]}],"synonyms":["Hamhŭng","Hamhung-si"],"phonetic":"/hɑmˈhʊŋ/","extraExplanation":["“Hamhung”常见于英文新闻与地理语境中，是朝鲜城市名的英语拼写；也可见较学术/旧式的拼写如“Hamhŭng”（带变音符号）或“Hamhung-si”（意为“咸兴市”）。","在韩式饮食文化里，“Hamhung naengmyeon（咸兴冷面）”是更常见的相关表达：传统上多用较有嚼劲的面（常以地瓜淀粉制作），拌辣酱食用；现代在韩国餐馆中也很常见。"]}
{"word":"Hamhung-si","summary":{"en":"a northeastern North Korean provincial capital and industrial city","zh":"朝鲜东北部的省会级工业城市"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major industrial city in northeastern North Korea, the capital of South Hamgyong Province.","zh":"朝鲜（北韩）东北部的重要工业城市，咸镜南道道府（首府）所在地。"},"examples":[{"en":"Hamhung-si is known for heavy industry and chemical production.","zh":"咸兴市以重工业和化学工业著称。"},{"en":"The train route connects Pyongyang with cities such as Hamhung-si.","zh":"这条铁路线路连接平壤与咸兴市等城市。"}]}],"synonyms":["Hamhung","Hamhŭng"],"phonetic":"/hɑmˈhʊŋ si/","extraExplanation":["“-si(시)”相当于中文的“市”，常见于朝鲜半岛地名的罗马字转写中（例如某某-si）。","中文里常译为“咸兴”，也常与“咸兴冷面”（함흥냉면）一起被提到，是一种有名的韩式冷面。"],"etymology":"源自韩语地名“함흥”(Hamhung)；“-si/市”(시)是韩国语行政区划后缀，表示“市”。英语里常用连字符写作“Hamhung-si”。","mnemonic":["把“-si”记成“市”：看到“XXX-si”就联想到“XXX市”。","联想“咸兴冷面”：咸兴（Hamhung）→ 冷面很有名，帮助记住这是一个城市名。"]}
{"word":"hami","summary":{"en":"Hami is a place name in Xinjiang, China, and it can also mean the famous sweet “Hami melon.”","zh":"Hami 指中国新疆的哈密（地名），也可指著名的水果“哈密瓜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city and region in eastern Xinjiang, China (also spelled Kumul).","zh":"哈密（中国新疆东部的城市与地区；也可写作 Kumul）。"},"examples":[{"en":"Hami is an important stop along the ancient Silk Road route in Xinjiang.","zh":"哈密是新疆古丝绸之路线路上的重要驿站。"},{"en":"She traveled from Urumqi to Hami by train.","zh":"她从乌鲁木齐坐火车到哈密。"}]},{"partOfSpeech":"n.","definition":{"en":"a sweet, fragrant melon associated with Hami; in English often called a Hami melon.","zh":"哈密瓜（以哈密著名的一种香甜瓜；英语常说 Hami melon）。"},"examples":[{"en":"We bought a Hami melon for dessert.","zh":"我们买了一个哈密瓜当甜点。"},{"en":"Hami melon is known for its crisp texture and strong aroma.","zh":"哈密瓜以爽脆的口感和浓郁的香气闻名。"}]}],"synonyms":["Hami melon","Kumul"],"phonetic":"/ˈhɑːmi/","extraExplanation":["“Hami”在英文里多作专有名词，既指地名（哈密/库木勒 Kumul），也常用来指当地出名的瓜（Hami melon）。在菜单或水果摊上看到“hami”通常就是指“哈密瓜”。","拼写提示：英文里也可能见到“Kumul”这一地名拼写；在不同语言与转写系统中会有差异。"]}
{"word":"Hamidian","summary":{"en":"Connected to Ottoman Sultan Abdul Hamid II or his era; often linked to the mid-1890s massacres.","zh":"与奥斯曼苏丹阿卜杜勒·哈米德二世及其时代相关；常指19世纪90年代的“哈米德大屠杀”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Sultan Abdul Hamid II of the Ottoman Empire (r. 1876–1909) or to his government and time period.","zh":"与奥斯曼帝国苏丹阿卜杜勒·哈米德二世（1876–1909在位）及其政权、时代有关的。"},"examples":[{"en":"The museum has a small display of Hamidian-era photographs from Istanbul.","zh":"博物馆里有一小部分伊斯坦布尔的哈米德二世时期照片展品。"},{"en":"Some reforms were proposed during the Hamidian period but faced strong resistance.","zh":"哈米德二世时期提出过一些改革，但遭到强烈阻力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Specifically referring to the mass violence against Armenians in the Ottoman Empire in the mid-1890s, often called the Hamidian massacres.","zh":"特指19世纪90年代中期奥斯曼帝国境内针对亚美尼亚人的大规模暴力事件，常称“哈米德大屠杀”。"},"examples":[{"en":"The chapter discusses international reactions to the Hamidian massacres.","zh":"这一章讨论了国际社会对哈米德大屠杀的反应。"},{"en":"Survivor accounts describe the fear that spread during the Hamidian killings.","zh":"幸存者的叙述描绘了哈米德屠杀期间蔓延的恐惧。"}]}],"synonyms":["Abdulhamid-era","Abdulhamid-related","Abdul Hamid II's"],"phonetic":"/həˈmɪdiən/","extraExplanation":["历史语境提示：在英语史学写作中，Hamidian 常与 Ottoman（奥斯曼的）、Abdul Hamid II（阿卜杜勒·哈米德二世）并用；最常见的固定搭配之一是 Hamidian massacres，用于指代19世纪90年代的相关暴力事件。涉及此主题时，建议使用中性、准确的表述，并注意不同资料来源的叙述角度。"],"etymology":"源自人名 Hamid（阿拉伯语人名“哈米德”）+ 英语形容词后缀 -ian（表示“……的/与……有关的”），用来指涉阿卜杜勒·哈米德二世及其统治时期。","mnemonic":["把 -ian 记成“……的”：Hamid + ian ≈ “哈米德（相关）的”。","联想常见搭配：Hamidian + period / era（时期），Hamidian + massacres（历史事件名）。"]}
{"word":"hamidian","summary":{"en":"Hamidian describes things connected to Ottoman Sultan Abdul Hamid II or, more specifically, to events during his rule such as the Hamidian massacres.","zh":"Hamidian 用来描述与奥斯曼帝国苏丹阿卜杜勒·哈米德二世或其统治时期相关的事物，尤其可指与哈米德大屠杀等事件有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Ottoman Sultan Abdul Hamid II (ruled 1876–1909) or his period of rule","zh":"与奥斯曼帝国苏丹阿卜杜勒·哈米德二世（1876–1909在位）或其统治时期有关的"},"examples":[{"en":"The novel is set in the Hamidian era of the Ottoman Empire.","zh":"这部小说以奥斯曼帝国的哈米德时期为背景。"},{"en":"Historians debate how Hamidian policies shaped later reforms.","zh":"历史学家讨论哈米德时期的政策如何影响后来的改革。"}]},{"partOfSpeech":"adj.","definition":{"en":"connected to the Hamidian massacres (1894–1896), large-scale violence against Armenians in the Ottoman Empire","zh":"与“哈米德大屠杀”（1894–1896）有关的，即奥斯曼帝国境内针对亚美尼亚人的大规模暴力事件"},"examples":[{"en":"The museum has an exhibit on Hamidian massacres and survivor testimonies.","zh":"这家博物馆有一个关于哈米德大屠杀及幸存者证词的展览。"},{"en":"She studied international reactions to the Hamidian violence.","zh":"她研究了国际社会对哈米德时期暴力事件的反应。"}]}],"synonyms":["Abdulhamid II–era","Ottoman (context-dependent)","Abdulhamidian (less common)"],"phonetic":"/həˈmɪdiən/","extraExplanation":["“Hamidian”主要用于历史语境，来自苏丹 Abdul Hamid II 的名字。英语里常见搭配包括：Hamidian era（哈米德时期）、Hamidian regime（哈米德政权）、Hamidian massacres（哈米德大屠杀）。","与日常英语不同，它更像学术/历史写作中的专名形容词。写作时通常首字母大写：Hamidian。","相关词还会见到“Abdulhamid II / Abdulhamid II’s reign（阿卜杜勒·哈米德二世/其在位时期）”等表述，用来避免误解或增加准确性。"]}
{"word":"hamidieh","summary":{"en":"Hamidiye is a proper name most often linked to Sultan Abdulhamid II—especially the Hamidiye Cavalry—and it can also be a place name in Turkey.","zh":"Hamidiye 是一个专有名词，多与奥斯曼苏丹阿卜杜勒哈米德二世相关（尤其指哈米迪耶骑兵），也可作为土耳其的地名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A name used for things associated with Sultan Abdulhamid II of the Ottoman Empire—most famously the Hamidiye (Hamidiye Cavalry), an Ottoman tribal cavalry force formed in the 1890s.","zh":"（专有名词）与奥斯曼帝国苏丹阿卜杜勒哈米德二世相关的名称——最常见指“哈米迪耶骑兵/哈米迪耶军”（Hamidiye Cavalry），即19世纪90年代组建的奥斯曼部族骑兵部队。"},"examples":[{"en":"The Hamidiye Cavalry played a controversial role in eastern Anatolia in the late 19th century.","zh":"19世纪末，哈米迪耶骑兵在安纳托利亚东部扮演了颇具争议的角色。"},{"en":"In some history books, “Hamidiye” refers to units created under Sultan Abdulhamid II.","zh":"在一些历史书中，“Hamidiye”指的是在苏丹阿卜杜勒哈米德二世时期建立的部队。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A place name (toponym) used in Turkey and nearby regions, often written as Hamidiye or Hamidiye(h); it may refer to a neighborhood, village, or district depending on context.","zh":"（专有名词）土耳其及周边地区的地名，常写作 Hamidiye（有时也见不同拼写）；具体可能指某个社区、村庄或行政区，需看语境。"},"examples":[{"en":"The address lists Hamidiye as the neighborhood name.","zh":"这个地址里把 Hamidiye 写作社区名称。"},{"en":"They drove through Hamidiye on the way to the coast.","zh":"他们去海边的路上经过了 Hamidiye。"}]}],"synonyms":["Hamidiye Cavalry","Hamidian"],"phonetic":"/ˌhɑːmɪˈdiːjeɪ/","extraExplanation":["“Hamidiye/哈米迪耶”通常来自奥斯曼苏丹阿卜杜勒哈米德二世（Abdülhamid II）的名字，意思类似“属于（或为纪念）哈米德的”。因此它既可能指军事编制（如 Hamidiye Cavalry），也可能出现在地名、机构名中。","英语文本里常见拼写是 Hamidiye；土耳其语中与之相关的人名/形容形式还可能见到 Hamidian（英语形容词，用于“阿卜杜勒哈米德二世时期的/与其有关的”）。"]}
{"word":"hamiform","summary":{"en":"“Hamiform” means hook-shaped, usually used in scientific descriptions.","zh":"“hamiform”意为“钩状的”，多用于科学或医学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hook-shaped; curved like a hook.","zh":"钩状的；像钩子一样弯曲的。"},"examples":[{"en":"The surgeon described the instrument as hamiform at the tip for better grip.","zh":"外科医生说这件器械的尖端是钩状的，便于抓握。"},{"en":"Some bones have a hamiform process that helps muscles attach.","zh":"有些骨头有钩状突起，帮助肌肉附着。"},{"en":"Under the microscope, the pollen grains looked slightly hamiform.","zh":"在显微镜下，这些花粉颗粒看起来有点钩状。"}]}],"synonyms":["hook-shaped","hooklike","uncinate","curved"],"phonetic":"ˈhæmɪfɔrm","extraExplanation":["“hamiform”常见于解剖学、动物学和植物学等较正式的科学语境，用来形容结构“呈钩形”。","词源来自拉丁语 hamus（钩子）+ -form（形状），因此字面意思就是“钩子形的”。在日常英语中更常用 hook-shaped。"]}
{"word":"Hamilcar","summary":{"en":"an ancient Carthaginian male name, especially that of Hamilcar Barca","zh":"古代迦太基男性人名，尤指哈米尔卡·巴尔卡"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name from the ancient Carthaginian/Punic world, best known from Hamilcar Barca, a general of Carthage and father of Hannibal.","zh":"古代迦太基（腓尼基-布匿）男性人名；最常见于“哈米尔卡·巴尔卡”，迦太基将军、汉尼拔之父。"},"examples":[{"en":"Hamilcar Barca led Carthaginian forces during the First Punic War.","zh":"哈米尔卡·巴尔卡在第一次布匿战争期间率领迦太基军队。"},{"en":"The name Hamilcar is often mentioned in accounts of Hannibal’s upbringing.","zh":"在讲述汉尼拔成长经历的记载中，经常会提到哈米尔卡这个名字。"}]}],"synonyms":["Hamilcar Barca"],"phonetic":"/həˈmɪl.kɑr/","extraExplanation":["历史背景：哈米尔卡·巴尔卡（Hamilcar Barca）是迦太基的重要军事统帅，活跃于第一次布匿战争后期及其后；他在伊比利亚半岛的经营为后来的汉尼拔远征罗马奠定了基础。","拼写与读音提示：英语里常见写法为 Hamilcar，重音通常落在第一个音节。"],"etymology":"源自布匿语（迦太基使用的闪米特语支语言）人名，常被解释为“梅尔卡特（Melqart）是恩典/赐福者”之类的含义；经希腊语、拉丁语转写后进入现代语言中。","mnemonic":["把它拆开记：Hami-（像“哈米”）+ -lcar（像“卡尔”/“car”），联想到“哈米尔卡”这个历史人物名字。","联想链：Hamilcar（哈米尔卡）→ Hannibal（汉尼拔）→ Carthage（迦太基），一串记住古代地中海历史关键词。"]}
{"word":"hamilt","summary":{"en":"“Hamilt” is an informal short form of “Hamilton.”","zh":"“Hamilt”是“Hamilton”的非正式简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal shortening of “Hamilton,” used mainly in notes, texting, or as a clipped name (often referring to a person’s surname, a place name, or the title “Hamilton”).","zh":"“Hamilton”的非正式缩写/截短形式，多见于笔记、短信或口语中的简称（常指姓氏、人名/地名，或作品名《Hamilton》）。"},"examples":[{"en":"I’ll meet you at Hamilt Station at 6.","zh":"我6点在 Hamilt 车站跟你碰面。"},{"en":"Ask Hamilt to email the final draft.","zh":"让 Hamilt 把最终稿用邮件发来。"}]}],"synonyms":["Hamilton"],"phonetic":"/ˈhæmɪlt/","extraExplanation":["“Hamilt”本身不是常见的标准英语词条，更像是把 “Hamilton” 截短后的写法。正式写作（邮件、论文、新闻、合同等）通常应写全 “Hamilton”，避免让读者困惑。","“Hamilton”在英语文化中很常见：既可以是姓氏/人名（如美国开国元勋 Alexander Hamilton），也可以是地名（多国都有叫 Hamilton 的城市/城镇），还可能指音乐剧《Hamilton》。具体含义需要看上下文。"]}
{"word":"Hamilton","summary":{"en":"Hamilton is usually a proper noun: a surname, Alexander Hamilton (U.S. Founding Father), the musical “Hamilton,” or a place name.","zh":"Hamilton 通常是专有名词：可指姓氏、美国开国元勋亚历山大·汉密尔顿、音乐剧《汉密尔顿》，或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A common English surname; also used as a given name.","zh":"（专有名词）常见的英文姓氏；也可作名字。"},"examples":[{"en":"My teacher’s last name is Hamilton.","zh":"我老师的姓是 Hamilton。"},{"en":"I met a woman named Hamilton at the conference.","zh":"我在会议上认识了一位名叫 Hamilton 的女士。"}]},{"partOfSpeech":"n.","definition":{"en":"Alexander Hamilton (1755–1804): an American Founding Father, the first U.S. Secretary of the Treasury, and a key writer of the Federalist Papers.","zh":"亚历山大·汉密尔顿（1755–1804）：美国开国元勋之一，首任美国财政部长，也是《联邦党人文集》的重要作者。"},"examples":[{"en":"In U.S. history class, we studied Hamilton’s economic plan.","zh":"在美国历史课上，我们学习了汉密尔顿的经济计划。"},{"en":"Hamilton helped shape the early U.S. financial system.","zh":"汉密尔顿帮助塑造了美国早期的金融体系。"}]},{"partOfSpeech":"n.","definition":{"en":"Hamilton: a hit Broadway musical by Lin-Manuel Miranda about Alexander Hamilton, known for using rap and diverse casting.","zh":"《汉密尔顿》：林-曼努埃尔·米兰达创作的百老汇热门音乐剧，讲述亚历山大·汉密尔顿的故事，以说唱风格和多元选角闻名。"},"examples":[{"en":"We got tickets to see Hamilton next month.","zh":"我们买到了下个月去看《汉密尔顿》的票。"},{"en":"Many songs from Hamilton became popular online.","zh":"《汉密尔顿》里的很多歌曲在网上很火。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (e.g., the city of Hamilton in Ontario, Canada; and several towns in the U.S., Australia, and New Zealand).","zh":"地名：如加拿大安大略省的汉密尔顿市；以及美国、澳大利亚、新西兰等地的多个同名城镇。"},"examples":[{"en":"She lives in Hamilton, Ontario.","zh":"她住在加拿大安大略省的汉密尔顿。"},{"en":"Our flight connects through Hamilton.","zh":"我们的航班要经停汉密尔顿。"}]}],"synonyms":["(surname) —","(Alexander Hamilton) —","(musical) —"],"phonetic":"ˈhæmɪltən","extraExplanation":["在英语里，Hamilton 多数情况下是“专有名词”（人名/地名/作品名），所以写作时通常首字母大写。","如果你在美国文化语境中看到 Hamilton，常常指两件事：一是历史人物亚历山大·汉密尔顿；二是以他为主角的音乐剧《汉密尔顿》。两者在对话里一般靠上下文区分。"]}
{"word":"hamiltonian","summary":{"en":"Hamiltonian usually means “related to the Hamiltonian (energy-based) formulation,” or it can mean the Hamiltonian itself—the energy function/operator of a system.","zh":"Hamiltonian 通常指“与哈密顿量（以能量为核心的表述）有关的”，也可指“哈密顿量本身”，即系统的能量函数/算符。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Physics/Math) relating to the Hamiltonian function or Hamilton’s equations in classical mechanics; used to describe a system, method, or form of mechanics based on energy.","zh":"（物理/数学）与哈密顿量或哈密顿方程有关的；用于描述以能量为核心的力学体系、方法或表述形式（哈密顿力学）。"},"examples":[{"en":"Hamiltonian mechanics is often compared with Lagrangian mechanics.","zh":"哈密顿力学常常与拉格朗日力学作比较。"},{"en":"We rewrote the problem in Hamiltonian form to track energy more clearly.","zh":"我们把问题改写成哈密顿形式，以更清楚地追踪能量。"}]},{"partOfSpeech":"n.","definition":{"en":"(Physics/Math) the Hamiltonian: a function (or operator in quantum mechanics) that represents the total energy of a system and governs its time evolution.","zh":"（物理/数学）哈密顿量：表示系统总能量的函数（在量子力学中常为算符），并决定系统随时间的演化。"},"examples":[{"en":"For this oscillator, the Hamiltonian equals kinetic energy plus potential energy.","zh":"对这个振子而言，哈密顿量等于动能加势能。"},{"en":"In quantum mechanics, the Hamiltonian determines how a wavefunction changes over time.","zh":"在量子力学中，哈密顿量决定波函数如何随时间变化。"}]}],"synonyms":["energy function","Hamilton operator","H (Hamiltonian)"],"phonetic":"/ˌhæmɪlˈtoʊniən/","extraExplanation":["“Hamiltonian”来自19世纪爱尔兰数学家与物理学家 William Rowan Hamilton（威廉·罗恩·哈密顿）。在经典力学里，哈密顿量常写作 H，通常可理解为“总能量”；在量子力学里，哈密顿量是一个算符，常写作 Ĥ，用来生成时间演化（常见于薛定谔方程）。"]}
{"word":"Hamiltonianism","summary":{"en":"A doctrine or approach associated with Hamilton, especially his philosophy; sometimes Hamilton’s methods in math/physics.","zh":"与汉密尔顿相关的学说或方法，尤指其哲学；有时也泛指理工中的哈密顿体系/方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The philosophical ideas associated with Sir William Hamilton (1788–1856), especially his view that human knowledge is limited to what we can experience, and that the “absolute” or “infinite” cannot be fully known.","zh":"指苏格兰哲学家威廉·汉密尔顿（1788–1856）的哲学思想，常强调人的认识受经验与条件限制，所谓“绝对”或“无限”难以被人类完全认识。"},"examples":[{"en":"In the lecture, Hamiltonianism was presented as a kind of cautious realism about what the mind can know.","zh":"在这场讲座中，“汉密尔顿主义”被介绍为一种对人类心智能知道什么保持谨慎的现实主义立场。"},{"en":"Some Victorian writers debated Hamiltonianism when discussing the limits of reason and faith.","zh":"一些维多利亚时期的作家在讨论理性与信仰的边界时，会辩论“汉密尔顿主义”。"}]},{"partOfSpeech":"n.","definition":{"en":"More loosely, the use of Hamilton’s methods in mathematics or physics (for example, Hamiltonian mechanics), emphasizing a ‘Hamiltonian’ way of modeling systems.","zh":"较宽泛地指在数学或物理中采用汉密尔顿的理论与方法（如哈密顿力学），强调用“哈密顿式”的方式来建模与分析系统。"},"examples":[{"en":"The course moved from Newtonian mechanics to Hamiltonianism to show a different formal framework.","zh":"这门课从牛顿力学讲到“哈密顿式方法”，用来展示一种不同的形式框架。"},{"en":"In some papers, the author contrasts Lagrangian approaches with Hamiltonianism.","zh":"在一些论文里，作者会把拉格朗日方法与“哈密顿式方法”作对比。"}]}],"synonyms":["Hamilton's philosophy","Hamiltonian philosophy","Hamiltonian approach","Hamiltonian mechanics"],"phonetic":"/həˈmɪltoʊniəˌnɪzəm/","extraExplanation":["注意：英语里 Hamiltonian 常见于理工科，表示“哈密顿的/与哈密顿量有关的”；Hamiltonianism 则更偏“学说/主义”的抽象名词，在哲学史语境里更常见。具体含义要看上下文（哲学 vs. 物理/数学）。"],"etymology":"由专有名词 Hamilton（汉密尔顿）+ 构词后缀 -ism（表示“学说/主义/倾向”）构成。通常指“汉密尔顿的哲学学说”，在理工语境中也可泛指“汉密尔顿体系/方法”。","mnemonic":["把它拆开记：Hamilton（人名）+ -ism（主义/学说）= “汉密尔顿主义”。","看到 -ism 就联想到“某某主义”（如 realism 现实主义），帮助快速判断词性与大意。"]}
{"word":"hamiltonianism","summary":{"en":"Hamiltonianism is the set of ideas linked to Alexander Hamilton, especially a strong federal government and pro-finance, pro-industry economic policy.","zh":"汉密尔顿主义指与汉密尔顿相关的一套理念，核心是强联邦政府以及支持金融与工业发展的经济政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the political and economic ideas associated with Alexander Hamilton, especially support for a strong national (federal) government, a stable financial system, and policies that encourage commerce and industry","zh":"汉密尔顿主义：与亚历山大·汉密尔顿相关的政治与经济思想，尤指支持强有力的联邦政府、稳定的金融体系，以及鼓励商业和工业发展的政策"},"examples":[{"en":"Some historians describe the early U.S. Treasury system as a major victory for Hamiltonianism.","zh":"一些历史学家认为，美国早期财政部体系的建立是汉密尔顿主义的一次重大胜利。"},{"en":"Hamiltonianism often emphasizes national unity through federal power rather than strong state governments.","zh":"汉密尔顿主义往往强调通过联邦权力实现国家统一，而不是依赖强势的州政府。"}]}],"synonyms":["Hamiltonian doctrine","Federalist ideology","pro-federal nationalism"],"phonetic":"/həˈmɪltoʊniəˌnɪzəm/","extraExplanation":["“Hamiltonianism”源自美国开国时期的政治人物亚历山大·汉密尔顿（Alexander Hamilton）。它常与“Jeffersonianism（杰斐逊主义）”对比：前者更倾向强中央与金融/商业发展，后者更强调地方自治与农业社会理想。","在历史语境中，它常与“联邦党人（Federalists）”、建立国家银行、发展信用与公共债务管理等政策讨论相关。"]}
{"word":"hamiltonism","summary":{"en":"Hamiltonism is the set of political and economic ideas linked to Alexander Hamilton, favoring strong federal power and modern finance.","zh":"汉密尔顿主义是与亚历山大·汉密尔顿相关的一套政治经济思想，强调强联邦与现代金融财政体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the political and economic ideas associated with Alexander Hamilton, especially support for a strong national (federal) government, a national bank, public credit, and development through commerce and industry","zh":"（美国）汉密尔顿主义：与亚历山大·汉密尔顿相关的政治与经济思想，尤指主张强大的联邦政府、国家银行、公共信用（国债与信用体系）以及以商业和工业促进国家发展"},"examples":[{"en":"Some historians see the early Federalist Party as the main political home of Hamiltonism.","zh":"一些历史学者认为，早期的联邦党是汉密尔顿主义最主要的政治阵地。"},{"en":"Hamiltonism emphasized building national credit to strengthen the new country.","zh":"汉密尔顿主义强调建立国家信用，以巩固这个新生国家。"}]}],"synonyms":["Hamiltonianism","Federalist ideology","Hamiltonian finance"],"phonetic":"/ˈhæməltnɪzəm/","extraExplanation":["“Hamiltonism”通常出现在美国历史与政治学语境中，尤其与建国初期的财政政策有关：如联邦承担各州债务、设立国家银行、鼓励制造业与贸易等。","与之常被对比的是“Jeffersonianism（杰斐逊主义）”，后者更强调农业社会、州权与更有限的联邦权力。","在文学与大众文化中，这个词也会因音乐剧《Hamilton》而被更多人提及，但该词本身更偏学术与历史写作。"]}
{"word":"hamingja","summary":{"en":"Hamingja is an Icelandic noun meaning happiness and good fortune.","zh":"Hamingja 是冰岛语名词，表示“幸福”和“好运/福气”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Icelandic) happiness; good fortune; luck; a sense of well-being.","zh":"（冰岛语）幸福；好运；福气；安康。"},"examples":[{"en":"I wish you hamingja in the new year.","zh":"祝你新年里有 hamingja（幸福与好运）。"},{"en":"In some Icelandic toasts, people say “til hamingju” to celebrate good news.","zh":"在一些冰岛祝酒或庆祝场合，人们会说“til hamingju”来表达祝贺与喜悦。"}]}],"synonyms":["happiness","good fortune","luck","prosperity","well-being"],"phonetic":"/ˈhɑːmɪŋjɑ/","extraExplanation":["“hamingja”源自古诺尔斯语传统语境，常与“幸运/命运的眷顾”以及“个人的顺遂与安康”联系在一起，不只是短暂的快乐，也带有一种更稳定、被祝福的生活状态。","相关常见表达：\n- “Til hamingju!”：相当于英语 “Congratulations!”（恭喜/祝贺）。\n- “Gangi þér vel”常用于祝人顺利，与“愿你有好运/进展顺利”的意思接近。"]}
{"word":"haminoea","summary":{"en":"Haminoea is a scientific genus name for certain marine bubble snails.","zh":"Haminoea 是某些海洋“泡螺”类海螺的属名（科学名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small marine sea snails (bubble snails) with thin, bubble-like shells, found in coastal waters; a scientific (Latin) name used in biology","zh":"（生物学拉丁学名）海洋小型海螺的一属，俗称“泡螺/泡螺类（bubble snails）”，外壳薄而像气泡，多见于近海沿岸水域"},"examples":[{"en":"Haminoea species are often found crawling on seagrass in shallow bays.","zh":"Haminoea 属的物种常见于浅海海湾的海草床上爬行。"},{"en":"The researcher identified the specimen as Haminoea based on its bubble-shaped shell.","zh":"研究人员根据其泡状外壳将该标本鉴定为 Haminoea。"}]}],"synonyms":["bubble snail","haminoea (genus)"],"phonetic":"/ˌhæmɪˈniːə/","extraExplanation":["“Haminoea”是正式的分类学名称（属名），写作时通常首字母大写并用斜体：*Haminoea*。若指某个具体物种，会用“双名法”写成属名+种加词（如 *Haminoea* + 某种名）。","在非学术语境中，人们更常用“bubble snail（泡螺/泡螺类）”这类通俗名称；但通俗名可能对应多个不同的属或科。"]}
{"word":"hamirostrate","summary":{"en":"Hamirostrate means “hook-billed”—having a strongly curved beak, mainly in scientific descriptions of birds.","zh":"hamirostrate 意为“钩嘴的”，指喙强烈弯曲呈钩状，主要用于鸟类等的科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a hooked or strongly curved beak (used mainly in zoology/ornithology).","zh":"（主要用于动物学/鸟类学）指喙呈钩状或明显弯曲的；钩嘴的。"},"examples":[{"en":"Eagles are hamirostrate birds, with beaks shaped for tearing meat.","zh":"鹰属于钩嘴鸟，喙的形状适合撕裂肉类。"},{"en":"The scientist described the specimen as hamirostrate, noting the sharply curved tip of the bill.","zh":"科学家把该标本描述为钩嘴型，并指出鸟喙末端弯曲得很明显。"}]}],"synonyms":["hook-billed","hook-beaked","curved-billed"],"phonetic":"/ˌhæməˈrɑːstreɪt/","extraExplanation":["词源上可拆为 hami-（“钩子”的意思）+ rostrate（“有喙的/喙状的”，来自拉丁语 rostrum “鸟喙、船首”）。因此 hamirostrate 字面就是“钩状喙的”。","这是偏学术/书面词，日常英语更常说 hook-billed 或 hooked beak。常见的“钩嘴”鸟类包括鹰、隼、猫头鹰、鹦鹉等（不同类别钩弯程度与功能各异）。"]}
{"word":"Hamish","summary":{"en":"a Scottish male name; also used as a surname.","zh":"苏格兰常见的男性名字；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scottish male given name (first name), common in Scotland and in English-speaking countries.","zh":"（男子名）哈米什；常见于苏格兰及英语国家的男性名字。"},"examples":[{"en":"Hamish moved to Edinburgh for university.","zh":"哈米什去爱丁堡上大学了。"},{"en":"In the novel, Hamish is portrayed as a quiet but loyal friend.","zh":"在小说里，哈米什被刻画成安静但很忠诚的朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name), less common than the given name.","zh":"（姓氏）哈米什；作姓氏时较少见。"},"examples":[{"en":"Dr. Hamish will speak at the conference today.","zh":"哈米什博士今天将在会议上发言。"}]}],"synonyms":["James"],"phonetic":"ˈheɪmɪʃ","extraExplanation":["文化提示：在英语语境里，Hamish 往往让人联想到“苏格兰风格/苏格兰背景”的人物形象，因此在文学与影视作品中常用来快速建立角色地域气质。"],"etymology":"源自苏格兰盖尔语名字 *Hamish*，本质上是 *James*（詹姆斯）的盖尔语形式（与 *Seumas* 同源）。后来在英语中固定为独立的人名，带有明显的苏格兰文化色彩。","mnemonic":["把 Hamish 记成“Hay + mish”：开头像 /heɪ/（类似“黑/嘿”的音），整体读起来像“黑米什/海米什”，有助于记住发音。","联想：Hamish ≈ 苏格兰版的 James（詹姆斯）；看到 Hamish 就想到“苏格兰詹姆斯”。"]}
{"word":"hamital","summary":{"en":"“Hamital” is not a common English word; it’s likely a proper name or a misspelling.","zh":"“Hamital”不是常见英语词；多半是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It is most likely a proper name (e.g., a brand/product name or a surname) or a misspelling of another word.","zh":"不是常见英语词典中的标准词。更可能是专有名词（如品牌/产品名或姓氏），或是其他单词的拼写错误。"},"examples":[{"en":"I saw the word “Hamital” on a label, but I couldn’t find it in an English dictionary.","zh":"我在标签上看到了“Hamital”，但在英语词典里查不到。"},{"en":"If you can share a sentence with “hamital,” I can help identify what it refers to.","zh":"如果你能提供一句包含“hamital”的句子，我可以帮你判断它指什么。"}]}],"phonetic":"/ˈhæmɪtəl/","extraExplanation":["“hamital”可能是：①某种药品/保健品的商品名；②人名/地名的拼写；③把别的词拼错了（例如更常见的词可能是“hospital /ˈhɑːspɪtəl/”或“habitual /həˈbɪtʃuəl/”，但需要上下文才能确认）。\n把你看到它的来源（包装、说明书、句子、照片）发来，我可以更准确地解释、给出真正的词义和用法。"]}
{"word":"Hamite","summary":{"en":"an outdated term for descendants of Ham or certain African peoples in older classifications","zh":"旧称：指“含”的后裔或旧式分类中的某些非洲人群（现多不推荐）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person traditionally described (in older biblical or anthropological writing) as a descendant of Ham; later used for certain peoples of North and Northeast Africa in outdated racial/linguistic classifications","zh":"（旧时《圣经》或人类学写作中）被传统上描述为含（Ham）的后裔之人；后来在过时的种族/语言分类中指北非与东北非的某些族群"},"examples":[{"en":"Some older books refer to Egyptians as Hamites, but this terminology is now considered outdated.","zh":"一些旧书把埃及人称为 Hamites，但这种用法如今被认为过时。"},{"en":"The term appears in 19th‑century texts that tried to classify peoples by biblical ancestry.","zh":"这个词常见于19世纪试图用《圣经》谱系来给人群分类的文本中。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Ham, or to the historically used (and now largely abandoned) idea of “Hamitic” peoples/languages","zh":"与含（Ham）有关的；或与历史上（如今多已弃用的）“Hamitic/含米特”人群/语言概念有关的"},"examples":[{"en":"The article discussed Hamite traditions in a biblical context.","zh":"这篇文章在《圣经》语境下讨论了与 Hamite 相关的传统。"},{"en":"Modern linguistics generally avoids Hamite as a label and uses Afroasiatic classifications instead.","zh":"现代语言学一般避免使用 Hamite 这一标签，而改用 Afroasiatic（亚非语系）的分类。"}]}],"synonyms":["Hamitic","descendant of Ham"],"phonetic":"/ˈhæm.aɪt/","extraExplanation":["用法提醒：Hamite/Hamitic 常出现在旧式的人类学、殖民时期文献或宗教谱系叙述中；在现代学术与公共语境里，这类“种族/文明层级”的含米特理论（Hamitic hypothesis）被认为具有误导性，且可能带有歧视或殖民偏见。","更中性的替代：谈语言时通常用 Afroasiatic（亚非语系）及其分支（如 Cushitic、Semitic 等）；谈地区或族群时直接使用具体民族/国家名称更准确。"],"etymology":"来自 Ham（《圣经》中诺亚之子“含”）+ -ite（表示“……的后裔/追随者/成员”的后缀）。19世纪起也被用于某些人群与语言的分类，但该分类框架后来被学界修正并多被弃用。","mnemonic":["记后缀 -ite：常表示“某人群/某派别成员”，如 Israelite（以色列人）、Mennonite（门诺派）。Ham + -ite → “含的后裔/一类人”。","把 Ham 联想到中文“含（Ham）”，Hamite 就是“含 + 人（-ite）”。"]}
{"word":"hamite","summary":{"en":"Hamite means a descendant of Ham in biblical tradition; in older scholarship it was also used as a racial/ethnic label, which is now widely considered outdated and often offensive.","zh":"Hamite 指《圣经》传统中含（Ham）的后裔；在旧式学术中也曾作种族/族群标签，但如今普遍被认为过时且常带冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person traditionally described (in the Bible) as a descendant of Ham, one of Noah’s sons; also used for the peoples thought to come from Ham","zh":"（《圣经》传统说法中）含的后裔；也可指被认为源自含的民族"},"examples":[{"en":"In some older Bible commentaries, Egyptians were described as Hamites.","zh":"在一些较早的《圣经》注释中，埃及人被描述为“Hamites”（含的后裔）。"},{"en":"The term Hamite appears in older writings about ancient peoples of North Africa and the Middle East.","zh":"“Hamite”一词出现在一些关于北非和中东古代民族的旧文献中。"}]},{"partOfSpeech":"n.","definition":{"en":"(dated; often offensive in modern use) a racial label once used in anthropology to classify certain African and Afro-Asiatic peoples","zh":"（旧用法；现代常被视为冒犯）曾在旧式人类学中用作对某些非洲及亚非语系相关人群的“种族”标签"},"examples":[{"en":"Many scholars now avoid the word Hamite because it is tied to outdated racial theories.","zh":"许多学者如今避免使用“Hamite”，因为它与过时的种族理论有关。"},{"en":"The article criticizes earlier researchers for using “Hamite” as a simplistic racial category.","zh":"这篇文章批评早期研究者把“Hamite”当作简单化的种族类别。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Ham or to people historically labeled as Hamites","zh":"与含（Ham）或历史上被称为“Hamites”的人群有关的"},"examples":[{"en":"The book discusses Hamite traditions mentioned in medieval texts.","zh":"这本书讨论了中世纪文献中提到的“Hamite”传统。"},{"en":"Some older sources refer to “Hamite languages,” though this wording is now uncommon.","zh":"一些旧资料提到“Hamite languages（含族语言）”，但这种说法如今不常用。"}]}],"synonyms":["descendant of Ham","(dated) Hamitic"],"phonetic":"ˈhæm.aɪt","extraExplanation":["“Hamite/Hamitic”在19—20世纪曾被卷入所谓“哈米特假说（Hamitic hypothesis）”，这种理论把某些文明成就错误地归因于外来“哈米特人种”，用来支持殖民与种族等级观念。现代语言学与人类学已否定该框架，通常改用更中性的术语（如 Afro-Asiatic / 亚非语系）来讨论语言与族群。使用该词时建议注意语境：在宗教/历史文献中可能是描述性用法，但在“种族分类”意义上往往带有冒犯或偏见色彩。"]}
{"word":"hamites","summary":{"en":"Hamites can mean (1) the biblical descendants of Ham, or (2) an outdated and often problematic racial/ethnological label now generally avoided.","zh":"Hamites可指（1）《圣经》中“含”的后裔；也可指（2）一种已过时且常带偏见的旧式种族/民族学称呼，现代通常避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Bible) the descendants of Ham, one of Noah’s sons.","zh":"（《圣经》）含（Ham，挪亚之子）的后裔。"},"examples":[{"en":"In some biblical genealogies, certain peoples are described as Hamites.","zh":"在一些《圣经》的族谱叙述中，某些民族被描述为“Hamites”（含的后裔）。"},{"en":"The term Hamites appears in older religious writings and interpretations.","zh":"“Hamites”一词常见于较早的宗教著作与解读中。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, outdated) a former ethnological label for various peoples of North and Northeast Africa; now generally avoided in modern scholarship.","zh":"（历史用法，已过时）旧时人类学/民族学对北非与东北非一些族群的统称；现代学术中通常避免使用。"},"examples":[{"en":"Some 19th‑century writers used “Hamites” as a racial category, but the idea is no longer accepted.","zh":"一些19世纪作者把“Hamites”当作种族分类，但这种观点已不被接受。"},{"en":"Modern historians avoid the term Hamites and use more specific names for each group.","zh":"现代历史学者会避免使用“Hamites”，而改用更具体的族群名称。"}]}],"synonyms":["descendants of Ham","Hamitic peoples (dated)"],"phonetic":"ˈhæm.aɪts","extraExplanation":["“Hamites/Hamitic”在旧式欧洲人类学中曾与所谓“Hamitic hypothesis（含族假说）”相关，把语言、文化与“种族优越”错误地捆绑在一起，用来解释或合理化殖民叙事与族群等级观。这种用法在今天常被视为不科学、带偏见，甚至具有冒犯性。","如果你在阅读历史文献时遇到该词，建议结合时代背景理解，并在写作中改用更准确的表达：例如具体民族名称（如Somali, Oromo, Berber/Amazigh等）或语言分类（如Afroasiatic languages）。"]}
{"word":"Hamitic","summary":{"en":"Related to the biblical Ham; also an outdated term once used for certain Afroasiatic languages and peoples.","zh":"与《圣经》人物“含”有关；也指曾用于部分亚非语系语言/人群的过时旧称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ham, a son of Noah in the Bible, or to people traditionally (and often loosely) claimed to be his descendants.","zh":"与《圣经》中挪亚之子“含”（Ham）有关的；或与传统上（常较笼统地）被认为是其后裔的人群有关的。"},"examples":[{"en":"In some older writings, the term was used to link certain African peoples to the biblical figure Ham.","zh":"在一些较早的著作中，这个词被用来把某些非洲族群与《圣经》人物含联系起来。"},{"en":"The museum label explains that this terminology is historical and no longer preferred.","zh":"博物馆的说明牌指出，这种术语属于历史用法，如今已不再推荐。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Historical linguistics, outdated) Relating to the former category “Hamitic languages,” once used for some non-Semitic branches of the Afroasiatic language family.","zh":"（历史语言学，已过时）与旧称“含米特语/含语（Hamitic languages）”有关：曾用于指称亚非语系中一些非闪语分支的旧分类。"},"examples":[{"en":"Older linguistics books sometimes classify Berber and Cushitic under “Hamitic.”","zh":"较早的语言学书籍有时把柏柏尔语支和库施特语支归为“含语”。"},{"en":"Modern linguistics generally avoids “Hamitic” and uses Afroasiatic branch names instead.","zh":"现代语言学一般避免使用“Hamitic”，而改用“亚非语系”下更具体的语支名称。"}]}],"synonyms":["Afroasiatic","Cushitic","Berber","Semitic"],"phonetic":"/həˈmɪtɪk/","extraExplanation":["学习提示（文化敏感）：Hamitic 在一些旧的人类学/殖民时期文献中常与“含米特假说（Hamitic hypothesis）”捆绑使用，这一理论带有强烈的种族主义色彩，已被学界否定。现代写作中通常改用更准确、中性的语言学术语（如 Afroasiatic 及其具体语支：Berber、Cushitic、Chadic、Egyptian 等）。","在当代语境里使用 Hamitic 可能让人感觉你在引用过时或带偏见的分类；如果是在讨论历史文本，建议明确说明“历史用语/已过时”。"],"etymology":"来自 Ham（《圣经》人物“含”）+ 后缀 -itic（表示“与……有关的”），19世纪起在语言学与人类学文献中流行，后来逐渐被弃用。","mnemonic":["把它拆开记：Ham（含）+ -itic（形容词后缀）＝“与含有关的”。","联想“历史书里的旧标签”：看到 Hamitic 就提醒自己——这是旧分类，现代多用 Afroasiatic。"]}
{"word":"hamitic","summary":{"en":"Hamitic means “related to Ham (in the Bible)” and, in older usage, it referred to supposed Hamitic peoples or languages—an outdated and often rejected classification today.","zh":"Hamitic 指“与《圣经》中的含（Ham）有关的”；旧用法还指所谓“含族民族/语言”，但这种分类如今多被认为过时且不严谨。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ham, a son of Noah in the Bible, or to peoples traditionally (and often loosely) associated with him.","zh":"与《圣经》中诺亚之子“含（Ham）”有关的；或指传统上（常较笼统地）与“含”相关联的民族/文化的。"},"examples":[{"en":"The museum label mentioned Hamitic genealogies found in medieval writings.","zh":"博物馆的说明牌提到了中世纪文献中的“含族（Hamitic）”谱系。"},{"en":"In some older commentaries, certain North African groups were described as Hamitic.","zh":"在一些较早的注释/评论中，某些北非群体被描述为“含族的（Hamitic）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Outdated, often considered incorrect) Referring to the so-called “Hamitic” languages or “Hamitic race” in older anthropology and linguistics.","zh":"（过时且常被认为不正确）指旧有人类学/语言学中的“含族语言”或“含族人种”等说法。"},"examples":[{"en":"The article avoids the term “Hamitic” because it reflects outdated racial theories.","zh":"这篇文章避免使用“Hamitic”，因为它反映了过时的种族理论。"},{"en":"Older books sometimes classified Somali under “Hamitic,” but modern linguistics uses Afroasiatic classifications instead.","zh":"旧书有时把索马里语归为“Hamitic”，但现代语言学更倾向使用“亚非语系（Afroasiatic）”等分类。"}]}],"synonyms":["Hamite (related)","Afroasiatic (modern linguistic term, not a synonym in meaning)"],"phonetic":"/hæˈmɪtɪk/","extraExplanation":["“Hamitic”一词来自《圣经》人物 Ham（含）。19—20世纪曾出现“含族假说（Hamitic hypothesis）”，把非洲部分族群的文明成就错误地归因于所谓“含族”外来影响；这种观点与殖民时期的种族等级观念相关，如今在学术上普遍被否定。","在语言学中，“Hamitic languages”也多被视为不精确的旧分类；现代更常用“Afroasiatic（亚非语系）”等更严谨的术语。写作时如需提及，通常要标注为“historical/outdated（历史性/过时）”。"]}
{"word":"hamiticized","summary":{"en":"“Hamiticized” is a dated academic term meaning labeled or treated as “Hamitic,” a classification now widely rejected and often linked to racist colonial theories.","zh":"“Hamiticized”是过时的学术用语，指被贴上“哈米特”标签或被视为“哈米特化”；该分类如今广受否定，且常与殖民时期的种族主义理论相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anthropology/linguistics, dated and often offensive) Described as made “Hamitic,” or classified as belonging to the so‑called Hamitic peoples/languages.","zh":"（人类学/语言学，用法过时且常带冒犯性）指被“哈米特化”，或被归类为所谓“哈米特人/哈米特语”的。"},"examples":[{"en":"Some early 20th‑century writers claimed certain East African groups were “Hamiticized,” a view rejected by modern scholarship.","zh":"一些20世纪早期作者声称某些东非群体被“哈米特化”，但这种观点已被现代学术界否定。"},{"en":"The article discusses how colonial researchers labeled communities as “Hamiticized” to fit racial theories.","zh":"这篇文章讨论殖民时期研究者如何用“哈米特化”来给社群贴标签，以迎合种族理论。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of hamiticize: to portray, label, or treat something as “Hamitic” (usually in older academic writing).","zh":"hamiticize 的过去分词：把某事物描写、贴标签或对待为“哈米特的”（多见于旧式学术写法）。"},"examples":[{"en":"The historian argues that colonial administrators hamiticized local histories to justify unequal rule.","zh":"这位历史学家认为殖民当局把地方历史“哈米特化”，以便为不平等统治辩护。"}]}],"synonyms":["hamitized","labeled as Hamitic","classified as Hamitic (in older scholarship)"],"phonetic":"/həˈmɪtɪˌsaɪzd/","extraExplanation":["“Hamitic / 哈米特”源自《圣经》中挪亚之子 Ham（含/哈姆）的名字。19—20世纪曾流行“哈米特假说”（Hamitic hypothesis），试图用种族等级观把非洲文明成就归因于所谓“外来/更高等”的“哈米特人”。这套理论如今被认为缺乏科学依据，并与殖民主义和种族主义话语紧密相关。","因此在现代写作中，这个词多用于批判或历史回顾的语境（常会加引号），不建议用来描述现实族群或语言。若要中性表达，可用 “classified as … (in older scholarship)” / “labeled as …” 等说法。"]}
{"word":"hamitism","summary":{"en":"Hamitism is a discredited racist theory that tried to explain African peoples and cultures through the idea of “Hamites” from the Bible.","zh":"哈米特主义是一种已被否定的种族主义理论，曾用《圣经》中“含的后代（哈米特人）”来解释非洲族群与文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (now discredited) racist theory that some African peoples were “Hamites” (supposed descendants of Ham in the Bible) and were therefore seen as more “civilized” or closer to Europeans; also, beliefs or writing based on this idea","zh":"“哈米特主义”（现已被否定的种族主义理论）：把某些非洲族群说成是《圣经》中含（Ham）的后代“哈米特人”，并据此宣称他们更“文明”或更接近欧洲人；也指基于这种观点的论述或思潮"},"examples":[{"en":"Modern historians reject hamitism as a racist explanation for African history.","zh":"现代历史学家否定哈米特主义，认为它是用种族主义来解释非洲历史。"},{"en":"The textbook discusses how hamitism influenced colonial attitudes toward certain African groups.","zh":"这本教材讨论了哈米特主义如何影响殖民者对某些非洲族群的看法。"}]}],"synonyms":["Hamitic hypothesis","Hamitic theory"],"phonetic":"/ˈhæmɪtɪzəm/","extraExplanation":["“哈米特主义”常与“哈米特假说（Hamitic hypothesis）”一起出现，主要流行于19世纪到20世纪早期的欧洲人类学与殖民话语中。它用《圣经》谱系与伪科学种族分类来解释非洲文明与国家形成，常被用来抬高某些族群、贬低另一些族群，从而为殖民统治与不平等政策提供“合理化”。","当代学界普遍认为这种说法缺乏科学依据，并且带有明显的种族主义与殖民主义偏见；在写作中使用该词时，通常需要明确标注其“已被否定/具冒犯性”的历史语境。"]}
{"word":"hamitized","summary":{"en":"Labeled or interpreted using the outdated “Hamitic” racial theory.","zh":"被用过时的“哈米特”种族理论贴标签或解释的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; historical) Described as being classified as “Hamitic” or explained by the old “Hamitic” theory (a discredited colonial-era racial/anthropological idea).","zh":"（罕见；历史用语）被归类为“哈米特人／含米特人（Hamitic）”或用“哈米特理论”来解释的（该理论已被否定，带有殖民时代的种族主义色彩）。"},"examples":[{"en":"Some early 20th-century texts called certain East African groups “hamitized,” a label modern scholarship rejects.","zh":"一些20世纪早期的文本把某些东非群体称为“hamitized”，但现代学术界不接受这种说法。"},{"en":"The article critiques how museums once presented cultures as “hamitized” to fit racial hierarchies.","zh":"这篇文章批判了博物馆曾如何把文化描述为“hamitized”，以迎合种族等级观念。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “hamitize”: to label or interpret a people/culture as “Hamitic” (rare; now considered outdated and offensive in many contexts).","zh":"“hamitize”的过去分词：把某个族群／文化贴上“哈米特（Hamitic）”标签或用其来解释（罕见；多语境下被视为过时且冒犯）。"},"examples":[{"en":"Colonial writers often hamitized local histories to suggest outside origins.","zh":"殖民时期的作者常把当地历史“hamitized”，暗示其起源来自外来者。"},{"en":"Today, researchers avoid terms like “hamitized” because they carry harmful assumptions.","zh":"如今研究者会避免使用“hamitized”等词，因为它们包含有害的预设。"}]}],"synonyms":["Hamitic","so-called Hamitic","racially classified","racialized"],"phonetic":"/ˈhæməˌtaɪzd/","extraExplanation":["使用提醒：该词与“哈米特假说（Hamitic hypothesis）”相关，这是一套已被否定的殖民时代种族理论，常被用来贬低非洲本土文明、把成就归因于“外来更高级人种”。在现代写作中通常只在批判性历史语境、引文或讨论旧文献时出现。"],"etymology":"来自“Hamite / Hamitic”（源于《圣经》中 Ham＝含/哈姆 的拉丁化形式），19世纪人类学中被用作一种“种族分类”概念；后因缺乏科学依据且与殖民种族主义叙事紧密相关而被学界否定。“-ize”构成动词 hamitize（使……变成/被当作 Hamitic），其过去分词为 hamitized。","mnemonic":["把它拆开记：Hamit-（旧式“哈米特/含米特”概念）+ -ize（使……化）→ hamitize（把……归为哈米特）→ hamitized（被归为哈米特的）。"]}
{"word":"hamitoid","summary":{"en":"Hamitoid means hook-shaped, especially used in paleontology to describe certain hooked ammonite fossils, or relating to the Hamites type.","zh":"hamitoid 指“钩状的”，多用于古生物学描述某些呈钩形的菊石化石，也可指与 Hamites 类型相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hook-shaped or resembling a hook; especially describing certain fossil ammonites with a bent, “hooked” shell form.","zh":"钩状的；呈钩形的（尤指某些菊石化石外壳呈弯曲“钩形”的形态）。"},"examples":[{"en":"The fossil shows a hamitoid curve, bending back like a hook.","zh":"这块化石呈现出钩状弯曲，像钩子一样向后弯。"},{"en":"Some Cretaceous ammonites have hamitoid shells rather than tightly coiled spirals.","zh":"一些白垩纪菊石的外壳呈钩状，而不是紧密盘旋的螺旋形。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or characteristic of the ammonite genus (or type) Hamites and similar “hooked” ammonites.","zh":"与“哈米特菊石”（Hamites）属或类似的“钩形”菊石类型相关的。"},"examples":[{"en":"The paper compares hamitoid ammonites with more typical planispiral forms.","zh":"这篇论文将钩形菊石与更典型的平面螺旋形态作了比较。"}]}],"synonyms":["hook-shaped","uncinate","hamate"],"phonetic":"/ˈhæmɪtɔɪd/","extraExplanation":["“hamitoid”多见于古生物学/地质学语境，属于专业词汇，日常英语中很少用。","词尾“-oid”常表示“像……的/……状的”（如 asteroid“像星的”），因此 hamitoid 可理解为“像 Hamites（或钩形）那样的”。"]}
{"word":"hamlah","summary":{"en":"Hamlah means an attack or organized campaign, especially in Middle Eastern contexts (from Arabic).","zh":"Hamlah 指“袭击/攻势”或“有组织的行动/运动”，多见于与中东语境相关的英语表达（源自阿拉伯语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An attack, raid, or military operation; more generally, a campaign or organized effort (a loanword from Arabic used in some English contexts).","zh":"（借自阿拉伯语）袭击、突袭或军事行动；也可泛指有组织的行动/运动（campaign）。"},"examples":[{"en":"The reports described a hamlah on several villages near the border.","zh":"报道称边境附近几个村庄遭到了一次 hamlah（袭击/行动）。"},{"en":"Activists called the arrests a hamlah against the opposition.","zh":"活动人士称这些逮捕是一场针对反对派的 hamlah（打压行动）。"}]}],"synonyms":["campaign","raid","attack","offensive","crackdown"],"phonetic":"/ˈhɑːmlə/","extraExplanation":["“hamlah”常见于对阿拉伯语词“حَمْلَة (ḥamla)”的转写，基本意思是“行动/攻势/战役/（有组织的）运动”。在英语里它不是高频词，更多出现在新闻报道、学术写作或讨论中东语境时，用来保留原词的语气与文化背景。","发音会因转写系统与说话者背景而变化；英语使用者通常按拼写读成类似“HAM-luh”。"]}
{"word":"Hamlet","summary":{"en":"Hamlet is Shakespeare’s famous tragedy and its main character, Prince Hamlet; informally, it can mean someone who hesitates and overthinks.","zh":"Hamlet 指莎士比亚悲剧《哈姆雷特》及其主角丹麦王子；口语中也可比喻指犹豫不决、想太多的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous tragedy (play) by William Shakespeare (c. 1600–1601), about Prince Hamlet of Denmark and his struggle to avenge his father’s death.","zh":"莎士比亚的著名悲剧《哈姆雷特》（约1600–1601年），讲述丹麦王子哈姆雷特为父报仇、在行动与道德之间痛苦挣扎的故事。"},"examples":[{"en":"We’re reading Hamlet in English class this semester.","zh":"这学期我们在英语课上读《哈姆雷特》。"},{"en":"Hamlet is one of the most performed plays in the world.","zh":"《哈姆雷特》是全球上演次数最多的戏剧之一。"},{"en":"The “To be, or not to be” speech from Hamlet is widely quoted.","zh":"《哈姆雷特》里“生存还是毁灭”的独白被广泛引用。"}]},{"partOfSpeech":"n.","definition":{"en":"The main character of Shakespeare’s play: Hamlet, the Prince of Denmark.","zh":"莎士比亚戏剧中的主角：丹麦王子哈姆雷特。"},"examples":[{"en":"Hamlet pretends to be mad to investigate the truth.","zh":"哈姆雷特装疯以便调查真相。"},{"en":"In the final scene, Hamlet faces the consequences of the court’s corruption.","zh":"在终场，哈姆雷特直面宫廷腐败带来的后果。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, figurative) A person who overthinks and delays action, especially because of doubt.","zh":"（非正式/比喻）指过度思考、因犹豫怀疑而迟迟不行动的人。"},"examples":[{"en":"Stop being such a Hamlet and just make a decision.","zh":"别那么“哈姆雷特”了，做个决定吧。"},{"en":"He Hamlet-ed his way through the project and missed the deadline.","zh":"他在项目上犹犹豫豫，结果错过了截止日期。"}]}],"synonyms":["Prince of Denmark","Shakespearean tragedy","overthinker (figurative)","hesitator (figurative)"],"phonetic":"/ˈhæmlɪt/","extraExplanation":["《哈姆雷特》常被用来讨论“犹豫与行动”“良知与复仇”“表象与真实”等主题；主角的延宕（迟迟不行动）也成为英语文化里“过度思考”的典型形象。","最著名的台词是“To be, or not to be”（常译“生存还是毁灭”）；在英语写作里引用时，往往用来引出关于选择、存在意义或道德困境的思考。","注意区分：Hamlet（《哈姆雷特》/人物）与 hamlet（小村庄，普通名词）是不同的词。"]}
{"word":"hamlet","summary":{"en":"“Hamlet” usually refers to Shakespeare’s play or its main character; it can also mean a person who overthinks and hesitates.","zh":"“Hamlet”通常指莎士比亚的戏剧《哈姆雷特》或主人公哈姆雷特；也可比喻爱多想、犹豫不决的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Prince Hamlet: the main character of Shakespeare’s tragedy *Hamlet*, who struggles with grief, revenge, and moral doubt after his father’s death.","zh":"哈姆雷特王子：莎士比亚悲剧《哈姆雷特》的主人公。他在父王去世后，在悲伤、复仇与道德疑虑之间挣扎。"},"examples":[{"en":"In *Hamlet*, Hamlet pretends to be mad to investigate his father’s death.","zh":"在《哈姆雷特》中，哈姆雷特假装疯癫，以调查父王之死。"},{"en":"“To be, or not to be” is Hamlet’s most famous soliloquy.","zh":"“生存还是毁灭”是哈姆雷特最著名的独白。"}]},{"partOfSpeech":"n.","definition":{"en":"The play *Hamlet* (1600–1601): a famous Shakespearean tragedy about betrayal, revenge, and the difficulty of taking action.","zh":"《哈姆雷特》（约1600–1601）：莎士比亚著名悲剧，主题涉及背叛、复仇，以及“难以下决心行动”的困境。"},"examples":[{"en":"Many students read *Hamlet* to learn about tragedy and human psychology.","zh":"许多学生阅读《哈姆雷特》，以了解悲剧与人性心理。"},{"en":"The line “Something is rotten in the state of Denmark” comes from *Hamlet*.","zh":"“丹麦国出了大问题”（直译：丹麦国有腐败之物）这句台词出自《哈姆雷特》。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who overthinks, hesitates, or delays action because of doubt; someone seen as “Hamlet-like.”","zh":"（比喻）一个因怀疑而过度思考、犹豫不决、迟迟不行动的人；“像哈姆雷特一样的人”。"},"examples":[{"en":"He’s a bit of a Hamlet—he analyzes every option and can’t decide.","zh":"他有点“哈姆雷特式”——把每个选择都分析一遍，结果下不了决定。"},{"en":"Don’t Hamlet it; just send the email.","zh":"别哈姆雷特式纠结了；把邮件发出去就好。"}]}],"synonyms":["Prince Hamlet","the Dane (literary reference)","indecisive person (sense 3)","overthinker (sense 3)"],"phonetic":"/ˈhæmlɪt/","extraExplanation":["《哈姆雷特》常被视为英语文学中“人物内心独白（soliloquy）”的代表作，很多经典引用都来自人物在舞台上对观众“自言自语”的段落。","在日常英语里，把某人叫作“a Hamlet”通常带点批评或调侃，意思是“想太多、行动太慢”；更中性的说法可以用 “indecisive” 或 “thoughtful.”"]}
{"word":"hamleted","summary":{"en":"“Hamleted” usually means Hamlet-like: intensely reflective and indecisive, stuck in doubt.","zh":"“hamleted”通常指“哈姆雷特式的”：过度反思、犹豫不决、陷入疑虑难以行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often informal) Like Shakespeare’s Hamlet—thoughtful, conflicted, and unable to decide what to do; trapped in overthinking.","zh":"（常为非正式用法）像莎士比亚《哈姆雷特》中的哈姆雷特一样——想得很多、内心矛盾、难以下决定；陷入过度思考。"},"examples":[{"en":"He felt hamleted by doubt and couldn’t choose between two good offers.","zh":"他被疑虑“哈姆雷特化”了，两个好机会之间怎么也选不定。"},{"en":"In the meeting, she grew hamleted and kept revisiting the same risks.","zh":"在会议上，她变得“哈姆雷特式”犹豫，反复纠结同样的风险。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) Past tense/past participle of “hamlet” (to form or live in small villages/hamlets).","zh":"（罕见）动词 hamlet 的过去式/过去分词：形成或居住在小村落（hamlet）中。"},"examples":[{"en":"The valley was once hamleted by farming families.","zh":"这个山谷过去曾由务农家庭散居成一个个小村落。"}]}],"synonyms":["indecisive","conflicted","torn","hesitant","paralyzed by doubt","overthinking"],"phonetic":"/ˈhæmlɪtɪd/","extraExplanation":["“hamleted”主要是借用《哈姆雷特》的文化意象：哈姆雷特以著名的“to be, or not to be”独白代表深度自省与行动迟疑。因此在现代英语里，hamleted 多带有“想太多以至于难以行动”的语感。","在严肃写作中更常用的替代表达有：indecisive（优柔寡断）、paralyzed by doubt（被疑虑困住）、overthink（想太多）。"]}
{"word":"hamleteer","summary":{"en":"A hamleteer is an actor who plays Hamlet; less commonly, it can mean someone who acts overly Hamlet-like (dramatic, philosophical, indecisive).","zh":"hamleteer 指扮演哈姆雷特的演员；较少见的比喻义指言行过于“哈姆雷特式”（戏剧化、爱思辨、优柔寡断）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an actor who plays (or is known for playing) Hamlet in Shakespeare’s play *Hamlet*","zh":"扮演（或以扮演）莎士比亚《哈姆雷特》中“哈姆雷特”一角而闻名的演员"},"examples":[{"en":"She became famous as a hamleteer after her powerful performance in *Hamlet*.","zh":"她在《哈姆雷特》中的精彩演出后，作为一名“哈姆雷特演员”而成名。"},{"en":"The festival invited three hamleteers from different countries to compare their interpretations.","zh":"艺术节邀请了来自不同国家的三位“哈姆雷特饰演者”来比较各自的诠释。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, less common) someone who speaks or behaves in an overly dramatic, philosophical, or indecisive way, like Hamlet","zh":"（比喻，用法较少）言行过于戏剧化、爱思辨或优柔寡断、像“哈姆雷特”那样的人"},"examples":[{"en":"Stop being a hamleteer and just make a decision.","zh":"别再像哈姆雷特那样犹豫了，直接做决定吧。"},{"en":"In the novel, the hero turns into a hamleteer, questioning everything he sees.","zh":"在小说里，主人公变得像个“哈姆雷特式的人”，对所见一切都提出质疑。"}]}],"synonyms":["Hamlet actor","Shakespearean actor","tragic actor"],"phonetic":"/ˌhæm.ləˈtɪr/","extraExplanation":["“hamleteer”来自“Hamlet（哈姆雷特）+ -eer（表示从事某事的人，如 engineer、volunteer）”。它常用于戏剧评论或表演史语境，尤其用来指以饰演哈姆雷特见长的演员。","比喻用法通常带一点调侃色彩，指某人过度沉思、犹豫不决或说话像独白一样沉重。写作时要注意语境与语气。"]}
{"word":"hamletization","summary":{"en":"Hamletization means turning a character or story into something “Hamlet-like,” marked by heavy introspection and hesitation.","zh":"Hamletization 指“哈姆雷特化”：让人物或叙事变得更像哈姆雷特，突出强烈内省与犹豫不决。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making someone or something resemble Hamlet (Shakespeare’s character), especially by emphasizing excessive thinking, doubt, and hesitation to act","zh":"“哈姆雷特化”；使某人/某事变得像《哈姆雷特》中的哈姆雷特一样，尤指强调过度思考、怀疑与行动迟疑的过程"},"examples":[{"en":"Some critics argue the film’s hero undergoes hamletization, spending more time questioning himself than taking action.","zh":"一些评论家认为这部电影的男主角经历了“哈姆雷特化”，自我质疑的时间比行动的时间还多。"},{"en":"The director avoided hamletization by cutting long monologues and keeping the pace fast.","zh":"导演通过删减冗长独白、加快节奏来避免“哈姆雷特化”。"}]}],"synonyms":["over-intellectualization","paralysis by analysis","excessive introspection","hesitation","indecision"],"phonetic":"/ˌhæmlətaɪˈzeɪʃən/","extraExplanation":["这是一个较少见的批评术语（多见于文学/戏剧评论），来自 Hamlet（哈姆雷特）+ -ization（……化/……的过程）。常用来谈人物性格或叙事风格被“哈姆雷特式”的犹豫、内省、道德挣扎所主导。","语气通常带一点评价色彩：可能是称赞“深刻、内省”，也可能是批评“想太多、拖沓、缺乏行动”。具体褒贬要看上下文。"]}
{"word":"hamletize","summary":{"en":"Hamletize means to make something Hamlet-like—full of doubt, melancholy, or dramatic Shakespearean style.","zh":"Hamletize 指把事物“哈姆雷特化”——带上犹疑、忧郁或莎士比亚式戏剧腔调。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something resemble Hamlet (the character or the play), especially by giving it a mood of deep doubt, melancholy, and overthinking","zh":"使（事物）带有《哈姆雷特》（人物或戏剧）的风格，尤指增添深度怀疑、忧郁与过度思考的气质"},"examples":[{"en":"The director hamletized the superhero story by turning the hero into a doubt-filled thinker.","zh":"导演把这部超级英雄故事“哈姆雷特化”，把主角改成一个充满怀疑的思想者。"},{"en":"Don’t hamletize a simple decision—just choose a date and book the tickets.","zh":"别把一个简单决定“哈姆雷特化”——选个日期把票订了就行。"}]},{"partOfSpeech":"vi.","definition":{"en":"(often humorous) to speak or act in a dramatic, Shakespeare-like way, as if you were Hamlet","zh":"（常带幽默）像哈姆雷特一样戏剧化地说话或行动"},"examples":[{"en":"He started hamletizing at the party, quoting lines and staring into the distance.","zh":"他在派对上开始“哈姆雷特化”，背台词、望向远处，一副沉思状。"},{"en":"Stop hamletizing and tell us what you really want.","zh":"别再“哈姆雷特化”了，直接告诉我们你到底想要什么。"}]}],"synonyms":["Shakespeareanize","dramatize","overthink","romanticize"],"phonetic":"/ˈhæmləˌtaɪz/","extraExplanation":["“hamletize”是由专有名词 Hamlet（哈姆雷特）+ 动词后缀 -ize 构成，意思是“使……具有哈姆雷特式特征”。它并非高频正式词，更多见于评论、戏仿或口语写作中，用来形容把事情变得过于犹豫、忧郁或戏剧化。"]}
{"word":"hamlets","summary":{"en":"Hamlets can mean very small villages, and in arts contexts it can also mean multiple versions or productions of Shakespeare’s Hamlet.","zh":"hamlets 可指多个“小村落”；在艺术语境中也可指莎士比亚《哈姆雷特》的多种版本或演出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very small village or settlement, usually smaller than a town and often without its own church or local government.","zh":"（通常比村庄更小的）小村落/小聚落；常常没有自己的教堂或地方政府。"},"examples":[{"en":"We drove through a quiet hamlet surrounded by farmland.","zh":"我们开车穿过一个被农田环绕的安静小村落。"},{"en":"She grew up in a hamlet where everyone knew each other.","zh":"她在一个人人相互认识的小村落里长大。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form used when talking about multiple versions, productions, or interpretations of Shakespeare’s play Hamlet.","zh":"（复数）用来指莎士比亚戏剧《哈姆雷特》的多种版本、演出或不同解读。"},"examples":[{"en":"The festival presented two very different Hamlets this year.","zh":"今年的戏剧节呈现了两部风格迥异的《哈姆雷特》。"},{"en":"Critics compared modern Hamlets on stage and in film.","zh":"评论家比较了舞台与电影中的现代版《哈姆雷特》。"}]}],"synonyms":["small village","settlement","tiny community","(for the play) productions of Hamlet"],"phonetic":"/ˈhæmlɪt/","extraExplanation":["“hamlet”在英语里通常指比“village（村庄）”更小的聚居点；在英国等地的传统用法中，它常暗示“规模很小、公共设施更少”。","词源来自古法语 hamel（小村庄），与 home（家）在历史上有关联的概念：都围绕“居住地/聚居处”的意义发展。","文学与文化中，Hamlet（《哈姆雷特》）是莎士比亚最著名的悲剧之一；因此在评论戏剧、电影时，复数 Hamlets 常用来指不同演员、导演或时代背景下的多种演绎。"]}
{"word":"hamli","summary":{"en":"“Hamli” is not a common English word; it’s usually a name or a misspelling (often of “hamlet” or “Hamlet”).","zh":"“Hamli” 不是常见英语词；通常是人名/地名，或是拼写错误（常见可能是 “hamlet” 或 “Hamlet”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a name (e.g., a surname or place name). If used as a name, it refers to a particular person or location rather than having a dictionary meaning.","zh":"不是常见的英语词；最常见于人名（如姓氏）或地名。作为专有名词使用时，指特定的人或地点，而不是固定的词典义。"},"examples":[{"en":"I met Dr. Hamli at the conference.","zh":"我在会议上见到了 Hamli 医生。"},{"en":"Hamli is listed as a family name in this record.","zh":"这份记录里把 Hamli 列为一个姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"Possible typo for “hamlet” (a small village) or “Hamlet” (Shakespeare’s play). If you meant one of these, tell me which.","zh":"可能是 “hamlet”（小村庄）或 “Hamlet”（莎士比亚的《哈姆雷特》）的拼写错误。如果你想查其中一个，请告诉我。"},"examples":[{"en":"They live in a quiet hamlet near the mountains.","zh":"他们住在山附近一个安静的小村庄里。"},{"en":"We studied Hamlet in English class.","zh":"我们在英语课上学习了《哈姆雷特》。"}]}],"synonyms":["(if you meant hamlet) village","(if you meant hamlet) small town","(if you meant Hamlet) Shakespeare’s tragedy"],"phonetic":"/ˈhæmli/","extraExplanation":["“Hamli”本身在主流英语词典中不常作为普通词条出现，所以最稳妥的处理是：要么它是专有名词（人名/地名），要么是拼写误差。","如果你是从某段文字里看到的，请把原句发我；我可以根据上下文判断你想表达的是 “hamlet/hamly/hammy/Hamlet” 还是某个专有名词。"]}
{"word":"hamline","summary":{"en":"Hamline is a U.S. proper name, best known for Hamline University and for local place names (streets/neighborhoods).","zh":"Hamline 是美国的专有名词，最常见指哈姆林大学，也可指以此命名的街道或社区等地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used mainly in the U.S., especially for Hamline University (a private university in Saint Paul, Minnesota) and for places named “Hamline” (such as streets or neighborhoods).","zh":"（专有名词）主要用于美国的名称，常指哈姆林大学（位于明尼苏达州圣保罗的一所私立大学），也可指名为“Hamline”的地名（如街道或社区）。"},"examples":[{"en":"She studies political science at Hamline University in Saint Paul.","zh":"她在圣保罗的哈姆林大学学习政治学。"},{"en":"Take Hamline Avenue north and you’ll get to the next neighborhood quickly.","zh":"沿着哈姆林大道向北走，很快就能到下一个街区。"}]}],"phonetic":"/ˈhæm.laɪn/","extraExplanation":["“Hamline”常见于明尼苏达州（尤其是圣保罗/双城地区）的地名系统中，因此在美国语境里更像一个“地理与机构名称”而不是普通词汇。","Hamline University 的命名与美国卫理公会历史有关：学校以 Leonidas Lent Hamline 命名（19世纪的卫理公会主教/领袖之一）。"]}
{"word":"hamlinite","summary":{"en":"A historical term meaning a supporter of U.S. politician Hannibal Hamlin.","zh":"历史用语：指美国政治人物汉尼巴尔·哈姆林的支持者/追随者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a supporter or follower of Hannibal Hamlin (1809–1891), a U.S. politician (Senator from Maine and Abraham Lincoln’s first vice president), especially in historical U.S. political contexts","zh":"（历史用语）汉尼巴尔·哈姆林（Hannibal Hamlin，1809–1891）的支持者或追随者，常用于美国政治史语境（尤其与缅因州及林肯首任副总统相关）"},"examples":[{"en":"In the 1860 election, many Hamlinites in Maine worked hard for the Republican ticket.","zh":"在1860年大选中，缅因州的许多“哈姆林派”积极为共和党竞选组合奔走。"},{"en":"The newspaper described the meeting as a clash between Hamlinites and their rivals.","zh":"报纸将那次集会描述为哈姆林派与其对手之间的冲突。"}]}],"synonyms":["Hamlin supporter","Hamlin follower"],"phonetic":"/ˈhæmləˌnaɪt/","extraExplanation":["“Hamlinite”主要见于19世纪美国政治报道或史料中，带有“某政治人物的派系/拥护者”的意思，类似的构词还有“Jacksonian（杰克逊派）”“Jeffersonian（杰斐逊派）”。","词尾“-ite”常用来表示“某人/某团体的追随者、成员”（如“Brooklynite”布鲁克林人；“Mennonite”门诺派教徒）。在政治语境里，常暗示“阵营/派别”。"]}
{"word":"hamm","summary":{"en":"“Hamm” is most commonly a proper noun: a German city name or a surname.","zh":"“Hamm”最常见是专有名词：德国城市名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hamm: a city in North Rhine–Westphalia, western Germany (a proper noun/place name).","zh":"Hamm：德国西部北莱茵-威斯特法伦州的一座城市（专有名词/地名）。"},"examples":[{"en":"Hamm is located in North Rhine–Westphalia.","zh":"Hamm 位于德国的北莱茵-威斯特法伦州。"},{"en":"She took a train from Dortmund to Hamm.","zh":"她从多特蒙德坐火车到 Hamm。"}]},{"partOfSpeech":"n.","definition":{"en":"Hamm: a family name (surname).","zh":"Hamm：姓氏。"},"examples":[{"en":"Mr. Hamm will join the meeting at 3 p.m.","zh":"Hamm 先生将于下午三点参加会议。"},{"en":"The book was written by Sarah Hamm.","zh":"这本书由 Sarah Hamm 所著。"}]}],"synonyms":["(as a place) city","(as a name) surname"],"phonetic":"/hɑm/","extraExplanation":["“Hamm”通常是专有名词（地名或姓），常见于德国语境中，因此一般要大写：Hamm。","如果你想查的是“ham”（火腿）或表示犹豫的“hmm”，拼写不同、意思也不同；你可以告诉我你指的是哪一个，我可以给出对应词条。"]}
{"word":"hammada","summary":{"en":"Hammada means a rocky desert plateau or plain with very little sand.","zh":"hammada 指以裸露岩石为主、沙子很少的岩石荒漠台地/平原。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rocky desert plateau or plain, with little sand and very sparse vegetation (common in North Africa and the Sahara).","zh":"（常见于北非和撒哈拉的）岩石荒漠台地/平原；以裸露岩石为主、沙子很少、植被极稀少的荒漠地形。"},"examples":[{"en":"The expedition crossed a hammada where there was almost no shade or water.","zh":"探险队穿越了一片hammada岩石荒漠，几乎没有遮阴处，也找不到水。"},{"en":"Unlike a sandy desert, a hammada is covered mostly with bare rock.","zh":"不同于沙漠，hammada主要覆盖的是裸露岩石。"}]}],"synonyms":["rock desert","stony desert"],"phonetic":"/həˈmɑːdə/","extraExplanation":["词源来自阿拉伯语，常见于地理学/地貌学文本，用来描述“岩石荒漠”这一类地表。","在撒哈拉相关语境中常与 erg（沙海、大片沙丘）对比：hammada 更“硬”、更岩石化；也可能与 reg（砾漠、石砾覆盖的荒漠）一起出现，但 hammada 往往更接近裸岩台地的感觉。"]}
{"word":"hammadas","summary":{"en":"Hammadas are rocky desert plateaus with little or no sand (plural of hammada).","zh":"Hammadas 指几乎无沙、以岩石为主的荒漠台地（hammada 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of hammada) Rocky desert plateaus with little or no sand, usually found in North Africa and parts of the Middle East.","zh":"（hammada 的复数）多岩石的荒漠台地，几乎没有沙子，常见于北非及中东部分地区。"},"examples":[{"en":"The expedition crossed several hammadas where the ground was mostly bare rock.","zh":"探险队穿越了几片 hammadas，那里的地面大多是裸露的岩石。"},{"en":"Unlike sandy dunes, hammadas are hard, stony surfaces that can be difficult to travel across.","zh":"与沙丘不同，hammadas 是坚硬的石质地表，行走起来可能更困难。"}]}],"synonyms":["rocky desert plateaus","stony deserts","hamadas"],"phonetic":"/həˈmɑːdəz/","extraExplanation":["“Hammada”一词常见于地理与旅行写作，来自阿拉伯语背景，用来区分不同沙漠地貌：如沙质沙漠（erg）、砾石沙漠（reg/serir）与岩石台地（hammada）。"]}
{"word":"hammaid","summary":{"en":"“Hammaid” is not a standard word; it is most likely a misspelling of “handmaid,” meaning a (historical) female servant or, figuratively, a helper/support.","zh":"“hammaid”并非常见英文词；它很可能是“handmaid”的拼写错误，意为（旧时）侍女/女仆，也可比喻为“助手、辅佐之物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of “handmaid”) a female servant or attendant, especially in older or historical contexts.","zh":"（很可能是“handmaid”的拼写错误）女仆；侍女（多用于历史或较古旧语境）。"},"examples":[{"en":"In the old household, the handmaid helped her lady dress each morning.","zh":"在旧时的宅邸里，侍女每天早晨帮助女主人穿衣。"},{"en":"The queen was accompanied by two handmaids.","zh":"王后身边有两名侍女陪同。"},{"en":"She worked as a handmaid in a wealthy family.","zh":"她在一个富裕家庭里当侍女。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) something that serves or supports a main purpose; a helper.","zh":"（比喻）助手；辅佐之物（指为主要目标服务、提供支持的事物）。"},"examples":[{"en":"Technology should be a handmaid to learning, not a distraction.","zh":"科技应当成为学习的助手，而不是干扰。"},{"en":"Good planning is the handmaid of success.","zh":"良好的规划是成功的帮手。"}]}],"synonyms":["maid","servant","attendant","helper"],"phonetic":"/ˈhændˌmeɪd/","extraExplanation":["“hammaid”不是常见英文拼写；多数情况下你可能想写的是“handmaid”。","“handmaid”带有较强的古典/宗教/历史语感：例如《圣经》中常出现“the handmaid of the Lord（主的婢女）”之类表达。","现代文化中该词也常让人联想到小说/剧集《The Handmaid’s Tale》（《使女的故事》），其中“handmaid/使女”指在极权社会中被强迫承担生育角色的女性。"]}
{"word":"Hammal","summary":{"en":"a warm-blooded animal that feeds its young with milk","zh":"用乳汁哺育幼崽的恒温动物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A warm-blooded animal that usually has hair or fur, and mothers feed their babies with milk.","zh":"哺乳动物：恒温动物，通常有毛发；母体用乳汁喂养幼崽。"},"examples":[{"en":"Humans are mammals.","zh":"人类是哺乳动物。"},{"en":"A whale is a mammal, not a fish.","zh":"鲸是哺乳动物，不是鱼。"},{"en":"Bats are the only mammals that can truly fly.","zh":"蝙蝠是唯一能真正飞行的哺乳动物。"}]}],"synonyms":["animal","vertebrate"],"phonetic":"/ˈmæməl/","extraExplanation":["常见特征：有毛发或皮毛、恒温、用肺呼吸、母体分泌乳汁哺育幼崽（少数例外的细节不必在初学阶段纠结）。","易混词：mammal（哺乳动物） vs. animal（动物，范围更大） vs. reptile（爬行动物） vs. amphibian（两栖动物）.","拼写提示：mammal 里有两个 m（mam + mal），和“妈妈喂奶（mama）”的联想很搭。"],"etymology":"来自拉丁语 mammalis（“与乳房/乳汁有关的”），词根 mamm- 表示“乳房”，因此 mammal 指“以乳汁哺育幼崽的动物”。另外：你输入的 Hammal 常见为拼写误差，标准拼写是 mammal。","mnemonic":["把 mammal 想成 mama + l：mama（妈妈）用奶喂宝宝 → 哺乳动物。","记双写：mam- 里有两个 m，像“胸前两边的乳房” → mammal。"]}
{"word":"hammal","summary":{"en":"“hammal” means a porter who carries loads (often spelled “hamal”).","zh":"“hammal”指搬运工/挑夫（常见拼写为“hamal”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a porter or manual laborer who carries heavy loads, especially in the Middle East or South Asia (a less common spelling/variant of “hamal”).","zh":"（尤指中东或南亚的）搬运工、挑夫（较少见的拼写形式/变体，常见写法为 hamal）。"},"examples":[{"en":"The hammal carried our luggage from the bus to the hotel.","zh":"那位搬运工把我们的行李从大巴搬到酒店。"},{"en":"In the old market, a hammal offered to carry the sacks for a small fee.","zh":"在老集市里，一位挑夫提出收点小费帮忙搬麻袋。"}]}],"synonyms":["porter","carrier","bearer","loader"],"phonetic":"/həˈmɑl/","extraExplanation":["“hammal”多见于对阿拉伯语词 حَمّال（ḥammāl）的音译，意思是“搬运者、负重者”。在英语里更常见的拼写是“hamal”。在旅游、历史叙述或描写传统市集/港口劳动时可能出现。"]}
{"word":"hammals","summary":{"en":"“Hammals” is likely a misspelling of “mammals,” meaning warm-blooded animals whose mothers feed babies with milk.","zh":"“hammals”多半是“mammals”的拼写错误，意思是“哺乳动物”（母体用乳汁喂养幼崽的恒温动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A warm-blooded animal that usually has hair or fur, and the mother produces milk to feed her babies (e.g., humans, dogs, whales).","zh":"哺乳动物：一种恒温动物，通常有毛发，雌性会分泌乳汁哺育幼崽（如人类、狗、鲸）。"},"examples":[{"en":"Humans are mammals.","zh":"人类是哺乳动物。"},{"en":"A whale is a mammal, not a fish.","zh":"鲸是哺乳动物，不是鱼。"},{"en":"Bats are the only mammals that can truly fly.","zh":"蝙蝠是唯一能真正飞行的哺乳动物。"}]}],"synonyms":["warm-blooded animal"],"phonetic":"/ˈmæməl/","extraExplanation":["你输入的“hammals”在英语里不常见，通常是把“mammals”（mammal 的复数：哺乳动物们/哺乳动物）拼错了。","词源小知识：mammal 来自拉丁语 mamm-a（乳房），因此它与“哺乳”这一特征直接相关。"]}
{"word":"hammam","summary":{"en":"A hammam is a traditional public bathhouse (or the bathing/steam ritual) common in the Middle East, North Africa, and Turkey.","zh":"hammam 指传统公共浴场（或其中的蒸汽洗浴流程），常见于中东、北非与土耳其。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A public bathhouse (common in North Africa, the Middle East, and Turkey), where people wash, steam, and relax; similar to a Turkish bath.","zh":"（常见于北非、中东和土耳其的）公共浴室/澡堂，人们在里面洗浴、蒸汽浴并放松；类似“土耳其浴”。"},"examples":[{"en":"We visited a hammam in Marrakech and spent an hour in the steam rooms.","zh":"我们在马拉喀什参观了一家hammam，在蒸汽浴室里待了一个小时。"},{"en":"In many cities, the neighborhood hammam is also a social place where people chat and unwind.","zh":"在很多城市里，社区的hammam也是社交场所，人们会聊天放松。"}]},{"partOfSpeech":"n.","definition":{"en":"The hot/steamy room or bathing ritual inside such a bathhouse (the “hammam experience”).","zh":"（在浴场中的）热蒸汽房或整套洗浴流程/仪式（“hammam体验”）。"},"examples":[{"en":"The spa offers a hammam treatment with exfoliation and soap foam.","zh":"这家水疗提供hammam护理，包括去角质和皂泡清洁。"},{"en":"After the hammam, I felt clean and relaxed.","zh":"做完hammam之后，我感觉很干净也很放松。"}]}],"synonyms":["bathhouse","public bath","Turkish bath","steam bath"],"phonetic":"/hɑːˈmɑːm/","extraExplanation":["“hammam”一词来自阿拉伯语，原意与“热/温暖”相关，因此常指带蒸汽与热水的洗浴空间。","在旅行语境中，你可能会看到“Turkish hammam / Moroccan hammam”等说法：不同地区的细节（温度、搓澡方式、用皂习惯）会有差异，但核心都是清洁与放松。","文化上，传统hammam不仅是洗澡的地方，也常承担社区交流、仪式准备（如婚礼前的沐浴）等功能。"]}
{"word":"hammed","summary":{"en":"“Hammed” usually means “acted in an exaggerated, theatrical way” (past of ham). Less commonly, it can mean “hindered,” or (informal) “very drunk.”","zh":"“hammed”通常指“演得很夸张/很做作”（ham的过去式）。较少情况下可指“妨碍”，或（非正式）“醉得很厉害”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “ham”: to act in an exaggerated, overly theatrical way (often to be funny or get attention).","zh":"“ham”的过去式/过去分词：表演得很夸张、很做作（常为搞笑或吸引注意）。"},"examples":[{"en":"He hammed it up during the school play to make his friends laugh.","zh":"他在学校话剧里演得特别夸张，把朋友们逗笑了。"},{"en":"Don’t ham it up in the meeting—just explain the facts.","zh":"开会别太做作，直接把事实讲清楚就行。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “ham”: to hinder or complicate something by clumsy or unnecessary actions (less common).","zh":"“ham”的过去式/过去分词：因笨拙或多余的行为而妨碍、把事情弄复杂（较少见）。"},"examples":[{"en":"The extra rules hammed the project and slowed everyone down.","zh":"那些额外规定妨碍了项目进度，把大家都拖慢了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, less common) very drunk; a variant spelling of “hammered.”","zh":"（非正式，较少见）醉得很厉害；相当于“hammered”的一种写法。"},"examples":[{"en":"He showed up totally hammed after the party.","zh":"他派对后醉得不行地出现了。"},{"en":"I can’t drive—I’m hammed.","zh":"我不能开车——我醉了。"}]}],"synonyms":["overacted","played it up","exaggerated","made a fuss","(drunk) wasted","(drunk) smashed","(drunk) hammered"],"phonetic":"/hæmd/","extraExplanation":["“ham it up”是非常常见的固定搭配，意思是“故意演得夸张/装模作样”，语气通常偏轻松或带点吐槽。","“hammed=醉了”这种用法不如“hammered”常见；在正式写作里建议用“drunk/intoxicated”或更常见的“hammered”。"]}
{"word":"hammer","summary":{"en":"“Hammer” is a tool for hitting, and it also means to hit hard/repeatedly or to strongly criticize/defeat.","zh":"“hammer”既指“锤子”，也可作动词表示“用力反复敲打”，引申为“痛击/严厉抨击”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tool with a heavy head on a handle, used for hitting things (especially for driving nails).","zh":"锤子；槌（带有重锤头的工具，用来敲击物体，尤其是钉钉子）。"},"examples":[{"en":"He picked up a hammer and drove the nail into the wall.","zh":"他拿起锤子，把钉子钉进墙里。"},{"en":"Keep the hammer in the toolbox when you’re done.","zh":"用完后把锤子放回工具箱里。"}]},{"partOfSpeech":"v.","definition":{"en":"To hit something repeatedly or hard, often with a hammer; more generally, to strike forcefully.","zh":"用锤子敲打；（泛指）猛击、重击。"},"examples":[{"en":"She hammered the nail until it was flush with the wood.","zh":"她不停敲钉子，直到钉帽与木板齐平。"},{"en":"Rain hammered the roof all night.","zh":"雨整夜噼里啪啦地敲打着屋顶。"}]},{"partOfSpeech":"v.","definition":{"en":"To criticize, defeat, or pressure someone strongly (often in news and sports).","zh":"严厉批评；重挫；强力施压（常见于新闻与体育语境）。"},"examples":[{"en":"The team hammered their opponents 5–0.","zh":"这支球队以 5 比 0 痛击对手。"},{"en":"The report hammered the company for poor safety standards.","zh":"这份报告严厉批评了该公司糟糕的安全标准。"}]}],"synonyms":["mallet","strike","pound","bash","slam"],"phonetic":"/ˈhæmɚ/","extraExplanation":["“hammer”既可指具体的工具，也常作动词表示“连续用力敲击”。比喻用法很常见：如在体育报道里表示“碾压式获胜”，在评论/新闻里表示“猛烈抨击”。","在文学与文化中，“hammer”常象征力量、劳动与锻造（例如锻冶中的铁锤意象）。在一些神话/流行文化里，锤子也可能与“力量象征”相关（如北欧神话中的雷神之锤意象）。"]}
{"word":"hammer-forged","summary":{"en":"Made by hammering metal into shape; sometimes a forged-style finish.","zh":"通过锤打锻造成形；有时也指仿锤锻的装饰质感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a metal object) shaped by repeated blows with a hammer, usually while hot; made by traditional forging rather than casting or machining.","zh":"（指金属物件）通过反复锤打（常在加热状态下）锻造成形；通常强调传统锻造工艺，而非铸造或机加工。"},"examples":[{"en":"The chef prefers a hammer-forged carbon-steel pan for fast heating.","zh":"这位主厨更喜欢锤锻碳钢锅，因为升温很快。"},{"en":"Many artisans advertise hammer-forged knives as tougher and longer-lasting.","zh":"很多匠人宣传锤锻刀具更结实、更耐用。"},{"en":"The bracelet has a hammer-forged texture that catches the light.","zh":"这条手链带有锤锻纹理，能反射出好看的光泽。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made to resemble the look of forged metal (a decorative finish), even if not actually forged.","zh":"（装饰性用法）做成“像锻造金属”的外观或纹理；即使不一定是真正锻造而成。"},"examples":[{"en":"They chose a hammer-forged finish for the cabinet handles.","zh":"他们给橱柜把手选了锤锻质感的表面处理。"},{"en":"The lamp has a hammer-forged look, but it’s mass-produced.","zh":"这盏灯看起来像锤锻风格，但其实是量产的。"}]}],"synonyms":["hand-forged","forged","hammered","smith-forged","wrought"],"phonetic":"/ˈhæmɚ fɔrdʒd/","extraExplanation":["含义侧重在“工艺方式”与“质感”：真实锤锻通常会留下不规则锤纹，常被认为更有手工感；但在广告中也可能仅表示“锤纹风格”的表面效果，不一定代表更好的性能。","常见搭配：hammer-forged steel（锤锻钢）、hammer-forged knife/blade（锤锻刀/刀刃）、hammer-forged pan（锤锻锅）、hammer-forged texture/finish（锤锻纹理/表面处理）。"],"etymology":"复合形容词：hammer（锤子）+ forged（forge“锻造”的过去分词作形容词）。forge源自古法语 forger，和“塑形、锻造金属”相关；hammer-forged字面就是“用锤子锻出来的”，常用于刀具、锅具、首饰与五金工艺品描述。","mnemonic":["把它拆开记：hammer=锤子；forged=锻造过的 → “用锤子锻出来的”。","联想“打铁花/打铁匠”：反复敲打才能成形 → 对应 hammer-forged 的画面感。"]}
{"word":"hammer-headed","summary":{"en":"Hammer-shaped in the head; sometimes meaning stubborn or thick-headed.","zh":"头部呈锤形；也可指固执、不开窍。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a head (or head shape) like a hammer; broad and flattened at the sides.","zh":"（头或头部形状）像锤子一样；两侧宽扁的。"},"examples":[{"en":"The hammer-headed shark has a wide, flat head that helps it sense prey.","zh":"双髻鲨（锤头鲨）有宽而扁的头部，有助于感知猎物。"},{"en":"In the illustration, the creature is drawn as hammer-headed and oddly elegant.","zh":"在这幅插图里，这种生物被画成锤头状，却又有种奇特的优雅。"}]},{"partOfSpeech":"adj.","definition":{"en":"Stubborn or thick-headed; not willing to listen or change one’s mind. (informal)","zh":"固执的；不开窍的；听不进劝的。（非正式）"},"examples":[{"en":"He’s so hammer-headed that he won’t admit he made a mistake.","zh":"他固执得要命，连自己犯错都不肯承认。"},{"en":"Don’t be hammer-headed—just ask for help if you’re stuck.","zh":"别这么死脑筋——卡住了就开口求助。"}]}],"synonyms":["hammerhead","broad-headed","flat-headed","stubborn","obstinate","pigheaded","thickheaded"],"phonetic":"/ˈhæmɚ ˌhɛdɪd/","extraExplanation":["在自然科普里常见于“hammer-headed shark（锤头鲨）”。这里的“headed”表示“具有某种头部形状/特征”，类似的还有“big-headed（大头的/自大的）”。"],"etymology":"复合形容词：hammer（锤子）+ headed（…头的/…脑子的）。字面义指“像锤子一样的头”，后来也可引申为“脑袋像锤子一样硬”，表示顽固、不灵活。","mnemonic":["hammer = 锤子；hammer-headed = “锤子头”→ 形状像锤子。","引申记法：脑袋像锤子一样“硬”→ 听不进劝＝固执。"]}
{"word":"hammer-seismic","summary":{"en":"Using hammer impacts as a seismic source for shallow subsurface surveys.","zh":"用锤击冲击作为震源进行浅层地震探测。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing a small-scale seismic survey method (or equipment) that uses repeated hammer blows on a plate or ground surface as the vibration source to create seismic waves for measuring the subsurface.","zh":"指一种小规模地震勘探方法（或相关设备/信号源）：用锤子反复敲击钢板或地面作为震源，产生地震波，用于探测地下结构。"},"examples":[{"en":"They ran a hammer-seismic line to estimate the depth to bedrock.","zh":"他们用锤击地震法做了一条测线来估算基岩深度。"},{"en":"Hammer-seismic data are useful for shallow investigations in engineering sites.","zh":"锤击地震数据常用于工程场地的浅层调查。"},{"en":"Compared with explosives, a hammer-seismic source is safer and easier to deploy.","zh":"与炸药相比，锤击震源更安全，也更容易布设。"}]}],"synonyms":["impact seismic","hammer source","seismic hammer","shallow seismic"],"phonetic":"/ˈhæmɚ ˈsaɪzmɪk/","extraExplanation":["在地球物理里，hammer-seismic 往往隐含“冲击震源（impact source）”的意思：用大锤敲击金属板（常叫 strike plate）把能量耦合进地面，再用检波器记录波形。常见应用包括浅层折射（refraction）或面波（MASW）等方法。"],"etymology":"这是一个技术复合词：hammer（锤击）+ seismic（地震的/地震勘探的）。常见于工程地球物理、浅层地震勘探语境，用来说明“震源类型来自锤击冲击”。","mnemonic":["把它拆开记：hammer=锤子，seismic=地震的；合起来就是“用锤子制造‘小地震’来探测地下”。","联想中文：锤击（hammer）→ 震动（seismic）→ “锤击震测/锤击地震法”。"]}
{"word":"hammer-shaped","summary":{"en":"hammer-like in form","zh":"形状像锤子的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a hammer (with a long handle-like part and a broader head-like end).","zh":"锤子形的；呈锤状的（像锤柄加锤头那样的形状）。"},"examples":[{"en":"The doctor pointed to a hammer-shaped bone in the diagram.","zh":"医生指着图里一块锤子形的骨头。"},{"en":"A hammer-shaped tool head can deliver force more directly.","zh":"锤子形的工具头能更直接地传递力量。"},{"en":"The leaf tip was slightly hammer-shaped at the end.","zh":"叶尖末端有点呈锤状。"}]}],"synonyms":["hammerlike","mallet-shaped","club-shaped","T-shaped"],"phonetic":"/ˈhæmɚ ʃeɪpt/","extraExplanation":["写法提示：作定语放在名词前时通常用连字符（a hammer-shaped head）；作表语放在系动词后时有时可不加连字符（The head is hammer shaped），但加连字符更清晰。","常见语境：医学解剖（如“锤骨”相关描述）、工具/工程设计、动植物形态描写等。"],"etymology":"由“hammer（锤子）+ shaped（……形状的）”构成的复合形容词；常用连字符（hammer-shaped）来表示作为一个整体的定语。","mnemonic":["把它拆开记：hammer=锤子，shaped=有……形状的 → “锤子形的”。","联想“shape=形状/造型”，看到shaped就想到“长得像……”。"]}
{"word":"hammerable","summary":{"en":"“Hammerable” means able to be hammered into shape, and informally, easy to force or shape into a result.","zh":"“hammerable”指“可被锤打成形的”；口语里也可指“容易被强行推进或塑造成某种结果的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be hammered into shape; suitable for being struck with a hammer (often about metal or a surface).","zh":"可被锤打成形的；适合用锤子敲打的（常指金属或某种表面）。"},"examples":[{"en":"Copper is hammerable, so it can be shaped into thin sheets.","zh":"铜是可锤打成形的，所以可以被打成很薄的片。"},{"en":"The soft alloy is more hammerable than steel.","zh":"这种软合金比钢更容易锤打加工。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Easy to hit hard, fix, or force into a desired form or decision.","zh":"（非正式）容易被“重锤式”处理、纠正，或被强行推进到某种结果/决定的。"},"examples":[{"en":"The schedule isn’t hammerable—there’s no room to move the deadline.","zh":"这个时间表不是那种能硬敲出来的——截止日期没法挪。"},{"en":"She wanted a plan that was hammerable into clear steps.","zh":"她想要一个能被“敲打”成清晰步骤的计划。"}]}],"synonyms":["malleable","workable","forgeable","shapeable"],"phonetic":"/ˈhæmərəbəl/","extraExplanation":["“hammerable”由 hammer（锤子/用锤敲）+ -able（能够……的）构成，最常见于工艺与材料语境，和“malleable（可锻的、可塑的）”意思接近，但更强调“用锤子敲打”这一具体加工方式。","在工程/金工里，除了 hammerable，也常用更正式的词如 malleable、workable（易加工的）、forgeable（可锻造的）。"]}
{"word":"hammerbird","summary":{"en":"“Hammerbird” usually means the African water bird called the hammerkop, known for its hammer-shaped head.","zh":"hammerbird 通常指非洲的锤头鹳（hammerkop），因头部形状像锤子而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large African water bird (the hammerkop) with a distinctive hammer-shaped head; also called a hammerhead or hammerkop","zh":"（非洲）锤头鹳；一种头部形状像“锤子”的大型涉水鸟，也常被称为 hammerkop / hammerhead"},"examples":[{"en":"We spotted a hammerbird standing quietly at the edge of the marsh.","zh":"我们看到一只锤头鹳静静地站在沼泽边。"},{"en":"The guide explained that the hammerbird builds a huge nest near water.","zh":"导游解释说，锤头鹳会在水边筑起非常大的巢。"}]}],"synonyms":["hammerkop","hammerhead (bird)"],"phonetic":"/ˈhæmɚˌbɝd/","extraExplanation":["“hammerbird”在英语里不是特别常见，更常用的名称是“hammerkop”（也写作“hamerkop”）。它主要分布在撒哈拉以南非洲，常出现在湖泊、河流、湿地附近。","这种鸟最有名的特点之一是会搭建体积很大的巢，有时像“小屋”一样结实；在一些地区的民间文化中，它的巢也会被赋予象征意义。"]}
{"word":"hammercloth","summary":{"en":"A decorative cloth on a carriage coachman’s seat, often showing a crest.","zh":"马车车夫座位上的装饰罩布，常绣有纹章。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative cloth or covering placed on the seat or back of a coach (carriage), often used for ornament and to display a family’s coat of arms","zh":"（马车）车夫座位上或座位靠背处的装饰布/罩布，常用于装饰并展示家族纹章"},"examples":[{"en":"The old coach still had its hammercloth embroidered with a crest.","zh":"那辆老式马车的车夫座位罩布上仍绣着家族纹章。"},{"en":"In the museum, a bright red hammercloth was displayed beside the carriage.","zh":"在博物馆里，一块鲜红的车夫座位装饰布陈列在马车旁边。"}]}],"synonyms":["coach seat cover","carriage seat cloth","decorative seat covering"],"phonetic":"/ˈhæmərˌklɔθ/","extraExplanation":["“hammercloth”多见于英式历史语境，指18—19世纪豪华马车（coach）上车夫座位的装饰罩布；常与贵族、礼仪出行、家族纹章（coat of arms / crest）相关。现代日常英语中很少使用，更多出现在历史小说、博物馆说明或古董车资料里。"]}
{"word":"hammercloths","summary":{"en":"Hammercloths are decorative cloth coverings on the driver’s seat/box of a horse-drawn coach, often showing a crest.","zh":"hammercloths 指马车车夫座位（车座箱）上的装饰布盖，常带家族徽章，用于彰显身份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Decorative cloth coverings (often with a family crest) placed on the driver’s seat/box of a horse-drawn carriage or coach.","zh":"（常带家族徽章的）装饰布盖，铺在马车/四轮马车的车夫座位（车座箱）上。"},"examples":[{"en":"The museum coach still has its original hammercloths with embroidered initials.","zh":"这辆博物馆里的马车仍保留着原来的 hammercloths，上面绣着首字母。"},{"en":"In the period drama, the noble family’s hammercloths signaled their rank.","zh":"在那部年代剧里，贵族家的 hammercloths 显示了他们的身份地位。"}]}],"synonyms":["decorative coach cloth","coach box covering"],"phonetic":"/ˈhæmɚˌklɔθs/","extraExplanation":["hammercloth（单数）是较旧的词，更多见于英国语境、历史叙述、文学或博物馆说明中；现代日常英语里很少用到。","词源上与“hammer（锤子）”没有直接关系。它来自较早的用法，指马车车夫座位上的一种装饰性覆盖物；常绣有徽章或图案，用来展示家族身份。"]}
{"word":"hammerdress","summary":{"en":"“Hammerdress” is not a standard English word; it’s usually a context-dependent compound or name.","zh":"“hammerdress”不是标准英语词，通常是依语境而定的合成词或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare compound word (likely from “hammer” + “dress”). It is not a common dictionary word in English, so its meaning depends on context (e.g., a product name, username, or a description like “a dress with a hammer design” or “a dress made with hammered metal details”).","zh":"一个不规范或非常少见的合成词（可能由 hammer「锤子」+ dress「连衣裙」组成）。它不是英语里常见的词典词汇，因此具体含义要看语境（例如品牌/商品名、用户名，或指「带锤子图案的裙子」「带锤纹金属质感装饰的裙子」等）。"},"examples":[{"en":"I saw “hammerdress” as a username on social media.","zh":"我在社交媒体上看到有人用“hammerdress”当用户名。"},{"en":"The listing says “hammerdress,” but it probably means a dress with a hammer pattern or hammered-metal style details.","zh":"商品标题写“hammerdress”，但它很可能是指带锤子图案的裙子，或有锤纹金属风装饰的裙子。"}]}],"phonetic":"/ˈhæmərdrɛs/","extraExplanation":["这个词在常见英语语料和词典中几乎不出现，更像是自造词/网名/品牌名。若你能提供一句原文或截图（它出现在哪个平台、描述什么），我可以帮你更准确地解释它在该语境下的意思。","如果你本来想查的是某个相近词，常见的有：hammer（锤子；用锤子敲）、dress（穿衣；连衣裙）、hammered（被锤打的；表面有锤纹的）。"]}
{"word":"hammered","summary":{"en":"“Hammered” most commonly means very drunk (informal). It can also mean hit/pounded hard, badly defeated, or the past form of “hammer.”","zh":"“hammered”最常见意思是（口语）喝得很醉；也可指被猛敲/锤打、惨败，或作“hammer”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Very drunk; heavily intoxicated.","zh":"（非正式）喝得很醉；酩酊大醉。"},"examples":[{"en":"He got hammered at the party and couldn’t remember how he got home.","zh":"他在派对上喝得很醉，连自己怎么回家的都不记得了。"},{"en":"I’m not driving—I'm hammered.","zh":"我不开车——我喝醉了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Hit, beaten, or damaged by repeated blows; pounded flat.","zh":"被反复敲打的；被砸坏的；被锤平的。"},"examples":[{"en":"The metal was hammered into a thin sheet.","zh":"金属被锤打成一张薄片。"},{"en":"After the storm, the roof looked hammered.","zh":"暴风雨过后，屋顶看起来被打得很惨。"}]},{"partOfSpeech":"adj.","definition":{"en":"Defeated badly; overwhelmed (often in sports or competition).","zh":"（比赛等）惨败的；被彻底击败的。"},"examples":[{"en":"Our team got hammered 5–0.","zh":"我们队以0比5惨败。"},{"en":"The proposal was hammered in the meeting.","zh":"这个提案在会议上被狠狠否决了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hammer”: to hit repeatedly with a hammer or similar force; to criticize or attack strongly.","zh":"“hammer”的过去式/过去分词：用锤子或类似力量反复敲击；（口头/媒体）猛烈批评或抨击。"},"examples":[{"en":"They hammered the nails into the wood.","zh":"他们把钉子钉进木头里。"},{"en":"The journalist hammered the company for its safety record.","zh":"记者因安全记录问题猛烈抨击那家公司。"}]}],"synonyms":["drunk","wasted","intoxicated","smashed","pounded","beaten","crushed"],"phonetic":"/ˈhæmərd/","extraExplanation":["“hammered=很醉”是英语里很常见的口语俚语，语气随意，适合朋友间聊天或影视对白；在正式场合更建议说“drunk / intoxicated”。","在英美文化中，谈“喝醉”有很多委婉或幽默的说法（如 tipsy, buzzed, wasted）；其中“hammered”通常表示程度比较重。"]}
{"word":"hammerer","summary":{"en":"A hammerer is a person (or, rarely, a device part) that hammers repeatedly.","zh":"hammerer 指用锤子敲打的人（罕见也可指会反复敲打的装置部件）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who hammers; someone whose job or role involves hitting things with a hammer (or hammering repeatedly).","zh":"用锤子敲打的人；以敲击（反复敲打）为工作或职责的人。"},"examples":[{"en":"The hammerer shaped the hot metal into a thin blade.","zh":"那位锻工用锤子把热金属锻造成一把薄刀。"},{"en":"In the factory, each hammerer works at a different station.","zh":"在工厂里，每位敲锤工都在不同的工位工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) something that hammers—such as a machine part or tool that strikes repeatedly.","zh":"（罕用）会“锤击”的东西；例如反复敲打的机器部件或工具。"},"examples":[{"en":"The technician replaced the hammerer in the stamping machine.","zh":"技术员更换了冲压机里的击锤部件。"}]}],"synonyms":["blacksmith","metalworker","striker","hammerman"],"phonetic":"/ˈhæmərər/","extraExplanation":["“hammerer”由“hammer（锤击）+ -er（做某事的人/物）”构成。英语里很多职业或角色名词都用“-er”，如“worker（工人）”“driver（司机）”。","在日常英语中，“hammerer”不算常用，更常见的说法是“someone who hammers”或具体职业名词，如“blacksmith（铁匠）”“metalworker（金属工）”。"]}
{"word":"hammerers","summary":{"en":"Hammerers are people who hammer—literally with a tool, or figuratively by repeatedly attacking an idea.","zh":"hammerers 指“打锤的人/敲打的人”，也可比喻为“反复抨击某观点的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who hit something repeatedly with a hammer (or who do heavy hitting work); workers who hammer as part of their job","zh":"用锤子反复敲打的人；以敲打/打锤为工作内容的工人"},"examples":[{"en":"The hammerers worked in shifts to break the old concrete.","zh":"打锤的工人轮班作业来砸开旧混凝土。"},{"en":"You could hear the hammerers on the roof from the street.","zh":"从街上就能听到屋顶上敲打的人。"}]},{"partOfSpeech":"n.","definition":{"en":"people who try to persuade, criticize, or attack an idea repeatedly (figurative)","zh":"（比喻）反复施压、反复批评或不断抨击某种观点的人"},"examples":[{"en":"The policy’s hammerers kept repeating the same arguments online.","zh":"这项政策的抨击者在网上不断重复同样的论点。"},{"en":"She became one of the loudest hammerers of the plan in the meeting.","zh":"在会议上，她成了最强烈反对该计划的人之一。"}]}],"synonyms":["hammer men","workers","construction workers","critics","opponents"],"phonetic":"/ˈhæmərərz/","extraExplanation":["“hammerer”由动词 hammer（用锤敲打）+ 后缀 -er（表示“做某事的人/物”）构成；“hammerers”是其复数形式。","口语里更常见的说法有：workers with hammers, people hammering, construction workers；在比喻用法中常见：critics, opponents。"]}
{"word":"hammerfish","summary":{"en":"Hammerfish is a less common word for a hammerhead shark.","zh":"Hammerfish 是指“双髻鲨”的较少见说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hammerhead shark; a shark with a wide, hammer-shaped head (a less common name).","zh":"双髻鲨；头部像“锤子”一样展开的鲨鱼（较不常见的叫法）。"},"examples":[{"en":"We saw a hammerfish gliding near the reef.","zh":"我们看到一条双髻鲨在珊瑚礁附近滑行。"},{"en":"Hammerfish use their wide heads to help locate prey.","zh":"双髻鲨会利用宽大的头部来帮助定位猎物。"}]}],"synonyms":["hammerhead","hammerhead shark"],"phonetic":"/ˈhæmɚˌfɪʃ/","extraExplanation":["“hammerfish”在现代英语里不算常用，更常见的说法是“hammerhead”或“hammerhead shark”。在一些地区性用法、口语或较老的资料里，你可能会看到“hammerfish”用来指双髻鲨。"]}
{"word":"hammerhead","summary":{"en":"A hammerhead is most commonly a hammerhead shark; it can also mean a very powerful hitter in sports.","zh":"hammerhead最常指锤头鲨；也可指（体育中）猛力击球的重炮手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of shark with a wide, flat head shaped like a hammer.","zh":"锤头鲨（头部宽扁，形状像锤子的一类鲨鱼）。"},"examples":[{"en":"We saw a hammerhead swimming near the reef.","zh":"我们在珊瑚礁附近看到一条锤头鲨在游动。"},{"en":"Hammerheads use their wide heads to help find prey in the sand.","zh":"锤头鲨会利用它们宽大的头部帮助在沙底寻找猎物。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone (often in sports) who repeatedly hits the ball very hard; a powerful hitter.","zh":"（常用于体育）重炮手；总是用力猛击球的人。"},"examples":[{"en":"He’s a real hammerhead at the plate—every swing is aggressive.","zh":"他在打击区真是个重炮手——每次挥棒都很凶。"},{"en":"The team needed a hammerhead to drive in runs.","zh":"球队需要一个重炮手来把分数打回来。"}]}],"synonyms":["hammerhead shark","shark (general)","power hitter","slugger"],"phonetic":"/ˈhæmərˌhɛd/","extraExplanation":["“hammerhead”最常见的意思是“锤头鲨”。英语里很多动物名会用外形来命名：比如 hammerhead（锤头）形状就非常直观。","引申义“重炮手/猛击者”来自 hammer（锤击、猛打）的意象，常见于棒球等运动的口语评论中；这种用法不是最正式的称呼。"]}
{"word":"hammerheaded","summary":{"en":"Hammerheaded means either ‘hammer-shaped in the head’ (like a hammerhead shark) or, more rarely, ‘stupid/stubborn.’","zh":"hammerheaded 可指“头部呈锤子状（如双髻鲨）”，也可较少见地指“愚钝/顽固”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a head shaped like a hammer (wide and flattened), like a hammerhead shark.","zh":"头部呈“锤子状”（宽而扁平）的；像双髻鲨那样的。"},"examples":[{"en":"A hammerheaded shark cruised slowly along the reef.","zh":"一条双髻鲨沿着珊瑚礁缓慢游动。"},{"en":"The fossil shows a hammerheaded skull shape, suggesting a specialized hunter.","zh":"这块化石显示出锤状头骨形态，暗示它是适应性很强的猎手。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, rare) Stupid or stubborn; thick-headed.","zh":"（非正式，较少见）愚钝的；顽固的；不开窍的。"},"examples":[{"en":"Don’t be hammerheaded—read the instructions before you start.","zh":"别这么不开窍——开始之前先把说明读一读。"},{"en":"He can be a bit hammerheaded when someone challenges his opinion.","zh":"有人质疑他的观点时，他会有点固执。"}]}],"synonyms":["hammer-headed","hammerhead","thick-headed","stubborn","pigheaded"],"phonetic":"ˈhæmɚˌhɛdɪd","extraExplanation":["“hammerheaded”常见于写作中作为“hammer-headed”的变体（带连字符更常见），字面意义与“双髻鲨（hammerhead shark）”的头部形状有关。","比喻义“愚钝/顽固”来自英语里把“head（头）”与思考能力联系起来的习惯表达（类似 thick-headed）。这种用法较口语化、也更少见，正式写作中要谨慎使用，以免显得冒犯。"]}
{"word":"hammerheads","summary":{"en":"Hammerheads most commonly means hammerhead sharks; it can also mean hammer-shaped tool heads.","zh":"hammerheads 常指锤头鲨（双髻鲨）；也可指锤形的工具锤头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of shark with a wide, flat head shaped like a hammer (plural)","zh":"锤头鲨；双髻鲨（复数）"},"examples":[{"en":"Hammerheads can use their wide heads to help sense prey in the sand.","zh":"锤头鲨可以用它们宽大的头部帮助感知沙子里的猎物。"},{"en":"We saw a school of hammerheads while diving near the reef.","zh":"我们在珊瑚礁附近潜水时看见了一群锤头鲨。"}]},{"partOfSpeech":"n.","definition":{"en":"the hammer-shaped head or striking end of a tool or object (plural)","zh":"（工具或物体的）锤头；击打端（复数）"},"examples":[{"en":"The mechanic replaced the worn hammerheads on the machine.","zh":"机械师更换了机器上磨损的锤头。"},{"en":"These hammerheads are made of rubber to avoid damaging the surface.","zh":"这些锤头由橡胶制成，以免损坏表面。"}]}],"synonyms":["hammerhead sharks","bonnetheads","tool heads","hammer heads"],"phonetic":"/ˈhæmərˌhɛd/","extraExplanation":["“Hammerhead shark（锤头鲨）”之所以得名，是因为头部左右延伸、形状像锤子。这个结构不仅让它们的眼睛视野更宽，也有助于分布在头部周围的感受器（用于感知微弱电信号）更有效地寻找猎物。"]}
{"word":"hammering","summary":{"en":"Hammering means repeated heavy hitting (or the loud sound of it), and it can also describe something pounding strongly (like a headache or heartbeat) or repeatedly emphasizing something.","zh":"Hammering 指反复用力敲打（或这种持续的敲击声）；也可形容强烈的“砰砰作响”（如头痛、心跳），或一再强调某事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of hitting something repeatedly, especially with a hammer; repeated heavy blows","zh":"（尤指用锤子）反复敲打；连续的重击"},"examples":[{"en":"The hammering from the construction site kept me awake.","zh":"工地传来的敲打声让我一直睡不着。"},{"en":"He stopped the hammering and checked if the nail was straight.","zh":"他停下敲打，检查钉子是否钉直了。"}]},{"partOfSpeech":"n.","definition":{"en":"a continuous loud knocking or pounding sound","zh":"连续的敲击声；砰砰作响的声音"},"examples":[{"en":"I heard hammering at the door and went to see who it was.","zh":"我听到有人在门口砰砰敲门，就过去看看是谁。"},{"en":"The hammering of rain on the roof grew louder.","zh":"雨点砸在屋顶上的声响越来越大。"}]},{"partOfSpeech":"adj.","definition":{"en":"hitting something repeatedly and strongly (often used figuratively)","zh":"不断猛击的；（常引申）猛烈持续的"},"examples":[{"en":"I woke up with a hammering headache.","zh":"我醒来时头痛得厉害。"},{"en":"My heart was hammering as I waited for the results.","zh":"我等结果时心跳得很厉害。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “hammer”: to hit repeatedly; to forcefully emphasize or criticize again and again","zh":"“hammer”的现在分词：反复敲打；（引申）一再强调或猛烈批评"},"examples":[{"en":"She was hammering the metal into shape.","zh":"她在反复敲打金属，把它敲成形。"},{"en":"The coach kept hammering the importance of teamwork.","zh":"教练一直强调团队合作的重要性。"},{"en":"Reporters were hammering the minister with questions.","zh":"记者们用连珠炮般的问题追问那位部长。"}]}],"synonyms":["pounding","banging","knocking","thumping","striking","repeated blows"],"phonetic":"/ˈhæmɚɪŋ/","extraExplanation":["“hammering”常见的引申搭配有：\n- “hammering headache”（剧烈头痛）：把疼痛比作锤子在敲。\n- “heart was hammering”（心脏砰砰直跳）：表示紧张、害怕或兴奋。\n- “hammer something home”（把某观点反复强调到大家都明白）：常用于学习、训练、演讲语境。"]}
{"word":"hammeringly","summary":{"en":"“Hammeringly” means “in a forceful, heavy, hammer-like way,” often describing something harsh, relentless, or overwhelming.","zh":"“Hammeringly”表示“像锤击一样强而猛地”，常用于形容猛烈、严厉或压倒性的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a forceful, heavy way, as if striking repeatedly with a hammer; powerfully or harshly (often used figuratively).","zh":"以强力、沉重的方式（像用锤子反复敲击）；也常作比喻，指猛烈地、严厉地、压倒性地。"},"examples":[{"en":"The rain hit the roof hammeringly all night.","zh":"雨整夜猛烈地敲打着屋顶。"},{"en":"They were hammeringly criticized in the report for poor safety practices.","zh":"报告中对他们糟糕的安全做法进行了猛烈批评。"},{"en":"The team lost hammeringly, with almost no chance to recover.","zh":"那支队伍惨败，几乎没有翻盘的机会。"}]}],"synonyms":["heavily","forcefully","severely","relentlessly","brutally"],"phonetic":"/ˈhæmərɪŋli/","extraExplanation":["“hammeringly”是由“hammer（锤子/猛击）+ -ingly（表示方式的副词后缀）”构成的副词，但在现代英语里比较少见，更多时候人们会用“heavily / forcefully / severely / relentlessly”等更常用的副词替代。","它既可形容真实的声音或撞击（雨、门、拳头等），也常用于比喻语境，表示“压倒性地、毫不留情地”（如批评、失败、胜利的程度很大）。"]}
{"word":"hammerings","summary":{"en":"repeated heavy blows; by extension, a crushing defeat or harsh criticism","zh":"连续重击；引申为惨败或猛烈批评"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Repeated heavy hits or blows; the act of striking something many times.","zh":"反复的重击；连续敲打的动作。"},"examples":[{"en":"The hammerings from the construction site started before sunrise.","zh":"工地的连续敲打声天没亮就开始了。"},{"en":"After hours of hammerings, the metal sheet finally lay flat.","zh":"连续敲打了好几个小时后，金属板终于变平了。"}]},{"partOfSpeech":"n.","definition":{"en":"A severe defeat or strong negative experience (often in sports, politics, or business).","zh":"惨败；重大挫折（常用于体育、政治或商业语境）。"},"examples":[{"en":"The team suffered two hammerings in a row and dropped to last place.","zh":"球队连续两场惨败，跌到了最后一名。"},{"en":"The company took a hammering when sales collapsed.","zh":"销量崩盘时，公司遭遇了沉重打击。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong criticism or harsh questioning, especially from the public or media.","zh":"强烈批评；严厉质询（尤指来自公众或媒体）。"},"examples":[{"en":"The policy faced daily hammerings in the press.","zh":"这项政策每天都遭到媒体的猛烈抨击。"},{"en":"During the hearing, the minister received hammerings from the opposition.","zh":"在听证会上，这位部长遭到反对党的严厉质询。"}]}],"synonyms":["pounding","battering","thrashing","drubbing","trouncing","shellacking","pummeling","beating","criticism","attack"],"phonetic":"/ˈhæmərɪŋ/","extraExplanation":["在英式与美式英语里，take a hammering 都很常见，既可指“被痛打/惨败”，也可指“（股价、名誉等）遭受重挫”。","注意 hammerings 在“敲打声/敲打动作”语境里常带有“持续、密集”的感觉，比如雨点般的敲击或不断的施工声。"],"etymology":"源自 hammer（锤子；用锤敲打）+ -ing（表示动作/过程），原义是“敲打的行为”；后来在英语里引申为“（被）重创、惨败、猛烈批评”。复数 hammerings 常表示“多次/一阵阵的敲打或打击”。","mnemonic":["联想“hammer=锤子（锤）”，hammering(s)=“一锤又一锤”，所以既是“连续敲打”，也像“被锤爆”→“惨败/被批得很惨”。","把 -ing 记成“正在进行的动作”，hammering(s) 就是“敲打这件事（成串发生）”。"]}
{"word":"hammerkop","summary":{"en":"A hammerkop is an African water bird with a hammer-shaped head, famous for its huge nests.","zh":"Hammerkop 指一种非洲水鸟，头形像锤子，以筑巨大鸟巢著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medium-sized African water bird (Scopus umbretta) known for its hammer-shaped head and for building very large nests near wetlands; also spelled “hamerkomp/hamerkop/hamer-kop” (most common: “hamerkop”).","zh":"（非洲）鹭形目的一种水鸟（Scopus umbretta），因头部形状像“锤子”而得名，常在湿地附近筑非常大的巢；也可拼作“hamerkop”（更常见）。"},"examples":[{"en":"We spotted a hammerkop wading along the edge of the marsh at dawn.","zh":"清晨我们看到一只 hammerkop 在沼泽边浅水处涉行。"},{"en":"The guide pointed out the hammerkop’s huge nest built high in the tree.","zh":"向导指给我们看 hammerkop 筑在树上的巨大鸟巢。"}]}],"synonyms":["hamerkop","Scopus umbretta"],"phonetic":"/ˈhɑmərˌkɑp/","extraExplanation":["“Hammerkop”是较少见的拼写；更常见的标准拼写是“hamerkop”。词源来自南非荷兰语/南非语“hamer”（锤子）+“kop”（头），意思就是“锤子头”。","这种鸟在非洲许多地区的民间传说里常被认为与“家宅、巢、好运或禁忌”有关（各地说法不同），旅行或自然纪录片里经常提到它们夸张的大巢。"]}
{"word":"hammerless","summary":{"en":"Hammerless usually describes a firearm with no external hammer (the hammer is internal/hidden).","zh":"hammerless通常指枪械“无外露击锤”（击锤内置或隐藏）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no external hammer (the striking part) on a firearm; the hammer is internal or hidden for a smoother, snag-free design.","zh":"（枪械）无外露击锤的；击锤在内部或隐藏，以便外形更平滑、不易勾住。"},"examples":[{"en":"He carries a hammerless revolver because it won’t snag on clothing.","zh":"他带的是无外露击锤的左轮手枪，因为不容易被衣服勾住。"},{"en":"Many modern pocket pistols are hammerless for safer, cleaner drawing.","zh":"许多现代口袋手枪采用无外露击锤设计，拔枪时更安全、更顺畅。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without a hammer or not requiring a hammer (used more generally, but less common than the firearm meaning).","zh":"无锤的；不需要锤子的（更一般性的用法，但不如枪械义常见）。"},"examples":[{"en":"The design uses a hammerless locking mechanism.","zh":"这种设计使用了无需锤子的锁定机构。"},{"en":"They demonstrated a hammerless tool that presses parts together instead of striking them.","zh":"他们展示了一种无锤工具，用压合代替敲击来装配零件。"}]}],"synonyms":["internal-hammer","concealed-hammer","shrouded-hammer"],"phonetic":"/ˈhæmərləs/","extraExplanation":["在英语里，hammerless最常见于枪械语境（如hammerless revolver/shotgun）。它通常强调“没有外露击锤（external hammer）”，并不一定表示完全没有击锤，而是击锤被内置（internal/hidden hammer）。","近义表达常见有“internal-hammer”“concealed-hammer”“shrouded hammer（部分遮蔽击锤）”。写作或新闻中用hammerless往往是在讲便于携带、不易挂住衣物（snag-free）、外形更流线等特点。"]}
{"word":"hammerlike","summary":{"en":"Hammerlike means “like a hammer,” especially in a heavy, pounding way.","zh":"hammerlike 指“像锤子一样”，尤其强调沉重、有力的敲击感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hammer in shape, hardness, or action; hitting in a heavy, pounding way.","zh":"像锤子一样的；在形状、硬度或作用上类似锤子；（打击、敲击）沉重而有力的。"},"examples":[{"en":"The medicine left me with a hammerlike headache.","zh":"那药让我头痛得像锤子敲一样。"},{"en":"He made a hammerlike motion with his fist on the door.","zh":"他用拳头做出像锤子一样的敲门动作。"},{"en":"The bird’s hammerlike beak can crack hard shells.","zh":"那种鸟像锤子一样的喙能敲开坚硬的外壳。"}]}],"synonyms":["pounding","heavy","hammering","forceful","hard-hitting"],"phonetic":"/ˈhæmɚˌlaɪk/","extraExplanation":["“hammerlike”由 hammer + like 构成，like 在这里表示“像……一样”，常用于形容词（如 childlike 天真如孩童、dreamlike 如梦一般）。它通常用来强调“沉重、猛烈、反复敲击”的感觉（比如 hammerlike pain/beat/knock）。"]}
{"word":"hammerlock","summary":{"en":"A hammerlock is a hold that twists someone’s arm behind their back to control them; it can also mean to apply that hold.","zh":"hammerlock 指把对方手臂反扭到背后以控制的锁技；也可作动词表示“用反扭臂锁控制”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wrestling or martial-arts hold in which someone’s arm is bent and forced behind their back to control or restrain them","zh":"（摔跤/武术中的）反扭臂锁；将对方手臂向后扭到背后的控制/制服动作"},"examples":[{"en":"The officer used a hammerlock to restrain the suspect without throwing punches.","zh":"警员用反扭臂锁制服嫌疑人，而不是挥拳。"},{"en":"In the match, she escaped the hammerlock by turning her shoulder and stepping out.","zh":"比赛中，她通过转肩并侧步脱出反扭臂锁。"}]},{"partOfSpeech":"v.","definition":{"en":"to hold or control someone by twisting their arm behind their back in a hammerlock","zh":"用反扭臂锁制住（某人）；把某人的手臂扭到背后控制"},"examples":[{"en":"He hammerlocked his opponent and pushed him toward the corner.","zh":"他用反扭臂锁控制对手，并把对手推向角落。"},{"en":"Security staff hammerlocked the man only after he refused to calm down.","zh":"保安人员在那名男子拒绝冷静后才用反扭臂锁将其控制。"}]}],"synonyms":["arm lock","wrist lock","nelson (related hold)","hold (general)"],"phonetic":"/ˈhæmɚˌlɑk/","extraExplanation":["这个词常见于职业摔跤（pro wrestling）解说、警务控制技术和一些武术/格斗语境。它强调的是“控制与限制动作”，不一定表示严重伤害，但现实中不当使用可能造成关节受伤。","构词上可理解为 hammer（像锤子一样用力/压制的感觉）+ lock（锁技、锁定关节的动作）；也有人把它视为一种固定搭配的技术名称。"]}
{"word":"hammerlocks","summary":{"en":"Hammerlock means a wrestling/martial-arts arm hold that twists an opponent’s arm behind their back; it can also mean a firearm hammer-related lock (rare).","zh":"Hammerlock 通常指摔跤/格斗中的“锁臂”（把对方手臂扭到背后控制）；也可指枪械中与击锤相关的锁定结构（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wrestling or martial-arts hold in which you twist someone’s arm behind their back to control them","zh":"（摔跤/格斗中的）“锁臂”（把对方手臂扭到背后以控制对方的一种擒拿动作）"},"examples":[{"en":"The wrestler caught him in a hammerlock and forced him to the mat.","zh":"摔跤手用锁臂制服了他，把他压到垫子上。"},{"en":"In self-defense class, we practiced escaping a hammerlock safely.","zh":"在防身课上，我们练习如何安全地摆脱锁臂。"}]},{"partOfSpeech":"n.","definition":{"en":"a locking mechanism in a firearm that involves the hammer (less common in everyday English)","zh":"（枪械中）与击锤有关的锁定/保险结构（较少用于日常英语）"},"examples":[{"en":"The manual warns not to tamper with the hammerlock mechanism.","zh":"说明书警告不要擅自改动击锤锁定结构。"}]}],"synonyms":["armlock","armbar (related)","wristlock (related)"],"phonetic":"/ˈhæmərˌlɑk/","extraExplanation":["“hammerlock”是由hammer（锤子）+ lock（锁）组成的复合词。用于摔跤/格斗时，含义来自“像用锤子一样把手臂压制住并锁住”的形象比喻。","你输入的“hammerlocks”是复数形式，表示多个锁臂动作，或在叙述中多次使用这种擒拿。"]}
{"word":"hammerman","summary":{"en":"A hammerman is mainly an old/rare term for a worker whose job involves heavy hammering (especially in metalworking), and it can also be a surname or nickname.","zh":"hammerman主要指（较旧/少见）以重锤敲打为工作核心的工人（尤指金属锻造），也可作姓氏或外号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker who uses a hammer as their main tool, especially in a forge (metalworking) or heavy industry (older/less common term).","zh":"以锤为主要工具的工人，尤指锻造（金属加工）或重工业中的锤工（较旧、较少见的说法）。"},"examples":[{"en":"In the old forge, the hammerman shaped the hot iron on the anvil.","zh":"在老式铁匠铺里，锤工在铁砧上把烧红的铁敲成形。"},{"en":"The factory hired a hammerman to help with heavy metal parts.","zh":"工厂雇了一名锤工来处理沉重的金属部件。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname or informal label for someone strongly associated with hammers (e.g., a “hammer” tool brand or nickname).","zh":"姓氏；或非正式称呼：与“锤子/用锤子的人”强相关的人（如工具品牌、外号）。"},"examples":[{"en":"His last name is Hammerman.","zh":"他的姓是 Hammerman。"},{"en":"They called her “Hammerman” because she was always fixing things with a hammer.","zh":"大家叫她“Hammerman”，因为她总是拿锤子修东西。"}]}],"synonyms":["blacksmith","metalworker","forger","striker"],"phonetic":"ˈhæmərmən","extraExplanation":["“hammerman”在现代日常英语里不常用；更常见的说法是“blacksmith（铁匠）”“metalworker（金属工）”或更具体的“power-hammer operator（动力锤操作工）”。","在较旧的工业/手工业语境中，“hammerman”可指负责锻打的工人，与“forgeman/striker（锻工/锤手）”等词义接近。"]}
{"word":"hammers","summary":{"en":"“Hammers” means either multiple hammers (tools) or “hits repeatedly” (he/she/it hammers).","zh":"“hammers”既可指多把锤子（名词复数），也可表示“反复用力敲打”（动词第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “hammer”: tools with a heavy head used for hitting nails or breaking things","zh":"“hammer”的复数：锤子；用来敲钉子或敲碎物体的工具"},"examples":[{"en":"The toolbox has three different hammers for different jobs.","zh":"工具箱里有三把不同的锤子，用于不同的工作。"},{"en":"Wear safety glasses when using hammers.","zh":"使用锤子时要戴护目镜。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “hammer”: to hit something repeatedly and strongly","zh":"“hammer”的第三人称单数：反复用力敲打；猛击"},"examples":[{"en":"He hammers the nail into the wood.","zh":"他把钉子用锤子敲进木头里。"},{"en":"The rain hammers the roof all night.","zh":"雨整夜敲打着屋顶。"},{"en":"She hammers on the door when no one answers.","zh":"没人回应时，她用力敲门。"}]}],"synonyms":["mallets","mauls","hits","pounds","beats"],"phonetic":"/ˈhæmərz/","extraExplanation":["“hammers”既可以是名词复数（很多把锤子），也可以是动词第三人称单数（he/she/it hammers）。通常看句子结构判断：前面有the/these/many等多为名词；前面是he/she/it等主语并跟宾语时多为动词。"]}
{"word":"hammerstone","summary":{"en":"A hammerstone is a stone used like a hammer, especially in prehistoric toolmaking.","zh":"hammerstone 指用作锤子的石头，常见于史前石器制作与考古语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stone used as a hammer, especially in early toolmaking to strike or shape other stones (for example, to make stone tools).","zh":"（尤指史前制工具用的）锤石；用作“锤子”的石头，用来敲击或修整其他石头（如打制石器）。"},"examples":[{"en":"Archaeologists found a hammerstone next to the flint flakes.","zh":"考古学家在燧石碎片旁发现了一块锤石。"},{"en":"A hammerstone can be used to chip pieces off a core stone.","zh":"锤石可以用来从石核上敲下石片。"}]}],"synonyms":["percussion stone","stone hammer"],"phonetic":"/ˈhæmərˌstoʊn/","extraExplanation":["“hammerstone”常出现在考古学与人类学语境中，属于早期“打制石器（knapping）”的基本工具之一：用较硬的石头敲击石核（core）产生石片（flake），进而制作切割或刮削工具。常见搭配：hammerstone tool（锤石工具）、stone knapping（打制石器）。","与之相关的概念包括：hard hammer（硬锤，通常指石锤）与 soft hammer（软锤，如鹿角或骨制锤，用于更精细的修整）。"]}
{"word":"hammertoe","summary":{"en":"Hammertoe is a toe deformity where the toe bends at the middle joint, often causing pain and shoe problems.","zh":"hammertoe 指脚趾在中间关节处弯曲的畸形（锤状趾），常引起疼痛和穿鞋不适。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A foot deformity in which one or more toes bend abnormally at the middle joint, often making the toe look like a small hammer; it can cause pain, corns, or difficulty wearing shoes.","zh":"锤状趾（脚趾畸形）：一个或多个脚趾在中间关节处异常弯曲，外形像小锤子；常会引起疼痛、鸡眼，或穿鞋困难。"},"examples":[{"en":"My doctor said my second toe is a hammertoe and suggested wider shoes.","zh":"医生说我的第二个脚趾是锤状趾，建议我穿更宽的鞋。"},{"en":"Hammertoes can rub against shoes and cause painful corns.","zh":"锤状趾容易和鞋子摩擦，导致疼痛的鸡眼。"}]}],"synonyms":["hammer toe"],"phonetic":"/ˈhæmərˌtoʊ/","extraExplanation":["在医学语境里也常写作 hammer toe（两词），复数是 hammertoes / hammer toes。","成因常见于穿过紧或高跟鞋、脚部结构与肌腱/肌肉失衡、遗传、关节炎等。轻度可用宽鞋、脚趾矫形垫/支具、拉伸与足底矫形器；严重时可能需要手术（具体需由医生评估）。","相关词：bunion（拇外翻）、corn（鸡眼）、callus（胼胝/老茧）、claw toe（爪形趾）、mallet toe（槌形趾，通常是末端关节弯曲）。"]}
{"word":"hammertoes","summary":{"en":"Hammertoes are toes that bend downward at the middle joint, often causing pain and rubbing in shoes.","zh":"hammertoes 指脚趾在中间关节处向下弯曲的“槌状趾”，常导致疼痛和鞋内摩擦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A foot deformity in which one or more toes bend downward at the middle joint, making the toe look like a hammer; it can cause pain or corns and may be worse with tight shoes.","zh":"槌状趾（槌形趾）：一种足部畸形，一根或多根脚趾在中间关节处向下弯曲，外形像小锤子；可能引起疼痛、鸡眼，穿紧鞋会加重。"},"examples":[{"en":"My doctor said the pain came from hammertoes and suggested wider shoes.","zh":"医生说我的疼痛是槌状趾引起的，并建议我换更宽的鞋。"},{"en":"High heels can make hammertoes worse over time.","zh":"长期穿高跟鞋可能会让槌状趾变得更严重。"},{"en":"She bought toe pads to reduce rubbing from her hammertoes.","zh":"她买了脚趾垫来减少槌状趾造成的摩擦。"}]}],"synonyms":["hammertoe (singular)","claw toe (related, not identical)","toe deformity"],"phonetic":"/ˈhæmərˌtoʊz/","extraExplanation":["“Hammertoes”通常用复数，因为很多人不止一根脚趾受影响；单数是“hammertoe”。","日常语境中常和“bunions（拇外翻）”“corns/calluses（鸡眼/老茧）”一起出现。若在医学或就诊场景，可说：I have a hammertoe on my second toe（我的第二脚趾有槌状趾）。"]}
{"word":"hammerwise","summary":{"en":"Hammerwise is a rare adverb meaning “like a hammer” or “by hammering,” and in technical contexts it can mean “in relation to the hammer (part) of a mechanism.”","zh":"Hammerwise 是较少见的副词，表示“像锤子一样/以锤击的方式”；在技术语境中也可指“就机构的击锤（部位）而言”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a manner like a hammer; by hammering or with a hammering motion","zh":"像锤子一样；以敲打/锤击的方式"},"examples":[{"en":"The metal was driven hammerwise into the mold.","zh":"金属被以锤击的方式打入模具中。"},{"en":"He struck the stake hammerwise until it was firm in the ground.","zh":"他用锤击的方式敲打木桩，直到牢牢钉进地里。"}]},{"partOfSpeech":"adv.","definition":{"en":"(technical/rare) with respect to the hammer part of a tool or mechanism (such as a gun or lock)","zh":"（技术/罕见）就“击锤/锤头”部位而言；朝向或关于击锤的一侧"},"examples":[{"en":"Keep the mechanism oriented hammerwise to avoid snagging.","zh":"把机构按击锤侧方向摆放，以免挂住。"}]}],"synonyms":["by hammering","with a hammer","in a hammering motion","hammerlike"],"phonetic":"/ˈhæmərˌwaɪz/","extraExplanation":["“-wise”是英语里常见的后缀，意思大致是“以……方式/就……而言”（如: clockwise 顺时针地, lengthwise 纵向地）。因此 hammerwise 多用于描述动作或方向，带一点“像锤子那样”或“就锤/击锤部分而言”的味道。","hammerwise 在现代日常英语中非常少见，更常用的替代表达包括: “with a hammer,” “by hammering,” “in a hammering motion,” 或形容词 “hammerlike”。"]}
{"word":"hammerwork","summary":{"en":"Hammerwork means work done by hammering, especially shaping or decorating metal, or the hammered texture itself.","zh":"hammerwork 指用锤敲打完成的工作，尤指金属的锤制成形/装饰工艺，也可指锤纹质感本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"work done with a hammer, especially shaping metal by hammering; hammered metalwork or the hammered surface/texture.","zh":"用锤子完成的工作，尤指通过敲打来塑形金属；也可指锤制的金属工艺品或其锤纹表面。"},"examples":[{"en":"The blacksmith’s hammerwork turned a flat sheet of iron into a curved blade.","zh":"铁匠的锤制把一张平铁片敲打成了一把弯曲的刀刃。"},{"en":"You can see fine hammerwork on the copper bowl—each mark catches the light.","zh":"你能在这个铜碗上看到精细的锤纹工艺——每一道锤痕都能反光。"}]}],"synonyms":["metalwork","hammering","forging","smithing","hammered finish"],"phonetic":"/ˈhæmərˌwɝk/","extraExplanation":["“hammerwork”多见于工艺、博物馆说明或艺术品描述中，常与金属加工相关，如铜器、银器的“锤纹（hammered finish）”。在日常口语里更常说“metalwork / hammered metalwork / hammering work”。"]}
{"word":"hammerwort","summary":{"en":"Hammerwort is a rare old plant name; the exact plant can vary by region/source.","zh":"Hammerwort 是罕见的旧式植物/草药名；具体指哪种植物会因地区与资料而异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A herb or wild plant name used in older English, referring in different regions to plants such as ironwort (Sideritis) or related medicinal “-worts.”","zh":"（罕见）旧英语里对某些草药/野生植物的俗称，不同地区可能指铁草属（ironwort，Sideritis）等类似的“—wort（药草）”植物。"},"examples":[{"en":"In some old herbals, “hammerwort” is listed among medicinal plants.","zh":"在一些旧式草药书里，“hammerwort”被列为药用植物之一。"},{"en":"The name hammerwort is uncommon today, and it may refer to different species depending on the source.","zh":"“hammerwort”如今很少见，而且不同资料里可能指不同物种。"}]}],"synonyms":["ironwort","woundwort","herb (general)"],"phonetic":"/ˈhæmərˌwɝt/","extraExplanation":["“-wort”是古英语来源的词素，意思是“草药、植物”（如 St. John’s wort 贯叶连翘）。因此很多“X-wort”在历史上是民间草药名，但具体对应哪一种植物常因地区与文献而不同。","如果你是在小说/游戏/奇幻设定中看到 hammerwort，它也可能是作者自造的“草药名”，借用“-wort”的传统来营造中古/草药学氛围。"]}
{"word":"hammier","summary":{"en":"“Hammier” means more overly theatrical or exaggerated (usually about acting or behavior).","zh":"“hammier”表示更夸张、更戏剧化（多用于评价表演或行为方式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(comparative of hammy) more exaggerated, overly theatrical, or melodramatic (often in acting, speaking, or gestures).","zh":"（hammy 的比较级）更夸张的、更戏剧化的、（常带贬义）更做作/更煽情的（多指表演、说话或动作）。"},"examples":[{"en":"His jokes were even hammier than usual, but the audience loved them.","zh":"他的笑话比平时更夸张，不过观众很买账。"},{"en":"The sequel is fun, but the acting is hammier and less believable.","zh":"续集很好玩，但表演更做作，可信度也更低。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) more like ham (the meat) in taste or smell.","zh":"（较少见）更像火腿（肉）的味道或气味。"},"examples":[{"en":"This soup tastes hammier after adding the smoked bacon.","zh":"加了烟熏培根后，这汤尝起来更有火腿味了。"}]}],"synonyms":["more theatrical","more exaggerated","more melodramatic","more over-the-top","more campy"],"phonetic":"/ˈhæmiər/","extraExplanation":["“hammy”最常见的用法来自“ham actor”（夸张做作的演员），所以“hammier”多用来评价表演或表达方式：夸张到有点假、但有时也可能是刻意搞笑或很有娱乐效果。","拼写上：hammy → hammier（y 变 i 再加 -er），类似 happy → happier。"]}
{"word":"hammiest","summary":{"en":"Hammiest means the most overly dramatic or exaggerated (often in an amusing, cheesy way).","zh":"hammiest 指“最夸张、最戏剧化的”，常形容表演或行为“用力过猛”、有点尬但可能好笑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most exaggerated or over-the-top in acting or behavior; very theatrical in a way that can feel silly or cheesy.","zh":"最夸张、最做作的（表演或行为）；非常戏剧化，往往显得滑稽或“尬”。"},"examples":[{"en":"That was the hammiest performance in the whole play—everyone could tell he was overacting.","zh":"那是整部戏里最夸张的表演——大家都看得出他在过度表演。"},{"en":"She gave the hammiest wink to the camera, like a cartoon character.","zh":"她对着镜头眨了一个特别夸张的眼睛，像卡通人物一样。"}]}],"synonyms":["most over-the-top","most exaggerated","most theatrical","cheesiest","most melodramatic"],"phonetic":"/ˈhæmiɪst/","extraExplanation":["“hammy/ham”常用来形容演员“用力过猛”的表演风格，带点调侃但不一定很刻薄。它来自戏剧圈的口语用法；“to ham it up”表示“故意夸张、卖力做戏”。","日常里也能形容讲话或反应很“戏多”的人（不一定真的在演戏）。语气通常偏口语、轻微吐槽。"]}
{"word":"hammily","summary":{"en":"“Hammily” is not standard English; it’s usually a misspelling of “happily.”","zh":"“hammily”不是标准英语词；通常是把“happily”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “happily” (meaning “in a happy way”).","zh":"不是标准英语单词；最常见是把 “happily”（意为“快乐地/幸福地”）拼错了。"},"examples":[{"en":"I think you meant “happily”: “They lived happily ever after.”","zh":"你可能想写的是 “happily”：“They lived happily ever after.”（他们从此幸福地生活在一起。）"},{"en":"If you wrote “hammily” in an essay, a teacher would usually mark it as a spelling mistake.","zh":"如果你在作文里写 “hammily”，老师通常会把它当作拼写错误。"}]}],"synonyms":["happily (likely intended)"],"phonetic":"ˈhæməli","extraExplanation":["“hammily”在常见词典中一般查不到；如果你是从某段文字或歌词里看到的，也可能是专有名词（人名/网名/地名）或创意拼写。你可以把原句发我，我能根据上下文判断你要表达的是 “happily”、还是别的词（如 “hamlet”/“hammock”等）。"]}
{"word":"hamminess","summary":{"en":"Hamminess means exaggerated, theatrical acting or behavior.","zh":"Hamminess 指夸张、戏剧化、略显做作的表演或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of acting or behaving in an exaggerated, theatrical, or overly emotional way (often meant to be funny, but sometimes seen as annoying)","zh":"（表演或行为）夸张、做作、戏剧化的特质（常带搞笑效果，但有时也让人觉得烦）"},"examples":[{"en":"The movie is entertaining, but the hamminess can feel a bit too much.","zh":"这部电影挺好看，但那种夸张做作的表演有时会让人觉得有点过头。"},{"en":"He leaned into the hamminess during the speech to make the audience laugh.","zh":"他在演讲时故意更夸张一点来逗观众笑。"},{"en":"Some fans love the show’s hamminess; others prefer a more realistic style.","zh":"有些粉丝很喜欢这部剧的夸张风格；也有人更喜欢写实一点的。"}]}],"synonyms":["overacting","theatricality","campiness","corniness"],"phonetic":"/ˈhæminəs/","extraExplanation":["“hamminess”来自形容词“hammy”（表演过度、很戏剧化）。而“ham”（蹩脚演员）最早是舞台俚语，常被认为与“ham-fatter”（19世纪对低水平演员的戏称）有关。如今这个词多用于评价表演风格：可以是可爱的“夸张喜剧感”，也可能是负面的“做作”。"]}
{"word":"hamming","summary":{"en":"“Hamming” most often means acting in an exaggerated, showy way; in tech contexts it can describe concepts like Hamming distance/code.","zh":"“hamming”常指表演或言行夸张做作；在技术语境中也可指与汉明距离/汉明码等概念相关。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"acting or speaking in an exaggerated, overly dramatic way (often to be funny or to get attention); “hamming it up.”","zh":"表演或说话夸张、做作（常为搞笑或博关注）；“ham it up（演得很夸张）”。"},"examples":[{"en":"He was hamming it up for the camera during the interview.","zh":"他在采访时对着镜头演得很夸张。"},{"en":"Stop hamming—just tell us what really happened.","zh":"别装了/别演了——直接告诉我们到底发生了什么。"}]},{"partOfSpeech":"adj.","definition":{"en":"(computing/math) relating to methods named after Richard Hamming, such as Hamming distance or Hamming code.","zh":"（计算机/数学）与“汉明”相关的概念，如汉明距离（Hamming distance）或汉明码（Hamming code）。"},"examples":[{"en":"We used Hamming distance to compare two strings.","zh":"我们用汉明距离来比较两个字符串。"},{"en":"Hamming codes can help detect and correct small errors in data.","zh":"汉明码可以帮助检测并纠正数据中的小错误。"}]}],"synonyms":["overacting","playing it up","showboating","grandstanding"],"phonetic":"/ˈhæmɪŋ/","extraExplanation":["“Hamming”在技术语境中通常来自美国数学家/计算机科学家 Richard Hamming（理查德·汉明）。他提出的“汉明码”用于差错检测与纠错；“汉明距离”表示两个等长字符串在对应位置上不同字符的个数，常用于编码理论、信息检索与机器学习等。"]}
{"word":"hammochrysos","summary":{"en":"“hammochrysos” is not a common English word; it is most likely a rare scientific/taxonomic name or a misspelling.","zh":"“hammochrysos”不是常见英语词，更可能是罕见的科学/分类学名称或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or specialized word; not found in general English dictionaries. It is most likely a scientific (Latin/Greek-style) name used in taxonomy (for example, a genus or species name) rather than an everyday English word.","zh":"一个非常罕见、偏专业的词；在常见英语词典中通常查不到。它更可能是分类学中使用的拉丁/希腊化“学名”（例如属名或种名），而不是日常英语词汇。"},"examples":[{"en":"I couldn’t find “hammochrysos” in standard dictionaries, but it may appear in a biological name list.","zh":"我在常见词典里找不到“hammochrysos”，但它可能出现在生物学命名/名录中。"},{"en":"If you saw it in a paper, check whether it was capitalized (e.g., Hammochrysos), which often signals a genus name.","zh":"如果你是在论文里看到的，建议看看是否首字母大写（如 Hammochrysos）；首字母大写常提示这是属名。"}]}],"phonetic":"ˌhæmoʊˈkraɪsoʊs","extraExplanation":["从词形上看，它可能由希腊语词根构成：hammo-/hammo- 常与“沙（sand）”相关，chryso- 常与“金（gold）”相关。因此它在字面上可能带有“金色的沙/与沙和金相关”的意象，但这并不等于它在现实中有固定英语释义。","如果你能提供看到它的句子、学科领域（昆虫/植物/地质/化学等）、或原文截图，我可以更准确判断它是不是某个学名、术语，或是拼写误差（例如把相近的词拼错了）。"]}
{"word":"hammock","summary":{"en":"A hammock is a hanging, swinging bed for resting, usually tied between two supports; it can also mean to relax in one.","zh":"hammock 指“吊床”，是系在两端支撑物上用来休息的悬挂式床；也可作动词表示“在吊床里放松/悬挂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A swinging bed made of cloth or netting, hung from two supports (like trees or posts), used for resting or sleeping.","zh":"吊床：用布或网做成、两端系在支撑物（如树或柱子）上的摇摆式床，用来休息或睡觉。"},"examples":[{"en":"We hung a hammock between two palm trees and took a nap.","zh":"我们把吊床挂在两棵棕榈树之间，小睡了一会儿。"},{"en":"A hammock is great for reading outside on a warm day.","zh":"天气暖和的时候，在户外躺吊床读书很舒服。"}]},{"partOfSpeech":"v.","definition":{"en":"To rest or relax in a hammock (or to hang like one).","zh":"（在吊床里）休息、躺着放松；（像吊床一样）悬挂。"},"examples":[{"en":"After lunch, he likes to hammock in the backyard.","zh":"午饭后，他喜欢在后院的吊床里躺着放松。"},{"en":"Ferns hammocked between the rocks in the shaded corner.","zh":"蕨类植物在阴凉角落的岩石之间像吊床一样悬着。"}]}],"synonyms":["swinging bed","hanging bed"],"phonetic":"/ˈhæmək/","extraExplanation":["“hammock”一词源自加勒比地区原住民语言（常说来自泰诺语系），最初指一种便携、离地的睡具；在热带地区常见，因为离地更通风、也能减少虫蛇等影响。","在英语里更常用作名词；作动词时偏口语或文学描写，表示“在吊床里休息/像吊床一样悬着”。"]}
{"word":"hammock-like","summary":{"en":"curved or sagging in the middle, like a hanging bed","zh":"呈吊床般弧形下垂的（中间低、两侧高）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a hammock: hanging or sagging in a curve, with the middle lower than the sides.","zh":"像吊床一样的：呈悬挂或下垂弧形的，中间低、两侧高。"},"examples":[{"en":"The hammock-like net caught the balls without letting them roll away.","zh":"这个像吊床一样的网兜把球接住了，不会滚走。"},{"en":"She sat in a hammock-like chair that gently dipped in the center.","zh":"她坐在一把像吊床一样的椅子上，中间轻轻下陷。"},{"en":"The bridge formed a hammock-like curve between the two supports.","zh":"这座桥在两端支撑之间形成了吊床般的弧度。"}]}],"synonyms":["sagging","hanging","slung","cradled","catenary"],"phonetic":"/ˈhæmək laɪk/","etymology":"由“hammock（吊床）+ -like（像……一样的）”构成的复合形容词；-like 用来表示外形或特征相似。","mnemonic":["记法：hammock=吊床，-like=像……一样的 → “像吊床一样的弧形/下垂”。","联想：看到“中间下陷、两边较高”的形状，就想到人躺在吊床里的弧度。"]}
{"word":"hammock-weaver","summary":{"en":"a bird famous for weaving hanging, hammock-like nests; rarely, a hammock maker","zh":"以编织吊床状悬垂鸟巢著称的鸟；少见时也指编吊床的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bird (especially in tropical America) known for weaving a long, hanging, hammock-like nest from fibers","zh":"（尤指美洲热带地区的）一种鸟，因会用纤维编织出像吊床一样下垂的长巢而得名"},"examples":[{"en":"We watched a hammock-weaver building a long nest that swung in the wind.","zh":"我们看见一只“吊床织鸟”在筑一个很长的巢，随风摇摆。"},{"en":"The hammock-weaver’s nest hangs from the tip of a branch to keep predators away.","zh":"“吊床织鸟”的巢挂在树枝末端，以避免捕食者靠近。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who weaves hammocks (a rare, literal use)","zh":"编织吊床的人（较少见、字面用法）"},"examples":[{"en":"In the village market, a hammock-weaver demonstrated how to braid the rope.","zh":"在村里的集市上，一位编吊床的人演示了如何编绳。"}]}],"synonyms":["weaverbird","nest-weaver"],"phonetic":"/ˈhæmək ˌwiːvər/","extraExplanation":["在自然写作里，hammock-weaver 多用作俗名，强调“会编织、会做悬垂巢”的特征；不同地区/资料可能对应到不同的具体鸟种或群体，因此更像描述性名称而非严格的单一物种学名。","这种“悬垂巢”常被认为有防护作用：挂在细长枝条末端、更难被蛇或其他捕食者接近。"],"etymology":"复合词：hammock（吊床）+ weaver（织工/会编织的动物）。最常见的指称来自其“像吊床一样的悬垂巢”的形象命名。","mnemonic":["把它拆开记：hammock=吊床，weaver=织/编的人或动物 → “会编吊床的（鸟）”。","联想画面：树枝上挂着“吊床”一样的鸟巢，里面住着小鸟。"]}
{"word":"hammocklike","summary":{"en":"An adjective meaning “like a hammock,” especially curved and sagging between two supports.","zh":"形容词，表示“像吊床一样的”，尤指在两点支撑间呈弧形下垂或托举的样子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hammock in shape or in the way it hangs—curved and gently sagging between two points.","zh":"像吊床的；形状或悬挂方式类似吊床——在两点之间呈弧形、轻微下垂。"},"examples":[{"en":"The hammocklike netting cradled the fruit so it wouldn’t bruise.","zh":"像吊床一样的网兜托住水果，防止它被磕伤。"},{"en":"A hammocklike curve formed in the old rope as it stretched between the posts.","zh":"旧绳子在两根柱子之间被拉开后形成了吊床般的弧度。"}]}],"synonyms":["sagging","curved","suspended","hanging"],"phonetic":"/ˈhæməkˌlaɪk/","extraExplanation":["构词法：hammock + -like（“像……一样的”）。英语里“-like”常用来把名词变成形容词，表示外形、感觉或特征相似，如 childlike（孩子般的）、cloudlike（云一般的）。","用法提示：hammocklike 多用于描写“下垂的弧线/托举的结构”，可形容网、布、绳子、叶片、甚至地形（如 hammocklike depression“吊床状凹地”）。","拼写习惯：常见两种写法 hammocklike 和 hammock-like；两者意思相同，带连字符的形式在正式写作中也常见。"]}
{"word":"hammocks","summary":{"en":"Hammocks are hanging beds for relaxing or sleeping; the word can also be used as a verb meaning to rest in a hammock.","zh":"hammock 指“吊床”，用于休息或睡觉；也可作动词，表示“躺在吊床上放松/休息”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hanging bed made of cloth, rope, or netting, supported at both ends (often between two trees), used for relaxing or sleeping.","zh":"吊床：用布、绳或网编成，两端悬挂（常系在两棵树之间），用于休息或睡觉。"},"examples":[{"en":"We hung a hammock between two palm trees and took a nap.","zh":"我们把吊床挂在两棵棕榈树之间，小睡了一会儿。"},{"en":"She likes reading in a hammock on summer evenings.","zh":"她喜欢在夏天傍晚躺在吊床上看书。"}]},{"partOfSpeech":"v.","definition":{"en":"To relax or lie in a hammock.","zh":"（躺）在吊床上休息；用吊床休闲。"},"examples":[{"en":"After hiking, we hammocked by the lake for an hour.","zh":"徒步之后，我们在湖边躺吊床休息了一个小时。"},{"en":"They plan to hammock all afternoon in the shade.","zh":"他们打算整个下午都在树荫下躺吊床放松。"}]}],"synonyms":["swinging bed","hanging bed"],"phonetic":"/ˈhæmək/","extraExplanation":["“hammock”一词来自美洲原住民语言（如泰诺语）中表示“网状床”的词，后来被西班牙语/英语吸收，因此常与热带、航海和户外文化联系在一起。","在户外圈里，“to hammock”很常见，尤其指露营时用吊床（有时还会配合防蚊网和防雨布 tarps）代替帐篷睡觉。"]}
{"word":"Hammurabi","summary":{"en":"Hammurabi was an ancient Babylonian king best known for the Code of Hammurabi, an early written law code.","zh":"汉谟拉比是古巴比伦国王，以《汉谟拉比法典》这一早期成文法闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A king of ancient Babylon (reigned c. 1792–1750 BCE), famous for creating the Code of Hammurabi—one of the earliest known written law codes.","zh":"古巴比伦国王（约公元前1792–1750年在位），以制定《汉谟拉比法典》闻名——这是已知最早的成文法之一。"},"examples":[{"en":"Hammurabi is best known for the Code of Hammurabi.","zh":"汉谟拉比最著名的是《汉谟拉比法典》。"},{"en":"In world history class, we learned how Hammurabi ruled Babylon and used written laws to govern.","zh":"在世界历史课上，我们学到汉谟拉比如何统治巴比伦，并用成文法律来治理国家。"}]}],"synonyms":["Code of Hammurabi","Babylonian king","ancient Mesopotamia"],"phonetic":"ˌhɑməˈrɑbi","extraExplanation":["“Hammurabi”常出现在历史与法律相关语境中，尤其与“Code of Hammurabi（汉谟拉比法典）”连用。法典刻在石碑上，包含关于财产、贸易、婚姻、伤害赔偿等条文，反映了当时社会等级与司法观念。","在英语写作中，他的名字有时被用作“早期法律/成文法”的代表性人物，用来对比现代法治观念（如程序正义、平等原则等）。"]}
{"word":"hammy","summary":{"en":"“Hammy” describes exaggerated, theatrical acting or speaking; it can also mean a performer who overacts.","zh":"“hammy”指表演或表达夸张做作、很戏剧化；也可指爱夸张表演的演员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overacting in a way that feels exaggerated, theatrical, or not very natural.","zh":"（表演或说话）夸张做作的；过度戏剧化的，不自然的。"},"examples":[{"en":"His acting in the commercial was a bit hammy, but it was funny.","zh":"他在广告里的表演有点夸张做作，但挺好笑的。"},{"en":"Try not to sound so hammy when you give the presentation.","zh":"你做演讲时尽量别讲得那么戏剧化、做作。"}]},{"partOfSpeech":"n.","definition":{"en":"A performer (or performance style) that relies on exaggerated acting.","zh":"靠夸张表演取胜的演员；或指夸张的表演风格。"},"examples":[{"en":"In old movies, he was known as a lovable ham.","zh":"在老电影里，他以讨喜但夸张的“戏精型”演员形象出名。"},{"en":"The show needs a ham to keep the audience laughing.","zh":"这个节目需要一个夸张搞笑的演员来逗观众笑。"}]}],"synonyms":["over-the-top","theatrical","exaggerated","campy","cheesy"],"phonetic":"/ˈhæmi/","extraExplanation":["“hammy”来自“ham”（在戏剧圈里指表演夸张的演员），与食物“火腿”无关。常带轻微贬义（做作、太用力），但在喜剧或故意夸张的风格里也可能是中性或略带称赞的。","常见搭配：hammy acting（夸张表演）、hammy joke（很“戏剧化”的玩笑）、a bit/too hammy（有点/太夸张）。相近词：over-the-top（过火的）、theatrical（戏剧化的）；更直接的批评：cheesy（俗套肉麻的）。"]}
{"word":"hamor","summary":{"en":"Hamor is best known as a biblical proper name: the father of Shechem in Genesis.","zh":"Hamor 最常见的用法是《圣经·创世记》中的人名：示剑的父亲哈抹。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A man in the Hebrew Bible (Book of Genesis), the Hivite leader of Shechem and the father of Shechem.","zh":"（专有名词）《希伯来圣经/创世记》中的人物：希未人首领哈抹（Hamor），示剑（Shechem）的父亲。"},"examples":[{"en":"In Genesis, Hamor negotiates with Jacob’s family after Shechem wants to marry Dinah.","zh":"在《创世记》中，示剑想娶底拿后，哈抹与雅各一家进行谈判。"},{"en":"Hamor and his son Shechem are central figures in the story of Dinah.","zh":"哈抹和他的儿子示剑是“底拿事件”故事中的关键人物。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"ˈheɪmɔr","extraExplanation":["“Hamor”主要作为《圣经》人物名出现，中文常译作“哈抹”。相关章节多见于《创世记》34章：底拿被示剑羞辱后，示剑与其父哈抹提出通婚与结盟；故事后来发展为雅各的儿子们以“受割礼”为条件设局报复。","如果你本来想查的是“hammer（锤子）”或“humor（幽默）”，告诉我上下文/句子，我可以帮你确认正确拼写并解释用法。"]}
{"word":"hamose","summary":{"en":"“Hamose” is not standard English; it’s usually a misspelling (often of “hammock”) or a proper name.","zh":"“hamose”不是标准英语词，通常是拼写错误（常见为“hammock 吊床”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a misspelling of another word (commonly “hammock”) or a proper name in specific contexts.","zh":"不是标准英语单词。它多半是其他词的拼写错误（最常见是“hammock 吊床”），或在特定语境中作为专有名词使用。"},"examples":[{"en":"I couldn’t find “hamose” in the dictionary—did you mean “hammock”?","zh":"我在词典里找不到“hamose”——你是不是想写“hammock（吊床）”？"},{"en":"Please check the spelling of “hamose” in your notes.","zh":"请检查你笔记里“hamose”的拼写。"}]}],"phonetic":"/həˈmoʊz/","extraExplanation":["“hamose”在常见英语词典中通常查不到，因此更像是拼写误写。最常见的目标词是：\n1) hammock /ˈhæmək/（吊床）：例如“lie in a hammock”。\n如果你告诉我原句（你在哪里看到/想表达什么），我可以帮你确定最可能的正确词并给出更准确的释义与例句。"]}
{"word":"HaMotzi","summary":{"en":"the Jewish blessing said before eating bread","zh":"吃面包前的犹太祝祷"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish blessing (berakhah) said before eating bread, traditionally beginning with the Hebrew words meaning “who brings forth bread from the earth.”","zh":"犹太教在吃面包前诵读的祝福祷词（祝祷），开头的希伯来语意思大致为“使面包从大地生出者”。"},"examples":[{"en":"We washed our hands, then someone recited HaMotzi before the meal.","zh":"我们洗了手，然后有人在开饭前念了 HaMotzi。"},{"en":"At Shabbat dinner, HaMotzi is usually said over two loaves of challah.","zh":"在安息日晚餐上，HaMotzi 通常对着两条哈拉面包来念。"}]},{"partOfSpeech":"phrase","definition":{"en":"By extension, the bread blessing as a short cue or instruction (e.g., “Say HaMotzi”), especially in Jewish communal meals.","zh":"引申用法：作为一句提示/指令来指“念面包祝福”（例如“念 HaMotzi”），常见于犹太社群聚餐语境。"},"examples":[{"en":"Before we eat, let’s do HaMotzi.","zh":"开吃前，我们先念 HaMotzi 吧。"},{"en":"The host reminded everyone: HaMotzi first, then we’ll start serving.","zh":"主人提醒大家：先念 HaMotzi，再开始上菜。"}]}],"synonyms":["bread blessing","blessing over bread","motzi"],"phonetic":"/hɑˈmoʊtsi/","extraExplanation":["在许多传统中，念 HaMotzi 前会先“净手”（ritual handwashing），念完后才切/撕面包并分给大家。","安息日（Shabbat）晚餐常用两条面包（challah）来配合 HaMotzi；部分节期与习俗也有不同做法。","英文写法常见变体：hamotzi, ha-motzi, HaMotzi；大小写与连字符多取决于个人与社群习惯。"],"etymology":"来自希伯来语短语“ha-motzi lechem min ha-aretz”（意为“使面包从大地生出者”），在英语中常用音译写作 HaMotzi/hamotzi，并用来指代整段面包祝福。","mnemonic":["把 HaMotzi 想成“哈—抹—吃”：先“哈”一下开口祷告，再“抹/摸”面包，最后才“吃”。（用来记：这是吃面包前的祝福）","联想词根：motzi ≈ “to bring out/bring forth（带出、带来）”，对应“bring forth bread”。"]}
{"word":"hamotzi","summary":{"en":"Hamotzi is the Jewish blessing said over bread before eating, often at Shabbat or festive meals.","zh":"Hamotzi 指犹太教中饭前为面包所念的祝福，常见于安息日或节庆餐桌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) The blessing said over bread before eating, beginning with the words “HaMotzi lechem min ha’aretz” (“Who brings forth bread from the earth”). It may also refer to the prayer itself or to the act of reciting it.","zh":"（犹太教）饭前为面包所念的祝福语，开头为“HaMotzi lechem min ha’aretz”（意为“使面包从大地生出者”）。也可指这段祝福本身或“念哈莫齐祝福”的行为。"},"examples":[{"en":"Before we ate, they recited hamotzi and shared the challah.","zh":"开饭前，他们先念了哈莫齐祝福，然后分着吃哈拉面包。"},{"en":"At Shabbat dinner, someone usually leads hamotzi for everyone at the table.","zh":"在安息日晚餐时，通常会由一位带领大家一起念哈莫齐祝福。"}]}],"synonyms":["HaMotzi","ha-motzi","the bread blessing"],"phonetic":"/hɑˈmoʊtsi/","extraExplanation":["“Hamotzi”常见于英语转写（也写作ha-motzi、hamotzi）。它来自希伯来语“הַמּוֹצִיא”（ha-motzi），字面是“那位带出/带来者”。在犹太餐桌礼仪中，面包被视为重要的食物，因此会在吃面包前先念这一祝福。","这句完整祝福通常是：\"Baruch atah Adonai, Eloheinu Melech ha’olam, hamotzi lechem min ha’aretz.\" 在不同社群中读音和转写可能略有差异（如Ashkenazi与Sephardi传统）。"]}
{"word":"hamous","summary":{"en":"“Hamous” is usually a misspelling of “hummus,” a chickpea-based Middle Eastern dip or spread.","zh":"“hamous”通常是“hummus”的误拼，指以鹰嘴豆为主的中东蘸酱/抹酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly written as “hummus”) A thick, creamy Middle Eastern dip or spread made mainly from mashed chickpeas, tahini (sesame paste), lemon juice, garlic, and olive oil.","zh":"（通常拼作“hummus”）一种中东常见的浓稠蘸酱/抹酱，主要由鹰嘴豆泥、芝麻酱（tahini）、柠檬汁、大蒜和橄榄油制成。"},"examples":[{"en":"We bought hummus and pita bread for a quick snack.","zh":"我们买了鹰嘴豆泥和皮塔饼，当作快速小吃。"},{"en":"She spread hummus on toast instead of butter.","zh":"她用鹰嘴豆泥抹吐司，代替黄油。"},{"en":"This hummus is spicy because it has extra chili.","zh":"这款鹰嘴豆泥很辣，因为加了更多辣椒。"}]}],"synonyms":["hummus","chickpea dip","chickpea spread"],"phonetic":"/ˈhʊməs/","extraExplanation":["“hamous”通常是对“hummus”的误拼或音译写法；英语里最常见、也最标准的拼法是 hummus。","hummus 源自阿拉伯语，字面意思与“鹰嘴豆”有关。很多英语菜单或超市包装上会看到多种口味，如 roasted red pepper hummus（烤红椒味）、garlic hummus（蒜味）。"]}
{"word":"hamper","summary":{"en":"Hamper can mean a large basket (especially for laundry or food) or the verb meaning “to hinder/obstruct.”","zh":"hamper 既可指（洗衣/野餐等）大篮子，也可作动词表示“阻碍、妨碍”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large basket, often used for laundry or for carrying food (like a picnic basket).","zh":"（通常较大的）篮子；（常指）洗衣篮；野餐篮。"},"examples":[{"en":"He tossed the dirty clothes into the laundry hamper.","zh":"他把脏衣服扔进了洗衣篮。"},{"en":"They packed a picnic hamper with sandwiches and fruit.","zh":"他们把三明治和水果装进野餐篮。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something difficult to do; to hinder or slow progress.","zh":"妨碍；阻碍；使进展变慢。"},"examples":[{"en":"Heavy rain can hamper rescue efforts.","zh":"大雨会妨碍救援行动。"},{"en":"Lack of funding hampered the project.","zh":"资金不足阻碍了这个项目。"}]}],"synonyms":["hinder","impede","obstruct","basket"],"phonetic":"/ˈhæmpɚ/","extraExplanation":["易混点：名词 hamper（篮子）和动词 hamper（阻碍）拼写相同，但含义完全不同，要靠语境判断。","常见搭配：hamper progress/efforts/growth（阻碍进展/努力/增长）；a laundry hamper（洗衣篮）；a picnic hamper（野餐篮）。","在英式英语里，hamper 也常指装满食物的“礼篮/节日礼篮”（如 Christmas hamper）。"]}
{"word":"hampered","summary":{"en":"Hampered means hindered or made more difficult; it’s also the past form of “hamper.”","zh":"hampered 表示“受阻、被妨碍的”，也是动词 hamper 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Made difficult or slowed because something is getting in the way; hindered.","zh":"（形容词）因有阻碍而变得困难或变慢的；受妨碍的。"},"examples":[{"en":"Progress was hampered by a lack of funding.","zh":"由于缺乏资金，进展受到了阻碍。"},{"en":"Her ability to travel was hampered by a knee injury.","zh":"膝盖受伤妨碍了她的出行能力。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Past tense/past participle of “hamper”: to hinder, restrict, or hold back.","zh":"（动词）“hamper”的过去式/过去分词：妨碍；限制；阻止。"},"examples":[{"en":"Heavy traffic hampered our efforts to arrive on time.","zh":"交通拥堵妨碍了我们准时到达。"},{"en":"The new rule hampered small businesses at first.","zh":"这项新规定起初限制了小企业的发展。"}]}],"synonyms":["hindered","impeded","obstructed","restricted","held back"],"phonetic":"/ˈhæmpɚd/","extraExplanation":["“hamper”原意与“阻碍、缠住”有关，现代英语中常用在较正式的语境里，表示某事让计划、进度或能力“受阻”。常见搭配：be hampered by…（被……所妨碍）；hamper efforts/progress/growth（妨碍努力/进展/增长）。"]}
{"word":"hamperedly","summary":{"en":"“Hamperedly” means “in a hindered or restricted way,” but it is rare in modern everyday English.","zh":"“hamperedly”意为“以受阻或受限制的方式”，但在现代日常英语中较少使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is hindered, slowed down, or made difficult; with obstacles or restrictions.","zh":"以受阻、受限制或被拖慢的方式；艰难地。"},"examples":[{"en":"After the injury, he walked hamperedly up the stairs, holding the railing.","zh":"受伤之后，他扶着栏杆艰难地走上楼梯。"},{"en":"The rescue team moved hamperedly through the deep snow and strong wind.","zh":"救援队在深雪和强风中受阻地前进。"},{"en":"With the internet down, the office worked hamperedly all morning.","zh":"网络断了，办公室整个上午都在受阻地工作。"}]}],"synonyms":["with difficulty","hinderedly","awkwardly","laboriously","slowly"],"phonetic":"/ˈhæmpɚdli/","extraExplanation":["“hamperedly”比较少见，更常用的表达是：in a hampered way / with difficulty / with hindrance，或直接用动词/形容词改写（例如：He was hampered by an injury. / His progress was hampered.）。","构词：hamper（妨碍、限制）→ hampered（受阻的）→ hamperedly（以受阻的方式）。在正式写作中偶尔可见，但日常口语不常用。"]}
{"word":"hamperedness","summary":{"en":"“Hamperedness” means the condition of being hindered or limited by obstacles.","zh":"“hamperedness”表示“受到阻碍/限制的状态”，因障碍而难以顺利进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being hampered; difficulty or limitation caused by obstacles","zh":"受阻碍的状态；因障碍而产生的不便、限制或困难"},"examples":[{"en":"Her progress was slowed by the hamperedness of the transport system.","zh":"交通系统受阻的状况减慢了她的进展。"},{"en":"The project’s hamperedness came from a lack of staff and funding.","zh":"这个项目受阻主要来自人手和资金不足。"}]}],"synonyms":["hindrance","impediment","obstruction","limitation","difficulty"],"phonetic":"/ˈhæmpərdnəs/","extraExplanation":["“hamperedness”是由形容词/过去分词“hampered（受阻的）”加名词后缀“-ness（……的状态）”构成，意思直观但在现代英语里比较少见。","更常用的表达包括“hindrance（阻碍）”“impediment（障碍）”或直接说“being hampered / being hindered（受到阻碍）”。在正式写作中，通常会用更常见的名词替代它。"]}
{"word":"hamperer","summary":{"en":"A hamperer is someone or something that hinders or slows progress.","zh":"hamperer 指阻碍或拖慢进展的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that hampers; something that makes progress difficult or slows it down","zh":"阻碍者；妨碍因素；使进展变困难或变慢的人或事物"},"examples":[{"en":"Unclear instructions can be a major hamperer in a new job.","zh":"指示不清在新工作中可能是一个主要的阻碍因素。"},{"en":"Heavy traffic was a hamperer to our plan to arrive early.","zh":"严重的交通是我们早到计划的阻碍。"},{"en":"For some learners, fear of making mistakes is a hamperer to speaking English.","zh":"对一些学习者来说，害怕犯错会阻碍他们开口说英语。"}]}],"synonyms":["hindrance","obstacle","impediment","blocker","deterrent"],"phonetic":"/ˈhæm.pɚ.ɚ/","extraExplanation":["“hamperer”由动词“hamper（妨碍）”+ 后缀“-er（做某事的人/物）”构成，意思是“造成妨碍的人或事物”。在现代英语中更常见的说法是“hindrance”“obstacle”，而“hamperer”相对少用，多见于需要强调“谁/什么在妨碍”的语境。"]}
{"word":"hamperers","summary":{"en":"“Hamperers” means obstacles—people or things that hinder progress.","zh":"“hamperers”指阻碍进展的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that slow down, delay, or make progress difficult; obstacles.","zh":"妨碍者；阻碍事物；使进展变慢或变困难的人或物。"},"examples":[{"en":"Lack of funding and outdated equipment were major hamperers of the project.","zh":"资金不足和设备陈旧是这个项目的主要阻碍因素。"},{"en":"Fear and self-doubt can be strong hamperers when you try to learn a new skill.","zh":"当你尝试学习新技能时，恐惧和自我怀疑可能是很强的阻碍。"}]}],"synonyms":["obstacles","hindrances","impediments","blockers","constraints"],"phonetic":"/ˈhæmpərərz/","extraExplanation":["“hamperers”是名词复数，来自动词“hamper”（妨碍、阻挠）。写作中更常用的抽象名词是“hindrance(s)”（阻碍）或“obstacle(s)”（障碍）；“hamperer(s)”相对少见，但在正式或强调“阻碍者/阻碍因素”的语境中也会出现。"]}
{"word":"hampering","summary":{"en":"“Hampering” means obstructing or making progress difficult (the -ing form of “hamper”).","zh":"“hampering”表示“正在妨碍/阻碍，使进展困难”，是“hamper”的-ing形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of \"hamper\") making it difficult for someone or something to do or achieve something; obstructing or slowing progress.","zh":"（动词 hamper 的现在分词）妨碍；阻碍；使进展变慢。"},"examples":[{"en":"Heavy traffic is hampering the delivery trucks.","zh":"交通拥堵正在妨碍送货卡车的通行。"},{"en":"Her lack of sleep is hampering her concentration in class.","zh":"睡眠不足正在影响她在课堂上的专注力。"},{"en":"A weak internet connection is hampering our video call.","zh":"网络不稳定正在妨碍我们的视频通话。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or effect of hindering progress; obstruction (less common).","zh":"阻碍的行为或结果；妨碍（较不常用）。"},"examples":[{"en":"They discussed the hampering of rescue efforts by bad weather.","zh":"他们讨论了恶劣天气对救援工作的阻碍。"}]}],"synonyms":["hindering","blocking","obstructing","impeding","holding back","interfering with"],"phonetic":"/ˈhæmpərɪŋ/","extraExplanation":["“hamper”来自中古英语，原义有“用器具/束缚来限制”的感觉，因此在现代英语里常用于“限制行动、拖慢进度”。在正式写作或新闻中很常见，如：hampering efforts/progress/recovery（妨碍努力/进展/复苏）。"]}
{"word":"hamperman","summary":{"en":"“hamperman” is not a standard English word; it’s likely a typo or a name. Consider “hamper” (basket) or “to hamper” (to hinder).","zh":"“hamperman”不是标准英语词，可能是拼写错误或名字。可考虑“hamper”（篮筐）或“to hamper”（妨碍）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up name (for example, a username or surname). You may have meant “hamper” or “Hamperman.”","zh":"不是标准英语单词。很可能是拼写错误或自造词（例如用户名或姓氏）。你可能想写的是“hamper”或“Hamperman”。"},"examples":[{"en":"I can’t find “hamperman” in a dictionary—did you mean “hamper” (a laundry basket) or “to hamper” (to hinder)?","zh":"词典里查不到“hamperman”——你是想写“hamper”（洗衣篮）还是“to hamper”（妨碍、阻碍）吗？"},{"en":"Please send the sentence where you saw “hamperman,” and I’ll help you interpret it.","zh":"请把你看到“hamperman”的完整句子发来，我可以帮你理解它在语境中的意思。"}]}],"synonyms":["hamper","hamper","hinder","obstruct"],"phonetic":"/ˈhæmpərmən/","extraExplanation":["“hamper”常见有两类意思：①名词，指装衣物/礼品的篮子或大筐（laundry hamper / gift hamper）；②动词，指“妨碍、阻碍”（The heavy rain hampered our trip. 大雨妨碍了我们的旅行）。","如果你想表达“妨碍你的人/东西”，英语更自然的说法通常是“something/someone that hampers…”或“a hindrance”，而不是把“hamper+man”拼在一起。"]}
{"word":"hampers","summary":{"en":"“Hampers” can mean baskets/containers (especially for laundry or gift food), or it can be the verb meaning “hinders.”","zh":"“hampers”既可指（复数）篮子/容器（常见为洗衣篮或礼篮），也可作动词，表示“妨碍、阻碍”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"large baskets or containers, often used to hold laundry or to pack food as a gift","zh":"（复数）大篮子/大筐；常用于装洗衣物，或作为礼篮装食物送人"},"examples":[{"en":"Please put your dirty clothes in the hampers.","zh":"请把脏衣服放进洗衣篮里。"},{"en":"They ordered two gift hampers for the holiday.","zh":"他们为节日订了两份礼篮。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something difficult to do; to hinder or limit progress","zh":"妨碍；阻碍；使进展受限"},"examples":[{"en":"Heavy rain hampers travel in the mountains.","zh":"大雨会妨碍山区出行。"},{"en":"His injury hampers his ability to run.","zh":"他的伤势影响了他跑步的能力。"}]}],"synonyms":["baskets","containers","laundry baskets","hinder","impede","obstruct"],"phonetic":"/ˈhæmpɚz/","extraExplanation":["“hamper”在美式英语里很常见的搭配是“laundry hamper”（洗衣篮）。在英式英语里，“(Christmas) hamper”也常指装有茶、饼干、果酱等的节日礼篮。","动词“hamper”多用于较正式的表达，常见搭配有：hamper efforts（妨碍努力）、hamper growth（阻碍增长）、be hampered by…（受……所限）。"]}
{"word":"hampian","summary":{"en":"“Hampian” means “of Hampshire” and, less commonly, “a person from Hampshire.”","zh":"“Hampian”指“汉普郡的”，较少也可指“汉普郡人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hampshire, a county in southern England.","zh":"（形容词）与英格兰南部汉普郡（Hampshire）有关的；汉普郡的。"},"examples":[{"en":"She grew up in a small Hampian village near Winchester.","zh":"她在温彻斯特附近一个汉普郡的小村庄长大。"},{"en":"The report focuses on Hampian history and local traditions.","zh":"这份报告聚焦于汉普郡的历史与地方传统。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Hampshire (rare; more commonly “a Hampshire resident” or “a Hampshireman/Hampshirewoman”).","zh":"（名词，较少用）汉普郡人。（更常说“a Hampshire resident”或“Hampshireman/Hampshirewoman”。）"},"examples":[{"en":"As a Hampian, he felt proud of the county’s naval heritage.","zh":"作为一名汉普郡人，他为本郡的海军传统感到自豪。"}]}],"synonyms":["Hampshire (adj., in phrases)","from Hampshire","Hampshire resident","Hampshireman"],"phonetic":"/ˈhæmpiən/","extraExplanation":["“Hampian”在现代英语里比较少见，偏书面或地方色彩；日常表达通常直接说“from Hampshire / in Hampshire”。","构词上常见于表示“某地的”的形容词：地名 + -ian（如 Boston → Bostonian）。","常见搭配：Hampian accent（汉普郡口音）、Hampian dialect（汉普郡方言）、Hampian countryside（汉普郡乡村）。"]}
{"word":"Hampshire","summary":{"en":"Hampshire is most commonly the name of a county in southern England; it can also be used in U.S. place names and in “New Hampshire.”","zh":"Hampshire 通常指英格兰南部的汉普郡；也可出现在美国地名中，并常见于“New Hampshire（新罕布什尔州）”等名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a county in southern England, known for cities like Winchester and Portsmouth and for nearby natural areas such as the New Forest","zh":"英格兰南部的一个郡（汉普郡），以温彻斯特、朴次茅斯等城市及新森林等自然景观闻名"},"examples":[{"en":"Jane Austen lived in Hampshire for many years.","zh":"简·奥斯汀在汉普郡生活了很多年。"},{"en":"We drove through Hampshire on our way to the coast.","zh":"我们去海边的路上开车经过了汉普郡。"}]},{"partOfSpeech":"other","definition":{"en":"a place name used in the United States (for example, Hampshire County in Massachusetts or West Virginia); it also appears in names like “New Hampshire”","zh":"美国的一些地名用法（如马萨诸塞州或西弗吉尼亚州的“汉普郡县”）；也常见于“New Hampshire（新罕布什尔州）”等名称中"},"examples":[{"en":"The conference is held in Hampshire County, Massachusetts.","zh":"会议在马萨诸塞州的汉普郡县举行。"},{"en":"She moved from New Hampshire to New York.","zh":"她从新罕布什尔州搬到了纽约。"}]}],"synonyms":["(as a place name) Hants. (abbr., UK)"],"phonetic":"/ˈhæmpʃɚ/","extraExplanation":["“Hampshire”里的“-shire”在英国地名中常见，意思接近“郡/行政区”（如 Yorkshire, Oxfordshire）。","它的名字来源于古英语地名演变；历史上与城市“Winchester（温彻斯特）”及英格兰早期王国历史有关。","文学文化上，简·奥斯汀（Jane Austen）在汉普郡的 Chawton 居住并完成/修订了多部作品，因此在英语文化中常与她联系在一起。"]}
{"word":"Hampshireman","summary":{"en":"a male native or resident of Hampshire, England","zh":"英格兰汉普郡的男性本地人或居民"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man from Hampshire, a county in southern England; a male Hampshire native or resident","zh":"汉普郡（英格兰南部）人；汉普郡的男性本地人或居民"},"examples":[{"en":"He introduced himself proudly as a Hampshireman.","zh":"他自豪地介绍自己是个汉普郡人。"},{"en":"Many Hampshiremen worked in farming and shipbuilding in earlier centuries.","zh":"在早些世纪，许多汉普郡男性从事农业和造船业。"},{"en":"The story follows a Hampshireman who moves to London for work.","zh":"故事讲的是一位汉普郡男子去伦敦工作。"}]}],"synonyms":["Hampshire resident","Hampshire native","man from Hampshire","Hampshire local"],"phonetic":"/ˈhæmpʃərmən/","extraExplanation":["在现代英语中，描述“某地人”更常用性别中性的形式（如 Hampshire resident / person from Hampshire）。Hampshireman 带有较强的“男性”色彩，语感更传统，有时出现在历史叙述或文学描写里。"],"etymology":"由地名 Hampshire（汉普郡）+ man（男人/人）构成，用来表示“来自某地的男性”。该构词方式也常见于其他地名，如 Londoner（伦敦人，性别中性）等。","mnemonic":["拆开记：Hampshire + man＝“汉普郡 + 男子”。","联想：看到 man 就知道是“男性的某地人”，类似“Englishman（英国男子）”。"]}
{"word":"hampshireman","summary":{"en":"A Hampshireman is a man from Hampshire in southern England.","zh":"Hampshireman 指来自英国英格兰南部汉普郡的男性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man from Hampshire, a county in southern England; someone whose home is Hampshire","zh":"汉普郡（英国英格兰南部的一个郡）人；来自/居住在汉普郡的男性"},"examples":[{"en":"He’s a Hampshireman who moved to London for work.","zh":"他是汉普郡人，为了工作搬到了伦敦。"},{"en":"The local paper interviewed a Hampshireman about the new housing plan.","zh":"当地报纸采访了一位汉普郡人，谈新住房计划。"}]}],"synonyms":["a man from Hampshire","Hampshire resident"],"phonetic":"/ˈhæmpʃərmən/","extraExplanation":["“Hampshireman”是较传统、带一点书面/年代感的说法；现代英语里更常见的是“a man from Hampshire”或直接说“a Hampshire resident”。如果不强调性别，也可用“Hampshire person”。","Hampshire（汉普郡）位于英格兰南部，城市如Southampton（南安普顿）、Winchester（温彻斯特）都在此郡。了解地名有助于读懂英国新闻、文学或历史语境中的身份称呼。"]}
{"word":"hampshiremen","summary":{"en":"“Hampshiremen” means men from Hampshire, England (plural).","zh":"“Hampshiremen”指来自英格兰汉普郡的男子（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"men from Hampshire (a county in southern England); the plural of “Hampshireman.”","zh":"来自英格兰南部汉普郡（Hampshire）的男子；“Hampshireman”的复数形式。"},"examples":[{"en":"In the novel, the Hampshiremen speak with a strong local accent.","zh":"在小说里，这些汉普郡人带着很重的地方口音说话。"},{"en":"The regiment was made up largely of Hampshiremen.","zh":"这个团主要由汉普郡人组成。"}]}],"synonyms":["men from Hampshire","Hampshire residents (more neutral)","Hampshire locals"],"phonetic":"/ˈhæmpʃərmən/","extraExplanation":["“Hampshiremen”带有较强的地域与历史色彩，常见于英国历史、军队编制、地方政治或文学描写中，用来强调人物来自汉普郡这一身份背景。","Hampshire 是英格兰南部的一个郡，较知名的城市包括 Southampton（南安普敦）和 Winchester（温彻斯特）。","单数是 Hampshireman（一个汉普郡男子）；更中性的说法可以用 “people from Hampshire / Hampshire residents（汉普郡居民）”。"]}
{"word":"hampshirite","summary":{"en":"Hampshirite means a person from Hampshire (England), and it can also describe something relating to Hampshire; sometimes it’s used for New Hampshire (U.S.) in context.","zh":"Hampshirite 指“汉普郡人”（多指英格兰汉普郡居民），也可作形容词表示“汉普郡的”；在特定语境下有时也指美国新罕布什尔州的人/事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Hampshire, a county in southern England (also sometimes used for a person from the U.S. state of New Hampshire)","zh":"汉普郡人（英格兰南部的汉普郡居民；有时也指美国新罕布什尔州居民）"},"examples":[{"en":"Jane Austen is a famous Hampshirite because she spent much of her life in Hampshire.","zh":"简·奥斯汀常被称为“汉普郡人”，因为她人生的大部分时间都在汉普郡度过。"},{"en":"He’s a proud Hampshirite and loves talking about local history.","zh":"他很以自己是汉普郡人而自豪，喜欢谈论本地历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Hampshire (England) (and sometimes to New Hampshire in U.S. contexts)","zh":"汉普郡的；与汉普郡有关的（在美国语境中有时指新罕布什尔州的）"},"examples":[{"en":"She writes about Hampshirite villages and countryside life.","zh":"她写作的题材常是汉普郡的村庄与乡村生活。"}]}],"synonyms":["Hampshire resident","Hampshire local","New Hampshire resident (context)"],"phonetic":"ˈhæmpʃəˌraɪt","extraExplanation":["“-ite”是英语里常见的后缀，用来表示“某地/某群体的人”（如 Londoner 也可，但 -ite 常见于地名后：Brooklynite, Israelite）。因此 Hampshirite 的核心含义就是“来自 Hampshire 的人”。","在美国语境里也可能指 New Hampshire（新罕布什尔州）的人；如果需要更明确，常说 “a person from Hampshire, England” 或 “a New Hampshirite / a New Hampshire resident”。"]}
{"word":"hampshirites","summary":{"en":"“Hampshirites” means people from Hampshire (England), and less commonly people from New Hampshire (USA).","zh":"“Hampshirites”指汉普郡（英格兰）的人；较少情况下也可指新罕布什尔州（美国）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Hampshire (a county in southern England); plural: people from Hampshire","zh":"汉普郡（英格兰南部的一个郡）的人；复数：汉普郡人"},"examples":[{"en":"Many Hampshirites commute to London for work.","zh":"许多汉普郡人通勤去伦敦工作。"},{"en":"The festival celebrates food made by local Hampshirites.","zh":"这个节日庆祝由本地汉普郡人制作的食物。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person from New Hampshire (a U.S. state); plural: people from New Hampshire","zh":"（较少见）新罕布什尔州（美国一州）的人；复数：新罕布什尔州人"},"examples":[{"en":"Some Hampshirites take pride in New Hampshire’s town-meeting tradition.","zh":"一些新罕布什尔州人以该州的“市镇会议”传统为荣。"},{"en":"In U.S. news writing, “New Hampshirite” is often used to avoid confusion.","zh":"在美国新闻写作中，常用“New Hampshirite”来避免混淆。"}]}],"synonyms":["Hampshire residents","people from Hampshire","(US) New Hampshire residents","(US) New Hampshirites"],"phonetic":"/ˈhæmpʃəˌraɪt/","extraExplanation":["“Hampshirite”是一个demonym（地名对应的居民称呼），由“Hampshire + -ite”构成，类似的还有“Londoner”“Mancunian”。","英式语境里通常指英格兰的Hampshire；在美式语境中若指美国的新罕布什尔州，写作时常加New（New Hampshirite）以减少歧义。"]}
{"word":"hamrongite","summary":{"en":"“Hamrongite” doesn’t appear to be a common English word; it is likely a misspelling or a rare/specialized name.","zh":"“hamrongite”不是常见英语词，可能是拼写错误或非常少见/专业的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it may be a misspelling, a very rare proper noun, or a specialized term (often words ending in “-ite” are names of minerals or groups).","zh":"在主要英语词典中不是常见词；可能是拼写错误、非常少见的专有名词，或某个专业术语（以“-ite”结尾的词常见于矿物名或某类事物的名称）。"},"examples":[{"en":"I couldn’t find “hamrongite” in a dictionary—do you have a sentence or a source link?","zh":"我在词典里找不到“hamrongite”——你能提供一个例句或来源链接吗？"},{"en":"If this is a mineral name, the spelling might be different in the original article.","zh":"如果这是矿物名称，原文里的拼写可能不一样。"}]}],"phonetic":"/hæmˈrɔŋɡaɪt/","extraExplanation":["“hamrongite”这种拼写看起来像“专有名词 + -ite（…石/…矿）”的结构，但在常见英语语料和词典中并不常见，所以更可能是：①拼写误差；②某个地名/人名衍生词；③小众领域（矿物学、地质学、小说设定等）里的术语。","如果你把它出现的句子贴出来，我可以根据上下文判断它的词性和含义，并给出更准确的解释与常用近义表达。"]}
{"word":"hams","summary":{"en":"“Hams” most commonly means the plural of ham (cured/cooked pork). It can also mean overacting performers, or the verb form in “hams it up” (acts exaggeratedly).","zh":"“hams”最常见是“ham（火腿）”的复数；也可指“表演夸张的人”，或作动词第三人称单数（常见于“hams it up”=演得很夸张）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “ham”: the meat from a pig’s upper leg, often cured or cooked (e.g., baked, smoked).","zh":"“ham”的复数：火腿；指猪后腿部位的肉，常被腌制或熏烤后食用。"},"examples":[{"en":"We bought two hams for the holiday dinner.","zh":"我们为节日晚餐买了两只火腿。"},{"en":"These hams are smoked and ready to eat.","zh":"这些火腿是烟熏的，可以直接吃。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “ham” (informal): actors or performers who exaggerate emotions or gestures.","zh":"“ham”的复数（非正式）：表演夸张的人；爱“演过头”的演员或表演者。"},"examples":[{"en":"The director didn’t want a cast full of hams.","zh":"导演不希望演员阵容里都是爱夸张表演的人。"},{"en":"They’re funny, but sometimes they act like hams on stage.","zh":"他们很搞笑，但有时在台上演得有点夸张。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular form of “ham” (informal): to perform in an exaggerated, attention-seeking way (often “ham it up”).","zh":"“ham”的第三人称单数（非正式）：用夸张、抢镜的方式表演（常见搭配“ham it up”）。"},"examples":[{"en":"He hams it up whenever there’s a camera.","zh":"只要有镜头，他就会表演得很夸张。"},{"en":"She hams it up to make the kids laugh.","zh":"她故意夸张表演来逗孩子们笑。"}]}],"synonyms":["cured pork","smoked ham","overactor","show-off (informal)"],"phonetic":"/hæmz/","extraExplanation":["“hams”最常见是名词复数（火腿）。如果你在句子里看到“hams it up”，那里的“hams”是动词“ham”的第三人称单数，意思是“演得很夸张/很抢戏”。","“ham（夸张表演）”带一点轻微的吐槽意味，但也可能是友善的调侃，取决于语境。"]}
{"word":"hamsa","summary":{"en":"A protective hand-shaped symbol used as a charm against bad luck or the evil eye.","zh":"一种手掌形的护身符符号，用于防厄运或“邪眼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hand-shaped symbol (often shown with five fingers and sometimes an eye) used as a protective charm against bad luck or the “evil eye,” common in Middle Eastern and North African cultures.","zh":"一种手掌形的符号（通常画成五指张开，有时手心有一只眼睛），常被当作护身符，用来防止厄运或“邪眼”，在中东与北非文化中很常见。"},"examples":[{"en":"She wears a hamsa necklace for protection and good luck.","zh":"她戴着哈姆萨手形项链，寓意保护与好运。"},{"en":"Many shops sell hamsa wall hangings as decorative charms.","zh":"很多商店卖哈姆萨手形壁饰，作为装饰性的护符。"}]}],"synonyms":["Hand of Fatima","Hand of Miriam","protective amulet","good-luck charm"],"phonetic":"/ˈhɑːmsə/","extraExplanation":["“Hamsa”来自阿拉伯语中的“五”（与五根手指相关）。在犹太传统中它也常被称为“米利暗之手”（Hand of Miriam）；在伊斯兰文化中也有人称其为“法蒂玛之手”（Hand of Fatima）。","它既可以是宗教/民俗象征，也常作为时尚饰品或家居装饰出现；在不同群体中含义会有差异，使用时尊重其文化与信仰背景更合适。"]}
{"word":"hamshackle","summary":{"en":"Hamshackle is usually a misspelling of ramshackle, meaning in poor condition and likely to fall apart.","zh":"hamshackle 通常是 ramshackle 的误拼，意思是“破旧摇摇欲坠、看起来快要散架的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a building, vehicle, or object) in poor condition; badly built or carelessly repaired, so it seems likely to fall apart.","zh":"（指建筑、车辆或物品）破旧不堪的；粗制滥造或修修补补、看起来快要散架的。"},"examples":[{"en":"They lived in a ramshackle house at the edge of town.","zh":"他们住在城边一栋破旧不堪的房子里。"},{"en":"A hamshackle boat like that isn’t safe in rough water.","zh":"那样一条快散架的破船在风浪里不安全。"}]}],"synonyms":["ramshackle","dilapidated","run-down","rickety","shabby"],"phonetic":"/ˈræmˌʃækəl/","extraExplanation":["标准拼写通常是 **ramshackle**（破旧的、摇摇欲坠的）。**hamshackle** 多半被视为拼写错误或不常见的变体；在写作与考试中建议使用 **ramshackle**。","ramshackle 常用来营造画面感，带一点“临时凑合、靠补丁撑着”的语气；既可以中性描写，也常带轻微贬义。","词源上与“ram”（乱撞、冲击）有关，给人一种结构松散、东倒西歪的感觉。"]}
{"word":"hamster","summary":{"en":"A small pet rodent known for cheek pouches and running on a wheel.","zh":"一种常见的小型宠物啮齿动物，以颊囊和跑轮行为而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, furry pet rodent with a short tail and cheek pouches for carrying food.","zh":"仓鼠：一种体型小、毛茸茸的啮齿类宠物，尾巴短，脸颊有颊囊可以用来储存和搬运食物。"},"examples":[{"en":"My hamster loves running on its wheel at night.","zh":"我的仓鼠晚上很喜欢在跑轮上跑。"},{"en":"Hamsters store food in their cheek pouches.","zh":"仓鼠会把食物储存在颊囊里。"}]}],"synonyms":["pet rodent"],"phonetic":"/ˈhæm.stɚ/","extraExplanation":["“Hamster”通常指叙利亚仓鼠（Syrian hamster）或侏儒仓鼠（dwarf hamster）等常见宠物品种。它们多为夜行或晨昏活动，白天睡得多，适合用安静、阴凉的环境饲养。","在英语里有个常见表达“like a hamster on a wheel”，比喻“忙个不停却原地打转/没有进展”。例如：I felt like a hamster on a wheel at work."]}
{"word":"hamsters","summary":{"en":"“Hamsters” means more than one hamster (small pet rodent).","zh":"“hamsters”表示不止一只仓鼠（常见宠物小型啮齿动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of hamster: a small rodent often kept as a pet.","zh":"hamster（仓鼠）的复数：一种体型小的啮齿动物，常被当作宠物饲养。"},"examples":[{"en":"My sister has two hamsters in separate cages.","zh":"我妹妹养了两只仓鼠，分别住在不同的笼子里。"},{"en":"Hamsters are usually most active at night.","zh":"仓鼠通常在晚上最活跃。"},{"en":"The kids watched the hamsters run on the wheel.","zh":"孩子们看着仓鼠在跑轮上奔跑。"}]}],"synonyms":["pet rodents","hamster (singular)"],"phonetic":"/ˈhæm.stɚ/","extraExplanation":["“hamster”在英语里很常见于宠物语境。养仓鼠时常见搭配有：a hamster cage（仓鼠笼）、a wheel（跑轮）、bedding（垫材）、to feed hamsters（喂仓鼠）。","文化上，hamster wheel（仓鼠跑轮）也常被引申为“停不下来的重复忙碌”，比如：I feel like I'm on a hamster wheel.（我感觉自己在不停地忙、却原地打转。）"]}
{"word":"hamstring","summary":{"en":"“Hamstring” is a back-thigh muscle, and as a verb it means to seriously limit or hinder progress.","zh":"“hamstring”既指大腿后侧的腘绳肌，也可作动词表示“严重妨碍、束缚（进展或行动）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) One of the muscles at the back of your thigh, used for bending the knee and moving the leg.","zh":"（解剖）腘绳肌；大腿后侧的一组肌肉，用于屈膝和带动腿部运动。"},"examples":[{"en":"He pulled his hamstring while sprinting.","zh":"他冲刺时拉伤了腘绳肌。"},{"en":"Regular stretching can help protect your hamstrings.","zh":"规律拉伸有助于保护腘绳肌。"}]},{"partOfSpeech":"vt.","definition":{"en":"To limit someone or something by making it difficult to act or move effectively.","zh":"妨碍；束缚；使难以有效行动或开展工作。"},"examples":[{"en":"A lack of funding hamstrung the project.","zh":"资金不足使项目难以推进。"},{"en":"Unclear rules can hamstring a team’s progress.","zh":"规则不清会阻碍团队的进展。"}]}],"synonyms":["hinder","restrict","limit","impede","cripple"],"phonetic":"/ˈhæmˌstrɪŋ/","extraExplanation":["“hamstring”作动词的比喻用法很常见，意思是“让……行动受限”，常搭配：hamstring a project/plan/effort/government/company。","词源上与腿后肌腱（string）有关：早期含义与“割断腿后肌腱使其不能跑动”有关，因此引申为“使无法有效行动”。现代英语里通常只作比喻或指肌肉拉伤，不涉及暴力语境。"]}
{"word":"hamstring-related","summary":{"en":"connected with the muscles at the back of the thigh","zh":"与大腿后侧腘绳肌有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with the hamstring muscles (the muscles at the back of the thigh), especially in sports or medical contexts.","zh":"与腘绳肌（大腿后侧肌群）有关的，常用于运动或医疗语境。"},"examples":[{"en":"The therapist designed a hamstring-related rehab plan for the runner.","zh":"治疗师为这位跑者制定了一个与腘绳肌相关的康复计划。"},{"en":"Most of his hamstring-related pain appears during sprinting.","zh":"他的腘绳肌相关疼痛多出现在冲刺时。"},{"en":"She avoided deep stretches because of a hamstring-related injury.","zh":"因为腘绳肌相关的伤势，她避免做过深的拉伸。"}]}],"synonyms":["hamstring","posterior thigh","thigh-muscle","hamstring-associated","hamstring-specific"],"phonetic":"/ˈhæmstrɪŋ rɪˈleɪtɪd/","extraExplanation":["写作中常见搭配：hamstring-related injury（腘绳肌相关伤）、hamstring-related pain（腘绳肌相关疼痛）、hamstring-related exercises（腘绳肌相关训练）。","注意区分：hamstring injury 更直接指“腘绳肌拉伤/损伤”；hamstring-related 更宽泛，可能是由腘绳肌紧张、力量不足、代偿等“相关因素”引起。"],"etymology":"由 hamstring（腘绳肌；也可作动词“使受限制”）+ related（相关的）构成的复合形容词，常见于医学、运动训练与康复写作中，用来说明“与腘绳肌有关”。","mnemonic":["把 hamstring 记成“ham（火腿）+ string（绳子）”：大腿后侧像一条“绳子”一样拉住腿；加上 related 就是“跟这条‘绳子’有关的”。","联想中文“腘绳肌”里的“绳”：英文 string=绳子，帮助你把部位定位到大腿后侧。"]}
{"word":"hamstringed","summary":{"en":"Hamstringed means “crippled by cutting the hamstring” (literal) or, more commonly, “severely hindered or weakened” (figurative).","zh":"hamstringed 可指（字面）割断腿筋致残；更常见的是（比喻）被严重阻碍、掣肘或削弱。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(literal) To disable a person or animal by cutting the hamstring tendons behind the knee; to cripple.","zh":"（字面）割断膝后腘绳肌腱（腿筋）使人或动物残废；使瘸。"},"examples":[{"en":"In the old story, the captive horses were hamstringed so they could not escape.","zh":"在那个旧故事里，俘获的马被割断腿筋，无法逃跑。"},{"en":"The injured animal looked as if it had been hamstringed.","zh":"那只受伤的动物看起来像是被割断了腿筋。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) Seriously weakened, limited, or prevented from working effectively; badly hindered.","zh":"（比喻）被严重削弱、限制，或导致无法有效运作；被严重掣肘。"},"examples":[{"en":"The project was hamstringed by a lack of funding.","zh":"这个项目因资金不足而被严重掣肘。"},{"en":"Small businesses can be hamstringed by complicated paperwork.","zh":"小企业可能会被繁琐的文书程序拖累。"},{"en":"Poor communication hamstringed the team’s ability to respond quickly.","zh":"沟通不畅削弱了团队快速应对的能力。"}]}],"synonyms":["crippled","disabled","hobbled","impeded","hindered","constrained"],"phonetic":"/ˈhæmstrɪŋd/","extraExplanation":["“hamstring”原指大腿后侧的腱（腘绳肌腱），是让膝盖弯曲、腿部发力的重要部位；因此“to hamstring”在字面上带有“让对方失去行动能力”的强烈画面感。现代英语里更常见的是比喻用法，表示政策、规则、资源不足等因素“把人/组织的手脚绑住”，使其难以发挥。","常见搭配：be hamstringed by + 原因（资金不足、法规限制、缺人手、流程复杂等）。与“injure your hamstring（拉伤腿筋）”不同，后者是运动伤病表达，不表示“限制/掣肘”。"]}
{"word":"hamstringer","summary":{"en":"a hindering person/thing; informally, an athlete limited by a hamstring injury.","zh":"阻碍进展的人或因素；（非正式）腘绳肌受伤而受限的运动员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that hinders, weakens, or prevents progress (someone who “cripples” an effort).","zh":"阻碍者；使事情受挫的人（或事物），让进展“瘸掉”的因素。"},"examples":[{"en":"Poor communication can be a real hamstringer for teamwork.","zh":"沟通不良会成为团队合作的真正阻碍。"},{"en":"A last-minute rule change became a hamstringer for small businesses.","zh":"临时更改规定成了小企业的绊脚石。"}]},{"partOfSpeech":"n.","definition":{"en":"(sports, informal) an athlete whose hamstring is injured, often limiting performance or keeping them out of play.","zh":"（体育，非正式）腘绳肌受伤的运动员；因大腿后侧拉伤而影响发挥或缺阵的人。"},"examples":[{"en":"He missed two games as a hamstringer.","zh":"他因为腘绳肌拉伤缺席了两场比赛。"},{"en":"The team’s offense struggled with two starters turning into hamstringers.","zh":"两名首发腘绳肌受伤后，球队进攻明显吃力。"}]}],"synonyms":["obstructionist","hinderer","saboteur","spoiler","impediment"],"phonetic":"/ˈhæmˌstrɪŋər/","extraExplanation":["英语里 hamstring 原意与“切断或伤到腘绳肌”有关，因此引申出“使人动弹不得、让计划推进困难”的比喻义。hamstringer 作为“阻碍者/绊脚石”是从这个比喻义延伸来的。"],"etymology":"由 hamstring（腘绳肌；使…伤残/受挫）+ 后缀 -er（表示“人/物”）构成；字面意思是“造成（或遭受）腘绳肌问题的人/物”，引申为“绊脚的人/因素”。","mnemonic":["把 ham 看作“火腿”，string 看作“绳子”：火腿的“筋/绳”（腘绳肌）出问题就跑不动——联想到“让人跑不动=阻碍”。","-er 表示“……的人/东西”，所以 hamstringer 就是“造成 hamstring（受挫/拉伤）的人/因素”。"]}
{"word":"hamstringing","summary":{"en":"Hamstringing means seriously limiting or weakening someone/something (most common), or literally crippling by damaging the hamstring tendon (rare).","zh":"hamstringing 通常指严重限制或削弱（最常见的比喻义）；也可指字面上损伤腘绳肌肌腱致残（较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Severely limit or weaken someone or something; make it much harder to act effectively.","zh":"严重限制或削弱（某人/某事）；使其难以有效行动。"},"examples":[{"en":"Budget cuts are hamstringing the school’s ability to hire new teachers.","zh":"预算削减正在严重限制学校招聘新教师的能力。"},{"en":"Too many rules can end up hamstringing innovation.","zh":"过多的规定最终可能会扼杀创新。"},{"en":"A last-minute delay is hamstringing our plans.","zh":"临时的延误正在拖累我们的计划。"}]},{"partOfSpeech":"v.","definition":{"en":"(Literal, rare today) Cripple a person or animal by cutting or damaging the hamstring tendon behind the knee.","zh":"（字面义，如今较少见）切断或损伤膝后腘绳肌肌腱，使人或动物跛行/瘫痪。"},"examples":[{"en":"In old stories, enemies were described as hamstringing horses to stop them from escaping.","zh":"在一些旧故事里，敌人被描写为割断马的腘绳肌来阻止其逃跑。"}]}],"synonyms":["crippling","hindering","restricting","undermining","holding back","hobbling"],"phonetic":"ˈhæmˌstrɪŋɪŋ","extraExplanation":["“hamstring”原指大腿后侧的腘绳肌/肌腱（hamstring tendon）。因此比喻义“让人动弹不得、行动受限”非常常见，尤其用于谈政策、资源不足、官僚程序等对效率的拖累。","在现代语境里，这个词通常是比喻用法；字面义多见于历史叙述或文学描写。"]}
{"word":"hamstrings","summary":{"en":"Hamstrings are the muscles at the back of the thigh, commonly mentioned in fitness and injury contexts.","zh":"Hamstrings 指大腿后侧的腘绳肌，常用于健身训练与拉伤等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The muscles at the back of your thigh that help you bend your knee and move your hip; in everyday English, people often say “my hamstrings” when talking about soreness or injury from running or exercise.","zh":"大腿后侧的肌肉群（腘绳肌），帮助屈膝并参与髋部运动；日常英语里常用“my hamstrings”来指跑步或运动后的酸痛/拉伤。"},"examples":[{"en":"My hamstrings are sore after yesterday’s workout.","zh":"我昨天训练完以后腘绳肌很酸。"},{"en":"He pulled his hamstring during the sprint.","zh":"他冲刺时拉伤了腘绳肌。"},{"en":"Stretch your hamstrings before you run.","zh":"跑步前先拉伸一下腘绳肌。"}]}],"synonyms":["hamstring muscles","posterior thigh muscles"],"phonetic":"/ˈhæmˌstrɪŋz/","extraExplanation":["常见搭配：hamstring injury（腘绳肌损伤）、tight hamstrings（腘绳肌紧）、hamstring stretch（腘绳肌拉伸）。注意口语里也常说“pulled my hamstring”（拉伤腘绳肌）。","词形小提示：hamstrings 是复数，因为这组肌肉通常以“左右两条腿的一组肌群”来谈，英语里很常用复数表达；单数 hamstring 也可以，但更常见于“a hamstring injury/strain”。","易混点：hamstrings（肌肉）不要和 hamstring（动词，削弱/牵制）混淆；动词意义来自早期指“切断腿筋使其不能行动”的比喻用法。"]}
{"word":"hamstrung","summary":{"en":"Hamstrung means seriously hindered or unable to act effectively (often because of limits like money, rules, or resources).","zh":"Hamstrung 指“被严重阻碍、束手束脚”，常因资金、规则或资源限制而难以有效行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(figurative) Seriously limited or prevented from acting effectively.","zh":"（比喻）受到严重限制；被束缚得难以有效行动。"},"examples":[{"en":"The project was hamstrung by a lack of funding.","zh":"这个项目因缺乏资金而受到严重限制。"},{"en":"Without clear rules, the team felt hamstrung and couldn’t move forward.","zh":"没有明确的规则，团队觉得束手束脚，无法推进。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “hamstring”: to injure or cripple by cutting or damaging the hamstring; by extension, to cripple someone’s efforts.","zh":"“hamstring”的过去式/过去分词：割断或损伤腿后腱使其瘸/无法行动；引申为使（行动/努力）受挫或瘫痪。"},"examples":[{"en":"The runner was hamstrung in the final stretch and had to stop.","zh":"那位跑者在最后冲刺时腿后腱受伤，不得不停止。"},{"en":"New regulations hamstrung small businesses overnight.","zh":"新规让小企业一夜之间举步维艰。"}]}],"synonyms":["hindered","crippled","restricted","constrained","held back"],"phonetic":"/ˈhæmstrʌŋ/","extraExplanation":["“hamstring”原指大腿后侧的肌腱（腿后腱）。早期字面意思是“割断腿后腱使其无法奔跑”，后来常用作比喻：因为缺钱、缺人、规则/流程复杂等原因而“施展不开、动弹不得”。在新闻、商业、政治语境里很常见。"]}
{"word":"hamular","summary":{"en":"Hamular means “hook-shaped” or “related to a small hook-like anatomical structure.”","zh":"hamular 指“钩状的”，或“与解剖学中小钩状结构有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hook-shaped; relating to a small hook-like part in the body (especially in anatomy).","zh":"钩状的；（解剖学）与身体中小的“钩状突起/钩状结构”有关的。"},"examples":[{"en":"The dentist examined the hamular notch behind the upper jaw.","zh":"牙医检查了上颌后方的翼钩切迹（hamular notch）。"},{"en":"Pain near the hamular process can affect swallowing and speech.","zh":"翼钩突附近的疼痛可能会影响吞咽和发音。"}]}],"synonyms":["hook-shaped","uncinate","hamate"],"phonetic":"/ˈhæm.jə.lɚ/","extraExplanation":["“hamular”来自拉丁语 hamulus（“小钩子”），常见于解剖与牙科术语中。最常指蝶骨翼突末端的“翼钩”（hamulus）相关结构，如 hamular notch（翼钩切迹）和 hamular process（翼钩突）。","记忆法：hamular = 像“hook（钩子）”一样的；和 hamate（钩状骨/钩状的）在词源和形状意义上也很接近。"]}
{"word":"hamulate","summary":{"en":"Hamulate means “hook-shaped” or “having small hooks,” often used in scientific descriptions.","zh":"hamulate 表示“钩状的/带小钩的”，常用于科学或生物学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hook-shaped; having small hooks or a hooked tip.","zh":"钩状的；带小钩的；末端呈钩形的。"},"examples":[{"en":"Some climbing plants have hamulate hairs that help them cling to surfaces.","zh":"一些攀援植物有钩状毛，能帮助它们附着在表面。"},{"en":"The scientist described the insect’s hamulate claws in the report.","zh":"科学家在报告中描述了这种昆虫钩状的爪。"}]}],"synonyms":["hooked","hook-shaped","hamate","uncinate"],"phonetic":"/ˈhæm.jə.leɪt/","extraExplanation":["“hamulate”较常见于生物学、植物学或解剖学描写，语气偏学术，不太用于日常口语。","词源来自拉丁语 hamulus（“小钩”），与 hamate（钩状的）同源；记忆法：ham- 可联想到“hook（钩子）”的形状概念。"]}
{"word":"hamule","summary":{"en":"Hamule means a small hook-like structure, mainly used in scientific contexts.","zh":"Hamule 指“小钩/钩状小结构”，多用于科学（生物）语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hook or hooked part, especially in biology (e.g., a tiny hook on a plant, insect, or anatomical structure).","zh":"（尤指生物学中）小钩；钩状小结构（如植物、昆虫或解剖结构上的微小钩状部分）。"},"examples":[{"en":"Some climbing plants use hamules to catch onto nearby branches.","zh":"一些攀援植物会用小钩（hamules）勾住附近的树枝。"},{"en":"Under a microscope, the insect’s wing edges can show minute hamules.","zh":"在显微镜下，昆虫翅缘可能能看到极细小的钩状结构（hamules）。"}]}],"synonyms":["hooklet","small hook","barb (in some contexts)"],"phonetic":"/ˈhæm.juːl/","extraExplanation":["“hamule”较少用于日常英语，常见于植物学、昆虫学、解剖学等专业语境。","词源与拉丁语有关，含义与“钩子”相关；复数常写作“hamuli”。","如果你是想表达“handle（把手/处理）”或“hamlet（小村庄/哈姆雷特）”，也可能是拼写误差；告诉我上下文我可以帮你确认。"]}
{"word":"hamuli","summary":{"en":"Hamuli are tiny hook-like structures—most commonly the hooks on bee/wasp hind wings that link the wings together in flight.","zh":"Hamuli 指微小的钩状结构；最常见是蜜蜂/黄蜂等后翅上的小钩，用于飞行时把两对翅连接起来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small hook-shaped structures, especially the tiny hooks on the front edge of a bee/wasp’s hind wings that latch onto the forewings during flight","zh":"小钩状结构；尤指蜜蜂/黄蜂等后翅前缘的一排小钩，用来在飞行时把后翅与前翅扣在一起"},"examples":[{"en":"Bees use hamuli to couple their forewings and hind wings while flying.","zh":"蜜蜂利用 hamuli 在飞行时把前翅和后翅连接在一起。"},{"en":"Under the microscope, the hamuli look like a neat row of tiny hooks.","zh":"在显微镜下，hamuli 看起来像一排整齐的微小钩子。"}]},{"partOfSpeech":"n.","definition":{"en":"hook-like parts in anatomy (rare), such as small hooked processes in the body","zh":"（较少见）解剖学中的钩状小突起/钩状结构"},"examples":[{"en":"The paper mentions hamuli as small hook-like projections in the specimen.","zh":"论文提到该标本存在一些钩状小突起（hamuli）。"}]}],"synonyms":["hooks","tiny hooks","wing hooks"],"phonetic":"/ˈhæm.jə.laɪ/","extraExplanation":["hamuli 是拉丁语 hamulus（“小钩子”）的复数形式，单数是 hamulus。","在膜翅目昆虫（如蜜蜂、黄蜂、蚂蚁的有翅型）中，hamuli 是一个很重要的结构：后翅前缘的钩子会“扣住”前翅后缘的折叠处，使两对翅在飞行时像一对更大的翅一样协同运动，提高效率与稳定性。"]}
{"word":"hamulites","summary":{"en":"Hamulites are hook-shaped fossil ammonites (extinct marine animals), often mentioned in paleontology and geology.","zh":"Hamulites 指钩状外形的菊石化石（已灭绝的海洋动物），多见于古生物学与地质学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of extinct marine animal (a heteromorph ammonite) known from spiral or hook-shaped fossils; the plural form is often used when talking about multiple fossils or species in this group","zh":"一种已灭绝的海洋动物（异形菊石的一类），以螺旋状或钩状化石闻名；常用复数形式表示多个化石或该类群的不同种"},"examples":[{"en":"The museum displayed several hamulites fossils from the Cretaceous period.","zh":"博物馆展出了几块白垩纪时期的 hamulites（钩形菊石）化石。"},{"en":"Researchers compared the shell shapes of hamulites to other ammonites.","zh":"研究人员将 hamulites 的壳形与其他菊石进行了比较。"}]}],"synonyms":["ammonites","heteromorph ammonites","ammonite fossils"],"phonetic":"/ˈhæmjəˌlaɪts/","extraExplanation":["“Hamulites”来自拉丁语词根 hamulus（小钩），指这类菊石常见的“钩状/弯曲”外形。日常英语里很少用到，更多出现在古生物学、地质学或博物馆说明文字中。","写作时如果指“一个化石/一个个体”，常见单数是 hamulite；指多个则用 hamulites。"]}
{"word":"hamulose","summary":{"en":"Hamulose means “having small hooks; hook-shaped,” mainly in scientific descriptions.","zh":"hamulose 意为“带小钩的；钩状的”，主要用于科学/生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small hooks; hook-shaped (often used in botany/zoology to describe hairs, bristles, or structures that curve like tiny hooks).","zh":"有小钩的；呈钩状的（常用于植物学/动物学，形容毛、刺或结构像小钩一样弯曲）。"},"examples":[{"en":"The seeds have hamulose hairs that catch on animal fur and spread to new areas.","zh":"这些种子带有钩状细毛，会挂在动物毛皮上，从而传播到新的地方。"},{"en":"Under the microscope, the plant’s surface looks hamulose rather than smooth.","zh":"在显微镜下，这株植物的表面看起来是钩状的，而不是光滑的。"}]}],"synonyms":["hooked","hamulate","uncinate"],"phonetic":"/ˈhæm.jəˌloʊs/","extraExplanation":["“hamulose”源自拉丁语 hamulus（“小钩”），与 hamulate、uncinate（也表示“钩状的”）意义相近。它多见于学术或说明性文本，日常英语更常用 hooked（有钩的）来表达。"]}
{"word":"hamulous","summary":{"en":"Hamulous means “hook-shaped” or “having small hooks,” often used in scientific descriptions.","zh":"hamulous 指“钩状的/带小钩的”，常见于科学或生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hook-shaped; having small hooks or a hooked tip.","zh":"钩状的；带小钩的；末端弯成钩的。"},"examples":[{"en":"Some plants have hamulous hairs that help them cling to clothing or animal fur.","zh":"有些植物有钩状的毛，能帮助它们粘在衣服或动物毛皮上。"},{"en":"Under the microscope, the edge looked hamulous rather than smooth.","zh":"在显微镜下，边缘看起来是钩状的，而不是光滑的。"}]}],"synonyms":["hooked","hooklike","uncinate","curved"],"phonetic":"/ˈhæmjələs/","extraExplanation":["词源：来自拉丁语 *hamulus*（“小钩子”），与 *hamus*（“钩”）同源。因此 *hamulous* 常用于植物学、动物学或解剖学等描述“带钩结构”的语境。"]}
{"word":"hamulus","summary":{"en":"Hamul​us means a small hook-like anatomical structure, often a hook-shaped part of a bone.","zh":"hamulus 指解剖学中的小钩状结构，常见于骨头上的钩形突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small hook-like structure in the body, especially in anatomy (for example, a hook-shaped part of a bone).","zh":"（解剖）体内一种小的“钩状”结构，尤指骨头上的钩形突起等。"},"examples":[{"en":"The doctor pointed to the hamulus on the skull diagram.","zh":"医生在颅骨示意图上指给我看那个钩突（hamulus）。"},{"en":"Some muscles attach near the pterygoid hamulus.","zh":"有些肌肉会附着在翼突钩（pterygoid hamulus）附近。"}]}],"synonyms":["hooklet","hook-like process","uncinate process (similar idea in anatomy)"],"phonetic":"/ˈhæm.jə.ləs/","extraExplanation":["“Hamul-”这个词根来自拉丁语 hamulus（意为“小钩子”，源自 hamus “钩子”）。因此在医学/生物学词汇里，看到 hamulus / hamular 通常都和“钩状结构”有关。","常见搭配：pterygoid hamulus（翼突钩，位于蝶骨附近）、hamular process（钩突）。这些词多见于解剖学、牙科与耳鼻喉相关语境。","发音提示：重音通常在第一个音节：HAM-yuh-luhs。"]}
{"word":"hamus","summary":{"en":"“Hamus” is usually a misspelling of “hummus,” a chickpea-based Middle Eastern dip or spread.","zh":"“hamus”通常是“hummus”的误拼，指用鹰嘴豆为主制成的中东蘸酱/抹酱（鹰嘴豆泥）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Middle Eastern dip or spread made mainly from cooked, mashed chickpeas, often mixed with tahini (sesame paste), lemon juice, garlic, and olive oil.","zh":"一种中东地区常见的蘸酱/抹酱，主要由熟鹰嘴豆捣碎制成，常加入芝麻酱（tahini）、柠檬汁、大蒜和橄榄油。"},"examples":[{"en":"I bought hummus and pita bread for lunch.","zh":"我买了鹰嘴豆泥和皮塔饼当午餐。"},{"en":"This hummus is really garlicky.","zh":"这款鹰嘴豆泥蒜味很浓。"},{"en":"You can use hummus as a spread in a sandwich.","zh":"你可以把鹰嘴豆泥当作三明治里的抹酱。"}]}],"synonyms":["chickpea dip","chickpea spread"],"phonetic":"/ˈhʊm.əs/","extraExplanation":["“hamus”在英语里不太常见，很多时候是把“hummus”拼错或少写了一个字母的写法；标准拼法更常见的是“hummus”。","hummus 常见于黎凡特与地中海饮食文化，在英语国家也很流行，超市里经常能买到不同口味（如 roasted red pepper hummus、spicy hummus）。"]}
{"word":"hamza","summary":{"en":"Hamza is the Arabic symbol ء used to show a glottal stop sound in writing.","zh":"Hamza 是阿拉伯语中的符号/字母“ء”，用于在书写中表示喉塞音（顿挫的断音）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Arabic writing) the letter/diacritic ء that represents a glottal stop sound (a brief catch in the throat), often written on or near another letter such as ا, و, or ي.","zh":"（阿拉伯语书写中）hamza（ء）：表示“喉塞音”（喉咙里短促的停顿/顿挫）的字母或符号，常写在或写在接近其他字母上，如 ا、و、ي。"},"examples":[{"en":"The word “Qur’an” includes a hamza that marks a glottal stop.","zh":"“Qur’an（古兰经）”这个词里有一个 hamza，用来标示喉塞音。"},{"en":"In Arabic spelling, a hamza may be written on an alif, a waw, or a ya.","zh":"在阿拉伯语拼写中，hamza 可能写在 alif（ا）、waw（و）或 ya（ي）上。"}]}],"synonyms":["glottal stop","ء"],"phonetic":"/ˈhɑmzə/","extraExplanation":["Hamza（ء）在阿拉伯语及一些使用阿拉伯字母的语言（如波斯语、乌尔都语）里很常见。它表示的“喉塞音”在英语里也能听到：比如口语里把“uh-oh”分成两段时，中间那一下短暂停顿就类似喉塞音。","书写上常见的说法是“hamza seat（承载位/座位）”，指 hamza 依附在哪个字母上（如 أ/ؤ/ئ），选择规则与相邻元音有关。初学者通常先把它理解成“用来写出一个断音/顿音的符号”就够用了。"]}
{"word":"hamzah","summary":{"en":"Hamzah is an Arabic sign/letter used to show the glottal stop sound.","zh":"Hamzah 是阿拉伯文字中用来表示“喉塞音”的符号/字母。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sign/letter in Arabic writing that represents a glottal stop sound (like the brief catch in the throat in “uh-oh”).","zh":"阿拉伯文字中的符号/字母，表示“喉塞音”（类似英语“uh-oh”中间那一下喉头的顿挫）。"},"examples":[{"en":"In Arabic, the hamzah can change the meaning of a word by adding a glottal stop.","zh":"在阿拉伯语里，hamzah（哈姆扎）可以通过加入喉塞音来改变词义。"},{"en":"The word is written with a hamzah on an alif.","zh":"这个词写作时，hamzah 标在 alif（阿里夫/长音a的字母）上。"}]},{"partOfSpeech":"n.","definition":{"en":"The glottal stop sound itself in Arabic (the consonant sound written by the hamzah).","zh":"阿拉伯语中的喉塞音本身（由 hamzah 这个符号所记录的辅音）。"},"examples":[{"en":"Some learners find the hamzah difficult to pronounce at first.","zh":"一些学习者一开始觉得 hamzah（喉塞音）比较难发。"}]}],"synonyms":["hamza"],"phonetic":"/ˈhɑːmzə/","extraExplanation":["英语里更常见的拼写是 hamza；hamzah 属于较贴近阿拉伯语原词的转写（末尾 -h 常用来提示原词以“tā’ marbūṭa/ة”或类似的词尾形式出现，但不同体系会有差异）。","在阿拉伯正字法中，hamzah 常“坐”在不同“载体”上，比如 أ (在 alif 上)、ؤ (在 wāw 上)、ئ (在 yā’ 上)，具体写法与元音环境有关；有时也会写在“独立形”的 ء 上。"]}
{"word":"hamzahs","summary":{"en":"Hamzahs are instances of the Arabic letter hamzah (ء), marking a glottal stop.","zh":"Hamzahs 指阿拉伯字母 hamzah（ء）的复数，用来标示喉塞音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Arabic letter ء that represents a glottal stop sound (a brief pause in the throat, like the sound in the middle of “uh-oh”)","zh":"阿拉伯字母“hamzah（ء）”，表示喉塞音（喉咙里短暂停顿的声音，类似英语“uh-oh”中间的停顿）"},"examples":[{"en":"In Arabic spelling, a hamzah can appear on top of an alif (أ) or under it (إ).","zh":"在阿拉伯语拼写中，hamzah 可以出现在 alif（ا）上方（أ）或下方（إ）。"},{"en":"The word “Qur’an” is often written with a hamzah to show the glottal stop.","zh":"“Qur’an（古兰经）”常用 hamzah 来标出喉塞音。"}]}],"synonyms":["glottal stop (sound)","hamza (variant plural/form)"],"phonetic":"/ˈhɑmzə/","extraExplanation":["“Hamzah”的复数可以写作 hamzahs（也常见 hamzas）。它不是英语本身的字母，而是阿拉伯文字系统里的符号/字母，用来表示一个具体的发音：喉塞音。","Hamzah 的书写位置会随拼写规则变化：它可能“坐”在 alif（أ/إ）、waw（ؤ）、ya（ئ）上，或独立写作（ء）。学习者常把它和“alif（ا）”混淆：alif 多表示长元音/承载位置，而 hamzah 表示喉塞音这个辅音。"]}
{"word":"hamzas","summary":{"en":"“Hamzas” most commonly means more than one hamza—the Arabic sign/letter ء for the glottal stop; it can also mean multiple people named Hamza.","zh":"“Hamzas”最常见指多个 hamza——阿拉伯语表示喉塞音的符号/字母 ء；也可指多位名叫 Hamza 的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hamza: a sign/letter in Arabic (ء) that represents a glottal stop sound (a brief “catch” in the throat).","zh":"hamza 的复数：阿拉伯语中的符号/字母（ء），表示“喉塞音”（喉咙里短暂的“卡顿”）。"},"examples":[{"en":"This word has two hamzas, one at the beginning and one in the middle.","zh":"这个词里有两个 hamza，一个在开头，一个在中间。"},{"en":"In Arabic spelling, hamzas can be written in different positions depending on the vowel.","zh":"在阿拉伯语拼写中，hamza 会根据元音不同而写在不同的位置。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of Hamza (a common Arabic personal name).","zh":"Hamza（常见阿拉伯人名）的复数形式（指多位名叫 Hamza 的人）。"},"examples":[{"en":"There are three Hamzas in our class, so the teacher uses last names too.","zh":"我们班有三位叫 Hamza 的同学，所以老师也会用姓来区分。"}]}],"synonyms":["glottal stop (sound)","Arabic hamza (ء)"],"phonetic":"/ˈhɑmzəz/","extraExplanation":["hamza（ء）在阿拉伯语里既可被视为一个“字母”，也常被当作“符号/拼写标记”来讲；学习时重点是它表示的喉塞音（类似英语口语里 uh-oh 中间那一下停顿）。","hamza 的写法会“坐”在不同载体上（如 أ, إ, ؤ, ئ 或独立的 ء），通常与前后元音（a/i/u）及拼写规则有关。"]}

