{"word":"hao","summary":{"en":"“Hao” is most commonly a romanized Chinese name (surname or given name). In pinyin, “hao” often stands for “hǎo” (“good”) when tone marks are omitted.","zh":"“Hao”最常见是中文姓名的拼音拼写（姓或名）。在拼音中，不标声调的“hao”常用来代指“hǎo（好）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese family name (surname) written as “Hao” in pinyin/romanization.","zh":"中文姓氏之一，拼音/罗马字写作“Hao”。"},"examples":[{"en":"Professor Hao will speak at the conference tomorrow.","zh":"郝教授明天会在会议上发言。"},{"en":"My classmate’s last name is Hao.","zh":"我同学的姓是郝。"}]},{"partOfSpeech":"n.","definition":{"en":"a Chinese given name spelled “Hao” in pinyin (the meaning depends on the Chinese character, such as 豪, 浩, 昊, etc.).","zh":"中文名字用拼音拼作“Hao”（具体含义取决于所用汉字，如“豪、浩、昊”等）。"},"examples":[{"en":"His first name is Hao, spelled H-A-O.","zh":"他的名字叫Hao，拼作 H-A-O。"},{"en":"Hao chose an English name for work, but he still uses Hao with family.","zh":"Hao在工作中取了英文名，但在家人面前仍用Hao。"}]},{"partOfSpeech":"other","definition":{"en":"in pinyin, “hao” can represent the Mandarin syllable “hǎo,” meaning “good” (tone marks are often omitted in casual typing).","zh":"在拼音中，“hao”可以表示普通话音节“hǎo”，意思是“好”（日常输入常省略声调）。"},"examples":[{"en":"In pinyin, “hao” without a tone mark is often meant as “hǎo” (good).","zh":"在拼音里，不标声调的“hao”常常指“hǎo（好）”。"},{"en":"She texted “hao” to mean “OK / good,” though the correct form is “hǎo.”","zh":"她发“hao”表示“好/OK”，但更规范的写法是“hǎo”。"}]}],"phonetic":"/haʊ/","extraExplanation":["在英语语境里，“Hao”通常是人名的拼写（姓或名），读音常被英语使用者读成类似“how”。如果是在学中文或用拼音输入，“hao”是否表示“好”需要看上下文与声调：hǎo（好）、hào（号/好号等）等都可能写成“hao”。"]}
{"word":"Hao Tian","summary":{"en":"a Chinese name in pinyin; meaning depends on the characters used","zh":"汉语拼音形式的中文人名；含义取决于具体用字"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Chinese personal name written in pinyin, often used as a given name or full name.","zh":"用汉语拼音书写的中文人名，常用作名字或姓名。"},"examples":[{"en":"Hao Tian introduced himself at the meeting.","zh":"郝天在会议上做了自我介绍。"},{"en":"Please write Hao Tian’s name in pinyin on the form.","zh":"请在表格上用拼音写下郝天的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"In Chinese-name meaning, it commonly combines ideas like “good” (hao) and “sky/heaven” (tian), depending on the chosen characters.","zh":"在中文姓名含义中，常组合出类似“好/浩/豪（hao）”与“天（tian）”的意象，如“美好”“浩大”“天空/天命”等，具体取决于所用汉字。"},"examples":[{"en":"The parents chose the name Hao Tian to express a wish for a bright, open future.","zh":"父母取名“浩天”，寄托了对孩子前程光明、胸怀开阔的期望。"},{"en":"Different characters can share the same pinyin, so Hao Tian can have different meanings.","zh":"同音不同字很常见，所以“Hào Tiān/Hǎo Tiān”可能有不同含义。"}]}],"phonetic":"/haʊ tjɛn/","extraExplanation":["拼音不标声调时（如“Hao Tian”），无法确定准确读音与含义；例如“hào tiān（浩天/昊天）”“hǎo tiān（好天）”等都可能。","在英文语境里，它通常被当作专有名词（人名）使用；书写时常首字母大写。","如果你想更准确的释义与读音，请提供对应汉字（例如：郝天/浩天/昊天/好天）。"],"etymology":"“Hao Tian”是汉语拼音的拉丁字母转写形式，并非单一固定的英文词源；其含义来自所对应的汉字。常见的“hao”可能对应“好/浩/豪/昊/皓”等，“tian”常对应“天”。","mnemonic":["记忆法：把“hao”联想成英语 how /haʊ/（发音接近），把“tian”联想成“天空/天”。"]}
{"word":"haole","summary":{"en":"“Haole” is a Hawaiian English word for a white person or a non-native/foreigner in Hawaiʻi; it can be neutral or insulting depending on context.","zh":"“haole”是夏威夷英语里指白人或非夏威夷原住民的外来者/居民的词；语境不同可中性也可带侮辱性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a term in Hawaiian English for a white person or non-native resident/foreigner in Hawaiʻi; sometimes neutral, sometimes insulting depending on tone and context","zh":"夏威夷英语中的词，指白人或非夏威夷原住民的外来者/居民；语气与语境不同，可能中性也可能带侮辱性"},"examples":[{"en":"He moved to Hawaiʻi last year, so some locals still see him as a haole.","zh":"他去年搬到夏威夷，所以一些当地人仍把他看作外来白人/外来者。"},{"en":"She asked respectfully what “haole” means because she heard it in a movie.","zh":"她很礼貌地问“haole”是什么意思，因为她在电影里听到过。"},{"en":"In that argument, the word was used as an insult.","zh":"在那场争吵里，这个词被当作侮辱来用。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing someone as a haole (white or non-native in Hawaiʻi)","zh":"形容某人是“haole”（在夏威夷语境下的白人或非本地人/外来者）"},"examples":[{"en":"He’s a haole kid who grew up on Oʻahu.","zh":"他是在瓦胡岛长大的白人孩子。"},{"en":"They described the newcomers as haole tourists.","zh":"他们把新来的游客形容为外来的白人游客。"}]}],"synonyms":["foreigner","non-local","outsider"],"phonetic":"/ˈhaʊli/","extraExplanation":["“haole”来自夏威夷语，常被解释为“没有（hā）呼吸（ʻole）”，与早期文化接触时的礼节传说有关；不过其确切词源与民间说法在不同资料中有差异。","在日常使用里，它既可能只是“非本地/白人”的描述，也可能带有排斥或贬义。是否冒犯通常取决于说话者关系、语气、场合以及你是否自称或称呼他人。学习者在公开场合最好谨慎使用，必要时用更中性的说法（如“visitor/foreigner/non-local”）。"]}
{"word":"haoles","summary":{"en":"“haoles” is not standard English; it’s likely a typo (often “holes”) or pinyin (“hao le,” meaning “okay/all set”).","zh":"“haoles”不是标准英语；更可能是拼写错误（常见为“holes”）或拼音（“hao le”，表示“好了/可以了”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. In English contexts, it is most likely a typo/misspelling (often of “holes”), a username, or a romanization of Chinese (e.g., “hao le,” meaning “okay/finished”).","zh":"不是标准英语单词。在英语语境中，它更可能是拼写错误（常见是把“holes”写错）、用户名，或中文拼音（如“hao le”，表示“好了/结束了/可以了”）。"},"examples":[{"en":"“Haoles” isn’t an English word—did you mean “holes”?","zh":"“haoles”不是英语单词——你是不是想写“holes（洞/孔）”？"},{"en":"If you meant Chinese “hao le,” you could translate it as “Okay” or “All set.”","zh":"如果你指的是中文“hao le（好了）”，可以译为“Okay（好/行）”或“All set（都弄好了）”。"}]}],"synonyms":["holes (if that’s what you meant)","okay (if you meant “hao le”)","all set (if you meant “hao le”)"],"phonetic":"/hɑˈloʊlz/","extraExplanation":["在英文聊天或作业里，如果你想表达“洞/孔”，正确拼写通常是 holes。","如果你是在用拼音表达“好了”，更常见的写法会是 hao le，或直接写中文“好了”。","也可能是专有名词（网名/游戏ID/地名等）；这种情况下通常不需要“翻译”，而是看它在句子里的用途。"]}
{"word":"haoma","summary":{"en":"“Haoma” is pinyin for Chinese 号码 (hào mǎ): an identifying number (phone number, code, ID, or sometimes size).","zh":"“haoma”是中文“号码（hào mǎ）”的拼音：指用于识别的编号（电话、验证码、ID等），有时也指尺码。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chinese pinyin) “haoma” usually refers to the Chinese word 号码 (hào mǎ), meaning a number used to identify something (like a phone number, account number, ticket number, or a clothing/shoe size). In natural English, you usually say “number,” “phone number,” “code,” or “size,” depending on context.","zh":"（中文拼音）“haoma”通常指中文“号码（hào mǎ）”，意思是用于识别事物的编号（如手机号、账号、票号），有时也指衣服/鞋子的尺码。英语中一般根据语境说“number / phone number / code / size”。"},"examples":[{"en":"What’s your phone number? (Chinese: Nǐ de haoma shì duōshao?)","zh":"你的手机号是多少？（拼音：Nǐ de haoma shì duōshao?）"},{"en":"Please enter your ticket number / code.","zh":"请输入你的票号/验证码。"},{"en":"What size do you wear? (In Chinese you may hear: nǐ chuān jǐ hào ma?)","zh":"你穿多大码？（中文里也会说：你穿几号码？）"}]}],"synonyms":["number","phone number","code","ID number","size"],"phonetic":"/ˈhaʊmə/","extraExplanation":["“号码（hào mǎ）”在中文里用得很广：手机号、工号、房间号、订单号、账号等都可以叫“号码”。但英语里通常会更具体：phone number（电话号码）、account number（账号）、room number（房间号）、order number（订单号）、verification code（验证码）等。"]}
{"word":"haori","summary":{"en":"Haori is a traditional Japanese jacket worn over a kimono.","zh":"Haori（羽织）是穿在和服外面的日本传统短外套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Japanese hip-length jacket worn over a kimono, often for warmth or formality","zh":"日本传统短外套（及臀长度），穿在和服外面，常用于保暖或增加正式感"},"examples":[{"en":"She wore a haori over her kimono at the ceremony.","zh":"仪式上她在和服外面穿了一件羽织（haori）。"},{"en":"In some shops, you can try on a haori like a light jacket.","zh":"在一些店里，你可以把羽织当作轻便外套试穿。"}]}],"synonyms":["kimono jacket","Japanese jacket"],"phonetic":"/haʊˈɔːri/","extraExplanation":["“羽织（haori）”原本多与正式场合、外出穿着有关，常搭配“羽织纽（haori himo）”系带；现代也常被当作和风外套与日常服装混搭。","在英文语境里，haori 通常直接用日语外来词表示；也有人用解释性的说法如 “kimono jacket”。"]}
{"word":"haoris","summary":{"en":"“Haoris” means traditional Japanese jackets worn over a kimono; it’s the plural of “haori.”","zh":"“haoris”指穿在和服外面的日本传统短外套，是“haori”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Japanese hip-length jacket worn over a kimono (\"haoris\" is the plural form).","zh":"日本传统短外套，通常穿在和服外面（“haoris”是复数形式）。"},"examples":[{"en":"At the festival, some people wore haoris over their kimonos.","zh":"在节日上，有些人把羽织（haoris）穿在和服外面。"},{"en":"The museum display included several silk haoris from the Edo period.","zh":"博物馆展柜里有几件江户时代的丝质羽织（haoris）。"}]}],"synonyms":["haori","kimono jacket","Japanese jacket"],"phonetic":"hɑˈɔri","extraExplanation":["“羽织（haori）”原本多见于日本传统服饰体系中，可用于正式或日常场合；现代也常被改良为“和风外套”，搭配衬衫、牛仔裤等。","英语里有时会直接借用日语词“haori”，复数通常加 -s 变成 “haoris”。如果你本来想查的是别的词（例如人名 Harris、或单词 horrors），告诉我上下文句子，我可以帮你确认。"]}

