{"word":"hap","summary":{"en":"“Hap” is an old-fashioned word meaning “chance/luck,” and it can also mean “to happen.”","zh":"“hap”是较古老的词，表示“偶然/运气”，也可作动词表示“发生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Literary/old-fashioned) Chance or luck; something that happens by accident rather than by plan.","zh":"（文学/古语）偶然；运气；无意中发生的事。"},"examples":[{"en":"By hap, I met my old teacher at the station.","zh":"偶然地，我在车站遇到了以前的老师。"},{"en":"It was sheer hap that saved them from the storm.","zh":"完全是运气让他们躲过了那场暴风雨。"}]},{"partOfSpeech":"v.","definition":{"en":"(Old-fashioned) To happen; to occur (often used as “it haps” or “hap to”).","zh":"（古语）发生；出现（常见用法如“it haps”或“hap to”）。"},"examples":[{"en":"It so haps that we arrived on the same day.","zh":"碰巧我们在同一天到达。"},{"en":"If you hap to see him, please tell him to call me.","zh":"如果你碰巧见到他，请告诉他给我打电话。"}]}],"synonyms":["chance","luck","fortune","accident","happen (archaic sense)"],"phonetic":"/hæp/","extraExplanation":["“hap”在现代英语中很少单独使用，多见于文学或仿古语体。它和“happen”同源，也常出现在派生词里：hapless（不幸的）、mishap（不幸/小事故）。","词源上，“perhaps”原本可理解为“per + haps”（按偶然/也许）；了解这一点有助于记忆“perhaps=也许”。","在莎士比亚等古典作品中更容易见到“hap”或固定搭配“by hap”（偶然地）。"]}
{"word":"hapale","summary":{"en":"“hapale” is not a standard English word; it’s likely a misspelling or a name/foreign word.","zh":"“hapale”不是标准英语单词；更可能是拼写错误或专有名词/外来语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a word from another language/name. If you tell me the sentence you saw it in, I can identify the intended word.","zh":"不是标准英语单词，更可能是拼写错误、外来语或人名/地名。你如果提供它出现的句子，我可以帮你判断想表达的词。"},"examples":[{"en":"I couldn’t find “hapale” in an English dictionary—could you share the full sentence?","zh":"我在英语词典里查不到“hapale”——你能把完整句子发我吗？"},{"en":"Did you mean “hapless” (unlucky) or “hale” (healthy and strong)?","zh":"你是不是想写“hapless”（不幸的）或“hale”（健康强壮的）？"}]}],"extraExplanation":["“hapale”在常用英语中不作为独立词条出现，最常见的情况是拼写接近的词被写错了。可能的目标词（需结合语境确认）包括：\n- hapless（不幸的、倒霉的）\n- haphazard（杂乱的、随意的）\n- hale（健康的、强壮的）\n如果你把它所在的句子或上下文贴出来，我可以更准确地给出词义、发音和用法。"]}
{"word":"hapalidae","summary":{"en":"Hapalidae is an old scientific family name for marmosets and tamarins, now usually replaced by Callitrichidae.","zh":"Hapalidae 是狨猴和绒猴的旧科名，如今通常用 Callitrichidae（狨科）取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, outdated) A former scientific family name for marmosets and tamarins; now usually classified as the family Callitrichidae.","zh":"（动物学，旧称）狨猴和绒猴（狨类、绒猴类）曾使用的科名；现多归入狨科（Callitrichidae）。"},"examples":[{"en":"In older zoology books, marmosets were sometimes placed in the family Hapalidae.","zh":"在一些较早的动物学书籍里，狨猴有时被归入“Hapalidae（狨猴科）”。"},{"en":"Modern taxonomy usually treats Hapalidae as a synonym of Callitrichidae.","zh":"现代分类学通常把 Hapalidae 视为 Callitrichidae（狨科）的同义旧名。"}]}],"synonyms":["Callitrichidae","marmosets","tamarins"],"phonetic":"/ˌhæpəˈlaɪdiː/","extraExplanation":["Hapalidae 是拉丁化的分类名称，常见于19世纪至20世纪早期的文献；如今多不再作为有效科名使用。","如果你在野生动物或科普书里遇到 Hapalidae，可以把它理解为“狨猴/绒猴这一支灵长类”的旧分类叫法。"]}
{"word":"hapalote","summary":{"en":"Hapalote is a rare word in English, usually referring to a traditional Mexican maize (corn) variety (also spelled “japalote”).","zh":"Hapalote 在英语里很少见，通常指一种墨西哥传统玉米（也可写作 “japalote”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Mexican variety (landrace) of maize (corn), especially associated with southern Mexico; also spelled “japalote.”","zh":"一种墨西哥传统玉米（地方品种/原生品种），常见于墨西哥南部；也可拼作“japalote”。"},"examples":[{"en":"Researchers compared hapalote maize with modern hybrids to study drought tolerance.","zh":"研究人员将 hapalote 玉米与现代杂交品种比较，以研究其抗旱性。"},{"en":"Some farmers still plant hapalote because it is well adapted to local soils.","zh":"一些农民仍然种植 hapalote，因为它很适应当地土壤。"}]}],"synonyms":["maize","corn","landrace (context-specific)"],"phonetic":"/ˌhɑːpəˈloʊteɪ/","extraExplanation":["“Hapalote”在日常英语中非常少见，多出现在农业、民族植物学（ethnobotany）或关于墨西哥玉米多样性的学术语境中。","拼写有时会与“japalote”互见，可能与地区发音、转写方式（从本地语言或西班牙语转写到英语）有关。若你是在菜单、日常对话或社交媒体上看到这个词，也有可能是拼写误差，需要结合上下文确认。"]}
{"word":"hapalotis","summary":{"en":"Hapalotis is an old, mostly obsolete genus name for some Australian rodents, found mainly in older scientific texts.","zh":"Hapalotis 是一个旧的、如今多已废弃的属名，曾用于部分澳大利亚鼠类，主要出现在早期科学文献中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(taxonomy, now rare/obsolete) A former scientific genus name used in the 1800s for some Australian native rodents (small rats/mice). It is not commonly used in modern biology.","zh":"（生物分类学，现少用/已废）19世纪曾用于部分澳大利亚本土啮齿动物（小型鼠类）的旧属名；现代分类中一般不再使用。"},"examples":[{"en":"In older zoology books, you may see Australian mice listed under the genus Hapalotis.","zh":"在较早的动物学书籍里，你可能会看到澳大利亚的一些鼠类被归在 Hapalotis 这个属名下。"},{"en":"Modern field guides usually replace Hapalotis with newer genus names.","zh":"现代的野外图鉴通常会用更新的属名来取代 Hapalotis。"}]}],"synonyms":["obsolete genus name","historical taxonomic name"],"phonetic":"/ˌhæpəˈloʊtɪs/","extraExplanation":["这是一个“历史上的学名”。随着研究方法进步（形态比较、遗传证据等），许多旧的属名会被拆分、合并或改名，因此在当代文献中更常见的是更新后的属名。","词源常被解释为来自希腊语词根：hapalos（柔软的）+ -otis（与“耳”有关），大意类似“柔软耳朵的”。在旧式命名中，这类词源往往反映了早期研究者观察到的外形特征。"]}
{"word":"hapax","summary":{"en":"Hapax means a word or expression that occurs only once in a given text or corpus.","zh":"Hapax 指在某个文本或语料库中只出现一次的词或表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a word or expression that appears only once in a particular text, author’s works, or language corpus","zh":"（在特定文本、某位作者作品或语料库中）只出现一次的词或表达"},"examples":[{"en":"In the poem, “selenotropic” is a hapax—it appears only once in the entire collection.","zh":"在这首诗里，“selenotropic”是一个 hapax——它在整本诗集中只出现过一次。"},{"en":"Researchers treated the term as a hapax in the dataset, so its meaning was hard to confirm from context.","zh":"研究者把这个词当作该数据集里的 hapax，因此很难仅凭上下文确认它的含义。"}]}],"synonyms":["hapax legomenon","single-occurrence word"],"phonetic":"/ˈheɪpæks/","extraExplanation":["hapax 常见于语言学与文献学，完整说法是 **hapax legomenon**（字面意思是“只被说过一次的东西”）。遇到 hapax 时，因为缺少更多用例，学者通常会结合词源、相近词形、以及上下文来推测含义。","词源来自希腊语：**hapax** 意为“一次”，**legomenon** 与“说/被说”相关。英语学术写作里常直接把 hapax 当作简写来用。"]}
{"word":"hapaxanthous","summary":{"en":"Hapaxanthous describes a plant that flowers only once in its life and then dies.","zh":"hapaxanthous 指植物一生只开花一次，开花后（常伴随结果后）便死亡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Flowering only once in its lifetime; after flowering (and often fruiting), the plant dies.","zh":"（植物学）一生只开花一次；开花（常伴随结果）后植株死亡。"},"examples":[{"en":"Some agaves are hapaxanthous: they bloom once and then die.","zh":"有些龙舌兰是一次开花植物：开花一次后就会死亡。"},{"en":"Bamboo species can be hapaxanthous, flowering after many years and then dying back.","zh":"某些竹类可能是一生只开花一次的植物，经过多年后开花，随后枯死。"}]}],"synonyms":["semelparous","monocarpic"],"phonetic":"/ˌhæp.ækˈsæn.θəs/","extraExplanation":["词源提示：来自希腊语 hapax（“一次”）+ anthos（“花”），因此字面意思是“只开一次花”。","近义概念对比：hapaxanthous 常与 semelparous（一次繁殖）或 monocarpic（一次结果）在生物学/植物学语境中并用；日常英语里更常见的说法是 “blooms/flowers only once”。"]}
{"word":"hapaxes","summary":{"en":"Hapaxes are words or forms that occur only once in a given text or corpus.","zh":"Hapaxes 指在某一文本或语料中只出现一次的词或形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a word or form that occurs only once in a text, corpus, or set of records (plural of “hapax,” short for “hapax legomenon”)","zh":"（复数）在某一篇文本、语料库或记录中只出现一次的词或形式（hapax 的复数，源自 hapax legomenon）"},"examples":[{"en":"In this novel, there are several hapaxes that appear only once and never again.","zh":"在这部小说里，有几个 hapaxes 只出现一次，之后再也没出现。"},{"en":"Researchers removed hapaxes to reduce noise in the dataset.","zh":"研究人员去掉了 hapaxes，以减少数据集里的噪音。"}]}],"synonyms":["hapax legomena","once-occurring words","singletons"],"phonetic":"/ˈhæpækˌsiːz/","extraExplanation":["“hapax”来自希腊语，意思是“仅一次”。完整表达是 *hapax legomenon*（直译“只说/只出现过一次的东西”），在语言学、文献学、圣经研究与古典学里很常见。","在语料分析中，hapaxes 有时会被当作“罕见词/低频词”的一种极端情况：它们可能是拼写错误、专有名词、新造词，或作者的刻意用词，因此不同研究会选择保留或剔除。","常见近义表达：*once-occurring word*；相关概念：*nonce word*（临时造词）、*neologism*（新词）、*low-frequency word*（低频词）。"]}
{"word":"hapchance","summary":{"en":"Hapchance means a chance event, or happening by luck rather than by plan (often in the phrase “by hapchance”).","zh":"Hapchance 指“偶然的事/碰巧发生”，常见于短语 “by hapchance”（偶然地）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chance event; something that happens by luck rather than by plan (often used like “by happenchance”)","zh":"偶然发生的事；碰巧（非计划）发生的情况（常用于 “by happenchance/ by hapchance”）"},"examples":[{"en":"We met by hapchance at a small café.","zh":"我们在一家小咖啡馆里偶然相遇。"},{"en":"By hapchance, she found the missing key under the sofa.","zh":"她碰巧在沙发下面找到了丢失的钥匙。"}]},{"partOfSpeech":"adv.","definition":{"en":"by chance; accidentally (a less common, more literary use)","zh":"偶然地；碰巧地（较少见，偏文学用法）"},"examples":[{"en":"He wandered hapchance into an old bookstore.","zh":"他偶然走进了一家旧书店。"}]}],"synonyms":["chance","accident","coincidence","happenstance"],"phonetic":"/ˈhæpˌtʃæns/","extraExplanation":["“hap”在古英语/中古英语里有“运气、命运”的意思，今天还留在一些词里：perhaps（per + haps，原意“或许、碰巧”）、mishap（不幸/小事故）。","“hapchance”现在较少见，更常用的现代词是 happenstance 或 simply by chance / accidentally。文学里用它会显得更古典、更有叙述感。"]}
{"word":"haphazard","summary":{"en":"Haphazard describes something done randomly or without a plan or system.","zh":"haphazard 用来形容做事随意、杂乱无章、缺乏计划或系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Done in a random, careless, or unplanned way, without a clear system or purpose.","zh":"（做事）杂乱无章的；随意的；缺乏计划或条理的。"},"examples":[{"en":"Her notes were haphazard, so it was hard to review for the test.","zh":"她的笔记很杂乱，所以很难用来复习考试。"},{"en":"The city grew in a haphazard way, with roads that don’t connect well.","zh":"这座城市发展得很随意，很多道路衔接得不顺畅。"},{"en":"Don’t pack haphazardly—make a list first.","zh":"别随便乱收拾——先列个清单。"}]}],"synonyms":["random","unsystematic","unplanned","disorganized","careless"],"phonetic":"/hæpˈhæzərd/","extraExplanation":["词源提示：haphazard 来自中古英语，hap 表示“偶然、运气”，hazard 表示“风险、偶然事件”。合起来有“靠运气、碰巧”的感觉，所以常用来形容“没有计划、没有条理”。","语用区别：haphazard 强调“缺少系统/规划”，不一定是故意马虎；如果要强调“粗心大意”，常用 careless / sloppy。"]}
{"word":"haphazardly","summary":{"en":"“Haphazardly” means doing something in a random, disorganized way, without planning.","zh":"“haphazardly”表示做事随意、杂乱无章，没有计划或条理。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a random, messy way, without a clear plan or order.","zh":"杂乱无章地；随意地；没有计划或顺序地。"},"examples":[{"en":"He packed his suitcase haphazardly and forgot his charger.","zh":"他胡乱地收拾行李，结果忘了带充电器。"},{"en":"The books were stacked haphazardly on the floor.","zh":"书被杂乱无章地堆在地板上。"}]}],"synonyms":["randomly","disorganizedly","unsystematically","in a scattered way"],"phonetic":"/ˌhæpˈhæzɚdli/","extraExplanation":["“haphazardly”来自“hap”（偶然、运气）+“hazard”（风险、偶然事件），带有“碰运气、听天由命”的语感。它常含轻微负面评价：不是随性有创意，而是缺乏条理、容易出错。","常见搭配：arrange/place/stack/throw together haphazardly（随意摆放/堆放/拼凑）；do something haphazardly（做事没章法）。","写作区分：randomly（随机地，中性）vs. haphazardly（杂乱无序、缺乏计划，偏负面）；carelessly（粗心地，强调态度不认真）vs. haphazardly（强调没有结构/方法）。"]}
{"word":"haphazardness","summary":{"en":"Haphazardness means a lack of planning or order—things are random and messy.","zh":"haphazardness 指缺乏计划或条理的状态，表现为随意、杂乱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being done in a random, careless, or unplanned way; lack of order or careful organization.","zh":"杂乱无章；随意性；缺乏计划或条理（的状态）"},"examples":[{"en":"The haphazardness of the files made it hard to find anything.","zh":"文件的杂乱无章让人很难找到任何东西。"},{"en":"Because of the haphazardness of the schedule, meetings often started late.","zh":"由于日程安排很随意，会议经常迟到开始。"},{"en":"He tried to reduce the haphazardness in his studying by using a weekly plan.","zh":"他通过制定每周计划，努力减少学习中的随意性。"}]}],"synonyms":["randomness","disorder","messiness","chaos","lack of organization","carelessness"],"phonetic":"/ˌhæpˈhæzɚdnəs/","extraExplanation":["“haphazardness”来自形容词“haphazard”（随意的、碰运气的）+ 名词后缀“-ness”（表示“……的状态/性质”）。整体语气通常偏负面，强调“缺乏规划、组织不良”。在写作中也常用更正式的近义表达，如“lack of coordination / poor organization / randomness”。"]}
{"word":"haphazardry","summary":{"en":"Haphazardry means randomness or a lack of planning and organization.","zh":"Haphazardry 指“随意、无计划、杂乱无章”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being random, unplanned, or done without clear order; lack of organization","zh":"杂乱无章；随意性；缺乏计划或条理的状态"},"examples":[{"en":"The haphazardry of the files made it hard to find anything.","zh":"文件的杂乱无章让人很难找到任何东西。"},{"en":"They criticized the haphazardry of the project, saying it needed a clearer plan.","zh":"他们批评这个项目太随意、没章法，说需要更清晰的计划。"}]}],"synonyms":["randomness","disorder","lack of organization","confusion","chaos"],"phonetic":"/ˈhæpˌhæzɚdri/","extraExplanation":["“haphazardry”比较少见，常见的表达通常是“haphazardness”或直接用形容词“haphazard”。它由“haphazard（偶然的、随意的）+ -ry（表示状态/性质的后缀）”构成。","语气上它带有批评意味：强调“乱、没规划、靠运气”。在正式写作中更常用“lack of organization / randomness / disorder”。"]}
{"word":"haphephobia","summary":{"en":"an intense fear of physical touch","zh":"对身体接触的强烈恐惧"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of being touched (or of touching other people), often causing strong anxiety or avoidance","zh":"对被触碰（或触碰他人）的强烈恐惧，常引发明显焦虑或回避"},"examples":[{"en":"He experiences haphephobia and may step back when someone reaches for a handshake.","zh":"他有触碰恐惧症，别人伸手要握手时他可能会后退。"},{"en":"Because of her haphephobia, crowded trains feel overwhelming.","zh":"因为触碰恐惧症，拥挤的地铁让她感到难以承受。"},{"en":"With support and therapy, some people with haphephobia learn coping strategies.","zh":"在支持和治疗下，一些触碰恐惧症患者可以学会应对策略。"}]}],"synonyms":["fear of touch","fear of being touched","touch phobia","tactile aversion"],"phonetic":"/ˌhæfəˈfoʊbiə/","extraExplanation":["这是一个较少见、偏医学/心理学语境的词，日常更常说 fear of being touched 或 fear of touch。","它描述的是持续且强烈到影响生活的恐惧与回避；不等同于单纯“不喜欢别人靠太近”。若与创伤经历、焦虑等相关，通常需要专业评估与支持。"],"etymology":"源自希腊语：haptein（“触摸、抓住”）+ -phobia（“恐惧”）。字面义就是“对触摸的恐惧”。","mnemonic":["拆开记：-phobia=“恐惧症”（如 arachnophobia 怕蜘蛛）；hap-≈“触碰”。合起来就是“怕触碰”。","联想中文：把它想成“怕（phobia）别人哈（ha）你一把（touch）”。"]}
{"word":"haphophobia","summary":{"en":"Haphophobia means an intense fear of being touched.","zh":"haphophobia 指对他人触碰的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of being touched by other people; a type of specific phobia","zh":"对他人触碰的强烈恐惧；一种特定恐惧症"},"examples":[{"en":"She has haphophobia, so she avoids handshakes and crowded places.","zh":"她有触碰恐惧症，所以会避免握手和拥挤的地方。"},{"en":"Because of his haphophobia, he asks people to keep a little distance.","zh":"因为他害怕被触碰，他会请别人保持一点距离。"}]}],"synonyms":["fear of touch","touch phobia","specific phobia (touch)","haphephobia"],"phonetic":"/ˌhæfəˈfoʊbiə/","extraExplanation":["该词常见于心理学/临床语境，也会在日常讨论中用来描述“非常害怕身体接触”的状态；但是否达到“恐惧症（phobia）”程度，通常需要看是否持续、强烈并影响生活。","词源上由希腊语根 haphe（触摸）+ -phobia（恐惧）构成。","与“germophobia（恐菌/洁癖式恐惧）”不同，haphophobia 的核心是“被触碰/身体接触”本身带来的恐惧或不适。"]}
{"word":"haphtara","summary":{"en":"A synagogue reading from the Prophets, typically following the Torah reading on Shabbat or certain holidays.","zh":"会堂里诵读的一段《先知书》经文，通常接在安息日或部分节日的《妥拉》诵读之后。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Judaism, a selection from the Prophets (Nevi’im) that is read publicly in the synagogue, usually after the Torah reading on Shabbat and some holidays.","zh":"（犹太教）“先知书诵读”：在会堂公开诵读的一段《先知书》（Nevi’im）经文，通常在安息日和部分节日的《妥拉》诵读之后进行。"},"examples":[{"en":"After the Torah reading, the congregation listened to the haftarah.","zh":"在诵读完《妥拉》之后，会众聆听了先知书诵读（haftarah）。"},{"en":"She practiced chanting the haftarah for her bat mitzvah.","zh":"她为自己的成人礼（bat mitzvah）练习吟诵先知书诵读（haftarah）。"}]}],"synonyms":["prophetic reading","Haftarah"],"phonetic":"/hɑfˈtɑrə/","extraExplanation":["拼写提示：更常见的英语拼写是 **haftarah / haftarah**（也可见 *haftara*）。你写的 **haphtara** 可能是转写差异或误拼。","文化背景：*haftarah* 的段落通常与当天《妥拉》读经主题相关（有时是呼应、有时是对照），由特定的人以传统旋律吟诵。","语用小贴士：英语里常说 **the haftarah**（带冠词），也会说 **to chant/read the haftarah**（吟诵/诵读先知书段落）。"]}
{"word":"haphtarah","summary":{"en":"A synagogue reading from the Prophets, usually after the weekly Torah reading.","zh":"会堂礼拜中在《妥拉》之后进行的《先知书》选读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A selection from the Books of the Prophets read (or chanted) publicly in a synagogue service, usually after the weekly Torah reading on Sabbaths and Jewish holidays.","zh":"（犹太教）哈夫塔拉／先知书选读：在会堂礼拜中公开诵读（或吟诵）的《先知书》选段，通常在安息日或节日的每周《妥拉》读经之后进行。"},"examples":[{"en":"After the Torah portion, the congregation listened to the haphtarah.","zh":"读完《妥拉》段落后，会众聆听了 haphtarah（先知书选读）。"},{"en":"She practiced chanting the haphtarah for her bat mitzvah.","zh":"她为自己的成人礼（bat mitzvah）练习吟诵 haphtarah。"}]}],"synonyms":["haftarah","haftara","haftarah"],"phonetic":"/ˈhɑfˌtɑrə/","extraExplanation":["这个词更常见的拼写是 **haftarah / haftarah**，你输入的 **haphtarah** 属于较少见的转写形式。","哈夫塔拉的具体经文会与当天的《妥拉》读经主题形成呼应（例如主题相似、人物或事件对应）。不同犹太社群（如阿什肯纳兹、塞法迪）在部分日子的选段上可能略有差异。","在英语中常写作 **the haftarah**（像专有名词一样），也常搭配动词 **read/chant**：read/chant the haftarah。"]}
{"word":"hapi","summary":{"en":"“Hapi” most commonly refers to the ancient Egyptian god of the Nile flood; informally, it can also be a playful misspelling of “happy.”","zh":"“Hapi”最常指古埃及的尼罗河泛滥之神；在非正式场合也可能是“happy”的俏皮/错误拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Egyptian religion) the god/personification of the Nile’s annual flood, associated with fertility and abundance.","zh":"（古埃及宗教）哈皮：尼罗河年度泛滥的神格化形象，与丰饶、生育和富足有关。"},"examples":[{"en":"In ancient Egypt, Hapi was honored because the Nile flood brought rich soil for farming.","zh":"在古埃及，人们敬奉哈皮，因为尼罗河的泛滥会带来肥沃的农田土壤。"},{"en":"Many temple images show Hapi as a symbol of abundance and nourishment.","zh":"许多神庙图像把哈皮描绘成富足与滋养的象征。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, nonstandard) a misspelling or playful spelling of “happy.”","zh":"（非正式、非标准）“happy”的拼写错误或俏皮写法。"},"examples":[{"en":"Texting example: “I’m so hapi for you!” (Standard English: “happy”)","zh":"短信例子：“I’m so hapi for you!”（标准英语应为“happy”）"},{"en":"For school or work writing, use “happy,” not “hapi.”","zh":"在学校或工作写作中要用“happy”，不要用“hapi”。"}]}],"synonyms":["(for the god) personification of the Nile flood","(for the misspelling) happy"],"phonetic":"/ˈhɑpi/","extraExplanation":["“Hapi”是一个专有名词，常见于埃及学/历史语境；在英文文章中通常首字母大写（Hapi）。","在古埃及艺术中，Hapi有时被画成体态丰腴、象征丰收的人物形象，并常与尼罗河带来的肥沃与粮食联系在一起。"]}
{"word":"Hapiru","summary":{"en":"a historical label for marginal or displaced people in the ancient Near East","zh":"古代近东对社会边缘或流离失所人群的称呼"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(historical term) A group of socially marginal, displaced, or outsider people mentioned in ancient Near Eastern texts (often spelled “Habiru/Apiru”).","zh":"（历史用语）古代近东文献中提到的一类社会边缘人群、流离失所者或“外来者”（常见拼写为 Habiru/Apiru）。"},"examples":[{"en":"Some scholars compare “Hapiru” with the term “Habiru” found in Egyptian and Mesopotamian records.","zh":"一些学者会把 “Hapiru” 与埃及和两河流域记录中的 “Habiru” 这个词进行对比。"},{"en":"In ancient letters, the Hapiru are sometimes described as people living outside normal city-state control.","zh":"在古代书信中，Hapiru 有时被描述为游离于城邦正常控制之外的人。"}]}],"synonyms":["Habiru","Apiru"],"phonetic":"/həˈpɪru/","extraExplanation":["“Hapiru” 在现代英文里不算常见标准拼写；学术写作中更常见的是 Habiru 或 Apiru。","它有时会被拿来和 “Hebrews（希伯来人）” 联系，但这种对应关系在学界存在争议：文本中该词往往更像社会阶层/身份标签，而不一定指特定民族。"],"etymology":"多被视为 “Habiru/Apiru” 的变体拼写；该词见于公元前二千纪左右的埃及、阿卡德等文献，用来指称某类社会身份/处境的人群（如雇佣兵、逃亡者、无地者等），并非单一民族名称。","mnemonic":["记忆法：把 Hapiru 想成常见写法 Habiru/Apiru 的“变体拼写”，核心意思抓住“边缘人群、游离于体制外的人”。","联想：ha- + piru 听起来像“漂/飘”（漂泊的人）——帮助记住“流离、边缘”的概念（仅作联想，不是词源）。"]}
{"word":"hapiton","summary":{"en":"“Hapiton” is not a standard English word; it is likely a misspelling of another word (e.g., “habitation,” “habit,” or “haphazard”).","zh":"“hapiton”不是标准英语单词；很可能是其他词（如“habitation”“habit”或“haphazard”）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often seen as a misspelling or typo (for example, of “habitation,” “habit,” or “haphazard”).","zh":"不是标准英语单词。最常见是拼写错误或打字错误（例如把“habitation（居住）”“habit（习惯）”或“haphazard（随意的/杂乱无章的）”拼错）。"},"examples":[{"en":"I couldn’t find “hapiton” in a dictionary—did you mean “habitation” (a place to live)?","zh":"我在词典里找不到“hapiton”——你是不是想写“habitation”（居住处）？"},{"en":"If you meant “habit,” you could say: “Studying every day is a good habit.”","zh":"如果你想写“habit”，可以说：“每天学习是个好习惯。”"}]}],"synonyms":["habit","habitation","haphazard"],"phonetic":"/ˈhæpɪtən/","extraExplanation":["“hapiton”看起来像拼写错误。你可以告诉我它出现在哪个句子里（或发一张截图），我就能更准确判断你想表达的是哪个词。","如果你想表达“居住/住所”，最可能是 habitation（更正式）或 home/house（更常用）。","如果你想表达“习惯”，用 habit；形容词是 habitual（习惯性的）。","如果你想表达“随意/缺乏计划”，可能是 haphazard。"]}
{"word":"hapl","summary":{"en":"“hapl-” is a scientific prefix meaning “single/simple,” used in genetics terms like haploid and haplotype.","zh":"“hapl-”是表示“单一/简单”的科技术语前缀，常见于 haploid（单倍体）、haplotype（单倍型）等遗传学词汇中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a scientific prefix/combining form meaning “single” or “simple,” used mainly in biology and genetics (e.g., haploid, haplotype).","zh":"（科技术语前缀/构词成分）表示“单一的、简单的”，主要用于生物学与遗传学词汇中（如 haploid、haplotype）。"},"examples":[{"en":"A haploid cell has one set of chromosomes.","zh":"单倍体（haploid）细胞只有一套染色体。"},{"en":"Scientists compared the haplotypes of different populations.","zh":"科学家比较了不同人群的单倍型（haplotype）。"}]}],"synonyms":["mono-","uni-","single-"],"phonetic":"/hæp-/","extraExplanation":["“hapl-”来自希腊语 haploos（意为“单一的、简单的”）。它通常不单独作为一个英语单词使用，而是出现在专业词中：\n- haploid（单倍体）：细胞只有一套染色体（人类配子如精子、卵细胞）。\n- haplotype（单倍型）：一组常一起遗传的基因变异组合，常用于族群遗传、疾病研究等。"]}
{"word":"hapless","summary":{"en":"Hapless means unlucky or unfortunate, often suggesting someone is helpless or deserving sympathy.","zh":"hapless 指“不幸的、倒霉的”，常暗含“无助、令人同情”的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unlucky; unfortunate, often in a way that makes someone seem helpless or pitiable.","zh":"不幸的；倒霉的（常带有无助、令人同情的意味）。"},"examples":[{"en":"The hapless traveler missed the last train and had to sleep at the station.","zh":"那个倒霉的旅客错过了末班车，只好在车站过夜。"},{"en":"A hapless mistake deleted all the files right before the deadline.","zh":"一个倒霉的失误在截止前把所有文件都删掉了。"},{"en":"In the comedy, the hapless hero keeps getting into trouble.","zh":"在这部喜剧里，那个倒霉的男主总是不断惹上麻烦。"}]}],"synonyms":["unlucky","unfortunate","ill-fated","down-on-one's-luck","luckless"],"phonetic":"/ˈhæpləs/","extraExplanation":["词源小提示：hap 原意与“运气、机缘”有关（也出现在 perhaps 里，原本有“也许碰巧”的感觉）。hapless = hap（运气）+ -less（没有），字面就是“没有好运气的”。","语气与用法：hapless 常用于叙述或文学/新闻式表达，带一点“可怜、无奈”的同情或戏谑色彩；口语里更常用 unlucky / unfortunate。","常见搭配：hapless victim（倒霉的受害者）、hapless traveler（倒霉的旅客）、hapless attempt（失败/不走运的尝试）。"]}
{"word":"haplessly","summary":{"en":"“Haplessly” means “in an unlucky or helpless way,” often describing someone who fails or looks unable to fix a situation.","zh":"“Haplessly”表示“倒霉地或无助地”，常用来形容一个人做事不顺、失败，或看起来没办法解决问题。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an unlucky way; without success, often because of bad luck or poor planning.","zh":"不走运地；无成效地（常因运气差或计划不周）。"},"examples":[{"en":"He looked around haplessly for his lost keys.","zh":"他不走运地四处找丢失的钥匙。"},{"en":"The team played haplessly and lost by a large margin.","zh":"球队表现得很无力、很不顺，结果大比分输掉了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a helpless or awkward way; lacking the ability to act effectively.","zh":"无助地；笨拙地（显得缺乏办法或能力）。"},"examples":[{"en":"She stood haplessly at the door, unsure what to say.","zh":"她无助地站在门口，不知道该说什么。"},{"en":"The child waved haplessly as the bus pulled away.","zh":"公交车开走时，孩子无助地挥了挥手。"}]}],"synonyms":["unluckily","helplessly","ineffectively","pathetically","clumsily"],"phonetic":"/ˈhæpləsli/","extraExplanation":["“hap”在古英语/中古英语里有“运气、机缘”的意思，所以 hapless 字面是“没有运气的”，haplessly 就是“以不走运的方式”。","语气上，haplessly 常带一点同情或轻微的幽默：描写人“倒霉又无奈”的状态，比 simply “unluckily”更有画面感。"]}
{"word":"haplessness","summary":{"en":"Haplessness means misfortune or a state of being unlucky.","zh":"haplessness 指“厄运/不幸”，强调处于倒霉、运气差的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bad luck, misfortune, or an unfortunate situation (often suggesting someone is unlucky and things go wrong for them).","zh":"厄运；不幸；倒霉的处境（常暗示某人运气差、事情老出岔子）。"},"examples":[{"en":"The team’s haplessness this season has frustrated even loyal fans.","zh":"球队本赛季的倒霉表现让连忠实球迷都很沮丧。"},{"en":"Through a mix of haplessness and poor planning, the trip went badly from the start.","zh":"因为既倒霉又缺乏规划，这趟旅行一开始就不顺。"},{"en":"He spoke about his early haplessness with humor, as if it belonged to another life.","zh":"他用幽默谈起自己早年的不幸，仿佛那是另一段人生。"}]}],"synonyms":["misfortune","bad luck","ill luck","unluckiness","adversity"],"phonetic":"/ˈhæpləsnəs/","extraExplanation":["词根理解：hap- 与 “happen（发生）”同源，早期与“运气/机缘”有关；因此 hapless = unlucky（不走运的），haplessness = 不走运的状态/一连串不幸。","语体与语感：haplessness 比 plain 的 “bad luck” 更带一点“可怜、无奈、总是出错”的文学感或描写感，常用于叙述或评论。"]}
{"word":"haplessnesses","summary":{"en":"“Haplessnesses” is the plural of “haplessness,” meaning multiple instances or kinds of bad luck, misfortune, or helplessness.","zh":"“haplessnesses”是“haplessness”的复数，表示多次/多种倒霉、不幸或无助的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being unlucky, unfortunate, or helpless; lack of good fortune or ability to manage a situation","zh":"不幸；倒霉；无助（指缺乏好运或缺乏应对局面的能力）"},"examples":[{"en":"The story is full of small haplessnesses that slowly wear the hero down.","zh":"这个故事充满了许多小小的不幸，逐渐把主人公击垮。"},{"en":"She spoke with humor about the haplessnesses of her first week at a new job.","zh":"她带着幽默谈起自己新工作第一周的种种倒霉事。"},{"en":"In the novel, the character’s haplessnesses make readers sympathize with him.","zh":"在小说里，这个角色的不幸遭遇让读者对他心生同情。"}]}],"synonyms":["misfortunes","bad luck","unluckiness","hardships","adversity"],"phonetic":"/ˈhæpləsnəs/","extraExplanation":["“haplessnesses”是“haplessness”的复数形式，表示“多次/多种不幸或倒霉事”。在日常英语中更常用单数“haplessness”，或直接说“misfortunes / bad luck”。","词源提示：hap（运气、机会）+ -less（没有）→ hapless（倒霉的/不幸的）+ -ness（名词后缀）→ haplessness（不幸/倒霉）。"]}
{"word":"haplite","summary":{"en":"Haplite is a light-colored, granite-like igneous rock made mostly of quartz and feldspar.","zh":"Haplite 指一种淡色、类似花岗岩的火成岩，主要由石英和长石组成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light-colored igneous rock (usually fine-grained) similar to granite, made mainly of quartz and feldspar","zh":"淡色的火成岩（通常为细粒），成分以石英和长石为主，性质类似花岗岩"},"examples":[{"en":"The outcrop includes granite cut by thin dikes of haplite.","zh":"这处露头包含花岗岩，并被细薄的淡色花岗岩脉（haplite）切穿。"},{"en":"Haplite often forms as narrow veins in larger intrusive bodies.","zh":"淡色花岗岩（haplite）常以狭窄岩脉的形式出现在较大的侵入岩体中。"}]}],"synonyms":["fine-grained granite","granite (general term)","quartz-feldspar rock (broad)"],"phonetic":"/ˈhæp.laɪt/","extraExplanation":["词源来自希腊语 *haploos*（意为“简单的”），用来强调这种岩石的矿物组成相对“简单”，主要就是石英和长石，暗色矿物较少。","地质学里它常被描述为“细粒花岗岩”或“花岗岩质岩脉”，常见于侵入岩（如花岗岩体）内部或周边的脉体中。"]}
{"word":"haplites","summary":{"en":"Haplites (more commonly spelled hoplites) are ancient Greek heavily armed infantry soldiers who fought in a phalanx.","zh":"haplites（更常见拼写为 hoplites）指古希腊的重装步兵，常以方阵作战。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ancient Greek heavily armed infantry soldiers who fought in close formation (the phalanx), typically carrying a large round shield and a spear.","zh":"古希腊的重装步兵（常以“方阵”作战），通常携带大圆盾和长矛。"},"examples":[{"en":"Hoplites marched shoulder to shoulder in a phalanx.","zh":"重装步兵肩并肩列成方阵前进。"},{"en":"The museum displayed a hoplite’s helmet and shield.","zh":"博物馆展出了重装步兵的头盔和盾牌。"},{"en":"In many city-states, hoplites were citizen-soldiers.","zh":"在许多城邦中，重装步兵往往是“公民士兵”。"}]}],"synonyms":["hoplites","Greek heavy infantry","spearmen (historical)"],"phonetic":"/ˈhɑːp.laɪts/","extraExplanation":["“haplites”常被视为“hoplites”的拼写变体或误拼；更常见、标准的拼写是 hoplites（单数 hoplite）。","词源来自希腊语 hoplon，常解释为“武器/盾牌”。“重装步兵”以大圆盾（aspis/hoplon）和长矛为核心装备，并以密集队形“phalanx（方阵）”闻名。"]}
{"word":"haplitic","summary":{"en":"Haplitic means “like or related to haplite,” a light-colored, fine-grained granitic rock rich in quartz and feldspar.","zh":"haplitic 指“细晶花岗岩质的/与细晶花岗岩有关的”，多用于地质学，常形容富含石英与长石的浅色花岗质岩石或岩浆。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling haplite (a light-colored, fine-grained granitic rock); describing a rock or magma that is quartz-and-feldspar–rich and low in dark minerals.","zh":"（地质）与细晶花岗岩（haplite，一种浅色、细粒的花岗质岩石）有关的；指富含石英与长石、暗色矿物较少的岩石或岩浆。"},"examples":[{"en":"The intrusion includes a haplitic margin that cooled quickly against the country rock.","zh":"这次侵入体的边缘呈细晶花岗岩质（haplitic），因为贴近围岩而快速冷却。"},{"en":"Under the microscope, the sample shows a haplitic texture dominated by quartz and feldspar.","zh":"在显微镜下，这个样品呈细晶花岗岩质（haplitic）结构，以石英和长石为主。"}]}],"synonyms":["granitic","felsic","leucocratic"],"phonetic":"/hæpˈlɪtɪk/","extraExplanation":["“haplitic”主要用于岩石学/火成岩地质语境，来自“haplite”（细晶花岗岩）。haplite 通常是浅色（leucocratic/偏长英质 felsic）的花岗质岩石，常见于花岗岩体的晚期脉体或边部细粒相。","它是比较专业的词，日常英语很少用；如果你是在遗传学里想表达“单倍型”，通常用 haplotype（名词）或 haplotypic（形容词），而不是 haplitic。"]}
{"word":"haplo","summary":{"en":"“Haplo-” is a prefix meaning “single,” especially “having one set of chromosomes” in biology.","zh":"“haplo-”是前缀，表示“单一的”；尤指生物学中“只有一套染色体的（单倍体）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Prefix) meaning “single” or “simple,” especially in biology meaning “having one set of chromosomes.”","zh":"（前缀）表示“单一的/简单的”；尤指生物学中“只有一套染色体的（单倍体）”。"},"examples":[{"en":"A haploid cell has one set of chromosomes.","zh":"单倍体细胞只有一套染色体。"},{"en":"The term “haplogroup” is used in genetics to describe a group with a shared ancestor.","zh":"“单倍群（haplogroup）”在遗传学中用来指有共同祖先的一群。"},{"en":"Scientists compared haploid and diploid organisms in the lab.","zh":"科学家在实验室比较了单倍体与二倍体生物。"}]}],"synonyms":["single","mono-"],"phonetic":"/ˈhæploʊ/","extraExplanation":["“haplo-”来自希腊语 *haplous*（意为“单一的、简单的”）。在英语里它常出现在生物/遗传学词汇中：\n- haploid（单倍体）：1 套染色体（人类的精子/卵细胞属于此类）。\n- diploid（二倍体）：2 套染色体（人体大多数体细胞）。\n学习时可以把“haplo-”理解成类似“mono-（单）”，但“haplo-”更常用于遗传学语境。"]}
{"word":"haplobiont","summary":{"en":"A haplobiont is an organism whose life cycle is mainly haploid (one set of chromosomes).","zh":"haplobiont 指生命周期主要为单倍体（只有一套染色体）的生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organism that has a haploid (single) set of chromosomes for most of its life cycle.","zh":"单倍体生物；在其生命周期的大部分阶段只有一套（单倍体）染色体的生物。"},"examples":[{"en":"Many fungi are haplobionts, spending most of their life in the haploid stage.","zh":"许多真菌是单倍体生物，它们一生中大部分时间处于单倍体阶段。"},{"en":"In class, we compared a haplobiont life cycle with the human diploid-dominant life cycle.","zh":"课堂上我们把单倍体生物的生活史与人类以二倍体为主的生活史进行了比较。"}]}],"synonyms":["haploid organism"],"phonetic":"/ˈhæp.loʊ.baɪ.ɑnt/","extraExplanation":["词源提示：haplo- 表示“单一、单倍”，-biont 表示“生物、生命体”。因此 haplobiont 可直观理解为“单倍（染色体）阶段占主导的生物”。","学术用法中常与 diploid（双倍体）、diplo(b)iont（以二倍体为主的生活史）对比；也可能出现在讨论“世代交替”时，用来区分以单倍体或二倍体为主的类型。"]}
{"word":"haplobiontic","summary":{"en":"Haplobiontic describes a life cycle where the dominant stage is haploid and the diploid stage is brief (often only the zygote).","zh":"Haplobiontic 指单倍体阶段占优势、二倍体阶段很短（常仅为合子）的生活史类型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Describing an organism or life cycle in which the main (dominant) multicellular stage is haploid, and the diploid stage is limited—often only the zygote.","zh":"（生物学）形容一种生物或生活史：主要（占优势）的多细胞阶段为单倍体（haploid），而二倍体阶段很短或受限——常常只出现为合子（zygote）。"},"examples":[{"en":"Many green algae have a haplobiontic life cycle, with the zygote as the only diploid stage.","zh":"许多绿藻具有单倍体占优势的（haplobiontic）生活史，合子是唯一的二倍体阶段。"},{"en":"In a haplobiontic cycle, meiosis happens soon after fertilization to restore the haploid condition.","zh":"在 haplobiontic 的生活史中，受精后不久就会发生减数分裂，以恢复单倍体状态。"}]}],"synonyms":["haplontic","haploid-dominant"],"phonetic":"/ˌhæp.loʊ.baɪˈɑn.tɪk/","extraExplanation":["词源提示：haplo- 表示“单一、简单/单倍体”，-biontic 与“生命/生活方式（biotic）”相关。这个词常用于讨论“世代交替”与生活史类型。","对比理解：haplobiontic（单倍体占优势）常与 diplobiontic（双倍体占优势）对比；也常被视为与 haplontic（haploid-dominant）意义接近的术语，具体用法随教材与研究领域略有差异。"]}
{"word":"haplocaulescent","summary":{"en":"A botanical adjective meaning “having one main (usually unbranched) flowering stem.”","zh":"植物学形容词，指“具有一条主要（通常不分枝）的开花茎”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a single main flowering stem (a simple, unbranched stem).","zh":"（植物学）单轴茎生的；具有一条主要的开花茎（茎通常较简单、少分枝或不分枝）。"},"examples":[{"en":"The plant is haplocaulescent, sending up one tall flowering stem each spring.","zh":"这种植物是单轴茎生的，每年春天会抽出一条高高的开花茎。"},{"en":"In the field notes, the specimen was described as haplocaulescent rather than branching.","zh":"在野外记录中，这个标本被描述为单轴茎生的，而不是分枝型。"}]}],"synonyms":["single-stemmed","unbranched","simple-stemmed"],"phonetic":"/ˌhæploʊkɔːˈlɛsənt/","extraExplanation":["词源上可拆为 haplo-（“单一、简单”，常见于 haploid“单倍体”）+ caulescent（“有茎的；茎上生长的”，来自拉丁语 caulis “茎”）。","这是偏专业的植物形态学用语，多用于描述植株是否以“单一主茎”承担主要的开花功能；在更日常的植物描述里，也可能用 “single-stemmed / unbranched” 来表达。"]}
{"word":"haplochlamydeous","summary":{"en":"A botanical term meaning “having only one perianth whorl,” not clearly separated into sepals and petals.","zh":"植物学术语：指花只有一轮花被，通常不分化成花萼与花冠。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a single floral envelope (perianth); the flower has only one whorl of perianth parts, so it is not clearly separated into calyx (sepals) and corolla (petals).","zh":"（植物学）单被花的；花只有一轮花被（perianth），花被不明显分化为花萼（萼片）与花冠（花瓣）。"},"examples":[{"en":"Many grasses have haplochlamydeous flowers with reduced, simple perianth structures.","zh":"许多禾本科植物的花属于单被花，花被结构常常退化而简单。"},{"en":"In a haplochlamydeous flower, you may see only one set of perianth segments rather than distinct sepals and petals.","zh":"在单被花中，你可能只看到一组花被片，而不是清楚分开的萼片和花瓣。"}]}],"synonyms":["monochlamydeous","undifferentiated perianth"],"phonetic":"/ˌhæp.loʊ.kləˈmɪd.i.əs/","extraExplanation":["该词多用于植物分类学/形态学描述，常见于较正式的学术语境，日常英语里很少用。","词源可拆解理解：haplo- 表示“单一”，-chlamydeous 来自希腊语 chlamys（意为“外衣、披风”），在植物学里引申为“花被/花被层”。","相关对比：dichlamydeous（双被花）指花被分化为两轮——外轮花萼与内轮花冠；而 haplochlamydeous 则只有一轮。"]}
{"word":"haplodoci","summary":{"en":"“haplodoci” isn’t a recognized English word; it’s probably a misspelling of “Diplodoci.”","zh":"“haplodoci”不是规范英语词；很可能是把“Diplodoci”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or misreading of “Diplodoci” (plural of Diplodocus, a type of dinosaur), or a made-up/nonce form used in a specific context.","zh":"不是标准英语单词。很可能是对“Diplodoci”（Diplodocus 的复数，一类恐龙）的拼写/辨读错误，或是在特定语境中临时造出来的形式。"},"examples":[{"en":"I can’t find “haplodoci” in major dictionaries—did you mean “Diplodoci”?","zh":"主流词典里查不到“haplodoci”——你是不是想写“Diplodoci”？"},{"en":"If you meant the dinosaur group, you could write: “Several Diplodoci appear in the exhibit.”","zh":"如果你指的是那类恐龙，可以写：“展厅里有几具 Diplodoci（梁龙类）的展品。”"}]}],"synonyms":["Diplodoci","Diplodocuses"],"phonetic":"/ˌhæploʊˈdoʊsaɪ/","extraExplanation":["从构词上看，“Diplodocus”来自希腊语元素（diplo- “双/两重” + -docus 与“梁/横木”相关），英语里常把拉丁/新拉丁名词的 -us 复数写成 -i，所以会看到“Diplodoci”。不过在现代英语中，很多科学名称也会直接用英语规则加 -es（如 Diplodocuses），两种写法在不同作者/出版物中都可能出现。","如果你能提供一句包含“haplodoci”的原句或它出现的领域（恐龙、游戏、小说、学术文章等），我可以更准确判断你想查的词。"]}
{"word":"haplodon","summary":{"en":"Haplodon is an older scientific name for the mountain beaver, now usually classified as Aplodontia.","zh":"Haplodon 是山海狸的旧科学属名，现代通常归为 Aplodontia。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(zoology, taxonomy) An older scientific name used for the mountain beaver; now usually treated as the genus Aplodontia (family Aplodontiidae).","zh":"（动物学/分类学）山海狸（mountain beaver）的旧属名；现代多归为 Aplodontia（山海狸科）。"},"examples":[{"en":"Some older books list the mountain beaver under the genus Haplodon.","zh":"一些较早的书会把山海狸写在 Haplodon 这个属名下。"},{"en":"Today, most scientific sources use Aplodontia instead of Haplodon.","zh":"如今大多数科学资料用 Aplodontia，而不是 Haplodon。"}]}],"synonyms":["Aplodontia","mountain beaver"],"phonetic":"/ˈhæp.loʊ.dɑn/","extraExplanation":["Haplodon 主要出现在较早的动物分类文献中；现代分类更常用 Aplodontia rufa（山海狸）来指这一物种。读到 Haplodon 时，可以把它理解为“旧名/同物异名”，在查资料时用 Aplodontia 作为关键词更容易找到最新信息。"]}
{"word":"haplodont","summary":{"en":"Haplodont can mean the mountain beaver, or describe animals with simple tooth structure.","zh":"haplodont 可指“山海狸”，也可形容“牙齿结构简单（单齿型）”的动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A mountain beaver (Aplodontia rufa), a small rodent native to the Pacific Northwest of North America.","zh":"（动物学）山海狸（Aplodontia rufa），一种原产于北美太平洋西北地区的小型啮齿动物。"},"examples":[{"en":"The haplodont lives in cool, damp forests and spends much of its time in burrows.","zh":"山海狸生活在凉爽潮湿的森林里，很多时间都待在洞穴中。"},{"en":"Scientists studied the haplodont to learn how it survives in dense undergrowth.","zh":"科学家研究山海狸，以了解它如何在茂密的林下植被中生存。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Zoology, anatomy) Having simple, undivided tooth cusps; “simple-toothed.”","zh":"（动物学/解剖）牙齿齿尖结构简单、未分裂的；“单齿型的/简单齿的”。"},"examples":[{"en":"Some early mammals are described as haplodont because their teeth are relatively simple.","zh":"一些早期哺乳动物被描述为“单齿型”，因为它们的牙齿结构相对简单。"},{"en":"The specimen shows haplodont dentition rather than complex grinding teeth.","zh":"该标本显示的是单齿型齿列，而不是复杂的磨碎型臼齿。"}]}],"synonyms":["mountain beaver","aplodont","simple-toothed"],"phonetic":"/ˈhæploʊdɑːnt/","extraExplanation":["词源：haplo- 表示“单一、简单”（如 haploid 单倍体），-dont/-odont 表示“牙齿”（见 orthodontics 牙齿矫正学）。因此 haplodont 字面意思就是“简单的牙/单齿”。","名词用法在北美语境里常指山海狸（mountain beaver）。它并不是真正的海狸，只是外形与生活方式有些相似，所以英文俗名容易引起误解。"]}
{"word":"haplodonty","summary":{"en":"Haplodonty is a simple tooth form with one main cusp.","zh":"Haplodonty 指牙齿以一个主要尖为特征的“单尖、简单”齿型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tooth pattern in which the crown has a single main cusp (a simple, one-point tooth), common in some early mammals and certain mammal groups","zh":"（动物学/解剖学）单尖齿型：牙冠主要只有一个尖（结构简单、单一尖顶的牙齿类型），常见于一些早期哺乳动物及某些哺乳类群"},"examples":[{"en":"Some small insect-eating mammals show haplodonty in their cheek teeth.","zh":"一些以昆虫为食的小型哺乳动物在臼齿（颊齿）上表现出单尖齿型。"},{"en":"The fossil specimen was described as having haplodonty, suggesting a relatively simple diet or tooth function.","zh":"该化石标本被描述为单尖齿型，这暗示它的牙齿功能或食性相对简单。"}]}],"synonyms":["single-cusped dentition","simple dentition"],"phonetic":"/ˌhæp.loʊˈdɑn.ti/","extraExplanation":["词源：haplo- 表示“单一、简单”，-donty 与“牙齿/齿列形态”有关（如 orthodonty 正畸）。","学习提示：haplodonty 常用于比较解剖学与古生物学，和多尖、复杂咬合面的齿型对比（例如 tribosphenic 等更复杂的形态）。","用法上它多出现在学术语境（论文、化石描述、解剖课本）中，日常英语很少使用。"]}
{"word":"haplography","summary":{"en":"Haplography is an accidental omission in writing where something that should be doubled is written only once.","zh":"haplography 指书写/抄写时把本应重复的部分误写成只出现一次的漏写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A writing or copying error where a letter, syllable, or word is accidentally written only once even though it should appear twice (often because similar parts are close together).","zh":"（抄写/书写中的）漏写现象：本应重复出现的字母、音节或词，因为相邻部分相似而被误写成只出现一次。"},"examples":[{"en":"In the manuscript, “misspell” appears as “mispell,” a likely case of haplography.","zh":"在手稿中，“misspell”被写成“mispell”，这很可能是一次漏写（haplography）。"},{"en":"Editors look for haplography when two similar word endings occur next to each other.","zh":"当两个相似的词尾相邻出现时，编辑会留意是否发生了漏写（haplography）。"}]}],"synonyms":["omission (in copying)","scribal omission","copying error"],"phonetic":"/ˌhæpˈlɑːɡrəfi/","extraExplanation":["这个词常用于文本批评（textual criticism）和校勘学：研究手稿、古籍或打字稿时，学者会用它来解释某些“少了一段/少了一个字母”的错误。","词源可拆解理解：haplo- 表示“单一、一次”，-graphy 表示“书写”。因此字面意思接近“只写了一次”。","相关对比：dittography 指相反的情况——本应写一次却被误重复写了两次（多写）。"]}
{"word":"haplogroup","summary":{"en":"a genetic lineage group defined by shared inherited mutations","zh":"由共同遗传突变标记界定的遗传谱系群"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of people (or organisms) who share a specific set of genetic mutations inherited from a common ancestor, often identified using Y-DNA or mitochondrial DNA.","zh":"（遗传学）由共同祖先传下来的、共享一组特定基因突变的人群（或生物）分支，常用父系Y染色体DNA或母系线粒体DNA来判定。"},"examples":[{"en":"His DNA test placed him in a haplogroup common in parts of Northern Europe.","zh":"他的DNA检测结果显示他属于一种在北欧部分地区较常见的单倍群。"},{"en":"Researchers compared haplogroups to trace ancient migration patterns.","zh":"研究人员对比不同单倍群来追踪古代迁徙路线。"},{"en":"Two people can share a haplogroup even if they are not closely related in recent generations.","zh":"即使近几代并不算近亲，两个人也可能属于同一个单倍群。"}]}],"synonyms":["genetic lineage","lineage","clade","genetic group"],"phonetic":"ˈhæpˌloʊˌɡruːp","extraExplanation":["常见搭配：Y-DNA haplogroup（父系单倍群）、mtDNA haplogroup（母系单倍群）。它描述的是“谱系分支/遗传标记群”，不等同于国籍或“种族”，也不能直接决定一个人的文化身份。","在族谱与基因祖源报告中，单倍群常用字母与数字表示（如 R1b、O、H 等），代表不同的遗传分支。"],"etymology":"来自希腊语词根 haplo-（“单一的、简单的”）+ group（“群体”）。在遗传学中用于指“共享同一套遗传标记的谱系群”。","mnemonic":["把 haplo- 记成“单倍/单一”，group 就是“群”：单倍 + 群 → “单倍群/单倍型群”。"]}
{"word":"haploid","summary":{"en":"Haploid means having one set of chromosomes (n); it describes many sex cells like sperm and eggs.","zh":"haploid 指“单倍体的”，即只有一套染色体（n）；常用于描述精子、卵细胞等性细胞。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one complete set of chromosomes (n), not pairs; typical of human sperm and egg cells.","zh":"（细胞/生物）为单倍体的；只含一套染色体（n），而不是成对的；人类的精子和卵细胞通常是单倍体。"},"examples":[{"en":"Human sperm cells are haploid, carrying 23 chromosomes.","zh":"人类精子是单倍体，携带23条染色体。"},{"en":"An egg is a haploid cell that combines with sperm during fertilization.","zh":"卵细胞是单倍体，在受精时与精子结合。"}]},{"partOfSpeech":"n.","definition":{"en":"A cell or organism that has one set of chromosomes.","zh":"单倍体（细胞或生物）：只含一套染色体的细胞或生物。"},"examples":[{"en":"The lab studied a haploid to see how a single gene affects traits.","zh":"实验室研究了一个单倍体，以观察单个基因如何影响性状。"}]}],"synonyms":["monoploid (context-dependent)"],"phonetic":"/ˈhæpˌlɔɪd/","extraExplanation":["词源提示：haplo- 来自希腊语，意为“单一/简单”，-oid 表示“……样的”。所以 haploid 字面上就是“单一（染色体组）样的”。","对比记忆：diploid（双倍体）是两套染色体（2n），人类大多数体细胞是双倍体；haploid（单倍体）是（n），常见于配子（精子、卵）。"]}
{"word":"haploid-dominant","summary":{"en":"Having a life cycle mainly in the haploid stage.","zh":"以单倍体阶段为主的生活史。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing a life cycle in which the haploid (one-set-of-chromosomes) stage is the main, longest, or most visible phase, and the diploid stage is brief (often only the zygote).","zh":"（指生活史）以单倍体（只有一套染色体）阶段为主要、最长或最显著的时期，而二倍体阶段很短（常常只限于合子）。"},"examples":[{"en":"Many fungi have a haploid-dominant life cycle, with the diploid stage lasting only briefly.","zh":"许多真菌属于单倍体占优势的生活史，二倍体阶段往往非常短暂。"},{"en":"In haploid-dominant organisms, most cells you see are haploid.","zh":"在单倍体占优势的生物中，你看到的大多数细胞都是单倍体。"},{"en":"Textbooks often contrast haploid-dominant and diploid-dominant life cycles.","zh":"教材常把单倍体占优势与二倍体占优势的生活史作对比。"}]}],"synonyms":["haplontic","haploid phase-dominant","haploid-dominant life cycle"],"phonetic":"/ˈhæp.lɔɪd ˈdɑm.ə.nənt/","extraExplanation":["单倍体占优势（haploid-dominant）常对应“haplontic life cycle（单倍体生活史）”：多细胞个体主要是单倍体；受精产生的二倍体合子很快进行减数分裂，重新回到单倍体阶段。","常见于许多真菌、部分藻类；与之相对的是“diploid-dominant（如动物）”以及“alternation of generations（世代交替，如许多植物）”。"],"etymology":"“haploid”来自希腊语 haplo-（“单一的”）+ -oid（“像……的/……形态的”）；“dominant”来自拉丁语 dominari（“支配、统治”）。合起来表示“以单倍体阶段为主导”。","mnemonic":["hap- 可联想“half（半）”：haploid ≈ 只有“一半套”（相对二倍体的两套）。所以 haploid-dominant = “半套当家”。","dominant = “当家作主/占主导”，记成“domin- 像 domain（领地）”，谁的“领地”大谁就 dominant。"]}
{"word":"haploidic","summary":{"en":"Haploidic means having one set of chromosomes (haploid), especially in biology/genetics.","zh":"haploidic 指“单倍体的”，即只有一套染色体的（常用于生物学/遗传学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Having one complete set of chromosomes (haploid); relating to a haploid state.","zh":"（生物学）单倍体的；具有一套完整染色体的；与单倍体状态有关的。"},"examples":[{"en":"Many fungi have a haploidic stage in their life cycle.","zh":"许多真菌的生命周期中包含单倍体阶段。"},{"en":"A haploidic cell carries one set of chromosomes, unlike a diploid cell.","zh":"单倍体细胞只有一套染色体，不同于二倍体细胞。"},{"en":"In genetics class, we compared haploidic and diploidic organisms.","zh":"在遗传学课上，我们比较了单倍体与二倍体生物。"}]}],"synonyms":["haploid","monoploid (sometimes, depending on context)"],"phonetic":"/ˌhæpˈlɔɪdɪk/","extraExplanation":["“haploidic”在现代英文中不算常用；更常见、更标准的写法通常是“haploid”（形容词）或“haploidy”（名词：单倍性）。不过在学术写作中你仍可能见到“haploidic/diploidic”这种成对用法，用来强调“处于某种倍性状态”。","词根提示：haplo- 表示“单一、单个”，-loid 表示“……样的”，与“chromosome（染色体）”“genome（基因组）”等词经常一起出现。"]}
{"word":"haploidies","summary":{"en":"Haploidies means instances or types of haploidy—the condition of having one set of chromosomes.","zh":"haploidies 指“单倍体状态/单倍体系统”的复数：细胞或生物只有一套染色体的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having only one set of chromosomes (one copy of each chromosome) in a cell; common in eggs and sperm and in many organisms such as bees and some plants","zh":"单倍体状态；指细胞只含有一套染色体（每条染色体只有一份拷贝）的状态；常见于卵细胞、精子，以及蜜蜂等动物和部分植物"},"examples":[{"en":"Human eggs and sperm are produced in a haploid state.","zh":"人类的卵细胞和精子是在单倍体状态下产生的。"},{"en":"In honeybees, males develop from unfertilized eggs and are haploid.","zh":"在蜜蜂中，雄蜂由未受精卵发育而来，因此是单倍体。"}]},{"partOfSpeech":"n.","definition":{"en":"a genetic system or life stage in which an organism (or most of its cells) is haploid","zh":"单倍体型（或单倍体生活史阶段）；指生物整体（或大多数细胞）以单倍体形式存在的遗传系统或时期"},"examples":[{"en":"Some algae have life cycles that alternate between diploidy and haploidy.","zh":"一些藻类的生活史在二倍体与单倍体之间交替。"}]}],"synonyms":["haploidy","haploid state"],"phonetic":"/ˈhæpˌlɔɪdi/","extraExplanation":["“haploidies”通常是名词“haploidy”的复数形式，用于指不同物种或不同情境中的多种“单倍体状态/单倍体系统”。","词根提示：haplo- 表示“单一/简单”，-oid 表示“……样的”，-y 表示“状态/性质”。与之相对的是“diploidy（二倍体状态）”。"]}
{"word":"haploids","summary":{"en":"Haploids are cells or organisms with one set of chromosomes (common in sperm/eggs).","zh":"haploids 指只含一套染色体的单倍体细胞或生物（如精子、卵细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Haploid cells or organisms—having one complete set of chromosomes (one copy of each chromosome), not pairs.","zh":"单倍体（细胞或生物）——只含有一套完整的染色体（每条染色体只有一份），而不是成对存在。"},"examples":[{"en":"In humans, sperm and egg cells are haploids.","zh":"在人类中，精子和卵细胞是单倍体。"},{"en":"Researchers studied haploids to see how a single gene affects a trait.","zh":"研究人员研究单倍体，以观察单个基因如何影响某种性状。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something that has one set of chromosomes (used mainly in biology).","zh":"（主要用于生物学）形容只具有一套染色体的。"},"examples":[{"en":"A haploid genome has one copy of each chromosome.","zh":"单倍体基因组中每条染色体只有一份拷贝。"}]}],"synonyms":["haploid cells","n cells (in genetics)"],"phonetic":"/ˈhæplɔɪd/","extraExplanation":["“hap-”来自希腊语，表示“单一、简单”，“-loid”有“类似……的”含义；合起来强调“只有一套”的染色体状态。","与“diploid（双倍体）”相对：人类大多数体细胞是双倍体（2n），而配子（精子/卵）是单倍体（n）。受精后恢复为双倍体。","在遗传学实验中，使用单倍体很有用，因为基因只有一份拷贝，某个基因的效应更容易被观察到（不容易被另一份拷贝“掩盖”）。"]}
{"word":"haploidy","summary":{"en":"Haploidy is the state of having one set of chromosomes in a cell (n).","zh":"Haploidy 指细胞只有一套染色体（n）的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition of having a single set of chromosomes (n) in each cell, rather than the usual two sets (2n).","zh":"单倍体状态：细胞中只有一套染色体（n），而不是通常的两套（2n）。"},"examples":[{"en":"In many animals, sperm and egg cells show haploidy.","zh":"在许多动物中，精子和卵细胞属于单倍体。"},{"en":"Researchers used haploidy in yeast to study how a gene affects growth.","zh":"研究人员利用酵母的单倍体状态来研究某个基因如何影响生长。"}]}],"synonyms":["haploid state","monoploidy"],"phonetic":"/hæpˈlɔɪdi/","extraExplanation":["“haplo-”来自希腊语，含义接近“单一、简单”；“-idy”常用于表示某种状态或性质。","单倍体在遗传学中很重要：因为只有一份基因拷贝，某些隐性突变更容易直接表现出来，便于做基因功能研究。","常见对比：haploidy（单倍体状态，n） vs. diploidy（双倍体状态，2n）。"]}
{"word":"haploinsufficiency","summary":{"en":"Haploinsufficiency is when one functional gene copy is not enough to maintain normal function, causing symptoms.","zh":"haploinsufficiency 指一个基因只有一份正常拷贝仍“不够用”，从而出现症状的遗传学机制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A genetic situation where having only one working copy of a gene is not enough for normal function, so a person can show symptoms even though they still have one normal gene copy.","zh":"一种遗传学情况：某个基因只剩一个正常可用的拷贝仍不足以维持正常功能，因此即使还有一个正常拷贝，也可能出现疾病或症状。"},"examples":[{"en":"In this disorder, haploinsufficiency of the gene leads to developmental delays.","zh":"在这种疾病中，该基因的单倍剂量不足会导致发育迟缓。"},{"en":"The mutation causes haploinsufficiency, meaning one healthy copy cannot produce enough protein.","zh":"该突变造成单倍剂量不足，也就是说一个健康拷贝无法产生足够的蛋白质。"}]}],"synonyms":["gene dosage insufficiency","dosage sensitivity"],"phonetic":"/ˌhæpˌlɔɪn.səˈfɪʃ.ən.si/","extraExplanation":["“haplo-”表示“单一/一半”（如“haploid 单倍体”），“insufficiency”表示“不足”。合起来强调的是“基因剂量（gene dosage）不够”。","与“显性负效应（dominant-negative）”不同：单倍剂量不足是“量不够”（蛋白质太少）；显性负效应是“坏的蛋白质干扰好的蛋白质功能”。","常见成因包括：基因缺失（deletion）、无义突变（nonsense）导致蛋白截短、或表达降低等。临床遗传报告里常用来解释为何“杂合（heterozygous）变异”也会致病。"]}
{"word":"haplolaly","summary":{"en":"Haplology is a linguistic shortening where one of two similar adjacent syllables is dropped.","zh":"Haplology 指语言中相似相邻音节之一被省略、导致词形缩短的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a linguistic process where a word becomes shorter because one of two similar neighboring syllables is dropped (often to make pronunciation easier)","zh":"（语言学）省音现象：当两个相似的相邻音节出现时，为了更易发音而省略其中一个，使词变短"},"examples":[{"en":"In everyday speech, people may say “probably” instead of “probable-ly,” which is often explained as haplology.","zh":"在日常口语中，人们常把“probable-ly”说成“probably”，这常被用来解释为省音现象（haplology）。"},{"en":"Some place names change over time through haplology.","zh":"一些地名会随着时间通过省音现象发生变化。"}]}],"synonyms":["syllable reduction","speech simplification"],"phonetic":"/hæpˈlɑlədʒi/","extraExplanation":["你输入的“haplolaly”不是常见的标准英文拼写；最接近、也最常见的相关词是 **haplology**（省音现象）。","haplology 常见于语言学讨论，强调“相似音节挨在一起时，发音者往往会省掉一个”，属于自然语音变化的一种。"]}
{"word":"haplologic","summary":{"en":"“Haplologic” means ‘related to haplology,’ the dropping of a repeated or similar syllable/sound in pronunciation.","zh":"haplologic 指“与脱音（haplology）有关的”，即发音时省略重复或相似的音节/音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to haplology: the linguistic process where one of two similar or identical syllables (or sounds) is omitted to make a word easier to say.","zh":"与“脱音（haplology）”有关的：一种语言现象，为了更易发音而省略两个相似或相同音节（或音）中的一个。"},"examples":[{"en":"The pronunciation “libry” for “library” is a haplologic form in casual speech.","zh":"在口语中把 library 读成“libry”，是一种脱音（haplologic）形式。"},{"en":"Some speakers use a haplologic pronunciation of “February,” dropping a sound in the middle.","zh":"有些人会用一种脱音式读法来读 February，把中间的一个音省掉。"},{"en":"The researcher analyzed haplologic changes in everyday English pronunciation.","zh":"研究者分析了日常英语发音中的脱音变化。"}]}],"synonyms":["haplological","elliptical (in speech)","contracted (pronunciation)"],"phonetic":"/ˌhæpləˈlɑːdʒɪk/","extraExplanation":["“haplologic”来自语言学术语“haplology（脱音）”，词源可追溯到希腊语，含义与“简单/单一”有关。它强调的是：当相邻的两个音节或音非常相似时，口语里常会为了省力而省掉其中一个。","常见于口语或快速语流中，因此在拼写上通常仍保留原形（例如单词仍写作 library、February），但发音可能出现脱音式简化。写作中一般不建议刻意使用这种简化拼写，除非是在描写口语或方言。"]}
{"word":"haplological","summary":{"en":"relating to the dropping of one of two similar/repeated syllables or sounds","zh":"与相似/重复音节（语音）省略现象有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to haplology: a sound-change process where one of two similar or repeated syllables/sounds is dropped to make pronunciation easier.","zh":"与“haplology（音节/语音脱落）”有关的：指两个相似或重复的音节/语音中省略一个，以使发音更省力的语音变化。"},"examples":[{"en":"The word “probably” is often pronounced “probly” in casual speech; that reduction is sometimes described as haplological.","zh":"“probably”在口语中常被读成“probly”；这种缩减有时会被描述为一种haplological（脱落）现象。"},{"en":"In historical linguistics, scholars look for haplological changes when two similar syllables occur next to each other.","zh":"在历史语言学中，当相似音节相邻出现时，学者会关注是否发生了haplological（脱落）变化。"}]}],"synonyms":["haplologic","elision-related"],"phonetic":"/ˌhæp.ləˈlɑː.dʒɪ.kəl/","extraExplanation":["haplology 常用来说明：当词里出现重复或相似的音节（尤其相邻）时，人们为了省力会“少说一个”。常见例子包括口语里的缩读（如 probably→probly），以及某些历史演变中的形式变化。不同教材对个别例子是否严格算作 haplology 可能有分歧，但核心直觉都是“重复导致省略”。"],"etymology":"源自语言学术语 haplology（音节/语音脱落），来自希腊语 haplóos（“单一的、简单的”）+ -logy（“……之学”）；形容词后缀 -ical 构成 haplological，表示“与……相关的”。","mnemonic":["把它拆开记：haplo-（像“简单/变少”）+ -logical（“语言学/逻辑相关”）→“因为重复而变简单（少一个音节）的语言现象相关”。","联想中文口语“懒音/省音”：重复的部分容易被省掉；看到 haplological 就想到“省重复”。"]}
{"word":"haplologies","summary":{"en":"omission of one of two similar adjacent syllables/sounds in speech","zh":"相邻相似音节/音串中省掉一个的发音现象"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) the loss (omission) of one of two identical or very similar syllables (or sound sequences) that occur next to each other, making a word easier to say.","zh":"（语言学）相邻的两个相同或非常相似的音节（或音串）中省掉一个，使发音更省力的现象。"},"examples":[{"en":"In casual speech, “probably” becoming “probly” is often explained as haplology.","zh":"在口语中，“probably”读成“probly”常被解释为“相邻相似音节省略”（haplology）。"},{"en":"Some speakers say “library” like “libry,” which can be described as haplology.","zh":"有些人把“library”说成“libry”，也可以用 haplology 来描述。"}]}],"synonyms":["syllable loss","omission","contraction","phonological reduction","syncope"],"phonetic":"/hæˈlɑːlədʒi/","extraExplanation":["你输入的 “haplologies” 是复数形式；单数是 “haplology”。","它是一个语言学术语，多用于描述自然口语中的省音/简化现象；不同教材对具体例子（如 library→libry）是否算作典型 haplology 可能略有差异，但核心概念都是“相邻相似成分导致省略”。"],"etymology":"源自希腊语：haplo- 表示“单一、简化”，logos 表示“言语、话语”。合起来指“把重复/相似的发音简化掉”的现象。","mnemonic":["拆开记：haplo-≈“简化/单一”，-logy≈“言语/说法”；合起来就是“说话时把重复的发音简化掉”。","联想中文：像口语里把“差不多啦”说成“差不啦”——相邻相似音节容易被省掉。"]}
{"word":"haplology","summary":{"en":"Haplology is the linguistic process where one of two similar neighboring syllables is dropped (e.g., “probably” → “probly”).","zh":"Haplology 指语言中相邻相似（或重复）音节省略一个的现象（如 probably → probly）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) The loss or omission of one of two similar or identical syllables that occur next to each other, making a word easier to say.","zh":"（语言学）相邻两个相似或相同音节中的一个被省略的现象，使词更容易发音。"},"examples":[{"en":"Some speakers pronounce “probably” as “probly”; that kind of syllable loss can be explained by haplology.","zh":"有些人把 probably 读成 “probly”；这种音节省略可以用 haplology 来解释。"},{"en":"In fast speech, “library” is sometimes said as “libry,” an example often discussed in haplology.","zh":"在快速口语中，library 有时会说成 “libry”，这是讨论 haplology 时常见的例子。"}]}],"synonyms":["syllable loss","syllable deletion","phonological reduction","elision (general)"],"phonetic":"/hæˈplɑlədʒi/","extraExplanation":["haplology 来自希腊语词根：haplo-（“单一、简化”）+ -logy（“研究”）。它描述的是为了发音更省力，人们在口语或语言演变中把重复或相近的音节“说掉一个”。","它既可以出现在日常快速口语里（不算错误，更偏口语/非正式），也可能在历史演变中固定下来，成为标准拼写或固定形式。","相关概念：有时会和“sound reduction（语音弱化）”“syncope（中音省略）”一起讨论；但 haplology 的核心特征是“相邻的相似/重复音节导致省略”。"]}
{"word":"haploma","summary":{"en":"“Haploma” is not a standard English word; it’s likely a misspelling (often of “diploma”).","zh":"“haploma”不是标准英语单词；很可能是拼写错误（常见是把“diploma（文凭）”写错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most often a misspelling or a mistaken form of another word.","zh":"不是常见词典中的标准英语单词；多半是拼写错误或把别的词写错了。"},"examples":[{"en":"I can’t find “haploma” in a dictionary—did you mean “diploma”?","zh":"我在词典里找不到“haploma”——你是不是想写“diploma（文凭）”？"},{"en":"Please check the spelling of “haploma” in your essay.","zh":"请检查你作文里“haploma”的拼写。"}]}],"phonetic":"/hæˈploʊmə/","extraExplanation":["“haploma”最常见的情况是把 diploma（/dɪˈploʊmə/，文凭、证书）拼错了：di- 写成了 ha-。","如果你想表达生物/遗传相关概念，你可能在找的是 haploid（单倍体）或 haplotype（单倍型）。这两个词都以 haplo-（表示“单一/单倍”）开头，但和“文凭”无关。","如果你能提供一句包含“haploma”的原句（你看到它的上下文），我可以更准确判断你想要的词。"]}
{"word":"haplome","summary":{"en":"Haplome means the haploid (single-copy) set of chromosomes—the genome in a gamete or haploid cell.","zh":"haplome 指单倍体（单份拷贝）的染色体整套/基因组，常见于配子或单倍体细胞中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, genetics) The complete set of chromosomes (the haploid set) found in a gamete or in the haploid stage of an organism; essentially, a single-copy genome.","zh":"（生物学/遗传学）单倍体基因组；指配子或生物单倍体阶段所含的整套染色体（单倍体的一套），相当于“只有一份拷贝的基因组”。"},"examples":[{"en":"In humans, the haplome in a sperm or egg cell contains 23 chromosomes.","zh":"在人类中，精子或卵细胞的 haplome 含有 23 条染色体。"},{"en":"Researchers compared the haplome of the plant’s pollen to the diploid genome of its leaves.","zh":"研究人员将该植物花粉的 haplome 与叶片的二倍体基因组进行了比较。"}]}],"synonyms":["haploid genome","haploid set of chromosomes"],"phonetic":"/ˈhæploʊm/","extraExplanation":["这个词在日常英语里非常少见，主要出现在遗传学或基因组学写作中。更常见的表达是 haploid genome（单倍体基因组）或 haploid set of chromosomes（单倍体染色体组）。","词形上可理解为 haplo-（单一、单倍）+ -ome（整体、全体，如 genome/biome）。"]}
{"word":"haplomi","summary":{"en":"Haplomi is an older scientific term for a fish group (order), now rarely used in modern taxonomy.","zh":"Haplomi 是旧式的鱼类分类学术语（一个“目/类群”），现代分类中已较少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name used in older zoological classification for a group (order) of ray-finned fishes, especially pikes and their relatives; now largely replaced by more modern groupings (often Esociformes and related groups).","zh":"（旧式动物分类学用语）指一类辐鳍鱼的“目/类群”的学名，常与狗鱼及其近亲相关；现代分类中多已不用，常被更常见的分类（如 Esociformes 等）取代。"},"examples":[{"en":"In some older textbooks, pikes were placed in the order Haplomi.","zh":"在一些较旧的教科书里，狗鱼被归入 Haplomi 这一目。"},{"en":"Modern fish taxonomy rarely uses the term Haplomi in current scientific writing.","zh":"现代鱼类分类学在当代学术写作中很少再使用 Haplomi 这个术语。"}]}],"synonyms":["Esociformes (modern grouping, often used instead)"],"phonetic":"/hæpˈloʊmaɪ/","extraExplanation":["这是一个偏“历史用法/旧分类”的术语：早期分类学家会用 Haplomi 来概括某些鱼类的亲缘关系，但随着形态学与分子系统学的发展，分类方案发生了调整，所以你在新教材或新论文里不太会看到它。","如果你是在生物课/论文里遇到的词，也有可能是拼写或大小写问题：通常写作 Haplomi（首字母大写）。如果你想查的是别的词（比如 haplology / haploid 等），告诉我上下文句子我可以帮你确认。"]}
{"word":"haplomid","summary":{"en":"A rare biology term meaning “related to Haplomida,” a group of microscopic protists.","zh":"一个较少见的生物学术语，意为“与Haplomida有关/属于Haplomida”，即一类微小的原生生物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, rare) Relating to or belonging to Haplomida, a small taxonomic group of microscopic protists (single-celled organisms).","zh":"（生物学，较少见）与Haplomida（Haplomida类群）有关的；属于Haplomida的一类微小原生生物（单细胞生物）。"},"examples":[{"en":"The paper describes several haplomid species found in freshwater samples.","zh":"这篇论文描述了在淡水样本中发现的几种haplomid物种。"},{"en":"Haplomid organisms are studied under the microscope because they are extremely small.","zh":"由于体型极其微小，haplomid生物通常在显微镜下研究。"}]}],"synonyms":["haplomidan"],"phonetic":"/ˈhæpləˌmɪd/","extraExplanation":["“haplomid”不是日常英语词汇，多见于分类学/原生生物学的学术语境。不同教材或论文可能更常用“haplomidan”或直接写作该类群名（如Haplomida）。如果你是在文章里看到它，也有可能是拼写误差（例如想写“haploid”=单倍体）。你可以把原句发来，我可以帮你确认具体含义。"]}
{"word":"haplomidan","summary":{"en":"a Haplomida organism or something related to that group","zh":"单形目（Haplomida）生物，或与该类群相关的"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of Haplomida, a small group of unicellular organisms (protists) that includes some parasites, especially those infecting insects and other invertebrates","zh":"单形目（Haplomida）生物的成员；一类单细胞原生生物（原生生物类群），其中一些是寄生生物，常寄生于昆虫等无脊椎动物"},"examples":[{"en":"The paper reports a haplomidan parasite found in a freshwater insect.","zh":"这篇论文报道了一种在淡水昆虫中发现的单形目寄生生物。"},{"en":"Under the microscope, the haplomidan appears as a tiny single-celled organism.","zh":"在显微镜下，这种单形目生物呈现为微小的单细胞个体。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Haplomida","zh":"与单形目（Haplomida）有关的"},"examples":[{"en":"Researchers compared haplomidan sequences with those of other protists.","zh":"研究人员将单形目序列与其他原生生物的序列进行了比较。"}]}],"synonyms":["haplomid"],"phonetic":"/ˌhæploʊˈmaɪdən/","extraExplanation":["这是一个相对冷门的分类学词汇，更多出现在研究论文、物种描述或系统发育（基因序列比较）讨论中；日常英语里几乎不用。","如果你是在某篇论文或数据库里看到它，常见搭配有 haplomidan parasite（单形目寄生生物）、haplomidan lineage（单形目谱系）、haplomidan sequences（单形目序列）。"],"etymology":"学术构词：Haplomida（单形目）+ -an（表示“……的成员/与……有关的”）。Haplo- 来自希腊语，常见含义为“单一、简单”。该词主要用于分类学/微生物学语境。","mnemonic":["把它拆开记：haplo-（单一/简单）+ -an（某类人/某类成员）→ “单形目这一类的成员”。","联想中文“单（haplo）形目（Haplomida）+ 人/成员（-an）”。"]}
{"word":"haplomitosis","summary":{"en":"Haplomitosis is mitosis in haploid cells, producing haploid daughter cells.","zh":"Haplomitosis 指单倍体细胞中的有丝分裂，分裂后仍为单倍体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology) Mitosis that occurs in a haploid cell, producing haploid daughter cells without changing the number of chromosome sets.","zh":"（生物）发生在单倍体细胞中的有丝分裂，产生单倍体子细胞，不改变染色体组数。"},"examples":[{"en":"In many fungi, most growth happens through haplomitosis in the haploid stage.","zh":"在许多真菌中，大部分生长发生在单倍体阶段的 haplomitosis（单倍体有丝分裂）中。"},{"en":"During haplomitosis, the cell divides normally, but the offspring cells remain haploid.","zh":"在 haplomitosis 过程中，细胞正常分裂，但后代细胞仍保持单倍体。"}]}],"synonyms":["mitosis in haploid cells","haploid mitosis"],"phonetic":"/ˌhæploʊmaɪˈtoʊsɪs/","extraExplanation":["这个词主要出现在生物学/遗传学语境里，尤其用于描述某些藻类、真菌等生物在“以单倍体为主的生活史”中如何通过有丝分裂进行增殖。","词形可拆解理解：haplo-（单倍的）+ mitosis（有丝分裂）。与之相对、学习上更常见的概念是 diplo-（二倍的）相关阶段的有丝分裂，或 meiosis（减数分裂，会把倍性减半）。"]}
{"word":"haplomous","summary":{"en":"Haplomous means simple and straightforward; in rare/literary use, it can also mean sincerely honest.","zh":"haplomous 意为“简单直白的”；在较少见的文学用法中，也可指“真诚坦率的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"simple; straightforward; not complicated or mixed","zh":"简单的；直率的；不复杂或不混杂的"},"examples":[{"en":"He gave a haplomous explanation that everyone could understand.","zh":"他给了一个很简单直白的解释，大家都能听懂。"},{"en":"The design is haplomous, focusing on function rather than decoration.","zh":"这个设计很朴素，重在功能而不是装饰。"}]},{"partOfSpeech":"adj.","definition":{"en":"honest and sincere; without trickery or hidden motives (literary/rare)","zh":"真诚的；坦率的；不耍花招、没有隐藏动机的（文学/少见）"},"examples":[{"en":"She spoke with haplomous kindness.","zh":"她以真诚的善意说话。"},{"en":"In the story, the haplomous hero refuses to lie, even to win.","zh":"在故事里，这位坦率真诚的英雄宁可不赢也拒绝说谎。"}]}],"synonyms":["simple","straightforward","plain","uncomplicated","sincere","artless"],"phonetic":"/ˈhæploʊməs/","extraExplanation":["“haplomous”较少见，多见于文学或学术语境，和更常见的“haplous /ˈhæplaʊs/”同源，来自希腊语 *haploos*（意为“单一的、简单的”）。","它强调“单纯/不复杂/不混杂”的感觉，有时也带“质朴、坦诚”的文学色彩；日常英语里更常用 simple、straightforward、plain、sincere。"]}
{"word":"haplont","summary":{"en":"A haplont is an organism or life cycle mainly in the haploid stage, with a very brief diploid stage (often only the zygote).","zh":"haplont 指单倍体生物或单倍体型生活史：主要为单倍体阶段，二倍体阶段极短（常仅合子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organism (or life cycle) in which the main body is haploid (has one set of chromosomes) and the diploid stage is limited, often only the zygote.","zh":"单倍体生物；或指“单倍体型生活史”：生物体主要阶段为单倍体（只有一套染色体），二倍体阶段很短，常常仅限于合子。"},"examples":[{"en":"Many algae have a haplont life cycle, with the zygote as the only diploid stage.","zh":"许多藻类具有单倍体型生活史，合子是唯一的二倍体阶段。"},{"en":"In a haplont, meiosis usually happens soon after fertilization.","zh":"在单倍体型生活史中，减数分裂通常在受精后不久发生。"}]}],"synonyms":["haplontic organism","haplontic life cycle"],"phonetic":"/ˈhæp.lɑːnt/","extraExplanation":["词源提示：haplo- 表示“单一、单倍”，-ont 来自希腊语，和“存在的个体/生物”相关，所以 haplont 可理解为“单倍体的个体”。","对比记忆：haplont（单倍体为主）常与 diplont（二倍体为主，如许多动物）和 haplodiplont（单倍体与二倍体都多细胞、交替出现，如许多植物）一起学习。","使用场景：该词多见于生物学教材或学术文章，日常英语中很少用。"]}
{"word":"haplontic","summary":{"en":"Describes a life cycle where the haploid stage dominates and the diploid stage is very short.","zh":"描述一种以单倍体阶段为主、二倍体阶段极短的生活史类型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) having a life cycle in which the haploid stage is the main, long-lasting stage, and the diploid stage is brief (often only the fertilized egg/zygote).","zh":"（生物学）指一种生活史：单倍体阶段是主要且持续时间长的阶段，而二倍体阶段很短（常仅为受精卵/合子）。"},"examples":[{"en":"Many fungi have a haplontic life cycle, staying haploid for most of their lives.","zh":"许多真菌具有单倍体显性（haplontic）的生活史，一生大部分时间保持单倍体。"},{"en":"In a haplontic organism, meiosis happens soon after fertilization, returning cells to the haploid state.","zh":"在 haplontic 生物中，受精后不久就发生减数分裂，使细胞很快回到单倍体状态。"}]}],"synonyms":["haploid-dominant","haploid life cycle"],"phonetic":"/ˌhæp.lɑnˈtɪk/","extraExplanation":["词源提示：haplo- 表示“单一、单倍体”（haploid），-ontic 与“存在/生活史阶段”有关。","对比记忆：haplontic（单倍体为主） vs. diplontic（二倍体为主，多见于动物） vs. haplodiplontic（单双倍体阶段都较明显，多见于植物）。"]}
{"word":"haplonts","summary":{"en":"“Haplonts” is the plural of “haplont,” meaning organisms (or life-cycle stages) that are haploid for most of their life.","zh":"“haplonts”是“haplont”的复数，指大部分生命周期为单倍体的生物（或生命周期阶段）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A haploid organism or life-cycle stage that is haploid (has one set of chromosomes) for most of its life; typically, only the zygote is diploid.","zh":"单倍体生物；或指在生命周期中大部分时间为单倍体（只有一套染色体）的阶段；通常只有合子是二倍体。"},"examples":[{"en":"Many green algae have a haplont life cycle, where the main body is haploid.","zh":"许多绿藻属于单倍体型生活史，主体是单倍体。"},{"en":"In a haplont, meiosis happens soon after fertilization, returning the organism to a haploid state.","zh":"在单倍体型中，受精后不久就发生减数分裂，使生物回到单倍体状态。"}]}],"synonyms":["haploid organism","haploid stage"],"phonetic":"ˈhæp.lɑnt","extraExplanation":["“haplonts”通常是“haplont”的复数形式；如果你是在写生物学作业，单数用 haplont，复数用 haplonts。","这个词常出现在“世代交替/生活史”比较中：haplont（单倍体型）常与 diplont（二倍体型，如多数动物）对比；还有 haplodiplont（单倍体-二倍体交替，如许多植物）。"]}
{"word":"Haplopappus","summary":{"en":"a genus of daisy-family plants, often yellow-flowered shrubs in western North America","zh":"菊科的一类植物属，常见为北美西部黄色开花的灌木类"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the daisy family (Asteraceae), known for small yellow, daisy-like flower heads and often shrubby growth in western North America.","zh":"（植物）一种菊科（Asteraceae）植物属，常见为黄色小“雏菊状”花头，许多种在北美西部呈灌木状生长。"},"examples":[{"en":"In some older field guides, the shrub is listed under Haplopappus.","zh":"在一些较早的野外图鉴里，这种灌木被归在 Haplopappus 属下。"},{"en":"The botanist noted Haplopappus-like traits, especially the fluffy pappus on the seeds.","zh":"植物学家记录了类似 Haplopappus 的特征，尤其是种子上的绒毛状冠毛。"}]}],"synonyms":["goldenbush"],"phonetic":"ˌhæp.loʊˈpæp.əs","extraExplanation":["这是一个植物分类学属名，在不同年代/不同系统中范围有变动：部分原来归入 Haplopappus 的物种后来被拆分或转移到其他属（在北美植物志与现代文献中较常见）。因此你可能在旧书和新书里看到不同的拉丁学名组合。","pappus（冠毛）是菊科常见结构：像蒲公英那样的“毛毛”，帮助种子随风传播。理解这个部位，有助于记忆许多菊科属名和特征描述。"],"etymology":"源自希腊语构词：haplo-（“简单、单一”）+ pappus（“冠毛”，指菊科种子上帮助传播的绒毛/冠毛结构）。属名大意可理解为“冠毛较简单的（菊科植物）”。","mnemonic":["把它拆开记：haplo- ≈ “简单/单一（哈喽=简单打个招呼）” + pappus = “冠毛（像蒲公英的毛）”，合起来就是“冠毛比较简单的菊科植物”。","联想“菊科种子会飞的毛毛”：看到 pappus 就想到“蒲公英式冠毛”，再把 haplo- 记成“简单版冠毛”。"]}
{"word":"haploperistomate","summary":{"en":"having (or being) a protozoan with a simple oral region around the mouth","zh":"（指原生动物/纤毛虫）口区/口围结构较简单"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of certain ciliates/protozoans) having a simple peristome (the oral area around the cell mouth).","zh":"（某些纤毛虫/原生动物）具“单一/简单口围”（围绕细胞口的口区结构较简单）。"},"examples":[{"en":"Some older protozoology texts describe these ciliates as haploperistomate forms with a relatively simple oral region.","zh":"一些较早的原生动物学教材把这类纤毛虫描述为 haploperistomate 类型，即口区相对简单。"},{"en":"The species was placed in a haploperistomate group because its peristome lacks complex folds.","zh":"该物种被归入 haploperistomate 类群，因为它的口围缺少复杂的褶皱结构。"}]},{"partOfSpeech":"n.","definition":{"en":"A haploperistomate organism (a ciliate/protozoan characterized by a simple peristome).","zh":"单一口围型生物；指具简单口围特征的纤毛虫/原生动物。"},"examples":[{"en":"Under the microscope, the researcher compared a haploperistomate with a more complexly structured ciliate.","zh":"在显微镜下，研究者把一种 haploperistomate 与口区结构更复杂的纤毛虫作比较。"}]}],"synonyms":["simple-peristome","simple oral region"],"phonetic":"/ˌhæp.loʊˌpɛr.əˈstoʊ.meɪt/","extraExplanation":["这是一个较少见、偏“旧式分类/形态学描述”的术语，常见于原生动物学、纤毛虫形态与分类的文献中。现代分类体系可能改用更具体的类群名称，但该词仍可用来描述“口区/口围结构较简单”的形态特征。"],"etymology":"词源来自希腊语构词：haplo-（简单、单一）+ peri-（周围）+ stoma（口）+ -ate（形容词/名词后缀），字面义即“口周结构简单的”。","mnemonic":["拆词记：haplo（像“哈普罗=简单”）+ peri（周围）+ stoma（口）。联想成“口周（peri+stoma）很简单（haplo）”。"]}
{"word":"haploperistomic","summary":{"en":"A biology term (bryology) meaning a moss capsule has a single peristome (one ring/series of teeth).","zh":"生物学（苔藓学）术语，指苔藓的孢蒴蒴口只有单层（单圈）蒴齿结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a single peristome (one ring/series of teeth) at the mouth of a moss capsule; not double-peristomed.","zh":"（苔藓学）具“单齿环/单层齿环”的；蒴口只有一圈（或一层）蒴齿结构的；非双齿环的。"},"examples":[{"en":"Under the microscope, the specimen appears haploperistomic, with only one set of peristome teeth.","zh":"在显微镜下，这个标本呈现为单齿环型，只有一组蒴齿。"},{"en":"The key separates haploperistomic mosses from diploperistomic ones early on.","zh":"检索表一开始就把单齿环型苔藓与双齿环型苔藓区分开来。"}]}],"synonyms":["haploperistomous","monoperistomate"],"phonetic":"ˌhæpˌloʊˌpɛrɪˈstoʊmɪk","extraExplanation":["词源提示：haplo- 来自希腊语，意为“单、简单”；peristome 指苔藓蒴（孢蒴）开口处围绕蒴口的一圈“蒴齿/齿环”，常与孢子散布方式有关。","对初学者的直观理解：把蒴口想成“瓶口”，peristome 像一圈小“牙齿”；haploperistomic 就是只有“一圈牙齿”，而 diploperistomic 则是“内外两圈”。"]}
{"word":"haploperistomous","summary":{"en":"A botanical term (mainly for mosses) meaning “having a single peristome (one ring of capsule teeth).”","zh":"主要用于苔藓学的植物学术语，指“只有一圈蒴齿（单周齿）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, especially bryology) Having a simple peristome—i.e., having only one ring/series of peristome teeth around the opening of a moss capsule.","zh":"（植物学，尤指苔藓学）单周齿的；指苔藓孢蒴口缘的“蒴齿”（peristome teeth）只有一圈/一列，结构较简单。"},"examples":[{"en":"Under the microscope, the capsule appears haploperistomous, with a single circle of teeth at the mouth.","zh":"在显微镜下，这个孢蒴呈单周齿型，蒴口只有一圈蒴齿。"},{"en":"The field guide notes that this genus is typically haploperistomous rather than double-peristomed.","zh":"野外图鉴指出，这个属通常是单周齿型，而不是双周齿型。"}]}],"synonyms":["single-peristomed","monoperistomate","haploperistomate"],"phonetic":"/ˌhæp.loʊˌpɛr.ɪˈstoʊ.məs/","extraExplanation":["这个词主要用于苔藓分类与形态描述。peristome（蒴齿/蒴口齿）是苔藓孢蒴开口处的一圈“齿状结构”，会随着湿度变化开合，从而帮助孢子逐步散播。","词源可拆为：haplo-（单一、简单）+ peristome（蒴齿/蒴口结构）+ -ous（形容词后缀，“……的”）。与之相对的常见术语是 diplo-/double-peristome（双周齿、双层蒴齿）。"]}
{"word":"haplopetalous","summary":{"en":"Haplopetalous means “single-petaled,” having only one whorl of petals (not double-flowered).","zh":"haplopetalous 指“单瓣的”，只有一轮花瓣（非重瓣）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a single set (one whorl) of petals; not double-flowered.","zh":"（植物学）单瓣的；只有一轮花瓣的（非重瓣）。"},"examples":[{"en":"The gardener preferred haplopetalous varieties because they look closer to the wild form.","zh":"园丁更喜欢单瓣品种，因为它们看起来更接近野生形态。"},{"en":"In the field notes, the flower was described as haplopetalous and pale yellow.","zh":"在野外记录中，这种花被描述为单瓣、淡黄色。"}]}],"synonyms":["single-petaled","simple-flowered"],"phonetic":"/ˌhæp.loʊ.pəˈteɪ.ləs/","extraExplanation":["这个词比较少见，主要出现在植物分类、园艺描述里，用来和“重瓣（double-flowered）”做区分。","词源上可理解为“haplo-（单、简单）+ petal（花瓣）”，所以含义偏向“单层/单轮花瓣”。"]}
{"word":"haplophase","summary":{"en":"Haplophase is the haploid (n) stage of a life cycle.","zh":"Haplophase 指生活史中的单倍体（n）阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) The haploid stage in an organism’s life cycle, when cells have one set of chromosomes (n), typically producing gametes (sex cells).","zh":"（生物）生物生活史中的单倍体阶段，此时细胞只有一套染色体（n），通常与产生配子（性细胞）有关。"},"examples":[{"en":"In animals, the haplophase is usually limited to the gametes—sperm and egg cells.","zh":"在动物中，单倍体阶段通常只出现在配子——精子和卵细胞中。"},{"en":"Many algae have a long haplophase, with most of the organism’s life spent in the haploid form.","zh":"许多藻类的单倍体阶段很长，个体的大部分生命都以单倍体形式度过。"},{"en":"During the haplophase, cells carry only one copy of each chromosome.","zh":"在单倍体阶段，细胞每条染色体只有一份拷贝。"}]}],"synonyms":["haploid phase","haplontic phase (in some contexts)"],"phonetic":"/ˈhæp.loʊ.feɪz/","extraExplanation":["“haplophase”常见于讲“世代交替（alternation of generations）”的语境，尤其是植物、藻类、真菌等。它与“diplophase（双倍体阶段）”相对：前者是n，后者是2n。","词源上，haplo- 表示“单一、单倍”，-phase 表示“阶段”。学习时可联想 haploid（单倍体）与 diploid（双倍体）。"]}
{"word":"haplophyte","summary":{"en":"A haplophyte is a haploid organism or life stage (one set of chromosomes), common in the life cycles of algae and plants.","zh":"haplophyte 指单倍体的生物体或生命阶段（只有一套染色体），常见于藻类和植物的生活史中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) An organism (or life stage) that has a single set of chromosomes (haploid), especially the haploid phase in the life cycle of many algae and plants.","zh":"（生物）具有一套染色体（单倍体）的生物体（或生命阶段）；尤指许多藻类和植物生活史中的单倍体阶段。"},"examples":[{"en":"In many algae, the haplophyte produces gametes (sex cells).","zh":"在许多藻类中，单倍体阶段（haplophyte）会产生配子（性细胞）。"},{"en":"The diagram shows the haplophyte and the diploid stage in alternation.","zh":"这张图展示了单倍体阶段（haplophyte）与二倍体阶段交替出现。"}]}],"synonyms":["haploid phase","gametophyte (often related, but not always identical)"],"phonetic":"ˈhæploʊˌfaɪt","extraExplanation":["词根提示：haplo- 表示“单一的、单倍的”，-phyte 表示“植物/植物体”。因此 haplophyte 字面意思接近“单倍体植物（阶段）”。","常见于“世代交替（alternation of generations）”的语境：单倍体阶段通常产生配子；配子结合形成合子（zygote），发育为二倍体阶段。不同生物群（如某些藻类、苔藓、蕨类等）哪一代更“显著”会不同。"]}
{"word":"haplopia","summary":{"en":"Haplopia is an accidental omission of a repeated or similar part in writing/copying (e.g., leaving out one of two similar syllables).","zh":"Haplopia 指因相似或重复内容导致的漏写/漏抄现象（如漏掉一个重复音节）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics / text editing) The accidental omission of one of two similar or repeated letters, syllables, or words, especially in writing or copying.","zh":"（语言学／文献校勘）由于相邻或近处出现相似/重复的字母、音节或词而造成的“漏写、漏抄”现象。"},"examples":[{"en":"In old manuscripts, haplopia sometimes occurs when a scribe skips from one similar ending to the next.","zh":"在古抄本中，抄写员有时会因两个相似的词尾而直接跳过去，从而出现 haplopia（漏抄）。"},{"en":"Writing “probly” instead of “probably” can be explained as haplopia.","zh":"把 “probably” 写成 “probly” 可用 haplopia（漏写）来解释。"}]}],"synonyms":["haplography","haplology"],"phonetic":"/hæˈploʊpiə/","extraExplanation":["这个词在实际使用中比较少见，很多教材或论文更常用的术语是 **haplography**（漏写/漏抄）或 **haplology**（语音层面的“省略一个重复音节”，如 *probably → probly* 在口语或书写中常被拿来举例）。","记忆法：**haplo-** 来自希腊语，含义是“单一、简化”；它强调“把重复的部分简化掉”，因此指向“省略”而不是“重复”。与之相反的概念常提到 **dittography**（误把内容重复写了一遍）。"]}
{"word":"haplopias","summary":{"en":"Haplopias means “single vision” (the opposite of double vision) and is the plural of haplopia.","zh":"haplopias 指“单视”（与复视相对），是 haplopia 的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"single vision; the normal condition of seeing one image (not double vision).","zh":"单视；（医学/眼科）看到单一影像的正常视力状态（非复视）。"},"examples":[{"en":"After the treatment, the patient reported haplopia again instead of double vision.","zh":"治疗后，患者表示恢复了单视，不再出现复视。"},{"en":"The doctor checked whether the child had diplopia or haplopia when looking to the side.","zh":"医生检查孩子侧视时是复视还是单视。"}]}],"synonyms":["single vision","normal vision"],"phonetic":"/hæpˈloʊpiəz/","extraExplanation":["词形说明：haplopias 是 haplopia 的复数形式。","词源提示：haplo- 来自希腊语，表示“单一/简单”，-opia 表示“视觉/视力”。在眼科语境中常用来与 diplopia（复视）对比。"]}
{"word":"haploscope","summary":{"en":"A haploscope is an instrument that shows different images to each eye to study binocular vision and eye alignment.","zh":"haploscope 是一种分别向左右眼呈现不同图像、用于研究双眼视觉与眼位对齐的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device used in vision science to present separate images to each eye, often to study binocular vision, eye alignment, and depth perception.","zh":"一种用于视觉科学的仪器，可分别向左右眼呈现不同图像，常用于研究双眼视、眼位对齐与立体深度知觉。"},"examples":[{"en":"The researcher used a haploscope to measure the participant’s binocular fusion.","zh":"研究人员用单眼分视镜来测量受试者的双眼融合能力。"},{"en":"In the clinic, a haploscope can help evaluate strabismus (eye misalignment).","zh":"在临床上，单眼分视镜可帮助评估斜视（眼位不正）。"}]}],"synonyms":["synoptophore","stereoscope","binocular vision apparatus"],"phonetic":"/ˈhæp.ləˌskoʊp/","extraExplanation":["词源提示：haplo- 来自希腊语，意为“单一/简单”；-scope 表示“观察器械”。虽然名字里有“haplo-（单）”，但它的用途常与“双眼”相关：通过把两只眼的视觉输入分开，反而更容易研究双眼如何协同工作。","学术语境中更常见的相关词有 synoptophore（同视机）或 stereoscope（立体镜）。haploscope 多用于研究设置，尤其是在双眼融合、集合(convergence)与调节(accommodation)等实验中。"]}
{"word":"haploscopic","summary":{"en":"Haploscopic means ‘related to haploscopy/haploscope,’ a technique for testing binocular vision by showing different images to each eye.","zh":"haploscopic 指“与单视镜/单视检查法相关”，即通过向左右眼分别呈现不同图像来检测双眼视觉的技术。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a haploscope or to haploscopy (a method that presents separate images to each eye to study binocular vision, eye alignment, and depth perception).","zh":"与“单视镜（haploscope）”或“单视检查法（haploscopy）”有关的（指把不同图像分别呈现给左右眼，用于研究双眼视觉、眼位与立体感等）。"},"examples":[{"en":"The researcher used a haploscopic setup to measure how quickly the eyes align on a target.","zh":"研究人员使用单视镜装置来测量眼睛对准目标的速度。"},{"en":"Haploscopic tests can help evaluate binocular vision problems such as strabismus.","zh":"单视检查可以帮助评估斜视等双眼视觉问题。"}]}],"synonyms":["haploscopy-related","haploscopic (as a technical modifier)","binocular-testing (near meaning, broader)"],"phonetic":"/ˌhæp.ləˈskɑp.ɪk/","extraExplanation":["词源提示：haplo- 来自希腊语，常表示“单一、简单”（与 double/dual 相对）；-scopic 与“观看、观察”有关（如 microscope 显微镜）。合起来强调“用于观察（双眼视觉时）分别呈现的单独图像”。","使用场景：多见于视光学、眼科学、视觉心理学论文或临床检查记录中，属于较专业的学术/技术用语，日常英语里很少用。"]}
{"word":"haploscopy-related","summary":{"en":"connected with clinical testing or study of binocular vision using a haploscope","zh":"与使用单视镜进行双眼视觉检查或研究有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with haploscopy (the clinical testing or study of binocular vision using a haploscope)","zh":"与单视镜检查/单视镜学（用单视镜评估或研究双眼视觉的临床方法）有关的"},"examples":[{"en":"The clinic offers haploscopy-related assessments for patients with double vision.","zh":"这家诊所为复视患者提供与单视镜检查相关的评估。"},{"en":"She reviewed haploscopy-related measurements of eye alignment before the surgery.","zh":"她在手术前复核了与单视镜检查相关的眼位测量数据。"}]}],"synonyms":["binocular-vision-related","orthoptic","stereoscopic"],"phonetic":"ˌhæpˈlɑːskəpi rɪˈleɪtɪd","extraExplanation":["haploscopy 常见于眼科与视光学（尤其是斜视与双眼视觉/视功能检查）。haploscope（单视镜）是一种让双眼分别看到不同目标、用来评估眼位与融合能力的仪器。","这种写法多见于学术或医疗语境：haploscopy-related tests/measurements/findings（相关的检查/测量/发现）。日常英语里更常直接说 binocular-vision testing（双眼视觉检查）或 strabismus evaluation（斜视评估）。"],"etymology":"源自 haploscopy：haplo- 来自希腊语，意为“单一、简单”；-scopy 来自希腊语 skopein，意为“观察、查看”。加上 related 构成形容词，表示“与……相关的”。","mnemonic":["把 haplo- 记成“哈啰=单（一个）”，-scopy 记成“scope=镜子/观察”，合起来就是“用镜子做单（分开）观察”的检查；再加 related=“相关的”。"]}
{"word":"haploses","summary":{"en":"“Haploses” means multiple instances of haplosis—shortenings where one of two similar/repeated syllables (or sounds) is dropped.","zh":"“haploses”是 haplosis 的复数，指多个“同音/重复音节省略”造成的缩短现象或例子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of haplosis: cases where a word becomes shorter because one of two similar or repeated syllables (or sounds) is dropped in speech or over time","zh":"haplosis 的复数：指由于相邻的相似/重复音节（或语音）其中一个被省略，而使词在口语或历史演变中变短的现象/例子"},"examples":[{"en":"In casual speech, “probably” often becomes “probly”; linguists treat these as haploses.","zh":"在随意口语中，“probably”常变成“probly”；语言学家会把这种例子视为 haploses。"},{"en":"Some dialects show haploses in fast conversation, especially with repeated syllables.","zh":"一些方言在快速对话中会出现 haploses，尤其当音节重复时更明显。"}]}],"synonyms":["haplologies (often used for the process)","sound deletions (general)","syllable loss (general)"],"phonetic":"hæpˈloʊsiz","extraExplanation":["“haplosis”常与“haplology（同音省略/重音节省略）”一起出现：haplology更常用来指“过程/规律”，haplosis更像指“具体发生的结果/例子”。","常见触发环境：相邻或近邻位置出现相同或非常相似的音节/语音，为了发音省力而省略一个（多见于快速口语，也可能长期固定成新的词形）。"]}
{"word":"haplosis","summary":{"en":"Haplosis is a linguistic process where one of two similar adjacent syllables/sounds is dropped (e.g., “probably” → “probly”).","zh":"Haplosis 指语言中相邻的相似音节/语音被省略的现象（如 probably → probly）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) the loss of one of two identical or very similar syllables (or sounds) when they occur next to each other, often to make a word easier to say.","zh":"（语言学）当两个相同或非常相似的音节（或语音）相邻出现时，其中一个被省略的现象，常见于为了更顺口、更省力的发音。"},"examples":[{"en":"Some speakers pronounce “probably” with haplosis, sounding like “probly.”","zh":"有些人把 probably 用“haplosis（相邻相似音节省略）”来读，听起来像 “probly”。"},{"en":"In casual speech, “library” may show haplosis and sound like “libry.”","zh":"在随意口语里，library 有时会出现 haplosis，听起来像 “libry”。"}]}],"synonyms":["haplology","syllable loss","elision (related)"],"phonetic":"/hæpˈloʊsɪs/","extraExplanation":["haplosis 常被当作 haplology 的近义词使用；两者都指“重复/相似音节导致的省略”。在语言学写作中，你也可能更常见到 haplology 这个术语。","词源来自希腊语词根，含义与“简单、单一（single/simple）”有关，强调通过省略让发音更“简化”。","它多用于描述自然口语变化或历史音变（语言长期演化中的读音变化），而不是“拼写错误”。"]}
{"word":"haplostemonous","summary":{"en":"A botanical adjective meaning a flower has only one whorl of stamens.","zh":"植物学形容词：指花只有一轮雄蕊。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having only one whorl of stamens (usually the outer whorl), instead of two.","zh":"（植物学）单雄蕊轮的；只有一轮雄蕊（通常是外轮），而不是两轮。"},"examples":[{"en":"In this flower, the androecium is haplostemonous, with a single ring of stamens.","zh":"这朵花的雄蕊群是单雄蕊轮的，只有一圈雄蕊。"},{"en":"Some plant families show haplostemonous flowers as a common structural pattern.","zh":"一些植物科常见单雄蕊轮的花作为结构特征。"}]}],"synonyms":["single-whorled (of stamens)","monostemonous (related term; sometimes used in specific contexts)"],"phonetic":"/ˌhæp.loʊ.stəˈmiː.nəs/","extraExplanation":["词源提示：haplo- 表示“单一、简单”，stemonous 来自 stamen（雄蕊）。合起来就是“只有一轮雄蕊”。","相关对比：diplostemonous（双雄蕊轮，常见为外轮与内轮各一圈）；obdiplostemonous（外内轮位置关系相对“倒置”的双雄蕊轮）。这些术语常用于描述花的雄蕊排列与轮数（androecium）。"]}
{"word":"haplotype","summary":{"en":"A haplotype is a group of DNA variants on one chromosome that are inherited together.","zh":"haplotype 指同一条染色体上一组通常一起遗传的DNA变异（单倍型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of DNA variations (markers) on one chromosome that are usually inherited together from one parent; used to study ancestry, genetic traits, and disease risk.","zh":"单倍型：位于同一条染色体上的一组DNA变异（标记），通常作为一个整体从父母一方一起遗传；常用于研究祖源、遗传特征与疾病风险。"},"examples":[{"en":"Researchers compared haplotypes to see how the disease might be inherited in a family.","zh":"研究人员比较了不同的单倍型，以判断这种疾病在家族中可能如何遗传。"},{"en":"A DNA test can sometimes estimate ancestry by analyzing common haplotypes in different populations.","zh":"DNA检测有时会通过分析不同人群中常见的单倍型来推测祖源。"}]}],"synonyms":["genetic haplotype","haplogroup (related, not the same)"],"phonetic":"/ˈhæp.lə.taɪp/","extraExplanation":["词源：haplo- 表示“单一的/单倍的”，-type 表示“类型”。在遗传学中它强调“同一条染色体上一起传递的一组变异”，并不等同于“基因型”（genotype，个体所有基因的总体）。","常见搭配：mitochondrial haplotype（线粒体单倍型，母系遗传）、Y-chromosome haplotype（Y染色体单倍型，父系遗传）、haplotype block（单倍型区块）、haplotype frequency（单倍型频率）。"]}
{"word":"haply","summary":{"en":"Haply is a literary, old-fashioned adverb meaning “by chance,” and sometimes “perhaps.”","zh":"haply 是较古旧、偏文学的副词，常指“偶然地”，有时也表示“也许”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(old-fashioned/literary) By chance; accidentally.","zh":"（古旧/文学用语）偶然地；碰巧地。"},"examples":[{"en":"I haply met an old friend on the train.","zh":"我在火车上偶然遇见了一位老朋友。"},{"en":"Haply, the key was still in his pocket.","zh":"碰巧钥匙还在他口袋里。"}]},{"partOfSpeech":"adv.","definition":{"en":"(old-fashioned) Perhaps; maybe.","zh":"（古旧用法）也许；可能。"},"examples":[{"en":"Haply we shall meet again.","zh":"也许我们还会再见。"}]}],"synonyms":["by chance","accidentally","perhaps","maybe"],"phonetic":"/ˈhæpli/","extraExplanation":["“haply”在现代英语里很少用于日常口语，多见于诗歌、圣经体或莎士比亚等古典文学中。现代更常用的表达是“by chance / accidentally”或“perhaps / maybe”。","词源上与“hap”（意为“运气、偶然发生的事”）有关，也能帮助理解它和“happen（发生）”“perhaps（也许）”在意义上的关联。"]}
{"word":"happ","summary":{"en":"“Happ” isn’t a standard word; it’s usually a typo for “happy,” or a truncation related to the old word “hap” meaning “luck/chance.”","zh":"“happ”不是标准英语单词；通常是把“happy”打错，或与古词“hap（运气/偶然）”相关的截断形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard modern English word) Most often seen as a misspelling or truncation of “hap” or “happy,” or as part of words like “happen.”","zh":"（不是现代英语中的标准单词）多见于把“hap（机缘/运气）”或“happy（快乐的）”写错/截断，或作为“happen（发生）”等词的一部分。"},"examples":[{"en":"I typed “happ” by accident—I meant “happy.”","zh":"我不小心打了“happ”——我想写的是“happy”。"},{"en":"In older texts, you’re more likely to see “hap,” not “happ.”","zh":"在较早的文本里，你更可能看到“hap”，而不是“happ”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Usually written as “hap”) luck or chance; an accident or event that happens unexpectedly (literary/old-fashioned).","zh":"（通常写作“hap”）运气；机缘；偶然发生的事（文学/较古旧用法）。"},"examples":[{"en":"By sheer hap, they met again years later.","zh":"纯属机缘巧合，他们多年后又相遇了。"},{"en":"It was no hap that he arrived early; he planned it.","zh":"他早到并非偶然；那是计划好的。"},{"en":"A mishap delayed our trip.","zh":"一个小意外耽误了我们的行程。"}]}],"synonyms":["luck","chance","accident"],"phonetic":"/hæp/","extraExplanation":["“hap”是一个较古老的词根，核心含义是“运气/偶然”。它保留在一些常见词里：\n- mishap（小意外）= mis-（坏的）+ hap（运气/偶然）\n- perhaps（也许）最初有“碰巧也可能”的感觉\n- happen（发生）原义和“偶然降临”有关\n现代日常英语里，人们很少单独用“hap”，更常用 luck / chance / accident。"]}
{"word":"happed","summary":{"en":"“Happed” is an old form meaning “happened,” and it can also (in dialect/poetry) mean “covered or wrapped.”","zh":"“happed”是“hap”的古体形式，常表示“发生了/碰巧发生”；在方言或诗歌中也可表示“被覆盖/被裹住”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) past tense and past participle of “hap,” meaning “happened” or “occurred,” often with a sense of chance or fate.","zh":"（古体）“hap”的过去式/过去分词，意思是“发生了、出现了”，常带有“偶然、命运使然”的感觉。"},"examples":[{"en":"It happed that we met again on the same road.","zh":"（古体）我们又在同一条路上相遇，这件事恰巧发生了。"},{"en":"As it happed, the letter arrived the next morning.","zh":"（古体）碰巧的是，那封信第二天早上就到了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Dialect/poetic) covered, wrapped, or cloaked.","zh":"（方言/诗歌用法）被裹住的、被覆盖的、披着的。"},"examples":[{"en":"The child lay happed in blankets.","zh":"孩子裹在毯子里躺着。"},{"en":"A figure happed in a dark cloak stood at the door.","zh":"一个披着黑斗篷的人影站在门口。"}]}],"synonyms":["happened","occurred","chanced","befell","wrapped","covered"],"phonetic":"/hæpt/","extraExplanation":["“happed”在现代英语里很少见。你更常见到的是“happened”。“hap”这个词在古英语/中古英语里表示“机会、偶然、命运”，所以古文里常用“it happed that …”表达“恰巧……发生”。","形容词用法（表示“裹着/披着”）更偏方言或诗歌体，常见搭配有“happed in (blankets/a cloak)”。"]}
{"word":"happen","summary":{"en":"“Happen” means “occur/take place,” “become real,” or “occur by chance (happen to…).”","zh":"“happen”表示“发生/出现”“成为现实”，也可表示“碰巧（happen to…）”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to take place; to occur (often unexpectedly or without planning)","zh":"发生；出现（常指意外或非计划地）"},"examples":[{"en":"What happened last night?","zh":"昨晚发生了什么？"},{"en":"Accidents happen, so please be careful.","zh":"意外难免发生，所以请小心。"},{"en":"The meeting will happen at 3 p.m.","zh":"会议将在下午三点举行。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become true or real; to come about","zh":"变成现实；实现；成为事实"},"examples":[{"en":"I never thought this would happen.","zh":"我从没想过这会发生。"},{"en":"If it happens, we’ll deal with it.","zh":"如果真的发生了，我们会处理的。"}]},{"partOfSpeech":"vi.","definition":{"en":"to chance to be; to do something by chance (usually in “happen to…”)","zh":"碰巧；恰好（常用于“happen to…”）"},"examples":[{"en":"I happened to meet her at the station.","zh":"我碰巧在车站遇见了她。"},{"en":"Do you happen to know his phone number?","zh":"你恰好知道他的电话号码吗？"}]}],"synonyms":["occur","take place","come about","chance (to)"],"phonetic":"/ˈhæpən/","extraExplanation":["常见搭配：\n- happen to + 动词：表示“碰巧做某事”。\n- happen to + 人：表示“某事发生在某人身上”（更常用 happen to sb）。例：What happened to him?（他怎么了？）\n- happen + 时间/地点：表示“在某时/某地发生”。\n语气提示：在口语里，\"What happened?\" 很常用来表示关心或询问情况，相当于“怎么了？”"]}
{"word":"happenchance","summary":{"en":"Happenchance means an accidental or coincidental event (archaic).","zh":"happenchance 指“偶然/巧合的事件”（偏古用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A chance event; something that happens by accident rather than by plan (a coincidence).","zh":"（古用）偶然事件；意外发生的事（巧合），并非计划之中。"},"examples":[{"en":"I met her again by happenchance at the station.","zh":"我在车站偶然又遇见了她。"},{"en":"The discovery was pure happenchance, not careful planning.","zh":"这项发现纯属偶然，并非周密计划的结果。"}]}],"synonyms":["chance","coincidence","accident","fortuity"],"phonetic":"/ˈhæpənˌtʃæns/","extraExplanation":["“happenchance”是较古老的用法，现代英语里更常用“chance”“coincidence”或“by chance”。它由“happen（发生）+ chance（偶然）”组合而来，强调“事情就这么碰巧发生了”。","在文学或旧文本中，你可能会看到类似结构，如“by happenchance”“through happenchance”，用来营造较书面、古典或叙事性的语气。"]}
{"word":"happened","summary":{"en":"“Happened” means “took place” and is the past form of “happen,” often used to ask what occurred or what became of someone/something.","zh":"“happened”是“happen”的过去式/过去分词，表示“发生”；也常用于提问某事发生了什么或某人/某物后来怎么样了。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “happen”; to take place (often unexpectedly).","zh":"“happen”的过去式和过去分词；（常指意外地）发生。"},"examples":[{"en":"What happened last night?","zh":"昨晚发生了什么？"},{"en":"The accident happened so fast.","zh":"事故发生得太快了。"},{"en":"It happened again, even after we were careful.","zh":"即使我们很小心，它还是又发生了。"}]},{"partOfSpeech":"v.","definition":{"en":"Used in questions to ask what became of someone or something (often: “What happened to…?”).","zh":"用于提问，询问某人/某物后来怎么样了（常用：What happened to…?）。"},"examples":[{"en":"What happened to your phone?","zh":"你的手机怎么了？（发生了什么事？）"},{"en":"Whatever happened to that old café?","zh":"那家老咖啡馆后来怎么样了？"}]}],"synonyms":["occurred","took place","came about"],"phonetic":"/ˈhæpənd/","extraExplanation":["“happen”通常指事件“发生/出现”，强调结果或事实；如果想强调“人为造成”，更常用“cause”（导致）或“make…happen”（让……发生）。","常见口语搭配：\n- “It happens.”=“这种事会发生/正常。”（带安慰语气）\n- “Whatever happened to…?” 表示怀旧或惊讶：“……后来怎么就不见了/变成那样了？”"]}
{"word":"happening","summary":{"en":"“Happening” most commonly means something that is occurring now; it can also mean a current event or (informally) something trendy and popular.","zh":"“happening”最常见表示“正在发生的/正在进行的”，也可指“正在发生的事件”；口语中还可表示“时髦、热门的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An event or situation that is occurring now or taking place.","zh":"正在发生的事情；正在进行的事件或状况。"},"examples":[{"en":"Anything exciting happening this weekend?","zh":"这个周末有什么令人兴奋的事情要发生吗？"},{"en":"There’s a lot happening in the city right now.","zh":"这座城市现在发生了很多事情。"},{"en":"The meeting is happening in Room 204.","zh":"会议正在204房间举行。"}]},{"partOfSpeech":"adj.","definition":{"en":"Occurring now; taking place at the present time.","zh":"正在发生的；正在进行的。"},"examples":[{"en":"The happening conversation in the hallway made it hard to focus.","zh":"走廊里正在进行的谈话让我很难集中注意力。"},{"en":"We should respond to what’s happening, not what we wish were happening.","zh":"我们应该回应正在发生的事，而不是我们希望发生的事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fashionable, trendy, and popular (often used in the phrase “a happening place”).","zh":"时髦的；很热门的（常见于短语“a happening place”）。"},"examples":[{"en":"That café is a happening spot for students.","zh":"那家咖啡馆是学生们很火的聚点。"},{"en":"She always knows the most happening places to eat.","zh":"她总是知道最热门的吃饭地点。"}]}],"synonyms":["occurrence","event","going on","taking place","current","trendy","popular"],"phonetic":"/ˈhæpənɪŋ/","extraExplanation":["“happening”来自动词“happen（发生）”的现在分词形式。日常口语里最常见的是名词用法：What’s happening?（最近怎么样/发生什么事？），语气比“How are you?”更随意。","形容词表示“时髦、热门”时，通常用于地点或场景（a happening bar/club/neighborhood），比较口语化；在正式写作里更常用“popular/trendy”。"]}
{"word":"happenings","summary":{"en":"“Happenings” means events or activities that occur; it can also refer to experimental art events (less common).","zh":"“happenings”指发生的事件/活动/动态；也可指较少见的实验性行为艺术活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Events or things that happen, especially activities or news in a place or time.","zh":"（某地或某段时间发生的）事件、事情；（尤指）活动或新闻动态。"},"examples":[{"en":"There are a lot of exciting happenings in the city this weekend.","zh":"这个周末城里有很多精彩的活动。"},{"en":"I like reading about current happenings around the world.","zh":"我喜欢阅读世界各地的时事动态。"}]},{"partOfSpeech":"n.","definition":{"en":"A happening can also mean a public event or performance, often something artistic or experimental (less common).","zh":"happening 也可指（较少见）“行为艺术/实验性表演”等公众活动，常带艺术或前卫色彩。"},"examples":[{"en":"The gallery hosted a happening with music, dance, and audience participation.","zh":"画廊举办了一场结合音乐、舞蹈并邀请观众参与的行为艺术活动。"},{"en":"In the 1960s, artists created happenings to blur the line between art and everyday life.","zh":"在20世纪60年代，艺术家用“happenings”来模糊艺术与日常生活的界限。"}]}],"synonyms":["events","occurrences","goings-on","news","activities"],"phonetic":"/ˈhæpənɪŋz/","extraExplanation":["“happenings”通常是复数，用来概括“最近发生的各种事情/动态”，语气比“events”更口语、也更像“杂七杂八的事情”。","第二个义项的“Happening(s)”常见于艺术史语境，尤其指20世纪60年代欧美的前卫艺术活动；日常生活中不常用。"]}
{"word":"happens","summary":{"en":"“Happens” means “occurs/takes place,” and it can also mean “turns out to be true” or “does something by chance.”","zh":"“happens”表示“发生/出现”，也可表示“原来是事实/恰好是这样”，或“碰巧做某事”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of an event or situation) to occur; to take place.","zh":"（事件或情况）发生；出现。"},"examples":[{"en":"The accident happened around midnight.","zh":"事故大约在午夜发生。"},{"en":"What happens if I press this button?","zh":"如果我按这个按钮会发生什么？"},{"en":"A lot can happen in a day.","zh":"一天之内可能发生很多事。"}]},{"partOfSpeech":"v.","definition":{"en":"to be true; to be the case (often used with “it (so) happens that…”).","zh":"属实；碰巧是这样（常用于“it (so) happens that…”）。"},"examples":[{"en":"It happens that I know her brother.","zh":"碰巧我认识她哥哥。"},{"en":"That happens to be the only copy we have.","zh":"那恰好是我们仅有的一份。"}]},{"partOfSpeech":"v.","definition":{"en":"to do something by chance or unexpectedly (often used with “happen to…”).","zh":"偶然做某事；碰巧（常用于“happen to…”）。"},"examples":[{"en":"I happened to see him at the mall.","zh":"我碰巧在商场看见他了。"},{"en":"If you happen to have time, could you help me?","zh":"如果你刚好有时间，可以帮我一下吗？"}]}],"synonyms":["occurs","takes place","comes about","transpires","ensues"],"phonetic":"/ˈhæpənz/","extraExplanation":["“happens”是动词“happen”的一般现在时第三人称单数形式：He/She/It happens…；在疑问句和否定句里常用助动词does：Does it happen often? / It doesn’t happen often。","常见搭配：happen to + 动词（碰巧做某事）；happen to + 人/物（发生在……身上）；what happened?（发生什么事了？）；as it happens（碰巧；事实上）。"]}
{"word":"happenstance","summary":{"en":"Happenstance means a coincidence—something that occurs by chance rather than by design.","zh":"Happenstance 指“巧合、偶然”，强调事情并非刻意安排而是碰巧发生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coincidence; something that happens by chance, not by planning","zh":"巧合；偶然发生的事（非刻意安排）"},"examples":[{"en":"By pure happenstance, we met again in the same small café.","zh":"纯属巧合，我们又在同一家小咖啡馆遇见了。"},{"en":"It was happenstance that led her to discover the old photo in the attic.","zh":"她在阁楼发现那张旧照片纯属偶然。"}]}],"synonyms":["coincidence","chance","accident","fortuity"],"phonetic":"/ˈhæpənˌstæns/","extraExplanation":["“happenstance”常用于比较正式的语境，强调“偶然性”而非“命运安排”。日常口语里更常用“coincidence”或“by chance”。","词形上看像“happen + circumstance”，但它并不是一个严格由这两个词直接拼合而来的日常构词；它更像是为了表达“偶然发生的情境”而形成的文学/正式用词。"]}
{"word":"happenstances","summary":{"en":"a chance or unexpected event","zh":"偶然事件；意外巧合"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chance event; something that happens unexpectedly (often used for small, everyday coincidences).","zh":"偶然发生的事；意外的小插曲（常指日常中的巧合）。"},"examples":[{"en":"By a series of happenstances, they met again in the same café years later.","zh":"一连串的偶然巧合，让他们多年后在同一家咖啡馆又相遇了。"},{"en":"The trip was shaped by small happenstances—missed trains, kind strangers, sudden rain.","zh":"这趟旅行被许多小插曲塑造——误点的火车、好心的陌生人、突如其来的雨。"}]}],"synonyms":["chance","coincidence","accident","fortuity","twist of fate","fluke"],"phonetic":"/ˈhæpənˌstæns/","extraExplanation":["happenstance 常被当作 “chance” 或 “coincidence” 的较文艺/书面说法。复数 happenstances 用来强调“很多个小巧合/小插曲”。","和 circumstance 的区别：circumstance 更像“情境/条件/环境”，不一定是偶然；happenstance 更强调“偶然发生”。"],"etymology":"来自 happen（发生）+ -stance（类似 circumstance 的构词）。20世纪英语里更常见，用来表示“偶然发生的情况/巧合”，语气比 accident 更轻、也更偏“机缘”。","mnemonic":["把它拆开记：happen（发生）+ stance（情形/状态）→ “发生出来的情形”＝偶然情况。","联想中文“机缘巧合”：happenstance ≈ 机缘；happenstances ≈ 一连串机缘。"]}
{"word":"happer","summary":{"en":"Happer is an uncommon word today; in Scottish usage it means a halfpenny coin or something of very small value.","zh":"Happer 在现代英语中不常见；在苏格兰用法里指“半便士硬币”，也可引申为“不值钱的小东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) A halfpenny coin; something worth very little.","zh":"（苏格兰口语）半便士硬币；（引申）几乎不值钱的小东西。"},"examples":[{"en":"He didn’t have a happer to his name.","zh":"他身无分文。"},{"en":"It’s not worth a happer.","zh":"这东西不值一文。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/nonstandard) A person or thing that happens or turns up (very uncommon in modern English).","zh":"（罕见/非标准）偶然出现的人或事物（现代英语中几乎不用）。"},"examples":[{"en":"By chance, a strange happer changed the plan.","zh":"偶然发生的一件怪事改变了计划。"}]}],"synonyms":["halfpenny (Scot.)","trifle","next to nothing"],"phonetic":"/ˈhæpər/","extraExplanation":["“happer”在现代标准英语里很少见，更多是苏格兰英语/方言用法（尤其指“half penny”，半便士）。如果你想表达“发生”，常用的是动词 **happen**；如果你想说“更快乐的人”，可能是 **happier**（happy 的比较级）。","词根 **hap-** 有“运气、偶然”的意思（如 *perhaps, mishap*）。因此方言里的“happer”也常带有“微不足道、碰巧”的语感。"]}
{"word":"happier","summary":{"en":"“Happier” is the comparative form of “happy,” meaning more happy or more satisfied than before or than someone/something else.","zh":"“happier”是“happy”的比较级，表示“更快乐/更满意”，可用于和过去或他人/其他情况作比较。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More happy; feeling or showing more pleasure, satisfaction, or contentment (comparative form of “happy”).","zh":"更快乐的；更高兴的；更满意的（happy 的比较级）。"},"examples":[{"en":"I’m happier now that I’ve found a job I enjoy.","zh":"我现在更快乐了，因为我找到了自己喜欢的工作。"},{"en":"She looks happier in the new school.","zh":"她在新学校看起来更开心。"},{"en":"We’d be happier if we had more time together.","zh":"如果我们有更多时间在一起，我们会更幸福/更开心。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used to compare two people or situations: having a higher level of happiness than another.","zh":"用于比较两个人或两种情况：比另一方更快乐/更幸福。"},"examples":[{"en":"He seems happier than he was last year.","zh":"他看起来比去年更开心。"},{"en":"Which option would make you happier: staying here or moving?","zh":"哪种选择会让你更开心：留在这里还是搬走？"}]}],"synonyms":["more joyful","more glad","more content","more pleased"],"phonetic":"/ˈhæpiɚ/","extraExplanation":["“happier”是拼写变化的比较级：happy → happier（把 y 变成 i 再加 -er）。","口语里常见搭配：happier with/without（没有/有……更开心），happier about（对……更满意/更高兴）。","注意语气差别：happy偏“开心”，而在某些语境里“be happier”也可更接近“更满意/更合适”。"]}
{"word":"happiest","summary":{"en":"“Happiest” means “the most happy,” and it can also mean “the best/most suitable” in some contexts.","zh":"“happiest”表示“最快乐的”，在某些语境中也可表示“最理想的、最合适的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “happy”: more happy than anyone or anything else; feeling the most pleasure, joy, or satisfaction.","zh":"“happy”的最高级：最快乐的；比任何人或任何事都更开心、满足。"},"examples":[{"en":"She was the happiest person in the room when she heard the news.","zh":"听到这个消息时，她是房间里最开心的人。"},{"en":"This is the happiest day of my life.","zh":"这是我一生中最快乐的一天。"},{"en":"I’m happiest when I’m with my family.","zh":"和家人在一起时我最快乐。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most suitable or best (often in the phrase “the happiest choice/solution/ending”).","zh":"最合适的；最理想的（常用于“the happiest choice/solution/ending”等表达）。"},"examples":[{"en":"We agreed on the happiest solution for everyone.","zh":"我们达成了对所有人都最理想的解决方案。"},{"en":"It wasn’t the happiest ending, but it was honest.","zh":"这不是最圆满的结局，但很真实。"}]}],"synonyms":["most joyful","most cheerful","most delighted","best","most suitable"],"phonetic":"/ˈhæpiəst/","extraExplanation":["“happiest”是规则比较：happy → happier → happiest。拼写变化是因为happy以辅音字母+y结尾，变级时y变成i再加-er/-est。","常见搭配：the happiest day/time/moment；feel happiest；make someone happiest。注意：口语里也常说“the happiest I’ve ever been”（我有史以来最开心的）。"]}
{"word":"happify","summary":{"en":"Happify means “to make happier” (someone or something), and it’s a playful, informal word often used online or in marketing.","zh":"happify 指“让（人或事物）更开心/更愉快”，语气俏皮、非正式，常见于网络或营销语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(informal) To make someone feel happier; to cheer up or improve someone’s mood.","zh":"（非正式）让某人更开心；使心情变好；逗乐、取悦。"},"examples":[{"en":"That silly video totally happified me after a long day.","zh":"那段搞笑视频让我在忙了一天后瞬间开心起来。"},{"en":"Small compliments can happify a team more than you expect.","zh":"一句小小的称赞，可能比你想的更能让团队开心起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal) To make something more pleasant or enjoyable; to add a “happy” feeling to it.","zh":"（非正式）让某事/某物更愉快、更讨喜；为其增添“快乐感”。"},"examples":[{"en":"They added warm colors and soft lighting to happify the room.","zh":"他们用暖色和柔和的灯光让房间更温馨、更让人愉快。"},{"en":"The update aims to happify the user experience with playful animations.","zh":"这次更新希望用有趣的动画让用户体验更“快乐”。"}]}],"synonyms":["cheer up","make happy","brighten","uplift","delight"],"phonetic":"/ˈhæpəˌfaɪ/","extraExplanation":["“happify”是比较新的口语/网络用词，由“happy + -ify（使……变成）”构成，语气轻松、俏皮，常见于广告文案、社交媒体或产品/APP描述中。正式写作更常用“make (someone) happy / cheer up / brighten (someone’s) day / improve (someone’s) mood”。"]}
{"word":"happiless","summary":{"en":"Happiness means the feeling or state of being happy; it can also mean well-being or good fortune in a more formal sense.","zh":"Happiness 指“幸福、快乐”的感受或状态；也可在较正式语境中指“福祉、安康、好运”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The feeling of being happy; a state of pleasure, contentment, or joy.","zh":"幸福；快乐；满足或喜悦的状态。"},"examples":[{"en":"Her happiness was clear when she saw her family at the airport.","zh":"当她在机场看到家人时，她的幸福感非常明显。"},{"en":"Money can help, but it doesn’t always bring happiness.","zh":"钱能提供帮助，但不一定能带来幸福。"},{"en":"He found happiness in simple routines like walking after dinner.","zh":"他在简单的日常里找到幸福，比如晚饭后散步。"}]},{"partOfSpeech":"n.","definition":{"en":"Good fortune or well-being in life (a more formal or literary use).","zh":"好运与安康；生活的福祉（较正式或文学用法）。"},"examples":[{"en":"We wish you health and happiness in the new year.","zh":"我们祝你新年健康幸福。"},{"en":"The constitution speaks of the pursuit of happiness.","zh":"宪法中提到“追求幸福”。"}]}],"synonyms":["joy","pleasure","contentment","delight","well-being"],"phonetic":"/ˈhæpinəs/","extraExplanation":["“happiless”不是标准英语单词。你可能想写的是“happiness”（幸福、快乐）。","词形小提示：happy（快乐的）+ -ness（名词后缀，表示“……的状态”）= happiness（快乐/幸福的状态）。","如果你想表达“缺少快乐/不快乐”，常用的是“unhappy”（不快乐的）或“sad”（难过的）。理论上“happy + -less”会变成“happyless”，但这种形式不常用，通常不用来表达。"]}
{"word":"happily","summary":{"en":"Happily means “with joy,” “gladly/willingly,” or sometimes “fortunately,” depending on context.","zh":"happily 可表示“愉快地”“乐意地”，在某些语境中也可表示“幸好/幸运地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a happy way; with joy or pleasure.","zh":"愉快地；高兴地；带着喜悦或满足的心情。"},"examples":[{"en":"The children played happily in the park.","zh":"孩子们在公园里玩得很开心。"},{"en":"She smiled happily when she heard the good news.","zh":"听到好消息时，她开心地笑了。"}]},{"partOfSpeech":"adv.","definition":{"en":"Willingly or gladly (often used to show readiness to do something).","zh":"乐意地；欣然地（常用来表示很愿意做某事）。"},"examples":[{"en":"I’d happily help you with your homework.","zh":"我很乐意帮你做作业。"},{"en":"They would happily accept the invitation.","zh":"他们会欣然接受邀请。"}]},{"partOfSpeech":"adv.","definition":{"en":"Fortunately or in a way that turns out well (used in some formal or British-style writing).","zh":"幸好；幸运地（在一些较正式或偏英式的用法中更常见）。"},"examples":[{"en":"Happily, no one was injured in the accident.","zh":"幸好，这场事故没有人受伤。"}]}],"synonyms":["joyfully","cheerfully","gladly","willingly","fortunately"],"phonetic":"/ˈhæpɪli/","extraExplanation":["“happily”来自形容词“happy”，加上副词后缀“-ly”构成，表示“以……的方式”。学习时可对比：happy（开心的）→ happily（开心地）。","语气区别小提示：句首的“Happily, ...”通常表示“幸好/所幸”，和“Luckily, ...”接近；而“smiled happily”则是情绪上的“开心地”。"]}
{"word":"happiness","summary":{"en":"Happiness means the state of being happy—feeling joy, pleasure, or contentment; more formally, it can also mean good fortune.","zh":"Happiness 指“幸福/快乐/满足感”；在较正式或偏旧的用法中也可指“好运”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the feeling or state of being happy; joy, pleasure, or contentment","zh":"幸福；快乐；满足感（感到开心的情绪或状态）"},"examples":[{"en":"Her happiness was obvious when she saw her family.","zh":"当她见到家人时，她的幸福感显而易见。"},{"en":"Money can bring comfort, but it doesn’t always bring happiness.","zh":"钱能带来舒适，但不一定带来幸福。"}]},{"partOfSpeech":"n.","definition":{"en":"good luck or a fortunate situation (a more formal or old-fashioned use)","zh":"好运；顺遂（较正式或偏旧的用法）"},"examples":[{"en":"The happiness of the timing helped us avoid the traffic.","zh":"时机之巧（好运气）让我们避开了堵车。"}]}],"synonyms":["joy","contentment","pleasure","delight","well-being"],"phonetic":"/ˈhæpinəs/","extraExplanation":["“happiness”常指比较稳定、持续的“幸福感/满足感”，而“joy”更偏向强烈、短暂的“喜悦”。在日常表达里，想说“我今天很开心”更常用“I’m happy today.”；想说“我追求幸福”则常用“I’m pursuing happiness.”","在美国文化语境中，“the pursuit of happiness（追求幸福）”很有代表性，出自《独立宣言》，强调个人有追求更好生活与满足感的权利。"]}
{"word":"happiness-centered","summary":{"en":"Focused on well-being as the central aim.","zh":"以幸福感与身心福祉为核心目标的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Focused on happiness as the main goal, value, or guiding principle.","zh":"以幸福为核心目标、价值或指导原则的；以提升幸福感为中心的。"},"examples":[{"en":"She wants a happiness-centered life, not just a successful career.","zh":"她想要一种以幸福为中心的生活，而不只是事业上的成功。"},{"en":"The school adopted a happiness-centered approach that supports students’ well-being.","zh":"这所学校采用以幸福为中心的方式来支持学生的身心健康。"},{"en":"Their happiness-centered policy includes flexible hours and mental-health days.","zh":"他们以幸福为中心的政策包括弹性工时和心理健康假。"}]}],"synonyms":["happiness-focused","well-being-centered","wellness-centered","life-centered","fulfillment-focused","values-driven"],"phonetic":"ˈhæpinəs ˌsɛntərd","extraExplanation":["这种结构（X-centered）在英语里很常见，表示“以X为中心/以X为核心来组织或决策”。例如：child-centered（以儿童为中心）、user-centered（以用户为中心）、community-centered（以社区为中心）。","语气通常偏正面、价值导向；在正式写作中也可用 happiness-focused 或 well-being-centered 表达类似意思。"],"etymology":"由 happiness（幸福、快乐）+ centered（以……为中心的）构成的复合形容词；常见于职场文化、教育、心理健康与生活方式语境，用来强调“把幸福感放在核心位置”。","mnemonic":["把它拆开记：happiness（幸福）+ centered（中心的）= “幸福在中心”。","联想中文常说的“以人为本/以客户为中心”，同样结构：把 happiness 换进去就是“以幸福为中心”。"]}
{"word":"happiness-producing","summary":{"en":"causing or creating feelings of happiness","zh":"能带来快乐或幸福感的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing happiness; making people feel happy or giving pleasure.","zh":"带来幸福的；使人感到快乐的；令人愉悦的。"},"examples":[{"en":"She chose happiness-producing activities like hiking and cooking with friends.","zh":"她选择了能带来幸福感的活动，比如徒步和与朋友一起做饭。"},{"en":"Small, happiness-producing habits can improve your mood over time.","zh":"一些小小的、带来幸福感的习惯，久而久之能改善心情。"}]}],"synonyms":["joyful","uplifting","pleasing","gratifying","heartwarming","mood-boosting","happiness-inducing"],"phonetic":"/ˈhæpinəs prəˈdusɪŋ/","extraExplanation":["写作中也常用近似结构：“stress-producing”（制造压力的）、“confidence-producing”（增强自信的）。","语气偏书面；日常口语里更常说 “makes you happy / brings happiness / uplifting”。"],"etymology":"由 happiness（幸福、快乐）+ producing（产生……的）构成的复合形容词；“-producing”表示“产生/带来某种结果”。常见于较正式或学术语境，用来强调“能引发某种情绪或效果”。","mnemonic":["拆开记：happiness（幸福）+ producing（生产/产生）→“生产幸福”的东西。","联想中文：把它当成“幸福生成器（happiness generator）”。"]}
{"word":"happinesses","summary":{"en":"different moments or kinds of joy and contentment","zh":"多种或多次的快乐与满足感"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “happiness”; different kinds or moments of being happy","zh":"“happiness”的复数；指不同种类或不同瞬间的快乐/幸福"},"examples":[{"en":"The book explores the small happinesses of everyday life.","zh":"这本书探讨日常生活中那些细小的幸福感。"},{"en":"She remembered the happinesses of childhood summers.","zh":"她回想起童年夏日的种种快乐。"}]}],"synonyms":["joys","delights","pleasures","blessings","contentments"],"phonetic":"/ˈhæpinəsɪz/","extraExplanation":["happiness 通常是不可数名词（指总体的“幸福/快乐”），但在写作或较正式语境中也可变为可数，用复数 happinesses 来表达“许多具体的快乐/幸福时刻”。例如：the little happinesses of life（生活中的小确幸）。"],"etymology":"来自 happy（快乐的）+ 名词后缀 -ness（表示“状态/性质”）→ happiness（幸福、快乐）；其复数 happinesses 多用于强调“多种/多次的快乐”。","mnemonic":["记 -ness = “……的状态”（如 darkness 黑暗、kindness 善意），所以 happy + -ness = “快乐的状态”。","复数 -es 常出现在以 -s/-x/-z/-ch/-sh 结尾的词后；这里 happiness 以 s 音结尾，复数写作 happinesses（读起来像 “-iz”）。"]}
{"word":"happing","summary":{"en":"“Happing” is a rare, old-fashioned word meaning either a covering/wrapping or (archaically) “happening.” In modern English, you usually want “happening.”","zh":"“happing”是较少见的古用词，可指“覆盖物/包裹物”，也可古义表示“正在发生”。现代英语里通常应写作“happening”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) a covering, wrapping, or cloak; something used to cover or protect.","zh":"（罕见/古用）覆盖物、包裹物；斗篷；用来遮盖或保护的东西。"},"examples":[{"en":"She pulled the woolen happing tighter around her shoulders.","zh":"她把羊毛披裹物拉得更紧，裹住肩膀。"},{"en":"In old stories, a child might be laid in a warm happing beside the fire.","zh":"在古老故事里，孩子可能会被裹在温暖的包裹物中，放在火炉旁。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare/archaic) happening; occurring (present participle of the old verb “hap,” meaning “to happen”).","zh":"（罕见/古用）正在发生；发生着（古动词 hap“发生”的现在分词）。"},"examples":[{"en":"Strange things were happing in the village after dark.","zh":"天黑后，村子里发生着奇怪的事情。"}]}],"synonyms":["covering","wrapping","cloak (rare sense)","happening (archaic sense)"],"phonetic":"/ˈhæpɪŋ/","extraExplanation":["“happing”在现代英语里非常少见。日常写作中，人们更常用 **happening**（正在发生的事/正在发生）或 **happening(s)**（事件）。如果你本来想表达“正在发生”，通常应拼作 **happening**。","名词“happing”（覆盖物/披裹物）在苏格兰英语和较老的文学/民谣语境中更可能见到。"]}
{"word":"happy","summary":{"en":"“Happy” most commonly means feeling joy or contentment, and it can also mean being satisfied or willing to do something.","zh":"“happy”最常指“开心/满足”，也可表示“满意”或“乐意做某事”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling pleasure, joy, or contentment.","zh":"感到快乐、喜悦或满足的。"},"examples":[{"en":"I’m happy to see you again.","zh":"我很高兴再次见到你。"},{"en":"She felt happy after finishing her exams.","zh":"她考完试后感到很开心。"}]},{"partOfSpeech":"adj.","definition":{"en":"Satisfied or pleased with a situation or choice; willing to accept something.","zh":"对某种情况或选择感到满意；愿意接受某事。"},"examples":[{"en":"I’m happy with the results.","zh":"我对结果很满意。"},{"en":"Are you happy to wait for ten minutes?","zh":"你愿意等十分钟吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Lucky; bringing good fortune (common in fixed phrases).","zh":"幸运的；带来好运的（多见于固定搭配）。"},"examples":[{"en":"This is a happy coincidence.","zh":"这是个幸运的巧合。"}]}],"synonyms":["glad","pleased","joyful","cheerful","content"],"phonetic":"/ˈhæpi/","extraExplanation":["“happy”在日常口语里非常常见：\n- “happy to + 动词”：表示“很乐意/愿意做……”（更偏礼貌与态度），不一定是强烈的“开心”。例：I’m happy to help.（我很乐意帮忙。）\n- “happy for + 人”：表示“替某人高兴”。例：I’m happy for you.（我为你高兴。）","含义差别小提示：\n- happy：偏“开心/满足”，语气中性、常用。\n- glad：常用于“听到/看到某事很高兴”，语气更像“松了一口气”。\n- pleased：更正式，常用于礼貌表达或“满意”。"]}
{"word":"happy-go-lucky","summary":{"en":"Cheerful and carefree.","zh":"乐天、无忧无虑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cheerful and carefree; not worried much about the future.","zh":"乐天的、无忧无虑的；不太为未来担心的。"},"examples":[{"en":"She’s a happy-go-lucky person who rarely gets stressed about deadlines.","zh":"她是个很乐天的人，很少因为截止日期而焦虑。"},{"en":"His happy-go-lucky attitude helped the team stay calm during the crisis.","zh":"他那种无忧无虑的态度帮助团队在危机中保持冷静。"},{"en":"I used to be more happy-go-lucky, but work made me more careful.","zh":"我以前更无忧无虑，但工作让我变得更谨慎。"}]}],"synonyms":["carefree","easygoing","lighthearted","sunny","untroubled"],"phonetic":"/ˌhæpi ɡoʊ ˈlʌki/","extraExplanation":["语气通常是正面的，强调“轻松、乐观”。但在某些语境里也可能带一点批评：比如不够负责、缺乏规划。","常见搭配：happy-go-lucky attitude/personality/spirit（乐天的态度/性格/精神）。"],"etymology":"源自口语表达“happy-go-lucky”，大意是“开心就走、随遇而安”。其中“go-lucky”带有“听天由命/靠运气”的感觉，整体在20世纪早期广泛用来形容性格乐观、不太计划的人。","mnemonic":["拆开记：happy（开心）+ go（走）+ lucky（靠运气）→“开开心心地走，靠运气也不怕”。","联想中文：像“随遇而安”“船到桥头自然直”的人。"]}
{"word":"Happyness","summary":{"en":"“Happyness” is a common misspelling; the correct word is “happiness.”","zh":"“Happyness”是常见拼写错误；正确单词是“happiness”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) The correct spelling is “happiness”: the feeling of being happy; joy; satisfaction.","zh":"（常见拼写错误）正确拼写是“happiness”：幸福、快乐、满足的感觉。"},"examples":[{"en":"I’m looking for happiness in simple daily routines.","zh":"我在简单的日常作息里寻找幸福感。"},{"en":"Her happiness grew when she spent more time with family.","zh":"她花更多时间陪家人后，幸福感增强了。"}]}],"synonyms":["joy","delight","contentment","pleasure"],"phonetic":"/ˈhæpinəs/","extraExplanation":["“Happyness”通常是把 happy + -ness（名词后缀）拼写错了：正确写法是 happi-ness，因为以辅音字母+y 结尾时，加 -ness 前一般把 y 变成 i。","在正式写作（作文、邮件、简历）中建议始终使用 “happiness”。如果你想表达“让人快乐的事/来源”，也可以用 “a source of happiness”（幸福的来源）。"]}
{"word":"HAPs","summary":{"en":"“HAPs” most commonly means Hazardous Air Pollutants; it can also mean hospital-acquired pneumonias (medical) or high-altitude platforms (tech), depending on context.","zh":"“HAPs”最常见指危险空气污染物；也可能指医院获得性肺炎（医学）或高空平台（科技），需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Acronym) Hazardous Air Pollutants; air pollutants known to cause or may cause serious health effects (like cancer) or environmental harm.","zh":"（缩写）危险空气污染物；指已知或可能导致严重健康危害（如致癌）或环境危害的空气污染物。"},"examples":[{"en":"The factory must monitor emissions of HAPs under federal rules.","zh":"该工厂必须根据联邦规定监测危险空气污染物（HAPs）的排放。"},{"en":"Reducing HAPs can improve public health in nearby neighborhoods.","zh":"减少危险空气污染物（HAPs）可以改善周边社区的公共健康。"}]},{"partOfSpeech":"n.","definition":{"en":"(Acronym, medical) Hospital-acquired pneumonias (plural of HAP); pneumonias that develop during a hospital stay.","zh":"（缩写，医学）医院获得性肺炎（HAP 的复数）；指在住院期间发生的肺炎。"},"examples":[{"en":"The ICU team reviewed recent HAPs to improve infection control.","zh":"重症监护团队回顾了近期的医院获得性肺炎（HAPs），以改进感染控制。"}]},{"partOfSpeech":"n.","definition":{"en":"(Acronym, tech) High-Altitude Platforms; aircraft or balloons used as communication or observation platforms at very high altitudes.","zh":"（缩写，科技）高空平台；指在高空作为通信或观测平台使用的飞机或气球等。"},"examples":[{"en":"Some companies are testing HAPs to provide internet coverage in remote areas.","zh":"一些公司正在测试高空平台（HAPs），为偏远地区提供网络覆盖。"}]}],"synonyms":["toxic air pollutants","hazardous air pollutants","air toxics"],"phonetic":"/hæps/","extraExplanation":["HAPs 在环境领域常见于美国《清洁空气法》（Clean Air Act）语境中，指受监管的“有毒空气污染物”（也常被称为 toxic air pollutants）。不同文件或行业里同一缩写可能代表不同概念，阅读时可通过上下文词（如 emissions/air/permit 或 hospital/ICU 或 telecom/internet）来判断。"]}
{"word":"haps","summary":{"en":"Haps is an archaic word meaning “chances” or “accidents” (unplanned events).","zh":"haps 是古用词，意思是“偶然的机会/意外”，指非计划发生的事情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) chances or accidents; random events that happen without being planned.","zh":"（古用）偶然的机会；意外；随机发生的事情。"},"examples":[{"en":"In old poems, people spoke of “the haps of war,” meaning the unpredictable accidents of battle.","zh":"在旧诗中，人们会说“the haps of war”，指战争中难以预料的意外。"},{"en":"By haps and fortune, they met again after many years.","zh":"因缘巧合之下，他们多年后又重逢。"}]}],"synonyms":["chances","accidents","fortunes","random events"],"phonetic":"/hæps/","extraExplanation":["“haps”是古用词，多见于文学或较老的文本中，通常是“hap”（偶然、机缘）的复数形式。现代英语里更常用chance(s)、accident(s)、random event(s)等。","“perhaps”这个常用词历史上可理解为“per haps”（by chance，出于偶然）演变而来；在古文本里偶尔会见到分开的写法或与“hap/haps”相关的表达。"]}
{"word":"hapsburg","summary":{"en":"The Habsburgs were a major European royal dynasty, best known for ruling Austria and much of Central Europe.","zh":"哈布斯堡是欧洲重要的皇室王朝，以统治奥地利及中欧大片地区而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a powerful European royal family (dynasty) that ruled Austria and many other lands, especially from the late Middle Ages to the early 1900s.","zh":"哈布斯堡王朝（欧洲著名的皇室家族/王朝），统治奥地利及欧洲多地，尤其中世纪晚期至20世纪初势力强大。"},"examples":[{"en":"The Habsburgs controlled large parts of Central Europe for centuries.","zh":"哈布斯堡家族几个世纪以来控制着中欧的大片地区。"},{"en":"World War I began after the assassination of Archduke Franz Ferdinand of the Habsburg family.","zh":"第一次世界大战的导火索之一是哈布斯堡家族的弗朗茨·斐迪南大公遇刺。"}]}],"synonyms":["House of Habsburg","Habsburg dynasty","Austrian royal house"],"phonetic":"/ˈhæbzbɝːɡ/","extraExplanation":["常见拼写是 **Habsburg**（你写的 *hapsburg* 多半是拼写误差）。也会看到 **Hapsburg** 作为较少见的变体拼写，但学术与主流英文中以 Habsburg 为主。","“Habsburg”常指“哈布斯堡王朝/家族”，在英语历史语境里经常与 **Austrian Empire（奥地利帝国）**、**Holy Roman Empire（神圣罗马帝国）**、以及后来的 **Austria-Hungary（奥匈帝国）**联系在一起。","文化语境中常提到的特点包括：通过联姻扩张势力（常被概括为“用婚姻而非战争扩张”），以及“哈布斯堡下巴”（Habsburg jaw）等与家族通婚有关的历史讨论。","文学与文化作品里，哈布斯堡常作为“帝国政治、宫廷阴谋、旧欧洲秩序”的象征出现，例如涉及维也纳宫廷、欧洲列强外交的历史小说与影视作品。"]}
{"word":"hapsody","summary":{"en":"a freely structured, highly emotional piece of music or a passionate expression","zh":"结构自由、情感强烈的音乐作品或热情洋溢的抒发"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of music with a free, improvisational feel and strong emotion, not tightly following a fixed structure.","zh":"（音乐）狂想曲；结构较自由、情感强烈、像即兴般展开的乐曲。"},"examples":[{"en":"We listened to Liszt’s rhapsody and noticed how it shifts moods quickly.","zh":"我们听了李斯特的狂想曲，发现它的情绪变化很快。"},{"en":"The composer wrote a rhapsody based on folk melodies.","zh":"作曲家用民间旋律写了一首狂想曲。"}]},{"partOfSpeech":"n.","definition":{"en":"An excited, emotional way of speaking or writing that feels like a passionate outburst.","zh":"（言谈/写作）热情洋溢的抒情；激动的长篇赞叹或抒发。"},"examples":[{"en":"Her essay is a rhapsody about the beauty of the sea.","zh":"她的文章是一段对大海之美的热情抒写。"},{"en":"He went into rhapsodies about the new restaurant.","zh":"他对那家新餐厅赞不绝口，讲得兴致勃勃。"}]}],"synonyms":["fantasy","capriccio","improvisation","ecstasy","enthusiasm","eulogy"],"phonetic":"/ˈræpsədi/","extraExplanation":["常见搭配：go into rhapsodies about sth（对某事赞不绝口）。","在音乐里，rhapsody 往往带有“民间旋律/民族色彩 + 自由结构 + 强烈情感”的印象，如《匈牙利狂想曲》《波西米亚狂想曲》等。"],"etymology":"源自希腊语 rhapsōidia，原指“吟诵史诗的表演/片段”，与古希腊“史诗朗诵者”有关；后来意义扩展为“情感奔放、结构较自由的作品”，用于音乐与文字表达。","mnemonic":["联想“rap(说唱) + sody(像 melody 的尾巴)”：像在音乐里情绪很满、自由发挥的段落。","把它记成“热情到飞起的抒情（狂想）”：看到 rhapsody 就想到“狂想曲/激情抒写”。"]}
{"word":"hapten","summary":{"en":"A hapten is a small molecule that becomes immunogenic only when attached to a larger carrier protein.","zh":"hapten（半抗原）指一种小分子，需与载体蛋白结合后才具有免疫原性并能引发免疫反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small molecule that by itself cannot trigger an immune response, but can do so when it attaches to a larger “carrier” protein; it can then be recognized by antibodies.","zh":"半抗原：一种小分子本身不能引发免疫反应，但与较大的“载体”蛋白结合后可诱导免疫反应，并可被抗体识别。"},"examples":[{"en":"Penicillin can act as a hapten after it binds to proteins in the body, which may cause an allergic reaction in some people.","zh":"青霉素在与体内蛋白结合后可充当半抗原，从而在部分人群中引发过敏反应。"},{"en":"Researchers linked the hapten to a carrier protein to produce antibodies for their lab test.","zh":"研究人员把半抗原连接到载体蛋白上，以便产生用于实验检测的抗体。"}]}],"synonyms":["partial antigen","incomplete antigen"],"phonetic":"/ˈhæp.tɛn/","extraExplanation":["“hapten”常见于免疫学与药物过敏相关语境。核心要点是：半抗原太小，单独不能“让免疫系统注意到”；一旦与体内蛋白（载体）结合，形成新的复合物表面结构，免疫系统才可能把它当作“外来物”来反应。","词源上与希腊语“haptein”（意为“系住、附着”）有关，强调“附着到载体上”这一机制。"]}
{"word":"hapten-associated","summary":{"en":"related to immune effects involving a hapten bound to a carrier","zh":"与半抗原（常需与载体结合）相关的免疫反应/现象"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to, caused by, or involving a hapten (a small molecule that can trigger an immune response only when attached to a larger carrier such as a protein).","zh":"与“半抗原”有关的；由半抗原引起的；涉及半抗原的（半抗原是小分子，通常需与蛋白等载体结合才会引发免疫反应）。"},"examples":[{"en":"The patient developed a hapten-associated allergic reaction after taking the antibiotic.","zh":"患者在服用该抗生素后出现了半抗原相关的过敏反应。"},{"en":"Researchers studied hapten-associated dermatitis using a mouse model.","zh":"研究人员用小鼠模型研究半抗原相关的皮炎。"},{"en":"Some drug side effects are hapten-associated because the drug binds to proteins in the body.","zh":"一些药物副作用属于半抗原相关，因为药物会与体内蛋白结合。"}]}],"synonyms":["hapten-related","hapten-linked","hapten-bound","hapten-mediated"],"phonetic":"/ˈhæptən əˈsoʊʃiˌeɪtɪd/","extraExplanation":["半抗原（hapten）本身通常“太小”，免疫系统不容易单独识别；当它与体内蛋白结合形成复合物后，才可能被当作“异物”引发免疫反应，因此医学论文里常见“hapten-associated drug allergy（半抗原相关药物过敏）”这类说法。"],"etymology":"“hapten”源自希腊语 haptein，意为“抓住、结合”，用来指需要“结合”到载体蛋白上才更易被免疫系统识别的小分子；“associated”表示“相关的”。合起来即“与半抗原相关的”。","mnemonic":["记“hapten”≈“黏/抓住”(haptein=抓住)：小分子要“抓住/黏上”蛋白载体，才更容易引发免疫反应。"]}
{"word":"hapten-like","summary":{"en":"similar to a hapten in triggering immune responses (often when bound to a carrier).","zh":"类似半抗原的（常指与载体结合后可诱发免疫反应）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hapten; behaving in a way similar to a small molecule that can trigger an immune response only when attached to a larger carrier (often used in immunology, allergy, and drug-reaction contexts).","zh":"类似“半抗原”的；表现得像一种小分子本身免疫原性不足、但与较大载体结合后可引发免疫反应的物质（常见于免疫学、过敏与药物反应语境）。"},"examples":[{"en":"Some drug metabolites can form hapten-like structures that the immune system recognizes as foreign.","zh":"一些药物代谢产物可能形成类似半抗原的结构，使免疫系统将其识别为外来物。"},{"en":"The paper discusses hapten-like chemicals in cosmetics and their role in contact dermatitis.","zh":"这篇论文讨论了化妆品中类似半抗原的化学物质及其在接触性皮炎中的作用。"},{"en":"Researchers tested whether the compound showed hapten-like activity when bound to a carrier protein.","zh":"研究人员检测该化合物与载体蛋白结合后是否表现出类似半抗原的活性。"}]}],"synonyms":["haptenic","haptenoid","hapten-related"],"phonetic":"/ˈhæptən laɪk/","extraExplanation":["半抗原（hapten）本身通常太小，单独存在时不容易让免疫系统产生强烈反应；但当它与体内蛋白质等“大分子载体（carrier）”结合后，就可能被免疫系统当成“新抗原”，从而引发过敏或药疹。","在学术写作里，“hapten-like”常用来描述某种化学物质或其反应产物“具有半抗原特征/机制”，并不一定表示它就是经典定义下的半抗原。"],"etymology":"“hapten”源自德语 Hapten，和希腊语词根 haptein（意为“系住、粘附”）相关，用来指“需要‘附着’在载体上才会引发免疫反应的小分子”；后接 -like 表示“像……一样”。","mnemonic":["记忆法：hapten 里有“happen（发生）”的影子——小分子单独不一定“发生”免疫反应，但一“粘上”载体就可能“发生”过敏反应。","-like=“像……一样”；把它当成“半抗原 + 像”，即“像半抗原那样起作用”。"]}
{"word":"hapten-related","summary":{"en":"connected with immune reactions involving haptens.","zh":"与半抗原介导的免疫反应有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or involving a hapten (a small molecule that can trigger an immune response only when attached to a larger carrier, such as a protein).","zh":"与“半抗原/结合原（hapten）”有关的；涉及半抗原的（半抗原是小分子，本身通常不能单独引发免疫反应，需与较大载体如蛋白结合后才可诱发免疫反应）。"},"examples":[{"en":"The researchers measured hapten-related antibodies after vaccination.","zh":"研究人员在接种疫苗后测量了与半抗原相关的抗体。"},{"en":"Hapten-related allergic reactions can occur when a drug binds to proteins in the body.","zh":"当药物与体内蛋白结合时，可能出现与半抗原相关的过敏反应。"},{"en":"The paper discusses hapten-related mechanisms in contact dermatitis.","zh":"这篇论文讨论了接触性皮炎中与半抗原相关的机制。"}]}],"synonyms":["hapten-associated","hapten-linked","hapten-mediated","hapten-dependent"],"phonetic":"/ˈhæpˌtɛn rɪˈleɪtɪd/","extraExplanation":["在免疫学语境里，hapten常译为“半抗原”或“结合原”。它单独通常不具备完整“抗原性”，但与载体蛋白结合后可形成新的抗原表位，从而诱发抗体或T细胞反应。","医学中常见于“药物过敏/药疹”“接触性皮炎”（如某些染发剂、乳胶添加剂等）等讨论：小分子化学物质与皮肤或血液中的蛋白结合后，可能引发免疫反应。"],"etymology":"“hapten”源自希腊语“haptein”（意为“系住、附着”），强调这种小分子需要“附着”到载体蛋白上才更容易被免疫系统识别；“-related”表示“与……相关的”。","mnemonic":["记“hap-”≈“合/附”（联想“合上、附着”），半抗原要“附”在蛋白上才更容易被免疫系统认出来。","把它拆开记：hapten（半抗原）+ related（相关）＝“与半抗原相关的”。"]}
{"word":"haptene","summary":{"en":"A haptene (more commonly: hapten) is a small molecule that binds antibodies but usually needs a carrier protein to trigger a full immune response.","zh":"haptene（更常见拼写为 hapten）指半抗原：可与抗体结合，但通常需与载体蛋白结合才能引发完整免疫反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Immunology) A small molecule that can trigger an immune response only when attached to a larger carrier (usually a protein); by itself, it can bind to antibodies but is not fully “immunogenic.”","zh":"（免疫学）半抗原：一种小分子，单独存在时通常不能引发完整免疫反应，但可与抗体结合；与较大的载体（多为蛋白质）结合后才可诱导免疫反应。"},"examples":[{"en":"Penicillin can act as a hapten by binding to proteins in the body and then triggering an allergic reaction.","zh":"青霉素可能作为半抗原与体内蛋白结合，从而引发过敏反应。"},{"en":"A hapten may bind to an antibody, but it usually needs a carrier protein to stimulate antibody production.","zh":"半抗原可以与抗体结合，但通常需要载体蛋白才能刺激机体产生抗体。"}]}],"synonyms":["hapten","incomplete antigen"],"phonetic":"/ˈhæp.tən/","extraExplanation":["“Haptene”常见于拼写变体或较少见的用法；更常见的标准拼写是“hapten”。在学习与检索资料时，建议优先使用“hapten”。","词源提示：来自希腊语 *haptein*（意为“系上/附着”），强调半抗原需要“附着”到载体上才能引发免疫反应。"]}
{"word":"haptenes","summary":{"en":"Haptens are small molecules that cause an immune reaction only after binding to a larger protein.","zh":"Haptens（半抗原）是小分子，通常需与较大蛋白结合后才会引发免疫反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small molecules that can trigger an immune response only when they attach to a larger carrier protein; by themselves they are usually not immunogenic.","zh":"半抗原：一种小分子，单独存在时通常不会引发免疫反应，但与较大的载体蛋白结合后就可能引发免疫反应。"},"examples":[{"en":"Some drug allergies happen because the drug acts as a hapten and binds to a protein in the body.","zh":"有些药物过敏的发生是因为药物充当半抗原，与体内蛋白结合。"},{"en":"In immunology class, we learned that haptens need carrier proteins to be recognized by the immune system.","zh":"在免疫学课上我们学到：半抗原需要载体蛋白，免疫系统才会“识别”它们。"}]}],"synonyms":["partial antigen","incomplete antigen"],"phonetic":"/ˈhæp.tənz/","extraExplanation":["“Haptens”是“hapten”的复数形式，常见于免疫学/药理学语境。很多“接触性皮炎”（如某些染发剂、乳胶添加剂）与“半抗原 + 皮肤蛋白结合后被免疫系统当作‘外来物’”有关。","词源上来自希腊语 haptein，意为“抓住/结合”，呼应其核心机制：与载体蛋白结合。"]}
{"word":"haptenic","summary":{"en":"Haptenic means “related to a hapten,” a small molecule that becomes immunogenic when attached to a larger carrier (often a protein).","zh":"haptenic 指“与半抗原有关的”，即小分子通常需与较大载体（常为蛋白）结合后才具有免疫原性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hapten: a small molecule that can trigger an immune response only when attached (bound) to a larger carrier such as a protein.","zh":"与“半抗原”有关的：半抗原是一种小分子，单独存在时通常不能引发免疫反应，但与更大的载体（如蛋白质）结合后可诱发免疫反应。"},"examples":[{"en":"Some drug allergies may involve haptenic reactions, where the drug binds to a body protein and becomes recognizable to the immune system.","zh":"一些药物过敏可能涉及半抗原性反应：药物与体内蛋白结合后，才会被免疫系统识别。"},{"en":"Researchers tested whether the chemical had haptenic properties by attaching it to a carrier protein.","zh":"研究人员通过把该化学物质连接到载体蛋白上，来检测它是否具有半抗原性特征。"}]}],"synonyms":["hapten-related","hapten-associated","hapten-like"],"phonetic":"/hæpˈtiːnɪk/","extraExplanation":["“haptenic”主要用于免疫学/药理学语境，日常英语里不常见。常见搭配有：haptenic reaction（半抗原性反应）、haptenic determinant（半抗原决定簇）、haptenic antibody response（针对半抗原的抗体反应）。","词源上与“hapten（半抗原）”相关；理解时可抓住核心：小分子本身“不够大/不够显眼”，需要“绑到”载体上才更容易引发免疫识别。"]}
{"word":"haptens","summary":{"en":"Haptens are small molecules that become antigenic mainly when attached to a larger carrier, such as a protein.","zh":"Haptens（半抗原）是小分子，通常需要与较大的载体（如蛋白质）结合后才会表现出抗原性并引发免疫反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small molecule that can trigger an immune response only when it is attached to a larger carrier (usually a protein); by itself it is not fully immunogenic.","zh":"（免疫学）半抗原：一种小分子，单独时通常不能引发完整免疫反应，但与较大的“载体”（通常是蛋白质）结合后可以诱发免疫反应。"},"examples":[{"en":"Some drug molecules act as haptens and can cause allergic reactions when they bind to proteins in the body.","zh":"一些药物分子可作为半抗原，当它们与体内蛋白结合时可能引发过敏反应。"},{"en":"In the lab, researchers attach a hapten to a carrier protein to help the immune system recognize it.","zh":"在实验室里，研究人员会把半抗原连接到载体蛋白上，以帮助免疫系统识别它。"}]}],"synonyms":["incomplete antigen","haptenic compound"],"phonetic":"/ˈhæp.tɛn/","extraExplanation":["“hapten”来自希腊语，含义接近“抓住/附着”。它的关键点是：半抗原能被抗体或免疫细胞“识别”，但通常需要“载体蛋白”提供足够强的免疫刺激，才会产生明显免疫反应。","常见语境：药物过敏（某些药物或其代谢产物与人体蛋白结合后形成“半抗原-载体复合物”）、以及免疫学实验中用半抗原-载体来制备特异性抗体。"]}
{"word":"haptera","summary":{"en":"Haptera are the finger-like parts of a kelp holdfast that attach the algae to a surface.","zh":"haptera 指海带等褐藻固着器上用于附着的指状分枝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Small root-like attachment structures, especially the finger-like branches of a kelp holdfast that grip rocks or other surfaces.","zh":"（复数名词）附着结构，尤指海带等褐藻“固着器/固着盘”上指状分枝，用来抓住岩石或其他表面。"},"examples":[{"en":"The kelp’s haptera cling tightly to the rock so the plant isn’t washed away by waves.","zh":"海带的固着器指状分枝（haptera）紧紧抓住岩石，这样海浪就不容易把它冲走。"},{"en":"Scientists examined the haptera to understand how the algae anchor themselves in strong currents.","zh":"科学家研究这些附着分枝（haptera），以了解藻类如何在强水流中固定自己。"}]}],"synonyms":["holdfast branches","attachment structures","(related) holdfast"],"phonetic":"/ˈhæptərə/","extraExplanation":["“haptera”常见于海洋生物学/藻类学语境，是较专业的词；在日常英语里更常用的说法是“holdfast”（固着器/附着基）或直接说“the holdfast’s finger-like branches”。","词源来自希腊语，和“抓住、固定”相关；单数形式较少见，偶尔可见“hapteron”。"]}
{"word":"haptere","summary":{"en":"“Chapter” most commonly means a numbered section of a book; it can also mean a new stage in life or history.","zh":"“Chapter”最常指书的章节；也可引申为人生或历史中的一个新阶段（新篇章）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A main division of a book or other written work, usually numbered and often with a title.","zh":"（书或文章的）章，章节（通常编号，有时有标题）。"},"examples":[{"en":"Please read Chapter 3 before class.","zh":"请在上课前阅读第三章。"},{"en":"This chapter explains the main idea in simple terms.","zh":"这一章用简单的方式解释了主要观点。"}]},{"partOfSpeech":"n.","definition":{"en":"A period or stage in someone’s life, history, or a process; a new phase.","zh":"（人生、历史或某个过程的）阶段；新的篇章。"},"examples":[{"en":"Moving to a new city was a new chapter in her life.","zh":"搬到新城市是她人生的新篇章。"},{"en":"The company is entering a new chapter after the merger.","zh":"并购后，这家公司进入了新的阶段。"}]}],"synonyms":["section","part","division","phase","stage"],"phonetic":"/ˈtʃæp.tɚ/","extraExplanation":["“haptere”不是常见的英文单词；最可能是把“chapter”拼错了（少了开头的 c）。如果你原本想查别的词（比如 capture / hap / hatter 等），告诉我上下文句子，我可以帮你确认。"]}
{"word":"hapteron","summary":{"en":"“Chaperone” means to supervise someone (often young people) by accompanying them, or the adult who does this.","zh":"“chaperone”指（成人）陪同并监督（常为年轻人），也可指担任这种陪同监督的人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to accompany and supervise someone (especially a young person) to make sure they behave appropriately and stay safe","zh":"陪同并看护（尤指未成年人），以确保其行为得体与安全"},"examples":[{"en":"My aunt agreed to chaperone the students on the museum trip.","zh":"我阿姨同意在博物馆之旅中陪同并照看学生。"},{"en":"Parents often volunteer to chaperone school dances.","zh":"家长常常志愿在学校舞会中担任陪同看护。"}]},{"partOfSpeech":"n.","definition":{"en":"an adult who accompanies and supervises young people at a social event or on a trip","zh":"在社交活动或出行中陪同并看护年轻人的成年人；监护陪同者"},"examples":[{"en":"Each group needs a chaperone for the overnight trip.","zh":"每个小组的过夜旅行都需要一位陪同监护者。"},{"en":"She served as a chaperone during the rehearsal.","zh":"她在排练期间担任陪同看护者。"}]}],"synonyms":["supervise","escort","accompany","guardian"],"phonetic":"/ˈʃæpəˌroʊn/","extraExplanation":["你输入的“hapteron”很可能是拼写错误；常见正确拼写是 chaperone（也可写作 chaperon，但在美式英语中 chaperone 更常用）。","在英语文化语境里，chaperone 常与学校活动、青少年出游、舞会等场景相关，强调“在场监督、负责安全与规范”。有时也用于较正式或传统的约会情境，指有成年人陪同以避免不当行为。","相关表达：chaperoned event（有监护陪同的活动）、parent chaperone（家长陪同监护）、to act as a chaperone（担任陪同监护）。"]}
{"word":"haptic","summary":{"en":"Haptic means “related to touch,” often used in tech for touch-based feedback like vibrations.","zh":"haptic 意为“与触觉有关的”，常用于科技语境，指通过震动等方式提供触觉反馈。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the sense of touch; involving how something feels when you touch it (including pressure, vibration, texture, etc.).","zh":"与触觉有关的；涉及通过触摸感受到的感觉（如压力、震动、质地等）。"},"examples":[{"en":"This phone uses haptic feedback to simulate a button press.","zh":"这部手机用触觉反馈来模拟按下按钮的感觉。"},{"en":"The designer tested different materials for their haptic qualities.","zh":"设计师测试了不同材料的触觉特性。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of technology or feedback that communicates information through touch (for example, vibrations in a controller).","zh":"触觉技术/触觉反馈：通过触摸来传递信息的一种技术或反馈方式（例如手柄的震动）。"},"examples":[{"en":"The game’s haptics make you feel each explosion as a vibration.","zh":"这款游戏的触觉效果让你通过震动“感到”每一次爆炸。"},{"en":"Better haptics can improve accessibility for some users.","zh":"更好的触觉反馈能提升部分用户的无障碍体验。"}]}],"synonyms":["tactile","touch-based","kinaesthetic"],"phonetic":"/ˈhæp.tɪk/","extraExplanation":["“haptic”来自希腊语 *haptesthai*（意为“触摸”）。在现代英语里它常见于科技与设计领域，尤其是“haptic feedback（触觉反馈）/ haptics（触觉技术）”。","学习提示：日常英语里更常说“touch”或“tactile（触感的）”。“haptic”更偏专业/科技语境，强调通过触觉传递信息（比如手机震动提示、游戏手柄的力反馈）。"]}
{"word":"haptical","summary":{"en":"“Haptical” is a rare form meaning “related to touch,” but the standard word is “haptic.”","zh":"“haptical”意为“与触觉有关”，但标准、常用的词是“haptic”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/nonstandard) Related to the sense of touch; usually written as “haptic.”","zh":"（少见/非标准）与触觉有关的；通常写作“haptic”。"},"examples":[{"en":"This app provides haptical feedback when you press a button.","zh":"这个应用在你按下按钮时会提供触觉反馈。"},{"en":"Researchers study haptical perception—how we recognize objects by touch.","zh":"研究人员研究触觉知觉——我们如何通过触摸来识别物体。"}]}],"synonyms":["haptic","tactile","touch-based"],"phonetic":"/ˈhæptɪk/","extraExplanation":["“haptical”在现代英语里很少见，常被视为拼写变体或误写；更常用、更自然的形式是“haptic”。","在科技语境中最常见的搭配是“haptic feedback”（触觉反馈），例如手机震动、游戏手柄的震动回馈等。","相关名词常用“haptics”（触觉技术/触觉学），如：Haptics is used in VR.（触觉技术被用于虚拟现实。）"]}
{"word":"hapticity-changing","summary":{"en":"a ligand’s binding mode shifts to involve a different number of adjacent atoms in metal bonding","zh":"配体与金属键合时参与配位的连续原子数发生改变"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, especially organometallic chemistry) Describing a process where a ligand changes how many adjacent atoms it binds to a metal center (a change in hapticity, written as η).","zh":"（化学，尤指有机金属化学）指配体改变与金属中心“连续配位原子数”的过程（配位度/配位触性发生变化，常用η表示）。"},"examples":[{"en":"In some complexes, the cyclopentadienyl ligand undergoes hapticity-changing from η5 to η3 during a reaction step.","zh":"在某些配合物中，环戊二烯基配体会在反应步骤中发生从η5到η3的配位度变化。"},{"en":"Hapticity-changing can open a coordination site and help the metal bind a new substrate.","zh":"配位度变化可以“腾出”一个配位位点，帮助金属结合新的底物。"},{"en":"The mechanism proposes a hapticity-changing intermediate before oxidative addition.","zh":"该机理提出在氧化加成之前存在一个发生配位度变化的中间体。"}]}],"synonyms":["hapticity shift","haptotropic shift","ring slippage"],"phonetic":"/hæpˈtɪsɪti ˈtʃeɪndʒɪŋ/","extraExplanation":["学习提示：η^n 里的 n 表示“连续与金属相连的原子数”。例如 η5-C5H5 表示五个连续原子一起与金属相互作用；η3 表示其中三个位点参与配位。","常见相关现象：芳环或烯丙基配体在反应中发生“滑移/改绑”，使金属暂时获得空位，促进配位、插入、加成等步骤。"],"etymology":"源自“hapticity（配位度/触配性）+ changing（变化）”。hapticity 来自希腊语词根 haptein，意为“抓住、连接”，在有机金属化学中用 η（eta）标记配体与金属相连的连续原子数。","mnemonic":["把 η 想成“钩子/抓手”：η5 像“五爪抓住”，变成 η3 就变成“三爪抓住”，这就是 hapticity-changing。","联想中文“配位在变”：hapticity（配位方式）+ changing（变化）= 配位方式改变。"]}
{"word":"haptics","summary":{"en":"Haptics means touch-based feedback technology, like vibrations or force feedback used in devices.","zh":"haptics 指利用振动或力反馈等触感来传递信息的触觉反馈技术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Technology that uses touch (vibration, pressure, or force) to communicate information or create a sense of physical interaction, especially in phones, gaming, and VR.","zh":"触觉反馈/触觉交互技术：通过振动、压力或力反馈等“触感”来传递信息或模拟物理接触，常见于手机、游戏与虚拟现实。"},"examples":[{"en":"My phone uses haptics to give a small vibration when I type.","zh":"我的手机用触觉反馈，在我打字时轻微震动。"},{"en":"Modern game controllers have haptics that make explosions feel more real.","zh":"现代游戏手柄有触觉反馈，让爆炸的感觉更真实。"},{"en":"VR haptics can simulate textures, like rough stone or smooth glass.","zh":"VR 触觉技术可以模拟材质，比如粗糙的石头或光滑的玻璃。"}]}],"synonyms":["haptic feedback","tactile feedback","force feedback"],"phonetic":"/ˈhæptɪks/","extraExplanation":["“Haptics”通常作为不可数名词使用，意思是“触觉反馈技术/触觉交互”。也可以说“haptic feedback（触觉反馈）”“haptic technology（触觉技术）”。","词源来自希腊语 *haptesthai*（触摸）。在产品说明里，你也会看到形容词形式“haptic”（如：haptic motor 触觉马达、haptic response 触觉响应）。"]}
{"word":"haptoglobin","summary":{"en":"Haptoglobin is a blood protein that binds free hemoglobin, and its level is often used as a lab clue for hemolysis.","zh":"结合珠蛋白是一种与游离血红蛋白结合的血浆蛋白，其水平常用于检验中提示是否存在溶血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blood protein made mainly by the liver that binds free hemoglobin (released from red blood cells) and helps prevent its loss and damage to the body","zh":"一种主要由肝脏产生的血浆蛋白，可与游离血红蛋白（红细胞破裂释放的血红蛋白）结合，帮助防止其流失并减少对身体的损伤"},"examples":[{"en":"Doctors may check haptoglobin levels when they suspect hemolytic anemia.","zh":"当医生怀疑溶血性贫血时，可能会检测结合珠蛋白（haptoglobin）水平。"},{"en":"Low haptoglobin can suggest that red blood cells are breaking down faster than normal.","zh":"结合珠蛋白偏低可能提示红细胞破坏速度快于正常。"}]}],"synonyms":["Hp (abbrev.)","hemoglobin-binding protein"],"phonetic":"/ˌhæp.təˈɡloʊ.bɪn/","extraExplanation":["“Haptoglobin”常见于化验单与医学文章中：它会与“游离血红蛋白”形成复合物，帮助机体清除这些分子，减少对肾脏等组织的潜在伤害。","临床上：溶血（红细胞被破坏）时，游离血红蛋白增多，haptoglobin会被“消耗”而下降；而在炎症反应中，它也可能作为“急性期反应蛋白”而升高，因此解读结果通常要结合其他指标（如LDH、胆红素、网织红细胞等）一起看。"]}
{"word":"haptometer","summary":{"en":"A haptometer is a device for measuring the sense of touch.","zh":"haptometer 指用于测量触觉敏感度的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to measure the sense of touch (tactile sensitivity), such as how well someone can feel pressure, texture, or small differences on the skin.","zh":"触觉计；用于测量触觉（皮肤对压力、纹理或细微差异的感知能力）的仪器。"},"examples":[{"en":"The researcher used a haptometer to test participants’ sensitivity to light pressure on the fingertips.","zh":"研究人员用触觉计测试参与者指尖对轻微压力的敏感度。"},{"en":"In a neurology lab, a haptometer can help track changes in touch perception after an injury.","zh":"在神经学实验室里，触觉计可以帮助追踪受伤后触觉感知的变化。"}]}],"synonyms":["tactile meter","touch sensitivity tester"],"phonetic":"/hæpˈtɑːmətər/","extraExplanation":["词源：hapto- 表示“触觉、接触”（来自希腊语 *haptein* “触、抓”），-meter 表示“测量仪器”。该词较少见，常出现在心理学、神经科学或感觉测试相关的专业语境中。"]}
{"word":"haptophobia","summary":{"en":"Haptophobia means an intense fear of being touched or of physical contact.","zh":"haptophobia 指对被触碰或身体接触的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong fear of being touched, or of physical contact with other people.","zh":"对被触碰或与他人发生身体接触的强烈恐惧。"},"examples":[{"en":"Because of her haptophobia, crowded buses make her feel very anxious.","zh":"因为她有触碰恐惧症，拥挤的公交车会让她非常焦虑。"},{"en":"He explained that his haptophobia makes handshakes uncomfortable.","zh":"他解释说他的触碰恐惧症会让握手变得不舒服。"}]}],"synonyms":["fear of touch","fear of being touched","touch aversion"],"phonetic":"/ˌhæp.təˈfoʊ.bi.ə/","extraExplanation":["词源：hapto- 来自希腊语，意为“触摸/接触”；-phobia 意为“恐惧”。合起来就是“对触摸的恐惧”。","使用语境：在日常英语中不算常见，更常见的是说“a fear of being touched / a fear of physical contact”。在心理健康语境中也可能被当作一种特定恐惧（phobia）来描述，但是否构成临床诊断需要专业评估。","文化与沟通：有些文化更习惯拥抱、拍肩等肢体接触；如果有人不喜欢被碰，礼貌的做法是先征求同意（e.g., “Is it okay if I…?”）。"]}
{"word":"haptophor","summary":{"en":"A historical immunology term for the part of a molecule that binds to a target (a binding site).","zh":"免疫学史中的术语，指分子上负责与靶标结合的部分（结合位点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology, immunology; historical) A binding group or part of a molecule (such as an antibody or toxin) that attaches to a target cell or antigen; a “binding site.”","zh":"（生物学/免疫学；历史用语）分子上的“结合基/结合部位”，可与靶细胞或抗原结合；即“结合位点”。"},"examples":[{"en":"In Ehrlich’s early theory, the haptophor is the part that binds to the cell, while another part produces the effect.","zh":"在埃尔利希（Ehrlich）早期理论中，haptophor 指负责与细胞结合的部分，而另一部分负责产生作用。"},{"en":"The paper uses “haptophor” in a historical discussion of how antibodies were once described.","zh":"这篇论文在回顾历史时用 “haptophor” 来说明早期人们如何描述抗体。"}]}],"synonyms":["binding site","antigen-binding site","paratope (for antibodies)","receptor-binding domain (context-dependent)"],"phonetic":"/ˈhæp.tə.fɔr/","extraExplanation":["“haptophor” 常见于19世纪末—20世纪初的免疫学史（保罗·埃尔利希的“侧链理论”）。他提出毒素/抗体可分为负责“结合”的 haptophor（结合部位）与负责“产生毒性/作用”的 toxophor（效应部位）。现代免疫学更常用的说法是 binding site、antigen-binding site、paratope 等。","拼写上也可见到 haptophore（同义变体）。在现代科研写作里，“haptophor”多用于历史回顾而非日常术语。"]}
{"word":"haptophoric","summary":{"en":"Haptophoric means “involved in binding/attachment,” especially in older immunology terms describing how toxins or antibodies attach to cells.","zh":"haptophoric 指“与结合/附着有关的”，多见于较早的免疫学用语，描述毒素或抗体如何黏附到细胞上。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biochemistry/Immunology) Describing a chemical group or part of a molecule that binds or attaches to a target (such as a cell receptor), especially in older descriptions of toxins and antibodies.","zh":"（生物化学/免疫学）指分子中负责与靶标（如细胞受体）结合或附着的化学基团/部分，尤用于较早期关于毒素与抗体的表述。"},"examples":[{"en":"In Ehrlich’s early theory, the haptophoric part of a toxin helped it bind to the cell.","zh":"在埃尔利希的早期理论中，毒素的 haptophoric（结合）部分帮助它与细胞结合。"},{"en":"Researchers distinguished the haptophoric region (binding) from the toxic region (damage).","zh":"研究者区分了 haptophoric 区域（负责结合）与致毒区域（造成损伤）。"}]}],"synonyms":["binding","adhesive","receptive"],"phonetic":"/ˌhæp.təˈfɔr.ɪk/","extraExplanation":["这个词来自 hapto-（“触/结合”）+ -phoric（“携带/传递”）。在免疫学史上常与 haptophore（结合基/亲和基）一起出现，尤其见于 Paul Ehrlich（保罗·埃尔利希）提出的“侧链学说”语境：haptophore 负责“黏住/识别”细胞靶点，而 toxophore 负责“致毒/破坏”。现代教材更常用的说法是 binding site（结合位点）、ligand-binding domain（配体结合结构域）等，因此 haptophoric 属于偏历史/学术的用词。"]}
{"word":"haptophorous","summary":{"en":"Haptophorous means “bearing touch organs,” used mainly in biology.","zh":"haptophorous 指“带有触觉器官/触觉结构的”，主要用于生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Bearing or carrying organs related to touch or tactile sensation.","zh":"（生物学）具有或携带与触觉相关的器官；“带有触觉结构的”。"},"examples":[{"en":"Some descriptions of invertebrates mention haptophorous appendages used to sense the environment.","zh":"一些对无脊椎动物的描述会提到它们具有 haptophorous 的附肢，用来感知环境。"},{"en":"In older scientific writing, certain tentacles were called haptophorous because they functioned mainly as touch organs.","zh":"在较早的科学文献中，有些触手被称为 haptophorous，因为它们主要作为触觉器官使用。"}]}],"synonyms":["tactile (related)","touch-bearing","sensory (in context)"],"phonetic":"/ˌhæp.təˈfɔr.əs/","extraExplanation":["词源上由 hapto-（与“触摸/接触”相关）+ -phorous（“携带/具有”）构成，常见于较旧或较专业的动物学/形态学描述中，日常英语几乎不用。"]}
{"word":"haptor","summary":{"en":"A haptor is an attachment organ that some parasitic flatworms use to hold onto their host.","zh":"haptor 指某些寄生扁形动物用来抓附宿主的固着（附着）器官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A specialized attachment organ used by some parasitic flatworms (especially monogeneans) to grip onto a host, often using hooks or suckers.","zh":"（生物）某些寄生扁形动物（尤指单殖吸虫）用来附着在宿主体表的专门器官，常带有钩或吸盘以牢固抓附。"},"examples":[{"en":"The monogenean uses its haptor to cling tightly to the fish’s gills.","zh":"这种单殖吸虫用它的固着器牢牢附着在鱼的鳃上。"},{"en":"Under the microscope, you can see hooks on the haptor.","zh":"在显微镜下，你可以看到固着器上的小钩。"}]}],"synonyms":["attachment organ","holdfast"],"phonetic":"/ˈhæptər/","extraExplanation":["“haptor”是比较专业的生物学术语，常见于寄生虫学和水产养殖相关文献中；日常英语里很少用到。","词源上与希腊语中表示“抓住、握住”的词根有关，因此含义聚焦在“抓附/固着”的功能。"]}
{"word":"haptotaxis","summary":{"en":"directed cell movement guided by adhesion-bound surface cues.","zh":"由黏附/表面固定信号梯度引导的细胞定向迁移。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"directed movement of a cell (or organism) along a surface by following a gradient of adhesion or bound chemical cues (often in the extracellular matrix), rather than a gradient of dissolved chemicals.","zh":"细胞（或生物体）沿着表面移动的一种“定向运动”，其方向由黏附强度或固定在表面/细胞外基质上的化学信号的梯度所引导（不同于溶液中可扩散化学物质的梯度）。"},"examples":[{"en":"During wound healing, immune cells may show haptotaxis as they crawl along extracellular matrix proteins toward the injury site.","zh":"在伤口愈合过程中，免疫细胞可能表现出触向性：它们沿着细胞外基质蛋白爬行并朝向受伤部位移动。"},{"en":"Researchers measured haptotaxis by patterning different densities of fibronectin on a gel and tracking cell trajectories.","zh":"研究人员通过在凝胶上制作不同密度的纤连蛋白图案，并追踪细胞轨迹来测量触向性。"}]}],"synonyms":["contact guidance","adhesion-guided migration","substrate-guided migration"],"phonetic":"/ˌhæp.təˈtæk.sɪs/","extraExplanation":["与 chemotaxis（化学趋向性）对比：chemotaxis 主要追随“可扩散”的化学浓度梯度；haptotaxis 追随“固定在表面或基质上”的黏附/配体密度梯度，更常见于细胞在组织中“爬行”时。","常见研究场景：发育生物学（细胞迁移与组织形成）、免疫细胞巡航、癌细胞侵袭与转移、组织工程中通过基质图案化引导细胞移动。"],"etymology":"源自希腊语：hapto- 表示“触、接触、黏附”（与“haptic 触觉”同源），-taxis 表示“定向排列/趋向运动”（如 chemotaxis 化学趋向性）。合起来指“由接触/黏附线索引导的定向运动”。","mnemonic":["记前缀 hapto-：联想 haptic（触觉）=“靠触/黏附来找路”。","把它拆成“hapto(黏附/接触)+taxis(定向移动)”＝“沿着黏附线索的定向迁移”。"]}
{"word":"haptotropic","summary":{"en":"Haptotropic means involving a change in a ligand’s hapticity (η-bonding) to a metal in organometallic chemistry.","zh":"haptotropic 指有机金属化学中配体对金属的η配位方式（配位度）发生改变的过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Describing a rearrangement in an organometallic compound where a ligand changes how many adjacent atoms it bonds to a metal (a change in hapticity, written as η).","zh":"（化学）指有机金属化合物中配体改变与金属键合时所“连续配位原子数”的重排过程（即配位方式/配位度发生改变，常用η表示）。"},"examples":[{"en":"The paper reports a haptotropic shift from η5 to η3 coordination in a cyclopentadienyl complex.","zh":"该论文报道了一个环戊二烯基络合物从η5到η3配位的haptotropic（配位方式改变的）迁移。"},{"en":"Haptotropic rearrangements can be driven by heat or light, depending on the complex.","zh":"haptotropic重排可能由加热或光照驱动，取决于具体络合物。"}]}],"synonyms":["hapticity-changing","η-shift (contextual)"],"phonetic":"/ˌhæp.təˈtrɑp.tɪk/","extraExplanation":["这个词主要用于有机金属化学文献，常见搭配是“haptotropic shift/rearrangement（haptotropic迁移/重排）”。核心概念是“hapticity（配位度）”的变化：同一个π配体（如烯烃、环戊二烯基、芳香环）对金属的“贴附”方式改变，η的数字随之变化。","词源上与希腊语 *haptein*（“抓住、附着”）有关；因此它强调的是配体对金属表面的“抓附/贴附”方式在反应过程中发生改变。"]}
{"word":"haptotropically","summary":{"en":"Haptotropically means “in a haptotactic way”—guided by surface-bound cues rather than diffusible chemicals.","zh":"haptotropically 指“以触趋性方式”：由表面固定的线索（而非可扩散化学物质）引导移动或生长。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that involves movement or growth directed by a gradient of surface-bound (immobilized) cues, such as adhesive molecules on a tissue or material surface","zh":"以“触趋性/贴附趋性”的方式：指细胞或生物体的移动或生长受表面固定（不可自由扩散）的线索梯度（如黏附分子）引导"},"examples":[{"en":"Endothelial cells can migrate haptotropically along a fibronectin-coated surface.","zh":"内皮细胞可以沿着涂有纤维连接蛋白的表面以触趋性的方式迁移。"},{"en":"The scaffold was patterned to encourage haptotropically guided neurite extension.","zh":"该支架被做出图案化处理，以促进神经突在触趋性引导下延伸。"}]}],"synonyms":["by haptotaxis","via contact guidance","in a substrate-guided way"],"phonetic":"/ˌhæp.təˈtrɑː.pɪ.kli/","extraExplanation":["“haptotropically”多见于细胞生物学、组织工程与生物材料领域，常与“haptotaxis（触趋性/贴附趋性）”一起出现。与“chemotaxis（化学趋性）”不同：化学趋性由可扩散的化学物质梯度引导；触趋性则由固定在基质/细胞外基质表面的分子（如纤维连接蛋白、层粘连蛋白等）形成的空间梯度引导。","词源提示：hapto- 来自希腊语，含“触摸、接触、黏附”之意；-tropic 表示“转向/趋向”；-ally 构成副词，表示“以……方式”。"]}
{"word":"haptotropism","summary":{"en":"Haptotropism is directional growth or movement guided by contact with a surface, often via cues bound to that surface.","zh":"Haptotropism 指由与表面接触所引导的定向生长或运动，常由表面结合的信号所驱动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of directional growth or movement in response to touch or contact with a surface (especially when cells or tissues respond to cues fixed on a surface rather than signals floating in fluid)","zh":"一种“接触向性”：生物体的生长或运动方向会受到触碰或与表面接触的影响（尤其指细胞/组织对“附着在表面上的信号”作出定向反应，而不是对液体中游离信号反应）"},"examples":[{"en":"In wound healing, some cells show haptotropism as they move along the extracellular matrix.","zh":"在伤口愈合过程中，有些细胞会表现出接触向性，沿着细胞外基质移动。"},{"en":"Researchers studied haptotropism by coating a dish with different surface proteins and observing cell movement.","zh":"研究人员通过在培养皿表面涂覆不同蛋白质，并观察细胞移动来研究接触向性。"}]}],"synonyms":["contact tropism","thigmotropism (related)","haptotaxis (related)"],"phonetic":"/ˌhæp.toʊˈtrɑp.ɪ.zəm/","extraExplanation":["这个词常见于细胞生物学/发育生物学论文里，强调“信号在表面上（例如细胞外基质ECM、膜蛋白）”而不是在溶液中扩散。","相关概念：haptotaxis（趋触性/接触趋化，偏重“细胞迁移”）、chemotropism/chemotaxis（化学向性/趋化性，偏重“对可扩散化学物质的定向反应”）。","在机制上常会涉及细胞与基质的黏附分子（如整合素 integrins）以及基质的空间分布差异。"]}
{"word":"hapu","summary":{"en":"Hapu is a Māori word used in English mainly in New Zealand: it means a sub-tribe/clan, and it can also mean “pregnant.”","zh":"hapu 是毛利语词，在英语（多见于新西兰）里主要指“亚部落／氏族”，也可表示“怀孕的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Māori culture) a sub-tribe or clan; a kin group within an iwi (tribe).","zh":"（毛利文化中）“亚部落／氏族”；隶属于某个部落（iwi）的亲族群体。"},"examples":[{"en":"The meeting was attended by representatives from several hapu.","zh":"会议由几个哈普（亚部落）的代表出席。"},{"en":"Land rights are often discussed at the level of the hapu.","zh":"土地权利常常在哈普（亚部落）的层级上讨论。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Māori) pregnant; with child.","zh":"（毛利语）怀孕的；有身孕的。"},"examples":[{"en":"In Māori, hapu can also mean “pregnant.”","zh":"在毛利语中，hapu 也可以表示“怀孕”。"}]}],"synonyms":["sub-tribe","clan","kin group"],"phonetic":"/ˈhɑːpuː/","extraExplanation":["“hapu”来自新西兰毛利语，在英语语境中多见于新西兰历史、法律（如土地与资源权利）、社会与文化讨论。书写时常见作 hapū（u 上有长音符号），表示长元音。","发音会因说话者与语境略有差异；英语使用者通常按“HAH-poo”一类的节奏读。"]}
{"word":"hapuku","summary":{"en":"Hapuku is a New Zealand deep-sea food fish (also spelled hāpuku), often referred to as a kind of groper/wreckfish.","zh":"Hapuku（也写作 hāpuku）是新西兰常见的一种深海食用鱼，常被称作石斑/海鲈类或 wreckfish。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large deep-sea fish from New Zealand and nearby southern waters, valued as food; also called hāpuku (a kind of groper/wreckfish).","zh":"（新西兰及附近南部海域的）一种大型深海食用鱼；亦写作 hāpuku（常被称为石斑/海鲈类、wreckfish）。"},"examples":[{"en":"We ordered grilled hapuku with lemon and herbs.","zh":"我们点了柠檬香草烤 hapuku。"},{"en":"Hapuku is popular in New Zealand seafood restaurants.","zh":"hapuku 在新西兰海鲜餐厅很受欢迎。"},{"en":"The fisherman said the hapuku were deeper this season.","zh":"渔民说这季的 hapuku 游得更深。"}]}],"synonyms":["hāpuku","groper","wreckfish"],"phonetic":"/hɑːˈpuːkuː/","extraExplanation":["“hapuku / hāpuku”一词来自毛利语（Māori），在新西兰英语里常用来指一种可食用的大型深海鱼。菜单上有时也会写作“groper”或直接标注为“wreckfish”。","它的肉质通常被描述为白色、结实、味道温和，常见做法有烤、煎或裹粉油炸；在新西兰语境中属于比较常见、也较有地方特色的海鲜名称。"]}

