{"word":"has","summary":{"en":"“Has” is the third-person singular form of “have,” meaning “owns/has,” and it also helps form the present perfect tense.","zh":"“has”是“have”的第三人称单数形式，可表示“拥有/有”，也可作助动词构成现在完成时。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Third-person singular present form of “have”: used to show possession, relationships, or characteristics.","zh":"“have”的第三人称单数现在时：表示“拥有/有”、关系或特征。"},"examples":[{"en":"She has a new phone.","zh":"她有一部新手机。"},{"en":"My brother has two kids.","zh":"我哥哥有两个孩子。"},{"en":"This city has a long history.","zh":"这座城市有很长的历史。"}]},{"partOfSpeech":"aux.","definition":{"en":"Used as an auxiliary verb to form the present perfect tense (has + past participle).","zh":"作助动词，用于构成现在完成时（has + 过去分词）。"},"examples":[{"en":"He has finished his homework.","zh":"他已经完成作业了。"},{"en":"She has lived here for three years.","zh":"她在这里住了三年了。"}]}],"synonyms":["possesses","owns"],"phonetic":"/hæz/","extraExplanation":["“has”只用于第三人称单数主语：he / she / it，或单数名词（例如：The company has…）。其他主语用“have”（I/you/we/they have…）。","常见缩写：has not → hasn’t；在口语/书面里也常把“has”缩写成 ’s（He’s finished. = He has finished），但注意：’s 也可能表示 “is”，要看后面跟的是过去分词（finished）还是形容词/名词（happy/a student）。"]}
{"word":"has a surprising ending","summary":{"en":"“Has a surprising ending” means something ends unexpectedly and surprises you.","zh":"“has a surprising ending”表示结尾出乎意料、让人惊讶。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(of a story, movie, or event) to end in an unexpected way that surprises the audience.","zh":"（指故事、电影或事件）以出人意料的方式结尾，让人感到惊讶。"},"examples":[{"en":"The movie has a surprising ending—you won’t guess who the villain is.","zh":"这部电影的结局很出人意料——你猜不到谁是反派。"},{"en":"Her short story has a surprising ending that makes you rethink everything.","zh":"她的短篇小说有个令人意外的结局，让你重新思考前面的所有细节。"},{"en":"The article has a surprising ending: the “expert” was actually a teenager.","zh":"这篇文章的结尾很令人惊讶：所谓的“专家”其实是个青少年。"}]}],"synonyms":["has an unexpected ending","has a twist ending","ends with a surprise","has a plot twist"],"phonetic":"/hæz ə sərˈpraɪzɪŋ ˈɛndɪŋ/","extraExplanation":["这个说法常用于影评、书评或口语推荐：你可以用 it has a surprising ending / a twist ending（反转结局）。想避免剧透时，也可以说：It has a surprising ending, but I won’t spoil it.（结局很意外，但我不剧透。）","语气上比 has a shocking ending（震撼/惊悚的结尾）更中性；surprising 侧重“没想到”，不一定可怕或悲惨。"]}
{"word":"has-been","summary":{"en":"A “has-been” is someone or something that used to be successful or fashionable but is no longer.","zh":"“has-been”指曾经成功或流行、但如今已不再受关注或不再时髦的人或事物（多含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who was once popular, successful, or important but is no longer respected or in the spotlight.","zh":"曾经红极一时但如今不再受欢迎/不再重要的人；过气的人。"},"examples":[{"en":"Some critics called the actor a has-been, but he still had loyal fans.","zh":"一些评论家称这位演员已经过气，但他仍有忠实粉丝。"},{"en":"She hates being treated like a has-been after leaving the company.","zh":"离开公司后，她讨厌被当成“过气的人”来看待。"}]},{"partOfSpeech":"adj.","definition":{"en":"No longer fashionable, impressive, or successful; past its peak (often used as an adjective).","zh":"不再时髦/不再令人印象深刻/不再成功的；巅峰已过的（常作形容词用）。"},"examples":[{"en":"He thinks social media is has-been now, but it’s still growing.","zh":"他觉得社交媒体现在已经过时了，但其实还在增长。"},{"en":"That style isn’t has-been—it’s coming back.","zh":"那种风格并没有过时——它正在回潮。"}]}],"synonyms":["washed-up","over-the-hill","past one’s prime","yesterday’s news","former star"],"phonetic":"/ˈhæzˌbɪn/","extraExplanation":["“has-been”带有明显的贬义和嘲讽意味，容易伤人。描述人时更中性/礼貌的说法可以用：“former star / once-famous person / no longer in the spotlight（曾经有名/不再在聚光灯下）”。","词源上可理解为“has been（已经是……的人）”：曾经“是”某种身份或很红，但现在不再如此。写作中常加连字符 has-been，复数可写作 has-beens。","在流行文化与媒体评论里常用于形容名人、运动员或品牌“过气”；在正式场合最好避免用它给人贴标签。"]}
{"word":"hasan","summary":{"en":"Hasan is most commonly a male first name; it can also be a surname.","zh":"Hasan 最常见是男性名字；在部分地区也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), common in Arabic-, Turkish-, Persian-, and South Asian–influenced cultures.","zh":"男性名字（名），常见于阿拉伯语、土耳其语、波斯语及受南亚文化影响的地区。"},"examples":[{"en":"Hasan is my classmate from Turkey.","zh":"Hasan 是我来自土耳其的同学。"},{"en":"Please ask Hasan if he can join the meeting at 3 p.m.","zh":"请问一下 Hasan 能不能下午三点参加会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) in some countries.","zh":"在一些国家中也可作姓氏（家族名）。"},"examples":[{"en":"Ms. Hasan will email the updated schedule.","zh":"Hasan 女士会把更新后的日程发邮件。"}]}],"synonyms":["Hassan","Hasaan"],"phonetic":"/hɑˈsɑn/","extraExplanation":["“Hasan”源自阿拉伯语 حسن（ḥasan），常被解释为“好的、善良的、俊美的”。在不同语言和地区拼写可能不同，如 Hasan / Hassan；发音也会随母语变化。","常见相关人物：伊斯兰历史中有 Hasan ibn Ali（先知穆罕默德的外孙之一），因此该名字在穆斯林文化圈很常见。"]}
{"word":"hasard","summary":{"en":"“Hasard” is a rare/older spelling linked to “hazard,” meaning chance, risk, or danger; it can also be a surname.","zh":"“hasard”是与“hazard”相关的罕见/较旧拼写，表示偶然、风险或危险；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) chance or risk; an alternative spelling of “hazard.”","zh":"（罕见）机会或风险；“hazard”的另一种拼写。"},"examples":[{"en":"In older texts, you may see “hasard” used where modern English writes “hazard.”","zh":"在较早的文本中，你可能会看到用“hasard”来表示现代英语中的“hazard”。"},{"en":"They spoke of the “hasard of war,” meaning the dangers and uncertainties of war.","zh":"他们谈到“hasard of war”，意思是战争的危险与不确定性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) a family name (surname), sometimes appearing in place names or historical records.","zh":"（专有名词）姓氏，有时也会出现在地名或历史记录中。"},"examples":[{"en":"The document was signed by Jean Hasard.","zh":"该文件由Jean Hasard签署。"}]}],"synonyms":["hazard","risk","danger","chance"],"phonetic":"/ˈhæzərd/","extraExplanation":["“hasard”多见于法语背景或较古老的英语拼写传统。现代英语里更常用“hazard”（如hazardous, hazard lights）。","词源上与法语“hasard（偶然、机运）”有关，进一步可追溯到中古时期的用法；因此在文学或历史文本中偶尔出现。"]}
{"word":"hasenpfeffer","summary":{"en":"Hasenpfeffer is a German-style rabbit (or hare) stew, often vinegar-marinated and cooked with wine and spices.","zh":"Hasenpfeffer 指德式兔肉（或野兔）炖菜，常用醋腌制并与酒和香料一起炖煮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A German-style stew made from rabbit (or hare), traditionally marinated in vinegar and spices and often cooked with wine.","zh":"德式兔肉（或野兔）炖菜；传统做法会用醋和香料腌制，常与葡萄酒一起炖煮。"},"examples":[{"en":"They served hasenpfeffer with dumplings and red cabbage.","zh":"他们端上了兔肉炖菜，配饺子和红甘蓝。"},{"en":"The recipe calls for marinating the rabbit before making hasenpfeffer.","zh":"这道食谱要求先把兔肉腌好再做兔肉炖菜。"}]},{"partOfSpeech":"n.","definition":{"en":"(Humorous or old-fashioned) Rabbit meat used for cooking, especially when talking about it like a special dish.","zh":"（幽默或较老派说法）指用来烹饪的兔肉，常把它说得像一道“讲究的菜”。"},"examples":[{"en":"He joked that the potluck needed more hasenpfeffer.","zh":"他开玩笑说聚餐还缺点“兔肉大菜”。"},{"en":"In the story, the hunter brings home ‘hasenpfeffer’ for dinner.","zh":"故事里，猎人带回家“兔肉”当晚饭。"}]}],"synonyms":["rabbit stew","hare stew"],"phonetic":"ˈhɑːzənˌfɛfɚ","extraExplanation":["“Hasenpfeffer”来自德语：Hase（野兔/兔子）+ Pfeffer（胡椒）。在英语里通常指一种带酸味（醋或酒腌制）的兔肉炖菜。","这个词在美国流行文化里也常出现（例如一些经典动画/喜剧会用它当作“兔子被做成菜”的梗），因此有时带一点夸张或搞笑的语气。"]}
{"word":"hash","summary":{"en":"Hash can mean the # symbol (and “hashtag”), a chopped-and-cooked food dish, a messy situation, or the act of chopping or discussing something thoroughly (“hash out”).","zh":"Hash可以指井号#（及话题标签hashtag）、切碎烹煮的杂烩菜、一团糟的局面，也可作动词指切碎或充分讨论（常用hash out）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a symbol (#) used in writing, phone menus, and online tags (a “hashtag”)","zh":"井号（#）；用于书写、电话按键菜单，以及网络标签（hashtag）"},"examples":[{"en":"Press the hash key to continue.","zh":"按井号键继续。"},{"en":"Add a hash tag to help people find your post.","zh":"加一个话题标签，方便别人找到你的帖子。"}]},{"partOfSpeech":"n.","definition":{"en":"a dish made from meat (or vegetables) cut into small pieces and cooked, often with potatoes","zh":"（切碎后烹煮的）肉末/碎肉菜（常与土豆等一起）"},"examples":[{"en":"We had corned beef hash for breakfast.","zh":"我们早餐吃了咸牛肉土豆杂烩。"},{"en":"She made a simple potato hash with onions.","zh":"她用洋葱做了一道简单的土豆杂烩。"}]},{"partOfSpeech":"n.","definition":{"en":"a messy mixture or confused situation (informal)","zh":"一团糟；混乱的局面（非正式）"},"examples":[{"en":"The paperwork became a real hash.","zh":"这些文件手续弄得一团糟。"},{"en":"The schedule is a hash after all those changes.","zh":"改来改去之后，日程安排变得乱七八糟。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cut or chop into small pieces; to mince","zh":"切碎；剁碎"},"examples":[{"en":"Hash the cooked meat and fry it with potatoes.","zh":"把熟肉切碎，再和土豆一起煎。"},{"en":"He quickly hashed some herbs for the soup.","zh":"他很快切碎了一些香草放进汤里。"}]},{"partOfSpeech":"vt.","definition":{"en":"to discuss something thoroughly, often to reach an agreement (usually in “hash out”)","zh":"充分讨论并理清（常用于“hash out”，指把问题谈清楚/达成一致）"},"examples":[{"en":"Let’s hash out the details tomorrow.","zh":"我们明天把细节谈清楚。"},{"en":"They hashed out a plan everyone could accept.","zh":"他们充分讨论后定下了一个大家都能接受的方案。"}]}],"synonyms":["pound sign","number sign","hashtag","chop","mince","dice","mess","confusion","hash out"],"phonetic":"/hæʃ/","extraExplanation":["“hash”来自法语 *hacher*，意思是“剁碎、切碎”，所以食物含义是最早的核心意思。","网络里的“hashtag”最初就是“hash + tag（标签）”，指用#把关键词标出来，便于搜索与分类。","英式英语里#有时也叫“hash”；而在美式英语中，#常被叫做“number sign”或“pound sign”，在社交媒体语境中最常说“hashtag”。"]}
{"word":"hashab","summary":{"en":"“Hashab” is not common English; it’s usually the Arabic transliteration for “wood/firewood.”","zh":"“hashab”不是常见英语词；通常是阿拉伯语音译，意为“木头/柴火”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard English word; most often a transliteration of the Arabic word ḥashab, meaning “wood” or “firewood.” In English it may appear in translations or in discussions of Middle Eastern languages/culture, but it is not common in everyday English.","zh":"不是标准英语词；更常见的是阿拉伯语 ḥashab 的音译，意思是“木头 / 柴火”。在英语中多见于翻译文本或中东语言文化相关讨论，不常用于日常英语。"},"examples":[{"en":"In some Arabic learning materials, ḥashab (hashab) means “wood” or “firewood.”","zh":"在一些阿拉伯语学习资料中，ḥashab（hashab）表示“木头 / 柴火”。"},{"en":"The translator kept the term hashab to preserve the local flavor of the dialogue.","zh":"译者保留了 hashab 这个词，以保留对话的地方特色。"}]}],"synonyms":["wood","firewood"],"phonetic":"/ˈhɑːʃɑːb/","extraExplanation":["“hashab”本身在英语词典里通常查不到；如果你是在英文语境里看到它，往往是阿拉伯语 حَشَب（ḥashab）的拉丁字母转写。不同转写系统可能写作 hashab / ḥashab。","如果你本来想查的是发音相近的英语词，请确认拼写：常见混淆包括 hijab（头巾）、hash（哈希/杂乱信息/剁碎）、hush up（掩盖、让…别说）。你也可以把句子发来，我能根据上下文判断。"]}
{"word":"hashabi","summary":{"en":"“Hashabi” is not a common English word; it is usually a proper name or a transliteration from another language.","zh":"“hashabi”不是常见英语词，通常是人名/专有名词或来自其他语言的音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (surname or given name) seen in English texts mainly as a transliteration from another language; it is not a standard English vocabulary word.","zh":"一种较少见的专有名词（姓氏或名字），在英文中多作为其他语言音译出现；它不是标准英语词汇。"},"examples":[{"en":"Dr. Hashabi will speak at the conference tomorrow.","zh":"Hashabi 医生将于明天在会议上发言。"},{"en":"I saw the name Hashabi on the class roster.","zh":"我在班级名单上看到了 Hashabi 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"If you meant a different spelling, it may refer to a word/phrase in another language (for example Arabic or Hebrew) rather than English.","zh":"如果你想输入的是其他拼写，它可能指的是阿拉伯语或希伯来语等语言中的词/短语，而不是英语。"},"examples":[{"en":"“Hashabi” doesn’t appear in most English dictionaries—could you share the sentence you found it in?","zh":"“hashabi”在大多数英语词典里查不到——你能把它出现的句子发我吗？"}]}],"phonetic":"/hɑːˈʃɑːbi/","extraExplanation":["“hashabi”更像音译/拼写变体而非英语单词。不同语境下可能对应不同语言的词（例如人名、地名或口语写法），发音和含义会随来源语言而变。","如果你告诉我它出现的句子、来源（歌曲/游戏/社媒/文章）或你想表达的意思，我可以更准确地判断它是否应为其他拼写（如 Hasabi/Hisabi/Hashabi 等）并给出对应解释。"]}
{"word":"hashed","summary":{"en":"“Hashed” usually means food cut into small pieces; in computing, it means turned into a hash value for identification or security.","zh":"“hashed”通常指（食物）切碎的；在计算机领域指被转换成哈希值，用于识别或安全。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of food) cut into very small pieces, often for cooking.","zh":"（食物）切碎的、剁碎的（常用于烹饪）。"},"examples":[{"en":"Add hashed onions and cook them until soft.","zh":"加入切碎的洋葱，煮到变软。"},{"en":"She made a breakfast plate with hashed potatoes and eggs.","zh":"她做了一份早餐：碎土豆配鸡蛋。"}]},{"partOfSpeech":"adj.","definition":{"en":"(computing) converted into a fixed-length code (a “hash”) for identification or security.","zh":"（计算机）被转换成固定长度的“哈希值”，用于识别或安全用途的。"},"examples":[{"en":"The website stores hashed passwords, not plain text.","zh":"该网站存储的是哈希后的密码，而不是明文。"},{"en":"This file has a hashed fingerprint to verify it wasn’t changed.","zh":"这个文件有一个哈希指纹，用来验证它没有被篡改。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hash”: to chop into small pieces; also, to discuss something thoroughly (often: hash out).","zh":"“hash”的过去式/过去分词：把……切碎；也可指把某事反复讨论清楚（常用：hash out）。"},"examples":[{"en":"He hashed the meat before adding spices.","zh":"他把肉剁碎后再加香料。"},{"en":"We hashed out a plan for the project.","zh":"我们把项目计划讨论清楚了。"}]}],"synonyms":["chopped","minced","diced","shredded","hashed out (discussed)","hashed (computed)"],"phonetic":"/hæʃt/","extraExplanation":["在烹饪里，hashed 常见于菜单或食谱，意思类似 minced（剁碎/绞碎）或 chopped（切碎），但具体大小取决于语境。","在计算机领域，hashed 指“经过哈希处理”。哈希（hashing）不是加密（encryption）：哈希通常是单向的，用来做校验、快速比对或安全存储（如密码）；同一输入通常会得到同一哈希值。"]}
{"word":"hasheesh","summary":{"en":"“Hasheesh” is an older/alternate spelling of “hashish,” meaning cannabis resin used as a drug.","zh":"“hasheesh”是“hashish”的旧式/另一种拼写，指作为毒品使用的大麻树脂（大麻脂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cannabis resin (or a preparation made from it), used as a drug; hashish.","zh":"（大麻的）树脂或其制品；作为毒品使用的“哈希什/大麻脂”（即 hashish）。"},"examples":[{"en":"Police reported finding hasheesh in the suspect’s bag.","zh":"警方报告在嫌疑人的包里发现了哈希什（大麻脂）。"},{"en":"In some older travel writing, “hasheesh” appears as an old spelling of “hashish.”","zh":"在一些较早的游记中，“hasheesh”常作为“hashish”的旧式拼写出现。"}]}],"synonyms":["hashish","hash"],"phonetic":"/həˈʃiʃ/","extraExplanation":["“hasheesh”是“hashish”的另一种拼写（更常见的是 hashish / hash）。它源自阿拉伯语相关词形，历史上在英语文本中常见于19世纪旅行记、东方主义题材或旧译作品中。","语体与使用提醒：该词通常出现在法律、新闻或历史语境里；日常英语更常说“hash”或“hashish”。在许多国家和地区，大麻制品的持有与使用可能违法或受严格限制，阅读或使用时需注意语境与合规。"]}
{"word":"hasheeshes","summary":{"en":"“Hasheeshes” is the plural of “hasheesh/hashish,” meaning pieces or types of cannabis resin (a concentrated form of marijuana).","zh":"“hasheeshes” 是 “hasheesh/hashish”的复数，指多块或多种大麻树脂（大麻的浓缩形式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hasheesh (also spelled hashish): a cannabis concentrate (resin) that is usually pressed into blocks or balls and smoked or eaten.","zh":"hasheesh（也拼作 hashish）的复数：一种大麻浓缩物（树脂），通常被压成块状或球状，用于吸食或食用。"},"examples":[{"en":"Police reported finding several hasheeshes during the search.","zh":"警方表示在搜查中发现了几块大麻树脂（hasheeshes）。"},{"en":"Different hasheeshes can vary a lot in strength and smell.","zh":"不同的 hasheeshes 在效力和气味上可能差异很大。"}]}],"synonyms":["hashish","hash","cannabis resin"],"phonetic":"/hæˈʃiʃ/","extraExplanation":["“hasheesh / hashish”在英文里更常见的拼写是 **hashish**，口语中也常简称为 **hash**。","这个词通常出现在法律、新闻或医学语境中；在很多地区它属于违法或受严格管制的毒品相关词汇，使用时要注意场合与法律风险。"]}
{"word":"hasher","summary":{"en":"A hasher is usually a person or program that creates a hash from data; it can also mean a member of the Hash House Harriers running club.","zh":"hasher 通常指生成哈希值的个人或程序；也可指“哈希跑团”（Hash House Harriers）的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or program that creates a hash (a short code) from data, especially in computing and cybersecurity.","zh":"（尤指计算机与网络安全中）把数据计算成“哈希值/散列值”（一段较短的代码）的个人或程序/工具。"},"examples":[{"en":"The app uses a hasher to store passwords safely, not the original text.","zh":"这个应用用哈希器来安全地存储密码，而不是存原始文本。"},{"en":"Our hasher outputs a 64-character string for each file.","zh":"我们的哈希器会为每个文件输出一个 64 个字符的字符串。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Hash House Harriers, a social running club whose events are called “hashes.”","zh":"“哈希跑团”（Hash House Harriers）的成员；这种社交跑步活动常被称为“hash（哈希跑）”。"},"examples":[{"en":"She became a hasher after moving to a new city and wanted to meet people.","zh":"她搬到新城市后加入了哈希跑团，成了一名 hasher，想多认识些人。"},{"en":"On weekends, the hashers follow chalk marks to find the trail.","zh":"周末时，跑团成员会沿着粉笔标记寻找路线。"}]}],"synonyms":["hash function","hashing tool","hashing algorithm","Hash House Harrier"],"phonetic":"/ˈhæʃɚ/","extraExplanation":["在计算机里，hash（哈希/散列）常用来做“快速比对”和“安全存储”。例如：文件校验（确认文件有没有被改过）和密码存储（通常存哈希后的结果而不是明文）。hasher 可以指“哈希函数/哈希算法的实现”或“执行哈希计算的工具”。","Hash House Harriers 起源于 1930 年代的马来西亚，活动结合跑步与社交，路线常用粉笔或纸屑标记；因此成员被称为 hashers。这是一个文化用法，和计算机的 hasher 完全不同。"]}
{"word":"hashery","summary":{"en":"A “hashery” is a casual, inexpensive diner or small restaurant—often one that serves hash and other hearty, simple food.","zh":"“hashery”指随意、价格亲民的小餐馆/小饭馆，常供应牛肉土豆杂烩（hash）等简单饱腹的餐食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple restaurant or diner (often inexpensive) where hash and other hearty meals are served; a “hash house.”","zh":"（口语）简便的小餐馆/小饭馆（常较便宜），供应牛肉土豆杂烩（hash）等家常饱腹食物；也可称“hash house”。"},"examples":[{"en":"We stopped at a little hashery for breakfast before the road trip.","zh":"出发自驾前，我们在一家小饭馆吃了早餐。"},{"en":"That old hashery on the corner serves big portions for a low price.","zh":"拐角那家老式小饭馆分量很足，价格也便宜。"}]}],"synonyms":["hash house","diner","cafe","greasy spoon","eatery"],"phonetic":"/ˈhæʃəri/","extraExplanation":["“hashery”由“hash（牛肉土豆杂烩）+ -ery（表示场所的后缀，如 bakery 面包店）”构成，带一点美式怀旧、随意的口语色彩。常见于描述路边餐馆、老式小馆子等语境。"]}
{"word":"hashes","summary":{"en":"“Hashes” can mean plural dishes called hash, plural “#” symbols, plural computing hash values, or the verb form meaning “discuss to resolve” (often “hash out”).","zh":"“hashes”可指：杂烩菜（hash）的复数、多个“#”符号、多个哈希值；也可作动词，表示“反复讨论以解决问题”（常见于 hash out）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hash” (a dish of chopped food, often mixed with potatoes and fried).","zh":"“hash”的复数（一道把食材切碎拌在一起、常与土豆一起煎炒的菜）。"},"examples":[{"en":"They made corned beef hashes for breakfast.","zh":"他们早餐做了咸牛肉土豆杂烩（corned beef hashes）。"},{"en":"Leftovers can be turned into hashes quickly.","zh":"剩菜很快就能做成杂烩（hashes）。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “hash” meaning the symbol “#” (often called a hash sign).","zh":"“hash”的复数，指“#”这个符号（常叫 hash sign）。"},"examples":[{"en":"The password must include letters, numbers, and hashes (#).","zh":"密码必须包含字母、数字和井号（#）等符号。"},{"en":"Remove extra spaces and hashes from the text.","zh":"把文本里多余的空格和井号（#）去掉。"}]},{"partOfSpeech":"n.","definition":{"en":"Computing: plural of “hash,” a value produced by a hash function (used to identify or check data).","zh":"【计算机】“hash”的复数，指“哈希值/散列值”（由哈希函数生成，用于标识或校验数据）。"},"examples":[{"en":"The system stores file hashes to detect changes.","zh":"系统保存文件的哈希值来检测是否被更改。"},{"en":"Two different files can sometimes produce the same hashes.","zh":"两个不同文件有时可能产生相同的哈希值。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “hash”: to talk about something again in order to reach an agreement (often in “hash out”).","zh":"“hash”的第三人称单数：把问题反复讨论以达成一致（常用于 hash out）。"},"examples":[{"en":"She hashes out the details with her team before the meeting.","zh":"开会前，她会和团队把细节讨论清楚。"},{"en":"He hashes out old arguments instead of moving on.","zh":"他老是翻旧账争论，而不是往前走。"}]}],"synonyms":["hash out","revisit","discuss","# (hash sign)","hashtag"],"phonetic":"/ˈhæʃɪz/","extraExplanation":["在美式英语里，“#”还常被叫作“pound sign”（电话按键上的井号），在社交媒体里也常指“hashtag（话题标签）”。","短语“hash out”非常常见，意思是“把事情谈透/谈出结果”。"]}
{"word":"hashhead","summary":{"en":"A slang, often negative word for a heavy hashish/cannabis user.","zh":"一个常带贬义的俚语，指重度吸食大麻脂/大麻的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A person who regularly uses hash (hashish) or cannabis; a heavy marijuana user.","zh":"（俚语）经常吸食大麻脂（hashish）或大麻的人；重度大麻使用者。"},"examples":[{"en":"In the old movie, the detective calls him a hashhead to suggest he’s always high.","zh":"在那部老电影里，侦探叫他 hashhead，暗示他总是嗑嗨了。"},{"en":"He didn’t like being labeled a hashhead, even though he used cannabis every day.","zh":"他不喜欢被贴上 hashhead 的标签，尽管他每天都用大麻。"}]}],"synonyms":["stoner","pothead","dopehead"],"phonetic":"/ˈhæʃˌhɛd/","extraExplanation":["“hashhead”属于非正式、带贬义的俚语，常用于指责或嘲讽他人，有时也用来刻画影视作品里的“瘾君子/嗑药者”形象。日常交流中更中性的说法可用“cannabis user”（大麻使用者）或“someone who uses marijuana”（使用大麻的人）。","词形上是复合词：hash（大麻脂）+ head（口语里可表示“沉迷某事的人”，如“gearhead”迷汽车/机械，“deadhead”指“铁杆粉丝”等）。"]}
{"word":"hashheads","summary":{"en":"Hashheads = plural of “hashhead,” a slang term for heavy hashish/cannabis users (and less commonly, drug addicts more generally).","zh":"hashheads 是“hashhead”的复数：俚语，指经常吸食大麻树脂/大麻的人（较少见也可泛指毒瘾者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) A person who uses hashish (cannabis resin) regularly; a heavy cannabis user.","zh":"（俚语，非正式）经常吸食大麻树脂（hashish）的人；重度大麻使用者。"},"examples":[{"en":"In the 1970s, the film portrayed a group of carefree hashheads traveling across Europe.","zh":"在20世纪70年代，这部电影描绘了一群无忧无虑、在欧洲旅行的“嗑大麻”的人。"},{"en":"He didn’t want to be seen as a hashhead, so he stopped hanging out with that crowd.","zh":"他不想被人当成“大麻瘾君子”，所以不再和那帮人混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, less common) A person addicted to heroin or other drugs (using “hash” in the older sense of narcotics).","zh":"（俚语，较少见）对海洛因或其他毒品上瘾的人（“hash”在较旧用法中可泛指毒品）。"},"examples":[{"en":"The novel uses harsh street slang, calling the characters hashheads and hustlers.","zh":"这部小说使用了尖锐的街头俚语，把人物称作“瘾君子”和“骗子”。"}]}],"synonyms":["pothead","stoner","cannabis user","drug addict (broader/less specific)"],"phonetic":"/ˈhæʃˌhɛd/","extraExplanation":["“hashhead”由“hash（hashish，大麻树脂）+ head（口语：某种事物的爱好者/沉迷者）”构成，类似的说法还有“pothead”。语气通常带评价色彩，可能显得冒犯或贬义，日常交流中要谨慎使用。","你输入的“hashheads”是复数形式；词典条目常用单数“hashhead”。"]}
{"word":"hashimite","summary":{"en":"Hashimite means “Hashemite”: relating to, or a member of, the Hashemite family—especially the royal family of Jordan.","zh":"Hashimite（同 Hashemite）指“与哈希姆家族有关的；或哈希姆家族成员”，尤其用于指约旦王室/约旦哈希姆王国。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Hashemites, a royal family and lineage tracing back to Hashim (an ancestor of the Prophet Muhammad); especially connected with the ruling family of Jordan","zh":"与哈希姆家族（Hashemites，源自哈希姆的家族谱系，被认为与先知穆罕默德同宗）有关的；尤指与约旦王室/约旦哈希姆王国相关的"},"examples":[{"en":"Jordan is officially called the Hashemite Kingdom of Jordan, a Hashimite monarchy.","zh":"约旦的官方国名是“约旦哈希姆王国”，属于哈希姆家族的君主制国家。"},{"en":"The article discussed Hashimite leadership in the modern Middle East.","zh":"这篇文章讨论了现代中东的哈希姆家族领导地位。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Hashemite (Hashimite) family or lineage, especially someone from the ruling family of Jordan","zh":"哈希姆家族成员；尤指约旦王室成员"},"examples":[{"en":"A Hashimite has ruled Jordan for decades.","zh":"约旦多年来一直由哈希姆家族的国王统治。"}]}],"synonyms":["Hashemite"],"phonetic":"/ˈhæʃəˌmaɪt/","extraExplanation":["更常见的拼写是 **Hashemite**；**Hashimite** 也可见，但在新闻与学术写作里通常用 Hashemite（如 “Hashemite Kingdom of Jordan”）。","“Hashemite/Hashimite” 来自 **Hashim（哈希姆）** 这一家族名/祖先名。历史上，“哈希姆家族”与麦加的古莱什部族有关，并在近现代中东政治史（如阿拉伯起义、约旦建国等）中频繁出现。"]}
{"word":"hashing","summary":{"en":"Hashing is mainly the computing process of converting data into a fixed-length hash for fast lookup or integrity checks.","zh":"Hashing 主要指（计算机）把数据转换成固定长度哈希值的过程，用于快速查找或校验完整性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of using a hash function to turn data into a fixed-length code (a “hash”), often for fast lookup or checking integrity in computing","zh":"（计算机）用哈希函数把数据转换成固定长度的“哈希值/散列值”的过程，常用于快速查找或校验数据是否被篡改"},"examples":[{"en":"The website uses hashing to store passwords more safely.","zh":"该网站用哈希来更安全地存储密码。"},{"en":"Hashing helps the program find items quickly in a hash table.","zh":"哈希帮助程序在哈希表中快速找到项目。"},{"en":"They verified the downloaded file by comparing its hash.","zh":"他们通过对比哈希值来验证下载的文件。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of chopping food into small pieces and cooking or mixing it (less common)","zh":"（较少见）把食物切碎并烹调或拌在一起的做法"},"examples":[{"en":"For breakfast, she prepared a quick hashing of potatoes and onions.","zh":"早餐她快速做了一份土豆和洋葱的碎炒。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “hash”: to chop or mix something into a rough mass; also used figuratively to mean discussing something again","zh":"动词“hash”的现在分词：把……切碎/拌成一团；也可引申为把某事反复讨论"},"examples":[{"en":"They kept hashing the same argument in every meeting.","zh":"他们在每次会议上都反复争论同一个问题。"},{"en":"He’s hashing the vegetables for the stew.","zh":"他在把蔬菜切碎准备炖菜。"}]}],"synonyms":["hashing (computing): hashing process","hashing (computing): hashing algorithm use","chopping","mincing"],"phonetic":"/ˈhæʃɪŋ/","extraExplanation":["在计算机语境里，hashing 通常不是“加密（encryption）”。加密是为了把内容变成别人读不懂、但可以解密还原；而哈希一般是“不可逆”的（很难从哈希值还原原文），常用于校验完整性、快速索引，以及密码存储（通常还会配合 salt/加盐）。","哈希可能出现“碰撞（collision）”：不同输入得到相同哈希值。好的哈希函数会让碰撞概率极低，但在安全场景中仍需要选择合适算法（如用于密码的专用算法）并遵循最佳实践。"]}
{"word":"hashish","summary":{"en":"Hashish is a concentrated cannabis resin used as a drug.","zh":"hashish 指由大麻树脂浓缩制成的毒品（大麻脂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cannabis drug (often in a brown or black resin form) made from the concentrated resin of the marijuana plant; it is usually smoked or eaten and can cause a “high.”","zh":"大麻脂（通常为棕色或黑色树脂状），由大麻植物的树脂浓缩制成；常被吸食或食用，会使人产生“兴奋/飘”的感觉。"},"examples":[{"en":"In some countries, hashish is illegal and can lead to serious penalties.","zh":"在一些国家，大麻脂是非法的，可能会导致严重处罚。"},{"en":"He avoided hashish because it made him feel anxious.","zh":"他避开大麻脂，因为那会让他感到焦虑。"}]}],"synonyms":["hash","cannabis resin"],"phonetic":"/ˈhæʃiʃ/","extraExplanation":["“hashish”常见缩写是“hash”。在不同国家/地区，它的法律地位差异很大；学习或使用该词时，注意语境可能涉及法律与健康风险。","词源上通常认为来自阿拉伯语相关词汇，历史上在中东、北非等地区较早出现并传播；英语里更偏向指“树脂浓缩物”，区别于一般意义的“marijuana/weed”（多指干燥的花叶）。","在文学与文化作品中，这个词有时被用来营造“异域/放纵/反叛”的氛围，但现实讨论中也常与成瘾风险、精神状态影响等话题相连。"]}
{"word":"hashishes","summary":{"en":"“Hashishes” means multiple kinds or packages/pieces of hashish (a concentrated cannabis resin).","zh":"“Hashishes”指多种或多包/多块的大麻脂（浓缩的大麻树脂制品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hashish: a cannabis (marijuana) product made from pressed or concentrated resin, used as a drug.","zh":"hashish（大麻脂/大麻树脂）的复数：由大麻的树脂压制或浓缩而成的制品，作为毒品被吸食。"},"examples":[{"en":"Police reported finding several packages of hashishes in the suspect’s bag.","zh":"警方称在嫌疑人的包里发现了几包大麻脂制品。"},{"en":"The museum display discussed how different cultures historically used cannabis products such as hashish; the text mentioned “hashishes” in old translations.","zh":"博物馆展览介绍不同文化历史上如何使用包括大麻脂在内的大麻制品；一些旧译本里会出现“hashishes”这个复数形式。"}]}],"synonyms":["hashish (plural)","hash (informal)","cannabis resin"],"phonetic":"/ˈhæʃiʃɪz/","extraExplanation":["“hashishes”在现代英语中不算常见，因为“hashish”很多时候被当作不可数名词（uncountable）使用；当强调“几种/几批/几块不同的大麻脂制品”时，才会用复数“hashishes”。","hashish 属于受严格管制的毒品话题；在写作或讨论中常见于新闻报道、医学/社会研究或历史语境中。不同国家和地区的法律差异很大，避免在现实中涉及或传播违法使用的信息。"]}
{"word":"hashiya","summary":{"en":"“hashiya” is usually a Japanese name (not an English vocabulary word).","zh":"“hashiya”通常是日语名字（不是英语词汇）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Japanese surname or given name (a proper noun), used as a family name, brand name, or place/business name in Japan.","zh":"（专有名词）日语中的姓氏或名字，可用作家族姓、品牌名，或日本的店名/地名等。"},"examples":[{"en":"Hashiya is my coworker’s family name.","zh":"Hashiya 是我同事的姓。"},{"en":"We ate at a small restaurant called Hashiya.","zh":"我们在一家叫 Hashiya 的小餐馆吃了饭。"}]},{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; in English texts it usually appears only as a name (person, shop, product, or place).","zh":"不是标准英语词汇；在英语语境里通常只作为名字（人名、店名、产品名或地名）出现。"},"examples":[{"en":"I couldn’t find “hashiya” in an English dictionary because it’s a name.","zh":"我在英文字典里找不到“hashiya”，因为它是一个名字。"}]}],"phonetic":"/hɑːˈʃiːjə/","extraExplanation":["“Hashiya/はしや”在日语里可能对应不同写法与含义（例如不同汉字的姓氏），具体意思要看原文怎么写（汉字/假名）。如果你是从某个句子、动漫、店招或地址里看到的，把上下文或图片发来，我可以更准确判断它指什么。"]}
{"word":"Hashshashin","summary":{"en":"Hashshashin is a historical term linked to the Nizari Ismailis and later popularized as an origin for the idea of an “assassin.”","zh":"Hashshashin 是一个与尼扎里伊斯玛仪派相关的历史称呼，后来在大众语境中常被拿来与“刺客/暗杀者”联系起来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical name (from medieval Islamic history) often used to refer to the Nizari Ismailis, a Shia Muslim community known in some sources for targeted political killings; the word is also linked in popular culture to the idea of an “assassin.”","zh":"一个历史称呼（源自中世纪伊斯兰历史），常被用来指尼扎里伊斯玛仪派（什叶派伊斯兰教的一个社群）；在一些史料中他们因政治性的定点刺杀而出名，因此该词在大众文化里也常与“刺客/暗杀者”的概念相联系。"},"examples":[{"en":"Some medieval European writers used the term “Hashshashin” to describe a feared group of political killers in the Middle East.","zh":"一些中世纪的欧洲作者用“Hashshashin”来描述中东地区令人畏惧的政治刺杀者群体。"},{"en":"In modern novels and games, “Hashshashin” is sometimes used as a dramatic synonym for “assassin,” though it is historically complicated.","zh":"在现代小说和游戏中，“Hashshashin”有时被当作“assassin（刺客）”的戏剧化同义词使用，但其历史背景其实很复杂。"}]}],"synonyms":["Hashashin","Nizari Ismailis","assassin (in popular usage)"],"phonetic":"/ˌhɑːʃəˈʃiːn/","extraExplanation":["拼写说明：更常见的转写是 Hashashin / Hashshāshīn（阿拉伯语：حشّاشين），你写的 “Hashshashin” 属于变体拼写。","词源与争议：这个词常被解释为与阿拉伯语中“hashish（大麻树脂）”相关，但学界对这种解释是否准确存在争论；部分说法可能来自敌对势力的污名化宣传。","文化与用法提醒：在英语里，assassin（刺客/暗杀者）这个常用词常被认为与 Hashashin 有历史关联，但把 Hashshashin 直接等同于“恐怖分子”或简单标签化会忽略其宗教与政治背景，使用时建议注明历史语境。"]}
{"word":"hasht","summary":{"en":"“Hash” commonly means a chopped-and-mixed food dish, and it can also mean the # symbol or the verb phrase “hash out” (discuss in detail).","zh":"“hash”常指把食物切碎混合的杂烩，也可指“#”井号；短语“hash out”表示把事情详细讨论清楚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mixture of chopped food (often meat and potatoes) cooked and served together","zh":"（常指肉和土豆等）切碎后混合烹调并一起食用的杂烩（菜）"},"examples":[{"en":"For breakfast, they served corned beef hash with eggs.","zh":"早餐他们端上了咸牛肉杂烩配鸡蛋。"},{"en":"She made a hash from yesterday’s roast and some potatoes.","zh":"她用昨天的烤肉和一些土豆做了杂烩。"}]},{"partOfSpeech":"v.","definition":{"en":"to chop and mix food into a rough, messy mixture; (also) to talk about something again in detail, often repeating points","zh":"把食物切碎并混合成粗糙的一团；（也指）把某事翻来覆去地详细讨论（常带重复）"},"examples":[{"en":"He hashed the vegetables with leftover chicken.","zh":"他把蔬菜和剩鸡肉切碎拌在一起。"},{"en":"We don’t need to hash out the same argument again.","zh":"我们没必要再把同样的争论翻来覆去地讲一遍。"}]},{"partOfSpeech":"n.","definition":{"en":"a symbol (#), used especially in hashtags and some phone menus","zh":"井号（#）；常用于话题标签或电话菜单"},"examples":[{"en":"Add a hash before the keyword to make a hashtag.","zh":"在关键词前加井号就成了话题标签。"},{"en":"Press the hash key to continue.","zh":"按井号键继续。"}]}],"synonyms":["mix","chop","discuss","pound sign","#"],"phonetic":"/hæʃ/","extraExplanation":["“hasht”通常不是标准英文拼写。你可能想写的是“hash”（最常见）或“haste”（匆忙）。如果你告诉我你看到它的句子/上下文，我可以帮你确认准确词。","“hash out”是很常用的短语，意思是“把问题讨论清楚、谈妥”。"]}
{"word":"hashtag","summary":{"en":"A hashtag is “# + a keyword/phrase” used to label a topic on social media; it can also be used as a verb (to add # tags).","zh":"Hashtag（话题标签）是“# + 关键词/短语”，用于在社交媒体上标记主题、便于搜索；也可作动词表示“加话题标签”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a word or phrase (without spaces) preceded by the symbol #, used on social media to label a topic and make posts easier to find","zh":"（社交媒体上的）话题标签：在词或短语前加“#”（通常不含空格），用于标记主题、方便检索相关内容"},"examples":[{"en":"She posted a photo with the hashtag #sunset.","zh":"她发了一张照片，并加上了话题标签 #sunset。"},{"en":"Use the hashtag #StudyTips to share your advice.","zh":"用话题标签 #StudyTips 来分享你的建议。"},{"en":"That hashtag is trending right now.","zh":"那个话题标签现在正在走红。"}]},{"partOfSpeech":"v.","definition":{"en":"to add a hashtag to a post or to label something with a hashtag","zh":"给（帖子）加话题标签；用“#”给内容打标签"},"examples":[{"en":"Hashtag your location so people can find it.","zh":"给你的位置加话题标签，这样别人更容易找到。"},{"en":"They hashtagged the campaign name on every post.","zh":"他们在每条帖子上都加了活动名称的话题标签。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, humorous) used to add a quick comment or “tagline” at the end of a sentence, as if speaking like social media","zh":"（非正式/幽默）用来在句末加一句“标签式吐槽/总结”，模仿社交媒体说话方式"},"examples":[{"en":"I finished all my homework—hashtag blessed.","zh":"我把作业都写完了——#太幸福了。"},{"en":"Another meeting at 7 a.m., hashtag no sleep.","zh":"早上七点又开会，#没得睡。"}]}],"synonyms":["tag","topic tag","label"],"phonetic":"/ˈhæʃtæɡ/","extraExplanation":["“Hashtag”源于#号（也叫hash或pound sign）+ tag（标签）。在Twitter等平台普及后，#用来把内容归类成可搜索的话题。","书写习惯：英语里通常把hashtag后面的词连写（如#StudyTips），或用驼峰式首字母大写提升可读性（#BlackLivesMatter）。","注意区分：#在编程或电话键盘里也常见，但在日常交流中说“hashtag”通常指社交媒体话题标签。"]}
{"word":"hashy","summary":{"en":"Hashy usually means “cannabis-like in smell/taste,” and less commonly can mean “like hash (food)” or “messy/confusing.”","zh":"Hashy 通常指“有大麻树脂那种气味/味道”，较少见时也可指“像杂烩食物的风味”或“乱糟糟、令人困惑”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the smell, taste, or effect associated with hashish (cannabis resin); cannabis-like.","zh":"（非正式）带有大麻树脂（hashish）的气味、味道或影响；有“大麻味/劲儿”的。"},"examples":[{"en":"This strain has a strong, hashy aroma.","zh":"这个品种有很浓的“大麻树脂味”。"},{"en":"The smoke tasted a bit hashy to me.","zh":"我觉得烟味有点像大麻树脂。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling hash (food) in taste or smell; meat-and-potatoes, cooked-down flavor.","zh":"（较少见）有“杂烩肉末土豆”（hash）那种味道或气味的；像家常炒杂烩的风味。"},"examples":[{"en":"The leftovers turned into a hashy breakfast skillet.","zh":"剩菜做成了一锅带点“杂烩”风味的早餐。"}]},{"partOfSpeech":"adj.","definition":{"en":"Messy, jumbled, or confusing; like a hash (a muddle).","zh":"（少见）乱糟糟的、杂乱的、让人困惑的；像“一团糟”。"},"examples":[{"en":"His explanation got hashy and hard to follow.","zh":"他的解释变得很乱，让人难以跟上。"}]}],"synonyms":["cannabis-like","weedy","skunky","herbal","pungent","muddled"],"phonetic":"/ˈhæʃi/","extraExplanation":["“hashy”最常见于口语/俚语，尤其出现在讨论大麻产品（气味、口感、烟雾特征）时。由于不同地区对大麻的法律与文化态度不同，使用时要注意场合与受众（在正式写作中通常避免）。","词源上来自“hash”（可指大麻树脂 hashish 的简称，也可指一种把食材切碎混炒的食物）。因此它既能表示“像大麻的味道”，也可能在饮食语境里表示“像杂烩/炒碎料的风味”。"]}
{"word":"hasid","summary":{"en":"A Hasid is a member of the Hasidic Jewish community.","zh":"Hasid 指哈西德派犹太教社群的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of Hasidic Judaism, a traditional Jewish religious movement known for strong community life, spiritual devotion, and often distinctive dress","zh":"哈西德派犹太教徒；哈西德派成员（犹太教中的一支传统宗教运动，以虔诚的灵修、紧密的社群生活及常见的独特服饰而闻名）"},"examples":[{"en":"In some New York neighborhoods, you may see Hasid families walking to synagogue on the Sabbath.","zh":"在纽约的一些社区，你可能会看到哈西德派家庭在安息日前往会堂。"},{"en":"The book includes interviews with a Hasid who describes daily religious life in his community.","zh":"这本书收录了一位哈西德派成员的访谈，他描述了自己社群中的日常宗教生活。"}]}],"synonyms":["Hasidic Jew","Hasidic person"],"phonetic":"/ˈhɑːsɪd/","extraExplanation":["“Hasid”来自希伯来语“חסיד”（chasid），本义接近“虔敬者/敬虔的人”。复数常见为“Hasidim”（哈西德派众人）。","在英语里，“Hasid”多指个人，“Hasidic”是形容词（如 Hasidic community/Hasidic tradition），也常用更明确的说法“Hasidic Jew”。在书写时通常大写，表示特定宗教与文化群体。"]}
{"word":"hasidean","summary":{"en":"Hasidean means “Hasidic”: connected with Hasidism or a follower of it.","zh":"Hasidean 意为“哈西德派的/哈西德派信徒”，与哈西德派犹太教运动有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Hasidism (a Jewish religious movement) or to Hasidic Jews.","zh":"与哈西德派（犹太教的一支宗教运动）或哈西德派犹太人有关的。"},"examples":[{"en":"She studied Hasidean stories and songs from Eastern Europe.","zh":"她研究来自东欧的哈西德派故事与歌曲。"},{"en":"The museum has a section on Hasidean life and traditions.","zh":"这家博物馆有一个关于哈西德派生活与传统的展区。"}]},{"partOfSpeech":"n.","definition":{"en":"a Hasidic Jew; a follower of Hasidism.","zh":"哈西德派犹太人；哈西德派的信徒。"},"examples":[{"en":"In the novel, a Hasidean visits the city for the first time.","zh":"在小说里，一位哈西德派信徒第一次来到城市。"}]}],"synonyms":["Hasidic","Hasid","Hasidim (pl.)"],"phonetic":"/ˌhɑːsɪˈdeɪən/","extraExplanation":["“Hasidean”在英语里相对少见，更常见的写法是“Hasidic”（形容词）和“Hasid”（名词，单数；复数 Hasidim）。如果你是在读宗教史或文学译本时遇到“Hasidean”，通常等同于“Hasidic/Hasid”。","哈西德派（Hasidism）兴起于18世纪的东欧，强调虔敬、喜乐的宗教实践，以及由灵性领袖（常称 rebbe）带领社群。文学与民间故事里常见“Hasidic tales（哈西德故事）”这种表达。"]}
{"word":"hasidic","summary":{"en":"Hasidic means “connected with Hasidism,” a Jewish Orthodox spiritual movement and its communities.","zh":"Hasidic 指“与哈西德派/哈西德运动相关的”，常用来描述其宗教传统与社群。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hasidism, a Jewish religious movement known for joyful worship, strong community life, and spiritual devotion (especially within Orthodox Judaism).","zh":"哈西德派（Hasidism）相关的；指犹太教中的哈西德运动/传统，以热情的敬拜、紧密的社群生活和灵性虔诚著称（多属于正统犹太教范围）。"},"examples":[{"en":"She is studying Hasidic communities in New York City.","zh":"她正在研究纽约市的哈西德派社群。"},{"en":"The book describes Hasidic customs, festivals, and family life.","zh":"这本书介绍了哈西德派的习俗、节日和家庭生活。"},{"en":"Hasidic music is sometimes used to create a joyful, spiritual mood.","zh":"哈西德派音乐有时用来营造喜乐而灵性的氛围。"}]}],"synonyms":["Hasidism-related","Orthodox Jewish (specific contexts)"],"phonetic":"/həˈsɪdɪk/","extraExplanation":["“Hasidic”来自希伯来语词根，常与“Hasidism（哈西德主义/哈西德运动）”一起出现。它不是泛指“犹太人”，而是特指某些正统犹太社群与传统。","在英语里使用该词时，通常是在讨论宗教传统、社群文化、服饰（如黑帽与长外套等在部分群体中常见）或历史背景。描述时要避免把不同犹太群体混为一谈。"]}
{"word":"hasidim","summary":{"en":"Hasidim = members of Hasidic Judaism; plural of Hasid.","zh":"Hasidim 指哈西德派犹太教徒；是 Hasid 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"members of Hasidic Judaism (a traditional Jewish movement emphasizing joyful worship, community life, and guidance by a spiritual leader called a rebbe); plural of Hasid","zh":"哈西德派犹太教徒（强调喜乐敬拜、社群生活，并由称为“拉比/瑞贝（rebbe）”的精神领袖指导的传统犹太教运动）；Hasid 的复数"},"examples":[{"en":"In some neighborhoods of New York, you may see Hasidim walking to synagogue on the Sabbath.","zh":"在纽约的一些社区里，你可能会看到哈西德派犹太教徒在安息日步行去会堂。"},{"en":"The museum exhibit explained the clothing traditions of Hasidim in Eastern Europe.","zh":"博物馆展览介绍了东欧哈西德派犹太教徒的服饰传统。"},{"en":"The article compared different Jewish communities, including Hasidim and non-Hasidic Jews.","zh":"这篇文章比较了不同的犹太社群，包括哈西德派与非哈西德派犹太人。"}]}],"synonyms":["Hasidic Jews","Hasidic community members"],"phonetic":"/ˈhɑsɪdɪm/","extraExplanation":["“Hasidim”来自希伯来语，常见于英语写作中并通常首字母大写（Hasidim）。单数是“Hasid”，形容词是“Hasidic”。在称呼或描述时，语气上建议保持尊重与准确，避免把“Hasidim”当作贬义标签。不同哈西德派社群（不同“王朝/派别”）在服饰、语言（如意第绪语的使用）和习俗上也可能有差异。"]}
{"word":"hasidism","summary":{"en":"Hasidism is a movement within Orthodox Judaism that stresses joyful devotion, spiritual experience, and guidance by a rebbe.","zh":"哈西德主义是正统犹太教内的一场宗教运动，强调喜乐的虔敬、灵性体验与雷贝的引导。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Jewish religious movement (a branch of Orthodox Judaism) that began in 18th-century Eastern Europe, emphasizing joyful worship, mysticism, and devotion guided by a spiritual leader (a rebbe).","zh":"哈西德主义（犹太教正统派的一支宗教运动），起源于18世纪东欧，强调喜乐的敬拜、神秘主义传统，以及在灵性领袖（雷贝/拉比导师）的引导下修行与虔敬。"},"examples":[{"en":"Hasidism teaches that everyday actions can become a form of worship when done with intention.","zh":"哈西德主义认为，只要怀着正确的心意，日常行为也可以成为一种敬拜。"},{"en":"Many Hasidic communities maintain distinct clothing and customs as part of their religious identity.","zh":"许多哈西德社群以独特的服饰与习俗来维系其宗教身份。"},{"en":"In some novels and films, Hasidism is portrayed through close-knit communities centered around a rebbe.","zh":"在一些小说和电影中，哈西德主义常通过围绕雷贝、关系紧密的社群生活来呈现。"}]}],"synonyms":["Hasidic Judaism","Hasidut"],"phonetic":"ˈhɑːsɪdɪzəm","extraExplanation":["“Hasidism”来自希伯来语“Hasid”（意为“虔诚的人/敬虔者”）。在学术与新闻语境中，它通常指一系列相关的哈西德派别（不同社群可能有不同传统与领袖）。","代表性人物常被提到的是“巴尔·舍姆·托夫”（Baal Shem Tov），被许多人视为早期重要的精神推动者。","常见拼写也有“Hasidic”作形容词（如 Hasidic community 哈西德社群）；中文也见“哈西德派/哈西德派犹太教”。"]}
{"word":"hasinai","summary":{"en":"Hasinai is usually a personal name (not a common English word), often linked to the meaning “beautiful” in Arabic/South Asian contexts.","zh":"Hasinai 通常是人名（不是常见英语词），在阿拉伯语/南亚语境中常与“美丽”等积极含义相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a romanized South Asian/Arabic-origin name (a variant spelling of “Hasina/Haseena”), used as a given name or surname.","zh":"不是标准英语词；多见为南亚或阿拉伯语来源的人名的拉丁字母拼写（常被视为“Hasina/Haseena”的变体拼写），可作名字或姓氏。"},"examples":[{"en":"Hasinai is listed as a first name in some community records.","zh":"在一些社区记录中，Hasinai 被登记为名字。"},{"en":"I’m not sure how to pronounce Hasinai—could you say it for me?","zh":"我不太确定 Hasinai 怎么读——你能读给我听吗？"}]},{"partOfSpeech":"other","definition":{"en":"In Arabic/South Asian usage (via Arabic حسينة), the name is often associated with the meaning “beautiful” or “good/virtuous (female).”","zh":"在阿拉伯语/南亚语境中（源自阿拉伯语 حسينة），这个名字常被解释为“美丽的”或“善良/贤淑的（女性）”。"},"examples":[{"en":"Her name, Hasinai, is said to mean “beautiful.”","zh":"据说她的名字 Hasinai 有“美丽”的含义。"},{"en":"They chose the name for its positive meaning in their culture.","zh":"他们因为这个名字在文化中寓意美好而选择了它。"}]}],"synonyms":["Hasina","Haseena","Haseenah"],"phonetic":"/ˌhɑːsɪˈnaɪ/","extraExplanation":["“Hasinai”在英文词典里通常查不到，因此更可能是人名/音译拼写。不同地区、不同家庭的拼写可能不一致（如 Hasina / Haseena / Haseenah），读音也会随语言而变化。","如果你是想查某个英语单词，可能是拼写接近的词（例如：hazy、asinine、hastening 等）。你可以告诉我它出现的句子或正确拼写，我可以更准确解释。"]}
{"word":"hask","summary":{"en":"“Hask” is usually a nonstandard/dialect spelling of “ask,” and it can also be a surname.","zh":"“hask”通常是“ask”的方言/非标准拼写，也可能是一个姓氏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(dialect, nonstandard) to ask; to request information or something from someone.","zh":"（方言/非标准拼写）询问；请求（相当于 ask）。"},"examples":[{"en":"He hasked me where I was going.","zh":"他问我打算去哪里。"},{"en":"Don’t be shy—hask the teacher for help.","zh":"别害羞——去问老师帮忙。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"姓氏（人名）。"},"examples":[{"en":"Dr. Hask will speak at the conference.","zh":"Hask 博士将在会议上发言。"}]}],"synonyms":["ask","inquire","question"],"phonetic":"/hæsk/","extraExplanation":["“hask”不是现代标准英语里常见的拼写。你更可能想写的是“ask”。在一些英语方言或旧式写法里，可能会看到用 h- 开头的拼写（如 hask），但在正式写作中建议使用标准拼写“ask”。","如果你是在编程语境里看到“HASK”，也可能是对“Haskell（函数式编程语言）”的非正式缩写或标签；这种用法更像缩略词/代称，需结合上下文判断。"]}
{"word":"haskalah","summary":{"en":"Haskalah is the Jewish Enlightenment: a movement that promoted modern education and engagement with European society while reexamining Jewish tradition.","zh":"Haskalah 指“犹太启蒙运动”：提倡现代教育与融入欧洲社会，并以理性与学术重新审视犹太传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish Enlightenment movement (mainly in Europe, 18th–19th centuries) that encouraged secular education, use of European languages, and engagement with modern society, while rethinking Jewish tradition through reason and scholarship.","zh":"犹太启蒙运动（主要在18—19世纪的欧洲）：提倡世俗教育、学习与使用欧洲语言、参与现代社会，并以理性与学术研究重新思考犹太传统。"},"examples":[{"en":"The Haskalah promoted learning both Jewish texts and modern subjects like science and literature.","zh":"犹太启蒙运动提倡同时学习犹太经典与现代学科，如科学和文学。"},{"en":"Many writers influenced by the Haskalah began publishing in Hebrew and also in German or other European languages.","zh":"许多受犹太启蒙运动影响的作家开始用希伯来语写作，也用德语或其他欧洲语言发表作品。"},{"en":"In class, we discussed how the Haskalah shaped modern Jewish identity in Europe.","zh":"课堂上我们讨论了犹太启蒙运动如何塑造欧洲的现代犹太身份。"}]}],"synonyms":["Jewish Enlightenment"],"phonetic":"/hɑːsˈkɑːlə/","extraExplanation":["“Haskalah”来自希伯来语，常译为“启蒙/开明”。参与者常被称为 *Maskilim*（单数 *Maskil*）。","历史语境中，它与欧洲启蒙运动有互动关系，但并不等同：它特别聚焦于犹太社群内部的教育改革、语言选择（如推广现代希伯来语写作）、以及在传统与现代之间寻找新的定位。","阅读或写作中常见搭配：*the Haskalah movement*（犹太启蒙运动）、*Haskalah thinkers/writers*（犹太启蒙思想家/作家）。"]}
{"word":"haskard","summary":{"en":"Haskard is mainly used as a surname (a family name).","zh":"Haskard 主要用作姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Ms. Haskard will lead the meeting today.","zh":"Haskard 女士今天将主持会议。"},{"en":"I found an email from Dr. Haskard in my inbox.","zh":"我在收件箱里看到一封来自 Haskard 医生的邮件。"}]}],"phonetic":"/ˈhæskɑrd/","extraExplanation":["“Haskard”在英语里更常见为专有名词（姓氏），不是常用词汇；如果你是在查一个普通英文单词，可能是拼写有误。","你可能想查的是：hazard（危险/风险），haggard（憔悴的），或 has a card（有一张卡）。如果你告诉我语境或原句，我可以帮你确认。"]}
{"word":"haskness","summary":{"en":"“haskness” is not a standard word; it likely means “harshness” (severity/roughness/unpleasantness).","zh":"“haskness”不是标准单词；很可能是“harshness”（严厉/粗糙/令人不适）的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of **harshness**: the quality of being severe, rough, or unpleasant (in sound, weather, treatment, etc.).","zh":"很可能是 **harshness** 的拼写错误：指“严厉、刺耳、粗糙或令人不适”的特质（可用于声音、天气、对待方式等）。"},"examples":[{"en":"The harshness of the winter made travel difficult.","zh":"冬天的严酷让出行变得困难。"},{"en":"He apologized for the harshness of his words.","zh":"他为自己言语的刻薄/严厉道歉。"}]}],"synonyms":["severity","roughness","sharpness","cruelty"],"phonetic":"/ˈhɑrʃnəs/","extraExplanation":["“haskness”在标准英语里不是常见单词。你可能想写的是：\n1) **harshness**（严酷；刺耳；苛刻）\n2) **huskiness**（嗓音沙哑；沙沙声；也可指略显沙哑的音色）\n如果你告诉我你看到它的句子语境，我可以帮你确定到底是哪一个。"]}
{"word":"haskwort","summary":{"en":"Hogwarts is the famous fictional magic school in the Harry Potter stories.","zh":"Hogwarts 指《哈利·波特》里著名的虚构魔法学校“霍格沃茨”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Hogwarts: the fictional boarding school for young witches and wizards in J.K. Rowling’s Harry Potter series (full name: Hogwarts School of Witchcraft and Wizardry).","zh":"霍格沃茨：J.K. 罗琳《哈利·波特》系列中的虚构寄宿学校，培养年轻的女巫与男巫（全名：霍格沃茨魔法学校）。"},"examples":[{"en":"Harry receives a letter inviting him to Hogwarts.","zh":"哈利收到一封邀请他去霍格沃茨的信。"},{"en":"At Hogwarts, students are sorted into four houses.","zh":"在霍格沃茨，学生会被分到四个学院。"}]}],"synonyms":["Hogwarts School of Witchcraft and Wizardry","the wizarding school","the Harry Potter school"],"phonetic":"/ˈhɑɡwɔrts/","extraExplanation":["你输入的 “haskwort” 很可能是拼写误差；最常见的对应词是 “Hogwarts（霍格沃茨）”。","“Hogwarts” 是专有名词，常用于流行文化语境中；在日常英语里，人们也会用它来指代一种“充满魔法、奇幻氛围的地方/校园体验”。","词形趣味：常有人提到它看起来像由 “hog（猪）” + “warts（疣）” 组成，但在作品里它主要作为地名使用，不需要按字面理解。"]}
{"word":"hasky","summary":{"en":"Husky means a rough/hoarse voice, a strong sturdy build, or a Siberian Husky dog.","zh":"Husky 可指（声音）沙哑低沉、（身材）强壮结实，或指哈士奇（西伯利亚雪橇犬）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Deep, rough, and a little hoarse (usually about a voice), often because of a cold, tiredness, or shouting.","zh":"（形容词）声音低沉、沙哑、略带嘶哑（通常指嗓音），常因感冒、疲劳或喊叫造成。"},"examples":[{"en":"I’ve had a cold all week, so my voice sounds husky.","zh":"我感冒一整周了，所以声音听起来很沙哑。"},{"en":"After the concert, her voice was husky from singing.","zh":"演唱会后，她唱歌唱到嗓音有点沙哑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) Strong and heavily built; big and sturdy.","zh":"（形容词）强壮结实的；体格粗壮的。"},"examples":[{"en":"He’s a husky teenager who plays basketball.","zh":"他是个身材结实的少年，打篮球的。"},{"en":"They hired a husky worker to help move the furniture.","zh":"他们雇了个强壮的工人来搬家具。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A Siberian Husky: a medium-sized working dog with thick fur, often gray-and-white, originally used for pulling sleds.","zh":"（名词）哈士奇（西伯利亚雪橇犬）：一种中型工作犬，毛厚，常见灰白相间，最初用于拉雪橇。"},"examples":[{"en":"My neighbor has a husky that loves cold weather.","zh":"我邻居养了一只哈士奇，很喜欢冷天气。"},{"en":"The husky pulled the sled across the snow.","zh":"哈士奇在雪地里拉着雪橇。"}]}],"synonyms":["hoarse","raspy","burly","sturdy","Siberian Husky"],"phonetic":"/ˈhʌski/","extraExplanation":["你输入的“hasky”常见是拼写误差，更常见的单词是“husky”。","“Siberian Husky（西伯利亚雪橇犬）”在英语里经常简称为“husky”，日常对话中很常用。"]}
{"word":"haslet","summary":{"en":"Haslet usually means edible animal organs (especially pork offal) and can also mean a traditional dish made from chopped pork offal.","zh":"Haslet 通常指可食用的（尤指猪）内脏/杂碎，也可指用切碎猪杂做成的传统菜肴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the edible organs of an animal (especially a pig), such as the heart, liver, and lungs, often chopped and used for cooking","zh":"（尤指猪的）内脏、杂碎（如心、肝、肺等），常切碎用来烹饪"},"examples":[{"en":"The butcher sold haslet along with other pork offal.","zh":"肉铺除了卖其他猪杂碎，也卖猪内脏（haslet）。"},{"en":"Some old recipes use haslet to make a rich stuffing.","zh":"一些老菜谱会用猪杂（haslet）做味道浓郁的馅料。"}]},{"partOfSpeech":"n.","definition":{"en":"a dish made from chopped pork offal (haslet), sometimes formed into a loaf or meatball-like mixture and baked or fried","zh":"用切碎的猪杂（haslet）做成的菜肴（有时压成肉饼/肉卷状后烤或煎）"},"examples":[{"en":"They served sliced haslet with mustard and pickles.","zh":"他们端上切片的猪杂肉饼（haslet），配芥末和腌菜。"},{"en":"In some pubs, haslet is eaten cold as a snack.","zh":"在一些酒吧里，haslet 会冷吃当小食。"}]}],"synonyms":["offal","organ meat","variety meats"],"phonetic":"/ˈhæslɪt/","extraExplanation":["“Haslet”在现代英语里多见于英式语境，属于比较“地方/传统”的食物词汇；在美式英语中，人们更常说“offal”（内脏）或直接说具体部位（liver, heart等）。","词源上与古法语中表示“切碎”的词有关，所以它常带有“剁碎的内脏/杂碎”这一感觉。","文化上，“offal/杂碎”在英国与欧洲传统烹饪中较常见，但在不同地区接受度差异较大；点餐或阅读菜谱时留意它是否指“原料（内脏）”还是“成品菜肴”。"]}
{"word":"haslets","summary":{"en":"“Haslets” means edible animal organs (offal), especially from a pig.","zh":"“haslets”指可食用的动物内脏（下水），尤指猪内脏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the edible internal organs of an animal (such as liver, heart, lungs, etc.), especially of a pig; also used for a dish made from these organs (similar to “offal”)","zh":"（动物的）内脏（如肝、心、肺等），尤指猪的内脏；也可指用内脏做成的一道菜（类似 offal）"},"examples":[{"en":"The market sold pig haslets for making a traditional stew.","zh":"市场里卖猪内脏，用来做传统炖菜。"},{"en":"Some recipes mix haslets with onions and herbs.","zh":"有些食谱会把内脏和洋葱、香草一起烹调。"}]}],"synonyms":["offal","organ meats","variety meats"],"phonetic":"/ˈhæslɪts/","extraExplanation":["“haslet”在现代英语中较少见，更常用的说法是“offal”（总称内脏）或更具体的“liver / heart / kidneys”等。","在英式烹饪语境里，haslet也可指一种用碎肉和内脏、香料做成的肉饼/肉卷类食品（地区性用法）。如果你是在菜单或食谱里看到它，多半与传统料理有关。"]}
{"word":"haslock","summary":{"en":"“haslock” is not a standard word; it usually means “has lock” (has a lock) or is confused with “padlock.”","zh":"“haslock”不是标准单词；通常是“has lock”（有锁/带锁）的连写，或与“padlock”（挂锁）混淆。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(verb phrase) to have a lock; to be fitted with a lock.","zh":"（动词短语）有锁；装有锁。"},"examples":[{"en":"This door has a lock, so please close it when you leave.","zh":"这扇门有锁，所以你离开时请把门关好。"},{"en":"My suitcase has a lock, but I still keep it with me at the airport.","zh":"我的行李箱有锁，但在机场我还是会随身看着。"}]},{"partOfSpeech":"other","definition":{"en":"(informal/typing issue) “haslock” is often a misspelling of “has lock” (two words) or a mistaken form of “padlock” (a kind of lock).","zh":"（非正式/拼写问题）“haslock”常见于把“has lock”（分开写）连写，或误写成“padlock”（挂锁）。"},"examples":[{"en":"Correct: The gate has a lock. (Not: The gate haslock.)","zh":"正确：The gate has a lock.（不要写成：The gate haslock。）"},{"en":"I bought a padlock for my bike.","zh":"我给自行车买了一把挂锁。"}]}],"synonyms":["has a lock","is locked (different meaning)","padlock (related noun)"],"phonetic":"/hæz lɑk/","extraExplanation":["“has lock”在英语里通常是一个很普通的结构：have/has + a lock（有一把锁/带锁）。如果你想表达“上锁/把……锁上”，更常用的动词是“lock”（如：Please lock the door. 请把门锁上）。","如果你看到“Haslock”首字母大写，它也可能是人名/姓氏或品牌名；这种情况下读法和用法要看具体语境。"]}
{"word":"hasmonaean","summary":{"en":"Hasmonaean: connected with the Hasmonean Jewish dynasty of ancient Judea, or a person from that dynasty.","zh":"Hasmonaean：指与古代犹地亚的哈斯蒙尼（Hasmonean）犹太王朝有关的，或指该王朝成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Hasmoneans, a Jewish ruling family (dynasty) that governed Judea in the 2nd–1st centuries BCE after the Maccabean Revolt.","zh":"与哈斯蒙尼王朝（犹太历史上在公元前2世纪至前1世纪统治犹太/犹地亚的统治家族）有关的；哈斯蒙尼的。"},"examples":[{"en":"The Hasmonaean period shaped Jewish politics and religion in Judea.","zh":"哈斯蒙尼时期深刻影响了犹地亚的犹太政治与宗教。"},{"en":"Archaeologists found coins from the Hasmonaean era near Jerusalem.","zh":"考古学家在耶路撒冷附近发现了哈斯蒙尼时代的硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Hasmonean dynasty.","zh":"哈斯蒙尼家族/王朝成员。"},"examples":[{"en":"Some histories describe how a Hasmonaean expanded the kingdom’s territory.","zh":"一些史书描述了某位哈斯蒙尼王朝成员如何扩张王国版图。"}]}],"synonyms":["Hasmonean"],"phonetic":"/ˌhæzmoʊˈniːən/","extraExplanation":["“Hasmonaean”也常拼作“Hasmonean”。这个词与《马加比书》传统相关：马加比起义成功后，哈斯蒙尼家族建立政权，直到后来罗马势力介入、希律王朝兴起。","在英语历史/宗教研究写作中，你会看到“Hasmonaean dynasty / Hasmonaean period / Hasmonaean rulers”等固定搭配。","发音与拼写提示：字母组合“ae”在现代英语里通常读作/ iː /或/ e /附近的音；此词常见读法以/niːən/结尾，类似“Phoenician /fəˈniːʃən/”的节奏感。"]}
{"word":"hasmonaeans","summary":{"en":"The Hasmonaeans were the Jewish ruling family (dynasty) that governed Judea after the Maccabean Revolt (about 140–37 BCE).","zh":"哈斯蒙尼家族（王朝）是马加比起义后统治犹太地的犹太统治家族（约公元前140–37年）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish priestly and royal family (dynasty) that ruled Judea for about a century after the Maccabean Revolt, roughly 140–37 BCE.","zh":"哈斯蒙尼家族（王朝）：犹太的祭司—王室家族，马加比起义后在犹太地（犹太/犹太行省地区）统治约一个世纪，约公元前140–37年。"},"examples":[{"en":"The Hasmonaeans expanded Judea’s territory and strengthened Jewish political independence for a time.","zh":"哈斯蒙尼王朝一度扩张了犹太地的领土，并加强了犹太人的政治独立。"},{"en":"Many accounts connect Hanukkah’s background to the Maccabees and the rise of the Hasmonaeans.","zh":"许多叙述把光明节的历史背景与马加比家族以及哈斯蒙尼王朝的兴起联系在一起。"}]}],"synonyms":["Hasmonean dynasty","Hasmonean kingdom","Hasmoneans (plural form)"],"phonetic":"ˌhæzməˈniənz","extraExplanation":["“Hasmonaeans”是专有名词复数，单数常说“a Hasmonean”（哈斯蒙尼家族成员）。“Hasmonean dynasty / Hasmonean kingdom”指整个王朝/政权。","该家族与“马加比（Maccabees）”密切相关：马加比起义的领导者出自这一家族。后来哈斯蒙尼统治时期出现内部权力斗争，最终在罗马势力介入下走向终结，随后与希律王时期相衔接。","在英文历史/宗教语境中，你常会在关于“Second Temple period（第二圣殿时期）”、犹太史、以及光明节背景的介绍里看到这个词。"]}
{"word":"hasn","summary":{"en":"“Hasn’t” means “has not.”","zh":"“hasn’t” 意为 “has not（没有）”。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"contraction of “has not,” used with he/she/it or singular subjects in the present perfect and present perfect continuous.","zh":"“has not”的缩写，用于 he/she/it 或单数主语，常见于现在完成时和现在完成进行时。"},"examples":[{"en":"She hasn’t finished her homework yet.","zh":"她还没完成作业。"},{"en":"It hasn’t been raining long, but the streets are already wet.","zh":"雨下得不久，但街道已经湿了。"},{"en":"He hasn’t ever tried sushi.","zh":"他从来没吃过寿司。"}]}],"synonyms":["has not"],"phonetic":"/ˈhæzənt/","extraExplanation":["你输入的 “hasn” 通常是把 “hasn’t” 少打了撇号和 t（常见于短信/随手打字）。正式写作中应写作 “hasn’t”。","区分：hasn’t 用于 he/she/it（如：She hasn’t…）；haven’t 用于 I/you/we/they（如：They haven’t…）。","发音里常见弱读：/ˈhæzənt/，t 很轻或几乎不发清楚，这是口语中的自然现象。"]}
{"word":"hasnt","summary":{"en":"“hasnt” is an informal misspelling of “hasn’t” (= has not).","zh":"“hasnt”是“hasn’t”（= has not）的非正式漏写形式。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"(informal) A common misspelling of “hasn’t,” the contraction of “has not.” It means something is not true or has not happened up to now.","zh":"（非正式）“hasn’t”的常见漏写形式；“hasn’t”是“has not”的缩写，表示某事到目前为止没有发生/不成立。"},"examples":[{"en":"He hasnt called me back yet. (Better: He hasn’t called me back yet.)","zh":"他到现在还没给我回电话。（更好：He hasn’t called me back yet.）"},{"en":"It hasnt been easy, but we’re trying.","zh":"这并不容易，但我们在努力。"}]}],"synonyms":["has not"],"phonetic":"/ˈhæzənt/","extraExplanation":["“hasn’t”里一定要有撇号（apostrophe），表示省略了 not 中的字母 o：has not → hasn’t。写成“hasnt”常见于短信/聊天，但在作业、邮件、正式写作中应避免。","用法提示：hasn’t = has not，通常搭配第三人称单数（he/she/it）或单数名词主语；疑问句中常见：“Hasn’t she arrived yet?”（她还没到吗？）"]}
{"word":"hasp","summary":{"en":"A hasp is a metal latch used with a padlock to secure a door, box, or gate; it can also mean to fasten something with such a latch.","zh":"hasp 指与挂锁配合使用的金属搭扣/扣环，用于固定门、箱子或栅门；也可作动词表示“用搭扣扣住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metal fastening (often a hinged strap) that fits over a staple or loop, used to secure a door, box, or gate—usually with a padlock","zh":"（常带铰链的）搭扣；扣环（套在扣座/环上，用于固定门、箱子或栅门，常与挂锁一起使用）"},"examples":[{"en":"She closed the hasp and snapped a padlock through it.","zh":"她把搭扣扣上，并把挂锁穿过搭扣锁住。"},{"en":"The toolbox has a rusty hasp, so it’s hard to lock.","zh":"工具箱的搭扣生锈了，所以不太好锁。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fasten or secure something with a hasp","zh":"用搭扣扣住；用搭扣固定"},"examples":[{"en":"Please hasp the gate so the dog can’t get out.","zh":"请把栅门用搭扣扣好，别让狗跑出去。"}]}],"synonyms":["latch","fastener","clasp","padlock hasp"],"phonetic":"/hæsp/","extraExplanation":["“hasp”常出现在五金/门锁语境里：典型结构是“hasp + staple（扣座/锁扣座）”，把hasp盖到staple上后，再用padlock（挂锁）穿过孔来上锁。","词源来自古英语/古北欧语系，含义与“抓住、扣住”有关。"]}
{"word":"hasped","summary":{"en":"“Hasped” means “fastened/locked with a hasp (metal clasp).”","zh":"“hasped”表示“用金属搭扣（门扣/锁扣）扣上并锁住”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense and past participle of “hasp”: to fasten or lock something with a metal clasp (a hasp), usually for doors, boxes, or gates.","zh":"“hasp”的过去式/过去分词：用金属搭扣（门扣、锁扣）把门、箱子或栅门等扣上并锁住。"},"examples":[{"en":"She hasped the gate before walking away.","zh":"她离开前把栅门扣上并锁住了。"},{"en":"The wooden box was hasped and couldn’t be opened without a key.","zh":"木箱扣上了锁扣，没有钥匙打不开。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, less common) Fastened or secured with a hasp.","zh":"（形容词，较少见）用门扣/锁扣扣住的；用搭扣固定的。"},"examples":[{"en":"Keep the cabinet door hasped during transport.","zh":"运输过程中请把柜门扣好固定住。"}]}],"synonyms":["fastened","latched","secured","locked"],"phonetic":"/hæsp/","extraExplanation":["“hasp”指一种常见的金属“搭扣/门扣”，通常配合挂锁使用（hasp + padlock）。在现代日常英语里，“locked”更常用；“hasped”多见于说明书、木工/五金语境或较文学化的描写。","如果你想表达“喘气/倒吸一口气”，你可能想写的是“gasped”（他喘息/倒吸气）。"]}
{"word":"haspicol","summary":{"en":"“haspicol” is not recognized as a standard English word; it’s probably a misspelling or a proper name.","zh":"“haspicol”不是标准英语单词；大概率是拼写错误或专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/term from a specific context (e.g., a username, product name, or a word in another language).","zh":"不是标准英语单词。很可能是拼写错误，或来自特定语境的名称/术语（如用户名、产品名，或其他语言的词）。"},"examples":[{"en":"I can’t find “haspicol” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“haspicol”——你能把它出现的句子发我吗？"},{"en":"Did you mean “hospital” or “Hispanic”?","zh":"你是不是想写“hospital（医院）”或“Hispanic（西语裔的）”？"}]}],"phonetic":"/ˈhæspɪkɑl/","extraExplanation":["“haspicol”看起来像拼写混淆或把两个词拼在一起。常见的相近英文可能包括：\n- hospital（医院）\n- Hispanic（西语裔的；与西班牙语文化相关的）\n- piccolo（短笛，一种乐器）\n- hasp（搭扣；门扣）\n如果你提供来源（截图/句子/主题领域），我可以更准确判断它到底是什么词以及正确拼写。"]}
{"word":"hasping","summary":{"en":"“Hasping” means fastening something with a hasp (a metal latch), often so it can be locked.","zh":"“hasping”表示用搭扣/锁扣把东西扣上固定，常用于便于上锁。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of hasp) fastening something (like a door, gate, or box) with a metal hasp, usually so it can be locked.","zh":"（hasp 的现在分词）用“搭扣/锁扣”（常见金属件）把门、箱子等扣上固定，通常便于上锁。"},"examples":[{"en":"She was hasping the shed door before leaving for the night.","zh":"她晚上离开前把棚屋的门用搭扣扣上了。"},{"en":"After hasping the case, he added a small padlock.","zh":"他把箱子扣好后又加了一把小挂锁。"}]},{"partOfSpeech":"n.","definition":{"en":"the action or process of fastening with a hasp.","zh":"用搭扣扣住、固定的动作或过程。"},"examples":[{"en":"Proper hasping keeps the lid from popping open during travel.","zh":"正确的扣合可以防止旅行途中盖子弹开。"}]}],"synonyms":["latching","fastening","securing","locking (often with a padlock)"],"phonetic":"/ˈhæspɪŋ/","extraExplanation":["“hasp”指一种常见的五金件：一片可翻动的金属扣片（搭扣）扣到金属环/扣座上，常与挂锁（padlock）一起使用。常见场景是储物箱、工具箱、院门或小棚屋门。","拼写提示：hasp（名词/动词）→ hasping（现在分词/动名词）。"]}
{"word":"haspling","summary":{"en":"“haspling” isn’t standard; it’s most likely “hassling” (bothering or pressuring repeatedly).","zh":"“haspling” 不是标准拼写；很可能想写 “hassling”（反复打扰或施压催促）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) Likely a misspelling of **hassling**: repeatedly bothering, annoying, or pressuring someone.","zh":"（非标准拼写）很可能是 **hassling** 的拼写错误：反复打扰、惹恼或逼迫某人。"},"examples":[{"en":"Stop hassling your sister and do your homework.","zh":"别再烦你妹妹了，去写作业。"},{"en":"The salesperson kept hassling me to buy the upgraded plan.","zh":"销售人员一直缠着我，要我买升级方案。"},{"en":"I’m sorry for hassling you—I just needed an answer quickly.","zh":"抱歉一直催你/烦你——我只是需要尽快得到答复。"}]},{"partOfSpeech":"v.","definition":{"en":"The **-ing** form of the verb **hassle**: to bother, annoy, argue with, or pressure someone.","zh":"动词 **hassle** 的 **-ing** 形式：打扰、惹恼、与……争执，或施压催促某人。"},"examples":[{"en":"They were hassling the staff about the return policy.","zh":"他们就退货政策不停地跟工作人员纠缠/争执。"},{"en":"Don’t keep hassling me; I said I’ll help later.","zh":"别一直催我了；我说了晚点会帮。"}]}],"synonyms":["bothering","bugging","harassing","pressuring","pestering"],"phonetic":"/ˈhæsəlɪŋ/","extraExplanation":["“haspling” 不是常见英语单词；在聊天或口语转写里，最常见的情况是把 **hassling**（一直烦/纠缠）拼错了。","**hassle** 在美式英语里很常用，语气通常偏负面；如果想更礼貌，可以用 **keep asking / follow up**（继续询问/跟进）来替代。"]}
{"word":"hasps","summary":{"en":"Hasps are metal fasteners used to secure doors, chests, or gates, often with a padlock; “to hasp” means to fasten with one.","zh":"hasp 指用于固定门、箱子或栅门的金属搭扣，常与挂锁配合；作动词表示用搭扣扣住/锁住。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metal fastening device (often a hinged strip with a slot) that fits over a pin or staple so a padlock can be attached","zh":"（常指带铰链、带孔的）搭扣；扣环（可套在扣钉上并加挂挂锁）"},"examples":[{"en":"He secured the shed door with a hasp and padlock.","zh":"他用搭扣和挂锁把棚屋的门锁好。"},{"en":"The old wooden chest had iron hasps on the lid.","zh":"那只旧木箱的盖子上有铁搭扣。"}]},{"partOfSpeech":"v.","definition":{"en":"to fasten or lock something with a hasp","zh":"用搭扣扣住；用搭扣锁住"},"examples":[{"en":"They hasped the gate before leaving for the night.","zh":"他们晚上离开前用搭扣把大门扣好。"},{"en":"Make sure the cabinet is hasped so it won’t open during transport.","zh":"请确保柜子用搭扣扣好，运输时才不会打开。"}]}],"synonyms":["fastener","latch","clasp","padlock hasp"],"phonetic":"/hæsp/","extraExplanation":["“hasps” 是 “hasp” 的复数形式，表示多个搭扣。日常更常见的搭配是 “hasp and padlock”（搭扣和挂锁）。在工具五金、门闩、箱子、储物柜等场景中很常用。"]}
{"word":"haspspecs","summary":{"en":"“haspspecs” is not a standard word; it likely means “hasp specs,” i.e., the specifications for a hasp (a clasp used with a padlock).","zh":"“haspspecs”不是标准词；多半指“hasp specs”，即搭扣（可配合挂锁的门扣/扣件）的规格参数。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/merged form that is not a common English dictionary word. It most likely combines “hasp” + “specs.”","zh":"一个不常见的合并写法，不是标准英语词条；很可能由“hasp（搭扣/门扣）”+“specs（规格/眼镜）”组合而成。"},"examples":[{"en":"“Haspspecs” isn’t a standard word; did you mean “hasp specs” (the specifications for a hasp)?","zh":"“haspspecs”不是标准词；你是不是想说“hasp specs”（搭扣的规格参数）？"}]},{"partOfSpeech":"n.","definition":{"en":"hasp: a metal clasp/fastener (often with a hinge) used to secure a door, gate, box, or lid, usually with a padlock.","zh":"hasp：金属搭扣/扣件（常带铰链），用来固定门、栅栏、箱子或盖子，通常可配合挂锁使用。"},"examples":[{"en":"She closed the gate and slipped a padlock through the hasp.","zh":"她关上栅栏门，把挂锁穿过搭扣锁上。"},{"en":"The old chest has a rusty hasp on the front.","zh":"那个旧箱子正面有个生锈的搭扣。"}]},{"partOfSpeech":"n.","definition":{"en":"specs: informal for “specifications” (detailed requirements or measurements); also informal for “glasses.”","zh":"specs：口语，可指“规格/技术参数（specifications）”；也可口语指“眼镜”。"},"examples":[{"en":"Check the specs before you buy the laptop.","zh":"买笔记本前先看看配置参数。"},{"en":"I can’t read without my specs.","zh":"我不戴眼镜就看不清字。"}]},{"partOfSpeech":"phrase","definition":{"en":"hasp specs: the specifications (size, material, screw spacing, etc.) for a hasp.","zh":"hasp specs：搭扣的规格参数（尺寸、材质、螺丝孔距等）。"},"examples":[{"en":"The installer asked for the hasp specs to match the existing holes.","zh":"安装师傅要了搭扣规格，好对上原来的孔位。"}]}],"synonyms":["hasp specifications","hasp measurements","hardware specs (broader)"],"phonetic":"/hæsp spɛks/","extraExplanation":["“haspspecs”这种连写更像是文件名、用户名、标签（tag）或搜索关键词，而不是规范英语拼写。更自然的写法通常是“hasp specs”或“hasp specifications”。如果你指的是某个产品/软件（例如某些行业里用HASP指加密狗/授权设备），也可能是特定领域缩写；你可以告诉我上下文（出现在哪里、是什么场景），我就能给出更贴切的释义。"]}
{"word":"Hassan","summary":{"en":"Hassan is a widely used male name (and sometimes a surname) in many Arabic- and Muslim-influenced cultures.","zh":"Hassan 是在许多阿拉伯语与穆斯林文化圈中广泛使用的男性名字（有时也作姓氏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common male given name in Arabic and many Muslim communities; also used across Africa, the Middle East, and South/Southeast Asia.","zh":"常见的男性名字，源自阿拉伯语，在许多穆斯林社群中广泛使用；也常见于非洲、中东及南亚/东南亚等地区。"},"examples":[{"en":"Hassan is my classmate; he’s from Kenya.","zh":"Hassan 是我的同学；他来自肯尼亚。"},{"en":"Please ask Hassan if he can join the meeting at 3 p.m.","zh":"请问一下 Hassan 能不能参加下午三点的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) in some cultures.","zh":"在一些文化中用作姓氏。"},"examples":[{"en":"Dr. Hassan will see you now.","zh":"Hassan 医生现在为你看诊。"}]}],"synonyms":["Hasan","Hassaan"],"phonetic":"/həˈsɑːn/","extraExplanation":["“Hassan”常见的另一种拼写是“Hasan”。它与阿拉伯语词根相关，常被解释为“美好、善良”的含义，也与历史人物（如先知穆罕默德的外孙 Hasan ibn Ali）有关，因此在穆斯林文化中很受欢迎。","不同地区发音可能略有差异；英语环境中通常重音落在第二音节。"]}
{"word":"hassar","summary":{"en":"“Hassar” is not standard English; it is usually a misspelling of “hussar,” meaning a light cavalry soldier in historical European armies.","zh":"“hassar”不是标准英语词；通常是“hussar”的误拼，指历史上欧洲军队的轻骑兵士兵。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly a misspelling of “hussar.”","zh":"不是标准英语单词；最常见情况是把“hussar”拼错了。"},"examples":[{"en":"I couldn’t find “hassar” in the dictionary—did you mean “hussar”?","zh":"我在词典里找不到“hassar”——你是不是想写“hussar”？"},{"en":"The article says “hassar,” but the context suggests it should be “hussar,” a type of cavalry soldier.","zh":"文章里写“hassar”，但从上下文看应该是“hussar”，一种骑兵。"}]},{"partOfSpeech":"n.","definition":{"en":"(As “Hussar”) a light cavalry soldier, especially in European armies in past centuries.","zh":"（作“hussar”）轻骑兵士兵，尤指过去几个世纪欧洲军队中的轻骑兵。"},"examples":[{"en":"The museum displayed a hussar uniform with bright braids and buttons.","zh":"博物馆展出了一套轻骑兵制服，上面有鲜艳的绳带和纽扣。"},{"en":"In historical novels, a hussar often appears as a fast, daring cavalryman.","zh":"在历史小说里，轻骑兵常被描写成行动迅速、胆识过人的骑兵。"}]}],"synonyms":["cavalryman","horse soldier","trooper"],"phonetic":"/hʊˈzɑr/","extraExplanation":["“hussar”源自匈牙利语 huszár，后来进入多种欧洲语言与英语。轻骑兵在历史上常负责侦察、快速突袭与传递消息，因此文学与影视里常被塑造成潇洒、机动性强的骑兵形象。","如果你指的是人名/姓氏“Hassar”，那通常属于专有名词（名字），含义取决于具体文化与语言背景；给我上下文（句子或出处）我可以帮你确认。"]}
{"word":"hassel","summary":{"en":"Hassle means an annoying problem (noun) or to bother someone repeatedly (verb).","zh":"Hassle 指“麻烦事”（名词）或“纠缠/烦扰某人”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A problem or annoying situation that takes extra effort to deal with.","zh":"麻烦事；令人烦恼、需要额外精力处理的情况。"},"examples":[{"en":"Getting a refund was a real hassle.","zh":"退款真是一件麻烦事。"},{"en":"I don’t want the hassle of moving again this year.","zh":"我不想今年又为搬家折腾一遍。"}]},{"partOfSpeech":"v.","definition":{"en":"To bother, annoy, or repeatedly trouble someone, often with small demands or complaints.","zh":"打扰；纠缠；不断用琐事烦扰某人。"},"examples":[{"en":"Stop hassling me about my homework—I’ll do it after dinner.","zh":"别再为作业烦我了——我晚饭后会做。"},{"en":"Tourists were hassled by street vendors.","zh":"游客被街头小贩纠缠。"}]}],"synonyms":["trouble","nuisance","inconvenience","bother","pester"],"phonetic":"/ˈhæsəl/","extraExplanation":["你输入的 **hassel** 通常是拼写错误；正确拼写是 **hassle**。在英语里更常用的是 *a hassle*（一件麻烦事）和 *to hassle someone*（纠缠/烦扰某人）。","语气提示：*hassle* 比较口语，带有“烦人、折腾”的感觉；正式写作里可用 *inconvenience*（不便）或 *problem*（问题）更中性。"]}
{"word":"hassels","summary":{"en":"“Hassles” means annoying small problems, or it can mean “bothers repeatedly” (verb).","zh":"“Hassles”常指“烦人的小麻烦”（复数名词），也可作动词表示“反复打扰/纠缠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small problems or annoyances that make something more difficult","zh":"（复数）麻烦事；小困扰（让事情更难进行的小问题）"},"examples":[{"en":"Traveling with kids can be fun, but it also comes with a few hassles.","zh":"带孩子旅行很有趣，但也会带来一些小麻烦。"},{"en":"I like this app because it saves me time and reduces daily hassles.","zh":"我喜欢这个应用，因为它能帮我省时间、减少日常琐事带来的麻烦。"}]},{"partOfSpeech":"v.","definition":{"en":"to bother or annoy someone repeatedly; to give someone unnecessary trouble","zh":"（动词第三人称单数）不断打扰/纠缠；给某人带来不必要的麻烦"},"examples":[{"en":"He always hassles the staff with last-minute changes.","zh":"他总是临时改动，弄得员工很烦。"},{"en":"Don’t hassle me—I'll finish it after dinner.","zh":"别催我/别烦我——我晚饭后会做完。"}]}],"synonyms":["troubles","annoyances","inconveniences","bother","pester"],"phonetic":"/ˈhæsəl/","extraExplanation":["拼写提示：标准拼写是 “hassles”（不是 *hassels*）。如果你看到 “hassels”，多半是拼写错误。","语气与使用：hassle 很口语，表示“烦人的小麻烦/折腾”。比 “problem” 更轻一些，常用于日常情境（比如排队、手续、临时变更）。","常见搭配：a hassle（很麻烦）；a lot of hassles（很多麻烦）；without the hassle of...（免去……的麻烦）；hassle-free（无忧的/省事的）。"]}
{"word":"hassenpfeffer","summary":{"en":"Hasenpfeffer is a German-style marinated stew, traditionally made with rabbit.","zh":"hassenpfeffer（更常见拼法为 hasenpfeffer）指一种德式腌制后慢炖的炖菜，传统上用兔肉制作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A German-style stew (often made with rabbit) that is marinated in vinegar and spices and then slowly cooked.","zh":"一种德式炖菜（常用兔肉），通常先用醋和香料腌制，再慢炖至入味。"},"examples":[{"en":"They served hasenpfeffer with potatoes and red cabbage.","zh":"他们端上了哈森普费弗炖菜，配土豆和红甘蓝。"},{"en":"I ordered hasenpfeffer to try a traditional German dish.","zh":"我点了哈森普费弗炖菜，想尝尝传统德餐。"}]}],"synonyms":["rabbit stew","German rabbit stew","marinated stew"],"phonetic":"/ˈhæsənˌpɛfər/","extraExplanation":["“Hasenpfeffer”来自德语：Hase（野兔/兔子）+ Pfeffer（胡椒/香料）。传统做法多用野兔，现代在英语语境里也常泛指“德式兔肉（或类似肉类）酸香炖菜”。","在北美文化中，这个词也常因卡通《乐一通》（Looney Tunes）里常出现的台词而被更多人认识：角色会说“Cookin’ up a little hasenpfeffer!”来指“做点兔子菜”。因此它有时带一点幽默、夸张的口吻。"]}
{"word":"hassing","summary":{"en":"“Hassing” is not standard English; it’s usually a misspelling of “hassling” (bothering someone).","zh":"“hassing”不是标准英文，通常是把“hassling（烦扰/纠缠）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling/typing of “hassling” (being annoying to someone, giving them trouble, or repeatedly bothering them).","zh":"非标准拼写/打字错误，通常指“hassling”（不断烦扰某人、找麻烦、纠缠）。"},"examples":[{"en":"Stop hassling me—I already said no.","zh":"别再烦我了——我已经说过不行了。"},{"en":"The customer kept hassling the staff about the refund.","zh":"那位顾客一直为退款的事纠缠工作人员。"}]},{"partOfSpeech":"other","definition":{"en":"Sometimes used (incorrectly) when the writer means “harassing” or “hazing,” depending on the situation.","zh":"有时也会被误写来表示“harassing（骚扰）”或“hazing（霸凌式迎新/整人）”，要看语境。"},"examples":[{"en":"Online harassment is against the rules.","zh":"网络骚扰是违反规定的。"},{"en":"The school banned hazing in all clubs.","zh":"学校禁止所有社团的迎新霸凌/整人行为。"}]}],"synonyms":["hassling","bothering","annoying","harassing","pestering"],"phonetic":"/ˈhæsəlɪŋ/","extraExplanation":["“hassing”本身不是常见或标准英文单词；在聊天和社媒里更可能是把“hassling（纠缠/烦扰）”打错了。","如果你想表达更严重的行为：对人“骚扰”更常用 harassing；社团迎新“整人/霸凌式考验”用 hazing。","你可以把原句发我，我能根据语境判断你更想用哪一个词。"]}
{"word":"hassle","summary":{"en":"Hassle means an annoying trouble or extra effort; it can also mean to bother or pressure someone.","zh":"hassle 指“麻烦、费事”，也可作动词表示“烦扰、纠缠、施压”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation, task, or problem that is annoying because it takes extra effort, time, or trouble.","zh":"让人烦的麻烦事；因为需要额外精力、时间或处理而令人恼火的事情。"},"examples":[{"en":"Filling out the paperwork was a real hassle.","zh":"填写这些文件真是个大麻烦。"},{"en":"I don’t want the hassle of changing flights again.","zh":"我不想再折腾改航班的麻烦了。"}]},{"partOfSpeech":"v.","definition":{"en":"To annoy someone or cause them trouble, often by repeatedly asking, pressuring, or bothering them.","zh":"烦扰；找麻烦（常指反复打扰、催促或纠缠某人）。"},"examples":[{"en":"The salesperson kept hassling me to buy the extended warranty.","zh":"推销员一直纠缠我，让我买延长保修。"},{"en":"Don’t hassle her—she’s already stressed.","zh":"别去烦她——她已经很有压力了。"}]}],"synonyms":["trouble","nuisance","inconvenience","bother","harass"],"phonetic":"/ˈhæsəl/","extraExplanation":["“hassle”在美式英语里很常用，语气偏口语，表示“麻烦、折腾、费事”。常见搭配：a hassle（很麻烦）、no hassle / hassle-free（不麻烦/免折腾）、without the hassle of…（省去……的麻烦）。","作为动词时，“hassle”常带有“纠缠、逼迫、打扰”的负面意味，比一般的“ask”更让人不舒服；在公共场合语境中也可指“骚扰”。"]}
{"word":"hassled","summary":{"en":"“Hassled” means bothered or pressured repeatedly; it’s also the past form of “hassle.”","zh":"“hassled”表示被反复打扰/刁难/催逼；也可作动词“hassle”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"bothered, pressured, or annoyed repeatedly (often in an unfair or stressful way).","zh":"（常指以不公平或让人有压力的方式）反复打扰、催逼或惹恼。"},"examples":[{"en":"I got hassled by a stranger on the subway.","zh":"我在地铁上被一个陌生人纠缠/骚扰。"},{"en":"She felt hassled at work because of constant last-minute changes.","zh":"因为不断的临时变动，她在工作中感觉被折腾得很烦/压力很大。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “hassle”: to bother or argue with someone about something small; to harass or give someone a hard time.","zh":"“hassle”的过去式/过去分词：为小事跟人争执、找麻烦；（也可指）骚扰、刁难。"},"examples":[{"en":"The clerk hassled me about my ID even though I had it.","zh":"我明明带了身份证，那位店员还是一直为此刁难我。"},{"en":"We were hassled by security for taking photos.","zh":"我们因为拍照被保安找麻烦了。"},{"en":"Don’t hassle the waiter—they’re doing their best.","zh":"别为难服务员——他们已经尽力了。"}]}],"synonyms":["bothered","harassed","pestered","annoyed","pressured","given a hard time"],"phonetic":"/ˈhæsəld/","extraExplanation":["“hassle”在口语中很常见，语气通常偏负面，强调“让人心烦、很费劲”。“get hassled”常用来表示“遭到纠缠/刁难/骚扰”。","注意语境：在涉及性骚扰或跟踪等更严重情况时，英语更常用“harass”“stalk”等更明确的词；“hassle”有时语气更偏“麻烦、找茬”。"]}
{"word":"hassles","summary":{"en":"“Hassles” most often means annoying little problems; it can also be a verb meaning to bother or pester someone.","zh":"“Hassles”通常指烦人的琐事/麻烦；也可作动词，表示打扰、纠缠或刁难某人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) Small problems or annoyances that take time or effort to deal with.","zh":"（通常用复数）麻烦事；琐事；让人心烦又费时间的小问题。"},"examples":[{"en":"Traveling can be fun, but the hassles of airports can be stressful.","zh":"旅行很有趣，但机场的各种麻烦事会让人压力很大。"},{"en":"I don’t want any hassles—let’s keep the plan simple.","zh":"我不想惹麻烦——我们把计划弄简单点。"}]},{"partOfSpeech":"v.","definition":{"en":"To bother, annoy, or cause repeated trouble to someone; to give someone a hard time.","zh":"打扰；纠缠；刁难；给某人造成反复的麻烦。"},"examples":[{"en":"The salesman kept hassling me even after I said no.","zh":"我都说了不，那个推销员还一直纠缠我。"},{"en":"Don’t hassle your sister—she’s trying to study.","zh":"别去烦你妹妹——她在学习。"}]}],"synonyms":["annoyances","trouble","inconvenience","headaches","pester","bother"],"phonetic":"/ˈhæsəl/","extraExplanation":["“hassle”是比较口语、非正式的词，语气比“problem”更强调“烦人、琐碎、反复”。常见搭配：“a hassle”（很麻烦）、“no hassle”（不麻烦/省事，如no-hassle return 轻松退货）。"]}
{"word":"hasslet","summary":{"en":"Hassle means an annoying trouble or extra effort, or to bother someone repeatedly.","zh":"Hassle 指“麻烦、折腾”，也可作动词表示“烦扰、纠缠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a situation or task that is annoying because it takes extra effort, time, or causes trouble","zh":"麻烦事；令人烦恼、费时费力的事情"},"examples":[{"en":"Getting a visa can be a real hassle.","zh":"办签证可能真是件麻烦事。"},{"en":"It’s not worth the hassle of returning it.","zh":"不值得为退货折腾这么多。"}]},{"partOfSpeech":"v.","definition":{"en":"to repeatedly bother someone, or to cause someone trouble (often by demanding something)","zh":"烦扰；纠缠；给某人找麻烦（常指反复要求、催促）"},"examples":[{"en":"I don’t want to hassle you, but could you help me for five minutes?","zh":"我不想打扰你，但你能帮我五分钟吗？"},{"en":"They kept hassling him for money.","zh":"他们不停地向他要钱、纠缠他。"}]}],"synonyms":["trouble","bother","annoyance","difficulty","harass (stronger/negative)"],"phonetic":"/ˈhæsəl/","extraExplanation":["“hasslet” 通常是 “hassle” 的拼写错误。标准拼写是 hassle。","词语语气偏口语，常用于日常抱怨：a hassle（很麻烦），without the hassle（省去麻烦）。"]}
{"word":"hassling","summary":{"en":"“Hassling” means repeatedly bothering or pressuring someone; it can also mean the act of such annoying pressure.","zh":"“hassling”指反复纠缠、烦扰或施压某人；也可指这种让人烦的纠缠行为。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to repeatedly bother, annoy, or pressure someone, often by asking for something or making complaints","zh":"（反复）纠缠、烦扰或施压某人，常指不断索要、抱怨或催促"},"examples":[{"en":"The salesperson kept hassling me to buy the warranty.","zh":"销售员一直纠缠我，让我买延保。"},{"en":"Stop hassling your sister and let her finish her homework.","zh":"别再烦你妹妹了，让她把作业做完。"},{"en":"He felt hassled by constant emails from work.","zh":"他被工作不断发来的邮件搞得很心烦。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of bothering or pressuring someone repeatedly","zh":"反复纠缠或施压的行为；不断的打扰"},"examples":[{"en":"I don’t want any hassle at the airport, so I’m arriving early.","zh":"我不想在机场遇到麻烦，所以我会早点到。"},{"en":"The customer complained about the hassling from staff.","zh":"顾客抱怨员工一直在纠缠/催促。"}]}],"synonyms":["pestering","badgering","bugging","pressuring","harassing"],"phonetic":"/ˈhæsəlɪŋ/","extraExplanation":["“hassling”是动词“hassle”的现在分词/动名词形式。口语里很常见，语气偏负面，强调“反复、让人烦”。","常见搭配：hassle someone about/for sth（为某事纠缠某人）；get hassled（被骚扰/被找麻烦）；a lot of hassle（很多麻烦、很费劲）。","相关词：harass（更正式、更严重，常含“骚扰/霸凌”的意味）；pester（不断烦扰，多指小事、孩子式纠缠）。"]}
{"word":"hassock","summary":{"en":"A hassock is a small cushion or padded stool used as a footrest or for kneeling, often in a church.","zh":"hassock 指小脚凳/脚垫，也可指教堂里用于跪祷的跪垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, firm cushion or padded stool used as a footrest; also sometimes used for kneeling (especially in church).","zh":"（放脚用的）小脚凳/脚垫；也可指（尤其在教堂里用于跪祷的）跪垫。"},"examples":[{"en":"She put her feet up on the hassock while reading.","zh":"她读书时把脚放在脚凳/脚垫上。"},{"en":"In the chapel, people knelt on a hassock during the prayer.","zh":"在小教堂里，人们祈祷时跪在跪垫上。"}]}],"synonyms":["ottoman","footstool","kneeler"],"phonetic":"/ˈhæsək/","extraExplanation":["“Hassock”在英式与美式英语中都可见，但在日常口语里更常用的是“ottoman（脚凳）”或“footstool（脚凳）”。在宗教语境中，它也常指教堂长椅前用于跪祷的垫子（kneeler）。"]}
{"word":"hassocks","summary":{"en":"Hassocks are small padded footstools/cushions, and the word can also mean a church kneeling cushion.","zh":"hassock 指小软垫/脚踏，也可指教堂里跪祷用的跪垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small padded cushion or low footstool, often used to rest your feet","zh":"（常用来搁脚的）小坐垫；矮脚凳；脚踏"},"examples":[{"en":"She put her feet up on a hassock while reading.","zh":"她一边读书一边把脚搁在脚踏上。"},{"en":"The living room had two armchairs and a matching hassock.","zh":"客厅里有两把扶手椅和一个配套的脚踏。"}]},{"partOfSpeech":"n.","definition":{"en":"a thick cushion used for kneeling, especially in a church","zh":"（尤指教堂里用来跪的）跪垫"},"examples":[{"en":"He knelt on the hassock during the service.","zh":"礼拜时他跪在跪垫上。"},{"en":"Rows of hassocks were set out in front of the pews.","zh":"长椅前面摆放着一排排跪垫。"}]}],"synonyms":["footstool","ottoman","cushion","kneeler"],"phonetic":"/ˈhæsək/","extraExplanation":["“Hassock”在英式英语里较常见；在美式英语中，人们更常说“footstool”或“ottoman”（更像带软垫的小矮凳/脚踏）。","在教堂语境中，“hassock”指跪祷用的厚垫子，常放在长椅（pew）前方；相关动词常用“kneel on a hassock”。"]}
{"word":"hassocky","summary":{"en":"Hassocky means cushion-like or tufted, resembling a hassock (a thick cushion or low footstool).","zh":"hassocky 指“像坐垫/脚凳那样的”，引申为“厚软、垫状、成团簇隆起的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hassock (a thick cushion or low footstool); cushiony, thick, or tufted in appearance.","zh":"像（或类似）坐垫/脚凳（hassock）的；看起来厚软、垫状或有簇状隆起的。"},"examples":[{"en":"The old sofa had a hassocky, overstuffed look.","zh":"那张旧沙发看起来很hassocky（厚软、塞得鼓鼓的）。"},{"en":"The path crossed hassocky tufts of grass and moss.","zh":"小路穿过一丛丛hassocky的草和苔藓（垫状隆起的草团）。"}]}],"synonyms":["cushiony","tufted","padded","hummocky"],"phonetic":"/ˈhæsəki/","extraExplanation":["“hassocky”是比较少见的形容词，来自名词“hassock”（厚坐垫、跪垫或矮脚凳）。在描写自然景观时，它常用来形容地面出现一团团、垫子般隆起的草丛/苔藓（类似“hummocky”那种起伏但更强调“垫状、团簇感”）。","在现代英语中更常见的表达是：tufted（成簇的）、cushiony（像垫子一样软厚的）、hummocky（小丘状起伏的）。"]}
{"word":"hast","summary":{"en":"“Hast” is an archaic form of “have,” used with “thou” (singular “you”).","zh":"“hast”是古体英语中“have”的形式，与“thou”（单数“你”）连用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) second-person singular present of “have”; used with “thou” (meaning “you” singular).","zh":"（古体）“have”的第二人称单数现在时形式；与“thou”（意为单数“你”）连用。"},"examples":[{"en":"Thou hast a kind heart.","zh":"你有一颗善良的心。"},{"en":"Thou hast done well.","zh":"你做得很好。"},{"en":"Thou hast my thanks.","zh":"你有我的感谢（我很感激你）。"}]},{"partOfSpeech":"aux.","definition":{"en":"(Archaic auxiliary) used to form the present perfect with “thou,” like “you have” in modern English.","zh":"（古体助动用法）与“thou”连用构成现在完成时，相当于现代英语里的“you have”。"},"examples":[{"en":"Thou hast seen the truth.","zh":"你已经看见了真相。"},{"en":"Thou hast spoken wisely.","zh":"你已经说得很明智了。"}]}],"synonyms":["have","possess (in meaning)"],"phonetic":"/hæst/","extraExplanation":["“hast”常见于《钦定版圣经》（King James Bible）和莎士比亚作品等早期现代英语中；现代英语里通常用“you have”。","提示：古体里“thou hast”（你有/你已经……）对应现代英语“you have”；“he hath”对应现代英语“he has”。"]}
{"word":"hasta","summary":{"en":"Hasta is a Spanish word used in English mainly as a casual goodbye (“see you later”) or to mean “until” in Spanish-flavored contexts.","zh":"Hasta 是西班牙语词，在英语中多用作随意的告别语（“回头见”），也可在带西语风格的语境中表示“直到”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Informal, from Spanish) Goodbye; see you later.","zh":"（非正式，源自西班牙语）再见；回头见。"},"examples":[{"en":"Hasta! I’ll call you tomorrow.","zh":"Hasta！我明天打给你。"},{"en":"He waved and said, “Hasta, guys.”","zh":"他挥挥手说：“Hasta，伙计们。”"}]},{"partOfSpeech":"prep.","definition":{"en":"(From Spanish, used in English contexts) Until; up to (a time or limit).","zh":"（源自西班牙语，在英语语境中使用）直到；到……为止（时间或界限）。"},"examples":[{"en":"We’re open hasta midnight (used as a Spanish-flavored sign or message).","zh":"我们营业到午夜（常见于带西语风格的招牌或信息）。"},{"en":"She said she’d be busy hasta Friday.","zh":"她说她会忙到周五。"}]}],"synonyms":["bye","goodbye","see you later","until"],"phonetic":"/ˈhɑstə/","extraExplanation":["“Hasta”是西班牙语里非常常见的词，基本意思是“直到”。在英语里单独用“hasta”当“再见/回头见”时，多带有一种轻松的、西语风格的口吻。","最出名的固定搭配是“hasta la vista”（意为“再见”），因电影《终结者2：审判日》（Terminator 2）里“Hasta la vista, baby”这句台词而在英语流行文化中广为人知。"]}
{"word":"hastate","summary":{"en":"Hastate means spear-shaped (common in botany), and it can also refer to a Roman infantry soldier (usually plural: hastati).","zh":"hastate 可指“矛状的”（常见于植物学），也可指古罗马步兵士兵（通常用复数 hastati）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Spear-shaped; shaped like a spearhead (often used in biology/botany to describe leaves or parts of an organism).","zh":"矛状的；呈矛头形的（常用于生物学/植物学描述叶片或器官形状）。"},"examples":[{"en":"The plant has hastate leaves with two small lobes near the base.","zh":"这种植物的叶子呈矛状，叶基部附近有两个小裂片。"},{"en":"Under the microscope, the cells formed a hastate outline.","zh":"在显微镜下，这些细胞呈现矛状轮廓。"}]},{"partOfSpeech":"n.","definition":{"en":"A soldier of the Roman Republic’s heavy infantry class (usually seen in the plural: hastati).","zh":"（古罗马共和国）重步兵的一类士兵（通常用复数 hastati）。"},"examples":[{"en":"In the battle line, the hastati stood in the front ranks.","zh":"在战阵中，hastati 站在前排。"},{"en":"The general ordered the hastati to advance first.","zh":"将军命令 hastati 率先推进。"}]}],"synonyms":["spear-shaped","lance-shaped"],"phonetic":"/ˈhæsteɪt/","extraExplanation":["“hastate”来自拉丁语 hasta（矛）。在植物学里常见的相关词还有 sagittate（箭形）等，都是用“武器形状”来帮助描述叶形。","历史上罗马军队的 hastati（哈斯塔提）通常指较年轻的前线重步兵；单数可写作 hastatus，但英语里更常直接用复数 hastati 来泛指这一兵种。"]}
{"word":"hastated","summary":{"en":"“Hastated” is probably a misspelling of “hesitated,” meaning you paused because you were unsure.","zh":"“hastated”很可能是“hesitated”的拼写错误，意思是因不确定而停顿、犹豫。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Likely intended: “hesitated”) to pause before doing or saying something because you feel uncertain, nervous, or need more time to decide.","zh":"（可能想写：hesitated）因不确定、紧张或需要时间决定而在做或说之前犹豫、迟疑。"},"examples":[{"en":"She hesitated before answering the question.","zh":"她在回答问题前犹豫了一下。"},{"en":"I hesitated to call him because I didn’t want to bother him.","zh":"我犹豫要不要打给他，因为我不想打扰他。"}]},{"partOfSpeech":"vt.","definition":{"en":"to be slow to act or speak; to hold back for a moment (sometimes used with “to + verb”).","zh":"行动或开口较慢；稍微退缩、迟缓（常与“to + 动词”搭配）。"},"examples":[{"en":"Don’t hesitate to ask for help if you need it.","zh":"如果你需要帮助，别犹豫，尽管开口。"},{"en":"He didn’t hesitate—he apologized right away.","zh":"他毫不犹豫——立刻道歉了。"}]}],"synonyms":["pause","waver","delay","hold back","be unsure"],"phonetic":"/ˈhɛzəˌteɪt/","extraExplanation":["“hastated”不是常见英文单词，最接近、最常见的可能是拼错了“hesitated”（hesitate 的过去式/过去分词）。正确拼写：hesitate / hesitated。","常见搭配：hesitate to do sth（犹豫做某事）；without hesitation（毫不犹豫）；momentary hesitation（片刻犹豫）。","语气提示：在礼貌表达里，“Don’t hesitate to…”很常用，意思是“随时……/尽管……”，语气友好而正式。"]}
{"word":"hastately","summary":{"en":"“Hastately” isn’t standard; you probably mean “hastily” (= quickly, often carelessly).","zh":"“hastately”不是标准用法；你多半想写“hastily”（匆忙地，常带不够谨慎之意）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard/misspelling) Not a standard English word; it is usually a misspelling of “hastily,” meaning “quickly and often without enough care or planning.”","zh":"（非标准/拼写错误）不是标准英语单词；通常是把“hastily”拼错了，意思是“匆忙地，往往缺乏足够的谨慎或计划”。"},"examples":[{"en":"Incorrect: He wrote the email hastately and forgot the attachment.","zh":"错误：他把邮件写得很hastately，结果忘了添加附件。"},{"en":"Correct: He wrote the email hastily and forgot the attachment.","zh":"正确：他匆忙写了邮件，结果忘了添加附件。"}]},{"partOfSpeech":"n.","definition":{"en":"If you meant “haste” (noun): the state of doing something quickly, often too quickly.","zh":"如果你想写的是“haste”（名词）：匆忙；做事很快（常常快过头）。"},"examples":[{"en":"In her haste, she left her keys inside the car.","zh":"她一着急，把钥匙落在车里了。"},{"en":"There’s no need for haste.","zh":"没必要这么匆忙。"}]}],"synonyms":["hastily","quickly","rapidly","in a hurry","recklessly (in some contexts)"],"phonetic":"/ˈheɪstəli/","extraExplanation":["“hastily”来自形容词“hasty”（匆忙的）+ 副词后缀“-ly”。写作时常见拼写混淆：把“hastily”误写成“hastately”。正式写作建议用“hastily”。"]}
{"word":"hastati","summary":{"en":"Hastati were the front-line, younger heavy infantry in a Roman Republic legion.","zh":"Hastati 是罗马共和国军团中位于前线、较年轻的重装步兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Rome) the hastati: young or less-experienced heavy infantry soldiers who formed the front line of a Roman legion in the early/middle Republic.","zh":"（古罗马）哈斯塔蒂：罗马共和国早期/中期军团中较年轻或经验较少的重装步兵，通常编成军团的第一线。"},"examples":[{"en":"In the Roman battle line, the hastati stood in front of the principes.","zh":"在罗马的战斗队列中，hastati 站在 principes（第二线）前面。"},{"en":"If the hastati failed to break the enemy, the next line advanced to continue the fight.","zh":"如果 hastati 未能击溃敌军，后方的第二线就会推进接战。"}]}],"synonyms":["Roman front-line infantry","hastatus (singular)"],"phonetic":"/hæˈsteɪtaɪ/","extraExplanation":["“hastati”是拉丁语复数形式（单数：hastatus）。在英文历史写作中常直接使用该拉丁词，指共和国时期“分队制（manipular）军团”三线之一：hastati（前线）—principes（中线）—triarii（后线）。","名称与拉丁语“hasta”（长矛）有关；早期可能与持矛相关，但在后来的描述中他们常配备投枪（pilum）与短剑（gladius）。"]}
{"word":"hastato","summary":{"en":"“Hastato” is a rare form meaning “hastate”: spear-shaped, especially describing leaves in botany.","zh":"“hastato”是较少见的写法，意思同“hastate”：矛状的，常用于植物学描述叶形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare in modern English) spear-shaped; having a pointed central lobe with two smaller lobes (or “ears”) at the base, like a spearhead. Often used in botany; more commonly written as “hastate.”","zh":"（现代英语中较少见）矛状的；形状像矛头：中间尖、基部两侧有小裂片（像两只“耳朵”）。常见于植物学中；更常写作“hastate”。"},"examples":[{"en":"The field guide describes the plant as having hastato (hastate) leaves.","zh":"这本野外指南把这种植物描述为有矛状（hastate）的叶子。"},{"en":"Look for hastato leaf bases with two small lobes pointing outward.","zh":"注意观察叶基部是否呈矛状：两侧有小裂片向外伸出。"}]}],"synonyms":["hastate","spear-shaped","lance-shaped"],"phonetic":"ˈhæsteɪt","extraExplanation":["“hastato”在英语里非常少见，很多时候是把更常用的术语“hastate”拼写成了“hastato”，或是受西班牙语/意大利语等罗曼语影响的写法。","词源来自拉丁语“hasta”（长矛）。在植物形态学里常用来描述叶形。","易混词：sagittate（箭形）也有“基部两裂片”，但通常两裂片更明显地向下（或更贴着叶柄方向）延伸；hastate（矛形）则更像“向外张开”的矛头。"]}
{"word":"hastatolanceolate","summary":{"en":"A botanical adjective for leaves shaped between hastate and lanceolate—spear-like with small basal lobes.","zh":"植物学形容词，指叶形介于戟形与披针形之间：矛头状并带轻微的基部裂片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Describing a leaf (or similar plant part) whose shape is between *hastate* and *lanceolate*: generally spear-like and tapering, with small basal lobes or “ears” that may point outward.","zh":"（植物学）形容叶片（或类似部位）的形状介于“戟形叶（hastate）”与“披针形叶（lanceolate）”之间：整体像矛头、逐渐变尖，叶基部常有小裂片/“耳状”突起，可能向外伸出。"},"examples":[{"en":"The field guide describes the plant as having hastatolanceolate leaves with pointed tips.","zh":"野外图鉴描述这种植物的叶为“戟形至披针形”，叶尖明显变尖。"},{"en":"Look for hastatolanceolate blades: long and narrow, but with slight lobes near the base.","zh":"可以观察“戟形至披针形”的叶片：细长狭窄，但叶基附近有轻微的裂片。"}]}],"synonyms":["hastato-lanceolate","hastate-lanceolate","hastate to lanceolate","spear-shaped (approx.)"],"phonetic":"/ˌhæstətoʊˈlænsiəleɪt/","extraExplanation":["这个词常见写法是 **hastato-lanceolate**（中间带连字符），也有人写作 **hastatolanceolate**。它多用于植物形态描述（如植物志、鉴定手册），日常英语里很少见。","**lanceolate（披针形）**通常指叶片狭长、最宽处在中部或稍偏下、两端渐尖；**hastate（戟形）**则更强调叶基部有两侧向外伸出的裂片/角（像戟的护手）。“hastato- + lanceolate”表示兼具两者特征或介于两者之间。"]}
{"word":"hastatosagittate","summary":{"en":"A botanical adjective meaning a leaf shape intermediate between hastate and sagittate (spear/arrow-shaped with basal lobes).","zh":"植物学形容词：指叶形介于戟形与箭形之间（矛/箭状，基部有裂片）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a shape between hastate and sagittate: a leaf or blade that is roughly spear/arrow-shaped with two spreading lobes near the base that point somewhat outward and somewhat backward.","zh":"（植物学）介于“戟形（hastate）”与“箭形（sagittate）”之间的形状：叶片（或片状结构）大致呈矛/箭状，基部有两侧裂片，方向部分外展、部分后指。"},"examples":[{"en":"In the field guide, the plant is described as having hastatosagittate leaves with small basal lobes.","zh":"在野外图鉴中，这种植物被描述为具有“戟箭形”的叶片，基部有较小的侧裂片。"},{"en":"Look at the leaf base: the lobes are not fully backward-pointing, so it’s closer to hastatosagittate than purely sagittate.","zh":"观察叶基：裂片并非完全向后指，所以更接近“戟箭形”，而不是纯粹的“箭形”。"}]}],"synonyms":["hastato-sagittate","subhastate (approx.)","subsagittate (approx.)"],"phonetic":"/ˌhæs.tə.toʊˈsædʒ.ɪ.teɪt/","extraExplanation":["这是一个非常专门的植物形态学用词，常见写法也会是 **hastato-sagittate**（带连字符）。","词根来自拉丁语：**hasta**（矛）→ *hastate*（戟形/矛形），**sagitta**（箭）→ *sagittate*（箭形）。它用来表达“介于两者之间”的叶形特征。","区分小提示：*hastate* 的基部裂片更偏“向外张开”；*sagittate* 的裂片更偏“向后（朝叶柄方向）指”。*hastatosagittate* 表示两种趋势都存在、介于其间。"]}
{"word":"haste","summary":{"en":"Haste means rushing or acting with urgency, often so fast that mistakes happen.","zh":"Haste 指“匆忙、急促”，常暗示因太急而容易出错。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Speed or urgency in doing something, often too quickly and with too little care.","zh":"匆忙；急促（常含“太快而不够谨慎”的意思）。"},"examples":[{"en":"In her haste, she forgot her keys.","zh":"她一匆忙，就忘了带钥匙。"},{"en":"Haste makes waste.","zh":"欲速则不达（/匆忙反而坏事）。"}]}],"synonyms":["hurry","rush","urgency"],"phonetic":"/heɪst/","extraExplanation":["“haste”通常带有轻微的负面含义：不仅是“快”，还暗示因为急而容易出错。若只是中性地表示“迅速”，常用“speed”或“quickness”。","常见搭配：in haste（匆忙地）、make haste（赶紧）、with haste（急忙地，较正式）。","文学与名句中常见：谚语“Haste makes waste”强调做事太急会造成浪费或返工。"]}
{"word":"hasted","summary":{"en":"“Hasted” means “hurried” (the past form of “haste”), but it’s uncommon in modern English.","zh":"“hasted”表示“匆忙、赶紧”（是“haste”的过去式/过去分词），但在现代英语中不常用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “haste”) to do something quickly or in a hurry.","zh":"（“haste”的过去式/过去分词）匆忙地做某事；赶紧做。"},"examples":[{"en":"She hasted to finish her homework before dinner.","zh":"她赶在晚饭前匆忙把作业做完。"},{"en":"He hasted out of the room when he heard the alarm.","zh":"他一听到警报就匆匆离开了房间。"}]}],"synonyms":["hurried","rushed","hastened"],"phonetic":"/ˈheɪstɪd/","extraExplanation":["“hasted”在现代英语中比较少见，更常用的是“hurried”或“hastened”。在较老的文学或较正式的文体里可能会看到“hasted”。","注意不要和“hastened”（更常见，意为“加快；促进”）混淆：hasten = make something happen sooner / speed up。"]}
{"word":"hasteful","summary":{"en":"Hasteful means “hasty”: done too quickly and without enough thought.","zh":"hasteful 意为“仓促的/轻率的”，做得太快、欠缺思考（更常用 hasty）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Done or said too quickly, often without enough thought; hurried and sometimes careless.","zh":"做得或说得太快、欠缺思考的；仓促的（有时显得草率）。"},"examples":[{"en":"It was a hasteful decision, and she regretted it later.","zh":"那是个仓促的决定，她后来后悔了。"},{"en":"Don’t be hasteful with your words when you’re angry.","zh":"生气时别急着说话（别说得太快、太冲动）。"}]}],"synonyms":["hasty","hurried","rash","impulsive"],"phonetic":"/ˈheɪstfəl/","extraExplanation":["“hasteful”在现代英语中不算常用，更常见的是“hasty”。它们意思很接近：都表示“仓促的、轻率的”。在写作或正式表达中，用“hasty decision / hasty conclusion”更自然。"]}
{"word":"hastefully","summary":{"en":"“Hastefully” means “in a hurried, often careless way.”","zh":"“hastefully”表示“匆忙地、仓促地（常暗示不够谨慎）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hurried way; quickly and often without enough care or planning.","zh":"匆忙地；仓促地（常带有不够周全、欠考虑之意）。"},"examples":[{"en":"She hastily packed her bag and ran out the door.","zh":"她匆忙收拾好包就冲出了门。"},{"en":"Don’t make hastily decisions; take a moment to think.","zh":"不要仓促做决定；先花点时间想一想。"},{"en":"The email was hastily written and full of mistakes.","zh":"那封邮件写得很仓促，错误很多。"}]}],"synonyms":["hastily","hurriedly","in a rush","in haste"],"phonetic":"/ˈheɪstfəli/","extraExplanation":["“Hastefully”来自名词“haste”（匆忙）加副词后缀“-fully”。日常英语里更常用“hastily”，意思几乎一样；“hastefully”相对少见，显得更书面或不太自然。","常见搭配：hastily/hastefully + made decision（仓促的决定）、written note/email（匆忙写的便条/邮件）、leave/exit（匆忙离开）。","对比：quickly（快，侧重速度，中性） vs. hastily/hastefully（匆忙，常暗示不够谨慎，带轻微负面评价）。"]}
{"word":"hasteless","summary":{"en":"Hasteless means unhurried or not rushed.","zh":"hasteless 指“不匆忙、从容不迫”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"done without haste; unhurried; calm and not rushed.","zh":"不匆忙的；从容的；不赶时间的。"},"examples":[{"en":"She took a hasteless walk through the park and enjoyed the quiet.","zh":"她从容地在公园里散步，享受着宁静。"},{"en":"The doctor spoke in a hasteless way that made everyone feel at ease.","zh":"医生说话不疾不徐，让大家都感到安心。"},{"en":"We made a hasteless decision after considering all the options.","zh":"我们在仔细权衡所有选择后，做出了不急躁的决定。"}]}],"synonyms":["unhurried","leisurely","unrushed","deliberate","measured"],"phonetic":"/ˈheɪstləs/","extraExplanation":["“hasteless”在现代英语中比较少见，更多时候会用更常见的同义词，如“unhurried”“leisurely”“calm”“unrushed”。在文学或较正式的描写中，“hasteless”能带出一种沉静、克制的节奏感。"]}
{"word":"hastelessness","summary":{"en":"Hastelessness means a lack of taste/flavor (blandness), and by extension a lack of liveliness or impact (dullness).","zh":"hastelessness 指“无味、寡淡”，也可引申为“乏味、缺少感染力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having no taste or flavor; blandness.","zh":"没有味道、缺乏风味；寡淡。"},"examples":[{"en":"The soup’s hastelessness made everyone reach for salt.","zh":"这汤太寡淡了，大家都去拿盐。"},{"en":"He complained about the hastelessness of the hospital food.","zh":"他抱怨医院的食物没有味道。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of lacking style, emotional impact, or excitement; dullness.","zh":"缺乏格调或感染力；乏味、平淡。"},"examples":[{"en":"The speech had a kind of hastelessness that made it hard to stay focused.","zh":"这场演讲有种乏味感，让人很难集中注意力。"},{"en":"Critics noted the hastelessness of the film’s dialogue.","zh":"评论家指出这部电影的对白很平淡无味。"}]}],"synonyms":["blandness","tastelessness","insipidity","dullness","flatness"],"phonetic":"/ˈheɪstləsnəs/","extraExplanation":["“hastelessness”来自形容词“hasteless”（无味的、平淡的）+ 名词后缀“-ness”。注意它比较少见；更常用的表达是“tastelessness / blandness”（指食物没味道）或“dullness / flatness”（指内容乏味）。","别和“tactless”（不得体的、没分寸的）混淆：两者拼写相近，但意思不同。"]}
{"word":"hasten","summary":{"en":"Hasten means to hurry or to make something happen sooner, and it often sounds more formal than “hurry.”","zh":"Hasten 表示“赶快”或“使某事更快发生”，语气通常比 hurry 更正式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do something more quickly; to speed up or make something happen sooner","zh":"加快；催促；使（事情）更快发生"},"examples":[{"en":"She hastened her steps when she realized she was late.","zh":"她意识到自己迟到了，就加快了脚步。"},{"en":"The new evidence hastened the decision to reopen the case.","zh":"新的证据加速了重新调查此案的决定。"}]},{"partOfSpeech":"vi.","definition":{"en":"to go quickly; to hurry (often used in more formal or literary writing)","zh":"赶紧去；匆忙前往（较正式或文学用法）"},"examples":[{"en":"He hastened to the door to greet his guests.","zh":"他赶紧走到门口去迎接客人。"},{"en":"They hastened away before the storm grew worse.","zh":"暴风雨变得更猛烈之前，他们匆匆离开了。"}]}],"synonyms":["hurry","rush","speed up","accelerate","expedite"],"phonetic":"/ˈheɪsən/","extraExplanation":["“hasten”语气比“hurry”更正式一些，常见于新闻、演讲或文学描写中：既可以表示“自己赶快做”，也可以表示“让某事更快发生”（如：hasten a process/decision）。","常见搭配：hasten to + 动词（赶紧去做某事）；hasten + 名词（加速某事，例如 hasten recovery/peace/the end）。"]}
{"word":"hastened","summary":{"en":"“Hastened” means “went faster” or “made something happen sooner.”","zh":"“hastened”表示“更快地行动/前进”，或“使某事更早发生”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Moved or acted quickly; sped up; did something sooner than planned (past tense/past participle of “hasten”).","zh":"（hasten 的过去式/过去分词）加快；赶紧做；使某事更早发生。"},"examples":[{"en":"She hastened to finish her homework before dinner.","zh":"她赶在晚饭前赶紧把作业做完。"},{"en":"News of the storm hastened our decision to leave early.","zh":"暴风雨的消息促使我们决定提前离开。"},{"en":"He hastened down the street to catch the last bus.","zh":"他急匆匆地沿街跑去赶末班车。"}]}],"synonyms":["hurried","rushed","sped up","accelerated","quickened"],"phonetic":"ˈheɪsənd","extraExplanation":["“hastened”比“hurried”更正式一些，常见于新闻、书面语或文学语境。","常见搭配：hasten to do（赶紧做某事）；hasten back/home（赶回去/赶回家）；hasten the process/decision（加速进程/促成决定）。","在表达“促使某事更快发生”时，主语常是事件或信息：The announcement hastened changes（该公告加速了变革）。"]}
{"word":"hastener","summary":{"en":"A hastener is someone or something that speeds up an event or process.","zh":"hastener 指促使事件或过程加快发生的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that makes something happen sooner; something that speeds up a process","zh":"促使某事更快发生的人或事物；加速因素"},"examples":[{"en":"Good communication can be a hastener of trust in a team.","zh":"良好的沟通可以促进团队中的信任更快建立。"},{"en":"Warm weather is often a hastener of plant growth.","zh":"温暖的天气常常会促进植物更快生长。"}]}],"synonyms":["accelerator","catalyst","stimulus","promoter","speed-up"],"phonetic":"/ˈheɪsənər/","extraExplanation":["“hastener”来自动词“hasten（加速、催促）”加上表示“……的人/物”的后缀“-er”。在现代英语里它比较少见，日常表达更常用“accelerator（加速器/促进因素）”、“catalyst（催化因素）”、“speed-up（加速措施）”。","这个词常用于较正式的写作或修辞场景，用来强调某个因素“让事情更快发生”，而不一定指真实的机器。"]}
{"word":"hasteners","summary":{"en":"“Hasteners” means people or things that make something happen faster (plural of hastener).","zh":"“Hasteners”指让某事更快发生的人或事物（hastener的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that makes something happen sooner; someone or something that speeds up a process","zh":"使某事更快发生的人或事物；加速某个过程的人或事物"},"examples":[{"en":"Some medicines are used as labor hasteners in hospitals, but only under careful medical supervision.","zh":"有些药物在医院里会被用作“催产加速剂”，但必须在严格的医疗监护下使用。"},{"en":"Better communication can be a hastener of trust in a team.","zh":"更好的沟通可以成为团队建立信任的“加速器”。"}]}],"synonyms":["accelerators","catalysts","speeders","promoters"],"phonetic":"/ˈheɪsənər/","extraExplanation":["“hasteners”是相对少见的词，更常见的是动词hasten（加速、催促）或名词haste（匆忙）。如果你想表达“扣件/紧固件”（比如螺丝、拉链、扣子），更可能是fasteners（注意首字母是f）。","构词上，hastener = hasten + -er（表示“做某事的人/物”），hasteners是其复数形式。"]}
{"word":"hastening","summary":{"en":"Hastening means moving quickly or causing something to happen sooner.","zh":"hastening 指“加快行动”或“促使某事更早发生”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"moving or acting quickly; speeding something up","zh":"加快动作；迅速进行；（使）加速"},"examples":[{"en":"She kept hastening down the hallway because she was late.","zh":"她因为要迟到了，一直加快脚步沿着走廊走。"},{"en":"The news is hastening their decision to leave.","zh":"这个消息正在促使他们更快作出离开的决定。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of making something happen sooner","zh":"（使某事更早发生的）加速、促成；赶紧"},"examples":[{"en":"In their hastening to finish, they forgot to check the details.","zh":"他们急着完成，结果忘了检查细节。"},{"en":"There was no need for such hastening; the deadline was next week.","zh":"没必要这么赶，截止日期是下周。"}]}],"synonyms":["hurrying","rushing","speeding up","accelerating","quickening"],"phonetic":"/ˈheɪsənɪŋ/","extraExplanation":["“hastening”常见于较正式的书面语或叙述性语境（如新闻、文学描写），日常口语里更常说“hurrying / rushing / speeding up”。","固定搭配：in one’s haste（因匆忙而……），例如“In his haste, he left his phone behind.”（他一匆忙把手机落下了。）"]}
{"word":"hastens","summary":{"en":"“Hastens” means “hurries” or “speeds up” (third-person singular of “hasten”).","zh":"“hastens”意为“赶紧、加速”（hasten 的第三人称单数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “hasten”) to do something more quickly; to speed up or hurry.","zh":"（hasten 的第三人称单数）加快；催促；使更快完成。"},"examples":[{"en":"She hastens to finish her homework before dinner.","zh":"她赶紧在晚饭前把作业写完。"},{"en":"The new evidence hastens the investigation.","zh":"新的证据加快了调查进程。"}]},{"partOfSpeech":"v.","definition":{"en":"to go somewhere quickly, often because it feels urgent (more formal than “hurry”).","zh":"（较正式）匆匆前往某处，常带有紧迫感（比 hurry 更正式）。"},"examples":[{"en":"He hastens to the station when he hears the train is leaving.","zh":"他一听说火车要开了就匆匆赶往车站。"},{"en":"Don’t hasten to judge people you don’t know.","zh":"不要急于评判你不认识的人。"}]}],"synonyms":["hurries","speeds up","quickens","rushes","accelerates"],"phonetic":"/ˈheɪsənz/","extraExplanation":["“hasten”比“hurry”更书面、更正式，常见于新闻报道、演讲或文学语境。","常见搭配：hasten to do sth（赶紧去做某事）；hasten the process/decision/end（加速某个过程/决定/结束）。"]}
{"word":"hasteproof","summary":{"en":"Hasteproof means designed to reduce or prevent errors when people are rushing.","zh":"Hasteproof 指“为防止赶时间时出错而设计的；不易因匆忙而犯错的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent mistakes caused by rushing; hard to do wrong even when done quickly.","zh":"为防止匆忙导致的错误而设计的；即使赶时间也不容易做错的。"},"examples":[{"en":"The checklist is hasteproof, so new staff won’t miss important steps.","zh":"这份清单很“防急误”，所以新员工不容易漏掉关键步骤。"},{"en":"We need a hasteproof process for sending invoices, especially at the end of the month.","zh":"我们需要一个“防赶工出错”的开票流程，尤其是在月底。"},{"en":"The app’s confirmation screen makes accidental deletion much more hasteproof.","zh":"这个应用的确认页面让误删变得更“防手快”。"}]}],"synonyms":["foolproof","error-proof","mistake-proof","fail-safe"],"phonetic":"/ˈheɪstˌpruːf/","extraExplanation":["“hasteproof”更常见的写法是带连字符的“haste-proof”。它不是特别标准的词典词，更多出现在工程、质量管理、流程设计等语境中，意思接近“防呆 / 防错（poka-yoke）”。","构词法上是“haste（匆忙）+ proof（防……的）”，类似“waterproof（防水）”“foolproof（不易出错的）”。日常交流里也可以用更常见的说法：error-proof / foolproof / mistake-proof。"]}
{"word":"haster","summary":{"en":"“Haster” is usually a surname, not a common English vocabulary word; very rarely it can mean “a person who hurries.”","zh":"“Haster”通常是姓氏，并非常见词汇；极少情况下可指“匆忙的人/急性子”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a common standard English word; most often seen as a surname (a family name).","zh":"不是常见的标准英语词；最常见的用法是作姓氏（家族姓）。"},"examples":[{"en":"Dennis Hastert served as Speaker of the U.S. House of Representatives.","zh":"丹尼斯·哈斯特（Dennis Hastert）曾任美国众议院议长。"},{"en":"I saw the name “Haster” in the credits, but it isn’t a regular vocabulary word.","zh":"我在片尾字幕里看到“Haster”这个名字，但它不是常规词汇。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare/archaic) A person who hurries; someone who acts in haste.","zh":"（非常少见/古旧）匆忙的人；做事急躁的人。"},"examples":[{"en":"Don’t be a haster—take a moment to think.","zh":"别做个急性子——先花点时间想一想。"}]}],"synonyms":["(if you mean the idea) hurried person","someone in a hurry","rusher"],"phonetic":"/ˈhæstər/","extraExplanation":["“haster”在现代英语里并不常用。如果你想表达“匆忙/急忙”，更自然的词是：\n- haste（名词：匆忙）\n- hurry（动词/名词：赶忙）\n- hasty（形容词：草率的、匆忙的）\n- hastier（hasty 的比较级：更草率/更匆忙）\n如果你告诉我你看到“haster”的句子或场景，我可以帮你判断它到底是人名还是拼写/词形问题。"]}
{"word":"hastes","summary":{"en":"“Hastes” most commonly appears as the plural of “haste” (instances of rushing), and more rarely as an archaic verb meaning “you hurry” (with “thou”).","zh":"“hastes”最常见是名词“haste（匆忙）”的复数（多次匆忙/赶时间）；较少见的是古体动词形式，表示“你急忙”，常与“thou”连用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) hurried actions or a feeling of urgency; instances of rushing.","zh":"（复数）匆忙的行动或紧迫感；多次“赶时间/急忙”的情况。"},"examples":[{"en":"In their hastes to leave, they forgot the keys.","zh":"他们急着离开时，把钥匙忘了。"},{"en":"He made mistakes in his hastes and later apologized.","zh":"他因一时匆忙犯了错，后来道了歉。"}]},{"partOfSpeech":"v.","definition":{"en":"(Archaic/poetic) “you hurry”; second-person singular present form of “haste,” used with “thou.”","zh":"（古体/诗歌用法）“你赶快/你急忙”；动词“haste”的第二人称单数现在式，常与“thou（你）”连用。"},"examples":[{"en":"Thou hastes to judgment without hearing the full story.","zh":"你未听完整个故事就急于下结论。"},{"en":"Why hastes thou so, when time is on our side?","zh":"既然时间站在我们这边，你为何如此匆忙？"}]}],"synonyms":["rush","hurry","urgency","haste"],"phonetic":"/heɪsts/","extraExplanation":["“hastes”在现代英语里最常见的来源其实是名词“haste（匆忙）”的复数，但这个复数形式本身并不常用；日常表达更常说：in haste（匆忙地）、make haste（赶快）、haste makes waste（欲速则不达/忙中出错）。","作为动词的“hastes”属于古英语/早期现代英语的语法风格，常与“thou（你）”搭配：thou hastes（你急忙）。现代英语一般用：you hurry / you rush。","如果你是在诗歌、圣经体或古典文学中看到“hastes”，通常是在营造庄重或古雅的语气。"]}
{"word":"hastier","summary":{"en":"“Hastier” means “more hasty”: more rushed, or more impulsive/too quick to judge.","zh":"“hastier”意为“更匆忙/更草率的；更冲动、更快下结论的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “hasty”: more rushed or done with too little time or care.","zh":"“hasty”的比较级：更匆忙的；因为时间不足或不够仔细而做得更草率的。"},"examples":[{"en":"Today’s decision felt hastier than yesterday’s.","zh":"今天的决定比昨天更仓促。"},{"en":"He wrote a hastier email and forgot to attach the file.","zh":"他写了一封更匆忙的邮件，结果忘了添加附件。"}]},{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “hasty”: more impulsive or quick to judge, often leading to mistakes.","zh":"“hasty”的比较级：更冲动的；更快下结论的（常会导致错误）。"},"examples":[{"en":"She gave a hastier answer and later realized it was wrong.","zh":"她给出了一个更草率的回答，后来才发现是错的。"},{"en":"Try not to be hastier with people’s feelings.","zh":"尽量不要在别人的感受上更武断、更冲动。"}]}],"synonyms":["more rushed","more hurried","more rash","more impulsive"],"phonetic":"/ˈheɪstiər/","extraExplanation":["“hastier”是规则比较级：hasty → hastier（把y变成i再加-er）。最高级是hastiest。","“hastier”既可以表示“更赶时间/更匆忙”（强调速度），也可以表示“更草率/更冲动”（强调判断不够慎重）；语境决定偏哪一层意思。"]}
{"word":"hastiest","summary":{"en":"“Hastiest” means the most rushed or fastest, often implying too little careful thought.","zh":"“hastiest”表示“最匆忙/最快”，常含“过于仓促、考虑不周”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “hasty”: the fastest or most rushed; done with the least delay (often without enough thought).","zh":"“hasty”的最高级：最快的、最匆忙的；（常指）仓促的、欠考虑的。"},"examples":[{"en":"This is the hastiest route to the station, but it can be crowded.","zh":"这是去车站最快的路线，但可能会很拥挤。"},{"en":"He made the hastiest decision and regretted it later.","zh":"他做了一个最仓促的决定，后来后悔了。"}]}],"synonyms":["quickest","fastest","most hurried","most rushed","most impulsive"],"phonetic":"/ˈheɪstiɪst/","extraExplanation":["“hastiest”是规则变化：hasty → hastier → hastiest。注意拼写：以辅音字母+y结尾时，y变成i再加-est。","语气上，“hastiest”常带一点负面评价（强调“太急、没想清楚”），而“fastest/quickest”更中性，强调速度本身。"]}
{"word":"hastif","summary":{"en":"“Hastif” is not a standard English word; it is probably a misspelling of “hasty” or “hastily.”","zh":"“hastif”不是标准英语单词；很可能是“hasty”或“hastily”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “hasty” (quick and often careless) or “hastily” (in a hurried way).","zh":"不是标准英语单词。很可能是“hasty”（匆忙的，常带有草率之意）或“hastily”（匆忙地）的拼写错误。"},"examples":[{"en":"I can’t find “hastif” in an English dictionary—did you mean “hasty”?","zh":"我在英语词典里找不到“hastif”——你是不是想写“hasty”？"},{"en":"A hasty decision can cause problems later.","zh":"草率的决定可能会在之后引发问题。"},{"en":"He left hastily when he heard the news.","zh":"他听到消息后匆忙离开了。"}]}],"synonyms":["hasty","hastily","hurried","rushed"],"extraExplanation":["“hasty”通常带一点负面含义：不仅是“快”，还可能是“没想清楚就做”。如果你想表达中性或正面的“迅速”，也可以考虑用“quick/rapid/prompt”。","如果你告诉我你想表达的中文意思（例如“匆忙的/草率的/急忙地”），我可以帮你选最合适的英文词并给更多例句。"]}
{"word":"hastifly","summary":{"en":"“Hastily” means doing something in a hurry, often without enough care or thought.","zh":"“Hastily”表示匆忙地做某事，常暗含考虑不周或不够谨慎。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hurry; quickly and often without enough care or planning.","zh":"匆忙地；急急忙忙地（常带有“考虑不周/不够谨慎”的含义）。"},"examples":[{"en":"He hastily packed his bag and ran to catch the train.","zh":"他匆忙收拾好包，跑去赶火车。"},{"en":"Don’t make a hastily chosen decision—you may regret it later.","zh":"不要仓促做决定——你之后可能会后悔。"},{"en":"She wrote a hastily worded email and then apologized.","zh":"她匆匆写了一封措辞不太妥当的邮件，后来又道歉了。"}]}],"synonyms":["quickly","hurriedly","in a hurry","rashly"],"phonetic":"/ˈheɪstəli/","extraExplanation":["你写的“hastifly”通常是拼写错误；最常见的正确拼写是 **hastily**（匆忙地）。","词源上与 **haste**（匆忙）同根；**hastily** 往往暗示“快但不够周全”，不像 **quickly** 那么中性。","常见搭配：**hastily made decision**（仓促的决定）、**hastily written note**（匆匆写的便条）。"]}
{"word":"hastifness","summary":{"en":"Hastiness means acting or deciding too quickly, often without enough care.","zh":"Hastiness 指做事或下决定太快，常常不够谨慎，容易出错。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of doing something too quickly, often without enough care or thought","zh":"仓促；草率（做事太快，常常缺乏足够的谨慎或思考）"},"examples":[{"en":"Because of his hastiness, he forgot to attach the file.","zh":"因为他太仓促，忘了附上文件。"},{"en":"Her hastiness in judgment hurt his feelings.","zh":"她下结论太草率，伤了他的感情。"}]},{"partOfSpeech":"n.","definition":{"en":"over-eagerness to act or speak, sometimes leading to mistakes","zh":"急于行动或发言的倾向（有时会因此出错）"},"examples":[{"en":"His hastiness to answer made him misread the question.","zh":"他急着回答，结果看错了题。"},{"en":"Try to control your hastiness and listen first.","zh":"尽量控制你的急躁，先听别人说。"}]}],"synonyms":["rush","recklessness","impulsiveness","carelessness"],"phonetic":"/ˈheɪstinəs/","extraExplanation":["你输入的“hastifness”很可能是拼写错误，常见正确拼写是“hastiness”（仓促、草率）。如果你本来想写的是“stiffness”（僵硬、硬度），告诉我语境我也可以一起解释。"]}
{"word":"hastifoliate","summary":{"en":"Hastifoliate describes spear-shaped leaves, often with two outward-pointing lobes at the base.","zh":"hastifoliate 指“戟形叶的”，叶片像矛头，基部常有两枚向外伸展的裂片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a spear-shaped leaf, usually with two small lobes (points) at the base that spread outward.","zh":"（植物）戟形叶的；叶片呈矛头状，基部常有两枚向外伸展的小裂片（小尖角）。"},"examples":[{"en":"The vine has hastifoliate leaves with two distinct basal lobes.","zh":"这种藤本植物有戟形叶，基部有两枚明显的裂片。"},{"en":"In the field guide, the plant is described as having hastifoliate foliage.","zh":"在野外图鉴中，这种植物被描述为具有戟形的叶片。"},{"en":"Look for hastifoliate leaves to help distinguish it from similar species.","zh":"可以观察戟形叶来帮助把它和相似物种区分开来。"}]}],"synonyms":["hastate","spear-shaped"],"phonetic":"/ˌhæs.tɪˈfoʊ.li.eɪt/","extraExplanation":["词源来自拉丁语：hasta（“长矛”）+ folium（“叶子”），字面意思是“像矛一样的叶”。这是植物形态学里的描述词，常用于植物志、检索表和标本说明中。","易混淆点：hastate（戟形）常强调“基部两裂片向外伸展”；sagittate（箭形）则更常指“基部两裂片更向后（朝叶柄方向）”。不同资料对两者的界定可能略有差异，最好结合配图理解。"]}
{"word":"hastiform","summary":{"en":"Hastiform means spear-shaped, especially in scientific descriptions.","zh":"hastiform 指“矛状的、枪头形的”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Spear-shaped; shaped like the head of a spear (often used in biology to describe leaves, petals, or other parts).","zh":"矛状的；枪头形的（常用于生物学，形容叶片、花瓣或其他结构的形状）。"},"examples":[{"en":"The plant has hastiform leaves with pointed tips.","zh":"这种植物的叶片呈矛状，叶尖很尖。"},{"en":"Under the microscope, the cells appeared hastiform and narrow.","zh":"在显微镜下，这些细胞看起来呈矛状而细长。"}]}],"synonyms":["spear-shaped","lance-shaped","lanceolate"],"phonetic":"/ˈhæstɪˌfɔrm/","extraExplanation":["词源：来自拉丁语 *hasta*（“长矛”）+ *-form*（“……形状的”），字面意思就是“长矛形的”。","使用场景：多见于植物学、解剖学、动物学等描述“形态”的语境，日常口语中很少用。","相关辨析：与 *lanceolate*（披针形的）相近，但 *hastiform* 更强调“像矛头/枪头”，常带更明显的尖端或角状轮廓；具体差异在不同学科或图谱中可能略有变化。"]}
{"word":"hastile","summary":{"en":"Hostile means unfriendly or opposing; it can also describe a harsh, dangerous environment.","zh":"hostile 表示“敌对的、不友善的”，也可形容“环境恶劣、难以生存”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unfriendly and showing anger or opposition; ready to argue or fight.","zh":"敌对的；不友善的；带有敌意的（表现出愤怒或反对，甚至准备争吵或动手）。"},"examples":[{"en":"He gave me a hostile look when I asked the question.","zh":"我一提问，他就用敌意的眼神看着我。"},{"en":"The meeting turned hostile after the budget was mentioned.","zh":"一提到预算，会议气氛就变得很对立。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a place or environment) dangerous or difficult to live in; unfriendly to life.","zh":"（环境或地方）恶劣的；不适宜生存的；对生命不友好的。"},"examples":[{"en":"Scientists study how life survives in hostile environments like deep oceans.","zh":"科学家研究生命如何在深海等恶劣环境中生存。"},{"en":"The desert can be a hostile place without enough water.","zh":"如果缺水，沙漠会是一个非常恶劣的地方。"}]}],"synonyms":["unfriendly","aggressive","antagonistic","adverse","belligerent"],"phonetic":"/ˈhɑːstaɪl/","extraExplanation":["你输入的 “hastile” 常见是拼写错误，正确拼写通常是 “hostile”。","“hostile” 常搭配：hostile to (对……不利/敌对)、hostile toward(s) (对……抱有敌意)、a hostile takeover（商业语境：敌意收购）。"]}
{"word":"hastilude","summary":{"en":"Hastilude means a medieval joust or spear-fighting tournament.","zh":"hastilude 指中世纪骑士的长枪比武（马上比武）或类似的武技竞赛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medieval joust or tournament; a spear-fighting game or contest (often in armor, on horseback).","zh":"（中世纪的）马上比武；骑士长枪比武大会；以长矛/长枪为主的武技竞赛。"},"examples":[{"en":"The novel describes a hastilude held to celebrate the prince’s return.","zh":"小说描写了一场为庆祝王子归来而举行的骑士比武大会。"},{"en":"In the castle courtyard, knights prepared for the hastilude at dawn.","zh":"在城堡庭院里，骑士们黎明时分就开始为马上比武做准备。"}]}],"synonyms":["joust","tournament","tilting","chivalric contest"],"phonetic":"/ˈhæstɪluːd/","extraExplanation":["词源提示：hastilude 来自拉丁语 hasta（长矛）+ ludus（游戏、比赛），字面意思是“长矛游戏”。现代英语里较少用，更常见的对应词是 joust 或 tournament。","使用语境：多见于历史小说、浪漫主义文学或学术写作中，用来营造“骑士时代”的氛围。"]}
{"word":"hastily","summary":{"en":"“Hastily” means doing something in a hurry, often too quickly and without enough care.","zh":"“hastily”表示匆忙地做某事，常暗示太急而不够仔细。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hurry; done too quickly and often without enough care or planning.","zh":"匆忙地；草率地（常因太急而缺少周全考虑）。"},"examples":[{"en":"She hastily packed her bag and ran to the station.","zh":"她匆忙地收拾好包，跑去车站。"},{"en":"The email was written hastily and contained several mistakes.","zh":"那封邮件写得很草率，里面有好几处错误。"}]}],"synonyms":["quickly","hurriedly","rapidly","in a rush","rashly"],"phonetic":"/ˈheɪstəli/","extraExplanation":["“hastily”来自“haste（匆忙）”，常带有“因为赶时间而不够细致”的语气色彩，因此比单纯的“quickly（迅速地）”更容易暗示粗心或考虑不足。","常见搭配：hastily made decision（仓促的决定）、hastily scribbled note（匆匆写下的便条）、hastily arranged meeting（临时/匆忙安排的会议）。"]}
{"word":"hastiness","summary":{"en":"Hastiness means doing or speaking too quickly, often without enough careful thought, which can lead to mistakes.","zh":"hastiness 指做事或说话过于匆忙、欠思考，常因此出错或显得草率。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of acting too quickly, often without enough thought or care; impulsiveness or rush.","zh":"做事太急、欠考虑的状态；匆忙、鲁莽。"},"examples":[{"en":"His hastiness caused him to send the email without checking for mistakes.","zh":"他的匆忙让他没检查错误就把邮件发出去了。"},{"en":"In her hastiness, she forgot her keys on the table.","zh":"她一着急，把钥匙忘在桌上了。"},{"en":"Try to slow down—hastiness often leads to regret.","zh":"尽量放慢一点——匆忙常常会带来后悔。"}]},{"partOfSpeech":"n.","definition":{"en":"A quick or abrupt manner, especially in speech or behavior.","zh":"（说话或行为）急促、唐突的态度或方式。"},"examples":[{"en":"There was a hastiness in his tone that made the conversation feel tense.","zh":"他语气里有种急促和唐突，让谈话显得紧张。"},{"en":"She apologized for the hastiness of her reply.","zh":"她为自己回复得太仓促而道歉。"}]}],"synonyms":["rashness","impulsiveness","recklessness","in a hurry","overhastiness"],"phonetic":"/ˈheɪstinəs/","extraExplanation":["“hastiness”来自形容词“hasty”（匆忙的、草率的）+ 名词后缀“-ness”（表示“……的状态/性质”）。常见搭配有：in one’s hastiness（因一时匆忙）、regret one’s hastiness（后悔自己的草率）、hastiness of one’s decision/reply（决定/回复的仓促）。","语感上，“haste”更中性，强调“赶时间/加快速度”；“hastiness”更偏负面，强调“太快以至于不够谨慎”。"]}
{"word":"hasting","summary":{"en":"“Hasting” is a literary/less common form meaning “hurrying” (from “haste”), and it can also describe something done in a rush.","zh":"“hasting”是较文学、较少见的形式，表示“匆忙/赶紧”（来自haste），也可形容“仓促的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “haste”) moving or acting quickly; hurrying.","zh":"（动词“haste”的现在分词，较少见）匆忙地移动或行动；赶紧。"},"examples":[{"en":"She came hasting down the stairs when she heard her name.","zh":"她听到有人叫她名字，就匆匆跑下楼梯。"},{"en":"He sent a message, hasting to explain the mistake.","zh":"他赶紧发消息解释这个错误。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, literary) hurried; done in a rush.","zh":"（形容词，文学用法）匆忙的；仓促完成的。"},"examples":[{"en":"In his hasting reply, he forgot to attach the file.","zh":"他仓促回复时忘了附上文件。"},{"en":"They made a hasting decision and later regretted it.","zh":"他们做了一个仓促的决定，后来后悔了。"}]}],"synonyms":["hurrying","rushing","hastening","speeding"],"phonetic":"/ˈheɪstɪŋ/","extraExplanation":["“hasting”在现代英语里不算常见；更常见的说法是“hastening”（赶紧、加速）或用更口语的“hurrying / rushing”。","注意拼写与文化常识：英国著名历史事件是“The Battle of Hastings（黑斯廷斯战役，1066）”，地名是“Hastings”，不是“Hasting”。如果你想表达“（某人）名叫Hasting”，那通常是专有名词，需要根据具体语境判断。"]}
{"word":"hastingsite","summary":{"en":"Hastingsite is a sodium‑rich amphibole mineral found in certain igneous and metamorphic rocks.","zh":"Hastingsite（黑钠角闪石）是一种富钠的角闪石族矿物，见于某些火成岩和变质岩中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark green to black amphibole mineral (a sodium‑rich variety of hornblende) found in some igneous and metamorphic rocks","zh":"黑绿色到黑色的角闪石族矿物（富钠的普通角闪石变种），常见于某些火成岩和变质岩中"},"examples":[{"en":"The thin section showed hastingsite crystals intergrown with feldspar.","zh":"薄片显微观察显示：黑钠角闪石晶体与长石交生。"},{"en":"Hastingsite can occur in alkaline igneous rocks as well as metamorphic amphibolites.","zh":"黑钠角闪石既可见于碱性火成岩，也可见于变质的角闪岩中。"}]}],"synonyms":["amphibole (general)","hornblende (broader term)"],"phonetic":"/ˈheɪstɪŋˌsaɪt/","extraExplanation":["“Hastingsite”是矿物学名，常译作“黑钠角闪石”。名字来源于加拿大安大略省的Hastings县（Hastings County），早期在相关地区的岩石中被研究与命名。","它属于角闪石族（amphibole group），常在地质与岩石学语境中出现；日常英语中很少用到。"]}
{"word":"hastish","summary":{"en":"“Hastish” is an informal, nonstandard way to say “a bit hasty/rushed.”","zh":"“hastish”是非正式且不太标准的说法，意思是“有点仓促/匆忙”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Somewhat hasty; done too quickly or without enough thought.","zh":"（非正式、非标准用法）有点仓促的；做事太快、考虑不够周全的。"},"examples":[{"en":"My reply was a bit hastish—I should have reread the email first.","zh":"我的回复有点仓促——我应该先把邮件再读一遍。"},{"en":"It was a hastish decision, but we didn’t have much time.","zh":"那是个有点仓促的决定，但我们时间不多。"}]}],"synonyms":["a bit hasty","rushed","somewhat impulsive"],"phonetic":"ˈheɪstiʃ","extraExplanation":["“hastish”不是常见标准词，更多像把“hasty（仓促的）”加上“-ish（有点……）”临时造出来的口语写法。正式写作里建议用“hasty / rushed / impulsive”等。","如果你原本想查的是“hashish（大麻脂/大麻树脂）”或“hasty（仓促的）”，告诉我你想表达的句子，我可以帮你确认正确拼写与用法。"]}
{"word":"hastive","summary":{"en":"“Hastive” is a rare/old word meaning “hasty” or “too quick and not well thought out.”","zh":"“hastive”是一个罕见/古体词，意思相当于“hasty”，指“匆忙的、草率的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Hasty; done too quickly or without enough thought.","zh":"（罕见/古体）匆忙的；草率的；做事太快、欠考虑的。"},"examples":[{"en":"It would be a hastive decision to quit your job without a plan.","zh":"没有计划就辞职会是一个草率的决定。"},{"en":"In old writings, you may see “hastive” used where modern English would say “hasty.”","zh":"在较古老的文字里，你可能会看到用“hastive”来表达现代英语里的“hasty（匆忙的）”。"}]}],"synonyms":["hasty","hurried","rash","impulsive"],"phonetic":"/ˈheɪstɪv/","extraExplanation":["“hastive”在现代英语里非常少见，多数情况下属于旧式或非标准用法。日常写作与口语更常用：hasty（匆忙的/草率的）、hurried（匆匆的）、rash（鲁莽的）。","词根来自“haste（匆忙）”。如果你是在拼写检查或听写中遇到它，也可能原本想写的是“hasty”或“haste”。"]}
{"word":"hastler","summary":{"en":"“Hastler” is usually a misspelling of “hustler”: either a hardworking, driven person, or (negatively) someone who makes money through scams; as a verb it means to work quickly and energetically.","zh":"“hastler”多为“hustler”的误拼：可指很拼、很有干劲的人，也可（贬义）指靠骗术赚钱的人；作动词表示快速积极地做事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “hustler”) A person who works very hard and moves quickly to get things done; someone with strong drive and energy.","zh":"（常拼作“hustler”）做事很拼、行动快、很有干劲的人；很会推进事情的人。"},"examples":[{"en":"She’s a real hustler—she studies at night and works during the day.","zh":"她真的很拼——白天工作，晚上学习。"},{"en":"In sports, a hustler keeps running and fighting for every ball.","zh":"在运动里，“hustler”指一直积极跑动、每个球都拼的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who tries to make money in aggressive or sometimes dishonest ways; a scammer or con artist (negative).","zh":"用强硬手段、甚至不诚实方式赚钱的人；骗子（贬义）。"},"examples":[{"en":"Be careful—some online hustlers promise quick money but take your fees.","zh":"小心——有些网络骗子承诺快速赚钱，却先骗你的费用。"},{"en":"The movie shows him as a hustler who tricks people to survive.","zh":"电影把他描写成一个靠骗术求生的人。"}]},{"partOfSpeech":"v.","definition":{"en":"To work quickly and energetically; to push actively to achieve something (often spelled “hustle”).","zh":"（常写作“hustle”）快速而有干劲地做事；积极推动达成目标。"},"examples":[{"en":"We need to hustle if we want to catch the last bus.","zh":"想赶上末班车，我们得快点。"},{"en":"He hustled to finish the project before the deadline.","zh":"他拼命赶工，在截止日期前完成项目。"}]}],"synonyms":["go-getter","self-starter","grinder","scammer","con artist","hustle"],"phonetic":"/ˈhʌslər/","extraExplanation":["“hastler”不是标准拼写，最常见的目标词是“hustler”。在口语里，“hustler”既可能是褒义（很拼、很会做事），也可能是贬义（骗人赚钱），要看语境。","常见搭配：side hustle（副业/兼职）、hustle culture（拼命工作文化，常带批评意味）、hustle and bustle（熙熙攘攘、忙忙碌碌）。"]}
{"word":"hastula","summary":{"en":"Hastula means a small spear-shaped structure, especially the small flap at the base of a palm leaf.","zh":"hastula 指小矛状结构，尤指棕榈叶基部叶片与叶柄连接处的小突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small spear-shaped part or appendage; especially (in botany) a little triangular or tongue-like flap where a palm leaf blade meets the leaf stalk (petiole).","zh":"小矛状结构；尤指（植物学）棕榈叶片与叶柄连接处的小三角形/舌状突起（叶舌状突）。"},"examples":[{"en":"The botanist pointed out the hastula at the base of the palm leaf.","zh":"植物学家指出了棕榈叶基部的叶舌状突（hastula）。"},{"en":"Different palm species can be identified by features like the hastula and the shape of the leaf.","zh":"不同的棕榈科植物常可通过叶舌状突（hastula）和叶形等特征来辨认。"}]}],"synonyms":["appendage","flap (botany context)","projection"],"phonetic":"/hæˈstuːlə/","extraExplanation":["“hastula”来自拉丁语，源头与“hasta（矛）”有关，-ula 表示“小……”，所以字面意思接近“小矛”。这个词主要出现在植物学（尤其是棕榈科描述）等较专业的语境中。"]}
{"word":"hasty","summary":{"en":"Hasty means rushed—often too quick and not carefully thought through.","zh":"Hasty 指“仓促的、草率的”，强调太急、欠思考；也可指动作匆忙。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Done too quickly, often without enough thought; rushed and possibly careless.","zh":"做得太快、常常缺乏思考的；仓促的（可能不够周全、容易出错）。"},"examples":[{"en":"It was a hasty decision, and she regretted it later.","zh":"那是个仓促的决定，后来她后悔了。"},{"en":"Don’t make hasty judgments based on one mistake.","zh":"不要因为一次错误就草率下结论。"},{"en":"He wrote a hasty reply and forgot to attach the file.","zh":"他匆忙回复，结果忘了附上文件。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fast and eager in movement or action; quick.","zh":"动作很快的；急促的。"},"examples":[{"en":"She took a hasty step back when the dog barked.","zh":"狗一叫，她急忙后退了一步。"},{"en":"He gave a hasty wave and ran to catch the bus.","zh":"他匆匆挥了挥手就跑去赶公交了。"}]}],"synonyms":["rushed","hurried","rash","impulsive","hasty"],"phonetic":"/ˈheɪsti/","extraExplanation":["“hasty”常带有负面语气，强调“太急、没想清楚”，而不只是“快”。如果只是中性地说“快”，更常用“quick/rapid”。","常见搭配：hasty decision/judgment/conclusion（草率的决定/判断/结论），hasty retreat（仓皇撤退）。相关表达：in haste（匆忙地）通常描述状态，不一定等于“hasty”（欠考虑）。"]}

