{"word":"hau","summary":{"en":"“Hau” is an interjection used as “hello” in some Indigenous North American languages (not a universal greeting).","zh":"“Hau”是部分北美原住民语言中的问候语，类似“你好”，但并非通用的原住民问候。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Used as a greeting) “Hello,” in some Indigenous languages of North America, especially Lakota/Dakota; often used by men when greeting others.","zh":"（用作问候语）北美一些原住民语言中的“你好/嗨”，尤其见于拉科塔语/达科他语；常被认为多用于男性问候。"},"examples":[{"en":"Hau! It’s good to see you.","zh":"Hau！很高兴见到你。"},{"en":"In a Lakota language class, students learned when it’s appropriate to say “hau.”","zh":"在拉科塔语课上，学生学习了在什么情况下适合说“hau”。"}]}],"synonyms":["hello","hi"],"phonetic":"/haʊ/","extraExplanation":["“Hau”常被影视作品当作泛用的“印第安人打招呼”，但实际上它并不是所有原住民语言都通用的问候语；不同民族、不同语言的问候方式差异很大。","在拉科塔/达科他语语境里，“hau”通常与特定身份与场合相关（常见说法是男性使用），所以在真实交流中更建议学习并使用对方社群实际使用的问候语。"]}
{"word":"haubergeon","summary":{"en":"A medieval chain-mail shirt used as body armor, usually shorter than a hauberk.","zh":"中世纪的锁子甲短衫，用作护甲，通常比 hauberk（长锁子甲）更短。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sleeveless or short-sleeved shirt of chain mail (linked metal rings), worn as body armor in the Middle Ages","zh":"（中世纪的）锁子甲短衫；由金属环相扣而成的铠甲上衣（多为无袖或短袖）"},"examples":[{"en":"The knight wore a haubergeon under his coat to protect his torso.","zh":"骑士在外衣下面穿着锁子甲短衫来保护躯干。"},{"en":"In the museum, you can see a haubergeon made of thousands of interlinked rings.","zh":"在博物馆里，你能看到一件由成千上万个金属环相扣制成的锁子甲短衫。"}]}],"synonyms":["chain mail shirt","mail shirt","hauberk (related, usually longer)"],"phonetic":"/ˈhɔːbɚˌɡən/","extraExplanation":["haubergeon 常被视为 hauberk（长一些的锁子甲上衣）的“短款/轻便款”。在中世纪战争与史诗、骑士文学中，这类护甲常与 helmet（头盔）、shield（盾牌）、surcoat（罩袍）一起出现，用来表现骑士阶层的武装形象。","词源上来自古法语，和 “hauberk” 同源；现代英语里比较少见，多用于历史写作、奇幻文学或博物馆/兵器学语境。"]}
{"word":"hauberget","summary":{"en":"A rare word for a short coat of chain mail armor (a small hauberk).","zh":"一个较少见的词，指较短的小型锁子甲上衣（小号 hauberk）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hauberk (a short coat of chain mail armor), especially in medieval Europe; similar to a habergeon","zh":"（中世纪欧洲的）小型锁子甲上衣；较短的链甲，类似于 habergeon（短链甲）"},"examples":[{"en":"The knight wore a hauberget under his surcoat for extra protection.","zh":"骑士在罩袍下面穿着一件小型锁子甲上衣，以加强防护。"},{"en":"In the museum, you can see a hauberget made of interlinked iron rings.","zh":"在博物馆里，你可以看到一件由相扣铁环制成的小型锁子甲。"}]}],"synonyms":["habergeon","hauberk","haubert","coat of mail","chain mail"],"phonetic":"/ˈhɔbɚˌɡɛt/","extraExplanation":["“hauberget”在现代英语中非常少见，多见于历史文本或中古题材作品；更常见的相关词是“hauberk / haubert / habergeon”。","词源上与法语、日耳曼语系的“护甲/颈部防护”相关词有联系，通常指用金属环相互扣连的链甲，用于保护躯干，有时也包含头颈或上臂的防护。"]}
{"word":"hauberk","summary":{"en":"A hauberk is a medieval chain-mail armor shirt worn for protection.","zh":"hauberk 指中世纪穿着的锁子甲长衫，用于防护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long shirt-like piece of armor, usually made of chain mail, worn in the Middle Ages to protect the body (often including the neck and sometimes a hood)","zh":"（中世纪的）锁子甲长衫；一种像长衫一样的护甲，通常由链甲组成，用来保护躯干（常连护颈，有时带兜帽）"},"examples":[{"en":"The knight pulled on his hauberk before riding into battle.","zh":"骑士在上战场前穿上了他的锁子甲长衫。"},{"en":"In the museum, you can see a hauberk made of thousands of interlinked metal rings.","zh":"在博物馆里，你可以看到一件由成千上万个金属环相扣制成的锁子甲长衫。"}]}],"synonyms":["chain mail shirt","mail coat","mail shirt"],"phonetic":"/ˈhɔbɝk/","extraExplanation":["“Hauberk”是中古英语/古法语来源的词，常见于骑士、十字军与中世纪战争的语境。它与“chain mail（锁子甲）”相关，但更具体：通常指覆盖躯干、长度较长、像长衫一样穿着的链甲。","在文学里，这个词常用来营造“中世纪骑士史诗”的氛围；例如一些亚瑟王传说改写作品或中世纪题材小说会用它来增加历史感。"]}
{"word":"hauberks","summary":{"en":"“Hauberks” are coats of chain mail armor (the plural of “hauberk”), common in medieval times.","zh":"“Hauberks”指锁子甲长袍（“hauberk”的复数），常见于中世纪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of hauberk) a long coat of chain mail (metal rings linked together) worn as armor, especially in the Middle Ages.","zh":"（hauberk 的复数）锁子甲长袍；一种由金属环相扣组成的长外甲，尤指中世纪常见的盔甲。"},"examples":[{"en":"The museum displayed several hauberks from the 12th century.","zh":"博物馆展出了几件12世纪的锁子甲。"},{"en":"Knights wore hauberks to protect their bodies in battle.","zh":"骑士在战斗中穿锁子甲来保护身体。"}]}],"synonyms":["chain mail","chainmail","mail (armor)"],"phonetic":"/ˈhɔːbɝk/","extraExplanation":["“hauberk”常出现在中世纪题材的历史、奇幻文学（如骑士故事）里，强调一种“覆盖到大腿、可带头罩”的锁子甲外衣。现代日常英语里不常用，更常见的泛称是“chain mail / chainmail”（锁子甲）。","词源上来自古法语，原意与“护颈、护喉”一类的防护有关；因此它常被理解为比简单的链甲背心更“完整、更长”的防护装备。"]}
{"word":"haubert","summary":{"en":"a medieval chain-mail coat worn as armor","zh":"中世纪的锁子甲上衣（链甲护身衣）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval coat of chain mail (linked metal rings), usually worn as body armor and sometimes with sleeves and a hood.","zh":"（中世纪的）锁子甲上衣（由金属环扣连而成的铠甲），通常作为躯干护甲，有时带袖或连头罩。"},"examples":[{"en":"The knight fastened his haubert before mounting his horse.","zh":"骑士在上马前把锁子甲上衣穿戴固定好。"},{"en":"In the museum, a haubert hangs beside a helmet and shield.","zh":"博物馆里，一件锁子甲上衣挂在头盔和盾牌旁边。"}]}],"synonyms":["chain mail","mail","coat of mail","chain armor"],"phonetic":"/ˈhoʊbɚt/","extraExplanation":["在中世纪英语语境里，haubert 常指覆盖躯干、上臂的锁子甲；较短、像“背心”式的锁子甲有时称 haubergeon（较少见）。","文学与史诗中常用来营造“骑士时代”氛围，例如描写战前整装：披上锁子甲、戴头盔、拿盾与长矛等。"],"etymology":"词源来自古法语 hauberc / haubert，可能与日耳曼语词根有关，原指“护颈、护身的盔甲”，后来特指中世纪的锁子甲上衣。","mnemonic":["把它想成“护（hau-）+ 胸背（-bert）”：穿在身上用来保护身体的“护身铠”。（用联想记，不是严格词根拆分）","联想画面：骑士“披上锁子甲”出征——haubert 就是那件金属环环相扣的“甲衣”。"]}
{"word":"hauberticum","summary":{"en":"A rare Latinized form meaning “hauberk,” a coat of chain mail armor.","zh":"一个罕见的拉丁化形式，意为“锁子甲长衫（hauberk）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Latinized) A hauberk; a coat of chain mail armor (or something relating to it).","zh":"（罕见/拉丁化形式）锁子甲长衫；（或）与锁子甲长衫有关的事物。"},"examples":[{"en":"In some older catalogues, hauberticum refers to a hauberk listed among medieval arms.","zh":"在一些较旧的目录中，hauberticum 用来指目录里列出的中世纪武备之一——锁子甲长衫。"},{"en":"The museum label used a Latin form—hauberticum—to describe the chain-mail garment.","zh":"博物馆的标签用拉丁化写法 hauberticum 来描述这件锁子甲衣。"}]}],"synonyms":["hauberk","chain mail","mail armor"],"phonetic":"/ˈhɔːbɝkɪkəm/","extraExplanation":["这个词在现代英语中几乎不用，更常见的英语词是 hauberk（锁子甲长衫）。hauberticum 很可能出现在拉丁文、伪拉丁文或旧式学术/编目语境里，用来“拉丁化”地指代 hauberk。若你是在某本书、碑铭、清单或游戏/奇幻设定里看到它，给我原句我可以帮你更准确判断它在该语境下的意思与词性。"]}
{"word":"haubois","summary":{"en":"Haubois is an archaic spelling meaning “oboe.”","zh":"haubois 是旧式拼写，意思是“双簧管”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old-fashioned spelling of **hautbois**, meaning the **oboe** (a woodwind instrument with a double reed).","zh":"“hautbois”的旧式拼写，指**双簧管**（一种使用双簧片的木管乐器）。"},"examples":[{"en":"The score calls for two haubois, which we would now label as two oboes.","zh":"乐谱上写需要两支 haubois，如今我们会标为两支双簧管。"},{"en":"In Baroque music, the haubois often carries the main melody.","zh":"在巴洛克音乐中，haubois 常常承担主旋律。"}]}],"synonyms":["hautbois","oboe"],"phonetic":"/ˈoʊboʊ/","extraExplanation":["“Haubois”来自法语“hautbois”（字面义接近“高音木管”），在17—18世纪英语里常见于乐谱与文献，后来逐渐被更常用的拼写“oboe”取代。","在阅读古谱或音乐史资料时，你可能会遇到“hautbois/haubois”；现代英语通常直接用“oboe”，演奏者称“oboist”。"]}
{"word":"hauchecornite","summary":{"en":"A very rare literary word for someone who is wrongly suspected and cannot clear their name, even while telling the truth.","zh":"一个极罕见的文学典故词：指被冤枉怀疑、怎么解释也洗不清的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, literary) A person who is unfairly suspected or disbelieved because of a small, ambiguous act—especially someone who keeps insisting on the truth but cannot convince others.","zh":"（罕见，文学用语）指因一个小小、容易引起误会的举动而被冤枉或不被相信的人——尤指不断申辩却怎么也无法让人相信其清白的人。"},"examples":[{"en":"After he picked up the lost wallet, he became a hauchecornite in the eyes of the whole office.","zh":"他捡起那只丢失的钱包后，在整个办公室的人眼里反倒成了一个“越解释越像有鬼”的冤枉人。"},{"en":"She felt like a hauchecornite: the more she told the truth, the more people doubted her.","zh":"她感觉自己像个“越说真话越没人信”的人：越解释，大家越怀疑。"}]}],"synonyms":["wrongly accused person","scapegoat","suspect (in others’ eyes)","victim of misunderstanding"],"phonetic":"/ˌoʊʃkɔːrˈniːt/","extraExplanation":["这个词非常罕见，多被当作文学典故式的“造词”。它常被认为源自法国作家莫泊桑（Guy de Maupassant）的短篇小说《细绳》（法语《La Ficelle》）：主人公Hauchecorne（奥什科恩）在地上捡起一小段细绳，被人误以为捡了钱包；他不断辩解却始终洗不清嫌疑，最终在屈辱与绝望中死去。后来有人用“hauchecornite”来指这种“被误会后越辩越黑”的处境或人物。"]}
{"word":"Haudenosaunee","summary":{"en":"the Six Nations (Iroquois) confederacy and its people; also describing their culture or languages","zh":"六族联盟（易洛魁联盟）及其人民；也可作形容词指其文化或语言"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Native American/First Nations confederacy of six nations (Mohawk, Oneida, Onondaga, Cayuga, Seneca, and Tuscarora), also called the Six Nations; the people of this confederacy.","zh":"北美原住民（第一民族）的“六族联盟/易洛魁联盟”及其人民：由莫霍克、奥奈达、奥农达加、卡尤加、塞内卡与塔斯卡罗拉六个民族组成。"},"examples":[{"en":"The Haudenosaunee Confederacy influenced political ideas about unity and governance in the region.","zh":"豪德诺索尼联盟在该地区关于团结与治理的政治理念上产生过影响。"},{"en":"Many Haudenosaunee communities continue to maintain their languages and cultural traditions today.","zh":"许多豪德诺索尼社区至今仍在延续本族语言与文化传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Haudenosaunee people, their languages, or their culture.","zh":"与豪德诺索尼人、其语言或文化相关的。"},"examples":[{"en":"The museum worked with Haudenosaunee leaders to present the history responsibly.","zh":"博物馆与豪德诺索尼领袖合作，以负责任的方式呈现历史。"},{"en":"She is studying Haudenosaunee beadwork and its symbolism.","zh":"她在研究豪德诺索尼串珠工艺及其象征意义。"}]}],"synonyms":["Iroquois","Six Nations","Iroquois Confederacy"],"phonetic":"ˌhoʊdə nəˈsɔːni","extraExplanation":["读写与文化敏感性：在很多语境中，Haudenosaunee 是更偏“自称”的名称；Iroquois 则更常被视为外称。写作时可根据社区偏好与场合（学术、博物馆、新闻）选择，并在首次出现时加一句说明（如“Haudenosaunee (Six Nations/Iroquois Confederacy)”）。","常见搭配：Haudenosaunee Confederacy（豪德诺索尼联盟/六族联盟）、Haudenosaunee nations（豪德诺索尼诸族）、Haudenosaunee languages（豪德诺索尼语言）。"],"etymology":"源自豪德诺索尼诸语言（常译作“长屋之民/建长屋的人们”，与传统长屋文化相关）。英语中常用该自称来指“易洛魁/六族联盟”，相对“Iroquois”（外来称呼）更尊重当事群体的用语选择。","mnemonic":["拆音记：Ho-de-no-so-nee（豪-德-诺-索-尼）→ 把它当作一个“人名/族名”的节奏去背。","联想记：“长屋之民”→ 想象一条很长的房子（长屋）里住着多个家族/多个民族，提醒你它是“联盟/共同体”。"]}
{"word":"hauerite","summary":{"en":"Hauerite is a rare mineral composed of manganese disulfide (MnS₂).","zh":"Hauerite（豪尔矿）是一种成分为二硫化锰（MnS₂）的罕见矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare mineral made of manganese disulfide (MnS₂), typically found in small dark crystals; it is the manganese-rich counterpart of the mineral pyrite (FeS₂).","zh":"一种较罕见的矿物，主要成分为二硫化锰（MnS₂），常见为深色的小晶体；可理解为与黄铁矿（FeS₂）在结构上相近、但以锰为主的对应矿物。"},"examples":[{"en":"Hauerite is a rare manganese sulfide mineral that often forms small, dark crystals.","zh":"豪尔矿（hauerite）是一种罕见的锰硫化物矿物，常形成深色的小晶体。"},{"en":"The sample was labeled “hauerite (MnS₂)” in the museum display.","zh":"博物馆展柜里，这个标本标注为“豪尔矿（MnS₂）”。"}]}],"synonyms":["manganese disulfide (MnS₂)"],"phonetic":"/ˈhaʊəˌraɪt/","extraExplanation":["词源与命名：hauerite 以奥地利矿物学家 Joseph Ritter von Hauer 的名字命名，常用于矿物学与地质学语境中。","学习提示：它属于专业词汇，日常英语几乎不使用；在阅读科普、地质报告或博物馆说明牌时更常见。"]}
{"word":"hauflin","summary":{"en":"“hauflin” is a Scottish dialect word meaning “half-grown/immature,” or a half-grown youngster.","zh":"“hauflin”是苏格兰方言词，指“半大、不成熟/略笨拙”，也可指“半大孩子”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scottish, informal) half-grown; not fully developed; awkward or immature.","zh":"（苏格兰方言，非正式）半大不小的；尚未完全成熟的；有点笨拙或不成熟的。"},"examples":[{"en":"He was still a hauflin lad, too young to be taken seriously.","zh":"他还是个半大不小的男孩，大家不太把他当回事。"},{"en":"The colt is hauflin and needs more time to grow.","zh":"这匹小马还没长成，需要再长一阵子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish) a half-grown youth; a youngster in the awkward “in-between” stage.","zh":"（苏格兰方言）半大孩子；处在“尴尬过渡期”的少年/小伙子。"},"examples":[{"en":"A bunch of hauflins were hanging around the shop after school.","zh":"放学后有一群半大孩子在店门口晃悠。"}]}],"synonyms":["half-grown","immature","awkward","youngster"],"phonetic":"/ˈhɔːflɪn/","extraExplanation":["“hauflin”多见于苏格兰英语/苏格兰语（Scots），来自“hauf”（half，半）这一方言形式，带有口语与地域色彩。它常用来描述“还没长开、介于孩子与大人之间”的状态，因此既可指年龄上的“半大”，也可含“做事不够稳重、略笨拙”的语气。","在苏格兰文学与民间口语中偶尔能见到该词（有时也写作“hauf-lin / hauflin”）。如果你是在歌词、诗歌或方言对话里遇到它，通常就是这种“半大、未成熟”的意思。"]}
{"word":"haugh","summary":{"en":"A Scottish dialect word for a flat riverside meadow or floodplain.","zh":"苏格兰方言词：指河边低洼平坦的草地/河漫滩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) A low-lying, flat piece of land—often a riverside meadow or fertile floodplain.","zh":"（苏格兰方言）低洼平坦的土地，常指河边的草地或肥沃的河漫滩。"},"examples":[{"en":"The sheep grazed on the haugh beside the river.","zh":"羊群在河边的那片低地草场上吃草。"},{"en":"After the rain, the haugh was muddy because the river had risen.","zh":"下雨后河水上涨，河边低地变得很泥泞。"}]}],"synonyms":["riverside meadow","floodplain","lowland meadow","alluvial flat"],"phonetic":"/hɑx/","extraExplanation":["“haugh”主要见于苏格兰英语/苏格兰方言（Scots），在现代日常英语里较少使用，更常在地名、乡村语境或文学作品中出现。","发音里的“gh”传统上对应一种类似德语 Bach 的喉音 /x/（清软腭擦音）；很多现代读者会把它读得更简化。"]}
{"word":"haughland","summary":{"en":"Haughland means low riverside meadowland or floodplain (mainly Scottish usage).","zh":"haughland 指河边的低洼草地/河漫滩（主要为苏格兰用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish English, uncommon) Low-lying meadowland beside a river; a riverside floodplain used as pasture or farmland.","zh":"（苏格兰英语，较少见）河边的低洼草地/田地；常被河水漫过的河漫滩，可用作牧场或农地。"},"examples":[{"en":"The cattle grazed on the haughland by the Tweed.","zh":"牛群在特威德河边的河漫滩草地上吃草。"},{"en":"After heavy rain, the haughland flooded for a day.","zh":"大雨过后，河边低地被淹了一天。"}]}],"synonyms":["riverside meadow","floodplain","lowland","meadowland"],"phonetic":"/ˈhɔːlænd/","extraExplanation":["“haugh”是苏格兰及英格兰北部方言词，常指“靠近河流的低洼草地/冲积地”。“haughland”就是在此基础上加上“land”，更强调它是一片可耕作或放牧的土地。","读音上，“haugh”里的“gh”通常不发音，因此更接近“haw”。在苏格兰地名或文学描写中偶尔会见到这一类词，用来营造乡野、河谷景象。"]}
{"word":"haughs","summary":{"en":"“Haughs” means low, flat river-meadows (plural), mainly used in Scotland/Northern England.","zh":"“Haughs”指河边低洼平坦的草地/河滩（复数），主要见于苏格兰和英格兰北部用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of haugh: a low-lying piece of flat land (often a meadow) beside a river, especially in Scotland and northern England.","zh":"haugh 的复数：指河边低洼、平坦的地带（常为草地/河滩），多见于苏格兰及英格兰北部方言。"},"examples":[{"en":"The sheep grazed on the haughs beside the river after the floodwaters dropped.","zh":"洪水退去后，羊群在河边的低洼草地（haughs）上吃草。"},{"en":"In old Scottish place names, “haugh” often refers to river meadows or flats; the haughs were good for farming.","zh":"在一些古老的苏格兰地名里，“haugh”常指河畔草地或平地；这些 haughs 很适合耕作。"}]}],"synonyms":["river meadow","floodplain","riverside flats","bottomland"],"phonetic":"/hɑk/","extraExplanation":["“haugh”是地域性很强的词，常见于苏格兰文学、地名或描写乡野景色的文字中；在现代日常英语里更常用的表达是 “river meadow / riverside flats / floodplain”。","读音在不同地区会略有差异；在苏格兰英语里常读得像 “hock”。"]}
{"word":"haught","summary":{"en":"“Haught” is an archaic form meaning “haughty; arrogantly proud.”","zh":"“haught”是较少见的古语形式，意思是“傲慢的；自负的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/poetic) Proud and unfriendly in a way that shows you think you are better than other people; haughty.","zh":"（古语/诗歌用法）傲慢的；自负的；表现出自以为高人一等的样子。"},"examples":[{"en":"In the old tale, the prince spoke in a haught voice to the villagers.","zh":"在那则古老的故事里，王子用傲慢的口吻对村民说话。"},{"en":"Her haught manners made it hard for others to approach her.","zh":"她那傲慢的举止让别人很难亲近她。"}]}],"synonyms":["haughty","arrogant","proud","snobbish","superior"],"phonetic":"/hɔt/","extraExplanation":["“haught”在现代英语里很少单独使用，通常你会看到更常见的形式 **haughty**（傲慢的）或名词 **haughtiness**（傲慢）。如果你是在现代文章里遇到“haught”，多半是作者刻意使用古风/文学化表达，或是把“haughty”简写/误写了。"]}
{"word":"haughtier","summary":{"en":"“Haughtier” means more arrogantly proud—acting like you are better than others.","zh":"“Haughtier”表示“更傲慢、更目中无人”，带有觉得自己高人一等的态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more proudly arrogant; showing that you think you are better than other people","zh":"更傲慢的；更自高自大的；表现出觉得自己比别人更优越"},"examples":[{"en":"After she got promoted, she seemed haughtier than before.","zh":"升职后，她看起来比以前更傲慢了。"},{"en":"He spoke in a haughtier tone, as if no one else mattered.","zh":"他说话的语气更傲慢，仿佛别人都不重要。"},{"en":"People avoided him because his haughtier attitude made others uncomfortable.","zh":"人们躲着他，因为他更傲慢的态度让别人不舒服。"}]}],"synonyms":["more arrogant","more proud (negative sense)","more snobbish","more conceited"],"phonetic":"/ˈhɔtiər/","extraExplanation":["“haughtier”是形容词“haughty”的比较级，常用来和“than”搭配（haughtier than ...）。它多用于负面评价，强调“傲慢、轻视他人”的感觉，比单纯的“proud（自豪的）”更刺耳。","拼写变化：haughty → haughtier（把 -y 变成 -ier），类似 happy → happier。","近义词语气对比：arrogant（更直接的“自大”）、snobbish（带“势利、看不起人”的社交阶层意味）、conceited（更偏“自恋、自负”）。"]}
{"word":"haughtiest","summary":{"en":"“Haughtiest” means “the most haughty”: extremely arrogant and looking down on others.","zh":"“haughtiest”是“haughty”的最高级，表示“最傲慢、最目中无人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “haughty”: the most proudly arrogant, acting as if you are better than other people.","zh":"“haughty”的最高级：最傲慢的、最目中无人的；表现得好像自己比别人高一等。"},"examples":[{"en":"Of all the guests, he was the haughtiest, barely saying hello to anyone.","zh":"在所有宾客中，他最傲慢，几乎不跟任何人打招呼。"},{"en":"Her haughtiest comments came when she felt insecure.","zh":"她最傲慢的言论往往出现在她感到不安的时候。"}]}],"synonyms":["most arrogant","most conceited","most disdainful","most snobbish","most supercilious"],"phonetic":"/ˈhɔtiəst/","extraExplanation":["“haughty”常用来形容带有“轻视他人”的傲慢（看不起人），语气偏负面；和仅表示自信的“confident”不同。","词根上与“high（高）”有渊源，隐含“高高在上”的姿态；常见搭配有：a haughty look/attitude/voice（傲慢的眼神/态度/语气）。"]}
{"word":"haughtily","summary":{"en":"Haughtily means acting or speaking in an arrogant, superior way.","zh":"haughtily 指以傲慢、居高临下的态度行事或说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a proud, arrogant way that shows you think you are better than other people.","zh":"傲慢地；自高自大地（表现出觉得自己比别人优越）。"},"examples":[{"en":"She looked at the waiter haughtily and snapped her fingers for service.","zh":"她傲慢地看着服务员，还打了个响指催促服务。"},{"en":"He spoke haughtily about “ordinary people,” as if they were beneath him.","zh":"他傲慢地谈论“普通人”，仿佛他们低他一等。"},{"en":"The manager answered haughtily, refusing to consider any feedback.","zh":"经理傲慢地回答，拒绝考虑任何反馈。"}]}],"synonyms":["arrogantly","superiorly","disdainfully","snobbishly","contemptuously"],"phonetic":"/ˈhɔtəli/","extraExplanation":["“haughtily”来自形容词“haughty”（傲慢的），和“high（高）”有共同的词源感觉：把自己“放得很高”。常见搭配：look/smile/speak/answer haughtily。","语气上，“haughtily”通常比“proudly（自豪地）”更负面：proudly 可以是正当的自豪；haughtily 则强调轻视别人、目中无人。"]}
{"word":"haughtiness","summary":{"en":"Haughtiness means arrogant, superior-looking behavior.","zh":"haughtiness 指傲慢、自以为高人一等的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Proud and unfriendly behavior that shows you think you are better than other people; arrogance.","zh":"傲慢自大、盛气凌人的态度；表现出自认为高人一等的行为。"},"examples":[{"en":"His haughtiness made it hard for others to work with him.","zh":"他的傲慢让别人很难和他一起工作。"},{"en":"She answered with haughtiness, as if the question were beneath her.","zh":"她带着傲慢回答，仿佛这个问题不配她回答。"},{"en":"The manager’s haughtiness hurt team morale.","zh":"经理的傲慢伤害了团队士气。"}]}],"synonyms":["arrogance","superiority","snobbery","condescension"],"phonetic":"/ˈhɔt̬inəs/","extraExplanation":["“haughtiness”常见于描写人物性格（尤其是文学或新闻评论中），语气偏正式，带明显负面评价。","词根上与“high（高）”有关，可联想为“把自己摆得很高”，因此表现出轻视他人的态度。","易混词区分：haughtiness 更强调“高高在上、轻慢他人”的姿态；pride 可以是中性或正面的“自豪”；arrogance 更强调“自大、过度自信”。"]}
{"word":"haughtinesses","summary":{"en":"Haughtinesses means multiple instances or kinds of arrogant pride.","zh":"Haughtinesses 指多次或多种“傲慢、自视甚高”的表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of haughtiness: displays or feelings of proud, arrogant superiority","zh":"haughtiness 的复数：傲慢、自视甚高的态度或情绪"},"examples":[{"en":"Her repeated haughtinesses made teamwork difficult.","zh":"她一再表现出的傲慢让团队合作变得很困难。"},{"en":"The novel criticizes the haughtinesses of the upper class.","zh":"这部小说批判上层阶级的种种傲慢。"}]}],"synonyms":["arrogances","airs","snobberies","pride","conceit"],"phonetic":"/ˈhɔtinəsɪz/","extraExplanation":["“haughtiness”来自形容词“haughty（傲慢的）”。在现代英语里，“haughtiness”通常作不可数名词，更常见的说法是“his/her haughtiness（他的/她的傲慢态度）”。“haughtinesses”作为复数形式较少见，多用于强调“多次/多种傲慢表现”。"]}
{"word":"haughtly","summary":{"en":"“Haughtly” is not standard; it’s usually a misspelling of “haughtily,” meaning “in an arrogantly proud way.”","zh":"“haughtly”不是规范拼写，通常是“haughtily”的误拼，意思是“傲慢地、带着优越感地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Common misspelling of **haughtily** (“in a proud, superior, or disrespectful way”).","zh":"常见拼写错误：应为 **haughtily**（“傲慢地、带着优越感地、目中无人地”）。"},"examples":[{"en":"She spoke **haughtily**, as if everyone else were beneath her.","zh":"她说话**傲慢地**，仿佛别人都不如她。"},{"en":"He looked at the waiter **haughtily** and snapped his fingers.","zh":"他**傲慢地**看着服务员，还打了个响指。"}]}],"synonyms":["arrogantly","proudly","snobbishly","condescendingly"],"phonetic":"/ˈhɔti/","extraExplanation":["“haughtly”不是标准拼写。最常见的正确形式是副词 **haughtily**（形容词是 **haughty**）。","词感偏强，通常带有负面评价：不仅是“自豪/proud”，而是“看不起别人、摆架子”。"]}
{"word":"haughtness","summary":{"en":"Haughtiness means arrogant, superior behavior that looks down on others.","zh":"haughtiness 指傲慢自大、摆出高人一等的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Proud, unfriendly behavior that shows you think you are better than other people; arrogance.","zh":"傲慢自大、目中无人（表现出认为自己比别人高一等的态度）。"},"examples":[{"en":"Her haughtiness made the new students feel unwelcome.","zh":"她的傲慢让新来的学生感到不受欢迎。"},{"en":"He answered with haughtiness, as if the question was beneath him.","zh":"他傲慢地回答，仿佛这个问题不配他回答。"},{"en":"The character’s haughtiness slowly disappears as he learns empathy.","zh":"随着他学会共情，这个角色的傲慢逐渐消失。"}]}],"synonyms":["arrogance","conceit","snobbery","superiority","disdain"],"phonetic":"/ˈhɔt.nəs/","extraExplanation":["“haughtiness”常见于文学或较正式的语境，用来批评一种“高高在上、瞧不起人”的态度。比起单纯的“pride（自豪）”，“haughtiness”带有更明显的负面评价。","词根与“high（高）”同源，暗示“把自己看得高于他人”。常见搭配：with haughtiness（带着傲慢）、an air of haughtiness（傲慢的神态）、aristocratic haughtiness（贵族式的傲慢）。","在英语文学中，这种性格常用来塑造“起初冷傲、后来成长改变”的人物弧光；例如简·奥斯汀作品里常讨论类似的傲慢与偏见主题。"]}
{"word":"haughtonite","summary":{"en":"Haughtonite is a rare mica mineral, often described as an iron-rich variety related to phlogopite/biotite.","zh":"Haughtonite 是一种较罕见的云母矿物，常被描述为与金云母/黑云母相关的富铁变种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a type of mica), usually described as an iron-rich variety related to phlogopite/biotite.","zh":"一种较罕见的矿物（云母的一种），通常被描述为富铁的金云母/黑云母相关变种。"},"examples":[{"en":"Haughtonite is classified as a mica mineral in many geology references.","zh":"在许多地质学资料中，haughtonite 被归类为云母矿物。"},{"en":"The rock sample contains small, dark flakes of haughtonite.","zh":"这块岩石样品里含有少量深色的 haughtonite 片状晶体。"}]}],"synonyms":["mica","phlogopite (var.)","biotite (related)"],"phonetic":"/ˈhɔːtənaɪt/","extraExplanation":["haughtonite 是矿物学/岩石学中的专门词汇，日常英语里几乎不会用到。","它的名称来源于人名（常见做法是用科学家或发现者命名矿物）；不同资料对它与金云母（phlogopite）、黑云母（biotite）的关系描述可能略有差异，常见说法是“富铁的金云母变种”或“介于金云母与黑云母之间的云母”。"]}
{"word":"haughty","summary":{"en":"Haughty means arrogantly proud—acting like you’re superior to others.","zh":"haughty 指带轻蔑的傲慢，自认为高人一等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Proud in a way that shows you think you are better than other people; arrogantly superior.","zh":"傲慢的；自以为高人一等的；目中无人的。"},"examples":[{"en":"She gave the waiter a haughty look and spoke as if she were doing him a favor.","zh":"她傲慢地看了服务员一眼，说话的口气像是在施舍对方。"},{"en":"His haughty attitude made it hard for people to work with him.","zh":"他那种傲慢的态度让人很难和他共事。"}]}],"synonyms":["arrogant","snobbish","conceited","stuck-up","superior"],"phonetic":"/ˈhɔti/","extraExplanation":["“Haughty”通常描述一种“看不起别人”的骄傲（带有轻蔑和优越感），语气偏强、偏负面；与单纯表示自信或自豪的“proud”不同。","常见搭配：a haughty look/tone/attitude（傲慢的眼神/语气/态度）；sound haughty（听起来很傲慢）。"]}
{"word":"haul","summary":{"en":"Haul means to move something heavy with effort, or to transport goods; as a noun, it can mean a difficult journey or a large amount gained.","zh":"Haul 指费力拖拉/搬运重物或运输货物；作名词可指艰难的长途路程，或一次获得/查获的大量东西。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to pull or carry something heavy with effort, often over a distance","zh":"（费力地）拖、拉、搬运（重物），常指搬运一段距离"},"examples":[{"en":"They hauled the damaged boat onto the shore.","zh":"他们把受损的船拖上岸。"},{"en":"I had to haul my suitcase up the stairs.","zh":"我不得不把行李箱拖上楼梯。"}]},{"partOfSpeech":"v.","definition":{"en":"to transport goods or materials, especially by truck","zh":"（尤指用卡车）运输货物或材料"},"examples":[{"en":"The company hauls gravel to construction sites.","zh":"这家公司把碎石运到建筑工地。"}]},{"partOfSpeech":"n.","definition":{"en":"an act of pulling/transporting; the amount obtained or gained at one time (a haul)","zh":"一次拖运/搬运；（一次）获得的数量、战利品或收获（常说 a haul）"},"examples":[{"en":"It was a long haul across the mountains.","zh":"穿越群山是一段漫长而艰苦的路程。"},{"en":"The police made a major drug haul.","zh":"警方查获了大量毒品。"}]}],"synonyms":["pull","drag","lug","tow","transport"],"phonetic":"/hɔl/","extraExplanation":["常见搭配：long haul（长途/长期的艰苦过程，如 in it for the long haul 表示“打算长期坚持”）；haul off（突然动手/猛地挥拳，如 haul off and hit）。","语感提示：haul 通常带“重、费力、拖拽”的感觉，比 pull 更强调用力和辛苦；在美式英语里也很常用于卡车运输行业（haul freight/haul goods）。"]}
{"word":"haul ... in","summary":{"en":"pull in with effort; also bring in a lot (catch, results, or money), or summon for questioning","zh":"费力拉进来/拉上来；也可指带来大量收获/成果/钱，或被叫去盘问"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to pull or bring something in (often with effort), especially a net, rope, boat, or a large/heavy object","zh":"（常指费力地）把……拉进来/拖进来（尤指网、绳子、船或又大又重的东西）"},"examples":[{"en":"The fishermen hauled in the net at dawn.","zh":"渔民在黎明时把渔网拉了上来。"},{"en":"We hauled in the canoe before the storm arrived.","zh":"暴风雨来之前，我们把独木舟拖上了岸。"}]},{"partOfSpeech":"phrase","definition":{"en":"to catch and bring in fish or other animals (or figuratively, to bring in results)","zh":"（捕获并）收获/捞到（鱼等）；（引申）取得成果"},"examples":[{"en":"They hauled in a huge catch today.","zh":"他们今天收获了一大网鱼。"},{"en":"The new ad campaign is hauling in customers.","zh":"新的广告活动正带来大量顾客。"}]},{"partOfSpeech":"phrase","definition":{"en":"to earn or obtain a large amount of money or benefits (informal)","zh":"（非正式）赚到/捞到很多钱或好处"},"examples":[{"en":"He’s hauling in six figures a year.","zh":"他一年赚到六位数的收入。"},{"en":"Some influencers haul in serious money from sponsors.","zh":"一些网红从赞助商那里赚到不少钱。"}]},{"partOfSpeech":"phrase","definition":{"en":"to criticize or question someone strongly, often by an authority (informal)","zh":"（非正式）严厉责备/盘问（常指被权威人士“叫去问话”）"},"examples":[{"en":"The coach hauled him in after the game for breaking the rules.","zh":"比赛后教练把他叫去，因他违反规则而严厉训了一顿。"},{"en":"She was hauled in for questioning by the police.","zh":"她被警方叫去接受问询。"}]}],"synonyms":["pull in","drag in","draw in","bring in","reel in","land","net","earn","make","rake in","take in","summon","call in"],"phonetic":"/hɔl ɪn/","extraExplanation":["“haul in”既可字面表示把东西“拉进来/拉上来”，也常在口语中引申为“赚很多钱”“带来大量成果”。在新闻或警匪题材里，“be hauled in”常见，语气偏强，暗示被强制带去或被严肃对待。"],"etymology":"“haul”源自中古英语，意为“拉、拖”，与“用力拉动”这一核心意思有关；加上介词“in”后形成短语动词，强调“拉到里面/拉上来”，进而引申出“带来（成果/钱）”“叫来盘问”等用法。","mnemonic":["把“haul”联想成“好拉（好+拉）”：haul in = 好拉进来/拉上来。","记“in=进来”，所以 haul in 的画面感就是“用力把东西往里拖/往上拉”。"]}
{"word":"haul in","summary":{"en":"to pull in; bring in (catch/earn), or take someone in custody","zh":"拉/拖进来；带回（捕鱼/赚钱等）；（非正式）带走问话/逮捕"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to pull or draw something toward you or to a particular place, often with effort","zh":"（费力地）把……拖/拉进来；把……拽到某处"},"examples":[{"en":"They hauled in the rope hand over hand.","zh":"他们一手一手地把绳子拉了进来。"},{"en":"Help me haul in this heavy box.","zh":"帮我把这个沉箱子拖进来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to catch and bring in fish, or to bring in a large amount of something (money, prizes, votes, etc.)","zh":"（把鱼）钓上来并带回；（大量）赚到/获得（钱、奖项、选票等）"},"examples":[{"en":"The boat hauled in a big catch before noon.","zh":"这艘船中午前就捕到了一大批鱼。"},{"en":"Her new product line hauled in a lot of revenue.","zh":"她的新产品线带来了很多收入。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) to arrest someone or take someone to a police station for questioning","zh":"（非正式）逮捕；把某人带到警局问话"},"examples":[{"en":"The police hauled him in for questioning.","zh":"警方把他带去问话。"}]}],"synonyms":["pull in","draw in","reel in","bring in","land","net","round up","take in","arrest"],"phonetic":"/hɔl ɪn/","extraExplanation":["在航海、捕鱼语境里，haul in 很常见：把绳索、渔网、鱼线“收进来”。","口语里“警方把人 haul in”语气较强，带有“强行带走/不太客气地带走”的感觉。正式场合可用 arrest 或 take in for questioning。"],"etymology":"源自动词 haul（拖、拉），来自中古英语，表示“用力拖拽”。与 in 搭配时，强调“拉进来/带回来的结果”。","mnemonic":["把 haul 想成“好（hao）用力地拉”，haul in=“用力拉进来”。","联想“收网”：渔船 haul in the net（把网收进来）→也引申为“收获很多（钱/成果）”。"]}
{"word":"haul in ...","summary":{"en":"to pull in with effort; to bring in (a person) for questioning; to earn a lot","zh":"费力拉进来；带去盘问/逮捕；赚到很多钱"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to pull or bring something in (often with effort), for example a rope, net, or boat","zh":"（常指费力地）把某物拉进来、拖进来（如绳子、网、船等）"},"examples":[{"en":"The fishermen hauled in the net and found it full of fish.","zh":"渔民把网拉上来，发现里面满是鱼。"},{"en":"We hauled in the rope hand over hand.","zh":"我们一手接一手把绳子拉了进来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to bring someone to the police station for questioning or arrest","zh":"把某人带到警局盘问或逮捕"},"examples":[{"en":"Police hauled him in for questioning after the incident.","zh":"事件发生后，警方把他带去盘问。"},{"en":"Several suspects were hauled in overnight.","zh":"有几名嫌疑人连夜被带走调查。"}]},{"partOfSpeech":"phrase","definition":{"en":"to earn or collect a large amount of money or profit","zh":"赚到（或收获）大量钱财、利润"},"examples":[{"en":"That movie hauled in millions at the box office.","zh":"那部电影票房赚了数百万。"},{"en":"The company hauled in huge profits last quarter.","zh":"公司上个季度赚了巨额利润。"}]}],"synonyms":["pull in","drag in","reel in","bring in","take in","round up","apprehend","arrest","earn","make","rake in"],"phonetic":"/hɔl ɪn/","extraExplanation":["语气与场景：用于“警方把人带走”时，haul in 往往带有“强硬、带点粗暴/不客气”的感觉，比 bring in 更强势。","常见搭配：haul in a net/rope/boat（拉上网/绳/船）；haul someone in for questioning（带去盘问）；haul in money/profits/revenue（赚进钱/利润/收入）。"],"etymology":"来自动词 haul（“拖、拉”，原指用力拖拽）+ in（“向内”）。字面意思是“往里拉”，后来引申为“把人带来（警局）”以及“把钱/收益拉进来”。","mnemonic":["把 haul 想成“好拉（好用力拉）”，haul in 就是“好拉进来”。","in = 往里；haul = 用力拖拉 → 合起来就是“用力拉到里面”，再引申到“把人带来/把钱赚进来”。"]}
{"word":"haul leaves","summary":{"en":"carry away a large amount of leaves","zh":"把大量落叶搬运/运走"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to carry or transport leaves (usually in large amounts), especially from a yard or garden, often to a compost site or trash pickup area","zh":"（通常指大量地）把落叶搬运/运走；常用于庭院清理，把叶子运到堆肥处或垃圾回收处"},"examples":[{"en":"We spent Saturday morning hauling leaves to the compost pile.","zh":"我们周六早上把落叶搬到堆肥堆那里。"},{"en":"Can you help me haul the leaves to the curb for pickup?","zh":"你能帮我把落叶搬到路边等清运吗？"},{"en":"After the storm, the neighbors hauled leaves and branches out of the street.","zh":"暴风雨过后，邻居们把落叶和树枝从街上清走。"}]}],"synonyms":["cart away leaves","remove leaves","take away leaves","transport leaves","carry off leaves"],"phonetic":"/hɔl livz/","extraExplanation":["在美式英语里，“haul leaves”常见于秋季庭院清理（yard work）语境：先rake leaves（把叶子耙成堆），再haul leaves（用袋子、手推车或车拖斗把叶子运走）。有些城市有“leaf pickup”（落叶集中清运）服务。"],"etymology":"“haul”源自中古英语，来自古法语/日耳曼语相关词根，原意与“拉、拖”有关；后来引申为“（费力地）搬运、运送（大量或笨重的东西）”。“leaves”是“leaf”的复数，这里指落叶。","mnemonic":["把“haul”联想成“好累”（hǎo lèi）：搬运一大堆落叶当然“好累”，所以是“费力搬运/运走”。","“haul”=“用力拉/拖”，想象你拖着装满落叶的大袋子往路边走。"]}
{"word":"haul off","summary":{"en":"to move away, remove something, or suddenly hit someone","zh":"离开/驶离；把东西运走；突然抡起猛打"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(of a vehicle, boat, or person) to move away; to depart, often after turning or pulling away.","zh":"（车辆、船或人）驶离/离开；常指先转向或拉开后离去。"},"examples":[{"en":"The truck hauled off down the road as soon as it was loaded.","zh":"卡车一装好货就沿着路开走了。"},{"en":"The boat hauled off from the dock and headed into the bay.","zh":"船从码头驶离，驶向海湾。"}]},{"partOfSpeech":"phrase","definition":{"en":"to suddenly swing and hit someone (used especially in American English).","zh":"突然抡起手打人/猛击（尤见于美式英语）。"},"examples":[{"en":"He got so angry that he hauled off and punched the wall.","zh":"他气得抡起拳头就砸在墙上。"},{"en":"She hauled off and slapped him before he could explain.","zh":"他还没来得及解释，她就抡手扇了他一巴掌。"}]},{"partOfSpeech":"phrase","definition":{"en":"to drag or carry something away; to remove (often physical items).","zh":"把……拖走/运走；清走（多指实物）。"},"examples":[{"en":"They hauled off the broken furniture after the move.","zh":"搬家后他们把坏掉的家具运走了。"},{"en":"The city hauled off piles of debris after the storm.","zh":"暴风雨后市政把一堆堆残骸运走了。"}]}],"synonyms":["drive off","pull away","leave","take away","remove","cart off","lug away","hit","strike","slug"],"phonetic":"/hɔl ɔf/","extraExplanation":["在“突然打人”的意思里，常见固定结构是“haul off and + 动词（punch/slap/hit）”，强调动作突然、带情绪。","“离开”的意思多用于描写车辆/船只从某处驶离，带一点画面感；日常口语里也可用更普通的“pull away / drive off”。"],"etymology":"“haul”源自日耳曼语系，原义为“拉、拖”；与副词/介词“off（离开、脱离）”组合后，形成“拉开并离去/把…拉走”，并引申出“抡起（手臂）猛打”的口语用法。","mnemonic":["把它拆开记：haul（拖/拉）+ off（离开）→“拉开就走/拖走”。","联想“抡起手臂拉开距离再打”：先haul（拉起）再off（甩出去）→“抡起就打”。"]}
{"word":"haul oneself up by one's bootstraps","summary":{"en":"Improve your life through your own effort, sometimes used ironically to mean an unrealistic demand.","zh":"靠自己努力改变处境；也可讽刺指不现实的要求。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To improve your situation through your own effort, without help from others (often used as advice or as a belief about success).","zh":"靠自己的努力改变处境，不依赖他人帮助（常用作劝告或强调“成功靠自己”的观念）。"},"examples":[{"en":"He says he got rich by hauling himself up by his bootstraps.","zh":"他说自己发家致富全靠白手起家、靠自己努力。"},{"en":"Some people tell students to haul themselves up by their bootstraps, even when they don’t have enough support.","zh":"有些人让学生“靠自己站起来”，即使他们其实缺乏足够的支持。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Often with irony) To attempt something that is essentially impossible—like lifting yourself into the air by pulling on your boots.","zh":"（常带讽刺）试图做本质上不可能的事——就像拉着自己的靴带把自己提起来一样。"},"examples":[{"en":"Fixing the whole system overnight is like hauling ourselves up by our bootstraps.","zh":"一夜之间修好整个体系，就像想靠拉靴带把自己提起来一样不现实。"},{"en":"The plan expects people to solve poverty alone—it's bootstraps thinking.","zh":"这个计划指望人们单靠自己解决贫困——这是典型的“靴带式思维”。"}]}],"synonyms":["pull yourself up by your bootstraps","be self-made","make it on your own","fend for yourself","stand on your own two feet","self-reliance","go it alone"],"phonetic":"/hɔl wʌnˈsɛlf ʌp baɪ wʌnz ˈbuːtˌstræps/","extraExplanation":["在美国公共话语中，这个短语常与“个人责任、勤奋就能成功”的价值观相关；但在讨论贫困、教育机会、医疗等议题时也常被批评为忽视结构性障碍（如出身资源、歧视、经济环境）。因此它既可能是鼓励，也可能带有讽刺或批判意味。","常见变体：pull yourself up by your bootstraps（更常见）；haul 是更强调“费力拖拽”的说法。"],"etymology":"源自19世纪的英语夸张说法：bootstraps 指“靴带”。字面意思是“抓住靴带把自己提起来”，从物理上不可能，因此最早常用来表示荒谬/不可能；后来在美国语境里逐渐被用来强调“自力更生、白手起家”的成功观。","mnemonic":["把 bootstraps 想成“靴带”，画面是“拉着鞋带把自己拎起来”——很费力，甚至不可能；所以要么表示“靠自己硬撑”，要么讽刺“要求过高不现实”。","bootstrap ≈ “自启动/自给自足”（也见于计算机里的 bootstrap），联想到“自己把自己启动起来”。"]}
{"word":"haul oneself up by one's own bootstraps","summary":{"en":"Succeed solely through personal effort, often said with criticism.","zh":"完全靠个人努力取得成功（常带批评或讽刺）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To improve your situation through your own effort, without help from others (often used critically to suggest the expectation is unrealistic or unfair).","zh":"靠自己努力改善处境、获得成功（常带批评意味，暗示这种要求不现实或不公平）。"},"examples":[{"en":"Some people say you should haul yourself up by your own bootstraps, but not everyone starts with the same opportunities.","zh":"有人说你应该“靠自己的鞋带把自己拽起来”，但不是每个人起点和机会都一样。"},{"en":"He worked two jobs, studied at night, and truly hauled himself up by his own bootstraps.","zh":"他打两份工、晚上学习，确实是靠自己一步步拼出来的。"},{"en":"Telling underpaid workers to haul themselves up by their own bootstraps can ignore real problems like low wages and high rent.","zh":"让收入很低的工人“自力更生往上爬”，可能会忽视低工资和高房租等现实问题。"}]}],"synonyms":["be self-made","make it on your own","pull yourself up by your bootstraps","stand on your own two feet","be self-reliant"],"phonetic":"/hɔl wʌnˈsɛlf ʌp baɪ wʌnz oʊn ˈbutstræps/","extraExplanation":["bootstraps 指靴子后面的拉带（便于穿靴时用手拉）。从字面看，一个人不可能只靠拽自己的靴带把自己“提离地面”，所以这句在很多语境里带有“别把问题说得太简单”的批评味道。","在美国公共讨论中，这个说法常与“个人奋斗 vs. 社会支持/结构性问题（如教育、医疗、贫富差距）”联系在一起；具体语气要看说话者是否在强调自立，还是在讽刺不切实际的要求。"],"etymology":"源自19世纪英语里“pull/haul oneself up by one’s bootstraps（拽着自己的靴带把自己提起来）”，本来指一件物理上不可能的事，后来转义为“完全靠自己成功”，并常用于讽刺或质疑这种要求。","mnemonic":["想象你抓着“靴带”（bootstraps）把自己往上拽——画面越夸张越好记：这件事几乎不可能，所以常用来讽刺“全靠自己”。","把 boot + straps 记成“靴子+带子”，haul up 记成“用力往上拉”，合起来就是“拉着靴带往上拽”。"]}
{"word":"haul sb. over the coals","summary":{"en":"to harshly scold or severely criticize someone","zh":"严厉斥责或猛烈批评某人"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to criticize or question someone very harshly, often in an angry or demanding way","zh":"把某人严厉斥责/痛批（常带怒气或强硬质问）"},"examples":[{"en":"The manager hauled him over the coals for missing the deadline.","zh":"经理因为他错过截止日期而把他狠狠训了一顿。"},{"en":"The press hauled the company over the coals after the scandal.","zh":"丑闻之后，媒体对这家公司进行了猛烈抨击。"},{"en":"If the numbers are wrong, the auditor will haul us over the coals.","zh":"如果数字有问题，审计员会把我们严厉质问一番。"}]}],"synonyms":["scold","rebuke","reprimand","criticize","blast","chew out","dress down","lambaste","take to task","give a grilling","rake over the coals"],"phonetic":"/hɔl/","extraExplanation":["常见搭配：haul someone over the coals for (doing) something（因为……而痛批某人）。","语气偏强，常用于职场、媒体、政治语境；日常口语里也可用，但比“criticize”更“狠”。","相近表达：give someone a grilling / rake someone over the coals（英式更常见）/ read someone the riot act。"],"etymology":"源自“把人拖到炭火上方”的形象化说法（haul=拖拽；coals=炭火），比喻让人像被火烤一样难受，后来引申为“严厉训斥/责难”。","mnemonic":["把“coals=炭火”想成“烤人”，被“拖到炭火上烤”=被骂得很难受→严厉斥责。","haul≈“薅/拖”联想：把人“薅”过去“过炭火”，就会被狠狠批评。"]}
{"word":"haul up","summary":{"en":"to pull something up with effort; or to stop suddenly","zh":"费力把……拉上来；或突然停下"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to pull or lift something upward using effort (often something heavy); to hoist","zh":"（费力地）把……往上拉/拖上来；吊起"},"examples":[{"en":"They hauled up the bucket from the well.","zh":"他们把桶从井里拉上来。"},{"en":"We hauled the canoe up onto the shore.","zh":"我们把独木舟拖上了岸。"},{"en":"He hauled up his suitcase onto the train.","zh":"他把行李箱拎上了火车。"}]},{"partOfSpeech":"phrase","definition":{"en":"to stop or slow down suddenly, often because you realize something or see a problem","zh":"（因意识到问题等）突然停下或减速"},"examples":[{"en":"I was about to send the message, but I hauled up and reread it.","zh":"我正要发消息，但我突然停住又读了一遍。"},{"en":"The car hauled up at the red light.","zh":"车在红灯前猛地停下。"}]},{"partOfSpeech":"phrase","definition":{"en":"(nautical) to pull a rope/sail in; to bring a ship to a stop","zh":"（航海）收（绳/帆）；使船停下"},"examples":[{"en":"The captain ordered the crew to haul up the sail.","zh":"船长命令船员把帆收起来。"},{"en":"In rough weather, they hauled up and waited for the storm to pass.","zh":"在恶劣天气里，他们让船停住，等风暴过去。"}]}],"synonyms":["hoist","pull up","drag up","lift up","yank up","stop short","come to a halt"],"phonetic":"/hɔl ʌp/","extraExplanation":["在口语里，“haul up”常带有“费力、用力一把”的感觉，比“pull up”更强调吃力或重量。","英式英语里“pull up”更常用来指车辆停下；“haul up”更偏“猛地停住/突然收手”，也常见于叙述性文字。"],"etymology":"源自古英语系的“haul”（拖、拉、拽）+“up”（向上）。最初强调“用力往上拉/拖”，后来引申为“让动作/车辆突然停下”。航海用法也很常见。","mnemonic":["把它拆开记：haul≈“好累（hǎo lèi）”→因为很重所以“拖/拉”；up=“向上”，合起来就是“好累也要往上拉”。","联想场景：从井里“费力把桶拉上来”，就是 haul up。"]}
{"word":"haul video","summary":{"en":"a social-media video showing and discussing a recent batch of purchases or items received","zh":"展示并介绍最近买到或收到的一批物品的社交媒体视频"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a video (common on YouTube/TikTok) where someone shows and talks about things they recently bought or received, often from a shopping trip or online order","zh":"（常见于YouTube/TikTok的）“开箱/战利品分享”视频：展示并介绍自己最近买到或收到的一堆物品，通常来自购物或网购"},"examples":[{"en":"She posted a haul video after her trip to Seoul.","zh":"她去首尔旅行后发了一个战利品分享视频。"},{"en":"I like watching haul videos to see what’s popular this season.","zh":"我喜欢看战利品分享视频来了解这一季流行什么。"},{"en":"The creator filmed a thrift-store haul video and reviewed each item.","zh":"这位博主拍了一个二手店战利品分享视频，并逐个点评每件东西。"}]}],"synonyms":["shopping haul","unboxing video","try-on haul","purchase review","product showcase"],"phonetic":"/hɔl ˈvɪdioʊ/","extraExplanation":["常见搭配：clothing haul（衣服战利品）、makeup haul（美妆战利品）、thrift haul（二手店战利品）、back-to-school haul（开学采购分享）、holiday haul（节日购物分享）。","和 unboxing video 的区别：unboxing 更强调“拆包装开箱”的过程；haul 更强调“这一趟/这一单买到了哪些东西”的集合展示。"],"etymology":"“haul”本义是“拖/拉”，后来也可指“一次获得的一大堆东西（收获、战利品）”。社交媒体里把“展示这次买了什么”的内容固定称为“haul video”。","mnemonic":["把 haul 联想成“薅（hāo）”——薅到一大堆东西的“收获”，就像一次购物的“战利品”。","haul≈“拉走一大堆”：买完把一堆东西“搬回家”，拍成视频就是 haul video。"]}
{"word":"haulabout","summary":{"en":"“Haul about” is a nautical verb/command meaning to turn a vessel around or change course, often by pulling lines.","zh":"“haul about”是航海用语，作动词或口令，表示让船只掉头/转向，常与拉绳索调整有关。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(nautical) to turn a ship or boat around; to change to the opposite direction (often by tacking).","zh":"（航海）使船只掉头；改变到相反方向（常指换舷/改变航向）。"},"examples":[{"en":"The captain ordered the crew to haul about before the storm hit.","zh":"船长命令船员在暴风雨来临前掉头。"},{"en":"When the wind shifted, they had to haul about to keep moving forward.","zh":"风向改变后，他们不得不改变航向以继续前进。"}]},{"partOfSpeech":"other","definition":{"en":"(nautical command) an order telling the crew to turn the vessel around.","zh":"（航海口令）“掉头/转向！”——命令船员让船只转向。"},"examples":[{"en":"“Haul about!” he shouted, and the sailors pulled the lines hard.","zh":"“掉头！”他喊道，水手们用力拉绳。"},{"en":"At the cry of “haul about,” the boat swung to the new course.","zh":"听到“haul about”的口令后，船转向新的航线。"}]}],"synonyms":["turn around","change course","tack","wear (ship)"],"phonetic":"/hɔl əˈbaʊt/","extraExplanation":["“haul”本义是“用力拉、拖”，在航海语境里常指拉绳索来调整船帆或船的方向；“about”有“转过来、改变方向”的含义，所以合起来多用于传统航海/文学描写中，日常口语里更常说“turn around / change course”。","拼写上更常见的是分开写作“haul about”。把它连写成“haulabout”比较少见，可能出现在旧文本或特定术语用法中。"]}
{"word":"haulage","summary":{"en":"Haulage means freight transport (often trucking) or the distance/route goods are carried.","zh":"Haulage 指货运/运输业（常指卡车运输），也可指运输距离或路线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the business or act of transporting goods by road, rail, sea, or air (often by truck); freight transport","zh":"货运；运输业（指通过公路、铁路、海运或空运运输货物，常指卡车运输）"},"examples":[{"en":"The company provides haulage services for supermarkets across the region.","zh":"这家公司为全地区的连锁超市提供货运服务。"},{"en":"Haulage costs rose because fuel prices increased.","zh":"由于燃油价格上涨，运输成本也上升了。"}]},{"partOfSpeech":"n.","definition":{"en":"the distance or route over which something is transported","zh":"运输距离；运输路线"},"examples":[{"en":"Short-haul haulage is cheaper than long-haul haulage.","zh":"短途运输比长途运输更便宜。"}]}],"synonyms":["freight transport","trucking","shipping","carriage","transportation"],"phonetic":"/ˈhɔlɪdʒ/","extraExplanation":["“haulage”来自动词“haul”（拖、拉、运送）。在英式英语里很常见，商业语境中常与“road haulage（公路货运）”“haulage contractor（货运承包商）”“haulage rates（运价/运费）”等搭配；在美式英语里更常直接说“trucking”或“freight shipping”。","常见搭配：haulage company（货运公司）、haulage firm（货运公司）、haulage charges（运输费用）、heavy haulage（大件/重型运输）。"]}
{"word":"haulage company","summary":{"en":"a business that transports goods for a fee, especially by truck","zh":"提供收费货物运输服务的公司（常指卡车公路运输）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a business that transports goods by road, rail, or sea, especially as a paid service","zh":"货运公司；运输公司（以收费方式用公路/铁路/海运等运送货物）"},"examples":[{"en":"We hired a haulage company to deliver the machinery to the factory.","zh":"我们雇了一家货运公司把机器送到工厂。"},{"en":"The haulage company handles cross-border shipments every day.","zh":"这家运输公司每天处理跨境货运。"},{"en":"If customs delays happen, the haulage company will update the delivery time.","zh":"如果海关出现延误，货运公司会更新送达时间。"}]}],"synonyms":["trucking company","freight company","shipping company","carrier","logistics company"],"phonetic":"/ˈhɔlɪdʒ ˌkʌmpəni/","extraExplanation":["英式英语里“haulage company”很常见，尤其指公路货运（卡车运输）。美式英语更常说“trucking company”或“freight company”。","相关搭配：haulage contractor（运输承包商）、haulage rates（运价）、haulage costs（运输成本）、heavy haulage（大件/重载运输）。"],"etymology":"“haulage”来自动词“haul”（拖/拉/运送），加名词后缀“-age”表示“行为/费用/结果”，因此“haulage”常指“货物运输（尤其公路货运）”及其服务；“haulage company”就是提供该服务的公司。","mnemonic":["联想“haul=用力拉/拖”，把货“拉走运走”就是“haulage=运输”。","“-age”常把动词变成名词（如“post→postage 邮费”），所以“haul→haulage 运送/运费”。"]}
{"word":"haulages","summary":{"en":"“Haulages” is the plural of “haulage,” meaning road freight transport (or the act/cost of transporting goods).","zh":"“haulages”是“haulage”的复数，指公路货运运输（也可指运输行为或费用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The transport of goods, especially by truck (road freight).","zh":"（尤指用卡车的）货运；公路货运。"},"examples":[{"en":"The company specializes in haulage across the Midwest.","zh":"这家公司专门做横跨中西部的公路货运。"},{"en":"We need to arrange haulage for the construction materials.","zh":"我们需要为建筑材料安排运输。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of hauling something, or the cost/charge for transporting it.","zh":"拖运/运输这一行为；或运输费用。"},"examples":[{"en":"Haulage is included in the total price.","zh":"总价中包含运费。"},{"en":"They negotiated lower haulage costs for long-distance deliveries.","zh":"他们为长途配送谈到了更低的运输费用。"}]}],"synonyms":["trucking","freight hauling","road freight","transportation","shipping"],"phonetic":"ˈhɔlɪdʒ","extraExplanation":["“haulages”通常是名词复数，用来指多批/多次运输业务或不同线路的运输服务，例如：international haulages（多项国际运输业务）。","在英式英语里“haulage”非常常见（如 haulage company）；美式英语更常说 trucking、freight hauling 或 shipping。"]}
{"word":"haulageway","summary":{"en":"A haulageway is a route—often in a mine—used to haul or transport materials.","zh":"haulageway 指用于拖运/运输物料的通道或线路，常见于矿井运输巷道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a road, track, or passage used for hauling (moving) materials—especially an underground route in a mine where coal or ore is transported","zh":"用于牵引/运输物料的道路、轨道或通道；尤指矿井内用于运送煤或矿石的运输巷道"},"examples":[{"en":"The miners cleared debris from the haulageway to reopen the route for coal carts.","zh":"矿工清理了运输巷道里的碎石，让运煤车重新通行。"},{"en":"Ventilation and lighting must be checked regularly along the haulageway.","zh":"运输巷道沿线必须定期检查通风和照明。"}]}],"synonyms":["haul road","haulage road","transport route","mine roadway","tramway (mining)"],"phonetic":"/ˈhɔlɪdʒˌweɪ/","extraExplanation":["“haulageway”多见于采矿、地下工程、安全规范等语境，强调“运送路线”的功能性（运煤、运矿、运料），而不只是一般意义的“通道”。","在矿业英语里常与 haulage（运输作业）、haulage road/route（运输道路/线路）、drift/entry（平巷/入口巷道，依矿井类型而定）等词一起出现。"]}
{"word":"haulaway","summary":{"en":"“Haulaway/haul away” means to pull hard (often as a shouted command), to drag something away, and it can also be a chorus cry in sea shanties to keep everyone pulling in rhythm.","zh":"“haulaway/haul away”表示（口令式）用力拉、把东西拖走/拉走；在海员号子中也可指用于统一节奏的副歌呼喊。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(as a command) to pull something hard, often together with other people; to haul off and away.","zh":"（口令）用力拉（常指多人一起用力）；把东西拉开、拉走。"},"examples":[{"en":"On the count of three—haul away!","zh":"数到三——用力拉！"},{"en":"They grabbed the rope and hauled away until the boat moved.","zh":"他们抓住绳子拼命拉，直到船动起来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to remove or take something away by hauling (pulling or dragging).","zh":"把……拖走/拉走；用拖拽的方式移走。"},"examples":[{"en":"The crew hauled away the heavy net after the catch.","zh":"捕捞后，船员把沉重的渔网拖上来并拉走。"},{"en":"We need a truck to haul away the old furniture.","zh":"我们需要一辆卡车把旧家具拉走。"}]},{"partOfSpeech":"n.","definition":{"en":"(in sea shanties) a repeated cry or chorus used to coordinate pulling in time.","zh":"（海员号子/船歌中）反复呼喊的衬词或副歌，用来统一节奏、配合拉拽。"},"examples":[{"en":"The song’s chorus goes, “Haul away!” as everyone pulls together.","zh":"歌的副歌唱“Haul away!”大家就一起用力拉。"}]}],"synonyms":["pull","drag","tug","tow away","cart off"],"phonetic":"/hɔl əˈweɪ/","extraExplanation":["“haul away”常见于航海语境，尤其是海员号子（sea shanty）里：领唱一句，众人用“haul away!”之类的短句应和，借此把拉绳、起锚、升帆等动作的发力点对齐（类似中文劳动号子）。","写作“haulaway”连写并不常见；更常见的形式是分开写“haul away”。如果你是在歌词或航海文本里看到连写，通常也按同样含义理解。"]}
{"word":"haulback","summary":{"en":"Haulback (more often written “haul back”) means pulling something back with effort, or figuratively taking back a statement/decision; it can also be a noun for the act of pulling back a load or gear.","zh":"haulback（更常写作 haul back）指费力往回拉；也可比喻为收回言论/决定；还可作名词表示“回拉/回收”的过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to pull something back toward you, often with effort (for example, a rope, net, fishing line, or heavy object).","zh":"把某物费力地往回拉（如绳子、网、钓线或重物）。"},"examples":[{"en":"The fishermen hauled back the net slowly.","zh":"渔民慢慢把渔网往回拉。"},{"en":"Haul back the rope when I say “now.”","zh":"我说“现在”的时候把绳子往回拉。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to take back a statement or decision; to retreat from a strong position.","zh":"（比喻）收回说法或决定；从强硬立场上退让。"},"examples":[{"en":"After the backlash, the company hauled back its earlier promise.","zh":"在舆论反弹后，公司收回了先前的承诺。"},{"en":"He refused to haul back his comments, even after he apologized.","zh":"即使道了歉，他也不肯收回自己的话。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially fishing/boating/forestry) the act or process of pulling equipment, a catch, or a load back to a boat, shore, or landing area.","zh":"（尤指捕鱼/航运/林业）把器具、渔获或货物拉回船上、岸边或集散点的过程。"},"examples":[{"en":"The haulback took longer because the current was strong.","zh":"因为水流很急，回拉（收回）过程花了更久。"}]}],"synonyms":["pull back","draw back","retract","take back","walk back"],"phonetic":"/ˈhɔlˌbæk/","extraExplanation":["“haul back”更常见的写法是分开写（haul back）。合写“haulback”在一些行业语境里会当作名词用（例如描述“回拉/回收”的步骤）。在日常英语里，如果你想表达“收回（言论/决定）”，也常用更口语的“walk back”。"]}
{"word":"hauld","summary":{"en":"Hauld is a Scots/dialect spelling meaning “hold” (to keep or grip), and sometimes refers to a grip itself.","zh":"Hauld 是苏格兰/方言拼写，意思相当于“hold”（握住、保持），也可指“抓握/把持”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots/Northern English, dialect) to hold; to keep in your hand or keep control of something.","zh":"（苏格兰/英格兰北部方言）握住；拿着；控制住某物。"},"examples":[{"en":"Hauld my hand while we cross the road.","zh":"我们过马路时你握着我的手。"},{"en":"He could hardly hauld his temper.","zh":"他几乎控制不住自己的脾气。"}]},{"partOfSpeech":"n.","definition":{"en":"(dialect) a hold or grip; the act of holding on.","zh":"（方言）抓握；把持；握住的动作或状态。"},"examples":[{"en":"Keep a firm hauld on the rope.","zh":"把绳子抓牢。"}]}],"synonyms":["hold","grip","clasp","keep","retain"],"phonetic":"/hoʊld/","extraExplanation":["“hauld”多见于苏格兰英语（Scots）或英格兰北部方言，是标准英语“hold”的拼写变体，用来呈现口音与地域色彩。读到文学作品或歌词里（例如带苏格兰风格的诗歌/民谣）出现“hauld”，通常按“hold”来理解即可。","在现代日常标准书面英语中较少用；如果你是在作业、邮件或正式写作里想表达“握住/保持”，一般用“hold”。如果你想表达过去式“拖/拉/运（haul）”的发音或误拼，也有人把“hauled”写成类似“hauld”，但标准拼写是“hauled”。"]}
{"word":"hauled","summary":{"en":"Hauled means ‘pulled/dragged with effort’ or ‘transported a load’; informally, it can also mean ‘taken somewhere by force (e.g., to court or by police).’","zh":"hauled 表示“费力地拖/拉”或“运送（货物）”；非正式用法也可指“被强制带去某处（如上法庭、被警察带走）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of haul) Pulled or dragged something heavy with effort; transported something (often a load) from one place to another.","zh":"（haul 的过去式/过去分词）用力拖/拉某个很重的东西；（常指载货）把某物运到另一处。"},"examples":[{"en":"They hauled the broken sofa up the stairs.","zh":"他们把坏掉的沙发用力拖上楼。"},{"en":"The truck hauled sand to the construction site all morning.","zh":"那辆卡车一上午都在把沙子运到工地。"},{"en":"After the storm, volunteers hauled fallen branches off the road.","zh":"暴风雨过后，志愿者把倒下的树枝从路上拖走。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) Brought someone to a place, especially to a court, police station, or meeting, often unwillingly.","zh":"（非正式）把某人带到某处（尤指法庭、警局或会议），常带有“不情愿/被强制”的意味。"},"examples":[{"en":"He was hauled into court for breaking the contract.","zh":"他因违约被带上法庭。"},{"en":"The protester was hauled away by police.","zh":"抗议者被警察带走了。"}]}],"synonyms":["pulled","dragged","towed","transported","carried","carted"],"phonetic":"/hɔld/","extraExplanation":["“haul”常暗示“费力、重物、距离较远”，比“pull/drag”更强调负重或运输（haul a boat, haul goods）。","常见相关短语：haul in（逮捕；拉网捕鱼/收获很多）、haul off（突然打/打算打；也可指“猛地拉开”）、long haul（长期；长途）。"]}
{"word":"hauler","summary":{"en":"A hauler is a person/company or a truck that carries goods, often heavy loads.","zh":"Hauler 指运货的人/公司或运载重物的车辆（常见为卡车）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company that transports goods, often by truck; a carrier.","zh":"运输工人或运输公司（常指用卡车运货的人/公司）；承运人。"},"examples":[{"en":"The store hired a local hauler to deliver furniture.","zh":"这家店雇了一家本地运输公司来送家具。"},{"en":"Waste haulers collect trash from homes every week.","zh":"垃圾清运公司每周从住户处收集垃圾。"}]},{"partOfSpeech":"n.","definition":{"en":"A vehicle, especially a truck, used to carry heavy loads.","zh":"（尤指）用于运载重物的车辆；重型卡车。"},"examples":[{"en":"A long-haul hauler rumbled down the highway.","zh":"一辆长途货运卡车轰隆隆地驶过高速公路。"},{"en":"They rented a hauler to move building materials.","zh":"他们租了一辆运输车来搬运建材。"}]}],"synonyms":["carrier","transporter","trucker","freight company"],"phonetic":"/ˈhɔlər/","extraExplanation":["“Hauler”来自动词“haul”（用力拖/拉/运送）。在美式英语里很常见于复合词：waste hauler（垃圾清运商）、heavy hauler（重载运输车/承运商）、long-haul truck/hauler（长途货车/司机）。","在日常语境中，“hauler”偏口语和行业用语；更正式时也可用“carrier”（承运人/承运公司）或“transporter”（运输者/运输公司）。"]}
{"word":"haulers","summary":{"en":"“Haulers” means people or vehicles that transport goods or heavy materials, often professionally.","zh":"“Haulers”指运送货物或重物的人员或车辆，常用于职业或行业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or vehicles that carry or transport goods, materials, or freight (often for a job).","zh":"运货的人；运输车辆；（常指职业性的）货运承运者。"},"examples":[{"en":"The haulers delivered gravel to the construction site early in the morning.","zh":"运货车一大早把碎石送到了工地。"},{"en":"Local haulers pick up trash and recyclables once a week.","zh":"本地的清运公司每周收一次垃圾和可回收物。"}]}],"synonyms":["carriers","transporters","truckers","freight haulers"],"phonetic":"/ˈhɔlɚz/","extraExplanation":["“Haulers”是“hauler”的复数。它来自动词“haul”（用力拖/拉；运送），所以语感上常带有“运送重物、长距离或需要力气/设备”的感觉。","在美式英语里，hauler 常指卡车（如 long-haul truck/18-wheeler）或从事运输的公司/司机；在行业语境中也可能指“垃圾清运车/清运公司”（trash hauler）。"]}
{"word":"haulier","summary":{"en":"A haulier is a person or company that transports goods by truck (road freight), especially in British English.","zh":"Haulier 指用卡车进行公路货运的承运人或货运公司（英式用法更常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that transports goods by road, usually in a truck","zh":"（通常用卡车）通过公路运输货物的承运人；货运公司"},"examples":[{"en":"The factory hired a local haulier to deliver the parts to the port.","zh":"工厂雇了一家本地货运公司把零件运到港口。"},{"en":"Our haulier can collect the shipment tomorrow morning.","zh":"我们的承运人可以明天上午来提货。"}]}],"synonyms":["trucker","trucking company","carrier","freight company","road hauler"],"phonetic":"/ˈhɔːliər/","extraExplanation":["“Haulier”在英式英语中更常见；美式英语里更常用“trucker”“trucking company”或“carrier”。在物流语境中，haulier强调“陆路（公路）承运/运输”这一环节，常与“freight”“shipment”“delivery”等词搭配。词根来自“haul”（用力拉/拖，引申为长距离运输）。"]}
{"word":"hauliers","summary":{"en":"Hauliers are people or companies that transport goods, especially by truck.","zh":"hauliers 指（尤指用卡车）运输货物的人或公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or companies that transport goods, especially by truck (a common term in British English).","zh":"（尤指用卡车）运输货物的人或公司（常见于英式英语）。"},"examples":[{"en":"Local hauliers delivered the building materials to the site.","zh":"当地的货运承运商把建筑材料送到了工地。"},{"en":"The factory relies on hauliers to move products across the country.","zh":"这家工厂依靠货运公司把产品运往全国各地。"},{"en":"Because of bad weather, several hauliers were delayed on the highway.","zh":"由于天气恶劣，几家货运承运商在高速上被耽搁了。"}]}],"synonyms":["carriers","trucking companies","freight haulers","transporters"],"phonetic":"/ˈhɔliərz/","extraExplanation":["“hauliers”是“haulier”的复数，来自动词“haul”（用力拉/拖；运送）。在英国商业与物流语境中很常用，常见搭配有“road haulier（公路货运公司/卡车承运商）”“haulage（货运；运输业务）”。在美式英语里更常说“trucking company”“carrier”或“freight hauler”。"]}
{"word":"hauling","summary":{"en":"“Hauling” means pulling or transporting something heavy, or the work of doing that.","zh":"“hauling”指拖拉或运输重物，或指搬运/拖运这类工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of pulling or carrying something heavy from one place to another (often as a job)","zh":"搬运；拖运（通常指工作中把重物从一处运到另一处）"},"examples":[{"en":"The job involves a lot of hauling and lifting.","zh":"这份工作需要经常搬运和抬举重物。"},{"en":"After the storm, people spent the morning hauling fallen branches away.","zh":"暴风雨过后，人们花了一上午把倒下的树枝拖走。"}]},{"partOfSpeech":"v.","definition":{"en":"pulling or carrying something heavy, usually with effort","zh":"（费力地）拖；拉；搬运（重物）"},"examples":[{"en":"They were hauling boxes up the stairs.","zh":"他们正把箱子费力地搬上楼。"},{"en":"The truck was hauling sand to the construction site.","zh":"卡车正把沙子运到工地。"},{"en":"He kept hauling on the rope until the boat came closer.","zh":"他一直用力拉绳子，直到船靠近。"}]}],"synonyms":["pulling","lugging","dragging","transporting","carting"],"phonetic":"/ˈhɔlɪŋ/","extraExplanation":["“haul”常用于表示“费力移动重物”，语感上比“carry/bring”更强调重量、距离或体力消耗。","在美式英语中，和车辆搭配很常见：a truck hauling goods（卡车运货）。","固定搭配：haul up（把……拖上来/突然停下并训斥）、haul away/off（拖走）、haul in（把……拉进来/（非正式）赚到很多钱）。"]}
{"word":"haulm","summary":{"en":"Haulm means a plant’s dry stem or stalk (often cereal straw or stubble) left after harvesting.","zh":"haulm 指植物（常为谷物）收割后的干茎秆，即秸秆或残茬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The dry stem or stalk of a plant (especially cereal plants like wheat or barley) after the grain has been removed; straw or stubble.","zh":"（尤指小麦、大麦等谷物的）秸秆、茎秆；收割后留下的茬、麦秆。"},"examples":[{"en":"After the harvest, the field was covered with haulm and stubble.","zh":"收割后，田里满是秸秆和残茬。"},{"en":"Farmers sometimes burn the haulm, but many now use it for compost or animal bedding.","zh":"农民有时会烧掉秸秆，但现在很多人会把它用来堆肥或做牲畜垫料。"}]}],"synonyms":["stalk","stem","straw","stubble"],"phonetic":"/hɔːm/","extraExplanation":["“haulm”是较偏英式、农业/文学语境的词，在日常英语里更常见的是“stalk(s) / straw / stems / stubble”等。","词源上与“茎、秆”的概念相关；在园艺语境中也可指某些植物（如豌豆、豆类等）的藤蔓/茎秆。","发音里 /ɔː/ 类似于美式英语中“all”的元音。"]}
{"word":"haulmier","summary":{"en":"“Haulmier” isn’t a standard word; it’s likely a misspelling of “haulier” (goods transporter).","zh":"“haulmier”不是标准词；多半是把“haulier”（货运承运人/货运公司或司机）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of “haulier” (a company or person that transports goods by truck).","zh":"不是标准英语词；很可能是 “haulier”（货运承运人/卡车货运公司或司机）的拼写错误。"},"examples":[{"en":"I think you mean “haulier”: a local haulier delivers goods to the supermarket.","zh":"你可能想写 “haulier”：一家本地货运公司把货物送到超市。"},{"en":"The factory uses a haulier to ship products across the country.","zh":"这家工厂用一家货运承运人把产品运到全国各地。"}]},{"partOfSpeech":"other","definition":{"en":"If you intended “haul” (verb): to pull or carry something heavy, often with effort.","zh":"如果你想写的是 “haul”（动词）：（费力地）拖/拉/搬运很重的东西。"},"examples":[{"en":"They had to haul the boxes up the stairs.","zh":"他们不得不把箱子费力地搬上楼。"},{"en":"He hauled his suitcase through the airport.","zh":"他拖着行李箱穿过机场。"}]}],"synonyms":["carrier","freight company","trucking company","truck driver"],"phonetic":"ˈhɔliər","extraExplanation":["“Haulier”更常见于英式英语（BrE），在美式英语（AmE）里更常用的说法是 “trucking company”（卡车运输公司）或 “truck driver”（卡车司机）。","如果你是在某个行业/运输文件里看到 “haulmier”，也可能是品牌名、公司名或姓氏；可以把原句发来，我能帮你判断具体含义。"]}
{"word":"haulmiest","summary":{"en":"“Haulmiest” means “having the most dry crop stalks (haulm); most stalky.”","zh":"“haulmiest”表示“秆（枯茎）最多的；最茎秆繁杂的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of haulmy) Having the most haulm (dry stalks or stems of crops like peas, beans, or potatoes); most stalky/most full of plant stems.","zh":"（haulmy 的最高级）含有最多“作物枯茎/秆”（如豌豆、豆类或土豆的茎叶）；最“秆多”的、茎叶最繁茂（或最杂乱）的。"},"examples":[{"en":"After harvest, the back field looked the haulmiest, covered with dry pea stalks.","zh":"收割后，后面的田地看起来最“秆多”，到处都是干燥的豌豆茎。"},{"en":"This patch is the haulmiest part of the garden, so it needs clearing before planting.","zh":"这块地是花园里茎秆最杂最多的地方，所以播种前需要先清理。"}]}],"synonyms":["stalkiest","most stalky","full of stalks","stemmiest"],"phonetic":"/ˈhɔl.mi.ɪst/","extraExplanation":["“haulm”是农业/园艺里比较常见的词，指豆类、豌豆、土豆等植物的茎叶（尤其是枯干后剩下的秆）。在美式日常英语中较少见，更常见于英式或农业语境。","“haulmiest”来自形容词“haulmy（茎秆多的）”，属于非常少用的最高级形式；现代口语里常用“stalkiest / most stalky / full of stalks”来表达类似意思。"]}
{"word":"haulms","summary":{"en":"“Haulms” means the stems or stalks of certain plants, especially crop plants, often after harvesting.","zh":"“haulms”指某些作物植物的茎或秆，常用于描述收割后留下的地上茎叶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the stalks or stems of plants (especially peas, beans, or potatoes), often left after harvesting","zh":"（尤指豌豆、豆类或马铃薯等作物的）茎、秆；（收割后留下的）藤蔓/秸秆"},"examples":[{"en":"After the peas were picked, the haulms were dried and used for animal bedding.","zh":"豌豆采摘后，茎秆被晒干用作牲畜垫料。"},{"en":"Farmers cleared the potato haulms before lifting the potatoes.","zh":"农民在挖马铃薯前会先清理马铃薯的地上茎叶。"}]}],"synonyms":["stems","stalks","vines","plant tops"],"phonetic":"/hɔlm/","extraExplanation":["“haulms”是“haulm”的复数形式，在英式农业语境中更常见；在美式英语里，人们更常说“stems / stalks / vines / plant tops”。","在马铃薯种植中，“potato haulm(s)”常指地上部分的茎叶；收获前处理这些茎叶有助于采收与储存。"]}
{"word":"haulmy","summary":{"en":"“Haulmy” isn’t a standard word; it likely refers to “haul,” meaning to pull/carry with effort, or “a haul,” meaning a large amount collected.","zh":"“haulmy”不是标准英语词；多半指“haul”，意为用力拖/搬运；或名词“a haul”，指一大批收获/获得物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Not a standard English word) Likely a misspelling of “haul.” “Haul” means to pull or carry something heavy, often with effort.","zh":"（不是标准英文单词）很可能是“haul”的拼写错误。“haul”指用力拖、拉或搬运（通常是很重的东西）。"},"examples":[{"en":"Could you help me haul this sofa upstairs?","zh":"你能帮我把这张沙发搬到楼上吗？"},{"en":"They hauled the fishing nets onto the boat.","zh":"他们把渔网拖上了船。"}]},{"partOfSpeech":"n.","definition":{"en":"A large amount of something gained or collected (often money, goods, or items).","zh":"（收获、获得的）一大批/大量（常指钱、货物或物品）。"},"examples":[{"en":"The thieves got away with a huge haul of jewelry.","zh":"小偷带着一大批珠宝逃走了。"},{"en":"We brought back a haul of snacks for the trip.","zh":"我们为旅行带回了一大堆零食。"}]}],"synonyms":["drag","pull","lug","tow","transport","carry"],"phonetic":"/hɔl/","extraExplanation":["“haulmy”在英语里通常没有固定含义。如果你是在短信/游戏ID/网名里看到它，可能是拼写创意或把两个词连在一起。你也可以告诉我它出现的完整句子，我可以帮你判断真实意思。","常见相关搭配：haul something away（把……拖走/运走），haul up（把……拉上来；也可指“突然停下/严厉责备”取决于语境），long haul（长途；长期的努力）。"]}
{"word":"hauls","summary":{"en":"“Hauls” can mean (1) pulls/moves or transports something with effort (verb), or (2) large amounts gained or collected (noun).","zh":"“Hauls”可指（1）用力拖拉/运输（动词），也可指（2）一次获得或收集到的大量东西（名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “haul”) to pull or move something heavy with effort; or to transport something (often over a distance).","zh":"（动词，haul 的第三人称单数）用力拖/拉沉重的东西；或（常指长距离）运输、搬运。"},"examples":[{"en":"She hauls the suitcase up the stairs by herself.","zh":"她自己把行李箱用力拖上楼。"},{"en":"The truck hauls food to nearby towns every day.","zh":"这辆卡车每天把食物运到附近的城镇。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural of “haul”) a large amount that is gained or collected, especially money, fish, or stolen goods (often in the phrase “a big haul”).","zh":"（名词，haul 的复数）一次获得/收集到的大量东西（尤指钱、鱼或赃物；常见搭配 a big haul “大收获”）。"},"examples":[{"en":"The police reported several hauls of illegal drugs this month.","zh":"警方报告说本月查获了好几批非法毒品。"},{"en":"After the sale, the shop had two big hauls of donations to deliver.","zh":"义卖结束后，店里有两大批捐赠物资要运送。"}]}],"synonyms":["pull","drag","tow","lug","transport","carry","load","takeaway"],"phonetic":"/hɔl/","extraExplanation":["“haul”常带有“费力、沉重”的感觉，比“carry（携带）”更强调用力拖拉或大规模运输。","在新闻或口语里，“a big haul”很常见，表示“缴获/收获很多”。渔业里也会说“a haul of fish（一网鱼/一批鱼获）”。"]}
{"word":"haulse","summary":{"en":"“Haulse” is not standard; you probably mean “haul,” meaning to pull/transport something heavy or a long, tiring effort or journey.","zh":"“haulse”不是标准拼法；你可能想写“haul”，意思是用力拖/运重物，或指漫长费力的行程/过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely misspelling) to pull or carry something heavy, often with effort, over a distance.","zh":"（可能是拼写错误）用力拖、拉或运送（重物），通常指经过一段距离。"},"examples":[{"en":"They had to haul the boxes up the stairs.","zh":"他们不得不用力把箱子拖上楼。"},{"en":"The truck hauled sand to the construction site all day.","zh":"那辆卡车整天把沙子运到工地。"}]},{"partOfSpeech":"n.","definition":{"en":"a long or difficult journey or effort, especially one that feels tiring.","zh":"长途（或费力的）行程；艰难而耗力的过程。"},"examples":[{"en":"It’s a long haul from here to Chicago.","zh":"从这里到芝加哥是一段长途路程。"},{"en":"Finishing the project was a tough haul for the whole team.","zh":"完成这个项目对整个团队来说是一场硬仗。"}]}],"synonyms":["pull","drag","tow","transport","lug"],"phonetic":"/hɔl/","extraExplanation":["“haulse”不是常见英语单词，最可能是把“haul”（拖/运）拼错了。若你想表达“运输/拖拽”，通常用“haul”；若想表达“猛拉一下”，更常见的是“yank”或“pull”。","“long haul”是高频搭配，表示“长期、费时费力的过程/长途”。例如：in it for the long haul（打算长期坚持/长期投入）。"]}
{"word":"haulster","summary":{"en":"“Haulster” is not standard; it is most likely a misspelling of “holster.”","zh":"“haulster”不是标准用词；最可能是把“holster（枪套/工具套）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling of “holster” (a holder for a gun or tool, usually worn on a belt).","zh":"“holster（枪套/工具套）”的非标准拼写（常见于拼写错误）。"},"examples":[{"en":"I think you mean “holster,” not “haulster.”","zh":"你可能想写的是“holster”，不是“haulster”。"},{"en":"The officer wore his pistol in a holster on his belt.","zh":"那名警官把手枪放在腰带上的枪套里。"}]}],"synonyms":["holster","gun holster","sheath"],"phonetic":"/ˈhoʊlstɚ/","extraExplanation":["“haulster”在标准英语词典中一般不作为常用词条出现，最常见的情况是把“holster”误拼了。","“holster”常用在执法、军队、射击运动，以及一些工种（例如工具套：hammer holster/knife holster）的语境里。"]}
{"word":"hault","summary":{"en":"“hault” is usually a misspelling of “halt,” meaning to stop or a stop/pause.","zh":"“hault”通常是“halt”的拼写错误，意思是“停止”或“停顿/暂停”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Commonly a misspelling) to stop; to pause movement or an action.","zh":"（常见拼写错误）停止；暂停（行动或移动）。"},"examples":[{"en":"The bus halted at the next stop.","zh":"公交车在下一站停了下来。"},{"en":"Please halt for a moment and listen.","zh":"请停一下，听我说。"}]},{"partOfSpeech":"n.","definition":{"en":"a stop; a pause in movement or progress.","zh":"停顿；中止；暂停。"},"examples":[{"en":"We came to a halt in traffic.","zh":"我们在车流中停了下来。"},{"en":"After a brief halt, the meeting continued.","zh":"短暂停顿后，会议继续进行。"}]},{"partOfSpeech":"adj.","definition":{"en":"unable to walk normally; limping.","zh":"跛的；一瘸一拐的。"},"examples":[{"en":"After the injury, he had a halt step.","zh":"受伤后，他走路有点跛。"}]}],"synonyms":["stop","pause","cease","stand still"],"phonetic":"/hɔlt/","extraExplanation":["“hault”通常不是标准英文拼写；你很可能想写的是 **halt**（停止）。另外也有人把 **haul**（拖/拉/运送）拼错成“hault”。如果你告诉我句子原文，我可以帮你确认到底该用哪个词。","词源小提示：**halt** 有“停住”的意思，在一些标志语中很常见（如“HALT”表示“停”）。在文学或较正式的叙述里也常用来写“行进突然停止/进展中断”。"]}
{"word":"haulyard","summary":{"en":"A nautical rope/line for hoisting and lowering sails or flags.","zh":"航海用语：用于升降帆或旗帜的绳索/索具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rope or line used on a boat or ship to raise and lower a sail, flag, or yard (spar).","zh":"（船上）用来升降帆、旗帜或帆桁（横杆）的绳索/索具。"},"examples":[{"en":"He pulled on the halyard to hoist the sail.","zh":"他拉动升帆索把帆升起来。"},{"en":"The flag was snapping in the wind at the top of the mast, tied to the halyard.","zh":"旗帜系在旗索上，在桅杆顶端迎风猎猎作响。"}]}],"synonyms":["line","rope","rigging"],"phonetic":"/ˈhæljərd/","extraExplanation":["“haulyard”在现代英语里更常见的拼写是 **halyard**（读音不变）。很多人会把它理解为“haul + yard”，但它实际上是航海用语，指升降帆或旗的绳索（索具）。","词源上与“haul（拉、拖）”有关，属于帆船时代的专门词汇；在航海小说或海事写作中很常见。"]}
{"word":"haulyards","summary":{"en":"Halyards are the ropes on a boat used to raise and lower sails or flags.","zh":"Halyards 指船上用来升降帆或旗帜的绳索（升帆索/升旗索）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) Ropes or lines on a boat used to raise, lower, or control sails, flags, or other rigging; singular: halyard.","zh":"（通常用复数）船上用来升降或控制帆、旗帜等索具的绳索；单数：halyard（升帆索/升旗索）。"},"examples":[{"en":"The sailor tightened the halyards to raise the mainsail.","zh":"水手拉紧升帆索，把主帆升起来。"},{"en":"Strong wind made the halyards slap loudly against the mast.","zh":"大风让升帆索不停拍打桅杆，发出很大的声音。"},{"en":"They lowered the flag by easing the halyard.","zh":"他们放松升旗索，把旗帜降了下来。"}]}],"synonyms":["sail line","rope (nautical)","rigging line"],"phonetic":"/ˈhæljɚdz/","extraExplanation":["“haulyards”多被视为“halyards”的变体拼写或误拼，尤其在非航海语境里更常见。标准拼写是“halyards”。","词源上与“haul”（拉、拖）有关：本质就是“用来拉动的绳索”。在海事英语中非常常见，也常出现在航海文学或海盗题材作品里。"]}
{"word":"haum","summary":{"en":"“Haum” is a Scottish dialect word meaning “home,” and it can also mean “to drive animals home.”","zh":"“haum”是苏格兰方言词，意思是“家”，也可作动词表示“把牲畜赶回家/赶回圈”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) home; the place where you live.","zh":"（苏格兰方言）家；住处。"},"examples":[{"en":"I’m heading back to my haum after work.","zh":"下班后我要回家。"},{"en":"He felt happiest when he was at his haum.","zh":"他在家时最开心。"}]},{"partOfSpeech":"v.","definition":{"en":"(Scotland, dialect) to take (animals) home; to drive cattle home.","zh":"（苏格兰方言）把（牲畜）赶回家；把（动物）带回圈。"},"examples":[{"en":"They haum the sheep before nightfall.","zh":"他们在天黑前把羊赶回去。"},{"en":"The farmer went out to haum the cattle.","zh":"农夫出去把牛赶回圈。"}]}],"synonyms":["home","house (context-dependent)"],"phonetic":"/hɑm/","extraExplanation":["“haum”在现代标准英语里不常见，多见于苏格兰英语/方言写法，常对应标准英语的“home”。在日常学习中，如果你的目标是通用英语，通常用“home”。","如果你是想查别的常用词，可能是拼写接近的：ham（火腿/腘绳肌）、harm（伤害）、haul（拖/拉/运）、haulm（植物茎秆，较少见）。你可以告诉我语境，我也可以帮你确认。"]}
{"word":"haunce","summary":{"en":"“Haunce” is a rare/archaic spelling of “haunch” (hip/upper leg; or a cut of meat).","zh":"“haunce”是“haunch”的罕见/古用拼写（臀部与大腿上部；或该部位的肉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or variant spelling) the haunch: the hip and upper part of an animal’s (or person’s) leg; also, a cut of meat from that area.","zh":"（古用或异拼）同 haunch：臀部与大腿上部（人或动物）；也指该部位的肉（后腿肉/臀腿肉）。"},"examples":[{"en":"In some older texts, you may see “haunce” where modern English uses “haunch.”","zh":"在一些较旧的文本中，你可能会看到“haunce”，其现代英语对应词是“haunch”。"},{"en":"The hunter carried the deer by the haunches.","zh":"猎人扛着鹿的后腿（臀腿部）走。"}]}],"synonyms":["haunch","hip","thigh (upper part)","hindquarter"],"phonetic":"/hɔntʃ/","extraExplanation":["“haunce”在现代英语中非常少见，多为“haunch”的旧拼或异拼。日常写作与学习建议使用更常见的拼写“haunch”。","“haunch”在文学描写中常用于表现动物的姿态与力量（如“crouch on its haunches”表示“蹲伏/后腿着地蹲着”）。"]}
{"word":"haunch","summary":{"en":"Haunch means the back hip and upper back leg of an animal, or a cut of meat from that part.","zh":"Haunch 指动物的后臀与后腿上部，也可指该部位的肉（后腿/后臀肉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the back hip and upper part of the back leg of an animal (or a similar part of the human body)","zh":"（动物的）臀部及后腿上部；（人的）臀部与大腿后侧相近部位"},"examples":[{"en":"The deer disappeared into the trees, its haunches moving powerfully.","zh":"那只鹿钻进树林里，强壮的后臀有力地摆动着。"},{"en":"The dog sat on its haunches and waited for a treat.","zh":"那只狗后腿着地坐着，等着吃零食。"}]},{"partOfSpeech":"n.","definition":{"en":"a hindquarter cut of meat (the back leg/hip area), especially of animals like deer or rabbits","zh":"后腿肉；后臀肉（常指鹿、兔等动物的后腿/臀部部位的肉）"},"examples":[{"en":"They roasted a haunch of venison for dinner.","zh":"他们晚餐烤了一整块鹿后腿肉。"},{"en":"The recipe calls for a haunch of rabbit, slowly braised.","zh":"这道食谱需要一块兔后腿肉，慢慢炖煮。"}]}],"synonyms":["hindquarters","hip","rear","thigh (of an animal)"],"phonetic":"/hɔntʃ/","extraExplanation":["“Sit on its haunches”是很常见的搭配，意思是“动物用后腿坐着/蹲着”，常用来描写狗、猫、兔子等的姿势。","在英式与美式英语中，haunch多用于动物身体或肉类部位的表达；描述人的身体时更常用hip（髋/臀）或buttocks（臀部）等词。"]}
{"word":"haunched","summary":{"en":"“Haunched” usually describes a beam/arch that is thickened or strengthened near its support; outside engineering it’s uncommon.","zh":"“Haunched”多用于建筑/工程，指梁或拱在支座附近加厚或加固（加腋/拱肩）；日常英语中不太常见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Architecture/engineering) Made with a thicker, raised, or strengthened part near the support (the “haunch”)—for example, a haunched beam or a haunched arch.","zh":"（建筑/工程）在靠近支座处做成加厚、抬高或加固的“拱肩/梁肩（haunch）”结构；如加腋梁、加腋拱。"},"examples":[{"en":"The bridge uses haunched girders to handle heavier loads near the supports.","zh":"这座桥使用加腋梁，使靠近支座处能承受更大的荷载。"},{"en":"A haunched arch can be stronger where the arch meets the wall.","zh":"加腋拱在拱与墙体相接处通常更结实。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “haunch” (rare): to provide or form a haunch (a thickened supporting part) on a structure.","zh":"“haunch”的过去式/过去分词（较少见）：在结构上做出或加上拱肩/梁肩（加厚的支撑部分）。"},"examples":[{"en":"The concrete beam was haunched at both ends for extra strength.","zh":"这根混凝土梁在两端做了加腋处理以增强强度。"}]}],"synonyms":["reinforced (near the support)","thickened","strengthened"],"phonetic":"/hɔntʃt/","extraExplanation":["“haunched”常见于建筑与结构工程语境，日常英语里更常遇到的是“hunched”（弓背的、佝偻的；如 hunched shoulders）。两者拼写和发音接近，但意思不同：haunch=臀部/拱肩（结构加厚处），hunch=弓背/蜷缩、直觉。"]}
{"word":"hauncher","summary":{"en":"Hauncher is a rare noun related to sitting or crouching on the haunches (hips and upper legs).","zh":"Hauncher 是一个罕见名词，和“蹲坐/臀部与大腿上部（haunches）”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A person or animal that sits, crouches, or moves on its haunches (the hips and upper legs).","zh":"（罕见）指坐在、蹲在或用“臀部/后腿上部”（haunches）支撑身体的人或动物。"},"examples":[{"en":"The dog became a hauncher, waiting calmly by the door.","zh":"那只狗蹲坐在门边，安静地等待。"},{"en":"In the cold, the hiker turned into a hauncher beside the fire.","zh":"在寒冷中，那位徒步者蜷蹲在火堆旁。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A tool or object used to support something at the haunch or hip area; a “hip support.”","zh":"（罕见）用于支撑臀部或髋部位置的工具/装置；一种“髋部支撑”。"},"examples":[{"en":"The costume included a simple hauncher to hold the heavy fabric away from the legs.","zh":"这套服装配了一个简单的髋部支撑，用来把厚重布料撑离腿部。"}]}],"synonyms":["squatter","croucher"],"phonetic":"/ˈhɔntʃər/","extraExplanation":["“hauncher”在现代英语里非常少见，很多情况下人们想表达的是：\n1）“sit on one’s haunches / squat”（蹲下、蹲坐）；\n2）“haunches”（臀部与大腿上部，常用于动物或烹饪语境，如“a haunch of venison”鹿腿肉）。\n如果你是在阅读中遇到“hauncher”，也可能是作者为了风格而临时造词（nonce word），或是拼写/扫描错误。"]}
{"word":"haunches","summary":{"en":"Haunches are the hips and upper back legs, especially of an animal; “sit/crouch on your haunches” means to squat.","zh":"haunches 指（尤指动物的）臀部和后腿上部；“sit/crouch on your haunches”表示蹲着/半蹲着。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the hips and upper part of the legs, especially of an animal (the area around the back legs)","zh":"（尤指动物的）臀部与后腿上部；后躯"},"examples":[{"en":"The cat crouched on its haunches, ready to jump.","zh":"猫蹲在后躯上，准备跳起来。"},{"en":"The dog sat back on its haunches and waited.","zh":"狗坐在后躯上等待。"}]},{"partOfSpeech":"n.","definition":{"en":"the upper part of a person’s leg and hip area (but this is less common in everyday English than “hips” or “thighs”)","zh":"（较少用）人的臀部与大腿上部（日常更常说 hips 或 thighs）"},"examples":[{"en":"He lowered himself onto his haunches to look under the table.","zh":"他蹲下去（用后腿支撑）看桌子底下。"},{"en":"She balanced on her haunches while tying her shoe.","zh":"她蹲着系鞋带。"}]}],"synonyms":["hips","hindquarters","rear","back legs (informal)","thighs (for people, approximate)"],"phonetic":"/ˈhɔntʃɪz/","extraExplanation":["“on your haunches”常用来表示“蹲着/半蹲着”，强调身体重心落在弯曲的腿上，像动物准备起跳时那种姿势。","在解剖/烹饪语境里，haunch还可指动物的“臀肉/后腿肉”（如 venison haunch 鹿后腿肉），但复数 haunches 在日常最常见的仍是“后躯/蹲姿”。"]}
{"word":"haunching","summary":{"en":"“Haunching” usually means crouching on your haunches; in engineering it can mean a thickened strengthening part of a structure.","zh":"“Haunching”常指蹲踞/半蹲的姿势；在工程语境中也可指结构的加厚加固部位。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “haunch”) crouching or sitting on your haunches (your hips and the upper part of your legs), often in a ready-to-move position.","zh":"（动词 haunch 的现在分词）蹲踞/半蹲在臀部与大腿上部支撑的姿势，常带有“随时要动”的感觉。"},"examples":[{"en":"The cat was haunching by the door, ready to run outside.","zh":"猫蹲踞在门边，随时准备冲出去。"},{"en":"He was haunching down to tie his shoes.","zh":"他半蹲下来系鞋带。"}]},{"partOfSpeech":"n.","definition":{"en":"(engineering/construction) extra thickening or support at a joint or near the base of an arch/beam, used to strengthen the structure.","zh":"（工程/建筑）在连接处或拱、梁的根部做的加厚/加固部分，用来增强结构强度。"},"examples":[{"en":"The drawing shows haunching at the beam ends to resist bending.","zh":"图纸显示梁端做了加厚加固，用来抵抗弯曲。"},{"en":"Additional haunching was added near the support to improve stability.","zh":"在支座附近加了加厚加固，以提高稳定性。"}]}],"synonyms":["crouching","squatting","hunkering (down)","thickening","reinforcement"],"phonetic":"/ˈhɔntʃɪŋ/","extraExplanation":["“haunch”本义指“臀部/腿根（尤指动物的后腿和臀部）”。因此动词用法常与动物姿态相关：像猫、狗“蹲着蓄势待发”的感觉。","工程里“haunching/haunch”指结构在受力关键位置的“加厚、加腋、加强”，常见于梁端、拱脚或支座附近；中文有时会译作“加腋”“加厚区”“腋部加强”。"]}
{"word":"haunchless","summary":{"en":"“Haunchless” means “without haunches (hips/upper thighs),” describing an unusual body shape.","zh":"“Haunchless”指“没有臀髋部/大腿上部（haunch）的”，多用于描写外形异常的形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking haunches (the hips and upper part of the legs), or having them reduced; without a strong “hip/haunch” shape.","zh":"没有臀部/髋部和大腿上部（haunch），或臀髋部不明显；无“臀部”形态的。"},"examples":[{"en":"The sculpture shows a haunchless figure with an unnaturally narrow hip area.","zh":"这座雕塑呈现一个“无臀髋部”的人物，髋部异常狭窄。"},{"en":"Some people described the animal as haunchless, as if its back legs were missing.","zh":"有人形容那只动物“没有后臀/后腿根部”，仿佛后腿缺失。"}]}],"synonyms":["without hips","hipless","lacking haunches"],"phonetic":"/ˈhɔntʃləs/","extraExplanation":["“Haunchless”比较少见，多用于描写外形（雕塑、幻想生物、怪诞画面等）。更常见的基础词是“haunch”（臀部/大腿上部，尤指动物的后腿根部）。词尾“-less”表示“没有……的”，如: harmless（无害的）、fearless（无畏的）。"]}
{"word":"haunchy","summary":{"en":"Haunchy means having noticeably large or strong hips/thighs (haunches).","zh":"haunchy 指胯部/臀部或大腿根部明显较大或结实的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or animal) having large, strong, or noticeably rounded hips/thighs (haunches).","zh":"（人或动物）臀部/大腿根部（胯部、后腿）较大、结实或很明显的。"},"examples":[{"en":"The deer looked haunchy and powerful as it jumped the fence.","zh":"那只鹿胯部很壮，看起来很有力量，一跃就翻过了栅栏。"},{"en":"The costume is designed to make the actor appear haunchy for the role.","zh":"这套服装的设计是为了让演员在这个角色里看起来胯部更宽大。"}]}],"synonyms":["curvy","broad-hipped","big-hipped","hippy","thick-hipped"],"phonetic":"/ˈhɑn.tʃi/","extraExplanation":["“haunchy”来自名词“haunch”（胯、臀部、大腿根/动物后腿上部）。它描述身体特征，可能带有评价色彩；用于形容人时要注意礼貌与尊重，常用更中性的说法如“curvy（曲线明显）”或“broad-hipped（胯宽的）”。","在描写动物或力量感（如马、鹿、猎犬）的语境中更常见，强调后躯发达、有爆发力。"]}
{"word":"haunt","summary":{"en":"“Haunt” means (1) a ghost repeatedly appears in a place, or (2) a memory or feeling stays in your mind and troubles you; it can also mean to visit a place often, and as a noun, a place you often go.","zh":"“haunt”可指（1）闹鬼、鬼魂出没；（2）记忆/情绪长期萦绕并困扰人；也可指经常去某处；作名词时指常去的地方。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a ghost or spirit) to appear in a place repeatedly; to make people feel a place is scary or supernatural.","zh":"（鬼魂等）反复出现在某地；（使某地）显得闹鬼、阴森。"},"examples":[{"en":"People say a ghost haunts the old mansion on the hill.","zh":"人们说山上的那座老宅子闹鬼。"},{"en":"The abandoned hospital is rumored to be haunted.","zh":"那家废弃医院据说闹鬼。"}]},{"partOfSpeech":"v.","definition":{"en":"to stay in someone’s mind for a long time, often in a troubling or sad way.","zh":"（想法、记忆等）长期萦绕心头，常带来困扰或悲伤。"},"examples":[{"en":"The sound of the crash haunted him for years.","zh":"撞车的声音多年都萦绕着他。"},{"en":"Her last words still haunt me.","zh":"她的临终之言至今仍让我难以释怀。"}]},{"partOfSpeech":"v.","definition":{"en":"to visit a place often; to hang around somewhere regularly.","zh":"经常去（某处）；常出没于（某地）。"},"examples":[{"en":"He used to haunt that coffee shop after work.","zh":"他过去下班后常去那家咖啡店。"},{"en":"Teenagers haunted the arcade on weekends.","zh":"周末青少年常在游戏厅出没。"}]},{"partOfSpeech":"n.","definition":{"en":"a place that someone often goes to; a favorite hangout.","zh":"常去的地方；常出没处。"},"examples":[{"en":"This bookstore is one of my favorite haunts.","zh":"这家书店是我最常去、最喜欢的地方之一。"}]}],"synonyms":["(ghost sense) plague","(mind sense) trouble","linger","(visit often) frequent","(n.) hangout"],"phonetic":"/hɔnt/","extraExplanation":["在恐怖/超自然语境中，haunt 常与 ghost（鬼）、spirit（灵）、haunted house（鬼屋）搭配；形容词 haunted 表示“闹鬼的/令人不安的”。","在更常见的日常英语里，haunt 用来表达“记忆/悔恨/画面挥之不去”，语气比“remember”更强，更带情绪阴影。常见搭配：be haunted by…（被……萦绕/折磨）。","文学中常见用法：莎士比亚《哈姆雷特》中有“the ghost that haunts…（徘徊的幽灵）”的意象；现代作品也常用 haunt 来写创伤与内疚的“阴魂不散”。"]}
{"word":"haunted","summary":{"en":"“Haunted” means either (1) a place is spooky because people believe ghosts are there, or (2) a person can’t stop thinking about something troubling.","zh":"“haunted”既可指（1）地方“闹鬼的/阴森的”，也可指（2）人“被不愉快的记忆或想法萦绕、难以摆脱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a place) visited or inhabited by ghosts; spooky or frightening in a supernatural way.","zh":"（指地方）闹鬼的；有鬼出没的；带有超自然恐怖气氛的"},"examples":[{"en":"People say the old house on the hill is haunted.","zh":"人们说山上的那栋老房子闹鬼。"},{"en":"We took a tour of a haunted castle at night.","zh":"我们晚上参观了一座闹鬼的城堡。"}]},{"partOfSpeech":"adj.","definition":{"en":"Unable to stop thinking about something unpleasant (a memory, fear, regret, etc.).","zh":"（被回忆、恐惧、懊悔等）萦绕不去的；难以摆脱的"},"examples":[{"en":"He is haunted by the memory of the accident.","zh":"那次事故的记忆一直萦绕着他。"},{"en":"She was haunted by what she had said.","zh":"她一直为自己说过的话感到挥之不去的困扰。"}]},{"partOfSpeech":"v.","definition":{"en":"To visit repeatedly and cause worry or fear; to appear often in someone’s thoughts (often as a ghost or as a troubling idea).","zh":"反复缠扰；（如鬼魂般）出没；（想法/记忆）反复浮现并造成不安"},"examples":[{"en":"Strange noises haunted the hallway at night.","zh":"夜里走廊里总有奇怪的声音出没。"},{"en":"The question still haunts me: Did I do the right thing?","zh":"这个问题仍然困扰着我：我做对了吗？"}]}],"synonyms":["spooky","ghostly","cursed","troubled","tormented"],"phonetic":"/ˈhɔntɪd/","extraExplanation":["“haunted”常既可指“闹鬼的”（恐怖故事、万圣节主题里很常见），也可指“心理上挥之不去的困扰”。在日常英语里，后者非常常用，常见搭配有：be haunted by + 名词（memory/regret/past 等）。","文化语境：英语文学和影视里常把“haunted house（鬼屋）”作为经典意象；同时也常用“haunted”来写人物的内心阴影（不一定真的有鬼），比如“haunted by his past（被过去所困）”。"]}
{"word":"hauntedness","summary":{"en":"a lingering haunted feeling or eerie atmosphere","zh":"挥之不去的“闹鬼感”或被往事缠绕的阴森氛围"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or feeling of being haunted (by ghosts, memories, or persistent thoughts); an atmosphere of eerie presence","zh":"被“闹鬼”或被记忆/念头纠缠的状态与感觉；一种阴森、挥之不去的氛围"},"examples":[{"en":"After the accident, a quiet hauntedness hung over the house.","zh":"事故之后，房子里笼罩着一种安静却挥之不去的阴影感。"},{"en":"There was a hauntedness in his voice when he spoke about the past.","zh":"他谈起过去时，声音里带着一种被往事缠绕的幽幽感觉。"},{"en":"The abandoned station had a strange hauntedness at dusk.","zh":"黄昏时分，那座废弃车站有种诡异的“闹鬼感”。"}]}],"synonyms":["eerie atmosphere","uncanniness","ghostliness","spookiness","haunting quality","foreboding","unease"],"phonetic":"/ˈhɔn.tɪd.nəs/","extraExplanation":["这个词在日常口语里不算常见，更常见的是用 haunting（萦绕心头的）、a sense of being haunted（被缠绕的感觉）来表达。","在文学/影评里，hauntedness 常用来写“空间或人物带着过往痕迹”的气氛，不一定真有鬼，也可以是创伤、记忆或罪疚感。"],"etymology":"由 haunted（被闹鬼的；被困扰的）+ 名词后缀 -ness（表示“性质/状态”）构成；意思从“被鬼缠”扩展到“被回忆、愧疚或过往阴影缠绕的感觉”。","mnemonic":["-ness 表“……的状态/性质”：dark→darkness（黑暗）；haunted→hauntedness（被缠绕/闹鬼的状态）。","联想“心里住着 ghost（鬼）”：不是恐怖片的鬼，也可能是“过去的影子”一直跟着你。"]}
{"word":"haunten","summary":{"en":"Haunt means (1) to go somewhere often, (2) to appear as a ghost in a place, or (3) to trouble someone’s mind for a long time; it can also mean a place you often go.","zh":"Haunt 可指（1）经常去某地，（2）以鬼魂形式出没/闹鬼，（3）长期萦绕心头、困扰；也可作名词表示“常去的地方”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to visit a place often (as a habit), especially because you like it","zh":"经常去（某地）；常出没于（某处）（常因喜欢或习惯）"},"examples":[{"en":"This café is a spot I used to haunt after work.","zh":"这家咖啡馆是我以前下班后常去的地方。"},{"en":"Writers often haunt quiet libraries to find inspiration.","zh":"作家常常出没在安静的图书馆里寻找灵感。"}]},{"partOfSpeech":"v.","definition":{"en":"to appear as a ghost in a place; to be the ghost of someone in a place","zh":"（以鬼魂形式）出没；闹鬼"},"examples":[{"en":"People say the old house is haunted by a lonely spirit.","zh":"人们说那座老房子被一个孤独的灵魂闹鬼。"},{"en":"In many stories, a ghost haunts a castle at night.","zh":"在许多故事里，夜里会有鬼魂在城堡里出没。"}]},{"partOfSpeech":"vt.","definition":{"en":"to stay in someone’s mind for a long time and cause worry, sadness, or guilt","zh":"萦绕心头；长期困扰（使担忧、悲伤或内疚）"},"examples":[{"en":"The mistake haunted him for years.","zh":"那个错误困扰了他很多年。"},{"en":"Her words still haunt me sometimes.","zh":"她的话有时仍在我脑海里挥之不去。"}]},{"partOfSpeech":"n.","definition":{"en":"a place someone often visits; a frequent hangout","zh":"常去的地方；老地方；常出没处"},"examples":[{"en":"That park was one of his favorite haunts.","zh":"那个公园是他最常去的地方之一。"}]}],"synonyms":["visit often","frequent","linger","torment","obsess"],"phonetic":"/hɔnt/","extraExplanation":["“haunten” 不是标准现代英语单词，通常是拼写错误。你可能想写的是 **haunt**（动词/名词）或 **haunted**（形容词，表示“闹鬼的；萦绕心头的”）。","文化提示：英语里 “haunted house（鬼屋）” 常见于万圣节（Halloween）文化与恐怖小说/电影中；而 “a memory haunts me（记忆萦绕着我）” 是很常见、偏文学的比喻用法。"]}
{"word":"haunter","summary":{"en":"A haunter is either a ghost that appears repeatedly in a place, or someone who regularly visits a place.","zh":"haunter 指在某地反复出没的幽灵，也可指经常去某地的人（常客）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ghost or spirit that is believed to haunt (repeatedly appear in) a place","zh":"据说会在某地出没、纠缠不散的鬼魂；幽灵"},"examples":[{"en":"Locals say the old theater has a haunter that appears after midnight.","zh":"当地人说那座老剧院有个幽灵会在午夜后出现。"},{"en":"The mansion’s haunter is rumored to whisper in empty rooms.","zh":"传闻那座大宅的幽灵会在空房间里低语。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or animal that often visits or stays in a particular place; a regular visitor","zh":"常去某地的人（或动物）；常客"},"examples":[{"en":"He’s a regular haunter of the neighborhood café.","zh":"他是那家社区咖啡馆的常客。"},{"en":"These woods are haunt of deer; you may see a haunter at dawn.","zh":"这片树林是鹿经常出没的地方；你可能会在黎明看到常来这里的“访客”。"}]}],"synonyms":["ghost","spirit","apparition","regular","frequenter"],"phonetic":"/ˈhɔːntər/","extraExplanation":["“haunter”来自动词“haunt”（常出没、萦绕、纠缠）。在鬼故事里更常用“ghost / spirit”，而“haunter”带有“反复出现、长期盘踞某地”的画面感。","第二个意思偏文学或较正式：指“经常光顾某地的人”。日常英语里更常说“regular (customer)”或“frequent visitor”。"]}
{"word":"haunters","summary":{"en":"“Haunters” most often means ghosts/spirits that appear in a place, or (more neutrally) people who frequent a place.","zh":"“Haunters”常指在某地出没的鬼魂/幽灵；也可指经常光顾某处的人（常客）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or spirits that haunt a place (often used for ghosts or supernatural presences)","zh":"在某地出没的“幽灵/鬼魂”等（常指超自然的存在）"},"examples":[{"en":"The old hotel is said to have haunters in the hallways at night.","zh":"据说那家老旅馆夜里走廊里有“幽灵出没”。"},{"en":"Local stories describe mysterious haunters near the abandoned house.","zh":"当地传说说那座废弃的房子附近有神秘的“出没者”。"}]},{"partOfSpeech":"n.","definition":{"en":"people who regularly visit or spend time in a particular place; frequenters","zh":"常去某处的人；常客"},"examples":[{"en":"The café’s regular haunters know the staff by name.","zh":"那家咖啡馆的常客都能叫出店员的名字。"},{"en":"At dawn, the park has its own quiet haunters.","zh":"清晨，公园有自己那群安静的常客。"}]}],"synonyms":["ghosts","spirits","apparitions","frequenters","regulars"],"phonetic":"/ˈhɔntərz/","extraExplanation":["“haunter”来自动词“haunt”（常去某地；或幽灵出没、纠缠）。在现代英语里，“haunter(s)”既可以指“鬼魂/出没者”，也可以更中性地指“常客”，具体看上下文。"]}
{"word":"haunting","summary":{"en":"“Haunting” most often means ‘unforgettable and emotionally powerful,’ and it can also mean ‘ghostly/creepy’ or refer to a place you often visit (a ‘haunting spot’).","zh":"“Haunting”常指“萦绕心头、难以忘怀的（多用于文艺情感）”，也可指“闹鬼的/阴森的”，或作名词表示“常出没的地方/反复浮现”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unforgettable and deeply moving in a sad, mysterious, or beautiful way; it stays in your mind.","zh":"（因悲伤、神秘或美感而）萦绕心头的，难以忘怀的。"},"examples":[{"en":"She has a haunting voice that makes the song feel like a memory.","zh":"她的嗓音很萦绕心头，让这首歌听起来像一段回忆。"},{"en":"The film ends with a haunting image of an empty street at dawn.","zh":"电影以黎明时分一条空荡街道的画面结尾，令人难以忘怀。"}]},{"partOfSpeech":"adj.","definition":{"en":"Caused by or connected to a ghost or spirit; creepy in a supernatural way.","zh":"闹鬼的；与鬼魂/灵体有关的；带有灵异恐怖感的。"},"examples":[{"en":"They avoided the old house because people said it was haunting.","zh":"他们避开那栋老房子，因为人们说那里闹鬼。"},{"en":"The abandoned hotel had a haunting atmosphere at night.","zh":"那家废弃旅馆夜里有种阴森的氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of regularly coming to a place (or staying in someone’s thoughts).","zh":"经常出没；（也指）反复浮现于脑海。"},"examples":[{"en":"This park was a favorite haunting spot for local artists.","zh":"这座公园是当地艺术家常来出没的地点。"},{"en":"That moment has been haunting me ever since.","zh":"从那以后，那一刻一直在我脑海里挥之不去。"}]}],"synonyms":["unforgettable","evocative","eerie","ghostly","lingering"],"phonetic":"/ˈhɔn.tɪŋ/","extraExplanation":["“haunting”既可以形容“闹鬼的”（偏恐怖、灵异），也常用来形容“美得/悲得让人忘不掉的”（偏文艺、情感）。比如在影评、乐评里说 a haunting melody/ending，通常不是说有鬼，而是说余韵很强。","常见搭配：haunting melody/voice/image/beauty（萦绕心头的旋律/嗓音/画面/美感）；a haunting atmosphere（阴森氛围）；be haunted by memories（被回忆困扰/萦绕）。","词形提醒：haunt（v. 出没；萦绕；困扰）→ haunted（adj. 闹鬼的/被困扰的）→ haunting（adj. 令人难忘的/阴森的）。"]}
{"word":"hauntingly","summary":{"en":"Hauntingly means in a way that feels unforgettable—often beautifully sad or mysteriously eerie.","zh":"hauntingly 指“令人难以忘怀地”，常带有唯美忧伤或神秘阴森的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a beautiful, sad, or mysterious way that stays in your mind for a long time.","zh":"以一种美丽、忧伤或神秘、令人久久难忘的方式。"},"examples":[{"en":"She sang hauntingly, and the room fell completely silent.","zh":"她唱得空灵动人，房间里顿时一片寂静。"},{"en":"A hauntingly beautiful melody drifted through the hallway.","zh":"一段令人难忘的优美旋律在走廊里飘荡。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a ghostlike or eerie way; as if something is being “haunted.”","zh":"以一种幽灵般、阴森的方式；仿佛被“闹鬼”。"},"examples":[{"en":"The wind blew hauntingly through the empty house.","zh":"风在空屋里阴森地呼啸着。"},{"en":"He stared hauntingly into the dark corners of the room.","zh":"他阴森地盯着房间的黑暗角落。"}]}],"synonyms":["eerie","uncannily","memorably","ominously"],"phonetic":"/ˈhɔntɪŋli/","extraExplanation":["“hauntingly”来自形容词“haunting”（萦绕心头的／闹鬼般的），常用于音乐、声音、画面、记忆等，强调那种“挥之不去”的感觉。","语气上既可偏“唯美忧伤”（hauntingly beautiful），也可偏“恐怖诡异”（hauntingly quiet / hauntingly empty），要看搭配的词与语境。"]}
{"word":"hauntings","summary":{"en":"ghost-related events or disturbing memories that keep returning","zh":"闹鬼现象；或反复萦绕、挥之不去的阴影/记忆"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Reports or experiences of ghosts or other supernatural activity in a particular place.","zh":"（某地的）闹鬼事件；据称出现鬼魂或超自然现象的经历/报告。"},"examples":[{"en":"The old hotel is famous for hauntings on the top floor.","zh":"那家老旅馆以顶楼的闹鬼事件而出名。"},{"en":"They recorded strange noises during their investigation of the hauntings.","zh":"他们在调查这些闹鬼现象时录到了奇怪的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"Repeated memories or feelings that return and disturb you, as if they won’t go away.","zh":"（像阴魂不散一样）反复萦绕、令人不安的记忆或情绪。"},"examples":[{"en":"Years later, the war still brought hauntings in his dreams.","zh":"多年后，那场战争仍在他的梦里反复萦绕。"},{"en":"She tried to move on, but the past left hauntings that resurfaced at night.","zh":"她努力向前看，但过去留下的阴影总在夜里浮现。"}]}],"synonyms":["ghost sightings","apparitions","poltergeist activity","paranormal activity","spectral visits","disturbing memories","lingering trauma","recurring nightmares","unforgettable past"],"phonetic":"/ˈhɔn.tɪŋz/","extraExplanation":["在恐怖小说、民间传说与影视里，\"hauntings\"常指某个地点“有灵异现象”的集合；而在日常非灵异语境中，它也很常用来比喻“挥之不去的回忆/阴影”。两者都带有“反复出现、难以摆脱”的核心感觉。"],"etymology":"源自古英语“haunt”（常去、出没），更早可追溯到日耳曼语系表示“居住/常在”的词根；后来在英语里逐渐发展出“鬼魂出没、萦绕不去”的含义。","mnemonic":["联想“鬼（haunt）常常来（常去）”：某地反复“被来访”就成了闹鬼事件。","把 haun- 想成“阴魂”，-tings 像“事情/动静”：阴魂相关的“动静/事件”。"]}
{"word":"haunts","summary":{"en":"“Haunts” can mean (1) ghosts repeatedly appearing somewhere, (2) a memory/worry that won’t go away, or (3) someone’s usual places (plural noun).","zh":"“haunts”可指（1）闹鬼/鬼魂出没，（2）记忆或担忧挥之不去，（3）常去的地方（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a ghost or spirit) to appear in a place repeatedly; to visit and frighten people.","zh":"（鬼魂等）反复出现在某地；闹鬼，使人害怕。"},"examples":[{"en":"People say the old house is haunted at night.","zh":"人们说那栋老房子晚上闹鬼。"},{"en":"A ghost haunts the castle in the story.","zh":"故事里有个鬼魂在城堡里出没。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a memory, worry, or image) to stay in your mind for a long time and keep bothering you.","zh":"（记忆、担忧或画面）长期萦绕心头，挥之不去，困扰某人。"},"examples":[{"en":"That mistake still haunts her.","zh":"那个错误仍然困扰着她。"},{"en":"The sound of the accident haunted him for years.","zh":"事故的声音多年一直萦绕着他。"}]},{"partOfSpeech":"n.","definition":{"en":"a place that someone often visits or spends time in (usually used in the plural: haunts).","zh":"某人常去的地方；常出没之处（常用复数：haunts）。"},"examples":[{"en":"This café is one of my favorite haunts.","zh":"这家咖啡馆是我最常去的地方之一。"},{"en":"Police checked his usual haunts.","zh":"警方查看了他常去的地点。"}]}],"synonyms":["visit (as a ghost)","linger","trouble","obsess","frequent (a place)","hang out (informal)"],"phonetic":"/hɔnts/","extraExplanation":["“haunts”既可以是动词第三人称单数（He/She/It haunts...），也可以是名词复数（my haunts）。看语境：如果后面跟宾语（haunts her / haunts the house）多半是动词；如果前面有my/his/usual，常是名词。","常见搭配：be haunted (by...)（被……所困扰/闹鬼）；haunted house（鬼屋）；haunt someone’s dreams（在某人的梦里纠缠）。","在文学与影视里，“haunt”常带有哥特式氛围；但在日常英语中更常用引申义，表示“阴影般的记忆/担忧挥之不去”。"]}
{"word":"haunty","summary":{"en":"“Haunty” means spooky or ghost-like, as if a place is haunted (informal).","zh":"“haunty”表示“阴森的、像闹鬼一样的”（较口语/非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Spooky or ghost-like; making you feel as if a place is haunted.","zh":"阴森的；像闹鬼一样的；让人觉得被鬼魂缠绕的。"},"examples":[{"en":"The old house looked haunty at night.","zh":"那栋老房子晚上看起来很阴森。"},{"en":"The empty hallway had a haunty silence.","zh":"空荡的走廊有一种阴森的寂静。"}]}],"synonyms":["spooky","eerie","creepy","haunted","ghostly"],"phonetic":"/ˈhɔnti/","extraExplanation":["“haunty”多见于口语或写作中带点随意的表达，意思接近更常见的“haunted（闹鬼的）”或“haunting（萦绕心头的/阴森的）”。","构词上相当于“haunt（出没；萦绕）+ -y”，像“cloudy（多云的）”一样，用“-y”把名词/动词变成形容词。"]}
{"word":"haupia","summary":{"en":"Haupia is a traditional Hawaiian coconut milk pudding, often chilled and cut into squares.","zh":"Haupia 是一种传统夏威夷椰奶布丁，通常冷藏后切成方块食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Hawaiian dessert: a smooth, firm coconut milk pudding (often cut into squares), commonly served at luaus and on plate lunches.","zh":"一种传统夏威夷甜点：用椰奶做成的滑嫩、偏凝固的布丁（常切成方块），常见于草裙舞宴会（luau）或夏威夷便当餐盘中。"},"examples":[{"en":"We ordered haupia for dessert, and it tasted lightly sweet and coconutty.","zh":"我们点了 haupia 当甜点，味道微甜、椰香很清爽。"},{"en":"At the luau, they served haupia squares alongside fresh fruit.","zh":"在 luau 宴会上，他们端上了方块状的 haupia，旁边配着新鲜水果。"},{"en":"Many bakeries use haupia as a filling for cakes and pastries.","zh":"很多烘焙店会把 haupia 当作蛋糕或点心的内馅。"}]}],"synonyms":["Hawaiian coconut pudding","coconut milk pudding"],"phonetic":"/haʊˈpiːə/","extraExplanation":["“Haupia”来自夏威夷语，传统做法多用椰奶加淀粉（早期常用葛粉/arrowroot）加热搅拌至浓稠，再冷却定型，口感介于布丁和果冻之间。","在夏威夷本地饮食文化里，haupia常作为“板餐”(plate lunch)或宴席甜点出现；现代也常见“chocolate haupia pie”（巧克力＋椰奶布丁派）等改良口味。"]}
{"word":"Hauptstadt","summary":{"en":"“Hauptstadt” is the German word for “capital city.”","zh":"“Hauptstadt”是德语，意思是“首都/首府”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the capital city of a country (German word)","zh":"（德语）首都；首府"},"examples":[{"en":"Berlin is the Hauptstadt of Germany.","zh":"柏林是德国的首都。"},{"en":"In German textbooks, you might see questions like: “Was ist die Hauptstadt von Frankreich?”","zh":"在德语教材里，你可能会看到这样的问题：“法国的首都是哪里？”"}]}],"synonyms":["capital (city)","seat of government","capital"],"phonetic":"/ˈhaʊptʃtɑt/","extraExplanation":["“Hauptstadt”是德语名词：Haupt- 表示“主要的、最重要的”（像英语 main），Stadt 表示“城市”。合起来就是“主要城市”→“首都”。","在英语语境中，“Hauptstadt”通常出现在讨论德语、德国文化、语言学习或引用德语原文时；日常英语更常用 “capital (city)”。","复数形式在德语里是 “Hauptstädte”（有变音符 ä）。"]}
{"word":"Hauran","summary":{"en":"a historic region in southern Syria known for fertile volcanic plains","zh":"叙利亚南部的历史地区，以肥沃的火山平原著称"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a historical geographic region in southern Syria (sometimes extending into northern Jordan), known for its fertile basaltic plains and long agricultural history","zh":"叙利亚南部（有时延伸至约旦北部）的历史地理区域，以肥沃的玄武岩平原与悠久农业传统著称"},"examples":[{"en":"Wheat from the Hauran was famous in the Roman period.","zh":"在罗马时期，来自Hauran地区的小麦非常有名。"},{"en":"The travelers crossed the dark volcanic fields of the Hauran.","zh":"旅行者穿过了Hauran那片黑色的火山地貌田野。"}]}],"synonyms":["Hawran"],"phonetic":"/hɔːˈrɑːn/","extraExplanation":["它常被描述为“玄武岩高原/平原”地带，土壤肥沃，古代以粮食产区闻名；在罗马与拜占庭时期也常出现在历史记载中。","有时在英文资料里会与更广义的“南叙利亚火山地带”相关联，具体边界会随时代与学者用法而变化。"],"etymology":"源自阿拉伯语“Ḥawrān / حوران”（地名）。英语多通过历史地理与考古著作转写进入，常见拼写也有“Hawran”。","mnemonic":["记忆法：把它看作“好(好)ran（跑）出来的粮仓”——联想到肥沃平原、盛产小麦。","中文联想：可按音记成“哈乌兰/豪兰”，把它当作中东的一个地名标签来记。"]}
{"word":"hauranitic","summary":{"en":"Hauranitic means “of or related to the Hauran region (southern Syria/northern Jordan).”","zh":"Hauranitic 指“与豪兰地区（叙利亚南部/约旦北部）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Hauran (also spelled Hawran), a historical region in southern Syria and northern Jordan.","zh":"与豪兰（Hauran，也常拼作Hawran）有关的；豪兰地区的（位于叙利亚南部与约旦北部一带的历史地区）。"},"examples":[{"en":"Archaeologists have documented several Hauranitic basalt villages south of Damascus.","zh":"考古学家记录了大马士革以南若干处豪兰地区的玄武岩村落。"},{"en":"The museum’s collection includes Hauranitic inscriptions from the Roman period.","zh":"博物馆的馆藏包括一些罗马时期的豪兰地区铭文。"}]}],"synonyms":["Hauran","Hawran (variant spelling)"],"phonetic":"/ˌhaʊrəˈnɪtɪk/","extraExplanation":["“Hauranitic”是非常少见的学术用语，多见于考古、历史地理、宗教学研究中，用来指“属于/来自豪兰（Hauran）地区”的事物（如玄武岩建筑、铭文、方言特征等）。日常英语更常直接说“of the Hauran region”或用更常见的地名形容词。"]}
{"word":"hauriant","summary":{"en":"Hauriant is a rare word meaning “drinking,” especially used in heraldry to describe an animal shown drinking.","zh":"hauriant 是个罕见词，意为“正在饮水”；在纹章学中常用来描述动物被画成饮水的姿态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Heraldry) Describing an animal shown drinking (often from water), with its head lowered toward the liquid.","zh":"（纹章学）指动物被画成正在饮水（常从水中饮），头部低下靠近水面。"},"examples":[{"en":"In the coat of arms, the stag is depicted hauriant at a stream.","zh":"在这枚纹章中，雄鹿被画成在溪边饮水（hauriant）。"},{"en":"The blazon notes a deer hauriant, meaning it is shown drinking.","zh":"纹章描述中写着“deer hauriant”，意思是这只鹿被画成正在饮水。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, literary) Drinking; drawing in liquid, especially in a vivid or poetic way.","zh":"（罕见，文学用语）饮用；汲取液体（常用于更形象或诗意的表达）。"},"examples":[{"en":"He stood by the spring, hauriant, as if the cold water could quiet his thoughts.","zh":"他站在泉边饮水（hauriant），仿佛冰冷的水能让思绪安静下来。"},{"en":"The poem lingers on the image of a traveler hauriant from a river.","zh":"这首诗反复描写旅人从河中饮水（hauriant）的画面。"}]}],"synonyms":["drinking","lapping","quaffing (literary)"],"phonetic":"/ˈhɔːriənt/","extraExplanation":["“hauriant”多见于纹章学（heraldry）的专门用语与古旧英语文本中，现代日常英语几乎不用。常见的纹章对应用词还有：\n- “rampant”（后腿站立的姿势）\n- “couchant”（卧着）\n- “passant”（行走）\n在阅读纹章描述（blazon）时，这类词用来精确说明动物的姿态。"]}
{"word":"haurient","summary":{"en":"Haurient is a rare literary adjective meaning “inhaling” or, more broadly, “absorbing/taking in deeply.”","zh":"Haurient 是一个罕见的文学形容词，意思是“吸气（吸入空气）”，也可引申为“深深吸收/领受”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary, rare) Drawing in; especially drawing in air by breathing (inhaling).","zh":"（文学用语，罕见）吸入；尤指通过呼吸把空气吸进来（吸气）。"},"examples":[{"en":"The runner stood still for a moment, haurient breaths filling his lungs.","zh":"跑者停了一会儿，深深吸气，让空气充满肺部。"},{"en":"In the cold morning, she took one haurient breath and stepped outside.","zh":"在寒冷的清晨，她深吸一口气，然后走到室外。"}]},{"partOfSpeech":"adj.","definition":{"en":"(extended, literary) Taking in mentally or emotionally; absorbing or drinking in (an experience, a view, a feeling).","zh":"（引申，文学用语）在心里“吸收/摄取”；沉浸式地领受（体验、景象或情感）。"},"examples":[{"en":"He stood by the sea, haurient the vast silence.","zh":"他站在海边，沉浸式地“吸收”那辽阔的寂静。"},{"en":"She was haurient of every detail in the painting.","zh":"她把画中的每个细节都尽情“吸收”进心里。"}]}],"synonyms":["inhaling","deep-breathing","absorbing","taking in","imbibing"],"phonetic":"/ˈhɔriənt/","extraExplanation":["词源来自拉丁语 haurire，意为“舀起、汲取、吸入”。因此 haurient 常带有“像汲水一样把东西吸进来”的文学色彩。","在现代英语里它非常少见，更常见的替代词是 inhaling / deep-breathing（吸气/深呼吸）或 absorbing / taking in（吸收/领会）。若在诗歌或散文中使用，通常是为了营造更浓的意象感。"]}
{"word":"hausa","summary":{"en":"Hausa can mean the Hausa people, the Hausa language, or something related to Hausa culture.","zh":"Hausa 可指豪萨人、豪萨语，或与豪萨文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Hausa ethnic group of West Africa, especially in northern Nigeria and southern Niger","zh":"豪萨人（西非的一个民族，主要分布在尼日利亚北部和尼日尔南部）"},"examples":[{"en":"Many Hausa people live in northern Nigeria.","zh":"许多豪萨人生活在尼日利亚北部。"},{"en":"She is Hausa, and her family speaks Hausa at home.","zh":"她是豪萨人，她的家人在家里说豪萨语。"}]},{"partOfSpeech":"n.","definition":{"en":"the Hausa language, widely spoken in West Africa and often used as a regional lingua franca (a common language for communication)","zh":"豪萨语（西非广泛使用的语言，也常作为地区通用语）"},"examples":[{"en":"He can speak Hausa and English.","zh":"他会说豪萨语和英语。"},{"en":"The radio broadcast is available in Hausa.","zh":"这档电台节目提供豪萨语版本。"},{"en":"Learning Hausa can help you communicate across parts of West Africa.","zh":"学习豪萨语可以帮助你在西非一些地区交流。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the Hausa people or their language and culture","zh":"豪萨人的；与豪萨语或豪萨文化相关的"},"examples":[{"en":"They visited a Hausa market to buy spices and cloth.","zh":"他们参观了一个豪萨市场，买香料和布料。"},{"en":"Hausa music is popular in the region.","zh":"豪萨音乐在该地区很受欢迎。"}]}],"synonyms":["Hausa language","Hausa people"],"phonetic":"ˈhaʊsə","extraExplanation":["“Hausa”既可指民族，也可指语言；在英语里通常首字母大写。","豪萨语属于“乍得语族”（Chadic），在西非影响力很大，常被用作跨族群交流的通用语。","书写方面，豪萨语常用拉丁字母的拼写体系（Boko），也在一些宗教或传统语境中使用阿拉伯字母改写的体系（Ajami）。"]}
{"word":"hause","summary":{"en":"“Hause” is usually a misspelling of “house,” meaning a home/building to live in, or to provide a place to stay.","zh":"“hause”通常是“house”的拼写错误，意思是“房子/家”，也可作动词表示“提供住处/安置”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building where people live; a home","zh":"房子；住宅；家"},"examples":[{"en":"They bought a small house near the park.","zh":"他们在公园附近买了一栋小房子。"},{"en":"Our house has three bedrooms.","zh":"我们家有三间卧室。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provide a place for someone or something to live or stay","zh":"给……提供住处；安置；收容"},"examples":[{"en":"The school houses an art museum.","zh":"这所学校里设有一个艺术博物馆。"},{"en":"The shelter can house up to 50 people.","zh":"这家收容所最多可以安置50人。"}]},{"partOfSpeech":"n.","definition":{"en":"a company, organization, or place known for a particular activity (often used in names)","zh":"（常用于名称）公司；机构；某类活动的场所"},"examples":[{"en":"She works at a publishing house.","zh":"她在一家出版社工作。"},{"en":"They met at an opera house.","zh":"他们在歌剧院见面。"}]}],"synonyms":["home","residence","dwelling","shelter"],"phonetic":"/haʊs/","extraExplanation":["“hause”通常不是标准英文单词，最常见是把“house”拼错了。如果你想表达“Haus”（德语里的“房子”）或某个专有名词/姓氏，也可能会写成“hause”。你可以告诉我你看到它的句子，我可以帮你判断意思。"]}
{"word":"hausen","summary":{"en":"“Hausen” is an older word for the beluga sturgeon, and it is also used as a German place name or surname.","zh":"“Hausen”既可指（较旧用法）白鲟/鳇，也常见作德语地名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Older or specialized) the beluga sturgeon, a very large sturgeon species valued for caviar.","zh":"（较旧或专业用法）白鲟（又称白鲟鲟鱼/白鲟鳇），一种体型巨大的鲟鱼，以鱼子酱闻名。"},"examples":[{"en":"In some older books, the beluga sturgeon is called the hausen.","zh":"在一些较旧的书里，白鲟（beluga sturgeon）会被称为 hausen。"},{"en":"The hausen can grow to an enormous size in the Caspian Sea region.","zh":"在里海地区，hausen（白鲟）能长到非常惊人的体型。"}]},{"partOfSpeech":"other","definition":{"en":"A German place name or family name (proper noun).","zh":"德语中的地名或姓氏（专有名词）。"},"examples":[{"en":"She traced her ancestors back to a village called Hausen in Germany.","zh":"她把祖先追溯到德国一个叫 Hausen 的村庄。"},{"en":"Dr. Hausen is speaking at the conference today.","zh":"Hausen 博士今天会在会议上发言。"}]}],"synonyms":["beluga sturgeon","beluga","sturgeon"],"phonetic":"/ˈhaʊzən/","extraExplanation":["“Hausen”作为鱼名的用法在现代英语里比较少见；如今更常说 **beluga sturgeon**（白鲟/鳇）或直接说 **beluga**（注意别和“beluga whale”白鲸混淆）。","作为地名/姓氏时，**Hausen**来自德语词根 **Haus**（房子），常见于德国、瑞士、奥地利等地的地名。"]}
{"word":"hausens","summary":{"en":"“hausens” is uncommon in English; it usually means multiple “Hausen” (a name), and can sometimes refer to sturgeon in food/fish contexts.","zh":"“hausens”在英语中很少见；通常指多个“Hausen”（地名/姓氏），在饮食或鱼类语境中有时也与鲟鱼有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Not a standard English vocabulary word; it is most often seen as a plural form of the proper name “Hausen” (a place name or surname). In some contexts, “Hausen” can also refer to a kind of sturgeon (a fish).","zh":"不是常见的英语词汇；最常见是专有名词“Hausen”（地名或姓氏）的复数形式。在某些语境中，“Hausen”也可指一种鲟鱼（鱼类）。"},"examples":[{"en":"Several families named Hausen appear in the local records.","zh":"当地记录中出现了几户姓Hausen的家庭。"},{"en":"The menu listed smoked Hausen, a type of sturgeon.","zh":"菜单上写着烟熏Hausen（一种鲟鱼）。"}]}],"synonyms":["(for the fish) sturgeon","(as a name) none"],"phonetic":"/ˈhaʊzənz/","extraExplanation":["“hausens”本身在英语里不常作为普通词使用，更多像是专有名词的复数（例如：多个叫Hausen的地方/家庭）。如果你想查的是常见英语词，请确认是否想输入：\n1) housing(s)（住房；外壳；安置），或\n2) Hansen（常见姓氏），或\n3) Hausen（德语地名/姓氏）。\n你可以告诉我你在哪句话里看到“hausens”，我就能更准确地解释。"]}
{"word":"hausfrau","summary":{"en":"“Hausfrau” means “housewife/homemaker,” borrowed from German and sometimes used in English with a traditional or German cultural tone.","zh":"“Hausfrau”指“家庭主妇/主内的人”，源自德语，在英语中偶尔借用，并可能带有传统或德国文化语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a housewife or homemaker (a German word sometimes used in English, often with a “traditional domestic role” or “middle‑class German” feel)","zh":"家庭主妇；主内的人（德语词，有时在英语中借用，常带有“传统家庭分工”或“德国中产家庭”语感）"},"examples":[{"en":"In the novel, the main character is a West German hausfrau who keeps the home running.","zh":"在小说里，主角是一位西德的家庭主妇，把家里打理得井井有条。"},{"en":"She joked that she felt like a 1950s hausfrau when she spent the whole day cooking and cleaning.","zh":"她开玩笑说，自己整天做饭打扫，感觉像个20世纪50年代的“家庭主妇”。"}]}],"synonyms":["housewife","homemaker","stay-at-home mom","stay-at-home parent"],"phonetic":"/ˈhaʊs.fraʊ/","extraExplanation":["“Hausfrau”是德语，直译接近“家里的女人/主妇”。在英语语境里，它有时带一点文化想象：强调传统家庭模式、勤俭持家、以照料家庭为主的女性形象（不一定是赞美或贬义，取决于上下文）。","复数常写作“Hausfrauen”（德语复数），但在英语里也偶见直接加-s写作“hausfraus”，较不正式。"]}
{"word":"hausfrauen","summary":{"en":"Hausfrauen is German for “housewives” (plural), referring to women whose main work is managing the home.","zh":"Hausfrauen 是德语“家庭主妇”的复数，指主要负责家务与家庭管理的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German, plural) housewives; women who manage the home as their main work.","zh":"（德语，复数）家庭主妇；以打理家庭为主要工作的人。"},"examples":[{"en":"In the article, many Hausfrauen said they wanted more flexible job options.","zh":"在那篇文章里，许多“hausfrauen（家庭主妇）”说她们希望有更灵活的工作选择。"},{"en":"The museum exhibit showed daily tools used by Hausfrauen in the 1950s.","zh":"博物馆展览展示了20世纪50年代家庭主妇常用的日常工具。"}]}],"synonyms":["housewives","homemakers","stay-at-home wives"],"phonetic":"ˈhaʊsˌfraʊən","extraExplanation":["“Hausfrauen”是德语名词“Hausfrau”（家庭主妇）的复数形式；单数：die Hausfrau，复数：die Hausfrauen。","在德语语境里，这个词常带有特定时代的社会角色联想（例如二战后西德的家庭分工观念）。现代德语中也会用更中性的表达，如“Hausperson”（较少见）或直接说“zu Hause bleiben”（留在家里）。","如果你是在英语文本里看到“Hausfrauen”，通常是作者借用德语来强调“德国/德语文化背景”或一种带历史感的社会形象。"]}
{"word":"hausfraus","summary":{"en":"“Hausfraus” is the plural of “hausfrau,” meaning (traditionally) housewives/homemakers; it can sound old-fashioned or stereotyped in English.","zh":"“hausfraus”是“hausfrau”的复数，指（传统意义上的）家庭主妇/主妇型持家者；在英语语境中可能带有过时或刻板印象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of *hausfrau*: a German word sometimes used in English to mean a (typically traditional) housewife or homemaker.","zh":" *hausfrau* 的复数：德语词，有时被英语借用，指（通常较传统的）家庭主妇/主妇型的持家者。"},"examples":[{"en":"In the novel, the author contrasts the city’s working women with the suburban hausfraus.","zh":"在小说中，作者把城市里的职业女性与郊区的“hausfraus（家庭主妇们）”作对比。"},{"en":"The article used “hausfraus” to describe women expected to stay home and run the household.","zh":"那篇文章用“hausfraus”来形容被期待留在家里操持家务的女性。"}]}],"synonyms":["housewives","homemakers","stay-at-home wives","stay-at-home moms (context-dependent)"],"phonetic":"/ˈhaʊsˌfraʊ/","extraExplanation":["这个词原本是德语：*Haus*（房子）+ *Frau*（女人/妻子），字面意思接近“家里的女人”，常译为“家庭主妇”。在英语里使用时，语气有时带一点讽刺或刻板印象（暗示“传统、在家、不工作”），用在真实人物上要注意场合与尊重。","拼写小提示：英语里更常见单数 *hausfrau*，复数可以写 *hausfraus*（英语化复数），也有人保留德语复数 *Hausfrauen*（更“德语”）。"]}
{"word":"hausmannite","summary":{"en":"Hausmannite is a dark manganese oxide mineral (Mn₃O₄) and an ore of manganese.","zh":"Hausmannite（黑锰矿）是一种深色的锰氧化物矿物（Mn₃O₄），也是锰的矿石之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral (manganese oxide, Mn₃O₄) that is usually dark brown to black and is an ore of manganese.","zh":"一种矿物（锰的氧化物，化学式 Mn₃O₄），通常呈深棕到黑色，是锰的重要矿石之一。"},"examples":[{"en":"The sample was identified as hausmannite, a manganese oxide mineral.","zh":"这块样品被鉴定为黑锰矿（hausmannite），一种锰氧化物矿物。"},{"en":"Hausmannite can occur in metamorphic rocks and manganese deposits.","zh":"黑锰矿可见于变质岩及含锰矿床中。"}]}],"synonyms":["black manganese ore"],"phonetic":"/ˈhaʊs.mə.naɪt/","extraExplanation":["“hausmannite”源自人名，纪念德国矿物学家 Johann Friedrich Ludwig Hausmann（豪斯曼）。","在矿物学语境中它常被称为“黑锰矿”，主要成分为 Mn₃O₄，可作为提取锰的原料之一。"]}
{"word":"hausse","summary":{"en":"Hausse means an upward trend in prices (especially in finance); it can also mean the rear sight on a firearm.","zh":"Hausse 常指（金融中）价格上涨、看涨行情；也可指枪械的照门/后照准器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an upward movement or bullish trend in prices, especially in the stock market (French loanword used in finance)","zh":"（法语借词，金融用语）价格上涨、看涨行情（尤指股市）"},"examples":[{"en":"Investors were encouraged by the hausse in tech stocks.","zh":"科技股的上涨行情让投资者受到鼓舞。"},{"en":"A sudden hausse pushed the index to a new high.","zh":"一波突然的上涨把指数推到了新高。"}]},{"partOfSpeech":"n.","definition":{"en":"the rear sight (or sight leaf) on a firearm","zh":"（枪械）照门；后照准器（或其标尺片）"},"examples":[{"en":"He adjusted the hausse to improve accuracy at a longer distance.","zh":"他调整了照门，以提高远距离射击的精度。"}]}],"synonyms":["rise","increase","upswing","rally","bull market"],"phonetic":"/hoʊs/","extraExplanation":["“hausse”来自法语，字面有“上升”的意思。在金融语境里常与“baisse”（下跌、看跌）成对出现：hausse（看涨） vs. baisse（看跌）。英语里它更偏书面或专业报道用词，日常更常说 rise / increase / rally。"]}
{"word":"haussmannization","summary":{"en":"Haussmannization means the Haussmann-style rebuilding of Paris—and, more broadly, any large, state-led urban renewal with wide boulevards and major redevelopment.","zh":"Haussmannization 指“奥斯曼式”的城市改造：原指19世纪巴黎的大规模重建；也可泛指以宽阔大道与重大开发为特征的政府主导城市更新。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the large-scale redesign and rebuilding of a city (especially Paris) with wide boulevards, new infrastructure, and the demolition of older neighborhoods; originally referring to Baron Haussmann’s 19th‑century renovation of Paris","zh":"（尤指巴黎的）大规模城市改造与重建；以修建宽阔大道、更新基础设施并拆除旧街区为特征，原指19世纪奥斯曼男爵对巴黎的改造"},"examples":[{"en":"Many historians say Haussmannization changed Paris from a medieval city into a modern capital.","zh":"许多历史学家认为，“奥斯曼式改造”把巴黎从中世纪城市变成了现代首都。"},{"en":"Critics argue that Haussmannization improved sanitation but displaced thousands of working-class residents.","zh":"批评者认为，奥斯曼式改造改善了卫生条件，但也迫使成千上万的工人阶级居民迁离。"}]},{"partOfSpeech":"n.","definition":{"en":"by extension, any urban-renewal policy that prioritizes grand avenues, monumental planning, and state-led redevelopment, sometimes at the cost of local communities","zh":"（引申）指任何强调宏大道路、纪念性规划与政府主导开发的城市更新政策，有时以牺牲社区与原居民利益为代价"},"examples":[{"en":"Some activists describe the new waterfront project as a kind of Haussmannization.","zh":"一些活动人士把新的滨水项目称为一种“奥斯曼式改造”。"},{"en":"The debate is whether this Haussmannization will create a more livable city or erase its character.","zh":"争论在于：这种“奥斯曼式改造”会让城市更宜居，还是会抹去它的特色。"}]}],"synonyms":["urban renewal","redevelopment","city rebuilding","modernization (of a city)","boulevardization"],"phonetic":"/ˌhaʊs.mə.naɪˈzeɪ.ʃən/","extraExplanation":["“Haussmannization”来自巴黎市长（准确说是塞纳省省长）乔治-欧仁·奥斯曼（Baron Haussmann）的姓。1850—1870年前后，在拿破仑三世时期，巴黎大规模开辟林荫大道、修建下水道与供水系统、统一建筑立面等。","这个词在英语里常带评价色彩：既可能赞美其“现代化/卫生/交通改善”，也常用于批评“拆迁、阶层迁移、城市同质化（有时也与绅士化 gentrification 的讨论相关）”。","拼写提示：Haussmann + -ization（美式常见后缀，表示“……化/……过程”）；重音通常落在 -za- 前后，读起来更像一个长名词。"]}
{"word":"haussmannize","summary":{"en":"Haussmannize means to redesign a city in a Haussmann-style modernization—wide boulevards, new infrastructure, and major redevelopment that may disrupt older neighborhoods.","zh":"Haussmannize 指以“奥斯曼式”方式改造城市：开辟宽阔大道、更新基础设施并进行大规模重建，可能影响或取代旧社区。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to rebuild or redesign a city in a grand, planned way—often by cutting wide boulevards through older neighborhoods, modernizing infrastructure, and sometimes displacing existing communities (like Baron Haussmann’s renovation of Paris in the 1800s).","zh":"以宏大的、规划性的方式重建或改造城市——常见做法包括在老城区开辟宽阔大道、升级基础设施，并可能导致原有社区被迁移或取代（类似19世纪奥斯曼男爵对巴黎的改造）。"},"examples":[{"en":"Some critics say the project will haussmannize the historic district, replacing small streets with wide boulevards.","zh":"一些批评者认为该项目会“奥斯曼式改造”历史街区，用宽阔大道取代狭窄街巷。"},{"en":"After the earthquake, planners debated whether to haussmannize the center or restore it street by street.","zh":"地震之后，规划者争论是要把市中心“奥斯曼化”大规模重塑，还是逐街逐巷修复。"}]}],"synonyms":["modernize","redevelop","reconstruct","urban-renew","gentrify (often related but not identical)"],"phonetic":"/ˈhoʊs.mə.naɪz/","extraExplanation":["“haussmannize”源自巴黎改造者 Georges-Eugène Haussmann（奥斯曼男爵）。在英语里它常带一点评价色彩：既可能赞美“现代化、整洁、交通顺畅”，也可能批评“抹去历史肌理、推动拆迁与绅士化（gentrification）”。","常见搭配：haussmannize a city / the downtown / the historic quarter。也可见名词化用法：Haussmannization（奥斯曼式改造）。"]}
{"word":"haust","summary":{"en":"“Haust” is an archaic, rare word meaning a single draught (often a dose of medicine) or, as a verb, to drink/draw in liquid.","zh":"“haust”是古义且罕用的词，可指“一口饮下的一剂（常指药水）”，作动词则指“饮尽/吸入（液体）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or very rare) a drink taken in one swallow; a draught (especially in medical or formal writing).","zh":"（古义/罕用）一口喝下的饮料；一剂（尤指药水的一次服用量）。"},"examples":[{"en":"The doctor ordered a bitter haust to be taken before bed.","zh":"医生让他睡前喝一剂苦药水。"},{"en":"She finished the haust in one gulp.","zh":"她一口把那剂饮料喝完了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Archaic or very rare) to draw in or drink up (liquid).","zh":"（古义/罕用）吸入；饮尽（液体）。"},"examples":[{"en":"He hausted the mixture quickly and left.","zh":"他迅速把混合液喝下就离开了。"},{"en":"The dry soil seemed to haust the water at once.","zh":"干燥的土壤似乎立刻把水“吸”进去了。"}]}],"synonyms":["draught","dose","swallow","gulp"],"phonetic":"/hoʊst/","extraExplanation":["“haust”在现代英语里极少单独使用，更常见的是作为词根出现在 **exhaust**（把……抽空/耗尽）中：ex-（向外）+ haust（汲取、抽出）。这条词源与拉丁语 *haurire*（汲取、舀出）有关。","如果你想查的是德语里的 **haust**（如 *du haust*），那是另一种语言用法；也可能是把 **host** 或 **exhaust** 拼写成了 haust。你可以告诉我你的句子，我帮你确定。"]}
{"word":"haustella","summary":{"en":"Haustella is the plural of haustellum, meaning tube-like sucking mouthparts in insects.","zh":"Haustella 是 haustellum 的复数，指昆虫等用于吸食的管状口器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) Plural of haustellum: specialized tube-like mouthparts used for sucking or feeding, especially in insects (for example, a butterfly’s or mosquito’s feeding structure).","zh":"（动物学）haustellum 的复数：一种管状的特化口器，用来吸食或取食，尤指昆虫（如蝴蝶或蚊子的取食结构）。"},"examples":[{"en":"Butterflies feed through long haustella that act like drinking straws.","zh":"蝴蝶通过细长的 haustella 取食，功能像吸管一样。"},{"en":"Under the microscope, the insect’s haustella were visible as thin, flexible tubes.","zh":"在显微镜下，可以看到这只昆虫的 haustella 呈细而柔韧的管状结构。"}]}],"synonyms":["proboscises","sucking mouthparts"],"phonetic":"/hɔːˈstɛlə/","extraExplanation":["“haustella”是拉丁化的科学复数形式；单数常写作“haustellum”。在现代英文里，很多科学写作也会直接用英文复数“haustellums”。","词根与“haust-（吸、汲取）”有关，常见于生物学术语。不要和植物/真菌中的“haustorium（吸器）”混淆：haustorium 是寄生体伸入宿主组织吸收养分的结构，而 haustellum/haustella 多指昆虫等动物的吸食口器。"]}
{"word":"haustellate","summary":{"en":"Haustellate describes insects or animals that have a long sucking mouthpart (proboscis).","zh":"Haustellate 指具有用于吸食的细长口器（口吻/吸喙）的昆虫或动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal, especially an insect) having a long, tube-like mouthpart (a proboscis) used for sucking liquids.","zh":"（尤指昆虫）具“吸喙/口吻”（细长管状口器），用来吸食液体。"},"examples":[{"en":"Butterflies are haustellate insects; they drink nectar through a long proboscis.","zh":"蝴蝶是具吸喙的昆虫；它们用细长的口吻吸食花蜜。"},{"en":"Many flies have haustellate mouthparts adapted for feeding on fluids.","zh":"许多苍蝇有适合吸食液体的吸喙式口器。"}]}],"synonyms":["proboscidate","suctorial","having a proboscis"],"phonetic":"/hɔːˈstɛl.eɪt/","extraExplanation":["这是一个比较少见、偏生物学/动物学的形容词，来自拉丁语词根：*haust-*（“汲取、吸取”）+ *-ellum*（小型工具/器官的指小后缀）。","相关名词是 **haustellum**（吸喙、口吻），在描述昆虫口器类型时会用到。日常英语更常说：*has a proboscis*（有口吻/长喙）。"]}
{"word":"haustellated","summary":{"en":"A rare scientific adjective meaning “having a haustellum (piercing/sucking mouthpart).”","zh":"较少见的科学形容词，意思是“具有喙/吸管状（刺吸或吸食）口器的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, especially entomology) Having a haustellum—an elongated, often piercing or sucking mouthpart used to feed (e.g., in some insects).","zh":"（生物学，尤指昆虫学）具“喙/吸管状口器”（haustellum）的；具有用于刺吸或吸食的细长口器的。"},"examples":[{"en":"Mosquitoes are haustellated insects that feed by piercing skin and sucking blood.","zh":"蚊子是具喙（刺吸式口器）的昆虫，会刺破皮肤吸血。"},{"en":"The scientist compared haustellated species with chewing insects to understand different feeding habits.","zh":"科学家比较了具喙的物种与咀嚼式口器昆虫，以了解不同的取食习性。"}]}],"synonyms":["haustellate","proboscidate","piercing-sucking"],"phonetic":"/hɔːˈstɛl.eɪ.tɪd/","extraExplanation":["“haustellated”是相当少见的科学用词，常见于昆虫学/动物形态学论文或教材。它来自拉丁语词根，和“haustellum（喙、吸管状口器）”同源。","如果你是在文章里看到它，也可能遇到拼写相近的词：例如“haustellate”（同义形容词）或“haustellum”（名词）。"]}
{"word":"haustellous","summary":{"en":"Haustellous means having sucking mouthparts (a haustellum), especially in insects.","zh":"Haustellous 指（尤指昆虫）具有用于吸取液体的喙状口器（吸食口器）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an insect) having a haustellum—mouthparts adapted for sucking liquids (like nectar or blood).","zh":"（昆虫）具喙／吸食口器的；口器适于吸取液体（如花蜜或血液）。"},"examples":[{"en":"Mosquitoes are haustellous insects that feed by sucking blood.","zh":"蚊子是具喙（吸食口器）的昆虫，靠吸血取食。"},{"en":"Butterflies are haustellous and use a long proboscis to drink nectar.","zh":"蝴蝶属于具喙型昆虫，用长长的喙（口器）吸食花蜜。"}]}],"synonyms":["haustellate","suctorial","proboscidate"],"phonetic":"/hɔːˈstɛləs/","extraExplanation":["“haustellous”是比较少见的专业词，常见于昆虫学（entomology）描述口器类型。更常见的相关词包括：haustellate（具喙的）、haustellum（喙；吸食器官）、proboscis（长喙／口器）。","词根提示：haust-与“汲取、吸取”有关，-ell-/-ellum 常见于拉丁语指“小的器官／结构”。"]}
{"word":"haustellum","summary":{"en":"A haustellum is a tube-like sucking mouthpart used to feed on liquids, especially in insects like mosquitoes.","zh":"haustellum 指用于吸取液体的管状刺吸口器，常见于蚊子等昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A slender, tube-like mouthpart used for sucking up liquids, especially in some insects (like mosquitoes) and certain other animals.","zh":"（生物）用于吸取液体的细长管状口器，常见于一些昆虫（如蚊子）以及其他某些动物。"},"examples":[{"en":"A mosquito uses its haustellum to pierce skin and suck blood.","zh":"蚊子用它的刺吸式口器（haustellum）刺破皮肤并吸血。"},{"en":"Under the microscope, the haustellum looks like a tiny tube designed for feeding.","zh":"在显微镜下，这种刺吸式口器看起来像一根为取食而设计的微小管子。"}]}],"synonyms":["proboscis","sucking mouthpart","piercing-sucking mouthpart"],"phonetic":"/hɔːˈstɛləm/","extraExplanation":["该词源自拉丁语 *haustellum*，与 *haurire*（“汲取、吸取”）有关，因此常用于描述“吸食液体”的口器结构。","在昆虫学中它常与 *proboscis*（喙/吻/长鼻状口器）相关，但 *haustellum* 更强调“刺吸、吸取液体”的功能与结构。"]}
{"word":"haustement","summary":{"en":"“Haustement” isn’t a standard English word; it’s usually a misspelling of the French “haussement,” meaning a raising motion, especially a shrug.","zh":"“Haustement”不是标准英语词；通常是法语“haussement”的误拼，指“抬起/上扬的动作”，尤其是“耸肩”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/rare spelling that is usually intended to be the French word “haussement,” meaning a raising motion (especially a shrug of the shoulders).","zh":"一种不规范/少见的拼写，通常是想写法语“haussement”，意思是“抬起、上扬的动作”（尤其指“耸肩”）。"},"examples":[{"en":"The author wrote “haustement,” but the correct French spelling is “haussement” (as in “haussement d’épaules,” a shrug).","zh":"作者写了“haustement”，但正确的法语拼写是“haussement”（如“haussement d’épaules”，意为“耸肩”）。"},{"en":"In the novel, her only reply was a haussement d’épaules—she didn’t care.","zh":"小说里，她唯一的回应是一个“haussement d’épaules”（耸耸肩）——她不在乎。"}]}],"synonyms":["shrug","shoulder shrug"],"phonetic":"/oʊs.mɑ̃/","extraExplanation":["“Haussement”是法语名词，来自动词“hausser”（抬高、提高）。在英语写作中偶尔会保留法语短语（常见于较文学或正式的语境），例如“haussement d’épaules”（字面是“肩膀的抬起”，实际就是“耸肩”）。如果你是在英文文章里看到“haustement”，多半是拼写错误或误抄。"]}
{"word":"haustoria","summary":{"en":"Haustoria are the nutrient-absorbing structures used by parasitic plants or fungi to tap into a host.","zh":"Haustoria 指寄生植物或真菌用来侵入宿主并吸收养分的“吸器”结构（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"specialized structures (plural of haustorium) that a parasitic plant, fungus, or similar organism grows into a host to absorb water and nutrients","zh":"（haustorium 的复数）吸器；寄生植物或真菌等长入宿主体内、用来吸收水分和养分的特殊结构"},"examples":[{"en":"Powdery mildew forms haustoria inside leaf cells to steal nutrients.","zh":"白粉病菌会在叶片细胞内形成吸器来“夺取”养分。"},{"en":"The parasite’s haustoria connect to the host’s tissues and draw water from them.","zh":"寄生体的吸器与宿主组织连接，从中吸取水分。"}]}],"synonyms":["suction organs","absorbing structures"],"phonetic":"/hɔːˈstɔːriə/","extraExplanation":["“Haustoria”常见于植物学与真菌学的学术语境，是拉丁语词源：haustor- 有“汲取、舀取（液体）”的含义，形象地强调了它的“吸取”功能。","单数是“haustorium”。在阅读论文或教材时，看到“forms a haustorium / forms haustoria”这样的搭配很常见。"]}
{"word":"haustorial","summary":{"en":"Haustorial means “having or relating to a haustorium,” a nutrient-absorbing organ used by some parasites to feed from a host.","zh":"Haustorial意为“与吸器有关的/具有吸器的”，指某些寄生生物用来从宿主吸收养分的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or having a haustorium (a specialized structure used by some parasitic plants or fungi to penetrate a host and absorb nutrients).","zh":"与“吸器（haustorium）”有关的；具有吸器的（吸器是某些寄生植物或真菌用来侵入宿主并吸收养分的特殊结构）。"},"examples":[{"en":"Dodder forms haustorial connections to draw water and nutrients from its host plant.","zh":"菟丝子会形成吸器连接，从宿主植物中吸取水分和养分。"},{"en":"Researchers examined haustorial cells under the microscope to understand how the parasite feeds.","zh":"研究人员在显微镜下观察吸器细胞，以了解寄生体如何取食/吸收营养。"}]}],"synonyms":["parasitic (context-dependent)","haustorium-related"],"phonetic":"/hɔːˈstɔːriəl/","extraExplanation":["“Haustorial”是生物学/植物病理学里比较专门的词，常见于学术文章或教材中。它来自名词“haustorium（吸器）”，而“haustorium”源自拉丁语“haurire”，意为“汲取、吸取”。","吸器并不等同于“根”。寄生植物（如菟丝子）或某些真菌会用吸器穿入宿主组织，与宿主维管束等结构建立联系，以获取水分、糖分和矿物质。英语里也常见搭配：haustorial roots（吸器根）、haustorial invasion（吸器侵入）、haustorial attachment（吸器附着）。"]}
{"word":"haustorium","summary":{"en":"A haustorium is a nutrient-absorbing structure that parasitic plants or fungi use to tap into a host.","zh":"haustorium 指寄生植物或真菌用来刺入寄主并吸收水分与养分的“吸器”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized structure in some parasitic plants and fungi that penetrates a host’s tissues to absorb water and nutrients","zh":"（寄生植物或真菌的）吸器；一种特殊结构，可刺入寄主组织以吸收水分和养分"},"examples":[{"en":"Dodder uses haustoria to draw nutrients from the plants it wraps around.","zh":"菟丝子会用吸器从它缠绕的植物中吸取养分。"},{"en":"Under the microscope, the fungus’s haustorium can be seen pushing into the host cell.","zh":"在显微镜下，可以看到真菌的吸器伸入寄主细胞。"}]}],"synonyms":["absorbing organ","sucking organ"],"phonetic":"/hɔːˈstɔːriəm/","extraExplanation":["词源提示：来自拉丁语 *haurire*（意为“汲取、舀取”），所以 *haustorium* 直观上就是“用来汲取的结构”。","常见语境：植物学和真菌学里常讨论它与寄主的关系。吸器的功能是获取资源，并不等同于整株植物的“根”；例如槲寄生、菟丝子等寄生植物常被用作典型例子。","相关概念对比：英语里还会看到 *parasite*（寄生物）、*host*（寄主）、*nutrients*（养分）等词与之一起出现。"]}
{"word":"haustorium-related","summary":{"en":"connected with nutrient-absorbing penetrating structures in parasites.","zh":"与寄生体用于穿入并吸收养分的“吸器”有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected to or involving a haustorium (a specialized structure that penetrates a host to absorb nutrients, common in parasitic plants and many fungi).","zh":"与吸器（haustorium）有关的；涉及吸器的（吸器是寄生植物或许多真菌用来穿入宿主并吸收养分的特化结构）。"},"examples":[{"en":"The paper focuses on haustorium-related genes that help the parasite draw nutrients from the host.","zh":"这篇论文聚焦于与吸器相关的基因，这些基因帮助寄生体从宿主获取养分。"},{"en":"Microscopy revealed haustorium-related damage in the host’s leaf cells.","zh":"显微观察显示宿主叶细胞出现了与吸器相关的损伤。"}]}],"synonyms":["associated with haustoria","haustorial","connected","linked","associated"],"phonetic":"/hɔːˈstɔːriəm rɪˈleɪtɪd/","extraExplanation":["在植物病理学与真菌学里，haustorium 常被译为“吸器”。它不是“根”，而是寄生/共生生物用于穿透或紧贴宿主细胞、交换或吸收养分的结构。","在学术写作中，“X-related”常用来形成形容词，表示“与X相关/涉及X的”（如 disease-related, stress-related）。"],"etymology":"源自 haustorium（拉丁语，意为“取水器/舀取之物”，来自 haurire“舀取、汲取”）+ related（“相关的”）。合起来表示“与吸器有关的”。","mnemonic":["把 haustorium 想成“耗（haust-≈耗）宿主养分的器官”，因此 haustorium-related 就是“与吸器有关的”。","记 related = “有关的”；看到 “-related” 就可直译成“与……相关的”。"]}
{"word":"haustral","summary":{"en":"“Haustral” means “related to the haustra (pouch-like bulges) of the colon.”","zh":"“haustral”意为“与结肠的结肠袋（袋状膨出）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the haustra (the small pouch-like bulges) of the colon.","zh":"与结肠的结肠袋（结肠上呈袋状的膨出/小囊状隆起）有关的。"},"examples":[{"en":"The radiologist noted a haustral pattern on the abdominal X-ray.","zh":"放射科医生在腹部 X 光片上注意到结肠袋样的纹理。"},{"en":"Loss of normal haustral folds can suggest inflammation in the colon.","zh":"正常结肠袋皱襞的消失可能提示结肠存在炎症。"}]}],"synonyms":["colonic (context-dependent)","of the haustra"],"phonetic":"ˈhɔstrəl","extraExplanation":["“Haustral”常见于医学/解剖学语境，尤其是影像学报告（如X光、CT、钡剂灌肠检查）中，用来描述结肠外形上分段的“袋状”轮廓。","词根来自拉丁语 haustrum（意为“汲水器/桶”），引申为“容器、腔室”，与结肠呈分隔的“袋状”外观相呼应。"]}
{"word":"haustrum","summary":{"en":"A haustrum is a pouch-like bulge on the colon; plural: haustra.","zh":"haustrum 指结肠上的袋状隆起（结肠袋）；复数为 haustra。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the small pouch-like bulges (sacculations) along the large intestine (colon).","zh":"（解剖）结肠上的结肠袋：大肠表面一节一节隆起的袋状鼓起结构之一。"},"examples":[{"en":"On imaging, the radiologist noted normal haustrum patterns in the colon.","zh":"在影像检查中，放射科医生注意到结肠的结肠袋纹理呈正常表现。"},{"en":"Loss of haustrum markings can suggest inflammation in the large intestine.","zh":"结肠袋纹理消失可能提示大肠存在炎症。"},{"en":"The anatomy textbook labels each haustrum along the ascending colon.","zh":"解剖学教材标注了升结肠上的各个结肠袋。"}]}],"synonyms":["haustral pouch","colonic sacculation"],"phonetic":"/ˈhɔstrəm/","extraExplanation":["词源：来自拉丁语 *haustra*（意为“舀取器/汲取器”相关），在解剖学里借用来描述结肠像“分段的小囊袋”一样的外观；复数常用 **haustra**。","学习提示：在医学英语里更常见的是复数形式 **haustra**（例如“haustral folds/markings（结肠袋皱襞/纹理）”）。"]}
{"word":"haustus","summary":{"en":"A haustus is a single swallowed dose of liquid medicine.","zh":"haustus 指一次吞服的一剂液体药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine/Pharmacy) A single dose of a liquid medicine, meant to be swallowed at one time; a draught.","zh":"（医学/药学）一次口服的液体药剂量；一服（一次吞服的药液）。"},"examples":[{"en":"The doctor prescribed a haustus to be taken before bedtime.","zh":"医生开了一服药液，让他睡前服用。"},{"en":"In older prescriptions, “haustus” often meant a small medicinal drink.","zh":"在较早的处方里，“haustus”常指少量的药用液体。"}]}],"synonyms":["draught","dose","potion"],"phonetic":"/ˈhɔstəs/","extraExplanation":["“Haustus”来自拉丁语，原意与“喝/饮”有关，因此在传统药剂学里专指“一次喝下去的一剂药液”。","这个词在现代日常英语中很少见，更多出现在医学史、旧式处方、或英式/传统药房用语里。拼写上常见复数形式为“haustus”（不变）或“haustuses”（较少见）。"]}
{"word":"Haut","summary":{"en":"Haut means “high-class” or “aristocratic,” usually in French-style expressions.","zh":"Haut 表示“上流的/高端的”，多见于带法语风格的固定表达中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from French) high-class; aristocratic; stylish in an expensive, elite way (often seen in set phrases).","zh":"（源自法语）上流的；贵族气的；高端时尚的（多用于固定搭配中）。"},"examples":[{"en":"She dresses with a certain haut elegance that stands out at any event.","zh":"她的穿着有一种上流的优雅气质，在任何场合都很显眼。"},{"en":"They moved in haut circles of art collectors and designers.","zh":"他们活跃在艺术收藏家和设计师的上流圈子里。"},{"en":"The restaurant aims for a haut dining experience.","zh":"这家餐厅主打高端用餐体验。"}]}],"synonyms":["high-class","aristocratic","elite","upper-crust","posh"],"phonetic":"/oʊ/","extraExplanation":["“haut”在英语里通常带有法语借词的味道，常见于固定表达与品牌/文化语境中，比如：haute couture（高级定制时装）、haute cuisine（高级烹饪/精致料理）、haut monde（上流社会）。","注意拼写：在许多更常见的搭配里会出现“haute”（法语阴性形式），英语里也经常直接借用“haute”而不是单独用“haut”。","发音上，英语使用时多近似“oh”的音；书面语里偏正式、带一点“精英/上流”的文化色彩。"]}
{"word":"haut","summary":{"en":"Haut means “high/elite,” mainly seen in French-based phrases like *haut couture* (high-end fashion).","zh":"Haut 表示“高端/上流”的意思，多见于法语借词短语，如 *haut couture*（高级定制）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from French) “high” or “upper-class,” mainly used in set phrases like *haut couture* to suggest something high-end, elite, and fashionable.","zh":"（源自法语）“高的；上层的”，主要出现在固定搭配中（如 *haut couture*），带有“高端、精英、时尚”的意味。"},"examples":[{"en":"She loves reading about *haut couture* fashion shows in Paris.","zh":"她喜欢读关于巴黎 *高级定制（haut couture）* 时装秀的报道。"},{"en":"The restaurant tries to project a *haut* image, with white tablecloths and formal service.","zh":"这家餐厅想营造一种“高端”的形象，用白色桌布和正式服务。"},{"en":"They moved in *haut monde* circles during the film festival.","zh":"电影节期间，他们出入上流社交圈（*haut monde*）。"}]}],"synonyms":["high-end","upscale","elite","upper-class","luxury"],"phonetic":"/oʊ/","extraExplanation":["“haut”在英语里通常不单独使用，更常见于法语借词短语：\n- *haut couture*：高级定制（法律与行业语境中常指在法国符合标准的顶级定制服装）。\n- *haut monde*：上流社会、上层社交圈。\n语感上，它比单纯的“expensive（贵）”更强调“上档次、精英化、讲究品味”。"]}
{"word":"Haut-Rhin","summary":{"en":"a French department in northeastern France (Alsace area)","zh":"法国东北部阿尔萨斯地区的一个省级行政区（上莱茵省）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A department (administrative area) in the Grand Est region of northeastern France, historically part of Alsace, bordering Germany and Switzerland.","zh":"法国东北部大东部大区的一个省级行政区（省/县级单位：省会制的“省”——département），历史上属阿尔萨斯地区，毗邻德国与瑞士。"},"examples":[{"en":"Colmar is a major town in Haut-Rhin.","zh":"科尔马是上莱茵省的重要城市。"},{"en":"They drove through Haut-Rhin on their way to Switzerland.","zh":"他们去瑞士的路上经过了上莱茵省。"},{"en":"Haut-Rhin is known for Alsatian villages and vineyards.","zh":"上莱茵省以阿尔萨斯风格的村庄与葡萄园闻名。"}]}],"synonyms":["Upper Rhine","Haut-Rhin department","Alsace"],"phonetic":"/oʊ ˈrɪn/","extraExplanation":["发音提示：这是法语地名，英语语境里常用近似读法；中文常译作“上莱茵省”。","地理与文化背景：上莱茵省与“下莱茵省”（Bas-Rhin）一起构成传统的阿尔萨斯地区，饮食与建筑风格具有法德交融特色。"],"etymology":"法语地名：haut 意为“上部的/上游的”，Rhin 指“莱茵河（Rhine）”。合起来就是“上（游的）莱茵河地区/上莱茵”。","mnemonic":["记忆法：Haut ≈ “High/上”，Rhin ≈ “Rhine/莱茵”，连起来就是“上莱茵”。","联想：看到“-Rhin”就想到莱茵河流域；Haut- 表示“上游/北段/更靠上”。"]}
{"word":"hautain","summary":{"en":"Hautain means haughty or arrogantly superior (a French loanword sometimes used in English writing).","zh":"hautain 指“傲慢、自视甚高”（法语外来词，英语写作中偶尔使用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from French) Haughty; proudly arrogant in a way that shows you think you are better than others.","zh":"（源自法语）傲慢的；自视甚高的，表现出认为自己高人一等。"},"examples":[{"en":"She gave a hautain smile and walked past without saying hello.","zh":"她露出一个傲慢的微笑，连招呼都不打就走过去了。"},{"en":"His hautain attitude made it hard for the team to work with him.","zh":"他那种目中无人的态度让团队很难和他合作。"}]}],"synonyms":["haughty","arrogant","snobbish","condescending","superior"],"phonetic":"/oʊˈtæn/","extraExplanation":["“hautain”是法语词（法语读音大致为 /o.tɛ̃/），英语里偶尔作为外来词出现，多见于文学、评论或较正式的描写，用来营造一种“带法式气息的冷傲/矜贵”的感觉。日常英语里更常用 haughty、arrogant、snobbish、condescending。","语气强弱与侧重点：haughty 更偏“傲慢高高在上”；condescending 偏“居高临下地‘好心’”；snobbish 偏“势利、看不起人”；arrogant 更泛指“自大”。"]}
{"word":"hautbois","summary":{"en":"Hautbois is the French word for “oboe,” often seen in older or French-labeled musical scores.","zh":"Hautbois 是“oboe（双簧管）”的法语写法，常见于法语或较古老的乐谱标注中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An oboe (a woodwind instrument), especially the French term used in music contexts.","zh":"双簧管（木管乐器）；常作为法语词在音乐语境中使用。"},"examples":[{"en":"The melody is carried by the hautbois in the opening bars.","zh":"开头几小节的主旋律由双簧管（hautbois）奏出。"},{"en":"In Baroque scores, the instrument may be labeled “hautbois” instead of “oboe.”","zh":"在巴洛克时期的乐谱中，这件乐器可能标注为“hautbois”，而不是“oboe”。"}]}],"synonyms":["oboe"],"phonetic":"/ˈoʊbɔɪ/","extraExplanation":["“Hautbois”是法语，字面意思大致是“高（haut）木（bois）”，可理解为“高音木管”。英语里更常用“oboe”，但在法语标题、古乐/巴洛克作品说明、或强调法式风格时仍可能见到“hautbois”。","在一些历史语境中，“hautbois”也可泛指早期双簧管家族的乐器（如巴洛克双簧管），但日常理解通常就是现代意义的“双簧管”。"]}
{"word":"hautboy","summary":{"en":"Hautboy is an old-fashioned word for the oboe; it can also mean an old variety of strawberry.","zh":"Hautboy 是“双簧管（oboe）”的旧称；也可指一种古老品种的草莓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) An early name for the oboe, a double‑reed woodwind instrument with a clear, penetrating sound.","zh":"（古用语）双簧管（oboe）的旧称；一种使用双簧片的木管乐器，音色明亮、穿透力强。"},"examples":[{"en":"In old English writings, the hautboy often appears in descriptions of court music.","zh":"在一些古英语作品中，hautboy 常出现在对宫廷音乐的描写里。"},{"en":"The composer wrote a line for hautboy and strings.","zh":"作曲家为 hautboy 和弦乐写了一段旋律。"}]},{"partOfSpeech":"n.","definition":{"en":"A large, flavorful old variety of strawberry (often written as “hautboy strawberry”).","zh":"一种古老品种的大草莓（常写作“hautboy strawberry”，意为“豪特博伊草莓/旧品种草莓”）。"},"examples":[{"en":"The garden catalogue listed hautboy strawberry among heritage fruits.","zh":"园艺目录把 hautboy strawberry 列为传统（古老）水果品种之一。"}]}],"synonyms":["oboe","double-reed instrument"],"phonetic":"/ˈoʊbɔɪ/","extraExplanation":["“Hautboy”来自法语 **hautbois**（字面义为“高音木管”），早期英语里用来指今天的 **oboe（双簧管）**。随着拼写与用词规范化，现代英语更常用 *oboe*，而 *hautboy* 多见于历史、文学或仿古语境。"]}
{"word":"hautboyist","summary":{"en":"An old-fashioned word meaning an oboist (a person who plays the oboe).","zh":"古旧用法，指双簧管演奏者（oboist）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A musician who plays the hautboy (an old name for the oboe).","zh":"双簧管演奏者（“hautboy”是 oboe 的旧称）。"},"examples":[{"en":"In the old theatre program, a hautboyist was listed alongside the violinists.","zh":"在那份旧剧院节目单上，双簧管手（hautboyist）和小提琴手一起被列出。"},{"en":"The composer wrote a delicate solo for the hautboyist in the second act.","zh":"作曲家在第二幕为双簧管演奏者写了一段精致的独奏。"}]}],"synonyms":["oboist"],"phonetic":"/ˈhoʊtˌbɔɪ.ɪst/","extraExplanation":["“Hautboy”来自法语“hautbois”（直译“高木”/“高音木管”），在17—18世纪英语中常用来指今天的 oboe（双簧管）。因此“hautboyist”基本等同于“oboist”，但语感更古旧，多见于历史音乐、古乐（early music）或文学语境。"]}
{"word":"hautboys","summary":{"en":"Hautboys is an old plural form meaning “oboes,” the double-reed woodwind instruments.","zh":"hautboys 是旧式复数，意思是“双簧管（oboes）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old-fashioned word for the oboe, a woodwind instrument with a double reed; also used for someone who plays it.","zh":"（旧称）双簧管：一种使用双簧哨片的木管乐器；也可指双簧管演奏者。"},"examples":[{"en":"In the old score, the melody is written for two hautboys.","zh":"在这份旧乐谱里，旋律是写给两支双簧管（hautboys）的。"},{"en":"The orchestra added hautboys to brighten the sound.","zh":"乐队加入了双簧管（hautboys），让音色更明亮。"}]}],"synonyms":["oboe"],"phonetic":"/ˈhoʊtˌbɔɪ/","extraExplanation":["“hautboy”来自法语“hautbois”（意为“高音木管”），在17—18世纪的英语里常用来指今天的“oboe（双簧管）”。现代英语中多用“oboe”，而“hautboy”主要出现在古乐、历史文献或文学作品里。","拼写上你输入的是复数“hautboys”；单数是“hautboy”。法语原形“hautbois”的复数拼写在英语史料中也偶尔会出现。"]}
{"word":"haute","summary":{"en":"Haute means high-class and fashionable, often used in French-based phrases like haute couture and haute cuisine.","zh":"Haute 指高档、时髦，常用于法语借词搭配，如 haute couture（高级定制）和 haute cuisine（高级料理）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"High-class, fashionable, and usually associated with elite taste (often used in fashion, art, food, or society).","zh":"高档的；时髦的；带有上流社会品味的（常用于时尚、艺术、美食或社交场合）。"},"examples":[{"en":"She loves haute fashion and follows the latest Paris runway shows.","zh":"她喜欢高级时尚，关注巴黎最新的走秀。"},{"en":"The restaurant serves haute cuisine with beautifully plated dishes.","zh":"这家餐厅提供高级料理，摆盘精美。"},{"en":"It can sound a bit haute to talk like that at a casual party.","zh":"在轻松的聚会上那样说话，听起来可能有点“端着/高高在上”。"}]},{"partOfSpeech":"phrase","definition":{"en":"(In set phrases) “Haute couture”: custom-made high fashion by top design houses; “haute cuisine”: refined, high-end cooking.","zh":"（常见固定搭配）“haute couture”：高级定制服装；“haute cuisine”：精致高端的烹饪/高级料理。"},"examples":[{"en":"She bought a dress inspired by haute couture, but it wasn’t custom-made.","zh":"她买了一条受高级定制启发的裙子，但并不是量身定做的。"},{"en":"He trained in a kitchen known for haute cuisine techniques.","zh":"他在一家以高级料理技法闻名的厨房受训。"}]}],"synonyms":["high-end","upscale","luxury","fashionable","elite"],"phonetic":"/oʊt/","extraExplanation":["“haute”来自法语，字面意思是“高的”。英语里多用于法式表达，常带一点“精英/高端”的文化色彩。","发音提示：英语里常读作 /oʊt/（像“oat”），词尾的 e 不发音；不要按拼写读成“haw-tee”。","语气提醒：形容人或说话方式时（如“a bit haute”），可能暗示“傲慢、端着”，带轻微负面评价。"]}
{"word":"haute cuisine","summary":{"en":"fine, high-end cooking style","zh":"高级精致料理风格"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"High-end, refined cooking, especially the traditional style associated with French fine dining.","zh":"高档精致烹饪（尤指与法式高级餐饮相关的传统风格）。"},"examples":[{"en":"The restaurant is known for its haute cuisine and elegant service.","zh":"这家餐厅以高级精致的菜品和优雅的服务而闻名。"},{"en":"He trained in Paris and specialized in haute cuisine techniques.","zh":"他在巴黎受训，专攻法式高级烹饪技法。"}]}],"synonyms":["fine dining","gourmet cooking","high-end cuisine","haute gastronomy","French cuisine"],"phonetic":"/ˌoʊt kɥiˈzin/","extraExplanation":["在英语里常指“fine dining”那种讲究摆盘、酱汁、食材等级、工序与服务流程的菜系/风格，带有“正式、昂贵、传统”的语感。","拼写与发音都保留法语味道：haute 常不发出结尾的 t；cuisine 的 -sine 读音接近“兹因/兹尼”的感觉。"],"etymology":"源自法语：haute（“高的”）+ cuisine（“烹饪、菜肴”）。最初指“上层/高级的烹饪”，后来固定用来指法式传统的高级料理与精致餐饮文化。","mnemonic":["haute 听起来像“hot”（热的）+ “高”（高级）：“高端热厨”=高级料理。","把它想成“高（haute）级厨房（cuisine）”，对应中文“高级料理/精致餐饮”。"]}
{"word":"Haute-Savoie","summary":{"en":"a department in eastern France near the Alps","zh":"法国东部阿尔卑斯附近的一个省级行政区"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A department in eastern France in the Auvergne-Rhône-Alpes region, bordering Switzerland and Italy; its capital is Annecy.","zh":"法国东部奥弗涅-罗讷-阿尔卑斯大区的一个省（行政区），与瑞士、意大利接壤；首府为阿讷西（Annecy）。"},"examples":[{"en":"She spent the summer hiking in Haute-Savoie near Mont Blanc.","zh":"她夏天在上萨瓦省的勃朗峰附近徒步旅行。"},{"en":"Annecy is the prefecture (capital) of Haute-Savoie.","zh":"阿讷西是上萨瓦省的省会（行政中心）。"}]}],"synonyms":["Upper Savoy"],"phonetic":"/oʊt səˈvɔɪ/","extraExplanation":["这是法语专名，英文里通常直接使用法语拼写并加连字符：Haute-Savoie。中文常译作“上萨瓦省”。","文化地理联想：这里属于阿尔卑斯山区地带，常与勃朗峰（Mont Blanc）、阿讷西湖（Lake Annecy）等旅游/自然景观一起出现。"],"etymology":"法语地名：haute 意为“高的、上部的”，Savoie 为“萨瓦”。历史上萨瓦地区曾与萨丁王国、后并入法国有关；“Haute-”表示相对“上/北/更靠山地”的部分。","mnemonic":["把 haute 记成“高/上”（像中文“高地、上游”），Savoie 记成“萨瓦”；合起来就是“上萨瓦”。","看到 Haute- 可以联想法语里很多地名用它表示“上部/更高处”（如 Haute-Garonne），通常和地理位置或地势相关。"]}
{"word":"hautein","summary":{"en":"Haute means “high-end or elite,” usually used in French-style phrases like haute couture.","zh":"Haute 表示“高端、精英的”，多用于法语风格短语中，如 haute couture（高级定制）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(used in borrowed French phrases) high-class, fashionable, and associated with elite culture, especially in clothing and design.","zh":"（多用于法语借词短语中）高端的、时髦的、与上流或精英文化相关的，尤指服装与设计。"},"examples":[{"en":"She dreams of working in haute couture in Paris.","zh":"她梦想在巴黎从事高级定制服装（haute couture）行业。"},{"en":"The brand is known for its haute style and expensive materials.","zh":"这个品牌以高端风格和昂贵面料而闻名。"}]}],"synonyms":["high-end","upscale","elite","luxury","fashionable"],"phonetic":"/oʊt/","extraExplanation":["你输入的“hautein”通常不是标准英语单词；更常见的是法语借词“haute”（常出现在短语里，如 haute couture）。如果你想表达“高傲的/傲慢的”，英语更常用 haughty（/ˈhɔti/）。","“haute”来自法语，字面意思是“高的”。在英语里单独使用较少，最常见搭配是 haute couture（高级定制）以及偶尔出现的 haute cuisine（高级料理）。","在文化语境中，“haute”往往带有“精英、昂贵、讲究品味”的联想，属于时尚/艺术/餐饮领域的用语。"]}
{"word":"hautesse","summary":{"en":"Hautesse is a rare French-derived word meaning “highness” or great height; sometimes used in a literary sense for lofty dignity.","zh":"Hautesse 是源自法语的罕用词，表示“殿下/高贵的尊称”或“很高的高度”；也可作文学用语指崇高的气度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; from French) highness; great height or elevation.","zh":"（罕用；源自法语）“高贵/殿下”的尊称；高度、海拔（很高的高度）。"},"examples":[{"en":"From this haute­sse, the whole valley looked like a map.","zh":"从这处高地望去，整座山谷像一张地图。"},{"en":"In old diplomatic French, “Son Altesse” means “His Highness.”","zh":"在较旧的法语外交用语中，Son Altesse 表示“殿下/阁下（His Highness）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary, very rare) loftiness or noble dignity; a sense of being ‘above’ others.","zh":"（文学用法，极罕用）崇高、尊贵的气度；自觉“高人一等”的姿态（偏书面）。"},"examples":[{"en":"She carried herself with a quiet haute­sse, speaking gently but firmly.","zh":"她举止间带着一种安静的高贵气度，说话温和却坚定。"},{"en":"The narrator mocks his false haute­sse and empty pride.","zh":"叙述者嘲讽他虚假的“高贵姿态”和空洞的自尊。"}]}],"synonyms":["highness","height","altitude","loftiness","elevation"],"phonetic":"oʊˈtɛs","extraExplanation":["“hautesse”在英语里非常少见，多见于引用法语的语境（历史、外交、贵族称谓）或刻意的文学风格中。现代英语更常用 highness（尊称）或 height/altitude（高度、海拔）。","容易和法语/英语里的 hauteur（傲慢、盛气凌人；或高度）混淆：hauteur 在英语中更常见，且“傲慢”义更突出。"]}
{"word":"hauteur","summary":{"en":"“Hauteur” usually refers to a high-ranking person (often humorously) or, less commonly, an arrogant, superior attitude.","zh":"“hauteur”通常指“显贵人物”（常带调侃），较少见地也可指“傲慢的优越感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high or high-ranking person; a noble or notable figure (often used humorously or slightly sarcastically).","zh":"高位者；显贵人物（常带幽默或轻微讽刺语气）。"},"examples":[{"en":"He arrived late and acted like some great hauteur, expecting everyone to wait for him.","zh":"他迟到了，却摆出一副大人物的样子，好像大家都该等他。"},{"en":"Don’t mind her—she likes to play the hauteur in front of new employees.","zh":"别理她——她喜欢在新员工面前装成大人物。"}]},{"partOfSpeech":"n.","definition":{"en":"Arrogant pride; a proud, superior attitude (a less common use; more often you’ll see “haughty” or “haughtiness” for this meaning).","zh":"傲慢；自负的优越感（较少见；更常用 haughty / haughtiness 表达此义）。"},"examples":[{"en":"His hauteur made it hard for people to talk to him.","zh":"他的傲慢让人很难和他交流。"},{"en":"She spoke with hauteur, as if the rules didn’t apply to her.","zh":"她说话带着傲慢，好像规则对她不适用。"}]}],"synonyms":["big shot","VIP","noble","arrogance","pride","haughtiness"],"phonetic":"/oʊˈtɝː/","extraExplanation":["“hauteur”是从法语借入英语的词，发音和拼写都带法语风格。在现代英语里，它不算高频词，常见于较正式或带讽刺的语境。","注意区分：英语里更常用的形容词是“haughty（傲慢的）”，名词是“haughtiness（傲慢）”。“hauteur”在表达“傲慢”时偏文学/修辞色彩。"]}
{"word":"hauteurs","summary":{"en":"“Hauteurs” means proud, superior attitudes (most common); more rarely, it can mean heights or high places.","zh":"“hauteurs”通常指“傲慢、自命不凡的态度”；较少情况下也可指“高处/高地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proud, unfriendly, or superior manner; haughtiness (plural form)","zh":"傲慢的态度；自命不凡（复数形式）"},"examples":[{"en":"He spoke with hauteur, as if everyone else were beneath him.","zh":"他说话带着傲慢的口气，好像别人都不如他。"},{"en":"Her cold smile and her hauteurs made the guests uncomfortable.","zh":"她冷淡的微笑和傲慢的姿态让客人们很不自在。"},{"en":"Try to be confident without the hauteurs that push people away.","zh":"要自信，但别用那种会把人推开的傲慢态度。"}]},{"partOfSpeech":"n.","definition":{"en":"heights; high places (rare in modern English; plural form)","zh":"高处；高地（现代英语中较少见；复数形式）"},"examples":[{"en":"The hikers moved from the valley up toward the hauteurs of the mountains.","zh":"徒步者从山谷向群山的高处前进。"},{"en":"Birds circled in the hauteurs above the cliffs.","zh":"鸟儿在悬崖上方的高空盘旋。"}]}],"synonyms":["haughtiness","arrogance","superiority","condescension","aloofness"],"phonetic":"/hoʊˈtɝː/","extraExplanation":["“hauteurs”是“hauteur”的复数。这个词来自法语，常见于较正式或文学性的英语里，用来表达一种“高高在上”的姿态或语气。","在现代英语中，最常用的含义是“傲慢/自命不凡”；表示“高处/高地”的用法更偏文学或少见。"]}
{"word":"hauyne","summary":{"en":"Hauyne is a rare blue mineral found in volcanic rocks, mainly valued by collectors and sometimes used as a gemstone.","zh":"Hauyne 是一种产于火山岩中的罕见蓝色矿物，主要用于矿物收藏，有时也可作为宝石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare blue mineral (a kind of feldspathoid) found in some volcanic rocks; used mainly by collectors and sometimes as a gemstone","zh":"一种罕见的蓝色矿物（长英质副矿物/似长石矿物的一种），常见于某些火山岩中；主要供矿物收藏，有时也可作宝石"},"examples":[{"en":"Hauyne often appears as bright blue grains in volcanic rocks.","zh":"方钠石（hauyne）常以亮蓝色颗粒的形式出现在火山岩中。"},{"en":"The jeweler showed a small hauyne gem because of its unusual color.","zh":"珠宝商展示了一颗小的方钠石宝石，因为它的颜色很特别。"}]}],"synonyms":["haüyne"],"phonetic":"/haʊˈiːn/","extraExplanation":["Hauyne 也常见拼写为 haüyne（带变音符），中文里有时译作“方钠石”。它的名字来自法国矿物学家 René Just Haüy（阿于/阿维），很多矿物命名会用科学家的姓氏来纪念其贡献。","它通常产于含碱的火山岩（如某些玄武岩或霞石岩）中，颜色可从浅蓝到深蓝，偶尔也会呈灰白或带绿色。作为宝石时较少见，硬度与耐久性也会影响其适用场景。"]}
{"word":"hauynite","summary":{"en":"Hauynite is a rare blue mineral found in some volcanic rocks and sometimes used as a gemstone.","zh":"Hauynite 是一种较少见的蓝色矿物，常见于某些火山岩中，偶尔可作宝石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare blue (sometimes gray, green, or yellow) mineral in the feldspathoid group, found in some volcanic rocks and used occasionally as a gemstone; also spelled \"hauyne\".","zh":"一种较少见的蓝色（有时呈灰、绿或黄）矿物，属于长石似矿物（似长石矿物）一类，常见于某些火山岩中，偶尔可作宝石；也可拼作“hauyne”。"},"examples":[{"en":"Hauynite is often associated with volcanic rocks such as phonolite.","zh":"Hauynite 常与响岩等火山岩伴生。"},{"en":"The jeweler showed a small hauynite gem with an intense blue color.","zh":"珠宝商展示了一颗颜色非常浓郁的蓝色 hauynite 小宝石。"}]}],"synonyms":["hauyne"],"phonetic":"ˈhaʊ.naɪt","extraExplanation":["“Hauynite / hauyne”这个词来自矿物学命名，源于人名（常见于以发现者/研究者命名的矿物）。在实际英语语境里更偏专业，多出现在地质学、矿物学与宝石学材料中。","学习时可顺带记：-ite 常见于矿物名后缀（如 graphite 石墨、hematite 赤铁矿），表示“某种矿物/岩石”。"]}
{"word":"hauynophyre","summary":{"en":"Hauynophyre is a rare geology term for a volcanic rock that contains the mineral hauyne.","zh":"Hauynophyre 是地质学里很少见的术语，指含有方钠石（hauyne）的火山岩（斑状岩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of volcanic rock (a kind of porphyry) that contains the mineral hauyne, often with other minerals like feldspar; used mainly as a technical geology term.","zh":"一种含有方钠石（hauyne）矿物的火山岩（斑状火成岩的一种），常与长石等矿物共生；主要用于地质学专业语境。"},"examples":[{"en":"The sample was identified as hauynophyre because it contains visible hauyne crystals.","zh":"由于样品中能看到方钠石晶体，它被鉴定为方钠石斑岩（hauynophyre）。"},{"en":"Hauynophyre is discussed mostly in geology reports rather than everyday English.","zh":"“Hauynophyre”多见于地质报告中，而不是日常英语。"}]}],"synonyms":["haüynophyre","haüyne-phyre"],"phonetic":"/haʊˈiːnoʊˌfaɪr/","extraExplanation":["该词非常少见，常见拼写也包括 **haüynophyre / haüyne-phyre**（带分音符的写法在学术文献里更常出现）。","词源上，**hauyne（方钠石）**这个矿物名来自法国矿物学家 René Just Haüy；后缀 **-phyre** 常用于一些火山岩/斑岩类岩石名称。"]}
{"word":"hauzijan","summary":{"en":"“hauzijan” isn’t a recognized English word; it’s likely a name/username or transliteration.","zh":"“hauzijan”不是标准英语单词；更可能是名字/用户名或音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a username, brand/name, or a transliteration from another language.","zh":"不是标准英语单词。更可能是用户名、品牌/名字，或来自其他语言的音译/拼写。"},"examples":[{"en":"My handle on the forum is “hauzijan.”","zh":"我在论坛上的用户名是“hauzijan”。"},{"en":"I saw “hauzijan” in the comments, but I’m not sure how to pronounce it.","zh":"我在评论区看到了“hauzijan”，但不确定怎么读。"}]}],"phonetic":"/haʊˈziˌdʒæn/","extraExplanation":["“hauzijan”看起来像是拼音/外语转写（例如中文拼音一类），但它本身并不是常见英语词条，所以没有固定的英文释义。","如果你希望我帮你准确解释，请你补充：它出现的语境（一句话/截图）、你想表达的语言（英语/中文/其他）、或你认为正确的拼写（是否应为 howzit, houzi, jan 等）。","若把它当作英语里的“自造词/昵称”来读，上面的 IPA 只是按字母拼写给出的近似发音，并非权威读音。"]}

