{"word":"hav","summary":{"en":"“hav” is usually a nonstandard spelling of “have,” or an acronym whose meaning depends on context.","zh":"“hav”通常是“have”的非标准拼写，或是需要结合语境理解的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form of “have,” sometimes seen in casual texting or notes.","zh":"“have”的非标准拼写或拼写错误，有时在随意的短信或笔记中出现。"},"examples":[{"en":"I hav no time right now—I'll call you later.","zh":"我现在没时间——我晚点打给你。"},{"en":"In formal writing, use “have,” not “hav.”","zh":"在正式写作中要用“have”，不要用“hav”。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation/acronym used in some fields (meaning depends on context).","zh":"某些领域里的缩写（具体含义取决于语境）。"},"examples":[{"en":"In IT, HAV can refer to “high availability.”","zh":"在信息技术领域，HAV 可能指“高可用性”。"},{"en":"Ask what HAV means in this document—it may be a project-specific abbreviation.","zh":"问清楚这份文件里 HAV 的意思——它可能是项目内部的缩写。"}]}],"synonyms":["have"],"phonetic":"/hæv/","extraExplanation":["“hav”在标准英语里不是常规单词；如果你想表达“拥有/已经/必须”等意思，通常应写作 **have**。","如果你是在某个专业文本里看到 HAV（全大写），更可能是缩写；需要结合行业和上下文判断。你可以把原句发我，我能帮你确定。"]}
{"word":"havage","summary":{"en":"“Havage” is usually a misspelling of “havoc,” meaning great destruction or chaos; it can also be used as a verb in some contexts.","zh":"“havage”通常是把“havoc”拼错了；“havoc”指严重破坏或混乱，也可作动词（但更常见搭配是wreak havoc）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly intended word: **havoc**) Widespread destruction, damage, or disorder; a chaotic situation.","zh":"（通常你想写的是 **havoc**）大规模的破坏、损害或混乱；一片失控的局面。"},"examples":[{"en":"The storm caused havoc along the coast.","zh":"暴风雨在海岸造成了严重破坏。"},{"en":"A power outage can create havoc in a hospital.","zh":"停电可能会让医院陷入混乱。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause a lot of damage or trouble; to badly disrupt something.","zh":"造成严重破坏或麻烦；使某事严重失序。"},"examples":[{"en":"The virus can havoc the immune system if untreated.","zh":"如果不治疗，这种病毒可能会严重破坏免疫系统。"},{"en":"Heavy traffic havoced our schedule (more common: “wreaked havoc on our schedule”).","zh":"严重拥堵把我们的安排搅乱了（更常见说法：wreaked havoc on our schedule）。"}]}],"synonyms":["destruction","chaos","disorder","devastation","turmoil"],"phonetic":"/ˈhævək/","extraExplanation":["“havage”在现代英语里几乎不作为标准拼写使用；在一些旧文献中可能见到它作为“havoc（破坏/劫掠）”的罕见变体。","固定搭配更常用：**wreak havoc (on...)**（对……造成严重破坏/混乱）。文学/历史语境里还有短语 **cry havoc**（源自莎士比亚），意思是“发出进攻/杀戮的号令，引发大乱”。"]}
{"word":"havaiki","summary":{"en":"Hawaiki is the ancestral homeland in Māori/Polynesian tradition, often a spiritual place of origin (and sometimes where spirits return).","zh":"Hawaiki 是毛利/波利尼西亚传统中的祖先故乡，常被视为精神上的起源之地（有时也是灵魂归去之处）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Māori and wider Polynesian traditions) the ancestral homeland—often described as a spiritual place of origin (and sometimes a destination of spirits after death).","zh":"（毛利及更广泛的波利尼西亚传统中）祖先的故乡——常被描述为起源之地（也常被视为灵魂归去之处）。"},"examples":[{"en":"In Māori stories, Hawaiki is remembered as the place the ancestors came from.","zh":"在毛利的故事中，Hawaiki 被记作祖先来时的地方。"},{"en":"Some traditions say the spirits travel back to Hawaiki after death.","zh":"一些传统认为人死后灵魂会回到 Hawaiki。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used in research and discussion to refer to a shared origin idea across Polynesia, related to similar names such as Hawaiʻi, Savaiʻi, and Avaiki.","zh":"在研究与讨论中，用来指涉波利尼西亚各地“共同起源”观念的名称；与 Hawaiʻi、Savaiʻi、Avaiki 等相似名称有关联。"},"examples":[{"en":"Linguists compare words like Hawaiki and Hawaiʻi when discussing Polynesian history.","zh":"语言学家在讨论波利尼西亚历史时，会比较 Hawaiki 和 Hawaiʻi 这样的词。"},{"en":"Different islands have their own version of the Hawaiki homeland story.","zh":"不同岛屿都有各自关于 Hawaiki 祖居地的版本故事。"}]}],"synonyms":["ancestral homeland","mythic homeland","Hawaiʻi (related name)","Avaiki (related name)","Savaiʻi (related name)"],"phonetic":"/hɑːˈwaɪki/","extraExplanation":["“Hawaiki”主要出现在毛利与波利尼西亚口述传统中，更多是文化与精神意义上的“祖源之地”，不一定等同于一张地图上能明确定位的现代国家。","它和“Hawaiʻi（夏威夷）/Savaiʻi（萨摩亚的萨瓦伊岛）/Avaiki”等名称常被一起讨论，因为这些词形相近，可能反映了古代波利尼西亚航海迁徙与共同祖源的记忆。","在英文写作里常把它当作专名使用：通常首字母大写（Hawaiki）。"]}
{"word":"havaikian","summary":{"en":"Havaikian is usually a surname (a family name), likely Armenian in origin, and is not a common English vocabulary word.","zh":"Havaikian 通常是一个姓氏（家族姓），很可能源自亚美尼亚，并不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), most likely of Armenian origin, used to identify a person or family.","zh":"一个姓氏（家族姓），很可能源自亚美尼亚，用来指代某个人或某个家族。"},"examples":[{"en":"Ms. Havaikian will speak at the event tomorrow.","zh":"Havaikian 女士将于明天在活动上发言。"},{"en":"I saw the name Havaikian on the list of participants.","zh":"我在参与者名单上看到了 Havaikian 这个名字。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used like an adjective to describe something related to a person or family with this surname.","zh":"可作类似形容词的用法，表示“与姓 Havaikian 的人/家族有关的”。"},"examples":[{"en":"That scholarship is funded by a Havaikian family foundation.","zh":"那个奖学金由 Havaikian 家族基金会资助。"}]}],"phonetic":"/ˌhævəˈkiːən/","extraExplanation":["“Havaikian”不是常见英语词汇，更常见于人名（姓氏）。如果你本来想查的是 “Hawaiian”（夏威夷的/夏威夷人），拼写会非常接近但含义完全不同。","很多亚美尼亚姓氏以 -ian / -yan 结尾，常带有“某人的后代/属于某个家族”的含义；因此 Havaikian 往往更像一个家族姓而不是普通词。"]}
{"word":"Havana","summary":{"en":"Havana is the capital of Cuba; it can also describe Cuban-associated style, especially cigars and rum.","zh":"Havana 指古巴首都哈瓦那；也可形容与古巴相关的风格，尤指雪茄与朗姆酒等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Cuba, a major port on the north coast, known for its historic Old Havana, classic architecture, music, and Caribbean culture.","zh":"哈瓦那：古巴的首都和重要港口城市，位于北海岸，以“老哈瓦那”的历史街区、经典建筑、音乐与加勒比文化闻名。"},"examples":[{"en":"Havana is famous for its colorful buildings and the historic area called Old Havana.","zh":"哈瓦那以色彩丰富的建筑和名为“老哈瓦那”的历史街区而闻名。"},{"en":"They traveled to Havana to learn about Cuban music and dance.","zh":"他们去哈瓦那学习古巴音乐和舞蹈。"}]},{"partOfSpeech":"adj.","definition":{"en":"A style of cigar, rum, or anything associated with Cuba, especially with traditional Cuban quality or flavor (often used as a modifier).","zh":"（常作修饰语）哈瓦那的／古巴的：指与古巴相关的风格或特征，常见于雪茄、朗姆酒等，带有传统古巴的品质或风味之意。"},"examples":[{"en":"He bought a Havana cigar for a special occasion.","zh":"他为特别的场合买了一支哈瓦那雪茄。"},{"en":"The bar serves Havana-style rum cocktails.","zh":"这家酒吧供应哈瓦那风格的朗姆鸡尾酒。"}]}],"synonyms":["Havana (La Habana)","Cuban capital"],"phonetic":"/həˈvænə/","extraExplanation":["“Havana”在英语里通常指城市本身；在商品或描述中也常用来唤起“古巴风情”的联想（如雪茄、朗姆酒、音乐）。","文化提示：在一些语境里提到哈瓦那雪茄（Havana cigar）会让人联想到高品质古巴雪茄，但由于历史与贸易政策等原因，不同国家对“古巴雪茄”的获取与称呼可能有所差异。"]}
{"word":"havana","summary":{"en":"Havana is the capital of Cuba; it can also mean a Cuban (style) cigar.","zh":"Havana 指古巴首都哈瓦那；也可指古巴（风格的）雪茄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Cuba, on the north coast; a major cultural and historical center in the Caribbean.","zh":"哈瓦那（古巴首都，位于北部海岸；加勒比地区重要的文化与历史中心）。"},"examples":[{"en":"Havana is famous for its colorful old buildings and music.","zh":"哈瓦那以色彩鲜艳的老建筑和音乐闻名。"},{"en":"We spent a day walking through Old Havana.","zh":"我们花了一天在哈瓦那老城散步。"}]},{"partOfSpeech":"n.","definition":{"en":"A Cuban cigar (or a cigar in the Cuban style).","zh":"哈瓦那雪茄；古巴雪茄（或古巴风格的雪茄）。"},"examples":[{"en":"He bought a Havana as a special gift.","zh":"他买了一支哈瓦那雪茄作为特别的礼物。"},{"en":"Some shops advertise “Havanas,” but not all are made in Cuba.","zh":"有些商店会标榜“哈瓦那雪茄”，但并不都是古巴制造。"}]}],"synonyms":["La Habana"],"phonetic":"/həˈvænə/","extraExplanation":["“Havana”来自西班牙语地名“La Habana”（哈瓦那）。谈到城市时常见搭配有：Old Havana（哈瓦那老城）、Havana Harbor（哈瓦那港）。","在英语里把雪茄称为“a Havana”带有文化联想：古巴雪茄以品质与传统著称，因此该用法常出现在旅行、历史或生活方式类语境中。"]}
{"word":"Havana-related","summary":{"en":"connected with Havana or characteristic of it","zh":"与哈瓦那有关或具哈瓦那特色的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Havana (the capital city of Cuba), or typical of Havana’s culture, people, or style","zh":"与哈瓦那（古巴首都）有关的；具有哈瓦那特色的（文化、人物或风格等）"},"examples":[{"en":"The museum hosted a Havana-related photo exhibition about street life in the 1950s.","zh":"博物馆举办了一个与哈瓦那有关的摄影展，主题是20世纪50年代的街头生活。"},{"en":"She’s doing Havana-related research on Cuban music and dance.","zh":"她正在做与哈瓦那有关的研究，内容是古巴音乐与舞蹈。"},{"en":"The restaurant has a Havana-related theme, with old movie posters and live salsa.","zh":"这家餐厅走哈瓦那风主题，墙上有老电影海报，还有现场萨尔萨表演。"}]}],"synonyms":["related to Havana","Havana-connected","Havanese"],"phonetic":"/həˈvænə rɪˈleɪtɪd/","extraExplanation":["写作中常见的搭配是 “Havana-related + 名词”（如 Havana-related history/research/culture）。在更正式的写作里，也可以用 “related to Havana”。"],"etymology":"“Havana”来自西班牙语城市名“Habana”；“related”来自拉丁语词根，意为“连接、联系”。合起来就是“与哈瓦那有关的”。","mnemonic":["记忆法：把它拆开记——Havana（哈瓦那）+ related（相关的）= 哈瓦那相关的。","联想：看到“related”就想“有关系/有关联（相关）”，加上地名就表示“与某地有关”。"]}
{"word":"havance","summary":{"en":"“Havance” is likely a misspelling of “advance,” meaning to move forward, to promote progress, or (as a noun) progress/innovation or an early payment.","zh":"“havance”很可能是“advance”的拼写错误，意思可以是前进/推进、促进发展；作名词时也可指进步/创新或预付款。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move forward; to make progress","zh":"前进；推进；取得进展"},"examples":[{"en":"The army advanced toward the city at dawn.","zh":"军队在黎明时向城市推进。"},{"en":"Her English has advanced a lot this year.","zh":"她的英语今年进步很大。"}]},{"partOfSpeech":"vt.","definition":{"en":"to help something develop or succeed; to promote","zh":"促进；推动；提升（某事的发展或成功）"},"examples":[{"en":"The new policy aims to advance education in rural areas.","zh":"这项新政策旨在促进农村地区的教育发展。"},{"en":"She worked hard to advance her career.","zh":"她努力工作来推进自己的职业发展。"}]},{"partOfSpeech":"n.","definition":{"en":"an improvement or progress","zh":"进步；进展；改进"},"examples":[{"en":"There have been major advances in medicine.","zh":"医学方面有了重大进步。"},{"en":"This invention is a big advance over older designs.","zh":"这项发明比旧设计有很大改进。"}]},{"partOfSpeech":"n.","definition":{"en":"money paid before it is earned; an early payment","zh":"预付款；预支（工资/费用）"},"examples":[{"en":"He received an advance on his salary.","zh":"他预支了一部分工资。"},{"en":"The publisher paid the author an advance.","zh":"出版社给作者支付了预付款。"}]}],"synonyms":["progress","move forward","develop","promote","improve"],"phonetic":"/ədˈvæns/","extraExplanation":["“havance”本身不是常见英文单词，更可能是拼写错误，通常想写的是“advance”。如果你告诉我它出现的句子或上下文，我也可以帮你确认具体想表达哪个词。","“advance”既可以表示“前进/进步”，也可以表示“预付款”。在学习时可以用语境区分：谈发展变化多是“进步”，谈钱款时间先后多是“预付”。"]}
{"word":"havanese","summary":{"en":"Havanese most commonly means a small Cuban toy dog breed; it can also mean “from Havana.”","zh":"Havanese 最常指古巴的哈瓦那犬；也可表示“来自/关于哈瓦那的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small toy dog breed from Cuba with long, silky (often wavy) hair; known for being friendly and good as a companion dog","zh":"哈瓦那犬（源自古巴的小型玩具犬品种，毛发长而柔顺常带波浪；以亲人、适合作伴侣犬著称）"},"examples":[{"en":"My neighbor has a Havanese that loves meeting new people.","zh":"我邻居养了一只哈瓦那犬，很喜欢认识新朋友。"},{"en":"Havanese dogs are often kept as companion pets in apartments.","zh":"哈瓦那犬常被当作公寓里的伴侣宠物犬饲养。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Havana (the capital city of Cuba)","zh":"与哈瓦那（古巴首都）有关的；哈瓦那的"},"examples":[{"en":"We listened to Havanese music at the festival.","zh":"我们在节日上听了哈瓦那风格的音乐。"},{"en":"She tried a Havanese-style coffee drink.","zh":"她尝了一种哈瓦那风格的咖啡饮品。"}]}],"synonyms":["Havana dog (common description)","Havana-related (adj. meaning)"],"phonetic":"/ˌhæv.əˈniːz/","extraExplanation":["在日常英语里，capitalization 很重要：**Havanese** 大写时通常指“哈瓦那犬”这个犬种；小写 **havanese** 有时被当作形容词用，表示“与哈瓦那有关”。","哈瓦那犬属于玩具犬（toy dog）类型，在英语宠物圈中常见相关词：**companion dog（伴侣犬）**、**grooming（梳理/美容）**、**hypoallergenic（低致敏的，常被宣传但不等于完全不过敏）**。"]}
{"word":"Havarti","summary":{"en":"a mild, creamy semi-soft Danish cheese","zh":"一种温和奶香的半软质丹麦奶酪"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mild, buttery, semi-soft Danish cheese, often eaten in slices or used in sandwiches and melting dishes","zh":"一种口味温和、奶油感明显的半软质丹麦奶酪，常切片食用，也常用于三明治或需要融化的料理"},"examples":[{"en":"I bought Havarti for grilled cheese sandwiches.","zh":"我买了哈瓦蒂奶酪来做烤奶酪三明治。"},{"en":"Havarti melts smoothly and tastes creamy.","zh":"哈瓦蒂奶酪融化得很顺口，味道很奶香。"},{"en":"Try Havarti with crackers and grapes for a simple snack.","zh":"试试用哈瓦蒂奶酪配饼干和葡萄，当作简单点心。"}]}],"synonyms":["Danish cheese","semi-soft cheese","table cheese"],"phonetic":"/həˈvɑrti/","extraExplanation":["在北美超市里，Havarti 常见于冷藏奶酪区，通常是切片或块状。口味偏清淡、奶香和黄油感明显，适合不爱重口味奶酪的人。","常见搭配：火腿/火鸡肉三明治、烤吐司、汉堡、奶酪拼盘（配饼干、水果、坚果）。有时也会做成带香草、胡椒或莳萝（dill）的风味款。"],"etymology":"源自丹麦语名称，取自19世纪丹麦一座农庄（Havarthigaard）的名字；后来用作该类型奶酪的名称，并在英语中以专有名词形式使用。","mnemonic":["把它想成“哈—哇—提”，像是在说“哈，我哇（挖）到好吃的奶酪，快提回家！”帮助记住是可切片的奶酪。","联想用法：Havarti 常用来做热三明治，记成“哈瓦蒂=好融化、好夹在吐司里”。"]}
{"word":"havarti","summary":{"en":"Havarti is a mild, creamy Danish semi-soft cheese, great for slicing or melting.","zh":"Havarti（哈瓦蒂）是一种温和、奶香浓郁的丹麦半软质奶酪，适合切片或加热融化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A semi-soft, mild, creamy cheese, originally from Denmark, often eaten in slices or melted in sandwiches.","zh":"哈瓦蒂奶酪（原产丹麦的一种半软质、味道温和、口感奶油般顺滑的奶酪），常切片直接吃或用于三明治加热融化。"},"examples":[{"en":"I like havarti on grilled cheese sandwiches because it melts smoothly.","zh":"我喜欢用哈瓦蒂奶酪做烤芝士三明治，因为它融化得很顺滑。"},{"en":"The salad comes with apples, walnuts, and cubes of havarti.","zh":"这份沙拉配有苹果、核桃和哈瓦蒂奶酪丁。"}]}],"synonyms":["Danish havarti","semi-soft cheese","mild cheese"],"phonetic":"/həˈvɑrti/","extraExplanation":["“Havarti”常见于英文菜单或超市冷藏柜。口味通常比切达（cheddar）更温和、质地更柔软；有时会出现“dill havarti”（莳萝哈瓦蒂）等带香草调味的版本。","发音里重音一般落在第二个音节（-VAR-）。在点餐时也常直接说“havarti cheese”。"]}
{"word":"havartis","summary":{"en":"“Havartis” is the plural form of “Havarti,” a mild semi-soft Danish cheese.","zh":"“Havartis”是“Havarti”的复数，指一种温和的丹麦半软质奶酪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Havartis (plural of Havarti): a mild, semi-soft Danish cheese, often sliced for sandwiches or melted in cooking.","zh":"Havartis（Havarti 的复数）：一种口味温和、半软质的丹麦奶酪，常用于三明治切片或烹饪加热融化。"},"examples":[{"en":"I bought two kinds of Havartis for the cheese board: plain and dill.","zh":"我买了两种 Havarti 奶酪做拼盘：原味和莳萝味的。"},{"en":"Havartis melt well, so they’re great in grilled cheese sandwiches.","zh":"Havarti 很容易融化，所以很适合做烤奶酪三明治。"}]}],"synonyms":["Havarti cheese","Danish cheese"],"phonetic":"/həˈvɑrti/","extraExplanation":["“Havarti”通常写作单数，复数是“havartis”。在菜单或超市标签上也常直接写“Havarti cheese”。","你输入的“havartis”也可能是把公司名“Novartis（诺华）”拼错了。如果你想查的是“Novartis”，告诉我我可以给你正确释义与用法。"]}
{"word":"havdalah","summary":{"en":"Havdalah is a Jewish ritual that marks the end of Shabbat (and some holidays), separating sacred time from the regular week.","zh":"Havdalah（哈夫达拉）是犹太教在安息日（及部分节期）结束时举行的仪式，用来区分神圣时间与日常一周。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Jewish ceremony held after Shabbat (the Sabbath) and some holidays to mark the “separation” between sacred time and the ordinary week, usually involving blessings over wine, spices, and a braided candle","zh":"（犹太教）哈夫达拉仪式：在安息日（Shabbat）或部分节期结束后举行的仪式，用来标志“神圣时间与日常时间的分隔”，通常包含对酒、香料和编织蜡烛的祝福"},"examples":[{"en":"We stayed for Havdalah after Shabbat ended.","zh":"安息日结束后，我们留下来参加哈夫达拉仪式。"},{"en":"During Havdalah, she held the spice box and took a deep breath.","zh":"在哈夫达拉仪式中，她拿着香料盒深吸一口气。"},{"en":"The braided candle is a familiar symbol of Havdalah.","zh":"编织蜡烛是哈夫达拉仪式常见的象征。"}]}],"synonyms":["Shabbat-ending ceremony","Jewish separation ritual","Havdalah service"],"phonetic":"/hɑːvˈdɑːlə/","extraExplanation":["Havdalah 来自希伯来语，意思是“分开、区分”。它强调从安息日的宁静与神圣，过渡回一周的日常生活。","常见元素包括：一杯酒（象征祝福与喜乐）、香料（象征安息日的“余香”或精神慰藉）、多股编织蜡烛（象征光明与新的开始），最后会把蜡烛熄灭，象征安息日结束。","在不同社群与家庭中，具体顺序与旋律可能略有差异；有时节期结束也会做类似的 Havdalah。"]}
{"word":"havdalahs","summary":{"en":"“Havdalahs” means more than one Havdalah ceremony, a Jewish ritual ending Shabbat and beginning the new week.","zh":"“Havdalahs”指多个 Havdalah 仪式，即犹太教在安息日结束时举行、迎接新一周开始的仪式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Havdalah: Jewish ceremonies marking the end of the Sabbath (Shabbat) and the start of a new week, usually involving blessings over wine, fragrant spices, and a braided candle.","zh":"Havdalah 的复数：犹太教中用来标志安息日（Shabbat）结束、进入新一周的仪式，通常包括对葡萄酒、香料和编织蜡烛的祝福。"},"examples":[{"en":"Many families hold Havdalahs on Saturday night after Shabbat ends.","zh":"很多家庭会在周六晚安息日结束后举行多次（或不同家庭各自举行）Havdalah 仪式。"},{"en":"The community center hosted Havdalahs with singing, wine, spices, and candlelight.","zh":"社区中心举办了 Havdalah 仪式活动，有歌唱、葡萄酒、香料和烛光。"}]}],"synonyms":["Havdalah ceremonies","post-Shabbat ceremonies"],"phonetic":"/ˌhɑvˈdɑlɑ/","extraExplanation":["“Havdalah”源自希伯来语，意为“分别/区分”，强调把神圣的安息日与日常的工作周区分开来。","在英语里更常见的写法是单数“Havdalah”，复数写作“Havdalahs”。也常见说法：“make Havdalah / do Havdalah”（做完哈夫达拉仪式）。","在一些文学与文化描写中，Havdalah 常被用来营造从宁静的安息日过渡到现实生活的氛围（如烛光、香料的气味、合唱的旋律等）。"]}
{"word":"have","summary":{"en":"Have is a very common verb meaning ‘own,’ ‘experience,’ ‘eat/drink,’ or ‘cause,’ and it also works as an auxiliary in perfect tenses and in ‘have to’ for obligation.","zh":"Have 是非常常用的动词，可表示“拥有、经历、吃/喝、让某人做”，也可作助动词构成完成时，并用于 have to 表示“必须”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to own, possess, or hold something","zh":"拥有；持有（某物）"},"examples":[{"en":"I have a car.","zh":"我有一辆车。"},{"en":"Do you have your ID with you?","zh":"你带身份证了吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"to experience or receive something (a feeling, event, or illness)","zh":"经历；感受；患有（情绪、事件或疾病）"},"examples":[{"en":"We had a great time at the party.","zh":"我们在派对上玩得很开心。"},{"en":"She has a headache.","zh":"她头疼。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take or eat/drink something","zh":"吃；喝；用（药）；来点（食物/饮料）"},"examples":[{"en":"I’ll have a coffee, please.","zh":"请给我来杯咖啡。"},{"en":"He had breakfast at 7 a.m.","zh":"他早上7点吃了早餐。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone to do something (often in the pattern “have + person + base verb”)","zh":"让/使某人做某事（常用结构：have + 人 + 动词原形）"},"examples":[{"en":"I’ll have my assistant call you.","zh":"我会让我的助理给你打电话。"},{"en":"They had the workers clean the site.","zh":"他们让工人清理了工地。"}]},{"partOfSpeech":"aux.","definition":{"en":"used as an auxiliary verb to form perfect tenses (have/has/had + past participle)","zh":"作助动词，用于完成时（have/has/had + 过去分词）"},"examples":[{"en":"I have finished my homework.","zh":"我已经完成作业了。"},{"en":"She has lived here for three years.","zh":"她在这里住了三年了。"}]},{"partOfSpeech":"phrase","definition":{"en":"used to show obligation in the structure “have to” (similar to “must”)","zh":"用于表示必须（have to），类似“must”"},"examples":[{"en":"I have to go now.","zh":"我现在得走了。"},{"en":"Do we have to wear a uniform?","zh":"我们必须穿制服吗？"}]}],"synonyms":["own","possess","experience","take","consume"],"phonetic":"/hæv/","extraExplanation":["“have”非常常用，口语里常缩写：I have → I’ve，he has → he’s（注意：he’s 既可能是 he is，也可能是 he has，要看后面是否接过去分词，如 he’s finished = he has finished）。","英式口语中“have got”也常表示“拥有”：I’ve got a car = I have a car（美式英语也能用，但更口语、更强调“现在就有”）。","“have + 食物/饮料”在点餐时很自然：I’ll have… / Can I have…；语气通常比“Give me…”更礼貌。"]}
{"word":"have no worry about food and clothing and have access to compulsory education, basic medical services, and safe housing","summary":{"en":"A formal sentence meaning people’s basic living needs are secured and they can use essential services like schooling, healthcare, and safe housing.","zh":"较正式的表述，意思是基本生活得到保障（衣食无忧），并且能获得教育、医疗和安全住房等基本服务。"},"definitions":[{"partOfSpeech":"sentense","definition":{"en":"to have basic needs met (enough food and clothing) and to be able to receive essential public services such as compulsory schooling, basic healthcare, and safe housing","zh":"衣食无忧，并能获得义务教育、基本医疗服务和安全住房等基本公共服务"},"examples":[{"en":"The program aims to ensure that every family has no worry about food and clothing and has access to compulsory education, basic medical services, and safe housing.","zh":"该项目旨在确保每个家庭衣食无忧，并能获得义务教育、基本医疗服务和安全住房。"},{"en":"Our goal is that children have access to compulsory education and that seniors can get basic medical services.","zh":"我们的目标是让孩子能接受义务教育，让老人能获得基本医疗服务。"}]}],"synonyms":["meet basic needs and have access to essential services","have food and clothing and access to education, healthcare, and safe housing","have basic living保障 and access to public services"],"phonetic":"/hæv noʊ ˈwɝiz əˈbaʊt fuːd ænd ˈkloʊðɪŋ ænd hæv ˈækˌsɛs tə kəmˈpʌlsəri ˌɛdʒəˈkeɪʃən ˈbeɪsɪk ˈmɛdɪkəl ˈsɝvɪsɪz ænd seɪf ˈhaʊzɪŋ/","extraExplanation":["“food and clothing（衣食）”在英语里常用来指“最基本的生活所需（basic necessities）”。“have no worry about …”更自然的表达通常是“have no worries about …”或“not have to worry about …”。","“compulsory education”指法律规定必须接受的教育（常译“义务教育”）。在不同国家，年限可能不同。","这一整句常用于政策、发展报告或扶贫语境，表达“基本生活保障 + 基本公共服务可及性”。更简洁的英文写法可用“meet basic needs and ensure access to essential services”。"]}
{"word":"haveable","summary":{"en":"“Haveable” means available or able to be obtained/possessed (and sometimes, acceptable to experience). It’s uncommon; “available” or “obtainable” is more natural.","zh":"haveable 指“可获得/可拥有的”，有时也指“（某种情况/感受）还算能接受的”。这个词不常用，更自然的说法通常是 available 或 obtainable。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be had, obtained, or possessed; available.","zh":"可以得到的；可以拥有的；可获得的。"},"examples":[{"en":"Tickets are haveable online, but they sell out quickly.","zh":"票可以在网上买到，但很快就会售罄。"},{"en":"Fresh local seafood is haveable in this market every morning.","zh":"每天早上在这个市场都能买到新鲜的本地海鲜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Possible or acceptable to experience (a feeling or situation); something you can “have.”","zh":"（感受或处境）可以经历/可以承受的；还算能接受的。"},"examples":[{"en":"A little stress is haveable, but constant pressure isn’t healthy.","zh":"一点压力还算能承受，但持续的高压不健康。"},{"en":"The wait is haveable if you bring a book.","zh":"如果你带本书，这段等待时间还算能接受。"}]}],"synonyms":["available","obtainable","gettable","attainable","accessible"],"phonetic":"/ˈhævəbəl/","extraExplanation":["“haveable”并不是常见词，在日常英语里更常用：available（有货/可获得的）、obtainable（可获得的）、gettable（口语：能弄到的）、possible/acceptable（可行/可接受的）。","构词很直观：have + -able（“能够……”）。它偶尔会出现在口语、广告文案或轻松的写作里，用来强调“能不能弄到/能不能拥有/能不能承受”。"]}
{"word":"haveage","summary":{"en":"“haveage” is not a standard English word; it’s usually an incorrect form of “have age,” and for age we normally say “be … years old.”","zh":"“haveage”不是标准英语单词；多为把“have age”连写或误写。表达年龄时通常用“be … years old（……岁）”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Nonstandard; usually written as “have age”) to be a certain age; to be … years old.","zh":"（非标准写法，通常写作“have age”）指达到某个年龄；……岁。"},"examples":[{"en":"In modern English, we usually say “I am 20 years old,” not “I have age 20.”","zh":"在现代英语里通常说“I am 20 years old（我20岁）”，而不是“I have age 20”。"},{"en":"Some learners write “haveage” by mistake when they mean “age” or “average.”","zh":"有些学习者会误写“haveage”，其实想表达的是“age（年龄）”或“average（平均的/平均数）”。"}]}],"synonyms":["be ... years old","be aged ...","be of an age"],"phonetic":"/hæv eɪdʒ/","extraExplanation":["“haveage”不是标准英语单词。若你是在查词典，最可能是拼写错误或把两个词连在一起写了。","表达年龄时，英语最自然的说法是：“I’m + 数字 (years old).” 例如：I’m 18 (years old).","如果你想查的是别的词：\n- age（n./v. 年龄；变老）\n- average（n./adj. 平均数；平均的）\n- haulage（n. 运输；货运）\n你可以告诉我你想表达的中文或给我一句完整的句子，我可以帮你锁定正确单词。"]}
{"word":"havel","summary":{"en":"Havel most commonly refers to a traditional South Asian mansion (often spelled haveli). It can also be a surname, famously Václav Havel.","zh":"havel最常指南亚传统大宅院（更常拼作haveli）。它也可作姓氏，最著名的是捷克的瓦茨拉夫·哈维尔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large traditional mansion or townhouse in South Asia (especially in India and Pakistan), often built around an inner courtyard.","zh":"（南亚，尤指印度和巴基斯坦的）传统大宅院/大宅邸，常以中庭（内院）为中心建造。"},"examples":[{"en":"They visited an old havel in Rajasthan with carved stone balconies.","zh":"他们参观了拉贾斯坦邦的一座古老哈维利（大宅院），有精美的石雕阳台。"},{"en":"The havel was restored and turned into a small heritage hotel.","zh":"这座哈维利被修复后改造成了一家小型文化遗产酒店。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), notably of Václav Havel, a Czech writer and former president.","zh":"姓氏（例如捷克作家、前总统瓦茨拉夫·哈维尔 Václav Havel）。"},"examples":[{"en":"Václav Havel is known for his essays on freedom and civic responsibility.","zh":"瓦茨拉夫·哈维尔以关于自由与公民责任的文章而闻名。"}]}],"synonyms":["haveli","mansion","courtyard house","heritage home"],"phonetic":"/hɑːˈvɛl/","extraExplanation":["“havel”常见拼写是“haveli”（更常用），来自印地语/乌尔都语等语言，和波斯语中表示“院落、居所”的词有渊源。在旅游语境里，你会常看到“haveli hotel（哈维利酒店）”，指由老宅改建的住宿。","作为专有名词（姓氏）时，Havel通常指瓦茨拉夫·哈维尔：他在文学与政治上都很重要，常被引用来讨论民主、人权与公民社会。"]}
{"word":"haveless","summary":{"en":"“have less” means to possess a smaller amount or to reduce what you have.","zh":"“have less”表示“拥有更少”或“减少拥有的数量”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to possess a smaller amount (of something) than before or than someone else","zh":"（相较以前或他人）拥有更少的（某物）"},"examples":[{"en":"After the rent increase, we have less money for travel.","zh":"房租上涨后，我们用于旅行的钱就更少了。"},{"en":"Some students have less time to study because they work part-time.","zh":"有些学生因为做兼职，学习时间更少。"}]},{"partOfSpeech":"phrase","definition":{"en":"to reduce the amount you have; to need to use less","zh":"减少拥有的数量；需要用得更少"},"examples":[{"en":"If you want to save, try to have less stuff and buy only what you need.","zh":"如果你想存钱，尽量少买东西，只买需要的。"},{"en":"During the drought, everyone had to have less water for gardening.","zh":"干旱期间，每个人都得减少园艺用水。"}]}],"synonyms":["have fewer","own less","reduce","cut down on"],"phonetic":"/hæv lɛs/","extraExplanation":["“haveless”并不是常见或标准的单词拼写。更自然的写法通常是分开写成“have less”。","在少数语境里，你可能会看到作者把它写成连字符形式“have-less”（作形容词）来强调“拥有较少/更贫困”的概念，但这偏口语化或修辞性写法，日常写作不推荐。"]}
{"word":"haveli","summary":{"en":"a traditional South Asian mansion, often with a courtyard","zh":"南亚传统大宅院，常带中庭内院"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large traditional mansion or townhouse in South Asia (especially in India and Pakistan), often built around an inner courtyard.","zh":"（南亚，尤指印度、巴基斯坦的）传统大宅院/豪宅，常以中庭（内院）为中心建造。"},"examples":[{"en":"We visited a restored haveli in Rajasthan with a quiet central courtyard.","zh":"我们参观了拉贾斯坦一座修复过的哈维利大宅，里面有安静的中庭。"},{"en":"The hotel used to be a merchant’s haveli, decorated with painted walls and carved balconies.","zh":"这家酒店以前是商人的哈维利宅邸，装饰有壁画和雕花阳台。"}]}],"synonyms":["mansion","manor house","townhouse","courtyard house"],"phonetic":"/həˈveɪli/","extraExplanation":["在旅行与建筑语境里，haveli 常指北印度（如拉贾斯坦、古吉拉特）富商或贵族的传统宅院：外观厚实、内院采光通风，常见壁画（fresco）、石雕窗（jharokha）等元素。","英文中它多作为文化借词使用，通常不翻译，直接说 a haveli。复数常写 havelis。"],"etymology":"来自印地语/乌尔都语 haveli，源头可追溯到波斯语 hawli（意为“院子/围合的空间”）。因此它常与“有内院的住宅”联系在一起。","mnemonic":["把 haveli 联想成“Have a 里（院子）”：传统大宅“有个里院/内院”。","记住它常出现在印度旅行/建筑介绍中：看到“古宅+中庭”就容易想到 haveli。"]}
{"word":"havelock","summary":{"en":"A havelock is a cloth cover worn under or attached to a hat/helmet to protect the head and especially the neck from sun or weather.","zh":"havelock 指接在或戴在帽子/头盔上的遮颈布，用于保护头部尤其颈部免受日晒或风雨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cloth cover that protects the head and neck from sun, heat, or rain, often attached to or worn under a hat or helmet","zh":"（常接在帽子或头盔上的）遮颈布；护颈罩，用来防晒、防雨或防热"},"examples":[{"en":"The soldiers wore helmets with havelocks to protect their necks from the desert sun.","zh":"士兵们戴着带护颈罩的头盔，保护脖子免受沙漠烈日灼晒。"},{"en":"If you’re working outdoors all day, a hat with a havelock can help prevent sunburn.","zh":"如果你要在户外工作一整天，带遮颈布的帽子能帮助防止晒伤。"}]}],"synonyms":["neck flap","sun flap","neck cover"],"phonetic":"/ˈhævəˌlɑk/","extraExplanation":["“havelock”常被认为与19世纪英军将领Sir Henry Havelock有关：据说这种护颈布式样在当时的军用服装中流行，因此以其姓氏命名（不同资料细节略有差异）。","在现代英语里，这个词较偏“特定用品/服装配件”用语；日常更常见的表达还包括“neck flap（护颈布）”“sun flap（防晒遮布）”。"]}
{"word":"havelocks","summary":{"en":"“Havelocks” are cloth neck covers attached to hats or helmets for sun or weather protection.","zh":"havelocks 指装在帽子或头盔上的遮颈布，用来遮阳或挡雨等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cloth cover that hangs from the back (and sometimes the sides) of a hat or helmet to protect the neck from sun, heat, or rain; the plural form is “havelocks.”","zh":"（帽子或头盔后部有时连到两侧的）披颈布/遮颈布，用来遮阳、防热或挡雨；复数为 havelocks。"},"examples":[{"en":"The soldiers wore havelocks to keep the sun off their necks in the desert.","zh":"士兵在沙漠里戴着遮颈布，防止太阳晒到脖子。"},{"en":"In the old photograph, you can see white havelocks attached to their helmets.","zh":"在那张老照片里，你能看到他们头盔上系着白色的遮颈布。"}]}],"synonyms":["neck flap","sun flap","neck guard"],"phonetic":"/ˈhævəlɑk/","extraExplanation":["havelock 这个词来自19世纪英军的使用习惯：据说因英军将领 Sir Henry Havelock 而得名，当时士兵会在帽子后面加一块白布遮阳、保护颈部。后来这类“遮颈布”就被叫作 havelock。","现代英语里更常见的同类说法还有 neck flap、sun flap（更口语/描述性），havelock 较偏历史或军装语境。"]}
{"word":"haven","summary":{"en":"Haven means a safe, protected place (literal or metaphorical), often one that offers shelter or relief.","zh":"Haven 指“安全、受保护的地方”（可字面也可比喻），常表示能提供庇护或让人喘息的所在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a safe place, especially a sheltered area where people or animals can rest or be protected","zh":"避风港；安全之所（尤指能让人或动物躲避危险、休息的地方）"},"examples":[{"en":"After the storm, the small bay became a haven for boats.","zh":"暴风雨过后，这个小海湾成了船只的避风港。"},{"en":"For many readers, the library is a quiet haven.","zh":"对许多读者来说，图书馆是一个安静的避风港。"}]},{"partOfSpeech":"n.","definition":{"en":"a place that provides help or protection for people in difficulty (for example, refugees or victims of violence)","zh":"庇护所；收容处（为陷入困境的人提供帮助或保护的地方）"},"examples":[{"en":"The organization offers a haven for families escaping violence.","zh":"该机构为逃离暴力的家庭提供庇护。"},{"en":"They hoped the city would be a haven from persecution.","zh":"他们希望这座城市能成为躲避迫害的避难所。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provide a safe place or shelter for someone or something","zh":"为……提供庇护；收留；庇护"},"examples":[{"en":"The farmhouse havened travelers during the blizzard.","zh":"暴风雪期间，那座农舍收留了旅人。"}]}],"synonyms":["refuge","shelter","sanctuary","safe harbor"],"phonetic":"/ˈheɪvən/","extraExplanation":["“haven”最常见是名词，来自古英语，原意与“港口、避风的地方”有关，所以常用来比喻“能让人放松、感到安全的地方”。","常见搭配：a safe haven（安全避风港/安全港）、a haven of peace（宁静之所）、tax haven（避税天堂，偏财经用法）。","文学与日常写作中常见比喻：home is a haven（家是避风港）。"]}
{"word":"haven't","summary":{"en":"“Haven’t” means “have not,” most commonly used to make present perfect negatives.","zh":"“haven’t”意为“have not”，最常用于现在完成时的否定。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"A contraction of “have not,” used to form negatives—most often with the present perfect (have + past participle).","zh":"“have not”的缩写，用于构成否定式——最常见于现在完成时（have + 过去分词）。"},"examples":[{"en":"I haven’t finished my homework yet.","zh":"我还没写完作业。"},{"en":"We haven’t seen that movie.","zh":"我们还没看过那部电影。"}]},{"partOfSpeech":"aux.","definition":{"en":"A contraction of “have not,” meaning you do not possess something (more common in British English; in American English, “don’t have” is more common).","zh":"“have not”的缩写，表示“没有/不拥有”（英式英语更常见；美式英语通常说“don’t have”）。"},"examples":[{"en":"I haven’t any cash on me.","zh":"我身上没有现金。"},{"en":"She hasn’t a car, so she takes the bus.","zh":"她没有车，所以坐公交。"}]}],"synonyms":["have not"],"phonetic":"/ˈhævənt/","extraExplanation":["“haven’t = have not”。主语是 I / you / we / they 时用 haven’t；主语是 he / she / it 时用 hasn’t。","书面正式语境里可以用完整形式“have not”来强调或更正式；日常口语和一般写作里用缩写更自然。","发音中第二个音节常弱读成 /ə/，所以听起来像“HAV-uhnt”。"]}
{"word":"haven-like","summary":{"en":"safe and calm, like a refuge","zh":"安全宁静、如同庇护之所"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Similar to a safe, calm place where people or things are protected and can rest.","zh":"像避风港一样安全、宁静、让人有依靠与休息的。"},"examples":[{"en":"After weeks of travel, the small cabin felt haven-like and quiet.","zh":"旅行了好几周后，那间小木屋让人感觉像避风港一样宁静。"},{"en":"She created a haven-like corner in her room with soft light and plants.","zh":"她在房间里用柔光和绿植布置出一个像避风港一样的小角落。"},{"en":"The library had a haven-like atmosphere for students during exam week.","zh":"考试周时，图书馆对学生来说有一种像避风港一样的氛围。"}]}],"synonyms":["safe","peaceful","sheltering","refuge-like","sanctuary-like","secure","tranquil"],"phonetic":"/ˈheɪvən laɪk/","extraExplanation":["常见搭配：haven-like home/space/atmosphere/setting（像避风港般的家/空间/氛围/环境）。","语气与用法：多用于描写“让人安心、被保护、可暂时躲避压力”的感觉；比 safe 更偏“情绪上的安稳与疗愈”。"],"etymology":"由名词 haven（“避风港、庇护所”）+ 后缀 -like（“像……一样”）构成的复合形容词；用来强调“具有避难处/安稳之所的感觉”。","mnemonic":["把 haven 记成“海（haven）里的港”：港口能躲风浪；-like 就是“像……一样”，合起来就是“像避风港一样”。","联想中文：=“港湾感/避风港感”，想到“港湾”就想到安全与安静。"]}
{"word":"havenage","summary":{"en":"Havenage means a harbor fee paid by ships for entering or using a port.","zh":"Havenage 指船舶进港或使用港口时缴纳的港口费用（港务费）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fee paid for the use of a harbor or for bringing a ship into port; harbor dues","zh":"（船舶进港、停泊等缴纳的）港口费用；港务费；停泊费"},"examples":[{"en":"The captain paid havenage before unloading the cargo.","zh":"船长在卸货前先缴了港务费。"},{"en":"In older records, havenage was listed separately from customs duties.","zh":"在较早的记录中，港务费常与关税分开列出。"}]}],"synonyms":["harbor dues","port dues","dockage","docking fees"],"phonetic":"/ˈhævənɪdʒ/","extraExplanation":["“havenage”是较为古旧、偏法律/航运文书用语，在现代英语里更常见的说法是 harbor dues / port dues / docking fees。","词根与“haven（避风港）”相关，原意与“进入港湾获得庇护与停泊”有关，因此引申为“为使用港口而付的费用”。"]}
{"word":"havened","summary":{"en":"“Havened” is a rare, poetic word meaning “safely sheltered/harbored (as in a haven).”","zh":"“havened”较罕见，带文学色彩，表示“被庇护、像在避风港里一样安全”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, poetic) Sheltered in or provided with a safe harbor (a “haven”); safely harbored.","zh":"（罕见、带文学色彩）有避风港的；被安置在安全处、得到庇护的（来自“haven”避难所/港湾）。"},"examples":[{"en":"The fishing boats lay havened in the quiet bay until the storm passed.","zh":"渔船停泊在宁静的海湾里避风，直到暴风雨过去。"},{"en":"She felt havened among friends who understood her.","zh":"在懂她的朋友中间，她感到被庇护、很安心。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Very rare) Past form of “haven” meaning to give shelter to; to harbor.","zh":"（非常罕见）作动词“haven”的过去式/过去分词：庇护；使有栖身之处。"},"examples":[{"en":"The inlet havened the small ships from rough seas.","zh":"那处海湾庇护小船免受风浪侵袭。"}]}],"synonyms":["sheltered","harbored","protected","safe","secure"],"phonetic":"/ˈheɪvənd/","extraExplanation":["“havened”在现代英语里非常少见，更多出现在诗歌或较老的文学作品中，用来营造“安全港湾/被庇护”的意象。日常表达通常改用：sheltered, harbored, safe, protected。"]}
{"word":"havener","summary":{"en":"Havener is a rare word meaning a harbor official (harbor master), and it can also be a surname.","zh":"Havener 是个少见词，主要指港口管理人员（港务长），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/old-fashioned) A person in charge of a harbor or haven; a harbor master.","zh":"（罕见/旧用）管理港口或避风港的人；港务长。"},"examples":[{"en":"In old records, the havener was responsible for keeping the harbor safe and orderly.","zh":"在一些旧档案里，港务长（havener）负责维持港口的安全与秩序。"},{"en":"The ship reported its arrival to the havener before unloading cargo.","zh":"船只在卸货前先向港务长（havener）报告到港。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"（专有名词）姓氏。"},"examples":[{"en":"Ms. Havener joined the team last year.","zh":"Havener 女士去年加入了团队。"}]}],"synonyms":["harbor master","harbormaster","port official"],"phonetic":"/ˈheɪvənər/","extraExplanation":["“havener”在现代英语中非常少见，多见于历史文献或方言语境，通常可理解为“harbor master（港务长）/harbormaster”。","词根上与“haven（避风港；港湾）”有关，因此含义与“港口管理、停泊与安全”这一语义场相连。"]}
{"word":"havenership","summary":{"en":"A very rare or nonstandard word, likely meaning “the state/quality of being a haven (a place of safety).”","zh":"一个非常少见或非规范的词，通常可按构词理解为“作为避风港/庇护之所的状态或特质（安全之处）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard dictionary word) A coined or very rare term that could mean “the state or quality of being a haven” (providing safety, shelter, or refuge).","zh":"（非标准词，较可能是自造词或极少见）可理解为“作为避风港/庇护所的状态或特质”（提供安全、庇护、安身之处）。"},"examples":[{"en":"In her writing, she described the library’s quiet havenership for anxious students.","zh":"在她的文章里，她把图书馆描写成让焦虑学生安心的“庇护特质”。"},{"en":"The group wanted to build a sense of havenership—welcoming anyone who needed support.","zh":"这个团体想建立一种“庇护氛围/特质”——欢迎任何需要支持的人。"}]}],"synonyms":["sanctuary","refuge","safety","shelter"],"phonetic":"/ˈheɪvənərʃɪp/","extraExplanation":["“havenership”在现代英语里并不是常见或规范的词，你很可能在一般词典中查不到。它看起来由 haven（避风港；庇护所）+ -ship（表示“状态/性质/身份/关系”的后缀，如 friendship 友谊、leadership 领导力）构成，因此读者通常会按构词法猜成“庇护的性质/状态”。\n\n如果你是在正式写作中使用，建议改用更自然的表达：the quality of being a haven（作为庇护所的特质）、a sense of refuge/safety（安全感/庇护感）、sanctuary（庇护所）等。"]}
{"word":"havenet","summary":{"en":"“Haven’t” means “have not,” used to talk about not having something or not doing something yet.","zh":"“haven’t”是“have not”的缩写，表示“没有；尚未（做某事）”。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"Contraction of “have not,” used to say that you do not have something or have not done something (usually with I/you/we/they).","zh":"“have not”的缩写，用来表示“没有；尚未”（通常和 I/you/we/they 连用）。"},"examples":[{"en":"I haven’t finished my homework yet.","zh":"我还没写完作业。"},{"en":"They haven’t seen that movie before.","zh":"他们以前没看过那部电影。"},{"en":"We haven’t got enough time.","zh":"我们没有足够的时间。"}]}],"synonyms":["have not"],"phonetic":"/ˈhævənt/","extraExplanation":["“havenet”更常见是拼写错误；标准写法是 **haven’t**（中间有撇号）。","口语里 **haven’t** 常弱读成 /ˈhævənt/，也可能听起来像“havent”，但正式写作一定要保留撇号：**haven’t**。","注意：第三人称单数要用 **hasn’t**（he/she/it hasn’t）。"]}
{"word":"havenful","summary":{"en":"“Havenful” (rare) means ‘providing a haven’—safe, sheltered, and comforting like a refuge.","zh":"“havenful”（罕见）指“像避风港一样能提供庇护的”，有安全、遮蔽、令人安心的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) providing a haven; offering safety, shelter, or refuge.","zh":"（罕见）能提供避风港的；给予安全、庇护或避难处的。"},"examples":[{"en":"The small coastal town felt havenful after the storm.","zh":"暴风雨过后，那座海边小镇让人觉得像个安全的避风港。"},{"en":"She described her grandmother’s home as havenful—a place where she could rest and recover.","zh":"她说外婆家很“避风港般”，是她能休息、恢复元气的地方。"}]}],"synonyms":["safe","sheltering","welcoming","protective","secure","refuge-like"],"phonetic":"/ˈheɪvənfəl/","extraExplanation":["“havenful”在现代英语里非常少见，更多时候人们会用更自然的表达，比如：safe（安全的）, sheltered（受庇护的）, welcoming（令人感到被接纳的）, a safe haven（安全港/避难所）, a refuge（避难处）。","构词上可理解为 haven（避风港/庇护所）+ -ful（充满……的/具有……特征的），意思类似“带来庇护感的”。在写作中使用会显得偏文学或刻意。"]}
{"word":"havening","summary":{"en":"“Havening” most often refers to a stress-relief therapy technique (Havening Techniques), and more generally can mean taking or giving shelter (a haven).","zh":"“Havening”最常指一种减压的触摸放松疗法（Havening 技术）；更广义也可指寻求或提供庇护（避风港）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(psychology, informal) A therapeutic method using gentle touch and calming imagery to reduce stress or trauma responses; short for “Havening Techniques.”","zh":"（心理学/非正式）“Havening 疗法/技术”的简称：通过轻柔触摸（如抚摸手臂）配合安抚性想象来降低压力或创伤反应的一种方法。"},"examples":[{"en":"She tried havening to calm her anxiety before the exam.","zh":"她在考试前用 havening 来缓解焦虑。"},{"en":"Some coaches teach havening techniques for stress management.","zh":"一些教练会教授 havening 技术来做压力管理。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of taking shelter in a safe place; seeking or providing a haven.","zh":"在安全处躲避、寻求庇护；为他人提供避风港的行为。"},"examples":[{"en":"During the storm, the small harbor became a place of havening for boats.","zh":"暴风雨期间，这个小港湾成了船只避风停靠的地方。"},{"en":"The center offers havening for families who need a safe space.","zh":"该中心为需要安全空间的家庭提供庇护。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “haven” (rare): to give shelter to; to shelter.","zh":"“haven”的现在分词（较少见）：庇护；使获得避难处。"},"examples":[{"en":"The monastery was havening refugees during the conflict.","zh":"冲突期间，那座修道院在庇护难民。"}]}],"synonyms":["sheltering","refuge","sanctuary","self-soothing (contextual)"],"phonetic":"/ˈheɪvənɪŋ/","extraExplanation":["“Havening Techniques”多与某些身心疗法、教练课程或自我放松练习相关，常见做法包括用手轻抚上臂、脸颊或手掌，同时配合深呼吸与积极想象。它在大众健康领域流行，但不同机构对其科学证据的评价不一；如用于严重创伤或心理困扰，通常建议寻求合格的心理健康专业人士。"]}
{"word":"havenless","summary":{"en":"Havenless means lacking a safe shelter or refuge.","zh":"Havenless 指缺少安全的庇护所或避难处。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without a safe place, shelter, or refuge; having no haven","zh":"没有安全的避难所；无处可依；没有庇护的"},"examples":[{"en":"After the storm, some families were havenless and needed temporary housing.","zh":"暴风雨过后，一些家庭无处安身，需要临时住所。"},{"en":"The novel portrays havenless travelers searching for a place to rest.","zh":"这部小说描写了无处可依的旅人寻找落脚处。"}]}],"synonyms":["shelterless","homeless","unhoused","refugeless"],"phonetic":"/ˈheɪvənləs/","extraExplanation":["“havenless”并不是非常常见的日常用词，更常见的表达是“homeless（无家可归的）”“shelterless（无处遮蔽的）”或“without a safe haven（没有安全的避风港）”。但在文学/新闻语境中，用“havenless”能更强调“缺少避难处、缺少庇护”的感觉，而不一定等同于永久意义上的“无家可归”。","构词：haven（避风港、庇护所）+ -less（没有……的）。类似结构：endless（无尽的）、hopeless（无望的）、fearless（无畏的）。"]}
{"word":"havens","summary":{"en":"Havens is usually the plural of haven: safe, peaceful places that provide protection or comfort.","zh":"Havens 通常是 haven 的复数：指提供保护与安宁的“避风港/庇护所”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a safe, peaceful place where people or things can go for protection or rest","zh":"避风港；安全、安宁的地方（供人或事物躲避危险、休息）"},"examples":[{"en":"During the storm, the small bay became a haven for boats.","zh":"暴风雨期间，小海湾成了船只的避风港。"},{"en":"Her room was a quiet haven after a long day at work.","zh":"忙碌一天后，她的房间是一个安静的港湾。"}]},{"partOfSpeech":"v.","definition":{"en":"to provide safety or shelter to someone or something","zh":"庇护；为……提供避难处"},"examples":[{"en":"The church sheltered families and havened them during the crisis. (rare)","zh":"危机期间，教堂收容并庇护了这些家庭。（较少见）"}]}],"synonyms":["refuges","shelters","sanctuaries","safe places"],"phonetic":"/ˈheɪvənz/","extraExplanation":["“havens”通常是名词“haven”的复数形式：many havens（许多避风港/栖身之所）。也可能是动词“haven”的第三人称单数，但这种动词用法在现代英语里比较少见，更常用的是“shelter / protect / give refuge to”。","“haven”原意与“港口、停泊处”有关，所以在文学或新闻里常用来比喻“让人安心的地方/环境”，例如“a haven of peace”（宁静之所）。","常见搭配：safe haven（安全避风港/庇护所，金融语境也指“避险资产”）、wildlife haven（野生动物栖息地）、tax haven（避税天堂）。"]}
{"word":"havent","summary":{"en":"“haven’t” = “have not,” used to make negative present perfect or to say you do not have something.","zh":"“haven’t”=“have not”，用于现在完成时否定或表示“没有/不拥有”。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"Contraction of “have not.” Used to form negative present perfect (and sometimes negative of “have” meaning “do not possess”).","zh":"“have not”的缩写形式。用于构成现在完成时的否定（有时也用于否定“have=拥有”）。"},"examples":[{"en":"I haven’t finished my homework yet.","zh":"我还没写完作业。"},{"en":"We haven’t seen that movie before.","zh":"我们以前没看过那部电影。"},{"en":"I haven’t any cash on me right now. (more formal/BrE-style)","zh":"我现在身上没有现金。（更正式/偏英式用法）"}]}],"synonyms":["have not"],"phonetic":"/ˈhævənt/","extraExplanation":["标准拼写是 haven’t（有撇号），表示把 have not 合在一起；写成 “havent” 常见于聊天或快速打字，但在正式写作中应使用 “haven’t”。","口语里 haven’t 的发音常接近 /ˈhævənt/，中间的 “o” 音（not）会弱读。"]}
{"word":"havenward","summary":{"en":"“Havenward” means “toward a haven/harbor,” often in literary or nautical contexts.","zh":"“havenward”意为“朝向避风港/安全之地”，多用于文学或航海语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward a safe place, shelter, or harbor (often used in nautical or literary writing).","zh":"朝向避风港、庇护处或安全之地（常见于航海或文学语境）。"},"examples":[{"en":"As the storm grew louder, the ship turned havenward.","zh":"风暴声势渐大，船只转向避风港方向。"},{"en":"They pushed havenward before nightfall.","zh":"他们在天黑前赶往安全处。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving or directed toward a haven or harbor.","zh":"朝向避风港/港口的；向安全处移动的。"},"examples":[{"en":"A havenward course was the captain’s only sensible choice.","zh":"朝向避风港的航线是船长唯一明智的选择。"},{"en":"The havenward lights along the coast guided them home.","zh":"海岸边指向港湾的灯光引导他们回家。"}]}],"synonyms":["toward the harbor","toward safety","harborward","homeward"],"phonetic":"/ˈheɪvənwɚd/","extraExplanation":["“Havenward”由 haven（避风港、庇护所）+ -ward（表示“朝向……”）构成，意思直观但在现代口语中较少见，更常出现在诗歌、航海叙述或较有文艺感的描写里。","近义表达在日常英语里更常用：toward the harbor / toward safety / homeward（若强调“回家”）。"]}
{"word":"haver","summary":{"en":"“Haver” is mainly Scottish English meaning “to talk nonsense” or “nonsense talk.” It can also (older Scots) mean “oats.”","zh":"“haver”主要是苏格兰英语，意思是“胡说八道/瞎扯”或“废话”。在较旧的苏格兰方言中也可指“燕麦”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Scottish English, informal) to talk foolishly or nonsense; to ramble on.","zh":"（苏格兰英语，非正式）胡说八道；瞎扯；说话没重点。"},"examples":[{"en":"Stop havering and tell me what actually happened.","zh":"别再胡扯了，告诉我到底发生了什么。"},{"en":"He was havering about conspiracies all night.","zh":"他整晚都在瞎扯阴谋论。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish English, informal) nonsense talk; foolish chatter.","zh":"（苏格兰英语，非正式）胡言乱语；废话；瞎扯的话。"},"examples":[{"en":"That’s just haver—don’t take it seriously.","zh":"那只是废话——别当真。"},{"en":"I’ve heard enough of your haver for one day.","zh":"我今天已经听够你的胡扯了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots, old-fashioned) oats.","zh":"（苏格兰方言，旧式用法）燕麦。"},"examples":[{"en":"In older Scots writing, “havers” can mean oats.","zh":"在较早的苏格兰方言写作里，“havers”有时指燕麦。"}]}],"synonyms":["talk nonsense","ramble","babble","nonsense","rubbish"],"phonetic":"/ˈheɪvɚ/","extraExplanation":["“haver”主要见于苏格兰英语（日常口语里很常见），在英格兰或美国不算常用；在美国语境中出现时，往往是为了呈现苏格兰人物口吻或地域特色。","常见搭配：stop havering（别胡扯/别犹豫了）、don’t haver（别瞎说）、a load of haver（满嘴胡话）。在某些语境里它也可带“犹豫不决、拿不定主意”的语气，取决于说话人的用法。"]}
{"word":"haveral","summary":{"en":"Haveral (also spelled havarel/haverel) is a Scottish dialect word meaning a foolish person or nonsense talk.","zh":"haveral（也可拼作havarel/haverel）是苏格兰方言词，意思是“爱胡说的人/傻瓜”，也可指“胡言乱语”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish English, dialect) A foolish person; someone who talks nonsense.","zh":"（苏格兰英语/方言）傻瓜；爱胡说八道的人。"},"examples":[{"en":"Stop being such a haveral and tell us what really happened.","zh":"别再像个爱胡扯的人一样了，说说到底发生了什么。"},{"en":"They called him a haveral because he kept making up stories.","zh":"大家叫他“haveral”，因为他总爱编故事胡扯。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish English, dialect) Nonsense; silly talk.","zh":"（苏格兰英语/方言）胡言乱语；瞎扯。"},"examples":[{"en":"That’s pure haveral—don’t believe it.","zh":"那纯属胡扯——别信。"},{"en":"I’m tired of all this haveral about who’s to blame.","zh":"我受够了这些关于谁该负责的瞎扯了。"}]}],"synonyms":["fool","simpleton","nonsense","blather","babble"],"phonetic":"ˈhævərəl","extraExplanation":["“haveral”较少见，更常见的拼法有“haverel / havarel”，都来自苏格兰方言动词“haver”（胡扯、说傻话）。在英国口语里也常见相关词“havering”（尤指絮叨、说不着边际的话）。","如果你是想查更常用的英语单词，可能是拼写误差；可以告诉我你看到它的句子，我能帮你确认是否应为“haversack / several / general”等。"]}
{"word":"havercake","summary":{"en":"A traditional Scottish oatcake (flat bread) made mainly from oats.","zh":"一种苏格兰传统燕麦薄饼，主要由燕麦制成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Scottish oatcake (a thin, flat bread) made mainly from oats, sometimes from a mix of oats and barley.","zh":"（苏格兰传统食物）燕麦薄饼/燕麦饼：主要用燕麦制成的薄而扁的饼，有时也会掺大麦粉。"},"examples":[{"en":"In Scotland, havercakes are often served with soup or cheese.","zh":"在苏格兰，燕麦薄饼常常搭配汤或奶酪一起吃。"},{"en":"She packed a few havercakes for the hike because they travel well.","zh":"她带了几块燕麦薄饼去徒步，因为这种饼很耐放、好携带。"}]}],"synonyms":["oatcake","Scottish oatcake"],"phonetic":"/ˈhævərˌkeɪk/","extraExplanation":["“Haver”是苏格兰英语/古用法，意思是“燕麦”。所以 havercake 字面上就是“燕麦饼”。","在苏格兰饮食文化中，oatcake/havercake 是常见的主食或配餐，口感通常偏干、酥或硬，适合配汤、黄油、奶酪等。现代英语里更常见的说法是 oatcake。"]}
{"word":"havered","summary":{"en":"“Havered” is the past tense of “haver,” meaning to talk nonsense (or, less commonly, to hesitate), chiefly in Scottish/Northern British English.","zh":"“havered”是“haver”的过去式，主要指“胡说八道”（较少见：犹豫不决），多见于苏格兰及英国北部英语。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense of “haver”: talked in a foolish or pointless way; spoke nonsense (mainly Scottish and Northern British English).","zh":"“haver”的过去式：说傻话、胡说八道（多见于苏格兰及英国北部英语）。"},"examples":[{"en":"He was tired and havered on about things that didn’t make sense.","zh":"他累了，就开始胡说八道，讲些不着边际的话。"},{"en":"Stop havered talk and tell me what really happened.","zh":"别再胡扯了，告诉我到底发生了什么。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense of “haver”: hesitated or wavered (less common).","zh":"“haver”的过去式：犹豫不决、摇摆不定（较少见）。"},"examples":[{"en":"She havered for a moment before answering.","zh":"她回答前犹豫了一下。"}]}],"synonyms":["rambled","waffled","talked nonsense","babble","hesitated","wavered"],"phonetic":"/ˈheɪvərd/","extraExplanation":["“haver / havering”常见于口语与方言语境（苏格兰、英格兰北部），在更通用的英语里更常用“talk nonsense / ramble / waffle”。","注意：标准英语里“have”的过去式是“had”，不是“havered”。如果你想表达“拥有”，请用“had”。"]}
{"word":"haverel","summary":{"en":"Haverel is a Scottish word meaning a silly person (and less commonly, something foolish).","zh":"Haverel 是苏格兰用语，指“傻瓜/爱胡扯的人”（较少也可作形容词表示“愚蠢的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) A foolish or silly person; someone who talks nonsense.","zh":"（苏格兰英语，非正式）傻瓜；胡说八道的人。"},"examples":[{"en":"Stop talking like a haverel and listen for a minute.","zh":"别像个傻瓜一样胡扯了，先听我说一分钟。"},{"en":"He’s not bad-hearted—just a bit of a haverel sometimes.","zh":"他人不坏——只是有时候有点傻。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scotland, less common) Foolish; silly; lacking good judgment.","zh":"（苏格兰英语，较少见）愚蠢的；欠考虑的。"},"examples":[{"en":"That was a haverel idea, and it got us into trouble.","zh":"那是个愚蠢的主意，把我们惹上了麻烦。"}]}],"synonyms":["fool","idiot","simpleton","nitwit","blockhead"],"phonetic":"/ˈhævərəl/","extraExplanation":["“haverel”主要见于苏格兰英语/方言，带有口语、带点责备但不一定很恶毒的语气，常用来形容人“傻里傻气、爱瞎说”。","它和苏格兰英语里的动词“haver”（胡扯、瞎聊）有关，因此也常暗含“说话没谱”的感觉。"]}
{"word":"haverels","summary":{"en":"“Haverels” is a Scottish informal word meaning either “nonsense talk” or “a silly person.”","zh":"“haverels”是苏格兰英语中的非正式词，可指“废话/胡扯”，也可指“傻瓜/糊涂人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) Foolish talk; nonsense; empty chatter.","zh":"（苏格兰用法，非正式）胡言乱语；废话；空谈。"},"examples":[{"en":"Stop talking haverels and get to work.","zh":"别再说废话了，开始干活。"},{"en":"I heard a lot of haverels about the new policy, but no real facts.","zh":"我听到很多关于新政策的空谈，但没有什么真实依据。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) A foolish or silly person (often used as a mild insult).","zh":"（苏格兰用法，非正式）傻瓜；糊涂人（常作轻微骂人）。"},"examples":[{"en":"Don’t be a haverel—think before you speak.","zh":"别当傻瓜——说话前先想想。"},{"en":"He’s a harmless haverel, but he means well.","zh":"他是个无伤大雅的糊涂人，但心是好的。"}]}],"synonyms":["nonsense","rubbish","chatter","fool","idiot"],"phonetic":"/ˈhævərəlz/","extraExplanation":["“haverels”多见于苏格兰英语/苏格兰方言（Scots），在更通用的美式英语里不常见。更常见的近义表达有：nonsense / rubbish / chatter（指“废话”），或 fool / idiot（指“傻瓜”，语气可能更重）。","它和动词/名词“haver”（胡扯、瞎聊）有关：to haver = to talk foolishly；haver（n.）= nonsense。拼写上有时也会看到 haveril / haverel 等变体。"]}
{"word":"haverer","summary":{"en":"A haverer is someone who talks nonsense (especially in Scottish English) or someone who hesitates and can’t decide.","zh":"haverer 指胡说八道的人（尤见于苏格兰英语），也可指犹豫不决、拿不定主意的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly Scottish) A person who talks foolishly or rambles on; someone who talks nonsense.","zh":"（多用于苏格兰英语）胡说八道的人；爱瞎扯、瞎聊的人。"},"examples":[{"en":"Stop being a haverer and tell me what really happened.","zh":"别再瞎扯了，告诉我到底发生了什么。"},{"en":"He’s a harmless haverer who loves to chat with strangers.","zh":"他就是个无伤大雅的爱瞎聊的人，喜欢和陌生人聊天。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who hesitates or wavers; someone indecisive.","zh":"犹豫不决的人；摇摆不定的人。"},"examples":[{"en":"Don’t be a haverer—choose a date and book the tickets.","zh":"别再犹豫了——定个日期把票订了。"},{"en":"In an emergency, a haverer can slow everyone down.","zh":"在紧急情况下，犹豫不决的人会拖慢大家。"}]}],"synonyms":["nonsense talker","babble","ramble","waverer","hesitator","indecisive person"],"phonetic":"/ˈhævərər/","extraExplanation":["“haverer”来自动词“to haver”。在苏格兰英语里，haver常指“说傻话、胡扯”；在一些语境中也可表示“犹豫、拿不定主意”（与“to waver / to hesitate”意思接近）。这个词在现代标准美式英语里不常见，更像是方言或带地域色彩的用法。"]}
{"word":"havergrass","summary":{"en":"Havergrass is a rare, Scots/old-fashioned word meaning oats or oat-like grass.","zh":"havergrass 是一个罕见的苏格兰/旧用词，指燕麦或像燕麦的草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, old-fashioned) Oats; oat plants used as grain or animal feed.","zh":"（苏格兰/旧用法）燕麦；作为粮食或饲料的燕麦植物。"},"examples":[{"en":"In old Scots writing, people sometimes called oats “haver” or “havergrass.”","zh":"在一些旧的苏格兰文字里，人们有时把燕麦叫作“haver”或“havergrass”。"},{"en":"The farmer stored havergrass for the horses through the winter.","zh":"农夫储存燕麦（havergrass）给马过冬。"}]},{"partOfSpeech":"n.","definition":{"en":"A general name for grasses that look like oats (often used loosely rather than as a strict scientific term).","zh":"一种对“像燕麦的草”的泛称（多为非严格的科学术语，用法较宽泛）。"},"examples":[{"en":"Along the path, havergrass waved in the wind.","zh":"小路旁，像燕麦的草（havergrass）随风摇摆。"}]}],"synonyms":["oats","oatgrass","oat grass","oat"],"phonetic":"/ˈhævərˌɡræs/","extraExplanation":["“haver-”来自苏格兰语（Scots）里的“haver”（燕麦）。在苏格兰文化中，燕麦是很重要的主食，因此相关词在旧文本、方言或文学化描写里更容易见到。","现代英语里更常用的词是“oats”（燕麦）或“oat grass / oatgrass”（燕麦草）。如果你在当代文章里看到“havergrass”，通常带有方言、复古或地域色彩。"]}
{"word":"havering","summary":{"en":"“Havering” most often means talking nonsense (informal, especially Scottish English), and it can also be the name of a borough in East London.","zh":"“havering”常指（非正式、偏苏格兰英语）胡言乱语；也可指伦敦东部的行政区名哈弗灵区。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"talking in a confused or foolish way; saying things that do not make much sense (from Scottish English “haver”).","zh":"胡言乱语；说话颠三倒四、没什么道理（源自苏格兰英语 haver）。"},"examples":[{"en":"Stop havering and tell me what really happened.","zh":"别再胡扯了，告诉我到底发生了什么。"},{"en":"He was havering about the plan and couldn’t explain it clearly.","zh":"他对计划说得颠三倒四，根本讲不清楚。"},{"en":"I thought she was just havering, but she was actually serious.","zh":"我以为她在瞎说，结果她是认真的。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for a borough (local area) in East London: the London Borough of Havering.","zh":"英国伦敦东部的一个行政区名：哈弗灵区（London Borough of Havering）。"},"examples":[{"en":"She lives in Havering, in East London.","zh":"她住在伦敦东部的哈弗灵区。"},{"en":"Havering has many parks and suburban neighborhoods.","zh":"哈弗灵区有很多公园和郊区社区。"}]}],"synonyms":["rambling","babbling","talking nonsense","waffling"],"phonetic":"ˈhævərɪŋ","extraExplanation":["“haver / havering”在英式英语里偏口语，尤其带有苏格兰用法色彩，常用于抱怨别人“别瞎扯、别含糊其辞”。在正式写作中不算常见，更常用的说法有：ramble、talk nonsense、babble。","专有名词“Havering”指伦敦行政区时通常首字母大写；动词用法“havering”一般不大写。"]}
{"word":"havermeal","summary":{"en":"A Scots/Northern English word meaning oatmeal (ground oats).","zh":"苏格兰/英格兰北部用词，意思是“燕麦粉（磨碎的燕麦）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, Northern English) Oatmeal; meal (flour) made from ground oats, often used for porridge or baking.","zh":"（苏格兰英语、英格兰北部用法）燕麦粉；由燕麦磨成的粉，常用于煮燕麦粥或烘焙。"},"examples":[{"en":"For breakfast, they ate havermeal porridge with a little salt.","zh":"早餐他们吃了加一点盐的燕麦粉粥。"},{"en":"She baked oatcakes using havermeal, just like her grandmother did.","zh":"她用燕麦粉烤燕麦饼，做法和她祖母一样。"}]}],"synonyms":["oatmeal","oat flour"],"phonetic":"/ˈheɪvərˌmiːl/","extraExplanation":["“Havermeal”主要见于苏格兰与英格兰北部的传统语境；“haver”在苏格兰语里指“燕麦”。在现代日常英语中，更常用的词是“oatmeal”。在苏格兰文化中，燕麦长期是重要主食，因此相关词汇也更丰富。"]}
{"word":"havers","summary":{"en":"“Havers” most often means “nonsense” in Scottish English; it can also be the plural of “haver” (someone who has/owns something), though that sense is rare.","zh":"“havers”最常见的意思是苏格兰英语里的“胡言乱语/废话”；也可作“haver（拥有者）”的复数，但较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish English, informal) Nonsense; silly talk.","zh":"（苏格兰英语，非正式）胡言乱语；蠢话；废话。"},"examples":[{"en":"Don’t listen to him—he’s talking havers.","zh":"别听他的——他在胡说八道。"},{"en":"That’s a load of havers; show me the facts.","zh":"那都是一派胡言；拿出证据来。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “haver” (a person who has or owns something); rare.","zh":"“haver”的复数（拥有某物的人）；较少见。"},"examples":[{"en":"Land havers were listed in the old records.","zh":"旧档案中记录了土地所有者。"}]}],"synonyms":["nonsense","rubbish","baloney","hogwash","bunk"],"phonetic":"/ˈheɪvərz/","extraExplanation":["“havers”（= nonsense）是很有地域特色的苏格兰用法，在日常口语里常见，语气通常带一点不耐烦或调侃，相当于英语里的 “rubbish / nonsense / baloney”。","常见搭配：talk havers（胡说）、a load of havers（一堆废话）。在正式写作中不常用，更像口语或文学对话里的地域表达。"]}
{"word":"haversack","summary":{"en":"A haversack is a small shoulder bag, especially a soldier’s supply bag.","zh":"haversack 指小型斜挎包，尤指士兵用来装口粮和补给的行囊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, strong bag (often carried over one shoulder), used especially by soldiers or hikers to carry food and basic supplies.","zh":"（常斜挎在肩上的）小而结实的背包/行囊；尤指士兵或徒步者用来装食物和基本用品的袋子。"},"examples":[{"en":"The soldier kept his rations in a haversack.","zh":"士兵把口粮放在行囊里。"},{"en":"She packed a haversack with water and snacks for the hike.","zh":"她装了一个行囊，放上水和零食去徒步。"}]}],"synonyms":["bag","satchel","knapsack","rucksack","backpack"],"phonetic":"/ˈhævərˌsæk/","extraExplanation":["“haversack”在现代日常英语里不算常用，更常见的说法是“backpack”（背包）或“shoulder bag”（单肩包）。但在军事语境、历史写作和文学作品中仍会出现。","词源上常被认为来自法语（如 *havresac*），原指用来装燕麦等饲料或军粮的袋子，因此带有“军用补给袋”的历史色彩。"]}
{"word":"haversacks","summary":{"en":"Haversacks are shoulder bags, especially traditional military packs for carrying food and personal items.","zh":"haversacks 指单肩行囊，尤指传统军用背袋，用来装食物和随身物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bag (often made of canvas) carried over the shoulder, used especially by soldiers or hikers to hold food and personal items","zh":"（常为帆布的）单肩背包/行囊；（尤指）士兵或徒步者用来装食物和随身物品的袋子"},"examples":[{"en":"The soldiers packed bread and water into their haversacks before the march.","zh":"士兵们在行军前把面包和水装进了行囊里。"},{"en":"He slung a haversack over his shoulder and started hiking.","zh":"他把单肩背包一甩上肩，就开始徒步了。"}]}],"synonyms":["backpack","shoulder bag","satchel","mess bag"],"phonetic":"/ˈhævərˌsæk/","extraExplanation":["“Haversack”常见于军旅语境，尤其在历史题材、战争文学或博物馆说明中；现代日常英语里更常说 backpack、shoulder bag、mess bag（军用）。","复数是 haversacks（你输入的就是复数形式）；单数是 haversack。","词源可追溯到法语 *havresac*（意为“装东西的袋子”一类的说法），因此带有较强的历史色彩。"]}
{"word":"haversian","summary":{"en":"Haversian means “related to the osteons (Haversian systems) in compact bone.”","zh":"Haversian 指“与致密骨中的骨单位（哈弗斯系统）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Haversian system (osteons), the microscopic structures in compact bone that contain a central canal for blood vessels and nerves","zh":"与哈弗斯系统（骨单位）有关的；指致密骨中含有中央管（血管与神经通过）的显微结构"},"examples":[{"en":"Compact bone is organized into Haversian systems called osteons.","zh":"致密骨由称为骨单位的哈弗斯系统所组成。"},{"en":"The slide shows a Haversian canal in the center of the osteon.","zh":"这张切片显示骨单位中心的哈弗斯管（中央管）。"}]}],"synonyms":["osteonal"],"phonetic":"/həˈvɝːʒən/","extraExplanation":["“Haversian”来自英国解剖学家 Clopton Havers（17世纪）的姓氏，他对骨组织的研究影响很大，因此与骨单位、哈弗斯管相关的结构常用他的名字来命名。","常见搭配：Haversian system（哈弗斯系统/骨单位）、Haversian canal（哈弗斯管/中央管）、Haversian lamellae（哈弗斯层板）。在医学、生物和解剖学教材中最常见。"]}
{"word":"haversine","summary":{"en":"A navigation/geography math term used to compute great-circle distance, especially in the haversine formula.","zh":"用于计算球面两点大圆距离的数学术语，尤常见于半正矢（haversine）公式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mathematical function used in navigation and geography to find the great-circle distance between two points on a sphere (often used in the “haversine formula” for Earth distances)","zh":"一种数学函数/方法，用于导航与地理中计算球面上两点之间的大圆距离（常见于“半正矢公式”，用来估算地球两地距离）"},"examples":[{"en":"The app uses the haversine formula to estimate the distance between two GPS points.","zh":"这个应用使用半正矢公式来估算两个 GPS 坐标点之间的距离。"},{"en":"In many tutorials, “haversine” appears when people calculate distances on the Earth’s surface.","zh":"在很多教程里，人们计算地球表面距离时会看到“haversine”。"}]}],"synonyms":["haversine formula","great-circle distance formula"],"phonetic":"/ˈhævərˌsaɪn/","extraExplanation":["“haversine”来自“half-versed sine”（半正矢）：它与三角函数有关，常写作 hav(θ)=sin²(θ/2)。在地理计算中，它能让用经纬度算距离更稳定、实现也更方便。","实务中你更常见到固定搭配：haversine formula（半正矢公式 / 哈弗辛公式）。"]}
{"word":"haves","summary":{"en":"“Haves” most commonly means “rich/privileged people,” as in “the haves and the have-nots.” It can also appear as a rare or incorrect form of the verb “have” (standard: “has”).","zh":"“haves”最常见的意思是“富人/有优势的人”，常见于“the haves and the have-nots”。它也可能被当作动词“have”的少见或错误形式（标准应为“has”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who are rich or have plenty of money or advantages (usually used in the phrase “the haves and the have-nots”)","zh":"富人；拥有财富或优势的人（常用于短语“the haves and the have-nots”）"},"examples":[{"en":"The policy debate often focuses on the gap between the haves and the have-nots.","zh":"政策讨论常常聚焦于富人和穷人之间的差距。"},{"en":"In many cities, the haves live in neighborhoods that feel like a different world.","zh":"在许多城市，富人住的社区仿佛是另一个世界。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare or nonstandard) a form of “have” meaning “possesses”; in standard modern English, use “has” for he/she/it","zh":"（少见或不规范）“have”的一种形式，表示“拥有”；现代标准英语中 he/she/it 应用“has”"},"examples":[{"en":"Nonstandard: He haves no time.","zh":"不规范：He haves no time.（标准写法：He has no time.）"},{"en":"Standard: She has a new phone.","zh":"标准：She has a new phone.（她有一部新手机。）"}]}],"synonyms":["the wealthy","the rich","the privileged"],"phonetic":"/hævz/","extraExplanation":["“the haves (and the have-nots)”是英语里讨论贫富差距、阶层不平等时非常常见的表达：haves 指“拥有资源的人”，have-nots 指“缺乏资源的人”。","在写作或新闻语境中，haves 往往带有社会批评色彩，用来强调“拥有/缺乏”带来的机会差异。"]}
{"word":"havier","summary":{"en":"“Heavier” means more heavy (more weight), and it can also mean more serious or intense.","zh":"“heavier”表示“更重”，也可引申为“更严重/更强烈”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “heavy”; having more weight than something else.","zh":"“heavy”的比较级；比另一物更重的。"},"examples":[{"en":"This box is heavier than I expected.","zh":"这个箱子比我预想的更重。"},{"en":"The blue backpack is heavier than the black one.","zh":"蓝色背包比黑色的更重。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) More serious, intense, or difficult.","zh":"（比喻）更严重、更强烈或更艰难的。"},"examples":[{"en":"Traffic is heavier during rush hour.","zh":"高峰期车流更拥堵。"},{"en":"She faced heavier pressure after the exam.","zh":"考试后她承受了更大的压力。"}]}],"synonyms":["weightier","more massive","more serious","more intense"],"phonetic":"/ˈhɛviər/","extraExplanation":["“havier”通常是拼写错误，更常见的正确拼写是“heavier”。“heavier”读起来常会弱读成 /ˈhɛviər/，中间的“e”不明显。","另外，“Javier”（常见西班牙语人名）有时也会被误写成“havier”，但它不是英语单词；如果你要查的是人名，请告诉我语境。"]}
{"word":"havildar","summary":{"en":"Havildar is a South Asian military NCO rank roughly equivalent to a sergeant.","zh":"Havildar 是南亚军队中的士官军衔，大致相当于“军士”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A non-commissioned officer rank in the armies of India, Pakistan, and some other South Asian forces, roughly similar to a sergeant.","zh":"（印度、巴基斯坦及部分南亚军队中的）军士级别的士官，地位大致相当于“sergeant（军士）”。"},"examples":[{"en":"My great-grandfather served as a havildar in the British Indian Army.","zh":"我曾祖父在英属印度军队里当过一名 havildar（军士）。"},{"en":"The havildar inspected the soldiers before the morning drill.","zh":"那名 havildar 在晨练前检查了士兵。"}]}],"synonyms":["sergeant (rough equivalent)","NCO"],"phonetic":"/ˈhævɪlˌdɑr/","extraExplanation":["“havildar”是南亚语境中常见的军衔词，来自印地语/乌尔都语等语言（常写作 havaldar），历史上在英属印度军队体系中广泛使用，至今仍见于印度、巴基斯坦等国的军警系统。它常被译作“军士/班长”，但不同部队的具体职责与编制可能略有差异。"]}
{"word":"having","summary":{"en":"“Having” is most often the -ing form of “have,” meaning eating, experiencing, or possessing; it can also (less commonly) mean “possessions.”","zh":"“having”最常见是“have”的-ing形式，表示正在吃/正在经历/正在拥有；较少见时可作名词表示“财产/所有物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of owning or possessing something; possessions","zh":"拥有；持有；所有物（较正式/不常用）"},"examples":[{"en":"The house is his main having.","zh":"这套房子是他最主要的财产。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “have”; used to form continuous tenses or to mean “experiencing/possessing”","zh":"“have”的现在分词；用于进行时，或表示“正在拥有/正在经历”"},"examples":[{"en":"She is having breakfast.","zh":"她正在吃早餐。"},{"en":"I’m having a good time here.","zh":"我在这里玩得很开心。"},{"en":"He’s having trouble sleeping.","zh":"他睡眠有困难。"}]},{"partOfSpeech":"phrase","definition":{"en":"used in polite requests or suggestions, especially with food/drink (“have” = eat/drink/try)","zh":"用于礼貌的请求或建议，尤其是吃喝场景（have=吃/喝/尝试）"},"examples":[{"en":"Would you like having some tea?","zh":"你想喝点茶吗？（更自然：Would you like some tea? / Would you like to have some tea?）"},{"en":"Thanks for having me.","zh":"谢谢你邀请/招待我。"}]},{"partOfSpeech":"phrase","definition":{"en":"informal: used to show strong dislike or rejection (“I’m not having it” = I won’t accept it)","zh":"非正式：表示强烈反对或不接受（I’m not having it = 我不接受/不买账）"},"examples":[{"en":"He said it was a joke, but I’m not having it.","zh":"他说那只是开玩笑，但我不买账。"}]}],"synonyms":["possessing","owning","experiencing","belongings (for the noun sense)"],"phonetic":"/ˈhævɪŋ/","extraExplanation":["“having”最常见是动词现在分词：is/are having（正在吃/正在经历）。在英语里，“have breakfast/lunch/dinner”比“eat breakfast”更常见、更口语。","“Thanks for having me.”常用于被邀请到别人家、参加聚会或被接待后致谢，语气自然礼貌。","作名词的“a having/one’s havings”比较书面或旧式，现代更常说“possessions / belongings / property”。"]}
{"word":"havingness","summary":{"en":"“Havingness” means the state or amount of what someone has (possessions/resources), and it is also used as a Scientology-related term meaning a sense of being able to have things.","zh":"“Havingness”指一个人拥有的状态或数量（财物/资源）；也可作为山达基相关术语，表示“能够拥有”的感受或能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or amount of what someone has; possession, wealth, or resources.","zh":"拥有的状态或数量；财产、财富或资源。"},"examples":[{"en":"The survey asked about people’s havingness, such as income and property.","zh":"这份调查询问了人们的拥有情况，例如收入和房产。"},{"en":"After losing his job, his havingness changed quickly.","zh":"失业后，他的“拥有状况”很快发生了变化。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scientology, informal) A person’s sense of being able to have or possess things; used in discussions of “havingness processes.”","zh":"（山达基/Scientology，非正式用法）一个人“能够拥有”的感受或能力；常见于“havingness processes（拥有感处理）”等说法中。"},"examples":[{"en":"In that context, they said the exercise was meant to improve his havingness.","zh":"在那种语境下，他们说那个练习是为了提升他的“havingness（拥有感）”。"},{"en":"The book uses “havingness” as a key term, but it isn’t common in everyday English.","zh":"那本书把“havingness”当作关键词使用，但它在日常英语里并不常见。"}]}],"synonyms":["possession","ownership","wealth","resources","assets"],"phonetic":"/ˈhævɪŋnəs/","extraExplanation":["“havingness”在普通英语里比较少见，更常见的表达是“possessions（财物）/wealth（财富）/what someone has（拥有的东西）”。","在山达基相关文本中，“havingness”常被当作术语使用，带有特定体系内的含义；在一般对话中使用时，可能会让听者联想到该宗教/运动背景。"]}
{"word":"havings","summary":{"en":"“Havings” is uncommon; it usually means “possessions/belongings” (often written having(s)). “Having” is also the -ing form of “have,” used in sentences like “He is having lunch” or “Having finished…, ….”","zh":"“havings” 在现代英语中不太常见；通常表示“财产/所有物”（常写作 having(s)）。“having” 也可作 have 的 -ing 形式，用于进行时或省略从句，如 “He is having lunch.” / “Having finished…, ….”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or state of possessing; belongings or possessions (usually written as “having(s)”)","zh":"拥有；占有的状态；财产、所有物（常写作 having(s)）"},"examples":[{"en":"Material havings don’t always bring happiness.","zh":"物质的拥有并不总能带来幸福。"},{"en":"She cared more about experiences than havings.","zh":"她更在意经历，而不是拥有的东西。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “have”: used to form continuous tenses or to mean “because/after having” in reduced clauses","zh":"have 的现在分词：用于进行时；也可在省略从句中表示“因为/在……之后已经”"},"examples":[{"en":"He is having lunch right now.","zh":"他现在正在吃午饭。"},{"en":"Having finished the report, she went home.","zh":"写完报告后，她就回家了。"},{"en":"Having no time, I took a taxi.","zh":"因为没时间，我就打了车。"}]}],"synonyms":["possessions","belongings","property","ownings"],"phonetic":"/ˈhævɪŋ/","extraExplanation":["“havings” 这个拼写在现代英语里不常见；更常见的是单数名词 “having” 或写作 “having(s)” 来表示“财产/所有物”。如果你想表达“拥有的东西”，更自然的词还有：possessions, belongings, property。"]}
{"word":"havior","summary":{"en":"“Havior” is usually a misspelling; the standard word is “behavior,” meaning how someone/something acts.","zh":"“havior”通常是拼写错误；标准词是“behavior”，意思是人或事物的行为/表现方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “behavior”) the way a person or animal acts, especially how they act in front of others.","zh":"（通常拼作 behavior）行为；举止（尤指在人前的表现）。"},"examples":[{"en":"His behavior at the meeting was polite and professional.","zh":"他在会议上的举止礼貌而专业。"},{"en":"Good behavior is expected in the classroom.","zh":"课堂上需要有良好的行为规范。"}]},{"partOfSpeech":"n.","definition":{"en":"The way something works or reacts under certain conditions (often used in science/technology).","zh":"（常用于科技/科学）行为特性；（在特定条件下的）表现/反应方式。"},"examples":[{"en":"We studied the behavior of the material at high temperatures.","zh":"我们研究了这种材料在高温下的表现。"},{"en":"The app’s behavior changes after the update.","zh":"更新后这个应用的运行表现发生了变化。"}]}],"synonyms":["conduct","actions","manners","demeanor"],"phonetic":"/bɪˈheɪvjɚ/","extraExplanation":["“havior”本身不是常见的标准英文单词；你可能想查的是 **behavior**（美式拼法）或 **behaviour**（英式拼法）。","词源上来自拉丁语 *habere*（“拥有/持有”），与“习惯性的做法、表现方式”有关。日常写作里更常见的搭配有：**good/bad behavior**, **behavior problems**, **behavioral science**。"]}
{"word":"haviored","summary":{"en":"“Haviored” is not standard English; you probably mean “(well/ill-)behaved” or the rare form “(well/ill-)behaviored.”","zh":"“haviored”不是标准英语；你可能想写“(well/ill-)behaved（表现得好/不好）”或较少见的“(well/ill-)behaviored”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or misspelled form (not a common English word). It is most likely a mistaken spelling of “behaviored” (rare) as in “ill-behaviored,” meaning “having a particular kind of behavior,” or you may have meant “behaved.”","zh":"非标准/拼写错误形式（不是常见英文单词）。最可能是把较少见的“behaviored”（常见于“ill-behaviored”）拼错了，意为“具有某种行为/举止”；也可能你想写的是更常用的“behaved”（表现得……）。"},"examples":[{"en":"✅ The children were well-behaved during the ceremony.","zh":"✅ 孩子们在仪式上表现得很得体。"},{"en":"✅ He was rude and ill-behaved at the restaurant.","zh":"✅ 他在餐厅里很粗鲁、没教养。"},{"en":"(Rare) She wrote about an ill-behaviored prince in her story.","zh":"（少见）她在故事里写了一个举止不端的王子。"}]}],"synonyms":["well-behaved","ill-behaved","polite","rude","mannered"],"phonetic":"/həˈveɪvjərd/","extraExplanation":["“behaviored”在现代英语里很少单独使用，更多出现在复合形容词里：well-behaviored / ill-behaviored。日常写作更推荐用 well-behaved / ill-behaved。","如果你是在写“有礼貌/没礼貌、守规矩/不守规矩”，最自然的表达通常是 well-behaved / badly behaved / polite / rude。"]}
{"word":"haviors","summary":{"en":"“Behaviors” is the plural form of “behavior,” meaning actions or conduct.","zh":"“behaviors”是“behavior”的复数，意思是行为、举止。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the way a person or animal acts; the way someone conducts themselves (plural: behaviors)","zh":"（人或动物的）行为；举止（复数：behaviors）"},"examples":[{"en":"Good behaviors at school help everyone learn.","zh":"在学校有良好的行为会帮助每个人学习。"},{"en":"The teacher talked to him about his behaviors in class.","zh":"老师和他谈了他在课堂上的行为。"}]},{"partOfSpeech":"n.","definition":{"en":"(science) the actions or responses of a person or animal in a particular situation","zh":"（科学语境）在特定情境下的行动或反应"},"examples":[{"en":"Scientists study the behaviors of dolphins in the wild.","zh":"科学家研究野外海豚的行为。"},{"en":"Stress can change eating behaviors.","zh":"压力会改变饮食行为。"}]}],"synonyms":["actions","conduct","manners","habits","responses"],"phonetic":"/bɪˈheɪvjɚ/","extraExplanation":["“haviors”本身不是常见英语单词，通常是拼写漏掉了前面的“be-”，正确应为“behaviors”（behavior 的复数）。","美式英语更常用拼写“behavior / behaviors”；英式英语常见“behaviour / behaviours”。"]}
{"word":"haviour","summary":{"en":"“Haviour” is not standard; it usually means “behavior/behaviour”: the way someone acts.","zh":"“haviour”不是标准用法，通常指“behavior/behaviour”：某人的行为与举止。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"“Haviour” is not a standard English word. It is almost always a misspelling of “behavior” (US) or “behaviour” (UK), meaning the way a person or animal acts.","zh":"“haviour”不是标准英语单词，通常是把“behavior”（美式）/“behaviour”（英式）拼错了，意思是“行为；举止；表现”。"},"examples":[{"en":"His behavior changed after he started the new job.","zh":"他开始新工作后，行为发生了变化。"},{"en":"Teachers try to encourage good behavior in class.","zh":"老师会努力在课堂上鼓励良好行为。"},{"en":"The dog’s behavior was calm during the trip.","zh":"这只狗在旅途中表现得很平静。"}]}],"synonyms":["conduct","actions","manner","demeanor"],"phonetic":"/bɪˈheɪvjər/","extraExplanation":["正确拼写通常是 behavior（美式英语）或 behaviour（英式英语）。两者意思相同，只是拼写不同：英式常见 -our 结尾（如 colour/behaviour），美式多写成 -or（color/behavior）。","如果你看到“haviour”，通常是把前面的 be- 漏掉了；单独的 “haviour” 一般不会在正规文本中使用。"]}
{"word":"havioured","summary":{"en":"Behav(i)oured means “having a certain kind of behavior,” usually in compounds like well‑behav(i)oured or ill‑behav(i)oured.","zh":"behav(i)oured 意为“具有某种行为表现的”，多用于 well‑behav(i)oured / ill‑behav(i)oured 等复合词中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually in compounds) having a particular kind of behavior; behaving in a specified way.","zh":"（多用于复合词）具有某种行为方式的；表现为某种举止的。"},"examples":[{"en":"The teacher praised the well‑behav(i)oured children.","zh":"老师表扬了那些举止良好的孩子。"},{"en":"He was described as ill‑behav(i)oured at the meeting.","zh":"有人形容他在会上举止不当。"},{"en":"A gentle‑behav(i)oured dog is easier to train.","zh":"性情温和的狗更容易训练。"}]}],"synonyms":["well-behaved","badly behaved","mannerly","unruly (opposite)"],"phonetic":"/bɪˈheɪvjərd/","extraExplanation":["你输入的 **havioured** 单独使用并不常见；通常完整形式是 **behav(i)oured**（英式拼写常写 behaviour，故 behav*i*oured；美式常写 behavior，对应 **behaviored** 也较少见）。在现代英语里，更常用表达是 **well-behaved / badly behaved**，而不是单独用 behav(i)oured。","这个词多见于较正式或文学化的写法，并且常带连字符形成复合形容词：**well‑behav(i)oured / ill‑behav(i)oured / gentle‑behav(i)oured**。"]}
{"word":"haviours","summary":{"en":"“Haviours” is usually a misspelling of “behaviours/behaviors,” meaning actions or ways of acting.","zh":"“haviours”通常是“behaviours/behaviors”的拼写错误，意思是“行为；举止；表现”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “behaviour/behavior”: the ways someone (or an animal) acts, especially in particular situations.","zh":"“behaviour/behavior”的复数：行为；举止；（在特定情境下的）表现。"},"examples":[{"en":"Teachers try to encourage positive behaviours in the classroom.","zh":"老师会在课堂上鼓励积极的行为表现。"},{"en":"Some behaviours become habits over time.","zh":"有些行为会随着时间变成习惯。"}]},{"partOfSpeech":"n.","definition":{"en":"In science or psychology: the actions or responses of a person or animal that can be observed and studied.","zh":"（科学或心理学中）可观察、可研究的行为反应。"},"examples":[{"en":"The study looks at children’s social behaviours.","zh":"这项研究关注儿童的社交行为。"}]}],"synonyms":["actions","conduct","manners"],"phonetic":"/bɪˈheɪvjərz/","extraExplanation":["“haviours”通常是拼写漏了开头的“be-”，正确写法多为“behaviours”（英式拼写）或“behaviors”（美式拼写）。两者意思相同；美式英语更常用“behavior/behaviors”。"]}
{"word":"havlagah","summary":{"en":"Havlagah is a Hebrew term meaning a policy of restraint or non-retaliation, used mainly in the historical context of British Mandatory Palestine.","zh":"Havlagah是一个希伯来语借词，意为“克制/不报复的政策”，主要用于英属巴勒斯坦时期的历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A policy of restraint or non-retaliation, especially the Jewish community’s strategy in British Mandatory Palestine in the 1930s of limiting reprisals and avoiding escalation of violence.","zh":"（历史）克制、不报复（的政策）；尤指20世纪30年代英属巴勒斯坦时期犹太社群所采取的“克制政策”，强调限制报复行动、避免暴力升级。"},"examples":[{"en":"Some leaders argued for havlagah, believing restraint would reduce further bloodshed.","zh":"一些领袖主张采取havlagah（克制政策），认为克制能减少进一步的流血。"},{"en":"The debate over havlagah versus retaliation shaped politics in the Yishuv during the 1930s.","zh":"在20世纪30年代，关于havlagah（克制）还是报复的争论影响了犹太社群（Yishuv）的政治走向。"}]}],"synonyms":["restraint","self-restraint","non-retaliation","moderation"],"phonetic":"/ˌhɑvˈlɑɡɑ/","extraExplanation":["“Havlagah”（הבלגה）源自希伯来语，字面含义接近“克制、按捺”。在历史语境里，它常与当时部分犹太防卫组织/政治力量的立场联系在一起：面对袭击时尽量避免报复性行动，以免激化冲突、也争取国际舆论与英方支持。","这个词在普通日常英语里不常用，更多见于历史、政治学、中东研究等写作中；写作时通常需要简单解释其背景含义。"]}
{"word":"havoc","summary":{"en":"Havoc means severe chaos and damage, and it’s most commonly used in the phrase “wreak havoc (on something).”","zh":"Havoc 指严重的混乱与破坏，最常见用法是短语 “wreak havoc (on …)”（对……造成严重破坏/大乱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"great confusion, disorder, and damage, often happening suddenly or on a large scale","zh":"（常指突然或大范围的）严重混乱、失控与破坏"},"examples":[{"en":"The storm caused havoc across the coast.","zh":"暴风雨在沿海地区造成了严重破坏。"},{"en":"A computer virus can wreak havoc on a company’s system.","zh":"电脑病毒可能会对公司的系统造成严重破坏。"}]},{"partOfSpeech":"v.","definition":{"en":"to cause great damage, confusion, or trouble (often used in the phrase “wreak havoc”)","zh":"造成严重破坏、混乱或麻烦（常用于短语“wreak havoc”）"},"examples":[{"en":"The unexpected delay wreaked havoc on our schedule.","zh":"意外的延误把我们的日程搞得一团糟。"},{"en":"Heavy traffic can havoc your commute if you leave too late.","zh":"如果出门太晚，严重拥堵会把你的通勤搞得很糟。"}]}],"synonyms":["chaos","disorder","devastation","turmoil","mayhem","destruction"],"phonetic":"/ˈhævək/","extraExplanation":["“havoc”最常见的固定搭配是“wreak havoc (on ...)”，意思是“对……造成严重破坏/让……大乱”。日常写作里更推荐用这个搭配，而不是单独把“havoc”当动词使用（动词用法较少见、偏非正式或文学化）。","文化/文学提示：莎士比亚《尤利乌斯·凯撒》(Julius Caesar) 里有名句“Cry 'Havoc!' and let slip the dogs of war.” 这里的“Havoc”带有“放任掠夺与破坏”的意味，使表达更有戏剧张力。"]}
{"word":"havocked","summary":{"en":"Havocked means “devastated” (as a verb: caused great damage; as an adjective: badly damaged).","zh":"havocked 表示“被严重破坏/使严重破坏”（动词：造成巨大损害；形容词：满目疮痍的）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of *havoc*) To cause great damage, disorder, or chaos; to devastate.","zh":"（*havoc* 的过去式/过去分词）造成严重破坏、混乱或灾难；使满目疮痍。"},"examples":[{"en":"The storm havocked the coastline, destroying homes and roads.","zh":"暴风雨把海岸线摧毁得一片狼藉，房屋和道路都被毁了。"},{"en":"The virus havocked the local economy for months.","zh":"这种病毒让当地经济数月陷入严重冲击与混乱。"}]},{"partOfSpeech":"adj.","definition":{"en":"Badly damaged or ruined; devastated.","zh":"严重受损的；被毁坏的；满目疮痍的。"},"examples":[{"en":"After the fire, the havocked building stood empty and unsafe.","zh":"火灾后，那栋严重受损的建筑空置着，十分危险。"},{"en":"They returned to a havocked neighborhood.","zh":"他们回到了一个被破坏得面目全非的社区。"}]}],"synonyms":["devastated","wrecked","ruined","ravaged","damaged","laid waste"],"phonetic":"/ˈhævəkt/","extraExplanation":["“havoc”原意与“彻底的破坏、混乱”有关；动词用法在现代英语中很常见，尤其在新闻报道里（如自然灾害、战争、疫情“ravage/havoc”某地）。","拼写提示：动词原形是“havoc”，动词变化为“havoced / havocked”两种都可见，但“havocked”更常见。"]}
{"word":"havocker","summary":{"en":"“Havocker” means someone or something that causes havoc—serious chaos or damage.","zh":"“Havocker”指造成严重混乱或破坏的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that causes havoc (serious disorder or destruction); a troublemaker","zh":"造成严重混乱或破坏的人或事物；捣乱者"},"examples":[{"en":"The storm was a real havocker, knocking out power across the city.","zh":"那场暴风雨简直是个“破坏王”，把全城电都刮停了。"},{"en":"In the story, the mischievous child is portrayed as a havocker who turns every quiet moment into chaos.","zh":"在故事里，那个顽皮的孩子被刻画成一个“捣乱者”，总把每个安静时刻变成一团乱。"}]}],"synonyms":["troublemaker","disruptor","destroyer","menace"],"phonetic":"/ˈhævəkɚ/","extraExplanation":["“havocker”并不是最常见的标准用词；日常英语里更常用的是“cause havoc”（造成破坏/混乱）或“wreak havoc”（造成严重破坏）。在写作中用“havocker”会显得比较少见或带点创造性。","词根来自“havoc”（大破坏、大混乱）+ “-er”（表示“做……的人/物”）。"]}
{"word":"havockers","summary":{"en":"“Havockers” means people who cause havoc (chaos or trouble), but it’s uncommon; “troublemakers” is more natural.","zh":"“havockers”指制造混乱/麻烦的人，但并不常见；更自然的说法是“troublemakers（捣乱者）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who cause chaos, trouble, or damage; troublemakers (plural of “havocker,” a rare word).","zh":"制造混乱、麻烦或破坏的人；捣乱者（“havocker”的复数，用法较少见）。"},"examples":[{"en":"Online havockers flooded the comments with insults to derail the discussion.","zh":"一些网络捣乱者用侮辱性言论刷屏，想把讨论带偏。"},{"en":"The coach warned the team not to become havockers during the final minutes of the game.","zh":"教练警告队员们在比赛最后几分钟别闹事。"}]}],"synonyms":["troublemakers","agitators","disruptors","vandals","mischief-makers"],"phonetic":"/ˈhævəkɚ/","extraExplanation":["“havockers”多半是把更常见的拼写/表达写错或写得不标准了：常见名词是“havoc（混乱/浩劫）”，更自然的说法是“people who cause havoc（制造混乱的人）”或“troublemakers（捣乱者）”。","“havocker”在现代英语里很少用，读者可能不熟悉；正式写作中建议用“troublemaker(s)”或“agitator(s)”等更常见的词。"]}
{"word":"havocking","summary":{"en":"“Havocking” means causing serious damage or chaos.","zh":"“havocking”表示“正在造成严重破坏或混乱”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"causing a lot of damage, disorder, or confusion; creating chaos (present participle of the verb “havoc”).","zh":"造成大量破坏、混乱或失序；搅得一团乱（动词“havoc”的现在分词）。"},"examples":[{"en":"The storm is havocking the coastline, knocking out power lines.","zh":"暴风雨正在肆虐海岸线，吹倒电线导致停电。"},{"en":"A flu outbreak is havocking the school schedule.","zh":"流感爆发把学校的课程安排搅得一团乱。"},{"en":"Her allergies were havocking her sleep all week.","zh":"她的过敏这周一直把她的睡眠搞得很糟。"}]}],"synonyms":["causing chaos","wreaking havoc","devastating","disrupting"],"phonetic":"/ˈhævɑkɪŋ/","extraExplanation":["“havocking”这个拼写看起来不常见，但它遵循英语拼写规则：以字母c结尾的词加-ing时，常会加一个k来保持/k/音（如 panic → panicking；同理 havoc → havocking）。","更常见的搭配是短语“wreak havoc (on…)”表示“对……造成严重破坏/混乱”。例如：The delays wreaked havoc on our plans.（延误把我们的计划搅乱了。）","文化/文学提示：名句“Cry ‘Havoc!’”出自莎士比亚《尤利乌斯·凯撒》（Julius Caesar），这里的“havoc”带有“放任破坏、让战争的混乱爆发”的意味。"]}
{"word":"havocs","summary":{"en":"“Havocs” usually means multiple instances of serious damage or chaos (plural of “havoc”).","zh":"“Havocs”通常指多处/多次严重破坏或混乱（“havoc”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “havoc”) widespread destruction, damage, or disorder; very bad confusion.","zh":"（“havoc”的复数）大范围的破坏、损害或混乱；严重的失序。"},"examples":[{"en":"The storm caused havocs across the coast—roads flooded and power lines fell.","zh":"暴风雨在海岸造成多处严重破坏——道路被淹，电线倒塌。"},{"en":"Social media rumors can create havocs in a community.","zh":"社交媒体上的谣言可能在社区里引发严重混乱。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) the third-person singular form of the verb “havoc”: to severely damage or disrupt.","zh":"（较少见）动词“havoc”的第三人称单数：严重破坏或扰乱。"},"examples":[{"en":"A single virus outbreak havocs the hospital’s schedule.","zh":"一次病毒暴发就会把医院的排班彻底打乱。"}]}],"synonyms":["destruction","devastation","chaos","disorder","damage","turmoil"],"phonetic":"/ˈhævək/","extraExplanation":["“havoc”更常见的固定搭配是 **wreak havoc (on sth)**，意思是“对……造成严重破坏/混乱”。在现代英语里，人们更常说 “wreak havoc” 或 “cause havoc”，而不是把 “havoc” 当作动词使用。"]}

