{"word":"haw","summary":{"en":"“Haw” most commonly means to hesitate while speaking (“hem and haw”). It can also mean the fruit of a hawthorn tree, and (rarely) a shout to urge a horse.","zh":"“haw”最常见的意思是说话犹豫、吞吞吐吐（常见于“hem and haw”）。它也可指山楂树的果实；（较少见）也可作吆喝马前进的呼喊声。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to hesitate while speaking; to pause and make sounds like “uh” or “er” (often in “hem and haw”)","zh":"说话时犹豫、吞吞吐吐；发出类似“呃/嗯”的停顿声（常见于“hem and haw”）"},"examples":[{"en":"He hemmed and hawed before answering the question.","zh":"他在回答问题前支支吾吾、犹豫不决。"},{"en":"Don’t haw—just tell me what you really think.","zh":"别吞吞吐吐了，直接说你真正的想法。"}]},{"partOfSpeech":"n.","definition":{"en":"a berry-like fruit of the hawthorn tree","zh":"山楂树（hawthorn）的果实；山楂果（亦称 haw）"},"examples":[{"en":"In the fall, the hedges were bright with red haws.","zh":"到了秋天，树篱上结满红色的山楂果。"}]},{"partOfSpeech":"int.","definition":{"en":"used as a shout to urge a horse (similar to “giddy-up”), now uncommon","zh":"（旧用）吆喝马前进的呼喊声（类似“驾！”），现较少见"},"examples":[{"en":"The rider called, “Haw!” and the horse moved forward.","zh":"骑手喊了声“haw！”，马就向前走了。"}]}],"synonyms":["hesitate","stall","waffle","dither","hem"],"phonetic":"/hɔ/","extraExplanation":["“hem and haw” 是固定搭配：hem 指清嗓子或发出“嗯哼”一类的声音，haw 指犹豫时的停顿声。整句常用来形容一个人不愿直说、拿不定主意或在找借口。","名词 haw 与 hawthorn（山楂树）同源；在英美文学或自然描写中，haws 常用来营造秋冬季节的色彩意象。"]}
{"word":"Hawaii","summary":{"en":"Hawaii is a U.S. state in the Pacific made up of islands.","zh":"Hawaii 指太平洋上的美国夏威夷州，由多个岛屿组成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A U.S. state in the central Pacific Ocean, made up of islands; known for beaches, volcanoes, and Native Hawaiian culture.","zh":"美国位于中太平洋的一个州，由多个岛屿组成；以海滩、火山与夏威夷原住民文化闻名。"},"examples":[{"en":"Hawaii is the only U.S. state made up entirely of islands.","zh":"夏威夷是美国唯一一个完全由岛屿组成的州。"},{"en":"They traveled to Hawaii for a family vacation.","zh":"他们去夏威夷度家庭假期。"},{"en":"Mauna Loa in Hawaii is one of the world’s largest volcanoes.","zh":"夏威夷的冒纳罗亚火山是世界上最大的火山之一。"}]}],"synonyms":["the Aloha State","Hawaiian Islands (context-dependent)"],"phonetic":"/həˈwaɪi/","extraExplanation":["“Hawaii”在英语里既可以指“夏威夷州”（政治与行政单位），也常口语化地指“夏威夷群岛”或“夏威夷这个地方”。正式写法首字母大写。","发音上，英语常见读法是 /həˈwaɪi/；有些人会把中间的元音连读得更明显。","文化与用词上，“Native Hawaiian”通常指夏威夷原住民（Kanaka ʻŌiwi），而“local”在夏威夷语境里常指在当地生活的人（不一定是原住民）。在表达文化、传统或身份时，区分这些词会更尊重当地语境。","相关地名用法：首府是 Honolulu（檀香山/火奴鲁鲁）；著名岛屿包括 Oʻahu（欧胡岛）、Maui（毛伊岛）、Kauaʻi（考艾岛）、Hawaiʻi（夏威夷岛/大岛）。注意：Hawaiʻi 也可以特指“大岛”，需看语境。"]}
{"word":"Hawaii Islands","summary":{"en":"the islands that form the U.S. state of Hawaii","zh":"构成美国夏威夷州的群岛"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A common name for the islands that make up the U.S. state of Hawaii in the central Pacific Ocean (more formally called the Hawaiian Islands).","zh":"对太平洋中部美国夏威夷州群岛的常见称呼（更正式常用说法是 Hawaiian Islands “夏威夷群岛”）。"},"examples":[{"en":"We’re planning a trip to the Hawaii Islands next summer.","zh":"我们计划明年夏天去夏威夷群岛旅行。"},{"en":"The Hawaii Islands are famous for volcanoes, beaches, and unique wildlife.","zh":"夏威夷群岛以火山、海滩和独特的野生动植物闻名。"},{"en":"Maui and Oahu are two of the most visited islands in the Hawaii Islands.","zh":"毛伊岛和瓦胡岛是夏威夷群岛中游客最多的岛屿之一。"}]}],"synonyms":["Hawaiian Islands","Hawaii"],"phonetic":"/həˈwaɪ.i ˈaɪləndz/","extraExplanation":["更自然的英文表达通常是“Hawaiian Islands”。“Hawaii Islands”也能被理解，但在正式写作、地图、百科或新闻中更常用“Hawaiian Islands”。","“Hawaiʻi”这个拼写里常见的符号“ʻ”(okina)在夏威夷语中是一个辅音，不是装饰符号；英语文本里有时会省略，写作“Hawaii”。"],"etymology":"“Hawaii”来自夏威夷语“Hawaiʻi”（最后的“ʻ”是okina，表示喉塞音）；“islands”源自古英语，意为“岛屿”。在英语里更常见、更标准的说法是“Hawaiian Islands”。","mnemonic":["把“Hawaii”想成“哈-外-衣(夏威夷)”的音近联想：去海岛要穿“外衣/外套”防风晒（帮助记住读音和联想海岛）。","记“Islands”不发s中间的t：拼写有s，但读音像“ai-ləndz”。"]}
{"word":"Hawaii-related","summary":{"en":"connected to Hawaii","zh":"与夏威夷有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, about, or involving Hawaii (the U.S. state and island chain)","zh":"与夏威夷（美国州与群岛）有关的；涉及夏威夷的"},"examples":[{"en":"The museum has a new exhibit of Hawaii-related artifacts and photographs.","zh":"这家博物馆新增了一个与夏威夷相关的文物与照片展览。"},{"en":"We’re reviewing Hawaii-related safety rules before our trip.","zh":"出发前我们在复习与夏威夷相关的安全规定。"},{"en":"She wrote a Hawaii-related report on local culture and tourism.","zh":"她写了一份与夏威夷相关的报告，主题是当地文化与旅游。"}]}],"synonyms":["Hawaiian","Hawaii connected","Hawaii associated","Hawaii focused"],"phonetic":"/həˈwaɪi rɪˈleɪtɪd/","extraExplanation":["写作提示：作定语放在名词前时更常见带连字符（Hawaii-related issues）。放在系动词后作表语时可不加连字符（The issues are Hawaii related）。","语体与场景：常见于新闻、学术写作、政策文件、旅游与文化介绍等较正式语境。"],"etymology":"由专有名词“Hawaii（夏威夷）”+“related（相关的）”构成的复合形容词；常用连字符（Hawaii-related）在名词前作定语，表示“与夏威夷有关的”。","mnemonic":["把它拆开记：Hawaii（夏威夷）+ related（相关的）= “夏威夷相关”。","联想“related=有关系”，所以“跟夏威夷有关系的”就是它的意思。"]}
{"word":"Hawaiian","summary":{"en":"Hawaiian means related to Hawaii; it can also mean a person from Hawaii or the Hawaiian language.","zh":"Hawaiian指“夏威夷的”；也可指“夏威夷人”或“夏威夷语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hawaii (the U.S. state), its culture, or its people.","zh":"夏威夷的；与夏威夷（美国州）及其文化或人民有关的。"},"examples":[{"en":"We tried Hawaiian food, including poke and kalua pig.","zh":"我们尝了夏威夷美食，包括波奇（poke）和卡鲁阿烤猪（kalua pig）。"},{"en":"She loves Hawaiian music and hula dancing.","zh":"她喜欢夏威夷音乐和呼拉舞。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Hawaii; sometimes specifically a Native Hawaiian (depending on context).","zh":"夏威夷人；有时在语境中也特指夏威夷原住民（Native Hawaiian）。"},"examples":[{"en":"He’s Hawaiian and grew up on Oʻahu.","zh":"他是夏威夷人，在瓦胡岛（Oʻahu）长大。"},{"en":"Many Hawaiians celebrate local traditions at community festivals.","zh":"许多夏威夷人在社区节庆中庆祝本地传统。"}]},{"partOfSpeech":"n.","definition":{"en":"The Hawaiian language, a Polynesian language spoken in Hawaii.","zh":"夏威夷语（波利尼西亚语系语言，在夏威夷使用）。"},"examples":[{"en":"She is learning Hawaiian at school.","zh":"她在学校学习夏威夷语。"},{"en":"“Aloha” is a well-known word in Hawaiian.","zh":"“Aloha”是夏威夷语中很有名的词。"}]}],"synonyms":["of Hawaii","Hawaii-related"],"phonetic":"/həˈwaɪ.ən/","extraExplanation":["在日常英语里，“Hawaiian”既可泛指“来自夏威夷的人”，也可能被理解为“夏威夷原住民”。如果要明确指“原住民”，更常用且更尊重的说法是“Native Hawaiian”。如果只是表示“住在夏威夷/来自夏威夷州”，也常见说法是“a resident of Hawaii / someone from Hawaii”。"]}
{"word":"hawaiian","summary":{"en":"Hawaiian means “related to Hawaii,” or “a person from Hawaii/Native Hawaiian.”","zh":"Hawaiian 表示“夏威夷的”，也可指“夏威夷人/（尤指）夏威夷原住民”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hawaii (the U.S. state), its people, or its culture.","zh":"夏威夷的；与夏威夷（美国的州）、其人民或文化有关的。"},"examples":[{"en":"We tried Hawaiian food like poke and kalua pork.","zh":"我们尝了夏威夷美食，比如 poke（生鱼沙拉）和 kalua 猪肉。"},{"en":"She studies Hawaiian history and traditions.","zh":"她学习夏威夷的历史与传统。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Hawaii, or someone of Native Hawaiian background.","zh":"夏威夷人；（尤指）夏威夷原住民背景的人。"},"examples":[{"en":"Many Hawaiians speak English, and some also speak Hawaiian or pidgin.","zh":"许多夏威夷人说英语，有些人也说夏威夷语或“皮钦英语”。"},{"en":"He is Hawaiian and is proud of his family’s roots.","zh":"他是夏威夷人，并为家族根源感到自豪。"}]}],"synonyms":["of Hawaii","Hawaii-related","Native Hawaiian (specific)"],"phonetic":"/həˈwaɪən/","extraExplanation":["“Hawaiian”既可泛指“来自夏威夷的人”，也常被用来特指“夏威夷原住民（Native Hawaiian）”。在美国语境中，为了尊重与准确，谈到族裔身份时常会区分“from Hawaii（来自夏威夷）”与“Native Hawaiian（夏威夷原住民）”。","语言上，“Hawaiian”可指夏威夷语（ʻŌlelo Hawaiʻi），而“pidgin”通常指夏威夷克里奥尔英语（Hawai‘i Creole English），是当地常见的口语变体。"]}
{"word":"Hawaiian Islands","summary":{"en":"the island chain of Hawaiʻi in the central Pacific","zh":"太平洋中部的夏威夷群岛"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of islands in the central Pacific Ocean, including the U.S. state of Hawaiʻi; also called the Hawaiian archipelago","zh":"位于太平洋中部的一组岛屿，包括美国夏威夷州；也称“夏威夷群岛/夏威夷群岛链”"},"examples":[{"en":"The Hawaiian Islands include Oʻahu, Maui, and Hawaiʻi (the Big Island).","zh":"夏威夷群岛包括瓦胡岛、茂宜岛和夏威夷岛（大岛）。"},{"en":"Many visitors go to the Hawaiian Islands for beaches, hiking, and local culture.","zh":"许多游客去夏威夷群岛享受海滩、徒步和当地文化。"},{"en":"Volcanoes played a major role in forming the Hawaiian Islands.","zh":"火山活动在夏威夷群岛的形成中起了重要作用。"}]}],"synonyms":["Hawaiian archipelago","Hawaii","the Islands"],"phonetic":"/həˈwaɪən ˈaɪləndz/","extraExplanation":["英文里常见两种写法：Hawaii（常见拼写）与 Hawaiʻi（更贴近夏威夷语的写法，含“ʻokina”符号，表示一个类似喉塞音的停顿）。","在正式地理语境中，Hawaiian Islands 通常指整条群岛（含主要岛与西北夏威夷群岛）；日常旅游语境多指主要有人居住的几座岛。"],"etymology":"“Hawaiian”来自“Hawaiʻi”（夏威夷语中对夏威夷的称呼），英语里用 -an 构成形容词表示“……的/……人”；“Islands”意为“岛屿（复数）”。合起来指“夏威夷的诸岛”。","mnemonic":["把它记成“夏威夷 + 群岛”：Hawaiian（夏威夷的） + Islands（岛屿）。","联想常见三岛名：Oʻahu（瓦胡）、Maui（茂宜）、Hawaiʻi（大岛），帮助你把“群岛”概念记牢。"]}
{"word":"hawaiians","summary":{"en":"“Hawaiians” most commonly means people from or living in Hawaii; in some contexts it can specifically mean Native Hawaiians (the Indigenous people of Hawaii).","zh":"“Hawaiians”通常指来自或居住在夏威夷的人；在某些语境中也可能特指夏威夷原住民（夏威夷的原住民族群）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from Hawaii (a U.S. state in the Pacific), especially those who live there.","zh":"夏威夷人；来自（或居住在）美国夏威夷州的人。"},"examples":[{"en":"Many Hawaiians work in tourism, but other industries are growing too.","zh":"许多夏威夷人在旅游业工作，但其他产业也在发展。"},{"en":"He met some Hawaiians while studying at a university on Oʻahu.","zh":"他在瓦胡岛的一所大学读书时认识了一些夏威夷人。"}]},{"partOfSpeech":"n.","definition":{"en":"Native Hawaiians (an Indigenous Polynesian people), depending on context.","zh":"（视语境而定）夏威夷原住民；波利尼西亚裔的夏威夷土著民族。"},"examples":[{"en":"The festival highlights Native Hawaiians’ traditional music and dance.","zh":"这个节日展示夏威夷原住民的传统音乐与舞蹈。"},{"en":"Some Hawaiians prefer to be identified as Native Hawaiian to clarify ancestry and history.","zh":"有些夏威夷人更希望被称为“夏威夷原住民”，以明确族裔血统与历史背景。"}]}],"synonyms":["people from Hawaii","residents of Hawaii","Native Hawaiians (context-specific)"],"phonetic":"/həˈwaɪənz/","extraExplanation":["在英语里，“Hawaiians”有时泛指“来自/住在夏威夷的人”，但在更严肃或涉及身份议题的语境中，也可能特指“Native Hawaiians（夏威夷原住民）”。如果需要强调族裔与原住民身份，通常会用“Native Hawaiian(s)”来避免混淆。"]}
{"word":"hawaiite","summary":{"en":"Hawaiite is a basalt-like volcanic rock with slightly higher silica and alkali content, often linked to ocean-island volcanism.","zh":"夏威夷岩是一种类似玄武岩的火山岩，但硅与碱金属含量略高，常见于海洋岛火山环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a volcanic rock similar to basalt, but with slightly more silica and alkali metals (sodium and potassium); commonly found in ocean-island volcanoes such as Hawaii","zh":"一种与玄武岩相近的火山岩，但二氧化硅与碱金属（钠、钾）含量略高；常见于像夏威夷这类海洋岛火山环境"},"examples":[{"en":"Geologists identified the lava flow as hawaiite based on its mineral content.","zh":"地质学家根据矿物成分将这股熔岩流鉴定为夏威夷岩。"},{"en":"Some Hawaiian volcanoes erupt hawaiite as well as basalt.","zh":"一些夏威夷火山除了喷发玄武岩，也会喷发夏威夷岩。"}]}],"synonyms":["basaltic andesite (approx.)","alkali basalt (related)"],"phonetic":"/həˈwaɪ.aɪt/","extraExplanation":["“hawaiite”是以“夏威夷（Hawaii）”命名的岩石类型名称，常用于火山岩分类中。","在火山岩谱系里，它通常被视为比玄武岩更“演化”一点的成分（一般硅含量略高），常与“mugearite（穆盖岩）”“benmoreite（本莫尔岩）”等一起出现在相关讨论中。"]}
{"word":"hawbuck","summary":{"en":"A Scottish informal word for a clumsy or unsophisticated person.","zh":"一个苏格兰口语词，指笨拙或不够老练的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish, informal) A clumsy, awkward person; a rustic or bumpkin.","zh":"（苏格兰英语，非正式）笨拙的人；乡下土包子、粗鲁的人。"},"examples":[{"en":"He’s a lovable hawbuck, but you wouldn’t want him carrying anything fragile.","zh":"他是个讨人喜欢的笨家伙，但你可不想让他拿易碎的东西。"},{"en":"The city kids laughed and called him a hawbuck when he didn’t know the slang.","zh":"他不懂那些俚语时，城里的孩子笑着叫他“土包子”。"}]}],"synonyms":["clumsy person","awkward fellow","bumpkin","boor","lout"],"phonetic":"ˈhɔːbʌk","extraExplanation":["“hawbuck”多见于苏格兰方言（Scots）语境，带有口语、带点取笑或轻蔑的语气；有时也可用于半开玩笑地形容“笨手笨脚但不坏”的人。","在现代英语中并不常见；在文学作品、地方口述或强调苏格兰地域风格的对白里更可能遇到。"]}
{"word":"hawcuaite","summary":{"en":"“hawcuaite” does not appear to be a standard English word; it may be a misspelling or a proper noun. Please provide context or confirm the intended spelling.","zh":"“hawcuaite” 似乎不是标准英语单词，可能是拼写错误或专有名词。请提供上下文或确认你想查的正确拼写。"},"extraExplanation":["你输入的 **“hawcuaite”** 看起来不像是标准英语单词，可能是拼写错误或是某个专有名词（人名/地名/用户名）。\n\n为了帮你更准确地查词，你可以：\n1) 告诉我它出现的句子/上下文；或\n2) 确认你想输入的是否是下面这些常见词之一（按字母形状接近度猜测）：\n- **adequate**（足够的；合格的）\n- **haughty**（傲慢的）\n- **Hawkwait / Haucwaite**（更像姓氏/地名的拼写风格，需上下文确认）\n\n把正确拼写或句子发我，我就能给你发音、词性、双语释义和例句。"]}
{"word":"hawcubite","summary":{"en":"“hawcubite” is not a standard English word in major dictionaries; it’s likely a made-up term, name, or misspelling.","zh":"“hawcubite”并非常见或标准英语词；更可能是自造词、专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or extremely rare term; it does not appear in major English dictionaries, so it likely functions as a made-up word, a username, a brand name, or a misspelling of another word.","zh":"一个非标准或极少见的词；主流英语词典中通常查不到，因此更可能是自造词、用户名/品牌名，或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find a standard dictionary meaning for “hawcubite”—do you have a sentence that uses it?","zh":"我查不到“hawcubite”的标准词典释义——你能提供一个包含它的句子吗？"},{"en":"“Hawcubite” looks like a name or handle rather than a common English word.","zh":"“Hawcubite”看起来更像名字或网名，而不是常见英语词。"}]}],"phonetic":"/ˈhɔk.juː.baɪt/","extraExplanation":["“hawcubite”不像常见英语构词（也不符合常见词根/后缀组合），所以很可能是：\n1）拼写误差（你可能想写的是另一个单词）；\n2）专有名词（人名/地名/组织名/产品名）；\n3）网络用语或粉丝圈自造词。\n如果你把它出现的上下文（一句话、截图、来源链接）发我，我可以帮你判断它最可能的意思、正确拼写和用法。"]}
{"word":"hawebake","summary":{"en":"“hawebake” isn’t a recognized English word; it’s probably a typo or combined words.","zh":"“hawebake” 不是标准英语词；更可能是拼写错误或把几个词连在一起了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a mistyped phrase (for example, “have a bake,” “how we bake,” or a brand/user name).","zh":"不是标准英语单词。更可能是拼写错误或误输入的短语（例如 “have a bake”“how we bake”，或某个品牌/用户名）。"},"examples":[{"en":"I couldn’t find “hawebake” in an English dictionary—could you share the full sentence?","zh":"我在英语词典里找不到 “hawebake”——你能把完整句子发我吗？"},{"en":"Did you mean “have a bake” (to bake something for fun) or “how we bake” (a description of a baking method)?","zh":"你是想写 “have a bake”（一起烤点东西/烘焙玩）还是 “how we bake”（我们如何烘焙的方法描述）？"}]}],"extraExplanation":["“hawebake” 很像把两个词连在一起造成的误拼：\n- 可能是 “have” + “bake”（如 have a bake / bake something）。\n- 也可能是 “how we bake”（常见于标题或说明文）。\n如果你把它出现的上下文句子贴出来，我可以帮你判断最可能的正确写法与含义。"]}
{"word":"hawed","summary":{"en":"“Hawed” means “hesitated or spoke with pauses,” and it is the past form of “haw,” often seen in “hem and haw.”","zh":"“hawed”表示“犹豫、说话吞吞吐吐”，是“haw”的过去式，常见于“hem and haw”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “haw”: to hesitate or speak with pauses, often saying “uh” or “er,” especially when you are unsure what to say.","zh":"“haw”的过去式/过去分词：指犹豫不决、说话吞吞吐吐（常用“呃/嗯”等停顿音），尤其在不确定该怎么说时。"},"examples":[{"en":"When the reporter asked about the mistake, the manager hawed before answering.","zh":"记者问到这个错误时，经理先吞吞吐吐地犹豫了一下才回答。"},{"en":"She hawed and then changed the subject.","zh":"她支支吾吾了一下，然后转移了话题。"}]}],"synonyms":["hesitated","wavered","dithered","stammered"],"phonetic":"/hɔd/","extraExplanation":["“hawed”常见于固定搭配“hem and haw”，意思是“犹豫、支吾、含糊其辞”。其中“hem”更像清嗓或拖延的声音，“haw”像含糊的停顿音；合在一起强调说话不干脆、拿不定主意。","在现代英语里，单独用“haw”/“hawed”比“hem and haw”少见一些，更多出现在叙述文或较书面/幽默的语境中。"]}
{"word":"hawer","summary":{"en":"“hawer” is not a standard modern English word; it’s usually a misspelling of “hawker” or “haver.”","zh":"“hawer”在现代英语里不是常见标准词；通常是把“hawker”或“haver”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern use; it is most often a misspelling of “hawker” (a street seller) or “haver” (a person who has something).","zh":"现代英语中不算常见或标准词；多半是把 “hawker”（街头小贩）或 “haver”（拥有某物的人）拼错了。"},"examples":[{"en":"I couldn’t find “hawer” in the dictionary—did you mean “hawker” (street seller)?","zh":"我在词典里找不到 “hawer”——你是不是想写 “hawker”（街头小贩）？"},{"en":"If you meant “haver,” you can say: “She’s a cat-haver” (she has a cat).","zh":"如果你想写 “haver”，可以说：“She’s a cat-haver”（她有一只猫）。"}]}],"phonetic":"ˈhɑwɚ","extraExplanation":["“hawer”本身在主流现代英语里不常作为独立词条出现。如果你告诉我你看到它的句子或语境（例如在聊天、歌词、地名、人名里），我可以更准确判断它是拼写错误、方言用法，还是专有名词。"]}
{"word":"hawfinch","summary":{"en":"A hawfinch is a large European finch with a very strong beak for cracking hard seeds.","zh":"hawfinch 指欧洲的蜡嘴雀，喙粗厚有力，能啄开坚硬种子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large European finch with a very thick, powerful beak, known for cracking hard seeds (especially cherry pits).","zh":"蜡嘴雀（欧洲的一种体型较大的雀科鸟，喙非常粗厚有力，擅长啄开坚硬种子，尤其是樱桃核）。"},"examples":[{"en":"We spotted a hawfinch in the woodland, cracking seeds with its huge beak.","zh":"我们在林地里看到一只蜡嘴雀，它用巨大的喙啄开种子。"},{"en":"The hawfinch is shy, so birdwatchers often hear it before they see it.","zh":"蜡嘴雀比较害羞，观鸟者常常先听到它的动静，后才看到它。"}]}],"synonyms":["European hawfinch"],"phonetic":"/ˈhɔːfɪntʃ/","extraExplanation":["“Hawfinch”主要分布在欧洲与西亚等地，英文名里的“haw-”来自“hawthorn”（山楂），因为它会取食山楂等植物的果实与种子。","与美洲常见的“grosbeak”（蜡嘴雀类的统称）在外形与习性上有相似之处，但“hawfinch”通常特指欧洲的物种（Coccothraustes coccothraustes）。"]}
{"word":"hawfinch-like","summary":{"en":"having the appearance or features of a stout, big-billed finch","zh":"外形特征像蜡嘴雀（尤其指粗大有力的喙）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hawfinch (a stout finch with a very large, powerful bill).","zh":"像蜡嘴雀（喙粗大有力的一种雀形鸟）的；具有“蜡嘴雀特征”的。"},"examples":[{"en":"The illustrator gave the character a hawfinch-like beak—short, thick, and strong.","zh":"插画师把角色画成“蜡嘴雀式”的喙——短、粗、很有力。"},{"en":"In the field notes, the bird was described as hawfinch-like, especially in the heavy bill and head shape.","zh":"野外记录里把这只鸟描述为“像蜡嘴雀”，尤其是厚重的喙和头部轮廓。"}]}],"synonyms":["hawfinchlike","grosbeak-like","finch-like"],"phonetic":"/ˈhɔːfɪntʃ laɪk/","extraExplanation":["hawfinch 指欧洲和亚洲常见的蜡嘴雀（学名 Coccothraustes coccothraustes），以“粗壮的大嘴喙”很有辨识度；因此 hawfinch-like 多用来强调“嘴喙厚大、头部结实”的外观。"],"etymology":"由 hawfinch（haw=山楂 + finch=雀；因其会吃山楂果/籽而得名）加后缀 -like（“像……一样”）构成，用来表示外形或特征相似。","mnemonic":["拆开记：hawfinch + like = “像 hawfinch 一样”。看到 -like 就想到“……样/……似的”。","联想画面：蜡嘴雀的嘴像“小钳子”能夹碎硬种子；hawfinch-like 常在描写“厚嘴喙”。"]}
{"word":"hawfinch-related","summary":{"en":"connected to hawfinches.","zh":"与蜡嘴雀有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, belonging to, or involving a hawfinch (a type of finch with a very strong beak).","zh":"与蜡嘴雀（hawfinch，一种喙非常有力的雀形鸟）有关的；属于或涉及蜡嘴雀的。"},"examples":[{"en":"The paper includes hawfinch-related observations from central Europe.","zh":"这篇论文收录了来自中欧的蜡嘴雀相关观察记录。"},{"en":"We found hawfinch-related damage on cherry stones near the feeder.","zh":"我们在喂食器附近的樱桃核上发现了蜡嘴雀相关的啃咬痕迹。"},{"en":"The museum has a small hawfinch-related exhibit on seed-cracking beaks.","zh":"博物馆有一个关于“能压碎种子的鸟喙”的小型蜡嘴雀相关展区。"}]}],"synonyms":["hawfinch-associated","hawfinch-connected","hawfinch-linked","pertaining to hawfinches"],"phonetic":"ˈhɔːfɪntʃ rɪˈleɪtɪd","extraExplanation":["hawfinch 常指欧亚蜡嘴雀（Coccothraustes coccothraustes），以粗壮有力的喙著名，能轻松咬碎樱桃核、角树等坚硬种子。","“X-related”是学术写作和新闻中常见结构，表示“与X有关的”。在更自然的日常表达里，也常说 “related to hawfinches / about hawfinches”。"],"etymology":"由 hawfinch（蜡嘴雀，一种雀科鸟；英文名可能与“hawk（鹰）”的强壮感联想有关）+ related（相关的）构成的复合形容词，用于说明“与蜡嘴雀有关”。","mnemonic":["把它拆开记：hawfinch（蜡嘴雀）+ related（相关）=“蜡嘴雀相关”。","联想“hawfinch 喙很硬，能咬开硬核”；看到研究/观察/痕迹（damage）就容易用到 “-related”。"]}
{"word":"hawfinches","summary":{"en":"“Hawfinches” means more than one hawfinch—stout finches known for their very strong beaks used to crack hard seeds.","zh":"“Hawfinches”是 hawfinch 的复数，指多只嘴喙粗壮、能啄碎硬种子的雀科鸟（常指欧亚蜡嘴雀一类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hawfinch: a stout, seed‑eating finch with a very thick, powerful beak (often referring to the Eurasian hawfinch).","zh":"hawfinch 的复数：一种以种子为食、嘴喙粗厚有力的雀科鸟（常指欧亚蜡嘴雀/锡嘴雀一类）。"},"examples":[{"en":"We spotted a small flock of hawfinches cracking cherry pits in the trees.","zh":"我们看到一小群 hawfinches 在树上啄开樱桃核。"},{"en":"In winter, hawfinches often visit gardens where there are plenty of hard seeds.","zh":"冬天如果花园里有很多坚硬的种子，hawfinches 常会来觅食。"}]}],"synonyms":["finches","seed-eating birds"],"phonetic":"/ˈhɔfɪn.tʃɪz/","extraExplanation":["“hawfinch”这个名字里的 haw 指的是山楂（hawthorn）。这种鸟会吃山楂等植物的种子，因此得名。","在鸟类观察（birdwatching）语境里，hawfinch/ hawfinches 常用来泛指“嘴特别粗壮、能轻松啄碎硬核”的蜡嘴雀类。具体物种会因地区而异。"]}
{"word":"hawing","summary":{"en":"Hawing mainly means hesitating or speaking with pauses, especially in “hemming and hawing.”","zh":"Hawing主要指犹豫或说话吞吞吐吐，常见于“hemming and hawing”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Usually in the phrase “hemming and hawing”) hesitating or speaking unclearly while deciding what to say or do.","zh":"（常用于短语“hemming and hawing”）犹豫不决；吞吞吐吐、支支吾吾地说话。"},"examples":[{"en":"Stop hemming and hawing and tell me what you really want.","zh":"别再支支吾吾了，直接告诉我你到底想要什么。"},{"en":"She kept hawing during the interview, so she didn’t sound confident.","zh":"她在面试中一直吞吞吐吐，所以听起来不太自信。"},{"en":"I’m not hawing—I just need a minute to think.","zh":"我不是在犹豫不决——我只是需要一分钟想一想。"}]},{"partOfSpeech":"vi.","definition":{"en":"Making a short hesitation sound like “haw” (similar to saying “uh”).","zh":"发出类似“haw”的犹豫语气音（有点像“呃”）。"},"examples":[{"en":"He started talking, hawing and pausing, then finally explained the problem.","zh":"他开始说话时一边“呃……”一边停顿，最后才把问题解释清楚。"}]}],"synonyms":["hesitating","stalling","wavering","vacillating","hemming and hawing"],"phonetic":"/ˈhɔɪŋ/","extraExplanation":["“hawing”来自动词/感叹词“haw”，表示说话时发出犹豫的声音。现代英语里最常见的固定搭配是“hem and haw”，意思是“犹豫、吞吞吐吐”。","在文学与日常对话中，“hemming and hawing”常用来描写一个人不够果断、说话不直接，带一点轻微的批评意味。"]}
{"word":"hawiya","summary":{"en":"Hawiya is a transliterated Arabic word that can mean either an ID/identity card (common in Gulf contexts) or, in some spellings, a hobby.","zh":"Hawiya 是阿拉伯语音译词，常见含义是“身份证/身份证件”（海湾国家语境较常见）；在某些拼写/转写中也可指“爱好”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Arabic loanword; often spelled hawiyya/hawiya) identity; an identity card (ID), especially in Gulf countries.","zh":"（阿拉伯语外来词，常见拼写 hawiyya/hawiya）身份；身份证/身份证件（在海湾国家语境中尤常见）。"},"examples":[{"en":"Please bring your hawiya when you come to the office.","zh":"来办公室时请带上你的 hawiya（身份证件）。"},{"en":"They checked my hawiya at the airport.","zh":"在机场他们查验了我的 hawiya（身份证）。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some transliterations, from Arabic hiwāya) a hobby; something you do for fun in your free time.","zh":"（某些转写中对应阿拉伯语 hiwāya）爱好；业余嗜好。"},"examples":[{"en":"Reading is my hawiya.","zh":"阅读是我的 hawiya（爱好）。"},{"en":"Cooking became her favorite hawiya during the summer.","zh":"夏天里，做饭成了她最喜欢的 hawiya（爱好）。"}]}],"synonyms":["ID","identity card","identification","hobby","pastime"],"phonetic":"/hɑːˈwiːjə/","extraExplanation":["“hawiya” 这种拼写在英文里多见于把阿拉伯语词直接音译过来，但它可能对应两个不同的阿拉伯语词：\n1) هُوِيَّة (huwiyya) “身份/身份证件”；\n2) هِواية (hiwāya) “爱好”。\n在不同国家/社群里，大家习惯的拼法和读法会不一样。","如果你告诉我你是在什么语境里看到的（比如机场、政府办事、或是在介绍兴趣爱好），我可以帮你更准确地对应到哪一个词，并给出更贴近那个地区的常见拼写。"]}
{"word":"hawk","summary":{"en":"“Hawk” most commonly means a bird of prey; it can also mean a war-supporting “hawk” in politics, or the verb meaning to hawk/market something aggressively.","zh":"“hawk”最常指“鹰/猛禽”；也可指政治上的“鹰派人物”；作动词时表示“兜售、强行推销”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medium-to-large bird of prey with sharp eyesight and strong talons, often seen hunting small animals","zh":"鹰（一种中大型猛禽，视力极好，有利爪，常捕食小动物）"},"examples":[{"en":"A hawk circled high above the field, watching for a mouse.","zh":"一只鹰在田野上空盘旋，寻找老鼠。"},{"en":"We spotted a hawk perched on a telephone pole.","zh":"我们看到一只鹰停在电线杆上。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who strongly supports war or the use of military force (often contrasted with “dove”)","zh":"鹰派人物（主张强硬、支持战争或使用武力的人，常与“鸽派”相对）"},"examples":[{"en":"Some hawks in the government argued for a tougher response.","zh":"政府中的一些鹰派主张采取更强硬的回应。"}]},{"partOfSpeech":"v.","definition":{"en":"to sell or advertise something aggressively, especially in a way that feels pushy","zh":"兜售；强行推销（以咄咄逼人的方式卖东西或做宣传）"},"examples":[{"en":"Vendors hawked snacks outside the stadium.","zh":"小贩在体育场外兜售零食。"},{"en":"He was accused of hawking fake tickets online.","zh":"他被指控在网上兜售假票。"}]}],"synonyms":["raptor","bird of prey","hard-liner","peddle","tout"],"phonetic":"/hɔk/","extraExplanation":["“hawk”和“eagle（鹰）”在中文里都常译作“鹰”，但英语里是不同的鸟类：eagle 通常体型更大、更具象征意义；hawk 更常见于野外，强调敏锐视力与捕猎能力。","政治语境中的“hawk/dove（鹰派/鸽派）”在美国新闻与外交讨论里很常见：hawk 倾向强硬手段，dove 倾向谈判与克制。","动词“to hawk”常带有“拉客、吆喝、推销得有点烦人”的语气，语感比 sell 更“强势”。"]}
{"word":"Hawk-eyed","summary":{"en":"Hawk-eyed means very observant and quick to notice small details.","zh":"Hawk-eyed 指“目光敏锐、非常善于发现细节”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having very sharp eyesight and noticing small details quickly; very observant and watchful.","zh":"目光敏锐的；观察力很强的；很警觉、能迅速注意到细节的。"},"examples":[{"en":"The hawk-eyed teacher noticed the smallest mistake in my homework.","zh":"那位目光敏锐的老师发现了我作业里最小的错误。"},{"en":"A hawk-eyed security guard spotted someone acting suspiciously.","zh":"一位观察力很强的保安发现有人行为可疑。"},{"en":"She gave the report a hawk-eyed review before sending it.","zh":"她在发送前以非常细致的眼光审阅了这份报告。"}]}],"synonyms":["keen-eyed","sharp-eyed","observant","watchful","eagle-eyed"],"phonetic":"/ˌhɔk ˈaɪd/","extraExplanation":["“hawk-eyed”来自“hawk（鹰）”的形象：鹰以视力好著称，所以这个词常用来比喻人“看得很细、很快发现问题”。\n用法提示：多用连字符（hawk-eyed），也常见作表语或定语（a hawk-eyed detective / He was hawk-eyed about details）。语气通常中性偏褒义，但在“监视很紧”的语境里也可能带一点压力感。"]}
{"word":"hawk-eyed","summary":{"en":"Very sharp and attentive in noticing details.","zh":"观察力很强，能迅速发现细节。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very observant; quick to notice small details.","zh":"目光敏锐的；善于察觉细节的。"},"examples":[{"en":"The editor was hawk-eyed and caught several typos we missed.","zh":"这位编辑目光很尖，一下就发现了我们漏掉的几个拼写错误。"},{"en":"Be hawk-eyed in the lab—small changes can matter.","zh":"在实验室要特别细心——微小变化也可能很关键。"}]}],"synonyms":["observant","sharp-eyed","keen-eyed","watchful","perceptive","eagle-eyed"],"phonetic":"/ˌhɔk ˈaɪd/","extraExplanation":["常见搭配：a hawk-eyed guard/teacher/editor（眼尖的保安/老师/编辑）。","语体：较口语、形象的比喻表达，也常写作 hawkeyed（不带连字符）。"],"etymology":"来自“hawk（鹰）+ eyed（有……眼睛的）”。英语里常用鹰的视力来比喻“观察力强、看得很细”。","mnemonic":["把它想成“鹰眼（鹰的眼睛）= 眼睛像鹰一样锐利”，对应中文“眼尖/火眼金睛”。","联想到影视角色“鹰眼”，记住含义是“善于发现细节”。"]}
{"word":"hawk-like","summary":{"en":"sharp-eyed and watchful; predatory in a way","zh":"目光锐利、警觉盯梢的；带掠食者般气势的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having qualities associated with a hawk, especially being sharp-eyed, watchful, or ready to attack.","zh":"像鹰一样的；尤指目光锐利、警觉盯梢、带有攻击性或掠夺性的。"},"examples":[{"en":"The security guard kept a hawk-like watch on the entrance all night.","zh":"保安整晚都以鹰一般的警觉盯着入口。"},{"en":"With hawk-like eyes, she noticed the typo before anyone else did.","zh":"她眼神如鹰般敏锐，比任何人都先发现了那个拼写错误。"},{"en":"His hawk-like expression made the new employees nervous.","zh":"他那种鹰般犀利的神情让新员工有些紧张。"}]}],"synonyms":["sharp-eyed","watchful","vigilant","keen-eyed","piercing","predatory"],"phonetic":"/ˈhɔkˌlaɪk/","extraExplanation":["英语里常用“动物 + -like”来造形容词，表示“具有某种动物的典型特征”，如 cat-like（猫一样灵活/狡黠）、wolf-like（狼一样凶狠/贪婪）。","“hawk-like”在描写人时，多强调“锐利、紧盯、随时出手”的感觉；语气可能偏强，带一点压迫感。"],"etymology":"由“hawk（鹰）+ -like（像……的）”构成的复合形容词；用鹰的典型特征（视力好、善于捕猎）来比喻人的观察力或态度。","mnemonic":["联想“鹰眼”：鹰（hawk）视力超强，所以 hawk-like 常用来形容“眼神很尖、盯得很紧”。","拆分记忆：hawk（鹰）+ like（像）= 像鹰一样。"]}
{"word":"hawk-nosed","summary":{"en":"Having a sharp, curved nose.","zh":"鼻子弯而尖、呈鹰钩状的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a nose that is curved and sharp like a hawk’s beak.","zh":"（鼻子）像鹰嘴一样弯曲而尖的；鹰钩鼻的。"},"examples":[{"en":"The detective in the novel is described as hawk-nosed and intense.","zh":"小说里的侦探被描写成鹰钩鼻、目光锐利。"},{"en":"A hawk-nosed man stood at the doorway, watching quietly.","zh":"一个鹰钩鼻的男人站在门口，安静地看着。"}]}],"synonyms":["aquiline","eagle-nosed","hook-nosed","beak-nosed"],"phonetic":"/ˈhɔk noʊzd/","extraExplanation":["这是中性到略带评价色彩的外貌描写词。用于文学描写很常见，但在现实交流中直接评价他人五官可能显得不礼貌；更委婉的说法可以是 “He has a prominent, curved nose.”（他鼻子比较挺、略弯）。","英语里常见类似结构：eagle-nosed（鹰钩鼻）、Roman-nosed（罗马鼻：鼻梁高直略弯）、aquiline（较正式：鹰钩鼻的）。"],"etymology":"由 hawk（鹰）+ nosed（有……鼻子的）构成的复合形容词；用“鹰的喙”作比喻，形容鼻梁弯曲、鼻尖较突出。","mnemonic":["想象“hawk=鹰”的嘴（喙）是弯而尖的；hawk-nosed=鼻子像鹰嘴一样弯尖。","把它拆开记：hawk（鹰）+ nosed（有……鼻子的）→ “鹰鼻”。"]}
{"word":"hawk-owl","summary":{"en":"An owl with hawk-like traits, sometimes specifically the Northern Hawk Owl.","zh":"外形或习性像鹰的猫头鹰；有时特指北鹰鸮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A kind of owl that looks or behaves somewhat like a hawk (for example, some long-tailed, daytime-hunting owls).","zh":"一种外形或习性有点像鹰的猫头鹰（例如部分尾巴较长、白天也会捕猎的猫头鹰）。"},"examples":[{"en":"The hawk-owl hunted in daylight, scanning the forest from an exposed perch.","zh":"这只鹰鸮在白天捕猎，从显眼的栖木上扫视森林。"},{"en":"Because of its long tail and fast flight, some people mistake a hawk-owl for a small hawk.","zh":"因为尾巴较长、飞行迅速，有些人会把鹰鸮误认成小型的鹰。"}]},{"partOfSpeech":"n.","definition":{"en":"Specifically, the Northern Hawk Owl, a species found across northern Europe, Asia, and North America.","zh":"特指：北鹰鸮（Northern Hawk Owl），分布于欧洲、亚洲及北美的北方地区。"},"examples":[{"en":"Birders traveled north hoping to spot a hawk-owl during the winter irruption.","zh":"观鸟者冬季北上，希望在“爆发性迁出/扩散”时看到北鹰鸮。"}]}],"synonyms":["hawk owl","Northern Hawk Owl","northern hawk owl"],"phonetic":"/ˈhɔk ˌaʊl/","extraExplanation":["英语里这种命名很常见：用两个动物名组合，表示“外形/行为介于两者之间”或“让人联想到另一个动物”的物种名称。","注意不要与“eagle-owl（雕鸮）”混淆：eagle-owl通常指体型很大的鸮类（如Bubo属），而hawk-owl强调“像鹰”的体态与捕猎风格。"],"etymology":"复合词：hawk（鹰）+ owl（猫头鹰）。名字来自其“像鹰一样”的特征（例如更偏日行、捕猎方式更像猛禽、体态更修长）。不同地区也会把某些Ninox属的猫头鹰称作“hawk-owl”。","mnemonic":["拆开记：hawk（鹰）+ owl（猫头鹰）＝“像鹰一样的猫头鹰”。看到长尾、日间活动的鸮类，就容易联想到这个名字。","联想画面：一只猫头鹰站在树梢“像鹰一样盯猎物”＝hawk-owl。"]}
{"word":"hawkbill","summary":{"en":"Hawkbill usually means a sharply curved, beak-shaped knife blade, or describes that beak-like curved shape.","zh":"hawkbill 通常指“鹰嘴刀”（刀刃像鹰喙一样弯曲），也可作形容词表示“鹰嘴形的/弯钩状的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a knife with a strongly curved blade, shaped like a hawk’s beak, often used for pruning or cutting materials like carpet or linoleum","zh":"鹰嘴刀（刀刃强烈弯曲，形状像鹰的喙；常用于修枝或切割地毯、油毡等材料）"},"examples":[{"en":"He used a hawkbill knife to prune the rose bushes.","zh":"他用鹰嘴刀修剪玫瑰灌木。"},{"en":"A hawkbill blade is handy for pulling cuts through tough material.","zh":"鹰嘴形刀刃很适合在坚韧材料上“带拉”式切割。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a curved shape like a hawk’s beak (especially describing a blade)","zh":"鹰嘴形的；像鹰喙一样弯曲的（尤指刀刃形状）"},"examples":[{"en":"This tool has a hawkbill edge for easier slicing.","zh":"这把工具有鹰嘴形刀刃，更容易切割。"}]}],"synonyms":["pruning knife","curved-blade knife","hook blade","sickle knife"],"phonetic":"/ˈhɔkˌbɪl/","extraExplanation":["“hawkbill”由“hawk（鹰）+ bill（鸟嘴）”构成，字面意思是“鹰嘴”。因此它常用来描述明显向内弯的形状，最常见的搭配是“hawkbill knife（鹰嘴刀）”。","注意不要与“hawksbill（玳瑁海龟）”混淆：海龟那个词通常拼作 hawksbill（多一个 s），指一种海龟，而不是刀具。"]}
{"word":"hawkbills","summary":{"en":"“Hawkbills” most often means hawkbill turtles (plural), and it can also refer to curved “hawk-beak” blades or knives.","zh":"“Hawkbills”最常指“玳瑁（复数）”，也可指鹰嘴形的弯刃刀具/工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hawkbill turtle (plural): a sea turtle with a narrow head and a sharp, hooked beak, known for its beautiful patterned shell.","zh":"玳瑁（复数）：一种海龟，头部较窄、喙状嘴呈钩形，以花纹漂亮的甲壳而闻名。"},"examples":[{"en":"Hawkbills live in warm oceans and often feed around coral reefs.","zh":"玳瑁生活在温暖海域，常在珊瑚礁附近觅食。"},{"en":"Many countries protect hawkbills because their populations have declined.","zh":"许多国家保护玳瑁，因为它们的数量已经减少。"}]},{"partOfSpeech":"n.","definition":{"en":"Tools (plural) shaped like a hawk’s beak, such as a hawkbill knife or pruning blade, with a curved cutting edge.","zh":"鹰嘴形工具（复数）：刀刃或剪刃呈弯钩状、像鹰嘴的工具，如鹰嘴刀或园艺修枝刀。"},"examples":[{"en":"He carried hawkbills for cutting rope and opening packages.","zh":"他带着几把鹰嘴刀，用来割绳子和拆包裹。"},{"en":"Gardeners sometimes prefer hawkbills for clean cuts on small branches.","zh":"园艺工人有时更喜欢用鹰嘴形刀片，给小枝条做干净利落的切口。"}]}],"synonyms":["hawksbill turtles","hawkbill sea turtles","hawkbill knives","hooked blades","curved knives"],"phonetic":"/ˈhɔkˌbɪl/","extraExplanation":["“Hawkbill”字面意思是“鹰的喙（钩状嘴）”，因此既可指“喙像鹰一样弯钩”的海龟，也可指“刀刃像鹰嘴一样弯曲”的工具。","指海龟时，最常见的是“hawkbill sea turtle（玳瑁）”，因其甲壳花纹曾被用于制作饰品而遭到捕猎；如今在很多地区属于重点保护对象。"]}
{"word":"hawkbit","summary":{"en":"Hawkbit is a common wild plant with yellow, dandelion-like flowers.","zh":"Hawkbit 指一种常见野生植物，开黄色、像蒲公英的花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wildflower (in the daisy family) with yellow, dandelion-like blooms; hawkbits are often found in lawns, fields, and roadsides.","zh":"一种野花（菊科），开黄色、类似蒲公英的花；常见于草坪、田野和路边。"},"examples":[{"en":"Hawkbit looks a lot like a dandelion, but its leaves and stems can be different.","zh":"猫儿菊（hawkbit）看起来很像蒲公英，但它的叶子和花茎可能不一样。"},{"en":"In late spring, hawkbit can cover the field with small yellow flowers.","zh":"晚春时，猫儿菊可能让田野铺满小黄花。"},{"en":"We pulled out hawkbit from the lawn before it went to seed.","zh":"我们在它结籽前把草坪里的猫儿菊拔掉了。"}]}],"synonyms":["cat's-ear","Leontodon","rough hawkbit","smooth hawkbit"],"phonetic":"/ˈhɔkˌbɪt/","extraExplanation":["“hawkbit”由“hawk（鹰）+ bit（咬/一口）”组成，是早期民间命名方式之一；有人曾误以为这种植物与鹰的食性或视力有关（类似很多古老植物名的想象性来源），并不表示鹰真的会去“咬”它。","日常辨认时，hawkbit 常被与 dandelion（蒲公英）或 cat’s-ear（猫耳菊）混淆；它们都属于菊科、花形相似。不同地区“hawkbit”可能指不同近缘属（如 Leontodon 或 Scorzoneroides）的一些种。"]}
{"word":"hawked","summary":{"en":"Hawked means “sold by calling out,” or “coughed up phlegm,” and can also mean “pushed/promoted aggressively.”","zh":"hawked 是 hawk 的过去式/过去分词，可指“沿街叫卖/兜售”，也可指“咳出痰”，还可引申为“强力推销/宣传”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense / past participle of hawk) to sell goods by calling out in public; to peddle, especially on the street.","zh":"（hawk 的过去式/过去分词）沿街叫卖；兜售（常指在街头大声吆喝卖东西）。"},"examples":[{"en":"He hawked newspapers outside the subway station.","zh":"他在地铁站外沿街叫卖报纸。"},{"en":"Vendors hawked snacks to tourists near the temple.","zh":"小贩在寺庙附近向游客兜售零食。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense / past participle of hawk) to cough up phlegm or something stuck in the throat.","zh":"（hawk 的过去式/过去分词）咳出痰；把喉咙里卡着的东西咳出来。"},"examples":[{"en":"He stepped outside and hawked up phlegm.","zh":"他走到外面，把痰咳了出来。"},{"en":"She drank some water but still hawked and cleared her throat.","zh":"她喝了点水，但还是咳痰、清嗓子。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past tense / past participle of hawk) to promote or push an idea or product aggressively.","zh":"（hawk 的过去式/过去分词）强力推销；卖力宣传（观点、产品等）。"},"examples":[{"en":"He hawked his new course on every social media platform.","zh":"他在每个社交平台上卖力宣传他的新课程。"},{"en":"The spokesperson hawked the policy as a “simple solution.”","zh":"发言人把这项政策宣传成“简单的解决方案”。"}]}],"synonyms":["peddled","sold","vended","hustled","promoted","pushed","coughed up","expectorated"],"phonetic":"/hɔkt/","extraExplanation":["“hawk”作动词表示“沿街叫卖”时，常让人联想到英美街头小贩（hawker）大声吆喝的场景。","“hawk up phlegm”属于较直白、略不雅的表达，多用于非正式场合或医学/护理语境。","别和名词“hawk（鹰）”混淆；动词“hawk”这几种用法与“鹰”本义没有直接关系。"]}
{"word":"hawker","summary":{"en":"A hawker is a street vendor who sells goods in public places; in Southeast Asia it can also refer to food-stall areas like a “hawker center.”","zh":"hawker 指街头叫卖的小贩；在东南亚也常指类似“熟食中心/小贩中心”的摊贩聚集区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who sells goods in the street or goes from place to place selling small items","zh":"小贩；沿街叫卖的人；走街串巷卖小商品的人"},"examples":[{"en":"A hawker sold fruit outside the subway station.","zh":"地铁站外有个小贩在卖水果。"},{"en":"Tourists bought snacks from hawkers near the temple.","zh":"游客从寺庙附近的小贩那里买了零食。"}]},{"partOfSpeech":"n.","definition":{"en":"a street seller’s stall or area (common in Southeast Asia, e.g., “hawker center” in Singapore)","zh":"（东南亚常用）小贩摊位/美食摊区（如新加坡的“熟食中心/小贩中心”）"},"examples":[{"en":"We had dinner at a hawker center in Singapore.","zh":"我们在新加坡的小贩中心吃了晚饭。"}]}],"synonyms":["street vendor","peddler","seller"],"phonetic":"/ˈhɔkɚ/","extraExplanation":["“hawker”在美式英语里通常指街头叫卖的人，语气多为中性；在某些语境下也可能带一点“无证摆摊/占道”的联想，是否负面取决于当地法规与语境。","在新加坡、马来西亚等地，“hawker center”是很重要的饮食文化场所，汇集许多摊位，价格亲民、选择多，常被视为当地日常生活的一部分。"]}
{"word":"hawkers","summary":{"en":"Hawkers are street sellers; it can also mean people who aggressively promote or resell things (like tickets).","zh":"hawkers 指街头摆摊叫卖的小贩；也可指强行推销或倒卖（如门票）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who sell goods in public places (like streets or markets), often calling out to attract customers; street vendors","zh":"（在街头、市场等公共场所）叫卖商品的人；小贩；摊贩"},"examples":[{"en":"Hawkers sold snacks outside the stadium before the game.","zh":"比赛开始前，体育场外的小贩在卖零食。"},{"en":"Tourists bought fruit from hawkers near the beach.","zh":"游客在海滩附近向小贩买水果。"}]},{"partOfSpeech":"n.","definition":{"en":"people who try to sell or promote something aggressively (such as tickets, services, or ideas), sometimes in an annoying way","zh":"（带点贬义）兜售者；强行推销的人（如票务、服务或观点）"},"examples":[{"en":"Ticket hawkers waited outside the concert hall.","zh":"演唱会大厅外有黄牛在等着卖票。"},{"en":"Online hawkers kept messaging me about a “limited-time offer.”","zh":"网上推销的人一直给我发消息，说有“限时优惠”。"}]}],"synonyms":["street vendors","peddlers","vendors","salespeople","ticket scalpers"],"phonetic":"/ˈhɔkɚz/","extraExplanation":["“Hawkers”是复数形式，单数是“hawker”。在不同地区语感略有差别：在英式英语里常指街头叫卖的小贩；在新加坡、马来西亚等地，“hawker centre（小贩中心）”是很常见的公共美食广场概念，通常是正规管理的摊位聚集区。","在某些语境中（如“ticket hawkers”），可能暗示不太合法或令人反感的兜售行为，中文常译作“黄牛/票贩子/推销者”，要根据上下文选择更贴切的译法。"]}
{"word":"hawkery","summary":{"en":"Hawkery means street vending (the practice of hawking) or the cheap goods sold by hawkers.","zh":"Hawkery 指沿街叫卖/兜售这一做法（行业），也可指小贩兜售的廉价小商品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the selling of small goods in public places (street vending); the trade or practice of a hawker","zh":"（在公共场所）沿街叫卖、小贩式售卖；叫卖这一行业或做法"},"examples":[{"en":"The city tried to regulate hawkery near the subway entrances.","zh":"这座城市试图规范地铁口附近的沿街叫卖。"},{"en":"In tourist areas, hawkery can become loud and pushy.","zh":"在旅游区，叫卖式售卖有时会变得很吵、很强势。"}]},{"partOfSpeech":"n.","definition":{"en":"goods sold by hawkers; cheap items offered for quick sale","zh":"小贩叫卖的商品；廉价、快速兜售的小商品"},"examples":[{"en":"The sidewalks were crowded with hawkery—scarves, sunglasses, and snacks.","zh":"人行道上挤满了小贩兜售的东西——围巾、太阳镜和零食。"},{"en":"He avoided buying hawkery and looked for a reliable shop instead.","zh":"他不买路边兜售的小商品，而是去找更可靠的店。"}]}],"synonyms":["street vending","hawking","peddling","vending"],"phonetic":"/ˈhɔkəri/","extraExplanation":["“hawkery”较少见，更常见的说法是“street vending / hawking”。它来自动词“to hawk”（沿街叫卖、兜售），与名词“hawker”（小贩）同源。","注意不要和“hawker”（小贩）混淆：hawker 是人，hawkery 是行为/行业或所卖的东西。"]}
{"word":"hawkey","summary":{"en":"“Hawkeye” means someone with very sharp vision; it can also refer to Iowa (“the Hawkeye State”) or the Marvel character Hawkeye.","zh":"“Hawkeye”意为“鹰眼/眼尖的人”；也可指爱荷华州（“鹰眼之州”）或漫威角色“鹰眼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who has very sharp eyesight and notices small details easily.","zh":"（非正式）“鹰眼”；形容视力很好、很会注意细节的人。"},"examples":[{"en":"Our editor is a real hawkeye—she catches every typo.","zh":"我们的编辑真是“鹰眼”——每个错字她都能抓出来。"},{"en":"He watched the game with a hawkeye for any rule-breaking.","zh":"他像鹰眼一样盯着比赛，留意任何犯规。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname for the state of Iowa (the “Hawkeye State”) or for a person/team from Iowa.","zh":"（美国用法）爱荷华州的别称（“鹰眼之州”），也可指来自爱荷华的人或球队。"},"examples":[{"en":"She moved to the Hawkeye State for graduate school.","zh":"她为了读研搬到了“鹰眼之州”（爱荷华州）。"},{"en":"The Hawkeyes won the home game.","zh":"“鹰眼队”（常指爱荷华大学球队）赢了主场比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"A famous fictional name, especially Marvel’s superhero Hawkeye (Clint Barton), known for expert archery.","zh":"（专有名词）著名虚构人物名，尤指漫威超级英雄“鹰眼”（Clint Barton），以神射手闻名。"},"examples":[{"en":"Hawkeye is my favorite archer in the Marvel movies.","zh":"在漫威电影里，“鹰眼”是我最喜欢的弓箭手角色。"}]}],"synonyms":["sharp-eyed","eagle-eyed","observant"],"phonetic":"/ˈhɔkˌaɪ/","extraExplanation":["“hawkey”通常是拼写错误，更常见的正确拼法是 **Hawkeye**。","英语里把“鹰”的锐利视力用来比喻“观察力强、眼尖”，所以 hawkeye 常用来夸人很会发现细节。","作为文化背景，“Hawkeye State”指爱荷华州；“Hawkeyes”也常指爱荷华大学（University of Iowa）的运动队名。"]}
{"word":"Hawkeye","summary":{"en":"a name or nickname linked to sharp vision/aim, and to several famous U.S. cultural and Iowa-related uses.","zh":"与“目光锐利/瞄得准”相关的称呼，也常见作美国流行文化角色名及爱荷华州相关别称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname or title for someone with very sharp eyesight, attention, or aim (often used as a personal nickname).","zh":"（常作外号）形容人眼神锐利、观察力强或射击很准的称呼。"},"examples":[{"en":"They call her “Hawkeye” because she notices every small mistake.","zh":"大家叫她“鹰眼”，因为她能发现每一个小错误。"},{"en":"As a spotter, he’s a real Hawkeye.","zh":"作为观察员，他真是“鹰眼”。"}]},{"partOfSpeech":"n.","definition":{"en":"a famous fictional or pop-culture name, especially the Marvel superhero archer (Clint Barton), and also a well-known nickname in U.S. culture (e.g., “Hawkeye” Pierce in *M*A*S*H*).","zh":"美国流行文化中的著名名字，尤指漫威的弓箭手超级英雄“鹰眼”（Clint Barton）；也常指美剧/小说中的角色昵称（如《风流医生俏护士》里的“Hawkeye” Pierce）。"},"examples":[{"en":"Hawkeye is known for using a bow and trick arrows.","zh":"“鹰眼”以使用弓和各种特殊箭闻名。"},{"en":"In the old TV series, Hawkeye is a witty army doctor.","zh":"在那部老电视剧里，Hawkeye 是个机智的军医。"}]},{"partOfSpeech":"n.","definition":{"en":"a nickname connected to Iowa: “the Hawkeye State,” and by extension the University of Iowa sports teams (“the Hawkeyes”).","zh":"与美国爱荷华州有关的昵称：爱荷华州别称“鹰眼州”；也可指爱荷华大学的运动队名“The Hawkeyes（鹰眼队）”。"},"examples":[{"en":"Iowa is sometimes called the Hawkeye State.","zh":"爱荷华州有时被称为“鹰眼州”。"},{"en":"The Hawkeyes won the game last night.","zh":"“鹰眼队”昨晚赢了比赛。"}]}],"synonyms":["sharp-eyed","eagle-eyed","keen-eyed","Iowa","Hawkeye State","Hawkeyes","Clint Barton"],"phonetic":"ˈhɔːkaɪ","extraExplanation":["注意大小写：Hawkeye（大写）多为专名（角色名、队名、州别称）；hawkeye（小写）更像普通外号，强调“目光如炬/火眼金睛”的含义。","常见文化指代：漫威“鹰眼”是弓箭手英雄；《M*A*S*H*》里的“Hawkeye”是幽默健谈的军医。"],"etymology":"“Hawkeye”字面是“鹰（hawk）的眼睛”。作为绰号的流行用法与19世纪美国作家詹姆斯·费尼莫·库珀（James Fenimore Cooper）小说《最后的莫希干人》（*The Last of the Mohicans*）中的角色昵称“Hawkeye”有关；后来也被用作爱荷华州（Hawkeye State）及多种影视/漫画角色名。","mnemonic":["拆开记：hawk（鹰）+ eye（眼）→“像鹰一样的眼睛”= 观察力强、瞄得准。","联想中文：‘火眼金睛’≈ Hawkeye（看得特别清楚、很会发现细节）。"]}
{"word":"hawkeye","summary":{"en":"Hawkeye means someone with very sharp eyesight/attention to detail, and it’s also a well-known character name (Marvel; *The Last of the Mohicans*).","zh":"hawkeye 指“目光敏锐、观察力强的人”，也常作著名角色名（漫威“鹰眼”；《最后的莫希干人》中的“鹰眼”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person with extremely sharp eyesight or strong powers of observation.","zh":"目光敏锐的人；观察力很强的人。"},"examples":[{"en":"My grandma is a real hawkeye—she notices every small change in the house.","zh":"我奶奶真是个“鹰眼”——家里一点小变化她都能发现。"},{"en":"The editor was a hawkeye for spelling mistakes.","zh":"那位编辑对拼写错误特别敏感，像“鹰眼”一样。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A famous fictional nickname or character name, often referring to either a superhero archer in Marvel or the frontier scout in *The Last of the Mohicans*.","zh":"（专有名词）著名的绰号/角色名，常指漫威中用弓箭的超级英雄“鹰眼”，或《最后的莫希干人》中的边境侦察兵“鹰眼”。"},"examples":[{"en":"Hawkeye is one of the Avengers in the Marvel movies.","zh":"在漫威电影里，鹰眼是复仇者联盟的一员。"},{"en":"In *The Last of the Mohicans*, Hawkeye guides the group through the wilderness.","zh":"在《最后的莫希干人》里，“鹰眼”带领大家穿越荒野。"}]}],"synonyms":["sharp-eyed","eagle-eyed","observant","keen-eyed"],"phonetic":"/ˈhɔːkˌaɪ/","extraExplanation":["“hawkeye”是由“hawk（鹰）+ eye（眼睛）”构成的复合词，因此常被用作比喻，强调“看得准、看得细”。在日常英语里多用于称赞某人观察力强。","文化使用上，很多人首先想到漫威角色 Hawkeye（克林特·巴顿），而在经典美国文学《The Last of the Mohicans》中，Hawkeye 是主角之一的外号，象征他在森林中敏锐的生存与侦察能力。"]}
{"word":"Hawkeyes","summary":{"en":"A nickname most often referring to the University of Iowa teams, and sometimes to Iowans or sharp-eyed people.","zh":"多指爱荷华大学运动队昵称，也可指爱荷华州人或目光敏锐的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The sports teams of the University of Iowa (a common nickname used in U.S. college athletics).","zh":"（常指）美国爱荷华大学的运动队昵称（大学体育语境中很常见）。"},"examples":[{"en":"The Hawkeyes play their home games in Iowa City.","zh":"Hawkeyes（爱荷华大学队）在爱荷华城打主场比赛。"},{"en":"She bought a Hawkeyes sweatshirt for the game.","zh":"她为了看比赛买了一件 Hawkeyes 的卫衣。"}]},{"partOfSpeech":"n.","definition":{"en":"People from Iowa; Iowans (a traditional nickname).","zh":"爱荷华州人（传统外号）。"},"examples":[{"en":"Many Hawkeyes moved to bigger cities for work.","zh":"很多爱荷华州人为了工作搬去了更大的城市。"},{"en":"He’s a proud Hawkeye who still calls Iowa home.","zh":"他以自己是爱荷华州人而自豪，仍把爱荷华当作家乡。"}]},{"partOfSpeech":"n.","definition":{"en":"People with very sharp eyesight or strong attention to detail (plural of “hawkeye”).","zh":"视力极好、观察很敏锐的人（hawkeye 的复数）。"},"examples":[{"en":"The editors are hawkeyes when it comes to typos.","zh":"编辑们对错别字特别敏锐。"},{"en":"Security hawkeyes spotted the mistake right away.","zh":"安保人员眼尖，立刻发现了问题。"}]}],"synonyms":["Iowans","University of Iowa","eagle-eyed","sharp-eyed","keen-eyed"],"phonetic":"/ˈhɔkˌaɪz/","extraExplanation":["在体育新闻里，The Hawkeyes 往往特指“爱荷华大学校队”（例如美式橄榄球、篮球等）；若在地理/身份语境里，则可能指“爱荷华州人”。","大写 Hawkeyes 常表示专名（球队/群体昵称）；小写 hawkeyes 更像一般意义的“目光敏锐的人”。"],"etymology":"源自英语 hawk（鹰/隼）+ eye（眼睛），字面意思是“鹰眼”。在美国文化中，“Hawkeye”也成为爱荷华州的昵称（The Hawkeye State），与19世纪人物/称号“Black Hawk（黑鹰）”以及文学与媒体的传播有关，后来被爱荷华大学采用为队名。","mnemonic":["拆开记：hawk（鹰）+ eyes（眼睛）→ “鹰的眼睛”→ 眼神/观察力很强。","联想：Iowa 的别称是 The Hawkeye State，所以 Hawkeyes 常和“爱荷华（州/大学）”一起出现。"]}
{"word":"hawkeys","summary":{"en":"“Hawkeyes” most often refers to very sharp eyesight (hawk eyes), the University of Iowa sports teams, or Marvel’s hero Hawkeye.","zh":"“Hawkeyes”常指“鹰一般的锐利眼力（hawk eyes）”、爱荷华大学运动队队名，或漫威英雄“鹰眼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"very sharp eyesight; the ability to notice small details quickly (often used as “hawk eyes”)","zh":"鹰一般的锐利眼力；很快注意到细节的能力（常用作“hawk eyes”）"},"examples":[{"en":"She has hawk eyes—she spotted the typo immediately.","zh":"她眼力像鹰一样——立刻就发现了那个错别字。"},{"en":"With your hawk eyes, can you check if this is the right address?","zh":"你眼力这么好，能帮我看看这个地址对不对吗？"}]},{"partOfSpeech":"n.","definition":{"en":"the sports teams of the University of Iowa (U.S.), often called “the Iowa Hawkeyes”","zh":"（美国）爱荷华大学的运动队队名，常称“The Iowa Hawkeyes（爱荷华鹰眼队）”"},"examples":[{"en":"He went to a Hawkeyes football game last weekend.","zh":"他上周末去看了爱荷华鹰眼队的橄榄球比赛。"},{"en":"The Hawkeyes are playing at home tonight.","zh":"鹰眼队今晚主场比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"a superhero name, most commonly Hawkeye from Marvel (Clint Barton or Kate Bishop)","zh":"超级英雄名，最常指漫威的“鹰眼”（克林特·巴顿或凯特·毕肖普）"},"examples":[{"en":"Hawkeye is known for his archery skills.","zh":"鹰眼以高超的箭术闻名。"},{"en":"She dressed as Hawkeye for Halloween.","zh":"她万圣节装扮成鹰眼。"}]}],"synonyms":["sharp-eyed","eagle-eyed","keen-eyed"],"phonetic":"/ˈhɔːkaɪz/","extraExplanation":["你输入的“hawkeys”更常见的拼写是 **Hawkeyes**（复数）。如果你想表达“像鹰一样的眼力”，更自然的说法是 **hawk eyes**（两词）或 **have hawk eyes**。","“Iowa Hawkeyes”中的“Hawkeyes”来自爱荷华州的别称“Hawkeye State”，与19世纪美洲原住民领袖Black Hawk（黑鹰）相关；而“Hawkeye”作为外号也出现在美国文学《最后的莫希干人》中（主角之一的绰号）。"]}
{"word":"hawkie","summary":{"en":"“Hawkie” is an informal nickname, usually connected to “Hawkeye,” meaning someone with very sharp eyesight, or sometimes a playful term for a hawk.","zh":"“Hawkie”多为非正式昵称，通常和“Hawkeye（鹰眼）”相关，指眼力很强的人；有时也作为对“鹰”的俏皮叫法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal nickname for someone called “Hawkeye,” or for a person known for very sharp eyesight (like a hawk)","zh":"（非正式）“Hawkeye（鹰眼）”的昵称/变体拼写；也可指眼力很强、观察敏锐的人（像鹰一样）"},"examples":[{"en":"Everyone calls my grandpa Hawkie because he can spot birds far away.","zh":"大家都叫我爷爷 Hawkie，因为他能在很远的地方看到鸟。"},{"en":"Hawkie noticed the mistake right away.","zh":"Hawkie 立刻就发现了错误。"}]},{"partOfSpeech":"n.","definition":{"en":"a cute or casual way to refer to a hawk (less common, often in personal or playful writing)","zh":"（较少见）对“hawk（鹰/隼）”的可爱或随意叫法（多见于个人、玩笑式表达）"},"examples":[{"en":"A little hawkie landed on the fence for a second.","zh":"一只小鹰在栅栏上落了一下。"}]}],"synonyms":["Hawkeye","sharp-eyed","eagle-eyed"],"phonetic":"/ˈhɔːki/","extraExplanation":["“hawkie”并不是一个非常标准、常见的词典词条，更常见的形式是“Hawkeye（鹰眼）”。在流行文化中，Hawkeye常指漫威角色（复仇者联盟的弓箭手克林特·巴顿），或作为“眼力极佳的人”的绰号。","如果你是在聊天中看到的“Hawkie”，它也可能是人名/用户名/昵称，具体含义要看语境。你可以把原句发我，我能帮你更准确判断。"]}
{"word":"hawkies","summary":{"en":"“Hawkies” is an informal spelling most often meaning “sharp-eyed observers,” or it may refer to the Iowa “Hawkeyes.”","zh":"“hawkies”多为非正式拼写，常指“眼神敏锐的人”，也可能指爱荷华大学的“Hawkeyes（鹰眼队）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) People or animals with very sharp eyesight; “sharp-eyed observers.”","zh":"（非正式）眼神很敏锐的人或动物；“目光锐利的观察者”。"},"examples":[{"en":"With hawkies like the security team watching, it’s hard to sneak in.","zh":"保安队那种“鹰眼”盯着，很难偷偷溜进去。"},{"en":"Birdwatchers need to be hawkies to spot tiny movements in the trees.","zh":"观鸟者得眼尖，才能发现树上细微的动静。"}]},{"partOfSpeech":"n.","definition":{"en":"(often written “Hawkeyes”) A nickname for the University of Iowa sports teams (and sometimes people from Iowa).","zh":"（常写作 Hawkeyes）爱荷华大学运动队的昵称（有时也指爱荷华州的人）。"},"examples":[{"en":"The Hawkeyes play their home games in Iowa City.","zh":"Hawkeyes（爱荷华大学队）在爱荷华城打主场比赛。"},{"en":"She grew up a Hawkeyes fan.","zh":"她从小就是 Hawkeyes 的球迷。"}]}],"synonyms":["sharp-eyed people","keen-eyed observers","Hawkeyes","Iowa Hawkeyes"],"phonetic":"/ˈhɔːkaɪz/","extraExplanation":["“Hawkeyes”这个昵称在美国文化中很常见，尤其和爱荷华大学（University of Iowa）体育相关；也有人把爱荷华州称作“the Hawkeye State”。这一称呼与美国早期文学与历史人物的绰号传统有关（常被认为与詹姆斯·费尼莫尔·库珀《最后的莫希干人》中的角色“Hawkeye”有关）。","拼写提示：更常见的形式是 Hawkeye（单数）/ Hawkeyes（复数）。你写的“hawkies”多见于口语式、非正式拼写。"]}
{"word":"hawking","summary":{"en":"“Hawking” most commonly means selling goods by calling out in public; capitalized “Hawking” often refers to Stephen Hawking.","zh":"“hawking”常指沿街叫卖、兜售；大写“Hawking”常指物理学家史蒂芬·霍金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of selling goods by calling out in public places; peddling","zh":"沿街叫卖；兜售（在公共场所大声招徕顾客）"},"examples":[{"en":"Street vendors were hawking snacks outside the stadium.","zh":"体育场外有小贩在沿街叫卖零食。"},{"en":"The city banned hawking near the subway entrances.","zh":"这座城市禁止在地铁入口附近沿街叫卖。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) the surname of Stephen Hawking, a famous British theoretical physicist and author","zh":"（常大写）霍金（Stephen Hawking），著名英国理论物理学家与科普作家"},"examples":[{"en":"Hawking wrote A Brief History of Time.","zh":"霍金写了《时间简史》。"},{"en":"Many people know Hawking for his work on black holes.","zh":"很多人因为他对黑洞的研究而了解霍金。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “hawk”: to sell by calling out; to peddle","zh":"“hawk”的现在分词：叫卖；兜售"},"examples":[{"en":"He was hawking umbrellas when it started to rain.","zh":"一下雨他就开始叫卖雨伞。"},{"en":"They stood on the corner hawking cheap souvenirs.","zh":"他们站在街角兜售便宜的纪念品。"}]}],"synonyms":["peddling","street-selling","vending","pitching"],"phonetic":"/ˈhɔkɪŋ/","extraExplanation":["“hawk / hawking”在这里指“叫卖、兜售”，常见于街头小贩的语境；不要和“hawk（鹰）”这个名词含义混淆。","作为人名时常写作“Hawking”（大写），最常指Stephen Hawking。他的名字也常出现在科普、黑洞、宇宙学等语境中。"]}
{"word":"hawkings","summary":{"en":"“Hawking(s)” most often refers to Stephen Hawking; in lowercase, “hawkings” can mean repeated acts of street selling (peddling).","zh":"“Hawking(s)”最常指史蒂芬·霍金；若用小写，“hawkings”也可指多次的街头叫卖/兜售行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stephen Hawking (1942–2018), a British theoretical physicist known for work on black holes and for popular science writing such as *A Brief History of Time*.","zh":"史蒂芬·霍金（1942–2018），英国理论物理学家，以黑洞研究及科普著作《时间简史》等闻名。"},"examples":[{"en":"Stephen Hawking wrote *A Brief History of Time* for general readers.","zh":"史蒂芬·霍金写了面向大众读者的《时间简史》。"},{"en":"Hawking’s ideas helped many people become interested in cosmology.","zh":"霍金的观点帮助很多人对宇宙学产生兴趣。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) the plural of “hawking,” meaning acts of selling things by calling out in public; peddling.","zh":"（较少见）“hawking”的复数，指在公共场合大声叫卖、兜售的行为；叫卖。"},"examples":[{"en":"The report complained about hawkings outside the station.","zh":"报告抱怨车站外的叫卖兜售行为。"},{"en":"Local rules limit street hawkings in busy tourist areas.","zh":"当地规定限制在繁忙旅游区的街头叫卖。"}]}],"synonyms":["Stephen Hawking","peddling","street vending"],"phonetic":"ˈhɔkɪŋ","extraExplanation":["注意大小写：**Hawking**（首字母大写）通常指人名“霍金”；**hawking**（小写）更常见，意思是“叫卖/兜售”（如 *street hawking*）。你输入的 **hawkings** 多半是拼写或大小写造成的混淆，或表示“叫卖行为”的复数。"]}
{"word":"hawkins","summary":{"en":"Hawkins is most commonly an English surname; it can also be the name of a place or institution.","zh":"Hawkins 最常見是英文姓氏；也可作為某些地名或機構名稱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) in English-speaking countries","zh":"（英語國家常見的）姓氏：霍金斯"},"examples":[{"en":"My neighbor’s last name is Hawkins.","zh":"我鄰居的姓是霍金斯。"},{"en":"Dr. Hawkins will see you at 3 p.m.","zh":"霍金斯醫生會在下午三點見你。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for some towns, counties, schools, or landmarks (depending on the country/state)","zh":"地名：用於一些城鎮、郡、學校或地標的名稱（依不同國家/州而定）"},"examples":[{"en":"She grew up in Hawkins County.","zh":"她在霍金斯郡長大。"},{"en":"The game is set in the town of Hawkins.","zh":"這款遊戲/故事的背景設定在霍金斯鎮。"}]}],"phonetic":"/ˈhɔkɪnz/","extraExplanation":["「Hawkins」多數時候是姓氏，字尾 -s 常見於英文姓氏（有時表示“某人的家族/後代”一類的延伸）。","流行文化中你可能會看到「Hawkins」作為虛構地名，例如影集《Stranger Things》的故事發生在印第安納州的虛構小鎮 Hawkins。","也有歷史人物使用此姓氏，如英國航海家 Sir John Hawkins；文學作品中則有像《金銀島》主角 Jim Hawkins。注意不要和物理學家 Stephen Hawking（霍金）混淆：Hawking ≠ Hawkins。"]}
{"word":"hawkish","summary":{"en":"Hawkish means favoring a tough, aggressive approach—either in foreign policy or (in economics) higher rates to fight inflation.","zh":"hawkish 指“鹰派/强硬的”：政治上主张强硬对外；经济上倾向加息以抑制通胀。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring a strong, aggressive approach in politics or international relations (for example, supporting military action rather than negotiation).","zh":"（政治/国际关系中）主张强硬、好战的；倾向于使用军事或强制手段而非谈判。"},"examples":[{"en":"Some lawmakers took a hawkish stance on national security.","zh":"一些立法者在国家安全问题上采取了强硬立场。"},{"en":"Her hawkish comments worried people who wanted peaceful talks.","zh":"她的强硬言论让希望和平谈判的人感到担忧。"}]},{"partOfSpeech":"adj.","definition":{"en":"favoring higher interest rates to control inflation (used in economics and central banking).","zh":"（经济/央行语境）偏“鹰派”的：主张提高利率以抑制通货膨胀。"},"examples":[{"en":"The central bank sounded hawkish and hinted at more rate hikes.","zh":"央行措辞偏鹰派，暗示还可能继续加息。"},{"en":"Markets fell after a hawkish policy statement.","zh":"在一份偏鹰派的政策声明发布后，市场下跌。"}]}],"synonyms":["aggressive","hard-line","militant","tough","belligerent"],"phonetic":"/ˈhɔkɪʃ/","extraExplanation":["“hawkish”来自“hawk（鹰）”，在英语里“hawk（鹰派）”常比喻主张强硬、倾向使用武力或强制手段的人；相对词是“dovish（鸽派）”，强调温和、谈判与克制。","在金融新闻中，“hawkish”/“dovish”是非常常见的搭配：hawkish≈更可能加息、收紧政策；dovish≈更可能降息或维持宽松。"]}
{"word":"hawkishly","summary":{"en":"“Hawkishly” means ‘in a hawkish, hard-line way,’ especially about military/foreign policy or anti-inflation economic policy.","zh":"“hawkishly”意为“以鹰派、强硬的方式”，常用于形容在外交军事或反通胀经济政策上的强硬立场。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hawkish way; supporting aggressive or hard-line policies, especially in foreign policy or military matters.","zh":"以鹰派的方式；（尤指在外交或军事问题上）主张强硬、好战或更具攻击性的政策。"},"examples":[{"en":"Some lawmakers spoke hawkishly about increasing defense spending.","zh":"一些立法者以鹰派口吻谈到要增加国防开支。"},{"en":"He argued hawkishly for a stronger response to the attack.","zh":"他以强硬的立场主张对这次袭击作出更强烈的回应。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that favors strict control of inflation, often by raising interest rates (used in economic and central-bank contexts).","zh":"以偏向抑制通胀的方式（常指支持加息等紧缩政策，用于经济与央行语境）。"},"examples":[{"en":"The central bank sounded hawkishly optimistic about further rate hikes.","zh":"央行的表态偏鹰派，似乎倾向于进一步加息。"},{"en":"Markets moved after the chair spoke hawkishly on inflation.","zh":"主席就通胀发表偏鹰派的讲话后，市场出现波动。"}]}],"synonyms":["aggressively","hard-line","toughly","militantly","belligerently"],"phonetic":"/ˈhɔkɪʃli/","extraExplanation":["“hawkishly”来自“hawk”（鹰）这一隐喻：在政治中，hawk（鹰派）指主张强硬、支持军事行动的人；与之相对的是“dove”（鸽派），强调谈判与克制。","在财经新闻里，“hawkish”（鹰派）常指央行立场偏紧缩、倾向加息以压通胀；相对词是“dovish”（鸽派），更倾向降息或宽松以刺激增长。"]}
{"word":"hawkishness","summary":{"en":"Hawkishness means a strong, aggressive stance—often in foreign policy or in favor of higher interest rates to fight inflation.","zh":"Hawkishness 指“鹰派/强硬”的倾向：常用于外交军事上的强硬立场，或经济政策上偏向加息以对抗通胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tendency to favor aggressive or forceful policies, especially in politics, foreign affairs, or military action","zh":"（尤指政治、外交或军事方面的）鹰派倾向；主张强硬或好战的态度"},"examples":[{"en":"The candidate’s hawkishness on foreign policy appealed to some voters but worried others.","zh":"这位候选人在外交政策上的鹰派立场吸引了一些选民，但也让另一些人担心。"},{"en":"Rising tensions increased hawkishness in the government’s public statements.","zh":"紧张局势升温，使政府的公开表态更加强硬。"}]},{"partOfSpeech":"n.","definition":{"en":"a preference for higher interest rates and tighter control of inflation in economic policy (contrasted with “dovishness”)","zh":"（经济政策中）偏向加息与更强力控制通胀的立场（与“鸽派 d ovishness”相对）"},"examples":[{"en":"The central bank’s hawkishness surprised markets and strengthened the currency.","zh":"央行的鹰派立场让市场意外，并推动本币走强。"},{"en":"Analysts debated whether the policy statement signaled more hawkishness next month.","zh":"分析师们讨论这份政策声明是否暗示下个月会更偏鹰派。"}]}],"synonyms":["aggressiveness","hard-line stance","militancy","toughness","belligerence","hard-liner attitude"],"phonetic":"/ˈhɔkɪʃnəs/","extraExplanation":["“hawkishness”来自“hawk（鹰）”，在英语政治隐喻里，鹰象征强硬、主战；相对的“dove（鸽子）”象征温和、主和，因此常见搭配是 hawkish vs. dovish。","在新闻语境里它常用来描述“立场/语气”而不一定指真实的军事行动：例如 hawkish rhetoric（强硬言辞）、hawkish stance（鹰派立场）。","经济新闻中，“hawkish”通常与加息、收紧货币政策、强调抗通胀相关；“dovish”则常与降息或宽松、强调增长与就业相关。"]}
{"word":"hawklike","summary":{"en":"Hawklike means very sharp-eyed and intensely watchful, like a hawk.","zh":"hawklike 指“像鹰一样目光锐利、非常警觉”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having very sharp eyesight or intense, watchful attention; like a hawk.","zh":"目光锐利的；像鹰一样警觉、专注的。"},"examples":[{"en":"She watched the crowd with hawklike focus.","zh":"她以鹰一般的专注注视着人群。"},{"en":"The teacher kept a hawklike eye on the exam room.","zh":"老师用锐利的目光盯着考场。"}]}],"synonyms":["keen-eyed","sharp-eyed","watchful","observant","vigilant"],"phonetic":"/ˈhɔkˌlaɪk/","extraExplanation":["“hawklike”是由“hawk（鹰）+ like（像……一样）”构成的形容词，常用来形容人观察细致、警觉性高。语气通常偏中性到略带强调，有时也会暗示“盯得很紧”。","常见搭配：a hawklike eye / hawklike gaze（锐利的目光）；watch/observe/scan with hawklike attention（以高度警觉观察）。"]}
{"word":"hawkmoth","summary":{"en":"A hawkmoth is a large, fast-flying moth that often hovers at flowers to drink nectar, especially at dusk or night.","zh":"hawkmoth 指“天蛾”，一种体型较大、飞行快，常在花前悬停吸蜜的蛾类，多在黄昏或夜间活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of large moth that often hovers like a hummingbird while drinking nectar from flowers, usually active at night or at dusk","zh":"天蛾；一种体型较大的蛾类，常在花前像蜂鸟一样悬停吸食花蜜，多在黄昏或夜间活动"},"examples":[{"en":"A hawkmoth hovered in front of the jasmine flowers at dusk.","zh":"黄昏时，一只天蛾在茉莉花前悬停。"},{"en":"Some hawkmoths can fly very fast and have long tongues for reaching deep nectar.","zh":"有些天蛾飞得很快，而且口器（“舌”）很长，能伸进花朵深处吸蜜。"}]}],"synonyms":["sphinx moth"],"phonetic":"/ˈhɔkˌmɑθ/","extraExplanation":["“hawkmoth”因其飞行速度快、体型较大、翅膀尖长，给人“像鹰（hawk）一样有力”的印象而得名，并不表示它和鹰有任何亲缘关系。","天蛾是重要的传粉昆虫；在科普与文学描写中常用来营造“黄昏、夜色、花香”的氛围。"]}
{"word":"hawkmoths","summary":{"en":"Hawkmoths are large moths known for fast, strong flight and hovering at flowers to drink nectar.","zh":"Hawkmoths 指“天蛾”：以飞行迅速有力、能在花前悬停吸蜜而著名的大型蛾类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"large, fast-flying moths (plural of hawkmoth), often seen hovering at flowers to drink nectar; many have long, narrow wings and a strong, “bird-like” flight","zh":"天蛾（hawkmoth 的复数）：一种体型较大、飞行速度快的蛾类，常在花前悬停吸食花蜜；通常翅膀细长、飞行有点像鸟"},"examples":[{"en":"Hawkmoths hover in front of flowers like tiny hummingbirds.","zh":"天蛾会像小蜂鸟一样在花前悬停。"},{"en":"We spotted hawkmoths at dusk near the jasmine bushes.","zh":"黄昏时我们在茉莉花丛附近看到了天蛾。"},{"en":"Some plants are pollinated mainly by hawkmoths at night.","zh":"有些植物主要在夜间由天蛾传粉。"}]}],"synonyms":["sphinx moths","hummingbird moths (common name for some species)"],"phonetic":"/ˈhɔkˌmɑθs/","extraExplanation":["“hawkmoth”常指天蛾科（Sphingidae）的蛾类；英语里也常叫“sphinx moth”。它们飞行力量强、可悬停取食花蜜，因此在自然纪录片里经常被拿来和蜂鸟类比。","很多天蛾在黄昏或夜间活动；园艺与生态语境中，提到夜间传粉（night pollination）时常会出现 hawkmoths。"]}
{"word":"hawknose","summary":{"en":"A hawknose is a sharply hooked nose; it can also describe someone who has one.","zh":"hawknose 指“鹰钩鼻”，也可用来形容或指代长着鹰钩鼻的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sharply curved, hooked nose (like a hawk’s beak); also, a person who has this kind of nose","zh":"鹰钩鼻；（也可指）长着鹰钩鼻的人"},"examples":[{"en":"The detective was easy to spot because of his hawknose and dark coat.","zh":"那位侦探很容易认出来，因为他有鹰钩鼻，还穿着深色外套。"},{"en":"In the old portrait, the king’s hawknose gives him a stern look.","zh":"在那幅老肖像里，国王的鹰钩鼻让他看起来很严厉。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a sharply curved, hooked nose; hawk-nosed","zh":"长着鹰钩鼻的；鹰钩鼻状的"},"examples":[{"en":"A hawknose profile is common in many families.","zh":"鹰钩鼻的侧脸轮廓在许多家族中很常见。"},{"en":"The novel describes a hawknose merchant with quick eyes.","zh":"小说描写了一个鹰钩鼻、眼神机灵的商人。"}]}],"synonyms":["hooked nose","aquiline nose","hawk-nosed"],"phonetic":"/ˈhɔkˌnoʊz/","extraExplanation":["“hawknose”由“hawk（鹰）+ nose（鼻子）”组成，形象地把鼻梁突出、鼻尖下弯的形状比作鹰喙。写作中更常见的形式是形容词“hawk-nosed”，用于描写人物外貌。使用这类外貌词时要注意语境：在文学描写里多为中性刻画，但在现实交流中可能带有评价色彩，建议避免用来直接称呼他人。"]}
{"word":"hawknosed","summary":{"en":"Hawk-nosed means having a long nose that curves downward, like a hawk’s beak.","zh":"Hawk-nosed 指“鹰钩鼻的”，鼻子较长且向下弯，像鹰嘴。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a nose that is long and curved downward, like a hawk’s beak; aquiline.","zh":"（鼻子）鹰钩的；鼻梁高、鼻尖向下弯的（如鹰嘴），即“鹰钩鼻”的。"},"examples":[{"en":"The detective was described as hawk-nosed and sharp-eyed.","zh":"那位侦探被描写为鹰钩鼻、目光锐利。"},{"en":"A hawk-nosed man stood at the doorway, watching quietly.","zh":"一个鹰钩鼻的男人站在门口，静静地看着。"}]}],"synonyms":["aquiline","hook-nosed","beak-nosed"],"phonetic":"ˈhɔkˌnoʊzd","extraExplanation":["“hawk-nosed”常用连字符（hawk-nosed），也可写作“hawknosed”。它多用于文学或描写性文字来刻画外貌与气质（常暗示精明、严厉或具有攻击性），但在谈论真实人物时可能带有评判色彩；更中性、正式的词可用“aquiline”。"]}
{"word":"hawknoses","summary":{"en":"“Hawknoses” means noses with a high bridge and a hooked, hawk-like curve (plural).","zh":"“hawknoses”指“鹰钩鼻”（复数）：鼻梁较高、鼻尖下弯呈钩状的鼻型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hawknose: a nose with a high bridge and a curved, hooked shape (often compared to a hawk’s beak).","zh":"hawknose（鹰钩鼻）的复数：鼻梁较高、鼻尖向下弯曲呈钩状的鼻型（常被比作鹰的喙）。"},"examples":[{"en":"The portrait shows a man with sharp cheekbones and a hawknose.","zh":"这幅肖像画中的男子颧骨分明，鼻子是鹰钩鼻。"},{"en":"In older novels, characters with hawknoses are sometimes described as stern or intense.","zh":"在一些较老的小说里，鹰钩鼻的角色有时会被描写得严厉或强势。"}]}],"synonyms":["hooked noses","aquiline noses","arched noses","prominent noses"],"phonetic":"ˈhɔkˌnoʊz","extraExplanation":["“hawknose”是由“hawk（鹰）+ nose（鼻子）”构成的外貌描写词。现代英语交流中，评价他人鼻型可能涉及外貌敏感话题；在描述陌生人或群体时，建议使用更中性、客观的说法（如“a prominent/arched nose 鼻梁突出/弧形鼻梁”），避免带有负面刻板印象。"]}
{"word":"hawknut","summary":{"en":"A rare word meaning the nut-like fruit/seed of the hawthorn (a haw).","zh":"较少见的词，指山楂树的坚果状小果实/种子（即 haw）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, nut-like fruit (or seed) of the hawthorn tree; a haw.","zh":"山楂树（hawthorn）的坚果状小果实/种子；也可称 haw（山楂果）。"},"examples":[{"en":"In late autumn, the hedgerows were dotted with red haws and a few dry hawknuts.","zh":"深秋时，树篱上点缀着红色的山楂果，还有一些干燥的山楂“坚果”。"},{"en":"Some older nature guides mention hawknuts as food for birds.","zh":"一些较老的自然指南会提到，hawknut 是鸟类的食物之一。"}]}],"synonyms":["haw","hawthorn fruit","hawthorn berry"],"phonetic":"/ˈhɔkˌnʌt/","extraExplanation":["“hawknut”是比较少见、偏文学或旧式的词，常见于描写乡野、树篱（hedgerow）与野生植物的语境中。现代英语里更常说“haw”或“hawthorn berry/fruit”。"]}
{"word":"hawks","summary":{"en":"“Hawks” most commonly means the plural of “hawk” (birds of prey). It can also refer to political “hawks” (hardliners) or the verb “hawks” meaning sells aggressively.","zh":"“hawks”最常见是“hawk（鹰/隼等猛禽）”的复数；也可指政治上的“鹰派”；还可作动词第三人称单数，表示“强力兜售/推销”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hawk: a bird of prey with sharp eyesight and claws.","zh":"hawk（鹰、隼等猛禽）的复数：一种猛禽，视力敏锐，有利爪。"},"examples":[{"en":"Hawks circled above the field looking for small animals.","zh":"几只鹰在田野上空盘旋，寻找小动物。"},{"en":"You can sometimes see hawks near the edge of the forest.","zh":"在森林边缘有时能看到鹰。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of hawk: to sell or promote something aggressively (often by calling out to people).","zh":"hawk 的第三人称单数：大声兜售或强力推销（常指沿街叫卖）。"},"examples":[{"en":"He hawks snacks outside the stadium after games.","zh":"比赛结束后，他在体育场外兜售零食。"},{"en":"The vendor hawks cheap souvenirs to tourists.","zh":"小贩向游客强力推销便宜的纪念品。"}]},{"partOfSpeech":"n.","definition":{"en":"In politics, people who favor a strong military response or war (the opposite of doves).","zh":"（政治语境）主张强硬军事手段或战争的人（与 doves “鸽派” 相对）。"},"examples":[{"en":"Some hawks argued for a tougher policy toward the enemy.","zh":"一些鹰派主张对敌方采取更强硬的政策。"},{"en":"The debate split the party into hawks and doves.","zh":"这场辩论使该党分成鹰派和鸽派。"}]}],"synonyms":["birds of prey","raptors","hardliners","militants","peddles","pushes","vendors"],"phonetic":"/hɔks/","extraExplanation":["“hawk（鹰派）/ dove（鸽派）”是英语里很常见的政治隐喻：hawk 强调强硬与武力威慑，dove 强调谈判与和平。","动词 hawk（兜售）常带有“吆喝叫卖、推销很用力”的感觉；在广告或社交媒体语境里也可指“强推某产品/观点”。"]}
{"word":"hawksbeak","summary":{"en":"Hawksbeak means a hawk’s hooked beak, or anything shaped like one; less commonly it can refer to the beaklike mouth of a hawksbill sea turtle.","zh":"hawksbeak 指鹰的钩状喙或形似鹰喙的结构；较少见时也可指玳瑁（hawksbill sea turtle）那种鸟喙般的口部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the curved, sharply hooked beak of a hawk (or something that looks like it).","zh":"鹰（或类似猛禽）弯曲、尖锐的钩状喙；也指外形像鹰喙的东西。"},"examples":[{"en":"The raptor’s hawksbeak is designed for tearing meat.","zh":"猛禽的鹰喙天生适合撕裂肉类。"},{"en":"The old handle ended in a metal hook shaped like a hawksbeak.","zh":"那把旧把手的末端有个金属钩，形状像鹰喙。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the beaklike mouth of a hawksbill sea turtle.","zh":"（较少见用法）玳瑁（hawksbill sea turtle）那种鸟喙般的口部。"},"examples":[{"en":"The hawksbill turtle has a narrow hawksbeak for feeding in coral reefs.","zh":"玳瑁有狭长的“鹰喙”，便于在珊瑚礁里觅食。"}]}],"synonyms":["hawk’s-beak","hooked beak","curved beak"],"phonetic":"/ˈhɔksˌbiːk/","extraExplanation":["“hawksbeak”是由hawk（鹰）+ beak（喙）组成的复合词。更常见的拼写形式是带连字符的“hawk’s-beak”，在不同词典/专业领域里也可能写作两词。","如果你想表达海龟物种名称，英语里更常用的是“hawksbill (sea) turtle（玳瑁）”，而不是“hawksbeak”。"]}
{"word":"hawksbeard","summary":{"en":"a wild yellow-flowered plant similar to a dandelion","zh":"一种类似蒲公英的黄色野花（菊科）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Any of several wild plants in the daisy family (especially the genus *Crepis*) with yellow, dandelion-like flowers; often found in fields, roadsides, and open ground.","zh":"一种菊科野生植物（尤指还阳参属 *Crepis*），常开黄色、似蒲公英的花；多见于田野、路边等开阔地。"},"examples":[{"en":"Hawksbeard grows easily in disturbed soil along roadsides.","zh":"路边被翻动过的土壤里很容易长出hawksbeard。"},{"en":"At a glance, hawksbeard can look like a small dandelion.","zh":"乍一看，hawksbeard 很像小型蒲公英。"}]}],"synonyms":["crepis","hawk's-beard"],"phonetic":"/ˈhɔksˌbɪrd/","extraExplanation":["它在英语里属于“民间俗名”（common name）：不同地区可能把几种相似的黄花菊科植物都叫 hawksbeard。做自然观察或查资料时，最好结合拉丁学名（常见为 *Crepis*）。","外形上与蒲公英相近：黄色舌状花、成熟后可能形成带绒毛的种子“球”。但叶形、分枝花序等细节常不同。"],"etymology":"由 hawk（鹰）+ beard（胡须）组成的民间植物名。beard 指花后带“毛”的冠毛（像小胡子）；hawk 多半来自古老的拟人化/传说式命名，而非真与鹰直接相关。","mnemonic":["拆开记：hawk（鹰）+ beard（胡子）→ 想象“鹰下巴长胡子”，对应花后种子带毛像小胡子。"]}
{"word":"hawksbill","summary":{"en":"A hawksbill is a critically endangered sea turtle with a hawk-like beak and a patterned shell.","zh":"hawksbill 指“玳瑁”，一种喙似鹰、背甲有花纹且极度濒危的海龟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sea turtle with a narrow, hooked beak and a beautifully patterned shell; it lives mainly in warm oceans and is critically endangered","zh":"玳瑁；一种喙部细长呈钩状、背甲花纹美丽的海龟，主要生活在温暖海域，属极度濒危物种"},"examples":[{"en":"The hawksbill feeds on sponges around coral reefs.","zh":"玳瑁常在珊瑚礁附近以海绵为食。"},{"en":"Many countries protect the hawksbill because its population has dropped sharply.","zh":"许多国家保护玳瑁，因为其数量已大幅下降。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to this turtle (often used in conservation or biology contexts)","zh":"与玳瑁（这种海龟）有关的（多用于生物学或保育语境）"},"examples":[{"en":"The team launched a hawksbill conservation program on the island.","zh":"团队在岛上启动了玳瑁保育项目。"}]}],"synonyms":["hawksbill turtle","Eretmochelys imbricata"],"phonetic":"/ˈhɔksˌbɪl/","extraExplanation":["“hawksbill”字面意思是“像鹰的喙一样的嘴”，指这种海龟细长、弯钩状的口部。","玳瑁背甲（英语也常说 hawksbill shell 或 tortoiseshell）过去曾被用来制作梳子、眼镜框和装饰品；如今许多地区已禁止相关贸易，因为这会伤害并加速其灭绝。"]}
{"word":"hawkshaw","summary":{"en":"Hawkshaw means a (usually private) detective, especially a watchful, clue-spotting one.","zh":"hawkshaw 指（多为私家）侦探，尤指很警觉、善于发现线索的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a detective (often a private detective), especially one who seems watchful or clever at noticing clues","zh":"侦探（常指私家侦探），尤指很警觉、善于察觉线索的人"},"examples":[{"en":"The reporter hired a hawkshaw to find out who was leaking information.","zh":"那位记者雇了一名私家侦探来查清是谁在泄露消息。"},{"en":"He acted like a hawkshaw, studying everyone’s movements at the party.","zh":"他像个侦探一样，盯着派对上每个人的举动。"}]}],"synonyms":["detective","sleuth","private eye","private investigator","gumshoe"],"phonetic":"/ˈhɔkˌʃɔ/","extraExplanation":["“hawkshaw”来自19世纪英国戏剧《The Ticket-of-Leave Man》（《假释犯》）中的侦探角色“Hawkshaw”。这个人物很受欢迎，名字后来就被用来泛指“侦探/私家侦探”。","该词带一点旧式、文学或幽默的味道；日常更常用 detective / private investigator / private eye。"]}
{"word":"hawkshaws","summary":{"en":"“Hawkshaws” means detectives (plural of hawkshaw), often in an old-fashioned or literary tone.","zh":"“hawkshaws”指“侦探们”（hawkshaw 的复数），语气常偏旧式或文学化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of hawkshaw) a detective; someone who searches for information in a careful, investigative way.","zh":"（hawkshaw 的复数）侦探；（比喻）善于细查、追踪线索的人。"},"examples":[{"en":"The police brought in a few experienced hawkshaws to work the case.","zh":"警方请来几位经验丰富的侦探来调查这起案件。"},{"en":"She’s a real hawkshaw when it comes to finding mistakes in contracts.","zh":"她在找合同漏洞方面简直像个侦探。"}]}],"synonyms":["detectives","private investigators","sleuths","gumshoes (informal)"],"phonetic":"/ˈhɔkˌʃɔ/","extraExplanation":["“hawkshaw”原本是19世纪英国戏剧中的侦探角色名（Detective Hawkshaw），后来在英语里被当作普通名词，表示“侦探、私家侦探”。现在比较偏旧式或带点文学/幽默色彩，日常更常说 detective / private investigator (PI)。","复数 hawkshaws 多见于叙述或小说语境：用来泛指“几位侦探/侦查员”。"]}
{"word":"hawkweed","summary":{"en":"Hawkweed is a wildflower (often treated as a weed) with yellow or orange daisy-like blooms.","zh":"hawkweed 指一种开黄/橙色、像雏菊的野花，常被视为杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild plant with yellow (sometimes orange) daisy-like flowers; many types are considered weeds in lawns and fields","zh":"一种野生植物，开黄色（有时橙色）类似雏菊的花；许多品种在草坪和田野里被视为杂草"},"examples":[{"en":"Hawkweed has spread across the meadow and is hard to remove.","zh":"鹰草在草地里蔓延开来，很难清除。"},{"en":"The hikers noticed bright yellow hawkweed along the trail.","zh":"徒步者在小路旁注意到鲜黄色的鹰草。"}]}],"synonyms":["hieracium","orange hawkweed"],"phonetic":"/ˈhɔkwiːd/","extraExplanation":["“hawkweed”常指菊科的“山柳菊属”（Hieracium）植物；在北美和欧洲，一些外来种会快速扩散，被当作入侵杂草管理。","词名由“hawk（鹰）+ weed（草）”构成，属于传统俗名；并不是说它只和鹰有关，而是民间对植物外形或传说的命名方式。不同地区“hawkweed”可能指不同但相近的种类。"]}
{"word":"hawkweeds","summary":{"en":"Hawkweeds are wild daisy-like plants (genus *Hieracium*), often seen as weeds and sometimes invasive.","zh":"Hawkweeds 指猫儿菊属的野生菊状花植物，常被当作杂草，在部分地区可能具有入侵性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hawkweeds: plants in the genus *Hieracium* (family Asteraceae), with yellow (sometimes orange) daisy-like flowers, often growing wild in fields, roadsides, and lawns; in some areas they are considered invasive weeds.","zh":"hawkweeds：猫儿菊属（*Hieracium*，菊科）植物，常见黄色（有时偏橙色）菊状花，常生于路边、草地、田野等野外环境；在一些地区被视为入侵性杂草。"},"examples":[{"en":"Hawkweeds spread quickly along the roadside after the grass was cut.","zh":"割草后，路边的hawkweeds很快就蔓延开来。"},{"en":"In late spring, the hillside was dotted with yellow hawkweeds.","zh":"春末时，山坡上点缀着一片片黄色的hawkweeds。"},{"en":"The gardener pulled up the hawkweeds before they could seed.","zh":"园丁在hawkweeds结籽前就把它们拔掉了。"}]}],"synonyms":["hawkweed","Hieracium","wildflower (general)","weed (general)"],"phonetic":"/ˈhɔkˌwid/","extraExplanation":["“hawkweed”由“hawk（鹰）+ weed（杂草）”组成。民间曾有说法认为鹰会用这种植物来“清亮视力”，因此得名；这属于传统传说，并非现代科学结论。","在北美和欧洲的一些地区，某些hawkweed种（如橙色花的 orange hawkweed）可能被视为入侵植物，会与本地草本植物竞争；管理方式通常包括拔除、控制结籽与扩散。"]}
{"word":"hawkwise","summary":{"en":"Hawkwise means “like a hawk,” especially in a sharp-eyed, watchful, or striking way.","zh":"hawkwise 表示“像鹰一样”，尤指目光锐利、警觉或猛扑的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the manner of a hawk; like a hawk (especially in how it looks, watches, or strikes).","zh":"像鹰一样地；以鹰的方式（尤指目光锐利、警觉或猛扑的方式）。"},"examples":[{"en":"The cat sat on the fence, staring hawkwise at the birds.","zh":"猫蹲在篱笆上，像鹰一样盯着那些鸟。"},{"en":"He scanned the crowd hawkwise, noticing small movements other people missed.","zh":"他像鹰一样扫视人群，注意到别人忽略的小动作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Hawk-like; having the qualities of a hawk (sharp-eyed, predatory, or vigilant).","zh":"鹰一般的；具有鹰的特征（目光锐利、带有掠食性或高度警觉）。"},"examples":[{"en":"With a hawkwise gaze, she caught the typo immediately.","zh":"她目光如鹰般锐利，立刻发现了那个错别字。"},{"en":"The detective’s hawkwise attention made the suspect nervous.","zh":"侦探鹰一般的专注让嫌疑人紧张起来。"}]}],"synonyms":["hawk-like","keen-eyed","watchfully","vigilantly"],"phonetic":"/ˈhɔkˌwaɪz/","extraExplanation":["“-wise”常见于表示“以……方式/在……方面”的构词（如 clockwise 顺时针、likewise 同样地）。hawkwise 属于较少见、偏文学或描写性的用法，读到时理解为“像鹰一样（观察/行动）”即可。","注意 hawk 还有政治语境：a hawk（主战派）/ hawkish（强硬的）。但 hawkwise 通常指“像鹰的样子或方式”，不一定带政治含义。"]}
{"word":"hawky","summary":{"en":"Hawky means hawk-like—sharp-eyed and watchful; it can also mean “hawkish,” though that form is much more common.","zh":"hawky 指“像鹰一样”——目光敏锐、警觉；也可表示“鹰派/强硬”，但更常用的是 hawkish。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a hawk; sharp-eyed, watchful, or seeming ready to attack.","zh":"像鹰一样的；目光敏锐、警觉的，或带有攻击性的。"},"examples":[{"en":"The security guard gave me a hawky look as I walked in.","zh":"我走进去时，保安用一种鹰一样警觉的眼神盯着我。"},{"en":"Her hawky eyes noticed the small mistake right away.","zh":"她敏锐的眼睛立刻发现了那个小错误。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Favoring strict control, especially about government policy (often said as “hawkish” instead).","zh":"（较少见）主张强硬立场或严格控制（尤指政府政策；更常用 hawkish）。"},"examples":[{"en":"Some commentators described the speech as hawky on national security.","zh":"一些评论员形容那次演讲在国家安全问题上立场强硬。"},{"en":"In economics, people usually say “hawkish,” not “hawky.”","zh":"在经济领域，人们通常说“hawkish”，而不是“hawky”。"}]}],"synonyms":["hawk-like","sharp-eyed","watchful","keen-eyed","hawkish"],"phonetic":"/ˈhɔki/","extraExplanation":["“hawky”是由“hawk（鹰）”衍生出来的形容词，但在现代英语里不算常见；描述“强硬立场/鹰派”时，标准、更常用的词是“hawkish”（如：a hawkish politician；the Fed sounded hawkish）。","在日常语境里，“hawky look/eyes”偏口语，表达“盯得很紧、非常警觉”的感觉；如果想更自然，也可以用“hawk-like”或“sharp-eyed”。"]}
{"word":"hawm","summary":{"en":"“hawm” is a dialect spelling meaning “home.”","zh":"“hawm”是方言拼写，意思是“home（家）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, Scotland/Northern England) Home; the place where you live or feel you belong.","zh":"（方言，苏格兰/英格兰北部）家；你居住或觉得归属的地方。"},"examples":[{"en":"After years away, she finally went back hawm.","zh":"离开多年后，她终于回家了。"},{"en":"Hawm is where I feel safest.","zh":"家是我觉得最安全的地方。"}]}],"synonyms":["home"],"phonetic":"/hɑm/","extraExplanation":["“hawm”不是现代标准英语里的常用拼写，更常见的是“home”。它多见于苏格兰英语（Scots）或英格兰北部的方言/文学化拼写，用来呈现口音与地域风格。","如果你原本想查的是“harm”（伤害）或“ham”（火腿/业余无线电爱好者），告诉我你的语境（句子）我可以帮你确认。"]}
{"word":"hawok","summary":{"en":"Havoc means great disorder or destruction, often used in “wreak havoc.”","zh":"Havoc 指“严重混乱或破坏”，常用于短语“wreak havoc（造成大乱/严重破坏）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"widespread disorder, chaos, or destructive confusion (often in the phrase “wreak havoc”)","zh":"严重的混乱、失序或破坏（常见搭配：wreak havoc “造成严重破坏/大乱”）"},"examples":[{"en":"The storm caused havoc across the coast, knocking out power lines.","zh":"暴风雨席卷海岸，造成严重破坏，电线被刮断停电。"},{"en":"The new rule wreaked havoc on our schedule.","zh":"新规定把我们的日程搅得一团乱。"}]},{"partOfSpeech":"v.","definition":{"en":"to cause great damage or chaos (less common; more common: “wreak havoc”)","zh":"造成巨大破坏或混乱（较少见；更常用：wreak havoc）"},"examples":[{"en":"Heavy rain can havoc weak roads and bridges.","zh":"暴雨可能会严重破坏脆弱的道路和桥梁。"}]}],"synonyms":["chaos","disorder","destruction","mayhem","devastation"],"phonetic":"/ˈhævək/","extraExplanation":["你输入的“hawok”通常是“havoc”的常见拼写错误。标准拼写是 **havoc**。","固定搭配 **wreak havoc** 很常见：wreak 表示“造成/引发（破坏）”，整体意思就是“造成严重破坏或混乱”。"]}
{"word":"haworthia","summary":{"en":"Haworthia is a genus of small, easy-care succulent houseplants with thick leaves.","zh":"Haworthia 指十二卷属的小型多肉植物，叶厚、好养，常见室内盆栽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small succulent plant (genus Haworthia) with thick, often striped or translucent leaves, commonly grown as a houseplant.","zh":"一种小型多肉植物（十二卷属 Haworthia），叶片肥厚，常带条纹或半透明“窗”，常作为室内盆栽养护。"},"examples":[{"en":"I keep a haworthia on my desk because it needs very little water.","zh":"我在桌上养了一盆十二卷，因为它很耐旱、浇水不用太勤。"},{"en":"Her haworthia has white stripes on the leaves, like a tiny zebra.","zh":"她的十二卷叶子上有白色条纹，看起来像迷你斑马。"},{"en":"Haworthias usually prefer bright, indirect light.","zh":"十二卷通常更喜欢明亮的散射光。"}]}],"synonyms":["zebra haworthia","haworthia succulent"],"phonetic":"/həˈwɔrθiə/","extraExplanation":["“Haworthia（十二卷属）”原产于南非等干旱地区，属于多肉植物的一类。家养时常见要点：少浇水、排水良好的土、避免暴晒但要有明亮散射光。","词源：以英国博物学家 Adrian Hardy Haworth 命名（植物学命名中常见用人名纪念）。常见种如 zebra haworthia（条纹十二卷，Haworthia attenuata）。"]}
{"word":"Hawran","summary":{"en":"a historic Levantine region in southern Syria and northern Jordan","zh":"叙利亚南部与约旦北部的历史地理区域"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a historical region in southern Syria and northern Jordan, known for its fertile volcanic plains and important ancient towns","zh":"叙利亚南部与约旦北部一带的历史地区，以肥沃的火山平原与多处古城镇闻名"},"examples":[{"en":"Wheat from the Hawran plain was once a major food supply for nearby cities.","zh":"霍兰平原的小麦曾是周边城市的重要粮食来源。"},{"en":"Several Roman-era ruins can be found across the Hawran region.","zh":"在霍兰地区各处都能看到罗马时期的遗迹。"}]}],"synonyms":["Hauran"],"phonetic":"hɔˈrɑn","extraExplanation":["地理与文化背景：Hawran（常写作 Hauran）多指叙利亚南部的达拉省（Daraa）及其周边，并可延伸到约旦北部。这里有火山形成的黑色玄武岩土壤，农业条件好，因此在古代与中世纪常被视为“粮仓”之一。","语言提示：在英语资料里，这个地名可能出现多种拼写（Hawran/Hauran/Houran），通常指同一地区；阅读历史或考古文本时尤其常见。"],"etymology":"源自阿拉伯语“Ḥawrān”（حوران），指黎凡特地区（约当河以东一带）的一片传统地理区域；英语中也常见拼写为“Hauran”。","mnemonic":["联想“haw-”≈“好（hǎo）”的开头：『好耕作的地方』——霍兰以肥沃平原出名。","把它记成“黑（H）+ 火山（volcanic）土壤的区域”：Hawran 的玄武岩地貌很有代表性。"]}
{"word":"haws","summary":{"en":"“Haws” usually means hawthorn berries; rarely, it can be the verb form meaning “hesitates/speaks with pauses.”","zh":"“haws”通常指山楂（刺山楂）的果实；很少情况下也可作动词，表示“犹豫、吞吞吐吐”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the small red fruits (berries) of the hawthorn tree","zh":"山楂树（刺山楂）的果实；山楂（果）"},"examples":[{"en":"In autumn, the hedges are full of haws and rose hips.","zh":"到了秋天，树篱上满是山楂果和玫瑰果。"},{"en":"Birds eat haws when other food is scarce.","zh":"当其他食物稀少时，鸟会吃山楂果。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) third-person singular of “haw”: to hesitate or speak with pauses (as in “hem and haw”)","zh":"（罕见）“haw”的第三人称单数：犹豫、说话吞吞吐吐（如 hem and haw）"},"examples":[{"en":"He haws and hems before giving an answer.","zh":"他在回答前犹犹豫豫、吞吞吐吐。"},{"en":"Don’t just haw—tell us what you decided.","zh":"别再犹豫了——说说你决定了什么。"}]}],"synonyms":["hawthorn berries","berries (of the hawthorn)","hesitates","waffles"],"phonetic":"/hɔz/","extraExplanation":["“haws”最常见的用法是名词复数，指刺山楂（hawthorn）的果实。在英国乡野写作里很常见，常与“hedgerow（树篱）”“rose hips（玫瑰果）”一起出现，营造秋冬景象。","表示“犹豫”的动词“haw”通常出现在固定搭配“hem and haw”中；单独用“haw”或其第三人称“haws”比较少见。"]}
{"word":"hawse","summary":{"en":"A nautical word for the ship’s bow area (or openings) where the anchor chain/cable runs through.","zh":"航海用语：指船首锚链/锚索穿过的部位，或锚链孔本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the part of a ship’s bow (front) where the anchor cables/chains pass through; also refers to the hawseholes (the openings) themselves","zh":"（船首）锚链/锚索穿出的部位；也可指锚链孔（穿锚链的开口）"},"examples":[{"en":"Seawater was splashing in through the hawse during the storm.","zh":"暴风雨中海水从锚链孔处溅进来。"},{"en":"The crew checked the hawse to make sure the anchor chain wasn’t chafing.","zh":"船员检查船首锚链孔周围，确保锚链没有磨损。"}]}],"synonyms":["hawsehole","bow (nautical context)","forepart (of a ship)"],"phonetic":"/hɔs/","extraExplanation":["“hawse”是典型的航海用语，日常英语里不常见，多出现在海事/航海小说、船舶操作说明或港口作业语境中。","常见相关表达：\n- “hawsehole(s)”：锚链孔（更具体、更常用）\n- “in the hawse”：（两船）船首相对很近、缆/链在船首处交叉或纠缠的状态（多用于航海描写）"]}
{"word":"hawsed","summary":{"en":"“Hawsed” is usually a misspelling of “housed” (provided with shelter; stored). Very rarely, it appears in nautical contexts related to “hawse.”","zh":"“hawsed”通常是“housed”的误拼（被安置/被收容/被存放）。极少数情况下，它可能出现在与航海词“hawse（船首锚链通道区域）”有关的语境中。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Commonly a misspelling) past tense/past participle of “house”: to provide a place to live, keep, or store something.","zh":"（常见拼写错误）通常指“housed”，即“house”的过去式/过去分词：为……提供住处；安置；存放。"},"examples":[{"en":"The museum housed the collection for over 50 years.","zh":"这家博物馆收藏（存放）这批藏品超过50年。"},{"en":"After the storm, the family was temporarily housed in a hotel.","zh":"暴风雨过后，这家人被临时安置在酒店里。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare, nautical) Sometimes seen in older ship-writing related to “hawse,” the area at the front of a ship where anchor cables pass; “hawsed” may describe something being arranged/passed at the hawse.","zh":"（罕见，航海用语）在较旧的航海文字中可能与“hawse”有关，指船首锚链穿过的区域；“hawsed”偶尔用来描述在该处穿过/布置的情况。"},"examples":[{"en":"In old nautical notes, you may see references to lines being led at the hawse.","zh":"在旧航海记录里，你可能会看到“绳缆从船首锚孔处引出”的说法。"}]}],"synonyms":["sheltered","accommodated","lodged","stored"],"phonetic":"/haʊzd/","extraExplanation":["“hawsed”在现代英语里几乎不作为标准拼写出现。大多数情况下，你想写的是“housed”（被安置/被收容/被存放）。\n\n“hawse”是航海词，读音接近“horse”去掉r音（美式约 /hɔs/），指船头锚链穿过的“锚孔/锚链通道”区域；相关词如“hawsehole（锚链孔）”。如果你是在读航海小说、历史文献或船舶说明，才可能遇到这种用法。"]}
{"word":"hawsehole","summary":{"en":"A hawsehole is a reinforced hole at the front of a ship for the anchor chain or rope to pass through.","zh":"hawsehole 指船首用于穿过锚链或锚绳的加固开口（锚链孔/锚索孔）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An opening (usually reinforced with metal) in the bow of a ship through which an anchor chain or rope passes.","zh":"（船首的）锚链孔；锚索孔：船首上通常加固（常为金属衬圈）的开口，用来让锚链或锚绳穿过。"},"examples":[{"en":"The anchor chain ran through the hawsehole as the crew lowered the anchor.","zh":"船员下锚时，锚链从锚链孔中滑出。"},{"en":"Seawater splashed in near the hawsehole during the storm.","zh":"暴风雨中，海水在锚链孔附近溅入船首。"}]}],"synonyms":["anchor hole","hawse opening"],"phonetic":"/ˈhɔzˌhoʊl/","extraExplanation":["这个词主要用于航海与船舶语境，常与 bow（船首）、anchor（锚）、anchor chain（锚链）一起出现。","拼写中 hawse- 来自航海用语，指船首锚具相关区域（如 hawsepipe、hawse fairlead）；不同船型结构略有差异，但核心含义都是“锚链通过的孔/通道”。"]}
{"word":"hawseholes","summary":{"en":"openings in a ship’s bow for the anchor chain or cable","zh":"船头供锚链/锚缆穿过的孔洞"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An opening in the bow (front) of a ship through which an anchor cable or chain passes.","zh":"（船头的）锚孔；让锚链/锚缆穿过的孔洞。"},"examples":[{"en":"The crew inspected the hawseholes for wear from the anchor chain.","zh":"船员检查锚孔是否因锚链摩擦而磨损。"},{"en":"Sea water splashed through the hawseholes during the storm.","zh":"暴风雨中海水从锚孔处飞溅进来。"}]}],"synonyms":["anchor hole","hawse hole","hawsepipe"],"phonetic":"/ˈhɔzˌhoʊlz/","extraExplanation":["常见搭配：through the hawsehole（穿过锚孔）、hawsepipe（锚链管/锚链通道，和 hawsehole 相关但不完全等同）。","该词多用于航海、造船、海事工程语境；日常英语里较少见。"],"etymology":"源自航海用语：hawse（船头/艏部，与锚缆相关的部位）+ hole（孔）。hawse 早期与“颈部”含义有关，后来在航海语境中专指船头锚具附近区域，因此 hawsehole 就是“船头锚链穿出的孔”。","mnemonic":["把它拆开记：hawse（和锚有关的船头区域）+ hole（孔）＝“锚链通过的孔”。","联想中文“锚孔”：看到 hole 就想到“孔”，剩下 hawse 就当作“船头锚区”的专用词根来记。"]}
{"word":"hawseman","summary":{"en":"A hawseman is a sailor who works at the ship’s bow, especially with anchors and cables.","zh":"hawseman 指在船头工作、主要负责锚与锚链等设备的水手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sailor who works at the bow of a ship, especially handling the anchor cable and gear near the hawseholes.","zh":"（船上的）艏部水手；通常负责在船头（锚孔附近）操作锚链、锚具等的水手。"},"examples":[{"en":"The hawseman prepared the anchor as the ship approached the harbor.","zh":"船靠近港口时，艏部水手准备好下锚。"},{"en":"In rough seas, the hawseman checked the anchor cable for chafing.","zh":"在风浪中，艏部水手检查锚链是否被磨损。"},{"en":"The officer called for a hawseman to report the anchor’s position.","zh":"军官叫艏部水手来报告锚的位置。"}]}],"synonyms":["bowman","deckhand (nautical context)","sailor (general)"],"phonetic":"ˈhɔzmən","extraExplanation":["“hawseman”是航海用语，来自“hawse”（船艏、锚孔一带；也指锚缆所在区域）+ “-man”（从事某项工作的人）。在传统帆船与早期蒸汽船时代，这个岗位很重要，因为抛锚、起锚都需要在船头近距离操作锚链，既费力也更危险。","相关词：hawsehole（锚孔）、hawser（粗缆/拖缆；有时也泛指粗绳）、at the hawse（在船艏一带工作）。"]}
{"word":"hawsepiece","summary":{"en":"A ship part that protects the opening where the anchor chain/rope passes through the bow.","zh":"船首锚链（或缆绳）通过的开孔处的保护部件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protective fitting or lining (often metal) around a ship’s hawsehole, where an anchor chain or rope passes through, to prevent chafing and damage.","zh":"（船舶）锚链孔/导缆孔的护口、衬套（通常为金属），用于让锚链或缆绳通过并防止磨损。"},"examples":[{"en":"The crew checked the hawsepiece for wear because the anchor chain had been grinding against it.","zh":"船员检查了hawsepiece的磨损情况，因为锚链一直在上面摩擦。"},{"en":"Salt water and heavy use can corrode the hawsepiece over time.","zh":"海水和高强度使用会让hawsepiece随着时间腐蚀。"}]}],"synonyms":["hawsehole lining","chafing ring","hawse fitting"],"phonetic":"/ˈhɔːzpiːs/","extraExplanation":["“hawse-”指船首处与锚相关的结构（如 hawsehole 锚链孔、hawsepipe 导链管）。“-piece”表示“部件/构件”。因此 hawsepiece 常见于航海与造船语境，日常英语里很少用到。","它的核心功能是“保护”：让锚链（或缆绳）在通过船体开孔时不直接磨伤船体边缘，也减少锚链自身的磨耗。不同船型可能把它做成衬套、护圈或与导链结构连成一体的金属件。"]}
{"word":"hawsepipe","summary":{"en":"A ship’s bow opening for the anchor chain; figuratively, a work-your-way-up path to becoming an officer (esp. in the U.S. Navy).","zh":"船首用于锚链通过的开口/管道；引申为靠基层实务一路晋升为军官的成长路径（尤指美国海军）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) A thick pipe or opening at the front (bow) of a ship that guides the anchor chain/cable from the deck down to the sea.","zh":"（航海）船首处用来引导锚链/锚索从甲板通向海中的粗管道或开口（锚链孔/锚链管）。"},"examples":[{"en":"The crew inspected the hawsepipe to make sure the anchor chain would run smoothly.","zh":"船员检查锚链管，确保锚链能顺畅放出。"},{"en":"Salt water can cause rust around the hawsepipe if it isn’t cleaned regularly.","zh":"如果不定期清理，海水可能会让锚链管周围生锈。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, especially U.S. Navy) A career path of becoming an officer by working up from an enlisted sailor rather than graduating from a naval academy (as in “come up through the hawsepipe”).","zh":"（引申义，尤指美国海军）指从士兵/水兵做起、靠实务经验一步步晋升为军官的路径（常见说法：come up through the hawsepipe）。"},"examples":[{"en":"He came up through the hawsepipe, starting as an enlisted sailor and later earning a commission.","zh":"他是“从锚链管里爬上来”的：先当水兵，后来获任军官。"},{"en":"The hawsepipe route is respected because it’s built on hands-on experience.","zh":"“锚链管路线”很受尊敬，因为它建立在一线实务经验之上。"}]}],"synonyms":["hawse hole","anchor pipe","(figurative) mustang route"],"phonetic":"/ˈhɔːzˌpaɪp/","extraExplanation":["“hawse”指船首附近与锚具相关的区域；“pipe”在航海语境里常指管道或通道，所以 hawsepipe 就是锚链通过的“通道/管”。","习语 come up through the hawsepipe 带有海军文化色彩：形象地把“从甲板下方锚链孔一路爬上来”比作不走军校精英路线、靠基层经验成长。"]}
{"word":"hawser","summary":{"en":"A thick rope or cable used for towing or mooring a ship.","zh":"用于拖船或系泊的粗缆绳/钢缆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick, strong rope or cable used on a ship to tow another vessel or to moor (tie up) a ship.","zh":"（船用）粗而结实的缆绳/钢缆，用于拖曳船只或系泊（把船固定在码头、浮标等处）。"},"examples":[{"en":"The tugboat passed a hawser to the cargo ship to pull it into the harbor.","zh":"拖船把一根拖缆递给货轮，把它拖进港口。"},{"en":"Sailors tightened the hawser to keep the ship steady at the dock.","zh":"水手把系泊缆绳拉紧，让船在码头边保持稳定。"}]}],"synonyms":["mooring line","towline","cable"],"phonetic":"/ˈhɔsɚ/","extraExplanation":["“Hawser”是典型的航海英语词汇，日常生活中不常见。更口语、更常用的说法通常是“a thick rope/cable”。","相关词汇对比：mooring line（系泊缆/系船绳，范围更广更常用）、towline/tow rope（拖缆/拖绳，偏拖曳用途）、cable（缆/钢缆，可泛指金属缆）。","在航海或海事文学里，hawser常用来营造“港口、风浪、拖船作业”的场景氛围。"]}
{"word":"hawser-laid","summary":{"en":"made as a strong three-strand twisted rope, common in marine use","zh":"三股合捻而成的结实绳索结构，常见于海事用途"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a rope) made by twisting three strands together in the same direction as the twist within each strand; a traditional, very strong rope construction often used for heavy marine work.","zh":"（绳索）“三股捻”结构：由三股绳合捻成一根，且合捻方向与每股内部的捻向一致；一种传统且很结实的制绳方式，常用于重型海事用途。"},"examples":[{"en":"The ship used a hawser-laid rope for towing because it could handle heavy loads.","zh":"这艘船用三股捻的绳索来拖带，因为它能承受很大的拉力。"},{"en":"Check the hawser-laid line regularly for wear, especially after saltwater exposure.","zh":"三股捻的绳子要定期检查磨损，尤其是接触海水之后。"}]}],"synonyms":["three-strand","three-strand laid","three-ply","strand-laid"],"phonetic":"/ˈhɔsɚ leɪd/","extraExplanation":["在制绳里常见对比：hawser-laid（3股）与 cable-laid（把3根hawser-laid再反向合捻成更粗的绳）。三股捻手感更“有纹路”、较易看出三条螺旋线，常见于传统麻绳或一些海用绳索描述中。"],"etymology":"源自航海用语：hawser（粗缆、拖缆）+ laid（“捻成、制成”之意）。这里的 laid 指绳索的捻制方式，而不是“放下”。","mnemonic":["把 hawser 想成“海上拖缆”，-laid 想成“捻出来的结构”：海上用的“捻制绳”。","记“3股捻”：看到绳子有三条明显螺旋纹路，就联想到 hawser-laid。"]}
{"word":"hawsers","summary":{"en":"“Hawsers” means thick ropes or cables used on ships for towing or mooring.","zh":"“hawsers”指船上用于拖曳或系泊的粗缆绳/钢缆（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick rope or cable used on a ship for towing, mooring (tying up), or hauling heavy loads","zh":"（船上用的）粗缆绳；用于拖曳、系泊（靠岸系船）或拉拽重物的粗绳/钢缆"},"examples":[{"en":"The crew threw a hawser to the dock to secure the ship.","zh":"船员把一根粗缆绳抛到码头上，把船固定住。"},{"en":"Two tugboats pulled the disabled vessel using heavy hawsers.","zh":"两艘拖船用粗缆绳拖拽那艘失去动力的船。"}]}],"synonyms":["thick rope","cable","mooring line","towline"],"phonetic":"/ˈhɔzɚ/","extraExplanation":["“hawser”常见于航海/港口语境；你输入的“hawsers”是复数形式。日常英语里更常听到“rope/line”，但在海事英语中会用更专业的“hawser”。","相关术语小提示：mooring line（系泊缆）、towline（拖缆）、anchor cable/chain（锚链/锚缆）。"]}
{"word":"hawserwise","summary":{"en":"A rare nautical adverb meaning “in the manner or direction of a hawser (thick rope).”","zh":"一个较罕见的航海副词，表示“像拖缆/粗缆那样；沿缆绳方向（纵向）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(nautical) In the manner of a hawser (a thick rope or cable); lengthwise or in the direction a hawser runs.","zh":"（航海用语）像拖缆/粗缆那样；沿着缆绳的方向；纵向地。"},"examples":[{"en":"They laid the line hawserwise along the deck to keep it clear of the fittings.","zh":"他们把缆绳沿甲板纵向铺放（hawserwise），以免被甲板设备挂住。"},{"en":"Secure the gear hawserwise so it won’t snag when the vessel rolls.","zh":"把器材沿缆绳方向固定好（hawserwise），这样船摇晃时就不容易挂住。"}]}],"synonyms":["lengthwise","longitudinally","in line with the rope","ropewise"],"phonetic":"/ˈhɔzərˌwaɪz/","extraExplanation":["“hawserwise”是非常偏航海/船舶作业语境的词，日常英语里几乎不用。它由“hawser（粗缆、拖缆）+ -wise（以……方式/方向）”构成，强调“顺着缆绳那条线（纵向）”的摆放或固定方式。"]}
{"word":"hawses","summary":{"en":"“Hawses” is a nautical plural meaning the ship’s hawse area/holes where anchor chains pass.","zh":"“Hawses”是航海用语的复数，指船首的锚孔等锚链穿过的位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) The plural of “hawse”: the bow area of a ship, especially the hawseholes/ports where anchor chains or cables pass through.","zh":"（航海用语）“hawse”的复数：指船首区域，尤指锚链或缆绳穿过的“锚链孔/锚孔”（hawseholes）。"},"examples":[{"en":"The deck crew checked the hawses for wear where the anchor chain rubbed.","zh":"甲板船员检查锚孔处的磨损情况，因为锚链在那儿摩擦。"},{"en":"Water was splashing up through the hawses as the ship pushed into rough seas.","zh":"船顶着大浪前进时，海水从锚孔处溅了上来。"}]}],"synonyms":["hawseholes","anchor ports"],"phonetic":"/ˈhɔzɪz/","extraExplanation":["这是比较少见的航海词。单数是 hawse，常见搭配是 hawsehole(s)（锚链孔/锚孔）。","发音上 hawse /hɔz/ 和 horse 同音，所以 hawses /ˈhɔzɪz/ 也很容易被误看成拼错的 “horses”。如果你想表达“马”，正确拼写是 horses。"]}
{"word":"hawsing","summary":{"en":"“Housing” most commonly means homes/apartments as a living situation or social issue; it can also mean a protective outer case for a device.","zh":"“Housing”最常用指“住房/住宅（作为居住与社会问题）”，也可指设备的“外壳/保护罩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The places where people live, especially homes or apartments considered as a social or economic issue.","zh":"住房；（尤指作为社会或经济问题的）住房条件、住宅供给。"},"examples":[{"en":"Housing is expensive in many big cities.","zh":"在许多大城市，住房很贵。"},{"en":"The government is building more affordable housing.","zh":"政府正在建设更多保障性（可负担）住房。"}]},{"partOfSpeech":"n.","definition":{"en":"A protective outer cover or case for a machine or device.","zh":"（机器或装置的）外壳；保护罩。"},"examples":[{"en":"The camera’s housing protects it from dust and water.","zh":"相机外壳能防尘防水。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to providing homes or places to live.","zh":"与住房有关的；用于提供居住场所的。"},"examples":[{"en":"They discussed new housing policies.","zh":"他们讨论了新的住房政策。"}]}],"synonyms":["accommodation","homes","residential property","shelter","casing","enclosure"],"phonetic":"/ˈhaʊzɪŋ/","extraExplanation":["“hawsing”不是常见的标准拼写，最可能是把“housing”按发音写出来的拼法（类似把 /aʊ/ 听成“aw”）。标准拼写是 housing。"]}
{"word":"hawthorn","summary":{"en":"A hawthorn is a thorny shrub or small tree with spring blossoms and red berries, often used in hedges.","zh":"hawthorn 指带刺的灌木或小乔木，春天开花、秋天结果，常用于树篱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tree or shrub with white or pink blossoms and red berries (haws), often used for hedges","zh":"山楂树；（尤指）山楂属的灌木/小乔木，常开白色或粉色花，结红色小果（山楂果），常用作树篱"},"examples":[{"en":"There’s a hawthorn hedge along the old country road.","zh":"老乡间小路旁有一排山楂树篱。"},{"en":"In spring, the hawthorn is covered in small white blossoms.","zh":"春天时，山楂树开满了小白花。"}]}],"synonyms":["thornbush","may tree"],"phonetic":"/ˈhɔˌθɔrn/","extraExplanation":["“hawthorn”在英国文化与民间传说中很常见：常见说法认为它与春天、田野树篱、以及某些节庆（如五月节 May Day）相关。它也经常出现在英国诗歌与乡村文学里，用来营造“田园/乡野”的意象。","词源上，“haw”指这种植物的果实（haws），而“thorn”指它带刺的枝条，因此“hawthorn”字面上可理解为“结 haw 果的刺灌木/树”。"]}
{"word":"hawthorn-covered","summary":{"en":"covered or thick with hawthorn plants","zh":"被山楂植物覆盖的；长满山楂的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with hawthorn plants (a thorny shrub or small tree), or filled with hawthorn branches and bushes.","zh":"被山楂树（多刺灌木/小乔木）覆盖的；长满山楂枝叶与灌丛的。"},"examples":[{"en":"They followed a narrow path through a hawthorn-covered hillside.","zh":"他们沿着一条狭窄小路穿过一座长满山楂的山坡。"},{"en":"A hawthorn-covered hedge marked the edge of the field.","zh":"一排长满山楂的树篱标示着田地的边界。"}]}],"synonyms":["thorny","hedged","hawthorn-clad","hawthorn-filled"],"phonetic":"/ˈhɔˌθɔrn ˈkʌvɚd/","extraExplanation":["hawthorn 在英国乡村文化中常见：常被用作树篱（hedgerow）植物，因为枝条多刺，能围挡牲畜。文学里也常用来营造“乡野、篱墙、春季开花”的意象。"],"etymology":"这是一个复合形容词：hawthorn（山楂/山楂树；在英语里常指多刺的“hawthorn”灌木或小乔木）+ covered（覆盖的）。用连字符把两部分连接，表示“被……覆盖/布满……的”。","mnemonic":["把它拆开记：haw（山楂）+ thorn（刺）→ “带刺的山楂”；hawthorn-covered 就是“被带刺山楂覆盖”。","联想画面：一条小路两旁都是“山楂刺篱”，所以是“hawthorn-covered（山楂覆盖的）”。"]}
{"word":"hawthorn-lined","summary":{"en":"bordered by hawthorn bushes or trees","zh":"两侧以山楂灌木或树木为边的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a road, lane, path, etc.) bordered on both sides with hawthorn bushes or trees.","zh":"（指道路、小路等）两侧长着山楂树/山楂灌木作边的。"},"examples":[{"en":"We walked along a hawthorn-lined lane toward the village.","zh":"我们沿着一条两旁长着山楂灌木的小路走向村庄。"},{"en":"In spring, the hawthorn-lined road turns white with blossoms.","zh":"到了春天，这条两旁是山楂的路会被白色花朵点亮。"},{"en":"A small cottage sat at the end of the hawthorn-lined path.","zh":"一座小屋坐落在那条两旁是山楂的小径尽头。"}]}],"synonyms":["hedge-lined","tree-lined","thorn-lined","shrub-lined"],"phonetic":"/ˈhɔrθɔrn laɪnd/","extraExplanation":["在英伦与欧洲乡村语境里，hawthorn 常见于田野“树篱/篱笆”（hedgerows），既分隔地块，也能当作天然屏障；文学描写中常用来营造“乡野、春季白花、略带荆棘”的氛围。","注意 hawthorn 这里多指“山楂属植物/白花的刺灌木”（常见为英伦的 May/Mayflower），不一定等同于中文日常食用的“山楂果”。"],"etymology":"由 hawthorn（山楂树/山楂灌木）+ lined（两侧成行/沿边排列的）构成的复合形容词；常用于描写乡村景色、篱笆或道路两旁的植被。","mnemonic":["把它拆开记：hawthorn（山楂/带刺灌木）+ lined（排成两行/两侧有）=“两边都是山楂的”。","联想画面：走在路上，两边像“有刺的篱笆墙”一样排着一排山楂（thorn=刺）。"]}
{"word":"hawthorned","summary":{"en":"Hawthorned is a literary adjective meaning “covered with or surrounded by hawthorn,” and it can rarely function as the past form of a verb meaning “to plant/fence with hawthorn.”","zh":"hawthorned 多为文学性形容词，指“长满或被山楂围绕的”；也极少作动词过去式，指“种山楂/用山楂做篱笆围起”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Covered with, made of, or surrounded by hawthorn (a thorny shrub or small tree).","zh":"（文学用语）长满山楂属植物的；用山楂（带刺灌木/小乔木）做成的；被山楂围绕的。"},"examples":[{"en":"They followed a hawthorned lane toward the village.","zh":"他们沿着一条两旁长满山楂的乡间小路走向村庄。"},{"en":"A hawthorned hedge marked the edge of the field.","zh":"一道山楂树篱标出了田地的边界。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) Past tense/past participle of an uncommon verb “to hawthorn,” meaning to plant or fence with hawthorn.","zh":"（罕见）不常见动词 to hawthorn 的过去式/过去分词，意为“种植山楂、用山楂做篱笆围起”。"},"examples":[{"en":"In older rural writing, land was sometimes described as hawthorned for shelter and boundaries.","zh":"在较早的乡村写作中，土地有时会被写成“用山楂围起”，用于防风并划定界线。"}]}],"synonyms":["hawthorn-covered","hawthorn-lined","hedged","thorny"],"phonetic":"/ˈhɔːθɔːrnd/","extraExplanation":["“hawthorn”常指山楂属（Crataegus）的带刺灌木/小乔木，在英国乡村很常见，常被修剪成树篱（hedge）用来分隔田地。","在英语文学里，hawthorn 常带有“乡野、篱笆、春季白花”的意象；“hawthorned”多见于描写风景的诗性/叙述性文本，而不是日常口语。"]}
{"word":"hawthorns","summary":{"en":"Hawthorns are thorny bushes or small trees that often have white or pink flowers.","zh":"Hawthorns 指带刺的灌木或小乔木，常开白色或粉色花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tree or bush with thorny branches and white or pink flowers, often growing in hedges; also called hawthorn (plural: hawthorns)","zh":"山楂属的带刺灌木或小乔木，常开白色或粉色小花，常见于树篱中；复数：hawthorns（山楂树/山楂灌木）"},"examples":[{"en":"In spring, the hawthorns along the road bloom with small white flowers.","zh":"春天，路边的山楂树开出小小的白花。"},{"en":"Birds often build nests in hawthorns because the thorns help protect them.","zh":"鸟常在山楂灌木里筑巢，因为刺能帮助它们防御。"},{"en":"They planted hawthorns to make a natural hedge around the garden.","zh":"他们种了山楂来做花园周围的天然树篱。"}]}],"synonyms":["hawthorn","thorn bush","hedge (context: hedge plant)"],"phonetic":"/ˈhɔθɔrn/","extraExplanation":["“hawthorn”在英美文化中常与乡村树篱（hedgerows）联系在一起，既能分隔土地，也能为鸟类与昆虫提供栖息地。","在英国传统里，hawthorn（有时叫“may”或“may tree”）与五月开花、春天与民俗节庆有关；但在一些地区也有“不要把开花的hawthorn带进屋里”的民间说法。"]}
{"word":"hawthorny","summary":{"en":"Hawthorny means “full of hawthorn” or “thorny like hawthorn,” often used in nature descriptions.","zh":"hawthorny 指“长满山楂（刺山楂）的”或“像山楂一样多刺的”，常用于自然景物描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a plant or place) full of hawthorn bushes, or resembling hawthorn (especially with small white flowers and sharp thorns).","zh":"（指植物或地方）长满山楂树/刺山楂灌木的；像山楂（尤指小白花与尖刺）的。"},"examples":[{"en":"We walked along a hawthorny hedge at the edge of the field.","zh":"我们沿着田边一排长满山楂的树篱走。"},{"en":"In spring, the hawthorny branches are covered with tiny white blossoms.","zh":"春天时，带刺的山楂枝上开满细小的白花。"}]},{"partOfSpeech":"adj.","definition":{"en":"thorny; having many sharp points (used in a literary or descriptive way).","zh":"多刺的；布满尖刺的（偏文学或描写性用法）。"},"examples":[{"en":"A hawthorny tangle blocked the narrow path.","zh":"一丛带刺的灌木堵住了狭窄的小路。"},{"en":"The kitten avoided the hawthorny shrubs.","zh":"小猫避开了那些多刺的灌木。"}]}],"synonyms":["thorny","brambly","spiny","prickly"],"phonetic":"ˈhɔˌθɔrni","extraExplanation":["“hawthorn”在英伦与欧洲乡村很常见，常被修剪成树篱（hedge），既能做界线也能挡风；“hawthorny”因此常出现在描写乡野景色的文字中。","注意别与作家名“(Nathaniel) Hawthorne（霍桑）”混淆：那是姓氏，拼写不同。"]}

