{"word":"hay","summary":{"en":"“Hay” most commonly means dried grass used to feed animals; it can also be a verb meaning to make hay, and rarely an interjection like “hey.”","zh":"“hay”最常见意思是“干草/草料”；也可作动词表示“把草割下晒成干草”；少见情况下可作感叹词，类似“嘿/喂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dried grass or other plants used as food for animals (especially horses, cows, and sheep).","zh":"（尤指喂马、牛、羊等的）干草、草料。"},"examples":[{"en":"The farmer stacked hay in the barn before winter.","zh":"农民在冬天来临前把干草堆进谷仓。"},{"en":"Horses eat hay when there isn’t enough fresh grass.","zh":"没有足够新鲜青草时，马就吃干草。"}]},{"partOfSpeech":"v.","definition":{"en":"to cut and dry grass to make animal feed.","zh":"割草并晒干以制成草料。"},"examples":[{"en":"They hay the field in early summer.","zh":"他们在初夏把田里的草割下来晒成干草。"}]},{"partOfSpeech":"int.","definition":{"en":"used to get someone’s attention, often in a casual or surprised way (similar to “hey”).","zh":"（口语）用来引起注意或表示惊讶，类似“嘿/喂”。"},"examples":[{"en":"Hay, wait for me!","zh":"喂，等等我！"}]}],"synonyms":["fodder","feed","dried grass"],"phonetic":"/heɪ/","extraExplanation":["注意拼写：表示“干草”是 hay；打招呼通常是 hey。很多学习者会把两者混淆。","常见搭配：make hay（趁机获利/抓紧时机）；hay bale（干草捆）；hay fever（花粉过敏，字面是“干草热”，但并不是因为干草本身）。"]}
{"word":"hay-scented","summary":{"en":"having the pleasant smell of hay; sometimes evoking a rural mood","zh":"带干草香的；有时引申为田园乡村氛围的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Smelling like hay (dried grass), often pleasantly sweet and grassy.","zh":"有干草（晒干的草）气味的，常带甜甜的青草香。"},"examples":[{"en":"The barn was warm and hay-scented.","zh":"谷仓里很暖和，空气中带着干草香。"},{"en":"She stepped into a hay-scented field after the harvest.","zh":"收割后，她走进一片带着干草香的田野。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suggesting a simple rural or pastoral atmosphere (used figuratively in writing).","zh":"（比喻用法）让人联想到质朴的乡村/田园氛围的。"},"examples":[{"en":"The novel opens with a hay-scented memory of childhood summers.","zh":"小说以一段带着“干草香”的童年夏日回忆开篇。"},{"en":"They wanted a hay-scented, country feel for the wedding venue.","zh":"他们想让婚礼场地有一种“干草香”的乡村感觉。"}]}],"synonyms":["haylike","grassy","sweet-smelling","country","pastoral","rustic"],"phonetic":"ˈheɪ ˌsɛntɪd","extraExplanation":["写作里它常用来营造“田园（pastoral）”意象：像夏天、收割季、谷仓、乡间小路等，传达宁静、自然、质朴的氛围。"],"etymology":"复合词：hay（干草）+ scented（有……气味的）。英语里常用“名词 + -scented”来形容“带某种香味/气味”。","mnemonic":["把它拆开记：hay（干草）+ scented（有香味的）→“干草香的”。","联想中文场景：走进“晒谷场/草垛旁”，闻到太阳晒过的草味，就是 hay-scented。"]}
{"word":"haya","summary":{"en":"“haya” is usually a nonstandard way to write a casual “hi” (more commonly “hiya”), or it may be a name/word from another language depending on context.","zh":"“haya”通常是随意拼写的“嗨”（更常见为“hiya”），也可能是其他语言中的名字/词，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(informal, nonstandard spelling) A casual greeting, usually meaning “hi.” Often written as “hiya.”","zh":"（非标准拼写，口语）随意的问候语，意思是“嗨/你好”。更常写作“hiya”。"},"examples":[{"en":"Haya! Long time no see.","zh":"嗨！好久不见。"},{"en":"She texted, “haya, are you free tonight?”","zh":"她发短信说：“嗨，你今晚有空吗？”"}]},{"partOfSpeech":"other","definition":{"en":"A name/word from other languages (not standard English). Depending on context, it may be a personal name or a transliteration with a different meaning.","zh":"来自其他语言的词/名字（不属于标准英语）。根据语境，可能是人名，或是音译词，含义会不同。"},"examples":[{"en":"Haya is used as a given name in some cultures.","zh":"在一些文化中，Haya 会被用作名字。"}]}],"synonyms":["hi","hey","hiya","hello"],"phonetic":"/ˈhaɪə/","extraExplanation":["在英语里更常见的是“hiya”（= hi + ya）。你写的“haya”通常会被理解为随意拼写的问候，但在正式写作中建议用“hi/hello”。","如果你指的是阿拉伯语“ḥayāʾ/حياء”（常被拼作 haya 或 haya’），意思是“羞耻感/羞怯、端庄、谦逊”，那就不是英语词义，需要看你具体语境。"]}
{"word":"hayband","summary":{"en":"A hayband is a strap or tie used to bind and secure hay, especially hay bales.","zh":"hayband 指用来捆绑、固定干草（尤其是草捆）的带子或绑绳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a band, strap, or tie used to secure hay (especially to hold a hay bale together or fasten hay for transport).","zh":"捆草带；捆绑干草用的带子/绑绳（尤指把草捆扎紧或运输时固定干草的带子）。"},"examples":[{"en":"The farmer tightened the hayband before loading the bales onto the truck.","zh":"农夫在把草捆装上卡车前，把捆草带又勒紧了一下。"},{"en":"One hayband snapped, and the bale started to come apart.","zh":"有一根捆草带断了，草捆开始散开。"}]}],"synonyms":["bale tie","baling twine","bale strap","hay bale tie"],"phonetic":"/ˈheɪˌbænd/","extraExplanation":["“hayband”不是日常英语里的常用词，更常见的说法是“bale tie / baling twine / bale strap（捆草绳/捆扎带）”。在不同地区与不同农具（如打捆机）语境下，用词会有差异。"]}
{"word":"haybird","summary":{"en":"Haybird is a regional word, usually meaning a songbird found in hayfields (often the bobolink), and more rarely a person who helps make hay.","zh":"Haybird 是地区性用语，常指干草地里的鸣禽（常指北美的黑鸟鹀 bobolink），较少情况下也可指收割晾晒干草的帮工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Regional, informal) A common name for the bobolink or other small songbirds often seen in hayfields.","zh":"（地区性/非正式）对“草地或干草地里常见的小型鸣禽”的俗称，常指北美的黑鸟鹀（bobolink）。"},"examples":[{"en":"We heard haybirds singing over the hayfield at dawn.","zh":"清晨我们听到干草地上空有“haybirds”在唱。"},{"en":"The farmer waited to mow so the haybirds could finish nesting.","zh":"农夫等到这些“haybirds”筑巢育雏结束后才割草。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who helps make hay; a farmhand during haying season.","zh":"（少见）帮助收割、晾晒和打捆干草的人；干草季的农场帮工。"},"examples":[{"en":"He worked as a haybird for a few weeks each summer.","zh":"每年夏天他都会当几周的“haybird”来帮忙收干草。"},{"en":"Local haybirds started early to beat the heat.","zh":"当地的收干草帮工一大早就开工，避开酷热。"}]}],"synonyms":["bobolink","meadow bird","farmhand"],"phonetic":"ˈheɪbɝd","extraExplanation":["“haybird”不是现代英语里非常常见的标准词，更常见于地方口语或自然观察语境。","在北美，bobolink（黑鸟鹀）因为常在干草地/草甸活动、筑巢，曾被叫作“haybird”。不同地区也可能把别的草地鸟类用同一俗称来指代，所以含义会随语境变化。","如果你是在某篇文章/歌词里看到“haybird”，可以告诉我句子或来源，我可以帮你判断更接近哪一种用法。"]}
{"word":"haybote","summary":{"en":"“Haybote” is not a standard English word; it’s likely a misspelling or a proper name (possibly meant to be “hayboat”).","zh":"“haybote”不是标准英语词汇；多半是拼写错误或专有名词（可能想写“hayboat”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or a name. It may be intended to mean “hayboat” (a boat used to carry hay) or “haybote” as a non-dictionary proper name.","zh":"不是标准英语单词；多见于拼写错误或人名/地名。可能想写的是“hayboat”（运送干草的船），或把“haybote”当作专有名词使用。"},"examples":[{"en":"I couldn’t find “haybote” in a dictionary—did you mean “hayboat”?","zh":"我在词典里找不到“haybote”——你是不是想写“hayboat”？"},{"en":"The username “haybote” might be a personal name rather than an English word.","zh":"“haybote”这个用户名可能是个人取的名字，并非英语单词。"}]}],"phonetic":"ˈheɪboʊt","extraExplanation":["“haybote”在常见英语词典中通常查不到。如果你能提供一句原文或告诉我它来自哪里（比如游戏ID、姓氏、地名、某段文字），我可以更准确判断含义与用法。","如果你想表达“干草船/运草的船”，更常见的写法是“hayboat”。另外也可能是把别的词拼错了（例如与“hay”相关的复合词）。"]}
{"word":"haybox","summary":{"en":"A haybox is either a box for storing hay or an insulated box used to finish cooking food slowly with retained heat.","zh":"haybox 指“干草箱/草料箱”，也可指用于余热保温慢煮的“干草箱保温烹饪器”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a container or box used to hold and store hay, often for feeding animals (especially horses)","zh":"（存放或喂养用的）干草箱；草料箱（常用于马等动物）"},"examples":[{"en":"The stable keeps a haybox near the stalls for easy feeding.","zh":"马厩在马栏旁放了一个干草箱，方便喂食。"},{"en":"Please close the haybox lid so the hay stays dry.","zh":"请把干草箱的盖子盖好，免得干草受潮。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-insulated box used for “haybox cooking,” where a pot of food is brought to a boil and then kept hot to finish cooking slowly","zh":"（保温慢煮用的）保温箱；干草箱慢煮器（先煮沸再利用保温余热慢慢煮熟）"},"examples":[{"en":"She simmered the stew for a few minutes, then put the pot in a haybox to finish cooking.","zh":"她把炖菜先小火煮了几分钟，然后把锅放进保温箱里继续焖熟。"},{"en":"Haybox cooking saves fuel because the food keeps cooking in the retained heat.","zh":"干草箱慢煮很省燃料，因为食物会用保留下来的热量继续烹煮。"}]}],"synonyms":["hay bin","feed box","insulated box","heat-retention cooker"],"phonetic":"/ˈheɪˌbɑks/","extraExplanation":["“haybox cooking（干草箱慢煮）”源于早期的节能做饭方法：把刚煮沸的锅用布、稻草或干草等保温材料包裹/放入箱中，利用余热把食物焖熟。它在燃料昂贵或短缺的时期（如战争年代、野外露营、乡村生活）尤其常见。现代的焖烧锅、保温锅在原理上与之相近。"]}
{"word":"hayburner","summary":{"en":"Hayburner is informal slang for a horse (often old/slow), and less commonly for an old inefficient vehicle.","zh":"Hayburner 是指“马”的非正式俚语（常指又老又慢的马）；较少也可指老旧低效的车或机器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often humorous or slightly insulting) A horse—especially one considered old, slow, or not very good.","zh":"（非正式，常带幽默或轻微贬义）马，尤指被认为老、跑得慢或不太优秀的马。"},"examples":[{"en":"He bought a cheap hayburner for trail rides.","zh":"他买了一匹便宜的“hayburner”用来走山路骑行。"},{"en":"That hayburner couldn’t win a race, but it was gentle with beginners.","zh":"那匹“hayburner”赢不了比赛，但对新手很温顺。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A person’s car, truck, or machine that is old, slow, or inefficient (less common).","zh":"（非正式）老旧、慢、效率差的车或机器（较少见）。"},"examples":[{"en":"My old hayburner barely makes it up the hill.","zh":"我那辆老“破车”勉强爬得上那座坡。"}]}],"synonyms":["nag","old horse","plug","jade","old banger"],"phonetic":"/ˈheɪˌbɝnɚ/","extraExplanation":["这个词字面意思是“烧干草的东西”。早期主要用来指马：马吃干草，好像把干草“烧掉”一样；因此常带调侃意味，尤其指不够快或不够优秀的马。","在赛马、牧场或骑马圈子里更常见；对他人的马使用时可能显得不礼貌，语气要注意。"]}
{"word":"haycap","summary":{"en":"Haycap is an uncommon word for a protective cap/cover of hay on top of a haystack.","zh":"Haycap 是不常见的词，指干草堆顶部用来防雨的草盖/覆盖层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A covering or “cap” placed on top of a haystack to protect it from rain; sometimes used for the top layer itself.","zh":"（不常见）盖在干草堆顶部用来防雨的“草帽/草盖”；有时也指干草堆最上面那一层覆盖草。"},"examples":[{"en":"Before the storm, they put a haycap on the stack to keep the hay dry.","zh":"暴风雨来之前，他们在草堆上盖了一层haycap来防潮。"},{"en":"The old photo shows a haystack with a neat haycap on top.","zh":"那张老照片里，干草堆顶部有一层整齐的haycap。"}]}],"synonyms":["haystack cover","cover","haycock (related)","haystack (related)"],"phonetic":"/ˈheɪˌkæp/","extraExplanation":["这个词在现代英语里非常少见，多见于方言、旧文本或描述传统农事的语境。更常见的相关词是 haystack（干草堆）、haycock（小干草堆）、thatched cover（茅草覆盖物）或 simply cover/tarp（覆盖物/防水布）。如果你是在别处看到 haycap，也可能是拼写变体或地方用法。"]}
{"word":"haycart","summary":{"en":"A haycart is a cart used to transport hay, especially in rural or farm settings.","zh":"haycart 指运送干草的车，常见于乡村或农场语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cart (often horse-drawn) used for carrying hay","zh":"运干草的车（常为马车或农用拖车）"},"examples":[{"en":"They loaded the haycart with bales of hay before sunset.","zh":"他们在日落前把一捆捆干草装上运草车。"},{"en":"A haycart rolled slowly down the country lane.","zh":"一辆运草车沿着乡间小路缓慢前行。"}]}],"synonyms":["hay wagon","hay wain","hay trailer","wagon"],"phonetic":"/ˈheɪˌkɑrt/","extraExplanation":["“haycart”是较偏英式、带乡村/田园色彩的词，常出现在描写农场生活或旧时乡间交通的语境中。美式英语里更常用更具体的说法，如“hay wagon（运草马车）”或“hay trailer（运草拖车）”。"]}
{"word":"haycock","summary":{"en":"A haycock is a small stack/pile of hay, often made in a field to dry.","zh":"haycock 指在田里堆起用于晾干的“小干草堆/小草垛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pile or stack of hay (often cone-shaped), especially one made in a field","zh":"（尤指在田里堆成的）小干草堆；小草垛（常呈圆锥形）"},"examples":[{"en":"After mowing, they gathered the grass into haycocks to dry.","zh":"割完草后，他们把草堆成小干草堆来晾干。"},{"en":"A few haycocks dotted the hillside in late summer.","zh":"夏末时，山坡上零星点缀着几个小草垛。"},{"en":"The old painting shows a farmer resting beside a haycock.","zh":"那幅老画里有位农夫靠着一个小草垛休息。"}]}],"synonyms":["haystack","stack of hay","pile of hay"],"phonetic":"/ˈheɪˌkɑk/","extraExplanation":["“haycock”由 hay（干草）+ cock（这里指“竖起、堆起成一小堆”的意思）构成，是较传统、带点乡村/文学色彩的词；在现代日常英语里，人们更常说 haystack（草垛）或 a pile of hay（几堆干草）。"]}
{"word":"haycocks","summary":{"en":"“Haycocks” means small piles of hay left in a field to dry (plural of “haycock”).","zh":"“haycocks”指田里为晾干而堆起的一小堆一小堆干草（“haycock”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Conical or rounded piles of hay (cut grass) left in a field to dry before being collected; plural of “haycock.”","zh":"（干草的）小草堆；常指田里为晾干而堆成圆锥形/圆顶状的干草堆（“haycock”的复数）。"},"examples":[{"en":"After mowing, farmers left small haycocks across the meadow to dry in the sun.","zh":"割草后，农民把一小堆一小堆的干草堆在草地上，让它们在阳光下晾干。"},{"en":"The painting shows haycocks dotting the field after the harvest.","zh":"那幅画描绘了收割后田野里点缀着许多干草堆。"}]}],"synonyms":["haystacks","hayricks","piles of hay"],"phonetic":"/ˈheɪˌkɑks/","extraExplanation":["“haycock”在现代日常英语里不算常用，更多出现在乡村题材、历史描写或文学/绘画语境中。更常见的近义词是“haystack”（更大的干草堆）或“hay bale”（打包成方/圆捆的干草）。","在一些经典英语文学中，描述乡间风景时会用到“haycocks”来营造田园气息：一堆堆干草散落田间的画面感很强。"]}
{"word":"Hayden","summary":{"en":"a given name or surname.","zh":"常见的英文名或英文姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name used as a first name (given name) or a family name (surname).","zh":"用作名字（名）或姓氏（姓）的英文人名。"},"examples":[{"en":"Hayden is my classmate; he sits in the front row.","zh":"Hayden 是我的同学，他坐在前排。"},{"en":"Ms. Hayden will lead today’s meeting.","zh":"Hayden 女士将主持今天的会议。"},{"en":"The book was written by Jordan Hayden.","zh":"这本书由 Jordan Hayden 写作。"}]}],"phonetic":"/ˈheɪdən/","extraExplanation":["它通常被当作中性名字（男女都可用），在北美、澳洲等地较常见。","注意不要与作曲家“Haydn（海顿）”混淆：拼写不同（Haydn vs. Hayden），读音也不同。"],"etymology":"主要见于英语世界的姓氏与名字。作为姓氏时，常被认为源自古英语地名/地貌词：与“hay（干草）”或“hedge（树篱）”相关的词根 + “denu（山谷）”，大意可理解为“有干草的山谷/树篱旁的山谷”。在爱尔兰语背景中也可能与盖尔语姓氏形式相关（不同家族来源不一）。","mnemonic":["读音 /ˈheɪdən/ 很像中文口语“嘿，登！”（叫人上来/登场），把它想成一个人名。","可拆成 hay + den：hay=干草，den=洞/窝（小住处），联想到“干草堆旁的小窝/山谷里的住处”，帮助记住拼写。"]}
{"word":"haydenite","summary":{"en":"Haydenite is a rare mineral name used in geology, named after Ferdinand V. Hayden.","zh":"Haydenite（海登石）是一种较罕见的矿物名称，用于地质学领域，以地质学家费迪南德·V·海登命名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a scientific name used in geology and mineralogy) named after the American geologist Ferdinand V. Hayden","zh":"海登石：一种较罕见的矿物名称（地质学/矿物学术语），以美国地质学家费迪南德·V·海登（Ferdinand V. Hayden）命名"},"examples":[{"en":"The museum’s collection includes a small sample labeled “haydenite.”","zh":"博物馆的馆藏里有一小块标着“haydenite（海登石）”的标本。"},{"en":"Haydenite is not a common mineral, so it’s usually discussed in specialized geology texts.","zh":"海登石并不常见，所以通常只在较专业的地质资料中被讨论。"}]}],"phonetic":"/ˈheɪdən.aɪt/","extraExplanation":["“haydenite”属于以人名命名的矿物学词汇（eponym）。在英语里，很多矿物以发现者、研究者或相关地质学家的姓氏命名，后面常加 -ite（表示“矿物/岩石”）。","发音上可拆成 HAY-den-ite：前两音节像人名 Hayden，末尾 -ite 常读作 /aɪt/（如 graphite, calcite 等）。"]}
{"word":"Haydn","summary":{"en":"Haydn is most commonly the name of Joseph Haydn, a major Austrian Classical composer; it can also be a surname.","zh":"Haydn 最常指奥地利古典主义作曲家约瑟夫·海顿；也可作姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Joseph Haydn (1732–1809), an Austrian composer of the Classical period, especially famous for his symphonies and string quartets.","zh":"约瑟夫·海顿（1732–1809），奥地利古典主义时期作曲家，以交响曲与弦乐四重奏最著名。"},"examples":[{"en":"We studied Haydn’s “Surprise Symphony” in music class.","zh":"我们在音乐课上学习了海顿的《惊愕交响曲》。"},{"en":"Haydn helped shape the style of the Classical symphony.","zh":"海顿帮助塑造了古典交响曲的风格。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; used to refer to someone with the family name Haydn.","zh":"姓氏；用于指姓“海顿（Haydn）”的人。"},"examples":[{"en":"Dr. Haydn will see you now.","zh":"海顿医生现在可以见你了。"}]}],"synonyms":["Joseph Haydn"],"phonetic":"/ˈhaɪdən/","extraExplanation":["“海顿”常被称为“交响曲之父”和“弦乐四重奏之父”，因为他在这两种体裁的发展与定型上影响很大。","在英语文化语境里，提到“Haydn”通常默认指作曲家 Joseph Haydn；若在日常生活中看到作姓氏，则需根据上下文判断。","常见作品名例子：《惊愕交响曲》(Symphony No. 94 “Surprise”)、《告别交响曲》(No. 45 “Farewell”)。"]}
{"word":"Haydon","summary":{"en":"Haydon is most commonly an English surname, and it can also be a UK place name.","zh":"Haydon 最常見是英國姓氏，也可作為英國的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin","zh":"（英源）姓氏：海登"},"examples":[{"en":"My teacher’s last name is Haydon.","zh":"我老師的姓是 Haydon（海登）。"},{"en":"Please send the email to Dr. Haydon.","zh":"請把郵件寄給 Haydon 博士。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several locations, especially in the UK (e.g., small villages/areas called Haydon)","zh":"地名：英國等地有些村莊或地區名為 Haydon（海登）"},"examples":[{"en":"They moved to Haydon for a quieter life.","zh":"他們搬到 Haydon（海登）去過更安靜的生活。"},{"en":"Our hotel is near Haydon Bridge.","zh":"我們的飯店在 Haydon Bridge（海登橋）附近。"}]}],"phonetic":"/ˈheɪdən/","extraExplanation":["“Haydon”常見於英格蘭的姓氏與地名。發音重音在第一音節：HAY-dən。","歷史文化補充：Benjamin Robert Haydon（本傑明·羅伯特·海登，1786–1846）是英國畫家與作家；在藝術史語境中看到“Haydon”有時指他。"]}
{"word":"haye","summary":{"en":"“Haye” is an uncommon/old spelling of “hay” (dried grass for animal feed).","zh":"“haye”是“hay”（干草）的不常见/古体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or archaic spelling of “hay” (dried grass used as animal feed).","zh":"“hay”的罕见或古体拼写：干草（常用作牲畜饲料）。"},"examples":[{"en":"In some old texts, you may see “haye” where modern English would write “hay.”","zh":"在一些旧文本中，你可能会看到用“haye”来表示现代英语的“hay”。"},{"en":"The horses were fed hay(e) during the winter.","zh":"冬天马被喂食干草（hay/e）。"}]}],"synonyms":["hay"],"phonetic":"/heɪ/","extraExplanation":["“haye”在现代英语里几乎不作为常用词出现，多见于古英语/中古英语拼写变体、家族姓氏（如Haye/Hay）或地名中。日常写作与考试中应使用标准拼写“hay”。","不要与“hey”（喂、嗨，用于打招呼或引起注意）混淆：hay=干草；hey=招呼用语。"]}
{"word":"hayed","summary":{"en":"“Hayed” usually means grass was cut and dried to make hay; it can also (less commonly) mean animals were fed with hay.","zh":"“hayed”通常指把草割下并晒干制成干草；较少见时也可指用干草喂养。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “hay”: to cut grass (or similar plants) and dry it to make hay for animal feed.","zh":"“hay”的过去式/过去分词：割下草（或类似植物）并晒干，制成干草，用来喂养牲畜。"},"examples":[{"en":"They hayed the field in early June before the rain came.","zh":"他们在雨来之前，六月初就把田里的草割下晒成干草了。"},{"en":"By the end of the week, we had hayed most of the pasture.","zh":"到周末时，我们已经把大部分牧草地的草都做成干草了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) Provided with hay; fed or stored as hay.","zh":"（较少见）有干草的；用干草喂养的；作为干草储存的。"},"examples":[{"en":"The cattle were kept in a barn and hayed through the winter.","zh":"牛被养在谷仓里，整个冬天都靠干草喂养。"}]}],"synonyms":["made hay","baled hay","cut and dried (grass)"],"phonetic":"/heɪd/","extraExplanation":["“hayed”多见于农业语境（割草、翻晒、打捆）。日常英语里更常听到的表达是“make hay”“bale hay”（打捆干草）或“hay the field”（把地里的草做成干草）。","注意别和“hayed”误写成“hated /heɪtɪd/（讨厌）”；两者发音和意思都不同。"]}
{"word":"hayer","summary":{"en":"“Hayer” is a rare noun meaning someone who makes or gathers hay.","zh":"“hayer”是一个较少见的名词，指制作或收割干草的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes or gathers hay (rare; not common in modern English)","zh":"制作或收割干草的人（较少见；现代英语中不常用）"},"examples":[{"en":"In older rural writing, a hayer might work long days in the fields during summer.","zh":"在较早的乡村文字中，hayer 可能指夏天在田里长时间劳作的干草工。"},{"en":"The farm hired extra hayers to bring in the hay before the rain.","zh":"农场在下雨前雇了额外的“收干草的人”把干草收回来。"}]}],"synonyms":["haymaker","hay harvester"],"phonetic":"/ˈheɪ.ɚ/","extraExplanation":["“hayer”并不是常见词汇，许多词典里也不一定收录。日常表达更常见的是用更具体的说法，比如 “haymaker”（干草收割/制作的人）或直接说 “someone who makes hay”。","如果你想输入的是 “hater”（讨厌者/黑粉）或 “hair”（头发），告诉我你想表达的中文意思或给我一个句子，我可以帮你确认正确拼写并讲解用法。"]}
{"word":"hayers","summary":{"en":"“Hayers” means people who make hay (haymakers).","zh":"“hayers”指做干草的人（割草、晒草、收干草的工人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who cut, dry, or gather grass to make hay; haymakers (plural).","zh":"割草、晒草或收集干草的人；做干草的工人（复数）。"},"examples":[{"en":"In summer, the hayers start work at dawn to avoid the heat.","zh":"夏天，割干草的人天一亮就开工，以避开炎热。"},{"en":"The field was busy with hayers and wagons full of hay.","zh":"田里挤满了割干草的人和装满干草的马车。"}]}],"synonyms":["haymakers","mowers (in context)","farmworkers (general)"],"phonetic":"/ˈheɪərz/","extraExplanation":["“hayers”并不是现代英语里非常常见的词，更常见的说法是 “haymakers”（割/做干草的人）或用动词短语 “make hay”（做干草）。","词根来自 “hay”（干草）。在农业语境中可理解为 “people who make hay”。如果你是在姓名、地名或品牌里看到 Hayers，它也可能是专有名词而不是普通词。"]}
{"word":"Hayes","summary":{"en":"“Hayes” is most commonly a surname or a place name; “hays” (lowercase) can also mean the plural of “hay.”","zh":"“Hayes”最常见作姓氏或地名；小写“hays”也可表示“hay（干草）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially common in English-speaking countries","zh":"（常见于英语国家的）姓氏"},"examples":[{"en":"Rutherford B. Hayes was a U.S. president.","zh":"拉瑟福德·B·海斯曾是美国总统。"},{"en":"Ms. Hayes will lead the meeting today.","zh":"海斯女士今天将主持会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in several English-speaking regions (for example, an area in London called Hayes)","zh":"地名：英语国家中多个地方的名称（例如伦敦有个地区叫 Hayes）"},"examples":[{"en":"He lives in Hayes, West London.","zh":"他住在伦敦西部的海斯（Hayes）。"},{"en":"The train stops at Hayes station.","zh":"这趟火车在海斯站停靠。"}]},{"partOfSpeech":"n.","definition":{"en":"plural form of “hay” (dried grass used as animal feed)","zh":"“hay”的复数：干草（作动物饲料）"},"examples":[{"en":"The farmer stored different hays for winter.","zh":"农夫为冬天储存了不同种类的干草。"},{"en":"Some hays are better for horses than others.","zh":"有些干草比其他更适合喂马。"}]}],"phonetic":"/heɪz/","extraExplanation":["“Hayes”作为姓氏在英语世界很常见，来源通常与古英语/爱尔兰姓氏有关（不同家族来源可能不同）。在正式场合用作称呼时常说“Mr./Ms. Hayes”。","注意大小写：作为姓氏或地名通常首字母大写“Hayes”；表示“hay”的复数时一般小写“hays”。"]}
{"word":"hayes","summary":{"en":"“Hayes” is most commonly a surname or a place name; a rare historical sense refers to enclosed land/hedged fields.","zh":"“Hayes”最常见是姓氏或地名；较少见的历史义为“围起来的土地/树篱围地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English/Irish origin.","zh":"（常见）英文/爱尔兰姓氏：Hayes。"},"examples":[{"en":"Ms. Hayes will lead the meeting today.","zh":"Hayes 女士今天将主持会议。"},{"en":"My teacher’s last name is Hayes.","zh":"我老师的姓是 Hayes。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in English-speaking countries (for example, a district in London; also used for towns/cities elsewhere).","zh":"（专有名词）地名：在英语国家中用作地区/城镇名（例如伦敦的 Hayes）。"},"examples":[{"en":"He lives in Hayes, west London.","zh":"他住在伦敦西部的 Hayes。"},{"en":"We changed trains at Hayes station.","zh":"我们在 Hayes 站换乘了火车。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, historical) enclosed land or a hedged area; related to old words meaning “hedge/enclosure.”","zh":"（罕见/历史用法）围起来的土地、树篱围出的区域；与古英语中表示“篱笆/围栏”的词有关。"},"examples":[{"en":"In old records, the fields were divided into hayes and commons.","zh":"在旧档案里，田地被分为围地（hayes）和公地。"}]}],"synonyms":["(surname) family name","(place) toponym/place name"],"phonetic":"/heɪz/","extraExplanation":["作为姓氏时，Hayes 在英语世界较常见；在美国历史里也会见到前总统 Rutherford B. Hayes（海斯）。","作为地名时，伦敦的 Hayes 位于 Hillingdon 区（大伦敦西部），常见于交通、地址与新闻中。"]}
{"word":"hayey","summary":{"en":"Hayey describes something that smells, tastes, looks, or feels like hay (dried grass).","zh":"hayey 用来形容某物带有干草（干燥的草）的气味、味道、外观或质感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Smelling like hay, or having the taste/scent of dried grass (often used for tea, wine, or the air in a barn).","zh":"有干草气味的；带有干草般味道/香气的（常用于形容茶、酒或谷仓里的空气）。"},"examples":[{"en":"The green tea has a slightly hayey aroma.","zh":"这款绿茶带着一点点干草般的香气。"},{"en":"The barn smelled warm and hayey in late summer.","zh":"夏末时，谷仓闻起来温暖而有干草味。"}]},{"partOfSpeech":"adj.","definition":{"en":"Looking like hay in color or texture; straw-colored or grasslike.","zh":"外观像干草的；稻草色的；质地像干草的。"},"examples":[{"en":"In the sun, his hair looked almost hayey and golden.","zh":"在阳光下，他的头发看起来几乎像干草一样金黄。"},{"en":"The field turned hayey as it dried.","zh":"田地干了以后变得像干草一样。"}]}],"synonyms":["hay-scented","straw-like","grassy","herbal","straw-colored"],"phonetic":"/ˈheɪ.i/","extraExplanation":["“hayey”是由名词“hay（干草）”加形容词后缀“-y”构成，表示“有……的气味/特征”。这个词在日常口语里不算常见，更常见的替代表达有“hay-scented（有干草香的）”“straw-like（像稻草的）”。"]}
{"word":"hayfield","summary":{"en":"A hayfield is a field used to grow or cut hay (dried grass), usually as animal feed.","zh":"hayfield 指用来种植或收割干草（通常用于喂牲畜）的田地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a field where hay (dried grass) is grown or cut, especially for feeding animals","zh":"（尤指用来收割干草喂牲畜的）干草地、牧草地"},"examples":[{"en":"We walked past a hayfield on the way to the farm.","zh":"去农场的路上，我们经过一片干草地。"},{"en":"In late summer, the hayfield was cut and left to dry in the sun.","zh":"夏末时，干草地里的草被割下，放在太阳下晾干。"},{"en":"The smell of fresh-cut grass drifted from the hayfield.","zh":"新割草的气味从干草地飘来。"}]}],"synonyms":["hay meadow","meadow (sometimes)"],"phonetic":"/ˈheɪˌfiːld/","extraExplanation":["“hayfield”常见于乡村/农场语境，带有一种宁静的田园意象；在英美文学或诗歌中，常用来营造自然、季节变化（尤其是夏末收割季）的氛围。","与之相关的词：hay（干草）、meadow（草地/牧草地，通常更自然、不一定用于收割）、pasture（牧场，强调放牧）、harvest（收割）。"]}
{"word":"hayfields","summary":{"en":"Hayfields are fields where hay is grown and cut for animal feed.","zh":"Hayfields 指种植并收割牧草来制作干草饲料的田地（干草地）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"fields where grass or other plants are grown and cut to make hay (dried animal feed).","zh":"用来种植并收割牧草以制作干草（牲畜饲料）的田地；干草地。"},"examples":[{"en":"In late summer, the hayfields turn golden before the harvest.","zh":"夏末时，干草地在收割前会变成一片金黄。"},{"en":"We walked along the edge of the hayfields and heard crickets in the grass.","zh":"我们沿着干草地的边走，听到草丛里的蟋蟀叫。"},{"en":"Farmers cut the hayfields when the weather is dry.","zh":"天气干燥时，农民会收割干草地。"}]}],"synonyms":["hay meadows","meadows","fields"],"phonetic":"/ˈheɪˌfiːldz/","extraExplanation":["“hayfield”由 hay（干草）+ field（田地）构成；“hayfields”是复数形式，常见于描写乡村景色或农业活动的语境。","在英语文化里，hayfields 常让人联想到夏季收割（haymaking）以及乡村田园风光，文学作品中也常用来营造宁静、开阔的画面感。"]}
{"word":"hayfork","summary":{"en":"A farm tool (or the act of using it) for moving hay.","zh":"用于搬运干草的农具（或使用它搬运干草的动作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tool with a long handle and usually two or more long, pointed prongs, used for lifting and moving hay.","zh":"干草叉（长柄、通常有两根或多根尖齿，用来叉起和搬运干草的工具）。"},"examples":[{"en":"He used a hayfork to load hay onto the wagon.","zh":"他用干草叉把干草装到马车上。"},{"en":"The farmer leaned the hayfork against the barn wall.","zh":"农夫把干草叉靠在谷仓墙边。"}]},{"partOfSpeech":"v.","definition":{"en":"To lift, move, or toss something (especially hay) with a hayfork.","zh":"用干草叉搬运/翻抛（尤指干草）。"},"examples":[{"en":"They spent the afternoon hayforking bales into the loft.","zh":"他们花了一下午用干草叉把草捆叉到阁楼里。"}]}],"synonyms":["pitchfork","hay fork"],"phonetic":"/ˈheɪˌfɔrk/","extraExplanation":["“hayfork”在美式英语里更常见于乡村/农场语境。现代农业中也可能用“pitchfork”（草叉/叉子）作更通用的说法；不过“hayfork”更强调用途是处理干草。","在一些文学或乡土叙事中，hayfork常被用来营造田园、农忙或乡村生活的画面。"]}
{"word":"hayforks","summary":{"en":"Hayforks are farm tools with prongs, used to lift and move hay.","zh":"Hayforks 指带叉齿的农具，用来挑起、搬运干草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of hayfork) A long-handled farm tool with several prongs, used for lifting and moving loose hay or straw.","zh":"（hayfork 的复数）一种长柄的农具，带有多根叉齿，用来挑起、搬运松散的干草或稻草。"},"examples":[{"en":"The workers used hayforks to load the hay onto the wagon.","zh":"工人们用干草叉把干草装上马车。"},{"en":"After the storm, we stacked the wet hay with hayforks so it could dry.","zh":"暴风雨后，我们用干草叉把潮湿的干草堆起来晾干。"}]}],"synonyms":["hay forks","pitchforks","hay forks (two-word spelling)"],"phonetic":"/ˈheɪˌfɔrks/","extraExplanation":["在现代英语里更常见的写法是两个词：hay fork；也会看到合写 hayfork。含义相同。","这种工具常出现在农场语境中，和 pitchfork（干草叉/草叉，常用于草料、堆肥等）很接近；hayfork 更强调“搬运干草”。"]}
{"word":"haygrower","summary":{"en":"A haygrower is someone who grows hay for animal feed.","zh":"haygrower 指种植干草、用于牲畜饲料的人或企业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or business that grows hay (grass or other plants cut, dried, and stored as animal feed).","zh":"种植干草（把草或其他植物割下、晒干并储存，用作牲畜饲料）的人或企业；干草种植户。"},"examples":[{"en":"The haygrower cut the field in early June to avoid the summer heat.","zh":"干草种植户在六月初就把田里的草割了，以避开盛夏高温。"},{"en":"Local haygrowers supply feed for horse farms in the area.","zh":"当地的干草种植户为周边的马场提供饲料。"}]}],"synonyms":["hay farmer","hay producer","forage grower"],"phonetic":"/ˈheɪˌɡroʊ.ɚ/","extraExplanation":["“haygrower”是复合词（hay + grower），更常见的写法是分开或加连字符：hay grower / hay-grower。在北美农业语境里很常用，尤其在讨论干草收割（haymaking）、打捆（baling）和给牛马等牲畜提供饲料时。"]}
{"word":"haying","summary":{"en":"“Haying” means making hay—cutting and drying grass—either as a noun (the activity) or as the -ing form of the verb “hay.”","zh":"“haying”指制作干草（割草并晒干），既可作名词表示“收干草/打草这件事”，也可作动词的-ing形式表示“正在打草”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of cutting grass or other plants and drying them to make hay.","zh":"割草并晒干（或烘干）以制作干草的过程；打草、收干草。"},"examples":[{"en":"Haying usually happens in early summer, when the weather is dry.","zh":"打草通常在初夏进行，因为那时天气比较干燥。"},{"en":"During haying season, the whole farm is busy from morning to night.","zh":"在收干草的季节，整个农场从早到晚都很忙。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “hay”: to cut and dry grass to make hay.","zh":"“hay”的现在分词：割草并晒干以制成干草；在打草。"},"examples":[{"en":"They’re haying the field today because the forecast is sunny.","zh":"因为预报是晴天，他们今天在田里打草。"},{"en":"We spent the weekend haying and stacking bales in the barn.","zh":"我们周末一直在打草、把草捆堆进谷仓。"}]}],"synonyms":["making hay","haymaking"],"phonetic":"/ˈheɪ.ɪŋ/","extraExplanation":["“haying”多见于农业语境，尤其在美国乡村生活中很常见。它通常包括：割草（cut）、翻晒/晾干（dry/cure）、打捆（bale）、入库（store）。天气很关键：雨会让草发霉或营养下降，所以人们常趁连续晴天抓紧完成。","相关表达：haying season（收干草季）、hay bale（草捆）、hayloft（谷仓楼上的草垛间）。"]}
{"word":"hayings","summary":{"en":"“Haying” means making hay (cutting and drying grass). “Hayings” is a rare plural form.","zh":"“haying”指“割草并晒成干草”。“hayings”是较少见的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or activity of cutting, drying, and storing grass as hay (farm work)","zh":"割草、晾晒并储存成干草的过程或工作（农活）"},"examples":[{"en":"Haying usually happens in early summer when the weather is dry.","zh":"割草晒干草通常在初夏、天气干燥时进行。"},{"en":"The farmers worked late because rain would ruin the haying.","zh":"农民们干到很晚，因为下雨会毁掉晒干草的工作。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “hay”: to make hay by cutting and drying grass","zh":"“hay”的现在分词：把草割下并晒干做成干草"},"examples":[{"en":"They are haying the field today.","zh":"他们今天在那块地里割草晒干草。"},{"en":"We spent the weekend haying and stacking bales.","zh":"我们周末一直在割草晒干草并把草捆堆起来。"}]}],"synonyms":["making hay","haymaking"],"phonetic":"/ˈheɪɪŋ/","extraExplanation":["“hayings”通常是名词复数，表示“多次/多处的晒干草作业”，但在现代英语里更常用不可数名词“haying”，或直接说“the haying season / haying work”。如果你想表达“拥有（having）”，那是另一个词：having。"]}
{"word":"haylage","summary":{"en":"Haylage is partially dried forage that is stored airtight and lightly fermented for animal feed.","zh":"Haylage 指半干饲草在密封条件下轻度发酵保存的饲料，常用于喂马和牛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Haylage: grass or other forage that is cut, partly dried (wilted), then tightly wrapped or stored airtight so it ferments slightly and can be fed to livestock (especially horses and cattle). It is usually wetter than hay but drier than silage.","zh":"青贮干草（haylage）：将牧草等饲草割下后先短暂晾晒（半干/萎蔫），再密封包裹或在缺氧环境中储存，使其轻度发酵，用来喂养家畜（常见于马、牛）。通常比干草更湿，但比青贮（silage）更干。"},"examples":[{"en":"Many horse farms use haylage in winter because it keeps well when stored airtight.","zh":"很多马场冬天会用青贮干草，因为在密封储存时很耐放。"},{"en":"If haylage is not wrapped properly, it can spoil and become unsafe for animals.","zh":"如果青贮干草包裹不严，就可能变质，甚至对动物不安全。"}]}],"synonyms":["wrapped forage","baleage"],"phonetic":"/ˈheɪlɪdʒ/","extraExplanation":["在英语里，haylage 是由 hay（干草）+（si）lage（青贮）组合而来，用来强调“介于干草和青贮之间”的保存方式。常见包装形式是塑料膜裹包的圆捆（bale）。","和马相关的语境里，人们常提到干草粉尘（dust）问题：优质 haylage 往往粉尘更少，但因为含水量更高、又会发酵，所以对密封与卫生要求更高。","相关词：hay（干草）、silage（青贮饲料）、wrapped bale（裹包草捆）、forage（饲草）。"]}
{"word":"haylages","summary":{"en":"“Haylages” is the plural of “haylage,” a type of partially dried, airtight-fermented animal feed.","zh":"“Haylages”是“haylage”的复数，指部分晾干后密封发酵的动物饲料（干青贮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"haylage (plural: haylages): grass or other forage that is cut, partly dried, and then wrapped or stored airtight so it ferments slightly, used as feed for animals (especially horses and cattle).","zh":"干青贮（复数：haylages）：将牧草等饲草割下后先部分晾干，再密封包膜或密闭储存，使其轻微发酵的一种动物饲料（尤用于马和牛）。"},"examples":[{"en":"The farm makes haylage in spring to feed the cattle through winter.","zh":"农场在春季制作干青贮，用来在冬季喂牛。"},{"en":"Haylage must be wrapped well to keep air out.","zh":"干青贮必须包得严实，避免空气进入。"},{"en":"Some horses do better on haylage than on dry hay.","zh":"有些马吃干青贮比吃干草更适应。"}]}],"synonyms":["silage","forage","fodder"],"phonetic":"/ˈheɪlɪdʒ/","extraExplanation":["“haylages”通常只是“haylage”的复数形式；更常见的词条写法是单数“haylage”。","haylage 介于 hay（干草）和 silage（青贮）之间：含水量一般比干草高、比青贮低，因此需要密封保存，开封后也更容易变质，需要尽快用完。","在英语农业语境中也常见搭配：make haylage（制作干青贮）、haylage bale（干青贮草捆）、wrapped haylage（包膜干青贮）。"]}
{"word":"haylift","summary":{"en":"A haylift is a device used on farms to lift and move hay, often into a barn loft.","zh":"haylift 指农场里用来提升和搬运干草的装置，常用于把干草运进谷仓阁楼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or device used to lift and move hay (for example, from the ground up into a barn or loft)","zh":"干草升降机；运草装置（用于把干草提升、搬运到谷仓或阁楼等处的机器/装置）"},"examples":[{"en":"The farmers used a haylift to move bales into the loft.","zh":"农民用干草升降机把草捆运到阁楼里。"},{"en":"Be careful around the haylift—keep hands and clothing away from moving parts.","zh":"在干草升降机附近要小心——手和衣物要远离运转部件。"}]}],"synonyms":["hay elevator","hay hoist","hay bale lift"],"phonetic":"/ˈheɪˌlɪft/","extraExplanation":["“Haylift”多见于农业/农场语境，尤其是在谷仓（barn）和阁楼（loft）里储存干草的场景。不同地区也可能更常说 hay elevator / hay hoist。"]}
{"word":"hayloft","summary":{"en":"A hayloft is the upper storage space in a barn used for keeping hay.","zh":"hayloft 指谷仓里用来储存干草的上层阁楼空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loft (upper storage space) in a barn where hay is stored","zh":"（谷仓里的）干草阁楼；堆放干草的上层储藏空间"},"examples":[{"en":"They stored the winter hay in the hayloft above the stalls.","zh":"他们把过冬的干草存放在畜栏上方的干草阁楼里。"},{"en":"Dust floated in the sunlight coming through the hayloft window.","zh":"阳光从干草阁楼的窗户照进来，尘埃在光束里飘浮。"}]}],"synonyms":["loft","barn loft"],"phonetic":"/ˈheɪ.lɔft/","extraExplanation":["在北美乡村文化里，barn（谷仓）常有一个loft（阁楼/夹层）用来储存干草。把干草放在上层有助于保持干燥，也方便从上往下投喂给马或牛等牲畜。","这个词带有很强的田园、农场意象，因此在小说或歌词里常被用来营造“乡村/旧时生活/木质谷仓”的氛围。"]}
{"word":"haylofts","summary":{"en":"Haylofts are the upper storage spaces in barns where hay is kept.","zh":"Haylofts 指谷仓里存放干草的阁楼（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hayloft: a loft (upper space) in a barn where hay is stored.","zh":"hayloft 的复数：谷仓里用于存放干草的阁楼/上层空间。"},"examples":[{"en":"The farmer stored bales of hay in the haylofts to keep them dry.","zh":"农夫把一捆捆干草存放在干草阁楼里，以保持干燥。"},{"en":"We climbed up to the haylofts and looked down into the barn.","zh":"我们爬上干草阁楼，从上面俯看谷仓。"}]}],"synonyms":["barn lofts","lofts"],"phonetic":"/ˈheɪ.lɔft/","extraExplanation":["“Haylofts”是复数形式；字典里更常见的词条是单数“hayloft”。在乡村题材的故事或电影里，hayloft常用来营造“农场/谷仓”的场景氛围。"]}
{"word":"haymaker","summary":{"en":"A haymaker is a very powerful swinging punch, or (figuratively) a decisive, high-impact move or argument.","zh":"haymaker 指一记力量很大的摆拳/重拳，也可比喻为具有决定性冲击力的“重磅一击”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very strong swinging punch, especially one aimed at knocking someone out.","zh":"（尤指为击倒对手的）重拳、猛击（通常是大幅度挥出的拳）。"},"examples":[{"en":"He threw a haymaker and missed, leaving himself open.","zh":"他挥出一记重拳却打空了，反而把自己暴露在对方面前。"},{"en":"In the last round, she landed a haymaker that ended the fight.","zh":"在最后一回合，她打中一记重拳，比赛就此结束。"}]},{"partOfSpeech":"n.","definition":{"en":"A powerful, decisive action or argument meant to have a big impact (often in politics, business, or debate).","zh":"（在政治、商业或辩论中）强有力、决定性的举动或论点；“重磅一击”。"},"examples":[{"en":"The report was a haymaker that changed public opinion overnight.","zh":"这份报告像一记重磅一击，一夜之间改变了舆论。"},{"en":"She ended her speech with a haymaker: a simple story everyone remembered.","zh":"她用一个“重磅”收尾：一个人人都记得的简单故事。"}]}],"synonyms":["power punch","knockout punch","big swing","heavy blow","bombshell (figurative)"],"phonetic":"/ˈheɪˌmeɪkər/","extraExplanation":["“haymaker”字面意思是“割（打）干草的人”，来自农场劳动时挥动长柄工具（如草叉、镰刀）的那种大幅度摆动。拳击里的“haymaker punch”就借用了这种夸张、甩动式的动作形象。","语气与使用场景：比起中性词“strong punch”，haymaker更口语、更有画面感；用于比喻时也常带“出其不意、冲击力很大”的感觉。"]}
{"word":"haymakers","summary":{"en":"Haymakers are usually powerful, wide swinging punches; more rarely, the word can mean people who make hay.","zh":"haymakers 通常指（拳击等中的）大幅度挥出的重拳；较少情况下也可指割草制干草的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wide, swinging punch (especially in boxing) that is meant to be very powerful","zh":"（尤指拳击中）大幅度挥出的重拳；猛力一击"},"examples":[{"en":"He tried to finish the fight with a haymaker, but he missed.","zh":"他想用一记重拳结束比赛，但打空了。"},{"en":"The argument ended when she landed a verbal haymaker: “You lied to everyone.”","zh":"争论在她抛出一句“语言重击”后结束了：“你对所有人都撒了谎。”"}]},{"partOfSpeech":"n.","definition":{"en":"a person who makes or cuts hay (less common)","zh":"割草制干草的人；干草工（较少见）"},"examples":[{"en":"In the summer, he worked as a haymaker on a nearby farm.","zh":"夏天他在附近的农场当割草制干草的工人。"}]}],"synonyms":["swing","big punch","roundhouse","wild punch"],"phonetic":"/ˈheɪˌmeɪkər/","extraExplanation":["“haymaker”作为“重拳”的意思来自农活意象：挥镰割草（making hay）时手臂会做出很大幅度的横向挥动，这种动作像拳击里从侧面抡出去的拳，因此引申为“又大又猛、但往往比较冒险、容易落空的挥拳”。在日常英语中也常被比喻为“强力一击/致命一招”（包括语言或策略上的猛烈打击）。"]}
{"word":"haymaking","summary":{"en":"Haymaking is the process of making hay by cutting and drying grass.","zh":"Haymaking 指通过割草并晾晒来制作干草的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the work or process of cutting grass and drying it to make hay (dried grass used as animal feed)","zh":"割草并晾晒制成干草的工作/过程（干草用于喂养牲畜）"},"examples":[{"en":"Haymaking usually happens in early summer when the weather is dry.","zh":"制干草通常在初夏进行，那时天气比较干燥。"},{"en":"After a week of haymaking, the farmers stacked the hay in the barn.","zh":"经过一周的制干草工作后，农民把干草堆进了谷仓。"},{"en":"The smell of fresh-cut grass during haymaking is part of country life.","zh":"制干草时新割青草的气味，是乡村生活的一部分。"}]}],"synonyms":["making hay","hay harvest","hay production"],"phonetic":"/ˈheɪˌmeɪkɪŋ/","extraExplanation":["“haymaking”常见于英美乡村语境，尤其与夏季农事、牧场和奶牛/马匹饲料相关。现代农业中也会用机械打捆（bale hay）。","它也常让人联想到谚语/习语 “Make hay while the sun shines.”（趁着机会好就赶紧行动），源自干草必须在晴天晾干这一现实经验。"]}
{"word":"haymarket","summary":{"en":"Haymarket can mean a market for hay, a place name (like in London), or the historic 1886 Haymarket Affair in Chicago.","zh":"Haymarket 可指干草市场、一些城市的地名（如伦敦），也可指芝加哥1886年的“干草市场事件”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a market where hay is bought and sold; by extension, an area known for selling hay or animal feed","zh":"干草市场；（引申）以买卖干草或饲料闻名的市场/地区"},"examples":[{"en":"Farmers used to bring wagonloads of hay to the haymarket every week.","zh":"农民过去每周都会把一车车干草拉到干草市场去卖。"},{"en":"The old haymarket has been turned into a modern shopping area.","zh":"老干草市场已经被改造成现代商业区。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun) for districts or streets in some cities, such as Haymarket in London","zh":"（专有名词）一些城市中的地名，如伦敦的 Haymarket（海马基特）地区/街名"},"examples":[{"en":"We met near Haymarket in central London.","zh":"我们在伦敦市中心的海马基特附近见面。"},{"en":"Take the Tube to Piccadilly Circus, then walk toward Haymarket.","zh":"坐地铁到皮卡迪利广场，然后步行往海马基特方向走。"}]},{"partOfSpeech":"n.","definition":{"en":"the “Haymarket Affair,” a major 1886 labor protest and bombing in Chicago that became a symbol in labor history","zh":"“干草市场事件”（Haymarket Affair）：1886年发生在芝加哥的重要劳工抗议与爆炸事件，后成为劳工史上的象征"},"examples":[{"en":"The Haymarket Affair is often discussed in courses on American labor history.","zh":"干草市场事件常在美国劳工史课程中被讨论。"},{"en":"Some speeches referred to Haymarket as a turning point for workers’ rights.","zh":"一些演讲把干草市场事件称为工人权利的转折点。"}]}],"synonyms":["hay market"],"phonetic":"/ˈheɪˌmɑrkɪt/","extraExplanation":["“Haymarket”由 hay（干草）+ market（市场）构成，字面意思很直观。历史上许多城市曾有专门交易干草的市场，用来供马匹与牲畜饲料，因此常见于老城的地名。","“Haymarket Affair（干草市场事件）”发生在1886年芝加哥，最初与争取八小时工作制的集会相关。事件因爆炸与后续审判而具有争议，但在国际劳工运动与纪念传统中影响很大。"]}
{"word":"haymish","summary":{"en":"Haymish (more commonly spelled Hamish) is a name, especially Scottish, related to “James.”","zh":"Haymish（更常见拼法为 Hamish）是一个名字，尤其带苏格兰色彩，来源上与“James（詹姆斯）”有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (first name), especially in Scotland; a Scottish form of “James.”","zh":"男性名字（常见于苏格兰）；“James（詹姆斯）”的苏格兰形式。"},"examples":[{"en":"Hamish is a common name in Scotland.","zh":"Hamish 是苏格兰比较常见的名字。"},{"en":"I met a guy named Hamish at the conference.","zh":"我在会议上认识了一个叫 Hamish 的人。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Haymish will see you now.","zh":"Haymish 医生现在会见你。"}]}],"synonyms":["Hamish","James"],"phonetic":"/ˈheɪmɪʃ/","extraExplanation":["“Hamish”源自苏格兰盖尔语对“James”的称呼形式（与盖尔语名字 Seumas 有关），因此在英语语境里常被认为带有明显的苏格兰文化色彩。","你输入的拼写是“haymish”。更常见的拼法是“Hamish”。如果这是人名的特殊拼写（例如品牌名、艺名或家庭姓氏），也可能保留这种写法。"]}
{"word":"haymow","summary":{"en":"A haymow is a large pile of hay or the part of a barn (hayloft) where hay is stored.","zh":"haymow 指一大堆干草（草垛），也可指谷仓里用来存放干草的空间（草阁楼/草棚上层）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stack or large pile of hay (often stored in a barn or hayloft).","zh":"一大堆干草；（常指在谷仓或草棚里堆放的）草垛。"},"examples":[{"en":"The haymow in the barn was high enough to reach the rafters.","zh":"谷仓里的草垛堆得很高，几乎够到屋梁。"},{"en":"In winter, the animals were fed from the haymow every morning.","zh":"冬天里，人们每天早上从草垛里取干草喂牲畜。"}]},{"partOfSpeech":"n.","definition":{"en":"the loft or area in a barn where hay is stored.","zh":"（谷仓里的）干草堆放处；草阁楼。"},"examples":[{"en":"He climbed the ladder to the haymow to toss down a bale of hay.","zh":"他爬上梯子到草阁楼，把一捆干草扔下来。"}]}],"synonyms":["haystack","haypile","hayloft (related)","mow (older/related)"],"phonetic":"/ˈheɪ.maʊ/","extraExplanation":["“haymow”在美式英语里带有乡村/农场语境，常见于描写传统谷仓生活的文字中。词尾“mow”在这里不是“割草”的动词，而是古义，指“堆放、草垛或储草处”。"]}
{"word":"haymows","summary":{"en":"Haymows are large stored piles of hay, often in a barn loft.","zh":"haymows 指大堆储存的干草，常见于谷仓阁楼等地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of haymow: a large pile or stacked mass of hay, especially one stored in a barn loft or storage space.","zh":"haymow 的复数：一大堆（成垛的）干草，尤指存放在谷仓阁楼或储藏空间里的干草堆。"},"examples":[{"en":"In winter, the horses were fed from the haymows in the barn loft.","zh":"冬天里，马匹从谷仓阁楼里的干草堆取草喂养。"},{"en":"The old barn smelled sweet because the haymows had been stored there all summer.","zh":"那座老谷仓闻起来很香甜，因为整个夏天干草都堆放在里面。"}]}],"synonyms":["haystacks","piles of hay","hay piles"],"phonetic":"/ˈheɪmaʊz/","extraExplanation":["“haymow”在北美英语里较偏乡村/农业用语，常指谷仓里专门堆放干草的区域或干草堆本身（尤其是阁楼上的存草处）。现代口语里也常用更通用的说法如“haystack”（干草垛）或“pile of hay”（一堆干草）。","词源上，“mow”在这里不是“割草”的动词，而是名词用法，历史上有“堆放处、储藏堆”的意思（例如谷物堆放处）。"]}
{"word":"hayne","summary":{"en":"“Hayne” is mostly a dialect verb meaning “to spare/save” or “to protect,” and it can also be a surname or place-name.","zh":"“hayne”多为方言用法：作动词可表示“节省/省下”或“保护/庇护”，也可作姓氏或地名。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(dialect, mainly Scottish/Northern English) to spare or save (money, time, effort, resources); to keep in reserve.","zh":"（方言，主要见于苏格兰/英格兰北部）节省、省下（钱、时间、精力或资源）；留作备用。"},"examples":[{"en":"Try to hayne your money for the winter months.","zh":"尽量把钱省下来，留着过冬。"},{"en":"We should hayne our energy and not rush.","zh":"我们该省着点力气，别急着冲。"}]},{"partOfSpeech":"vt.","definition":{"en":"(dialect) to protect or shelter; to keep safe from harm.","zh":"（方言）保护、庇护；使免受伤害。"},"examples":[{"en":"The wall was built to hayne the garden from strong winds.","zh":"这堵墙是为了保护花园不受强风侵袭而建的。"},{"en":"He hayned the child behind him when the dog ran up.","zh":"狗冲过来时，他把孩子护在身后。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname or place-name (proper noun).","zh":"姓氏或地名（专有名词）。"},"examples":[{"en":"Dr. Hayne will see you now.","zh":"Hayne 医生现在可以见你了。"},{"en":"They traced the Hayne family back several generations.","zh":"他们把 Hayne 家族的谱系追溯了好几代。"}]}],"synonyms":["spare","save","conserve","protect","shelter"],"phonetic":"/heɪn/","extraExplanation":["“hayne”作动词时在现代标准英语中较少见，更常见于苏格兰或英格兰北部的方言/文学化用法；在日常英语里通常用 spare / save / conserve / protect 来表达。","发音通常与“hane / hain”接近；如果你是在名字里看到（如人名、地名），它一般读作 /heɪn/。"]}
{"word":"haypile","summary":{"en":"a stack of dried grass kept for feeding animals","zh":"用于喂养牲畜的干草堆"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pile or stack of hay (dried grass) stored for animal feed","zh":"（干草的）草堆；干草堆（用于储存作饲料）"},"examples":[{"en":"They built a haypile near the barn to keep the hay dry.","zh":"他们在谷仓附近堆了一个干草堆，好让干草保持干燥。"},{"en":"The cat was sleeping on the warm haypile.","zh":"那只猫正睡在暖乎乎的干草堆上。"}]}],"synonyms":["haystack","stack","pile"],"phonetic":"/ˈheɪˌpaɪl/","extraExplanation":["在农业语境里，haypile 常用来泛指“堆起来的干草”。更常见的近义表达还有 haystack（干草垛），通常指更高、更成形、像“垛/塔”一样的堆。不同地区和说话人对两者的区分程度不一。"],"etymology":"由 hay（干草）+ pile（堆）组合而成的复合词，字面意思就是“干草的堆”。","mnemonic":["hay=“干草/草料”，pile=“一堆”；合起来就是“干草一堆”。","联想：hay（像“黑”开头的音）+ pile（像“排”），记成“黑草一排一堆”。"]}
{"word":"hayrack","summary":{"en":"A hayrack is a rack or frame for holding hay, often used to store it or feed animals.","zh":"hayrack指用于放置干草的架子，常用来储存干草或给牲畜喂干草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a frame or rack used to hold and store hay, or to feed hay to animals (often in a barn or field).","zh":"干草架；（用于存放干草或给牲畜喂干草的）草料架（常见于谷仓或牧场）。"},"examples":[{"en":"The farmer filled the hayrack before winter.","zh":"农夫在冬天来临前把干草架装满。"},{"en":"The horses pulled hay from the hayrack and ate quietly.","zh":"马从草料架上扯下干草，安静地吃着。"}]}],"synonyms":["hay rack","hay feeder","feed rack"],"phonetic":"/ˈheɪˌræk/","extraExplanation":["在美式英语里，hayrack既可以指“存放干草的架子”，也常指“给马、牛等吃草用的草料架”（类似hay feeder/hay rack）。具体含义通常由语境决定。","在一些乡村活动中，hayrack ride（干草车兜风/干草车游览）指坐在装有干草垫子的平板车上游玩；这里的hayrack也可指这种用于运草的车架/车厢。"]}
{"word":"hayracks","summary":{"en":"Hayracks are racks or frames used for holding or feeding hay.","zh":"Hayracks 指用来放置或喂食干草的架子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rack or frame used to store, stack, or feed hay (plural: hayracks)","zh":"用来堆放、储存或喂食干草的架子/框架（复数：hayracks）"},"examples":[{"en":"The farmers loaded hay onto the hayracks before the rain came.","zh":"下雨前，农民把干草装到干草架上。"},{"en":"The horses ate quietly from the hayracks in the stable.","zh":"马在马厩里安静地从干草架上吃草。"}]}],"synonyms":["hay rack","hay feeder","feed rack","hay holder"],"phonetic":"/ˈheɪˌræk/","extraExplanation":["“hayrack”常见于农业和牧场语境。不同地区的hayrack外形不一：有的是固定在马厩/牛棚里的饲草架，有的是装在拖车或卡车上的框架，用来运送和堆放干草。阅读中看到复数“hayracks”，通常表示多个干草架或一排饲草架。"]}
{"word":"hayrake","summary":{"en":"A hayrake is a tool or machine that rakes cut hay into rows or piles.","zh":"hayrake 指把割下的草耙成条状或堆起的农具/农机（耙草机、干草耙）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a farm tool or machine used to gather cut hay into lines (windrows) or piles so it can dry or be collected","zh":"（农具/农机）耙草机；干草耙，用来把割下的草（hay）耙成条状（草垄）或堆起来，方便晾晒或收集"},"examples":[{"en":"After mowing the field, they used a hayrake to make neat rows of hay.","zh":"割完草地后，他们用耙草机把干草耙成整齐的条状。"},{"en":"The old hayrake sat behind the barn all winter.","zh":"那台旧耙草机整个冬天都放在谷仓后面。"}]}],"synonyms":["hay rake","rake (for hay)","windrower (related machine)"],"phonetic":"/ˈheɪˌreɪk/","extraExplanation":["“hayrake”也常写成两个词：hay rake。传统上它既可以指手动的“耙子”，也可以指拖拉机牵引的机械耙草机。","相关词：windrow（草垄/条状堆放的草）、rake（耙；用耙子整理）。"]}
{"word":"hayraker","summary":{"en":"A hayraker is someone who rakes and gathers hay in a field.","zh":"hayraker 指在田里用耙子翻动并收拢干草的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who rakes hay (gathers and turns cut grass to dry it, or collects it into rows)","zh":"耙草的人；把割下的草（干草）用耙子翻动、收拢成行的人"},"examples":[{"en":"The hayraker worked behind the mower, pulling the hay into neat windrows.","zh":"割草机后面，耙草的人把干草收拢成整齐的草行。"},{"en":"In the old photos, you can see hayrakers in the field at dawn.","zh":"在老照片里，你能看到清晨田里耙草的人。"}]}],"synonyms":["haymaker","farmhand","field hand","farm worker"],"phonetic":"/ˈheɪˌreɪkər/","extraExplanation":["“hayraker”是由 hay（干草）+ raker（耙草者/用耙子的人）组成的复合词，常见于农业语境。现代英语里更常说“farm worker”或更具体的“hay baler / ranch hand”，但在描写乡村生活或历史场景时，“hayraker”更形象。"]}
{"word":"hayrick","summary":{"en":"A hayrick is a large outdoor stack of hay, often called a haystack (especially in American English).","zh":"hayrick 指户外堆放的干草堆（草垛），美式英语更常说 haystack。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large stack of hay, usually built outdoors for storage","zh":"（通常在户外堆放的）干草堆；草垛"},"examples":[{"en":"The farmer covered the hayrick with a tarp before the rain.","zh":"下雨前，农夫用防水布把草垛盖了起来。"},{"en":"We walked past a hayrick on the way to the barn.","zh":"去谷仓的路上，我们从一座草垛旁走过。"}]}],"synonyms":["haystack","stack of hay","rick (of hay)"],"phonetic":"/ˈheɪ.rɪk/","extraExplanation":["“hayrick”是比较传统、偏英式的用词，现代美式英语里更常见的是“haystack”。“rick”原意与“堆放、堆成垛”有关，也可出现在“rick of wood”（一垛木柴）这类表达中。","在文学或乡村题材作品里，“hayrick”常用来营造田园、农场的意象；读到它时大多可直接理解为“草垛/干草堆”。"]}
{"word":"hayricks","summary":{"en":"“Hayricks” means large outdoor stacks of hay (plural of hayrick).","zh":"“hayricks”指干草堆（hayrick 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large stack (pile) of hay, usually built outdoors for storage","zh":"（通常在户外堆起用于储存的）干草堆"},"examples":[{"en":"The farmer covered the hayrick before the rain started.","zh":"下雨前，农夫把干草堆盖了起来。"},{"en":"We walked past a hayrick on the way to the barn.","zh":"我们去谷仓的路上经过了一个干草堆。"}]}],"synonyms":["haystack","stack of hay"],"phonetic":"ˈheɪˌrɪk","extraExplanation":["“hayricks”是“hayrick”的复数形式。这个词更偏英式/文学或乡村语境；在日常英语里更常见的是“haystack”（干草堆）。","在传统农业中，干草堆用于让干草保持干燥、便于喂养牲畜；现代农场也常见用机器打包成“hay bales”（干草捆）。"]}
{"word":"hayride","summary":{"en":"A hayride is a fun ride on a hay-filled wagon, often at farms or fall festivals.","zh":"hayride 指坐在铺满干草的马车/拖车上游玩，常见于农场或秋季节庆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ride on a wagon or truck filled with hay, usually for fun at a farm or autumn festival","zh":"（通常为娱乐的）干草车之旅；乘坐装满干草的马车/拖车（多见于农场或秋季节庆）"},"examples":[{"en":"We went on a hayride at the pumpkin patch.","zh":"我们在南瓜园坐了干草车。"},{"en":"The school organized a hayride for the fall festival.","zh":"学校为秋季庆典组织了干草车活动。"}]}],"synonyms":["wagon ride","farm ride"],"phonetic":"/ˈheɪˌraɪd/","extraExplanation":["“Hayride”是北美乡村与秋季活动中很常见的文化元素：人们坐在铺着干草的拖车上，通常由拖拉机或马牵引，边走边欣赏农场风景，常与采摘南瓜、玉米迷宫、篝火等活动搭配。","在一些文学与影视作品里，hayride常用来营造“乡村、怀旧、秋天、约会”的氛围。相关常见搭配：go on a hayride（去坐干草车）、take a hayride（乘坐干草车）。"]}
{"word":"hayrides","summary":{"en":"Hayrides are fun wagon rides on hay, common at farms and fall festivals.","zh":"hayrides 指坐在铺有干草的车上兜风的活动，常见于农场和秋季节庆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ride in a wagon or trailer filled with hay, usually pulled by a tractor or horses, often as a fun activity at farms or fall festivals.","zh":"坐在装满干草的马车或拖车上兜风（通常由拖拉机或马拉），多见于农场活动或秋季节庆，是一种娱乐项目。"},"examples":[{"en":"We went on a hayride at the pumpkin patch.","zh":"我们在南瓜农场坐了干草车。"},{"en":"The school planned hayrides for the Halloween event.","zh":"学校为万圣节活动安排了干草车游玩。"},{"en":"After the hayride, we warmed up with hot cider.","zh":"坐完干草车后，我们喝了热苹果酒取暖。"}]}],"synonyms":["wagon ride","tractor-pulled wagon ride","farm ride"],"phonetic":"/ˈheɪˌraɪd/","extraExplanation":["“hayride”在美国文化里很常见，尤其是秋天（fall/autumn）的农场活动：比如采摘南瓜（pumpkin patch）、玉米迷宫（corn maze）、丰收节（harvest festival）。通常大家坐在铺了干草的平板车上，沿着农场或乡间小路慢慢游览。","“hayrides”是复数形式，表示多次/多场干草车活动；单数是“a hayride”。有时也会看到写作“hay ride”，但更常用的拼写是连写“hayride”。"]}
{"word":"Hays","summary":{"en":"“Hays” can mean multiple things: the plural of “hay,” a surname/place name, or shorthand for the “Hays Code” in classic Hollywood.","zh":"“Hays”常见含义有三种：hay（干草）的复数、姓氏/地名，以及老好莱坞的“海斯法典（Hays Code）”的简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural form of “hay” (dried grass used as animal feed).","zh":"“hay（干草）”的复数：指用来喂养牲畜的干草。"},"examples":[{"en":"The farmers stacked the hays in the barn before the rain.","zh":"下雨前，农民把成堆的干草搬进了谷仓。"},{"en":"We bought several bales of hays for the horses.","zh":"我们给马买了好几捆干草。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) and also the name of some places, especially in the U.S. (e.g., Hays, Kansas).","zh":"姓氏；也可作地名（尤其在美国，例如堪萨斯州的 Hays）。"},"examples":[{"en":"Dr. Hays will see you now.","zh":"Hays 医生现在可以见你了。"},{"en":"She moved to Hays, Kansas for a new job.","zh":"她为了新工作搬到了堪萨斯州的海斯市（Hays）。"}]},{"partOfSpeech":"n.","definition":{"en":"short for the “Hays Code,” a set of rules that controlled what could be shown in many Hollywood movies (mainly from the 1930s to the 1960s).","zh":"“海斯法典（Hays Code）”的简称：曾在好莱坞电影中广泛限制可呈现内容的一套审查规则（主要在20世纪30年代至60年代）。"},"examples":[{"en":"The film was edited to satisfy the Hays Code.","zh":"这部电影为符合海斯法典而被剪辑修改。"},{"en":"Some directors used clever symbolism to get around Hays restrictions.","zh":"一些导演用巧妙的象征手法来绕开海斯法典的限制。"}]}],"synonyms":["hay (as the base word)","Hays Code (in the film-censorship sense)"],"phonetic":"/heɪz/","extraExplanation":["“Hays Code”得名于 Will H. Hays（威尔·H·海斯），他曾领导美国电影行业的自律机构。该法典对性、暴力、犯罪描写以及“不得冒犯宗教/道德”等内容有严格规定，对老好莱坞叙事方式影响很大。"]}
{"word":"hays","summary":{"en":"“Hays” most commonly means the plural of “hay” (dried grass used as animal feed), and it can also be a surname (Hays).","zh":"“Hays”最常见是“hay（干草）”的复数，也可以是姓氏（Hays）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “hay”: dried grass or plants used as food for animals (especially horses and cows).","zh":"“hay”的复数：干草；晒干的草或植物，常用作动物（尤指马、牛）的饲料。"},"examples":[{"en":"The farmer stored the hays in a barn for winter.","zh":"农夫把这些干草存放在谷仓里过冬。"},{"en":"Cows eat hays when fresh grass isn’t available.","zh":"没有新鲜牧草时，奶牛会吃干草。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname), as in “Hays”; sometimes refers to people, places, or titles with this name.","zh":"姓氏（如 Hays）；有时也指带有该名字的人、地名或作品名称。"},"examples":[{"en":"Her last name is Hays.","zh":"她的姓是 Hays。"}]}],"synonyms":["hay (for meaning 1)"],"phonetic":"/heɪz/","extraExplanation":["“Hays”在美国文化里常让人想到“The Hays Code（海斯法典/电影制作守则）”：20世纪中期好莱坞的一套自我审查规则，用来限制电影内容（例如暴力、性、粗口等）。这里的“Hays”来自人物Will H. Hays的姓。"]}
{"word":"hayseed","summary":{"en":"A (often insulting) word for a rural person seen as unsophisticated.","zh":"（常带贬义）指被认为不够世故的乡下人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person from the countryside, often used in a slightly insulting way to mean someone unsophisticated or naïve.","zh":"乡下人；乡巴佬（常带轻微贬义，指不够世故或天真）"},"examples":[{"en":"He moved to the city and tried hard not to sound like a hayseed.","zh":"他搬到城里后很努力不让自己听起来像个乡巴佬。"},{"en":"The comedian joked about being a hayseed in his first year at college.","zh":"那位喜剧演员拿自己大学第一年“土里土气”开玩笑。"},{"en":"Don’t call her a hayseed—she just grew up on a farm.","zh":"别叫她乡巴佬——她只是在农场长大的。"}]}],"synonyms":["hick","country bumpkin","rube","yokel"],"phonetic":"/ˈheɪˌsid/","extraExplanation":["这个词主要用于美式英语，语气常带嘲讽或轻视，类似于“country bumpkin / hick”。在正式场合或不熟的人面前使用可能显得不礼貌。","字面意思来自“hay”（干草）+“seed”（种子），带有“身上还沾着干草籽、很土”的形象联想。"]}
{"word":"hayseeds","summary":{"en":"“Hayseeds” most commonly means rural people in an informal, sometimes insulting way; it can also literally mean seeds in hay.","zh":"“hayseeds”最常见指（带贬义的）乡下人/土包子；也可字面指干草里的草籽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, sometimes insulting) A person from the countryside, often suggesting they are unsophisticated or unfamiliar with city life; a “country bumpkin.” (Plural: hayseeds)","zh":"（非正式，常带贬义）乡下人、土包子；暗示不够“见过世面”、不熟悉城市生活的人。（复数：hayseeds）"},"examples":[{"en":"The comedian joked about being a hayseed when he first moved to New York.","zh":"那位喜剧演员开玩笑说自己刚搬到纽约时就是个“土包子”。"},{"en":"Don’t call them hayseeds—it’s rude and makes you sound arrogant.","zh":"别叫他们“土包子”——很没礼貌，而且显得你很傲慢。"},{"en":"They assumed we were hayseeds just because we came from a small town.","zh":"他们以为我们是“乡巴佬”，就因为我们来自小镇。"}]},{"partOfSpeech":"n.","definition":{"en":"Seeds found in hay (dried grass used as animal feed).","zh":"干草里的草籽（用于饲料的干草中夹带的种子）。"},"examples":[{"en":"Hayseeds can stick to your socks if you walk through a barn.","zh":"你走过谷仓时，干草里的草籽可能会粘在袜子上。"},{"en":"The farmer cleaned the hayseeds out of the trailer.","zh":"农夫把拖车里的草籽清理出来。"}]}],"synonyms":["country bumpkins","hicks","rub es","yokels","country folk"],"phonetic":"/ˈheɪˌsiːd/","extraExplanation":["“hayseed”用来形容人时，语气通常带嘲讽或贬低，类似“乡巴佬/土包子”。如果你只是想中性地表达“来自乡村的人”，更礼貌的说法是“a rural person”“someone from the countryside”。","在美式英语里，这个词常出现在幽默、自嘲或刻板印象的语境中；对陌生人直接使用容易冒犯。"]}
{"word":"haysel","summary":{"en":"Hazel refers to a nut-bearing tree/shrub or a light brownish-green color, often describing eyes.","zh":"Hazel 指榛树/榛木，也指榛色（浅棕绿或黄褐色），常用来形容眼睛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small tree or shrub that produces hazelnuts; also the wood from this plant.","zh":"榛树（结榛子的灌木或小乔木）；也指榛木。"},"examples":[{"en":"We picked hazelnuts from a hazel tree in the fall.","zh":"秋天我们从一棵榛树上采了榛子。"},{"en":"The walking stick was made of hazel wood.","zh":"这根手杖是用榛木做的。"}]},{"partOfSpeech":"adj.","definition":{"en":"A light brownish-green color, especially used to describe eyes.","zh":"浅棕绿/黄褐色（常用来形容眼睛的颜色）。"},"examples":[{"en":"She has hazel eyes that look green in bright light.","zh":"她的榛色眼睛在强光下看起来偏绿。"},{"en":"He wore a hazel jacket.","zh":"他穿了一件黄褐色的夹克。"}]}],"synonyms":["hazelnut (tree/nut context)","light brown","brownish green"],"phonetic":"/ˈheɪzəl/","extraExplanation":["你输入的“haysel”更常见的拼写是“hazel”。“Hazel”既可指植物（榛树/榛木），也可作颜色词（榛色，常描述眼睛）。","文化小提示：在英语文学里，“hazel”常被用来营造自然、森林、秋季收获等意象；“hazel eyes”在日常中是很常见的外貌描述。"]}
{"word":"hayshock","summary":{"en":"A hayshock is a small stack of hay made in a field.","zh":"hayshock 指在田里临时堆起的小干草堆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small stack (or pile) of hay, usually made in a field while drying or before being stored","zh":"（田野里临时堆起的）小干草堆，干草垛"},"examples":[{"en":"After cutting the grass, the farmers built hayshocks across the field to dry.","zh":"割完草后，农民在田里堆起一堆堆干草，让它们晾干。"},{"en":"The cows wandered past the hayshocks at the edge of the meadow.","zh":"奶牛在草地边缘的小干草堆旁慢慢走过。"}]}],"synonyms":["haycock","haystack (larger)","stack of hay"],"phonetic":"/ˈheɪˌʃɑk/","extraExplanation":["“hayshock”在现代英语中较少见，更常见的同义词是“haycock”（小干草堆）或更泛的“haystack”（大干草垛）。在一些乡村题材/古典文学描写田园景象时，可能会见到这种词。"]}
{"word":"haystack","summary":{"en":"A haystack is a large pile of hay; it’s also best known from the idiom “a needle in a haystack,” meaning something very hard to find.","zh":"haystack 指一大堆干草；也常见于习语“a needle in a haystack（大海捞针）”，表示很难找到的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large pile or stack of dried grass (hay), usually stored for animal feed.","zh":"一大堆（或一垛）干草，通常储存起来作为牲畜饲料。"},"examples":[{"en":"The farmer built a haystack near the barn to feed the cows in winter.","zh":"农夫在谷仓旁堆了一垛干草，冬天用来喂牛。"},{"en":"We could smell the sweet, dry hay as we walked past the haystack.","zh":"我们走过干草垛时，能闻到干草甜甜的、干燥的味道。"}]},{"partOfSpeech":"phrase","definition":{"en":"Used in the phrase “a needle in a haystack,” meaning something extremely hard to find in a large, messy set of things.","zh":"用于短语“a needle in a haystack”（大海捞针），指在大量杂乱的事物中极难找到的东西。"},"examples":[{"en":"Finding that one email from last year feels like searching for a needle in a haystack.","zh":"要找到去年那封邮件，感觉就像大海捞针。"},{"en":"Without a clear clue, the missing key was a needle in a haystack.","zh":"没有明确线索的话，那把丢失的钥匙简直是大海捞针。"}]}],"synonyms":["haypile","stack of hay","mound (of hay)"],"phonetic":"/ˈheɪstæk/","extraExplanation":["“haystack”由 hay（干草）+ stack（堆、垛）组成，字面意思很直观。","“a needle in a haystack”这个习语常用于形容信息量巨大但线索很少的情况（比如在海量文件、数据、网页里找一个目标）。"]}
{"word":"haystacker","summary":{"en":"a person (or sometimes a machine) that stacks hay","zh":"堆放干草的人（有时也指堆草的机器）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who stacks hay into a haystack; someone who gathers and piles hay during harvest.","zh":"堆草人；把干草堆成草垛的人（收割季把干草收集并堆放的人）。"},"examples":[{"en":"In the old photos, the haystackers worked from dawn to dusk in the fields.","zh":"在老照片里，堆草人从清晨到傍晚都在田里干活。"},{"en":"My grandfather was a haystacker as a teenager every summer.","zh":"我爷爷十几岁时每年夏天都会去当堆草人。"}]},{"partOfSpeech":"n.","definition":{"en":"A machine or device used to stack hay (less common).","zh":"堆草机；用于把干草堆起来的机器（较少见）。"},"examples":[{"en":"The farm upgraded to a haystacker to reduce manual labor.","zh":"农场换了堆草机，以减少人工劳动。"}]}],"synonyms":["haymaker","farmhand","field hand","stacker"],"phonetic":"/ˈheɪˌstækər/","extraExplanation":["在现代农业里，更常见的相关词是 baler（打包机）和 hay bale（草捆）。haystacker 更偏传统/口语化的说法，常见于描写过去的农活或乡村生活的语境。"],"etymology":"由 hay（干草）+ stack（堆、垛）+ -er（做某事的人/物）构成，字面意思就是“堆干草的人/机器”。","mnemonic":["把它拆开记：hay（干草）+ stack（堆）+ er（人/器）=“堆干草的人/机器”。","联想中文“草垛”：haystack（草垛）+ -er（做的人）→“堆草垛的人”。"]}
{"word":"haystacks","summary":{"en":"“Haystacks” is the plural of “haystack,” meaning piles of dried grass for animal feed, and it can also be used figuratively in expressions like “a needle in a haystack.”","zh":"“haystacks”是“haystack”的复数，指干草堆/草垛，也可作比喻，常见于“a needle in a haystack（大海捞针）”等表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"large piles or bundled stacks of dried grass (hay), usually stored as animal feed","zh":"（干草的）草垛；干草堆（通常用作牲畜饲料）"},"examples":[{"en":"The farmer stacked the haystacks near the barn before the rain.","zh":"下雨前，农夫把草垛堆在谷仓旁。"},{"en":"In late summer, you can often see haystacks in the fields.","zh":"夏末时，你常常能在田野里看到草垛。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a place or situation where it is very hard to find something small or specific","zh":"（比喻）难以找到特定事物的地方/情境；如同“大海捞针”的范围"},"examples":[{"en":"Finding that one email in my inbox felt like looking for a needle in a haystack.","zh":"在收件箱里找那封邮件，感觉就像大海捞针。"},{"en":"The clue was hidden in a haystack of information.","zh":"线索藏在一大堆信息里，很难找。"}]}],"synonyms":["piles of hay","stacks of hay","hay piles"],"phonetic":"/ˈheɪˌstæks/","extraExplanation":["“haystack”既指真实的“草垛”，也常出现在习语“a needle in a haystack”（大海捞针）中，用来强调“目标很小、范围很大、几乎找不到”。","在英语文化里，草垛常见于乡村与农场场景，因此在文学或影视中也常用来营造“田园、乡村、收获季”的氛围。"]}
{"word":"haysuck","summary":{"en":"“Haysuck” is not standard English; it’s likely a misspelling (often of “haystack”).","zh":"“haysuck” 不是标准英语用词；很可能是拼写错误（常见是把 “haystack/干草堆” 打错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form; it is not a common English word in standard dictionaries. It is often a typo for “haystack” (a large pile of dried hay).","zh":"非标准或拼写错误形式；在标准英语词典中并不常见。常见情况是把 “haystack”（干草堆）打错了。"},"examples":[{"en":"I can’t find “haysuck” in a dictionary—did you mean “haystack”?","zh":"我在词典里找不到 “haysuck”——你是不是想写 “haystack”（干草堆）？"},{"en":"The needle-in-a-haystack idea is common, but “haysuck” isn’t the usual spelling.","zh":"“大海捞针/在干草堆里找针”的说法很常见，但 “haysuck” 不是常见拼法。"}]}],"phonetic":"/ˈheɪsʌk/","extraExplanation":["“haysuck” 不是常见标准词汇。最可能的目标词是 “haystack”（干草堆），也常出现在习语 “a needle in a haystack”（大海捞针）里。","如果你是在某个游戏ID、网络昵称、方言/俚语或特定圈子里看到 “haysuck”，告诉我上下文（完整句子/来源），我可以帮你判断它是不是专有名词或特定用法。"]}
{"word":"haythorn","summary":{"en":"Haythorn is a rare variant spelling of hawthorn, a thorny flowering tree/shrub with red berries.","zh":"Haythorn是hawthorn的不常见拼写变体，指一种带刺、会开花并结红色浆果的树/灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a less common spelling or variant of “hawthorn,” a thorny shrub or small tree with white/pink blossoms and red berries (haws), often used in hedges.","zh":"“hawthorn（山楂/刺山楂）”的不常见拼写变体：一种带刺的灌木或小树，春季开白色/粉色小花，结红色浆果（haws），常用来做树篱。"},"examples":[{"en":"A row of haythorn lined the old country lane like a natural fence.","zh":"一排haythorn沿着乡间小路生长，像天然的篱笆。"},{"en":"In spring, the haythorn blossoms fill the air with a light scent.","zh":"春天，haythorn的花开时空气里有淡淡的香味。"}]}],"synonyms":["hawthorn","maythorn","thorn tree"],"phonetic":"/ˈheɪθɔrn/","extraExplanation":["“haythorn”在现代英语里非常少见，更多时候人们用标准拼写“hawthorn”。如果你是在植物、园艺、文学或地名中看到“haythorn”，通常可以按“hawthorn”来理解。","Hawthorn在英国乡村篱笆（hedgerow）文化中很常见，也常被称为“maythorn”，因为它常在五月开花；在民俗与文学里，它既象征春天与更新，也可能与“带刺的界限/保护”有关。"]}
{"word":"haytime","summary":{"en":"Haytime means either a peak period of success or, literally, the season when hay is made.","zh":"Haytime既可指“鼎盛期/全盛期”，也可字面指“收割、制作干草的季节”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the best or most successful time in someone’s life, a group’s history, or something’s popularity; a peak period","zh":"（人生、团体或事物）最辉煌/最鼎盛的时期；全盛期"},"examples":[{"en":"That band was huge in its haytime, but you don’t hear them much now.","zh":"那支乐队在鼎盛时期非常红，但现在很少有人提起了。"},{"en":"Many fans think the team’s haytime was in the 1990s.","zh":"很多粉丝认为那支球队的全盛期是在20世纪90年代。"}]},{"partOfSpeech":"n.","definition":{"en":"the season or period when farmers cut, dry, and store grass as hay","zh":"割草晒干并储存为干草的时节；收割干草期"},"examples":[{"en":"During haytime, the whole family helped in the fields.","zh":"在收割干草的时节，全家人都会下地帮忙。"},{"en":"The weather matters a lot at haytime because hay must dry properly.","zh":"收割干草期天气非常关键，因为干草必须充分晒干。"}]}],"synonyms":["heyday","prime","peak","golden age"],"phonetic":"/ˈheɪˌtaɪm/","extraExplanation":["“haytime”较常见于较老或较文学化的用法，日常英语里更常说“heyday”（同义：全盛期）。例如：in its heyday。","词源上与农业生活有关：干草收割时是一年中最忙、最关键的“黄金时期”，后来引申为“巅峰、鼎盛”。"]}
{"word":"haywagon","summary":{"en":"A haywagon is a wagon/trailer used to carry hay, and it can also refer to a haywagon ride at a farm event.","zh":"Haywagon 指运干草的车；也常出现在农场活动中的“干草车兜风”语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wagon or trailer used to carry hay, especially from a field to a barn or storage area","zh":"运干草的车；干草车（尤指从田里把干草运到谷仓或储存处的车）"},"examples":[{"en":"They loaded the hay onto the haywagon before the rain started.","zh":"下雨前，他们把干草装上干草车。"},{"en":"The kids rode on the haywagon during the autumn farm festival.","zh":"在秋季农场节庆时，孩子们坐在干草车上兜风。"}]}],"synonyms":["hay wagon","hay cart","farm wagon","wagon","trailer"],"phonetic":"/ˈheɪˌwæɡən/","extraExplanation":["“Haywagon”在美式英语里常见于农业与乡村生活语境，也会出现在“haywagon ride”（干草车兜风）这种秋季活动中，尤其与收获季、南瓜地、农场节庆等文化场景相关。现代农场有时也用拖拉机牵引的拖车来运草，但人们仍会习惯性称作haywagon。"]}
{"word":"hayward","summary":{"en":"Hayward is most commonly a surname or a place name (notably a city in California). Historically, it could also mean a field/hedge warden who protected crops.","zh":"Hayward 最常见是姓氏或地名（尤其指美国加州海沃德市）。在历史上，它也可指负责看护田地/篱笆、保护庄稼的地方看守人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), and sometimes a given name","zh":"姓氏（也偶作名字）"},"examples":[{"en":"Dame Judith Hayward is a well-known figure in her field.","zh":"朱迪思·海沃德女爵士在她的领域里很有名。"},{"en":"My teacher’s last name is Hayward.","zh":"我老师的姓是海沃德。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially the city of Hayward in California, USA","zh":"地名（尤指美国加州的海沃德市）"},"examples":[{"en":"They moved to Hayward for a new job in the Bay Area.","zh":"他们为了湾区的新工作搬到了海沃德。"},{"en":"Hayward is located in the East Bay, near Oakland.","zh":"海沃德位于东湾，靠近奥克兰。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) a local officer who guarded fields, fences, or hedges and protected crops","zh":"（古用）田地/篱笆看守人，负责看护田地并保护庄稼的地方职员"},"examples":[{"en":"In old village records, the hayward was hired to watch the fields.","zh":"在旧时的村庄记录中，会雇“hayward”来巡视田地。"},{"en":"The hayward made sure animals didn’t stray into the crops.","zh":"田地看守人会确保牲畜不会闯进庄稼地。"}]}],"synonyms":["(historical) hedge-warden","(historical) field-warden"],"phonetic":"/ˈheɪwərd/","extraExplanation":["“Hayward”在现代最常见的是专有名词（姓氏或地名）。在美国语境里，很多人会首先想到加州东湾（East Bay）的海沃德市，以及相关地理名词（如 Hayward Fault 海沃德断层）。","作为古英语背景词，“hay”在早期可指“篱笆/树篱（hedge）”一类的围挡，因此“hayward”原意接近“看护篱笆与田地的人”，属于历史性的乡村公共职务称呼。"]}
{"word":"haywards","summary":{"en":"“Haywards” most commonly means people named Hayward (a surname). It can also mean the plural of “hayward,” a historical field-warden.","zh":"“Haywards”最常指姓 Hayward 的人（或家族）；也可指历史上的“hayward”（田地/围栏管理员）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) People with the surname Hayward; also used to refer to a family or group named Hayward.","zh":"（复数）姓氏 Hayward 的人；也可指名为 Hayward 的一家人或一群人。"},"examples":[{"en":"The Haywards moved to California in the 1990s.","zh":"Hayward 家族在 1990 年代搬到了加利福尼亚。"},{"en":"I met two Haywards at the conference.","zh":"我在会议上遇到了两位姓 Hayward 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) The plural of hayward: a historical local official who looked after fields, fences, hedges, and grazing land.","zh":"（复数）hayward 的复数：历史上负责看管田地、篱笆、树篱与放牧地的地方官员/管理员。"},"examples":[{"en":"In old village records, haywards were appointed to protect crops from roaming animals.","zh":"在古老的村庄记录中，会任命 hayward 来保护庄稼免受乱跑的牲畜破坏。"},{"en":"The manor hired haywards to check fences and settle disputes over grazing.","zh":"庄园雇用 hayward 检查围栏，并处理放牧纠纷。"}]}],"synonyms":["(surname) the Hayward family","(historical) field-wardens","(historical) wardens"],"phonetic":"/ˈheɪwərdz/","extraExplanation":["“hayward”来自中古英语，和“hay”（围栏、篱笆）有关，不是“hay”（干草）的意思。这个职位在英国乡村历史中较常见，现代英语里多见于历史文本、姓氏或地名背景。","注意：大写的“Haywards”更可能是姓氏（或作为专有名词的一部分）；小写“haywards”更可能表示历史职业的复数。"]}
{"word":"hayweed","summary":{"en":"Hayweed usually means an unwanted weed in hayfields; in American English it can also refer to ragweed, known for causing allergies.","zh":"Hayweed 通常指干草地里的杂草；在美式英语里也常用来指豚草（会引发花粉过敏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a weed that grows in hayfields or hay, often considered undesirable because it reduces hay quality.","zh":"生长在干草地或混入干草中的杂草（通常被认为不好，会降低干草质量）。"},"examples":[{"en":"The farmer tried to remove hayweed before cutting the field for hay.","zh":"农夫在割草做干草前，尽量把干草地里的杂草清除掉。"},{"en":"Too much hayweed in the bale can lower the value of the hay.","zh":"草捆里杂草太多会降低干草的价值。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in American use) ragweed, a wild plant whose pollen commonly causes seasonal allergies.","zh":"（在美式用法中常指）豚草；其花粉常引起季节性过敏。"},"examples":[{"en":"My allergies get worse when hayweed starts pollinating in late summer.","zh":"每到夏末豚草开始散粉时，我的过敏就更严重。"},{"en":"The doctor said hayweed pollen was the likely trigger.","zh":"医生说很可能是豚草花粉引发的。"}]}],"synonyms":["ragweed","weed","field weed"],"phonetic":"/ˈheɪˌwiːd/","extraExplanation":["“hayweed”并不是非常固定的科学名称，更像是口语/地方用法：有时泛指“干草地里的杂草”，有时特指“豚草（ragweed）”。在美国语境里，提到过敏时更常理解为后者。","如果你是在阅读农业或地方文学作品，作者可能用“hayweed”来营造乡村气息，强调田地里杂草丛生、收成受影响的画面。"]}
{"word":"haywire","summary":{"en":"Haywire means out of control or not functioning properly, often used in the phrase “go haywire.”","zh":"Haywire 指“失控、出故障或一团乱”，常用搭配是 go haywire。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not working correctly; out of control; in a confused or chaotic state.","zh":"失控的；出故障的；一团乱的。"},"examples":[{"en":"After the update, my phone went haywire and kept restarting.","zh":"更新之后，我的手机就失控了，一直重启。"},{"en":"The kids went haywire when they heard there was no school tomorrow.","zh":"孩子们听说明天不上学，就兴奋得“闹翻天”。"},{"en":"Our plans went haywire because of the sudden storm.","zh":"因为突如其来的暴风雨，我们的计划全乱了。"}]}],"synonyms":["out of control","chaotic","malfunctioning","crazy","wild"],"phonetic":"/ˈheɪˌwaɪɚ/","extraExplanation":["“go haywire”是最常见的搭配，既可形容机器/系统“出故障”，也可形容人或场面“失控、乱作一团”。","词源与“hay（干草）”有关：早期haywire指捆干草用的铁丝，比较粗糙、容易打结弯曲；后来引申为“乱七八糟、失去控制”的状态。"]}
{"word":"haywires","summary":{"en":"Haywire means out of control or not working properly, often used in the phrase “go haywire.”","zh":"Haywire 指“失控、混乱或出故障”，常用于短语 go haywire（出问题/乱套）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Not working properly; out of control; confused or chaotic.","zh":"（形容词）出故障的；失控的；混乱的。"},"examples":[{"en":"The plan went haywire when the train was delayed.","zh":"火车晚点后，计划就乱套了。"},{"en":"My computer has been acting haywire all morning.","zh":"我的电脑整个早上都不正常。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A state of confusion or malfunction; disorder.","zh":"（名词）混乱/失序的状态；（机器等）故障状态。"},"examples":[{"en":"After the update, everything was in haywire.","zh":"更新之后，一切都变得一团糟。"},{"en":"The factory fell into haywire after the power cut.","zh":"停电后工厂陷入混乱。"}]}],"synonyms":["out of control","malfunctioning","chaotic","crazy","disordered"],"phonetic":"ˈheɪˌwaɪɚ","extraExplanation":["“haywire”最常见用法是固定搭配 go haywire，表示“（机器/系统）出故障”或“（事情）失控、乱套”。你输入的 haywires 更像是复数形式，但日常英语里通常用 haywire（不可数/作形容词）来表达。","词源与农业有关：haywire 原本指“捆干草用的铁丝”。这种铁丝便宜但容易弯折、打结，后来引申为“乱七八糟、失去控制”。"]}
{"word":"hayz","summary":{"en":"“Hayz” is usually a misspelling of “haze,” meaning light fog/cloudiness or to make something unclear.","zh":"“hayz”通常是“haze”的误拼；“haze”指薄雾/霾，也可指使事物或思路变得模糊不清。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard spelling) A misspelling of “haze.”","zh":"（非标准拼写）常见为“haze”的误拼。"},"examples":[{"en":"I think you meant “haze,” not “hayz.”","zh":"我觉得你想写的是“haze”，不是“hayz”。"}]},{"partOfSpeech":"n.","definition":{"en":"A light fog or a cloudiness in the air that makes it hard to see clearly.","zh":"（空气中的）薄雾；霾；使视线不清的浑浊。"},"examples":[{"en":"A thick haze covered the city this morning.","zh":"今天早上城市被一层浓霾笼罩。"},{"en":"The mountains disappeared in the haze.","zh":"群山在薄雾中消失了。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something less clear or less sharp (physically or mentally).","zh":"使（事物或思路）变得不清晰、模糊。"},"examples":[{"en":"Smoke from the fire hazed the room.","zh":"火灾的烟让房间变得一片朦胧。"},{"en":"Stress can haze your judgment.","zh":"压力会让你的判断变得不清晰。"}]}],"synonyms":["mist","fog","smog","blur","cloudiness"],"phonetic":"/heɪz/","extraExplanation":["“hayz”不是常见或标准英语拼写。多数情况下你要表达的是“haze”（薄雾/霾；使模糊）。","“haze”也常用于比喻：如a haze of confusion（迷茫的状态）、a hazy memory（模糊的记忆）。"]}

