{"word":"hcb","summary":{"en":"HCB is a context-dependent abbreviation, most often meaning hexachlorobenzene in environmental/chemical contexts.","zh":"HCB 是一个需看语境的缩写，在环境/化学语境中最常指六氯苯（hexachlorobenzene）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can stand for different things depending on context; most commonly, it refers to the chemical hexachlorobenzene.","zh":"一个缩写，具体含义取决于语境；最常见的用法是指化学物质“六氯苯”。"},"examples":[{"en":"In environmental reports, HCB often refers to hexachlorobenzene found as a pollutant.","zh":"在环境报告中，HCB 常指作为污染物被检出的六氯苯。"},{"en":"Could you tell me what HCB stands for in this document?","zh":"你能告诉我在这份文件里 HCB 代表什么吗？"}]},{"partOfSpeech":"n.","definition":{"en":"hexachlorobenzene, a chlorinated organic chemical historically used in agriculture and now mainly discussed as a persistent environmental pollutant.","zh":"六氯苯：一种含氯有机化学物质，过去曾用于农业，如今主要在“持久性环境污染物”的讨论中出现。"},"examples":[{"en":"The scientist measured HCB levels in the soil after the cleanup.","zh":"科学家在清理后测量了土壤中的 HCB 含量。"},{"en":"Some older studies mention HCB as a byproduct of certain industrial processes.","zh":"一些较早的研究提到，HCB 可能是某些工业过程的副产物。"}]}],"synonyms":["abbreviation","acronym"],"phonetic":"/ˌeɪtʃ siː ˈbiː/","extraExplanation":["“HCB”作为缩写非常多义：如果你是在医学、商业、学校、游戏或某个机构名称里看到它，含义可能完全不同。把完整句子或领域（例如：化学/环保/银行/医院/课程）发我，我可以给出最准确的释义与用法。","读音通常按字母拼读（H-C-B）。在技术写作中，首次出现时常会写出全称，然后括号标注缩写：hexachlorobenzene (HCB)。"]}
{"word":"hcf","summary":{"en":"HCF most commonly means “highest common factor” (largest shared divisor). It can also mean “hundred cubic feet” as a volume unit in billing/industry contexts.","zh":"HCF 最常见表示“最大公因数”。在账单或行业语境中也可能表示“一百立方英尺”的体积单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"highest common factor; the largest number that divides two or more numbers exactly (same as GCF in American English).","zh":"最大公因数；能同时整除两个或多个整数的最大整数（美式英语常说 GCF）。"},"examples":[{"en":"Find the HCF of 12 and 18.","zh":"求 12 和 18 的最大公因数（HCF）。"},{"en":"The HCF of 8 and 20 is 4.","zh":"8 和 20 的最大公因数是 4。"}]},{"partOfSpeech":"n.","definition":{"en":"hundred cubic feet; a unit of volume used in some industries (often written as HCF or CCF).","zh":"一百立方英尺；一种体积单位，在部分行业中使用（常写作 HCF 或 CCF）。"},"examples":[{"en":"The gas usage is billed per HCF.","zh":"燃气用量按每 100 立方英尺（HCF）计费。"}]}],"synonyms":["GCF","greatest common divisor","GCD"],"phonetic":"eɪtʃ siː ɛf","extraExplanation":["HCF 多见于英式/印度等地区的数学教材；在美国课堂里更常用 GCF（greatest common factor）。","作为体积单位时，不同公司/账单可能写 HCF 或 CCF；具体含义通常以账单说明为准。"]}
{"word":"hcl","summary":{"en":"HCl is the chemical formula for hydrogen chloride; in water it is called hydrochloric acid.","zh":"HCl 是氯化氢的化学式；溶于水时称为盐酸（hydrochloric acid）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hydrochloric acid (HCl): a strong, corrosive acid made from hydrogen and chlorine; it is often found in the stomach and used in industry and labs.","zh":"盐酸（HCl）：由氢和氯组成的强腐蚀性酸；常见于胃液中，也用于工业和实验室。"},"examples":[{"en":"Hydrochloric acid (HCl) helps your stomach digest food.","zh":"盐酸（HCl）帮助你的胃消化食物。"},{"en":"Wear gloves and goggles when handling HCl in the lab.","zh":"在实验室处理HCl时要戴手套和护目镜。"},{"en":"The cleaner contains dilute HCl to remove mineral deposits.","zh":"这种清洁剂含有稀盐酸（HCl），用来去除水垢。"}]},{"partOfSpeech":"n.","definition":{"en":"Hydrogen chloride (HCl): the same chemical (HCl) in its gas form (often written as HCl(g)).","zh":"氯化氢（HCl）：同一种化学物质（HCl）的气体形式（常写作 HCl(g)）。"},"examples":[{"en":"Hydrogen chloride gas (HCl) dissolves in water to form hydrochloric acid.","zh":"氯化氢气体（HCl）溶于水会形成盐酸。"},{"en":"The reaction produced HCl gas, so the room needed good ventilation.","zh":"反应产生了HCl气体，所以房间需要良好通风。"}]}],"synonyms":["hydrochloric acid","hydrogen chloride","muriatic acid"],"phonetic":"/eɪtʃ siː ɛl/","extraExplanation":["在化学里，“HCl”通常指化学式；是否叫“盐酸”取决于状态：溶于水的 HCl(aq) 才叫 hydrochloric acid（盐酸），气体 HCl(g) 常叫 hydrogen chloride（氯化氢）。","日常生活中你也可能看到别名 muriatic acid（常用于清洁剂/泳池维护），本质上是工业/商业用语，仍指盐酸的溶液。","因为具有强腐蚀性，英语里常搭配词有：dilute（稀释的）、concentrated（浓的）、corrosive（腐蚀性的）、handle with care（小心处理）。"]}
{"word":"hconvert","summary":{"en":"“hconvert” is usually a software command/tool name meaning to convert files or formats; it’s not a standard dictionary word.","zh":"“hconvert”通常是软件命令/工具名，表示转换文件或格式；不是标准词典词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard term most often used as a program/command name meaning “convert (something) with an H- tool,” i.e., change one file or format into another.","zh":"一个非标准英语词，更常见于程序/命令名称，通常表示“用某个以 H 开头的工具来转换”，即把文件或格式从一种变为另一种。"},"examples":[{"en":"I ran hconvert to change the images into PNG format.","zh":"我运行了 hconvert，把图片转换成 PNG 格式。"},{"en":"If hconvert isn’t found, add its folder to your PATH.","zh":"如果系统找不到 hconvert，把它所在的文件夹加入 PATH。"}]}],"synonyms":["convert","transcode","transform"],"phonetic":"/ˈeɪtʃ kənˈvɝt/","extraExplanation":["“hconvert”不是常见的词典英语单词，通常出现在软件/脚本环境里，作为可执行文件名或函数名使用（不同项目里含义可能不同）。","如果你是在终端/报错信息里看到它，最可靠的做法是查看该项目的文档、`--help` 输出，或说明文件（README），因为具体“转换什么”由该工具决定。"]}

