{"word":"hecastotheism","summary":{"en":"Hecatotheism means devotion to Hecate, an ancient Greek goddess, often in modern pagan contexts.","zh":"hecatotheism 指对古希腊女神赫卡忒的信仰/崇敬，常见于现代新异教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Belief in and/or religious devotion to Hecate (also spelled Hekate), an ancient Greek goddess often associated with crossroads, magic, night, and liminal spaces.","zh":"对赫卡忒（Hecate/Hekate，古希腊女神）的信仰与/或宗教性崇敬；她常与十字路口、魔法、黑夜与“边界/过渡地带”相关。"},"examples":[{"en":"She describes her spirituality as hecatotheism, centered on honoring Hecate through prayer and ritual.","zh":"她把自己的灵性实践称为“赫卡忒信仰”，核心是通过祈祷与仪式来敬奉赫卡忒。"},{"en":"In online pagan communities, hecatotheism is sometimes discussed alongside modern witchcraft traditions.","zh":"在一些网络新异教社群里，“赫卡忒信仰”有时会与当代巫术传统一起被讨论。"}]}],"synonyms":["Hecate worship","devotion to Hecate","Hekatean devotion"],"phonetic":"/ˌhɛkəˈtoʊθiˌɪzəm/","extraExplanation":["这个词由“Hecato-（赫卡忒）+ -theism（信神/宗教信仰）”构成，属于相对少见的宗教/灵性用语，常见于新异教（Neopagan）或部分现代巫术语境中。","赫卡忒在古典文学与神话中有重要形象：例如在赫西俄德《神谱》（Theogony）里被提及；在后世文化里也常与“十字路口”“钥匙”“火炬”等意象相连。不同传统对她的理解差异很大，使用时通常带有个人实践色彩。"]}
{"word":"Hecataeus","summary":{"en":"an early ancient Greek historian and geographer (a notable classical author)","zh":"古希腊早期的历史与地理著述者（著名古典作者）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek writer and early historian/geographer, especially Hecataeus of Miletus (c. 550–476 BCE), known for describing lands and peoples and for early attempts to organize historical and geographic knowledge.","zh":"古希腊作家、早期历史学家/地理学家，尤指米利都的赫卡泰乌斯（约公元前550—476年），以记录各地风土人情、并尝试系统整理历史与地理知识而著名。"},"examples":[{"en":"Hecataeus of Miletus wrote an early geographical work describing the known world.","zh":"米利都的赫卡泰乌斯撰写了早期地理著作，描述当时所知的世界。"},{"en":"Some scholars see Hecataeus as a bridge between myth-based stories and more evidence-based history.","zh":"一些学者认为赫卡泰乌斯是连接神话叙事与更重证据的历史写作之间的桥梁。"}]}],"synonyms":["Hecataeus of Miletus"],"phonetic":"/ˌhɛkəˈtiːəs/","extraExplanation":["常见的“赫卡泰乌斯”主要指两位古希腊人物：①米利都的赫卡泰乌斯（历史学家/地理学家）；②阿卜德拉的赫卡泰乌斯（哲学家/历史作家，年代略晚）。在学术语境中如未特别说明，通常默认指“米利都的赫卡泰乌斯”。"],"etymology":"源自古希腊语人名 Ἑκαταῖος (Hekataios)，经拉丁化形式 Hecataeus 进入英语；属于专有名词，多用来指特定历史人物。","mnemonic":["把它记成“赫卡泰乌斯=早期‘地图+历史’的人”：看到 -aeus 结尾的人名，联想到古典时代学者名字（如 Herodoteus/Thucydides 一类）。","音近联想：Heca- 像“赫卡”，-taeus 像“泰乌斯”，整体就是中文常见译名“赫卡泰乌斯”。"]}
{"word":"Hecate","summary":{"en":"Hecate is a Greek goddess linked to magic, the night, and crossroads, often referenced in literature such as Shakespeare’s *Macbeth*.","zh":"赫卡忒是希腊神话中与魔法、黑夜和十字路口相关的女神，也常出现在文学作品中，如莎士比亚的《麦克白》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A goddess associated with magic, witchcraft, the night, ghosts, and crossroads; often shown carrying torches and linked to the underworld.","zh":"（希腊神话）赫卡忒：与魔法、巫术、黑夜、亡灵与十字路口相关的女神；常被描绘为持火炬，并与冥界有联系。"},"examples":[{"en":"In Greek myth, Hecate is often connected with magic and the night.","zh":"在希腊神话中，赫卡忒常与魔法和黑夜联系在一起。"},{"en":"The travelers left an offering to Hecate at the crossroads.","zh":"旅人们在十字路口给赫卡忒留下供品。"},{"en":"Shakespeare mentions Hecate in *Macbeth* as a powerful figure tied to the witches.","zh":"莎士比亚在《麦克白》中提到赫卡忒，把她描写成与女巫有关的强大人物。"}]}],"synonyms":["goddess of magic","witch-goddess","underworld goddess"],"phonetic":"/ˈhɛkəti/","extraExplanation":["“Hecate”常译作“赫卡忒/赫卡特”。她在后世文学与民俗中经常被当作“巫术女神”的象征，因此在奇幻作品、占卜与流行文化里也很常出现。","发音在英语里有不同读法；美式里常见 /ˈhɛkəti/（重音在第一个音节），有时也会听到另一种读法（更接近“hi-KAY-tee”）。"]}
{"word":"hecate","summary":{"en":"Hecate is a Greek goddess linked to magic, night, and crossroads, and her name is often used in literature to suggest dark or mysterious supernatural power.","zh":"Hecate（赫卡忒）是希腊神话中与魔法、夜晚和十字路口相关的女神；在文学里也常用来营造阴暗神秘的超自然氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the goddess associated with magic, witchcraft, the night, ghosts, and crossroads.","zh":"（希腊神话）赫卡忒：与魔法、巫术、夜晚、幽灵与十字路口相关的女神。"},"examples":[{"en":"In Greek myths, Hecate is often linked to magic and the underworld.","zh":"在希腊神话中，赫卡忒常与魔法和冥界联系在一起。"},{"en":"The story describes travelers leaving offerings to Hecate at a crossroads.","zh":"故事里写到人们在十字路口向赫卡忒献祭。"}]},{"partOfSpeech":"n.","definition":{"en":"A literary or cultural reference to powerful, mysterious magic—often used when discussing witches or dark supernatural themes.","zh":"（文学/文化引申）用来指代强大而神秘的魔法力量；常见于谈论女巫或阴暗超自然主题时。"},"examples":[{"en":"The poem invokes Hecate to create a dark, enchanted mood.","zh":"这首诗借赫卡忒之名营造出阴暗而着魔的氛围。"},{"en":"In Shakespeare’s Macbeth, Hecate is connected with the witches’ spells.","zh":"在莎士比亚《麦克白》中，赫卡忒与女巫的咒术有关。"}]}],"synonyms":["the goddess of witchcraft","Greek goddess of magic"],"phonetic":"/ˈhɛkəti/","extraExplanation":["“Hecate”常见读音为 /ˈhɛkəti/（也有人读作 /hɪˈkeɪti/），在神话研究与文学作品里都很常见。","她经常被描绘为与“十字路口（crossroads）”有关的神祇，象征选择、边界与通往未知的道路；因此在西方文化里也常被当作“神秘力量/巫术”的象征。","文学中提到“Hecate”时，通常不是在讲历史宗教崇拜本身，而是借用她的意象来加强氛围：夜色、仪式感、禁忌与超自然。"]}
{"word":"Hecate-related","summary":{"en":"connected with the Greek goddess Hecate and her symbols of magic and crossroads","zh":"与希腊女神赫卡忒及其“魔法/十字路口”等象征有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with Hecate (Hekate), the ancient Greek goddess often linked with magic, witchcraft, the night, ghosts, and crossroads.","zh":"与赫卡忒（Hekate，古希腊女神）有关的；常指与魔法、巫术、夜晚、幽灵与十字路口等意象相关的。"},"examples":[{"en":"The novel is full of Hecate-related imagery—torches, crossroads, and spells.","zh":"这部小说充满与赫卡忒相关的意象——火炬、十字路口和咒语。"},{"en":"In some modern pagan practices, Hecate-related rituals focus on protection and guidance.","zh":"在一些现代异教实践中，与赫卡忒相关的仪式常强调守护与指引。"}]}],"synonyms":["Hecatean","Hekatean","witchcraft-related","occult","pagan-themed"],"phonetic":"/ˈhɛkəti rɪˈleɪtɪd/","extraExplanation":["赫卡忒在古典传统里常与“门槛/边界（liminal）”意象相连：十字路口、夜晚与火炬象征选择、过渡与指引。文学与现代文化里，“Hecate-related”常用来营造神秘、阴影、巫术或护符式的氛围。","拼写提示：学术与宗教语境中常见 Hekate（更接近希腊语转写）；大众文化里 Hecate 更常见。两者通常指同一位神祇。"],"etymology":"“Hecate-related”由专名 Hecate（亦拼作 Hekate）+ related 组成。Hecate 源自希腊语“Ἑκάτη”，在英语中常用于指涉与这位女神相关的主题与象征；加上 related 表示“与……有关的”。","mnemonic":["把它拆开记：Hecate（赫卡忒）+ related（相关的）=“与赫卡忒有关的”。","联想画面：赫卡忒常被描绘拿着火炬、站在十字路口——看到“火炬/十字路口/咒语”就想到 Hecate-related。"]}
{"word":"Hecatean","summary":{"en":"related to Hecate; darkly magical or underworld-like in tone","zh":"与赫卡忒相关；带有阴暗魔法或冥界气息"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hecate (Hekate), the ancient Greek goddess associated with magic, witchcraft, crossroads, night, and the underworld.","zh":"与赫卡忒（Hekate，古希腊神祇）有关的；常指与魔法、巫术、十字路口、黑夜与冥界相关。"},"examples":[{"en":"The novel’s Hecatean atmosphere is filled with moonlight, crossroads, and whispered spells.","zh":"这部小说带有强烈的“赫卡忒式”氛围：月光、十字路口与低声咒语交织。"},{"en":"In some poems, a Hecatean figure appears as a guardian of thresholds and night roads.","zh":"在一些诗歌里，“赫卡忒式”的形象会作为门槛与夜路的守护者出现。"}]},{"partOfSpeech":"adj.","definition":{"en":"By extension, darkly magical; suggestive of sorcery, eerie rituals, or underworld powers.","zh":"引申为：阴暗而带魔性/巫术感的；暗示诡异仪式或冥界力量的。"},"examples":[{"en":"The painter used Hecatean symbols to give the scene a haunted feeling.","zh":"画家用带“赫卡忒式”意味的符号，让画面更显阴森。"},{"en":"They described the abandoned garden as Hecatean, as if something uncanny lingered there.","zh":"他们形容那座荒废花园很“赫卡忒式”，仿佛有某种诡异之物徘徊不去。"}]}],"synonyms":["chthonic","occult","arcane","witchy","eerie","otherworldly"],"phonetic":"/ˌhɛkəˈtiːən/","extraExplanation":["赫卡忒（Hekate）在希腊传统中常与“十字路口”“门槛/边界（thresholds）”“黑夜”“幽灵与冥界”联系在一起，也被后世文学与民间传统进一步强化为“魔法与巫术”的象征。因此 Hecatean 往往不只是“属于某位神”的中性描述，还带有阴影、神秘与仪式感的文学色彩。"],"etymology":"来自“Hecate/Hekate（赫卡忒）+ -an（……的）”。用于英语中表示“与赫卡忒相关的”，常见于文学、神话研究与哥特/奇幻语境。","mnemonic":["记忆法：把它拆成“赫卡忒 Hecate + -an（……的）”，=“赫卡忒式的”。","联想：赫卡忒常被描写在“十字路口（crossroads）+ 夜晚（night）+ 魔法（magic）”，看到这些意象就想到 Hecatean。"]}
{"word":"hecatean","summary":{"en":"Hecatean means “connected with Hecate,” often suggesting an eerie, magical, night-and-underworld atmosphere.","zh":"Hecatean 指“与赫卡忒相关的”，常引申为带有阴森、神秘、巫术与黑夜/冥界气息的风格或氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hecate, the ancient Greek goddess associated with witchcraft, magic, the night, crossroads, and the underworld.","zh":"与赫卡忒（Hecate）有关的；指古希腊女神赫卡忒，常与巫术、魔法、黑夜、十字路口与冥界相关。"},"examples":[{"en":"The poem is filled with Hecatean images—torches, midnight paths, and uneasy shadows.","zh":"这首诗充满了“赫卡忒式”的意象——火炬、午夜小径与令人不安的阴影。"},{"en":"In fantasy novels, a Hecatean shrine often appears at a lonely crossroads.","zh":"在奇幻小说里，“赫卡忒式”的神龛常出现在偏僻的十字路口。"},{"en":"The playwright gives the scene a Hecatean mood to suggest forbidden magic.","zh":"剧作家用“赫卡忒式”的氛围暗示禁忌的魔法。"}]}],"synonyms":["Hecatian","chthonic","occult","witchy"],"phonetic":"/ˌhɛkəˈtiːən/","extraExplanation":["Hecate（赫卡忒）在希腊神话中常被描绘为手持火炬、与夜晚与路口有关的女神；因此 Hecatean 常用来营造“黑夜、神秘、巫术/仪式、冥界气息”的文学与艺术氛围。","在英语文学中，这个词多见于诗歌、哥特/恐怖叙事与神秘学语境，用来快速唤起“阴影、火炬、咒术、门槛/交界处（如十字路口）”等联想。","拼写上也会见到变体 Hecatian（同义，较少见）；Hecate 的读音在英语里常读作 “HEK-uh-tee”。"]}
{"word":"Hecatian","summary":{"en":"connected with Hecate and her dark, magical imagery","zh":"与赫卡忒相关的；带有夜色、巫术与冥界意象的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hecate (Hekate), the ancient Greek goddess associated with magic, witchcraft, crossroads, night, and the underworld.","zh":"与赫卡忒（Hekate，古希腊女神）有关的；常指魔法、巫术、十字路口、夜晚与冥界等意象。"},"examples":[{"en":"The poem ends with a Hecatian scene at a moonlit crossroads.","zh":"这首诗以一个月光下十字路口的“赫卡忒式”场景收尾。"},{"en":"Writers sometimes use Hecatian imagery to suggest hidden powers and uneasy shadows.","zh":"作家有时用“赫卡忒式”意象来暗示隐秘的力量与不安的阴影。"},{"en":"Her novel’s atmosphere feels distinctly Hecatian—mysterious, nocturnal, and spellbound.","zh":"她小说的氛围很“赫卡忒式”——神秘、夜色浓重、仿佛被咒语笼罩。"}]}],"synonyms":["Hecatean","chthonic","occult","witchy"],"phonetic":"/hɪˈkeɪʃiən/","extraExplanation":["赫卡忒（Hecate/Hekate）在希腊神话中常与“十字路口”“火炬”“夜晚”“冥界边界”联系在一起；因此 Hecatian 常用于文学/艺术里营造阴影、神秘、巫术与门槛（liminal）气氛。","该词多见于文学评论、诗歌或神秘学语境，日常口语中较少使用；在学术写作里更常见的变体是 Hecatean。"],"etymology":"源自希腊神名 Hekátē（赫卡忒）→ 英语形容词后缀 -ian（表示“与……有关的”）。也常见拼写变体 Hecatean。","mnemonic":["把它拆成“赫卡忒(Hecate)+-ian（……的）”：Hecatian＝“赫卡忒式/与赫卡忒相关的”。","联想“十字路口（crossroads）+月夜+火炬”的画面：一想到这种氛围，就想到 Hecatian。"]}
{"word":"hecatic","summary":{"en":"Hecatic means “related to Hecate,” often describing dark, magical, witchcraft-like qualities.","zh":"hecatic意为“与希卡忒有关的”，常用于形容幽暗神秘、带巫术/魔法气息的特质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Hecate, the goddess of magic, the night, ghosts, and crossroads in Greek mythology; suggesting witchcraft or dark, mysterious magic.","zh":"与希卡忒（Hecate，希腊神话中的魔法、夜晚、幽灵与十字路口女神）有关的；带有巫术或幽暗神秘魔法气息的。"},"examples":[{"en":"The novel’s hecatic atmosphere made the city’s alleys feel like haunted crossroads.","zh":"这部小说的“希卡忒式”氛围让城市小巷像闹鬼的十字路口。"},{"en":"She painted a hecatic scene of moonlight, keys, and shadowy spirits.","zh":"她画了一幅“希卡忒式”的场景：月光、钥匙与朦胧的幽灵。"}]}],"synonyms":["Hecatean","chthonic","occult","witchy"],"phonetic":"/hɪˈkætɪk/","extraExplanation":["“hecatic”源自Hecate（希卡忒）。在古典文学与现代奇幻/哥特作品中，Hecate常与巫术、亡灵、夜色与“十字路口的选择”意象相连，因此该词多用于描写阴冷、神秘、带魔法或冥界色彩的氛围。","这个词非常少见，更常见的近义形容词是“Hecatean”。写作中若担心读者不熟悉，可用“Hecatean”或直接写“related to Hecate / witchcraft-like”。"]}
{"word":"hecatine","summary":{"en":"Hecatine means “connected with Hecate,” often used in literary or mythic contexts to suggest dark, magical, nocturnal imagery.","zh":"hecatine 表示“与赫卡忒有关的”，多用于文学/神话语境，带有黑夜、神秘、魔法等意象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hecate, the Greek goddess associated with magic, witchcraft, the night, and crossroads.","zh":"与赫卡忒（Hecate，希腊神话中与魔法、巫术、黑夜与十字路口相关的女神）有关的；赫卡忒的。"},"examples":[{"en":"The poem has a hecatine mood—dark, moonlit, and mysterious.","zh":"这首诗有一种“赫卡忒式”的氛围——黑暗、月光下、充满神秘。"},{"en":"In some stories, a hecatine ritual is performed at a crossroads.","zh":"在一些故事里，人们会在十字路口进行一种“赫卡忒式”的仪式。"}]}],"synonyms":["Hecatean","hecatic","of Hecate","Hecate-related"],"phonetic":"/ˈhɛkəˌtaɪn/","extraExplanation":["“hecatine”来自 Hecate（赫卡忒）的形容词形式，意思是“属于/关于赫卡忒的”。这种词形常见于文学、神话研究、哥特风格描写中，用来营造神秘、夜色、巫术或“十字路口”象征意义的氛围。","在现代英语里更常见的写法通常是“of/relating to Hecate”或偶见“hecatic / Hecatean”（不同作者会选用不同派生形容词）；“hecatine”相对少见，读到时多半是文学化用法。"]}
{"word":"hecatomb","summary":{"en":"Hecatomb means a massive sacrifice or slaughter; it’s a formal, literary word often used for large-scale loss of life.","zh":"hecatomb 指“大规模的牺牲或屠杀”，语体较正式、偏文学，常用于描述大量生命损失。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very large sacrifice or slaughter, especially one involving many lives (originally, a major religious sacrifice).","zh":"大规模的牺牲或屠杀（尤指夺走许多生命；原义指盛大的宗教祭献）。"},"examples":[{"en":"The war led to a hecatomb of young soldiers on both sides.","zh":"这场战争导致双方大量年轻士兵牺牲。"},{"en":"The writer describes the plague as a hecatomb that emptied the city streets.","zh":"作者把瘟疫描写成一场“巨大的死亡灾难”，使城市街道空无一人。"}]}],"synonyms":["massacre","slaughter","bloodbath","carnage","holocaust"],"phonetic":"/ˈhɛkəˌtoʊm/","extraExplanation":["词源与文化背景：hecatomb 来自古希腊语，最初指“献祭一百头牛”的大型祭典（hekaton=一百，bous=牛）。后来意义扩大，比喻“极其惨重的牺牲/大屠杀”。","语体提示：这个词偏书面、文学或新闻评论风格，常用于战争、灾难、瘟疫等造成大量死亡的语境。日常口语更常用 many deaths / massacre / huge loss of life。","文学与历史用法：在英语文学与史学写作中，hecatomb 常用来强化悲剧规模与“献祭般的代价”这一意象。"]}
{"word":"hecatombaeon","summary":{"en":"Hecatombaeon is the first month of the ancient Athenian (Attic) calendar, roughly late June to July.","zh":"Hecatombaeon 指古雅典（阿提卡）历的第一个月，大致相当于公历6月下旬至7月。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) The first month of the Attic (Athenian) lunar calendar, roughly corresponding to late June–July, named after major summer sacrifices and festivals.","zh":"（古希腊）阿提卡（雅典）阴历历法的第一个月，大致相当于公历的6月下旬至7月，因夏季大型祭祀与节庆而得名。"},"examples":[{"en":"In the Attic calendar, Hecatombaeon marked the start of the new year after the summer solstice.","zh":"在阿提卡历中，Hecatombaeon在夏至后标志着新年的开始。"},{"en":"Some Panathenaic celebrations took place during Hecatombaeon in Athens.","zh":"雅典的一些泛雅典娜节庆祝活动在Hecatombaeon期间举行。"}]}],"synonyms":["Hekatombaion"],"phonetic":"/ˌhɛkətoʊmˈbaɪən/","extraExplanation":["该词源自希腊语 Hekatombaiōn，和 hekatomb（“百牛祭”，指大型献祭）同源：hekaton（百）+ bous（牛）。因此这个月份名称带有“盛大祭祀之月”的文化色彩。","古雅典使用阴阳合历（以月相定月），月份与现代公历无法一一固定对应；翻译或阅读历史文献时，常见的做法是给出“约等于6–7月”的范围。","常见拼写变体：Hekatombaion（更接近转写）与 Hecatombaeon（拉丁化/英语常见拼法）。"]}
{"word":"hecatombed","summary":{"en":"Hecatombed means “killed or sacrificed in very large numbers,” often in a tragic or violent context.","zh":"hecatombed 表示“成批大量被杀/被献祭”，常用于悲剧性或暴力性的语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of hecatomb) killed or sacrificed a very large number of people or animals, often in a violent or catastrophic way.","zh":"（hecatomb 的过去式/过去分词）大量杀死或献祭（人或动物），常带有暴力、灾难性的意味。"},"examples":[{"en":"In the civil war, entire villages were hecatombed as the fighting spread.","zh":"在内战中，战火蔓延，整座村庄的人都被大规模屠杀。"},{"en":"The epidemic hecatombed livestock across the region, leaving farmers ruined.","zh":"这场疫情使整个地区的牲畜大量死亡，农民因此破产。"},{"en":"The poet wrote of a generation hecatombed by war and hunger.","zh":"诗人写到一代人被战争与饥荒成批夺去生命。"}]}],"synonyms":["massacred","slaughtered","decimated","butchered","sacrificed"],"phonetic":"/ˈhɛkəˌtoʊmd/","extraExplanation":["“hecatomb”源自古希腊语 *hekatombē*，原指一次献祭“一百头牛”的大型祭祀，后来引申为“巨大的牺牲/大量死亡”。","在现代英语里，这个词多见于文学、历史或新闻的严肃语境，语气比 “killed” 更沉重，强调“成批、惨烈的损失”。"]}
{"word":"hecatombs","summary":{"en":"Hecatombs means either a huge number of deaths/destruction, or (historically) a grand ancient Greek sacrifice said to involve 100 oxen.","zh":"hecatombs 可指“大量死亡/毁灭”，也可指（历史上）古希腊传统的“百牛大祭”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large-scale killing or destruction, especially one involving many victims (often in war or disaster).","zh":"（尤指战争或灾难中的）大规模屠杀；大量生命或事物的毁灭。"},"examples":[{"en":"The war led to hecatombs of civilians in several cities.","zh":"这场战争在多座城市造成了大量平民被屠杀。"},{"en":"The novel describes the hecatombs left behind after the battle.","zh":"小说描写了战斗后留下的大规模伤亡。"}]},{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a great public sacrifice—traditionally said to be the offering of one hundred oxen.","zh":"（古希腊）盛大的公共祭牲；传统上指献祭一百头牛的大祭。"},"examples":[{"en":"During the festival, the city offered a hecatomb to honor the god.","zh":"在节日期间，城邦举行盛大的百牛祭以敬奉神明。"}]}],"synonyms":["massacre","slaughter","carnage","bloodbath","mass killing"],"phonetic":"/ˈhɛkəˌtuːm/","extraExplanation":["词源来自希腊语：hekaton（“一百”）+ bous（“牛”）。后来在英语里引申为“巨大牺牲/巨大伤亡”，常带有文学色彩，语气庄重或沉重。","现代英语里更常见的是比喻用法（指大量死亡或毁灭），而不是字面“百牛祭”。在新闻或日常对话中较少出现，更多见于历史、文学、评论文章。"]}
{"word":"hecatomped","summary":{"en":"An archaic/literary adjective meaning “hundred-footed; many-footed.”","zh":"一个偏古典/文学的形容词，意为“百足的；多足的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a hundred feet; many-footed (often used humorously or poetically).","zh":"（古/文学）有一百只脚的；多足的（常带幽默或诗意色彩）。"},"examples":[{"en":"The poem describes a hecatomped creature crawling out of the sea.","zh":"诗中描写了一只“百足”的生物从海里爬出来。"},{"en":"In a joking tone, he called the centipede a “hecatomped monster.”","zh":"他开玩笑地把蜈蚣叫作“百足怪物”。"}]}],"synonyms":["many-footed","many-legged","hundred-footed"],"phonetic":"/ˌhɛkəˈtɑmpt/","extraExplanation":["“hecatomped”是非常少见、偏文学/古风的词，日常英语几乎不用；更常见的表达是“many-legged / many-footed”。","词源来自希腊语：hekaton（百）+ pous/pod-（脚），同源词还有“octopus（章鱼，八足）”“podiatry（足病学）”。","有时也被用来夸张形容“看起来脚特别多”的东西（如蜈蚣、复杂的支架/装置），带一点戏谑感。"]}
{"word":"hecatompedon","summary":{"en":"Hecatompedon is an Ancient Greek architectural name meaning “hundred-footed,” referring to an early Acropolis temple or a large sacred chamber linked to the Parthenon.","zh":"Hecatompedon 是古希腊建筑中的名称，意为“百尺之长”，可指雅典卫城的早期神庙，或与帕台农相关的大型圣室/内殿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek architecture) A name meaning “hundred-footed,” used for an early temple on the Athenian Acropolis and also for a large sacred hall/inner chamber associated with the Parthenon.","zh":"（古希腊建筑）意为“百尺之长”的名称，指雅典卫城上一座早期神庙，也可指与帕台农神庙相关的一处大型圣室/内殿。"},"examples":[{"en":"Some historians call the earliest large temple on the Acropolis the Hecatompedon.","zh":"一些历史学者把卫城上最早的大型神庙称为“Hecatompedon（百尺殿）”。"},{"en":"In museum labels, “Hecatompedon” may refer to a hall connected with the Parthenon complex.","zh":"在博物馆说明牌中，“Hecatompedon”有时指帕台农建筑群中的一处大厅/殿堂。"}]}],"synonyms":["Hekatompedon","Hundred-foot temple","Acropolis archaic temple"],"phonetic":"/ˌhɛkəˈtɑmpɪdən/","extraExplanation":["词源来自古希腊语：hekaton（百）+ pedon（脚/尺），字面就是“百英尺（约三十米左右）长”。它更像是一个“描述性名称”，而不一定是单一、固定的一座建筑的正式专名。","学术与导览语境里常见拼写差异：Hecatompedon 与 Hekatompedon（k/c 的转写差别）；中文也可译作“百尺殿/百尺神庙”。"]}
{"word":"Hecatoncheir","summary":{"en":"a hundred-handed giant from Greek mythology","zh":"希腊神话中的百臂巨人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, one of three gigantic brothers with a hundred hands and fifty heads (Briareus, Cottus, and Gyges), who fought for the Olympian gods.","zh":"（希腊神话）“百臂巨人”之一：拥有一百只手、五十个头的三兄弟巨人（布里阿瑞俄斯、科托斯、吉厄斯），曾在神战中帮助奥林匹斯诸神。"},"examples":[{"en":"In Greek myth, the Hecatoncheires were imprisoned in Tartarus before being released for the war against the Titans.","zh":"在希腊神话中，百臂巨人曾被关在塔耳塔罗斯，后来为对抗泰坦之战而被释放。"},{"en":"The poet compares the crashing waves to a Hecatoncheir striking the shore with a hundred hands.","zh":"诗人把拍岸的巨浪比作百臂巨人用一百只手猛击海岸。"}]}],"synonyms":["hundred-handed giant","Hecatonchires"],"phonetic":"ˌhɛkəˈtɑnkaɪr","extraExplanation":["百臂巨人常与“泰坦之战（Titanomachy）”相关：宙斯等奥林匹斯诸神释放他们后，借助其巨力与“投石如雨”的战斗方式击败泰坦。","英文里也会把 hecatoncheir（小写）借用来形容“拥有无数只手/力量惊人”的事物，尤其在文学描写中。"],"etymology":"源自希腊语 hekatón（“一百”）+ kheír/cheir（“手”），字面义即“百手者”。现代英文多用作单数神话专名；复数常见为 Hecatoncheires。","mnemonic":["拆词记：hecaton-≈“一百”(同源于 hecatomb “百牲祭”)；-cheir≈“手”。合起来就是“百只手”。","联想汉语：把它记成“赫卡顿+手（cheir）”→“赫卡顿”听起来像“很多很多”，对应“一百只手”。"]}
{"word":"Hecatoncheires","summary":{"en":"the “Hundred-Handers” of Greek myth","zh":"希腊神话中的“百臂（百手）巨人”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the three gigantic brothers with a hundred hands and fifty heads each, who fought for Zeus in the war against the Titans.","zh":"希腊神话中的“三个百臂巨人（百手巨人）”兄弟：每个都有一百只手、五十个头，曾在宙斯与泰坦的战争中助战。"},"examples":[{"en":"In Hesiod’s *Theogony*, the Hecatoncheires help Zeus defeat the Titans.","zh":"在赫西俄德的《神谱》中，百臂巨人帮助宙斯击败泰坦。"},{"en":"The artist painted the Hecatoncheires as a storm of arms hurling boulders.","zh":"画家把百臂巨人画成“手臂风暴”，疯狂投掷巨石。"}]}],"synonyms":["Hundred-Handers","Centimani"],"phonetic":"ˌhɛkəˈtɑnkaɪriz","extraExplanation":["常见别名：Briareus（布里阿瑞俄斯）、Cottus（科托斯）、Gyges（吉厄斯）。","在一些版本里，他们被用来看守/囚禁泰坦（如看守被关押在塔尔塔罗斯的克洛诺斯等）。","拉丁传统里也可见名称 Centimani（意为“百手者”）。"],"etymology":"源自古希腊语：hekaton（“一百”）+ cheir（“手”）。该词通常以复数形式指代这三位“百臂巨人”。","mnemonic":["拆词记：hecaton=“百”(联想“hecta- 百”) + cheir=“手”(像“cheir/cherish”用手珍爱) → “百手”。","想象“百只手一起扔石头”，就能记住他们在泰坦之战中充当强力火力支援。"]}
{"word":"hecatonstylon","summary":{"en":"Hecatonstylon means a “hundred-column hall,” especially the famous Hall of a Hundred Columns at Persepolis.","zh":"hecatonstylon 指“百柱厅/百柱大殿”，尤指波斯波利斯著名的“百柱厅”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hall or building characterized by (or named for) having a hundred columns; often used as a name for monumental columned halls in the ancient world (especially the “Hall of a Hundred Columns” at Persepolis).","zh":"（尤指古代遗址中的）“百柱厅/百柱大殿”；指以一百根柱子为显著特征、或因此得名的大厅或建筑（常用来指波斯波利斯的“百柱厅”）。"},"examples":[{"en":"The guide led us to the Hecatonstylon, where the bases of many columns still remain.","zh":"导游带我们到了百柱厅，那里仍能看到许多柱基的遗迹。"},{"en":"In descriptions of Persepolis, the Hecatonstylon is often mentioned alongside other grand palaces and terraces.","zh":"在对波斯波利斯的介绍中，百柱厅常与其他宏伟的宫殿与台地一起被提到。"}]}],"synonyms":["Hall of a Hundred Columns","Hundred-Column Hall"],"phonetic":"/ˌhɛkəˈtɑnstaɪlən/","extraExplanation":["词源上常被解释为来自希腊语：hekaton（“一百”）+ stylos（“柱子/立柱”），字面意思就是“百柱（之厅）”。","在英语材料里，它有时作为较文学化/学术化的称呼，和更直白的 Hall of a Hundred Columns（“百柱厅”）意思相近。阅读考古或古代史文章时见到更常见。"]}
{"word":"hecatontarchy","summary":{"en":"Hecatontarchy means government by a hundred rulers (often used rhetorically for rule by many leaders).","zh":"hecatontarchy 指“百人统治/百人共治”的政体，常作修辞用来强调由许多领导者共同掌权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of government ruled by one hundred people (or a council of a hundred rulers); more generally, rule by many leaders.","zh":"由一百人（或百人议会）统治的政体；也可泛指由许多领导者共同统治。"},"examples":[{"en":"In political satire, the fictional city was described as a hecatontarchy run by a hundred squabbling officials.","zh":"在政治讽刺作品中，这座虚构城市被描写成“百人统治”，由一百名争吵不休的官员掌权。"},{"en":"The author used “hecatontarchy” to criticize a system where too many rulers made decisions slow and unclear.","zh":"作者用“hecatontarchy（百人统治）”来批评统治者过多导致决策缓慢、责任不清的制度。"}]}],"synonyms":["rule by a council of a hundred","collective rule","oligarchy (broadly)","polyarchy (similar idea)"],"phonetic":"/ˌhɛkəˈtɑn.tɑr.ki/","extraExplanation":["这是个非常罕见、偏“造词/学术化”的政治学词，常见于修辞、讽刺或古典风格写作，而非日常英语。","词源：来自希腊语 hekaton（“一百”）+ -archy（“统治/政体”，如 monarchy 君主制、oligarchy 寡头制）。","在阅读中遇到时，通常不要求你把它当作现实世界常见政体，而是把它理解为“百人共治/多人掌权”的夸张说法，用来强调官僚化、扯皮或权力分散。"]}
{"word":"hecatontome","summary":{"en":"A very rare noun meaning a hundred-volume work or an extremely large book collection.","zh":"一个非常罕见的名词，指“百卷巨著/百卷书”，也可泛指规模极其庞大的书籍集合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a work or collection consisting of one hundred volumes or books (very rare; often used humorously or rhetorically).","zh":"百卷书；由一百册/一百卷组成的著作或文集（极罕见；常带夸张或幽默语气）。"},"examples":[{"en":"He joked that his research notes had grown into a hecatontome.","zh":"他开玩笑说自己的研究笔记已经膨胀成了一部“百卷书”。"},{"en":"The professor dreamed of publishing a hecatontome on American history, but settled for a single volume.","zh":"教授曾梦想出版一套关于美国历史的“百卷巨著”，最后还是收敛成了一本。"}]}],"synonyms":["hundred-volume work","hundred-volume series","massive series","multi-volume work"],"phonetic":"/ˌhɛkəˈtɑnˌtoʊm/","extraExplanation":["这个词非常少见，主要由希腊语词根 hecaton-（一百）+ tome（“卷/册”，源自希腊语 tomos“切开的一段”，引申为“书卷”）构成。多数情况下它不是真正精确地指“正好一百卷”，而是强调“数量极多、规模惊人”。","在现代英语里更常见的表达是 “a hundred-volume work/series”（百卷本/百卷丛书）或直接说 “a massive series”（庞大的系列）。"]}
{"word":"hecatophyllous","summary":{"en":"Hecatophyllous describes a plant with very many leaves (literally “hundred-leaved”).","zh":"hecatophyllous 用来形容植物“叶子非常多”（字面为“百叶的”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having many leaves; literally “hundred-leaved.”","zh":"（植物学）多叶的；字面意思是“有一百片叶子的”。"},"examples":[{"en":"In older botanical descriptions, the plant was called hecatophyllous because of its extremely dense foliage.","zh":"在较早的植物学描述中，这种植物因叶片极其繁密而被称为 hecatophyllous（多叶的）。"},{"en":"The shrub looks hecatophyllous in spring, when new leaves cover almost every twig.","zh":"到了春天新叶几乎覆盖每一根细枝时，这灌木看起来非常 hecatophyllous（叶子繁多）。"}]}],"synonyms":["many-leaved","leafy","densely foliated","polyphyllous"],"phonetic":"/ˌhɛkətoʊˈfɪləs/","extraExplanation":["词源提示：hecat- 来自希腊语，常与“百、许多”相关；-phyllous 来自希腊语 phyllon（叶）。因此它强调“叶子非常多”，并不一定真的“恰好一百片”。","使用场景：这是一个较少见、偏书面/学术的形容词，常出现在旧式植物学记载或较文学化的描写中；日常英语更常说 leafy、dense with leaves 或 many-leaved。"]}
{"word":"hecchsmhaer","summary":{"en":"“hecchsmhaer” doesn’t appear to be an English word; please check spelling or provide context.","zh":"“hecchsmhaer”看起来不是英文单词；请检查拼写或提供上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word. It may be a typo, random letters, or a misspelling of another word.","zh":"这不是一个被认可的英文单词。可能是拼写错误、随机字母，或某个单词的误拼。"},"examples":[{"en":"I couldn’t find “hecchsmhaer” in a dictionary—could you check the spelling?","zh":"我在词典里找不到“hecchsmhaer”——你能检查一下拼写吗？"},{"en":"If you tell me the sentence you saw it in, I can guess the intended word.","zh":"如果你告诉我它出现的句子，我可以帮你猜可能想表达的词。"}]}],"extraExplanation":["我目前无法把“hecchsmhaer”对应到常见英文词汇或短语。你可以：\n1）确认是否少/多打了字母；\n2）提供上下文句子；\n3）告诉我是人名、游戏ID、品牌、缩写，还是别的语言的词。\n\n如果你愿意，也可以把你想表达的中文意思发我，我来帮你找最合适的英文表达。"]}
{"word":"hecco","summary":{"en":"“Hecco” isn’t standard English; it’s likely a typo (often for “hello”) or a playful spelling.","zh":"“hecco”不是标准英语；多半是拼错（常见是“hello”）或玩笑式写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or a made-up spelling used online.","zh":"不是标准英语单词；通常是拼写错误，或网络上随意造的拼法。"},"examples":[{"en":"I think you meant “hello,” not “hecco.”","zh":"我觉得你想写的是“hello”，不是“hecco”。"},{"en":"“Hecco” doesn’t appear in most English dictionaries.","zh":"“hecco”在大多数英语词典里找不到。"}]}],"synonyms":["hello","hi","heck"],"phonetic":"/ˈhɛkoʊ/","extraExplanation":["“hecco”本身没有固定、通用的英文含义。最常见的情况是把“hello”（你好）打错了；也可能是想写“heck”（表示轻微的惊讶/不满，如“What the heck?”）。\n如果你告诉我你看到它的句子/语境（例如聊天记录或文章原句），我可以帮你判断它最可能想表达哪个词。"]}
{"word":"hecctkaerre","summary":{"en":"“hecctkaerre” is not a recognized English word; it is likely a typo or random letters.","zh":"“hecctkaerre”不是常见英文单词，可能是拼写错误或随机字母。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a misspelling or random letters, so it doesn’t have an established meaning in English dictionaries.","zh":"不是标准英文单词。看起来像拼写错误或随机字母，因此在英文词典中没有公认含义。"},"examples":[{"en":"I can’t find “hecctkaerre” in an English dictionary—could you check the spelling?","zh":"我在英文词典里找不到“hecctkaerre”——你能检查一下拼写吗？"},{"en":"If you meant another word, please send the sentence where you saw it.","zh":"如果你想查的是另一个词，请把你看到它的句子发给我。"}]}],"phonetic":"/hɛk.təˈkɛr.i/","extraExplanation":["这个字符串可能是：\n1）键盘乱按/随机字母；\n2）某个英文单词的拼写打错；\n3）某种代号、用户名、缩写或加密/打乱的字母。\n\n你可以告诉我：它出现在哪个句子/场景里？或者你想表达的中文意思是什么？我就能帮你推测你真正要查的英文词。"]}
{"word":"hecg","summary":{"en":"“hecg” isn’t a recognized English word; it’s likely a typo or an acronym that needs context.","zh":"“hecg”不是常见英语词；更可能是拼写错误或需要语境才能解释的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username, or an acronym whose meaning depends on context.","zh":"不是标准英语单词。可能是拼写错误、用户名，或某个缩写，其含义取决于上下文。"},"examples":[{"en":"I couldn’t find “hecg” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里找不到“hecg”——你能把你看到它的句子发我吗？"},{"en":"If “hecg” is an acronym, its meaning will depend on the field (school, work, medicine, etc.).","zh":"如果“hecg”是缩写，它的意思会取决于领域（学校、工作、医学等）。"}]}],"phonetic":"/ˌeɪtʃ iː siː dʒiː/","extraExplanation":["“hecg”很可能是键盘误打或字母顺序错误。你可以检查是否想输入这些常见单词之一：hedge（树篱/回避风险）、heck（口语：到底/见鬼，较委婉）、HCG（human chorionic gonadotropin，人绒毛膜促性腺激素；常见于医学/验孕语境）。","如果你把包含“hecg”的完整句子或它出现的场景（网页、聊天、课件、医学报告等）发来，我可以帮你判断最可能的意思。"]}
{"word":"hech","summary":{"en":"“Hech” is not a standard English word; it’s usually a misspelling of “heck,” an informal, mild exclamation.","zh":"“hech”不是标准英文单词；通常是把“heck”（一种较委婉的口语感叹词）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A common misspelling of “heck.”","zh":"（非标准）常见的拼写错误，通常是把“heck”拼成了“hech”。"},"examples":[{"en":"I think you meant “heck,” not “hech.”","zh":"我想你想写的是“heck”，不是“hech”。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show mild surprise, annoyance, or emphasis (a polite, softer form of “hell”).","zh":"用于表示轻微的惊讶、不耐烦或加强语气（是“hell”的较委婉说法）。"},"examples":[{"en":"What the heck is going on?","zh":"到底怎么回事？"},{"en":"Heck, I forgot my keys again.","zh":"哎呀，我又忘带钥匙了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A place or situation that is unpleasant (euphemistic for “hell”).","zh":"（非正式）令人难受的地方或处境（委婉说法，代替“hell”）。"},"examples":[{"en":"This homework is heck.","zh":"这作业太折磨人了。"}]}],"synonyms":["heck","darn","shoot"],"phonetic":"/hɛk/","extraExplanation":["“heck”是英语里很常见的委婉语（minced oath），用来避免说更粗鲁的“hell”。在口语和轻松的写作里很常见，但在正式写作中建议少用。","常见搭配：what/how/where/why the heck…（到底……）、heck yes/no（当然/才不）。"]}
{"word":"hechsher","summary":{"en":"Hechsher means a kosher certification or symbol showing a product meets Jewish dietary laws.","zh":"Hechsher 指“洁食认证/洁食标志”，表示产品符合犹太饮食法规。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kosher certification (often shown as a symbol on food packaging) that indicates a product has been checked and approved as meeting Jewish dietary laws (kashrut) by a rabbinic authority or certifying agency","zh":"（食品包装上常见的）洁食认证/标志，表示该产品经过拉比机构或认证机构审核，符合犹太饮食法规（kashrut/洁食规条）"},"examples":[{"en":"Look for a hechsher on the label if you need the product to be kosher.","zh":"如果你需要食品是洁食（kosher），就看标签上有没有 hechsher（洁食认证标志）。"},{"en":"This cheese has an OU hechsher, so it’s certified kosher.","zh":"这款奶酪有 OU 的 hechsher，所以它是经过洁食认证的。"},{"en":"Some people avoid items without a reliable hechsher.","zh":"有些人会避免购买没有可信 hechsher 的商品。"}]}],"synonyms":["kosher certification","kosher symbol","kosher seal"],"phonetic":"/ˈhɛkʃər/","extraExplanation":["“Hechsher”来自希伯来语，字面有“使合格/认可”的意思；在英语里多用于犹太社区与食品行业，指“洁食认证”或“洁食标志”。","常见的 hechsher 是一个小图标/字母组合，代表不同认证机构，例如 OU、OK、Star-K、Kof-K 等。不同机构的标准细节与监督力度可能略有差异，因此有些人会特别指定“接受哪一种 hechsher”。","需要注意：看到 hechsher 通常表示该产品符合洁食规条，但是否也符合个人的额外要求（如逾越节 Pesach 期间的更严格标准、是否是“Cholov Yisroel”等）还要看具体标注与个人习惯。"]}
{"word":"hechsherim","summary":{"en":"Hechsherim are kosher certifications (seals) showing a product meets Jewish dietary laws.","zh":"Hechsherim 指洁食认证（标志），表示产品符合犹太洁食法规。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"kosher certifications; official approvals (often shown as symbols on packaging) that a food product meets Jewish dietary laws (kashrut).","zh":"洁食认证；（常以包装上的符号呈现的）官方认证，表示食品符合犹太洁食法规（kashrut）。"},"examples":[{"en":"Many shoppers look for hechsherim like OU or OK on packaged foods.","zh":"很多消费者会在包装食品上寻找 OU 或 OK 等洁食认证标志（hechsherim）。"},{"en":"The factory updated its hechsherim after changing ingredient suppliers.","zh":"工厂更换原料供应商后，更新了其洁食认证（hechsherim）。"},{"en":"Some communities prefer stricter hechsherim for meat and dairy products.","zh":"有些社群对肉类和乳制品会偏好更严格的洁食认证（hechsherim）。"}]}],"synonyms":["kosher certifications","kosher seals","kosher approval marks"],"phonetic":"/ˈhɛkʃərɪm/","extraExplanation":["“Hechsherim”是希伯来语“hechsher（认证/许可）”的复数形式，在英文里多用于犹太洁食语境。常见的认证符号包括 OU、OK、Star-K、Kof-K 等，通常印在食品包装上，表示该产品在特定监督下符合洁食要求。","洁食认证的严格程度可能因监督机构、地区与社群传统而不同；同一种食品在不同社群里可能会被要求不同等级的 hechsher。"]}
{"word":"hechshers","summary":{"en":"“Hechshers” are kosher certification marks on food packaging.","zh":"“Hechshers”指食品包装上的犹太洁食认证标志。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kosher certification mark or seal on food, showing it has been checked and approved as kosher by a recognized rabbinic authority","zh":"（食品上的）犹太洁食认证标志/印章，表示该食品经认可的拉比机构检查并认定符合犹太洁食（kosher）规定"},"examples":[{"en":"I always look for a hechsher on packaged snacks to make sure they’re kosher.","zh":"我买包装零食时总会看有没有 hechsher，确保它是洁食。"},{"en":"This cheese has a hechsher, so it meets kosher standards.","zh":"这款奶酪有 hechsher，所以符合洁食标准。"},{"en":"Different communities may prefer different hechshers.","zh":"不同社群可能更偏好不同的洁食认证标志（hechshers）。"}]}],"synonyms":["kosher certification","kosher seal","kosher symbol","kosher mark"],"phonetic":"/ˈhɛkʃər/","extraExplanation":["“Hechsher”（希伯来语来源）常见于北美英语，指包装食品上的洁食认证符号，例如 OU、OK、Star-K、Kof-K 等。它表示产品在原料、生产流程、设备清洁/分线等方面符合犹太洁食规定。","严格来说，复数常见写法是 “hechshers” 或 “hechsherim”（更接近希伯来语复数），两种在英语语境中都能见到。","在实际交流里，人们也会直接说 “kosher certification” 或 “kosher seal”，含义更直观。"]}
{"word":"hecht","summary":{"en":"“Hecht” is most commonly a surname; it can also mean “pike” when borrowed from German.","zh":"“Hecht”最常见作姓氏；在借自德语的语境中也可指“狗鱼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), especially in German- and Jewish-American contexts.","zh":"姓氏（家族名），常见于德语背景或犹太裔美国人等群体。"},"examples":[{"en":"Ben Hecht was a famous American screenwriter and journalist.","zh":"本·赫克特（Ben Hecht）是一位著名的美国编剧和记者。"},{"en":"The article was written by Dr. Hecht.","zh":"这篇文章是赫克特博士写的。"}]},{"partOfSpeech":"n.","definition":{"en":"(from German) a pike (a type of freshwater fish).","zh":"（源自德语）狗鱼（淡水鱼的一种）。"},"examples":[{"en":"In German, “Hecht” means “pike.”","zh":"在德语中，“Hecht”意思是“狗鱼”。"},{"en":"They served Hecht in a creamy sauce.","zh":"他们端上了奶油酱汁的狗鱼。"}]}],"synonyms":["(as a surname) none","(German sense) pike"],"phonetic":"/hɛkt/","extraExplanation":["“Hecht”在英语里最常见的是人名/姓氏，因此通常首字母大写：Hecht。","文化补充：Ben Hecht（1894–1964）在好莱坞“黄金时代”非常有影响力，参与多部经典电影剧本写作；在阅读电影史或美国新闻写作相关材料时可能会遇到这个姓。","如果你是在菜单、德语课本或欧洲语境中看到“hecht/Hecht”，更可能指“狗鱼”这种鱼。"]}
{"word":"hechtia","summary":{"en":"Hechtia is a genus of spiny bromeliad plants from Mexico and Central America.","zh":"Hechtia 指原产于墨西哥和中美洲、带刺的凤梨科植物“赫氏凤梨属”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of spiny, rosette-forming bromeliad plants native mainly to Mexico and Central America, often grown as ornamental xeric (dry-climate) plants","zh":"（植物）赫氏凤梨属：凤梨科的一属植物，多为带刺的莲座状叶丛，主要原产于墨西哥和中美洲，常作为耐旱观赏植物栽培"},"examples":[{"en":"Hechtia species are well adapted to dry, rocky habitats.","zh":"赫氏凤梨属的许多物种非常适应干燥、多岩石的生境。"},{"en":"The garden’s succulent bed includes agaves and a few Hechtia plants.","zh":"花园的多肉区里有龙舌兰，也种了几株赫氏凤梨属植物。"}]}],"synonyms":["bromeliad (broader term)","genus (taxonomy term)"],"phonetic":"/ˈhɛk.ti.ə/","extraExplanation":["“Hechtia”是植物学中的拉丁学名，通常首字母大写、斜体书写（Hechtia）。","该属植物多分布在半干旱地区，叶缘常有硬刺，外形像“凤梨/菠萝科”的耐旱型观赏植物。","名称一般被认为是为纪念18世纪的德国顾问兼植物爱好者Johann Hecht（常见于植物命名传统）。"]}
{"word":"heck","summary":{"en":"“Heck” is a mild, informal word used to express emotion or as a softer substitute for “hell.”","zh":"“heck”是非正式且较委婉的词，用来表达情绪，或替代更强的“hell”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show mild surprise, annoyance, emphasis, or to soften a stronger swear word (a milder alternative to “hell”).","zh":"用于表达轻微的惊讶、不耐烦、强调，或作为更强脏话（如“hell”）的委婉替代。"},"examples":[{"en":"What the heck is going on?","zh":"到底怎么回事？"},{"en":"Heck, I forgot my keys again.","zh":"哎呀，我又忘带钥匙了。"},{"en":"It was heck of a long day.","zh":"那真是漫长得要命的一天。"}]},{"partOfSpeech":"n.","definition":{"en":"A place or situation considered very unpleasant or difficult; a mild form of “hell.”","zh":"非常糟糕或艰难的地方/处境；“hell”的委婉说法。"},"examples":[{"en":"After the storm, the town looked like heck.","zh":"暴风雨过后，小镇看起来一团糟。"},{"en":"My schedule is heck this week.","zh":"我这周的日程忙得要命/糟透了。"}]}],"synonyms":["darn","shoot","jeez","what on earth","the devil (in some contexts)"],"phonetic":"/hɛk/","extraExplanation":["“heck”在日常口语里很常见，语气比“hell”更轻，适合不想说粗话但又想表达情绪的场合。","常见搭配：what the heck（到底怎么…）、heck yeah（当然/太好了，较口语）、the heck with…（去它的/别管…）。其中有些表达在正式写作中不太适合。"]}
{"word":"heckelphone","summary":{"en":"Heckelphone: a rare low‑pitched double‑reed woodwind, similar to a bass oboe.","zh":"Heckelphone：一种罕见的低音乐双簧木管乐器，类似低音双簧管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare double‑reed woodwind instrument that sounds lower than the oboe, similar to a bass oboe.","zh":"一种罕见的双簧木管乐器，音域比双簧管更低，音色与“低音双簧管/巴斯双簧管”相近。"},"examples":[{"en":"The composer wrote a dark, reedy line for the heckelphone in the orchestra.","zh":"作曲家在管弦乐队里为 heckelphone 写了一段阴暗、带芦苇质感的旋律。"},{"en":"Because a heckelphone is hard to find, many performances use a bass oboe instead.","zh":"由于 heckelphone 很难找到，很多演出会改用低音双簧管来代替。"}]}],"synonyms":["bass oboe"],"phonetic":"/ˈhɛkəlˌfoʊn/","extraExplanation":["Heckelphone 源自德国乐器制造商 Wilhelm Heckel（赫克尔），20世纪初为填补双簧管低音音域而发展出来，因此在大型管弦乐作品中偶尔出现，但数量稀少、演奏者也较少。","在乐团与配器语境里，heckelphone 常与 bass oboe（低音双簧管）一起被提到；两者音色与构造相近，但并非完全相同。","它常被用来营造厚重、神秘或带“阴影感”的中低音色彩；谈到文学/音乐语境时，通常出现在乐谱说明、配器讨论或作曲家配器特色的描述中。"]}
{"word":"heckerism","summary":{"en":"Heckerism is a rare historical term meaning the ideas or movement associated with a person named Hecker—most often Friedrich Hecker (1848 revolutionary politics) or, in Catholic history, Isaac Hecker.","zh":"Heckerism 是一个少见的历史用语，指与某位名叫 Hecker 的人物相关的思想或运动——最常见是1848年革命政治中的 Friedrich Hecker；在天主教史语境中也可指 Isaac Hecker 相关观念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political stance or movement associated with Friedrich Hecker and his followers, especially the radical democratic ideas linked to the German revolutions of 1848.","zh":"（历史）“海克尔主义”：与德国1848年革命人物弗里德里希·海克尔（Friedrich Hecker）及其追随者相关的政治立场或运动，常指当时更激进的民主思想。"},"examples":[{"en":"Some historians describe Heckerism as a symbol of the more radical wing of the 1848 revolution.","zh":"一些历史学者把“海克尔主义”描述为1848年革命中更激进派别的象征。"},{"en":"Heckerism appealed to people who wanted faster and deeper democratic reforms.","zh":"“海克尔主义”吸引了那些希望更快、更彻底民主改革的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Catholic history) Ideas attributed to Isaac Hecker and his supporters, sometimes discussed in debates about “Americanism” in the late 19th century.","zh":"（天主教史）“海克尔主义”：与艾萨克·海克尔（Isaac Hecker）及其支持者相关、并在19世纪末“美国主义”（Americanism）争论中被讨论的一些观念。"},"examples":[{"en":"In some church-history writings, Heckerism is mentioned alongside the controversy over “Americanism.”","zh":"在一些教会史著作中，“海克尔主义”常与“美国主义”争论一起被提到。"},{"en":"The author warns against reading Heckerism as one simple, unified doctrine.","zh":"作者提醒不要把“海克尔主义”理解为一种单一、统一的教义。"}]}],"synonyms":["radicalism","revolutionary politics","ideology","movement"],"phonetic":"/ˈhɛkərˌɪzəm/","extraExplanation":["这个词非常少见，通常只在历史语境中出现，而且“指谁的 Hecker”取决于上下文：要么是1848年德国革命者 Friedrich Hecker（政治史），要么是美国天主教人物 Isaac Hecker（宗教史）。阅读时可通过附近出现的年份、地点（德国/美国）或主题（革命/教会争论）来判断。","构词上，-ism 常表示“主义/思潮/风格”（如 liberalism 自由主义），因此 Heckerism 直译就是“与 Hecker 相关的主义/思潮”。"]}
{"word":"heckimal","summary":{"en":"Hexadecimal: the base-16 number system (0–9, A–F); also a base-16 number.","zh":"Hexadecimal：十六进制（0–9与A–F）；也可指一个十六进制数。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended word) relating to the number system with base 16, using digits 0–9 and letters A–F (or a–f).","zh":"（可能想写的词）十六进制的：一种以16为基数的计数系统，使用数字0–9和字母A–F（或a–f）。"},"examples":[{"en":"Computers often represent colors in hexadecimal, like #FF8800.","zh":"计算机常用十六进制表示颜色，比如 #FF8800。"},{"en":"The hexadecimal number 1A equals 26 in decimal.","zh":"十六进制的 1A 等于十进制的 26。"}]},{"partOfSpeech":"n.","definition":{"en":"a number written in base 16.","zh":"十六进制数：用16进制写出的数字。"},"examples":[{"en":"Can you convert this hexadecimal to decimal?","zh":"你能把这个十六进制数转换成十进制吗？"},{"en":"0x7F is a common hexadecimal value in programming.","zh":"0x7F 是编程里常见的十六进制数值。"}]}],"synonyms":["base-16","hex"],"phonetic":"/ˌhɛksəˈdɛsɪməl/","extraExplanation":["“heckimal” 不是常见英语单词，更像是把 “hexadecimal（十六进制）” 拼错了。","十六进制常见于计算机领域：内存地址、颜色（#RRGGBB）、权限/位运算等。前缀 “0x” 常用来标记十六进制（如 0xFF）。","相关词：decimal（十进制，base 10）、binary（二进制，base 2）、octal（八进制，base 8）。"]}
{"word":"heckle","summary":{"en":"Heckle means to interrupt a speaker or performer with rude or mocking comments; it can also mean such a comment.","zh":"Heckle 指用粗鲁或嘲讽的话打断讲话/表演（起哄、刁难），也可指这种插话本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to interrupt a speaker or performer by shouting rude, aggressive, or teasing comments (often from the audience)","zh":"（常指观众）在别人讲话或表演时大声插话、起哄、嘲讽或刁难"},"examples":[{"en":"Some people in the crowd began to heckle the comedian during his set.","zh":"有些观众在喜剧演员表演时开始起哄嘲讽。"},{"en":"She tried to finish her speech even as protesters heckled her.","zh":"尽管抗议者不停起哄刁难，她还是努力把演讲讲完。"},{"en":"Don’t heckle the presenter—save your questions for the end.","zh":"别在台下起哄打断演讲者——把问题留到最后。"}]},{"partOfSpeech":"n.","definition":{"en":"a rude or mocking shout or comment that interrupts a speaker or performer","zh":"起哄的喊声；嘲讽/刁难性的插话"},"examples":[{"en":"The singer handled the heckles calmly and kept performing.","zh":"歌手冷静应对台下的起哄，继续表演。"},{"en":"He ignored a heckle from the back of the room.","zh":"他无视了房间后排的一声嘲讽插话。"}]}],"synonyms":["jeer","mock","taunt","interrupt","badger"],"phonetic":"ˈhɛkəl","extraExplanation":["“heckle”常见于演讲、政治集会、脱口秀/喜剧表演等场合。带有强烈的“打断并让对方难堪”的意味，语气通常比“interrupt”更负面。","在英美喜剧文化里，观众“heckle”并不总是暴力或恶意，但对表演者是一种挑战；优秀的喜剧演员有时会用机智的“comeback”（回怼）化解。"]}
{"word":"heckled","summary":{"en":"“Heckled” means someone shouted rude or mocking comments to interrupt a speaker or performer.","zh":"“heckled”指在现场对演讲者或表演者大声起哄、嘲讽或挑衅性插话，以打断对方。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to shout rude, critical, or teasing remarks at someone (often a speaker or performer), usually to interrupt them","zh":"（常指在公开场合）向某人（如演讲者/表演者）大声喊出无礼、挑衅或嘲讽的话，试图打断"},"examples":[{"en":"The comedian was heckled during her set, but she stayed calm.","zh":"那位喜剧演员表演时被观众起哄嘲讽，但她依然很冷静。"},{"en":"He was heckled by protesters as he walked into the building.","zh":"他走进大楼时，被抗议者大声嘲讽和叫喊。"},{"en":"The speaker got heckled, so the host asked the audience to be respectful.","zh":"演讲者被人起哄打断后，主持人请观众保持尊重。"}]}],"synonyms":["jeered","taunted","badgered","harassed"],"phonetic":"/ˈhɛkəld/","extraExplanation":["“heckled”是动词“heckle”的过去式/过去分词。常见搭配：be heckled（被起哄）、heckle a speaker/performer（起哄某位演讲者/表演者）。","语气通常是负面的，表示故意打断或羞辱。与“criticize”不同，heckle 强调在现场大声插话、带挑衅或嘲笑意味。","在政治集会、脱口秀/喜剧演出、公众演讲中很常见；一些喜剧演员会用“comeback”（机智回怼）来应对 heckling。"]}
{"word":"heckler","summary":{"en":"A heckler is someone who rudely interrupts a speaker or performer; to heckle means to do that.","zh":"heckler 指在现场用粗鲁/挑衅言论打断演讲或表演的人；heckle 指这种起哄、喝倒彩的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who interrupts a public speaker or performer with rude or challenging comments","zh":"（在公开场合）用粗鲁或挑衅的话打断演讲者或表演者的起哄者；喝倒彩的人"},"examples":[{"en":"The comedian handled the heckler calmly and kept the show moving.","zh":"那位喜剧演员冷静地应对起哄者，让演出继续进行。"},{"en":"Security asked the heckler to leave the event.","zh":"安保人员要求那名起哄者离开现场。"}]},{"partOfSpeech":"v.","definition":{"en":"to interrupt a speaker or performer with rude comments or criticism","zh":"（在现场）用粗鲁的话插嘴、起哄、喝倒彩"},"examples":[{"en":"Someone started to heckle during the politician’s speech.","zh":"那位政治人物演讲时，有人开始起哄。"},{"en":"It’s easier to heckle than to have a respectful debate.","zh":"起哄比进行有礼貌的辩论更容易。"}]}],"synonyms":["interrupter","taunter","rabble-rouser"],"phonetic":"/ˈhɛklər/","extraExplanation":["“heckle”常见于喜剧俱乐部、政治集会、体育比赛等现场语境，强调“当场打断+带攻击性/嘲讽”的互动；比普通的“criticize（批评）”更具有现场对抗感。","在文化语境中，英语里常说“deal with a heckler（应对起哄者）”。优秀表演者会用幽默化解，但在正式场合（如演讲、课堂）通常被视为不礼貌行为。"]}
{"word":"hecklers","summary":{"en":"“Hecklers” means people who interrupt performers or speakers with rude or critical comments.","zh":"“hecklers”指在观众中起哄、喝倒彩、用嘲讽或打断方式干扰演讲或表演的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person in an audience who interrupts a speaker or performer with rude, loud, or critical comments.","zh":"（在观众中）起哄者；喝倒彩的人；用粗鲁、嘲讽或打断方式干扰表演/演讲的人。"},"examples":[{"en":"The comedian handled the hecklers calmly and kept telling jokes.","zh":"那位喜剧演员冷静地应对起哄者，继续讲笑话。"},{"en":"Security asked the hecklers to leave the theater.","zh":"保安请那些喝倒彩的人离开剧院。"},{"en":"Online hecklers flooded the livestream with insults.","zh":"网络喷子在直播间刷屏辱骂。"}]}],"synonyms":["disrupters","troublemakers","catcallers","haters"],"phonetic":"/ˈhɛklɚz/","extraExplanation":["“heckler”常见于喜剧演出、政治集会、公开演讲等场合；在网络语境里也可指“喷子/带节奏的人”。语气通常带负面评价。","词源上与19世纪英国/苏格兰的公开集会与激烈提问有关，后来逐渐演变为“故意打断、嘲讽”的含义。"]}
{"word":"heckles","summary":{"en":"“Heckles” usually refers to rude interruptions or jeering comments aimed at a public speaker or performer; it can also be the plural form of “heckle.”","zh":"“heckles”通常指对公众演讲者/表演者的起哄打断或嘲讽性喊话（也可理解为动词 heckle 的第三人称单数或名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person or crowd) to interrupt a speaker, performer, or athlete with rude or challenging comments or questions.","zh":"（人或人群）对演讲者/表演者/运动员起哄、嘲讽式打断，提出尖刻或挑衅性的问题。"},"examples":[{"en":"The politician was heckled during the debate.","zh":"那位政治家在辩论中被人起哄打断。"},{"en":"Some fans kept heckling the referee from the stands.","zh":"一些球迷在看台上不停嘲讽裁判。"},{"en":"She tried to stay calm even when people heckled her.","zh":"即使有人起哄，她也努力保持冷静。"}]},{"partOfSpeech":"n.","definition":{"en":"Rude, noisy comments shouted at someone in public; jeers (often used in the plural: “heckles”).","zh":"当众冲某人喊的粗鲁吵闹的讥讽话；嘘声、奚落（常用复数 heckles）。"},"examples":[{"en":"He ignored the heckles and finished his speech.","zh":"他无视起哄声，完成了演讲。"},{"en":"The comedian turned the heckles into a joke.","zh":"那位喜剧演员把起哄声顺势变成了笑点。"}]},{"partOfSpeech":"n.","definition":{"en":"A comb-like tool used for combing flax or hemp; the action of combing these fibers (rare today).","zh":"（较少用）梳理亚麻或大麻纤维的梳具；梳理这些纤维的动作。"},"examples":[{"en":"In traditional flax processing, workers used heckles to comb the fibers.","zh":"在传统的亚麻加工中，工人会用梳具来梳理纤维。"}]}],"synonyms":["jeer","taunt","mock","interrupt","harass","catcall"],"phonetic":"/ˈhɛkəl/","extraExplanation":["“heckle”最常见的语境是公共场合（政治演讲、脱口秀、体育比赛）里观众的“起哄/刁难式提问”。语气通常是负面的，但在喜剧表演中，演员有时会把heckling当作即兴互动的一部分。","词源上，“heckle”原本指梳理亚麻纤维的工具/动作，后来引申为“用尖刻问题反复挑刺”。","注意别和“hackles”混淆：hackles 指动物颈背部竖起的毛（raise someone’s hackles = 惹怒某人）。拼写只差一个字母，但意思不同。"]}
{"word":"heckling","summary":{"en":"Heckling is interrupting a speaker or performer with rude or mocking comments; it can be a noun (the act) or a verb (to do it).","zh":"Heckling 指用粗鲁或嘲讽的话打断演讲者/表演者；既可作名词（起哄行为），也可作动词（起哄打断）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of interrupting a speaker or performer with rude, mocking, or critical comments (often to distract or embarrass them).","zh":"（对演讲者/表演者的）起哄、嘲弄式打断；用讥讽或挑衅的话干扰。"},"examples":[{"en":"The comedian dealt with heckling by turning it into a joke.","zh":"这位喜剧演员用开玩笑的方式化解了观众的起哄。"},{"en":"Security removed a man for constant heckling during the speech.","zh":"因为在演讲中不断起哄，保安把那名男子带走了。"}]},{"partOfSpeech":"v.","definition":{"en":"to interrupt someone—especially a public speaker or performer—with mocking or hostile comments.","zh":"（尤指在公开场合）起哄、嘲讽式打断某人；用敌意或戏弄的话干扰。"},"examples":[{"en":"Someone kept heckling the speaker from the back of the room.","zh":"有人在教室后面不停地起哄打断演讲者。"},{"en":"Please don’t heckle—save your questions for the end.","zh":"请不要起哄打断——把问题留到最后再问。"}]}],"synonyms":["jeering","taunting","mocking","catcalling","baiting"],"phonetic":"/ˈhɛklɪŋ/","extraExplanation":["“Heckling”常见于喜剧现场、政治演讲、公开辩论等场景。适度的互动在某些文化语境（如英美单口喜剧）里可能被视为“气氛”，但带有人身攻击、种族/性别歧视或持续打断通常会被认为不礼貌甚至会被请离场。","词源上，heckle 原本指在纺织业中“梳理亚麻纤维”的工具/动作，后来引申为“刁难、挑刺式盘问”，再发展为如今“起哄干扰”的含义。"]}
{"word":"hecks","summary":{"en":"“Hecks” usually means the plural of “heck,” a mild exclamation used instead of stronger swearing; it can also be a less common informal verb.","zh":"“hecks”通常是“heck”的复数，表示用来替代更强脏话的轻微感叹；也可作不太常见的非正式动词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Mild exclamations of annoyance or surprise; euphemistic alternatives to stronger swear words like “hell.”","zh":"（名词复数）表示恼怒或惊讶的轻微感叹词；是比“hell”等更温和的替代说法。"},"examples":[{"en":"What the heck is going on here?","zh":"这到底（搞什么）怎么回事？"},{"en":"He muttered a few “hecks” under his breath when the computer crashed.","zh":"电脑死机时，他小声嘟囔了几句“heck”来发泄不满。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, informal) To react with mild frustration, or to question/criticize in a casual way (often in expressions like “heckle” is different; “heck” as a verb is less common).","zh":"（动词，非正式）带点不耐烦地反应，或随口质疑/吐槽（注意：与“heckle”不同；“heck”作动词相对少见）。"},"examples":[{"en":"He hecks at every little mistake during practice.","zh":"练习时他对每个小错误都会忍不住吐槽两句。"},{"en":"Don’t heck me about being five minutes late.","zh":"别因为我迟到五分钟就一直念叨我。"}]}],"synonyms":["darn","shoot","what on earth","goodness"],"phonetic":"/hɛk/","extraExplanation":["“heck”常见于口语，作为“hell”的委婉说法：What the heck…? / Where the heck…? 表达惊讶、不耐烦或强调，但比直接爆粗更礼貌。","注意拼写与词义：heckle（起哄、嘲讽）是另一个词；hectic（忙乱的）也不同。","语气提示：在正式写作中通常避免使用“what the heck”；在对长辈、上司或正式场合，改用“What on earth…?” 或 “What’s going on?” 更稳妥。"]}
{"word":"hect","summary":{"en":"“hect- / hect” means “one hundred” and is used as a metric prefix in some unit words.","zh":"“hect- / hect”表示“一百”，常作为公制词头用于一些单位词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a metric (SI) prefix meaning “one hundred” (100×), used in some measurement words like hectometer and hectopascal","zh":"公制（SI）词头，表示“一百”（100倍），用于一些单位名称中，如 hectometer（百米）和 hectopascal（百帕）"},"examples":[{"en":"A hectometer (hm) equals 100 meters.","zh":"hectometer（hm，百米）等于100米。"},{"en":"Weather reports sometimes use hectopascals (hPa) to measure air pressure.","zh":"天气预报有时用 hectopascal（hPa，百帕）来表示气压。"}]}],"synonyms":["centum- (rare/learned)","hundred- (meaning-based, not a metric prefix)"],"phonetic":"/hɛkt/","extraExplanation":["“hect-”来自希腊语 hekaton（意为“一百”）。在SI词头里它不如 kilo-（千）常见，但在气压（hPa）等领域仍很常用。","注意：单独写作“hect”在现代英语里不算常见独立词，更常见的是作为词头出现在复合单位里（hectometer, hectopascal 等）。"]}
{"word":"hectar","summary":{"en":"“Hectar” usually refers to “hectare,” a land-area unit equal to 10,000 m².","zh":"“hectar”通常指“hectare（公顷）”，一种土地面积单位，等于10,000平方米。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common spelling: hectare) a unit for measuring land area equal to 10,000 square meters (about 2.47 acres).","zh":"（常见拼写：hectare）公顷：一种测量土地面积的单位，等于10,000平方米（约2.47英亩）。"},"examples":[{"en":"The farm covers about 20 hectares.","zh":"这个农场占地大约20公顷。"},{"en":"They planted rice on five hectares of land.","zh":"他们在五公顷的土地上种了水稻。"}]}],"synonyms":["hectare","ha (abbreviation)","acre (different unit, common in the U.S.)"],"phonetic":"/ˈhɛkˌtɛr/","extraExplanation":["“hectar”通常是“hectare”的拼写错误或少见变体。英语中更标准、最常用的拼写是hectare（英式常见），在美式英语中也能见到，但日常美国生活里更常用acre（英亩）。","词源小提示：hectare来自公制系统，hect-表示“百”（100），are是面积单位；1 hectare = 100 ares。"]}
{"word":"hectare","summary":{"en":"A hectare is a metric unit for measuring land area: 10,000 square meters (about 2.47 acres).","zh":"hectare（公顷）是衡量土地面积的公制单位：10,000平方米（约2.47英亩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metric unit of area equal to 10,000 square meters, commonly used to measure land","zh":"公顷（面积单位），等于10,000平方米，常用于衡量土地面积"},"examples":[{"en":"The farm covers 20 hectares of land.","zh":"这个农场占地20公顷。"},{"en":"They planted trees on 5 hectares near the river.","zh":"他们在河边的5公顷土地上种了树。"},{"en":"The park is about 1 hectare in size.","zh":"这个公园面积大约1公顷。"}]}],"synonyms":["ha (abbreviation)"],"phonetic":"/ˈhɛk.tɛr/","extraExplanation":["“hectare”常缩写为“ha”。","换算：1公顷=10,000平方米；约等于2.47英亩（acres）。在美国日常更常用“acre”，但在科学、国际新闻和农业/土地规划中也会看到“hectare”。","词源提示：hect-表示“百”（100），are是一个面积单位（100平方米）。所以hectare=100个are=10,000平方米。"]}
{"word":"hectares","summary":{"en":"Hectares means the plural of hectare, a metric land-area unit equal to 10,000 m² (about 2.47 acres).","zh":"Hectares是hectare（公顷）的复数，表示土地面积单位：1公顷=10,000平方米，约2.47英亩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hectare: a metric unit for measuring land area equal to 10,000 square meters (a square 100 m × 100 m), about 2.47 acres.","zh":"hectare（公顷）的复数：用于测量土地面积的公制单位，等于10,000平方米（100米×100米的正方形），约等于2.47英亩。"},"examples":[{"en":"The farm covers 50 hectares of land.","zh":"这个农场占地50公顷。"},{"en":"They plan to protect 2,000 hectares of forest.","zh":"他们计划保护2,000公顷的森林。"},{"en":"The fire burned hundreds of hectares in just two days.","zh":"大火在短短两天内烧毁了数百公顷的土地。"}]}],"synonyms":["ha (abbreviation)","acres (approximate, different unit)","square meters (m², exact metric area)"],"phonetic":"/ˈhɛk.tɛrz/","extraExplanation":["“hectare”常用于农业、林业、环境新闻和土地规划等语境。在美国日常生活中更常见的是“acre（英亩）”，但在国际报道、学术与官方文件中“hectare/ha（公顷）”非常常用。","书写上常见缩写“ha”，例如“100 ha = 100 hectares（100公顷）”。注意“hectares”发音末尾是清晰的 /z/ 音，表示复数。"]}
{"word":"hecte","summary":{"en":"“Hectic” means very busy and fast-paced, often stressful or a bit chaotic.","zh":"“hectic”表示非常忙、节奏很快，常带有紧张或略混乱的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled) very busy, fast, and sometimes stressful or chaotic.","zh":"（常见拼写）非常忙碌、节奏很快，常常让人紧张或有点混乱的。"},"examples":[{"en":"I’ve had a hectic week at work, so I’m going to rest this weekend.","zh":"我这周工作特别忙（很奔波），所以周末要休息。"},{"en":"The airport gets hectic during the holiday season.","zh":"节假日期间机场会变得非常繁忙、很拥挤。"},{"en":"She gave herself a few quiet minutes after the hectic morning.","zh":"在忙乱的早晨之后，她给自己留了几分钟安静时间。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a period of busy, noisy activity.","zh":"（较少见）一段忙碌、嘈杂的活动时期。"},"examples":[{"en":"After the morning hectic, the office finally calmed down.","zh":"早上的一阵忙乱过后，办公室终于安静下来了。"}]}],"synonyms":["busy","frantic","chaotic","frenzied","stressful","fast-paced"],"phonetic":"/ˈhɛktɪk/","extraExplanation":["你输入的 “hecte” 更像是拼写错误；常见正确拼写是 **hectic**。","词源上来自希腊语，原意与“持续的发热（hectic fever）”有关；后来引申为“紧张忙乱、让人疲惫的节奏”。现代英语里最常用的是形容“生活/工作节奏很赶”。"]}
{"word":"hectic","summary":{"en":"Hectic describes something very busy and fast-paced, often stressful or a bit chaotic.","zh":"hectic 指非常忙、节奏很快，常带压力或有点混乱的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very busy, fast, and full of activity, often in a stressful or confusing way.","zh":"非常忙碌、节奏很快、事情很多的（常带有压力或有点混乱的感觉）。"},"examples":[{"en":"My schedule has been hectic this week, so I haven’t had time to cook.","zh":"我这周行程非常忙，所以没时间做饭。"},{"en":"The airport was hectic during the holiday rush.","zh":"假期出行高峰时，机场非常忙乱。"},{"en":"She took a deep breath to stay calm in the hectic office.","zh":"在忙乱的办公室里，她深呼吸让自己保持冷静。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person) Living or working in a way that is constantly busy and tiring.","zh":"（形容人）生活或工作一直很忙、很累、节奏很快的。"},"examples":[{"en":"He leads a hectic life as a nurse and a parent.","zh":"作为护士又要带孩子，他过着非常忙碌的生活。"},{"en":"After years of hectic travel, she wanted a quieter routine.","zh":"多年奔波忙碌之后，她想要更安静规律的生活。"}]}],"synonyms":["busy","frantic","chaotic","frenzied","hectic"],"phonetic":"/ˈhɛktɪk/","extraExplanation":["“hectic”常用来形容“忙到让人压力大/有点乱”的状态，比单纯的“busy”更强调紧张和混乱感。","词源上它曾与“发热、脸红（像发烧）”有关，后来引申为“忙得发烫、忙得脸红”的感觉；现代英语里主要用作“忙乱、紧张”。","常见搭配：a hectic day/week（忙乱的一天/一周）, hectic schedule（紧凑而忙乱的日程）, hectic pace（快而紧张的节奏）。"]}
{"word":"hectic schedule","summary":{"en":"an extremely busy and often stressful timetable","zh":"极其忙碌、常带压力的日程安排"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a very busy timetable with many tasks and little free time","zh":"非常忙碌的日程安排（事情多、空闲少）"},"examples":[{"en":"I can’t meet this week—I have a hectic schedule.","zh":"我这周没法见面——我的日程很紧很忙。"},{"en":"With a hectic schedule, she often eats lunch at her desk.","zh":"日程很忙的时候，她经常在工位上吃午饭。"},{"en":"Try to leave some breaks in your hectic schedule.","zh":"尽量在你忙乱的日程里留出一些休息时间。"}]}],"synonyms":["busy schedule","packed schedule","tight schedule","full schedule","jam-packed schedule"],"phonetic":"/ˈhɛktɪk ˈskɛdʒuːl/","extraExplanation":["语感上，“hectic”常带一点“忙得有点乱/压力大”的感觉，不只是“忙（busy）”。如果只是客观事情多但不乱，可用 “busy schedule”；如果强调把时间排得很满，可用 “packed schedule”。","常见搭配：a hectic week/day, a hectic work schedule, keep a hectic schedule（保持很忙的作息/安排）。"],"etymology":"“hectic”原指（因发烧/肺结核等导致的）“脸红发热、消耗性的”，后来引申为“兴奋而忙乱的、节奏很快的”；“schedule”来自表示“清单/时间表”的词源，合起来就表示“忙到很赶的时间表”。","mnemonic":["联想：hectic 听起来像“黑的（hec-）+ 急（-tic）”，=“急得发黑”，表示忙乱到有压力。","把它当成固定搭配记：hectic + schedule（忙乱的 + 日程）。"]}
{"word":"hectical","summary":{"en":"Likely intended word: hectic — very busy and fast-paced (sometimes stressful).","zh":"你可能想写的是 hectic——非常忙碌、节奏很快（常带压力）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of busy activity, noise, and sometimes stress; very busy and fast-moving.","zh":"非常忙碌、节奏很快（常带一点紧张或压力）的。"},"examples":[{"en":"It was a hectic day at work, and I didn’t even have time for lunch.","zh":"今天工作特别忙，我连午饭都没时间吃。"},{"en":"The airport gets hectic during the holiday season.","zh":"假期期间机场会变得非常繁忙。"},{"en":"She has a hectic schedule this week with exams and part-time work.","zh":"她这周日程很紧张，要考试还要做兼职。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical, less common) Having a feverish flush; relating to fever.","zh":"（医学用法，较少见）发热的；因发烧而面色潮红的。"},"examples":[{"en":"The patient looked hectic and weak after several days of fever.","zh":"病人发烧好几天后看起来面色潮红而虚弱。"}]}],"synonyms":["busy","frantic","chaotic","crazy","frenzied","rushed"],"phonetic":"/ˈhɛktɪk/","extraExplanation":["“hectical”通常被视为拼写错误；标准拼写是 **hectic**。在正式写作中建议用 hectic。","hectic 源自希腊语，早期与“（慢性）发热/消耗性疾病”有关，所以有较少见的医学含义；后来在日常英语中更常指“忙乱、紧张、节奏快”的生活或工作状态。","搭配很常见：a hectic day/week/schedule；It’s been hectic lately（最近一直很忙）。"]}
{"word":"hectically","summary":{"en":"“Hectically” means doing something in a very busy, rushed, and somewhat chaotic way.","zh":"“hectically”表示“忙乱、匆忙、略显混乱地（做某事）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a busy, rushed, and slightly chaotic way; with a lot happening at the same time.","zh":"以忙乱、匆忙、略显混乱的方式；同时有很多事情在发生。"},"examples":[{"en":"She worked hectically all week to finish the report before Friday.","zh":"她整个星期都忙乱地工作，想在周五前完成报告。"},{"en":"The office was moving hectically after the sudden announcement.","zh":"突如其来的通知之后，办公室一片忙乱。"},{"en":"He packed hectically, forgetting his charger and passport photo.","zh":"他匆忙收拾行李，结果忘了带充电器和护照照片。"}]}],"synonyms":["busily","hurriedly","frantically","chaotically","in a rush"],"phonetic":"/ˈhɛktɪkli/","extraExplanation":["“hectically”来自形容词“hectic”，原意与“发热、热病”有关（带有“躁动、发烧般的忙乱”这种感觉），所以它常暗示“忙到有点失控/压力很大”。","语气上，“hectically”通常比“quickly”更强调混乱与压力；与“frantically”相比，它更偏“忙乱奔波”，不一定带有恐慌。"]}
{"word":"hecticly","summary":{"en":"Hectically means “in a rushed, busy, and somewhat chaotic way.”","zh":"Hectically 指“忙乱、匆忙、略带混乱地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a busy, rushed, and often slightly chaotic way.","zh":"以忙乱、匆忙、常带点混乱的方式。"},"examples":[{"en":"We worked hectically to finish the report before the deadline.","zh":"我们为了赶在截止日期前完成报告而忙乱地工作。"},{"en":"She packed hectically after realizing her flight was in an hour.","zh":"她发现航班一小时后起飞，就慌忙地收拾行李。"}]}],"synonyms":["frantically","hurriedly","busily","feverishly"],"phonetic":"/ˈhɛktɪkli/","extraExplanation":["更常见的拼写是 **hectically**（hectic + -ally）。你写的 **hecticly** 有时会出现，但通常被认为是不标准或较少用的拼写。","语气上，hectically 往往暗示“忙到有点失控/手忙脚乱”，比 simply “quickly” 或 “busily” 更强调紧张与混乱的感觉。"]}
{"word":"hecticness","summary":{"en":"Hecticness means the quality of being extremely busy and stressful, often with a sense of chaos.","zh":"Hecticness 指“忙乱、紧张、压力大且略带混乱”的状态或性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being hectic; a feeling or situation that is very busy, fast, and often stressful or chaotic","zh":"忙乱；紧张而混乱的状态（非常忙、节奏很快，常带压力或失控感）"},"examples":[{"en":"The hecticness of the holiday season makes it hard to relax.","zh":"节假日季节的忙乱让人很难放松。"},{"en":"I like the city, but the hecticness of downtown traffic wears me out.","zh":"我喜欢这座城市，但市中心交通的忙乱让我筋疲力尽。"},{"en":"She tried to bring calm into the hecticness of daily life by taking short walks.","zh":"她通过短暂散步，努力在日常生活的忙乱中带来一点平静。"}]}],"synonyms":["busyness","chaos","rush","frenzy","turmoil"],"phonetic":"/ˈhɛktɪknəs/","extraExplanation":["“hecticness”是由形容词“hectic”（忙乱的、紧张的）加名词后缀“-ness”（表示“……的状态/性质”）构成。日常英语里更常见的说法是“the hectic pace / the chaos / the busyness”，而“hecticness”相对少用，但意思清楚、可理解。"]}
{"word":"hective","summary":{"en":"“Hective” is usually a misspelling of “hectic,” meaning very busy and slightly chaotic; it can also mean feverish (rare, literary/medical).","zh":"“hective”通常是“hectic”的误拼，意思是非常忙碌且略显混乱；也可指发热般的潮红/亢奋（较少见，文学/医学）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled “hectic”) Very busy, fast, and full of activity; often a little stressful or chaotic.","zh":"（常见拼写为 hectic）非常忙碌、节奏很快、充满各种活动；常带有一点压力或混乱。"},"examples":[{"en":"This week has been hectic, so I haven’t had time to cook.","zh":"这周特别忙乱，所以我没时间做饭。"},{"en":"The airport gets hectic during the holidays.","zh":"节假日期间机场会变得非常拥挤忙乱。"},{"en":"She leads a hectic life balancing work and family.","zh":"她在工作和家庭之间奔波，生活节奏非常紧张。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common, literary/medical) Showing a feverish flush or intense excitement, especially related to illness.","zh":"（较少见，文学/医学用法）呈现发热般的潮红或亢奋（常与疾病相关）。"},"examples":[{"en":"He lay in bed with a hectic flush on his cheeks.","zh":"他躺在床上，脸颊带着发热般的潮红。"},{"en":"Her voice had a hectic edge, as if she were burning with fever.","zh":"她的声音带着一种亢奋的紧绷感，仿佛在发烧。"}]}],"synonyms":["busy","chaotic","frantic","frenzied","crowded"],"phonetic":"/ˈhɛktɪk/","extraExplanation":["“hective”不是常见标准拼写；多数情况下你想找的是“hectic”。","词源来自希腊语 hektikos，早期与“习惯性/消耗性的发热（hectic fever）”有关，所以在文学里偶尔还能看到与“病态潮红、发热”相关的用法。"]}
{"word":"hecto","summary":{"en":"hecto- is a metric prefix meaning 100×.","zh":"hecto- 是表示“百”（100 倍）的公制词头。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a metric prefix meaning “one hundred” (100×), used in scientific and metric units.","zh":"公制词头，表示“百”（100 倍），常用于科学与度量单位中。"},"examples":[{"en":"A hectometer (hm) equals 100 meters.","zh":"1 公顷米（hm）等于 100 米。"},{"en":"In some countries, land area is measured in hectares.","zh":"在一些国家，土地面积会用公顷来衡量。"}]}],"synonyms":["hundred-","centi- (not same; 1/100)","kilo- (not same; 1000×)"],"phonetic":"/ˈhɛktoʊ/","extraExplanation":["“hecto-”来自希腊语 *hekaton*（一百）。它在日常英语里不如 kilo-（千）常见，但在少数单位里很常用：\n- hectare（公顷）= 10,000 平方米（= 100 ares）；常用于土地面积\n- hectopascal（百帕，hPa）= 100 帕；天气预报里常见（气压）\n注意：严格来说它是“词头/前缀”，通常要和单位一起用（hectometer, hectopascal），不太单独当作一个普通单词使用。"]}
{"word":"hectoamp","summary":{"en":"100 amperes of electric current.","zh":"表示100安培的电流单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of electric current equal to 100 amperes (symbol: hA); often understood as short for “hectoampere.”","zh":"电流单位，等于100安培（符号：hA）；常被视为“hectoampere（百安培）”的简称。"},"examples":[{"en":"The instrument can measure currents up to 3 hectoamps (300 A).","zh":"这台仪器可测到最高3百安（300安培）的电流。"},{"en":"In the report, 2 hA was used to describe the peak current.","zh":"报告中用2 hA来描述峰值电流。"}]}],"synonyms":["hectoampere","hA"],"phonetic":"/ˈhɛktoʊˌæmp/","extraExplanation":["SI词头 hecto- 表示“10^2（百）”。在实际工程中，更常见的是用安培（A）或千安（kA）来写电流；“hectoamp”相对少见，但含义清晰：100 A。","书写时注意符号：安培是 A，百安常写作 hA（小写 h + 大写 A），避免与其他缩写混淆。"],"etymology":"由前缀 hecto-（表示“100”）+ amp(ere)（安培，电流单位）构成；多见于工程语境中对“hectoampere”的非正式简写。","mnemonic":["记词头：hecto- = “百”（想成中文的“hecto≈黑托→‘百’的托管”，看到 hecto 就先联想到 100）。","把它当作“100 安培”的口头简写：hecto(100) + amp(安培) → 100A。"]}
{"word":"hectoampere","summary":{"en":"Hectoampere is a unit of electric current equal to 100 amperes.","zh":"hectoampere（百安）是电流单位，等于100安培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of electric current equal to 100 amperes (A).","zh":"电流单位，等于100安培（A）。"},"examples":[{"en":"The current was measured at 3 hectoamperes, which equals 300 amperes.","zh":"电流测得为3百安（hectoamperes），也就是300安培。"},{"en":"In some technical tables, you may see large currents written in hectoamperes to keep numbers shorter.","zh":"在一些技术表格里，为了让数字更简洁，较大的电流可能会用百安来表示。"}]}],"synonyms":["hectoamp (rare)"],"phonetic":"/ˌhɛktoʊˈæmˌpɪr/","extraExplanation":["“hecto-”是国际单位制（SI）中表示“100”的词头（前缀），常见于hectometer（百米）、hectopascal（百帕）。在工程领域更常用的可能是kA（千安，1000A）或直接写A；“hectoampere”多见于较正式或特定的计量/文献表达。"]}
{"word":"hectocotyl","summary":{"en":"A hectocotyl is a specialized mating arm of a male octopus or squid used to transfer sperm.","zh":"hectocotyl 指雄性章鱼或鱿鱼等头足类用于交配传精的特化腕足（交接腕）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a modified arm of a male cephalopod (such as an octopus or squid) used to transfer sperm to the female during mating","zh":"（雄性头足类动物，如章鱼、鱿鱼的）交接腕；用于把精子传递给雌性的特化腕足"},"examples":[{"en":"In some octopus species, the male uses a hectocotyl to deliver sperm to the female.","zh":"在某些章鱼物种中，雄性会用交接腕把精子传递给雌性。"},{"en":"The scientist identified the animal as male by noticing the hectocotyl on one arm.","zh":"科学家通过发现其中一条腕足上的交接腕来判断它是雄性。"}]}],"synonyms":["hectocotylus","modified reproductive arm"],"phonetic":"/ˌhɛktoʊˈkɑtəl/","extraExplanation":["这个词常见于动物学/海洋生物学语境，日常英语里不常用。","词源来自希腊语，字面与“hundred（百）”和“cup/holder（杯/容器）”有关。历史上人们曾误把这种特化腕足当作寄生虫，后来才确认它是雄性头足类的生殖结构之一。"]}
{"word":"hectocotylate","summary":{"en":"to form or use a specialized cephalopod mating arm to transfer sperm","zh":"使头足类腕足特化为交接腕，或用其传递精子完成交配"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Zoology) To modify a male cephalopod’s arm into a specialized mating arm (a hectocotylus) used to transfer sperm.","zh":"（动物学）使雄性头足类（如章鱼、乌贼）的一只腕足特化为“交接腕”（hectocotylus），用于传递精荚/精子。"},"examples":[{"en":"In some octopus species, one arm becomes hectocotylated for mating.","zh":"在一些章鱼物种中，会有一只腕足发生交接腕化，用于交配。"},{"en":"Researchers described how the arm was hectocotylated and adapted to carry spermatophores.","zh":"研究人员描述了这只腕足如何交接腕化，并适应于携带精荚。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare) To mate by transferring sperm with a hectocotylus.","zh":"（罕见）用交接腕传递精子来完成交配。"},"examples":[{"en":"The male may hectocotylate while the female guards the den.","zh":"雄性可能通过交接腕完成交配，而雌性守护巢穴。"}]}],"synonyms":["inseminate","fertilize","impregnate"],"phonetic":"/ˌhɛktoʊˈkɑtɪˌleɪt/","extraExplanation":["这是非常专业、偏生物学文献的词，日常英语几乎不会用到；多见于章鱼/乌贼等头足类的繁殖行为与解剖描述。","相关名词：hectocotylus（交接腕）；spermatophore（精荚）。"],"etymology":"来自 hectocotylus（交接腕）：19世纪动物学术语，源自希腊语 hekaton（“一百”）+ kotylē（“杯、吸盘”）。早期博物学家曾把雄性头足类的交接腕误认作带“许多吸盘”的寄生虫，因此形成这一名称；后固定为“用于传精的特化腕足”。","mnemonic":["把 hecto- 记成“很多/一百（hecto=100）”，-cotyl- 联想到“杯/吸盘（像章鱼吸盘）”：‘很多吸盘的特化腕’→用于交配的交接腕。"]}
{"word":"hectocotyle","summary":{"en":"A male cephalopod’s modified arm used to transfer sperm during mating.","zh":"雄性头足类（如章鱼、乌贼）用于交配传精的特化腕/触腕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specially modified arm (or tentacle) of some male cephalopods (especially octopuses and squids) used to transfer sperm to the female during mating","zh":"（某些雄性头足类动物，尤指章鱼和乌贼的）交接腕；一种特化的腕/触腕，用于在交配时将精包（精子）传递给雌性"},"examples":[{"en":"In many octopus species, the male uses a hectocotyle to pass sperm to the female.","zh":"在许多章鱼物种中，雄章鱼会用交接腕把精包传递给雌章鱼。"},{"en":"The biologist identified the specimen as male because it had a distinct hectocotyle.","zh":"生物学家通过发现明显的交接腕，判断这个标本是雄性。"}]}],"synonyms":["copulatory arm","modified arm (of male cephalopods)"],"phonetic":"/ˈhɛktoʊˌkɑːtaɪl/","extraExplanation":["词源小知识：hectocotyle 来自希腊语词根，常解释为“杯状吸盘/小杯（cotyle）”相关的构词；它对应的更常见形式是 hectocotylus（复数 hectocotyli）。在早期自然史记载中，这种特化腕曾被误认为寄生虫，后来才确认它是雄性头足类的生殖结构之一。"]}
{"word":"hectocotyli","summary":{"en":"Hectocotyli are the sperm-transfer arms of male octopuses and some squids.","zh":"hectocotyli 指雄性章鱼及部分鱿鱼用于传递精包的特化腕足（交接腕）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"specialized arms in male octopuses and some squids used to transfer sperm to the female (plural of “hectocotylus”).","zh":"雄性章鱼及部分鱿鱼用于把精包（精子）传递给雌性的特化腕足（hectocotylus 的复数）。"},"examples":[{"en":"In some octopus species, the male uses one of his hectocotyli to pass sperm to the female.","zh":"在一些章鱼物种中，雄章鱼会用其中一条 hectocotyli（交接腕）把精包传递给雌章鱼。"},{"en":"Scientists identified the animal as a male because its hectocotyli were clearly developed.","zh":"科学家通过其发育明显的 hectocotyli（交接腕）判断它是雄性。"}]}],"synonyms":["hectocotylus (singular)","modified arm (in cephalopods)","sperm-transfer arm"],"phonetic":"/ˌhɛktoʊˈkɑtɪlaɪ/","extraExplanation":["该词多见于动物学/海洋生物学语境。hectocotylus 指雄性头足类（如章鱼、部分鱿鱼）的一条或几条“改造过的腕”，末端或表面结构与普通腕不同，用来抓取并递送精包。","词源来自希腊语：hekaton（百）+ kotylē（杯/吸盘）。早期博物学家曾误把这种结构当作寄生虫，后来才确认它其实是雄性头足类的生殖相关结构。"]}
{"word":"hectocotyliferous","summary":{"en":"A rare scientific adjective meaning “having a hectocotylus (a sperm-transferring modified arm) in male cephalopods.”","zh":"一个罕见的科学形容词，意为“雄性头足类具有交接腕（用于传递精子的特化腕足）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a male cephalopod, such as an octopus or squid) having a hectocotylus—a specially modified arm used to transfer sperm to the female.","zh":"（指雄性头足类动物，如章鱼或乌贼）具有“交接腕”（hectocotylus）——一种为将精子传递给雌性而特化的腕足。"},"examples":[{"en":"In some octopus species, the male is hectocotyliferous, using a modified arm to deliver spermatophores.","zh":"在一些章鱼物种中，雄性具有交接腕，会用特化的腕足递送精荚。"},{"en":"The researcher identified a hectocotyliferous specimen by examining the shape of one arm.","zh":"研究人员通过观察其中一条腕足的形态，辨认出该标本具有交接腕。"}]}],"synonyms":["having a hectocotylus","hectocotylate (rare)"],"phonetic":"/ˌhɛktoʊkɑtɪˈlɪfərəs/","extraExplanation":["这是一个非常专业的动物学/海洋生物学词汇，主要出现在分类学描述与学术论文中，日常英语几乎不会用。","词形结构：hectocotyl(us)（交接腕）+ -iferous（“带有/产生……的”，如 resiniferous“产树脂的”）。","hectocotylus 指雄性头足类用于繁殖的特化腕足；不同类群的交接腕形态差异常被用作物种鉴定线索。"]}
{"word":"hectocotylization","summary":{"en":"Hectocotylization is the formation of a specialized reproductive arm in some male cephalopods for sperm transfer.","zh":"Hectocotylization 指某些雄性头足类形成“生殖腕”以传递精子的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the biological process in some male cephalopods (like octopuses and squids) in which one arm becomes modified into a specialized reproductive arm (a hectocotylus) used to transfer sperm","zh":"（生物学）某些雄性头足类（如章鱼、鱿鱼）中，一条腕足变形为专门的生殖腕（hectocotylus，用于传递精包/精子）的过程"},"examples":[{"en":"In some octopus species, hectocotylization produces a specialized arm for transferring sperm packets.","zh":"在一些章鱼物种中，hectocotylization 会形成一条专门用于传递精包的生殖腕。"},{"en":"Researchers can identify males by observing signs of hectocotylization in one arm.","zh":"研究人员可以通过观察某条腕足是否出现 hectocotylization 的特征来辨认雄性个体。"}]}],"synonyms":["hectocotylus formation","development of a hectocotylus"],"phonetic":"/ˌhɛktoʊˌkɑtɪləˈzeɪʃən/","extraExplanation":["该词来自 hectocotylus（生殖腕）+ -ization（……化/……过程）。在一些头足类中，这条改造后的腕足常用于将精包送入雌性体内或交配相关结构附近。","这是偏学术、偏专业的术语，日常英语中几乎不会用到；更常见的相关词是 hectocotylus（生殖腕）。"]}
{"word":"hectocotylize","summary":{"en":"A rare zoology verb meaning “to form/transform an arm into a hectocotylus (reproductive arm) in male cephalopods.”","zh":"一个较少见的动物学动词，指“（雄性头足类）将某条腕发育/转变为交接腕（用于繁殖传精的特化腕）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a male cephalopod, or its arm) to develop or transform an arm into a specialized reproductive arm (a hectocotylus) used to transfer sperm.","zh":"（指雄性头足类或其腕）使某一条腕发育或转变为“交接腕”（hectocotylus），用于传递精子。"},"examples":[{"en":"In some octopus species, one arm becomes hectocotylized during maturity.","zh":"在一些章鱼物种中，性成熟时会有一条腕发生交接腕化。"},{"en":"Researchers described how the third right arm can hectocotylize in certain squids.","zh":"研究人员描述了某些鱿鱼的右侧第三腕如何发生交接腕化。"}]}],"synonyms":["form a hectocotylus","develop a hectocotylus","transform into a hectocotylus"],"phonetic":"/ˌhɛk.toʊˈkɑt.əl.aɪz/","extraExplanation":["这个词主要用于动物学/海洋生物学语境，日常英语中几乎不会用到。","“交接腕”（hectocotylus）是部分雄性头足类（如章鱼、鱿鱼）用于交配的特化腕，常与精包（spermatophore）的转移有关。"]}
{"word":"hectocotylus","summary":{"en":"A male cephalopod’s specialized arm used to transfer sperm during mating.","zh":"雄性头足类用于交配时传递精子的特化腕/触腕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A modified arm or tentacle of a male cephalopod (such as an octopus or squid) used to transfer sperm to the female during mating.","zh":"（动物学）雄性头足类（如章鱼、乌贼/鱿鱼）用于在交配时将精子传递给雌性的特化腕或触腕。"},"examples":[{"en":"In many octopus species, the male uses a hectocotylus to deliver sperm packets to the female.","zh":"在许多章鱼物种中，雄性会用交接腕把精包传递给雌性。"},{"en":"The biologist identified the hectocotylus by its distinct tip and groove compared with the other arms.","zh":"生物学家通过它与其他腕不同的末端形态和沟槽辨认出交接腕。"}]}],"synonyms":["mating arm","copulatory arm"],"phonetic":"/ˌhɛktoʊˈkɑːtələs/","extraExplanation":["这个词来自希腊语词根：hekaton（“一百”）+ kotylē（“小杯/吸盘”）。早期研究者曾把章鱼的交接腕误认为一种“有很多吸盘的寄生虫/蠕虫”，因此造出了这个带点“历史误会”的名称。","不同头足类的交接腕形态差异很大：有的只是末端稍微变形，有的会形成专门的沟槽或“匙状”结构，用来更有效地传递精包。"]}
{"word":"hectogram","summary":{"en":"A hectogram is 100 grams (0.1 kilogram).","zh":"hectogram（公顷克）等于100克（0.1千克）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metric unit of mass equal to 100 grams (0.1 kilogram), often used for weighing food in some countries","zh":"公制质量单位，等于100克（0.1千克）；在一些国家常用于称量食物"},"examples":[{"en":"This recipe calls for 2 hectograms of flour.","zh":"这个食谱需要2公顷克（200克）的面粉。"},{"en":"In some European markets, cheese is priced per hectogram.","zh":"在一些欧洲市场，奶酪会按每公顷克计价。"}]}],"synonyms":["hectogram (hg)","100 grams","one-tenth of a kilogram"],"phonetic":"/ˈhɛk.təˌɡræm/","extraExplanation":["“hecto-”是公制前缀，表示“100倍”；“-gram”表示“克”。因此hectogram = 100克。","英语里更常用的写法是缩写“hg”，口语中更常见的是直接说“100 grams”或用“kilograms”。"]}
{"word":"hectogramme","summary":{"en":"A hectogramme is a metric unit of mass equal to 100 grams.","zh":"hectogramme 是公制质量单位，等于100克。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit of mass equal to 100 grams (0.1 kilogram).","zh":"一种质量单位，等于100克（0.1千克）。"},"examples":[{"en":"The recipe calls for one hectogramme of flour.","zh":"这个食谱需要一百克（1 hectogramme）的面粉。"},{"en":"In some European markets, cheese may be priced per hectogramme.","zh":"在一些欧洲市场，奶酪可能按每百克（per hectogramme）标价。"}]}],"synonyms":["hectogram","hg (symbol)"],"phonetic":"/ˈhɛk.təˌɡræm/","extraExplanation":["“hectogramme”是英式拼写；美式英语更常写作“hectogram”（去掉 -me），但两者含义相同。","前缀“hecto-”表示“100”，同一前缀也出现在“hectometer”（百米）等词中。","在日常生活中，更常见的是用“grams/ kilograms”，但在某些国家的零售称重（如熟食、奶酪）中，“每百克”这种计价方式很常见。"]}
{"word":"hectograms","summary":{"en":"Hectograms are units of mass; 1 hectogram = 100 grams.","zh":"hectograms（百克）是质量单位：1 hectogram = 100克。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of mass equal to 100 grams (0.1 kilogram), often used for measuring food and ingredients","zh":"一种质量单位，等于100克（0.1千克），常用于称量食物和配料"},"examples":[{"en":"The recipe calls for two hectograms of flour.","zh":"这个食谱需要两百克（两百克=2 hectograms）的面粉。"},{"en":"In some countries, deli meat is priced per hectogram.","zh":"在一些国家，熟食店的肉类会按每百克（hectogram）标价。"}]}],"synonyms":["hectogram (hg)","100 grams","one-tenth of a kilogram"],"phonetic":"/ˈhɛk.təˌɡræm/","extraExplanation":["“Hectogram”属于公制（SI）前缀系统：hecto- 表示“100”。因此 1 hectogram = 100 grams。","在日常英语环境（尤其是美国）里更常见的说法是用“grams”或“kilograms”；“hectogram(s)”在一些欧洲国家的购物场景里更常见。"]}
{"word":"hectograph","summary":{"en":"A pre-photocopier duplicating method/device using a gelatin pad; also (rarely) the verb meaning “to copy this way.”","zh":"一种利用明胶垫进行批量转印复制的旧式复印方法/装置；也可作动词（较少见）指“用这种方式复制”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A simple duplicating method/device that uses a gelatin pad to make many copies from an inked master sheet (common before photocopiers).","zh":"一种利用明胶（胶冻）垫从“母版”转印、可快速复印多份的简易复制方法/装置（复印机普及前较常见）。"},"examples":[{"en":"The teacher used a hectograph to copy worksheets for the whole class.","zh":"老师用胶印复制器（hectograph）把练习题复印给全班。"},{"en":"The club newsletter was produced on a hectograph in the 1950s.","zh":"这个社团的简报在20世纪50年代是用hectograph印出来的。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make copies using a hectograph (less common in modern English).","zh":"用hectograph方式复制（在现代英语中较少见）。"},"examples":[{"en":"They hectographed the song lyrics for the audience.","zh":"他们用hectograph把歌词复制出来发给观众。"}]}],"synonyms":["gelatin duplicator","gelatin copier","duplicator"],"phonetic":"/ˈhɛk.təˌɡræf/","extraExplanation":["hectograph也常被称为“gelatin duplicator（明胶复制器）”。它的原理是：先用含特殊染料/墨水的母版把图文转移到明胶垫上，再用纸一张张压印取墨，从而得到多份副本。","在学校讲义、教会公告、社团传单等“少量、多份”的场景里曾非常实用；后来被油印机、蜡纸复印、以及现代影印/打印技术取代。","词源上hecto-表示“一百”，暗示大约能复制上百份（实际份数会因材料和操作而变）。"]}
{"word":"hectographic","summary":{"en":"Hectographic means “related to hectography,” an old gelatin-based copying method.","zh":"hectographic 指“与胶版复制法有关的”，一种早期用明胶板进行文件复制的方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hectography, an old method of making copies (duplicating documents) using a gelatin pad and special ink.","zh":"与“胶版复印法/果冻版复制法（hectography）”有关的；指一种早期用明胶板和特殊墨水来复制文件的印刷/复印方式。"},"examples":[{"en":"The library displayed a hectographic leaflet from the early 1900s.","zh":"图书馆展出了一张20世纪初的胶版复制传单。"},{"en":"Before photocopiers, some small groups used hectographic printing to make quick copies.","zh":"在复印机出现之前，一些小团体会用胶版复制来快速制作副本。"}]}],"synonyms":["hectography-related","duplicating (historical)"],"phonetic":"/ˌhɛk.təˈɡræf.ɪk/","extraExplanation":["“Hectography”源自希腊语 hekaton（“一百”），因为这种方法理论上可做出大约一百份左右的副本（实际数量常因操作与材料而变化）。","胶版复制在19世纪末到20世纪初较常见，常用于小型出版物、课堂资料、社团传单等；后来逐渐被油印（mimeograph）、蜡纸（ditto）和现代复印技术取代。"]}
{"word":"hectography","summary":{"en":"Hectography is an old, low-cost way to make many copies using a gelatin pad.","zh":"hectography 指一种旧式、低成本的明胶胶版复制方法，可制作多份副本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a printing/copying method that makes multiple copies from a gelatin (jelly-like) pad, often used for small batches before photocopiers became common.","zh":"一种“胶版/明胶复制”印刷法：用明胶（像果冻一样的胶垫）从原稿转印出多份副本；在复印机普及前常用于少量复制。"},"examples":[{"en":"Before photocopiers, some schools used hectography to copy worksheets.","zh":"在复印机出现之前，一些学校会用胶版复制来印讲义。"},{"en":"The club produced a small newsletter by hectography because it was cheap and simple.","zh":"这个社团用胶版复制做了一份小型简报，因为它便宜又简单。"}]}],"synonyms":["gelatin duplicating","gelatin copying","spirit duplicating (related)","mimeograph (related)"],"phonetic":"/ˌhɛkˈtɑːɡrəfi/","extraExplanation":["“hectography”来自希腊语：hecto- 表示“一百”，-graphy 表示“书写/印刷”。名字暗示它可以一次做出很多（常说约上百份）副本。","它与“mimeograph（油印）/ditto（紫色复写）”同属早期的低成本复制技术；常见于学校、教会、小社团等需要少量快速复制的场景。","现代语境里较少见，多出现在历史、档案、复古印刷或收藏领域的描述中。"]}
{"word":"hectography-related","summary":{"en":"connected with gelatin-based duplicating (hectograph) printing.","zh":"与明胶垫复写式印刷（胶版复写）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with hectography, a printing/duplicating method that uses a gelatin pad to make many copies from a special ink master sheet.","zh":"与“胶版复写/胶版印刷（hectography）”有关的；指用明胶（胶）垫从带特殊墨水的母版转印、多次复写的印制方式。"},"examples":[{"en":"The museum displayed hectography-related supplies, including gelatin pads and an ink master.","zh":"博物馆展出了与胶版复写相关的用品，包括明胶垫和油墨母版。"},{"en":"He studies hectography-related classroom materials from the early 1900s.","zh":"他研究20世纪初与胶版复写相关的课堂资料。"}]}],"synonyms":["hectographic","duplicating","copying","reproduction-related","printing-related"],"phonetic":"hɛkˈtɑɡrəfi rɪˈleɪtɪd","extraExplanation":["hectography 常见于19世纪末到20世纪早期的学校、教会和小型办公室，用来低成本复制讲义、公告等；后来逐渐被油印（mimeograph）和复印技术取代。","在历史文献里也可能见到同类说法如 “hectograph copies / hectographed sheets”（胶版复写的印件/纸张）。"],"etymology":"“hectography”源自希腊语 hekaton（百）+ -graphy（书写/印刷），原指可一次制出“上百份左右”的复写技术；“related”表示“相关的”，合起来即“与胶版复写相关的”。","mnemonic":["hecto- 联想“hectometer=百米”，这里也有“百（份）”的感觉：一次能复写很多份。","-graphy=“写/印”（如 photography 摄影），合起来就是“用来印很多份的写印法”；再加 related=“有关的”。"]}
{"word":"hectoliter","summary":{"en":"Hectoliter (hL) is a metric volume unit equal to 100 liters.","zh":"hectoliter（hL）是公制体积单位，等于100升。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of volume equal to 100 liters (often used for measuring large amounts of liquids, especially in Europe).","zh":"百升（体积单位），等于100升（常用于计量较大量的液体，尤其在欧洲常见）。"},"examples":[{"en":"The winery produced 250 hectoliters of wine this season.","zh":"这家酒庄本季生产了250百升的葡萄酒。"},{"en":"Beer production is often reported in hectoliters in many countries.","zh":"在许多国家，啤酒产量常用“百升”来统计。"}]}],"synonyms":["hL","100 liters"],"phonetic":"/ˈhɛktoʊˌliːtɚ/","extraExplanation":["“hecto-”是表示“100”的前缀（如 hectometer 百米、hectopascal 百帕），因此 hectoliter 直译就是“100升”。","在美国日常生活中更常见的是 gallon（加仑）等单位；在欧洲、酿酒/啤酒行业和一些官方统计中，hectoliter 更常用。"]}
{"word":"hectoliters","summary":{"en":"Hectoliters = 100 liters each; used for large-volume measurement.","zh":"hectoliters（百升）每个等于100升，用于较大体积的计量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit of volume equal to 100 liters, used mainly for measuring liquids (and sometimes grains), especially in industry and trade.","zh":"一种体积单位，等于100升，主要用于衡量液体（有时也用于谷物），常见于工业与贸易领域。"},"examples":[{"en":"The brewery produced 5,000 hectoliters of beer last year.","zh":"这家啤酒厂去年生产了5,000百升啤酒。"},{"en":"Wine output is often reported in hectoliters in Europe.","zh":"在欧洲，葡萄酒产量常常用百升来统计。"},{"en":"The tank can hold 12 hectoliters of water.","zh":"这个水箱可以装12百升的水。"}]}],"synonyms":["hL","100 liters","hectolitres"],"phonetic":"/ˈhɛktoʊˌliːtərz/","extraExplanation":["“hecto-”是公制前缀，表示“100”；“liter”是“升”。所以hectoliter（百升）= 100 liters（100升）。常见缩写是“hL”。","英语里既可写hectoliter（美式拼写），也常见hectolitre（英式拼写）。复数hectoliters/hL表示多个百升。","在日常生活中英语更常用liters或milliliters；hectoliters多见于啤酒、葡萄酒、农业产量和大型储罐等语境。"]}
{"word":"hectolitre","summary":{"en":"Hectolitre is a metric volume unit equal to 100 liters, used for large quantities of liquid.","zh":"Hectolitre（百升）是等于100升的公制体积单位，用于较大量液体的计量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A metric unit of volume equal to 100 liters, often used for measuring large amounts of liquids (especially in brewing and agriculture).","zh":"公制体积单位，等于100升；常用于衡量较大量的液体（尤其在酿造业、农业等领域）。"},"examples":[{"en":"The brewery produces about 50 hectolitres of beer a week.","zh":"这家啤酒厂每周大约生产50百升啤酒。"},{"en":"Water use was reported in hectolitres to compare farms fairly.","zh":"用水量以百升为单位报告，以便公平比较各农场。"}]}],"synonyms":["hectoliter","hL (abbreviation)"],"phonetic":"/ˈhɛk.təˌliː.tər/","extraExplanation":["“hectolitre”主要见于英式拼写；美式英语更常写作“hectoliter”。两者意思相同，只是拼写习惯不同。","前缀“hecto-”表示“100（倍）”，例如：hectometer（百米）、hectopascal（百帕）。因此 hectolitre = 100 litres。","换算小贴士：1 hectolitre = 100 L ≈ 26.4 US gallons（约26.4美制加仑）。"]}
{"word":"hectolitres","summary":{"en":"plural of a metric volume unit equal to 100 liters.","zh":"表示“百升（=100 升）”这种公制体积单位的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of hectolitre/hectoliter; a metric unit of volume equal to 100 liters, often used for large quantities of liquids (e.g., beer, milk, wine).","zh":"hectolitre/hectoliter（百升）的复数形式；公制体积单位，1 百升 = 100 升，常用于表示大量液体（如啤酒、牛奶、葡萄酒等）。"},"examples":[{"en":"The brewery produced 2,500 hectolitres of beer last year.","zh":"这家啤酒厂去年生产了 2,500 百升啤酒。"},{"en":"The report lists wine output in hectolitres rather than bottles.","zh":"报告用“百升”而不是“瓶数”来统计葡萄酒产量。"},{"en":"Rainfall was measured as the equivalent of several hectolitres of water over the field.","zh":"降雨量被换算成落在田地上的几百升水的等量。"}]}],"synonyms":["hectoliters","hL"],"phonetic":"/ˈhɛk.təˌliː.tərz/","extraExplanation":["写作与阅读中常见缩写是 hL（不区分单复数，如 1 hL、10 hL）。","主要用于工业、农业与统计场景；日常生活中更常用 liters（升）或 milliliters（毫升）。"],"etymology":"由公制前缀 hecto-（表示“100”）+ litre/liter（升）构成；hectolitre 为英式拼写，hectoliter 为美式拼写。","mnemonic":["hecto- = 100（像“hectare 公顷”也是 100×100 平方米的量级提示），所以 hectolitre 就是“100 升”。","把 hL 记成 “hundred Liters（百升）”的首字母提示：h ≈ hundred，L = liters。"]}
{"word":"hectometer","summary":{"en":"Hectometer means 100 meters (0.1 km).","zh":"hectometer 指“百米”（100米，0.1公里）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of length equal to 100 meters (0.1 kilometer), used mainly in science and measurement contexts","zh":"长度单位：百米（=100米，=0.1公里），主要用于科学与测量语境"},"examples":[{"en":"The track is 4 hectometers long, which is 400 meters.","zh":"这条跑道长4百米，也就是400米。"},{"en":"Rainfall was measured over a distance of several hectometers.","zh":"降雨量是在几百米的范围内测量的。"}]}],"synonyms":["100 meters","hectometre (BrE spelling)"],"phonetic":"/ˈhɛktoʊˌmiːtər/","extraExplanation":["“hecto-”是国际单位制（SI）中的词头，表示“100倍”。因此hectometer=100×meter。日常英语里更常见的是meter和kilometer；hectometer在地图测量、农业或科学报告里偶尔出现。"]}
{"word":"hectometers","summary":{"en":"Hectometers are a metric unit of length: 1 hectometer = 100 meters.","zh":"hectometers（百米）是公制长度单位：1 hectometer = 100米。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of length equal to 100 meters (0.1 kilometer). “Hectometers” is the plural form of “hectometer.”","zh":"长度单位，等于100米（0.1千米）。“hectometers”是“hectometer”的复数形式。"},"examples":[{"en":"The river is about 5 hectometers long.","zh":"这条河大约有5百米（5 hectometers）长。"},{"en":"In that map scale, 1 centimeter represents 2 hectometers.","zh":"按这张地图比例尺，1厘米代表2百米。"}]}],"synonyms":["hm (abbreviation)"],"phonetic":"/ˈhɛktoʊˌmiːtərz/","extraExplanation":["“hecto-”是公制前缀，表示“100倍”。所以 hectometer（hm）= 100 meters（m）。","在日常英语里，“hectometer”不如“meter/kilometer”常用，但在地理、测量、地图比例尺或某些运动/训练语境中可能会出现。","常见换算：1 hm = 100 m = 0.1 km；10 hm = 1 km。"]}
{"word":"hectometre","summary":{"en":"a length of 100 meters","zh":"一百米的长度单位"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit of length equal to 100 meters (0.1 kilometer).","zh":"长度单位，等于100米（0.1公里）。"},"examples":[{"en":"The hiking trail is about 3 hectometres long.","zh":"这条徒步路线大约有3百米（3公顷米/3 hectometres）长。"},{"en":"In some maps, distances are marked in hectometres.","zh":"在一些地图上，距离会用百米为单位标注。"}]}],"synonyms":["hectometer"],"phonetic":"/ˈhɛk.təˌmiː.tɚ/","extraExplanation":["英式拼写常见为 hectometre；美式拼写更常见为 hectometer。两者意思相同。","在日常英语里，这个单位不算常用；人们更常说 meters 或 kilometers。"],"etymology":"来自希腊语前缀 hecto-（表示“百”）+ metre（米，来自法语 mètre）。在公制单位中用前缀表示倍数：hecto- = 100。","mnemonic":["hecto- 就像中文“百-”：看到 hecto- 就联想到“100”。","hecto + metre = “百米”，直接对照记忆。"]}
{"word":"hectopascal","summary":{"en":"Hectopascal (hPa) is a pressure unit (100 Pa), widely used for atmospheric pressure in meteorology.","zh":"hectopascal（hPa）是压力单位（100 Pa），气象中常用来表示大气压。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of pressure equal to 100 pascals (Pa), commonly used in weather reports to measure atmospheric pressure","zh":"百帕（hPa）：压力单位，等于100帕（Pa），常用于天气预报中表示大气压"},"examples":[{"en":"The weather forecast says the pressure is 1013 hectopascals.","zh":"天气预报说气压是1013百帕。"},{"en":"A sudden drop in hectopascals can signal an approaching storm.","zh":"百帕数值突然下降可能预示风暴将至。"}]}],"synonyms":["hPa","millibar (mb)"],"phonetic":"/ˈhɛktoʊˌpæskəl/","extraExplanation":["在气象领域，hPa几乎等同于旧单位“毫巴”（millibar, mb）：1 hPa = 1 mb，所以你可能在旧资料或不同国家的天气图上看到mb。","标准海平面气压大约是1013.25 hPa（常写作1013 hPa），因此天气预报中“1000多百帕”是很常见的范围。"]}
{"word":"hectopascals","summary":{"en":"a pressure unit equal to 100 pascals, widely used in meteorology","zh":"等于100帕、常用于气象的压强单位"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of pressure equal to 100 pascals (Pa), commonly used in weather reports and atmospheric science","zh":"压强单位，等于100帕斯卡（Pa），常用于天气预报和大气科学"},"examples":[{"en":"Today’s sea-level pressure is about 1013 hectopascals.","zh":"今天的海平面气压大约是1013百帕。"},{"en":"Meteorologists often map pressure systems using hectopascals.","zh":"气象学家常用百帕来绘制气压系统分布图。"}]}],"synonyms":["hPa","millibar"],"phonetic":"/ˌhɛktoʊˈpæskəlz/","extraExplanation":["在天气图上常见的 1013 hPa（约等于标准大气压）就是“1013 百帕”。","1 hPa = 100 Pa；并且 1 hPa = 1 millibar（毫巴），所以有些资料会把两者互换使用。"],"etymology":"由 SI 前缀 hecto-（“百”，表示 100 倍）+ pascal（帕斯卡，压强单位；纪念法国科学家 Blaise Pascal）组成；hectopascal 表示“100 帕”。气象领域中常用 hPa，数值上与 millibar（毫巴）相同。","mnemonic":["hecto- 记成“百（100）”，所以 hectopascal = 100 帕。","把 hPa 看成“天气里的气压单位”：h（hecto 百）+ Pa（帕）。"]}
{"word":"Hector","summary":{"en":"to bully or intimidate; also a male name","zh":"霸凌/威吓；也指男性名字"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bully, intimidate, or talk to someone in an aggressive way","zh":"霸凌；威吓；用咄咄逼人的方式训斥/纠缠"},"examples":[{"en":"The coach warned the players not to hector the new teammate.","zh":"教练警告队员不要去霸凌新队友。"},{"en":"He tried to hector the cashier into giving him a refund.","zh":"他试图威吓收银员让对方给他退款。"},{"en":"She refused to be hectored into changing her decision.","zh":"她拒绝在威逼之下改变决定。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name; also used as a place name","zh":"男性名字“赫克托/海克托”；也可作地名"},"examples":[{"en":"Hector is named after his grandfather.","zh":"赫克托是以他祖父的名字命名的。"},{"en":"I met Hector at the library after class.","zh":"下课后我在图书馆遇到了赫克托。"}]}],"synonyms":["bully","intimidate","browbeat","badger","harass","threaten"],"phonetic":"/ˈhɛktɚ/","extraExplanation":["文化背景：Hector（赫克托耳）是希腊史诗《伊利亚特》中最著名的特洛伊英雄之一，常被描写为勇敢、有责任感的战士。英语把他的名字转成动词后，语气却偏负面，用来形容“咄咄逼人地欺压别人”。阅读时要注意这是“借名成词”的语义转变。"],"etymology":"动词 hector 来自人名 Hector（《伊利亚特》中“特洛伊第一勇士”赫克托耳）。17 世纪起，英语里用这个名字指“好勇斗狠、爱挑衅的人”，进而发展为“以强势口吻恐吓、霸凌”。人名 Hector 则源自希腊语 Hektōr，含义常解释为“坚守者/守护者”。","mnemonic":["联想：Hector（赫克托耳）是史诗里的“强势战士”，动词 hector 就像“用强势压人”。","记法：hector ≈ “heckle（起哄/刁难）+ 强硬语气”，都带有让人不舒服的逼迫感。"]}
{"word":"hector","summary":{"en":"Hector is a male name and also the name of a famous Trojan hero; as a verb, to hector means to bully or intimidate someone with aggressive talk.","zh":"Hector 是男性名字，也指《伊利亚特》中的特洛伊英雄；作动词 hector 意为用咄咄逼人的言语霸凌、恐吓他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often capitalized) A male given name.","zh":"（常大写）男性名字“赫克托/海克特”。"},"examples":[{"en":"Hector is my neighbor’s name.","zh":"Hector 是我邻居的名字。"},{"en":"We invited Hector to join our study group.","zh":"我们邀请 Hector 加入学习小组。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) In Greek mythology, a Trojan prince and great warrior in Homer’s *Iliad*.","zh":"（常大写）希腊神话/荷马史诗《伊利亚特》中的特洛伊王子、著名战士赫克托耳。"},"examples":[{"en":"In the *Iliad*, Hector is portrayed as brave and devoted to his family.","zh":"在《伊利亚特》中，赫克托耳被描写得勇敢且重视家庭。"},{"en":"The story of Hector is often contrasted with Achilles’ rage.","zh":"赫克托耳的故事常常与阿喀琉斯的愤怒形成对比。"}]},{"partOfSpeech":"v.","definition":{"en":"To speak to someone in a bullying, bossy, or threatening way; to harass or intimidate.","zh":"以霸凌、专横或带威胁的方式对人说话；骚扰、恐吓。"},"examples":[{"en":"The manager hectored the staff about every small mistake.","zh":"经理对员工的每一个小错误都要训斥、逼迫。"},{"en":"Don’t let anyone hector you into doing something you don’t want to do.","zh":"别让任何人用逼迫的方式让你去做你不想做的事。"}]}],"synonyms":["bully","harass","intimidate","badger","browbeat"],"phonetic":"/ˈhɛktɚ/","extraExplanation":["“hector”（动词）来自希腊神话人物赫克托耳（Hector）的名字：他在史诗中是强悍的战士。英语里后来把“像赫克托耳一样咄咄逼人/好斗的人”引申为“霸凌、恐吓”。","注意大小写：Hector（大写）通常是人名或神话人物；hector（小写）通常是动词，表示“霸凌式地训斥”。"]}
{"word":"hectorean","summary":{"en":"Hectorean means heroic and warrior-like, especially in a noble, Hector-of-Troy way.","zh":"Hectorean 指“赫克托耳式”的英勇与战士气概，带有高贵、史诗英雄般的色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Like Hector of Troy; brave, noble, and warrior-like.","zh":"（文学用语）像特洛伊的赫克托耳（Hector）一样的；勇敢、崇高且有战士气概的。"},"examples":[{"en":"The poem praises a Hectorean defender who refuses to abandon his city.","zh":"这首诗赞美了一位“赫克托耳式”的守卫者，他拒绝抛弃自己的城市。"},{"en":"She admired his Hectorean courage in the face of defeat.","zh":"她钦佩他在失败面前表现出的“赫克托耳式”勇气。"}]}],"synonyms":["heroic","valiant","noble","chivalrous","warrior-like"],"phonetic":"/hɛkˈtɔriən/","extraExplanation":["“Hectorean”来自希腊神话与《伊利亚特》（The Iliad）中的人物Hector（赫克托耳/赫克托），他是特洛伊最重要的王子与统帅之一，常被描写为勇敢、重视荣誉与家庭责任的战士。因此该词多用于文学或修辞，带有“古典史诗式英雄气质”的色彩。","使用场景：通常用来形容人的勇武与高贵精神（尤其在逆境中仍坚持责任与尊严），语气偏正式/文学化，日常口语中较少见。"]}
{"word":"hectored","summary":{"en":"Hectored means someone spoke in a bullying, intimidating way (past tense of hector).","zh":"hectored 指“以霸道、恐吓的方式说话/训斥”（hector 的过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of hector) to speak to someone in a bullying, bossy, or intimidating way; to badger.","zh":"（hector 的过去式/过去分词）以霸道、盛气凌人的方式对人说话；恐吓、纠缠。"},"examples":[{"en":"The supervisor hectored the staff about being five minutes late.","zh":"主管因为迟到了五分钟就对员工一通训斥。"},{"en":"She felt hectored into agreeing, even though she didn’t want to.","zh":"她觉得自己是被逼着同意的，尽管她并不愿意。"},{"en":"Reporters hectored the politician with the same question again and again.","zh":"记者反复追问同一个问题，让那位政客倍感压迫。"}]}],"synonyms":["bullied","badgered","browbeat","harassed","intimidated"],"phonetic":"ˈhɛk.tɚd","extraExplanation":["“hector”一词来自希腊史诗《伊利亚特》中的英雄赫克托耳（Hector）。在英语里，这个名字后来被用来指“爱逞强、爱欺压人的人”，进而发展出动词 hector，表示“盛气凌人地训斥/恐吓”。在正式写作或新闻语境中较常见，语气偏负面。"]}
{"word":"hectorer","summary":{"en":"A “hectorer” is someone who bullies or speaks in a loud, bossy way.","zh":"“hectorer”指说话盛气凌人、带威胁或欺凌他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who hectors—someone who talks to others in a loud, bossy, or bullying way","zh":"爱欺负人或爱颐指气使的人；说话盛气凌人、带威胁口吻的人"},"examples":[{"en":"Our new coach is a real hectorer—he shouts instead of explaining.","zh":"我们新教练很爱颐指气使——他只会喊叫，不会解释。"},{"en":"She stayed calm even when a hectorer tried to pressure her into agreeing.","zh":"即使有人咄咄逼人地施压要她同意，她也保持冷静。"}]}],"synonyms":["bully","braggart","blusterer","tyrant"],"phonetic":"/ˈhɛktərər/","extraExplanation":["“hectorer”来自动词 hector（欺凌、呵斥）。hector 这个词和特洛伊英雄“Hector（赫克托耳）”有关：在早期英语中，“to hector”带有“逞强、横行”的含义，后来更常指“以蛮横口吻恐吓或训斥别人”。","日常英语里更常用的说法是 bully（恶霸/欺凌者）、bossy person（爱指挥的人）、someone who talks down to others（居高临下说话的人）。"]}
{"word":"hectorian","summary":{"en":"Hectorian is a rare adjective meaning either ‘related to Hector (often heroic)’ or ‘bullying/hectoring in tone,’ depending on context.","zh":"Hectorian 是较少见的形容词，可指“与赫克托耳相关/带英雄气质”，也可指“霸道、恫吓式的语气”，具体看语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Like Hector (the Trojan hero) or connected with him; sometimes used to suggest heroic or noble qualities.","zh":"（文学用语）像特洛伊英雄赫克托耳（Hector）的；与他有关的；有时用来暗示英勇或高贵的气质。"},"examples":[{"en":"The poem gives the prince a Hectorian sense of duty to defend his city.","zh":"这首诗让王子呈现出一种“赫克托耳式”的责任感，要保卫自己的城邦。"},{"en":"In a Hectorian gesture, he chose to stand with his people rather than flee.","zh":"他做出了“赫克托耳式”的举动：选择与人民站在一起，而不是逃走。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Bullying or swaggering; hectoring in manner.","zh":"（罕见）恃强凌弱的、虚张声势的；带有“吓唬人/霸道”口吻的。"},"examples":[{"en":"The supervisor’s Hectorian tone made everyone nervous.","zh":"主管那种霸道的口吻让大家都很紧张。"},{"en":"Try to persuade, not to speak in a Hectorian way.","zh":"尽量用说服的方式，不要用那种咄咄逼人的语气。"}]}],"synonyms":["Trojan","heroic","valiant","hectoring","bullying","blustering"],"phonetic":"/hɛkˈtɔriən/","extraExplanation":["“Hectorian”来自古希腊史诗《伊利亚特》中的特洛伊英雄赫克托耳（Hector）。不过在中世纪和近代早期的欧洲文学/戏剧里，Hector有时被塑造成爱夸口、好斗的“莽汉”形象，这也影响了英语里 hector（动词/名词）表示“威吓、霸道地说话”的意思。因此“Hectorian”既可能偏“英雄式”，也可能偏“霸道式”，要看语境。"]}
{"word":"hectoring","summary":{"en":"Hectoring means bullying, intimidating speech or behavior—talking in a loud, bossy way to pressure others.","zh":"hectoring 指用盛气凌人、带威吓意味的方式说话或行事，试图用强势语言压迫他人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"using forceful, bullying speech; speaking in a loud, aggressive way to intimidate others","zh":"（说话方式）威吓的；盛气凌人的；以咄咄逼人的口吻恐吓他人的"},"examples":[{"en":"His hectoring tone made everyone uncomfortable during the meeting.","zh":"他在会议上那种盛气凌人的语气让大家都很不舒服。"},{"en":"The manager stopped the hectoring comments and asked for a calm discussion.","zh":"经理制止了那些威吓式的评论，并要求大家冷静讨论。"}]},{"partOfSpeech":"v.","definition":{"en":"to talk to someone in a bullying, domineering way; to harass with threats or insults","zh":"以威吓、霸道的方式对人说话；用威胁或辱骂来骚扰"},"examples":[{"en":"He kept hectoring the staff for small mistakes.","zh":"他不断因小错误而用咄咄逼人的方式训斥员工。"},{"en":"Don’t let anyone hector you into agreeing.","zh":"不要让任何人用威吓逼迫你同意。"}]}],"synonyms":["bullying","intimidating","overbearing","domineering","blustering"],"phonetic":"/ˈhɛk.tɚ.ɪŋ/","extraExplanation":["“hectoring”来自动词“to hector（威吓、霸凌式地说话）”。它和《伊利亚特》中的特洛伊英雄“Hector（赫克托耳）”有关：在早期英语里，“Hector”一度被用来指“好斗、虚张声势的人”，后来发展出“hector”这个动词，强调用强势、压迫性的言语去控制别人。","常见搭配：hectoring tone/voice（威吓的语气/口吻）、hectoring manner（盛气凌人的态度）。语体偏书面或正式，用来批评某人说话方式不尊重人。"]}
{"word":"hectoringly","summary":{"en":"“Hectoringly” means speaking in a bullying, overbearing way.","zh":"“hectoringly”表示以盛气凌人、带有威吓感的方式说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a loud, bossy, or bullying way; speaking as if you have authority and trying to intimidate others.","zh":"以盛气凌人、咄咄逼人或带有霸凌意味的方式；说话像在摆架子、试图压人。"},"examples":[{"en":"The manager spoke hectoringly to the staff, as if any question were a challenge.","zh":"经理对员工说话咄咄逼人，仿佛任何提问都是在挑衅。"},{"en":"She hectoringly told him to apologize, even though she didn’t know the full story.","zh":"她不分青红皂白地盛气凌人地要他道歉，尽管她并不了解全部情况。"}]}],"synonyms":["bullyingly","overbearingly","intimidatingly","aggressively","domineeringly"],"phonetic":"/ˈhɛk.tɚ.ɪŋ.li/","extraExplanation":["“hectoringly”来自动词“hector”（威吓、欺压），而“hector”又源自《伊利亚特》中“赫克托耳（Hector）”这一形象：后来英语里把“像赫克托耳那样逞强好斗”引申为“恃强凌弱、盛气凌人”。如今这个词多带负面评价，用来批评某人说话态度粗暴、居高临下。"]}
{"word":"hectorism","summary":{"en":"Hectorism means bullying, blustering intimidation—especially aggressive, overbearing speech or manner.","zh":"hectorism 指恃强凌弱、虚张声势的恐吓，尤指言语或态度上的咄咄逼人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bullying or blustering behavior; loud, aggressive intimidation (often in speech).","zh":"恃强凌弱的行为；虚张声势的恐吓（常指言语上的咄咄逼人）。"},"examples":[{"en":"The manager’s hectorism made everyone afraid to ask questions.","zh":"经理的霸凌式咄咄逼人，让大家都不敢提问。"},{"en":"She refused to give in to his hectorism during the meeting.","zh":"她在会议上拒绝屈服于他那种强势威吓的态度。"}]}],"synonyms":["bullying","intimidation","bluster","browbeating","swaggering"],"phonetic":"/ˈhɛk.tɚ.ɪz.əm/","extraExplanation":["“hectorism”来自人名 Hector（赫克托耳，特洛伊英雄），在英语里“Hector”曾被用来指“爱逞强、爱恐吓的人”，再加后缀 -ism 表示“某种作风/倾向”。因此它带有“以强硬姿态压人、用气势吓人”的贬义色彩。","与日常更常见的词相比：hectorism更强调“用强硬、咄咄逼人的方式压制别人”，不一定包含肢体暴力，更偏向言语与态度上的欺压。"]}
{"word":"hectorite","summary":{"en":"a swelling clay mineral used as a thickening or stabilizing agent","zh":"一种会吸水膨胀、常用于增稠和稳定的黏土矿物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft clay mineral (a type of smectite) that swells in water and is often used as a thickener, binder, or stabilizer in products like cosmetics, paints, and drilling fluids","zh":"一种柔软的黏土矿物（属蒙脱石/皂石类的膨润性黏土），遇水会膨胀，常用作增稠剂、黏结剂或稳定剂（如化妆品、涂料、钻井液等）"},"examples":[{"en":"The lotion uses hectorite to keep the ingredients evenly mixed.","zh":"这款乳液用皂石黏土来让成分保持均匀不分层。"},{"en":"In lab work, hectorite is sometimes used to study how clays swell in water.","zh":"在实验室里，人们有时用皂石黏土来研究黏土在水中的膨胀行为。"}]}],"synonyms":["smectite","clay"],"phonetic":"/ˈhɛk.təˌraɪt/","extraExplanation":["它属于“smectite（膨润土类/蒙脱石族）”黏土的一种，特点是片层结构可吸水膨胀，因此在日化、涂料、医药载体与工业流体中常被用来“增稠、悬浮、稳定”。"],"etymology":"来自矿物命名：以美国加州的 Hector（赫克托）地区命名；后缀 -ite 常用于表示“矿物”。","mnemonic":["记后缀：-ite = “矿物”（如 graphite 石墨、calcite 方解石），所以看到 hectorite 多半就是一种矿物/黏土。","联想地名：Hector + -ite = “Hector 那里的矿物”。"]}
{"word":"hectorly","summary":{"en":"Hectorly means behaving or speaking in a bullying, domineering way.","zh":"hectorly 指“霸凌式、盛气凌人地”行事或说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a bullying, threatening, or domineering way; aggressively and arrogantly","zh":"以霸凌、恐吓或盛气凌人的方式；咄咄逼人地"},"examples":[{"en":"He spoke hectorly to the staff, as if everyone had to obey him.","zh":"他对员工说话盛气凌人，好像所有人都必须服从他。"},{"en":"The customer hectorly demanded a refund, raising his voice in the store.","zh":"那位顾客咄咄逼人地要求退款，还在店里提高了嗓门。"}]}],"synonyms":["bullyingly","threateningly","domineeringly","overbearingly","intimidatingly"],"phonetic":"/ˈhɛktərli/","extraExplanation":["“hectorly”来自动词 hector（霸凌、恐吓），而 hector 一词与特洛伊英雄赫克托耳（Hector）的名字有关：在早期英语里，Hector 被塑造成“好斗、逞强”的形象，因此衍生出“以强凌弱、盛气凌人”的含义。","语气上它带明显的负面评价，常用于描述说话方式（hectorly speak/lecture）或行为态度。日常写作中更常见的是 hectoring（adj.）或 to hector（v.）。"]}
{"word":"hectors","summary":{"en":"“hectors” is usually the verb form meaning “speaks in a bullying, bossy way,” or the plural noun for the name “Hector.”","zh":"“hectors”通常是动词形式，表示“以霸道、欺压的口吻说话”，也可以是人名“Hector”的复数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb form) Third-person singular of “hector”: to speak to someone in a bullying, bossy, or intimidating way; to harass with aggressive words.","zh":"（动词形式）“hector”的第三人称单数：以霸道、恐吓的口吻对人说话；用咄咄逼人的言语骚扰、欺压。"},"examples":[{"en":"He hectors his teammates when they make small mistakes.","zh":"队友犯一点小错，他就会霸道地训人。"},{"en":"The manager hectors staff instead of giving helpful feedback.","zh":"那位经理不是给建设性反馈，而是对员工咄咄逼人。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun form) Plural of “Hector”: people named Hector; also “Hectors” can refer to the Trojan hero Hector in stories (as a name used in plural, e.g., in a list of names).","zh":"（名词形式）“Hector”的复数：名叫Hector的人；也可指（在故事或名字列表中）“特洛伊英雄赫克托耳（Hector）”这一名字的复数用法。"},"examples":[{"en":"In our class there are two Hectors.","zh":"我们班里有两个叫Hector的人。"},{"en":"The book mentions several heroes—Achilles, Hectors, and others—across different retellings.","zh":"这本书在不同改写版本中提到几位英雄——阿喀琉斯、（不同版本里的）赫克托耳等。"}]}],"synonyms":["bully","badger","browbeat","intimidate","harass"],"phonetic":"/ˈhɛktərz/","extraExplanation":["“hector”作动词时，语气通常是负面的，强调“仗势欺人、盛气凌人地训斥”。它常见搭配：hector someone (about/over something)（就某事对某人咄咄逼人）。","词源上与《伊利亚特》中的特洛伊英雄Hector有关：早期英语里“a Hector”曾指“好斗的夸口者/恶霸”，后来发展出动词义“霸凌式地说话”。"]}
{"word":"hectorship","summary":{"en":"Hectorship means bullying or blustering, pushy behavior—especially speaking in a threatening, overbearing way.","zh":"hectorship 指恃强凌弱、虚张声势的霸道作风，尤指用威吓、咄咄逼人的方式说话。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of bullying, swaggering, or speaking in a threatening way; bluster.","zh":"恃强凌弱、虚张声势或以威吓口吻说话的行为；霸凌式逞强。"},"examples":[{"en":"His hectorship in meetings made younger coworkers afraid to speak.","zh":"他在会议上的恃强凌弱让年轻同事不敢发言。"},{"en":"The coach criticized the captain’s hectorship and asked for more respectful leadership.","zh":"教练批评队长的霸凌式作风，要求更尊重人的领导方式。"}]}],"synonyms":["bullying","intimidation","bluster","browbeating","swaggering"],"phonetic":"/ˈhɛktɚˌʃɪp/","extraExplanation":["“hectorship”来自动词 hector（恐吓、霸凌式逞强）+ 后缀 -ship（表示“行为/状态/身份”）。hector 最初与特洛伊英雄 Hector 的名字相关：在早期英语里有人把“Hector”当作爱逞强、爱挑衅之人的绰号，后来词义转为“恃强凌弱、虚张声势”。这个名词用法较少见，日常更常见的说法是 bullying、intimidation、bluster 或 hectoring behavior。"]}
{"word":"hectostere","summary":{"en":"Hectostere is a rare volume unit equal to 100 steres, used mainly for measuring stacked firewood.","zh":"hectostere是一种较少见的体积单位，等于100个stere，主要用于计量堆放的薪材/柴火。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of volume equal to 100 steres (about 100 cubic meters), traditionally used to measure stacked firewood.","zh":"一种体积单位，等于100个stere（约100立方米），传统上用于计量堆放的柴火/薪材。"},"examples":[{"en":"The forestry report recorded deliveries in hectosteres of firewood.","zh":"这份林业报告用hectostere来记录柴火的交付量。"},{"en":"Prices were listed per hectostere for stacked wood.","zh":"堆放木材的价格按每hectostere标示。"}]}],"synonyms":["(unit) 100 steres","(approx.) 100 cubic meters (context-dependent)"],"phonetic":"/ˈhɛktoʊstɪr/","extraExplanation":["hectostere由前缀hecto-（表示“百”）和stere组成。stere在一些欧洲语境中用于表示“堆放木材的一立方米（通常按堆叠体积计）”，因此hectostere常见于较旧的林业、薪材贸易或统计资料中。","在现代英语中这个词非常少见；实际使用时常会直接换算成cubic meters（立方米）或用更常见的计量方式表达。"]}
{"word":"hectowatt","summary":{"en":"Hectowatt means 100 watts, a unit of power.","zh":"hectowatt 指“百瓦”，等于100瓦，是一种功率单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of power equal to 100 watts (W).","zh":"功率单位，等于100瓦（W）。"},"examples":[{"en":"This small generator is rated at 3 hectowatts (300 W).","zh":"这台小型发电机的额定功率是3百瓦（300 W）。"},{"en":"In everyday English, people usually say “100 watts” instead of “one hectowatt.”","zh":"在日常英语里，人们通常说“100瓦”，而不说“1百瓦（hectowatt）”。"}]}],"synonyms":["100 watts","hecto- watt (SI unit form)"],"phonetic":"/ˈhɛktoʊˌwɑt/","extraExplanation":["hecto- 是国际单位制（SI）的词头，表示“100”。因此 hectowatt = hecto（100）+ watt（瓦）。在工程或日常交流中，这个单位不如 kilowatt（千瓦，1000 W）常见。"]}
{"word":"hectyli","summary":{"en":"“hectyli” isn’t a common English word; it’s probably a misspelling (maybe “hectic,” “hectare,” or “hexyl”).","zh":"“hectyli”不是常见英语词；可能是拼写错误（也许是“hectic”“hectare”或“hexyl”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a specialized term.","zh":"不是标准英语单词；很可能是拼写错误或某个专业领域用语。"},"examples":[{"en":"I couldn’t find “hectyli” in a general English dictionary—did you mean “hectare” or “hectic”?","zh":"我在通用英语词典里找不到“hectyli”——你是想写“hectare（公顷）”还是“hectic（忙乱的）”吗？"}]}],"phonetic":"/ˈhɛk.ti.laɪ/","extraExplanation":["“hectyli”最像是输入/拼写误差。常见相近词包括：hectic（忙乱的、紧张的）、hectare（公顷）、hexyl（己基，化学名词）。如果你告诉我它出现的句子或领域（比如化学/医学/地理），我可以更准确判断。"]}
{"word":"hecuba","summary":{"en":"Hecuba is the queen of Troy in Greek mythology, often used in literature to symbolize profound grief after war and loss.","zh":"赫卡柏是希腊神话中的特洛伊王后，文学中常用来象征战争与失去之后的深重悲痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the queen of Troy and wife of King Priam, known especially for her suffering after the fall of Troy.","zh":"（希腊神话）赫卡柏：特洛伊王后，普里阿摩斯（Priam）的妻子，尤以特洛伊陷落后的悲惨遭遇而闻名。"},"examples":[{"en":"In the myth, Hecuba loses many of her children after Troy is destroyed.","zh":"在神话中，特洛伊被毁后，赫卡柏失去了许多孩子。"},{"en":"Our literature class read Euripides’ tragedy *Hecuba*, which shows her grief and anger.","zh":"我们的文学课读了欧里庇得斯的悲剧《赫卡柏》，展现了她的悲痛与愤怒。"}]},{"partOfSpeech":"n.","definition":{"en":"A character name used in plays and literature (especially Greek tragedy) to represent extreme grief, loss, or a fallen queen.","zh":"（文学/戏剧用法）作为人物名，常用来象征极端的悲痛、失去与“失国王后”的命运。"},"examples":[{"en":"The author compares the mother’s sorrow to Hecuba’s to emphasize how deep it is.","zh":"作者把这位母亲的悲伤比作赫卡柏的痛苦，以强调其深重。"},{"en":"In some modern poems, “Hecuba” stands for a world where war destroys families.","zh":"在一些现代诗歌中，“赫卡柏”象征战争摧毁家庭的世界。"}]}],"synonyms":["Queen of Troy","Hekabe (alternate spelling)"],"phonetic":"/ˈhɛkjəbə/","extraExplanation":["“Hecuba”常见于古希腊悲剧：欧里庇得斯（Euripides）的《The Trojan Women（特洛伊妇女）》与《Hecuba（赫卡柏）》中，她从王后沦为战俘，集中呈现战争对平民与女性的残酷。","英语里偶尔会把“Hecuba”当作文化典故（allusion）使用：提到她，往往是在借用“国破家亡后的极端悲恸/愤怒”这一意象。"]}

