{"word":"hed","summary":{"en":"“Hed” is an informal short form used mainly in journalism for “headline,” and sometimes a clipped form of “hedge” in finance.","zh":"“hed”主要是新闻业里“headline（标题）”的非正式简写；在金融语境中也偶尔作为“hedge（对冲）”的简写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(journalism, informal) A headline; the title line of a news story.","zh":"（新闻业/行话，非正式）标题；新闻报道的题目。"},"examples":[{"en":"The editor asked me to rewrite the hed to make it clearer.","zh":"编辑让我重写标题，让它更清楚。"},{"en":"That hed is too long for the front page.","zh":"那个标题对头版来说太长了。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, clipped) Short for “hedge,” meaning to reduce risk by taking a protecting action, especially in finance.","zh":"（非正式缩写）“hedge”的简写，指（尤其在金融中）通过对冲等方式降低风险。"},"examples":[{"en":"The company hedged its fuel costs by buying futures.","zh":"公司通过购买期货对冲燃油成本。"},{"en":"Investors often hedge when markets are uncertain.","zh":"市场不确定时，投资者常常会进行对冲。"}]}],"synonyms":["headline","title","header","hedge"],"phonetic":"/hɛd/","extraExplanation":["“hed”最常见于英文新闻编辑部的行话：headline 常被简写成 hed（有时还会配套出现 dek=副标题）。这种写法多见于内部沟通、排版标注或新闻制作软件里；正式文章里通常写 full form：headline。","作为“hedge”的缩写用法也存在，但更偏口语/速记或行业内部简写；标准书面语一般写 hedge / hedged。"]}
{"word":"heddle","summary":{"en":"A heddle is a loom part (a looped cord or wire) that holds and guides warp threads during weaving.","zh":"heddle 指织机上的综丝/综眼，用来固定并引导经线以完成织造。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A looped cord or wire on a loom that holds and guides a warp thread so it can be raised or lowered to form a woven pattern.","zh":"织机上的“综丝/综眼”（环状的绳或金属丝），用来固定并引导经线，通过上下提综来形成织纹。"},"examples":[{"en":"Each warp thread passes through a heddle on the loom.","zh":"每一根经线都会穿过织机上的一根综丝（heddle）。"},{"en":"She replaced a bent heddle to stop the threads from snagging.","zh":"她更换了一根弯曲的综丝，避免纱线被勾住。"}]}],"synonyms":["heald"],"phonetic":"/ˈhɛdəl/","extraExplanation":["heddle 常见于纺织与织布语境中，也可拼作 heald（尤其在英式用法中更常见）。它通常安装在“综框/提综装置”上，通过提起或放下不同的综丝组来改变经线的开口，从而织出不同花纹。","由于属于专业词汇，日常英语里不常见；在阅读手工织布、纺织史或工艺说明书时更可能遇到。"]}
{"word":"heddlemaker","summary":{"en":"A heddlemaker is someone who makes or repairs heddles used in weaving looms.","zh":"heddlemaker 指制作或修理织机综丝的工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes or repairs heddles (the wire or cord loops that guide warp threads on a weaving loom).","zh":"综丝工；制造或修理“综丝”（织机上用来引导经纱的金属丝或线圈）的人。"},"examples":[{"en":"The museum’s loom was restored with help from a local heddlemaker.","zh":"博物馆的织机在一位当地综丝工的帮助下得以修复。"},{"en":"In older textile towns, a heddlemaker was an important trade.","zh":"在早期的纺织城镇里，综丝工是一门重要的行当。"}]}],"synonyms":["heddle maker","loom-part maker","weaving-tool maker"],"phonetic":"/ˈhɛd(ə)lˌmeɪkɚ/","extraExplanation":["“heddlemaker”是一个较少见的职业名词，常见于纺织史、手工织造、博物馆或历史文献中。","heddle（综丝）是织机上的关键部件：经纱穿过综丝的孔或圈，织工抬起或放下综框来形成开口（shed），让纬纱通过。"]}
{"word":"heddler","summary":{"en":"Heddler is a rare noun meaning a loom worker connected with heddles used in weaving.","zh":"heddler 是个很少见的名词，指与织布机“综丝/综眼（heddles）”相关的织造工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes, repairs, or works with heddles (the wire or cord loops on a loom that lift and separate threads during weaving)","zh":"（织布机上的）综丝/综眼（heddle）的制作工、修理工，或操作综丝进行织布的人"},"examples":[{"en":"The museum demonstrated how a heddler adjusts the heddles to form different patterns.","zh":"博物馆演示了一名综丝工如何调整综丝来织出不同的花纹。"},{"en":"In older textile towns, heddlers and other loom workers were common trades.","zh":"在早期的纺织城镇里，综丝工和其他织机工种都很常见。"}]}],"synonyms":["loom worker","weaver"],"phonetic":"/ˈhɛdlər/","extraExplanation":["“heddler”在现代英语里非常少见，多出现在纺织/织造的历史语境中；日常生活几乎不会用到。","很多学习者会把它看成“peddler”（小贩、叫卖者）的拼写错误；两者读音和意思都不同：peddler（/ˈpɛdlər/）更常用。"]}
{"word":"heddles","summary":{"en":"Heddles are loom parts (loops) that hold and lift warp threads during weaving.","zh":"heddles 指织机上的综丝/综眼装置，用来套住并升降经纱以进行织布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of heddle: the wire or cord loops on a loom that hold warp threads and move up and down to form the shed for weaving.","zh":"heddle 的复数：织机上用来套住经纱、上下移动以形成“梭口”（便于穿梭织纬）的金属丝或绳线圈（综丝/综眼装置）。"},"examples":[{"en":"The weaver replaced several broken heddles before starting the pattern.","zh":"织工在开始织花样之前更换了几根断掉的综丝（heddles）。"},{"en":"If the heddles are out of alignment, the warp threads may rub and fray.","zh":"如果综丝（heddles）没有对齐，经纱可能会摩擦起毛甚至磨断。"}]}],"synonyms":["heddle frames (related)","harnesses (weaving, related)"],"phonetic":"/ˈhɛdəl/","extraExplanation":["heddle 常见于纺织与织布语境，属于“loom（织机）”的关键部件：它通过“综眼”控制经纱分组升降，从而让梭子（shuttle）穿过形成纬纱。","在中文里常译作“综丝/综眼（装置）”。不同织机（如手织机、提花机）用到的 heddles 形态可能不同，但核心功能一致。"]}
{"word":"hede","summary":{"en":"“Hede” is usually a nonstandard spelling of “heed,” meaning to pay attention to and follow advice or warnings.","zh":"“hede”通常是“heed”的非标准拼写，意思是“注意、留心并听从建议或警告”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Often a misspelling) to pay attention to; to listen to and follow advice or a warning.","zh":"（常见拼写错误）注意；留心并听从（建议或警告）。"},"examples":[{"en":"He didn’t hede the warning and got lost.","zh":"他没有留心那个警告，结果迷路了。"},{"en":"You should hede your doctor’s advice.","zh":"你应该听从医生的建议。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/Nonstandard) to take notice; to be careful or mindful.","zh":"（少见/非标准用法）留意；小心；放在心上。"},"examples":[{"en":"If you hede, you’ll notice the sign on the door.","zh":"如果你留心，就会注意到门上的标志。"}]}],"synonyms":["heed","pay attention to","listen to","take notice of","follow"],"phonetic":"/hid/","extraExplanation":["“hede”在现代标准英语里不是常见拼写；通常人们想写的是“heed”。如果你是在看到人名/地名“Hede”（如北欧姓氏）或其他语言（如丹麦语/挪威语里与“heath/荒原”相关的词）中遇到它，含义和发音可能会不同。","英语里更地道的搭配是：heed a warning（留意警告）、heed advice（听从建议）、take heed（提高警惕/多加小心）。"]}
{"word":"hedebo","summary":{"en":"Hedebo is a Danish whitework embroidery style famous for delicate cutwork and lace-like patterns.","zh":"Hedebo是一种丹麦白刺绣风格，以精细镂空与蕾丝感纹样闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Danish style of whitework embroidery (often on linen) known for delicate cutwork, drawn-thread patterns, and lace-like effects; named after the Hedebo area near Copenhagen.","zh":"一种丹麦传统的白刺绣（常用于亚麻布）的风格，以精细的镂空、抽纱与蕾丝般的效果著称；因丹麦哥本哈根附近的Hedebo地区而得名。"},"examples":[{"en":"She learned Hedebo to decorate table linens with intricate white patterns.","zh":"她学习Hedebo刺绣，用精致的白色花纹装饰桌布和餐巾。"},{"en":"The museum displayed a 19th-century blouse featuring Hedebo cutwork.","zh":"博物馆展出了一件19世纪的上衣，上面有Hedebo风格的镂空刺绣。"}]}],"synonyms":["Hedebo embroidery","Danish whitework"],"phonetic":"ˈhiːdəboʊ","extraExplanation":["Hedebo通常被归入“whitework（白刺绣）”传统：多用白线在白色或浅色布料上做装饰，因此更强调纹理、光影和工艺细节，而不是颜色。","它在丹麦民间服饰与家用织物（如领口、袖口、桌布、枕套）上很常见；常见技法包括抽纱（drawn-thread）、镂空剪织（cutwork）以及形成小圈状、网状的蕾丝效果。","在手工与纺织艺术语境中，Hedebo常被当作专有名词使用：可以说“a Hedebo piece / Hedebo embroidery”，也可作定语如“Hedebo techniques（Hedebo技法）”。"]}
{"word":"hedenbergite","summary":{"en":"Hedenbergite is a calcium–iron pyroxene mineral commonly found in igneous and metamorphic rocks.","zh":"Hedenbergite（钙铁辉石）是一种钙铁硅酸盐的辉石族矿物，常见于火成岩和变质岩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a green to brown mineral in the pyroxene group (a calcium-iron silicate), commonly found in igneous and metamorphic rocks.","zh":"一种辉石族矿物（钙铁硅酸盐），颜色常呈绿色到褐色，常见于火成岩与变质岩中。"},"examples":[{"en":"The thin section showed hedenbergite crystals growing beside magnetite.","zh":"薄片显微观察显示，钙铁辉石晶体在磁铁矿旁生长。"},{"en":"Hedenbergite often forms under iron-rich conditions in skarn deposits.","zh":"在富铁条件下的矽卡岩矿床中，钙铁辉石常会形成。"}]}],"synonyms":["calcium-iron pyroxene"],"phonetic":"/ˌhiːdənˈbɝːɡənaɪt/","extraExplanation":["“Hedenbergite”常译作“钙铁辉石”，属于单斜辉石（clinopyroxene）的一种，化学式常写为 CaFeSi2O6，和“diopside（透辉石，CaMgSi2O6）”在成分上构成系列：铁含量越高越接近hedenbergite。","该词源自人名（通常指瑞典化学家/矿物学家相关姓名），以纪念人物来命名矿物是矿物学中很常见的传统。","发音上注意重音常落在第三音节附近（he-DEN-ber-...），结尾“-ite”在矿物名中很常见，通常读作 /aɪt/。"]}
{"word":"hedeoma","summary":{"en":"Hedeoma is a botanical genus of strongly aromatic mint-family plants, including American pennyroyal.","zh":"Hedeoma 是唇形科中一种气味浓郁的植物属名，包含美洲薄荷（American pennyroyal）等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, strongly aromatic mint-family plants (family Lamiaceae), especially American pennyroyal (Hedeoma pulegioides).","zh":"香薄荷属（唇形科）的一个植物属，植株多较小且气味浓郁；常指其中的“美洲薄荷/美洲胡薄荷”（American pennyroyal，学名 Hedeoma pulegioides）。"},"examples":[{"en":"In some field guides, hedeoma is listed among the wild mints because of its strong smell.","zh":"在一些野外植物图鉴里，hedeoma 因为气味浓烈而被归在野生薄荷类植物中。"},{"en":"American pennyroyal belongs to the genus hedeoma.","zh":"美洲薄荷（American pennyroyal）属于香薄荷属（hedeoma）。"}]}],"synonyms":["American pennyroyal (common name for one species)","pennyroyal (common name, depending on species)"],"phonetic":"/ˌhiːdiˈoʊmə/","extraExplanation":["词源：来自希腊语元素，意为“甜/芳香的气味”（大意是“闻起来很香”）。","用法提示：在日常英语里更常见的是具体植物名（如 pennyroyal）或更宽泛的说法（mint, wild mint）。hedeoma 多见于植物学、园艺或自然观察类文本。","文化/安全补充：pennyroyal（某些薄荷类）在草药传统中出现过，但其精油可能有毒性风险；涉及食用或药用时应以专业与安全信息为准。"]}
{"word":"heder","summary":{"en":"A header is the top part of a page/document or a labeling line (especially in tables/data).","zh":"header 指页面/文件的顶部区域（页眉/页头），也可指表格或数据中的标题行（表头）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The top part of a document, web page, email, or letter that often contains a title, logo, date, page number, or other key information.","zh":"（文件、网页、邮件或信件的）页眉/顶部区域，通常包含标题、标志、日期、页码等信息。"},"examples":[{"en":"Please put the company logo in the header of the report.","zh":"请把公司标志放在报告的页眉（顶部）里。"},{"en":"The website header includes a search bar and the main menu.","zh":"网站的页头包含搜索框和主菜单。"}]},{"partOfSpeech":"n.","definition":{"en":"A line of text used to label or organize information, especially in a table, form, or data file.","zh":"（表格、表单或数据文件中的）标题行/表头，用于标注或整理信息。"},"examples":[{"en":"The first row is the header, so don’t include it in the calculations.","zh":"第一行是表头，所以不要把它算进计算里。"},{"en":"This CSV file has a header with column names.","zh":"这个CSV文件有一行包含列名的表头。"}]},{"partOfSpeech":"n.","definition":{"en":"In newspapers or media, the title at the top of the front page (also called the ‘masthead’).","zh":"（报纸等媒体的）报头/报头标题（也可称作 masthead）。"},"examples":[{"en":"The newspaper’s header was redesigned last year.","zh":"这家报纸去年重新设计了报头。"}]}],"synonyms":["heading","title","head","banner","masthead"],"phonetic":"/ˈhɛdɚ/","extraExplanation":["“heder”通常不是标准拼写，很多情况下是把“header”拼错了。","在编程/网络中，header 还常指“HTTP 请求/响应头（headers）”，用于传递如语言、认证、缓存等信息。"]}
{"word":"hedera","summary":{"en":"Hedera is the scientific genus name for ivy plants, especially common ivy.","zh":"Hedera 是“常春藤属”的学名，指常春藤一类植物，尤指常见的常春藤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of evergreen climbing plants (ivies), especially the common ivy","zh":"常春藤属（攀援常绿植物），尤指“常春藤/英国常春藤”"},"examples":[{"en":"Hedera helix is a type of ivy often grown on walls and fences.","zh":"Hedera helix（常春藤）常被种在墙面和栅栏上攀爬生长。"},{"en":"In some gardens, hedera is used as ground cover in shady areas.","zh":"在一些花园里，hedera 会在阴凉处作为地被植物种植。"}]}],"synonyms":["ivy","common ivy","English ivy"],"phonetic":"/ˈhɛdərə/","extraExplanation":["“Hedera”来自拉丁语，意思就是“常春藤”。在园艺与植物学中常作为学名属名出现，日常英语里更常说 ivy。","常见物种 Hedera helix 在西方文化中常与“坚韧、长久、依恋”相关，也常见于建筑外墙与墓园景观。","注意：常春藤对人和宠物可能有轻微毒性，误食可能引起不适；园艺操作时可戴手套避免皮肤刺激。"]}
{"word":"hederaceous","summary":{"en":"Hederaceous means ivy-like or covered with ivy, often used in botanical or literary descriptions.","zh":"hederaceous 指“常春藤状的”或“长满常春藤的”，常用于植物学或文学性描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Ivy-like; resembling ivy, especially in the shape of the leaves.","zh":"常春藤状的；（尤指叶形）像常春藤的。"},"examples":[{"en":"The plant has hederaceous leaves, with lobes similar to ivy.","zh":"这种植物的叶子呈常春藤状，叶裂形态很像常春藤。"},{"en":"A botanist described the vine as hederaceous in appearance.","zh":"一位植物学家形容这株藤本植物外观呈常春藤状。"}]},{"partOfSpeech":"adj.","definition":{"en":"Covered with ivy or having ivy growing on it.","zh":"被常春藤覆盖的；长满常春藤的。"},"examples":[{"en":"They walked past a hederaceous wall at the edge of the garden.","zh":"他们走过花园边一面长满常春藤的墙。"},{"en":"In the old novel, the mansion is pictured as hederaceous and shadowy.","zh":"在那部旧小说里，庄园被描写成长满常春藤、阴影重重的样子。"}]}],"synonyms":["ivy-like","ivy-covered","climbing","vining"],"phonetic":"ˌhɛdəˈreɪʃəs","extraExplanation":["词源上来自拉丁语 hedera（“常春藤”）+ -aceous（表示“……样的/具有……性质的”）。因此它多见于植物学、园艺或较文学化的描写中，比常用的 ivy-like 更正式。"]}
{"word":"hederaceously","summary":{"en":"A rare adjective meaning “ivy-like” or “related to ivy.”","zh":"一个很少见的形容词，意思是“像常春藤的/与常春藤有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Like ivy; relating to ivy (genus Hedera), or having ivy-like growth habits (especially climbing or trailing).","zh":"（植物）像常春藤的；与常春藤（Hedera 属）有关的；具有常春藤那种攀缘或蔓生习性的。"},"examples":[{"en":"The wall was covered with hederaceous vines that climbed up the bricks.","zh":"墙上爬满了常春藤状的藤蔓，沿着砖块向上攀爬。"},{"en":"In the garden, a hederaceous plant can quickly cover a fence and create shade.","zh":"在花园里，常春藤状的植物能很快覆盖篱笆并形成阴凉。"}]}],"synonyms":["ivy-like","climbing","trailing"],"phonetic":"/ˌhɛdɚˈeɪʃəs/","extraExplanation":["这个词非常少见，主要出现在植物学或较文艺的描写里。更常用、也更自然的表达是：“ivy（常春藤）”、“ivy-like（像常春藤的）”或“covered in ivy（被常春藤覆盖）”。","词源来自拉丁语 Hedera（常春藤）。拼写容易出错：hederaceous 里有 “-der-”，不是 “-dra-”。"]}
{"word":"hederal","summary":{"en":"Hederal means “of or like ivy,” usually in botanical or descriptive writing.","zh":"hederal 指“与常春藤有关的/像常春藤的”，多见于植物学或描写性用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to ivy (the plant), or resembling ivy in growth or appearance.","zh":"与常春藤（ivy）有关的；像常春藤的（如攀援生长、蔓延形态等）。"},"examples":[{"en":"The garden wall was covered with hederal vines.","zh":"花园的墙上爬满了常春藤般的藤蔓。"},{"en":"In the old painting, hederal leaves frame the doorway.","zh":"在那幅老画中，常春藤状的叶子围绕着门口。"}]}],"synonyms":["ivy-like","ivy-covered","of ivy","hederaceous"],"phonetic":"ˈhɛdərəl","extraExplanation":["“hederal”较少见，常用于植物学或描写性文字中，表示“常春藤的/像常春藤的”。日常英语更常说“ivy”或“ivy-covered / ivy-like”。","词源来自拉丁语“hedera”（常春藤），也用于学名属名“Hedera”。"]}
{"word":"hederated","summary":{"en":"“Hederated” is not standard; you probably mean “federated,” meaning joined together while keeping some independence.","zh":"“hederated”通常不是标准用法；你可能想写 “federated”，意思是“联合起来但仍保留一定独立性”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely misspelling) If you meant “federated”: joined together as a group of states, organizations, or parts that keep some independence.","zh":"（可能是拼写错误）如果你想写的是 “federated”：指多个州、组织或部分联合在一起，但各自仍保留一定的独立性。"},"examples":[{"en":"A federated country has a central government, but its states have their own powers.","zh":"联邦制国家有中央政府，但各州也拥有自己的权力。"},{"en":"These small clubs formed a federated association to share resources.","zh":"这些小俱乐部组成了一个联合协会来共享资源。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of “federate”: to form a federation; to unite separate groups under one system.","zh":"“federate”的过去式/过去分词：使结成联邦；把不同团体联合到同一体系之下。"},"examples":[{"en":"Several communities federated to manage water and roads together.","zh":"几个社区联合起来共同管理供水和道路。"},{"en":"The regions were federated under a single constitution.","zh":"这些地区在同一部宪法下被联合起来。"}]}],"synonyms":["federal","united","allied","confederated","joined"],"phonetic":"ˈfɛdəreɪtɪd","extraExplanation":["“hederated”在英语里通常不是标准拼写。最常见的目标词是 **federated**（把开头的 h 改为 f）。如果你是在科技语境里看到的，它常指 **federated learning（联邦学习）** 或 **federated identity（联合身份认证）**：数据/账号系统分散在各处，但可以在规则下协同工作。"]}
{"word":"hederic","summary":{"en":"“Hederic” is a rare adjective meaning “related to ivy (Hedera).”","zh":"“hederic” 是一个罕见形容词，意思是“与常春藤（Hedera）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to or made from ivy (the plant genus Hedera).","zh":"（罕用）与常春藤有关的；由常春藤制成的。"},"examples":[{"en":"In older botanical writing, you may see “hederic” used to describe ivy-like growth.","zh":"在较早的植物学写作中，你可能会看到用 hederic 来形容“像常春藤一样的”生长方式。"},{"en":"The paper discussed compounds found in ivy, sometimes called hederic substances.","zh":"这篇论文讨论了常春藤中的化合物，有时会被称为 hederic 类物质。"}]}],"synonyms":["ivy","of ivy","Hedera-related"],"phonetic":"/həˈdɛrɪk/","extraExplanation":["“hederic”非常少见，多出现在植物学/化学等较旧或较专业的语境中。日常英语里通常直接说 “ivy (常春藤的)” 或用学名 “Hedera”。","词源上与拉丁语 hedera（常春藤）有关；因此它的核心含义就是“常春藤的、与常春藤相关的”。","如果你是想拼写人名（例如 Frederic/He(d)eric 等）或常见词（如 “hedonic” 享乐主义的），也可能是拼写误差；你可以告诉我上下文句子，我可以帮你确认。"]}
{"word":"hederiferous","summary":{"en":"Hederiferous means “ivy-bearing,” often used in literary descriptions of ivy-covered places.","zh":"hederiferous 意为“长常春藤的/被常春藤覆盖的”，常见于文学性的景物描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"bearing or producing ivy (having ivy growing on it)","zh":"长常春藤的；生长（或生有）常春藤的"},"examples":[{"en":"They walked past a hederiferous wall covered in dark green ivy.","zh":"他们走过一面长满深绿色常春藤的墙。"},{"en":"In the poem, the hederiferous ruins suggest age, memory, and nature reclaiming stone.","zh":"在这首诗里，长着常春藤的废墟暗示着岁月、记忆，以及自然重新占据石头。"}]}],"synonyms":["ivy-covered","ivy-clad","ivy-grown"],"phonetic":"/ˌhɛd(ə)ˈrɪfərəs/","extraExplanation":["这是一个非常少见、偏文学/描写性的词，多用于描绘“被常春藤覆盖的墙、废墟、树干”等画面。","词源：来自拉丁语 hedera（常春藤）+ -ferous（“带有/产生……的”，如 coniferous“长针叶的/松柏类的”、odoriferous“有香味的”）。"]}
{"word":"hederiform","summary":{"en":"Hederiform means “ivy-shaped,” used mainly in botanical or descriptive writing.","zh":"hederiform 意为“常春藤形的”，多用于植物学或形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Ivy-shaped; resembling the form of ivy leaves (often with lobes like an ivy leaf).","zh":"常春藤形的；形状像常春藤叶（常指有裂片、类似常春藤叶形）。"},"examples":[{"en":"The botanist noted the plant’s hederiform leaves in her field journal.","zh":"这位植物学家在野外记录本中写下这种植物有常春藤形的叶片。"},{"en":"A hederiform pattern was carved along the border of the stone plaque.","zh":"石匾的边缘雕刻着常春藤叶形的纹样。"}]}],"synonyms":["ivy-shaped","ivy-like"],"phonetic":"/həˈdɛrɪˌfɔrm/","extraExplanation":["词源上由拉丁语 hedera（常春藤）+ -form（……形状的）组成，多见于植物学、形态学或艺术装饰图案的描述中。","在学术写作里，它通常用来描述叶形（leaf shape）或装饰纹样（ornamental motif），属于较少见、偏专业的词。"]}
{"word":"hederigerent","summary":{"en":"“Hederigerent” is not a standard English word; you probably mean “belligerent,” meaning aggressive/hostile or (in politics) at war.","zh":"“hederigerent”不是标准英语词；你可能想写“belligerent”，意思是“好斗、敌对的”，或在政治语境中指“交战的/交战方”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) “belligerent”: hostile and ready to argue or fight; aggressive.","zh":"（可能想写）“belligerent”：好斗的；敌对的；动不动就争吵或打架的。"},"examples":[{"en":"He became belligerent after a few drinks.","zh":"他喝了几杯后变得很挑衅、好斗。"},{"en":"The customer grew belligerent when the store refused a refund.","zh":"店家拒绝退款后，那位顾客变得很蛮横、爱吵架。"},{"en":"Her belligerent tone made the meeting tense.","zh":"她挑衅的语气让会议气氛很紧张。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Politics / international relations) acting like an enemy in a war; relating to a country or group that is fighting.","zh":"（政治/国际关系）交战的；与交战国或交战方有关的。"},"examples":[{"en":"The two belligerent nations agreed to a temporary ceasefire.","zh":"两个交战国同意暂时停火。"},{"en":"Aid groups asked belligerent forces to allow civilians to leave safely.","zh":"援助组织要求交战部队允许平民安全撤离。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, country, or group that is fighting in a war.","zh":"交战者；交战国；交战方。"},"examples":[{"en":"Both belligerents blamed each other for breaking the truce.","zh":"双方交战方都指责对方破坏停战协议。"}]}],"synonyms":["aggressive","hostile","pugnacious","combative","warlike"],"phonetic":"/bəˈlɪdʒərənt/","extraExplanation":["“hederigerent”不是常见英语单词，词典中通常查不到。它很可能是把“belligerent”（好斗的/交战的）拼错了。","词源提示：belligerent 来自拉丁语 bellum（战争）+ gerere（进行、发动），字面意思是“发动战争的”。","用法区分：形容人的语气/态度时多表示“爱挑衅、好斗”；用于新闻或正式语境（尤其国际冲突）时常指“交战的/交战方”。"]}
{"word":"hederin","summary":{"en":"Hederin is a saponin compound found in ivy, used mainly in scientific or herbal-product contexts.","zh":"Hederin 指常春藤中的一种皂苷类化合物，主要用于科研或草本产品语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical compound (a saponin) found especially in ivy (Hedera helix), sometimes mentioned in herbal or pharmacology contexts.","zh":"常春藤（Hedera helix）等植物中发现的一种天然化合物（皂苷），常见于草药或药理学语境中。"},"examples":[{"en":"Some studies discuss hederin as one of the active compounds in ivy leaf extract.","zh":"一些研究把 hederin 作为常春藤叶提取物中的活性成分之一进行讨论。"},{"en":"The label lists hederin-related saponins among the plant ingredients.","zh":"标签在植物成分中列出了与 hederin 相关的皂苷类物质。"}]}],"synonyms":["ivy saponin","hedera saponin"],"phonetic":"/ˈhɛdərɪn/","extraExplanation":["“hederin”来自植物属名 Hedera（常春藤属）。它更多出现在科研、成分表或草本补充剂的说明里，而不是日常英语对话。","在健康与医学话题中看到该词时，通常是在谈论常春藤提取物与其成分（例如皂苷）相关的研究；具体功效与安全性需要以可靠医学来源为准。"]}
{"word":"hederose","summary":{"en":"Hederose means covered with ivy or ivy-like, and it’s a rare, literary adjective.","zh":"Hederose 指“长满常春藤的/像常春藤的”，是较罕见、偏文学化的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Covered with ivy; of or resembling ivy.","zh":"（罕见）长满常春藤的；像常春藤的。"},"examples":[{"en":"The old stone wall looked hederose in summer, hidden under thick ivy.","zh":"夏天那面老石墙看起来“hederose”，被浓密的常春藤遮住了。"},{"en":"In some poems, a “hederose” ruin suggests age, secrecy, and quiet beauty.","zh":"在一些诗歌里，“hederose”的废墟常暗示年代久远、隐秘与安静的美感。"}]}],"synonyms":["ivy-covered","ivy-clad","covered in ivy"],"phonetic":"/ˈhɛdəˌroʊz/","extraExplanation":["“hederose”是非常少见的词，多见于文学或描写性文字。它来自拉丁语 hedera（常春藤）。如果你只是想表达“长满常春藤的”，更常用的说法是 ivy-covered 或 covered in ivy。"]}
{"word":"heders","summary":{"en":"“Header(s)” most often means the top section of a page or message; it can also mean a soccer/football head shot.","zh":"“header(s)”常指页面或信息顶部的页眉/头部区域；也可指足球中的“头球”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural: headers) Text or a section at the top of a page, document, email, or website; in computing, it can also mean extra information at the top of a message or file (like an email header).","zh":"（常用复数：headers）页眉/标题栏：位于页面、文档、邮件或网页顶部的文字或区域；在计算机领域也可指信息或文件开头的“头部信息”（如邮件头）。"},"examples":[{"en":"Please put your name and date in the header.","zh":"请把你的名字和日期写在页眉里。"},{"en":"The email header shows who sent the message and when.","zh":"邮件头会显示是谁发送的，以及发送时间。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports (especially soccer/football), a shot made by hitting the ball with your head.","zh":"（体育，尤指足球）头球：用头顶球完成的射门或传球。"},"examples":[{"en":"He scored with a powerful header.","zh":"他用一个有力的头球进球了。"},{"en":"She practiced headers after training.","zh":"训练结束后她练习了头球。"}]}],"synonyms":["heading","title","page header","email header"],"phonetic":"/ˈhɛdər/","extraExplanation":["“heders”通常是“headers”的拼写错误。正确拼写：header（单数），headers（复数）。"]}
{"word":"hedge","summary":{"en":"Hedge can mean a bush boundary, or (more commonly in speech and business) a way to reduce risk or avoid making a clear commitment.","zh":"hedge既可指“树篱”，也常指“对冲/规避风险”或“说话留余地、含糊其辞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a row of bushes or small trees planted close together, often forming a boundary or fence","zh":"（常成排种植的）树篱；灌木篱笆，用作边界或围栏"},"examples":[{"en":"A tall hedge separates our yard from the neighbor’s.","zh":"一排高高的树篱把我们家的院子和邻居家隔开。"},{"en":"She trimmed the hedge every spring.","zh":"她每年春天都会修剪树篱。"}]},{"partOfSpeech":"v.","definition":{"en":"to reduce risk by balancing one risk with another; to protect yourself against possible loss (often used in finance)","zh":"（为降低风险而）对冲；采取措施规避损失（常用于金融）"},"examples":[{"en":"The company hedged against rising fuel prices by signing a long-term contract.","zh":"公司通过签长期合同来对冲燃油价格上涨的风险。"},{"en":"Investors often hedge their bets during uncertain times.","zh":"在不确定时期，投资者常常会分散/对冲风险。"}]},{"partOfSpeech":"v.","definition":{"en":"to speak or write in a cautious, non-committal way; to avoid giving a clear answer or opinion","zh":"（说话/写作时）含糊其辞；留有余地；不把话说死"},"examples":[{"en":"When asked about the plan, he hedged and said it was “still under discussion.”","zh":"被问到计划时，他含糊其辞，说“还在讨论中”。"},{"en":"Politicians sometimes hedge to avoid offending anyone.","zh":"政客有时会说得很保守，以免得罪任何人。"}]},{"partOfSpeech":"n.","definition":{"en":"a cautious statement or condition added to limit responsibility or soften a claim","zh":"（用于减轻语气或限制责任的）保留话；限定条件"},"examples":[{"en":"His promise came with a hedge: “as long as the budget allows.”","zh":"他的承诺带了个前提：“只要预算允许”。"}]}],"synonyms":["(n.) shrub fence, boundary","(v.) protect, guard against","(v.) equivocate, qualify"],"phonetic":"/hɛdʒ/","extraExplanation":["“hedge”有两个常见核心意象：①真实的“树篱”（把空间分隔开）；②比喻意义上的“留余地/挡一挡”（把风险或责任隔开一点）。因此在表达上常见：hedge your bets（不要把希望全押在一个选择上）、hedge against inflation（对冲通胀）。","“hedge”作“含糊其辞”时，语气通常偏负面，暗示不够坦率或不愿明确表态；但在正式写作或科学表达中，“hedging language”（模糊限制语）也可以是礼貌与严谨的体现，比如：It seems / likely / may suggest…（表示推测而非断言）。"]}
{"word":"hedgebe","summary":{"en":"“Hedge” most commonly means a boundary of bushes, or (as a verb) speaking indirectly or reducing risk.","zh":"“hedge”最常见意思是“树篱”，也可作动词表示“含糊其辞”或“对冲/规避风险”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A line of bushes or small trees planted closely together, often used as a boundary.","zh":"（常作边界的）树篱；灌木篱墙"},"examples":[{"en":"A tall hedge separates our yard from the neighbor’s.","zh":"一排高树篱把我们的院子和邻居家隔开。"},{"en":"She planted a hedge to give the garden more privacy.","zh":"她种了树篱，让花园更有私密性。"}]},{"partOfSpeech":"v.","definition":{"en":"To avoid making a clear promise or statement; to speak in a careful, non-committal way.","zh":"（说话）含糊其辞；避免明确表态"},"examples":[{"en":"When asked about the plan, he hedged and changed the subject.","zh":"当被问到计划时，他含糊其辞并转移了话题。"},{"en":"Politicians sometimes hedge their answers during interviews.","zh":"政治人物在采访中有时会对回答含糊其辞。"}]},{"partOfSpeech":"v.","definition":{"en":"To reduce risk by taking an action that protects you if something goes wrong (often used in finance).","zh":"（尤指金融中）对冲；规避风险"},"examples":[{"en":"The company hedged against rising prices by signing a long-term contract.","zh":"公司通过签长期合同来对冲价格上涨的风险。"},{"en":"Investors hedge to protect themselves from market changes.","zh":"投资者会进行对冲来保护自己免受市场波动影响。"}]}],"synonyms":["shrubbery","boundary","equivocate","dodge","prevaricate","protect","offset"],"phonetic":"/hɛdʒ/","extraExplanation":["你输入的“hedgebe”看起来不像常见英文单词，可能是拼写误差。最可能的目标词是“hedge”。如果你想查的是别的词（例如某个专有名词/用户名/缩写），可以把完整句子或上下文发我。","常见搭配：hedge your bets（给自己留后路/两边下注）；hedge against (risk)（对冲/防范某种风险）。","在写作与新闻中，hedge words（模糊限制词）很常见，例如: maybe, probably, seems, likely，用来让语气更谨慎。"]}
{"word":"hedgeberry","summary":{"en":"A general word for a berry growing on a hedge or hedgerow plant.","zh":"泛指树篱或篱边植物上结的浆果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small berry that grows on a hedge (a row of bushes), or a berry from a hedgerow plant (often used as a general, non-scientific name).","zh":"树篱（灌木篱笆）上结的小浆果；也可泛指篱边植物（hedgerow plants）结的果实（常为非学名的笼统说法）。"},"examples":[{"en":"In autumn, birds feed on hedgeberries along the lane.","zh":"到了秋天，小路旁的树篱浆果成了鸟儿的食物。"},{"en":"She pointed out the hedgeberry bushes near the fence, though she wasn’t sure of the exact species.","zh":"她指着篱笆旁结浆果的灌木，但不确定具体是什么品种。"}]}],"synonyms":["hedge berry","hedgerow berry","wild berry"],"phonetic":"/ˈhɛdʒˌbɛri/","extraExplanation":["“hedgeberry”在现代英语里并不算常用词，更常见的写法是两词“hedge berry”，或直接用更具体的名称（如 hawthorn berry 山楂果、blackberry 黑莓、rose hip 玫瑰果等）。","在自然描写或文学语境中，它常被用作一种“篱边野果”的意象：乡间小路、秋天、鸟类觅食、田野边界等。是否可食因植物而异，野外不要仅凭“hedgeberry”这个称呼就采食。"]}
{"word":"hedgeborn","summary":{"en":"Hedgeborn means “country-born” or “rustic,” usually in poetic writing.","zh":"hedgeborn 指“乡野出身/质朴乡村的”，多用于诗歌或文学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Born or raised among hedges or in the countryside; rustic or of humble rural origin (often poetic).","zh":"（多为诗歌用语）生于树篱之间/乡野之中；乡村的、质朴的，带有出身卑微的含义。"},"examples":[{"en":"In the poem, the hedgeborn boy knows every birdcall in the lane.","zh":"在诗里，那位“hedgeborn”的男孩熟悉小路上每一种鸟鸣。"},{"en":"She spoke with a hedgeborn plainness that felt honest and warm.","zh":"她说话带着一种乡野出身的质朴直率，让人觉得真诚又温暖。"}]}],"synonyms":["country-born","rustic","rural","homespun","peasant-born"],"phonetic":"/ˈhɛdʒˌbɔrn/","extraExplanation":["“hedgeborn”常写作带连字符的“hedge-born”，属于较少见的文学/描写性用词，用来营造乡间景象（树篱、田埂、小路）并暗示人物出身朴素。","“hedge”在英式乡村语境里常指田地边界的树篱（hedgerows），因此这个词带有很强的田园、乡土意象。"]}
{"word":"hedgebote","summary":{"en":"“Hedgebote” isn’t a standard English word; it most likely refers to a “hedgebot,” an automated tool used for hedging risk in trading.","zh":"“hedgebote”不是标准英语词；最可能指“hedgebot（对冲机器人）”，用于交易中通过对冲来降低风险的自动化工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A likely misspelling of “hedgebot”: an automated trading program (“bot”) designed to reduce risk by hedging (offsetting potential losses).","zh":"很可能是“hedgebot”的拼写错误：一种自动交易程序（机器人），通过对冲来降低风险（用相反/相关的交易抵消潜在亏损）。"},"examples":[{"en":"They used a hedgebot to hedge their crypto position during high volatility.","zh":"在高波动时期，他们用对冲机器人来对冲自己的加密货币仓位。"},{"en":"A hedgebot may place both long and short orders to limit losses.","zh":"对冲机器人可能同时下多单和空单来限制亏损。"}]},{"partOfSpeech":"other","definition":{"en":"In informal online writing, a made-up or brand-style term referring to a bot/service related to hedging or hedge funds.","zh":"在非正式网络语境中，可能是自造词或品牌名，指与对冲或对冲基金相关的机器人/服务。"},"examples":[{"en":"Ask the support team whether Hedgebote is an official tool or a third-party bot.","zh":"问一下客服：Hedgebote 是官方工具还是第三方机器人。"}]}],"synonyms":["trading bot","hedging bot","algorithmic trader"],"phonetic":"ˈhɛdʒˌbɑt","extraExplanation":["“hedgebote”不是常见英语词汇，更像是拼写错误或产品/账号名。英语里更常见的构词是 hedge（对冲/降低风险）+ bot（机器人程序）→ hedgebot。","金融语境里的 hedge 表示用另一笔交易来“抵消风险”，不等于保证盈利。使用交易机器人时，务必确认来源可信、权限设置（API key）安全，并了解其策略与风险。"]}
{"word":"hedgebreaker","summary":{"en":"Hedgebreaker usually means someone or something that breaks through a hedge, and it can also be used figuratively for a person who breaks barriers.","zh":"hedgebreaker 通常指破开树篱的人或工具，也可引申为打破障碍、开辟新路的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or tool that breaks through a hedge (a line of bushes), or more generally someone who pushes through barriers and opens a new path","zh":"（字面）破开树篱的人或工具；（引申）打破障碍、开辟新路的人"},"examples":[{"en":"The gardener used a small chainsaw as a hedgebreaker to clear the old hedge.","zh":"园丁用一把小电锯当作“破篱工具”来清理老树篱。"},{"en":"In the company, she’s a real hedgebreaker—she challenges rules that slow everyone down.","zh":"在公司里，她真是个“破篱者”——她会挑战那些拖慢大家效率的规定。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool, machine, or method used to cut or remove hedges","zh":"修剪或清除树篱的工具、机器或方法"},"examples":[{"en":"We rented a hedgebreaker to remove the overgrown shrubs along the fence.","zh":"我们租了一台清篱设备来清除围栏旁边疯长的灌木。"},{"en":"This hedgebreaker works better on thick branches than ordinary shears.","zh":"这个清篱工具处理粗枝比普通剪刀更好用。"}]}],"synonyms":["hedge cutter","hedge trimmer","brush cutter","trailblazer","pioneer","barrier-breaker"],"phonetic":"/ˈhɛdʒˌbreɪkər/","extraExplanation":["“hedgebreaker”不是最常见的标准词，更常见的说法是“hedge cutter / hedge trimmer / brush cutter”（树篱修剪机/割灌机）或“to break through a hedge”（穿过树篱）。在写作里如果想强调“开路者/破局者”的比喻意义，可以用更常见的“trailblazer / pioneer / barrier-breaker”。","拼写上也常见分开或加连字符：hedge breaker / hedge-breaker。是否连写取决于作者或出版风格。"]}
{"word":"hedged","summary":{"en":"Hedged means (1) spoke or acted cautiously to avoid a clear commitment, or (2) reduced risk (often in finance); it can also describe a cautious, non-committal statement or bet.","zh":"hedged 表示（1）说话/做事留余地、避免明确表态，或（2）进行对冲以降低风险（常见于金融）；也可形容“含糊保守的”说法或押注。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “hedge”: to avoid giving a clear answer or commitment by speaking carefully and not too directly.","zh":"“hedge”的过去式/过去分词：说话小心、含糊其辞，以避免给出明确答案或承诺。"},"examples":[{"en":"When asked if the plan would work, she hedged and said, “It depends.”","zh":"当被问到计划是否可行时，她打了个太极，说：“这要看情况。”"},{"en":"He hedged his response to avoid offending anyone.","zh":"他把回答说得很保守，以免得罪任何人。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “hedge”: to reduce risk or protect yourself against loss (often in business or finance).","zh":"“hedge”的过去式/过去分词：对冲风险；采取措施降低损失（常用于商业或金融语境）。"},"examples":[{"en":"The company hedged its fuel costs by signing long-term contracts.","zh":"公司通过签订长期合同来对冲燃油成本的风险。"},{"en":"She hedged her investment with safer assets.","zh":"她用更稳健的资产来对冲投资风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something done in a cautious, risk-reducing way; not fully committed (e.g., a hedged statement, a hedged bet).","zh":"（形容词）指谨慎、降低风险的；不完全表态的（如：含糊的说法、两边押注）。"},"examples":[{"en":"His hedged statement left room for different outcomes.","zh":"他含糊的表述为不同结果留了余地。"},{"en":"They made a hedged bet by supporting both options.","zh":"他们两边都支持，做了个“对冲式”的押注。"}]}],"synonyms":["equivocated","qualified","softened","tempered","guarded","mitigated","protected","insured"],"phonetic":"/hɛdʒd/","extraExplanation":["“hedge”最早与“树篱/篱笆”有关：用树篱把土地围起来形成保护。后来引申为“保护自己、降低风险”。在金融里常说“hedging（对冲）”，例如用期货、期权等工具来抵消价格波动带来的损失。","日常口语里，“hedge”也常指“打太极/留余地”的说法（hedged answer/statement），语气通常比直接说“不确定”更委婉、更谨慎。"]}
{"word":"hedgefund","summary":{"en":"A hedge fund is a private investment fund that uses flexible strategies to try to make profits, often aiming to manage risk and boost returns.","zh":"对冲基金是一种私募投资基金，策略较灵活，常通过管理风险并追求更高回报来获利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a private investment fund that pools money from wealthy individuals or institutions and uses a wide range of strategies (such as hedging, leverage, and short selling) to try to earn profits","zh":"对冲基金：一种私募投资基金，集合富人或机构的资金，运用多种策略（如对冲、杠杆、做空等）以争取获得收益"},"examples":[{"en":"Many hedge funds use short selling to profit when a stock price falls.","zh":"许多对冲基金会用做空来在股价下跌时获利。"},{"en":"She works as an analyst at a hedge fund in New York.","zh":"她在纽约的一家对冲基金公司做分析师。"},{"en":"During market volatility, some investors move money into hedge funds for diversification.","zh":"在市场波动时，一些投资者会把资金转到对冲基金以分散风险。"}]}],"synonyms":["private fund","investment fund","alternative investment fund","hedge fund manager (context)"],"phonetic":"/ˈhɛdʒ fʌnd/","extraExplanation":["“hedge”本义是“树篱/围栏”，动词义引申为“对冲、规避风险”。对冲基金最初强调“用一笔投资去抵消另一笔投资的风险”，但现代对冲基金不一定只做风险对冲，也可能追求更高回报并承担更高风险。","对冲基金通常面向合格投资者（如高净值个人、机构），监管与信息披露要求往往不同于面向大众的共同基金（mutual fund）。常见术语包括：leverage（杠杆）、short selling（做空）、derivatives（衍生品）。"]}
{"word":"hedgehog","summary":{"en":"A hedgehog is a small spiny mammal that protects itself by curling into a ball.","zh":"hedgehog 指“刺猬”，一种背部长刺、遇险会蜷成球自我保护的小型哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small mammal with sharp spines on its back; it often curls into a ball to protect itself","zh":"刺猬；一种背上长有尖刺的小型哺乳动物，常蜷成球来自我保护"},"examples":[{"en":"A hedgehog curled into a ball when the dog came close.","zh":"狗靠近时，刺猬蜷成了一个球。"},{"en":"We found a hedgehog in the garden at night.","zh":"我们晚上在花园里发现了一只刺猬。"},{"en":"Please drive slowly—hedgehogs sometimes cross the road after dark.","zh":"请慢点开车——刺猬有时会在天黑后过马路。"}]}],"synonyms":["(informal) hedgie","(general) spiny mammal"],"phonetic":"/ˈhɛdʒˌhɔɡ/","extraExplanation":["“hedge”指树篱，“hog”原义是猪。早期英语里这个词大致有“树篱里的小猪/像猪一样拱来拱去的小动物”的形象联想，但现代用法就是指“刺猬”。","英式文化里刺猬常被视为安静、害羞、需要保护的野生动物；在某些国家它也是常见的道路“路杀”动物，因此会有提醒司机减速的标语。","注意：北美常见的“porcupine（豪猪）”不是 hedgehog。豪猪体型更大，刺更长；而 hedgehog 的刺较短，遇到危险会蜷成球。"]}
{"word":"hedgehoggy","summary":{"en":"“Hedgehoggy” is an informal adjective meaning hedgehog-like—spiky/prickly-looking or cutely reminiscent of a hedgehog.","zh":"“hedgehoggy”是非正式形容词，表示“像刺猬的”：外观刺刺的/尖尖的，或带有可爱的“刺猬萌感”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Informal: like a hedgehog—small, prickly/spiky, or having a “hedgehog” look.","zh":"非正式用语：像刺猬一样的——小小的、刺刺的/尖刺状的，或看起来很“刺猬风”。"},"examples":[{"en":"After the rain, my hair got all hedgehoggy and stuck up in every direction.","zh":"下雨后，我的头发变得特别“刺猬风”，到处都翘起来了。"},{"en":"The cactus has a hedgehoggy texture, so don’t touch it with bare hands.","zh":"这株仙人掌摸起来很“刺猬感”，别用手直接碰。"}]},{"partOfSpeech":"adj.","definition":{"en":"Informal and affectionate: cute in a hedgehog-like way (often used online, about pets or characters).","zh":"非正式且带喜爱语气：很可爱、很有“刺猬萌感”（常见于网络，用来形容宠物或角色）。"},"examples":[{"en":"That little hedgehoggy face is impossible to resist.","zh":"那张小小的“刺猬萌脸”太让人无法抗拒了。"},{"en":"Your drawing looks so hedgehoggy—round body, tiny nose, and spiky hair!","zh":"你画得好“刺猬萌”——圆圆的身体、小小的鼻子，还有刺刺的毛！"}]}],"synonyms":["spiky","prickly","bristly","hedgehog-like","cute (informal context)"],"phonetic":"/ˈhɛdʒˌhɑɡi/","extraExplanation":["“hedgehoggy”不是很正式的词，更常见于口语、社交媒体或童书风格的表达，用来把“hedgehog（刺猬）”变成一种形容词语气。","结构上是 hedgehog + -y（像 many→rainy 那样），表示“有……特征的”。因此它既可以指“刺刺的/像刺猬一样”，也常带一点俏皮、可爱的感觉。"]}
{"word":"hedgehogs","summary":{"en":"Hedgehogs are small spiny mammals (plural of “hedgehog”).","zh":"hedgehogs 是“刺猬”的复数，指背上长刺、会蜷成球自我保护的小型哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small mammal with sharp spines on its back; it can curl into a ball for protection.","zh":"刺猬：一种背上长有硬刺的小型哺乳动物；遇到危险时会蜷成一团来自我保护。"},"examples":[{"en":"Hedgehogs are active mostly at night.","zh":"刺猬大多在夜间活动。"},{"en":"We saw a hedgehog curled up under the bush.","zh":"我们看到一只刺猬蜷在灌木下面。"},{"en":"Some people keep hedgehogs as pets, but they need special care.","zh":"有些人把刺猬当宠物养，但它们需要特别的照顾。"}]}],"synonyms":["erinaceids","spiny mammals"],"phonetic":"/ˈhɛdʒˌhɔɡz/","extraExplanation":["“hedgehogs”是“hedgehog”的复数形式：一个 hedgehog，很多 hedgehogs。","在文化与文学中，刺猬常被用来象征“自我保护、谨慎、外冷内热”。英语里还有一句常被引用的格言：The fox knows many things, but the hedgehog knows one big thing.（狐狸懂很多事，但刺猬只懂一件大事。）常用来对比“多面但分散”与“专注且深入”的思维方式。","英美语境里，人们也会提到“hedgehog dilemma（刺猬困境）”：彼此靠近会取暖，但太近又会被刺到，用来形容亲密关系中的距离感。"]}
{"word":"hedgehop","summary":{"en":"Hedgehop means to fly very low over the ground, often to avoid detection; it can also mean such a low-level flight.","zh":"hedgehop 指（飞机）超低空贴地飞行，常为躲避侦测；也可指一次这样的低空飞行。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to fly an aircraft very low over the ground, especially in order to avoid being seen (for example, by radar)","zh":"（飞机）超低空飞行（贴近地面飞行），尤指为躲避侦测（如雷达）"},"examples":[{"en":"The pilot hedgehopped over the valley to stay below the radar.","zh":"飞行员在山谷上方超低空飞行，以保持在雷达探测范围之下。"},{"en":"During training, they practiced hedgehopping at dawn.","zh":"在训练中，他们在黎明时分练习超低空飞行。"}]},{"partOfSpeech":"n.","definition":{"en":"a low-level flight made close to the ground","zh":"一次超低空飞行；贴地飞行（的动作或飞行方式）"},"examples":[{"en":"The mission required a long hedgehop across open farmland.","zh":"这次任务需要长距离穿越开阔农田的超低空飞行。"}]}],"synonyms":["fly low","low-level fly","skim (over)","nap-of-the-earth fly"],"phonetic":"/ˈhɛdʒ.hɑp/","extraExplanation":["“hedgehop”由“hedge（树篱）+ hop（跳）”构成，形象地表示飞机像“越过树篱一样一跳一跳地贴地掠过”。在军事语境中较常见，尤其用于描述低空渗透、规避目视与雷达侦测的飞行方式。","日常口语里更常用的说法是“fly low / low-level flying / nap-of-the-earth flying（贴地飞行）”；“hedgehop”带有更生动、略口语或军事报道风格的色彩。"]}
{"word":"hedgehoppe","summary":{"en":"Hedgehoppe usually refers to “hedgehopper/hedge-hop”: flying extremely low over the ground, often to avoid detection.","zh":"hedgehoppe多指“hedgehopper/hedge-hop”：贴近地面超低空飞行，常用于躲避侦察。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(likely a misspelling or variant of) **hedgehopper**: a pilot or aircraft that flies very low over the ground, often to avoid detection.","zh":"（多为拼写变体，常指）**hedgehopper**：贴近地面超低空飞行的飞行员或飞机，常用于躲避雷达/侦察。"},"examples":[{"en":"During the training exercise, the squad practiced as hedgehoppers to stay below radar.","zh":"在训练中，这支小队练习超低空飞行，以保持在雷达探测范围之下。"},{"en":"The film shows a hedgehopper skimming over fields and treetops.","zh":"电影里一架飞机掠过田野和树梢，进行超低空飞行。"}]},{"partOfSpeech":"v.","definition":{"en":"**to hedge-hop**: to fly very low over the ground, passing over hedges, trees, or obstacles.","zh":"**hedge-hop（动词）**：贴地超低空飞行，掠过树篱、树木或其他障碍物。"},"examples":[{"en":"The pilot had to hedge-hop through the valley to avoid being seen.","zh":"飞行员不得不在山谷中贴地飞行，以免被发现。"},{"en":"Small planes sometimes hedge-hop in movies, but it can be dangerous in real life.","zh":"电影里小飞机有时会贴地飞行，但在现实中可能很危险。"}]}],"synonyms":["low-level flyer","nap-of-the-earth flying","skim (over)"],"phonetic":"/ˈhɛdʒˌhɑpər/","extraExplanation":["“hedgehoppe”在现代英语里不常见，更常见的写法是 **hedgehopper**（名词）或 **hedge-hop**（动词）。","这个词带有画面感：早期在乡村地区，飞机低到仿佛“跳过（hop over）树篱（hedge）”。在军事语境中常与“低空突防、躲避雷达”相关。"]}
{"word":"hedgehopped","summary":{"en":"“Hedgehopped” means “flew very low to the ground,” especially to avoid detection; informally it can mean moving discreetly.","zh":"“Hedgehopped”主要指（飞机）超低空飞行，常带“躲避侦测”的含义；口语里也可指低调行事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense of “hedgehop”: to fly an aircraft very low to the ground (often to avoid being seen or detected).","zh":"“hedgehop”的过去式：指飞机贴近地面超低空飞行（常为躲避观察或侦测）。"},"examples":[{"en":"The pilot hedgehopped over the fields to stay below radar.","zh":"飞行员在田野上空超低空飞行，以躲避雷达侦测。"},{"en":"During the exercise, helicopters hedgehopped along the valley.","zh":"演习中，直升机沿着山谷进行超低空飞行。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense of “hedgehop” (informal): to move in a low-profile way, trying not to be noticed.","zh":"“hedgehop”的过去式（非正式）：指以低调方式行动，尽量不引人注意。"},"examples":[{"en":"He hedgehopped between jobs, keeping a low profile online.","zh":"他在不同工作间低调转换，在网上也尽量不露面。"}]}],"synonyms":["flew low","skimming the ground","nap-of-the-earth (NOE) flying","stayed under the radar"],"phonetic":"/ˈhɛdʒˌhɑpt/","extraExplanation":["“Hedgehop”原义与“hedge（树篱）+ hop（跳跃）”有关：飞机像“跳过树篱”一样贴地掠过地面障碍物，因此常用于军事/航空语境，强调“极低空飞行”。","这个词在新闻或纪实写作中偶尔出现，带有画面感；但在日常口语里不算常见，更常用的说法是“fly low”或“fly at very low altitude”。"]}
{"word":"hedgehopper","summary":{"en":"A hedgehopper is a person (often a military pilot) or an aircraft that flies extremely low over the ground to avoid detection.","zh":"hedgehopper 指（常为军机）贴地超低空飞行以躲避侦测的飞行员，也可引申指进行这种飞行的飞机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially British English) A person—often a military pilot—who flies an aircraft very low over the ground, skimming over fields and hedges; by extension, an aircraft used for very low-level flying.","zh":"（尤指英式英语）“低空掠地飞行”的人（常指军机飞行员）；引申也可指用于超低空飞行的飞机。"},"examples":[{"en":"During the war, hedgehoppers flew below radar to avoid detection.","zh":"战争期间，低空掠地飞行的飞行员会飞到雷达探测不到的高度，以躲避侦测。"},{"en":"The training program focused on hedgehopper tactics for low-level navigation.","zh":"训练项目重点讲解了低空掠地飞行的战术与低空导航。"}]}],"synonyms":["low-level flyer","nap-of-the-earth flyer","terrain-hugging pilot"],"phonetic":"/ˈhɛdʒˌhɑpɚ/","extraExplanation":["这个词由 hedge（树篱）+ hopper（跳跃者）组成，画面感很强：飞机“像跳过树篱一样”贴地掠过乡间地貌。在二战及之后的军事语境中更常见，强调“超低空飞行以躲避雷达/防空火力”。在日常英语中并不常用，更多见于军事题材、回忆录或新闻报道。"]}
{"word":"hedgehopping","summary":{"en":"Hedgehopping means flying extremely low (often military) to use terrain as cover; it can also mean moving in quick low bursts, sometimes figuratively.","zh":"Hedgehopping 指（多为军用）超低空贴地飞行以借地形掩护；也可泛指以短促贴地的方式移动，偶尔用于比喻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of flying (especially military aircraft) very low to the ground, often in short bursts, using hedges, trees, and hills as cover","zh":"（尤指军机的）超低空贴地飞行战术，常以短距离快速掠过的方式进行，利用树篱、树木和地形作掩护"},"examples":[{"en":"The pilots practiced hedgehopping to avoid enemy radar and gunfire.","zh":"飞行员练习超低空贴地飞行，以躲避敌方雷达和火力。"},{"en":"Hedgehopping was risky because a small mistake could cause a crash.","zh":"超低空贴地飞行风险很高，因为一点失误就可能坠毁。"}]},{"partOfSpeech":"v.","definition":{"en":"to travel or move very close to the ground in quick, low jumps or bursts (literally or figuratively)","zh":"（字面或比喻）贴近地面、以快速短促的“跳跃/掠过”方式移动"},"examples":[{"en":"The helicopter hedgehopped along the valley to stay hidden.","zh":"直升机沿着山谷贴地飞行以保持隐蔽。"},{"en":"In his career he kept hedgehopping from one short-term job to another.","zh":"在职业上，他不断在一个个短期工作之间“跳来跳去”。"}]}],"synonyms":["nap-of-the-earth flying","NOE flying","low-level flying","terrain masking"],"phonetic":"/ˈhɛdʒˌhɑpɪŋ/","extraExplanation":["“hedgehopping”常见于军事航空语境，尤其与二战时期及其后的一些低空突防/隐蔽飞行战术相关。它强调“贴地、短促、利用地物遮蔽”的感觉，不是标准日常词汇，更多出现在军事史、航空回忆录、报道或小说描写中。"]}
{"word":"hedgehops","summary":{"en":"“Hedgehops” is a playful, nonstandard word meaning a hedgehog’s little hops; it’s also commonly a misspelling of “hedgehogs.”","zh":"“hedgehops”多为俏皮的非标准用法，指刺猬的小跳跃；也常被用作“hedgehogs（刺猬）”的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal, playful; not a standard dictionary word) hops or little jumps made by a hedgehog; sometimes used as a cute made-up plural.","zh":"（非正式、俏皮用法；非标准词）刺猬的跳跃/小跳步；有时作为可爱自造词的复数使用。"},"examples":[{"en":"The video shows tiny hedgehops across the blanket.","zh":"视频里刺猬在毯子上小跳来小跳去。"},{"en":"I drew a comic full of hedgehops and giggles.","zh":"我画了一部漫画，满是刺猬的小跳步和咯咯笑。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “hedgehogs” (the animals).","zh":"常见为“hedgehogs”（刺猬复数）的拼写错误。"},"examples":[{"en":"If you mean the animals, the correct spelling is “hedgehogs.”","zh":"如果你指的是动物，正确拼写是“hedgehogs”。"},{"en":"Hedgehogs roll into a ball when they feel threatened.","zh":"刺猬感到受威胁时会蜷成一个球。"}]}],"synonyms":["hedgehog hops","hedgehog jumps","hopping (by a hedgehog)"],"phonetic":"ˈhɛdʒ.hɑps","extraExplanation":["“hedgehops”不是常见标准英语词，更像是把“hedgehog（刺猬）”和“hops（跳跃）”拼在一起的可爱自造词，用在儿童故事、社交媒体配文、宠物视频标题里很自然。","如果你是在写作或作业中使用，通常建议改为“hedgehogs”（刺猬）或用更清楚的表达：“a hedgehog hopping/jumping”（一只刺猬在跳）。"]}
{"word":"hedgeless","summary":{"en":"Hedgeless means “without hedges,” and more rarely can mean “without hedging; very direct.”","zh":"hedgeless 意为“没有树篱的”，较少见时可指“说话不留余地、很直接的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without hedges (rows of bushes) around a garden, field, or property; open and not bordered by hedges.","zh":"没有树篱（成排灌木篱笆）的；没有用树篱围住的；敞开的。"},"examples":[{"en":"The house sits on a hedgeless lot, so you can see straight into the yard.","zh":"这栋房子在一块没有树篱的地块上，所以可以直接看到院子里。"},{"en":"In hedgeless fields, the wind can move across the land more freely.","zh":"在没有树篱的田地里，风能更自由地穿过土地。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, less common) Without “hedging” or softening; stated in a direct, unqualified way.","zh":"（引申义，较少见）不拐弯抹角的；不加保留或缓和的；直截了当的。"},"examples":[{"en":"Her hedgeless answer surprised everyone: “No, I won’t do it.”","zh":"她直截了当的回答让大家都很惊讶：“不，我不做。”"},{"en":"He gave a hedgeless warning about the risks.","zh":"他对风险提出了毫不含糊的警告。"}]}],"synonyms":["unhedged","open","unbounded","direct","unqualified"],"phonetic":"/ˈhɛdʒləs/","extraExplanation":["“Hedgeless”主要是字面意义：hedge（树篱）+ -less（没有）。在英式乡村语境里，树篱常用来分隔田地、挡风、保护生物多样性；因此“hedgeless fields”会让人联想到更开阔但也更暴露于风和侵蚀的景观。","引申义来自动词“to hedge”（说话留余地、模棱两可），但“hedgeless”用于这个比喻时不算常见；更常见的表达是 “direct / unqualified / without hedging”。"]}
{"word":"hedgemaker","summary":{"en":"A hedgemaker is someone who makes or maintains hedges.","zh":"hedgemaker 指制作或维护树篱的人（树篱匠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to plant, shape, or repair hedges (rows of bushes or small trees used as boundaries), especially in the countryside","zh":"树篱匠；修剪或修复树篱的人（尤其指乡村里以树篱作界线的地区）"},"examples":[{"en":"The hedgemaker repaired the old boundary hedge after the storm.","zh":"暴风雨过后，树篱匠修复了老旧的界篱。"},{"en":"In spring, a hedgemaker may trim hedges to keep them neat and healthy.","zh":"在春天，树篱匠可能会修剪树篱，使其整齐并保持健康。"}]}],"synonyms":["hedger","hedge builder","hedge layer","hedge trimmer"],"phonetic":"/ˈhɛdʒˌmeɪkər/","extraExplanation":["“Hedgemaker”在英式英语语境里更常见，常与乡村景观、农田边界有关；传统工艺里还有“hedge laying（铺篱/编篱）”，把枝条部分切开后压弯并编织，让树篱更密、更能当作围栏。"]}
{"word":"hedgemaking","summary":{"en":"Hedgemaking is the work or skill of creating and maintaining hedges, especially in the countryside.","zh":"Hedgemaking 指制作并维护树篱的工作或技艺，尤见于乡村环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or craft of planting, building, or repairing hedges (rows of shrubs or small trees), especially in the countryside","zh":"（尤指乡村的）树篱制作/修整工作；指栽种、搭建或修补树篱这一活动或技艺"},"examples":[{"en":"Hedgemaking is a traditional skill in many parts of rural England.","zh":"树篱制作在英格兰许多乡村地区是一项传统技能。"},{"en":"The farm hired a local worker for winter hedgemaking and fence repairs.","zh":"农场雇了当地工人来做冬季的树篱修整和篱笆维修。"},{"en":"Good hedgemaking helps protect fields from wind and gives wildlife a habitat.","zh":"良好的树篱制作既能挡风保护田地，也能为野生动物提供栖息地。"}]}],"synonyms":["hedge building","hedge maintenance","hedge laying (related)","hedging (less specific)"],"phonetic":"/ˈhɛdʒˌmeɪkɪŋ/","extraExplanation":["“hedgemaking”在英式英语里更常见，常指传统乡村管理（countryside management）的一部分；在一些地区会用更具体的说法，如“hedge laying”（把树篱枝干半切后压倒编织，使其更密更结实）。","树篱不仅用于分隔土地、挡风、防止土壤流失，也与生态保护相关：成熟树篱能为鸟类、昆虫和小型哺乳动物提供食物与庇护。"]}
{"word":"hedgepig","summary":{"en":"Hedgepig is a dialect/old-fashioned word for a hedgehog.","zh":"hedgepig 是“刺猬（hedgehog）”的方言/较旧说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly British, dialect/old-fashioned) A hedgehog; a small spiny mammal that curls into a ball for protection.","zh":"（主要为英式方言/较旧用法）刺猬；一种身上长刺、遇到危险会蜷成球自我保护的小型哺乳动物。"},"examples":[{"en":"In the garden we spotted a hedgepig snuffling under the leaves.","zh":"在花园里，我们看见一只刺猬在落叶下嗅来嗅去。"},{"en":"The children were told not to touch the hedgepig because its spines are sharp.","zh":"大人告诉孩子们别去摸那只刺猬，因为它的刺很尖。"}]}],"synonyms":["hedgehog"],"phonetic":"/ˈhɛdʒˌpɪɡ/","extraExplanation":["“hedgepig”字面是“篱笆猪”，形象地指刺猬在树篱/灌木丛附近活动、又会拱来拱去的样子。现代英语里更常用的标准词是“hedgehog”，因此“hedgepig”多见于英国部分地区的口语、方言或较老的文本中。"]}
{"word":"hedgepigs","summary":{"en":"“Hedgepigs” is an informal (mainly British) plural word meaning hedgehogs.","zh":"“hedgepigs”是（主要英式）口语复数，意思是“刺猬（hedgehogs）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, mainly British) A hedgehog; a small nocturnal mammal with spines.","zh":"（非正式，主要英式用法）刺猬；一种夜行、背上有刺的小型哺乳动物。"},"examples":[{"en":"We saw two hedgepigs shuffling through the garden at dusk.","zh":"黄昏时我们看到两只“hedgepigs”（刺猬）拖着步子穿过花园。"},{"en":"Please drive slowly—hedgepigs often cross the road at night.","zh":"请慢点开车——刺猬晚上常常会横穿马路。"}]}],"synonyms":["hedgehogs","hedgehog"],"phonetic":"/ˈhɛdʒˌpɪɡ/","extraExplanation":["“hedgepig”不是标准学术用词，更常见的标准词是“hedgehog”。“hedgepig/hedgepigs”多带有口语、亲昵称呼的感觉，常见于英国一些地区或儿童语言中。","这个词字面上像“住在树篱（hedge）里的小猪（pig）”，形象地描写刺猬圆滚滚、在灌木篱边活动的样子。"]}
{"word":"hedger","summary":{"en":"A hedger is someone who reduces risk (especially in finance) or someone who speaks cautiously to avoid strong commitments.","zh":"hedger 指进行对冲以降低风险的人/机构（尤指金融），也可指说话谨慎、避免明确表态的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or organization that hedges (reduces risk) by using a “hedge,” such as buying insurance or using financial instruments (options, futures, etc.).","zh":"进行“对冲”的人或机构：通过购买保险或使用金融工具（如期权、期货等）来降低风险。"},"examples":[{"en":"Airlines are major hedgers because they hedge fuel prices to control costs.","zh":"航空公司是重要的对冲者，因为它们会对冲燃油价格来控制成本。"},{"en":"The company acted as a hedger, not a speculator, by locking in an exchange rate.","zh":"这家公司作为对冲者而非投机者，通过锁定汇率来降低风险。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who speaks or writes in a cautious, non-committal way (someone who “hedges” their statements).","zh":"说话或写作时措辞谨慎、避免明确表态的人（在表达上“打圆场/留余地”的人）。"},"examples":[{"en":"As a careful hedger, he said the plan would “probably” work rather than promising success.","zh":"他是个谨慎的“留余地者”，说这个计划“可能”行得通，而不是保证一定成功。"},{"en":"In interviews, she’s a hedger who often uses words like “maybe” and “it depends.”","zh":"在采访中她常常用“也许”“要看情况”等词，是个说法很保守的人。"}]}],"synonyms":["risk manager","risk reducer","risk-hedging trader","cautious speaker"],"phonetic":"/ˈhɛdʒɚ/","extraExplanation":["在金融语境里，hedger 通常与 speculator（投机者）相对：hedger 的目标是降低已有风险（例如企业未来要买油、要换汇），而 speculator 是主动承担风险以追求利润。","日常语言里的 “hedge” 常指用 may/might/probably/it seems 等词弱化语气，因此 hedger 也可指说话“比较不把话说死”的人。"]}
{"word":"hedgerow","summary":{"en":"A hedgerow is a line of bushes or small trees that forms a boundary, especially in the countryside.","zh":"hedgerow 指乡间常见的一长排灌木或小树形成的树篱，用来分界、挡风并提供遮蔽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A line of bushes or small trees, often planted along the edge of fields or roads to mark boundaries and provide shelter.","zh":"（常沿田地或道路边种植的）树篱；篱墙（由灌木或小树组成，用于分界并提供遮蔽）"},"examples":[{"en":"The narrow lane was bordered by tall hedgerows.","zh":"这条狭窄的小路两旁是高高的树篱。"},{"en":"Birds and insects live in the hedgerow, so farmers try not to remove it.","zh":"许多鸟类和昆虫栖息在树篱里，所以农民尽量不把它清除。"},{"en":"We picked blackberries growing along the hedgerow.","zh":"我们采了长在树篱旁的黑莓。"}]}],"synonyms":["hedge","thorn hedge","living fence"],"phonetic":"/ˈhɛdʒˌroʊ/","extraExplanation":["“Hedgerow”在英国乡村文化中很常见，传统上用于分隔农田、挡风、防止牲畜走失，也为野生动物提供栖息地。英国文学里常把它当作“乡间边界”“田园风景”的意象。","第二次世界大战期间英国有“挖掉树篱”（hedgerow removal）的历史：为了扩大农田、便于机械化耕作，一些树篱被移除；后来也出现了保护与恢复树篱以提升生物多样性的行动。","相关词：hedge（树篱；也可作动词“回避/模棱两可”），但hedgerow通常更强调“长长一排”的乡间树篱。"]}
{"word":"hedgerows","summary":{"en":"Hedgerows are rows of shrubs (often with trees) that form boundaries in the countryside and often serve as important wildlife habitat.","zh":"hedgerows 指乡间成排的灌木（常夹杂小树）形成的树篱，用于界线分隔，也常作为野生动物的重要栖息地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A line of shrubs (sometimes with small trees) planted and kept trimmed to form a boundary between fields, roads, or properties.","zh":"（常与小树混生的）树篱；由灌木（或灌木与小树）种成并修剪成界线，用来分隔田地、道路或地块。"},"examples":[{"en":"The farmers planted hedgerows to separate their fields.","zh":"农民种植树篱来分隔田地。"},{"en":"We walked along a narrow lane bordered by thick hedgerows.","zh":"我们沿着一条两旁长满浓密树篱的窄路散步。"}]},{"partOfSpeech":"n.","definition":{"en":"Areas of hedges as a habitat; the shrubs and trees along field edges that shelter wildlife.","zh":"（生态语境）树篱带；田地边缘的灌木与小树形成的栖息地，为野生动物提供庇护。"},"examples":[{"en":"Hedgerows provide food and shelter for birds and insects.","zh":"树篱为鸟类和昆虫提供食物与庇护。"},{"en":"Removing hedgerows can reduce biodiversity in the countryside.","zh":"清除树篱可能会降低乡村的生物多样性。"}]}],"synonyms":["hedges","shrub borders","living fence","field boundaries"],"phonetic":"/ˈhɛdʒˌroʊz/","extraExplanation":["“hedgerows”是复数形式，单数是“hedgerow”。在英式乡村景观里很常见（比如英国、爱尔兰），常被写进文学作品作为“田园/乡野边界”的意象。","历史上树篱不仅用于划界，也能防风、减少土壤流失，并在没有围栏的年代帮助拦住牲畜。现代环保讨论中，树篱常与“生态廊道（wildlife corridor）”等概念相关。","易混词：hedge（树篱/篱笆；也可作动词“回避直说、模棱两可”）与 bush（灌木）不同；hedgerow强调“成排形成边界”的整体。"]}
{"word":"hedgers","summary":{"en":"“Hedgers” usually means people or organizations that hedge risk (finance), and can also mean people who speak cautiously or who trim hedges.","zh":"“hedgers”通常指进行对冲以降低风险的人/机构（金融），也可指说话谨慎含糊的人，或修剪树篱的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or companies that reduce risk by protecting against possible losses (especially in finance, prices, or currency changes).","zh":"（尤指金融中）通过对冲来降低风险、避免可能损失的人或机构。"},"examples":[{"en":"Airlines are major hedgers because fuel prices can change quickly.","zh":"航空公司是主要的对冲者，因为燃油价格可能快速波动。"},{"en":"Farmers may use futures contracts as hedgers to lock in a selling price.","zh":"农民可能用期货合约进行对冲，以锁定销售价格。"}]},{"partOfSpeech":"n.","definition":{"en":"People who avoid a clear or firm statement, often by using careful or uncertain language.","zh":"说话不愿明确表态、常用含糊或保留措辞的人。"},"examples":[{"en":"In interviews, some hedgers say things like “maybe” or “it depends” to stay safe.","zh":"在采访中，有些人会用“也许”或“要看情况”等话来避免表态。"},{"en":"The manager sounded like a hedger, not promising a deadline.","zh":"这位经理听起来在打太极，并没有承诺截止日期。"}]},{"partOfSpeech":"n.","definition":{"en":"People who cut or maintain hedges (rows of bushes used as boundaries).","zh":"修剪或维护树篱（用作边界的灌木丛）的人。"},"examples":[{"en":"The hedgers trimmed the bushes along the garden path.","zh":"修篱工沿着花园小路修剪灌木。"}]}],"synonyms":["risk hedgers","hedge fund participants","risk managers","equivocators","fence-sitters"],"phonetic":"/ˈhɛdʒər/","extraExplanation":["“hedger”来自动词 hedge（原义与“树篱/围篱”有关），后来引申出“把风险围住、隔开”的意思，所以金融里的 hedge/hedging 指用另一笔交易来抵消潜在损失。","在日常英语里，to hedge / hedging 也常指“说话留余地、不给肯定答案”，例如：I’m not sure—it might work. 这种表达在礼貌、谨慎的语境中很常见。"]}
{"word":"hedges","summary":{"en":"“Hedges” can mean rows of bushes used as boundaries, or (in finance) risk-reducing protections; as a verb, it means to reduce risk or to avoid being too direct.","zh":"“hedges”可指作为边界的绿篱/树篱，也可指（金融中的）对冲、降低风险的措施；作动词时表示降低风险或说话含糊不直接。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hedge”: a row of bushes or small trees planted to form a boundary or fence.","zh":"“hedge”的复数：一排灌木或小树，种来作为边界或篱笆。"},"examples":[{"en":"A tall line of hedges separates our yard from the street.","zh":"一排高高的绿篱把我们的院子和街道隔开。"},{"en":"The rabbit ran along the hedges and disappeared.","zh":"兔子沿着绿篱跑，很快就不见了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Business/finance) Plural of “hedge”: actions or investments used to reduce risk (for example, protecting against price changes).","zh":"（商业/金融）“hedge”的复数：用于降低风险的措施或投资（例如对冲价格波动）。"},"examples":[{"en":"The company used hedges to protect against rising fuel costs.","zh":"公司用对冲措施来防止燃油成本上涨。"},{"en":"Farmers sometimes use hedges to manage price uncertainty.","zh":"农民有时会用对冲来应对价格不确定性。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “hedge”: to protect yourself by taking a safer position or by reducing risk.","zh":"“hedge”的第三人称单数：通过采取更稳妥的做法来保护自己、降低风险。"},"examples":[{"en":"She hedges her bets by applying to several schools.","zh":"她同时申请好几所学校来分散风险。"},{"en":"The airline hedges against oil price changes.","zh":"这家航空公司对冲油价变化带来的风险。"}]},{"partOfSpeech":"v.","definition":{"en":"To avoid giving a clear answer; to speak in a cautious, non-committal way.","zh":"（说话）含糊其辞；用谨慎、不给出明确承诺的方式表达。"},"examples":[{"en":"When asked about the budget cuts, he hedges and changes the subject.","zh":"当被问到预算削减时，他含糊其辞并转移话题。"},{"en":"The report hedges, saying the results are “likely” but not certain.","zh":"报告措辞保守，说结果“可能”如此但并不确定。"}]}],"synonyms":["bushes","shrubs","barriers","fences","risk protections","safeguards","insures (against)","qualifies","equivocates"],"phonetic":"/ˈhɛdʒɪz/","extraExplanation":["“hedge”本义是“树篱/绿篱”，引申出“把自己围起来以求安全”的感觉，所以在金融里指“对冲、降低风险”。","在学术写作和礼貌表达中，hedging language（模糊限制语）很常见：用 might, may, likely, seems, in general 等词让语气更谨慎，避免把话说得太绝对。","常见搭配：hedge your bets（分散风险）；hedge against (something)（防范/对冲某种风险）。"]}
{"word":"hedgesmith","summary":{"en":"Hedgesmith is a rare word that can mean a person who trims and shapes hedges, and it is also used as a surname.","zh":"Hedgesmith 是个较少见的词，可指修剪并造型树篱的人，也可用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A person whose job is to trim, shape, or maintain hedges (bushes used as borders).","zh":"（罕见）以修剪、造型或维护树篱（常作边界的灌木）为工作的人。"},"examples":[{"en":"The estate hired a hedgesmith to keep the garden borders neat.","zh":"庄园雇了一位“hedgesmith”来把花园边界的树篱修得整齐。"},{"en":"A skilled hedgesmith can shape hedges into arches and animals.","zh":"技术娴熟的“hedgesmith”能把树篱修剪成拱门和动物造型。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"姓氏（家族名）。"},"examples":[{"en":"Ms. Hedgesmith will lead today’s meeting.","zh":"Hedgesmith 女士将主持今天的会议。"}]}],"synonyms":["gardener","groundskeeper","landscaper","hedge trimmer"],"phonetic":"ˈhɛdʒˌsmɪθ","extraExplanation":["“Hedgesmith”不是常见词，更常见的说法是 gardener（园丁）、groundskeeper（园艺/场地维护人员）或 hedge trimmer（修剪树篱的人/工具）。作为职业名词，“-smith”有“工匠、专门做某类工作的人”的感觉（如 blacksmith 铁匠、wordsmith 文字匠），因此 hedgesmith 听起来像是把树篱当作“手艺”来经营的人。"]}
{"word":"hedgetaper","summary":{"en":"Hedgetaper is a rare word meaning a person (or sometimes a tool) that trims hedges into a tapered shape.","zh":"Hedgetaper 是个少见词，指把树篱修成上窄下宽锥形的人（有时也指用于修出这种形状的工具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who trims hedges, especially shaping them so they become narrower toward the top (tapered)","zh":"修剪树篱的人；尤指把树篱修成“上窄下宽”的锥形（渐细）的人"},"examples":[{"en":"The gardener worked as a hedgetaper, keeping the boxwood hedges neat and slightly narrower at the top.","zh":"那位园丁做树篱修剪工，把黄杨树篱修得整齐，而且顶部略窄。"},{"en":"A good hedgetaper knows that a tapered shape helps sunlight reach the lower leaves.","zh":"好的树篱修剪工知道，修成上窄下宽能让阳光照到下层叶子。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a tool or attachment used to create a tapered profile when trimming hedges","zh":"（少见）用于把树篱修出“渐细/锥形”轮廓的工具或配件"},"examples":[{"en":"He bought a hedgetaper guide to help keep the sides even.","zh":"他买了一个树篱“渐细”导向器来帮助把两侧修齐。"}]}],"synonyms":["hedge trimmer","gardener","hedge cutter"],"phonetic":"/ˈhɛdʒˌteɪpɚ/","extraExplanation":["“hedgetaper”并不是很常见的标准词；在日常英语里，更常用的是 **hedge trimmer**（树篱修剪机/修剪器）或 **hedge cutter**。如果你是在说明工作岗位，也可以说 **hedge trimmer (worker)** 或 **gardener**。","“taper”表示“逐渐变窄”。园艺里常把树篱修成“上窄下宽”（tapered）的形状，这样下方叶片也能得到阳光，不容易变稀疏。"]}
{"word":"hedgeweed","summary":{"en":"Hedgeweed is a general word for unwanted plants growing around hedges or fences.","zh":"Hedgeweed 泛指长在树篱或篱笆附近的杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a weedy plant that grows in or around hedges and fence lines; a general, non-technical name for various unwanted plants in such places","zh":"（长在树篱、篱笆或田埂附近的）杂草；一个非严格植物学术语，泛指那类“篱边杂草”"},"examples":[{"en":"The gardener pulled out the hedgeweed before it spread into the flower bed.","zh":"园丁把篱边的杂草拔掉，免得蔓延到花坛里。"},{"en":"Hedgeweed can make narrow paths feel overgrown and messy.","zh":"篱边杂草会让狭窄的小路显得杂乱、长得太密。"}]}],"synonyms":["weed","wild plant","nuisance plant"],"phonetic":"/ˈhɛdʒˌwiːd/","extraExplanation":["“hedgeweed”多用于日常表达，通常不指某一种固定植物；不同地区的人可能用它称呼不同的野草（例如长在篱笆边、沟渠边的攀附或蔓生杂草）。如果需要准确识别，建议用具体植物名或拍照请人辨认。"]}
{"word":"hedgewise","summary":{"en":"“Hedgewise” means doing or speaking in a hedging, risk-reducing, non-absolute way.","zh":"“hedgewise”指以对冲或措辞留余地的方式行事/表达，避免过于绝对并降低风险。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a hedging way; using hedges (careful wording or actions that reduce risk or commitment)","zh":"以“对冲/留余地”的方式；通过使用模糊措辞或分散风险来降低承诺或风险"},"examples":[{"en":"Politicians often speak hedgewise to avoid making promises they can’t keep.","zh":"政客常常用“留余地”的方式说话，以避免做出无法兑现的承诺。"},{"en":"We should invest hedgewise: diversify instead of betting everything on one stock.","zh":"我们应该以“对冲”的思路投资：分散配置，而不是把全部押在一只股票上。"},{"en":"He answered hedgewise, saying the plan was “possible” but not “certain.”","zh":"他回答得很谨慎，说这个计划“有可能”，但“不确定”。"}]}],"synonyms":["cautiously","guardedly","noncommittally","evasively","prudently"],"phonetic":"/ˈhɛdʒˌwaɪz/","extraExplanation":["“hedgewise”不是高频标准词，更常见的表达是“hedging”或“in a hedging way”。它由 hedge（对冲；话语留余地）+ -wise（以……方式）构成，含义类似于“谨慎地/留退路地”。","在金融语境里，hedge 指用另一项投资来抵消风险（对冲）；在语言语境里，hedge 指用 maybe、probably、it seems 等词让说法不那么绝对。"]}
{"word":"hedgewood","summary":{"en":"Hedgewood means wood cut from hedges/hedgerows, often used as brushwood or firewood; it can also describe something made from such wood.","zh":"Hedgewood 指从树篱/篱边灌木砍下来的枝木（常作柴火或杂木），也可形容“由树篱木制成的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wood (timber or firewood) cut from hedges or hedgerows; brushwood from boundary shrubs.","zh":"从树篱/篱笆灌木（hedge/hedgerow）砍下来的木材；用于柴火或小型用途的篱边灌木枝木。"},"examples":[{"en":"In winter, the farm used hedgewood for the stove.","zh":"冬天农场会用篱边灌木的枝木当柴烧炉子。"},{"en":"They cleared old hedgewood to repair the fence line.","zh":"他们清理了老树篱的枝木来修整篱笆线。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) relating to or made from wood taken from hedges or hedgerows.","zh":"（较少见）与树篱木有关的；由树篱木制成的。"},"examples":[{"en":"The craftsman used a hedgewood handle for the tool.","zh":"工匠给工具做了一个树篱木手柄。"}]}],"synonyms":["hedge wood","brushwood","hedgerow timber","firewood"],"phonetic":"/ˈhɛdʒˌwʊd/","extraExplanation":["“hedgewood”不是特别常见的标准词，更常见的写法是分开写成“hedge wood”，或用更具体的词如“hedgerow timber / brushwood”。在一些语境里它也可能是姓氏或地名的一部分，需要结合上下文判断。"]}
{"word":"hedgier","summary":{"en":"“Hedgier” means either more indirect/cautious in speech (less committal) or, less commonly, having more hedges/bushy growth.","zh":"“hedgier”表示（更常见）说话更谨慎含糊、不明确表态；（较少见）树篱更多、更灌木丛生。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of “hedgy”) more cautious or indirect in what you say, often to avoid giving a clear commitment or opinion.","zh":"（“hedgy”的比较级）说话更谨慎、更含糊其辞，常用来避免明确表态或承担责任。"},"examples":[{"en":"After the backlash online, the company’s statement became hedgier and avoided specific promises.","zh":"在网上遭到反弹后，这家公司的声明变得更含糊，避免做出具体承诺。"},{"en":"When I asked if he would quit, he gave a hedgier answer: “We’ll see.”","zh":"我问他会不会辞职时，他给了更模糊的回答：“再看看吧。”"}]},{"partOfSpeech":"adj.","definition":{"en":"(Comparative of “hedgy”) having more hedges; bushier or more covered with hedge-like plants.","zh":"（“hedgy”的比较级）树篱更多的；更像树篱的；更灌木丛生的。"},"examples":[{"en":"This side of the garden is hedgier, so it feels more private.","zh":"花园这一侧树篱更多，所以感觉更私密。"},{"en":"We chose the hedgier path to stay out of the wind.","zh":"我们选了树篱更密的那条路来避风。"}]}],"synonyms":["more evasive","more guarded","more noncommittal","less direct","more cautious"],"phonetic":"ˈhɛdʒiər","extraExplanation":["“hedgier”来自“hedge”的引申用法：hedge 原意是“树篱”，也可作动词表示“用模糊/保留的说法来回避风险”，因此形容人或语言“hedgy/hedgier”常带有“不给明确答案、留后路”的语气。","常见近义表达：more evasive（更回避的）, more guarded（更谨慎保留的）, more noncommittal（更不表态的）。注意：在商业、公关或政治语境里更常见第一种含义（说话更含糊）。"]}
{"word":"hedgiest","summary":{"en":"“Hedgiest” means “most hedgy”: either having the most hedges (bushes) or, informally, being the most cautious/evasive in wording.","zh":"“Hedgiest”表示“最hedgy的”：要么指树篱最多/最被树篱围绕；要么（非正式）指措辞最谨慎、最含糊、最不表态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of \"hedgy\") having the most hedges; most surrounded by or full of hedges (bushes).","zh":"（“hedgy”的最高级）树篱最多的；被树篱围绕得最密的；最有树篱的。"},"examples":[{"en":"Their cottage garden is the hedgiest one on the street.","zh":"他们的小屋花园是这条街上树篱最多的一家。"},{"en":"We took the hedgiest lane because it felt quiet and private.","zh":"我们走了树篱最茂密的小路，因为感觉安静又私密。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) most cautious or non-committal in speech; most like “hedging” (avoiding a clear yes/no).","zh":"（非正式）说法最谨慎、最不表态的；最像“hedge（含糊其辞、留余地）”的。"},"examples":[{"en":"His answer was the hedgiest: “It depends.”","zh":"他的回答最含糊：“要看情况。”"},{"en":"She gave a hedgiest response to avoid promising too much.","zh":"她用最谨慎的说法来避免承诺过多。"}]}],"synonyms":["most hedged","most evasive","most noncommittal","most cautious","bushiest"],"phonetic":"/ˈhɛdʒiəst/","extraExplanation":["“hedgiest”是形容词“hedgy”的最高级形式，拼写规则是：以辅音字母+y结尾时，变为-iest（hedgy → hedgiest）。","日常口语里，表达“最含糊/最留余地的说法”更常用：most evasive / most noncommittal / the most hedged。"]}
{"word":"hedging","summary":{"en":"Hedging means reducing risk (often in finance) or using cautious, less direct language to avoid strong commitment.","zh":"Hedging 指（常见于金融中的）对冲/降低风险，也指用更谨慎、更不直接的措辞来避免过度承诺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of reducing risk or protecting yourself from possible losses (especially in finance or business)","zh":"（尤指金融或商业中）对冲；用来降低风险、避免可能损失的做法"},"examples":[{"en":"The company uses currency hedging to reduce the impact of exchange-rate changes.","zh":"这家公司用外汇对冲来降低汇率波动的影响。"},{"en":"Hedging can protect investors during unstable markets.","zh":"在市场不稳定时，对冲可以保护投资者。"}]},{"partOfSpeech":"n.","definition":{"en":"language that is intentionally less direct or less certain, used to avoid strong commitment or to sound polite","zh":"（语言上的）模糊表达；用不那么肯定/不那么直接的说法来避免承担过强承诺或显得更委婉"},"examples":[{"en":"His answer was full of hedging, so I still didn’t know what he really thought.","zh":"他的回答充满了模糊措辞，所以我还是不知道他真实想法。"},{"en":"In academic writing, some hedging is common (e.g., “might,” “suggests,” “possibly”).","zh":"在学术写作中，适度的模糊表达很常见（如 might、suggests、possibly）。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity of trimming or growing hedges (rows of bushes used as a boundary)","zh":"修剪或种植树篱（用作边界的一排灌木）的活动"},"examples":[{"en":"Weekend hedging kept the garden looking neat.","zh":"周末修剪树篱让花园看起来很整洁。"}]},{"partOfSpeech":"v.","definition":{"en":"reducing risk or avoiding a clear position by taking careful, partly protective actions; the present participle/gerund of “hedge”","zh":"（动词 hedge 的现在分词/动名词）采取防护性的做法以降低风险，或用谨慎方式避免表态过明确"},"examples":[{"en":"She’s hedging by applying to several schools instead of just one.","zh":"她通过申请多所学校来分散风险，而不是只申请一所。"},{"en":"They kept hedging their statements to avoid being quoted incorrectly.","zh":"他们不断用模糊措辞来避免被错误引用。"}]}],"synonyms":["risk management","protection","cautious wording","evasion","qualifying language"],"phonetic":"/ˈhɛdʒɪŋ/","extraExplanation":["“Hedging”一词来自“hedge（树篱）”，树篱有“围住、隔开、保护”的含义，因此引申出“保护自己、降低风险”。在金融里常见搭配有：hedging strategy（对冲策略）、hedge fund（对冲基金）、hedge against inflation（对冲通胀风险）。","在沟通与写作中，hedging 往往用于显得更礼貌或更谨慎：例如“I’m not sure, but…” “It seems that…” “probably/possibly/might”。不过在需要明确立场的场合（如紧急指令、合同条款）过度 hedging 可能显得不可靠。"]}
{"word":"hedgingly","summary":{"en":"“Hedgingly” means speaking or answering cautiously and not committing clearly.","zh":"“hedgingly”表示说话/回答很谨慎、含糊其辞，不愿明确表态。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cautious, noncommittal, or indirect way, often to avoid giving a clear yes/no or a strong opinion.","zh":"以谨慎、模棱两可或不直接的方式（说话/表达），常用来避免明确表态或承担责任。"},"examples":[{"en":"He answered hedgingly, as if he didn’t want to promise anything.","zh":"他回答得很含糊，好像不想做出任何承诺。"},{"en":"She spoke hedgingly about the plan because the details weren’t final.","zh":"因为细节还没敲定，她谈到这个计划时语气很保留。"}]}],"synonyms":["cautiously","evasively","noncommittally","guardedly","ambiguously"],"phonetic":"/ˈhɛdʒɪŋli/","extraExplanation":["“hedgingly”来自动词“hedge”（原义为“树篱/围栏”），引申为“设下边界、留后路”，所以在语言上常表示“话说得保守一点、两面都不得罪”。","常见搭配：answer/speak/respond hedgingly；也常与表示不确定的词连用，如 kind of, sort of, maybe, probably, I think。","注意与金融语境的“hedge（对冲风险）”同源：都是“降低风险、避免押注在单一结果上”的思路。"]}
{"word":"hedgy","summary":{"en":"Hedgy means either “cautious and noncommittal in what you say” or “full of hedges (bushes).”","zh":"hedgy 可指“说话谨慎、含糊不表态”，也可指“多树篱/灌木的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Avoiding clear commitment; cautious and not fully direct (often about language or opinions).","zh":"（言语或态度）模棱两可的；谨慎回避表态的。"},"examples":[{"en":"His answer was a bit hedgy, so I still didn’t know what he really thought.","zh":"他的回答有点含糊，所以我还是不知道他真正的想法。"},{"en":"She gave a hedgy response to avoid promising anything.","zh":"她给了一个模棱两可的回应，以避免做出任何承诺。"}]},{"partOfSpeech":"adj.","definition":{"en":"Full of hedges; having many bushes or hedge boundaries.","zh":"多树篱的；长满灌木篱墙的。"},"examples":[{"en":"They rented a small house with a hedgy garden.","zh":"他们租了一栋带有多树篱花园的小房子。"},{"en":"A hedgy lane led to the farmhouse.","zh":"一条两旁多树篱的小路通向农舍。"}]}],"synonyms":["noncommittal","evasive","guarded","cagey","hedge-filled","bushy"],"phonetic":"/ˈhɛdʒi/","extraExplanation":["“hedgy”来自“hedge（树篱）”。在比喻用法中，hedge 也指“用含糊措辞来回避风险/责任”（例如 hedge your bets 表示“两边下注、留后路”），所以 hedgy 常用来形容说话“留余地、不把话说死”。","“hedgy”比“hedged/hedging”更口语、更像形容词标签；在正式写作里，人们也常说 a hedged answer / hedging language。"]}
{"word":"hedonic","summary":{"en":"Hedonic means connected to pleasure or seeking pleasure; in business/economics it often means enjoyment-based value (not practical usefulness).","zh":"hedonic 指与快乐/享乐有关或追求快乐的；在商业/经济学中常指以愉悦体验为主的价值（非实用性）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to pleasure (especially physical comfort or enjoyment) and the pursuit of pleasure.","zh":"与快乐、享乐有关的；以追求愉悦（尤其是感官享受、舒适）为主的。"},"examples":[{"en":"Some people choose a more hedonic lifestyle, spending money on travel and good food.","zh":"有些人选择更享乐的生活方式，把钱花在旅行和美食上。"},{"en":"The study compares hedonic happiness (feeling good) with meaning in life.","zh":"这项研究比较“享乐型幸福”（感觉好）与人生意义。"}]},{"partOfSpeech":"adj.","definition":{"en":"In economics/marketing: describing value based on the enjoyment a product gives rather than its practical use.","zh":"（经济学/营销）指“享乐价值”：产品带来的愉悦感而非实用功能所产生的价值。"},"examples":[{"en":"Perfume often has high hedonic value even though it isn’t a necessity.","zh":"香水往往有很高的享乐价值，尽管它并非生活必需品。"},{"en":"The brand targets hedonic consumers who buy for fun and experience.","zh":"这个品牌面向享乐型消费者，他们购物是为了乐趣和体验。"}]}],"synonyms":["pleasure-seeking","pleasurable","sensual","indulgent","enjoyment-based"],"phonetic":"/hɪˈdɑnɪk/","extraExplanation":["词源来自希腊语 hēdonē（“快乐、愉悦”）。因此 hedonic 常出现在心理学、哲学与消费研究中，用来谈“追求快乐”的倾向。","常见搭配：hedonic pleasure（享乐）、hedonic motivation（享乐动机）、hedonic treadmill（享乐跑步机：快乐提升后很快适应，幸福感回到原水平）、hedonic vs. utilitarian（享乐型 vs. 功利/实用型）。","语气提示：hedonic 多用于中性学术语境；在日常评价里有时会带一点“过于贪图享受”的暗示，语境决定褒贬。"]}
{"word":"hedonical","summary":{"en":"Hedonical means ‘related to hedonism’ or ‘pleasure-seeking,’ but it’s less common than hedonistic.","zh":"hedonical 意为“与享乐主义有关的/追求享乐的”，但比 hedonistic 更少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to hedonism; focused on pleasure as the most important goal in life.","zh":"与享乐主义有关的；以快乐与享受为人生最重要目标的。"},"examples":[{"en":"He lives a hedonical lifestyle, spending most of his money on travel and good food.","zh":"他过着一种享乐主义的生活方式，把大部分钱花在旅行和美食上。"},{"en":"Some critics said the movie promotes a hedonical view of success.","zh":"一些评论家说这部电影宣扬了一种以享乐为核心的成功观。"}]}],"synonyms":["hedonistic","pleasure-seeking","self-indulgent"],"phonetic":"/hɪˈdɑnɪkəl/","extraExplanation":["“hedonical”在现代英语里相对少见，更常用的形容词是“hedonistic”。在写作或考试中，用“hedonistic”通常更自然、更地道。","词根来自希腊语“hēdonē”（快乐、愉悦）。在哲学语境中，hedonism（享乐主义）讨论“快乐是否是最高的善”；在日常语境中则常指“爱享受、追求感官快乐”。"]}
{"word":"hedonically","summary":{"en":"“Hedonically” means “in a pleasure-focused way,” often used to describe judging how enjoyable something feels.","zh":"“hedonically”意为“从享乐/愉悦角度”，常指以“有多好享受”为标准来评价体验。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to pleasure and enjoyment, especially when judging how pleasant something feels (such as food, smells, music, or experiences).","zh":"以“享乐/愉悦”的角度；用来描述以快乐与满足感为标准来评价事物（常用于食物、气味、音乐或体验的愉悦程度）。"},"examples":[{"en":"The dessert is hedonically satisfying—rich, sweet, and comforting.","zh":"这道甜点在享乐意义上非常令人满足——浓郁、甜美又让人感到慰藉。"},{"en":"Researchers asked participants to rate the fragrance hedonically, from unpleasant to pleasant.","zh":"研究人员让参与者从“不愉快”到“愉快”对这种香味进行享乐性（愉悦度）评分。"},{"en":"I choose restaurants hedonically: I care most about taste and atmosphere.","zh":"我选餐厅很“享乐主义式”：我最在意的是味道和氛围。"}]}],"synonyms":["pleasurably","enjoyably","for pleasure","sensually"],"phonetic":"/hɪˈdɑːnɪkli/","extraExplanation":["“hedonically”来自形容词“hedonic”（与快乐/愉悦有关），而“hedonic”又源于希腊语 hēdonē（意为“快乐”）。在心理学与市场研究中常见“hedonic rating / hedonic scale”（愉悦度评分/量表），用来衡量主观感受的“喜欢程度”。","日常英语里更常说“for pleasure / in terms of enjoyment / purely for enjoyment”。“hedonically”更偏书面、学术或品评语境（如美食、香水、音乐体验）。"]}
{"word":"hedonics","summary":{"en":"Hedonics is the study and measurement of pleasure—often used to understand how product experiences affect what people like and choose.","zh":"Hedonics 指对“愉悦/享受”的研究与测量，常用于理解产品体验如何影响人们的喜好与选择。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of pleasure and enjoyment, especially how people experience and evaluate pleasant feelings (often in psychology, economics, or consumer research)","zh":"享乐学；快乐体验研究（研究人们如何感受与评估愉悦，常见于心理学、经济学与消费研究）"},"examples":[{"en":"The course introduces hedonics and how pleasure influences decision-making.","zh":"这门课介绍享乐学，以及愉悦如何影响决策。"},{"en":"In marketing, hedonics helps explain why people pay more for products they enjoy using.","zh":"在市场营销中，享乐学有助于解释人们为何愿意为“用起来更享受”的产品支付更高价格。"}]},{"partOfSpeech":"n.","definition":{"en":"a method or approach that measures preferences by linking product features (like taste, smell, design, or sound) to how much people like something","zh":"感官偏好评估方法（把口味、气味、设计、声音等特征与“喜欢程度”联系起来进行测量）"},"examples":[{"en":"Food scientists use hedonics to rate how much consumers like a new snack’s flavor.","zh":"食品科学家会用享乐学评估消费者对新零食口味的喜爱程度。"},{"en":"The team ran a hedonics study to see whether the new packaging feels more premium.","zh":"团队做了一项享乐学研究，看看新包装是否让人感觉更高端。"}]}],"synonyms":["the study of pleasure","pleasure research","hedonic analysis","hedonic evaluation","preference testing"],"phonetic":"/hɪˈdɑːnɪks/","extraExplanation":["“hedonics”来自希腊语 hedonē，意为“快乐、愉悦”。在学术与商业语境中，它常与“utilitarian（功利/实用）”相对：前者强调体验与享受，后者强调功能与效率。","在经济学里你可能会看到“hedonic pricing（享乐价格模型）”，用来估算产品特征（例如房子靠近公园、手机相机更好）对价格的影响。"]}
{"word":"hedonism","summary":{"en":"Hedonism is the idea or way of life that puts pleasure first; in philosophy it means pleasure is the highest good.","zh":"Hedonism 指以快乐为首要目标的观念或生活方式；在哲学中指“快乐是最高的善”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief or lifestyle that says the main goal of life is to seek pleasure and avoid pain","zh":"享乐主义：认为人生最重要的目标是追求快乐、避免痛苦的一种信念或生活方式"},"examples":[{"en":"Some people think social media encourages hedonism and instant gratification.","zh":"有些人认为社交媒体助长了享乐主义和即时满足。"},{"en":"He rejected hedonism and chose a simpler life focused on service.","zh":"他拒绝享乐主义，选择了以服务他人为中心的简朴生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(philosophy) the view that pleasure is the highest good, or that what is morally right is what increases pleasure (sometimes including long-term well-being, not just physical fun)","zh":"（哲学）快乐至上论：认为“快乐”是最高的善，或认为道德上正确的行为是能增加快乐的行为（有时也包括长期福祉，而不只是感官享受）"},"examples":[{"en":"In ethics class, we compared hedonism with stoicism and utilitarianism.","zh":"在伦理课上，我们把享乐主义与斯多葛主义、功利主义作了比较。"},{"en":"Not all hedonism is about partying; some versions emphasize calm, lasting happiness.","zh":"并非所有享乐主义都等于狂欢；有些版本强调平静、持久的幸福。"}]}],"synonyms":["pleasure-seeking","self-indulgence","pursuit of pleasure","Epicureanism (related, not identical)"],"phonetic":"/ˈhiːdəˌnɪzəm/","extraExplanation":["词源：来自希腊语 hēdonē，意为“快乐、愉悦”。","文化提示：日常语境里，hedonism 常带一点负面评价（暗示放纵、短视）；但在哲学讨论中它是较中性的术语。","相关概念简辨：hedonism（以快乐为最高价值）≠ utilitarianism（以“最大多数人的最大幸福”为标准）；也≠ stoicism（强调节制与内在平静）。","常见搭配：hedonism lifestyle（享乐主义生活方式）、consumer hedonism（消费享乐主义）、hedonistic pleasures（享乐式的快感）。"]}
{"word":"hedonisms","summary":{"en":"Hedonism(s) means the belief or lifestyle that prioritizes pleasure, sometimes with a negative sense of excess.","zh":"Hedonism(s) 指把“享乐”视为最重要目标的思想或生活方式，日常语境中常含“过度、奢靡”的贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief or way of thinking that pleasure is the most important goal in life.","zh":"享乐主义：认为“快乐/愉悦”是人生最重要目标的思想或生活态度。"},"examples":[{"en":"Some people criticize consumer culture as a form of hedonism.","zh":"有些人批评消费文化是一种享乐主义。"},{"en":"He rejected hedonism and chose a simpler life.","zh":"他拒绝享乐主义，选择了更简单的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"A lifestyle focused on enjoying pleasures, often implying excess (food, parties, luxury, etc.).","zh":"纵情享乐的生活方式（常带有“过度、奢靡”的含义，如美食、派对、奢侈品等）。"},"examples":[{"en":"Weekend hedonism left her exhausted on Monday.","zh":"周末的纵情享乐让她周一精疲力尽。"},{"en":"The novel portrays the hedonism of the rich in the city.","zh":"这部小说描绘了都市富人的奢靡享乐。"}]}],"synonyms":["pleasure-seeking","self-indulgence","sensualism","debauchery"],"phonetic":"/ˈhiːdəˌnɪzəm/","extraExplanation":["“hedonism”来自希腊语 hēdonē（意为“快乐、愉悦”）。在哲学语境里，它不一定等于“放纵”，更多讨论“什么是善/幸福”；但在日常英语里，常带有对奢华、沉迷享受的批评色彩。","你输入的“hedonisms”是复数形式，常用于：①谈不同类型/形式的享乐主义（different hedonisms）；②强调多种享乐行为或倾向。更常见的单数是“hedonism”。"]}
{"word":"hedonist","summary":{"en":"A hedonist is someone who believes pleasure is the main goal of life or who actively seeks pleasure.","zh":"hedonist 指认为快乐是人生主要目标、或积极追求享乐的人（“享乐主义者”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that pleasure is the most important goal in life, or who always seeks pleasure","zh":"享乐主义者；把快乐当作人生最重要目标的人；追求享乐的人"},"examples":[{"en":"He calls himself a hedonist, but he still works hard and saves money.","zh":"他自称是享乐主义者，但他仍然努力工作、也会存钱。"},{"en":"In college, she was a cheerful hedonist who loved good food and late-night music.","zh":"大学时，她是个开朗的享乐主义者，喜欢美食和深夜的音乐。"},{"en":"The novel portrays him as a lonely hedonist chasing pleasure to avoid pain.","zh":"小说把他描写成一个孤独的享乐主义者，用追逐快乐来逃避痛苦。"}]}],"synonyms":["pleasure-seeker","sensualist","bon vivant"],"phonetic":"/ˈhiːdənɪst/","extraExplanation":["词源上来自希腊语（与“快乐/愉悦”相关），常用于讨论人生观与价值观。注意：日常语境里它有时带一点负面评价（暗示自我放纵），但在哲学语境中也可能是中性、偏学术的描述。","相关词：hedonism（享乐主义，名词）；hedonistic（享乐主义的/追求享乐的，形容词）。常见搭配：a hedonist lifestyle（享乐的生活方式）、a self-described hedonist（自称享乐主义者）。"]}
{"word":"hedonistic","summary":{"en":"Hedonistic describes someone or something centered on pleasure—often implying indulgence; in philosophy, it relates to the view that pleasure is a key good.","zh":"hedonistic 指以快乐/享受为中心的（常含“放纵”意味）；在哲学中指与“享乐主义”相关的观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Focused on the pursuit of pleasure (especially physical comfort, fun, or luxury) as a main goal in life.","zh":"以追求享乐为主要目标的（尤指感官享受、舒适、娱乐或奢华）。"},"examples":[{"en":"He lived a hedonistic lifestyle, spending most of his money on parties and travel.","zh":"他过着享乐主义的生活，把大部分钱都花在派对和旅行上。"},{"en":"The film shows a hedonistic nightlife scene full of loud music and expensive drinks.","zh":"这部电影展现了一个享乐化的夜生活场景，充满喧闹音乐和昂贵酒水。"}]},{"partOfSpeech":"adj.","definition":{"en":"In philosophy, connected to hedonism: the idea that pleasure is the highest good or an important measure of a good life.","zh":"（哲学）与“享乐主义”相关：认为快乐是最高善，或是衡量美好生活的重要标准。"},"examples":[{"en":"Some ancient thinkers defended a hedonistic view that pleasure can be a guide to living well.","zh":"一些古代思想家主张一种享乐主义观点，认为快乐可以指引人过好生活。"},{"en":"Her essay compares hedonistic ethics with duty-based ethics.","zh":"她的文章把享乐主义伦理与义务论伦理进行了比较。"}]}],"synonyms":["pleasure-seeking","self-indulgent","sensual","decadent"],"phonetic":"/ˌhiːdəˈnɪstɪk/","extraExplanation":["词源上与希腊语 hēdonē（“快乐/愉悦”）有关。日常英语里，hedonistic 常带一点负面评价，暗示“过度追求享受、缺乏自律”；但在哲学语境中，它也可以是相对中性的学术用语。","常见搭配：hedonistic lifestyle（享乐型生活方式）、hedonistic pleasures（感官享乐）、a hedonistic pursuit of fun（对娱乐的享乐式追求）。近义但语气更强的词：self-indulgent（放纵的）、decadent（颓靡奢靡的）。"]}
{"word":"hedonistically","summary":{"en":"“Hedonistically” means “in a pleasure-seeking way,” often implying indulgence.","zh":"“hedonistically”意为“以追求享乐的方式”，常带有“放纵/沉溺享受”的含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that focuses on seeking pleasure (especially physical or immediate pleasure) as the most important goal.","zh":"以享乐主义的方式；把追求快乐（尤其是感官或即时的快乐）当作最重要目标地。"},"examples":[{"en":"They spent the weekend hedonistically, eating rich food and staying out late.","zh":"他们以享乐的方式度过周末，吃得很丰盛，还玩到很晚。"},{"en":"He lived hedonistically for years, but later wanted a simpler life.","zh":"他享乐地生活了多年，但后来想过更简单的日子。"},{"en":"The resort markets itself as a place to relax and live hedonistically.","zh":"这家度假村把自己宣传成一个可以放松、尽情享乐的地方。"}]}],"synonyms":["indulgently","self-indulgently","pleasure-seeking","sensually"],"phonetic":"/ˌhiːdəˈnɪstɪkli/","extraExplanation":["“hedonistically”来自“hedonism（享乐主义）”，词根源于希腊语，原意与“快乐/愉悦”有关。日常英语里，它常带一点批评或道德评价（暗示过度追求享受、忽视责任），但在旅游、生活方式写作中也可能是中性或带点“放纵享受”的语气。","常见搭配：live hedonistically（享乐地生活）、spend money hedonistically（挥霍式花钱）、pursue pleasure hedonistically（以享乐方式追求快乐）。","语义对比：hedonistically（偏“追求享乐/放纵”） vs. happily（开心地）/ pleasantly（愉快地）——后两者通常更中性，不含“把快乐当最高目标”的哲学或价值判断。"]}
{"word":"hedonists","summary":{"en":"Hedonists are people who prioritize pleasure; in philosophy, they are followers of hedonism.","zh":"hedonists 指“享乐主义者”；哲学语境中指“享乐主义”观点的拥护者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who believe that pleasure is the most important goal in life, or who live mainly to enjoy themselves.","zh":"享乐主义者；认为快乐最重要、或主要以追求享受为生活目标的人。"},"examples":[{"en":"Some critics say the characters in the novel are shallow hedonists who only chase pleasure.","zh":"一些评论家说，这部小说里的人物很肤浅，是只追求享受的享乐主义者。"},{"en":"They weren’t irresponsible—just young hedonists who loved parties and travel.","zh":"他们并非不负责任，只是喜欢派对和旅行的年轻享乐主义者。"},{"en":"As he grew older, he stopped living like a hedonist and started valuing health and family.","zh":"随着年龄增长，他不再像享乐主义者那样生活，而开始重视健康和家庭。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy, followers of hedonism—the view that pleasure (or happiness) is the highest good.","zh":"（哲学）享乐主义的拥护者；主张“快乐（或幸福）是最高善”的人。"},"examples":[{"en":"Ancient Greek hedonists argued that a good life should include simple, lasting pleasures.","zh":"古希腊的享乐主义者认为，美好生活应包含简单而持久的快乐。"},{"en":"Not all philosophical hedonists support wild indulgence; many emphasize balance and peace of mind.","zh":"并非所有哲学享乐主义者都支持放纵；许多人强调平衡与内心安宁。"}]}],"synonyms":["pleasure-seekers","bon vivants","sensualists"],"phonetic":"/ˈhiːdənɪsts/","extraExplanation":["“hedonist”来自希腊语 *hēdonē*（快乐、愉悦）。日常英语里常带一点贬义，暗示“只顾享乐”；但在哲学语境中更中性，指一种关于“什么是最高价值”的观点。"]}
{"word":"hedonology","summary":{"en":"Hedonology is the study or theory of pleasure.","zh":"Hedonology 指“对快乐/享受的研究或理论”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or theory of pleasure (especially what pleasure is and how it relates to happiness, desire, and motivation)","zh":"享乐学；快乐理论（研究“快乐是什么”，以及快乐与幸福、欲望、动机之间的关系）"},"examples":[{"en":"In philosophy class, we touched on hedonology when discussing what makes a good life.","zh":"在哲学课上，我们讨论“什么是美好生活”时提到了享乐学。"},{"en":"Some psychologists use ideas from hedonology to understand why people repeat certain behaviors.","zh":"一些心理学家借助享乐学的观点来理解人们为何会重复某些行为。"}]}],"synonyms":["the study of pleasure","pleasure theory"],"phonetic":"/ˌhiːdəˈnɑːlədʒi/","extraExplanation":["“Hedonology”来自希腊语词根：hedone（快乐、享受）+ -logy（学问、研究）。它不是日常高频词，更常见的相关词是“hedonism（享乐主义）”，后者通常指一种生活态度或价值观；而“hedonology”更偏学术，用来指对“快乐”的系统研究或理论。"]}
{"word":"hedonophobia","summary":{"en":"Hedonophobia means a fear of pleasure or enjoyment.","zh":"hedonophobia 指“对快乐或享受的恐惧”（享乐恐惧症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense or persistent fear of pleasure, enjoyment, or feeling good (often leading someone to avoid fun or rewarding experiences)","zh":"对快乐、享受或“感觉很好”的强烈或持续的恐惧（常导致回避有趣或令人满足的体验）"},"examples":[{"en":"Because of his hedonophobia, he felt anxious whenever he started to relax or enjoy himself.","zh":"由于他有“享乐恐惧症”，一旦开始放松或享受，他就会感到焦虑。"},{"en":"Her hedonophobia made her avoid parties, even though she liked her friends.","zh":"她的“享乐恐惧症”让她回避聚会，尽管她喜欢朋友们。"}]}],"synonyms":["fear of pleasure","aversion to pleasure"],"phonetic":"ˌhiːdənoʊˈfoʊbiə","extraExplanation":["构词法：hedono- 来自希腊语 hēdonē（快乐、享受），-phobia 表示“恐惧”。字面意思就是“对快乐的恐惧”。","使用提醒：这是较少见、偏心理学/科普语境的词。日常表达也可说：a fear of pleasure / afraid to enjoy myself / feeling guilty about having fun（更口语）。","语境补充：这种恐惧有时与“觉得快乐会带来惩罚/失控/内疚”的想法有关；如果在现实生活中造成明显困扰，通常需要专业支持。"]}
{"word":"hedral","summary":{"en":"“Hedral” means “having flat faces,” most often seen in scientific words like tetrahedral or octahedral.","zh":"“hedral”表示“具有平面面的（多面体的）”，最常见于 tetrahedral、octahedral 等科学术语中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a specified number or arrangement of flat faces (often used in scientific terms like tetrahedral, octahedral).","zh":"具有特定数量或排列方式的平面“面”（常见于科学术语，如 tetrahedral“四面体的”、octahedral“八面体的”）。"},"examples":[{"en":"Methane has a tetrahedral shape, meaning the molecule is tetrahedral.","zh":"甲烷呈四面体结构，也就是这种分子是四面体的。"},{"en":"Many crystals form octahedral structures with eight faces.","zh":"许多晶体会形成八面体结构，具有八个面。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to faces/sides of a solid shape; faceted.","zh":"与立体形状的面/棱面有关；多面体的、具棱面的。"},"examples":[{"en":"The mineral shows a distinctly hedral surface under the light.","zh":"这种矿物在光线下呈现出明显的多面棱面。"}]}],"synonyms":["faceted","polyhedral","many-sided"],"phonetic":"/ˈhiːdrəl/","extraExplanation":["“hedral”在现代英语里多见于复合词或后缀形式“-hedral”，尤其在化学与几何中描述分子或晶体的空间构型（如 tetra- 四、octa- 八 + -hedral）。","词源可追溯到希腊语 *hedra*，与“座位/基底/面”有关，因此引申为“（立体的）面”。"]}
{"word":"hedriophthalmous","summary":{"en":"A zoological adjective meaning “having fixed, non-stalked (sessile) eyes.”","zh":"动物学形容词，指“眼睛固定、无眼柄（无眼梗/柄）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of some animals, especially crustaceans) having eyes that are fixed in place (not on stalks); sessile-eyed.","zh":"（多指某些动物，尤指甲壳类）眼睛固定在头部上、不长在眼柄上；无眼柄的。"},"examples":[{"en":"Crabs are typically hedriophthalmous, with eyes set close to the head rather than on long stalks.","zh":"螃蟹通常是 hedriophthalmous（无眼柄的），眼睛靠近头部而不是长在很长的眼柄上。"},{"en":"The guide described the species as hedriophthalmous, which helped us tell it from stalk-eyed relatives.","zh":"向导说这种动物是 hedriophthalmous（眼睛固定的），这帮助我们把它和“有眼柄”的近亲区分开。"}]}],"synonyms":["sessile-eyed","fixed-eyed","non-stalked-eyed"],"phonetic":"/ˌhɛdriˈɑfθəlməs/","extraExplanation":["这是一个生物学/动物学用词，来自希腊语词根：hedra（座位、固定的位置）+ ophthalmos（眼睛）。字面意思接近“把眼睛‘坐’在头上”，强调眼睛不在可活动的眼柄（stalk/peduncle）上。","在甲壳类描述中常用来与“stalk-eyed / pedunculated-eyed（有眼柄的）”相对。由于非常专业，日常英语几乎不用。"]}
{"word":"hedrocele","summary":{"en":"Hydrocele: fluid buildup around a testicle causing scrotal swelling.","zh":"Hydrocele（阴囊积液）：睾丸周围积液导致的阴囊肿胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A swelling (usually in the scrotum) caused by a buildup of fluid around a testicle.","zh":"（通常在阴囊内）因睾丸周围积液而引起的肿胀；阴囊积液。"},"examples":[{"en":"The doctor said the painless swelling was likely a hydrocele.","zh":"医生说这种无痛的肿胀很可能是阴囊积液（hydrocele）。"},{"en":"An ultrasound can help confirm a hydrocele.","zh":"超声检查可以帮助确认是否为阴囊积液。"}]}],"synonyms":["hydrocele","scrotal fluid collection","scrotal swelling"],"phonetic":"/ˈhaɪdrəˌsiːl/","extraExplanation":["你输入的“hedrocele”在英语里不常见，最可能是拼写误差，正确医学术语通常是“hydrocele”。","词源上“hydro-”表示“水/液体”，“-cele”表示“肿胀/疝样隆起”，合起来就是“因液体导致的肿胀”。","这是医学用词，日常交流中更常说“fluid around the testicle（睾丸周围积液）”或“scrotal swelling（阴囊肿胀）”。若用于就医沟通，建议使用正确拼写“hydrocele”。"]}
{"word":"hedron","summary":{"en":"“Hedron” means a 3D solid with flat faces, usually seen as the suffix -hedron in geometry terms.","zh":"“hedron”指有平面面的立体，常作为几何术语后缀 -hedron 出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a solid (3D) shape with flat faces; used as a suffix in geometry names (e.g., tetrahedron, polyhedron).","zh":"（几何）有平面面的立体；常作后缀用于几何名称中（如 tetrahedron 四面体、polyhedron 多面体）。"},"examples":[{"en":"A tetrahedron is a hedron with four triangular faces.","zh":"四面体是一种有四个三角形面的立体（hedron）。"},{"en":"In geometry, you often see -hedron in words that name 3D solids.","zh":"在几何里，你经常在命名立体图形的词中看到后缀 -hedron。"}]}],"synonyms":["polyhedron (general term)","solid (general term)"],"phonetic":"/ˈhiːdrən/","extraExplanation":["“hedron”来自希腊语 *hedra*，本义与“座位/底座”有关，后来在数学语境中引申为“（有平面面的）立体”。英语里它多作为后缀出现：tetra-（四）+ -hedron（面体）= tetrahedron（四面体）；hexa-（六）+ -hedron = hexahedron（六面体）。","常见相关词：polyhedron（多面体）、dodecahedron（十二面体）、icosahedron（二十面体）。注意：球体这类曲面立体通常不用 -hedron 来命名，因为 -hedron 强调“平面面”。"]}
{"word":"hedrumite","summary":{"en":"Hedrumite is a rare word meaning a person from Hedrum, Norway, or something related to Hedrum.","zh":"Hedrumite 是较少见的词，指挪威赫德鲁姆的人，或与赫德鲁姆有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person from Hedrum (a former municipality in Vestfold, Norway); someone associated with Hedrum.","zh":"赫德鲁姆（挪威 Vestfold 地区的旧市镇）的人；与赫德鲁姆有关的人。"},"examples":[{"en":"He’s a Hedrumite who moved to Oslo for university.","zh":"他是赫德鲁姆人，后来去奥斯陆读大学。"},{"en":"The museum’s collection includes works by several Hedrumite artists.","zh":"博物馆的馆藏包括几位赫德鲁姆艺术家的作品。"}]},{"partOfSpeech":"adj.","definition":{"en":"An adjective meaning “of or relating to Hedrum.”","zh":"形容词：赫德鲁姆的；与赫德鲁姆有关的。"},"examples":[{"en":"They studied Hedrumite local history and family records.","zh":"他们研究了赫德鲁姆的地方史和家族档案。"}]}],"synonyms":["Hedrum resident","person from Hedrum"],"phonetic":"/ˈhɛdrəˌmaɪt/","extraExplanation":["“hedrumite”并不是常见英语词，更多像是按英语构词规则临时造出的“地名/族名词”。英语里后缀 -ite 常用来表示“某地的人/与某地有关的”（如 Brooklynite、Israelite）。","Hedrum（赫德鲁姆）是挪威的一个旧行政区名，后来并入 Larvik 一带；因此该词多出现在家谱、地方史或较小众的地域语境中。"]}
{"word":"hedychium","summary":{"en":"Hedychium is a genus of fragrant tropical plants known as ginger lilies.","zh":"Hedychium 指“姜花/姜百合”这类芳香热带植物的一个属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of fragrant, tropical flowering plants in the ginger family (Zingiberaceae), often called ginger lilies.","zh":"姜科（Zingiberaceae）中的一个芳香热带开花植物属，常被称为“姜花 / 姜百合（ginger lily）”。"},"examples":[{"en":"Hedychium is often grown for its strong fragrance and showy flowers.","zh":"Hedychium 常因浓郁香气和醒目的花朵而被栽培。"},{"en":"The garden features a clump of Hedychium near the pond.","zh":"花园池塘边种着一丛 Hedychium。"}]}],"synonyms":["ginger lily","ginger-lily (hyphenated variant)","kahili ginger (common name for a species)"],"phonetic":"/həˈdɪkiəm/","extraExplanation":["Hedychium 是植物学拉丁名，常见英文俗名是 ginger lily（姜花/姜百合）。其中一些物种在英语里也会被叫作 kahili ginger（通常指 Hedychium gardnerianum）。","词源一般解释为来自希腊语：hedys（“甜的、芬芳的”）+ chion（“雪”），常被理解为形容其芬芳、浅色花朵的感觉。","在园艺语境中，Hedychium 多指观赏用的香花植物；在部分地区也被视为外来入侵植物，使用时会因地区生态政策而有所不同。"]}
{"word":"hedyphane","summary":{"en":"“hedyphane” is not a standard English word; it’s likely a rare proper name or a variant of the Greek name “Hedyphanes.”","zh":"“hedyphane”不是标准英语词汇；更可能是罕见人名，或古希腊名字“Hedyphanes”的变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very rare proper name (not a common English vocabulary word). It may be a variant spelling of the ancient Greek name “Hedyphanes,” meaning “sweet-appearing” or “pleasant to look at.”","zh":"一个非常少见的专有名词（不属于常见英语词汇）。它可能是古希腊名字“Hedyphanes”的变体拼写，含义大致为“甜美/令人愉悦的外貌”或“看起来讨人喜欢”。"},"examples":[{"en":"I couldn’t find “hedyphane” in standard English dictionaries; it seems to be used as a name.","zh":"我在常见英语词典里找不到“hedyphane”；它看起来更像是一个名字。"},{"en":"If “Hedyphane” is a character name, you can keep the original spelling but add a short note about its origin.","zh":"如果“Hedyphane”是角色名，你可以保留原拼写，并加一句简短说明它的来源。"}]}],"phonetic":"/ˈhɛdiˌfeɪn/","extraExplanation":["“Hedyphane”在英语中并非常用词，更像是人名/角色名或拼写变体。若你是在文献、游戏、小说里看到它，可能与古希腊语词根有关：hedy-（意为“甜美、愉快”）+ phan-/phanes（与“显现、呈现”相关），因此可引申为“令人愉悦地显现/好看”。","如果你方便，发一下你看到它的句子或来源（书名/网页/截图），我可以更准确判断它是人名、地名、品牌名，还是某个单词的误拼（例如相近拼写）。"]}
{"word":"hedysarum","summary":{"en":"Hedysarum is a plant genus in the pea family, often called sweetvetch.","zh":"Hedysarum 指豆科的一类植物属名，常称 sweetvetch（甜野豌豆/甜苜蓿类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the pea/legume family (Fabaceae), often called sweetvetch; some species are used as forage or have edible roots.","zh":"（豆科）黄芪属/甜苜蓿属一类开花植物的属名，英文常称 sweetvetch；部分种类可作牧草或其根可食用。"},"examples":[{"en":"Hedysarum species grow in cold, dry regions and are common in alpine meadows.","zh":"黄芪属植物常生长在寒冷干燥地区，在高山草甸中很常见。"},{"en":"Some wildlife feed on hedysarum leaves and seeds.","zh":"一些野生动物以黄芪属植物的叶和种子为食。"}]}],"synonyms":["sweetvetch"],"phonetic":"/ˌhɛdɪˈsɛrəm/","extraExplanation":["“Hedysarum”是植物学里的拉丁化属名，常见英文俗名是 sweetvetch（甜野豌豆/甜苜蓿一类）。在科普或生态学文章里更常用属名（Hedysarum）来指这一类植物。","词源来自古希腊语，含“甜”的词根（hedy-），与其常见俗名 sweetvetch（含“sweet”）在意义上呼应。"]}
