{"word":"hefig","summary":{"en":"“hefig” is not a standard English word; it’s probably a misspelling or a proper name.","zh":"“hefig”不是标准英语单词；更可能是拼写错误或专有名词（名字）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a name/username.","zh":"不是标准英语单词；更可能是拼写错误，或是人名/用户名。"},"examples":[{"en":"“hefig” isn’t in most English dictionaries—did you mean “hefty” or “heft”?","zh":"“hefig”不在大多数英语词典里——你是不是想写“hefty”或“heft”？"},{"en":"If “Hefig” is a name, please share the context (a sentence or where you saw it).","zh":"如果“Hefig”是名字，请提供上下文（一个句子或你在哪里看到的）。"}]}],"extraExplanation":["“hefig”可能是键盘误触或拼写接近的词：\n- heft /heft/（n. 重量；vt. 掂量、举起）\n- hefty /ˈhɛfti/（adj. 很重的；数量大的）\n- fig /fɪɡ/（n. 无花果；也可指“无花果树”）\n如果你把它放进句子里，我可以更准确判断你想表达的词和用法。"]}
{"word":"heft","summary":{"en":"Heft means the weight or solid feel of something when you lift it, and it can also mean to lift something heavy to test its weight.","zh":"Heft 指拿起时感觉到的分量/重量，也可作动词表示举起或掂量重物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the weight of something, especially how heavy it feels when you lift or hold it","zh":"（物体的）重量；（拿起时感到的）分量"},"examples":[{"en":"I could tell by the heft of the box that it was full of books.","zh":"从箱子的分量我就能看出来里面装满了书。"},{"en":"The hammer has a good heft, so it feels solid in your hand.","zh":"这把锤子分量很足，所以握在手里感觉很结实。"}]},{"partOfSpeech":"vt.","definition":{"en":"to lift or carry something heavy (often to test its weight)","zh":"举起或搬动（重物）；（常指）掂量重量"},"examples":[{"en":"He hefted the suitcase onto the bed.","zh":"他把行李箱用力搬到床上。"},{"en":"She hefted the melon to see which one was heavier.","zh":"她掂了掂甜瓜，看看哪一个更重。"}]}],"synonyms":["weight","heaviness","bulk","lift","hoist"],"phonetic":"/hɛft/","extraExplanation":["“heft”常带有一种“用手一掂就能感觉到的重量”的画面感，不只是客观重量（weight），而是“手感上的分量”。在写作里，它也能引申为“分量/份量/重要性”（the heft of an argument），但这个用法更偏正式。"]}
{"word":"hefted","summary":{"en":"“Hefted” usually means “lifted/picked up something heavy, often to feel or judge its weight.”","zh":"“Hefted”通常表示“把较重的东西举起/拿起（常含掂量重量、试手感的意味）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “heft”: lifted or picked up something heavy (often to feel its weight).","zh":"“heft”的过去式/过去分词：把（通常较重的东西）举起或拿起，常带有“掂量重量”的意思。"},"examples":[{"en":"He hefted the suitcase to see if it was too heavy.","zh":"他把行李箱掂起来看看会不会太重。"},{"en":"She hefted the box onto the table with both hands.","zh":"她双手把箱子搬到桌子上。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “heft”: assessed the weight or quality of something by holding it (often before buying or choosing).","zh":"“heft”的过去式/过去分词：拿在手里掂掂，以判断重量或品质（常用于挑选或购买前）。"},"examples":[{"en":"The buyer hefted the fruit, looking for the ripest ones.","zh":"买家掂了掂水果，挑选最成熟的。"},{"en":"He hefted the tool in his hand and decided it felt well made.","zh":"他把工具拿在手里掂了掂，觉得做工不错。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) used like an adjective meaning “heavy; weighty.”","zh":"（较少见）作形容词用，表示“沉重的；有分量的”。"},"examples":[{"en":"They dragged a hefted stone across the yard.","zh":"他们把一块沉重的石头拖过院子。"}]}],"synonyms":["lifted","picked up","hoisted","raised","weighed (in the hand)"],"phonetic":"/ˈhɛftɪd/","extraExplanation":["“heft”常见的搭配是 heft a bag/box/suitcase（掂起包/箱子），语气比普通的 lift 更强调“重量感”和“试重量”。","在文学或描写性写作里，hefted 往往用来营造“沉甸甸、费力”的画面感，比 lifted 更有质感。"]}
{"word":"hefter","summary":{"en":"A “hefter” is usually either someone who lifts/handles heavy things, or (in Scottish/Northern English usage) a sheep that stays loyal to its grazing area.","zh":"“hefter”通常指搬运或掂量重物的人；在苏格兰/英格兰北部语境中也可指“认地盘”、固定在某片牧场活动的羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lifts, carries, or handles something heavy (someone who “hefts” something).","zh":"搬运重物的人；举起或掂量重物的人（指会“heft”某物的人）。"},"examples":[{"en":"The move was easier once we hired a strong hefter to help with the furniture.","zh":"一旦我们雇了个力气大的搬运工来帮忙搬家具，搬家就轻松多了。"},{"en":"He worked as a hefter at the warehouse, loading boxes all day.","zh":"他在仓库当搬运工，一整天都在装卸箱子。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in Scotland/Northern England) a sheep that is accustomed to a particular grazing area and tends to stay there.","zh":"（尤指苏格兰/英格兰北部方言）“认地盘”的羊：习惯在某片牧场活动、通常不会离开那片区域的羊。"},"examples":[{"en":"The shepherd said the hefter would keep to the hill even without fences.","zh":"牧羊人说，这种“认地盘”的羊即使没有围栏也会待在山坡那一带。"},{"en":"They raised hefters that knew their own pasture.","zh":"他们饲养那种熟悉自家牧地、不会乱跑的羊。"}]}],"synonyms":["mover","porter","loader","carrier"],"phonetic":"/ˈhɛftɚ/","extraExplanation":["“Hefter”来自动词 heft（掂量、举起、搬动）。作为“搬运重物的人”的意思在一般英语里较少见，更常见的说法是 porter / mover / loader。","第二个意思是地区性用法（苏格兰和英格兰北部的牧羊语境），与“heft”（羊熟悉并固定活动的一片放牧区域）相关：这些羊会“记住”自己的山坡或牧场。"]}
{"word":"hefters","summary":{"en":"“Hefters” is an uncommon plural form of “hefter,” meaning something (or someone) heavy, or a person who hefts (lifts to judge weight).","zh":"“hefters”是较少见的“hefter”的复数，可指很重/很大的东西（或人），也可指会“heft”（拿起掂量重量）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that is heavy, large, or solid (informal; not very common in modern English)","zh":"（非正式；现代英语中不太常见）很重、很大或很结实的人或物"},"examples":[{"en":"That old wooden desk is a real hefter—you’ll need two people to move it.","zh":"那张老木桌真是个“大块头”，你得两个人一起搬。"},{"en":"He carried the box like it was nothing, but it was a hefter.","zh":"他抱着箱子像没事一样，但那其实很重。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who lifts or weighs something by holding it (based on the verb “heft,” meaning “to lift to judge weight”)","zh":"（源自动词 heft）通过拿起某物来掂量重量的人；搬起某物来估重的人"},"examples":[{"en":"As a dock worker, he was an experienced hefter of cargo.","zh":"作为码头工人，他很擅长搬运并掂量货物。"},{"en":"She’s a careful hefter of fruit, choosing the heaviest oranges.","zh":"她买水果时会仔细掂量，挑最沉的橙子。"}]}],"synonyms":["heavyweight","big one","chunk","hefty object","lifter"],"phonetic":"/ˈhɛftər/","extraExplanation":["“hefter(s)”在日常英语里比较少见，更常见的是：动词/名词“heft”（掂量；重量）和形容词“hefty”（很重的；可观的）。","很多学习者会把“hefters”误写成“heifers”（/ˈhaɪfərz/，小母牛的复数）。如果你想表达“小母牛”，正确拼写是 heifers。"]}
{"word":"heftier","summary":{"en":"Heftier means “more hefty”: heavier/bigger, or larger in amount (like a heftier fine or investment).","zh":"Heftier 是 hefty 的比较级，表示“更重/更大”，也可指“数额更大、惩罚更重、投入更多”等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bigger, heavier, or more solid in size/weight than something else.","zh":"（尺寸或重量）更大、更重、更厚实的。"},"examples":[{"en":"This suitcase is heftier than the backpack.","zh":"这个行李箱比背包更重（更大）。"},{"en":"He bought a heftier table that wouldn’t wobble.","zh":"他买了一张更厚实、更稳的桌子。"}]},{"partOfSpeech":"adj.","definition":{"en":"Larger in amount, degree, or intensity (often about money, punishment, or effort).","zh":"（数量、程度或强度）更高、更大（常用于钱、惩罚或付出）。"},"examples":[{"en":"They received a heftier fine for breaking the rules.","zh":"他们因违规被处以更高的罚款。"},{"en":"The new plan requires a heftier investment.","zh":"新计划需要更大的投入。"},{"en":"She made a heftier effort this time and passed.","zh":"这次她更努力了，所以通过了。"}]}],"synonyms":["heavier","bigger","bulkier","more substantial","larger","steeper","more sizable"],"phonetic":"/ˈhɛftiɚ/","extraExplanation":["“heftier”是形容词“hefty”的比较级，表示“更……”。“hefty”本义与“heft”（用手掂量重量）有关，所以既可指真正的“更重”，也常引申为“金额更大、惩罚更重、任务更艰巨”。","常见搭配：a heftier fine（更高罚款），a heftier price tag（更高标价），a heftier sentence（更重的刑罚），a heftier workload（更重的工作量）。语气多偏口语、新闻报道。"]}
{"word":"heftiest","summary":{"en":"“Heftiest” means the biggest, heaviest, or most substantial.","zh":"“heftiest”表示最大、最重或最可观的（最高级）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “hefty”: the largest, heaviest, or most substantial (in size, weight, amount, or degree).","zh":"“hefty”的最高级：最大、最重或最可观的（指体积、重量、数量或程度）。"},"examples":[{"en":"This is the heftiest suitcase I own, so it’s hard to lift into the car.","zh":"这是我拥有的最沉的行李箱，所以很难抬进车里。"},{"en":"They paid the heftiest fine in the company’s history.","zh":"他们支付了公司历史上数额最大的罚款。"},{"en":"She carries the heftiest workload on the team right now.","zh":"她目前承担着团队里最重的工作量。"}]}],"synonyms":["heaviest","largest","biggest","most substantial","weightiest"],"phonetic":"ˈhɛftiɪst","extraExplanation":["“heftiest”是形容词“hefty”的最高级，常见搭配有：the heftiest bag/fine/price/workload/portion。既可指“重量很大”，也常引申为“金额很大/程度很高”。","比较级与最高级：hefty → heftier → heftiest。句型常见为“the heftiest + 名词”。"]}
{"word":"heftily","summary":{"en":"Heftily means “in a heavy, effortful way” or “with strong, weighty force.”","zh":"heftily 表示“沉重、费力地”，也可表示“有力、很有分量地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a heavy or awkward way; with a lot of weight or effort (often describing movement or carrying).","zh":"沉重地；费力地（常形容动作或搬运时很吃力）。"},"examples":[{"en":"Heftily carrying the box, she climbed the stairs one step at a time.","zh":"她费力地搬着箱子，一步一步爬上楼梯。"},{"en":"The suitcase landed heftily on the floor with a dull thud.","zh":"行李箱沉重地落在地上，发出一声闷响。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a strongly forceful, solid way (often describing impact, emphasis, or style).","zh":"有力地；沉稳而用力地（常形容撞击、强调或风格）。"},"examples":[{"en":"He knocked heftily on the door to make sure they heard him.","zh":"他用力敲门，确保里面的人能听见。"},{"en":"The drummer played heftily, giving the song a powerful feel.","zh":"鼓手打得很有力度，让这首歌听起来很有力量。"}]}],"synonyms":["heavily","weightily","laboriously","forcibly","solidly"],"phonetic":"/ˈhɛftəli/","extraExplanation":["“heftily”来自形容词/副词相关词根“hefty”（重的、结实的、有分量的），而“heft”原本有“掂量重量、举起试重量”的意思。英语里用“heftily”既可以写“很重很吃力”，也可以写“很有力度、很有分量的方式”（不一定真的很重）。写作中常用来营造“沉重的动作/沉稳的力量感”。"]}
{"word":"heftiness","summary":{"en":"Heftiness means heaviness or a sense of solid weight, and it can also mean seriousness or strength (having “weight” in importance).","zh":"Heftiness 指沉重或有分量的感觉，也可引申为“重要性上的分量”，表示严肃、有力度、扎实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Great weight, size, or heaviness; the feeling that something is heavy.","zh":"（重量、体积或触感上的）沉重；分量感。"},"examples":[{"en":"The heftiness of the box surprised me when I tried to lift it.","zh":"我试着抬起箱子时，它的沉重让我吃了一惊。"},{"en":"You can feel the phone’s heftiness compared with lighter models.","zh":"和更轻的机型比起来，你能感觉到这部手机更有分量。"}]},{"partOfSpeech":"n.","definition":{"en":"Strength, solidity, or seriousness (often about an object, argument, or responsibility).","zh":"（常指物品、论点或责任的）厚重感；扎实；分量（引申为“严肃/有力度”）。"},"examples":[{"en":"The report has a certain heftiness because it is based on real data.","zh":"这份报告因为建立在真实数据上而显得很有分量。"},{"en":"As a manager, she felt the heftiness of the decisions she had to make.","zh":"作为经理，她感到自己必须做的决定分量很重。"}]}],"synonyms":["heaviness","weight","bulk","solidity","substance"],"phonetic":"/ˈhɛf.ti.nəs/","extraExplanation":["“heftiness”来自动词“heft”（掂量、用手估重量；也可指重物本身）。因此它既可指真实的重量，也常引申为“有分量、够扎实、够有力”。在日常英语里，“hefty”更常见（如 a hefty price/meal/fine 表示“很高/很大”），而“heftiness”偏书面或用于强调“分量感”。"]}
{"word":"hefting","summary":{"en":"Hefting means lifting something to feel or test its weight (and sometimes carrying it).","zh":"hefting 指把物体举起或掂起以感受/测试它的重量（有时也指搬运）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"lifting or picking something up, especially to feel or test its weight; also carrying something heavy.","zh":"（尤指为感受或测试重量而）举起、掂起；也可指搬运沉重物品。"},"examples":[{"en":"Hefting the suitcase, she realized it was too heavy to carry alone.","zh":"她掂了掂行李箱，才发现它太重了，一个人搬不动。"},{"en":"The shopkeeper was hefting melons to choose the ripest one.","zh":"店主掂着西瓜（或甜瓜）来挑选最成熟的那个。"},{"en":"They were hefting sandbags to build a flood barrier.","zh":"他们在搬运沙袋来修筑防洪堤。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of lifting something to judge its weight (used as a noun, often in writing).","zh":"（作名词，多见于书面语）掂量重量的动作。"},"examples":[{"en":"With a quick hefting of the box, he guessed it weighed about ten pounds.","zh":"他快速掂了一下箱子，估计大约有十磅重。"}]}],"synonyms":["lifting","hoisting","picking up","weighing (in the hand)","lugging"],"phonetic":"/ˈhɛftɪŋ/","extraExplanation":["“hefting”来自动词“heft”，核心感觉是“用手掂一掂、试试分量”。在日常口语里也常用更直接的说法，如“lift it”或“pick it up”，但“heft”更强调“判断重量”的动作。","写作中常搭配“hefting + 名词”（hefting the bag/box/stone），营造一种“沉甸甸、需要用力”的画面感。"]}
{"word":"hefts","summary":{"en":"“Hefts” is the plural of the noun “heft” (weight/feel of heaviness) or the third-person singular of the verb “heft” (to lift or test the weight of something).","zh":"“hefts”既可以是名词“heft”的复数（重量/分量），也可以是动词“heft”的第三人称单数（举起或掂量重量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) The weight or heaviness of something; how heavy it feels when you hold or lift it.","zh":"（名词）重量；分量；（拿起时感觉到的）沉重感。"},"examples":[{"en":"This camera has a surprising heft for its size.","zh":"这台相机体积不大，却有种出乎意料的分量。"},{"en":"I like tools with a little heft—they feel sturdy.","zh":"我喜欢有点分量的工具——感觉更结实。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb) To lift or carry something heavy (often to test its weight).","zh":"（动词）举起或搬起（较重的东西）；（常指）掂量重量。"},"examples":[{"en":"She hefts the suitcase to see if she can carry it alone.","zh":"她掂了掂箱子，看能不能自己搬。"},{"en":"He hefts the box onto the table with both hands.","zh":"他双手把箱子搬到桌上。"}]}],"synonyms":["weight","heaviness","mass","lift","hoist","weigh (up)"],"phonetic":"/hɛft/","extraExplanation":["“Heft”常带有“用手掂一掂、感受分量”的画面感；比起单纯的“weight”，更强调拿起来时的体感。","词源上与英格兰北部/苏格兰方言有关，带有较口语、朴实的色彩。"]}
{"word":"hefty","summary":{"en":"Hefty means big and heavy, or large in amount (like a hefty fine), and sometimes strong and solid.","zh":"Hefty 指“又大又重”，也可指“数量/金额很大”（如 hefty fine），有时也表示“强壮结实”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Large and heavy; difficult to lift or carry because of weight or size.","zh":"又大又重的；因重量或体积而难以搬动的。"},"examples":[{"en":"He carried a hefty backpack up the stairs.","zh":"他背着一个又大又重的背包上楼。"},{"en":"The package looks hefty—do you need help lifting it?","zh":"这个包裹看起来很重——需要我帮你抬吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Large in amount; unusually big (often about money, numbers, or effort).","zh":"（数量、金额、力度等）很大的；相当可观的。"},"examples":[{"en":"They paid a hefty fine for parking illegally.","zh":"他们因违章停车被罚了一大笔钱。"},{"en":"Finishing the project on time took a hefty amount of work.","zh":"按时完成这个项目需要付出很大的工作量。"}]},{"partOfSpeech":"adj.","definition":{"en":"Strong and solid; built in a powerful or sturdy way (often describing a person or body).","zh":"强壮结实的；体格健壮的（常形容人）。"},"examples":[{"en":"The team needs a hefty defender who can block shots.","zh":"球队需要一个强壮的防守队员来封堵射门。"},{"en":"He’s a hefty guy, so the job suits him.","zh":"他身材壮实，所以这份工作挺适合他。"}]}],"synonyms":["heavy","weighty","bulky","substantial","sizeable","sturdy"],"phonetic":"/ˈhɛfti/","extraExplanation":["“Hefty”在语气上通常是中性的，强调“分量/规模大”。形容罚款（a hefty fine）、加薪（a hefty raise）、价格（a hefty price tag）时，常带一点“令人吃不消、很夸张”的感觉。","与“heavy”相比：heavy更直接指“重量重”；hefty更常包含“体积大/数量大/力度大”的综合印象，也更常用于金额、工作量等抽象意义。"]}

