{"word":"hegari","summary":{"en":"Hegari: (rare) relating to the Hegira/Hijra or to the Islamic calendar counted from it (A.H.).","zh":"hegari：（罕见）与“迁徙”(Hegira/Hijra)有关，或指以其为纪元的伊斯兰历/回历（A.H.）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; often a misspelling of “Hegira/Hijra”) relating to the Hegira (Muhammad’s migration from Mecca to Medina in 622 CE) or to the Islamic calendar counted from that event (A.H.).","zh":"（较少见；常被当作 “Hegira/Hijra” 的误拼）与“迁徙”（公元622年穆罕默德从麦加迁往麦地那）有关；或指以该事件为纪元的伊斯兰历（回历，A.H.）。"},"examples":[{"en":"The manuscript is dated in a Hegari (A.H.) year rather than in the Gregorian calendar.","zh":"这份手稿的纪年使用回历（A.H.）而不是公历。"},{"en":"Some older English histories use Hegari-style dating when discussing early Islamic events.","zh":"一些较早的英文史书在讨论伊斯兰早期事件时会使用回历式纪年。"}]}],"synonyms":["Hegirian","Hijri","Islamic (calendar)"],"phonetic":"/həˈdʒaɪrə/","extraExplanation":["“hegari”并不是现代英语里常见、标准的拼写。你更可能想查的是 **Hegira**（也常写作 **Hijra**，指“迁徙”事件）以及与纪年相关的表达 **Anno Hegirae (A.H.)**，意为“自迁徙纪年”。","在文学/历史写作中，提到“the Hegira”通常特指那次历史事件；而写到日期时常见“A.H. 1445”这类格式（回历年份）。"]}
{"word":"hegaris","summary":{"en":"“Hegira” (often linked to “Hijra”) is best known as Muhammad’s 622 CE migration from Mecca to Medina, the starting point of the Islamic calendar; it can also mean a major departure or migration in a literary sense.","zh":"“Hegira”（常与“Hijra/希吉拉”相关）最常指公元622年穆罕默德从麦加到麦地那的迁徙，是伊斯兰历的起点；也可引申指重要的离开或迁徙（文学/正式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “Hegira” or “Hijra”) the migration of the Prophet Muhammad from Mecca to Medina in 622 CE; this event marks the start of the Islamic calendar.","zh":"（多半是指 “Hegira / Hijra”）公元622年穆罕默德从麦加迁徙到麦地那的事件；伊斯兰历以此为起点。"},"examples":[{"en":"The Islamic calendar begins with the Hegira in 622 CE.","zh":"伊斯兰历以公元622年的“希吉拉/迁徙”（Hegira）为起点。"},{"en":"Some history books refer to dates as “AH,” meaning “Anno Hegirae” (after the Hegira).","zh":"一些历史书会用“AH”来标注年代，意思是“希吉拉之后”（Anno Hegirae）。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, formal/literary) a departure or migration from one place to another, especially for safety, freedom, or a new start.","zh":"（引申义，较正式/文学）离开原地、迁移到别处，尤指为安全、自由或重新开始而迁徙。"},"examples":[{"en":"For many families, leaving the war zone felt like a personal hegira.","zh":"对许多家庭来说，离开战区就像一次个人的“出走/迁徙”（hegira）。"},{"en":"The novel describes a hegira from the city to the countryside.","zh":"这部小说描写了从城市到乡村的迁徙。"}]}],"synonyms":["Hijra","migration","exodus","departure"],"phonetic":"/həˈdʒaɪrə/","extraExplanation":["“Hegira”源自阿拉伯语“Hijra（هِجْرَة）”，在英语历史语境中常写作 Hegira。该事件不仅是一次地理迁徙，也象征早期伊斯兰社群的建立，因此在宗教与历史叙述中意义重大。","你输入的“hegaris”不是常见英语词；如果你指的是人名、地名或其他语言的词，请告诉我上下文（句子/语言/出处），我可以更准确地解释。"]}
{"word":"hegelian","summary":{"en":"Hegelian means “related to Hegel or his dialectical philosophy,” and it can also mean “a follower of Hegel.”","zh":"Hegelian 指“与黑格尔或其辩证哲学有关的”，也可指“黑格尔哲学的追随者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the German philosopher G. W. F. Hegel or to his philosophy, especially the idea that history and ideas develop through conflict and resolution (often described as “dialectic”).","zh":"与德国哲学家黑格尔（G. W. F. Hegel）或其哲学有关的；尤指认为历史与思想会通过矛盾冲突与解决而发展（常被称为“辩证法”）的。"},"examples":[{"en":"A Hegelian reading of the novel focuses on how opposing forces drive the plot forward.","zh":"对这部小说作黑格尔式解读，会着重讨论对立力量如何推动情节发展。"},{"en":"Some historians use a Hegelian view of progress to explain major social changes.","zh":"一些历史学家用黑格尔式的“进步观”来解释重大的社会变迁。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows or strongly supports Hegel’s philosophy.","zh":"黑格尔哲学的追随者；黑格尔派人士。"},"examples":[{"en":"In graduate school, she became a Hegelian and debated Kant with her classmates.","zh":"在研究生阶段，她成了黑格尔派，并与同学辩论康德哲学。"},{"en":"The seminar included Marxists, Hegelians, and other thinkers.","zh":"这场研讨课里有马克思主义者、黑格尔派人士以及其他思想流派的人。"}]}],"synonyms":["Hegel-related","dialectical (in a Hegelian sense)","Hegelianist"],"phonetic":"/hɪˈɡiːliən/","extraExplanation":["“Hegelian”常出现在哲学、政治理论、文学批评与历史书写中。学习时可以把它理解为一种强调“发展/变化”的视角：事物在对立与张力中推进，旧的阶段被“扬弃”（既否定又保留地超越）到新的阶段。","在文化语境里，人们常用“thesis–antithesis–synthesis（正—反—合）”来概括黑格尔式辩证法，但严格来说这是后人更通俗的总结，不一定完全等同于黑格尔原文表述。","相关常见搭配：Hegelian dialectic（黑格尔辩证法）、Hegelian idealism（黑格尔唯心主义）、Hegelian logic（黑格尔逻辑）。"]}
{"word":"hegelianism","summary":{"en":"Hegelianism is a philosophy (or way of thinking) based on Hegel, emphasizing historical development through contradictions and their resolution.","zh":"黑格尔主义是基于黑格尔思想的哲学（或思维方式），强调历史在矛盾冲突与解决中发展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a philosophy based on Georg Wilhelm Friedrich Hegel’s ideas, especially the view that history and human thought develop through conflict and resolution (often described as a dialectical process).","zh":"黑格尔主义：以德国哲学家黑格尔（G. W. F. Hegel）的思想为基础的哲学体系，尤其强调历史与思想通过矛盾冲突与解决而发展（常被描述为“辩证过程”）。"},"examples":[{"en":"Marx both learned from and argued against Hegelianism.","zh":"马克思既从黑格尔主义中学习，也对其提出了批判。"},{"en":"Some literary critics use Hegelianism to discuss how social conflicts shape culture.","zh":"一些文学批评家用黑格尔主义来讨论社会冲突如何塑造文化。"}]},{"partOfSpeech":"n.","definition":{"en":"the influence of Hegel’s style of thinking in politics, art, or academic theory.","zh":"黑格尔主义思维的影响：指黑格尔式思考方式在政治、艺术或学术理论中的体现与影响。"},"examples":[{"en":"You can see traces of Hegelianism in his writing about progress and history.","zh":"你能在他关于进步与历史的写作中看到黑格尔主义的痕迹。"},{"en":"The debate turned into a clash between Hegelianism and more empirical approaches.","zh":"这场辩论变成了黑格尔主义与更偏经验主义方法之间的冲突。"}]}],"synonyms":["Hegelian philosophy","Hegel’s philosophy","German idealism (related)"],"phonetic":"/hɪˈɡiːliənɪzəm/","extraExplanation":["“Hegelianism”常与“dialectic（辩证法）”一起出现，但日常学习时不必死记“正题-反题-合题”的固定公式；更重要的是理解：观点/制度会在矛盾推动下变化、更新，并在更高层次达成暂时的统一。","在英美学术语境里，它常见于哲学、政治理论、历史理论与文学批评；写作中多用于概括某种“把历史看成有内在发展逻辑”的立场。","相关词：Hegelian（adj./n. 黑格尔的；黑格尔主义者）；post-Hegelian（后黑格尔主义的）；German idealism（德国观念论）。"]}
{"word":"hegelianize","summary":{"en":"To hegelianize means to interpret or reshape something according to Hegel’s philosophy.","zh":"hegelianize 指用黑格尔哲学来解读或改造某事物，使其带有黑格尔思想色彩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something Hegelian, or to interpret/explain it using the ideas of the German philosopher G. W. F. Hegel (especially history and society as developing through conflict and change)","zh":"使某事物带有黑格尔哲学色彩；或用德国哲学家黑格尔（Hegel）的思想来解读/解释某事（常指用其观点理解历史、社会的发展与变化）"},"examples":[{"en":"Some critics say the author tries to hegelianize modern politics, treating every debate as a stage of historical development.","zh":"一些评论家说作者试图把现代政治“黑格尔化”，把每一次争论都当作历史发展中的一个阶段。"},{"en":"It’s tempting to hegelianize the story, but the characters’ choices are more personal than philosophical.","zh":"人们很容易用黑格尔的方式来解读这个故事，但角色的选择更多是个人性的，而非哲学性的。"}]},{"partOfSpeech":"vi.","definition":{"en":"to think or write in a strongly Hegel-influenced way","zh":"以强烈受黑格尔影响的方式思考或写作"},"examples":[{"en":"In his early essays, he tends to hegelianize, turning social problems into abstract philosophical arguments.","zh":"在他早期的文章里，他常常会“黑格尔化”地思考，把社会问题变成抽象的哲学论证。"}]}],"synonyms":["interpret through Hegel","make Hegelian","philosophize (in a Hegelian way)"],"phonetic":"/hɪˈɡiːliənaɪz/","extraExplanation":["“Hegelianize”来自“Hegel + -ian + -ize”，意思是“使之成为/带有……特征”。英语里这种构词法常用于学术或评论语境（如“modernize”“Americanize”）。","黑格尔常与“辩证法（dialectic）”联系在一起：用矛盾、对立与发展来理解观念或历史的变化。实际使用中，“hegelianize”有时带一点批评意味，暗示把问题解释得过于宏大或抽象。","该词较少出现在日常口语，更常见于哲学、文学评论、政治理论等写作中。"]}
{"word":"hegelizer","summary":{"en":"A (rare) term for someone who interprets things through Hegelian philosophy.","zh":"（较少见）指用黑格尔哲学框架来解读或解释事物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who applies, interprets, or explains ideas using Hegel’s philosophy (Hegelian concepts), often in an academic or theoretical way","zh":"用黑格尔哲学（黑格尔式概念）来分析、解释或阐述思想的人；黑格尔化解读者"},"examples":[{"en":"Some critics say the article is too abstract, written for Hegelizers rather than general readers.","zh":"有些评论家说这篇文章太抽象，更像是写给黑格尔化解读者看的，而不是给普通读者。"},{"en":"He’s a talented Hegelizer, but his writing can feel heavy with jargon.","zh":"他很擅长用黑格尔式框架解读问题，但他的写作有时会充满术语，读起来比较沉重。"}]}],"synonyms":["Hegelian","Hegelian thinker","Hegel scholar"],"phonetic":"/ˈheɪɡəlaɪzər/","extraExplanation":["“Hegelizer”比较少见，多出现在学术批评或思想史讨论中，带一点评价色彩：可能是中性（擅长黑格尔式解读），也可能是轻微贬义（过度玄学化、喜欢把问题套进辩证法框架）。","相关基础：黑格尔（G. W. F. Hegel）是德国哲学家，常与“辩证法”“精神（Geist）”“历史发展”等主题联系在一起；因此“to Hegelize / Hegelizer”常暗示用宏大、抽象、历史-辩证的方式来解释事物。"]}
{"word":"hegemon","summary":{"en":"A hegemon is a dominant leader or power that strongly influences others, especially a country in international politics.","zh":"hegemon 指“霸权者/主导力量”，尤指在国际政治中对他国有强大影响或控制力的强国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a leader or dominant power (especially a country) that strongly influences or controls others","zh":"霸权者；支配性强国（尤指在政治、经济或军事上对他国有强大影响或控制力的国家/力量）"},"examples":[{"en":"After the war, the country became the region’s hegemon and shaped trade rules.","zh":"战后，这个国家成了该地区的霸权者，并主导了贸易规则。"},{"en":"Some smaller states resisted the hegemon’s demands for military bases.","zh":"一些小国反对霸权国家要求设立军事基地。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or organization that is the most powerful and influential in a system or field","zh":"在某个体系或领域中最强势、最有影响力的个人/团体/组织"},"examples":[{"en":"For years, one company was the hegemon of the smartphone market.","zh":"多年来，一家公司一直是智能手机市场的霸主。"},{"en":"In the story, the school’s social hegemon decides what is “cool.”","zh":"在故事里，学校里的“社交霸主”决定什么才算“酷”。"}]}],"synonyms":["dominant power","superpower","leader","ruler","overlord"],"phonetic":"ˈhɛdʒəˌmɑn","extraExplanation":["“hegemon”常出现在国际关系与政治学语境里，搭配最常见的是“regional hegemon（地区霸权）”“global hegemon（全球霸权）”。对应的抽象名词是“hegemony（霸权）”。","语感上，“hegemon”在很多新闻或学术写作中带有批评或警惕色彩，暗示一种不平等的支配关系；如果只是中性地说“领先者/主导者”，也可用“leading power / dominant power”。","词源来自希腊语，原意与“领袖、统帅”相关；在历史与文学性写作中，有时会用来指某个时代的“主导国家/势力”。"]}
{"word":"hegemonic","summary":{"en":"“Hegemonic” means dominant or controlling, especially about power and influence in politics, culture, or economics.","zh":"“hegemonic”意为“支配性的、霸权的”，常用于描述在政治、文化或经济领域占主导地位的力量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having dominant power or influence over others, especially in politics, culture, or economics.","zh":"（尤指在政治、文化或经济上）拥有支配性权力或影响力的；霸权的。"},"examples":[{"en":"The country’s hegemonic role in the region shaped trade and security policies.","zh":"这个国家在该地区的霸权地位影响了贸易与安全政策。"},{"en":"Some critics argue that global media spreads a hegemonic culture.","zh":"一些批评者认为全球媒体传播了一种霸权文化。"}]}],"synonyms":["dominant","controlling","predominant","supreme"],"phonetic":"/ˌhɛdʒəˈmɑnɪk/","extraExplanation":["“hegemonic”来自“hegemony（霸权）”。它常出现在国际关系、历史与社会学讨论中：例如“hegemonic power（霸权国家/霸权强国）”“hegemonic order（霸权秩序）”。\n在学术语境里也常见“cultural hegemony（文化霸权）”，常与意大利思想家葛兰西（Gramsci）的观点相关：主导群体不只靠武力或法律，也通过教育、媒体与日常观念让自己的价值观显得“理所当然”。\n语气上，“hegemonic”往往带批判或警惕色彩，但在中性学术写作中也可仅表示“主导的/占优势的”。"]}
{"word":"hegemonical","summary":{"en":"Hegemonical means “dominant in a way that controls others,” especially in politics or culture; “hegemonic” is more common.","zh":"hegemonical 指“具有霸权性质、强势支配他者的”，多用于政治或文化语境；更常见的说法是 hegemonic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a country, group, or idea) having strong dominance or leadership over others, often in politics, culture, or economics.","zh":"（国家、集团或思想）具有霸权性质的；对他者拥有强势支配或主导地位的（常用于政治、文化或经济领域）。"},"examples":[{"en":"Some critics argue that the company’s hegemonical influence limits competition.","zh":"一些批评者认为，这家公司带有霸权性质的影响力限制了竞争。"},{"en":"The novel explores how a hegemonical empire controls smaller nations through trade and military power.","zh":"这部小说探讨了一个霸权帝国如何通过贸易和军事实力控制较小国家。"}]}],"synonyms":["hegemonic","dominant","overbearing","imperial","supremacist"],"phonetic":"/ˌhɛdʒəˈmɑnɪkəl/","extraExplanation":["“hegemonical”常见于学术或新闻语境，更常用的同义表达是“hegemonic”。两者意思接近，但“hegemonic”在现代英语里更自然、更常见。","词根来自希腊语，和“hegemony（霸权、领导权）”同源。讨论国际关系时常见搭配：hegemonic power（霸权国家/霸权力量）、cultural hegemony（文化霸权）。","语气提醒：它通常带有批判或负面色彩，暗示“不公平的支配/压制”，使用时注意语境。"]}
{"word":"hegemonies","summary":{"en":"Hegemonies are forms of dominant leadership or control—often political or cultural—held by one power over others.","zh":"hegemonies 指一种或多种“霸权/支配性领导”，可指政治霸权，也可指文化霸权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dominant leadership or control by one country, group, or class over others (often in politics or international relations).","zh":"（常用于政治或国际关系）一个国家、团体或阶层对其他者的支配性领导或控制。"},"examples":[{"en":"After the war, rival powers competed for regional hegemonies.","zh":"战后，对立的大国争夺地区霸权。"},{"en":"Many people worry that economic hegemonies can limit smaller countries’ choices.","zh":"许多人担心经济霸权会限制小国的选择。"},{"en":"The book examines how old hegemonies rise and fall over time.","zh":"这本书探讨旧霸权如何随着时间兴衰更替。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong cultural influence that becomes “normal” or taken for granted, shaping what people see as common sense.","zh":"强势的文化影响力，被视为“理所当然”，进而塑造人们对常识与正常的认知。"},"examples":[{"en":"Hollywood has contributed to cultural hegemonies in global entertainment.","zh":"好莱坞推动了全球娱乐领域的文化霸权。"},{"en":"The class discussed how media can support hegemonies without using force.","zh":"课堂讨论了媒体如何在不使用武力的情况下维系霸权。"}]}],"synonyms":["dominance","leadership","supremacy","ascendancy","control"],"phonetic":"/hɪˈdʒɛməniz/","extraExplanation":["“hegemony”的词源来自希腊语，原意是“领导、统率”。在国际关系里常译作“霸权”；在社会理论（如葛兰西 Gramsci）中常指“文化霸权”，强调通过教育、媒体与价值观让支配关系看起来很自然。","形式上，“hegemonies”是复数，表示多个不同的霸权（例如不同地区、不同时期或不同领域的霸权）。"]}
{"word":"hegemonist","summary":{"en":"A hegemonist is someone (or a country) that seeks dominant power over others; it can also describe domination-seeking policies.","zh":"hegemonist 指谋求支配他者的个人或国家（常带贬义），也可形容具有霸权倾向的政策或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, country, or group that seeks to dominate others and lead or control a region or the world (often used critically).","zh":"（常带贬义）企图支配他国/他人、谋求地区或全球主导地位的人、国家或集团；霸权主义者。"},"examples":[{"en":"Some critics called the superpower a hegemonist for trying to control smaller countries.","zh":"一些批评者称这个超级大国为霸权主义者，因为它试图控制较小的国家。"},{"en":"The article warns that hegemonists may use economic pressure instead of military force.","zh":"这篇文章警告说，霸权主义者可能会用经济施压而不是军事力量。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or showing a desire to dominate others; hegemonic.","zh":"与谋求支配他国/他人有关的；具有霸权倾向的。"},"examples":[{"en":"They criticized the policy as hegemonist and unfair to neighboring states.","zh":"他们批评这项政策具有霸权倾向，对邻国不公平。"},{"en":"The speech used strong language against hegemonist behavior.","zh":"这次演讲用强烈措辞反对霸权行为。"}]}],"synonyms":["dominant power","imperialist","hegemon","霸权主义者（中文对应）"],"phonetic":"/hɪˈdʒɛmənɪst/","extraExplanation":["“hegemonist”多见于政治、国际关系语境，语气往往偏批判；日常英语中更常用“hegemonic”（形容词）或“hegemony / hegemonism”（名词）。","词根来自“hegemony（霸权、领导权）”，与希腊语中“领导、统治”的含义相关。"]}
{"word":"hegemonistic","summary":{"en":"Hegemonistic means seeking dominance or control, especially in politics or international relations.","zh":"hegemonistic 指“霸权主义的”，尤用于政治与国际关系中，表示企图支配与控制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trying to control other countries, groups, or people by being the strongest or most powerful; showing a desire for domination.","zh":"霸权主义的；企图凭借强势力量控制、支配他国/他人或他方的。"},"examples":[{"en":"Many smaller countries criticized the superpower’s hegemonistic policies.","zh":"许多小国批评这个超级大国的霸权主义政策。"},{"en":"The speech warned against hegemonistic behavior in international relations.","zh":"这篇讲话警告在国际关系中要警惕霸权主义行为。"}]}],"synonyms":["hegemonic","dominant","imperialistic","domineering"],"phonetic":"/ˌhɛdʒəˈmɑːnɪstɪk/","extraExplanation":["“hegemonistic”常用于政治、国际关系语境，语气通常偏负面，强调“以强凌弱、主导他人”的倾向。日常生活里更常用“domineering / controlling”来形容个人。","词根来自“hegemony（霸权、领导权）”。在学术或新闻中也常见“hegemonic（霸权的；主导的）”，比“hegemonistic”更常用。"]}
{"word":"hegemonizer","summary":{"en":"A hegemonizer is someone or something that promotes dominance and tries to make one side hegemonic.","zh":"hegemonizer 指推动或制造支配地位、使某一方形成霸权的人或力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, group, or force that tries to make itself (or one side) dominant over others; someone who promotes or creates hegemony","zh":"试图让自己（或某一方）支配他人的人、团体或力量；推行或制造“霸权/主导地位”的一方"},"examples":[{"en":"Some critics describe the empire as a hegemonizer that reshaped trade rules to benefit itself.","zh":"一些批评者把那个帝国称为“霸权推动者”，认为它重塑贸易规则以利于自身。"},{"en":"In the debate, he warned that the superpower could become a hegemonizer in the region.","zh":"在辩论中，他警告那个超级大国可能会成为该地区的霸权推行者。"}]}],"synonyms":["dominant power","hegemonic power","would-be hegemon","overlord (literary/strong)","dominator"],"phonetic":"/ˈhɛdʒəˌmɑːnˌaɪzər/","extraExplanation":["这个词在日常英语中不常见，更常见的表达是 hegemonic power（霸权力量/主导力量）、dominant power（主导势力）或 would-be hegemon（潜在霸主）。","构词法：hegemonizer = hegemonize（使形成霸权、使支配）+ -er（做某事的人/事物）。相关名词是 hegemony（霸权、主导地位）。","语域与语气：多出现在政治学、国际关系、批评性写作中，往往带有批判意味（暗示强势一方在“推动支配”）。"]}
{"word":"hegemony","summary":{"en":"Hegemony means the dominant leadership or controlling influence of one power over others.","zh":"Hegemony 指某一方对其他方的主导领导或控制性影响（霸权）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"leadership or dominance of one country, group, or class over others, especially in politics, the economy, or culture","zh":"（尤指在政治、经济或文化方面）一个国家、群体或阶级对其他者的领导/支配地位（霸权）"},"examples":[{"en":"Some countries worry about the hegemony of a single superpower.","zh":"一些国家担心某个超级大国的霸权。"},{"en":"The debate focused on cultural hegemony in films and social media.","zh":"这场讨论聚焦于电影和社交媒体中的文化霸权。"},{"en":"After the war, the region fell under the hegemony of the strongest state.","zh":"战争后，该地区落入最强国家的霸权之下。"}]}],"synonyms":["dominance","supremacy","leadership","control"],"phonetic":"/hɪˈdʒɛməni/","extraExplanation":["“hegemony”常出现在国际关系、政治学与批判理论语境中。它不仅指“军事或经济上的强势”，也常指通过规则、价值观、教育、媒体等方式，让别的国家或群体“自然而然地接受”某种主导地位。","词源来自希腊语，原意与“领导、统治”相关。在学术写作中常见搭配有：global/regional hegemony（全球/地区霸权）、cultural hegemony（文化霸权）、U.S./Western/Chinese hegemony（美国/西方/中国霸权，视语境而定）。","在文学与社会评论中，讨论“hegemony”时常会提到意大利思想家葛兰西（Gramsci）提出的“文化霸权”概念：统治力量通过文化与常识来获得认同，而不只靠强制。"]}
{"word":"hegira","summary":{"en":"Hegira means Muhammad’s historic migration from Mecca to Medina in 622 CE, and by extension any major flight or migration to escape danger.","zh":"Hegira 指穆罕默德于公元622年从麦加迁徙到麦地那的历史事件；也可引申为为避险而进行的大规模出走或迁移。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Prophet Muhammad’s migration from Mecca to Medina in 622 CE, an event that marks the start of the Islamic calendar","zh":"（伊斯兰史）先知穆罕默德于公元622年从麦加迁徙到麦地那；这一事件也被视为伊斯兰历的起点"},"examples":[{"en":"The Hegira in 622 CE is a key turning point in early Islamic history.","zh":"公元622年的“希吉拉”（迁徙）是早期伊斯兰历史中的关键转折点。"},{"en":"Many textbooks note that the Islamic calendar begins with the Hegira.","zh":"许多教科书会指出，伊斯兰历以“希吉拉”（迁徙）为起点。"}]},{"partOfSpeech":"n.","definition":{"en":"a departure or migration, especially one made to escape danger or persecution","zh":"（引申）出走；迁移；尤指为躲避危险或迫害而离开"},"examples":[{"en":"After the violence, the community began a hegira to safer towns.","zh":"暴力事件之后，这个社群开始迁往更安全的城镇。"},{"en":"Writers sometimes use “hegira” to describe an artist’s move away from a restrictive environment.","zh":"作家有时用“hegira”来形容艺术家逃离束缚性环境的迁居。"}]}],"synonyms":["Hijra","migration","exodus","flight","departure"],"phonetic":"/həˈdʒaɪrə/","extraExplanation":["“Hegira”也常写作“Hijra”（更贴近阿拉伯语转写），在学术或新闻语境中两种拼写都能见到，但“Hegira”更偏传统英语写法。","它不仅是一次地理上的迁移，也象征早期穆斯林社群的建立与政治、社会地位的转变，因此在历史叙述中常带有重要的宗教与文化意义。"]}
{"word":"hegiras","summary":{"en":"Hegira(s) refers mainly to Muhammad’s 622 migration from Mecca to Medina (start of the Islamic calendar), and more broadly to a mass departure or exodus.","zh":"hegira(s)主要指公元622年穆罕默德从麦加迁徙至麦地那（伊斯兰历起点）；也可泛指大量离开或迁徙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam, history) the Prophet Muhammad’s journey (migration) from Mecca to Medina in AD 622, marking the beginning of the Islamic calendar.","zh":"（伊斯兰/历史）指穆罕默德先知于公元622年从麦加迁徙到麦地那的事件；也是伊斯兰历的纪元起点。"},"examples":[{"en":"The Hijra (or hegira) in 622 CE marks the start of the Islamic calendar.","zh":"公元622年的“希吉拉”（也拼作hegira）标志着伊斯兰历的开始。"},{"en":"Many history books describe the hegira as a turning point for the early Muslim community.","zh":"许多历史书把“希吉拉/迁徙”描述为早期穆斯林共同体的转折点。"}]},{"partOfSpeech":"n.","definition":{"en":"a departure, escape, or mass migration away from a place (used more broadly and often figuratively).","zh":"（引申义）离开、出走、逃离；（常指大量的）迁徙（也可作比喻用法）。"},"examples":[{"en":"After the factory closed, there was a hegira of workers to bigger cities.","zh":"工厂关闭后，工人们大量外流到更大的城市。"},{"en":"The new rules caused a hegira from the platform to other apps.","zh":"新规定引发了用户从该平台“出走”到其他应用。"}]}],"synonyms":["Hijra","exodus","migration","departure","flight"],"phonetic":"/hɪˈdʒaɪrə/","extraExplanation":["“hegira”是英语中较传统的拼写，源自阿拉伯语“Hijra”（也常见拼写hijra）。在现代英文中，学术与新闻语境更常用“Hijra/Hijrah”。","伊斯兰历（A.H., Anno Hegirae，“在迁徙之后”）以希吉拉为纪元起点。由于伊斯兰历是阴历（更准确说是纯阴历），其年份与公历并不一一对应。"]}
{"word":"hegumen","summary":{"en":"A hegumen is the head of an Eastern Orthodox monastery (similar to an abbot).","zh":"hegumen 指东正教修道院的院长／住持（类似 abbot）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The head (abbot) of a monastery in the Eastern Orthodox tradition.","zh":"（东正教传统中）修道院的院长／住持（相当于西方修道院的 abbot）。"},"examples":[{"en":"The hegumen welcomed the pilgrims and offered them bread and tea.","zh":"这位修道院住持接待了朝圣者，并为他们提供了面包和茶。"},{"en":"In the Orthodox Church, a hegumen may oversee the daily life of a monastery.","zh":"在东正教中，修道院住持可能负责管理修道院的日常生活。"}]}],"synonyms":["abbot","superior","monastic leader"],"phonetic":"/ˈhɛɡjəmən/","extraExplanation":["“hegumen”主要用于东正教（Eastern Orthodox）语境，常见于谈论俄罗斯、希腊、乌克兰等地的修道传统。英文里也常见拼写变体 **hegumen** / **hegumenos**（更贴近希腊语原形）。","词源来自希腊语 *hēgoumenos*，意为“带领的人／领导者”。在西方基督宗教语境里更常用 **abbot**；但在描述东正教修院时，用 **hegumen** 更准确、更有文化指向。"]}
{"word":"hegumene","summary":{"en":"A hegumenē is the abbess (female head) of an Eastern Orthodox convent/monastery.","zh":"hegumenē 指东正教女修道院的女院长（女上级）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the head (abbess) of a convent in the Eastern Orthodox tradition; a female superior of an Orthodox monastery","zh":"（东正教传统中）女修道院的院长；东正教女修道院的女上级（相当于“女院长/女住持”）"},"examples":[{"en":"The nuns met with the hegumenē to discuss the community’s schedule.","zh":"修女们与女院长（hegumenē）会面，讨论团体的作息安排。"},{"en":"In some Orthodox monasteries, the hegumenē guides both spiritual life and daily work.","zh":"在一些东正教修道院里，女院长（hegumenē）既指导灵修生活，也管理日常事务。"}]}],"synonyms":["abbess","prioress (approx.)","mother superior (approx.)"],"phonetic":"/ˌhɛɡjuˈmɛni/","extraExplanation":["词源来自希腊语 hēgoumenē，意为“女领袖/女带领者”。对应的男性头衔常见为 hegumen（或希腊语形式 hegoumenos），中文有时也译作“修道院院长/住持”。","该词主要用于东正教（Eastern Orthodox）语境；在天主教更常见的说法是 abbess（女院长）或 prioress（女副院长/女会长，视修会制度而定）。","英语里常见两种拼写：hegumene 与带重音符号的 hegumenē（表示末尾元音更接近“eh/ee”的感觉）。"]}
{"word":"hegumenes","summary":{"en":"Hegumenes = heads (abbots) of Eastern Orthodox monasteries (plural).","zh":"Hegumenes 指东正教修道院的院长（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hegumen: the head(s) of an Eastern Orthodox monastery; an abbot (often used for men, but sometimes also for women’s communities).","zh":"hegumen 的复数：东正教修道院的院长；相当于“（东正教）修道院院长/方丈”（多用于男性修院，也有时用于女性团体）。"},"examples":[{"en":"The monastery was led by two hegumenes over the course of the century.","zh":"这个修道院在一个世纪里先后由两位 hegumenes（修道院院长）领导。"},{"en":"In some Eastern Orthodox traditions, the hegumenes are responsible for both spiritual guidance and daily administration.","zh":"在一些东正教传统中，hegumenes 既负责灵性指导，也负责日常管理。"}]}],"synonyms":["abbots","monastic superiors"],"phonetic":"/ˌhɛɡ.juːˈmiːnz/","extraExplanation":["“Hegumen”来自希腊语词根（与“领导、引导”有关），在东正教语境里相当于西方修道传统中的“abbot（男修院院长）”。","拼写提示：单数常见为 hegumen / hegumenos；复数写作 hegumenes（读法接近“heh-GOO-menz”）。","这个词多见于宗教史、拜占庭史、东欧与中东地区的东正教相关写作中；日常英语里比较少用。"]}
{"word":"hegumeness","summary":{"en":"A hegumeness is the woman in charge of an Eastern Orthodox convent (like an abbess).","zh":"hegumeness 指东正教女修道院的女院长（类似 abbess）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who is the head of an Eastern Orthodox convent or monastery; the female equivalent of a hegumen (similar to an abbess).","zh":"（东正教）女修道院院长；女院长（相当于男性的 hegumen，类似于“女修道院院长/abbess”）。"},"examples":[{"en":"In the Orthodox convent, the hegumeness guided the nuns’ daily schedule of prayer and work.","zh":"在那座东正教女修道院里，女院长安排并带领修女们每日的祈祷与劳作。"},{"en":"The pilgrims asked to speak with the hegumeness about the monastery’s rules.","zh":"朝圣者请求与女院长交谈，了解修道院的规章。"}]}],"synonyms":["abbess","mother superior","prioress"],"phonetic":"/ˈhɛɡjʊməˌnɛs/","extraExplanation":["“hegumeness”较少见，更多情况下你会在英文里看到“abbess”（女修道院院长）或在东正教语境中用“hegumen”（多指男性院长）。在涉及东正教修道传统的历史、传记或宗教研究文本中更常出现。","词源上与希腊语中表示“带领、引导”的词根有关，因此这个头衔强调“带领修道团体的灵修与生活秩序”。"]}
{"word":"hegumenies","summary":{"en":"Hegemony means dominance or leading power over others, especially by a country or group; it can also mean cultural or ideological dominance.","zh":"hegemony 指对他者的支配/主导地位（尤指国家或集团的政治军事霸权），也可指文化或意识形态上的主导。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"leadership or dominance of one country, group, or class over others, especially in politics or the military","zh":"（尤指政治或军事上的）霸权；主导地位；一个国家/集团/阶层对其他者的支配"},"examples":[{"en":"Many countries resisted the superpower’s hegemony in the region.","zh":"许多国家抵制这个超级大国在该地区的霸权。"},{"en":"The debate is about whether the nation can maintain global hegemony.","zh":"争论的焦点是这个国家能否维持全球霸权地位。"}]},{"partOfSpeech":"n.","definition":{"en":"strong influence or control over ideas, culture, or values (not only military power)","zh":"（不仅是武力层面的）思想/文化/价值观上的主导与控制；文化霸权"},"examples":[{"en":"The film industry can create cultural hegemony by shaping what stories feel “normal.”","zh":"电影产业可能通过塑造“正常”的叙事来形成文化霸权。"},{"en":"Some critics argue that English has a kind of linguistic hegemony online.","zh":"一些评论者认为英语在网络上存在一种语言霸权。"}]}],"synonyms":["dominance","supremacy","leadership","ascendancy","control"],"phonetic":"/hɪˈdʒɛməni/","extraExplanation":["你输入的“hegumenies”很可能是拼写错误；常见词是 hegemony（单数），复数是 hegemonies。","词源来自希腊语 hēgemonia，意为“领导/统治”。现代英语里多用于国际关系、政治学与文化研究语境。","常见搭配：global/regional hegemony（全球/地区霸权），cultural hegemony（文化霸权），maintain/seek/challenge hegemony（维持/寻求/挑战霸权）。"]}
{"word":"hegumenos","summary":{"en":"Hegumenos means the head (abbot) of an Eastern Orthodox monastery; more broadly, it can mean a leader.","zh":"hegumenos 指东正教修道院的院长；广义上也可指“领导者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox Christianity) the abbot (head monk) of a monastery; a monastic superior, similar to an abbot in Western Christianity.","zh":"（东正教）修道院院长（领袖僧侣）；修道院的上级长老，地位类似西方基督教中的“abbot（院长）”。"},"examples":[{"en":"The pilgrims asked to speak with the hegumenos before entering the monastery.","zh":"朝圣者希望在进入修道院前先与那位hegumenos（院长）交谈。"},{"en":"Under the guidance of the hegumenos, the community followed a strict daily rhythm of prayer and work.","zh":"在hegumenos的带领下，团体遵循严格的祈祷与劳动作息。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, from Greek) a leader or guide; the one who leads.","zh":"（较少见，源自希腊语）领导者；引导者。"},"examples":[{"en":"In older historical writing, the term could be used more generally for a community’s leader.","zh":"在较早的历史写作中，这个词有时也更泛指社群的领导者。"}]}],"synonyms":["abbot","monastic superior","prior (similar role)","leader"],"phonetic":"/ˌhɛɡjʊˈmiːnoʊs/","extraExplanation":["词源来自希腊语 ἡγούμενος（hēgoumenos，“带领的人”），与英语 hegemony（霸权/主导地位）同源，核心意义都是“领导、主导”。","在英语中更常见的对应形式是 hegumen；hegumenos 更接近希腊语/教会传统的拼写，常出现在东正教或拜占庭相关文本中。","相关词：feminine 形式常写作 hegumenia（女修道院院长）。"]}
{"word":"hegumens","summary":{"en":"Hegemon means a dominant leader or power (often a country) that strongly influences or controls others; it can also mean the leading cultural/ideological force.","zh":"Hegemon 指在政治或文化上占支配地位、对他者有强大影响或控制力的领导者/国家/力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dominant leader, group, or country that has strong influence or control over others (especially in politics or international relations).","zh":"霸权者；支配性领导者（尤指在政治或国际关系中对他者具有强大影响或控制的国家、集团或个人）。"},"examples":[{"en":"In the 19th century, Britain was often seen as a global hegemon because of its navy and trade power.","zh":"在19世纪，英国常被视为全球霸权者，因为它拥有强大的海军和贸易实力。"},{"en":"Some smaller countries worry about being pressured by a regional hegemon.","zh":"一些小国担心会受到地区霸权者的施压。"}]},{"partOfSpeech":"n.","definition":{"en":"In culture or ideas, the most powerful force whose values and norms become widely accepted as “normal.”","zh":"（文化/思想层面）占主导地位的力量；其价值观与规范被广泛接受为“理所当然”的主流力量。"},"examples":[{"en":"Hollywood is sometimes described as a cultural hegemon shaping global entertainment tastes.","zh":"好莱坞有时被形容为文化霸权者，影响着全球的娱乐审美。"},{"en":"The book discusses how a social group can become a hegemon by controlling major institutions.","zh":"这本书讨论了社会群体如何通过掌控重要机构而成为主导力量。"}]}],"synonyms":["dominant power","superpower","leader","ruler","overlord","dominant force"],"phonetic":"/ˈhɛdʒəˌmɑn/","extraExplanation":["你输入的 **hegumens** 很可能是拼写错误；常见正确形式是 **hegemons**（hegemon 的复数）。","词源上来自希腊语 *hēgemōn*，意为“领袖/统帅”。相关名词 **hegemony** 指“霸权；支配地位”。在新闻与学术写作中很常见。"]}
{"word":"hegumeny","summary":{"en":"Hegumeny is the plural of hegumen: Orthodox Christian abbots or heads of monasteries.","zh":"Hegumeny 是 hegumen 的复数，指东正教修道院的院长/住持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) hegumens; Orthodox Christian abbots or heads of monasteries.","zh":"（复数）hegumen 的复数；东正教修道院的院长、住持（相当于“方丈/院长”）。"},"examples":[{"en":"Several hegumeny from different monasteries attended the regional council.","zh":"来自不同修道院的几位院长出席了地区会议。"},{"en":"The historian described how the hegumeny helped organize charity during the famine.","zh":"这位历史学者描述了这些院长在饥荒时期如何组织慈善救济。"}]}],"synonyms":["abbots","monastic superiors","igumens"],"phonetic":"/ˌhɛɡjəˈmɛni/","extraExplanation":["“hegumen”（也拼作 *igumen*）主要用于东正教传统（如希腊、俄罗斯、巴尔干等地区）的修道院体系，指修道院的负责人，地位大致相当于天主教中的 *abbot*（男修道院院长）。","词源来自希腊语 *hēgoumenos*，意为“带领者、领导者”。因此它常出现在宗教史、拜占庭或东欧历史相关的英文写作中。","在英语里更常见的形式是单数 *hegumen*（或 *igumen*）；“hegumeny”通常被当作其复数使用，属于较少见、偏学术/历史语境的用法。"]}
