{"word":"hejazi","summary":{"en":"Hejazi means “from/related to the Hejaz region of western Saudi Arabia,” and it can also refer to a person from there or the local Arabic dialect.","zh":"Hejazi 指“来自/与沙特阿拉伯西部汉志地区有关”，也可指汉志人或当地的阿拉伯语方言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Hejaz (also spelled Hijaz), a region in western Saudi Arabia (including cities such as Mecca, Medina, and Jeddah).","zh":"与“汉志地区”（也拼作 Hijaz，位于沙特阿拉伯西部，包括麦加、麦地那、吉达等城市）有关的；汉志的。"},"examples":[{"en":"Hejazi cuisine often includes dishes influenced by pilgrims and trade routes.","zh":"汉志（Hejazi）美食常常受到朝觐者与贸易路线影响。"},{"en":"She studies Hejazi history to better understand the cultural role of Mecca and Medina.","zh":"她研究汉志地区的历史，以更好理解麦加和麦地那的文化地位。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Hejaz region.","zh":"汉志地区的人；汉志人。"},"examples":[{"en":"Many Hejazis live in Jeddah and the surrounding coastal cities.","zh":"许多汉志人居住在吉达及其周边的沿海城市。"}]},{"partOfSpeech":"n.","definition":{"en":"the Arabic variety (dialect) spoken in the Hejaz region; Hejazi Arabic.","zh":"汉志阿拉伯语（汉志地区使用的阿拉伯语方言）；汉志方言。"},"examples":[{"en":"He can understand Egyptian Arabic, but he speaks Hejazi at home.","zh":"他能听懂埃及阿拉伯语，但在家里说汉志方言。"},{"en":"Some learners compare Hejazi and Gulf Arabic to hear differences in pronunciation.","zh":"一些学习者会对比汉志方言和海湾阿拉伯语的发音差异。"}]}],"synonyms":["Hijazi","Hejazi Arabic","Hijazi Arabic","Hejaz (region)"],"phonetic":"/hɪˈdʒɑːzi/","extraExplanation":["英文里更常见的拼写是 Hijazi（也写作 Hejazi）。两者通常指同一地区/同一方言，只是转写方式不同。","在表达“方言”时，常见搭配是 Hejazi Arabic；在表达“某地的人/文化”时，常见搭配是 Hejazi people / Hejazi culture / Hejazi cuisine。"]}
{"word":"hejazian","summary":{"en":"Hejazian means ‘from or related to the Hejaz (Hijaz) region’ and can also mean ‘a person from that region.’","zh":"Hejazian 指“汉志地区的/与汉志有关的”，也可指“汉志人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(also spelled Hijazi) relating to the Hejaz (Hijaz) region in western Saudi Arabia, including cities such as Mecca and Medina.","zh":"（也拼作 Hijazi）与沙特阿拉伯西部的汉志（Hejaz/Hijaz）地区有关的；该地区包括麦加、麦地那等城市。"},"examples":[{"en":"Hejazian history is closely connected to pilgrimage routes to Mecca.","zh":"汉志地区的历史与通往麦加的朝觐路线密切相关。"},{"en":"She studies Hejazian cultural traditions and oral poetry.","zh":"她研究汉志的文化传统与口头诗歌。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Hejaz (Hijaz) region.","zh":"汉志（Hejaz/Hijaz）地区的人；汉志人。"},"examples":[{"en":"Many Hejazians have family ties across the Red Sea region.","zh":"许多汉志人与红海沿岸地区有家族联系。"},{"en":"As a Hejazian, he grew up hearing different accents from visiting pilgrims.","zh":"作为一名汉志人，他从小就听到来自各地朝觐者的不同口音。"}]}],"synonyms":["Hijazi","Hejazi","of the Hejaz","from the Hijaz"],"phonetic":"/həˈdʒeɪziən/","extraExplanation":["“Hejazian”在英语里相对少见，更常见的拼写是“Hijazi”（也可见“Hejazi”）。两者意思基本相同，都是“汉志的/汉志人”。","汉志（Hejaz/Hijaz）指阿拉伯半岛西部红海沿岸一带，历史上因麦加与麦地那而具有重要宗教与文化地位。","有时你也会在音乐语境看到相关词：如“Hijaz”可指一种中东音乐音阶/调式（maqam Hijaz）；不过“hejazian”本身更常用于地域与文化身份的描述。"]}
{"word":"hejira","summary":{"en":"Hejira most commonly refers to Muhammad’s 622 CE migration (Hijra/Hegira), and it is also the title of Joni Mitchell’s 1976 album.","zh":"“Hejira”通常指穆罕默德于公元622年的迁徙（Hijra/Hegira），也可指琼妮·米歇尔1976年的专辑《Hejira》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled hijra / hegira) In Islamic history, the Prophet Muhammad’s migration from Mecca to Medina in 622 CE; it marks the beginning of the Islamic (Hijri) calendar.","zh":"（也拼作 hijra / hegira）伊斯兰历史上指先知穆罕默德于公元622年从麦加迁徙到麦地那；这一事件也被视为伊斯兰历（回历）的起点。"},"examples":[{"en":"The Hejira (Hijra) is a major turning point in early Islamic history.","zh":"“Hejira（Hijra）”是伊斯兰早期历史中的重大转折点。"},{"en":"Many history books mention 622 CE as the year of the Hejira.","zh":"许多历史书都会提到公元622年是“Hejira”发生的年份。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name used in popular culture, especially the title of Joni Mitchell’s 1976 album *Hejira*.","zh":"流行文化中的专有名词用法，尤指琼妮·米歇尔（Joni Mitchell）1976年的专辑《Hejira》的名称。"},"examples":[{"en":"I’ve been listening to Joni Mitchell’s *Hejira* on repeat.","zh":"我一直在循环听琼妮·米歇尔的《Hejira》。"},{"en":"In reviews, *Hejira* is often described as a reflective road-travel album.","zh":"在乐评中，《Hejira》常被形容为一张带有旅途反思气质的专辑。"}]}],"synonyms":["hijra","hegira"],"phonetic":"/hɪˈdʒaɪrə/","extraExplanation":["“Hejira”是“Hijra/ Hegira”的变体拼写，源自阿拉伯语“hijra（迁徙/离开）”。英语里更常见的拼法是 hijra 或 hegira。","伊斯兰历法也常被称为“Hijri calendar（回历）”，以这次迁徙作为纪年起点。","作为专辑名时，Joni Mitchell 用“Hejira”借用了“迁徙/出走”的意象，表达旅行、改变与自我寻找的主题。"]}
{"word":"hejiras","summary":{"en":"“Hejira/Hejira” refers to the Hijra (622 CE), the migration that begins the Islamic calendar; “hejiras” is a plural/extended use.","zh":"“Hejira/Hejira”指希吉拉（622年），即伊斯兰历的起点；“hejiras”是其复数或引申用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Hijra: the Prophet Muhammad’s migration from Mecca to Medina in 622 CE, an event that marks the start of the Islamic calendar; “hejiras” is a plural form sometimes used to mean multiple such departures or to refer to Hijra dates/years","zh":"希吉拉（Hijra）：指公元622年穆罕默德先知从麦加迁徙到麦地那的事件；这是伊斯兰历的起点。“hejiras”有时作复数，用来泛指多次迁徙/出走，或指伊斯兰历的年份与纪年"},"examples":[{"en":"The Hijra (hejira) is a key turning point in early Islamic history.","zh":"希吉拉（hejira）是伊斯兰早期历史中的重要转折点。"},{"en":"Some older books list dates as “in the year 10 of the Hejira.”","zh":"一些较旧的书会把日期写成“在希吉拉第10年”。"},{"en":"Historians sometimes speak of “hejiras” in a broader sense, meaning forced migrations.","zh":"历史学者有时会更广义地使用“hejiras”，指被迫迁徙。"}]}],"synonyms":["Hijra","Hegira"],"phonetic":"/hɪˈdʒaɪrə/","extraExplanation":["“Hejira / Hegira”是“Hijra（阿拉伯语：هجرة，意为‘迁徙’）”的旧式英语拼写之一，常见于较早的英文学术著作或历史文本。","伊斯兰历（阴历）以希吉拉为元年，因此你可能会看到“AH”（Anno Hegirae，意为‘希吉拉纪年’）来标注伊斯兰历年份。"]}

