{"word":"heo","summary":{"en":"“Heo” isn’t a standard English word; it’s usually a typo for “hello/hey.”","zh":"“heo”不是标准英文词，通常是把“hello/hey”打错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a typo for “hello” or “hey,” especially in casual typing/chat.","zh":"不是标准英语单词；多见于打字/聊天时把“hello”或“hey”打错。"},"examples":[{"en":"heo—sorry, I meant hello!","zh":"heo——抱歉，我是想打 hello！"},{"en":"She texted “heo” and then corrected it to “hey.”","zh":"她发了“heo”，然后改成了“hey”。"}]}],"synonyms":["hello","hi","hey"],"phonetic":"/ˈhiːoʊ/","extraExplanation":["在英语里，“heo”本身没有固定词义或正式用法。常见原因是手机键盘误触或漏打字母（比如漏了“ll”变成 heo）。","如果你想表达打招呼，比较自然的写法是：hello（更正式/通用）、hi（更随意）、hey（更口语）。"]}
{"word":"heofon","summary":{"en":"“Heofon” is an Old English word meaning “heaven” or “the sky.”","zh":"“heofon”是古英语词，意思是“天堂”或“天空”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old English, archaic) “Heaven; the sky,” often referring to God’s dwelling place in Christian writing.","zh":"（古英语，古/罕用）“天堂；天空”，在基督教文本中常指上帝的居所。"},"examples":[{"en":"In Old English poems, “heofon” often means heaven as God’s home.","zh":"在古英语诗歌中，“heofon”常指上帝居住的“天堂”。"},{"en":"Modern English usually uses “heaven” instead of “heofon.”","zh":"现代英语通常用“heaven”，而不是“heofon”。"}]}],"synonyms":["heaven","sky","the heavens"],"phonetic":"/ˈhɛvən/","extraExplanation":["“heofon”是现代英语“heaven”的早期形式，常见于古英语（约公元5—11世纪）宗教文本与史诗诗歌中。","读古英语时会遇到许多与现代拼写不同的词形；在现代语境里直接用“heaven”更自然。"]}
{"word":"heonan","summary":{"en":"“heonan” is not a standard English word; it’s likely a misspelling or a proper name. Share context to identify the intended word.","zh":"“heonan”不是标准英语单词；更可能是拼写错误或专有名词。提供语境可帮助确认你想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a username, or a proper name (e.g., a person or place). If you meant a different word, please share the context or the correct spelling.","zh":"不是标准英语单词。更可能是拼写错误、用户名，或专有名词（如人名/地名）。如果你想查的是另一个词，请提供上下文或正确拼写。"},"examples":[{"en":"I can’t find “heonan” in an English dictionary—did you mean “Hunan” or another word?","zh":"我在英语词典里找不到“heonan”——你是不是想写“Hunan（湖南）”或其他词？"},{"en":"Could you put “heonan” into a sentence so I can help you identify the intended word?","zh":"你能把“heonan”放进一个句子里吗？这样我就能帮你判断你真正想查的词。"}]}],"extraExplanation":["“heonan”很像拼写输入时多/少打了字母的结果。常见的相近目标可能包括：\n1) **Hunan**（湖南，中国的一个省；英语里常写作 Hunan）\n2) **Hernán / Hernan**（西班牙语人名，英语中也常见作人名）\n3) 其他专有名词（用户名、游戏ID、地名等）\n如果你告诉我它出现的语境（例如：文章句子、地图、聊天内容），我可以更准确地帮你定位。"]}
{"word":"heor","summary":{"en":"“Hero” means a brave, admired person, or the main character in a story.","zh":"“Hero”指勇敢受人敬佩的人，也可指故事中的主人公（男主角）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person admired for great courage, achievements, or noble qualities; also the main character in a story (especially a novel or film)","zh":"英雄；（故事、小说、电影中的）男主角/主人公"},"examples":[{"en":"She became a hero after saving a child from the river.","zh":"她从河里救出一个孩子后成了英雄。"},{"en":"In the movie, the hero must choose between duty and love.","zh":"在电影里，男主角必须在责任和爱情之间做选择。"},{"en":"Many people see healthcare workers as heroes.","zh":"许多人把医护人员视为英雄。"}]},{"partOfSpeech":"n.","definition":{"en":"the central male character in a traditional story (contrast: heroine for a female character)","zh":"（传统叙事中的）男主人公；（对应女性：heroine）"},"examples":[{"en":"Odysseus is a famous hero in ancient Greek literature.","zh":"奥德修斯是古希腊文学中著名的英雄人物。"},{"en":"The hero’s journey is a common pattern in myths.","zh":"“英雄之旅”是神话中常见的叙事模式。"}]}],"synonyms":["champion","savior","protagonist","idol"],"phonetic":"/ˈhɪroʊ/","extraExplanation":["“heor”不是常见英文单词，很可能是拼写错误，想写的是“hero”（英雄/主角）。如果你本来想查的是“hear”（听见）或“her”（她的/她），告诉我我可以再给对应词条。"]}
{"word":"heora","summary":{"en":"heora is an Old English word meaning “their / theirs.”","zh":"heora 是古英语词，意思是“他们/她们/它们的（their / theirs）”。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"(Old English) “their”; the genitive plural form used to show possession (like modern English “their”).","zh":"（古英语）“他们/她们/它们的”；表示复数所有格，相当于现代英语 their。"},"examples":[{"en":"Heora hus wæs micel. (Their house was big.)","zh":"Heora hus wæs micel.（他们的房子很大。）"},{"en":"Ic geseah heora cyning. (I saw their king.)","zh":"Ic geseah heora cyning.（我看见了他们的国王。）"}]},{"partOfSpeech":"pron.","definition":{"en":"(Old English) “theirs”; used as a possessive pronoun meaning “belonging to them.”","zh":"（古英语）“他们的（东西）/她们的/它们的”；作物主代词，相当于现代英语 theirs。"},"examples":[{"en":"Þæt wæs heora. (That was theirs.)","zh":"Þæt wæs heora.（那是他们的。）"}]}],"synonyms":["their","theirs"],"phonetic":"/ˈheə.rɑ/","extraExplanation":["“heora”是古英语（约公元5–11世纪）的词形，不是现代英语常用拼写；现代英语通常用 their / theirs。","它来自古英语代词系统：与 hīe（他们/她们/它们）同属一套变化形式；“heora”专门用于表示“他们的”。","在阅读《贝奥武夫》(Beowulf) 等古英语文本时会常见到该词。"]}
{"word":"heord","summary":{"en":"“Heord” is an archaic form meaning “herd,” mostly found in Old English contexts; modern English uses “herd.”","zh":"“heord”是古语形式，意思是“兽群/牲畜群”，多见于古英语语境；现代英语通常用“herd”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a herd (a group of animals), especially livestock; sometimes also meaning a household or family group in Old English contexts.","zh":"（古语）兽群（尤指牲畜）；在古英语语境中有时也可指“家户/家庭群体”。"},"examples":[{"en":"In some Old English texts, “heord” refers to a herd of cattle.","zh":"在一些古英语文本中，“heord”指一群牛。"},{"en":"The poem describes a shepherd watching over his heord.","zh":"诗中描写牧羊人守护着他的兽群。"}]}],"synonyms":["herd","flock (for birds/sheep)","drove (esp. cattle)"],"phonetic":"/hɛrd/","extraExplanation":["“heord”主要见于古英语（Old English）或仿古写作中，现代英语通常用 **herd**。如果你是想写现代英语里的过去式/过去分词“听到”，正确拼写是 **heard**。","词源提示：古英语 **heord** 与现代英语 **herd** 同源，含义从“群（动物）”延伸到“家户/群体”的用法在古代文本里也能见到。"]}
{"word":"heorh","summary":{"en":"“heorh” isn’t a recognized English word; it’s probably a typo. Share the context and I’ll help find the intended word.","zh":"“heorh”不是英语单词，可能是拼写错误。给我语境，我可以帮你找出你真正想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or random letters. Common intended words include “hero,” “her,” “hearth,” or “horror,” depending on context.","zh":"不是标准英语单词；很可能是拼写错误或随意字母组合。常见可能想输入的词包括“hero（英雄）”“her（她的/她）”“hearth（壁炉/炉边）”“horror（恐怖）”，具体取决于语境。"},"examples":[{"en":"I can’t find “heorh” in the dictionary—did you mean “hero”?","zh":"我在词典里找不到“heorh”——你想写的是“hero（英雄）”吗？"},{"en":"Please tell me the sentence you wanted to write, so I can guess the correct word.","zh":"请告诉我你想写的句子，这样我可以更准确地判断你要用哪个词。"}]}],"phonetic":"hɪˈɔɹh","extraExplanation":["如果你愿意，把“heorh”前后各给我一两个词（或整句）就行，我可以根据语境帮你判断最可能的正确拼写，并解释意思和用法。也可以告诉我你想表达的中文意思，我来反推对应英文词。"]}
{"word":"heorte","summary":{"en":"“Heorte” is an Old English spelling of “heart,” meaning the heart (organ) or one’s feelings/courage.","zh":"“heorte”是“heart”的古英语拼写，意为心脏（器官）或情感/勇气/内心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old English, archaic spelling) “heart”: the physical organ that pumps blood; also used for a person’s feelings, courage, or inner self.","zh":"（古英语/古拼写）“心/心脏；内心”：指泵血的心脏器官；也可指人的情感、勇气或内在自我。"},"examples":[{"en":"In Old English texts, “heorte” is an earlier form of the modern word “heart.”","zh":"在古英语文本中，“heorte”是现代英语“heart”的早期形式。"},{"en":"He spoke with a brave heorte, meaning he had courage.","zh":"他以勇敢的“heorte”说话，意思是他很有勇气。"},{"en":"She carried sorrow in her heorte, meaning deep sadness in her heart.","zh":"她在“heorte”里带着悲伤，意思是内心深处的哀伤。"}]}],"synonyms":["heart","inner self","spirit","courage"],"phonetic":"/hɑrt/","extraExplanation":["“heorte”主要出现在古英语（约公元5–11世纪）作品与手稿中；现代英语对应词是“heart”。如果你在学习《贝奥武夫》（Beowulf）或古英语诗歌，常会遇到这种拼写。","古英语的拼写和发音与现代英语差异较大；学习时一般把它当作词源/历史拼写来理解，用现代英语“heart”的读音和意义来记忆最实用。"]}
{"word":"heortological","summary":{"en":"Heortological means “about religious festivals or holy days.”","zh":"Heortological 指“与宗教节日或圣日有关的；与节日研究相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to religious festivals or holy days (especially in Christian tradition); connected with the study of festivals and their calendars.","zh":"与宗教节日或圣日有关的；（尤指基督教传统中）与节日及其历法研究有关的。"},"examples":[{"en":"The book includes a heortological calendar of major saints’ days.","zh":"这本书收录了一份主要圣人纪念日的节日历（heortological calendar）。"},{"en":"Her research is heortological, focusing on how communities celebrate Easter.","zh":"她的研究属于节日学（heortological），重点探讨群体如何庆祝复活节。"}]}],"synonyms":["festival-related","liturgical","related to holy days","ecclesiastical (in some contexts)"],"phonetic":"/ˌhɪərtəˈlɑːdʒɪkəl/","extraExplanation":["“heortological”来自“heortology”（节日学/节庆研究），其词根源自希腊语，和“节日、庆典”有关。这个词较为学术、少见，常出现在神学、礼仪学（liturgical studies）、教会史或宗教人类学等语境中。","常见搭配包括：heortological calendar（节日历/圣日历）、heortological study（节日学研究）、heortological tradition（节日传统）。日常英语里更常用“religious festivals”“holy days”“liturgical calendar”等表达。"]}
{"word":"heortologion","summary":{"en":"A heortologion is a liturgical calendar-style book listing feasts and saints’ days, especially in the Eastern Orthodox tradition.","zh":"heortologion 指一种礼仪日历式的礼仪书，列出节日与圣徒纪念日，尤见于东正教传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a liturgical book (especially in Eastern Orthodox tradition) that lists religious feasts and saints’ days, often giving brief notes about how and when they are celebrated","zh":"（尤指东正教传统中的）礼仪书，收录宗教节日与圣徒纪念日的目录，常附有简要说明（何时、如何庆祝）"},"examples":[{"en":"The monastery kept a heortologion to track major feasts throughout the year.","zh":"修道院保存了一本 heortologion，用来追踪一年中的重要节日。"},{"en":"According to the heortologion, today is the feast day of a local saint.","zh":"根据 heortologion，今天是一位本地圣徒的纪念日。"}]}],"synonyms":["liturgical calendar","feast calendar","calendar of saints","menologion (related)"],"phonetic":"/ˌhiːɔrtoʊˈlɑdʒiən/","extraExplanation":["词源来自希腊语：heortē（“节日、庆典”）+ -logion（“记录、汇编”）。它常用于拜占庭/东正教礼仪语境，接近“礼仪日历/节日录”。","相关书名对比：menologion（按月份编排、常含圣徒生平与礼文的“月录/圣人传记集”）与 heortologion（更偏“节日与纪念日清单/索引”）在内容详略上可能不同，具体因传统与版本而异。"]}
{"word":"heortology","summary":{"en":"Heortology is the academic study of religious festivals and holy days.","zh":"Heortology 指对宗教节庆与圣日（宗教年历中的节日）的学术研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of religious festivals and holy days (especially in Christian tradition); the scholarly study of feasts and celebrations in a religious calendar","zh":"（尤指基督宗教传统中的）宗教节庆与圣日的研究；对礼仪年历中节日与庆典的学术研究"},"examples":[{"en":"Her thesis in heortology focuses on how Easter traditions developed in different regions.","zh":"她的节庆学论文聚焦于复活节传统如何在不同地区发展。"},{"en":"The course combines heortology with liturgy to explain why certain feast days are celebrated.","zh":"这门课把节庆学与礼仪学结合起来，解释为什么要庆祝某些瞻礼日。"}]}],"synonyms":["festival studies","study of religious festivals","liturgical studies (related)"],"phonetic":"/ˌhɪərˈtɑlədʒi/","extraExplanation":["这个词较少见，多用于宗教学、礼仪研究或教会史语境。词源来自希腊语 heortē（节日、庆典）+ -logy（学科、研究）。","在基督宗教研究中，它常与 liturgy（礼仪）或 liturgical calendar（礼仪年/教会年历）一起出现，用来讨论节日的设立、神学意义、仪式与民间习俗的变化。"]}

