{"word":"hep","summary":{"en":"“Hep” can mean “cool/hip” (old slang) or “hepatitis” (informal medical shorthand).","zh":"“hep”既可指“很潮/很酷”（较旧的俚语），也可作“肝炎”的口语缩写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang, old-fashioned) Cool, fashionable, and aware of the latest ideas—similar to “hip.”","zh":"（俚语，较旧）很酷、很时髦、很懂潮流；类似“hip（很潮）”。"},"examples":[{"en":"In the 1940s, jazz fans used “hep” to mean “cool.”","zh":"在20世纪40年代，爵士乐迷用“hep”表示“很酷”。"},{"en":"He tried to sound hep by using a lot of slang.","zh":"他想用很多俚语让自己听起来很潮。"}]},{"partOfSpeech":"n.","definition":{"en":"Hepatitis; used in casual speech, especially in phrases like “hep A/B/C.”","zh":"肝炎；口语缩写，常见于“hep A/B/C（甲/乙/丙型肝炎）”。"},"examples":[{"en":"The clinic offers testing for hep B and hep C.","zh":"诊所提供乙肝和丙肝的检测。"},{"en":"He got vaccinated to prevent hep A.","zh":"他接种疫苗来预防甲肝。"}]}],"synonyms":["hip","cool","fashionable"],"phonetic":"/hɛp/","extraExplanation":["“hep”作为“很潮”的意思主要流行于20世纪早中期（尤其与爵士文化相关），现在更常用的是“hip”。在现代英语里，“hep”这个用法会显得复古或带点戏仿语气。","医学语境中的“hep”通常是“hepatitis（肝炎）”的非正式缩写；正式写作更常直接写“hepatitis”或“hep B/C”等标准标记。"]}
{"word":"hepar","summary":{"en":"Hepar is a medical/anatomical term (and root) meaning “the liver,” most often seen in older texts or in word formation related to hepat- terms.","zh":"Hepar 是表示“肝脏”的医学/解剖学用语（也可作词根），多见于较早文献或与 hepat-（肝相关）构词体系有关的语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical/anatomy, from Greek/Latin) the liver; used mainly in scientific contexts.","zh":"（医学/解剖，源自希腊语/拉丁语）肝脏；主要用于学术或医学语境。"},"examples":[{"en":"In older anatomical texts, “hepar” is used to mean the liver.","zh":"在较早的解剖学文献中，“hepar”用来表示肝脏。"},{"en":"The doctor mentioned that the hepar was enlarged on the scan.","zh":"医生提到扫描显示肝脏（hepar）肿大。"}]},{"partOfSpeech":"other","definition":{"en":"a word root meaning “liver,” seen in medical terms (more commonly as hepat-).","zh":"表示“肝”的词根，用于医学术语中（更常见形式为 hepat-）。"},"examples":[{"en":"Hepatitis comes from the same root meaning “liver.”","zh":"hepatitis（肝炎）来自同一个表示“肝”的词根。"},{"en":"Many liver-related words start with hepat- rather than hepar-.","zh":"许多与肝相关的词更常以 hepat- 开头，而不是 hepar-。"}]}],"synonyms":["liver","hepatic (adj.)"],"phonetic":"/ˈhɛpɑr/","extraExplanation":["“hepar”来自希腊语 hēpar（肝脏），通过拉丁语进入医学英语。现代英语里日常更常用的是 liver；在医学构词中更常见的是 hepat-（如 hepatitis 肝炎、hepatology 肝脏学）。","如果你想查的是药物“heparin（肝素）”，它的名字也与“hepar（肝）”同源，因为最早与肝组织研究有关。"]}
{"word":"heparin","summary":{"en":"Heparin is a hospital medicine that prevents blood clots (an anticoagulant).","zh":"肝素是一种用于预防血栓的抗凝药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine (anticoagulant) that helps prevent blood clots from forming or getting bigger, often used in hospitals during surgery, dialysis, or to treat/prevent conditions like deep vein thrombosis.","zh":"一种抗凝药（防止凝血的药物），用于预防血栓形成或阻止血栓变大，常在医院用于手术、透析，或治疗/预防深静脉血栓等情况。"},"examples":[{"en":"The doctor started heparin to prevent blood clots after surgery.","zh":"医生在手术后开始使用肝素来预防血栓。"},{"en":"She was given heparin in the hospital for a suspected deep vein thrombosis (DVT).","zh":"她因疑似深静脉血栓（DVT）在医院接受了肝素治疗。"},{"en":"Patients on dialysis may receive heparin to keep the blood from clotting in the machine.","zh":"透析患者可能会使用肝素，防止血液在机器中凝固。"}]}],"synonyms":["anticoagulant","blood thinner"],"phonetic":"/ˈhɛpərɪn/","extraExplanation":["“heparin”来自希腊语词根 hepar（意为“肝脏”），因为这种物质最早与肝脏组织有关。","日常交流中它通常是不可数名词（the patient is on heparin）。临床上有时会区分“unfractionated heparin（普通/未分级肝素）”和“low-molecular-weight heparin, LMWH（低分子肝素）”。"]}
{"word":"heparinization","summary":{"en":"Heparinization means giving heparin to prevent blood clotting, especially in medical procedures.","zh":"Heparinization 指使用肝素进行抗凝，以防止血液凝固，常用于医疗操作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the medical process of giving heparin (an anticoagulant) to prevent blood from clotting, especially during surgery or when using medical devices","zh":"（医学）使用肝素（一种抗凝药）以防止血液凝固的过程，常见于手术或使用医疗器械时"},"examples":[{"en":"Heparinization is often used during heart surgery to reduce the risk of clotting.","zh":"在心脏手术中常会进行肝素化，以降低血栓形成的风险。"},{"en":"The dialysis circuit requires heparinization to keep the blood flowing smoothly.","zh":"透析管路需要肝素化，以保持血液顺畅流动而不凝固。"}]}],"synonyms":["heparin therapy","anticoagulation","systemic anticoagulation"],"phonetic":"/ˌhɛpəˌrɪnəˈzeɪʃən/","extraExplanation":["“Heparinization”多用于临床语境（如手术、体外循环、透析、ECMO等）。它强调“给予肝素并使血液处于抗凝状态”的整体过程，而不仅仅是“打了一针肝素”。","相关常见搭配：systemic heparinization（全身肝素化）、local/regional heparinization（局部/区域肝素化）、heparinization protocol（肝素化方案）。","肝素化需要监测凝血指标（如aPTT或ACT），以在“防止凝血”和“避免出血风险”之间取得平衡。"]}
{"word":"heparinize","summary":{"en":"Heparinize means to give or apply heparin to prevent blood from clotting, often in medical procedures or when maintaining catheters.","zh":"Heparinize 指使用肝素使血液或器械处于抗凝状态，以防止凝血，常用于医疗操作或导管维护。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat blood or a medical device (such as a catheter) with heparin so that blood does not clot","zh":"用肝素处理血液或医疗器械（如导管），以防止血液凝固"},"examples":[{"en":"The nurse heparinized the catheter to keep it from clotting.","zh":"护士用肝素处理导管，以防堵塞凝血。"},{"en":"In some procedures, blood is heparinized before it runs through the machine.","zh":"在某些操作中，血液在进入机器前会先进行肝素化处理。"}]},{"partOfSpeech":"v.","definition":{"en":"to receive heparin treatment; to become anticoagulated with heparin","zh":"接受肝素治疗；因肝素作用而处于抗凝状态"},"examples":[{"en":"The patient was heparinized during the surgery.","zh":"患者在手术过程中处于肝素化（抗凝）状态。"}]}],"synonyms":["anticoagulate (with heparin)","administer heparin","heparin-treat"],"phonetic":"/həˈpærəˌnaɪz/","extraExplanation":["“heparinize”是医学用语，常见于手术、透析、体外循环、置管维护等场景，核心目的都是“抗凝”（prevent clotting）。临床上也常见名词表达“heparinization”（肝素化）。","词根上，“heparin”来自希腊语 hepar（肝脏），因为肝素最早与肝组织相关的研究有关；不过现代临床使用的肝素并不等同于“来自肝脏”。"]}
{"word":"heparinized","summary":{"en":"Heparinized means treated with heparin so blood or fluid won’t clot.","zh":"Heparinized 指“肝素处理过的”，用于抗凝、防止血液或液体凝固。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with heparin (an anticoagulant) to prevent blood from clotting","zh":"用肝素处理过的（肝素是一种抗凝剂），用于防止血液凝固"},"examples":[{"en":"The nurse drew blood into a heparinized tube for testing.","zh":"护士把血液抽入肝素处理过的采血管中用于检测。"},{"en":"Heparinized saline was used to keep the catheter from clotting.","zh":"使用肝素化生理盐水来防止导管内凝血。"}]}],"synonyms":["anticoagulated","heparin-treated"],"phonetic":"/ˈhɛpəˌraɪnaɪzd/","extraExplanation":["“heparinized”多见于医学/检验语境：如 heparinized blood（肝素化血）、heparinized tube（肝素抗凝管）、heparinized saline（肝素化生理盐水）。","词形来源：heparin（肝素）+ -ize（使……化/处理）+ -ed（过去分词作形容词），整体表示“已经被肝素处理过的”。","提示：肝素抗凝常用于某些化验项目，但不同检测可能需要不同抗凝剂（如EDTA、柠檬酸钠等），具体以医嘱/检验要求为准。"]}
{"word":"heparinizing","summary":{"en":"Heparinizing means using heparin to prevent blood from clotting (in a person, blood sample, or medical equipment).","zh":"Heparinizing 指使用肝素进行抗凝处理，以防止血液凝固（用于病人、血样或医疗器械）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Medical) giving heparin to a patient, blood, or a medical device to prevent blood from clotting; the act/process of using heparin as an anticoagulant.","zh":"（医学）给病人、血液或医疗器械使用肝素以防止血液凝固；肝素化的过程。"},"examples":[{"en":"The doctor started heparinizing the patient to reduce the risk of a blood clot.","zh":"医生开始为病人进行肝素化治疗，以降低血栓风险。"},{"en":"Before the procedure, the tubing is heparinizing to keep the line from clotting.","zh":"手术前会对管路进行肝素化处理，以防管路内凝血。"},{"en":"Heparinizing the catheter helps maintain blood flow during dialysis.","zh":"对导管进行肝素化有助于在透析过程中维持血流通畅。"}]}],"synonyms":["anticoagulating","treating with heparin","heparin treatment"],"phonetic":"/həˈpærəˌnaɪzɪŋ/","extraExplanation":["“heparinizing”来自动词 heparinize（肝素化），多见于医院场景，如透析、体外循环、导管/管路维护、预防或治疗血栓等。","肝素是抗凝药，用于“防止血液结块”，但会增加出血风险；临床上通常需要按医嘱监测凝血指标（如 aPTT）并评估出血情况。","日常英语里很少使用该词，更多出现在病历记录、护理记录、医学论文和操作规范中。"]}
{"word":"heparinoid","summary":{"en":"Heparinoid means a heparin-like drug or substance used to help prevent blood clots; it can also describe something that has heparin-like properties.","zh":"Heparinoid 指“类肝素”，即与肝素相似、用于帮助预防血栓的药物或物质；也可作形容词表示“具有类肝素性质的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug or substance similar to heparin (a blood thinner), used to help prevent blood clots","zh":"类肝素（与肝素相似的药物或物质），用于帮助预防血栓形成（抗凝）"},"examples":[{"en":"After surgery, the doctor prescribed a heparinoid to reduce the risk of blood clots.","zh":"手术后，医生开了类肝素来降低血栓风险。"},{"en":"Some patients use a heparinoid gel for bruises under medical advice.","zh":"在医生指导下，有些患者会使用类肝素凝胶来处理淤青。"}]},{"partOfSpeech":"adj.","definition":{"en":"similar to heparin in structure or effect (especially describing a drug or compound)","zh":"（尤指药物/化合物）类肝素的；在结构或作用上类似肝素的"},"examples":[{"en":"The study tested a heparinoid compound with anticoagulant effects.","zh":"该研究测试了一种具有抗凝作用的类肝素化合物。"}]}],"synonyms":["heparin-like anticoagulant","anticoagulant"],"phonetic":"/həˈpærɪnɔɪd/","extraExplanation":["“heparin”来自希腊语“hepar”（肝脏），因为肝素最早与肝脏组织研究有关；“-oid”常表示“像……一样/类似……”，所以 heparinoid 字面意思就是“像肝素一样的（物质）”。","日常英语里这个词主要出现在医学语境（处方、说明书、论文）中；非专业场合更常听到的是 “blood thinner（抗凝药/稀释血液的药）”。用药与皮肤外用制剂的适应症和风险差异较大，通常需要遵医嘱。"]}
{"word":"heparins","summary":{"en":"Heparins are anticoagulant medicines used to prevent or treat blood clots.","zh":"Heparins 指肝素类抗凝药，用于预防或治疗血栓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of medicines (plural of heparin) used to prevent or treat blood clots by thinning the blood (anticoagulants)","zh":"肝素类药物（heparin 的复数）：用于预防或治疗血栓、起到“抗凝/稀释血液”作用的药物"},"examples":[{"en":"Doctors may prescribe heparins to prevent blood clots after surgery.","zh":"医生可能会开肝素类药物，用于预防术后血栓。"},{"en":"Some patients receive heparins by injection in the hospital.","zh":"有些病人在医院里会通过注射使用肝素类药物。"}]}],"synonyms":["anticoagulants","blood thinners"],"phonetic":"/ˈhɛpərɪn/","extraExplanation":["“Heparin”最常见于医疗语境，尤其是住院、手术后、深静脉血栓（DVT）或肺栓塞（PE）相关治疗。英语里说 heparins 通常指“不同类型/制剂的肝素类抗凝药”，例如普通肝素（unfractionated heparin）和低分子量肝素（low-molecular-weight heparin, LMWH）。","词源上与希腊语 hepar（肝脏）有关，因为肝素最早与肝脏组织研究相关。日常对话中较少出现，多见于病历、药单和科普文章。"]}
{"word":"hepat","summary":{"en":"hepat-: a medical word root meaning “liver.”","zh":"hepat-：表示“肝脏”的医学词根。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word root (combining form) meaning “liver,” used in medical and scientific terms","zh":"词根/构词成分，表示“肝脏”，常用于医学与科学词汇中"},"examples":[{"en":"Hepatic means “related to the liver.”","zh":"hepatic 表示“与肝脏有关的”。"},{"en":"Hepatitis is inflammation of the liver.","zh":"hepatitis 是“肝炎（肝脏发炎）”。"},{"en":"Hepatology is the study of the liver and its diseases.","zh":"hepatology 是“肝脏学/肝病学（研究肝脏及其疾病）”。"}]}],"synonyms":["liver (in meaning, not as a direct synonym form)"],"phonetic":"/ˈhɛpæt/","extraExplanation":["“hepat-”来自希腊语 hēpar / hēpatos，意思是“肝”。在英语里它通常不单独作为一个完整单词使用，而是作为前缀式的词根出现在医学术语中。","常见搭配：hepat- + -itis（炎症）→ hepatitis（肝炎）；hepat- + -ic（……的）→ hepatic（肝脏的）；hepat- + -ology（学科）→ hepatology（肝脏学/肝病学）。"]}
{"word":"hepatalgia","summary":{"en":"Hepatalgia means pain in the liver area (right upper abdomen).","zh":"hepatalgia 指肝区疼痛（肝痛），多见于医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pain in the liver area (pain felt in the right upper part of the abdomen), often related to liver or bile-duct problems.","zh":"肝痛；肝区疼痛（通常指右上腹的疼痛），常与肝脏或胆道问题有关。"},"examples":[{"en":"The patient reported hepatalgia after eating greasy food.","zh":"患者在吃了油腻食物后报告出现肝区疼痛（肝痛）。"},{"en":"Doctors asked about fever, nausea, and hepatalgia to check for hepatitis.","zh":"医生询问发热、恶心和肝区疼痛，以评估是否可能是肝炎。"}]}],"synonyms":["liver pain","hepatic pain"],"phonetic":"/ˌhɛpəˈtældʒə/","extraExplanation":["词源记忆：hepat- 来自希腊语 hepar（肝脏），-algia 来自 algos（疼痛）。很多医学词都用这种“部位/器官 + 疼痛”的构词法，例如 neuralgia（神经痛）、myalgia（肌痛）。","使用提示：hepatalgia 属于较偏医学/学术用语。日常英语更常说 “liver pain” 或 “pain in the right upper abdomen”。"]}
{"word":"hepatatrophia","summary":{"en":"Hepatatrophia means atrophy (shrinkage) of the liver.","zh":"hepatatrophia 指“肝萎缩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"atrophy (wasting/shrinking) of the liver; an abnormal decrease in liver size due to disease or loss of liver tissue.","zh":"肝萎缩；因疾病或肝组织减少而导致的肝脏体积异常缩小。"},"examples":[{"en":"The report described hepatatrophia associated with long-term liver disease.","zh":"报告描述了与长期肝病相关的肝萎缩。"},{"en":"Imaging may show hepatatrophia when parts of the liver lose blood supply.","zh":"当肝脏部分血供减少时，影像检查可能显示肝萎缩。"}]}],"synonyms":["liver atrophy","hepatic atrophy"],"phonetic":"/həˌpætəˈtroʊfiə/","extraExplanation":["这是较少见、偏医学/病理学用语，临床上更常见的表述是 “liver atrophy”（肝萎缩）。","词源：hepat-（肝）+ atrophia（萎缩），来自希腊语词根，常见于医学术语构词。"]}
{"word":"hepatatrophy","summary":{"en":"Hepatatrophy means atrophy (shrinking) of the liver.","zh":"hepatatrophy 指“肝萎缩”，即肝脏组织减少、体积缩小。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical term meaning wasting away (shrinking) of the liver; decreased liver size due to loss of tissue","zh":"医学术语：肝萎缩；指肝脏组织减少、体积缩小的情况"},"examples":[{"en":"Imaging showed hepatatrophy, suggesting long-term damage to the liver tissue.","zh":"影像检查显示肝萎缩，提示肝组织可能存在长期损伤。"},{"en":"Severe malnutrition can contribute to hepatatrophy in some patients.","zh":"严重营养不良在某些患者中可能会促发肝萎缩。"}]}],"synonyms":["liver atrophy","hepatic atrophy"],"phonetic":"/ˌhɛpətˈætrəfi/","extraExplanation":["词源构词：hepato- 表示“肝”，-atrophy 表示“萎缩/组织衰退”。合起来就是“肝的萎缩”。","使用场景：多见于医学影像学、病理学或病历记录中，日常英语里很少使用。更常见的表达是“liver atrophy（肝萎缩）”。","提醒：这是专业术语，并非自我诊断用词；若在报告中看到，应结合医生解释与相关检查结果理解。"]}
{"word":"hepatauxe","summary":{"en":"“hepatauxe” is not a recognized English word; it’s likely a misspelling of a liver-related medical term (e.g., hepatocyte, hepatotoxic).","zh":"“hepatauxe”不是公认的英语单词；很可能是与“肝”相关的医学词（如 hepatocyte, hepatotoxic）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It appears to be a misspelling or a term from a specialized context (likely medicine/biology) that is not widely used in English dictionaries.","zh":"不是标准英语单词。看起来像拼写错误或某个非常专业的术语（可能与医学/生物学有关），在常见英语词典中并不通用。"},"examples":[{"en":"I can’t find “hepatauxe” in a dictionary—did you mean “hepatocyte” (a liver cell)?","zh":"我在词典里查不到“hepatauxe”——你是不是想写“hepatocyte”（肝细胞）？"},{"en":"If you’re writing about liver damage, you might mean “hepatotoxic” (harmful to the liver).","zh":"如果你在写肝损伤，你可能想用“hepatotoxic”（对肝有毒/伤肝的）。"}]}],"synonyms":["hepatitis","hepatocyte","hepatotoxic","hepatomegaly"],"extraExplanation":["“hepat-”是一个常见的词根/构词成分，来自希腊语，意思是“肝”。很多医学词都用它开头。","如果你能告诉我这个词出现在哪句话里（或发一张截图/图片），我可以更准确判断你想表达的词。常见相近词：hepatitis（肝炎）、hepatocyte（肝细胞）、hepatotoxic（伤肝的）、hepatomegaly（肝肿大）。"]}
{"word":"hepatectomies","summary":{"en":"Hepatectomies are surgeries that remove part of the liver (plural of hepatectomy).","zh":"Hepatectomies 指肝切除术（hepatectomy 的复数），即通过手术切除部分肝脏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hepatectomy: surgical operations in which surgeons remove part (or rarely all) of the liver.","zh":"hepatectomy（肝切除术）的复数：外科手术，指切除部分（少数情况下为全部）肝脏。"},"examples":[{"en":"The patient underwent two hepatectomies to remove recurrent tumors.","zh":"患者为切除复发肿瘤接受了两次肝切除术。"},{"en":"Major hepatectomies require careful planning because the liver must still function afterward.","zh":"大型肝切除术需要谨慎规划，因为术后肝脏仍需维持功能。"}]}],"synonyms":["liver resections","hepatic resections"],"phonetic":"/ˌhɛpəˈtɛktəmiz/","extraExplanation":["词源提示：hepat- 来自希腊语，表示“肝”；-ectomy 表示“切除术”。因此 hepatectomy 字面意思是“肝脏切除术”。","医学语境中常见搭配：partial hepatectomy（部分肝切除）、major hepatectomy（大范围肝切除）、laparoscopic hepatectomy（腹腔镜肝切除）、liver resection（肝切除/肝脏切除，常用同义表达）。","读到复数 hepatectomies 时，通常出现在研究论文或病历总结里，表示“多例手术”或“同一患者多次手术”。"]}
{"word":"hepatectomize","summary":{"en":"A medical verb meaning to surgically remove all or part of the liver.","zh":"医学用语，指通过手术切除全部或部分肝脏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to surgically remove all or part of the liver (perform a hepatectomy on)","zh":"通过手术切除全部或部分肝脏（进行肝切除术）"},"examples":[{"en":"The surgeons decided to hepatectomize the patient to remove the tumor.","zh":"外科医生决定为患者进行肝切除，以切除肿瘤。"},{"en":"In some cases of severe liver damage, doctors may hepatectomize part of the liver.","zh":"在某些严重肝损伤的情况下，医生可能会切除部分肝脏。"}]}],"synonyms":["perform a hepatectomy","remove part of the liver","resect the liver"],"phonetic":"/hɪˈpætɛk.təˌmaɪz/","extraExplanation":["这是一个非常专业、偏医学的动词，在日常英语中很少使用。更常见的说法是用名词“hepatectomy（肝切除术）”或动词短语“perform a hepatectomy / remove part of the liver”。","词源上由“hepat-（肝）+ -ectomy（切除术）”构成；“-ize”表示“使成为/进行某种处理”，因此整体意思就是“对肝进行切除手术”。"]}
{"word":"hepatectomized","summary":{"en":"A medical adjective meaning “having undergone surgical removal of part or all of the liver.”","zh":"医学形容词，指“已经做过肝切除术（肝脏部分或全部被切除）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had a hepatectomy (surgical removal of all or part of the liver).","zh":"（因手术）已行肝切除术的；（肝脏）已被部分或全部切除的。"},"examples":[{"en":"Hepatectomized rats are often used to study how the liver regenerates.","zh":"在研究肝脏如何再生时，常会使用已行肝切除术的大鼠模型。"},{"en":"The hepatectomized patient needed careful monitoring after surgery.","zh":"这位已做肝切除术的患者在术后需要被仔细监测。"}]}],"synonyms":["post-hepatectomy","after hepatectomy"],"phonetic":"/hɪˌpætɪkˈtaɪmˌaɪzd/","extraExplanation":["这是医学/科研用语，日常英语中很少见。更常见的表达是“a patient who had a hepatectomy（做过肝切除术的患者）”或“after hepatectomy（肝切除术后）”。","词源结构：hepat- 表示“肝”（如 hepatitis 肝炎），-ectomy 表示“切除术”，-ized 表示“已被……处理/经历了……的状态”。"]}
{"word":"hepatectomizing","summary":{"en":"A rare medical term meaning surgically removing part or all of the liver.","zh":"一个少见的医学术语，指通过手术切除部分或全部肝脏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(medical) Removing all or part of the liver by surgery; performing a hepatectomy.","zh":"（医学）通过手术切除全部或部分肝脏；进行肝切除术。"},"examples":[{"en":"The surgeon discussed risks before hepatectomizing the tumor-bearing portion of the liver.","zh":"在切除含肿瘤的那部分肝脏之前，外科医生先说明了风险。"},{"en":"They avoided hepatectomizing too much tissue to protect liver function.","zh":"他们避免切除过多组织，以保护肝功能。"}]}],"synonyms":["perform a hepatectomy","do a liver resection","resect the liver"],"phonetic":"/həˌpæ.təkˈtoʊ.maɪ.zɪŋ/","extraExplanation":["这是一个非常专业、少见的医学用词，来自动词 hepatectomize（进行肝切除术）。临床上更常见的说法是 perform a hepatectomy（进行肝切除术）或 do a liver resection（做肝切除）。","词根提示：hepat- 表示“肝”（如 hepatitis 肝炎），-ectomy 表示“切除术”（如 appendectomy 阑尾切除术）。","语境注意：该词通常出现在学术论文、手术记录或医学讨论中，日常英语几乎不用。"]}
{"word":"hepatectomy","summary":{"en":"Hepatectomy is surgery to remove part or all of the liver.","zh":"hepatectomy 指“肝切除术”，即切除部分或全部肝脏的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove part or all of the liver","zh":"肝切除术；切除部分或全部肝脏的外科手术"},"examples":[{"en":"The patient recovered well after a partial hepatectomy.","zh":"患者在部分肝切除术后恢复良好。"},{"en":"A hepatectomy may be needed to remove a liver tumor.","zh":"为切除肝脏肿瘤，可能需要进行肝切除术。"}]}],"synonyms":["liver resection"],"phonetic":"/ˌhɛpəˈtɛktəmi/","extraExplanation":["词源拆解：hepat- 表示“肝”（来自希腊语），-ectomy 表示“切除手术”。因此 hepatectomy 字面意思就是“肝脏切除手术”。","常见搭配：partial hepatectomy（部分肝切除）、major hepatectomy（大范围肝切除）、laparoscopic hepatectomy（腹腔镜肝切除）。医学语境中更常见于病历、手术记录和学术文章。"]}
{"word":"hepatic","summary":{"en":"Hepatic means “related to the liver,” commonly used in medical or scientific contexts.","zh":"hepatic 指“肝脏的；与肝脏有关的”，常用于医学或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the liver.","zh":"肝脏的；与肝脏有关的。"},"examples":[{"en":"The doctor ordered a hepatic function test to check her liver health.","zh":"医生开了肝功能检查来评估她的肝脏健康。"},{"en":"Alcohol can cause hepatic damage if you drink too much over time.","zh":"长期大量饮酒可能造成肝脏损伤。"}]}],"synonyms":["liver-related","hepatic (medical)"],"phonetic":"/hɪˈpætɪk/","extraExplanation":["词源提示：hepatic 来自希腊语 hēpar（意为“肝脏”），医学英语里常用来构成与肝相关的术语。","常见搭配：hepatic function（肝功能）、hepatic disease（肝病）、hepatic artery/vein（肝动脉/静脉）、hepatic failure（肝衰竭）。","区分：hepatic（较偏医学/正式，强调“与肝相关”） vs. liver（更日常，可作名词“肝脏”，也可作形容词如 liver disease）。"]}
{"word":"hepatica","summary":{"en":"Hepatica is mainly a small early-spring woodland wildflower (liverleaf). It can also mean an old-fashioned herbal remedy once linked to liver health.","zh":"hepatica 主要指早春开花的林地野花（肝叶草/肝叶银莲花，也叫 liverleaf）。也可指旧时与“护肝”相关的草药制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small woodland wildflower (genus *Hepatica*, also called liverleaf) with early spring blooms, often blue, purple, pink, or white","zh":"一种林地里的早春野花（银莲花属 *Hepatica*，也叫“肝叶草/肝叶银莲花”），常开蓝、紫、粉或白色小花"},"examples":[{"en":"Hepatica is one of the first flowers to bloom after the snow melts.","zh":"肝叶草是雪融后最早开花的植物之一。"},{"en":"We spotted hepatica along the shady trail in early April.","zh":"四月初我们在阴凉的小径旁看到了肝叶草。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) an herbal medicine once used for liver problems, made from hepatica or similar plants","zh":"（旧式用法）过去曾用于“养肝/治肝”的草药制剂，常指用肝叶草或类似植物制成的药"},"examples":[{"en":"In the 1800s, some people drank hepatica tea as a home remedy.","zh":"在19世纪，有些人会喝“肝叶草茶”当作偏方。"}]}],"synonyms":["liverleaf","Hepatica (genus)","anemone (related group)"],"phonetic":"hɪˈpætɪkə","extraExplanation":["“hepatica”来自拉丁语/希腊语词根 *hepat-*，意为“肝”（如 *hepatitis* 肝炎）。之所以用来命名这种植物，是因为它的三裂叶片形状常被认为像肝脏；在传统“形似疗法”（看起来像哪个器官就能治哪个器官）的观念下，它曾被用作与肝相关的草药。","日常英语里更常见的叫法是 **liverleaf** 或直接说 **Hepatica (plant)**；作为草药的用法现在较少见。"]}
{"word":"hepaticae","summary":{"en":"Hepaticae means “liverworts,” a group of small non-vascular plants, especially in older biological classification.","zh":"Hepaticae 指“地钱类（liverworts）”，是一类小型非维管植物；该名称多见于较旧的生物分类体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun, biology) Liverworts; a group of small, non-vascular plants that often grow in moist places. In older classifications, Hepaticae was used as a class or subdivision of bryophytes (now usually called Marchantiophyta).","zh":"（复数名词，生物）地钱类／苔类植物中的“苔纲”旧称：指一类常生长在潮湿环境中的小型非维管植物。旧式分类中常用 Hepaticae 作为苔藓植物的一纲或一亚门（现代多称 Marchantiophyta，中文常译“地钱植物门/地钱纲”等）。"},"examples":[{"en":"In older textbooks, liverworts were sometimes grouped under the name Hepaticae.","zh":"在较早的教材里，liverworts（地钱类植物）有时被归在 Hepaticae 这个名称之下。"},{"en":"The forest floor was covered with mosses and Hepaticae after several rainy days.","zh":"连下了几天雨后，林地上长满了藓类植物和 Hepaticae（地钱类植物）。"}]}],"synonyms":["liverworts","Marchantiophyta","liverwort"],"phonetic":"/hɪˈpætɪˌkiː/","extraExplanation":["Hepaticae 是拉丁语复数形式，来源于希腊语词根 hepar（意为“肝”）。之所以和“肝”有关，是因为一些地钱（liverwort）的叶状体外形被认为像肝脏。","在现代植物分类中，Hepaticae 多被视为较旧的术语；更常见的现代名称是 Marchantiophyta（地钱植物门）。读学术或旧版资料时可能会遇到 Hepaticae。"]}
{"word":"hepatical","summary":{"en":"Hepatical is a rare form meaning “related to the liver”; modern English usually uses hepatic.","zh":"hepatical 是“与肝脏有关的”的罕见形式；现代英语通常用 hepatic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/old-fashioned) Relating to the liver; hepatic.","zh":"（罕见/较旧用法）与肝脏有关的；肝的。"},"examples":[{"en":"The doctor focused on her hepatical (hepatic) function tests.","zh":"医生重点查看了她的肝功能（hepatic）检测结果。"},{"en":"Some older texts use “hepatical,” but “hepatic” is the modern standard.","zh":"一些较早的文献会用“hepatical”，但现代标准用法是“hepatic”。"}]}],"synonyms":["hepatic","liver-related"],"phonetic":"/həˈpætɪkəl/","extraExplanation":["“hepatical”在现代英语中非常少见，多被视为“hepatic”的旧式或变体拼写。医学与日常表达里几乎都用“hepatic”。","词根来自希腊语 hēpar（肝脏）。常见搭配：hepatic disease（肝病）, hepatic artery（肝动脉）, hepatic function（肝功能）。"]}
{"word":"hepaticas","summary":{"en":"“Hepaticas” is the plural of “hepatica,” usually meaning the early-spring woodland wildflower (genus Hepatica); in older usage it can also mean certain liverworts.","zh":"“Hepaticas”是“hepatica”的复数，通常指早春林地野花“银莲花属（Hepatica）”；在较旧用法中也可能指某些“叶苔/地钱类（liverworts）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Plants called hepatica: small woodland wildflowers in the buttercup family (genus Hepatica), often with three-lobed leaves and early spring blooms.","zh":"（复数）银莲花属植物（Hepatica）：一种林地野花，属于毛茛科，常见三裂叶，早春开花。"},"examples":[{"en":"In early spring, the forest floor was dotted with blue hepaticas.","zh":"初春时，林地地面上点缀着蓝色的银莲花。"},{"en":"The guide pointed out hepaticas growing near the stream.","zh":"向导指出溪边生长着银莲花。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Liverworts sometimes called “hepatica” in older or looser usage (a group of small, non-flowering plants).","zh":"（复数）在较旧或较宽泛的用法中指“地钱类/苔类中的叶苔”（有时也被称作 hepatica 的一类小型不开花植物）。"},"examples":[{"en":"The rock was covered with mosses and hepaticas.","zh":"岩石上覆盖着藓类和一些叶苔类植物。"},{"en":"In older texts, hepaticas may refer to liverworts rather than the wildflower.","zh":"在较老的文本里，hepaticas 可能指叶苔，而不是那种野花。"}]}],"synonyms":["hepaticas (Hepatica flowers)","Hepatica","liverworts (older/looser usage)"],"phonetic":"/hɪˈpætɪkəz/","extraExplanation":["词源提示：hepatica 来自希腊语 hēpar（“肝”）。因为银莲花属（Hepatica）的叶子常呈三裂、形状让人联想到肝脏，在中世纪“形似治病”（the doctrine of signatures）的观念下，曾被认为对肝脏有益（更多是历史文化背景，不等同于现代医学结论）。","用法提醒：现代英语里更常见的是指野花 Hepatica；若要明确“叶苔/地钱类（liverwort）”，通常直接用 liverwort(s) 更清楚。"]}
{"word":"hepaticoduodenostomy","summary":{"en":"A surgery that connects the hepatic/bile duct to the duodenum to allow bile to drain into the intestine.","zh":"将肝管/胆管与十二指肠直接吻合以引流胆汁的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure that creates a direct connection (an anastomosis) between the hepatic duct/bile duct and the duodenum so bile can drain into the small intestine.","zh":"一种外科手术，将肝管/胆管与十二指肠直接吻合（建立通道），使胆汁能够流入小肠。"},"examples":[{"en":"After the bile duct injury, the surgeon performed a hepaticoduodenostomy to restore bile drainage.","zh":"发生胆管损伤后，外科医生施行了肝管十二指肠吻合术以恢复胆汁引流。"},{"en":"Hepaticoduodenostomy can be considered when reconstruction of the bile duct is needed.","zh":"当需要重建胆道时，可以考虑肝管十二指肠吻合术。"}]}],"synonyms":["biliary-enteric anastomosis","hepatic duct–duodenum anastomosis"],"phonetic":"/həˌpætɪkoʊˌduːˌdiːˌnɑːˈstɑːmi/","extraExplanation":["这是一个医学复合词：hepatico-（肝/肝管相关）+ duodeno-（十二指肠）+ -stomy（造口/吻合开口）。理解词根有助于快速判断含义。","临床上常用于胆道梗阻、胆道损伤或部分手术后的胆道重建；与更常见的“hepaticojejunostomy（肝管空肠吻合术）”相比，它把胆汁引流到十二指肠。具体选择取决于病因、解剖条件和外科方案。","术后相关表达常见于病历与手术记录，如：anastomosis（吻合口）、bile drainage（胆汁引流）、biliary reconstruction（胆道重建）。"]}
{"word":"hepaticoenterostomies","summary":{"en":"Hepaticoenterostomies are surgeries that connect the liver/bile ducts to the intestine to drain bile.","zh":"hepaticoenterostomies 指将肝脏或胆道与肠道相连以引流胆汁的外科手术（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hepaticoenterostomy: surgical operations that create a connection (anastomosis) between the liver or hepatic/bile ducts and the intestine to allow bile to drain.","zh":"hepaticoenterostomy 的复数：一种外科手术，在肝脏或肝/胆管与肠道之间建立连接（吻合），以便胆汁能够引流。"},"examples":[{"en":"The surgeon performed hepaticoenterostomies to restore bile flow after the bile ducts were damaged.","zh":"外科医生进行了多例 hepaticoenterostomies（肝-肠吻合术），以在胆管受损后恢复胆汁引流。"},{"en":"In the operative report, hepaticoenterostomies were documented as part of biliary reconstruction.","zh":"在手术记录中，hepaticoenterostomies 被记录为胆道重建的一部分。"}]}],"synonyms":["hepatic-enteric anastomoses","biliary-enteric anastomoses"],"phonetic":"/həˌpætɪkoʊˌentəˈstɑmiz/","extraExplanation":["这是医学/外科专业用词，日常英语中很少出现。更常见的相关术语包括 hepaticojejunostomy（肝管空肠吻合术）与 choledochoenterostomy（胆总管-肠吻合术）。","它通常用于处理胆道梗阻或胆道损伤等情况；婴儿胆道闭锁的经典手术是 Kasai portoenterostomy（葛西手术/肝门空肠吻合术），与本词在概念上相近。","词源拆解有助记忆：hepatic-（肝的）+ entero-（肠的）+ -stomy（造口/吻合形成的开口）。"]}
{"word":"hepaticoenterostomy","summary":{"en":"A surgery connecting the liver’s bile drainage area to the intestine to allow bile to flow into the bowel.","zh":"将肝脏胆汁引流区域与肠道连接起来、让胆汁进入肠道的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation that creates a connection (anastomosis) between the liver’s bile ducts or hepatic duct area and the intestine, so bile can drain into the bowel.","zh":"一种外科手术，通过在肝脏的胆道/肝管区域与肠道之间建立吻合口，使胆汁能够引流进入肠道。"},"examples":[{"en":"The surgeon performed a hepaticoenterostomy to restore bile drainage after the bile duct was blocked.","zh":"由于胆管阻塞，外科医生进行了肝胆道—肠吻合术以恢复胆汁引流。"},{"en":"In some children with biliary atresia, a type of hepaticoenterostomy may be considered.","zh":"对于一些患有胆道闭锁的儿童，可能会考虑某种形式的肝胆道—肠吻合术。"}]}],"synonyms":["hepaticojejunostomy","biliary-enteric anastomosis","hepatic-enterostomy"],"phonetic":"/həˌpætɪkoʊˌɛntəˈrɑstəmi/","extraExplanation":["词源拆解：hepatico- 表示“肝的”，entero- 表示“肠的”，-stomy 表示“造口/外科建立通道”。合起来就是“肝（胆道）与肠之间建立通道的手术”。","临床上常见的相关术式是 hepaticojejunostomy（肝空肠吻合术），属于 hepaticoenterostomy 的一种更具体的说法；不同术式选择取决于病因（如胆道梗阻、胆道损伤、胆道闭锁等）与患者情况。","这是专业医学术语，日常英语里不常用；在病历、手术记录或学术文章中更常见。"]}
{"word":"hepaticogastrostomy","summary":{"en":"Hepaticogastrostomy is a procedure that connects a bile duct in the liver to the stomach to drain bile.","zh":"hepaticogastrostomy 指在肝内胆管与胃之间建立通道以引流胆汁的手术/内镜操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical or endoscopic procedure that creates a passage (anastomosis) between the liver’s bile duct system (usually an intrahepatic bile duct) and the stomach to allow bile drainage.","zh":"肝胃吻合术：一种外科或内镜操作，在肝内胆管与胃之间建立通道（吻合口），以便引流胆汁。"},"examples":[{"en":"Because the bile duct was blocked, the team performed an EUS-guided hepaticogastrostomy to drain bile into the stomach.","zh":"由于胆道阻塞，团队进行了超声内镜（EUS）引导下的肝胃吻合术，将胆汁引流入胃内。"},{"en":"Hepaticogastrostomy may be considered when standard ERCP is not possible.","zh":"当常规ERCP无法进行时，可能会考虑肝胃吻合术。"}]}],"synonyms":["EUS-guided hepaticogastrostomy","hepaticogastrostomy (HGS)","biliary drainage (contextual)"],"phonetic":"/həˌpætɪkoʊˌɡæˈstrɑstəmi/","extraExplanation":["这是一个医学复合词：hepatico-（肝/肝脏相关）+ gastro-（胃）+ -stomy（造口/建立开口）。字面意思就是“在肝胆管系统与胃之间建立开口”。","临床上常用于“胆道引流”的替代方案，尤其是在ERCP失败或无法进入十二指肠乳头时；现代常见做法是EUS引导下放置支架（stent）建立引流通道。"]}
{"word":"hepaticologist","summary":{"en":"A hepatologist is a liver specialist doctor.","zh":"hepatologist 指肝病专科医生（肝脏相关疾病专家）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A doctor who specializes in diagnosing and treating diseases of the liver (and often the gallbladder, bile ducts, and pancreas).","zh":"肝病专科医生；专门诊断与治疗肝脏疾病（常也涵盖胆囊、胆管与胰腺相关问题）的医生。"},"examples":[{"en":"My doctor referred me to a hepatologist because my liver enzymes were high.","zh":"因为我的肝酶偏高，医生把我转诊给了肝病专科医生。"},{"en":"A hepatologist can help manage chronic hepatitis and cirrhosis.","zh":"肝病专科医生可以帮助管理慢性肝炎和肝硬化。"}]}],"synonyms":["liver specialist","liver doctor"],"phonetic":"/ˌhɛpəˈtɑlədʒɪst/","extraExplanation":["“hepaticologist”并不是常见或规范的英文词。你可能想写的是 **hepatologist**（肝病专科医生）。","词根提示：**hepato-** 来自希腊语，意思是“肝”；**-logist** 指“某领域的专家/研究者”。"]}
{"word":"hepaticology","summary":{"en":"Hepatology is the medical specialty focused on the liver and related organs and diseases.","zh":"Hepatology（肝病学）是研究与诊治肝脏及相关器官疾病的医学专科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “hepatology”.) The branch of medicine that studies the liver, gallbladder, bile ducts, and pancreas, and the diseases that affect them.","zh":"（通常拼作“hepatology”。）研究肝脏、胆囊、胆管以及胰腺，并诊治相关疾病的医学分支。"},"examples":[{"en":"She was referred to hepatology because her liver enzymes were high.","zh":"因为她的肝酶偏高，医生把她转诊到肝病专科（hepatology）。"},{"en":"Hepatology clinics often treat hepatitis, fatty liver disease, and cirrhosis.","zh":"肝病专科门诊常常治疗肝炎、脂肪肝和肝硬化等疾病。"}]}],"synonyms":["liver medicine","hepatology"],"phonetic":"/ˌhɛpəˈtɑlədʒi/","extraExplanation":["“hepaticology”在英语里不常见，最常用、最标准的说法是 **hepatology**（肝病学/肝脏病学）。在医学英语中，你会更常看到：a hepatologist（肝病专科医生）, hepatology department（肝病科/肝脏科）。","词根提示：**hepat-** 来自希腊语，意思是“肝脏”；**-logy** 表示“……学/研究”。而 **hepatic** 是形容词，表示“肝脏的/与肝有关的”（如 hepatic function 肝功能）。"]}
{"word":"hepaticopulmonary","summary":{"en":"A medical adjective meaning “related to both the liver and the lungs.”","zh":"医学形容词，表示“与肝脏和肺两者都相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the liver (hepatic) and the lungs (pulmonary).","zh":"（医学）与肝脏（hepatic）和肺（pulmonary）两者都有关的；肝-肺相关的。"},"examples":[{"en":"The doctor discussed a possible hepaticopulmonary complication after long-term liver disease.","zh":"医生讨论了长期肝病后可能出现的肝-肺相关并发症。"},{"en":"Hepaticopulmonary changes can affect breathing and oxygen levels.","zh":"肝-肺相关改变可能影响呼吸和血氧水平。"}]}],"synonyms":["hepato-pulmonary","liver–lung (related)"],"phonetic":"/hɪˌpæ.tɪ.koʊˈpʌl.məˌnɛr.i/","extraExplanation":["这个词常见于医学语境，尤其与“肝肺综合征（hepatopulmonary syndrome, HPS）”相关：一些严重肝病患者会出现肺血管扩张，导致低氧血症（血氧偏低），表现为气短、乏力等。","构词法：hepatico-（表示“肝的/与肝有关的”）+ pulmonary（肺的）。其中“-o-”常用于把两个解剖/医学概念连接成复合形容词。"]}
{"word":"hepaticostomy","summary":{"en":"Hepaticostomy is a surgery that creates an opening into the liver or hepatic/bile ducts to drain bile.","zh":"Hepaticostomy（肝造口术）是通过手术在肝脏或肝胆管建立开口，以引流胆汁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure that creates an opening (a stoma) into the liver or hepatic/bile ducts to allow bile to drain, often to the outside of the body or into another part of the digestive system.","zh":"一种外科手术：在肝脏或肝胆管（胆道）建立一个“造口”（开口），让胆汁能够引流出来，通常引流到体外或接入消化道的其他部位。"},"examples":[{"en":"After the injury to the bile duct, the surgeon performed a hepaticostomy to drain bile safely.","zh":"胆管受伤后，外科医生进行了肝造口术（hepaticostomy），以安全引流胆汁。"},{"en":"The report noted that a hepaticostomy tube was placed for temporary bile drainage.","zh":"报告指出，为了暂时引流胆汁，放置了肝造口引流管。"}]}],"synonyms":["biliary stoma (context-dependent)","bile duct stoma (context-dependent)"],"phonetic":"/həˌpætɪˈkɑstəmi/","extraExplanation":["词源上可拆解为 hepatico-（与肝脏有关）+ -stomy（“造口/开口”的意思，常见于 colostomy 结肠造口、tracheostomy 气管造口等）。","在临床语境中，这类术语多出现在手术记录或影像/病理报告里；日常英语里很少使用。具体做法与适应证因病因（如胆道梗阻、胆管损伤、肿瘤等）及手术方案而异。"]}
{"word":"hepaticotomy","summary":{"en":"Hepaticotomy means a surgical cut into the liver.","zh":"hepaticotomy 指“对肝脏进行外科切开”的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical incision into the liver (usually done to access, explore, remove, or repair liver tissue).","zh":"肝切开术；对肝脏进行外科切开（通常用于进入、探查、切除或修复肝组织）。"},"examples":[{"en":"The surgeon performed a hepaticotomy to control bleeding after the injury.","zh":"外科医生进行了肝切开术，以控制受伤后的出血。"},{"en":"Hepaticotomy may be necessary when imaging cannot fully explain a liver mass.","zh":"当影像检查无法完全解释肝脏肿块时，可能需要进行肝切开术。"}]}],"synonyms":["liver incision","surgical incision of the liver"],"phonetic":"/hɪˌpædɪˈkɑtəmi/","extraExplanation":["这是较少在日常英语中出现的医学术语，多见于外科或病历记录。","词源结构：hepatic-（与肝脏有关）+ -tomy（切开术）。很多医学词都用“-tomy”表示“切开”（如 tracheotomy 气管切开术）。","注意区分：-tomy（切开/进入）与 -ectomy（切除，如 hepatectomy 肝切除术）不同。"]}
{"word":"hepatics","summary":{"en":"Hepatics most commonly means liverworts (a type of small plant). Less commonly, it can mean remedies believed to help the liver.","zh":"hepatics 最常指“地钱类植物（liverwort，复数）”；较少见时也可指“被认为有助于肝脏的药物/疗法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Liverworts—small plants that often grow in damp places, traditionally linked with the liver because some species look a bit like it.","zh":"（复数名词）地钱类植物/苔类中的“地钱”（liverwort）——常生长在潮湿环境中的小型植物；传统上因外形被认为与肝脏相似而得名。"},"examples":[{"en":"Hepatics often grow on wet rocks and shaded soil.","zh":"地钱类植物常长在潮湿的岩石上或阴湿的土壤里。"},{"en":"The field guide lists mosses, lichens, and hepatics separately.","zh":"这本野外手册把藓类、地衣和地钱类植物分开列出。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun, less common) Medicines or remedies thought to help the liver; “hepatic medicines.”","zh":"（复数名词，较少见）被认为有助于肝脏的药物或疗法；即“护肝药/治肝药”。"},"examples":[{"en":"In older texts, bitters were sometimes described as hepatics.","zh":"在较早的文献里，苦味剂有时被称为“护肝药”。"},{"en":"The term “hepatics” is mostly historical and not common in modern medical writing.","zh":"“hepatics”这个说法主要见于旧文献，在现代医学写作中不常用。"}]}],"synonyms":["liverworts","hepatic remedies (historical)"],"phonetic":"/hɪˈpætɪks/","extraExplanation":["“hepatic”来自希腊语 hēpar（肝）。因此在英语里既能指“与肝有关的”（形容词），也在植物学中指“liverwort（地钱）”。“hepatics”常见于植物学语境，表示“地钱类植物（复数）”。"]}
{"word":"hepatisation","summary":{"en":"Hepatisation is a medical term for lung tissue becoming firm and liver-like, especially during lobar pneumonia.","zh":"Hepatisation 是医学术语，指肺组织（尤其在大叶性肺炎中）变得坚实并呈“肝样”的变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Pathology) A change in lung tissue—most often in lobar pneumonia—where the air spaces fill with fluid and cells, making the lung firm and “liver-like.”","zh":"（病理学）常见于大叶性肺炎时，肺组织因肺泡腔被渗出液和细胞充满而变得坚实，外观与触感呈“像肝一样”的改变。"},"examples":[{"en":"In lobar pneumonia, the lung may undergo hepatization and become solid rather than air-filled.","zh":"在大叶性肺炎中，肺可能发生 hepatisation（肝样变），从充满空气变为实变。"},{"en":"The doctor explained that hepatization means the lung feels firm, almost like liver tissue.","zh":"医生解释说，肝样变指的是肺触感变得坚实，几乎像肝组织一样。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally: the process of becoming liver-like in texture or appearance (in tissue).","zh":"更广义：组织在质地或外观上变得“肝样”的过程。"},"examples":[{"en":"The report described hepatization-like changes in the affected tissue.","zh":"报告描述了受累组织出现类似肝样变的改变。"}]}],"synonyms":["hepatization","red hepatization","gray hepatization","consolidation (related)"],"phonetic":"/ˌhɛpətaɪˈzeɪʃən/","extraExplanation":["“hepatisation”是英式拼写；美式更常见拼写是“hepatization”。两者意思相同。","在经典的大叶性肺炎分期里，常提到“red hepatization（红色肝样变）”与“gray hepatization（灰色肝样变）”，描述肺实变在不同阶段的颜色与细胞成分变化。"]}
{"word":"hepatise","summary":{"en":"A medical verb meaning “to make or become liver-like,” especially describing pneumonia-related changes in the lung.","zh":"医学动词，指“使（或变得）呈肝样外观/质地”，尤用于描述肺炎时肺组织的肝样变。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Medical) to make an organ or tissue become liver-like in color and texture, especially describing a lung change in pneumonia.","zh":"（医学）使器官或组织呈“肝样”外观与质地；尤指肺在肺炎中出现类似肝脏的变硬、变实改变。"},"examples":[{"en":"In lobar pneumonia, the lung may hepatise and become firm and reddish.","zh":"在大叶性肺炎中，肺可能会发生肝样变，变得坚实并呈红色。"},{"en":"The report noted that portions of the lung had hepatised, consistent with severe infection.","zh":"报告指出肺部部分区域出现肝样变，与严重感染相符。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Medical) to become liver-like (said of tissue, especially the lung).","zh":"（医学）（尤指肺组织）变得呈肝样外观与质地；发生肝样变。"},"examples":[{"en":"By the second stage, the affected area can hepatise.","zh":"到第二阶段时，受累区域可能会发生肝样变。"},{"en":"If the lung hepatises, breathing may worsen because the tissue is less airy.","zh":"如果肺发生肝样变，由于组织含气量减少，呼吸可能会加重。"}]}],"synonyms":["hepatize","undergo hepatization","liver-like change"],"phonetic":"/hɪˈpætaɪz/","extraExplanation":["“hepatise”是较少见的拼写形式，对应更常见的美式/学术拼写“hepatize”。词根来自希腊语 *hepar*（肝）。","在病理学里常见名词“hepatization（肝样变）”，传统上用于描述大叶性肺炎的阶段性改变，如“red hepatization（红色肝样变）”与“gray hepatization（灰色肝样变）”。这种说法偏专业，日常英语中很少用。"]}
{"word":"hepatised","summary":{"en":"“Hepatised” means tissue—especially lung in pneumonia—has become liver-like (hepatized).","zh":"“hepatised”指组织（尤指肺炎时的肺）发生肝样变，呈现类似肝脏的质地与颜色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Pathology) Having become liver-like in texture and color, especially lung tissue during pneumonia (\"hepatization\").","zh":"（病理）呈“肝样变”的；质地与颜色变得像肝脏一样，尤指肺炎时肺组织的变化（肝样变）。"},"examples":[{"en":"The doctor noted that the lung was hepatised, a sign of advanced pneumonia.","zh":"医生记录说肺组织出现了肝样变，这是肺炎较严重阶段的迹象。"},{"en":"On examination, parts of the lower lobe appeared dark and hepatised.","zh":"检查时，下叶部分区域颜色发暗并呈肝样变。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hepatise/hepatize”: to cause tissue (especially lung) to become liver-like.","zh":"“hepatise/hepatize”的过去式/过去分词：使组织（尤指肺）发生肝样变。"},"examples":[{"en":"In classic descriptions, pneumonia can leave the lung hepatized before recovery begins.","zh":"在经典描述中，肺炎可使肺组织先发生肝样变，然后才进入恢复。"}]}],"synonyms":["hepatized","liver-like (pathology)"],"phonetic":"/həˈpætəˌsaɪzd/","extraExplanation":["“hepatised”多见于医学/病理学语境，常与肺炎的“红色肝样变（red hepatization）/灰色肝样变（gray hepatization）”等阶段性描述相关。","拼写上，英式常用 hepatised/hepatise，美式更常见 hepatized/hepatize。"]}
{"word":"hepatising","summary":{"en":"“Hepatising” (more often “hepatizing”) is a medical term meaning tissue—especially lung tissue in pneumonia—becoming liver-like (consolidated).","zh":"“hepatising”（更常见写法为“hepatizing”）是医学用语，指组织（尤指肺炎时的肺组织）发生“肝样变”，变得像肝一样坚实。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Becoming liver-like in texture or appearance (especially of lung tissue in pneumonia); causing tissue to become liver-like.","zh":"（医学）呈肝样变；使组织（尤指肺组织在肺炎时）变得像肝一样坚实。"},"examples":[{"en":"In lobar pneumonia, the lung may show red hepatising in the early stage.","zh":"在大叶性肺炎中，肺在早期可能出现“红色肝样变”。"},{"en":"The report noted that the lower lobe was hepatising, suggesting consolidation.","zh":"报告指出下叶出现肝样变，提示肺实变。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of hepatis(e): to make (tissue) liver-like; to undergo hepatisation.","zh":"hepatis(e) 的现在分词：使（组织）肝样化；发生肝样变。"},"examples":[{"en":"The infection was hepatising the affected area of the lung.","zh":"感染使受累的肺部区域发生肝样变。"},{"en":"The lung tissue is hepatising as inflammation progresses.","zh":"随着炎症进展，肺组织正在发生肝样变。"}]}],"synonyms":["hepatizing","undergoing hepatization","consolidating (in pneumonia context)"],"phonetic":"/ˈhɛpəˌtaɪzɪŋ/","extraExplanation":["“hepatising”更常见的拼写是美式 **hepatizing**；相关名词是 **hepatisation/hepatization（肝样变）**。","词根来自希腊语 **hēpar/hepat-（肝）**。在经典病理学里，描述肺炎导致肺泡充满渗出物后，肺变得像肝一样“沉、实、切面颗粒感”的状态；常分为 **red hepatization（红色肝样变）** 与 **gray hepatization（灰色肝样变）** 两阶段。","这是较少在日常英语出现的专业词，通常见于医学教材、病理报告或论文。"]}
{"word":"hepatite","summary":{"en":"Hepatitis means inflammation of the liver, often caused by a virus.","zh":"Hepatitis 指“肝炎”，即肝脏发炎，常见原因是病毒感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the liver, usually caused by a virus, alcohol, drugs, or an autoimmune condition.","zh":"肝炎：肝脏发炎，常由病毒、酒精、药物或自身免疫问题引起。"},"examples":[{"en":"Hepatitis B can spread through blood and other body fluids.","zh":"乙型肝炎可通过血液和其他体液传播。"},{"en":"The doctor ordered a blood test to check for hepatitis.","zh":"医生安排了验血来检查是否有肝炎。"},{"en":"Some people with hepatitis have no symptoms at first.","zh":"有些人感染肝炎后起初可能没有症状。"}]}],"synonyms":["liver inflammation"],"phonetic":"/ˌhɛpəˈtaɪtɪs/","extraExplanation":["你输入的“hepatite”更像是法语里的拼写（法语：hépatite），英语通常写作“hepatitis”。在医学英语里也常见“hepatic”（与肝脏有关的，形容词）。","常见类型包括 hepatitis A/B/C（甲/乙/丙型肝炎）。A型多与受污染的食物/水有关；B、C型更常与血液或体液传播相关。日常交流中若谈到具体类型，最好加上字母（如 hepatitis C）。"]}
{"word":"hepatitis","summary":{"en":"Hepatitis is inflammation of the liver, often caused by viruses, and it can be acute or chronic.","zh":"Hepatitis 指肝脏发炎，常由病毒引起，可为急性或慢性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An illness in which the liver becomes inflamed (swollen and irritated), often caused by a virus.","zh":"肝炎：肝脏发生炎症（肿胀、受刺激）的一种疾病，常由病毒引起。"},"examples":[{"en":"The doctor ordered blood tests to check for hepatitis.","zh":"医生开了血液检查来确认是否有肝炎。"},{"en":"Some types of hepatitis can be prevented with vaccines.","zh":"某些类型的肝炎可以通过疫苗预防。"},{"en":"He was advised to avoid alcohol because it can worsen hepatitis.","zh":"他被建议避免饮酒，因为酒精可能会加重肝炎。"}]},{"partOfSpeech":"n.","definition":{"en":"The medical condition of having an inflamed liver, which may be acute (short-term) or chronic (long-term).","zh":"肝脏炎症的医学状态，可为急性（短期）或慢性（长期）。"},"examples":[{"en":"Chronic hepatitis may cause long-term liver damage if untreated.","zh":"慢性肝炎如果不治疗，可能会造成长期肝损伤。"},{"en":"She developed acute hepatitis after a viral infection.","zh":"她在病毒感染后出现了急性肝炎。"}]}],"synonyms":["liver inflammation"],"phonetic":"/ˌhɛpəˈtaɪtɪs/","extraExplanation":["“hepat-”来自希腊语，意思是“肝脏”；“-itis”表示“炎症”。所以 hepatitis 字面意思就是“肝脏的炎症”。","日常和医学语境中常见的分类有 hepatitis A、B、C（甲/乙/丙型肝炎）。它们的传播途径和治疗方式可能不同，因此就医时通常会进一步检测具体类型。"]}
{"word":"hepatization","summary":{"en":"Hepatization is a pneumonia-related change where the lung becomes solid and liver-like because its air spaces fill with fluid and cells.","zh":"Hepatization 指多见于肺炎时肺组织变得坚实、像肝一样的“实变”，原因是肺泡内充满液体与细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical change in lung tissue (usually in pneumonia) where the lung becomes firm and solid, resembling the texture of the liver, because the air spaces fill with fluid and cells.","zh":"（医学）常见于肺炎时的一种肺组织变化：肺变得坚实、实变，触感类似肝脏，这是因为肺泡内充满液体和细胞，空气减少。"},"examples":[{"en":"In lobar pneumonia, the lung may undergo hepatization and become firm instead of spongy.","zh":"在大叶性肺炎中，肺可能发生肝样变（实变），变得坚实而不再像海绵一样有弹性。"},{"en":"The report described red hepatization as part of the pneumonia’s progression.","zh":"报告将“红色肝样变”描述为肺炎进展过程中的一个阶段。"}]}],"synonyms":["consolidation","lung consolidation"],"phonetic":"/ˌhɛpətəˈzeɪʃən/","extraExplanation":["“hepatization”来自“hepatic（肝的）”这一词根，字面意思是“变得像肝一样”。这里强调的是肺组织在某些炎症（尤其经典的大叶性肺炎）中变得致密、呈“实变”的外观与触感。","临床与病理学中常提到两个相关阶段：red hepatization（红色肝样变）与gray hepatization（灰色肝样变），反映肺泡内红细胞、白细胞和纤维素渗出物的变化。该术语更多用于病理描述与教材语境，日常就医沟通中通常会说“consolidation（肺实变）”。"]}
{"word":"hepatize","summary":{"en":"A medical verb meaning “to make tissue (especially lung) become liver-like due to disease.”","zh":"医学动词，指“使组织（尤指肺）因疾病而变得像肝一样（肝样变）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Medicine) To make (tissue, especially lung tissue) become liver-like in color and firmness, typically due to disease (such as pneumonia).","zh":"（医学）使（组织，尤指肺组织）变得像肝一样的颜色与硬度，通常由疾病（如肺炎）引起。"},"examples":[{"en":"In lobar pneumonia, the lung may hepatize during the acute stage.","zh":"在大叶性肺炎中，肺在急性期可能出现“肝样变”（hepatize）。"},{"en":"The report notes that parts of the lung had hepatized, indicating severe inflammation.","zh":"报告指出部分肺组织已肝样变，提示炎症较重。"}]}],"synonyms":["hepatize (rare medical term)","cause hepatization","induce hepatization"],"phonetic":"/həˈpætaɪz/","extraExplanation":["这是一个比较少见、偏专业的医学用词，常见于病理学/临床描述中。最常见的相关名词是 hepatization（肝样变）。在经典的大叶性肺炎过程中，常提到 red hepatization（红色肝样变）和 gray hepatization（灰色肝样变），用来描述肺组织在不同阶段呈现“像肝一样”的外观与质地。","词根 hepato- 来自希腊语，表示“肝”；-ize 表示“使成为/使具有……性质”。"]}
{"word":"hepatized","summary":{"en":"Hepatized is a medical term meaning tissue (especially lung in pneumonia) has become firm and liver-like; it can also be the past form of hepatize.","zh":"hepatized 是医学用语，指组织（尤指肺炎时的肺）发生肝样变，变得坚实且像肝脏；也可作 hepatize 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Having become liver-like in texture and appearance (especially lung tissue in pneumonia).","zh":"（医学）呈“肝样变”的；质地和外观变得像肝脏（尤指肺炎时的肺组织）。"},"examples":[{"en":"In lobar pneumonia, the affected lung may look dark and firm—almost like liver—so it is described as hepatized.","zh":"在大叶性肺炎中，受累肺叶可能变得暗红而坚实，几乎像肝脏，因此可描述为发生了“肝样变”（hepatized）。"},{"en":"The pathology report noted a hepatized area in the lower lobe.","zh":"病理报告提到下叶有一片“肝样变”区域。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of hepatize: to make (tissue) become liver-like.","zh":"hepatize 的过去式/过去分词：使（组织）发生肝样变，使其变得像肝脏。"},"examples":[{"en":"The lung tissue was described as hepatized by the inflammatory process.","zh":"肺组织被描述为因炎症过程而发生了肝样变。"}]}],"synonyms":["liver-like","hepatization (related noun)","consolidated (related, especially for lung)"],"phonetic":"/hɛpəˌtaɪzd/","extraExplanation":["“hepatized / hepatization（肝样变）”常见于讲解大叶性肺炎的经典分期：充血期（congestion）→红色肝样变（red hepatization）→灰色肝样变（gray hepatization）→消散期（resolution）。这里的“像肝脏”指外观与触感：更坚实、较少含气、切面呈颗粒或致密。","词源提示：hepat- 来自希腊语，意为“肝”；-ize 表示“使……化”；-ed 在这里多作形容词用，表示“已经变成……的”。","使用场景：该词偏专业，多出现在病理学、影像学或临床记录中；日常英语几乎不使用。"]}
{"word":"hepatizes","summary":{"en":"“Hepatizes” is a rare medical verb form meaning “affects the liver” or “makes tissue liver-like.”","zh":"“Hepatizes”是罕见的医学动词形式，表示“影响肝脏”或“使组织呈肝样状态（肝样变）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, medical) to affect the liver or make something like liver tissue; used mostly in technical writing.","zh":"（罕见，医学）使影响肝脏；或使（组织/病变）呈现类似肝组织的状态；多见于专业文献。"},"examples":[{"en":"Some toxins can hepatize the liver over time, leading to serious damage.","zh":"一些毒素随着时间推移可能会影响肝脏，造成严重损伤。"},{"en":"In older medical descriptions, doctors wrote that pneumonia could “hepatize” part of the lung.","zh":"在较早的医学描述中，医生写到肺炎可能使部分肺组织“肝样变”。"}]},{"partOfSpeech":"v.","definition":{"en":"(Third-person singular present) “hepatizes” = it/he/she hepatizes.","zh":"（一般现在时第三人称单数）hepatizes = 他/她/它 hepatize（使肝样变/影响肝脏）。"},"examples":[{"en":"The report notes that the chemical hepatizes tissue in animal studies.","zh":"报告指出该化学物质在动物研究中会使组织出现肝样改变。"}]}],"synonyms":["affect the liver","cause liver damage","induce hepatic changes"],"phonetic":"/həˈpæˌtaɪz/","extraExplanation":["“hepat-”来自希腊语，意思是“肝”。因此 hepatize 这种词通常只在医学/生物学语境出现，日常英语很少用。","你输入的“hepatizes”更像是动词 hepatize 的第三人称单数形式；在一般写作中更常见的表达是 “affects the liver / causes liver damage”（影响肝脏/导致肝损伤）或“hepatic changes”（肝脏/肝性改变）。"]}
{"word":"hepatizing","summary":{"en":"A medical term meaning tissue (especially lung) is becoming or being made liver-like, often in pneumonia.","zh":"医学术语，指组织（尤指肺）正在变得或被变得像肝脏一样（肝样变），常见于肺炎等炎症过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(medical) Becoming or causing tissue—especially the lungs—to become liver-like in color and firmness, often due to inflammation (as in pneumonia).","zh":"（医学）使组织（尤指肺）变得像肝脏一样的颜色和硬度，或正在变成这种状态；常见于炎症过程（如肺炎）。"},"examples":[{"en":"In severe pneumonia, parts of the lung may be hepatizing, turning firm and dark.","zh":"在严重肺炎中，部分肺组织可能正在发生肝样变（hepatizing），变得坚实、颜色变深。"},{"en":"The pathologist noted hepatizing areas in the lower lobe during examination.","zh":"病理学家在检查中记录到下叶存在肝样变的区域。"}]}],"synonyms":["hepatized","undergoing hepatization","liver-like (pathology)"],"phonetic":"/hɪˈpætaɪzɪŋ/","extraExplanation":["“hepatizing”来自动词“hepatize”（使呈肝样/发生肝样变），常见于病理学描述，尤其与肺炎的“肝变期（hepatization）”相关：肺泡里充满渗出物后，肺组织会变得更实、更像肝脏的触感与外观。该词多用于医学写作，不是日常英语。"]}
{"word":"hepato","summary":{"en":"“hepato-” is a medical word part meaning “liver.”","zh":"“hepato-”是医学构词成分，表示“肝；与肝有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “liver,” used to make medical words about the liver","zh":"构词成分，表示“肝；与肝有关”，常用于医学词汇中"},"examples":[{"en":"Hepatology is the study of the liver.","zh":"Hepatology（肝脏病学）是研究肝脏的学科。"},{"en":"Hepatitis means inflammation of the liver.","zh":"Hepatitis（肝炎）指肝脏的炎症。"},{"en":"A hepatocyte is a liver cell.","zh":"Hepatocyte（肝细胞）是肝脏中的细胞。"}]}],"synonyms":["hepatic (related adjective)","hepatic- (related combining form)"],"phonetic":"/hɪˈpætoʊ/","extraExplanation":["“hepato-”来自希腊语 hepar / hepat-（肝）。在医学英语里它通常作为前缀/构词成分出现，而不是单独成词。","常见搭配：hepato- + -itis（炎症）→ hepatitis（肝炎）；hepato- + -logy（学科）→ hepatology（肝脏病学）；hepato- + -cyte（细胞）→ hepatocyte（肝细胞）。","相关形容词：hepatic（肝的；与肝有关的）。"]}
{"word":"hepatocele","summary":{"en":"A rare medical term meaning a hernia in which part of the liver protrudes through an abnormal opening.","zh":"一个较少见的医学词，指肝脏部分通过异常开口疝出（肝疝）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hernia (protrusion) involving the liver—part of the liver bulges out through an abnormal opening, usually in the abdominal wall or diaphragm.","zh":"肝疝；指肝脏的一部分通过异常开口（常见于腹壁或膈肌）向外突出的一种疝。"},"examples":[{"en":"The CT scan suggested a hepatocele after trauma to the upper abdomen.","zh":"CT 显示上腹部外伤后可能出现肝疝（hepatocele）。"},{"en":"Because hepatocele is rare, doctors often confirm it with imaging tests rather than a physical exam alone.","zh":"由于肝疝较少见，医生通常需要影像检查来确认，而不只依赖体格检查。"}]}],"synonyms":["liver hernia","herniation of the liver","hepatic hernia"],"phonetic":"/ˌhɛpətoʊˈsiːl/","extraExplanation":["词源：hepat(o)- 表示“肝”，-cele 表示“疝、肿胀/突起”（常见于医学术语）。因此 hepatocele 字面意思就是“肝的疝出”。","用法提示：这是较少见、偏医学/外科语境的词。日常交流更常说 “liver hernia” 或直接描述为 “herniation of the liver”。"]}
{"word":"hepatocellular","summary":{"en":"“Hepatocellular” means “related to liver cells.”","zh":"“hepatocellular”指“与肝细胞有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the cells of the liver (hepatocytes).","zh":"与肝细胞（肝实质细胞）有关的；肝细胞性的。"},"examples":[{"en":"The report mentioned hepatocellular injury, meaning damage to liver cells.","zh":"报告提到“hepatocellular injury”，意思是肝细胞受损。"},{"en":"Doctors monitor hepatocellular function using blood tests.","zh":"医生会通过血液检查来监测肝细胞功能。"},{"en":"Hepatocellular carcinoma is a common type of liver cancer.","zh":"hepatocellular carcinoma（肝细胞癌）是一种常见的肝癌类型。"}]}],"synonyms":["hepatic (broader: relating to the liver)","liver-cell (informal/rare)"],"phonetic":"/həˌpætoʊˈsɛljələr/","extraExplanation":["这是医学/生物学里的专业词：hepato- 表示“肝”，cellular 表示“细胞的”。所以 hepatocellular 直译为“肝细胞的”。","临床中常见搭配：hepatocellular carcinoma（HCC，肝细胞癌）、hepatocellular injury（肝细胞损伤）、hepatocellular dysfunction（肝细胞功能障碍）。","有时医生会把肝损伤大致分为 hepatocellular（以肝细胞受损为主）和 cholestatic（以胆汁淤积为主）两种模式，用于描述化验结果的特点。"]}
{"word":"hepatocirrhosis","summary":{"en":"Hepatocirrhosis means cirrhosis (scarring) of the liver, often from long-term hepatitis or other chronic liver damage.","zh":"hepatocirrhosis 指肝硬化，即肝脏长期受损后发生瘢痕化/硬化，常与慢性肝炎等有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a serious liver disease in which long-term damage leads to scarring (cirrhosis) of the liver, often related to chronic hepatitis infection","zh":"肝硬化（尤指由慢性肝炎等长期肝损伤引起的肝脏瘢痕化、硬化性疾病）"},"examples":[{"en":"The doctor explained that hepatocirrhosis can develop after years of chronic hepatitis.","zh":"医生解释说，肝硬化可能在多年慢性肝炎之后逐渐发展出来。"},{"en":"People with hepatocirrhosis may feel tired and lose their appetite.","zh":"肝硬化患者可能会感到疲劳、食欲下降。"}]}],"synonyms":["cirrhosis (of the liver)","hepatic cirrhosis"],"phonetic":"/həˌpæt.oʊ.sɚˈoʊ.sɪs/","extraExplanation":["这个词在医学语境中使用更常见，日常英语里通常直接说 cirrhosis（肝硬化）。hepat- 表示“肝”，cirrhosis 表示“肝硬化/肝脏纤维化导致的结构改变”。","肝硬化的常见风险因素包括：慢性乙/丙型肝炎、长期大量饮酒、脂肪肝/代谢相关脂肪性肝病（MASLD/以前常说 NAFLD）。出现黄疸（皮肤或眼白发黄）、腹水（腹部胀大）、容易出血或淤青等症状应尽快就医。"]}
{"word":"hepatocolic","summary":{"en":"A medical adjective meaning “connected with the liver and the colon.”","zh":"医学形容词，表示“与肝脏和结肠相关的（肝—结肠的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the liver (hepato-) and the colon (colic), especially in anatomy or medicine.","zh":"（医学/解剖）与肝脏（hepato-）和结肠（colic）都有关的；肝—结肠的。"},"examples":[{"en":"The scan suggested inflammation near the hepatocolic region.","zh":"影像检查提示肝—结肠区域附近可能有炎症。"},{"en":"The surgeon carefully separated tissues around the hepatocolic ligament.","zh":"外科医生小心分离肝—结肠韧带周围的组织。"}]}],"synonyms":["hepato-colic","hepatic-colic"],"phonetic":"/hɪˌpætoʊˈkɑːlɪk/","extraExplanation":["这个词多见于专业医学语境，日常英语里很少用。常用于描述解剖结构或手术/影像报告中的位置关系，如“hepatocolic ligament（肝结肠韧带）”。","构词法：hepato- 表示“肝”，colic 在这里来自 colon（结肠），不是“绞痛”的意思（colic pain）。","拼写上有时会写成带连字符的形式 hepatocolic / hepato-colic，含义相同。"]}
{"word":"hepatocystic","summary":{"en":"“Hepatocystic” means relating to the liver and the gallbladder.","zh":"“hepatocystic”指“肝胆的”，即与肝脏和胆囊相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to both the liver and the gallbladder (used mainly in medical contexts).","zh":"（医学用语）肝胆的；与肝脏和胆囊两者有关的。"},"examples":[{"en":"The ultrasound report mentioned mild hepatocystic inflammation.","zh":"超声报告提到轻度肝胆炎症。"},{"en":"The surgeon evaluated the patient’s hepatocystic anatomy before the procedure.","zh":"外科医生在手术前评估了患者的肝胆解剖结构。"}]}],"synonyms":["hepatobiliary","liver-and-gallbladder"],"phonetic":"/ˌhɛpətoʊˈsɪstɪk/","extraExplanation":["词源上由前缀 hepato-（肝）+ cystic（与囊/胆囊有关）构成。临床上更常见的说法是 hepatobiliary（肝胆的），而 hepatocystic 相对少见，通常出现在强调“肝脏+胆囊”这一对结构的语境中。"]}
{"word":"hepatocyte","summary":{"en":"A hepatocyte is the main functional cell of the liver.","zh":"hepatocyte 指肝脏的主要功能细胞——肝细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A liver cell; the main type of cell in the liver that performs many important jobs such as processing nutrients, detoxifying chemicals, and producing bile.","zh":"肝细胞；肝脏中最主要的细胞类型，负责多种重要功能，如处理营养物质、解毒以及产生胆汁。"},"examples":[{"en":"Hepatocytes help the body break down toxins such as alcohol.","zh":"肝细胞帮助人体分解酒精等毒素。"},{"en":"Damage to hepatocytes can raise liver enzyme levels in blood tests.","zh":"肝细胞受损会在血液检查中导致肝酶水平升高。"}]}],"synonyms":["liver cell"],"phonetic":"/həˈpætəˌsaɪt/","extraExplanation":["词源提示：hepat- 来自希腊语，表示“肝”；-cyte 表示“细胞”。所以 hepatocyte 直译就是“肝细胞”。","常见相关词：hepatitis（肝炎），hepatic（肝的/肝脏相关的）。这些词都含有 hepat- 词根。"]}
{"word":"hepatoduodenal","summary":{"en":"A medical adjective meaning “connected with the liver and the duodenum.”","zh":"医学形容词，表示“与肝脏和十二指肠相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the liver (hepato-) and the duodenum (the first part of the small intestine).","zh":"与肝脏（hepato-）和十二指肠（小肠的第一段）有关的。"},"examples":[{"en":"The surgeon identified the hepatoduodenal ligament before clamping the vessels.","zh":"外科医生在夹闭血管前先辨认了肝十二指肠韧带。"},{"en":"Inflammation can spread in the hepatoduodenal region because important ducts and vessels pass through it.","zh":"由于重要的管道与血管经过，炎症可能在肝十二指肠区域扩散。"}]}],"synonyms":["hepatic and duodenal"],"phonetic":"/həˌpætoʊduˈɑːdənəl/","extraExplanation":["这是医学/解剖学用语，常见于“hepatoduodenal ligament（肝十二指肠韧带）”。它是小网膜的一部分，里面通过“门静脉、肝动脉、胆总管”等重要结构，因此在手术（如胆囊或肝胆手术）和影像学描述中很常见。","词源上，hepato- 来自希腊语表示“肝”，duoden- 来自拉丁语，指“十二（指肠）”。看到这种组合词时，通常就可以用前后两部分推断含义。"]}
{"word":"hepatoduodenostomy","summary":{"en":"A medical term for an operation that connects the liver’s bile duct area to the duodenum to allow bile drainage.","zh":"医学术语：通过手术将肝胆管道与十二指肠相连，以利胆汁引流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure that creates a direct connection (anastomosis) between the biliary system from the liver (often the hepatic duct) and the duodenum, so bile can drain into the small intestine.","zh":"一种外科手术，在肝胆系统（常指肝管/肝总管）与十二指肠之间建立直接吻合通道，使胆汁能够引流进入小肠。"},"examples":[{"en":"After the injury blocked the bile duct, the surgeons considered a hepatoduodenostomy to restore bile flow.","zh":"由于损伤导致胆管阻塞，外科医生考虑进行肝—十二指肠吻合术以恢复胆汁流动。"},{"en":"The operative note described a hepatoduodenostomy with good postoperative bile drainage.","zh":"手术记录描述进行了肝—十二指肠吻合术，术后胆汁引流良好。"}]}],"synonyms":["hepaticoduodenostomy","biliary-enteric anastomosis","biliary bypass"],"phonetic":"/həˌpætoʊˌduːˌdiːˈnɑːstəmi/","extraExplanation":["这是非常专业的医学术语，多见于外科（肝胆胰外科）文献与病例记录。日常英语几乎不用。","词源可拆解理解：hepato-（肝）+ duodeno-（十二指肠）+ -stomy（造口/吻合开口）。在英文论文里也常见更规范的写法 hepaticoduodenostomy（多一个 -ico- 连接音），含义基本相同。","与常见的 choledochoduodenostomy（胆总管—十二指肠吻合术）相关，但连接的“管道部位”可能不同；具体指哪一段需要以原文或手术描述为准。"]}
{"word":"hepatodynia","summary":{"en":"A medical term meaning pain in the liver area (right upper abdomen).","zh":"医学术语，指肝区（右上腹）疼痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pain in the liver area; pain felt over the liver (right upper abdomen).","zh":"肝区疼痛；位于肝脏部位（右上腹）的疼痛。"},"examples":[{"en":"The patient reported hepatodynia after meals and tenderness in the right upper abdomen.","zh":"病人表示饭后出现肝区疼痛，并且右上腹有压痛。"},{"en":"Hepatodynia can be a symptom of liver inflammation, gallbladder problems, or other conditions.","zh":"肝区疼痛可能是肝脏炎症、胆囊问题或其他疾病的症状之一。"}]}],"synonyms":["hepatalgia","liver pain","pain in the right upper abdomen"],"phonetic":"/həˌpætoʊˈdɪniə/","extraExplanation":["这是一个医学术语，常见于病历或医学文献，日常口语里更常说“liver pain（肝区/肝脏疼痛）”或“pain in the right upper abdomen（右上腹疼痛）”。","词源结构：hepato- 表示“肝”（来自希腊语），-dynia 表示“疼痛”（同源于医学词如 gastrodynia 胃痛）。因此 hepatodynia 直译就是“肝痛”。","注意：肝区疼痛并不一定意味着“肝脏本身在痛”，也可能与胆囊、胆管、周围组织或肌肉相关；临床上通常需要结合检查结果判断原因。"]}
{"word":"hepatodysentery","summary":{"en":"A rare medical term for dysentery with liver involvement.","zh":"一个较少见的医学词，指累及肝脏的痢疾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical term for dysentery that involves the liver (hepatic involvement), historically used to describe severe intestinal infection associated with liver inflammation or abscess.","zh":"一种医学用语，指“累及肝脏的痢疾”（与肝脏受累相关的痢疾），历史上用于描述严重肠道感染并伴随肝脏炎症或肝脓肿的情况。"},"examples":[{"en":"In older medical reports, hepatodysentery was linked to amoebic infection that could spread from the intestines to the liver.","zh":"在较早的医学报告中，hepatodysentery 常与阿米巴感染相关，感染可从肠道扩散到肝脏。"},{"en":"The doctor considered hepatodysentery because the patient had bloody diarrhea and pain in the right upper abdomen.","zh":"医生考虑 hepatodysentery，因为患者既有血性腹泻，又有右上腹疼痛。"}]}],"synonyms":["amoebic dysentery (when caused by amoebas)","dysentery with hepatic involvement","amoebic liver abscess (related condition)"],"phonetic":"/həˌpætoʊˈdɪsənˌtɛri/","extraExplanation":["这是一个较少见、偏历史/文献性的医学词汇：hepato- 表示“肝”，dysentery 表示“痢疾”。现代临床更常用更具体的诊断名称，例如“阿米巴痢疾（amoebic dysentery）”“阿米巴肝脓肿（amoebic liver abscess）”等。","如果你是在论文或旧文献里看到它，通常是在强调“痢疾不只局限于肠道，还出现肝脏并发症”的意思。"]}
{"word":"hepatoenteric","summary":{"en":"“Hepatoenteric” means relating to the liver and the intestines.","zh":"“hepatoenteric” 指与肝脏和肠道相关的（医学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the liver and the intestines (especially in medical or anatomical contexts).","zh":"（尤用于医学/解剖学）与肝脏和肠道两者有关的。"},"examples":[{"en":"The doctor discussed hepatoenteric circulation in relation to nutrient absorption.","zh":"医生讨论了肝-肠循环与营养吸收的关系。"},{"en":"Some drugs can affect the hepatoenteric system and change digestion.","zh":"一些药物会影响肝-肠系统，从而改变消化。"}]}],"synonyms":["hepatic-enteric","hepatointestinal","hepatogastrointestinal"],"phonetic":"/həˌpætoʊɛnˈtɛrɪk/","extraExplanation":["词源：hepat(o)- 表示“肝”，enteric 表示“肠的”。合起来就是“肝与肠相关的”。","在医学文章里，这个词常出现在讨论“肠—肝轴（gut–liver axis）”、门静脉血流（portal circulation）或胆汁/代谢物在肠道与肝脏之间循环的语境中。"]}
{"word":"hepatoflavin","summary":{"en":"Hepatoflavin is an older technical name for riboflavin (vitamin B2), originally linked to liver extracts.","zh":"hepatoflavin 是核黄素（维生素B2）的较旧技术名称，最初与肝脏提取物相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical/technical) Riboflavin (vitamin B2), especially riboflavin identified or extracted from liver tissue.","zh":"（历史/技术用语）核黄素（维生素B2），尤指最初在肝组织中发现或从肝脏提取的核黄素。"},"examples":[{"en":"Early nutrition studies sometimes used the term “hepatoflavin” for riboflavin isolated from liver extracts.","zh":"早期营养学研究有时用“hepatoflavin”来指从肝提取物中分离出的核黄素。"},{"en":"Modern labels usually say “riboflavin” instead of “hepatoflavin.”","zh":"现代标注通常写“riboflavin（核黄素）”，而不是“hepatoflavin”。"}]}],"synonyms":["riboflavin","vitamin B2","lactoflavin (obsolete)"],"phonetic":"/hɪˌpætoʊˈfleɪvɪn/","extraExplanation":["这个词由 hepa(to)-（肝）+ flavin（黄素/黄色素类化合物）构成，属于较旧的科研命名方式。如今在医学与营养学中基本被 riboflavin（核黄素）或 vitamin B2（维生素B2）取代。","与 lactoflavin（“乳黄素”，旧称）类似，它反映了当时常用“来源器官/组织 + 化学类别”来给维生素相关物质命名的习惯。"]}
{"word":"hepatogastric","summary":{"en":"An anatomical adjective meaning “related to the liver and the stomach,” often referring to the hepatogastric ligament.","zh":"解剖学形容词，表示“与肝脏和胃有关”，常指肝胃韧带。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the liver (hepato-) and the stomach (gastric); especially describing structures that connect or involve both, such as the hepatogastric ligament.","zh":"与肝脏（hepato-）和胃（gastric）有关的；尤指同时涉及或连接肝与胃的结构，如肝胃韧带。"},"examples":[{"en":"The hepatogastric ligament is part of the lesser omentum connecting the liver to the lesser curvature of the stomach.","zh":"肝胃韧带是小网膜的一部分，连接肝脏与胃小弯。"},{"en":"Surgeons may divide the hepatogastric ligament to access the stomach and upper abdomen.","zh":"外科医生有时会切开肝胃韧带，以进入胃及上腹部区域。"}]}],"synonyms":["hepatic-gastric","hepatic and gastric (related to both)"],"phonetic":"/hɛpətoʊˈɡæstrɪk/","extraExplanation":["“hepato-”来自希腊语，意为“肝”；“gastric”与“胃”有关。合在一起的复合词多见于解剖学/医学语境，用来精确说明某结构或病变与肝、胃两者都相关。","“肝胃韧带（hepatogastric ligament）”常被描述为“小网膜（lesser omentum）”的一部分；小网膜还包括“肝十二指肠韧带（hepatoduodenal ligament）”。"]}
{"word":"hepatogenic","summary":{"en":"A medical adjective meaning “originating in or caused by the liver.”","zh":"医学形容词，表示“起源于肝脏或由肝脏引起的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"originating in or produced by the liver; caused by liver activity or disease.","zh":"肝源性的；由肝脏产生的；由肝脏功能或疾病引起的。"},"examples":[{"en":"Doctors suspected a hepatogenic cause for the patient’s high ammonia levels.","zh":"医生怀疑患者的高氨水平是肝源性原因导致的。"},{"en":"Hepatogenic jaundice can occur when the liver cannot process bilirubin properly.","zh":"当肝脏无法正常处理胆红素时，可能出现肝源性黄疸。"}]}],"synonyms":["hepatic (broader)","liver-related","hepatogenous"],"phonetic":"/ˌhɛpəˈtɑːdʒənɪk/","extraExplanation":["词源提示：hepat- 来自希腊语，意为“肝”；-genic 表示“产生……的/引起……的”。因此 hepatogenic 直译为“由肝产生的/由肝引起的”。","使用场景：该词多见于医学或科研语境，用来强调某种物质（如激素、代谢产物）或某种病理机制“来源于肝脏”。日常英语里更常用的表达包括 “from the liver / liver-related / hepatic”。","相关对比：hepatogenic（肝源性的）与 hepatic（肝的、与肝有关的）相比，hepatogenic 更强调“起源/生成/致病来源”；hepatogenous 也可表示“肝源性的”，但临床写作中更常见的是 hepatic 或 liver-related。"]}
{"word":"hepatogenous","summary":{"en":"Hepatogenous means “originating in or coming from the liver.”","zh":"hepatogenous 指“起源于肝脏/由肝脏产生或从肝脏扩散的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Originating in, produced by, or spread from the liver.","zh":"肝源性的；起源于肝脏的；由肝脏产生或从肝脏扩散的。"},"examples":[{"en":"The doctors suspected a hepatogenous infection linked to severe liver disease.","zh":"医生怀疑这是一种与严重肝病相关的肝源性感染。"},{"en":"Imaging was done to check whether the abscess was hepatogenous or from another source.","zh":"进行了影像检查，以确认脓肿是否为肝源性，还是来自其他来源。"}]}],"synonyms":["hepatic (related to the liver)","liver-derived","of hepatic origin"],"phonetic":"/ˌhɛpəˈtɑːdʒənəs/","extraExplanation":["词源：hepat- 表示“肝”（来自希腊语 hēpar），-genous 表示“产生的/来源于……的”。合起来就是“来源于肝脏的”。","使用场景：常见于医学论文、影像学报告或感染来源分析（例如讨论病灶/感染是否“从肝脏而来”）。日常英语中很少使用。"]}
{"word":"hepatography","summary":{"en":"Hepatography is a medical imaging/recording method used to examine the liver.","zh":"hepatography 指用于检查肝脏的医学影像／记录方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical imaging or recording technique used to examine the liver (for example, by creating images after a contrast dye is used).","zh":"（医学）肝脏造影／肝成像：用于检查肝脏的影像或记录技术（例如使用造影剂后生成肝脏影像）。"},"examples":[{"en":"The doctor ordered hepatography to check for blockage in the bile ducts.","zh":"医生安排做肝脏造影，以检查胆管是否有阻塞。"},{"en":"Hepatography can help show the shape and blood supply of the liver.","zh":"肝脏造影有助于显示肝脏的形态和血供情况。"}]}],"synonyms":["liver imaging","hepatic imaging"],"phonetic":"/ˌhɛpəˈtɑɡrəfi/","extraExplanation":["这个词在日常英语里很少见，更常出现在医学论文、影像科报告或教学材料中。常见构词：hepato-（肝）+ -graphy（记录/成像）。在现代临床语境中，更常听到的是更具体的检查名称，如 liver imaging、hepatic angiography（肝血管造影）、cholangiography（胆管造影）等，具体用哪一种取决于检查目标。"]}
{"word":"hepatoid","summary":{"en":"Hepatoid means “liver-like,” used mainly in medical descriptions.","zh":"hepatoid 意为“肝样的、类似肝脏的”，主要用于医学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling the liver in shape, structure, or function (used mainly in medical contexts).","zh":"（医学用语）肝样的；外形、结构或功能类似肝脏的。"},"examples":[{"en":"The biopsy showed hepatoid features under the microscope.","zh":"活检结果显示在显微镜下呈现肝样特征。"},{"en":"Doctors considered a rare hepatoid tumor because the cells looked like liver cells.","zh":"医生考虑到一种罕见的肝样肿瘤，因为这些细胞看起来像肝细胞。"}]}],"synonyms":["liver-like","hepatic-like"],"phonetic":"/hɪˈpætɔɪd/","extraExplanation":["“hepatoid”由词根“hepato-（肝）”+ 后缀“-oid（……样的）”构成，常见于病理学描述，尤其用于“hepatoid carcinoma（肝样癌）”，指肿瘤细胞在形态或分泌功能上类似肝细胞。它不是日常用词，多出现在医学论文、病理报告或专科会诊中。"]}
{"word":"hepatolenticular","summary":{"en":"A medical adjective meaning “related to the liver and the lenticular nucleus (brain).”","zh":"医学形容词，表示“与肝脏和豆状核（大脑）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the liver (hepato-) and the lenticular nucleus (a part of the brain’s basal ganglia).","zh":"与肝脏（hepato-）和豆状核（lenticular nucleus，大脑基底节的一部分）都有关的。"},"examples":[{"en":"The doctor considered a hepatolenticular disorder when liver symptoms appeared together with tremors.","zh":"当肝脏症状与手抖同时出现时，医生考虑可能是肝—豆状核相关的疾病。"},{"en":"Hepatolenticular changes can be seen in certain rare metabolic conditions.","zh":"在某些罕见的代谢性疾病中，可见肝—豆状核相关的改变。"}]}],"synonyms":["hepato-lenticular","hepatolenticular (degeneration/disorder)"],"phonetic":"/ˌhɛpətoʊlɛnˈtɪkjələr/","extraExplanation":["这个词最常见于医学语境，尤其与“hepatolenticular degeneration（肝豆状核变性）”有关，即威尔逊病（Wilson disease）：一种遗传性铜代谢异常，铜在肝脏和大脑（包括豆状核）等组织沉积，可能导致肝功能异常、震颤/运动障碍、精神症状等。","词源拆解：hepato-（肝）+ lenticular（豆状核/晶状体样的；此处指豆状核）+ -ar（形容词后缀）。在日常英语中几乎不使用，多见于病历、论文和教科书。"]}
{"word":"hepatolith","summary":{"en":"A hepatolith is a stone that forms in the liver or the bile ducts in/near the liver.","zh":"hepatolith 指形成于肝脏或肝内（或靠近肝脏）胆管中的结石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stone (calculus) that forms in the liver or in the bile ducts within/near the liver","zh":"肝内结石；发生在肝脏或肝内/肝门附近胆管中的结石"},"examples":[{"en":"The CT scan showed a hepatolith obstructing a branch of the intrahepatic bile duct.","zh":"CT 显示一枚肝内结石阻塞了肝内胆管的一个分支。"},{"en":"Hepatoliths can cause recurrent pain, fever, and jaundice when they block bile flow.","zh":"肝内结石在阻塞胆汁流动时，可能引起反复疼痛、发热和黄疸。"}]}],"synonyms":["intrahepatic stone","intrahepatic biliary stone"],"phonetic":"/ˌhɛpətoʊˈlɪθ/","extraExplanation":["词源上，hepat- 表示“肝”（如 hepatitis 肝炎），-lith 表示“石/结石”（如 nephrolith 肾结石）。","这是医学用语，日常英语里更常见的相关词是 gallstone（胆结石）。当结石位于肝内胆管时，医生可能会用 hepatolith / hepatolithiasis（肝内结石病）。","该词在临床语境中常与 intrahepatic bile duct（肝内胆管）、cholangitis（胆管炎）、obstruction（梗阻）等搭配出现。"]}
{"word":"hepatolithiasis","summary":{"en":"Hepatolithiasis means stones in the liver’s bile ducts (intrahepatic bile duct stones).","zh":"hepatolithiasis 指肝内胆管结石（肝脏内部胆管里的结石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which stones form inside the liver’s bile ducts (intrahepatic bile duct stones).","zh":"（医学）肝内胆管结石：结石形成在肝脏内部的胆管里（肝内胆管内的结石）。"},"examples":[{"en":"The CT scan suggested hepatolithiasis with dilated intrahepatic bile ducts.","zh":"CT提示肝内胆管结石，并见肝内胆管扩张。"},{"en":"Hepatolithiasis can cause repeated episodes of fever and right upper abdominal pain.","zh":"肝内胆管结石可能导致反复发热和右上腹疼痛。"}]}],"synonyms":["intrahepatic bile duct stones","intrahepatic biliary stones"],"phonetic":"/hɛˌpætoʊˌlɪˈθaɪəsɪs/","extraExplanation":["词源拆解：hepato-（肝）+ lith-（石）+ -iasis（疾病/病态）。因此它字面意思是“肝里的结石病”。","语境提示：这是偏专业的医学术语，日常英语中更常见的说法是“intrahepatic bile duct stones”（肝内胆管结石）或更笼统的“bile duct stones”。","相关区别：gallstones（胆结石）通常指胆囊内结石；choledocholithiasis 指“总胆管结石”；hepatolithiasis 特指“肝内胆管结石”。"]}
{"word":"hepatolithic","summary":{"en":"Hepatolithic means “related to stones in the liver (especially intrahepatic bile duct stones).”","zh":"hepatolithic 指“与肝内结石（尤其肝内胆管结石）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to stones (calculi) in the liver or in the liver’s bile ducts (intrahepatic bile ducts); involving hepatolithiasis.","zh":"与肝内结石（尤其是肝内胆管结石）有关的；涉及肝内结石病（hepatolithiasis）的。"},"examples":[{"en":"The CT scan suggested hepatolithic disease with stones in the left intrahepatic ducts.","zh":"CT 提示肝内结石性疾病，左侧肝内胆管可见结石。"},{"en":"She was referred to a specialist for hepatolithic complications such as recurrent cholangitis.","zh":"她因肝内结石相关并发症（如反复胆管炎）转诊至专科。"}]}],"synonyms":["intrahepatic stone-related","related to hepatolithiasis"],"phonetic":"/həˌpætəˈlɪθɪk/","extraExplanation":["这是一个比较少见、偏医学论文/影像学报告用的形容词，多用于描述“肝内胆管结石”相关的病变或并发症。日常英语中更常见的说法是：intrahepatic stones（肝内结石）或 hepatolithiasis（肝内结石病）。","词根帮助记忆：hepato- 表示“肝”，-lith- 表示“石”（如 kidney stone 里的“stone”概念），-ic 表示“……的/与……有关的”。"]}
{"word":"hepatological","summary":{"en":"“Hepatological” means related to the liver or hepatology (the medical field dealing with liver diseases).","zh":"“hepatological”表示“与肝脏或肝病学有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the liver or to the study and treatment of liver diseases (hepatology).","zh":"与肝脏或肝病学（研究与治疗肝脏疾病的学科）有关的。"},"examples":[{"en":"The patient was referred to a hepatological specialist for further tests.","zh":"病人被转诊给肝病学专科医生做进一步检查。"},{"en":"Hepatological research often focuses on hepatitis and fatty liver disease.","zh":"肝病学研究常常关注肝炎和脂肪肝。"}]}],"synonyms":["hepatic","hepatologic"],"phonetic":"/həˌpætəˈlɑdʒɪkəl/","extraExplanation":["“hepatological”在现代医学英语中相对少见，更常见的形容词是“hepatologic”或“hepatic”（更日常、更短）。例如：hepatic function（肝功能）、hepatologic clinic（肝病门诊）。","词根来自希腊语“hēpar/hepat-”（肝脏）。你会在很多医学词中看到它：hepatitis（肝炎）、hepatomegaly（肝肿大）。"]}
{"word":"hepatologist","summary":{"en":"A hepatologist is a doctor specializing in liver-related diseases and treatment.","zh":"hepatologist 指肝病专科医生，专治肝脏及相关胆道系统疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A doctor who specializes in diagnosing and treating diseases of the liver, gallbladder, and bile ducts.","zh":"肝病专科医生；专门诊断和治疗肝脏、胆囊及胆道疾病的医生。"},"examples":[{"en":"My doctor referred me to a hepatologist because my liver enzymes were high.","zh":"因为我的肝酶偏高，医生把我转诊给了肝病专科医生。"},{"en":"A hepatologist may treat hepatitis, fatty liver disease, or cirrhosis.","zh":"肝病专科医生可能会治疗肝炎、脂肪肝或肝硬化。"}]}],"synonyms":["liver specialist","liver doctor"],"phonetic":"/ˌhɛpəˈtɑlədʒɪst/","extraExplanation":["词源小提示：hepat- 来自希腊语，意思是“肝脏”；-ologist 表示“……学/……领域的专家或研究者”。所以 hepatologist 字面上就是“肝脏方面的专家医生”。","相关词：hepatitis（肝炎），hepatic（肝的/与肝有关的），gastroenterologist（胃肠科医生；很多肝病专科医生也属于消化科/胃肠科的分支）。"]}
{"word":"hepatology","summary":{"en":"Hepatology is the medical specialty focused on the liver and liver-related diseases.","zh":"Hepatology 指专门研究肝脏及相关疾病的医学专科（肝病学/肝病科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the branch of medicine that studies the liver, gallbladder, bile ducts, and related diseases (such as hepatitis, fatty liver disease, and cirrhosis)","zh":"肝病学；研究肝脏、胆囊、胆管及相关疾病（如肝炎、脂肪肝、肝硬化等）的医学分支"},"examples":[{"en":"She is doing a fellowship in hepatology.","zh":"她正在做肝病学方向的专科进修。"},{"en":"The patient was referred to hepatology for abnormal liver tests.","zh":"由于肝功能检查异常，病人被转诊到肝病科。"}]}],"synonyms":["liver medicine","liver specialty"],"phonetic":"/ˌhɛpəˈtɑlədʒi/","extraExplanation":["词根提示：hepat- 来自希腊语，意为“肝脏”；-logy 表示“……学/研究”。所以 hepatology 字面意思就是“肝脏的研究”。","相关科室称呼：在医院里常见的说法是 “hepatology clinic”（肝病门诊）或 “hepatology department/service”（肝病科/肝病团队）。在一些地区也可能归在 gastroenterology（胃肠病学/消化科）之下。"]}
{"word":"hepatolysis","summary":{"en":"Hepatolysis means the breakdown or destruction of liver tissue, mainly used in medical writing.","zh":"Hepatolysis 指肝组织的分解或破坏，主要用于医学文献/专业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the breakdown or destruction of liver tissue (used mainly in medical contexts).","zh":"肝组织的分解或破坏（主要用于医学语境）。"},"examples":[{"en":"Severe infection can sometimes lead to hepatolysis and liver failure.","zh":"严重感染有时会导致肝组织破坏（hepatolysis）并引发肝功能衰竭。"},{"en":"The report mentioned signs of hepatolysis on imaging and abnormal liver enzymes.","zh":"报告提到影像学显示肝组织破坏的迹象，并伴有肝酶异常。"}]}],"synonyms":["destruction of liver tissue","liver tissue breakdown","hepatic tissue lysis"],"phonetic":"/ˌhɛpəˈtɑləsɪs/","extraExplanation":["词源拆解：hepat- 表示“肝”，-lysis 表示“溶解/分解/破坏”。很多医学词都用这种希腊语词根组合，理解词根能帮助你猜测新词含义。","使用提示：hepatolysis 属于较少见、偏专业的术语；在日常英语中更常见的相关说法是 “liver damage”（肝损伤）或 “destruction of liver tissue”（肝组织破坏）。","相关词：hepatitis（肝炎），hepatotoxic（对肝有毒的），hemolysis（溶血：红细胞破坏）。"]}
{"word":"hepatolytic","summary":{"en":"Hepatolytic describes something that breaks down or destroys liver cells or liver tissue.","zh":"hepatolytic 指“导致肝细胞或肝组织溶解、破坏”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing the breakdown (lysis) or destruction of liver cells/tissue.","zh":"导致肝细胞或肝组织发生溶解、破坏的；溶肝的。"},"examples":[{"en":"Some experimental compounds showed hepatolytic effects in animal studies.","zh":"一些实验性化合物在动物研究中表现出溶肝（破坏肝细胞）的作用。"},{"en":"The report warned that high doses may be hepatolytic and should be avoided.","zh":"报告警告说大剂量可能具有溶肝性，应当避免。"}]}],"synonyms":["hepatotoxic","liver-damaging","cytolytic (in context)"],"phonetic":"/həˌpætəˈlɪtɪk/","extraExplanation":["这是一个医学/生物学用语，日常英语中很少见。词形可拆解为：hepato-（肝）+ -lytic（溶解/裂解、破坏）。","在医学写作里更常见的相关词是 hepatotoxic（肝毒性的，损害肝功能）或 hepatocyte lysis（肝细胞裂解）。hepatolytic 更强调“细胞/组织被溶解或裂解”这一机制。"]}
{"word":"hepatoma","summary":{"en":"Hepatoma is a cancerous tumor of the liver, often referring to hepatocellular carcinoma (HCC).","zh":"Hepatoma 指肝脏的恶性肿瘤，常用于指肝细胞癌（HCC）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a malignant (cancerous) tumor of the liver, especially hepatocellular carcinoma (HCC).","zh":"肝脏的恶性肿瘤，尤指肝细胞癌（HCC）。"},"examples":[{"en":"The doctor said the scan suggests a hepatoma in the right lobe of the liver.","zh":"医生说影像检查提示肝右叶可能有肝癌（hepatoma）。"},{"en":"Chronic hepatitis B infection can increase the risk of developing hepatoma.","zh":"慢性乙型肝炎感染会增加发生肝癌（hepatoma）的风险。"}]}],"synonyms":["liver cancer","hepatocellular carcinoma","HCC"],"phonetic":"/ˌhɛpəˈtoʊmə/","extraExplanation":["词源提示：hepat- 来自希腊语，表示“肝脏”，-oma 表示“肿瘤”。因此 hepatoma 字面意思就是“肝脏肿瘤”。","使用提示：在现代医学语境里，hepatoma 常被用来指“肝细胞癌（HCC）”，但严格说也可能泛指肝脏肿瘤。临床交流中更常见、更明确的说法是 hepatocellular carcinoma。","文化/语境补充：在英语医疗信息中，常见相关表达包括 liver cancer（通俗说法）、hepatocellular carcinoma (HCC)（更正式）、risk factors（危险因素，如乙肝、丙肝、肝硬化等）。"]}
{"word":"hepatomalacia","summary":{"en":"Hepatomalacia is a medical term meaning softening/degeneration of the liver tissue.","zh":"Hepatomalacia 是医学术语，指肝组织软化/退变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Softening (degeneration) of the liver tissue, usually caused by severe liver disease.","zh":"肝软化；肝组织的软化（退行性变），通常由严重肝病引起。"},"examples":[{"en":"The report mentioned hepatomalacia, suggesting advanced damage to the liver.","zh":"报告中提到肝软化，提示肝脏已出现较晚期的损伤。"},{"en":"In medical terminology, hepatomalacia combines hepato- (liver) with -malacia (softening).","zh":"在医学术语中，hepatomalacia 由 hepato-（肝）和 -malacia（软化）组成。"}]}],"synonyms":["liver softening","hepatic softening"],"phonetic":"/həˌpætoʊməˈleɪʃə/","extraExplanation":["这是比较少见、偏专业的医学词，一般出现在病理报告或学术文章中，日常英语很少用。","词根记忆：hepato- 表示“肝”（如 hepatitis 肝炎）；-malacia 表示“软化”（如 osteomalacia 骨软化）。","相关常见表达：liver degeneration（肝退变）、liver necrosis（肝坏死，含义不同但常在同一语境出现）、hepatic failure（肝功能衰竭）。"]}
{"word":"hepatomas","summary":{"en":"Hepatomas are liver tumors, especially malignant ones.","zh":"hepatomas 指肝肿瘤，尤指恶性肝肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tumor in the liver, especially a malignant one (often referring to hepatocellular carcinoma)","zh":"肝肿瘤；尤指恶性肝肿瘤（常指肝细胞癌）"},"examples":[{"en":"The scan showed multiple hepatomas in the right lobe of the liver.","zh":"扫描显示肝右叶有多个肝肿瘤。"},{"en":"Doctors suspected hepatomas because the patient had cirrhosis and rising AFP levels.","zh":"由于患者有肝硬化且甲胎蛋白（AFP）升高，医生怀疑是肝肿瘤。"}]}],"synonyms":["liver tumor","hepatic tumor","hepatocellular carcinoma (HCC)"],"phonetic":"/ˌhɛpəˈtoʊmə/","extraExplanation":["“hepatoma”是医学术语，日常英语中不常用；临床交流里更常见的说法是“liver tumor”或更具体的“hepatocellular carcinoma (HCC)”。","你给出的“hepatomas”是复数形式；单数是“hepatoma”。"]}
{"word":"hepatomata","summary":{"en":"Hepatomata means more than one hepatoma—tumors arising in the liver (often referring to liver cancer in clinical contexts).","zh":"hepatomata 指多个 hepatoma，即发生在肝脏（多指肝细胞来源）的肿瘤，临床语境中常与肝癌相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hepatoma: tumors (usually malignant) that arise from liver cells.","zh":"hepatoma 的复数：起源于肝细胞的肿瘤（通常为恶性）。"},"examples":[{"en":"Imaging showed multiple hepatomata in the patient’s liver.","zh":"影像检查显示患者肝脏内有多个肝细胞肿瘤。"},{"en":"Doctors discussed treatment options for hepatomata, including surgery and targeted therapy.","zh":"医生讨论了肝细胞肿瘤的治疗方案，包括手术和靶向治疗。"}]}],"synonyms":["hepatomas","liver tumors","hepatocellular carcinomas (context-dependent)"],"phonetic":"/ˌhɛpəˈtoʊmətə/","extraExplanation":["“hepatoma”在日常英语里有时被用来指“肝细胞癌（hepatocellular carcinoma, HCC）”，但在医学语境中更严谨的说法通常是“hepatocellular carcinoma”。如果你在论文或报告中使用，建议根据具体诊断选择更准确的术语。","词源拆解：hepato- 表示“肝（liver）”，-oma 表示“肿瘤（tumor）”。复数形式在医学拉丁化用法中常见为 -mata（如 carcinoma→carcinomata 的风格类比），但在现代英语里也常见直接加 -s：hepatomas。"]}
{"word":"hepatomegalia","summary":{"en":"Hepatomegalia (more commonly: hepatomegaly) means an enlarged liver.","zh":"hepatomegalia（英语更常写作 hepatomegaly）指“肝肿大/肝脏增大”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal enlargement of the liver (a medical finding, not a disease by itself).","zh":"肝脏异常增大（是一种医学体征/检查发现，本身不等同于某一种疾病）。"},"examples":[{"en":"The ultrasound report noted hepatomegaly and mild fatty changes.","zh":"超声报告提示肝肿大，并有轻度脂肪改变。"},{"en":"Hepatomegaly can be caused by hepatitis, heart failure, or fatty liver disease.","zh":"肝肿大可能由肝炎、心力衰竭或脂肪肝引起。"}]}],"synonyms":["hepatomegaly","enlarged liver","liver enlargement"],"phonetic":"/hɪˌpætoʊˈmiːɡəli/","extraExplanation":["“hepatomegalia”常见于西班牙语或拉丁语系医学语境；英语中更常用拼写是 **hepatomegaly**。两者指同一概念。","词源可拆解为：**hepato-**（肝）+ **-megaly**（增大）。在临床上它通常作为影像学或体检的“所见”，医生会进一步寻找原因（如感染、脂肪变、淤血、肿瘤、血液系统疾病等）。"]}
{"word":"hepatomegaly","summary":{"en":"Hepatomegaly means an enlarged liver.","zh":"hepatomegaly 指“肝脏肿大/肝肿大”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal enlargement of the liver (often found during a medical exam or on imaging).","zh":"肝肿大；肝脏异常增大（常在体检或影像检查中发现）。"},"examples":[{"en":"The ultrasound showed hepatomegaly and fatty changes in the liver.","zh":"超声显示肝肿大，并伴有脂肪性改变。"},{"en":"The doctor palpated her abdomen and noted mild hepatomegaly.","zh":"医生触诊她的腹部，发现轻度肝肿大。"}]}],"synonyms":["enlarged liver","liver enlargement"],"phonetic":"/hɪˌpætoʊˈmɛɡəli/","extraExplanation":["词源拆解：hepato- 表示“肝脏”（来自希腊语 hēpar），-megaly 表示“增大/肿大”。合起来就是“肝脏变大”。","它是一个“体征/检查结果”，不是具体疾病名称；常见相关原因包括脂肪肝、肝炎、酒精性肝病、充血性心力衰竭导致的肝淤血，以及某些肿瘤或血液系统疾病等。实际判断需要结合症状、化验与影像。","常见搭配：mild/marked hepatomegaly（轻度/明显肝肿大），hepatosplenomegaly（肝脾肿大）。"]}
{"word":"hepatomelanosis","summary":{"en":"Hepatomelanosis is an abnormal darkening of the liver caused by pigment (often melanin) deposition.","zh":"Hepatomelanosis 指因色素（常见为黑色素）沉积导致的肝脏异常变黑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which the liver becomes abnormally dark (black or brown) due to melanin or other pigment buildup.","zh":"一种医学状况：由于黑色素或其他色素沉积，肝脏出现异常变黑（呈黑色或褐色）。"},"examples":[{"en":"The necropsy report described hepatomelanosis, noting an unusually dark liver.","zh":"尸检报告描述了肝脏黑变（hepatomelanosis），并指出肝脏颜色异常发黑。"},{"en":"In some animals, hepatomelanosis can be associated with pigment deposition or chronic disease processes.","zh":"在一些动物中，肝脏黑变可能与色素沉积或慢性疾病过程有关。"}]}],"synonyms":["liver melanosis","hepatic melanosis"],"phonetic":"/hɪˌpætoʊˌmɛləˈnoʊsɪs/","extraExplanation":["词源拆解：hepat(o)- 表示“肝”，melan(o)- 表示“黑/黑色素”，-osis 表示“病变/状态”。整体直译就是“肝脏的黑色素相关病变/变黑状态”。","该词多见于医学与兽医学文献、病理报告或研究论文中，属于较专业的术语；日常英语中几乎不会使用。不同物种或病例中，导致“肝变黑”的色素来源可能不同（如黑色素、含铁血黄素等），因此临床解释通常需要结合病理检查与具体病因。"]}
{"word":"hepatonephric","summary":{"en":"Hepatonephric means “related to the liver and the kidneys.”","zh":"hepatonephric 指“与肝脏和肾脏相关的（肝肾）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the liver and the kidneys (used mainly in medical or biological contexts).","zh":"（主要用于医学或生物学语境）与肝脏和肾脏两者有关的。"},"examples":[{"en":"The researchers measured hepatonephric toxicity in the animal study.","zh":"研究人员在动物实验中测量了肝肾毒性（hepatonephric toxicity）。"},{"en":"Patients with severe infection can develop hepatonephric complications.","zh":"严重感染的患者可能会出现肝肾并发症。"}]}],"synonyms":["hepatorenal","hepatic and renal","liver-and-kidney (related)"],"phonetic":"/həˌpætoʊˈnɛfɹɪk/","extraExplanation":["词根拆解：hepat(o)- 表示“肝”（如 hepatitis 肝炎），-nephric 表示“肾的/与肾有关的”（如 nephritis 肾炎）。合在一起就是“肝与肾相关的”。","这是比较少见、偏专业的形容词；日常英语里更常见的表达是 liver and kidney / hepatic and renal。","在学术写作里也可能见到相关搭配：hepatonephric function（肝肾功能）、hepatonephric damage/injury（肝肾损伤）、hepatonephric toxicity（肝肾毒性）。"]}
{"word":"hepatopancreas","summary":{"en":"A combined liver-like and pancreas-like organ found in many invertebrates, especially crustaceans.","zh":"无脊椎动物（尤指甲壳类）中兼具“肝”和“胰腺”功能的消化与储能器官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A digestive and nutrient-storage organ in many invertebrates (especially crustaceans and some mollusks) that combines functions similar to the liver and pancreas in vertebrates.","zh":"许多无脊椎动物（尤其是甲壳类和部分软体动物）体内的一种消化与储存营养的器官，功能类似于脊椎动物的肝脏和胰腺的结合体。"},"examples":[{"en":"In shrimp, the hepatopancreas produces digestive enzymes and stores lipids.","zh":"在虾体内，肝胰腺会产生消化酶并储存脂类。"},{"en":"Scientists measured metal accumulation in the crab’s hepatopancreas to assess pollution.","zh":"科学家测量螃蟹肝胰腺中的金属累积量来评估污染。"}]}],"synonyms":["digestive gland","midgut gland"],"phonetic":"/hɪˌpætoʊˈpæŋkriəs/","extraExplanation":["词源上可拆为 hepato-（肝）+ pancreas（胰腺）。之所以叫“肝胰腺”，是因为在许多甲壳类等动物中，这个器官同时承担类似“肝”的代谢/解毒与类似“胰腺”的消化酶分泌功能。","在水产养殖、食品安全与环境毒理学里很常见：研究者常检测肝胰腺来了解营养状况、疾病（如肝胰腺坏死）或污染物累积。"]}
{"word":"hepatopathy","summary":{"en":"Hepatopathy means a liver disease or disorder.","zh":"hepatopathy 指“肝病/肝脏疾病”，是医学上较正式的总称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A disease or disorder of the liver.","zh":"肝病；肝脏疾病（肝脏的病变或功能障碍）。"},"examples":[{"en":"The doctor ran blood tests to check for hepatopathy.","zh":"医生做了血液检查来确认是否有肝病。"},{"en":"Alcohol misuse can lead to hepatopathy over time.","zh":"长期酗酒可能会导致肝病。"},{"en":"The report mentioned signs of chronic hepatopathy.","zh":"报告提到有慢性肝病的迹象。"}]}],"synonyms":["liver disease","hepatic disease","liver disorder"],"phonetic":"/ˌhɛpəˈtɑpəθi/","extraExplanation":["“hepatopathy”是较偏医学书面语的总称，日常交流中更常用“liver disease”（肝病）或更具体的诊断名（如 hepatitis 肝炎、cirrhosis 肝硬化）。","词源：hepat(o)- 表示“肝脏”（来自希腊语），-pathy 表示“疾病/病变”。因此它的字面意思是“肝脏的病变”。"]}
{"word":"hepatoperitonitis","summary":{"en":"Hepatoperitonitis is peritonitis (inflammation of the abdominal lining) involving the liver area.","zh":"hepatoperitonitis 指与肝脏区域相关的腹膜炎（腹膜的炎症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"inflammation of the peritoneum (the lining of the abdominal cavity) involving the liver area; peritonitis associated with the liver","zh":"肝周腹膜炎；与肝脏区域相关的腹膜炎（腹腔内壁/腹膜的炎症）"},"examples":[{"en":"The doctor suspected hepatoperitonitis after the patient developed severe abdominal pain and fever.","zh":"病人出现剧烈腹痛和发热后，医生怀疑是肝周腹膜炎。"},{"en":"Imaging tests were ordered to check for infection that could lead to hepatoperitonitis.","zh":"医生安排了影像检查，以排查可能导致肝周腹膜炎的感染。"}]}],"synonyms":["peritonitis (broader term)","hepatic peritonitis"],"phonetic":"/həˌpætoʊˌpɛrɪtəˈnaɪtɪs/","extraExplanation":["这个词主要用于医学语境，属于较少见的专门术语。构词上，hepato- 表示“肝”，peritonitis 表示“腹膜炎”。因此它强调“与肝脏相关/肝周区域的腹膜炎”，而不是单纯泛指所有类型的腹膜炎。","学习时可把它拆开记：hepato-（肝）+ periton-（腹膜）+ -itis（炎症）。很多医学名词都能用这种方式快速理解。"]}
{"word":"hepatopexia","summary":{"en":"Hepatopexia is a surgical procedure to fix the liver in place.","zh":"hepatopexia 指“肝固定术”，即用手术把肝脏固定在稳定位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to fix (attach) the liver to the abdominal wall or diaphragm to keep it in a stable position.","zh":"（外科）肝固定术：将肝脏固定（缝合附着）在腹壁或膈肌上，以稳定其位置的手术。"},"examples":[{"en":"The surgeon recommended hepatopexia to prevent the liver from twisting after repeated displacement.","zh":"外科医生建议做肝固定术，以防肝脏在反复移位后发生扭转。"},{"en":"Hepatopexia may be considered when abnormal liver mobility causes ongoing pain or complications.","zh":"当肝脏异常活动导致持续疼痛或并发症时，可能会考虑进行肝固定术。"}]}],"synonyms":["hepatopexy"],"phonetic":"/həˌpætoʊˈpɛksiə/","extraExplanation":["词源：hepat(o)- 表示“肝”，-pexia/-pexy 表示“固定（缝合固定）”。因此 hepatopexia 与更常见的同义词 hepatopexy 基本同义。","这是比较专门的医学术语，多见于外科/影像学讨论；日常英语中几乎不会用到。"]}
{"word":"hepatopexy","summary":{"en":"Hepatopexy is surgery to attach and stabilize the liver in its proper position.","zh":"hepatopexy 指通过手术将肝脏固定在正常位置的“肝固定术”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure to fix (attach) the liver in place, usually by suturing it to nearby structures to prevent abnormal movement or twisting","zh":"（外科）肝固定术：通过缝合等方式将肝脏固定在相邻组织上，以防止肝脏异常移位或扭转"},"examples":[{"en":"After imaging showed the liver was abnormally mobile, the surgeon recommended hepatopexy.","zh":"影像检查显示肝脏异常活动后，外科医生建议进行肝固定术。"},{"en":"Hepatopexy may be considered when liver displacement causes pain or other complications.","zh":"当肝脏移位引起疼痛或其他并发症时，可能会考虑肝固定术。"}]}],"synonyms":["liver fixation","hepatic fixation"],"phonetic":"/ˌhɛpətoʊˈpɛksi/","extraExplanation":["词源拆解：hepat(o)- 表示“肝”（来自希腊语 hēpar），-pexy 表示“固定、缝合固定”（来自希腊语 pēxis，意为“固定/凝固”）。因此 hepatopexy 字面意思就是“把肝固定住的手术”。","使用场景：多见于医学/外科文献，日常英语中很少出现。与常见的 -pexy 结尾手术词类似（如 gastropexy 胃固定术、orchiopexy 睾丸固定术）。"]}
{"word":"hepatophlebitis","summary":{"en":"Hepatophlebitis means inflammation of a liver vein.","zh":"hepatophlebitis 指肝脏静脉的炎症（肝静脉炎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of a vein in the liver (often involving clotting), a medical condition that typically requires professional diagnosis and treatment.","zh":"肝静脉炎（肝脏里的静脉发生炎症，常可伴随血栓），属于需要专业诊断与治疗的医学情况。"},"examples":[{"en":"The scan suggested hepatophlebitis, so the doctor ordered more blood tests.","zh":"影像检查提示可能是肝静脉炎，所以医生又安排了更多血液检查。"},{"en":"If hepatophlebitis is caused by infection, antibiotics may be part of the treatment.","zh":"如果肝静脉炎是由感染引起的，治疗中可能会用到抗生素。"}]}],"synonyms":["hepatic phlebitis","phlebitis (general term)"],"phonetic":"/həˌpæt.oʊ.fləˈbaɪ.tɪs/","extraExplanation":["这是比较少见、偏专业的医学术语。词源可拆成：hepato-（肝）+ phleb-（静脉）+ -itis（炎症）。因此看到类似结构的词（如 arthritis 关节炎、phlebitis 静脉炎）时，可以用词根词缀来快速猜意思。","在日常英语里更常见的说法通常是更具体的疾病名称（例如与肝静脉血栓相关的 Budd-Chiari syndrome 等），但是否属于同一问题需要医生判断。若出现持续腹痛、发热、黄疸等症状，应及时就医。"]}
{"word":"hepatophlebotomy","summary":{"en":"Hepatophlebotomy is the puncture of a liver vein to draw blood (a specialized type of venipuncture).","zh":"Hepatophlebotomy 指通过穿刺肝静脉来抽血的医学操作（静脉采血的一种特殊情况）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical procedure in which blood is drawn by puncturing a hepatic (liver) vein; essentially a liver-related venipuncture for obtaining a blood sample.","zh":"一种医学取血操作：通过穿刺肝静脉（与肝脏相关的静脉）来抽取血液；可理解为“肝脏相关的静脉采血”。"},"examples":[{"en":"In rare cases, hepatophlebotomy may be used to obtain a sample when peripheral veins are not suitable.","zh":"在少数情况下，当外周静脉不适合采血时，可能会采用 hepatophlebotomy 来获取血样。"},{"en":"The clinician explained that hepatophlebotomy carries higher risk than routine venipuncture.","zh":"临床医生解释说，与常规静脉采血相比，hepatophlebotomy 的风险更高。"}]}],"synonyms":["hepatic venipuncture","hepatic vein puncture"],"phonetic":"/həˌpætəˌflɛˈbɑːtəmi/","extraExplanation":["这个词非常少见，主要出现在医学/解剖学语境中。更常见、也更易懂的表达通常是 hepatic venipuncture（肝静脉穿刺采血）或 hepatic vein puncture（肝静脉穿刺）。","构词理解：hepato-（肝）+ phlebo-（静脉）+ -tomy（切开/切入、穿刺相关的操作）。这里的 -tomy 在一些医学词中可泛指“进行切入/穿刺的操作”，不一定表示“大切开”。"]}
{"word":"hepatophyma","summary":{"en":"Hepatophyma is a rare medical term meaning a swelling or tumor-like growth of the liver.","zh":"Hepatophyma 是较少用的医学词，指肝脏的肿胀或肿瘤样肿块/增生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A swelling or tumor-like growth of the liver; an abnormal enlargement/mass involving the liver (rare term).","zh":"（医学）肝脏的肿胀或肿瘤样增生；涉及肝脏的异常增大或肿块（较少用的术语）。"},"examples":[{"en":"The report mentioned a possible hepatophyma, so further imaging was recommended.","zh":"报告提到可能存在肝脏肿胀/肿块（hepatophyma），因此建议进一步影像检查。"},{"en":"In modern practice, doctors are more likely to say “hepatic mass” than hepatophyma.","zh":"在现代临床中，医生更可能说“肝脏占位/肝肿块（hepatic mass）”，而不是 hepatophyma。"}]}],"synonyms":["hepatic mass","liver swelling","hepatomegaly (related)"],"phonetic":"/hɪˌpætoʊˈfaɪmə/","extraExplanation":["该词由词根 hepato-（肝脏）+ -phyma（肿胀、肿块、赘生物）构成；在现代医学英语中不常见，往往会用更常用的表达，如 hepatic mass（肝肿块/占位）、liver enlargement 或 hepatomegaly（肝肿大）。","注意：它是偏古典/学术化的构词，日常英语几乎不会出现；若在文献中遇到，通常与“肝脏的肿胀或肿块性病变”相关。"]}
{"word":"hepatopneumonic","summary":{"en":"An adjective meaning “connected with or affecting both the liver and the lungs.”","zh":"形容词：指“与肝脏和肺部有关，或同时影响肝与肺”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, or affecting, both the liver (hepato-) and the lungs (pneumon-).","zh":"（医学）与肝脏和肺部都有关的；同时影响肝与肺的。"},"examples":[{"en":"The report described a hepatopneumonic infection involving both the liver and the lungs.","zh":"报告描述了一种肝肺相关的感染，同时累及肝脏和肺部。"},{"en":"Doctors monitored hepatopneumonic complications after the patient’s severe illness.","zh":"在患者重症之后，医生监测可能出现的肝肺并发症。"}]}],"synonyms":["hepatopulmonary","hepatic and pulmonary"],"phonetic":"/hɪˌpæt.oʊ.nuˈmɑː.nɪk/","extraExplanation":["这是一个较少见的医学形容词，由两个词根组合而成：hepato-（肝）+ pneumon- / pneumo-（肺、与呼吸有关）+ -ic（……的）。常用于病理描述或并发症讨论中，表示“与肝和肺同时相关”。","注意不要把 pneumonic 误解为“与肺炎（pneumonia）有关”。pneumonic 既可表示“与肺有关”，也可在某些语境中表示“与肺炎有关”，需要结合上下文判断。"]}
{"word":"hepatoportal","summary":{"en":"Hepatoportal means “related to the liver and the portal vein system.”","zh":"hepatoportal 指“与肝脏及门静脉系统有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the portal vein and the liver (especially the blood flow that goes from the digestive organs to the liver through the portal vein).","zh":"肝门静脉的；与门静脉和肝脏有关的（尤指从消化器官经门静脉流向肝脏的血流系统）。"},"examples":[{"en":"The CT scan showed a blockage in the hepatoportal circulation.","zh":"CT 扫描显示肝门静脉循环中有阻塞。"},{"en":"Doctors monitored hepatoportal blood flow to check for portal hypertension.","zh":"医生监测肝门静脉血流，以评估是否存在门静脉高压。"}]}],"synonyms":["portal (in liver context)","portovenous","hepatic portal"],"phonetic":"/hɪˌpætoʊˈpɔrtəl/","extraExplanation":["这是一个医学/解剖学术语，常见于影像学报告与肝病相关讨论中。词源上可拆为 hepato-（肝）+ portal（门静脉/门的），因此多用于描述“与肝脏及门静脉系统相关”的结构或血流。常与 portal vein（门静脉）、portal hypertension（门静脉高压）、hepatic（肝的）等词一起出现。"]}
{"word":"hepatoptosia","summary":{"en":"Hepatoptosia is the downward displacement (drooping) of the liver from its normal position.","zh":"Hepatoptosia 指肝脏从正常位置向下移位或下垂的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the liver droops or is displaced downward from its normal position (also called liver prolapse).","zh":"一种医学状况：肝脏从正常位置下垂或向下移位（也称“肝下垂/肝脱垂”）。"},"examples":[{"en":"The CT scan suggested hepatoptosia, with the liver positioned lower than usual.","zh":"CT 扫描提示可能存在肝下垂，肝脏位置比正常更低。"},{"en":"In rare cases, hepatoptosia may cause a feeling of heaviness in the upper abdomen.","zh":"在少数情况下，肝下垂可能导致上腹部沉重感。"}]}],"synonyms":["hepatoptosis","liver prolapse","hepatic prolapse"],"phonetic":"/ˌhɛpətoʊpˈtoʊziə/","extraExplanation":["这是比较少见、偏旧式的医学用语；临床上更常见的相关表达有“hepatic prolapse（肝脱垂/肝下垂）”或根据影像学描述为“downward displacement of the liver（肝脏向下移位）”。","词源可拆解理解：hepat(o)- 表示“肝”，-ptosis 表示“下垂/脱垂”（同词根也见于 ptosis“眼睑下垂”）。因此 hepatoptosia 字面意思就是“肝的下垂”。"]}
{"word":"hepatoptosis","summary":{"en":"Hepatoptosis means an abnormal downward displacement (drooping) of the liver.","zh":"hepatoptosis 指肝脏异常向下移位的“肝下垂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the liver is abnormally displaced downward (a “drooping” or prolapsed liver).","zh":"（医学）肝下垂：肝脏位置异常向下移位（“下坠/脱垂”）。"},"examples":[{"en":"The doctor considered hepatoptosis after imaging showed the liver sitting lower than normal.","zh":"影像检查显示肝脏位置低于正常范围后，医生考虑可能是肝下垂。"},{"en":"In some patients, symptoms related to hepatoptosis may improve with posture changes or supportive treatment.","zh":"在一些患者中，与肝下垂相关的不适可能通过调整体位或支持治疗得到缓解。"}]}],"synonyms":["hepatic ptosis","liver ptosis","downward displacement of the liver"],"phonetic":"/hɪˌpætoʊpˈtoʊsɪs/","extraExplanation":["这是一个较少见的医学用词，更常见的相关说法是“hepatic ptosis / liver ptosis（肝下垂）”或描述为“downward displacement of the liver（肝脏向下移位）”。","词源构词：hepato- 表示“肝”，-ptosis 表示“下垂/脱垂”（也见于 ptosis=上睑下垂）。了解词根能帮助你猜测医学词汇的大意。","注意：该词不等于 hepatitis（肝炎）或 hepatosis（肝病/脂肪变性等泛指肝脏病变）；hepatoptosis强调的是“位置下移”。"]}
{"word":"hepatopulmonary","summary":{"en":"Hepatopulmonary means “related to the liver and the lungs,” often used in medical contexts such as hepatopulmonary syndrome.","zh":"hepatopulmonary 指“与肝脏和肺都相关的”，常见于医学语境，如肝肺综合征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the liver (hepato-) and the lungs (pulmonary).","zh":"与肝脏（hepato-）和肺（pulmonary）两者相关的；肝肺的。"},"examples":[{"en":"The doctor ordered tests for possible hepatopulmonary complications.","zh":"医生安排了检查，以排除可能的肝肺并发症。"},{"en":"Hepatopulmonary findings can appear in patients with chronic liver disease.","zh":"慢性肝病患者可能出现肝肺相关的表现。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most commonly used in the term “hepatopulmonary syndrome,” a condition where liver disease leads to abnormal lung blood vessels and low blood oxygen.","zh":"最常见于“肝肺综合征（hepatopulmonary syndrome）”一词：肝病导致肺部血管异常扩张/分流，从而引起血氧偏低的一种情况。"},"examples":[{"en":"She was evaluated for hepatopulmonary syndrome because her oxygen level was low.","zh":"由于血氧偏低，她接受了肝肺综合征的评估。"},{"en":"In hepatopulmonary syndrome, shortness of breath may worsen when standing.","zh":"在肝肺综合征中，站立时气短可能更明显。"}]}],"synonyms":["hepatic-pulmonary","liver-lung"],"phonetic":"/həˌpætoʊˈpʊlməˌnɛri/","extraExplanation":["“hepato-”来自希腊语，表示“肝”；“pulmonary”来自拉丁语，表示“肺”。两部分组合后，常用于医学场景来描述“同时涉及肝与肺”的问题。","临床写作中常见搭配包括：hepatopulmonary syndrome（肝肺综合征）、hepatopulmonary complications（肝肺并发症）、hepatopulmonary shunting（肝病相关的肺内分流）。"]}
{"word":"hepatorenal","summary":{"en":"Hepatorenal means “related to the liver and the kidneys,” mainly used in medical writing.","zh":"hepatorenal 指“与肝脏和肾脏都有关”，多见于医学表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the liver (hepato-) and the kidneys (renal). Used mainly in medical contexts.","zh":"肝肾的；与肝脏（hepato-）和肾脏（renal）两者都有关的（多用于医学语境）。"},"examples":[{"en":"The doctor monitored hepatorenal function after surgery.","zh":"手术后，医生监测了肝肾功能。"},{"en":"The patient showed signs of hepatorenal impairment.","zh":"这位患者出现了肝肾功能受损的迹象。"}]}],"synonyms":["hepatonephric","liver-and-kidney (related)"],"phonetic":"/ˌhɛpətoʊˈriːnəl/","extraExplanation":["“hepato-”源自希腊语，表示“肝脏”；“renal”来自拉丁语，表示“肾脏”。因此该词常见于检验指标、影像学描述或病理报告中，用来强调“同时涉及肝与肾”。","临床上常见搭配：hepatorenal syndrome（肝肾综合征），指在严重肝病背景下出现的肾功能衰竭（通常并非由肾脏本身器质性病变直接引起）。"]}
{"word":"hepatorrhagia","summary":{"en":"Hepatorrhagia means bleeding from the liver (a medical term).","zh":"hepatorrhagia 指“肝出血”，属于医学专业用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bleeding (hemorrhage) from the liver.","zh":"肝出血；来自肝脏的出血（医学用语）。"},"examples":[{"en":"The CT scan suggested hepatorrhagia after blunt abdominal trauma.","zh":"CT 扫描提示患者在腹部钝性外伤后出现肝出血。"},{"en":"Doctors treated the hepatorrhagia urgently to prevent shock.","zh":"医生紧急处理肝出血，以防止休克。"}]}],"synonyms":["hepatic hemorrhage","liver hemorrhage","bleeding from the liver"],"phonetic":"/həˌpætəˈreɪdʒə/","extraExplanation":["这是较少见、偏专业的医学词汇，多用于病历、影像学报告或学术文章里。日常英语中更常说“bleeding from the liver”或“hepatic hemorrhage”。","构词法：hepat(o)- 表示“肝”，-rrhagia 表示“（大量）出血”。在医学英语里你还会见到类似的词，如 menorrhagia（经量过多/异常子宫出血）。"]}
{"word":"hepatorrhaphy","summary":{"en":"Hepatorrhaphy is a surgical procedure in which the liver is sutured to repair damage or close a wound.","zh":"hepatorrhaphy 指“肝缝合术”，即通过缝合修复肝脏损伤或创口的外科手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to stitch (suture) the liver, usually to repair an injury or close a wound","zh":"肝缝合术；用缝线将肝脏缝合的外科手术，常用于修复肝脏损伤或关闭创口"},"examples":[{"en":"The trauma surgeon performed a hepatorrhaphy to control bleeding from a liver laceration.","zh":"创伤外科医生进行了肝缝合术，以控制肝裂伤造成的出血。"},{"en":"After the accident, imaging suggested liver injury, and hepatorrhaphy was considered.","zh":"事故后影像提示肝脏受损，因此考虑进行肝缝合术。"}]}],"synonyms":["liver suturing","hepatic suturing","liver repair (general)"],"phonetic":"/hɪˌpætəˈræfi/","extraExplanation":["词源拆解：hepat(o)- 表示“肝”，-rrhaphy 表示“缝合术/缝合”。常见的同类医学构词还有：neurorrhaphy（神经缝合术）、tenorrhaphy（肌腱缝合术）。","使用场景：这是较专业的医学术语，日常英语里更常说“liver repair”或“suturing the liver”。"]}
{"word":"hepatorrhea","summary":{"en":"A rare medical noun meaning abnormal or excessive discharge/flow from the liver, especially bile.","zh":"一个较少见的医学名词，指肝脏（尤指胆汁）的异常或过多分泌/流出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) an abnormal or excessive discharge/flow from the liver, especially of bile.","zh":"（医学）肝溢液；来自肝脏的异常或过多分泌/流出，尤指胆汁的过度排出。"},"examples":[{"en":"In older medical texts, hepatorrhea was used to describe an excessive flow of bile thought to come from the liver.","zh":"在较早的医学文献中，hepatorrhea 用来描述被认为来自肝脏的胆汁过度流出。"},{"en":"The term hepatorrhea is rare in everyday English and is mainly seen in specialized medical writing.","zh":"hepatorrhea 在日常英语中很少见，主要出现在专业医学写作里。"}]}],"synonyms":["bile discharge (general)","biliary overflow (general)"],"phonetic":"/ˌhɛpəˈtɔːriə/","extraExplanation":["词源构词：hepat- 表示“肝”（来自希腊语 hēpar），-rrhea 表示“流出、溢出”（常见于 diarrhea 腹泻、seborrhea 脂溢等词）。合起来就是“肝（相关的）异常流出”。","使用提醒：这是较少使用、偏旧或偏专科的术语；现代临床更常用更具体的说法来描述胆汁分泌/排出异常或相关症状。"]}
{"word":"hepatorrhexis","summary":{"en":"Hepatorrhexis means a rupture (tear) of the liver, typically due to trauma.","zh":"hepatorrhexis 指肝破裂（肝脏撕裂），多由外伤导致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rupture (tearing) of the liver, usually caused by trauma or severe injury","zh":"肝破裂；肝脏撕裂（通常由外伤或严重损伤引起）"},"examples":[{"en":"The CT scan suggested hepatorrhexis after the car accident.","zh":"车祸后，CT 扫描提示可能存在肝破裂。"},{"en":"In the emergency room, doctors monitored him closely for bleeding from hepatorrhexis.","zh":"在急诊室里，医生密切监测他是否因肝破裂而出血。"}]}],"synonyms":["liver rupture","ruptured liver","hepatic rupture"],"phonetic":"/həˌpæt.oʊˈrɛk.sɪs/","extraExplanation":["这是一个医学术语，常见于外科、急诊与影像学报告中。词源可拆解理解：hepat(o)- 表示“肝”，-rrhexis 表示“破裂/撕裂”（同源构词还见于“cardiorrhexis 心破裂”等）。日常英语中很少使用，更常见的说法是“liver rupture”或“ruptured liver”。"]}
{"word":"hepatorrhoea","summary":{"en":"Hepatorrhoea is a medical term meaning an abnormal discharge of bile, especially bile passed in stool.","zh":"Hepatorrhoea 是医学术语，指胆汁异常排出，尤指胆汁随粪便排出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) the passage of bile in the stool; a discharge of bile from the liver or biliary system.","zh":"（医学）便中排出胆汁；来自肝脏或胆道系统的胆汁排出（多指异常排出）。"},"examples":[{"en":"The doctor considered hepatorrhoea as a possible sign of a bile-duct problem.","zh":"医生把“胆汁排出异常（hepatorrhoea）”视为胆管问题的一个可能信号。"},{"en":"In older medical texts, hepatorrhoea may be mentioned alongside jaundice and other liver-related symptoms.","zh":"在较早的医学文献中，hepatorrhoea 可能会与黄疸等其他肝脏相关症状一起被提到。"}]}],"synonyms":["bile discharge","biliary discharge","cholerhea (rare)"],"phonetic":"/həˌpætəˈriə/","extraExplanation":["该词属于医学术语，在现代临床写作中相对少见，更常见的相关表达包括“bile in the stool / bile discharge”或具体诊断（如胆道梗阻、胆汁反流、胆汁分泌与排出异常等）。","词源可拆分理解：hepato-（肝）+ -rrhoea（“流出/溢出”，也见于 diarrhea 腹泻、rhinorrhea 流鼻涕）。拼写中英式常写 -rrhoea，美式也常见 -rrhea。"]}
{"word":"hepatoscopies","summary":{"en":"“Hepatoscopies” means multiple medical examinations of the liver using a scope-based viewing method.","zh":"“Hepatoscopies”指多次使用镜检/内镜方式对肝脏进行观察的医学检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of hepatoscopy: medical examinations of the liver using a viewing instrument (an endoscope) or a scope-like method.","zh":"hepatoscopy 的复数：用内镜或类似“镜检”的方法对肝脏进行观察/检查的医学检查。"},"examples":[{"en":"The report compared several hepatoscopies performed before and after treatment.","zh":"这份报告比较了治疗前后进行的多次 hepatoscopies（肝镜检查）。"},{"en":"In modern practice, imaging tests often replace older hepatoscopies.","zh":"在现代临床中，影像学检查常常取代较早期的 hepatoscopies（肝镜检查）。"}]}],"synonyms":["liver examinations","hepatic endoscopy","liver scoping"],"phonetic":"/hɪˌpætoʊˈskɑpiz/","extraExplanation":["这是一个相对少见的医学术语，常见于专业论文或较老的文献中。词根 hepato- 表示“肝”，-scopy 表示“镜检/观察”。在当代临床语境里，人们更常说 liver endoscopy（肝脏内镜检查，较少用）或直接用更具体的检查名（如 laparoscopy 腹腔镜、ultrasound 超声、CT 等）。"]}
{"word":"hepatoscopy","summary":{"en":"Hepatoscopy is a medical procedure for examining the liver, often with an endoscope.","zh":"hepatoscopy 指对肝脏进行检查的医学操作，常借助内镜等器械进行观察。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical examination of the liver, especially by using an endoscope (a thin tube with a camera) to look directly at the liver.","zh":"肝镜检查；肝脏检查（尤指用内镜等器械直接观察肝脏的医学检查）。"},"examples":[{"en":"The doctor recommended hepatoscopy to get a clearer view of the liver’s surface.","zh":"医生建议做肝镜检查，以更清楚地观察肝脏表面。"},{"en":"Hepatoscopy may be used when imaging tests do not provide enough information.","zh":"当影像检查无法提供足够信息时，可能会使用肝镜检查。"}]}],"synonyms":["liver examination","endoscopic examination of the liver","laparoscopic examination of the liver"],"phonetic":"/həˌpætəˈskɑpi/","extraExplanation":["词源拆解：hepato- 表示“肝脏”，-scopy 表示“观察/镜检”。合起来就是“观察肝脏的检查”。","这是较偏专业的医学词汇；日常英语中更常见的表达可能是 “liver examination” 或在具体情境下说 “endoscopic/laparoscopic examination of the liver”。"]}
{"word":"hepatostomy","summary":{"en":"Hepatostomy is a medical term for surgically creating an opening into the liver for drainage or access.","zh":"hepatostomy 指“肝造口术”，即通过手术在肝脏上建立开口，以便引流或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation that creates an opening (stoma) into the liver, usually to allow drainage or access for treatment.","zh":"肝造口术；一种外科手术，在肝脏上建立一个“造口”（开口），通常用于引流或便于治疗操作。"},"examples":[{"en":"After the injury, the surgeon performed a hepatostomy to drain infected fluid from the liver.","zh":"受伤后，外科医生进行了肝造口术，以引流肝脏内的感染液体。"},{"en":"In rare cases, hepatostomy may be used to provide temporary access for managing bile leakage.","zh":"在少数情况下，肝造口术可用于暂时建立通道，以处理胆汁渗漏。"}]}],"synonyms":["hepatic stoma (term)","surgical liver drainage (general)"],"phonetic":"/ˌhɛpəˈtɑstəmi/","extraExplanation":["这是一个较少见、偏专业的医学词。词根拆解有助记忆：hepato- 表示“肝”（如 hepatitis 肝炎），-stomy 表示“造口/开口的手术”（如 colostomy 结肠造口术）。","实际临床中更常见的相关表达包括 biliary drainage（胆道引流）、hepatic drainage（肝引流）等，具体术式名称会因手术目的与开口位置而变化。"]}
{"word":"hepatotherapy","summary":{"en":"Hepatotherapy means medical treatment for liver diseases or liver-related conditions.","zh":"hepatotherapy 指“肝病治疗”，即对肝脏疾病或相关问题的治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"treatment or therapeutic care for diseases or conditions of the liver.","zh":"肝脏疾病或肝脏相关状况的治疗；肝病治疗。"},"examples":[{"en":"The patient was referred to a specialist for hepatotherapy after abnormal liver tests.","zh":"在肝功能检查异常后，病人被转诊给专科医生接受肝病治疗。"},{"en":"Modern hepatotherapy may include antiviral drugs, lifestyle changes, or a liver transplant in severe cases.","zh":"现代肝病治疗可能包括抗病毒药物、生活方式调整，严重时甚至需要肝移植。"}]}],"synonyms":["liver therapy","treatment for liver disease","hepatic therapy"],"phonetic":"/həˌpætəˈθɛrəpi/","extraExplanation":["这是一个相对少见、偏医学书面语的词，由前缀 hepato-（与“肝”有关）+ therapy（治疗）构成。日常英语中更常说 treatment for liver disease / liver therapy，或用 hepatology（肝病学，学科/专科）来指相关领域。"]}
{"word":"hepatotomy","summary":{"en":"Hepatotomy means a surgical incision into the liver.","zh":"hepatotomy 指“肝切开术”，即对肝脏进行外科切开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical incision into the liver (an operation where a surgeon cuts into the liver).","zh":"肝切开术；对肝脏进行外科切开的手术。"},"examples":[{"en":"The surgeon performed a hepatotomy to remove damaged tissue.","zh":"外科医生进行了肝切开术以切除受损组织。"},{"en":"Hepatotomy may be used to access a liver abscess or control bleeding after trauma.","zh":"肝切开术可能用于处理肝脓肿，或在外伤后控制出血。"}]}],"synonyms":["liver incision (general description)"],"phonetic":"/ˌhɛpəˈtɑtəmi/","extraExplanation":["词源提示：hepat- 表示“肝”（来自希腊语），-tomy 表示“切开/切开术”。医学英语里很多手术名都用 -tomy（切开）和 -ectomy（切除）来区分：hepatotomy 是“切开肝脏”，而 hepatectomy 是“切除部分或全部肝脏”。","使用场景：这是较专业的医学术语，日常交流中更常说 “liver surgery（肝脏手术）” 或具体手术名称。"]}
{"word":"hepatotoxemia","summary":{"en":"Hepatotoxemia is toxemia caused by liver dysfunction—toxins build up in the bloodstream when the liver can’t process them properly.","zh":"hepatotoxemia 指因肝功能异常导致的毒血症，即肝脏无法有效代谢时毒素在血液中累积。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition in which toxins (poisonous substances) build up in the blood due to liver damage or poor liver function; toxemia related to the liver","zh":"（医学）与肝脏相关的毒血症；因肝功能受损或肝脏处理能力下降，毒素在血液中累积的状态"},"examples":[{"en":"Severe liver failure can lead to hepatotoxemia and serious systemic symptoms.","zh":"严重的肝功能衰竭可能导致肝源性毒血症，并引发全身性严重症状。"},{"en":"The veterinarian suspected hepatotoxemia after blood tests showed abnormal liver values.","zh":"血液检查显示肝功能指标异常后，兽医怀疑出现了肝源性毒血症。"}]}],"synonyms":["toxemia (liver-related)","toxin buildup","hepatic toxemia"],"phonetic":"/hɪˌpætoʊtɑkˈsiːmiə/","extraExplanation":["词源拆解：hepato- = 肝；toxemia = 毒素在血液中的状态（毒血症）。合起来强调“毒素与肝脏功能异常有关”。","该词在日常英语中很少见，更多出现在医学/兽医学语境。临床上更常用的相关表达包括：hepatotoxicity（肝毒性）、toxemia（毒血症）、hepatic encephalopathy（肝性脑病，常与体内毒素累积有关）。"]}
{"word":"hepatotoxic","summary":{"en":"Hepatotoxic means harmful to the liver and able to cause liver damage.","zh":"hepatotoxic 指“对肝脏有毒/有害”，可能造成肝损伤。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Harmful to the liver; capable of causing liver damage.","zh":"对肝脏有毒的；可能导致肝损伤的。"},"examples":[{"en":"High doses of acetaminophen can be hepatotoxic.","zh":"高剂量的对乙酰氨基酚（扑热息痛）可能对肝脏有毒。"},{"en":"The doctor monitored her liver enzymes because the new medicine might be hepatotoxic.","zh":"医生监测她的肝酶水平，因为新药可能有肝毒性。"},{"en":"Avoid mixing alcohol with drugs that are hepatotoxic.","zh":"避免把酒精与具有肝毒性的药物一起使用。"}]}],"synonyms":["liver-toxic","harmful to the liver"],"phonetic":"/ˌhɛpəˈtɑksɪk/","extraExplanation":["词源提示：hepat- 表示“肝脏”（来自希腊语），-toxic 表示“有毒的”。合起来就是“对肝脏有毒”。","常见搭配：hepatotoxicity（肝毒性），hepatotoxic effects（肝毒性作用），hepatotoxic drug（肝毒性药物）。","学习提示：这是医学/药学语境里很常见的专业词。日常英语中更常说 “harmful to the liver”。"]}
{"word":"hepatotoxicity","summary":{"en":"Hepatotoxicity means liver damage caused by a substance (especially a medicine or chemical).","zh":"hepatotoxicity 指由某种物质（尤其是药物或化学品）引起的肝脏损伤/肝毒性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Liver damage or injury caused by a drug, chemical, alcohol, or another substance.","zh":"由药物、化学物质、酒精或其他物质引起的肝脏损伤/毒性。"},"examples":[{"en":"High doses of acetaminophen can cause hepatotoxicity.","zh":"对乙酰氨基酚（扑热息痛）大剂量使用可能导致肝毒性。"},{"en":"The doctor stopped the medication because of signs of hepatotoxicity.","zh":"医生因为出现肝毒性的迹象而停用了该药。"},{"en":"Researchers are testing the new drug to make sure it does not cause hepatotoxicity.","zh":"研究人员正在测试新药，以确保它不会引起肝毒性。"}]}],"synonyms":["liver toxicity","liver damage","drug-induced liver injury (DILI)"],"phonetic":"/ˌhɛpətoʊtɑkˈsɪsəti/","extraExplanation":["词源提示：hepat(o)- 表示“肝”，toxic 表示“有毒的”，-ity 表示“性质/状态”。合起来就是“肝脏的毒性（状态）”。","在医学语境里，人们常用的相关表达有：hepatotoxic（adj. 肝毒性的）、hepatotoxic drug（肝毒性药物）、drug-induced liver injury / DILI（药物性肝损伤）。","学习用法：这是偏正式的医学/药学术语，日常口语更常说 “liver damage” 或 “liver injury”。"]}
{"word":"hepatotoxin","summary":{"en":"A hepatotoxin is a substance that harms the liver.","zh":"hepatotoxin 指“肝毒素”，即会伤害肝脏的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance that is toxic to the liver and can damage liver cells or impair liver function.","zh":"肝毒素；对肝脏有毒、会损伤肝细胞或影响肝功能的物质。"},"examples":[{"en":"Some industrial chemicals are hepatotoxins and can cause serious liver damage after long exposure.","zh":"一些工业化学品是肝毒素，长期接触可能导致严重的肝损伤。"},{"en":"Before starting the medicine, the doctor warned that it may act as a hepatotoxin in high doses.","zh":"开始用药前，医生提醒这种药在大剂量下可能具有肝毒性（可能成为肝毒素）。"},{"en":"The lab tested the supplement for possible hepatotoxin contamination.","zh":"实验室检测该保健品是否被肝毒素污染。"}]}],"synonyms":["liver toxin","hepatotoxic substance"],"phonetic":"/həˌpætoʊˈtɑksɪn/","extraExplanation":["词源拆解：hepat(o)- 表示“肝脏”（来自希腊语），toxin 表示“毒素”。合起来就是“对肝脏有毒的物质”。","常见相关搭配：hepatotoxic（adj. 肝毒性的）；hepatotoxicity（n. 肝毒性）。医学或药品说明中更常见的是 hepatotoxic，而 hepatotoxin 更偏向指“具体的毒物/物质”。","学习提示：日常英语里不太常用，更多出现在医学、药学、毒理学与公共健康语境。看到它时通常在讨论“肝损伤风险、暴露（exposure）、剂量（dose）、肝功能指标（liver function tests）”等。"]}
{"word":"hepatoumbilical","summary":{"en":"Hepatoumbilical means “related to the liver and the umbilicus/umbilical cord,” mainly in medical contexts.","zh":"hepatoumbilical 意为“肝脐的；与肝脏和脐/脐带有关的”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the liver (hepato-) and the umbilicus/umbilical cord (umbilical), especially describing blood vessels or circulation between them.","zh":"肝脐的；与肝脏（hepato-）和脐/脐带（umbilical）有关的，尤指描述二者之间的血管或血液循环。"},"examples":[{"en":"The report mentioned a hepatoumbilical vein seen on ultrasound.","zh":"报告提到在超声上可见一条肝脐静脉。"},{"en":"Doctors discussed hepatoumbilical circulation when explaining fetal blood flow.","zh":"医生在解释胎儿血流时讨论了肝脐循环。"}]}],"synonyms":["hepato-umbilical","liver-and-umbilical (descriptive)"],"phonetic":"/hɪˌpætoʊʌmˈbɪlɪkəl/","extraExplanation":["这是一个医学/解剖学用语，常见于影像学与产科语境。词素分解：hepato-（肝脏）+ umbilical（脐、脐带）+ -al（形容词后缀）。","临床上常与“胎儿循环”“门静脉/脐静脉”等主题一起出现；普通日常英语中几乎不用。"]}
{"word":"Hepburn","summary":{"en":"Hepburn usually refers to a Japanese romanization system, and it can also be a surname (famously Audrey Hepburn).","zh":"Hepburn 通常指“赫本式”日语罗马字转写法，也可作姓氏（如奥黛丽·赫本）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese romanization system (Hepburn romanization) that writes Japanese sounds with the Latin alphabet in a way that is easy for English readers (e.g., し = “shi,” ち = “chi”).","zh":"（赫本式）日语罗马字转写法：用拉丁字母按较贴近英语读音的方式来拼写日语（如 し 写作“shi”，ち 写作“chi”）。"},"examples":[{"en":"Most English-language textbooks use Hepburn romanization for Japanese.","zh":"大多数英文日语教材会使用赫本式罗马字。"},{"en":"In Hepburn, 東京 is written as “Tōkyō” (often typed as “Tokyo”).","zh":"按赫本式，東京写作“Tōkyō”（日常输入常写作“Tokyo”）。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name, especially known from the British actress Audrey Hepburn.","zh":"姓氏（赫本），尤其因英国演员奥黛丽·赫本而广为人知。"},"examples":[{"en":"Audrey Hepburn starred in the film Breakfast at Tiffany’s.","zh":"奥黛丽·赫本主演了电影《蒂凡尼的早餐》。"},{"en":"Hepburn is often associated with classic elegance and style.","zh":"“Hepburn”常让人联想到经典的优雅与风格。"}]}],"synonyms":["Hepburn romanization","romaji","romanization"],"phonetic":"/ˈhɛpˌbɝn/","extraExplanation":["“赫本式罗马字”（Hepburn romanization）由美国传教士兼医生 James Curtis Hepburn 在19世纪推广；它更偏向让英语使用者“按听到的声音来拼写”，因此常见 shi/chi/tsu 等拼法。","与之相对的还有“训令式”（Kunrei-shiki）等体系，在日语教育、地图标注、护照拼写和输入法中可能出现差异；同一个词可能有多种罗马字写法。"]}
{"word":"hepburn","summary":{"en":"Hepburn is the most widely used system for writing Japanese in the Roman alphabet, and it’s also used as an adjective for spellings based on that system.","zh":"Hepburn 指最常见的日语罗马字拼写体系（赫本式），也可作形容词表示“按赫本式拼写的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system for writing Japanese sounds using the Roman alphabet (romaji), commonly used in signs, passports, and textbooks","zh":"（日语）赫本式罗马字：用拉丁字母来拼写日语发音的体系，常用于路牌、护照和教材"},"examples":[{"en":"In Hepburn romanization, し is usually written as “shi.”","zh":"在赫本式罗马字里，し 通常写作 “shi”。"},{"en":"Her passport spells her name in Hepburn: “Kyoko,” not “Kyouko.”","zh":"她的护照用赫本式拼法写名字：“Kyoko”，而不是 “Kyouko”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Hepburn system of romanization","zh":"与赫本式罗马字相关的；按赫本式拼写的"},"examples":[{"en":"Many English-language maps use Hepburn spelling for Japanese place names.","zh":"许多英文地图用赫本式拼写日本地名。"},{"en":"“Tokyo” is a Hepburn-style spelling that matches English pronunciation fairly well.","zh":"“Tokyo” 是一种赫本式拼写，和英语读音比较贴近。"}]}],"synonyms":["Hepburn romanization","Hepburn system","romaji (in context)"],"phonetic":"/ˈhɛp.bɝːn/","extraExplanation":["“Hepburn”这个名称来自美国传教士兼医生 James Curtis Hepburn（詹姆斯·柯蒂斯·赫本）。他在19世纪编写的日英词典推广了这种罗马字拼写法，因此后来常被称为“赫本式”。","学习者常见对比：赫本式更偏向“让英语读者读得像日语发音”，例如 ち=chi、つ=tsu；而训令式/日本式更贴近日语的假名结构，例如 ち=ti、つ=tu。","长音在赫本式里常用“¯”（如 Tōkyō）或在不方便标注时写成 “Tokyo”。在不同场合（学术、护照、路牌）写法可能不完全一致。"]}
{"word":"hepcat","summary":{"en":"A slang noun for a cool, stylish person, often linked to classic jazz culture; now sounds old-fashioned.","zh":"俚语名词，指很酷很时髦、常与经典爵士文化相关的人；如今多带复古感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (especially in the 1940s–1950s) who is “hip”: stylish, cool, and often associated with jazz culture","zh":"（尤指20世纪40–50年代的）“很潮/很懂行”的人；时髦酷炫，常与爵士乐文化有关的人"},"examples":[{"en":"In the old movie, the hepcat wears a sharp suit and talks about jazz all night.","zh":"在那部老电影里，这个潮人穿着利落的西装，整晚都在聊爵士乐。"},{"en":"She jokingly called her grandpa a hepcat because he still knows all the classic tunes.","zh":"她开玩笑说爷爷是个潮人，因为他还记得所有经典曲子。"}]}],"synonyms":["hip cat","hipster","cool guy","trendsetter"],"phonetic":"/ˈhɛpˌkæt/","extraExplanation":["“hepcat”是美国俚语，常见于爵士乐盛行的年代（约1940–1950年代）。其中“hep/hip”表示“懂行、很潮”，而“cat”在爵士圈里常用来指“某个家伙/某人”（类似口语里的“哥们儿”）。现代英语里这个词偏复古、带怀旧或戏谑语气。"]}
{"word":"hepcats","summary":{"en":"Hepcats = cool, hip people, especially linked to classic jazz culture (plural of hepcat).","zh":"hepcats 指“很潮很酷的人”，尤与复古爵士乐文化相关（hepcat 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, plural) People who are very “hip” (cool and stylish), especially fans of jazz culture; the plural of “hepcat.”","zh":"（俚语，复数）很“潮”、很酷、很有型的人，尤指爵士乐文化圈的人；是 hepcat 的复数。"},"examples":[{"en":"In old movies, the hepcats hang out at jazz clubs late at night.","zh":"在老电影里，那些 hepcats 常常深夜泡在爵士俱乐部。"},{"en":"He tried to dress like the hepcats of the 1940s.","zh":"他想穿得像 20 世纪 40 年代那些“潮人”一样。"}]}],"synonyms":["hipsters","cool people","jazz cats","trendsetters"],"phonetic":"/ˈhɛpˌkæt/","extraExplanation":["“hepcat”多见于20世纪40—50年代的美国英语，和爵士乐、摇摆乐（swing）场景联系很强，带一点复古感。现代日常口语里更常说“cool people / hipsters”（语气和时代背景不同）。","词源上，“hep/hip”都和“懂行、跟得上潮流”有关；“cat”在爵士俚语里常指“家伙、某人”（类似“guy/dude”），所以“hepcat”可理解为“很懂、很潮的那个人”。"]}
{"word":"hephaesteum","summary":{"en":"Hephaesteum = another name for the Temple of Hephaestus in Athens.","zh":"Hephaesteum＝雅典“赫淮斯托斯神庙”的别称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) Another name for the Temple of Hephaestus, a well-preserved ancient Greek temple in Athens dedicated mainly to Hephaestus (god of fire and metalworking) and Athena.","zh":"（专有名词）“Hephaesteum”是雅典“赫淮斯托斯神庙”（Temple of Hephaestus）的别称。这座保存非常完好的古希腊神庙主要供奉赫淮斯托斯（火与锻造之神）以及雅典娜。"},"examples":[{"en":"We visited the Hephaesteum in the Ancient Agora of Athens.","zh":"我们参观了雅典古代市集（古阿哥拉）里的 Hephaesteum（赫淮斯托斯神庙）。"},{"en":"The Hephaesteum is famous for being one of the best-preserved Doric temples in Greece.","zh":"Hephaesteum 以“希腊保存最完好的多立克式神庙之一”而闻名。"}]}],"synonyms":["Temple of Hephaestus","Hephaisteion"],"phonetic":"/hɪˈfiːstiəm/","extraExplanation":["“Hephaesteum”来自希腊神祇 Hephaestus（赫淮斯托斯）的名字，常用于学术或导览语境。现代旅游资料更常写作 Temple of Hephaestus（赫淮斯托斯神庙）。","它位于雅典的 Ancient Agora（古阿哥拉）附近，传统上也被称为 Theseion/Theseum（与英雄忒修斯 Theseus 相关的旧称），容易与其他相似名称混淆。"]}
{"word":"hephaestian","summary":{"en":"Hephaestian means “related to Hephaestus” and, by extension, “forge-like or intensely fiery/volcanic.”","zh":"Hephaestian 指“与赫菲斯托斯有关”，并可引申为“如熔炉般炽热/带火山烈焰氛围的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hephaestus, the Greek god of fire, metalworking, and the forge; by extension, connected with smithing or forging.","zh":"与赫菲斯托斯（希腊神话中的火与锻造之神）有关的；引申为与打铁、锻造相关的。"},"examples":[{"en":"The novel describes a Hephaestian workshop where weapons are forged for the gods.","zh":"小说描写了一间“赫菲斯托斯式”的作坊，为诸神锻造武器。"},{"en":"Her Hephaestian skills in the studio turned scrap metal into elegant art.","zh":"她在工作室里展现出“赫菲斯托斯式”的本领，把废金属变成了优雅的艺术品。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Fiery, forge-like, or volcanic in atmosphere—suggesting intense heat, smoke, and molten metal or lava.","zh":"（比喻）炽热如熔炉的、带火山/烈焰氛围的——让人联想到高温、烟雾、熔金或岩浆。"},"examples":[{"en":"A Hephaestian glow rose from the foundry at night.","zh":"夜里铸造厂升起一种“熔炉般的”光亮。"},{"en":"The poem paints the city as Hephaestian—loud, hot, and full of sparks.","zh":"诗把这座城市写得像“赫菲斯托斯的熔炉”——喧嚣、灼热、火花四溅。"}]}],"synonyms":["vulcanian","forge-like","fiery","volcanic","smithy"],"phonetic":"/həˈfiːstiən/","extraExplanation":["“Hephaestian”来自希腊神话人物 Hephaestus（赫菲斯托斯），相当于罗马神话的 Vulcan（伏尔甘）。因此它常用来描写“锻造/铁匠/熔炉”的意象，有时也会借指“火山般的炽热”。","使用上常见于文学描写、艺术评论或较正式的修辞语境；日常英语里更常说 “volcanic,” “fiery,” “forge-like,” 或 “of Hephaestus.”","注意大小写：指“与赫菲斯托斯本人有关”时有时会大写（Hephaestian）；作一般形容词描写氛围时常见小写（hephaestian），取决于写作风格。"]}
{"word":"hephaestic","summary":{"en":"A rare adjective meaning “of or like Hephaestus,” suggesting fire, forging, and craftsmanship.","zh":"一个较少见的形容词，意为“赫菲斯托斯式的/与锻造之神有关的”，常联想到火、锻造与匠艺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to Hephaestus, the Greek god of fire, metalworking, and craftsmanship; therefore connected with fire, forging, or skilled making.","zh":"（较少见）与希腊神话中的火与锻造之神赫菲斯托斯（Hephaestus）有关；因此带有“火、锻造、匠艺/工艺”的意味。"},"examples":[{"en":"The poet describes a hephaestic workshop where sparks fly and metal sings.","zh":"诗人描写了一个“hephaestic”的工坊：火花四溅，金属仿佛在歌唱。"},{"en":"Her hephaestic imagination turned scrap metal into delicate sculptures.","zh":"她富有“hephaestic”气质的想象力把废金属变成了精巧的雕塑。"}]}],"synonyms":["hephaestian","hephaestean","vulcanian (similar in sense)"],"phonetic":"/ˌhɛfəˈistɪk/","extraExplanation":["“hephaestic”在现代英语中很少见，更常见的拼写是 hephaestian / hephaestean（都表示“赫菲斯托斯式的/与锻造之神有关的”）。在文学或艺术评论里，它常用来营造“火与铁”“锻造”“匠艺”的意象。","Hephaestus 在罗马神话中对应 Vulcan，因此有时也可用 vulcan / vulcanian / vulcanic 来表达“火山般的、炽热的”或“锻造相关”的感觉；但这些词的侧重点可能更偏“火山/炽热”，不一定等同于“赫菲斯托斯式的匠作”。"]}
{"word":"hephthemimer","summary":{"en":"A hepthemimer is a metrical pause (caesura) after the seventh half-foot in a line of verse, common in Greek and Latin poetry.","zh":"hepthemimer 指诗行中位于第七个半音步之后的格律停顿（断句），常用于古希腊与拉丁诗歌分析。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Prosody) A caesura (pause) in a line of verse that comes after the seventh half-foot (i.e., after 3½ metrical feet), especially in Greek and Latin poetry.","zh":"（诗律）一种诗行中的“停顿/断句”（caesura），位置在第七个“半音步”之后（即在第3.5个音步之后），常见于古希腊与拉丁诗歌。"},"examples":[{"en":"In some Homeric lines, a hepthemimer creates a natural pause in the middle of the verse.","zh":"在一些荷马史诗的诗行中，hepthemimer 会在诗句中间形成自然的停顿。"},{"en":"The professor asked us to mark the hepthemimer and explain how it shapes the rhythm.","zh":"教授让我们标出 hepthemimer，并解释它如何影响节奏。"}]}],"synonyms":["hepthemimeral caesura","caesura"],"phonetic":"ˌhɛpθəˈmɪmɚ","extraExplanation":["你输入的拼写“hephthemimer”较少见，常见写法是 **hepthemimer**（也常出现在短语 **hepthemimeral caesura** 中）。","该术语主要用于古典诗歌的格律分析：所谓“半音步”是把一个完整音步拆成两部分来计数，因此“第七个半音步之后”≈“第三个半音步再加半个音步之后”（3½ 音步处）的停顿。"]}
{"word":"hephthemimeral","summary":{"en":"A rare adjective (mostly medical) meaning “on the seventh day” or “recurring every seven days.”","zh":"一个罕见形容词（多见于医学），意思是“在第七天发生”或“每隔七天复发/出现一次”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, medical) Happening on the seventh day, or recurring every seven days.","zh":"（罕见，多用于医学）发生在第七天的；每隔七天复发/出现一次的。"},"examples":[{"en":"In older medical texts, a hepthemimeral fever was described as returning every seventh day.","zh":"在较早期的医学文献中，“hephthemimeral（hepthemimeral） fever（热病）”被描述为每隔七天复发一次。"},{"en":"The rash showed a hepthemimeral pattern, flaring on the seventh day after onset.","zh":"这种皮疹呈现“第七天加重”的模式，在发病后的第七天出现明显加重。"}]}],"synonyms":["weekly","every seven days","septenary (rare)"],"phonetic":"/ˌhɛpθəˈmɪmərəl/","extraExplanation":["这个词非常少见，最常见于旧式/历史性的医学英语里，用来描述“按七天为周期”的症状或发作（例如某些热病的周期性发作）。现代英语里更常用 weekly（每周的）或 every seven days（每隔七天）。","词源来自希腊语：hepta-（七）+ hēmera（天/日）。你输入的拼写“hephthemimeral”里多了一个 h，常见标准拼写是 hepthemimeral。"]}
{"word":"hepialid","summary":{"en":"A hepialid is a moth belonging to the family Hepialidae (ghost moths/swift moths).","zh":"hepialid 指蛾科（Hepialidae）的蛾类成员（幽灵蛾/迅蛾）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a moth of the family Hepialidae (often called a ghost moth or swift moth), known for heavy-bodied adults and, in many species, larvae that live in soil or inside plant roots and stems.","zh":"蛾类的一科（蛾科：Hepialidae）的成员，常被称为“幽灵蛾/迅蛾”。成虫多为粗壮体型；许多种类的幼虫生活在土壤中或钻入植物根、茎内取食。"},"examples":[{"en":"Researchers surveyed hepialid moths in alpine grasslands at night.","zh":"研究人员在夜间调查了高山草地中的蛾科（hepialid）蛾类。"},{"en":"Some hepialid larvae can damage crops by boring into roots.","zh":"一些蛾科（hepialid）幼虫会蛀食根部，从而危害农作物。"}]}],"synonyms":["ghost moth","swift moth"],"phonetic":"/ˌhiːpiˈælɪd/","extraExplanation":["“hepialid”来自其科名 Hepialidae；Hepial- 源自拉丁化学名（与属名 Hepialus 相关）。在英文科普写作里更常见的说法是 ghost moth（幽灵蛾）或 swift moth（迅蛾），而“hepialid”偏学术/分类学用语，用来泛指该科的成员。"]}
{"word":"hepialus","summary":{"en":"Hepialus: a scientific genus name for certain moths (swift/ghost moths) in the family Hepialidae.","zh":"Hepialus：幽灵蛾科（Hepialidae）中某些蛾类的科学属名（常称速蛾/幽灵蛾）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus of moths in the family Hepialidae (often called swift moths or ghost moths); used mainly in biological classification.","zh":"一种蛾类的科学属名，隶属于大蚕蛾科/幽灵蛾科（Hepialidae，常称“速蛾/幽灵蛾”）；主要用于生物分类学语境。"},"examples":[{"en":"Hepialus is a genus name used in entomology.","zh":"Hepialus 是昆虫学中使用的一个属名。"},{"en":"Researchers recorded several Hepialus species in the mountain forest.","zh":"研究人员在山地森林中记录到了几种 Hepialus 的物种。"},{"en":"The paper compares Hepialus with other genera in the family Hepialidae.","zh":"这篇论文将 Hepialus 与幽灵蛾科（Hepialidae）中的其他属进行了比较。"}]}],"synonyms":["ghost moth (common-name group)","swift moth (common-name group)"],"phonetic":"/ˌhiːpiˈæləs/","extraExplanation":["这是拉丁化的学名（genus name，属名），日常英语中不常用；多见于学术论文、标本标签、野外调查记录等。","不同文献中对“属”的划分可能会随着分类修订而变化；因此你可能会在新旧资料里看到物种从 Hepialus 被转入其他属，或相反。"]}
{"word":"heppen","summary":{"en":"“Heppen” is usually a misspelling of “happen,” meaning “to occur” or “to turn out.”","zh":"“heppen”通常是“happen”的拼写错误，意思是“发生；结果是/碰巧”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to take place; to occur (often by chance)","zh":"发生；出现（常带有偶然性）"},"examples":[{"en":"What happened last night?","zh":"昨晚发生了什么？"},{"en":"Accidents happen, so be careful.","zh":"意外总会发生，所以要小心。"},{"en":"The meeting will happen at 3 p.m.","zh":"会议将于下午三点举行。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become true or real; to turn out in a particular way","zh":"结果是；变成现实；最终发展成某种情况"},"examples":[{"en":"How did it happen that you know my teacher?","zh":"你怎么会认识我的老师？"},{"en":"It happened that I was free that day.","zh":"碰巧那天我有空。"}]}],"synonyms":["occur","take place","come about","turn out"],"phonetic":"/ˈhæpən/","extraExplanation":["“heppen”通常不是标准英语单词，多半是把“happen”拼错了。","常见搭配：happen to + 人（某事发生在某人身上/某人碰巧……），happen to do sth（碰巧做某事），It happens that…（碰巧……）。"]}
{"word":"hepper","summary":{"en":"“Helper” means a person or thing that gives assistance or makes a task easier.","zh":"“Helper”指“帮忙的人”或“用于协助完成任务的事物/工具”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who helps someone do a task or provides support","zh":"帮手；助手；协助者"},"examples":[{"en":"Thanks to my helper, I finished the project on time.","zh":"多亏了我的帮手，我按时完成了项目。"},{"en":"The teacher asked for a helper to pass out the papers.","zh":"老师请一位同学当助手来发试卷。"}]},{"partOfSpeech":"adj.","definition":{"en":"used before a noun to describe something that helps you do a job or task","zh":"（作定语）辅助的；帮忙用的"},"examples":[{"en":"A helper app can organize your schedule.","zh":"辅助应用可以帮你整理日程。"},{"en":"She bought a helper tool for opening jars.","zh":"她买了一个开罐辅助工具。"}]}],"synonyms":["assistant","aide","supporter","helper tool","helper app"],"phonetic":"/ˈhɛlpɚ/","extraExplanation":["“hepper”在英语里不常见；大多数情况下是把“helper”拼错了（少了一个 l）。","如果你指的是专有名词（如姓氏 Hepper 或品牌名），请告诉我上下文（句子/领域），我可以按正确用法解释。"]}
{"word":"hepplewhite","summary":{"en":"Hepplewhite refers to a late-18th-century English Neoclassical furniture style, or a furniture piece made in that style.","zh":"Hepplewhite 指18世纪末英国的新古典主义家具风格，也可指该风格的一件家具。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often capitalized) A Neoclassical style of English furniture and interior design from the late 1700s, known for elegant, light pieces with curved lines and fine inlay.","zh":"（常大写）赫普尔怀特风格：18世纪末英国的新古典主义家具与室内设计风格，以轻巧优雅、曲线轮廓和精致镶嵌装饰为特点。"},"examples":[{"en":"The dining chairs are in the Hepplewhite style, with slim legs and an elegant shield-shaped back.","zh":"这些餐椅是赫普尔怀特风格，腿部细长，椅背呈优雅的盾形。"},{"en":"They restored the room using Hepplewhite details like delicate inlay and graceful curves.","zh":"他们用赫普尔怀特风格的细节来修复房间，比如精细的镶嵌和柔和的曲线。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of furniture made in the Hepplewhite style (such as a chair, sideboard, or desk).","zh":"赫普尔怀特式家具（指按该风格制作的椅子、餐边柜、书桌等单件家具）。"},"examples":[{"en":"At the auction, a Hepplewhite from the 1790s sold for a high price.","zh":"在拍卖会上，一件1790年代的赫普尔怀特式家具拍出了高价。"},{"en":"She collects Hepplewhites and Sheratons for her period home.","zh":"她为自己的古典住宅收藏赫普尔怀特式和谢拉顿式家具。"}]}],"synonyms":["Neoclassical (furniture)","Georgian (style)","Sheraton (related style)"],"phonetic":"/ˈhɛpəlˌwaɪt/","extraExplanation":["“Hepplewhite”来自英国家具匠与设计传统，常与同一时期的“Sheraton（谢拉顿）”并列。","学习辨认时，可关注典型元素：盾形椅背（shield back）、细直或微弯的椅腿、浅色木材与细致镶嵌（inlay）、整体更“轻盈”而非厚重。","在艺术史与室内设计语境里，它属于英国乔治时代后期的新古典主义审美。"]}
{"word":"hepta","summary":{"en":"Hepta- means “seven” and appears in technical/scientific vocabulary.","zh":"hepta- 表示“七”，常见于科学与技术词汇中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix meaning “seven,” used in many scientific and technical words","zh":"表示“七”的前缀，常用于科学与技术词汇中"},"examples":[{"en":"A heptagon is a shape with seven sides.","zh":"heptagon（七边形）是有七条边的图形。"},{"en":"In chemistry, heptane is a hydrocarbon with seven carbon atoms.","zh":"在化学中，heptane（庚烷）是一种含有七个碳原子的烃。"},{"en":"The heptathlon is a competition with seven track-and-field events.","zh":"heptathlon（七项全能）是一项包含七个田径项目的比赛。"}]}],"synonyms":["seven-"],"phonetic":"/ˈhɛptə/","extraExplanation":["“hepta-”来自古希腊语 *hepta*（七）。常见于学术词汇：heptagon（七边形）、heptane（庚烷）、heptathlon（七项全能）。有时也会见到拉丁来源的对应形式“sept-”（如 September 原意与“七”有关）。"]}
{"word":"heptacapsular","summary":{"en":"Heptacapsular means “having seven capsules or compartments,” mainly in scientific/technical contexts.","zh":"Heptacapsular 指“具有七个囊或隔室”的，多用于科学/技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven capsules or capsule-like parts; made up of seven compartments (often used in technical descriptions in biology or medicine).","zh":"（多用于生物学/医学等技术语境）具有七个囊或囊状部分的；由七个隔室/腔室组成的。"},"examples":[{"en":"The botanist described the fruit as heptacapsular, meaning it has seven distinct seed capsules.","zh":"植物学家把这种果实描述为 heptacapsular，意思是它有七个独立的种子囊。"},{"en":"In the report, the structure was noted as heptacapsular based on its seven capsule-like chambers.","zh":"报告中根据其七个囊状腔室，将该结构记为 heptacapsular。"}]}],"synonyms":["seven-capsuled","seven-chambered","septate (context-dependent)"],"phonetic":"/ˌhɛptəˈkæpsjələr/","extraExplanation":["这是一个比较少见的专业形容词，常见于科学写作（如植物形态学、解剖学）。","词源构词：hepta- 表示“七”（如 heptagon 七边形），capsular 来自 capsule（囊、蒴、胶囊），合起来就是“七囊的/七蒴的”。在具体学科里可能指“七个蒴果”“七个囊腔”等，最好结合上下文理解。"]}
{"word":"heptace","summary":{"en":"“Heptace” is not a standard English word; it’s probably a misspelling or a proper name.","zh":"“heptace”不是标准英文词；更可能是拼写错误或专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard or commonly recognized English word; it is likely a misspelling or a specialized name (e.g., a product, username, or proper noun).","zh":"不是标准或常见的英文单词；更可能是拼写错误，或某个专有名称（如产品名、用户名、专有名词）。"},"examples":[{"en":"I couldn’t find “heptace” in a standard English dictionary—did you mean “heptane” or “heptad”?","zh":"我在常见英文词典里找不到“heptace”——你是不是想写“heptane（庚烷）”或“heptad（七个一组）”？"},{"en":"If “Heptace” is a brand or app name, please share the sentence where you saw it.","zh":"如果“Heptace”是品牌名或应用名，请把你看到它的句子发我看看。"}]}],"phonetic":"/ˈhɛp.teɪs/","extraExplanation":["“hepta-”是常见前缀，来自希腊语，意思是“七”。所以很多以hepta-开头的词都和“七”有关，比如：heptagon（七边形）、heptad（七个一组）、heptane（化学名：庚烷）。\n\n你可以告诉我它出现的上下文（句子/领域：化学、数学、游戏、公司名等），我就能更准确地判断“heptace”到底指什么，或帮你纠正为最可能的正确拼写。"]}
{"word":"heptachlor","summary":{"en":"Heptachlor is a formerly common insecticide now widely restricted due to environmental persistence and health concerns.","zh":"Heptachlor（七氯）是一种曾经常用的杀虫剂，因环境持久性和健康风险在许多地区被严格限制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chlorinated chemical once used as an insecticide to kill termites and other insects; now banned or tightly restricted in many places because it can persist in the environment and may harm health","zh":"一种含氯化学物质，过去用作杀虫剂来杀灭白蚁等昆虫；由于在环境中难以分解并可能危害健康，在许多地区已被禁用或严格限制"},"examples":[{"en":"Heptachlor was used in the past to control termites around houses.","zh":"过去人们会用七氯（heptachlor）来防治房屋周围的白蚁。"},{"en":"Many countries restrict heptachlor because it can remain in soil for a long time.","zh":"许多国家限制使用七氯，因为它可能在土壤中残留很久。"}]}],"synonyms":["insecticide","pesticide","organochlorine (pesticide)"],"phonetic":"/ˈhɛptəˌklɔr/","extraExplanation":["“Hepta-”表示“七”，“-chlor”与“氯”有关；heptachlor 这一名称反映了它属于含氯有机化合物（早期常见的一类农药）。","在新闻、环保报告或公共健康材料中更常见；日常口语里通常会说 “a banned pesticide / a toxic insecticide（被禁用的农药/有毒杀虫剂）”。"]}
{"word":"heptachord","summary":{"en":"A heptachord is a group of seven musical notes, often forming a scale.","zh":"heptachord 指由七个音组成的音组，常用来指七声音阶或七音音列。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set or sequence of seven musical notes, especially one that forms a scale or mode.","zh":"七音音阶；七音音列（由七个音组成的音组，尤指构成某种音阶或调式的音列）"},"examples":[{"en":"In Western music, the diatonic scale can be described as a heptachord.","zh":"在西方音乐中，自然音阶可以被描述为一种七音音阶（heptachord）。"},{"en":"The teacher asked us to sing the heptachord slowly to hear each step clearly.","zh":"老师让我们把七声音阶慢慢唱出来，以便清楚听到每一步音程变化。"}]}],"synonyms":["heptatonic scale","seven-note scale","diatonic scale (common example)"],"phonetic":"/ˈhɛp.tə.kɔrd/","extraExplanation":["词源提示：hepta- 表示“七”（来自希腊语），-chord 与“弦/音”相关（同源于希腊语 khordē，原意与“弦”有关）。因此 heptachord 字面意思就是“七个音（或弦）组成的音组”。","易混词区分：heptatonic（七声音阶的，形容词）常用来描述“由七个不同音级组成的音阶体系”；heptachord 更偏向名词，指“那一组七个音”或“七音音列”。"]}
{"word":"heptachronous","summary":{"en":"A rare adjective meaning “recurring in a seven-unit time cycle,” often read as every seven years.","zh":"一个罕见形容词，表示“以七为周期重复发生”，常理解为每七年一次。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Happening or returning at intervals of seven time units (most often interpreted as seven years).","zh":"（罕见）以“七”为周期发生或重复的（最常理解为每七年一次）。"},"examples":[{"en":"The town held a heptachronous festival that returned every seven years.","zh":"这个小镇举办一个每七年一次的七周期节庆。"},{"en":"In the old notes, the author mentions a heptachronous pattern in local elections.","zh":"在旧笔记里，作者提到当地选举呈现“七年一轮”的周期模式。"}]}],"synonyms":["septennial","seven-yearly","seven-year cycle"],"phonetic":"/ˌhɛp.təˈkrɑː.nəs/","extraExplanation":["这个词非常少见，通常由 hepta-（七）+ chronous（与时间/周期有关）构成。实际写作中更常用的表达是 every seven years、seven-year cycle，或更正式一点用 septennial（每七年的）。由于罕见，读者可能需要上下文才能确定“七”指的是七年、七天或其他时间单位。"]}
{"word":"heptacolic","summary":{"en":"“Heptacolic” is not a standard English word; it is likely a typo or a very rare coined term.","zh":"“Heptacolic” 不是标准英语词汇；更可能是拼写错误或非常罕见的临时造词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard or widely recognized English word. It is extremely rare in modern usage and may be a misspelling or a made-up form.","zh":"不是标准或常见的英语单词。现代用法中极为罕见，可能是拼写错误或人为造词。"},"examples":[{"en":"I couldn’t find “heptacolic” in major dictionaries, so it may be a typo.","zh":"我在主流词典里找不到“heptacolic”，所以它可能是个拼写错误。"},{"en":"If you meant “hepatic,” that word relates to the liver.","zh":"如果你想写的是“hepatic”，它表示“与肝脏有关的”。"},{"en":"If you meant “heptachord,” it refers to something with seven strings or notes.","zh":"如果你想写的是“heptachord”，它指“七弦的”或“七音的”。"}]}],"phonetic":"ˌhɛptəˈkɑlɪk","extraExplanation":["构词上看，hepta- 是“七”的前缀；-colic 常见于 colic（肠绞痛）或 colonic（结肠的）等词。但 “heptacolic” 本身不属于常见规范词汇，因此更可能是：\n1) 拼写误差（如 hepatic 与肝脏相关；heptachord 与七弦/七音相关）；\n2) 非正式/特定圈子里的临时用词。\n如果你能提供一句原文语境（出现在哪篇文章/学科/句子里），我可以更准确判断它想表达的意思。"]}
{"word":"heptacosane","summary":{"en":"Heptacosane is a 27‑carbon alkane (C27H56) found in waxes and used as a reference chemical.","zh":"二十七烷是一种 27 碳的烷烃（C27H56），常见于蜡质中，并常用作参考化学品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A saturated hydrocarbon (an alkane) with 27 carbon atoms, chemical formula C27H56, often found in waxes and used in chemistry/materials research.","zh":"一种含有 27 个碳原子的饱和烃（烷烃），化学式为 C27H56，常见于蜡质中，也用于化学与材料研究。"},"examples":[{"en":"Heptacosane is one of the long-chain hydrocarbons found in plant waxes.","zh":"二十七烷是植物蜡中常见的一种长链烃。"},{"en":"In the lab, heptacosane can be used as a reference compound when analyzing waxy mixtures.","zh":"在实验室里，二十七烷可作为分析蜡状混合物时的参考化合物。"}]}],"synonyms":["n-heptacosane"],"phonetic":"ˌhɛptəˈkoʊseɪn","extraExplanation":["“heptacosane”这个词来自烷烃命名：hepta-（7）+ cos-（20），合起来表示 27 个碳；“-ane”表示烷烃（全为单键的饱和烃）。","它属于“正构烷烃”（n-alkane）家族的一员，链越长通常越像蜡，常用于研究蜡、润滑材料、以及某些天然样品（如植物表皮蜡、昆虫表面蜡）的成分。"]}
{"word":"heptad","summary":{"en":"Heptad means a set or group of seven.","zh":"heptad 指“由七个组成的一组”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group or set of seven people or things.","zh":"由七个成员（人或物）组成的一组；七人/七个一组。"},"examples":[{"en":"In Greek myth, the Pleiades are often described as a heptad of sisters.","zh":"在希腊神话中，昴宿星（七姊妹）常被描述为由七位姐妹组成的七人组。"},{"en":"The committee formed a heptad to review the proposal.","zh":"委员会组成了一个七人小组来审查该提案。"}]}],"synonyms":["group of seven","septet","set of seven","seven-member group"],"phonetic":"/ˈhɛp.tæd/","extraExplanation":["“heptad”较偏正式、书面语，常出现在神话、宗教、哲学或文学语境里，用来强调“七个构成的整体”。日常英语更常用“a group of seven / seven-member group”。","词源：来自希腊语“hepta-”（七）+ “-ad”（表示一组/集合）。因此你也会看到类似构词，如“triad（三个一组）”“tetrad（四个一组）”。","文学与文化：在西方文化中，“七”常带象征意义（如七宗罪、七美德、七大奇迹等），使用“heptad”有时带一点“象征性分组”的味道。"]}
{"word":"heptadecane","summary":{"en":"Heptadecane is a 17-carbon straight-chain alkane (C17H36), commonly found in petroleum and used as a reference chemical in labs.","zh":"Heptadecane（十七烷）是含17个碳的直链烷烃（C17H36），常见于石油中，并常在实验室中用作参考化学品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a straight-chain alkane with 17 carbon atoms (chemical formula C17H36), usually a colorless oily liquid; found in petroleum and used in chemistry as a reference compound.","zh":"十七烷：一种含17个碳原子的直链烷烃（化学式 C17H36），通常为无色油状液体；存在于石油中，在化学研究中常用作参考物质。"},"examples":[{"en":"Heptadecane is one of the hydrocarbons commonly found in crude oil.","zh":"十七烷是原油中常见的烃类之一。"},{"en":"In the lab, we used heptadecane as a standard to compare retention times in gas chromatography.","zh":"在实验室里，我们用十七烷作标准品来比较气相色谱中的保留时间。"}]}],"synonyms":["n-heptadecane","C17H36"],"phonetic":"/ˌhɛp.təˈdɛk.eɪn/","extraExplanation":["“heptadecane”这个词由希腊语前缀 hepta-（七）和 dec-（十）组合而来，表示“七加十=十七”；后缀 -ane 表示烷烃（只含单键的饱和烃）。","十七烷属于直链烷烃系列（n-alkanes）之一，常出现在燃料、蜡类与石油馏分相关的讨论中；在分析化学里也常作为内标或参考物质出现。"]}
{"word":"heptadecyl","summary":{"en":"Heptadecyl refers to a 17-carbon alkyl group (C17H35–) used in chemical names.","zh":"Heptadecyl 指含17个碳的烷基取代基（C17H35–），常用于化学命名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a chemical group (alkyl substituent) with 17 carbon atoms, usually written as C17H35–, derived from heptadecane","zh":"（化学）十七烷基：含17个碳原子的烷基取代基，常写作 C17H35–，来源于十七烷（heptadecane）"},"examples":[{"en":"Heptadecyl groups are common in waxy, water-repellent materials.","zh":"十七烷基常见于蜡状、疏水的材料中。"},{"en":"The paper reports a heptadecyl chain attached to the aromatic ring.","zh":"论文报告说在芳环上连接了一条十七烷基链。"}]},{"partOfSpeech":"n.","definition":{"en":"the heptadecyl group itself (used as a noun in chemistry)","zh":"（化学名词用法）十七烷基这种取代基本身"},"examples":[{"en":"Add a heptadecyl to increase the molecule’s hydrophobicity.","zh":"加入一个十七烷基可以提高分子的疏水性。"}]}],"synonyms":["C17 alkyl","heptadecan-1-yl"],"phonetic":"ˌhɛptəˈdɛsɪl","extraExplanation":["这是系统命名的一部分：前缀 hepta-（7）+ dec-（10）表示“7+10=17”，-yl 表示“烷基取代基”。","在有机化学命名中，heptadecyl 常等同于 heptadecan-1-yl（十七烷-1-基），用于描述“从十七烷去掉一个氢后得到的侧链”。"]}
{"word":"heptadic","summary":{"en":"Heptadic means “related to seven,” especially something made of seven parts or happening in groups of seven.","zh":"Heptadic 指“与七有关”，尤其是由七部分构成或以七为单位出现的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Consisting of seven parts; relating to the number seven.","zh":"由七个部分组成的；与数字“七”有关的。"},"examples":[{"en":"The class used a heptadic (seven-part) chart to organize the week’s goals.","zh":"这门课用一个 heptadic（七部分的）图表来整理一周目标。"},{"en":"In some traditions, people talk about a heptadic structure of steps or stages.","zh":"在一些传统中，人们会谈到由七个步骤或阶段构成的 heptadic 结构。"}]},{"partOfSpeech":"adj.","definition":{"en":"Occurring in groups of seven; sevenfold.","zh":"以七为一组出现的；七倍的。"},"examples":[{"en":"The poem repeats a heptadic pattern, returning to the same idea every seven lines.","zh":"这首诗重复一种 heptadic 模式：每七行就回到同一个主题。"},{"en":"They described the schedule as heptadic, with a cycle that resets every seven days.","zh":"他们把这个日程描述为 heptadic：每七天重置一次的循环。"}]}],"synonyms":["seven-part","sevenfold","septenary","heptagonal (specific to shapes)"],"phonetic":"/hɛpˈtædɪk/","extraExplanation":["“heptadic”是一个较少见、偏学术的词，来自希腊语词根 hepta-（七）加上形容词后缀 -ic（……的）。在日常英语里，人们更常说 seven-part、sevenfold、in groups of seven。"]}
{"word":"heptads","summary":{"en":"Heptads means groups or units of seven (plural of heptad).","zh":"heptads 是 heptad 的复数，指“七个一组/七位为单位的结构或模式”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group or set of seven people or things","zh":"七个一组；七人（或七物）一套"},"examples":[{"en":"The book is divided into heptads of stories, with seven tales in each section.","zh":"这本书按“七篇一组”的方式分组，每一部分都有七个故事。"},{"en":"They collected the data in heptads to compare each set of seven days.","zh":"他们把数据按七天为一组来整理，以便比较每个七日周期。"}]},{"partOfSpeech":"n.","definition":{"en":"(specialized) a repeating pattern or unit of seven, especially in biology/chemistry (e.g., a seven-position repeat in a protein sequence)","zh":"（专门）由七个为单位的重复模式或结构，尤指生物/化学中的“七位重复”（如蛋白质序列中的七个位置循环）"},"examples":[{"en":"The researchers examined a heptad repeat in the protein to understand how it folds.","zh":"研究人员分析了该蛋白中的“七位重复”，以理解它如何折叠。"}]}],"synonyms":["group of seven","septet","set of seven"],"phonetic":"/ˈhɛp.tæd/","extraExplanation":["“heptad”来自希腊语 hepta（七）。你输入的 heptads 是复数形式；单数是 heptad。","在学术语境里，heptad 常见于“heptad repeat（七位重复）”，尤其在描述某些蛋白结构（如 coiled-coil 卷曲螺旋）时会用到。"]}
{"word":"heptaglot","summary":{"en":"A heptaglot is a person who knows seven languages; it can also describe something involving seven languages.","zh":"heptaglot 指“会七种语言的人”，也可形容“涉及七种语言的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Able to speak, read, or use seven languages; a person who knows seven languages.","zh":"会七种语言的；会七种语言的人。"},"examples":[{"en":"She’s a heptaglot who can work as an interpreter in seven languages.","zh":"她会七种语言，可以胜任七语口译的工作。"},{"en":"Calling him a heptaglot may be accurate, but it doesn’t mean he’s equally fluent in all seven.","zh":"称他为“会七语的人”可能没错，但不代表他七种语言都同样流利。"}]},{"partOfSpeech":"adj.","definition":{"en":"Knowing or involving seven languages.","zh":"涉及七种语言的；使用七种语言的。"},"examples":[{"en":"The museum offered a heptaglot audio guide to serve more visitors.","zh":"博物馆提供七语语音导览，以服务更多游客。"}]}],"synonyms":["seven-language speaker","polyglot (broader)","multilingual (broader)"],"phonetic":"/ˈhɛp.tə.ɡlɑt/","extraExplanation":["词源上，hepta- 来自希腊语，表示“七”，-glot/-glott 来自表示“舌头/语言”的词根（如 polyglot“多语者”）。因此 heptaglot 直译就是“七语者”。","这是较少见、偏书面或趣味性的词。日常交流中更常用：speaks seven languages / knows seven languages。"]}
{"word":"heptagon","summary":{"en":"A heptagon is a seven-sided polygon.","zh":"heptagon 指七边形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a polygon (a flat shape) with seven sides and seven angles","zh":"七边形（有七条边和七个角的多边形）"},"examples":[{"en":"A regular heptagon has seven equal sides and seven equal angles.","zh":"正七边形有七条相等的边和七个相等的角。"},{"en":"Draw a heptagon by connecting seven points in order.","zh":"按顺序连接七个点就能画出一个七边形。"}]}],"synonyms":["seven-sided polygon"],"phonetic":"/ˈhɛp.təˌɡɑn/","extraExplanation":["词源小提示：hepta- 表示“七”（来自希腊语），-gon 表示“角/边”（也常见于 pentagon 五边形、hexagon 六边形）。","学习延伸：日常英语里更常见的是 pentagon（五边形）和 hexagon（六边形）；heptagon 多出现在数学或几何语境中。"]}
{"word":"heptagonal","summary":{"en":"Heptagonal means “seven-sided” (like a heptagon).","zh":"heptagonal 表示“七边形的；有七条边（或七个角）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven sides or seven angles; shaped like a heptagon.","zh":"七边形的；有七条边或七个角的。"},"examples":[{"en":"They designed a heptagonal table so seven people could sit equally spaced.","zh":"他们设计了一张七边形的桌子，这样七个人可以等距而坐。"},{"en":"The courtyard has a heptagonal layout, with a fountain in the center.","zh":"这个庭院是七边形布局，中间有一座喷泉。"}]}],"synonyms":["seven-sided","heptagon-shaped"],"phonetic":"/hɛpˈtæɡənəl/","extraExplanation":["词源提示：hepta- 表示“七”（源自希腊语），-gonal 与“角/边”有关（同类词如 pentagonal 五边形的、hexagonal 六边形的、octagonal 八边形的）。","学习提示：在日常英语里更常见的名词是 heptagon（七边形）；heptagonal 用来描述形状或结构。"]}
{"word":"heptagons","summary":{"en":"Heptagons are seven-sided polygons.","zh":"Heptagons 指七边形（七条边的多边形）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A seven-sided polygon (a shape with seven straight sides and seven angles).","zh":"七边形（有七条直边和七个角的多边形）。"},"examples":[{"en":"A regular heptagon has seven equal sides.","zh":"正七边形有七条相等的边。"},{"en":"The logo is based on a heptagon shape.","zh":"这个标志以七边形为基础形状。"}]}],"synonyms":["seven-sided polygon"],"phonetic":"/ˈhɛp.təˌɡɑn/","extraExplanation":["“heptagon”来自希腊语词根：hepta- 表示“七”，-gon 表示“角/边（多边形）”。","数学里常见搭配：regular heptagon（正七边形）、irregular heptagon（不规则七边形）。"]}
{"word":"heptagrid","summary":{"en":"Heptagrid means a grid/tiling based on heptagons, especially a repeating regular-heptagon tiling discussed in hyperbolic geometry.","zh":"Heptagrid 指以七边形为基础的网格/铺砌结构；在数学里常特指双曲几何中的规则七边形重复铺砌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A grid or tiling made from seven-sided shapes (heptagons), often used to describe a repeating pattern of heptagons in geometry or design.","zh":"由七边形（heptagon）构成的网格/铺砌（镶嵌）图案；常用于几何或图案设计中描述重复排列的七边形结构。"},"examples":[{"en":"The artist experimented with a heptagrid pattern to create a more unusual mosaic.","zh":"这位艺术家尝试用七边形网格图案来做出更特别的马赛克。"},{"en":"In our geometry project, we tried to draw a simple heptagrid, but it was hard to make it fit evenly.","zh":"在几何作业里我们试着画一个简单的七边形网格，但很难让它均匀地拼合。"}]},{"partOfSpeech":"n.","definition":{"en":"In mathematics (especially hyperbolic geometry), a specific kind of infinite tiling where regular heptagons repeat in a consistent way (often referring to the {7,3} tiling).","zh":"（数学，尤指双曲几何中）一种特定的无限铺砌：规则七边形以固定方式重复排列（常指 {7,3} 的七边形铺砌）。"},"examples":[{"en":"The paper uses the heptagrid to illustrate how distance behaves differently in hyperbolic space.","zh":"这篇论文用“七边形铺砌网格”来说明双曲空间里的距离规律为何不同。"},{"en":"Unlike a square grid on paper, a heptagrid is usually discussed in hyperbolic geometry.","zh":"不同于纸上的正方形网格，heptagrid 通常是在双曲几何里讨论的。"}]}],"synonyms":["heptagonal grid","heptagon tiling","heptagonal tiling"],"phonetic":"/ˈhɛp.təˌɡrɪd/","extraExplanation":["“heptagrid”不是日常英语里的常用词，更常见于数学/计算机科学/几何爱好者语境。","在欧氏平面里，规则七边形无法像正方形或正六边形那样“无缝铺满”平面；因此很多人提到 heptagrid 时，背景往往是“双曲平面（hyperbolic plane）”的镶嵌。","相关写法有时会看到“heptagonal grid / heptagon tiling”，表达更直观、更容易被一般读者理解。"]}
{"word":"heptagynia","summary":{"en":"Heptagynia is a rare botanical term meaning “having seven pistils,” used especially in older Linnaean-style classification.","zh":"Heptagynia 是一个较少见的植物学术语，意为“具有七个雌蕊”，多用于较早的林奈式分类或形态描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, taxonomy) A Linnaean class/section name referring to plants that have seven pistils (female reproductive parts).","zh":"（植物学/分类学）林奈分类法中的一个类别/小类名称，指雌蕊（柱头/心皮）数量为七个的植物。"},"examples":[{"en":"In older botanical books, you may see a plant placed under “Heptagynia” based on the number of pistils.","zh":"在较早的植物学书籍里，你可能会看到某种植物因雌蕊数量而被归入“Heptagynia”。"},{"en":"The description notes heptagynia—seven distinct pistils in a single flower.","zh":"描述中提到heptagynia——一朵花里有七个彼此分开的雌蕊。"}]}],"synonyms":["heptagyny","heptagynous (related adjective)"],"phonetic":"/ˌhɛptəˈdʒɪniə/","extraExplanation":["该词由希腊语词根组成：hepta-（七）+ -gynia（与“女性/雌蕊”相关）。在现代植物分类中，这类以雄蕊/雌蕊数量来分组的林奈式术语多见于历史文献或形态描述中，而不是主流系统分类。","注意与形容词 heptagynous（七雌蕊的）相关；在写作中更常用的是形容词来描述花的结构。"]}
{"word":"heptagynous","summary":{"en":"Heptagynous describes a flower that has seven pistils/carpels (a technical botanical term).","zh":"heptagynous 指“具有七个雌蕊/心皮的（花）”，属于植物学专业术语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven female reproductive parts (pistils/carpels); used mainly in botany to describe a flower.","zh":"（植物学）具七个雌蕊/心皮的；用于描述花的结构。"},"examples":[{"en":"In some botanical descriptions, a flower may be labeled heptagynous if it has seven pistils.","zh":"在一些植物学描述中，如果一朵花有七个雌蕊，就可能被标注为 heptagynous（七雌蕊的）。"},{"en":"The specimen was noted as heptagynous, which helped narrow down its identification.","zh":"该标本被记录为 heptagynous（七雌蕊的），这有助于缩小鉴定范围。"}]}],"synonyms":["seven-pistilled","seven-carpellate"],"phonetic":"/hɛpˈtædʒənəs/","extraExplanation":["词源拆解：hepta- 表示“七”（如 heptagon 七边形）；-gynous 来自希腊语 gynē，和 “female/妇女、雌性”有关。在植物学里常用来指与雌蕊/雌性器官数量或结构相关的特征。","使用场景：这是非常专业的植物形态学用语，通常出现在植物志、分类学论文或标本记录中；日常英语几乎不用。"]}
{"word":"heptahedra","summary":{"en":"Heptahedra are 3D solids with seven faces (plural of heptahedron).","zh":"Heptahedra 指“七面体”，即有七个面的三维立体（heptahedron 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of heptahedron: solid (3D) shapes that have seven faces (usually flat polygon faces).","zh":"heptahedron（七面体）的复数：指有七个面（通常为平面多边形面）的立体（3D）形状。"},"examples":[{"en":"Some crystals can be modeled as irregular heptahedra.","zh":"一些晶体可以用不规则七面体来建模。"},{"en":"In geometry class, we compared cubes, pyramids, and heptahedra.","zh":"在几何课上，我们比较了立方体、棱锥和七面体。"}]}],"synonyms":["seven-faced polyhedra","heptahedrons"],"phonetic":"ˌhɛptəˈhiːdrə","extraExplanation":["词源：hepta- 来自希腊语，表示“七”；-hedron 表示“面/底面”（如 polyhedron“多面体”、tetrahedron“四面体”）。","注意：现实中“七面体”常见的是“不规则七面体”，并不像正方体那样有唯一的规则形；在数学里通常更关注“有七个面”这一特征。","相关概念：polyhedra（多面体复数）、tetrahedra（四面体复数）、pentahedra（五面体复数）、hexahedra（六面体复数）。"]}
{"word":"heptahedral","summary":{"en":"Heptahedral means “seven-faced,” usually referring to a polyhedron with seven faces.","zh":"heptahedral 指“七个面的”，通常用来形容具有七个面的多面体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven faces (sides/surfaces), especially describing a solid shape (a polyhedron) with seven flat faces.","zh":"七面体的；具有七个面的（尤指有七个平面的立体几何形体）。"},"examples":[{"en":"A heptahedral solid is any polyhedron with seven faces.","zh":"七面体是指任何具有七个面的多面体。"},{"en":"In the model, the heptahedral form looks irregular because its faces are different shapes.","zh":"在这个模型中，这个七面体看起来是不规则的，因为它的各个面形状不同。"}]}],"synonyms":["seven-faced","seven-sided (less precise)","polyhedral (broader)"],"phonetic":"/ˌhɛptəˈhiːdrəl/","extraExplanation":["词源：hepta- 来自希腊语，表示“七”；-hedral 与“面/表面”有关（也见 polyhedral“多面体的”）。所以 heptahedral 字面意思就是“七个面的”。","使用场景：这个词多见于数学、几何、工程建模等语境；日常英语里更常说 “a seven-faced shape / a seven-faced polyhedron”。"]}
{"word":"heptahedrdra","summary":{"en":"Heptahedron means a 3D solid with seven faces.","zh":"Heptahedron 指“七面体”，即有七个面的三维立体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A three-dimensional solid (polyhedron) that has 7 flat faces.","zh":"七面体：一种有7个平面面的三维立体（多面体）。"},"examples":[{"en":"A cube has 6 faces, but a heptahedron has 7.","zh":"正方体有6个面，而七面体有7个面。"},{"en":"In geometry class, we learned that different heptahedra can have different shapes.","zh":"在几何课上，我们学到不同的七面体可以有不同的形状。"}]}],"synonyms":["seven-faced polyhedron"],"phonetic":"/ˌhɛptəˈhiːdrən/","extraExplanation":["你输入的 “heptahedrdra” 很可能是拼写错误；常见的标准词是 heptahedron（单数）和 heptahedra（复数）。","词源：hepta- 来自希腊语，表示“七”；-hedron 表示“面/底面”。因此字面意思就是“七个面”的立体。","注意：不像 “cube（正方体）” 那样形状固定，“heptahedron（七面体）” 只规定“有7个面”，具体外形可以有很多种。"]}
{"word":"heptahedrical","summary":{"en":"Heptahedrical means “having seven faces,” used mainly in geometry.","zh":"heptahedrical 意为“具有七个面（七面体的）”，主要用于几何语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven faces (seven flat surfaces); relating to a heptahedron.","zh":"（几何）具有七个面（七个平面）的；与七面体有关的。"},"examples":[{"en":"A heptahedrical solid has seven faces, though those faces may be different shapes.","zh":"七面体有七个面，不过这些面可以是不同的形状。"},{"en":"The teacher asked us to sketch a heptahedrical figure and label each face.","zh":"老师让我们画一个七面体并标出每个面。"}]}],"synonyms":["heptahedral","seven-faced"],"phonetic":"/ˌhɛptəˈhidrɪkəl/","extraExplanation":["“hepta-”来自希腊语，表示“七”（如 heptagon 七边形）；“-hedral/-hedrical”与“面（face）”有关，常见于几何或晶体学语境。","更常见的拼写是 heptahedral；heptahedrical 属于较少见的变体，但意义相同。"]}
{"word":"heptahedron","summary":{"en":"A heptahedron is a 3D shape with seven faces.","zh":"heptahedron 指“七面体”，即有七个面的三维多面体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A three-dimensional solid (polyhedron) that has seven faces.","zh":"七面体：一种有七个面的三维立体（多面体）。"},"examples":[{"en":"In geometry class, we learned that a heptahedron has seven faces.","zh":"在几何课上，我们学到七面体有七个面。"},{"en":"This model is a heptahedron, but its faces are not all the same shape.","zh":"这个模型是七面体，但它的各个面不一定是相同的形状。"}]}],"synonyms":["seven-faced polyhedron"],"phonetic":"/ˌhɛptəˈhiːdrən/","extraExplanation":["词源上，hepta- 来自希腊语表示“七”，-hedron 表示“面/底面”（常见于 polyhedron 多面体、tetrahedron 四面体等）。","日常英语里更常见的说法是“a polyhedron with seven faces（有七个面的多面体）”，因为七面体的具体分类和规则性不如立方体、四面体那样常被单独讨论。"]}
{"word":"heptahedrons","summary":{"en":"Heptahedrons are 3D shapes with seven faces.","zh":"Heptahedrons 指“七面体”，即有七个面的三维立体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of heptahedron: a three-dimensional shape (polyhedron) that has seven faces.","zh":"heptahedron 的复数：一种有七个面的三维立体（多面体）。"},"examples":[{"en":"In geometry class, we learned that heptahedrons have seven faces.","zh":"在几何课上，我们学到 heptahedrons 有七个面。"},{"en":"The 3D modeling software can generate heptahedrons with different face shapes.","zh":"这个三维建模软件可以生成不同面形状的 heptahedrons。"}]}],"synonyms":["seven-faced polyhedra","heptahedra"],"phonetic":"ˌhɛptəˈhiːdrən","extraExplanation":["词源：hepta- 来自希腊语，表示“七”；-hedron 表示“面/底面”（常见于几何术语，如 tetrahedron 四面体、octahedron 八面体）。","注意：并不是所有 heptahedron 都“长得一样”。“七面体”只规定面数为 7，并不规定每个面必须是相同形状；因此它不像“正方体”那样只有一种标准外形。"]}
{"word":"heptahexahedral","summary":{"en":"A very rare geometry adjective meaning “related to or made from seven hexahedra (six-faced solids).”","zh":"一个极少见的几何学形容词，表示“与七个六面体（六面立体）有关或由其组成”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(geometry, very rare) Made of or relating to seven hexahedra (six-faced solids), or a structure made by combining seven hexahedral parts.","zh":"（几何学用语，极少见）由七个六面体（六个面的立体）组成的；或与由七个六面体组合而成的结构有关的。"},"examples":[{"en":"The researcher modeled a heptahexahedral arrangement by joining seven cube-like cells.","zh":"研究者通过连接七个类似立方体的单元来建模一种 heptahexahedral（七六面体组合）的排列。"},{"en":"A heptahexahedral mesh can appear in advanced simulations of block-based 3D structures.","zh":"在块状三维结构的高级仿真中，可能会出现 heptahexahedral（由七个六面体组成的）网格。"}]}],"synonyms":["seven-hexahedron (technical/approx.)","seven-celled (context-dependent)"],"phonetic":"/ˌhɛp.təˌhɛk.səˈhiː.drəl/","extraExplanation":["这个词非常罕见，主要会出现在高等几何、拓扑、计算机网格/有限元建模等语境中，一般日常英语几乎不用。","构词法：hepta- 表示“七”，hexahedral 表示“六面体的/有六个面的”。合起来多用于描述“由七个六面体单元组成”的结构（具体含义可能随论文/领域定义略有差异）。"]}
{"word":"heptahydrate","summary":{"en":"Heptahydrate means a compound that has seven waters of crystallization (·7H₂O), or the adjective describing that form.","zh":"Heptahydrate 指含有7个结晶水（·7H₂O）的化合物，或描述“七水合”这种形式的形容词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (often a salt) that contains seven molecules of water of crystallization per formula unit.","zh":"七水合物：一种化合物（常见为盐类），其晶体结构中每个化学式单位含有7个结晶水分子。"},"examples":[{"en":"Copper(II) sulfate heptahydrate is the blue crystal often used in school labs.","zh":"硫酸铜(II)七水合物是学校实验室里常见的蓝色晶体。"},{"en":"When the heptahydrate is heated, it can lose water and change color or form.","zh":"七水合物加热后可能失去结晶水，从而改变颜色或形态。"}]},{"partOfSpeech":"adj.","definition":{"en":"containing seven molecules of water of crystallization.","zh":"含有七个结晶水分子的；七水合的。"},"examples":[{"en":"Use the heptahydrate form if the recipe specifies seven waters of hydration.","zh":"如果配方指定七个结晶水，就要使用七水合的形式。"}]}],"synonyms":["seven-hydrate","hydrate (general term)"],"phonetic":"/ˌhɛp.təˈhaɪ.dreɪt/","extraExplanation":["词源小提示：hepta- 表示“七”（如 heptagon 七边形），hydrate 来自“水/水合”。因此 heptahydrate 直译就是“七水合物”。","在化学书写中常见形式为“·7H₂O”（例如：MgSO₄·7H₂O）。这里的“·”表示结晶水与主体化合物共同形成晶体，而不是普通的化学键。"]}
{"word":"heptahydrated","summary":{"en":"Heptahydrated means a compound contains seven water molecules in its crystal structure (·7H₂O).","zh":"heptahydrated 指化合物为“七水合”，即晶体结构中含有 7 个结晶水分子（·7H₂O）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing seven molecules of water of crystallization per formula unit (written as “·7H₂O”).","zh":"（化学）七水合的；每个化学式单位含有七个结晶水分子（写作“·7H₂O”）。"},"examples":[{"en":"Copper(II) sulfate can exist as a heptahydrated crystal under certain conditions.","zh":"硫酸铜（II）在某些条件下可以以七水合晶体的形式存在。"},{"en":"The label indicates a heptahydrated salt, so its molar mass includes the water molecules.","zh":"标签标明它是七水合盐，所以计算摩尔质量时要把结晶水也算进去。"}]}],"synonyms":["seven-hydrated","heptahydrate (n., related form)"],"phonetic":"/ˌhɛp.təˈhaɪ.dreɪ.tɪd/","extraExplanation":["在化学里，“hydrated / 水合的”指晶体结构中固定包含一定数量的水分子（结晶水），这些水不是“潮湿的水”，而是作为晶体的一部分存在。","前缀 hepta- 表示“七”。类似说法还有 monohydrated（一水合）、dihydrated（二水合）、pentahydrated（五水合）等。","实际写法常见为“heptahydrate / 七水合物”（名词），例如“X heptahydrate”或“X·7H₂O”。"]}
{"word":"heptahydric","summary":{"en":"Heptahydric describes a substance that has seven hydroxyl (–OH) groups.","zh":"heptahydric 指“含有七个羟基（–OH）的”物质（化学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having seven hydroxyl (–OH) groups; seven‑alcohol (seven‑hydroxyl) in structure.","zh":"（化学）含有七个羟基（–OH）的；七元醇（七羟基）的。"},"examples":[{"en":"Sorbitol is hexahydric, but a heptahydric alcohol would contain seven –OH groups.","zh":"山梨醇是六元醇，而七元醇则会含有七个 –OH 基团。"},{"en":"The paper describes a heptahydric compound used as a building block for polymer research.","zh":"论文描述了一种七羟基化合物，被用作聚合物研究的构建单元。"}]}],"synonyms":["polyhydric","seven-hydroxyl (descriptive)","heptahydroxy (related/adj.)"],"phonetic":"/ˌhɛp.təˈhaɪ.drɪk/","extraExplanation":["这个词在日常英语中非常少见，主要出现在化学/材料科学文献里。词形结构是：hepta-（七）+ hydric（与水/氢相关，在这里引申为“含羟基的”）。在更常见的表达中，学术写作也可能直接说“a compound with seven hydroxyl groups”或用“polyhydric（多元醇的）”来概括。"]}
{"word":"heptahydroxy","summary":{"en":"A chemistry adjective meaning “containing seven hydroxyl (–OH) groups.”","zh":"化学用形容词，表示“含有七个羟基（–OH）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having seven hydroxyl (–OH) groups in a molecule; seven-hydroxylated.","zh":"（化学）指分子中含有七个羟基（–OH）的；七羟基取代的。"},"examples":[{"en":"Heptahydroxy compounds are highly polar because they contain many –OH groups.","zh":"七羟基化合物通常极性很强，因为它们含有很多 –OH 羟基。"},{"en":"The paper reports a heptahydroxy derivative isolated from a plant extract.","zh":"该论文报告从植物提取物中分离得到一种七羟基衍生物。"}]}],"synonyms":["seven-hydroxylated","hepta-hydroxylated","polyhydroxy (broader)"],"phonetic":"/ˌhɛptəhaɪˈdrɑːksi/","extraExplanation":["这是一个偏专业的化学构词：hepta- 表示“七”，hydroxy 表示“羟基（–OH）”。因此 heptahydroxy 常用于命名或描述结构，例如“heptahydroxyflavone（七羟基黄酮）”。","含有多个羟基的分子往往更亲水、能形成更多氢键，因此可能更易溶于水或具有较高的熔点（具体仍取决于整体结构）。"]}
{"word":"heptal","summary":{"en":"Heptal is a rare adjective meaning “related to seven” or “having seven parts.”","zh":"Heptal 是一个较少见的形容词，意思是“与七有关的”或“由七部分组成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Relating to seven; having seven parts.","zh":"（罕见/偏专业）与“七”有关的；由七部分组成的。"},"examples":[{"en":"In some older texts, a “heptal” structure means one with seven sections.","zh":"在一些较旧的文本中，“heptal”结构指有七个部分的结构。"},{"en":"The design uses a heptal pattern, repeating seven shapes around a center.","zh":"这个设计使用了七元（heptal）图案，围绕中心重复七个形状。"}]}],"synonyms":["sevenfold","seven-part","heptadic"],"phonetic":"/ˈhɛptəl/","extraExplanation":["“heptal”来源于希腊语词根 hepta-（七）。现代英语里更常用的是 heptagonal（七边形的）、heptad（七个一组）、sept-（拉丁语词根，也表示七，如 September 原本是“第七个月”）。因此你在日常阅读中很少会遇到 heptal，它多见于较旧或较专业的写法。"]}
{"word":"heptameride","summary":{"en":"A heptameride is a seven-subunit molecular assembly (a heptamer).","zh":"heptameride 指由七个亚基/单元组成的分子组装体（七聚体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry/Biology) A molecule or complex made of seven similar subunits (a seven-unit oligomer); a seven-membered assembly.","zh":"（化学/生物）由七个相同或相似亚基组成的分子或复合体；七聚体/七聚物（七个单元的组装体）。"},"examples":[{"en":"In some proteins, the active form is a heptameride made of seven identical subunits.","zh":"在一些蛋白质中，具有活性的形式是由七个相同亚基组成的七聚体（heptameride）。"},{"en":"Researchers confirmed that the enzyme forms a heptameride in solution.","zh":"研究人员证实该酶在溶液中会形成七聚体。"}]}],"synonyms":["heptamer","septamer","seven-mer","heptameric complex"],"phonetic":"/hɛpˈtæməˌraɪd/","extraExplanation":["“hepta-”来自希腊语，表示“七”。“heptameride”在现代学术写作中相对少见，更常见的说法是 heptamer / septamer（七聚体）或 seven-mer（七聚物）。","多用于生物化学与结构生物学语境，描述蛋白质或核酸等由七个重复单元组成的寡聚体结构。"]}
{"word":"heptameron","summary":{"en":"The Heptameron is a Renaissance-era French collection of tales by Marguerite de Navarre, told in a multi-day frame-story format.","zh":"《七日谈》是法国文艺复兴时期的故事集，由纳瓦尔的玛格丽特所作，以多日讲故事的“框架叙事”串联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a 16th‑century collection of short stories (tales), framed as stories told over several days, written by Marguerite de Navarre; often discussed as a French counterpart inspired by Boccaccio’s The Decameron","zh":"《七日谈》：16世纪法国作家纳瓦尔的玛格丽特（Marguerite de Navarre）所写的短篇故事集，以“几天里轮流讲故事”的框架串联；常被视为受薄伽丘《十日谈》启发的法国对应作品"},"examples":[{"en":"In our Renaissance literature class, we compared The Heptameron with The Decameron.","zh":"在文艺复兴文学课上，我们把《七日谈》和《十日谈》作了比较。"},{"en":"The Heptameron uses a frame story: travelers pass the time by telling tales.","zh":"《七日谈》用了“框架故事”：一群旅人用讲故事来打发时间。"}]}],"synonyms":["The Heptameron (proper title)"],"phonetic":"/hɛpˈtæmərən/","extraExplanation":["词源提示：hepta- 表示“七”，-meron 来自希腊语，意为“天”。书名直译可理解为“七天（的故事）”。","文化背景：作品常被放在法国文艺复兴与宫廷文化中阅读，故事里既有爱情与道德议题，也反映当时社会与宗教氛围。","读法提示：作为专有书名，常写作 The Heptameron（首字母大写并加冠词）。"]}
{"word":"heptamerous","summary":{"en":"Heptamerous means “having seven parts,” especially in scientific descriptions of plant or animal structures.","zh":"heptamerous 意为“由七个部分组成的”，多用于植物或动物结构的科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven parts or divisions; arranged in sevens (often used in botany to describe flowers with 7 petals, sepals, etc.).","zh":"七部的；由七个部分组成的；七数排列的（常用于植物学，描述花的花瓣、萼片等为7个）。"},"examples":[{"en":"The botanist described the plant’s heptamerous flower, noting seven petals in each bloom.","zh":"植物学家描述这种植物的花为七数花，指出每朵花有七片花瓣。"},{"en":"Heptamerous structures are less common than five-part flowers in many plant families.","zh":"在许多植物科中，七部结构比五部花更少见。"}]}],"synonyms":["seven-part","seven-lobed","septenary (less common)"],"phonetic":"/hɛpˈtæmərəs/","extraExplanation":["词源提示：hepta- 表示“七”（源自希腊语），-merous 表示“部分/分段的”。所以 heptamerous 直译就是“七部分的”。","使用语境：这是较偏学术的形容词，最常见于植物学、动物形态学等描述结构的文本；日常英语中很少用。","相关词联想：pentamerous（五部的）、hexamerous（六部的）、octamerous（八部的）；也可对比 heptagon（七边形）。"]}
{"word":"heptameter","summary":{"en":"Heptameter is a poetic line made of seven metrical feet.","zh":"Heptameter 指由七个音步组成的一行诗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A line of poetry with seven metrical feet (seven repeating rhythm units).","zh":"（诗歌）七音步诗行；由七个“音步”（重复的节奏单位）组成的一行诗。"},"examples":[{"en":"In heptameter, each line carries seven beats or feet, creating a long, flowing rhythm.","zh":"七音步诗行每行包含七个节奏单位（音步），读起来会更长、更流畅。"},{"en":"Some poets choose heptameter to make a passage feel more expansive or narrative.","zh":"有些诗人会用七音步来营造更铺陈、更叙事的感觉。"}]}],"synonyms":["seven-foot line","septenary meter","fourteener (often used for iambic heptameter)"],"phonetic":"/hɛpˈtæmɪtɚ/","extraExplanation":["“hepta-”来自希腊语，表示“七”；“-meter”与“measure（度量/韵律）”同源，所以 heptameter 字面意思就是“七（音步）的韵律”。","英语诗歌里常见的是 iambic pentameter（抑扬五音步）。heptameter 相对更长，读起来更像讲故事或抒情的长句。","有时你会看到“iambic heptameter（抑扬七音步）”，指的是每个音步多为抑扬格（da-DUM）并重复七次。"]}
{"word":"heptameters","summary":{"en":"Heptameters are poetic lines with seven metrical feet.","zh":"heptameters 指“七音步”的诗行（七个音步）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lines of poetry written in heptameter (a metrical line with seven metrical feet).","zh":"（诗歌中）七音步诗行；采用七个“音步”的诗行（heptameter 的复数）。"},"examples":[{"en":"The poet experimented with heptameters to create a long, flowing rhythm.","zh":"这位诗人尝试用七音步诗行来营造绵长、流动的节奏。"},{"en":"In this poem, the heptameters feel slower and more dramatic than shorter lines.","zh":"在这首诗里，七音步诗行比短句更显得缓慢而富有戏剧性。"}]}],"synonyms":["seven-foot lines","heptameter lines"],"phonetic":"/hɛpˈtæmɪtɚz/","extraExplanation":["“hepta-”来自希腊语，表示“七”。“meter/metre”在诗歌里指“格律/韵律结构”，不是“米”的单位。","英语诗歌里更常见的是五音步（iambic pentameter，常见于莎士比亚）。七音步相对少见，往往给人更铺陈、更叙述性或更宏大的节奏感。","“七音步”指一行里有七个音步（feet）。音步可以是抑扬格（iamb）、扬抑格（trochee）等；所以“heptameter”强调的是“数量（七个）”，不限定具体是哪一种音步。"]}
{"word":"heptamethylene","summary":{"en":"Heptamethylene refers to a seven-CH2 (seven-carbon) methylene chain used to describe structures in organic chemistry.","zh":"Heptamethylene 指由七个 –CH2– 组成的七亚甲基链（七碳链段），常用于有机化学结构描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical group made of seven methylene units (–CH2–)7, often used to describe a seven-carbon chain or bridge in organic chemistry","zh":"（化学）由七个亚甲基单元组成的基团（–CH2–）7，常用来描述有七个碳的链或在分子中形成“桥”的结构"},"examples":[{"en":"The molecule contains a heptamethylene bridge linking two rings.","zh":"该分子含有一段七亚甲基“桥”，连接两个环。"},{"en":"Heptamethylene units can increase the flexibility of a polymer chain.","zh":"七亚甲基单元会增加聚合物链的柔韧性。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or containing a chain of seven methylene (–CH2–) groups","zh":"（形容词）与七个亚甲基（–CH2–）组成的链有关的；含有七亚甲基链的"},"examples":[{"en":"Researchers studied a heptamethylene spacer to control the distance between two functional groups.","zh":"研究人员使用七亚甲基“间隔基”来控制两个官能团之间的距离。"}]}],"synonyms":["(CH2)7","seven-methylene chain","heptamethylene group"],"phonetic":"/ˌhɛptəˈmɛθəˌliːn/","extraExplanation":["“methylene（亚甲基）”指 –CH2–。因此 heptamethylene 字面意思就是 “七个 –CH2–”。在有机化学文献中，它常出现在 bridge（桥连基）、spacer（间隔基）、chain（链段）等结构描述里。","词素拆解：hepta-（七）+ methylene（亚甲基）。了解这些前缀（如 hexa-, hepta-, octa-）有助于快速看懂化学命名。"]}
{"word":"heptametrical","summary":{"en":"Heptametrical describes poetry that uses lines of seven metrical feet (heptameter).","zh":"Heptametrical 指与七音步诗行（heptameter）有关，或用七音步写成的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to (or written in) **heptameter**—a poetic line that has **seven metrical feet**.","zh":"与**七音步诗行（heptameter）**有关的；用**七音步**写成的。"},"examples":[{"en":"The poem’s opening is written in a heptametrical rhythm, giving it a long, flowing line.","zh":"这首诗的开头采用七音步的节奏，使诗行显得更长、更流畅。"},{"en":"Some ballads use heptametrical lines to create a steady, storytelling pace.","zh":"有些民谣/叙事诗会用七音步诗行，营造稳定的讲述节奏。"}]}],"synonyms":["heptameter","septenary (literary)","seven-foot (poetic, informal)"],"phonetic":"/ˌhɛp.tə.məˈtrɪ.kəl/","extraExplanation":["“hepta-”来自希腊语，表示“七”。“metrical”与诗歌的“格律/节奏（meter）”有关。英语诗歌里更常见的格律是五音步（iambic pentameter），七音步相对少见，但在某些叙事诗、民谣式诗歌中会出现，读起来通常更绵长。"]}
{"word":"heptanaphthene","summary":{"en":"Heptanaphthene is an older term for a seven‑carbon naphthene, typically cycloheptane.","zh":"Heptanaphthene 是较旧的术语，指七碳的萘烷烃（环烷烃），通常就是环庚烷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naphthene (cycloalkane) with seven carbon atoms; usually refers to cycloheptane (C7H14)","zh":"一种含七个碳原子的环烷烃（萘烷烃/环烷族烃）；通常指环庚烷（C7H14）"},"examples":[{"en":"In older petroleum texts, heptanaphthene is listed among the naphthenes found in crude oil.","zh":"在较早的石油教材中，heptanaphthene 常被列为原油中可见的环烷烃之一。"},{"en":"Cycloheptane is sometimes called heptanaphthene in historical nomenclature.","zh":"在历史命名中，环庚烷有时也被称作 heptanaphthene。"}]}],"synonyms":["cycloheptane","C7 naphthene","naphthene (general term)"],"phonetic":"/ˌhɛptəˈnæfθiːn/","extraExplanation":["这是较偏“旧式/行业史”用语：naphthene（萘烷烃）是石油化学里对“环烷烃（cycloalkanes）”的传统称呼之一。现代更常用系统命名（如 cycloheptane）或直接说 cycloalkane。","词形可拆解理解：hepta- 表示“七”，naphthene 指“环烷烃/萘烷烃”。因此 heptanaphthene 字面意思就是“七碳的环烷烃”。"]}
{"word":"heptanchus","summary":{"en":"Heptanchus is an older scientific genus name associated with sevengill sharks.","zh":"Heptanchus 是与七鳃鲨相关的较旧科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name (used in some older scientific sources) for sevengill sharks—primitive sharks with seven gill slits, in the cow shark family.","zh":"（部分较旧的科学文献中使用的）七鳃鲨属名之一；指具有七条鳃裂、较原始的“牛鲨科”鲨鱼。"},"examples":[{"en":"In older texts, the sevengill shark may be listed under the genus Heptanchus.","zh":"在一些较旧的文献中，七鳃鲨可能被列在 Heptanchus 这个属名下。"},{"en":"Heptanchus refers to sharks known for having seven gill slits instead of the usual five.","zh":"Heptanchus 指的是以“七条鳃裂”而闻名的鲨鱼，而不是常见的五条。"}]}],"synonyms":["sevengill shark","cow shark (family)"],"phonetic":"/hɛpˈtæŋkəs/","extraExplanation":["这是一个偏专业、且带有历史色彩的分类学名称：现代更常见的相关属名包括 Hexanchus（六鳃鲨属）以及与七鳃鲨相关的其他属名。不同资料使用的属名可能因分类更新而变化，查阅时可对照最新的鱼类学/分类数据库。","词根提示：hept(a)- 来自希腊语，常表示“七”（如 heptagon 七边形）。该词用于强调“七鳃裂”的特征。"]}
{"word":"heptandria","summary":{"en":"Heptandria is a historical Linnaean botanical term for plants with seven stamens.","zh":"Heptandria 是林奈旧式植物分类中的术语，指具有七枚雄蕊的植物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Linnaeus’s old plant classification system) the class of plants that have seven stamens.","zh":"（林奈旧式植物分类法中）具七枚雄蕊的植物类群（“七雄蕊类”）。"},"examples":[{"en":"In older botany books, some flowers were placed in Heptandria because they have seven stamens.","zh":"在较早的植物学书籍中，一些花因为有七枚雄蕊而被归入 Heptandria（七雄蕊类）。"},{"en":"The term Heptandria is mainly seen in historical discussions of Linnaean classification.","zh":"Heptandria 这个词主要出现在关于林奈分类法的历史讨论中。"}]}],"synonyms":["seven-stamened class","Linnaean class Heptandria"],"phonetic":"/ˌhɛpˈtændriə/","extraExplanation":["这是林奈（Linnaeus）在 18 世纪提出的“性系统”（sexual system）中的一个“纲”（class），按雄蕊（stamens）的数量来分组：hept- 表示“七”，-andria 与“雄性/雄蕊”相关。现代植物分类主要依据系统发育关系（亲缘关系、基因与形态综合证据），因此 Heptandria 现在多用于历史或文献解读。"]}
{"word":"heptandrous","summary":{"en":"A botanical adjective meaning “having seven stamens.”","zh":"一个植物学形容词，表示“有七枚雄蕊的（七雄蕊的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having seven stamens (male pollen-producing parts) in a flower.","zh":"（植物学）七雄蕊的；（花）有七枚雄蕊的。"},"examples":[{"en":"The botanist described the species as heptandrous, noting seven stamens in each bloom.","zh":"植物学家把这种植物描述为七雄蕊的，并指出每朵花都有七枚雄蕊。"},{"en":"In some plant families, a heptandrous flower can help with identification.","zh":"在一些植物科里，七雄蕊的花有助于鉴定物种。"}]}],"synonyms":["seven-stamened","seven-stamened (botanical)","heptandria (related classification term)"],"phonetic":"/hɛpˈtændrəs/","extraExplanation":["词源提示：hept- 表示“七”（同 heptagon 七边形），-androus 来自希腊语词根 andr-，与“男性/雄性”相关，在植物学里常指“雄蕊”。因此 heptandrous 字面上就是“七个雄性结构（雄蕊）的”。","使用场景：这是偏专业的植物学描述词，常出现在植物分类、花部结构记录或植物志（flora）中，日常英语里很少用。"]}
{"word":"heptane","summary":{"en":"Heptane is a flammable liquid hydrocarbon (C7H16), used in fuels and as a solvent, and it’s a key reference in octane ratings.","zh":"庚烷是一种易燃液态烃（C7H16），用于燃料与溶剂，并是辛烷值标定的重要参考物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colorless, flammable liquid hydrocarbon (C7H16) found in gasoline and petroleum; often used as a solvent and as a reference fuel in octane ratings.","zh":"庚烷：一种无色、易燃的液态烃（C7H16），存在于汽油和石油中；常用作溶剂，也用作辛烷值（抗爆性）测定的参考燃料。"},"examples":[{"en":"Heptane is a component of gasoline and evaporates quickly.","zh":"庚烷是汽油的组成成分之一，而且挥发很快。"},{"en":"In the octane rating system, heptane represents the low end of knock resistance.","zh":"在辛烷值体系中，庚烷代表抗爆性较低的一端。"},{"en":"The lab used heptane as a solvent to clean the sample.","zh":"实验室用庚烷作溶剂来清洗样品。"}]}],"synonyms":["C7H16","n-heptane"],"phonetic":"/ˈhɛp.teɪn/","extraExplanation":["“hept-”来自希腊语，表示“七”；“-ane”是烷烃（饱和烃）命名后缀。庚烷就是含7个碳原子的直链烷烃之一。","与“octane（辛烷）”相关：辛烷值的标定常用异辛烷（定义为100）与正庚烷（定义为0）作对照，因此你会在燃油、发动机“爆震/抗爆”话题里经常看到heptane。"]}
{"word":"heptanes","summary":{"en":"Heptanes are C7H16 hydrocarbons (the plural of heptane), often used as nonpolar solvents.","zh":"Heptanes 是 heptane（庚烷）的复数，指化学式 C7H16 的烃类，常用作非极性溶剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of heptane; members of a group of colorless, flammable liquid hydrocarbons with the chemical formula C7H16 (including several structural isomers).","zh":"heptane（庚烷）的复数；指一类化学式为 C7H16 的无色、易燃液态烃（包含多种结构异构体）。"},"examples":[{"en":"In the lab, we used heptanes as nonpolar solvents for chromatography.","zh":"在实验室里，我们用庚烷作为色谱实验的非极性溶剂。"},{"en":"Heptanes evaporate quickly and should be handled away from heat or flames.","zh":"庚烷挥发很快，操作时应远离热源或明火。"}]}],"synonyms":["heptane","C7H16","alkane"],"phonetic":"/ˈhɛpˌteɪn/","extraExplanation":["“heptanes”常见于化学与材料/制药实验语境，尤其指“庚烷的混合物”或“庚烷异构体的混合溶剂”（例如市售的 heptanes 可能不是单一的 n-heptane）。","庚烷属于烷烃（alkanes）家族，常用于作为非极性溶剂、萃取剂或在燃料与标准物质（如辛烷值相关讨论）中出现。"]}
{"word":"heptanesian","summary":{"en":"Heptanesian means “from or related to the Heptanesia (the Seven/ Ionian Islands of Greece),” and can also refer to a person from there.","zh":"Heptanesian 指“来自或与希腊七岛（爱奥尼亚群岛）有关的”，也可指“七岛地区的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Heptanesia (the “Seven Islands”), especially the Ionian Islands of Greece, or to their people, culture, or dialects.","zh":"与“七岛”（Heptanesia）有关的；尤指希腊爱奥尼亚群岛及其人民、文化或方言的。"},"examples":[{"en":"Heptanesian music blends Venetian influences with Greek folk traditions.","zh":"七岛地区（Heptanesian）的音乐融合了威尼斯影响与希腊民间传统。"},{"en":"She is researching Heptanesian poetry from the 19th century.","zh":"她在研究19世纪的七岛地区诗歌。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Heptanesia (the Ionian Islands), or someone identified with its culture.","zh":"七岛地区（爱奥尼亚群岛）的人；七岛文化圈的人。"},"examples":[{"en":"Many Heptanesians lived under Venetian rule for centuries.","zh":"许多七岛地区居民在威尼斯统治下生活了数百年。"},{"en":"He spoke with a Heptanesian accent that sounded different from mainland Greek.","zh":"他说话带着七岛口音，听起来与希腊本土不同。"}]}],"synonyms":["Ionian (context-dependent)","Eptanesian"],"phonetic":"/ˌhɛp.təˈniː.ʒən/","extraExplanation":["“Heptanesia”源自希腊语：hepta-（七）+ nēsos（岛）。英语里也会看到拼写变体“Eptanesian”（来自现代希腊语Επτάνησα/Eptánisa）。","历史与文化上，“七岛”通常指科孚岛（Corfu）、凯法利尼亚（Kefalonia）、扎金索斯（Zakynthos）、莱夫卡达（Lefkada）、伊萨卡（Ithaca）、基西拉（Kythira，常被是否算入“七岛”所讨论）、帕克索斯（Paxos）等爱奥尼亚海岛屿；因长期受威尼斯影响，语言与音乐传统常与希腊本土略有不同。"]}
{"word":"heptangular","summary":{"en":"Heptangular means having seven angles (typically a seven-sided shape).","zh":"heptangular 表示“七角的（通常也指七边的形状）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven angles (and usually seven sides); related to a heptagon.","zh":"七角的；（通常也指）七边形的；与七边形有关的。"},"examples":[{"en":"The designer chose a heptangular window to make the building stand out.","zh":"设计师选择了一个七角形的窗户，让建筑更醒目。"},{"en":"A regular heptangular shape is difficult to draw accurately by hand.","zh":"规则的七角形用手很难画得很精确。"}]}],"synonyms":["heptagonal","seven-angled"],"phonetic":"/hɛptˈæŋɡjələr/","extraExplanation":["词源上，hept- 来自希腊语，表示“七”（如 heptagon 七边形；September 原意与“七”相关，但后来历法变化导致月份序号不一致）。","在数学里更常用的词是 heptagonal（七边形的）。heptangular 也正确，但更偏描述“角”的感觉。"]}
{"word":"heptanoic","summary":{"en":"Heptanoic means “related to heptanoic acid,” a seven‑carbon organic acid.","zh":"heptanoic 表示“与庚酸有关的”，即与一种七碳的有机酸相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to heptanoic acid, a chemical compound with a seven‑carbon chain (often discussed in organic chemistry and food/flavor science).","zh":"与庚酸（七个碳的羧酸）有关的；庚酸的（常见于有机化学与香精香料等领域）。"},"examples":[{"en":"Heptanoic acid is sometimes described as having a strong, oily odor.","zh":"庚酸有时被形容为气味强烈、带油腻感。"},{"en":"The lab report mentions a heptanoic compound used as a reference standard.","zh":"实验报告提到一种庚酸类化合物被用作对照标准。"}]}],"synonyms":["enanthic (in the sense of “heptanoic acid”)"],"phonetic":"/hɛpˈtæn.oʊ.ɪk/","extraExplanation":["“hept-”表示“七”（源自希腊语），“-anoic”常用于命名“饱和羧酸”相关的形容词（如 ethanoic 乙酸的、propanoic 丙酸的）。因此 heptanoic 通常出现在 heptanoic acid（庚酸）或 heptanoate（庚酸盐/酯）等词组中。","庚酸（heptanoic acid）也常被称为 enanthic acid（烯丙/葡萄酒香相关的旧称），在香料、酯类风味描述和有机合成语境中可能会见到。"]}
{"word":"heptanone","summary":{"en":"Heptanone is a seven-carbon ketone (often referring to isomers like 2-heptanone).","zh":"Heptanone 指含七个碳的酮（常泛指如 2-庚酮等同分异构体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ketone (an organic compound with a C=O group) that has seven carbon atoms; the term often refers to any of the isomers of C7H14O (for example, 2-heptanone).","zh":"庚酮：一种含有羰基（C=O）的酮类有机化合物，分子含七个碳原子；该词常泛指化学式为 C7H14O 的不同同分异构体（如 2-庚酮）。"},"examples":[{"en":"2-Heptanone is a heptanone commonly used as a solvent in industry.","zh":"2-庚酮是一种常见的庚酮，在工业上常用作溶剂。"},{"en":"The lab report listed heptanone as one component of the mixture.","zh":"实验报告把庚酮列为混合物中的一种成分。"}]}],"synonyms":["2-heptanone","methyl hexyl ketone"],"phonetic":"/ˈhɛp.təˌnoʊn/","extraExplanation":["“heptanone”在化学语境里通常不是指单一物质，而是“庚酮类”的统称；最常见、最常被单独提到的是 2-heptanone（又称 methyl hexyl ketone，甲基己基酮）。","庚酮类常见于溶剂、香料/风味化学与有机合成等领域；在实际阅读中，最好配合编号（如 2-heptanone、3-heptanone）来确定具体结构。","作为挥发性有机化合物（VOC）的一类，使用时通常需要注意通风与安全数据表（SDS）中的健康与易燃信息。"]}
{"word":"heptapetalous","summary":{"en":"Heptapetalous describes a flower that has seven petals.","zh":"heptapetalous 用来形容花有七片花瓣。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven petals.","zh":"（花）七瓣的；有七片花瓣的。"},"examples":[{"en":"The botanist noted a heptapetalous flower in the specimen tray.","zh":"植物学家在标本盘里记录到一朵七瓣花。"},{"en":"Some field guides describe the plant as heptapetalous when it has seven distinct petals.","zh":"一些野外图鉴会在这种植物长出七片明显花瓣时把它描述为七瓣的。"}]}],"synonyms":["seven-petaled","seven-petalled (BrE)"],"phonetic":"/ˌhɛp.təˈpɛt.əl.əs/","extraExplanation":["这是一个较少见的植物学形容词：hepta- 表示“七”，-petalous 来自 petal（花瓣）。常见于学术写作或植物鉴定描述中，而日常英语里更常说 “a flower with seven petals”（有七片花瓣的花）。"]}
{"word":"heptaphyllous","summary":{"en":"Heptaphyllous means “seven-leaved,” describing a leaf (or leaf structure) made up of seven leaves/leaflets.","zh":"heptaphyllous 意为“七叶的”，常用于植物学中描述由七片叶或七个小叶组成的叶结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven leaves or seven leaflets (often describing a plant leaf made of seven parts).","zh":"（植物学）七叶的；由七片叶或七个小叶组成的。"},"examples":[{"en":"The plant has a heptaphyllous leaf with seven distinct leaflets.","zh":"这种植物的叶子是七叶的，由七个清晰的小叶组成。"},{"en":"Some species show heptaphyllous patterns only in certain seasons.","zh":"有些物种只在某些季节呈现七叶的形态。"}]}],"synonyms":["seven-leaved","seven-foliolate","having seven leaflets"],"phonetic":"/ˌhɛp.təˈfɪl.əs/","extraExplanation":["这是一个偏学术的植物学形容词：hepta- 表示“七”，-phyllous 来自希腊语 phyllon（叶）。在日常英语里不常用，更常见的说法是 “seven-leaved” 或 “with seven leaflets”。","在植物形态学描述中，这类词常用于标本记录、学术论文或植物志（field guide/flora）里，用来精确说明叶片的组成与数量。"]}
{"word":"heptaploid","summary":{"en":"Heptaploid describes an organism or cell with seven sets of chromosomes (7n).","zh":"heptaploid 指（细胞或生物）含有七套染色体的“七倍体”（7n）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven complete sets of chromosomes in each cell (7n).","zh":"（生物）七倍体的；每个细胞含有七套完整染色体（7n）。"},"examples":[{"en":"Some plant species can be heptaploid, which may affect their size and fertility.","zh":"一些植物物种可能是七倍体，这会影响它们的体型和生育能力。"},{"en":"The researchers confirmed the sample was heptaploid by counting its chromosome sets.","zh":"研究人员通过计算染色体组数确认该样本为七倍体。"}]}],"synonyms":["seven-ploid","7n polyploid"],"phonetic":"/ˌhɛp.təˈplɔɪd/","extraExplanation":["“hepta-”来自希腊语，表示“七”（如 heptagon 七边形）；“-ploid”与“染色体组数”有关（如 diploid 二倍体、triploid 三倍体）。","七倍体多见于植物的多倍体现象（polyploidy）。多倍体在植物育种中很重要，可能带来更大的果实或更强的适应性，但也可能导致不育或繁殖方式改变。"]}
{"word":"heptaploidy","summary":{"en":"Heptaploidy means having seven complete sets of chromosomes (7n) in each cell.","zh":"Heptaploidy 指细胞中有七套完整染色体（7n）的七倍体状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of having seven complete sets of chromosomes in each cell (7n), especially in plants","zh":"（尤指植物）细胞中具有七套完整染色体的状态（7n），即七倍体"},"examples":[{"en":"Heptaploidy is a type of polyploidy in which an organism has seven chromosome sets.","zh":"七倍体（heptaploidy）是一种多倍体现象，指生物体拥有七套染色体。"},{"en":"Some plant breeders study heptaploidy because extra chromosome sets can change traits like size or hardiness.","zh":"一些植物育种者研究七倍体，因为额外的染色体组可能会改变大小或抗逆性等性状。"}]}],"synonyms":["sevenfold polyploidy","7n polyploidy"],"phonetic":"/ˌhɛp.təˈplɔɪ.di/","extraExplanation":["词源提示：hepta- 表示“七”，-ploidy 表示“倍性/染色体组数”。因此 heptaploidy 直译就是“七倍性”。","在遗传学里，n 通常表示“单倍体”的一套染色体；7n 表示同一套染色体被复制成七份。多倍体在植物中更常见，在动物中相对少见且通常不稳定。","相关词：diploidy（2n，二倍体）、triploidy（3n，三倍体）、polyploidy（多倍体）等。"]}
{"word":"heptapodic","summary":{"en":"Heptapodic means “having seven feet,” especially “a poetic line with seven metrical feet.”","zh":"heptapodic 指“七足的”，尤指诗歌中“一行含七个音步（七音步）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Prosody/poetry) Having seven metrical feet; written in a line of verse with seven beats/feet.","zh":"（诗体/韵律）七音步的；由七个音步构成的诗行。"},"examples":[{"en":"The poem opens with a heptapodic line to create a long, flowing rhythm.","zh":"这首诗以一行七音步开篇，营造出绵长流动的节奏。"},{"en":"In her analysis, she labels the first two lines heptapodic and the third line shorter for contrast.","zh":"在分析中，她把前两行标注为七音步，第三行更短以形成对比。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having seven feet or foot-like parts (rare; usually used in technical or playful descriptions).","zh":"具有七只“脚”或类似足部的结构的（较少见；多用于技术性或带玩笑意味的描述）。"},"examples":[{"en":"The author jokingly described the alien as heptapodic, with seven limbs touching the ground.","zh":"作者开玩笑地把外星生物写成“七足的”，有七条肢体着地。"}]}],"synonyms":["seven-footed","heptapodous","septenary (rare/loose)"],"phonetic":"/ˌhɛp.təˈpɑː.dɪk/","extraExplanation":["词源上可拆为 hepta-（七）+ -pod-（脚/足）+ -ic（形容词后缀），源自希腊语构词。","在英语诗歌术语里，foot（音步）指的是重读与非重读的组合单位；heptapodic 用来强调“每行有七个音步”，属于相对少见但清晰的专业描述。"]}
{"word":"heptapody","summary":{"en":"Heptapody most commonly refers to the seven-limbed alien species (the heptapods) in *Arrival*, and more generally to something seven-footed/seven-limbed.","zh":"Heptapody 最常指《降临》中“七肢外星人”这一族群；更广义上也可指“七足/七肢”的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seven-limbed (or seven-“footed”) creature; especially the fictional alien species with seven limbs in Ted Chiang’s story and the film *Arrival*.","zh":"七肢（或七“足”）生物；尤指特德·姜小说及电影《降临》中拥有七肢的虚构外星种族。"},"examples":[{"en":"In *Arrival*, the heptapods communicate using circular written symbols.","zh":"在《降临》中，七肢外星人用圆形文字符号进行交流。"},{"en":"The linguist tries to understand the heptapody’s language and way of thinking.","zh":"这位语言学家试图理解七肢外星人的语言与思维方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) relating to or characteristic of something with seven feet or foot-like limbs.","zh":"（罕见）与“七足/七肢”有关的；具有七个足或足状肢体特征的。"},"examples":[{"en":"The term is mostly seen in science fiction rather than everyday biology.","zh":"这个词更多出现在科幻作品中，而非日常生物学语境。"}]}],"synonyms":["heptapod (common form)","seven-limbed creature","seven-footed organism"],"phonetic":"/ˈhɛp.təˌpɑː.di/","extraExplanation":["词源：hepta- 表示“七”，-pody 来自希腊语 pod-（“足/脚”）。在科幻语境中，它常作为对“heptapod（七足生物）”的变体或延伸用法。","文化语境：该词因特德·姜（Ted Chiang）短篇《你一生的故事》（*Story of Your Life*）及其改编电影《降临》（*Arrival*）而广为人知，常用来指代片中/文中的外星族群与其语言体系。"]}
{"word":"heptarch","summary":{"en":"A heptarch is a historical term for one of the seven Anglo-Saxon kings/rulers in early England.","zh":"heptarch 指英国早期“七国时代”中的七位盎格鲁-撒克逊君主之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) One of the seven rulers (kings) of the Anglo-Saxon kingdoms in early medieval England; a ruler in a “heptarchy.”","zh":"（历史）七国时代（Heptarchy）中的一位统治者（国王）；七国之一的君主。"},"examples":[{"en":"Some chronicles mention a heptarch forming alliances with neighboring kingdoms.","zh":"一些编年史提到某位七国君主与邻近王国结盟。"},{"en":"In class we read about a heptarch who later submitted to a stronger king.","zh":"课堂上我们读到一位七国君主后来臣服于更强大的国王。"}]}],"synonyms":["king","ruler","monarch","sovereign"],"phonetic":"ˈhɛp.tɑrk","extraExplanation":["“Heptarch”来自希腊语词根：hepta-（七）+ -arch（统治者）。它最常见于英国早期中世纪史语境，尤其与“Anglo-Saxon Heptarchy（英格兰七国时代）”相关。","“Heptarchy”并不表示七国永远固定或同时都存在，而是一种后人概括早期英格兰多个王国并立的说法（常见包括 Wessex, Mercia, Northumbria, East Anglia, Kent, Essex, Sussex）。"]}
{"word":"heptarchal","summary":{"en":"Heptarchal means “connected with a heptarchy,” especially the seven Anglo-Saxon kingdoms in early England.","zh":"heptarchal 指“与七国制有关的”，尤指英格兰早期盎格鲁-撒克逊七王国时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a heptarchy—especially the seven Anglo-Saxon kingdoms in early medieval England.","zh":"与“七国时代/七王国制”有关的；尤指英格兰早期中世纪的盎格鲁-撒克逊七国。"},"examples":[{"en":"Some historians study heptarchal England to understand how the early kingdoms later formed a single nation.","zh":"一些历史学家研究“七国时代”的英格兰，以了解早期诸王国如何后来形成一个统一的国家。"},{"en":"The museum has a small exhibit of heptarchal coins and metalwork.","zh":"博物馆有一个小展区，展示七国时代的硬币和金属工艺品。"}]}],"synonyms":["heptarchy-related","of the Heptarchy","Anglo-Saxon (in this historical sense)"],"phonetic":"/ˌhɛpˈtɑr.kəl/","extraExplanation":["“heptarchal”来自 heptarchy（七国制），词根 hept- 表示“七”（如 heptagon 七边形），-archy 表示“统治/政体”（如 monarchy 君主制）。","英语里最常见的文化语境是 “the Heptarchy”，指大约公元5–9世纪英格兰境内的七个主要盎格鲁-撒克逊王国（常见列法：Northumbria, Mercia, East Anglia, Essex, Kent, Sussex, Wessex）。","这个词较学术、较少在日常口语中使用；写作中更常见的表达是 “the Anglo-Saxon Heptarchy” 或直接说 “the seven Anglo-Saxon kingdoms”。"]}
{"word":"heptarchic","summary":{"en":"Heptarchic means “connected with a heptarchy,” especially the seven-kingdom period of early England.","zh":"heptarchic 指“与七国并立/七国时代有关的”，尤指早期英格兰七个王国并存的历史时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a heptarchy—especially the historical period in early medieval England when seven Anglo-Saxon kingdoms existed.","zh":"与“七国并立”（尤其指英格兰早期中世纪七个盎格鲁-撒克逊王国并存的历史时期）有关的。"},"examples":[{"en":"The book focuses on heptarchic England before political unification.","zh":"这本书聚焦于英格兰统一之前的七国并立时期。"},{"en":"She studies heptarchic law codes to understand early English government.","zh":"她研究七国并立时期的法典，以理解早期英格兰的治理方式。"}]}],"synonyms":["heptarchical","of the Heptarchy","seven-kingdom (contextual)"],"phonetic":"/hɛpˈtɑrkɪk/","extraExplanation":["“heptarchic”来自“heptarchy”（七人/七国统治）：hepta- 表示“七”，-archy 表示“统治/政体”。在英语史与欧洲中世纪研究中，它常用来指英格兰所谓的 “Heptarchy”（七国时代），通常包括 Wessex、Mercia、Northumbria、East Anglia、Kent、Essex、Sussex。现代史学有时会提醒：这七国的边界与强弱并非一直固定，因此该称呼更多是一种概括性的传统说法。"]}
{"word":"heptarchical","summary":{"en":"Heptarchical means “connected with a heptarchy,” especially the seven-kingdom period of early Anglo-Saxon England.","zh":"heptarchical 指“与七国统治/七王国格局有关的”，尤指英格兰早期盎格鲁-撒克逊传统所说的七国时代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a heptarchy (a system or period in which seven kingdoms or rulers exist), especially the traditional “Heptarchy” of early Anglo-Saxon England.","zh":"与“七国统治/七王国体系”（由七个王国或统治者构成的格局或时期）有关的；尤指英格兰早期盎格鲁-撒克逊时代传统所说的“七国时代”。"},"examples":[{"en":"Some historians question how unified the so-called heptarchical period really was.","zh":"一些历史学家质疑所谓的“七国时代”究竟有多统一。"},{"en":"The museum exhibit explains heptarchical England before the rise of Wessex.","zh":"博物馆展览讲解了威塞克斯崛起之前的“七国时代”英格兰。"}]}],"synonyms":["heptarchic","seven-kingdom","of the Heptarchy"],"phonetic":"/hɛpˈtɑrkɪkəl/","extraExplanation":["“heptarchical”来自 hepta-（希腊语，意为“七”）+ -archy（统治、政体）。在英语史学语境中常与 the Heptarchy 搭配，指传统叙述中的七个盎格鲁-撒克逊王国（如 Wessex、Mercia、Northumbria 等）并存的时期。","这是较少见、偏学术/历史写作用词；更常见的近义词是 heptarchic，或直接说 “the Anglo-Saxon Heptarchy”。"]}
{"word":"heptarchies","summary":{"en":"Heptarchies means “groups of seven kingdoms or rulers,” especially the seven Anglo-Saxon kingdoms of early England.","zh":"heptarchies 指“由七个王国/统治者组成的集团”，尤指英格兰早期的七个盎格鲁-撒克逊王国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The seven Anglo-Saxon kingdoms in early medieval England (often discussed as a period called “the Heptarchy”).","zh":"（历史）英格兰早期中世纪的七个盎格鲁-撒克逊王国（常被称为“七国时代/七王国时期”）。"},"examples":[{"en":"In British history class, we studied the Heptarchy and how the kingdoms later united under one ruler.","zh":"在英国历史课上，我们学习了“七国时代”，以及这些王国后来如何统一在一位君主之下。"},{"en":"The map shows the heptarchies of early England, including Wessex and Mercia.","zh":"这张地图展示了英格兰早期的七个王国，包括威塞克斯和麦西亚。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, groups or systems made up of seven states, regions, or rulers.","zh":"（引申）由七个国家、地区或统治者组成的集团或体系。"},"examples":[{"en":"Some writers use “heptarchies” loosely to describe any alliance of seven powers.","zh":"一些作者会宽泛地用“heptarchies”来指任何由七个力量组成的联盟。"},{"en":"The novel imagines rival heptarchies competing for control of the continent.","zh":"这部小说想象了多个“七国集团”为争夺大陆控制权而竞争。"}]}],"synonyms":["seven kingdoms","the Heptarchy","seven-kingdom period"],"phonetic":"/ˈhɛpˌtɑrkiz/","extraExplanation":["“Heptarchy”来自希腊语词根：hepta-（七）+ -archy（统治/政体）。严格说它指英格兰约公元6—9世纪的七个主要盎格鲁-撒克逊王国，常见列法包括：诺森布里亚（Northumbria）、麦西亚（Mercia）、东盎格利亚（East Anglia）、埃塞克斯（Essex）、肯特（Kent）、萨塞克斯（Sussex）、威塞克斯（Wessex）。","现代史学有时提醒：当时并非始终“固定七国”，而是势力此消彼长，所以“Heptarchy”更多是一种便于理解的传统说法。"]}
{"word":"heptarchist","summary":{"en":"A heptarchist is someone who supports a system of rule divided among seven rulers or seven kingdoms.","zh":"heptarchist 指支持七人统治或七国分治（heptarchy）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or favors a government or political system ruled by seven leaders or divided into seven kingdoms (a “heptarchy”).","zh":"支持或拥护“七人统治/七国分治”（heptarchy）这种政体的人。"},"examples":[{"en":"In the debate about regional autonomy, a few heptarchists argued for dividing the country into seven self-governing regions.","zh":"在关于地方自治的辩论中，少数七国分治支持者主张把国家划分为七个自治地区。"},{"en":"The novel’s heptarchist faction wanted power shared among seven rulers instead of one king.","zh":"小说里的“七人共治”派系希望权力由七位统治者共享，而不是由一位国王独掌。"}]}],"synonyms":["supporter of a heptarchy","advocate of seven-rule (rare)"],"phonetic":"/hɛpˈtɑrkɪst/","extraExplanation":["“Heptarchist”来自 hepta-（希腊语“七”）+ -arch（“统治者/掌权者”）+ -ist（“……主义者/支持者”）。","历史语境里，heptarchy 常用来指英格兰早期盎格鲁-撒克逊时期的“七国时代”（如 Wessex、Mercia、Northumbria 等）。因此在历史写作中，heptarchist 有时会被用来指对这种“七国格局”抱有认同或偏好的人，不过现实政治里这个词非常少见。"]}
{"word":"heptarchs","summary":{"en":"Heptarchs are rulers—especially the kings—of the seven Anglo-Saxon kingdoms traditionally called the Heptarchy.","zh":"Heptarchs 指传统上被称为“七国时代”的盎格鲁-撒克逊七个王国的统治者（尤指国王）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of heptarch) one of the rulers (especially kings) of the seven Anglo-Saxon kingdoms in early medieval England, often discussed as the “Heptarchy.”","zh":"（heptarch 的复数）指早期中世纪英格兰盎格鲁-撒克逊“七国时代”（Heptarchy）七个王国之一的统治者（尤指国王）。"},"examples":[{"en":"The chronicler compared the ambitions of different heptarchs as they competed for influence.","zh":"编年史作者比较了不同 heptarchs（七国统治者）的野心，因为他们在争夺影响力。"},{"en":"In class we learned how alliances between heptarchs shaped early English history.","zh":"课堂上我们学习了 heptarchs（七国统治者）之间的联盟如何塑造了早期英国历史。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, rulers of seven regions or states (a rare, learned use).","zh":"更广义地指“七个地区/国家的统治者”（较少见、偏书面用法）。"},"examples":[{"en":"The novel imagines seven islands ruled by rival heptarchs.","zh":"这部小说设想七座岛屿分别由相互竞争的 heptarchs 统治。"}]}],"synonyms":["Anglo-Saxon kings","kings of the Heptarchy","seven-kings (context-dependent)"],"phonetic":"/ˈhɛptɑrks/","extraExplanation":["“Heptarch”来自希腊语 hepta-（七）+ -arch（统治者/首领）。","“Heptarchy（七国时代）”常用来概括5—9世纪左右英格兰境内七个主要盎格鲁-撒克逊王国（如 Wessex、Mercia、Northumbria 等）的格局；不过历史上并非始终固定“恰好七国”，这个说法更多是后人便于叙述的概括。"]}
{"word":"heptarchy","summary":{"en":"Heptarchy usually refers to the seven Anglo-Saxon kingdoms of early medieval England; more generally, it can mean a rule or system of seven.","zh":"Heptarchy 通常指英格兰早期中世纪的盎格鲁-撒克逊“七国时代”；也可泛指“七方共治/七人（七国）统治”的体制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The seven Anglo-Saxon kingdoms that existed in England roughly from the 6th to the 9th century (often listed as Wessex, Mercia, Northumbria, East Anglia, Kent, Essex, and Sussex).","zh":"（英格兰）“七国时代”：约公元6—9世纪存在的七个盎格鲁-撒克逊王国（常见说法包括：威塞克斯、麦西亚、诺森布里亚、东盎格利亚、肯特、埃塞克斯、萨塞克斯）。"},"examples":[{"en":"In many history books, the Heptarchy is used to describe early medieval England before it was unified.","zh":"在许多历史书中，“七国时代”用来描述英格兰统一之前的早期中世纪时期。"},{"en":"Alfred the Great is often discussed in relation to the end of the Heptarchy and the rise of a more unified England.","zh":"谈到“七国时代”的结束与英格兰更趋统一的形成时，常会提到阿尔弗雷德大帝。"}]},{"partOfSpeech":"n.","definition":{"en":"Any system, group, or rule involving seven leaders or seven states (a less common, more general use).","zh":"泛指由七个统治者或七个国家/地区组成的体制、集团或统治（较少见、较泛化的用法）。"},"examples":[{"en":"The novel imagines a futuristic heptarchy in which seven cities share power.","zh":"这部小说设想了一个未来的“七城共治”体系。"}]}],"synonyms":["the Seven Kingdoms (of Anglo-Saxon England)","seven-kingdom period","seven-state rule"],"phonetic":"/ˈhɛpˌtɑrki/","extraExplanation":["词源：hepta- 表示“七”（源自希腊语），-archy 表示“统治、政体”。","历史提示：“七国时代”是后人为了方便概括而常用的术语；当时各王国势力消长、边界变化频繁，并不总是稳定的“固定七国”。","文化/文学中常见场景：在介绍《盎格鲁-撒克逊编年史》（Anglo-Saxon Chronicle）、维京入侵、以及英格兰统一进程的材料中，经常会用到 Heptarchy 这个词。"]}
{"word":"heptasemic","summary":{"en":"Heptasemic means “having seven meanings or senses,” but it’s a very rare word; writers usually say “polysemous.”","zh":"heptasemic 指“有七种意义/七个义项的”，但非常罕用；更常见的说法是 polysemous（多义的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven meanings or senses; seven-sensed (a very rare term in semantics/linguistics).","zh":"（语义学/语言学中，罕用）具有七种意义或七个义项的；“七义的”。"},"examples":[{"en":"In theory, a heptasemic word would have seven distinct senses listed in a dictionary.","zh":"理论上，heptasemic 的词会在词典里列出七个不同的义项。"},{"en":"The author calls the key symbol heptasemic, suggesting it can be read in seven ways.","zh":"作者把这个关键意象称为 heptasemic，暗示它可以被解读为七种方式。"}]}],"synonyms":["polysemous","multisemous","highly polysemous"],"phonetic":"/ˌhɛptəˈsiːmɪk/","extraExplanation":["这个词非常少见，实际写作中更常用 polysemous（多义的）或 highly polysemous（高度多义的）。","词源上可拆为 hepta-（希腊语，表示“七”）+ -semic（与 meaning/semantics “意义/语义”有关）。所以它直译就是“七种意义的”。","在文学批评里，有时会用这种“限定数字的多义”来强调象征物可被多重解读，但学术文章中仍以 polysemy（多义现象）等更常见术语为主。"]}
{"word":"heptasepalous","summary":{"en":"Heptasepalous describes a flower that has seven sepals.","zh":"Heptasepalous 指花具有七片萼（七萼）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having seven sepals in a flower (i.e., the calyx is made up of seven sepals).","zh":"（植物学）七萼的；花具有七片萼（即花萼由七个萼片组成）。"},"examples":[{"en":"In this species, the flowers are heptasepalous, with a clearly visible seven-part calyx.","zh":"在这个物种中，花是七萼的，能清楚看到由七部分组成的花萼。"},{"en":"Under the microscope, the heptasepalous structure helps distinguish it from related plants with five sepals.","zh":"在显微镜下，这种七萼结构有助于把它与萼片为五片的近缘植物区分开。"}]}],"synonyms":["seven-sepaled","seven-sepalate"],"phonetic":"/ˌhɛp.təˈsɛp.ə.ləs/","extraExplanation":["这是一个较少见的形态学术语，常见于植物分类或形态描述中。","构词上可拆为：hepta-（七）+ sepal（萼片）+ -ous（具有……的）。因此它与 pentasepalous（五萼）、hexasepalous（六萼）等词同一构词模式。","“sepal（萼片）”是花的最外轮结构，通常呈绿色，用于保护花蕾；描述“几萼”是识别与鉴定植物的重要特征之一。"]}
{"word":"heptaspermous","summary":{"en":"Heptaspermous means “having seven seeds,” mainly used in botanical descriptions.","zh":"Heptaspermous 指“七籽的/有七颗种子的”，主要用于植物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having seven seeds, or containing seven seed-like bodies.","zh":"（植物学）七籽的；含有七颗种子（或七个种子状结构）的。"},"examples":[{"en":"In the lab notes, the fruit was described as heptaspermous, with seven clearly separated seeds.","zh":"在实验记录中，这种果实被描述为 heptaspermous（七籽的），有七颗清晰分开的种子。"},{"en":"Some older botanical descriptions use terms like heptaspermous to report the typical seed count.","zh":"一些较早的植物学描述会用 heptaspermous 这类词来记录典型的种子数量。"}]}],"synonyms":["seven-seeded","seven-seeded (botanical)"],"phonetic":"/ˌhɛp.təˈspɝ.məs/","extraExplanation":["这个词很少出现在日常英语里，主要用于植物学的形态描述（尤其在较旧或较正式的分类/物种描述中）。","词源结构：hepta- 表示“七”（来自希腊语），-spermous 与“种子”有关（同源于 sperm / sperma）。理解词根有助于猜测类似词：例如 monospermous（单籽的）、polyspermous（多籽的）。"]}
{"word":"heptastich","summary":{"en":"A seven-line stanza in a poem.","zh":"诗中由七行组成的一个诗节（七行一节）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stanza (group of lines in a poem) that has seven lines.","zh":"（诗歌的）七行诗节；七行一节的诗。"},"examples":[{"en":"The poem opens with a heptastich that sets a calm, reflective mood.","zh":"这首诗以一个七行诗节开篇，营造出平静、沉思的氛围。"},{"en":"In class, we compared a heptastich with a quatrain to see how line count affects rhythm.","zh":"课堂上我们把七行诗节和四行诗节作比较，看看行数如何影响节奏。"}]}],"synonyms":["seven-line stanza","septet (in poetry, less common)"],"phonetic":"/ˈhɛp.tə.stɪk/","extraExplanation":["“heptastich”来自希腊语词根：hepta-（七）+ stichos（行、诗行）。主要用于诗歌分析与文学评论中，日常英语里比较少见。","相关术语可帮助理解诗节结构：couplet（两行）、tercet（三行）、quatrain（四行）、sestet（六行）、octave（八行）。","注意区分：heptastich 指“七行的诗节/段落”，而不是某种固定押韵格式；具体韵式取决于作品本身。"]}
{"word":"heptastrophic","summary":{"en":"Heptastrophic is a very rare adjective meaning “made of seven stanzas/sections,” mainly in poetry.","zh":"heptastrophic 是一个极少见的形容词，主要用于诗歌结构，表示“由七个诗节/部分构成”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare / nonstandard) Having seven strophes (stanzas) or arranged in seven “turns/sections,” especially in poetry.","zh":"（极少见/非标准用法）指“由七个诗节（段）构成的”，或“分成七个转折/部分”的（多用于诗歌结构）。"},"examples":[{"en":"The poem is heptastrophic, with seven short stanzas that mirror the speaker’s changing mood.","zh":"这首诗是 heptastrophic 的，由七个短诗节组成，呼应了叙述者情绪的变化。"},{"en":"In practice, most writers would say “a seven-stanza poem” instead of heptastrophic.","zh":"实际写作中，大多数人会说“a seven-stanza poem（七节诗）”，而不是 heptastrophic。"}]}],"synonyms":["seven-stanza","in seven stanzas","heptastich (related: seven-line poem)"],"phonetic":"/ˌhɛptəˈstrɑfɪk/","extraExplanation":["这个词在现代英语里几乎不常见，很多读者会把它当成拼写错误或临时造词。常见的混淆对象是 catastrophic（灾难性的）。","词形上可理解为 hepta-（七）+ -strophic（与诗节/转折有关，来自 strophe）。如果你的意思是“七行诗”，更常用 heptastich；如果是“七节（七段）”，直接说 seven-stanza 更自然。"]}
{"word":"heptastylar","summary":{"en":"Heptastylar means “having seven columns,” mainly used in descriptions of classical architecture.","zh":"heptastylar 指“有七根柱子的”，主要用于古典建筑的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven columns (especially describing a portico or façade in classical architecture).","zh":"七柱式的；有七根柱子的（尤指古典建筑的门廊或立面）。"},"examples":[{"en":"The museum’s entrance is heptastylar, with seven tall columns across the front.","zh":"这座博物馆的入口是七柱式的，正面一排共有七根高柱。"},{"en":"In the sketch, she labeled the temple as heptastylar to note the seven-column portico.","zh":"在草图里，她把这座神庙标注为“七柱式”，以注明门廊有七根柱子。"}]}],"synonyms":["seven-columned","having seven columns"],"phonetic":"/ˌhɛptəˈstaɪlər/","extraExplanation":["词源提示：hepta- 来自希腊语，表示“七”；-stylar 与 stylos（柱子）相关，因此 heptastylar 字面意思就是“七柱的”。","使用场景：这是非常书面、偏建筑史/古典建筑描述的词。更常见的表达是 “a portico with seven columns / seven-columned portico”。","相关对比：常见的还有 tetrastylar（四柱式）、hexastylar（六柱式）、octastyle（八柱式；更常见写法）。"]}
{"word":"heptastyle","summary":{"en":"Heptastyle describes a building (or part of one) that has seven columns.","zh":"Heptastyle 指（建筑或其部分）具有七根柱子的“七柱式”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In architecture) having seven columns (especially on the front of a building or in a row).","zh":"（建筑）七柱式的；有七根柱子的（尤指建筑正面或一排柱子）。"},"examples":[{"en":"The temple has a heptastyle portico, with seven columns across the front.","zh":"这座神庙有一个七柱式门廊，正面横向排列着七根柱子。"},{"en":"In the drawing, the architect chose a heptastyle façade to create a balanced look.","zh":"在这张图纸中，建筑师选择了七柱式立面来营造均衡的视觉效果。"}]}],"synonyms":["seven-columned","seven-column"],"phonetic":"ˈhɛp.tə.staɪl","extraExplanation":["词源上，hepta- 来自希腊语，表示“七”；-style 来自 stylos（柱子）。在古典建筑描述中，常用这类词按“柱子数量”来命名：如 tetrastyle（四柱式）、hexastyle（六柱式）、octastyle（八柱式）。"]}
{"word":"heptastylos","summary":{"en":"Heptastylos is an architectural term meaning “seven-columned,” especially describing a classical façade or portico with seven columns.","zh":"Heptastylos 是建筑学术语，指“七柱式的”，常用于描述古典建筑正立面或柱廊由七根柱子组成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Architecture) having or consisting of seven columns, especially on the front of a building or temple.","zh":"（建筑）七柱式的；由七根柱子构成的，尤指建筑或神庙正立面的一排七根柱子。"},"examples":[{"en":"The archaeologists described the ruined façade as heptastylos, with seven column bases still visible.","zh":"考古学家把这处残破的正立面描述为 heptastylos（七柱式），仍能看到七个柱基。"},{"en":"In the plan, the entrance is marked as a heptastylos portico.","zh":"在平面图里，入口被标注为 heptastylos 的柱廊（七柱柱廊）。"}]},{"partOfSpeech":"n.","definition":{"en":"a heptastyle (a seven-column arrangement), especially the front row of seven columns on a classical building.","zh":"（建筑）七柱式结构；尤指古典建筑正立面的一排七根柱子。"},"examples":[{"en":"Only fragments of the heptastylos remain after centuries of erosion.","zh":"历经数百年风化，如今仅存 heptastylos（七柱式）的残片。"}]}],"synonyms":["heptastyle","seven-columned","seven-pillared"],"phonetic":"/hɛpˈtæstɪləs/","extraExplanation":["词源提示：hepta- 来自希腊语，意为“七”；stylos/styl- 与“柱子”有关（同源词：style, stylite 等在历史上也与“柱”有关）。因此 heptastylos 字面就是“七根柱子的”。","使用场景：这是较学术、偏古典建筑研究的用语，日常英语更常说 “seven-columned” 或 “a portico with seven columns”。"]}
{"word":"heptasulphide","summary":{"en":"Heptasulphide means a sulfide compound containing seven sulfur atoms; it’s a technical chemistry term.","zh":"heptasulphide 指“含七个硫原子的硫化物”，属于化学技术词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a sulfide) that contains seven sulfur atoms, often written as “heptasulfide” (e.g., disulfur heptasulfide, S7).","zh":"含有七个硫原子的硫化物（常写作 heptasulfide，例如 S7 这类“七硫化物”）。"},"examples":[{"en":"The lab note mentioned a heptasulphide species forming at low temperature.","zh":"实验记录提到在低温下形成了一种七硫化物。"},{"en":"In some texts, heptasulphide is spelled heptasulfide (American spelling).","zh":"在一些文本中，heptasulphide 会拼作 heptasulfide（美式拼写）。"}]}],"synonyms":["heptasulfide","seven-sulfur polysulfide"],"phonetic":"/ˌhɛp.təˈsʌl.faɪd/","extraExplanation":["“hepta-”表示“七”；“sulphide/sulfide”表示“硫化物”。英式拼写多用 sulph-, 美式拼写多用 sulf-。","在化学语境里，这个词通常出现在更具体的化合物名称中（如某金属的 heptasulphide），或用来描述含有七个硫原子的多硫化物（polysulfide）结构。"]}
{"word":"heptasyllabic","summary":{"en":"Heptasyllabic means “seven-syllabled,” especially a line of poetry with seven syllables.","zh":"heptasyllabic 指“七音节的”，尤指一行诗含七个音节。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven syllables; consisting of seven syllables (often describing a line of poetry).","zh":"七音节的；由七个音节构成的（常用于描述诗歌的诗行）。"},"examples":[{"en":"Many hymns use heptasyllabic lines to keep the rhythm steady.","zh":"许多赞美诗使用七音节诗行来保持节奏稳定。"},{"en":"The poet chose a heptasyllabic meter to create a light, quick feeling.","zh":"诗人选择七音节的格律来营造轻快的感觉。"}]}],"synonyms":["seven-syllabled","septasyllabic"],"phonetic":"/ˌhɛp.tə.saɪˈlæb.ɪk/","extraExplanation":["“hepta-”来自希腊语，表示“七”；“syllabic”与“syllable（音节）”有关。合起来就是“七音节的”。","它常用于诗歌与格律讨论：描述“一行/一句里有七个音节”。英语诗歌里更常见的术语还有 iambic（抑扬格）等；heptasyllabic 更侧重“音节数量”而不是重音模式。"]}
{"word":"heptasyllable","summary":{"en":"Heptasyllable means “seven syllables,” used for a seven-syllable word/phrase or a seven-syllable line of verse.","zh":"Heptasyllable 表示“七个音节”，可指七音节的词/短语，也可指七音节的诗行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word, line of poetry, or verse that has seven syllables.","zh":"（词、诗行或诗句）由七个音节组成的；七音节的（或七音节诗行/诗句）。"},"examples":[{"en":"The poet wrote a heptasyllable line to keep the rhythm light and quick.","zh":"诗人写了一行七音节诗句，让节奏显得轻快。"},{"en":"In this song, each verse begins with a heptasyllable.","zh":"在这首歌里，每一节都以七音节开头。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having seven syllables (describing a word, phrase, or line).","zh":"七音节的（用来形容词、短语或诗行含有七个音节）。"},"examples":[{"en":"“Beautifully” is not heptasyllable, but the phrase “in the middle of it” is heptasyllable.","zh":"“Beautifully” 不是七音节，但短语 “in the middle of it” 是七音节。"},{"en":"Try writing a heptasyllable line and then reading it aloud to check the beat.","zh":"试着写一行七音节诗句，然后大声读出来检查节拍。"}]}],"synonyms":["seven-syllable","septenary (rare)"],"phonetic":"/ˌhɛp.təˈsɪl.ə.bəl/","extraExplanation":["这个词由 hepta-（希腊语前缀，表示“七”）+ syllable（音节）组成，常见于诗歌格律讨论。","英语诗歌里常会提到不同“音节数”的诗行（如 pentasyllable 五音节、octosyllable 八音节）。七音节行并不如五音节抑扬格（iambic pentameter）那样“经典”，但在歌曲歌词、轻快短诗里很常见。"]}
{"word":"heptateuch","summary":{"en":"Heptateuch = a scholarly term for the first seven books of the Old Testament (Genesis–Judges).","zh":"Heptateuch（七书）= 学术用语，指旧约前七卷（《创世记》至《士师记》）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The first seven books of the Hebrew Bible/Old Testament (Genesis through Judges) when counted as a set in some scholarly traditions.","zh":"（某些学术传统中所说的）《希伯来圣经/旧约》前七卷的合称：从《创世记》到《士师记》。"},"examples":[{"en":"Some scholars use the term “Heptateuch” to discuss themes that run from Genesis through Judges.","zh":"一些学者用“heptateuch（七书）”来讨论从《创世记》到《士师记》贯穿的主题。"},{"en":"In this class, we compare the Pentateuch and the Heptateuch as different ways of grouping early biblical narratives.","zh":"在这门课中，我们比较“Pentateuch（五经）”与“Heptateuch（七书）”，作为对早期圣经叙事进行分组的不同方式。"}]}],"synonyms":["the first seven books (Genesis–Judges)","Pentateuch + Joshua + Judges"],"phonetic":"/ˈhɛp.tə.tjuːk/","extraExplanation":["词源：来自希腊语前缀 hepta-（“七”）+ teuchos（“卷、书卷”）。因此直译就是“七卷书”。","使用场景：Heptateuch 主要出现在圣经研究、神学与文学研究中，不是日常生活常用词。更常见的相关术语是 Pentateuch（五经：创-出-利-民-申）。","为什么是七卷：有些研究者认为《约书亚记》《士师记》与《申命记》以及更早的叙事在主题与结构上连续（例如“进入应许之地”的叙事延伸），所以会把前七卷一起讨论。"]}
{"word":"heptatomic","summary":{"en":"Heptatomic describes a molecule made of seven atoms.","zh":"heptatomic 指由七个原子组成的分子（七原子）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having seven atoms in a molecule (or consisting of seven atoms).","zh":"（分子）由七个原子组成的；七原子的。"},"examples":[{"en":"Ozone (O3) is triatomic, while some gases can be heptatomic under certain conditions.","zh":"臭氧（O3）是三原子分子，而有些气体在特定条件下可能是七原子分子。"},{"en":"In chemistry class, we learned to describe molecules as diatomic, triatomic, or heptatomic.","zh":"在化学课上，我们学习用双原子、三原子或七原子来描述分子。"}]}],"synonyms":["seven-atom","seven-atomic"],"phonetic":"/ˌhɛp.təˈtɑː.mɪk/","extraExplanation":["“hept-”来自希腊语，表示“七”（如 heptagon 七边形）。与之类似的词还有 diatomic（双原子）、triatomic（三原子）、polyatomic（多原子）。","这是偏学术/科学用语，常见于化学与物理语境；日常英语中较少用到。"]}
{"word":"heptatonic","summary":{"en":"Heptatonic describes a seven-note musical scale in an octave.","zh":"Heptatonic 指“七声音阶的”，即一个八度内有七个不同音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In music) having seven different notes in an octave (a seven-note scale).","zh":"（音乐）七声音阶的；一个八度内有七个不同音的。"},"examples":[{"en":"Most major and minor scales are heptatonic.","zh":"大多数大调和小调都是七声音阶。"},{"en":"Western folk songs often use a heptatonic scale.","zh":"西方民歌常使用七声音阶。"}]}],"synonyms":["seven-note","diatonic (often, but not always)"],"phonetic":"/ˌhɛp.təˈtɑn.ɪk/","extraExplanation":["“hepta-”来自希腊语，表示“七”；“-tonic”与“音/音阶”有关，因此 heptatonic 字面意思就是“七个音的”。","对比记忆：pentatonic（五声音阶）常见于中国民歌、布鲁斯等；heptatonic（七声音阶）在西方古典音乐体系里非常常见（如大调、自然小调）。"]}
{"word":"heptatrema","summary":{"en":"Heptatrema is an older scientific genus name for some hagfishes, often treated today as a synonym of Eptatretus.","zh":"Heptatrema 是某些盲鳗的较旧属名，如今常被视为 Eptatretus 的同物异名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A scientific genus name used for certain hagfishes (jawless, eel-like marine animals); it is largely considered an older or less-used name and is often treated as a synonym of the genus Eptatretus.","zh":"（动物学）盲鳗（无颌、鳗形的海洋动物）的一种属名；多被视为较旧或较少使用的名称，常被当作 Eptatretus（盲鳗属）的同物异名。"},"examples":[{"en":"In older zoology references, some hagfish species were listed under Heptatrema.","zh":"在较早的动物学资料中，一些盲鳗物种曾被归在 Heptatrema 之下。"},{"en":"Modern classifications usually place these animals in the genus Eptatretus rather than Heptatrema.","zh":"现代分类通常把这些动物归入 Eptatretus，而不是 Heptatrema。"}]}],"synonyms":["Eptatretus","hagfish"],"phonetic":"/ˌhɛp.təˈtriː.mə/","extraExplanation":["词源提示：hepta- 表示“七”，-trema 表示“孔/开口”。这个名字与盲鳗一侧常见的多个鳃孔有关（不同物种鳃孔数可不同，但名称意象来自“多孔/七孔”的特征）。","使用场景：Heptatrema 多出现在旧文献或分类史讨论中；写现代报告或查数据库时，通常应优先使用 Eptatretus，并在需要时注明“= Heptatrema（旧称）”。"]}
{"word":"heptavalent","summary":{"en":"Heptavalent means “seven-valent,” describing an element or compound with valence 7 (often oxidation state +7).","zh":"heptavalent意为“七价的”，指元素或化合物的价态为7（常见为+7氧化态）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a valence of seven; able to form seven chemical bonds (or showing an oxidation state of +7).","zh":"七价的；价态为七的；可形成七个化学键的（或呈现+7氧化态）。"},"examples":[{"en":"In its heptavalent state, manganese can appear in the permanganate ion.","zh":"在七价状态下，锰可以出现在高锰酸根离子中。"},{"en":"The chemist discussed heptavalent iodine compounds in advanced inorganic chemistry.","zh":"化学家在高等无机化学中讨论了七价碘化合物。"}]}],"synonyms":["seven-valent"],"phonetic":"/ˌhɛptəˈveɪlənt/","extraExplanation":["“hepta-”来自希腊语，表示“七”；“-valent”与“valence（化合价/价态）”相关，表示“具有……价的”。","在基础学习中常见的相关术语有：monovalent（一价）、divalent（二价）、trivalent（三价）。而“heptavalent”多见于较专业的无机化学语境。","注意区分“valence（价态/化合价）”与日常英语里更常见的“value（价值）”。两者拼写和含义不同。"]}
{"word":"heptene","summary":{"en":"Heptene is a seven-carbon alkene (C7H14) with one double bond.","zh":"Heptene（庚烯）是含七个碳、带一个双键的烯烃（C7H14）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Any of several alkenes with seven carbon atoms (C7H14), containing one carbon–carbon double bond.","zh":"（化学）庚烯：含七个碳原子（C7H14）的烯烃之一，分子中含有一个碳—碳双键。"},"examples":[{"en":"Heptene is an alkene, so it has at least one carbon–carbon double bond.","zh":"庚烯属于烯烃，所以它至少含有一个碳—碳双键。"},{"en":"In organic chemistry, you may see names like 1-heptene and 2-heptene, depending on where the double bond is.","zh":"在有机化学中，你可能会看到“1-庚烯”“2-庚烯”等名称，取决于双键的位置。"}]}],"synonyms":["C7H14 alkene","heptylene (older/less common)"],"phonetic":"/ˈhɛp.tin/","extraExplanation":["“hept-”来自希腊语，表示“七”；“-ene”是有机化学命名中表示“烯烃（含双键）”的后缀。","庚烯有“位置异构体”（如1-庚烯、2-庚烯、3-庚烯等），也可能有“顺反/几何异构”（如顺式/反式，或E/Z），具体取决于双键的位置与取代基。","在日常英语里它主要出现在化学与材料/燃料相关语境中，不是普通生活词汇。"]}
{"word":"hepteris","summary":{"en":"“hepteris” is not a common English word; it’s likely a misspelling or a specialized name.","zh":"“hepteris” 不是常见英文词；更可能是拼写错误或非常专业的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a specialized proper name (for example, a scientific/Latin name in biology).","zh":"这不是常见词典里的标准英文词；更可能是拼写错误，或某个非常专业的专有名词（例如生物学里的拉丁学名）。"},"examples":[{"en":"I couldn’t find “hepteris” in the dictionary—did you mean “heptagon”?","zh":"我在词典里查不到“hepteris”——你是不是想写“heptagon（七边形）”？"},{"en":"Can you share the sentence where you saw “hepteris”? That would help identify the intended word.","zh":"你能把看到“hepteris”的原句发出来吗？这样更容易判断你原本想表达的词。"}]}],"phonetic":"/ˈhɛptərɪs/","extraExplanation":["从构词上看，hept- 常见于表示“七”的词根（如 heptagon 七边形、heptathlon 七项全能）。但 “hepteris” 作为普通英文单词并不常见；如果它出现在论文、物种名或旧文本里，可能是某个属名/种加词或排版误差。建议提供上下文或确认是否想写 heptagon、heptane（庚烷）、heptarchy（七国时代）等词。"]}
{"word":"heptine","summary":{"en":"Heptine is a rare/less standard term for heptyne: a seven-carbon alkyne (C7H12).","zh":"Heptine 是较少见、较不规范的写法，通常指 heptyne（庚炔）：一种含七个碳的炔烃（C7H12）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An alkyne with seven carbon atoms (general formula C7H12); a compound in the heptyne family (e.g., 1-heptyne).","zh":"（化学）含七个碳原子的炔烃（通式 C7H12）；“庚炔”类化合物（如 1-庚炔）。"},"examples":[{"en":"1-Heptyne is sometimes referred to (less commonly) as heptine in older or nonstandard usage.","zh":"在较旧或不太规范的用法中，1-heptyne（1-庚炔）有时也会被称作 heptine。"},{"en":"Heptine (heptyne) has a carbon–carbon triple bond, which makes it more reactive than an alkane.","zh":"Heptine（即 heptyne/庚炔）含有碳碳三键，因此通常比烷烃更活泼。"}]}],"synonyms":["heptyne","1-heptyne","2-heptyne"],"phonetic":"/ˈhɛp.taɪn/","extraExplanation":["“heptine”在现代英语化学语境中并不常见，更标准的拼写是 **heptyne**（对应“庚炔”）。\n词根提示：**hept-** 表示“七”（seven），**-yne** 表示“炔烃/三键”。在 IUPAC 命名中通常会写成 **hept-1-yne / hept-2-yne** 等，明确三键位置。"]}
{"word":"heptite","summary":{"en":"Heptite is a very rare technical word built from “hepta- (seven)” + “-ite,” referring to something characterized by seven parts/units.","zh":"heptite 是一个非常少见的技术性构词，来自 hepta-（七）+-ite，泛指与“七个部分/单位”相关的物质或名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very uncommon/technical word sometimes formed from the prefix hepta- (“seven”) + -ite (“a substance/mineral”), meaning “a substance or mineral characterized by the number seven” (for example, having seven parts or a seven-unit structure).","zh":"一个非常少见、偏技术性的构词：由 hepta-（“七”）+-ite（“某种物质/矿物”）组成，通常指“与数字七有关的物质或矿物”（例如由七个部分构成或具有七单位结构）。"},"examples":[{"en":"The term heptite is rare; the author likely meant a seven-part compound or a mineral name based on hepta-.","zh":"heptite 这个词很少见；作者很可能想表达“由七部分构成的化合物”，或一个以 hepta- 命名的矿物名称。"},{"en":"If you saw heptite in a paper, check the glossary or chemical formula for what “seven” refers to.","zh":"如果你在论文里看到 heptite，建议查看术语表或化学式，确认这里的“七”具体指什么。"}]}],"synonyms":["(no common synonyms; related forms: hepta-, heptad, heptagon)"],"phonetic":"/ˈhɛp.taɪt/","extraExplanation":["“heptite”并不是常见英语词条，很多词典里可能查不到。它更像是按科学命名习惯临时造出来的词（hepta- 表“七”，-ite 常见于矿物名或化学物质名）。如果你能提供出现它的句子或领域（矿物学/化学/生物等），我可以更精确判断它指的是什么。","容易混淆的近形词：heptane（庚烷）、heptagon（七边形）、heptad（七个一组）、hepatitis（肝炎，来自 hepat- “肝”而不是 hepta- “七”）。"]}
{"word":"heptitol","summary":{"en":"Heptitol is a seven‑carbon sugar alcohol (a polyol).","zh":"Heptitol 指“七碳糖醇”，即含七个碳原子的糖醇（多元醇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sugar alcohol (polyol) with seven carbon atoms; a reduced form of a heptose sugar (formula often written as C7H16O7).","zh":"七碳糖醇（多元醇）；含七个碳原子的糖醇，通常可视为“七碳糖（heptose）”被还原后的产物（常写作 C7H16O7）。"},"examples":[{"en":"Heptitols are studied in carbohydrate chemistry and biochemistry.","zh":"七碳糖醇常见于糖类化学与生物化学研究中。"},{"en":"In the lab, a heptose can be reduced to form a heptitol.","zh":"在实验中，七碳糖（heptose）可以被还原生成七碳糖醇（heptitol）。"}]}],"synonyms":["seven-carbon sugar alcohol","polyol"],"phonetic":"/ˈhɛp.tɪ.tɔl/","extraExplanation":["“hept-”表示“七”，“-itol”常用于糖醇命名（如 sorbitol 山梨糖醇、xylitol 木糖醇）。因此 heptitol 这个词从构词上就能看出“七碳的糖醇”。","heptitol 多用于科研语境，不是日常食品标签上最常见的名称；不同具体结构的七碳糖醇可能有各自的专名。"]}
{"word":"heptode","summary":{"en":"A heptode is a seven-electrode vacuum tube used in older electronics, especially radios.","zh":"heptode 指七极真空电子管，多用于早期电子设备（尤其收音机）中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of vacuum tube (electron tube) with seven electrodes, used to amplify or mix electrical signals in older radio/electronic equipment","zh":"七极管；一种具有七个电极的真空电子管，常用于早期无线电/电子设备中进行放大或混频"},"examples":[{"en":"Older radio sets sometimes used a heptode for frequency mixing.","zh":"较老的收音机有时会用七极管来进行混频。"},{"en":"The engineer replaced the heptode to reduce noise in the circuit.","zh":"工程师更换了七极管，以减少电路中的噪声。"}]}],"synonyms":["seven-electrode vacuum tube","electron tube (general)"],"phonetic":"ˈhɛptoʊd","extraExplanation":["“hept-”来自希腊语，表示“七”（如 heptagon 七边形）；“-ode”常见于电子管命名（如 triode 三极管、tetrode 四极管、pentode 五极管）。因此 heptode 直观意思就是“七极（电极）的电子管”。","在现代电子学里，heptode 主要出现在历史资料、无线电修复（vintage radio repair）或电子管收藏语境中；日常更常见的是使用晶体管或集成电路。"]}
{"word":"heptoic","summary":{"en":"Heptoic is a rare chemistry adjective meaning “related to a seven‑carbon compound,” especially heptanoic acid.","zh":"heptoic 是很少见的化学形容词，表示“与含七个碳的化合物有关”，尤指庚酸（heptanoic acid）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to a substance with seven carbon atoms, especially heptanoic acid (also called enanthic acid).","zh":"（化学）与含七个碳原子的物质有关，尤指庚酸（heptanoic acid，也叫 enanthic acid）。"},"examples":[{"en":"Heptoic acid is another name sometimes used for heptanoic acid in older chemistry texts.","zh":"在一些较老的化学教材里，heptoic acid 有时用来指 heptanoic acid（庚酸）。"},{"en":"The lab report mentioned a heptoic odor, meaning a smell similar to heptanoic acid.","zh":"实验报告提到一种“heptoic”的气味，意思是类似庚酸的气味。"}]}],"synonyms":["heptanoic (more common)","seven-carbon (informal)"],"phonetic":"/hɛpˈtoʊ.ɪk/","extraExplanation":["“heptoic”非常少见，现代更常用的是 **heptanoic**（庚酸的）或直接写 **heptanoic acid**。","词根 **hept-** 表示“七”（来自希腊语 *hepta*），常见于：heptagon（七边形）、heptane（庚烷）。","如果你是在化学/食品香料/有机化学语境里看到它，通常与 **heptanoic acid / enanthic acid（庚酸/葡萄酸）** 的命名传统有关。"]}
{"word":"heptorite","summary":{"en":"“Heptorite” is not a recognized standard word; you may mean “hectorite,” a clay mineral used as a thickener/absorbent.","zh":"“heptorite”不是常见或标准英语词；你可能想写的是“hectorite”，一种用作增稠/吸附材料的黏土矿物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a very rare/technical term not found in major dictionaries.","zh":"不是标准英语单词；很可能是拼写错误，或是非常罕见/高度专业的术语，在主流词典中找不到。"},"examples":[{"en":"I couldn’t find “heptorite” in standard dictionaries—could you share where you saw it?","zh":"我在主流词典里找不到“heptorite”——你能告诉我你在哪里看到的吗？"},{"en":"If you meant “hectorite,” it’s a type of clay mineral.","zh":"如果你想写的是“hectorite”，它是一种黏土矿物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) hectorite: a soft clay mineral in the smectite group, often used in cosmetics and industrial products as a thickener or absorbent.","zh":"（可能想表达的词）hectorite（赫克托石/皂石类黏土矿物）：一种较软的蒙脱石族黏土矿物，常用于化妆品和工业品中作增稠剂或吸附剂。"},"examples":[{"en":"Some face masks use hectorite to help thicken the formula and absorb oil.","zh":"一些面膜会用 hectorite 来增稠配方并吸附油脂。"},{"en":"The lab tested the sample and identified it as hectorite.","zh":"实验室检测样品后确认它是 hectorite。"}]}],"synonyms":["hectorite (possible intended term)","smectite (related group)"],"phonetic":"/ˈhɛk.təˌraɪt/","extraExplanation":["“hept-”常见于表示“七”的词根（如 heptagon 七边形），所以“heptorite”看起来像是由词根拼出来的词，但在英语里并不常用、也不常见于正规词典。","如果你是在化学/矿物/材料相关语境里看到它，很可能是印刷或输入错误。你可以把原句或来源贴出来，我可以帮你判断最可能的正确词。"]}
{"word":"heptose","summary":{"en":"Heptose is a seven-carbon sugar (a type of monosaccharide).","zh":"Heptose 指七碳糖，即含七个碳原子的单糖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seven-carbon sugar (a monosaccharide) found in some biological molecules, especially in certain bacteria and plants","zh":"七碳糖；一种含七个碳原子的单糖，存在于部分生物分子中，尤其常见于某些细菌和植物中"},"examples":[{"en":"Some bacteria use a heptose in the outer layer of their cell wall.","zh":"一些细菌会在细胞壁外层结构中使用七碳糖。"},{"en":"Researchers measured heptose levels to study bacterial growth.","zh":"研究人员测量七碳糖含量来研究细菌的生长。"}]}],"synonyms":["seven-carbon sugar","C7 sugar"],"phonetic":"/ˈhɛp.toʊs/","extraExplanation":["“heptose”由词根 hept-（七）+ -ose（糖）构成，属于生物化学和微生物学领域较常见的专业词。","在细菌中，heptose 常与脂多糖（LPS）等结构相关，用于描述细胞外膜/细胞壁的特定糖成分；一般日常英语很少使用。"]}
{"word":"heptoses","summary":{"en":"Heptoses are seven-carbon simple sugars (the plural of heptose).","zh":"Heptoses 指七碳单糖，是 heptose 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a monosaccharide (simple sugar) that has seven carbon atoms; plural form: heptoses","zh":"含有七个碳原子的单糖（简单糖）；复数：heptoses"},"examples":[{"en":"Some bacteria use heptoses in building parts of their cell walls.","zh":"一些细菌会利用七碳糖来构建细胞壁的部分结构。"},{"en":"In biochemistry class, we learned that heptoses are less common than hexoses like glucose.","zh":"在生物化学课上，我们学到七碳糖不如葡萄糖这类六碳糖常见。"}]}],"synonyms":["seven-carbon sugar","7-carbon monosaccharide"],"phonetic":"/ˈhɛp.toʊs/","extraExplanation":["词源提示：hept- 来自希腊语，表示“七”（如 heptagon 七边形）；-ose 常用于糖类名称（如 glucose 葡萄糖、fructose 果糖）。因此 heptose 字面意思就是“七碳的糖”。","常见语境：这个词多出现在生物化学、微生物学、糖类代谢或细菌细胞壁结构（如脂多糖相关）等学术/专业文本中，日常英语里很少用到。"]}
{"word":"heptoxide","summary":{"en":"A heptoxide is an oxide with seven oxygen atoms per molecule (a chemistry term).","zh":"heptoxide 指“七氧化物”，即分子中含有7个氧原子的氧化物（化学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an oxide that contains seven oxygen atoms in each molecule (often written as X2O7 or similar), usually a chemical compound name used in science","zh":"（化学）七氧化物：每个分子含有7个氧原子的氧化物（常写作 X2O7 等），多用于科学语境中的化合物名称"},"examples":[{"en":"Dichlorine heptoxide (Cl2O7) is the anhydride of perchloric acid.","zh":"七氧化二氯（Cl2O7）是高氯酸的酸酐。"},{"en":"In the lab report, we discussed why some heptoxides are very reactive and must be handled carefully.","zh":"在实验报告里，我们讨论了为什么某些七氧化物非常活泼，必须小心处理。"}]}],"synonyms":["seven-oxide","X2O7 compound"],"phonetic":"/hɛpˈtɑk.saɪd/","extraExplanation":["“hept-”来自希腊语，表示“七”；“oxide”表示“氧化物”。因此 heptoxide 字面意思就是“含七个氧原子的氧化物”。在实际英语中，化学里更常见的是更具体的名称，如 dichlorine heptoxide（七氧化二氯）或 dimanganese heptoxide（七氧化二锰），而不是单独泛指 heptoxide。"]}
{"word":"heptranchias","summary":{"en":"Heptranchias is a scientific genus name for sevengill sharks, identified by seven gill slits.","zh":"Heptranchias 是“七鳃鲨”的一个科学属名，其特征是有七条鳃裂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of deep-sea sharks known as sevengill sharks (family Hexanchidae), especially the sharpnose sevengill shark.","zh":"一种深海鲨鱼属（六鳃鲨科），以“七鳃鲨”著称，代表种为尖吻七鳃鲨。"},"examples":[{"en":"Scientists recorded a Heptranchias specimen using a deep-sea camera.","zh":"科学家用深海摄像机记录到一条七鳃鲨属（Heptranchias）的个体。"},{"en":"Heptranchias sharks are recognized by their seven gill slits.","zh":"七鳃鲨属的鲨鱼以有七条鳃裂而容易辨认。"}]}],"synonyms":["sevengill shark (common name)","sharpnose sevengill shark (species name, related)"],"phonetic":"/hɛpˈtræŋkiəs/","extraExplanation":["词源提示：Heptranchias 来自希腊语词根 hepta-（“七”）和 branchia（“鳃”），意思与“七鳃”直接相关。","使用场景：这是生物分类学中的拉丁化学名，日常英语里更常用的说法是 “sevengill shark”。"]}
{"word":"heptyl","summary":{"en":"Heptyl means a seven‑carbon alkyl group (C₇H₁₅–), or something that contains/relates to that group.","zh":"Heptyl 指“庚基”（C₇H₁₅–，七碳烷基），也可指“含庚基的/与庚基相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical group (alkyl group) with seven carbon atoms, often written as C₇H₁₅– and used in naming organic compounds (e.g., heptyl alcohol).","zh":"“庚基”，含有七个碳原子的烷基（常写作 C₇H₁₅–），常用于有机化合物命名（如庚基醇）。"},"examples":[{"en":"Heptyl is an alkyl group with seven carbon atoms.","zh":"庚基是一种含七个碳原子的烷基。"},{"en":"The label mentions a heptyl substituent on the carbon chain.","zh":"标签上提到这条碳链上有一个庚基取代基。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to, or containing a heptyl group.","zh":"与庚基有关的；含有庚基的。"},"examples":[{"en":"Researchers tested several heptyl compounds for their odor properties.","zh":"研究人员测试了几种含庚基的化合物的气味特性。"}]}],"synonyms":["C7 alkyl","heptan-1-yl (specific)"],"phonetic":"/ˈhɛp.təl/","extraExplanation":["在有机化学命名中，hept- 表示“七”。heptyl 通常来自 heptane（庚烷）去掉一个氢原子后形成的取代基。常见的具体类型包括 n-heptyl（正庚基，直链）与 isoheptyl（异庚基，支链），不同结构会影响化合物的性质（如气味、沸点等）。"]}
{"word":"heptylene","summary":{"en":"Heptylene is an older/less common term for heptene, a seven-carbon alkene (C7H14).","zh":"Heptylene 是 heptene（庚烯）的较旧/较少见称呼，指含七个碳的烯烃（C7H14）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hydrocarbon with seven carbon atoms and one carbon–carbon double bond (an alkene); another name for heptene (C7H14).","zh":"一种含七个碳原子并带一个碳—碳双键的烃（烯烃）；相当于 heptene（庚烯，C7H14）的别称。"},"examples":[{"en":"In the lab, heptylene was used as a starting material to study alkene reactions.","zh":"在实验室里，heptylene 被用作研究烯烃反应的起始原料。"},{"en":"The safety sheet lists heptylene as a flammable organic liquid.","zh":"安全数据表将 heptylene 列为易燃的有机液体。"}]}],"synonyms":["heptene","C7H14 (alkene)"],"phonetic":"/ˈhɛp.tɪˌlin/","extraExplanation":["“heptylene”是较旧或较少见的叫法，更常见的现代化学名称是“heptene（庚烯）”。","由于双键位置不同，庚烯有多种异构体（如 1-heptene、2-heptene 等）；实际所指常需结合具体化学语境或产品说明。"]}
{"word":"heptylic","summary":{"en":"Heptylic means “related to a seven‑carbon (heptyl) group” in chemistry.","zh":"Heptylic 指“与七碳的庚基有关的”（化学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to a heptyl group (a seven‑carbon alkyl group, C7H15–) or to compounds derived from heptane.","zh":"（化学）与庚基（七个碳的烷基，C7H15–）有关的；或指由庚烷衍生的化合物。"},"examples":[{"en":"Heptylic compounds are often studied as part of hydrocarbon chemistry.","zh":"庚基相关的化合物常作为烃类化学的一部分来研究。"},{"en":"The lab report mentioned a heptylic chain attached to the ring.","zh":"实验报告提到在环上连接了一条庚基链。"}]}],"synonyms":["heptyl (more common)","heptanyl (technical)"],"phonetic":"/hɛpˈtɪlɪk/","extraExplanation":["“heptylic”在日常英语中很少见，更常用的形式是“heptyl”（庚基，名词/形容词用法）或更具体的术语，如“heptyl group”（庚基）。“-ic”是英语里常见的形容词后缀，表示“……的；与……有关的”。"]}
{"word":"heptyne","summary":{"en":"Heptyne is a seven-carbon alkyne (C7H12) that contains one triple bond.","zh":"Heptyne（庚炔）是含7个碳的炔烃（C7H12），具有一个三键。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hydrocarbon with seven carbon atoms and one carbon–carbon triple bond; an alkyne with the formula C7H12","zh":"含有7个碳原子并带有一个碳—碳三键的烃；化学式为 C7H12 的炔烃"},"examples":[{"en":"Heptyne is an alkyne, so it contains a carbon–carbon triple bond.","zh":"庚炔是一种炔烃，因此它含有碳—碳三键。"},{"en":"In organic chemistry, different isomers of heptyne have the triple bond in different positions.","zh":"在有机化学中，庚炔的不同异构体会在不同位置带有三键。"}]}],"synonyms":["C7 alkyne"],"phonetic":"/ˈhɛp.taɪn/","extraExplanation":["“hept-”表示“七”，“-yne”表示“炔烃（含三键）”。因此 heptyne 字面意思就是“七碳炔”。","庚炔通常不是单一物质，而是一类位置异构体的统称（如 1-heptyne、2-heptyne 等），区别在于三键所在的碳原子位置不同。"]}
