{"word":"heuau","summary":{"en":"“heuau” isn’t a recognized English word; please provide the correct spelling or context.","zh":"“heuau”不是常见英语单词；请提供正确拼写或语境以便查询。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a name, or text from another language.","zh":"不是标准英语单词，可能是拼写错误、人名，或来自其他语言的文本。"},"examples":[{"en":"I can’t find “heuau” in English dictionaries—could you check the spelling?","zh":"我在英语词典里找不到“heuau”——你可以确认一下拼写吗？"},{"en":"If you tell me the sentence you saw it in, I can guess the intended word.","zh":"如果你告诉我它出现的句子语境，我可以帮你推测你想要的单词。"}]}],"extraExplanation":["“heuau”看起来像随机输入或拼写误差。你可以：\n1）再发一次你想查的正确拼写；\n2）把它出现的整句贴出来；\n3）告诉我你想表达的中文意思（例如“你好/你好呀/吓一跳/治愈”等），我来帮你匹配最可能的英文词。"]}
{"word":"heuch","summary":{"en":"A Scots interjection meaning “hey!” or “come on!”, used to call out or urge on.","zh":"苏格兰方言的感叹词，表示“嘿！”“快点！”，用于呼喊或催促。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"a Scots interjection used to call out, get attention, or urge someone/animals on (similar to “hey!” or “come on!”).","zh":"（苏格兰方言）感叹词，用来呼喊、引起注意或催促人/牲畜前进（类似“嘿！”“快点！”）。"},"examples":[{"en":"Heuch! Are you coming or not?","zh":"嘿！你到底来不来？"},{"en":"The farmer shouted, “Heuch!” to drive the horses forward.","zh":"农夫喊了声“嘿嗬！”来催马往前走。"}]}],"synonyms":["hey","yo","oi","come on"],"phonetic":"/hjuːk/","extraExplanation":["“heuch”主要见于苏格兰英语/苏格兰语（Scots）的口语与文学描写里，用来模仿现场呼喊的声音；在现代标准英语里不常用。","拼写中的“-ch”在苏格兰词里常表示较硬的喉音/摩擦音（有时接近德语 Bach 的结尾音），所以不同地区读法会有差异。写作时通常用来营造方言氛围。"]}
{"word":"heuchera","summary":{"en":"Heuchera is a hardy garden plant (coral bells/alumroot) grown mainly for its colorful leaves.","zh":"Heuchera 指一种常见园艺多年生植物（珊瑚铃/矾根），主要因叶色丰富而栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of hardy garden plants (also called coral bells or alumroot) grown for their colorful leaves and small bell-shaped flowers","zh":"一种多年生观赏植物属（也常叫“珊瑚铃 / 矾根”），因叶色丰富、开小型铃铛状花而常用于园艺种植"},"examples":[{"en":"Heuchera is popular in shady gardens because its leaves stay colorful for a long time.","zh":"矾根在阴凉花园里很受欢迎，因为它的叶子能长时间保持鲜艳的颜色。"},{"en":"She planted heuchera along the path to add deep purple and lime-green foliage.","zh":"她在小路边种了矾根，用深紫和黄绿色的叶子来增添层次与色彩。"}]}],"synonyms":["coral bells","alumroot"],"phonetic":"/ˈhjuːkərə/","extraExplanation":["“Heuchera”是拉丁学名，来自德国植物学家 Johann Heinrich von Heucher 的姓氏，因此在英语里常作为园艺植物名称使用，日常对话中更常听到俗名 coral bells（珊瑚铃）或 alumroot（矾根）。","在园艺语境中，它通常指用于地被、花境或盆栽的观叶植物；不同品种叶色差异很大（紫、红、银、黄绿等），也是它受欢迎的原因。"]}
{"word":"heuchs","summary":{"en":"Heuchs is a Scots word meaning steep cliffs or rocky banks (plural).","zh":"heuchs 是苏格兰英语，意思是“陡峭的悬崖/峭壁（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots) steep cliffs or craggy banks, especially by the sea; plural of heuch.","zh":"（苏格兰英语）陡峭的悬崖、峭壁或险峻的岸坡（尤指海边）；heuch 的复数。"},"examples":[{"en":"We walked along the heuchs above the harbor and watched the waves.","zh":"我们沿着港口上方的峭壁走，看着海浪翻涌。"},{"en":"The sheep grazed near the heuchs, so the shepherd kept a close eye on them.","zh":"羊群在陡崖附近吃草，所以牧羊人一直紧盯着它们。"}]}],"synonyms":["cliffs","crags","rocky bluffs","steep banks"],"phonetic":"/hjuks/","extraExplanation":["这是苏格兰英语（Scots）用词，在标准英语里不常见。常见搭配有“sea heuchs”（海边峭壁）。","在苏格兰语音里，这个词末尾常带类似德语 Bach 那种“喉音/擦音”（/x/），但在美式英语里没有完全对应的音，所以很多学习者会用更接近的 /k/ 来近似。"]}
{"word":"heuern","summary":{"en":"“Hewn” means cut or shaped with a tool (wood/stone), and can also mean roughly finished.","zh":"“hewn”指用工具把木头/石头砍削或凿成形；也可指表面粗加工、未精细打磨。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended) past participle of “hew”: to cut or shape (especially wood or stone) with an axe or other tool.","zh":"（可能是你想写的）“hew”的过去分词：用斧头等工具（尤指对木头或石头）砍削、劈凿、加工成形。"},"examples":[{"en":"The cabin was built from hand-hewn logs.","zh":"这间小木屋是用手工砍削成形的原木建成的。"},{"en":"The statue was hewn from a single block of stone.","zh":"这座雕像是从一整块石头劈凿出来的。"},{"en":"Workers hewed the rough timber into beams.","zh":"工人把粗木料砍削成梁。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Also as an adjective) roughly cut or carved; not smoothly finished.","zh":"（也可作形容词）粗略砍削过的；未精细打磨的。"},"examples":[{"en":"He ran his hand over the hewn surface of the table.","zh":"他用手摸了摸桌子那粗糙的砍削表面。"},{"en":"They walked between hewn stones in an old temple.","zh":"他们走在古寺里凿切过的石块之间。"}]}],"synonyms":["carved","chiseled","cut","shaped"],"phonetic":"/hjun/","extraExplanation":["“heuern”不是常见英语单词，比较像拼写错误。最接近且常见的英语词是“hewn”（= hew 的过去分词）。\n“hew”在现代英语里偏书面/叙事风格，常出现在描写自然、工艺或古老建筑的语境中（如 hand-hewn logs“手工砍削的原木”）。\n搭配提示：hewn from（从……凿成/劈出）、hewn into（被加工成……）。"]}
{"word":"heugh","summary":{"en":"Heugh is a Scottish word meaning a steep cliff or rocky ravine.","zh":"Heugh 是苏格兰用语，指陡峭的悬崖或岩石峡谷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish English) a steep cliff, crag, or rocky ravine—often along the sea or a river.","zh":"（苏格兰英语）陡峭的悬崖、峭壁或岩石峡谷（常见于海岸或河边）。"},"examples":[{"en":"We walked along the heugh and looked down at the waves.","zh":"我们沿着峭壁走，俯视着海浪。"},{"en":"The sheep stayed near the heugh, where the ground dropped suddenly.","zh":"羊群待在峭壁附近，那里的地势会突然下落。"}]}],"synonyms":["cliff","crag","bluff","ravine","rock face"],"phonetic":"/hjuː/","extraExplanation":["“heugh”是苏格兰方言/苏格兰英语词，常出现在苏格兰地名与文学作品中（例如描写海岸峭壁的场景）。","拼写里的“-gh”在现代英语里常不发音或弱化；在苏格兰口音中可能带一点喉音/摩擦音，所以你可能会听到不同的读法。","学习时可把它当作更常见的“cliff / crag / ravine”的地方性说法；在非苏格兰语境中较少使用。"]}
{"word":"heughs","summary":{"en":"Heughs are steep cliffs or deep ravines (Scottish usage).","zh":"heughs 指陡峭的悬崖或深沟谷（苏格兰用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “heugh” (a Scottish word): a steep cliff, crag, or deep ravine, especially by the sea.","zh":"“heugh”的复数（苏格兰用语）：陡峭的悬崖、峭壁或深沟谷，常见于海边。"},"examples":[{"en":"From the village, you can see the heughs dropping straight into the North Sea.","zh":"从村子里能看到那些峭壁几乎垂直落入北海。"},{"en":"They followed the path along the heughs, keeping well back from the edge.","zh":"他们沿着悬崖边的小路走，但刻意与边缘保持距离。"}]}],"synonyms":["cliffs","crags","ravines","gullies"],"phonetic":"/hjuːx/","extraExplanation":["“heugh / heughs”多见于苏格兰英语或苏格兰文学、地名描写中；在日常通用英语里更常用 cliff（悬崖）、crag（峭壁/岩峰）、ravine（峡谷/深谷）。","拼写上容易被误认成姓氏“Hughes”。如果你想查的是人名（如作家 Langston Hughes），请告诉我上下文。"]}
{"word":"heuk","summary":{"en":"“Heuk” isn’t standard English; it’s usually a misspelling of “heck,” a mild exclamation meaning “hell.”","zh":"“heuk”不是标准英语单词；通常是把“heck”（“hell”的委婉感叹词）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling in English; most often a typo for “heck” (a mild swear word meaning “hell,” used to show surprise, annoyance, or emphasis).","zh":"英语里的非标准拼写；最常见是把“heck”（“hell”的委婉说法，用来表达惊讶、不爽或强调）打错成“heuk”。"},"examples":[{"en":"What the heuk? (Nonstandard; usually written: “What the heck?”)","zh":"What the heuk?（非标准写法；通常写作：What the heck?）"},{"en":"Heck, I forgot my keys again.","zh":"哎呀／真是的，我又把钥匙忘了。"},{"en":"How the heck did you do that?","zh":"你到底是怎么做到的？"}]}],"synonyms":["heck","what the heck","what on earth","darn (milder)"],"phonetic":"/hɛk/","extraExplanation":["“Heck”在英语里是比较温和的口语表达，常用来代替更粗口的“hell”，所以在对话、影视台词、网络留言中很常见；正式写作一般不建议用。","如果你原本想输入的是别的词（例如人名、外来语，或别的拼写），可以告诉我上下文句子，我可以帮你确定更准确的词和意思。"]}
{"word":"heulandite","summary":{"en":"Heulandite is a zeolite mineral often found in volcanic rocks.","zh":"Heulandite（斜发沸石）是一种沸石类矿物，常见于火山岩中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring mineral (a type of zeolite) that often forms in volcanic rocks and can contain water in its crystal structure","zh":"（矿物）斜发沸石：一种天然沸石类矿物，常见于火山岩中，晶体结构中常含有水分子"},"examples":[{"en":"Heulandite is commonly found lining cavities in basalt.","zh":"斜发沸石常见于玄武岩空洞的内壁上。"},{"en":"The sample contained heulandite crystals alongside other zeolite minerals.","zh":"该样品中除了其他沸石类矿物外，还含有斜发沸石晶体。"}]}],"synonyms":["zeolite"],"phonetic":"/ˈhjuːlənˌdaɪt/","extraExplanation":["“heulandite”来自人名 Heuland（19世纪的矿物收藏家/研究者 J. H. Heuland），加上矿物命名常见后缀 -ite（表示“某种矿物/岩石”）。","沸石（zeolite）类矿物常因其多孔结构而在地质、材料与环境领域被研究；不过在一般英语中，heulandite 多见于矿物学或地质学语境。"]}
{"word":"heumite","summary":{"en":"Hematite is an iron-oxide mineral often used as an iron ore and known for its reddish-brown streak.","zh":"Hematite（赤铁矿）是一种氧化铁矿物，常作为铁矿石使用，并以红褐色条痕著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common mineral made of iron oxide (Fe₂O₃), usually black or steel-gray on the outside but with a reddish-brown streak; used as an iron ore and as a pigment or polish","zh":"赤铁矿（主要成分为氧化铁 Fe₂O₃），外观常为黑色或钢灰色，但在瓷板上划痕呈红褐色；可作铁矿石，也用于颜料或抛光材料"},"examples":[{"en":"The rock looked dark, but its hematite streak was reddish-brown.","zh":"这块石头看起来很黑，但它的赤铁矿条痕是红褐色的。"},{"en":"Hematite is an important source of iron for making steel.","zh":"赤铁矿是炼钢的重要铁来源。"},{"en":"She wore a hematite bracelet with a metallic shine.","zh":"她戴着一条带金属光泽的赤铁矿手链。"}]}],"synonyms":["iron ore","iron oxide mineral"],"phonetic":"/ˈhiːməˌtaɪt/","extraExplanation":["“heumite”不是常见的英语单词；最可能是把 **hematite** 拼错了（也常见误拼：*hemotite, hemataite*）。","**词源小知识**：hematite 来自希腊语 *haima*（“血”），因为它的粉末/条痕常呈红色，看起来像血色。","在地质与宝石语境里，hematite 常被描述为“metallic”（金属光泽）；在工艺上也可做抛光粉（尤其用于金属或玻璃表面）。"]}
{"word":"heureka","summary":{"en":"“Heureka” (more commonly “Eureka”) is an exclamation meaning “I’ve found it!” used when you suddenly discover a solution or idea.","zh":"“Heureka”（更常见写法为“Eureka”）是表示“我找到了！”的感叹词，用于突然想到办法或有发现时。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"an exclamation used when you suddenly find an answer or make an exciting discovery; “I’ve got it!”","zh":"（感叹词）用于突然想到答案或有重大发现时的惊呼；“我找到了！”“我明白了！”"},"examples":[{"en":"Heureka! I finally solved the math problem.","zh":"Heureka！我终于解出那道数学题了。"},{"en":"She shouted, “Heureka!” when the experiment worked.","zh":"实验成功时，她大喊：“Heureka！”"},{"en":"He sat up and said, “Heureka—I know what to do next.”","zh":"他突然坐起来说：“Heureka——我知道接下来该怎么做了。”"}]}],"synonyms":["eureka","aha","I’ve got it"],"phonetic":"/hjuˈriːkə/","extraExplanation":["“Heureka”是“Eureka”的一种拼写变体，更常见的英语拼写是“Eureka”。这个词常与古希腊科学家阿基米德（Archimedes）的故事联系在一起：据说他在浴缸里想到了解决问题的方法，兴奋地喊出“Eureka!”（字面意思接近“我找到了！”）。","在现代英语里，它多用于口语或写作中表达“灵光一现/顿悟”的时刻，语气通常偏幽默或夸张。"]}
{"word":"heuretic","summary":{"en":"Heuristic means a practical rule-of-thumb method for quick decisions or problem-solving, and it can also describe a learning approach based on discovery.","zh":"Heuristic 指用于快速决策或解决问题的经验法则/启发式方法，也可形容以探索发现为主的学习方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A practical method or “rule of thumb” used to solve a problem or make a decision quickly, especially when an exact answer is difficult or unnecessary.","zh":"一种实用的“经验法则/启发式方法”，用于快速解决问题或做决定，尤其在精确答案很难得到或不需要时。"},"examples":[{"en":"A common heuristic is to choose the option that saves the most time.","zh":"一个常见的启发式方法是选择最省时间的方案。"},{"en":"In interviews, she used simple heuristics to narrow down candidates.","zh":"在面试中，她用一些简单的经验法则来筛选候选人。"},{"en":"Search engines use heuristics to rank results quickly.","zh":"搜索引擎使用启发式方法来快速给结果排序。"}]},{"partOfSpeech":"adj.","definition":{"en":"Helping people discover or learn something through experience and problem-solving rather than direct instruction.","zh":"（教学/学习方式）通过探索与解决问题来帮助发现或学习，而不是直接灌输。"},"examples":[{"en":"The course uses a heuristic approach, letting students learn by doing.","zh":"这门课采用启发式方法，让学生在实践中学习。"},{"en":"Heuristic learning can feel slower at first but builds deeper understanding.","zh":"启发式学习一开始可能更慢，但能建立更深入的理解。"}]}],"synonyms":["rule of thumb","shortcut","guideline","rough-and-ready method","approximation"],"phonetic":"/hjʊˈrɪs.tɪk/","extraExplanation":["你输入的“heuretic”通常是拼写错误；常见正确拼写是 heuristic。","heuristic 常见于心理学、管理决策与计算机科学（如“启发式算法”）：它不保证最优或绝对正确，但往往足够好、速度快、成本低。","词源与“发现”有关：来自希腊语 heuriskein（意为“发现”）。"]}
{"word":"heuristic","summary":{"en":"A heuristic is a practical rule-of-thumb method for quick problem-solving; it can also describe an exploratory, discovery-based approach to learning.","zh":"heuristic 指用于快速解决问题的“经验法则/启发式方法”，也可形容一种通过探索与发现来学习的“启发式”方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a practical method or rule of thumb used to solve a problem or make a decision quickly, without guaranteeing a perfect answer","zh":"启发式方法；经验法则：用来快速解决问题或做决定的实用规则，但不保证一定最准确"},"examples":[{"en":"As a heuristic, I usually choose the simplest option first.","zh":"作为一种经验法则，我通常先选择最简单的方案。"},{"en":"The doctor used a heuristic to decide which tests to run first.","zh":"医生用一种启发式方法来决定先做哪些检查。"}]},{"partOfSpeech":"adj.","definition":{"en":"helping someone learn or discover something by encouraging exploration and problem-solving","zh":"启发式的；促进通过探索与解决问题来学习或发现"},"examples":[{"en":"We used a heuristic approach in class: try, observe, and adjust.","zh":"我们在课堂上用了启发式方法：尝试、观察、再调整。"},{"en":"Heuristic learning can be more memorable than memorizing rules.","zh":"启发式学习往往比死记规则更容易记住。"}]}],"synonyms":["rule of thumb","shortcut","practical method","guideline","approximation"],"phonetic":"/hjʊˈrɪstɪk/","extraExplanation":["词源上与希腊语“发现/找到”(heuriskein)有关，所以它的核心感觉是“靠探索找到答案”。","在日常英语里，heuristic 常带中性或略偏正面的语气：强调“够用、快速、实用”，而不是“严谨证明”。常见搭配有 heuristic rule / heuristic method / heuristic approach。","在心理学里常说“heuristics and biases（启发式与偏差）”：启发式能帮我们快速判断，但也可能导致系统性错误（比如以偏概全）。"]}
{"word":"heuristically","summary":{"en":"Heuristically means using practical rules of thumb to decide or solve something quickly, without guaranteeing the best answer.","zh":"heuristically 指用经验法则（启发式）来快速做决定或解决问题，但不保证最优解。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses practical, experience-based rules of thumb (heuristics) to make a quick, reasonable judgment or solution, not guaranteed to be perfect.","zh":"以“启发式”的方式；依据经验法则/直觉性规则来快速做出合理判断或解决问题（不保证最优或完全正确）。"},"examples":[{"en":"We chose the settings heuristically, based on what worked in earlier tests.","zh":"我们根据之前测试中有效的方法，用启发式的方式选定了这些设置。"},{"en":"The app heuristically predicts what you want to type next.","zh":"这个应用用启发式方法预测你接下来想输入的内容。"},{"en":"She judged the risk heuristically instead of calculating every detail.","zh":"她用启发式方法评估风险，而不是把每个细节都算一遍。"}]}],"synonyms":["approximately","roughly","by rule of thumb","practically"],"phonetic":"/ˌhjʊˈrɪstɪkli/","extraExplanation":["“heuristically”常见于计算机科学、数据分析、心理学与决策场景：表示用“够用、速度快”的经验规则来求解或判断，尤其在精确计算成本太高或信息不完整时。","词根来自希腊语 *heuriskein*（意为“发现、找到”），同源词包括 *eureka*（“我发现了！”）。"]}
{"word":"heuristics","summary":{"en":"Heuristics are practical “rules of thumb” that help people or computers make quick, efficient decisions, often without guaranteeing the best answer.","zh":"Heuristics 指帮助人或电脑快速高效做决定的“经验法则/启发式方法”，通常不保证最优答案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Simple, practical rules or methods used to solve problems or make decisions quickly, especially when perfect information is not available.","zh":"（尤指信息不完整时）用来快速解决问题或做决定的简单实用规则/经验法则。"},"examples":[{"en":"A common heuristic is to choose the option with the fewest steps.","zh":"一个常见的经验法则是选择步骤最少的选项。"},{"en":"Doctors sometimes use heuristics to make quick decisions in emergencies.","zh":"医生在紧急情况下有时会用经验法则来快速判断。"},{"en":"In job interviews, people may rely on heuristics, like first impressions, which can be misleading.","zh":"在面试中，人们可能依赖诸如第一印象之类的经验法则，但这可能会误导。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing and AI, strategies that guide searching or problem-solving to find a good-enough solution efficiently (not always the best or guaranteed).","zh":"（计算机与人工智能中）用于引导搜索或求解的策略，以较高效率找到“足够好”的答案（不一定最优或有保证）。"},"examples":[{"en":"The chess program uses heuristics to evaluate which move looks strongest.","zh":"这个国际象棋程序用启发式策略来评估哪一步看起来最强。"},{"en":"A heuristic function helps the algorithm decide which path to explore first.","zh":"启发式函数帮助算法决定先探索哪条路径。"}]}],"synonyms":["rules of thumb","shortcuts","guidelines","rules","approximations","heuristic methods"],"phonetic":"/hjʊˈrɪstɪks/","extraExplanation":["“Heuristics”常以复数形式出现（a heuristic / some heuristics），但也可以作不可数名词，表示“启发式方法”这一类东西。","词源来自希腊语 heuriskein（意为“发现”），所以 heuristic 常和“启发、发现、探索式解决问题”联系在一起。","日常生活里常见的 heuristics 有：用“价格更高=质量更好”来快速判断、用“熟悉/常见=更安全”来选择等；它们省时省力，但也容易带来偏见（bias）。"]}
{"word":"heuvel","summary":{"en":"Heuvel is a Dutch word meaning “hill,” and it also appears in Dutch surnames/place names (e.g., Van Heuvel).","zh":"Heuvel 是荷兰语，意思是“丘陵/小山”，也常见于荷兰姓氏或地名中（如 Van Heuvel）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dutch) a hill; a small rise of land.","zh":"（荷兰语）小山；丘陵；地势的小隆起。"},"examples":[{"en":"The Dutch word heuvel means “hill.”","zh":"荷兰语单词 heuvel 的意思是“小山/丘陵”。"},{"en":"They live on a heuvel overlooking the river.","zh":"他们住在一座俯瞰河流的小山上。"}]},{"partOfSpeech":"n.","definition":{"en":"a Dutch surname or place-name element meaning “hill,” seen in names like Van Heuvel.","zh":"荷兰姓氏或地名中的组成部分，含义为“山/丘陵”，常见于 Van Heuvel 等名字中。"},"examples":[{"en":"Her last name is Van Heuvel.","zh":"她的姓是 Van Heuvel。"},{"en":"Some place names in the Netherlands include the word heuvel.","zh":"荷兰的一些地名里包含 heuvel 这个词。"}]}],"synonyms":["hill","knoll","rise"],"phonetic":"/ˈhjuːvəl/","extraExplanation":["在英语里，heuvel 多出现在人名或地名中（例如 Van Heuvel）。作为外来词，它本身不是常见的英语词汇；阅读到时通常可按“hill（小山、丘陵）”来理解。","荷兰语发音与英语不完全一致；英语语境中常用近似读法。"]}
