{"word":"hew","summary":{"en":"Hew means to chop or shape something by cutting, and figuratively (in “hew to”) to follow a rule or plan closely.","zh":"Hew 指（用工具）劈砍或削切塑形；引申义在 “hew to” 中表示严格遵循规则或计划。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cut or chop something (especially wood or stone) with repeated blows using an axe or a similar tool","zh":"（尤指用斧等）反复劈砍、砍削（木头或石头等）"},"examples":[{"en":"They hewed logs for the fire.","zh":"他们劈柴生火。"},{"en":"The workers hewed stone for the wall.","zh":"工人们凿石砌墙。"}]},{"partOfSpeech":"v.","definition":{"en":"to shape or form something by cutting away pieces; to carve","zh":"通过削切来塑形；雕刻、凿成"},"examples":[{"en":"A rough bench was hewed from a single tree trunk.","zh":"一张粗糙的长凳是从一整段树干削制出来的。"},{"en":"The statue looks as if it was hewed by hand.","zh":"这座雕像看起来像是手工凿出来的。"}]},{"partOfSpeech":"v.","definition":{"en":"(usually in the phrase “hew to”) to follow or stick closely to a rule, plan, or belief","zh":"（常用于“hew to”）严格遵循；紧贴（规则、计划或信念）"},"examples":[{"en":"The film hews closely to the original story.","zh":"这部电影紧贴原著故事。"},{"en":"Our team will hew to the schedule.","zh":"我们团队会严格按时间表执行。"}]}],"synonyms":["chop","cut","hack","carve","shape","adhere to","stick to","follow closely"],"phonetic":"/hju/","extraExplanation":["“hew”是较偏文学/正式的动词，常见于描述砍柴、凿石等场景，也常用作比喻表示“遵循原则”。","短语“hew to the line”表示“严格守规矩/按原则办事”。其中“line”可理解为界线或标准。"]}
{"word":"hewable","summary":{"en":"Hewable means “able to be hewn”—something you can cut or shape by chopping or carving.","zh":"Hewable 指“可被砍削/凿削成形的”，即能用砍、劈、削等方式加工的材料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be hewn (cut, chopped, or shaped) with an axe or other cutting tool; suitable for hewing.","zh":"可被砍削的；可用斧等工具劈砍、削切或修整成形的。"},"examples":[{"en":"The carpenter chose a hewable log to make a squared timber.","zh":"木匠选了一根容易砍削成方木的原木。"},{"en":"This stone is too brittle; it isn’t very hewable.","zh":"这块石头太脆，不太适合凿削。"}]}],"synonyms":["workable","cuttable","shapeable","carvable"],"phonetic":"/ˈhjuːəbl/","extraExplanation":["“Hewable”来自动词“hew”（砍、劈、凿、削）。后缀“-able”表示“能够被……的”。它不是日常高频词，更常见的表达有“easy to cut/shape”“workable (wood/stone)”等。","“hew”常出现在较文学或历史语境里，如“hewn stone”（凿成的石块）、“hewn timber”（砍削成形的木材）、“hewn from the rock”（从岩石中凿出），常带有“用力、费工”的画面感。"]}
{"word":"hewe","summary":{"en":"“Hewe” is an archaic spelling of “hew,” meaning to cut or shape by chopping.","zh":"“hewe”是“hew”的古老拼写，意思是“砍削、凿刻（使成形）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) to cut or shape something (especially wood or stone) with repeated blows; an old spelling/form of “hew.”","zh":"（古语）用反复敲击来砍削或雕凿（尤指木头或石头）；是“hew”的旧拼写/旧形式。"},"examples":[{"en":"In old texts, you may see “hewe” where modern English uses “hew.”","zh":"在旧文本里，你可能会看到“hewe”，而现代英语通常写作“hew”。"},{"en":"They hewed (hewe) logs into beams for the house.","zh":"他们把原木砍削成房梁来建房。"}]}],"synonyms":["hew","chop","cut","carve","shape"],"phonetic":"/hjuː/","extraExplanation":["“hewe”多见于中古英语/早期现代英语的拼写变体，并不是当代常用词。现代写作与学习中建议使用“hew”（过去式/过去分词：hewed 或 hewn）。","如果你想输入的是别的词（比如“here we…”或人名/缩写），可以告诉我上下文句子，我可以帮你确认正确拼写与意思。"]}
{"word":"hewed","summary":{"en":"“Hewed” means “cut/shape by chopping,” or (in “hew to”) “follow closely.”","zh":"“hewed”表示“劈砍、凿削成形”，也可指（在“hew to”中）“严格遵守、紧贴（规则/原则）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “hew”: to cut or shape (wood, stone, etc.) by striking with an axe or a similar tool; to chop.","zh":"“hew”的过去式和过去分词：用斧头等工具劈砍、砍削（木头、石头等）；砍成形。"},"examples":[{"en":"They hewed logs for the cabin during the winter.","zh":"他们在冬天劈木头，准备搭小木屋。"},{"en":"The statue was hewed from a single block of stone.","zh":"这座雕像是从一整块石头凿刻而成的。"}]},{"partOfSpeech":"v.","definition":{"en":"(often in the phrase “hew to”) to follow or stick closely to a rule, plan, or tradition.","zh":"（常用于短语“hew to”）严格遵守、紧贴某条规则、计划或传统。"},"examples":[{"en":"The new policy hewed to the company’s original values.","zh":"新政策严格遵循公司的核心价值观。"},{"en":"Even under pressure, she hewed to her principles.","zh":"即使在压力下，她也坚守自己的原则。"}]}],"synonyms":["chopped","cut","cleaved","hacked","carved","shaped","adhered (to)","followed","stuck to"],"phonetic":"/hjud/","extraExplanation":["“hew”是比较古老但仍常见的动词，和体力劳动、手工加工有关（如用斧头劈柴、凿石）。因此在文学或历史叙述里很常见。","固定搭配“hew to the line”（也说“hew to the line/party line”）意思是“严格按既定路线/立场行事”，常用于政治、组织纪律或原则问题的语境。"]}
{"word":"hewel","summary":{"en":"A rare word meaning a person who chops or cuts wood/stone (a hewer).","zh":"一个很少见的词，表示砍木或凿石的人（砍削者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A person who hews—someone who chops or cuts wood/stone with an axe or similar tool.","zh":"（罕见/古用）砍削者；用斧等工具砍木头或凿石头的人。"},"examples":[{"en":"In the old tale, a hewel shaped the timber for the village roof.","zh":"在那个古老的故事里，一位砍削者把木料加工成村里屋顶用的梁木。"},{"en":"The hewel worked from dawn until the logs were square and smooth.","zh":"那位砍削者从清晨干到木头被砍成方正而平整。"}]}],"synonyms":["hewer","woodcutter","cutter","logger"],"phonetic":"ˈhjuːəl","extraExplanation":["“hewel”在现代英语里非常少见，多半出现在较古老的文本里，可理解为“hewer（砍伐者/砍削者）”的变体或拼写差异。","如果你是在日常写作中想表达“砍（木头/石头）”，更常用动词是“hew”（如：hew wood / hew stone）。","另外，“Hewell/Hewell”也可能是人名/姓氏；若你指的是名字，请告诉我上下文。"]}
{"word":"hewer","summary":{"en":"A hewer is someone who cuts or shapes wood or stone, often as a laborer.","zh":"hewer 指砍伐或凿刻木头、石头的人，常指从事体力劳动的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who cuts (especially wood or stone), often as a job.","zh":"砍伐者；凿石/切割者（尤指以此为业的人）"},"examples":[{"en":"The hewer chopped firewood behind the cabin before winter.","zh":"入冬前，那位砍伐者在小屋后面劈柴。"},{"en":"In the old quarry, a hewer shaped stone blocks by hand.","zh":"在老采石场里，凿石工用手工把石头凿成石块。"}]}],"synonyms":["woodcutter","cutter","logger","stonecutter"],"phonetic":"/ˈhjuːɚ/","extraExplanation":["“hewer”来自动词“hew”（砍、劈、凿），常见搭配是“hewers of wood”（砍柴的人）。在较正式或带文学色彩的语境里，它常与“drawers of water”（挑水的人）并列，用来指从事辛苦体力劳动、地位较低的人。","文学/文化提示：英语里有句常被引用的表达“hewers of wood and drawers of water”，源自《圣经》（Joshua 9:21 等处的传统译法），用来形容做粗重杂务的人。"]}
{"word":"hewers","summary":{"en":"Hewers are people who chop or cut (especially wood or stone), and it can also mean people who do the hard groundwork for others.","zh":"hewers 指砍伐/劈凿的人（尤指木头或石头），也可比喻为为他人打基础、做苦活的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cuts something with a tool, especially someone who chops wood or cuts stone","zh":"砍伐者；劈柴的人；（尤指）凿石、采石的人"},"examples":[{"en":"In the old days, hewers worked for hours cutting firewood for the village.","zh":"过去，劈柴的人常常为村子砍柴干上好几个小时。"},{"en":"Stone hewers shaped blocks for the temple walls.","zh":"凿石工把石块加工成适合寺庙墙体的形状。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a person who clears the way or does the hard, basic work for others","zh":"（比喻）开路的人；打基础、做苦活的人"},"examples":[{"en":"She was a hewer of paths, building programs that others later expanded.","zh":"她是开路的人，先搭建项目框架，后来别人再在此基础上发展。"},{"en":"The first team were the hewers, solving the messy problems before launch.","zh":"第一支团队是“打基础的人”，在上线前解决了那些棘手问题。"}]}],"synonyms":["woodcutters","lumberjacks","stonecutters","cutters","pioneers (figurative)"],"phonetic":"/ˈhjuːərz/","extraExplanation":["“hewer(s)”来自动词 hew（砍、劈、凿），在现代英语里较偏书面或古风。日常更常见的说法是 woodcutter（伐木工）或 lumberjack（伐木工人）。","短语 “hewers of wood and drawers of water” 出自《圣经》（如约书亚记 9:21），常用来指地位较低、做苦力杂活的人；在文学/演讲中出现时通常带有历史与社会阶层的含义，使用时要注意语境。"]}
{"word":"hewettite","summary":{"en":"Hewettite is a rare mineral name, often noted for yellow–orange crusts or fibrous coatings in vanadium-rich deposits.","zh":"Hewettite（休厄特石）是一种较罕见的矿物名称，常见为黄色到橙色的结壳或纤维状覆盖层，出现于富钒矿床中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a hydrated calcium vanadate) that often forms yellow to orange crusts or fibrous coatings, found in some vanadium-rich deposits","zh":"一种较罕见的矿物（含水的钙钒酸盐），常呈黄色到橙色的结壳或纤维状覆盖层，见于一些富钒矿床中"},"examples":[{"en":"The collector labeled the specimen as hewettite from a vanadium deposit.","zh":"收藏者把这块标本标注为来自富钒矿床的 hewettite（休厄特石）。"},{"en":"In the field guide, hewettite is described as forming bright orange coatings on rock surfaces.","zh":"在野外指南中，hewettite 被描述为会在岩石表面形成亮橙色的覆盖层。"}]}],"phonetic":"/hjuːˈɛt.aɪt/","extraExplanation":["“Hewettite”是矿物学名称，通常按“人名 + -ite（表示矿物的后缀）”构成；在科普或地质语境中更常见，日常英语里很少用到。","该词多出现在矿物目录、博物馆标牌、学术或采集记录中；如果只是泛指“矿物/矿石”，英语里更常用 mineral / ore。"]}
{"word":"hewgag","summary":{"en":"“hewgag” is not a standard English word; it’s likely a typo or a name.","zh":"“hewgag”不是标准英语单词；更可能是拼写错误或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a typo, username, or a made-up (nonce) word. It does not have a widely accepted dictionary meaning.","zh":"不是标准英语单词；更可能是拼写错误、用户名，或临时造词（新造词/无固定含义的词）。在常见词典中没有公认释义。"},"examples":[{"en":"I couldn’t find “hewgag” in an English dictionary—did you mean “hew” or “gag”?","zh":"我在英语词典里找不到“hewgag”——你是想写“hew”还是“gag”吗？"},{"en":"If “hewgag” is a screen name, it may not have a literal meaning.","zh":"如果“hewgag”是网名，它可能并没有字面意思。"}]}],"phonetic":"hjuːɡæɡ","extraExplanation":["“hewgag”看起来像把两个英文单词拼在一起：hew（v. 砍/劈；也可指“遵守、坚守”如 hew to a plan）+ gag（n./v. “堵住嘴”；也可指“笑话/噱头”）。但这种拼法并不是常见固定词。","如果你告诉我：1）你在哪里看到它（游戏/社交媒体/文章/歌词）；2）上下文句子；3）你想表达的中文意思，我可以帮你判断最可能的正确拼写或含义。"]}
{"word":"hewgh","summary":{"en":"“hewgh” isn’t a standard English word; you may mean “hew” (to chop/cut) or “heugh” (a cliff, Scots/Northern English).","zh":"“hewgh”不是标准英语单词；你可能想写“hew”（砍/劈/凿）或“heugh”（悬崖，苏格兰/英格兰北部方言）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or typing error.","zh":"不是标准英语单词，可能是拼写或输入错误。"},"examples":[{"en":"I can’t find “hewgh” in an English dictionary—did you mean “hew” or “heugh”?","zh":"我在英语词典里找不到“hewgh”——你是想写“hew”还是“heugh”？"}]},{"partOfSpeech":"v.","definition":{"en":"Possible intended word: “hew” — to chop or cut (especially wood or stone) with an axe or similar tool; also used more generally meaning “to shape/make by cutting.”","zh":"可能想写的词：hew——（尤指用斧头等）砍、劈（木头或石头）；也可泛指“通过切削来塑形/制作”。"},"examples":[{"en":"They hewed logs to build a small cabin.","zh":"他们把原木劈成木料来建一间小木屋。"},{"en":"The statue was hewn from a single block of stone.","zh":"这座雕像由一整块石头雕凿而成。"}]},{"partOfSpeech":"n.","definition":{"en":"Possible intended word (less common): “heugh” — a steep cliff or ravine (mainly in Scottish/Northern English usage).","zh":"可能想写的词（较少见）：“heugh”——陡峭的悬崖或峡谷（主要见于苏格兰/英格兰北部用法）。"},"examples":[{"en":"They stood near the heugh and watched the waves below.","zh":"他们站在悬崖边，看着下面的海浪。"}]}],"synonyms":["chop","cut","hack","carve","shape"],"phonetic":"/hjuː/","extraExplanation":["“hew”常见搭配：hew wood（砍木头）、hew stone（凿石头）。过去分词/形容词“hewn”常用于文学或正式语境：a hewn beam（凿成的梁）、a hewn face（线条硬朗的脸）。","“heugh”属于地方方言词，更可能在英国地名、诗歌或描写海岸地形的文字中出现。"]}
{"word":"hewhall","summary":{"en":"“hewhall” is not a standard English word; it’s probably a misspelling or a proper name like “Hew Hall.”","zh":"“hewhall”不是标准英文词，可能是拼写错误或专有名词（如“Hew Hall”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a combined form of two words (\"hew\" + \"hall\"), or a proper name (e.g., a building/place name such as \"Hew Hall\").","zh":"不是标准英语单词。很可能是拼写错误，或把两个词（hew + hall）连写在一起，也可能是专有名词（例如建筑/地点名“Hew Hall”）。"},"examples":[{"en":"I can’t find “hewhall” in a dictionary—did you mean “Hew Hall” (a place name) or “hew” + “hall”?","zh":"我在词典里找不到“hewhall”——你是想写地点名“Hew Hall”，还是想表达“hew”和“hall”两个词？"},{"en":"If you meant “hew,” it means to chop or cut (often wood or stone).","zh":"如果你想写“hew”，它的意思是“砍、劈”（常用于木头或石头）。"},{"en":"If you meant “hall,” it usually means a corridor or a large room in a building.","zh":"如果你想写“hall”，通常指“走廊”或“大厅”。"}]}],"phonetic":"/ˈhjuː hɔl/","extraExplanation":["“hewhall”很可能出现在：用户名/账号名、游戏ID、项目代号、或某个学校/机构建筑的非正式写法（比如把“Hew Hall”连写）。如果你能提供一句完整的上下文（它出现在哪句话里、是否是地名/人名/网站名），我可以给出更准确的释义与用法。"]}
{"word":"hewhole","summary":{"en":"Whole means complete or all of something; it can also mean the entire thing considered together.","zh":"whole 表示“完整的/全部的”，也可作名词表示“整体、全部”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"complete; not broken or divided; all of something","zh":"完整的；未破损的；全部的"},"examples":[{"en":"She ate the whole apple.","zh":"她把整个苹果都吃了。"},{"en":"We need a whole day to finish the work.","zh":"我们需要整整一天来完成这项工作。"},{"en":"The cup is still whole—not cracked.","zh":"杯子还是完整的——没有裂痕。"}]},{"partOfSpeech":"n.","definition":{"en":"the entire thing; everything considered together","zh":"整体；全部（作为一个整体来考虑）"},"examples":[{"en":"I like the painting as a whole.","zh":"我喜欢这幅画的整体效果。"},{"en":"The whole is greater than the sum of its parts.","zh":"整体大于部分之和。"}]}],"synonyms":["entire","complete","all","total","intact"],"phonetic":"/hoʊl/","extraExplanation":["你输入的“hewhole”很可能是想写 **the whole**（“整个/全部”），也可能是少打了一个空格。**whole** 常用来修饰名词（a whole day / the whole book）。","常见搭配：**as a whole**（总体上）、**the whole time**（一直）、**on the whole**（总体来说）。"]}
{"word":"hewing","summary":{"en":"Hewing means cutting or shaping wood/stone with strong blows, or (in “hew to”) strictly following rules or a plan.","zh":"hewing指用力砍削或凿刻木石；在“hew to”中则比喻严格遵守规则或计划。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of cutting or shaping something (especially wood or stone) with strong blows, usually using an axe or similar tool","zh":"（尤指用斧头等工具）用力劈砍、削凿（木头或石头）；砍削、凿刻"},"examples":[{"en":"The carpenter spent the afternoon hewing a log into beams.","zh":"木匠花了一下午把原木砍削成梁。"},{"en":"You can still see the tool marks from the hewing on the old stone steps.","zh":"你仍能在古老的石阶上看到凿刻留下的工具痕迹。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative, in the phrase “hew to”) strictly follow a rule, plan, or tradition","zh":"（比喻，用于短语“hew to”）严格遵守（规则、计划或传统）"},"examples":[{"en":"The judge insisted on hewing to the law, even when the case was emotional.","zh":"即使案件很容易引发情绪，法官仍坚持严格依法办事。"},{"en":"Our team is hewing to the original schedule to finish on time.","zh":"我们团队严格按原定进度推进，确保按时完成。"}]}],"synonyms":["chopping","cutting","carving","shaping","cleaving","following (hew to)","adhering (to)"],"phonetic":"/ˈhjuːɪŋ/","extraExplanation":["“Hew”是一个较古老、带文学色彩的动词，常见于历史叙述或正式写作中。现代日常口语里，具体动作更常用“cut/chop/carve”。","短语“hew to the line”原意来自砍削时沿着标线下刀，比喻做事不偏离原则或标准。"]}
{"word":"hewn","summary":{"en":"Hewn means cut or shaped roughly (often by hand) from wood or stone, or carved out of a material.","zh":"hewn 指（常手工）粗砍/凿削成形的，或指从木材、石头等材料中凿刻出来的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Past participle of “hew”: cut or shaped with strong, rough strokes (often with an axe), especially from wood or stone.","zh":"“hew”的过去分词：用力粗砍（常用斧头）把木头或石头砍削、凿削成形。"},"examples":[{"en":"The cabin was built from hand-hewn logs.","zh":"这间小木屋是用手工砍削成形的原木搭建的。"},{"en":"A hewn stone step led up to the old doorway.","zh":"一块凿削成形的石阶通向那扇老旧的门。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “hew”: (in passive voice) was cut or carved out of something, especially rock or wood.","zh":"“hew”的过去分词： （常用于被动）从某物（尤指岩石或木材）中凿出、砍出。"},"examples":[{"en":"The tunnel was hewn from solid rock.","zh":"这条隧道是在整块岩石中凿出来的。"},{"en":"The statue was hewn out of marble.","zh":"这座雕像是由大理石凿刻而成的。"}]}],"synonyms":["carved","cut","chiseled","fashioned","shaped"],"phonetic":"/hjun/","extraExplanation":["“hewn”常见于书面语或历史/文学语境，带有“粗犷、手工打造、原始质感”的意象，例如 hand-hewn（手工砍削的）。","固定搭配：hewn from / hewn out of（从……凿出/砍出）；hewn stone（凿制石料）。在《圣经》等经典文本里也常出现，例如“hewn stone”（凿成的石头），语体偏庄重古雅。"]}
{"word":"hews","summary":{"en":"Hews means “cuts/chops” or “shapes by cutting,” and in “hew to,” it means “follow closely.”","zh":"hews表示“砍/劈”或“通过切削凿刻来塑形”；在短语“hew to”中表示“严格遵守、坚持不偏离”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of hew) to cut or chop something, especially wood, with a strong tool like an axe.","zh":"（hew 的第三人称单数）用斧头等有力工具砍、劈（尤指木头）。"},"examples":[{"en":"He hews logs for the fireplace every winter.","zh":"他每年冬天都会劈柴生火。"},{"en":"The workers hew stone blocks for the old-style wall.","zh":"工人们凿（劈）石块来砌这种老式墙。"}]},{"partOfSpeech":"vt.","definition":{"en":"to shape or carve something by cutting pieces away.","zh":"通过削、凿、砍来塑形；雕刻成形。"},"examples":[{"en":"She hews the rough wood into a smooth beam.","zh":"她把粗糙的木头削成光滑的横梁。"},{"en":"The statue is hewn from a single piece of rock; the artist hews carefully.","zh":"这座雕像由一整块石头凿成；艺术家凿刻得很小心。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in the phrase “hew to”) to follow a rule, belief, or plan closely; to stick to it.","zh":"（用于短语“hew to”）严格遵守（规则/信念/计划）；坚持不偏离。"},"examples":[{"en":"The company hews to its values even during hard times.","zh":"即使在困难时期，这家公司也坚持自己的价值观。"},{"en":"She hews to the schedule so the project stays on track.","zh":"她严格按时间表执行，让项目保持进度。"}]}],"synonyms":["chops","cuts","carves","shapes","cleaves","adheres to (in hew to)","sticks to (in hew to)"],"phonetic":"/hjuːz/","extraExplanation":["“hew”是较偏书面或文学的动词，在日常口语里更常用cut、chop、carve。过去式/过去分词常见为hewed或hewn（更常见于被动：a hewn stone）。","常见搭配：hew down（砍倒）、hew out（凿出/开凿）、hew to the line（严格按规定办事）。文学或历史文本中常用来描写开荒、伐木、凿石等场景，带有“辛苦用力、原始工具”的画面感。"]}
{"word":"hewt","summary":{"en":"“Hewt” is a rare/nonstandard form related to “hew,” meaning “to cut or shape by chopping.”","zh":"“hewt”是与“hew”相关的罕见/非标准形式，表示“用砍削来切割或塑形”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard spelling (often dialect or older writing) of the past tense of “hew,” meaning “cut or shape (especially wood or stone) with an axe or other tool.”","zh":"“hew”的罕见/非标准拼写（常见于方言或较旧的写法），相当于过去式，意思是“（尤指用斧等工具）砍削、劈凿，把木头或石头削成形”。"},"examples":[{"en":"The cabin logs were hewt by hand, not cut by machine.","zh":"小木屋的原木是手工砍削成形的，不是机器切出来的。"},{"en":"He hewt a path through the brush with an axe.","zh":"他用斧头在灌木丛中劈出一条路。"}]}],"synonyms":["cut","chop","hack","carve"],"phonetic":"/hjuːt/","extraExplanation":["“hewt”在现代标准英语里几乎不用，常见的标准形式是：hew（原形）、hewed（过去式/过去分词）、hewn（更常见的过去分词，常见于固定搭配如“hand-hewn”=手工凿成的）。","如果你是在某篇文章/诗歌/旧文本里看到“hewt”，它多半是为了模仿口音、保留古风拼写，或是排版/拼写误差。"]}

