{"word":"hezekiah","summary":{"en":"Hezekiah is a biblical male name, especially known as a king of Judah in the Old Testament.","zh":"Hezekiah 是一个源自《圣经》的男性名字，尤以《旧约》中犹大王“希西家”最为人熟知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name from the Bible; also the name of a king of Judah in the Old Testament (Hezekiah), often associated with religious reforms and trust in God during crisis","zh":"一个源自《圣经》的男性名字；也指《旧约》中犹大国的一位国王“希西家”（Hezekiah），常与宗教改革以及在危机中对上帝的信靠联系在一起"},"examples":[{"en":"Hezekiah is a biblical name that some families still choose today.","zh":"Hezekiah 是一个圣经名字，有些家庭今天仍会选用。"},{"en":"In the Old Testament, Hezekiah is remembered as a king who tried to restore religious practices.","zh":"在《旧约》中，希西家常被记为一位试图恢复宗教礼仪的国王。"}]}],"synonyms":["King Hezekiah (as a reference to the biblical figure)"],"phonetic":"/ˌhɛzəˈkaɪə/","extraExplanation":["“Hezekiah”常见中文译名为“希西家”。这个名字源自希伯来语，常被解释为“耶和华使之坚强/耶和华加力量”（可理解为“上帝赐力量”）。","在英语里它通常作为专有名词使用：要么指具体历史/圣经人物（King Hezekiah），要么作为人名。书写时首字母一定要大写。"]}
{"word":"hezron","summary":{"en":"Hezron is a biblical male name, referring to a descendant of Judah and the family line linked to him.","zh":"Hezron 是《圣经》中的男性人名，指犹大支派的后裔，也可指与他相关的家族谱系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male personal name in the Bible (Hebrew Bible/Old Testament), used for a descendant of Judah; also the name of the clan/line associated with him in biblical genealogies.","zh":"《圣经》（希伯来圣经/旧约）中的男性人名，指犹大支派的后裔之一；也可指与他相关的宗族/家族谱系（见家谱记载）。"},"examples":[{"en":"Hezron appears in biblical genealogies as a descendant of Judah.","zh":"希斯仑（Hezron）在《圣经》的家谱中作为犹大的后裔出现。"},{"en":"The text mentions the sons of Perez, including Hezron and Hamul.","zh":"经文提到法勒斯的儿子，其中包括希斯仑（Hezron）和哈母勒。"}]}],"phonetic":"/ˈhɛz.rən/","extraExplanation":["Hezron 源自希伯来语人名，常见于《创世记》《民数记》《历代志》《路加福音》等家谱段落中。阅读这类名字时，重点通常不在“词义”，而在其家族关系与支派归属（例如犹大支派）。","英文里这是专有名词，通常首字母大写：Hezron。中文圣经译名常见为“希斯仑/希斯伦”等，具体写法可能随译本不同而略有差异。"]}
{"word":"hezronites","summary":{"en":"Hezronites = the descendants/clan of Hezron in the Bible, associated with the tribe of Judah.","zh":"Hezronites＝《圣经》中希斯仑的后裔／宗族名称，与犹大支派相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A clan or group of people descended from Hezron (a figure in the Hebrew Bible), mentioned as part of the tribe of Judah.","zh":"希斯仑（Hezron）的后裔／宗族；《圣经》中提到、属于犹大支派的一支族群。"},"examples":[{"en":"In the Book of Numbers, the Hezronites are listed among the clans of Judah.","zh":"在《民数记》中，希斯仑族（Hezronites）被列为犹大支派的宗族之一。"},{"en":"The term “Hezronites” refers to Hezron’s descendants rather than a modern nationality.","zh":"“Hezronites”指的是希斯仑的后代，而不是现代意义上的民族或国籍。"}]}],"synonyms":["descendants of Hezron","Hezron’s clan"],"phonetic":"/ˈhɛzrəˌnaɪts/","extraExplanation":["“Hezronites”主要出现在英文《圣经》语境里（如 Numbers《民数记》），属于族谱/支派清单中的族群名称。阅读时可把它理解为“某人的后裔（-ites）”。","英文后缀 -ites 常用来表示“某人的追随者或后代、某地的人”（如 Israelites 以色列人/以色列后裔）。因此 Hezronites = Hezron 的后代/家族。"]}

