{"word":"Hg","summary":{"en":"Hg is the chemical symbol for mercury.","zh":"Hg 是“汞（mercury）”的化学符号。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the chemical symbol for mercury (a metal element).","zh":"汞（化学元素“mercury”的符号）。"},"examples":[{"en":"The thermometer contains Hg, so handle it carefully.","zh":"温度计里含有汞（Hg），所以要小心处理。"},{"en":"Hg is toxic; avoid breathing the vapor.","zh":"汞（Hg）有毒；不要吸入其蒸气。"}]},{"partOfSpeech":"other","definition":{"en":"(spoken) the letters “H” and “G,” often used to refer to the chemical symbol Hg.","zh":"（口语）字母“H”和“G”，常用来指代化学符号Hg。"},"examples":[{"en":"In chemistry class, we write mercury as Hg (said “H-G”).","zh":"在化学课上，我们把汞写作Hg（读作“H-G”）。"}]}],"synonyms":["mercury","quicksilver"],"phonetic":"/ˌeɪtʃ ˈdʒiː/","extraExplanation":["Hg 来自拉丁语名称 hydrargyrum，意思是“水银/液态银”（hydro=水，argyrum=银），所以符号不是用 mercury 的首字母。","英语里 mercury 也指罗马神话中的信使神墨丘利（Mercury）；但化学元素名称与符号 Hg 的来源不同。"]}
{"word":"hg","summary":{"en":"Hg is the chemical symbol (and common scientific abbreviation) for mercury, seen often in terms like mmHg.","zh":"Hg 是元素“汞”的化学符号（也是常见科学缩写），常见于 mmHg 等表达中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the chemical symbol for mercury (a silvery liquid metal).","zh":"汞（mercury）的化学元素符号，一种银白色、常温下呈液态的金属。"},"examples":[{"en":"The thermometer contains Hg, so it must be handled carefully.","zh":"温度计里含有汞（Hg），所以必须小心处理。"},{"en":"Mercury’s symbol is Hg.","zh":"汞的元素符号是 Hg。"}]},{"partOfSpeech":"other","definition":{"en":"a short form used in science/medicine for “mercury,” especially in measurements like blood pressure (mmHg).","zh":"在科学/医学语境中表示“汞”的缩写，常见于计量单位中，如血压单位 mmHg（毫米汞柱）。"},"examples":[{"en":"His blood pressure was 120/80 mmHg.","zh":"他的血压是 120/80 mmHg（毫米汞柱）。"},{"en":"The lab report noted elevated Hg levels.","zh":"化验报告注明汞（Hg）含量偏高。"}]}],"synonyms":["mercury"],"phonetic":"ˌeɪtʃˈdʒiː","extraExplanation":["Hg 来自拉丁语名称 hydrargyrum，意思是“水银/液态的银”（hydro=水，argyrum=银）。因此英文里叫 mercury，但化学符号用 Hg。","汞具有毒性（尤其是汞蒸气与某些有机汞化合物）。含汞物品破损时一般不建议自行清理，应按当地规范处理。"]}
{"word":"HGH","summary":{"en":"HGH most commonly means human growth hormone, a hormone (and prescription drug) related to growth and tissue repair.","zh":"HGH 通常指人类生长激素，与生长和组织修复相关，也可指处方用的生长激素药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Human growth hormone: a hormone made by the pituitary gland (or manufactured as a drug) that helps the body grow and repair tissues; it is sometimes prescribed for certain medical conditions.","zh":"人类生长激素：由脑下垂体分泌（或以药物形式制造）的激素，帮助身体生长与修复组织；有时用于特定疾病的处方治疗。"},"examples":[{"en":"The doctor prescribed HGH for a child with a diagnosed growth hormone deficiency.","zh":"医生为确诊生长激素缺乏的孩子开了 HGH。"},{"en":"Some athletes have been banned for using HGH to try to improve performance.","zh":"一些运动员因使用 HGH 试图提升表现而被禁赛。"},{"en":"HGH therapy should be monitored closely because it can cause side effects.","zh":"HGH 治疗需要密切监测，因为可能有副作用。"}]},{"partOfSpeech":"other","definition":{"en":"(Informal, online) Used as an abbreviation for “human growth hormone” in fitness, bodybuilding, and medical discussions.","zh":"（非正式/网络用语）在健身、健美或医疗讨论中，作为“human growth hormone（人类生长激素）”的缩写使用。"},"examples":[{"en":"You’ll see “HGH” mentioned often on bodybuilding forums.","zh":"你会在健美论坛里经常看到 “HGH”。"},{"en":"Ask a healthcare professional before considering anything labeled HGH.","zh":"在考虑任何标注为 HGH 的产品前，先咨询医疗专业人士。"}]}],"synonyms":["growth hormone","somatotropin","human growth hormone"],"phonetic":"ˌeɪtʃ dʒiː ˈeɪtʃ","extraExplanation":["HGH 在医学上常指“重组人生长激素”（rhGH），用于少数明确适应症（如儿童生长激素缺乏、某些基因或疾病相关的生长问题等）；是否适用必须由医生评估。","在部分运动与健身圈里，HGH 也常被谈及为“增肌/减脂”的手段，但这类非医疗用途可能涉及健康风险与法律/体育规则问题。不同国家与赛事对其管制与处罚不一样。","读到 HGH 相关内容时，注意区分：正规处方药、所谓“保健品/增肌产品”营销话术，以及非法来源药物。"]}
{"word":"hgrnotine","summary":{"en":"“hgrnotine” is not a recognized English word; it is likely a typo or a non-word string. Please provide context or the intended spelling.","zh":"“hgrnotine”不是可识别的英语单词，可能是拼写错误或无意义字符串；请提供上下文或正确拼写。"},"extraExplanation":["“hgrnotine”看起来不像是常见英语单词，可能是拼写错误、用户名/代码，或是把字母顺序打乱了。","你可以：\n1) 检查是否想输入别的词（例如把字母重新核对一遍）；\n2) 提供一句包含它的英文句子或截图，我可以根据上下文帮你推测；\n3) 告诉我它出现的场景（课本、游戏、医学/化学名词、品牌名等）。","如果你愿意，也可以把你想表达的中文意思发我，我来帮你找最贴近的英文单词。"]}
{"word":"hgt","summary":{"en":"“hgt” most commonly means “height” as an abbreviation in forms or charts.","zh":"“hgt”最常见的意思是“height（高度/身高）”的缩写，多用于表格或记录中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) a written abbreviation for “height,” used in tables, forms, labels, or technical notes.","zh":"（缩写）“height（高度/身高）”的书面缩写，常见于表格、表单、标签或技术说明中。"},"examples":[{"en":"Please enter your hgt (cm) and weight (kg) on the form.","zh":"请在表格上填写你的身高（厘米）和体重（千克）。"},{"en":"The chart lists age, hgt, and blood pressure.","zh":"该图表列出了年龄、身高和血压。"}]}],"synonyms":["height"],"phonetic":"/eɪtʃ dʒiː tiː/","extraExplanation":["“hgt”不是日常英语里常见的单词，更像是空间有限时使用的缩写（比如医疗记录、统计表、软件字段名）。在正式写作中一般直接写 full form：height。","有时不同领域也可能把 “HGT/hgt” 用作其他缩写（含义会随上下文变化）。如果你能告诉我它出现的句子或场景，我可以帮你确认具体意思。"]}
{"word":"HGTV","summary":{"en":"HGTV is a U.S. home-and-garden TV network; informally it can also describe a trendy, TV-ready home design style.","zh":"HGTV是美国以家装与房产为主的电视频道；口语里也可用来形容“像HGTV节目里那样”的潮流、上镜的家居风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A U.S. cable TV network and brand focused on home improvement, real estate, renovation, and interior design shows (originally short for “Home & Garden Television”).","zh":"美国的有线电视频道与品牌，内容以家装、房产、翻新与室内设计类节目为主（最初是“Home & Garden Television”的缩写）。"},"examples":[{"en":"We watched HGTV to get ideas for renovating the kitchen.","zh":"我们看HGTV来找厨房翻新的灵感。"},{"en":"HGTV shows often feature home makeovers and house hunting.","zh":"HGTV的节目经常包含房屋改造和看房买房的内容。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective to describe a style that looks like it belongs on HGTV—clean, staged, and trendy (informal).","zh":"（非正式）用来形容一种“很像HGTV节目里的风格”——干净、精心布置、很潮的。"},"examples":[{"en":"Their living room looks so HGTV—neutral colors and modern lighting.","zh":"他们的客厅很HGTV风：中性色调加上现代灯具。"},{"en":"She wants an HGTV-ready bathroom before selling the house.","zh":"她想在卖房前把浴室弄得“上HGTV也不违和”。"}]}],"synonyms":["Home & Garden Television","home-improvement channel","home-renovation TV (informal)"],"phonetic":"/ˌeɪtʃ dʒiː tiː viː/","extraExplanation":["HGTV在美国流行文化里常被当作“家装灵感来源”的代名词，所以口语里说“HGTV-style / HGTV-ready”通常暗示房子被精心整理、拍照上镜、符合当下主流审美（如开放式厨房、白色橱柜、石英台面、简约现代等）。","缩写读法通常按字母念：H-G-T-V。作为品牌名，一般不加冠词（说“on HGTV”，而不是“on the HGTV”）。"]}
{"word":"hgwy","summary":{"en":"“hgwy” is not a standard English word; it’s likely an acronym or typo, and the meaning depends on context.","zh":"“hgwy”不是标准英文单词；更可能是缩写或拼写/输入错误，含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard string of letters; not a recognized English word in general use. It may be an acronym/initialism, a username, or a typo, and its meaning depends on context.","zh":"一串非标准英文词母组合；通常不算常见英文单词。可能是缩写/首字母词、用户名或输入错误，具体含义需看上下文。"},"examples":[{"en":"I saw “hgwy” in the chat, but I don’t know what it stands for.","zh":"我在聊天里看到“hgwy”，但我不知道它代表什么。"},{"en":"Could you share the full sentence where you found “hgwy”?","zh":"你能把出现“hgwy”的完整句子发我吗？"}]}],"phonetic":"/eɪtʃ dʒiː ˈdʌbəl.juː waɪ/","extraExplanation":["“hgwy”在常见英语缩写词典和日常网络用语里并不常见，因此很可能是：①某个社群/游戏里的内部缩写；②人名/账号缩写；③键盘误触或拼写错误。","如果你告诉我它出现的平台（短信、游戏、作业、路牌等）以及前后一句话，我可以更准确地判断它可能的意思。"]}

