{"word":"hg","summary":{"en":"Hg is the chemical symbol (and common scientific abbreviation) for mercury, seen often in terms like mmHg.","zh":"Hg 是元素“汞”的化学符号（也是常见科学缩写），常见于 mmHg 等表达中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the chemical symbol for mercury (a silvery liquid metal).","zh":"汞（mercury）的化学元素符号，一种银白色、常温下呈液态的金属。"},"examples":[{"en":"The thermometer contains Hg, so it must be handled carefully.","zh":"温度计里含有汞（Hg），所以必须小心处理。"},{"en":"Mercury’s symbol is Hg.","zh":"汞的元素符号是 Hg。"}]},{"partOfSpeech":"other","definition":{"en":"a short form used in science/medicine for “mercury,” especially in measurements like blood pressure (mmHg).","zh":"在科学/医学语境中表示“汞”的缩写，常见于计量单位中，如血压单位 mmHg（毫米汞柱）。"},"examples":[{"en":"His blood pressure was 120/80 mmHg.","zh":"他的血压是 120/80 mmHg（毫米汞柱）。"},{"en":"The lab report noted elevated Hg levels.","zh":"化验报告注明汞（Hg）含量偏高。"}]}],"synonyms":["mercury"],"phonetic":"ˌeɪtʃˈdʒiː","extraExplanation":["Hg 来自拉丁语名称 hydrargyrum，意思是“水银/液态的银”（hydro=水，argyrum=银）。因此英文里叫 mercury，但化学符号用 Hg。","汞具有毒性（尤其是汞蒸气与某些有机汞化合物）。含汞物品破损时一般不建议自行清理，应按当地规范处理。"]}
{"word":"hgrnotine","summary":{"en":"“hgrnotine” is not a recognized English word; it is likely a typo or a non-word string. Please provide context or the intended spelling.","zh":"“hgrnotine”不是可识别的英语单词，可能是拼写错误或无意义字符串；请提供上下文或正确拼写。"},"extraExplanation":["“hgrnotine”看起来不像是常见英语单词，可能是拼写错误、用户名/代码，或是把字母顺序打乱了。","你可以：\n1) 检查是否想输入别的词（例如把字母重新核对一遍）；\n2) 提供一句包含它的英文句子或截图，我可以根据上下文帮你推测；\n3) 告诉我它出现的场景（课本、游戏、医学/化学名词、品牌名等）。","如果你愿意，也可以把你想表达的中文意思发我，我来帮你找最贴近的英文单词。"]}
{"word":"hgt","summary":{"en":"“hgt” most commonly means “height” as an abbreviation in forms or charts.","zh":"“hgt”最常见的意思是“height（高度/身高）”的缩写，多用于表格或记录中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) a written abbreviation for “height,” used in tables, forms, labels, or technical notes.","zh":"（缩写）“height（高度/身高）”的书面缩写，常见于表格、表单、标签或技术说明中。"},"examples":[{"en":"Please enter your hgt (cm) and weight (kg) on the form.","zh":"请在表格上填写你的身高（厘米）和体重（千克）。"},{"en":"The chart lists age, hgt, and blood pressure.","zh":"该图表列出了年龄、身高和血压。"}]}],"synonyms":["height"],"phonetic":"/eɪtʃ dʒiː tiː/","extraExplanation":["“hgt”不是日常英语里常见的单词，更像是空间有限时使用的缩写（比如医疗记录、统计表、软件字段名）。在正式写作中一般直接写 full form：height。","有时不同领域也可能把 “HGT/hgt” 用作其他缩写（含义会随上下文变化）。如果你能告诉我它出现的句子或场景，我可以帮你确认具体意思。"]}
{"word":"hgwy","summary":{"en":"“hgwy” is not a standard English word; it’s likely an acronym or typo, and the meaning depends on context.","zh":"“hgwy”不是标准英文单词；更可能是缩写或拼写/输入错误，含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard string of letters; not a recognized English word in general use. It may be an acronym/initialism, a username, or a typo, and its meaning depends on context.","zh":"一串非标准英文词母组合；通常不算常见英文单词。可能是缩写/首字母词、用户名或输入错误，具体含义需看上下文。"},"examples":[{"en":"I saw “hgwy” in the chat, but I don’t know what it stands for.","zh":"我在聊天里看到“hgwy”，但我不知道它代表什么。"},{"en":"Could you share the full sentence where you found “hgwy”?","zh":"你能把出现“hgwy”的完整句子发我吗？"}]}],"phonetic":"/eɪtʃ dʒiː ˈdʌbəl.juː waɪ/","extraExplanation":["“hgwy”在常见英语缩写词典和日常网络用语里并不常见，因此很可能是：①某个社群/游戏里的内部缩写；②人名/账号缩写；③键盘误触或拼写错误。","如果你告诉我它出现的平台（短信、游戏、作业、路牌等）以及前后一句话，我可以更准确地判断它可能的意思。"]}
