{"word":"hl","summary":{"en":"“hl/HL” is usually an abbreviation; the most standard meaning is hL = hectoliter (100 liters), but it can mean other things depending on context.","zh":"“hl/HL”通常是缩写；最标准的含义是 hL=百升（100升），但也可能随语境表示其他意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) the letters “H” and “L,” often read aloud as “aitch-el.” Common meanings depend on context (for example, “hectoliter” in science, or “highlight” in informal notes).","zh":"（缩写）字母“HL/hl”，通常读作“aitch-el”。具体含义取决于语境（例如理科中表示“百升”，或在非正式记录里表示“重点/高亮”）。"},"examples":[{"en":"In the lab report, “hL” stands for hectoliter.","zh":"在实验报告中，“hL”表示百升。"},{"en":"I wrote “HL” next to the key points to mean “highlight.”","zh":"我在重点旁写了“HL”表示“高亮/重点标记”。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev., science/measurement) hectoliter (hL): a unit of volume equal to 100 liters.","zh":"（缩写，理科/计量）百升（hL）：一种体积单位，等于100升。"},"examples":[{"en":"The tank holds 2 hL of water.","zh":"这个水箱能装2百升的水。"},{"en":"Wine production is sometimes reported in hL.","zh":"葡萄酒产量有时用“百升（hL）”来统计。"}]}],"synonyms":["abbrev.","initialism","hL (hectoliter)"],"phonetic":"/eɪtʃ ɛl/","extraExplanation":["“hl/HL”本身不是一个固定单词，更像是“缩写/字母组合”，所以最可靠的方法是看出现的领域：\n- 理科、计量单位里常见的是 hL = hectoliter（百升）。注意大小写：L 表示 liter（升），所以通常写 hL。\n- 聊天、笔记或社交媒体里，HL 可能是个人自定义的标记（例如 highlight），也可能是特定圈子/游戏/课程的缩写。\n如果你能告诉我它出现在哪句话或哪个领域（聊天、作业、游戏、医学等），我可以给你更准确的解释。"]}
{"word":"hlaf","summary":{"en":"“hlaf” is an Old English form meaning “loaf; bread,” related to modern “loaf.”","zh":"“hlaf”是古英语形式，意为“面包（条/块）”，与现代英语“loaf”同源相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Old English word meaning “a loaf of bread; bread.”","zh":"古英语词，意为“面包的一条（面包块）；面包”。"},"examples":[{"en":"In Old English texts, “hlaf” refers to bread as a basic food.","zh":"在古英语文献中，“hlaf”指作为主食的面包。"},{"en":"A “hlaf” was often shared at meals, much like a loaf of bread today.","zh":"“hlaf”常在用餐时分食，类似今天分享一条面包。"}]}],"synonyms":["loaf","bread"],"phonetic":"/loʊf/","extraExplanation":["“hlaf”来自古英语（Old English）。在更早的拼写里，词首常见“hl-”（如 hlaf、hlud），后来在中古英语阶段逐渐简化，很多词不再发“h”。","它和现代英语 loaf（面包一条）有亲缘关系；另外，“lord”源自古英语 hlaford（字面义接近“守护面包的人”），而“lady”与 hlæfdige 相关（与“揉面/做面包”有关的词源解释常被提及）。这反映了面包在早期社会生活中的重要性。"]}
{"word":"hlaford","summary":{"en":"“Halford” is mainly a proper name (surname/place). It’s sometimes confused with “Halfords,” a UK retail chain.","zh":"“Halford”主要是专有名词（姓氏/地名），有时会和英国连锁店名“Halfords”混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) and sometimes a place name; used as a proper noun.","zh":"姓氏（也可作地名）；作为专有名词使用。"},"examples":[{"en":"My teacher’s last name is Halford.","zh":"我老师的姓是 Halford。"},{"en":"Dr. Halford will speak at the meeting tomorrow.","zh":"Halford 医生明天将在会议上发言。"}]},{"partOfSpeech":"other","definition":{"en":"(UK) “Halfords,” a well-known British chain store selling bicycles, car parts, and related services (often confused with “Halford”).","zh":"（英国）Halfords：英国知名连锁商店，主要销售自行车、汽车配件及相关服务（常被误写成 Halford）。"},"examples":[{"en":"I bought a bike lock at Halfords.","zh":"我在 Halfords 买了一把自行车锁。"},{"en":"Let’s get the car battery checked at Halfords.","zh":"我们去 Halfords 检查一下汽车电池吧。"}]}],"synonyms":["(none—proper name)"],"phonetic":"/ˈhæl.fərd/","extraExplanation":["“Halford”通常不是普通英语词汇，而是人名/地名拼写。你输入的“hlaford”很可能是拼写错误；常见的接近拼写包括“Halford”（人名）和“Halfords”（英国商店名）。","发音上，“Halford”重音在第一音节：HAL-ford。也有人把它写成“Half ord/half ford”，但在日常英语里它主要作为专有名词出现。"]}
{"word":"Hlakka","summary":{"en":"Hlakka is an Icelandic verb meaning “to look forward to” (often in the phrase hlakka til) or “to rejoice.”","zh":"Hlakka 是冰岛语动词，意思是“期待（常见搭配 hlakka til）”或“欢喜/高兴”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Icelandic) to look forward to something with happy anticipation; to be excited about what will happen.","zh":"（冰岛语）热切期待某事；对即将发生的事感到兴奋。"},"examples":[{"en":"Icelandic: I’m really looking forward to the trip. (Ég hlakka mikið til ferðarinnar.)","zh":"冰岛语：我非常期待这次旅行。（Ég hlakka mikið til ferðarinnar.）"},{"en":"She looks forward to seeing you tomorrow. (Hún hlakkar til að sjá þig á morgun.)","zh":"她期待明天见到你。（Hún hlakkar til að sjá þig á morgun.）"}]},{"partOfSpeech":"vi.","definition":{"en":"(Icelandic, less common) to rejoice; to be glad.","zh":"（冰岛语，较少见）欢喜；高兴。"},"examples":[{"en":"They rejoiced at the good news. (Þau hlökkuðu yfir góðu fréttunum.)","zh":"他们为这个好消息而欢喜。（Þau hlökkuðu yfir góðu fréttunum.）"}]}],"synonyms":["look forward to","anticipate","be excited","rejoice"],"phonetic":"/ˈlɑkə/","extraExplanation":["“Hlakka”更常见的固定搭配是 **hlakka til**（字面“向……欢喜/期待”），相当于英语 **look forward to**。","拼写开头的 **hl-** 在现代冰岛语里常对应一个英语没有的清音“l”音（接近 /ɬ/）。很多英语使用者会把它近似读成以 /l/ 开头。","如果你指的是人名/昵称 “Hlakka”（而不是冰岛语动词），请告诉我语境（比如在哪本书、游戏或哪种语言里看到的），我可以按那个来源解释。"]}
{"word":"hlakka","summary":{"en":"“hlakka” is not an established English vocabulary item; it likely comes from another language, a name, or a misspelling.","zh":"“hlakka”不是常见或规范的英语词汇；更可能是外来语转写、人名/地名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language (often seen as a transliteration).","zh":"不是标准英语词。可能是拼写错误、人名/地名，或来自其他语言的音译/转写形式。"},"examples":[{"en":"I couldn’t find “hlakka” in major English dictionaries—could you share a sentence where you saw it?","zh":"我在主要英语词典里找不到“hlakka”，你能给我它出现的句子吗？"},{"en":"If “hlakka” is a person’s name, its meaning depends on the original language and spelling.","zh":"如果“hlakka”是人名，它的含义通常取决于原始语言和具体拼写。"}]}],"phonetic":"/ˈhlɑːkə/","extraExplanation":["“hlakka”看起来更像是其他语言的词或转写形式（例如北欧语言/印度-雅利安语系/中东语言的转写等），但仅凭一个单词很难准确判断。你可以提供：1）它来自哪里（书、歌词、游戏、社交媒体等）；2）原文语言或同一段落里的其他词；3）是否可能是“lakka / hilla / hlakka”等近似拼写。这样我才能给出更可靠的释义、发音和用法。"]}
{"word":"hld","summary":{"en":"“HLD” is an abbreviation most commonly meaning “high-level design” in tech, and it can also mean “hyperlipidemia” in medical contexts.","zh":"“HLD”是缩写：在技术领域多指“高层设计”，在医疗语境中也可指“高脂血症/血脂异常”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) high-level design; an overview plan of a system that describes the main components and how they work together (often before detailed design).","zh":"（缩写）高层设计；对系统的整体方案/架构的概述，说明主要模块及其协作方式（通常在详细设计之前）。"},"examples":[{"en":"Before coding, the team wrote an HLD to agree on the system architecture.","zh":"在写代码之前，团队先写了一份 HLD 来统一系统架构。"},{"en":"The HLD shows the key services and the data flow between them.","zh":"这份 HLD 展示了关键服务以及它们之间的数据流。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., medicine) hyperlipidemia; a condition with high levels of fats (lipids) in the blood.","zh":"（缩写，医学）高脂血症/血脂异常；指血液中的脂肪（血脂）水平过高。"},"examples":[{"en":"His chart lists HLD and hypertension as ongoing problems.","zh":"他的病历把 HLD（高脂血症）和高血压列为长期问题。"},{"en":"Diet and exercise can help manage HLD.","zh":"饮食和运动有助于控制 HLD（高脂血症）。"}]}],"synonyms":["high-level design","system architecture (overview)","hyperlipidemia"],"phonetic":"/ˌeɪtʃ ɛl ˈdiː/","extraExplanation":["“HLD”通常按字母读作 /ˌeɪtʃ ɛl ˈdiː/。在不同领域含义差异很大：在软件工程里最常见是 High-Level Design；在医疗记录里也常用来指 hyperlipidemia。若你告诉我上下文（例如聊天记录、课程、文件），我可以帮你确认最准确的意思。"]}
{"word":"hleonian","summary":{"en":"“hleonian” is not a standard English word; it’s probably a misspelling or a fictional/proper name.","zh":"“hleonian”不是标准英语词；多半是拼写错误或虚构/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries. It is likely a misspelling or a made-up name (for example, a fictional people/group name or a username).","zh":"不是主要英语词典中的标准词。很可能是拼写错误，或是人为造的名称（例如虚构族群/组织名称或用户名）。"},"examples":[{"en":"I couldn’t find “hleonian” in a dictionary—can you share the sentence where you saw it?","zh":"我在词典里找不到“hleonian”——你能把看到它的句子发我吗？"},{"en":"In fantasy stories, authors sometimes invent words like “Hleonian” to name a nation or tribe.","zh":"在奇幻作品中，作者有时会造出像“Hleonian”这样的词来命名国家或部族。"}]}],"synonyms":["(no direct synonym; depends on intended word)"],"phonetic":"/hliˈoʊniən/","extraExplanation":["这个词看起来像“某地/某族的人”的形容词或名词（类似 *Canadian / Bostonian / Leonian* 这种结尾）。但开头的 **hl-** 在英语里很少见，常见情况是：\n1）拼写漏/多了字母（例如 *Helonian / Hellenian / Leonian* 等）；\n2）来自作品设定、游戏、同人或专有名词。\n\n如果你把原句、出处（书名/网页/游戏）或想表达的含义告诉我，我可以帮你判断最可能的正确拼法与意思。"]}
{"word":"hler","summary":{"en":"“hler” isn’t a recognized English word; it’s likely a typo or abbreviation.","zh":"“hler”不是标准英语单词；很可能是拼写错误或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“hler” is not a standard English word. It is most likely a typo, a username, or an abbreviation used in a specific context.","zh":"“hler”不是标准英语单词，更可能是拼写错误、用户名，或某个领域里特定的缩写。"},"examples":[{"en":"I couldn’t find “hler” in the dictionary—did you mean “healer” or “holder”?","zh":"我在词典里找不到“hler”——你是不是想写“healer（治疗者）”或“holder（持有者）”？"},{"en":"In this chat, “hler” looks like a typing mistake rather than an English word.","zh":"在这段对话里，“hler”看起来更像打字错误，而不是英语单词。"}]}],"extraExplanation":["你可以告诉我“hler”出现在哪个句子或哪种场景（游戏名、文件缩写、医学/工程术语等）吗？我就能更准确判断它的意思。常见的相近拼写有：healer（治疗者/治愈者）、holder（持有者/支架）、helper（帮助者）、hilar-（如 hilarious 的词根相关）。"]}
{"word":"hlid","summary":{"en":"“hlid” is not a common English word; it’s likely a typo, name, or abbreviation.","zh":"“hlid”不是常见英语词；更可能是拼写错误、名字或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as a typo, a username, or an abbreviation in a specific field.","zh":"不是标准英语单词；通常作为拼写错误、用户名，或某个领域里的缩写出现。"},"examples":[{"en":"I can’t find “hlid” in an English dictionary—did you mean “lid” or “hold”?","zh":"我在英语词典里找不到“hlid”——你是想写“lid（盖子）”还是“hold（拿住/举办）”吗？"},{"en":"The folder contains a file named “hlid_config.json.”","zh":"这个文件夹里有一个名为“hlid_config.json”的文件。"}]}],"phonetic":"/hlɪd/","extraExplanation":["“hl-”在英语词首非常少见，所以“hlid”大概率不是常规英语词。你可以告诉我：\n1）你在哪里看到它（句子/网页/游戏/技术文档）\n2）它周围的上下文（前后各一句）\n我就能更准确判断它是缩写、专有名词，还是你想查的其实是别的单词。"]}
{"word":"hlidhskjalf","summary":{"en":"Hlidskjalf is Odin’s high seat in Norse mythology, a throne that lets him see across all worlds.","zh":"Hlidskjalf 指北欧神话中奥丁的高座/王座，据说能让他看见所有世界。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Norse mythology) Odin’s high seat/throne in Asgard from which he can see all the worlds.","zh":"（北欧神话）奥丁在阿斯加德的高座/王座，据说坐在上面可以看见所有世界。"},"examples":[{"en":"In the myths, Odin sits on Hlidskjalf to look out over the Nine Worlds.","zh":"在神话里，奥丁坐在 Hlidskjalf 上眺望九界。"},{"en":"The story mentions how powerful the view from Hlidskjalf is.","zh":"故事提到从 Hlidskjalf 看到的景象有多么强大。"}]}],"synonyms":["Odin’s high seat","Odin’s throne"],"phonetic":"/ˈhliːdʃkjɑlf/","extraExplanation":["你输入的“hlidhskjalf”很像古诺尔斯语专名“Hliðskjálf”的一种不带重音符号的拼写；英文资料中也常见写法 Hlidskjalf / Hliðskjálf。","该词多见于《诗体埃达》《散文埃达》等北欧文献的英译与神话解读文章中；通常不翻译，直接作为专名使用。","在一些故事里，其他角色（如弗丽嘉等）也会暂时坐上这座高座，以获得“看见远方/洞察世界”的能力，这也让它常被用作“全知视角”的象征。"]}
{"word":"hliehhan","summary":{"en":"“hliehhan” is not a standard English word; it’s likely a misspelling or a proper name. Provide context and I can help identify it.","zh":"“hliehhan” 不是标准英文词，可能是拼写错误或专有名词；提供上下文我可以帮你判断它是什么。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“hliehhan” doesn’t match any common English word, phrase, or standard dictionary entry. It may be a typo, a name, or a word from another language.","zh":"“hliehhan” 不是常见的英文单词或固定表达，标准词典中也一般查不到。它可能是拼写错误、人名，或来自其他语言。"},"examples":[{"en":"Did you mean “Hallelujah” or “Leviathan”?","zh":"你是不是想写 “Hallelujah”（哈利路亚）或 “Leviathan”（利维坦）？"},{"en":"Can you share the sentence where you saw “hliehhan”?","zh":"你能把你看到 “hliehhan” 的完整句子发出来吗？"}]}],"extraExplanation":["请你确认一下：\n1) 这是从哪里看到的（书、歌词、游戏、聊天）？\n2) 是否有大小写（Hliehhan / HLIEHHAN）？\n3) 你想查的是发音、意思，还是是否拼错？\n\n如果你把上下文句子贴出来，我可以更准确地判断它可能是什么词，或最接近的英文拼写与含义。"]}
{"word":"hlinc","summary":{"en":"“hlinc” isn’t a standard English word; it’s likely an acronym or a misspelling (often of “link”).","zh":"“hlinc”不是标准英文词；更可能是缩写或拼写错误（常见是想写“link/链接”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely an acronym, username, brand name, or a misspelling of a similar-looking word (e.g., “link,” “HLink,” “HLIN”).","zh":"不是标准英语单词；更可能是缩写、用户名、品牌名，或是把相近词拼错了（如“link”“HLink”“HLIN”等）。"},"examples":[{"en":"I couldn’t find “hlinc” in a dictionary—do you mean “link”?","zh":"我在词典里找不到“hlinc”——你是不是想写“link”？"},{"en":"“HLINC” might be a company or program name in your context.","zh":"在你的语境里，“HLINC”可能是某个公司或项目名称。"}]}],"synonyms":["link (if that’s what you meant)"],"phonetic":"/eɪtʃ ɛl ɪ ɛn si/","extraExplanation":["“hlinc”不像常见英文词汇。如果你能提供一句包含它的原句、它出现的网站/软件、或你想表达的意思（例如“链接 link”还是某个缩写），我就能更准确地解释，并给出正确拼写、发音和用法。"]}
{"word":"hlithskjalf","summary":{"en":"Hlithskjalf is Odin’s high seat in Norse mythology, a throne linked with seeing or knowing all worlds.","zh":"Hlithskjalf 指北欧神话中奥丁的高座/王座，常与“俯瞰或洞察万界”的能力联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norse mythology) Odin’s high seat or throne in Asgard, from which he can see across all the worlds.","zh":"（北欧神话）奥丁在阿斯加德的高座/王座，据说坐在上面可以眺望（或洞察）所有世界。"},"examples":[{"en":"From Hlithskjalf, Odin watched over the Nine Worlds.","zh":"奥丁坐在 Hlithskjalf 上，俯瞰九界。"},{"en":"In some stories, whoever sits on Hlithskjalf gains a godlike view of everything.","zh":"在一些故事里，任何坐上 Hlithskjalf 的人都会获得近乎神明般的全知视野。"},{"en":"The author used “Hlithskjalf” as a symbol of absolute knowledge and power.","zh":"作者把“Hlithskjalf”用作绝对知识与权力的象征。"}]}],"synonyms":["Odin’s high seat","Odin’s throne","Hliðskjálf"],"phonetic":"/ˈhlɪðˌskjɑlf/","extraExplanation":["“Hlithskjalf”更常见的学术转写是古诺尔斯语 Hliðskjálf（也写作 Hlidskjalf / Hliðskjalf）。其中“skjalf/ skjalfr”与“平台、座位/高处”相关，因此常被译为“高座”“高位”“瞭望座”。","这个名词主要见于《诗体埃达》（Poetic Edda）与《散文埃达》（Prose Edda）的相关叙述：它不仅是奥丁的王座，也常被写成“坐上就能看见万物”的神话意象，在现代奇幻文学、游戏与影视里常被借用来表达“全视之座/全知视角”。","英语里这种词多用于神话、文学研究或奇幻语境，发音与拼写会因转写系统不同而变化；写作“Hlithskjalf”通常是为了方便不使用特殊字符“ð、á”等。"]}
{"word":"hlorrithi","summary":{"en":"“hlorrithi” is not recognized as a standard English word; it likely needs context or corrected spelling.","zh":"“hlorrithi”不是标准英语单词；很可能需要语境或修正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a made-up word; more context is needed to identify the intended meaning.","zh":"这不是标准英语单词，可能是拼写错误、人名或自造词；需要更多语境才能判断你想表达的意思。"},"examples":[{"en":"I couldn’t find “hlorrithi” in an English dictionary—could you share the sentence it’s from?","zh":"我在英语词典里找不到“hlorrithi”，你能把它所在的句子发给我吗？"},{"en":"If you meant a different word, try checking the spelling or telling me how it’s pronounced.","zh":"如果你想写的是另一个词，可以检查拼写，或告诉我它怎么读。"}]}],"extraExplanation":["“hlorrithi”看起来不像常见英语拼写（例如不常见的字母组合、缺少常见词缀）。如果它来自：\n1) 游戏/小说/二创作品：可能是虚构专有名词；\n2) 听写：可能把发音相近的词写错；\n3) 外语转写：可能是把别的语言音译成英文。\n\n你可以把以下信息给我，我就能更准确判断：它出现的完整句子、主题（聊天/游戏/作业/小说）、以及你想表达的中文意思或大致发音。\n\n（常见排查方式：把它拆开看是否是两个词、或检查是否想写类似“...-ity / ...-th / ...-ly”的词尾。）"]}
{"word":"hlott","summary":{"en":"“hlott” isn’t a common English word; it’s likely a typo (often “hot” or “lot”).","zh":"“hlott”不是常见英语词，通常是拼写错误（常见可能是“hot”或“lot”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/acronym.","zh":"不是标准英语单词。可能是拼写错误，或是人名/缩写。"},"examples":[{"en":"I couldn’t find “hlott” in an English dictionary—did you mean “hot” or “lot”?","zh":"我在英语词典里找不到“hlott”——你是不是想写“hot（热的）”或“lot（许多/一块地）”？"}]}],"phonetic":"/hlɑt/","extraExplanation":["“hlott”很可能是打字时多按了字母（例如在手机键盘上把“hot”打成“hlott”）。\n你可以告诉我：\n1）你看到它的句子/上下文；或\n2）你想表达的中文意思。\n我就能更准确地帮你确认词并解释用法。"]}
{"word":"hlqn","summary":{"en":"“hlqn” is not a recognized English word; it likely needs context (typo, code, or abbreviation).","zh":"“hlqn”不是常见英语单词；多半需要上下文判断（可能是拼写错误、代码或缩写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username, a code, or an abbreviation used in a specific community.","zh":"不是标准英语单词。可能是拼写错误、用户名、代码，或某个圈子里的缩写。"},"examples":[{"en":"I couldn’t find “hlqn” in a dictionary—can you share the sentence it appears in?","zh":"我在词典里找不到“hlqn”——你能把它出现的句子发我吗？"},{"en":"Sometimes a random-looking string like “hlqn” is an acronym or an ID, not a word.","zh":"有时像“hlqn”这种看起来随机的字符串是首字母缩写或编号，而不是单词。"}]}],"phonetic":"/hɛlkwɑn/","extraExplanation":["“hlqn”在常见英语词典与语料里通常没有词条。如果你是在聊天、游戏、社交媒体或作业里看到的，它很可能是：\n1）拼写打错（比如把相邻键按错）；\n2）缩写/暗语（某个群体内部用法）；\n3）人名/网名/项目代号；\n4）系统生成的编号。\n把上下文句子或你想表达的意思发来，我可以帮你判断最可能是哪一种。"]}
{"word":"hlucce","summary":{"en":"“hlucce” isn’t an English word; it’s likely a typo or a name. Share context and I’ll help identify the intended word.","zh":"“hlucce” 不是英语单词；更可能是拼写错误或人名。给我上下文我就能帮你判断你想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“hlucce” is not a recognized English word. It may be a misspelling or a name/term from another language. If you meant a different word, please tell me the context or the correct spelling.","zh":"“hlucce” 不是常见或可识别的英语单词，可能是拼写错误，或是来自其他语言的人名/术语。若你想查的是别的词，请提供上下文或正确拼写。"},"examples":[{"en":"I couldn’t find “hlucce” in an English dictionary—did you mean “success”?","zh":"我在英语词典里找不到 “hlucce”——你是不是想写 “success（成功）”？"},{"en":"Can you use the word in a sentence so I can help you identify it?","zh":"你可以把这个词放进一句话里吗？这样我能更好地帮你确认它是什么。"}]}],"phonetic":"/n/a/","extraExplanation":["从字母形状看，“hlucce” 可能是拼写误差。比较常见的接近词包括：\n- success（成功）\n- sauce（酱汁）\n- lucci / Luce（人名/姓氏，“Luce” 也可作名字，意大利语里有“光”的含义）\n如果你告诉我它出现的场景（聊天、游戏ID、课本、文章、歌词等），我可以更准确判断。"]}
{"word":"hlud","summary":{"en":"“hlud” is not a standard English word; it’s likely a misspelling (often of “loud”).","zh":"“hlud”不是标准英语单词；多半是拼写错误（常见是“loud”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or misspelling (often of “loud”).","zh":"不是标准英语单词。很可能是拼写错误（常见是把“loud”拼错）。"},"examples":[{"en":"I can’t find “hlud” in a dictionary—did you mean “loud”?","zh":"我在词典里找不到“hlud”——你是不是想写“loud”？"},{"en":"If you meant “loud,” you could say: “The music is too loud.”","zh":"如果你想表达“loud”，可以说：“The music is too loud.”（音乐太吵了。）"}]}],"phonetic":"/hlʌd/","extraExplanation":["“hlud”在现代英语中没有公认的词义与用法。最常见的情况是把“loud（吵闹的；大声的）”拼错了（字母顺序/多打了h）。\n你可以告诉我：你是在什么句子/语境里看到“hlud”的？我就能更准确判断你想要的词。"]}
{"word":"hlysnan","summary":{"en":"Not a standard English word; likely a typo or non-English/proper name. Share context to identify the intended term.","zh":"不是标准英语单词；更可能是拼写错误或非英语/专有名词。提供上下文可帮助确定你想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“hlysnan” is not a recognized English word in standard dictionaries. It may be a typo, a username, or a word from another language.","zh":"“hlysnan” 不是标准英语词典中可识别的单词，可能是拼写错误、用户名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “hlysnan” in an English dictionary—could you share the sentence it appears in?","zh":"我在英语词典里找不到 “hlysnan”——你能提供它出现的句子吗？"},{"en":"If you meant a different word, please check the spelling and try again.","zh":"如果你想查的是另一个词，请检查拼写后再试一次。"}]}],"phonetic":"/ˈeɪtʃ ɛl waɪ ɛs ɛn eɪ ɛn/","extraExplanation":["你可以把它出现的上下文（整句/截图/来源网站）发我，我可以帮你判断：是否是打字错误、缩写、专有名词，或是某个英语单词的乱序/误拼。","如果你是想查某个相近拼写的英语词，也可以告诉我你大概想表达的意思（例如“形容人很开心/很安静/很聪明”等），我会给出最可能的候选词。"]}
{"word":"hlysnere","summary":{"en":"A listener is someone who listens, especially an attentive audience member.","zh":"listener 指“听众/倾听者”，尤其是认真倾听的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who listens, especially someone paying attention to what is being said or played (music, radio, etc.)","zh":"听众；倾听者（尤指认真听别人说话或听音乐/广播的人）"},"examples":[{"en":"She is a good listener, so people often talk to her about their problems.","zh":"她很会倾听，所以人们常常跟她聊自己的烦恼。"},{"en":"The podcast has millions of listeners around the world.","zh":"这档播客在全球有数百万听众。"},{"en":"As a listener, you can ask questions at the end.","zh":"作为听众，你可以在最后提问。"}]}],"synonyms":["audience member","hearer","ear","attendee"],"phonetic":"/ˈlɪsənər/","extraExplanation":["你输入的“hlysnere”看起来像拼写错误；最接近、最常见的单词是“listener”。如果你原本想查别的词，请告诉我正确拼写或给个句子语境。","“listener”来自动词“listen（听）+ -er（表示人）”，意思是“做这件事的人”。在英语里，-er 很常用：teacher（老师）、runner（跑步者）。"]}
