{"word":"hnappian","summary":{"en":"Knappian usually means “related to Georg Friedrich Knapp or his state theory of money (Chartalism).”","zh":"Knappian通常指“与经济学家纳普或其国家货币论（Chartalism）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “Knappian”) relating to the German economist Georg Friedrich Knapp or his theory that money gets its value mainly from government authority (also called Chartalism).","zh":"（通常拼作“Knappian”）与德国经济学家格奥尔格·弗里德里希·纳普（Georg Friedrich Knapp）或其理论有关；该理论认为货币的价值主要来自政府权威（亦称“国家货币论/Chartalism”）。"},"examples":[{"en":"Some modern monetary theorists draw on a Knappian view of money.","zh":"一些现代货币理论家借鉴了纳普式（Knappian）的货币观。"},{"en":"In a Knappian framework, taxes help create demand for the state’s currency.","zh":"在纳普式框架下，税收有助于形成对国家货币的需求。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports Knapp’s ideas about money.","zh":"支持纳普货币理论的人；纳普学派的支持者。"},"examples":[{"en":"Knappians argue that state power is central to what makes something money.","zh":"纳普学派支持者认为，国家权力是“何以成其为货币”的关键。"}]}],"synonyms":["Chartalist","state-theory-of-money (related)"],"phonetic":"/ˈknæpiən/","extraExplanation":["你输入的“hnappian”在英语里不常见，更常见的拼法是 **Knappian**（首字母K）。如果你指的是其他词（例如人名、品牌名或特定领域术语），可以告诉我上下文（在哪篇文章/哪个句子里看到的），我可以更准确地解释。","背景补充：Knapp（1842–1926）在《国家货币论》（*The State Theory of Money*）中强调，货币之所以被接受，很大程度上来自国家规定（尤其是税收必须用该货币缴纳）。这类观点常在货币史、政治经济学与现代货币理论（MMT）的讨论中出现。"]}
{"word":"HNC","summary":{"en":"HNC usually means Higher National Certificate, a UK vocational qualification.","zh":"HNC 通常指英国的 Higher National Certificate（高等国家证书），一种职业导向资格证书。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Higher National Certificate: a UK vocational (career-focused) qualification, often studied at a college and sometimes used as a step toward a Higher National Diploma (HND) or a university degree.","zh":"（缩写）Higher National Certificate（英国高等国家证书）：一种英国的职业导向资格证书，通常在学院学习，可作为继续读 HND 或大学学位的衔接。"},"examples":[{"en":"She completed an HNC in Business before moving on to an HND.","zh":"她先完成了商业方向的 HNC，然后继续读 HND。"},{"en":"Many colleges offer an HNC in Engineering with part-time options for working adults.","zh":"很多学院提供工程类 HNC，并为在职成人提供非全日制选择。"}]}],"synonyms":["Higher National Certificate","H.N.C."],"phonetic":"/ˌeɪtʃ en ˈsiː/","extraExplanation":["在英国教育语境里，HNC 通常属于职业教育体系（偏实践），常见于苏格兰及英格兰/威尔士/北爱等地区的继续教育学院（college）。不同学校与专业的入学要求、学制与对应等级会有差异。写简历时常会写全称：Higher National Certificate (HNC)。"]}
{"word":"hnecca","summary":{"en":"“hnecca” isn’t a recognized English word; it’s probably a typo or acronym, so I need context to define it accurately.","zh":"“hnecca”不是常见英语词；可能是拼写错误或缩写，需要语境才能准确释义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, or acronym. I can’t give a reliable dictionary definition without more context.","zh":"不是标准英语单词；更可能是拼写错误、用户名或缩写。缺少语境时无法给出可靠的词典释义。"},"examples":[{"en":"I couldn’t find “hnecca” in an English dictionary—did you mean “henna” or “hence”?","zh":"我在英语词典里找不到“hnecca”——你想说的是“henna（指甲花染料）”还是“hence（因此）”吗？"},{"en":"If “HNECCA” is an acronym, please tell me what field it’s from (school, work, gaming, medicine, etc.).","zh":"如果“HNECCA”是缩写，请告诉我它来自哪个领域（学习、工作、游戏、医学等）。"}]}],"extraExplanation":["我可能需要你补充一点信息才能帮你：\n1）你是在什么场景看到/听到“hnecca”的？（一句话或截图也可以）\n2）它是人名/网名/产品名/公司名，还是你想拼写的英文单词？\n\n常见可能的目标词：\n- henna /ˈhɛnə/：指“指甲花（用于染发、纹身染料）”\n- hence /hɛns/：表示“因此；从此”\n- hench（henchman相关）：与“打手/党羽”有关（更偏书面/影视语境）"]}
{"word":"hnian","summary":{"en":"“hnian” isn’t a recognized English word; it’s likely a typo or incomplete form.","zh":"“hnian”不是可识别的英文单词，可能是拼写错误或不完整输入。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“hnian” is not a standard English word. It may be a misspelling or an incomplete typing (for example: “human,” “Hawaiian,” or “Hunan”).","zh":"“hnian”不是标准英文单词，可能是拼写错误或输入不完整（例如：human、Hawaiian、Hunan）。"},"examples":[{"en":"Did you mean “human”? If so, please type the full word.","zh":"你是想输入“human”吗？如果是，请把完整单词打出来。"},{"en":"I couldn’t find “hnian” in an English dictionary—could you check the spelling?","zh":"我在英文词典里找不到“hnian”——你可以检查一下拼写吗？"}]}],"extraExplanation":["“hnian”很像是漏打/错位的字母组合。你可以告诉我：你想表达的中文意思是什么，或者给我一个包含它的句子，我就能帮你锁定正确的英文单词并解释用法。"]}
{"word":"hnitu","summary":{"en":"“hnitu” isn’t an English word; it’s likely a typo. Share the context and I’ll identify the intended word.","zh":"“hnitu”不是英语单词，可能是拼写错误。提供上下文我可以帮你找出原本想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo or a misspelling.","zh":"不是标准英语单词，可能是拼写错误或打字错误。"},"examples":[{"en":"I couldn’t find “hnitu” in an English dictionary—did you mean “hitherto” or “unite”?","zh":"我在英语词典里找不到“hnitu”——你是不是想写“hitherto（迄今为止）”或“unite（团结/联合）”？"}]}],"extraExplanation":["“hnitu”很可能是键盘误触或字母顺序打乱（比如把“unite”写错）。你可以告诉我：1）你看到它的句子/上下文；2）你想表达的中文意思；3）是否可能是专有名词（人名/地名/用户名）。我就能更准确地帮你确认正确单词并解释。"]}
{"word":"hnod","summary":{"en":"“hnod” is not a recognized English word; it’s likely a typo. Provide context and I can help find the intended word.","zh":"“hnod”不是可识别的英文单词，可能是拼写错误。提供上下文我可以帮你找到想要的正确单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or random letters. If you meant another word, please share the sentence or the intended spelling.","zh":"不是标准英文单词；很可能是拼写错误或随机字母。若你想查的是其他单词，请提供句子或正确拼写。"},"examples":[{"en":"I can’t find “hnod” in a dictionary—did you mean “nod” or “hand”?","zh":"我在词典里找不到“hnod”——你是不是想写“nod（点头）”或“hand（手）”？"},{"en":"Please use it in a sentence so I can help you identify the correct word.","zh":"请把它放进一句话里，这样我可以帮你判断你想要的正确单词。"}]}],"phonetic":"—","extraExplanation":["“hnod”很可能是打字时手指错位或漏打/多打了字母。常见接近的英文词包括：\n- nod：点头；打盹（最接近 “hnod” 的后半部分）\n- hand：手（常见基础词）\n- hood：兜帽；引擎盖\n- honed：磨炼过的（hone 的过去式/过去分词）\n如果你告诉我你想表达的中文意思或给出上下文，我可以帮你锁定最可能的目标词并解释用法。"]}
{"word":"hny","summary":{"en":"“hny” is a casual texting abbreviation for “honey,” meaning “dear/sweetheart.”","zh":"“hny”是聊天中“honey”的缩写，表示“亲爱的/宝贝”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, texting) An abbreviation of “honey,” used as a term of affection for a loved one.","zh":"（非正式，短信/聊天）“honey”的缩写，用作对恋人或亲近之人的爱称（相当于“亲爱的/宝贝”）。"},"examples":[{"en":"Good night, hny. Sleep well.","zh":"晚安，hny。睡个好觉。"},{"en":"Miss you, hny—call me when you’re free.","zh":"想你了，hny——你有空就给我打电话。"}]}],"synonyms":["honey","hun","babe","sweetheart","dear"],"phonetic":"/ˈhʌni/","extraExplanation":["“hny”多见于短信、社交媒体或私聊，为了省字母而缩写；在正式写作中一般不用。","“honey”既可以表示“蜂蜜”，也常作亲昵称呼；用“hny”时通常只表达昵称含义。"]}

