{"word":"hoactzin","summary":{"en":"A hoatzin is a South American tropical bird famous for its unusual smell and leaf-eating habits.","zh":"hoatzin（麝雉）是南美洲热带鸟类，以特殊气味和吃叶子的习性著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical South American bird (the hoatzin) known for its strong, unusual smell and leaf-eating diet; its chicks have small claws on their wings.","zh":"麝雉（hoatzin）：一种生活在南美洲热带地区的鸟，以吃叶子为主，常带有明显的特殊气味；幼鸟翅膀上有小爪子。"},"examples":[{"en":"The hoatzin lives in the wetlands along the Amazon and Orinoco rivers.","zh":"麝雉生活在亚马孙河和奥里诺科河沿岸的湿地。"},{"en":"People sometimes call the hoatzin the “stinkbird” because of its smell.","zh":"人们有时把麝雉叫作“臭鸟”，因为它身上有股味道。"},{"en":"Hoatzin chicks can use their wing claws to help them climb.","zh":"麝雉幼鸟会用翅膀上的小爪子帮助攀爬。"}]}],"synonyms":["stinkbird"],"phonetic":"/hoʊˈætsɪn/","extraExplanation":["你输入的“hoactzin”更常见的拼写是 **hoatzin**（麝雉）。","词源来自南美洲的原住民语言（常被认为与圭亚那地区的语言有关），属于动物名称的音译/借词。"]}
{"word":"hoactzines","summary":{"en":"“Hoactzines” is probably a misspelling of **hoatzins**, the plural of **hoatzin** (a tropical Amazon bird).","zh":"“hoactzines” 很可能是 **hoatzins** 的拼写错误；**hoatzins** 是 **hoatzin（麝雉）** 的复数，指一种亚马逊地区的热带鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) a large tropical bird called a **hoatzin**, found in the Amazon region; the plural is **hoatzins**.","zh":"（可能是拼写错误）指一种大型热带鸟类 **hoatzin（麝雉）**，分布于亚马逊流域；复数为 **hoatzins**。"},"examples":[{"en":"We saw **hoatzins** resting in the trees near the river in the Amazon.","zh":"我们在亚马逊河附近看到**麝雉（hoatzins）**停在树上休息。"},{"en":"A **hoatzin** has a strong smell, so some people call it the “stinkbird.”","zh":"**麝雉（hoatzin）**气味很重，所以有人叫它“臭鸟”。"}]}],"synonyms":["hoatzins","stinkbird (nickname)"],"phonetic":"/hoʊˈætsɪn/","extraExplanation":["你输入的 **hoactzines** 在常见英语里几乎不出现；最接近的词通常是 **hoatzins**（麝雉的复数）。","麝雉以吃树叶为主，消化方式有点像反刍动物（会在体内发酵），这也与它的气味有关。","在自然写作里，**hoatzin** 有时被称为 “living fossil（活化石）”，但这是科普写作中的修辞说法，并不表示它真的“从未进化”。"]}
{"word":"hoactzins","summary":{"en":"Hoatzin: a South American tropical bird famous for its strong smell and wing-clawed chicks.","zh":"Hoatzin：南美热带鸟类麝雉，以气味浓烈和幼鸟翅爪著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical South American bird (Hoatzin hoazin) known for its strong smell and for chicks that have small claws on their wings","zh":"麝雉（南美热带鸟类，学名 Hoatzin hoazin），以气味浓烈著称；幼鸟翅膀上有小爪"},"examples":[{"en":"The hoatzin lives in wetlands and river forests in the Amazon region.","zh":"麝雉生活在亚马孙地区的湿地和河岸森林中。"},{"en":"Some people call the hoatzin the “stinkbird” because of its smell.","zh":"有人把麝雉叫作“臭鸟”，因为它身上有气味。"},{"en":"Hoatzin chicks can climb using tiny claws on their wings.","zh":"麝雉幼鸟可以用翅膀上的小爪攀爬。"}]}],"synonyms":["stinkbird (informal)"],"phonetic":"/hoʊˈætsɪn/","extraExplanation":["你输入的“hoactzins”很可能是拼写错误，更常见的拼法是 **hoatzins**（复数），单数是 **hoatzin**。","麝雉常被科普文章提到的原因之一是：幼鸟翅膀上的“爪”让人联想到远古鸟类/恐龙的特征，因此在自然历史类写作中很吸睛。","词源上来自当地语言的转写（并非传统拉丁/希腊词根），所以拼写看起来不太“英语化”。"]}
{"word":"hoagie","summary":{"en":"A hoagie is a long American sandwich on a split roll, especially associated with Philadelphia.","zh":"Hoagie 指一种夹馅的美式长面包三明治，尤以费城地区最常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long sandwich made with a split roll, usually filled with meats, cheese, and vegetables (common in the U.S., especially around Philadelphia).","zh":"（美式）长面包三明治；通常用切开的长面包夹肉类、奶酪和蔬菜（在美国费城一带特别常见）。"},"examples":[{"en":"I’ll have an Italian hoagie with lettuce, tomato, and oil.","zh":"我要一个意大利风味的长面包三明治，加生菜、番茄和橄榄油。"},{"en":"In Philly, people argue about where to get the best hoagie.","zh":"在费城，人们会争论哪家店的长面包三明治最好吃。"}]}],"synonyms":["sub","submarine sandwich","hero","grinder"],"phonetic":"/ˈhoʊɡi/","extraExplanation":["“Hoagie”是很有地域特色的说法：在美国不同地区，同一种长面包三明治可能叫sub、hero、grinder等。到费城及周边，说hoagie最自然。","词源常被认为与费城早期的意大利裔工人有关（常见说法是与“Hog Island”一带的工人午餐有关），但具体来源并非完全确定。"]}
{"word":"hoagies","summary":{"en":"“Hoagies” means more than one hoagie—a long, filled sandwich (similar to a sub).","zh":"“Hoagies”指多个 hoagie，即一种长面包夹馅三明治（类似 sub）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Long sandwiches made with a split roll filled with meats, cheese, and other toppings; the plural of “hoagie.”","zh":"长面包夹馅三明治（通常用切开的长面包夹肉、奶酪等）；“hoagie”的复数。"},"examples":[{"en":"We picked up hoagies for lunch on the way to the game.","zh":"我们去看比赛路上买了些长面包三明治当午饭。"},{"en":"In Philadelphia, many people call this kind of sandwich a hoagie.","zh":"在费城，很多人把这种三明治叫做 hoagie。"}]}],"synonyms":["subs","submarine sandwiches","heroes","grinders"],"phonetic":"/ˈhoʊɡi/","extraExplanation":["“Hoagie”是典型的美国地区用语，尤其常见于宾夕法尼亚州费城一带。其他地区更常说“sub / submarine sandwich”“hero”（纽约一带）或“grinder”（新英格兰一些地方）。","关于词源有多种说法：一种常见解释与费城的“Hog Island”（一战时期的造船厂）工人午餐三明治有关；不过具体起源并没有完全定论。"]}
{"word":"hoagy","summary":{"en":"A hoagy (more commonly spelled hoagie) is a US long sandwich, especially associated with Philadelphia.","zh":"hoagy（更常见拼作 hoagie）指美式长条三明治，尤其常与费城地区相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US) A long sandwich made with a sliced roll (often a sub roll), filled with meats, cheese, and vegetables.","zh":"（美式）长条三明治（常用长面包切开夹肉类、奶酪和蔬菜等）。"},"examples":[{"en":"I’ll have a turkey hoagy with lettuce and tomato.","zh":"我要一个火鸡长条三明治，加生菜和番茄。"},{"en":"In Philadelphia, many people call this kind of sandwich a hoagie.","zh":"在费城，很多人把这种三明治叫 hoagie。"}]}],"synonyms":["hoagie","sub","submarine sandwich","hero","grinder"],"phonetic":"/ˈhoʊɡi/","extraExplanation":["“hoagy”是“hoagie”的一种拼写变体，更常见的拼法是“hoagie”。主要流行于美国宾夕法尼亚州（尤其费城）一带。","它在全美常与“sub / submarine sandwich”“hero”（纽约一带）等词互换，但带有明显的地域色彩；点餐时用当地常用说法更自然。","词源常被认为与费城早期意大利移民及“Hog Island”（一战时期造船厂）工人午餐三明治的说法有关，但具体来源并非完全确定。"]}
{"word":"hoaming","summary":{"en":"“Hoaming” is usually a misspelling of “homing,” meaning ‘returning home/able to find home’ or ‘moving in on a target.’","zh":"“hoaming”通常是把“homing”拼错了；“homing”可指“回家/能归巢的”，也可指“逐步锁定目标（home in on）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most often a misspelling of “homing.”","zh":"不是标准英文单词；最常见是把 “homing” 拼错了。"},"examples":[{"en":"I think you meant “homing,” not “hoaming.”","zh":"我觉得你想写的是 “homing”，不是 “hoaming”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving toward home, or able to find its way back home (often used for animals, especially pigeons).","zh":"回家的；（尤指动物，如信鸽）有归巢能力的。"},"examples":[{"en":"A homing pigeon can return to its home from far away.","zh":"信鸽能从很远的地方飞回巢。"},{"en":"The homing instinct helps some animals find their way back.","zh":"归巢本能帮助一些动物找到回去的路。"}]},{"partOfSpeech":"v.","definition":{"en":"Moving closer to a target with increasing accuracy (commonly in the phrase “home in on”).","zh":"（常用于短语 “home in on”）逐步锁定目标、越来越精确地靠近/找出。"},"examples":[{"en":"The reporter homed in on the key problem during the interview.","zh":"记者在采访中逐步锁定了关键问题。"},{"en":"After a few tests, we homed in on the cause of the bug.","zh":"做了几次测试后，我们逐步找到了这个漏洞的原因。"}]}],"synonyms":["returning","homeward","tracking","zeroing in (on)"],"phonetic":"/ˈhoʊmɪŋ/","extraExplanation":["“homing”来自“home（家）”。常见搭配有：homing pigeon（信鸽）、homing instinct（归巢本能）、home in on（锁定/集中于）。","如果你本来想表达“到处走、漫游”，更可能是 “roaming”（而不是 homing）。可以告诉我你的句子，我帮你选最合适的词。"]}
{"word":"hoar","summary":{"en":"“Hoar” means (1) grayish-white, especially from age; or (2) a white frost (hoarfrost).","zh":"“hoar”既可指（1）因年老而灰白的，也可指（2）白霜/雾凇（hoarfrost）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Grayish white, especially with age (often said of hair or a beard); old and venerable.","zh":"（多指因年老而）灰白的；苍老而受尊敬的（常形容头发、胡须等）。"},"examples":[{"en":"The old man’s hoar beard made him look wise and solemn.","zh":"老人灰白的胡须让他看起来睿智而庄重。"},{"en":"She spoke in a hoar voice after shouting for hours.","zh":"她喊了好几个小时后，嗓音变得沙哑粗涩。"}]},{"partOfSpeech":"n.","definition":{"en":"A white, icy coating of tiny crystals that forms on surfaces in cold weather; hoarfrost.","zh":"（寒冷天气里形成在表面的）白霜；雾凇；霜花（即 hoarfrost）。"},"examples":[{"en":"In the morning, hoar covered the grass like sugar.","zh":"清晨，白霜像糖一样覆在草地上。"},{"en":"The branches glittered with hoar under the streetlights.","zh":"树枝在路灯下覆着白霜，闪闪发亮。"}]}],"synonyms":["gray","grey","white-haired","aged","venerable","hoarfrost","frost"],"phonetic":"/hɔr/","extraExplanation":["“hoar”带有较强的文学/古典色彩，常见于描写自然或岁月感的文字里；日常英语更常说“gray/grey”“white-haired”，而“hoar/hoary”更有“苍老、古老、庄严”的氛围。","“hoarfrost”里的“hoar-”本义是“灰白的”，强调霜呈白色；因此“hoar”作名词时常与“frost”相关，用来营造寒冷清冽的意象。","常见搭配：hoar beard（白胡子）、hoar hair（白发）、hoar voice（沙哑的声音）、hoary old（年迈/古老的）。文学中有时会见到“hoar frost（白霜）”这样的写法。"]}
{"word":"hoard","summary":{"en":"“Hoard” means to keep a large amount of something, often secretly and selfishly; as a noun, it means a hidden or stored collection, often valuable.","zh":"“hoard”指（常因担心将来需要而）大量囤积、藏起来（常含自私或不愿分享的意味）；作名词指隐藏或储存的一大批物品/宝藏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to collect and keep a large amount of something (often secretly), usually because you are afraid you might need it later","zh":"（常指因担心将来需要而）大量囤积、储藏（常带有隐瞒或不愿分享的意味）"},"examples":[{"en":"During the storm, some people hoarded bottled water and canned food.","zh":"暴风雨期间，有些人囤积瓶装水和罐头。"},{"en":"He tends to hoard old newspapers even though he never reads them again.","zh":"他总爱囤积旧报纸，尽管他再也不会读。"}]},{"partOfSpeech":"n.","definition":{"en":"a large amount of something that has been hidden or stored away, often something valuable","zh":"（常指被隐藏或储存起来的）一大批（贵重）物品；宝藏；藏品"},"examples":[{"en":"The hikers discovered a hoard of ancient coins.","zh":"徒步者发现了一批古代硬币。"},{"en":"She donated her hoard of vintage postcards to the local museum.","zh":"她把自己收藏的一大批复古明信片捐给了当地博物馆。"}]}],"synonyms":["stockpile","stash","accumulate","store"],"phonetic":"/hɔrd/","extraExplanation":["“hoard”通常带一点负面色彩，暗示“过度占有、不愿分享”，区别于更中性的“store/stock（储存/备货）”或更积极的“save（存钱/节省）”。","在新闻或社会话题中常见搭配：hoard supplies（囤积物资）、hoard money（囤钱）、hoarding behavior（囤积行为）。在心理健康语境里，“hoarding disorder”指“囤积障碍”（一种持续难以丢弃物品的状况）。"]}
{"word":"hoard and profiteer","summary":{"en":"stockpile excessively; make unfair gains by exploiting shortages or crises","zh":"过度囤积；利用短缺或危机牟取不当利益"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to collect and keep a large amount of something (often secretly), usually because you fear you may need it later","zh":"（常指因担心短缺而）大量囤积、私藏（东西），往往带有隐秘或不合理的感觉"},"examples":[{"en":"During the storm warning, some people hoarded bottled water and batteries.","zh":"暴风雨预警期间，有些人囤积瓶装水和电池。"},{"en":"She hoarded old letters because they meant a lot to her.","zh":"她把旧信都珍藏起来，因为那些对她意义重大。"}]},{"partOfSpeech":"n.","definition":{"en":"a large supply that has been stored up, often hidden away","zh":"（常指暗中存下的）储藏物；囤积的一大批东西"},"examples":[{"en":"The police found a hoard of stolen electronics in the garage.","zh":"警方在车库里发现了一批被盗的电子产品。"},{"en":"Archaeologists uncovered a hoard of ancient coins.","zh":"考古学家发掘出一批古代钱币。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who makes money unfairly or selfishly by raising prices or exploiting shortages, crises, or disasters","zh":"（利用短缺、危机或灾难）哄抬价格、牟取暴利的人"},"examples":[{"en":"The city warned profiteers not to resell masks at extreme prices.","zh":"市政府警告投机倒把者不要以离谱高价倒卖口罩。"},{"en":"In wartime, profiteers often try to exploit fear and scarcity.","zh":"在战争时期，牟取暴利者常试图利用恐惧和短缺。"}]},{"partOfSpeech":"v.","definition":{"en":"to make an unfair or excessive profit, especially by exploiting a difficult situation","zh":"（尤指趁乱）牟取暴利；投机发财"},"examples":[{"en":"Some vendors tried to profiteer from the disaster by doubling food prices.","zh":"一些商贩试图趁灾难把食品价格翻倍来牟利。"},{"en":"The new rules aim to stop companies from profiteering off shortages.","zh":"新规旨在阻止企业利用短缺牟取暴利。"}]}],"synonyms":["stockpile","stash","squirrel away","amass","accumulate","price-gouge","exploit","cash in","rake in","make a killing"],"phonetic":"/hɔrd ænd ˌprɑfəˈtɪr/","extraExplanation":["语气区别：hoard 侧重“囤积/私藏”（不一定违法，但常让人觉得不合理）；profiteer 侧重“利用他人困境牟利”（通常带强烈道德批评）。","常见搭配：hoard food/money/supplies；war/disaster profiteer；profiteer from/off a crisis（从危机中牟利）。"],"etymology":"“hoard”来自古英语，原指“宝藏、储藏”，后来引申为“把东西大量存起来”。“profiteer”由“profit（利润）”加后缀“-eer”（表示从事某种活动的人）构成，常带贬义，指靠不正当方式赚钱。","mnemonic":["hoard 听起来像“hold（拿住）+ a lot”：把很多东西“拿住不放”。","profiteer = profit（利润）+ -eer（某类人/行为）：专门“追利润”的人，但通常是趁火打劫那种。"]}
{"word":"hoarded","summary":{"en":"“Hoarded” means collected and kept too much of something (past tense of hoard), often for private use; it can also describe items that were stored away.","zh":"“Hoarded”指“囤积了；私藏了”（hoard 的过去式/过去分词），常暗示过量占有；也可作形容词表示“被囤起来的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of hoard) to collect and keep a large amount of something, often more than you need, sometimes in secret.","zh":"（hoard 的过去式/过去分词）囤积；大量收集并保留某物，常常超过需要，有时带有隐秘性。"},"examples":[{"en":"During the storm, some people hoarded bottled water.","zh":"暴风雨期间，有些人囤积瓶装水。"},{"en":"He hoarded old newspapers for years and couldn’t throw them away.","zh":"他把旧报纸囤了很多年，怎么也舍不得扔。"},{"en":"The company hoarded cash instead of investing it.","zh":"这家公司把现金囤着不投资。"}]},{"partOfSpeech":"adj.","definition":{"en":"Stored away or kept in a hidden/private place (describing something that has been hoarded).","zh":"被储藏/被私藏的（形容被囤积起来的东西）。"},"examples":[{"en":"They found hoarded supplies in the back room.","zh":"他们在后屋发现了被囤起来的物资。"},{"en":"The report mentioned hoarded goods being sold at high prices.","zh":"报告提到囤货被高价售卖。"}]}],"synonyms":["stockpiled","stashed","saved up","amassed","stored"],"phonetic":"/ˈhɔrdɪd/","extraExplanation":["“hoard”通常比“save（存/省）”更负面，暗示“超过需要”“不愿分享”或“害怕不够用”。比如：save money（存钱）很中性/积极；hoard money（囤钱）可能暗示过度占有。","在公共事件（如灾害、疫情）语境里，hoard 常用来批评“抢购囤积（panic buying）”。常见搭配：hoard food/water/toilet paper; hoard supplies; hoard cash."]}
{"word":"hoarder","summary":{"en":"A hoarder is someone who keeps or stores too many things and has difficulty getting rid of them; it can also mean a person/animal that stores supplies for later.","zh":"hoarder 指囤积者：保存或储存过多物品且难以丢弃的人；也可指为以后而储存物资的人或动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who keeps and collects a large amount of things (often more than they need), and finds it hard to throw them away.","zh":"囤积者；爱把大量物品（常常超出需要）收起来、很难丢弃的人。"},"examples":[{"en":"My uncle is a hoarder—his garage is full of old newspapers and broken chairs.","zh":"我叔叔是个囤积者——他的车库里堆满了旧报纸和坏椅子。"},{"en":"The show focuses on hoarders who need help cleaning their homes safely.","zh":"这个节目聚焦需要帮助、以安全方式清理家里的囤积者。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or animal that stores something in large amounts for future use.","zh":"（为将来使用而）大量储存某物的人或动物。"},"examples":[{"en":"Squirrels are hoarders that hide nuts for the winter.","zh":"松鼠是储存者，会把坚果藏起来过冬。"},{"en":"During shortages, some hoarders buy more supplies than they can use.","zh":"在物资短缺时，有些人会过量囤货，买超过自己能用的用品。"}]}],"synonyms":["collector","accumulator","pack rat"],"phonetic":"/ˈhɔrdɚ/","extraExplanation":["“hoarder”常带有负面含义，暗示囤积已经影响生活与安全（如通道被堵住、卫生风险）。在医学与心理健康语境中常见“hoarding disorder（囤积障碍）”，指持续难以丢弃物品并导致居住空间严重受影响。日常更中性的说法可用“collector（收藏家）”，强调有选择、有整理的收集。"]}
{"word":"hoarders","summary":{"en":"Hoarders are people who keep too many things and struggle to throw them away; it can also refer to the TV show “Hoarders.”","zh":"Hoarders 指囤积者：囤太多东西且难以丢弃的人；也可指电视节目《囤积者》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who keep and collect too many things, often more than they need, and find it hard to throw things away.","zh":"囤积者；（常指）囤东西太多、超过需要且很难丢弃物品的人。"},"examples":[{"en":"The apartment was unsafe because the hoarders had blocked the exits with piles of boxes.","zh":"那间公寓很不安全，因为囤积者用一堆箱子堵住了出口。"},{"en":"Her family tried to help, but the hoarders in the house refused to throw anything away.","zh":"家人想帮忙，但家里的囤积者什么都不肯扔。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often a title/label) The TV show or a group being discussed as “Hoarders,” focusing on extreme clutter and cleanup.","zh":"（常作标题/标签）《囤积者》等相关电视节目名称，或讨论中指代“囤积者”这一群体（多与极度杂乱和清理相关）。"},"examples":[{"en":"She watched Hoarders and felt motivated to start decluttering.","zh":"她看了《囤积者》之后，开始更有动力做整理了。"},{"en":"The episode of Hoarders showed how hard it can be to change long-term habits.","zh":"《囤积者》的一集展示了改变长期习惯有多难。"}]}],"synonyms":["collectors (neutral)","pack rats (informal)","people who hoard","accumulators"],"phonetic":"/ˈhɔrdərz/","extraExplanation":["“hoarder”来自动词 hoard（囤积、储藏）。日常语境里 hoarder 既可中性（比如“囤优惠券的人”），也常带负面含义，暗示物品过多影响生活。","在心理健康语境中，可能涉及“囤积障碍”（hoarding disorder）。更尊重、非评判的表达可以用：a person with hoarding disorder（有囤积障碍的人）。"]}
{"word":"hoarding","summary":{"en":"Hoarding means keeping too many things, often more than you need; it can also describe the act of hoarding.","zh":"Hoarding 指囤积、堆积过多物品（常超过需要）；也可表示“正在囤积”的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of collecting and keeping a large amount of things (often more than you need), especially in a way that is hard to control","zh":"囤积；大量收集并保存物品的行为或习惯（常常超过需要，且可能难以控制）"},"examples":[{"en":"During the pandemic, some people started hoarding toilet paper and canned food.","zh":"在疫情期间，有些人开始囤积卫生纸和罐头食品。"},{"en":"Her family worried that her hoarding was making the apartment unsafe.","zh":"她的家人担心她的囤积行为让公寓变得不安全。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “hoard”; keeping a large amount of something for future use","zh":"“hoard”的现在分词；为将来使用而把大量东西存起来、藏起来"},"examples":[{"en":"He is hoarding cash because he feels uncertain about the economy.","zh":"他在囤现金，因为他对经济感到不确定。"},{"en":"Stop hoarding snacks—share some with your classmates.","zh":"别囤零食了——分一些给同学吧。"}]}],"synonyms":["stockpiling","accumulating","storing","saving up"],"phonetic":"/ˈhɔrdɪŋ/","extraExplanation":["“hoarding”在日常语境里常带负面含义，暗示“过度、占用空间、影响他人或难以停止”。在心理健康语境中，它也可能指“囤积障碍”（hoarding disorder），是一种需要专业帮助的状况，用词时对当事人保持尊重会更合适，比如说：She is struggling with hoarding rather than She is crazy.","常见搭配：hoarding behavior（囤积行为）、compulsive hoarding（强迫性囤积）、food/medicine hoarding（囤食物/药品）、data hoarding（“囤数据”，指保存大量数据不舍得删）。"]}
{"word":"hoarding and cornering","summary":{"en":"buying up and controlling supply to create scarcity and raise prices","zh":"通过囤积并控制供给制造短缺、抬高价格"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the practice of buying and storing large amounts of goods (hoarding) and then controlling most of the supply (cornering) in order to create scarcity and raise prices","zh":"囤积并垄断货源：大量购买并储存商品（囤积），再控制大部分供给（垄断/操纵市场），以制造稀缺并抬高价格"},"examples":[{"en":"During the crisis, the government warned against hoarding and cornering of rice and cooking oil.","zh":"在危机期间，政府警告不要囤积并垄断大米和食用油。"},{"en":"The investigation found evidence of hoarding and cornering to manipulate prices.","zh":"调查发现了通过囤积并垄断货源来操纵价格的证据。"},{"en":"People accused the wholesaler of hoarding and cornering essential medicines.","zh":"人们指责那家批发商囤积并垄断必需药品。"}]}],"synonyms":["stockpiling","price manipulation","market manipulation","monopolization","supply control","profiteering"],"phonetic":"ˈhɔrdɪŋ ænd ˈkɔrnərɪŋ","extraExplanation":["在新闻与政策语境里，这个短语常带强烈负面评价，暗含“借机牟利”“扰乱市场”。","“cornering”在这里不是“把某人逼到墙角”的日常含义，而是“corner the market（垄断/操纵某种商品的市场）”的缩略用法。"],"etymology":"“hoard”源自古英语，原意为“储藏/宝藏”；“corner (the market)”来自英语中“把对手逼到角落”的比喻，用于指通过买入控制供给来“垄断市场/操纵行情”。两者并列时常见于经济与法律语境，指人为制造短缺、抬价的行为。","mnemonic":["hoard≈“货(ho-)”一直“囤”着：联想“囤货”。","corner the market=把市场“逼到角落里”，让别人买不到，只能按你定的价买。"]}
{"word":"hoardings","summary":{"en":"Hoardings are large outdoor advertising boards or temporary barriers around construction sites (especially in British English).","zh":"Hoardings 指大型户外广告牌，或施工工地周围的临时围挡（多见于英式英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large boards or panels used to display advertisements, especially outdoors (common in British English).","zh":"（尤指英式英语）户外大型广告牌、广告看板。"},"examples":[{"en":"They put up new hoardings along the highway to advertise the movie.","zh":"他们在高速公路旁竖起新的广告看板来宣传这部电影。"},{"en":"The city wants to limit hoardings in historic areas.","zh":"市政府想限制历史街区里的大型广告牌。"}]},{"partOfSpeech":"n.","definition":{"en":"A temporary fence or barrier around a building site, used to block off an area and keep people safe (also common in British English).","zh":"（工地周围的）临时围挡、隔离板，用来封闭区域并保障安全（英式用法常见）。"},"examples":[{"en":"The sidewalk was diverted because of the hoardings around the construction site.","zh":"人行道因为施工围挡而改道了。"},{"en":"Posters were pasted on the hoardings outside the renovation project.","zh":"装修工程外的围挡上贴满了海报。"}]}],"synonyms":["billboards","advertising boards","posters (on panels)","construction barriers","temporary fencing"],"phonetic":"/ˈhɔrdɪŋz/","extraExplanation":["“hoardings”是复数形式，单数是“hoarding”。在美式英语里，表示“广告牌”更常说“billboard”；表示“工地围挡/临时围栏”常说“construction fence / barrier”。"]}
{"word":"hoards","summary":{"en":"Hoard(s) means a large hidden/saved collection of valuables, or the act of saving/collecting too much (often secretly).","zh":"hoards 可指“藏起来/存起来的大量贵重物品（宝藏、储藏物）”，也可指“（常带隐秘或过量意味的）囤积”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Large hidden or saved collections of valuable things (like money, food, or treasure).","zh":"（名词复数）大量被藏起来或存起来的贵重物品（如钱、食物或宝物）的集合。"},"examples":[{"en":"Archaeologists discovered hoards of ancient coins under the house.","zh":"考古学家在房子下面发现了成堆的古代硬币宝藏。"},{"en":"During the famine, some families kept hoards of grain in secret.","zh":"饥荒期间，有些家庭秘密囤积了大量粮食。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) Saves or collects a large amount of something, often in a secretive way or more than is needed.","zh":"（动词第三人称单数）大量保存或收集某物，常带有隐秘或超出需要的意味（囤积）。"},"examples":[{"en":"He hoards old newspapers and can’t throw them away.","zh":"他囤着旧报纸，怎么也舍不得扔。"},{"en":"She hoards snacks in her desk drawer for long meetings.","zh":"她在办公桌抽屉里囤零食，留着开长会时吃。"},{"en":"The company hoards data without clearly explaining why.","zh":"这家公司囤积数据，却没有清楚说明原因。"}]}],"synonyms":["stores","stockpiles","reserves","caches","accumulates","stashes"],"phonetic":"/hɔrdz/","extraExplanation":["注意不要和 **hordes** 混淆：**hoards** 指“囤积的财物/囤积行为”，而 **hordes** 指“（人或动物的）大群、大批”。例如：*hordes of tourists*（一大群游客） vs. *hoards of coins*（一批金币宝藏）。","词源提示：*hoard* 原本有“宝藏/储藏”的意思，所以常用于“把东西存起来、藏起来”。在现代语境中也常带一点负面色彩，暗示“存太多、不愿分享或不必要”。"]}
{"word":"hoardward","summary":{"en":"“Hoardward” is not a standard English word; it’s probably a misspelling or a name/username.","zh":"“hoardward”不是标准英文单词；多半是拼写错误或用作名字/网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a made-up form (often intended to be “hoard” or a name/username).","zh":"不是常见词典中的标准英文单词；很可能是拼写错误或自造词（常见意图可能是“hoard”或用作姓名/网名）。"},"examples":[{"en":"I can’t find “hoardward” in a dictionary—did you mean “hoard” (to save too many things)?","zh":"我在词典里找不到“hoardward”——你是不是想写“hoard”（囤积、存太多东西）？"},{"en":"If “Hoardward” is a username or character name, its meaning depends on the creator.","zh":"如果“Hoardward”是用户名或角色名，它的含义取决于创作者。"}]}],"phonetic":"/ˈhɔrd.wərd/","extraExplanation":["“hoard”作动词/名词都很常见：v. 囤积；n. 藏品、囤积物。常见搭配：hoard food/money；a hoard of coins（钱币宝藏）。","如果你想表达“向……方向”，英语里有后缀“-ward/-wards”（如 toward(s), northward）。但“hoardward”并不是常见组合。","也可能是把“hardware（硬件）”或“boardwalk”等词拼错了。你可以告诉我你看到它的句子/上下文，我可以更准确判断。"]}
{"word":"hoared","summary":{"en":"Hoared is a literary word meaning “covered with frost” or “made gray/white,” often used for winter scenes or age.","zh":"hoared 是文学用语，常指“覆有白霜”或“变得灰白”，多用于描写冬景或年老。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Covered with hoar frost; whitened by frost.","zh":"（文学用语）覆有白霜的；被霜染白的。"},"examples":[{"en":"The fields lay hoared in the early morning cold.","zh":"清晨寒气里，田野一片覆霜雪白。"},{"en":"A hoared branch glittered in the winter light.","zh":"覆霜的树枝在冬日光线下闪闪发亮。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Made gray or white, especially with age; hoary.","zh":"（文学用语）变得灰白的（尤指因年老）；白发苍苍的。"},"examples":[{"en":"His hoared hair showed how many winters he had seen.","zh":"他灰白的头发显示出他经历了多少个寒冬。"},{"en":"They spoke of hoared legends from long ago.","zh":"他们谈起久远年代里“蒙尘发白”的古老传说。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of the rare verb “hoar”: to become gray/white or to be covered with frost.","zh":"罕见动词 hoar 的过去式/过去分词：变灰白；结霜。"},"examples":[{"en":"Overnight, the grass hoared under a sudden cold snap.","zh":"一夜之间，突然降温让草地结了一层白霜。"}]}],"synonyms":["frosted","rimed","hoary","gray","whitened"],"phonetic":"/hɔrd/","extraExplanation":["“hoared”多见于诗歌或较旧的文学文本中，日常英语更常说“frost-covered / frosty”或用“hoary（灰白的、古老的）”。","hoar 的本义与“灰白、霜白”有关，所以既能写“hoared with frost（覆霜）”，也能写“hoared hair（白发）”，带有一种冷冽、古老、时间流逝的意象。"]}
{"word":"hoarfrost","summary":{"en":"Hoarfrost is a white, icy crystal coating that forms on surfaces when water vapor freezes onto them.","zh":"hoarfrost 指白霜：水汽在寒冷表面直接凝华形成的白色冰晶薄层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin, white coating of ice crystals that forms on cold surfaces when water vapor in the air freezes directly onto them (often on clear, cold nights).","zh":"（白霜）在寒冷表面上形成的一层薄薄的白色冰晶，通常在晴朗寒冷的夜晚，空气中的水汽直接凝华冻结在物体表面。"},"examples":[{"en":"In the morning, hoarfrost covered the grass like a white blanket.","zh":"清晨，草地上覆着白霜，像铺了一层白毯。"},{"en":"The trees glittered with hoarfrost in the early light.","zh":"晨光里，树上结着白霜，闪闪发亮。"}]}],"synonyms":["frost","white frost"],"phonetic":"/ˈhɔrˌfrɔst/","extraExplanation":["“hoar-”在古英语里有“灰白、苍白、老”的意思，所以 hoarfrost 指那种“灰白色的霜”。它和普通说的 frost（霜）接近，但 hoarfrost 更强调“冰晶般、羽毛状/针状”的外观，常见于清冷、少风、天空晴朗的环境。","常见对比：hoarfrost（白霜，水汽直接凝华成冰晶）不同于 dew（露水，凝结成液态水）；也不同于 rime（雾凇，多由过冷雾滴撞到物体上结冰，常在有雾和风的情况下形成）。"]}
{"word":"hoarfrosted","summary":{"en":"covered with a white layer of frost crystals","zh":"覆有白霜（霜花）的一层"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with hoarfrost (a thin white layer of ice crystals that forms on cold surfaces).","zh":"覆有白霜的；结着霜花的（表面形成一层白色冰晶）。"},"examples":[{"en":"The hoarfrosted grass glittered in the early morning light.","zh":"结着白霜的草在清晨的光里闪闪发亮。"},{"en":"We walked through a hoarfrosted field, careful not to slip.","zh":"我们走过一片结霜的田地，小心别滑倒。"}]}],"synonyms":["frost-covered","frosty","ice-crusted","rime-covered","hoary"],"phonetic":"/ˈhɔrˌfrɔstɪd/","extraExplanation":["hoarfrost 指在晴朗、寒冷且常常无风的夜里，水汽直接在物体表面凝华成冰晶（不是先变成水再结冰）。常见于草地、屋顶、树枝。","文学描写中常用 hoarfrosted 来营造清冷、静谧、银白的冬晨画面。"],"etymology":"来自 hoarfrost（“白霜、霜花”）。hoar 原意与“灰白、老态”有关（如 hoary“灰白的”），因为白霜呈灰白色；后与 frost 组合指“覆盖在表面的霜晶”。-ed 表示“被……覆盖/具有……的”。","mnemonic":["把 hoar 记成“灰白/白发（hoary）”，想象清晨万物“白了一层”，就是结霜。","hoar + frost = “白霜”；hoarfrosted = “被白霜覆盖的”。"]}
{"word":"hoarfrosts","summary":{"en":"Hoarfrosts are white ice-crystal coatings that form on surfaces when water vapor freezes onto them.","zh":"hoarfrosts 指水汽直接在物体表面冻结形成的白色冰晶霜（霜华/白霜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A white, feathery coating of ice crystals that forms on cold surfaces (like grass, windows, or leaves) when water vapor in the air freezes directly onto them, usually overnight.","zh":"（霜华/白霜）指在寒冷表面（如草地、窗户、树叶）上形成的白色、羽毛状冰晶，多在夜间由空气中的水汽直接凝结并冻结而成。"},"examples":[{"en":"In the morning, hoarfrosts covered the fields like a thin white blanket.","zh":"清晨，田野上布满霜华，像铺了一层薄薄的白毯。"},{"en":"The car windows were decorated with hoarfrosts after the temperature dropped below freezing.","zh":"气温降到冰点以下后，车窗上结出了霜华般的冰晶花纹。"}]}],"synonyms":["frost","white frost","rime"],"phonetic":"/ˈhɔrˌfrɔst/","extraExplanation":["“hoar-”在古英语里有“灰白、发白”的意思，常用来形容“白发苍苍”（如 hoary）。所以 hoarfrost 这个词带有一点诗意：像“白发”一样的霜，强调那种白而细的冰晶质感。","hoarfrost 和普通的 frost（霜）很接近，但 hoarfrost 更强调“从空气中的水汽直接凝华成冰晶”的过程与外观；而 dew（露水）是液态水，fog（雾）是悬浮水滴。"]}
{"word":"hoarhead","summary":{"en":"Hoarhead is a literary word meaning a gray/white-haired head, or an elderly person.","zh":"hoarhead 是偏文学的词，指白发的头，也可指老人/长者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hoary (gray- or white-haired) head; often used to mean an elderly person, especially in a respectful or poetic way","zh":"白发的头；（常带敬意或诗意地）指老人、长者"},"examples":[{"en":"The village listened respectfully to the hoarhead’s advice.","zh":"村里的人恭敬地听那位长者的建议。"},{"en":"In the old poem, the traveler returns home with a hoarhead and many memories.","zh":"在那首古诗里，旅人带着白发与许多回忆归乡。"}]}],"synonyms":["hoary head","gray head","elder","old person"],"phonetic":"/ˈhɔrˌhɛd/","extraExplanation":["“hoar-”来自古英语，意思是“灰白、霜白”，常见于 hoarfrost（白霜）和 hoary（灰白的；年老的）。因此 hoarhead 带有一种“像霜一样变白”的形象，语气偏文学或古风，日常英语里更常说 gray hair / white hair 或 an elderly person。"]}
{"word":"hoarheaded","summary":{"en":"Hoarheaded means gray- or white-haired, especially in a literary way that suggests old age and dignity.","zh":"hoarheaded 指“白发的、年老的”，多见于文学语境，常带“苍老而庄重”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Having gray or white hair; old and venerable in appearance.","zh":"（文学用语）白发的；年老而显得庄重/可敬的。"},"examples":[{"en":"The hoarheaded shepherd leaned on his staff and watched the flock.","zh":"那位白发的牧羊人倚着手杖，看着羊群。"},{"en":"A hoarheaded man sat quietly by the window, telling stories of the past.","zh":"一位白发老人静静地坐在窗边，讲述往昔的故事。"}]}],"synonyms":["gray-haired","white-haired","elderly","aged","venerable"],"phonetic":"/ˈhɔrˌhɛdɪd/","extraExplanation":["“hoar-”本义与“灰白、霜白”有关（可联想到 hoarfrost=白霜），所以 hoarheaded 形象地表示“头发像霜一样发白”。","这个词带有较强的文学/古风色彩，现代日常英语更常用 gray-haired, white-haired, elderly, an old man 等。","在文学作品中，hoarheaded 常用来强调“年迈、阅历与庄重感”，语气通常偏敬重，而不是单纯描述年龄。"]}
{"word":"hoarhound","summary":{"en":"Hoarhound is a bitter herb traditionally used in cough remedies, and it can also mean candy/lozenges flavored with that herb.","zh":"Hoarhound 指一种苦味草本（传统用于止咳等），也可指用它调味的止咳糖/含片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bitter mint-family herb (usually white horehound) traditionally used in cough drops, teas, and herbal remedies","zh":"一种味苦的薄荷科草本植物（常指白苦薄荷/白霍香），传统上用于止咳糖、茶饮和草药疗法"},"examples":[{"en":"My grandma swears by hoarhound candy for a sore throat.","zh":"我奶奶很信止咳用的苦薄荷糖，喉咙痛时就吃。"},{"en":"The tea tasted bitter, but hoarhound is often used in old-fashioned cough remedies.","zh":"这茶很苦，但苦薄荷常用于传统的止咳偏方。"}]},{"partOfSpeech":"n.","definition":{"en":"a flavored lozenge or candy made with hoarhound, often used to soothe coughs","zh":"用苦薄荷调味的含片/糖（常用于缓解咳嗽）"},"examples":[{"en":"He bought a bag of hoarhound from the old general store.","zh":"他从老杂货店买了一袋苦薄荷糖。"},{"en":"Some people still prefer hoarhound lozenges to menthol cough drops.","zh":"有些人到现在仍更喜欢苦薄荷含片，而不是薄荷醇止咳糖。"}]}],"synonyms":["horehound","white horehound","herbal lozenge","cough drop"],"phonetic":"/ˈhɔrˌhaʊnd/","extraExplanation":["“Hoarhound”常见于美国和英国的“传统止咳糖/草药”语境里；它的味道通常被描述为苦、带草本香。","拼写上常见变体有 horehound（更常见）与 hoarhound；指植物时多为 white horehound（学名 Marrubium vulgare）。"]}
{"word":"hoarier","summary":{"en":"Hoarier is the comparative form of hoary: more gray/white with age, more frosty, or more ancient/old-fashioned.","zh":"Hoarier 是 hoary 的比较级：更灰白（因年老）、更有霜的，或更古老/更陈旧的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more gray or white with age; having whiter hair","zh":"（因年老而）更灰白的；（头发）更花白的"},"examples":[{"en":"He looked hoarier after the long winter, his beard almost white.","zh":"漫长的冬天过后，他看起来更花白了，胡子几乎全白。"},{"en":"In the photo, her father appears hoarier than I remembered.","zh":"在照片里，她父亲看起来比我记得的更灰白。"}]},{"partOfSpeech":"adj.","definition":{"en":"more covered with frost; having more hoarfrost","zh":"（被霜）覆盖得更多的；霜更重的"},"examples":[{"en":"The fields grew hoarier as the temperature dropped overnight.","zh":"夜里气温下降，田野上的霜变得更重了。"},{"en":"By dawn, the branches were hoarier, glittering in the pale light.","zh":"到拂晓时，树枝上的霜更厚了，在微光中闪闪发亮。"}]},{"partOfSpeech":"adj.","definition":{"en":"more old-fashioned or ancient; older and more time-worn (often used about traditions, stories, or ideas)","zh":"更古老的；更陈旧（常用于传统、故事或观念）"},"examples":[{"en":"It’s a hoarier legend than most people realize, told for centuries.","zh":"这是个比多数人意识到的更古老的传说，流传了几个世纪。"}]}],"synonyms":["grayer","whiter","more frost-covered","older","more ancient","more timeworn"],"phonetic":"/ˈhɔriɚ/","extraExplanation":["“hoarier”是形容词“hoary”的比较级，意思是“更……的”。“hoary”来自古英语，核心意象是“灰白、发白”。因此它既可以形容人的白发（年老），也可以形容“hoarfrost（白霜）”覆盖的景象。","在文学或较正式的语境里，“hoary”也常带有“古老、年代久远”的感觉，例如“hoary tradition（古老的传统）”。现代口语中更常用“older / ancient / timeworn / gray-haired”等表达。"]}
{"word":"hoariest","summary":{"en":"“Hoariest” means “the most hoary”: extremely old/ancient, very gray or white with age, or (literary) covered with frost.","zh":"“Hoariest”是“hoary”的最高级：意为“最古老的/最陈旧的”、或“最花白的”，文学中也可指“覆霜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely old; ancient; having existed for a very long time.","zh":"极其古老的；年代久远的；存在很久的。"},"examples":[{"en":"The village has hoariest traditions that go back hundreds of years.","zh":"这个村庄有着极其古老的传统，可追溯到数百年前。"},{"en":"It’s one of the hoariest problems in philosophy: What is truth?","zh":"这是哲学中最古老的问题之一：什么是真理？"}]},{"partOfSpeech":"adj.","definition":{"en":"Gray or white with age; (especially of hair) white and old-looking.","zh":"因年老而灰白的；（尤指头发）花白的、显老的。"},"examples":[{"en":"A hoariest man with a white beard sat by the window.","zh":"一位白胡子的老者坐在窗边。"},{"en":"She described her grandfather’s hoariest hair in the old photos.","zh":"她描述了老照片里祖父花白的头发。"}]},{"partOfSpeech":"adj.","definition":{"en":"Covered with frost; frosty; gray-white like frost (literary).","zh":"覆霜的；结霜的；像霜一样灰白的（文学用法）。"},"examples":[{"en":"The field looked hoariest at dawn, glittering with frost.","zh":"黎明时田野覆着白霜，闪闪发亮。"},{"en":"Hoariest branches hung over the quiet road.","zh":"覆霜的树枝垂在寂静的路上。"}]}],"synonyms":["most ancient","age-old","venerable","timeworn","gray-haired","frosty"],"phonetic":"/ˈhɔriəst/","extraExplanation":["“Hoariest”是形容词“hoary”的最高级形式，意思是“最……的”。“Hoary”来自表示“霜”的词源，所以除了“古老的、白发的”，也常带有“像霜一样灰白”的文学色彩。","常见固定搭配：the hoariest of myths（最古老的神话之一）、hoary old man（白发苍苍的老人）、hoary tradition（古老传统）。","文学里“hoary”常用来营造苍老、庄重或冬日清冷的意象，比如“hoary hills/hoary beard/hoary frost”。"]}
{"word":"hoarily","summary":{"en":"Hoarily means “in a hoary (gray-white or frost-covered) way,” and by extension, “in an aged/timeworn way” (literary).","zh":"hoarily 指“呈霜白/灰白的样子”，并可引申为“显得苍老、古旧”（偏文学）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hoary way; with a gray-white look (as if covered with frost or age).","zh":"以“灰白/霜白”的样子；呈现出像覆霜或因年岁而变白的感觉。"},"examples":[{"en":"The fields looked hoarily white at dawn after a sudden cold snap.","zh":"一阵骤冷之后，黎明时田野看起来霜白一片。"},{"en":"His beard hung hoarily against his coat collar.","zh":"他的胡子灰白地垂在大衣领口旁。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Literary) In an aged or timeworn manner; suggesting great age.","zh":"（文学用法）以显得苍老或历经岁月的方式；带有“古老、久远”的意味。"},"examples":[{"en":"The old stone wall rose hoarily from the fog.","zh":"古老的石墙从雾中苍然显现。"},{"en":"The legend was told hoarily, as if it had been repeated for centuries.","zh":"这个传说讲得古旧沧桑，仿佛已被重复了几个世纪。"}]}],"synonyms":["frostily","grayly","whitely","anciently (literary)"],"phonetic":"/ˈhɔrəli/","extraExplanation":["“hoarily”来自形容词“hoary”，原意与“霜（hoar frost）”有关，因此常用来描写清晨霜白的景象；后来也引申为“白发苍苍、古老久远”。","这是偏文学/描写性的副词，日常口语更常用“frosty/gray/with frost”来表达类似意思。"]}
{"word":"hoariness","summary":{"en":"Hoariness means gray-white appearance (especially hair) or a poetic sense of great age and timeworn oldness.","zh":"Hoariness 指（尤指头发）灰白的样子，也可诗意地指“古老、饱经岁月”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The grayish-white color or appearance of something (often hair), or the state of being gray with age.","zh":"（常指头发）灰白的颜色或样子；（因年老而）变灰白的状态。"},"examples":[{"en":"The hoariness of his beard made him look older than he was.","zh":"他胡子的灰白让他看起来比实际年龄更大。"},{"en":"She accepted the hoariness of her hair as a natural part of aging.","zh":"她把头发变灰白看作衰老中很自然的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"A feeling or quality of great age, often used in a poetic way to describe something ancient or timeworn.","zh":"（诗意用法）古老、久远的气息或特质；饱经岁月的感觉。"},"examples":[{"en":"There was a hoariness to the stone walls, as if they had watched centuries pass.","zh":"石墙带着一种古老的气息，仿佛见证了几个世纪的流逝。"},{"en":"The story’s hoariness gave it the charm of an old legend.","zh":"这个故事的古老感让它有一种古老传说的魅力。"}]}],"synonyms":["grayness","whiteness","oldness","antiquity"],"phonetic":"/ˈhɔɹinəs/","extraExplanation":["“hoariness”来自“hoar”（灰白的、白霜般的）。英语里“hoar”也常出现在诗歌或较文学的表达中，例如“hoar frost”（白霜）。因此“hoariness”除了指头发变白，也常用来营造“岁月久远、古旧苍茫”的意境。","注意与“whore”（妓女）发音和拼写不同；“hoary/hoariness”与“gray/greyness”意思接近，但更偏文学、带“如霜般灰白/古老”的色彩。"]}
{"word":"hoarinesses","summary":{"en":"“Hoarinesses” means multiple instances of hoariness: gray-white signs of age, or a frostlike whiteness.","zh":"“hoarinesses”指“hoariness”的复数：多处/多种“灰白老态”，或“如霜般的霜白”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being hoary: gray or white with age; old age shown in hair or appearance.","zh":"（头发或外表）因年老而变灰白的状态；显出老态。"},"examples":[{"en":"The hoarinesses of the villagers’ hair showed how many years they had lived through.","zh":"村民们头发的灰白显示出他们经历了多少年岁。"},{"en":"In the portrait, the man’s hoarinesses made him look wise and weathered.","zh":"在画像中，这个男人的灰白之态让他看起来睿智而饱经风霜。"}]},{"partOfSpeech":"n.","definition":{"en":"A grayish-white, frostlike appearance; a whiteness resembling hoarfrost.","zh":"（像霜一样的）灰白色外观；霜白感。"},"examples":[{"en":"At sunrise, a thin hoarinesses covered the grass in the valley.","zh":"日出时，山谷里的草地覆着一层淡淡的霜白。"},{"en":"The window had hoarinesses around the edges on the coldest mornings.","zh":"最冷的清晨，窗户边缘会出现一圈霜白。"}]}],"synonyms":["grayness","whiteness","frostiness","age","senescence"],"phonetic":"/ˈhɔrɪnəsɪz/","extraExplanation":["“hoarinesses”是名词复数，单数是“hoariness”。它来自形容词“hoary”，常见两种含义：①“头发灰白、年老的”；②“结霜的、霜白的”（如“hoarfrost/白霜”）。写作中“hoary”有时也引申为“古老的、陈旧的”（如“a hoary tradition/古老传统”）。"]}
{"word":"hoarish","summary":{"en":"Hoarish means ‘gray/white with age’ or ‘covered with frost,’ and it’s mostly seen in literary or descriptive writing.","zh":"hoarish 指“因年老而灰白/显得苍老”，也可指“覆有白霜”；多用于文学或描写性语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Gray or white with age; looking old or timeworn.","zh":"（因年老而）灰白的；显得苍老的、古旧的。"},"examples":[{"en":"His hoarish beard made him look older than he was.","zh":"他那灰白的胡子让他看起来比实际年龄更大。"},{"en":"A hoarish figure sat quietly by the window, reading.","zh":"一个显得苍老的身影安静地坐在窗边读书。"}]},{"partOfSpeech":"adj.","definition":{"en":"Covered with frost; frosty (often used in literary descriptions of nature).","zh":"覆有白霜的；霜白的（常见于文学描写）。"},"examples":[{"en":"The fields looked hoarish in the early morning light.","zh":"清晨的光里，田野一片霜白。"},{"en":"Hoarish grass sparkled as the sun rose.","zh":"太阳升起时，结霜的草闪闪发亮。"}]}],"synonyms":["hoary","gray","grizzled","frosty","rimed"],"phonetic":"/ˈhɔrɪʃ/","extraExplanation":["“hoarish”来自“hoar”（意为“灰白的、霜白的”），所以它既可以形容“白发/苍老”，也可以形容“白霜”。现代英语里“hoarish”不算常用，更常见的是“hoary”。","文学里常见搭配有“hoar frost”（白霜、雾凇）和“hoary old”（年迈的、古老的）。注意“hoar/hoary”在这里与“whore”（妓女）完全无关，拼写和发音不同。"]}
{"word":"hoarness","summary":{"en":"Hoarseness means a rough, raspy voice.","zh":"Hoarseness 指“声音沙哑、粗哑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “hoarseness”) a rough, raspy voice, often caused by irritation, illness, or overusing the voice.","zh":"（通常拼作“hoarseness”）声音沙哑、粗哑，常由喉咙受刺激、生病或过度用嗓引起。"},"examples":[{"en":"I woke up with hoarseness and a sore throat.","zh":"我醒来时声音沙哑，喉咙也痛。"},{"en":"Too much shouting can cause hoarseness.","zh":"喊得太多会导致声音沙哑。"},{"en":"Her hoarseness got better after she rested her voice.","zh":"她让嗓子休息后，沙哑好多了。"}]}],"synonyms":["raspiness","husky voice","voice strain"],"phonetic":"/ˈhɔrsnəs/","extraExplanation":["你输入的“hoarness”在英语里更常见、标准的拼法是 **hoarseness**（沙哑）。","相关词：**hoarse**（adj. 沙哑的）→ **hoarseness**（n. 沙哑）。","常见搭配：have hoarseness / develop hoarseness（出现沙哑），voice hoarseness（声音沙哑）。","小提醒：如果沙哑持续两周以上，英语语境里常会建议“see a doctor / see an ENT (ear, nose, and throat) doctor”。"]}
{"word":"hoars","summary":{"en":"“Hoar” means grayish white (often from age) or refers to white frost (hoarfrost). “Hoars” is usually an inflected form of “hoar.”","zh":"“hoar”表示“灰白的（常因年老）”，也可指“白霜/霜花（hoarfrost）”。“hoars”多为其复数或动词三单形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"grayish white, especially from old age; hoary","zh":"灰白的；（尤指因年老而）白发苍苍的"},"examples":[{"en":"A hoar beard framed his face.","zh":"他一把灰白的胡子衬着脸庞。"},{"en":"The hoar old house stood at the edge of the village.","zh":"那座古老而灰白的房子立在村口。"}]},{"partOfSpeech":"n.","definition":{"en":"a white frost; hoarfrost","zh":"白霜；霜花（hoarfrost）"},"examples":[{"en":"Hoar covered the grass in the early morning.","zh":"清晨，草地上覆着一层白霜。"},{"en":"The leaves glittered with hoar after the cold night.","zh":"寒夜过后，叶子上结了霜花，闪闪发亮。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to become gray or white with age; to grow hoary","zh":"（罕见）变得灰白；变得白发苍苍"},"examples":[{"en":"Over the years, his hair hoared at the temples.","zh":"这些年，他鬓角渐渐变白了。"}]}],"synonyms":["hoary","gray","frost","hoarfrost"],"phonetic":"/hɔr/","extraExplanation":["“hoars”通常是“hoar”的复数（名词）或第三人称单数（动词）形式，但在现代英语里不常单独使用；更常见的是固定搭配“hoar frost / hoarfrost（霜花、白霜）”。","很多学习者会把“hoar”与“hoarse（嗓音嘶哑的）”混淆：hoar 讲“灰白/霜”，hoarse 才是“沙哑”。"]}
{"word":"hoarse","summary":{"en":"Hoarse means your voice sounds rough and raspy, often from shouting, illness, or irritation.","zh":"hoarse 表示嗓音粗糙、嘶哑，常由喊叫、生病或刺激引起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a rough, raspy voice, often because your throat is tired, irritated, or sick.","zh":"（嗓音）沙哑的、嘶哑的，常因喉咙疲劳、刺激或生病引起。"},"examples":[{"en":"After shouting at the concert, my voice was hoarse the next day.","zh":"在演唱会大喊之后，我第二天嗓子就沙哑了。"},{"en":"She sounded hoarse, so I asked if she had a cold.","zh":"她听起来嗓音沙哑，所以我问她是不是感冒了。"}]}],"synonyms":["raspy","rough","husky"],"phonetic":"/hɔrs/","extraExplanation":["常见搭配：a hoarse voice（沙哑的声音）、sound hoarse（听起来沙哑）、go hoarse（嗓子变哑）。","注意拼写与易混词：hoarse（沙哑的）不要和 horse（马）混淆；读音不同、意思完全不同。","在文学与叙述中，hoarse 常用来表现人物疲惫、情绪激动（如哭喊后）、或疾病状态，让描写更具画面感。"]}
{"word":"hoarse voice","summary":{"en":"a raspy, rough-sounding voice","zh":"沙哑、粗哑的嗓音"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A rough, raspy voice, often caused by a sore throat, shouting, illness, dryness, or overusing the voice.","zh":"（声音）嘶哑的嗓音，常因喉咙发炎、喊叫、生病、干燥或用嗓过度导致。"},"examples":[{"en":"After the concert, she had a hoarse voice for two days.","zh":"演唱会之后，她嗓子嘶哑了两天。"},{"en":"He spoke in a hoarse voice because he had a cold.","zh":"他因为感冒，说话声音很嘶哑。"},{"en":"If you wake up with a hoarse voice, try drinking warm water and resting your voice.","zh":"如果你醒来嗓音嘶哑，可以试试喝温水并让嗓子休息。"}]}],"synonyms":["raspy voice","husky voice","rough voice","gravelly voice"],"phonetic":"/hɔrs vɔɪs/","extraExplanation":["“hoarse”不要和“horse（马）”混淆：拼写只差一个字母，但发音和意思完全不同。","如果嘶哑持续超过两周、伴随吞咽困难/呼吸困难/咳血等症状，建议及时就医（可能与声带问题有关）。"],"etymology":"“hoarse”来自古英语 hās，意为“沙哑的、粗哑的”，后来固定用于形容声音粗糙不清；“voice”来自拉丁语 vox（声音）。","mnemonic":["记忆：hoarse ≈ “嗓子很耗（hào）”→ 用嗓过度就会沙哑。","对比记忆：hoarse（嘶哑） vs. horse（马）— 多了一个字母 a，意思差很大。"]}
{"word":"hoarsely","summary":{"en":"Hoarsely means speaking in a rough, raspy voice, often from irritation or strain.","zh":"hoarsely 指“沙哑地说话”，多因喉咙不适或用嗓过度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rough, harsh voice, often because your throat is dry, irritated, or tired.","zh":"（声音）沙哑地、粗哑地；常因喉咙干燥、发炎或用嗓过度。"},"examples":[{"en":"She spoke hoarsely after cheering at the game all night.","zh":"她整晚在比赛中大声加油后，说话变得沙哑。"},{"en":"“I can’t talk right now,” he said hoarsely.","zh":"“我现在说不了话，”他沙哑地说。"}]}],"synonyms":["raspily","gruffly","roughly"],"phonetic":"/ˈhɔrsli/","extraExplanation":["hoarsely 来自形容词 hoarse（沙哑的）+ 副词后缀 -ly（……地）。常用来描写“说话/低语/喊叫”的方式，如 spoke/whispered/cried hoarsely。","在文学描写中，hoarsely 常暗示人物处于疲惫、生病、情绪激动或经历压力（例如熬夜哭喊、紧张争吵、长期沉默后开口等）。"]}
{"word":"hoarsen","summary":{"en":"Hoarsen means a voice or throat becomes rough or husky, often after illness or shouting.","zh":"Hoarsen 指嗓音或喉咙变得嘶哑粗哑，常见原因是生病或大声喊叫。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of a voice or throat) to become rough, harsh, or less clear, often because of illness, shouting, smoke, or dryness.","zh":"（嗓音或喉咙）变得嘶哑、粗哑或不清晰，常因生病、喊叫、烟雾或干燥引起。"},"examples":[{"en":"My voice hoarsened after cheering at the game all night.","zh":"我整晚在比赛中加油呐喊后，嗓子变哑了。"},{"en":"Cold air can make your throat dry and your voice hoarsen.","zh":"冷空气会让喉咙变干，声音变得嘶哑。"},{"en":"She stopped talking because her voice was starting to hoarsen.","zh":"她因为声音开始嘶哑而停止说话。"}]}],"synonyms":["grow hoarse","become hoarse","rasp","roughen (a voice)"],"phonetic":"/ˈhɔɹsən/","extraExplanation":["“hoarsen”主要用作不及物动词，常见搭配有：voice hoarsens（声音变哑）、throat hoarsens（嗓子变哑）。","常见表达：My voice is hoarse.（我的嗓子哑了。）“hoarse”是形容词；“hoarsen”强调“变得”嘶哑这一过程。","词形联想：hoarse（嘶哑的）→ hoarsen（变得嘶哑）；名词常用“hoarseness”（嘶哑）。"]}
{"word":"hoarsened","summary":{"en":"“Hoarsened” describes a voice that has become rough and harsh, or it can be the past form of “hoarsen.”","zh":"“hoarsened”表示声音变得沙哑粗哑；也可作动词“hoarsen”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a voice or throat) rough, harsh, and less clear than usual, often because of a cold, shouting, smoking, or dryness.","zh":"（嗓音或喉咙）沙哑的、粗哑的，不如平时清晰，常因感冒、大声喊叫、吸烟或干燥引起。"},"examples":[{"en":"After cheering all night, my voice was hoarsened and weak.","zh":"整晚加油呐喊后，我的声音变得沙哑而无力。"},{"en":"She spoke in a hoarsened whisper because her throat hurt.","zh":"因为喉咙疼，她用沙哑的耳语说话。"},{"en":"The cold air hoarsened his voice by the end of the trip.","zh":"旅程结束时，冷空气让他的嗓音变得沙哑。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “hoarsen”: to make (a voice) become rough or harsh.","zh":"“hoarsen”的过去式/过去分词：使（嗓音）变得沙哑、粗哑。"},"examples":[{"en":"The long speech hoarsened his voice.","zh":"长时间的演讲让他的嗓音变得沙哑。"},{"en":"Years of smoking had hoarsened her voice.","zh":"多年的吸烟让她的声音变得沙哑。"}]}],"synonyms":["hoarse","raspy","rough","gravelly"],"phonetic":"/ˈhɔr.sənd/","extraExplanation":["“hoarsened”常见于两种用法：①作形容词，描述“嗓音已经沙哑的状态”；②作动词hoarsen的过去式/过去分词，表示“某事让嗓音变沙哑”。日常表达里也常用“my voice is hoarse / I’m hoarse”。","词根联想：hoarse（沙哑的）→ hoarsen（变沙哑）。常见搭配：a hoarsened voice（沙哑的嗓音）、become/grow hoarse（变沙哑）。"]}
{"word":"hoarseness","summary":{"en":"Hoarseness means a rough or weak voice—your voice sounds raspy or strained.","zh":"Hoarseness 指声音变得粗哑或无力，听起来沙沙的、很费劲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rough, raspy, or weak voice (often from irritation or inflammation of the throat or vocal cords).","zh":"（声音）嘶哑、沙哑或无力（常因喉咙或声带受刺激或发炎）。"},"examples":[{"en":"I woke up with hoarseness after cheering at the game all night.","zh":"我整晚在比赛中大声加油，醒来时声音变得很嘶哑。"},{"en":"If the hoarseness lasts more than two weeks, you should see a doctor.","zh":"如果声音嘶哑持续超过两周，你应该去看医生。"}]}],"synonyms":["raspiness","husky voice","voice loss","throatiness"],"phonetic":"/ˈhɔrsnəs/","extraExplanation":["在日常英语里，hoarseness 通常指“声音沙哑”这种状态，常见原因包括感冒/咽喉炎、过度用嗓（大喊、长时间讲话或唱歌）、吸烟、空气干燥或过敏等。","搭配很常见：have hoarseness（有声音嘶哑）、develop hoarseness（开始变得嘶哑）、chronic/persistent hoarseness（慢性/持续性嘶哑）。","同根词：hoarse（adj. 沙哑的）。口语中更常说：My voice is hoarse / I’m hoarse（我嗓子哑了）。"]}
{"word":"hoarsenesses","summary":{"en":"“Hoarsenesses” means multiple instances/cases of a hoarse (raspy) voice.","zh":"“Hoarsenesses”表示“多次/多个案例的声音沙哑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of hoarseness: rough, weak, or raspy voice quality, often from irritation or inflammation of the throat/voice box (larynx).","zh":"hoarseness 的复数：声音沙哑、粗哑或无力的状态，常因喉咙或喉头（声带所在处）受到刺激或发炎引起。"},"examples":[{"en":"The doctor asked about any hoarsenesses she’d had in the past year.","zh":"医生询问她在过去一年里是否出现过多次声音沙哑。"},{"en":"Frequent hoarsenesses can happen if you shout a lot or get repeated colds.","zh":"如果经常大喊或反复感冒，可能会多次出现声音沙哑。"}]}],"synonyms":["raspiness","husky voice","laryngitis (when caused by inflammation)"],"phonetic":"ˈhɔrsnəsɪz","extraExplanation":["“hoarsenesses”在日常英语中不算常见；多数情况下人们直接说“hoarseness”（不可数）来泛指沙哑，例如：I have hoarseness today. 用复数“hoarsenesses”通常是在医学记录、研究或强调“多次发作/不同病例”时。","如果沙哑持续超过两到三周、伴随吞咽困难、呼吸困难、咳血或不明原因体重下降，英语语境中常建议尽快就医（ENT/otolaryngologist）。"]}
{"word":"hoarsening","summary":{"en":"Hoarsening means becoming (or making something) rougher or harsher—most often used for a voice becoming hoarse.","zh":"Hoarsening 指变得（或使变得）更粗糙、更沙哑；最常用于描述嗓音变哑。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"becoming rough, harsh, or less clear (especially of a voice), often because of shouting, illness, age, smoke, or dry air","zh":"（尤指嗓音）变得沙哑、粗糙或不清晰（常因大喊、生病、年龄、吸烟或空气干燥等）"},"examples":[{"en":"After hours of cheering, her voice was hoarsening and she could barely speak.","zh":"欢呼了好几个小时后，她的嗓音变得沙哑，几乎说不出话。"},{"en":"A cold can cause hoarsening of the voice.","zh":"感冒可能会导致嗓音变哑。"}]},{"partOfSpeech":"vt.","definition":{"en":"making something (especially a voice or sound) harsher or rougher","zh":"使（尤指声音/嗓音）变得更粗哑、更刺耳"},"examples":[{"en":"The smoke was hoarsening his voice over time.","zh":"烟雾/吸烟让他的嗓音随着时间变得更沙哑。"},{"en":"She tried to avoid foods that were hoarsening her throat.","zh":"她尽量避免那些会让喉咙更不适、嗓音更沙哑的食物。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) the process of particles or grains becoming larger or coarser in texture","zh":"（技术/专业）颗粒或晶粒变大、变粗（粒度“变粗化”的过程）"},"examples":[{"en":"Engineers studied hoarsening of the material after repeated heating.","zh":"工程师研究材料在反复加热后的晶粒粗化。"},{"en":"In some foods, hoarsening can happen during storage, changing the texture.","zh":"某些食物在储存过程中会出现颗粒变粗，口感也会改变。"}]}],"synonyms":["becoming hoarse","roughening","coarsening","rasping","harshening"],"phonetic":"/ˈhɔrsənɪŋ/","extraExplanation":["“hoarsening”常见于描述嗓音变化：比如大声喊叫、熬夜、感冒、过敏、吸烟或空气干燥都会让声音更“粗、哑、发紧”。日常表达里也常说：My voice is getting hoarse（我声音变哑了）。","在材料科学/地质学里，hoarsening 指“晶粒/颗粒长大、变粗”的现象，常与加热、时间、扩散等因素有关；这种用法偏专业。"]}
{"word":"hoarsens","summary":{"en":"“Hoarsens” means a voice or throat becomes (or is made) rough and harsh.","zh":"“hoarsens”表示嗓音或喉咙变得（或被弄得）沙哑粗哑。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a voice or throat) to become rough, harsh, or scratchy.","zh":"（嗓音或喉咙）变得沙哑、粗哑、刺耳。"},"examples":[{"en":"After yelling at the game, his voice hoarsens by the next morning.","zh":"在比赛中大喊之后，他的嗓子到第二天早上就变哑了。"},{"en":"Her voice hoarsens when the air is dry.","zh":"空气干燥时，她的声音会变得沙哑。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone’s voice or throat rough or harsh.","zh":"使（某人的嗓音或喉咙）变得沙哑、粗哑。"},"examples":[{"en":"Cold weather often hoarsens my throat if I don’t drink enough water.","zh":"如果我水喝得不够，寒冷天气常常会让我嗓子变哑。"},{"en":"Too much speaking can hoarsen your voice.","zh":"说话太多会让你的声音变哑。"}]}],"synonyms":["rasps","gets hoarse","becomes hoarse","roughens","grates"],"phonetic":"/ˈhɔrsənz/","extraExplanation":["“hoarsens”是动词“hoarsen”的第三人称单数（he/she/it hoarsens）。常用于现在时描述习惯或规律：比如“His voice hoarsens in winter.”","词根相关：形容词“hoarse”（沙哑的）+ 动词后缀“-en”（表示“变得……/使变得……”），类似于“widen（变宽）”“soften（变软）”。"]}
{"word":"hoarser","summary":{"en":"“Hoarser” means “more hoarse”—a rougher, weaker voice than before.","zh":"“hoarser”表示“更沙哑”，即声音比之前更粗糙、更无力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “hoarse”: having a rougher, weaker voice or throat sound than before (often from a cold, shouting, or irritation).","zh":"“hoarse”的比较级：声音比之前更沙哑、更粗糙或更无力（常因感冒、喊叫或喉咙刺激引起）。"},"examples":[{"en":"After yelling at the game, my voice was hoarser the next day.","zh":"比赛时大喊之后，我第二天的声音更沙哑了。"},{"en":"Her cough got worse, and her voice became hoarser at night.","zh":"她的咳嗽加重了，晚上声音也更沙哑。"},{"en":"I’m hoarser than yesterday, so I should rest my voice.","zh":"我比昨天更沙哑，所以应该让嗓子休息一下。"}]}],"synonyms":["more hoarse","raspier","huskier"],"phonetic":"/ˈhɔrsər/","extraExplanation":["“hoarser”来自形容词“hoarse”（沙哑的）的比较级形式。规则是：hoarse → hoarser → hoarsest。","注意别和“horse”（马）混淆：发音不同，拼写也不同。hoarse /hɔrs/；horse /hɔrs/ 在美式英语里常常听起来很像，因此更要靠拼写和语境区分。","“hoar-”这个拼写也会出现在“hoarfrost”（雾凇/白霜）里，其中“hoar”有“灰白、如霜”的意思，但这和“嗓子沙哑”的词义来源不同，容易让学习者困惑。"]}
{"word":"hoarsest","summary":{"en":"“Hoarsest” means the most hoarse: the roughest, croakiest voice or sound.","zh":"“Hoarsest”表示“最沙哑的”：声音最粗哑、最嘶哑的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “hoarse”) having the roughest, most croaky voice or sound, often because of shouting, illness, smoke, or dryness.","zh":"（“hoarse”的最高级）声音最沙哑、最粗哑的，常因大喊、生病、烟尘或干燥引起。"},"examples":[{"en":"After cheering all night, she woke up with the hoarsest voice.","zh":"通宵加油呐喊后，她醒来时嗓子沙哑得最厉害。"},{"en":"By the end of the match, his voice was the hoarsest in the group.","zh":"比赛结束时，他是那群人里嗓音最沙哑的。"},{"en":"The hoarsest cough in the room made everyone look up.","zh":"房间里最沙哑的咳嗽声让大家都抬起头来。"}]}],"synonyms":["croakiest","raspiest","roughest (voice)","most raspy"],"phonetic":"/ˈhɔrsɪst/","extraExplanation":["“hoarsest”是形容词“hoarse（沙哑的）”的最高级。常见比较级/最高级：hoarse → hoarser → hoarsest。","注意拼写里的“hoar-”在这里不是“白霜/灰白（hoar）”的意思；“hoarse”主要指声音变粗哑。"]}
{"word":"hoarstone","summary":{"en":"A hoarstone is an old landmark stone, often used to mark a boundary.","zh":"hoarstone 指古老的地标石，常用作界标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large old stone used as a landmark, especially one marking a boundary (such as between fields, parishes, or estates)","zh":"（尤指在英国）作为地标或界标的古老大石头，用来标示田地、教区或地产的边界"},"examples":[{"en":"They found the hoarstone on the ridge, marking the old parish boundary.","zh":"他们在山脊上找到了那块界石，它标示着旧时教区的边界。"},{"en":"The path turns left at the hoarstone and continues toward the village.","zh":"小路在那块地标大石处左转，然后继续通向村庄。"}]}],"synonyms":["boundary stone","marker stone","landmark stone","waymarker","waystone"],"phonetic":"/ˈhɔrˌstoʊn/","extraExplanation":["“Hoarstone”由 hoar（灰白的；因年代久远而显得苍老的）+ stone 组成。在英国乡村语境里，它常指古老的界标石，和传统的土地划分、教区边界有关。现代更常用 boundary stone / marker stone；“hoarstone”带有较强的地域与文学色彩（在描写英格兰乡野的作品里偶尔出现）。"]}
{"word":"hoarwort","summary":{"en":"Hoarwort is an old name for horehound (especially white horehound), a gray-green herb once used in traditional cough remedies.","zh":"Hoarwort 是 horehound（尤指白色欧夏至草/白苦薄荷）的一种旧称，属灰绿草本，过去常用于传统止咳等草药用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant name (old-fashioned) for horehound, especially white horehound (Marrubium vulgare), a gray-green herb once used in cough remedies","zh":"（旧称）石蚕草/白色欧夏至草（白苦薄荷，white horehound，学名 Marrubium vulgare），一种灰绿草本，过去常用于止咳等草药制剂"},"examples":[{"en":"In older herbals, hoarwort was recommended for coughs and sore throats.","zh":"在较早的草药书中，hoarwort 常被用来缓解咳嗽和喉咙痛。"},{"en":"The garden had hoarwort—its leaves looked dusty and gray-green.","zh":"花园里种着 hoarwort——它的叶子看起来像蒙了一层灰，呈灰绿色。"}]}],"synonyms":["horehound","white horehound","Marrubium vulgare"],"phonetic":"ˈhɔrˌwɝt","extraExplanation":["“hoarwort”是比较古老的植物俗名：hoar- 表示“灰白、似白霜的”（如 hoarfrost 白霜），-wort 是古英语里“植物/草药”的后缀（常见于旧式植物名）。","现代更常用的名称是 “horehound / white horehound”。不同地区的俗名可能会把它与其他“灰白叶”的草本混叫，因此阅读旧书时可结合拉丁学名判断。"]}
{"word":"hoary","summary":{"en":"Hoary means gray/white with age, or very old and long-established; it can also mean covered with frost.","zh":"Hoary 指“因年老而灰白、显老”，也可指“非常古老/历史悠久（有时暗示过时）”，还可指“覆霜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Gray or white with age; old-looking (often used for hair, beards, or things that seem very old).","zh":"（因年老而）灰白的；显老的（常形容头发、胡须或看起来很古老的事物）。"},"examples":[{"en":"The hoary man smiled as he watched his grandchildren play.","zh":"那位头发灰白的老人看着孙辈玩耍，微笑着。"},{"en":"A hoary beard covered his chin.","zh":"他下巴上长着一把灰白的胡子。"},{"en":"We walked past hoary trees that looked hundreds of years old.","zh":"我们走过几棵看起来有几百年历史的古树。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very old, long-established, or traditional—sometimes used critically to mean “outdated.”","zh":"非常古老的；历史悠久的；传统的（有时带一点贬义，指“过时的”）。"},"examples":[{"en":"The professor challenged a hoary theory that many people still believed.","zh":"教授质疑了一个许多人仍然相信的古老理论。"},{"en":"It’s a hoary tradition in this town to celebrate with a parade each spring.","zh":"这个小镇有个历史悠久的传统：每年春天举行游行庆祝。"}]},{"partOfSpeech":"adj.","definition":{"en":"Covered with a grayish-white frost; frosted.","zh":"覆有灰白霜的；结霜的。"},"examples":[{"en":"The fields looked hoary in the early morning cold.","zh":"清晨寒气中，田野看起来一片霜白。"},{"en":"Hoary grass sparkled under the streetlights.","zh":"结霜的草地在路灯下闪闪发亮。"}]}],"synonyms":["gray","white-haired","aged","ancient","timeworn","venerable","frosted"],"phonetic":"/ˈhɔɹi/","extraExplanation":["“hoary”常见于较正式或文学性的描写，带有一种“岁月感/沧桑感”。在文学中常写作“hoary head（白发苍苍）”“hoary old man（白发老人）”。","注意不要和“hairy（多毛的）”混淆：hoary 指“灰白/古老”，hairy 指“多毛/毛茸茸”。"]}
{"word":"hoaryheaded","summary":{"en":"Hoary-headed means gray- or white-haired from age, and in literary use it can also mean venerable and respected because of age.","zh":"hoary-headed 指因年老而白发苍苍；在文学语境中也可指因年高或资历深而德高望重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having gray or white hair because of old age; aged-looking.","zh":"（因年老而）头发灰白的；显得年迈的。"},"examples":[{"en":"A hoary-headed man sat quietly on the bench, watching the children play.","zh":"一位白发苍苍的老人安静地坐在长椅上，看着孩子们玩耍。"},{"en":"The hoary-headed professor spoke slowly but with great authority.","zh":"那位白发的教授说话缓慢，却很有权威。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Venerable or respected because of great age or long experience.","zh":"（文学用法）因年高或资历深而令人敬重的；德高望重的。"},"examples":[{"en":"They sought advice from a hoary-headed elder of the community.","zh":"他们向一位德高望重的社区长者请教。"},{"en":"In the story, the hoary-headed judge represents tradition and wisdom.","zh":"在故事里，那位白发法官象征传统与智慧。"}]}],"synonyms":["gray-haired","white-haired","aged","venerable","timeworn"],"phonetic":"/ˈhɔri ˌhɛdɪd/","extraExplanation":["“hoary-headed”常写作带连字符的 hoary-headed，语气偏文学或正式。","hoary 本义与“灰白、覆霜般的颜色”有关，所以除了形容头发，也可形容“古老的、陈旧的”（如 hoary myths 古老的神话）。"]}
{"word":"hoast","summary":{"en":"“Hoast” is a dialect word (especially Scots) meaning “cough” (the sound or the action).","zh":"“hoast”是方言词（尤指苏格兰英语），意思是“咳嗽”（咳嗽的声音或动作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, especially Scots) a cough.","zh":"（方言，尤指苏格兰英语）咳嗽。"},"examples":[{"en":"He had a bad hoast after walking in the cold air.","zh":"他在冷空气里走了一段路后咳得很厉害。"},{"en":"Her hoast kept her awake at night.","zh":"她的咳嗽让她夜里睡不着。"}]},{"partOfSpeech":"v.","definition":{"en":"(dialect, especially Scots) to cough.","zh":"（方言，尤指苏格兰英语）咳嗽。"},"examples":[{"en":"If you hoast a lot, you should rest and drink warm water.","zh":"如果你总是咳嗽，应该休息并喝点温水。"},{"en":"He started to hoast when the smoke filled the room.","zh":"房间里满是烟时，他开始咳嗽起来。"}]}],"synonyms":["cough"],"phonetic":"/hoʊst/","extraExplanation":["“hoast”在现代标准英语里很少见，多见于苏格兰英语/方言写法，意思相当于常见的“cough”。","如果你本来想写的是常用词，可能是拼写误差：\n- host（主持人/主办；招待）\n- hoist（吊起；升起）"]}
{"word":"hoastman","summary":{"en":"Hoistman means a person whose job is operating a hoist to lift or lower heavy loads.","zh":"Hoistman 指负责操作提升机/起重设备，吊装或升降重物的工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a worker who operates a hoist (a lifting machine), especially on a construction site or in mining","zh":"操作起重机/提升机（吊装设备）的工人；尤指建筑工地或矿区的提升机操作员"},"examples":[{"en":"The hoistman lifted the steel beams into place.","zh":"提升机操作员把钢梁吊装到位。"},{"en":"In the mine, the hoistman controlled the cage going up and down the shaft.","zh":"在矿井里，提升机操作员控制着升降笼在竖井中上下运行。"}]}],"synonyms":["crane operator","hoist operator","rigger (related)"],"phonetic":"/ˈhɔɪstmən/","extraExplanation":["“hoastman”不是常见英语单词，最接近、也最常见的可能是 **hoistman**（提升机/起重机操作员）。如果你想表达“接待/主持的人”，更自然的说法通常是 **host**（主人/主持人），而不是 *hostman*。"]}
{"word":"hoatching","summary":{"en":"“Hoatching” is a Scottish-English word meaning “teeming/swarming” or “crowded with.”","zh":"“hoatching”是苏格兰英语，表示“挤满的/成群的/到处都是”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scottish English) teeming; swarming; very full of people or things.","zh":"（苏格兰英语）挤满的；成群的；到处都是……的。"},"examples":[{"en":"The streets were hoatching with fans after the match.","zh":"比赛结束后，街上挤满了球迷。"},{"en":"The pond was hoatching with tadpoles in spring.","zh":"春天池塘里到处都是蝌蚪。"}]},{"partOfSpeech":"v.","definition":{"en":"(Scottish English) the -ing form of “hoach”: to swarm with; to be crowded with.","zh":"（苏格兰英语）“hoach”的 -ing 形式：成群出现；挤满。"},"examples":[{"en":"The market was hoatching with tourists.","zh":"市场里挤满了游客。"},{"en":"My inbox is hoatching with messages today.","zh":"我今天的收件箱消息多得爆。"}]}],"synonyms":["teeming (with)","swarming (with)","crowded (with)","packed (with)"],"phonetic":"/ˈhoʊtʃɪŋ/","extraExplanation":["“hoatching/hoach”主要见于苏格兰英语与苏格兰文学语境，在标准美式/英式英语里更常用的说法是“teeming with / swarming with / crowded with”。","你输入的“hoatching”也可能是拼写误差，想写的是“hatching”（孵化；策划）。如果你想查的是“hatching”，告诉我句子语境我可以帮你区分。"]}
{"word":"hoatzin","summary":{"en":"A hoatzin is a distinctive South American river-side bird, famous for its leaf diet and strong musky smell.","zh":"hoatzin 指一种南美洲河岸湿地鸟类麝雉，以吃叶子和浓烈麝香味闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical South American bird (Opisthocomus hoazin) that lives near rivers and swamps, eats mostly leaves, and is known for its strong, musky smell.","zh":"麝雉（又称“臭鸟”），一种生活在南美洲热带河流与沼泽附近的鸟，主要吃树叶，以带有浓烈麝香味而闻名。"},"examples":[{"en":"We spotted a hoatzin resting in the mangroves along the Amazon River.","zh":"我们在亚马逊河边的红树林里看到一只麝雉在休息。"},{"en":"The hoatzin is sometimes nicknamed the “stinkbird” because of its odor.","zh":"麝雉有时被叫作“臭鸟”，因为它有明显的气味。"}]}],"synonyms":["stinkbird","Opisthocomus hoazin"],"phonetic":"/hoʊˈætsɪn/","extraExplanation":["“hoatzin”指一种非常独特的南美鸟类，常见于亚马逊与奥里诺科流域的湿地与河岸灌丛。它以叶子为主食，消化方式类似反刍动物（在前胃中发酵），因此体味较重，这也是“stinkbird（臭鸟）”外号的来源。","在科普与自然写作中，麝雉经常被提到的另一个特点是：幼鸟翅膀上有爪，可以用来攀爬树枝，常被用作“活化石”般的趣味例子。"]}
{"word":"hoatzines","summary":{"en":"Hoatzines are hoatzin birds—large, leaf-eating birds from northern South America, famous for their strong odor and unusual digestion.","zh":"Hoatzines 指麝雉这种鸟（hoatzin 的复数）：南美北部的大型食叶鸟，以气味较重和独特的消化方式著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hoatzin: a large, leaf-eating tropical bird found in the Amazon and Orinoco river regions of South America, known for its strong odor and unusual digestion.","zh":"hoatzin 的复数：一种生活在南美洲亚马孙河与奥里诺科河流域的大型热带鸟类，以树叶为食，因体味较重、消化方式特殊而闻名。"},"examples":[{"en":"Hoatzines live in noisy groups along riverbanks in the Amazon basin.","zh":"麝雉（hoatzines）常成群结队、吵吵闹闹地生活在亚马孙流域的河岸边。"},{"en":"Some people call hoatzines “stinkbirds” because of their strong smell.","zh":"因为气味较重，有人把麝雉（hoatzines）叫作“臭鸟”。"}]}],"synonyms":["stinkbirds"],"phonetic":"/hoʊˈætsɪn/","extraExplanation":["“hoatzin”也常译作“麝雉”。它的消化方式有点像反刍动物：会在前胃发酵树叶，因此容易产生较重的气味，这也是“stinkbird（臭鸟）”这个俗名的来源。","在科普文章里，你还可能读到：幼鸟翅膀上有爪，能在树枝间攀爬，这是它非常有名的“怪特征”之一。"]}
{"word":"hoatzins","summary":{"en":"“Hoatzins” means more than one hoatzin, a leaf-eating tropical bird from South America.","zh":"“hoatzins” 指多只 hoatzin（麝雉），一种来自南美洲、以树叶为主食的热带鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hoatzin: a tropical South American bird that lives in riverside forests and eats mostly leaves.","zh":"hoatzin 的复数：一种生活在南美洲热带河岸森林、主要以树叶为食的鸟。"},"examples":[{"en":"Hoatzins are often found in the Amazon and Orinoco river basins.","zh":"hoatzins 常见于亚马孙河与奥里诺科河流域。"},{"en":"Because hoatzins eat many leaves, they move slowly through the trees.","zh":"由于 hoatzins 以大量树叶为食，它们在树上活动得比较慢。"}]}],"synonyms":["leaf-eating tropical birds (general)","South American birds (general)"],"phonetic":"/hoʊˈætsɪnz/","extraExplanation":["hoatzin 常被称为“臭鸟（stinkbird）”，因为它们用类似反刍动物的方式在前胃里发酵树叶，身体可能带有明显气味。","幼鸟的翅膀上有小爪子，能在树枝间攀爬；长大后这些爪子会明显退化。这一点常被用来讨论鸟类演化与适应。","词源来自南美原住民语言（常被认为与圭亚那地区语言有关），经由西班牙语/法语记录进入英语，属于较少见的动物学词汇。"]}
{"word":"hoax","summary":{"en":"A hoax is a deliberate trick or false story; to hoax means to fool people with something untrue.","zh":"hoax指“人为制造的骗局/假消息”；作动词表示“用虚假信息欺骗他人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A trick or false story meant to make people believe something untrue (often as a joke, scam, or misinformation).","zh":"骗局；恶作剧；假消息（故意让人相信不真实的事，常见于玩笑、诈骗或误导信息）。"},"examples":[{"en":"The viral post turned out to be a hoax, and the photo was edited.","zh":"那条爆红的帖子后来被证实是个假消息，照片是修过的。"},{"en":"The email was a hoax designed to steal personal information.","zh":"那封邮件是个骗局，目的是窃取个人信息。"}]},{"partOfSpeech":"vt.","definition":{"en":"To trick or fool people by making them believe something false.","zh":"欺骗；愚弄（让人相信虚假的事）。"},"examples":[{"en":"Someone hoaxed the community with a fake warning message.","zh":"有人用一条虚假的警告信息欺骗了社区居民。"},{"en":"He admitted he hoaxed his friends with a made-up story.","zh":"他承认自己用编出来的故事捉弄了朋友。"}]}],"synonyms":["trick","fraud","scam","deception","prank","fake"],"phonetic":"/hoʊks/","extraExplanation":["“hoax”常用于新闻与网络语境，表示“人为制造的假消息/谣言”，比单纯的“mistake（错误）”更强调“故意”。","常见搭配：a hoax call（恶作剧电话）、a hoax email（诈骗/钓鱼邮件）、a hoax bomb threat（虚假的炸弹威胁）。","辨析：hoax vs. prank——prank更偏“无伤大雅的恶作剧”；hoax常更严重，可能造成恐慌或损失。","相关词：fake news（假新闻，较口语/媒体用语）、scam（诈骗，强调骗钱/利益）、rumor（谣言，未必是故意造假）。"]}
{"word":"hoaxability","summary":{"en":"Hoaxability means how easily someone or something can be tricked by a hoax.","zh":"Hoaxability 指一个人或事物有多容易被“骗局/恶作剧”骗到。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to fool, trick, or deceive (being “hoaxable”); how susceptible someone or something is to hoaxes","zh":"（非正式、较少见）容易被骗局/恶作剧欺骗的程度；“可被骗性”"},"examples":[{"en":"The prank spread fast because of the group’s hoaxability.","zh":"这个恶作剧传得很快，因为这个群体很容易上当。"},{"en":"Media hoaxability increases when people share headlines without checking sources.","zh":"当人们不核实来源就转发标题时，媒体的“可被骗性”会变高。"}]}],"synonyms":["gullibility","credulity","susceptibility to hoaxes","vulnerability to deception"],"phonetic":"/ˌhoʊk.səˈbɪl.ə.ti/","extraExplanation":["“hoaxability”不是非常常见的标准词，更常见的表达是“susceptibility to hoaxes / gullibility（轻信）”。它是由 hoax（骗局/恶作剧）+ -able（可……的）→ hoaxable（容易被骗局骗的）+ -ity（名词后缀，表示性质/状态）构成。","在正式写作中，建议用更常见的词：gullibility（轻信）、credulity（轻信，较正式）、susceptibility/vulnerability to misinformation（对虚假信息的易受影响程度）。"]}
{"word":"hoaxable","summary":{"en":"Hoaxable means “easy to fool” or “easy to turn into/fit for a hoax.”","zh":"hoaxable 指“容易受骗的”，也可指“很容易被用来编造/传播骗局或恶作剧的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Easily fooled or tricked; likely to believe a hoax.","zh":"容易受骗的；很可能相信恶作剧/骗局的。"},"examples":[{"en":"New users are often more hoaxable because they don’t know what misinformation looks like online.","zh":"新用户往往更容易受骗，因为他们还不懂网络上的虚假信息长什么样。"},{"en":"He’s smart, but he’s hoaxable when a story sounds exciting.","zh":"他很聪明，但只要故事听起来够刺激，他就容易上当。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be used as a target or material for a hoax (something that can be turned into a convincing prank or fake story).","zh":"适合用来编造骗局/恶作剧的；容易被拿来“做文章”的。"},"examples":[{"en":"A blurry photo is highly hoaxable because people can interpret it in many ways.","zh":"模糊的照片很适合被拿来造假，因为人们可以有很多种解读。"},{"en":"That headline is hoaxable—someone could screenshot it and spread it with a fake source.","zh":"那个标题很容易被用来造谣——有人可以截图后配上假的来源传播。"}]}],"synonyms":["gullible","easily fooled","credulous","susceptible","deceivable"],"phonetic":"/ˈhoʊk.sə.bəl/","extraExplanation":["“hoaxable”不是非常常见的标准词汇，更常见的表达是“gullible（轻信的）”“easily fooled（容易被骗的）”或“susceptible to hoaxes（容易受骗局影响的）”。在网络语境里，人们有时会用这种构词（hoax + -able）来强调“容易被编造/传播成谣言”或“容易上当”。"]}
{"word":"hoaxed","summary":{"en":"“Hoaxed” means “tricked or deceived (by a hoax).”","zh":"“hoaxed”表示“被恶作剧/骗局欺骗；用假消息骗了人”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “hoax”: to trick or deceive someone by making them believe something false (often as a joke or to cause confusion).","zh":"“hoax”的过去式/过去分词：用假消息或骗局欺骗他人，让对方相信不真实的事（常为恶作剧或制造混乱）。"},"examples":[{"en":"Someone hoaxed the school with a fake emergency call.","zh":"有人用假的紧急电话骗了学校。"},{"en":"She realized she had been hoaxed by a made-up online story.","zh":"她意识到自己被一则编造的网络故事骗了。"},{"en":"The photos were hoaxed and didn’t show a real event.","zh":"那些照片是伪造的，并不是真实事件。"}]}],"synonyms":["tricked","fooled","deceived","pranked","duped"],"phonetic":"/hoʊkst/","extraExplanation":["“hoax”常指“恶作剧式的骗局”或“虚假消息”，在新闻与网络语境中很常见，如“a hoax call（恶作剧电话）”“a social-media hoax（社交媒体谣言/骗局）”。","词形提示：hoax（动词/名词）→ hoaxed（过去式/过去分词）→ hoaxing（现在分词）。发音上 hoaxed /hoʊkst/ 结尾听起来像“host”加一个轻的 /k/ 音。"]}
{"word":"hoaxee","summary":{"en":"“Hoaxee” is nonstandard; use “victim of a hoax” or “the person who was hoaxed.” The standard words are “hoax” and “hoaxer.”","zh":"“hoaxee”属于非标准用法；建议用“victim of a hoax”或“the person who was hoaxed”。标准词是“hoax”和“hoaxer”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) “hoaxee” is not a common or widely accepted English word. People sometimes use it online to mean the person who is tricked by a hoax (the victim), but standard English usually says “victim of a hoax” or “the person who was hoaxed.”","zh":"（非标准用法）“hoaxee”不是常见或被广泛认可的英语单词。网络上偶尔有人用它表示“被骗局/恶作剧骗到的人（受害者）”。标准英语通常说“victim of a hoax（骗局的受害者）”或“the person who was hoaxed（被愚弄的人）”。"},"examples":[{"en":"He wasn’t the hoaxer—he was the victim of the hoax.","zh":"他不是骗人的那个人——他是这场骗局的受害者。"},{"en":"Online, some people jokingly call the fooled person a “hoaxee,” but it’s not standard.","zh":"在网上，有人会开玩笑把被骗的人叫“hoaxee”，但这不是标准用法。"}]},{"partOfSpeech":"n.","definition":{"en":"Related standard word: “hoax” — a trick or false story meant to deceive people.","zh":"相关标准词：hoax——指为了欺骗他人而编造的恶作剧或假消息。"},"examples":[{"en":"The email was a hoax, so I deleted it.","zh":"那封邮件是骗局，所以我删掉了。"},{"en":"It turned out to be an April Fools’ Day hoax.","zh":"结果那是愚人节的恶作剧。"}]},{"partOfSpeech":"vt.","definition":{"en":"Related standard word: “hoax” — to trick someone with a false story or plan.","zh":"相关标准词：hoax——用假消息或计划欺骗某人。"},"examples":[{"en":"Someone hoaxed the public with a fake announcement.","zh":"有人用一则假的公告欺骗了公众。"}]},{"partOfSpeech":"n.","definition":{"en":"Related standard word: “hoaxer” — a person who creates or spreads a hoax.","zh":"相关标准词：hoaxer——制造或散布骗局/恶作剧的人。"},"examples":[{"en":"The hoaxer posted edited photos to mislead people.","zh":"造谣者发布了修过的照片来误导大家。"}]}],"synonyms":["scam","trick","prank","fraud","fake story"],"phonetic":"/ˈhoʊks/","extraExplanation":["如果你是在写作或正式表达中使用，建议避免用“hoaxee”。更自然的说法是：the victim of a hoax / the person who was hoaxed / the one who got hoaxed（较口语）。","“hoax”常和网络谣言、诈骗、假新闻一起出现；搭配词包括：a hoax message（骗局信息）, a hoax call（恶作剧电话）, a hoax website（钓鱼/假网站）。"]}
{"word":"hoaxer","summary":{"en":"A hoaxer is someone who deliberately fools others by creating or spreading a hoax.","zh":"hoaxer 指故意编造或传播骗局/谣言来欺骗他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who creates or spreads a hoax (a trick or false story meant to fool people).","zh":"制造或散布骗局/谣言的人（故意用虚假信息来欺骗他人）。"},"examples":[{"en":"The hoaxer posted a fake news story online to scare people.","zh":"造谣者在网上发布了一条假新闻来吓唬人。"},{"en":"Police warned the public about a hoaxer making false emergency calls.","zh":"警方提醒公众注意一名打假报警电话的恶作剧者。"}]}],"synonyms":["deceiver","fraudster","trickster"],"phonetic":"/ˈhoʊksɚ/","extraExplanation":["“hoaxer”来自“hoax（骗局/恶作剧/谣言）+ -er（做某事的人）”。常用于新闻语境：fake bomb threat（虚假炸弹威胁）、false report（虚假报案）、online hoax（网络谣言）。","语气上通常带负面评价，强调“故意欺骗”。如果只是开玩笑而没有恶意，有时会用“prankster（爱恶作剧的人）”，但两者不完全相同：hoaxer 更偏“编造虚假信息并让人相信”。"]}
{"word":"hoaxers","summary":{"en":"Hoaxers are people who invent or spread a hoax to trick others.","zh":"hoaxers 指制造或传播骗局/假消息来欺骗他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who create or spread a hoax (a false story or trick) to deceive others.","zh":"制造或传播“骗局/假消息”的人；行骗者。"},"examples":[{"en":"The police warned the public about hoaxers who called pretending to be bank staff.","zh":"警方提醒公众警惕假冒银行工作人员打电话的骗子。"},{"en":"Online hoaxers spread fake news to get attention and clicks.","zh":"网络造谣者传播假新闻来博关注和点击量。"}]}],"synonyms":["tricksters","pranksters","deceivers","fraudsters","scammers"],"phonetic":"/ˈhoʊk.sɚz/","extraExplanation":["“hoaxers”是“hoaxer”的复数形式；常见搭配有：online hoaxers（网络造谣者）、prank hoaxers（恶作剧骗子）、hoaxers and scammers（造谣者和诈骗者）。","词源上“hoax”大致指“恶作剧式的欺骗”，有时不一定为金钱目的；如果强调骗钱，更常用“scammer / con artist”。"]}
{"word":"hoaxes","summary":{"en":"“Hoaxes” are false stories or tricks intended to deceive; it can also be the verb meaning “to deceive with a false story.”","zh":"“hoaxes”指为欺骗他人而编造的假消息/骗局/恶作剧；也可作动词，表示“用假消息欺骗/捉弄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"False stories or tricks meant to deceive people; pranks that make others believe something untrue.","zh":"（为欺骗他人而编造的）骗局；恶作剧；假消息。"},"examples":[{"en":"The email was a hoax, so I didn’t click the link.","zh":"那封邮件是骗局，所以我没有点击链接。"},{"en":"Many people shared the hoax online before checking the facts.","zh":"很多人在核实事实前就把那条假消息分享到网上了。"},{"en":"April Fools’ Day is known for harmless hoaxes and jokes.","zh":"愚人节以无伤大雅的恶作剧和玩笑出名。"}]},{"partOfSpeech":"v.","definition":{"en":"To trick or deceive someone by making them believe something false.","zh":"欺骗；用假消息捉弄。"},"examples":[{"en":"Someone hoaxed the community with a fake warning.","zh":"有人用一条假的警告消息欺骗了社区。"},{"en":"He admitted he hoaxed his friends as a joke.","zh":"他承认自己只是开玩笑，捉弄了朋友们。"}]}],"synonyms":["pranks","tricks","frauds","scams","false alarms","fabrications"],"phonetic":"/hoʊks/","extraExplanation":["“hoax”常用在新闻、网络信息环境中，强调“故意编造并让人相信”的假信息；在语气上可能从“恶作剧（较轻）”到“诈骗/造谣（较重）”不等，需看语境。","拼写与读音：单数 hoax，复数 hoaxes；动词第三人称单数 hoaxes，过去式/过去分词 hoaxed。"]}
{"word":"hoaxing","summary":{"en":"“Hoaxing” means deliberately tricking people or spreading a false story as true, or the act of doing so.","zh":"“hoaxing”指故意欺骗他人或散布虚假信息并冒充真实；也可指这种行为本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of playing a hoax (a trick or false story) on someone; deliberate deception meant to make others believe something untrue","zh":"（对他人）恶作剧式的欺骗；故意编造虚假信息让人信以为真"},"examples":[{"en":"The video was shared widely, but it turned out to be hoaxing.","zh":"那段视频被广泛转发，但后来发现只是造假/骗局。"},{"en":"Online hoaxing can cause real harm, especially during emergencies.","zh":"网络造假/骗局可能造成真实伤害，尤其在紧急时期。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “hoax”: to trick someone or spread a false story as if it were true","zh":"“hoax”的现在分词：欺骗（某人）或传播虚假消息并假装真实"},"examples":[{"en":"Someone is hoaxing the community with fake warnings.","zh":"有人用虚假的警告在欺骗社区。"},{"en":"They were hoaxing the audience by using edited photos.","zh":"他们用修过的照片来欺骗观众。"}]}],"synonyms":["deception","trickery","conning","faking","spreading a hoax"],"phonetic":"/ˈhoʊksɪŋ/","extraExplanation":["“hoaxing”常带强烈贬义，强调“故意误导”。在新闻与社交媒体语境里，常与“fake news（假新闻）/ misinformation（错误信息）”一起出现，但hoax更强调“刻意编造、带欺骗意图”。","常见搭配：hoaxing someone（骗某人）、hoaxing the public（欺骗公众）、online hoaxing（网络造假/骗局）。","区分：prank（恶作剧）通常更轻松、伤害较小；hoax（骗局/造假）往往更严重，可能引发恐慌或损失。"]}
{"word":"hoaxproof","summary":{"en":"Hoaxproof means not easily tricked by hoaxes or false information.","zh":"Hoaxproof 指不容易被恶作剧或虚假信息欺骗的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not easily fooled by a hoax, prank, or false story; able to recognize misinformation.","zh":"不容易被恶作剧或假消息欺骗的；能识别虚假信息的。"},"examples":[{"en":"After taking a media-literacy course, she became much more hoaxproof online.","zh":"上了媒体素养课程后，她在网上变得更不容易被假消息骗了。"},{"en":"A hoaxproof newsroom checks sources before sharing breaking news.","zh":"一个“防假新闻”的新闻编辑部会在发布突发新闻前核实消息来源。"}]}],"synonyms":["skeptical","hard to fool","scam-resistant","media-literate"],"phonetic":"/ˈhoʊksˌpruːf/","extraExplanation":["“hoaxproof”常见写法也有带连字符的“hoax-proof”。词尾“-proof”表示“防……的/不受……影响的”，类似：waterproof（防水的）、bulletproof（防弹的）、idiot-proof（傻瓜也不会用错的）。在网络语境里，它常用来形容对谣言、假新闻、骗局更有辨别力的人或系统。"]}
{"word":"hoazin","summary":{"en":"A hoazin is a South American tropical bird known for its smell and leaf-eating habits.","zh":"hoazin 指南美洲的麝雉，一种以吃树叶、体味较重而闻名的热带鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical South American bird (Opisthocomus hoazin) known for its strong smell, spiky crest, and leaf-eating diet; it lives near rivers and swamps","zh":"麝雉（hoazin，一种南美洲热带鸟类，体味较重、有冠羽，以树叶为食，常栖息在河流与沼泽附近）"},"examples":[{"en":"We spotted a hoazin resting in the mangroves along the river.","zh":"我们在河边的红树林里看到一只麝雉在休息。"},{"en":"The hoazin is famous for eating mostly leaves, unlike many other birds.","zh":"麝雉以树叶为主食，这点和许多其他鸟类不同。"},{"en":"Some guides call the hoazin the “stinkbird” because of its odor.","zh":"一些导游把麝雉叫作“臭鸟”，因为它身上有气味。"}]}],"synonyms":["stinkbird","Opisthocomus hoazin"],"phonetic":"/hoʊˈɑːzɪn/","extraExplanation":["发音提示：hoazin 常被读作 “ho-” + “-azin”，重音通常在前面。","小知识：麝雉的幼鸟翅膀上有爪子，可以在树枝间攀爬；这也是它很有名的特征之一。","词源/文化：hoazin 这个词来自当地语言（常见说法指向南美原住民语言），在英文科普和旅游语境中很常见，中文多译作“麝雉”。"]}

