{"word":"hob","summary":{"en":"Hob most commonly means a ledge on a fireplace/stove used for warming food; it can also mean a male ferret.","zh":"Hob 常指壁炉/炉子旁用于加热或保温食物的炉台；也可指雄性雪貂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat metal shelf or ledge at the back or side of a fireplace or stove, where you can warm or keep food.","zh":"壁炉或炉子旁/后的金属平面台（炉台），可用来加热或保温食物。"},"examples":[{"en":"She set the kettle on the hob to keep it warm.","zh":"她把水壶放在炉台上保温。"},{"en":"In the old house, bread dough was left to rise on the hob near the fire.","zh":"在那栋老房子里，面团常放在靠近火的炉台上发酵。"}]},{"partOfSpeech":"n.","definition":{"en":"A male ferret (an animal sometimes kept as a pet or used to hunt rabbits).","zh":"雄性雪貂（有时作为宠物饲养，或用于捕兔）。"},"examples":[{"en":"They keep a hob and a jill in separate cages.","zh":"他们把一只公雪貂和一只母雪貂分开关在笼子里。"}]}],"synonyms":["stovetop","cooktop","ledge"],"phonetic":"/hɑb/","extraExplanation":["英式英语里，hob 也常指炉灶上的“灶眼/灶面”（如 gas hob），美式英语更常说 stovetop 或 cooktop。"]}
{"word":"Hobart","summary":{"en":"Hobart most commonly refers to the capital city of Tasmania, Australia; it can also be a personal name.","zh":"Hobart 最常指澳大利亚塔斯马尼亚州首府霍巴特；也可作人名（名或姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Australia: the capital of Tasmania, located on the Derwent River near Mount Wellington.","zh":"澳大利亚城市：塔斯马尼亚州的首府，位于德文特河畔、惠灵顿山附近。"},"examples":[{"en":"We flew from Melbourne to Hobart for a weekend trip.","zh":"我们从墨尔本飞到霍巴特度周末。"},{"en":"Hobart is known for its waterfront and fresh seafood.","zh":"霍巴特以海滨风光和新鲜海鲜而闻名。"},{"en":"It can be chilly in Hobart, even in summer.","zh":"霍巴特即使在夏天也可能很凉。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or surname (less common in everyday conversation).","zh":"人名：可作名字或姓氏（在日常对话中相对少见）。"},"examples":[{"en":"Dr. Hobart will see you now.","zh":"霍巴特医生现在见你。"},{"en":"Her last name is Hobart.","zh":"她的姓是霍巴特。"}]}],"synonyms":["Hobart, Tasmania","the Tasmanian capital"],"phonetic":"/ˈhoʊbɑrt/","extraExplanation":["“Hobart”作为地名最常见，通常指塔斯马尼亚州首府。该城早期名称与英国殖民时期有关，常被认为以英国政治人物 Lord Hobart 命名。","在写作中常见搭配：Hobart waterfront（霍巴特海滨）、Hobart, Tasmania（塔州霍巴特）、the Port of Hobart（霍巴特港）。"]}
{"word":"Hobbamock","summary":{"en":"an evil spirit or devil figure in older New England colonial and literary contexts","zh":"（旧时新英格兰殖民/文学语境中）指邪灵或魔鬼形象"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(New England Indigenous mythology, especially in older colonial writings) an evil spirit or the Devil; a frightening supernatural being.","zh":"（新英格兰原住民神话/早期殖民地文献中常见）邪灵、魔鬼；令人恐惧的超自然存在。"},"examples":[{"en":"In some colonial stories, people said the forest was ruled by Hobbamock.","zh":"在一些殖民时期的故事里，人们说森林由“Hobbamock”统治。"},{"en":"The preacher warned the village about the tricks of Hobbamock.","zh":"牧师警告村民提防“Hobbamock”的诡计。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used in American literature for a Native figure or spirit, often tied to Puritan-era New England settings.","zh":"（美国文学用名）常被用作原住民人物或精灵/神祇的名字，多与清教徒时期的新英格兰背景相关。"},"examples":[{"en":"The novel uses Hobbamock as a symbol of the unknown wilderness.","zh":"这部小说用“Hobbamock”象征未知的荒野。"},{"en":"In older texts, Hobbamock appears as a powerful presence outside the town.","zh":"在较早的文本里，“Hobbamock”常作为城镇之外的一股强大力量出现。"}]}],"synonyms":["devil","demon","evil spirit","fiend"],"phonetic":"/ˈhɑːbəˌmɑːk/","extraExplanation":["这是带有明显历史语境的词：在17世纪新英格兰的殖民叙事里，欧洲移民常把原住民宗教/神话中的灵体用“魔鬼”框架来解释，因此在一些旧文献中该词带有强烈的殖民视角与误读。现代语境下使用时，最好注明来源与语境，避免把原住民信仰简单等同于“邪恶”。","常见变体拼写：Hobomock、Hobbamock。你在阅读文学或历史材料时，可能会看到不同拼法指向相近概念。"],"etymology":"源自美国东北部原住民语言（常被归为马萨诸塞语/阿尔冈昆语族相关形式）的词，被早期英语殖民者借用并拼写为 Hobomock/Hobbamock 等，用来指“邪灵/魔鬼”。拼写与指代在不同文本中不完全一致。","mnemonic":["把它记成“hob + mock”：好像有个东西在“mock（戏弄）”人类——对应传说里会捉弄人的邪灵形象。","联想中文“黑暗森林里的‘魔’（魔鬼/邪灵）”：看到它多出现在新英格兰、清教徒、荒野等语境。"]}
{"word":"Hobbamocke","summary":{"en":"a name for a spirit figure in some early New England Indigenous/colonial contexts","zh":"早期新英格兰原住民/殖民语境中出现的灵体称呼（专名）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) In some early New England/Algonquian (e.g., Wampanoag) contexts, a spirit figure—often described by English colonists as a dark or troublesome spirit; also used as a name in colonial-era stories.","zh":"（专有名词）在早期新英格兰/阿尔冈昆语族（如万帕诺亚格）相关语境中出现的一种灵体形象；英国殖民者常把它描写成“阴暗或带来麻烦的灵”。也常作为殖民时期故事或文学作品中的名字出现。"},"examples":[{"en":"In some colonial writings, Hobbamock was mentioned as a spirit people feared.","zh":"在一些殖民时期的文字里，Hobbamock 被提到是一种人们害怕的灵体。"},{"en":"The name also appears in older New England tales as a character connected to Indigenous belief.","zh":"这个名字也出现在一些较早的新英格兰故事中，作为与原住民信仰有关的角色。"}]}],"synonyms":["Hobomok"],"phonetic":"/ˈhɑbəˌmɑk/","extraExplanation":["这个词属于原住民文化语境中的专名/神灵名号。很多早期英语资料用基督教“魔鬼/邪灵”的框架去解释他者信仰，容易造成误解。学习时可把它理解为“被殖民叙事塑造过的原住民灵体称呼”，并留意不同部族与不同文本里的差异。","常见拼写变体：Hobomok, Hobbamock（你输入的拼写）。检索资料时建议两种都搜。"],"etymology":"多被认为是从万帕诺亚格语/相关阿尔冈昆语言的名字音译而来，英文里常见拼法有 Hobomok / Hobbamock 等；早期欧洲移民的记录与翻译带有强烈的时代偏见，因此含义与形象在英文文献中常被“妖魔化”。","mnemonic":["记作“hobo + mock”的近似音：像是一个被故事里‘mock（妖魔化/嘲弄式描写）’过的名字，用来提醒自己注意殖民文本的偏见。"]}
{"word":"hobbed","summary":{"en":"“Hobbed” usually means shoes or boots were fitted with hobnails (or describes hobnailed footwear). In technical writing, it can also mean gear-cutting by hobbing.","zh":"“hobbed”常指（给鞋/靴）钉上鞋钉，或形容“钉钉的鞋”。在技术语境中也可指用滚刀滚齿加工。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hob” (to fit a shoe/boot with hobnails for traction).","zh":"“hob”的过去式/过去分词：给鞋或靴子钉上鞋钉（hobnails）以增加防滑抓地力。"},"examples":[{"en":"The cobbler hobbed the boots for winter walking.","zh":"鞋匠给靴子钉上鞋钉，方便冬天行走防滑。"},{"en":"His shoes were hobbed to keep him from slipping on muddy roads.","zh":"他的鞋被钉了鞋钉，以免在泥路上打滑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Adjective: fitted with hobnails; studded for grip.","zh":"形容词：钉有鞋钉的；为增加抓地力而装有钉子的。"},"examples":[{"en":"She wore hobbed boots on the icy trail.","zh":"她在结冰的小路上穿着钉有鞋钉的靴子。"},{"en":"The hobbed soles made a sharp clicking sound on stone floors.","zh":"钉钉的鞋底在石地上发出清脆的咔嗒声。"}]},{"partOfSpeech":"v.","definition":{"en":"Less common (technical): past tense/past participle of “hob” meaning to cut gear teeth using a “hob” (a type of cutting tool).","zh":"较少见（技术用法）：“hob”的过去式/过去分词：用滚刀（hob，一种切削刀具）加工齿轮齿形。"},"examples":[{"en":"The gear blank was hobbed to the required profile.","zh":"齿轮毛坯通过滚齿加工成所需齿形。"}]}],"synonyms":["hobnailed","studded","spiked"],"phonetic":"/hɑbd/","extraExplanation":["“hobnail（鞋钉）”常见于过去的工靴/军靴：在鞋底钉金属钉以增强耐磨和防滑，因此“hobbed boots/shoes”带有一种偏复古、粗犷的形象。","在文学或历史语境里，hobbed/hobnailed 常用来暗示劳动者、士兵或长途跋涉者的生活方式；同时也可能强调走路时“咔嗒”作响的声音。","如果你是在机械加工/工程文本里见到 hobbed，它通常与齿轮加工有关；日常英语里更常见的是与鞋钉相关的意思。"]}
{"word":"hobber","summary":{"en":"A technical word for a gear-hobbing machine or its operator.","zh":"一个偏技术的词，指滚齿机或其操作员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Manufacturing) A machine—or sometimes the operator—that cuts gear teeth using a rotating cutting tool called a hob.","zh":"（制造业）滚齿机；也可指操作滚齿机的人，用称为“滚刀（hob）”的旋转刀具加工齿轮齿形。"},"examples":[{"en":"The factory bought a new CNC hobber to speed up gear production.","zh":"工厂买了一台新的数控滚齿机来加快齿轮生产。"},{"en":"Ask the hobber to check the cutter alignment before starting the run.","zh":"开工前让滚齿机操作员检查一下刀具的对中。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Someone or something that hobs (does hob-cutting or a similar cutting action).","zh":"（少见）进行“hob”式切削的人或物（泛指用滚刀等进行切削的主体）。"},"examples":[{"en":"In older workshop notes, the hobber is listed separately from the finisher.","zh":"在较旧的车间记录里，“hobber”（切齿工）会和“finisher”（精加工者）分开列出。"}]}],"synonyms":["hobbing machine","gear hobber","gear-cutting machine","machine operator"],"phonetic":"/ˈhɑbər/","extraExplanation":["“hobber”并不是日常英语词汇，最常见于机械加工/齿轮制造领域（gear hobbing）。如果你是在聊天或读小说时看到它，有可能是拼写误差或听写造成的（例如把更常见的词看成/写成了 hobber）。"]}
{"word":"Hobbes","summary":{"en":"Hobbes usually refers to Thomas Hobbes, an English philosopher famous for *Leviathan* and ideas about strong government and social order; it can also be a surname.","zh":"Hobbes 通常指英国哲学家托马斯·霍布斯，以《利维坦》和强调强政府与社会秩序的思想闻名；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Thomas Hobbes (1588–1679), an English philosopher best known for his political theory in *Leviathan*, arguing that strong government is needed to prevent social chaos.","zh":"托马斯·霍布斯（1588–1679），英国哲学家，以《利维坦》中的政治理论最著名；他认为为了避免社会陷入混乱，需要强有力的政府。"},"examples":[{"en":"In political philosophy class, we read Hobbes alongside Locke and Rousseau.","zh":"在政治哲学课上，我们把霍布斯与洛克、卢梭放在一起阅读。"},{"en":"Hobbes argued that without a strong authority, life could become violent and unstable.","zh":"霍布斯认为，如果没有强有力的权威，生活可能会变得暴力而不稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) of English origin; used to refer to people with that last name.","zh":"英语来源的姓氏；用于指姓霍布斯（Hobbes）的人。"},"examples":[{"en":"Dr. Hobbes will see you at 3 p.m.","zh":"霍布斯医生会在下午三点见你。"}]}],"phonetic":"/hɑbz/","extraExplanation":["《利维坦》（*Leviathan*，1651）是霍布斯最重要的著作之一。“Leviathan”原指《圣经》中巨兽，这里借喻“强大的国家/主权者”。","霍布斯常与“社会契约”思想联系在一起：人们为了安全与秩序，把部分自由交给共同的权威（国家）。这也是英语里常见的对比：Hobbes（强调秩序与权威） vs. Locke（更强调权利与限制政府）。","英语里有时会提到“a Hobbesian view/world”，意思是“霍布斯式的观点/世界观”，通常强调冲突、竞争、需要强力规则来维持秩序。"]}
{"word":"Hobbes-like","summary":{"en":"Hobbesian; stressing human conflict and the need for strong order.","zh":"霍布斯式的；强调人性冲突与强秩序/强权的必要。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling the ideas of the English philosopher Thomas Hobbes, especially a pessimistic view of human nature and society (life without strong order is dangerous), or support for strong centralized authority to keep peace.","zh":"类似英国哲学家霍布斯（Thomas Hobbes）的观点，尤指对人性与社会持悲观看法（缺乏强力秩序会很危险），或主张以强有力的中央权威来维持和平。"},"examples":[{"en":"The novel paints a Hobbes-like world where fear and violence shape everyday life.","zh":"这部小说描绘了一个霍布斯式的世界：恐惧与暴力决定了日常生活。"},{"en":"Some critics call the policy Hobbes-like because it prioritizes security over individual freedom.","zh":"一些批评者称该政策很“霍布斯式”，因为它把安全置于个人自由之上。"},{"en":"His essay offers a Hobbes-like account of politics: without rules, people quickly turn against each other.","zh":"他的文章给出了霍布斯式的政治解释：没有规则，人们很快就会彼此对立。"}]}],"synonyms":["Hobbesian","authoritarian","pessimistic","cynical","bleak","security-first"],"phonetic":"ˈhɑbzˌlaɪk","extraExplanation":["霍布斯（1588–1679）在《利维坦》（Leviathan）中提出：若没有共同权威约束，人们处于“自然状态”会互相猜疑与冲突，因此需要强力的国家/主权者来维持秩序。英语里说 Hobbes-like，通常就是指这种“人性偏自利、社会易失序、需要强权稳定”的思路。"],"etymology":"由人名 Hobbes（托马斯·霍布斯）+ 后缀 -like（“像……一样”）构成；常用于学术/评论语境，表示“带有霍布斯思想色彩的”。","mnemonic":["把 Hobbes 联想成“好BOSS”：霍布斯式观点里需要一个很强的“Boss（主权者）”来管住混乱。","记住 -like = “像……一样”，所以 Hobbes-like = “像霍布斯那样的（悲观人性/强调秩序）”。"]}
{"word":"hobbesian","summary":{"en":"Hobbesian means related to Thomas Hobbes, especially the idea that strong authority is needed to prevent conflict and chaos.","zh":"hobbesian 指与霍布斯及其思想相关，常强调需要强权来防止冲突与混乱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the English philosopher Thomas Hobbes or his political ideas, especially the view that without strong authority, people may fall into violent conflict.","zh":"与英国哲学家托马斯·霍布斯（Thomas Hobbes）或其政治思想有关的；尤指认为若缺乏强有力的权威，人们可能陷入暴力冲突的观点。"},"examples":[{"en":"Some critics say the movie has a Hobbesian view of humanity: people become cruel when rules disappear.","zh":"一些评论家认为这部电影呈现了对人性的“霍布斯式”看法：当规则消失时，人会变得残酷。"},{"en":"In a Hobbesian state of nature, life is often described as “nasty, brutish, and short.”","zh":"在霍布斯所说的“自然状态”中，生活常被描述为“肮脏、野蛮而短暂”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Characterized by fear, competition, and the need for strict control to keep order (often used more generally, not just in philosophy).","zh":"（更广义用法）带有恐惧与竞争色彩、需要严格控制才能维持秩序的；偏冷峻、强硬的。"},"examples":[{"en":"The office politics felt Hobbesian—everyone was competing, and no one trusted anyone else.","zh":"办公室政治让人感觉很“霍布斯式”——人人竞争，彼此不信任。"},{"en":"The novel portrays a Hobbesian world where security matters more than freedom.","zh":"这部小说描绘了一个“霍布斯式”的世界：安全比自由更重要。"}]}],"synonyms":["Hobbes-like","authoritarian (context-dependent)","Leviathan-style (context-dependent)"],"phonetic":"/hɑːbˈziːən/","extraExplanation":["“Hobbesian”来自17世纪哲学家托马斯·霍布斯。他在《利维坦》（Leviathan, 1651）中主张：为了避免人类在“自然状态”下相互伤害，人们会通过社会契约把部分自由交给强有力的政府，以换取安全与秩序。","在学术与新闻语境里，Hobbesian常用来对比“Lockean（洛克式）”或“Rousseauian（卢梭式）”的人性与政治观：霍布斯更强调冲突与秩序需求。"]}
{"word":"Hobbesianism","summary":{"en":"Hobbes’s philosophy stressing strong authority to maintain social order.","zh":"强调以强权威维持社会秩序的霍布斯思想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The political and philosophical ideas associated with Thomas Hobbes, especially the view that strong authority is needed to prevent social chaos and violence.","zh":"（霍布斯主义）与哲学家托马斯·霍布斯相关的政治与哲学思想，尤其强调需要强有力的权威来防止社会陷入混乱与暴力。"},"examples":[{"en":"Some critics call the policy Hobbesianism because it prioritizes security over individual freedom.","zh":"一些批评者称这项政策带有霍布斯主义色彩，因为它把安全置于个人自由之上。"},{"en":"In political theory class, we compared Hobbesianism with Locke’s ideas about limited government.","zh":"在政治理论课上，我们把霍布斯主义与洛克关于有限政府的观点作了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"A belief that human beings, without rules and enforcement, tend toward conflict, so social order depends on a powerful state or shared authority.","zh":"一种认为人类在缺乏规则与执行力量时容易走向冲突的看法，因此社会秩序依赖强大的国家或共同权威。"},"examples":[{"en":"His argument has a Hobbesianism at its core: without enforcement, agreements collapse.","zh":"他的论证核心带有霍布斯式思路：没有执行力，协议就会瓦解。"},{"en":"The novel’s bleak world reflects Hobbesianism, where fear drives people to seek control.","zh":"这部小说的阴郁世界观体现了霍布斯式思想：恐惧驱使人们追求控制。"}]}],"synonyms":["Hobbesian thought","Hobbesian philosophy","authoritarianism","statism"],"phonetic":"/ˈhɑːbziənˌɪzəm/","extraExplanation":["霍布斯有一句常被引用的概括：在缺乏共同权威时，人类处于“人人对人人的战争”（war of all against all）的状态，生活“孤独、贫穷、肮脏、野蛮而短暂”。因此他主张人们通过“社会契约”把部分权利交给强有力的主权者以换取和平与安全。","日常写作里，Hobbesianism 常用来形容“为了秩序与安全而支持强权/强政府”的倾向；是否赞同取决于语境，有时带批评意味（例如认为过度牺牲自由）。"],"etymology":"源自人名 Thomas Hobbes（托马斯·霍布斯，1588–1679）+ 后缀 -ism（表示“主义/学说”）。其思想在《利维坦》(Leviathan, 1651) 中系统化，影响了后来关于国家、权力与秩序的讨论。","mnemonic":["记忆法：Hobbes（霍布斯）+ -ism（主义）＝“霍布斯的学说”。看到 -ism 就联想到“某某主义”。","联想关键词：fear（恐惧）→ order（秩序）→ strong authority（强权威）。把这条链条当作“霍布斯式逻辑”。"]}
{"word":"Hobbesism","summary":{"en":"Hobbes’s political philosophy or a pessimistic view of human nature needing strong authority.","zh":"霍布斯的政治哲学，或强调人性自利、需强权维持秩序的观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The political and social philosophy associated with Thomas Hobbes, especially the idea that strong authority is needed to prevent conflict and maintain order.","zh":"霍布斯（Thomas Hobbes）的政治与社会哲学思想，尤指为防止冲突、维持秩序而需要强有力权威（如主权者/政府）的观点。"},"examples":[{"en":"Some critics argue that modern surveillance policies reflect Hobbesism more than liberalism.","zh":"一些批评者认为，现代的监控政策更像霍布斯主义，而不是自由主义。"},{"en":"In the debate, he defended Hobbesism by saying security must come before freedom.","zh":"在辩论中，他为霍布斯主义辩护，称安全必须优先于自由。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, a pessimistic view of human nature that emphasizes self-interest and the tendency toward conflict unless restrained by rules or power.","zh":"更广义地指一种对人性较悲观的看法：人往往以自利为先、易发生冲突，除非受到规则或权力的约束。"},"examples":[{"en":"Her reading of the news led her to a kind of Hobbesism about human behavior.","zh":"她读新闻后的感受让她对人性产生了一种“霍布斯式”的悲观。"},{"en":"The novel’s world is built on Hobbesism: distrust is normal, and force decides everything.","zh":"这部小说的世界观建立在霍布斯式逻辑上：不信任是常态，武力决定一切。"}]}],"synonyms":["Hobbesianism","authoritarianism","realism","social contract theory","political pessimism"],"phonetic":"/ˈhɑbzˌɪzəm/","extraExplanation":["霍布斯（1588–1679）代表作《利维坦》（Leviathan, 1651）提出“自然状态”下人类可能陷入普遍冲突（常被概括为“战争状态”），因此人们通过“社会契约”把部分权利让渡给主权者，以换取安全与秩序。","在日常写作里，Hobbesism 有时不严格等同于霍布斯本人全部观点，而是泛指“为了秩序而偏向强权/强政府”的立场；使用时可注意语境是否带批评意味。"],"etymology":"由哲学家 Thomas Hobbes（托马斯·霍布斯）之姓 Hobbes + 后缀 -ism（“……主义/学说”）构成，用来指其思想体系或相关倾向。","mnemonic":["记法：Hobbes + -ism＝“霍布斯的主义”。把 -ism 直接联想成中文的“主义/学说”。","联想《利维坦》：想到“巨兽般的主权者/国家”来维持秩序，就容易记住 Hobbesism 的核心：安全与秩序优先。"]}
{"word":"hobbet","summary":{"en":"“Hobbet” is usually a misspelling of “hobbit,” Tolkien’s word for a small, human-like fictional people in Middle-earth.","zh":"“hobbet”通常是“hobbit”的拼写错误；“hobbit”指托尔金中土世界里的矮小、类人的虚构族群——霍比特人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, human-like fictional creature from J.R.R. Tolkien’s Middle-earth stories (especially *The Hobbit* and *The Lord of the Rings*)","zh":"（托尔金作品《霍比特人》《指环王》中）一种身材矮小、类人的虚构生物：霍比特人"},"examples":[{"en":"Bilbo Baggins is a hobbit who goes on an unexpected adventure.","zh":"比尔博·巴金斯是一名霍比特人，他踏上了一场意想不到的冒险。"},{"en":"In the story, the hobbits value home, food, and a peaceful life.","zh":"在故事里，霍比特人重视家庭、美食和宁静的生活。"}]}],"synonyms":["Halfling (related term)"],"phonetic":"/ˈhɑbɪt/","extraExplanation":["你输入的 **hobbet** 很可能是 **hobbit** 的拼写错误。**Hobbit** 是托尔金创造的专有名词，英文里常写作 **a hobbit / hobbits**（复数）。","在《指环王》的世界观里，hobbits 也常被称为 **Halflings（半身人）**；这个称呼更像外族给他们起的外号。"]}
{"word":"hobbian","summary":{"en":"Hobbesian means “connected to Thomas Hobbes,” often describing a violent, chaotic society without strong authority.","zh":"Hobbesian 指“与霍布斯及其思想有关”，常用来形容缺乏强权约束时暴力、混乱的社会状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the English philosopher Thomas Hobbes or to his ideas, especially the belief that without strong authority society becomes violent and chaotic (“a war of all against all”).","zh":"与英国哲学家托马斯·霍布斯（Thomas Hobbes）或其思想有关的；尤指认为若缺乏强有力的权威与秩序，人类社会会陷入暴力与混乱（“人人与人人为敌的战争”）。"},"examples":[{"en":"Some people describe the world of the novel as Hobbesian, where everyone fights for survival.","zh":"有人把这部小说的世界形容为“霍布斯式”的：人人为求生存而互相争斗。"},{"en":"He argues that a strong government is needed to prevent a Hobbesian state of nature.","zh":"他主张需要强有力的政府来避免出现“霍布斯式的自然状态”。"}]},{"partOfSpeech":"adj.","definition":{"en":"harshly competitive, distrustful, and driven by fear, as if life were a constant struggle.","zh":"（引申）残酷竞争的、充满不信任与恐惧的；仿佛生活是一场持续斗争。"},"examples":[{"en":"The office culture felt Hobbesian after the layoffs.","zh":"裁员之后，这家公司办公室文化让人感觉很“霍布斯式”——充满戒备与竞争。"},{"en":"In a Hobbesian environment, people may cooperate less and suspect others more.","zh":"在“霍布斯式”的环境里，人们可能更少合作、更多猜疑他人。"}]}],"synonyms":["brutal","cutthroat","lawless","anarchic","Hobbes-like"],"phonetic":"/hɑbˈziən/","extraExplanation":["你输入的 **hobbian** 通常是拼写误差；标准拼写是 **Hobbesian**（来自 Thomas Hobbes）。在学术写作里常用来谈政治哲学：霍布斯认为在人类没有共同权威约束的“自然状态”中，安全缺失会导致持续冲突，因此需要“社会契约”与强有力的主权者（利维坦）来维持秩序。"]}
{"word":"hobbies","summary":{"en":"“Hobbies” means the activities someone enjoys doing in their free time.","zh":"“hobbies”指人们在空闲时间喜欢做的兴趣活动（“hobby”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Activities you do regularly for enjoyment in your free time (not as your main job).","zh":"你在空闲时间经常做、为了娱乐和兴趣（不是主要工作）的活动。"},"examples":[{"en":"My hobbies include reading, cooking, and hiking.","zh":"我的爱好包括阅读、做饭和徒步。"},{"en":"What are your hobbies?","zh":"你的爱好是什么？"},{"en":"She met new friends through her hobbies.","zh":"她通过自己的爱好结识了新朋友。"}]}],"synonyms":["pastimes","interests","leisure activities"],"phonetic":"/ˈhɑbiz/","extraExplanation":["“hobbies”是“hobby”的复数形式。谈论一个人的兴趣活动时常用复数：My hobbies are… / I have many hobbies.","常见搭配：take up a hobby（培养/开始一个爱好）、have a hobby（有一个爱好）、share a hobby（共享爱好）、favorite hobby（最喜欢的爱好）。","近义区分：hobby更偏“长期、固定的兴趣”；interest更广泛；pastime偏“消遣”；leisure activity偏“休闲活动”。"]}
{"word":"hobbil","summary":{"en":"“Hobbil” is likely a misspelling of “hobbit,” meaning a Tolkien character (and informally, a homebody).","zh":"“hobbil”很可能是“hobbit”的拼写错误，指托尔金作品中的霍比特人（也可非正式地指爱宅在家的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small human-like character in J.R.R. Tolkien’s stories (The Hobbit, The Lord of the Rings), usually shown as peace-loving and fond of home.","zh":"托尔金作品中的一种“霍比特人”（《霍比特人》《指环王》），通常被描绘成爱好和平、喜欢居家生活的小个子类人种族。"},"examples":[{"en":"Bilbo Baggins is a hobbit in Tolkien’s novel The Hobbit.","zh":"比尔博·巴金斯是托尔金小说《霍比特人》中的一位霍比特人。"},{"en":"The movie shows hobbits living in the Shire.","zh":"电影里展现了霍比特人住在夏尔。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: a person who likes staying at home and living a simple, quiet life.","zh":"非正式：喜欢待在家里、过简单安静生活的人。"},"examples":[{"en":"On weekends, I’m a bit of a hobbit—I just read and relax at home.","zh":"周末我有点像“霍比特人”——就想在家看书放松。"}]}],"synonyms":["homebody","stay-at-home","introvert (context-dependent)"],"phonetic":"/ˈhɑbɪt/","extraExplanation":["你输入的“hobbil”并不是常见英文单词。最可能是拼写成“hobbit”。在托尔金语境中常用大写 Hobbit（尤其指种族/特定设定），日常比喻用法多写作小写 hobbit。"]}
{"word":"hobbing","summary":{"en":"Hobbing most commonly means a gear-cutting process in manufacturing using a rotating tool called a hob.","zh":"Hobbing 最常见的意思是制造业中的“滚齿”加工：用滚刀旋转切削齿轮齿形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of cutting gear teeth (or splines) using a rotating cutting tool called a hob","zh":"（机械制造）滚齿：用一种叫“滚刀（hob）”的旋转刀具来切削齿轮齿形（或花键）的加工方法"},"examples":[{"en":"Hobbing is a common method for making spur gears in factories.","zh":"滚齿是在工厂里制造直齿轮的一种常见方法。"},{"en":"The engineer checked the surface finish after hobbing.","zh":"工程师在滚齿后检查了表面光洁度。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of cutting something with a hob (especially gears); also the present participle of “hob” in technical use","zh":"用滚刀进行切削（尤指齿轮加工）的动作；也可作动词 hob 的现在分词（技术语境）"},"examples":[{"en":"They are hobbing gears for the new gearbox.","zh":"他们正在为新的变速箱滚齿加工齿轮。"}]},{"partOfSpeech":"other","definition":{"en":"an informal spelling variation sometimes seen for “hobbing” meaning “hobbling” (walking with difficulty), though this is uncommon and usually considered a misspelling","zh":"非正式拼写：偶见用 hobbing 代指 hobbling（跛行、行动困难），但较少见，通常被认为是拼写错误"},"examples":[{"en":"Standard spelling: He was hobbling after the game. (Not: hobbing.)","zh":"标准拼写：比赛后他一瘸一拐地走。（一般不用 hobbing。）"}]}],"synonyms":["gear cutting","gear machining"],"phonetic":"/ˈhɑbɪŋ/","extraExplanation":["在制造业里，hobbing（滚齿）通常用于批量生产齿轮，优点是效率高、精度稳定。常见搭配有 hobbing machine（滚齿机）、hob cutter / hob（滚刀）、gear hobbing（齿轮滚齿）。","如果你是在日常语境里想表达“跛行”，更常用的是 hobbling；而 hobby（爱好）的进行式是 hobbying。"]}
{"word":"hobbinoll","summary":{"en":"Hobbinoll is a proper name for a shepherd character in Spenser’s *The Shepheardes Calender* (1579).","zh":"Hobbinoll 是斯宾塞《牧人历书》（1579）中一位牧羊人角色的名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a shepherd character’s name in Edmund Spenser’s pastoral poem *The Shepheardes Calender* (1579), often read as a literary “mask” for the scholar Gabriel Harvey","zh":"（专有名词）英国诗人斯宾塞《牧人历书》（1579）中的牧羊人角色名，常被解读为学者加布里埃尔·哈维（Gabriel Harvey）的文学化身"},"examples":[{"en":"In *The Shepheardes Calender*, Hobbinoll speaks as one of the shepherds in the eclogues.","zh":"在《牧人历书》中，Hobbinoll 以牧羊人的身份在多篇牧歌（eclogues）里发言。"},{"en":"Some readers interpret Hobbinoll as Spenser’s way of portraying his real-life friend Gabriel Harvey.","zh":"一些读者认为 Hobbinoll 是斯宾塞用来描绘现实中朋友加布里埃尔·哈维的写法。"}]}],"synonyms":["pastoral character","shepherd (literary figure)"],"phonetic":"ˈhɑbɪˌnɔl","extraExplanation":["“Hobbinoll”属于文艺复兴时期牧歌传统里的“牧人化名”（pastoral persona）：作者常用乡野牧羊人的身份来谈论现实中的文学、政治或宗教话题。","名字里的“Hob-”常见于英语里偏口语/民间的人名或绰号（如 Hob, Robin 等），带有朴素、乡村的感觉；斯宾塞用这种命名来强化“田园牧歌”的氛围。"]}
{"word":"hobbism","summary":{"en":"Hobbism is a rare term meaning the philosophy associated with Thomas Hobbes, often emphasizing strong authority to maintain social order.","zh":"Hobbism（较少见）指霍布斯主义：与托马斯·霍布斯相关的哲学与政治思想，常强调以强有力的权威维持社会秩序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The political and philosophical ideas associated with Thomas Hobbes, especially the belief that strong government is needed to prevent conflict in human society.","zh":"霍布斯主义：指与英国哲学家托马斯·霍布斯相关的政治与哲学思想，尤其强调为了避免人类社会冲突，需要强有力的政府与秩序。"},"examples":[{"en":"Some critics call the policy ‘Hobbism’ because it favors strong central control.","zh":"一些批评者把这项政策称为“霍布斯主义”，因为它偏向强有力的中央控制。"},{"en":"In political theory class, we compared Hobbism with Locke’s ideas about rights.","zh":"在政治理论课上，我们把霍布斯主义与洛克关于权利的观点作了比较。"}]}],"synonyms":["Hobbesism","Hobbesianism"],"phonetic":"/ˈhɑːbɪzəm/","extraExplanation":["“Hobbism”比较少见，更常见的拼写是“**Hobbesism** / **Hobbesianism**（霍布斯主义）”。它常与霍布斯在《利维坦》（Leviathan, 1651）中的观点相关：如果没有共同权威，人类可能陷入“人人与人人为敌”的状态，因此需要强力的社会契约与主权来维持和平。","注意不要与“**hobbyism**（沉迷/从事业余爱好）”混淆；两者词源不同，一个来自人名Hobbes，另一个来自hobby（爱好）。"]}
{"word":"hobbist","summary":{"en":"A hobbyist is someone who does an activity for enjoyment, not as a profession.","zh":"hobbyist 指把某项活动当作爱好来做的业余爱好者，而不是职业人士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who does an activity for pleasure in their free time (not as a job).","zh":"业余爱好者；把某项活动当作爱好来做的人（不以此为职业）。"},"examples":[{"en":"She’s a hobbyist photographer who takes photos on weekends.","zh":"她是个业余摄影爱好者，周末会去拍照。"},{"en":"Many hobbyists build model airplanes at home.","zh":"很多业余爱好者会在家制作飞机模型。"},{"en":"As a hobbyist, he enjoys repairing old radios.","zh":"作为业余爱好者，他喜欢修理旧收音机。"}]}],"synonyms":["amateur","enthusiast","dabbler"],"phonetic":"/ˈhɑbiɪst/","extraExplanation":["你输入的 **hobbist** 通常是拼写错误；正确拼写是 **hobbyist**（双 b + y）。","常见搭配：hobbyist photographer（业余摄影爱好者）、electronics hobbyist（电子爱好者）、hobbyist programmer（业余程序员）。语气中性，强调“兴趣驱动、非职业”。"]}
{"word":"hobbistical","summary":{"en":"“Hobbistical” means hobby-related or done as an amateur rather than professionally.","zh":"“hobbistical”表示“与业余爱好有关的；非职业、业余进行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hobby or a hobbyist; done in an amateur (not professional) way.","zh":"与业余爱好或爱好者有关的；以业余（非职业）方式进行的。"},"examples":[{"en":"His hobbistical interest in astronomy led him to buy a small telescope.","zh":"他对天文学的业余爱好让他买了一架小望远镜。"},{"en":"The project started as a hobbistical experiment but later became a small business.","zh":"这个项目起初只是一次业余实验，后来却发展成了一门小生意。"}]}],"synonyms":["hobby-related","amateur","recreational","nonprofessional"],"phonetic":"/hɑˈbɪstɪkəl/","extraExplanation":["“hobbistical”在现代英语中很少见，更多时候人们会用更常用的形容词：hobby（作定语，如 hobby shop）、hobbyist（如 hobbyist community）、amateur、nonprofessional 或 recreational。","构词上它可以理解为 hobbyist + -ical（表示“与……有关的”），因此语气上常带一点“业余/非正式”的感觉；在正式写作里建议用更常见的替代表达。"]}
{"word":"hobbit","summary":{"en":"A hobbit is a small, human-like fictional being from J.R.R. Tolkien’s Middle-earth stories.","zh":"hobbit 指托尔金“中土世界”作品中的一种矮小、类人的虚构生物——霍比特人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, human-like fictional creature in J.R.R. Tolkien’s stories, especially The Hobbit and The Lord of the Rings","zh":"（托尔金作品中的）霍比特人：一种身材矮小、类似人类的虚构生物，主要出现在《霍比特人》和《指环王》中"},"examples":[{"en":"Bilbo Baggins is a hobbit in Tolkien’s novel The Hobbit.","zh":"比尔博·巴金斯是托尔金小说《霍比特人》里的一个霍比特人。"},{"en":"In the story, the hobbits prefer quiet village life to adventure.","zh":"在故事里，霍比特人更喜欢安静的乡村生活，而不是冒险。"}]}],"synonyms":["Halfling (related term in fantasy)"],"phonetic":"/ˈhɑbɪt/","extraExplanation":["“Hobbit”是托尔金创造的专有名词（虚构种族名），后来因电影和流行文化而广为人知。一般写作时首字母常大写（Hobbit），但在讨论“这种生物”时也常用小写。","在托尔金设定中，霍比特人的典型形象包括：身材矮小、喜欢舒适与美食、重视家庭与家园，脚底多毛且常赤脚行走。","“Hobbit”在现实生活里有时会被借用来形容“喜欢宅在家、追求舒适、讨厌折腾的人”，但这种用法带有比喻色彩，是否礼貌取决于语境。"]}
{"word":"hobbits","summary":{"en":"Tolkien’s small, human-like people from Middle-earth","zh":"托尔金中土世界中的矮小类人族群"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small, human-like people in J.R.R. Tolkien’s Middle-earth stories, known for living in the Shire and enjoying a peaceful, simple life","zh":"J.R.R. 托尔金《中土世界》故事中的一种矮小、类人族群，以住在夏尔、喜爱安稳朴素的生活而著称"},"examples":[{"en":"In The Lord of the Rings, hobbits leave the Shire and face great danger.","zh":"在《指环王》中，霍比特人离开夏尔，面对巨大的危险。"},{"en":"Hobbits are often portrayed as brave in unexpected ways.","zh":"霍比特人常被描写为以出人意料的方式展现勇气。"},{"en":"Many readers love hobbits for their warmth, humor, and love of home.","zh":"许多读者喜爱霍比特人的温暖、幽默和恋家的性格。"}]}],"synonyms":["halflings"],"phonetic":"/ˈhɑːbɪts/","extraExplanation":["在托尔金的设定中，hobbits 也常被称为 halflings（“半身人”），强调他们身材比普通人类更矮小。","书名常见写法：The Hobbit（《霍比特人》），The Lord of the Rings（《指环王》）。在讨论角色时，复数 hobbits 指“霍比特人”这个族群或多个个体。"],"etymology":"这是托尔金创造的词（单数 Hobbit，复数 hobbits），并非传统英语词汇。托尔金后来在作品中用“hole-dweller（住洞的人）”来做一种带剧情的“民间词源”解释。","mnemonic":["把 hobbits 记成“home + habits（家+习惯）”：他们爱家、爱规律生活（吃饭次数多、喜欢舒适）。","联想 hobbit 里有 hob（炉灶/灶台的说法），想起温暖的厨房与家常生活，很“夏尔”。"]}
{"word":"hobble","summary":{"en":"Hobble means to walk with difficulty (often from injury), or to restrict progress; it can also be a strap used to keep an animal from running off.","zh":"hobble 指（受伤等导致）一瘸一拐地走；也可指限制、妨碍（进展）；名词还可指拴住动物腿使其不易跑远的绊索。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to walk in a slow, awkward way because of pain, injury, or difficulty","zh":"（因疼痛、受伤或不便而）一瘸一拐地走，蹒跚而行"},"examples":[{"en":"After the game, he hobbled back to the locker room with a sore ankle.","zh":"比赛结束后，他脚踝疼痛，一瘸一拐地走回更衣室。"},{"en":"The dog hobbled across the yard after stepping on something sharp.","zh":"那只狗踩到尖东西后，一瘸一拐地穿过院子。"}]},{"partOfSpeech":"vt.","definition":{"en":"to restrict or limit someone or something; to make it harder to move or develop","zh":"限制；束缚；妨碍（发展或行动）"},"examples":[{"en":"A lack of funding hobbled the project for months.","zh":"资金不足使这个项目好几个月都进展受阻。"},{"en":"Too many rules can hobble creativity.","zh":"规则太多会束缚创造力。"}]},{"partOfSpeech":"n.","definition":{"en":"a device or strap used to tie an animal’s legs together to prevent it from running away","zh":"（拴马等的）系腿绊索；脚镣（使其不能跑远）"},"examples":[{"en":"The horse was kept in the field with a hobble.","zh":"那匹马在田里用系腿绊索拴着。"},{"en":"They put hobbles on the goats so they wouldn’t wander far.","zh":"他们给山羊套上系腿绊索，免得走太远。"}]}],"synonyms":["limp","shuffle","hinder","hamper","restrict"],"phonetic":"/ˈhɑbəl/","extraExplanation":["“hobble”既可描述身体受伤后的“走路一瘸一拐”，也常用于比喻：某事“拖后腿/使受限”，比如经济、政策、规则等会“hobble”某个计划或行业。","与“limp”相比：两者都可表示“跛行”；但“hobble”更强调步伐笨拙、行动受限的感觉，也更常用于比喻“限制/束缚”。"]}
{"word":"hobblebush","summary":{"en":"Hobblebush is a North American woodland shrub with large leaves, white flower clusters, and berries.","zh":"Hobblebush 是北美林地的一种灌木，叶大、开白花成簇，并结浆果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woodland shrub native to northeastern North America (Viburnum lantanoides) with large leaves, flat clusters of white flowers, and red-to-black berries.","zh":"一种生长于北美东北部林地的灌木（又称“hobblebush”，学名 Viburnum lantanoides），叶片大，开白色伞房状花序，果实由红转黑。"},"examples":[{"en":"We saw hobblebush blooming along the shady forest trail in late spring.","zh":"我们在春末沿着阴凉的林间小道看到了正在开花的 hobblebush。"},{"en":"Hobblebush is easy to recognize by its big, soft leaves and white flower clusters.","zh":"hobblebush 很好辨认：叶子又大又柔软，花是一簇簇白色的。"}]}],"synonyms":["witch-hobble","moosewood viburnum","Viburnum lantanoides"],"phonetic":"/ˈhɑbəlˌbʊʃ/","extraExplanation":["“hobblebush”这个名字来自它常在林下蔓生、枝条容易绊住脚（hobble=跛行/一瘸一拐地走），早期行走在林地的人会觉得它“让人走路不利索”。","它常见于湿润、阴凉的阔叶林边缘或林下，在美国东北部和加拿大东部较常见；花期多在春末到初夏，果实成熟后会从红色逐渐变深。"]}
{"word":"hobbled","summary":{"en":"“Hobbled” means (1) walked with difficulty or (2) was limited/weakened, often by a problem like injury or cost.","zh":"“hobbled”表示（1）一瘸一拐地走；（2）被问题（如伤病、成本等）限制或拖累。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “hobble”) to walk with difficulty, especially because of an injury, or to make someone/something walk with difficulty.","zh":"（“hobble”的过去式/过去分词）一瘸一拐地走（常因受伤）；或使某人/某物行动不便。"},"examples":[{"en":"He hobbled across the street after twisting his ankle.","zh":"他扭伤脚踝后，一瘸一拐地穿过马路。"},{"en":"The rider hobbled the horse so it couldn’t run away.","zh":"骑手把马的腿拴住，让它跑不掉。"}]},{"partOfSpeech":"adj.","definition":{"en":"Restricted or weakened; not working well or not able to move freely.","zh":"受限制的；削弱的；运转不良的；行动不自由的。"},"examples":[{"en":"The team was hobbled by injuries all season.","zh":"整个赛季这支队伍都被伤病拖累。"},{"en":"Small businesses can be hobbled by high rent and rising costs.","zh":"高房租和不断上涨的成本会让小企业举步维艰。"}]}],"synonyms":["limped","hindered","hampered","crippled","restricted"],"phonetic":"/ˈhɑbəld/","extraExplanation":["“hobble”既可指身体上“跛行”，也常用于比喻：hobbled by + 名词（injuries / debt / rules 等）表示“被……拖累、受……限制”，在新闻和体育报道里很常见。"]}
{"word":"hobbledehoy","summary":{"en":"A rare, old-fashioned word for an awkward, immature teenage boy or young man.","zh":"较少见且偏老派的词，指举止笨拙、不成熟的半大少年或年轻男子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an awkward, immature young man (especially a teenage boy) who is no longer a child but not yet a grown man","zh":"（尤指十几岁的）半大不小的男孩；举止笨拙、尚不成熟的少年"},"examples":[{"en":"He was a tall hobbledehoy, all arms and legs, unsure what to do with himself.","zh":"他是个高个子的半大少年，手脚都显得多余，不知道该把自己放在哪儿。"},{"en":"The novel follows a hobbledehoy as he learns manners, work, and responsibility.","zh":"小说写的是一个毛头小子如何学会礼貌、工作与责任。"}]}],"synonyms":["awkward teen","gangly teenager","immature youth","lanky boy"],"phonetic":"/ˈhɑbəlˌdiˌhɔɪ/","extraExplanation":["这个词比较老派、带点调侃意味，如今不常用；更常见的说法是 “awkward teenager / gangly teen / immature young man”。","词源上多被认为与 “hobble”（蹒跚、动作笨拙）有关，后半部分源自较早表示“男孩”的用法；整体用来形容从儿童过渡到成人阶段的“别扭期”。"]}
{"word":"hobbledehoydom","summary":{"en":"Hobbledehoydom means the awkward, immature stage of being a hobbledehoy—an ungainly teenage boy or young man.","zh":"hobbledehoydom 指“半大男孩”的状态/时期，即青春期笨拙、不成熟的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a hobbledehoy (an awkward, immature, or ungainly teenage boy or young man); awkward adolescence","zh":"“半大男孩”的状态或时期；指男孩/青年在青春期显得笨拙、不成熟的阶段"},"examples":[{"en":"The novel treats his hobbledehoydom with humor and sympathy, showing how he grows into confidence.","zh":"小说以幽默又同情的笔触描写他那段“半大男孩时期”，展现他如何逐渐变得自信。"},{"en":"In photos from his hobbledehoydom, he looks all arms and legs, unsure where to put his hands.","zh":"他“半大男孩时期”的照片里四肢伸展、手脚无处安放，显得很不自在。"}]}],"synonyms":["awkward adolescence","adolescence","youth (context-dependent)","immaturity (context-dependent)"],"phonetic":"/ˈhɑbəl diˈhɔɪdəm/","extraExplanation":["这是一个很少见、带点文学/幽默色彩的词：hobbledehoy（笨拙的半大男孩）+ -dom（表示“状态/领域/时期”，如 kingdom, freedom）。","hobbledehoy 常用来轻微调侃青春期的尴尬与不成熟，一般不用于正式写作；若怕冒犯，可改用 more neutral 的说法如 “awkward adolescence”。"]}
{"word":"hobbledehoyhood","summary":{"en":"Hobbledehoyhood means the awkward, in-between stage of adolescence—no longer a child but not yet a confident adult.","zh":"Hobbledehoyhood 指“半大不小”的青涩青春期：不再是孩子，却也还未成为成熟自信的成年人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a hobbledehoy; awkward, in-between adolescence (not quite a child, not quite an adult)","zh":"“半大不小”的少年时期；介于孩童与成人之间、举止略显笨拙尴尬的青春期阶段"},"examples":[{"en":"He looked back on his hobbledehoyhood with affection, remembering how clumsy and unsure he felt.","zh":"他带着温情回想自己的“半大不小”少年时期，记得那时自己有多笨拙、多没把握。"},{"en":"The novel captures the confusion of hobbledehoyhood—the sudden height, the cracking voice, and the need to fit in.","zh":"这部小说抓住了“半大不小”阶段的困惑：突然长高、变声，以及想融入同伴的强烈需求。"}]}],"synonyms":["adolescence","awkward adolescence","teenage years","youth"],"phonetic":"/ˈhɑbəlˌdiːhɔɪhʊd/","extraExplanation":["“hobbledehoyhood”由 hobbledehoy（指举止笨拙、尚未成熟的少年）+ -hood（表示“状态/时期”，如 childhood）构成，语气略带幽默或轻微调侃，多见于文学或较老派的英语表达。","hobbledehoy 早期用法常指“行动不协调、还在长个儿的男孩”，现代也可更宽泛地指“青涩笨拙的青春期人”。使用时注意语境：若描述他人，可能带一点戏谑。"]}
{"word":"hobbledehoyish","summary":{"en":"Hobbledehoyish means awkwardly immature—like a gawky adolescent.","zh":"hobbledehoyish 指像笨拙少年一样不成熟、别扭。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Awkwardly or foolishly immature; like an ungainly adolescent (especially a boy).","zh":"（尤指男孩）像笨拙少年一样的；不成熟而显得傻气、别扭的。"},"examples":[{"en":"His hobbledehoyish jokes made the formal meeting feel childish.","zh":"他那些少年般笨拙的玩笑让正式会议显得很幼稚。"},{"en":"The character starts out hobbledehoyish but grows into a confident adult.","zh":"这个角色一开始很“少年气的笨拙”，后来成长为自信的成年人。"}]}],"synonyms":["awkward","gawky","immature","gangly","adolescent","callow"],"phonetic":"ˌhɑbəldəˈhɔɪɪʃ","extraExplanation":["“hobbledehoyish”来自名词“hobbledehoy”，指正处在尴尬成长期的少年（介于孩子与成人之间），常暗示动作笨拙、社交不老练或言行幼稚。这个词比较少见，带一点文学或讽刺色彩。"]}
{"word":"hobbledehoyishness","summary":{"en":"Hobbledehoyishness means the awkward, immature quality typical of an adolescent boy (or someone acting that way).","zh":"hobbledehoyishness 指一种类似青春期男孩的笨拙、青涩和不成熟的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being awkward, immature, or clumsy in a way typical of a teenage boy (or someone acting like one).","zh":"（像青春期男孩那样的）笨拙、不成熟、青涩的特质；少年气的别扭感。"},"examples":[{"en":"There was a sweet hobbledehoyishness in his first attempt to ask her out.","zh":"他第一次鼓起勇气约她出去时，有一种可爱的青涩笨拙感。"},{"en":"The character’s charm comes from his hobbledehoyishness—he tries hard but keeps making small mistakes.","zh":"这个角色的魅力来自他的少年式笨拙——很努力，却总犯些小错。"}]}],"synonyms":["awkwardness","immaturity","adolescent clumsiness","ungainliness"],"phonetic":"/ˌhɑbəldəˈhɔɪɪʃnəs/","extraExplanation":["这是一个非常罕见、带一点幽默或文学色彩的词，来自 **hobbledehoy**（指“举止笨拙的少年/半大不小的男孩”）。**-ish** 表示“有点像……”，**-ness** 把形容词变成名词，所以 hobbledehoyishness 就是“那种少年气的笨拙/不成熟感”。","多见于较老的英语（19世纪到20世纪初）或刻意复古、讽刺的写法；日常口语里更常用：**awkwardness, immaturity, adolescent clumsiness**。"]}
{"word":"hobbledehoyism","summary":{"en":"Hobbledehoyism means awkward, immature behavior typical of adolescence.","zh":"hobbledehoyism 指带有青少年气的笨拙与不成熟行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"awkward, immature behavior—especially the self-consciousness and clumsiness associated with adolescence or someone not yet fully grown up.","zh":"（尤指青少年时期的）笨拙、别扭和不成熟的行为；像“半大不小”的尴尬状态。"},"examples":[{"en":"In his early twenties, he still showed a bit of hobbledehoyism in formal meetings.","zh":"他二十出头，在正式会议上仍带着一点“半大不小”的笨拙感。"},{"en":"The novel portrays the hero’s hobbledehoyism before he learns confidence and tact.","zh":"这部小说描写主人公在学会自信与得体之前的青涩与笨拙。"}]}],"synonyms":["immaturity","awkwardness","adolescence (figurative)","youthful clumsiness"],"phonetic":"ˌhɑbəlˈdiˌhɔɪˌɪzəm","extraExplanation":["这是一个非常少见、偏文学/讽刺色彩的词，来自 hobbledehoy（指“半大小子/毛头小伙”，带一点揶揄语气）+ -ism（表示“某种行为或状态”）。因此 hobbledehoyism 强调的是“像还没长开、还不太会拿捏社交分寸”的尴尬状态。","语体提示：日常英语里更常用 awkward adolescence / teenage awkwardness / immaturity / youthful awkwardness 等表达；hobbledehoyism 更适合用于写作、评论或带幽默感的描述。"]}
{"word":"hobbledehoys","summary":{"en":"“Hobbledehoys” means awkward, clumsy adolescent boys (plural of hobbledehoy).","zh":"“hobbledehoys”指举止笨拙、不得体的青春期男孩（hobbledehoy 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an awkward, clumsy teenage boy (or young man), often one who hasn’t grown into adult manners or confidence yet","zh":"（常指）举止笨拙、不得体的青春期男孩；尚未长成稳重成熟样子的年轻人"},"examples":[{"en":"In middle school he was a hobbledehoy—tall, shy, and always tripping over his own feet.","zh":"在初中时他就是个“hobbledehoy”——个子很高、很害羞，还总是被自己的脚绊倒。"},{"en":"The novel begins with the hero as a hobbledehoy and follows him into adulthood.","zh":"这部小说从男主角还是个笨拙少年写起，一直写到他成年。"}]}],"synonyms":["gangly teen","awkward adolescent","lanky boy","ungainly youth"],"phonetic":"/ˈhɑbəlˌdɪhɔɪ/","extraExplanation":["“hobbledehoy”是较老派、带点文学/幽默色彩的词，现代口语里不算常见；复数就是你输入的“hobbledehoys”。","词源上一般认为与“hobble（跛行、蹒跚）+ boy（男孩）”的联想有关，用来形象地描写青春期动作笨拙、社交不老练的阶段。使用时语气可能带调侃，注意场合与对象的感受。"]}
{"word":"hobbledygee","summary":{"en":"A very rare, old-fashioned word meaning a clumsy, awkward person.","zh":"一个非常罕见、偏古语的词，意思是“笨拙、不灵活的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) a clumsy, awkward person; an oaf.","zh":"（罕见/古语）笨拙、行动不灵活的人；粗笨的人。"},"examples":[{"en":"He moved like a hobbledygee, knocking over chairs as he went.","zh":"他走起路来像个笨手笨脚的人，一路把椅子都碰倒了。"},{"en":"In old comic writing, the hobbledygee is the character who can’t do anything gracefully.","zh":"在旧式滑稽文学里，hobbledygee 常指那种做什么都不利落的角色。"}]}],"synonyms":["clutz","oaf","lout","bungler","klutz"],"phonetic":"/ˈhɑbəlˌdiˌdʒi/","extraExplanation":["这个词在现代英语里极少见，很多词典不收录；你可能会在较旧的幽默/讽刺文字里遇到。","它常被认为与更常见的古词 **hobbledehoy**（笨拙的少年/半大孩子）相近，拼写也可能在不同文本里出现变体。若你是想表达“笨拙的人”，现代更常用 **clumsy person / clutz**。"]}
{"word":"hobbler","summary":{"en":"A “hobbler” is usually someone (or an animal) who walks with difficulty; historically it can also mean a mounted messenger/scout in the American West.","zh":"“hobbler”通常指走路一瘸一拐的人（或动物）；在历史语境中也可指美国西部的骑马传令兵／侦察兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that walks with difficulty or an uneven gait (someone who hobbles).","zh":"跛行者；走路一瘸一拐的人（或动物）。"},"examples":[{"en":"After the long hike, I was a hobbler for the rest of the day.","zh":"长途徒步后，我那一天剩下的时间都走得一瘸一拐。"},{"en":"The dog became a hobbler after hurting its paw.","zh":"那只狗爪子受伤后就开始跛行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, US) A mounted messenger or scout, especially in the 1800s American West and military contexts.","zh":"（历史用法，美国）骑马传令兵／侦察兵，尤指19世纪美国西部及军事语境中。"},"examples":[{"en":"The fort relied on a hobbler to carry messages between outposts.","zh":"那座要塞依靠一名骑马传令兵在各前哨之间传递消息。"},{"en":"In some accounts of the frontier, hobblers rode fast with urgent dispatches.","zh":"在一些边疆记述中，骑马传令兵会快马加鞭递送紧急公文。"}]}],"synonyms":["limper","cripple (often offensive; use carefully)","messenger (historical sense)","scout (historical sense)"],"phonetic":"/ˈhɑb(ə)lər/","extraExplanation":["“hobbler”来自动词“hobble”（一瘸一拐地走；也可指用“hobble”束住马的腿使其不易跑远）。因此它既可指“跛行的人/动物”，也在部分历史语境里指与马匹行动相关的岗位（如骑马传令/侦察）。现代日常英语中最常见的是第一义。"]}
{"word":"hobblers","summary":{"en":"“Hobblers” usually means people/animals who walk with difficulty; in historical texts it can mean medieval light mounted troops.","zh":"“hobblers”通常指跛行者/走路困难的人或动物；在历史文献中也可指中世纪的轻装乘马士兵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that hobbles (walks with difficulty, often because of injury, age, or uneven ground).","zh":"跛行的人或动物；走路困难者（常因受伤、年老或路面不平）。"},"examples":[{"en":"After the long hike, a few hobblers limped back to the campsite.","zh":"长途徒步之后，有几个人一瘸一拐地回到营地。"},{"en":"The vet checked the horse because it had become a hobbler.","zh":"因为那匹马开始跛行，兽医给它做了检查。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) Light cavalry or mounted troops—especially in medieval Ireland and northern England—who rode small horses and could fight on horseback or on foot.","zh":"（历史）轻骑兵/乘马兵（尤指中世纪爱尔兰与英格兰北部），骑小马作战，也可下马步战。"},"examples":[{"en":"The chronicle mentions hobblers scouting the borderlands.","zh":"史书记载“hobblers”在边境地区侦察。"},{"en":"In some texts, hobblers are described as fast-moving mounted soldiers.","zh":"在一些文献中，“hobblers”被描述为机动性很强的乘马士兵。"}]}],"synonyms":["limpers","people who hobble","lame walkers","(historical) light cavalry"],"phonetic":"/ˈhɑblər/","extraExplanation":["“hobblers”是复数形式，单数是“hobbler”。在日常英语里最常见的意思是“跛行者/走路困难者”。","历史义的“hobblers”常见于中古英语史料与军事史语境，和今天口语里说的“hobble（跛行）”有关，但用法更专门，阅读历史文章时才会遇到。"]}
{"word":"hobbles","summary":{"en":"“Hobbles” can mean (1) walks with difficulty/limps, (2) limits or slows progress, or (3) restraints that restrict an animal’s movement.","zh":"“hobbles”可指（1）一瘸一拐地走，（2）阻碍/束缚进展，（3）（给动物用的）束缚物，如缚腿带。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"walks with difficulty, often because of an injury; limps","zh":"一瘸一拐地走；跛行（常因受伤等原因）"},"examples":[{"en":"He hobbles after his knee surgery.","zh":"他膝盖手术后走路一瘸一拐。"},{"en":"The dog hobbles on three legs.","zh":"那只狗用三条腿一瘸一拐地走。"}]},{"partOfSpeech":"v.","definition":{"en":"limits or slows someone/something; prevents free movement or progress (often used figuratively)","zh":"限制或拖慢（某人/某事）；阻碍进展（常作比喻用法）"},"examples":[{"en":"Lack of funding hobbles the project.","zh":"资金不足拖慢了这个项目。"},{"en":"Too many rules can hobble creativity.","zh":"规则太多会束缚创造力。"}]},{"partOfSpeech":"n.","definition":{"en":"straps or restraints used to prevent an animal (especially a horse) from moving freely; restrictions in general","zh":"（尤指给马用的）缚腿带/脚镣等束缚物；（泛指）限制"},"examples":[{"en":"The rancher put hobbles on the horse to keep it from running off.","zh":"牧场主给马套上缚腿带，防止它跑走。"},{"en":"They argued that the new policy would be hobbles on small businesses.","zh":"他们认为新政策会成为小企业的束缚。"}]}],"synonyms":["limps","shuffles","hampers","restricts","impedes","constraints"],"phonetic":"/ˈhɑbəlz/","extraExplanation":["“hobble”既可以指人/动物“走路一瘸一拐”，也可以指“用束缚物限制行动”。因此比喻义“阻碍、束缚”很常见，尤其在新闻或正式写作里（如 funding/regs hobbles progress）。","和“limp”相比：limp 更中性、常用，表示“跛行”；hobble 更强调“走得很吃力/不稳”，或带有“被限制住”的感觉。"]}
{"word":"hobbling","summary":{"en":"“Hobbling” most often means limping or walking with difficulty; it can also mean limiting or hindering something.","zh":"“hobbling”通常指一瘸一拐地走（跛行）；也可引申为限制、束缚或妨碍某事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"walking with difficulty, often because of pain or injury; limping","zh":"（因疼痛或受伤而）一瘸一拐地走；跛行"},"examples":[{"en":"After twisting his ankle, he was hobbling back to his seat.","zh":"扭伤脚踝后，他一瘸一拐地走回座位。"},{"en":"She came in hobbling, leaning on a cane.","zh":"她拄着拐杖，一瘸一拐地走了进来。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of walking with difficulty; limping movement","zh":"一瘸一拐的行走；跛行的动作"},"examples":[{"en":"His hobbling got worse as the day went on.","zh":"随着一天过去，他走路一瘸一拐的情况更严重了。"},{"en":"The doctor asked about the sudden hobbling.","zh":"医生询问他突然跛行的情况。"}]},{"partOfSpeech":"vi.","definition":{"en":"present participle of “hobble”: to walk with difficulty; to limp","zh":"“hobble”的现在分词：一瘸一拐地走；跛行"},"examples":[{"en":"He’s hobbling because his knee hurts.","zh":"他因为膝盖疼所以一瘸一拐地走。"},{"en":"The dog was hobbling along the sidewalk.","zh":"那只狗在人行道上跛着走。"}]},{"partOfSpeech":"vt.","definition":{"en":"present participle of “hobble”: to limit or hinder someone/something, reducing freedom or effectiveness","zh":"“hobble”的现在分词：束缚；限制；妨碍（使不够自由或不够有效）"},"examples":[{"en":"Strict rules are hobbling the team’s creativity.","zh":"严格的规定正在束缚团队的创造力。"},{"en":"High costs are hobbling small businesses.","zh":"高成本正在拖累小企业。"}]}],"synonyms":["limping","shuffling","staggering","hampering","hindering","restricting"],"phonetic":"/ˈhɑbəlɪŋ/","extraExplanation":["“hobble”本义与“走不稳、走不快”有关，后来引申为“限制、束缚”（像让人走路变困难一样）。在动物语境里，hobble 也可指用绳子把马等动物的腿绑在一起，防止它跑远。"]}
{"word":"hobblingly","summary":{"en":"“Hobblingly” means “in a limping, uneven way.”","zh":"“hobblingly”表示“一瘸一拐地、步伐不稳地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that moves with a limp or awkward, uneven steps (as if one leg or foot is injured).","zh":"一瘸一拐地；步伐不稳地（像腿或脚受伤一样）。"},"examples":[{"en":"He walked hobblingly toward the bench after twisting his ankle.","zh":"他扭伤了脚踝后，一瘸一拐地走向长椅。"},{"en":"The old dog followed hobblingly but refused to stay behind.","zh":"那只老狗一瘸一拐地跟着，但不肯落在后面。"}]}],"synonyms":["limpingly","lamely","unsteadily","awkwardly","shufflingly"],"phonetic":"/ˈhɑbəlɪŋli/","extraExplanation":["“hobblingly”来自动词/名词“hobble”（跛行；使行动不便）+ 副词后缀“-ly”，表示“以……的方式”。在写作中它常用来制造画面感，强调疼痛、疲惫或动作不协调。","使用提示：它通常修饰walk, move, limp, shuffle等动作动词；也可用于比喻（如计划、项目“艰难推进”），但比喻用法相对少见。"]}
{"word":"hobbly","summary":{"en":"Hobbly means not steady—shaky or uneven in movement.","zh":"hobbly 表示“不稳、摇晃或不平整”，常形容走路或物体运转不稳。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Uneven or shaky in movement; not steady (often describing walking, wheels, or a surface).","zh":"走起来/运转起来不稳的；摇晃的；不平整的（常形容走路、轮子或路面）。"},"examples":[{"en":"The chair feels hobbly, so be careful when you sit down.","zh":"这把椅子有点晃，你坐下时要小心。"},{"en":"He walked with a hobbly step after twisting his ankle.","zh":"他扭到脚踝后走路一瘸一拐、不太稳。"},{"en":"The shopping cart’s wheel is hobbly and keeps pulling to the left.","zh":"购物车的轮子不稳，一直往左偏。"}]}],"synonyms":["wobbly","unsteady","uneven","shaky"],"phonetic":"/ˈhɑbli/","extraExplanation":["“hobbly”在英语里偏口语、也不算特别常见；更常见的表达是“wobbly / unsteady / uneven”。","它和动词“hobble”（一瘸一拐地走）有关，所以“hobbly”常带有“走路不稳、像跛行一样”的感觉。拼写上别和“hobby（爱好）”混淆。"]}
{"word":"hobby","summary":{"en":"A hobby is something you like doing in your free time for fun, not for work.","zh":"hobby 指为了乐趣在空闲时间做的事，不是工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An activity you do regularly for enjoyment in your free time (not as a job).","zh":"（业余）爱好；业余嗜好：你在空闲时间为乐趣而经常做的活动（不是工作）。"},"examples":[{"en":"Reading is my favorite hobby.","zh":"阅读是我最喜欢的爱好。"},{"en":"She picked up photography as a hobby during the summer.","zh":"她在夏天开始把摄影当作爱好。"},{"en":"Do you have any hobbies outside of work?","zh":"你工作之外有什么爱好吗？"}]}],"synonyms":["pastime","interest","leisure activity"],"phonetic":"/ˈhɑbi/","extraExplanation":["“hobby”通常指轻松、个人兴趣导向的活动；如果更强调需要技巧和长期投入，也常用“pastime”（消遣）或“pursuit”（追求/爱好，略正式）。","常见搭配：have a hobby（有个爱好），take up a hobby（开始一个爱好），pursue a hobby（培养/坚持一个爱好），hobbyist（业余爱好者）。"]}
{"word":"hobby-horse","summary":{"en":"a toy horse; or a repeatedly discussed personal fixation","zh":"玩具木马；或反复念叨的执念话题"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A child’s toy shaped like a horse, especially a wooden stick with a horse’s head that a child pretends to ride.","zh":"儿童玩具马，尤指前端有马头的木棍（木马棍），孩子骑着假装骑马。"},"examples":[{"en":"The kids raced around the yard on their hobby-horses.","zh":"孩子们骑着木马棍在院子里跑来跑去。"},{"en":"She made a hobby-horse for her nephew as a birthday present.","zh":"她给侄子做了一个木马棍当生日礼物。"}]},{"partOfSpeech":"n.","definition":{"en":"A subject or idea that someone talks about repeatedly or pursues with excessive enthusiasm (a personal fixation).","zh":"（比喻）某人反复谈论或过度热衷的主题；执念；老生常谈的话题。"},"examples":[{"en":"Online privacy is his hobby-horse—he brings it up in every meeting.","zh":"网络隐私是他的“执念”，每次开会他都要提。"},{"en":"Her hobby-horse is perfect grammar, even in casual texts.","zh":"她的“老话题”就是语法必须完美，连发短信也不例外。"}]}],"synonyms":["stick horse","toy horse","pet topic","fixation","obsession","preoccupation","favorite subject"],"phonetic":"/ˈhɑˌbi ˌhɔrs/","extraExplanation":["在英式英语里也常用在“人总是骑着自己的爱马不放”的比喻上，语气可能带一点调侃：意思是你又回到那个老话题了。写作中有时会用作讽刺或轻微批评。"],"etymology":"源自“hobby”（原指一种小马/矮种马的名称，后引申为消遣）+“horse”。最早与儿童玩具木马相关；后来因为“总骑同一匹马”这一形象，引申为“总爱谈的主题/执念”。","mnemonic":["把它想成“兴趣(hobby) + 马(horse)”：不是在骑真马，而是“骑着自己的兴趣不放”。","联想中文“老调重弹/逢人就讲”：就像一直骑同一匹马到处跑。"]}
{"word":"hobby-related","summary":{"en":"connected with hobbies or leisure interests","zh":"与兴趣爱好相关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, about, or intended for hobbies (leisure activities done for enjoyment)","zh":"与爱好/业余兴趣有关的；为兴趣活动而设的"},"examples":[{"en":"She joined a hobby-related club to meet people with similar interests.","zh":"她加入了一个兴趣相关的社团，去认识有相同爱好的人。"},{"en":"I keep my hobby-related expenses small so I can save money.","zh":"我把兴趣相关的开销控制得很小，这样就能存钱。"},{"en":"The bookstore has a hobby-related section with model kits and craft magazines.","zh":"那家书店有一个兴趣相关的专区，卖模型套件和手工杂志。"}]}],"synonyms":["hobbyist","recreational","leisure","interest-based","pastime-related"],"phonetic":"/ˈhɑbi rɪˈleɪtɪd/","extraExplanation":["拼写提示：作形容词放在名词前时常写作 hobby-related（有连字符），如 hobby-related activities；放在名词后作表语时有时也可写成 hobby related / hobby-related（两者都常见）。","语域：较常见于说明文、广告或分类用语（如“兴趣相关产品/课程/社区”），比 everyday 口语更“书面/中性”。"],"etymology":"由 hobby（“爱好、嗜好”）+ related（“相关的”）构成的复合形容词；常用连字符 hobby-related，表示“与某事有关”。","mnemonic":["把它拆开记：hobby（爱好）+ related（相关）= “跟爱好有关的”。","联想中文：看到 related 就想到“关联/相关”，hobby-related = “兴趣相关”。"]}
{"word":"hobbyhorse","summary":{"en":"Hobbyhorse means either a toy horse for children or a pet topic/obsession someone talks about repeatedly.","zh":"Hobbyhorse 指儿童的玩具马，也可比喻一个人反复强调的“执念话题/偏爱观点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a children’s toy shaped like a horse (often a rocking horse or a stick horse)","zh":"（儿童的）玩具马（常指摇摇马或竹马）"},"examples":[{"en":"The toddler rode his hobbyhorse in the living room.","zh":"小宝宝在客厅里骑着他的玩具马。"},{"en":"She asked for a rocking hobbyhorse for her birthday.","zh":"她生日时想要一匹摇摇马。"}]},{"partOfSpeech":"n.","definition":{"en":"a topic or activity someone talks about or focuses on too much; a pet idea or obsession","zh":"（总爱谈论或过度专注的）心头好话题；偏执的主张；执念"},"examples":[{"en":"Work-life balance is his hobbyhorse—he brings it up in every meeting.","zh":"“工作与生活平衡”是他的执念——每次开会他都要提。"},{"en":"She has a hobbyhorse about healthy eating and won’t stop giving advice.","zh":"她对健康饮食特别执着，总是不停地给建议。"}]}],"synonyms":["rocking horse","stick horse","pet topic","pet peeve","obsession","fixation"],"phonetic":"/ˈhɑbiˌhɔrs/","extraExplanation":["“hobbyhorse”原本指儿童玩具马（如摇摇马、竹马）。后来引申为“老是骑着不放”的东西，比喻一个人反复强调、三句不离的观点或话题。","文学小知识：莎士比亚《哈姆雷特》中有名句 “For O, for O, the hobby-horse is forgot”（大意：唉，连玩具马都被人忘了），常被引用来说明“hobby-horse”在早期英语中的文化意象。"]}
{"word":"hobbyhorses","summary":{"en":"Hobbyhorses are either toy stick-horses for children or (figuratively) a topic someone constantly talks about.","zh":"hobbyhorses 可指儿童的玩具木马（马头棒），也可比喻某人总反复谈论的执念话题/观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A child’s toy shaped like a horse’s head (often on a stick), used for pretend riding.","zh":"（儿童）玩具木马/马头棒（常见为带马头的木棒，用来假装骑马）。"},"examples":[{"en":"The kids ran around the yard on their hobbyhorses.","zh":"孩子们骑着玩具木马在院子里跑来跑去。"},{"en":"She made a hobbyhorse for her nephew as a birthday gift.","zh":"她给侄子做了一个玩具木马当生日礼物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A favorite topic, idea, or cause that someone talks about or focuses on too much.","zh":"（比喻）反复谈论或过度关注的“执念话题/心头好/个人主张”。"},"examples":[{"en":"Work-life balance is his hobbyhorse—he brings it up in every meeting.","zh":"工作与生活平衡是他的执念话题——每次开会他都要提。"},{"en":"Her hobbyhorse is healthy eating, so she’s always reading nutrition labels.","zh":"她特别执着健康饮食，所以总是在看营养成分表。"},{"en":"Please don’t get on your hobbyhorse again—we’re trying to solve today’s problem.","zh":"别又开始你那套“老生常谈”了——我们正在解决今天的问题。"}]}],"synonyms":["pet topic","favorite subject","obsession","stick horse"],"phonetic":"ˈhɑbiˌhɔrs","extraExplanation":["“hobbyhorse”最初指儿童玩具木马；后来引申为“某人总爱反复强调的观点/话题”。在口语里常见搭配：get on your hobbyhorse（又开始喋喋不休地讲你那套了）。","注意：hobbyhorses 是复数形式；词条原形是 hobbyhorse。"]}
{"word":"hobbyhorsical","summary":{"en":"“Hobbyhorsical” is an uncommon adjective meaning “about someone’s repeatedly mentioned favorite topic (a hobbyhorse).”","zh":"“hobbyhorsical”是个少见形容词，表示“与某人反复提及的偏好话题/执念（hobbyhorse）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Relating to a “hobbyhorse” in the figurative sense—someone’s favorite topic or idea that they return to again and again, sometimes too much.","zh":"（少见）与“hobbyhorse”（比喻义）有关：指某人反复谈论、总爱回到的偏好话题或执念，有时带点“老生常谈/过度强调”的意味。"},"examples":[{"en":"His hobbyhorsical comments about efficiency came up in every meeting.","zh":"他那些关于“效率”的执念式发言在每次会议里都会出现。"},{"en":"The essay becomes hobbyhorsical when the writer keeps returning to the same complaint.","zh":"当作者不断回到同一个抱怨点时，这篇文章就显得有点“执念化/老调重弹”。"},{"en":"Try not to sound hobbyhorsical—add a new angle each time you discuss the issue.","zh":"尽量别让自己听起来像在反复念同一套——每次谈这个问题时加一点新角度。"}]}],"synonyms":["obsessive","fixated","repetitive","pet-topic","preoccupied"],"phonetic":"/ˌhɑbiˈhɔrsɪkəl/","extraExplanation":["“hobbyhorse”原意是儿童骑着玩的木马/摇马，后来引申为“人总爱骑着不放的‘老话题’”。“hobbyhorsical”是由 hobbyhorse + -ical（表示“……的”）构成的形容词，但在现代英语中非常不常见，更常见的说法是：one’s hobbyhorse（某人的老话题/执念）、to ride one’s hobbyhorse（反复强调某个观点）。","语气提示：这个词（以及 hobbyhorse 的比喻用法）常带轻微贬义或调侃：暗示说话者有点“总绕回同一件事”。正式写作里更常用 repetitive、obsessive、fixated、pet topic 等表达。"]}
{"word":"hobbyhorsically","summary":{"en":"Hobbyhorsically means “in a hobbyhorse-like way,” repeatedly returning to one’s favorite topic, sometimes annoyingly.","zh":"hobbyhorsically 指“像嗜好话题那样”，反复把话题拉回自己最爱的主题，有时带点让人觉得唠叨的意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hobbyhorse-like way; by talking or writing repeatedly and enthusiastically about one’s favorite topic (sometimes to the point of obsession).","zh":"以“骑木马/嗜好话题”那种方式；反复、热情地谈论或写自己最爱的话题（有时会显得有点执着或唠叨）。"},"examples":[{"en":"He spoke hobbyhorsically about trains, even when the conversation was about sports.","zh":"即使大家在聊体育，他也嗜好话题般地一直讲火车。"},{"en":"The essay drifts hobbyhorsically into the author’s favorite political issue.","zh":"这篇文章写着写着就“嗜好话题式”地跑到作者最爱的政治议题上了。"}]}],"synonyms":["obsessively","single-mindedly","fixatedly"],"phonetic":"ˌhɑbiˈhɔrsɪkli","extraExplanation":["“hobbyhorse”原指孩子骑的木马玩具；后来引申为“一个人老挂在嘴边、反复强调的心头好话题（pet topic）”。因此 hobbyhorsically 常带一点“总爱把话题拉回自己兴趣点”的轻微调侃意味。","这个词很少见，更多时候人们会用更常见的表达：obsessively（执着地）、single-mindedly（专注地/一心一意地）、on his/her pet topic（围绕他/她的心头好话题）。拼写上也可能见到 hobby-horsically（带连字符）。"]}
{"word":"hobbyism","summary":{"en":"Hobbyism means pursuing hobbies, or (often critically) being overly focused on a personal hobby or pet topic.","zh":"hobbyism 指从事兴趣爱好；也可（常带批评）指对个人爱好/心头议题过度执着。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity or habit of spending time on hobbies; having hobbies as an important part of your life.","zh":"从事（并重视）业余爱好；把兴趣爱好当作生活重要部分的习惯/风气。"},"examples":[{"en":"Hobbyism has grown as more people look for relaxing activities after work.","zh":"随着更多人下班后寻找放松方式，发展兴趣爱好的风气越来越盛。"},{"en":"Her hobbyism includes baking, photography, and hiking.","zh":"她的业余爱好包括烘焙、摄影和徒步。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often disapproving) An excessive or narrow focus on a personal hobby or pet topic, sometimes at the expense of more important matters.","zh":"（常含贬义）对某个个人爱好或“心头好”过度投入/过分执着，以至于忽视更重要的事情。"},"examples":[{"en":"The team needed a clear plan, but his hobbyism kept pulling the discussion toward minor details.","zh":"团队需要一个清晰计划，但他对个人兴趣点的执着总把讨论拉到枝节问题上。"},{"en":"Some critics call it hobbyism when a leader treats a pet project as the top priority.","zh":"有些批评者把这种做法称为“兴趣主义”，指领导把自己的心头项目当成最高优先级。"}]}],"synonyms":["pursuit of hobbies","pastime culture","avocation","amateur pursuit","pet-project focus"],"phonetic":"/ˈhɑbizəm/","extraExplanation":["“hobbyism”由 hobby（爱好）+ -ism（…主义/倾向）构成，因此语气有时会带一点“把兴趣当成一种主义”的味道：既可以中性描述一种生活方式，也可能用于批评“只顾自己喜欢的那一套”。","使用上比 “hobby” 更抽象，更像在谈一种现象/倾向（例如：社会上的 hobbyism、工作中的 hobbyism）。"]}
{"word":"hobbyist","summary":{"en":"A hobbyist is someone who does something for fun in their free time, not as a job.","zh":"hobbyist 指把某事当作爱好来做的人，通常不是以此为职业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who does an activity for pleasure in their free time, not as their main job.","zh":"把某项活动当作爱好、在业余时间进行的人；非以此为主要职业的人。"},"examples":[{"en":"She’s a hobbyist photographer who takes pictures on weekends.","zh":"她是个摄影爱好者，周末会去拍照。"},{"en":"Many hobbyists build model airplanes at home.","zh":"很多爱好者在家里制作飞机模型。"}]}],"synonyms":["amateur","enthusiast","fan"],"phonetic":"/ˈhɑbiɪst/","extraExplanation":["“hobbyist”来自“hobby（爱好）+ -ist（从事者/爱好者）”。它通常带有“非专业、出于兴趣”的含义，但不一定表示水平差；很多hobbyist也很厉害。","常见搭配：hobbyist photographer/artist/coder/woodworker（业余摄影师/业余艺术家/业余程序员/木工爱好者）。与professional（职业的、专业人士）相对。"]}
{"word":"hobbyists","summary":{"en":"Hobbyists are people who do something for enjoyment in their free time, not professionally.","zh":"hobbyists 指“业余爱好者”，在空闲时间出于兴趣做某事的人（非职业）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who does an activity for pleasure in their free time, not as a job.","zh":"业余爱好者；把某项活动当作兴趣消遣的人（非职业）。"},"examples":[{"en":"The club welcomes hobbyists of all skill levels.","zh":"这个社团欢迎任何水平的业余爱好者。"},{"en":"Many hobbyists build model airplanes at home.","zh":"很多业余爱好者在家里制作飞机模型。"},{"en":"She’s a gardening hobbyist, not a professional landscaper.","zh":"她是园艺爱好者，不是专业园林设计师。"}]}],"synonyms":["hobbyist","amateur","enthusiast","nonprofessional"],"phonetic":"/ˈhɑbiɪsts/","extraExplanation":["“hobbyist”来自“hobby”（爱好、嗜好）+ “-ist”（表示从事某种活动或持某种观点的人）。复数是 hobbyists。","“hobbyist”常用于强调“非职业、出于兴趣”，在科技/手工语境里很常见，如 hobbyist programmer（业余程序员）、electronics hobbyist（电子爱好者）。","近义词辨析：amateur 也可表示“业余的”，但有时带“水平不高/不专业”的语气；hobbyist 更中性，重点是“把它当兴趣”。"]}
{"word":"hobbyless","summary":{"en":"“Hobbyless” means having no hobbies or personal pastimes.","zh":"“hobbyless”表示“没有爱好/缺乏兴趣活动”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no hobbies; not interested in leisure activities or personal pastimes.","zh":"没有爱好（嗜好）的；对休闲活动或个人兴趣不感兴趣的。"},"examples":[{"en":"After moving to a new city, he felt hobbyless and bored on weekends.","zh":"搬到新城市后，他觉得自己没有爱好，周末很无聊。"},{"en":"The company encourages employees not to become hobbyless by offering clubs after work.","zh":"公司通过提供下班后的社团活动，鼓励员工不要变得没有爱好。"}]}],"synonyms":["without hobbies","having no hobbies","uninterested (in hobbies)"],"phonetic":"/ˈhɑbiˌlɛs/","extraExplanation":["“hobbyless”由 hobby（爱好）+ -less（缺少……的）构成，表示“缺乏某物”的形容词。类似构词：careless（粗心的）、homeless（无家可归的）。","这个词在日常口语中不算非常常见，更常见的表达包括：“I don’t really have any hobbies.”（我没什么爱好）或 “I’m not into hobbies.”（我对爱好/兴趣活动不太上心）。注意在描述他人时语气可能带有评价色彩，使用时可加上具体情境以显得更礼貌。"]}
{"word":"hobgoblin","summary":{"en":"A hobgoblin is a mischievous goblin in folklore, and figuratively it means a nagging fear or obsession.","zh":"hobgoblin 指民间传说中爱捣蛋的小妖精；也可比喻挥之不去的烦恼、恐惧或执念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, mischievous goblin (a creature from European folklore), often imagined as playing tricks rather than causing serious harm","zh":"（欧洲民间传说中的）小妖精、淘气的精灵；多指爱恶作剧但不一定很危险的怪物"},"examples":[{"en":"In the old stories, a hobgoblin sneaks into houses at night and hides people’s tools.","zh":"在古老故事里，hobgoblin 会在夜里溜进屋子，把人们的工具藏起来。"},{"en":"The movie turned the hobgoblin into a funny troublemaker instead of a terrifying monster.","zh":"那部电影把 hobgoblin 塑造成了搞笑的捣蛋鬼，而不是吓人的怪物。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) an annoying worry, fear, or fixed idea that keeps bothering you","zh":"（比喻）挥之不去的烦恼、恐惧或执念；一直纠缠你的“心魔”"},"examples":[{"en":"For many learners, the hobgoblin is the fear of making mistakes when speaking English.","zh":"对很多学习者来说，说英语怕犯错就是一直纠缠的“心魔”。"},{"en":"She tried to ignore the hobgoblin of self-doubt and apply for the job anyway.","zh":"她努力无视自我怀疑的困扰，还是去申请了那份工作。"}]}],"synonyms":["goblin","imp","bogeyman","bugbear","fear","obsession"],"phonetic":"ˈhɑbˌɡɑblɪn","extraExplanation":["“hobgoblin”常见于文学/散文的比喻用法。拉尔夫·沃尔多·爱默生（Ralph Waldo Emerson）名句：“A foolish consistency is the hobgoblin of little minds.” 常被译为“愚蠢的一致性是狭隘心灵的魔鬼/心魔”，意思是盲目固守前后完全一致，会限制思考与成长。","词源提示：hob- 是英语里常见的人名/昵称成分（类似“老霍布”之类的口语色彩），goblin 指“妖精/小鬼”。合在一起带有“家常、民间传说里的小鬼”的味道。"]}
{"word":"hobgoblins","summary":{"en":"Hobgoblins are goblin-like creatures in folklore; figuratively, the word can mean an imagined fear or nagging worry.","zh":"hobgoblins 指民间传说中的地精/小妖精；也可比喻“无端的恐惧或纠缠人的忧虑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, ugly creature in stories (a goblin), often mischievous rather than truly dangerous","zh":"（传说中的）小妖精；地精，常常调皮捣蛋但不一定很危险"},"examples":[{"en":"In the fairy tale, hobgoblins sneak into the kitchen at night and steal bread.","zh":"在童话里，地精会在夜里溜进厨房偷面包。"},{"en":"The children whispered about hobgoblins living in the old forest.","zh":"孩子们小声说起那片老森林里住着地精。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) an imagined fear or worry that troubles you more than it should","zh":"（比喻）无端的恐惧；困扰人的假想忧虑（被夸大的担心）"},"examples":[{"en":"Fear of failure can become a hobgoblin that stops you from trying.","zh":"对失败的恐惧可能变成一种“心魔”，让你不敢去尝试。"},{"en":"Don’t let little doubts turn into hobgoblins in your mind.","zh":"别让小小的疑虑在你心里变成“妖怪”。"}]}],"synonyms":["goblins","imps","bogeyman","bugbear","phantom fears"],"phonetic":"/ˈhɑbˌɡɑblɪnz/","extraExplanation":["“hobgoblin”源自英国民间传说：goblin 指小妖精；hob- 常与“家常、乡间”或人名有关，暗示一种“家宅里的小精怪”。不同地区的故事里，它们有时爱恶作剧，有时也会帮忙做家务。","在现代英文里，它也常用于比喻“无谓的顾虑/心魔”。一个著名引用来自美国作家爱默生（Ralph Waldo Emerson）：“A foolish consistency is the hobgoblin of little minds.” 这里的 hobgoblin 指“纠缠人的、阻碍思考的东西”。"]}
{"word":"hobhouchin","summary":{"en":"“hobhouchin” isn’t a recognized English word; it’s likely a misspelling or a proper/fictional name.","zh":"“hobhouchin”不是常见英语词；更可能是拼写错误或专有/虚构名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a family name, or a made-up/fictional term.","zh":"不是标准英语单词。可能是拼写错误、用户名、姓氏，或虚构/自造词。"},"examples":[{"en":"I couldn’t find “hobhouchin” in a dictionary—did you mean “hobgoblin”?","zh":"我在词典里找不到“hobhouchin”——你是不是想写“hobgoblin”（小妖怪）？"},{"en":"If “hobhouchin” is a name, please tell me where you saw it so I can explain it better.","zh":"如果“hobhouchin”是名字，请告诉我你在哪里看到的，我可以更准确地解释。"}]}],"phonetic":"/ˌhɑbˈhaʊtʃɪn/","extraExplanation":["“hobhouchin”很可能是拼写接近某个英语词（例如 *hobgoblin* /ˈhɑbˌɡɑblɪn/，意为“妖精、小妖怪”）或某个专有名词（人名/地名/账号名）。如果你能提供上下文句子、出处（书/游戏/社交媒体）或你想表达的意思，我可以帮你锁定正确单词并给出准确释义与用法。"]}
{"word":"hobi","summary":{"en":"A hobby is something you do for fun in your free time.","zh":"hobby 指在空闲时间为了乐趣而做的活动（爱好/兴趣）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an activity you do for pleasure in your free time (not as your main job)","zh":"（非主要工作、在空闲时间做的）爱好；兴趣"},"examples":[{"en":"Reading is my favorite hobby.","zh":"阅读是我最喜欢的爱好。"},{"en":"She picked up a new hobby during the summer break.","zh":"她在暑假培养了一个新爱好。"},{"en":"His hobbies include hiking and playing the guitar.","zh":"他的爱好包括徒步和弹吉他。"}]}],"synonyms":["pastime","interest","leisure activity"],"phonetic":"/ˈhɑbi/","extraExplanation":["“hobi”常见于印尼语/马来语中，意思就是英语的“hobby”。如果你是在写英语，标准拼写是“hobby”（复数：hobbies）。","发音提示：/ˈhɑbi/ 中重音在第一个音节，结尾的 -y 发 /i/，听起来像“HAH-bee”。"]}
{"word":"hobiler","summary":{"en":"Hobby means a leisure activity you enjoy in your free time; it can also describe things related to non-professional interests.","zh":"hobby 指你在空闲时间从事并享受的业余爱好；也可作形容词表示“与业余兴趣相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An activity you do regularly for pleasure in your free time (not as your main job).","zh":"（业余）爱好；消遣活动（通常不是你的主要工作）。"},"examples":[{"en":"My hobbies are reading and playing basketball.","zh":"我的爱好是阅读和打篮球。"},{"en":"She took up painting as a hobby after work.","zh":"她下班后把画画当作爱好来做。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a casual, non-professional interest or collector activity.","zh":"与业余兴趣、非专业活动或收藏相关的。"},"examples":[{"en":"He builds model airplanes with hobby tools.","zh":"他用业余工具制作飞机模型。"},{"en":"They visited a hobby shop to buy supplies.","zh":"他们去模型/手工爱好店买材料。"}]}],"synonyms":["pastime","leisure activity","interest","pursuit"],"phonetic":"/ˈhɑbi/","extraExplanation":["你输入的“hobiler”看起来像土耳其语里“hobbies（爱好）”的拼写/形式（土耳其语“hobiler”=“爱好们/复数”）。英语里对应的单数是 hobby，复数是 hobbies。","词源小贴士：hobby 最早和“hobby-horse（木马/玩具马）”有关，后来引申为“让人投入并乐在其中的消遣”，所以常带有“业余、兴趣驱动”的感觉。"]}
{"word":"hobits","summary":{"en":"“Hobbits” usually refers to Tolkien’s fictional people; informally, it can also mean homebodies.","zh":"“Hobbits”通常指托尔金作品中的霍比特人；口语里也可幽默地指喜欢宅家、过简单生活的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Hobbits: a small, human-like people in J. R. R. Tolkien’s stories (especially *The Hobbit* and *The Lord of the Rings*), known for loving peaceful, rural life.","zh":"（复数）霍比特人：英国作家托尔金作品中的一种矮小、类人的族群（尤见于《霍比特人》《指环王》），以热爱宁静的乡村生活著称。"},"examples":[{"en":"In *The Lord of the Rings*, the hobbits leave the Shire on a dangerous journey.","zh":"在《指环王》中，霍比特人离开夏尔，踏上危险的旅程。"},{"en":"Bilbo is one of the most famous hobbits in modern fantasy literature.","zh":"比尔博是现代奇幻文学中最著名的霍比特人之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, humorous) People who prefer a simple, home-centered life; homebodies.","zh":"（非正式，幽默）喜欢简单、以家庭为中心生活的人；宅家的人。"},"examples":[{"en":"After years of travel, we’ve become hobbits—tea, books, and early nights.","zh":"旅行多年后，我们变成“霍比特人”了——喝茶、读书、早睡。"}]}],"synonyms":["Halflings","homebodies"],"phonetic":"ˈhɑbɪts","extraExplanation":["你写的 **hobits** 常见是拼写错误；标准拼写是 **hobbits**（复数），单数是 **hobbit**。","在托尔金语境里常常大写 **Hobbit(s)** 表示族群名称；日常比喻用法通常小写 **hobbit(s)**，带幽默语气。"]}
{"word":"hoblike","summary":{"en":"Hoblike means “like a hob”—usually a small goblin/household spirit in old British folklore (rare), and sometimes literally “like a cooking hob.”","zh":"Hoblike 意为“像 hob 的”。多指英国旧民间传说中的小精怪/家宅精灵（较罕见），有时也可字面指“像炉灶台/灶眼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Like a hob: resembling a small goblin/elf in old British folklore, or resembling a “hob” (a helpful household spirit) in traditional stories.","zh":"（罕见）像“hob”的：在英国民间传说中，形似小精怪/地精，或像传统故事里那种“家宅精灵（有时会帮忙做家务）”的样子或气质。"},"examples":[{"en":"The story describes a hoblike creature hiding near the hearth at night.","zh":"故事描写一种像家宅精灵一样的生物，夜里躲在壁炉旁。"},{"en":"With his hoblike grin, he felt more like a folktale character than a real person.","zh":"他露出一种精怪般的笑，让人觉得他更像民间故事里的人物，而不像真人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literal) Like a hob in a kitchen or workshop: having qualities associated with a stove/cooking hob (for example, being heat-related or used for cooking).","zh":"（字面）像炉灶台/灶眼（hob）的：具有与烹饪炉灶相关的特征（如与加热、烹饪用途有关）。"},"examples":[{"en":"The old apartment had a hoblike metal plate for heating a kettle.","zh":"那间老公寓有一块类似炉灶加热盘的金属板，可以用来烧水壶。"}]}],"synonyms":["goblin-like","impish","elfin","folkloric"],"phonetic":"ˈhɑbˌlaɪk","extraExplanation":["“hoblike”并不是现代英语中的常用词，更多见于描写氛围的文学/仿古写法。它通常来自两种“hob”的含义：一是英国民间传说中的精灵/地精（如 hobgoblin 的 hob），二是英式英语里指炉灶台（cooking hob）。具体含义需要靠上下文判断。","如果你想表达“像精灵/小地精一样”，现代更常见的说法是 goblin-like、elfin、impish。"]}
{"word":"hoblob","summary":{"en":"“Hobnob” means to socialize or chat in a friendly way, often with influential or famous people.","zh":"“Hobnob” 指友好社交、攀谈，常用于与有影响力或名人结交的语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to socialize in a friendly way, especially with people who are important or famous","zh":"（尤指与有地位或名人）友好社交、攀谈、结交"},"examples":[{"en":"At the conference, she got to hobnob with industry leaders.","zh":"在会议上，她有机会和行业领袖们社交攀谈。"},{"en":"He likes to hobnob at parties to make useful connections.","zh":"他喜欢在派对上和人交际，以建立有用的人脉。"}]},{"partOfSpeech":"n.","definition":{"en":"friendly socializing; casual conversation with others (less common)","zh":"社交应酬；与人闲聊（较少用）"},"examples":[{"en":"After the meeting, there was some hobnob in the hallway.","zh":"会议结束后，大家在走廊里寒暄了几句。"}]}],"synonyms":["socialize","mingle","rub shoulders (with)","mix (with)","network"],"phonetic":"/ˈhɑbˌnɑb/","extraExplanation":["你输入的“hoblob”通常是拼写错误；正确拼写更常见的是 **hobnob**。","词源上与早期英语里的招呼语有关：**hob** 和 **nob** 可能来自“to have（喝）”与“to have not（不喝）”之类的敬酒/邀请表达，后来引申为“与人交际、打成一片”。","语气提示：**hobnob** 有时带一点“和名流套近乎/攀关系”的意味，是否褒贬要看上下文。"]}
{"word":"hobnail","summary":{"en":"A hobnail is a strong nail used on boot soles; it can also refer to boots fitted with such nails, and the verb means to add them.","zh":"hobnail 指加固靴鞋底用的鞋钉；也可指钉了鞋钉的靴子；作动词指给鞋底钉鞋钉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, heavy nail with a large head, traditionally used to reinforce the soles of boots or shoes","zh":"（传统上用于加固靴子/鞋底的）钉头大、结实短粗的鞋钉"},"examples":[{"en":"The old boots were covered with hobnails to make the soles last longer.","zh":"那双旧靴子的鞋底钉满了鞋钉，使鞋底更耐磨。"},{"en":"You could hear his hobnails clicking on the stone floor.","zh":"你能听到他鞋钉在石地上发出哒哒的响声。"}]},{"partOfSpeech":"n.","definition":{"en":"(usually plural) boots or shoes fitted with hobnails; often associated with rural or old-fashioned workwear","zh":"（常用复数）钉鞋钉的靴子/鞋；常带有乡村或旧式工装的感觉"},"examples":[{"en":"He came in wearing hobnails, muddy from the fields.","zh":"他穿着钉鞋钉的靴子进来，脚上还带着田里的泥。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fit the sole of a boot or shoe with hobnails","zh":"给靴子/鞋底钉上鞋钉"},"examples":[{"en":"The cobbler hobnailed the boots for winter work.","zh":"鞋匠给那双靴子钉上鞋钉，方便冬天干活。"}]}],"synonyms":["shoe nail","boot nail","stud (for shoes)"],"phonetic":"/ˈhɑbˌneɪl/","extraExplanation":["“hobnail”常让人联想到“hobnail boots”（带鞋钉的靴子），在英美文化里常用于描写早期工人、农民或粗犷朴素的形象。","在文学描写中，鞋钉“click/clack”在石板或木地板上的声音常被用来营造冷硬、贫苦或军旅/劳作氛围。"]}
{"word":"hobnailed","summary":{"en":"Hobnailed means “fitted with hobnails,” especially boots with nail-studded soles; it can also be the past form of the verb hobnail.","zh":"hobnailed 指“钉底的”（尤其是鞋底钉有钉头的靴子/鞋）；也可作动词 hobnail 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a boot or shoe) fitted with short nails (hobnails) in the sole to make it stronger and less slippery.","zh":"（靴或鞋）鞋底钉有防滑耐磨的钉头（hobnails）的。"},"examples":[{"en":"He came in wearing heavy hobnailed boots.","zh":"他穿着厚重的钉底靴走了进来。"},{"en":"The hikers’ hobnailed shoes gripped the wet rock better.","zh":"徒步者的钉底鞋在湿滑岩石上更防滑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Simple, heavy, and practical in style (often describing boots or clothing); sometimes suggesting a rough, working-class feel.","zh":"（风格）朴素厚实、偏实用的（常形容靴子或衣物）；有时带有粗犷、劳动阶层气息。"},"examples":[{"en":"She preferred hobnailed boots to delicate fashion shoes.","zh":"比起精致的时装鞋，她更喜欢结实耐穿的钉底靴。"},{"en":"The novel’s soldier is described in hobnailed footwear and a worn coat.","zh":"小说里那名士兵被描写为穿着钉底鞋和一件旧外套。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “hobnail”: to stud the sole of a shoe or boot with hobnails.","zh":"“hobnail”的过去式/过去分词：在鞋或靴子的鞋底钉上钉头以加固、防滑。"},"examples":[{"en":"The cobbler hobnailed the boots for winter work.","zh":"鞋匠把靴子钉上钉头，方便冬天干活穿。"}]}],"synonyms":["nail-studded","studded","heavy-duty","rugged"],"phonetic":"/ˈhɑbˌneɪld/","extraExplanation":["“hobnail”原指鞋底用来加固、防滑的小钉头（常见于工装靴、军靴）。因此“hobnailed boots”在英语文化里常让人联想到耐用、粗犷、适合户外或体力劳动的形象。"]}
{"word":"hobnailer","summary":{"en":"A hobnailer is originally a maker/repairer of hobnailed boots; it can also be an old-fashioned, sometimes insulting word for a rough country person.","zh":"hobnailer 原指制作或修补钉底靴鞋的人；也可作旧式（有时带贬义）用法，指粗鄙的乡下人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes or repairs hobnailed boots/shoes (boots with short nails in the sole for durability and grip)","zh":"（传统）钉鞋钉（hobnail）靴/鞋的制作者或修补者；做带钉靴鞋的人"},"examples":[{"en":"In the old village, a hobnailer could fix worn boots by adding fresh hobnails to the soles.","zh":"在过去的村子里，hobnailer 会在鞋底重新钉上鞋钉来修补磨坏的靴子。"},{"en":"The museum display explains how a hobnailer worked with leather, tools, and iron nails.","zh":"博物馆展柜介绍了 hobnailer 如何使用皮革、工具和铁钉来工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(often old-fashioned, sometimes insulting) a rough, uneducated, or clumsy country person; a rustic","zh":"（常为旧式用法，有时带贬义）粗鲁、没受过教育或笨拙的乡下人；土包子"},"examples":[{"en":"The critic dismissed the character as a “hobnailer,” meaning a crude country man.","zh":"评论家把这个角色贬为“hobnailer”，意思是粗鄙的乡下人。"},{"en":"Be careful with this word today—it can sound disrespectful when used about people.","zh":"如今使用这个词要谨慎——用来形容人可能显得不尊重。"}]}],"synonyms":["shoemaker","cobbler","bootmaker","rustic","country bumpkin"],"phonetic":"/ˈhɑbˌneɪlər/","extraExplanation":["“Hobnail”指钉在靴/鞋底的小铁钉，用来增加耐磨与防滑；因此 hobnailer 原本是与制鞋、修鞋相关的职业称呼。","由“穿钉靴的劳动者”引申，这个词在部分英伦语境（尤其带地方色彩的旧文学/方言中）也可用来指“粗鄙的乡下人”，语气可能带轻蔑，现代英语里较少用。"]}
{"word":"hobnails","summary":{"en":"Hobnails are large-headed nails used on boot soles; by extension, “hobnail” can describe something rustic, and (informally) can refer to a rough country person.","zh":"hobnails 指钉在靴鞋鞋底上的大头短钉；引申可表示“粗犷乡土的”，非正式用法还可指“粗俗的乡下人”（可能冒犯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, thick nail with a large head, especially one used to protect the sole of a boot or shoe","zh":"（尤指钉在靴鞋鞋底上用于防磨的）大头短钉，靴钉"},"examples":[{"en":"The old boots were reinforced with hobnails for better grip.","zh":"这双旧靴子用靴钉加固了鞋底，抓地力更好。"},{"en":"You can still see hobnails in traditional work boots.","zh":"在传统的工装靴上你仍然能看到靴钉。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in plural) a country or working-class person, especially viewed as rough or unsophisticated (informal, sometimes offensive)","zh":"（常用复数，非正式且可能带冒犯）乡下人／粗人（带“粗俗、不文雅”的贬义）"},"examples":[{"en":"The novel contrasts city manners with the lives of ‘hobnails’ in the countryside.","zh":"这部小说对比了城市礼仪与乡下“粗人”的生活。"},{"en":"Be careful with this word—it can sound insulting.","zh":"这个词要慎用——听起来可能很冒犯。"}]},{"partOfSpeech":"adj.","definition":{"en":"rustic; rough and simple, like heavy work boots (used before a noun)","zh":"乡土的；粗犷朴素的（作定语）"},"examples":[{"en":"He wore hobnail boots and a thick coat.","zh":"他穿着钉靴，披着一件厚外套。"},{"en":"The film uses a hobnail realism to show rural hardship.","zh":"这部电影用一种粗犷写实的风格来呈现乡村的艰辛。"}]}],"synonyms":["boot nail","tack","stud","rustic","homespun","rough","country (informal)"],"phonetic":"/ˈhɑbˌneɪl/","extraExplanation":["“hobnail”最常见的意象来自“hobnail boots”（钉靴）：过去工人、农夫常在鞋底钉上大头短钉以耐磨、防滑，因此这个词后来也引申出“粗犷、乡土”的感觉。","作“乡下人/粗人”的用法带有阶层偏见，现代英语里容易显得不礼貌，阅读文学作品时可理解其时代语境，但日常表达建议用更中性的词（如 rural people, country folk 等）。"]}
{"word":"hobnob","summary":{"en":"“Hobnob” means to socialize or chat in a friendly way, especially with important or influential people.","zh":"“hobnob”指社交往来、寒暄聊天，尤指与重要或有影响力的人交际（有时带“混圈子”的意味）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to spend time talking in a friendly way with someone, especially with people who are important or socially influential (often for social advantage)","zh":"（尤指为社交利益）与人友好地交谈、来往；（常指）与名流/有影响力的人交际"},"examples":[{"en":"At the reception, she hobnobbed with local business leaders.","zh":"在招待会上，她与当地的商界领袖交际寒暄。"},{"en":"He loves to hobnob with celebrities whenever he gets the chance.","zh":"只要有机会，他就喜欢和名人交际。"},{"en":"The conference is a good place to hobnob and build connections.","zh":"这个会议是社交结识人脉的好地方。"}]}],"synonyms":["mingle","socialize","fraternize","rub shoulders (with)","network"],"phonetic":"/ˈhɑb.nɑb/","extraExplanation":["“hobnob”常带一点“社交场合里混圈子/攀关系”的语感，语气有时中性，有时略带调侃或轻微贬义（暗示动机不完全单纯）。","词源上与古英语/中古英语里表示“碰杯、共饮”的说法有关（类似“to drink together”），后来引申为“交际往来”。","常见搭配：hobnob with (people)；近义说法（语感不同）：mingle with（更中性，指与人混在一起聊天）、socialize with（更普通）、rub shoulders with（强调接触到名流/重要人物）。"]}
{"word":"hobnobbed","summary":{"en":"“Hobnobbed” means “socialized or chatted in a friendly way,” often at events or with important people.","zh":"“hobnobbed”表示“社交寒暄、与人来往（聊天交际）”，常用于社交场合或与有地位/影响力的人交往。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to spend time talking in a friendly way with someone, especially in a social setting (often with people who are important or influential)","zh":"（尤指在社交场合）与人友好地交谈、交往；（常指）与有地位或有影响力的人来往"},"examples":[{"en":"At the reception, she hobnobbed with artists and journalists.","zh":"在招待会上，她与艺术家和记者们攀谈交往。"},{"en":"He hobnobbed with the boss to make a good impression.","zh":"他和老板寒暄交际，想给对方留下好印象。"},{"en":"They used to hobnob after work at a small café near the office.","zh":"他们过去常在下班后到办公室附近的一家小咖啡馆聚会聊天。"}]}],"synonyms":["socialized","mingled","mixed","networked","rubbed shoulders (with)"],"phonetic":"/ˈhɑbˌnɑb/","extraExplanation":["“hobnob”常带一点“社交应酬/混圈子”的味道，语气一般中性，但在某些语境里也可能暗示“为了利益而结交”。","词源上与“hob”和“nob”有关，早期与“碰杯、共饮”这类社交行为相关，后来引申为“（在社交场合）来往、交际”。"]}
{"word":"hobnobber","summary":{"en":"A hobnobber is someone who likes to socialize, especially with influential people; it can sound a bit critical.","zh":"hobnobber 指爱交际的人，尤指爱与权贵名流来往的人；语气常略带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who socializes or mixes with other people, especially people who are important, wealthy, or influential (often suggesting it is done to gain status).","zh":"爱与人交际的人；（尤指）爱与权贵/名流来往的人（常含为了抬高身价的意味）。"},"examples":[{"en":"He’s known as a hobnobber who tries to get invited to every VIP event in town.","zh":"他出了名爱攀关系，想方设法要被邀请参加城里每一场贵宾活动。"},{"en":"She’s not a hobnobber—she prefers small gatherings with close friends.","zh":"她不是那种爱攀交际的人——她更喜欢和亲近的朋友小聚。"}]},{"partOfSpeech":"v.","definition":{"en":"to socialize or spend time in a friendly way, especially with important or famous people.","zh":"（与人）交际、往来；（尤指）与名人/权贵结交。"},"examples":[{"en":"During the conference, he hobnobbed with CEOs and politicians.","zh":"在会议期间，他与各大公司的首席执行官和政客频繁交际。"},{"en":"Tourists sometimes hope to hobnob with celebrities at the hotel bar.","zh":"游客有时希望能在酒店酒吧里和名人攀谈结识。"}]}],"synonyms":["socializer","mixer","networker","social climber"],"phonetic":"/ˈhɑbˌnɑbɚ/","extraExplanation":["“hobnob”原指“碰杯、一起喝酒”，后来引申为“亲密交际”。“hobnobber”是由hobnob加上表示“某类人”的后缀 -er 构成，语气常略带讽刺或负面：暗示对方是为了人脉或地位而社交。","常见搭配：hobnob with + 人（与……交际）。语体偏口语，也常见于新闻、八卦、社交场景描述。"]}
{"word":"hobnobbing","summary":{"en":"Hobnobbing means socializing in a friendly way, often with important or well-known people.","zh":"hobnobbing 指在社交场合与人寒暄来往，常暗含与名流或有影响力的人“交际/混圈子”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"talking and spending time in a friendly way with (often influential or famous) people, usually in a social setting","zh":"（常指在社交场合）与（多为有影响力或名人）友好交往、攀谈往来"},"examples":[{"en":"She spent the evening hobnobbing with politicians and business leaders.","zh":"她整个晚上都在和政客、商界领袖交际攀谈。"},{"en":"At the conference, he was always hobnobbing with the keynote speakers.","zh":"在会议上，他总是在和主旨演讲嘉宾寒暄交际。"},{"en":"He enjoys hobnobbing at parties, but he’s quiet at work.","zh":"他喜欢在派对上社交，但在工作中很安静。"}]}],"synonyms":["socializing","mingling","networking","rubbing shoulders (with)","schmoozing"],"phonetic":"/ˈhɑbˌnɑbɪŋ/","extraExplanation":["“hobnobbing”是动词“hobnob”的现在分词/动名词形式，常带一点“混圈子、结交人脉”的意味，语气有时略带调侃或轻微贬义（取决于语境）。","词源上与旧式祝酒用语有关（类似“to hob nob”，有“轮流喝一口/共饮”的感觉），后来引申为“亲密来往、交际”。"]}
{"word":"hobnobs","summary":{"en":"“Hobnobs” most commonly refers to British oat biscuits (cookies); as a verb, it means to socialize casually, often with influential people.","zh":"“Hobnobs”最常指英国的燕麦饼干；作动词时表示随意社交应酬，常带“与有影响力的人打交道”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a popular British oat biscuit (cookie), often eaten with tea; also the name of a well-known brand.","zh":"英国很常见的燕麦饼干（曲奇），常配茶一起吃；也常指同名知名品牌。"},"examples":[{"en":"She offered me a cup of tea and a couple of Hobnobs.","zh":"她请我喝了杯茶，还给了我几块Hobnobs燕麦饼干。"},{"en":"I like dunking Hobnobs in my coffee.","zh":"我喜欢把Hobnobs蘸进咖啡里吃。"}]},{"partOfSpeech":"v.","definition":{"en":"to socialize in a friendly way, especially with people of influence; to mix and chat casually.","zh":"（常指与有影响力的人）友好社交、打成一片；随意聊天应酬。"},"examples":[{"en":"At the reception, he hobnobs with reporters and local leaders.","zh":"在招待会上，他和记者及当地领导寒暄应酬。"},{"en":"She doesn’t like to hobnob with strangers at parties.","zh":"她不喜欢在派对上和陌生人攀谈应酬。"}]}],"synonyms":["oat biscuit","cookie","mingle","socialize","rub shoulders (with)"],"phonetic":"/ˈhɑbˌnɑbz/","extraExplanation":["“Hobnobs”在英国英语里常直接当作一种经典零食来讲（最有名的是 McVitie’s 的 Hobnobs），口感偏厚实、有燕麦香；在美国英语中更可能会被解释为“oat biscuits/cookies”。","动词 hobnob 来自较早的表达（与“喝酒碰杯、闲聊结交”有关），语气通常偏口语，有时带一点“跟名流混圈子”的意味。"]}
{"word":"hobo","summary":{"en":"A “hobo” is a homeless traveler, historically linked to people who moved around (often by train) seeking temporary work; it can also mean to travel that way.","zh":"“hobo”指（常与美国历史相关的）四处漂泊找零工的流浪汉；也可作动词表示那样四处漂泊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a homeless person, especially someone who travels from place to place looking for temporary work","zh":"（尤指四处流浪、找零工的）无家可归者；流浪汉"},"examples":[{"en":"During the Great Depression, many people became hobos and rode trains to search for work.","zh":"在大萧条时期，很多人沦为流浪汉，搭乘火车四处寻找工作。"},{"en":"The novel portrays a hobo who survives by doing odd jobs in different towns.","zh":"这部小说刻画了一位靠在不同城镇打零工维生的流浪汉。"}]},{"partOfSpeech":"v.","definition":{"en":"to travel like a hobo, often without a fixed home and with little money","zh":"像流浪汉一样四处漂泊（常指没有固定住处、钱很少）"},"examples":[{"en":"After quitting his job, he hoboed around the country for a few months.","zh":"辞职后，他在全国漂泊了几个月。"}]}],"synonyms":["homeless person","vagrant","drifter","tramp"],"phonetic":"/ˈhoʊboʊ/","extraExplanation":["“hobo”在美国英语里带有历史与阶层色彩：常让人联想到19世纪末到20世纪初搭乘货运列车四处找零工的人。现代日常交流中它可能显得不够尊重，建议在正式或礼貌场合用“homeless person”“unhoused person”或更具体的说法（如“a person experiencing homelessness”）。","相关词小区分：hobo（到处走、找工作）≈ tramp（更强调流浪）≠ bum（更强调游手好闲、带贬义）。"]}
{"word":"hoboe","summary":{"en":"Hobo: a traveling homeless person, historically in the U.S., often seeking temporary work.","zh":"Hobo：指（历史上美国常见的）四处漂泊、常靠临时工作维生的流浪者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a homeless person who travels from place to place, traditionally looking for temporary work (especially in the U.S., early 1900s).","zh":"（尤指20世纪初美国的）流浪者；四处漂泊、常靠打零工维生的人。"},"examples":[{"en":"During the Great Depression, many people became hobos and rode trains to search for work.","zh":"在经济大萧条时期，许多人沦为流浪汉，搭乘火车四处寻找工作。"},{"en":"The novel describes a hobo camp near the railroad tracks.","zh":"这部小说描写了铁轨旁的流浪者营地。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) related to the life or style of a hobo; rough and wandering.","zh":"（非正式）与流浪者生活/风格有关的；漂泊的、简陋随性的。"},"examples":[{"en":"He had a hobo look—worn boots and a backpack.","zh":"他一身“流浪者风”的打扮——磨旧的靴子和一个背包。"}]}],"synonyms":["homeless person","tramp","vagrant","drifter"],"phonetic":"/ˈhoʊboʊ/","extraExplanation":["“hoboe”一般被视为拼写错误，正确拼写是 **hobo**（复数 **hobos**）。","在英语里 **hobo** 带有历史语境（常与铁路、找短工相关）。现代更中性的说法常用 **homeless person**（无家可归的人）；**vagrant** 有时带贬义，使用时需注意语气与场合。"]}
{"word":"hoboed","summary":{"en":"“Hoboed” means “traveled or lived like a hobo,” usually describing a period of wandering with little money.","zh":"“Hoboed”意为“像流浪汉那样旅行或生活”，通常指一段几乎没钱、四处漂泊的经历。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense of “hobo”) traveled like a hobo, often moving from place to place with little money, sometimes by hitchhiking or riding freight trains.","zh":"（“hobo”的过去式）像流浪汉那样四处漂泊，常常几乎没钱，有时通过搭便车或搭乘货运火车移动。"},"examples":[{"en":"After he lost his job, he hoboed across the country for a few months.","zh":"失业后，他像流浪汉一样在全国漂泊了几个月。"},{"en":"In the novel, the hero hoboed from town to town looking for work.","zh":"在小说里，主人公一路在各个小镇间漂泊，寻找工作。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) lived as a hobo; spent time in a wandering, homeless lifestyle.","zh":"（较少见）以流浪汉的方式生活；过了一段漂泊、无家可归的日子。"},"examples":[{"en":"He hoboed during the winter and took seasonal jobs in the summer.","zh":"他冬天四处流浪，夏天做季节性工作。"}]}],"synonyms":["wandered","roamed","drifted","tramped","traveled around"],"phonetic":"/ˈhoʊboʊd/","extraExplanation":["“hobo”在美式英语里带有强烈的文化背景：多指19世纪末到20世纪初（尤其是美国经济大萧条时期）在各地流动、打零工的人群。它有时带一点浪漫化的“漂泊”色彩，但也可能让人想到贫困与无家可归；在正式场合更常用“homeless person”或更具体的说法（如“migrant worker”）。","“hoboed”多见于叙事或文学语境，强调一段“在路上”的经历；日常口语里更常说“traveled around,” “was homeless,” 或“rode freight trains”（如果指搭货运火车）。"]}
{"word":"hoboes","summary":{"en":"“Hoboes” means people who travel around, often seeking temporary work, with no permanent home (plural of “hobo”).","zh":"“hoboes”是“hobo”的复数，指四处漂泊、常找临时工作、没有固定住所的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hobo is a person who travels from place to place, often looking for temporary work, and may have little money or no permanent home.","zh":"hobo 指四处流浪的人，常为了找临时工作而到处走，通常缺钱或没有固定住所。"},"examples":[{"en":"During the Great Depression, many hoboes traveled by train to look for work.","zh":"在大萧条时期，许多流浪汉搭火车四处寻找工作。"},{"en":"He wrote a story about hoboes sharing food around a small campfire.","zh":"他写了一个关于流浪汉在小篝火旁分享食物的故事。"}]}],"synonyms":["vagrants","tramps","drifters"],"phonetic":"/ˈhoʊboʊz/","extraExplanation":["“hoboes”是“hobo”的复数形式。","在美国文化语境中，hobo 往往强调“流动、找工作”的漂泊者；它和“homeless person（无家可归者）”不完全等同。","这个词带有历史色彩：19世纪末到20世纪初，美国铁路发展让一些人通过“搭便车/扒火车（ride the rails）”到处找活儿，hobo 形象也因此常出现在歌曲、小说和老电影里。","现代使用时要注意语气：hobo 可能显得过时或带贬义；更中性的说法常用 “homeless person/people experiencing homelessness”。"]}
{"word":"hoboing","summary":{"en":"Hoboing means traveling or living like a hobo—moving around with little money; it can also refer to illegal freight-train travel.","zh":"Hoboing 指像流浪漂泊者一样四处旅行或生活、没什么钱到处走；有时也特指非法扒货运火车等出行方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"traveling or living like a hobo (a homeless traveler), often by moving from place to place with little money","zh":"像“hobo（流浪旅行者/无家可归的漂泊者）”一样旅行或生活，常指没什么钱、四处漂泊"},"examples":[{"en":"In the summer, he tried hoboing across the country to see new places.","zh":"夏天他试着靠“hoboing（流浪式旅行）”横穿全国去看新地方。"},{"en":"They wrote a blog about hoboing and living simply on the road.","zh":"他们写博客记录“hoboing”和在路上过简朴生活。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of traveling illegally on freight trains (train-hopping), sometimes associated with hobos","zh":"（有时与“hobo”文化相关的）扒货运火车等非法搭乘的行为"},"examples":[{"en":"The documentary warns that hoboing on freight trains can be extremely dangerous and illegal.","zh":"这部纪录片警告说，在货运火车上“hoboing”既危险又违法。"}]}],"synonyms":["wandering","vagabonding","drifting","train-hopping"],"phonetic":"/ˈhoʊboʊɪŋ/","extraExplanation":["“hoboing”来自“hobo”。在美国文化里，hobo 常与19世纪末到20世纪初的漂泊打工者联系在一起，尤其是大萧条时期。一些人把它浪漫化成“自由上路”，但它也与贫困、无家可归、危险出行等现实紧密相关。","日常交流中，为了更中性、尊重地表达“无家可归”，常用“people experiencing homelessness（正在经历无家可归的人）”。如果你只是想说“穷游/背包旅行”，用“backpacking”“budget travel”通常更合适。"]}
{"word":"hoboism","summary":{"en":"Hoboism means the lifestyle or phenomenon of hobos—traveling workers without a permanent home.","zh":"Hoboism 指“hobo（漂泊打零工者）”的生活方式或这一社会现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the lifestyle, habits, or social phenomenon of hobos (people who travel and do temporary work, often with no permanent home).","zh":"“流浪劳工/漂泊者（hobo）”的生活方式、习惯或这一社会现象（常四处旅行、打零工，通常没有固定住所）。"},"examples":[{"en":"The novel describes hoboism in early 20th-century America, with workers riding trains in search of jobs.","zh":"这部小说描写了20世纪初美国的“hoboism”，工人们搭火车四处寻找工作。"},{"en":"During the recession, some journalists wrote about hoboism as a form of survival migration.","zh":"在经济衰退期间，一些记者把“hoboism”写作一种为了生存而迁徙的方式。"}]}],"synonyms":["itinerancy","transience","vagrancy (often negative)","a hobo life"],"phonetic":"/ˈhoʊboʊˌɪzəm/","extraExplanation":["“hoboism”主要是美国英语里带历史色彩的词，常见于对19世纪末到20世纪上半叶（尤其大萧条时期）流动劳工与铁路旅行文化的描述。","注意语气：hobo/hoboism在一些语境中可能带有贬义或刻板印象；正式写作中可根据需要改用更中性的表达，如“itinerant workers（流动劳工）”“homelessness（无家可归现象）”，具体取决于你要强调的是工作流动还是住房问题。"]}
{"word":"hoboisms","summary":{"en":"Hoboisms are expressions or speech habits linked to hobo culture, especially in older American slang.","zh":"Hoboisms指与hobo文化相关的表达或说话习惯，尤其常见于较老的美国俚语与民俗描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Words, phrases, habits, or ways of speaking associated with hobos (migrant workers/travelers), especially in American slang or folklore.","zh":"与“hobo（流浪打工者/四处旅行的人）”相关的用语、说法、习惯或说话方式，常见于美国俚语或民间传说中。"},"examples":[{"en":"The novel is full of hoboisms from the rail-yard camps of the 1930s.","zh":"这部小说里充满了来自20世纪30年代铁路工棚的“hobo式说法”。"},{"en":"He sprinkled his story with old hoboisms like “riding the rails.”","zh":"他在故事里穿插了不少老派的hobo说法，比如“搭货运火车四处走（riding the rails）”。"}]}],"synonyms":["hobo slang","tramp slang","railroad slang","argot","colloquialisms"],"phonetic":"/ˈhoʊboʊˌɪzəmz/","extraExplanation":["“hoboisms”通常是复数形式，指一类语言或表达方式，而不是某一个单词。单数形式是“hoboism”。","在美国文化里，hobo与“tramp（流浪汉）”“bum（游民）”有区别：传统上hobo更强调为了工作而迁移、四处找活干；但现实使用中边界常模糊，语境可能带有刻板印象，使用时注意尊重与场合。","相关文化元素包括“大萧条时期”铁路流动生活、hobo俚语，以及民间传说中的“hobo signs（流浪者符号）”（一些人认为被浪漫化或后期整理过，未必都能被历史严格证实）。","文学与影视中常用hoboisms营造时代感与阶层/地域口音，例如描写美国经济大萧条、铁路、流动劳工的作品会更常见。"]}
{"word":"Hobomock","summary":{"en":"a literary proper name (a novel title and its Indigenous character)","zh":"文学专名（小说书名及其中的原住民角色名）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Native American character in Lydia Maria Child’s early American novel who marries a Puritan woman; used as a proper name in literary discussion.","zh":"莉迪亚·玛丽亚·柴尔德早期美国小说中的一位美洲原住民角色（与清教徒女子结婚）；在文学讨论中作为专有名词使用。"},"examples":[{"en":"In Child’s novel, Hobomock is portrayed as loyal and self-sacrificing.","zh":"在柴尔德的小说里，Hobomock 被描写成忠诚且愿意牺牲的人物。"},{"en":"The class discussed how Hobomock reflects early U.S. attitudes toward Indigenous peoples.","zh":"课堂讨论了 Hobomock 如何反映美国早期社会对原住民的态度。"}]},{"partOfSpeech":"other","definition":{"en":"The title of an 1824 novel by Lydia Maria Child (often cited as one of the first U.S. historical romances), sometimes referenced simply by its title.","zh":"1824 年莉迪亚·玛丽亚·柴尔德的小说书名（常被视为美国较早的历史爱情/历史传奇小说之一），有时直接用书名指代该作品。"},"examples":[{"en":"Hobomock was published in 1824 and is studied in early American literature courses.","zh":"《Hobomock》出版于 1824 年，常见于美国早期文学课程。"},{"en":"Some readers compare Hobomock with later frontier romances in U.S. fiction.","zh":"有些读者会把《Hobomock》和后来美国小说中的边疆传奇作品作比较。"}]}],"synonyms":["Hobbamock","Hobomok"],"phonetic":"/ˈhoʊbəˌmɑk/","extraExplanation":["这是带有历史语境的文学专名：小说出自 19 世纪早期，在当时常见的“清教徒—原住民”叙事框架中塑造人物。现代阅读时，常会同时讨论其文学意义与其中可能存在的刻板印象、殖民视角等。"],"etymology":"词形与拼写常被认为与阿尔冈昆语系传说中的“Hobbamock/Hobomok”（一种灵体或神祇名）有关；在英语里出现多种拼写变体，并被柴尔德用于小说人物/书名。","mnemonic":["把它拆成 ho-bo-mock：最后的 mock 像“模仿/扮演”，联想到“文学作品里的角色名”。","联想近形词 Hobbamock（传说中的灵体/神祇名），记住 Hobomock 是其常见变体拼写。"]}
{"word":"hobomoco","summary":{"en":"“Hobomoco” is a rare variant spelling of Hobomok/Hobbamock, a spirit figure from some Algonquian traditions in southern New England.","zh":"“Hobomoco”是 Hobomok/Hobbamock 的罕见拼写变体，指新英格兰南部部分阿尔冈昆传统中的灵体形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) An alternative spelling of Hobomok/Hobbamock: a spirit or deity in some Algonquian (especially southern New England) traditions, often described in English sources as a powerful, sometimes frightening or “trickster/evil” figure.","zh":"（专有名词）Hobomok/Hobbamock 的一种拼写变体：在一些阿尔冈昆语族（尤其是新英格兰南部）传统中的灵体或神祇；在英语文献里常被描述为强大、令人畏惧，有时带有“捣乱者/邪灵”色彩的人物。"},"examples":[{"en":"In some early New England writings, “Hobomoco” appears as a name for a feared spirit.","zh":"在一些早期的新英格兰文献中，“Hobomoco”被用作一个令人畏惧的灵体名称。"},{"en":"The story uses “Hobomoco” as a culturally specific reference, so readers may need background notes to understand it.","zh":"这个故事把“Hobomoco”当作具有文化特定含义的指称，因此读者可能需要背景注释才能理解。"}]}],"synonyms":["Hobomok","Hobomock","Hobbamock","Hobbamocke"],"phonetic":"/ˌhoʊbəˈmoʊkoʊ/","extraExplanation":["“Hobomoco”并不是现代英语里的常用词，更多见于殖民时期/早期英语记录或文学作品中，且拼写差异很大（如 Hobomok, Hobomock, Hobbamock 等）。","不同来源对这个形象的解释可能带有强烈的殖民者视角，把原住民信仰简化为“恶魔/邪灵”。学习或使用该词时，建议把它理解为特定族群语境中的灵性角色，并保持尊重、避免以刻板印象概括。","如果你是在某本书、诗歌或游戏里看到这个词，告诉我上下文句子，我可以帮你判断它在该语境中更接近“神祇/守护灵/恐怖灵体/反派象征”等哪一种用法。"]}
{"word":"Hobomok","summary":{"en":"a Wampanoag spirit figure; also the title/character of an 1824 American novel","zh":"万帕诺亚格传统中的灵体角色；亦为1824年美国小说的书名/角色"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Wampanoag/Algonquian tradition) a powerful spirit being, often described in early English colonial sources as a fearsome or “evil” spirit.","zh":"（万帕诺亚格/阿尔冈昆传统中）一种强大的灵体；在早期英国殖民者记载里常被描述为可怕或“邪恶”的精灵/神祇。"},"examples":[{"en":"Some early colonial writings mention Hobomok as a spirit people feared.","zh":"一些早期殖民时期的文字把 Hobomok 记为人们畏惧的灵体。"},{"en":"Modern retellings may describe Hobomok more neutrally as a spirit figure in Wampanoag belief.","zh":"现代改写有时会更中性地将 Hobomok 描述为万帕诺亚格信仰中的灵体角色。"}]},{"partOfSpeech":"n.","definition":{"en":"The title of an 1824 novel by Lydia Maria Child, featuring a Native American character named Hobomok and focusing on early New England colonial life.","zh":"1824年莉迪亚·玛丽亚·柴尔德（Lydia Maria Child）的小说《Hobomok》的书名；书中有一位名为 Hobomok 的美洲原住民角色，题材围绕早期新英格兰殖民生活。"},"examples":[{"en":"Hobomok (1824) is sometimes discussed as an early American novel about intercultural relationships.","zh":"《Hobomok》（1824）有时被讨论为较早关注跨文化关系的美国小说。"},{"en":"In literature class, we read excerpts from Hobomok to study early portrayals of Native Americans.","zh":"在文学课上，我们读了《Hobomok》的节选来研究早期作品中对美洲原住民的呈现。"}]}],"synonyms":["Hobbamock"],"phonetic":"ˈhoʊbəˌmɑk","extraExplanation":["这是一个带有强烈文化背景的专名。早期英语资料常用“evil spirit（邪灵）”来翻译，但这可能反映了殖民者的宗教视角，并不一定等同于原住民传统中的全部含义。阅读相关文本时，建议把它理解为“特定传统中的灵体角色/超自然存在”，并留意不同来源的解释差异。"],"etymology":"多被视为源自万帕诺亚格/马萨诸塞特语（Algonquian 语系）中对某位灵体的称呼，英语里常见拼写包括 Hobbamock / Hobomock 等；早期殖民者记录与转写导致拼法不一。","mnemonic":["记忆法：把它拆成 hobo + mock（只是字形联想）：好像“流浪汉(hobo)在模仿(mock)”→ Hobomok，帮助记住拼写。实际词源与 hobo/mock 无关。"]}
{"word":"hobos","summary":{"en":"“Hobos” is the plural of “hobo”: people who travel and lack a stable home, often seeking temporary work (historically in the U.S.). It can also be an informal label that may sound disrespectful.","zh":"“hobos”是“hobo”的复数：指四处漂泊、缺乏稳定住所、常寻找临时工作的流浪者（多见于美国历史语境）。该词也可能带标签化、略不尊重的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a homeless person who travels from place to place, often looking for temporary work (especially in historical U.S. contexts)","zh":"（尤指美国历史语境中）四处漂泊、无固定住所，常寻找临时工作的流浪者/流动劳工"},"examples":[{"en":"During the Great Depression, many hobos rode freight trains to look for jobs.","zh":"在经济大萧条时期，许多流浪劳工搭乘货运列车去寻找工作。"},{"en":"The novel describes hobos sharing food and stories by a campfire.","zh":"小说描写了流浪者们在篝火旁分享食物和故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sometimes offensive) a tramp; a person seen as idle or homeless","zh":"（非正式；有时带冒犯）被称作“游民/流浪汉”的人；带有负面评价的说法"},"examples":[{"en":"Some people used the word “hobo” carelessly, even when they didn’t know someone’s situation.","zh":"有些人随意使用“hobo”这个词，即使他们并不了解对方的处境。"},{"en":"It’s kinder to say “a person experiencing homelessness.”","zh":"更友善的说法是“正在经历无家可归的人”。"}]}],"synonyms":["tramp","vagrant","drifter","homeless person"],"phonetic":"/ˈhoʊboʊ/","extraExplanation":["“hobo”在美国文化中常让人联想到19世纪末到20世纪初的“流动劳工”与“大萧条”时期的求职迁徙，文学与歌曲里也常出现（如关于搭货运火车、营地生活的叙述）。","语气提示：当你只是描述社会现象或新闻语境时，英语里更中性、尊重的表达常用“homeless person”或“person experiencing homelessness”。而“hobo”带有强烈历史/形象化色彩，也可能被听者认为在贴标签。"]}
{"word":"HOBr-related","summary":{"en":"involving or associated with hypobromous acid (HOBr)","zh":"与次溴酸（HOBr）有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, caused by, or involving HOBr (hypobromous acid), especially in chemical reactions or water treatment/disinfection contexts.","zh":"与 HOBr（次溴酸）有关的；由 HOBr 引起的；涉及 HOBr 的（常见于化学反应或水处理/消毒语境）。"},"examples":[{"en":"The paper focuses on HOBr-related oxidation products found in seawater.","zh":"这篇论文重点讨论海水中发现的与 HOBr 有关的氧化产物。"},{"en":"HOBr-related disinfection byproducts can form when bromide is present in the source water.","zh":"当原水中存在溴化物时，可能会形成与 HOBr 有关的消毒副产物。"},{"en":"We ran additional tests to track HOBr-related changes in pH and reaction rate.","zh":"我们做了额外测试来追踪与 HOBr 有关的 pH 和反应速率变化。"}]}],"synonyms":["HOBr-associated","hypobromous-acid-related","pertaining to hypobromous acid","HOBr-linked"],"phonetic":"/ˌeɪtʃ oʊ biː ɑr rɪˈleɪtɪd/","extraExplanation":["HOBr 是次溴酸，常在含溴体系中作为活性氧化/卤化物种出现（例如某些水处理消毒过程、海水化学与大气化学研究）。在学术英文里，用“X-related”可以简洁表达“与 X 有关/由 X 引起/涉及 X”。"],"etymology":"由化学式“HOBr”（hypobromous acid，次溴酸）+ “related（相关的）”构成；多见于科研写作中，用来把某现象或产物明确归因到 HOBr 体系或 HOBr 参与的反应。","mnemonic":["把 HOBr 记成“HO + Br（溴）”：看到 HOBr-related 就理解为“跟含溴的次溴酸那套反应相关”。","related = “有关的/相关的”，可对应中文后缀“……相关”。"]}
{"word":"hobs","summary":{"en":"“Hobs” most commonly means the heated areas on a stove/cooktop (plural of hob). It can also mean fireplace ledges (BrE) or, rarely, goblin-like spirits in folklore.","zh":"“hobs”最常指炉灶上的炉盘/加热区（hob 的复数）。也可指壁炉旁的暖物台（英式），极少数情况下指民间传说中的小妖精。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the flat metal surface on a stove (cooktop) that you heat pans on; “hobs” is the plural form","zh":"（炉灶的）炉盘/灶面（用于加热锅具的平面金属加热区）；“hobs”为复数"},"examples":[{"en":"I wiped down the hobs after cooking pasta.","zh":"煮完意大利面后，我把炉盘擦干净了。"},{"en":"This apartment has an electric oven and four hobs.","zh":"这套公寓有电烤箱和四个炉盘。"}]},{"partOfSpeech":"n.","definition":{"en":"small shelves or ledges at the back or side of a fireplace, used to keep things warm; “hobs” is the plural form (mainly British English)","zh":"（壁炉旁/后的）暖物台、小搁板（可放东西保温）；“hobs”为复数（主要英式英语）"},"examples":[{"en":"She left the teapot on the hobs to stay warm.","zh":"她把茶壶放在暖物台上保温。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) goblins or mischievous spirits; “hobs” is the plural form (from folklore)","zh":"（罕见）小妖精、顽皮的精灵；“hobs”为复数（民间传说用法）"},"examples":[{"en":"In old stories, hobs play tricks on travelers at night.","zh":"在古老的故事里，小妖精会在夜里捉弄旅人。"}]}],"synonyms":["burners","cooktop","hotplates"],"phonetic":"/hɑbz/","extraExplanation":["“hob”在现代日常中最常见的意思是“炉盘/灶面”（英式用法更常见，美式更常说 cooktop / burner）。如果你在英国家电说明书或租房广告里看到 hobs，通常指灶台上的加热区数量（如 four hobs）。","民俗里的“hob”与“hobgoblin（小妖怪）”有关，但在现代英语里较少单独用 hob 表示妖精，多出现在文学/民间传说语境。"]}
{"word":"hobthrush","summary":{"en":"A rare dialect word for a thrush, especially the song thrush.","zh":"一个很少见的方言词，指鸫（尤指歌鸫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, dialect) A thrush (a small-to-medium songbird), especially the song thrush.","zh":"（罕见/方言）鸫科鸣禽的一种名称，尤指歌鸫（song thrush）。"},"examples":[{"en":"In some older rural writing, “hobthrush” refers to the familiar song thrush in hedgerows.","zh":"在一些较早的乡村写作中，“hobthrush”用来指树篱间常见的歌鸫。"},{"en":"We heard the hobthrush singing at dawn.","zh":"我们在黎明时听到“hobthrush”在歌唱。"}]}],"synonyms":["song thrush","thrush","throstle (dialect)"],"phonetic":"/ˈhɑbˌθrʌʃ/","extraExplanation":["“hobthrush”非常少见，多被当作地方性称呼使用；现代英语里更常见的说法是“song thrush”，有时也会见到方言词“throstle”。","词形可理解为“hob + thrush”。“hob”在古旧/方言语境里可指“乡下人、家伙”，也常作为一些民俗词汇的构词成分（如 hobgoblin）。在这里主要是带有乡土色彩的命名，而不是标准鸟类学术语。"]}

