{"word":"hoc","summary":{"en":"Hoc is a Latin word meaning “this,” most often seen in English within phrases like “ad hoc” and “post hoc.” It can also appear as the abbreviation HOC with field-specific meanings.","zh":"hoc 是拉丁语“这个”的意思，在英语里多见于 ad hoc、post hoc 等固定短语中；也可能以缩写 HOC 出现，含义取决于领域。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) “this” (used to refer to something nearby or just mentioned; the neuter form of “hic”). In English, you usually see it inside Latin phrases like “ad hoc.”","zh":"（拉丁语）“这个 / 这件事”（指附近的或刚提到的事物；为 hic 的中性形式）。在英语里多见于拉丁短语中，如 ad hoc。"},"examples":[{"en":"Hoc est verum. (Latin)","zh":"这是真的。（拉丁语）"},{"en":"The committee formed an ad hoc group to handle the complaint.","zh":"委员会临时组成了一个小组来处理投诉。"},{"en":"His explanation felt post hoc, like he was making excuses after the fact.","zh":"他的解释有点“事后找理由”的感觉。"}]},{"partOfSpeech":"other","definition":{"en":"(Abbreviation) HOC: can stand for different things depending on the field, such as “House of Commons,” “higher-order component” (in programming), or “head of class.”","zh":"（缩写）HOC：在不同领域可代表不同含义，如“英国下议院（House of Commons）”、“高阶组件（编程中的 higher-order component）”或“班级第一（head of class）”。"},"examples":[{"en":"The bill passed the HOC and moved to the next stage. (House of Commons)","zh":"法案在下议院通过并进入下一阶段。（House of Commons）"},{"en":"In React, a HOC is a function that takes a component and returns a new one.","zh":"在 React 里，HOC 是一个接收组件并返回新组件的函数。"}]}],"phonetic":"/hɑk/","extraExplanation":["在英语里单独写 hoc 并不常见，最常见的接触方式是拉丁短语：\n- ad hoc：为某一特定目的“临时/专门”设立（常用于会议、委员会、解决办法等）。\n- post hoc（常见于“post hoc explanation/fallacy”）：事后发生/事后解释；也可指“把先后当因果”的逻辑谬误（post hoc fallacy）。","hoc 是拉丁语指示代词系统的一部分（hic/haec/hoc），大致相当于英语 this。日常英语学习中不需要掌握其变格，但认识它能帮助你理解 ad hoc、post hoc 这类固定表达。"]}
{"word":"hocco","summary":{"en":"“Hocco” is an older or less common English word for a curassow, a large tropical bird from Central and South America.","zh":"“hocco”是一个较旧或较少见的英语词，通常指 curassow（冠雉），一种分布于中南美洲的大型热带鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large tropical bird (a curassow) found in Central and South America, especially in older or scientific-style writing.","zh":"一种大型热带鸟（凤冠雉类/冠雉类，curassow），分布于中美洲与南美洲；该词多见于较旧的英语或博物学/科学语境。"},"examples":[{"en":"The explorer described seeing a hocco in the rainforest canopy.","zh":"探险者描述说在雨林树冠层看见了一只 hocco（冠雉）。"},{"en":"In some older books, “hocco” is used as another name for a curassow.","zh":"在一些较旧的书里，“hocco”会被用作 curassow（冠雉）的别称。"}]}],"synonyms":["curassow","curassow bird"],"phonetic":"/ˈhɑkoʊ/","extraExplanation":["“hocco”来自西班牙语/葡萄牙语的常用名称（常与“curassow（冠雉）”指同一类鸟）。现代英语中更常用“curassow”，而“hocco”多出现在早期博物学著作、动物志或地区性用法里。"]}
{"word":"hoch","summary":{"en":"“Hoch” is a German word meaning “high,” and it can also be used as a cheer meaning “Hooray/Long live!”","zh":"“hoch”是德语词，意为“高的”，也可作欢呼用语，类似“万岁／好耶”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a German word meaning “high” (used mainly in German names, signs, or phrases).","zh":"德语词，意思是“高的／高处的”（多见于德语语境，如人名、地名、标语或短语中）。"},"examples":[{"en":"In German, “hoch” means “high,” as in “hoch oben” (“high up”).","zh":"在德语里，“hoch”表示“高”，例如“hoch oben”（“在高处／高高地”）。"},{"en":"You may see “Hochschule” in German-speaking countries; it refers to a college or university.","zh":"在德语国家你可能会看到“Hochschule”，指“高等学校／大学”。"}]},{"partOfSpeech":"int.","definition":{"en":"an exclamation in German to express a cheer, meaning “Hooray!” or “Long live …!” (often used in toasts or celebrations).","zh":"德语感叹词，用来欢呼，意思类似“万岁！”“好耶！”（常见于祝酒或庆祝场合）。"},"examples":[{"en":"At the celebration, people shouted “Hoch!” to cheer.","zh":"在庆祝活动上，人们喊“Hoch!”来欢呼。"},{"en":"“Hoch die Braut!” means “Long live the bride!”","zh":"“Hoch die Braut!”意思是“新娘万岁！”"}]}],"synonyms":["high (meaning)","hooray (cheer meaning)"],"phonetic":"/hoʊx/","extraExplanation":["“hoch”是标准德语常用词；发音末尾的“ch”是德语的清擦音，英语里没有完全对应的音，所以英语使用者常把它近似读成 /k/ 或 /h/ 音附近。","如果你是在英语语境里看到“Hoch”，它也可能是姓氏（如人名/公司名），这时通常不翻译，按名字读即可。"]}
{"word":"hochelaga","summary":{"en":"Hochelaga is best known as the name of a historic Indigenous village near present-day Montreal, and it is also used in modern Montreal place names.","zh":"Hochelaga 最常指今蒙特利尔附近的一个历史原住民村落名称，也用于蒙特利尔现代地名（如某些社区名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic St. Lawrence Iroquoian village visited by French explorer Jacques Cartier in 1535, believed to have been located near present-day Montreal, Canada.","zh":"（历史）1535年法国探险家雅克·卡蒂埃到访的圣劳伦斯河伊洛魁人村落，一般认为位于今加拿大蒙特利尔附近。"},"examples":[{"en":"Cartier wrote that he visited Hochelaga in 1535 and met many villagers.","zh":"卡蒂埃记载他在1535年到访了 Hochelaga，并与许多村民见面。"},{"en":"Archaeologists still debate the exact location of Hochelaga.","zh":"考古学家至今仍在讨论 Hochelaga 的确切位置。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for places in Montreal (especially the neighborhood associated with Hochelaga-Maisonneuve).","zh":"（地名）蒙特利尔的一些地区名称用法，尤其常指与“Hochelaga-Maisonneuve（奥舍拉加-梅松讷夫）”相关的社区。"},"examples":[{"en":"She lives in Hochelaga, in Montreal’s east end.","zh":"她住在蒙特利尔东区的 Hochelaga。"},{"en":"The Hochelaga-Maisonneuve area has museums, parks, and old industrial buildings.","zh":"Hochelaga-Maisonneuve 一带有博物馆、公园和一些老工业建筑。"}]}],"synonyms":["Hochelaga-Maisonneuve (related place name)"],"phonetic":"/ˌhoʊʃəˈlɑːɡə/","extraExplanation":["“Hochelaga”多被认为来自当地原住民语言（具体来源与拼写在早期法文记录中不统一），因此现代读法以法语/英语习惯为主。","它在加拿大历史叙事中常与“Jacques Cartier（雅克·卡蒂埃）”“St. Lawrence Iroquoians（圣劳伦斯河伊洛魁人）”“Montreal（蒙特利尔）”一起出现，属于历史地名与文化记忆的一部分。"]}
{"word":"Hochelaga-Maisonneuve","summary":{"en":"A district in east-end Montreal.","zh":"蒙特利尔东区的一个社区（分区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A neighborhood (district) in the east end of Montreal, Quebec, known for its residential streets, local shops, and proximity to major sites like the Olympic Park.","zh":"加拿大魁北克省蒙特利尔东区的一个社区（分区），以住宅街区、在地小店，以及靠近奥林匹克公园等地标而知名。"},"examples":[{"en":"She moved to Hochelaga-Maisonneuve because the rent was more affordable than downtown.","zh":"她搬到Hochelaga-Maisonneuve，因为那里的房租比市中心更负担得起。"},{"en":"We spent the afternoon walking around Hochelaga-Maisonneuve and grabbing coffee at a local café.","zh":"我们下午在Hochelaga-Maisonneuve散步，还在当地咖啡馆喝了咖啡。"},{"en":"Hochelaga-Maisonneuve is often called “HoMa” in everyday conversation.","zh":"在日常对话里，Hochelaga-Maisonneuve常被叫作“HoMa”。"}]}],"synonyms":["HoMa"],"phonetic":"/ˌhoʊʃəˌlɑːɡə ˌmeɪzəˈnɝːv/","extraExplanation":["在蒙特利尔语境里，这个区名常被缩写为“HoMa”（读起来像“oh-ma”），属于比较口语、亲切的叫法。","拼写里有连字符（-），法语地名中较常见；正式写法多用全名，但在社交媒体、房地产或日常聊天中常见HoMa。"],"etymology":"词名由两部分组成：Hochelaga源自16世纪法国探险记录中对圣劳伦斯河谷一处原住民聚落（与圣劳伦斯易洛魁人相关）的称呼；Maisonneuve则来自19世纪建立的城市“Maisonneuve”，其名字致敬保罗·德·绍梅迪·德·梅松讷夫（Paul de Chomedey, sieur de Maisonneuve），蒙特利尔早期的重要人物。后来该区域并入蒙特利尔，常合称为Hochelaga-Maisonneuve。","mnemonic":["把它记成“两段式地名”：前半Hochelaga（历史上的原住民聚落名）＋后半Maisonneuve（人名/旧城市名），看到连字符就想到“两个来源合在一起”。","记缩写HoMa：H（Hochelaga）＋Ma（Maisonneuve）＝HoMa，更像当地人说法。"]}
{"word":"hochheimer","summary":{"en":"Hochheimer is mainly a noun meaning a white wine from Hochheim, Germany (and sometimes, old-fashioned, Rhine German white wine). It can also mean a person from Hochheim, but that use is uncommon.","zh":"Hochheimer 主要作名词，指德国霍赫海姆出产的白葡萄酒（有时旧式用法中也泛指莱茵河德国白葡萄酒）。也可指霍赫海姆人，但较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a white wine from Hochheim am Main, a town in Germany’s Rhine (Rheingau) wine region; sometimes used more broadly for German Rhine wines (old-fashioned).","zh":"德国美因河畔霍赫海姆（Hochheim am Main）出产的白葡萄酒；有时也泛指德国莱茵河流域的白葡萄酒（较旧式用法）。"},"examples":[{"en":"He ordered a glass of Hochheimer with the fish.","zh":"他点了一杯霍赫海姆白葡萄酒配鱼。"},{"en":"In some older texts, “Hochheimer” refers to Rhine white wine in general.","zh":"在一些较旧的文本中，“Hochheimer”可泛指莱茵河的白葡萄酒。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Hochheim (a demonym; uncommon in modern English).","zh":"霍赫海姆人（对该地居民的称呼；现代英语中不常用）。"},"examples":[{"en":"She traced her family history to a Hochheimer who moved to the U.S. in the 1800s.","zh":"她追溯家族史，发现祖先是一位19世纪移民到美国的霍赫海姆人。"}]}],"synonyms":["hock (old-fashioned, related term)"],"phonetic":"ˈhoʊkˌhaɪmɚ","extraExplanation":["“Hochheimer”来自德国地名 Hochheim。英语里常见的词 hock（指德国白葡萄酒，偏旧式）据说就与 Hochheimer 有关：18–19世纪英国人常把来自 Hochheim 的酒称为 “Hochheimer”，后来口语中缩短成 “hock”。","历史与文化小知识：传说英国王室（常提到维多利亚女王）曾对 Hochheim 的葡萄酒很感兴趣，使这种酒在英国更出名；不过不同资料对细节说法不一。","在现代英语语境里，如果不是讨论葡萄酒史或欧洲酒类，“Hochheimer”一般更像专名（酒名/产地名），使用频率不高。"]}
{"word":"hochhuth","summary":{"en":"Hochhuth is the surname of German playwright Rolf Hochhuth, famous for the controversial play The Deputy.","zh":"Hochhuth 指德国剧作家罗尔夫·霍赫胡特的姓氏，以争议性作品《代理人》最著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rolf Hochhuth (1931–2020), a German playwright best known for politically and morally challenging dramas, especially the play The Deputy (Der Stellvertreter).","zh":"罗尔夫·霍赫胡特（1931–2020），德国剧作家，以具有政治与道德批判性的戏剧闻名，尤其是《代理人》（《副主教》，德语：Der Stellvertreter）。"},"examples":[{"en":"Hochhuth became internationally known after The Deputy sparked debate about the Vatican’s role during World War II.","zh":"霍赫胡特因《代理人》引发关于梵蒂冈在二战期间角色的争论而在国际上成名。"},{"en":"In a modern European drama class, students may read Hochhuth alongside other postwar playwrights.","zh":"在现代欧洲戏剧课上，学生可能会把霍赫胡特与其他战后剧作家一起阅读。"}]}],"phonetic":"/ˈhoʊkhuːt/","extraExplanation":["“Hochhuth”在英语语境里通常指人名（姓氏）。他最具争议也最有影响的作品《Der Stellvertreter》（常译《代理人》或《副主教》）以戏剧形式质问当时教廷对纳粹大屠杀的沉默与责任，因此在1960年代引发广泛社会讨论。","读到这个名字时，常见搭配是“German playwright Hochhuth（德国剧作家霍赫胡特）”“Hochhuth’s The Deputy（霍赫胡特的《代理人》）”。注意该词并非普通英语词汇，更多用于文学、历史或戏剧研究语境。"]}
{"word":"hock","summary":{"en":"Hock means to pawn something for money, and it can also mean an animal’s hind-leg joint (especially a horse). In informal English, “in hock” means in debt.","zh":"hock 常指“典当/当掉”，也指（尤指马的）后腿“飞节”。口语中 “in hock” 常表示“负债、欠钱”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to pawn something (leave it with a shop as security for a loan)","zh":"把某物当掉；典当（把物品押给当铺以换取借款）"},"examples":[{"en":"He hocked his watch to pay the rent.","zh":"他把手表当了来付房租。"},{"en":"She refused to hock her mother’s jewelry.","zh":"她拒绝典当母亲的首饰。"}]},{"partOfSpeech":"n.","definition":{"en":"a large joint in an animal’s hind leg (like a horse’s “ankle”)","zh":"（动物后腿的）飞节（尤指马等，类似“脚踝”的关节）"},"examples":[{"en":"The vet checked the horse’s hock for swelling.","zh":"兽医检查了那匹马的飞节是否肿胀。"},{"en":"The dog injured its hock while running.","zh":"那只狗奔跑时伤到了飞节。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) in debt; in a situation where you owe money","zh":"（非正式）负债；欠债在身（常用于短语 in hock）"},"examples":[{"en":"He’s in hock to the bank after buying the new car.","zh":"他买了新车后欠银行一屁股债。"},{"en":"We don’t want to be in hock for years.","zh":"我们不想负债好多年。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hamstring (injure or cut the tendon) of an animal; to disable someone/something","zh":"切断（动物的）腿筋；使瘫痪、使失去行动能力（较少用，语气较重）"},"examples":[{"en":"The injury hocked the horse and ended its racing career.","zh":"这次受伤使那匹马失去行动能力，结束了它的赛马生涯。"}]}],"synonyms":["pawn","pledge","put in pawn","hind-leg joint","be in debt (in hock)"],"phonetic":"/hɑk/","extraExplanation":["“hock”有两个常见来源：一个来自当铺语境（hock = pawn），另一个来自动物解剖（hock = 飞节）。因此它既能出现在日常金钱话题里，也会出现在马术、兽医等语境中。","常见短语：be in hock (to someone) 表示“欠……的钱/把……典当了”。在口语或写作里，比起单独用 hock，更常见的是这个固定搭配。"]}
{"word":"hockamore","summary":{"en":"Hackamore: bitless horse headgear used to control a horse by pressure on the nose and jaw.","zh":"Hackamore：一种无衔马笼头/头具，通过对鼻梁与下颌施压来控制马匹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of horse headgear that controls the horse without a bit, using pressure on the nose and jaw (commonly used in Western riding).","zh":"一种不用马衔的控马头具，通过对马鼻梁和下颌施加压力来控制马（常见于西部骑术/牛仔骑乘）。"},"examples":[{"en":"She rode the young horse in a hackamore to keep his mouth comfortable.","zh":"她用无衔头具（hackamore）骑那匹年轻马，避免它嘴里不舒服。"},{"en":"Many trail riders choose a hackamore instead of a bit.","zh":"许多越野骑乘者会选用无衔头具（hackamore）而不是马衔。"}]}],"synonyms":["bitless bridle","bosal"],"phonetic":"/ˈhækəˌmɔr/","extraExplanation":["“hockamore”多半是“hackamore”的误拼或非标准拼法；标准拼写是 hackamore。","hackamore 一词来自西班牙语（与 jaquima 相关），在美洲西部马术文化中很常见。","注意：不同类型的 hackamore（如 bosal 式、机械式 mechanical hackamore）施压方式和力度可能差异很大，使用时需要合适的尺寸与正确的训练方法。"]}
{"word":"hockday","summary":{"en":"Hockday (often written Hock Day) is a medieval English festival day after Easter known for playful ‘hocking’ customs and community fundraising.","zh":"Hockday（常写作 Hock Day）是复活节后的一种中世纪英国节日，以“拦人/绑人”的玩笑习俗与社区募款活动闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional English festival day (Hock Day), observed on the second Tuesday after Easter, when communities held games and fundraising customs such as tying up passersby for small payments.","zh":"英国传统节日“霍克日”（Hock Day），在复活节后第二个星期二庆祝；民间会举行游戏与募款习俗，例如把路人“拦住/绑住”并收取小额“赎金/捐款”。"},"examples":[{"en":"In some medieval towns, Hockday was a lively occasion for games and collecting money for the parish.","zh":"在一些中世纪城镇里，霍克日是热闹的日子，人们玩游戏并为教区募集款项。"},{"en":"The old record mentions payments made on Hockday.","zh":"那份旧记录提到在霍克日支付的款项。"}]}],"synonyms":["Hock Day"],"phonetic":"/ˈhɑk.deɪ/","extraExplanation":["“Hockday”更常见的写法是“Hock Day”。它在中世纪英格兰较流行：人们会用绳子象征性地拦住行人（有时分“男性日/女性日”的活动），对方付一小笔钱就能被放行；这些钱常用于教会或社区开支。","词源与解释有争议：有的说与“hock（拴住、捆住）”的动作有关，也有人把它和历史纪念（如早期英格兰与丹麦人的冲突）联系起来，但学界并无完全一致的定论。"]}
{"word":"hocked","summary":{"en":"“Hocked” most commonly means “pawned/mortgaged for quick cash”; it can also mean “hamstrung (crippled) by cutting a tendon,” and informally “spat up phlegm (hock up).”","zh":"“hocked”最常见指“把……当掉/抵押换钱”；也可指“割断膝后肌腱使跛行（使……瘸）”；口语里还可指“吐痰（hock up）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of hock) to pawn or mortgage something to get money quickly.","zh":"（hock 的过去式/过去分词）把某物当掉/抵押以快速换钱。"},"examples":[{"en":"He hocked his watch to pay the rent.","zh":"他把手表当了来付房租。"},{"en":"She had already hocked her jewelry to cover the medical bills.","zh":"她已经把首饰当掉来支付医疗账单。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of hock) to cripple (a horse or person) by cutting the tendons behind the knee; to hamstring.","zh":"（hock 的过去式/过去分词）割断膝后肌腱使其跛行；使……瘸/使丧失行动能力（多指马，语境较少见）。"},"examples":[{"en":"In the story, the villain hocked the horse to stop the chase.","zh":"在故事里，反派割断马的肌腱来阻止追赶。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal, North American) (past tense/past participle of hock) to spit up phlegm; often used with “up.”","zh":"（非正式，美式）（hock 的过去式/过去分词）咳痰/吐痰；常与 “up” 连用。"},"examples":[{"en":"He went outside to hock up phlegm.","zh":"他到外面去吐痰。"},{"en":"The coach told the players not to hock up on the field.","zh":"教练叫球员别在场地上吐痰。"}]}],"synonyms":["pawned","pledged","mortgaged","hamstrung","crippled","spat"],"phonetic":"/hɑkt/","extraExplanation":["“hock”本义与动物（尤其是马）后腿的“飞节/膝后关节”有关，所以有“割断飞节后肌腱使跛行”的含义；后来也发展出“把东西拿去当铺（in hock）”的用法，表示为了钱而把物品抵押或典当。","学习提示：表示“把东西当掉”时，常见搭配是 hock + 物品（hock a ring/watch/guitar）或 be in hock（负债、拮据）。口语里的 “hock (up)”带有不雅感，正式场合应避免使用。"]}
{"word":"hockelty","summary":{"en":"Hockety describes a rare musical style or rhythm that feels broken and alternating, like a hiccup.","zh":"Hockety 指一种较少见的音乐性描述：节奏断续、交替出现，像“打嗝”般跳跃。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having a broken, stop‑and‑start, “hiccuping” rhythm, especially in music; like a hocket.","zh":"（罕见）指节奏断断续续、像“打嗝”一样交替停顿的，尤用于音乐；具有“hocket（交错断奏）”特征的。"},"examples":[{"en":"The melody sounds hockety, with the notes jumping between two instruments.","zh":"这段旋律听起来很“hockety”，音符在两件乐器之间跳来跳去。"},{"en":"The composer uses a hockety pattern to create a playful, uneven pulse.","zh":"作曲家用一种 hockety 的型态，营造出俏皮又不均匀的律动。"}]}],"synonyms":["choppy","jerky","staccato","stop-and-start","broken-rhythmed"],"phonetic":"/ˈhɑkəti/","extraExplanation":["你输入的 **hockelty** 很可能是拼写误差；更常见的词是 **hockety**（形容词），来自 **hocket**（名词/动词），指中世纪音乐里两条声部（或两件乐器）“你一句我一句”交替发声，中间刻意留空，听起来像断奏或打嗝。","在现代英语里，这个词多出现在音乐评论、学术写作或较文学化的描写中；日常口语更常用 **choppy / jerky / stop-and-start** 来表达“断断续续”。"]}
{"word":"hocker","summary":{"en":"Hocker most commonly means a small backless stool, sometimes used as a footstool.","zh":"Hocker 最常见的意思是无靠背的矮凳，也可指脚凳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small backless seat (a stool), sometimes upholstered; also used like an ottoman or footstool","zh":"（无靠背的）小凳子；（有时带软垫的）脚凳/矮凳"},"examples":[{"en":"She pulled up a hocker and sat beside the counter.","zh":"她拉来一张矮凳，在柜台旁坐下。"},{"en":"Put your feet on the hocker if you’re tired.","zh":"累的话把脚放在脚凳上。"},{"en":"The café has wooden hockers instead of chairs.","zh":"那家咖啡馆用木头矮凳代替椅子。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person who hocks/pawns items","zh":"（罕见）把东西拿去典当的人"},"examples":[{"en":"In old slang, a hocker might sell belongings to a pawnshop for quick cash.","zh":"在旧式俚语里，hocker 可能指把物品拿去当铺换快钱的人。"}]}],"synonyms":["stool","ottoman","footstool","seat"],"phonetic":"/ˈhɑkər/","extraExplanation":["“Hocker”在英语里不如“stool / ottoman / footstool”常见；在一些地区或受德语影响的语境中更容易见到。德语里 Hocker 也常指“凳子/脚凳”。"]}
{"word":"hockers","summary":{"en":"“Hockers” usually means small stools/footstools; less commonly, it can mean people who pawn things.","zh":"“hockers”通常指小凳子/脚凳；较少见时也可指把东西拿去典当的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small stool or low seat, often without a back (similar to an ottoman or footstool).","zh":"（通常无靠背的）小凳子/矮凳；也可指脚凳（类似软凳/奥斯曼凳）。"},"examples":[{"en":"She sat on a hocker by the window to read.","zh":"她坐在窗边的小凳子上读书。"},{"en":"Put your feet up on the hocker and relax.","zh":"把脚放到脚凳上，放松一下。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who pawns or sells something (informal; from the verb “hock” meaning to pawn).","zh":"把东西当掉/典当的人（非正式用法；来自动词 hock“典当”）。"},"examples":[{"en":"He was a regular hocker, always pawning old tools for cash.","zh":"他老爱去当铺，把旧工具当掉换现金。"}]}],"synonyms":["stool","footstool","ottoman"],"phonetic":"/ˈhɑkɚ/","extraExplanation":["“hockers”是“hocker”的复数。日常英语里更常见的说法通常是“stool / footstool / ottoman”。","第二个义项来自口语动词“to hock”（把……典当），但在现代英语中不算常用；更常见会说“pawn (something)”或“take (something) to a pawn shop”。"]}
{"word":"hocket","summary":{"en":"Hocket is a technique in music where parts of a melody are rapidly alternated between voices or instruments; it can also mean to perform music this way.","zh":"Hocket 指一种音乐技法：旋律片段在不同声部或乐器间快速交替；也可作动词，表示用这种方式演唱/演奏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a musical technique where two (or more) voices/instruments alternate notes or parts of a melody, creating a “broken-up” or hiccup-like rhythm","zh":"（音乐）交错（断续）演奏法：两条或多条声部/乐器轮流唱（奏）旋律的音符或片段，产生“断断续续/像打嗝一样”的节奏效果"},"examples":[{"en":"In medieval music, a hocket often splits one melody between two voices.","zh":"在中世纪音乐中，hocket 常把一条旋律分给两个声部交替完成。"},{"en":"The composer uses hocket to create a playful, bouncing rhythm.","zh":"作曲家用 hocket 来制造俏皮、跳跃的节奏感。"}]},{"partOfSpeech":"v.","definition":{"en":"to perform or write music using the hocket technique","zh":"（用交错法）交替演唱/演奏；用 hocket 技法写作"},"examples":[{"en":"The singers hocketed the melody, trading notes back and forth.","zh":"歌者们用 hocket 交替唱这条旋律，你来我往地接音。"}]}],"synonyms":["interlocking (parts)","alternation","staggered entries"],"phonetic":"/ˈhɑkɪt/","extraExplanation":["“Hocket”源自古法语 *hoquet*，原意与“打嗝/顿挫”有关，因此常用来形容旋律被切成一小段一小段、由不同声部交替完成的效果。","它在欧洲中世纪复调音乐（如13–14世纪）中很常见；在一些非洲合奏传统中也能看到相似的“交错”理念（有时会用更通用的说法如 *interlocking* 来描述）。"]}
{"word":"hockey","summary":{"en":"Hockey is a team sport played with sticks, usually on ice with a puck or on a field with a ball.","zh":"hockey 指用球杆进行的团队运动，常见形式是冰上曲棍球（用冰球）或草地曲棍球（用球）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fast team sport played with sticks, where players try to hit a puck (ice hockey) or a ball (field hockey) into the other team’s goal.","zh":"一种节奏很快的团队运动，球员用球杆把冰球（冰上曲棍球）或球（草地曲棍球）击入对方球门得分。"},"examples":[{"en":"My brother plays hockey after school twice a week.","zh":"我哥哥每周放学后打两次曲棍球。"},{"en":"In Canada, ice hockey is extremely popular.","zh":"在加拿大，冰上曲棍球非常受欢迎。"},{"en":"Field hockey is often played on grass or artificial turf.","zh":"草地曲棍球通常在草地或人造草坪上进行。"}]}],"phonetic":"/ˈhɑki/","extraExplanation":["“Hockey”在不同国家默认指的运动可能不同：在加拿大、美国等地常默认指ice hockey（冰上曲棍球）；在英国、印度、巴基斯坦等地更常默认指field hockey（草地曲棍球）。","常见搭配：play hockey（打曲棍球），hockey stick（曲棍球杆），hockey rink（冰场），hockey puck（冰球）。","文化小知识：北美职业冰球联赛叫NHL（National Hockey League），在英语新闻和体育语境里很常见。"]}
{"word":"hockey stick","summary":{"en":"A hockey playing stick; also a hockey-stick-shaped graph pattern with a sudden steep rise.","zh":"曲棍球用球杆；也指图表中像球杆一样后段突然陡升的走势。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, curved stick used to hit and control the puck or ball in hockey.","zh":"曲棍球（冰球/陆地曲棍球）中用来控球并击打冰球（或球）的弯头球杆。"},"examples":[{"en":"He taped the blade of his hockey stick before practice.","zh":"练习前他把球杆的杆头（弯头部分）缠上了胶带。"},{"en":"She bought a lighter hockey stick to improve her shot.","zh":"她买了一根更轻的球杆来提高射门效果。"}]},{"partOfSpeech":"n.","definition":{"en":"A sharp drop followed by a steep rise on a graph, forming a shape like a hockey stick.","zh":"图表上先急剧下降（或保持平缓）后又陡然上升的走势，形状像“曲棍球杆”。"},"examples":[{"en":"The chart shows a hockey-stick pattern in prices after 2020.","zh":"图表显示2020年后价格呈“曲棍球杆”式走势。"},{"en":"Analysts warned that debt could follow a hockey-stick curve if spending keeps rising.","zh":"分析人士警告说，如果支出持续增加，债务可能会呈“曲棍球杆”式曲线飙升。"}]}],"synonyms":["stick","club","hockey stick curve","hockey-stick pattern","sharp uptick","surge"],"phonetic":"/ˈhɑːki stɪk/","extraExplanation":["在气候议题中常见“hockey stick graph/curve（曲棍球杆图/曲线）”，指长期相对平稳、近代突然上升的温度或二氧化碳变化图。日常表达中也可泛指任何“后期猛增/猛跌后猛增”的趋势。","在器材意义里，ice hockey（冰球）与field hockey（陆地曲棍球）的球杆形状与击球部位不同，但都可叫 hockey stick。"],"etymology":"由 hockey（曲棍球/冰球）+ stick（棍、杆）组成的复合名词；因器材外形明显，后来借用来形容图表中“突然变陡”的曲线形状。","mnemonic":["把它想成“hockey（冰球）+ stick（棍子）= 冰球用的杆”；图表意义就记“像球杆：前面平/低，后面突然翘起来”。","联想中文“曲棍球杆”：关键特征是“弯头”，所以看到弯曲的杆形或弯折的曲线就能想到它。"]}
{"word":"hockeys","summary":{"en":"“Hockeys” is the plural form of “hockey,” meaning the sport(s) of hockey (ice/field), and sometimes the plural of “hockey stick(s).”","zh":"“Hockeys”是“hockey”的复数，主要指不同种类的冰球/曲棍球运动；有时也可指多根冰球杆/曲棍球杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hockey (a sport played on ice or on a field, using sticks to hit a ball or puck)","zh":"hockey 的复数：曲棍球/冰球（用球杆击打球或冰球的运动）"},"examples":[{"en":"In Canada, many kids play hockeys like ice hockey and street hockey.","zh":"在加拿大，很多孩子会玩不同类型的 hockey，比如冰球和街头冰球。"},{"en":"The school offers several hockeys, including field hockey for girls and boys.","zh":"学校提供多种 hockey 项目，包括男女都能参加的曲棍球（field hockey）。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of hockey stick (the stick used to play hockey)","zh":"hockey stick 的复数：冰球杆/曲棍球杆（打冰球或曲棍球用的球杆）"},"examples":[{"en":"The team carried their hockeys into the locker room after practice.","zh":"训练结束后，队员们把球杆带进了更衣室。"},{"en":"We need to buy two hockeys for the kids before the season starts.","zh":"赛季开始前，我们得给孩子们买两根球杆。"}]}],"synonyms":["hockey (plural)","ice hockey (as a type)","field hockey (as a type)","hockey sticks"],"phonetic":"ˈhɑkiz","extraExplanation":["“Hockeys”本身不如“hockey”常见；日常表达里通常说“play hockey”（打冰球/曲棍球）。如果强调不同种类，会说“types of hockey”（不同种类的 hockey），如 ice hockey（冰球）、field hockey（曲棍球）、street hockey（街头冰球）。","在北美语境里，“hockey”常默认指 ice hockey（冰球）；在一些其他地区（如英国、印度、澳大利亚），“hockey”更常指 field hockey（草地/场地曲棍球）。"]}
{"word":"hocking","summary":{"en":"“Hocking” usually means pawning/selling something for cash; less commonly it can mean harming a hamstring, or (informally, often spelled “hawking”) coughing up phlegm.","zh":"“hocking”通常指把东西拿去典当或变卖换钱；较少见可指损伤腿筋；口语里也可能指咳痰/吐痰（常写作 hawking）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) Pawning something or selling it (often quickly, for cash).","zh":"（现在分词）把物品典当，或（常为换现金而）把东西卖掉。"},"examples":[{"en":"He was hocking his watch to pay the rent.","zh":"他把手表拿去典当来付房租。"},{"en":"She started hocking old jewelry online for extra money.","zh":"她开始在网上卖旧首饰来补贴开销。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) Injuring or disabling someone by cutting or damaging the hamstring (behind the knee).","zh":"（较少见）割断或损伤膝后肌腱，使人（或动物）失去行动能力。"},"examples":[{"en":"In the story, the villain tried to hock the horse.","zh":"在故事里，反派想弄伤那匹马的腿筋。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal; often spelled “hawking”) Making a harsh throat sound to bring up phlegm, or spitting it out.","zh":"（非正式；常拼作 hawking）用喉咙发出“咳痰”的声音，或把痰吐出来。"},"examples":[{"en":"He kept hocking and spitting while he had a cold.","zh":"他感冒时一直咳痰、吐痰。"},{"en":"Please don’t hock phlegm in public.","zh":"请不要在公共场合咳痰/吐痰。"}]}],"synonyms":["pawning","pawn","pledging","selling","unloading","(informal) hacking","(informal) hawking"],"phonetic":"/ˈhɑkɪŋ/","extraExplanation":["“hocking”最常见是动词 hock 的现在分词：hock = “典当/变卖”。例如：hock a watch（典当手表）。","表示“咳痰”的意思时，英语里更常写作 hawking（来自 hawk = “清嗓子/咳出痰”）。很多人会把 hawking 误写成 hocking，因此需要结合上下文判断。"]}
{"word":"hockle","summary":{"en":"A hockle is a twist/loop in a rope or cable, and to hockle means to (make it) twist into tangled loops.","zh":"hockle 指绳索/电缆上的扭结或环；作动词指（使其）扭成环并缠结。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a twist or loop that forms in a rope, cable, or hose (often causing it to kink or tangle)","zh":"（绳索、电缆或软管中形成的）扭结；环状打结（常导致打弯或缠结）"},"examples":[{"en":"There’s a hockle in the rope, so it won’t pull smoothly.","zh":"绳子上有个扭结，所以拉起来不顺。"},{"en":"Remove the hockles before you coil the cable.","zh":"把电缆盘起来之前先把扭结理顺。"}]},{"partOfSpeech":"v.","definition":{"en":"to become twisted into loops or tangles; to cause (a rope, cable, etc.) to twist into loops","zh":"（使绳索、电缆等）扭成环并缠结；打扭"},"examples":[{"en":"The line hockled when I reeled it in too fast.","zh":"我收线太快，线就扭成一圈圈缠结了。"},{"en":"Try not to let the hose hockle as you drag it across the yard.","zh":"你把水管拖过院子时，尽量别让它打扭缠结。"}]}],"synonyms":["kink","twist","tangle","snarl"],"phonetic":"/ˈhɑkəl/","extraExplanation":["“hockle”常见于航海、钓鱼、绳索/电缆使用等语境，描述绳子因扭转产生的环与打结（类似“kink / tangle”）。有时也会写作“hockling / hockle”来指这种打扭现象。"]}
{"word":"hockled","summary":{"en":"Hockled means “made unable to move freely,” especially by hamstringing or tying an animal’s hocks.","zh":"hockled 指“使无法自由行动”，尤指挑断腿筋或绑住动物飞节。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of hockle) To disable or restrain (an animal or person), especially by cutting the tendon behind the knee (hamstringing) or by tying an animal’s hocks so it cannot move freely.","zh":"（hockle 的过去式/过去分词）使（动物或人）丧失行动能力或被束缚，尤指割断膝后肌腱（挑断腿筋/腘绳肌）或把动物的飞节绑住使其难以行动。"},"examples":[{"en":"The old story says the thief was hockled so he couldn’t run away.","zh":"老故事里说小偷被挑断腿筋，跑不掉了。"},{"en":"Some farmers once hockled livestock to keep them from wandering far.","zh":"过去有些农民会把牲畜的飞节绑住，防止它们走远。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) Having the hocks tied, injured, or made stiff; unable to move normally.","zh":"（较少见）飞节被绑住、受伤或僵硬的；行动不便的。"},"examples":[{"en":"A hockled sheep lagged behind the rest of the flock.","zh":"一只飞节受限的羊落在羊群后面。"}]}],"synonyms":["hamstrung","hobbled","crippled","disabled"],"phonetic":"/ˈhɑkəld/","extraExplanation":["“hockled”较少见，多出现在较旧的英语、乡村/畜牧语境或文学叙述中。","不要和“hocked”混淆：hocked 常指“把东西拿去典当/抵押”，或与“hock（火腿/飞节）”相关；而 hockled 更接近“使不能走（束缚/挑断腿筋）”。"]}
{"word":"hockling","summary":{"en":"Hockling usually means “hamstringing” (damaging the tendon behind the knee/hock), a rare/old-fashioned usage.","zh":"hockling 通常指“割腿筋/使腿筋受损（致瘸）”，属于比较少见、偏旧式的用法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Present participle of “hockle”) cutting or damaging the tendon behind the knee/hock; hamstringing (often said of an animal).","zh":"（“hockle”的现在分词）割断或损伤膝后/飞节处的肌腱；使（人或动物）腿筋受伤、瘸掉。"},"examples":[{"en":"The poachers were accused of hockling deer to stop them from running away.","zh":"这些偷猎者被指控割断鹿的腿筋，让它们无法逃跑。"},{"en":"In old stories, a defeated horse might be described as hockling in pain.","zh":"在一些旧故事里，战败的马可能会被描写为因腿筋受伤而痛苦地瘸着。"}]}],"synonyms":["hamstringing","crippling","maiming"],"phonetic":"ˈhɑklɪŋ","extraExplanation":["“hockling”在现代英语里非常少见，主要作为动词“hockle（割腿筋/使瘸）”的现在分词出现，带有明显的旧式或文学/历史语感。","很多人写到“hockling”其实可能想表达的是“hocking”（清嗓子、把痰咳出来/吐出来）。如果你能给一句原文语境，我可以帮你判断是哪一个意思更合适。"]}
{"word":"hockmoney","summary":{"en":"Hock money is money you get by pawning something at a pawnshop.","zh":"hock money 指把物品拿去典当后换来的钱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money raised by pawning something (getting cash by leaving an item with a pawnshop as security).","zh":"靠典当（把物品押在当铺作抵押）筹到的钱；典当得来的钱。"},"examples":[{"en":"He paid the rent with hock money after pawning his guitar.","zh":"他把吉他拿去典当后，用典当得来的钱交了房租。"},{"en":"She didn’t want to live on hock money again, so she started saving.","zh":"她不想再靠典当的钱过日子，所以开始存钱。"}]}],"synonyms":["pawn money","money from pawning","pawnshop money"],"phonetic":"/ˈhɑk ˌmʌni/","extraExplanation":["“Hock”在口语里常指“把……拿去典当/抵押”（to hock something），因此“hock money”带有一种拮据、周转困难时才会用的语气。","现代英语里更常说“pawn money”或直接说“money from pawning (something)”。“hock money”比较老派/地方性，用在文学或历史语境里更常见。"]}
{"word":"hocks","summary":{"en":"“Hocks” can mean the back-leg joint of an animal (or meat from it), or it can be the verb form meaning “pawns.” In some slang, it also means “feet.”","zh":"“hocks”可指动物后腿的飞节（或该部位的肉），也可作动词表示“典当”。在部分俚语中还可指“脚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the joint on the back leg of a horse (or other animals), similar to a human ankle; also the meat cut from that joint (especially pork hock).","zh":"（马等动物后腿的）飞节，类似人的脚踝；也可指该部位的肉（尤指猪肘/猪蹄上方的“hock”肉）。"},"examples":[{"en":"The horse injured its hock during the jump.","zh":"那匹马在跳跃时伤到了飞节。"},{"en":"The soup is flavored with a smoked pork hock.","zh":"这锅汤用烟熏猪肘（pork hock）提味。"}]},{"partOfSpeech":"v.","definition":{"en":"to pawn something (leave it as security for a loan); by extension, to sacrifice or risk something for short-term gain.","zh":"把某物拿去典当（作为借款抵押）；引申为为短期利益而牺牲或冒险。"},"examples":[{"en":"He hocked his guitar to pay the rent.","zh":"他把吉他拿去典当来付房租。"},{"en":"They shouldn’t hock their future for quick profit.","zh":"他们不该为了快钱而牺牲未来。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, especially British) the feet or lower legs.","zh":"（俚语，尤英式）脚或小腿。"},"examples":[{"en":"My hocks are aching after walking all day.","zh":"走了一整天，我的脚都酸痛了。"}]}],"synonyms":["pawn","pledge","pork hock","ankle (animal joint sense)"],"phonetic":"/hɑk/","extraExplanation":["“hocks”既可能是名词复数（hock 的复数），也可能是动词第三人称单数（he/she/it hocks）。常见搭配：pork hock（猪肘/猪蹄上方的肉）、to hock something（典当某物）。","动物解剖意义的 hock 常见于马术、兽医学语境；而“典当”的动词用法更偏口语与新闻报道。"]}
{"word":"hockshin","summary":{"en":"“hockshin” is not a standard English word; it’s likely a name/romanization or a misspelling.","zh":"“hockshin”不是标准英语词；更可能是人名/音译或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling or romanization; not a recognized common English vocabulary word. It is most often seen as a personal name (e.g., “Hok Shin/Hock Shin”) or as a misspelling of a different English word.","zh":"一种非标准拼写或音译写法；不是常见的英语词汇。多见于人名（如“Hok Shin / Hock Shin”）或是把其他英语单词拼错了。"},"examples":[{"en":"I couldn’t find “hockshin” in an English dictionary—could it be a person’s name?","zh":"我在英语词典里找不到“hockshin”——它会不会是人名？"},{"en":"If you meant “hocks” or “hock,” the spelling is different from “hockshin.”","zh":"如果你想写的是“hocks”或“hock”，拼写和“hockshin”不一样。"}]}],"synonyms":["(no direct standard-English synonym)"],"phonetic":"/ˈhɑkʃɪn/","extraExplanation":["“hockshin”很可能是某种粤语/闽南语/客家话等的拼音/音译（用于人名或地名），也可能是把英语词拼错了。你可以告诉我：它出现在哪个句子里、你想表达的意思、或原本的语言/名字来源，我就能更准确地给出对应词（例如可能是 hock、Hawksin/Hawking、或某个中文名的音译）。"]}
{"word":"hockshop","summary":{"en":"“Hock shop” means a pawnshop; “to hock” means to pawn something for a loan.","zh":"“hock shop”指当铺；“to hock”指把东西拿去典当抵押借钱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly written as “hock shop”) A shop where you can leave something valuable as a pledge for a loan; a pawnshop.","zh":"（常写作 hock shop）当铺；你把值钱物品抵押换取贷款的店铺。"},"examples":[{"en":"He took his watch to a hock shop to borrow some money.","zh":"他把手表拿到当铺去借点钱。"},{"en":"I saw a guitar I liked in a hock shop window.","zh":"我在当铺橱窗里看到一把我喜欢的吉他。"}]},{"partOfSpeech":"vt.","definition":{"en":"To pawn (something); to take something to a pawnshop as a pledge for a loan.","zh":"典当（某物）；把某物拿到当铺抵押借钱。"},"examples":[{"en":"She hocked her laptop to pay the rent.","zh":"她把笔记本电脑当了来付房租。"},{"en":"Don’t hock your passport—it’s too risky.","zh":"别把护照拿去典当——太危险了。"}]}],"synonyms":["pawnshop","pawn shop","pawnbroker","to pawn","to pledge"],"phonetic":"/ˈhɑk ˌʃɑp/","extraExplanation":["“Hock”在口语里有“典当、抵押”的意思，来自较早期英语中“抵押/担保”的用法；因此“hock shop”就是“pawnshop（当铺）”。","拼写上更常见的是分开写作“hock shop”。在美式英语里更常用“pawn shop / pawnshop”，而“hock shop”带一点旧式、口语或文学色彩。"]}
{"word":"hockshops","summary":{"en":"Hockshops are pawnshops—places where you borrow money by pawning valuables (more common in British English).","zh":"hockshops 指“当铺/典当行”（英式用法更常见），把贵重物品抵押以借钱的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hockshop: a shop (especially in British English) where you can borrow money by leaving something valuable as security; a pawnshop.","zh":"hockshop 的复数：当铺（尤用于英式英语），你把贵重物品抵押给店家以借钱的地方；同 pawnshop。"},"examples":[{"en":"He took his old watch to the hockshop to get some quick cash.","zh":"他把旧手表拿到当铺去换点急用的钱。"},{"en":"Many hockshops sell unclaimed items after a certain time.","zh":"许多当铺会在一定时间后出售无人赎回的物品。"}]}],"synonyms":["pawnshops","pledge shops"],"phonetic":"/ˈhɑkˌʃɑps/","extraExplanation":["“hockshop”在美式英语里不算常用；更常见的说法是“pawnshop”。","“hock”作动词有“典当、抵押”的意思（to hock something），所以“hockshop”字面上就是“典当的店”。"]}
{"word":"hocktide","summary":{"en":"Hocktide is a historical English term for the holiday week after Easter—especially Hock Monday and Tuesday—and sometimes for the money collected during those celebrations.","zh":"Hocktide 是英国历史用语，指复活节后的一周节期（尤指霍克星期一/星期二），也可指该节期中募集的款项。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) A medieval English holiday period in the second week after Easter, especially the Monday and Tuesday (Hock Monday and Hock Tuesday), marked by local festivities and fundraising customs.","zh":"（历史用语）英国中世纪复活节后第二周的节期，尤指“霍克星期一/星期二”（Hock Monday/Tuesday），常伴随民间庆祝与募款习俗。"},"examples":[{"en":"In some medieval towns, Hocktide brought games, parades, and collections for the parish.","zh":"在一些中世纪城镇，Hocktide 会有游戏、游行，并为教区募捐。"},{"en":"The record mentions payments gathered at Hocktide after Easter.","zh":"这份记录提到复活节后在 Hocktide 期间收取的款项。"}]},{"partOfSpeech":"n.","definition":{"en":"Money collected or a payment made during Hocktide (in historical documents).","zh":"（史料中）Hocktide 期间募得的钱款或在该时段缴纳的款项。"},"examples":[{"en":"The ledger lists a small Hocktide for church repairs.","zh":"账本里记着一笔用于教堂修缮的 Hocktide 款项。"}]}],"synonyms":["Hock Monday","Hock Tuesday","(historical) Easter week festivities"],"phonetic":"/ˈhɑk.taɪd/","extraExplanation":["这个词非常少见，多见于英国史、民俗学或中世纪账簿/教会文书中。","词源上可理解为“hock + tide（时节/节期）”。Hocktide 的习俗在不同地区不一：常见的说法是人们用绳子“拦住”路人或象征性“抓住”某些人，再让对方付小钱赎身，钱用于教会或社区用途。","相关说法/搭配：Hock Monday（霍克星期一）、Hock Tuesday（霍克星期二）、Hocktide collections（霍克节募捐/募款）。"]}
{"word":"hocky","summary":{"en":"Hockey is a team sport played with sticks, usually on ice, where players try to score goals with a puck or ball.","zh":"Hockey（曲棍球）是一种用球杆进行的团队运动，通常在冰上进行，球员用冰球或球争取得分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fast team sport played on ice (or sometimes on a field) in which players use sticks to hit a ball or puck into the opponent’s goal.","zh":"一种快速的团队运动（常见为冰上曲棍球，也有草地曲棍球），球员用球杆将球或冰球（puck）击入对方球门得分。"},"examples":[{"en":"My brother plays hockey on a local team every weekend.","zh":"我哥哥每个周末都在本地球队打曲棍球。"},{"en":"In ice hockey, players skate and try to score with the puck.","zh":"在冰上曲棍球里，球员穿冰刀滑行，并用冰球（puck）争取得分。"},{"en":"Canada is famous for hockey culture.","zh":"加拿大以曲棍球文化闻名。"}]}],"synonyms":["ice hockey","field hockey"],"phonetic":"/ˈhɑki/","extraExplanation":["你输入的“hocky”通常是拼写错误；正确拼写是“hockey”。","日常英语里不加说明时，“hockey”多指“ice hockey（冰上曲棍球）”；在一些国家（如印度、巴基斯坦等）也可能常指“field hockey（草地曲棍球）”。","“puck”专指冰上曲棍球用的黑色扁圆冰球；草地曲棍球通常用“ball（球）”。"]}
{"word":"HOCl","summary":{"en":"The chemical formula for hypochlorous acid, a disinfecting weak acid.","zh":"次氯酸的化学式，一种用于消毒的弱酸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical formula for hypochlorous acid, a weak acid and disinfectant formed when chlorine dissolves in water.","zh":"次氯酸的化学式；一种弱酸和消毒剂，氯溶于水时可生成。"},"examples":[{"en":"Many disinfectant sprays list HOCl as the active ingredient.","zh":"许多消毒喷雾会把 HOCl 标为有效成分。"},{"en":"In water treatment, HOCl helps kill bacteria and viruses.","zh":"在水处理里，HOCl 有助于杀灭细菌和病毒。"},{"en":"HOCl is also produced by the human immune system to fight microbes.","zh":"人体免疫系统也会生成 HOCl 来对抗微生物。"}]}],"synonyms":["hypochlorous acid"],"phonetic":"/ˌeɪtʃ oʊ siː ˈɛl/","extraExplanation":["在日常语境中，HOCl 常出现在产品标签、实验记录或水处理资料里；读法通常是按字母念（H-O-C-L），也有人直接说 hypochlorous acid。","不要与 HCl（盐酸）混淆：HCl 更强、更具腐蚀性；HOCl 常用于温和消毒（具体安全性仍取决于浓度与配方）。"],"etymology":"这是化学式写法：H（氢）+ O（氧）+ Cl（氯）。对应的英文名称是 hypochlorous acid（次氯酸），其中 hypo- 表示“低/次”，chlor- 来自“氯”，-ous acid 表示某类含氧酸。","mnemonic":["把 HOCl 拆开记：H-O-Cl = 氢 + 氧 + 氯 → 含氯的“氧酸”，联想到“次氯酸水/消毒水”。","Cl 让你想到 chlorine（氯/氯消毒），O 让你想到含氧酸，比起 HCl（盐酸）多了一个 O。"]}
{"word":"hocus","summary":{"en":"Hocus means trickery or meaningless ‘magic’ words, and it’s most often seen in the phrase “hocus-pocus.”","zh":"hocus 指骗人的把戏或装神弄鬼的胡话，最常见于短语“hocus-pocus”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"trickery or nonsense words used to make something seem magical or mysterious (often used as part of “hocus-pocus”).","zh":"骗人的把戏；装神弄鬼的胡话（常见于短语“hocus-pocus”中）。"},"examples":[{"en":"The salesman’s promises felt like pure hocus to me.","zh":"那个推销员的承诺在我看来就是纯粹的忽悠。"},{"en":"The magician whispered a little hocus before pulling a coin from her ear.","zh":"魔术师小声念了几句装神弄鬼的话，然后从耳朵里“变”出一枚硬币。"}]}],"synonyms":["trickery","nonsense","smoke and mirrors","mumbo jumbo"],"phonetic":"/ˈhoʊkəs/","extraExplanation":["“hocus”在现代英语里很少单独使用，更常见的是固定搭配“hocus-pocus”，用来形容“装神弄鬼的咒语/把戏”或“故弄玄虚的说法”。","词源常被认为与拉丁语宗教用语的误听或戏仿有关（有人联系到弥撒中的拉丁语句子），因此带有“听起来很像咒语、但其实不一定有意义”的感觉。"]}
{"word":"hocus-pocus","summary":{"en":"Magical-sounding words or deceptive trickery.","zh":"魔术咒语式用语；也指糊弄人的把戏或花招。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Words said by a magician to seem to make magic happen; also, any trick or deceptive talk meant to fool people.","zh":"魔术师念的“咒语/口头禅”；也指用来糊弄人的把戏或花言巧语。"},"examples":[{"en":"The magician waved his wand and said, “Hocus-pocus!”","zh":"魔术师挥动魔杖，念道：“Hocus-pocus!”"},{"en":"Don’t be fooled by the hocus-pocus—read the contract carefully.","zh":"别被那些花招糊弄了——合同要仔细读。"},{"en":"His explanation sounded like hocus-pocus to me.","zh":"他的解释在我听来像是在胡扯。"}]}],"synonyms":["magic","trickery","sleight of hand","deception","smoke and mirrors","mumbo jumbo"],"phonetic":"/ˈhoʊkəs ˈpoʊkəs/","extraExplanation":["常见搭配：\"a lot of hocus-pocus\"（一堆花招/玄乎其玄的说法）、\"hocus-pocus and mirrors\"（常见说法是\"smoke and mirrors\"；意思相近：用假象遮掩真相）。","语气多为不太严肃或带怀疑：说某事是 hocus-pocus，通常表示你不相信那套说法，觉得不科学或在忽悠。"],"etymology":"词源不确定，17世纪在英语中流行，常被认为模仿宗教拉丁语仪式用语的声音（民间说法有联系到“hoc est corpus”等），后来固定为舞台魔术里的“咒语”，也引申为“障眼法/忽悠”。","mnemonic":["把它当作魔术“咒语音效”：念起来像变戏法的声音，所以=魔术/把戏。","联想中文“忽悠忽悠”：hocus-pocus 听感也像在“糊弄人”的口头花招。"]}
{"word":"hocused","summary":{"en":"Hocused means either drugged/stupefied (often by a hidden substance) or tricked/deceived.","zh":"hocused 指“被下药弄得迷糊”，也可指“被欺骗/被忽悠”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"drugged or stupefied (often by secretly adding a substance to food or drink).","zh":"（常指暗中在食物或饮料中加药而）下药使迷糊/昏沉。"},"examples":[{"en":"His drink was hocused, and he could barely stand.","zh":"他的饮料被人下了药，他几乎站不稳。"},{"en":"The victim may have been hocused before the robbery.","zh":"受害者可能在被抢劫前就被下药迷昏了。"}]},{"partOfSpeech":"adj.","definition":{"en":"tricked or deceived; manipulated by dishonest means.","zh":"被欺骗的；被耍弄/被做局的。"},"examples":[{"en":"I felt hocused by the fake “limited-time” deal.","zh":"我觉得自己被那个假“限时优惠”给忽悠了。"},{"en":"The audience was hocused into believing the results were real.","zh":"观众被忽悠得以为结果是真的。"}]}],"synonyms":["drugged","spiked","stupefied","tricked","duped","deceived","bamboozled"],"phonetic":"/ˈhoʊkəst/","extraExplanation":["“hocused”来自动词 hocus（使昏沉/施骗），与民间咒语式的 “hocus-pocus” 同源，因此常带有“用手段让人失去判断力”的感觉。","在现代英语里，这个词比较少见；更常见的说法是 drugged（被下药）、spiked（被掺药，尤指酒被下药）或 tricked/duped（被欺骗）。"]}
{"word":"hocuses","summary":{"en":"“Hocuses” can mean tricks/deceptive acts (plural noun), or it can be the verb form meaning “deceives/uses trickery.”","zh":"“hocuses”可指“把戏/欺骗手段”（复数名词），也可作动词第三人称单数，表示“欺骗、耍花招”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) tricks or deceptive actions, often meant to confuse or impress people","zh":"（复数名词）把戏；障眼法；骗人的手段（常用来迷惑或唬人）"},"examples":[{"en":"The magician’s performance was full of clever hocuses and misdirection.","zh":"魔术师的表演充满了巧妙的把戏和误导视线的手法。"},{"en":"Don’t fall for marketing hocuses—check the facts first.","zh":"别被营销噱头骗了——先核实事实。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular verb) deceives or uses trickery; tries to fool someone","zh":"（动词第三人称单数）欺骗；耍花招；试图蒙混过关"},"examples":[{"en":"He hocuses the audience with flashy claims but little evidence.","zh":"他用花哨的说法来蒙骗观众，却几乎没有证据。"},{"en":"The salesperson hocuses customers into buying extras they don’t need.","zh":"销售人员用花招把顾客骗去买不需要的附加项目。"}]}],"synonyms":["tricks","deceptions","shenanigans","sleight of hand","hocus-pocus"],"phonetic":"/ˈhoʊkəsɪz/","extraExplanation":["“hocus”常让人联想到咒语式的“hocus-pocus”（类似中文的“天灵灵地灵灵/咒语”），带有“看似神秘其实是障眼法”的语感。在现代英语里，多用于批评夸张宣传、伪科学或花招。"]}
{"word":"hocusing","summary":{"en":"“Hocusing” is not standard English; it is usually a misspelling of “focusing.”","zh":"“hocusing”不是标准英语；通常是“focusing”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; usually a misspelling of “focusing” (paying close attention to something or directing effort toward it).","zh":"非标准拼写；通常是“focusing”的拼写错误，意思是“专注于/把精力集中在某事上”。"},"examples":[{"en":"I think you meant “focusing”: “I’m focusing on my English this year.”","zh":"你可能想写的是“focusing”：“今年我把精力放在英语上。”"},{"en":"Try: “The camera is focusing on the child.”","zh":"可以写：“相机正在对焦到那个孩子身上。”"}]}],"synonyms":["focusing","concentrating","centering","zeroing in"],"phonetic":"/ˈfoʊkəsɪŋ/","extraExplanation":["“hocusing”在现代英语里不是常见单词。如果你是在某个特定语境（比如人名、品牌名、方言、或打字识别错误）里看到它，可以把原句发我，我能更准确判断你想表达的是“focusing”还是别的词。"]}
{"word":"hocussed","summary":{"en":"“Hocused” means “tricked/deceived,” and in older usage it can also mean “drugged or tampered with (a drink).”","zh":"“hocused”表示“被欺骗/被忽悠”；在较旧的用法中也可指“（饮料）被下药或被动了手脚”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hocus”: to trick or deceive someone, often by using misleading words or actions.","zh":"“hocus”的过去式/过去分词：欺骗、哄骗某人，常用花言巧语或障眼法来误导。"},"examples":[{"en":"He claimed the contract was fair, but the customers felt they had been hocused.","zh":"他声称合同很公平，但顾客觉得自己被忽悠了。"},{"en":"The salesman hocused the audience with flashy promises and vague details.","zh":"推销员用华丽的承诺和含糊的细节把听众骗得团团转。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hocus”: to drug or tamper with a drink (historical/old-fashioned usage).","zh":"“hocus”的过去式/过去分词：在饮料中下药或动手脚（历史/旧式用法）。"},"examples":[{"en":"In old stories, a traveler might find his wine hocused at an inn.","zh":"在旧故事里，旅人可能会发现自己在旅店的酒被人下了药。"},{"en":"The detective suspected the victim’s drink had been hocused.","zh":"侦探怀疑受害者的饮料被人动过手脚（下药）。"}]}],"synonyms":["duped","tricked","fooled","deceived","hoodwinked","scammed"],"phonetic":"ˈhoʊkəst","extraExplanation":["“hocused”比较少见，现代英语更常用“duped / tricked / scammed”表达“被骗”。","它与“hocus-pocus”（指“变戏法的咒语/障眼法”，引申为“花招、把戏”）有关联，因此带有“用把戏蒙人”的感觉。","“在酒里下药”的含义偏旧式，常见于历史叙述或文学语境。"]}
{"word":"hocusses","summary":{"en":"“Hocus” means a trick or deception, or to trick someone; it’s closely related in feeling to “hocus-pocus.”","zh":"“hocus”指把戏/骗局，也可作动词表示欺骗；语感上常与“hocus-pocus（障眼法）”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trick, deception, or bit of nonsense used to confuse or fool people","zh":"把戏；骗局；用来迷惑或欺骗人的胡扯/花招"},"examples":[{"en":"Don’t fall for his political hocus—check the facts.","zh":"别被他政治上的花招骗了——先核实事实。"},{"en":"The “miracle cure” turned out to be pure hocus.","zh":"那个“神奇疗法”结果完全是骗局吗/胡扯。"}]},{"partOfSpeech":"v.","definition":{"en":"to trick someone; to mislead with dishonest words or actions","zh":"欺骗；用花言巧语误导"},"examples":[{"en":"They tried to hocus customers into buying expensive add-ons.","zh":"他们试图用花招诱骗顾客购买昂贵的附加服务。"},{"en":"I won’t let anyone hocus me into signing something I don’t understand.","zh":"我不会让任何人用花言巧语骗我签我不懂的东西。"}]}],"synonyms":["trick","deception","fraud","con","scam","sleight of hand","nonsense"],"phonetic":"ˈhoʊkəs","extraExplanation":["你输入的 **hocusses** 更常见的标准拼写是 **hocuses**（hocus 的第三人称单数或复数形式，如“deceptions/ tricks”）。","**hocus** 常让人联想到固定搭配 **hocus-pocus**（魔术师的咒语/障眼法），因此这个词带有“故弄玄虚、用花招蒙人”的语气，日常多用于批评或揭穿骗局。"]}
{"word":"hocussing","summary":{"en":"“Hocussing” is usually a misspelling of **hocusing** (from *hocus*), meaning tricking or deceiving; related to the phrase **hocus-pocus** (fake magic or nonsense).","zh":"“hocussing”通常是 **hocusing** 的拼写误写，表示“耍花招/欺骗”；相关短语 **hocus-pocus** 指“假魔术/故弄玄虚的胡话或把戏”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Usually written as **hocusing**) the present participle of **hocus**: to trick or deceive someone, often with showy or fake “magic” or misleading talk.","zh":"（通常写作 **hocusing**）**hocus** 的现在分词：用花招或误导性的说法欺骗别人，常带有“假魔术/障眼法”的感觉。"},"examples":[{"en":"He was just **hocusing** the audience with flashy moves, not real skill.","zh":"他只是用花哨的动作在**耍花招**骗观众，并不是真本事。"},{"en":"Don’t let marketing **hocus** you into buying something you don’t need.","zh":"别让营销话术把你**忽悠**得去买你不需要的东西。"}]},{"partOfSpeech":"phrase","definition":{"en":"**hocus-pocus**: fake magic, nonsense words, or a trick meant to impress or distract people.","zh":"**hocus-pocus**：假魔术、胡言乱语（像念咒一样的话），或用来唬人/转移注意力的把戏。"},"examples":[{"en":"Ignore the **hocus-pocus** and look at the facts.","zh":"别理那些**故弄玄虚**，看事实。"},{"en":"The magician used smoke and mirrors—classic **hocus-pocus**.","zh":"魔术师用烟雾和镜子——典型的**障眼法**。"}]}],"synonyms":["trick","deceive","con","dupe","bamboozle","hoodwink"],"phonetic":"/ˈhoʊkəs/","extraExplanation":["你写的 **hocussing** 更像是拼写错误：按英语常见拼写规则应为 **hocusing**（不需要双写 s）。","**hocus-pocus** 常带一点幽默或轻蔑的语气，表示“装神弄鬼、故弄玄虚”。在日常表达里，想说“专注”通常是 **focusing**，不是 hocusing。"]}

