{"word":"Hoe","summary":{"en":"A “hoe” is usually a gardening tool, or it can mean to work the soil with that tool. In slang, it can be an offensive insult for a woman.","zh":"“hoe”通常指锄头，或指用锄头翻土/除草；但在俚语中也可作对女性的冒犯性侮辱用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a garden or farm tool with a long handle and a flat blade, used for digging, breaking up soil, and removing weeds","zh":"锄头；一种带长柄和扁平刀片的园艺/农具，用来翻土、松土或除草"},"examples":[{"en":"She used a hoe to pull up weeds between the rows.","zh":"她用锄头把垄间的杂草锄掉。"},{"en":"In spring, farmers hoe the soil to prepare for planting.","zh":"春天农民会锄地，为播种做准备。"}]},{"partOfSpeech":"v.","definition":{"en":"to loosen or shape soil with a hoe; to remove weeds with a hoe","zh":"用锄头翻土/松土；用锄头除草"},"examples":[{"en":"I need to hoe the garden before we plant tomatoes.","zh":"种番茄前我得先把菜园锄一锄。"},{"en":"He hoed around the plants carefully to avoid damaging the roots.","zh":"他小心地在植株周围锄土，避免伤到根。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, offensive) a derogatory term for a woman, often implying she is sexually promiscuous; also used as an insult","zh":"（俚语，冒犯性）对女性的贬称，常暗示“随便/放荡”，也可作侮辱性称呼"},"examples":[{"en":"That word is disrespectful—please don’t call women that.","zh":"那个词很不尊重人——请不要那样称呼女性。"},{"en":"Some songs use the term, but it can be hurtful in real life.","zh":"有些歌曲会用这个词，但在现实生活中可能会伤人。"}]}],"synonyms":["(tool) garden hoe","(tool) cultivator","(verb) weed","(verb) till"],"phonetic":"/hoʊ/","extraExplanation":["“hoe”作为工具词很常见且中性；但作为俚语（有时也拼作“ho”）在英语语境中常带强烈贬义和性羞辱色彩。即使在音乐或网络语境里见到，也不建议在正式场合或对人使用，以免冒犯或造成伤害。"]}
{"word":"hoe","summary":{"en":"“Hoe” most commonly means a tool for weeding/loosening soil, or the action of using it. It also has an offensive slang meaning used as an insult.","zh":"“hoe”最常指锄头（农具）或“用锄头锄地/除草”的动作；另有冒犯性的俚语含义，用作对人的侮辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a garden or farm tool with a long handle and a flat metal blade, used for loosening soil and removing weeds","zh":"锄头；一种带长柄和平金属刃的园艺/农具，用于松土和除草"},"examples":[{"en":"She used a hoe to pull weeds from the vegetable garden.","zh":"她用锄头把菜园里的杂草锄掉。"},{"en":"Farmers often hoe the soil before planting seeds.","zh":"农民常在播种前锄松土壤。"}]},{"partOfSpeech":"v.","definition":{"en":"to use a hoe to loosen soil or remove weeds","zh":"用锄头松土；锄草"},"examples":[{"en":"I spent the morning hoeing the rows of corn.","zh":"我一早都在给玉米地一垄垄地锄草。"},{"en":"You can hoe around the plants to keep weeds away.","zh":"你可以在植物周围锄一锄来抑制杂草。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, offensive) a term used to insult someone, especially a woman, suggesting she is sexually promiscuous","zh":"（俚语，冒犯性）侮辱性的称呼，尤其指女性“很随便/滥交”"},"examples":[{"en":"That word is disrespectful—don’t use it to talk about people.","zh":"那个词很不尊重人——别用它来形容别人。"},{"en":"In many songs, the term is used as an insult.","zh":"在一些歌曲里，这个词被当作辱骂用语。"}]}],"synonyms":["n. (tool): cultivator","v.: weed","v.: cultivate","slang (offensive): (avoid using)"],"phonetic":"/hoʊ/","extraExplanation":["“hoe”作农具时是中性常用词；但作俚语辱骂时非常不礼貌，容易带有性别歧视与羞辱意味。在正式场合或对人称呼时应避免使用。","俚语用法有时与“whore”（妓女）在发音/拼写上被混用或刻意改写有关，因此在歌词、网络语境中更常出现。"]}
{"word":"hoe-like","summary":{"en":"having a shape like a hoe","zh":"锄头状的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hoe (a farming/gardening tool), especially in shape or function.","zh":"像锄头的；锄头状的（尤指形状或用途像锄头）。"},"examples":[{"en":"The archaeologist found a hoe-like stone tool used for digging.","zh":"考古学家发现了一件锄头状的石器，用来挖掘。"},{"en":"The plant has a hoe-like root that spreads just under the soil.","zh":"这种植物的根呈锄头状，在表土下横向延展。"}]}],"synonyms":["hoe-shaped","hoeish","spade-like"],"phonetic":"/ˈhoʊ laɪk/","extraExplanation":["hoe 指一种常见的农具/园艺工具：通常有一片扁平的金属刃，装在长柄上，用于除草、松土、开沟等。hoe-like 常用来描述“形状像锄头”的器具、石器、骨器或某些植物结构。"],"etymology":"由“hoe（锄头）+ -like（像……的）”构成的复合形容词，直译为“像锄头的”。","mnemonic":["把它拆开记：hoe（锄头）+ like（像）=“像锄头一样”。","联想“锄头的扁平刃+长柄”的轮廓：看到类似外形就可以用 hoe-like。"]}
{"word":"hoe-shaped","summary":{"en":"shaped like a hoe","zh":"形状像锄头的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a hoe (a farm tool), typically wide and flat at one end like a blade.","zh":"呈锄头（农具）形状的；一端通常较宽、较扁，像刀片一样。"},"examples":[{"en":"Archaeologists found a hoe-shaped stone tool near the river.","zh":"考古学家在河边发现了一件锄形石器。"},{"en":"The surgeon used a hoe-shaped instrument to lift the tissue gently.","zh":"外科医生用一种锄形器械轻轻抬起组织。"}]}],"synonyms":["hoe-like","spade-shaped"],"phonetic":"/ˈhoʊ ˌʃeɪpt/","extraExplanation":["“X-shaped”是英语里很常见的构词方式，用来快速描述外形：如 spoon-shaped（勺形的）、U-shaped（U形的）、heart-shaped（心形的）。","连字符（hoe-shaped）常见于较正式或书面表达；在某些场合也会写作 hoe shaped。"],"etymology":"由“hoe（锄头）+ shaped（……形状的）”构成的复合形容词，用来描述外形像锄头的物体。","mnemonic":["记成“hoe（锄头）+ shaped（有……形状）”，看到连字符就想到“像……一样”。","联想中文“锄形/锄头形”：一端宽扁，像小铲片。"]}
{"word":"hoecake","summary":{"en":"A hoecake is a Southern U.S. cornmeal flatbread, traditionally cooked on a hot surface like a skillet (or historically on a hoe blade).","zh":"hoecake 指美国南方常见的玉米面扁饼，通常在平底锅等热面上烙熟（传统说法是用加热的锄头铁片）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple, usually round cornmeal flatbread cooked on a hot surface (traditionally on the blade of a hoe) and associated with the U.S. South","zh":"一种简单的玉米面扁饼，通常做成圆形，在热面上烙熟（传统说法是用锄头的铁片加热来烙），常见于美国南方饮食文化"},"examples":[{"en":"For breakfast, she made hoecakes with butter and honey.","zh":"早餐她做了玉米面扁饼，配黄油和蜂蜜。"},{"en":"Hoecakes are often served with beans, greens, or fried chicken in Southern cooking.","zh":"在美国南方菜里，玉米面扁饼常搭配豆子、绿叶菜或炸鸡一起吃。"},{"en":"The recipe says to cook the hoecake on a cast-iron skillet until golden.","zh":"食谱说要用铸铁锅把玉米面扁饼烙到金黄。"}]}],"synonyms":["johnnycake","cornmeal cake","corncake"],"phonetic":"/ˈhoʊ.keɪk/","extraExplanation":["“hoecake”这个词带有明显的地域与历史色彩，多与美国南方早期乡村生活相关：玉米面便宜易得，做成扁饼后在火边或铁锅上快速烙熟，方便当作主食或配菜。","名称里的“hoe（锄头）”来自一种传统说法：把锄头铁片加热当作烙饼的平面。现代做法通常用平底锅或铸铁锅。","相关词：johnnycake（约翰尼蛋糕，另一种玉米面饼，地区做法不同）、cornbread（玉米面包/玉米面糕，更厚、更像烤出来的面包）。"]}
{"word":"hoecakes","summary":{"en":"Hoecakes are small cornmeal cakes, typically cooked on a griddle or skillet; the word is the plural of “hoecake.”","zh":"Hoecakes 指用玉米面做的小饼，通常在铁板或煎锅上烙熟；该词是 hoecake 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, usually round cornmeal cake (similar to cornbread) cooked on a griddle, skillet, or hot surface; common in Southern U.S. cooking. “Hoecakes” is the plural form of “hoecake.”","zh":"（美国南方常见的）玉米面小饼，通常做成圆形，在煎锅/铁板等热面上烙熟；“hoecakes”为“hoecake”的复数。"},"examples":[{"en":"For breakfast, we had hoecakes with butter and honey.","zh":"早餐我们吃了玉米面小饼，配黄油和蜂蜜。"},{"en":"My grandmother fried hoecakes in a cast-iron skillet.","zh":"我奶奶用铸铁锅煎玉米面小饼。"},{"en":"The stew tastes great when you dip hoecakes into it.","zh":"把玉米面小饼蘸着炖菜吃，味道特别好。"}]}],"synonyms":["corn cakes","cornmeal cakes","johnnycakes"],"phonetic":"ˈhoʊkeɪk","extraExplanation":["“hoecake”常被认为与早期美国乡村/南方地区的做法有关：人们把玉米面糊摊在热的铁板或工具表面上烤熟。名字里的“hoe（锄头）”据说与“在锄头或类似的金属面上烤饼”的民间说法有关，但具体来源并非完全统一。","在现代菜单或文学/影视中，hoecakes常作为“南方家常菜/传统食物”的文化符号出现，常搭配黄油、糖浆、蜂蜜，或与炖菜、烤肉等一起吃。","相关近义说法：corn cakes / cornmeal cakes（更通用）；johnnycakes（地区性更强，在某些地区与hoecakes相近但不完全等同）。"]}
{"word":"hoed","summary":{"en":"“Hoed” means “used a hoe to work the soil or remove weeds.”","zh":"“Hoed”表示“用锄头翻土或除草”（为hoe的过去式/过去分词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense and past participle of “hoe”: to use a hoe (a garden/farm tool) to break up soil, remove weeds, or make rows for planting.","zh":"“hoe”的过去式和过去分词：用锄头（园艺/农具）翻松泥土、除草或开沟起垄以便种植。"},"examples":[{"en":"She hoed the garden to remove weeds.","zh":"她用锄头给花园除草。"},{"en":"We hoed the soil before planting the seeds.","zh":"我们在播种前把土锄松了。"},{"en":"He had already hoed the rows by sunrise.","zh":"天亮前他就已经把垄沟锄好了。"}]}],"synonyms":["weed","cultivate","till"],"phonetic":"/hoʊd/","extraExplanation":["“hoe”是常见的园艺工具名（锄头），动词hoe常用于园艺/农业语境，如hoe the garden/field/soil/rows。与“mow（割草）”“weed（除草）”不同，hoe强调用锄头松土或把杂草锄掉。"]}
{"word":"hoedown","summary":{"en":"A hoedown is a lively American folk dance event—or the dance itself—usually with fiddle or country music.","zh":"hoedown指热闹的美国乡村民间舞会，也可指这种舞本身，常配提琴或乡村音乐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lively social event with traditional folk dancing (especially in the U.S.), often to fiddle or country music.","zh":"（尤指美国的）热闹民间舞会/乡村舞会，常配提琴或乡村音乐。"},"examples":[{"en":"They went to a hoedown at the county fair and danced all night.","zh":"他们去参加了县集市上的乡村舞会，跳了一整晚。"},{"en":"The band played fast fiddle tunes for the hoedown.","zh":"乐队为舞会演奏了节奏很快的提琴曲。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of upbeat folk dance performed at such an event, often in lines or groups.","zh":"一种在这类舞会上跳的欢快民间舞（常见为排舞或集体舞）。"},"examples":[{"en":"We learned a simple hoedown in dance class.","zh":"我们在舞蹈课上学了一支简单的乡村舞。"},{"en":"The caller taught the steps before the hoedown began.","zh":"舞蹈指挥在开始前先教了动作步骤。"}]}],"synonyms":["barn dance","country dance","square dance"],"phonetic":"/ˈhoʊˌdaʊn/","extraExplanation":["“hoedown”带有浓厚的美国乡村文化色彩，常让人联想到谷仓舞会（barn dance）、乡村集市（county fair）以及“caller”（口令指挥者）带领大家按口令变换队形的场景。","在流行文化里，hoedown常用来营造轻松、热闹、带点“乡土风”的氛围；一些乡村音乐或节目也会用“hoedown”指代这种快节奏的舞曲风格。"]}
{"word":"hoedowns","summary":{"en":"“Hoedowns” is the plural of “hoedown,” meaning lively folk dance events (or the dances) often associated with American rural culture.","zh":"“Hoedowns”是“hoedown”的复数，指带有美国乡村氛围的热闹民间舞会/舞蹈（或其中的舞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively group dance party with traditional folk music (often country/bluegrass), common in rural North America; also the dance performed there","zh":"（常见于北美乡村的）热闹民间舞会/舞蹈聚会（常配乡村/蓝草等传统音乐）；也可指在该场合跳的舞"},"examples":[{"en":"They went to a hoedown at the county fair and danced all night.","zh":"他们去参加了县集市的乡村舞会，跳了一整晚。"},{"en":"The band played fiddles and banjos for the hoedown.","zh":"乐队用小提琴和班卓琴为舞会伴奏。"},{"en":"Our school held a fall hoedown to raise money for charity.","zh":"我们学校举办了秋季乡村舞会，为慈善募款。"}]}],"synonyms":["barn dance","square dance","country dance","dance party"],"phonetic":"/ˈhoʊˌdaʊn/","extraExplanation":["“Hoedown”带有很强的美国乡村文化色彩，常见于集市（county fair）、谷仓舞会（barn dance）、社区活动等场景。虽然字面上含有“hoe（锄头）”，但现代用法主要指音乐与舞蹈的聚会氛围，而不是农业劳动。","在口语里也常与“square dance（方块舞）”“barn dance（谷仓舞会）”等一起出现；不同地区的风格和舞步可能不完全相同。"]}
{"word":"hoeful","summary":{"en":"Hopeful means feeling optimistic about the future, or a person who hopes to win/get something.","zh":"hopeful 指“充满希望/乐观的”，也可指“有望获得某物的人（候选人）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling or showing hope; believing that something good is likely to happen.","zh":"充满希望的；抱有期待的（相信好事很可能发生）。"},"examples":[{"en":"I’m hopeful that we can solve this problem soon.","zh":"我希望我们能很快解决这个问题。"},{"en":"She sounded hopeful about her chances of getting the job.","zh":"她对自己得到那份工作的机会听起来很有信心/很期待。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who wants something and hopes to get it (often used in news or formal writing).","zh":"有希望获得某物的人；候选人（常见于新闻或较正式语境）。"},"examples":[{"en":"Several hopefuls applied for the scholarship.","zh":"有好几位希望获得奖学金的人提出了申请。"},{"en":"The party’s presidential hopeful spoke at the event.","zh":"该党总统候选人在活动上发言。"}]}],"synonyms":["optimistic","positive","promising","aspiring","expectant"],"phonetic":"ˈhoʊpfəl","extraExplanation":["你输入的 **hoeful** 很可能是拼写错误；正确拼写通常是 **hopeful**。","在口语里，**hopeful** 常和从句搭配：**hopeful (that) + 句子**；也常用于礼貌表达：**I’m hopeful** 比 **I’m sure** 更委婉。"]}
{"word":"hoeing","summary":{"en":"Hoeing means using a hoe—usually to loosen soil, remove weeds, or make planting rows.","zh":"hoeing 指用锄头锄地，通常用于松土、除草或开沟起垄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of using a hoe to loosen soil, remove weeds, or make rows for planting","zh":"用锄头松土、除草或开沟（做垄）的劳动/活动"},"examples":[{"en":"After the rain, we spent the morning hoeing to break up the hard soil.","zh":"下过雨后，我们用了一上午锄地，把板结的土弄松。"},{"en":"Hoing between the rows helps keep weeds from taking over.","zh":"在作物行间锄地能防止杂草疯长。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “hoe”: using a hoe to loosen soil or remove weeds","zh":"“hoe”的现在分词：用锄头松土或除草"},"examples":[{"en":"He is hoeing the vegetable patch behind the house.","zh":"他正在屋后的小菜园里锄地。"},{"en":"She spent the afternoon hoeing weeds out of the garden beds.","zh":"她下午一直在花坛里锄草。"}]}],"synonyms":["cultivating","weeding","tilling","gardening"],"phonetic":"/ˈhoʊɪŋ/","extraExplanation":["“hoeing”来自动词“hoe”（锄地/用锄头），拼写上是 hoe + -ing，中间通常保留 e：hoeing（不是 *hoing）。","hoeing 常常包含“松土 + 除草”的意思；而 weeding 更强调“除草”（不一定用锄头）。在园艺语境里，hoeing 很常见。"]}
{"word":"hoelike","summary":{"en":"“Hoelike” means “shaped like a hoe” or “having a hoe’s function.”","zh":"“hoelike”表示“像锄头的”，可指形状相似或用途类似。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hoe (a garden tool with a long handle and a flat blade), especially in shape or function.","zh":"像锄头的；具有锄头形状或用途的。"},"examples":[{"en":"The fossil had a hoelike claw that may have helped it dig for insects.","zh":"这块化石有一只像锄头一样的爪子，可能用来挖掘昆虫。"},{"en":"Use the hoelike end of the tool to break up the soil.","zh":"用工具锄头状的一端来把土块敲碎。"}]}],"synonyms":["hoe-like","hoe-shaped","spade-like"],"phonetic":"/ˈhoʊˌlaɪk/","extraExplanation":["“hoelike”通常写作“hoe-like”，由“hoe（锄头）+ -like（像……一样）”构成，多见于科学写作（生物学、古生物学）或技术说明中，用来描述形状/结构“像锄头”。"]}
{"word":"hoer","summary":{"en":"“Hoer” is not standard English; it’s usually a misspelling/archaic spelling of “whore,” an offensive term for a sex worker.","zh":"“hoer”不是标准英语；通常是“whore”的拼写错误或古拼法，指卖淫者，但该词带冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) A misspelling or archaic spelling of “whore,” meaning a person who sells sex (offensive term).","zh":"（非标准/罕见）“whore”的拼写错误或古拼法，指“卖淫者”（带侮辱性、冒犯用语）。"},"examples":[{"en":"The word “hoer” is not common in modern English; most readers will see it as a misspelling of “whore.”","zh":"“hoer”在现代英语中不常见；多数读者会把它看作“whore”的拼写错误。"},{"en":"Many writers avoid this term because it is insulting and stigmatizing.","zh":"很多写作者会避免使用这个词，因为它带有侮辱性并强化污名。"}]}],"synonyms":["(neutral) sex worker","(informal/derogatory) prostitute"],"phonetic":"/hɔr/","extraExplanation":["“whore”在现代英语里通常被视为侮辱性词汇，容易造成伤害；更中性、更尊重的说法常用“sex worker（性工作者）”。","如果你本来想查的是别的词：可能是“hoar（灰白的/霜的）”“hoe（锄头/用锄头耕作）”，或其他语言里的词（如德语 Hörer=听众/听者）。你可以告诉我你想表达的句子，我来帮你确认正确拼写和意思。"]}
{"word":"hoernesite","summary":{"en":"Hoernesite is a rare magnesium arsenate mineral, typically found as a secondary mineral in arsenic-rich deposits.","zh":"Hoernesite 是一种罕见的镁砷酸盐矿物，通常作为富砷矿床中的次生矿物出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare mineral (a magnesium arsenate) that often forms as a secondary mineral in arsenic-rich ore deposits.","zh":"一种较罕见的矿物（镁砷酸盐），常作为富含砷的矿床中的次生矿物形成。"},"examples":[{"en":"Hoernesite can appear in the oxidation zone of arsenic-bearing deposits.","zh":"Hoernesite 可能出现在含砷矿床的氧化带中。"},{"en":"The geologist identified hoernesite in a sample collected from an old mine.","zh":"地质学家在一份旧矿山采集的样品中鉴定出了 hoernesite。"}]}],"phonetic":"/ˈhɝːrnəˌsaɪt/","extraExplanation":["该词属于矿物学专有名词，日常英语中很少见，主要出现在地质报告、矿物鉴定、博物馆标本说明等语境。","在阅读矿物相关英文资料时，你可能会看到它与砷酸盐矿物（arsenates）、次生矿物（secondary minerals）、氧化带（oxidation zone）等一起出现；这些词常用于描述矿床风化、氧化后生成的新矿物。","拼写提示：hoernesite 中的 “oe” 有时在不同资料里会出现不同转写习惯，但英语文献中常见拼写为 hoernesite。"]}
{"word":"hoers","summary":{"en":"“Hoers” is not standard English; it’s usually a misspelling of “whores,” a strong offensive term (plural) that should be used with great caution.","zh":"“hoers”不是标准英语，通常是“whores”的拼写错误；这是一个很冒犯的词（复数），使用需非常谨慎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of “whores,” the plural of “whore” (a strong, offensive word for a prostitute, or used as an insult).","zh":"（非标准拼写）通常是“whores”的拼写错误，为“whore”的复数（对“妓女”的粗俗/冒犯性称呼，也常被当作侮辱用语）。"},"examples":[{"en":"“Hoers” is not standard English; people usually mean “whores.”","zh":"“hoers”不是标准英语；人们通常是想写“whores”。"},{"en":"Please avoid using that word as an insult—it is hurtful and disrespectful.","zh":"请避免把这个词当作辱骂使用——它很伤人，也不尊重人。"}]},{"partOfSpeech":"n.","definition":{"en":"(As an insult) A crude, derogatory term aimed at someone, suggesting they are sexually immoral (often sexist).","zh":"（辱骂用法）粗俗、贬损性的称呼，用来暗示某人“不检点/放荡”（常带性别歧视）。"},"examples":[{"en":"Some people use the word to shame women, which is sexist.","zh":"有些人用这个词羞辱女性，这带有性别歧视。"},{"en":"In respectful writing, use neutral terms like “sex worker” or “prostitute” (depending on context).","zh":"在正式或尊重的表达中，可根据语境用更中性的“sex worker（性工作者）”或“prostitute（妓女/娼妓）”。"}]}],"synonyms":["prostitutes","sex workers","call girls","escorts"],"phonetic":"/hɔr/","extraExplanation":["“whore”属于强烈冒犯词汇。在历史与文学中它常被用作道德审判或羞辱的标签，而现代英语里更提倡使用中性说法（如“sex worker”）来减少污名化。","如果你其实想表达的是“hoes”（锄头/用锄头除草）或其他词，请告诉我上下文句子，我可以帮你确认正确拼写与含义。"]}
{"word":"hoes","summary":{"en":"“Hoes” is the plural of “hoe” (a tool for digging/weeding). It can also be an offensive slang insult for women, so use with caution.","zh":"“hoes”是“hoe（锄头）”的复数，也可作动词表示“锄地”。另外它还有常具侮辱性的俚语用法，用来贬称女性，需谨慎避免。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hoe”: a gardening or farming tool with a long handle and a flat blade, used for digging, loosening soil, or removing weeds.","zh":"“hoe”的复数：锄头（一种园艺/农具），有长柄和扁平刀片，用来翻土、松土或除草。"},"examples":[{"en":"The farmer leaned the hoes against the barn wall after work.","zh":"干完活后，农夫把锄头靠在谷仓墙边。"},{"en":"We used hoes to clear weeds from the vegetable garden.","zh":"我们用锄头把菜园里的杂草清掉。"}]},{"partOfSpeech":"v.","definition":{"en":"To work the ground with a hoe; to dig or weed using a hoe.","zh":"用锄头翻土/除草；锄地。"},"examples":[{"en":"She hoed the rows early in the morning.","zh":"她一大早就把一垄垄地锄了一遍。"},{"en":"He spent the afternoon hoeing weeds out of the yard.","zh":"他花了一下午用锄头把院子里的杂草除掉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, often offensive) A derogatory word for women, implying they are sexually promiscuous; also used as an insult meaning “low-class” or “immoral.”","zh":"（俚语，常具侮辱性）对女性的贬称，暗示“性关系随便”；也可作辱骂，带有“下贱/不道德”的意味。"},"examples":[{"en":"That word is disrespectful—please don’t call women “hoes.”","zh":"那个词很不尊重人——请不要用“hoes”来称呼女性。"},{"en":"In the song, the rapper uses “hoes” as an insult.","zh":"在那首歌里，歌手把“hoes”当作辱骂用语。"}]}],"synonyms":["garden hoes","weeding hoes","hoeing","(slang) prostitutes","(slang) promiscuous women"],"phonetic":"/hoʊz/","extraExplanation":["“hoe”本义是农具“锄头”。俚语“hoe(s)”常被认为来自对“whore（妓女）”的缩略/变体，在部分流行文化（如嘻哈歌词、网络用语）中出现，但通常带有贬低与物化女性的意味，很多场合会被视为冒犯。更中性/礼貌的表达应根据语境选择（如“women / girls / people”），避免用作人身称呼。"]}
{"word":"hoeshin","summary":{"en":"“Hoeshin” is usually a romanized name or a less common spelling of “hoshin” (a strategic policy/direction in management).","zh":"“Hoeshin”通常是姓名的罗马字拼写，或是“hoshin”的较少见拼法（管理语境中指战略方针/方向）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a romanized (Latin-letter) spelling of an East Asian name (e.g., Korean) or a variant spelling of “hoshin.”","zh":"不是标准英语词；最常见于东亚姓名（如韩语姓名）的罗马字拼写，或是“hoshin”的变体拼写。"},"examples":[{"en":"Hoeshin Kim is listed as a contributor on the report.","zh":"报告中列出了 Hoeshin Kim 作为撰稿人。"},{"en":"I’m not sure how to pronounce “Hoeshin”—could you say it for me?","zh":"我不确定“Hoeshin”怎么读——你能念一下给我听吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(Variant of “hoshin,” in business contexts) A guiding direction or strategic policy, as in the Japanese management term “hoshin kanri” (policy deployment).","zh":"（“hoshin”的变体拼写，商业语境）指引方向或战略方针，如日式管理术语“hoshin kanri”（方针管理/方针展开）。"},"examples":[{"en":"Our leadership defined a clear hoshin for the year and aligned projects to it.","zh":"领导层为今年制定了明确的方针（hoshin），并让各项目与之对齐。"},{"en":"Some sources spell it as “hoeshin,” but “hoshin” is more common in English writing.","zh":"有些资料会拼作“hoeshin”，但英文中更常见的是“hoshin”。"}]}],"synonyms":["hoshin","policy","strategic direction"],"phonetic":"ˈhoʊʃɪn","extraExplanation":["“hoeshin”很可能是人名的拼写（不同地区/系统的罗马字转写会造成多种拼法），也可能是把日语术语“hoshin”写成了不同拼写。","如果你是在特定文章、游戏、漫画、公司文件或姓名名单里看到它，给我上下文（句子或来源语言），我可以更准确判断含义与更自然的英文写法。"]}
{"word":"hoey","summary":{"en":"“Hoey” is most commonly a surname in English.","zh":"“Hoey”在英语中最常见的用法是姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（常见作人名/家族名）。"},"examples":[{"en":"Senator Joe Hoey spoke at the event.","zh":"参议员乔·霍伊在活动上发言。"},{"en":"My teacher’s last name is Hoey.","zh":"我老师的姓是 Hoey。"}]}],"phonetic":"/ˈhoʊi/","extraExplanation":["“Hoey/hoey”在现代英语里主要作为姓氏使用，并不是常见的普通词汇。","如果你是在聊天、歌词或游戏里看到的“hoey”，它也可能是拼写误差（例如想写“honey”“hoy”“hoe”或某个昵称/ID）。如果你把原句发我，我可以根据上下文判断具体意思。"]}

