{"word":"HoF","summary":{"en":"an honorary list or institution recognizing top achievers","zh":"表彰某领域杰出人物的荣誉名单或机构"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Hall of Fame; an honorary list or institution that recognizes the best or most important people in a field (often sports, music, games, or business).","zh":"名人堂；用来表彰某个领域（常见于体育、音乐、游戏、商业等）最杰出人物的荣誉名单或机构。"},"examples":[{"en":"She was inducted into the HoF for her contributions to science.","zh":"她因对科学的贡献入选名人堂。"},{"en":"This player is a future HoF candidate.","zh":"这位球员是未来的名人堂候选人。"},{"en":"The game has a HoF section showing top-ranked players.","zh":"这个游戏有名人堂版块，展示排名最高的玩家。"}]}],"synonyms":["Hall of Fame","pantheon","honor roll"],"phonetic":"/eɪtʃ oʊ ˈɛf/","extraExplanation":["常见写法：HoF（大小写如图）或 HOF（全大写）。正式写作里通常第一次会写全称 Hall of Fame，后文再用 HoF。","不同领域的 HoF 可能指不同机构（例如 Rock and Roll Hall of Fame、Basketball Hall of Fame），也可能只是网站/游戏里的“荣誉榜/榜单”。阅读时结合上下文判断。"],"etymology":"这是英语短语“Hall of Fame”的首字母缩写（initialism）。常见于体育新闻、颁奖语境、游戏排行榜等，为了简洁会写作 HoF。","mnemonic":["把 HoF 记成“Hall（大厅）of Fame（名声）”：有名的人进大厅展示。","联想中文“名人堂”：名人=Fame，大堂=Hall。"]}
{"word":"hof","summary":{"en":"HOF most commonly means “Hall of Fame,” especially in sports; less commonly it refers to German “Hof” meaning a court/household or farmstead in names.","zh":"HOF最常指（体育等语境的）“Hall of Fame 名人堂”；较少情况下指德语Hof，在名称/语境中意为宫廷/府邸或农庄/庭院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Hall of Fame; used especially in sports to refer to the most honored players or to someone who is worthy of that honor.","zh":"（缩写）名人堂；常见于体育语境，指最高荣誉的名人堂或“有资格进名人堂的人”。"},"examples":[{"en":"She’s a first-ballot HOF pitcher.","zh":"她是那种第一轮就能入选名人堂的投手。"},{"en":"That game-winning shot was pure HOF stuff.","zh":"那个绝杀球简直就是名人堂级别的表现。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common in English) A German word used in names/contexts meaning “court,” “royal household,” or “farm/courtyard,” seen in some place names and surnames.","zh":"（英语中较少见）德语词，常出现在人名/地名语境里，意为“宫廷/王室府邸”或“农庄/庭院”。"},"examples":[{"en":"The museum label mentioned the imperial Hof in Vienna.","zh":"博物馆说明牌提到了维也纳的帝国宫廷（Hof）。"},{"en":"Some German place names end with “-hof,” referring to a farmstead.","zh":"一些德语地名以“-hof”结尾，指的是农庄/农场聚落。"}]}],"synonyms":["Hall of Fame","HoF"],"phonetic":"/eɪtʃ oʊ ˈɛf/","extraExplanation":["在英语网络与体育媒体里，HOF最常见的写法是大写，表示Hall of Fame（名人堂）。也常见写成HoF。","说某人是“first-ballot HOF”意思是“第一轮投票就能入选名人堂”，带有很强的称赞语气。"]}
{"word":"Hoffmann-esque","summary":{"en":"resembling Hoffmann’s eerie, fantastical style","zh":"帶有霍夫曼式的詭異奇幻風格"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a style, mood, or subject matter reminiscent of E. T. A. Hoffmann’s stories—often eerie, fantastical, dreamlike, and slightly unsettling.","zh":"具有（德國作家）E.T.A.霍夫曼作品風格的——常指詭異、奇幻、夢境感強，並帶點不安或陰森氣氛。"},"examples":[{"en":"The film’s Hoffmann-esque atmosphere mixes whimsy with a quiet sense of dread.","zh":"這部電影的霍夫曼式氛圍把奇趣和隱約的恐懼感混在一起。"},{"en":"She wrote a Hoffmann-esque tale about a clockmaker whose dolls seem to breathe at night.","zh":"她寫了一個霍夫曼式故事：一位鐘錶匠的娃娃夜裡彷彿會呼吸。"},{"en":"The gallery’s lighting turned ordinary objects into something Hoffmann-esque and uncanny.","zh":"畫廊的燈光把尋常物件變得霍夫曼式、帶有詭異的陌生感。"}]}],"synonyms":["gothic","macabre","fantastical","surreal","dreamlike","uncanny","Kafkaesque"],"phonetic":"/ˌhɔf.mənˈɛsk/","extraExplanation":["E. T. A. Hoffmann 以黑色幻想、心理迷離、怪誕幽默著稱；其作品常出現「真假難辨」「日常忽然變詭異」的感覺。英語裡用 Hoffmann-esque 來快速指向這種氣質。","文化連結：柴可夫斯基芭蕾《胡桃鉗》的故事源頭可追溯到霍夫曼的《胡桃鉗與老鼠王》，所以談到帶點陰影的童話感時，也可能用到這個形容詞。"],"etymology":"由專名 Hoffmann（指德國浪漫派作家 E. T. A. Hoffmann, 1776–1822）+ 後綴 -esque（表示「……風格的／像……的」）構成；常用來形容帶有浪漫派奇幻、怪誕與陰森色彩的敘事或美學。","mnemonic":["記法：Hoffmann + -esque（像……的）。看到 -esque 就聯想到「某某風」。","聯想：霍夫曼＝「童話裡有陰影」→ 詭異、夢幻、怪誕的氛圍。"]}
{"word":"Hoffmann-like","summary":{"en":"Eerily fantastic and psychologically uncanny in a Romantic, Gothic style.","zh":"带浪漫主义/哥特气质的诡异奇幻与心理怪诞感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling the style, mood, or themes of E. T. A. Hoffmann, especially a mix of the eerie, fantastic, dreamlike, and psychologically unsettling.","zh":"（风格/氛围/主题）类似E. T. A. 霍夫曼的作品，尤指诡异与奇幻交织、梦境感强、带有心理不安与怪诞色彩。"},"examples":[{"en":"The film’s Hoffmann-like atmosphere turns ordinary streets into places of quiet dread.","zh":"这部电影的“霍夫曼式”氛围把普通街道变成了令人隐隐不安的地方。"},{"en":"Her short story is Hoffmann-like: a clockwork doll feels almost alive, and the narrator begins to doubt reality.","zh":"她的短篇很“霍夫曼式”：一个发条娃娃仿佛有了生命，叙述者也开始怀疑现实。"}]}],"synonyms":["fantastic","uncanny","surreal","gothic","macabre","Kafkaesque"],"phonetic":"/ˈhɔf.mən laɪk/","extraExplanation":["霍夫曼是德国浪漫主义时期的重要作家，擅长写“日常生活突然裂开一道缝”，让超自然、错觉、双重身份与心理崩解渗入现实。","常见关联意象：自动人偶（机械娃娃）、镜像与分身、梦与醒的边界、城市夜景中的诡秘感；有时也会联想到歌剧《霍夫曼的故事》（The Tales of Hoffmann）。"],"etymology":"来自德国作家E. T. A. 霍夫曼（E. T. A. Hoffmann）的姓氏 + “-like（像……一样）”。该形容词常用于文学、电影与艺术评论，指“霍夫曼式”的奇幻/哥特/心理怪诞气质。","mnemonic":["把它记成“霍夫曼 + like = 像霍夫曼那样”：一听到就联想到“怪诞、梦境、诡异的现实崩坏”。","联想关键词：Hoffmann → “幻”（奇幻）+“慌”（心理不安）→ 幻慌的感觉。"]}
{"word":"hoffmannist","summary":{"en":"Hoffmannist refers to a follower of E. T. A. Hoffmann or to art/writing that feels Hoffmann-like: fantastic, uncanny, and psychologically unsettling.","zh":"Hoffmannist指“霍夫曼派”的人，或指具有霍夫曼式气质的作品：幻想、诡异、带心理不安感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who admires or imitates the style, themes, or ideas of E. T. A. Hoffmann (a German Romantic writer known for dark fantasy, the uncanny, and psychological tension).","zh":"“霍夫曼派”的人：崇拜或模仿德国浪漫主义作家E.T.A.霍夫曼风格与主题的人（常见元素包括黑暗幻想、诡异感与心理张力）。"},"examples":[{"en":"The critic called the young novelist a Hoffmannist because her stories mix everyday life with eerie, dreamlike events.","zh":"评论家称那位年轻小说家为“霍夫曼派”，因为她的故事把日常生活与诡异、梦境般的事件混在一起。"},{"en":"As a Hoffmannist, he loved plots where a small detail turns ordinary reality into something unsettling.","zh":"作为“霍夫曼派”，他喜欢那种由一个小细节把普通现实扭成令人不安之物的情节。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a style or mood reminiscent of E. T. A. Hoffmann—fantastic, uncanny, grotesque, or psychologically unsettling.","zh":"具有“霍夫曼式”风格或氛围的：幻想、诡谲、怪诞或带有心理不安感的。"},"examples":[{"en":"The film’s Hoffmannist atmosphere comes from its shadowy streets and unreliable narrator.","zh":"这部电影的“霍夫曼式”氛围来自阴影重重的街道与不可靠的叙述者。"},{"en":"Her Hoffmannist sketches make dolls and mirrors feel strangely alive.","zh":"她的“霍夫曼式”速写让娃娃与镜子显得诡异地“有生命”。"}]}],"synonyms":["Hoffmann-esque","Hoffmann-like","uncanny","fantastic","surreal","gothic"],"phonetic":"/ˈhɔf.mən.ɪst/","extraExplanation":["“Hoffmannist”来自作家E.T.A.霍夫曼（E. T. A. Hoffmann, 1776–1822）。他常写“现实与幻想交界处”的故事，主题包括分身/双重人格（the double）、催眠与疯狂、自动人偶（automaton）、以及让人不确定“到底是不是真的发生”。","相关文化线索：柴可夫斯基芭蕾《胡桃夹子》与歌剧/芭蕾《柯佩莉亚》（Coppélia）都与霍夫曼式的“人偶与现实错位”气质有关；谈到“霍夫曼式”时，常是在说一种浪漫主义的诡异幻想审美。","用法提示：这个词较少见，多出现在文学/艺术评论中；日常英语里更常用 uncanny（诡异的）、surreal（超现实的）、gothic（哥特式的）来表达相近感觉。"]}
{"word":"hoffmannite","summary":{"en":"Hoffmannite is the name of a rare mineral.","zh":"Hoffmannite 指一种稀有矿物的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral species (a naturally occurring solid with a specific chemical composition and crystal structure) called “hoffmannite.”","zh":"一种名为“霍夫曼石（hoffmannite）”的稀有矿物（具有一定化学成分和晶体结构的天然固体）。"},"examples":[{"en":"Hoffmannite is rarely seen outside mineral collections and specialized geology reports.","zh":"霍夫曼石很少在矿物收藏以外出现，多见于专业地质报告中。"},{"en":"The label lists the specimen as hoffmannite, but it may require lab testing to confirm.","zh":"标签上写的是霍夫曼石，但可能需要实验室检测才能确认。"}]}],"phonetic":"ˈhɔf.mə.naɪt","extraExplanation":["“-ite”是矿物名称里非常常见的后缀（如 calcite 方解石、hematite 赤铁矿），常用来表示“某某矿物”。","这类矿物名通常源自人名或地名；“hoffmannite”多半是以 Hoffmann（霍夫曼）相关的人名来命名。若你需要它的具体化学式与产地信息，通常要参考矿物学数据库或权威矿物名录。"]}
{"word":"hofian","summary":{"en":"“Hofian” is a rare word meaning “court-related/courtly,” or (as a noun) “a courtier.”","zh":"“Hofian”很少见，通常指“与宫廷/庄园有关、宫廷式的”，也可指“宫廷侍从”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to a German “Hof” (a royal court or a noble estate); courtly.","zh":"（罕用）与德语“Hof”（王室宫廷/贵族庄园）有关的；宫廷的。"},"examples":[{"en":"The novel’s Hofian etiquette rules felt strict and old-fashioned.","zh":"小说里那套“宫廷式”的礼仪规则显得严格又老派。"},{"en":"He used Hofian language to flatter the duke.","zh":"他用一种带宫廷味的措辞来奉承公爵。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person connected with a court/estate; a courtier.","zh":"（罕用）与宫廷/庄园有关的人；宫廷侍从（类似 courtier）。"},"examples":[{"en":"The king was surrounded by Hofians and advisors.","zh":"国王身边围着宫廷侍从和顾问。"}]}],"synonyms":["courtly","court","courtier","aristocratic"],"phonetic":"/ˈhoʊfiən/","extraExplanation":["“Hofian”在现代英语中并不是常见词，更多像是由“hof（宫廷/庄园）”衍生出来的形容词/名词，用于特定写作风格、历史语境或个人造词。日常表达更常用 courtly（宫廷的）、courtier（宫廷侍从）。","也可能有人把它当作与专有名词有关的词（例如姓氏 Hof- / 地名 Hof），或与拼写相近的“hoffian”混淆；如果你是在某篇文章/书里看到的，给我原句我可以帮你判断具体含义。"]}

