{"word":"hog","summary":{"en":"“Hog” most commonly means a pig, and informally it can mean a greedy person or the act of taking more than your share.","zh":"“hog”最常指猪；非正式用法里也可指贪心的人，或表示“独占、占用过多”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pig, especially a large one; often used for a farm animal raised for meat","zh":"猪（尤指体型较大的猪；常指饲养用作肉食的猪）"},"examples":[{"en":"They keep hogs on the farm.","zh":"他们在农场里养猪。"},{"en":"The hogs were sleeping in the mud to stay cool.","zh":"猪躺在泥里睡觉以保持凉爽。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who takes more than their fair share or refuses to share (informal, sometimes rude)","zh":"贪心的人；独占者（非正式用法，有时带冒犯）"},"examples":[{"en":"Don’t be a hog—leave some pizza for everyone.","zh":"别那么贪心——给大家留点披萨。"},{"en":"He’s such a screen hog in group projects.","zh":"在小组作业里他总是爱出风头、抢镜。"}]},{"partOfSpeech":"v.","definition":{"en":"to take or use more than you need; to keep something for yourself and not share","zh":"占用过多；独占（不分享）"},"examples":[{"en":"Stop hogging the bathroom—we’re all waiting.","zh":"别一直占着洗手间——我们都在等。"},{"en":"She hogged the conversation all night.","zh":"她整晚都在霸占话题。"}]},{"partOfSpeech":"vi.","definition":{"en":"to bend forward with your head and shoulders down (less common)","zh":"弯腰低头（较少见）"},"examples":[{"en":"He hogged over the desk to read the tiny print.","zh":"他弯腰凑近桌面去读那些小字。"}]}],"synonyms":["pig","swine","greedy person","glutton","monopolize","hog"],"phonetic":"/hɔɡ/","extraExplanation":["“hog”作“贪心的人/独占者”时语气可能不礼貌，和朋友开玩笑可以，但在正式场合或对陌生人使用要谨慎。","常见搭配：hog the spotlight（抢风头/抢镜）、hog the bed（独占床位）、hog the road（开车时占道）。"]}
{"word":"hog-like","summary":{"en":"having pig-like characteristics","zh":"具有猪的特征"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hog (pig), especially in appearance, behavior, or smell.","zh":"像猪的；具有（野）猪特征的（尤指外貌、行为或气味）。"},"examples":[{"en":"The animal had a hog-like snout and short legs.","zh":"那只动物有像猪一样的口鼻部和短腿。"},{"en":"He made a hog-like grunt when he laughed.","zh":"他笑的时候发出像猪哼一样的声音。"}]}],"synonyms":["porcine","piglike","swine-like","boarish"],"phonetic":"/ˈhɔɡˌlaɪk/","extraExplanation":["“hog-like”多用于描述外形或声音，有时也带贬义色彩，用来形容人“粗鲁、邋遢或贪吃”。写作时注意语气与场合。","类似构词：childlike（孩子般的）、lifelike（逼真的）、snake-like（蛇一般的）。"],"etymology":"由 hog（猪、野猪）+ -like（像……一样的）构成的复合形容词，表示“具有某种事物特征”。","mnemonic":["记：hog=“猪/野猪”，-like=“像……一样的”，合起来就是“像猪一样的”。","联想中文：hog≈“哼(猪哼声)”的感觉；hog-like=“哼哼的、猪里猪气的”。"]}
{"word":"hog-peanut","summary":{"en":"a North American wild legume with underground peanut-like seeds","zh":"北美一种野生豆科植物，地下种子像小花生"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North American wild legume plant with small pea-like flowers and two kinds of pods (some above ground and some formed underground); its underground seeds were once eaten by people and wildlife","zh":"北美一种野生豆科植物（有地上与地下两种结荚方式）；其地下种子过去曾被人类与野生动物食用"},"examples":[{"en":"We found hog-peanut twining along the edge of the forest trail.","zh":"我们在林间小道边看到hog-peanut沿着植物缠绕生长。"},{"en":"The guide explained that hog-peanut can produce pods both above and below the soil.","zh":"向导解释说hog-peanut会在地上和土里都结荚。"},{"en":"Some foragers mention hog-peanut as a traditional wild food, but correct identification is important.","zh":"一些采集者提到hog-peanut是传统野食之一，但准确辨认很重要。"}]}],"synonyms":["wild peanut","Amphicarpaea bracteata"],"phonetic":"/ˈhɑɡ ˌpiːnʌt/","extraExplanation":["学名常见为 Amphicarpaea bracteata，中文有时译作“猪花生/野花生”（各地用名不一）。","它属于豆科藤本，常见于北美林缘、灌丛与湿润地带；“地上结荚+地下结荚”的特性在植物学上很有特色。"],"etymology":"词源为英语复合词 hog + peanut。因其地下种子形似小花生，且常被野猪等动物拱食而得名；并非真正的“花生”（peanut）。","mnemonic":["记成“hog（猪）+ peanut（花生）”：像“猪在地里拱出来吃的小花生”。","把 hog 当作“拱土找吃的动物”，联想到它的“地下结荚/地下种子”。"]}
{"word":"hoga","summary":{"en":"“Hoga” is a Hinglish (Hindi/Urdu) word meaning “will be” or, informally, “probably/maybe.”","zh":"“hoga”是印地语/乌尔都语在Hinglish里的常见用法，意思多为“会是/将会”，口语中也可表示“大概/可能”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Hinglish/Urdu/Hindi loanword) “will be; would be” — used to say something is expected to happen or be true in the future.","zh":"（印地语/乌尔都语常见音译词）“会是；将会”——用来表示某事在将来预计会发生或为真。"},"examples":[{"en":"Don’t worry—everything hoga fine.","zh":"别担心——一切都会好的。"},{"en":"Tomorrow hoga a busy day for us.","zh":"明天对我们来说会是忙碌的一天。"}]},{"partOfSpeech":"other","definition":{"en":"“probably; maybe” — used informally to show uncertainty or a guess (common in casual South Asian English/Hinglish).","zh":"“大概；可能”——口语里表示不确定或猜测（南亚英语/印式英语里很常见）。"},"examples":[{"en":"He’ll come late, hoga.","zh":"他可能会迟到吧。"},{"en":"Hoga it’s too expensive, so let’s skip it.","zh":"可能太贵了，我们就算了吧。"}]}],"synonyms":["will be","probably","maybe"],"phonetic":"/ˈhoʊɡə/","extraExplanation":["“hoga”来自印地语/乌尔都语动词“to be（是）”的将来式（第三人称单数），字面意思接近英文的“will be”。在日常对话、宝莱坞台词或网络聊天中，常被夹在英文句子里，形成Hinglish（印式混合英语）。","在标准英语写作中一般不用“hoga”。如果你想用更标准的表达，可以换成“will be / probably / maybe”。"]}
{"word":"hogan","summary":{"en":"A hogan is a traditional Navajo (Diné) home; “Hogan” can also be a surname.","zh":"hogan 指纳瓦霍（Diné）人的传统住房；Hogan 也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional home of the Navajo (Diné) people, usually dome-shaped or cone-shaped, made from wood and packed earth; it can be used as a family dwelling and for ceremonies.","zh":"（北美）纳瓦霍（Diné）人的传统住房，常呈圆顶或圆锥形，多用木材与泥土建成；可作为居所，也可用于仪式。"},"examples":[{"en":"The family gathered in the hogan for a blessing ceremony.","zh":"家人们聚集在霍根屋里参加祝福仪式。"},{"en":"We learned how a hogan is built from logs and earth to stay warm in winter.","zh":"我们了解了霍根屋如何用木材和泥土建成，以便在冬天保暖。"}]},{"partOfSpeech":"other","definition":{"en":"a surname or name (often seen in famous names, e.g., Ben Hogan in golf, Hulk Hogan in entertainment).","zh":"姓氏或人名（常见于名人姓名中，如高尔夫球的 Ben Hogan、娱乐界的 Hulk Hogan）。"},"examples":[{"en":"Ben Hogan is remembered as one of golf’s great players.","zh":"Ben Hogan 被认为是高尔夫历史上的伟大球员之一。"}]}],"synonyms":["Navajo dwelling","traditional Navajo house","hut (general)"],"phonetic":"ˈhoʊɡən","extraExplanation":["“hogan”一词来自纳瓦霍语，指其传统居所。传统观念里，门口常朝向东方，用来迎接清晨的阳光；有些 hogan 也具有重要的仪式与精神意义。使用时如果指建筑本身，通常写作普通名词 hogan；若指人名/姓氏，则首字母大写 Hogan。"]}
{"word":"hogans","summary":{"en":"“Hogans” is the plural of “hogan,” a traditional Navajo (Diné) dwelling.","zh":"“hogans” 是 “hogan” 的复数，指纳瓦霍（Diné）传统居所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hogan: a traditional Navajo (Diné) dwelling, usually made of wood and earth, often with the doorway facing east.","zh":"hogan 的复数：纳瓦霍（Diné）传统居所，通常用木材与泥土建成，门口常朝东。"},"examples":[{"en":"The guide explained that the family’s hogans were built a short walk from the main road.","zh":"导游解释说，这家人的几座 hogan（传统居所）建在离主路不远的地方。"},{"en":"In the museum exhibit, you can see models of different hogans used across the Navajo Nation.","zh":"在博物馆展览中，你可以看到纳瓦霍族地区使用的不同 hogan 模型。"}]}],"synonyms":["traditional Navajo dwelling","Navajo house","hut"],"phonetic":"/ˈhoʊɡən/","extraExplanation":["“Hogan”来自纳瓦霍语，指重要的传统居住与仪式空间。不同地区与用途会有不同形制（如圆顶式、六/八边形等）。在谈论 hogan 时，很多人会强调尊重其文化与宗教意义；如果参观或进入真实的 hogan，最好遵循当地社区的规则与礼仪。"]}
{"word":"hogarthian","summary":{"en":"Hogarthian describes something in the satirical, detail-rich style of William Hogarth.","zh":"Hogarthian 指带有威廉·霍加斯式讽刺、细节密集、具有社会批判与道德意味的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the English artist William Hogarth (1697–1764) or to his style, especially satirical, moralizing scenes of everyday life.","zh":"（形容词）与英国艺术家威廉·霍加斯（William Hogarth）有关的；或指其艺术风格的，尤指以讽刺、道德劝诫为特色的日常生活场景描绘。"},"examples":[{"en":"The novel opens with a Hogarthian picture of city life—funny, crowded, and a little cruel.","zh":"这部小说以一种“霍加斯式”的城市生活图景开场——滑稽、拥挤，却也带着一点残酷。"},{"en":"Her drawings have a Hogarthian bite, exposing hypocrisy in polite society.","zh":"她的画有一种“霍加斯式”的尖刻，揭露了上流社会的虚伪。"}]}],"synonyms":["satirical","caricatural","socially critical","moralizing"],"phonetic":"/hoʊˈɡɑːrθiən/","extraExplanation":["“Hogarthian”常用于文学批评与艺术评论，强调一种“讽刺+社会观察+道德寓意”的风格，画面（或叙述）往往细节密集、人物众多，带有对社会风气的批判。","威廉·霍加斯以连环叙事版画/绘画著称（例如《浪子生涯 A Rake’s Progress》《妓女生涯 A Harlot’s Progress》），这些作品像“视觉小说”一样讲故事，因此当文字作品被称为Hogarthian时，常暗示其具有强烈的场景感与叙事性。"]}
{"word":"hogback","summary":{"en":"A hogback is usually a narrow, steep-sided ridge—especially a geological ridge shaped like a hog’s back.","zh":"hogback 通常指狭长、两侧陡的山脊（地质用语尤常见），因形状像猪背而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, narrow ridge with a sharp crest and steep sides, often formed by tilted layers of hard rock (common in geology).","zh":"（地质）猪背岭；狭长的山脊，顶部尖锐、两侧陡峭，常由倾斜的坚硬岩层形成。"},"examples":[{"en":"We followed the trail along a hogback ridge with steep slopes on both sides.","zh":"我们沿着一条猪背岭的山脊走，左右两侧都很陡。"},{"en":"The map shows a hogback created by tilted sandstone layers.","zh":"地图上标出了由倾斜砂岩层形成的猪背岭。"}]},{"partOfSpeech":"n.","definition":{"en":"a rounded ridge on an animal’s back (especially a pig), or something shaped like it.","zh":"（动物，尤指猪的）拱起的背脊；（引申）形状像猪背的隆起物。"},"examples":[{"en":"The wild hog lifted its hogback as it bristled.","zh":"那头野猪竖起毛，背脊拱了起来。"},{"en":"The old bridge had a hogback shape, rising in the middle.","zh":"那座老桥呈“猪背”形，中间拱起。"}]}],"synonyms":["ridge","arête (similar, but not identical)","escarpment (related, not identical)"],"phonetic":"/ˈhɔɡˌbæk/","extraExplanation":["“hogback”这个词很形象：hog（猪）+ back（背）。在地质学里，它常用来形容像“猪背”一样又长又窄、顶部尖、两侧陡的山脊；在英语地名和徒步语境中也很常见（例如山脊线路、地形描述）。"]}
{"word":"hogbacks","summary":{"en":"Hogbacks are usually early medieval, hog-back-shaped stone grave markers; less commonly, the word means a rounded ridge or hill.","zh":"hogbacks通常指早期中世纪“猪背形”的石质墓碑；较少情况下也可指顶部圆拱的狭长山脊或丘陵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of early medieval stone grave marker (common in northern England and southern Scotland), shaped like a long, rounded roof or a hog’s back; usually decorated with carvings.","zh":"一种早期中世纪的石质墓碑（常见于英格兰北部和苏格兰南部），外形像长而拱起的屋顶或“猪背”，常带有雕刻装饰。"},"examples":[{"en":"The museum has two hogbacks from the 10th century on display.","zh":"博物馆展出了两块10世纪的猪背形墓碑（hogbacks）。"},{"en":"Archaeologists think these hogbacks marked important graves in an Anglo-Scandinavian community.","zh":"考古学家认为，这些猪背形墓碑用于标记英格兰—斯堪的纳维亚社群中重要人物的墓葬。"}]},{"partOfSpeech":"n.","definition":{"en":"A long, narrow ridge or hill with a rounded top (a less common meaning, often seen in place names or geography).","zh":"顶部圆拱的狭长山脊或丘陵（较不常见，多见于地名或地形描述）。"},"examples":[{"en":"The trail follows a hogback above the river valley.","zh":"这条步道沿着河谷上方的一条圆拱形山脊前行。"}]}],"synonyms":["hogback stones","grave markers","recumbent tombstones","ridge","hogback ridge"],"phonetic":"/ˈhɑɡˌbæk/","extraExplanation":["“hogback(s)”在英国历史与考古语境里最常指“猪背形墓碑”。这类石碑多见于10–12世纪的英格兰北部，和维京时代后的英格兰—斯堪的纳维亚（Anglo-Scandinavian）文化有关；其拱形外观常被解释为“房屋/屋顶”的象征，可能暗示为亡者提供“居所”。","拼写上常见复数hogbacks，因为讨论时往往指一组或一种类型；单数是hogback。"]}
{"word":"hogbush","summary":{"en":"Hogbush is an uncommon, regional word for a shrub; the exact plant depends on the area.","zh":"Hogbush 是不常见的地区性词汇，泛指某种灌木，具体指哪种植物取决于当地用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub or bush (regional/common-name use); the exact plant can vary by place, and the word is not standardized in modern English.","zh":"（地区性俗名）指一种灌木/矮树丛；具体是哪一种植物因地区而异，在现代英语中并非标准名称。"},"examples":[{"en":"In some rural areas, people use local names like “hogbush” for shrubs that grow along fences.","zh":"在一些乡村地区，人们会用像“hogbush”这样的地方叫法来指篱笆旁生长的灌木。"},{"en":"The field guide didn’t list “hogbush,” so we searched by its scientific name instead.","zh":"野外图鉴里没有“hogbush”这个词，所以我们改用学名来查。"}]}],"synonyms":["shrub","bush","(regional) local plant name"],"phonetic":"/ˈhɔɡˌbʊʃ/","extraExplanation":["“hogbush”在通用词典中不常见，多为方言/地方俗称。不同地区可能把不同的灌木都叫成这个名字，因此在阅读或查资料时，最好结合地点、图片或直接找植物的学名。","它也可能是“hopbush”的拼写/听写混淆（两者外形和发音相近），遇到该词时可留意上下文是否在谈某种特定灌木。"]}
{"word":"hogchoker","summary":{"en":"Hogchoker most often means a small flatfish from U.S. estuaries; informally it can also mean an extremely shallow creek.","zh":"hogchoker最常指美国河口地区的一种小型比目鱼；口语里也可指“浅得夸张”的小溪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small flatfish found in coastal waters and river mouths (estuaries), especially in the southeastern United States; also called the “hogchoker sole.”","zh":"一种生活在近海与河口（咸淡水交汇处）的小型比目鱼，常见于美国东南部，也叫“hogchoker sole（猪呛比目鱼/猪呛鲽）”。"},"examples":[{"en":"We caught a hogchoker in the marsh near the river mouth.","zh":"我们在河口附近的盐沼里抓到了一条hogchoker。"},{"en":"Hogchokers are flat and blend in with sandy bottoms.","zh":"Hogchoker身体扁平，能和沙质水底融为一体。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, regional) A very shallow stream or creek—shallow enough that a hog (pig) could choke while trying to drink from it.","zh":"（非正式，地区用语）指非常浅的小河/小溪——浅到猪去喝水都可能被呛住。"},"examples":[{"en":"After the drought, the creek turned into a hogchoker.","zh":"干旱之后，那条小溪变得浅得可怜，简直成了hogchoker。"},{"en":"This isn’t a river—just a hogchoker you can step across.","zh":"这可不算河，就是条浅浅的hogchoker，一步就能跨过去。"}]}],"synonyms":["hogchoker sole","sole (informal)","flatfish","shallow creek (regional meaning)"],"phonetic":"/ˈhɔɡˌtʃoʊkɚ/","extraExplanation":["这个词在美国南部沿海与河口地区更常见，既可以指一种小比目鱼，也可作为夸张的口语比喻来形容“浅得离谱”的小溪。","作为鱼名时，hogchoker常见于钓鱼、自然观察、河口生态等语境；作为比喻义时，多出现在口语叙述和地方性写法里。"]}
{"word":"hogcote","summary":{"en":"“Hogcote” means a pen or small shelter for pigs (a pigsty).","zh":"“hogcote”指猪的圈舍/猪圈（相当于 pigsty、hog pen）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shelter or pen for hogs; a pigsty.","zh":"（猪的）小圈舍；猪圈。"},"examples":[{"en":"The old hogcote behind the barn needed a good cleaning.","zh":"谷仓后面那间旧猪圈需要好好清理一下。"},{"en":"In the story, the farm’s hogcote shows how hard rural life used to be.","zh":"在故事里，农场的猪圈展现了过去乡村生活的艰辛。"}]}],"synonyms":["pigsty","hog pen","pigpen","sty"],"phonetic":"/ˈhɔɡˌkoʊt/","extraExplanation":["“hogcote”由 hog（猪）+ cote（小屋、棚舍）构成。cote 常见于 dove-cote（鸽舍）等词中。这个词较为旧式/文学化，日常英语更常说 pigsty 或 hog pen。"]}
{"word":"hoge","summary":{"en":"“Hoge” is a nonstandard placeholder word, especially common in Japanese programming examples, similar to “foo/bar.”","zh":"“hoge”是非标准的占位词，尤其常见于日本的编程示例里，相当于英文的“foo/bar”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly in Japanese tech culture) a placeholder word used in examples, similar to English “foo” or “bar.”","zh":"（主要见于日本技术圈）示例中的占位词，类似英文里的“foo / bar”（随便写的例子名）。"},"examples":[{"en":"In sample code, you might see variables like hoge, fuga, and piyo.","zh":"在示例代码里，你可能会看到像 hoge、fuga、piyo 这样的变量名。"},{"en":"Replace “hoge” with your real project name before you run the command.","zh":"运行命令前，把“hoge”替换成你真实的项目名称。"}]},{"partOfSpeech":"n.","definition":{"en":"a nonsense word with no fixed meaning; used as a dummy name in text or conversation.","zh":"没有固定意义的胡诌词；用作文字或对话中的临时称呼。"},"examples":[{"en":"I wrote “hoge” here as a temporary label and will rename it later.","zh":"我在这里先写了“hoge”当临时标签，之后再改名。"}]}],"synonyms":["foo","bar","baz","placeholder"],"phonetic":"/hoʊɡ/","extraExplanation":["“hoge”并不是标准英语词典里的常用词，更像是日本程序员文化中的占位符传统。英语里常见的对应物是“foo / bar / baz”。","在日本的示例序列里常会搭配出现：hoge / fuga / piyo（或 hogehoge）。这些词本身通常没有语义，重点是“这里放任意名字都行”。"]}
{"word":"hogen","summary":{"en":"Hogen is usually a proper noun: either the Japanese era name Hōgen (1156–1159) or a surname.","zh":"Hogen 通常是专有名词：要么指日本年号“保元”（1156–1159），要么是一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A Japanese era name (the Hōgen era, 1156–1159) in the late Heian period; often seen in the historical term “the Hōgen Rebellion.”","zh":"（专有名词）日本年号“保元”（Hōgen，1156–1159，平安时代后期），常见于历史事件“保元之乱”（Hōgen Rebellion）。"},"examples":[{"en":"The Hōgen era is remembered mainly because of the Hōgen Rebellion in 1156.","zh":"“保元”这一年号主要因1156年的“保元之乱”而为人所知。"},{"en":"In some English books, you may see it written as Hogen without the long vowel mark.","zh":"在一些英文书里，你可能会看到它写成 Hogen（不标注长音符号）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A family name (surname).","zh":"（专有名词）姓氏（人名）。"},"examples":[{"en":"Dr. Hogen will present the results tomorrow.","zh":"Hogen 医生将于明天报告结果。"}]}],"synonyms":["Hōgen (macron spelling)","Hogen era"],"phonetic":"/ˈhoʊɡən/","extraExplanation":["“Hōgen”里的“ō”表示长音。英语里有时会省略长音符号写成 Hogen，这会让发音更不稳定；学习时可以把它读作接近 /ˈhoʊɡən/。","如果你其实想查的是 “hogan”（更常见的英语词，指圆顶小屋，常与纳瓦霍人的传统住宅有关），告诉我我可以一起解释并对比。"]}
{"word":"hogfish","summary":{"en":"Hogfish is a tropical reef fish (a wrasse) with a long snout, common around Florida and the Caribbean, and often eaten as seafood.","zh":"hogfish 指一种嘴部细长的热带珊瑚礁鱼（隆头鱼科），常见于佛罗里达和加勒比海一带，也常被当作海鲜食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical reef fish (a type of wrasse) with a long snout, often found around Florida and the Caribbean; also called “hogfish” and valued as seafood","zh":"一种热带珊瑚礁鱼（隆头鱼科的一种），嘴部细长，常见于佛罗里达及加勒比海一带；也常作为食用鱼，颇受欢迎"},"examples":[{"en":"We saw a hogfish cruising over the reef, using its long snout to search for food.","zh":"我们看到一条猪鱼在珊瑚礁上方游动，用它细长的嘴寻找食物。"},{"en":"Hogfish is popular on menus in the Florida Keys.","zh":"猪鱼在佛罗里达群岛的菜单上很受欢迎。"}]}],"synonyms":["wrasse","Atlantic hogfish"],"phonetic":"/ˈhɔɡˌfɪʃ/","extraExplanation":["“hogfish”这个俗名可能来自它拱沙觅食的动作，像猪用鼻子拱地一样；也有人认为与其厚实的体型或进食方式有关。","在生物分类上，常指西大西洋的“Atlantic hogfish”（学名 Lachnolaimus maximus），属于隆头鱼科（wrasse）。不同地区有时也会把相似的鱼叫作hogfish。"]}
{"word":"hogfishes","summary":{"en":"“Hogfishes” means more than one hogfish, a reef-dwelling marine fish (a type of wrasse).","zh":"“hogfishes”指多条hogfish（猪鱼/猪嘴鱼），一种常见于珊瑚礁的海鱼（隆头鱼科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of hogfish: a kind of warm‑water marine fish (a wrasse) found especially around coral reefs; some are caught for food and sport.","zh":"hogfish（猪鱼/猪嘴鱼）的复数：一种生活在温暖海域、常见于珊瑚礁附近的海鱼（隆头鱼科的一类）；有些可供食用或垂钓。"},"examples":[{"en":"Hogfishes are often seen near reefs in the Caribbean.","zh":"在加勒比海的珊瑚礁附近经常能看到猪鱼。"},{"en":"The diver photographed several hogfishes swimming over the rocks.","zh":"潜水员拍下了几条猪鱼在岩石上方游动的画面。"},{"en":"Local restaurants sometimes serve hogfishes as a seasonal seafood dish.","zh":"当地餐馆有时会把猪鱼作为时令海鲜端上桌。"}]}],"synonyms":["hogfish","wrasse","reef fish"],"phonetic":"/ˈhɔɡˌfɪʃ/","extraExplanation":["“hogfish”之所以得名，多与它突出的嘴部形状和拱起的头部外观有关，让人联想到“猪鼻子/猪嘴”。","在日常英文里更常见的是单数 hogfish；复数可以写 hogfish（零复数）或 hogfishes。科学/科普或强调“不同种类/多条鱼”时更常写 hogfishes。"]}
{"word":"hogframe","summary":{"en":"A hog frame is a reinforcing frame/truss that helps prevent a ship or large structure from bending upward in the middle (hogging).","zh":"hog frame指用于防止船体或大型结构中部上拱（hogging）的加固骨架/桁架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strengthening frame or truss (especially on ships or large vehicles) used to prevent the body or hull from bending upward in the middle (“hogging”).","zh":"（尤指船舶或大型车辆上的）加强骨架/桁架，用来防止结构中部上拱变形（称为“hogging/拱曲”）。"},"examples":[{"en":"Engineers installed a hog frame to keep the hull from hogging in rough seas.","zh":"工程师加装了hog frame，以防船体在风浪中发生中部上拱变形。"},{"en":"The old vessel needed extra bracing, so a new hog frame was added during repairs.","zh":"这艘老船需要额外加固，所以维修时加装了新的hog frame。"}]}],"synonyms":["hogging truss","underframe truss","reinforcing frame"],"phonetic":"/ˈhɑɡˌfreɪm/","extraExplanation":["“hogging”是船舶结构里的常见术语，指船体中部向上拱起（两端相对下沉）的弯曲状态；相对的变形叫“sagging”（中部下垂）。hog frame就是用来对抗这种弯曲的加固结构。","该词较偏工程/船舶领域，不是日常口语常用词；写作中也常写作“hog-frame”或分开写“hog frame”。"]}
{"word":"hogg","summary":{"en":"“Hogg” most commonly means a young sheep in Scottish/Northern English usage; it can also be a rare spelling of “hog” or a surname.","zh":"“hogg”最常见含义是（苏格兰/英格兰北部用法）“幼羊”；也可能是“hog（猪）”的少见拼写或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, Northern England) a young sheep, usually between one and two years old; often called a “hogget.”","zh":"（苏格兰、英格兰北部）一到两岁左右的幼羊；常称为 hogget（青年羊）。"},"examples":[{"en":"The farmer sold the hoggs at the autumn market.","zh":"农夫在秋季集市上卖掉了这些幼羊。"},{"en":"In some regions, a “hogg” is a sheep that has not yet been sheared.","zh":"在一些地区，“hogg”指还没剪过羊毛的羊。"}]},{"partOfSpeech":"n.","definition":{"en":"a less common spelling of “hog” (a pig), mainly seen in names or older/variant usage.","zh":"“hog（猪）”的较少见拼写形式，多见于姓名或较旧/变体用法中。"},"examples":[{"en":"The sign read “Hogg Farm,” which is a family name, not the animal.","zh":"牌子上写着“Hogg Farm”，这是姓氏，不是指动物。"}]}],"synonyms":["hogget","lamb","hog"],"phonetic":"/hɑɡ/","extraExplanation":["“hogg”作为“幼羊”的意思属于地域用词，常见于苏格兰英语与英格兰北部的农业语境；在日常美式英语里更常用“lamb（羔羊）”或“hogget（青年羊）”。","在现代英语里，看到“Hogg”大写时，很多情况下是姓氏（如作家 James Hogg，人称“埃特里克牧羊人”）。"]}
{"word":"hoggaster","summary":{"en":"A rare dialect word meaning a yearling sheep; very rarely, a young/inexperienced person.","zh":"一个罕见方言词：指一岁左右的幼羊；极少数情况下可引申为年轻或缺乏经验的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, mainly Northern England/Scotland) A young sheep, especially one about one year old (similar to “hogget”).","zh":"（方言，主要见于英格兰北部/苏格兰）一岁左右的幼羊；相当于 hogget（未满两岁的羊）。"},"examples":[{"en":"The farmer kept the hoggasters in a separate pen through the winter.","zh":"农夫把这些一岁左右的幼羊在冬天单独圈养。"},{"en":"By spring, the hoggasters were big enough to graze on the hillside.","zh":"到了春天，这些幼羊已经长到可以在山坡上吃草了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare, figurative) A young or inexperienced person.","zh":"（很少见，引申义）年轻或缺乏经验的人。"},"examples":[{"en":"He was just a hoggaster then, new to the work and eager to learn.","zh":"那时他还是个毛头小子，刚入行，很想学习。"}]}],"synonyms":["hogget","yearling sheep","young sheep"],"phonetic":"/ˈhɑːɡæstər/","extraExplanation":["这是一个比较罕见的地区词（dialect word），常出现在英格兰北部或苏格兰相关的乡村语境里，和“养羊/牧羊”文化密切相关。","它和更常见的 hogget（指一岁到两岁之间的羊）意义接近；如果你在现代英语里需要表达，通常用 “hogget” 或直接说 “a yearling sheep”。","词形上可以理解为和 hog（古义可指小羊/羊）有关的方言变体；现代日常英语里几乎不会用到，更多见于地方记述、乡土文学或旧文本。"]}
{"word":"hogged","summary":{"en":"“Hogged” means “took more than a fair share; wouldn’t share,” often used for things like space, time, attention, or lanes on the road.","zh":"“hogged”表示“霸占、贪占（超过应得的份额）”，常用于空间、时间、注意力或道路车道等。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “hog”) to take or keep more than your fair share of something; to not share.","zh":"（hog 的过去式/过去分词）占用或霸占超过自己应得的份额；不愿分享。"},"examples":[{"en":"He hogged the remote all evening.","zh":"他整晚都霸占着遥控器。"},{"en":"Don’t hog the conversation—let others speak.","zh":"别霸占话题——让别人也说说。"},{"en":"The large box hogged all the space in the trunk.","zh":"那个大箱子把后备箱的空间都占满了。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) to drive or ride in a way that takes too much space, especially by staying in the middle or blocking others.","zh":"（非正式）在路上占道行驶/骑行，挡住别人或占太多空间。"},"examples":[{"en":"A truck was hogging the left lane, so traffic slowed down.","zh":"一辆卡车一直占着左侧车道，导致车流变慢。"},{"en":"Cyclists shouldn’t hog the whole road when cars need to pass.","zh":"汽车需要超车时，骑行者不该把整条路都占着。"}]}],"synonyms":["took over","monopolized","dominated","occupied","grabbed","kept to oneself"],"phonetic":"/hɔɡd/","extraExplanation":["“hog”原义是“猪”。英语里把“猪抢食、贪多”的形象借来比喻“霸占/贪占”。常见搭配：hog the bed（霸占床位）、hog the spotlight（抢风头）、hog the bathroom（占着卫生间不出来）。","注意拼写：hog 的过去式是 hogged（双写 g + -ed），因为词尾是“短元音 + 单辅音”的结构。"]}
{"word":"hoggee","summary":{"en":"“Hoggee” isn’t a standard English word; it’s usually a misspelling of “hoagie,” a long sub-style sandwich.","zh":"“hoggee”不是标准英语词；通常是“hoagie”的误拼，指一种长条潜艇三明治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of “hoagie,” a long sandwich made with a split roll filled with meats, cheese, and vegetables.","zh":"（非标准拼写）通常是“hoagie”的误拼：一种用长面包切开夹入肉类、奶酪和蔬菜的长条三明治。"},"examples":[{"en":"I think you mean “hoagie”—a kind of sub sandwich.","zh":"我想你是指“hoagie”——一种长条潜艇三明治。"},{"en":"In Philly, people might say, “Let’s grab a hoagie for lunch.”","zh":"在费城，人们可能会说：“我们午饭去买个hoagie吧。”"}]}],"synonyms":["hoagie","sub","submarine sandwich","hero","grinder"],"phonetic":"/ˈhoʊɡi/","extraExplanation":["“Hoagie”是美国英语里很有地域特色的词，尤其常见于宾夕法尼亚州费城（Philadelphia）一带。其他地区更常说“sub / submarine sandwich”“hero”（纽约一带）或“grinder”（新英格兰一些地方）。","词源说法不止一种，但学习上更重要的是：它指的就是“长面包夹馅的三明治”，与“sub”在日常语境里基本可互换。"]}
{"word":"hogger","summary":{"en":"“Hogger” usually means a person/thing that hogs—takes more than a fair share or occupies space; it can also be a proper name in gaming (e.g., WoW’s Hogger).","zh":"“hogger”通常指“独占/贪多”的人或物（抢占份额、占地方）；也可作游戏等语境中的专有名词（如《魔兽世界》的 Hogger）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who takes more than their fair share, or keeps something for themselves instead of sharing (from the verb “hog”).","zh":"占便宜的人；独占的人（源自动词 hog“独占、抢占”）。"},"examples":[{"en":"Don’t be a hogger—let others have a turn.","zh":"别当独占的人——让别人也有机会。"},{"en":"He’s a conversation hogger who never lets anyone else speak.","zh":"他总是霸占话题，让别人插不上话。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone or something that blocks space or limits others’ movement or access.","zh":"占地方的人/物；妨碍他人通行或使用的人/物。"},"examples":[{"en":"That truck is a lane hogger.","zh":"那辆卡车一直占着车道。"},{"en":"This bag is a seat hogger—please move it.","zh":"这个包占着座位——请挪一下。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name used in some contexts (especially gaming), referring to a specific character named “Hogger.”","zh":"专有名词（常见于游戏语境），指名为“Hogger”的特定角色。"},"examples":[{"en":"In World of Warcraft, Hogger is a famous early-game enemy.","zh":"在《魔兽世界》里，Hogger 是很有名的新手阶段敌人。"}]}],"synonyms":["hog","grabber","selfish person","attention hog","space hog"],"phonetic":"/ˈhɔɡər/","extraExplanation":["“hogger”在日常英语里不是特别常见，但构词很直观：hog（像猪一样“贪、抢”）+ -er（做某事的人/物），所以常带有轻微批评或抱怨的语气。","在口语里更常见的表达是 hog / hogging（如：Stop hogging the TV! 别霸占电视！），或更具体的说法如 attention hog（抢镜的人）、road hog（霸道占路的人）。"]}
{"word":"hoggerel","summary":{"en":"“Hoggerel” is a rare, playful form of “doggerel,” meaning badly written or simplistic rhyming verse.","zh":"“hoggerel”是少见的戏谑写法，通常指“doggerel”（拙劣、粗糙的打油诗/歪诗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) Humorous misspelling or playful variant of “doggerel”: poetry that is simple, awkward, or badly written, often with forced rhyme and rhythm.","zh":"（非标准用法）“doggerel”的戏谑拼写/变体：指写得很粗糙、拙劣、押韵和节奏牵强的打油诗/歪诗。"},"examples":[{"en":"He jokingly called his short rhymes “hoggerel,” but he meant they were just doggerel.","zh":"他开玩笑把自己的小押韵诗称作“hoggerel”，意思是那只是打油诗。"},{"en":"The review said the lyrics were more hoggerel than poetry.","zh":"评论说这些歌词更像拙劣的打油诗，而不像真正的诗。"}]}],"synonyms":["doggerel","bad verse","rhyming jingle","hack poetry"],"phonetic":"/ˈhɑɡərəl/","extraExplanation":["“hoggerel”并不是常见标准词；在词典和学术语境中通常用“doggerel”。“hoggerel”多见于玩笑、故意拼错或口语化写法，用来强调“粗糙、土味、很不讲究”的感觉。","“doggerel”常用来评价（多为贬义）一些为了押韵而牺牲用词、节奏生硬的诗句、广告打油诗或儿歌式段子。"]}
{"word":"hoggeries","summary":{"en":"“Hoggeries” means pigpens/pigsties (places where hogs are kept), and can also be used figuratively for very dirty places.","zh":"“hoggeries”指猪圈/猪舍（养猪的地方），也可比喻非常肮脏的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “hoggery”: a place where hogs (pigs) are kept; a pigpen or pigsty.","zh":"“hoggery”的复数：养猪的地方；猪圈、猪舍。"},"examples":[{"en":"The old farm had several hoggeries behind the barn.","zh":"那座老农场在谷仓后面有好几处猪圈。"},{"en":"The smell from the hoggeries drifted across the yard.","zh":"猪圈的气味飘过院子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, uncommon) Dirty, messy places compared to pigpens.","zh":"（比喻用法，不常见）像猪圈一样肮脏、乱糟糟的地方。"},"examples":[{"en":"After the party, the dorm kitchen looked like hoggeries.","zh":"聚会后，宿舍厨房看起来像个猪圈似的。"}]}],"synonyms":["pigsties","pigpens","piggeries"],"phonetic":"/ˈhɔɡəriz/","extraExplanation":["“hoggery”是比较少见的词，更常用的是“pigsty / pigpen”。","后缀“-ery”常表示“某种活动/事物的场所”（如 bakery 面包房，brewery 啤酒厂）；因此 hoggery 字面就是“养猪的地方”。"]}
{"word":"hoggers","summary":{"en":"Hoggers usually means people who hog things—taking more than their share or not sharing.","zh":"hoggers 通常指“爱独占、占便宜的人”，即占用太多、不愿分享的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who hog something (who take or use more than their fair share, or won’t share)","zh":"“霸占者；独占者”（指占用或拿走超过应得份额、不愿分享的人）"},"examples":[{"en":"Stop being hoggers and share the snacks with everyone.","zh":"别当“霸占者”了，把零食分给大家。"},{"en":"The hoggers took all the seats near the window.","zh":"那些爱独占的人把靠窗的座位全占了。"}]},{"partOfSpeech":"n.","definition":{"en":"people who keep or raise hogs (pigs) (rare; more common: hog farmers)","zh":"养猪的人（较少见；更常说 hog farmer / pig farmer）"},"examples":[{"en":"In some rural areas, hoggers sold meat at the local market.","zh":"在一些乡村地区，养猪的人会在集市上卖肉。"}]}],"synonyms":["hog","greedy people","selfish people","resource hogs"],"phonetic":"/ˈhɔɡərz/","extraExplanation":["“hogger(s)”多用于口语，通常带一点批评或抱怨的语气，来自动词“to hog”（像猪一样把东西都占着）。更常见的表达是“resource hog / attention hog / seat hog”等组合。"]}
{"word":"hoggery","summary":{"en":"Hoggery means a place where hogs are kept (a pigpen/pigsty). It’s an uncommon, somewhat old-fashioned word.","zh":"hoggery 指养猪的地方（猪圈/猪栏），属于较少见、略显旧式的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where hogs (pigs) are kept; a pigpen or pigsty","zh":"养猪的地方；猪圈；猪栏"},"examples":[{"en":"The old farm had a small hoggery behind the barn.","zh":"那座老农场的谷仓后面有个小猪圈。"},{"en":"They cleaned the hoggery every morning to keep it from smelling too bad.","zh":"他们每天早上打扫猪圈，避免气味太难闻。"}]}],"synonyms":["pigpen","pigsty","hog pen","sty"],"phonetic":"/ˈhɑɡəri/","extraExplanation":["“hoggery”是由hog（猪）+ -ery（表示“场所/行业”的后缀）构成的词。现代英语里比较少见，常见的说法更偏向pigpen、pigsty或hog pen。"]}
{"word":"hogget","summary":{"en":"A hogget is a young sheep (about 1–2 years old) or the meat from it, between lamb and mutton in age and flavor.","zh":"hogget 指约1–2岁的青年羊，也可指其羊肉；年龄与风味介于 lamb（羔羊）和 mutton（老羊）之间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young sheep, usually about 1–2 years old (past a lamb but not yet a fully mature adult sheep)","zh":"一到两岁左右的年轻羊（已不是羔羊，但还未算完全成年的羊）"},"examples":[{"en":"The farmer separated the lambs, hoggets, and ewes into different fields.","zh":"农民把羔羊、青年羊（hoggets）和母羊分到不同的牧场。"},{"en":"In some regions, hoggets are kept for another season before breeding.","zh":"在一些地区，青年羊会再养一季才用来繁殖。"}]},{"partOfSpeech":"n.","definition":{"en":"the meat from a hogget (often considered stronger in flavor than lamb, milder than mutton)","zh":"青年羊肉（hogget 的肉；味道通常比羔羊肉更浓，但比老羊肉更温和）"},"examples":[{"en":"The menu offered roast hogget with rosemary and garlic.","zh":"菜单上有迷迭香蒜香烤青年羊肉。"},{"en":"If you can’t find hogget, ask whether they have lamb or mutton instead.","zh":"如果买不到青年羊肉，可以问问是否有羔羊肉或老羊肉可替代。"}]}],"synonyms":["yearling sheep","young sheep","teg (UK)"],"phonetic":"/ˈhɑɡɪt/","extraExplanation":["“Hogget”主要是英式英语、澳新英语等畜牧与餐饮语境里的词；在美式英语中较少见。常见的年龄划分是：lamb（羔羊）< hogget（约1–2岁）< mutton（成年/较老的羊肉）。不同地区对具体月份可能略有差异。"]}
{"word":"hoggets","summary":{"en":"Hoggets are young sheep (about 1–2 years old) or the meat from them.","zh":"hoggets 指约1–2岁的青年羊，或指青年羊肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"young sheep (usually about 1–2 years old), older than a lamb but not yet fully grown; plural of “hogget.”","zh":"（通常指1–2岁的）青年羊；介于羔羊与成羊之间的羊；“hogget”的复数。"},"examples":[{"en":"The farmer separated the lambs from the hoggets before winter.","zh":"冬天来临前，农夫把羔羊和青年羊分开饲养。"},{"en":"They bought 30 hoggets to raise for meat and wool.","zh":"他们买了30只青年羊来养作肉用和取羊毛。"}]},{"partOfSpeech":"n.","definition":{"en":"meat from a young sheep (between lamb and mutton), especially in British, Australian, and New Zealand English; plural can refer to multiple cuts/animals.","zh":"青年羊肉（口感介于羔羊肉与成年羊肉之间），尤用于英式、澳式与新西兰英语；复数可指多份肉或多只羊的肉。"},"examples":[{"en":"In some places, hogget is preferred because it has more flavor than lamb.","zh":"在一些地方，人们更喜欢青年羊肉，因为比羔羊肉更有风味。"},{"en":"The menu listed roasted hogget with herbs.","zh":"菜单上写着香草烤青年羊肉。"}]}],"synonyms":["young sheep","yearling sheep","lamb (younger)","mutton (older)"],"phonetic":"/ˈhɑɡɪts/","extraExplanation":["“hogget”多见于英国、苏格兰及澳大利亚/新西兰的畜牧业与餐饮语境；在北美更常直接说“young sheep”或用“lamb / mutton”来区分肉类。","作为肉类术语时，“hogget”通常表示比lamb（羔羊肉）更成熟、味道更浓，但又没有mutton（成年羊肉）那么重。"]}
{"word":"hoggie","summary":{"en":"A regional US word (often spelled “hoagie”) for a long sub-style sandwich.","zh":"指一种长形“潜艇堡”式三明治的美国地区用词（常拼作 hoagie）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US, especially Philadelphia area) A long sandwich made with a sliced roll and filled with meats, cheese, and toppings; the same kind of sandwich is also called a “sub.”","zh":"（美国用法，尤其费城一带）长形夹心三明治，用长面包切开后夹入肉类、奶酪和配料；也常叫“sub（潜艇堡）”。"},"examples":[{"en":"I’ll have a turkey hoagie with lettuce, tomato, and mayo.","zh":"我要一个火鸡长三明治，加生菜、番茄和蛋黄酱。"},{"en":"In Philly, people often say “hoagie” instead of “sub.”","zh":"在费城，人们常用“hoagie”来代替“sub”。"}]}],"synonyms":["hoagie","sub","submarine sandwich","hero","grinder"],"phonetic":"/ˈhoʊɡi/","extraExplanation":["“hoggie”更常见是对“hoagie”的误拼或变体拼法；标准拼写通常是 hoagie。","“hoagie”是美国很有地域色彩的词，常与费城（Philadelphia）饮食文化相关。不同地区会用不同词：sub、hero、grinder 等都可能指类似的三明治。"]}
{"word":"hoggin","summary":{"en":"“hoggin” is usually an informal spelling of “hogging” (taking more than your share). It can also mean a rough wool cloth in Scottish dialect.","zh":"“hoggin”通常是“hogging”的非正式拼写（指占得太多/霸占）。在苏格兰方言中也可指一种粗呢布。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal spelling) the present participle of “hog”: taking more than your fair share; keeping something for yourself.","zh":"（非正式拼写）“hog”的现在分词：占得比应得的多；把某物据为己有。"},"examples":[{"en":"Stop hoggin’ the remote—let someone else choose a show.","zh":"别老是霸着遥控器——让别人也选个节目。"},{"en":"He’s hoggin’ all the attention in the meeting.","zh":"他在会议上把所有注意力都抢走了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish / dialect) a rough, coarse woolen cloth, often used for work clothes.","zh":"（苏格兰/方言）一种粗糙的呢绒布，常用于耐穿的工作服。"},"examples":[{"en":"In older Scottish writing, you may see “hoggin” used to describe rough cloth.","zh":"在较早的苏格兰作品里，你可能会看到用 hoggin 来指粗呢布。"}]}],"synonyms":["hogging","keeping to yourself","monopolizing","taking over"],"phonetic":"/ˈhɔɡɪŋ/","extraExplanation":["“hoggin”在现代英语里最常见的是口语里把“hogging”里的 g 省略（-ing → -in’）的拼写，用来表现随意、口语或方言口吻。正式写作里建议用“hogging”。","动词“hog”本义与“猪”有关，引申出“像猪一样贪吃/贪占”，所以“hogging”常带轻微责备语气。","名词“hoggin（粗呢布）”属于地域/历史用法，日常美式英语中很少见，阅读苏格兰背景的文学或历史材料时更可能遇到。"]}
{"word":"hogging","summary":{"en":"“Hogging” usually means selfishly taking more than your fair share (food, time, space, or attention).","zh":"“Hogging”通常指自私地占用/拿走超过自己应得的一份（食物、时间、空间或注意力）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"taking more than your fair share of something (like food, time, space, or attention), often in a selfish or inconsiderate way","zh":"（常指自私地）占用或拿走超过自己应得的一份，如食物、时间、空间或注意力"},"examples":[{"en":"Stop hogging the remote—let someone else choose a show.","zh":"别一直霸占遥控器了——让别人也选个节目。"},{"en":"He was hogging the conversation and didn’t let anyone speak.","zh":"他一直霸占着谈话，不让别人说话。"},{"en":"She’s tired of him hogging all the credit for the group’s work.","zh":"她厌倦了他把团队的功劳都揽到自己身上。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of taking more than a fair share; the behavior of ‘hogging’","zh":"霸占、独占的行为（指“hogging”这种行为本身）"},"examples":[{"en":"There’s too much hogging in this game; share the ball.","zh":"这场比赛里太多人独占球了；把球传起来。"},{"en":"Hogging is a common complaint in group projects.","zh":"在小组作业里，“独占/抢功”是很常见的抱怨点。"}]}],"synonyms":["monopolizing","dominating","hoarding","grabbing","taking over"],"phonetic":"/ˈhɑɡɪŋ/","extraExplanation":["“hogging”来自名词 hog（猪）。英语里常用动物来比喻人的行为：hogging 暗示像“猪一样贪吃/贪占”，语气偏口语、带批评。","常见搭配：hogging the spotlight（抢风头）、hogging the bed（睡觉时占床）、hogging the bathroom（占着卫生间不出来）、hogging the road（在路上占道/挡路）。","在工程/力学里 hogging 也可指梁或结构“向上拱起”的弯曲（与 sagging 向下下垂相对）。日常口语中通常不指这个技术含义。"]}
{"word":"hoggins","summary":{"en":"“Hoggins” is usually a last name (surname) used as a proper noun.","zh":"“Hoggins”通常是一个姓氏（专有名词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name); a proper name used for people, and sometimes for businesses or places","zh":"姓氏（家族姓）；专有名词，用作人名，有时也用于公司名或地名"},"examples":[{"en":"Ms. Hoggins will lead the meeting today.","zh":"Hoggins 女士今天将主持会议。"},{"en":"I saw the name Hoggins on the office door.","zh":"我在办公室门牌上看到了 Hoggins 这个名字。"},{"en":"Is Hoggins your last name or a company name?","zh":"Hoggins 是你的姓氏还是公司名？"}]}],"synonyms":["(proper name) family name","surname","last name"],"phonetic":"/ˈhɑɡɪnz/","extraExplanation":["“Hoggins”通常需要首字母大写（Hoggins），因为它多作为姓氏使用。","它不是常见的普通英语词汇，因此没有固定的“词义”可像一般名词/动词那样解释；具体指代要看语境（某个人、某个品牌或地点）。","容易与更常见的姓氏“Goggins”（如 David Goggins）混淆；如果你指的是那个人名，拼写通常是 Goggins。"]}
{"word":"hoggish","summary":{"en":"Hoggish means greedy and selfish, especially about food or resources.","zh":"hoggish 指“贪婪自私”，尤其指在食物或资源分配上占便宜、不肯分享。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Greedy, selfish, and taking more than your fair share.","zh":"贪婪自私的；占便宜、拿得比应得的更多。"},"examples":[{"en":"Don’t be hoggish—leave some cake for everyone else.","zh":"别这么贪心——给其他人也留点蛋糕。"},{"en":"He was hoggish about the snacks and didn’t share.","zh":"他对零食很贪，占着不肯分享。"}]}],"synonyms":["greedy","selfish","grabby","stingy"],"phonetic":"/ˈhɑɡɪʃ/","extraExplanation":["“hoggish”来自“hog”（猪）。因为猪在英语文化里常被用来象征“吃相难看、很贪、只顾自己”，所以这个词带有明显的批评和不礼貌的语气。","近义词里常见更口语的表达是“greedy”“selfish”，也可以用“piggy”（更儿童化/更轻一点）来形容类似行为。"]}
{"word":"hoggishly","summary":{"en":"Hoggishly means behaving greedily or selfishly—often in a pig-like, messy, rude way.","zh":"hoggishly 指以贪婪、自私的方式行事，常带“像猪一样邋遢、粗鲁”的贬义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a greedy, selfish, or inconsiderate way (especially about food, money, attention, or space).","zh":"以贪婪、自私或不顾他人的方式（尤指在食物、金钱、注意力或空间上）。"},"examples":[{"en":"He hoggishly took the biggest slice and didn’t offer anyone else any.","zh":"他很自私地拿了最大的一片，也没分给别人。"},{"en":"Don’t hoggishly dominate the conversation—let others speak too.","zh":"别太霸道地把话题都占了——也让别人说说。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a pig-like way; messily or rudely.","zh":"像猪一样地；邋遢或粗鲁地。"},"examples":[{"en":"The toddlers ate hoggishly, with crumbs everywhere.","zh":"小孩子吃得很邋遢，饼干屑掉得到处都是。"},{"en":"He laughed hoggishly and wiped his mouth with his sleeve.","zh":"他粗俗地大笑，用袖子擦嘴。"}]}],"synonyms":["greedily","selfishly","grabbily","inconsiderately","pigishly"],"phonetic":"/ˈhɑɡɪʃli/","extraExplanation":["“hoggishly”来自形容词“hoggish”（像猪的、贪吃自私的），带明显贬义与批评语气。比起中性词“greedily（贪婪地）”，“hoggishly”更强调“吃相难看/不顾他人”的形象感。","它常与动词“eat, take, grab, dominate”等搭配，用来批评某人“把好处都占了”。在较正式写作中不常见，更常见于评价性叙述或文学描写。"]}
{"word":"hoggishness","summary":{"en":"Hoggishness means selfish, greedy behavior—acting like a “hog.”","zh":"hoggishness 指自私贪婪、只顾自己的行为或性格，语气较强、带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being selfish, greedy, or unpleasantly focused on your own wants (like a pig).","zh":"自私贪婪、只顾自己需求的性格或行为（带有“像猪一样”的贬义）。"},"examples":[{"en":"His hoggishness at dinner—taking the biggest portion first—annoyed everyone.","zh":"他吃饭时的“贪相”——先拿最大份——惹得大家都很不爽。"},{"en":"She criticized the company’s hoggishness for raising prices during a crisis.","zh":"她批评公司在危机期间涨价的贪婪行径。"}]}],"synonyms":["selfishness","greed","gluttony","stinginess"],"phonetic":"/ˈhɑɡɪʃnəs/","extraExplanation":["词源与构词：hoggishness 来自形容词 hoggish（“像猪一样的；贪婪自私的”）+ 名词后缀 -ness（表示“……的性质/状态”）。其中 hog（猪）在英语里常用作比喻，指“贪吃、粗鲁、只顾自己”。","语气与使用场景：这是带强烈批评意味的词，常用于评价某人的占有欲、贪心或不顾他人的行为。比 greedy 更形象、更带侮辱性；在正式场合可用 selfishness/greed 代替以避免过于尖刻。","文学/文化提示：英语里用动物来比喻人的缺点很常见（如 pig/hog 表示贪婪、fox 表示狡猾）。在一些文学作品中，类似“猪”的意象常用来讽刺人性的贪婪与粗鄙。"]}
{"word":"hoggism","summary":{"en":"Hoggism means selfish, greedy “hogging” behavior—taking more than your share.","zh":"Hoggism 指自私贪婪、爱“霸占/独吞”的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"selfish or greedy behavior, especially the habit of taking more than your fair share (as if “hogging” something).","zh":"自私或贪婪的行为，尤指“独占、霸占”资源或好处（像猪一样把东西都占着）。"},"examples":[{"en":"People complained about the hoarding and hoggism during the shortage.","zh":"在物资短缺期间，人们抱怨囤积和“hoggism”（自私霸占）。"},{"en":"If everyone shares, there’s no room for hoggism.","zh":"如果大家都愿意分享，就没有“hoggism”（独占自私）的空间。"}]}],"synonyms":["selfishness","greed","hogging","hoarding"],"phonetic":"/ˈhɔɡɪzəm/","extraExplanation":["“hoggism”不是常见日常词汇，多用于带讽刺/批评语气的写法。它通常来自动词“hog”（霸占、独吞）+ 后缀“-ism”（表示一种行为/倾向）。如果你想更自然地表达，常用：selfishness（自私）、greed（贪婪）、hogging（霸占/独占）。"]}
{"word":"hoggler","summary":{"en":"A rare informal word meaning someone who hogs or monopolizes things.","zh":"一个罕见的非正式词，指爱独占、爱霸占东西的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, informal) A person who hogs things—someone who keeps more than their share or won’t let others use something.","zh":"（罕见／非正式）爱“占着不放”的人；把东西独占、不给别人用的人。"},"examples":[{"en":"Don’t be a hoggler—share the snacks with everyone.","zh":"别当独占的人了——把零食分给大家。"},{"en":"He’s a bit of a hoggler with the remote control.","zh":"他对遥控器有点爱霸占。"}]}],"synonyms":["hogger","monopolizer","resource hog","selfish person"],"phonetic":"/ˈhɑɡlər/","extraExplanation":["“hoggler”在现代英语里非常不常见，很多词典不会收录。你可能想写的是：","1) hogger（更常见）：指“爱霸占的人/爱独占的人”，也可指“与猪相关的人或物”（较少见）。","2) haggler：指“讨价还价的人”。","3) hoarder：指“囤积者/收藏癖（严重时带病理含义）”。","如果你能提供一句原文语境（它出现在哪句话里），我可以帮你判断最准确的词和意思。"]}
{"word":"hoggs","summary":{"en":"“hoggs” most commonly means either (1) pigs (plural of hog) or, in parts of the UK, (2) one-year-old young sheep.","zh":"“hoggs”常见有两种含义：① 猪（hog 的复数）；②（英国部分地区用法）一岁左右的幼羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hog”: a large pig, especially one raised for meat.","zh":"“hog”的复数：猪（尤指饲养用于产肉的肥猪/大猪）。"},"examples":[{"en":"The farmer keeps hoggs in a separate pen from the chickens.","zh":"农场主把猪养在与鸡不同的围栏里。"},{"en":"Hoggs can be noisy when they’re hungry.","zh":"猪饿的时候会很吵。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK/Scotland & Northern England) Young sheep, especially ones that are about one year old.","zh":"（英格兰北部/苏格兰用法）一岁左右的幼羊（常指当年的“青年羊”）。"},"examples":[{"en":"In the uplands, the shepherd counts the hoggs before winter.","zh":"在高地，牧羊人会在冬天前清点这些一岁左右的幼羊。"},{"en":"The farm sells hoggs in the spring.","zh":"农场在春天出售这些青年羊。"}]}],"synonyms":["hogs","pigs","swine","young sheep","lambs (approx.)"],"phonetic":"/hɑɡ/","extraExplanation":["“hogg(s)”作“幼羊”是非常地域性的用法，多见于苏格兰和英格兰北部的农业语境；在一般美式英语里，人们更常用“lamb（羔羊）”或直接说“young sheep”。","拼写上“hoggs”也可能只是“hog”的常规复数（猪），需要结合上下文：如果谈的是牧场、羊群、放牧季节，往往指“幼羊”；如果谈的是猪圈、猪肉、饲料，通常就是“猪”。"]}
{"word":"hoggy","summary":{"en":"Hoggy means pig-like, often criticizing someone for being greedy, messy, or not sharing.","zh":"hoggy 表示“像猪一样的”，多用来批评某人贪吃、邋遢或不愿分享。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Like a hog; piggish—greedy, messy, or rude in a way that reminds people of a pig.","zh":"（非正式）像猪一样的；猪似的——指贪吃、邋遢或粗鲁，让人联想到猪。"},"examples":[{"en":"He got a little hoggy at the buffet and piled food onto his plate.","zh":"他在自助餐那儿有点“猪相”，把盘子堆得满满的。"},{"en":"Don’t be hoggy—share the snacks with everyone.","zh":"别这么“猪相”啦——零食要和大家分享。"},{"en":"After the hike, we were sweaty and hoggy, but happy.","zh":"徒步之后我们又汗又脏、有点“猪相”，但很开心。"}]}],"synonyms":["piggish","greedy","sloppy","selfish","gluttonous"],"phonetic":"/ˈhɔɡi/","extraExplanation":["“hoggy”在日常英语里不算常用，更常见的说法是“piggish”或“like a pig”。它通常带有轻微的批评或调侃语气。注意：在某些语境里也可能只是字面意思“像猪的/跟猪有关的”（如hoggy smell），但大多数时候用来形容人不礼貌地独占或贪吃。"]}
{"word":"hoghead","summary":{"en":"A “hoghead” usually means a large barrel (more commonly spelled “hogshead”); rarely, it can be an insult for a foolish or stubborn person.","zh":"“hoghead”通常指一个大木桶（更常见拼写为“hogshead”）；少见情况下也可作辱骂语，指愚蠢或固执的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “hogshead”) a large wooden barrel used for storing or transporting liquids such as wine, beer, or spirits.","zh":"（通常拼作“hogshead”）一种大型木桶，用于储存或运输酒、啤酒或烈酒等液体。"},"examples":[{"en":"The winery aged the wine in old hogsheads.","zh":"酒庄用旧的大木桶（hogsheads）陈酿葡萄酒。"},{"en":"They rolled a hogshead of rum into the warehouse.","zh":"他们把一大桶朗姆酒滚进仓库。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, rare) an insulting word for a foolish, stubborn, or unpleasant person.","zh":"（非正式，较少见）对愚蠢、固执或令人讨厌的人的侮辱性称呼。"},"examples":[{"en":"He called the driver a “hoghead” for not moving.","zh":"他骂那个司机是“hoghead”，因为对方不肯挪车。"}]}],"synonyms":["hogshead","barrel","cask","tun"],"phonetic":"/ˈhɑɡˌhɛd/","extraExplanation":["“hoghead”更常见的是你看到的拼写变体；标准拼写通常是“hogshead”。在历史上它既指木桶本身，也常被当作一种容量单位，但不同地区和不同时期的具体容量并不完全一致。阅读历史或文学作品时，遇到它多半与储酒、航运、殖民时期贸易等语境有关。"]}
{"word":"hogherd","summary":{"en":"A hogherd is a person who herds or cares for pigs.","zh":"hogherd 指看管、放牧猪群的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who takes care of pigs (a swineherd).","zh":"放猪的人；牧猪人（看管猪群的人）。"},"examples":[{"en":"As a child, he worked as a hogherd on a small farm.","zh":"小时候，他在一个小农场里当过放猪人。"},{"en":"The hogherd led the pigs back to the pen before dark.","zh":"天黑前，牧猪人把猪赶回了猪圈。"}]}],"synonyms":["swineherd","pig herder","hog herder"],"phonetic":"/ˈhɔɡˌhɝd/","extraExplanation":["“hogherd”是比较少见、带乡村/古风色彩的词，更常见的说法是“swineherd”（较正式/文学）或直接说“someone who herds/looks after pigs”。","在文学或历史语境里，这类职业名词常用来表现人物的社会阶层或乡村生活（类似于shepherd 牧羊人、cowherd 牧牛人）。"]}
{"word":"hoghide","summary":{"en":"Hoghide means pig skin, especially pigskin leather used to make goods like boots or bags.","zh":"hoghide 指猪皮，尤指用于制作靴子、包等物品的猪皮革。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skin of a hog (pig), especially when prepared and used as leather","zh":"猪皮；（尤指）鞣制后用于制作皮革制品的猪皮革"},"examples":[{"en":"The boots were made of tough hoghide leather.","zh":"这双靴子是用结实的猪皮革做的。"},{"en":"He carried a small hoghide bag that had been worn smooth over time.","zh":"他拎着一个小猪皮包，时间久了已经磨得很光滑。"}]}],"synonyms":["pigskin","hogskin","swinehide","leather"],"phonetic":"/ˈhɔɡˌhaɪd/","extraExplanation":["“hoghide”在现代英语里不算常见，更常见的说法是“pigskin”。两者意思接近，但“hog”有时给人更粗犷、乡村或传统制革语境的感觉。","在描述材质时常见搭配是“hoghide leather”。不同动物皮革在质感与用途上会有差异：猪皮革通常较耐磨、纹理明显。"]}
{"word":"hoghood","summary":{"en":"Hoghood is a rare word meaning “the state or behavior of being like a hog,” often implying greed or selfishness.","zh":"hoghood 是个罕用词，意为“像猪一样的状态或作风”，常含贬义，指贪婪或自私。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The state, behavior, or character of being a hog; hog-like greed, roughness, or selfishness.","zh":"（罕用）“像猪一样”的状态或特性；指贪婪、粗鲁或自私等“猪性”行为。"},"examples":[{"en":"He joked that his obsession with free food was pure hoghood.","zh":"他开玩笑说自己对免费食物的痴迷简直是“猪性”本色。"},{"en":"The essay criticizes corporate hoghood—taking more than a fair share.","zh":"这篇文章批评企业的“猪性”——拿走超过公平份额的东西。"}]}],"synonyms":["piggishness","greed","selfishness","gluttony"],"phonetic":"/ˈhɑɡˌhʊd/","extraExplanation":["“hoghood”非常少见，多用于幽默、讽刺或写作中的造词（nonce word）。日常英语里更常见的说法是“greed / selfishness / piggishness”。","后缀“-hood”常表示“……的状态/身份/时期”（如 childhood 儿童期，neighborhood 邻里）。把 hog + -hood 拼在一起，就是“像 hog 那样的状态/作风”。","hog 在美式英语里除了“猪”，也常带贬义，指“贪得无厌的人”或“霸占资源的人”（例如：He hogged the blanket. 他把毯子都霸占了）。"]}
{"word":"hoglike","summary":{"en":"Hoglike means “pig-like,” often implying greediness or unpleasant behavior.","zh":"hoglike 意为“像猪的”，常含贬义，暗示贪婪或不讨喜的行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hog (pig) in appearance or behavior; pig-like.","zh":"像猪的；具有猪（野猪/家猪）外形或行为特征的。"},"examples":[{"en":"The cartoon showed a hoglike man greedily grabbing food.","zh":"漫画里画了一个像猪一样的男人贪婪地抓食物。"},{"en":"He made a hoglike snorting sound as he laughed.","zh":"他笑的时候发出像猪一样的哼哼声。"}]}],"synonyms":["piglike","swine-like","porcine"],"phonetic":"/ˈhɔɡˌlaɪk/","extraExplanation":["“hoglike”常带贬义，用来批评某人“贪吃、邋遢、粗鲁或贪婪”。在正式写作里要谨慎使用，可能显得不礼貌或带有人身攻击。","词形结构：hog（猪）+ -like（像……一样）。类似构词还有 childlike（孩子般的）、snake-like（像蛇一样的）。","语体与替换：如果想更中性，可以用 pig-like（像猪的）描述外形；如果想委婉表达“贪吃”，可用 greedy（贪婪的）、gluttonous（贪吃的）。"]}
{"word":"hogling","summary":{"en":"A “hogling” is a young hog—a piglet.","zh":"“hogling”指小猪、幼猪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young hog; a piglet (a small, young pig).","zh":"小猪；幼猪（年幼的猪）。"},"examples":[{"en":"The farmer sold two hoglings at the county fair.","zh":"农夫在县集市上卖了两头小猪。"},{"en":"A hogling followed its mother around the pen.","zh":"一头小猪在圈里跟着母猪转。"}]}],"synonyms":["piglet","shoat","young hog"],"phonetic":"/ˈhɔɡlɪŋ/","extraExplanation":["“hogling”较少见，更多出现在方言、乡村语境或较旧的英语里。现代英语更常用“piglet”或“shoat”。","后缀“-ling”常表示“幼小的、较小的”（如 duckling 小鸭、gosling 小鹅），所以“hog + -ling”很直观地表示“小猪”。"]}
{"word":"hogmace","summary":{"en":"“hogmace” isn’t a recognized English word; it’s probably a misspelling or a rare/fictional term.","zh":"“hogmace”不是公认的英语单词；更可能是拼写错误或罕见/虚构用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; no widely accepted dictionary definition. It is likely a misspelling or a very rare/fictional term.","zh":"不是标准英语词汇；没有公认的词典释义。更可能是拼写错误或非常罕见/虚构的用语。"},"examples":[{"en":"I couldn’t find a reliable definition for “hogmace” in major English dictionaries.","zh":"我在主要英语词典里找不到“hogmace”的可靠释义。"},{"en":"Did you mean “Hogmanay” (Scottish New Year) or “mace” (a weapon/spice)?","zh":"你是不是想写“Hogmanay”（苏格兰新年）或“mace”（狼牙棒/肉豆蔻皮做的香料）？"}]}],"phonetic":"/ˈhɔɡ.meɪs/","extraExplanation":["“hogmace”更像是把两个词拼在一起的造词（hog + mace），或把某个词打错了。最常见的相近词是：\n- Hogmanay：苏格兰的新年前夜/新年庆祝活动（发音接近，拼写也相似）\n- hogwash：胡说八道\n- mace：狼牙棒；（香料）肉豆蔻皮\n如果你能提供出现它的句子、文章/游戏/小说来源，我可以更准确判断它的意思。"]}
{"word":"Hogmanay","summary":{"en":"Scottish New Year’s Eve celebrations.","zh":"苏格兰的除夕与跨年庆祝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"New Year’s Eve (and the celebrations around it) in Scotland.","zh":"（苏格兰的）除夕；以及围绕除夕展开的新年庆祝活动。"},"examples":[{"en":"We’re going to Edinburgh for Hogmanay to watch the fireworks.","zh":"我们要去爱丁堡过 Hogmanay，看烟火表演。"},{"en":"On Hogmanay, people often sing “Auld Lang Syne” at midnight.","zh":"在 Hogmanay，大家常在午夜合唱《Auld Lang Syne》（《友谊地久天长》）。"}]}],"synonyms":["New Year’s Eve","Scottish New Year"],"phonetic":"/ˌhɔɡməˈneɪ/","extraExplanation":["Hogmanay 是非常典型的苏格兰文化词。很多地方会有“first-footing”（新年跨进门的第一个访客）传统：新年刚过，第一位踏入家门的人被认为会带来好运，常带小礼物（如食物、饮料、煤等象征）。","在英语新闻或旅游宣传里，Hogmanay 往往专指苏格兰的大型新年活动（例如爱丁堡 Hogmanay）。日常口语中也可泛指苏格兰人过除夕的方式。"],"etymology":"词源不完全确定，多被认为与法语或斯堪的纳维亚语系的“年终/新年庆祝”相关表达有关；后来在苏格兰语境中固定指“苏格兰的除夕庆典”。","mnemonic":["记成“hog + may”：想象‘除夕大家吃喝热闹’，像“hog（大吃）到 May（一直嗨到来年）”，帮助记住它和跨年庆祝有关。","联想《友谊地久天长》：一听到跨年合唱这首歌，就想到苏格兰 Hogmanay。"]}
{"word":"hogmanay","summary":{"en":"Hogmanay is the Scottish New Year’s Eve celebration.","zh":"Hogmanay 指苏格兰的新年前夜庆祝活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Scottish celebration of New Year’s Eve (and sometimes New Year’s Day), often marked by parties, singing, and traditional customs","zh":"（苏格兰）新年前夜（有时也包括元旦）的庆祝活动，常伴随聚会、歌唱与传统习俗"},"examples":[{"en":"We spent Hogmanay in Edinburgh, watching fireworks and joining the street party.","zh":"我们在爱丁堡过霍格马奈节，看烟花并参加街头派对。"},{"en":"On Hogmanay, many people sing “Auld Lang Syne” at midnight.","zh":"在霍格马奈节，很多人会在午夜唱《友谊地久天长》。"},{"en":"Some families keep the Hogmanay tradition of welcoming the first guest after midnight.","zh":"有些家庭保留霍格马奈节的传统：在午夜后迎接第一个来访的人。"}]}],"synonyms":["Scottish New Year’s Eve","New Year’s Eve (in Scotland)"],"phonetic":"/ˌhɑɡməˈneɪ/","extraExplanation":["“Hogmanay”是很有苏格兰特色的词，常指12月31日夜间的跨年庆典。","相关传统之一是“first-footing”（新年第一位登门者）：人们相信第一个进门的人会影响来年的运势；有的地方还会带煤、饼干或威士忌等象征礼物。","在苏格兰跨年时唱《Auld Lang Syne》（常与诗人Robert Burns关联）非常常见，因此你可能在影视或文学场景里听到它和Hogmanay一起出现。"]}
{"word":"hogmanays","summary":{"en":"Hogmanays are Scottish New Year’s Eve celebrations.","zh":"Hogmanays 指苏格兰的新年前夜（跨年夜）庆祝活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of Hogmanay) The Scottish celebration of New Year’s Eve, often including parties, singing, fireworks, and traditional customs.","zh":"（Hogmanay 的复数）苏格兰的新年前夜庆祝活动，常包括聚会、唱歌、烟火及传统习俗。"},"examples":[{"en":"Edinburgh is famous for its Hogmanays, with big street parties and fireworks.","zh":"爱丁堡以 Hogmanays 闻名，有大型街头派对和烟火表演。"},{"en":"They traveled to Scotland to experience the Hogmanays and the New Year traditions.","zh":"他们去苏格兰体验 Hogmanays 以及当地的新年传统。"}]}],"synonyms":["New Year’s Eve (general)","Scottish New Year"],"phonetic":"ˌhɑɡməˈneɪ","extraExplanation":["Hogmanay 是苏格兰用来指“新年前夜/跨年夜”的词，在文化上很有特色，不只是普通的 New Year’s Eve。","常见习俗包括：唱《Auld Lang Syne》（《友谊地久天长》）、以及“first-footing（踏门迎新）”——新年刚开始时第一个进门的人被认为会影响一整年的好运。","在新闻或旅游语境里，你会看到复数 Hogmanays，用来指“多次/多地的 Hogmanay 庆祝活动”（例如不同年份或不同城市的庆典）。"]}
{"word":"hogmane","summary":{"en":"“Hogmane” is most likely a misspelling of “Hogmanay,” the Scottish New Year celebration.","zh":"“hogmane”很可能是“Hogmanay”的误拼，指苏格兰的新年庆祝活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “Hogmanay”) the Scottish celebration of New Year’s Eve and New Year’s Day, often involving parties, singing, and traditional customs.","zh":"（通常拼作“Hogmanay”）苏格兰对新年前夜与元旦的庆祝活动，常包括聚会、唱歌和传统习俗。"},"examples":[{"en":"We spent Hogmanay in Edinburgh watching fireworks at midnight.","zh":"我们在爱丁堡过霍格马奈节，午夜看烟火。"},{"en":"On Hogmanay, some families visit friends to wish them a happy New Year.","zh":"在霍格马奈节，一些家庭会去拜访朋友并送上新年祝福。"}]}],"synonyms":["Scottish New Year","New Year’s Eve (Scotland)"],"phonetic":"/ˌhɑɡməˈneɪ/","extraExplanation":["你输入的“hogmane”常见于把 **Hogmanay** 拼错的情况；标准拼法多为 **Hogmanay**。","Hogmanay 具有浓厚的苏格兰地方文化色彩；常见传统包括 **“first-footing（新年第一位进门者）”**：人们相信新年后第一个踏进家门的人会带来好运，通常会带礼物（如点心、饮品等，因地区而异）。","庆祝时常会唱苏格兰诗歌改编的跨年歌 **“Auld Lang Syne”**（中文常译作《友谊地久天长》），在英语文化中也常用于告别或跨年场合。"]}
{"word":"hogmanes","summary":{"en":"Hogmanay is the Scottish celebration of New Year’s Eve and the New Year.","zh":"Hogmanay 指苏格兰对新年前夜及新年的庆祝活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hogmanay: the Scottish celebration of New Year’s Eve (December 31) and the start of the New Year.","zh":"Hogmanay：苏格兰对新年前夜（12月31日）以及新年到来的庆祝活动（也可指这一天/这一晚的庆典）。"},"examples":[{"en":"In Scotland, many people celebrate Hogmanay with music, dancing, and fireworks.","zh":"在苏格兰，很多人会用音乐、舞蹈和烟花来庆祝 Hogmanay。"},{"en":"We spent Hogmanay in Edinburgh and watched the countdown in the city center.","zh":"我们在爱丁堡过 Hogmanay，并在市中心看倒计时。"},{"en":"Some families have special Hogmanay traditions, like welcoming the first guest after midnight.","zh":"有些家庭有特别的 Hogmanay 传统，比如在午夜后迎接第一个来访的客人。"}]}],"synonyms":["Scottish New Year (celebration)"],"phonetic":"/ˈhɔɡməˌneɪ/","extraExplanation":["你输入的“hogmanes”很可能是“Hogmanay”的拼写误差；标准拼写是 Hogmanay（首字母常大写）。","Hogmanay 在苏格兰文化中很重要，常见习俗包括“first-footing”（午夜后第一个进门的客人被认为会带来好运）以及赠礼、唱歌、聚会等。","词源并不完全确定，常见说法认为它可能与法语或古斯堪的纳维亚语等来源有关；在学习时更重要的是把它当作“苏格兰的新年夜庆典”来记忆。"]}
{"word":"hogmenay","summary":{"en":"Hogmanay is the Scottish name for New Year’s Eve and its traditional celebrations.","zh":"Hogmanay 是苏格兰对新年前夜及其传统跨年庆祝活动的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland) New Year’s Eve, especially the traditional Scottish celebration on December 31.","zh":"（苏格兰）新年前夜（12月31日），尤其指苏格兰传统的跨年庆祝活动。"},"examples":[{"en":"We spent Hogmanay in Edinburgh and watched the fireworks at midnight.","zh":"我们在爱丁堡过了Hogmanay，午夜时分看了烟花。"},{"en":"On Hogmanay, some families visit friends and bring food and drink to share.","zh":"在Hogmanay，一些家庭会去拜访朋友，并带上食物和饮品一起分享。"}]}],"synonyms":["New Year’s Eve (Scottish usage)"],"phonetic":"/ˌhɑɡ.məˈneɪ/","extraExplanation":["拼写提示：标准拼写是 Hogmanay（你写的 hogmenay 常见于拼写错误）。","文化背景：Hogmanay 常被视为苏格兰最重要的节日之一；传统活动包括唱《Auld Lang Syne》（《友谊地久天长》）、以及“first-footing”（新年后第一个登门拜访的人带来好运的习俗）。","词源并不完全确定，可能与法语或北欧语言有关；但在现代英语中，它主要被当作苏格兰文化相关词汇使用。"]}
{"word":"hogmenays","summary":{"en":"Hogmanay means Scotland’s New Year’s Eve/New Year celebration.","zh":"Hogmanay 指苏格兰的跨年夜/新年庆祝活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Scottish celebration of New Year’s Eve and the New Year, often involving parties, singing, and visiting friends (“first-footing”)","zh":"（苏格兰）跨年夜与新年庆祝活动（常包括聚会、唱歌、拜访亲友等，“first-footing/新年第一位到访者”的传统）"},"examples":[{"en":"We spent Hogmanay in Edinburgh and watched the fireworks at midnight.","zh":"我们在爱丁堡过了 Hogmanay，并在午夜看了烟火。"},{"en":"On Hogmanay, some people go first-footing to bring luck to the house.","zh":"在 Hogmanay，有些人会去“first-footing”（新年第一位到访）来给人家带来好运。"}]}],"synonyms":["New Year’s Eve (general)","Scottish New Year (contextual)"],"phonetic":"/ˌhɑɡ.məˈneɪ/","extraExplanation":["你输入的“hogmenays”多半是复数形式，单数通常写作 Hogmanay；也有人用 Hogmanays 表示“几场/几天的跨年庆典”。","Hogmanay 在苏格兰文化中很重要：常见元素包括除夕夜聚会、倒数后唱《Auld Lang Syne》（《友谊地久天长》）、以及“first-footing”（新年零点后第一个踏入家门的人被认为会带来好运，常带礼物如威士忌、点心或煤/象征物）。"]}
{"word":"hogmollies","summary":{"en":"“Hogmollies” is the plural of “hog molly,” a rare slang insult for a very large/heavyset woman.","zh":"“hogmollies”是“hog molly”的复数形式，属于少见俚语，用来侮辱非常高大或肥胖的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, often offensive) A very large or heavyset woman; used as an insult.","zh":"（俚语，常带冒犯）指非常高大或肥胖的女性；多用作侮辱性称呼。"},"examples":[{"en":"That word is insulting—don’t call anyone a “hog molly.”","zh":"那个词很冒犯——不要用“hog molly”去称呼别人。"},{"en":"The book shows how cruel slang can be when people label a woman a “hog molly.”","zh":"这本书展示了当人们用“hog molly”给女性贴标签时，俚语会有多残酷。"}]}],"synonyms":["insult","slur","heavyset woman","plus-size woman"],"phonetic":"/ˈhɔɡ ˌmɑli/","extraExplanation":["“hog molly”属于较少见的美国口语/俚语，语气粗鲁，常带有强烈的身体羞辱（body-shaming）意味；在正式写作和礼貌交流中应避免使用。","拼写有时也会连写成 hogmolly；你输入的 hogmollies 是复数形式。"]}
{"word":"hogmolly","summary":{"en":"Hogmolly is a Southern U.S. informal word meaning “very big/heavy,” and it can also mean a very large person or thing.","zh":"hogmolly 是美国南部的非正式说法，表示“特别大/特别重/特别胖”，也可作名词指“大块头的人或笨重的大件”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Southern U.S., informal) Very large, heavy, or fat; big and bulky.","zh":"（美国南部方言，非正式）非常大的、很重的、很胖的；又大又笨重的。"},"examples":[{"en":"That dog is hogmolly—he must weigh 80 pounds.","zh":"那只狗胖得离谱，肯定有80磅。"},{"en":"He bought a hogmolly pickup truck that barely fits in the garage.","zh":"他买了一辆又大又笨重的皮卡，车库里都快放不下。"}]},{"partOfSpeech":"n.","definition":{"en":"(Southern U.S., informal) A very large or heavy person or thing.","zh":"（美国南部方言，非正式）大块头；特别魁梧/笨重的人或物。"},"examples":[{"en":"That hogmolly in the front row blocked my view.","zh":"前排那个大块头把我视线挡住了。"},{"en":"They hauled the hogmolly out of the shed with a dolly.","zh":"他们用手推车把那个笨重的大件从棚里搬出来。"}]}],"synonyms":["huge","big","bulky","heavy","massive","chunky","oversized"],"phonetic":"/ˈhɔɡˌmɑli/","extraExplanation":["“hogmolly”（也常写作 hog-molly、hogmollie）多见于美国南部口语，带有很强的地域与口语色彩；在正式写作中不常用。","语感上它通常带点夸张甚至调侃：形容人时可能显得不礼貌，除非是在熟人间开玩笑；形容物体（车、家具、箱子等）更中性、更安全。"]}
{"word":"Hogne","summary":{"en":"a Norwegian male given name.","zh":"挪威常见的男性名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name (most common in Norway); a variant spelling of the Old Norse name Högni/Hǫgni.","zh":"男性名字（在挪威较常见）；常被视为古诺斯语姓名 Högni/Hǫgni 的变体拼写。"},"examples":[{"en":"Hogne moved to the U.S. for graduate school.","zh":"Hogne 为了读研究生搬到美国。"},{"en":"In Norway, you may meet someone named Hogne, especially among older generations.","zh":"在挪威，你可能会遇到叫 Hogne 的人，尤其在年长一代中更常见。"}]}],"phonetic":"/ˈhɔɡnə/","extraExplanation":["这是专有名词（人名），不是常见英语词汇；在英文语境中通常直接当作姓名使用，不翻译含义。","如果你是在小说、北欧神话/传说或家谱资料里看到它，它可能与传奇人物名 Högni/Hǫgni 有关联。"],"etymology":"多见于挪威人名用法；常被认为与古诺斯语人名 Hǫgni / Högni 有关（北欧传说中也出现过该名字）。由于属于专名，具体“字面含义”在不同资料中解释不一，学习时更建议把它当作人名记忆与识别。","mnemonic":["把它当作“挪威男生名”来记：看到 Hogne 就先联想到北欧名字（类似于常见的挪威姓名拼写风格）。","读音可用中文近似记：像“霍-格-呢”（帮助记住开头 Ho- 和中间 -gn- 的组合）。"]}
{"word":"hogni","summary":{"en":"Hogni is mainly a male name, a variant spelling of the Old Norse/Icelandic name Högni, and it also refers to a saga character in Norse legend.","zh":"Hogni 主要是男性人名，是古诺斯语/冰岛名字 Högni 的一种拼写形式，也可指北欧传说中的传奇人物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name (mostly Icelandic); a spelling variant of the Old Norse name “Högni.”","zh":"男性名字（多见于冰岛）；源自古诺斯语名字“Högni”的一种拼写形式。"},"examples":[{"en":"Hogni is an Icelandic name you may see in books about Nordic culture.","zh":"Hogni 是一个你可能会在介绍北欧文化的书里看到的冰岛名字。"},{"en":"His first name is Hogni, but some sources write it as Högni.","zh":"他名叫 Hogni，但有些资料会写作 Högni。"}]},{"partOfSpeech":"other","definition":{"en":"(Norse legend) a character named Högni/Hogni, often appearing in heroic sagas and poems.","zh":"（北欧传说）名为 Högni/Hogni 的人物，常见于英雄传说、史诗与古诗中。"},"examples":[{"en":"In some Norse stories, Hogni is portrayed as a warrior in legendary conflicts.","zh":"在一些北欧故事里，Hogni 被描写为参与传奇纷争的战士。"},{"en":"The name Hogni appears in retellings of the Völsung and related saga traditions.","zh":"在《沃尔松格》及相关传奇传统的改写故事中能看到 Hogni 这个名字。"}]}],"synonyms":["Högni","Hogne"],"phonetic":"/ˈhɑɡni/","extraExplanation":["“Hogni”更常见的原写法是带重音符号的“Högni”。在英语环境里，变音符号（ö）常被省略，所以你可能会看到 Hogni / Hogne / Högni 等不同拼法，但指向同一来源的名字。","它主要作为专有名词使用，不是英语里的常见词汇；多数情况下出现在人名、文学改写、神话研究或北欧相关内容中。"]}
{"word":"hognose","summary":{"en":"A hognose is a North American snake with an upturned snout; it may also describe something with a pig-like upturned nose.","zh":"hognose 指鼻端上翘的北美“猪鼻蛇”；也可形容“像猪鼻一样上翘的鼻子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of North American snake with an upturned snout, often known for flattening its neck like a cobra and sometimes pretending to be dead when threatened","zh":"一种北美蛇类，鼻端上翘（像猪鼻子），受到威胁时常会把颈部压扁、甚至装死来吓退敌人"},"examples":[{"en":"We saw a hognose snake on the trail, and it puffed up and hissed.","zh":"我们在小路上看到一条猪鼻蛇，它鼓起身体并发出嘶嘶声。"},{"en":"Hognoses are usually harmless to people and help control pests like toads and rodents.","zh":"猪鼻蛇通常对人无害，还能帮助控制蟾蜍和啮齿动物等“害虫”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in compounds) having an upturned, pig-like nose","zh":"（用于复合词）指鼻子上翘、像猪鼻一样的"},"examples":[{"en":"The animal has a hognose profile, with its snout turned upward.","zh":"这种动物的侧脸像“猪鼻”，鼻吻部向上翘。"}]}],"synonyms":["hognose snake","puff adder (common name, not the African species)","upturned-nose"],"phonetic":"/ˈhɔɡˌnoʊz/","extraExplanation":["“hognose”常见于短语 hognose snake（猪鼻蛇）。这种蛇在英语文化里很有名的一点是它的防御行为：会把头颈压扁、发出嘶声，有些还会翻肚“装死”（playing dead）来让捕食者放弃。"]}
{"word":"hognoses","summary":{"en":"Hognoses are hognose snakes, named for their pig-like upturned snouts.","zh":"hognoses 指猪鼻蛇，因鼻端上翘像猪鼻子而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A kind of snake (a hognose snake), named for its upturned snout that looks a bit like a pig’s nose.","zh":"一种“猪鼻蛇”（hognose snake），因鼻端上翘、看起来有点像猪鼻子而得名。"},"examples":[{"en":"Hognoses are known for their upturned noses, which help them dig in sandy soil.","zh":"猪鼻蛇以鼻端上翘而闻名，这也能帮助它们在沙土里挖掘。"},{"en":"We saw a hognose on the trail, and it flattened its head to look bigger.","zh":"我们在小径上看到一条猪鼻蛇，它把头部压扁来让自己看起来更大。"}]}],"synonyms":["hognose snakes","hognose (snake)"],"phonetic":"/ˈhɔɡˌnoʊz/","extraExplanation":["“hognose”常指北美的猪鼻蛇属（Heterodon）。它们通常无毒或仅有轻微毒性，对人类威胁很小。","猪鼻蛇很有名的防御行为是装死：可能会翻肚、张口、甚至散发难闻气味来吓退天敌。","复数形式是 hognoses；单数是 hognose。"]}
{"word":"hognut","summary":{"en":"A “hognut” is a hickory nut (often from the pignut hickory) or the tree that produces it.","zh":"“hognut”指一种山核桃坚果（常指猪坚果山核桃的果实）或结这种果实的树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hickory nut (especially from the pignut hickory), often considered less sweet and sometimes eaten by wild animals such as hogs","zh":"（尤指“pignut hickory”结的）山核桃坚果；味道常不如其他山核桃甜，有时常被野生动物（如野猪/猪）取食"},"examples":[{"en":"Squirrels were carrying hognuts across the yard in early fall.","zh":"初秋时，松鼠把山核桃坚果叼着穿过院子。"},{"en":"Some people crack hognuts for the kernels, but they can taste a bit bitter.","zh":"有些人会敲开这种坚果取仁，但味道可能有点苦。"}]},{"partOfSpeech":"n.","definition":{"en":"the pignut hickory tree itself (a North American hardwood)","zh":"（北美的一种硬木树）猪坚果山核桃树（pignut hickory）"},"examples":[{"en":"A tall hognut stood at the edge of the woods.","zh":"林子边缘长着一棵高大的猪坚果山核桃树。"},{"en":"The old fence line was shaded by oak and hognut.","zh":"老栅栏那一带被橡树和猪坚果山核桃树遮荫。"}]}],"synonyms":["pignut","hickory nut"],"phonetic":"/ˈhɔɡˌnʌt/","extraExplanation":["“hognut”多见于美国一些地区的口语或地方用法，常指“pignut hickory”的坚果或这棵树本身；“hog-”来自猪，暗示这种坚果常被猪或野生动物吃，或味道不如更甜的山核桃（pecan）受欢迎。","相关词：pignut（更常见的名称）；hickory nut（更泛指的说法）。"]}
{"word":"hognuts","summary":{"en":"Hognuts usually means cheap nuts used as pig feed (often peanuts); it can also be a vulgar slang for testicles.","zh":"Hognuts 通常指喂猪等牲畜的便宜坚果（常指花生）；也可作粗俗俚语指“睾丸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Nuts—often peanuts or other cheap nuts—used as animal feed (especially for pigs); by extension, very cheap nuts.","zh":"（复数）常指用来喂牲畜（尤指猪）的坚果；多指花生等便宜的坚果，引申为“很廉价的坚果”。"},"examples":[{"en":"The farmer bought a sack of hognuts to feed the pigs.","zh":"农夫买了一袋“hognuts”来喂猪。"},{"en":"Back then, peanuts were sometimes dismissed as hognuts because they were so cheap.","zh":"那时候花生很便宜，有时会被人贬称为“hognuts”。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, vulgar) A crude slang term for testicles.","zh":"（非正式，粗俗）对“睾丸/蛋蛋”的粗俗说法。"},"examples":[{"en":"That joke uses the word “hognuts” in a vulgar way.","zh":"那个笑话里用“hognuts”是很粗俗的用法。"},{"en":"Avoid using “hognuts” in polite conversation.","zh":"在正式或礼貌的场合要避免使用“hognuts”。"}]}],"synonyms":["peanuts","nuts","animal feed nuts","(vulgar) balls"],"phonetic":"/ˈhɔɡˌnʌts/","extraExplanation":["“hognuts”并不是现代英语里的常用词，更常见于口语、俚语或带有地域色彩的表达。写作或正式交流中，表示“花生/坚果”通常直接说 peanuts / nuts。","第二个含义属于粗俗俚语，可能引起冒犯；学习时了解即可，使用要非常谨慎。"]}
{"word":"hogo","summary":{"en":"Hogo means a strong, often gamey or slightly unpleasant smell or taste, especially in aged meat (and sometimes in strong spirits).","zh":"Hogo 指浓烈、常带野味或略令人不适的气味/味道，尤用于放久或熟成的肉类（有时也用于烈酒的强烈香气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, somewhat unpleasant smell or taste, especially the gamey flavor of meat that is aging or slightly spoiled","zh":"（尤指肉类放久后产生的）浓烈、略带腐败或野味的气味/味道"},"examples":[{"en":"The stew had a slight hogo, so I added herbs and cooked it longer.","zh":"这锅炖菜有一点点腥膻的“野味”，所以我加了香草又多煮了一会儿。"},{"en":"Some people enjoy the hogo of aged game, but others find it too strong.","zh":"有些人喜欢陈年野味那种浓烈气息，但也有人觉得太冲。"}]}],"synonyms":["funk","gamey smell","pungency","rank odor","strong aroma"],"phonetic":"/ˈhoʊɡoʊ/","extraExplanation":["“hogo”来自法语短语“haut goût”（字面是“高味道”），原本指熟成或存放后更浓的风味；在英语里常带一点“气味过重、微微变质/腥膻”的感觉。","在饮食语境中，它常用来形容野味、陈年肉类或带强烈风味的食物；在朗姆酒（尤其是牙买加朗姆）品鉴中，有时也用来指那种浓烈、发酵感很强的香气。"]}
{"word":"hogpen","summary":{"en":"A hogpen is an enclosure for pigs, and informally it can mean a very dirty, messy place.","zh":"hogpen 指猪圈；口语中也可比喻“非常脏乱的地方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fenced area or small enclosure where hogs (pigs) are kept; a pigpen","zh":"（养猪的）猪圈；猪栏"},"examples":[{"en":"The farmer cleaned the hogpen every morning.","zh":"农夫每天早上都会打扫猪圈。"},{"en":"The hogpen was muddy after the rain.","zh":"下雨后猪圈里一片泥泞。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a place that is extremely dirty or messy","zh":"（非正式）非常脏乱的地方"},"examples":[{"en":"After the party, the kitchen looked like a hogpen.","zh":"聚会之后，厨房看起来像猪圈一样脏乱。"},{"en":"Please pick up your clothes—this room is turning into a hogpen.","zh":"请把衣服捡起来——这房间快变成猪圈了。"}]}],"synonyms":["pigpen","sty","pen (for pigs)","mess (informal)"],"phonetic":"/ˈhɔɡˌpɛn/","extraExplanation":["“hogpen”常写作两词“hog pen”，意思相同；在美式英语里更常见“pigpen”。","把某个地方比作“hogpen”带有强烈的贬义（很脏、很乱），用于形容房间、厨房等日常场景时语气比较直接；对人或他人住所使用时要注意礼貌。"]}
{"word":"hogreeve","summary":{"en":"A historical term for an official responsible for overseeing pigs on a manor or in a village.","zh":"历史用语：庄园或乡村中负责管理猪的地方官或管事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical, chiefly British) A local official on a manor or in a village whose job was to oversee pigs (hogs)—for example, managing communal swine, enforcing rules about pannage (pasturing pigs in woods), or collecting related dues.","zh":"（历史用语，主要用于英国）乡村或庄园里的地方小官，负责管理猪（如看管公猪群、执行放猪入林觅食的规定、征收相关费用等）。"},"examples":[{"en":"In medieval records, a hogreeve might be appointed to control where villagers’ pigs could forage.","zh":"在中世纪的文献记录中，hogreeve 可能被任命来管理村民的猪能在哪里觅食。"},{"en":"The manor employed a hogreeve to supervise the swine during the autumn mast season.","zh":"庄园雇用一名 hogreeve 在秋季橡果等“林木果实季”监督猪群。"}]}],"synonyms":["swineherd","reeve (related term)","manorial officer"],"phonetic":"/ˈhɔɡˌriːv/","extraExplanation":["这是一个非常古老、少见的词，现代英语里几乎不会在日常对话中出现，多见于中世纪英国的历史材料或文学中。","词由 hog（猪）+ reeve 组成。reeve 是盎格鲁—撒克逊时期及中世纪英格兰的“地方官/庄园官”一类称呼（如 shire-reeve 后来演变为 sheriff）。"]}
{"word":"hogrophyte","summary":{"en":"A hygrophyte is a plant adapted to very moist environments.","zh":"hygrophyte 指适应在非常潮湿环境中生长的喜湿植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant that grows best in very moist or wet conditions, often found in humid forests, marshy areas, or along streams.","zh":"喜湿植物；适合在非常潮湿或湿润环境中生长的植物，常见于湿润森林、沼泽地或溪流边。"},"examples":[{"en":"Ferns are common hygrophytes in shaded, humid forests.","zh":"在阴凉潮湿的森林里，蕨类是常见的喜湿植物。"},{"en":"Because it is a hygrophyte, this species needs consistently moist soil.","zh":"由于它是喜湿植物，这个物种需要土壤长期保持湿润。"}]}],"synonyms":["moisture-loving plant","humid-environment plant"],"phonetic":"/ˈhaɪɡrəˌfaɪt/","extraExplanation":["你输入的“hogrophyte”很可能是拼写错误，更常见的正确拼写是“hygrophyte”。词根上，hygr- 表示“湿”（与 humidity“湿度”同源），-phyte 表示“植物”。这是生物学/生态学术语，常用于描述植物对水分环境的偏好（与 xerophyte“旱生植物”、hydrophyte“水生植物”对比）。"]}
{"word":"hogs","summary":{"en":"“Hogs” usually means pigs (plural of hog). It can also be the verb “hogs,” meaning ‘takes more than a fair share.’","zh":"“hogs”通常指“猪”（hog 的复数）；也可作动词，表示“独占/占用过多”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hog: large pigs, especially those raised for meat","zh":"hog 的复数：大猪；（尤指）为食用而饲养的猪"},"examples":[{"en":"The farmer keeps hogs in a separate pen.","zh":"农场主把猪养在单独的猪圈里。"},{"en":"In this region, many families raise hogs for income.","zh":"在这个地区，很多家庭靠养猪增加收入。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of hog: to take or use more than your fair share (of space, time, attention, etc.)","zh":"hog 的第三人称单数：独占；占用过多（空间、时间、注意力等）"},"examples":[{"en":"He always hogs the remote control.","zh":"他总是独占遥控器。"},{"en":"Don’t hog the bathroom—other people are waiting.","zh":"别一直占着浴室——别人还在等。"}]}],"synonyms":["pigs","swine","boars","take over","dominate"],"phonetic":"/hɔɡz/","extraExplanation":["“hog”作动词时常带有负面评价，表示“自私地占用”。常见搭配：hog the spotlight（抢风头/出尽风头）, hog the conversation（霸着话不让别人说）, hog the road（开车占道）。"]}
{"word":"hogsbane","summary":{"en":"Hogsbane is an old word for a poisonous plant thought to harm hogs, often referring to henbane.","zh":"hogsbane 是旧词，指被认为会害猪的有毒植物，常用来指莨菪（henbane）等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous plant (or the poison from a plant), traditionally said to harm hogs; often used as an old/common name for henbane and some other toxic herbs.","zh":"（旧称/俗称）一种有毒植物（或其毒性成分），传统上认为会害猪；常用来指莨菪（henbane）等有毒草本。"},"examples":[{"en":"In old herbals, hogsbane was listed among plants that could poison livestock.","zh":"在一些古老的本草书中，hogsbane 被列为可能毒害家畜的植物。"},{"en":"The story warns children not to touch hogsbane growing near the fence.","zh":"故事告诫孩子们不要碰篱笆旁长的 hogsbane。"}]}],"synonyms":["henbane","poisonous plant","toxic herb"],"phonetic":"/ˈhɑɡzˌbeɪn/","extraExplanation":["“hogsbane”由 hog（猪）+ bane（祸害、致命之物）构成，字面意思是“害猪之物”。在不同地区和不同时期，它可能指向不同的有毒植物；最常见的对应之一是 henbane（莨菪，Hyoscyamus niger）。阅读旧文学或旧植物志时，遇到该词要结合上下文判断具体是哪种植物。"]}
{"word":"hogshead","summary":{"en":"A hogshead is a large barrel (and historically a volume unit) used mainly for storing or measuring liquids like wine, beer, or spirits.","zh":"hogshead 指用于储存或计量酒类等液体的“大桶”，也可指历史上的体积单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large barrel used to store or transport liquids (especially wine, beer, or spirits); its exact size varies by place and time.","zh":"（尤指用于葡萄酒、啤酒或烈酒的）大桶；具体容量因地区和时代而异。"},"examples":[{"en":"The whiskey was aged in a hogshead for years before bottling.","zh":"这款威士忌在大桶（hogshead）中陈酿多年后才装瓶。"},{"en":"Old records mention shipments of wine measured in hogsheads.","zh":"旧记录提到用“hogshead”作为计量单位来记录葡萄酒的运输量。"}]},{"partOfSpeech":"n.","definition":{"en":"A unit of volume based on the size of a hogshead, used historically for alcohol and other liquids.","zh":"（历史上）以大桶容量为基础的体积单位，常用于酒类等液体。"},"examples":[{"en":"The tax was calculated per hogshead of rum.","zh":"税费按每一“hogshead”的朗姆酒来计算。"},{"en":"In some contexts, a hogshead was roughly around sixty-odd gallons, but it depended on the system used.","zh":"在某些情况下，hogshead 大约相当于六十多加仑，但会因采用的计量体系而不同。"}]}],"synonyms":["cask","barrel","tun","butt"],"phonetic":"/ˈhɔɡzˌhɛd/","extraExplanation":["“hogshead”这个词很常出现在酒类行业（尤其是威士忌、雪莉酒等）的陈酿与装桶语境里。不同酒种与地区会有不同“标准桶”容量：例如苏格兰威士忌行业里常见的 hogshead 往往在约 225–250 升左右（因来源与规格而异）。","词源上它与“hog（猪）”并非直接指“装猪的桶”。更常见的解释是来自古英语或中古英语中表示“量具/桶”的构词演变；因此不要按字面理解为“猪头”。","阅读历史小说、航运账簿、殖民时期贸易材料时，hogshead 常作为“桶装货物/计税单位”出现；理解为“大桶/一大桶的量”通常就足够。"]}
{"word":"hogsheads","summary":{"en":"Hogsheads are large casks, and historically they also refer to a variable traditional unit of volume.","zh":"hogsheads 指“大木桶/大酒桶”，在历史语境中也可指一种容量单位（数值不固定）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large wooden barrel (cask), especially one used for storing or shipping liquids like wine, ale, or tobacco","zh":"（尤指装运或储存葡萄酒、啤酒、烟草等的）大木桶；大酒桶"},"examples":[{"en":"The cellar stored wine in oak hogsheads for aging.","zh":"酒窖用橡木大桶来陈酿葡萄酒。"},{"en":"Historically, tobacco was shipped across the Atlantic in hogsheads.","zh":"历史上，烟草常用大木桶横渡大西洋运输。"}]},{"partOfSpeech":"n.","definition":{"en":"a traditional unit of volume based on the size of a hogshead (the exact amount varies by time and place)","zh":"“hogshead”作为容量单位（具体容量因时代与地区而异）"},"examples":[{"en":"Old records list the beer as “two hogsheads.”","zh":"旧账册把啤酒记为“两大桶”。"},{"en":"A hogshead was once used as a measuring unit in trade documents.","zh":"“hogshead”曾在贸易文件中用作计量单位。"}]}],"synonyms":["casks","barrels","tuns","kegs (smaller)"],"phonetic":"/ˈhɑɡzˌhɛd/","extraExplanation":["“hogsheads”是复数形式；单数是“hogshead”。","词源上常被解释为与“hog’s head（猪头）”有关：早期木桶有时会用类似猪头的标记（或来自旧法语/中古英语的相关词形），后来固定指一种大桶。","作为“容量单位”时并不统一：不同商品（如葡萄酒、啤酒）与不同国家/时期的规定会有差异，所以读到历史文献时通常需要结合上下文或注释理解具体容量。"]}
{"word":"hogship","summary":{"en":"“Hogship” is rare: it can mean a ship that carries hogs, or (jokingly) hoggish behavior treated like a “-ship” quality.","zh":"“hogship”很少见：可指运猪的船；也可作幽默自造词，表示“像猪一样贪占/贪吃的作风”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A ship used for transporting hogs (pigs), especially as cargo.","zh":"（罕见/非标准）运送猪（肉猪）作为货物的船。"},"examples":[{"en":"The farmer hired a small hogship to move his pigs downriver.","zh":"农场主雇了一艘小型运猪船把猪沿河运走。"},{"en":"In old shipping records, a “hogship” might be listed alongside cattle boats.","zh":"在旧的航运记录里，“hogship”可能会和运牛船一起被列出。"}]},{"partOfSpeech":"n.","definition":{"en":"(Humorous, coined) The state or style of being a “hog”; hoggish behavior as if it were a “-ship” quality (like friendship).","zh":"（幽默/自造词）像“friendship（友谊）”那样把“hog（贪吃/自私的人）”加上“-ship”，表示“像猪一样的作风/习性”，多带调侃。"},"examples":[{"en":"Stop the hogship—leave some fries for everyone else.","zh":"别这么“hogship”了——给别人也留点薯条。"},{"en":"His constant hogship at the buffet annoyed his friends.","zh":"他在自助餐里一直很“霸占/贪吃”的行为让朋友们很烦。"}]}],"synonyms":["(ship sense) livestock boat","(humorous sense) hogging","greediness"],"phonetic":"/ˈhɑɡˌʃɪp/","extraExplanation":["“hogship”不是常见的标准英语词汇，在现代词典里通常查不到。你更可能在：①幽默自造词（把 hog + -ship 造出来），②非常具体的行业/历史语境（运牲畜的船只记录）中见到。","如果你是在某段文字里看到它，也可能是拼写误差（例如 hardship, worship, friendship 等）。如果你把原句发来，我可以帮你判断最可能的意思。"]}
{"word":"hogshouther","summary":{"en":"“hogshouther” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“hogshouther”不是标准英语词汇，更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username. Common possible targets include “hogshead” (a large barrel) or “hog’s hooter” (a humorous/rare phrase meaning a hog’s snout). If you share the sentence where you saw it, I can identify the intended word.","zh":"不是标准英语单词。它很可能是拼写错误，或是人名/用户名。可能想写的是“hogshead”（大桶/大酒桶）或“hog’s hooter”（很少见的幽默说法，指猪鼻子）。如果你把它出现的句子发来，我可以帮你确定原本想表达的词。"},"examples":[{"en":"I couldn’t find “hogshouther” in a dictionary—do you mean “hogshead”?","zh":"我在词典里找不到“hogshouther”——你是不是想写“hogshead”？"},{"en":"If you paste the full sentence, I can suggest the correct spelling.","zh":"如果你把完整句子贴出来，我可以帮你判断正确拼法。"}]}],"phonetic":"/ˈhɔɡzˌhaʊðər/","extraExplanation":["“hogshead”是较常见的真实单词，指一种大桶（历史上用于装酒、烟草等），在英美历史/贸易语境里会出现。","“hog’s hooter”属于非常口语、幽默甚至有点夸张的说法，并不常见；如果你是在小说、方言对话或搞笑内容里看到，才可能出现。","也有可能这是专有名词（姓氏、地名、游戏ID等）；这种情况下通常不会收录在一般词典里。"]}
{"word":"hogskin","summary":{"en":"Hogskin is leather made from a pig’s skin.","zh":"hogskin 指“猪皮革”，即由猪皮制成的皮革。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Leather made from a pig’s skin, used to make shoes, gloves, bags, and other goods.","zh":"猪皮革；用猪皮制成的皮革（常用于鞋、手套、包等皮具）。"},"examples":[{"en":"These work gloves are made of hogskin, so they’re tough and long-lasting.","zh":"这副工作手套是猪皮革做的，所以很耐磨、很耐用。"},{"en":"The label says “genuine hogskin leather.”","zh":"标签上写着“真猪皮革”。"}]}],"synonyms":["pigskin","pork leather"],"phonetic":"/ˈhɔɡˌskɪn/","extraExplanation":["在英语里，hog（猪，尤指长成的大猪）+ skin（皮）组合成 hogskin。日常更常见的说法是 pigskin。","猪皮革通常比较结实、透气，纹理毛孔也更明显；在一些产品描述中，hogskin/pigskin 用来强调材质与耐用性。","注意文化语境：有些宗教或个人原因会避免使用猪皮制品；在跨文化沟通中可用“leather (pig)”或直接说明材质以避免误解。"]}
{"word":"hogsteer","summary":{"en":"“hogsteer” is not a standard English word; it’s usually a coined nickname/handle from “hog” + “steer,” with only a very rare literal interpretation.","zh":"“hogsteer”不是标准英语词汇；多半是由“hog”+“steer”拼成的自造昵称／网名，字面解释也很罕见。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare / nonstandard) A made-up compound word used mainly as a nickname, handle, or brand name, formed from “hog” + “steer.” It has no widely accepted dictionary meaning.","zh":"（罕见／非标准用法）由“hog（猪）”+“steer（阉公牛／小公牛）”组合而成的自造词，主要用作昵称、账号名或品牌名，并没有公认的词典义。"},"examples":[{"en":"Online, he goes by the name “hogsteer.”","zh":"在网上，他用“hogsteer”这个名字。"},{"en":"I couldn’t find a standard definition for “hogsteer” in major dictionaries.","zh":"我在主要词典里找不到“hogsteer”的标准释义。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literal interpretation, very rare) A steer (young castrated male cow) associated with hogs or raised/fed in a way similar to hogs (for quick fattening).","zh":"（按字面理解，极罕见）与猪有关的阉公牛，或指像养猪一样方式饲养／催肥的阉公牛。"},"examples":[{"en":"On some farms, people might loosely describe a fast-fattened steer as a “hogsteer,” but this isn’t standard English.","zh":"在某些农场语境里，有人可能会把催肥很快的阉公牛随口叫作“hogsteer”，但这不是标准英语。"}]}],"synonyms":["username","nickname","handle","coinage"],"phonetic":"/ˈhɑɡstɪr/","extraExplanation":["“hogsteer”更像是把两个常见词拼在一起形成的新词。英语里这类合成词通常会写成有连字符的形式（hog-steer）或分开写（hog steer），但是否成立为“固定词”取决于是否被大量、稳定地使用。","如果你是在特定文章、游戏、方言或行业语境里看到它，告诉我原句或上下文，我可以更准确判断它在该语境中的含义。"]}
{"word":"hogsty","summary":{"en":"Hogsty means a pigpen, and more commonly a very dirty or messy place.","zh":"hogsty 指“猪圈”，更常用来比喻“非常脏乱的地方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dirty or very messy place, like a pigpen (often used insultingly or humorously)","zh":"（像猪圈一样的）肮脏、乱糟糟的地方（常带侮辱或调侃语气）"},"examples":[{"en":"Clean your room—it looks like a hogsty.","zh":"把你房间收拾一下——看起来像猪圈一样乱。"},{"en":"After the party, the kitchen was a total hogsty.","zh":"聚会结束后，厨房简直像猪圈一样脏乱。"}]},{"partOfSpeech":"n.","definition":{"en":"a pen or shed where hogs (pigs) are kept; a pigsty","zh":"养猪的圈舍；猪圈"},"examples":[{"en":"The farmer repaired the hogsty before winter.","zh":"农场主在冬天前修好了猪圈。"},{"en":"They walked past the hogsty on the way to the barn.","zh":"他们去谷仓的路上经过了猪圈。"}]}],"synonyms":["pigsty","sty","mess","dump"],"phonetic":"/ˈhɔɡˌstaɪ/","extraExplanation":["“hogsty”由“hog（猪）+ sty（畜栏/圈）”构成，字面意思就是“猪圈”。在现代日常口语里更常用作比喻，形容某个地方非常脏、非常乱。语气通常比较强，可能让人不舒服；如果是对别人家或别人的空间这么说，要注意礼貌。","更常见、更中性的说法有：messy（乱）、untidy（不整洁）、a mess（一团糟）。更口语/更夸张的还有：a pigsty（更常见）、a dump（很脏的地方，语气也可能偏刻薄）。"]}
{"word":"hogsucker","summary":{"en":"“Hogsucker” usually means a bottom-feeding freshwater sucker fish in North America; it can also be an offensive insult in informal speech.","zh":"“hogsucker”通常指北美常见的淡水吸口鱼（俗称）；在口语里也可能作为带冒犯的骂人话使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(North American) A common name for several freshwater fish that feed by sucking up food from the bottom, especially suckers (family Catostomidae), such as the white sucker.","zh":"（北美用语）多指几种淡水“吸口鱼/鲴鱼类”的俗称，尤指鲴科（Catostomidae）的吸口鱼，如白鲴（white sucker）。"},"examples":[{"en":"We caught a hogsucker in the creek and let it go.","zh":"我们在小溪里钓到一条 hogsucker（吸口鱼），又把它放生了。"},{"en":"Some locals call almost any sucker fish a hogsucker.","zh":"有些当地人几乎把所有“吸口鱼”都叫 hogsucker。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, offensive) A rude insult aimed at someone considered greedy, unpleasant, or low-class.","zh":"（非正式，用语粗鲁且带冒犯）用来骂人，暗指对方贪婪、讨厌或“没素质”。"},"examples":[{"en":"He called the referee a hogsucker and got ejected.","zh":"他骂裁判是 hogsucker，结果被罚出场。"},{"en":"Avoid using words like “hogsucker” as an insult—it can easily start a fight.","zh":"别用像“hogsucker”这种词骂人——很容易引发冲突。"}]}],"synonyms":["sucker (fish)","catostomid","bottom-feeder","redhorse (sometimes, regional)"],"phonetic":"/ˈhɑɡˌsʌkɚ/","extraExplanation":["这个词更常见于美国部分地区的口语（尤其靠近河流、湖泊的钓鱼语境）。作为鱼名时通常不算正式学名，用在对话里更自然。","作骂人话时语气很难听，带有“把人比作猪+吸口鱼”的贬义联想；在公共场合或正式写作中应避免。"]}
{"word":"hogtie","summary":{"en":"“Hogtie” means to tie someone’s hands and feet together, or figuratively to severely restrict someone’s actions.","zh":"“hogtie”指把人的手脚反绑在一起；也可比喻为强力限制、束缚某人的行动。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tie a person’s hands and feet together, usually behind the back, so they cannot move easily","zh":"把人的手脚绑在一起（通常反绑在身后），使其难以行动"},"examples":[{"en":"The police said the victim had been hogtied with rope.","zh":"警方称受害者被用绳子反绑住了手脚。"},{"en":"In the movie, the cowboy hogtied the outlaw and put him on a horse.","zh":"在电影里，牛仔把歹徒反绑起来并放到马背上。"}]},{"partOfSpeech":"vt.","definition":{"en":"to severely restrict, control, or prevent someone from acting freely (often used in politics, work, or rules)","zh":"（比喻）严厉限制、束缚（某人）的行动或自由（常用于政治、工作或规章语境）"},"examples":[{"en":"Too many rules can hogtie a team’s creativity.","zh":"规章太多会严重束缚团队的创造力。"},{"en":"The new policy hogtied small businesses with extra paperwork.","zh":"新政策用额外的手续把小企业“绑”得动弹不得。"}]}],"synonyms":["bind","tie up","restrain","immobilize","shackle","hamstring (figurative)"],"phonetic":"/ˈhɔɡ.taɪ/","extraExplanation":["“hogtie”原指像捆猪（hog）一样捆住四肢，常见于美国西部牛仔文化和影视作品中。现实语境里它是较强烈、带暴力感的词；比喻用法也带“被强力束缚”的负面语气。"]}
{"word":"hogtied","summary":{"en":"Hogtied means bound very tightly—typically with hands and feet tied together—or to tie someone that way.","zh":"hogtied 指被五花大绑（手脚被紧紧捆住），也可作动词表示把人这样捆绑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Tied very tightly, especially with someone’s hands and feet bound (often behind their back), so they cannot move.","zh":"（尤指把人）捆得很紧，通常手脚被绑住（常在身后），以致无法行动。"},"examples":[{"en":"The suspect was found hogtied in the back room.","zh":"嫌疑人被发现被五花大绑在后屋。"},{"en":"In the movie, the hero wakes up hogtied and tries to escape.","zh":"在电影里，主角醒来时被五花大绑，努力想逃脱。"}]},{"partOfSpeech":"vt.","definition":{"en":"To tie someone’s hands and feet together very tightly so they cannot move.","zh":"把某人的手脚紧紧绑在一起，使其无法行动。"},"examples":[{"en":"The kidnappers hogtied him and left him in the barn.","zh":"绑匪把他五花大绑，丢在谷仓里。"},{"en":"Police say the victim was hogtied with rope.","zh":"警方表示受害者被绳子五花大绑。"}]}],"synonyms":["bound","tied up","restrained","trussed (up)"],"phonetic":"/ˈhɔɡˌtaɪd/","extraExplanation":["“hogtie”原指对猪的捆绑方式：把猪的脚捆在一起以便搬运或控制。后来引申到对人的捆绑，因此带有强烈的暴力、犯罪或胁迫语境。","在日常对话中，这个词多见于新闻、影视、犯罪小说；真实语境里描述具体捆绑方式时使用，避免随意开玩笑使用，以免显得不敏感。","也有比喻用法（较口语）：表示“被规则/制度限制得动弹不得”，如“budget cuts hogtied the project”（预算削减把项目束缚住了）。"]}
{"word":"hogtieing","summary":{"en":"“Hogtieing” (more commonly spelled “hogtying”) means tying someone’s hands and feet together, or the act of doing so.","zh":"“hogtieing”（更常见拼法 hogtying）指把人的手脚捆在一起，或指这种捆绑行为。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to tie someone’s or something’s hands and feet together (often behind the back), so they cannot move easily","zh":"把人或动物的手脚捆在一起（常捆在背后），使其难以行动"},"examples":[{"en":"The suspect claimed he was hogtying the man only to stop him from hurting anyone.","zh":"嫌疑人称他把那人“猪捆”起来只是为了阻止他伤人。"},{"en":"In some movies, the hero is shown hogtying a villain with a rope.","zh":"在一些电影里，英雄会用绳子把反派“猪捆”起来。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of tying hands and feet together in this way","zh":"这种“把手脚捆在一起”的行为；猪捆式捆绑"},"examples":[{"en":"The report criticized the practice of hogtying during arrests.","zh":"报告批评了逮捕过程中使用“猪捆”式捆绑的做法。"}]}],"synonyms":["restraining","binding","tying up"],"phonetic":"/ˈhɔɡˌtaɪ.ɪŋ/","extraExplanation":["“hogtie”原指像捆猪一样把四肢绑在一起（hog=猪，tie=捆）。现代英语里多用于描述对人的强制捆绑，常见于新闻、法律与影视语境。","拼写提示：更常见的拼法是 hogtying（一个 y）。你输入的 hogtieing 也能被理解为“hogtie”的现在分词/动名词，但不如 hogtying 常见。"]}
{"word":"hogties","summary":{"en":"Hogtie means to bind someone’s arms and legs together (or, figuratively, to severely restrict someone).","zh":"Hogtie 指把人手脚捆在一起（也可比喻“使……束手束脚、严重限制”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to tie someone’s arms and legs together (often behind their back), so they cannot move easily; to restrain tightly","zh":"把某人的手脚捆在一起（常指反绑在身后），使其难以行动；严密束缚"},"examples":[{"en":"The police said the victim was hogtied with rope.","zh":"警方表示受害者被绳子反绑（手脚捆在一起）。"},{"en":"In the movie, the hero gets hogtied but manages to escape.","zh":"电影里，主角被反绑捆住，但还是设法逃脱了。"},{"en":"The new rules hogtie managers and slow down decisions.","zh":"新规定把经理们束手束脚，拖慢了决策。"}]},{"partOfSpeech":"n.","definition":{"en":"a way of tying or the position of being tied with arms and legs bound together","zh":"手脚捆在一起的绑法；（被）反绑捆住的状态"},"examples":[{"en":"The suspect was found in a hogtie.","zh":"嫌疑人被发现时处于手脚捆住的状态。"}]}],"synonyms":["bind","tie up","restrain","truss up","immobilize"],"phonetic":"/ˈhɔɡˌtaɪ/","extraExplanation":["“hogtie”字面意思是“像捆猪那样捆绑”。过去在处理牲畜（尤其是猪）时，会把四肢绑在一起以便搬运或控制；后来这个说法被引申到对人的捆绑，也常出现在犯罪报道或西部片/动作片的语境中。","比喻用法很常见：hogtie something/someone 表示“把……束缚得无法施展”，例如 hogtie the economy（束缚经济）、hogtie a team’s options（限制团队选择）。"]}
{"word":"hogtiing","summary":{"en":"Hogtying means tying someone’s (or an animal’s) hands and feet together so they can’t move; hogtie is the verb form.","zh":"Hogtying 指把人（或动物）的手脚捆在一起使其难以行动；动词形式是 hogtie。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tie a person’s or animal’s hands and feet together (often behind the back), usually with rope or restraints, so they cannot move easily","zh":"把人或动物的手脚捆在一起（常在背后），通常用绳子或束缚带，使其难以行动"},"examples":[{"en":"The police said the suspect was hogtied and left in the garage.","zh":"警方表示嫌疑人被“猪绑式”捆住并被丢在车库里。"},{"en":"In the movie, the cowboy hogtied the thief with a rope.","zh":"在电影里，牛仔用绳子把小偷“猪绑式”捆起来。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or method of tying someone’s or an animal’s hands and feet together","zh":"“猪绑式捆绑”的行为或方法（把手脚捆在一起）"},"examples":[{"en":"Hogtying is sometimes shown in old Western stories.","zh":"在一些老式西部故事里有时会出现猪绑式捆绑。"}]}],"synonyms":["bind","tie up","restrain","truss up"],"phonetic":"/ˈhɔɡˌtaɪ.ɪŋ/","extraExplanation":["你输入的拼写“hogtiing”更常见的正确拼写是 **hogtying**（名词）或 **hogtie**（动词）。","这个词来自对“hog（猪）”的捆绑方式的比喻，用来形容把四肢捆在一起的姿势。该动作在现实中可能造成呼吸困难或受伤，在新闻与执法语境里常带有强烈的负面含义。学习时注意语气与场合，避免随意开玩笑使用。"]}
{"word":"hogton","summary":{"en":"“Hogton” is not a common English word; it’s most likely a rare name (surname/place) or a misspelling of a similar name.","zh":"“Hogton”不是常见英语词；更可能是少见的专有名称（姓氏/地名）或相近名称的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (rare): likely used as a surname or place name. It is not a common standard English vocabulary word.","zh":"专有名词（较少见）：多半用作姓氏或地名；不是常见的标准英语词汇。"},"examples":[{"en":"I found the name Hogton in an old record, but I’m not sure where it comes from.","zh":"我在一份旧档案里看到了 Hogton 这个名字，但不确定它的来源。"},{"en":"Does “Hogton” refer to a family name or a town?","zh":"“Hogton”指的是姓氏还是某个城镇？"}]}],"synonyms":["(no direct synonyms; proper names usually don’t have synonyms)"],"phonetic":"/ˈhɑːɡtən/","extraExplanation":["“Hogton”在常用词典里通常查不到，比较可能是：①拼写变体/误拼（如 Hoghton、Houghton、Hogdon 等相近姓氏或地名）；②某个小地名、家族姓氏、虚构作品中的名称；③把 hog（猪）+ -ton（城镇/村庄后缀）拼起来的自造词。","如果你是想表达“某个地方/城镇”，英语里常见的地名后缀 -ton 意为“城镇、村落”（如 Boston, Princeton）。但 hog + ton 这种组合并不是固定词。","你可以告诉我它出现的上下文（句子、国家/地区、是否是人名/地名/游戏或小说设定），我可以更准确地判断它指什么，或帮你找到最可能的正确拼写。"]}
{"word":"Hogtown","summary":{"en":"A humorous nickname for Toronto; sometimes any hog-related town.","zh":"多伦多的调侃式别称；有时泛指与养猪/猪肉产业相关的城镇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nickname for Toronto, Canada, especially used humorously or historically.","zh":"（尤指带点幽默或历史色彩的）加拿大多伦多的绰号。"},"examples":[{"en":"He moved to Hogtown for work and ended up loving the food scene.","zh":"他为了工作搬到“猪城”（多伦多），结果爱上了那里的美食。"},{"en":"Old articles sometimes call Toronto “Hogtown” because of its meatpacking past.","zh":"一些旧文章会把多伦多称为“猪城”，因为它过去有肉类加工产业。"}]},{"partOfSpeech":"n.","definition":{"en":"Informally, any town associated with hog farming or pork processing (less common; often playful).","zh":"（不太常见，常带玩笑口吻）泛指与养猪或猪肉加工有关的城镇。"},"examples":[{"en":"The locals jokingly call their hometown Hogtown after the new pork plant opened.","zh":"新猪肉加工厂开张后，当地人开玩笑把家乡叫作“猪城”。"}]}],"synonyms":["Toronto","T.O.","The Big Smoke"],"phonetic":"/ˈhɔɡ.taʊn/","extraExplanation":["在加拿大语境里，Hogtown最常指多伦多。它是一种“外号/昵称”，语气通常轻松、调侃，有时带一点历史怀旧感。","如果你在新闻或旅游语境看到它，通常不需要直译成“猪城”，理解为“多伦多的别称”即可。"],"etymology":"来自 hog（猪）+ town（城镇）。用来指多伦多的说法与其19—20世纪早期发达的生猪运输与屠宰、肉类加工产业有关，因此得名并流行于报刊与民间口语中。","mnemonic":["hog=猪，town=城镇：把两个词拼起来就能记住“和猪有关的城镇/外号”。","记忆钩子：多伦多早期有猪肉加工产业→所以被叫“Hogtown”。"]}
{"word":"hogtying","summary":{"en":"Hogtying means tying someone’s hands and feet together (or the act of doing so).","zh":"Hogtying 指把人手脚捆在一起，或这种捆绑行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of tying someone’s hands and feet together (often behind the back), usually with a rope","zh":"（hogtying）把人的手脚捆在一起（常在背后），通常用绳子捆绑的行为"},"examples":[{"en":"The suspect was hogtying the victim when the neighbors called the police.","zh":"邻居报警时，嫌疑人正在把受害者手脚捆在一起。"},{"en":"In movies, hogtying is sometimes shown, but in real life it can be very dangerous.","zh":"电影里有时会出现这种捆绑方式，但在现实中它可能非常危险。"}]},{"partOfSpeech":"v.","definition":{"en":"to tie someone’s hands and feet together, usually with rope","zh":"（hogtie）把某人的手脚捆在一起，通常用绳子"},"examples":[{"en":"They tried to hogtie him, but he managed to slip free.","zh":"他们想把他手脚捆住，但他设法挣脱了。"},{"en":"The guide warned everyone never to hogtie a person because it can restrict breathing.","zh":"向导警告大家千万不要用这种方式捆人，因为可能影响呼吸。"}]}],"synonyms":["tie up","bind","restrain","truss (up)"],"phonetic":"/ˈhɔɡˌtaɪ.ɪŋ/","extraExplanation":["“hogtie / hogtying”原指像捆猪（hog）那样把四肢捆在一起，因此带有强烈的暴力与控制意味。日常英语中多见于犯罪、执法争议、影视或新闻语境。","在一些地区的执法与急救培训中会强调：这种捆绑可能导致体位性窒息（positional asphyxia）等风险，因此属于高危险行为。"]}
{"word":"hogward","summary":{"en":"Hogwarts is the fictional school of magic in the Harry Potter series.","zh":"Hogwarts（霍格沃茨）是《哈利·波特》系列中的虚构魔法学校。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fictional boarding school for young witches and wizards in the Harry Potter series, located in Scotland.","zh":"《哈利·波特》系列中的虚构寄宿学校，培养年轻的女巫和男巫，地点设定在苏格兰。"},"examples":[{"en":"Harry receives his letter and goes to Hogwarts.","zh":"哈利收到了录取信，前往霍格沃茨。"},{"en":"Students at Hogwarts are sorted into four houses.","zh":"霍格沃茨的学生会被分到四个学院。"}]}],"synonyms":["Hogwarts School of Witchcraft and Wizardry"],"phonetic":"/ˈhɑɡwɔrts/","extraExplanation":["你输入的“hogward”更常见的拼写是 **Hogwarts**（霍格沃茨）。在英文里它是一个专有名词（学校名称），通常不加冠词，直接说“at Hogwarts / to Hogwarts”。","Hogwarts 出自 J.K. Rowling 的《Harry Potter》作品。英语读者常把它当作“魔法世界教育”的代表符号，用来比喻“一个神奇、令人向往的地方”（例如：This place feels like Hogwarts.）。"]}
{"word":"Hogwarts","summary":{"en":"Hogwarts is the fictional school of magic in the Harry Potter series; it can also mean any place that feels like a magical learning world.","zh":"Hogwarts 指《哈利·波特》中的虚构魔法学校；也可引申为任何像“魔法学习世界”般令人惊奇的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fictional British school of magic in J.K. Rowling’s Harry Potter series, officially called Hogwarts School of Witchcraft and Wizardry.","zh":"J.K. 罗琳《哈利·波特》系列中的虚构英国魔法学校，全名为“霍格沃茨魔法学校”（Hogwarts School of Witchcraft and Wizardry）。"},"examples":[{"en":"Harry receives his letter and learns he will attend Hogwarts.","zh":"哈利收到录取信，得知自己将去霍格沃茨上学。"},{"en":"At Hogwarts, students are sorted into four houses.","zh":"在霍格沃茨，学生会被分到四个学院。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, any place (real or imagined) that feels like a magical school or a special, wonder-filled learning environment.","zh":"引申义：指任何让人感觉像“魔法学校”的地方（真实或想象的），强调充满奇妙与学习氛围的环境。"},"examples":[{"en":"The science camp felt like Hogwarts for young inventors.","zh":"那个科学营对小小发明家来说就像“霍格沃茨”。"},{"en":"For her, the library was a kind of Hogwarts—quiet, mysterious, and full of discovery.","zh":"对她而言，图书馆像一种“霍格沃茨”——安静、神秘、充满发现。"}]}],"synonyms":["Hogwarts School of Witchcraft and Wizardry","(figurative) magical school","wizarding school"],"phonetic":"/ˈhɑɡ.wɔrts/","extraExplanation":["“Hogwarts”是专有名词，通常不加冠词（不说 *the Hogwarts*），也一般不加复数。","在原著与影视中，霍格沃茨位于苏格兰高地附近；校内有城堡、移动楼梯、学院制度（Gryffindor / Slytherin / Ravenclaw / Hufflepuff）等设定。","发音注意：重音在第一音节 HOG-，末尾 -warts 读作 /wɔrts/，不要读成 /wɑrts/ 那种“疣”的感觉。"]}
{"word":"hogwash","summary":{"en":"“Hogwash” means strong, informal “nonsense” or “rubbish,” and sometimes (less commonly) the verb “to talk nonsense.”","zh":"“hogwash”表示强烈、口语的“胡说八道/无稽之谈”，较少见时也可作动词表示“胡说”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nonsense; something you believe is untrue or meaningless (often said strongly).","zh":"胡说八道；无稽之谈（常带强烈否定语气）。"},"examples":[{"en":"That claim that phones ruin your eyesight is hogwash.","zh":"说手机一定会毁掉视力的说法是胡扯。"},{"en":"Don’t listen to him—most of what he says is hogwash.","zh":"别听他的——他讲的大多是废话。"}]},{"partOfSpeech":"v.","definition":{"en":"To talk nonsense; to say things that are not true (informal).","zh":"胡说；瞎扯（非正式）。"},"examples":[{"en":"He kept hogwashing about how he did all the work.","zh":"他一直在瞎吹说所有活儿都是他干的。"}]}],"synonyms":["nonsense","rubbish","baloney","bull","garbage"],"phonetic":"/ˈhɔɡˌwɑʃ/","extraExplanation":["“hogwash”原意和“喂猪的泔水/猪食用的稀粥”有关，因此引申为“像猪食一样不值一提的东西”，语气往往很直接、带点不耐烦。","在正式写作中不太常用；更正式的替代说法有“nonsense”“rubbish”“baloney”(口语)、“falsehood”(更正式)等。"]}
{"word":"hogwashes","summary":{"en":"“Hogwashes” usually means multiple pieces of nonsense or lies (plural of “hogwash”); rarely, it can be the verb form meaning “talks nonsense/misleads.”","zh":"“hogwashes”通常是“hogwash”的复数，表示多种胡说八道或谎言；少见情况下也可作动词第三人称，意为“胡扯/误导”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “hogwash”: statements or ideas that are nonsense, lies, or not worth taking seriously.","zh":"“hogwash”的复数：胡说八道、无稽之谈、谎言（不值得当真）。"},"examples":[{"en":"His excuses are just hogwashes—don’t believe them.","zh":"他的借口就是一堆胡说八道——别信。"},{"en":"The internet is full of hogwashes about “miracle” cures.","zh":"网上充斥着关于“神奇疗法”的无稽之谈。"}]},{"partOfSpeech":"vt.","definition":{"en":"Third-person singular of the rare verb “hogwash”: to talk nonsense or mislead people with nonsense.","zh":"（较少见）动词“hogwash”的第三人称单数：胡扯；用无稽之谈误导他人。"},"examples":[{"en":"He hogwashes whenever he’s asked for evidence.","zh":"只要一被要求拿证据，他就开始胡扯。"},{"en":"The ad hogwashes customers with fake science.","zh":"这则广告用伪科学来忽悠顾客。"}]}],"synonyms":["nonsense","rubbish","baloney","bull","garbage","rot"],"phonetic":"/ˈhɔɡˌwɑʃɪz/","extraExplanation":["“hogwash”原指喂猪的泔水、猪食；后来引申为“像泔水一样不值得入口/不值得相信的东西”，因此在口语里常用来表示“胡说八道”。","用法提示：更常见的搭配是单数不可数的“hogwash”（That’s hogwash! 这是胡扯！）。复数“hogwashes”多用于强调“很多种/很多条胡话”。"]}
{"word":"hogweed","summary":{"en":"Hogweed is a tall flowering plant; some types (especially giant hogweed) can seriously irritate or burn skin.","zh":"Hogweed 指一种高大开花植物；某些类型（尤其巨型豕草）会严重刺激甚至灼伤皮肤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall plant with large leaves and umbrella-shaped clusters of small white flowers (some species can cause painful skin irritation)","zh":"一种高大的草本植物，叶子很大，开伞状的小白花（某些品种会导致皮肤刺激甚至灼伤）"},"examples":[{"en":"Be careful near hogweed—its sap can irritate your skin.","zh":"靠近豕草（hogweed）要小心——它的汁液可能会刺激皮肤。"},{"en":"The local council is removing hogweed from the riverbank.","zh":"当地市政部门正在清除河岸边的豕草。"}]}],"synonyms":["cow parsnip (often a different, less dangerous plant)","giant hogweed (a specific species)"],"phonetic":"/ˈhɔɡˌwiːd/","extraExplanation":["“hogweed”在日常语境中常指具有危险性的“巨型豕草”(giant hogweed)。它的汁液含有光敏物质，接触后在阳光照射下可能出现严重皮炎或水疱，因此在英美等地常被当作入侵植物治理。","词源上，“hog-”与“猪”有关，早期可能因为这种植物粗壮、在野外常见，或曾被认为可作猪饲料而得名。","在科普或新闻中你可能会看到相关词：giant hogweed（巨型豕草）、invasive species（入侵物种）、sap（汁液）、skin burn / rash（皮肤灼伤/皮疹）。"]}
{"word":"hogweeds","summary":{"en":"Hogweeds are tall wild plants with white umbrella-like flowers; some varieties can harm skin.","zh":"hogweeds 指高大的野生猪草类植物，开白色伞状花；某些品种会伤害皮肤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall wild plant (hogweed) in the carrot family, with large leaves and white umbrella-shaped flower clusters; some types (especially giant hogweed) can irritate or burn skin","zh":"一种野生高大植物（hogweed，伞形科/芹科），叶子很大、白色伞状花序；某些种类（尤其是巨型猪草 giant hogweed）会刺激皮肤甚至造成灼伤"},"examples":[{"en":"Be careful near hogweeds—some kinds can cause painful skin reactions.","zh":"靠近猪草要小心——有些品种会引起皮肤疼痛反应。"},{"en":"The park removed hogweeds to stop them from spreading along the river.","zh":"公园清除了猪草，防止它沿着河流扩散。"}]}],"synonyms":["hogweed","giant hogweed","cow parsnip (related plant)"],"phonetic":"/ˈhɔɡˌwid/","extraExplanation":["“hogweed”通常指Heracleum属的几种植物。在北美和欧洲，日常语境里常见的安全提醒多指“giant hogweed（巨型猪草）”，其汁液遇到阳光可能引发严重的光敏性皮炎；如果怀疑接触到，通常建议尽快清洗并避免日晒，必要时寻求医疗帮助。","词形方面：单数hogweed，复数hogweeds。很多时候也会直接用专有名词“giant hogweed”。"]}
{"word":"hogwort","summary":{"en":"Hogwort is a rare word meaning a plant name used in some places, loosely referring to weeds associated with pigs.","zh":"hogwort是个较罕见的词，作为某些地区的植物俗名，泛指与猪有关的野草/杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A common name for various wild plants or weeds associated with hogs (for example, plants pigs may eat).","zh":"（罕见）若干种与猪有关的野生植物/杂草的俗名（例如猪可能会吃的植物）。"},"examples":[{"en":"In older rural writing, “hogwort” could refer to a rough weed growing near farms.","zh":"在较早的乡村写作中，“hogwort”有时指农场附近长的粗野杂草。"},{"en":"The word “hogwort” isn’t common today, so the exact plant may depend on the region.","zh":"“hogwort”如今并不常见，因此具体指哪种植物常常因地区而异。"}]}],"synonyms":["hogweed (often what people mean)","weed (general meaning)"],"phonetic":"/ˈhɔɡˌwɝt/","extraExplanation":["“hogwort”并不是现代英语里很常用、很固定的植物名称，很多时候属于地方性俗称（common name），不同地区可能指不同的“杂草”。如果你是在查一种具体植物，最好提供上下文（出现的国家/地区、图片、附近还有哪些植物特征等）。","很多学习者会把“hogwort”与《哈利·波特》里的“Hogwarts”混淆；如果你想写的是学校名称，正确拼写是Hogwarts。","如果你的目标词其实是更常见的“hogweed”（猪草/毒芹样的大型野草，部分种类会刺激皮肤），拼写是hogweed，不是hogwort。"]}
{"word":"hogyard","summary":{"en":"A hogyard is a fenced or enclosed area where pigs are kept.","zh":"hogyard 指养猪用的围栏或圈舍区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enclosed area or pen where hogs (pigs) are kept, fed, or raised; a pigpen.","zh":"（养猪用的）猪圈；猪栏；养猪场里的围栏区域。"},"examples":[{"en":"The farmer walked to the hogyard to feed the pigs.","zh":"农夫走到猪圈去喂猪。"},{"en":"The smell near the hogyard was strong after the rain.","zh":"下雨后，猪圈附近的气味很重。"}]}],"synonyms":["pigpen","pigsty","hog pen","pen"],"phonetic":"/ˈhɔɡˌjɑrd/","extraExplanation":["“hogyard”多写作两个词“hog yard”，也常用更常见的“pigpen / pigsty”。在农业语境中更常见；日常口语里通常说“pigpen”。"]}

