{"word":"hoh","summary":{"en":"“Hoh!” is an interjection meaning “ha!/huh?”, often showing scorn or disbelief.","zh":"“Hoh!” 是感叹词，类似“哈/哼？”，常带轻蔑或不相信的语气。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show surprise, disbelief, or (more often) scornful laughter—similar to “ha!” or “huh!”","zh":"（感叹词）用于表示惊讶、不相信，或（更常见）带轻蔑意味的笑声；类似“哈！”或“哼？”"},"examples":[{"en":"Hoh! You really think that plan will work?","zh":"哼？你真的觉得那个计划会成功吗？"},{"en":"“Hoh,” he said, turning away, as if the idea wasn’t worth discussing.","zh":"“哼，”他说着转过身去，仿佛这个想法不值得讨论。"}]}],"synonyms":["ha","huh","hm","pah"],"phonetic":"/hoʊ/","extraExplanation":["“hoh!” 在现代口语中不常见，更常出现在小说、戏剧或较“古风/文学化”的对白里，用来表现人物的轻蔑、讥讽或不以为然。日常表达中更常用 “ha!”, “huh?”, “yeah, right.” 等。"]}
{"word":"hohe","summary":{"en":"“hohe” is a German form of “hoch,” meaning “high,” commonly used before a noun (e.g., “hohe Preise” = high prices).","zh":"“hohe”是德语“hoch（高的）”的变形形式，常用于名词前，表示“高的/很高的”（如“hohe Preise”=物价高）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(German) an inflected form of the adjective “hoch,” meaning “high” (often used before a noun, e.g., “hohe Preise” = “high prices”).","zh":"（德语）形容词“hoch（高的）”的变形形式之一，常用于名词前作定语，如“hohe Preise”表示“高价格/物价高”。"},"examples":[{"en":"German: hohe Preise are making it hard to save money. (Meaning: high prices.)","zh":"德语：hohe Preise 让存钱变得更难。（意思：物价高/高价格。）"},{"en":"German: Sie lebt auf einer hohen Etage. (Meaning: a high floor.)","zh":"德语：Sie lebt auf einer hohen Etage.（意思：住在较高的楼层。）"},{"en":"German: Wir haben hohe Erwartungen an das Projekt. (Meaning: high expectations.)","zh":"德语：Wir haben hohe Erwartungen an das Projekt.（意思：对项目有很高的期待。）"}]}],"synonyms":["hoch","erhöht","groß (figurative)"],"phonetic":"/ˈhoʊ.ə/","extraExplanation":["“hohe”来自形容词“hoch（高的）”的词形变化：在德语里，形容词会根据名词的性别、数以及冠词（der/die/das, ein/eine 等）发生词尾变化。常见搭配如：hohe Preise（高价格）、hohe Qualität（高质量）、hohe Erwartungen（高期待）。如果你告诉我它后面接的名词或前面有没有冠词，我可以帮你判断这是哪一种变格。"]}
{"word":"hohenstaufen","summary":{"en":"Hohenstaufen refers to a major medieval German dynasty (the Staufer) and also the German hill/castle site that gave the family its name.","zh":"Hohenstaufen指中世纪德国重要的霍亨斯陶芬王朝（施陶芬家族），也可指该家族得名的德国山丘/古堡所在地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medieval German royal dynasty (also called the Staufer) that ruled the Holy Roman Empire mainly in the 12th–13th centuries.","zh":"霍亨斯陶芬王朝（亦称“施陶芬家族”），中世纪德国的王室/贵族家族，主要在12—13世纪统治神圣罗马帝国。"},"examples":[{"en":"Frederick I (Barbarossa) was a famous emperor from the Hohenstaufen dynasty.","zh":"腓特烈一世（“红胡子”）是霍亨斯陶芬王朝著名的皇帝。"},{"en":"The conflict between the Hohenstaufen rulers and the papacy shaped much of Italian politics.","zh":"霍亨斯陶芬统治者与教廷的冲突深刻影响了意大利的政治格局。"}]},{"partOfSpeech":"n.","definition":{"en":"a mountain (and historic castle site) in southwestern Germany, from which the Hohenstaufen family took its name.","zh":"霍亨斯陶芬山（及其古堡遗址），位于德国西南部；该家族以此地名为姓。"},"examples":[{"en":"The name Hohenstaufen originally comes from a castle on a hill in Swabia.","zh":"“Hohenstaufen”这个名字最初源自施瓦本地区山上的一座城堡。"},{"en":"Tourists sometimes visit Hohenstaufen for views and local history.","zh":"游客有时会去霍亨斯陶芬山观景并了解当地历史。"}]}],"synonyms":["Staufer","House of Hohenstaufen"],"phonetic":"/ˌhoʊənˈʃtaʊfən/","extraExplanation":["“Hohen-”在德语里常有“高的”之意；“Staufen”多被认为与地名/山丘有关，因此整体可理解为“高处的施陶芬（之地）”。","英语史学写作里常见拼写为 Hohenstaufen，也常用同义称呼 Staufer（施陶芬家族）。","这个王朝的重要人物包括腓特烈一世（Barbarossa）和腓特烈二世；他们与教皇之间的权力斗争，是理解中世纪欧洲政教关系的关键线索。"]}
{"word":"hohenzollern","summary":{"en":"Hohenzollern usually refers to the German royal family that ruled Prussia and later the German Empire; it can also refer to places like Hohenzollern Castle.","zh":"Hohenzollern 通常指统治普鲁士并后来领导德意志帝国的德国王室（霍亨索伦家族/王朝）；有时也指相关地点，如霍亨索伦城堡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German royal dynasty (the House of Hohenzollern) that ruled Brandenburg-Prussia and later the German Empire; its kings and emperors included Frederick the Great and Kaiser Wilhelm I & II","zh":"德国的一个王室/贵族王朝（霍亨索伦家族），曾统治勃兰登堡-普鲁士，并在后期领导德意志帝国；代表人物包括腓特烈大帝以及德皇威廉一世、威廉二世等"},"examples":[{"en":"The Hohenzollerns played a central role in the rise of Prussia as a European power.","zh":"霍亨索伦家族在普鲁士崛起为欧洲强国的过程中扮演了核心角色。"},{"en":"After World War I, the Hohenzollern monarchy ended in Germany.","zh":"第一次世界大战后，德国的霍亨索伦王朝结束了君主制统治。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a name used for places connected to this dynasty, especially Hohenzollern Castle in southern Germany","zh":"（较少见）与该王朝相关的地名用法，尤其指德国南部著名的霍亨索伦城堡"},"examples":[{"en":"We visited Hohenzollern Castle on a day trip from Stuttgart.","zh":"我们从斯图加特出发一日游，参观了霍亨索伦城堡。"},{"en":"The castle of Hohenzollern is often pictured on postcards for its dramatic hilltop setting.","zh":"霍亨索伦城堡因其戏剧性的山顶位置，常出现在明信片上。"}]}],"synonyms":["House of Hohenzollern","Prussian dynasty","Kaiser (context-related)"],"phonetic":"ˌhoʊənˈtsɔlɚn","extraExplanation":["“Hohenzollern”本质上是专有名词，常见于历史与政治语境。英语里多指“霍亨索伦家族/王朝”，与“Prussia（普鲁士）”“German Empire（德意志帝国）”“Kaiser（德皇）”等词经常一起出现。","读音上，英语会按拼写近似发音；它源自德语地名/家族名，因此在不同英语使用者之间可能有轻微差异。"]}
{"word":"hohenzollernism","summary":{"en":"Hohenzollernism means an ideology or attitude linked to the Hohenzollern monarchy, often with connotations of Prussian authoritarian militarism.","zh":"Hohenzollernism 指与霍亨索伦王朝相关的政治思想或立场，常含“普鲁士式专制与军国主义”的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political attitude or doctrine associated with the Hohenzollern dynasty of Prussia/Germany, often implying loyalty to that monarchy and (in many historical discussions) Prussian-style authoritarianism and militarism","zh":"“霍亨索伦主义”：与普鲁士/德国的霍亨索伦王朝相关的政治立场或思想；常指对该王室的拥护，并在许多历史语境中带有“普鲁士式的专制与军国主义”含义"},"examples":[{"en":"Some writers in the early 1900s blamed Hohenzollernism for encouraging aggressive nationalism.","zh":"一些20世纪初的作者把“霍亨索伦主义”视为助长侵略性民族主义的原因之一。"},{"en":"The article contrasts liberal reform with Hohenzollernism and the power of the old Prussian elite.","zh":"这篇文章把自由改革与“霍亨索伦主义”以及旧普鲁士精英的权力作了对比。"}]}],"synonyms":["Prussian militarism","monarchism (in this context)","German imperialism (historical context)"],"phonetic":"/ˌhoʊənˈzɔlərˌnɪzəm/","extraExplanation":["这个词多见于历史与政治评论写作（尤其讨论德意志帝国时期、第一次世界大战前后或战间期的舆论）。它通常不是“中性学术标签”，而常带批评色彩，用来概括普鲁士宫廷与军官集团的保守君主制、等级秩序与军国主义倾向。","词形：Hohenzollern（霍亨索伦，王朝名）+ -ism（……主义）。在英文中，-ism 常用来把某个人名/团体名变成一种“思想、风格或制度”的概括。"]}
{"word":"hohn","summary":{"en":"Hohn is a rare word in English (borrowed from German) meaning “scorn” or “mocking contempt,” and sometimes used as a verb meaning “to ridicule.”","zh":"Hohn 在英语中较少见（源自德语），意思是“嘲讽/轻蔑”，有时也可作动词表示“奚落、嘲弄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, from German) scorn; mocking contempt; ridicule.","zh":"（罕见，源自德语）嘲讽；轻蔑；奚落。"},"examples":[{"en":"He spoke with hohn about the plan, treating it as a joke.","zh":"他用嘲讽的口吻谈论这个计划，把它当成笑话。"},{"en":"Her success answered their hohn with quiet confidence.","zh":"她的成功用沉静的自信回击了他们的奚落。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to scorn or ridicule; to treat with mocking contempt.","zh":"（罕见）嘲弄；奚落；以轻蔑的态度对待。"},"examples":[{"en":"They hohned the new student’s accent.","zh":"他们嘲笑新同学的口音。"}]}],"synonyms":["scorn","mockery","ridicule","derision","contempt","sneer"],"phonetic":"/hoʊn/","extraExplanation":["“hohn”在现代英语里非常少见，多见于受德语影响的写作或较文学化的语境。更常用的英语表达是：scorn, mock, ridicule, sneer。","它也常见为德语词“Hohn”（意为“嘲讽/轻蔑”）。如果你是在英文文本里看到的，往往就是借用这个德语词来加强语气。","如果你想查的是拼写相近的常用词，可能是：hone（磨练/改进），horn（角/喇叭），或 John（人名）。你可以把原句发我，我能帮你确认。"]}
{"word":"hoho","summary":{"en":"“Hoho/ho ho” is a written or spoken laugh, especially the famous “Ho ho ho” linked to Santa Claus.","zh":"“hoho/ho ho”是英文里用来表示笑声的拟声/语气表达，尤其常见于圣诞老人式的“Ho ho ho”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to represent a deep or hearty laugh (often written “ho ho ho”).","zh":"（拟声/语气词）表示低沉、爽朗的笑声（常写作“ho ho ho”）。"},"examples":[{"en":"Ho ho! That was a good joke.","zh":"呵呵！这个笑话真不错。"},{"en":"He gave a loud “ho ho ho” and patted my shoulder.","zh":"他大声“呵呵呵”地笑着，拍了拍我的肩。"}]},{"partOfSpeech":"phrase","definition":{"en":"Associated with Santa Claus’s traditional laugh; used in Christmas-related contexts.","zh":"（与圣诞语境相关）常指圣诞老人标志性的笑声。"},"examples":[{"en":"The card said, “Ho ho ho! Merry Christmas!”","zh":"贺卡上写着：“Ho ho ho！圣诞快乐！”"},{"en":"The kids heard “ho ho ho” and ran to the tree.","zh":"孩子们听到“ho ho ho”就跑向圣诞树。"}]}],"synonyms":["haha","hehe","ho ho ho","laugh"],"phonetic":"/ˈhoʊ hoʊ/","extraExplanation":["“hoho/ho ho”在英文里多用于书写来模仿笑声；日常对话里更常直接说“haha”。","注意与中文网络语气词“呵呵”不同：中文“呵呵”有时带冷淡或讽刺，但英文“ho ho”通常更像夸张、豪爽的笑声，或带一点戏剧化/调侃的效果。","圣诞老人的“Ho ho ho”是英美文化中很固定的形象标记，因此在圣诞广告、贺卡、儿童读物里非常常见。"]}
{"word":"hohokam","summary":{"en":"Hohokam refers to an ancient Indigenous culture in present-day Arizona, famous for its desert irrigation canals and farming.","zh":"Hohokam 指美国现今亚利桑那地区的古代原住民文化，以沙漠灌溉运河与农业著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Indigenous culture (and the people associated with it) that lived mainly in what is now southern and central Arizona, known especially for building large irrigation canals and farming in the desert (about c. 300–1450 CE).","zh":"美国现今亚利桑那州南部与中部的一种古代原住民文化（及其相关人群），以在沙漠中修建大型灌溉运河、发展农业而闻名（约公元300—1450年）。"},"examples":[{"en":"Archaeologists study Hohokam canal systems to understand early desert farming.","zh":"考古学家研究霍霍坎人的运河系统，以了解早期的沙漠农业。"},{"en":"The museum exhibit features Hohokam pottery and shell jewelry.","zh":"博物馆展览展示了霍霍坎人的陶器和贝壳饰品。"},{"en":"Many places in Arizona preserve traces of Hohokam settlements.","zh":"亚利桑那的许多地方仍保留着霍霍坎聚落的遗迹。"}]}],"synonyms":["Hohokam culture","Hohokam people"],"phonetic":"/hoʊhoʊˈkɑːm/","extraExplanation":["“Hohokam”一词来自奥奥德姆语（O’odham），常被解释为“消失的人/已经离去的人”，用来指代早于当代部落、后来不再以同一形式存在的古代社群。","在英文写作中，Hohokam 常见于考古学、历史与博物馆语境；也常与“canals（运河）”“irrigation（灌溉）”“pottery（陶器）”等词一起出现。"]}

