{"word":"hoi","summary":{"en":"“Hoi” is a casual Dutch-style way to say “hi/hello.”","zh":"“Hoi”是偏荷兰语风格的随意问候语，相当于“嗨/你好”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A casual greeting meaning “hi/hello,” used mainly in Dutch (and sometimes in informal English contexts to sound Dutch or playful).","zh":"一种随意的问候语，意思相当于“嗨/你好”，主要用于荷兰语（有时在英语里也会用来营造荷兰语或俏皮的感觉）。"},"examples":[{"en":"Hoi! How are you doing?","zh":"Hoi！你最近怎么样？"},{"en":"She greeted her Dutch coworker with a friendly “hoi.”","zh":"她用友好的“hoi”向荷兰同事打招呼。"}]},{"partOfSpeech":"int.","definition":{"en":"(Informal) A way to get someone’s attention, similar to “hey!” (less common than as a greeting).","zh":"（非正式）用来引起别人注意，类似“嘿！”（不如作为问候语常见）。"},"examples":[{"en":"Hoi—over here!","zh":"Hoi——这边！"}]}],"synonyms":["hi","hey","hello","hallo"],"phonetic":"/hɔɪ/","extraExplanation":["“Hoi”最常见于荷兰语日常口语，在荷兰北部、东北部及部分方言地区尤其常见；在比利时的荷兰语（佛兰芒语）里也能听到，但“hallo/hey/dag”可能更普遍。","在英语环境中看到“hoi”，通常是因为说话者会荷兰语、在模仿荷兰语语气，或是在多语言社群里自然借用。注意：英语母语者更常写“hi/hey”。"]}
{"word":"hoick","summary":{"en":"“Hoick” means to lift or pull something up quickly and roughly (informal, mainly British).","zh":"“hoick”指（多为英式口语）猛地提起或用力拉起某物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to lift, pull, or move something upward or away quickly and roughly (often by grabbing it)","zh":"（常指抓住某物）猛地提起、用力拉起或迅速拖动"},"examples":[{"en":"He hoicked the suitcase into the trunk with one hand.","zh":"他单手把行李箱猛地提进后备箱。"},{"en":"She hoicked her backpack onto her shoulder and ran for the bus.","zh":"她把背包猛地甩到肩上，跑去赶公交。"},{"en":"The child hoicked himself up onto the wall to see better.","zh":"孩子用力把自己撑上墙头，好看得更清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick, rough lift or pull upward","zh":"猛地一提；用力一拉"},"examples":[{"en":"With one hoick, he got the bag onto the counter.","zh":"他猛地一提，就把袋子放到了柜台上。"}]}],"synonyms":["lift","pull","yank","heave","haul"],"phonetic":"/hɔɪk/","extraExplanation":["“hoick”多见于英式英语的口语/非正式语境，在美式英语里相对少见；正式写作中更常用“lift / pull / yank / heave”。","语气通常带有“动作很快、很用力、略显粗鲁或不太讲究”的感觉。"]}
{"word":"hoicked","summary":{"en":"“Hoicked” means “pulled or lifted up quickly and roughly” (informal, chiefly British).","zh":"“hoicked”表示“猛地、粗鲁地拽起/提起”（非正式，主要英式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense of “hoick”) to lift, pull, or raise something quickly and roughly, often with a sudden jerk (informal, chiefly British).","zh":"（“hoick”的过去式）猛地、粗鲁地把某物提起/拽起/拉起（非正式，主要英式）。"},"examples":[{"en":"He hoicked his backpack onto his shoulder and ran for the bus.","zh":"他把背包猛地甩到肩上，跑去赶公交。"},{"en":"She hoicked the child up onto her hip.","zh":"她把孩子一下子抱到胯边。"},{"en":"They hoicked the suitcase out of the car boot.","zh":"他们把行李箱从后备箱里猛地拽出来。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense of “hoick”) to pull something upward or out of a place, sometimes with effort (informal).","zh":"（“hoick”的过去式）把某物往上拽/从某处拽出来（有时带点费劲；非正式）。"},"examples":[{"en":"He hoicked the weeds out of the ground by the roots.","zh":"他把杂草连根从地里拽出来。"},{"en":"She hoicked the curtains open to let in some light.","zh":"她猛地把窗帘拉开，让光透进来。"}]}],"synonyms":["yanked","hauled","jerked","pulled up","hiked up"],"phonetic":"/hɔɪkt/","extraExplanation":["“hoick”常见于英式口语，语气很生活化，带有“用力一拽/一提”的画面感；比中性的“lift/raise”更随意、更粗鲁一点。","拼写“hoicked”是规则变化：hoick + -ed。日常美式英语里不算常见，换成“yanked / hauled / pulled up”更自然。"]}
{"word":"hoicking","summary":{"en":"“Hoicking” means lifting/pulling something up quickly and roughly (British informal).","zh":"“hoicking”指（英式口语）迅速、用力地把东西提起/拽起（常带点粗鲁、匆忙的感觉）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “hoick”: lifting or pulling something (or someone) up or away quickly and often roughly; also moving quickly in a casual/informal way (British informal).","zh":"“hoick”的现在分词：把某物（或某人）迅速、往往有点粗鲁地提起/拽起/拉走；也可指（英式口语）匆匆走动、快速移动。"},"examples":[{"en":"He was hoicking the suitcase up into the overhead rack.","zh":"他把行李箱猛地提起来，塞到头顶行李架上。"},{"en":"She grabbed her backpack and went hoicking off to catch the bus.","zh":"她抓起背包就匆匆赶去搭公交了。"}]}],"synonyms":["pull","haul","yank","hoist","tug"],"phonetic":"/hɔɪkɪŋ/","extraExplanation":["“hoick”主要见于英式英语口语，语气偏随意；在美式英语里不太常用，更常用的说法有 pull/haul/yank（拉、拽）、lift/hoist（抬、举）。","它常带有“动作突然、用力、略显粗鲁/不讲究”的感觉；用于人时，有时也带一点不耐烦或急匆匆的语气。"]}
{"word":"hoicks","summary":{"en":"“Hoicks” is the 3rd-person singular or plural form of “hoick,” meaning to pull or lift something quickly and roughly (informal, mainly British).","zh":"“hoicks”是“hoick”的第三人称单数或复数形式，意为（非正式、主要英式）猛地拉起/拽起/粗鲁地拖动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Informal, especially British English) to pull, lift, or drag something quickly and roughly.","zh":"（非正式，尤指英式英语）猛地拉起、拽起或粗鲁地拖动某物。"},"examples":[{"en":"He hoicks the bag onto his shoulder and rushes out.","zh":"他把包猛地甩到肩上就冲出去了。"},{"en":"She hoicked the child up onto the seat.","zh":"她把孩子一把抱（拽）到座位上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a quick, rough pull or lift.","zh":"（较少见）猛拉一下；粗鲁地一提。"},"examples":[{"en":"With one hoick, he got the suitcase into the car.","zh":"他猛地一提，把行李箱放进了车里。"}]}],"synonyms":["yank","jerk","haul","drag","heave","tug"],"phonetic":"/hɔɪk/","extraExplanation":["“hoick”多见于英式口语，语气比较随意，有时带一点“不太优雅/有点粗鲁”的感觉。你输入的“hoicks”通常是动词第三人称单数（he/she/it hoicks）或名词复数（two hoicks）。"]}
{"word":"hoiden","summary":{"en":"A hoiden is an old-fashioned word for a noisy, unruly girl; it can also mean boisterous or mischievous.","zh":"hoiden 是个较旧式的词，指吵闹、顽皮不太守规矩的女孩，也可作形容词表示“疯闹/顽皮”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rude, noisy, and wild girl or young woman (often used in an old-fashioned or disapproving way)","zh":"（常为旧式且带贬义）粗鲁、吵闹、爱胡闹的女孩/年轻女子"},"examples":[{"en":"The neighbors complained about the hoiden shouting in the street.","zh":"邻居抱怨那个疯丫头在街上大喊大叫。"},{"en":"In the novel, she is first described as a hoiden but later shows a kind heart.","zh":"小说里她起初被描写成一个疯丫头，但后来展现出善良的一面。"}]},{"partOfSpeech":"adj.","definition":{"en":"boisterous, mischievous, and not well-behaved (old-fashioned)","zh":"（旧式）吵闹的、顽皮胡闹的、不太守规矩的"},"examples":[{"en":"He wrote about her hoiden energy with a mix of humor and criticism.","zh":"他带着几分幽默与批评写到了她那种疯闹的劲头。"},{"en":"The play features a hoiden heroine who refuses to follow social rules.","zh":"这部戏里有位不守社会规矩、很“疯”的女主角。"}]}],"synonyms":["rowdy","boisterous","unruly","mischievous","tomboy (near meaning)"],"phonetic":"/ˈhɔɪdən/","extraExplanation":["“hoiden”在现代英语中比较少见，带有明显的“旧时代”语感；用来形容女性时可能显得刻板或带性别偏见（因为它常把活泼/叛逆与“没教养”联系在一起）。写作或正式场合更常用中性词，如“rowdy”“boisterous”“unruly”或“mischievous”。"]}
{"word":"hoidened","summary":{"en":"“Hoidened” means acting (or made to act) loud, rough, and ill-mannered—an old-fashioned, often disapproving word linked to the idea of a “wild girl.”","zh":"“hoidened”指举止（或被带得）喧闹粗野、没礼貌；属于较古旧、常带贬义的说法，传统上与“野丫头/粗野的女孩”的观念相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic, often disapproving) behaving in a loud, rough, or impolite way, especially like a badly behaved young girl; boisterous and unladylike.","zh":"（古旧用法，常带贬义）举止粗鲁、喧闹或不礼貌的（尤指被认为像“没教养的女孩”那样）；放肆的、不端庄的。"},"examples":[{"en":"Her manners seemed hoidened after a summer running wild with the neighborhood kids.","zh":"她跟邻居孩子疯玩了一个夏天后，举止显得更粗野放肆了。"},{"en":"The novel describes a hoidened heroine who refuses to follow polite society’s rules.","zh":"小说描写了一位“放肆不羁”的女主角，拒绝遵循上流社会的礼仪规则。"}]},{"partOfSpeech":"v.","definition":{"en":"Simple past/past participle of “hoiden” (rare): to make someone behave in a rough, rowdy, or ill-mannered way.","zh":"“hoiden”的过去式/过去分词（少见）：使某人变得粗野、喧闹或没礼貌。"},"examples":[{"en":"He worried that the rough camp life had hoidened the children.","zh":"他担心艰苦的营地生活会把孩子们带得粗野没规矩。"}]}],"synonyms":["rowdy","unruly","boisterous","ill-mannered","wild"],"phonetic":"/ˈhɔɪdɪnd/","extraExplanation":["“hoidened”源自名词 hoiden，历史上常指“粗野的女孩/野丫头”。因为带有明显的性别刻板印象与贬义色彩，现代英语里较少使用；如果你想更中性、常见的表达，可以用 rowdy, unruly, boisterous, ill-mannered 等。","在文学语境中，这个词有时用来强调角色对“淑女规范”的反叛或不受约束的活力；但在现实交流中可能显得过时或带冒犯意味，需谨慎。"]}
{"word":"hoidening","summary":{"en":"“Hoidening” means behaving (or becoming) loud, rough, and ill-mannered like a hoiden; it’s a literary, somewhat old-fashioned word.","zh":"“hoidening”指像“野丫头”那样吵闹粗野、欠文雅（或变得越来越这样）；偏文学、较旧式用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary, often disapproving) Acting like a hoiden—loud, rough, and not well-mannered; tomboyish in a rowdy way.","zh":"（文学用语，常带贬义）像“野丫头/淘气粗鲁的女孩”那样的；吵闹粗野、不够文雅的；带点“假小子但更莽撞”的感觉。"},"examples":[{"en":"Her hoidening laughter echoed through the quiet hall.","zh":"她那种粗放吵闹的笑声在安静的大厅里回荡。"},{"en":"The novel contrasts her hoidening youth with her later polished manners.","zh":"小说把她早年那种粗野淘气的青春，与后来圆熟得体的举止作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of becoming more hoiden-like (more rowdy or ill-mannered).","zh":"变得更像“野丫头/更粗野吵闹”的过程；越来越莽撞粗鲁。"},"examples":[{"en":"The teacher worried about the hoidening of the class after lunch.","zh":"老师担心午饭后全班会变得更吵闹更难管。"}]}],"synonyms":["rowdy","boisterous","unruly","tomboyish","rough-and-tumble"],"phonetic":"ˈhɔɪd(ə)nɪŋ","extraExplanation":["“hoidening”来自名词 hoiden（意为粗野吵闹的女孩、野丫头）。它属于比较偏旧式、文学性的用词，在现代日常英语里不常见；更常见的说法是 rowdy、boisterous、unruly，或（较中性）tomboyish。","使用时要注意语气：它往往带评判色彩，暗示“缺乏教养/不够端庄”，因此形容真实人物时可能显得不礼貌。"]}
{"word":"hoidenish","summary":{"en":"Hoidenish means boisterous and playfully wild, often describing a girl in a slightly old-fashioned way.","zh":"Hoidenish 指吵闹又顽皮的“野性”，常用来形容女孩，带一点老派或轻微贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a hoiden: (especially of a girl or young woman) noisy, wild, and boldly playful; sometimes used as mildly disapproving.","zh":"像“野丫头/疯丫头”一样的；（尤指女孩或年轻女性）吵闹、野性、放得开又爱闹腾的；有时带轻微贬义。"},"examples":[{"en":"She had a hoidenish laugh that filled the whole room.","zh":"她的笑声很“野”，一下子就把整个房间都填满了。"},{"en":"His sister was hoidenish as a kid, always climbing trees and getting muddy.","zh":"他妹妹小时候很像个野丫头，总爱爬树、把自己弄得满身泥。"},{"en":"The novel describes a hoidenish heroine who refuses to behave politely in society.","zh":"小说里描写了一位很“放得开”的女主角，不愿按社交礼仪装得规规矩矩。"}]}],"synonyms":["boisterous","rowdy","unruly","lively","spirited"],"phonetic":"/ˈhɔɪdənɪʃ/","extraExplanation":["“Hoidenish”来自名词“hoiden”（意为“野丫头/粗野又活泼的女孩”）。在现代英语里这类词偏文学、偏老派，日常对话不算常见；直接形容真人时可能显得刻薄或带性别刻板印象。","语气提示：如果想表达更中性、偏褒义的“精力旺盛、爱冒险”，可以考虑 lively / playful / spirited；如果要表达“吵闹、难管”，可用 rowdy / unruly。"]}
{"word":"hoidens","summary":{"en":"“Hoidens” means lively, noisy, unruly girls (plural of “hoyden”), often in an old-fashioned tone.","zh":"“Hoidens”指活泼喧闹、略顽皮不羁的女孩（“hoyden”的复数），语气较老派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hoyden”: a boisterous, high-spirited girl; (sometimes) a girl or young woman who behaves in a rough, unruly, or tomboyish way.","zh":"“hoyden”的复数：指活泼喧闹、精力旺盛的女孩；（有时）指行为有点粗野、不拘小节、像“假小子”的女孩/年轻女性。"},"examples":[{"en":"In the old novel, the aunt complains that the neighborhood is full of “hoydens” who run and shout in the street.","zh":"在那本老小说里，姨妈抱怨街区里到处都是“hoydens”，在街上奔跑喊叫。"},{"en":"The teacher described the sisters as cheerful hoydens who preferred climbing trees to playing with dolls.","zh":"老师形容那对姐妹是开朗的“hoydens”，比起玩洋娃娃更喜欢爬树。"}]}],"synonyms":["tomboys","lively girls","boisterous girls","rowdy girls"],"phonetic":"/ˈhɔɪdənz/","extraExplanation":["“hoyden”是较老派、带时代感的词，在现代日常英语里不太常用；用在当代语境时可能带一点调侃或刻板印象。更中性的说法常用：energetic kids（精力旺盛的孩子）、tomboy（偏“假小子”）、boisterous girl（活泼吵闹的女孩）。","词源上与荷兰语/中古英语中表示“淘气的孩子、粗鲁的人”的词有关；早期也可泛指“粗鲁的人”，后来更常指“活泼鲁莽的女孩”。"]}
{"word":"hoihere","summary":{"en":"“Hi there” is a common, friendly way to say hello.","zh":"“Hi there” 是很常见、友好的打招呼方式，相当于“你好/嗨”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A friendly greeting, similar to “hello.”","zh":"一种友好的问候语，类似于“你好/嗨”。"},"examples":[{"en":"Hi there! How are you doing today?","zh":"嗨！你今天怎么样？"},{"en":"Hi there—do you have a minute?","zh":"嗨——你有空吗？"},{"en":"She waved and said, “Hi there!”","zh":"她挥挥手说：“嗨！”"}]}],"synonyms":["hello","hi","hey","howdy"],"phonetic":"/haɪ ðɛr/","extraExplanation":["“hoihere” 不是常见的英文拼写。你可能想写的是 **“hi there”**（最常见），或者受荷兰语/德语影响写成 **“hoi”**（在荷兰语、德语里常用作“嗨/你好”的口语招呼）。在英文里更自然的写法是 **hi there** 或 **hello**。"]}
{"word":"hoin","summary":{"en":"“Hoin” is a dialect verb meaning “to throw/hurl,” mainly in Scottish or Irish English.","zh":"“hoin”是方言用法，主要在苏格兰/爱尔兰英语中表示“投掷、猛扔”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(dialect, chiefly Scottish/Irish English) to throw or hurl something, often with force","zh":"（方言，主要用于苏格兰/爱尔兰英语）投掷；猛扔（某物），常带有用力的感觉"},"examples":[{"en":"He hoined the stone into the river.","zh":"他把石头猛地扔进了河里。"},{"en":"Don’t ho in things around the room—you might break something.","zh":"别在房间里乱扔东西——你可能会弄坏东西。"}]},{"partOfSpeech":"n.","definition":{"en":"a forceful throw (less common)","zh":"（较少用）用力的一掷；猛投"},"examples":[{"en":"With one ho in, the ball cleared the fence.","zh":"他用力一掷，球越过了围栏。"}]}],"synonyms":["throw","toss","hurl","fling"],"phonetic":"/hɔɪn/","extraExplanation":["“hoin/ho in”多见于苏格兰英语和部分爱尔兰英语口语或文学化的方言描写中；在标准美式英语里更常用 throw / toss / hurl。","拼写有时会分开写成“ho in”，也可能出现在对话体（小说、戏剧）中，用来表现地域口音与人物身份。"]}
{"word":"hoise","summary":{"en":"“Hoise” is usually a misspelling of “hoist,” meaning to lift or raise (or a lifting device).","zh":"“hoise”通常是“hoist”的拼写错误，意思是“吊起/升起”（或“起重装置”）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to lift or raise something, often using ropes, a machine, or effort","zh":"（常借助绳索或机械）把……吊起/升起"},"examples":[{"en":"They hoisted the flag at sunrise.","zh":"他们在日出时升起了旗帜。"},{"en":"The workers hoisted the heavy beams into place with a crane.","zh":"工人用起重机把沉重的梁吊装到位。"},{"en":"He hoisted his backpack onto his shoulder.","zh":"他把背包甩到肩上。"}]},{"partOfSpeech":"n.","definition":{"en":"a device (or system) used for lifting heavy objects","zh":"起重装置；提升机（如葫芦、卷扬机等）"},"examples":[{"en":"The engine was lifted out with a hoist.","zh":"发动机用起重装置吊了出来。"},{"en":"This garage has a hoist for repairing cars.","zh":"这家修车厂有用于维修汽车的升降机。"}]}],"synonyms":["lift","raise","haul","elevate"],"phonetic":"/hɔɪst/","extraExplanation":["“hoise”在标准英语里并不是常见单词，很多时候是把“hoist”（吊起、升起）拼错了；如果你想表达“房子/住”，可能是“house”。你可以告诉我你看到它的句子，我可以帮你确认。"]}
{"word":"hoised","summary":{"en":"“Hoised” means “hoisted”: lifted or raised something, often using ropes or machinery, and can also mean raising a flag or sail.","zh":"“hoised”相当于“hoisted”：指把某物吊起/升起（常借助绳索或机械），也可指升旗或升帆。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “hoist”: raised or lifted something (often with ropes, a pulley, or a mechanical device).","zh":"“hoist”的过去式和过去分词：把某物升起、吊起（常借助绳索、滑轮或机械装置）。"},"examples":[{"en":"Workers hoised the heavy beam into place with a crane.","zh":"工人用起重机把沉重的横梁吊到位。"},{"en":"She hoised her backpack onto her shoulder and left.","zh":"她把背包扛到肩上就走了。"}]},{"partOfSpeech":"v.","definition":{"en":"raised a flag or sail (common in nautical or ceremonial contexts).","zh":"升起旗帜或船帆（常见于航海或仪式语境）。"},"examples":[{"en":"At sunrise, the crew hoised the flag.","zh":"日出时，船员升起了旗帜。"},{"en":"They hoised the sails as the wind picked up.","zh":"风渐大时，他们升起了船帆。"}]}],"synonyms":["lifted","raised","hauled up","pulled up"],"phonetic":"/hɔɪzd/","extraExplanation":["“hoise/hoised”是较少见的拼写；现代英语里通常写作“hoist/hoisted”。在较旧的文本或个别地区用法中可能会看到“hoised”。","“hoist”比“raise”更强调“借助工具/绳索把重物向上吊起”，也常用于航海语境（升旗、升帆）。"]}
{"word":"hoises","summary":{"en":"“hoises” is not common in modern English; it is usually a misspelling of “hoists” (raises/lifts).","zh":"“hoises”在现代英语中不常见；通常是“hoists”（提升/吊起）的拼写错误。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of “hoists,” meaning “raises or lifts (something), often with ropes or machinery.”","zh":"（非标准拼写）通常是“hoists”的拼写错误，意思是“（常用绳索或机械）把……提升/吊起”。"},"examples":[{"en":"The crane hoists the steel beam into place.","zh":"起重机把钢梁吊到位。"},{"en":"Workers hoist the flag every morning.","zh":"工人们每天早上升旗。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) “hoises” can be read as the third-person singular of “hoise,” an old variant of “hoist,” used especially in nautical contexts (“to hoist a sail”).","zh":"（少见/古旧）“hoises”也可理解为“hoise”的第三人称单数；“hoise”是“hoist”的古体/变体，尤见于航海语境（如“升帆”）。"},"examples":[{"en":"In older sea stories, the crew hoises the sails at dawn.","zh":"在较老的航海故事里，船员会在黎明时升帆。"}]}],"synonyms":["lift","raise","haul","pull up","elevate"],"phonetic":"/hɔɪst/","extraExplanation":["“hoise/hoises”在现代英语里非常少见；日常写作与考试中几乎都用“hoist/hoists”。如果你原本想写的是“houses（房子）”或“noises（噪音）”，也可能是拼写打错了——可以把原句发我，我帮你确认。"]}
{"word":"hoising","summary":{"en":"“Hoising” is usually a misspelling of “hoisting,” meaning lifting or raising something, often with ropes or machinery.","zh":"“hoising”通常是“hoisting”的拼写错误，意思是把某物抬起或升起，常借助绳索或机械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually written as “hoisting”) the act of lifting or raising something, often using ropes, pulleys, or machinery.","zh":"（通常写作“hoisting”）把某物抬起或升起的动作，常借助绳索、滑轮或机械。"},"examples":[{"en":"The hoisting of the flag happens every morning at 8 a.m.","zh":"每天早上8点都会举行升旗仪式。"},{"en":"For safety, the hoisting of heavy steel beams must be supervised.","zh":"为确保安全，吊装沉重钢梁必须有人监管。"}]},{"partOfSpeech":"v.","definition":{"en":"(Usually written as “hoisting”) lifting or raising something, especially with effort or equipment.","zh":"（通常写作“hoisting”）抬起或吊起某物，尤其是费力地或借助设备。"},"examples":[{"en":"Workers are hoisting the equipment onto the truck.","zh":"工人们正在把设备吊到卡车上。"},{"en":"She kept hoisting her backpack higher on her shoulder.","zh":"她不断把背包往肩膀上提一提。"},{"en":"The crane is hoisting the container slowly.","zh":"起重机正在缓慢吊起集装箱。"}]}],"synonyms":["lifting","raising","hauling","winching","elevating"],"phonetic":"/ˈhɔɪstɪŋ/","extraExplanation":["“hoising”常见于拼写错误或少见的变体；标准拼写是“hoisting”，来自动词“hoist（吊起、升起）”。","“hoist”常用于固定搭配：hoist a flag（升旗）、hoist a sail（升帆）、hoist a load（吊起货物）。"]}
{"word":"hoist","summary":{"en":"“Hoist” means to lift something up, especially using ropes or machinery, and it’s also used for raising flags or sails; a “hoist” can also be a lifting device.","zh":"“Hoist”指（常用绳索或机械）吊起、升起；也常用于“升旗/升帆”；名词还可指起重装置/提升机。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to lift or raise something (often heavy) using ropes, pulleys, or a machine","zh":"（常借助绳索、滑轮或机械）把（重物）吊起、升起"},"examples":[{"en":"They hoisted the piano up to the third floor with ropes.","zh":"他们用绳子把钢琴吊到三楼。"},{"en":"The workers hoisted the steel beams into place.","zh":"工人们把钢梁吊装到位。"}]},{"partOfSpeech":"vt.","definition":{"en":"to raise a flag, sail, or something similar upward","zh":"升起（旗帜、船帆等）"},"examples":[{"en":"At sunrise, they hoisted the flag.","zh":"日出时，他们升起了旗帜。"},{"en":"The crew hoisted the sails as the wind picked up.","zh":"风变大时，船员升起了船帆。"}]},{"partOfSpeech":"n.","definition":{"en":"a device or machine used for lifting heavy objects (e.g., on a ship or at a construction site)","zh":"起重装置；提升机（如船上或工地用于吊运重物的设备）"},"examples":[{"en":"The cargo was moved with an electric hoist.","zh":"货物用电动提升机搬运。"},{"en":"Make sure the hoist is locked before you stand under the load.","zh":"站到吊物下面之前，务必确认起重机已锁定。"}]}],"synonyms":["lift","raise","haul","pull up","elevate"],"phonetic":"/hɔɪst/","extraExplanation":["“Hoist”在船舶语境里很常见：hoist the sails（升帆）、hoist the flag（升旗）。在工地语境里也常见：hoist materials/steel beams（吊运材料/钢梁）。","固定搭配：hoist yourself up（把自己撑/拉上去）；be hoist with/by one’s own petard（自食其果，源自莎士比亚《哈姆雷特》；petard 是一种爆破装置）。","词源提示：来自古法语 *hoisier*（举起、拉起），所以带有“用力拉起/吊起”的感觉。"]}
{"word":"hoistaway","summary":{"en":"“Hoist away” means to lift something up and move it away, or (as a nautical command) to start hoisting now.","zh":"“Hoist away”表示把东西吊起并移走；在航海中也可作口令，表示“开始拉升/现在就升”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to lift something up (often quickly) and move it away, usually by pulling with ropes, a crane, or strong effort","zh":"把某物吊起并移开（常指用绳索、起重机或用力拉起）。"},"examples":[{"en":"They hoisted away the damaged boat and took it to the dock for repairs.","zh":"他们把受损的船吊起来移走，拖到码头去修理。"},{"en":"The workers hoisted away the heavy beams with a crane.","zh":"工人用起重机把沉重的横梁吊起并移走。"}]},{"partOfSpeech":"phrase","definition":{"en":"(nautical command) begin hoisting now; pull together to raise a sail or load","zh":"（航海口令）开始拉升；一起用力把帆或货物升起。"},"examples":[{"en":"The captain shouted, “Hoist away!” and the crew raised the sail.","zh":"船长喊道：“Hoist away！”船员就把帆升了起来。"},{"en":"“Hoist away!” he called, and everyone pulled on the rope at the same time.","zh":"他喊了一声“Hoist away！”，大家同时拉绳子。"}]}],"synonyms":["lift","haul up","hoist","raise","winch up"],"phonetic":"/hɔɪst əˈweɪ/","extraExplanation":["这个表达更常见的写法是分开的“hoist away”。连写“hoistaway”比较少见，可能出现在旧式写法、特定行业记录，或把口令当作一个词来写的场景。","在航海语境里，它常作为口令使用，类似“Pull!”或“Lift!”；其中“away”有“持续用力/继续进行”的语感（如“work away”）。"]}
{"word":"hoisted","summary":{"en":"“Hoisted” means “lifted/raised,” especially by pulling with ropes or equipment; it can also describe something that is already raised.","zh":"“hoisted”表示“被提起/被升起”，尤指用绳索或设备拉升；也可作形容词表示“已升起的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “hoist”) lifted or raised something, often by pulling with ropes or machinery.","zh":"（动词 hoist 的过去式/过去分词）把某物提起或升起，常借助绳索或机械装置。"},"examples":[{"en":"They hoisted the flag at sunrise.","zh":"他们在日出时升起了旗帜。"},{"en":"The workers hoisted the heavy beam into place with a crane.","zh":"工人用起重机把沉重的梁吊装到位。"},{"en":"He was hoisted onto his friend’s shoulders to see the parade.","zh":"为了看清游行，他被朋友举到肩膀上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) raised up; in an elevated position.","zh":"（形容词）被升起的；处于高处的。"},"examples":[{"en":"A hoisted sail caught the wind quickly.","zh":"升起的帆很快兜住了风。"},{"en":"With the hoisted banner, everyone could read the message.","zh":"旗帜被举起后，大家都能读到上面的信息。"}]}],"synonyms":["raised","lifted","hauled up","pulled up","elevated"],"phonetic":"/hɔɪstɪd/","extraExplanation":["“hoist”常见于航海与仪式语境：hoist the sails（升帆）、hoist the flag（升旗）。比起一般的“lift/raise”，它更强调“用绳索/滑轮/起重设备向上拉起”。","文学与习语：莎士比亚《哈姆雷特》里有“hoist with his own petard”，意思是“自食其果/搬起石头砸自己的脚”（petard 是一种爆破装置）。"]}
{"word":"hoister","summary":{"en":"A hoister is a person or device that lifts things up.","zh":"hoister 指“把东西吊起/提升”的人或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or a machine/device that lifts something up (especially a hoist used in construction, shipping, or on ships).","zh":"起重者；起重装置（尤指用于工地、运输或船上的提升设备）"},"examples":[{"en":"The hoister lifted the steel beams onto the second floor.","zh":"起重装置把钢梁吊到了二楼。"},{"en":"Only trained workers are allowed to operate the hoister.","zh":"只有受过培训的工人才可以操作起重装置。"}]}],"synonyms":["hoist operator","lifter","crane (context-dependent)","winch (context-dependent)"],"phonetic":"/ˈhɔɪstər/","extraExplanation":["“Hoister”来自动词“hoist”（提升、吊起）。在日常英语里，人们更常说“hoist”（装置本身）或“crane/ forklift”（更具体的机器），而“hoister”多用于强调“负责吊装的人”或“起吊用的设备”。","在航海语境中，hoist常指“升起帆、旗帜”，所以hoister也可能指负责升帆/升旗的人或装置，但这种用法较少见。"]}
{"word":"hoisters","summary":{"en":"“Hoisters” means people or devices that lift something up.","zh":"“hoisters”指把东西吊起或抬起的人或设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or machines that lift or raise something (plural of “hoister”)","zh":"把某物吊起/抬起的人或装置（“hoister”的复数）"},"examples":[{"en":"The hoisters raised the steel beams into place.","zh":"吊装工人把钢梁吊到位。"},{"en":"We need stronger hoisters to lift this engine safely.","zh":"我们需要更强的起吊设备才能安全吊起这台发动机。"}]}],"synonyms":["lifters","cranes","hoists","riggers"],"phonetic":"/ˈhɔɪstər/","extraExplanation":["“hoister”来自动词 hoist（吊起、升起），常用于建筑工地、港口装卸、舞台布景等场景。日常口语里更常说 hoist / lift / crane，而 hoister 多见于技术语境或作为名词指“起吊的人/装置”。"]}
{"word":"hoisting","summary":{"en":"Hoisting means lifting something up; in JavaScript, it also refers to declarations being treated as if they move to the top of their scope before execution.","zh":"Hoisting 指把东西吊起/升起；在 JavaScript 中也指“提升”现象：某些声明在执行前会被当作移动到其作用域顶部处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of lifting or raising something up, often using ropes, pulleys, or machinery","zh":"（用绳索、滑轮或机械等）把某物吊起、升起的动作"},"examples":[{"en":"The hoisting of the flag happens every morning at the school.","zh":"学校每天早上都会举行升旗（把旗子升起）的仪式。"},{"en":"For safety, the crew checked the chains before hoisting the heavy load.","zh":"为安全起见，工人们在吊起重物前检查了链条。"}]},{"partOfSpeech":"v.","definition":{"en":"lifting or raising something up","zh":"吊起；抬起；提升"},"examples":[{"en":"They are hoisting the piano up to the third-floor apartment.","zh":"他们正在把钢琴吊到三楼的公寓里。"},{"en":"We need a crane for hoisting those steel beams.","zh":"我们需要用起重机来吊装那些钢梁。"}]},{"partOfSpeech":"n.","definition":{"en":"(programming, especially JavaScript) the behavior where certain declarations are treated as if they are moved to the top of their scope before code runs","zh":"（编程，尤指 JavaScript）“提升”：某些声明在运行前会被当作移动到其作用域顶部的行为"},"examples":[{"en":"Because of hoisting, you can sometimes call a function before its definition appears in the file.","zh":"由于“提升”，有时你可以在文件中函数定义出现之前就调用它。"},{"en":"Variable hoisting can cause confusing bugs if you assume the variable is unavailable before it is declared.","zh":"如果你以为变量在声明前不可用，变量“提升”可能会导致令人困惑的 bug。"}]}],"synonyms":["lifting","raising","elevating","heaving","crane-lift"],"phonetic":"/ˈhɔɪstɪŋ/","extraExplanation":["在日常英语里，hoisting 多用于“吊起/升起”（比如 hoist a flag / hoist a sail）。在编程语境里（尤其 JavaScript），hoisting 是一个固定术语，通常不翻译或译为“提升”，核心是“声明的可见性/处理顺序”与书写顺序不完全一致。常见提醒：function declaration 的“提升”更完整，而用 var 的变量会“提升声明但不提升赋值”（因此可能先得到 undefined）。"]}
{"word":"hoistman","summary":{"en":"A hoistman is a person whose job is to operate a hoisting machine to lift or lower heavy loads.","zh":"hoistman 指以操作提升设备为职业、负责起吊或放下重物的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker who operates a hoist (a machine used to lift or lower loads), especially on construction sites, in mines, or in industrial settings.","zh":"起重机/卷扬机操作工；负责操作提升设备（升降重物）的工人，常见于工地、矿井或工业现场。"},"examples":[{"en":"The hoistman lowered the steel beams carefully to the ground crew.","zh":"起重机操作工小心地把钢梁放下来交给地面工人。"},{"en":"In the mine, the hoistman controlled the cage that carried miners underground.","zh":"在矿井里，卷扬机操作工控制升降笼，把矿工送到地下。"}]}],"synonyms":["hoist operator","crane operator","winch operator"],"phonetic":"/ˈhɔɪstmən/","extraExplanation":["“hoistman”由 hoist（提升机、起吊装置）+ man（从业者）组成。它更偏向职业称呼，常见于矿业、施工和重工业语境。现代英语里也可能用更具体的职位名，如 crane operator（吊车司机/起重机操作员）、hoist operator（提升机操作员）。"]}
{"word":"hoists","summary":{"en":"“Hoists” is the plural of “hoist” or the third-person singular verb form, meaning to lift/raise something, often with equipment.","zh":"“hoists”是“hoist”的复数或动词第三人称单数形式，常指（借助装置）把东西吊起/升起。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to lift or raise something (often heavy) using a rope, pulley, or mechanical device","zh":"（常借助绳索、滑轮或机械装置）把某物（通常很重）吊起、升起"},"examples":[{"en":"The workers hoist the steel beams into place.","zh":"工人把钢梁吊起并放到位。"},{"en":"She hoists her suitcase onto the luggage rack.","zh":"她把行李箱抬到行李架上。"},{"en":"They hoist the flag every morning.","zh":"他们每天早上升旗。"}]},{"partOfSpeech":"n.","definition":{"en":"lifting equipment (such as a crane, winch, or pulley system) used to raise or move heavy things","zh":"起重装置；提升机（如吊车、绞车或滑轮系统等）"},"examples":[{"en":"The hoist can lift up to two tons.","zh":"这台起重机最多能吊起两吨。"},{"en":"Use the hoist to move the engine safely.","zh":"用起重装置安全地移动发动机。"}]}],"synonyms":["lift","raise","haul","heave","elevate"],"phonetic":"/hɔɪst/","extraExplanation":["“Hoist”常见于航海语境：hoist the sails（升帆）、hoist the flag（升旗）。在口语中也可用来表示“用力抬起/扛起”较重的东西（如hoist a bag onto your shoulder）。"]}
{"word":"hoistway","summary":{"en":"Hoistway means the vertical elevator shaft where an elevator or dumbwaiter travels.","zh":"hoistway 指电梯（或小型升降机）运行的垂直井道/井筒空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A vertical shaft in a building where an elevator car or a dumbwaiter moves up and down; the space that contains the rails, cables, and equipment for lifting.","zh":"建筑物内电梯轿厢或小型升降机上下运行的垂直井道；包含导轨、钢索与升降设备的空间。"},"examples":[{"en":"Workers installed new guide rails inside the hoistway.","zh":"工人们在电梯井道内安装了新的导轨。"},{"en":"For safety, the hoistway doors must stay closed when the elevator isn’t there.","zh":"为安全起见，当电梯不在该层时，井道门必须保持关闭。"}]}],"synonyms":["elevator shaft","lift shaft","shaft"],"phonetic":"/ˈhɔɪstˌweɪ/","extraExplanation":["“Hoistway”是工程与建筑领域的专业词，日常口语更常说“elevator shaft”（电梯井/电梯井道）。在电梯行业里，hoistway 常用于技术文件、施工图纸与检验规范中。","词源上，hoist 表示“提升、吊起”，way 表示“通道/路径”，合起来就是“升降所经过的通道”。"]}
{"word":"hoit","summary":{"en":"“Hoit” is not a standard common English word; it’s usually a typo (often for “hoist”) or a proper name.","zh":"“hoit”不是常见的标准英语词；多为拼写错误（常误写“hoist”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare form in English; most learners will not encounter it in general reading. It may be a typo or misspelling (often of “hoist”).","zh":"英语中不规范或极少见的形式；一般阅读里几乎不会遇到。常见情况是拼写错误（常把它当成“hoist”的误拼）。"},"examples":[{"en":"I couldn’t find “hoit” in most English dictionaries—did you mean “hoist”?","zh":"大多数英语词典里查不到“hoit”——你是不是想写“hoist”？"},{"en":"If you saw “hoit” in a text, check the surrounding sentence for a likely spelling mistake.","zh":"如果你在文章里看到“hoit”，可以结合上下文判断是否为拼写错误。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name (e.g., a surname or place name) in some contexts.","zh":"在某些语境中可作专有名词（如姓氏或地名）。"},"examples":[{"en":"Ms. Hoit will join the meeting at 3 p.m.","zh":"Hoit 女士将于下午三点参加会议。"}]}],"phonetic":"/hɔɪt/","extraExplanation":["“hoit”更常见的学习价值在于：它很可能是“hoist”的误拼。hoist /hɔɪst/ 常见意思是“（用绳索/起重机）吊起、升起”，例如 hoist a flag（升旗）、hoist a suitcase into the trunk（把行李抬进后备箱）。","如果你能提供看到“hoit”的完整句子或来源（书名/网页/截图），我可以更准确判断它到底是拼写错误、专有名词，还是某个缩写。"]}

