{"word":"hokan","summary":{"en":"Hokan is usually a proper name in English; it can also appear as a Japanese romanized term meaning “storage/keeping in safekeeping.”","zh":"Hokan 在英语里通常是专有名词；也可能是日语罗马字写法，意思是“保管/寄存”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal or place name (proper noun); not a common everyday English word.","zh":"人名或地名（专有名词）；在日常英语中不常见。"},"examples":[{"en":"Hokan is a common given name in parts of Scandinavia (often spelled Håkan).","zh":"Hokan 在斯堪的纳维亚部分地区是常见的人名（常见拼写为 Håkan）。"},{"en":"I met Hokan at the conference and asked about his research.","zh":"我在会议上遇到 Hokan，并询问了他的研究。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Japanese romanization) ‘storage; keeping in safekeeping,’ often seen in phrases like ‘baggage storage.’","zh":"（源自日语罗马字）“保管；寄存”，常见于如“行李寄存”等场景。"},"examples":[{"en":"In some Japanese-English signs, you may see hokan meaning ‘storage.’","zh":"在一些日式英文标识里，你可能会看到 hokan 用来表示“寄存/保管”。"},{"en":"Please use the locker for temporary hokan of your bag.","zh":"请使用储物柜临时保管你的包。"}]}],"synonyms":["(name)","(Japanese context) storage","safekeeping"],"phonetic":"/ˈhoʊkən/","extraExplanation":["“Hokan”在英语里通常不是一个标准词条，更常见的是专有名词（人名/地名），或是把日语“保管（ほかん）”直接用罗马字写出来。","如果你原本想查的是 **hogan**（一种传统住屋）或 **hoken**（日语“保险”的罗马字），告诉我你看到这个词的句子/场景，我可以更精准解释。"]}
{"word":"hoke","summary":{"en":"“Hoke” means to hype or exaggerate something in a showy, often misleading way; it can also mean that kind of fake-sounding publicity.","zh":"“hoke”指用夸张、哗众取宠（有时带误导）的方式炒作/夸大；也可指这种噱头式宣传。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to exaggerate or promote something in a showy, misleading, or overly dramatic way; to “hype up”","zh":"（用夸张、哗众取宠、甚至带点误导的方式）炒作；夸大宣传"},"examples":[{"en":"The ad campaign hoked the product as a miracle cure.","zh":"这场广告活动把这款产品炒作成“神奇疗法”。"},{"en":"Some news sites hoke minor stories to get more clicks.","zh":"有些新闻网站会把小事夸大炒作来获取更多点击。"}]},{"partOfSpeech":"n.","definition":{"en":"exaggerated, insincere, or fake-sounding publicity or storytelling; hype","zh":"夸张而不真诚的宣传/说法；噱头；炒作"},"examples":[{"en":"Ignore the hoke and look at the actual facts.","zh":"别理那些噱头，看看真实的事实。"},{"en":"The movie’s marketing was all hoke, but the film was okay.","zh":"电影宣传全是炒作，不过电影本身还行。"}]}],"synonyms":["hype","exaggerate","oversell","spin","puff"],"phonetic":"/hoʊk/","extraExplanation":["“hoke”多见于美式英语的口语/非正式语境，常带负面评价，暗示“为了吸引注意而过度包装”。","它常与“hype（炒作）”“spin（带立场的包装）”意思接近；写正式文章时通常更常用hype或exaggerate。"]}
{"word":"hoked","summary":{"en":"“Hoked” is usually the past form of the regional verb “hoke,” meaning “rummaged/poked around,” and it can also appear in older writing meaning “hamstrung (an animal).”","zh":"“hoked”通常是地区性动词“hoke”的过去式，常指“翻找、到处翻寻”；在较古旧的用法中也可指“割伤动物膝后筋腱使其瘸”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “hoke” (Scots/Irish English): to rummage or poke around, often searching for something","zh":"“hoke”的过去式/过去分词（苏格兰/爱尔兰英语）：翻找、扒拉、到处翻寻（常指在找东西）"},"examples":[{"en":"He hoked in his bag for his keys.","zh":"他在包里翻找钥匙。"},{"en":"She hoked around the drawer until she found the letter.","zh":"她把抽屉翻了个遍，直到找到那封信。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “hoke” (rare): to hamstring or injure an animal by cutting behind the knee (historical/archaic)","zh":"“hoke”的过去式/过去分词（少见）：割断动物膝后筋腱使其瘸/伤害（历史/古旧用法）"},"examples":[{"en":"In older texts, the animal is described as having been hoked.","zh":"在较早的文本中，会写到那只动物被“hoked”（被割伤膝后筋腱）。"}]}],"synonyms":["rummaged","searched","dug around","poked around"],"phonetic":"/hoʊkt/","extraExplanation":["“hoked”在现代标准英语里不常见，更常见的是方言/地区用法（尤其是苏格兰英语里“hoke around”=到处翻找）。","很多学习者输入“hoked”其实是想写“hooked”（/hʊkt/），意思常见为“上钩的；入迷的；挂住的”。如果你想查的是“hooked”，告诉我语境，我可以按“hooked”再给你完整词条。"]}
{"word":"hoker","summary":{"en":"Hoker is a rare historical word meaning a small coastal sailing/trading vessel; it can also be a surname.","zh":"Hoker 是个罕见的历史词，指一种小型沿海帆船/商船；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, historical) A small sailing ship or coastal trading vessel, especially one used in northern Europe.","zh":"（罕见，历史用法）一种小型帆船或沿海商船，尤指北欧地区曾使用的船只。"},"examples":[{"en":"The merchant loaded grain onto a hoker bound for the next port.","zh":"商人把谷物装上那艘要开往下一个港口的 hoker（小型沿海帆船）。"},{"en":"Old records mention hokers working the shallow coastal waters.","zh":"旧文献提到 hokers 在近海浅水区航行、运货。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) A person’s surname.","zh":"（很少见）人名/姓氏。"},"examples":[{"en":"Ms. Hoker will join the meeting tomorrow.","zh":"Hoker 女士明天将参加会议。"}]}],"synonyms":["hoy","coaster","small trading vessel"],"phonetic":"/ˈhoʊkər/","extraExplanation":["“hoker”在现代英语里非常少见，多见于航海史/旧文献。它与荷兰语来源有关（常被认为与荷兰语 hoeker 一类词相关），指一种小型沿海帆船/商船。","很多学习者输入“hoker”其实是想查“hooker”（/ˈhʊkər/ 或 /ˈhoʊkər/ 视口音而定）。但“hooker”在现代英语里还有其他常见含义（如性工作者、棒球的曲球、橄榄球的钩锋等），语境敏感，使用时要特别注意。"]}
{"word":"hokerer","summary":{"en":"“hokerer” isn’t a standard English word; it’s probably a misspelling of “hooker.”","zh":"“hokerer”不是标准英语单词；很可能是“hooker”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“hokerer” is not a standard English word; it is likely a misspelling. Many learners mean “hooker.”","zh":"“hokerer”不是标准英语单词；很可能是拼写错误。很多学习者想写的是“hooker”。"},"examples":[{"en":"I can’t find “hokerer” in a dictionary—did you mean “hooker”?","zh":"我在词典里找不到“hokerer”——你是不是想写“hooker”？"},{"en":"If you meant “hooker,” please note it can be slang and may be offensive in some contexts.","zh":"如果你想写“hooker”，请注意它在某些语境中是俚语，可能带有冒犯性。"}]},{"partOfSpeech":"n.","definition":{"en":"hooker (common intended spelling): a sex worker (slang; often considered offensive or disrespectful).","zh":"hooker（常见的目标拼写）：妓女/性工作者（俚语；常被认为不礼貌或带有冒犯性）。"},"examples":[{"en":"The movie uses the word “hooker,” but it’s a crude term.","zh":"那部电影里用了“hooker”这个词，但它是个粗俗的说法。"},{"en":"In formal writing, avoid “hooker”; use “sex worker” instead.","zh":"在正式写作中避免用“hooker”，更建议用“sex worker”。"}]},{"partOfSpeech":"n.","definition":{"en":"hooker: in rugby, a player in the front row of the scrum.","zh":"hooker：英式橄榄球中“前排钩球员”（scrum 前排中间的位置）。"},"examples":[{"en":"She plays hooker for her rugby club.","zh":"她在橄榄球俱乐部打 hooker（钩球员）位置。"},{"en":"The hooker throws the ball into the line-out.","zh":"hooker 负责把球掷入边线球（line-out）。"}]}],"synonyms":["sex worker (neutral/formal)","rugby hooker (sports term)"],"phonetic":"/ˈhʊkər/","extraExplanation":["“hokerer”看起来像把“hooker”拼错了（多了一个 r 或元音拼写混乱）。如果你其实想表达别的词（比如 hockey player / hiker / hacker 等），把句子发我，我可以根据上下文帮你确认正确拼法和意思。","“hooker”在日常英语里最常见的是对性工作者的俚称，语气通常不尊重；在学习和使用时要注意场合。体育语境（橄榄球）里则是中性术语。"]}
{"word":"hokerly","summary":{"en":"“Hokerly” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“hokerly”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name (e.g., a surname or place name). If you meant a different word, common nearby spellings include “hokey,” “hooker,” or “hucksterly,” depending on context.","zh":"不是标准英语单词。更可能是拼写错误，或是专有名词（如姓氏/地名）。如果你想表达的是别的词，常见的相近拼写可能是“hokey（俗气的/做作的）”、“hooker（妓女；钩球员等，视语境）”或“hucksterly（像小贩式的，较少见）”，具体取决于上下文。"},"examples":[{"en":"I couldn’t find “hokerly” in a dictionary—do you mean “hokey”?","zh":"我在词典里找不到“hokerly”——你是不是想写“hokey”？"},{"en":"Could you share the full sentence with “hokerly” so I can identify the intended word?","zh":"你能把包含“hokerly”的完整句子发我吗？这样我可以判断你真正想用的词。"}]}],"phonetic":"/ˈhoʊkərli/","extraExplanation":["“hokerly”按拼读可读作 /ˈhoʊkərli/，但它不属于常见标准词汇。最有效的办法是提供出现它的句子、来源（书/网站/对话/游戏ID等）或你想表达的意思，我可以帮你定位正确单词并解释用法。"]}
{"word":"hokes","summary":{"en":"“Hokes” is usually the third-person singular of “hoke”: to rig/tamper with something, or (often “hoke up”) to exaggerate a story.","zh":"“hokes” 通常是 “hoke” 的第三人称单数：表示篡改/操纵；或（常用 hoke up）夸大、渲染故事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to tamper with, rig, or “fix” something in a dishonest way","zh":"（不诚实地）篡改、操纵、做手脚"},"examples":[{"en":"Someone tried to hoke the results of the vote.","zh":"有人试图操纵投票结果。"},{"en":"The numbers looked like they had been hoked.","zh":"这些数字看起来像被人动过手脚。"}]},{"partOfSpeech":"v.","definition":{"en":"(often “hoke up”) to exaggerate or make something sound more dramatic or impressive than it really is","zh":"（常用 hoke up）夸大、渲染（使之听起来更戏剧化/更厉害）"},"examples":[{"en":"He hoked up the story to impress his friends.","zh":"他把故事夸大来给朋友留下深刻印象。"},{"en":"The ad hokes up the benefits of the product.","zh":"这则广告夸大了产品的好处。"}]}],"synonyms":["rig","tamper (with)","fix","falsify","exaggerate","embellish"],"phonetic":"/hoʊk/","extraExplanation":["“hokes” 通常是动词 “hoke” 的第三人称单数（he/she/it hokes），也可能是复数形式的误拼。","“hoke” 在日常口语里不算特别常见；如果你想表达“开玩笑”，多半是要找 “jokes”。如果想表达“骗局/恶作剧”，常用 “hoax”。","常见搭配：hoke up (a story/excuse)（夸大、编得更夸张）。"]}
{"word":"hokey","summary":{"en":"Hokey means cheesy or overly sentimental; sometimes it can also mean old-fashioned or fake (informal).","zh":"Hokey 常指“俗套肉麻、刻意煽情/做作”；也可指“老派土气”，或（非正式）“不真实、不靠谱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overly sentimental, cheesy, or trying too hard to be emotional or charming in an obvious way.","zh":"（表达或风格）矫情的、俗套肉麻的，刻意煽情或讨好而显得不自然。"},"examples":[{"en":"The movie’s ending felt a little hokey, but it still made me smile.","zh":"电影的结尾有点俗套肉麻，但还是让我笑了。"},{"en":"He wrote a hokey love letter full of clichés.","zh":"他写了一封充满陈词滥调的肉麻情书。"},{"en":"The commercial is funny, but some parts are hokey.","zh":"这广告挺好笑，但有些地方有点做作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Old-fashioned and not very sophisticated; simple in a slightly silly way.","zh":"老派而不够精致的；简单到有点傻气的。"},"examples":[{"en":"They decorated the cafe with hokey signs and vintage posters.","zh":"他们用老派的标语牌和复古海报装饰咖啡馆。"},{"en":"It’s a hokey little museum, but it’s fun to visit.","zh":"这是个有点土气的小博物馆，但参观起来挺有意思。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fake, not genuine, or untrustworthy (informal).","zh":"（非正式）假的、不真实的；不靠谱的。"},"examples":[{"en":"That explanation sounds hokey to me.","zh":"我觉得那个解释不太靠谱。"},{"en":"Be careful—some online reviews can be hokey.","zh":"小心点——有些网评可能是假的。"}]}],"synonyms":["cheesy","corny","clichéd","sentimental","tacky","phony"],"phonetic":"/ˈhoʊki/","extraExplanation":["“hokey”在美式英语里常用来吐槽电影、广告、演讲或表演“太刻意、太俗套”。它不一定很严重：有时带点善意，表示“虽然土/肉麻，但也挺可爱”。","常见搭配：hokey ending（俗套结局）、hokey dialogue（做作台词）、hokey jokes（老套笑话）、hokey charm（有点土但可爱的魅力）。","别和“hockey（冰球）”混淆：发音不同，拼写也不同。"]}
{"word":"hokeyness","summary":{"en":"Hokeyness means an overly sentimental, corny, or fake-sounding quality—something that feels cheesy or old-fashioned in a silly way.","zh":"Hokeyness 指“俗套、矫情、做作、不真诚”的感觉，也可指一种显得过时廉价、刻意卖弄而显得可笑的风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being overly sentimental, corny, or not genuinely sincere; cheesiness.","zh":"（言行、作品等）俗套、矫情、做作、不够真诚的感觉；“很尬/很土/很肉麻”的味道。"},"examples":[{"en":"The movie has a lot of heart, but the hokeyness can be distracting.","zh":"这部电影很有温情，但有些矫情的地方会让人出戏。"},{"en":"He tried to sound inspiring, yet the hokeyness made people laugh.","zh":"他想讲得很励志，但那种做作感反而让大家笑了。"}]},{"partOfSpeech":"n.","definition":{"en":"A style or quality that feels old-fashioned, cheap, or overly “showy” in a way that seems silly.","zh":"一种显得过时、廉价或刻意卖弄而显得可笑的风格/质感。"},"examples":[{"en":"She loves vintage décor, but not the hokeyness of fake antique signs.","zh":"她喜欢复古装饰，但不喜欢那种仿古招牌带来的廉价做作感。"},{"en":"The commercial’s hokeyness is part of its charm for some viewers.","zh":"对一些观众来说，这支广告的“土味做作”反而成了它的魅力。"}]}],"synonyms":["corniness","cheesiness","clichédness","sappiness","kitschiness"],"phonetic":"ˈhoʊki.nəs","extraExplanation":["“hokey”常用来形容“太刻意、太俗套、太肉麻”，语气多为轻微吐槽或批评；名词形式“hokeyness”就是“这种尬感/俗套感”。","在美式英语里它经常用来评论电影、广告、演讲台词、情感表达等：不是“坏”，而是“太用力、太老套”。","近义词语感对比：corny（俗、老套、土味，最常见）；cheesy（俗/廉价但有时可爱）；clichéd（陈词滥调，更偏“表达方式老套”）；cringey（让人尴尬，更偏“尬到起鸡皮疙瘩”）。"]}
{"word":"hokeypokey","summary":{"en":"Hokey Pokey usually refers to the well-known children’s song and circle dance; in British English it can also mean cheap ice cream.","zh":"Hokey Pokey通常指著名的儿童歌曲与集体舞；在英式英语中也可指廉价冰淇淋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a popular children’s song and group dance in which people follow simple instructions (e.g., “put your right foot in”)","zh":"（儿童）《Hokey Pokey》歌与集体舞：大家跟着口令做动作（如“把右脚伸进去”）"},"examples":[{"en":"At the birthday party, the kids did the Hokey Pokey in a big circle.","zh":"在生日派对上，孩子们围成一个大圈跳《Hokey Pokey》。"},{"en":"We played the Hokey Pokey as an easy warm-up activity in class.","zh":"我们在课上把《Hokey Pokey》当作简单的热身活动。"}]},{"partOfSpeech":"n.","definition":{"en":"(chiefly British) inexpensive ice cream, often sold from a cart","zh":"（主要英式）廉价冰淇淋（常见于小推车售卖）"},"examples":[{"en":"He bought a cone of hokey-pokey from the ice-cream man.","zh":"他从卖冰淇淋的小贩那里买了一个甜筒冰淇淋。"}]}],"synonyms":["The Hokey Pokey","action song","circle dance"],"phonetic":"/ˌhoʊkiˈpoʊki/","extraExplanation":["在美国语境里，Hokey Pokey最常指那首带口令的儿童歌曲/集体舞，常用于派对、幼儿园或团体破冰活动。","词形常写作Hokey Pokey或The Hokey Pokey；英式写法里也会见到连字符hokey-pokey表示“廉价冰淇淋”。","这首歌的口令常出现“put your ___ in/out”和“shake it all about”，其中“shake it all about”更自然的意思是“全身抖一抖/摇一摇”。"]}
{"word":"hokier","summary":{"en":"“Hokier” means “more hokey”: more corny, cheesy, or fake-sentimental.","zh":"“hokier”表示“更hokey”：更俗套、更土味/尬、更假煽情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of “hokey”) More silly, corny, or overly sentimental in a way that feels fake or awkward.","zh":"（“hokey”的比较级）更俗套、更做作或过度煽情，显得不真诚或尴尬。"},"examples":[{"en":"The sequel is hokier than the original, with jokes that feel forced.","zh":"续集比原作更俗套，笑点也显得很硬。"},{"en":"His apology sounded hokier as he added dramatic pauses.","zh":"他加了几处戏剧性停顿后，道歉听起来更做作了。"},{"en":"The ad’s message is sweet, but the music makes it even hokier.","zh":"广告的立意很温馨，但配乐让它显得更煽情、更俗套。"}]}],"synonyms":["cornier","cheesier","cringier","more sentimental (in a bad way)","more contrived"],"phonetic":"/ˈhoʊkiər/","extraExplanation":["“hokey”在美式英语里常用来形容“老套、土味、假煽情”。它常和电影、广告、台词、表演风格搭配：a hokey movie / a hokey speech。","词源上常被认为与早期舞台/杂耍表演（vaudeville）里夸张、廉价的表演风格有关，因此带有“表演痕迹重、不自然”的感觉。"]}
{"word":"hokiest","summary":{"en":"Hokiest means “the most hokey”: the most corny/overly sentimental or the most fake-looking and amateurish.","zh":"Hokiest 表示“最 hokey”：最俗套煽情、最尬，或最假、最廉价业余。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of \"hokey\") The most overly sentimental, corny, or cheesy—trying too hard to be emotional or cute.","zh":"（“hokey”的最高级）最俗套、最煽情、最“尬”的；过度卖弄情感或可爱。"},"examples":[{"en":"That was the hokiest ending I’ve ever seen—everyone hugged and the music swelled.","zh":"那是我看过最俗套的结局——所有人都拥抱在一起，音乐还突然变得很煽情。"},{"en":"His speech was the hokiest part of the ceremony, but people still clapped.","zh":"他的致辞是典礼里最“尬”的部分，但大家还是鼓掌了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Superlative of \"hokey\") The most fake-looking, low-quality, or amateurish; not professional or convincing.","zh":"（“hokey”的最高级）最显得假、廉价或业余的；不专业、不可信。"},"examples":[{"en":"The hokiest special effects made the monster look like a rubber toy.","zh":"最廉价的特效让怪物看起来像橡胶玩具。"},{"en":"It’s the hokiest website design, but the information is accurate.","zh":"这网站设计看起来最土最业余，但信息是准确的。"}]}],"synonyms":["corniest","cheesiest","cringiest","most sentimental","most fake-looking","most amateurish"],"phonetic":"ˈhoʊkiəst","extraExplanation":["“hokey”在美式英语里常用来吐槽影视、广告、演讲等“太做作/太套路”。语气通常是轻微批评，也可能带点调侃。","词源常被认为与“hokum”（指哗众取宠、虚假的舞台效果/噱头）有关，因此也带有“装出来的、唬人的”的感觉。"]}
{"word":"hokily","summary":{"en":"“Hokily” means “in a fake, cheesy, or overly sentimental way.”","zh":"“hokily”表示“以做作、俗套、过度煽情而显得不真实的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a silly, exaggerated, or overly emotional way that feels fake or not natural.","zh":"以做作、夸张或过度煽情的方式；显得不自然、很假。"},"examples":[{"en":"The movie ends hokily, with everyone hugging in slow motion.","zh":"电影的结尾很做作：大家用慢动作拥抱在一起。"},{"en":"He smiled hokily to impress the audience, but it didn’t feel sincere.","zh":"他为了讨好观众而做作地笑，但一点也不真诚。"}]}],"synonyms":["cheesily","cornily","sentimentally","tackily"],"phonetic":"/ˈhoʊki.li/","extraExplanation":["“hokily”来自形容词“hokey”（做作的、俗套的、煽情过头的）。常用来批评电影、广告、演讲、表演或故事结尾：不是单纯“感人”，而是“刻意煽情、套路化”，让人觉得尴尬或不真实。语气偏负面。"]}
{"word":"hokiness","summary":{"en":"Hokeyness means an overly sentimental, silly, or artificial quality that feels insincere.","zh":"Hokeyness 指过度煽情、俗套或做作、显得不真诚的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too emotional, silly, or artificial in a way that feels not sincere (often about movies, stories, speeches, or jokes).","zh":"（电影、故事、演讲、笑话等）“煽情得过头 / 俗套 / 做作、假”的特质；让人觉得不真诚。"},"examples":[{"en":"Some viewers loved the film, but others complained about its hokeyness.","zh":"有些观众很喜欢这部电影，但也有人抱怨它太俗套、太“尬”。"},{"en":"I enjoy romantic comedies, even when the hokeyness is obvious.","zh":"我喜欢浪漫喜剧，即使那种明显的俗套感很强。"},{"en":"The speech would be stronger if you removed a bit of the hokeyness.","zh":"如果去掉一点做作的煽情，这篇演讲会更有力量。"}]}],"synonyms":["corniness","cheesiness","sentimentality","cliché"],"phonetic":"/ˈhoʊki.nəs/","extraExplanation":["你输入的拼写“hokiness”更常见的标准拼写是 **hokeyness**（来自形容词 **hokey**）。在日常英文里，人们更常用 **hokey** 来形容，而名词 **hokeyness** 用来指“这种俗套/做作的程度”。","**语气与场景**：通常带一点批评或调侃，意思接近“尴尬、土味、套路化”，但不一定很严重；也有人会带着喜欢的态度说“虽然俗，但我爱看”。","相关近义表达（语感不同）：**corniness**（更偏“老套、土”）、**cheesiness**（更偏“肉麻、腻”）、**sentimentality**（更偏“过度感伤/煽情”）。"]}
{"word":"hoking","summary":{"en":"“Hoking” usually means rummaging around or digging up old information (from the verb “hoke”), though it’s uncommon in modern American English.","zh":"“hoking”通常指“翻找、乱翻”或“把旧事/信息挖出来”（源自动词“hoke”），但在现代美式英语中不算常见。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(present participle of “hoke”) searching or rummaging around, often by poking or digging.","zh":"（“hoke”的现在分词）翻找、乱翻，常带有“用手拨弄/挖找”的感觉。"},"examples":[{"en":"I was hoking around in the drawer looking for my keys.","zh":"我在抽屉里翻找钥匙。"},{"en":"Stop hoking through my stuff without asking.","zh":"别不问就乱翻我的东西。"}]},{"partOfSpeech":"vt.","definition":{"en":"(present participle of “hoke”) digging up or bringing up information, memories, or old issues—sometimes in an annoying way.","zh":"（“hoke”的现在分词）把信息/回忆/旧事“翻出来、挖出来”，有时带烦人或挑事的语气。"},"examples":[{"en":"Reporters kept hoking up old stories about the actor.","zh":"记者不断翻出那位演员的旧闻。"},{"en":"We don’t need to keep hoking up the past.","zh":"我们没必要老把过去翻出来讲。"}]}],"synonyms":["rummaging","poking around","digging up","ferreting out"],"phonetic":"/ˈhoʊkɪŋ/","extraExplanation":["“hoke”在现代美式英语里不算常见，更多见于苏格兰/爱尔兰英语或较口语的用法，常与 around / through / up 连用：hoke around（到处翻找）、hoke through（翻遍）、hoke up（翻出/挖出旧事）。","很多人写的“hoking”其实可能是拼写错误，想写的是“hocking”（/ˈhɑkɪŋ/），意思常是“典当（hock）”或“沿街兜售/叫卖（hawk）”。如果你告诉我上下文句子，我可以帮你确认是哪一个。"]}
{"word":"Hokkien","summary":{"en":"Southern Min Chinese spoken by Fujian/Taiwan and many Southeast Asian communities","zh":"闽南语（福建南部及台湾、东南亚华人常用的南部闽语）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variety of Southern Min (Min Nan) Chinese spoken mainly in southern Fujian and widely used in Taiwan and Southeast Asian Chinese communities","zh":"闽南语（南部闽语）的一支，主要通行于福建南部，并广泛用于台湾及东南亚华人社群"},"examples":[{"en":"My grandparents speak Hokkien at home.","zh":"我祖父母在家里说闽南语（福建话）。"},{"en":"In Singapore, you can hear Hokkien in older neighborhoods.","zh":"在新加坡，一些老社区还能听到闽南语（福建话）。"},{"en":"She learned basic Hokkien to talk with her in-laws.","zh":"她学了一些基础闽南语（福建话）来和公婆沟通。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Hokkien language or to people/culture associated with it","zh":"与闽南语（福建话）有关的；与闽南／福建相关族群与文化有关的"},"examples":[{"en":"They serve Hokkien-style noodles at this restaurant.","zh":"这家餐馆卖福建风味的面。"},{"en":"He joined a Hokkien cultural association.","zh":"他加入了一个福建（闽南）文化社团。"}]}],"synonyms":["Southern Min","Minnan","Min Nan","Taiwanese"],"phonetic":"/ˈhɑkiən/","extraExplanation":["用法提醒：Hokkien 常被当作“闽南语/福建话”的一种称呼；在不同地区它的指向会略有差异（如新加坡、马来西亚多指当地华人社群常用的闽南语；台湾语境下常与“台语”高度接近但不完全等同）。","写法：也可见拼写 Hokien（较少见）。"],"etymology":"源自闽南语对“福建”(Fujian)的读音（常转写作 Hokkien / Hok-kian）。在英语里多用来指福建南部移民社群所使用的闽南语变体，也常与台湾常见的闽南语（台语）有高度重叠。","mnemonic":["把 Hokkien 记成“福建”的海外拼法：Hok（福）+ kien（建），对应“福建”。","联想“福建面/福建话”：很多英语语境里提到 Hokkien，常与福建移民社群与饮食文化一起出现。"]}
{"word":"hokku","summary":{"en":"Hokku is the traditional opening verse of a Japanese linked poem (renga) and the historical ancestor of the modern haiku.","zh":"Hokku（发句）是日本连歌的开篇句，也是现代俳句（haiku）的历史前身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short Japanese poem (traditionally 17 syllables in a 5–7–5 pattern) that was originally the opening verse of a linked-verse poem (renga); it later developed into what is now known as the haiku","zh":"（日本）发句：一种短诗，传统上为17音（常被简化理解为5-7-5），原本是连歌（renga）的开篇第一句，后来逐渐发展为今天所说的俳句（haiku）"},"examples":[{"en":"In classical Japanese poetry, the hokku sets the season and mood for the rest of the renga.","zh":"在古典日本诗歌中，发句会为后续整首连歌设定季节与氛围。"},{"en":"She wrote a hokku about early spring rain and a quiet street.","zh":"她写了一首发句，描绘早春细雨与安静的街道。"}]}],"synonyms":["opening verse (of a renga)","haiku (closely related)","renga verse"],"phonetic":"/ˈhɑku/","extraExplanation":["“Hokku（发句）”与“haiku（俳句）”常被混用，但严格说：发句是连歌的“开场句”，更强调为整组联句定调；俳句则是在近代从发句独立出来的短诗形式。","发句/俳句常包含“季语”（表示季节的词）与“切字”（日语中的停顿或转折标记）；用英文写作时，人们有时会用标点或换行来模拟这种“切”的效果。","在英语文学与翻译中，松尾芭蕉等人的作品常被称为“haiku”，但讨论历史语境或连歌结构时，更常用“hokku”。"]}
{"word":"hokum","summary":{"en":"Hokum means nonsense or fake, overly sentimental talk or material, especially used to criticize ads, speeches, or entertainment.","zh":"Hokum 指空洞的胡说八道或虚假的、过度煽情的内容，常用于批评广告、演讲或娱乐作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nonsense or empty talk that sounds impressive but has little real meaning; sometimes used for fake or overly sentimental material in entertainment.","zh":"（听起来很唬人但）空洞的胡说八道；也可指影视/表演里刻意煽情、套路化但不真实的内容。"},"examples":[{"en":"Don’t believe that marketing hokum—check the facts first.","zh":"别信那些营销噱头式的胡扯——先核实事实。"},{"en":"The speech was full of patriotic hokum but offered no clear plan.","zh":"那场演讲充满爱国口号式的空话，却没有明确方案。"},{"en":"Some critics said the movie relied on romantic hokum instead of strong storytelling.","zh":"一些影评人说这部电影靠俗套煽情，而不是扎实的叙事。"}]}],"synonyms":["nonsense","baloney","bunk","claptrap","hot air"],"phonetic":"/ˈhoʊkəm/","extraExplanation":["“hokum”常带有不屑或嘲讽语气，强调“看起来像那么回事，但其实没内容/不可信”。在评论广告、政治话术、网络鸡汤或套路化剧情时很常见。","词源多认为来自戏剧/杂耍圈（vaudeville）俚语，指吸引观众的老套桥段或哗众取宠的表演手法，后来引申为“胡扯、忽悠”。"]}
{"word":"hokums","summary":{"en":"Hokum means obvious nonsense or overly sentimental stuff, especially in stories or persuasive talk.","zh":"hokum 指明显的胡说八道或过度煽情的“套路”，常见于故事情节或劝说性话语中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(uncountable) Something that is obviously false, silly, or too sentimental—often used for stories, speeches, or advertising that tries to manipulate feelings.","zh":"（不可数）明显虚假、愚蠢或过度煽情的东西；常指故事、演讲或广告里用来操控情绪的“套路/鬼话”。"},"examples":[{"en":"The movie is entertaining, but there’s a lot of hokum in the plot.","zh":"这部电影挺好看，但剧情里有不少套路/胡编的成分。"},{"en":"Don’t believe that sales hokum—read the details first.","zh":"别信那套推销鬼话——先把细节看清楚。"},{"en":"His speech was full of patriotic hokum.","zh":"他的演讲充满了煽情的爱国套话。"}]}],"synonyms":["nonsense","baloney","drivel","sentimentality","cliché","hype"],"phonetic":"/ˈhoʊkəm/","extraExplanation":["“hokum”常见于口语和评论性写作，语气带批评：指“廉价煽情”“故弄玄虚的说辞”。在影评里，它常用来吐槽剧情不可信或刻意煽情。","词源上与20世纪初美国杂耍/舞台表演有关：指为取悦观众而使用的老套桥段与夸张表演，因此带有“陈词滥调、哗众取宠”的味道。","你输入的“hokums”是复数用法，表示“多种/多段套路、鬼话”。不过“hokum”也常当不可数名词使用（a lot of hokum）。"]}
{"word":"hokypokies","summary":{"en":"Hokey pokey refers either to a well-known party dance/song or (in New Zealand) honeycomb-toffee pieces and the ice-cream flavor made with them.","zh":"Hokey pokey 既可指著名的派对舞蹈/歌曲，也可（在新西兰）指蜂窝太妃糖碎以及加入这种碎的冰淇淋口味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple party dance and song where people follow silly, repeated instructions (often written “Hokey Pokey” in the U.S.; “Hokey Cokey” in the U.K.)","zh":"一种聚会常见的简单舞蹈和歌曲，大家跟着反复、搞笑的口令做动作（美式常写作 Hokey Pokey；英式常写作 Hokey Cokey）"},"examples":[{"en":"At the wedding reception, everyone joined the Hokey Pokey.","zh":"在婚礼的宴会环节，大家都一起跳了“霍基波基”。"},{"en":"The kids learned the Hokey Pokey at camp.","zh":"孩子们在夏令营学会了跳“霍基波基”。"}]},{"partOfSpeech":"n.","definition":{"en":"(New Zealand English) small pieces of honeycomb toffee, or a flavor of ice cream that includes those pieces","zh":"（新西兰英语）蜂窝太妃糖碎块；或指含这种碎块的冰淇淋口味"},"examples":[{"en":"I’ll have a scoop of hokey pokey ice cream, please.","zh":"请给我来一球 hokey pokey 口味的冰淇淋。"},{"en":"These cookies are topped with hokey pokey bits.","zh":"这些饼干上撒了蜂窝太妃糖碎。"}]}],"synonyms":["Hokey Pokey","Hokey Cokey","party dance","honeycomb toffee (NZ context)"],"phonetic":"/ˌhoʊki ˈpoʊki/","extraExplanation":["“hokypokies”更像是把 hokey pokey（或 hokey-pokey）写成了连写并加复数的形式。常见写法有：Hokey Pokey / hokey pokey / hokey-pokey；复数可写 hokey pokeys，表示“几次这种舞/这类甜食碎”。","文化小提示：在新西兰，“hokey pokey”最常让人想到的是经典冰淇淋口味（香草底+蜂窝太妃糖碎）；在美国，更多人先想到派对舞曲。"]}
{"word":"hokypoky","summary":{"en":"“hokypoky” is a variant spelling of “Hokey Pokey,” a popular children’s song and dance; informally it can also mean something silly or not serious.","zh":"“hokypoky”通常是“Hokey Pokey”的变体拼写，指常见的儿童歌舞；口语里也可引申为“胡闹的/不严肃的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A playful children’s song and circle dance (also spelled “hokey pokey”), where people follow simple actions like putting a body part “in” and “out.”","zh":"一种童谣和集体圈舞（也拼作“hokey pokey”），大家跟着歌词做动作，比如把手脚“伸进去/伸出来”。"},"examples":[{"en":"At the birthday party, the kids danced the Hokey Pokey in a circle.","zh":"在生日派对上，孩子们围成一圈跳“霍基波基舞”。"},{"en":"We learned “You put your right hand in…” in music class.","zh":"我们在音乐课上学了“把右手伸进去……”这段歌词。"}]},{"partOfSpeech":"adj.","definition":{"en":"Informal: silly, nonsense, or not serious (common meaning of “hokey,” and sometimes used with this spelling in casual writing).","zh":"非正式：愚蠢的、胡闹的、不严肃的（更常见写法是“hokey”，口语/随意写作中偶尔也会看到这种拼法）。"},"examples":[{"en":"The movie’s ending felt a bit hokey-pokey, but it was fun.","zh":"电影结局有点俗套胡闹，但挺好玩。"},{"en":"Don’t give me hoky-poky excuses—just tell me the truth.","zh":"别跟我扯那些不靠谱的借口——直接说实话。"}]}],"synonyms":["Hokey Pokey","hokey","silly","nonsense"],"phonetic":"/ˌhoʊki ˈpoʊki/","extraExplanation":["“Hokey Pokey”在美国和加拿大非常常见，常用于儿童聚会、学校活动、夏令营等；动作简单、气氛热闹，歌词核心句是“That’s what it’s all about.”","更标准、更常见的拼法是“hokey pokey”（两个词）或“Hokey Pokey”（专有名词大写）。你输入的“hokypoky”属于不太规范的变体拼写。"]}

