{"word":"hoo","summary":{"en":"“Hoo” is an exclamation used to imitate an owl’s call or to cheer/chant in a crowd.","zh":"“hoo”是感叹词，常用来模仿猫头鹰的叫声，也可用于人群中助威或口号。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"an exclamation that imitates the sound of an owl, or a deep “whoo” sound","zh":"（感叹词）模仿猫头鹰的叫声，或类似低沉的“whoo/呜—”的声音"},"examples":[{"en":"Hoo, hoo! An owl is calling in the trees.","zh":"呜—呜—！有只猫头鹰在树上叫。"},{"en":"In the dark, we heard a soft “hoo” from the forest.","zh":"在黑暗中，我们听到森林里传来轻轻的“呜—”声。"}]},{"partOfSpeech":"int.","definition":{"en":"a shouted sound used to cheer, chant, or show excitement (often repeated: “hoo! hoo!”)","zh":"（感叹词）用于欢呼、助威或节奏口号的喊声（常重复：hoo! hoo!）"},"examples":[{"en":"The crowd went, “Hoo! Hoo!” as the team ran onto the field.","zh":"球队跑进球场时，观众喊着“hoo！hoo！”助威。"},{"en":"They chanted “hoo” to keep the marching rhythm.","zh":"他们用“hoo”的口号来保持行进节奏。"}]}],"synonyms":["whoo","hoot (sound)","cheer","chant"],"phonetic":"/huː/","extraExplanation":["“hoo/hoo-hoo”多用于拟声（猫头鹰叫声）或群体口号。写作中常见于氛围描写（夜晚、森林）或现场助威。拼写也可能出现为“whoo”。"]}
{"word":"hooch","summary":{"en":"Hooch is an informal word for strong alcohol, especially homemade or illegal liquor.","zh":"Hooch 是口语词，指烈性酒，尤其是自酿或非法酿造的酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Strong alcoholic drink, especially homemade or illegally made alcohol.","zh":"（非正式）烈性酒；尤指自酿或非法酿造的酒。"},"examples":[{"en":"They were caught selling homemade hooch.","zh":"他们因出售自酿的烈酒而被抓。"},{"en":"He drank some hooch and got sick.","zh":"他喝了点烈酒，结果不舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Alcohol in general.","zh":"（非正式）酒精饮料；酒（泛指）。"},"examples":[{"en":"There won’t be any hooch at the party.","zh":"派对上不会有酒。"},{"en":"The bar serves food, not hooch.","zh":"这家店卖吃的，不卖酒。"}]}],"synonyms":["liquor","booze","moonshine","spirits"],"phonetic":"/hutʃ/","extraExplanation":["“hooch”在美式英语里很口语，常带一点“粗烈、不太正规”的感觉，常让人联想到私酿酒（moonshine）或禁酒令时期的地下酒。","词源常被认为与阿拉斯加的“Hoochinoo”（一种烈酒/相关地名与族群称呼）有关，后来在英语口语中泛化为“烈酒、私酒”。","语气提示：在正式场合更常说“alcohol”“liquor”“spirits”；“hooch”更适合口语、故事叙述或带点幽默/贬义的语境。"]}
{"word":"hooches","summary":{"en":"“Hooches” is the plural of “hooch,” most commonly meaning illegally made homemade alcohol; in some English varieties it can also mean simple huts/shacks.","zh":"“hooches”是“hooch”的复数，最常见指私酿/自酿的烈酒；在某些英语变体中也可指简陋的小屋、棚屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Illegally made strong alcohol; homemade liquor (often called “moonshine”).","zh":"（复数）私酿的烈酒；自酿酒（常称“moonshine/月光酒”）。"},"examples":[{"en":"They found bottles of hooches hidden in the garage.","zh":"他们在车库里发现了藏起来的几瓶私酿酒。"},{"en":"During Prohibition, people secretly drank hooches at parties.","zh":"禁酒令时期，人们在聚会上偷偷喝私酿酒。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Small, simple huts or shacks (informal; used in some varieties of English, especially in Australia).","zh":"（复数）（非正式；部分英语变体中常见，尤指澳大利亚）简陋的小屋、棚屋。"},"examples":[{"en":"The workers slept in rough hooches near the site.","zh":"工人们在工地附近的简易棚屋里睡觉。"},{"en":"We stayed in tiny beach hooches for the weekend.","zh":"我们周末住在海边的小棚屋里。"}]}],"synonyms":["moonshine","bootleg liquor","homemade liquor","shacks","huts"],"phonetic":"/ˈhuːtʃɪz/","extraExplanation":["“hooch”（私酿酒）很可能来自阿拉斯加的“hoochinoo”（一种烈酒/酒的名字），后来在美国英语里变成口语，泛指非法或自酿的烈酒。","如果你看到的语境和澳大利亚/户外住宿有关，“hooch(es)”也可能指简陋小屋；而在美国语境中更常见的通常是“私酿酒”的意思。"]}
{"word":"hoochinoo","summary":{"en":"“Hoochinoo” is a historical word for strong, often illegally made liquor, especially in Alaska-related contexts.","zh":"“Hoochinoo”是一个带历史背景的词，指烈性酒（常为私酿/非法酒），多见于与阿拉斯加有关的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong distilled alcoholic drink (especially homemade or illegally made), historically associated with Alaska; similar to “hooch” or “moonshine.”","zh":"烈性蒸馏酒（尤指自酿或非法酿造的酒）；历史上与阿拉斯加地区相关，类似“私酿酒/土烧酒（moonshine）”。"},"examples":[{"en":"The old newspaper article mentioned “hoochinoo” being traded along the coast.","zh":"那篇旧报纸文章提到沿海地区有人交易“hoochinoo”（烈性私酿酒）。"},{"en":"In some historical accounts, hoochinoo referred to illegally distilled liquor in Alaska.","zh":"在一些历史记载中，hoochinoo指的是阿拉斯加地区的非法蒸馏酒。"}]}],"synonyms":["moonshine","hooch","bootleg liquor","illicit whiskey"],"phonetic":"/ˌhuːtʃɪˈnuː/","extraExplanation":["“Hoochinoo”这个词常被认为与阿拉斯加原住民语言/地名有关（历史上曾用来指某个社区或地区的酒）。在现代语境中，这个词可能带有刻板印象或不够尊重的历史色彩；更中性、常见的说法通常用“moonshine（私酿酒）”“bootleg liquor（私酒）”或“hooch（烈酒/私酒的俚语）”。","用法提示：它更常出现在历史资料、旧报刊或地方文化背景中；日常英语里很少用，且最好避免用来指代某个族群或地区的人。"]}
{"word":"hood","summary":{"en":"“Hood” most commonly means a head covering on clothing, the cover over a car engine, or (informally) a neighborhood (“the hood”). It can also mean a criminal (slang) or the verb “to cover with a hood.”","zh":"“hood”最常见指衣服上的兜帽、汽车引擎盖，或（非正式）街区/社区（the hood）。也可指俚语“流氓/罪犯”，或作动词表示“用罩子遮住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A covering for the head and neck, often attached to a coat or sweatshirt.","zh":"（外套或卫衣上连着的）兜帽；头颈部的遮盖物。"},"examples":[{"en":"It started raining, so I pulled up my hood.","zh":"开始下雨了，所以我把兜帽拉起来。"},{"en":"She wore a hoodie with the hood up to keep warm.","zh":"她穿着连帽卫衣，把兜帽戴起来保暖。"}]},{"partOfSpeech":"n.","definition":{"en":"The metal cover over the engine of a car; in British English, this is called the “bonnet.”","zh":"（汽车）引擎盖（英式英语常说 bonnet）。"},"examples":[{"en":"Smoke was coming from under the hood.","zh":"烟从引擎盖下面冒出来。"},{"en":"Open the hood and check the oil level.","zh":"打开引擎盖，检查机油液位。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: a neighborhood, especially an urban one (often used in phrases like “the hood”).","zh":"（非正式）街区、社区（尤指城市里的；常用于“the hood”）。"},"examples":[{"en":"He moved back to the hood to be closer to his family.","zh":"他搬回了原来的街区，离家人更近。"},{"en":"This restaurant is famous in the hood.","zh":"这家餐馆在本地街区很有名。"}]},{"partOfSpeech":"n.","definition":{"en":"Slang (can be offensive/stereotyping in some contexts): a hoodlum; a criminal or violent person.","zh":"俚语（在一些语境中可能带有冒犯/刻板印象）：流氓；罪犯；暴力分子。"},"examples":[{"en":"The movie portrays him as a hood, but real life is more complicated.","zh":"电影把他塑造成一个“流氓”，但现实要复杂得多。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover or hide something with a hood or similar covering.","zh":"用兜帽或类似罩子覆盖、遮住。"},"examples":[{"en":"The falcon was hooded to keep it calm.","zh":"给猎鹰戴上头罩以让它保持安静。"}]}],"synonyms":["cap","hoodie (related)","engine cover","bonnet (BrE for car meaning)","neighborhood","area"],"phonetic":"/hʊd/","extraExplanation":["“the hood”在美式英语里常指“我住的那片街区/社区”，多见于口语、嘻哈文化和影视作品中。它本身不一定是负面的，但有时会被用来暗示“治安不好或贫困的地区”，因此在正式场合更建议用“neighborhood/area/community”。","“hood”表示“流氓/罪犯”的用法来自“hoodlum”。这个意思带评价色彩，容易贴标签；描述真实人物时要注意语气与偏见。"]}
{"word":"hood-cap","summary":{"en":"A hooded hat or a hood-shaped protective cover.","zh":"带兜帽的帽子或兜形防护盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cap (hat) that includes a hood, or a hooded hat that covers the head and sometimes the neck.","zh":"带兜帽的帽子；连帽帽（可覆盖头部，有时也遮到颈部）。"},"examples":[{"en":"In cold weather, a hood-cap keeps your ears warm.","zh":"天气冷的时候，连帽帽能让你的耳朵保持温暖。"},{"en":"The children wore hood-caps under their jackets on the hike.","zh":"徒步时，孩子们在外套里戴着连帽帽。"}]},{"partOfSpeech":"n.","definition":{"en":"A protective cap or cover shaped like a hood, used to shield a part of a device or object.","zh":"（形似兜帽的）保护罩；防护盖（用于遮挡或保护物体/设备的一部分）。"},"examples":[{"en":"Make sure the hood-cap is on before you store the tool.","zh":"收纳工具前，确认把防护盖盖好。"},{"en":"Dust got inside because the hood-cap was missing.","zh":"因为缺了防护盖，灰尘进去了。"}]}],"synonyms":["hooded cap","hooded hat","hood","cover","protective cap","cap","cowl"],"phonetic":"ˈhʊd ˌkæp","extraExplanation":["写法上常见三种：hood-cap（带连字符）、hood cap（分开写）、hoodcap（合写）。具体以品牌/说明书/语境为准。","若出现在服装语境，多半指“带兜帽的帽子”；若在工具、设备、零件说明中，则更可能指“防护盖/罩”。"],"etymology":"由 hood（兜帽）+ cap（帽子/帽盖）构成的复合词，直观描述“像兜帽一样的帽/盖”。在不同行业语境中可指服饰或防护罩。","mnemonic":["hood=“兜帽”，cap=“帽子/盖子”，合起来就是“带兜帽的帽子/像兜帽的盖子”。","联想：冬天穿连帽卫衣（hoodie）再加一顶帽（cap）→ hood-cap。"]}
{"word":"hood-like","summary":{"en":"shaped like a hood; hood-shaped","zh":"兜帽状的；像头罩一样的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hood in shape or appearance; having a covering or projecting part like a hood.","zh":"像兜帽/头罩一样的；呈兜帽状的；带有类似兜帽的覆盖或凸出部分。"},"examples":[{"en":"The jacket has a hood-like collar that can fold over the neck.","zh":"这件夹克有一个兜帽状的领子，可以翻下来盖住脖子。"},{"en":"Some flowers have hood-like petals that protect the inner parts.","zh":"有些花的花瓣呈兜帽状，用来保护内部结构。"},{"en":"The statue’s hood-like shadow made the face look mysterious.","zh":"雕像投下的兜帽状阴影让脸看起来更神秘。"}]}],"synonyms":["hooded","cowl-like","cap-like","hood-shaped"],"phonetic":"/ˈhʊdˌlaɪk/","extraExplanation":["“-like” 是常见后缀，表示“具有……的特征/外观”。写作时通常用连字符（hood-like）更清晰，尤其是放在名词前作定语时（a hood-like shape）。"],"etymology":"由 hood（兜帽、头罩）+ -like（“像……一样的”）构成；常用于描述外形特征，尤其在服装、建筑、植物与解剖结构等语境中。","mnemonic":["把它拆开记：hood（兜帽）+ like（像）→ “像兜帽一样”。","联想中文“兜帽状”，看到 -like 就想到“……状/……似的”。"]}
{"word":"hood-shaped","summary":{"en":"shaped like a hood","zh":"像兜帽般的形狀"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a hood (a covering that fits over the head, or something similar in form).","zh":"呈兜帽狀的；形狀像帽兜（或像可罩住頭部的罩子）的。"},"examples":[{"en":"The jacket has a hood-shaped collar that blocks the wind.","zh":"這件外套有兜帽狀的領口，可以擋風。"},{"en":"A hood-shaped canopy covered the entrance.","zh":"入口上方有一個兜帽狀的遮棚。"},{"en":"Some flowers have hood-shaped petals to protect pollen from rain.","zh":"有些花的花瓣呈兜帽狀，用來保護花粉不被雨淋。"}]}],"synonyms":["hoodlike","cowl-shaped","cap-shaped"],"phonetic":"/ˈhʊd ʃeɪpt/","extraExplanation":["多用連字號（hood-shaped）作為定語放在名詞前：a hood-shaped collar/canopy。若放在名詞後作表語，也可見到不加連字號的寫法：The collar is hood shaped。","在植物學或動物形態描述中也很常見，用來形容像「兜帽／頭巾」般覆蓋或拱起的結構。"],"etymology":"由 hood（帽兜、罩子）+ shaped（…形狀的）組成的複合形容詞；常用來描述衣物設計、建築構件或生物外形。","mnemonic":["把它拆開記：hood（兜帽）+ shaped（有…形狀的）＝「兜帽形狀的」。","聯想中文「兜帽」兩字的「兜」有包住、罩住的感覺，畫面感強：像帽兜一樣罩起來。"]}
{"word":"hood-shyness","summary":{"en":"fear or resistance to being hooded or covered, especially in falconry","zh":"對戴頭罩或被遮蓋的恐懼與抗拒（常指獵鷹術中的猛禽）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Falconry) A bird of prey’s fear of, or resistance to, being hooded (having a hood placed over its head to keep it calm).","zh":"（獵鷹術）猛禽對「戴頭罩」的恐懼或抗拒（把頭罩套在頭上以安撫、穩定牠）。"},"examples":[{"en":"The falconer worked patiently to reduce the hawk’s hood-shyness.","zh":"獵鷹師耐心地訓練，以降低那隻鷹對頭罩的抗拒。"},{"en":"Because of her hood-shyness, the bird became stressed whenever the hood came out.","zh":"因為牠怕頭罩，每次拿出頭罩牠就會緊張。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, a strong reluctance to accept being covered, restrained, or handled—especially after a bad experience.","zh":"（引申）對被遮蓋、被約束或被人觸碰的強烈排斥，常見於有不愉快經驗之後。"},"examples":[{"en":"After the rough checkup, the dog showed hood-shyness and resisted the muzzle.","zh":"經歷那次粗暴的檢查後，狗變得很排斥被套住，連口套都不願意戴。"},{"en":"The trainer treated the animal’s hood-shyness as a sign to slow down and rebuild trust.","zh":"訓練師把牠的抗拒視為需要放慢步調、重建信任的訊號。"}]}],"synonyms":["neophobia","wariness","timidity","shyness","avoidance","resistance"],"phonetic":"/ˈhʊd ˌʃaɪnəs/","extraExplanation":["在獵鷹術中，給猛禽「戴頭罩」是常見管理方式：遮住視線能讓牠更安定、更容易被攜帶與操作。若鳥曾被粗暴對待或受驚，就可能對頭罩產生「條件反射」式的抗拒。"],"etymology":"源自獵鷹術用語：hood（頭罩；給鷹戴的罩子）+ shyness（畏縮、害怕）。先有形容詞 hood-shy（不肯戴罩的），再名詞化為 hood-shyness。","mnemonic":["把 hood 聯想成「帽子/罩子」，hood-shyness 就是「怕戴帽（罩）」→ 不肯被罩住。","shy=害羞、退縮；合起來就是「對頭罩很退縮」。"]}
{"word":"hoodcap","summary":{"en":"A hoodcap is usually a hooded cap (a cap combined with a hood); less commonly, it can mean a protective cover on a hood-shaped machine part.","zh":"hoodcap 通常指“连帽帽子”（帽子与帽兜结合）；较少情况下也可指机器上罩形部件的保护盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cap (hat) that is attached to, combined with, or worn with a hood; a hooded cap.","zh":"连帽帽子；带帽兜的鸭舌帽/便帽（帽子与帽兜连在一起或搭配使用）。"},"examples":[{"en":"He wore a hoodcap to keep warm in the wind.","zh":"他戴着连帽帽子，在风里保暖。"},{"en":"This jacket has a built-in hoodcap for rainy days.","zh":"这件外套带有一体式连帽帽子，适合下雨天。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a protective cap/cover for a hood-shaped part on a machine or device.","zh":"（较少见）用于机器/设备上“罩形部件（hood）”的保护盖/端盖。"},"examples":[{"en":"Check whether the hoodcap is seated properly before turning the machine on.","zh":"开机前检查一下保护盖是否安装到位。"}]}],"synonyms":["hooded cap","cap with a hood","hood-cap","protective cap","cover cap"],"phonetic":"/ˈhʊdˌkæp/","extraExplanation":["“hoodcap”并不是非常常见的标准拼写；在日常英语里更常见的是分开写或加连字符：hood cap / hood-cap，或直接说 hooded cap、cap with a hood。","如果你是在服装/潮牌语境里看到它，它多半指“连帽+帽子”这种一体或叠穿的设计；在技术语境里则可能是某种“罩盖/端盖”的零件名称，具体含义要看行业说明书。"]}
{"word":"hooded","summary":{"en":"Hooded means having or wearing a hood, or being covered/obscured as if by a hood.","zh":"hooded 指“带/戴兜帽的”，也可引申为“像被兜帽遮住一样的、隐匿的/被笼罩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a hood; having a hood attached or covering the head.","zh":"带兜帽的；戴着兜帽的（连帽或用帽兜遮住头）。"},"examples":[{"en":"She wore a hooded jacket to stay warm in the wind.","zh":"风很大，她穿了一件连帽夹克保暖。"},{"en":"A hooded figure stood under the streetlight.","zh":"一个戴兜帽的身影站在路灯下。"}]},{"partOfSpeech":"adj.","definition":{"en":"Covered or hidden by a hood, as if shadowed or obscured.","zh":"（像被帽兜一样）遮蔽的、隐匿的；被阴影笼罩的。"},"examples":[{"en":"His hooded eyes made it hard to read his expression.","zh":"他眼睛有些下垂（像被遮住一样），让人难以看清表情。"},{"en":"The valley lay hooded in mist at dawn.","zh":"黎明时分，山谷笼罩在薄雾中。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a hood-like covering (used for some animals, plants, or shapes).","zh":"有“兜帽状”覆盖物的（用于某些动物、植物或形状的描述）。"},"examples":[{"en":"The hooded seal gets its name from the inflatable hood on the male’s head.","zh":"冠海豹（hooded seal）的名字来自雄性头部可充气的“帽兜”状结构。"}]}],"synonyms":["hooded","hooded-up","covered","shrouded","concealed"],"phonetic":"/ˈhʊdɪd/","extraExplanation":["“hooded figure（戴兜帽的人影）”在英语故事、电影和新闻里很常见，因为兜帽会遮住脸，营造“身份不明、神秘或危险”的氛围；描述时通常更偏“画面感”，不一定表示对方真的可疑。","形容人时，“hooded eyes”常指上眼睑较厚或下垂，眼睛看起来像被“遮住”，带一点文学描写色彩；在正式场合可用更中性说法如“heavy-lidded eyes”。"]}
{"word":"hooded-up","summary":{"en":"with the hood pulled up over the head","zh":"把兜帽拉起来戴着"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a hood with it pulled up over the head (often written with a hyphen before a noun).","zh":"把连帽拉起来戴在头上的；“连帽拉起”的（常在名词前用连字符）。"},"examples":[{"en":"He walked in with his jacket hooded-up because it was raining.","zh":"因为下雨，他走进来时把外套的帽子拉起来了。"},{"en":"A hooded-up teenager waited outside the store.","zh":"一个把帽子拉起来的青少年在店外等着。"},{"en":"She kept hooded-up to stay warm on the windy platform.","zh":"在有风的站台上，她一直把帽子拉起来保暖。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Trying to be less noticeable or to keep privacy by keeping the hood up.","zh":"（非正式）为了不显眼或保护隐私而把帽子拉起来（带有“遮挡自己”的意味）。"},"examples":[{"en":"He stayed hooded-up and quiet on the subway.","zh":"他在地铁上把帽子拉起来，安静不出声。"},{"en":"The celebrity went hooded-up to avoid photos.","zh":"那位名人把帽子拉起来以避免被拍照。"}]}],"synonyms":["hood up","hooded","hooded up","with the hood up","hood-up"],"phonetic":"/ˌhʊdɪd ˈʌp/","extraExplanation":["写法上：作表语时可写 hood up / hooded up；放在名词前更常见 hooded-up（复合形容词常用连字符）。","语气与场景：偏口语、描述穿着状态；有时会带一点“想低调/不想被认出”的暗示，但不一定。"],"etymology":"由 hood（兜帽）+ -ed（表示“处于……状态”）+ up（表示“向上/拉起”）组成的口语表达；常用连字符形成复合形容词，尤其放在名词前（如 hooded-up jacket）。","mnemonic":["记忆法：hood（帽子）+ up（拉上去）＝把帽子“拉起来”。","联想：看到“up”就想“往上拉”，hooded-up 就是“帽子往上拉好”的状态。"]}
{"word":"hoodedly","summary":{"en":"with the hood up; in a hooded manner","zh":"把兜帽拉起地；以戴兜帽的方式"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hooded way; with the hood of a coat, sweatshirt, etc. up, often partly covering the head or face.","zh":"戴着兜帽地；把外套/卫衣等的帽子拉起、遮住头部或部分脸部地。"},"examples":[{"en":"He walked hoodedly through the rain, trying not to be recognized.","zh":"他把兜帽拉起来在雨里走着，尽量不让人认出来。"},{"en":"The figure stood hoodedly at the corner, watching the street.","zh":"那人兜帽遮头地站在街角，注视着街道。"}]}],"synonyms":["with the hood up","hood-up","concealedly"],"phonetic":"/ˈhʊdɪdli/","extraExplanation":["用法提示：英语里更常见的表达是 with his/her hood up 或 hood up（口语/叙述）。hoodedly 多见于文学化或描写性较强的句子，用来强调“兜帽遮住”的视觉效果与神秘感。"],"etymology":"由形容词 hooded（“戴兜帽的”）+ 副词后缀 -ly 构成，表示“以……的方式”。这个副词形式较少见，写作中偶尔用来营造画面感。","mnemonic":["记忆法：hood（兜帽）+ -ly（……地）→“兜帽地/戴着兜帽地”。","联想：像中文“兜着帽子走”那种画面感，把 -ly 当作“地”。"]}
{"word":"hoodedness","summary":{"en":"Hoodedness means the quality of being hooded, often suggesting concealment or mystery.","zh":"Hoodedness 指“戴兜帽/有兜帽”的特征，也常引申为“遮掩带来的神秘感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being hooded (having a hood, or having the head/face covered by a hood)","zh":"“戴兜帽/有兜帽”的状态或特征（指衣物带兜帽，或头脸被兜帽遮住）"},"examples":[{"en":"The photographer focused on the hoodedness of the figure to create a sense of mystery.","zh":"摄影师强调人物的“兜帽遮掩感”，以营造神秘气氛。"},{"en":"In the cold wind, her coat’s hoodedness made her feel protected.","zh":"在冷风里，她外套的兜帽设计让她觉得更有安全感。"}]},{"partOfSpeech":"n.","definition":{"en":"a mysterious or concealed appearance, often because a hood (or something hood-like) hides details","zh":"（常因兜帽或类似遮盖物而产生的）隐匿、神秘的外观/感觉"},"examples":[{"en":"The character’s hoodedness kept the audience guessing about their identity.","zh":"这个角色的“遮掩神秘感”让观众一直猜不透身份。"},{"en":"The statue’s hoodedness gives it a solemn, secretive mood.","zh":"这座雕像的“罩覆感”让它呈现出庄重而隐秘的氛围。"}]}],"synonyms":["being hooded","coveredness","concealment","mysteriousness"],"phonetic":"/ˈhʊdɪdnəs/","extraExplanation":["“hoodedness”是由形容词“hooded”（戴兜帽的/有兜帽的）+ 名词后缀“-ness”（表示“性质、状态”）构成的抽象名词，表示“……的特征/程度”。","这个词在日常口语中不算常见，更常见的说法是用“being hooded”“wearing a hood”或直接用“hooded”来表达；在文学描写、艺术评论或较正式的写作里更容易见到。"]}
{"word":"hoodful","summary":{"en":"Hoodful means “as much as can be held in a hood,” and it can also be used figuratively in literary style to mean “a large amount.”","zh":"hoodful 指“兜帽能装满的一兜”，也可在较文学的语境中比喻“一大堆/大量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hoodful of something; an amount that fills a hood (especially the hood of a cloak).","zh":"一兜（帽子/兜帽所能装下的量）；尤指斗篷兜帽里装满的一兜。"},"examples":[{"en":"She gathered a hoodful of apples in her cloak and hurried home.","zh":"她用斗篷的兜帽兜了一兜苹果，急忙赶回家。"},{"en":"He tossed a hoodful of grain to the chickens.","zh":"他抓了一兜谷粒撒给鸡吃。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, literary) A large amount of something.","zh":"（比喻/文学用法）一大堆；大量。"},"examples":[{"en":"After the scandal, the newspaper printed a hoodful of rumors.","zh":"丑闻之后，报纸刊登了一大堆传闻。"},{"en":"I came home with a hoodful of questions.","zh":"我带着一大堆问题回到家。"}]}],"synonyms":["handful","armful","bagful","a lot (of)"],"phonetic":"/ˈhʊdˌfʊl/","extraExplanation":["“hoodful”是比较少见、带有古风色彩的名词，多见于文学或历史语境。它来自“hood（兜帽）+ -ful（……之满）”，像“handful / armful”一样表示“装满某个容器或能用某个部位捧起的量”。","过去斗篷的兜帽有时也会被当作临时“袋子”来装东西，因此这个词常出现在描写乡村生活、古代场景或叙事性文字中。现代英语更常说“a handful of … / a bagful of … / a lot of …”。"]}
{"word":"hoodie","summary":{"en":"A hoodie is a casual sweatshirt with a hood.","zh":"hoodie指“连帽衫/带帽卫衣”，一种休闲上衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a casual sweatshirt with a hood, usually with a front pocket and sometimes a zipper","zh":"连帽衫；带帽卫衣（通常有前口袋，有时带拉链）"},"examples":[{"en":"He wore a hoodie to stay warm on the bus.","zh":"他穿了一件连帽衫，在公交车上保暖。"},{"en":"My favorite hoodie has a big front pocket.","zh":"我最喜欢的那件连帽衫前面有一个大口袋。"},{"en":"At school, hoodies are allowed, but hats are not.","zh":"在学校里可以穿连帽衫，但不允许戴帽子。"}]}],"synonyms":["hooded sweatshirt","hooded top","sweatshirt (general)"],"phonetic":"/ˈhʊdi/","extraExplanation":["“hoodie”来自“hood（兜帽）”加上口语后缀“-ie”，语气更随意、亲切。","在美国文化里，hoodie很常见：运动、休闲、上学都能穿；但在部分场所（如银行、考试、某些学校）可能因遮挡脸部而被限制。","也常用来指“穿连帽衫的人”（较口语），如“a couple of hoodies were hanging around outside”（外面有几个穿连帽衫的人在附近逗留）。语境不同，可能只是中性描述，也可能带一点“可疑/不良少年”的暗示，需注意场合。"]}
{"word":"hoodies","summary":{"en":"“Hoodies” means more than one hoodie: casual hooded sweatshirts or jackets.","zh":"“hoodies”指多件连帽衫：休闲的带帽卫衣或外套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of hoodie) A casual sweatshirt or jacket with a hood, often with a front pocket.","zh":"（hoodie 的复数）连帽衫；带帽的卫衣或外套，常见有前面的口袋。"},"examples":[{"en":"I bought two hoodies for winter.","zh":"我买了两件连帽衫过冬。"},{"en":"Many students wear hoodies to class because they’re comfortable.","zh":"很多学生上课会穿连帽衫，因为很舒服。"},{"en":"Her hoodies are usually oversized and cozy.","zh":"她的连帽衫通常是宽松的，很舒适。"}]}],"synonyms":["hooded sweatshirt","hooded jacket","sweatshirt (general)"],"phonetic":"/ˈhʊdiz/","extraExplanation":["“hoodie”在美式英语里非常常见，属于休闲服装词汇；复数“hoodies”用于泛指多件或多种连帽衫。","在流行文化中，hoodies常与“休闲、街头风（streetwear）”联系在一起；在某些语境下也可能被刻板印象化，因此描述穿着时用中性、客观的说法更合适。"]}
{"word":"hooding","summary":{"en":"“Hooding” means putting a hood on something/someone; it can also specifically mean hooding a falcon in falconry.","zh":"“hooding”指给某物或某人戴上兜帽/头罩；也可特指驯鹰中给猎鹰戴鹰罩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of putting a hood on someone or something; covering the head (and sometimes the face or eyes) with a hood","zh":"给某人或某物戴上兜帽的行为或过程；用兜帽覆盖头部（有时也覆盖脸或眼睛）"},"examples":[{"en":"The jacket’s design makes hooding quick, even in heavy rain.","zh":"这件夹克的设计让你即使在大雨中也能很快把帽子戴上。"},{"en":"The suspect complained about being restrained and hooded during transport.","zh":"嫌疑人抱怨在转运途中被束缚并被套上头罩。"}]},{"partOfSpeech":"n.","definition":{"en":"(in falconry) covering a bird of prey’s head with a hood to keep it calm by limiting vision","zh":"（驯鹰/鹰猎）给猛禽戴上鹰罩以限制视线、让它安静下来"},"examples":[{"en":"Hooding helps the falcon stay calm before the hunt begins.","zh":"在狩猎开始前，戴鹰罩能帮助猎鹰保持安静。"},{"en":"The trainer practiced gentle hooding to avoid stressing the bird.","zh":"训练员练习轻柔地给鸟戴罩，避免让它受惊。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “hood” (to cover with a hood)","zh":"“hood”（用兜帽/头罩覆盖）的现在分词形式"},"examples":[{"en":"They were hooding the equipment to protect it from dust.","zh":"他们正在把设备罩起来以防灰尘。"},{"en":"Clouds were hooding the mountain peak by late afternoon.","zh":"到下午晚些时候，云层像兜帽一样笼罩着山顶。"}]}],"synonyms":["covering","masking","hooding (a bird)","veiling"],"phonetic":"/ˈhʊdɪŋ/","extraExplanation":["“hooding”在日常语境里多指“把兜帽拉起来/套上头罩”的动作；在新闻或法律语境中，可能指给人“套头罩（hood）”，语气往往更严肃，常与拘押、转运等场景相关。","在驯鹰文化（falconry）中，“hood”是专门的皮质鹰罩。给鸟戴罩是为了让它减少视觉刺激、保持冷静，方便携带与训练。"]}
{"word":"hoodle","summary":{"en":"A rare dialect verb meaning to move or work in a clumsy, slow way.","zh":"一个罕见的方言动词，表示笨拙、缓慢地移动或做事。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Rare, dialect) to move or work in a clumsy, slow, or shuffling way; to potter about.","zh":"（罕见/方言）笨拙、慢吞吞地移动或做事；磨磨蹭蹭地忙活。"},"examples":[{"en":"He was hoodling around the kitchen, looking for his keys.","zh":"他在厨房里笨笨地转来转去，找钥匙。"},{"en":"Stop hoodling and help me carry these boxes.","zh":"别磨磨蹭蹭了，来帮我搬这些箱子。"}]}],"synonyms":["shuffle","amble","potter (about)","dawdle"],"phonetic":"/ˈhuːdəl/","extraExplanation":["“hoodle”在现代标准英语里非常少见，多出现在某些地区方言或作为口语化拼写；很多情况下人们其实想写的是更常见的词，比如“huddle”（挤作一团/聚在一起）或“dawdle”（磨蹭）。如果你能给我一句包含它的原句，我可以更准确判断意思。"]}
{"word":"hoodless","summary":{"en":"“Hoodless” describes clothing that does not have a hood.","zh":"“hoodless”用来形容衣物“没有兜帽/不带帽兜”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a hood (a head covering attached to a coat, robe, etc.).","zh":"没有兜帽的；无帽兜的（指外套、长袍等衣物上不带帽兜）。"},"examples":[{"en":"I prefer a hoodless jacket for the office.","zh":"我更喜欢上班穿没有兜帽的夹克。"},{"en":"The hoodie comes in both hooded and hoodless versions.","zh":"这款连帽衫有带帽和无帽两种版本。"}]}],"synonyms":["without a hood","no-hood"],"phonetic":"/ˈhʊdləs/","extraExplanation":["“hoodless”是由hood（兜帽）+ -less（没有……的）构成的形容词，常见于服装商品描述（如网购、标签、广告）中。","日常口语里也常用更简单的说法：“without a hood”或“no hood”。"]}
{"word":"hoodlike","summary":{"en":"Hoodlike means “shaped like or resembling a hood,” and sometimes (informally) “having a street/hood style.”","zh":"hoodlike 意为“像兜帽的/呈兜帽形的”，有时（非正式）也指“带街头风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling a hood (a covering for the head/neck, or a hood-shaped part of clothing or equipment).","zh":"像兜帽的；类似头罩/兜帽形状的（指衣物或设备的一部分）。"},"examples":[{"en":"The jacket has a hoodlike collar that can be pulled up in cold wind.","zh":"这件夹克有个像兜帽一样的领子，冷风时可以拉起来遮挡。"},{"en":"A hoodlike cover protected the camera from rain.","zh":"一个兜帽状的罩子保护相机不被雨淋。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, less common) resembling “hood” style or culture (street/neighborhood style).","zh":"（非正式，用得较少）像“hood”（街区/街头文化）风格的；带有街头气质的。"},"examples":[{"en":"His outfit looked a bit hoodlike, with a big hoodie and sneakers.","zh":"他的穿搭有点街头风：宽大的连帽衫配运动鞋。"},{"en":"The brand markets a hoodlike aesthetic, but it’s still high-end.","zh":"这个品牌主打街头审美，但定位仍然偏高端。"}]}],"synonyms":["hood-shaped","hooded","cowl-like","cloaklike"],"phonetic":"/ˈhʊdˌlaɪk/","extraExplanation":["“hoodlike”= hood + -like。后缀 -like 表示“像……一样的/具有……特征的”，常见于 childlike（孩子般的）、businesslike（公事公办的）。","注意区分：hood 指“兜帽/头罩”是中性词；hood 在俚语里也可指“街区（neighborhood）”或“街头文化”，语境不同含义不同。"]}
{"word":"hoodlum","summary":{"en":"A hoodlum is a rude or violent troublemaker, often associated with gangs.","zh":"hoodlum 指粗鲁或暴力的惹事者，常与帮派或街头滋事联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a violent or rude person (often a young man) who causes trouble, sometimes as part of a gang","zh":"流氓；小混混；（常指年轻男性的）惹事者，有时与帮派有关"},"examples":[{"en":"The shop owner installed cameras to protect the store from hoodlums.","zh":"店主安装了摄像头，以保护商店不受小混混骚扰。"},{"en":"A group of hoodlums vandalized the park benches at night.","zh":"一群流氓在夜里破坏了公园的长椅。"}]}],"synonyms":["thug","bully","lout","delinquent","gangster"],"phonetic":"/ˈhuːd.ləm/","extraExplanation":["“Hoodlum”语气通常较强，带有批评和轻蔑色彩，用来强调“粗鲁、好斗、爱惹事”的人。正式写作或新闻中有时会用更中性的说法，如“troublemaker（惹事者）”“vandal（破坏公物者）”或“gang member（帮派成员）”。","词源常被认为与19世纪末美国旧金山的街头团伙有关，因此带有一定历史与社会背景色彩；在现代用法中更泛指“地痞/混混”，不一定真的属于某个组织。"]}
{"word":"hoodlumish","summary":{"en":"“Hoodlumish” means rough or rowdy in a way that feels like a hoodlum.","zh":"“hoodlumish”指带有“小流氓/混混”气质的：粗野、吵闹、爱惹事的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a hoodlum; rough, rowdy, or associated with petty criminals or troublemakers (often describing behavior, style, or speech).","zh":"像小流氓一样的；粗野、吵闹的，带有小混混/惹事者气质的（常形容行为、风格或说话方式）。"},"examples":[{"en":"His hoodlumish jokes made the meeting uncomfortable.","zh":"他那些流氓气的玩笑让会议气氛很尴尬。"},{"en":"The movie gives the gang a hoodlumish look with leather jackets and loud talk.","zh":"电影用皮夹克和大声说话让那帮人看起来很“混混”。"},{"en":"She tried to sound tough, but it came off as hoodlumish rather than confident.","zh":"她想装得很强硬，但听起来更像小流氓，而不是自信。"}]}],"synonyms":["thuggish","loutish","rowdy","rough","punkish"],"phonetic":"/ˈhuːdləmɪʃ/","extraExplanation":["“hoodlum”在美式英语里指“（尤指街头的）小流氓、混混”，通常带贬义；“-ish”表示“有点像……、带有……风格”。所以“hoodlumish”多用于口语或文学描写，强调一种粗鲁、爱惹事的“混混感”，并不一定表示真的犯罪。"]}
{"word":"hoodlumism","summary":{"en":"Hoodlumism means repeated or typical hoodlum (thuggish) behavior—crime, intimidation, or violence.","zh":"hoodlumism 指流氓/暴徒式的反复性犯罪、恐吓或暴力行为（带批评意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"criminal or violent behavior typical of hoodlums (street thugs), especially when it becomes a pattern or “culture.”","zh":"流氓行为；暴徒行径（指街头混混式的犯罪或暴力行为，尤指形成习惯或风气）。"},"examples":[{"en":"Residents complained about hoodlumism in the park after dark.","zh":"居民抱怨公园天黑后出现流氓行径。"},{"en":"The city increased lighting and patrols to reduce hoodlumism near the station.","zh":"市政府加强照明和巡逻，以减少车站附近的流氓行为。"}]}],"synonyms":["thuggery","hooliganism","vandalism","delinquency"],"phonetic":"/ˈhʊd.ləmˌɪz.əm/","extraExplanation":["“hoodlumism”由“hoodlum（小流氓、街头混混）+ -ism（……主义/……风气）”构成，语气常带批评，强调一种反复出现、具有群体性或风气化的粗暴违法行为。","在现代英语中，这个词不算高频；新闻或正式写作里更常见的替代说法有“vandalism（破坏公物）”“gang violence（帮派暴力）”“thuggery（暴力行径）”“delinquency（青少年违法行为）”。"]}
{"word":"hoodlumize","summary":{"en":"A rare informal verb meaning “to make (someone/something) behave like a hoodlum,” or “to become hoodlum-like.”","zh":"一个罕见的非正式动词，指“把（某人/某事）变得像小混混一样”或“自己变得混混化”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, informal) To turn someone or something into a hoodlum; to make more rough, violent, or criminal in behavior.","zh":"（罕见，非正式）使某人（或某事）变成小混混/流氓；使行为变得更粗野、暴力或带有犯罪倾向。"},"examples":[{"en":"Some parents worry that violent online content can hoodlumize young viewers.","zh":"一些家长担心暴力网络内容会把年轻观众“带坏”，让他们变得像小混混一样。"},{"en":"The coach tried to build confidence without hoodlumizing the team’s attitude.","zh":"教练想建立自信，但不希望把球队的态度带成粗野好斗的那种。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare, informal) To become like a hoodlum; to act in a rough, intimidating, or lawless way.","zh":"（罕见，非正式）变得像小混混一样；举止粗野、吓人或不守规矩。"},"examples":[{"en":"After he started hanging out with troublemakers, he seemed to hoodlumize quickly.","zh":"自从他开始和一群惹事的人混在一起，他好像很快就“混混化”了。"},{"en":"The crowd began to hoodlumize when the police lights appeared.","zh":"警灯一出现，人群就开始变得躁动、带点寻衅的样子。"}]}],"synonyms":["corrupt","debase","brutalize","roughen up","turn into a hoodlum"],"phonetic":"/ˈhuːdləmˌaɪz/","extraExplanation":["这个词由“hoodlum（小混混/流氓）+ -ize（使……化/使成为）”构成，属于很口语、也比较少见的造词；写作中更常用 make someone a hoodlum, turn into a hoodlum, roughen up, corrupt, radicalize（视语境而定）。","语气通常带批评或担忧，暗示“把人带坏/风气变差”，使用时要注意避免对特定群体的刻板印象。"]}
{"word":"hoodlums","summary":{"en":"Hoodlums are troublemakers, often violent, sometimes connected with gangs.","zh":"hoodlums 指惹事、可能带暴力的流氓/地痞，有时与帮派有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (usually young men) who behave violently or cause trouble, often as part of a gang.","zh":"（通常指年轻男性的）流氓，地痞；经常以暴力或捣乱为特征，有时与帮派有关。"},"examples":[{"en":"The police arrested several hoodlums after the fight.","zh":"打架后，警方逮捕了几名流氓。"},{"en":"Some hoodlums were vandalizing cars on the street.","zh":"一些地痞在街上破坏汽车。"},{"en":"The movie shows a neighborhood troubled by hoodlums.","zh":"这部电影描绘了一个被流氓骚扰的社区。"}]}],"synonyms":["thug","punk","delinquent","gang member","hooligan"],"phonetic":"/ˈhuːd.ləm/","extraExplanation":["“hoodlum”是美式英语中较常见的词，语气偏负面，带有“粗暴、无赖、惹事”的感觉。复数是“hoodlums”。","日常表达中也常用“thug（更强调暴力）”“gang member（更强调帮派身份）”“delinquent（更偏青少年违法/失范）”。选择哪一个取决于你想强调的点。"]}
{"word":"hoodman","summary":{"en":"Hoodman is an old-fashioned word meaning a blindfold, or the act of blindfolding someone.","zh":"hoodman 是较古旧的词，指“蒙眼布”，也可作动词表示“给某人蒙眼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blindfold (a cloth or covering put over someone’s eyes), especially in older or literary English","zh":"（尤指旧式或文学用语）蒙眼布；眼罩"},"examples":[{"en":"They tied a hoodman over his eyes before the game began.","zh":"游戏开始前，他们用蒙眼布把他的眼睛蒙住。"},{"en":"In the old story, the prisoner was led out with a hoodman on.","zh":"在那个古老的故事里，囚犯被蒙着眼带了出去。"}]},{"partOfSpeech":"vt.","definition":{"en":"to blindfold someone; to cover someone’s eyes so they cannot see (old-fashioned)","zh":"（旧式用法）给某人蒙上眼；遮住某人的眼睛使其看不见"},"examples":[{"en":"The kidnappers hoodmanned the victim and drove away.","zh":"绑匪把受害者蒙上眼后开车离开。"},{"en":"During the children’s game, one player was hoodmanned and had to catch the others.","zh":"在孩子们的游戏里，有一名玩家被蒙上眼，必须去抓其他人。"}]}],"synonyms":["blindfold","eye mask","cover (someone’s) eyes"],"phonetic":"/ˈhʊd.mən/","extraExplanation":["“hoodman”是较罕见、偏古旧的词，现代英语更常用blindfold（名词/动词）或wear a blindfold / be blindfolded。","它也常出现在较老的表达hoodman-blind（类似今天的blind man’s buff），指“捉迷藏式的蒙眼抓人游戏”。"]}
{"word":"hoodmen","summary":{"en":"“Hoodmen” usually means hooded men—men wearing hoods, often suggesting anonymity.","zh":"“hoodmen”通常指“戴兜帽的男人”，常暗示身份不明或刻意隐藏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Men wearing hoods (hooded men), often implying anonymity (for example, in a protest, ritual, or crime).","zh":"（非正式）戴兜帽的男人（兜帽男），常带有“隐藏身份/匿名”的含义（如抗议、仪式或犯罪场景）。"},"examples":[{"en":"The witness said two hoodmen ran out of the store and got into a car.","zh":"目击者说有两名戴兜帽的男人从商店跑出来，上了一辆车。"},{"en":"In the movie, the hoodmen appear in the alley to threaten the hero.","zh":"在电影里，那些兜帽男出现在小巷里威胁主角。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A plural form of “hoodman” (a person who works with a hood, mask, or protective head covering), used in some older or very specific contexts.","zh":"（罕见）“hoodman”的复数形式，指在某些较旧或非常特定语境中，工作时使用头罩/面罩/防护头套的人。"},"examples":[{"en":"In older records, hoodmen are listed among workers who handled dusty materials.","zh":"在较旧的记录中，hoodmen 被列为处理粉尘材料的工人之一。"}]}],"synonyms":["hooded men","masked men","men in hoods"],"phonetic":"/ˈhʊd.mən/","extraExplanation":["“hoodmen”不是非常常见的标准词，更常见的表达是“hooded men”。在新闻或口语叙述里，人们有时会用“hoodmen”来强调“戴帽兜、看不清脸、身份不明”的感觉。","不要把它和“men from the hood（来自贫民区/社区的男人）”混淆；后者通常写作“from the hood”，语气和文化指向也不同。"]}
{"word":"hoodmold","summary":{"en":"A hoodmold is an architectural molding above a window, door, or arch that helps shed rain and adds decoration.","zh":"hoodmold 指窗、门或拱上方的建筑线脚，用于挡雨导水并起装饰作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative molding (often projecting) placed above a door, window, or arch to throw rainwater away and to add ornament; also called a dripstone","zh":"（建筑）檐口线脚；窗/门/拱上方的装饰性线脚（常向外凸出），用于挡雨并起装饰作用；也叫滴水线（dripstone）"},"examples":[{"en":"The stone hoodmold above the window helped protect the opening from rain.","zh":"窗户上方的石质檐口线脚有助于把雨水挡开，保护洞口。"},{"en":"In many Gothic churches, hoodmolds frame the pointed arches and add visual depth.","zh":"在许多哥特式教堂里，檐口线脚会勾勒尖拱，增加层次感。"}]}],"synonyms":["dripstone","hood mould","arch molding"],"phonetic":"/ˈhʊdˌmoʊld/","extraExplanation":["hoodmold 属于建筑细部构件，常见于中世纪欧洲（尤其是哥特式）建筑。它既有“功能性”（把水滴导离墙面、减少雨水沿墙流淌造成的侵蚀），也有“装饰性”（强调门窗或拱券的轮廓）。","词形上可拆为 hood（罩、覆盖物）+ mold/mould（线脚、模子），这里的 mold 指“线脚/装饰条”，不是“霉菌”的意思。英式拼写常见为 hoodmould。"]}
{"word":"hoodoes","summary":{"en":"“Hoodoo/hoodoes” relates to folk magic or to causing bad luck; as a verb, it means to put a spell on someone.","zh":"“Hoodoo/hoodoes”与民间巫术或招致厄运有关；作动词时指对人施法/下咒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(n.) A practice of folk magic and protective or harmful spells, traditionally associated with African American culture in the U.S. South.","zh":"（名词）一种民间魔法与施法传统（可用于护身或作祟），常与美国南方的非裔美国人文化相关。"},"examples":[{"en":"In the novel, the character believes a hoodoo can protect her family.","zh":"在小说里，这个角色相信巫术法门可以保护她的家人。"},{"en":"Some communities kept hoodoo traditions alongside Christian practices.","zh":"一些社区在基督教实践之外，也保留了民间巫术传统。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A bad luck charm; something believed to cause bad luck.","zh":"（名词）带来厄运的东西；被认为会招来不幸的“晦气物”。"},"examples":[{"en":"He refused to wear the ring again, calling it a hoodoo.","zh":"他再也不肯戴那枚戒指，说它会带来厄运。"},{"en":"They joked that the broken umbrella was a hoodoo.","zh":"他们开玩笑说那把坏掉的伞很“晦气”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(vt.) To use hoodoo magic on someone; to put a spell on someone.","zh":"（及物动词）对某人施民间法术；下咒。"},"examples":[{"en":"She thinks someone hoodooed her because everything went wrong this week.","zh":"她觉得有人给她下了咒，因为这周什么都不顺。"},{"en":"In the story, the villain tries to hoodoo the hero.","zh":"在故事里，反派试图对主角下咒。"}]}],"synonyms":["spell","jinx","curse"],"phonetic":"/ˈhuːduː/","extraExplanation":["“Hoodoo”在文化语境中常与“Voodoo（巫毒教/巫毒）”混淆：hoodoo更多指民间法术与护符、咒语等实践；voodoo则是一种宗教传统（在加勒比地区尤其常见）。在写作或讨论时，区分两者会更尊重文化背景。","你输入的“hoodoes”多半是动词第三人称单数：He/She hoodoes (someone). 也可能是少见的名词复数拼法（更常见的复数是“hoodoos”）。"]}
{"word":"hoodoo","summary":{"en":"Hoodoo can mean either African American folk magic (“rootwork/conjure”) or a tall, thin rock spire formed by erosion.","zh":"Hoodoo 既可指非裔美国人的民俗法术传统（rootwork/conjure），也可指风化侵蚀形成的尖塔状岩柱地貌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of African American folk-magic beliefs and practices (often involving charms, roots, candles, prayers, and rituals), especially in the Southern United States; also called “rootwork” or “conjure.”","zh":"（尤指美国南部的）非裔美国人传统民间魔法/民俗法术体系，常涉及护身符、草药（根）、蜡烛、祈祷与仪式；也常称为“rootwork（草药法术）/conjure（作法）”。"},"examples":[{"en":"In the story, her grandmother knew hoodoo and made a small protection charm.","zh":"在故事里，她的祖母懂得 hoodoo，并做了一个小小的护身符。"},{"en":"Some people confuse hoodoo with voodoo, but they are not the same.","zh":"有些人把 hoodoo 和 voodoo 混为一谈，但它们并不相同。"}]},{"partOfSpeech":"n.","definition":{"en":"A tall, thin rock spire or unusual rock formation shaped by erosion, common in the American West.","zh":"（因风化侵蚀形成的）尖塔状细长岩柱/奇特岩石地貌，常见于美国西部。"},"examples":[{"en":"We hiked through Bryce Canyon and photographed the hoodoos at sunset.","zh":"我们徒步穿过布莱斯峡谷，在日落时拍下那些 hoodoo 岩柱。"},{"en":"The guide explained how rain and wind slowly create hoodoos over time.","zh":"导游解释了雨水和风如何在长期作用下逐渐形成 hoodoo 岩柱。"}]}],"synonyms":["rootwork","conjure","folk magic","rock spire","erosional spire"],"phonetic":"/ˈhuːduː/","extraExplanation":["“Hoodoo（民俗法术）”与“Voodoo/ Vodou（伏都教）”常被误用。Hoodoo更偏向民间法术与护符传统，不一定是一种宗教；而Vodou是具有仪式、神灵体系与宗教共同体的宗教传统。","在文化语境中，谈到hoodoo（民俗法术）时建议避免把它简单等同于“邪术/黑魔法”。很多实践者把它视为民间疗愈、护身与传统信仰的一部分。","“hoodoo（岩柱）”这一义项常见于美国国家公园与地貌介绍（如Bryce Canyon）。读到旅游/地理文章时更可能是这个意思。"]}
{"word":"hoodooed","summary":{"en":"Hoodooed means “jinxed/cursed” or “made unlucky,” as the past form of hoodoo.","zh":"hoodooed 表示“被下霉运/被诅咒”或“使倒霉”，是 hoodoo 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of “hoodoo”) To bring bad luck to; to jinx or curse someone or something.","zh":"（“hoodoo”的过去式/过去分词）给……带来霉运；使……倒霉；诅咒、使不顺。"},"examples":[{"en":"Our team felt hoodooed after losing three games in a row.","zh":"我们队连输三场后，感觉像是被“下了霉运”。"},{"en":"He joked that the new jersey was hoodooed because he kept missing shots.","zh":"他开玩笑说新球衣“带霉运”，因为他一直投不进。"}]},{"partOfSpeech":"adj.","definition":{"en":"Affected by a hoodoo; unlucky or jinxed.","zh":"被“霉运/诅咒”影响的；不吉利的、倒霉的。"},"examples":[{"en":"It felt like a hoodooed day—everything went wrong.","zh":"那天像是“倒霉日”——什么都不顺。"},{"en":"They avoided the hoodooed seat after two people got sick there.","zh":"两个人在那个座位上不舒服后，他们就避开了那个“倒霉座位”。"}]}],"synonyms":["jinxed","cursed","hexed","bewitched","unlucky"],"phonetic":"/hʊˈduːd/","extraExplanation":["“hoodoo”在美国英语里常指“带来厄运的魔咒/晦气”，也可指非裔美国民间信仰中的一种民俗魔法传统（与“voodoo/巫毒”不同）。日常口语里更常用作“jinx（克星/霉运）”的同义表达，体育新闻或聊天中也很常见，比如说某支球队“被克住了”。"]}
{"word":"hoodooing","summary":{"en":"Hoodooing usually means ‘jinxing/bringing bad luck,’ and it can also mean ‘practicing hoodoo (folk magic).’","zh":"hoodooing通常指“使倒霉/带来坏运气”，也可指“施行hoodoo（民间法术）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"trying to bring bad luck to someone; jinxing or cursing (often used informally).","zh":"（口语）给某人带来坏运气；使倒霉、下咒（类似“诅咒/下霉运”）。"},"examples":[{"en":"Stop hoodooing me—I just want to finish this test in peace.","zh":"别再“给我下霉运”了——我只想安安静静把考试做完。"},{"en":"They joked that talking about winning early was hoodooing the team.","zh":"他们开玩笑说太早谈胜利是在给球队“带霉运”。"}]},{"partOfSpeech":"v.","definition":{"en":"doing hoodoo: practicing a traditional form of folk magic.","zh":"进行“胡毒”（hoodoo）：施行一种传统民间魔法/巫术。"},"examples":[{"en":"In the story, she is hoodooing to protect her family from harm.","zh":"在故事里，她用hoodoo来保护家人免受伤害。"},{"en":"The novel mentions a healer who is hoodooing with herbs and charms.","zh":"小说提到一位疗愈者用草药和护身符来施行hoodoo。"}]}],"synonyms":["jinxing","cursing","hexing","bringing bad luck","practicing folk magic"],"phonetic":"/ˈhuːduːɪŋ/","extraExplanation":["“hoodoo”在美国文化中常指非裔美国人传统的民间信仰与法术体系（也被称为rootwork/conjure），与“Voodoo/伏都教”不同；后者是有宗教结构的信仰体系。讨论或使用该词时，避免把不同文化传统混为一谈，尤其在真实文化语境中要尊重其历史与社群背景。","日常口语里，“to hoodoo”更常被当作“使倒霉/触霉头”的意思，语气通常比“curse”更轻、更像玩笑。"]}
{"word":"hoodooism","summary":{"en":"Hoodooism is a U.S. folk spiritual tradition (often linked to African American history) using charms, herbs, and rituals for protection, healing, and luck.","zh":"Hoodooism 指美国的民间灵性/巫术传统（常与非裔美国人历史相关），以护符、草药与仪式来求保护、疗愈与好运。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a folk spiritual practice in the U.S. (especially in African American communities) involving charms, roots/herbs, prayers, and rituals for protection, healing, luck, or influence; the belief system and traditions connected to hoodoo","zh":"一种美国的民间灵性/巫术传统（尤以非裔美国人社群相关），通过护身符、草根药材、祈祷与仪式来求保护、疗愈、好运或影响他人；也指与“hoodoo（民间巫术）”相关的信仰与传统体系"},"examples":[{"en":"She studies hoodooism as part of African American cultural history.","zh":"她把“hoodooism”作为非裔美国人文化史的一部分来研究。"},{"en":"In the story, the character uses hoodooism for protection rather than harm.","zh":"在这个故事里，角色运用 hoodooism 是为了自保，而不是害人。"},{"en":"Some families passed down hoodooism practices quietly from one generation to the next.","zh":"有些家庭把 hoodooism 的做法低调地代代相传。"}]}],"synonyms":["hoodoo","rootwork","folk magic","conjure (tradition)"],"phonetic":"/ˈhuːduˌɪzəm/","extraExplanation":["“hoodooism”通常指“hoodoo（民间巫术/根术 rootwork）”的信念与实践。它常见于美国南方与非裔美国人社群，融合了西非与中非传统、基督教祷告、草药知识与民俗疗法等元素。","它不等同于“Voodoo/Vodou（伏都教）”。后者是有较完整宗教体系与神祇/仪式结构的宗教（如海地 Vodou、路易斯安那 Voodoo），而 hoodoo 更常被视为偏“民间法术/护符与实用仪式”的传统。","在现代英语中，“hoodoo”有时也被非正式地用来表示“厄运/招来不顺”，但“hoodooism”作为名词更多用于文化研究或描述相关传统时。"]}
{"word":"hoodoos","summary":{"en":"Hoodoos are usually tall rock spires shaped by erosion; informally, the word can also mean a jinx or harmful magic.","zh":"Hoodoos通常指侵蚀形成的细高岩柱；在口语里也可指“霉运/邪咒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often plural) A tall, thin rock pillar or spire formed by erosion, common in deserts and badlands.","zh":"（常用复数）由风化与侵蚀形成的细高岩柱/岩塔，常见于荒漠或恶地地貌。"},"examples":[{"en":"We hiked through Bryce Canyon to see the hoodoos at sunrise.","zh":"我们清晨徒步穿过布莱斯峡谷去看日出时的石林岩柱（hoodoos）。"},{"en":"The guide explained how rain and freeze–thaw cycles create hoodoos over time.","zh":"导游解释了雨水和冻融循环如何随着时间形成这些岩柱。"}]},{"partOfSpeech":"n.","definition":{"en":"(often plural, informal) Bad luck, a jinx, or harmful magic believed to cause trouble.","zh":"（常用复数，非正式）厄运、霉运；“被下咒/被作法”一类的说法。"},"examples":[{"en":"He blamed the team’s losing streak on hoodoos.","zh":"他把球队的连败归咎于“霉运/邪咒”。"},{"en":"She joked that the broken phone was just hoodoo.","zh":"她开玩笑说手机坏了只是倒霉（像中了邪一样）。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put a jinx on someone; to hex (informal).","zh":"（非正式）给……带来霉运；诅咒；“下咒”。"},"examples":[{"en":"Don’t say that—you’ll hoodoo our chances!","zh":"别这么说——你会把我们的机会说没的！（会“招霉运”）"}]}],"synonyms":["rock spires","rock pillars","jinx","curse","hex"],"phonetic":"/ˈhuːduː/","extraExplanation":["“hoodoo”在美国文化里有两条常见用法：一条是地质学用语（岩柱/石林），在美国西部景区很常见；另一条与民间信仰有关，指“霉运/被下咒”。日常口语里多带玩笑或迷信色彩。","注意区分“hoodoo”和“voodoo”：voodoo常指特定宗教/仪式传统；hoodoo更常被用来指民间“作法/咒术”或泛指不吉利。使用时应避免把不同文化传统混为一谈。"]}
{"word":"hoods","summary":{"en":"“Hoods” usually means the plural of hood: (1) coat/sweatshirt hoods, (2) car hoods (engine covers), and sometimes (3) neighborhoods (“the hood”) or (4) protective covers on equipment.","zh":"“Hoods”通常是“hood”的复数：①兜帽，②汽车引擎盖；也可指③街区/社区（口语“the hood”），或④设备的防护罩等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hood”: a covering that goes over the head and neck, often attached to a coat or sweatshirt.","zh":"“hood”的复数：兜帽；覆盖头颈的帽子，常与外套或连帽衫连在一起。"},"examples":[{"en":"It started raining, so we pulled up our hoods.","zh":"开始下雨了，所以我们把兜帽拉起来。"},{"en":"The kids wore jackets with big, warm hoods.","zh":"孩子们穿着带又大又暖兜帽的外套。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “hood”: the hinged metal cover over a car’s engine (American English).","zh":"“hood”的复数：汽车引擎盖（美式英语）。"},"examples":[{"en":"The mechanic opened the hoods to check the engines.","zh":"修理工打开引擎盖检查发动机。"},{"en":"The cars in the lot all had their hoods up.","zh":"停车场里的车都把引擎盖支起来了。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “hood” (informal): neighborhoods, especially in the sense of a local community; sometimes also used for poorer or rougher areas.","zh":"“hood”的复数（非正式）：社区、街区（强调“本地圈子”的感觉）；有时也指较贫困或治安较差的区域。"},"examples":[{"en":"He grew up in different hoods around the city.","zh":"他在城里不同的街区长大。"},{"en":"She knows people from a lot of hoods.","zh":"她认识很多不同社区的人。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “hood”: a protective covering or shaped part on a machine or device (e.g., a fume hood in a lab).","zh":"“hood”的复数：机器/装置上的防护罩或罩形部件（如实验室的通风橱）。"},"examples":[{"en":"The lab has fume hoods for handling strong chemicals.","zh":"实验室有通风橱，用来处理强腐蚀性化学品。"},{"en":"Wear the protective hoods when you’re sanding.","zh":"打磨时要戴好防护头罩。"}]}],"synonyms":["caps","covers","bonnets (BrE for car hood)","neighborhoods (informal sense)","communities"],"phonetic":"/hʊdz/","extraExplanation":["“hoods”最常见是名词复数。单数“a hood”，复数“hoods”。","美式英语里“car hood”= 引擎盖；英式英语更常说“bonnet”。","口语里的“the hood / hoods”带有“街区、地盘”的社会文化色彩：在一些语境中可能带刻板印象，用时注意场合与语气。","词源上“hood”来自古英语，原意与“覆盖、包住”有关，所以能延伸到“兜帽、罩子、引擎盖”等多种“覆盖物”。"]}
{"word":"hoodsheaf","summary":{"en":"A rare farming word for a rain-protected sheaf of grain drying in the field.","zh":"一个较少见的农事词，指在田里晾干时做成“防雨遮盖”形状的谷捆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sheaf of grain (especially wheat or oats) arranged with the top bent or covered like a “hood” to protect it from rain while it dries in the field","zh":"（尤指小麦或燕麦的）带“兜帽”式遮盖的谷捆；为了在田里晾干、防雨而把顶部折下或覆盖起来的谷束"},"examples":[{"en":"After cutting the oats, they set the stalks into hoodsheaves to dry overnight.","zh":"割完燕麦后，他们把麦秆扎成“兜帽式谷捆”，让它们过夜晾干。"},{"en":"The old photo shows workers stacking hoodsheaves across the field before threshing.","zh":"那张老照片里，工人在脱粒前把一捆捆“兜帽式谷捆”堆放在田里。"}]}],"synonyms":["capped sheaf","covered sheaf"],"phonetic":"/ˈhʊdˌʃif/","extraExplanation":["这个词比较少见，多见于英式（尤其苏格兰等地）关于传统收割与晾晒的语境。过去谷物收割后需要在田里短暂风干，为了防雨，人们会把谷束顶部折下或用一束覆盖，看起来像“戴了帽子”，因此叫 hood + sheaf（谷捆）。"]}
{"word":"hoodshy","summary":{"en":"Hoodshy means unwilling or hesitant to get married (rare/old-fashioned).","zh":"hoodshy 指不愿或不太敢结婚（少见/偏旧式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, often humorous or old-fashioned) reluctant to marry; shy about becoming a husband or wife.","zh":"（少见，常带幽默或旧式用法）不愿意结婚的；对成为丈夫/妻子有所顾虑的。"},"examples":[{"en":"He’s a bit hoodshy, so he avoids serious talk about weddings.","zh":"他有点“怕结婚”，所以会躲开关于婚礼的严肃话题。"},{"en":"In the novel, the hero is hoodshy until he meets someone he truly trusts.","zh":"在小说里，男主角一直抗拒婚姻，直到遇到一个他真正信任的人。"}]}],"synonyms":["marriage-shy","commitment-shy","reluctant to marry"],"phonetic":"/ˈhʊdˌʃaɪ/","extraExplanation":["“hoodshy”由 hood（这里指旧时婚礼或婚姻相关的头巾/罩帽，常用来象征“婚姻的束缚/身份”）+ shy（畏缩、回避）构成，因此整体意思是“对婚姻退缩”。现代英语中很少用，更多见于幽默写法、文学/复古语境。"]}
{"word":"hoodshyness","summary":{"en":"Hoodshyness is a falcon’s resistance to being hooded (wearing a falconry hood).","zh":"hoodshyness 指猎鹰等鹰鸟抗拒戴猎鹰术用的眼罩帽（hood）的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Falconry) A bird’s reluctance or refusal to tolerate being hooded; the condition of being “hood-shy.”","zh":"（训鹰/猎鹰术）鹰鸟不愿意或拒绝戴“眼罩帽”（hood）的状态；“怕戴罩/抗拒戴罩”。"},"examples":[{"en":"The falcon’s hoodshyness made training difficult, because she panicked when the hood came out.","zh":"这只猎鹰很“怕戴罩”，训练变得很困难，因为只要拿出眼罩帽她就会惊慌。"},{"en":"To reduce hoodshyness, the trainer introduced the hood slowly and paired it with calm handling.","zh":"为了减轻“怕戴罩”，训鹰师让它循序渐进地接触眼罩帽，并配合温和的操作。"}]}],"synonyms":["hood-shyness","resistance to hooding","hood aversion"],"phonetic":"/ˈhʊdˌʃaɪnəs/","extraExplanation":["“hood”在猎鹰术里指给鹰戴的眼罩帽，用来遮住视线、让鸟保持安静、便于搬运与训练。出现“hoodshyness（怕戴罩）”时，通常需要通过循序渐进的适应训练来改善。","相关词：hood-shy（adj. 怕戴罩的）、to hood a falcon（给猎鹰戴罩）。注意：这里的 hood 不是日常所说的“连帽衫的帽子”。"]}
{"word":"hoodwink","summary":{"en":"“Hoodwink” means to deceive someone or the deception itself.","zh":"“hoodwink”既可作动词表示“欺骗/蒙骗”，也可作名词表示“骗局/欺诈”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to trick or deceive someone, often by making them believe something false","zh":"欺骗；蒙骗（常指让对方相信虚假之事）"},"examples":[{"en":"Don’t let flashy ads hoodwink you into buying things you don’t need.","zh":"别让花哨的广告骗得你买一些不需要的东西。"},{"en":"He felt hoodwinked when he learned the “deal” had hidden fees.","zh":"当他得知那笔“优惠”有隐藏费用时，他觉得自己被坑被骗了。"}]},{"partOfSpeech":"n.","definition":{"en":"a trick or act of deception; a swindle","zh":"骗局；欺诈行为"},"examples":[{"en":"The whole investment plan turned out to be a hoodwink.","zh":"整个投资计划结果证明是个骗局。"},{"en":"She realized it was a hoodwink and asked for her money back.","zh":"她意识到那是个骗局，就要求退钱。"}]}],"synonyms":["deceive","trick","con","swindle","dupe","fool"],"phonetic":"/ˈhʊdˌwɪŋk/","extraExplanation":["“hoodwink”原意与“蒙住眼睛”有关：hood（兜帽/头罩）+ wink（眨眼/闭眼），引申为“让人看不清真相，从而受骗”。","语气上通常带有“被耍了/被忽悠了”的感觉，比中性词“deceive”更口语、更有画面感。"]}
{"word":"hoodwinkable","summary":{"en":"Hoodwinkable means “easy to trick or deceive.”","zh":"hoodwinkable 指“容易被欺骗、容易上当”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"easily tricked or deceived; able to be fooled.","zh":"容易受骗的；可以被蒙骗的。"},"examples":[{"en":"New investors can be hoodwinkable if they don’t research a company carefully.","zh":"新投资者如果不仔细研究一家公司，就可能很容易受骗。"},{"en":"He looked confident, but his friendly nature made him surprisingly hoodwinkable.","zh":"他看起来很自信，但他友善的性格却让他意外地容易被蒙骗。"}]}],"synonyms":["gullible","easily fooled","easily tricked","credulous","naive","susceptible to deception"],"phonetic":"/ˈhʊdˌwɪŋkəbəl/","extraExplanation":["“hoodwinkable”来自动词“hoodwink”（蒙骗）。hoodwink原义与“遮住眼睛”有关：hood（头巾/兜帽）+ wink（眨眼/闭眼），引申为“让人看不清真相而上当”。","在日常英语里，“hoodwinkable”不算常见，更常用的表达是“gullible”（轻信的）或“easily fooled”（容易被骗的）。在正式写作中也可用“susceptible to deception”（容易受骗）。"]}
{"word":"hoodwinked","summary":{"en":"Hoodwinked means tricked or deceived.","zh":"hoodwinked 表示“被欺骗、被蒙骗”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"tricked or deceived (often by a clever story, disguise, or false promise).","zh":"被欺骗的；被蒙骗的（常因巧妙的说辞、伪装或虚假承诺而上当）。"},"examples":[{"en":"I thought the email was from my bank, but I was hoodwinked.","zh":"我以为那封邮件来自银行，但我被骗了。"},{"en":"They felt hoodwinked into paying extra fees.","zh":"他们觉得自己被蒙骗而多付了费用。"},{"en":"Don’t let flashy ads hoodwink you.","zh":"别让花哨的广告把你骗了。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of \"hoodwink\": to trick or deceive someone.","zh":"“hoodwink”的过去式：欺骗；蒙蔽某人。"},"examples":[{"en":"The salesman hoodwinked customers with fake discounts.","zh":"那位销售用假的折扣把顾客骗了。"},{"en":"She realized too late that she had been hoodwinked.","zh":"她意识到时已经太晚——她已经被骗了。"}]}],"synonyms":["tricked","deceived","fooled","scammed","duped"],"phonetic":"/ˈhʊdˌwɪŋkt/","extraExplanation":["“hoodwink”这个词原意和“遮住眼睛”有关：hood（头罩）+ wink（眨眼/闭眼），引申为“蒙住别人视线，让人看不清真相”，所以常带有“被耍了、被套路了”的感觉。","常见搭配：be hoodwinked into doing sth（被哄骗去做某事）；hoodwink sb out of money（把某人的钱骗走）。","语体上较常见于新闻、评论或较正式的表达；口语里也可用，但也可以用更常见的 trick / fool / scam。"]}
{"word":"hoodwinker","summary":{"en":"Hoodwink means to deceive someone or trick them into believing something false.","zh":"Hoodwink 指“蒙骗、欺骗”，让别人相信不真实的事情。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trick or deceive someone, often so they believe something that is not true","zh":"欺骗；蒙骗（使某人相信不真实的事情）"},"examples":[{"en":"The scammer tried to hoodwink people into sending money.","zh":"骗子试图蒙骗大家把钱转过去。"},{"en":"Don’t let flashy ads hoodwink you—read the details first.","zh":"别被花哨的广告骗了——先看清细节。"}]}],"synonyms":["trick","deceive","con","dupe","fool"],"phonetic":"/ˈhʊdˌwɪŋk/","extraExplanation":["“Hoodwink”比较口语，语气常带一点“把人耍得团团转”的感觉。比起更中性的“deceive”，它更强调“用花招骗过对方”。","词源上常被解释为与“hood（头罩）”有关：好像把人的眼睛蒙住，使其看不清真相；因此引申为“蒙骗”。"]}
{"word":"hoodwinking","summary":{"en":"Hoodwinking means deceiving someone—making them believe something untrue.","zh":"hoodwinking 指“欺骗、蒙蔽”，让别人相信不真实的事情。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to trick or deceive someone, often by hiding the truth or using a clever story","zh":"欺骗；蒙蔽（常指用花言巧语或隐瞒真相来骗过别人）"},"examples":[{"en":"He tried to hoodwink customers with fake discounts.","zh":"他试图用假的折扣来欺骗顾客。"},{"en":"Don’t let flashy ads hoodwink you into buying something you don’t need.","zh":"别让花哨的广告把你骗得去买你不需要的东西。"},{"en":"She realized too late that she had been hoodwinked.","zh":"她太晚才意识到自己被蒙骗了。"}]}],"synonyms":["deceive","trick","con","dupe","mislead"],"phonetic":"/ˈhʊdˌwɪŋkɪŋ/","extraExplanation":["“hoodwink”原意和“遮住眼睛”有关：hood（头巾/兜帽）+ wink（眨眼/使闭眼），早期可指用头巾蒙住眼睛让人看不见，引申为“蒙蔽、欺骗”。","语气上常带有“被耍了/被忽悠了”的感觉，比中性的“deceive”更口语、更生动。常见搭配：hoodwink someone into (doing) something（骗某人去做某事）。"]}
{"word":"hoodwinks","summary":{"en":"“Hoodwinks” means “deceives or tricks,” usually describing someone being misled.","zh":"“Hoodwinks”意为“欺骗、蒙骗”，常指让人被误导、被蒙在鼓里。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to trick or deceive someone (often by making them believe something that is not true)","zh":"欺骗；蒙骗（常指让人相信不真实的事）"},"examples":[{"en":"Don’t be hoodwinked by ads that promise instant results.","zh":"别被那些承诺“立竿见影”的广告骗了。"},{"en":"He was hoodwinked into paying for a service he didn’t need.","zh":"他被蒙骗，付钱买了自己并不需要的服务。"}]}],"synonyms":["deceive","trick","con","dupe","mislead","swindle"],"phonetic":"/ˈhʊd.wɪŋk/","extraExplanation":["“hoodwink”原意与“hood（头罩）+ wink（眨眼）”有关，早期可指遮住眼睛或让人看不清，从而引申为“蒙蔽、欺骗”。现代多用于提醒人不要被宣传、骗局或花言巧语误导。","常见搭配：hoodwink someone into doing something（骗某人去做某事）；be hoodwinked by something（被某事蒙骗）。","语气通常较强，含“对方被耍了/被误导了”的感觉，比普通的“trick”更强调“被蒙在鼓里”。"]}
{"word":"hoodwise","summary":{"en":"“Hoodwise” is an informal slang word meaning “from a hood/neighborhood perspective” or “street-smart/suited to the hood.”","zh":"“hoodwise”是非正式俚语，意思是“从街区/‘hood’的角度来看”，也可指“很懂街头门道/适合街区环境”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(informal) In a way that relates to “the hood” (an urban neighborhood, often associated with street culture); considering things from that perspective.","zh":"（非正式）以“街区/贫民区（the hood）”的角度；从街头文化或社区生活的视角来看。"},"examples":[{"en":"Hoodwise, that corner store is the safest place to wait for a ride at night.","zh":"从街区角度来说，晚上等车在那家街角小店最安全。"},{"en":"Hoodwise, the new security cameras changed how people hang out outside.","zh":"从街区生活的角度看，新装的监控改变了大家在外面聚集的方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Street-smart; suitable for the neighborhood or street culture.","zh":"（非正式）很懂街头门道的；适合街区/街头文化环境的。"},"examples":[{"en":"That advice is hoodwise—simple and practical.","zh":"这个建议很“街头实用”——简单又管用。"},{"en":"Try to dress hoodwise if you don’t want to stand out too much.","zh":"如果你不想太显眼，穿得更符合街区风格一点。"}]}],"synonyms":["streetwise","street-smart","from a neighborhood perspective","community-wise"],"phonetic":"/ˈhʊdˌwaɪz/","extraExplanation":["“hoodwise”不算标准词汇，更像是口语里临时造出来的表达（把 hood + -wise 组合，类似“weather-wise / money-wise”）。在不同地区、不同人群里接受度差异很大。","“the hood”有时指“自己长大的社区”，但也常被用来刻板化地指“贫穷、治安差的街区”。如果你不确定语境，建议用更中性的说法，如“in the neighborhood / from a community perspective / street-smart”。"]}
{"word":"hoodwort","summary":{"en":"“Hoodwort” is an old/literary word for a hood-shaped-flower plant, most often monkshood (aconite), a poisonous herb.","zh":"“hoodwort”是古用/文学用语，指花呈兜帽状的植物名，多指乌头（aconite/monkshood），有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or literary) A plant name, most commonly referring to monkshood/aconite (a tall plant with hood-shaped purple flowers that is highly poisonous).","zh":"（古用或文学用语）一种植物名，最常指乌头/附子属植物（monkshood/aconite），开兜帽状紫花，剧毒。"},"examples":[{"en":"In old herbals, “hoodwort” often meant monkshood, a plant known for its poisonous roots.","zh":"在旧时的本草书里，“hoodwort”常指乌头，这种植物以其有毒的根而闻名。"},{"en":"The poet described a garden where hoodwort grew in the shade.","zh":"诗人描写了一座花园，荫处长着hoodwort（乌头）。"}]}],"synonyms":["monkshood","aconite","wolfsbane"],"phonetic":"ˈhʊdˌwɝt","extraExplanation":["“wort”是古英语里“植物/草药”的意思（现代仍能在st. John’s wort等词里看到），所以hoodwort字面上就是“兜帽草/兜帽状的植物”。","因为不同地区的俗名差异很大，hoodwort在古文献里有时也可能被用来指其他“花像兜帽”的植物；遇到古书时，最好结合上下文或拉丁学名确认。","monkshood/aconite（乌头）在欧洲文化中常与“毒药”“巫术”“致命的美”之类的意象相关；阅读文学作品时常带这种象征色彩。"]}
{"word":"hoody","summary":{"en":"Hoody usually means a hoodie—a casual top with a hood; in UK informal use it can also mean a person wearing one.","zh":"Hoody通常指连帽衫（hoodie）；在英式非正式用法中也可指穿连帽衫的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hoodie; a sweatshirt or jacket with a hood (usually casual)","zh":"连帽衫；带帽子的运动衫或外套（多为休闲穿着）"},"examples":[{"en":"He wore a black hoody to school.","zh":"他穿了一件黑色连帽衫去学校。"},{"en":"Bring a hoody—it gets cold at night.","zh":"带件连帽衫吧——晚上会变冷。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK, informal) wearing a hoodie, often used in news or speech to refer to young people, sometimes unfairly suggesting trouble","zh":"（英式，非正式）指“穿连帽衫的人”，常见于媒体/口语中，有时会不公平地暗示“惹事的年轻人”"},"examples":[{"en":"The article described the group as ‘hoodies’ outside the shop.","zh":"那篇文章把店外那群人称作“穿连帽衫的人”。"},{"en":"Not every ‘hoody’ is a problem—it's just a style of clothing.","zh":"不是每个“穿连帽衫的人”都有问题——这只是种穿衣风格。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or shaped like a hood (less common)","zh":"带帽的；像帽子一样的（较少用）"},"examples":[{"en":"The jacket has a hoody design for extra warmth.","zh":"这件外套是连帽设计，更保暖。"}]}],"synonyms":["hoodie","hooded sweatshirt","hooded top"],"phonetic":"/ˈhʊdi/","extraExplanation":["“Hoody”是“hoodie”的另一种拼写；在美式英语里“hoodie”更常见，“hoody”也能理解但更少见。","在英国语境中，媒体曾把“hoodie/hoody”用作对年轻人的标签（带负面刻板印象）；日常交流中更中性，主要就是指衣服。"]}
{"word":"hooey","summary":{"en":"“Hooey” means nonsense, or it can be an exclamation meaning “That’s not true!”","zh":"“hooey”表示“胡说八道、无稽之谈”，也可作感叹词表示“不可能/胡扯”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nonsense; foolish talk or ideas that are not true or not worth believing.","zh":"胡说八道；荒唐无稽的话或想法（不值得相信）。"},"examples":[{"en":"That rumor is complete hooey.","zh":"那个谣言完全是胡说八道。"},{"en":"Don’t fill the report with marketing hooey—use real data.","zh":"别在报告里塞满营销鬼话——用真实数据说话。"},{"en":"He called the claim hooey and asked for proof.","zh":"他称那个说法是胡扯，并要求拿出证据。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show strong disbelief: “That’s nonsense!”","zh":"（感叹）表示强烈不信： “胡扯！”“才怪！”"},"examples":[{"en":"Hooey! That can’t be right.","zh":"胡扯！那不可能对。"},{"en":"“You’ll get rich overnight.” “Hooey.”","zh":"“你一夜暴富。” “才怪。”"}]}],"synonyms":["nonsense","baloney","bunk","hokum","rubbish","bull (informal)"],"phonetic":"/ˈhuːi/","extraExplanation":["“hooey”是非常口语、略带幽默感的词，语气通常比更粗俗的骂法（如“bullshit”）温和一些，但仍可能显得不够正式。正式写作中更常用“nonsense”或“falsehood”。","词源常被认为与20世纪初美国俚语有关（可能与“bunk/hokum”等同类表达在同一时期流行），常用于反驳夸张宣传、谣言或没有证据的说法。"]}
{"word":"hooeys","summary":{"en":"“Hooey(s)” means nonsense or silly, untrue talk.","zh":"“hooey(s)”指“胡说八道/无稽之谈”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"silly talk; nonsense; something untrue or exaggerated (often used to dismiss what someone said).","zh":"胡说八道；鬼话；无稽之谈（常用来否定别人说的话）"},"examples":[{"en":"That’s a bunch of hooey—there’s no evidence for it.","zh":"那是一堆鬼话——根本没有证据。"},{"en":"Don’t believe his promises; it’s all hooey.","zh":"别相信他的承诺；那都是胡扯。"}]}],"synonyms":["nonsense","baloney","hogwash","rubbish","bull"],"phonetic":"/ˈhuːi/","extraExplanation":["“hooey”在美式英语里比较口语、带点戏谑或不耐烦的语气，意思接近“nonsense / BS”。常见搭配是“a bunch of hooey”。","你输入的“hooeys”通常是复数写法（较少见），更常用单数“hooey”来表示“胡扯/鬼话”这种不可数的概念。","注意不要和品牌名“hooey”（有些服饰/帽子品牌）混淆；在词典意义里主要指“胡说”。"]}
{"word":"hoof","summary":{"en":"A hoof is the hard foot of animals like horses and cows; as a verb it means to strike/move with a hoof.","zh":"hoof 指马牛等动物的“蹄子”；作动词指“用蹄踢/踏/刨地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The hard, thick part on the foot of animals like horses, cows, deer, and goats.","zh":"（马、牛、鹿、羊等动物的）蹄，蹄子（脚底坚硬的角质部分）"},"examples":[{"en":"The horse lifted its hoof and the farrier checked it.","zh":"马抬起蹄子，钉蹄铁的工匠检查了一下。"},{"en":"Cows can get infections if their hooves aren’t kept clean.","zh":"如果牛蹄不保持清洁，可能会感染。"},{"en":"You could hear the sound of hooves on the road.","zh":"你能听到蹄子踏在路上的声音。"}]},{"partOfSpeech":"v.","definition":{"en":"To strike or move with a hoof; to kick or paw the ground.","zh":"用蹄踢（或刨）地；用蹄踏"},"examples":[{"en":"The impatient horse hoofed the ground.","zh":"那匹不耐烦的马用蹄刨着地。"},{"en":"A deer hoofed the soft earth as it turned to run.","zh":"鹿转身要跑时，用蹄子踏了踏松软的泥土。"}]}],"synonyms":["(n.) hoof (no close common synonym)","(v.) paw","stamp","kick"],"phonetic":"/huːf/","extraExplanation":["“hoof”的复数通常是“hooves”，尤其指动物的蹄子（较常见）；但在某些语境下也会看到“hoofs”。","常见搭配：hoof print（蹄印）、hoof beat（蹄声）、hoof care（蹄部护理）。在马术文化里，蹄部健康很重要，常会提到farrier（钉蹄铁/修蹄师）。"]}
{"word":"hoof-bearing","summary":{"en":"having hooves","zh":"有蹄的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) having hooves; having feet that end in hooves.","zh":"（动物）有蹄的；足端为蹄的。"},"examples":[{"en":"Deer are hoof-bearing mammals that move quickly through forests.","zh":"鹿是有蹄哺乳动物，能在森林里快速奔跑。"},{"en":"The zoo created a separate area for hoof-bearing animals such as giraffes and zebras.","zh":"动物园为长颈鹿、斑马等有蹄动物设置了单独的区域。"}]}],"synonyms":["hooved","hoofed","ungulate"],"phonetic":"/ˈhuːf ˌbɛrɪŋ/","extraExplanation":["hoof-bearing 常见于动物学或较正式的说明文中，日常英语里更常说 hooved 或 hoofed（有蹄的）。在生物分类中，有蹄动物常被讨论为 ungulates（有蹄类动物）。"],"etymology":"由 hoof（蹄）+ bearing（带有、具有）构成；bearing 在这里表示“携带/拥有某特征”。","mnemonic":["拆开记：hoof=“蹄”，bearing=“带着/具有”。合起来就是“带着蹄的”→“有蹄的”。","联想中文：看到“bearing（承载）”就想到“承载着某物”→“脚上承载着蹄”。"]}
{"word":"hoof-footed","summary":{"en":"having hooves","zh":"有蹄的；长蹄的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having feet that end in hooves; hoofed.","zh":"长着蹄的；有蹄的。"},"examples":[{"en":"Deer are hoof-footed animals that move quietly through the forest.","zh":"鹿是有蹄动物，能安静地穿过森林。"},{"en":"In Greek myths, the hoof-footed satyrs are often shown dancing in the woods.","zh":"在希腊神话里，有蹄的萨堤尔常被描绘成在林中起舞。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling a hoof in shape or movement (often used descriptively in writing).","zh":"（多用于描写）形状或走路方式像蹄的。"},"examples":[{"en":"The statue’s hoof-footed base looked sturdy and ancient.","zh":"那座雕像的“蹄状”底座看起来结实而古老。"},{"en":"He wrote about the hoof-footed rhythm of horses on the road.","zh":"他写到马在路面上“蹄声般”的节奏。"}]}],"synonyms":["hoofed","ungulate","cloven-hoofed"],"phonetic":"/ˈhufˌfʊtɪd/","etymology":"由 hoof（蹄）+ footed（有……脚的）构成的复合形容词，字面意思是“有蹄脚的/以蹄为足的”。","mnemonic":["把它拆开记：hoof（蹄）+ footed（有脚的）→“脚是蹄”的动物。","联想中文“有蹄类”，看到 hoof 就想到“牛、马、鹿的蹄”。"]}
{"word":"hoof-like","summary":{"en":"having the shape or characteristics of an animal hoof","zh":"具有动物蹄的形状或特征的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hoof in shape, texture, or function.","zh":"像蹄的；蹄状的（在形状、质地或功能上类似动物的蹄）。"},"examples":[{"en":"The sculpture has hoof-like feet, giving it an animal quality.","zh":"这座雕塑的脚是蹄状的，让它看起来更像动物。"},{"en":"Some shoes have a hoof-like sole that makes a loud clopping sound.","zh":"有些鞋子的鞋底做成蹄状，走路会发出很响的“哒哒”声。"},{"en":"The creature left hoof-like prints in the mud.","zh":"那生物在泥里留下了蹄状的脚印。"}]}],"synonyms":["hoofed","ungulate-like","cloven-hoofed"],"phonetic":"/ˈhuːfˌlaɪk/","etymology":"由 hoof（“蹄”）+ -like（“像……一样”）构成的复合形容词；意思直译为“像蹄的”。","mnemonic":["记成“hoof（蹄）+ like（像）= 像蹄的”。","联想中文“蹄状”：看到“hoof-”就想到“蹄”，看到“-like”就想到“像……一样”。"]}
{"word":"hoof-shaped","summary":{"en":"having the form of an animal’s hoof","zh":"呈动物蹄子外形的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a hoof (the hard foot of a horse, deer, etc.).","zh":"蹄子形的；像动物蹄子的形状。"},"examples":[{"en":"The sculpture sits on a hoof-shaped base.","zh":"这座雕塑放在一个蹄形底座上。"},{"en":"She chose a hoof-shaped pendant for her necklace.","zh":"她选了一个蹄形吊坠当项链配饰。"}]}],"synonyms":["hooflike","hoof-like","ungulate-shaped","hoofed"],"phonetic":"/ˈhuːf ʃeɪpt/","etymology":"由 hoof（蹄）+ shaped（……形状的）组成的复合形容词；用来描述外形像“蹄”的轮廓或底部形状。","mnemonic":["把它拆开记：hoof=蹄，shaped=有……形状的 → “蹄形的”。","联想中文“蹄形/蹄状”，看到连字符就想到“名词+shaped=……形的”。"]}
{"word":"hoofbeat","summary":{"en":"Hoofbeat means the sound or rhythmic pattern of hoofs striking the ground, especially from horses.","zh":"hoofbeat 指马等有蹄动物踏地的声音或其节奏，尤指马蹄声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sound made by a horse’s (or other hoofed animal’s) hoofs hitting the ground; also the rhythm of that sound","zh":"（马或其他有蹄动物）蹄子踏地的声音；也指这种声音的节奏"},"examples":[{"en":"In the distance, she heard hoofbeats coming closer along the road.","zh":"在远处，她听到马蹄声沿着路越来越近。"},{"en":"The movie used steady hoofbeats to build tension before the riders appeared.","zh":"电影用规律的马蹄声来营造紧张感，骑手出现前气氛越来越压迫。"},{"en":"The hoofbeats echoed in the canyon like a drum.","zh":"马蹄声在峡谷里回荡，像鼓点一样。"}]}],"synonyms":["hoof sound","clop","clip-clop","hoof fall","hoofbeats"],"phonetic":"/ˈhuːfˌbiːt/","extraExplanation":["“hoofbeat”常用于叙事与描写环境音：马蹄声常被写成一种“预告式”的声音，暗示骑者、追逐、军队或消息将到来。","常见搭配：distant hoofbeats（远处的马蹄声）、the thunder of hoofbeats（如雷的马蹄声，用于很多马奔跑时）、the rhythm of hoofbeats（马蹄节奏）。","文化提示：英语里有句常被引用的医学格言“听到马蹄声，先想到马而不是斑马”（When you hear hoofbeats, think horses, not zebras），意思是面对线索时优先考虑最常见的解释。"]}
{"word":"hoofbeats","summary":{"en":"Hoofbeats are the sounds of hooves hitting the ground, and can also mean a figurative sign that something is approaching.","zh":"hoofbeats 指蹄子踏地的声音（马蹄声等），也可比喻某事逼近或将发生的征兆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sound made when an animal’s hooves (especially a horse’s) hit the ground repeatedly","zh":"（尤指马等有蹄动物）蹄子反复踏地发出的声音；马蹄声"},"examples":[{"en":"We heard hoofbeats coming closer on the road.","zh":"我们听到路上马蹄声越来越近。"},{"en":"In the quiet valley, the hoofbeats echoed off the rocks.","zh":"在安静的山谷里，马蹄声在岩壁间回响。"}]},{"partOfSpeech":"n.","definition":{"en":"(often figurative) a sign that something is approaching or about to happen, like distant hoofbeats getting nearer","zh":"（常为比喻）某事将要发生或正在逼近的征兆（像远处的马蹄声越来越近）"},"examples":[{"en":"The hoofbeats of change were already being felt in the small town.","zh":"这个小镇已经感受到了变革逼近的脚步声。"},{"en":"As deadlines neared, she could almost hear the hoofbeats of stress.","zh":"随着截止日期临近，她几乎能听见压力逼近的“马蹄声”。"}]}],"synonyms":["hoof sounds","hoofprints (not the sound)","clatter (general)","footsteps (figurative)"],"phonetic":"/ˈhuːfˌbeɪts/","extraExplanation":["“hoofbeats”在英语里常出现在医学/推理语境的提醒：When you hear hoofbeats, think horses, not zebras（听到马蹄声先想到马，而不是斑马）。意思是：先考虑更常见、更可能的解释，不要一开始就追求罕见复杂的答案。"]}
{"word":"hoofbound","summary":{"en":"Hoofbound describes a horse whose hooves are painfully tight/contracted; figuratively, it can mean stuck and unable to change.","zh":"hoofbound 指马的蹄部紧缩疼痛；也可比喻人或事被束缚住、难以改变或前进。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a horse) having hooves that are tight, dry, or contracted, causing pain and difficulty walking.","zh":"（马等）蹄部紧缩、干硬或收缩，导致疼痛、行走困难的。"},"examples":[{"en":"The farrier said the mare looked hoofbound and needed careful trimming and rest.","zh":"马蹄铁匠说这匹母马看起来有蹄部紧缩的问题，需要细致修蹄并休息。"},{"en":"A hoofbound horse may move with short, stiff steps.","zh":"蹄部紧缩的马可能会走得又短又僵硬。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) unable to move or change easily; stuck in one way of thinking or acting.","zh":"（比喻）难以改变或前进的；被某种思维或做法“困住”的。"},"examples":[{"en":"The team felt hoofbound by old rules and couldn’t try new ideas.","zh":"团队觉得被旧规章束缚住了，无法尝试新点子。"},{"en":"He wasn’t lazy—just hoofbound by fear of making mistakes.","zh":"他不是懒，只是被害怕犯错所困住。"}]}],"synonyms":["contracted-hoofed","stiff","restricted","stuck","immobile"],"phonetic":"/ˈhuːfˌbaʊnd/","extraExplanation":["“hoofbound”也常写作“hoof-bound”。它属于马匹护理/兽医语境：传统上用来形容蹄壁与内部组织活动度变差、蹄部“发紧”的状态，常与蹄部干燥、修蹄不当、缺乏运动或炎症等有关。","比喻用法不算常见，但在文学或评论中偶尔出现，用来强调“像蹄被绑住一样动弹不得”的感觉。"]}
{"word":"hoofed","summary":{"en":"“Hoofed” means “having hooves,” describing animals like horses, cows, and deer.","zh":"“hoofed”意为“有蹄的”，用来描述像马、牛、鹿等长着蹄子的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having hooves (hard foot coverings), like a horse, cow, deer, or goat.","zh":"有蹄的；长着蹄子的（如马、牛、鹿、山羊等）。"},"examples":[{"en":"Deer are hoofed animals that move quietly through the forest.","zh":"鹿是有蹄动物，会安静地穿行在森林里。"},{"en":"The hoofed mammals in this zoo include zebras and antelopes.","zh":"这个动物园里的有蹄哺乳动物包括斑马和羚羊。"}]}],"synonyms":["ungulate","hoof-bearing"],"phonetic":"/huːft/","extraExplanation":["“Hoofed”常用于科普/动物类语境，较正式；日常口语里也会说“animals with hooves（有蹄的动物）”。","相关概念：有蹄类动物常被分为“偶蹄动物”（如牛、鹿、羊）和“奇蹄动物”（如马、犀牛）；英语里分别常见为 even-toed/odd-toed ungulates。","“hoofed”也可用于形象描写（尤其文学/奇幻作品里），例如“hoofed creature（有蹄的生物）”暗示像马、鹿或神话中的半人马等。"]}
{"word":"hoofer","summary":{"en":"Hoofer most commonly means a dancer—especially a tap dancer—used in show-business talk; less commonly, it can mean a horse (old-fashioned slang).","zh":"hoofer最常指（尤指踢踏舞的）舞者，常见于演艺圈语境；较少见的旧式口语里也可指“马”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dancer, especially a tap dancer (often used in show-business contexts)","zh":"（尤指踢踏舞的）舞者；（常用于演艺圈语境）踢踏舞演员"},"examples":[{"en":"She started as a hoofer in small theater productions before moving to Broadway.","zh":"她最初在小型剧场演出中当踢踏舞演员，后来才登上百老汇。"},{"en":"The old-school hoofer kept perfect rhythm with every step.","zh":"这位老派踢踏舞演员每一步都踩得节奏精准。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, old-fashioned) a horse","zh":"（非正式、较旧用法）马"},"examples":[{"en":"He rode his hoofer across the ranch at dawn.","zh":"他黎明时骑着马穿过牧场。"}]}],"synonyms":["tap dancer","dancer","performer","hoof","horse"],"phonetic":"/ˈhuːfər/","extraExplanation":["“hoofer”源自“hoof”（兽蹄），最初带有把舞者的脚步声比作“蹄声”的感觉，因此常和踢踏舞联系在一起。","在20世纪早期美国杂耍（vaudeville）与音乐剧传统中，“hoofer”常用来指“以脚下功夫见长”的舞者（尤其是踢踏舞），有点行内称呼的味道。","作为“马”的意思更偏老派口语，现在较少见；现代英语更常直接说“horse”。"]}
{"word":"hoofers","summary":{"en":"“Hoofers” most commonly means tap dancers (slang); it can also informally mean horses.","zh":"“hoofers”最常指（俚语）踢踏舞舞者；也可非正式地指马。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dancer, especially a tap dancer (slang). “Hoofers” is the plural form of “hoofer.”","zh":"（俚语）舞者，尤指踢踏舞舞者。“hoofers”是“hoofer”的复数。"},"examples":[{"en":"The club hired three talented hoofers for the weekend show.","zh":"那家俱乐部为周末演出雇了三位很有才华的踢踏舞舞者。"},{"en":"In old movies, you’ll sometimes hear actors call tap dancers “hoofers.”","zh":"在老电影里，你有时会听到演员把踢踏舞者称为“hoofers”。"}]},{"partOfSpeech":"n.","definition":{"en":"Horses (informal), focusing on their hooves; sometimes used in racing or stable talk.","zh":"（非正式）马（强调马蹄）；有时用于赛马或马厩日常说法。"},"examples":[{"en":"The trainer checked the hoofers’ shoes before the race.","zh":"训练师在比赛前检查了这些马的马蹄铁。"},{"en":"Keep the hoofers calm in the trailer.","zh":"让车厢里的马保持安静。"}]}],"synonyms":["tap dancers","dancers","horses (informal)"],"phonetic":"/ˈhuːfɚ/","extraExplanation":["“hoofer”来自 hoof（蹄子）。把舞者叫作“hoofer”，带有形象比喻：跳踢踏舞时脚步像“蹄子”一样快速、有节奏地敲击地面。这种说法在美国英语里更常见，且带一点复古的舞台/演艺圈味道。"]}
{"word":"hoofiness","summary":{"en":"“Hoofiness” means clumsiness or an awkward, heavy-footed way of moving; more rarely, it can mean a humorous hoof-like quality.","zh":"“Hoofiness”指动作笨拙、脚步沉重不灵活；较少见时也可指带幽默意味的“像蹄子一样”的特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clumsiness or awkwardness, especially in movement (often suggesting someone is heavy-footed or ungainly).","zh":"笨拙；动作不灵活（常带“脚步沉重、四肢不协调”的感觉）。"},"examples":[{"en":"Despite his hoofiness on the dance floor, he kept trying and eventually improved.","zh":"尽管他在舞池里很笨拙，他还是一直练，最后真的进步了。"},{"en":"The puppy’s early hoofiness made it knock over chairs and trip on its own paws.","zh":"小狗小时候动作笨拙，经常撞倒椅子、自己绊到爪子。"}]},{"partOfSpeech":"n.","definition":{"en":"A hoof-like quality or appearance (rare; usually used humorously).","zh":"像蹄子一样的特征或外观（较少见；常带幽默意味）。"},"examples":[{"en":"The costume’s oversized shoes added a touch of hoofiness to the character.","zh":"那套服装的超大鞋子让角色多了点“蹄子感”。"}]}],"synonyms":["clumsiness","awkwardness","ungainliness","heaviness","lumberingness"],"phonetic":"/ˈhuːfi.nəs/","extraExplanation":["“hoofiness”不是特别常见的正式词，更常见于口语或幽默语境。它由“hoof（蹄子）+ -y（像……的）+ -ness（……的状态）”构成，因此常带有“像动物蹄子那样笨重、不灵活”的联想。写作中如果想更中性、更常用，可用 clumsiness / awkwardness；想更形象或带调侃意味时用 hoofiness 更贴切。"]}
{"word":"hoofing","summary":{"en":"“Hoofing” is informal for walking (often a long way), and in older slang it can also mean dancing energetically (especially tap).","zh":"“hoofing”常指（非正式）走路/走很远的路；在较旧俚语里也可指有力地跳舞（尤指踢踏舞）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"walking, especially for a long distance or because there is no ride (informal).","zh":"（非正式）走路，尤指走很远的路或因为没车/没搭到车而步行。"},"examples":[{"en":"We missed the last bus, so we were hoofing it home in the rain.","zh":"我们错过了末班车，只好冒雨步行回家。"},{"en":"If you keep hoofing all day, your feet will be sore.","zh":"如果你整天一直走路，你的脚会疼。"}]},{"partOfSpeech":"v.","definition":{"en":"dancing energetically, especially tap dancing (older slang).","zh":"（较旧的俚语）跳舞，尤指踢踏舞/轻快有力的舞步。"},"examples":[{"en":"They were hoofing on stage like classic tap dancers.","zh":"他们在舞台上跳得像经典踢踏舞舞者一样利落。"},{"en":"The old movie shows performers hoofing to a big band.","zh":"那部老电影里，演员们伴着大乐队音乐跳舞。"}]}],"synonyms":["walking","hiking","trudging","hoofing it","tap-dancing"],"phonetic":"/ˈhuːfɪŋ/","extraExplanation":["“hoof”本意是“（马、牛等的）蹄”。英语里常把人的“脚”幽默地叫作“hooves”，所以“hoof it”=“用脚走”。“hoofing”常见于口语/叙述中，意思接近“hiking / trudging / walking”。","表示“跳舞”的“hoofing”带有复古/舞台表演色彩，在老电影、音乐剧或谈踢踏舞时更常见。"]}
{"word":"hoofish","summary":{"en":"“Hoofish” means hoof-like, or (rarely) clumsy as if moving on hooves.","zh":"“hoofish”表示“像蹄的”，也可（较少用）指“像踩着蹄子一样动作笨拙的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hoof; having hoof-like shape or qualities (rare).","zh":"像蹄的；具有蹄状外形或特征的（较少用）。"},"examples":[{"en":"The creature had a hoofish foot that left deep prints in the mud.","zh":"那生物有一只蹄状的脚，在泥里留下很深的脚印。"},{"en":"In the drawing, the toes look hoofish rather than human.","zh":"在这幅画里，脚趾看起来更像蹄，而不像人的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Clumsy or awkward in movement, as if walking on hooves (rare, often humorous).","zh":"动作笨拙的；走路像“踩着蹄子”一样别扭的（较少用，常带幽默感）。"},"examples":[{"en":"I felt hoofish in those stiff new boots.","zh":"穿着那双又硬又新的靴子，我走起路来笨笨的。"},{"en":"He made a hoofish attempt at dancing and nearly tripped.","zh":"他笨拙地跳了几步舞，差点绊倒。"}]}],"synonyms":["hoof-like","ungainly","clumsy","awkward"],"phonetic":"/ˈhuːfɪʃ/","extraExplanation":["“hoofish”是由“hoof（蹄）+ -ish（有点像……的）”构成的形容词，整体语感就是“蹄一样的/带点蹄的感觉”。","它在现代英语里非常少见，更多属于描述性、玩笑式或文学性用法。日常表达里人们通常会改用更常见的词，如“hoof-like”“clumsy/awkward”。","注意不要和“foolish（愚蠢的）”混淆：两者拼写和发音相近，但意思完全不同。"]}
{"word":"hoofless","summary":{"en":"“Hoofless” means having no hooves.","zh":"“hoofless”表示“无蹄的；没有蹄子的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no hooves; without hoofs (the hard feet of animals like horses, deer, and cows).","zh":"无蹄的；没有蹄子的（指马、鹿、牛等动物脚上的硬质蹄）。"},"examples":[{"en":"Humans are hoofless animals, so we wear shoes to protect our feet.","zh":"人类是无蹄动物，所以我们穿鞋来保护脚。"},{"en":"The story describes a strange, hoofless creature walking quietly through the forest.","zh":"故事描写了一种奇怪的无蹄生物，悄悄地穿过森林。"}]}],"synonyms":["without hooves","unhoofed"],"phonetic":"/ˈhuːfləs/","extraExplanation":["“hoofless”是由 hoof（蹄）+ -less（没有……的）构成的形容词，属于很少见的词；日常表达更常用 without hooves / not hoofed。","复数拼写常见两种：hoofs（较常见、较直观）和 hooves（更传统/常见于正式用法）。两种都对。"]}
{"word":"hooflet","summary":{"en":"Hooflet means a small hoof (a rare word).","zh":"hooflet 指“小蹄”（较罕见用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hoof; a hoof-like small part at the end of an animal’s foot (a rare word).","zh":"小蹄；（罕见）指动物脚末端像蹄一样的小部分。"},"examples":[{"en":"The fawn’s hooflets made tiny prints in the mud.","zh":"小鹿的小蹄在泥地里留下了细小的脚印。"},{"en":"Up close, you could see each hooflet was still soft and newly formed.","zh":"近看时，你会发现每个小蹄还很柔软，像是刚长成的。"}]}],"synonyms":["small hoof","little hoof"],"phonetic":"/ˈhuːflət/","extraExplanation":["“hooflet”由hoof（蹄）+ 常见指小或可爱的后缀 -let 组成（如 booklet 小册子、piglet 小猪）。因此它通常带有“更小、更嫩、或更细”的语感。","这个词在现代英语里非常少见；写作或口语中更常用的说法是“small hoof”或“little hoof”。"]}
{"word":"hooflike","summary":{"en":"“Hooflike” means “having a shape or look like a hoof.”","zh":"“hooflike”表示“外形或外观像蹄的；蹄状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hoof (the hard foot of a horse, deer, etc.) in shape or appearance.","zh":"像蹄的；蹄状的（外形或外观类似马、鹿等动物的蹄）。"},"examples":[{"en":"The fossil showed a hooflike structure at the end of the limb.","zh":"这块化石在肢体末端显示出蹄状结构。"},{"en":"The creature had hooflike feet, suggesting it could run fast on open ground.","zh":"这种生物有蹄状的脚，暗示它可能适合在开阔地快速奔跑。"}]}],"synonyms":["hoof-shaped","hooflike (variant spelling uncommon)","ungulate-like"],"phonetic":"/ˈhuːflaɪk/","extraExplanation":["这个词由 hoof（蹄）+ -like（像……的）构成，常见于生物学、古生物学或文学描写中，用来强调“外形类似蹄”，不一定表示真的是蹄。","相关表达：hoof-shaped（蹄形的，强调形状）、cloven-hoofed（偶蹄的/分蹄的，如牛、羊、鹿）。"]}
{"word":"hoofmark","summary":{"en":"A hoofmark is a hoof-shaped print left on the ground by an animal.","zh":"hoofmark 指动物蹄子在地上留下的蹄印。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The mark or print left on the ground by an animal’s hoof (such as a horse, deer, or cow).","zh":"（马、鹿、牛等）动物蹄子在地面上留下的蹄印。"},"examples":[{"en":"We followed the hoofmarks through the muddy field.","zh":"我们沿着泥地里的蹄印追踪过去。"},{"en":"Fresh hoofmarks near the stream showed the animals had been there recently.","zh":"溪边新鲜的蹄印显示这些动物不久前来过。"}]}],"synonyms":["hoofprint","track","print","footprint (general)"],"phonetic":"/ˈhuːfˌmɑːrk/","extraExplanation":["“hoofmark”常见于野外追踪、狩猎或自然观察的语境；在日常英语里也常写作 hyphenated 形式 “hoof-mark” 或用更常见的 “hoofprint”。"]}
{"word":"hoofmarks","summary":{"en":"Hoofmarks are the tracks left by an animal’s hooves.","zh":"hoofmarks 指动物蹄子在地面上留下的蹄印。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prints or marks left on the ground by the hooves of an animal (especially horses, deer, cattle, etc.)","zh":"（动物，尤指马、鹿、牛等）蹄子在地面上留下的蹄印、蹄痕"},"examples":[{"en":"We followed the hoofmarks in the mud until they disappeared on the rocky path.","zh":"我们沿着泥地里的蹄印追踪，直到它们在石子路上消失。"},{"en":"Fresh hoofmarks showed that deer had passed through the field recently.","zh":"新鲜的蹄痕表明不久前有鹿穿过这片田地。"}]}],"synonyms":["hoofprints","tracks","footprints (for animals)","trail"],"phonetic":"/ˈhuːfˌmɑːrks/","extraExplanation":["“hoofmarks”是复数形式，单数是“hoofmark”。在野外观察或追踪动物时，常会结合蹄印的大小、形状、深浅和步距来判断动物种类、体型和行进方向。"]}
{"word":"hoofpick","summary":{"en":"a tool for cleaning the underside of an animal’s hoof","zh":"用于清理蹄底的工具"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tool used to clean dirt, stones, and manure from the underside of a horse’s (or other hoofed animal’s) hoof","zh":"（清理马等有蹄动物蹄底的）蹄钩；清蹄器"},"examples":[{"en":"Before riding, she used a hoofpick to clean each hoof.","zh":"骑马前，她用蹄钩把每只蹄子清理干净。"},{"en":"Check for small stones and remove them with a hoofpick.","zh":"检查有没有小石子，用蹄钩把它们挑出来。"},{"en":"Keep a hoofpick in your grooming kit.","zh":"在你的刷马/护理工具包里放一把蹄钩。"}]}],"synonyms":["hoof pick","hoof-cleaning tool","hoof scraper"],"phonetic":"ˈhuːfˌpɪk","extraExplanation":["常见于马术、养马与兽医护理场景。清蹄是日常护理的一部分，可帮助避免石子卡住、污物堆积引发不适或感染。实际使用时一般会配合“hoof brush（蹄刷）”，先挑再刷。"],"etymology":"复合词：hoof（蹄）+ pick（挑、钩/小工具）。字面意思就是“用来挑蹄子里的东西的工具”。","mnemonic":["把它拆开记：hoof=蹄，pick=挑/挑出来的工具 → “挑蹄子的工具”。","联想中文“挑蹄钩”：hoofpick 就是用来“挑”的那把“钩”。"]}
{"word":"hoofprint","summary":{"en":"A hoofprint is the mark left by an animal’s hoof on the ground.","zh":"hoofprint 指动物蹄子在地面上留下的印迹（蹄印）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mark or track left on the ground by the hoof of an animal (such as a horse, deer, or cow)","zh":"（马、鹿、牛等）动物蹄子在地面上留下的印迹；蹄印"},"examples":[{"en":"We followed the hoofprints in the mud to find where the horse went.","zh":"我们沿着泥地里的蹄印走，找到了那匹马去的方向。"},{"en":"Fresh hoofprints showed that deer had passed through the forest at night.","zh":"新鲜的蹄印显示夜里有鹿穿过这片森林。"}]}],"synonyms":["hoof track","track","footprint (general)","print"],"phonetic":"/ˈhufˌprɪnt/","extraExplanation":["“Hoofprint”是由hoof（蹄）+ print（印记）组成的复合词。日常写作中也常见同义表达track/hoof track（蹄迹）。如果印在雪地或沙地里，也可以说hoofprint in the snow/sand。"]}
{"word":"hoofprints","summary":{"en":"tracks left by an animal’s hooves","zh":"动物蹄子留下的印迹"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Marks or tracks left on the ground by the hooves of an animal (such as a horse, deer, or cow).","zh":"（马、鹿、牛等）有蹄动物的蹄子在地面留下的印迹、蹄印。"},"examples":[{"en":"Fresh hoofprints in the mud showed that a deer had passed by recently.","zh":"泥里新鲜的蹄印显示刚刚有只鹿经过。"},{"en":"The ranger followed the hoofprints along the riverbank.","zh":"护林员沿着河岸追踪那些蹄印。"},{"en":"After the rain, the trail was covered with hoofprints.","zh":"下雨后，小路上布满了蹄印。"}]}],"synonyms":["tracks","hoofmarks","footprints","traces"],"phonetic":"/ˈhuːfˌprɪnts/","extraExplanation":["hoofprints 通常用于描述野外追踪或观察动物活动的线索；对比：footprints 更泛指“脚印”（人或动物）。","在英语里也可用 hoofmarks 表示类似意思，偏向“蹄痕/蹄印”的感觉。"],"etymology":"复合词：hoof（蹄）+ print（印痕）。原意就是“蹄留下的印子”。常见也写作 hoof print / hoof-print。","mnemonic":["拆开记：hoof=“蹄”，print=“印”，合起来就是“蹄印”。","联想：看到“hoof”就想到“牛/马/鹿的蹄”，再加“print（印）”= 地上的痕迹。"]}
{"word":"hoofrot","summary":{"en":"Hoof rot is a painful bacterial infection of an animal’s hoof that often causes limping.","zh":"Hoof rot 指动物蹄部的细菌感染，疼痛并常导致跛行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bacterial infection that causes the hoof (or the skin between the toes) of animals—especially sheep, goats, and cattle—to become sore, swollen, and sometimes rotten-smelling; it can make the animal limp","zh":"（尤指绵羊、山羊、牛等的）蹄腐病/烂蹄病：一种细菌感染，使蹄部或趾间皮肤红肿、疼痛，常伴有腐臭味，导致跛行"},"examples":[{"en":"The farmer treated the sheep for hoof rot to stop them from limping.","zh":"农民给羊治疗蹄腐病，防止它们跛行。"},{"en":"Wet, muddy ground can increase the risk of hoof rot.","zh":"潮湿泥泞的地面会增加蹄腐病的风险。"},{"en":"If hoof rot spreads through the herd, it can seriously affect production.","zh":"如果蹄腐病在畜群中扩散，会严重影响产出。"}]}],"synonyms":["foot rot","infectious hoof disease"],"phonetic":"/ˈhuːf ˌrɑt/","extraExplanation":["“hoof rot”在实际英文中更常写作两词：hoof rot；在畜牧业里也常说“foot rot”（口语/通用说法）。","这种病多与潮湿环境、泥泞地面、蹄部受伤或卫生条件差有关；常见处理包括修蹄、消毒/药浴、保持地面干燥，以及必要时使用抗生素（依兽医建议）。"]}
{"word":"hoofs","summary":{"en":"“Hoofs” means the hard feet (hoofs/hooves) of animals like horses; it’s also an accepted plural spelling of “hoof,” though “hooves” is more common.","zh":"“hoofs”指马等动物的蹄子；它也是“hoof”的一种复数拼写，但“hooves”更常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the hard, protective foot of certain animals such as horses, cows, goats, and deer","zh":"（马、牛、羊、鹿等动物的）蹄；蹄子"},"examples":[{"en":"The horse’s hoofs made a loud sound on the stone road.","zh":"马的蹄子在石头路上发出很响的声音。"},{"en":"Deer hoof prints were visible in the mud.","zh":"泥里能看到鹿的蹄印。"}]},{"partOfSpeech":"other","definition":{"en":"the plural form of “hoof”; also used as a less common plural spelling of “hoof” (many people prefer “hooves”)","zh":"“hoof”的复数；也可作不太常见的复数拼写（许多人更常用“hooves”）"},"examples":[{"en":"Both “hoofs” and “hooves” are accepted plurals in English.","zh":"在英语里，“hoofs”和“hooves”都是可接受的复数形式。"},{"en":"In modern writing, “hooves” is more common than “hoofs.”","zh":"在现代写作中，“hooves”比“hoofs”更常见。"}]}],"synonyms":["hooves","cloven hooves","animal hooves"],"phonetic":"/hufs/","extraExplanation":["在英语里，一些以 -f 结尾的名词有两种复数：直接加 -s（hoof→hoofs），或把 -f 变成 -ves（hoof→hooves）。类似的还有：wolf→wolves（常见）、scarf→scarfs/scarves（两者都可）。一般学习者在正式写作中更安全的选择是用更常见的 “hooves”。"]}
{"word":"hoofworm","summary":{"en":"A rare/old word for a wormlike parasite affecting horses, often referring to a botfly larva thought to trouble the hoof.","zh":"一个较少见/偏旧的词，指影响马的虫状寄生虫，常泛指被认为会危害马蹄的胃蝇幼虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A parasitic larva (especially a botfly larva) associated with horses, traditionally believed to burrow into or trouble the hoof; often used in older or non-technical writing.","zh":"（尤指马虻/胃蝇的幼虫）一种与马有关的寄生虫幼虫，传统上认为会钻入或影响马蹄；多见于较旧或非专业的表述。"},"examples":[{"en":"The old farm book warned about hoofworms and other pests on working horses.","zh":"那本旧农书警告过役用马可能会有“hoofworm”等害虫。"},{"en":"Some people used “hoofworm” to mean a botfly larva, even though the problem is usually not literally inside the hoof.","zh":"有些人用“hoofworm”指胃蝇幼虫，尽管问题通常并不是字面意义上的“在马蹄里”。"}]}],"synonyms":["hoof bot","botfly larva","horse bot","bot"],"phonetic":"/ˈhʊfˌwɝːm/","extraExplanation":["“hoofworm”不是现代兽医里很标准的术语，更常见的说法是与马相关的“bot/botfly larva（胃蝇幼虫）”。历史上民间/旧文献有时把马的跛行或蹄部问题归因于“蹄虫”，因此这个词带有一定的传统观念色彩。阅读时可把它理解为“与马蹄相关的虫害（常指胃蝇幼虫）”，具体要看上下文。"]}
{"word":"hoofy","summary":{"en":"Hoofy means hoof-like or (informally) clumsy/heavy-footed.","zh":"Hoofy 指“像蹄子的/有蹄的”，也可口语指“笨拙、脚步沉重的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Having hooves, or looking like a horse’s hooves; hoof-like.","zh":"（非正式）有蹄的；像马蹄/兽蹄的；蹄状的。"},"examples":[{"en":"The costume came with big, hoofy boots.","zh":"那套服装配了很大、像蹄子一样的靴子。"},{"en":"In the mud, his shoes looked kind of hoofy.","zh":"在泥里，他的鞋看起来有点像蹄子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Clumsy or heavy-footed; having big, awkward feet.","zh":"（非正式）笨拙的；脚步沉重的；脚大而不灵活的。"},"examples":[{"en":"I’m too hoofy to dance in these tight shoes.","zh":"我穿这双紧鞋跳舞太笨拙了。"},{"en":"Stop being so hoofy—walk quietly.","zh":"别这么脚步沉，走路轻点。"}]}],"synonyms":["hoof-like","clumsy","heavy-footed","ungainly"],"phonetic":"/ˈhuːfi/","extraExplanation":["“hoofy”比较口语、也不算常见；多见于幽默描写、儿童故事、奇幻/角色扮演语境（比如把人打扮成马、羊、恶魔等有蹄角色）。","它来自名词“hoof”（兽蹄）+ 形容词后缀“-y”（表示“有……特征的”）。"]}
{"word":"hoogaars","summary":{"en":"Hoogaars: a traditional Dutch sailing boat, especially associated with Zeeland.","zh":"Hoogaars：一种与荷兰泽兰省有关的传统帆船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Dutch sailing vessel (a type of boat), originally used in the Zeeland region for fishing and carrying goods","zh":"一种传统的荷兰帆船（船只类型），起源于泽兰省一带，早期用于捕鱼与运输"},"examples":[{"en":"We saw a restored hoogaars sailing near the Zeeland coast.","zh":"我们在泽兰海岸附近看到一艘修复后的 hoogaars 正在航行。"},{"en":"The museum displays a model of a hoogaars used for coastal work.","zh":"博物馆展出了一艘用于近海作业的 hoogaars 船模。"}]}],"synonyms":["Dutch sailing vessel","traditional fishing boat"],"phonetic":"/ˈhoʊɡɑrz/","extraExplanation":["“hoogaars”是荷兰语词，英语里多见于航海史、地方文化或博物馆介绍等语境；在一般日常英语中不常用。","拼写提示：它不是“Hogwarts（霍格沃茨）”。如果你想查的是《哈利·波特》里的学校名，请告诉我，我可以改为解释“Hogwarts”。"]}
{"word":"hook","summary":{"en":"Hook means a curved device for hanging/catching, or a feature that grabs attention; as a verb, it means to attach with a hook or to captivate someone.","zh":"hook 既指“钩子/鱼钩”等钩状物，也指能吸引注意力的“亮点/开头”；作动词可表示“钩住/挂住”或“把人吸引住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a curved tool or device used for catching, holding, pulling, or hanging things","zh":"钩子；钩状工具（用于钩住、拉住或悬挂物品）"},"examples":[{"en":"Hang your coat on the hook by the door.","zh":"把外套挂在门边的钩子上。"},{"en":"The fisherman put bait on the hook.","zh":"渔夫把鱼饵挂在鱼钩上。"}]},{"partOfSpeech":"n.","definition":{"en":"something that quickly catches your attention or makes you interested (often in writing, music, or marketing)","zh":"吸引人的点子/开头；“抓住注意力”的东西（常用于写作、音乐或营销）"},"examples":[{"en":"The first sentence needs a strong hook.","zh":"第一句话需要一个有力的“钩子”（吸引点）。"},{"en":"That song has a catchy hook.","zh":"那首歌的副歌/旋律“钩子”很上头。"}]},{"partOfSpeech":"vt.","definition":{"en":"to catch, attach, or hang something using a hook; to fasten by catching onto something","zh":"用钩子钩住/挂住；把……钩住固定"},"examples":[{"en":"Hook the keychain to your bag so you don’t lose it.","zh":"把钥匙扣钩在包上，这样就不容易丢。"},{"en":"She hooked the curtain back.","zh":"她把窗帘用钩子钩到一边。"}]},{"partOfSpeech":"vt.","definition":{"en":"to attract someone’s interest; to make someone want to continue watching, reading, or listening","zh":"吸引（人）的兴趣；把人“钩住”让他想继续看/读/听"},"examples":[{"en":"The show hooked me in the first five minutes.","zh":"这部剧前五分钟就把我吸引住了。"},{"en":"A good mystery hooks the reader quickly.","zh":"好的悬疑故事会很快把读者“钩住”。"}]}],"synonyms":["catch","grab","fasten","attach","lure"],"phonetic":"/hʊk/","extraExplanation":["“hook”既有字面意思“钩子”，也有比喻义“吸引点”。在写作里，hook 常指文章开头用来抓住读者注意力的句子或段落；在流行音乐里，hook 常指最容易被记住、最“洗脑”的旋律或歌词片段（很多时候就是副歌的一部分）。","常见搭配：hook up（连接/勾搭/约炮等，语境差异很大，需注意正式场合慎用）；get hooked on（对……上瘾/着迷）；off the hook（口语：免于麻烦或责任；也可指“电话一直响个不停”）。"]}
{"word":"hook up","summary":{"en":"Hook up can mean connect equipment, meet up informally, start dating, or (in slang) have a casual sexual encounter.","zh":"Hook up 可指连接设备、非正式见面/结伴、开始约会/恋爱，也可作俚语指随意的性关系。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to connect or attach something (often equipment) so it works","zh":"（常指设备）连接、接通、安装好使其能运作"},"examples":[{"en":"Can you hook up the printer to my laptop?","zh":"你能把打印机连接到我的笔记本电脑吗？"},{"en":"The electrician hooked up the new lights in the kitchen.","zh":"电工把厨房的新灯安装并接通了。"}]},{"partOfSpeech":"phrase","definition":{"en":"to meet with someone or start spending time together (often informally)","zh":"（非正式）与某人见面、结伴、开始一起出去玩"},"examples":[{"en":"Let’s hook up after class and study together.","zh":"我们下课后碰面一起复习吧。"},{"en":"I hooked up with some friends downtown.","zh":"我在市中心和朋友们碰面了。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) to begin a romantic relationship or go on a date","zh":"（非正式）开始恋爱关系；约会"},"examples":[{"en":"They hooked up in college and later got married.","zh":"他们大学时在一起，后来结婚了。"}]},{"partOfSpeech":"phrase","definition":{"en":"(slang) to have a casual sexual encounter","zh":"（俚语）发生随意的性关系/一夜情（含糊但常带此意）"},"examples":[{"en":"In that show, characters often hook up at parties.","zh":"在那部剧里，角色们常在派对上发生关系。"},{"en":"He said they hooked up, but he didn’t give details.","zh":"他说他们发生了关系，但没讲细节。"}]}],"synonyms":["connect","attach","set up","meet up","get together","date","link up"],"phonetic":"/hʊk ʌp/","extraExplanation":["“hook up”在口语里意义很依语境而变：在技术/日常场景多是“连接设备”；在人际场景可能只是“见面/一起行动”，也可能暗示“约会/发生关系”。不确定时可改用更明确的表达：meet up（见面）、connect（连接）、date（约会）、have sex（发生性关系，较直接）。","美式口语中“hookup/hook-up”（名词）常指“随意的性关系/短暂暧昧”，在校园文化或影视中出现较多；正式场合建议避免使用以免误解。"]}
{"word":"hook-and-eye","summary":{"en":"a small clothing fastener made of a hook and a loop","zh":"由钩与环组成的衣物扣件"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A simple fastener made of a small hook that catches onto a small metal loop (the “eye”), used on clothing.","zh":"（衣物上的）钩眼扣：由一个小钩和一个金属小环（眼）组成的简单扣件，用来固定衣物。"},"examples":[{"en":"The tailor replaced the hook-and-eye on the dress so it would close properly.","zh":"裁缝把裙子上的钩眼扣换掉了，这样才能正常合上。"},{"en":"Many bras use hook-and-eye closures on the back.","zh":"很多胸罩背后用的是钩眼扣。"},{"en":"Fasten the hook-and-eye before zipping up.","zh":"先扣好钩眼扣，再拉拉链。"}]}],"synonyms":["hook-and-eye closure","hook-and-loop fastener","fastener","clasp","closure"],"phonetic":"/ˌhʊk ən ˈaɪ/","extraExplanation":["在服装与缝纫语境里，eye 常指“孔、环、扣眼”（如 eyelet 小孔扣、buttonhole 扣眼）。所以 hook-and-eye 直译成“钩和眼（环）”更容易理解其结构。","常见搭配：hook-and-eye closure（钩眼式扣合/钩眼扣）、sew on a hook-and-eye（缝上钩眼扣）、replace the hook-and-eye（更换钩眼扣）。"],"etymology":"来自“hook（钩子）+ eye（眼/环）”的组合叫法；这里的 eye 指“环/孔”（像眼睛一样的圆孔），并非“眼睛”本身。","mnemonic":["把它想成“钩住一个小圆圈（eye=像眼睛一样的圆圈）”，钩一勾就扣上。","联想中文“钩子+扣眼”：一个钩、一个眼（孔/环），一对配合才能扣住。"]}
{"word":"hook-beaked","summary":{"en":"Having a hooked, curved beak.","zh":"喙呈钩状弯曲的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a curved, hooked beak, like a hawk’s or eagle’s.","zh":"（鸟等）钩状喙的；喙向下弯曲如钩的（如鹰、隼等）。"},"examples":[{"en":"The hook-beaked raptor tore pieces from its prey.","zh":"那只钩喙的猛禽把猎物撕成碎片。"},{"en":"A hook-beaked parrot can crack hard nuts easily.","zh":"钩状喙的鹦鹉能轻松啄开坚硬的坚果。"}]}],"synonyms":["hooked","curved-beaked","raptorial"],"phonetic":"/ˌhʊkˈbikt/","extraExplanation":["常用于鸟类学/自然写作中，尤其描述猛禽（raptors，如鹰、隼、雕）和部分鹦鹉。钩状喙通常与“撕裂肉类、拆解食物”的取食方式有关。","写作中常见搭配：hook-beaked bird/raptor/parrot（钩喙鸟/猛禽/鹦鹉）。"],"etymology":"由 hook（钩子）+ beaked（有喙的）构成的复合形容词，用来形容“喙像钩一样弯曲”的外形特征。","mnemonic":["把它拆开记：hook=“钩”，beak=“鸟嘴/喙”，合起来就是“像钩一样弯的鸟嘴”。","联想“鹰钩鼻（hooked nose）”：hook-beaked 就是“钩喙”，同样是“弯钩”的形状。"]}
{"word":"hook-billed","summary":{"en":"Describing a downward-curving, hook-like beak.","zh":"形容喙向下弯曲、像钩子的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a beak or bill that curves downward like a hook.","zh":"（鸟的）钩嘴的；喙向下弯曲像钩子一样的。"},"examples":[{"en":"Eagles and hawks are hook-billed birds that tear meat.","zh":"鹰和隼属于钩嘴鸟类，适合撕扯肉。"},{"en":"The hook-billed parrot uses its curved beak to crack nuts.","zh":"钩嘴鹦鹉用弯曲的喙来啄开坚果。"}]}],"synonyms":["hooked","curved-beaked","hook-beaked"],"phonetic":"/ˈhʊk ˌbɪld/","extraExplanation":["常见于鸟类学或自然观察写作中：hook-billed 往往暗示“猛禽式”的撕裂进食方式（如鹰、隼），但也可用于其他喙明显弯曲的鸟（如部分鹦鹉）。","拼写上多用连字符（hook-billed），也可见不加连字符的写法（hook billed），但在正式描述中连字符更常见。"],"etymology":"由 hook（钩子）+ billed（有……喙/嘴的）构成的复合形容词；用于描述喙的形状（向下弯曲）。","mnemonic":["hook = “钩子”，billed = “有喙的”：想象“像钩子一样的鸟嘴”→ 钩嘴的。","把 billed 理解成“长着某种形状的嘴”：hook-billed 就是“长着钩形嘴”。"]}
{"word":"hook-curved","summary":{"en":"Curved in the shape of a hook.","zh":"呈钩状弯曲的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Curved like a hook; bending inward or around at the end.","zh":"像钩子一样弯曲的；末端向内弯或回弯的。"},"examples":[{"en":"The bird’s beak is hook-curved for tearing meat.","zh":"这种鸟的喙呈钩状弯曲，便于撕扯肉。"},{"en":"Choose hook-curved tweezers to grip small parts more easily.","zh":"选用钩形弯曲的镊子更容易夹取小零件。"},{"en":"The old nail was hook-curved after being pulled out of the wood.","zh":"那枚旧钉子从木板里拔出来后变成了钩状弯曲。"}]}],"synonyms":["hooked","hook-shaped","curved","bent","crooked"],"phonetic":"/ˈhʊk kɝvd/","etymology":"复合形容词：hook（钩子）+ curved（弯曲的）。直译为“像钩子一样弯曲”，常用于描述形状（如鸟喙、爪、工具、金属件等）。","mnemonic":["把它拆开记：hook=“钩”，curved=“弯的”，合起来就是“钩状弯的”。","联想常见的“鱼钩/衣钩”的末端弯回来——那种弯法就是 hook-curved。"]}
{"word":"hook-ended","summary":{"en":"ending in a hook-like curve","zh":"末端呈钩状的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an end that curves like a hook (used to describe tools, shapes, or parts of something).","zh":"末端呈钩状的；末端弯成像钩子一样的（用于描述工具、形状或某个部位）。"},"examples":[{"en":"The gardener used a hook-ended tool to pull weeds from tight spaces.","zh":"园丁用一把末端呈钩状的工具，把缝隙里的杂草勾出来。"},{"en":"Be careful—the wire is hook-ended and can snag your sleeve.","zh":"小心——这根铁丝末端是钩状的，容易勾住你的袖子。"}]}],"synonyms":["hooked","curved","crooked","hook-shaped","bent"],"phonetic":"/ˈhʊk ˌendɪd/","etymology":"由“hook（钩子）+ ended（有……末端的）”构成的复合形容词，用来强调“末端的形状”。常见于对物体形态的描述。","mnemonic":["把它拆开记：hook（钩）+ end（末端）+ -ed（……的）=“钩子一样的末端”。","联想中文“钩头”：看到“hook-”就想到“勾/钩”，再加“ended”就是“末端像钩一样”。"]}
{"word":"hook-fingered","summary":{"en":"having hook-shaped, strongly curved fingers","zh":"手指弯曲如钩的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having fingers that are curved like hooks; sometimes also suggesting claw-like, threatening hands.","zh":"钩状手指的；手指像钩子一样弯曲的（有时也带有“像爪子一样、让人不安/威胁”的感觉）。"},"examples":[{"en":"In the dim light, the old man’s hook-fingered hand gripped the cane tightly.","zh":"在昏暗的光线里，那位老人钩状的手紧紧握着拐杖。"},{"en":"The illustrator drew a hook-fingered villain to make the character look more sinister.","zh":"插画师把反派画成钩状手指，以让角色显得更阴森。"}]}],"synonyms":["crooked-fingered","clawlike","curved","gnarled","taloned"],"phonetic":"/ˈhʊk ˌfɪŋɡɚd/","etymology":"由 hook（钩子）+ finger（手指）+ -ed 组成，字面意思是“长着像钩子一样的手指”。常用于描写外形，也常见于文学/影视对“怪异或可怕人物”的刻画。","mnemonic":["把它拆开记：hook（钩子）+ finger（手指）→ “手指像钩子一样弯”。","联想中文“钩爪/钩子手”，画面感强：手指弯弯像钩住东西。"]}
{"word":"hook-free","summary":{"en":"without hooks; not requiring hooks","zh":"无挂钩的；不需挂钩的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not using or needing hooks; designed to be attached, hung, fastened, or used without hooks.","zh":"无需挂钩的；不使用挂钩的（指设计成不用钩子也能固定、悬挂或使用）。"},"examples":[{"en":"The hook-free curtain system uses a track instead of hooks.","zh":"这种无挂钩窗帘系统用轨道代替了挂钩。"},{"en":"I bought hook-free adhesive strips to hang pictures without damaging the wall.","zh":"我买了无挂钩的粘贴条来挂画，这样不会伤墙。"},{"en":"These hook-free bra clips are more comfortable for some people.","zh":"对一些人来说，这种无挂钩的胸罩扣更舒服。"}]},{"partOfSpeech":"adj.","definition":{"en":"Free from hooks or hook-shaped parts; having no hooks.","zh":"没有钩子（或钩状部件）的；无钩的。"},"examples":[{"en":"Choose hook-free earrings if your ears are sensitive.","zh":"如果你耳朵敏感，选无钩耳环更合适。"},{"en":"The hook-free design reduces snagging on clothing.","zh":"无钩设计能减少勾到衣服的情况。"}]}],"synonyms":["hookless","no-hook","without hooks","clip-on","adhesive"],"phonetic":"/ˈhʊk friː/","extraExplanation":["写作上常见两种形式：hook-free（作定语更常见，如 hook-free system）与 hook free（作表语时也可见，如 The system is hook free）。在正式写作中，作为名词前定语时用连字符更清晰。"],"etymology":"由 “hook”（钩子）+ “free”（无……的）构成的复合形容词，常用连字符表示“无钩/不需钩”的属性，多见于产品说明与广告语。","mnemonic":["记忆法：free=“免/无”，像“sugar-free（无糖）”“smoke-free（无烟）”，所以 hook-free=“无钩/免挂钩”。","联想：把它当成“hook（钩子）被 free（放走）了”，所以“没有钩子”。"]}
{"word":"hook-headed","summary":{"en":"Having a hook-like, curved head shape.","zh":"头部形状像钩子一样弯曲。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a head (or beak/face) that is curved like a hook.","zh":"头部（或喙/面部）呈钩状、向内弯曲的。"},"examples":[{"en":"The hawk’s hook-headed profile makes it easy to recognize in silhouette.","zh":"鹰那种钩状头部的轮廓，让人从剪影里也很容易认出来。"},{"en":"In the drawing, the monster is hook-headed with a sharp, bent snout.","zh":"在这幅画里，这个怪物是钩头的，鼻口尖而向内弯折。"}]}],"synonyms":["hooked","curved","hook-beaked","hook-nosed"],"phonetic":"/ˈhʊk ˌhɛdɪd/","etymology":"英语复合词：hook（“钩子”）+ headed（“……头的/有……头型的”）。字面意思就是“钩子形状的头”。","mnemonic":["把它拆开记：hook=“钩”，-headed=“……头的”。所以 hook-headed = “钩头/钩状头”。","联想“鹰钩鼻/鹰嘴”：很多猛禽喙向下弯，像钩子一样。"]}
{"word":"hook-like","summary":{"en":"curved and shaped like a hook","zh":"呈钩子形状、弯曲的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hook in shape; curved like a hook.","zh":"钩状的；像钩子一样弯曲的。"},"examples":[{"en":"The bird has a hook-like beak for tearing food.","zh":"这种鸟有钩状的喙，用来撕裂食物。"},{"en":"A hook-like tool helps you pull the lid open.","zh":"钩状工具能帮你把盖子拉开。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a sharp curve that can catch, hold, or pull something.","zh":"具有能勾住、固定或拉拽东西的锐弯结构的。"},"examples":[{"en":"Use the hook-like end to grab the ring.","zh":"用钩状的一端去勾住那个环。"},{"en":"The plant’s hook-like thorns catch on clothing.","zh":"这种植物的钩状刺会勾住衣服。"}]}],"synonyms":["hooked","curved","crooked","sickle-shaped","clawlike"],"phonetic":"/ˈhʊkˌlaɪk/","extraExplanation":["拼写提示：hook-like 通常加连字符，尤其在名词前作定语（a hook-like shape）。有时也可写作 hooklike。"],"etymology":"由 hook（钩子）+ -like（像……一样的）构成；字面意思就是“像钩子一样”。","mnemonic":["把它拆开记：hook（钩子）+ like（像）＝“像钩子一样”，对应中文“钩状的”。","联想“鱼钩/钩子都是弯的、能勾住东西”，所以 hook-like 常描述“弯曲、能勾住”的形状。"]}
{"word":"hook-maker","summary":{"en":"a person or device that produces hooks","zh":"制作钩子的工匠或机器"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to make hooks (for example, fishhooks or other metal hooks).","zh":"制作“钩子”的人（例如鱼钩或其他金属挂钩的工匠/制作者）。"},"examples":[{"en":"The hook-maker shaped each fishhook by hand.","zh":"这位制钩工匠把每一枚鱼钩都用手工塑形。"},{"en":"Local hook-makers supplied gear to the fishing boats.","zh":"当地的制钩者为渔船提供渔具。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool, machine, or device used to make hooks.","zh":"用来制作钩子（如鱼钩/挂钩）的工具、机器或装置。"},"examples":[{"en":"They bought a hook-maker to speed up production.","zh":"他们买了一台制钩机来加快生产。"},{"en":"This hook-maker bends wire into consistent shapes.","zh":"这台制钩装置能把铁丝弯成一致的形状。"}]}],"synonyms":["hook manufacturer","hook builder","hook producer","hook smith"],"phonetic":"/ˈhʊk ˌmeɪkɚ/","extraExplanation":["写法提示：更常见的拼写是两词或加连字符（hook maker / hook-maker）。连字符通常用来把它当作一个整体名词，尤其在作定语时（如 hook-maker tools）。","语境上多见于渔具、金工/线材加工、或手工艺相关文本；如果指“做钩针手工的人”，英语更常用 crocheter / crochet artist，而不是 hook-maker。"],"etymology":"复合词：hook（钩子）+ maker（制造者/制造工具）。英语里常用“名词 + maker”来表示“制作某物的人或机器”，例如 shoemaker（鞋匠）、troublemaker（惹事的人）。","mnemonic":["把它拆开记：hook=钩子，maker=制造者/机器 → “做钩子的”。","联想：shoemaker（鞋匠）同结构，换成 hook 就变成“制钩者/制钩机”。"]}
{"word":"hook-making","summary":{"en":"the craft or process of producing hooks; related to producing hooks","zh":"制作钩子的工艺/过程；与制钩相关"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or craft of making hooks (for fishing, clothing, tools, etc.)","zh":"制作“钩子”的活动或手艺（如鱼钩、衣钩、工具钩等）"},"examples":[{"en":"The museum has a small display on traditional hook-making for fishing.","zh":"博物馆里有一个小展区介绍传统的鱼钩制作。"},{"en":"Hook-making requires careful shaping and smoothing of the metal.","zh":"制作钩子需要细致的塑形和打磨。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to making hooks; used to describe tools, materials, or processes for producing hooks","zh":"与制作钩子有关的；用于描述制作钩子的工具、材料或工序"},"examples":[{"en":"They sell hook-making kits for beginners.","zh":"他们卖给新手用的制钩套装。"},{"en":"The workshop teaches hook-making techniques step by step.","zh":"这家工坊一步步教授制钩技巧。"}]}],"synonyms":["hook production","hook manufacture","making hooks"],"phonetic":"/ˈhʊk ˌmeɪkɪŋ/","extraExplanation":["英语里“名词 + -making”常用来表示“制作/生产某物的过程或行业”，例如 candle-making（制蜡烛）、cheese-making（制奶酪）。在作定语时常用连字符：hook-making tools（制钩工具）。"],"etymology":"由 hook（钩子）+ making（制作）构成的复合词/连字符形式，用来表示“制作钩子”这一活动或相关事物。","mnemonic":["把它拆开记：hook（钩子）+ making（制作）=“做钩子”。","联想中文：‘钩’+‘制作’=‘制钩’，看到连字符就当成一个整体名词/形容词。"]}
{"word":"hook-necked","summary":{"en":"with a neck bent forward like a hook","zh":"脖子像钩子一样前弯的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a neck that curves or bends like a hook; hunched at the neck.","zh":"（脖子）像钩子一样弯曲的；缩颈、驼颈的。"},"examples":[{"en":"A hook-necked old man sat by the window, staring into the rain.","zh":"一位缩着脖子的老人坐在窗边，望着雨发呆。"},{"en":"The character is drawn hook-necked to show fear and weakness.","zh":"这个角色被画成缩颈的样子，用来表现恐惧与软弱。"}]}],"synonyms":["hunched","stooped","bent-necked","hooked"],"phonetic":"/ˈhʊkˌnɛkt/","extraExplanation":["这是偏文学/描写性的复合形容词，常用于刻画姿态（紧张、畏缩、年老）或外形轮廓。日常口语更常说：with a hunched neck / neck bent forward。"],"etymology":"复合形容词：hook（钩子）+ necked（有……脖子的）。英语里常用“名词 + -ed”构成外貌描写（如 long-legged, blue-eyed），这里用“hook”强调脖子的弯曲形状。","mnemonic":["把它拆开记：hook（钩子）+ neck（脖子）+ -ed（有……的）→“脖子像钩子一样弯”。","联想中文“缩着脖子像个钩”：害怕或年迈时容易出现这种姿态。"]}
{"word":"hook-nose","summary":{"en":"a downward-curving nose; having such a nose","zh":"向下弯曲的鼻子；具有这种鼻型的"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nose that curves downward like a hook","zh":"钩状鼻；鼻梁或鼻尖向下弯曲、像钩子一样的鼻子"},"examples":[{"en":"The actor wore a prosthetic hook-nose for the comedy scene.","zh":"那位演员在喜剧场景里戴了一个假钩状鼻。"},{"en":"From the side view, his hook-nose was more noticeable.","zh":"从侧面看，他的钩状鼻更明显。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a nose that curves downward like a hook","zh":"（鼻子）钩状的；向下弯曲的"},"examples":[{"en":"The detective described the suspect as hook-nosed and tall.","zh":"侦探描述嫌疑人是钩鼻子而且个子很高。"},{"en":"The illustrator drew a hook-nose profile to make the character look older.","zh":"插画师画了一个钩状鼻的侧脸，让角色看起来更老。"}]}],"synonyms":["hooked nose","aquiline nose","curved nose","beaked nose"],"phonetic":"/ˈhʊkˌnoʊz/","extraExplanation":["语气提示：hook-nose/hook-nosed 多数情况下是中性外貌描述，但在某些历史与文化语境中曾被用来强化对特定族群（尤其犹太人）的刻板印象，因此在形容真实人物时可能显得不礼貌或带偏见。更中性的说法可以用 aquiline nose（鹰钩鼻/高挺略弯的鼻型）或 simply “a curved nose”（弯鼻）。"],"etymology":"由 hook（钩子）+ nose（鼻子）构成的复合词，字面意思是“像钩子一样的鼻子”。早期常用于外貌描写，后来也出现在漫画/刻板形象中。","mnemonic":["hook 是“钩子”，hook-nose 就是“像钩子一样弯的鼻子”。把“钩(勾) + 鼻”直接联想成“钩鼻”。","联想画面：侧脸鼻尖往下“勾”一下——就像鱼钩的弯。"]}
{"word":"hook-nosed","summary":{"en":"Having a curved, prominent nose.","zh":"鼻子弯曲而突出的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a nose that is curved and prominent, like a hook.","zh":"（鼻子）钩状的；鹰钩鼻的（弯曲而突出）。"},"examples":[{"en":"The old man was tall and hook-nosed, with sharp eyes.","zh":"那位老人个子很高，鹰钩鼻，目光犀利。"},{"en":"In the portrait, she is shown with a strong, hook-nosed profile.","zh":"在那幅肖像里，她的侧脸鼻梁很硬朗，呈钩状。"}]}],"synonyms":["aquiline","curved-nosed","beak-nosed"],"phonetic":"/ˈhʊk noʊzd/","extraExplanation":["这是对外貌的描写词，语气可能偏负面或带刻板印象。在不同文化语境中，用来形容某些族群时曾被用于冒犯或歧视；写作或日常交流中更建议用更中性的说法，如 “aquiline nose（鹰鼻/鼻梁高而弯）” 或直接描述 “a curved nose（弯鼻）”。"],"etymology":"由 hook（钩子）+ nose（鼻子）+ -ed 组成；用“像钩子一样的鼻子”来形容鼻形，常见于人物外貌描写。","mnemonic":["把它拆开记：hook（钩子）+ nosed（有……鼻子的）→“长着像钩子一样的鼻子”。","联想“钩子=弯弯的”，鼻子弯弯突出就是 hook-nosed。"]}
{"word":"hook-shaped","summary":{"en":"Curved like a hook.","zh":"像钩子一样弯曲的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Curved like a hook; having a bent end or a shape similar to a hook.","zh":"钩状的；像钩子一样弯曲的。"},"examples":[{"en":"The bird has a hook-shaped beak for tearing food.","zh":"这只鸟有钩状的喙，用来撕裂食物。"},{"en":"She wore a hook-shaped pendant on a thin chain.","zh":"她戴着一条细链，上面挂着一个钩状吊坠。"},{"en":"A hook-shaped handle makes the bag easier to hang up.","zh":"钩状把手让包更容易挂起来。"}]}],"synonyms":["hooklike","curved","bent","crooked","curled"],"phonetic":"/ˈhʊk ˌʃeɪpt/","etymology":"由“hook（钩子）+ shaped（……形状的）”构成的复合形容词；用来描述外形像某物（这里是钩子）。常见结构还有：heart-shaped（心形的）、U-shaped（U形的）。","mnemonic":["拆开记：hook=钩子，shaped=有……形状的 → “像钩子一样的形状”=钩状的。","联想画面：看到“弯曲+尖端”的东西（鸟喙、伞柄、挂钩）就可以用它来形容。"]}
{"word":"hook-tailed","summary":{"en":"Having a hook-shaped tail.","zh":"尾巴呈钩状的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a tail that is curved or shaped like a hook.","zh":"钩状尾巴的；尾巴弯曲像钩子的。"},"examples":[{"en":"The hook-tailed lizard can grip branches with its curved tail.","zh":"这种钩状尾巴的蜥蜴能用弯曲的尾巴抓住树枝。"},{"en":"A hook-tailed kite circled above the field looking for prey.","zh":"一只钩尾风筝（鸟）在田野上空盘旋寻找猎物。"}]}],"synonyms":["hooked-tailed","curved-tailed","hooked"],"phonetic":"/ˈhʊk teɪld/","extraExplanation":["这是描述性用语，常见于自然写作、动物学或科普文章中。连字符（hook-tailed）用于把两个词连成一个整体形容词，尤其放在名词前时更常见：a hook-tailed bird。放在名词后有时也可写作不加连字符：The bird is hook tailed（较少见）/hook-tailed（更常见、也更规范）。"],"etymology":"复合形容词：hook（钩子）+ tailed（有……尾巴的）。英语里常用“形容词/名词 + -tailed”来描述动物尾巴的形状或特征，如 long-tailed（长尾的）、short-tailed（短尾的）。","mnemonic":["把它拆开记：hook（钩子）+ tail（尾巴）→ “尾巴像钩子一样弯”。","联想中文“钩尾”：看到“hook”就想到“钩”，看到“-tailed”就想到“有尾巴的”。"]}
{"word":"hook-up","summary":{"en":"Hook-up can mean a connection (like equipment or services), or an informal meeting—often implying casual sex. Hook up means to connect or to meet casually (often romantically/sexually).","zh":"hook-up 可指“连接/接通/对接”，也可指“随意的见面/约会”，常带“短暂性关系”的暗示；hook up 作动词可表示“连接、安排对接”或“随意约见（常带亲密/性暗示）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an arrangement, connection, or act of linking things (often equipment, services, or people) so they work together","zh":"（使……）连接、接通；对接（常指设备、服务或人员的衔接/配合）"},"examples":[{"en":"The internet hook-up in my apartment was installed yesterday.","zh":"我公寓的网络接通昨天装好了。"},{"en":"We need a hook-up between the new software and the payment system.","zh":"我们需要让新软件和支付系统对接。"}]},{"partOfSpeech":"n.","definition":{"en":"a meeting or date that is casual, and often implies sex without a serious relationship","zh":"（非正式的）约会/见面；（常暗示）“约炮”、短暂的性关系（不带正式恋爱承诺）"},"examples":[{"en":"They met at a party and had a hook-up, but it didn’t turn into a relationship.","zh":"他们在派对上认识并发生了一次“约炮”，但没有发展成恋爱关系。"},{"en":"He said he wasn’t looking for a hook-up; he wanted something serious.","zh":"他说他不是想找“一夜情”，而是想要认真交往。"}]},{"partOfSpeech":"v.","definition":{"en":"to connect or link (machines, systems, or people); to set something up so it works","zh":"（把……）连接/接通；（使……）配对、安排对接"},"examples":[{"en":"Can you hook up the printer to my laptop?","zh":"你能把打印机连接到我的笔记本电脑吗？"},{"en":"The agency hooked her up with a temporary job.","zh":"中介给她安排了一份临时工作。"}]},{"partOfSpeech":"vi.","definition":{"en":"to meet with someone casually, often for a romantic or sexual encounter (informal)","zh":"（非正式）与某人约见；（常指）发生短暂的亲密/性关系"},"examples":[{"en":"They hooked up after the concert.","zh":"他们在演唱会后“约”到了一起。"},{"en":"In some stories, the characters hook up but later realize they want more.","zh":"在一些故事里，角色先“随便在一起”，后来才发现想要更认真的关系。"}]}],"synonyms":["connection","link-up","setup","casual encounter","one-night stand (informal)","connect","link","set up"],"phonetic":"/ˈhʊkˌʌp/","extraExplanation":["“hook-up / hook up”在口语里非常常见，但在不同语境下含义差别很大：技术/连接类通常很中性；涉及人际关系时往往带有“随意、不承诺”的暗示。写作或正式场合建议用更明确的表达（如 connect, set up a meeting, have casual sex 等）。","拼写上也常见“hookup”（一个词）作名词，意思基本相同。","文化提示：在美国英语里，“hook up”有时也可仅指“约会/亲近”而不一定发生性行为，但很多人会默认有性暗示；如果要避免误会，可以直接说明你的意思。"]}
{"word":"hooka","summary":{"en":"A hookah is a water pipe used to smoke flavored tobacco (shisha).","zh":"hookah 指“水烟壶/水烟管”，用于吸食加味烟草（shisha）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a water pipe used for smoking flavored tobacco (often called shisha), common in parts of the Middle East, North Africa, and South Asia","zh":"水烟壶；水烟管（用来吸食加味烟草，常称为 shisha/“希沙”，在中东、北非和南亚等地区常见）"},"examples":[{"en":"They went to a hookah lounge after dinner.","zh":"晚饭后他们去了水烟馆。"},{"en":"The café serves tea and hookah.","zh":"这家咖啡馆提供茶和水烟。"},{"en":"Some people share a hookah while chatting with friends.","zh":"有些人会一边和朋友聊天一边共用水烟壶。"}]}],"synonyms":["water pipe","shisha (pipe)","hubble-bubble"],"phonetic":"/ˈhʊkə/","extraExplanation":["你输入的“hooka”通常是“hookah”的非标准拼写；在英语中更常见的拼写还有“hooka(h)”和“hubble-bubble”（较少见）。","“hookah/shisha”常出现在“hookah lounge（水烟馆）”这类场景表达中。需要注意：水烟并不比香烟“更安全”，烟雾同样可能含有有害物质。"]}
{"word":"hookah","summary":{"en":"A hookah is a water pipe for smoking (often flavored) tobacco; it can also mean to smoke using one.","zh":"hookah 指“水烟壶/水烟管”，也可作动词表示“用水烟壶抽水烟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a water pipe used for smoking tobacco (often flavored) or other substances; the smoke passes through water before being inhaled","zh":"水烟壶；水烟管（用来吸食烟草，常带香味等；烟雾会先经过水再吸入）"},"examples":[{"en":"They shared a hookah at a café after dinner.","zh":"他们晚饭后在咖啡馆一起抽了水烟。"},{"en":"Many hookah tobaccos are flavored with fruit or mint.","zh":"很多水烟烟草会加入水果或薄荷等口味。"}]},{"partOfSpeech":"v.","definition":{"en":"to smoke using a hookah","zh":"用水烟壶吸（烟）；抽水烟"},"examples":[{"en":"Some people hookah socially on weekends.","zh":"有些人周末会社交性地抽水烟。"}]}],"synonyms":["water pipe","shisha"],"phonetic":"/ˈhʊkə/","extraExplanation":["“hookah”常见于中东、南亚等地区的社交场景，在英语里也常写作 *shisha*（英式拼法也常见 *sheesha*）。","健康提示（语言学习背景信息）：很多人误以为“烟经过水就更安全”，但水烟仍可能带来尼古丁与一氧化碳等风险；在正式写作中可用更中性的表达如 “smoke a hookah / use a hookah”。"]}
{"word":"hookahs","summary":{"en":"Hookahs are water pipes used to smoke flavored tobacco, often in social settings.","zh":"Hookahs指用于吸食加味烟草的水烟壶，常见于社交场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pipe used for smoking flavored tobacco (or herbal mixtures) through water, usually shared socially.","zh":"一种水烟壶（通常用于吸食加味烟草或草本混合物），烟雾会先经过水过滤，常用于社交场合多人分享。"},"examples":[{"en":"They ordered tea and shared hookahs at the lounge.","zh":"他们在休闲吧点了茶，一起分享水烟壶。"},{"en":"Some cafés don’t allow hookahs because of local smoking laws.","zh":"有些咖啡馆因当地禁烟法规不允许使用水烟壶。"}]}],"synonyms":["water pipe","shisha (pipe)","narghile (nargile)"],"phonetic":"/ˈhʊkə/","extraExplanation":["“Hookah”源自波斯语/阿拉伯语文化圈，常见于中东、北非与南亚的社交场景；英文里复数可以写hookahs，也常见拼写hookahs/hookas，含义相同。","文化上，水烟常被认为“比较温和”，但医学研究指出水烟仍可能带来尼古丁与一氧化碳等健康风险；在不同地区也可能受到年龄限制或室内禁烟法影响。"]}
{"word":"hookaroon","summary":{"en":"A hookaroon is a long-handled hooked tool used to grab and move logs.","zh":"hookaroon 是一种长柄尖钩工具，用来钩住并搬动木材/木段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a logging tool with a long handle and a sharp hook (often with a small spike) used for grabbing, lifting, and pulling logs","zh":"一种伐木工具，长柄前端带尖钩（常带小尖刺），用于钩住、提起或拖拉木材"},"examples":[{"en":"He used a hookaroon to pull the log closer to the splitter.","zh":"他用 hookaroon 把木头钩过来，拉到劈木机旁边。"},{"en":"A hookaroon helps you move heavy rounds without bending over as much.","zh":"hookaroon 能帮你搬动沉重的木段，减少弯腰的次数。"}]}],"synonyms":["pickaroon","cant hook","log hook"],"phonetic":"ˌhʊkəˈruːn","extraExplanation":["这个词主要见于北美的林业/柴火处理语境，比日常口语少见。常与 pickaroon（尖钩搬木工具）一起被提到；有些人把 hookaroon 理解为“更像钩子”、pickaroon 更像“尖刺+钩”的变体，具体形状因品牌与地区而异。"]}
{"word":"hookas","summary":{"en":"“Hookas” usually means “hookahs,” the plural of hookah (a water pipe for smoking shisha).","zh":"“hookas”通常指“hookahs”，即 hookah 的复数：用于吸食水烟（shisha）的水烟壶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hookah; a water pipe used for smoking flavored tobacco (often called shisha).","zh":"水烟壶；一种通过水过滤来吸食（常为调味）烟草的烟具（常称 shisha）。"},"examples":[{"en":"They ordered mint shisha and shared a hookah at the café.","zh":"他们点了薄荷味的水烟，在咖啡馆一起抽水烟。"},{"en":"Some lounges rent hookahs by the hour.","zh":"有些水烟馆按小时出租水烟壶。"}]}],"synonyms":["hookahs","water pipes","shisha","narghile"],"phonetic":"ˈhʊkə","extraExplanation":["“hookas”常见于非正式拼写，通常是“hookahs”的简写/误拼；标准复数是“hookahs”。","Hookah 在中东、北非和南亚的一些社交场合较常见，但在不同国家/地区可能有年龄限制与法规。","英文里相关词：shisha（指水烟烟草/也可泛指水烟）、narghile/nargile（另一种说法，较书面或地区性）。"]}
{"word":"hookcheck","summary":{"en":"“Hook check” means a quick check to make sure a hook is secure (often for safety), or in fishing, to see if a fish is hooked.","zh":"“hook check”指快速检查钩子是否扣牢、是否安全；在钓鱼语境中也指确认是否已中鱼、鱼钩是否刺牢。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a quick inspection to make sure a hook (for lifting, hanging, or attaching) is properly fastened and safe to use","zh":"对“钩子”（用于吊装、悬挂或连接）进行快速检查，确认是否扣牢、是否安全可用"},"examples":[{"en":"Before lifting the load, do a hook check to confirm the latch is closed.","zh":"在起吊之前先做一次hook check，确认防脱卡扣已经合上。"},{"en":"The supervisor asked for a hook check on every chain and connector.","zh":"主管要求对每条链条和连接件都做一次hook check。"}]},{"partOfSpeech":"phrase","definition":{"en":"(fishing) a quick check to see whether the hook is set or a fish is still on the line","zh":"（钓鱼）快速确认鱼钩是否刺牢、鱼是否还在钓线上"},"examples":[{"en":"He gave the line a gentle pull as a hook check.","zh":"他轻轻拉了一下鱼线，作为一次hook check。"},{"en":"After the bite, she did a quick hook check before reeling in.","zh":"中鱼讯号出现后，她先做了个快速的hook check才开始收线。"}]}],"synonyms":["safety check","inspection","check","verify","double-check"],"phonetic":"/hʊk tʃɛk/","extraExplanation":["“hook check”更常见写作两个词（hook check），也可能连写成“hookcheck”作为内部术语、产品名或团队用语；在正式写作中通常建议用两个词。","在不同领域它指向的“钩子”可能不同（吊装钩、安全挂钩、鱼钩等），理解时看上下文：是否在谈安全作业（latch、load、chain）还是在谈钓鱼（line、reel、bite）。"]}
{"word":"hooked","summary":{"en":"Hooked most often means “very interested or addicted,” and it can also mean “caught/attached by a hook” or “hook-shaped.”","zh":"hooked 最常见表示“着迷/上瘾”，也可表示“被钩住/挂住”或“钩状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Very interested, excited, or unable to stop doing something; addicted.","zh":"（非正式）非常着迷、上瘾；停不下来。"},"examples":[{"en":"After the first episode, I was hooked on the show.","zh":"第一集看完后，我就对这部剧上头了。"},{"en":"He got hooked on online games during the winter break.","zh":"寒假期间他开始沉迷网络游戏。"},{"en":"The opening chapter hooked me right away.","zh":"开篇第一章立刻把我吸引住了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Caught with a hook, or fastened/attached by hooking.","zh":"被钩住的；用钩子固定/挂住的。"},"examples":[{"en":"The fish was hooked and pulled out of the water.","zh":"鱼被钩住了，被拉出水面。"},{"en":"Her bag was hooked onto the chair.","zh":"她的包挂在椅子上了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Curved like a hook.","zh":"像钩子一样弯曲的。"},"examples":[{"en":"The bird has a hooked beak.","zh":"这只鸟有一个钩状的喙。"},{"en":"He has a slightly hooked nose.","zh":"他的鼻子有点鹰钩鼻。"}]},{"partOfSpeech":"vt.","definition":{"en":"To catch or fasten with a hook; to attract and hold someone’s attention (past tense/past participle: hooked).","zh":"（用钩子）钩住/挂住；（引申）吸引并抓住注意力（hook 的过去式/过去分词：hooked）。"},"examples":[{"en":"She hooked the keychain to her backpack.","zh":"她把钥匙扣挂到背包上。"},{"en":"The headline hooked readers.","zh":"这个标题吸引了读者。"}]}],"synonyms":["addicted","engrossed","captivated","stuck on","attached","caught"],"phonetic":"/hʊkt/","extraExplanation":["“be/get hooked on + 名词/动名词”很常见，语气偏口语：I’m hooked on coffee / I got hooked on running。","在写作或影评里，“hook”也指“吸引人的开头/卖点”（a strong hook），因此 “The story hooked me.” 表示“故事一下抓住了我”。"]}
{"word":"hooked-beaked","summary":{"en":"having a downward-curving, hook-like beak","zh":"钩喙的；喙端向下弯如钩"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a beak that curves downward like a hook, often suited for tearing flesh.","zh":"（喙）钩状的；喙端向下弯曲、像钩子一样的，常便于撕裂食物（尤其是肉）。"},"examples":[{"en":"Eagles are hooked-beaked birds that can tear meat easily.","zh":"老鹰是钩喙鸟类，能很容易把肉撕开。"},{"en":"The hooked-beaked hawk gripped the prey with its talons.","zh":"那只钩喙的鹰用爪子抓住了猎物。"},{"en":"We identified the bird by its hooked-beaked profile and sharp claws.","zh":"我们通过它钩喙的侧影和锋利的爪子辨认出这只鸟。"}]}],"synonyms":["hook-billed","raptorial"],"phonetic":"/ˌhʊkt ˈbikt/","extraExplanation":["常见搭配：hooked-beaked birds（钩喙鸟类）。这类喙形在猛禽（eagles, hawks, falcons）和一些食腐鸟（vultures）中常见，是适应“撕扯、分解食物”的结构特征。","写作/科普语境里常用来帮助读者“凭外形辨识类别”。在日常口语中也可用更简单的表达：a bird with a hooked beak（有钩状喙的鸟）。"],"etymology":"由 hooked（像钩子一样的）+ beaked（有喙的）构成的复合形容词；常用于鸟类形态描写，尤其指猛禽等喙尖向下弯的特征。","mnemonic":["把它拆开记：hooked=像“钩子”一样，beaked=有“鸟喙”的 → 合起来就是“钩喙”。","联想中文“钩”：看到向下弯的喙尖，就像一个小钩子。"]}
{"word":"hookedness","summary":{"en":"Hookedness means the state or degree of being hook-shaped, and informally it can mean being strongly “hooked” on something.","zh":"Hookedness 指呈钩状的特征或程度；非正式用法也可指对某事“上瘾/很着迷”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being hooked; the degree to which something is bent, curved, or shaped like a hook","zh":"钩状（弯曲呈钩形）的特征或程度"},"examples":[{"en":"The hookedness of the bird’s beak helps it tear food.","zh":"鸟喙的钩状结构帮助它撕裂食物。"},{"en":"Engineers measured the hookedness of the metal tip to make sure it would catch securely.","zh":"工程师测量金属尖端的钩状程度，以确保它能牢牢钩住。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a strong attraction or dependence on something (similar to “being hooked”)","zh":"（非正式）对某事物的强烈沉迷或依赖（类似“上瘾/被迷住”）"},"examples":[{"en":"His hookedness on online games made it hard to focus on homework.","zh":"他对网络游戏的沉迷让他很难专注于作业。"},{"en":"The show’s hookedness comes from its short episodes and cliffhangers.","zh":"这部剧的“上头感”来自它短小的剧集和扣人心弦的结尾。"}]}],"synonyms":["curvature","hook shape","bentness","addiction (informal sense)","dependence (informal sense)"],"phonetic":"/ˈhʊkɪdnəs/","extraExplanation":["“hookedness”由形容词 hooked（钩状的/着迷的）+ 名词后缀 -ness 组成，表示“……的性质/状态”。在写作中更常见的表达是：the curvature / the hook shape（指形状），或 being hooked / addiction / dependence（指上瘾）。","第二个“沉迷”含义多见于口语或非正式评论中；正式场合通常用 addiction（成瘾）或 dependence（依赖）。"]}
{"word":"hookedwise","summary":{"en":"“Hookedwise” is a rare word meaning “in a hooked/curved way.”","zh":"“hookedwise”是个较少见的词，大意是“以钩状/弯曲的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Uncommon) in a hooked way; with a curved or hooked shape or direction.","zh":"（不常见）以钩状方式；呈弯曲、带钩的形状或方向。"},"examples":[{"en":"The wire was bent hookedwise so it could catch the ring.","zh":"这根金属丝被弯成钩状，以便能勾住圆环。"},{"en":"He cut the branch hookedwise to make a simple hanger.","zh":"他把树枝削成钩状，做了一个简易挂钩。"}]},{"partOfSpeech":"other","definition":{"en":"(Very rare) as a guideline meaning “in the manner of X,” where X is “hooked” (e.g., positioned/arranged like a hook).","zh":"（很少见）作“以……的方式”这类用法的临时构词：这里 X 为“hooked（带钩的）”，表示“像钩子那样地摆放/排列”。"},"examples":[{"en":"Place the end hookedwise to keep it from slipping.","zh":"把末端像钩子那样弯一下，防止它滑脱。"}]}],"synonyms":["in a hooked way","in a hooked shape","hook-shaped","curved"],"phonetic":"/ˈhʊktˌwaɪz/","extraExplanation":["“hookedwise”并不是现代英语里常见或标准的词，更常见的表达是：\n- “in a hooked shape / in a hooked manner”（以钩状/钩状地）\n- “hook-shaped”（钩状的，形容词）\n如果你原本想表达“顺时针”，正确拼写通常是 “clockwise”。\n如果你告诉我它出现的句子或领域（比如木工、缝纫、工程、方言），我可以帮你更准确地判断意思。"]}
{"word":"hooker","summary":{"en":"“Hooker” can mean a sex worker (often offensive), or it can refer to a hook punch in boxing, a rugby position, or certain fishing gear.","zh":"“hooker”可指性工作者（常带冒犯/贬义），也可指拳击的勾拳、英式橄榄球的位置，或某些钓鱼用具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sex worker (usually a woman); an informal term that can be rude or offensive","zh":"性工作者（通常指女性）；非正式用语，可能带有粗俗或侮辱性"},"examples":[{"en":"He used a rude word for sex workers, and it made people uncomfortable.","zh":"他用了一个粗俗的词来指性工作者，让人感到不舒服。"},{"en":"In many contexts, it’s better to say “sex worker” to be respectful.","zh":"在很多场合，用“sex worker（性工作者）”会更尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"a boxing punch that travels in a curved path (a hook)","zh":"（拳击）勾拳；轨迹呈弧形的拳"},"examples":[{"en":"He landed a left hook to the body.","zh":"他用一记左勾拳击中了对方的躯干。"},{"en":"The coach taught her how to throw a hook safely.","zh":"教练教她如何安全地打出勾拳。"}]},{"partOfSpeech":"n.","definition":{"en":"a player in rugby whose role includes “hooking” the ball in a scrum","zh":"（英式橄榄球）钩球前锋；在争球中负责把球“钩”回来的球员"},"examples":[{"en":"She plays hooker for her club team.","zh":"她在俱乐部队打钩球前锋的位置。"},{"en":"The hooker quickly hooked the ball back in the scrum.","zh":"在争球中，钩球前锋迅速把球钩回了己方。"}]},{"partOfSpeech":"n.","definition":{"en":"a fishing lure or device with hooks, used to catch fish","zh":"（钓鱼）带钩的拟饵/钓具"},"examples":[{"en":"He tied on a hooker lure before casting.","zh":"他在抛竿前系上了一个带钩的拟饵。"},{"en":"The hooker worked well in shallow water.","zh":"这种带钩拟饵在浅水区效果很好。"}]}],"synonyms":["sex worker","prostitute","hook punch","hook","rugby hooker"],"phonetic":"ˈhʊkɚ","extraExplanation":["“hooker”表示“性工作者”时是很口语、也常带贬义的说法，可能被视为不尊重或侮辱。在正式写作或礼貌场合，常用“sex worker（性工作者）”。","当你在体育语境（如橄榄球）或拳击语境听到“hooker”，通常是中性术语；理解语境很关键。"]}
{"word":"hookera","summary":{"en":"“Hooker” can mean a rugby position or someone who hooks something, but it is also a commonly used (often offensive) word for a sex worker.","zh":"“hooker”既可以指橄榄球的位置或“用钩子钩住的人”，也常用来指性工作者（但语气往往粗鲁/带侮辱性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sex worker (especially a prostitute); this word is often considered rude or offensive","zh":"性工作者（尤指妓女）；这个词常被认为粗鲁或带侮辱性"},"examples":[{"en":"He used an insulting word for a sex worker.","zh":"他用了一个侮辱性的词来指性工作者。"},{"en":"In news reports, journalists usually avoid the word “hooker” and use “sex worker” instead.","zh":"在新闻报道中，记者通常会避免使用“hooker”，而改用“sex worker（性工作者）”。"}]},{"partOfSpeech":"n.","definition":{"en":"in rugby, the player in the front row of the scrum who tries to hook the ball back","zh":"（英式橄榄球）钩球前锋；在争球阵中用脚把球“勾”回来的前排队员"},"examples":[{"en":"She plays hooker for the university rugby team.","zh":"她在大学橄榄球队打钩球前锋的位置。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who hooks something (for example, in fishing)","zh":"用钩子钩住某物的人（例如钓鱼时把鱼钩住的人）"},"examples":[{"en":"He’s a good hooker of fish—he rarely loses one.","zh":"他很会把鱼钩住——几乎不会让鱼跑掉。"}]}],"synonyms":["sex worker","prostitute","rugby hooker"],"phonetic":"/ˈhʊkɚ/","extraExplanation":["“hookera”本身不是常见英语单词，很多情况下可能是把“hooker”拼错了，或是在别的语言/网名里出现的变体。如果你能告诉我你看到它的句子或场景（聊天、歌词、游戏等），我可以更准确判断它指什么。","“hooker”来自动词“hook（用钩子钩）”，所以在体育（橄榄球位置）或字面意义上是中性词；但表示“妓女/性工作者”时语气往往带贬义。更中性的说法通常是“sex worker”。"]}
{"word":"hookerman","summary":{"en":"“Hookerman” is an informal slang term (often offensive) for a man involved with prostitution, especially a man who hires sex workers; a rare literal sense is someone who works with hooks.","zh":"“hookerman”是非正式俚语（常带冒犯），多指与卖淫有关的男性，尤指嫖客；少见的字面义是从事钩子相关工作的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, slang, often offensive) A man involved with prostitution—especially a man who hires sex workers or regularly visits prostitutes.","zh":"（非正式俚语，常带冒犯）与卖淫有关的男人——尤指嫖客，或经常找性工作者的人。"},"examples":[{"en":"That word is insulting—please don’t call anyone a “hookerman.”","zh":"那个词很侮辱人——请不要用“hookerman”去叫任何人。"},{"en":"In the movie, the character is described as a “hookerman,” but the language is crude.","zh":"电影里把那个角色说成“hookerman”，但这种说法很粗俗。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal) Someone who works with hooks (for example, making or using hooks in a job).","zh":"（少见，非正式）从事“钩子”相关工作的人（例如制作或使用钩子的工人）。"},"examples":[{"en":"The old tool shop employed a hookerman who specialized in metal hooks.","zh":"那家老工具店雇了一个专做金属钩子的工人。"}]}],"synonyms":["john (slang)","client (neutral)","customer (context-dependent)"],"phonetic":"/ˈhʊkərmən/","extraExplanation":["“hooker”在美式英语里常指“妓女/性工作者”，因此“hookerman”通常是由此衍生出来的俚语，用来指与卖淫相关的男性（多指嫖客）。这个词语气粗鲁、带羞辱色彩，现实交流中建议避免使用。","如果你想表达更中性的意思，可以根据语境用：“a client of a sex worker”（性工作者的客户）或“someone who buys sex”（买性服务的人）。","在文学或影视台词里出现时，往往用来体现人物粗俗、道德评价或社会偏见；并不是正式或中立的称呼。"]}
{"word":"hookers","summary":{"en":"“Hookers” can mean sex workers (often offensive slang), rugby players in the “hooker” position, or less commonly people/things that hook.","zh":"“Hookers”可指（常带冒犯的俚语）性工作者；也可指英式橄榄球“钩球员/前排中锋”位置的球员；较少见时指能钩住的事物或（口语）钩拳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often offensive) People who sell sex; sex workers (plural of “hooker”).","zh":"（非正式用语，常带冒犯）卖淫者；性工作者（“hooker”的复数）"},"examples":[{"en":"The movie uses the word “hookers,” but many people prefer “sex workers” because it’s more respectful.","zh":"这部电影里用了“hookers”这个词，但很多人更倾向用“sex workers（性工作者）”，因为更尊重。"},{"en":"He made a rude comment about “hookers,” and others told him to stop.","zh":"他用“hookers”说了粗鲁的话，别人让他别再这样说。"}]},{"partOfSpeech":"n.","definition":{"en":"Players in the rugby position called “hooker” (plural).","zh":"（英式橄榄球）“钩球员/前排中锋”这一位置的球员（复数）"},"examples":[{"en":"The hookers practiced their throws and timing for the scrum.","zh":"钩球员练习在争球中的抛掷和配合时机。"},{"en":"He used to play as one of the hookers on his club team.","zh":"他以前在俱乐部队里踢前排中锋（钩球员）位置。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) People or things that hook; also, in boxing, punches called “hooks” (sometimes said as “hookers”).","zh":"（较少见）能钩住/钩住别人的人或物；（拳击）钩拳（有时也会口语说成“hookers”）"},"examples":[{"en":"In training, he worked on quick hookers to the body. (boxing)","zh":"训练中，他练习快速的躯干钩拳。（拳击）"}]}],"synonyms":["sex workers","prostitutes (often negative)","rugby hookers"],"phonetic":"ˈhʊkɚz","extraExplanation":["“hooker”指“性工作者”时属于俚语，语气常带贬义或物化意味。在正式或需要尊重的语境中，更常用“sex worker（性工作者）”。","如果你在体育语境（如英式橄榄球）看到“hooker(s)”，通常与性含义无关。判断含义时要看上下文（例如是否出现scrum/lineout等术语）。"]}
{"word":"hookey","summary":{"en":"Hooky means being absent without permission, especially from school; most commonly used in “play hooky.”","zh":"Hooky 指未经允许缺课或缺勤（尤指逃学）；最常见用法是短语 “play hooky”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Absent from school or work without permission; skipping class or a responsibility.","zh":"（非正式）未经允许缺课或缺勤；逃学、旷工。"},"examples":[{"en":"He was marked absent because he went hooky yesterday.","zh":"他昨天逃学了，所以被记为缺席。"},{"en":"If you go hooky too often, you can get in trouble.","zh":"如果你经常逃学/旷工，可能会惹麻烦。"}]},{"partOfSpeech":"phrase","definition":{"en":"To skip school or work without permission (usually used in the phrase “play hooky”).","zh":"（通常用于短语“play hooky”）逃学、旷工。"},"examples":[{"en":"They decided to play hooky and go to the beach.","zh":"他们决定逃学去海边。"},{"en":"I can’t play hooky today—I have an exam.","zh":"我今天不能逃学——我有考试。"}]}],"synonyms":["skip class","skip school","ditch school","cut class","be absent"],"phonetic":"/ˈhʊki/","extraExplanation":["“Hooky”在美式英语里最常见的固定搭配是“play hooky”，语气偏口语，适合朋友间说，但在正式写作里更常用“skip school/class”或“be absent without permission”。","关于词源有不同说法：有人认为与“hook（钩子）”有关，表示“把自己从责任中钩走”；也有人认为可能来自早期俚语用法。无论哪种解释，现代用法主要集中在“逃学/旷工”这个意思。"]}
{"word":"hookeys","summary":{"en":"“Hookeys” means instances of skipping school/work without permission; most often seen in “play hooky.”","zh":"“Hookeys”指逃学/旷工的次数或行为，最常见于短语“play hooky（翘课/翘班）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “hooky”) times when someone skips school or work without permission; truancy.","zh":"（hooky 的复数）指未经允许逃学或旷工的次数；逃课/翘班行为。"},"examples":[{"en":"He got in trouble for too many hookeys last semester.","zh":"他上学期因为逃课次数太多而惹了麻烦。"},{"en":"The teacher noticed a pattern of hookeys on Fridays.","zh":"老师注意到大家总在周五出现逃课的规律。"}]},{"partOfSpeech":"phrase","definition":{"en":"Used in the common expression “play hooky”: to skip school or work without permission.","zh":"常见于短语“play hooky”：指未经允许逃学或旷工（翘课/翘班）。"},"examples":[{"en":"They decided to play hooky and go to the beach.","zh":"他们决定翘课去海滩。"},{"en":"I can’t play hooky today—I have an exam.","zh":"我今天不能翘课——我有考试。"},{"en":"She called in sick, but her boss suspected she was playing hooky.","zh":"她打电话说生病请假，但老板怀疑她是在翘班。"}]}],"synonyms":["truancy","cut class","skip school","ditch (class)","skip work"],"phonetic":"/ˈhʊki/","extraExplanation":["“hooky”在美式英语里很口语，常用来谈学生“逃学”。比起正式词“truancy（逃学行为）”，它更随意，甚至带点调侃。","词源不太确定，一般认为是19世纪美国口语用法发展而来。日常中最常见的固定搭配就是“play hooky”。"]}
{"word":"hookheal","summary":{"en":"“Hook heel” usually means hooking something with your heel; in soccer it can mean a heel flick/backheel-style pass.","zh":"“hook heel”通常指用脚跟勾住/带动某物；在足球语境中也可指脚后跟勾传（类似 backheel 传球）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to catch, pull, or move something by curving your foot so the heel “hooks” it (often used in sports or movement descriptions)","zh":"用脚跟“勾住”某物来带动、拉回或改变方向（常用于运动或动作描写）"},"examples":[{"en":"He hooked his heel behind the chair leg to drag it closer.","zh":"他用脚跟勾住椅子腿，把椅子拖近了一点。"},{"en":"She hooked her heel around the ball and turned quickly.","zh":"她用脚跟勾了一下球，然后迅速转身。"}]},{"partOfSpeech":"n.","definition":{"en":"a move (especially in soccer/football) where you use your heel to flick or redirect the ball, similar to a backheel pass","zh":"（尤指足球中的）脚后跟勾传/脚跟拨球动作，类似“脚后跟传球（backheel pass）”"},"examples":[{"en":"He surprised the defender with a quick hook heel pass.","zh":"他用一个快速的脚跟勾传让防守队员措手不及。"},{"en":"The goal started with a clever hook heel in midfield.","zh":"那粒进球源于中场一次巧妙的脚跟勾传。"}]}],"synonyms":["backheel","heel flick","hook with the heel"],"phonetic":"hʊk hiːl","extraExplanation":["“hookheal”更常见的写法是分开写作 **hook heel** 或加连字符 **hook-heel**。如果你是在看足球解说/集锦，它通常指用脚后跟把球“勾”给队友或改变球的方向，和 **backheel (pass)** 很接近。"]}
{"word":"hookier","summary":{"en":"Hookier means “more hook-shaped/crooked,” or informally “more likely to skip school/work.”","zh":"hookier 表示“更像钩子一样弯曲/更弯的”，口语中也可指“更爱逃学/旷工的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of hooky) More curved or shaped like a hook; more bent or crooked.","zh":"（hooky 的比较级）更像钩子一样弯曲的；更弯、更曲折的。"},"examples":[{"en":"The old nail is hookier than the new one, so it’s harder to pull out.","zh":"这颗旧钉子比新的更弯钩状，所以更难拔出来。"},{"en":"This branch is hookier, which makes it better for hanging a lantern.","zh":"这根树枝更像钩子一样弯，更适合挂灯笼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal; comparative of hooky) More inclined to skip school or work without permission.","zh":"（非正式；hooky 的比较级）更爱逃学/旷工的；更容易擅自缺勤的。"},"examples":[{"en":"He’s been hookier lately, missing classes for no good reason.","zh":"他最近更爱逃课了，没有正当理由就缺课。"},{"en":"If you feel hookier on Fridays, make plans that keep you accountable.","zh":"如果你在周五更容易想旷工/逃课，就安排一些能让你更有约束的计划。"}]}],"synonyms":["more curved","more hooked","more crooked","more bent","more likely to skip","more truant"],"phonetic":"ˈhʊkiər","extraExplanation":["“hookier”是形容词“hooky”的比较级（hooky → hookier → hookiest）。拼写规则是以 -y 结尾的形容词通常变为 -ier。","口语里常见搭配是“play hooky”（逃学/旷工）。这个说法在美式英语中很常用，但在正式写作里一般用“skip school/work”或“be absent without permission”。"]}
{"word":"hookies","summary":{"en":"“Hookies” usually means repeated acts of skipping school/work without permission (plural of “hooky”).","zh":"“Hookies”通常指多次翘课/旷工（是“hooky”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) times when someone skips school or work without permission; acts of truancy.","zh":"（复数）翘课/旷工的行为或次数；擅自缺勤。"},"examples":[{"en":"They got in trouble for taking too many hookies this semester.","zh":"他们这学期翘课太多，结果惹上了麻烦。"},{"en":"He promised he would stop pulling hookies and go to class.","zh":"他答应不再翘课，按时去上课。"}]},{"partOfSpeech":"adj.","definition":{"en":"(slang, less common) suspicious, poorly made, or not trustworthy (from “hooky”).","zh":"（俚语，较少见）可疑的、不靠谱的、做得很粗糙的（源自 hooky）。"},"examples":[{"en":"This website looks hooky—don’t enter your credit card details.","zh":"这个网站看起来很可疑——别输入你的信用卡信息。"}]}],"synonyms":["skip (class/school)","play hooky","truancy","cut class","ditch (class)"],"phonetic":"/ˈhʊki/","extraExplanation":["“hookies”通常是“hooky”的复数形式。最常见的固定搭配是 **play hooky**（翘课/旷工）。","关于来源：**hooky** 的起源不完全确定，但在美式英语里很早就用来表示“逃学/躲班”。在口语中也会引申为“可疑、不靠谱”。","使用提醒：如果你想说“翘课”，更自然的表达通常是 **play hooky** 或 **skip school/class**；“hookies”单独用作名词复数相对少见，但仍能被理解。"]}
{"word":"hookiest","summary":{"en":"Hookiest means the most hook-like, the catchiest (in music), or—informally—the most likely to skip school/work (from “play hooky”).","zh":"Hookiest 表示“最像钩子/最呈钩状的”；在音乐里也可指“最抓耳的”；口语里还可指“最爱逃学/旷工的”（源于 play hooky）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of **hooky**) most **hook-like**; having the strongest curve or hooked shape.","zh":"（**hooky** 的最高级）最像“钩子”的；弯曲度最大、最呈钩状的。"},"examples":[{"en":"Of all the branches, this one is the **hookiest**, so it’s easiest to hang a bag on.","zh":"在所有树枝里，这根最“钩”，所以最容易挂包。"},{"en":"The hookiest part of the beak helps the bird tear food.","zh":"鸟喙最呈钩状的部分能帮助它撕开食物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, music) most **catchy** or full of strong “hooks” (memorable musical ideas).","zh":"（非正式，用于音乐）最“抓耳”的；最充满强记忆点（hook）的。"},"examples":[{"en":"That chorus is the **hookiest** part of the song.","zh":"那段副歌是这首歌里最抓耳的部分。"},{"en":"They wrote their hookiest single for the summer tour.","zh":"他们为夏季巡演写了最抓耳的一支单曲。"}]},{"partOfSpeech":"adj.","definition":{"en":"(From the phrase **play hooky**) most likely to skip school or work without permission.","zh":"（来自短语 **play hooky**）最爱逃学/旷工的；最可能不请假就缺勤的。"},"examples":[{"en":"He was the hookiest kid in class and missed lessons all the time.","zh":"他是班里最爱逃学的孩子，总是缺课。"},{"en":"Don’t be hooky—talk to your teacher if you need a day off.","zh":"别逃课——如果你需要请假，就和老师沟通。"}]}],"synonyms":["most hooked","most curved","catchiest","most memorable","most likely to play hooky"],"phonetic":"ˈhʊkiəst","extraExplanation":["“hookiest”本质上是形容词“hooky”的最高级形式（hooky → hookier → hookiest）。日常英语里更常见的是短语 **play hooky**（逃学/旷工）；而在音乐评论中，**hooky**/hookiest 常用来夸旋律或副歌“很抓耳”。"]}
{"word":"hooking","summary":{"en":"Hooking can mean “very engaging,” “using a hook to attach/catch,” or informally “hooking up” (meeting for romance/sex). In some contexts it can refer to prostitution.","zh":"Hooking 可指“很吸引人”，也可指“用钩子挂住/钩住”。口语中常见于 hooking up（约会/暧昧/发生性关系）。在某些语境里也可指卖淫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"catching someone’s attention strongly; very engaging or attractive","zh":"很吸引人的；让人一下就被抓住注意力的"},"examples":[{"en":"The first scene is really hooking—I couldn’t stop watching.","zh":"第一幕非常吸引人——我一看就停不下来。"},{"en":"A good opening line is hooking for readers.","zh":"一个好的开头句对读者很有“钩子效应”，能把人吸引住。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “hook”) fastening, pulling, or catching with a hook-shaped object","zh":"（hook 的现在分词）用钩子固定、拉住或钩住"},"examples":[{"en":"She’s hooking the bag onto her arm.","zh":"她把包挂在手臂上。"},{"en":"Be careful—you might cut yourself while hooking the fish.","zh":"小心——把鱼钩住的时候可能会划伤自己。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) meeting up with someone, often for a romantic or sexual encounter (as in “hooking up”)","zh":"（非正式）与某人见面，常指约会或发生亲密/性关系（常见于 hooking up）"},"examples":[{"en":"They started hooking up after the party.","zh":"派对之后他们开始“勾搭/约炮”（开始发生亲密关系）。"},{"en":"Are you two hooking up, or just friends?","zh":"你们俩是在交往/暧昧，还是只是朋友？"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) involving prostitution (as in “hooking”)","zh":"（非正式）从事性交易/卖淫"},"examples":[{"en":"The film shows a teen who is forced into hooking.","zh":"这部电影描写一名青少年被迫卖淫。"}]}],"synonyms":["engaging","captivating","gripping","appealing","fastening","attaching"],"phonetic":"/ˈhʊkɪŋ/","extraExplanation":["“hook”原意是“钩子”。引申义里，“hooking”常用来形容内容像“钩子”一样把人“钩住”（抓住注意力）。写作/营销里也常说“a hook”（吸引人的开头、卖点）。","口语中“hooking up”含义很依语境变化：可以只是“见面/搭上线”，也可能特指“发生性关系”。在正式场合建议用更明确的表达（e.g., “dating,” “seeing someone,” “had sex”）以避免误解。"]}
{"word":"hookish","summary":{"en":"Hookish means hook-shaped or somewhat hooked, and sometimes describes something that tends to hook or snag.","zh":"Hookish 指“像钩子/有点钩状”，有时也指“容易勾住或挂住东西”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape or look of a hook; slightly hooked or curved at the end.","zh":"像钩子的；（末端）有点弯钩状的。"},"examples":[{"en":"The bird has a hookish beak that helps it tear food.","zh":"这只鸟有一个钩状的喙，能帮助它撕开食物。"},{"en":"His hookish nose gives his profile a sharp look.","zh":"他略带钩形的鼻子让侧脸看起来很立体。"}]},{"partOfSpeech":"adj.","definition":{"en":"Tending to hook, snag, or catch onto things (often describing a tool, finger, or movement).","zh":"容易勾住、挂住或缠住东西的（常形容工具、手指或动作）。"},"examples":[{"en":"Be careful—this hookish wire can snag your clothes.","zh":"小心——这根容易勾住东西的铁丝可能会挂到你的衣服。"},{"en":"The fishing lure has a hookish tip that catches quickly.","zh":"这个鱼饵的尖端很“钩”，很容易挂住。"}]}],"synonyms":["hook-shaped","hooked","curved","crooked","barbed"],"phonetic":"/ˈhʊkɪʃ/","extraExplanation":["“hookish”并不常见，更常用的表达是“hook-shaped / hooked / curved”。后缀“-ish”有“有点……、带……特征”的感觉，所以“hookish”通常暗示“有些像钩子”，不一定是标准的钩形。"]}
{"word":"hookland","summary":{"en":"Hookland is a (mostly) fictional name for an eerie, folklore-rich version of the English countryside, especially linked to Tom Cox’s writing.","zh":"Hookland 多指一种偏虚构的“英格兰乡野”意象：充满民俗与幽秘氛围，常与作家 Tom Cox 的作品相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fictional or semi-mythic version of the English countryside—often eerie, folkloric, and haunted—used as a setting or idea in modern British nature/folk writing (especially associated with writer Tom Cox).","zh":"（专有名词）一种虚构或半神话化的“英格兰乡野”概念/背景，常带有民俗、怪诞、幽秘甚至“闹鬼”的氛围；在现代英国自然写作与民俗风格作品中使用（尤其常与作家 Tom Cox 相关）。"},"examples":[{"en":"In Tom Cox’s essays, Hookland feels like a real place where old folklore still survives.","zh":"在汤姆·考克斯（Tom Cox）的随笔里，Hookland 像是个真实存在的地方，古老民俗仍在其中延续。"},{"en":"The film’s setting isn’t literally Hookland, but it has that Hookland mood—quiet lanes, strange omens, and half-seen creatures.","zh":"电影的背景并不是真正的 Hookland，但它有那种 Hookland 的气质——寂静小路、诡异征兆、若隐若现的生物。"}]}],"synonyms":["a folkloric countryside (idea)","a mythic landscape","rural folk-horror setting"],"phonetic":"/ˈhʊkˌlænd/","extraExplanation":["“Hookland”常被当作一种文化意象：把英格兰乡野写成介于现实与传说之间的空间（有点像“心理地理学”+“民俗恐怖”氛围），用来表达对自然、记忆、地方传说与现代生活冲突的感受。","发音与拼写像普通地名（Hook + land），但多用于文学/随笔语境；如果在一般对话里直接说“go to Hookland”，别人可能会以为你在说某个真实地名，需要补一句“a fictional place/idea”。"]}
{"word":"hookless","summary":{"en":"Hookless means “without hooks,” often describing a fastener or design that doesn’t use hooks.","zh":"hookless 意为“无钩的”，常用来形容不使用钩子结构的扣合或设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without hooks; designed or made so that it does not use hooks to fasten, hang, or catch onto something.","zh":"无钩的；不带钩子的；设计成不使用钩子来固定、悬挂或勾住的。"},"examples":[{"en":"The jacket has a hookless closure, so it zips up instead of using hooks.","zh":"这件夹克是无钩式的闭合设计，所以用拉链而不是用钩子扣上。"},{"en":"We chose a hookless hanger to avoid snagging delicate fabric.","zh":"我们选了无钩的衣架，避免勾坏精细的布料。"},{"en":"Some hookless designs are safer for children because nothing sharp sticks out.","zh":"一些无钩设计对孩子更安全，因为没有尖的部件伸出来。"}]}],"synonyms":["without hooks","hook-free","unhooked"],"phonetic":"/ˈhʊkləs/","extraExplanation":["“hookless”常见于服装与配件领域，指不用“hook-and-eye（钩眼扣）”的扣合方式，可能改用拉链、按扣、魔术贴或卡扣等。","历史上曾有“Hookless Fastener Company（无钩扣件公司）”，其“hookless fastener”与拉链早期发展有关；因此在一些旧文献或商品描述里会看到“hookless fastener”指代拉链或类似结构。"]}
{"word":"hooklet","summary":{"en":"Hooklet means a small hook, or a tiny hook-like structure (often in plants/animals) used for gripping or attaching.","zh":"Hooklet 指“小钩”，也可指动植物上用于抓握或附着的微小钩状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hook; a tiny curved piece used for fastening or catching","zh":"小钩；用于钩住、固定或挂住的小型弯钩"},"examples":[{"en":"The zipper has two hooklets that keep it from sliding down.","zh":"这条拉链有两个小钩，能防止它往下滑。"},{"en":"She hung the keys on a hooklet by the door.","zh":"她把钥匙挂在门边的小钩上。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural: hooklets) a tiny hook-like part on an animal or plant, used for gripping or attaching","zh":"（常用复数 hooklets）动物或植物上用于抓握、附着的微小钩状结构"},"examples":[{"en":"Some seeds have hooklets that cling to fur and clothing.","zh":"有些种子有小钩状结构，会粘在动物毛或衣服上。"},{"en":"The burr’s hooklets made it hard to remove from the sock.","zh":"苍耳的小钩让它很难从袜子上摘下来。"}]}],"synonyms":["small hook","tiny hook","little hook","barb (sometimes, in biology)"],"phonetic":"/ˈhʊklət/","extraExplanation":["“-let”是英语里常见的指小后缀，表示“更小的……”。例如：booklet（小册子）、leaflet（传单/小叶）、streamlet（小溪）。因此 hooklet 字面意思就是“little hook（小钩）”。","hooklet 在日常英语中不算常用；更常见的说法是 small hook / tiny hook。hooklet 更常出现在较专业的描述里（如植物、动物结构，或某些机械零件说明）。"]}
{"word":"hooklets","summary":{"en":"Hooklets are small hooks or tiny hook-like parts, used for fastening or for clinging/attaching in nature.","zh":"hooklets 指“小钩”或“钩状小结构”，可用于固定连接，也可指自然界中用于附着的细小倒钩/钩刺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hook; a tiny curved piece used to catch, fasten, or attach to something","zh":"小钩；用于勾住、固定或连接的微小弯钩"},"examples":[{"en":"The zipper got stuck because a hooklet caught the fabric.","zh":"拉链卡住了，因为一个小钩勾住了布料。"},{"en":"The shoe strap uses hooklets to keep it firmly closed.","zh":"这条鞋带用小钩来牢牢固定。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) a small hook-like structure, such as a tiny barb on a plant or animal that helps it cling or attach","zh":"（生物）钩状小结构；如植物或动物上用于附着的细小倒钩/小钩"},"examples":[{"en":"Burdock seeds spread by using hooklets that cling to animal fur.","zh":"牛蒡的种子靠会粘住动物毛的细小钩刺传播。"},{"en":"Under a microscope, the hooklets on the surface help it attach.","zh":"在显微镜下可以看到表面的细小钩状结构帮助它附着。"}]}],"synonyms":["small hooks","little hooks","barbs","hooks"],"phonetic":"/ˈhʊklət/","extraExplanation":["“hooklet”是“hook（钩）+ -let（表示“小”的后缀）”，所以字面意思就是“小钩”。复数为“hooklets”。","日常语境里，它常用来形容很小的钩状零件（例如衣物扣件、带子、拉链附近的钩）。在自然界里也常用来指“倒钩/钩刺”，比如某些植物种子用来粘在动物身上帮助传播。"]}
{"word":"hooklike","summary":{"en":"Hooklike means shaped like a hook—curved to catch or hold something.","zh":"hooklike 表示“钩状的”，像钩子一样弯曲，便于勾住或固定东西。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a hook; curved so it can catch, hold, or pull something.","zh":"钩状的；像钩子一样弯曲的（便于勾住、固定或拉住东西）。"},"examples":[{"en":"The bird has a hooklike beak for tearing meat.","zh":"这种鸟有钩状的喙，用来撕扯肉。"},{"en":"The climber used a tool with a hooklike tip to grab the rope.","zh":"攀登者用一个末端呈钩状的工具去勾住绳子。"},{"en":"A hooklike branch caught his jacket as he walked past.","zh":"他走过时，一根钩状的树枝勾住了他的夹克。"}]}],"synonyms":["hook-shaped","curved","bent","crooked"],"phonetic":"/ˈhʊkˌlaɪk/","extraExplanation":["“hooklike”也常写作“hook-like”（带连字符），意思不变。常用于描述形状（如 beak 喙、claw 爪、nose 鼻子、tip 尖端、curve 弧度等），在科学写作或说明文里很常见。"]}
{"word":"hookmaker","summary":{"en":"A hookmaker is someone who makes hooks, especially fishing or metal hardware hooks.","zh":"hookmaker 指制作各种钩子（尤其是钓鱼钩或五金金属钩）的人或公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company that makes hooks, especially fishing hooks or metal hooks used for tools and hardware.","zh":"制钩者；制钩工（指制作钓鱼钩或工具、五金用金属钩的人或公司）。"},"examples":[{"en":"The hookmaker supplies fishing hooks to local tackle shops.","zh":"这家制钩商为当地渔具店提供钓鱼钩。"},{"en":"In the past, a hookmaker might work in a small workshop with simple tools.","zh":"过去，制钩工可能在小作坊里用简单工具工作。"}]}],"synonyms":["hook manufacturer","hook maker","fishing hook manufacturer"],"phonetic":"/ˈhʊkˌmeɪkər/","extraExplanation":["“hookmaker”是由“hook（钩）+ maker（制造者）”构成的复合名词，语感上比较直白，常见于职业、行业描述或历史语境中。","在现代英语里，如果是具体行业，常更常见说法包括“fishing hook manufacturer（鱼钩制造商）”或“hook manufacturer（钩具制造商）”。"]}
{"word":"hookmaking","summary":{"en":"Hookmaking means the craft or process of making hooks, especially fishing hooks.","zh":"hookmaking 指制作钩子（尤其是鱼钩）的工艺或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft or process of making hooks (for example, fishing hooks or other metal hooks).","zh":"制作钩子（例如鱼钩或其他金属钩）的工艺或过程。"},"examples":[{"en":"He learned hookmaking from his grandfather and sells handmade fishing hooks.","zh":"他跟祖父学会了制钩，并出售手工鱼钩。"},{"en":"Traditional hookmaking often involves shaping wire, sharpening the point, and adding a barb.","zh":"传统制钩通常包括弯折金属丝、磨尖钩尖，并做出倒刺。"}]}],"synonyms":["hook-making","hook manufacture","fishing hook making"],"phonetic":"/ˈhʊkˌmeɪkɪŋ/","extraExplanation":["“hookmaking”并不是日常高频词，更常见的表达有：make fishing hooks（制作鱼钩）、hook manufacture（钩具制造）、hook-making（带连字符的写法更常见，尤其在标题或说明文中）。","语境提示：在钓鱼或手工艺社区里，“hookmaking”通常默认指“鱼钩制作”；如果指“钩针（crochet hook）制作”，常会明确写成 “crochet hook making”。"]}
{"word":"hookman","summary":{"en":"Hookman usually means either a worker who hooks loads for lifting, or (in urban legends) a hook-handed man.","zh":"Hookman通常指负责挂钩起吊的工人；也可指（都市传说中的）“钩手人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker who attaches hooks, chains, or slings to a load so it can be lifted or moved (for example, by a crane or hoist).","zh":"（起重/搬运作业中）负责把吊钩、链条或吊带挂到货物上以便起吊或移动的工人。"},"examples":[{"en":"The hookman signaled the crane operator after securing the load.","zh":"吊装工把货物挂稳后，向吊车司机打了信号。"},{"en":"Only a trained hookman is allowed to connect the rigging.","zh":"只有受过培训的挂钩工才可以连接吊具。"}]},{"partOfSpeech":"n.","definition":{"en":"In horror stories and urban legends, a man with a hook for a hand (often called “the Hookman”).","zh":"（恐怖故事或都市传说中）手上装着钩子的人（常被称为“钩手人/Hookman”）。"},"examples":[{"en":"The campers told a story about the Hookman lurking near the road.","zh":"露营者讲了一个“钩手人”在路边出没的故事。"},{"en":"That movie’s villain is basically a modern Hookman.","zh":"那部电影里的反派基本就是现代版的“钩手人”。"}]}],"synonyms":["rigger","hook-up man","hook-handed man"],"phonetic":"/ˈhʊk.mən/","extraExplanation":["“Hookman（钩手人）”这一形象常见于英语世界的都市传说，用来制造紧张气氛，类似“手持利器的神秘杀手”的母题；在一些作品中会被具体化为某个反派角色名称（如“The Hookman”）。"]}
{"word":"hooknose","summary":{"en":"“Hooknose” means a hooked (aquiline) nose; used for a person, it is often insulting and should be avoided.","zh":"“hooknose”指鹰钩鼻；用来指人时常带侮辱性，建议避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nose that curves downward at the tip; a hooked (aquiline) nose","zh":"鼻尖向下弯曲的鼻子；鹰钩鼻（较中性也可说 aquiline nose）"},"examples":[{"en":"In the portrait, the man’s hooknose gives his face a sharp profile.","zh":"在那幅肖像里，男子的鹰钩鼻让他的侧脸轮廓显得很凌厉。"},{"en":"The character is described as having a long hooknose and deep-set eyes.","zh":"这个人物被描写为长长的鹰钩鼻和深陷的眼睛。"}]},{"partOfSpeech":"n.","definition":{"en":"a person described mainly by having a hooked nose (often rude or offensive)","zh":"（以“鹰钩鼻”来指代的）某人（常带粗鲁或冒犯意味）"},"examples":[{"en":"The author avoids calling people “hooknoses” because it reduces them to a stereotype.","zh":"作者避免用“hooknoses”称呼别人，因为这会把人简化成刻板印象。"},{"en":"Please don’t use that word for a person—it can be insulting.","zh":"请不要用这个词指代某个人——它可能带有侮辱性。"}]}],"synonyms":["hooked nose","aquiline nose","Roman nose"],"phonetic":"ˈhʊkˌnoʊz","extraExplanation":["“hooknose”用来形容鼻型本身通常还算中性，但用来指人时很容易变成贬义标签。在英语语境中，它曾被用于带有偏见的刻板印象（包括反犹刻板印象），因此写作或交流中更建议用更中性的表达：a hooked/aquiline nose，或直接描述面部特征而不贴标签。"]}
{"word":"hooknosed","summary":{"en":"Having a downward-curving nose.","zh":"鼻尖向下弯曲的（钩状鼻）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a nose that curves downward at the tip, like a hook.","zh":"（鼻子）钩状的；鼻尖向下弯曲的。"},"examples":[{"en":"The old sailor was described as hook-nosed and weather-beaten.","zh":"那位老水手被描写成鼻子钩状、饱经风霜。"},{"en":"In the portrait, the character has a sharp, hook-nosed profile.","zh":"在那幅肖像里，人物侧脸轮廓很尖，鼻子呈钩状。"},{"en":"She recognized him by his hook-nosed silhouette.","zh":"她凭他钩状鼻子的剪影认出了他。"}]}],"synonyms":["aquiline","curved-nosed","beak-nosed"],"phonetic":"/ˈhʊkˌnoʊzd/","extraExplanation":["用法提醒：hook-nosed 有时会出现在带偏见的外貌刻板印象中，尤其在某些历史语境里曾被用作对特定族群的贬损描绘。因此在现实交流中不建议用它评价真实的人，除非是中性、客观的医学/外貌描述，或在分析文学作品/历史材料时加以说明。","更中性的替换说法：可以用 aquiline（鹰钩鼻的，较文雅/中性）或 curved nose（弯鼻子，直白中性）。"],"etymology":"由 hook（钩子）+ nose（鼻子）构成的复合形容词；原意是“像钩子一样弯的鼻子”，多用于外貌描写。","mnemonic":["把它拆开记：hook（钩子）+ nosed（有……鼻子的）→“钩子一样的鼻子”。","联想“钩子往下弯”→鼻尖向下弯曲的外形。"]}
{"word":"hooknoses","summary":{"en":"Hooknoses is the plural of hooknose: it can mean people with hooked noses, but it is also commonly an offensive ethnic slur (especially against Jewish people).","zh":"hooknoses 是 hooknose 的复数：可指“钩鼻子的人”，但也常被用作带歧视的族群侮辱（尤其针对犹太人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has a nose that curves downward at the tip (a “hooked” nose).","zh":"钩鼻子的人；鼻尖向下弯曲的人（“鹰钩鼻”）。"},"examples":[{"en":"In the sketch, the villain is drawn with hooknoses and heavy eyebrows.","zh":"在这幅草图里，反派被画成钩鼻子、浓眉的样子。"},{"en":"The artist avoided exaggerating hooknoses because it can look insulting.","zh":"这位画家避免夸张钩鼻子的特征，因为那样可能显得不尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"(offensive) a derogatory term used as an ethnic insult, especially aimed at Jewish people, based on a stereotype about nose shape.","zh":"（冒犯性）一种带有歧视的族群侮辱用语，尤其用来攻击犹太人，源于对鼻子形状的刻板印象。"},"examples":[{"en":"That word is offensive and shouldn’t be used.","zh":"这个词带有冒犯性，不应该使用。"},{"en":"The book discusses how antisemitic cartoons used exaggerated hooknoses to spread stereotypes.","zh":"这本书讨论了反犹漫画如何用夸张的钩鼻形象来传播刻板印象。"}]}],"synonyms":["hooknosed","hooked nose","aquiline nose (neutral/technical)","prominent nose"],"phonetic":"ˈhʊkˌnoʊz","extraExplanation":["“hooknose(s)”在英语里既可能是字面描述外形，但在历史上也常出现在带有反犹倾向的漫画与宣传中，用来强化对犹太人的刻板印象，因此在现实交流中非常容易被理解为侮辱。","如果你只是想中性描述鼻型，更安全的说法包括：a hooked nose / an aquiline nose（鹰钩鼻，较书面）、a prominent nose（鼻子比较突出）。"]}
{"word":"hooks","summary":{"en":"Hooks can mean curved tools for hanging/catching, or an attention-grabbing part of a song or writing; as a verb, to attach/catch or to strongly attract.","zh":"hooks 可指用于悬挂/钩住的钩子，也可指歌曲或文章里吸引注意的“抓点”；作动词可指钩住/连接，或“把人吸引住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a curved piece of metal or plastic used for hanging, pulling, catching, or fastening things","zh":"钩子；挂钩（用于悬挂、拉、钩住或固定物品的弯曲工具）"},"examples":[{"en":"Hang your coat on the hooks by the door.","zh":"把外套挂在门边的挂钩上。"},{"en":"The fisherman used a sharp hook to catch the fish.","zh":"渔夫用锋利的鱼钩来钓鱼。"}]},{"partOfSpeech":"n.","definition":{"en":"an attractive or memorable part that grabs attention (especially in songs, stories, or marketing)","zh":"吸引人的“抓点”；（歌曲/故事/广告的）记忆点、亮点"},"examples":[{"en":"That song has a great hook—you remember it after one listen.","zh":"那首歌的“抓耳段”很棒——听一遍就记住了。"},{"en":"The first sentence of the essay needs a strong hook.","zh":"作文的第一句需要一个有力的“开头抓点”。"}]},{"partOfSpeech":"v.","definition":{"en":"to catch, attach, or hang something using a hook; to fasten or link","zh":"用钩子钩住/挂住；（使）扣住；连接"},"examples":[{"en":"She hooked the keys onto her belt.","zh":"她把钥匙扣在腰带上。"},{"en":"Can you hook the trailer to the truck?","zh":"你能把拖车挂到卡车上吗？"}]},{"partOfSpeech":"v.","definition":{"en":"to interest or attract someone strongly; to “get” someone interested","zh":"吸引住；让人上瘾（对某事产生强烈兴趣）"},"examples":[{"en":"The mystery novel hooked me from the first chapter.","zh":"那本悬疑小说从第一章就把我吸引住了。"},{"en":"Once you start the show, it’s easy to get hooked.","zh":"一旦开始看那部剧，就很容易上瘾。"}]}],"synonyms":["hanger","clasp","fastener","catchy part","grab","attach","lure"],"phonetic":"/hʊk/","extraExplanation":["“hooks”是复数形式，单数是“hook”。如果你在句子里看到“hooks”，通常指“多个挂钩/钩子”，或在音乐/写作里指“多个吸引人的段落/抓点”。","在拳击里，hook 也是一种摆拳（hook punch）；在日常学习中更常见的是“挂钩/鱼钩”和“歌曲的抓耳副歌（hook）”。"]}
{"word":"hookshop","summary":{"en":"“Hookshop” is slang for a brothel, and it often sounds crude or offensive.","zh":"“hookshop”是指“妓院”的俚语表达，语气常较粗俗或带冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, often informal or offensive) A brothel; a place where people pay for sex.","zh":"（俚语，常带粗俗或冒犯意味）妓院；提供有偿性服务的场所。"},"examples":[{"en":"In the novel, the detective followed the suspect into a hookshop on the edge of town.","zh":"在小说里，侦探跟踪嫌疑人走进了城边的一家妓院。"},{"en":"That word can sound crude—many writers choose “brothel” in more formal contexts.","zh":"这个词听起来比较粗俗——在更正式的语境里，很多作者会用“brothel（妓院）”。"}]}],"synonyms":["brothel","whorehouse","bordello","house of ill repute"],"phonetic":"/ˈhʊkˌʃɑp/","extraExplanation":["“hookshop”是由“hook”（此处联想到“hooker”，意为“妓女”）+“shop”（店、场所）组成的口语/俚语表达，语气往往比较粗鄙，在日常交流中容易引起不适或冒犯。更中性、更常见的说法是“brothel”。","在文学或影视中，这个词有时用来营造“肮脏、地下、犯罪边缘”的氛围；但在真实语境中，建议谨慎使用，尤其是在公共场合或正式写作中。"]}
{"word":"hooksmith","summary":{"en":"A hooksmith is someone who makes hooks; the word is rare and is often replaced by “hook maker.”","zh":"hooksmith 指“制钩匠/做钩子的人”；该词较少见，常用 hook maker 替代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes hooks (especially metal hooks for fishing, clothing, or tools); a hook maker.","zh":"制钩匠；制作钩子的人（尤指金属钩，如鱼钩、衣钩或工具用钩）。"},"examples":[{"en":"The village hooksmith supplied hand-forged fishing hooks to local anglers.","zh":"村里的制钩匠为当地钓鱼人提供手工锻造的鱼钩。"},{"en":"In the old workshop, the hooksmith shaped steel wire into dozens of tiny hooks.","zh":"在老作坊里，制钩匠把钢丝弯制成几十个小钩。"}]}],"synonyms":["hook maker","hook-maker","craftsman","metalsmith"],"phonetic":"/ˈhʊkˌsmɪθ/","extraExplanation":["“hooksmith”是由 hook（钩子）+ smith（铁匠/工匠）构成的复合词，但在现代英语中并不常见；更常见的表达是 hook maker 或（语境更广的）blacksmith / metalsmith。","在历史或文学语境里，smith 常用于表示“专门制作某种物品的人”（如 goldsmith 金匠、wordsmith 善用词藻的人），因此 hooksmith 可以被理解为“专做钩子的工匠”。"]}
{"word":"hookswinging","summary":{"en":"“Hook swinging / hook-swinging” most often refers to a wide, swinging hook punch in combat sports, or more generally the act of swinging using a hook (rope/crane, etc.).","zh":"“hook swinging / hook-swinging”最常见指格斗中幅度较大的“摆勾式勾拳”，也可泛指用钩子（绳钩/吊钩等）进行摆动或牵引移动的动作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Boxing/MMA) Describing a hook punch thrown in a wide, swinging motion rather than a short, tight arc.","zh":"（拳击/综合格斗）指“勾拳”出拳路线更大、更像横向甩出去的“摆勾”，而不是紧凑、短弧线的勾拳。"},"examples":[{"en":"He got caught by a hook-swinging left and went down.","zh":"他被对方一个大幅度甩出的左勾拳打中，倒地了。"},{"en":"A hook-swinging style can leave your guard open.","zh":"勾拳甩得太大容易让你的防守露出空档。"}]},{"partOfSpeech":"phrase","definition":{"en":"The act of swinging from or with a hook (for example, using a hook on a rope, or a crane hook) to move or lift something.","zh":"用钩子（例如绳钩、起重机吊钩等）来摆动、牵引或移动/吊运物体的动作。"},"examples":[{"en":"The crew controlled the load to prevent dangerous hook swinging.","zh":"工人控制吊载，避免吊钩/吊物危险地摆动。"},{"en":"In the game, you can cross gaps by hook swinging on a rope.","zh":"在游戏里，你可以用绳钩摆荡来跨越缺口。"}]}],"synonyms":["swinging hook","wide hook","hook punch","swing (on a hook)","load swing"],"phonetic":"/ˈhʊk ˌswɪŋɪŋ/","extraExplanation":["“hookswinging”通常更自然的写法是分开或加连字符：hook swinging / hook-swinging。不同语境含义差别很大：格斗里多指“甩得很大的勾拳”；起重/安全语境里常指“吊钩或吊物摆动”，属于需要避免的危险现象。","如果你是在某个游戏/影视/特定圈子里看到这个词，告诉我上下文句子，我可以帮你锁定最准确的意思与更地道的表达。"]}
{"word":"hooktip","summary":{"en":"Hooktip means the pointed end of a hook, especially a fishhook.","zh":"Hooktip 指钩子的尖端，尤其是鱼钩的钩尖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the pointed end of a hook, used to catch or hold something (especially in fishing)","zh":"钩子的尖端（常指鱼钩尖），用来钩住或固定物体"},"examples":[{"en":"Be careful—the hook tip is sharp.","zh":"小心点——钩尖很锋利。"},{"en":"The fish got away because the hook tip didn’t set properly.","zh":"鱼跑了，因为钩尖没有刺牢。"}]},{"partOfSpeech":"n.","definition":{"en":"the very end of a curved, hook-shaped tool or part (for example, on a latch, hanger, or crochet hook)","zh":"钩形工具或部件的末端（例如门闩、挂钩或钩针的钩端）"},"examples":[{"en":"A small crack formed near the hook tip of the metal latch.","zh":"金属门闩的钩端附近出现了一条小裂纹。"},{"en":"The yarn slipped off the crochet hook tip.","zh":"毛线从钩针的钩端滑了下来。"}]}],"synonyms":["hook point","point","tip"],"phonetic":"/ˈhʊkˌtɪp/","extraExplanation":["“hook tip”在英语里更常写成两个词（hook tip），也会在产品说明或技术写作中写成复合词“hooktip”。常见于钓鱼（鱼钩）、缝纫/编织（钩针）以及各种带钩部件的结构说明。","在钓鱼语境里，人们也常用更具体的词：point（钩尖/尖点）、barb（倒刺）、bend（弯曲处）、shank（钩柄）。"]}
{"word":"hookum","summary":{"en":"Hookum (also spelled hokum) means nonsense or a cheesy, exaggerated trick—often used to criticize empty talk or overly sentimental entertainment.","zh":"hookum（也常拼作 hokum）指胡扯或“套路化、夸张煽情”的把戏，常用来批评空话或廉价煽情的娱乐内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"nonsense, empty talk, or something meant to fool or impress people without real value","zh":"胡扯；空话；哄人的把戏（看似唬人但没实际价值的东西）"},"examples":[{"en":"Don’t fall for that hookum—check the facts first.","zh":"别被那套胡扯骗了——先核实事实。"},{"en":"The speech was full of hookum but offered no real plan.","zh":"那篇演讲满是空话，却没有任何实际方案。"}]},{"partOfSpeech":"n.","definition":{"en":"overly emotional or exaggerated material in entertainment (especially old-fashioned comedy/drama) designed to get an easy reaction","zh":"（表演或娱乐中的）煽情套路；夸张桥段（为了轻易博取观众反应）"},"examples":[{"en":"The movie leans on a bit of hookum at the end to make you cry.","zh":"这部电影结尾用了点煽情套路来逼你落泪。"},{"en":"Some audiences love that old-time hookum.","zh":"有些观众就喜欢那种老派的夸张桥段。"}]}],"synonyms":["hokum","nonsense","baloney","rubbish","bunk","claptrap"],"phonetic":"/ˈhoʊkəm/","extraExplanation":["“hookum”更常见的拼写是“hokum”。它常带有批评语气，表示“用套路糊弄人”的东西，而不只是普通的“玩笑”。","这个词常与旧式舞台表演（如杂耍/滑稽戏 vaudeville）联系在一起：用夸张、煽情或陈词滥调来快速带动观众情绪。"]}
{"word":"hookup","summary":{"en":"Hookup most often means a casual sexual encounter, but it can also mean a practical connection (internet/water/power) or a helpful contact; as a verb, it means to connect or introduce.","zh":"hookup最常指“随意性关系/一夜情式的性接触”，也可指“（网络/水电等）连接、接通”或“门路、人脉”；作动词可表示“连接/安装”或“牵线介绍”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a casual sexual encounter, usually without a committed relationship","zh":"（通常不带承诺的）随意性关系；一夜情式的性接触"},"examples":[{"en":"They met at a party and had a hookup, but they didn’t start dating.","zh":"他们在派对上认识并发生了随意的性关系，但并没有开始交往。"},{"en":"In some college settings, people use “hookup” to mean anything from kissing to sex.","zh":"在一些大学语境里，“hookup”可能指从接吻到发生性行为的各种亲密行为。"}]},{"partOfSpeech":"n.","definition":{"en":"an arrangement or connection that makes something work (often for phones, internet, electricity, or equipment)","zh":"（使设备/服务可用的）连接；接通；安装；对接"},"examples":[{"en":"We need an internet hookup in the new apartment.","zh":"新公寓需要安装/接通网络。"},{"en":"The trailer has a water and power hookup.","zh":"这辆拖车有水电接口/连接。"}]},{"partOfSpeech":"n.","definition":{"en":"a helpful contact or opportunity, often gained through someone you know","zh":"（通过人脉得到的）门路；关系；机会"},"examples":[{"en":"She got tickets through a hookup at the venue.","zh":"她通过在场馆的关系弄到了票。"},{"en":"Do you have a hookup for a good mechanic?","zh":"你有靠谱修车师傅的门路吗？"}]},{"partOfSpeech":"v.","definition":{"en":"to connect or set up something (or sometimes people) so it works or meets","zh":"连接；安装；给……牵线；让……约见"},"examples":[{"en":"Can you hook up the printer to my laptop?","zh":"你能把打印机连接到我的笔记本电脑上吗？"},{"en":"A friend tried to hook me up with her coworker.","zh":"朋友想把我介绍给她的同事认识。"}]}],"synonyms":["connection","setup","link","casual encounter","one-night stand","contact"],"phonetic":"/ˈhʊkˌʌp/","extraExplanation":["“hookup/hook up”在口语里很常见，但含义非常依赖语境：在社交/恋爱话题中往往偏“随意性关系”，在生活场景里则更常指“接通/连接（网络、水电、设备）”。如果担心误会，可以用更明确的说法：casual sex（随意性行为）、make out（亲热/接吻）、connect/set up（连接/安装）。","文化提示：在美国校园语境中，“hookup culture（勾搭文化/随意约会文化）”是一个常见讨论话题；有时“hookup”故意含糊，避免直接描述亲密行为细节。","相关常见搭配：hookup app（交友/约会软件）、internet hookup（网络接通）、a hookup for…（……方面的门路）、hook someone up（给某人牵线/帮某人搞到资源）。"]}
{"word":"hookups","summary":{"en":"“Hookups” can mean casual sexual encounters (slang), informal connections/opportunities, or physical service/equipment connections.","zh":"“hookups”可指（俚语）随意的性关系，也可指（口语）人脉门路/机会，或指设备与管线等的接口连接。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Casual sexual encounters, usually without a committed relationship (slang).","zh":"（俚语）临时的性关系/随意的“约炮”，通常不带承诺或正式交往。"},"examples":[{"en":"In college, some people prefer hookups instead of dating.","zh":"在大学里，有些人更喜欢随意的 hookups，而不是正式约会。"},{"en":"She said she wasn’t looking for hookups—she wanted a serious relationship.","zh":"她说她不想要随便的 hookups——她想要一段认真的关系。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal help, a special connection, or an arranged opportunity (often: “a hookup”); plural: hookups.","zh":"（非正式）帮忙、门路、人脉带来的机会/安排（常说“a hookup”；复数 hookups）。"},"examples":[{"en":"Do you have any hookups for cheaper concert tickets?","zh":"你有没有什么门路能买到更便宜的演唱会票？"},{"en":"He got the interview through family hookups.","zh":"他通过家里的人脉关系拿到了面试机会。"}]},{"partOfSpeech":"n.","definition":{"en":"Connections or the act of connecting equipment/services (e.g., cables, plumbing, internet).","zh":"（连接）设备/管线/服务的接驳与连接（如电缆、管道、网络）。"},"examples":[{"en":"The apartment includes washer and dryer hookups.","zh":"这套公寓带洗衣机和烘干机的接口。"},{"en":"We need the cable hookups installed before Friday.","zh":"我们得在周五前把有线电视接口装好。"}]}],"synonyms":["casual encounter(s)","one-night stand(s)","fling(s)","connection(s)","contact(s)","setup(s)","link(s)"],"phonetic":"/ˈhʊkˌʌps/","extraExplanation":["“hookup(s)”在表示“随意性关系”时是较口语、带社交平台/校园文化色彩的说法。正式场合可用“casual sexual encounter(s)”来表达。","在表示“人脉/门路”时，“a hookup”通常指能帮你搞定事情的人或渠道，语气偏口语；有时也可能暗示“走关系/不太公开的方式”，需注意语境。"]}
{"word":"hookupu","summary":{"en":"Hookup can mean a casual sexual encounter (slang), a helpful connection/arrangement, or a physical connection; hook up means to connect or to meet romantically/sexually.","zh":"Hookup 可指（俚语）随意性关系/约炮，也可指人脉帮忙或事物连接；hook up 表示连接/安装，或（口语）发展暧昧或性关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a casual sexual encounter, usually without a committed relationship (informal/slang)","zh":"（非正式/俚语）“约炮/随意性关系”，通常不带正式承诺或稳定关系"},"examples":[{"en":"They met at a party and had a hookup.","zh":"他们在派对上认识，然后发生了随意性关系。"},{"en":"Some people use dating apps just for hookups.","zh":"有些人用交友软件只是为了约炮。"}]},{"partOfSpeech":"n.","definition":{"en":"a connection or the act of connecting people or things; also an arrangement to meet or get help (informal)","zh":"连接；把人或事物联系起来；（非正式）帮忙牵线或安排见面/资源"},"examples":[{"en":"The internet hookup in my apartment is unstable.","zh":"我公寓的网络接口不太稳定。"},{"en":"Can you give me a hookup for cheap concert tickets?","zh":"你能不能帮我搞到便宜的演唱会票？"}]},{"partOfSpeech":"phrase","definition":{"en":"to connect or attach something; or to meet and start a romantic/sexual relationship (informal)","zh":"连接/安装；（非正式）见面并发展暧昧或性关系"},"examples":[{"en":"Can you hook up the printer to my laptop?","zh":"你能把打印机连接到我的笔记本电脑吗？"},{"en":"They hooked up after talking for a few weeks.","zh":"他们聊了几个星期后就开始约会/发生关系了。"}]}],"synonyms":["casual encounter","one-night stand","connection","link","connect"],"phonetic":"/ˈhʊkˌʌp/","extraExplanation":["你输入的“hookupu”更常见的拼写是 **hookup**（名词）或 **hook up**（动词短语）。","在口语里，**hookup** 的“性关系”含义很常见，但具体边界因人而异：有人指“接吻/亲密行为”，也有人明确指“发生性行为”。如果在正式场合或需要更委婉，可以用：**casual encounter**（随意邂逅/关系）、**one-night stand**（一夜情，含义更明确）、或直接描述行为。","文化语境上，这个词在美式英语中偏口语、偏私人话题；使用时注意场合与对象，避免冒犯。"]}
{"word":"hookweed","summary":{"en":"Hookweed is a sticky wild plant with hook-like hairs that cling to clothes or fur, often referring to cleavers (goosegrass).","zh":"Hookweed 指一种带倒钩细毛、会粘衣物或动物毛的黏人野草，常指猪殃殃/拉拉藤（cleavers、goosegrass）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sticky wild plant (often cleavers, also called goosegrass) with tiny hook-like hairs that cling to clothes, animal fur, or other plants.","zh":"一种黏人的野草（常指“猪殃殃/拉拉藤”cleavers，也叫 goosegrass），茎叶上有细小倒钩状毛，会粘在衣物、动物毛或其他植物上。"},"examples":[{"en":"After the hike, my socks were covered in hookweed.","zh":"徒步回来后，我的袜子上粘满了 hookweed。"},{"en":"The dog ran through the field and came back with hookweed stuck in its fur.","zh":"狗跑过田野回来时，毛上粘着很多 hookweed。"},{"en":"Farmers try to control hookweed because it competes with young crops.","zh":"农民会设法控制 hookweed，因为它会和幼苗争抢养分与空间。"}]}],"synonyms":["cleavers","goosegrass","stickyweed","catchweed","bedstraw"],"phonetic":"/ˈhʊkˌwid/","extraExplanation":["在北美与英式英语里，hookweed 常被当作“俗名/地方名”来用，具体指哪一种草会随地区而变；最常见的对应是 cleavers（学名 Galium aparine），也常叫 stickyweed、catchweed、goosegrass。","这类植物之所以“黏人”，主要靠茎叶表面的倒钩状细毛（像小钩子一样），因此容易挂在衣服、鞋带、袜子、宠物毛上。","在日常语境中，它通常出现在户外活动、宠物清理、园艺除草等话题里；并不是非常正式或常用的标准词。"]}
{"word":"hookwise","summary":{"en":"Hookwise means “in a hook-like way” or “hook-shaped,” and it’s rare in everyday English.","zh":"hookwise 指“呈钩状地/像钩子一样（的）”，在日常英语中比较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hook-like way; shaped or bent like a hook.","zh":"呈钩状地；像钩子一样弯曲（的）。"},"examples":[{"en":"The tip of the branch curled hookwise, catching on my jacket.","zh":"树枝的尖端弯成钩状，勾住了我的外套。"},{"en":"The metal rod was bent hookwise at one end for lifting the lid.","zh":"金属杆的一端被弯成钩状，用来掀起盖子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Having a hook-like form; hooked.","zh":"（罕见/较技术性）具有钩状形态的；带钩的。"},"examples":[{"en":"Some birds have hookwise claws that help them grip branches.","zh":"有些鸟的爪子呈钩状，帮助它们抓牢树枝。"}]}],"synonyms":["hook-shaped","hooked","curved like a hook"],"phonetic":"/ˈhʊkˌwaɪz/","extraExplanation":["“hookwise”是一个比较少见的词，多见于较老的描写性文字、技术描述或纹章/图案说明中。日常英语里更常用“hook-shaped / hooked / in a hook shape”等表达。","后缀“-wise”在这里表示“以……方式/呈……形状”，类似的有“clockwise（顺时针）”“lengthwise（纵向地）”。不过把“-wise”接到名词后造新词在现代口语里不一定自然，因此“hookwise”显得偏书面或小众。"]}
{"word":"hookworm","summary":{"en":"A hookworm is a parasitic worm that infects the intestines and can cause anemia.","zh":"hookworm 指寄生在肠道内吸血、可引发贫血的钩虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small parasitic roundworm that can live in a person’s intestines and feed on blood, often causing anemia and weakness","zh":"钩虫；一种寄生线虫，生活在人体肠道内吸血，常导致贫血与乏力"},"examples":[{"en":"Hookworm infection can cause tiredness and pale skin because of blood loss.","zh":"钩虫感染会因失血导致疲倦和皮肤苍白。"},{"en":"Wearing shoes can help prevent hookworm in areas where the parasite is common.","zh":"在钩虫流行地区，穿鞋有助于预防感染。"},{"en":"The doctor ordered a stool test to check for hookworm eggs.","zh":"医生安排了粪便检查来检测钩虫卵。"}]}],"synonyms":["parasitic worm","intestinal parasite","nematode"],"phonetic":"/ˈhʊkˌwɝm/","extraExplanation":["钩虫主要通过接触被虫卵/幼虫污染的土壤传播，幼虫可从皮肤（常见于赤脚的脚底）钻入人体；因此“卫生设施、穿鞋、驱虫治疗”是常见的公共卫生关键词。","在英语里常见表达有 hookworm infection（钩虫感染）、hookworm disease（钩虫病）、hookworm larvae（钩虫幼虫）。文学与历史语境中，hookworm 常与贫困地区的公共卫生问题联系在一起（例如美国南部早期公共卫生运动）。"]}
{"word":"hookworm-related","summary":{"en":"associated with or caused by hookworm infection","zh":"与钩虫感染有关或由其引起"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, caused by, or involving hookworm infection.","zh":"与钩虫感染有关的；由钩虫引起的；涉及钩虫的。"},"examples":[{"en":"The clinic focused on preventing hookworm-related anemia in children.","zh":"这家诊所重点预防儿童的钩虫相关性贫血。"},{"en":"Doctors treated her for hookworm-related stomach pain and fatigue.","zh":"医生为她治疗钩虫相关的胃痛和乏力。"},{"en":"Improved sanitation reduced hookworm-related illness in the community.","zh":"改善卫生条件降低了社区的钩虫相关疾病。"}]}],"synonyms":["hookworm-associated","hookworm-linked","hookworm-connected","due to hookworm","associated with hookworm"],"phonetic":"/ˈhʊkˌwɝm rɪˈleɪtɪd/","extraExplanation":["写作上常见两种形式：hookworm-related（加连字符，多用于名词前作定语，如 hookworm-related anemia）与 hookworm related（不加连字符，多用于表语位置，如 The symptoms are hookworm related）。在正式医学写作里，作定语时加连字符更常见。"],"etymology":"由“hookworm（钩虫）+ related（相关的）”构成的复合形容词，常见于医学与公共卫生语境，用来说明“与钩虫有关/由其导致”。","mnemonic":["拆开记：hookworm = 钩虫；related = 相关的。合起来就是“钩虫相关的”。","把 related 联想成“relate（关联）+ -ed（…的）”，即“被关联到钩虫上”。"]}
{"word":"hookwormer","summary":{"en":"A hookwormer is a medicine used to treat hookworm infection, especially in pets and livestock.","zh":"hookwormer 指治疗钩虫感染的药物，尤常用于宠物和家畜的驱虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine (dewormer) used to kill hookworms in humans or animals.","zh":"（驱虫药）用于杀灭人或动物体内钩虫的药物。"},"examples":[{"en":"The vet prescribed a hookwormer for the puppy.","zh":"兽医给小狗开了钩虫驱虫药。"},{"en":"After the stool test, the doctor recommended a hookwormer.","zh":"粪便检查后，医生建议使用钩虫驱虫药。"}]}],"synonyms":["dewormer","anthelmintic","worm medicine"],"phonetic":"/ˈhʊkˌwɝːmɚ/","extraExplanation":["“hookwormer”更常见于兽医或宠物护理语境；在人类医学中更常说“anthelmintic (drug)”（驱虫药）或直接说“treatment for hookworm”。","钩虫（hookworm）主要寄生在小肠，可能导致贫血、乏力等症状；是否需要用药及用什么药应由医生/兽医决定。"]}
{"word":"hookworms","summary":{"en":"Hookworms are parasitic worms that live in the intestines and can cause illness, especially anemia.","zh":"钩虫是寄生在肠道内的寄生虫，会引起疾病，尤其容易导致贫血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small parasitic worm that lives in the intestines of humans or animals and can cause disease (especially anemia) by feeding on blood","zh":"钩虫；一种寄生在人体或动物肠道内的小型寄生虫，会吸血并可能引起疾病（尤其是贫血）"},"examples":[{"en":"Hookworms can enter the body through bare feet on contaminated soil.","zh":"钩虫可能通过赤脚接触被污染的土壤而进入人体。"},{"en":"The doctor tested her stool sample for parasites such as hookworms.","zh":"医生检测了她的粪便样本，查看是否有钩虫等寄生虫。"},{"en":"In some tropical areas, hookworms are a common health problem.","zh":"在一些热带地区，钩虫是常见的健康问题。"}]}],"synonyms":["hookworm (singular)","intestinal parasite","parasitic worm"],"phonetic":"/ˈhʊkˌwɝmz/","extraExplanation":["“hookworm”之所以叫“钩虫”，是因为它的口器像“钩子/牙齿”一样能附着在肠壁上吸血。","常见感染途径是幼虫从皮肤（尤其脚底）钻入体内，所以在高风险地区穿鞋、改善卫生和粪便处理很重要。","在公共卫生语境中，hookworm 常与“soil-transmitted helminths（经土传播的蠕虫）”一起出现；相关防治措施包括驱虫药（deworming）、清洁用水和卫生设施。"]}
{"word":"hookwormy","summary":{"en":"Hookwormy means “related to hookworms,” often informally describing symptoms or an appearance that suggests hookworm infection or a hookworm-like look.","zh":"Hookwormy 指“与钩虫有关的”，口语中常用来形容像钩虫感染那样的症状或呈现出钩虫般的外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Related to hookworms, or suggesting an infection with hookworms (often describing symptoms like weakness or anemia).","zh":"（非正式）与钩虫有关的；或让人联想到钩虫感染的（常用来描述乏力、贫血等症状）。"},"examples":[{"en":"After weeks of stomach trouble, he said he felt “hookwormy” and went to see a doctor.","zh":"肚子不舒服了好几周后，他说自己感觉“像得了钩虫一样”，于是去看医生。"},{"en":"The clinic tested children who looked pale and hookwormy.","zh":"诊所给那些看起来脸色苍白、像感染钩虫的孩子做了检测。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling a hookworm in appearance (thin, wormlike, and slightly “hooked” in shape).","zh":"外形像钩虫的（细长、虫状，略带“弯钩”形）。"},"examples":[{"en":"Under the microscope, the tiny creature looked a bit hookwormy.","zh":"在显微镜下，这个小生物看起来有点像钩虫。"}]}],"synonyms":["hookworm-related","wormy","parasitic-looking","anemic-looking (context-dependent)"],"phonetic":"/ˈhʊkˌwɝːmi/","extraExplanation":["“hookwormy”并不是非常常见的标准词，更像是口语/写作中的临时形容词：在“hookworm（钩虫）+ -y”里，-y 常表示“有……的特征/带有……感觉”（如 rainy, oily）。","钩虫感染在英语语境里常与“贫血、乏力、营养不良”相关联（因为钩虫会吸血），所以有人会用 hookwormy 来形容“看起来/感觉像感染了钩虫一样”。","医学或正式文本通常会用更标准的表达：hookworm infection（钩虫感染）、hookworm-related anemia（钩虫相关性贫血）、infested with hookworms（感染/寄生钩虫）。"]}
{"word":"hooky","summary":{"en":"Hooky is an informal word for skipping school or work without permission, often used in the phrase “play hooky.”","zh":"hooky 是非正式用语，指未经允许逃学或旷工，常见于短语“play hooky（逃学/旷工）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Time taken off from school or work without permission; truancy.","zh":"（非正式）未经允许从学校或工作中溜走的时间；逃学；旷工。"},"examples":[{"en":"He played hooky from school and went to the arcade.","zh":"他从学校逃学，跑去游戏厅了。"},{"en":"I can’t afford to play hooky today—there’s an important meeting.","zh":"我今天可不能旷工——有个重要会议。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To miss school or work without permission; to skip.","zh":"（非正式）未经允许不上学或不上班；逃学；旷工。"},"examples":[{"en":"Some students try to hooky when exams are over.","zh":"有些学生在考试结束后会想逃课。"},{"en":"Don’t hooky from work—you could get in trouble.","zh":"别旷工——你可能会惹上麻烦。"}]}],"synonyms":["skip","cut class","truancy","be absent without permission"],"phonetic":"/ˈhʊki/","extraExplanation":["“play hooky”是最常见的固定搭配，意思是“逃学/旷工”。语气偏口语、带点俏皮或轻描淡写，但在正式场合最好用更中性的说法，如“be absent without permission / skip class / take an unauthorized day off”。","词源不太确定：有观点认为与早期英语中表示“藏起来/躲起来”的说法有关，因此带有“偷偷溜走”的感觉。"]}
{"word":"hool","summary":{"en":"“Hool” is a Scottish informal word meaning “a fool; a silly person.”","zh":"“hool”是苏格兰口语词，意思是“傻瓜；做事很笨/很蠢的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) A fool; a silly or clumsy person.","zh":"（苏格兰英语，非正式）傻瓜；笨拙或做事不靠谱的人。"},"examples":[{"en":"Don’t be a hool—look where you’re going.","zh":"别犯傻——走路看着点。"},{"en":"He felt like a hool after forgetting the meeting time.","zh":"他把开会时间忘了，觉得自己像个傻瓜。"}]}],"synonyms":["fool","idiot","dummy","silly person"],"phonetic":"/hul/","extraExplanation":["“hool”主要见于苏格兰口语/方言，有点像英语里的“fool / idiot（傻瓜）”，语气多为调侃或轻微责备，正式场合一般不用。","不要和“hooligan（流氓、足球流氓）”混淆；两者长得像，但“hool”更偏“傻、笨、粗心”的意思。"]}
{"word":"hoolakin","summary":{"en":"“Hoolakin” is not a standard English word; it is most likely a misspelling of “hooligan,” meaning a violent or destructive troublemaker.","zh":"“hoolakin”不是标准英文词，最可能是“hooligan”的拼写错误，意思是做出暴力或破坏行为的闹事者/流氓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often a young person) who behaves violently or destructively, especially in a public place or in a group.","zh":"（常指年轻人）在公共场所或结伙做出暴力、破坏行为的流氓；闹事者。"},"examples":[{"en":"The police arrested several hooligans after the match.","zh":"比赛结束后，警方逮捕了几名闹事者。"},{"en":"The park was damaged by a group of hooligans.","zh":"公园被一群流氓破坏了。"}]}],"synonyms":["troublemaker","thug","delinquent","rowdy"],"phonetic":"/ˈhuːlɪɡən/","extraExplanation":["“hoolakin”不是常见的英文单词，最可能是把“hooligan”（流氓；闹事者）拼错了。","“hooligan”常用于新闻或正式语境，尤其指体育赛事后闹事的群体（如“football hooligans”）。日常口语里也可用“troublemaker”（爱惹事的人）来替换，语气更中性。"]}
{"word":"hoolaulea","summary":{"en":"Hō‘olaule‘a means a Hawaiian-style celebration or festive party.","zh":"Hō‘olaule‘a 指夏威夷风格的庆典或热闹聚会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hawaiian loanword) A celebration, party, or festive gathering, often with food, music, and dancing.","zh":"（夏威夷语外来词）庆典、派对、欢乐的聚会，常伴随美食、音乐与舞蹈。"},"examples":[{"en":"Our school held a hō‘olaule‘a with Hawaiian music and local food.","zh":"我们学校办了一场 hō‘olaule‘a，有夏威夷音乐和当地美食。"},{"en":"The community center hosts a hō‘olaule‘a every summer to bring neighbors together.","zh":"社区中心每年夏天都会举办 hō‘olaule‘a，把邻里聚在一起。"}]}],"synonyms":["celebration","festival","party","gathering","festivity"],"phonetic":"/ˌhoʊ.oʊˌlaʊˈleɪ.ə/","extraExplanation":["你输入的拼写“hoolaulea”常见于不带夏威夷语变音符号的写法；更标准的拼法通常是 **hō‘olaule‘a**（含长音符号和 ‘okina 断音符）。","在夏威夷文化语境中，**hō‘olaule‘a** 不只是“派对”，更强调“热闹的集体庆祝”，常见于学校、教会、社区或节庆活动，有时会包含呼啦舞（hula）、现场乐队、手工艺摊位等。"]}
{"word":"hoolee","summary":{"en":"“Hoolee” is usually a meme-style spelling of “holy,” used to show surprise; it’s not standard English.","zh":"“hoolee”多为“holy”的梗式/拟音拼写，用来表达惊讶；并非标准英语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An informal, playful phonetic spelling of “holy,” often used online to imitate pronunciation (especially in memes like “hoolee sh*t”), expressing strong surprise or shock.","zh":"“holy（天啊/我的天）”的非正式、搞笑式拼写，常见于网络用语（如表情包里的“hoolee sh*t”），用来表达强烈惊讶或震惊。"},"examples":[{"en":"Hoolee—did you see that goal?","zh":"天啊——你看到那个进球了吗？"},{"en":"“Hoolee sh*t” is a meme-y way to say “Holy sh*t.”","zh":"“hoolee sh*t”是用梗的方式写“holy sh*t（卧槽/我天）”。"}]},{"partOfSpeech":"other","definition":{"en":"A common misspelling of “holy” in casual typing.","zh":"“holy”的常见随意拼写错误。"},"examples":[{"en":"I think you meant “holy,” not “hoolee.”","zh":"我猜你想写的是“holy”，不是“hoolee”。"}]}],"synonyms":["holy (standard spelling)","wow","oh my gosh","goodness"],"phonetic":"/ˈhoʊli/","extraExplanation":["“hoolee”通常不是标准英语单词，更像是网络上的拟音/戏仿拼写：用夸张拼法来表达语气（震惊、兴奋），或模仿某些口音的发音效果。","正式写作或考试中建议用标准拼写“holy”；如果只是想表达惊讶，更中性的说法有“Wow!”“Oh my gosh!”"]}
{"word":"hooley","summary":{"en":"A hooley is a lively Irish-style party or celebration, often with music and dancing.","zh":"hooley 指一种爱尔兰式的热闹聚会或庆祝活动，常伴随音乐与舞蹈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Irish English) A lively party, celebration, or social gathering, often with music and dancing.","zh":"（爱尔兰英语）热闹的聚会、庆祝活动（常有音乐和跳舞）。"},"examples":[{"en":"We’re having a hooley after the wedding—there’ll be music and plenty of dancing.","zh":"婚礼后我们要办一场热闹的聚会——会有音乐，也会跳很多舞。"},{"en":"The pub turned into a real hooley once the band started playing.","zh":"乐队一开始演奏，酒吧就变成了一场真正的狂欢。"},{"en":"They threw a hooley to celebrate finishing exams.","zh":"他们办了个热闹的庆祝派对来庆祝考完试。"}]}],"synonyms":["party","celebration","bash","shindig","knee-up"],"phonetic":"ˈhuːli","extraExplanation":["“hooley”也常拼作“hoolie”。这个词在爱尔兰和苏格兰等地更常见，在美国英语里不算常用；如果你在普通美式语境中表达，一般用“party / celebration / bash”。","它常带有“民谣乐队、酒吧、舞蹈、朋友聚会”的文化氛围，比中性的“party”更强调热闹与欢乐。"]}
{"word":"hoolie","summary":{"en":"Hoolie means a very strong wind or storm, used mainly in Scotland and Northern England.","zh":"hoolie 指狂风或大风暴，主要用于苏格兰及英格兰北部的英语中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very strong wind or storm (especially in Scotland and Northern England); a gale","zh":"（尤指苏格兰和英格兰北部）狂风；大风暴"},"examples":[{"en":"We had a real hoolie last night—trees were bending in the wind.","zh":"昨晚刮了一场真正的狂风——树都被吹弯了。"},{"en":"The ferry was cancelled because a hoolie was coming in from the sea.","zh":"因为海上有狂风暴来袭，渡轮停航了。"}]}],"synonyms":["gale","storm","high winds","blow"],"phonetic":"/ˈhuːli/","extraExplanation":["“hoolie”（也常拼作“huly/hooley”）是带有明显地域色彩的词，日常英语里更常说“gale”“storm”“strong winds”。在英伦地区的口语或文学描写中，用“a hoolie”会有一种更生动、更在地的感觉。","词源常被认为与苏格兰语有关，可能与表示“嚎叫/呼啸”的声音意象相关，用来形容风声很贴切。"]}
{"word":"hooligan","summary":{"en":"A hooligan is a violent troublemaker, often in a group, especially around sports events.","zh":"hooligan 指（常结伙的）暴力滋事者，尤其常见于体育赛事周边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A violent or lawless person, especially someone in a group who causes trouble in public (often linked to sports crowds).","zh":"（尤指结伙的）流氓、滋事者；（常指与体育赛事相关的）闹事者。"},"examples":[{"en":"The police arrested several hooligans after the match.","zh":"比赛结束后，警方逮捕了几名闹事者。"},{"en":"The city increased security to prevent hooligan violence.","zh":"这座城市加强了安保以防止流氓暴力事件。"}]}],"synonyms":["thug","lout","troublemaker","rowdy","delinquent"],"phonetic":"/ˈhuːlɪɡən/","extraExplanation":["“hooligan”常与“football hooligan（足球流氓）”搭配，指在公共场所（尤其比赛前后）聚众斗殴、破坏秩序的人。在正式新闻中较常见；日常口语里也可用“thug（暴徒）”“troublemaker（惹事的人）”等替代，但语气和侧重点不同。","词源上一般认为与19世纪末伦敦的一个爱惹事的团伙或人物绰号有关（常被写作“Hooligan”），后来泛指闹事者。"]}
{"word":"hooliganish","summary":{"en":"“Hooliganish” means somewhat like a hooligan—rowdy, disruptive, and rough in behavior.","zh":"“hooliganish”表示“有点像流氓/闹事者”，形容吵闹、捣乱、粗野的行为（多为非正式、带调侃）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hooligan; rowdy, disruptive, and behaving in a rough or antisocial way (often used humorously or informally).","zh":"像流氓/足球流氓一样的；吵闹、捣乱、带点粗野或反社会行为的（常为幽默或非正式用法）。"},"examples":[{"en":"The crowd got a bit hooliganish after the game, shouting and pushing in the street.","zh":"比赛后人群有点“流氓式”起来，在街上大喊大叫还推搡。"},{"en":"It was just some hooliganish joking—nothing truly dangerous.","zh":"那只是些有点“痞气”的玩笑——并不真的危险。"}]}],"synonyms":["rowdy","loutish","thuggish","unruly","boorish"],"phonetic":"/ˈhuːlɪɡənɪʃ/","extraExplanation":["“hooliganish”通常写作“hooligan-ish”，在口语或非正式写作中比较常见；意思是“有点像……/带点……风格”。后缀“-ish”常用来表示“有点、稍微、近似”（如 childish=孩子气的，greenish=略带绿色的）。","“hooligan”在英式英语中常与体育赛事相关的闹事者（如足球流氓）联系更紧；在美式英语里也可泛指粗鲁捣乱的人。用“hooliganish”时语气往往比直接说“violent”更轻，可能带调侃或弱化的意味。"]}
{"word":"hooliganism","summary":{"en":"Hooliganism means violent, disorderly, or destructive behavior, often by groups (commonly used for unruly sports fans).","zh":"hooliganism 指（常为群体的）暴力、滋事或破坏性行为，常用于描述体育赛事中闹事的球迷等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"violent or destructive behavior (especially by a group), often linked to unruly fans at sports events or to street disorder.","zh":"（常指群体的）流氓行为；暴力或破坏性行为（尤指体育赛事中闹事的球迷或街头滋事）。"},"examples":[{"en":"Police increased patrols to prevent hooliganism after the match.","zh":"警方在比赛后加强巡逻，以防止球迷流氓行为。"},{"en":"The city introduced stricter penalties for hooliganism in public places.","zh":"该市对公共场所的流氓滋事行为实施了更严厉的处罚。"}]}],"synonyms":["violence","disorder","vandalism","rowdy behavior","riotous behavior"],"phonetic":"/ˈhuːlɪɡənɪzəm/","extraExplanation":["“hooliganism”常见于英式英语语境，尤其和足球文化相关：一些球迷团体在比赛前后打架、砸东西、辱骂他人等，会被媒体称为“football hooliganism”。","词根来自“hooligan”（流氓、滋事者）；后缀“-ism”表示“某种行为/倾向/主义”，因此 hooliganism 强调的是“这种行为现象”，而不仅是某一个人。","使用上带明显负面评价，通常用于新闻、法律、社会治理等正式语境；日常口语里也可用更普通的说法，如 “violent behavior / disorder / vandalism”。"]}
{"word":"hooliganize","summary":{"en":"Hooliganize means to make someone act like a hooligan—or, more rarely, to act that way yourself.","zh":"Hooliganize 指“使某人/某群体流氓化、变得粗暴闹事”；较少见时也可指“自己像流氓一样闹事”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or a group behave like hooligans; to encourage or turn something into rowdy, violent, or disruptive behavior (often used critically).","zh":"使（某人/群体）变得像流氓一样；使（某事）变得粗暴、暴力或具有破坏性（多用于批评语境）。"},"examples":[{"en":"Some critics say the coach’s aggressive talk can hooliganize young fans.","zh":"一些批评者说，教练的激进言论可能会把年轻球迷带成“流氓式”行为。"},{"en":"Online hate campaigns can hooliganize a community by normalizing harassment.","zh":"网络仇恨行动可能通过把骚扰“正常化”来使一个社群流氓化。"}]},{"partOfSpeech":"vi.","definition":{"en":"to behave like a hooligan; to act in a rowdy or violent way (rare).","zh":"像流氓一样行事；粗暴闹事（较少见）。"},"examples":[{"en":"After the match, a few people began to hooliganize in the streets.","zh":"比赛后，有几个人开始在街上闹事。"}]}],"synonyms":["brutalize","incite","agitate","provoke","radicalize","encourage violence","stir up trouble"],"phonetic":"/ˈhuːlɪɡənaɪz/","extraExplanation":["“hooligan”常指在体育赛事（尤其足球）相关场景中闹事、打架、破坏秩序的人；词尾“-ize”常表示“使……化/使成为……”，所以“hooliganize”多用于批评某种言行把人群带向更粗暴、更失序的方向。","这个词不算常用，更常见的替代表达有：“encourage violence / promote disorder / radicalize（使激进化，语义不完全相同）”。"]}
{"word":"hooligans","summary":{"en":"“Hooligans” means violent or disruptive troublemakers, often in groups, especially linked to sports events.","zh":"“hooligans”指暴力或扰乱秩序的滋事者/流氓，常成群出现，尤其常与体育赛事相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (often in a group) who behave violently or cause trouble in public, especially around sports events.","zh":"（常指成群的）流氓、滋事者；尤指在体育赛事周边闹事、打架的人。"},"examples":[{"en":"Police were deployed to prevent hooligans from starting fights after the match.","zh":"警方部署警力，防止流氓在比赛后挑起斗殴。"},{"en":"The stadium banned known hooligans from entering.","zh":"体育场禁止已知的滋事者入场。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who acts in a rude, aggressive, or destructive way (not necessarily related to sports).","zh":"行为粗鲁、好斗或破坏性强的人；不一定与体育有关。"},"examples":[{"en":"A group of hooligans damaged the park benches overnight.","zh":"一群滋事者在夜里破坏了公园长椅。"},{"en":"Don’t act like a hooligan—be respectful in public.","zh":"别像个流氓一样——在公共场合要有礼貌。"}]}],"synonyms":["thugs","troublemakers","rowdies","vandals"],"phonetic":"/ˈhuːlɪɡənz/","extraExplanation":["“hooligan(s)”常带强烈贬义，语气比“troublemakers（捣乱者）”更重，暗含暴力或破坏。正式新闻里常见；日常口语也用，但要注意别随意给人贴标签。","词源上一般认为与19世纪伦敦一个爱闹事的团伙/姓氏有关（常见说法为Hooligan），后来泛指公共场所的暴力滋事者。","相关搭配：football hooligans（足球流氓）、hooliganism（n. 流氓行为/滋事行为）。更中性的替代：rowdy fans（吵闹的球迷）、misbehaving people（行为不当的人）。"]}
{"word":"hoolihan","summary":{"en":"“Hoolihan” is usually a misspelling of **hooligan**: a troublemaker who behaves violently or noisily in public.","zh":"“hoolihan”通常是 **hooligan** 的误拼：指在公共场合吵闹、粗暴甚至暴力、制造麻烦的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of) **hooligan**: a person who behaves violently or noisily in public, often causing trouble or damage.","zh":"（很可能是 **hooligan** 的拼写错误）指“流氓；闹事者”：在公共场合吵闹、粗暴甚至动用暴力、制造麻烦或破坏的人。"},"examples":[{"en":"The police arrested several hooligans after the match.","zh":"比赛结束后，警方逮捕了几名闹事者。"},{"en":"A group of hooligans damaged the bus stop late at night.","zh":"深夜一群流氓破坏了公交车站。"}]}],"synonyms":["troublemaker","thug","bully","rowdy","lout"],"phonetic":"/ˈhuːlɪɡən/","extraExplanation":["“Hoolihan”在现代英语里不常作为常用词出现，很多情况下是把 **hooligan** 拼错了。**Hooligan** 常见于体育比赛（尤其足球）语境，表示在场外打架、砸东西、扰乱秩序的“球迷流氓/闹事者”。","如果你看到 “Hoolihan” 出现在人名或姓氏（例如某些爱尔兰姓氏的变体）里，那就不是“流氓”的意思，而是专有名词；需要结合上下文判断。"]}
{"word":"hoolock","summary":{"en":"A hoolock is a gibbon (small ape), especially a hoolock gibbon in the genus Hoolock.","zh":"hoolock 指一种长臂猿，尤指白眉长臂猿属（Hoolock）的长臂猿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of gibbon (small ape) from South and Southeast Asia; specifically, a gibbon in the genus Hoolock.","zh":"一种长臂猿（小型类人猿），分布于南亚与东南亚；特指“白眉长臂猿属（Hoolock）”的长臂猿。"},"examples":[{"en":"The hoolock is known for loud, far-carrying calls in the forest.","zh":"白眉长臂猿以在森林里响亮、传得很远的鸣叫而闻名。"},{"en":"Researchers study hoolock gibbons to understand how habitat loss affects primates.","zh":"研究人员通过研究白眉长臂猿来了解栖息地丧失如何影响灵长类动物。"}]}],"synonyms":["hoolock gibbon","gibbon"],"phonetic":"/ˈhuːlɑk/","extraExplanation":["“hoolock”常见于动物学/自然纪录片语境，完整说法常为“hoolock gibbon（白眉长臂猿）”。其名称来自当地语言的转写。","白眉长臂猿主要分布在印度东北部、孟加拉国和缅甸等地，常被用作森林生态与保育议题的代表物种。"]}
{"word":"hooly","summary":{"en":"Holy means sacred or connected to religion; it can also mean morally good, and informally it’s used as an exclamation of surprise.","zh":"Holy 表示“神圣的/宗教的”，也可指“道德高尚的”，口语中还可作感叹词表示惊讶。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with God, religion, or something considered sacred; treated with great respect","zh":"神圣的；宗教的；被视为神圣而受尊敬的"},"examples":[{"en":"This is a holy place for many people.","zh":"这里对很多人来说是一个神圣的地方。"},{"en":"The priest read from a holy book.","zh":"牧师从一部圣书中诵读。"},{"en":"They made a promise on holy ground.","zh":"他们在神圣的土地上许下承诺。"}]},{"partOfSpeech":"adj.","definition":{"en":"morally good and kind; living in a way that follows religious or ethical rules","zh":"虔诚善良的；道德高尚的"},"examples":[{"en":"She is known as a holy woman who helps the poor.","zh":"她以帮助穷人而被认为是一位虔诚善良的女性。"},{"en":"He tried to live a holy life.","zh":"他努力过一种虔诚正直的生活。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal) used to show surprise, shock, or strong emotion","zh":"（非正式）用于表示惊讶、震惊或强烈情绪"},"examples":[{"en":"Holy! That was close.","zh":"天哪！太险了。"},{"en":"Holy smoke, look at that storm!","zh":"天哪，看看那场暴风雨！"}]}],"synonyms":["sacred","divine","hallowed","saintly","pious"],"phonetic":"/ˈhoʊli/","extraExplanation":["你输入的“hooly”通常是“holy”的拼写错误；正确拼写是 holy。","首字母大写的“Holy”常用于宗教专有名词：the Holy Bible（圣经）、the Holy Spirit（圣灵）、Holy Week（圣周）。","口语里常见感叹搭配如“holy cow / holy moly / holy smoke”，用于表达惊讶，一般不带宗教冒犯意图，但在正式场合可用“Wow / That’s unbelievable”更稳妥。"]}
{"word":"hoom","summary":{"en":"“Hoom” is usually a cute internet slang form of “human,” especially in pet memes; it can also mean a low humming/booming sound.","zh":"“Hoom”通常是网络上可爱的“human（人类）”写法（常见于宠物梗）；也可用作拟声词，表示低沉的嗡鸣/轰鸣声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Internet slang, often in pet memes) a playful spelling of “human,” especially used by animals talking about their owner or people.","zh":"（网络俚语，常见于宠物梗）“human（人类）”的可爱写法，常用来指主人或人类。"},"examples":[{"en":"My hoom is late again—no dinner yet!","zh":"我的hoom又迟到了——晚饭还没来！"},{"en":"The cat stared at its hoom like, “Fix this now.”","zh":"猫盯着它的hoom，好像在说：“现在就给我解决。”"}]},{"partOfSpeech":"n.","definition":{"en":"a low, deep humming or booming sound (an informal onomatopoeia).","zh":"（非正式拟声）低沉的嗡鸣声/轰鸣声。"},"examples":[{"en":"In the quiet room, the fan made a soft hoom in the background.","zh":"在安静的房间里，风扇在背景里发出轻轻的嗡嗡声。"},{"en":"There was a distant hoom as the train passed under the bridge.","zh":"火车从桥下经过时，远处传来一阵低沉的轰响。"}]}],"synonyms":["hooman (slang)","human (standard)","hum (sound)","drone (sound)"],"phonetic":"/hum/","extraExplanation":["“hoom”常和“hooman”一起出现，是把“human”故意写得像小动物在说话的可爱拼法，语气通常是撒娇、抱怨或搞笑。常见搭配：my hoom（我的主人/我的人类）、good hoom（好人类）。"]}
{"word":"hooman","summary":{"en":"a cute, humorous way to say “human” online","zh":"网络上用来卖萌、搞笑地说“人类”的写法"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(humorous, internet slang) A playful misspelling/pronunciation of “human,” often used in pet memes or childlike speech.","zh":"（幽默；网络俚语）“human（人类）”的俏皮拼写/发音，常见于宠物梗或装可爱式的说话方式。"},"examples":[{"en":"The cat meme said, “Hooman, feed me now.”","zh":"那张猫咪梗图写着：“两脚兽（hooman），现在就喂我。”"},{"en":"My dog acts like I’m his favorite hooman.","zh":"我家狗把我当成它最喜欢的“人类（hooman）”。"},{"en":"In the comments, everyone called the owner “the hooman.”","zh":"评论区里大家都把主人叫作“hooman”。"}]}],"synonyms":["human","person","mortal"],"phonetic":"/ˈhuːmən/","extraExplanation":["语气与场景：hooman 通常带有可爱、搞笑、装作动物在说话的感觉；在正式写作、职场邮件、学术语境中不适合使用。","中文对译常见处理：可译成“人类”“两脚兽/铲屎官（视语境）”，但“铲屎官”更偏向“主人/饲主”，不总等同于 hooman。"],"etymology":"来自对 human 的戏谑式拼写：把 /hjuː-/ 的发音用更“幼稚/宠物口吻”的方式写成 hoo-，常见于英文网络文化（尤其是猫狗梗、宠物第一人称叙事）。","mnemonic":["把它当作“human 的卖萌版”：hoo- 像是拉长音“呼——”，模仿宠物撒娇的口气。","联想“猫狗叫你 hooman”=“你这个人类，快来伺候我”。"]}
{"word":"hoon","summary":{"en":"“Hoon” is mainly Australian/NZ slang for a reckless, show-off driver, and it can also mean to drive that way.","zh":"“Hoon”主要是澳大利亚/新西兰俚语，指飙车党，也可作动词表示飙车、鲁莽炫技驾驶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia/New Zealand, informal) A person who drives a car or rides a motorcycle in a dangerous, noisy, or show-off way.","zh":"（澳大利亚/新西兰，非正式）飙车党；以危险、吵闹或炫技方式驾驶（汽车/摩托）的人。"},"examples":[{"en":"The police stopped a hoon who was doing burnouts on the main road.","zh":"警方拦下了一名在主干道上烧胎（原地空转冒烟）的飙车党。"},{"en":"Our neighborhood is tired of hoons racing late at night.","zh":"我们社区受够了飙车党深夜飙车的噪音。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Australia/New Zealand, informal) To drive or ride in a reckless, noisy, or show-off way; to race around.","zh":"（澳大利亚/新西兰，非正式）飙车；鲁莽、吵闹或炫技式地驾驶；到处乱飙。"},"examples":[{"en":"They were hooning around the parking lot after the game.","zh":"比赛结束后，他们在停车场里到处飙车。"},{"en":"Please don’t hoon down this street—kids are crossing here.","zh":"请别在这条街上飙车——这里有孩子过马路。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, offensive) A slur for a person of South Asian or Middle Eastern background.","zh":"（少见，冒犯性）对南亚或中东背景人士的侮辱性称呼。"},"examples":[{"en":"That word is considered offensive; avoid using it.","zh":"这个词被认为具有侮辱性；请避免使用。"}]}],"synonyms":["(n.) reckless driver","(n.) street racer","(v.) race around","(v.) drive recklessly"],"phonetic":"/hun/","extraExplanation":["“hoon”主要是澳大利亚/新西兰口语，常见搭配有“hoon around”（到处乱飙）、“hoon down the road”（沿路猛飙）。在澳洲新闻与法律语境里也会出现“anti-hoon laws”（反飙车法规），用来打击危险驾驶、烧胎、街头飙车等行为。","注意：少数语境中“hoon”曾被用作种族侮辱语，属于冒犯性用法；在学习和日常交流中应避免使用这一含义。"]}
{"word":"hoondee","summary":{"en":"“hoondee” is not a standard English word; it’s usually a misspelling of “Hyundai.”","zh":"“hoondee”不是标准英语单词；通常是“Hyundai（现代）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling or phonetic spelling of the brand name “Hyundai,” a South Korean car company.","zh":"常见的拼写错误或按发音拼写的形式，通常指品牌名“Hyundai（现代）”，一家韩国汽车公司。"},"examples":[{"en":"I drive a Hyundai Elantra.","zh":"我开一辆现代伊兰特。"},{"en":"Did you mean “Hyundai” when you wrote “hoondee”?","zh":"你写“hoondee”是想表达“Hyundai（现代）”吗？"}]}],"synonyms":["Hyundai"],"phonetic":"/ˈhʌn.deɪ/","extraExplanation":["“Hyundai”在英语里常被读作 /ˈhʌn.deɪ/（类似“hun-day”），所以有人会用“hoondee/hoonday”等方式按听到的声音来拼写。正式写法是 Hyundai（现代）。","如果你想找的是别的词：它也可能是对“Hindi（印地语）”或其他词的误拼。你能告诉我上下文句子吗？我可以更准确判断。"]}
{"word":"hoondi","summary":{"en":"Hoondi is usually a spelling variant of hundi: a traditional South Asian bill of exchange or money-transfer instrument.","zh":"“hoondi”通常是“hundi”的拼写变体：指南亚传统的汇票/转账工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional South Asian written order or bill used to transfer money, make payments, or provide credit (similar to a bill of exchange).","zh":"（南亚传统）汇票/付款指令，用于转账、付款或提供信用（类似“汇票”或“付款凭证”）。"},"examples":[{"en":"The trader sent a hundi to his partner to pay the supplier in another city.","zh":"商人开出一张hundi（传统汇票）给合伙人，用来在另一座城市向供应商付款。"},{"en":"In some historical records, taxes were paid using hundis instead of cash.","zh":"在一些历史记录中，人们用hundi而不是现金来缴税。"}]},{"partOfSpeech":"n.","definition":{"en":"A money-transfer arrangement or informal remittance method in South Asia, sometimes connected to the hawala system (usage can be neutral in history but may be discussed as unregulated today).","zh":"（南亚）一种汇款/转账方式，有时与hawala体系相关（历史上可中性使用，但在现代语境中可能涉及“非监管/非正式”讨论）。"},"examples":[{"en":"The novel mentions a hundi network that helped families send money across borders.","zh":"小说里提到一个hundi汇款网络，帮助家庭跨境寄钱。"},{"en":"Authorities may investigate hundi transfers when they suspect money laundering.","zh":"当怀疑洗钱时，相关部门可能会调查hundi转账。"}]}],"synonyms":["bill of exchange","draft","promissory note","remittance"],"phonetic":"/ˈhʊndi/","extraExplanation":["你输入的“hoondi”更常见的拼写是“hundi”，也会见到“hoondi/hoondee”等变体，属于音译差异。","hundi源自南亚商业传统，常见于印度、巴基斯坦、孟加拉等地区的商贸与汇兑历史；在现代讨论中，有时会和“hawala（哈瓦拉）”一起出现，语境可能涉及“非正规金融/监管风险”，但并不等于所有hundi都违法，要看具体国家法律与使用方式。"]}
{"word":"hoonoomaun","summary":{"en":"“hoonoomaun” is not recognized as a standard English word; it’s likely a name, username, fictional term, or misspelling.","zh":"“hoonoomaun”不是标准英语词；更可能是名字/网名、虚构词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a fictional term, or a transliteration from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/网名、虚构词，或来自其他语言的音译/转写。"},"examples":[{"en":"My handle in the game is “hoonoomaun.”","zh":"我在游戏里的昵称是“hoonoomaun”。"},{"en":"I saw the word “hoonoomaun” in a chat, but I’m not sure what it means.","zh":"我在聊天里看到“hoonoomaun”，但不确定它是什么意思。"}]}],"phonetic":"/huːˈnuːmaʊn/","extraExplanation":["“hoonoomaun”看起来不像常见英语词汇，所以很难给出可靠释义与词性。最常见的情况是：1）拼错了某个英文词；2）人名/地名/网名；3）从其他语言按发音写成英文（音译）。","如果你告诉我它出现的语境（例如一句完整的话、来自哪本书/哪款游戏/哪种语言），或你想表达的意思/正确拼写，我可以帮你判断它最可能对应的词，并给出准确释义与例句。"]}
{"word":"hoop","summary":{"en":"Hoop means a ring (especially a basketball hoop) and can also refer to putting a ring around something; it appears in the idiom “jump through hoops.”","zh":"Hoop 指圆环（尤指篮球篮圈），也可作动词表示“加箍/用箍固定”；还常见于习语“jump through hoops（跑很多麻烦手续）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A circular ring, especially one used in sports (like a basketball hoop) or for holding something in shape (like a barrel hoop).","zh":"（通常指）圆环；（尤指）体育运动中的篮圈；（也可指）用来固定形状的箍（如桶箍）。"},"examples":[{"en":"He made a great shot and the ball dropped through the hoop.","zh":"他投了个好球，篮球穿过篮圈落下。"},{"en":"The metal hoops keep the wooden barrel tight.","zh":"金属桶箍把木桶箍得很紧。"},{"en":"A hula hoop is a plastic ring you spin around your waist.","zh":"呼啦圈是一种你绕着腰转的塑料圆环。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put a hoop around something; to encircle or fasten with hoops.","zh":"给……加箍；用箍把……圈住或固定。"},"examples":[{"en":"The workers hooped the barrel with metal bands.","zh":"工人用金属箍把木桶箍起来。"},{"en":"The dress was hooped to make the skirt stand out.","zh":"这条裙子用裙撑箍起来，让裙摆更蓬。"}]},{"partOfSpeech":"phrase","definition":{"en":"A “hoop” is also used in the phrase “jump through hoops,” meaning to do many difficult or annoying tasks to get something.","zh":"“hoop”也常见于短语“jump through hoops”，表示为了得到某事而不得不做很多困难或烦人的手续/任务。"},"examples":[{"en":"To get a visa, you sometimes have to jump through hoops.","zh":"为了办签证，你有时得跑很多手续。"},{"en":"Customers shouldn’t have to jump through hoops to get a refund.","zh":"顾客不应该为了退款而被迫做一堆麻烦事。"}]}],"synonyms":["ring","circle","band","rim"],"phonetic":"/hup/","extraExplanation":["“hoop”在美国日常口语里常直接指篮球的“篮圈/篮筐”（有时包含背板附近的整体装置）。在转播或街头对话中，你会听到：“Shoot the ball!” “Aim for the hoop.”","“hoop skirt”指19世纪常见的“裙撑裙/箍裙”，用裙撑（hoops）把裙摆撑大；在一些历史小说和古装题材中常出现。"]}
{"word":"hoop-bound","summary":{"en":"reinforced with hoops; figuratively, tightly restricted","zh":"被箍圈加固的；（比喻）受严格限制的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bound, reinforced, or surrounded with hoops (metal or wooden rings), especially like a barrel.","zh":"用箍（多为金属或木制的环）捆扎、加固或围住的；（尤指）像桶一样被箍住的。"},"examples":[{"en":"The hoop-bound barrel was rolled into the cellar.","zh":"那只用铁箍箍住的木桶被滚进了地窖。"},{"en":"They repaired the hoop-bound cask before the harvest festival.","zh":"他们在丰收节前修好了那只箍着圈的酒桶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Tightly restricted or hemmed in; unable to act freely.","zh":"（比喻）被紧紧束缚的；受限制、施展不开的。"},"examples":[{"en":"With so many rules, the team felt hoop-bound and uninspired.","zh":"规矩太多，团队觉得束手束脚、缺乏灵感。"},{"en":"Her schedule was hoop-bound by deadlines.","zh":"她的日程被截止日期箍得死死的。"}]}],"synonyms":["hooped","bound","constrained","restricted","hemmed in","shackled","straitjacketed"],"phonetic":"/ˈhup baʊnd/","extraExplanation":["这个词常见于描写旧式木桶、酒桶等（木板外面用铁箍固定）。比喻义里，“hoop”让人联想到一圈圈把东西勒紧的束缚感。"],"etymology":"由 hoop（箍、圈）+ bound（被捆住/束缚的）构成，原指“被箍圈箍住的（如木桶）”，后来引申出“被限制、被束缚”的比喻义。","mnemonic":["把它拆开记：hoop（箍/圈）+ bound（绑住的）→“被圈圈箍住的”，自然联想到“被限制、施展不开”。","联想中文“箍咒/紧箍”：一箍就紧，和 hoop-bound 的“被箍住”感觉很像。"]}
{"word":"hoop-skirted","summary":{"en":"wearing a hoop-supported, wide skirt","zh":"穿着由裙撑支撑的宽大外扩裙装"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a skirt that is held out in a wide shape by hoops (a hoop skirt).","zh":"穿着用裙撑（圈架）撑开的、呈宽大外扩形状的裙子。"},"examples":[{"en":"In the museum painting, a hoop-skirted woman stands beside a piano.","zh":"在博物馆的画作里，一位穿裙撑裙的女子站在钢琴旁边。"},{"en":"The costume designer chose hoop-skirted dresses to match the 1860s setting.","zh":"服装设计师选用裙撑裙来贴合19世纪60年代的时代背景。"}]}],"synonyms":["crinolined","bell-shaped","full-skirted"],"phonetic":"/ˈhuːp ˌskɝːtɪd/","extraExplanation":["Hoop skirt（裙撑裙）在19世纪中期的欧美非常流行，常见于维多利亚时代的服饰；它用金属或鲸骨等材料做成圈架，把裙子撑得很宽。"],"etymology":"由 hooped（带圈的）+ skirted（穿裙子的/有裙的）构成的复合形容词；这里的 hoop 指支撑裙形的“圈架/裙撑”。","mnemonic":["把 hoop 想成“呼啦圈”；裙子里套了很多“圈”，自然就会“撑开”成大裙摆。"]}
{"word":"hoop-stick","summary":{"en":"a stick used to roll and control a hoop; also the old hoop-rolling game","zh":"推着并控制铁环/木环滚动的棍子；也指推环游戏"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stick used to push and guide a rolling hoop in a traditional children’s game.","zh":"（传统儿童游戏中）用来推着并控制滚动铁环/木环的棍子。"},"examples":[{"en":"The children chased the hoop down the lane, steering it with a hoop-stick.","zh":"孩子们把铁环一路追着滚，用推环棍来控制方向。"},{"en":"In old photos, you can sometimes see a boy holding a hoop-stick beside a metal hoop.","zh":"在一些老照片里，你有时会看到男孩拿着推环棍，旁边放着金属铁环。"}]},{"partOfSpeech":"n.","definition":{"en":"The game or pastime of rolling a hoop using such a stick.","zh":"（用棍推着铁环滚动的）推环游戏。"},"examples":[{"en":"Hoop-stick was a popular street game before modern toys became common.","zh":"在现代玩具普及之前，推环游戏曾是很常见的街头游戏。"}]}],"synonyms":["hoop roller","hoop-rolling","rolling hoop","stick"],"phonetic":"ˈhupˌstɪk","extraExplanation":["这类游戏在维多利亚时代及更早的街头很常见：孩子用棍子（有时末端带小钩或凹槽）推动铁环/木环滚动，比拼速度与控制力。如今多见于历史书、老照片、复古题材文学或博物馆描述。"],"etymology":"复合词：hoop（环）+ stick（棍）。在英美地区常用来指19世纪到20世纪早期流行的“推铁环”玩具与游戏。","mnemonic":["把它拆开记：hoop=“环/圈”，stick=“棍子”，合起来就是“推环的棍子”。","联想中文“推铁环”：推铁环用的那根棍子=hoop-stick。"]}
{"word":"hoop-wood","summary":{"en":"flexible wood used to make hoops (especially for barrels)","zh":"用于制作桶箍等箍圈的韧性木材"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wood (often thin, flexible strips or young shoots) used for making hoops, especially for barrels and tubs.","zh":"用来做箍圈的木材（常指细而有韧性的木条或嫩枝），尤指桶、木盆等外面的箍。"},"examples":[{"en":"In the past, coopers often cut hoop-wood to make barrel hoops.","zh":"过去制桶匠常砍取箍木来做桶箍。"},{"en":"They soaked the hoop-wood so it would bend without cracking.","zh":"他们把箍木先浸泡，让它弯曲时不容易开裂。"}]}],"synonyms":["withy","osier","flexwood"],"phonetic":"/ˈhuːpˌwʊd/","extraExplanation":["传统木桶通常靠木箍（可为木箍或铁箍）把桶身的木板束紧。\"hoop-wood\"多指适合弯折成箍的材料，因此强调“韧性、可弯曲”。现代多用金属箍后，这个词在日常英语里相对少见，更多出现在历史、手工艺或地方性用法中。"],"etymology":"复合词：hoop（箍、圈）+ wood（木材）。字面义就是“做箍用的木头”。早期在制桶业（cooperage）语境中更常见。","mnemonic":["把它拆开记：hoop = “箍/圈”，wood = “木头”，合起来就是“做箍的木头”。","联想中文“桶箍”：hoop-wood 就是做“箍”的木材。"]}
{"word":"hooped","summary":{"en":"“Hooped” usually means fitted with hoops (or the past form of “hoop”), and informally it can mean “in big trouble.”","zh":"“hooped”常指“被箍起来/带箍圈的”（也是“hoop”的过去式），口语里也可指“惹上大麻烦/完蛋了”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “hoop”: to fit or surround something with a hoop (a ring, often of metal or wood), or to form something into hoops","zh":"“hoop”的过去式/过去分词：用箍（常为金属或木制的圈）加固、套住；或把……做成圈/箍状"},"examples":[{"en":"The cooper hooped the barrel to keep the staves tight.","zh":"制桶匠给桶箍上箍圈，让桶板更紧密。"},{"en":"The skirt was hooped to make it stand out.","zh":"这条裙子用裙撑箍起来，让裙摆更蓬。"}]},{"partOfSpeech":"adj.","definition":{"en":"having hoops; shaped like a hoop or supported by hoops","zh":"有箍圈的；呈环状的；由箍圈/圈架支撑的"},"examples":[{"en":"They stored the grain in hooped wooden barrels.","zh":"他们把谷物存放在带箍的木桶里。"},{"en":"She wore a hooped dress for the historical performance.","zh":"她在历史主题表演中穿了一条带裙撑的裙子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) in serious trouble; ruined; stuck in a bad situation","zh":"（非正式）陷入大麻烦；完蛋了；处境很糟/被卡住"},"examples":[{"en":"If we miss the deadline, we’re hooped.","zh":"要是错过截止日期，我们就完蛋了。"},{"en":"My car won’t start—I'm hooped unless someone gives me a ride.","zh":"我的车打不着火——除非有人载我一程，不然我就麻烦了。"}]}],"synonyms":["ringed","banded","encircled","barreled","screwed (informal)","in trouble (informal)"],"phonetic":"/hupt/","extraExplanation":["“hooped skirt/dress”常指19世纪流行的“裙撑”（hoop skirt/crinoline），用圈架把裙子撑出宽大的轮廓。","“We’re hooped”这类口语更常见于加拿大英语和部分英式英语语境，美式英语也能听懂，但有时会用“we’re screwed / we’re in trouble”更常见。"]}
{"word":"hooper","summary":{"en":"Hooper most commonly means a basketball player (often slang for someone very good). It can also mean a person who makes hoops, or someone who performs with hoops like a hula hoop.","zh":"Hooper最常见指篮球运动员（也常作口语，指很会打球的人）。也可指制作箍圈的人，或玩/表演转圈（如呼啦圈）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in American English) A basketball player; someone who plays basketball well.","zh":"（尤指美式英语）篮球运动员；（口语）很会打篮球的人。"},"examples":[{"en":"She’s a talented hooper who can score from anywhere on the court.","zh":"她是个很有天赋的篮球高手，球场上哪里都能得分。"},{"en":"In the neighborhood, everyone knew him as the best hooper at the park.","zh":"在社区里，大家都知道他是公园里打得最好的那位。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who makes hoops (circular bands), such as metal or wooden hoops used in barrels or crafts.","zh":"制作箍圈的人（如制作桶箍或手工用的金属/木质圆箍）。"},"examples":[{"en":"In the old workshop, the hooper shaped metal bands for barrels.","zh":"在那间老作坊里，制箍匠为木桶塑形金属箍圈。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who uses or spins a hoop, especially a hula hoop (less common).","zh":"玩圈的人（尤指转呼啦圈的人；较少见）。"},"examples":[{"en":"At the festival, a skilled hooper performed with glowing hoops.","zh":"在节日上，一位技术娴熟的转圈表演者用发光的圈进行表演。"}]}],"synonyms":["basketball player","baller (informal)","player","athlete","barrel-hoop maker"],"phonetic":"/ˈhuːpɚ/","extraExplanation":["“hooper”在美国口语里很常见，通常带一点“街球/球技很强”的感觉：a real hooper = 真正会打球的人。","在体育语境中也常见“hoop”指篮球框（the hoop），因此“hooper”自然引申为篮球运动员。"]}
{"word":"hooperman","summary":{"en":"“Hooperman” is usually a proper name, most commonly a surname.","zh":"“Hooperman”通常是专有名词，最常见用法是英文姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), used as a person’s last name; not a common everyday vocabulary word","zh":"姓氏（家族姓），用作人的英文姓；不是常见的日常词汇"},"examples":[{"en":"Dr. Hooperman will speak at the conference tomorrow.","zh":"胡珀曼博士明天将在会议上发言。"},{"en":"Her last name is Hooperman, so we file her under “H.”","zh":"她的姓是 Hooperman，所以我们把她归档在“H”下面。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name used for a character, business, or place (depending on context)","zh":"专有名称，可用作角色名、公司名或地名（取决于语境）"},"examples":[{"en":"In the story, Hooperman is the detective who solves the case.","zh":"在故事里，Hooperman 是侦探，负责破案。"},{"en":"Hooperman Bakery is opening a new location downtown.","zh":"Hooperman 面包店要在市中心开新店。"}]}],"synonyms":["(no direct synonyms; it’s a name)"],"phonetic":"/ˈhuːpərmən/","extraExplanation":["“Hooperman”更像专有名词（通常首字母大写）。如果你在文本里看到它，最可靠的做法是先判断它指的是“人名/姓氏”、还是“品牌/机构/角色名”。","从构词上看，它可能由 hooper（与“hoop/箍、圈”相关的词）+ man 组合而来，类似表示“做某类工作的人”的旧式姓氏来源；但现代英语里并不把它当作常用词来使用。"]}
{"word":"hoopers","summary":{"en":"“Hoopers” most commonly means basketball players (informal), especially skilled ones.","zh":"“Hoopers”最常见指（口语）篮球运动员，尤指球技很强的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of hooper) A basketball player; especially someone who is good at playing basketball (informal).","zh":"（hooper 的复数）篮球运动员；尤指很会打球的人（非正式）。"},"examples":[{"en":"The park was full of hoopers running 3-on-3 games.","zh":"公园里满是打 3 对 3 的篮球好手。"},{"en":"She’s one of the best hoopers in the league.","zh":"她是联盟里最强的篮球运动员之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) People whose job is to make hoops, rings, or hoop-shaped parts.","zh":"（较少见）制作箍、圈或环形零件的人。"},"examples":[{"en":"In the past, hoopers made wooden hoops for barrels.","zh":"过去有些工匠会制作木箍，用来箍桶。"}]}],"synonyms":["basketball players","ballers","players"],"phonetic":"/ˈhuːpər/","extraExplanation":["“hooper”在美式英语里很常见于口语/街头语境，意思接近“baller（篮球高手）”。在社交媒体或球场对话里说“real hooper”通常带有称赞意味，强调球技、球感或比赛经验。"]}
{"word":"hooping","summary":{"en":"“Hooping” most commonly means playing basketball (slang). It can also mean adding hoops/bands to something, and rarely appears as a variant spelling of “whooping” (loud cheering).","zh":"“hooping”最常见的意思是（俚语）打篮球；也可指给物品加箍/做成圈；少数情况下可作为“whooping”（大声欢呼）的非标准拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(slang) Playing basketball, especially casually or for fun.","zh":"（俚语）打篮球（尤指随便玩、娱乐性地打球）。"},"examples":[{"en":"We’re hooping at the park after school.","zh":"我们放学后在公园打篮球。"},{"en":"He spent all weekend hooping with friends.","zh":"他整个周末都在和朋友打篮球。"}]},{"partOfSpeech":"n.","definition":{"en":"Putting hoops (rings/bands) onto something, or shaping something into a hoop; the act of adding hoops (often for support, like on barrels or skirts).","zh":"给某物加箍（环形带），或把某物做成圈；加箍的行为（常用于加固，如木桶箍、裙撑等）。"},"examples":[{"en":"The workshop specializes in barrel hooping.","zh":"这家作坊专做木桶上箍。"},{"en":"They were hooping the frame with metal bands for strength.","zh":"他们用金属箍加固框架。"}]},{"partOfSpeech":"v.","definition":{"en":"Making a loud shout or call (a less common spelling/variant of “whooping”).","zh":"发出大声的叫喊（较少见的拼写，用来表示“whooping”的意思）。"},"examples":[{"en":"The kids were hooping and cheering when the team scored.","zh":"球队得分时孩子们大声欢呼。"}]}],"synonyms":["playing basketball","shooting hoops","balling","banding","hooping (barrels)","whooping (variant)"],"phonetic":"/ˈhuːpɪŋ/","extraExplanation":["“hooping”在口语里常指“打篮球”，来自basketball hoop（篮筐）这个词；在日常英语中非常常见。","表示“欢呼尖叫”时，标准拼写通常是“whooping”（例如：whooping and cheering）。如果你看到“hooping”用于这个意思，多半是非标准拼写或为了模仿口音。","“hooping cough”是“百日咳”，其中标准拼写也是“whooping cough”，因病人吸气时会发出类似尖叫/呼噜的声音。"]}
{"word":"hoopla","summary":{"en":"Hoopla means loud excitement or publicity—often more hype than substance.","zh":"Hoopla 指喧闹的热闹或宣传炒作，常暗示“声势大但未必有实质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lot of noisy public excitement, attention, or fuss, often more than the situation deserves.","zh":"喧闹的热闹/大惊小怪；（媒体或公众的）过度关注与炒作。"},"examples":[{"en":"There was a lot of hoopla when the new phone was released.","zh":"新手机发布时引起了很多喧闹的关注和炒作。"},{"en":"I like the idea, but I don’t need all the hoopla around it.","zh":"我喜欢这个想法，但不需要围绕它的大惊小怪。"}]},{"partOfSpeech":"n.","definition":{"en":"Publicity or promotional activity meant to attract attention; hype.","zh":"宣传造势；炒作；营销噱头。"},"examples":[{"en":"The company used hoopla to build interest before opening day.","zh":"公司在开业前用宣传造势来提升关注度。"},{"en":"Ignore the hoopla and focus on what the product can actually do.","zh":"别被炒作影响，专注于产品真正能做什么。"}]}],"synonyms":["hype","fuss","commotion","brouhaha","publicity"],"phonetic":"/ˈhuː.plɑː/","extraExplanation":["“hoopla”常带一点点贬义或调侃，暗示“声势很大但未必有实质内容”。在新闻、广告、社交媒体语境里很常见，类似“hype/炒作”。","词源上常被认为来自19世纪末的美国口语，可能与早期的叫卖声或戏法表演的吆喝有关，因此带有“热闹、招徕注意”的色彩。"]}
{"word":"hooplas","summary":{"en":"“Hooplas” is the plural of “hoopla,” meaning unnecessary fuss/hype or loud public commotion.","zh":"“Hooplas”是“hoopla”的复数，指对某事的大惊小怪/炒作，或公众场合的喧闹骚动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “hoopla”) a lot of unnecessary public attention, excitement, or fuss about something.","zh":"（“hoopla”的复数）对某事过度的公众关注、兴奋或大惊小怪。"},"examples":[{"en":"There was a lot of hooplas about the new phone, but it wasn’t much different from the old one.","zh":"新手机引起了很多“hooplas”（大肆炒作/喧闹），但其实和旧款差不多。"},{"en":"Don’t believe all the hooplas online—read the facts first.","zh":"别全信网上那些“hooplas”（喧嚷/炒作）——先看事实。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of “hoopla”) loud celebration or commotion, especially in public.","zh":"（“hoopla”的复数）喧闹的庆祝场面或骚动（尤指在公共场合）。"},"examples":[{"en":"The team arrived to cheers and hooplas at the airport.","zh":"球队抵达机场时，迎接他们的是欢呼和一片喧闹的庆祝声。"},{"en":"We could hear hooplas from the street festival all night.","zh":"我们整晚都能听到街头节日传来的喧闹声。"}]}],"synonyms":["hype","fuss","commotion","ado","brouhaha","fanfares"],"phonetic":"ˈhuːplə","extraExplanation":["“hoopla”常带有一点否定或调侃色彩，暗示“热闹/关注”可能被夸大了（类似“炒作”“噱头”）。","拼写提示：标准形式是单数 hoopla；复数是 hooplas。你输入的“hooplas”通常就是指复数。","词源上常被认为与法语感叹词“houpla!”（表示“嘿哟/用力”一类的呼喊）有关，后来在英语里引申为“喧闹的场面、噱头”。"]}
{"word":"hoople","summary":{"en":"“Hoople” is informal slang for a foolish or gullible person.","zh":"“hoople”是非正式俚语，指愚蠢或容易上当的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) A foolish, gullible, or unsophisticated person; a “dummy.”","zh":"（俚语，非正式）傻瓜；容易上当、见识不多的人。"},"examples":[{"en":"Don’t try to sell that to me—I’m not some hoople.","zh":"别拿那套来骗我——我又不是那种好糊弄的傻瓜。"},{"en":"He acted like a hoople and believed every rumor he heard.","zh":"他表现得像个傻瓜一样，听到什么谣言都信。"}]}],"synonyms":["fool","idiot","sucker","dupe","simpleton"],"phonetic":"/ˈhuːpəl/","extraExplanation":["“hoople”在现代英语里不算常见，多带有粗鲁或轻蔑的语气，类似于“idiot / sucker / fool”。","这个词在一些西部题材作品中更容易见到，比如美剧《Deadwood》里常用来骂人或嘲笑“外行、土包子”。在日常生活中，如果你用它，别人可能会觉得你在模仿西部/旧时口吻，或觉得用词有点刻薄。"]}
{"word":"hoopless","summary":{"en":"Hoopless means “without hoops/rings,” often describing clothing without hoop supports or objects like barrels without metal hoops.","zh":"hoopless 指“无箍的/无圈的”，常用于描述没有圈状支撑的服装，或没有金属箍固定的桶等物品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without hoops (rings or circular bands), or not supported by hoops.","zh":"无箍的；没有圈状支撑物（箍、圈、环）的；不靠箍来支撑的。"},"examples":[{"en":"The barrel was hoopless, so the staves could loosen more easily.","zh":"这个桶没有箍，所以桶板更容易松散。"},{"en":"She chose a hoopless skirt that hung straight instead of flaring out.","zh":"她选了一条无裙撑的裙子，垂直下落而不是向外蓬开。"}]}],"synonyms":["unhooped","without hoops","unsupported"],"phonetic":"/ˈhuːpləs/","extraExplanation":["“Hoop”常指“箍/圈/环”，也可指过去服饰里的“裙撑（hoop skirt）”或木桶/酒桶外面的金属箍。Hoopless 多用于描述“没有这些圈状支撑或固定结构”的样式或状态。","这个词比较少见，更多出现在服装史/道具说明、木桶工艺、或文学描写中，用来营造一种“去掉支架、更自然下垂/更不受束缚”的画面。"]}
{"word":"hooplike","summary":{"en":"Hooplike describes something shaped like a hoop or ring.","zh":"Hooplike 用来形容“像圈/箍一样的环状形状”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a hoop or ring; circular and often hollow or curved like a loop.","zh":"环状的；像箍/圈一样的；呈圆环或弯曲成圈的形状。"},"examples":[{"en":"The plant has hooplike stems that curl into loops.","zh":"这种植物的茎呈环状，会卷成圈。"},{"en":"A hooplike frame supports the fabric of the small tent.","zh":"一个环状的框架支撑着这顶小帐篷的布料。"}]}],"synonyms":["ring-shaped","circular","looped","annular"],"phonetic":"/ˈhuːpˌlaɪk/","extraExplanation":["“hooplike”由“hoop（箍、圈）+ -like（像……一样）”构成，是很直观的形容词，常用于描述形状或结构（如骨架、拱形支架、环形零件等）。","与之相近的表达有 ring-shaped、circular、looped；在更正式或技术语境里也可能看到 annular（环形的）。"]}
{"word":"hoopmaker","summary":{"en":"A hoopmaker is a craft worker who makes hoops, especially the rings used to hold barrels and tubs together.","zh":"hoopmaker 指“箍匠”，专门制作箍，尤指用于固定木桶、桶缸等的圆箍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes hoops (especially wooden or metal rings) used for barrels, tubs, or similar containers; a traditional craft worker.","zh":"箍匠；制作箍（尤指木桶、桶缸等容器上的木/金属箍）的人；一种传统手艺工人。"},"examples":[{"en":"In the old village, the hoopmaker repaired broken barrel hoops for the brewery.","zh":"在过去的村子里，箍匠会为啤酒厂修理破损的桶箍。"},{"en":"The museum showed how a hoopmaker heated metal strips and shaped them into rings.","zh":"博物馆展示了箍匠如何加热金属条并把它们塑形成圆箍。"},{"en":"A hoopmaker’s work was essential before modern factories mass-produced containers.","zh":"在现代工厂批量生产容器之前，箍匠的工作非常重要。"}]}],"synonyms":["barrel-hoop maker","craftsman","artisan","cooper (related)"],"phonetic":"/ˈhuːpˌmeɪkər/","extraExplanation":["“hoopmaker”常见于历史/文学语境，和“cooper（制桶匠）”关系密切：cooper制作桶身与组装桶；hoopmaker更专门负责制作或安装桶箍（hoops）。在工业化后，这类职业在日常生活中较少见，因此该词带有一种“旧时行当/传统工艺”的感觉。"]}
{"word":"hoopman","summary":{"en":"“Hoopman” usually means an old-time craftsman who makes barrel hoops; informally it can also mean a basketball player (often written “hoop man”).","zh":"“Hoopman”通常指过去制作桶箍的工匠；口语里也可指篮球运动员（常写作“hoop man”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes, repairs, or sells hoops, especially the wooden or metal hoops used to hold barrels and tubs together (an old-fashioned trade).","zh":"制箍匠；制作、修理或出售箍（尤指桶箍、木桶或木盆外圈金属/木质箍）的工匠（较古老的行业称呼）。"},"examples":[{"en":"In the old days, the hoopman fitted iron hoops around barrels to keep them tight.","zh":"在过去，制箍匠会把铁箍套在木桶外，确保桶身结实不漏。"},{"en":"The cooper and the hoopman often worked with the same materials, but they had different jobs.","zh":"制桶匠和制箍匠常用同样的材料，但分工不同。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, especially in American English) A basketball player; someone associated with basketball. Often written as “hoop man” as two words.","zh":"（非正式，尤美式英语）篮球运动员；打篮球的人。也常写作两个词“hoop man”。"},"examples":[{"en":"He’s a real hoop man—always at the gym after school.","zh":"他是真正的“篮球迷/打球的人”——放学后总在球馆。"},{"en":"The coach is looking for a quick hoop man who can defend well.","zh":"教练在找一个速度快、会防守的球员。"}]}],"synonyms":["hoop maker","barrel-hoop maker","cooper (related trade)","basketball player (informal sense)"],"phonetic":"/ˈhuːpmən/","extraExplanation":["“Hoopman”更常见于较早的英语语料，和制桶业（cooperage）有关：木桶需要箍（hoops）来固定桶板并保持密封，所以制箍是一门专门手艺。","现代口语里与篮球相关的用法，多半来自“hoops”（篮球运动的俗称），写作“hoop man/hoops man”更常见；“hoopman”连写相对少见。"]}
{"word":"hoopmen","summary":{"en":"Hoopmen are workers who make or fit hoops, especially hoops used to bind barrels and casks.","zh":"Hoopmen 指制作或安装箍圈（尤其是桶箍）的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hoopman: a person whose job is to make or fit hoops (especially metal or wooden hoops used to bind barrels, casks, or tubs).","zh":"hoopman 的复数：制作或安装“箍”（尤指用于箍住桶、木桶、木盆等的金属或木制箍圈）的人。"},"examples":[{"en":"In the old cooperage, hoopmen shaped iron hoops to tighten the barrels.","zh":"在旧时的制桶作坊里，hoopmen 会把铁箍圈做成形，用来把木桶箍紧。"},{"en":"The hoopmen checked each hoop for a snug fit before the cask was shipped.","zh":"hoopmen 在酒桶运出前会检查每一道箍圈是否贴合牢固。"}]}],"synonyms":["barrel-hoop maker","cooper (related)"],"phonetic":"ˈhuːpmən","extraExplanation":["这个词比较少见，带有历史职业色彩，常出现在描写传统手工业（如制桶业 cooperage / 制桶匠 cooper）或早期工坊分工的语境里。现代英语里更常说“barrel hoops（桶箍）”以及“cooper（制桶匠）”，而不是日常使用 hoopman/hoopmen。"]}
{"word":"hoopoe","summary":{"en":"A hoopoe is a distinctive crested bird with a long curved bill and black-and-white wings.","zh":"hoopoe 指“戴胜”，一种有扇形羽冠、长弯嘴、黑白翅纹很醒目的鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bird with a long curved bill and a fan-shaped crest of feathers; known for its striking black-and-white wings","zh":"戴胜（一种鸟）：嘴长而略弯，头顶有扇形羽冠，翅膀有黑白相间的醒目花纹"},"examples":[{"en":"We saw a hoopoe resting on a fence, its crest raised like a small crown.","zh":"我们看到一只戴胜停在栅栏上，羽冠竖起，像一顶小皇冠。"},{"en":"The hoopoe’s call is soft but easy to recognize once you learn it.","zh":"戴胜的叫声不大，但一旦熟悉就很容易辨认。"}]}],"synonyms":["upupa"],"phonetic":"/ˈhuːpoʊ/","extraExplanation":["“Hoopoe”这个词模仿了它常见的叫声（像“hoo-poo”一类的音），因此读起来也有拟声感。","戴胜在不同文化中常被视为有象征意义的鸟：例如在中东与南亚的故事传统里，它有时被描写为聪明的使者或引路者。英语文学中也偶尔作为“异域、醒目、神秘”的意象出现。"]}
{"word":"hoopoes","summary":{"en":"Hoopoes are birds with a distinctive crest and long bill; “hoopoes” is the plural form.","zh":"Hoopoes 是“戴胜”这种鸟的复数形式，以明显的羽冠和细长的喙为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hoopoe (plural): a medium-sized bird with a long, slightly curved bill and a tall fan-shaped crest; known for its bold black-and-white wing pattern","zh":"戴胜（复数）：一种中等体型的鸟，喙细长略弯，头顶有可竖起的扇形羽冠，翅膀有醒目的黑白条纹"},"examples":[{"en":"We saw several hoopoes feeding on the ground near the old wall.","zh":"我们看到几只戴胜在老墙边的地上觅食。"},{"en":"Hoopoes often probe the soil for insects.","zh":"戴胜常用嘴在土里探寻昆虫。"}]}],"synonyms":["hoopoe (singular)","Upupa epops (scientific name)"],"phonetic":"/ˈhuː.poʊ/","extraExplanation":["“hoopoe”是一种在欧洲、亚洲和非洲较常见的鸟。英文名常被认为来自它的叫声（拟声词），听起来像“hoo-poo”。","戴胜在不同文化中也常出现：例如在伊斯兰传统故事里，戴胜常被描写为聪明、会传信的鸟；在一些古代艺术与民间传说中也有象征意义。"]}
{"word":"hoopoo","summary":{"en":"Hoopoo usually refers to the hoopoe, a crested bird; the more standard spelling is hoopoe.","zh":"hoopoo 通常指“戴胜鸟（hoopoe）”，更标准的拼写是 hoopoe。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bird (the hoopoe) known for its orange-brown feathers, black-and-white wings, and a fan-shaped crest; it makes a distinctive “hoo-poo” call","zh":"一种鸟（戴胜鸟），以橙褐色羽毛、黑白相间的翅膀和扇形冠羽著称；叫声常被听成“hoo-poo”"},"examples":[{"en":"We saw a hoopoo with its crest raised near the olive trees.","zh":"我们在橄榄树旁看到一只戴胜鸟，冠羽竖起。"},{"en":"The hoopoo’s call echoed across the field at dawn.","zh":"黎明时，戴胜鸟的叫声在田野上回荡。"}]}],"synonyms":["hoopoe"],"phonetic":"/ˈhuːpuː/","extraExplanation":["“hoopoo”在英语里常见于口语/非正式写法或误拼，标准拼写更常用的是“hoopoe”。它的名字模仿了鸟的叫声（拟声）。","戴胜鸟在一些文化与文学中出现较多：例如在《古兰经》相关故事里常被提到；在欧洲民间传说中也有象征意义。"]}
{"word":"hoopoos","summary":{"en":"“hoopoos” is not standard spelling; it most likely means “hoopoes,” the plural of “hoopoe,” a crested bird.","zh":"“hoopoos”不是标准拼写；多半指“hoopoes”（hoopoe 的复数），一种有羽冠的鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a likely misspelling of “hoopoes,” the plural of “hoopoe,” a bird with a tall fan-shaped crest and a long, curved bill (common in Europe, Asia, and Africa).","zh":"很可能是“hoopoes”的拼写错误；“hoopoe”的复数，指一种有扇形羽冠、细长弯嘴的鸟（常见于欧洲、亚洲和非洲）。"},"examples":[{"en":"I saw two hoopoes in the garden this morning.","zh":"今天早上我在花园里看到了两只戴胜（hoopoes）。"},{"en":"The hoopoe’s crest rises when it is excited or alarmed.","zh":"戴胜在兴奋或警觉时会竖起羽冠。"}]}],"synonyms":["hoopoes","crested bird","Upupa epops"],"phonetic":"/ˈhuːpuː/","extraExplanation":["“hoopoe”在英语里通常读作 /ˈhuːpuː/，名称来自它典型的叫声（类似“hoo-poo”）。","“hoopoe”的中文常译为“戴胜”。它在一些文化与文学中出现过，例如《圣经》旧约中提到过这种鸟；在古埃及文化中也能看到它的形象。"]}
{"word":"hoops","summary":{"en":"“Hoops” usually means circular rings/bands; informally, it can also mean basketball (playing or shooting).","zh":"“hoops”通常指圈、环；口语中也可指打篮球（投篮、篮球运动）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hoop”: a circular band or ring (often made of metal, plastic, or wood), used as a frame, support, or for play.","zh":"“hoop”的复数：圈、环（常为金属/塑料/木制），可作支架、框架或玩具。"},"examples":[{"en":"The barrel was held together by metal hoops.","zh":"木桶由金属箍（铁箍）固定在一起。"},{"en":"The kids rolled hoops down the street.","zh":"孩子们在街上滚铁环玩。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Basketball, especially the act of playing it (as in “shoot hoops”).","zh":"（非正式）篮球运动；尤指打篮球（如“shoot hoops”）。"},"examples":[{"en":"After work, we played hoops at the park.","zh":"下班后我们去公园打篮球。"},{"en":"He goes outside to shoot hoops every weekend.","zh":"他每个周末都会出去投篮打篮球。"}]}],"synonyms":["rings","bands","circles","basketball (informal)"],"phonetic":"/hups/","extraExplanation":["“hoop”在口语里常用来指“篮球圈/篮筐”，所以“(shoot) hoops”就引申为“打篮球”。","常见习语：jump through hoops（费尽周折/按很多要求办事），强调为了达成目标不得不做很多麻烦事。"]}
{"word":"hoopskirt","summary":{"en":"A hoopskirt is a wide skirt (or underskirt frame) shaped by hoops, popular in the mid-1800s.","zh":"hoopskirt 指用圈状支架撑出宽大裙摆的裙撑（或带裙撑结构的裙子），流行于19世纪中期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wide, bell-shaped skirt held out by hoops (rings) or a stiff frame worn under the fabric, especially popular in the 1850s–1860s","zh":"（尤指19世纪中期流行的）裙撑；用圈状支架把裙摆撑成宽大钟形的裙子（或内衬框架）"},"examples":[{"en":"In the museum, you can see a hoopskirt that made women’s dresses look very wide.","zh":"在博物馆里，你能看到一种裙撑，让女性的连衣裙看起来非常宽大。"},{"en":"She wore a hoopskirt costume for a Civil War-era reenactment.","zh":"她在一场美国内战时期的历史复演活动中穿了裙撑式服装。"}]}],"synonyms":["crinoline","bell skirt"],"phonetic":"/ˈhuːpˌskɝːt/","extraExplanation":["“hoopskirt”也常被称为“crinoline（克里诺林裙撑）”，在英语文化里常用来指代19世纪维多利亚时代的时尚与社会礼仪。","这种裙撑能让裙摆更蓬松，但也带来不便：占空间、行动受限，甚至在靠近火源时有安全风险。","词形上是复合词：hoop（圈、环）+ skirt（裙子）。常见拼写为一个词“hoopskirt”，也可见到“hoop skirt”。"]}
{"word":"hoopster","summary":{"en":"“Hoopster” is an informal word for a basketball player.","zh":"“Hoopster”是“篮球运动员/打篮球的人”的非正式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a basketball player (informal); someone who plays basketball, often in a casual or streetball context","zh":"篮球运动员（非正式用法）；指打篮球的人，常带有“野球/街头篮球”语境"},"examples":[{"en":"He was a talented hoopster in high school and led his team to the finals.","zh":"他高中时是个很有天赋的篮球选手，带队打进了决赛。"},{"en":"The park is full of hoopsters every weekend.","zh":"每到周末，公园里都是打篮球的人。"},{"en":"She’s a hoopster who practices her jump shot every day.","zh":"她是个篮球爱好者，每天都练习跳投。"}]}],"synonyms":["basketball player","baller","hooper"],"phonetic":"/ˈhupstɚ/","extraExplanation":["“Hoop”原意是“篮圈/环”，在美式口语里也可指“篮球运动（the hoops）”。“Hoopster”是在“hoop”后加上表示“做某事的人”的后缀“-ster”，语气偏口语、带点俏皮，不是正式报道里最常用的词（更常见的是 basketball player）。","在美国体育文化中，这个词有时让人联想到街头篮球、社区球场（park/blacktop）的氛围；是否带褒义取决于语境。"]}
{"word":"hoopsters","summary":{"en":"“Hoopsters” means basketball players (informal).","zh":"“Hoopsters”指篮球运动员（非正式说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A basketball player; someone who plays basketball (often used in the plural: “hoopsters”).","zh":"（非正式）篮球运动员；打篮球的人（常用复数“hoopsters”）。"},"examples":[{"en":"The park is full of hoopsters on weekends.","zh":"周末公园里到处都是打篮球的人。"},{"en":"Local hoopsters competed in a three-on-three tournament.","zh":"本地的篮球选手参加了三对三比赛。"},{"en":"He grew up watching the hoopsters at the neighborhood court.","zh":"他从小就在社区球场看那些篮球选手打球。"}]}],"synonyms":["basketball players","ballers","cagers (old-fashioned)"],"phonetic":"/ˈhuːp.stɚ/","extraExplanation":["“hoopster”来自口语里对篮球的称呼“hoops”（篮圈/篮球运动）。因此“hoopster(s)”多见于体育新闻、解说或街头篮球语境，语气轻松随意。"]}
{"word":"hoopstick","summary":{"en":"A hoopstick is a stick used to roll and steer a hoop in a traditional children’s game.","zh":"hoopstick 指用于滚动并控制圆环（滚铁环）的棍子，多见于传统儿童游戏语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stick used to roll and guide a hoop (especially in an old children’s game where you run while rolling a hoop).","zh":"（旧时儿童游戏中）用来滚动、控制铁环/木环的棍子（滚铁环用的棍）。"},"examples":[{"en":"The kids raced down the lane, pushing their hoops with hoopsticks.","zh":"孩子们用滚环棍推着铁环，在小路上比赛奔跑。"},{"en":"She found an old hoopstick in the shed and tried rolling a hoop like people did long ago.","zh":"她在棚子里找到一根旧的滚环棍，试着像很久以前的人那样滚铁环。"}]}],"synonyms":["hoop-stick","rolling stick","stick"],"phonetic":"/ˈhupˌstɪk/","extraExplanation":["“Hoopstick”（也常写作 hoop-stick）来自一种在19世纪到20世纪早期较常见的儿童户外游戏：用棍子让一个大圆环持续滚动并控制方向。如今在日常英语中不太常见，更可能出现在历史描写、文学作品或复古语境里。"]}
{"word":"hoopwood","summary":{"en":"Hoopwood is tough, bendable wood used for making hoops (especially barrel hoops), and it can also refer to the tree that provides such wood.","zh":"Hoopwood 指用于制作箍圈（尤其桶箍）的坚韧可弯曲木材，也可指产出这种木材的树（具体物种因地区而异）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"tough, flexible wood traditionally used for making hoops (especially barrel hoops) or bent wooden bands","zh":"（旧时）用来制作箍圈（尤指桶箍）或可弯曲木圈的坚韧木材"},"examples":[{"en":"The cooper used hoopwood to make strong barrel hoops.","zh":"制桶匠用箍木做结实的桶箍。"},{"en":"They steamed the hoopwood so it could bend without cracking.","zh":"他们把箍木蒸软，这样弯曲时就不容易开裂。"}]},{"partOfSpeech":"n.","definition":{"en":"a tree or shrub known for producing wood suitable for hoops (the exact species can vary by region)","zh":"（地域用法不一）指一种以木质坚韧、适合做箍圈而得名的树或灌木"},"examples":[{"en":"Hoopwood grows in this area and is valued for its flexible timber.","zh":"这种箍木树在这一带生长，人们看重它木材的韧性。"}]}],"synonyms":["hoop-wood","withy"],"phonetic":"/ˈhuːpwʊd/","extraExplanation":["“hoopwood”多见于较旧或偏行业的语境（如制桶、木工）。在现代英语里，人们更常直接说“wood for barrel hoops / hoop-making wood”。","作为树名时，“hoopwood”属于俗名（common name），不同国家或地区可能指不同植物；查具体物种通常需要结合当地语境或拉丁学名。"]}
{"word":"hoorah","summary":{"en":"“Hoorah” is an excited shout meaning “Hurray!” and can also mean a celebratory cheer.","zh":"“hoorah”表示兴奋的欢呼（类似“好耶/万岁”），也可作名词指“喝彩/欢呼声”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"used to express strong approval, excitement, or encouragement (like “Hurray!”).","zh":"（感叹词）用来表达强烈的赞同、兴奋或鼓励（类似“万岁！”“好耶！”）。"},"examples":[{"en":"Hoorah! We finally finished the project.","zh":"好耶！我们终于把项目完成了。"},{"en":"The crowd shouted, “Hoorah!” when the team won.","zh":"球队赢了时，人群高喊“万岁！”"}]},{"partOfSpeech":"n.","definition":{"en":"a shout of celebration or approval.","zh":"（名词）欢呼声；喝彩。"},"examples":[{"en":"We heard a loud hoorah from the next room.","zh":"我们听到隔壁房间传来一阵响亮的欢呼。"},{"en":"They gave the speaker a final hoorah at the end of the talk.","zh":"演讲结束时，他们给演讲者最后一阵喝彩。"}]}],"synonyms":["hurray","hooray","hurrah","yay","cheer"],"phonetic":"/hʊˈrɑː/","extraExplanation":["“hoorah/hoo-rah”在美国英语里常见于口语欢呼，也常和军队文化联系在一起（尤其在美国海军陆战队或军队场合中作为鼓劲的呼喊）。拼写也常见变体：hurray / hooray / hurrah。","语气通常热烈、积极；在正式写作中不常用，更适合对话、口号、演讲现场或叙事中表现气氛。"]}
{"word":"hoorahed","summary":{"en":"“hoorahed” is an uncommon/nonstandard past tense of “hoorah,” meaning to shout in celebration.","zh":"“hoorahed”是较少见/不标准的“hoorah”的过去式，意思是欢呼庆祝地高喊。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard spelling) past tense of “hoorah” — to shout “Hoorah!” to show excitement, approval, or celebration.","zh":"（非标准拼写）“hoorah”的过去式——高喊“好耶/万岁！”来表达兴奋、赞同或庆祝。"},"examples":[{"en":"The crowd hoorahed when the team scored.","zh":"球队进球时，人群高声欢呼。"},{"en":"Everyone hoorahed at the end of the show.","zh":"演出结束时，大家都欢呼起来。"}]}],"synonyms":["cheered","applauded","celebrated","shouted","exclaimed"],"phonetic":"hʊˈrɑː","extraExplanation":["“hoorahed”在英语里不算常见或标准的拼写。更常见的是用引号直接写感叹词：They shouted “Hoorah!” 或写作 hoorah’d（带撇号表示省略）。","“hoorah/hooray”都可表示欢呼；日常更常见的是 hooray。军队或口号场景里也常见“Hoorah!”（尤其在美军文化相关文本中），带有“振奋士气”的感觉。","如果你是在写作文或正式文本，建议优先用：cheered / shouted “Hoorah!” / cried “Hooray!” 来避免拼写被当作错误。"]}
{"word":"hoorahing","summary":{"en":"“Hoorahing” means cheering loudly by shouting “hoorah,” or the act of doing so.","zh":"“hoorahing”指大声喊“hoorah！”来欢呼，也可指这种欢呼的行为。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"cheering loudly by shouting “hoorah!” (often to show excitement, approval, or celebration)","zh":"大声欢呼、喊“hoorah！”（常用于表达兴奋、赞同或庆祝）"},"examples":[{"en":"The crowd started hoorahing when the team walked onto the field.","zh":"球队走上球场时，人群开始大声欢呼。"},{"en":"Everyone was hoorahing after she announced the good news.","zh":"她宣布好消息后，大家都在欢呼。"}]},{"partOfSpeech":"n.","definition":{"en":"an act of loud cheering or celebrating (used as a gerund)","zh":"欢呼、喝彩的行为（作动名词使用）"},"examples":[{"en":"All the hoorahing made it hard to hear the speaker.","zh":"大家的欢呼声让人很难听清演讲者的话。"},{"en":"There was a lot of hoorahing and clapping at the end of the show.","zh":"演出结束时有很多欢呼和掌声。"}]}],"synonyms":["cheering","whooping","celebrating","applauding","hurrahing"],"phonetic":"/hʊˈrɑːɪŋ/","extraExplanation":["“hoorah”也常拼作“hurrah / hurray”。在美式英语里，“hoorah”常带一点军队或集体口号的感觉（例如士气高涨时的齐声欢呼）。","写作中，“hoorahing”有时会带轻微的语气色彩：可以是积极的“热烈庆祝”，也可能被用来暗示“过度兴奋、盲目叫好”（取决于上下文）。"]}
{"word":"hoorahs","summary":{"en":"“Hoorahs” means loud cheers or expressions of celebration/approval (plural of “hoorah/hooray”).","zh":"“hoorahs”指多次或一阵阵的欢呼、喝彩，也可泛指庆祝与称赞（为“hoorah/hooray”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"loud shouts of joy, approval, or encouragement (plural of “hoorah/hooray”).","zh":"（表示高兴、赞同或鼓励的）欢呼声；喝彩声（“hoorah/hooray”的复数）。"},"examples":[{"en":"The crowd erupted in hoorahs when the team scored.","zh":"球队得分时，人群爆发出一阵阵欢呼。"},{"en":"Her speech ended with loud hoorahs and applause.","zh":"她的演讲在响亮的欢呼和掌声中结束。"},{"en":"We gave the new coach a few hoorahs to show support.","zh":"我们为新教练喊了几声欢呼以示支持。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) expressions of celebration or praise for an event or achievement.","zh":"（非正式）对某件事或成就的庆祝与称赞之词（可理解为“各种喝彩/欢庆”）。"},"examples":[{"en":"After all the hoorahs, they got back to work.","zh":"一阵欢庆过后，他们又回去继续工作。"},{"en":"The article was full of hoorahs for the company’s success.","zh":"那篇文章充满了对公司成功的称赞之词。"}]}],"synonyms":["cheers","shouts","acclaim","applause","hurrahs"],"phonetic":"/huːˈrɑː/","extraExplanation":["“hoorah/hooray/hurrah”都是表示欢呼的感叹词或名词；拼写不同但语气相近。“hoorah”在美式语境里常见于口语，尤其在军队或团队活动中用来鼓舞士气（如“Give me a hoorah!”）。","复数“hoorahs”通常指“多次欢呼/一阵阵喝彩”，也可引申为“各种庆祝与称赞”。"]}
{"word":"Hooray","summary":{"en":"“Hooray” is an exclamation or cheer used to celebrate or show excitement.","zh":"“Hooray”是表示庆祝或兴奋的感叹词/欢呼声。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show strong happiness, excitement, or approval (like cheering).","zh":"表示强烈的开心、兴奋或赞同（类似欢呼）。"},"examples":[{"en":"Hooray! We won the game!","zh":"好耶！我们赢了比赛！"},{"en":"Hooray for the weekend!","zh":"周末万岁！"}]},{"partOfSpeech":"n.","definition":{"en":"A shout of joy or celebration.","zh":"欢呼声；喝彩声。"},"examples":[{"en":"The crowd let out a loud hooray.","zh":"人群爆发出响亮的欢呼声。"},{"en":"We heard hoorays from the next room.","zh":"我们听到隔壁房间传来阵阵欢呼。"}]}],"synonyms":["yay","hurray","woohoo","cheers"],"phonetic":"/həˈreɪ/","extraExplanation":["“Hooray”常见于庆祝场景（比赛获胜、生日、成功完成任务等）。书面语里有时也写作“hooray!”以加强情绪。","常用搭配：\"Hooray!\"（直接欢呼）；\"Hooray for + 名词\"（为……欢呼，如 Hooray for you! 你真棒/为你欢呼）。"]}
{"word":"hooray","summary":{"en":"“Hooray!” is a cheer that means “I’m very happy/excited!”","zh":"“Hooray!” 是表示“我太开心/太兴奋了！”的欢呼声。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show strong happiness, excitement, or approval (like cheering).","zh":"（感叹词）用于表达强烈的开心、兴奋或赞同（像欢呼一样）。"},"examples":[{"en":"Hooray! We finally finished the project.","zh":"好耶！我们终于完成了这个项目。"},{"en":"The crowd shouted, “Hooray!” when the team won.","zh":"球队获胜时，人群大喊：“万岁／好耶！”"}]}],"synonyms":["yay","hurray","woohoo"],"phonetic":"/hʊˈreɪ/","extraExplanation":["“Hooray!” 常用于口语、儿童读物、庆祝场合（生日、比赛胜利、好消息）。在正式写作里通常会用更中性的表达（如 “We are delighted.”）。","近似中文可根据语境选“好耶！”“太棒了！”“万岁！”；其中“万岁”更偏隆重或口号式，日常更常用“好耶/太好了”。"]}
{"word":"hoorayed","summary":{"en":"“Hoorayed” means “shouted hooray” to celebrate or show excitement (past tense).","zh":"“hoorayed”指“（过去）欢呼、喊‘耶/万岁’来庆祝或表达兴奋”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense of “hooray”) to shout “hooray!” to show happiness, approval, or celebration.","zh":"（“hooray”的过去式）为表达开心、赞同或庆祝而高喊“好耶/万岁/耶！”"},"examples":[{"en":"The kids hoorayed when the teacher announced a surprise game.","zh":"老师宣布有惊喜游戏时，孩子们欢呼起来。"},{"en":"We all hoorayed after she finished the race.","zh":"她跑完比赛后，我们都欢呼了起来。"},{"en":"They hoorayed loudly as the fireworks began.","zh":"烟花开始时，他们大声欢呼。"}]}],"synonyms":["cheered","celebrated","rejoiced","shouted"],"phonetic":"hʊˈreɪd","extraExplanation":["“hooray”常用作感叹词（interjection），直接喊：“Hooray!”；也可以当动词用（to hooray），表示“欢呼”。“hoorayed”就是它的过去式/过去分词。","拼写上也常见“hoorrah/hoorah”，多用于口号式的欢呼；在军队或集体场合里更常见。"]}
{"word":"hooraying","summary":{"en":"“Hooraying” means cheering by shouting “hooray,” often to celebrate something.","zh":"“hooraying”表示喊“好耶/万岁”来欢呼庆祝。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) Shouting or cheering “hooray,” showing excitement, approval, or celebration.","zh":"（非正式）欢呼、喊“好耶/万岁”，用来表达兴奋、赞同或庆祝。"},"examples":[{"en":"The kids were hooraying when the fireworks started.","zh":"烟花开始时，孩子们在欢呼。"},{"en":"Everyone was hooraying after the team won the final game.","zh":"球队赢了最后一场比赛后，大家都在欢呼。"}]},{"partOfSpeech":"other","definition":{"en":"(as an interjection in writing) A stretched/continuous “hooray!” used to show strong excitement.","zh":"（书面作感叹）拉长或持续的“好耶！”用来强调很强的兴奋感。"},"examples":[{"en":"Hooraying all the way home, she couldn’t stop smiling.","zh":"她一路“好耶好耶”地回家，笑个不停。"},{"en":"He posted, “We did it—hooraying!!!”","zh":"他发帖说：“我们做到了——好耶！！！ ”"}]}],"synonyms":["cheering","celebrating","rejoicing","whooping"],"phonetic":"/hʊˈreɪɪŋ/","extraExplanation":["“hooraying”来自感叹词“hooray”的动词化用法，口语和社交媒体中较常见。正式写作里更常用“cheering / celebrating”。另外，“hooray”在美式英语里也常写作“hoorrah”。"]}
{"word":"hoorays","summary":{"en":"“Hooray” is an exclamation used to celebrate or show excitement; “hoorays” is the plural form meaning multiple cheers.","zh":"“hooray”是表示庆祝或兴奋的感叹词；“hoorays”是其复数形式，表示多声欢呼。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A shout used to express excitement, happiness, approval, or celebration.","zh":"（表示兴奋、开心、赞同或庆祝的）欢呼声；好耶！"},"examples":[{"en":"Hooray! We finished the project on time!","zh":"好耶！我们按时完成了项目！"},{"en":"The kids shouted, “Hooray!” when school ended.","zh":"放学时孩子们喊着：“好耶！”"},{"en":"Hooray for the team!","zh":"为这支队伍欢呼！"}]},{"partOfSpeech":"n.","definition":{"en":"A cheer or shout of celebration (the word used as a thing you can count).","zh":"（可数）欢呼；喝彩"},"examples":[{"en":"We heard loud hoorays from the crowd.","zh":"我们听到人群中响亮的欢呼声。"},{"en":"Three hoorays for the birthday girl!","zh":"为寿星欢呼三声！"}]}],"synonyms":["yay","hurray","woohoo","cheer"],"phonetic":"/hʊˈreɪ/","extraExplanation":["“hoorays”是“hooray”的复数形式，常用于描述“多声欢呼”（例如：loud hoorays from the crowd）。","在书面表达里，“Hooray!”常用感叹号表示强烈情绪；也常见固定说法“Three cheers/three hoorays for …”（为……欢呼三声）。"]}
{"word":"hooroo","summary":{"en":"“Hooroo” is an informal Australian/NZ way to say “goodbye” or “see you later.”","zh":"“hooroo”是澳大利亚/新西兰的口语告别语，意思是“再见/回头见”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Australian/NZ informal) Goodbye; see you later.","zh":"（澳大利亚/新西兰口语）再见；回头见。"},"examples":[{"en":"Alright then—hooroo!","zh":"那就这样啦——回头见！"},{"en":"I’ve gotta run. Hooroo, mate!","zh":"我得走了。再见啦，哥们！"},{"en":"She waved and called, “Hooroo!” as she left.","zh":"她离开时挥挥手喊了声：“回头见！”"}]}],"synonyms":["goodbye","bye","see you","see ya","catch you later","ta-ta"],"phonetic":"/hʊˈruː/","extraExplanation":["“hooroo”（也常写作“hoo-roo”）是澳大利亚和新西兰常见的告别语，语气轻松随意，常用于朋友或熟人之间。","带有明显的澳新地域色彩；在正式场合（如商务邮件、正式演讲）不太适用。"]}
{"word":"hooroosh","summary":{"en":"Hooroosh: a given name, commonly a Persian/Iranian name written in Latin letters.","zh":"Hooroosh：人名，常见为波斯语/伊朗名字的拉丁字母转写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (proper noun), often seen as a transliteration of a Persian/Iranian given name. The exact meaning can vary depending on the original spelling in Persian and the person’s preferred romanization.","zh":"人名（专有名词），常见为波斯语/伊朗名字的拉丁字母转写。具体含义会因原本的波斯语拼写以及个人偏好的转写方式而不同。"},"examples":[{"en":"Hooroosh will join the meeting at 3 p.m.","zh":"Hooroosh 下午3点会参加会议。"},{"en":"I’m not sure how to spell Hooroosh—could you text it to me?","zh":"我不确定 Hooroosh 怎么拼——你可以发短信写给我吗？"}]}],"phonetic":"/ˈhʊəˌruːʃ/","extraExplanation":["“hooroosh”更像是人名而不是常见英语词汇。由于波斯语名字转写到英文时常有多种拼法（例如同一个音可能写成 oo/ou/u 等），仅凭这一种拼法很难确定其“字面含义”。","如果你能提供：①这是人名还是地名/品牌名；②来源语言（如 Persian/Farsi）；③是否有原文拼写（波斯字母），我可以更准确地给出读音、含义和常见变体拼写。"]}
{"word":"hoose","summary":{"en":"“Hoose” is a Scots dialect word meaning “a cough” (and sometimes “to cough”), and it can also mean “house/home” in Scots usage.","zh":"“Hoose”是苏格兰方言词，常指“咳嗽”（也可作动词“咳嗽”），在苏格兰用法里也可表示“房子/家”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) A cough, especially a bad or persistent one; also used for certain animal cough illnesses.","zh":"（苏格兰方言）咳嗽，尤指严重或持续的咳嗽；也可指某些动物的咳嗽类疾病。"},"examples":[{"en":"He’s got the hoose again, so he stayed home today.","zh":"他又咳得厉害，所以今天待在家里。"},{"en":"The vet said the calves had the hoose and needed treatment.","zh":"兽医说小牛得了“hoose”（咳嗽病），需要治疗。"}]},{"partOfSpeech":"v.","definition":{"en":"(Scots, dialect) To cough.","zh":"（苏格兰方言）咳嗽。"},"examples":[{"en":"She started to hoose in the cold air.","zh":"她在冷空气里开始咳起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots spelling/pronunciation) A house; a home.","zh":"（苏格兰拼写/读音）房子；家。"},"examples":[{"en":"They walked back to the hoose after work.","zh":"下班后他们走回家。"}]}],"synonyms":["cough","house (Scots use)"],"phonetic":"/hus/","extraExplanation":["“hoose”主要见于苏格兰英语（Scots）或文学/对白中，用来表现地域口音与文化氛围；在标准英语里通常用“cough”表示“咳嗽”，用“house”表示“房子/家”。","如果你本来想查的是“choose”（选择）或“hose”（软管/给……喷水），告诉我上下文句子，我可以帮你确认。"]}
{"word":"hoosegow","summary":{"en":"Hoosegow is an informal, old-fashioned American word for a jail or prison.","zh":"Hoosegow 是美国英语里较旧、较口语的说法，意思是“监狱/看守所”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A jail or prison (informal, old-fashioned).","zh":"监狱；看守所（非正式、较旧式的说法）"},"examples":[{"en":"He spent the night in the hoosegow after a bar fight.","zh":"酒吧打架后，他在看守所里过了一夜。"},{"en":"In old Western movies, the sheriff throws bandits in the hoosegow.","zh":"在老西部电影里，警长把土匪关进“hoosegow”（监狱）。"}]}],"synonyms":["jail","prison","the slammer","the joint","lockup"],"phonetic":"/ˈhuːzɡaʊ/","extraExplanation":["这个词在现代英语里不算常用，更多见于美国口语、老电影（尤其是“西部片”）或带有幽默/怀旧语气的叙述。","词源通常认为来自墨西哥西班牙语 *juzgado*（意为“法庭/审判所”），进入美国英语后发音和拼写逐渐变化，后来用来指“关押人的地方”。"]}
{"word":"hoosegows","summary":{"en":"“Hoosegow” is informal American slang for a jail or prison.","zh":"“hoosegow”是美式非正式俚语，意思是“监狱/看守所”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A jail or prison; a place where people are kept after being arrested.","zh":"（俚语）监狱；看守所；关押被捕者的地方。"},"examples":[{"en":"He spent the night in the hoosegow for disorderly conduct.","zh":"他因为扰乱治安在看守所过了一夜。"},{"en":"The movie ends with the thief landing in the hoosegow.","zh":"电影以小偷被关进监狱作为结尾。"}]}],"synonyms":["jail","prison","lockup","detention center","the slammer"],"phonetic":"/ˈhuːsɡaʊ/","extraExplanation":["“hoosegow”多见于美式口语和旧式西部/警匪题材作品里，语气带点戏谑或粗口味，不适合正式场合（正式说法用 jail / prison / detention center）。","词源常被认为来自西班牙语“juzgado”（意为“法庭、司法机关/看守所”一类的概念），在美国西南部英语中逐渐演变成现在的拼写与读音。"]}
{"word":"hoosgow","summary":{"en":"“Hoosgow” is informal American slang meaning “jail/prison.”","zh":"“hoosgow”是美式口语俚语，意思是“监狱/看守所”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a jail or prison (slang)","zh":"监狱；看守所（俚语）"},"examples":[{"en":"He spent a night in the hoosgow for disorderly conduct.","zh":"他因扰乱治安在看守所里待了一晚。"},{"en":"If you keep driving like that, you’ll end up in the hoosgow.","zh":"你再那样开车，迟早会进局子/进牢里。"}]}],"synonyms":["jail","prison","the slammer","the clink","the joint"],"phonetic":"/ˈhuːsɡaʊ/","extraExplanation":["“hoosgow”是带点老派/口语的美式俚语，语气常见于犯罪题材、老电影或幽默的说法里。正式场合更常用jail（看守所/拘留所）或prison（监狱）。","词源常被认为来自西班牙语“juzgado”（法庭、法院/司法机关），在美国西南部地区的英语口语中逐渐演变成现在的拼写与读音。"]}
{"word":"hoosgows","summary":{"en":"“Hoosgows” means “jails/prisons” in informal, old-fashioned American slang.","zh":"“hoosgows”是非正式、略带老派的美式俚语，意思是“监狱/拘留所”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"jails; prisons (slang, plural of “hoosegow”).","zh":"监狱；拘留所（俚语；“hoosegow”的复数）。"},"examples":[{"en":"In old Western movies, the sheriff throws the outlaw into the hoosegows.","zh":"在老西部电影里，警长把歹徒关进监狱。"},{"en":"He joked that the town had more bars than restaurants—and some of them were hoosegows.","zh":"他开玩笑说这镇上酒吧比餐馆还多——而且有些“bar”其实是监狱。"}]}],"synonyms":["jails","prisons","the slammer","the clink","the big house"],"phonetic":"/ˈhuːsɡaʊ/","extraExplanation":["“hoosegow”是美式英语里的老俚语，常见于西部片、老小说或幽默口吻中。正式场合更常用 jail / prison / detention center。","词源通常认为来自西班牙语“juzgado”（法庭、审判机关），在美国西南地区的语言接触中被英语口语化、音变成“hoosegow”。"]}
{"word":"hoosh","summary":{"en":"“Hoosh” is an informal word for a sudden rushing movement or sound, and it can also mean to hurry someone/something along.","zh":"“Hoosh”是非正式用语，表示突然的“呼地一下”的涌动或声响；也可作动词，表示催促/迅速移动或把人（物）迅速送走。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden rush of movement or sound; a quick, excited surge","zh":"（非正式）突然的冲动/涌动；（人群、车辆等）一下子涌过去的动静"},"examples":[{"en":"There was a hoosh of people as the doors opened.","zh":"门一开，人群一下子涌了出去。"},{"en":"A hoosh of wind swept through the hallway.","zh":"一阵风呼地穿过走廊。"}]},{"partOfSpeech":"v.","definition":{"en":"to move or send something quickly, often with a rushing sound","zh":"（非正式）飞快地移动；迅速把……送/推过去（常带“呼”的一声）"},"examples":[{"en":"She hooshed the kids out of the room before the meeting started.","zh":"会议开始前，她赶紧把孩子们催出了房间。"},{"en":"He hooshed down the stairs to answer the door.","zh":"他飞快地下楼去开门。"}]}],"synonyms":["rush","whoosh","dash","hurry","shoo"],"phonetic":"/hʊʃ/","extraExplanation":["“hoosh”多见于英式英语的非正式表达，带有拟声感，强调“呼——一下子过去”的速度与动静。写作中常用来营造人群涌动、风声掠过等画面。"]}
{"word":"Hoosier","summary":{"en":"a person from Indiana; also an adjective meaning ‘of Indiana’","zh":"指印第安纳州人；也可作形容词表示“印第安纳州的”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. state of Indiana; a resident of Indiana","zh":"（美国）印第安纳州人；印第安纳州居民"},"examples":[{"en":"She’s a proud Hoosier who grew up near Indianapolis.","zh":"她是个自豪的印第安纳州人，在印第安纳波利斯附近长大。"},{"en":"Many Hoosiers travel to watch the college basketball tournament.","zh":"很多印第安纳州人会出行去看大学篮球锦标赛。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Indiana or its people","zh":"印第安纳州的；印第安纳州人的"},"examples":[{"en":"Hoosier traditions often include high school basketball culture.","zh":"印第安纳州的传统常常包括浓厚的高中篮球文化。"},{"en":"He makes Hoosier-style tenderloin sandwiches.","zh":"他做印第安纳风味的炸猪排三明治。"}]},{"partOfSpeech":"n.","definition":{"en":"(dated, sometimes offensive) an unsophisticated or rural person, especially from the Midwest","zh":"（过时，且有时带冒犯）乡巴佬；土气的人（尤指美国中西部）"},"examples":[{"en":"Today, using “Hoosier” to mean “a bumpkin” can sound rude or old-fashioned.","zh":"如今把“Hoosier”用作“乡巴佬”的意思，听起来可能很无礼或很老派。"}]}],"synonyms":["Indianan","Indiana resident","Indiana native","bumpkin","yokel","hick"],"phonetic":"ˈhuːʒər","extraExplanation":["在美国文化里，“Hoosier”最常见、最中性的用法就是“印第安纳州人”，常带有地方认同感。","你可能会在体育中见到它：Indiana University 的队名是 “Hoosiers”。","注意语气：把它当作“印第安纳州人”通常没问题；用来表示“土气的人”则偏贬义、也较过时，尽量避免。"],"etymology":"词源不确定。19世纪初开始用来指印第安纳州人；关于来源有多种民间说法（如口音、俚语演变等），但没有公认的单一解释。","mnemonic":["联想读音：/ˈhuːʒər/ 像“胡适儿/胡老师”（谐音记法），记成“印第安纳州的人”。","把它和球队/校队联系：看到 “Hoosiers” 就想到“印第安纳（Indiana）”。"]}
{"word":"hoosier","summary":{"en":"“Hoosier” most commonly means a person from Indiana (or relating to Indiana).","zh":"“Hoosier”最常见的意思是“印第安纳州人”（或“与印州有关的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. state of Indiana; an Indiana resident (the official nickname/demonym).","zh":"印第安纳州人；印州居民（官方昵称/称谓）。"},"examples":[{"en":"She’s a Hoosier born and raised in Indianapolis.","zh":"她是土生土长的印第安纳州人，出生并成长于印第安纳波利斯。"},{"en":"Many Hoosiers are passionate about basketball.","zh":"很多印第安纳州人都非常热爱篮球。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Indiana or its people, culture, or institutions.","zh":"与印第安纳州（及其人民、文化、机构）有关的。"},"examples":[{"en":"They drove to a Hoosier bakery for fresh bread.","zh":"他们开车去一家印第安纳本地的面包店买新鲜面包。"},{"en":"He studies at Indiana University, the Hoosier State’s largest university.","zh":"他就读于印第安纳大学，这是“印州（Hoosier State）”规模最大的大学。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes informal, and can sound old-fashioned or rude) a rustic or unsophisticated person.","zh":"（有时为非正式用法，可能显得过时或带贬义）乡下人；不太“时髦/不够世故”的人。"},"examples":[{"en":"In older writing, “hoosier” was sometimes used to mean a backwoods person.","zh":"在较早的文字里，“hoosier”有时被用来指“山野乡下人”。"},{"en":"Be careful with this meaning—it can offend people.","zh":"使用这个含义要谨慎——可能会冒犯他人。"}]}],"synonyms":["Indianan","Indiana resident","from Indiana"],"phonetic":"/ˈhuːʒər/","extraExplanation":["“Hoosier”最常见、最安全的用法是指“印第安纳州人”。印第安纳州也常被称为“The Hoosier State（印州）”。","词源没有定论：有多种民间说法与历史解释，但没有一个被学界一致认可。","在体育与校园文化中很常见：例如印第安纳大学的队名是“IU Hoosiers”。","少数情况下它也曾被当作“乡下人/粗鄙之人”的称呼；在现代语境里更容易被理解为对印州人的自称或中性称谓。"]}
{"word":"hoosierdom","summary":{"en":"Hoosierdom means the identity or culture of people from Indiana.","zh":"Hoosierdom 指印第安纳州人的身份认同或印第安纳文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being a Hoosier (a person from Indiana), or the culture, identity, and way of life associated with Indiana","zh":"“胡希尔人”（印第安纳州人）的身份；或与印第安纳州相关的文化、认同与生活方式"},"examples":[{"en":"She writes essays about hoosierdom—small-town basketball, county fairs, and Indiana manners.","zh":"她写随笔谈“印第安纳气质”——小镇篮球、县集市，以及印第安纳人的礼数。"},{"en":"Moving away made him appreciate hoosierdom more than he expected.","zh":"搬离家乡后，他比想象中更珍惜那份“印第安纳人的归属感”。"}]}],"synonyms":["Indiana identity","Hoosier culture","Indiana life","local Indiana culture"],"phonetic":"/ˈhuːʒərdəm/","extraExplanation":["“Hoosier”是印第安纳州人的常见称呼，“-dom”表示“……的领域/状态/身份”（如 kingdom、freedom）。因此 hoosierdom 常用于较带文学或评论色彩的语境，指一种地方身份与文化氛围，而不只是地理出生地。","这个词多见于写作、新闻评论或文化讨论中，口语里人们更常直接说 Hoosier culture / Indiana identity。"]}
{"word":"hoosierese","summary":{"en":"Hoosierese means the informal Indiana style of English—its accent and local words.","zh":"Hoosierese 指印第安纳州（Hoosier 州）常见的英语口音与本地用语（非正式说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) The English dialect, accent, and local expressions associated with Indiana (the “Hoosier” state) and its people.","zh":"（非正式）与美国印第安纳州（“Hoosier 州”）及其居民相关的英语方言、口音和本地用语。"},"examples":[{"en":"Some of the characters speak Hoosierese, so the dialogue feels very Midwestern.","zh":"有些角色说“Hoosierese”，所以对白听起来很有美国中西部的感觉。"},{"en":"If you’re not from Indiana, a few Hoosierese phrases might sound unusual at first.","zh":"如果你不是印第安纳人，一些“Hoosierese”的说法一开始可能会觉得怪怪的。"}]}],"synonyms":["Indiana English","Hoosier dialect","Indiana accent"],"phonetic":"/ˌhuːʒɚˈiːz/","extraExplanation":["“Hoosierese”通常带有玩笑、亲切的语气，用来指印第安纳州人常见的口音或说法；它不是严格的语言学术语。","“Hoosier”是印第安纳州人的昵称，因此“Hoosierese”就像把“Hoosier + -ese”（类似“Chinese / Japanese”里的“-ese”）拼起来，表示“某地人的说话方式”。在正式写作里更常见的说法是“Indiana English”或“Indiana dialect”。"]}
{"word":"hoosierize","summary":{"en":"Hoosierize means to make something more Indiana/Hoosier in character or style.","zh":"Hoosierize 指让某事物更具印第安纳州（Hoosier）特色或风格。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something or someone more like a Hoosier (an Indiana person), especially in style, culture, or language; to give an “Indiana/Hoosier” character to","zh":"使……更像“Hoosier（印第安纳州人）”；让……带有印第安纳/Hoosier 的风格、文化或语言特色"},"examples":[{"en":"The campaign tried to hoosierize its message by adding local Indiana references.","zh":"这场竞选试图通过加入印第安纳本地梗来“Hoosier 化”它的信息。"},{"en":"After living in Bloomington for a few years, he joked that his accent had been hoosierized.","zh":"在布卢明顿住了几年后，他开玩笑说自己的口音已经被“Hoosier 化”了。"},{"en":"The restaurant hoosierized the menu with tenderloin sandwiches and sugar cream pie.","zh":"这家餐馆在菜单里加入炸猪排三明治和糖奶油派，让菜单更“Hoosier 化”。"}]}],"synonyms":["Indiana-ize","localize","Americanize (context-dependent)"],"phonetic":"/ˈhuːʒəˌraɪz/","extraExplanation":["“Hoosier”是美国印第安纳州居民的常用称呼（类似 Texan、New Yorker）。因此 hoosierize 多用于幽默或带有地方色彩的语境，表示“让某事更具印第安纳味儿/更像本地人”。","在不同语境里，hoosierize 有时也可能被用来表达“变得更朴实、接地气、偏小地方风格”的感觉，但这种语感取决于说话者态度与场合。"]}
{"word":"Hoosiers","summary":{"en":"people from Indiana; also the name used for Indiana University teams","zh":"印第安纳州人；也指印第安纳大学运动队的队名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from the U.S. state of Indiana; residents or natives of Indiana.","zh":"（美国）印第安纳州人；印州居民/本地人。"},"examples":[{"en":"She’s a Hoosier, born and raised in Indianapolis.","zh":"她是印第安纳州人，在印第安纳波利斯出生长大。"},{"en":"Many Hoosiers travel to the Indianapolis 500 every year.","zh":"很多印州人每年都会去看印第500英里赛车。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname for Indiana University sports teams (especially in college athletics).","zh":"印第安纳大学运动队的昵称（尤其指大学体育赛事中的队名）。"},"examples":[{"en":"The Hoosiers play their home games in Bloomington.","zh":"印第安纳大学队在布卢明顿打主场比赛。"},{"en":"He’s been a Hoosiers basketball fan since childhood.","zh":"他从小就是印大篮球队的球迷。"}]}],"synonyms":["Indianans","Indiana residents","Indiana University","IU"],"phonetic":"/ˈhuːʒər/","extraExplanation":["文化提示：在美国，“Hoosier”通常是中性、带点地方自豪感的称呼（类似“德州人 Texans”）。在体育语境里，常特指印第安纳大学（Indiana University）的队名。"],"etymology":"“Hoosier”作为印第安纳州人的称呼最晚在19世纪早期就已出现，但确切来源至今不确定；常见说法很多（如方言、姓名、口语问候语等），没有公认定论。","mnemonic":["把它联想成“Who’s here?”（谁在这儿？）的口语玩笑：在这儿的就是“Hoosiers”（印州人）。","记忆点：Indiana = Hoosiers（州别称/绰号），类似 New York = New Yorkers。"]}
{"word":"hoosiers","summary":{"en":"“Hoosiers” most commonly means people from Indiana, and it can also refer to Indiana sports teams (especially Indiana University).","zh":"“Hoosiers”最常指印第安纳州人，也可指印第安纳州的运动队昵称（尤指印第安纳大学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from the U.S. state of Indiana; residents or natives of Indiana.","zh":"（美国）印第安纳州人；印第安纳州居民/本地人。"},"examples":[{"en":"My grandparents are Hoosiers—they grew up in Indianapolis.","zh":"我的祖父母是印第安纳州人——他们在印第安纳波利斯长大。"},{"en":"The conference brought together Hoosiers from across the state.","zh":"这次会议把来自全州各地的印第安纳州人聚到了一起。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname used for Indiana sports teams or institutions, especially Indiana University teams (often “the Hoosiers”).","zh":"（尤指印第安纳大学等的）运动队昵称，常说“the Hoosiers”。"},"examples":[{"en":"The Hoosiers play their home games in Bloomington.","zh":"“胡希尔队”（印第安纳大学队）在布卢明顿打主场比赛。"},{"en":"She’s a lifelong Hoosiers fan.","zh":"她是一位终身的“胡希尔队”球迷。"}]}],"synonyms":["Indianans","Indiana residents","people from Indiana"],"phonetic":"/ˈhuːʒərz/","extraExplanation":["“Hoosier”是印第安纳州的官方昵称之一，但它的确切来源并不确定；常见说法包括来自方言、姓氏或早期边境口语等，多为民间解释，没有一致定论。","在美国文化中，电影《Hoosiers》（1986）讲述印第安纳州高中篮球的故事，让这个词在体育语境里更广为人知。"]}
{"word":"hoot","summary":{"en":"Hoot means to make or hear a loud short sound (horn/owl), or to laugh loudly; it can also mean the sound itself.","zh":"Hoot 指发出/听到响亮短促的声音（喇叭/猫头鹰），也可指大笑起哄；还可作名词指这种声音。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a loud, short sound (often with a horn, a shout, or an owl’s call)","zh":"发出响亮短促的声音（常指喇叭声、喊叫声或猫头鹰叫声）"},"examples":[{"en":"A car hooted behind us, so we moved to the side.","zh":"我们身后有车按喇叭（鸣笛），所以我们让到一边。"},{"en":"We heard an owl hoot in the trees at night.","zh":"夜里我们听到树林里猫头鹰在叫。"}]},{"partOfSpeech":"v.","definition":{"en":"to laugh or shout loudly to show amusement","zh":"（因觉得好笑而）大笑；大声起哄"},"examples":[{"en":"Everyone hooted with laughter at his joke.","zh":"大家听了他的笑话都笑得大叫起来。"},{"en":"Some people hooted and cheered during the show.","zh":"演出时有些人大声起哄并欢呼。"}]},{"partOfSpeech":"n.","definition":{"en":"a loud, short sound, especially a horn blast or an owl’s call","zh":"响亮短促的声音（尤指喇叭声或猫头鹰叫声）"},"examples":[{"en":"I heard a hoot from the street and looked out the window.","zh":"我听到街上传来一声喇叭响，就往窗外看。"},{"en":"The hoot of an owl echoed across the field.","zh":"猫头鹰的叫声在田野上回荡。"}]}],"synonyms":["honk","blare","hoot (owl call)","guffaw","jeer"],"phonetic":"/hut/","extraExplanation":["“hoot”最常见的两个语境：①交通中“按喇叭/鸣笛”（to hoot the horn）；②夜里猫头鹰“咕咕叫”。","口语里“hoot”也常和笑有关：hoot with laughter（哄笑）。另外有个常见表达“not give a hoot”（一点也不在乎），属于较口语、带点不客气的说法。"]}
{"word":"hootay","summary":{"en":"“Hootay” is not standard English; it’s usually a name/handle or a misspelling of another word (often “hooray” or “hooty”).","zh":"“hootay”不是标准英语词；多为名字/网名，或是其他词（常见如“hooray”“hooty”）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as a personal name, brand/user name, or a playful invented spelling (often confused with “hooray” or “hooty”).","zh":"不是标准英语单词；多见于人名、品牌/网名，或一种随意自造的拼写（常被误写/误读为“hooray（好耶）”或“hooty（像猫头鹰的；很吵闹的）”）。"},"examples":[{"en":"I couldn’t find “hootay” in a dictionary—what context did you see it in?","zh":"我在词典里找不到“hootay”——你是在哪里看到这个词的？"},{"en":"Hootay is my cat’s name, so I write it with a capital H.","zh":"Hootay是我家猫的名字，所以我会把H大写。"}]}],"phonetic":"/ˈhuːteɪ/","extraExplanation":["“hootay”不是常见、规范的英语拼写。如果你想表达“好耶/欢呼”，更常用的是“hooray”。如果你想表达“像猫头鹰一样的/吵闹的”，可能是在找“hooty”。把原句（前后各3–5个词）发我，我可以帮你判断它到底想表达什么。"]}
{"word":"hootch","summary":{"en":"Hootch is informal American English for strong liquor (often homemade/illegal), and it can also mean a small hut or temporary shelter in older slang.","zh":"Hootch 是美式非正式用语，常指烈性酒（多为私酿或非法酒）；在较旧的俚语中也可指简陋的小屋或临时棚屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) Strong alcoholic liquor, often homemade or illegal.","zh":"（非正式）烈性酒，常指私酿或非法酿造的酒。"},"examples":[{"en":"During Prohibition, some people made hootch in hidden sheds.","zh":"在美国禁酒令时期，有些人在隐蔽的小棚里私酿烈酒。"},{"en":"He joked that the punch tasted like hootch.","zh":"他开玩笑说这杯潘趣酒喝起来像烈酒。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, historical) A small hut or temporary shelter; a shack.","zh":"（俚语，历史用法）小屋；临时棚屋；简陋的棚舍。"},"examples":[{"en":"They slept in a hootch near the airfield.","zh":"他们在机场附近的一间简易棚屋里睡觉。"},{"en":"The soldiers built a hootch out of scrap wood.","zh":"士兵们用废木料搭了个临时棚屋。"}]}],"synonyms":["hooch","moonshine","bootleg liquor","hard liquor","shack","hut"],"phonetic":"/hutʃ/","extraExplanation":["“hootch”常见于美式口语。“酒”的意思里，有时也写作“hooch”。在中文里可理解为“烈酒/私酒/土酒”。","关于来源：很多资料认为它与“hoochinoo”有关——这是一种在阿拉斯加一带流行的烈酒名称，后来在英语中被缩短为“hooch/hootch”。","“棚屋”的意思常出现在军事语境（尤其是越战相关口述）中，指士兵临时搭建的住所。"]}
{"word":"hootches","summary":{"en":"“Hootches” is the plural of “hooch,” meaning either illicit/homemade liquor or a small rough hut (often military).","zh":"“hootches”是“hooch”的复数，可指私酒/自酿烈酒，也可指简陋小屋（常见于军语中的临时营房）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) Strong alcohol, especially homemade or illegally produced liquor.","zh":"（俚语）烈酒，尤指自酿或非法酿造的酒（私酒）。"},"examples":[{"en":"They were caught selling hooch out of the garage.","zh":"他们被抓到在车库里卖私酒。"},{"en":"During Prohibition, people secretly drank hooch at parties.","zh":"在禁酒令时期，人们在聚会上偷偷喝私酒。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A small, rough shelter or hut; in military use, a temporary hut or barracks.","zh":"（非正式）简陋的小屋、棚屋；（军语）临时营房。"},"examples":[{"en":"The soldiers slept in a hooch near the river.","zh":"士兵们睡在河边的一间临时营房里。"},{"en":"They built a small hooch to stay dry during the storm.","zh":"他们搭了个简陋的小棚子躲雨。"}]}],"synonyms":["moonshine","bootleg liquor","homebrew","hut","shack"],"phonetic":"/hutʃ/","extraExplanation":["“hooch”是口语/俚语，用来指私酒或烈酒时很常见；在美国语境里常让人联想到1920年代的“禁酒令（Prohibition）”时期。","“hootches”是复数形式（one hooch, two hootches）。在部分语境里也可见拼写变体“hootch”。"]}
{"word":"hooted","summary":{"en":"“Hooted” means “made a hooting sound” (like an owl or horn) or “shouted/laughed loudly in mockery.”","zh":"“hooted”表示“发出像猫头鹰或喇叭那样的叫声/鸣响”，也可表示“起哄嘲笑地大声喊或笑”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “hoot”: to make a loud short sound like an owl, a horn, or a whistle.","zh":"“hoot”的过去式和过去分词：发出像猫头鹰叫声、喇叭声或口哨那样的短促响亮声音。"},"examples":[{"en":"An owl hooted in the distance.","zh":"远处有一只猫头鹰在叫。"},{"en":"The driver hooted to warn the cyclist.","zh":"司机按喇叭提醒骑自行车的人。"},{"en":"The crowd hooted as the referee walked off the field.","zh":"裁判走下场时，观众发出嘘声/起哄声。"}]},{"partOfSpeech":"v.","definition":{"en":"(of people) to shout or laugh loudly in a mocking or disrespectful way.","zh":"（指人）大声起哄、嘲笑或用不尊重的方式喊叫。"},"examples":[{"en":"Some students hooted at his mistake.","zh":"一些学生对他的错误起哄嘲笑。"},{"en":"They hooted with laughter at the joke.","zh":"他们听到那个笑话大声笑闹。"}]}],"synonyms":["honked","blew (a horn)","howled","jeered","mocked"],"phonetic":"/ˈhuːtɪd/","extraExplanation":["“hoot”最常见的联想有三种：①猫头鹰的叫声（自然场景里常用）；②汽车“按喇叭”（美式英语里也常说 honk，但 hoot 依然常见）；③人群对某人“起哄/喝倒彩”，带有嘲讽或不礼貌的语气。遇到语境是观众、同学、路人时，往往是第③种意思。"]}
{"word":"hootenannies","summary":{"en":"Hootenannies are informal folk-music sing-along gatherings, or more broadly any lively get-together.","zh":"Hootenannies 指非正式的民谣弹唱合唱聚会，也可泛指热闹的聚会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal gathering where people sing and play folk or country music (often with audience participation)","zh":"（常指大家一起参与的）民谣/乡村音乐聚会、即兴音乐晚会"},"examples":[{"en":"They hosted a backyard hootenanny with guitars, banjos, and sing-alongs.","zh":"他们在后院办了一场 hootenanny，有吉他、班卓琴，大家一起合唱。"},{"en":"The camp ended with a hootenanny around the fire.","zh":"夏令营在篝火旁的一场 hootenanny 中结束。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, a lively party or get-together","zh":"（更泛指）热闹的派对、聚会"},"examples":[{"en":"After the show, the cast threw a little hootenanny backstage.","zh":"演出后，演员们在后台办了个热闹的小聚会。"}]}],"synonyms":["sing-along","jam session","folk-music gathering","party","get-together"],"phonetic":"/ˈhuːtənæni/","extraExplanation":["“Hootenanny”主要是美国英语里的口语词，常让人联想到20世纪中期的美国民谣复兴（folk revival），以及大家围坐一起弹唱、点歌、合唱的氛围。","词形上你输入的“hootenannies”是复数形式；单数是“a hootenanny”。"]}
{"word":"hootenanny","summary":{"en":"A casual folk-music sing-along party.","zh":"带民谣/乡村音乐的轻松合唱聚会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An informal party or gathering where people play folk or country music and often sing together.","zh":"一种非正式的聚会（常见于美国乡村/民谣文化），人们会一起演奏民谣或乡村音乐并合唱。"},"examples":[{"en":"They hosted a hootenanny in the backyard with guitars and harmonicas.","zh":"他们在后院办了一个 hootenanny，大家带着吉他和口琴一起玩。"},{"en":"After dinner, the family turned the living room into a little hootenanny.","zh":"晚饭后，全家把客厅变成了一个小型 hootenanny。"}]}],"synonyms":["folk-music jam","jam session","sing-along","get-together"],"phonetic":"/ˌhuːtəˈnæni/","extraExplanation":["“hootenanny”多与美国民谣/乡村音乐文化相关，常让人联想到大家围坐、轮流弹唱的轻松氛围。","词源不完全确定，但在20世纪中期（尤其是美国民谣复兴时期）变得很流行；它听起来俏皮，带一点乡土、热闹的感觉。","在现代口语里有时也可泛指“热闹的聚会/活动”，但最典型的语境仍是带音乐表演的民谣式聚会。"]}
{"word":"hooter","summary":{"en":"Hooter usually means a loud horn or siren; informally, it can also mean a person’s nose.","zh":"“Hooter”通常指（车辆等的）喇叭/汽笛/警报器；在非正式俚语中也可指人的鼻子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a horn, siren, or other loud warning device (especially on a vehicle)","zh":"（尤指车辆上的）喇叭；汽笛；警报器"},"examples":[{"en":"A truck blared its hooter and everyone jumped back.","zh":"一辆卡车猛按喇叭，大家都吓得往后退。"},{"en":"If you hear the factory hooter, the shift is over.","zh":"如果你听到工厂的汽笛声，就说明这班结束了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal slang) a person’s nose","zh":"（非正式俚语）鼻子"},"examples":[{"en":"He broke his hooter playing basketball.","zh":"他打篮球时把鼻子撞坏了。"},{"en":"It’s cold—my hooter is turning red.","zh":"太冷了——我鼻子都冻红了。"}]}],"synonyms":["horn","siren","klaxon","nose"],"phonetic":"/ˈhuːtər/","extraExplanation":["“hooter”来自动词“hoot”（发出‘嘟嘟/鸣叫’的声音）。用来指“喇叭/汽笛”时比较口语化，英美都能理解，但在正式写作里更常用“horn/siren”。","“hooter = 鼻子”属于俚语，带一点玩笑或调侃语气；对不熟的人这样说可能显得不礼貌。","“Hooters”也是美国一家连锁餐厅的名字（以猫头鹰为标志，主打运动酒吧风格）。它属于文化专有名词，和“hooter”这个普通名词的日常用法不完全相同。"]}
{"word":"hooters","summary":{"en":"“Hooters” most commonly refers to a U.S. restaurant chain; it can also be slang for breasts or mean loud hooting sounds.","zh":"“Hooters”最常见是美国连锁餐厅名；也可作俚语指胸部，或表示呼呼的鸣叫/喇叭声等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A casual restaurant chain in the U.S. known for chicken wings, sports-bar atmosphere, and waitstaff uniforms; also the name of these restaurants.","zh":"（美国）“Hooters”连锁餐厅的名称，以鸡翅、运动酒吧氛围和服务员制服而出名；也可指这些餐厅本身。"},"examples":[{"en":"We watched the game at Hooters and ordered wings.","zh":"我们在Hooters看比赛，还点了鸡翅。"},{"en":"There’s a Hooters near the highway exit.","zh":"高速出口附近有一家Hooters。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, slang) Breasts (often used in a joking or sexual way).","zh":"（非正式俚语）胸部/乳房（常带玩笑或性暗示语气）。"},"examples":[{"en":"That word can be rude—some people use “hooters” to mean breasts.","zh":"这个词可能很冒犯——有些人用“hooters”指胸部。"},{"en":"In professional settings, avoid slang like “hooters.”","zh":"在正式场合，避免使用像“hooters”这样的俚语。"}]},{"partOfSpeech":"n.","definition":{"en":"Loud hooting sounds (for example, from owls or car horns).","zh":"“呼呼/鸣叫”的声音（例如猫头鹰叫声或汽车喇叭声）。"},"examples":[{"en":"We heard hooters in the woods at night.","zh":"晚上我们在树林里听到了（猫头鹰的）鸣叫声。"},{"en":"The street was full of hooters and traffic noise.","zh":"街上满是喇叭声和车流噪音。"}]}],"synonyms":["(restaurant) sports bar","(slang) boobs","(sounds) hoots"],"phonetic":"ˈhuːtərz","extraExplanation":["“Hooters”最常见的文化指向是美国餐厅品牌。品牌名利用了英语里“hooter(s)”的双关：既可联想到猫头鹰的叫声（以及店里的猫头鹰标志），也可能让人联想到俚语含义（胸部）。因此在跨文化或正式场合使用时，要注意语境与听众感受。"]}
{"word":"hootier","summary":{"en":"“Hootier” means “more hooty”: more owl-like/filled with hooting sounds, or (informally) even funnier/more entertaining.","zh":"“Hootier”意为“更 hooty”：更像猫头鹰叫声/更常有咕咕声；也可在口语中表示“更好笑、更有趣”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “hooty”: making more hooting sounds, or sounding more like an owl.","zh":"“hooty”的比较级：更会发出“hoot（猫头鹰叫声）”的声音；更像猫头鹰的叫声。"},"examples":[{"en":"As dusk fell, the forest grew hootier, and we heard owls calling from different trees.","zh":"黄昏降临后，森林里更“猫头鹰声不断”，我们听到不同树上都有猫头鹰在叫。"},{"en":"That old door sounded hootier than a squeak when the wind hit it.","zh":"风一吹，那扇旧门的声音比“吱呀”更像“咕咕的猫头鹰叫”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, playful) More amusing or more fun; “more of a hoot.”","zh":"（非正式、俏皮）更好笑、更有趣；“更逗”。"},"examples":[{"en":"The second episode is even hootier than the first.","zh":"第二集比第一集更逗。"},{"en":"Her stories get hootier every time she tells them.","zh":"她每次讲故事都更好笑。"}]}],"synonyms":["more owl-like","more hooting","funnier","more amusing"],"phonetic":"/ˈhuːtiər/","extraExplanation":["“hootier”本质上是形容词“hooty”的比较级，但在真实语料里并不算常见。更常见的说法是用“more hooty”，或在“好笑”这个意思上直接说“funnier / more amusing”。","“a hoot”是常见口语，意思是“很好笑/很有意思的人或事”。所以有时人们会用“hooty/hootier”来做一种俏皮的延伸，但更偏口语创造、语气轻松。"]}
{"word":"hootiest","summary":{"en":"“Hootiest” most commonly means “the funniest/most entertaining” in informal English; less commonly, it can mean “most owl-like.”","zh":"“hootiest”最常见的意思是（口语）“最搞笑、最有趣”；较少见时也可指“最像猫头鹰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) The funniest or most entertaining; causing the most laughter.","zh":"（非正式）最搞笑的；最有娱乐性的；最让人发笑的。"},"examples":[{"en":"That was the hootiest story I’ve heard all week.","zh":"那是我这周听过最搞笑的故事。"},{"en":"Her comments were the hootiest part of the meeting.","zh":"她的评论是会议里最有趣的部分。"},{"en":"We watched the hootiest video and couldn’t stop laughing.","zh":"我们看了最逗的视频，笑得停不下来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) Most like an owl in sound or appearance (from “hooty”).","zh":"（较少见）最像猫头鹰的（指叫声或外观；源自 hooty）。"},"examples":[{"en":"In the dark forest, the hootiest calls came from the tallest trees.","zh":"在黑暗的森林里，最像猫头鹰的叫声来自最高的树。"},{"en":"The costume’s hootiest feature was the big round eyes.","zh":"那套服装最“猫头鹰味”的特点是那双大圆眼。"}]}],"synonyms":["funniest","most hilarious","most amusing","most entertaining"],"phonetic":"/ˈhuːtiəst/","extraExplanation":["“hootiest”通常来自口语表达“a hoot”（很搞笑、很有意思），因此多用于轻松随意的语境。","如果你是在社交媒体或朋友聊天里看到它，基本都等同于“funniest / most hilarious”。正式写作中更常用这些标准词。"]}
{"word":"hooting","summary":{"en":"Hooting means loud owl-like calls, or loud laughter/jeering; it can be a noun (the sound) or the present participle of “hoot.”","zh":"Hooting 指像猫头鹰一样的鸣叫声，也可指大笑或起哄/嘲弄；可作名词（声音）或作“hoot”的现在分词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or sound of making a loud, short call or shout, often like an owl; also used for loud laughter or jeering","zh":"（像猫头鹰一样的）嗥叫/鸣叫声；也可指大声的笑声或起哄、嘘声"},"examples":[{"en":"We heard hooting in the trees and realized an owl was nearby.","zh":"我们听到树上传来“嗥嗥”的叫声，才意识到附近有一只猫头鹰。"},{"en":"His joke was followed by hooting from the back of the room.","zh":"他讲完笑话，教室后排传来一阵大笑和起哄声。"},{"en":"The speaker was interrupted by hooting and boos.","zh":"演讲者被起哄声和嘘声打断了。"}]},{"partOfSpeech":"v.","definition":{"en":"making a loud call (like an owl), or shouting/laughing loudly (present participle of “hoot”)","zh":"（发出嗥叫/鸣叫声）或（大声喊叫/大笑/起哄）；“hoot”的现在分词"},"examples":[{"en":"An owl was hooting outside my window all night.","zh":"一只猫头鹰整晚在我窗外鸣叫。"},{"en":"The kids came out of the cinema hooting with laughter.","zh":"孩子们从电影院出来时笑得前仰后合。"},{"en":"Some fans started hooting when the referee made the call.","zh":"裁判做出判罚时，一些球迷开始起哄。"}]}],"synonyms":["hooting laughter","jeering","mocking","booing","owl calls"],"phonetic":"/ˈhuːtɪŋ/","extraExplanation":["“Hooting”来自动词“hoot”。它既可以是名词（指那种声音/一阵笑或嘲弄），也可以是动词的现在分词（描述正在发生的动作）。","在体育比赛或演讲场合里，hooting 常带有“不尊重、嘲笑”的意味，接近 jeering / heckling；而在自然语境中更中性，常指猫头鹰的叫声。"]}
{"word":"hootingly","summary":{"en":"Hootingly means “with hoots”—either loud, mocking laughter or a sound like an owl’s hoot.","zh":"hootingly 指“带着hoot的声音”，可指喧闹/带嘲讽的哄笑，也可指类似猫头鹰的咕咕叫声。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that involves hoots (loud cries or bursts of laughter), often showing amusement or mockery","zh":"以“叫嚷/哄笑（hoot）”的方式；常带有取笑或嘲笑的意味"},"examples":[{"en":"The audience laughed hootingly at the comedian’s story.","zh":"观众对喜剧演员的故事哄笑不止。"},{"en":"Some kids jeered hootingly as he walked past.","zh":"他走过时，有些孩子起哄般地嘲笑。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a way that sounds like an owl’s hoot (a long, low call)","zh":"以猫头鹰般的“咕咕叫”声；发出类似猫头鹰的叫声"},"examples":[{"en":"In the dark woods, an owl called hootingly from a high branch.","zh":"在漆黑的树林里，一只猫头鹰在高高的树枝上咕咕地叫着。"}]}],"synonyms":["uproariously","loudly","derisively","mockingly"],"phonetic":"/ˈhuːtɪŋli/","extraExplanation":["“hootingly”比较少见，多用于描写笑声或起哄的声音（带点喧闹、夸张的感觉）。更常见的表达是“laughed loudly / laughed uproariously / laughed derisively”。","词形来源：hoot（叫喊/哄笑/猫头鹰叫）+ -ingly（表示“以……方式”）。"]}
{"word":"hootmalalie","summary":{"en":"Hootmalalie means a noisy fuss or commotion, often over something small.","zh":"hootmalalie 指一阵喧闹或大惊小怪的骚动，常带“事情不大却闹很大”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loud fuss or commotion; a lot of excited talk or activity about something (often more than it deserves)","zh":"喧闹；小题大做的骚动；大惊小怪（常指事情没那么严重却闹得很大）"},"examples":[{"en":"There was a big hootmalalie in the office over a tiny mistake.","zh":"办公室里为一个小错误闹得沸沸扬扬。"},{"en":"Don’t make a hootmalalie about it—we can fix it easily.","zh":"别为这事大惊小怪——很容易就能解决。"}]}],"synonyms":["fuss","commotion","hullabaloo","to-do","uproar"],"phonetic":"/ˌhuːt ˌmælˈɑːli/","extraExplanation":["这是一个较少见、偏口语/带点幽默感的词，在南非英语里更常见，也带有旧式（old-fashioned）的感觉。","含义接近更常见的 hullabaloo / commotion / fuss（“一阵喧闹、折腾”）。在正式写作中不常用，更适合用在对话或轻松语境里。"]}
{"word":"hoots","summary":{"en":"Hoots are loud calls or laughs (and owl sounds), or it means “makes a loud sound” like shouting or honking.","zh":"hoots 可指大声呼喊/大笑（也可指猫头鹰叫声）；作动词表示“发出大声声音”，如喊叫或按喇叭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) loud cries or calls; the sound made by an owl; sometimes a loud laugh.","zh":"（名词复数）大声的叫喊/呼喊；猫头鹰的叫声；有时也指一阵大笑声。"},"examples":[{"en":"We heard hoots from the crowd when the band came on stage.","zh":"乐队上台时，我们听到观众席传来一阵阵欢呼（hoots）。"},{"en":"At night, hoots echoed from the trees near the river.","zh":"夜里，河边树林里传来猫头鹰的叫声（hoots）。"},{"en":"His joke got hoots of laughter from his friends.","zh":"他的笑话逗得朋友们一阵哄笑（hoots of laughter）。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) makes a loud call or shout; (of a car) honks; laughs loudly.","zh":"（动词第三人称单数）发出大声叫喊；（汽车）按喇叭；大声发笑。"},"examples":[{"en":"The fans hoots and cheers as the team enters the stadium.","zh":"球队进场时，球迷们大声欢呼（hoots）并喝彩。"},{"en":"A bus hoots impatiently in heavy traffic.","zh":"堵车时，一辆公交车不耐烦地按喇叭（hoots）。"},{"en":"She hoots with laughter at the funny video.","zh":"她看着搞笑视频笑得很大声（hoots with laughter）。"}]}],"synonyms":["shouts","yells","cheers","honks","whoops","calls"],"phonetic":"/huːts/","extraExplanation":["“hoot”在口语里常出现在短语里：\n- not give a hoot（about sth）：一点也不在乎/不感兴趣。\n例：He doesn’t give a hoot about fashion.（他一点也不在乎时尚。）\n另外，“hoot”也常指汽车“按喇叭”（英式/美式都可用），以及猫头鹰的典型叫声。"]}
{"word":"hooty","summary":{"en":"Hooty means ‘owl-like or full of hoots,’ and in some informal dialects it can also mean ‘a bit strange or silly.’","zh":"hooty 常指“像猫头鹰叫、充满hoot声的”；在某些口语/方言里也可指“有点古怪或傻气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making a lot of “hoot” sounds; sounding like an owl.","zh":"发出许多“hoot（猫头鹰叫声）”的；像猫头鹰叫的。"},"examples":[{"en":"The night felt hooty, with owls calling from the trees.","zh":"夜晚很“猫头鹰味”，树林里传来猫头鹰的叫声。"},{"en":"We heard a hooty call outside the window.","zh":"我们听到窗外传来猫头鹰似的叫声。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, dialect) A bit strange, silly, or eccentric.","zh":"（非正式/方言）有点怪、傻气或古怪的。"},"examples":[{"en":"He can be a little hooty, but he’s kind.","zh":"他有时有点怪，不过人很善良。"},{"en":"That’s a hooty idea—let’s try it!","zh":"这个点子挺怪的——不过试试吧！"}]}],"synonyms":["owl-like","whooping","quirky","weird","silly"],"phonetic":"/ˈhuːti/","extraExplanation":["“hooty”最常见的直观含义来自“hoot（猫头鹰的叫声）”。第二个“古怪/傻气”的意思较口语、带地域色彩，在不同地区并不都常用；日常交流中更常见的说法是“weird / silly / quirky”。"]}
{"word":"hoove","summary":{"en":"“Hoove” is rare/nonstandard. In standard English, use “hoof” (singular) and “hooves” (plural).","zh":"“hoove”属罕见/非标准用法；标准英语中通常用“hoof”（单数）和“hooves”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonstandard) A hoof (the hard foot of a horse, cow, deer, etc.); also used as a spelling variant related to the plural form “hooves.”","zh":"（罕见/非标准用法）蹄；也有人把它当作与复数形式“hooves（蹄子）”相关的拼写变体。"},"examples":[{"en":"A horse’s hooves need regular care from a farrier.","zh":"马的蹄子需要由钉蹄师定期护理。"},{"en":"The deer left clear hoof prints in the mud.","zh":"鹿在泥地里留下了清晰的蹄印。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very informal; usually spelled “hoof”) To walk somewhere, especially quickly or for a long distance (as in “hoof it”).","zh":"（很口语；通常写作“hoof”）徒步走（尤指走得快或走很远），如“hoof it（赶路/走过去）”。"},"examples":[{"en":"We couldn’t get a taxi, so we hoofed it back to the hotel.","zh":"我们打不到车，只好走回酒店。"},{"en":"It’s only ten minutes away—we can just hoof it.","zh":"就十分钟路程——我们直接走过去就行。"}]}],"synonyms":["hoof","hooves","foot (animal)","cloven hoof"],"phonetic":"/huv/","extraExplanation":["“hoove”在现代标准英语里不常见：谈动物的“蹄”一般用hoof（单数）/hooves（复数）。","注意不要和“hove”混淆：hove是“heave”的过去式/过去分词之一，也常见于短语“hove into view（进入视野）”。"]}
{"word":"hooved","summary":{"en":"“Hooved” means “having hooves,” describing animals like horses, cows, and deer.","zh":"“Hooved”表示“有蹄的”，用于形容马、牛、鹿等长蹄子的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having hooves (hard feet), like a horse, cow, deer, or goat.","zh":"有蹄的；长着蹄子的（如马、牛、鹿、山羊等）。"},"examples":[{"en":"A hooved animal can run well on grassland or rocky ground.","zh":"有蹄动物通常能在草原或岩地上跑得很稳。"},{"en":"Deer are hooved mammals found in many forests.","zh":"鹿是生活在许多森林里的有蹄哺乳动物。"}]}],"synonyms":["hoofed","ungulate"],"phonetic":"/huvd/","extraExplanation":["“Hooved”来自名词“hoof（蹄）”，常用于动物分类或自然描写；在科普语境里也常见“hoofed”。","相关词：cloven-hoofed（偶蹄的，如牛、羊、鹿等，蹄分成两瓣）vs. single-hoofed（单蹄的，如马）。"]}
{"word":"hooven","summary":{"en":"“Hooven” is rare/nonstandard; it usually means “hoven” (past participle of heave: lifted/swollen) or is a misspelling of “hooves/hoofed.”","zh":"“hooven”很少见且不规范；通常是“hoven”（heave 的过去分词：被举起/鼓起）或是把“hooves/hoofed（蹄/有蹄的）”拼错。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) A variant spelling of “hoven,” the past participle of “heave,” meaning lifted, raised, or (of the sea/body) swollen.","zh":"（非标准/少见）“hoven”的变体拼写，是动词“heave”的过去分词，意思是“被举起/被抬起”，或（海面/身体）“鼓起、肿胀”。"},"examples":[{"en":"The boat was hoven up onto the shore by the storm. (rare/old-fashioned)","zh":"船被暴风雨掀起，搁到了岸上。（少见/较旧式）"},{"en":"His chest looked hoven with effort as he ran. (rare/old-fashioned)","zh":"他跑步时用力喘息，胸口看起来鼓起。（少见/较旧式）"}]},{"partOfSpeech":"other","definition":{"en":"Often seen as a misspelling of “hooven/hoofed/hooves” related to “hoof” (the hard foot of a horse, deer, etc.).","zh":"常见于对与“hoof（蹄）”相关词的误拼，如“hooves（蹄的复数）/hoofed（有蹄的）”。"},"examples":[{"en":"Did you mean “hooves” (plural of hoof)?","zh":"你是不是想写“hooves”（hoof 的复数，蹄）？"},{"en":"A deer has split hooves.","zh":"鹿有分裂的蹄。"}]}],"synonyms":["hoven","heaved","swollen","raised"],"phonetic":"/ˈhoʊvən/","extraExplanation":["“hooven”在现代标准英语里非常少见，通常不作为规范拼写出现。你更可能会在古文、方言、或拼写不统一的旧文本中看到它，用来表示“hoven（heave 的过去分词）”。","如果你告诉我你看到“hooven”的句子或上下文（例如小说、歌词、聊天内容），我可以帮你判断它到底是想表达“hoven（被举起/鼓起）”，还是其实在说“hooves（蹄）”。"]}
{"word":"Hoover","summary":{"en":"Hoover can mean a vacuum cleaner (brand or general term), the verb “to vacuum,” or Herbert Hoover, a U.S. president.","zh":"Hoover 可指吸尘器（品牌或泛称）、动词“用吸尘器打扫”，也可指美国总统赫伯特·胡佛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for a vacuum cleaner; also used to mean a vacuum cleaner in general (especially in British English).","zh":"吸尘器品牌名；也可泛指吸尘器（尤用于英式英语）。"},"examples":[{"en":"Can you get the Hoover and clean the living room?","zh":"你能拿吸尘器把客厅打扫一下吗？"},{"en":"Our old Hoover finally stopped working.","zh":"我们那台旧的胡佛吸尘器终于坏了。"}]},{"partOfSpeech":"v.","definition":{"en":"to clean something using a vacuum cleaner.","zh":"用吸尘器打扫；吸尘。"},"examples":[{"en":"I need to hoover the carpet before guests arrive.","zh":"客人来之前我得把地毯吸一遍。"},{"en":"She hoovered up the crumbs from the kitchen floor.","zh":"她用吸尘器把厨房地上的面包屑吸干净了。"}]},{"partOfSpeech":"n.","definition":{"en":"Herbert Hoover (1874–1964), the 31st president of the United States.","zh":"赫伯特·胡佛（1874–1964），美国第31任总统。"},"examples":[{"en":"Hoover was president when the Great Depression began.","zh":"大萧条开始时，胡佛担任美国总统。"}]}],"synonyms":["vacuum (cleaner)","vacuum (verb)"],"phonetic":"/ˈhuːvər/","extraExplanation":["“Hoover”既是人名也是品牌名。吸尘器品牌 Hoover 在英语中出现了“品牌名泛化”的现象：在英国等地，人们会把“用吸尘器打扫”直接说成 hoover（类似把“复印”说成 Xerox）。在美式英语里更常说 vacuum / vacuum the floor。","与美国总统同名的常见地名有 Hoover Dam（胡佛水坝，位于内华达州与亚利桑那州交界）以及 Hoover Institution（胡佛研究所，斯坦福大学相关智库）。"]}
{"word":"hoover","summary":{"en":"“Hoover” can mean a vacuum cleaner (brand turned common word) or the verb “to vacuum.”","zh":"“Hoover”可指吸尘器（由品牌名演变而来），也可作动词表示“用吸尘器吸尘”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vacuum cleaner (originally the brand name “Hoover,” often used as a general word for a vacuum cleaner, especially in the UK)","zh":"吸尘器（原为“Hoover”品牌名，在英国等地常被当作吸尘器的统称）"},"examples":[{"en":"Can you grab the Hoover and clean the living room carpet?","zh":"你能拿吸尘器把客厅地毯吸一下吗？"},{"en":"We need a new Hoover—the old one is losing suction.","zh":"我们需要一台新的吸尘器——旧的那台吸力不行了。"}]},{"partOfSpeech":"v.","definition":{"en":"to vacuum-clean (a floor, carpet, etc.)","zh":"用吸尘器清洁（地板、地毯等）；吸尘"},"examples":[{"en":"I hoover the apartment every weekend.","zh":"我每周末都会用吸尘器打扫公寓。"},{"en":"She hoovered up the crumbs under the table.","zh":"她把桌子下面的碎屑都吸干净了。"}]}],"synonyms":["vacuum","vacuum cleaner","vac (informal)"],"phonetic":"/ˈhuːvɚ/","extraExplanation":["“Hoover”本来是美国胡佛公司（The Hoover Company）的商标名，后来在一些地区（尤其英国）出现了“商标泛化”，人们会用 hoover 指任何吸尘器，也会用 to hoover 表示“用吸尘器吸”。在美式英语里，更常见的说法是 vacuum（名词/动词）或 vacuum cleaner。"]}
{"word":"hoovered","summary":{"en":"vacuum-cleaned; also quickly consumed or took in (informal).","zh":"用吸尘器清理过；也可指很快地吞掉/吸走（非正式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle) cleaned a surface using a vacuum cleaner.","zh":"（过去式/过去分词）用吸尘器清洁（地面、地毯等）。"},"examples":[{"en":"I hoovered the living room before the guests arrived.","zh":"客人来之前，我把客厅用吸尘器打扫了一遍。"},{"en":"The carpet was hoovered every weekend.","zh":"这块地毯每个周末都会用吸尘器清理。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, figurative) took in or consumed something quickly, often greedily (food, information, money, etc.).","zh":"（非正式/比喻）很快地“吸走/吞掉”某物，常带有贪快的感觉（食物、信息、钱等）。"},"examples":[{"en":"He hoovered up the snacks in minutes.","zh":"他几分钟就把零食一扫而空。"},{"en":"The new app hoovered up users’ data.","zh":"这款新应用迅速“吸走”了大量用户数据。"}]}],"synonyms":["vacuumed","cleaned","sucked up","inhaled","devoured","gobbled up"],"phonetic":"/ˈhuːvɚd/","extraExplanation":["用法提示：在英式英语里 hoover 很常见；在美式英语更常说 vacuum / vacuumed。","常见搭配：hoover up + 名词（把……迅速吸走/扫光），既可字面也可比喻。"],"etymology":"源自英国品牌名 Hoover（胡佛牌吸尘器）。20世纪起在英式英语里常把“用吸尘器吸”说成 hoover（由商标泛化成动词），hoovered 是其过去式/过去分词。","mnemonic":["联想“胡佛(Hoover)=吸尘器”：hoovered 就是“胡佛过了”=已经吸尘打扫过。","记短语 hoover up：up 有“全部收走”的感觉，合起来就是“全吸光/一扫光”。"]}
{"word":"hoovering","summary":{"en":"vacuuming; or repeatedly trying to pull someone back into contact after a breakup or conflict","zh":"吸尘；或在分手/冲突后反复把对方拉回联系中的行为"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of cleaning floors or other surfaces using a vacuum cleaner","zh":"用吸尘器打扫（吸尘）的行为"},"examples":[{"en":"I spent the morning hoovering the living room and the hallway.","zh":"我一上午都在用吸尘器打扫客厅和走廊。"},{"en":"Could you do some hoovering before the guests arrive?","zh":"客人来之前你能用吸尘器吸一下吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(in relationships, especially in discussions of narcissistic or manipulative behavior) repeated attempts to pull someone back into contact—often with apologies, promises, gifts, or guilt—after conflict or a breakup","zh":"（人际关系中，常见于“自恋/操控型关系”的讨论）在分手或冲突后，反复用道歉、承诺、送礼或让人内疚等方式把对方“吸回”联系中"},"examples":[{"en":"After the breakup, his hoovering started: long apologies, late-night messages, and promises to change.","zh":"分手后他开始“吸回”：长篇道歉、深夜消息、还有各种保证会改变。"},{"en":"She recognized the hoovering and set a clear boundary: no contact for a month.","zh":"她意识到这是“吸回”行为，于是设定了明确界限：一个月不联系。"}]}],"synonyms":["vacuuming","suction","re-engagement","recontacting","reconciliation attempt","love-bombing","guilt-tripping"],"phonetic":"/ˈhuːvərɪŋ/","extraExplanation":["在英式英语里，人们常把“用吸尘器吸尘”直接说成 hoover（类似把品牌名当动词用）。美式英语更常说 vacuum 或 vacuuming。","关系语境中的 hoovering 多见于社媒、咨询与自助类内容；它描述的是一种“重新拉回关系”的策略。是否构成操控，要看具体行为、频率、是否尊重界限等。"],"etymology":"源自动词 hoover（英式英语常用来表示“用吸尘器吸尘”），最初来自英国吸尘器品牌 Hoover（胡佛）。后来在网络与心理关系话题中借用“像吸尘器一样把人吸回来”的比喻，形成 hoovering 的新义。","mnemonic":["把 hoover 想成“吸尘器品牌胡佛”，hoovering 就是“正在吸”。","关系里的 hoovering＝“像吸尘器一样把你吸回去（吸回联系）”。"]}
{"word":"hooverism","summary":{"en":"“Hooverism” means the ideas/policies linked to President Herbert Hoover, often criticizing limited government intervention in the economy.","zh":"“hooverism（胡佛主义）”指与胡佛总统相关的理念/政策，常用来批评政府对经济的干预过少。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often critical) The political or economic ideas and policies associated with U.S. President Herbert Hoover, especially a belief in limited government action in the economy (such as during the early Great Depression).","zh":"（常含批评意味）与美国总统赫伯特·胡佛相关的政治或经济理念与政策，尤指主张政府尽量少干预经济（如大萧条初期的做法）。"},"examples":[{"en":"Some critics blamed the slow federal response to the crisis on “Hooverism.”","zh":"一些批评者把联邦政府对危机反应缓慢归咎于“胡佛主义”。"},{"en":"The article compares modern austerity policies to Hooverism during the early 1930s.","zh":"这篇文章把当代的紧缩政策与20世纪30年代初的胡佛主义作比较。"}]}],"synonyms":["Hoover’s policies","laissez-faire (in context)","small-government approach (in context)"],"phonetic":"/ˈhuːvərˌɪzəm/","extraExplanation":["“Hooverism”是由人名 Hoover 加上表示“主义/思潮”的后缀 -ism 构成，常见于政治评论或历史写作中，用来概括（或指责）胡佛政府在经济危机时偏向“市场自我调整、政府少介入”的立场。","在大萧条背景下，这个词常与当时的社会痛苦记忆一起出现（例如“Hoovervilles”指失业者搭建的棚户区），因此语气往往带有负面或讽刺色彩；具体含义会随作者立场而变化。"]}
{"word":"hooverize","summary":{"en":"Hooverize means to vacuum-clean something, originally with a Hoover vacuum (often informal).","zh":"hooverize 指用吸尘器清洁（原指用胡佛牌吸尘器，常较口语）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to clean (especially a carpet or floor) using a vacuum cleaner; originally, to use a Hoover-brand vacuum","zh":"（尤指地毯或地面）用吸尘器吸尘；原指用胡佛（Hoover）牌吸尘器清洁"},"examples":[{"en":"Can you hooverize the living room before the guests arrive?","zh":"客人来之前，你能把客厅用吸尘器吸一下吗？"},{"en":"She hooverized the carpet to pick up the pet hair.","zh":"她用吸尘器吸地毯，把宠物毛清理掉。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal, often humorous) to vacuum thoroughly; to “Hoover” everything up","zh":"（非正式，常带幽默）彻底吸干净；把灰尘碎屑“全都吸走”"},"examples":[{"en":"After the party, we hooverized the whole apartment in ten minutes.","zh":"派对后，我们十分钟就把整套公寓彻底吸了一遍。"}]}],"synonyms":["vacuum","vacuum-clean","run the vacuum","clean up"],"phonetic":"/ˈhuːvəraɪz/","extraExplanation":["“hooverize/Hoover”属于品牌名称动词化的用法：Hoover 是早期非常有名的吸尘器品牌，在英国英语里甚至常把 hoover 当作“吸尘器/吸尘”来用。Hooverize 带一点口语和戏谑色彩，强调“用吸尘器处理”。在美式英语中更常见的说法是 vacuum (the floor) 或 run the vacuum。"]}
{"word":"hoovers","summary":{"en":"vacuum cleaners; also “vacuums” (cleans with a vacuum).","zh":"吸尘器；也可表示“用吸尘器清洁”（第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"vacuum cleaners (especially in British English; originally from the brand name Hoover).","zh":"吸尘器（尤指英式英语；原本来自胡佛 Hoover 品牌名）。"},"examples":[{"en":"The store sells a wide range of hoovers and other cleaning tools.","zh":"这家店卖各种吸尘器和其他清洁工具。"},{"en":"We compared two hoovers before choosing the quieter one.","zh":"我们对比了两款吸尘器，最后选了更安静的那台。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “hoover”: to clean with a vacuum cleaner; to vacuum.","zh":"“hoover”的第三人称单数：用吸尘器清洁；吸尘。"},"examples":[{"en":"She hoovers the carpet every weekend.","zh":"她每个周末都会用吸尘器吸地毯。"},{"en":"He hoovers the car seats to remove pet hair.","zh":"他用吸尘器清理汽车座椅上的宠物毛。"}]}],"synonyms":["vacuum cleaners","vacuums","vacuum","cleans","sucks up"],"phonetic":"/ˈhuːvɚz/","extraExplanation":["用法提示：在美式英语里更常说 vacuum / vacuum cleaner；“hoover”作为动词或名词更偏英式用法。"],"etymology":"源自英文品牌名 Hoover（胡佛吸尘器）。在英式英语里，这个商标逐渐“泛化”，既可指“吸尘器”，也可作动词表示“用吸尘器打扫”。","mnemonic":["联想“Hoover=胡佛牌吸尘器”，看到 hoover(s) 就想到“吸走灰尘”。","记忆句：He hoovers.（他在吸尘。）hoovers 结尾 -s 常见于“第三人称单数”或“复数名词”。"]}
{"word":"hooves","summary":{"en":"“Hooves” means the hard feet (plural) of animals like horses and cows.","zh":"“hooves”指马、牛等动物坚硬的蹄子（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The hard, protective foot of certain animals (such as horses, cows, deer, and goats). “Hooves” is the plural of “hoof.”","zh":"（某些动物如马、牛、鹿、山羊等的）蹄；蹄子。“hooves”是“hoof”的复数。"},"examples":[{"en":"The horse’s hooves made a loud clop on the road.","zh":"马蹄在路上踏出清脆的哒哒声。"},{"en":"Deer hooves leave narrow, pointed tracks in mud or snow.","zh":"鹿蹄会在泥地或雪地里留下又窄又尖的足迹。"},{"en":"The farrier checked the hooves for cracks and cleaned them.","zh":"钉蹄铁的铁匠检查蹄子是否有裂纹，并把它们清理干净。"}]}],"synonyms":["animal hooves","hoofs"],"phonetic":"/huːvz/","extraExplanation":["“hoof”的复数有两种常见形式：hoofs 和 hooves。现代英语里 hooves 更常见，尤其在日常和书面表达中；hoofs 也正确，但更少见。","相关词：hoofprint（蹄印）、hoofbeat（马蹄声）、hoofed animals / ungulates（有蹄类动物）。在文学描写里，hoofbeats 常用来营造紧张或快速逼近的氛围。"]}
{"word":"hoovey","summary":{"en":"“Hoovey” is uncommon in standard English; it’s usually a name, and sometimes an informal spelling meaning “hoof-like.”","zh":"“Hoovey”在标准英语中不常见；多作名字使用，也有时作非正式拼写表示“像蹄子的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/nonstandard word; most often used as a surname or a nickname (a name for a person, character, or pet).","zh":"一个较少见/非标准用词；最常见作姓氏或绰号（用于人名、角色名或宠物名）。"},"examples":[{"en":"Hoovey is my neighbor’s last name.","zh":"Hoovey 是我邻居的姓。"},{"en":"They call the dog Hoovey because he’s always running around.","zh":"他们叫那只狗 Hoovey，因为它总是到处乱跑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, uncommon) A variant spelling of “hoovy/hoofy,” meaning hoof-like or having big, clumsy feet.","zh":"（非正式、少见）“hoovy/hoofy”的一种拼写变体，意思是“像蹄子的”或“脚很大、走路笨拙的”。"},"examples":[{"en":"In the costume, my steps looked kind of hoovey.","zh":"穿上那套服装后，我走路看起来有点“蹄子一样”。"},{"en":"The cartoon horse has hoovey feet.","zh":"那匹卡通马的脚画得像蹄子一样。"}]}],"synonyms":["(name) N/A","(hoof-like) hoovy","hoofy","hooflike"],"phonetic":"/ˈhuːvi/","extraExplanation":["“hoovey”不属于常见标准词典词条；如果你是在聊天、游戏ID、小说角色名或社交媒体上看到的，它很可能只是专名（名字）。","如果你原本想查的是“Hoover（吸尘器/胡佛）”“hoovy/hoofy（像蹄子的）”或“Hoovie（昵称/网名）”，把原句贴出来我可以按语境帮你确认。"]}
{"word":"hooye","summary":{"en":"“Hooey” means nonsense or foolish talk, used to reject something as untrue.","zh":"“Hooey”指“胡说/废话”，用来否定某事不真实或不值得相信。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"nonsense; foolish talk or ideas (often used to dismiss something as not true or not worth believing).","zh":"胡说；废话；无稽之谈（常用来表示“不可信/不值得当真”）。"},"examples":[{"en":"That’s a bunch of hooey—show me the evidence.","zh":"那都是一堆胡说——给我看看证据。"},{"en":"He said the diet works overnight, but it sounds like hooey.","zh":"他说那种饮食法一夜见效，但听起来像是无稽之谈。"}]}],"synonyms":["nonsense","baloney","hogwash","bunk","rubbish"],"phonetic":"/ˈhuːi/","extraExplanation":["你输入的“hooye”更常见的拼写是 **hooey**（有时也写作 **hooie**）。它是比较口语、带点不耐烦或嘲讽语气的词，意思类似于“胡扯/鬼话”。","用法小提示：常见搭配是 **a bunch/load of hooey**（一堆废话）或直接说 **Hooey!** 表示“胡说！”（感叹用法）。"]}

