{"word":"hos","summary":{"en":"“HOS” is usually an abbreviation, most commonly meaning “Hours of Service” (limits on commercial drivers’ working/driving time).","zh":"“HOS”通常是缩写，最常见指“Hours of Service”（商用司机驾驶/工作时长限制规定）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Hours of Service: rules that limit how long commercial drivers (especially truck/bus drivers) may drive and work, to reduce fatigue and improve safety.","zh":"（缩写）HOS：工作/驾驶时长规定（常指卡车或巴士司机的“驾驶与工作时间限制”法规），用于防止疲劳驾驶、提高安全性。"},"examples":[{"en":"The company tracks HOS to make sure drivers don’t exceed legal limits.","zh":"公司会追踪HOS，确保司机不超过法定时长限制。"},{"en":"He had to stop driving because his HOS was almost up.","zh":"因为他的HOS快到上限了，他不得不停下不再开车。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., less common) Hospital Outpatient Services: medical care provided without staying overnight in the hospital.","zh":"（缩写，较少见）HOS：医院门诊/日间服务（不需住院过夜的医疗服务）。"},"examples":[{"en":"She scheduled the test through HOS.","zh":"她通过HOS预约了检查。"}]}],"synonyms":["Hours of Service"],"phonetic":"/ˌeɪtʃ oʊ ˈɛs/","extraExplanation":["“HOS”通常写成大写，因为它多作为缩写出现；在交通运输领域尤其常见（如美国联邦机动车安全管理局 FMCSA 的相关规定）。","口语里读作字母名称（H-O-S）。在不同机构里也可能代表别的词组，所以最好结合上下文确认具体含义。"]}
{"word":"hosa","summary":{"en":"“Hosa” most often refers to “Xhosa”: the Xhosa people or their language in South Africa.","zh":"“Hosa”多半指“Xhosa（科萨）”：南非的科萨人或科萨语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “Xhosa”) a member of a Bantu-speaking ethnic group in South Africa, especially in the Eastern Cape.","zh":"（通常拼作“Xhosa”）科萨人：南非的一个班图语族民族，主要分布在东开普省一带。"},"examples":[{"en":"Nelson Mandela was born into a Xhosa-speaking family.","zh":"纳尔逊·曼德拉出生在一个讲科萨语的家庭。"},{"en":"Many Xhosa communities live in South Africa’s Eastern Cape.","zh":"许多科萨人社区生活在南非的东开普省。"}]},{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “Xhosa”) the Bantu language spoken by the Xhosa people, one of South Africa’s official languages.","zh":"（通常拼作“Xhosa”）科萨语：科萨人使用的班图语之一，也是南非的官方语言之一。"},"examples":[{"en":"She is learning Xhosa to talk with her neighbors.","zh":"她正在学习科萨语，以便和邻居交流。"},{"en":"The greeting “Molo” is common in Xhosa.","zh":"“Molo”是科萨语里常见的问候语。"}]}],"synonyms":["Xhosa","isiXhosa"],"phonetic":"/ˈkoʊsə/","extraExplanation":["“hosa”本身在英语里不如“Xhosa”常见，很多时候是拼写省略或误拼。标准写法是以X开头。","Xhosa以“点击音（click consonants）”闻名，常用字母如c、x、q来表示不同的点击音，这是它在发音上很有特色的地方。"]}
{"word":"hosackia","summary":{"en":"Hosackia is an older botanical genus name for some legume plants, now usually included in Lotus.","zh":"Hosackia 是某些豆科植物的旧属名，现代多并入百脉根属（Lotus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for certain legume plants (pea family), now usually treated as part of the genus Lotus; used mainly in botany and plant identification.","zh":"（植物学）豆科植物中一类植物的旧属名，现代分类多并入“百脉根属（Lotus）”；主要用于植物学或物种鉴定语境。"},"examples":[{"en":"In older floras, some California species were listed under Hosackia rather than Lotus.","zh":"在较早的植物志中，一些加州物种会被归为 Hosackia，而不是 Lotus（百脉根属）。"},{"en":"The label says “Hosackia,” but the current accepted name is usually Lotus.","zh":"标签上写着“Hosackia”，但目前通常接受的属名是 Lotus（百脉根属）。"}]}],"synonyms":["Lotus (in modern classification)"],"phonetic":"/hoʊˈsækiə/","extraExplanation":["“Hosackia”常见于旧版植物分类文献或标本标签中；如果你在现代数据库（如植物名录、自然观察软件）里搜索，往往会被引导到“Lotus”作为更新的分类处理。","词源上多被认为是为纪念美国医生兼植物学爱好者 David Hosack（大卫·霍萨克）而命名的拉丁化属名。"]}
{"word":"hosanna","summary":{"en":"Hosanna is a religious word used to praise God, originally meaning “save, please,” and often heard in worship and hymns.","zh":"Hosanna（和散那）是宗教用语，用来赞美上帝，原意为“求你拯救”，常见于礼拜与圣诗中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Christian and Jewish tradition) a shout of praise to God, meaning “save, please,” used especially in worship and hymns.","zh":"（基督教与犹太传统中）向上帝呼喊的赞美词，原意为“求你拯救”，常见于礼拜与圣诗中。"},"examples":[{"en":"The choir sang “Hosanna” during the Easter service.","zh":"合唱团在复活节礼拜中唱了《Hosanna（和散那）》。"},{"en":"People shouted “Hosanna!” as a cry of praise.","zh":"人们高喊“和散那！”作为赞美的呼声。"}]},{"partOfSpeech":"int.","definition":{"en":"used as an exclamation to express joyful praise or worship.","zh":"用作感叹词，表达喜乐的赞美或敬拜之情。"},"examples":[{"en":"Hosanna! Blessed is he who comes in the name of the Lord!","zh":"和散那！奉主名来的，是应当称颂的！"},{"en":"Hosanna in the highest!","zh":"至高之处和散那！"}]}],"synonyms":["praise","acclaim","hallelujah"],"phonetic":"/hoʊˈzænə/","extraExplanation":["“hosanna”源自希伯来语（常解释为“求你拯救/请拯救”），后来在宗教语境中更多带有“赞美、欢呼”的色彩。","在英语世界里，它最常出现在《圣经》相关语句、教堂礼拜、圣诗歌词与宗教文学中；日常口语中较少使用，除非是引用或带有宗教氛围的表达。"]}
{"word":"hosannaed","summary":{"en":"“Hosannaed” means “shouted/sang ‘Hosanna!’” as a cry of praise (often religious).","zh":"“hosannaed”指高喊/歌唱“和散那！”以表达赞美与欢呼（常见于宗教语境）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “hosanna”) to shout or sing “Hosanna!” as a cry of praise or joyful worship, especially in a Christian or Jewish religious context.","zh":"（“hosanna”的过去式/过去分词）高喊或歌唱“和散那！”以表达赞美、欢呼或敬拜（尤指基督教或犹太教语境）。"},"examples":[{"en":"The crowd hosannaed as the choir entered the church.","zh":"当唱诗班进入教堂时，人群高喊“和散那！”来欢呼赞美。"},{"en":"In the hymn, believers hosannaed with lifted voices.","zh":"在圣诗中，信徒们高声唱出“和散那！”来赞美。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common, figurative) to praise someone or something very enthusiastically, sometimes in an overly worshipful way.","zh":"（较少见，比喻）热烈地称颂/吹捧某人或某事，有时带“近乎膜拜”的意味。"},"examples":[{"en":"Some critics said the media hosannaed the new tech leader too quickly.","zh":"一些评论家说媒体太快就把那位新科技领袖捧上天了。"}]}],"synonyms":["praised","acclaimed","lauded","cheered"],"phonetic":"/hoʊˈzænəd/","extraExplanation":["“Hosanna”来自希伯来语，原意接近“求你拯救/求你施救”，后来在宗教传统中逐渐演变为“赞美、欢呼上主”的呼喊。","在英语里把“hosanna”当动词使用比较文学化或宗教化；“hosannaed”多见于描写礼拜、圣诗或《圣经》相关场景（如耶稣进入耶路撒冷时群众的欢呼）。"]}
{"word":"hosannah","summary":{"en":"Hosanna is an exclamation (and sometimes a noun) meaning a joyful shout or song of praise, often used in religious worship.","zh":"Hosanna（和散那）是表示喜乐赞美的呼喊（也可作名词），常用于宗教敬拜场合。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"a cry of praise, joy, or worship, especially in religious contexts","zh":"（尤指宗教语境中）“和散那！”——表达赞美、欢呼或敬拜的呼喊"},"examples":[{"en":"The choir sang, “Hosanna in the highest!”","zh":"合唱团唱道：“至高之处和散那！”"},{"en":"People shouted hosanna as the procession passed by.","zh":"队伍经过时，人们高喊“和散那”欢呼。"}]},{"partOfSpeech":"n.","definition":{"en":"a shout or song of praise used in Christian worship; a hymn-like expression of celebration","zh":"（基督教礼拜中的）赞美呼喊或赞美歌；类似赞美诗的庆祝表达"},"examples":[{"en":"The service ended with a hosanna.","zh":"礼拜以一声“和散那”的赞美结束。"}]}],"synonyms":["praise","hallelujah","acclaim"],"phonetic":"/hoʊˈzænə/","extraExplanation":["常见拼写是 **hosanna**；你写的 **hosannah** 属于不太常见的变体拼写。","词源来自希伯来语，原意接近“求你拯救/求你施救”，后来在犹太与基督教传统中逐渐演变为“赞美、欢呼”的敬拜用语。","在基督教文化中，它常与《圣经》记载的耶稣进入耶路撒冷（棕枝主日 Palm Sunday）相关联，因此在圣歌与礼拜用语中非常常见。"]}
{"word":"hosannaing","summary":{"en":"Hosannaing means shouting “Hosanna!” in praise or worship, and can also mean praising someone excessively (figuratively).","zh":"hosannaing 指高喊“和散那！”以示赞美或敬拜；也可比喻为对某人/某事过度吹捧。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"shouting or singing “Hosanna!” (a cry of praise or worship, especially in Christian and Jewish contexts)","zh":"高喊或歌唱“和散那！”（一种赞美或敬拜的呼喊，常见于基督教与犹太教语境）"},"examples":[{"en":"The crowd was hosannaing as the choir entered the church.","zh":"当唱诗班走进教堂时，人群在高喊“和散那！”"},{"en":"On Palm Sunday, many churches remember the people hosannaing as Jesus entered Jerusalem.","zh":"在棕枝主日，许多教会会纪念耶稣进入耶路撒冷时人们高喊“和散那！”"}]},{"partOfSpeech":"vi.","definition":{"en":"praising someone or something in an excited, almost worshipful way (figurative use)","zh":"（比喻）以兴奋、近乎膜拜的方式热烈称颂某人或某事"},"examples":[{"en":"Some fans were hosannaing the new singer before hearing the full album.","zh":"有些粉丝还没听完整张专辑就开始把这位新歌手捧上天。"},{"en":"The article avoids hosannaing any one leader and focuses on the team’s work.","zh":"这篇文章避免对某位领导过度吹捧，而是聚焦团队的工作。"}]}],"synonyms":["praising","lauding","acclaiming","extolling","worshiping"],"phonetic":"/hoʊˈzænəɪŋ/","extraExplanation":["“Hosanna”源自希伯来语（常解释为“求你拯救！”），后来在宗教传统中也常用作赞美与欢呼的呼喊语。英语里把它动词化成 to hosanna（高喊/称颂），其 -ing 形式就是 hosannaing。","在文学与宗教文本中，它最常与《圣经》里耶稣进入耶路撒冷、群众挥舞棕枝欢呼的场景相关（也因此常出现在棕枝主日/复活节前的叙述与诗歌里）。"]}
{"word":"hosannas","summary":{"en":"“Hosannas” means shouts or songs of praise (plural of “hosanna”), often used in religious or ceremonial writing.","zh":"“hosannas”指赞美的呼喊或颂歌（“hosanna”的复数），常见于宗教或庄重的书面表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"songs or shouts of praise, especially in a religious (often Christian or Jewish) context; the plural of “hosanna.”","zh":"（尤指宗教语境中的）赞美的歌声或欢呼声；“hosanna（和散那）”的复数。"},"examples":[{"en":"The choir filled the church with hosannas on Easter morning.","zh":"复活节早晨，唱诗班用一片和散那的赞美声充满了教堂。"},{"en":"Crowds welcomed the procession with hosannas and waving branches.","zh":"人群挥舞树枝，以和散那的欢呼迎接队伍。"}]}],"synonyms":["praises","acclamations","hallelujahs","cheers"],"phonetic":"/hoʊˈzænəz/","extraExplanation":["“Hosanna”源自希伯来语，原意接近“求你拯救/求你救助”，后来在《圣经》传统中逐渐演变为表达欢呼与赞美的呼喊。英语里常与棕枝主日（Palm Sunday）以及耶稣进入耶路撒冷的叙事相关。","在现代英语中，“hosannas”多用于宗教、文学或较庄重的修辞场景；日常口语里较少使用。"]}
{"word":"hose","summary":{"en":"A hose is usually a flexible tube for carrying water or other fluids; it can also mean to spray with a hose, or (older) long stockings/tights.","zh":"hose通常指输送水等液体的软管；也可作动词指用水管喷/冲；较旧用法还可指长袜/丝袜（统称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flexible tube used to carry water, gas, air, or other liquids.","zh":"（软）管子；用于输送水、气体、空气或其他液体的柔性管道。"},"examples":[{"en":"I watered the garden with a hose.","zh":"我用水管给花园浇水。"},{"en":"Be careful—this hose is leaking.","zh":"小心——这根软管在漏。"},{"en":"The firefighter connected the hose to the hydrant.","zh":"消防员把水带接到消防栓上。"}]},{"partOfSpeech":"v.","definition":{"en":"To spray or wash something with water from a hose.","zh":"用水管喷水/冲洗（某物）。"},"examples":[{"en":"They hosed the sidewalk after the storm.","zh":"暴风雨后他们用水管冲洗人行道。"},{"en":"Please hose down the muddy shoes outside.","zh":"请在外面用水管把泥鞋冲一冲。"}]},{"partOfSpeech":"n.","definition":{"en":"Long stockings, tights, or pantyhose (often used as a group noun: “hose”).","zh":"（较旧或较正式用法）长袜；紧身裤袜（常用作统称）。"},"examples":[{"en":"In old portraits, men often wore hose and boots.","zh":"在一些老肖像画里，男人常穿长袜配靴子。"},{"en":"She bought black hose for the performance.","zh":"她为演出买了黑色丝袜。"}]}],"synonyms":["tube","pipe","spray","tights","pantyhose","stockings"],"phonetic":"/hoʊz/","extraExplanation":["“hose”表示“水管/软管”时最常见；动词用法常与down连用（hose down），强调用水柱把污渍、泥土冲掉。","表示“长袜/丝袜”时更偏英式或较旧的用法；现代美式更常说“tights”“pantyhose”或“stockings”。在文学或历史语境（如中世纪、莎士比亚戏剧）里也常见“hose”。"]}
{"word":"hose-free","summary":{"en":"Not requiring a hose, or having no hoses attached.","zh":"免接水管的；没有水管连接的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not needing to be connected to a hose; designed to work without a hose attachment (often said of cleaning tools, sprinklers, or outdoor equipment).","zh":"不需要连接水管；设计成无需水管接头也能使用（常用于清洁工具、喷灌/浇水设备或户外用品）。"},"examples":[{"en":"This hose-free sprayer uses a built-in tank, so you can water plants anywhere.","zh":"这款免水管喷雾器自带水箱，所以你可以在任何地方给植物浇水。"},{"en":"We chose a hose-free setup for the balcony because there’s no outdoor faucet.","zh":"我们阳台没有室外水龙头，所以选了免水管的配置。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without hoses attached or in the way; free from hose-related clutter or restrictions.","zh":"没有水管缠绕/连接；不受水管带来的杂乱或限制影响。"},"examples":[{"en":"The patio looks cleaner with a hose-free corner—no coils on the ground.","zh":"角落里不放水管后，露台看起来更整洁——地上也没有盘绕的管子。"},{"en":"A hose-free workspace is safer because there’s less to trip over.","zh":"没有水管的工作区更安全，因为不容易绊倒。"}]}],"synonyms":["hoseless","no-hose","without a hose","unhooked"],"phonetic":"/ˈhoʊz friː/","extraExplanation":["用法提示：在英语里，“X-free”常见于产品描述，表示“无X”或“不需要X”（如 sugar-free 无糖、wire-free 无线）。因此 hose-free 多出现在商品标题、包装文案、家居/园艺场景中。"],"etymology":"复合词：hose（软管/水管）+ free（无……的）。在广告与产品说明里常用来强调“不用接水管/更方便”。","mnemonic":["把它当作“无X结构”：hose-free = 没有/不需要 hose（水管）。联想常见的“sugar-free（无糖）”。","hose /hoʊz/ 听起来有点像“喉子”，想象“喉子（管子）没了”= 免水管。"]}
{"word":"hose-shaped","summary":{"en":"hose-like in shape","zh":"软管状的；像软管一样的形状"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a hose; long, tubular, and often slightly flexible in form.","zh":"呈软管状的；形状像软管一样细长、管状（常带一点柔软或可弯曲的感觉）。"},"examples":[{"en":"A hose-shaped tube connects the pump to the tank.","zh":"一根软管状的管子把泵和储罐连接起来。"},{"en":"The creature had a hose-shaped mouth used to suck up food.","zh":"那种生物有一个软管状的嘴，用来吸食食物。"},{"en":"Use the hose-shaped nozzle to reach narrow spaces.","zh":"用软管状喷嘴可以伸进狭小的空间。"}]}],"synonyms":["hose-like","tube-shaped","tubular","pipe-shaped"],"phonetic":"ˈhoʊz ˌʃeɪpt","extraExplanation":["在科普或产品说明里，hose-shaped 常用来强调“像软管一样的外形”：细长、管状，通常暗示可以弯曲或有一定柔性；如果只是“管状”但不强调像软管那样可弯曲，也常用 tube-shaped / tubular。"],"etymology":"由 hose（软管）+ shaped（……形状的）构成的复合形容词。shaped 表示“具有某种外形/轮廓”。","mnemonic":["把它拆开记：hose（软管）+ shaped（有……形状）→ “像软管的形状”。","联想中文：看到“hose”就想到“水管/软管”，再加上“shaped=长得像”。"]}
{"word":"hosea","summary":{"en":"Hosea is a biblical prophet and also the name of the Bible book associated with him.","zh":"Hosea 指《圣经/旧约》中的先知何西阿，也指与他相关的《何西阿书》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prophet in the Hebrew Bible/Old Testament, known for his message about faithfulness and compassion.","zh":"《希伯来圣经/旧约》中的先知之一，以关于忠诚与怜悯的信息而闻名。"},"examples":[{"en":"Hosea is one of the Minor Prophets in the Old Testament.","zh":"何西阿（Hosea）是《旧约》中的“小先知书”之一。"},{"en":"In many readings, Hosea’s story is used to talk about forgiveness and loyalty.","zh":"在许多解读中，何西阿的故事常用来讨论宽恕与忠诚。"}]},{"partOfSpeech":"n.","definition":{"en":"The biblical book traditionally attributed to the prophet Hosea.","zh":"通常被认为出自先知何西阿之手的《何西阿书》（圣经书卷名）。"},"examples":[{"en":"We studied the Book of Hosea in class.","zh":"我们在课上学习了《何西阿书》。"},{"en":"A famous theme in Hosea is the call to return and renew one’s commitment.","zh":"《何西阿书》中一个著名主题是呼吁人回转并更新承诺。"}]}],"synonyms":["Book of Hosea","Minor Prophet"],"phonetic":"/hoʊˈzeɪ.ə/","extraExplanation":["“Hosea”源自希伯来语，常被解释为“拯救/救恩”之意（与“Joshua/Jesus”等名字同源相关）。","在英语里它通常是专有名词：人名（先知）或书名（Book of Hosea）。写作时书名常大写，并可写作“The Book of Hosea”。"]}
{"word":"hosebird","summary":{"en":"A slang term for a firefighter, especially one who works with fire hoses.","zh":"指消防员的俚语，尤指负责操作消防水带的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, mainly U.S.) A firefighter, especially one who handles the fire hose; sometimes used jokingly or mildly teasingly.","zh":"（俚语，主要在美国）消防员；尤指负责操作消防水带的人。有时带玩笑或轻微调侃语气。"},"examples":[{"en":"The hosebirds arrived fast and had the flames under control in minutes.","zh":"消防员很快赶到，几分钟内就控制住了火势。"},{"en":"He’s a hosebird—give him a hose and he knows exactly what to do.","zh":"他是个“水带消防员”——给他一根水带，他就知道该怎么做。"},{"en":"The rookie hosebird practiced nozzle work all afternoon.","zh":"新来的消防员练了一下午的水枪喷嘴操作。"}]}],"synonyms":["firefighter","fireman (older)","hoseman (less common)"],"phonetic":"/ˈhoʊzˌbɝd/","extraExplanation":["“hosebird”多见于消防行业内部或口语场景，带有行话/昵称性质，并不是正式用语；在正式报道中通常说“firefighter”。","词源上是把“hose（水带）”和“bird（鸟）”拼在一起的戏称，暗示消防员总是围着水带忙活、行动迅速。","不同地区的消防部门可能不常用这个词；对不熟悉行业的人使用时，建议先判断对方是否听得懂，以免造成误解。"]}
{"word":"hosecock","summary":{"en":"A hosecock is a valve/tap that controls water flow in a hose.","zh":"hosecock 指控制软管水流的阀门/龙头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a valve or faucet (tap) used to control the flow of water through a hose, especially on plumbing equipment or firefighting gear","zh":"（连接软管的）阀门；水龙头（用于控制软管中的水流，常见于管道设备或消防器材）"},"examples":[{"en":"Turn the hosecock off before you disconnect the hose.","zh":"在拆下软管之前先把软管阀门关掉。"},{"en":"The firefighter opened the hosecock to increase the water pressure.","zh":"消防员打开软管阀门来增加水压。"}]}],"synonyms":["valve","faucet","spigot","tap"],"phonetic":"/ˈhoʊz.kɑːk/","extraExplanation":["这个词更常见的写法是分开写：hose cock；在美式英语里也常用更通俗的说法，如 valve（阀门）或 spigot / faucet（龙头）。在消防语境中，它指的是用来控制水流进入或流出水带的阀件。"]}
{"word":"hosed","summary":{"en":"“Hosed” can mean sprayed with a hose, or (informally) in serious trouble/defeated.","zh":"“hosed”既可指“用水管喷/冲过”，也可作俚语表示“惨了、完了、陷入大麻烦”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “hose”) to spray someone or something with water (or another liquid) using a hose.","zh":"（“hose”的过去式/过去分词）用软管向某人或某物喷水（或其他液体）。"},"examples":[{"en":"The firefighters hosed the roof to stop the fire from spreading.","zh":"消防员用水管给屋顶喷水，防止火势蔓延。"},{"en":"We hosed off the car after the muddy trip.","zh":"泥泞旅行后，我们用水管把车冲干净。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Slang, informal) in a very bad situation; defeated, ruined, or left with no good options.","zh":"（俚语，非正式）处境很糟；被打败、被坑/被整，或几乎没有好选择。"},"examples":[{"en":"If we miss this deadline, we’re hosed.","zh":"如果错过这个截止日期，我们就完了。"},{"en":"My laptop died the night before the exam—I was totally hosed.","zh":"考试前一晚我的电脑坏了——我彻底惨了。"},{"en":"They lost their funding, so the whole project was hosed.","zh":"他们失去了资金，所以整个项目就黄了。"}]}],"synonyms":["sprayed","washed down","drenched","in trouble","done for","doomed"],"phonetic":"/hoʊzd/","extraExplanation":["“We’re hosed.” 是很口语、带点夸张的说法，语气类似“我们完蛋了/惨了/没戏了”。在正式写作里通常改用 “in trouble / in a bad situation / doomed”。","俚语义可能来自“被水管冲得一塌糊涂”的形象，比喻被彻底压制或搞砸。"]}
{"word":"hosel","summary":{"en":"A hosel is the socket part of a golf club head where the shaft attaches.","zh":"Hosel 指高尔夫球杆杆头上连接杆身的插口/杆颈部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the part of a golf club head that the shaft fits into (the socket where the shaft is attached)","zh":"（高尔夫球杆杆头上的）杆颈；插杆孔（连接杆身与杆头的套筒/插口）"},"examples":[{"en":"The club’s hosel was slightly bent, so the shots kept going right.","zh":"球杆的杆颈有点弯，所以球总是往右偏。"},{"en":"Some golfers use a hosel adjustment to change the loft or lie angle.","zh":"有些球手会通过调节杆颈来改变杆面的倾角（loft）或杆身角度（lie）。"}]}],"synonyms":["neck (of a golf club)","socket (golf club)"],"phonetic":"/ˈhoʊzəl/","extraExplanation":["“Hosel”是高尔夫器材里的专业词，日常英语里不常见。它指杆头上用来连接“shaft（杆身）”的那一段结构。","在球技讨论中你可能会听到“shank（击中杆颈导致球飞斜）”；很多“shank”问题就是球打到了hosel附近。"]}
{"word":"hoseless","summary":{"en":"Hoseless means “without a hose,” and less commonly “without stockings/tights (hose).”","zh":"hoseless 常指“没有软管的”，较少见可指“未穿长袜/连裤袜的（旧式 hose 用法）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without hose (a flexible tube for carrying liquid or gas), or not connected to a hose.","zh":"没有软管的；未连接软管的（软管指输送液体或气体的管子）。"},"examples":[{"en":"The mechanic tested the pump in a hoseless setup before connecting the hose.","zh":"技师在不接软管的情况下测试了水泵，然后才连接软管。"},{"en":"This faucet includes a hoseless sprayer option for small sinks.","zh":"这个水龙头带有无软管喷头选项，适合小水槽。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Not wearing hose (old-fashioned word for stockings/tights).","zh":"（较少见）不穿长袜/丝袜的（hose 为旧式用法，指长袜或连裤袜）。"},"examples":[{"en":"In some historical portraits, children are shown hoseless in warm weather.","zh":"在一些历史肖像中，孩子们在温暖天气里被画成不穿长袜的样子。"},{"en":"The costume guide recommends a hoseless look for summer scenes.","zh":"服装指南建议夏季场景采用不穿长袜的造型。"}]}],"synonyms":["without a hose","hose-free","barelegged"],"phonetic":"/ˈhoʊzləs/","extraExplanation":["“Hoseless”是由“hose + -less”构成，-less 表示“没有/缺少”。","现代英语里 hose 最常见的意思是“软管”；而在较旧或英式/历史语境中，hose 也可指“长袜、连裤袜”。读到 hoseless 时，可以根据上下文判断是哪一种。"]}
{"word":"hoselike","summary":{"en":"“Hoselike” means “shaped like a hose,” especially long, flexible, and tubular.","zh":"“Hoselike”表示“像软管的”，尤指细长、可弯曲、管状的形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling a hose; long, flexible, and tube-shaped","zh":"像软管的；细长、可弯曲、呈管状的"},"examples":[{"en":"The device has a hoselike tube that carries water to the nozzle.","zh":"这个装置有一根像软管的管子，把水输送到喷嘴。"},{"en":"A hoselike structure connects the pump to the tank.","zh":"一个软管状的结构把泵连接到水箱。"}]}],"synonyms":["tubular","hose-shaped","tube-like","tubelike"],"phonetic":"/ˈhoʊzˌlaɪk/","extraExplanation":["“hoselike”是由“hose（软管）+ -like（像……的）”构成的形容词，常用于工程、医学或生物学等语境，描述“软管般的形状/质地”（细长、可弯曲、管状）。比起日常口语，它更偏书面和技术描述。"]}
{"word":"hosels","summary":{"en":"“Hosel” is the neck of a golf club head where the shaft attaches; “hosels” is the plural form.","zh":"“Hosel”指高尔夫球杆杆头与杆身连接的杆颈部位；“hosels”是其复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Golf) the part of a golf club head where the shaft is attached (the “neck” of the club).","zh":"（高尔夫）球杆杆头上连接杆身（shaft）的部位；杆颈（连接处）。"},"examples":[{"en":"Check the hosel for cracks before you play.","zh":"上场前先检查杆颈连接处有没有裂痕。"},{"en":"Mud stuck in the hosel can affect how the club feels.","zh":"杆颈处卡了泥会影响挥杆手感。"}]}],"synonyms":["neck (of a golf club)","socket"],"phonetic":"/ˈhoʊzəl/","extraExplanation":["“hosels”通常是名词复数形式，单数是“hosel”。在高尔夫语境里很常见：club head（杆头）、shaft（杆身）、hosel（杆颈/连接处）。","不要和“hose”（软管）混淆：hose 的复数是 hoses，意义完全不同。"]}
{"word":"hoseman","summary":{"en":"A hoseman is usually a firefighter who operates a fire hose; it can also mean a worker who uses a hose, especially an old term for a gas-station attendant.","zh":"hoseman 通常指消防队里负责操作消防水带的人；也可指使用软管的工作人员，尤其是较旧用法中的加油站加油员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A firefighter whose job is to handle and operate the fire hose (aiming water, managing pressure, and helping move the hose line).","zh":"（消防队中的）水带员；负责操作消防水带的人（瞄准喷水、控制水压、协助拖拽水带线路）。"},"examples":[{"en":"The hoseman advanced the line while the others searched the building.","zh":"水带员推进水带线路，同时其他人搜查大楼。"},{"en":"A skilled hoseman can control a powerful stream without losing balance.","zh":"熟练的水带员能稳住强劲水柱而不失去平衡。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone whose work involves operating or supplying a hose, especially an older term for a service-station attendant who pumps gas.","zh":"（工作中）操作或使用软管的人；（较旧用法）加油站加油员（用油管给车加油）。"},"examples":[{"en":"In old movies, a hoseman comes out to pump the gas and clean the windshield.","zh":"在老电影里，加油员会出来给车加油，还会擦挡风玻璃。"}]}],"synonyms":["fire hose operator","firefighter","pump attendant (older)","service-station attendant (older)"],"phonetic":"/ˈhoʊz.mən/","extraExplanation":["“hoseman”更常见于消防语境，属于较职业化、较老派的称呼；现代口语里更常说“firefighter”或更具体的岗位名称。","在美国早期汽车文化中，加油站常提供“全套服务”（full-service），由工作人员用油管加油；随着自助加油普及，这个用法更像复古表达。"]}
{"word":"hosen","summary":{"en":"“Hosen” is mainly a German word meaning “pants,” seen in English mostly in cultural contexts like “Lederhosen.”","zh":"“Hosen”主要是德语词，意思是“裤子”，在英语中多见于“Lederhosen”等文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun) Trousers or pants; in traditional Bavarian/Austrian dress, often refers to leather shorts or breeches (as in “Lederhosen”).","zh":"（复数名词）裤子；在巴伐利亚/奥地利传统服饰语境中，常指皮短裤或马裤（如“Lederhosen/皮短裤”）。"},"examples":[{"en":"In German, “Hosen” usually means “pants.”","zh":"在德语里，“Hosen”通常就是“裤子”的意思。"},{"en":"He wore Lederhosen for the festival.","zh":"他在节日上穿了皮短裤（Lederhosen）。"}]}],"synonyms":["pants","trousers","breeches"],"phonetic":"/ˈhoʊzən/","extraExplanation":["“Hosen”不是常见的英语单词，更常见于英语中借用的德语文化词汇（尤其是“Lederhosen”）。如果你在英文文章里单独看到“hosen”，多半与德语/中欧传统服饰相关，或是把德语直接带进了英文语境。","英语里更自然的说法是“pants”（美式）或“trousers”（更正式/英式）。而“Hosen”在德语中本身是“裤子”的复数形式；单数是“Hose”（一条裤子）。"]}
{"word":"hosepipe","summary":{"en":"A hosepipe is a flexible tube used to carry water, especially outdoors.","zh":"hosepipe 指用于输水的软水管，常用于户外浇花、洗车等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long flexible tube used to carry water, especially for watering gardens or washing cars","zh":"（尤指浇花、洗车用的）水管；软水管"},"examples":[{"en":"I watered the plants with a hosepipe.","zh":"我用水管给植物浇水。"},{"en":"Can you connect the hosepipe to the outdoor tap?","zh":"你能把水管接到室外水龙头上吗？"},{"en":"The hosepipe wasn’t long enough to reach the back garden.","zh":"这根水管不够长，够不到后院。"}]}],"synonyms":["garden hose","hose","water hose"],"phonetic":"/ˈhoʊzˌpaɪp/","extraExplanation":["“hosepipe”更常见于英式英语；美式英语里更常说“garden hose”或直接说“hose”。","在英国有时会遇到“hosepipe ban”，指因干旱而实施的“限制使用水管（浇水、洗车等）”的临时禁令。"]}
{"word":"hoses","summary":{"en":"“Hoses” most commonly means multiple flexible tubes for carrying water/air; it can also mean stockings/tights (older usage), or the verb form meaning “sprays with a hose.”","zh":"“Hoses”最常指多根软管/水管（输水、输气）；也可指长袜/紧身袜（较旧用法），或作动词表示“用水管喷/冲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hose: flexible tubes (usually rubber or plastic) used to carry water, air, or other liquids/gases.","zh":"hose 的复数：软管（通常为橡胶或塑料），用于输送水、空气或其他液体/气体。"},"examples":[{"en":"The garden hoses are hanging on the wall.","zh":"花园水管挂在墙上。"},{"en":"Firefighters connected several hoses to the hydrant.","zh":"消防员把几根水带接到消防栓上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Clothing, less common today) Plural of hose: stockings or tights; in modern use often seen as “pantyhose.”","zh":"（服装义，较少见）hose 的复数：长袜/紧身袜；现代更常见为 pantyhose（连裤袜）。"},"examples":[{"en":"She bought a new pair of pantyhose for the event.","zh":"她为活动买了一条新的连裤袜。"},{"en":"In old stories, people sometimes wore wool hose.","zh":"在一些旧故事里，人们有时穿羊毛长袜。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of hose: to spray or wash something with water from a hose.","zh":"hose 的第三人称单数：用水管喷水/冲洗某物。"},"examples":[{"en":"He hoses down the driveway every weekend.","zh":"他每个周末都会用水管把车道冲洗一遍。"},{"en":"The staff hoses the floor after closing time.","zh":"打烊后工作人员用水管冲地。"}]}],"synonyms":["tubes","pipes","water hoses","spray","wash down"],"phonetic":"/hoʊz/","extraExplanation":["“hose”作“长袜”这一义在现代英语里更偏旧式/文学用法；日常更常说“socks”（短袜）或“stockings”（长筒袜），“pantyhose”指连裤袜。"]}
{"word":"hoshin","summary":{"en":"a guiding policy or strategic direction, especially in Japanese-style management","zh":"方针；战略方向（常指日式管理语境）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Japanese, business) A clear policy or strategic direction (often used in the phrase “hoshin kanri,” a method for aligning company goals and actions).","zh":"（源自日语，商业用语）方针；战略方向（常见于“hoshin kanri 方针管理/战略展开”，用于把组织目标与行动对齐）。"},"examples":[{"en":"The CEO announced a new hoshin to focus the company on customer experience.","zh":"CEO宣布了一项新方针，把公司重心聚焦在客户体验上。"},{"en":"They use hoshin kanri to connect long-term strategy with quarterly targets.","zh":"他们用方针管理把长期战略和季度目标连接起来。"},{"en":"Without a clear hoshin, each department may prioritize different things.","zh":"没有清晰的方针时，各部门可能会各做各的、优先级不一致。"}]}],"synonyms":["policy","strategy","direction","guideline","game plan","strategic intent"],"phonetic":"/ˈhoʊʃiːn/","extraExplanation":["在英语中，“hoshin”多出现在精益管理/质量管理领域，通常不单独使用，而是与“kanri（管理）”一起出现：hoshin kanri≈“把战略目标层层展开并对齐执行”的方法。","如果你只是想表达一般的“方针/政策/战略”，英语更常用 policy, strategy, direction；用 hoshin 会显得更偏“日本管理法/精益体系”的语境。"],"etymology":"来自日语「方針（ほうしん）」，字面是“方向 + 针（指南针/指针）”，引申为“行动的指引、政策方针”。在英语商业语境中常借用来指组织层面的战略方向，尤其见于“hoshin kanri（方针管理）”。","mnemonic":["把“hoshin 方针”想成“方向（方）+ 指针（针）”，就是“指向要去哪里、怎么做的指引”。","记搭配：hoshin 常和 kanri（管理）一起出现——看到 hoshin 就联想到“战略对齐与展开”。"]}
{"word":"hosier","summary":{"en":"A hosier is a seller or maker of hosiery such as socks and stockings.","zh":"hosier 指袜类用品（如袜子、长筒袜等）的制售者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that makes or sells hosiery (socks, stockings, tights)","zh":"（制售）袜类/长筒袜/连裤袜等“袜品”的商人或厂家"},"examples":[{"en":"She bought wool socks from a local hosier.","zh":"她从当地一家袜品商那里买了羊毛袜。"},{"en":"In the past, a hosier might also sell gloves and other knitwear.","zh":"过去，袜品商也可能兼卖手套等针织品。"}]}],"synonyms":["hosiery retailer","sock seller","hosier (shop) (BrE)"],"phonetic":"/ˈhoʊʒər/","extraExplanation":["“Hosier”来自“hosiery”（袜类用品）。在现代英语里它比较偏英式/较旧用法，日常更常说“sock shop / hosiery store / sock retailer”。","文化小知识：美国印第安纳州有个昵称叫“Hoosier”（指印第安纳州居民），拼写和发音都不同，不要和“hosier”混淆。"]}
{"word":"hosieries","summary":{"en":"Hosiery means socks, stockings, tights, and similar legwear; “hosieries” is the plural form.","zh":"hosiery 指袜子、丝袜、连裤袜等袜类；hosieries 是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stockings, socks, tights, and other knitted items for the legs and feet (often sold in the “hosiery” section of a store).","zh":"长袜、短袜、连裤袜等腿部和脚部的针织品（商店里常见“袜类/丝袜”专区）。"},"examples":[{"en":"This department store sells hosiery on the second floor.","zh":"这家百货公司的二楼卖袜类/丝袜。"},{"en":"She bought black hosiery to match her dress.","zh":"她买了黑色的丝袜来搭配裙子。"}]}],"synonyms":["hosiery","legwear","stockings","tights","socks"],"phonetic":"/ˈhoʊʒəri/","extraExplanation":["“hosieries”是复数形式，但更常见的用法是不可数名词“hosiery”，表示“袜类商品”这个总称。日常购物时也常直接说“socks”（袜子）或“stockings”（长筒丝袜/长袜）。","词源上与“hosier”（卖袜子的人）有关；在英美文化里，“hosiery”在服装店里通常指较正式或偏女性的袜类，如丝袜、连裤袜等。"]}
{"word":"hosiers","summary":{"en":"“Hosiers” means people or businesses that make or sell hosiery (socks, stockings, tights).","zh":"“Hosiers”指生产或销售袜类、长筒袜等针织品的人或公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that makes or sells hosiery (such as socks, stockings, and tights); plural of “hosier.”","zh":"生产或销售针织品/袜类（如袜子、长筒袜、连裤袜）的人或公司；“hosier”的复数。"},"examples":[{"en":"Several local hosiers supplied socks to the army during the war.","zh":"战争期间，几家本地袜类商家为军队供应了袜子。"},{"en":"The old street was once full of tailors, hatters, and hosiers.","zh":"那条老街曾经到处都是裁缝、帽商和袜类商家。"}]}],"synonyms":["hosiery sellers","sock sellers","stocking sellers","hosiery manufacturers"],"phonetic":"/ˈhoʊʒərz/","extraExplanation":["“hosier”来自“hosiery”（袜类、针织品）。在英式英语中更常见，带有一点传统行业/老行当的感觉；现代日常对话里更常说“sock shop,” “hosiery store,” 或直接说“socks/stockings seller”。","注意拼写：hosiers（袜类商家/制造商）不要和 Hoosiers（印第安纳州居民的别称）混淆；后者首字母大写，发音也不同。"]}
{"word":"hosiery","summary":{"en":"Hosiery means socks, stockings, tights, and similar items worn on the legs; it can also refer to the hosiery industry.","zh":"Hosiery 指袜类（袜子、长筒袜、连裤袜等）的总称，也可指袜品制造与销售行业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stockings, socks, tights, and similar knitted clothing worn on the feet and legs.","zh":"（总称）袜类；长筒袜、短袜、连裤袜等针织的脚部与腿部衣物。"},"examples":[{"en":"The store sells women’s hosiery like tights and knee-high socks.","zh":"这家店卖女士袜类，比如连裤袜和及膝袜。"},{"en":"He wore dark hosiery with his dress shoes.","zh":"他穿着深色袜子搭配皮鞋。"}]},{"partOfSpeech":"n.","definition":{"en":"The business or industry of making and selling socks, stockings, and tights.","zh":"袜类制造与销售行业；袜品业。"},"examples":[{"en":"She works in the hosiery industry as a designer.","zh":"她在袜品行业做设计师。"},{"en":"The company expanded its hosiery line to include sports socks.","zh":"这家公司扩展了袜类产品线，加入了运动袜。"}]}],"synonyms":["socks","stockings","tights","pantyhose","legwear"],"phonetic":"/ˈhoʊʒəri/","extraExplanation":["“Hosiery”通常作不可数名词，表示“袜类（总称）”；若强调“几双/几件袜类商品”，有时也会看到复数“hosieries”，但不常见。","词源上与“hose（长筒袜/裤袜）”有关。现代英语里，尤其在商店分区或商品目录中常用“hosiery”指“袜子、丝袜、连裤袜”这一类商品。","在美式英语里，日常更常说具体词：socks（袜子）、stockings（长筒丝袜/袜）、tights（连裤袜，通常较厚）、pantyhose（连裤丝袜，通常较薄）。在服装语境中，“hosiery department”指商场的“袜品区/丝袜区”。"]}
{"word":"hosing","summary":{"en":"“Hosing” usually means spraying/cleaning with a hose; informally, it can also mean a big defeat or being badly cheated.","zh":"“hosing”通常指用水管喷洒或冲洗；口语里也可指惨败或在交易中吃大亏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"spraying or washing something with water (or another liquid) from a hose; the present participle of “hose.”","zh":"用水管喷洒或冲洗（或用软管输送液体）；“hose”的现在分词。"},"examples":[{"en":"He’s hosing down the driveway after the storm.","zh":"暴风雨过后，他正在用水管把车道冲洗干净。"},{"en":"The staff were hosing the muddy boots before people came inside.","zh":"工作人员在大家进屋前用水管冲洗沾满泥的靴子。"}]},{"partOfSpeech":"n.","definition":{"en":"the action or process of using a hose; also, the act of spraying water with a hose.","zh":"用水管的行为或过程；也指用水管喷水冲洗这件事。"},"examples":[{"en":"Regular hosing helps keep the patio clean.","zh":"定期用水管冲洗有助于保持露台清洁。"},{"en":"The garden needs light hosing in the early morning.","zh":"花园清晨需要轻轻喷洒一些水。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a severe defeat or a situation where someone is treated very unfairly, especially financially (“get a hosing”).","zh":"（非正式）惨败；或被很不公平地对待，尤指在钱方面吃大亏（“get a hosing”）。"},"examples":[{"en":"Our team took a hosing in the final game.","zh":"我们队在决赛里惨败。"},{"en":"I got a hosing on that used car—it needed repairs right away.","zh":"那辆二手车我吃了大亏——马上就要修。"}]}],"synonyms":["spraying","washing down","rinsing","dousing","(informal) blowout","(informal) rip-off"],"phonetic":"ˈhoʊzɪŋ","extraExplanation":["“get a hosing / take a hosing”是美式口语：把“被水管猛冲”这种很难受、被压着打的画面，借用来形容“被打得很惨”或“被坑得很厉害”。常见于体育报道、商业/交易聊天中。"]}
{"word":"hosiomartyr","summary":{"en":"A (rare) term in Eastern Christianity for a monk or nun who became a saint through martyrdom.","zh":"一个较少见的宗教术语，指东方基督教传统中“以殉道成圣的修士或修女”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Christianity) A monk or nun who is recognized as a saint for dying (or suffering death) because of their Christian faith; a monastic martyr.","zh":"（东正教等东方基督教传统）指因基督信仰而殉道、并被尊为圣人的修士或修女；即“修道殉道者”。"},"examples":[{"en":"In the Orthodox calendar, she is commemorated as a hosiomartyr.","zh":"在东正教圣历中，她被纪念为一位“修道殉道者”（hosiomartyr）。"},{"en":"The icon describes him as a monk and a hosiomartyr who died during persecution.","zh":"这幅圣像说明他是一位修士，也是一位在迫害中殉道的修道殉道者。"}]}],"synonyms":["monastic martyr","saint-martyr","martyr (general)"],"phonetic":"/ˌhoʊziˈoʊmɑrtər/","extraExplanation":["这个词比较少见，多用于东正教/东方基督教的“圣人称号”体系中。它由希腊语词根构成：hosios（意为“虔敬、圣洁的”，常指修道者/隐修者的圣德）+ martyr（殉道者）。因此 hosiomartyr 通常特指“修士/修女身份的殉道圣人”。","相关称号可对比：hieromartyr（神父/主教等圣职人员的殉道者）、martyr（一般殉道者）。在阅读圣人传记、圣历（calendar/synaxarion）或圣像说明（icon inscription）时更常见。"]}
{"word":"hosp","summary":{"en":"“hosp” is an informal written abbreviation for “hospital.”","zh":"“hosp”是“hospital（医院）”的非正式书面缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, written) an abbreviation of “hospital,” often used in medical notes, schedules, or quick messages.","zh":"（非正式、书面）“hospital（医院）”的缩写，常见于医疗记录、排班或简短消息中。"},"examples":[{"en":"Pt transferred to hosp for further tests.","zh":"病人被转到医院做进一步检查。"},{"en":"Call me when you get to the hosp.","zh":"你到医院了给我打电话。"}]}],"synonyms":["hospital (full form)"],"phonetic":"/hɑsp/","extraExplanation":["“hosp”更常见于书面速记（如病历、交班、排班表、短信），正式写作一般写全“hospital”。","在口语中人们通常不会读成“hosp”，而是直接说“hospital”。如果需要读出来，有人会读成类似/hɑsp/，但并不统一。","有时也会写作“hosp.”（带句点）来表示缩写。"]}
{"word":"hospes","summary":{"en":"Hospes is a Latin word used in English mainly for etymology, meaning “guest” or “host.”","zh":"Hospes 是拉丁语词，英语中多用于词源说明，意思是“客人”或“主人/东道主”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; used in English mainly in etymology/history) a “guest” or “host,” often with the idea of a reciprocal relationship (the same person could be treated as guest in one place and host in another).","zh":"（拉丁语；英语中多用于词源/历史语境）“客人”或“主人/东道主”，常带有互惠关系的含义（同一个人在不同地方可能既是客人也能成为主人）。"},"examples":[{"en":"In Latin, hospes can mean either a guest or a host, depending on context.","zh":"在拉丁语里，hospes 既可指“客人”，也可指“主人/东道主”，要看语境。"},{"en":"The word hospitality is historically linked to the Latin hospes.","zh":"英语单词 hospitality（好客、款待）在历史上与拉丁语 hospes 有关联。"}]}],"synonyms":["host","guest","(Latin) hospes"],"phonetic":"/ˈhɑs.piːz/","extraExplanation":["hospes 常被用来解释英语词源：hospital（医院/收容所）、hospitality（好客、款待）、host（主人/主办方）等都与“接待、款待来客”的概念有关。","有趣的是，拉丁语里与“外来者/陌生人”相关的词族后来在不同语言中分化：一支发展出“款待/接待”的正面含义（hospitality），另一支在历史演变中也出现了偏负面的方向（如 hostile 这一词族与“敌对”有关）。","在现代英语里，hospes 本身不是常用词，多见于古典学、历史学、语言学或词源说明。"]}
{"word":"hospice","summary":{"en":"Hospice is comfort-focused care and support for people near the end of life (and their families).","zh":"Hospice 指为生命末期患者及其家属提供以舒适减痛与支持为主的安宁疗护/临终关怀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A service or place that provides comfort-focused care for people who are near the end of life, aiming to reduce pain and support the patient and family rather than cure the illness.","zh":"（临终）安宁疗护/临终关怀：为生命末期患者提供以舒适与减轻痛苦为主的照护，并支持家属，而非以治愈疾病为目标。"},"examples":[{"en":"After her cancer spread, she chose hospice care to focus on comfort.","zh":"癌症扩散后，她选择了安宁疗护，把重点放在舒适与减痛上。"},{"en":"The hospice team supported the family with counseling and home visits.","zh":"临终关怀团队通过心理辅导和上门探访来支持家属。"}]},{"partOfSpeech":"v.","definition":{"en":"To provide hospice care for someone who is nearing the end of life.","zh":"为临终患者提供安宁疗护/临终关怀。"},"examples":[{"en":"They decided to hospice him at home, with nurses visiting regularly.","zh":"他们决定让他在家接受安宁疗护，护士会定期上门。"}]}],"synonyms":["end-of-life care","hospice care","terminal care","palliative care (related)"],"phonetic":"/ˈhɑːspɪs/","extraExplanation":["“hospice”常与“palliative care（姑息治疗/缓和医疗）”一起出现：palliative care可以在疾病任何阶段提供、可与积极治疗并行；而hospice通常指预期寿命较短、以舒适照护为主、往往不再以治愈为目标的阶段。","在英语语境里，说“on hospice”表示“正在接受临终关怀服务”；“hospice nurse / hospice team”指提供这类照护的专业人员。","词源上与hospital同源，来自表示“接待/款待”的概念，体现了照护与陪伴的意义。"]}
{"word":"hospices","summary":{"en":"Hospices are places or services that provide comfort-focused care for seriously ill people, often near the end of life.","zh":"Hospices 指提供以舒适与支持为主的临终关怀机构或服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place or service that provides comfort-focused care for people who are seriously ill (often near the end of life), supporting both patients and families","zh":"（临终关怀）为重病（常为生命末期）患者提供以舒适与支持为主的照护机构或服务，并支持家属"},"examples":[{"en":"Her grandfather received hospice care at home during his final months.","zh":"她的祖父在生命最后几个月在家接受了临终关怀。"},{"en":"The local hospice offers counseling for families as well as medical support.","zh":"当地的临终关怀机构不仅提供医疗支持，也提供家属心理辅导。"},{"en":"Donations help hospices provide pain relief and emotional support.","zh":"捐款帮助临终关怀机构提供止痛和情感支持。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a shelter or lodging for travelers, especially run by a religious group","zh":"（历史义）旅行者的收容所或旅舍，尤指由宗教团体经营"},"examples":[{"en":"In the Middle Ages, some hospices offered food and beds to pilgrims.","zh":"在中世纪，一些收容所会为朝圣者提供食物和床位。"}]}],"synonyms":["hospice care","end-of-life care","terminal care","palliative care (related)"],"phonetic":"/ˈhɑspɪs/","extraExplanation":["在现代英语里，hospice 最常见的语境是“临终关怀”。它强调缓解疼痛、提升生活质量与心理支持，而不以“治愈疾病”为主要目标。","hospice care 可以在专门机构（a hospice facility）进行，也可以在家中进行（home hospice / hospice care at home）。","hospice（临终关怀）与 palliative care（姑息治疗/缓和医疗）相关但不完全相同：palliative care 可在疾病任何阶段提供；hospice 通常用于预期生命进入末期时的照护。"]}
{"word":"Hospit","summary":{"en":"Hospital: a place for medical treatment; also meaning related to hospitals.","zh":"Hospital：医院；也可作形容词表示“医院的/住院的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where sick or injured people are treated by doctors and nurses","zh":"医院；治疗病人或受伤者的机构"},"examples":[{"en":"She was taken to the hospital after the accident.","zh":"事故后她被送往医院。"},{"en":"My grandfather is in the hospital for surgery.","zh":"我爷爷住院做手术。"},{"en":"The hospital is only ten minutes from here.","zh":"医院离这里仅十分钟。"}]},{"partOfSpeech":"adj.","definition":{"en":"connected with a hospital or medical care in a hospital","zh":"医院的；住院（治疗）的"},"examples":[{"en":"He works in hospital administration.","zh":"他在医院行政部门工作。"},{"en":"She is receiving hospital care.","zh":"她正在接受住院治疗。"}]}],"synonyms":["medical center","clinic","infirmary"],"phonetic":"/ˈhɑːspɪtəl/","extraExplanation":["你输入的 “Hospit” 不是一个完整的常用单词，最常见的目标词是 **hospital**。它来自拉丁语 *hospes*（“客人/主人”），与 **host**（主人）、**guest**（客人）、**hospitable**（好客的）、**hospitality**（款待）属于同一词源家族。","美式英语中常说 **in the hospital**（住院/在医院里）；英式英语更常说 **in hospital**（住院）。"]}
{"word":"hospit","summary":{"en":"A hospital is a place where sick or injured people receive medical care.","zh":"hospital 指“医院”，为病人或伤者提供医疗护理的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place where doctors and nurses treat people who are sick or injured.","zh":"医院；治疗生病或受伤者的场所。"},"examples":[{"en":"She was taken to the hospital after the accident.","zh":"事故后她被送往医院。"},{"en":"The hospital has an emergency room open 24 hours a day.","zh":"这家医院的急诊室全天24小时开放。"},{"en":"He works as a nurse at a children’s hospital.","zh":"他在一家儿童医院当护士。"}]}],"synonyms":["medical center","clinic (smaller)"],"phonetic":"/ˈhɑspɪtəl/","extraExplanation":["你输入的“hospit”本身不是一个完整单词，最常见是想写“hospital（医院）”。","“hospit-”这一词根来自拉丁语，和“接待/客人”有关，所以你会看到一些相关词：\n- hospitable（好客的）\n- hospitality（好客；款待）\n- hospice（临终关怀院/安宁疗护机构）","常见搭配：go to the hospital（去医院）、be in the hospital（住院/在医院）、hospital bed（病床）、hospital staff（医护人员/医院员工）。在美式英语里通常说“in the hospital”。"]}
{"word":"hospita","summary":{"en":"Hospital: a place for medical treatment and care.","zh":"Hospital：提供医疗治疗与护理的医院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where people go to receive medical care, stay for treatment, or have surgery","zh":"医院；医治和护理病人的地方"},"examples":[{"en":"She was taken to the hospital after the accident.","zh":"事故后她被送往医院。"},{"en":"My father is in the hospital for surgery.","zh":"我爸爸住院做手术。"},{"en":"The hospital has a busy emergency room.","zh":"这家医院的急诊室很忙。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common, formal) relating to giving help, shelter, or generous care; hospitable","zh":"（较少见，正式）好客的；乐于提供帮助与照顾的"},"examples":[{"en":"In older writing, “hospital” could mean kind and welcoming to strangers.","zh":"在较早的文学作品中，“hospital”有时表示对陌生人友善好客。"}]}],"synonyms":["medical center","clinic","infirmary"],"phonetic":"/ˈhɑspɪtəl/","extraExplanation":["你输入的“hospita”很可能是“hospital”的拼写未完成或拼写错误。常见相关词：hospitalize（使住院）、hospitalization（住院）、outpatient（门诊病人）、inpatient（住院病人）。"]}
{"word":"hospitabilis","summary":{"en":"Hospitabilis is a Latin adjective meaning “hospitable; welcoming to guests,” often seen in historical or ecclesiastical texts.","zh":"Hospitabilis 是拉丁语形容词，意为“好客的、欢迎来客的”，常见于历史或教会文献中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, adjective) hospitable; welcoming to guests or strangers.","zh":"（拉丁语，形容词）好客的；热情接待客人或陌生人的。"},"examples":[{"en":"In the old text, the monastery is described as hospitabilis—open to travelers and the poor.","zh":"在那部古文中，这座修道院被描述为 hospitabilis——向旅人和穷人敞开大门。"},{"en":"The inscription praises the town as hospitabilis, meaning it welcomes outsiders.","zh":"铭文称赞这座城镇为 hospitabilis，意思是它欢迎外来者。"}]}],"synonyms":["hospitable","welcoming","friendly","open to guests"],"phonetic":"/ˌhɑspɪˈtæbɪlɪs/","extraExplanation":["hospitabilis 是拉丁语词，来自 hospit-（与“客人/主人、款待”有关的词根），常见于中世纪或教会拉丁文，用来形容“乐于接待、提供庇护或施与款待”的地方（如修道院、医院、施济所）。","在现代英语里几乎不作为日常词汇使用；如果你想表达同样意思，通常用 hospitable（好客的）、welcoming（友好的、欢迎的）。","相关的英语同源词包括 hospital（医院；词源上与“接待/收容”有关）与 hospitality（款待；好客）。"]}
{"word":"hospitable","summary":{"en":"Hospitable means welcoming and generous to guests, and it can also describe a place that is suitable and comfortable to live in.","zh":"hospitable 既可表示“好客、热情招待”，也可形容“环境宜居、适合生存”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Friendly and welcoming to guests or strangers; generous in giving food, help, or comfort.","zh":"好客的；热情欢迎客人或陌生人，并慷慨提供食物、帮助或照顾。"},"examples":[{"en":"They were very hospitable and invited us in for tea.","zh":"他们非常好客，邀请我们进去喝茶。"},{"en":"Thank you for your hospitable welcome during our stay.","zh":"感谢你们在我们停留期间热情周到的招待。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a place or environment) Pleasant or suitable for living, staying, or growing.","zh":"（指地方或环境）宜居的；适合居住、停留或生长的。"},"examples":[{"en":"The island’s climate is hospitable to many kinds of plants.","zh":"这座岛的气候适合多种植物生长。"},{"en":"They searched for a more hospitable region to settle in.","zh":"他们寻找一个更宜居的地区定居。"}]}],"synonyms":["welcoming","friendly","cordial","warm","generous"],"phonetic":"/hɑˈspɪtəbəl/","extraExplanation":["词源上，hospitable 与 host（主人/东道主）以及 hospital（医院）同源，核心含义都与“接待/照料”有关：对人是“热情招待”，对环境是“适合生存、让人/事物待得住”。","常见搭配：hospitable people/hosts（好客的人/主人）、a hospitable home（热情的家庭氛围）、a hospitable climate/environment（宜人的气候/环境）。反义词常见有 inhospitable（不适宜的；冷漠的）。"]}
{"word":"hospitableness","summary":{"en":"Hospitableness means the quality of being warm and welcoming to guests; it’s a less common synonym of “hospitality.”","zh":"hospitableness 指“热情好客、欢迎宾客”的品质；是较少用的“hospitality（好客；款待）”的近义词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being welcoming and generous to guests; hospitality.","zh":"热情好客；待客周到的品质（好客之道）。"},"examples":[{"en":"We were touched by the hospitableness of the local families who invited us in for dinner.","zh":"当地家庭邀请我们去吃晚饭，他们的热情好客让我们很感动。"},{"en":"Her hospitableness made new colleagues feel comfortable right away.","zh":"她的热情好客让新同事立刻感到自在。"}]}],"synonyms":["hospitality","warmth","friendliness","welcoming nature","generosity"],"phonetic":"/hɑːˈspɪtəbəlnəs/","extraExplanation":["“hospitableness”是由形容词“hospitable（好客的）”加名词后缀“-ness”构成，表示“……的性质/状态”。在现代英语里更常用、更自然的名词是“hospitality（款待；好客）”。","语体上，“hospitableness”偏正式、稍显少用，常见于较书面或修辞性的表达；日常对话里通常说“their hospitality”。","注意不要和“hospital（医院）”混淆：两者同源（都与“接待客人”有关），但现代意义已不同。"]}
{"word":"hospitably","summary":{"en":"Hospitably means “in a warm, welcoming way toward guests.”","zh":"hospitably 表示“以热情、好客的方式招待客人”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a friendly, generous way that makes guests or strangers feel comfortable and welcome.","zh":"以友好、慷慨的方式（待客），让客人或陌生人感到舒适与受欢迎。"},"examples":[{"en":"They greeted us hospitably and offered tea as soon as we arrived.","zh":"我们一到，他们就热情地迎接并立刻端上茶。"},{"en":"Even in a small apartment, she always hosts people hospitably.","zh":"即使住在小公寓里，她也总能把客人招待得很周到。"}]}],"synonyms":["warmly","welcomingly","cordially","generously"],"phonetic":"/hɑˈspɪtəbli/","extraExplanation":["“hospitably”来自“hospitable”（好客的）+ -ly（副词后缀），常用来描述“接待/招待”的方式。常见搭配：welcome someone hospitably（热情款待某人）、receive guests hospitably（热情接待客人）。","注意区分：hospitably（好客地）≠ hospital（医院）。两者词源有关（都与“接待/照顾”相关），但现代含义不同。"]}
{"word":"hospitage","summary":{"en":"Hospitage is a rare, old-fashioned word meaning hospitality or lodging given to a guest.","zh":"Hospitage 是一个罕见的古用词，指对客人的款待或提供住宿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) Lodging or shelter provided to a guest; hospitality, especially the act of receiving and entertaining visitors.","zh":"（罕见/古用）为客人提供的住宿或庇护；款待、招待（尤指接待并照顾来访者的行为）。"},"examples":[{"en":"The traveler asked the monastery for hospitage for the night.","zh":"旅人请求修道院提供一晚的住宿与接待（hospitage）。"},{"en":"In old records, hospitage could include food, a bed, and basic protection.","zh":"在旧文献中，hospitage 可能包括食物、床铺和基本的保护。"}]}],"synonyms":["hospitality","lodging","accommodation","shelter"],"phonetic":"/ˈhɑspɪtɪdʒ/","extraExplanation":["“hospitage”非常少见，现代英语更常用“hospitality（好客/款待）”“lodging（住宿）”“accommodation（住处/住宿安排）”。","词源上与“host（主人/接待者）”“hospitality”同源；在一些古老文本或历史语境中可能出现。","如果你是在现代写作中想表达“提供住宿与招待”，通常说“offer hospitality”或“provide lodging/accommodation”更自然。"]}
{"word":"hospital","summary":{"en":"A hospital is a medical place where doctors and nurses care for and treat patients.","zh":"hospital 指“医院”，是医生和护士为病人提供治疗与照护的医疗机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where sick or injured people are treated by doctors and nurses","zh":"医院；为病人或伤者提供医生与护士治疗照护的地方"},"examples":[{"en":"She was taken to the hospital after the accident.","zh":"事故后她被送到了医院。"},{"en":"My grandfather is in the hospital for tests.","zh":"我爷爷住院做检查。"},{"en":"The hospital has an emergency room open 24 hours a day.","zh":"这家医院的急诊室全天24小时开放。"}]}],"synonyms":["medical center","clinic (usually smaller)","infirmary (often in a school or institution)"],"phonetic":"/ˈhɑːspɪtəl/","extraExplanation":["美式英语里常说“in the hospital”（住院/在医院接受治疗）；英式英语更常说“in hospital”。","相关常用表达：go to the hospital（去医院）、be admitted to the hospital（入院）、be discharged from the hospital（出院）、emergency room/ER（急诊室）。","词源提示：hospital 源自拉丁语 hospes（客人/主人），引申为“接待、照护他人的地方”，所以也常和 care（照护）联系在一起。"]}
{"word":"hospital-acquired","summary":{"en":"originating in a hospital setting","zh":"在医院环境中发生或获得的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Caught or developed in a hospital or other healthcare facility (not present or incubating before admission).","zh":"在医院或其他医疗机构内感染或发生的（入院前不存在或未处于潜伏期）。"},"examples":[{"en":"The patient developed a hospital-acquired infection after surgery.","zh":"这位患者在手术后出现了医院获得性感染。"},{"en":"Hand hygiene is key to preventing hospital-acquired pneumonia.","zh":"手卫生是预防医院获得性肺炎的关键。"}]}],"synonyms":["healthcare-associated","nosocomial"],"phonetic":"/ˈhɑspɪtəl əˈkwaɪɚd/","extraExplanation":["常见近义表达：healthcare-associated（医疗相关的，范围更广，可包括养老院、透析中心等）；与 community-acquired（社区获得性）相对。","医学写作里常见搭配：hospital-acquired infection (HAI)、hospital-acquired pneumonia (HAP)、hospital-acquired complication。"],"etymology":"由 hospital（医院）+ acquired（获得的）构成，用于医学语境，强调“在院内发生/获得”，常与 infection, pneumonia, complication 等词搭配。","mnemonic":["把它拆开记：hospital（医院）+ acquired（获得）→“在医院里获得的”。","联想对比：community-acquired=“在社区获得的”；hospital-acquired=“在医院获得的”。"]}
{"word":"hospitalary","summary":{"en":"“Hospitalary” is a rare, old-fashioned adjective meaning “hospitable,” and sometimes “related to hospitals.”","zh":"“Hospitalary”是一个罕用的旧式形容词，主要表示“好客的”，有时也指“与医院有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/old-fashioned) relating to hospitality; welcoming and generous to guests.","zh":"（罕用/旧式）与待客之道有关的；好客的、热情款待的。"},"examples":[{"en":"In older writing, “hospitalary” described a household known for warm welcome to travelers.","zh":"在较早的写作中，“hospitalary”用来形容以热情接待旅人而闻名的家庭。"},{"en":"The inn kept a hospitalary tradition of sharing food with strangers.","zh":"这家客栈保留了与陌生人分享食物的好客传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) relating to a hospital or the running of hospitals.","zh":"（罕用）与医院或医院管理有关的。"},"examples":[{"en":"The report discussed hospitalary services in rural areas.","zh":"这份报告讨论了农村地区的医院服务。"}]}],"synonyms":["hospitable","welcoming","hospital","medical","healthcare-related"],"phonetic":"/ˌhɑːspɪˈtæləri/","extraExplanation":["“hospitalary”在现代英语中非常少见。日常表达通常用：\n- 表示“好客的”：hospitable（最常用）、welcoming。\n- 表示“与医院有关的”：hospital（作形容词，如 hospital care）、medical、healthcare。\n它与拉丁语 hospes（“客人/主人”）同源，因此既能指“待客”，也能延伸到“收容、照护”的含义。"]}
{"word":"hospitaler","summary":{"en":"Hospitaler is a rare spelling for Hospitaller, usually meaning a member of the Knights Hospitaller; more generally (old/rare), it can mean someone who offers charitable hospitality and care.","zh":"Hospitaler 是较少见的拼写，通常等同于 Hospitaller，指医院骑士团成员；更广义（旧/罕见）也可指提供慈善款待与照护的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the medieval religious-military order known as the Knights Hospitaller (Order of Saint John), originally devoted to caring for sick or injured pilgrims","zh":"（中世纪）医院骑士团成员；圣约翰骑士团成员（最初以照料生病或受伤的朝圣者为宗旨）"},"examples":[{"en":"The novel features a Hospitaler who escorts pilgrims to safety.","zh":"这部小说里有一位医院骑士团成员护送朝圣者到安全之地。"},{"en":"In the Crusades, the Hospitalers were known for running hospitals as well as fighting.","zh":"在十字军东征时期，医院骑士团以经营医院与作战而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(older/rare) a person who offers hospitality or charitable care, especially to travelers or the sick","zh":"（旧/罕见）提供款待或慈善照料的人，尤指照顾旅人或病患的人"},"examples":[{"en":"The town hired a hospitaler to manage the shelter for the poor.","zh":"镇上雇了一位施善照料者来管理救济所。"},{"en":"In old texts, a hospitaler may be described as serving strangers and the ill.","zh":"在旧文本中，hospitaler 常被描写为服务陌生人和病患的人。"}]}],"synonyms":["Hospitaller","Knight of St. John","caregiver","host","benefactor"],"phonetic":"ˈhɑspɪtələr","extraExplanation":["“hospitaler”在现代英语中较少见，更常见的拼写是 **Hospitaller**（尤其指“Knights Hospitaller”医院骑士团）。如果你是在历史、十字军或中世纪语境中看到它，多半就是这个专名的变体拼写。","词根与 **hospital / hospitality** 同源，来自拉丁语 *hospes*（客人/主人），因此含义与“接待、照护”相关。"]}
{"word":"hospitalis","summary":{"en":"Hospitalis is a rare Latin-derived adjective meaning “hospitable” or “related to a hospital/guest care,” mainly seen in Latin or historical/scientific contexts.","zh":"Hospitalis 是一个罕见的拉丁语来源形容词，常指“好客的”或“与医院/接待照护有关的”，主要见于拉丁文、历史或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; from Latin) relating to a guest or host; hospitable.","zh":"（罕见；源自拉丁语）与客人或主人（接待者）有关的；好客的。"},"examples":[{"en":"In medieval Latin texts, “hospitalis” could describe a house that welcomed travelers.","zh":"在中世纪拉丁文文献中，“hospitalis”可用来形容接待旅人的住所。"},{"en":"The monastery was known for its hospitalis spirit toward strangers.","zh":"这座修道院以对陌生人友善好客（hospitalis）的精神而闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare; Latin) relating to a hospital or the care of sick people.","zh":"（罕见；拉丁语）与医院或照护病患有关的。"},"examples":[{"en":"Some older academic writing uses Latin phrases with “hospitalis” when discussing hospital care.","zh":"一些较旧的学术写作在讨论医院照护时，会使用包含“hospitalis”的拉丁短语。"},{"en":"The term appears in historical records of hospitalis services provided by religious orders.","zh":"该词出现在历史记录中，用来指宗教团体提供的医院照护服务（hospitalis services）。"}]}],"synonyms":["hospitable","welcoming","hospital","clinical (context-dependent)"],"phonetic":"/ˌhɑːspɪˈtælɪs/","extraExplanation":["“hospitalis”不是现代英语里的常用词，更常见于拉丁文语境、历史研究，或作为生物学拉丁学名中的词根/词形（例如物种名的拉丁词尾）。","它与英语的 hospital（医院）和 hospitality（好客、款待）同源，核心概念是“接待、照料、为陌生人/病人提供庇护”。","若你是在某段拉丁文或学名里看到它，通常需要结合上下文判断更接近“好客的/与接待有关”还是“与医院照护有关”。"]}
{"word":"hospitalisation","summary":{"en":"Hospitalisation means being admitted to a hospital, or the time spent there for medical care (British spelling: hospitalisation; American: hospitalization).","zh":"hospitalisation 指“住院/入院治疗”或“住院期间”（英式拼写；美式常写作 hospitalization）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of being admitted to a hospital for treatment, or the period of staying in a hospital","zh":"住院；入院治疗；住院期间"},"examples":[{"en":"After the accident, he needed a week of hospitalisation.","zh":"事故后，他需要住院一周。"},{"en":"The doctor said hospitalisation might be necessary if her fever doesn’t improve.","zh":"医生说如果她的发烧没有好转，可能需要住院治疗。"}]}],"synonyms":["hospitalization","admission (to hospital)","inpatient care"],"phonetic":"/ˌhɑspɪtəlaɪˈzeɪʃən/","extraExplanation":["“hospitalisation”是英式拼写（-isation）；美式拼写更常见的是“hospitalization”（-ization）。两者意思完全一样。","在医疗语境里常见搭配有：need/require hospitalisation（需要住院）、avoid hospitalisation（避免住院）、risk of hospitalisation（住院风险）、length of hospitalisation（住院时长）。","相关词：be hospitalized（住院/被送进医院，动词短语）、in hospital（英式：住院中） vs. in the hospital（美式：在医院/住院）。"]}
{"word":"hospitalise","summary":{"en":"“Hospitalise” (BrE) means to admit someone to a hospital for treatment.","zh":"“hospitalise”（英式）指让某人入院接受治疗、住院。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(BrE) to take someone to a hospital for medical treatment; to be admitted to a hospital.","zh":"（英式）将某人送入医院接受治疗；住院。"},"examples":[{"en":"She was hospitalised after the accident.","zh":"事故后她被送医住院。"},{"en":"He was hospitalised with a high fever.","zh":"他因高烧而住院。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put someone in a hospital for a longer period because they need ongoing care.","zh":"因需要持续照护而让某人长期住院（或安排住院）。"},"examples":[{"en":"The doctors decided to hospitalise him overnight for observation.","zh":"医生决定让他留院观察一晚。"},{"en":"They hospitalised the patient to monitor her breathing.","zh":"他们安排病人住院以监测呼吸情况。"}]}],"synonyms":["hospitalize","admit (to hospital)","send to hospital"],"phonetic":"/ˈhɑːspɪtəˌlaɪz/","extraExplanation":["“hospitalise”是英式拼写；美式英语更常用“hospitalize”。两者意思相同，只是拼写差异（-ise vs -ize）。","常见搭配：be hospitalised (with/for …)（因……住院）；hospitalise someone for observation（让某人住院观察）。","语域上较正式/新闻体；日常口语也常说“go to the hospital”或“be in the hospital”。"]}
{"word":"hospitalism","summary":{"en":"Hospitalism most commonly means a hospital-acquired infection; it can also refer (especially in older writing) to the harmful effects of long institutional care, particularly in children.","zh":"Hospitalism最常见的意思是“院内感染”；在较旧文献中也可指长期机构/住院照护带来的不良身心影响，尤其是儿童。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hospital-acquired infection (an illness a patient catches while staying in a hospital or other healthcare facility).","zh":"医院内感染／院内感染（病人在住院或医疗机构内期间感染的疾病）。"},"examples":[{"en":"Good hand hygiene is one of the best ways to prevent hospitalism.","zh":"良好的手部卫生是预防院内感染最有效的方法之一。"},{"en":"The report investigated several cases of hospitalism in the surgical ward.","zh":"这份报告调查了外科病房的多起院内感染病例。"}]},{"partOfSpeech":"n.","definition":{"en":"Harmful physical or emotional effects caused by long stays in hospitals or institutions, especially (in older usage) the developmental problems seen in children raised in institutions with limited personal care.","zh":"长期住院或被机构收容所带来的身心不良影响；（较旧用法）尤其指在照护不足的机构中成长的儿童出现的发育与情绪问题。"},"examples":[{"en":"Some early studies linked severe neglect in institutions with hospitalism in infants.","zh":"一些早期研究将机构内严重忽视与婴儿的“医院化/机构化”问题联系起来。"},{"en":"To reduce hospitalism, staff encouraged family visits and more personal interaction.","zh":"为减少长期收治带来的不良影响，工作人员鼓励家属探视并增加个别互动。"}]}],"synonyms":["hospital-acquired infection","nosocomial infection","HAI","institutionalization (older sense)"],"phonetic":"/ˈhɑspɪtəlɪzəm/","extraExplanation":["“hospitalism”在现代医学英语里多指“院内感染”，但在较早的心理学/儿科文献中也用来指儿童在机构环境下因缺乏亲密照护而产生的“机构化”或发育受损现象。如今第二个含义常用更明确的说法，如 *institutionalization*（机构化）或 *hospital-acquired infection (HAI)*（医院获得性感染）。"]}
{"word":"hospitalitem","summary":{"en":"“Hospital item” means something used in a hospital, especially supplies or equipment.","zh":"“Hospital item”指医院里使用的物品，尤其是医疗用品或设备。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an object, supply, or piece of equipment used in a hospital (for care, diagnosis, cleaning, or administration)","zh":"医院用品；医院里使用的物品或设备（用于护理、诊断、清洁或管理）"},"examples":[{"en":"The nurse prepared the hospital items needed for the procedure, including gloves and gauze.","zh":"护士准备了操作所需的医院用品，包括手套和纱布。"},{"en":"Please label each hospital item before putting it into storage.","zh":"请在把每件医院用品放入储藏室之前贴好标签。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in inventory and purchasing) a product listed as part of a hospital’s supplies or equipment","zh":"（在库存与采购中）列为医院物资或设备的产品条目"},"examples":[{"en":"This hospital item is out of stock, so we need to reorder it.","zh":"这项医院物资缺货了，所以我们需要重新订购。"},{"en":"The database tracks each hospital item by code and expiry date.","zh":"数据库通过编号和有效期来追踪每项医院物资。"}]}],"synonyms":["medical supply","hospital supply","medical equipment","clinic supply"],"phonetic":"/ˈhɑspɪtəl ˈaɪtəm/","extraExplanation":["你输入的“hospitalitem”更像是把两个词连在一起写了。英语里更常写作“hospital item”（两个词）或用更具体的词：medical supply（医疗耗材）、medical equipment（医疗设备）、hospital supply（医院物资）。在正式文件中常见“hospital item number / item code”（物资编号）。"]}
{"word":"hospitalities","summary":{"en":"“Hospitalities” means welcoming, generous treatment of guests, or the specific food/drink and entertainment offered to them (plural of “hospitality”).","zh":"“hospitalities”是“hospitality”的复数，指对客人的热情款待，也可指具体提供的饮食与招待。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"friendly and generous treatment of guests or strangers; the welcoming behavior shown to visitors (plural form).","zh":"对客人或陌生人的友善与慷慨的接待；对来访者的欢迎与款待（复数形式）。"},"examples":[{"en":"Thanks for your hospitalities during our trip—we felt at home.","zh":"感谢你们在我们旅行期间的盛情款待——我们感觉像在家一样。"},{"en":"They are known for their warm hospitalities to international students.","zh":"他们以热情款待国际学生而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"food, drink, and other entertainment provided for guests; acts of hosting (often used in formal writing).","zh":"为客人提供的饮食与招待；接待与款待的行为（常见于较正式的表达）。"},"examples":[{"en":"The hotel offered complimentary hospitalities in the lounge.","zh":"酒店在休息室提供免费的招待（点心、饮料等）。"},{"en":"We accepted their hospitalities and stayed for dinner.","zh":"我们接受了他们的款待，留下来吃晚饭。"}]}],"synonyms":["hospitality","warm welcome","welcome","hosting","entertainment"],"phonetic":"/ˌhɑspɪˈtælɪtiz/","extraExplanation":["“hospitalities”是“hospitality”的复数。日常英语里更常说“hospitality”（不可数）来泛指“好客/款待”。用“hospitalities”时，通常强调“多次/多种具体的招待与款待”。","与“hospital”（医院）同源：都来自拉丁语词根，和“接待/收留客人”有关；现代英语里“hospitality”主要保留“好客、款待”的含义。"]}
{"word":"hospitality","summary":{"en":"Hospitality means warm, generous treatment of guests, and it can also mean the hotel/restaurant/tourism service industry.","zh":"Hospitality 指对客人的热情款待；也可指酒店、餐饮、旅游等服务行业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"friendly and generous welcome and care shown to guests or strangers","zh":"对客人或陌生人的友好、慷慨的欢迎与款待"},"examples":[{"en":"Thank you for your hospitality—we felt at home the whole time.","zh":"谢谢你的盛情款待——我们一直都感觉像在家一样。"},{"en":"In many cultures, offering tea or food is a sign of hospitality.","zh":"在许多文化中，端茶递食是好客与款待的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"the business or field of providing services for guests, especially hotels, restaurants, and tourism","zh":"（行业）为客人提供服务的领域，尤指酒店、餐饮与旅游业"},"examples":[{"en":"She studied hospitality management in college.","zh":"她在大学学习酒店管理（旅游与服务业管理）。"},{"en":"The city depends on hospitality and tourism for jobs.","zh":"这座城市的就业很大程度依赖于酒店服务业和旅游业。"}]}],"synonyms":["welcome","warmth","generosity","friendliness","hostliness","hotel and restaurant industry"],"phonetic":"/ˌhɑːspɪˈtælɪti/","extraExplanation":["词源上来自拉丁语 *hospes*（“客人/主人”），与 *host*（主人）和 *hospital*（医院）同源，核心概念都围绕“接待与照料他人”。","在英语里，*hospitality* 既可指个人层面的“热情款待”，也可指行业意义的“酒店/餐饮/旅游服务业”。根据语境判断：谈“谢谢招待”多为第一义；谈“专业、就业、管理”多为第二义。"]}
{"word":"hospitalization","summary":{"en":"Hospitalization means being admitted to a hospital for treatment, or the time you spend there.","zh":"Hospitalization 指因治疗而住院，或在医院住院的那段时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of admitting someone to a hospital for medical care, or the period of time spent in a hospital","zh":"住院；入院治疗；住院期间"},"examples":[{"en":"After the accident, she needed hospitalization for several days.","zh":"事故后，她需要住院治疗几天。"},{"en":"The doctor said hospitalization might be necessary if his fever doesn’t go down.","zh":"医生说如果他的发烧不退，可能需要住院。"},{"en":"The insurance plan covers most costs related to hospitalization.","zh":"这份保险计划涵盖与住院相关的大部分费用。"}]}],"synonyms":["admission (to the hospital)","hospital stay","inpatient care"],"phonetic":"/ˌhɑspɪtələˈzeɪʃən/","extraExplanation":["“hospitalization”在美式英语中是常见拼写；英式英语常写作“hospitalisation”。","常见搭配：need/require hospitalization（需要住院）、be hospitalized（住院/被送医住院）、a period of hospitalization（住院期）、costs of hospitalization（住院费用）。","语气与使用场景：它是较正式、偏医疗或保险文件的用词；日常口语里也常说“be in the hospital / be in hospital（英）”。"]}
{"word":"hospitalizations","summary":{"en":"“Hospitalizations” means hospital admissions or the number of people/times admitted to a hospital.","zh":"“hospitalizations”指住院/入院治疗，或（统计意义上）住院人数、住院次数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of being admitted to a hospital for medical care; the number of times people are admitted to a hospital","zh":"住院；入院治疗的过程；（统计中）住院人数或住院次数"},"examples":[{"en":"Flu-related hospitalizations rose sharply this winter.","zh":"今年冬天与流感相关的住院人数大幅上升。"},{"en":"The doctor wants to prevent hospitalizations by treating the condition early.","zh":"医生希望通过早期治疗来避免住院。"},{"en":"Most hospitalizations after the accident were short, lasting only a few days.","zh":"事故后大多数住院时间不长，只持续了几天。"}]}],"synonyms":["hospital admissions","admissions","inpatient stays"],"phonetic":"/ˌhɑːspɪtəlaɪˈzeɪʃənz/","extraExplanation":["“hospitalizations”是复数名词，来自“hospitalization”（住院、入院）。在公共卫生、新闻和研究报告中很常见，常用来谈趋势与统计：例如“COVID-19 hospitalizations”“preventable hospitalizations（可预防的住院）”。","日常口语里，人们更常说“be hospitalized（住院）”或“go to the hospital（去医院/住院）”。注意英式英语里常说“go to hospital”，美式英语更常说“go to the hospital”。"]}
{"word":"hospitalize","summary":{"en":"“Hospitalize” means to admit someone to a hospital for treatment.","zh":"“Hospitalize”指让某人住院、收治入院接受治疗。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to admit someone to a hospital for medical treatment","zh":"使（某人）住院；把（某人）送入医院接受治疗"},"examples":[{"en":"The doctor decided to hospitalize him overnight for observation.","zh":"医生决定让他住院过夜以便观察。"},{"en":"She was hospitalized after a car accident.","zh":"她在车祸后被送医住院。"}]}],"synonyms":["admit (to the hospital)","hospitalise"],"phonetic":"/ˈhɑːspɪtəˌlaɪz/","extraExplanation":["“hospitalize”在美式英语里很常用；英式英语也用，但有时会更常见到“be admitted to hospital / be admitted to the hospital”（被收治入院）。","常见搭配：hospitalize someone for (an illness/injury)（因……而让某人住院）；be hospitalized with (a condition)（因……而住院）。"]}
{"word":"hospitalized","summary":{"en":"“Hospitalized” usually means someone is in the hospital receiving medical treatment.","zh":"“hospitalized”通常表示某人正在医院接受治疗（住院）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"to be taken to a hospital for medical care (often because of illness or injury).","zh":"住院；被送进医院接受治疗（通常因生病或受伤）。"},"examples":[{"en":"He was hospitalized after the car accident.","zh":"他在车祸后被送医住院。"},{"en":"My grandmother was hospitalized with pneumonia last winter.","zh":"我奶奶去年冬天因肺炎住院。"},{"en":"She was hospitalized for three days and then sent home to rest.","zh":"她住院三天，然后回家休养。"}]},{"partOfSpeech":"vt.","definition":{"en":"to place someone in a hospital for treatment.","zh":"使某人住院；将某人送入医院治疗。"},"examples":[{"en":"Doctors decided to hospitalize him for observation overnight.","zh":"医生决定让他住院观察一晚。"},{"en":"The virus hospitalized many elderly people in the community.","zh":"这种病毒使社区里许多老人住院。"}]}],"synonyms":["in the hospital","admitted to the hospital","hospitalized for treatment","admitted"],"phonetic":"/ˈhɑːspɪtəˌlaɪzd/","extraExplanation":["“hospitalized”常作形容词，表示“正在住院/曾住院”。日常更口语的说法有：be in the hospital（美式）/ be in hospital（英式）。","在新闻里常见被动表达：was hospitalized with/for…（因……住院），比如 was hospitalized with COVID-19 / for surgery（因新冠/手术住院）。"]}
{"word":"hospitalizes","summary":{"en":"“Hospitalizes” means “admits someone to a hospital for treatment” (present tense, he/she/it).","zh":"“hospitalizes”表示“让某人住院/送医收治”（一般现在时第三人称单数）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “hospitalize”) to admit someone to a hospital for medical treatment, usually for a short period or because the condition is serious.","zh":"（hospitalize 的第三人称单数）把某人送医住院治疗；使住院（通常因病情较重或需要观察）。"},"examples":[{"en":"The doctors hospitalizes the patient overnight for observation.","zh":"医生让病人住院一晚进行观察。"},{"en":"If the infection gets worse, the hospital hospitalizes him immediately.","zh":"如果感染恶化，医院会立刻让他住院。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common, especially in mental health contexts) to place someone in a hospital or institution for psychiatric care.","zh":"（较少见，尤用于心理健康语境）将某人送入医院或机构接受精神/心理治疗。"},"examples":[{"en":"The court hospitalizes him for psychiatric evaluation.","zh":"法院将他送医进行精神评估。"}]}],"synonyms":["admits (to the hospital)","sends to the hospital","places in hospital"],"phonetic":"/ˈhɑspɪtəˌlaɪz/","extraExplanation":["“hospitalize”在美式英语中很常见，意思是“住院/让……住院”。英式英语里也会用“hospitalise”（-ise 拼写）。在实际表达中，更自然的说法常是：be hospitalized（住院）或 be admitted to the hospital（被收治入院）。"]}
{"word":"hospitalizing","summary":{"en":"Hospitalizing means sending someone to a hospital or keeping them there for medical treatment.","zh":"Hospitalizing 指把某人送进医院或让其住院接受治疗。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of sending someone to a hospital for treatment, or keeping someone in a hospital for care","zh":"将某人送入医院接受治疗；（使某人）住院治疗"},"examples":[{"en":"The doctor recommended hospitalizing him overnight for observation.","zh":"医生建议让他住院观察一晚。"},{"en":"Hospitalizing patients during flu season can reduce the risk of complications.","zh":"在流感季让病人住院治疗可以降低并发症风险。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle) currently sending someone to a hospital or treating them in a hospital","zh":"（现在分词）正在将某人送医；正在住院治疗/在医院接受治疗"},"examples":[{"en":"They are hospitalizing several people after the accident.","zh":"事故发生后，他们正在让几个人住院治疗。"},{"en":"The clinic is hospitalizing only the most severe cases this week.","zh":"这家诊所本周只让最严重的病例住院。"}]}],"synonyms":["admitting (to a hospital)","hospital admission","placing in the hospital","institutionalizing (medical context)"],"phonetic":"/ˈhɑspɪtəˌlaɪzɪŋ/","extraExplanation":["“hospitalizing”来自动词 hospitalize。英式拼写常见为 hospitalising（-ise 结尾）。","在日常表达里，更常说 be hospitalized（被送医/住院）或 be in the hospital（在医院）。例如：He was hospitalized for three days. / He’s in the hospital.","注意：hospitalize 通常是“把某人送去住院”的意思，不等于“去医院探望”。“探病”常用 visit someone in the hospital。"]}
{"word":"Hospitaller","summary":{"en":"a member of the Knights Hospitaller or, more generally, a person who offers hospitality","zh":"医院骑士团成员；泛指好客、款待他人的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of a religious order originally devoted to caring for the sick and assisting travelers/pilgrims, especially the Knights Hospitaller.","zh":"宗教骑士团成员（最常指“医院骑士团/圣约翰骑士团”），起初以照料病人、救助旅人/朝圣者为使命。"},"examples":[{"en":"The museum has armor attributed to a Hospitaller from the Crusades era.","zh":"博物馆里有一套据称属于十字军时期医院骑士团成员的盔甲。"},{"en":"In the novel, a Hospitaller treats wounded pilgrims at a coastal fortress.","zh":"在小说中，一名医院骑士团成员在海岸要塞为受伤的朝圣者治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who offers hospitality; a host (rare, formal).","zh":"好客的人；款待宾客的人（较少见、较正式）。"},"examples":[{"en":"She was a generous hospitaller, always making room at her table for strangers.","zh":"她非常好客，总愿意为陌生人留出餐桌上的位置。"},{"en":"The village remembered him as a hospitaller to travelers during harsh winters.","zh":"村里人记得他在严冬里常常款待过路旅人。"}]}],"synonyms":["knight","order member","caregiver","host","benefactor"],"phonetic":"/ˈhɑːspɪtəlɚ/","extraExplanation":["“Knights Hospitaller”常译为“医院骑士团/圣约翰骑士团”，中世纪起源于耶路撒冷，最初是救护与收容机构，后发展为军事宗教骑士团；相关历史常与十字军、马耳他等地联系在一起。","拼写有时见到变体 hospitaler；在历史语境下两者多可互换，但现代更常见 hospitaller。"],"etymology":"源自中世纪拉丁语 hospitalarius（与“hospital/hostel/host”同源），本义与“接待、收容、照护旅人和病患”相关，后来也特指以此为宗旨的骑士修会成员。","mnemonic":["联想 hospital（医院）+ -er（从事者）：“在医院/收容所里照护他人的人”。","把它记成“hospital + (t)aller”：多了个 t，像多一份“照护的力度/团队”。"]}
{"word":"hospitaller","summary":{"en":"A hospitaller is usually a member of the medieval Knights Hospitaller, known for caring for pilgrims and the sick (and later acting as a military order).","zh":"hospitaller 通常指中世纪“医院骑士团”（圣约翰骑士团）的成员，以照护朝圣者和病患闻名（后期也具有军事性质）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a medieval religious order (especially the Knights Hospitaller) that cared for sick or injured travelers and pilgrims and also became a military order","zh":"（中世纪宗教骑士团的）医院骑士团成员；（尤指）圣约翰医院骑士团成员，最初照料病人和朝圣者，后来也发展为军事骑士团"},"examples":[{"en":"The museum has an exhibit about the Knights Hospitaller and their hospitals.","zh":"博物馆有一个关于圣约翰医院骑士团及其医院的展览。"},{"en":"In the novel, a Hospitaller escorts pilgrims safely across dangerous roads.","zh":"在小说里，一位医院骑士团成员护送朝圣者安全穿越危险的道路。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a person in charge of a hospice or hospital; someone who provides lodging and care to guests, especially the sick or travelers","zh":"（历史用法）管理收容所/医院的人；（尤指）为旅人或病患提供住宿与照料的人"},"examples":[{"en":"Records mention a hospitaller who organized food and beds for travelers.","zh":"史料提到一位负责为旅人安排食物和床铺的收容所管理者。"}]}],"synonyms":["Knight Hospitaller","Hospitaller knight","member of the Order of St. John"],"phonetic":"/ˌhɑːspɪˈtælɚ/","extraExplanation":["词源与背景：hospitaller 来自与 hospitality（款待、好客）、hospital（医院）同源的词根，核心意思是“接待与照护”。在英语里最常见的用法指 Knights Hospitaller（医院骑士团），他们在十字军时期起源于耶路撒冷，最初提供医疗与住宿服务，后来也参与军事行动。","用法提示：现代日常英语中很少用 hospitaller 指一般“医院工作人员”。如果你想说“医院工作人员/医护人员”，更常用 hospital staff / medical staff / nurse / doctor 等。","文化与文学：在历史小说、宗教史、十字军相关书籍或博物馆说明文字中更常见。相关词组：Order of St. John（圣约翰骑士团/医院骑士团）、Crusades（十字军东征）、pilgrims（朝圣者）。"]}
{"word":"hospitalman","summary":{"en":"A U.S. Navy enlisted medical specialist (often called a corpsman).","zh":"美国海军的士兵医疗专业人员（常称 corpsman/卫生兵）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S. Navy) an enlisted medical specialist who provides basic healthcare, first aid, and emergency treatment, often working with sailors and Marines.","zh":"（美国海军）医院兵/卫生兵：负责基础医疗护理、急救与紧急救治的士兵，常为水兵与海军陆战队员提供医疗支援。"},"examples":[{"en":"My cousin served as a hospitalman and learned trauma care on deployment.","zh":"我表哥当过医院兵，在海外部署时学习了创伤救治。"},{"en":"The hospitalman treated the injured Marine before the helicopter arrived.","zh":"直升机到达前，医院兵先为受伤的陆战队员做了处理。"}]}],"synonyms":["corpsman","Hospital Corpsman","medic"],"phonetic":"/ˈhɑːspɪtəlmæn/","extraExplanation":["“hospitalman”主要是美国海军的军衔/专业名称（rating），常见缩写是 HM（Hospital Corpsman）。在实际用语里，人们更常说 “corpsman”（军医/卫生兵，尤其指随海军陆战队行动的医疗兵）。","如果你在美国军事语境或影视作品中看到 “Doc”，很多时候也是对海军医院兵（corpsman/hospitalman）的昵称，带有尊敬与信任的意味。"]}
{"word":"hospitalmen","summary":{"en":"“Hospitalmen” means U.S. Navy enlisted medical workers; it is the plural of “hospitalman.”","zh":"“hospitalmen”指美国海军的医务兵/医院兵，是“hospitalman”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a U.S. Navy enlisted medical worker (a Hospital Corpsman), especially at the rank/paygrade Hospitalman (HN, E-3); plural of “hospitalman.”","zh":"（美国海军）医院兵／医务兵（隶属“医院军士/医务兵 Hospital Corpsman”体系），尤其指“Hospitalman（HN，E-3）”这一等级；为“hospitalman”的复数。"},"examples":[{"en":"Two hospitalmen treated the injured sailors on deck.","zh":"两名医院兵在甲板上为受伤的水手进行救治。"},{"en":"In the report, the hospitalmen were praised for quick first aid.","zh":"报告中表扬了这些医院兵迅速实施急救。"}]}],"synonyms":["corpsmen","Navy medics","Hospital Corpsmen"],"phonetic":"/ˈhɑspɪtlmɛn/","extraExplanation":["“Hospitalman”是美国海军“Hospital Corpsman（医务兵）”体系中的一个具体军衔/薪级称呼（HN，约相当于E-3）。在现代更常见的总称是“corpsman（医务兵）”，而“hospitalman/ hospitalmen”更偏正式或出现在军队文件、传记、历史叙述中。","复数形式是不规则变化：hospitalman → hospitalmen（类似 man → men）。"]}
{"word":"hospitals","summary":{"en":"“Hospitals” is the plural of “hospital,” meaning places where people receive medical treatment and care.","zh":"“hospitals”是“hospital”的复数，指为人们提供医疗照护与治疗的医院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Buildings or institutions where sick or injured people receive medical care and treatment.","zh":"医院；收治并治疗病人或伤者的医疗机构/场所。"},"examples":[{"en":"The city built two new hospitals to serve the growing population.","zh":"这座城市新建了两家医院，以服务不断增长的人口。"},{"en":"She was taken to the hospital, and her family visited her every day.","zh":"她被送到医院，她的家人每天都去探望她。"},{"en":"Many hospitals offer emergency care 24 hours a day.","zh":"许多医院提供全天24小时的急诊服务。"}]}],"synonyms":["medical centers","clinics (often smaller)","infirmaries (formal/older)"],"phonetic":"/ˈhɑspɪtəlz/","extraExplanation":["“Hospitals”是“hospital”的复数形式；美式英语中更常说“go to the hospital”（去医院/住院），英式英语也常用“go to hospital”（不加the）表示“住院/去就医（强调状态）”。","词汇搭配：children’s hospital（儿童医院）、general hospital（综合医院）、teaching hospital（教学医院）、community hospital（社区医院）、hospital stay（住院期）、hospital room/ward（病房）。"]}
{"word":"hospitant","summary":{"en":"Hospitant is a rare formal word meaning ‘temporarily staying as a guest’ or ‘a temporary guest-resident,’ often used in religious/historical contexts.","zh":"Hospitant 是一个罕见的正式词，意思是“以客人身份暂住的/暂住者”，常见于宗教或历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, formal) Staying somewhere temporarily as a guest; lodging.","zh":"（罕见，正式）以客人身份暂住的；寄宿的。"},"examples":[{"en":"During the retreat, she was a hospitant at the monastery.","zh":"静修期间，她以客居者的身份暂住在修道院。"},{"en":"The letter mentioned several hospitant students living with local families.","zh":"信中提到有几位寄宿在当地家庭的暂住学生。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, formal) A person who lives somewhere temporarily as a guest (especially in a religious house).","zh":"（罕见，正式）暂住者；客居者（尤指在修道院等宗教机构暂住的人）。"},"examples":[{"en":"The hospitant was given a simple room and shared meals with the community.","zh":"这位客居者被安排了一间简朴的房间，并与团体一同用餐。"},{"en":"In old records, hospitants are listed alongside monks and novices.","zh":"在旧档案里，客居者常与修士和见习修士一起被登记在册。"}]}],"synonyms":["guest","visitor","boarder","temporary resident"],"phonetic":"/ˈhɑspɪtənt/","extraExplanation":["“hospitant”在现代英语中非常少见，多见于宗教/历史语境，指“暂住、寄宿”的人或状态。日常英语更常用：guest, visitor, boarder（寄宿者）, temporary resident（临时居民）。","很多学习者会把它误看成拼写错误：如果你想表达“犹豫的”，常见词是“hesitant”。如果你告诉我你的句子语境，我可以帮你确认想用哪个词。"]}
{"word":"hospitate","summary":{"en":"Hospitate is a rare verb meaning to host someone as a guest or to stay as a guest.","zh":"hospitate 是一个罕见动词，表示“接待客人”或“作客暂住”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) To receive or entertain someone as a guest; to provide lodging or hospitality.","zh":"（罕见）接待、款待（客人）；提供住宿或款待。"},"examples":[{"en":"The monastery once hospitated travelers who had nowhere else to stay.","zh":"这座修道院曾接待那些无处可住的旅人。"},{"en":"In older writings, a family might hospitate a visiting scholar for the summer.","zh":"在较早的作品里，一个家庭可能会在夏天接待来访的学者。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) To stay as a guest; to lodge temporarily.","zh":"（罕见）作客寄宿；暂住。"},"examples":[{"en":"He hospitated with friends while looking for an apartment.","zh":"他在找公寓期间暂住在朋友家。"}]}],"synonyms":["host","entertain","lodge","put up"],"phonetic":"/ˈhɑːspɪˌteɪt/","extraExplanation":["“hospitate”非常少见，多用于较旧或学术性的文本。更常见的表达是：host（接待）、put up（让某人借住）、lodge（提供/借住）。","很多学习者把它和“hesitate（犹豫）”混淆：拼写和意思完全不同。若你想表达“犹豫”，正确拼写通常是 hesitate。"]}
{"word":"hospitation","summary":{"en":"Hospitation is a rare noun meaning an observation visit (especially in teaching/medicine), and it can also mean hospitality in older usage.","zh":"hospitation 是个少见名词，常指（教育/医学中的）观摩访问；古义可指“款待/好客”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A visit to observe or learn from someone’s work, especially in teaching or medicine; an observation visit.","zh":"（少见）为观察学习而进行的拜访/听课/观摩，尤指教育或医学领域的“观摩访问”。"},"examples":[{"en":"The trainee teacher completed three hospitations before leading her own class.","zh":"这位实习教师在自己上课前完成了三次观摩听课。"},{"en":"During my rotation, I joined a hospitation to observe how the clinic handles emergencies.","zh":"轮转期间，我参加了一次观摩访问，观察诊所如何处理急诊情况。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) Hospitality; the act of hosting and providing for guests.","zh":"（古义）款待；好客；招待宾客的行为。"},"examples":[{"en":"The old text praised the family’s hospitation of travelers.","zh":"那本旧书称赞这家人对旅人的热情款待。"}]}],"synonyms":["observation visit","classroom observation","visitation","shadowing","hospitality (archaic sense)"],"phonetic":"/ˌhɑspɪˈteɪʃən/","extraExplanation":["“hospitation”在现代英语里非常少见，很多时候人们想表达的是“hospitalization”（住院/住院治疗）或“visitation/observation”（参观、探访、听课观摩）。如果你要说“住院”，更常用的词是“hospitalization”。","在一些欧洲英语语境（尤其是教育培训）里，“hospitation”可指“听课/观摩课”，相当于更常见的“classroom observation”。"]}
{"word":"hospitator","summary":{"en":"Hospitator is a very rare word meaning “host; someone who offers hospitality.”","zh":"Hospitator 是一个非常少见的词，意思是“主人；提供款待的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare/archaic) A host; a person who receives and entertains guests, offering hospitality.","zh":"（非常少见/古语）主人；接待并款待客人、提供款待的人。"},"examples":[{"en":"In older writing, the hospitator welcomed travelers with food and a warm bed.","zh":"在较旧的文字里，hospitator 会以食物和温暖的床铺欢迎旅人。"},{"en":"She acted as hospitator for visiting scholars, arranging meals and lodging.","zh":"她充当来访学者的 hospitator，安排餐食与住宿。"}]}],"synonyms":["host","welcomer","entertainer","provider of hospitality"],"phonetic":"/hɑˈspɪt.eɪ.tɚ/","extraExplanation":["这个词在现代英语里几乎不用，读者更常见、也更自然的表达是 host（主人/主办方）或 a hospitable person（好客的人）。","容易和 hospital（医院）混淆：hospitator 来自表示“款待/接待”的词根（与 hospitality 同源），不是“医院工作人员”的意思。"]}
{"word":"hospitia","summary":{"en":"Hospitia means inns or guest lodgings in ancient Rome (plural of hospitium).","zh":"Hospitia 指古罗马的旅店或接待住宿处（hospitium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, Latin loanword) Inns, lodging houses, or guest quarters in ancient Rome; plural of “hospitium.”","zh":"（历史用语，拉丁语借词）古罗马的旅店、住宿处或接待客人的住处；为“hospitium”的复数。"},"examples":[{"en":"Archaeologists believe these hospitia served travelers along the Roman road.","zh":"考古学家认为，这些 hospitia 为罗马道路上的旅人提供住宿。"},{"en":"The inscription mentions a hospitium; later texts refer to several hospitia in the same district.","zh":"铭文提到一个 hospitium；后来的文本则提到同一区域的多个 hospitia。"}]}],"synonyms":["inns","lodgings","guesthouses","hostels (historical context)"],"phonetic":"/hɑˈspɪʃiə/","extraExplanation":["“Hospitia”常见于古典学、考古或历史写作中，属于学术语境；日常英语里更常用“inn(s)”“lodging(s)”“guesthouse(s)”来表达类似概念。","词源上与英语“hospitality（好客）”“host（主人/主办方）”有共同的拉丁语根（hospes，意为“客人/主人”），体现了“接待与住宿”的核心含义。"]}
{"word":"hospitious","summary":{"en":"“Hospitious” is not standard English; it’s usually a misspelling of “hospitable” or “auspicious.”","zh":"“hospitious”不是标准英语词；通常是把“hospitable”或“auspicious”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; not a recognized English word in modern dictionaries. It is usually a misspelling of “hospitable” (welcoming to guests) or “auspicious” (suggesting success/good luck).","zh":"非标准拼写；现代英语词典中一般不收录。通常是把“hospitable”（好客的、热情招待客人的）或“auspicious”（吉祥的、预示成功/好运的）拼错了。"},"examples":[{"en":"Incorrect: The villagers were very hospitious to travelers. (Better: hospitable)","zh":"错误：村民对旅行者非常hospitious。（应为：hospitable，意为“好客的”）"},{"en":"Incorrect: It was a hospitious day to start a business. (Better: auspicious)","zh":"错误：这是一个hospitious的日子来创业。（应为：auspicious，意为“吉祥的/好兆头的”）"}]}],"synonyms":["hospitable","welcoming","friendly","auspicious","promising","favorable"],"phonetic":"/hɑˈspɪʃəs/","extraExplanation":["“hospitable”多用于人、地方、气氛（a hospitable host / a hospitable town）；“auspicious”多用于时间、征兆、开端（an auspicious moment / an auspicious start）。","记忆法：hospitable 里有“hospital”（医院/款待），联想到“招待、照顾”；auspicious 常出现在较正式的语境里，表示“好兆头”。"]}
{"word":"hospitium","summary":{"en":"Hospitium is a Latin-based term meaning (1) a Roman guest-friendship pact with mutual hospitality obligations, or (2) a lodging/guesthouse in historical writing.","zh":"Hospitium 指（1）古罗马的“宾友关系/款待盟约”，或（2）历史语境中的客舍、旅店。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Rome, a formal guest-friendship agreement (often between families, individuals, or communities) that created mutual duties of hospitality and protection.","zh":"（古罗马）“宾友关系/款待盟约”：一种正式的待客与互助协议（常见于家族、个人或城邦之间），双方有互相接待、保护等义务。"},"examples":[{"en":"In Roman history, hospitium could link two families as long-term guest-friends.","zh":"在罗马史里，hospitium 可以把两个家族长期绑定为“宾友”。"},{"en":"The envoy relied on hospitium to secure safe lodging while traveling.","zh":"使者在旅途中依靠 hospitium 来确保安全住宿。"}]},{"partOfSpeech":"n.","definition":{"en":"A place of lodging or hospitality (a guesthouse/inn), especially in older or scholarly writing about the ancient world.","zh":"（较古典/学术用法）住宿或接待之处；客舍、旅店。"},"examples":[{"en":"Pilgrims rested at a small hospitium outside the city walls.","zh":"朝圣者在城墙外一处小客舍（hospitium）休息。"},{"en":"The text describes a hospitium where travelers could eat and sleep.","zh":"这段文字描述了一处旅人可吃可住的客舍（hospitium）。"}]}],"synonyms":["guest-friendship","hospitality pact","lodging","guesthouse","inn"],"phonetic":"/hɑˈspɪti.əm/","extraExplanation":["这个词来自拉丁语 hospes（既可指“客人”也可指“主人/接待者”），反映了古代“待客”是一种双向义务的观念。","在罗马制度中，hospitium 有时会以“信物”（如刻字牌）作为凭证，便于后代或使者认定双方的宾友关系。","在现代英语里 hospitium 很少用于日常交流，更多见于古典学、罗马史或拉丁语相关语境。"]}
{"word":"hospitize","summary":{"en":"“Hospitize” is not standard; people usually mean “hospitalize”: to admit someone to a hospital or keep them in a hospital for treatment.","zh":"“hospitize”不是标准用法；通常想表达的是“hospitalize”：让某人入院或住院治疗。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Nonstandard spelling) Usually means “hospitalize”: to send someone to a hospital for medical treatment, or to keep someone in a hospital.","zh":"（非标准拼写）通常指“hospitalize”：把某人送进医院接受治疗；或让某人住院。"},"examples":[{"en":"After the accident, the doctors decided to hospitalize him overnight for observation.","zh":"事故后，医生决定让他住院观察一晚。"},{"en":"She was hospitalized with a severe infection.","zh":"她因严重感染而住院。"}]}],"synonyms":["hospitalize","admit (to the hospital)","send to the hospital"],"phonetic":"/ˈhɑːspɪtəlaɪz/","extraExplanation":["“hospitize”一般被视为拼写错误或非常少见的用法。标准写法是 **hospitalize**（美式），英式常写 **hospitalise**。","**hospitalize** 常见搭配：be hospitalized (with/for …)（因……住院）；hospitalize someone（让某人住院）。"]}
{"word":"hospodar","summary":{"en":"Hospodar most commonly means a historical prince/ruler of Wallachia or Moldavia; more broadly (from Slavic usage) it can mean a household master or host.","zh":"hospodar 常指历史上瓦拉几亚或摩尔达维亚的亲王/统治者；更广义（源自斯拉夫语用法）也可指一家之主或东道主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(History) A prince or ruler of Wallachia or Moldavia (regions in today’s Romania), especially in the early modern period.","zh":"（历史）摩尔达维亚或瓦拉几亚（今罗马尼亚一带）的君主/亲王，尤指近代早期。"},"examples":[{"en":"The historian wrote about a hospodar who tried to reform the tax system.","zh":"历史学家写到一位试图改革税制的“hospodar”（亲王）。"},{"en":"Several hospodars were appointed or confirmed under Ottoman influence.","zh":"在奥斯曼影响下，数位“hospodar”曾被任命或确认统治地位。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some Slavic languages, e.g., Ukrainian) a master of a household; a host; a landowner or head of a farm.","zh":"（部分斯拉夫语言中，如乌克兰语）一家之主；主人/东道主；地主或农场主。"},"examples":[{"en":"In Ukrainian, hospodar can mean “the хозя of the house.”","zh":"在乌克兰语里，hospodar 可以指“家里的主人/一家之主”。"},{"en":"The guest thanked the hospodar for the warm welcome.","zh":"客人感谢主人（hospodar）的热情招待。"}]}],"synonyms":["prince","ruler","sovereign","lord","master","host"],"phonetic":"/ˈhɑspədɑr/","extraExplanation":["这个词在英语里较少见，多出现在历史书写中，指摩尔达维亚/瓦拉几亚的统治者（类似“亲王”）。","词源与斯拉夫语族中表示“主人/家主”的词有关（如乌克兰语 господар），所以在不同语境里可能指“统治者”或“家里的主人”。阅读时可根据上下文判断是“君主/亲王”还是“主人/东道主”。"]}
{"word":"hospodariat","summary":{"en":"Hospodariat is a rare Romanian-derived word meaning good, practical household or property management.","zh":"hospodariat（罕见词，源自罗马尼亚语）指“把家/院子/家业打理得很好”的持家与经营能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Borrowed from Romanian; rare in English.) Good household management—keeping a home, farm, or property orderly, clean, and well supplied through practical, careful work.","zh":"（源自罗马尼亚语；英语中很少见。）指良好的持家/家业管理：把家、农舍或产业打理得井井有条、整洁并且物资充足，强调踏实与勤俭。"},"examples":[{"en":"In Romanian culture, people may praise a family’s gospodariat—meaning their home and yard are well cared for.","zh":"在罗马尼亚文化里，人们可能会夸一家人的 h​​​​ospodariat，意思是他们把房子和院子打理得很好。"},{"en":"Her grandparents were known for their gospodariat: a tidy kitchen, stored preserves, and a neat garden.","zh":"她的祖父母以 h​​​​ospodariat 出名：厨房整洁、储备了果酱腌菜，花园也收拾得很利落。"}]}],"synonyms":["housekeeping","good home management","thrift","husbandry (in the sense of careful management)"],"phonetic":"/ˌhoʊspoʊˈdɑːriˌɑːt/","extraExplanation":["这个词在英语语境里通常只会出现在讨论罗马尼亚社会/民俗/乡村生活的文章或翻译中。它带有一种“会过日子、能把家与院子经营好”的褒义色彩，常与勤劳、整洁、节俭、善于储备（如自制腌菜、果酱）等生活方式联想在一起。","罗马尼亚语里常见相关形式还有形容词 hospodărit（大意：被打理得很好、很整齐），以及名词 gospodărie（家业/农家/家庭产业）。"]}
{"word":"hospodariate","summary":{"en":"A rare historical term for a principality ruled by a hospodar, especially Wallachia or Moldavia.","zh":"一个少见的历史词，指由hospodar统治的公国/政体，尤指瓦拉几亚或摩尔达维亚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A principality or government ruled by a hospodar (a prince-governor), especially the Danubian Principalities (Wallachia and Moldavia) under Ottoman influence.","zh":"（历史）由“hospodar”（亲王/总督式的统治者）治理的公国或政权，尤指奥斯曼影响下的多瑙河两公国（瓦拉几亚与摩尔达维亚）。"},"examples":[{"en":"In some history books, Wallachia and Moldavia are described as the Ottoman Empire’s hospodariates.","zh":"在一些历史著作中，瓦拉几亚和摩尔达维亚被描述为奥斯曼帝国体系下的“hospodariates”（公国/属国式政权）。"},{"en":"The reforms introduced during the Phanariote period shaped the administration of the hospodariate.","zh":"法纳里奥特时期推行的改革影响了该“hospodariate”的行政体系。"}]}],"synonyms":["principality","realm","province (historical context)"],"phonetic":"/ˌhɑːspəˈdɑːriˌeɪt/","extraExplanation":["这个词在现代英语里非常少见，多见于东欧史/奥斯曼史语境。常与 Danubian Principalities（多瑙河两公国）、Phanariote（法纳里奥特人/时期）等词一起出现。","词根与东南欧斯拉夫语/罗马尼亚语中的“gospodar/hospodar”（意为“主人、领主、统治者”）相关；在历史语境里特指瓦拉几亚、摩尔达维亚等地的统治者称号。"]}
{"word":"hospodars","summary":{"en":"“Hospodars” is a rare loanword meaning farmers/householders (plural of “hospodar”), used mainly in Central/Eastern European contexts.","zh":"“hospodars”是较少见的外来词，指农户/当家人（“hospodar”的复数），多用于中东欧语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Central/Eastern Europe, loanword) Plural of “hospodar”: farmers/householders; people who manage a household or small farm (especially in Czech/Slovak contexts).","zh":"（中东欧语借词）“hospodar”的复数：农户、家长/当家人；指管理家庭或小农场的人（常见于捷克/斯洛伐克语境）。"},"examples":[{"en":"In some Czech villages, the hospodars met to discuss land and harvest plans.","zh":"在一些捷克村庄里，农户们（hospodars）会聚在一起讨论土地和收成计划。"},{"en":"The historian wrote about hospodars who kept careful records of seed and livestock.","zh":"这位历史学家写到那些农户（hospodars）会仔细记录种子和牲畜情况。"}]}],"synonyms":["farmers","householders","heads of household"],"phonetic":"/ˈhɑspədɑrz/","extraExplanation":["“hospodar”在多种斯拉夫语言里有“家主、当家人、农场主/农户”的意思；在英语中多见于历史、民族志、或翻译文本里，不算常用日常词。","如果你是在特定文章/书里看到“hospodars”，它可能是作者保留的外来词（不翻译），用来强调当地社会角色；在一般英文表达里常用更通用的词：farmers, householders, heads of household。"]}
{"word":"hoss","summary":{"en":"Hoss is an informal word for a horse, and it can also mean a big, strong person (as a nickname).","zh":"hoss 是“horse”的口语/方言说法，也可指（昵称意义上的）壮汉、力气大的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, dialect) A horse (especially a big, strong one); also used as a friendly nickname for a big, strong person.","zh":"（非正式/方言）马（尤指高大强壮的马）；也可作对高大强壮的人的友好称呼/外号。"},"examples":[{"en":"They brought in a big hoss to pull the wagon out of the mud.","zh":"他们牵来一匹壮马，把马车从泥里拉出来。"},{"en":"Thanks for the help, hoss.","zh":"谢了，哥们儿/老兄。"},{"en":"That linebacker is a real hoss.","zh":"那个线卫真是个壮汉。"}]}],"synonyms":["horse","big guy","bruiser","strongman"],"phonetic":"/hɔs/","extraExplanation":["“hoss”常见于美国南方/西部口语，是“horse”的方言式拼写，常用来强调“块头大、力气足”。","作为称呼时语气通常友好、带点粗犷随意，类似“big guy / buddy”，但对陌生人使用可能显得过于随便，需看场合。","流行文化里“Bonanza（荒野大镖客/老版西部剧）”中有角色昵称叫 Hoss（Hoss Cartwright），也让这个词带上了一点“西部硬汉”的气质。"]}
{"word":"host","summary":{"en":"“Host” most commonly means a person who welcomes guests or a presenter of a show; it can also mean a biological host or the act of organizing/hosting (including website hosting).","zh":"“host”最常指接待客人的东道主或节目主持人；也可指生物学的“宿主”，以及“主办/主持”或（网站）“托管”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who welcomes guests or provides a place/experience for them (at home, an event, a TV/radio show, etc.)","zh":"主人；东道主；（节目/活动的）主持人"},"examples":[{"en":"Thanks to our host for such a warm welcome.","zh":"感谢我们的东道主如此热情地欢迎我们。"},{"en":"She’s the host of a popular podcast.","zh":"她是一档热门播客的主持人。"}]},{"partOfSpeech":"n.","definition":{"en":"an animal or plant that a parasite lives on or inside","zh":"（寄生虫/病原体的）宿主"},"examples":[{"en":"Ticks feed on a host’s blood.","zh":"蜱虫以宿主的血液为食。"},{"en":"Humans can be hosts for many kinds of viruses.","zh":"人类可以成为多种病毒的宿主。"}]},{"partOfSpeech":"v.","definition":{"en":"to receive and entertain guests; to organize or present an event or program","zh":"招待客人；主办；主持（活动/节目）"},"examples":[{"en":"We’re hosting dinner on Friday.","zh":"我们周五要设宴招待。"},{"en":"The city will host the international games next year.","zh":"这座城市明年将主办国际运动会。"}]},{"partOfSpeech":"v.","definition":{"en":"to provide space or a platform for something (often online or in computing)","zh":"为……提供场地/空间；（网络/计算机）托管"},"examples":[{"en":"This website is hosted on a cloud server.","zh":"这个网站托管在云服务器上。"},{"en":"The museum hosts an exhibition every summer.","zh":"这家博物馆每年夏天都会举办展览。"}]}],"synonyms":["presenter","emcee","organizer","entertainer","provider"],"phonetic":"/hoʊst/","extraExplanation":["“host”在日常英语里最常见的是“东道主/主持人”。在科技语境中，host 常指“主机/宿主/托管方”（如 host a website）。在生物学里则是“宿主”。要根据上下文判断。","常见搭配：host a party（办派对/做东）、host an event（主办活动）、TV host（电视主持人）、host country（主办国）、host family（寄宿家庭）。"]}
{"word":"host-alternating","summary":{"en":"alternating with a host component or taking turns as host","zh":"与宿主成分交替排列；或轮流做东"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In chemistry/physics) describing a molecule, polymer, or structure where “host” units and other (guest or different) units alternate in a repeating pattern.","zh":"（化学/物理）指分子、聚合物或结构中，“宿主（host）”单元与其他（客体或不同）单元以交替方式重复排列。"},"examples":[{"en":"The material forms a host-alternating chain that changes its conductivity under light.","zh":"这种材料形成宿主交替链，在光照下其导电性会改变。"},{"en":"Researchers designed a host-alternating copolymer to tune the pore environment.","zh":"研究人员设计了宿主交替共聚物，以调控孔道微环境。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally, alternating in role or position as the host (e.g., taking turns being the host).","zh":"（更一般）在“做东/当主办方”的角色上轮流交替。"},"examples":[{"en":"The two families planned host-alternating dinners every month.","zh":"两家人计划每月轮流做东聚餐一次。"},{"en":"They agreed on a host-alternating schedule for the weekly study group.","zh":"他们为每周学习小组定了轮流主办的安排。"}]}],"synonyms":["alternating","interchanging","taking turns","rotating"],"phonetic":"/ˈhoʊst ˈɔl.tɚˌneɪ.tɪŋ/","extraExplanation":["学术语境里，这类“X-alternating”复合词常见于材料与高分子领域（如 donor-alternating、charge-alternating）。具体含义通常要结合论文中对“host”指代对象的定义（宿主分子、宿主单元、宿主链段等）。"],"etymology":"由 host（“主人/宿主”）+ alternating（“交替的”）构成的复合形容词。学术写作中常用连字符（host-alternating）把两部分合并成一个修饰语。","mnemonic":["把它拆开记：host=“宿主/做东”，alternating=“交替”。合起来就是“宿主在交替出现/轮流当东道主”。","联想“轮流做东”：今天你host，明天我host——host-alternating。"]}
{"word":"host-free","summary":{"en":"not needing a host; able to operate independently","zh":"不需要主人/主办者；或不依赖主机、可独立运行"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not requiring a host (a person who receives guests or organizes an event), or happening without a host.","zh":"不需要主人／主办者（接待客人或组织活动的人）；在没有主办方的情况下进行的。"},"examples":[{"en":"The meetup is host-free, so everyone brings their own snacks and sets up chairs together.","zh":"这次聚会是无主办的，所以大家各自带零食并一起摆椅子。"},{"en":"We chose a host-free gathering to keep things informal and avoid pressure on one person.","zh":"我们选择无主办的聚会，让氛围更随意，也避免把压力集中在一个人身上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing/tech) Not dependent on a central host computer or server; able to run or operate on its own.","zh":"（计算机／技术）不依赖主机或中心服务器；可独立运行的。"},"examples":[{"en":"This tool offers a host-free mode for offline use during travel.","zh":"这个工具提供无主机模式，方便旅行时离线使用。"},{"en":"The device supports host-free data transfer between two units.","zh":"这台设备支持两台设备之间的无主机数据传输。"}]}],"synonyms":["unhosted","serverless","standalone","independent","self-contained"],"phonetic":"/ˌhoʊstˈfriː/","extraExplanation":["在技术文档里，host-free 往往强调“无需连接到主机/服务器也能工作”。在日常生活语境中，则更像“无人主持/无主办者”的组织方式。具体含义通常要看上下文。"],"etymology":"由 host（主人/主办者；主机）+ free（无……的，不受……限制的）构成的复合形容词；常用于活动组织语境或技术说明中，表示“无需依赖某个host”。","mnemonic":["把它拆开记：host（主人/主机）+ free（没有/不需要）= “没有host也行”。","联想中文“免主机/免主持”：看到 free 就想到“免……”。"]}
{"word":"host-seeking","summary":{"en":"searching for a host (especially in biology).","zh":"寻找宿主（尤指生物学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, ecology) searching for a host organism to feed on, live on/in, or infect.","zh":"（生物/生态）寻找“宿主”以取食、寄生或感染的。"},"examples":[{"en":"Female mosquitoes use smell and body heat during host-seeking.","zh":"雌蚊在寻宿主时会利用气味和体温信号。"},{"en":"Host-seeking ticks climb grass and wait for animals to pass by.","zh":"寻宿主的蜱会爬到草尖上，等待动物经过。"},{"en":"Scientists tested how light affects host-seeking behavior in insects.","zh":"科学家测试了光线如何影响昆虫的寻宿主行为。"}]},{"partOfSpeech":"adj.","definition":{"en":"trying to find a person or organization willing to host or sponsor something (a visitor, event, program, etc.).","zh":"（引申）寻找愿意接待或主办/赞助某事的人或机构的。"},"examples":[{"en":"The exchange program is still host-seeking for next semester.","zh":"这个交换项目还在为下学期寻找接待家庭/接待方。"},{"en":"They sent out a host-seeking email to local community centers.","zh":"他们向本地社区中心发出了寻找主办方的邮件。"}]}],"synonyms":["host-hunting","host-searching","seeking a host","questing"],"phonetic":"/ˈhoʊst ˌsiːkɪŋ/","extraExplanation":["学术与科普里更常见的是搭配用法：host-seeking mosquito/tick（寻宿主的蚊子/蜱），或 host-seeking behavior（寻宿主行为）。这里的 host 指“宿主”，不是“主持人/主人”。","在公共事务或项目合作语境中，host 可指“接待方/主办方”，因此 host-seeking 也可用于“正在找接待单位/主办方”的状态描述。"],"etymology":"由复合词构成：host（宿主/接待方）+ seeking（寻找）。在生物学语境中常与“host-seeking behavior（寻宿主行为）”搭配使用。","mnemonic":["把它拆开记：host=宿主/接待方；seeking=寻找 → 合起来就是“寻宿主/寻接待方”。","联想生物课常见词“寄生虫找宿主”：host-seeking＝“在找可以寄生/叮咬的对象”。"]}
{"word":"host-specific","summary":{"en":"limited to or designed for a particular host (organism or computer).","zh":"仅限于或专为某一特定宿主（生物或主机）而设。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In biology/medicine) able to infect, live in, or affect only one particular host species (or a very narrow range of hosts).","zh":"（生物/医学）宿主特异的；只会感染、寄生或影响某一种（或极少数几种）宿主的。"},"examples":[{"en":"This parasite is host-specific and cannot complete its life cycle in humans.","zh":"这种寄生虫具有宿主特异性，无法在人类体内完成其生命周期。"},{"en":"Some plant viruses are host-specific, so they infect only certain crops.","zh":"一些植物病毒具有宿主特异性，因此只会感染特定作物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In computing/networking) designed for, configured for, or limited to a particular host machine or host environment.","zh":"（计算机/网络）主机特定的；为某一台主机或某种主机环境专门设计、配置或仅适用的。"},"examples":[{"en":"The installer writes host-specific settings to a local configuration file.","zh":"安装程序会把主机特定的设置写入本地配置文件。"},{"en":"Avoid hard-coding host-specific paths if the software will be deployed on multiple servers.","zh":"如果软件要部署到多台服务器，尽量避免硬编码主机特定的路径。"}]}],"synonyms":["host-restricted","host-dependent","species-specific","organism-specific","platform-specific","machine-specific","system-specific"],"phonetic":"/ˌhoʊst spəˈsɪfɪk/","extraExplanation":["生物学里常与 host specificity（宿主特异性）一起出现，强调“只认某个宿主”。与之相对的概念是 broad host range（宿主范围广）或 generalist（广适性）。","计算机语境里 host 指“主机/服务器”。host-specific 常带有“不可移植、不通用”的含义，和 portable（可移植的）、generic（通用的）形成对比。"],"etymology":"由 host（宿主/主机）+ specific（特定的）构成的复合形容词；specific 来自拉丁语 speci-（“种类/形式”）相关词根，整体字面义为“对某个宿主而言是特定的”。","mnemonic":["把 host 记成“宿主/主机”，specific 记成“特定”：合起来就是“只对某个宿主/主机特定”。","联想中文“特供”：host-specific ≈ “只给这台主机/这个宿主用的特供版本”。"]}
{"word":"host-switching","summary":{"en":"changing from one host to another","zh":"从一个宿主转移到另一个宿主"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which a parasite, pathogen, or symbiont changes from one host species (or individual host) to another during its life cycle or across evolution","zh":"（寄生虫、病原体或共生生物）在其生命周期中或进化过程中从一种宿主（或一个宿主个体）转移到另一种宿主的过程"},"examples":[{"en":"Some parasites survive by host-switching when their original host becomes rare.","zh":"有些寄生生物会在原宿主变得稀少时通过“换宿主”来生存。"},{"en":"Host-switching can increase the risk of new infectious diseases in humans.","zh":"宿主转换可能会提高人类出现新传染病的风险。"},{"en":"Researchers studied host-switching in ticks to understand how viruses spread between animals.","zh":"研究人员通过研究蜱的宿主转换来了解病毒如何在动物之间传播。"}]}],"synonyms":["host shift","host jump","host change","host transition"],"phonetic":"ˈhoʊst ˌswɪtʃɪŋ","extraExplanation":["在生物与医学语境里，host 指“让寄生者/病原体生存或繁殖的生物（宿主）”，不是“主持人”。因此 host-switching 通常与“跨物种传播（spillover）”“宿主范围（host range）”等概念相关。","host-switching 既可指同一物种内从一个个体换到另一个个体，也常指跨物种更换宿主；具体含义要看研究对象与上下文。"],"etymology":"复合词：host（宿主）+ switching（转换）。最常见于生态学、寄生虫学与流行病学语境，用来描述“从一个宿主转到另一个宿主”。","mnemonic":["把它拆开记：host=宿主；switch=切换/换。host-switching=“换宿主”。","联想手机“切换运营商/切换网络（switching）”，寄生虫/病毒也在“切换宿主（host）”。"]}
{"word":"host-worship","summary":{"en":"adoration of the Eucharistic Host; by extension, devotion treated like worship","zh":"对圣体的朝拜；引申为偶像式、宗教般的崇拜"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the worship or adoration of the consecrated Eucharistic bread (the “Host”) in some Christian traditions, especially Roman Catholicism","zh":"（基督宗教语境中）对圣体（祝圣后的饼，“圣体/圣饼”）的崇敬与朝拜，尤指天主教传统"},"examples":[{"en":"In some Catholic communities, host-worship is expressed through Eucharistic adoration.","zh":"在一些天主教团体中，“host-worship”会以朝拜圣体（Eucharistic adoration）的方式表现出来。"},{"en":"Historically, debates about host-worship shaped arguments about the meaning of the Eucharist.","zh":"历史上，围绕“host-worship”的争论影响了人们对圣餐/圣体意义的讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"more broadly (often critical), treating a person, object, or institution as if it deserves religious-like devotion","zh":"（引申义，常带批评）像宗教崇拜一样盲目崇拜某人、某物或某个机构"},"examples":[{"en":"The essay criticized the host-worship of celebrity culture.","zh":"这篇文章批评了名人文化中的“host-worship”（偶像式崇拜）。"},{"en":"He warned against host-worship in politics, where leaders are treated as infallible.","zh":"他警惕政治中的“host-worship”，把领袖当成不会犯错的人。"}]}],"synonyms":["Eucharistic adoration","adoration","veneration","idolization","hero worship"],"phonetic":"/ˈhoʊst ˌwɝːʃɪp/","extraExplanation":["在天主教语境中，Host（大写）特指祝圣后的圣体；相关常见表达包括 Eucharistic adoration（朝拜圣体）、Benediction（圣体降福）。","在一些历史争论中，“host-worship”有时被用作带立场色彩的批评性词汇，用来指责对圣体的敬礼过度或不当。"],"etymology":"由 host（此处指基督教中的“圣体/圣饼”，源自拉丁语 hostia“祭品、牺牲品”）+ worship（崇拜）构成的复合词。该用法多见于宗教讨论与宗教史语境。","mnemonic":["把它拆开记：Host（圣体/圣饼）+ worship（崇拜）= 对“圣体”的崇拜。","联想中文固定搭配：worship=“崇拜/礼拜”；host在宗教里不是“主持人”，而是“圣体”。看到大写 Host 就往宗教义靠。"]}
{"word":"hosta","summary":{"en":"Hosta is a shade-loving garden plant grown mainly for its broad decorative leaves.","zh":"Hosta 指喜阴的园艺植物（玉簪属），主要以宽大观赏叶片著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shade-loving garden plant with broad leaves, often grown for its foliage and sometimes for its flowers","zh":"玉簪（属）植物；一种喜阴的园艺植物，以宽大的叶片观赏为主，也会开花"},"examples":[{"en":"Hostas grow well in shady parts of the garden.","zh":"玉簪很适合种在花园里阴凉的地方。"},{"en":"She planted hostas along the north side of the house.","zh":"她在房子北侧种了一排玉簪。"},{"en":"Slugs can damage hosta leaves in wet weather.","zh":"潮湿天气里，鼻涕虫可能会咬坏玉簪的叶子。"}]}],"synonyms":["plantain lily","funkia"],"phonetic":"/ˈhɑstə/","extraExplanation":["“Hosta”通常指“玉簪属（Hosta）”的多年生观叶植物，常见于北美和欧洲的庭院造景。中文里常译为“玉簪”或“玉簪属植物”。","词源来自奥地利植物学家 Nikolaus Thomas Host（尼古劳斯·托马斯·霍斯特）的姓氏，因此首字母大写的形式（Hosta）也常见于植物学与园艺语境中。","在园艺文化中，hosta 常与“shade garden（阴生花园）”“foliage plant（观叶植物）”一起出现；常见相关词还有 slug（鼻涕虫）、variety/cultivar（品种）。"]}
{"word":"hostage","summary":{"en":"A hostage is a person kept as a prisoner to force others to meet demands; it can also be used figuratively for being controlled by something.","zh":"hostage指“人质”，即被扣押以迫使他人满足要求的人；也可作比喻，表示“受制于某事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is kept as a prisoner and may be harmed or used to force other people to do something (often for political or criminal reasons)","zh":"人质：被扣押的人，扣押者可能以伤害或继续扣押为威胁，迫使他人或政府采取行动（常见于政治或犯罪情境）"},"examples":[{"en":"The kidnappers demanded money and held two people hostage.","zh":"绑匪索要赎金，并扣押了两个人作为人质。"},{"en":"The police negotiated for the safe release of the hostages.","zh":"警方谈判以确保人质安全获释。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something forced to accept a situation they cannot control (a figurative use)","zh":"（比喻）受制于人/受困者：被迫承受、无法掌控局势的人或事物"},"examples":[{"en":"Small businesses can become hostages to sudden changes in rent.","zh":"小企业可能会受制于租金的突然上涨。"}]}],"synonyms":["captive","prisoner","kidnap victim"],"phonetic":"/ˈhɑstɪdʒ/","extraExplanation":["“hold someone hostage”既可指真实的扣押人质，也常见于比喻用法，表示“让某人/某事被迫受制于某条件”，如“be held hostage by fear（被恐惧所左右）”。在新闻语境中，hostage通常与kidnap（绑架）、ransom（赎金）、negotiation（谈判）等词一起出现。","文学与文化中也常用“hostage”来强调权力不对等与脆弱处境，例如“a hostage to fortune（前途未卜、把自己交给命运）”这样的固定搭配带有较强的修辞色彩。"]}
{"word":"hostage-takers","summary":{"en":"people who seize and hold hostages to force demands","zh":"为逼迫满足要求而劫持并扣押人质的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who seize and hold others as hostages in order to force someone (often a government or organization) to do something, usually by making demands","zh":"为逼迫他人（常为政府或机构）满足要求而劫持并扣押人质的人；绑架并挟持人质者"},"examples":[{"en":"The police tried to negotiate with the hostage-takers to ensure the hostages’ safety.","zh":"警方试图与劫持者谈判，以确保人质安全。"},{"en":"The hostage-takers demanded a vehicle and safe passage out of the city.","zh":"劫持者要求提供车辆，并保证他们能安全离开城市。"},{"en":"Witnesses said the hostage-takers were heavily armed.","zh":"目击者称劫持者携带重武器。"}]}],"synonyms":["captors","kidnappers","abductors","hijackers"],"phonetic":"/ˈhɑstɪdʒ ˌteɪkərz/","extraExplanation":["这是一个新闻与法律语境常见词，语气较严肃，常与 negotiate（谈判）、ransom（赎金）、demands（要求）、standoff（对峙）等词搭配。","写作中更常见单数形式 hostage-taker；复数为 hostage-takers。也常见近义表达 captors（扣押者）或 kidnappers（绑架者，侧重绑架而不一定是为谈判扣押）。"],"etymology":"由复合名词 hostage（人质）+ taker（夺取者/占有者）构成。hostage 源自古法语，最初指“作为担保被交出的人”；taker 来自 take“拿、夺取”。合起来指“夺取人质的人”。","mnemonic":["拆开记：hostage（人质）+ taker（拿走的人）= “拿走人质的人”。","把 taker 联想到中文“夺取者/拿的人”，就能快速推到含义。"]}
{"word":"hostage-taking","summary":{"en":"seizing and holding people to force demands","zh":"挟持并扣押人质以逼迫对方满足要求"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of seizing and holding people as hostages, usually to force another person, group, or government to do something","zh":"挟持人质（以迫使他人、团体或政府满足要求的行为）"},"examples":[{"en":"The government said it would not negotiate with hostage-taking.","zh":"政府表示不会与挟持人质的行为谈判。"},{"en":"Hostage-taking is a serious crime under international law.","zh":"挟持人质在国际法下属于严重犯罪。"}]}],"synonyms":["hostage seizure","detention","abduction","kidnapping"],"phonetic":"/ˈhɑstɪdʒ ˌteɪkɪŋ/","extraExplanation":["用法提示：hostage-taking 常用于新闻与法律语境，强调“行为/事件”本身；说具体事件时也可用 a hostage-taking incident（一起挟持人质事件）。描述行为者更常说 hostage-taker（劫持者）。","语感区别：kidnapping（绑架）不一定涉及“以人质交换条件”的目的；hostage-taking 通常带有“胁迫对方让步”的意图。"],"etymology":"由 hostage（人质）+ taking（夺取、劫持）构成。hostage 源自古法语，最早指“作为保证而被扣押的人”；taking 表示“带走/夺走”的动作，组合后专指“挟持人质”的行为。","mnemonic":["拆解记忆：hostage（人质）+ taking（带走/夺走）= 把人质“带走并扣住”。","联想：把它当作“take a hostage（挟持一名人质）”的名词化形式。"]}
{"word":"hostaged","summary":{"en":"Hostaged is a rare form meaning “taken/held as a hostage.” In everyday English, people usually say “held hostage” or “taken hostage.”","zh":"hostaged 较少见，意思是“被扣/被挟持为人质”。日常更常说 held hostage 或 taken hostage。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) to take someone as a hostage; to hold someone as a hostage.","zh":"（较少用）把某人扣为人质；挟持某人做人质。"},"examples":[{"en":"The rebels hostaged two workers to demand money.","zh":"叛军挟持了两名工人作为人质，要求赎金。"},{"en":"Several passengers were hostaged during the attack.","zh":"袭击期间，几名乘客被扣为人质。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, usually in the passive) being held as a hostage; kept under control by threats.","zh":"（较少用，常用被动）被扣为人质的；被挟持/被威胁控制的。"},"examples":[{"en":"The journalist was hostaged for weeks before being released.","zh":"这名记者被扣为人质数周后才获释。"},{"en":"They felt hostaged by the contract’s strict rules.","zh":"他们觉得被合同的严苛条款“绑住了手脚”。"}]}],"synonyms":["held hostage","taken hostage","kidnapped (not always the same)","abducted (not always the same)"],"phonetic":"/ˈhɑstɪdʒd/","extraExplanation":["“hostaged”不是最常见的表达。日常英语里更自然的说法是：be held hostage（被扣为人质）或 be taken hostage（被劫为人质）。","也可以用于比喻：feel held hostage by… 表示“被……束缚/挟制”，但注意语气较强，带有被迫与无奈的感觉。"]}
{"word":"hostager","summary":{"en":"“Hostager” isn’t standard; you likely mean “hostage” (a person held to force others to act).","zh":"“hostager”不是标准用法；你很可能想写“hostage”（人质）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word.) It is most likely a misspelling of “hostage.”","zh":"（不是标准英文单词。）很可能是把 “hostage” 拼错了。"},"examples":[{"en":"I think you mean “hostage,” not “hostager.”","zh":"我想你要写的是 “hostage”，不是 “hostager”。"}]},{"partOfSpeech":"n.","definition":{"en":"hostage: a person who is taken and held by someone (often a criminal group) to force others to do something, usually by threatening harm.","zh":"hostage：人质；被他人（常为犯罪团伙）抓走并扣押，以胁迫第三方做某事，通常以伤害相威胁。"},"examples":[{"en":"The kidnappers took two people hostage.","zh":"绑匪劫持了两个人作为人质。"},{"en":"The government said it was working to free the hostages.","zh":"政府表示正在努力解救人质。"},{"en":"They used the hostages as leverage in negotiations.","zh":"他们在谈判中把人质当作筹码。"}]}],"synonyms":["captive","prisoner (general)","kidnapping victim"],"phonetic":"/ˈhɑstɪdʒ/","extraExplanation":["“hostage”常见搭配：take/hold someone hostage（劫持/扣押某人为人质），hostage situation（人质事件），hostage taker（劫持者/绑匪）。","注意区分：host（主人/主持人）+ hostage（人质）词形相似但含义无关；“hostager”在现代英语里一般不用。"]}
{"word":"hostages","summary":{"en":"“Hostages” means people held captive to force demands; it can also be used figuratively for people trapped by a situation.","zh":"“hostages”指“人质”，也可比喻被某种处境或问题所控制、无法脱身的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is held captive to force someone else (often a government or family) to do something, such as pay money or meet demands.","zh":"人质：被扣押的人，用来逼迫他人（常见为政府或家属）满足要求，如付款或答应条件。"},"examples":[{"en":"The kidnappers demanded money and threatened to harm the hostages.","zh":"绑匪索要赎金，并威胁要伤害人质。"},{"en":"After hours of negotiation, the hostages were released safely.","zh":"经过数小时谈判，人质被安全释放。"}]},{"partOfSpeech":"n.","definition":{"en":"In a broader, figurative sense: people who feel trapped and controlled by a situation, fear, or addiction.","zh":"（比喻）被困住/被控制的人：指被某种处境、恐惧或成瘾“挟持”的人。"},"examples":[{"en":"They felt like hostages to their debt and couldn't take any risks.","zh":"他们觉得自己被债务“挟持”，不敢冒任何风险。"}]}],"synonyms":["captives","prisoners (general)","detainees (sometimes)"],"phonetic":"/ˈhɑːstɪdʒɪz/","extraExplanation":["“hostages”是“hostage”的复数形式。这个词常见于新闻语境（kidnapping, negotiation, release 等），使用时要注意语气与场合，避免轻率拿来开玩笑。","词源上与“host”（主人/主办方）无关；历史上“hostage”来自与“担保/抵押”相关的含义，指以人作为保证来确保协议或和平。"]}
{"word":"hostageship","summary":{"en":"Hostageship means the state of being a hostage or the practice of holding hostages.","zh":"hostageship 指“被扣为人质的状态”，也可指“扣押/劫持人质的做法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being a hostage","zh":"作为人质的状态；被扣为人质的处境"},"examples":[{"en":"He spent months in hostageship before he was released.","zh":"他在获释前被扣为人质长达数月。"},{"en":"The family spoke publicly about the pain of hostageship.","zh":"这家人公开谈到被扣为人质所带来的痛苦。"}]},{"partOfSpeech":"n.","definition":{"en":"the practice or system of holding hostages to force someone to do something","zh":"以扣押人质来施压或胁迫的做法/制度"},"examples":[{"en":"International law condemns hostageship as a tool of political pressure.","zh":"国际法谴责将扣押人质作为政治施压工具的做法。"},{"en":"The report described a pattern of kidnappings and hostageship.","zh":"报告描述了一种绑架与扣押人质相伴的模式。"}]}],"synonyms":["captivity","being held hostage","hostage-taking","kidnapping (in some contexts)"],"phonetic":"/ˈhɑstɪdʒˌʃɪp/","extraExplanation":["“hostageship”是较少见、偏正式的词，多用于新闻报道、法律/人权语境或历史叙述中。日常口语里更常说“being held hostage”（被挟持/被扣为人质）或“hostage-taking”（劫持人质）。","后缀“-ship”常表示“状态/身份/关系”（如 friendship 友谊、citizenship 公民身份），所以 hostageship 强调的是“人质这一身份/处境”或“扣押人质这种做法”。"]}
{"word":"hostaging","summary":{"en":"“Hostaging” means taking or holding people as hostages (often to force demands). It’s uncommon; “hostage-taking” or “taking hostages” is more natural.","zh":"“hostaging”指劫持或扣押人质（通常为迫使对方让步）。该词不太常用，更自然的说法是“hostage-taking”或“taking hostages”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of taking or holding people as hostages; using hostages to force another person or group to do something","zh":"劫持人质；扣押人质以胁迫他人或组织做某事"},"examples":[{"en":"The militants were accused of hostaging civilians to demand political concessions.","zh":"武装分子被指控劫持平民作为人质，以要求政治让步。"},{"en":"The government stated it would not negotiate under hostaging threats.","zh":"政府表示不会在“以人质相威胁”的情况下进行谈判。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “to hostage” (rare): taking or holding someone as a hostage","zh":"“hostage（作动词）”的现在分词（较少见）：劫持或扣押某人为人质"},"examples":[{"en":"They were charged with hostaging several passengers during the robbery.","zh":"他们被控在抢劫过程中挟持多名乘客为人质。"},{"en":"The report described the group as hostaging workers to pressure the company.","zh":"报告称该团体挟持工人作为人质，以向公司施压。"}]}],"synonyms":["hostage-taking","taking hostages","kidnapping","abduction"],"phonetic":"/ˈhɑstɪdʒɪŋ/","extraExplanation":["“hostaging”在现代英语里并不常见；更常用、更自然的说法是“taking hostages”或名词“hostage-taking（劫持人质行为）”。","“hostage”主要是名词（人质）。把它当动词用（to hostage）在新闻报道或法律语境中偶尔出现，但日常表达通常会改用“kidnap/abduct（绑架）”或“take hostage（挟持为人质）”。"]}
{"word":"hostal","summary":{"en":"“Hostal” means a simple, budget lodging for travelers, especially in Spanish-speaking countries.","zh":"“Hostal”指给旅客住的简朴平价旅店，常见于西语国家，类似青年旅舍/小旅馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cheap, simple place to stay for travelers, similar to a hostel (often used in Spanish-speaking countries)","zh":"（常见于西语国家）便宜、简单的旅店；类似“hostel（青年旅舍）”"},"examples":[{"en":"We stayed in a small hostal near the beach.","zh":"我们住在海边附近一家小小的hostal。"},{"en":"The hostal was basic but clean and friendly.","zh":"这家hostal设施很简单，但很干净，工作人员也很友好。"},{"en":"In many towns, a hostal is cheaper than a hotel.","zh":"在很多小镇上，hostal比酒店更便宜。"}]}],"synonyms":["hostel","guesthouse","budget hotel","inn"],"phonetic":"/hoʊˈstæl/","extraExplanation":["“Hostal”主要是西班牙语借词，在旅行英语里常用来指西语国家常见的平价旅店。它通常比hotel便宜、服务更简单；有的提供私人房间，也可能有共用浴室。\n\n拼写和词义容易和“hostile（敌对的）”混淆，但两者完全无关。","在不同国家，“hostal / hostel / guesthouse / inn”有时会混用：\n- hostel（青年旅舍）更强调多人间、公共空间、社交氛围；\n- guesthouse（民宿/客栈）更像家庭式小旅馆；\n- inn（小旅馆）在英语国家更传统，常带餐饮或酒吧。"]}
{"word":"hostas","summary":{"en":"Hostas are shade-loving ornamental plants grown mainly for their large leaves.","zh":"hostas 指喜阴、主要观叶的观赏植物（玉簪属），以大叶片著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hostas are ornamental garden plants with broad leaves, grown mainly for their foliage and often used in shade gardens.","zh":"hostas（玉簪属植物）是常见的观赏园艺植物，以宽大的叶片著称，常用于阴生花园或林下花境。"},"examples":[{"en":"Hostas grow well in shady parts of the yard.","zh":"hostas 很适合种在院子里比较阴的地方。"},{"en":"She planted hostas along the north-facing wall where there is less sun.","zh":"她在朝北、日照较少的墙边种了 hostas。"},{"en":"Slugs can damage hostas, so gardeners often protect the leaves.","zh":"蛞蝓可能会啃食 hostas，所以园丁常会保护它们的叶片。"}]}],"synonyms":["hosta","plantain lily"],"phonetic":"/ˈhɑstəz/","extraExplanation":["“hosta”的名称来自奥地利植物学家 Nicolaus Thomas Host（18世纪）。在英语里常见单数 hosta、复数 hostas。它们通常以叶色（如蓝绿、金黄、斑锦）和叶形来区分品种。"]}
{"word":"hoste","summary":{"en":"“Hoste” is a rare, old-fashioned spelling of “host,” meaning the person who welcomes guests (often an innkeeper in older texts).","zh":"“hoste”是“host”的罕见古拼写，指接待客人的主人（旧文本里常指旅店老板）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic spelling) a host; especially an innkeeper or the person who receives guests.","zh":"（罕见/古旧拼写）主人；尤指旅店老板或接待客人的人。"},"examples":[{"en":"The traveler thanked his hoste for a warm meal and a bed.","zh":"旅人感谢这位“hoste”提供热饭和床铺。"},{"en":"In old texts, you may see “hoste” where modern English uses “host.”","zh":"在旧文本中，你可能会看到用“hoste”来表示现代英语的“host”。"}]},{"partOfSpeech":"v.","definition":{"en":"(Obsolete) to host; to receive or entertain guests.","zh":"（已废用）款待；接待（客人）。"},"examples":[{"en":"They hoste strangers during the festival in the old story.","zh":"在那则旧故事里，他们在节日期间接待陌生人。"}]}],"synonyms":["host","innkeeper","landlord"],"phonetic":"/hoʊst/","extraExplanation":["“hoste”多见于中古英语/早期现代英语作品中的古拼写，现代写法通常是“host”。","它与法语“hôte”（既可指主人也可指客人）在历史上有关联；但现代英语里“host”主要指“主人/主持人”，“guest”指“客人”。","如果你是在日常写作或考试中使用，建议写“host”。如果你想查的是法语单词“hôte”，告诉我语境我可以一起解释。"]}
{"word":"hosted","summary":{"en":"“Hosted” usually means someone organized or welcomed others (events/guests). In tech, it means a website or service is kept and run on a server/platform.","zh":"“hosted”通常指“举办/接待”（活动或客人）；在科技语境中指“托管”（网站或服务运行在某个平台/服务器上）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “host”: to organize an event or program and welcome guests; to provide a place, food, or service for others.","zh":"“host”的过去式/过去分词：主持或组织活动并接待来宾；为他人提供场所、食物或服务。"},"examples":[{"en":"She hosted a small dinner for her friends.","zh":"她为朋友们办了一场小型晚餐聚会。"},{"en":"The museum hosted a new art exhibition last month.","zh":"博物馆上个月举办了一个新的艺术展览。"},{"en":"They were hosted by a local family during their trip.","zh":"旅行期间，他们受当地一户人家接待。"}]},{"partOfSpeech":"adj.","definition":{"en":"In technology: stored and made available on a server or platform (often used before a noun, e.g., “hosted service/website”).","zh":"（科技）托管的：存放在服务器或平台上并可被访问（常作定语，如“hosted service/website”）。"},"examples":[{"en":"Our website is hosted on a cloud platform.","zh":"我们的网站托管在云平台上。"},{"en":"They switched to a hosted email service.","zh":"他们改用托管式电子邮件服务。"}]}],"synonyms":["organized","held","presented","entertained","provided for","server-hosted","cloud-hosted"],"phonetic":"/ˈhoʊstɪd/","extraExplanation":["“hosted”在日常生活里多指“举办/接待”（host a party, host visitors）；在互联网语境里常指“托管”（a hosted website/service），强调由某个公司/平台提供服务器与运维支持。"]}
{"word":"hostel","summary":{"en":"A hostel is a low-cost place to stay, often with shared rooms and shared facilities.","zh":"hostel 指价格较低的住宿，常见为多人合住房间并共用设施的“青年旅舍”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A budget place to stay where guests rent a bed (often in a shared room) and share facilities like bathrooms and kitchens.","zh":"（常指）青年旅舍；一种较便宜的住宿，通常租床位（多为多人间），并共用浴室、厨房等设施。"},"examples":[{"en":"We stayed in a hostel near the train station to save money.","zh":"为了省钱，我们住在火车站附近的一家青年旅舍。"},{"en":"The hostel has shared rooms, lockers, and a common kitchen.","zh":"这家旅舍有多人间、储物柜和公共厨房。"},{"en":"Hostels are popular with backpackers and students.","zh":"青年旅舍很受背包客和学生欢迎。"}]}],"synonyms":["youth hostel","budget accommodation","dormitory (in some contexts)"],"phonetic":"/ˈhɑstəl/","extraExplanation":["在英式英语里，hostel 也常指为特定人群提供的集体住宿（如学生宿舍、工人宿舍，或无家可归者收容所等），语境不同含义会更正式或更公益。","旅行语境中常见对比：hostel（床位/公共空间多）通常比 hotel（酒店，私密性更强、价格更高）便宜。","词源上，hostel 与 hotel 同源，都来自表示“接待客人”的词根；现代用法中 hostel 更偏“经济型/合住”。"]}
{"word":"hosteled","summary":{"en":"“Hosteled” means “stayed in a hostel” (past tense/past participle of “hostel”).","zh":"“hosteled”表示“住过青年旅舍/旅社”，是动词“hostel”的过去式和过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “hostel”: to stay or live in a hostel (a low-cost place to sleep, often with shared rooms).","zh":"“hostel”的过去式和过去分词：住在青年旅舍/旅社（通常价格较低，可能是多人间）。"},"examples":[{"en":"We hosteled in Barcelona for three nights to save money.","zh":"为了省钱，我们在巴塞罗那住了三晚青年旅舍。"},{"en":"They had hosteled across Europe during college.","zh":"他们大学时一路住青年旅舍旅行欧洲。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Describing someone as housed in a hostel.","zh":"（较少见）形容某人被安排住在旅舍/青年旅舍。"},"examples":[{"en":"The hosteled travelers cooked dinner together in the shared kitchen.","zh":"住在青年旅舍的旅人们在公共厨房一起做晚饭。"}]}],"synonyms":["stayed (in a hostel)","lodged","boarded"],"phonetic":"/ˈhɑstəld/","extraExplanation":["英式拼写常见为“hostelled / hostelled”（双写 l），美式更常见“hosteled / hosteled”（单写 l）。两者意思相同。","动词“hostel”在日常口语里不算特别常见，很多时候人们会说“stay in a hostel”。"]}
{"word":"hosteler","summary":{"en":"A hosteler is someone who stays in a hostel, often sharing rooms and facilities.","zh":"hosteler 指住在青年旅舍或宿舍式住宿（常需共用房间与设施）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who stays in a hostel (a low-cost place to live or travel-lodge, often shared).","zh":"住在青年旅舍或宿舍式旅馆里的人（通常价格较低、多人共住）。"},"examples":[{"en":"As a hosteler, you usually share a kitchen and bathroom with others.","zh":"作为住青年旅舍的人，你通常要和别人共用厨房和浴室。"},{"en":"Many hostelers choose dorm rooms to save money while traveling.","zh":"很多住青年旅舍的人会选择多人宿舍房，以便旅行时省钱。"}]}],"synonyms":["hostel guest","backpacker","lodger"],"phonetic":"/ˈhɑstələr/","extraExplanation":["“hosteler”在英式英语中更常见的拼写是“hosteller”。两者意思相同：指住在旅舍/宿舍式住宿的人。","在一些地区（尤其南亚英语语境），“hosteler”也常指住校生、寄宿生（住在学校宿舍的人）。"]}
{"word":"hostelers","summary":{"en":"“Hostelers” means people who stay in a hostel (most common). Sometimes it can also mean people who work at or run a hostel (less common).","zh":"“hostelers”通常指住在旅舍/青年旅社的人；较少情况下也可指在旅舍工作或经营旅舍的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who stay in a hostel (a low-cost place to sleep, often with shared rooms).","zh":"住在旅舍/青年旅社的人（通常是价格较低、可能是多人间的住宿）。"},"examples":[{"en":"Most hostelers cook in the shared kitchen to save money.","zh":"很多住旅舍的人会在共用厨房做饭来省钱。"},{"en":"The hostelers swapped travel tips in the common room.","zh":"住旅舍的人在公共休息区交流旅行建议。"}]},{"partOfSpeech":"n.","definition":{"en":"People who run or work at a hostel (less common).","zh":"经营或在旅舍工作的人（较少见）。"},"examples":[{"en":"The hostelers cleaned the dorms every morning.","zh":"旅舍的工作人员每天早上打扫宿舍间。"}]}],"synonyms":["hostel guests","hostel residents","travelers","backpackers"],"phonetic":"/ˈhɑstələrz/","extraExplanation":["“hostelers”是“hosteler/hosteller”的复数形式。美式英语里更常见的说法是“hostel guests（旅舍住客）”或“people staying in a hostel”。在英式拼写中常见“hosteller”。"]}
{"word":"hosteling","summary":{"en":"Hosteling usually means traveling and staying in hostels as a budget-friendly way to travel.","zh":"hosteling 通常指以经济方式旅行并入住青年旅舍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Traveling and staying in hostels (cheap shared lodging), often with a backpacker-style budget.","zh":"在旅行中入住青年旅舍（较便宜、常有多人间的住宿方式），常见于背包客式的经济旅行。"},"examples":[{"en":"We saved money by hosteling across Europe for a month.","zh":"我们在欧洲住青年旅舍旅行了一个月，省了不少钱。"},{"en":"Hosteling is a good way to meet other travelers.","zh":"住青年旅舍旅行是结识其他旅人的好方式。"},{"en":"She tried hosteling for the first time during her gap year.","zh":"她在间隔年第一次尝试住青年旅舍旅行。"}]},{"partOfSpeech":"n.","definition":{"en":"The activity of running, working in, or managing a hostel (less common).","zh":"经营、管理或在旅舍工作（较少见）。"},"examples":[{"en":"He got into hosteling after taking a job at a seaside hostel.","zh":"他在海边一家旅舍工作后，开始从事旅舍行业。"},{"en":"Their family business is hosteling in the mountains.","zh":"他们家的生意是在山里经营旅舍。"}]}],"synonyms":["staying in hostels","budget travel","backpacking","youth-hostel travel"],"phonetic":"/ˈhɑstəlɪŋ/","extraExplanation":["“hosteling”在北美更常指“住青年旅舍旅行”这种出行方式。青年旅舍通常提供床位（bunk beds）、公共厨房/休息区（common areas），也可能有只限女性房间（female-only dorm）。","相关文化：不少人会办Hostelling International（HI）的会员；旅舍文化强调社交、共享与预算旅行，但也要注意安静时段（quiet hours）和贵重物品保管（lockers）。"]}
{"word":"hosteller","summary":{"en":"A hosteller is usually someone who lives in a hostel; less commonly, it can mean an innkeeper.","zh":"hosteller通常指住在旅舍/宿舍的人；较少见时也可指旅店老板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives in a hostel (often a student or traveler).","zh":"住在旅舍（宿舍）里的人（常指学生或旅客）。"},"examples":[{"en":"I met a hosteller from Spain in the youth hostel kitchen.","zh":"我在青年旅舍的厨房里遇到了一位来自西班牙的住客。"},{"en":"As a hosteller, she shares a room with three other students.","zh":"作为住在宿舍的学生，她和另外三名同学合住一间房。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) an innkeeper; someone who runs a hostel/inn.","zh":"（较少见）旅店老板；经营旅舍/客栈的人。"},"examples":[{"en":"In old stories, the hosteller often offers travelers food and a bed.","zh":"在旧故事里，旅店老板常给旅人提供食物和床铺。"}]}],"synonyms":["hostel resident","hostel guest","boarder","lodger","innkeeper (less common sense)"],"phonetic":"/ˈhɑstələr/","extraExplanation":["“hosteller”有时也拼作“hosteler”（尤其在英式写法中更常见）。现代英语里更常用的说法是“hostel resident / hostel guest”（旅舍住客）或“innkeeper”（旅店老板）。","词根来自“hostel（旅舍）”，与“hospitality（好客）”同源，历史上常用于文学或较传统的语境。"]}
{"word":"hostelling","summary":{"en":"Hostelling means traveling or living by staying in hostels, especially as a budget-friendly, social style of travel.","zh":"Hostelling 指通过住青年旅舍来旅行或生活，常带有省钱、社交型旅行方式的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Traveling or living by staying in hostels (cheap shared accommodation), often associated with budget or backpacking trips.","zh":"住青年旅舍（多人共住、价格较低的住宿）的一种旅行/生活方式，常与背包客或预算旅行相关。"},"examples":[{"en":"Hostelling is a popular way to save money while traveling in Europe.","zh":"在欧洲旅行时，住青年旅舍（hostelling）是省钱的常见方式。"},{"en":"They met new friends through hostelling during their gap year.","zh":"他们在间隔年里通过住青旅结识了新朋友。"},{"en":"She prefers hostelling because it feels more social than hotels.","zh":"她更喜欢住青旅，因为比酒店更有社交氛围。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of staying in a hostel; the present participle/gerund of “hostel” (rare in modern everyday English).","zh":"住在旅舍/青年旅舍里的行为；“hostel”的现在分词/动名词（现代日常英语中较少直接把 hostel 当动词用）。"},"examples":[{"en":"We’re hostelling for the weekend to keep costs low.","zh":"我们这个周末住青旅来降低花费。"},{"en":"They went hostelling across the country after graduation.","zh":"他们毕业后一路住青旅旅行。"}]}],"synonyms":["staying in hostels","budget travel","backpacking"],"phonetic":"/ˈhɑstəlɪŋ/","extraExplanation":["“hostelling”在旅游语境里最常见，指一种“住青旅”的旅行方式，而不只是“住一晚”。青旅通常有多人宿舍床位（dorm beds）、公共厨房和公共活动区，强调社交与节省预算。","在美式英语里，更自然的说法常是“staying in hostels”或“staying at a hostel”。“hostel”作动词（to hostel）存在但不算常用；“hostelling/hosteling”两种拼写都能见到。"]}
{"word":"hostelries","summary":{"en":"“Hostelries” is the plural of “hostelry,” meaning inns or traveler lodging places (often an older or literary word).","zh":"“hostelries”是“hostelry”的复数，意思是旅店/客栈（多为较旧或文学性的说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inns; places that provide lodging (and often food) for travelers, especially in older or literary usage.","zh":"（多为旧用或文学用语）旅店；客栈；为旅客提供住宿（常也提供餐食）的地方。"},"examples":[{"en":"In the past, travelers often stayed at small hostelries along the road.","zh":"过去，旅行者常常住在路边的小客栈里。"},{"en":"The guidebook lists several hostelries near the train station.","zh":"那本旅游指南列出了火车站附近的几家旅店。"}]}],"synonyms":["inns","lodgings","guesthouses"],"phonetic":"/ˈhɑstəɫriz/","extraExplanation":["“hostelry”是“inn（小旅馆、客栈）”的较正式/带古典色彩的同义词，常见于历史题材、文学描写或旅行写作中；日常口语里更常说“hotel / inn / motel”。","复数形式为“hostelries”：以辅音字母+y结尾的名词变复数时，通常把y变成i再加-es（hostelry → hostelries）。","注意不要和“hostel（青年旅舍）”混淆：两者词源相关，但现代用法里“hostel”更偏向价格较低、床位式或多人间的住宿。"]}
{"word":"hostelry","summary":{"en":"A hostelry is an inn or small hotel, often with a traditional or literary feel.","zh":"hostelry 指旅店/小旅馆，语感较传统或带文学色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an inn or small hotel that provides lodging (and often food and drink) for travelers","zh":"（多指较传统的）旅店，小旅馆；为旅客提供住宿（常也提供餐饮）"},"examples":[{"en":"We stayed at a quiet hostelry near the coast.","zh":"我们住在海边一家安静的小旅馆里。"},{"en":"After a long day of hiking, they looked for a nearby hostelry.","zh":"徒步了一整天后，他们寻找附近的旅店休息。"}]}],"synonyms":["inn","hotel","lodging house","hostel"],"phonetic":"/ˈhɑstəlri/","extraExplanation":["“hostelry”语感偏正式或带点文学/古典色彩，比“hotel”更容易让人联想到旧式驿站、乡村旅店或旅行者歇脚的地方。现代日常英语里更常用“hotel / inn / bed-and-breakfast (B&B)”。","词源上与“hostel（旅舍）”同根，和“host（主人/招待）”也有关联，都带有“接待旅人”的核心概念。"]}
{"word":"hostels","summary":{"en":"“Hostels” means inexpensive places to stay, often with shared rooms and facilities (plural of “hostel”).","zh":"“hostels”指价格较低、常见共享房间与设施的旅舍/青年旅舍（“hostel”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of hostel) inexpensive lodging where travelers can stay, often with shared rooms and shared bathrooms/kitchens; a “youth hostel” is a common type.","zh":"（hostel 的复数）旅舍；通常价格较低、常见多人间并共享卫浴/厨房等设施的住宿；常见类型有“青年旅舍”。"},"examples":[{"en":"We stayed in hostels to save money while traveling in Europe.","zh":"我们在欧洲旅行时住青年旅舍来省钱。"},{"en":"Many hostels have shared dorm rooms and lockers for your bags.","zh":"很多旅舍有多人宿舍和可上锁的储物柜。"},{"en":"The hostels near the train station fill up quickly in summer.","zh":"夏天火车站附近的旅舍很快就会订满。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) buildings or institutions that provide simple lodging for a specific group, such as students or workers.","zh":"（较少见）为特定人群（如学生、工人等）提供简便住宿的宿舍/招待所等机构或建筑。"},"examples":[{"en":"Some universities run hostels for visiting students.","zh":"一些大学为来访学生开设旅舍/宿舍。"}]}],"synonyms":["youth hostels","budget accommodation","guesthouses","lodgings"],"phonetic":"/ˈhɑstəl/","extraExplanation":["“hostel”和“hotel”不同：hostel 更强调便宜、社交氛围和共享空间（dorm room/公共厨房），而 hotel 通常更私密、服务更完整。","常见相关搭配：youth hostel（青年旅舍）、hostel dorm（旅舍多人间）、hostel bed（旅舍床位）、stay in a hostel（住旅舍）。","在英语国家旅行文化里，住 hostel 往往意味着更容易认识其他旅客，但也需要注意隐私与财物安全（如使用 locker）。"]}
{"word":"hoster","summary":{"en":"A “hoster” is usually a web-hosting provider; less commonly, it means someone who hosts an event.","zh":"“hoster”通常指网站托管服务商；较少情况下指活动主持人或接待者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Internet/tech) a person or company that provides web hosting (server space and services) for websites.\nExample: We switched to a new hoster because the old one was too slow. / 我们换了新的主机服务商，因为旧的太慢了。\nExample: The hoster offers daily backups and 24/7 support. / 这家主机服务商提供每日备份和全天候支持。","zh":"（互联网/技术）为网站提供托管服务（服务器空间与相关服务）的人或公司。\n例：我们换了新的主机服务商，因为旧的太慢了。 \n例：这家主机服务商提供每日备份和全天候支持。"},"examples":[{"en":"We switched to a new hoster because the old one was too slow.","zh":"我们换了新的主机服务商，因为旧的太慢了。"},{"en":"The hoster offers daily backups and 24/7 support.","zh":"这家主机服务商提供每日备份和全天候支持。"}]},{"partOfSpeech":"n.","definition":{"en":"(General) a person who hosts an event or welcomes guests.\nExample: The hoster introduced the speakers at the conference. / 主持人在会议上介绍了演讲者。\nExample: Thank you for being such a kind hoster. / 谢谢你当这么贴心的东道主。","zh":"（一般）主持活动或接待宾客的人。\n例：主持人在会议上介绍了演讲者。\n例：谢谢你当这么贴心的东道主。"},"examples":[{"en":"The hoster introduced the speakers at the conference.","zh":"主持人在会议上介绍了演讲者。"},{"en":"Thank you for being such a kind hoster.","zh":"谢谢你当这么贴心的东道主。"}]}],"synonyms":["host","web host","hosting provider","hosting company","provider"],"phonetic":"/ˈhoʊstər/","extraExplanation":["“hoster”在日常英语里不如“host”常见。表示“活动主持人/东道主”时，更自然的说法通常是 host（或女性可用 hostess，但现代英语里很多场合也直接用 host 作为性别中性词）。","在技术语境中，“hoster”更像行业口语/欧式英语用法，美式英语里也常直接说 hosting provider / web host / hosting company。"]}
{"word":"hostess","summary":{"en":"Hostess most commonly means a woman who welcomes guests (at an event) or greets and seats customers (in a restaurant). It can also mean a female TV/radio/event host.","zh":"hostess 最常指接待宾客的女主人，或餐厅负责迎宾与安排座位的女领位员；也可指节目或活动的女主持人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who welcomes and takes care of guests, especially at a party or social event","zh":"（尤指聚会或社交活动的）女主人；接待宾客的女性"},"examples":[{"en":"The hostess greeted everyone at the door and offered them drinks.","zh":"女主人在门口迎接每个人，并给大家提供饮料。"},{"en":"As the hostess, she made sure nobody felt left out.","zh":"作为女主人，她确保没有人被冷落。"}]},{"partOfSpeech":"n.","definition":{"en":"a woman whose job is to greet customers and lead them to their seats in a restaurant","zh":"（餐厅）女迎宾；领位员"},"examples":[{"en":"The hostess said it would be a 20-minute wait for a table.","zh":"女迎宾说等位大约需要20分钟。"},{"en":"Please check in with the hostess before you sit down.","zh":"入座前请先到领位处登记。"}]},{"partOfSpeech":"n.","definition":{"en":"a woman who presents or runs a TV/radio show or an event","zh":"（电视/广播节目或活动的）女主持人"},"examples":[{"en":"She was the hostess of a popular late-night talk show.","zh":"她是一档热门深夜脱口秀的女主持人。"}]}],"synonyms":["host","greeter","restaurant host"],"phonetic":"/ˈhoʊstəs/","extraExplanation":["hostess 传统上是 host（主人/主持人）的女性形式。现代英语里，为了性别中立，很多场合更常用 host 来指任何性别（例如 TV show host）。不过在餐厅语境中，hostess 仍然很常见，尤其在美式英语里。","在餐厅里，host/hostess 通常负责问候、登记等位、安排座位并协调服务节奏；与 server（服务员）不同，server 主要负责点餐与上菜。"]}
{"word":"hostessed","summary":{"en":"“Hostessed” means “served as a hostess; welcomed and took care of guests” (past tense of hostess), though “hosted” is more common today.","zh":"“hostessed”意为“以女主人/女招待/女主持人的身份接待照顾客人”（hostess 的过去式），但如今更常见用“hosted”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of “hostess”) to welcome and look after guests, especially in a restaurant, event, or on a TV/radio show.","zh":"（“hostess”的过去式/过去分词）接待并照顾客人；尤指在餐厅、活动现场，或在电视/广播节目中担任主持与招待工作。"},"examples":[{"en":"She hostesssed the charity dinner and introduced the speakers.","zh":"她主持并接待了那场慈善晚宴，还介绍了演讲嘉宾。"},{"en":"We were hostesssed at the door and shown to our table.","zh":"我们在门口被接待，并被带到座位上。"},{"en":"For years, she hostesssed a local radio program.","zh":"多年来，她主持了一档本地电台节目。"}]}],"synonyms":["hosted","welcomed","received","greeted"],"phonetic":"ˈhoʊstɪst","extraExplanation":["“hostessed”是动词“hostess”的过去式/过去分词，但在现代英语里相对少见。很多场合更常用性别中性的“hosted”（如：She hosted the event）。","“hostess”既可以是名词（女主人/女招待/女主持人），也可以作动词（接待/主持）。在强调“由女性担任该角色”时，人们才更可能使用动词“hostess/hostessed”。","拼写注意：它来自“hostess + -ed”，因此会出现双写 s 的形式：hostess → hostesssed（有时在实际写作中也有人回避这种不太常见的拼写，直接改用 hosted）。"]}
{"word":"hostesses","summary":{"en":"“Hostesses” means female hosts who welcome and assist guests (plural).","zh":"“hostesses”指负责迎接并协助客人的女性接待者（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women who welcome and help guests at a restaurant, event, or on a plane; plural of “hostess.”","zh":"在餐厅、活动现场或飞机上接待并协助客人的女性；“hostess”的复数。"},"examples":[{"en":"The hostesses greeted us at the door and showed us to our table.","zh":"女接待员在门口迎接我们，并带我们去座位。"},{"en":"At the conference, the hostesses handed out name tags and schedules.","zh":"在会议上，女礼仪/接待人员发放胸牌和日程表。"},{"en":"Flight hostesses helped passengers find their seats and store their bags.","zh":"空乘女服务员帮助乘客找到座位并放好行李。"}]}],"synonyms":["hosts","greeters","receptionists","flight attendants"],"phonetic":"/ˈhoʊstəsɪz/","extraExplanation":["“hostess”传统上指女性接待者；现代英语中更常用更中性的说法是“host”（活动主持/接待）或在航空业用“flight attendant”（空乘），以避免强调性别。","在不同场景里中文对应会变：餐厅常译“迎宾/领位（员）”，活动场合可译“礼仪/接待人员”，飞机上更常说“空乘/乘务员”。"]}
{"word":"hostessing","summary":{"en":"“Hostessing” means doing the work of welcoming and looking after guests, especially at a restaurant or event.","zh":"“hostessing”指在餐厅或活动中接待客人、安排照顾客人的工作/行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or job of greeting guests and taking care of them at an event, restaurant, etc.","zh":"（在活动或餐厅等场合）接待来宾、招呼并照顾客人的工作/行为"},"examples":[{"en":"She does some hostessing at a busy restaurant on weekends.","zh":"她周末在一家很忙的餐厅做接待工作。"},{"en":"Good hostessing makes guests feel welcome right away.","zh":"好的接待会让客人立刻感到被欢迎。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “hostess”: to act as a hostess; to receive and look after guests","zh":"“hostess”的现在分词：担任女主人/接待员；接待并照顾客人"},"examples":[{"en":"She’s hostessing the charity dinner tonight.","zh":"她今晚在慈善晚宴上担任接待/女主人。"},{"en":"He was hostessing the party and introducing everyone.","zh":"他在聚会上做接待，给大家互相介绍。"}]}],"synonyms":["hosting","greeting guests","welcoming","receiving (guests)","playing host"],"phonetic":"/ˈhoʊstɛsɪŋ/","extraExplanation":["“hostessing”来自“hostess（女主人/女接待员）”。在现代英语里，很多场合会用更中性的说法来避免性别色彩：比如用“hosting”（主持/招待）或“greeting guests / working the host stand（在门口接待）”。在餐厅语境中，“hostessing”通常指在入口处带位、安排座位、接电话、协调等工作。"]}
{"word":"hosthood","summary":{"en":"the role or state of being a host","zh":"当主人（东道主）的身份或状态"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state, role, or experience of being a host (someone who welcomes and takes care of guests)","zh":"作为主人（招待客人者）的状态、角色或体验"},"examples":[{"en":"She grew into her hosthood, learning how to make every guest feel at home.","zh":"她逐渐适应了“当主人”的角色，学会让每位客人都有宾至如归的感觉。"},{"en":"In many cultures, hosthood comes with a strong sense of responsibility.","zh":"在许多文化中，“当主人”往往伴随着很强的责任感。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a group or community of hosts; the collective body of people who host","zh":"（罕见）主人们的群体；招待者的整体"},"examples":[{"en":"The festival depends on the hosthood of volunteers who open their homes.","zh":"这个节日依靠志愿者“主人群体”的支持，他们向来宾敞开家门。"}]}],"synonyms":["hosting","hospitality","hostship","stewardship"],"phonetic":"/ˈhoʊstˌhʊd/","extraExplanation":["这是一个比较少见、偏书面或创造性的词。日常英语更常说 hosting（招待/主持）、being a host（当主人/当东道主）、hospitality（好客、款待）。"],"etymology":"由 host（主人、招待者）+ -hood（表示“身份/状态/群体”的后缀，如 childhood, brotherhood）构成；整体意思就是“当主人的身份/状态”。","mnemonic":["把它拆开记：host（东道主）+ -hood（……的身份/状态）→ “东道主的身份”。","联想 childhood（童年）= child + hood；同理 hosthood = host + hood。"]}
{"word":"hostie","summary":{"en":"“Hostie” is mainly a Quebec French swear word (from the Catholic host), used as an expletive; more rarely it can mean the communion host itself.","zh":"“hostie”主要是魁北克法语中的咒骂感叹词（源自天主教“圣体”），较少情况下也可指圣餐中的圣体薄饼本身。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Canadian French, informal, vulgar) An expletive used to express anger, frustration, or surprise; originally referring to the Eucharistic “host.” Often spelled ostie / esti / hostie.","zh":"（加拿大法语·魁北克口语·粗俗）感叹/咒骂词，用来表达愤怒、懊恼或惊讶；原意与天主教圣体中的“圣体薄饼（host）”有关。常见拼写有 ostie / esti / hostie。"},"examples":[{"en":"He muttered “hostie” under his breath when the bus left early.","zh":"公交车提前开走时，他低声骂了句“hostie”。"},{"en":"In some Quebec movies, you may hear “ostie!” shouted in tense scenes.","zh":"在一些魁北克电影里，紧张场面中你可能会听到有人喊“ostie!”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A small communion wafer; the Eucharistic host.","zh":"（较少见/较旧用法）圣餐薄饼；圣体（Eucharistic host）。"},"examples":[{"en":"The priest lifted the host during the service.","zh":"神父在仪式中举起圣体。"}]}],"synonyms":["ostie","esti"],"phonetic":"/ˈoʊsti/","extraExplanation":["“hostie/ostie/esti”属于魁北克法语里著名的 sacres（源自宗教词汇的咒骂语）。在当地文化语境中很常见，但在正式场合或对不熟的人使用可能被认为冒犯。英语语境里偶尔作为外来语出现，多见于加拿大影视或人物对白。"]}
{"word":"Hostil","summary":{"en":"Hostile means unfriendly or aggressive, or relating to an enemy; as a noun, it can mean an enemy (less common).","zh":"Hostile 表示“不友善的、敌对的”，也可指“敌方的”；作名词时可指“敌对者/敌人”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"unfriendly or aggressive; showing dislike, anger, or opposition","zh":"不友善的；敌对的；带有敌意或强烈反对的"},"examples":[{"en":"The crowd became hostile when the decision was announced.","zh":"宣布决定后，人群变得敌对起来。"},{"en":"He gave me a hostile look and walked away.","zh":"他敌意地看了我一眼就走开了。"},{"en":"Some people were hostile to the new policy.","zh":"有些人强烈反对这项新政策。"}]},{"partOfSpeech":"adj.","definition":{"en":"belonging to an enemy; relating to an opposing side","zh":"敌方的；属于敌人的；与对立一方有关的"},"examples":[{"en":"They crossed into hostile territory.","zh":"他们进入了敌方领土。"},{"en":"The ship was approached by hostile forces.","zh":"那艘船遭到敌方力量逼近。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that is an enemy (less common; often used in plural)","zh":"敌人；敌对方（较少见，常用复数）"},"examples":[{"en":"They negotiated with hostiles to secure the release.","zh":"他们与敌对方谈判以确保获释。"}]}],"synonyms":["unfriendly","aggressive","antagonistic","opposed","adverse","enemy"],"phonetic":"/ˈhɑstəl/","extraExplanation":["你输入的“Hostil”更常见是西班牙语/葡萄牙语的拼写；英语里通常写作 **hostile**。如果你想表达“敌对/不友善”，英语建议用 **hostile**。","常见搭配：**hostile to**（对……敌对/反感），如 *hostile to change*（反感改变）。","在新闻或军事语境中，**hostile territory/forces** 很常见，表示“敌方领土/敌方力量”。"]}
{"word":"hostile","summary":{"en":"Hostile means unfriendly or opposing, and it can also describe harsh conditions that are harmful or difficult to live in.","zh":"hostile 表示“敌对的/不友好的”，也可形容环境“恶劣、不利于生存”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"unfriendly; showing anger or dislike; likely to argue or fight","zh":"敌对的；不友好的；带有愤怒或厌恶情绪的；可能引发争执或冲突的"},"examples":[{"en":"He became hostile when he heard the criticism.","zh":"他听到批评后变得很敌对。"},{"en":"The conversation turned hostile, so she left early.","zh":"谈话变得很不友好，所以她提前离开了。"}]},{"partOfSpeech":"adj.","definition":{"en":"actively opposing someone or something; involving enemies or conflict","zh":"对抗性的；与敌人有关的；涉及冲突或敌对行动的"},"examples":[{"en":"They entered hostile territory.","zh":"他们进入了敌方领土。"},{"en":"The two countries had hostile relations for years.","zh":"两国多年来关系敌对。"}]},{"partOfSpeech":"adj.","definition":{"en":"harmful or harsh; not suitable for life or growth (often about environments or conditions)","zh":"恶劣的；有害的；不利于生存或生长的（常形容环境或条件）"},"examples":[{"en":"Few plants can survive in such a hostile climate.","zh":"很少有植物能在如此恶劣的气候中生存。"}]}],"synonyms":["unfriendly","aggressive","antagonistic","adverse","belligerent"],"phonetic":"/ˈhɑstəl/","extraExplanation":["词源上，hostile 来自拉丁语 hostis（敌人），所以它常带有“敌对/对抗”的核心感觉。日常口语里形容人的态度时，多指“态度很冲、很不友好”；在新闻或历史语境里，也常指国家/组织间的“敌对关系”。","常见搭配：hostile to（对……敌视/不利于）如：The plan was hostile to workers.（这项计划不利于工人。）；hostile environment（敌意/不友善的环境；也可指恶劣环境）。"]}
{"word":"hostilely","summary":{"en":"“Hostilely” means “in a hostile or unfriendly way.”","zh":"“hostilely”表示“以敌对或不友善的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hostile or unfriendly way; showing anger, dislike, or opposition.","zh":"以敌对的方式；不友善地；带着愤怒、厌恶或对立态度地。"},"examples":[{"en":"He stared at me hostilely when I asked about the mistake.","zh":"我问起那个错误时，他敌意地盯着我。"},{"en":"Some people reacted hostilely to the new policy.","zh":"有些人对新政策作出了敌对的反应。"}]}],"synonyms":["aggressively","angrily","unfriendly","belligerently"],"phonetic":"/ˈhɑstl̩i/","extraExplanation":["“hostilely”是副词，来自形容词“hostile（敌对的）”。常用来描述“说话/看人/回应/对待”的方式：speak/look/act/respond hostilely。","语气强度通常比“coldly（冷淡地）”更强，表示带有对抗或攻击性；但不一定真的会动手。写作中也常用来刻画紧张的人际关系或冲突场景。","相关表达：with hostility（带着敌意），in a hostile manner（以敌对的方式）；近义词有 angrily（愤怒地）、aggressively（咄咄逼人地）、unfriendly（不友善地）。"]}
{"word":"hostileness","summary":{"en":"Hostileness means hostility: the state of being unfriendly, aggressive, or opposed.","zh":"hostileness 指“敌意/敌对”：一种不友好、带攻击性或对抗的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being hostile; unfriendliness, aggression, or opposition in attitude or behavior.","zh":"敌意；不友好；（态度或行为上的）对抗、攻击性。"},"examples":[{"en":"There was a noticeable hostileness in his voice when he answered the question.","zh":"他回答问题时，声音里有明显的敌意。"},{"en":"The hostileness between the two groups made cooperation difficult.","zh":"两组之间的敌意让合作变得困难。"},{"en":"She tried to calm the situation and reduce the hostileness in the room.","zh":"她试图缓和局面，减少房间里的敌对气氛。"}]}],"synonyms":["hostility","aggression","antagonism","unfriendliness","animosity"],"phonetic":"/ˈhɑstl̩nəs/","extraExplanation":["“hostileness”是由形容词“hostile（敌对的）”+ 名词后缀“-ness（……的状态/性质）”构成，意思直观：指“敌对的状态/性质”。","更常见的同义名词是“hostility”，在新闻、学术或正式写作中更自然；“hostileness”也正确，但更少见，语感更偏“字面描述某种特质”。","“hostileness/hostility”既可以指人与人之间的敌意（coldness, anger），也可以指环境或条件的“敌对/不利”（例如 hostile environment）。"]}
{"word":"hostiles","summary":{"en":"“Hostiles” most commonly means enemy people/groups, especially in military or news contexts; it can also be the plural form of the adjective “hostile,” though “hostile” is usually preferred before a noun.","zh":"“hostiles”最常指敌对的人/团体（常见于军事或新闻语境）；也可作形容词“hostile”的复数，但作定语时通常更常用“hostile + 名词”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or groups who are unfriendly and may act with anger or violence; enemies (often used in military or news contexts)","zh":"敌对的人或团体；敌人（常用于军事或新闻语境）"},"examples":[{"en":"The patrol reported movement from hostiles near the bridge.","zh":"巡逻队报告说桥附近有敌对人员在活动。"},{"en":"Civilians were evacuated before hostiles entered the town.","zh":"在敌对武装进入城镇之前，平民已被疏散。"}]},{"partOfSpeech":"adj.","definition":{"en":"unfriendly, opposing, or aggressive (plural form of “hostile,” used to describe people, forces, or actions)","zh":"敌对的；对立的；带攻击性的（“hostile”的复数形式，用于描述人、势力或行为）"},"examples":[{"en":"They faced hostiles forces along the border.","zh":"他们在边境遭遇了敌对势力。"},{"en":"The hostiles comments made the meeting tense.","zh":"那些敌意的评论让会议变得紧张。"}]}],"synonyms":["enemies","opponents","adversaries","foes","hostile forces"],"phonetic":"/ˈhɑstəlz/","extraExplanation":["“hostiles”作名词时，常见于军事、警方通报和媒体报道，用来概括“敌对方/敌对人员”，语气比直接说“enemies”更偏“战术/行动用语”。在日常对话里更常说“enemies / hostile people”。","注意拼写与搭配：作形容词一般写“hostile”修饰名词（hostile forces / a hostile environment）。写成“hostiles forces”在正式英语里不太推荐，更自然的是“hostile forces”。"]}
{"word":"hostiley","summary":{"en":"“Hostilely” means “in an unfriendly or aggressive way.” (Often misspelled as “hostiley.”)","zh":"“hostilely”表示“敌意地/不友好地/带攻击性地”。（常被误拼为“hostiley”。）"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a hostile or unfriendly way; with anger or opposition","zh":"敌意地；不友好地；带着愤怒或对抗地"},"examples":[{"en":"She looked at him hostilely after hearing the rumor.","zh":"听到那个谣言后，她敌意地看着他。"},{"en":"The crowd reacted hostilely to the speaker’s comments.","zh":"人群对演讲者的言论作出了敌意的反应。"},{"en":"He spoke hostilely, as if he wanted a fight.","zh":"他说话很敌意，仿佛想找架打。"}]}],"synonyms":["aggressively","angrily","coldly","unfriendly","antagonistically"],"phonetic":"/ˈhɑs.təl.li/","extraExplanation":["“hostiley”通常是拼写错误；正确拼写是 **hostilely**（在 hostile 后加 -ly）。","hostile（敌对的）→ hostilely（敌意地）。日常更常见的替换说法有：**angrily**（愤怒地）、**coldly**（冷淡地）、**unfriendly** + manner（以不友好的方式）。"]}
{"word":"hostilis","summary":{"en":"“Hostilis” is a Latin adjective meaning “hostile; of an enemy,” often seen in historical Latin or in scientific names.","zh":"“hostilis”是拉丁语形容词，意为“敌对的；敌人的”，常见于拉丁文历史语境或生物学学名中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hostile; belonging to an enemy (a Latin adjective, often seen in scientific or historical contexts).","zh":"敌对的；属于敌人的（拉丁语形容词，常见于科学命名或历史语境）。"},"examples":[{"en":"In Latin texts, “hostilis” describes something connected to an enemy army.","zh":"在拉丁文献中，“hostilis”用来形容与敌军相关的事物。"},{"en":"The phrase “terra hostilis” can mean “enemy territory.”","zh":"短语“terra hostilis”可表示“敌方领土/敌占区”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as a Latin species epithet in scientific names, meaning “hostile” or “of the enemy,” sometimes suggesting a defensive or aggressive quality.","zh":"作为拉丁语的生物种加词（学名的一部分）使用时，意为“敌对的/像敌人一样的”，有时暗示“具防御性或攻击性”的特征。"},"examples":[{"en":"“Mimosa hostilis” uses the epithet “hostilis” in its scientific name.","zh":"“Mimosa hostilis”（学名）里就使用了“hostilis”这个种加词。"},{"en":"In taxonomy, Latin adjectives like “hostilis” often describe a trait or impression of the organism.","zh":"在分类学中，像“hostilis”这样的拉丁形容词常用来描述生物的特征或给人的印象。"}]}],"synonyms":["hostile","enemy","antagonistic","warlike"],"phonetic":"/hɑˈstɪlɪs/","extraExplanation":["“hostilis”来自拉丁语“hostis”（敌人），与英语“hostile（敌对的）”同源。你在英语阅读里更多会见到“hostile”，而“hostilis”多出现在拉丁引文、碑铭/史料注释，或动植物学名中。","在现代英语里，“-is”结尾的拉丁词常被原样保留用于学术或命名用途；如果你是在普通英语语境里想表达“敌对的”，通常应使用“hostile”。"]}
{"word":"hostilitatem","summary":{"en":"Hostilitatem is Latin for “hostility,” specifically the accusative singular of hostilitas.","zh":"Hostilitatem 是拉丁语“敌意/敌对”的意思，为 hostilitas 的宾格单数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin) the accusative singular form of hostilitas, meaning “hostility; enmity; aggressive opposition.”","zh":"（拉丁语）hostilitas 的宾格单数形式，意为“敌意；仇恨；对立/对抗（常带攻击性）”。"},"examples":[{"en":"Caesar hostilitatem Gallorum timebat.","zh":"凯撒担心高卢人的敌意。"},{"en":"Pacem petebant, non hostilitatem.","zh":"他们寻求和平，而不是敌意。"},{"en":"Hostilitatem in urbem intulit.","zh":"他把敌对行动带进了城里（对城市采取敌对/攻击行为）。"}]}],"synonyms":["hostility","enmity","animosity","antagonism"],"phonetic":"/ˌhɑstɪˈlɪtətɛm/","extraExplanation":["“hostilitatem”是拉丁语名词变格形式：来自 hostilitas（主格），-tem 结尾通常提示这是第三变格名词的宾格单数，用来作动词的直接宾语或某些介词（如 in/contra 等）的宾语。","词根 hostis 在古拉丁语里可指“外人/敌人”，后来更偏向“敌人”；因此 hostilitas 强调“敌对状态、敌意或敌对行为”。阅读古典文本时，可按语境在“情绪上的敌意”与“行动上的敌对”之间选择更贴切的译法。"]}
{"word":"hostilite","summary":{"en":"Hostility means strong unfriendliness or aggression, and it can also mean fighting or war between groups or countries.","zh":"Hostility 表示强烈的不友善或攻击性（敌意），也可指群体或国家之间的战斗/敌对行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Unfriendly or aggressive feelings or behavior toward someone; strong dislike that can lead to conflict.","zh":"对某人不友善或带有攻击性的情绪或行为；强烈的敌意，可能引发冲突。"},"examples":[{"en":"There was clear hostility between the two teams after the argument.","zh":"争吵之后，两支队伍之间出现了明显的敌意。"},{"en":"She tried to calm the hostility in the room by speaking politely.","zh":"她试图用礼貌的方式说话来缓和房间里的敌意。"},{"en":"Online discussions can quickly turn into hostility if people feel attacked.","zh":"如果人们觉得被攻击，网络讨论很快就会变成敌对和恶意。"}]},{"partOfSpeech":"n.","definition":{"en":"Acts of fighting or war; military conflict.","zh":"战斗行为；军事冲突。"},"examples":[{"en":"The two countries agreed to end hostilities and begin peace talks.","zh":"两国同意结束敌对行动并开始和平谈判。"},{"en":"Hostilities resumed after the ceasefire collapsed.","zh":"停火破裂后，敌对行动再次开始。"}]}],"synonyms":["enmity","animosity","antagonism","aggression","belligerence"],"phonetic":"/hɑˈstɪləti/","extraExplanation":["你输入的“hostilite”很可能是拼写错误。英语里更常见的是 hostility（名词：敌意/敌对行动）或 hostile（形容词：敌对的、不友善的）。","常见搭配：show/feel hostility（表现/感到敌意）；open hostility（公开的敌意）；end hostilities（结束敌对行动）。","hostility 常用于新闻与正式语境；日常口语里也可以用 anger（愤怒）、bad feelings（不好的感觉）、being mean（刻薄/不友善）来更口语地表达。"]}
{"word":"hostilities","summary":{"en":"Hostilities means acts of war or serious conflict, and more generally strong hostility or unfriendly actions.","zh":"Hostilities 指战争/武装冲突中的敌对行动，也可泛指强烈敌意或不友好的对抗行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fighting or acts of war between countries, groups, or armies; armed conflict.","zh":"（国家、团体或军队之间的）敌对行动；战争行为；武装冲突。"},"examples":[{"en":"Hostilities broke out along the border after weeks of tension.","zh":"紧张局势持续数周后，边境爆发了敌对行动。"},{"en":"The two sides agreed to suspend hostilities during the talks.","zh":"双方同意在谈判期间暂停敌对行动。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong hostility or unfriendly actions between people or groups (not necessarily war).","zh":"（人与人或团体之间的）强烈敌意；不友好的行为（不一定指战争）。"},"examples":[{"en":"There were hostilities between the two rival teams’ fans.","zh":"两支劲敌球队的球迷之间发生了敌对行为。"},{"en":"To move forward, we need to reduce hostilities in the workplace.","zh":"要向前推进，我们需要减少职场中的敌意。"}]}],"synonyms":["fighting","conflict","warfare","combat","aggression","enmity"],"phonetic":"/hɑˈstɪləˌtiz/","extraExplanation":["“Hostilities”常用复数形式，尤其在新闻与外交语境中很常见：end hostilities（结束敌对行动）、cease hostilities（停止敌对行动）、renew hostilities（重启冲突）。","语气比“fighting”更正式、偏政治/军事报道；在非战争语境中也可指“敌意与对抗”，但仍带较强的冲突感。","常见搭配：a cessation of hostilities（敌对行动的停止）、the outbreak of hostilities（敌对行动的爆发）、open hostilities（公开对抗）。"]}
{"word":"hostility","summary":{"en":"Hostility means strong unfriendliness or anger, and it can also mean hostile actions or warfare (often in plural: hostilities).","zh":"Hostility 指强烈的敌意或对立情绪；也可指敌对行动或战事（常用复数 hostilities）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strong unfriendliness or anger toward someone or something; ill will.","zh":"对某人或某事强烈的不友好或愤怒；敌意。"},"examples":[{"en":"There was open hostility between the two teams after the argument.","zh":"争吵之后，两支队伍之间出现了公开的敌意。"},{"en":"She tried to calm the hostility in the room by speaking gently.","zh":"她用温和的语气讲话，试图缓和房间里的敌意。"}]},{"partOfSpeech":"n.","definition":{"en":"hostile actions or conflict between groups or countries; fighting or warfare.","zh":"团体或国家之间的敌对行为或冲突；战斗或战争。"},"examples":[{"en":"Hostilities broke out along the border after weeks of tension.","zh":"紧张持续数周后，边境爆发了敌对行动。"},{"en":"The two sides agreed to end hostilities and begin peace talks.","zh":"双方同意结束敌对行动并开始和平谈判。"}]}],"synonyms":["enmity","animosity","antagonism","aggression","belligerence"],"phonetic":"/hɑˈstɪləti/","extraExplanation":["用法提示：hostility 常指“敌意/敌对情绪”（不可数），也可用复数 hostilities 表示“敌对行动、战事”（更偏正式与新闻语体），常见搭配有 end/cease hostilities（停止敌对行动）与 break out（爆发）。","语感区分：hostility 比 dislike（不喜欢）更强烈，带有攻击性或对抗性；也比 anger（愤怒）更强调“对某人/某方的持续对立态度”。"]}
{"word":"hostilization","summary":{"en":"the process of becoming hostile or making something hostile","zh":"敌对化的过程；使关系变得敌对"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making someone or something hostile; the development of hostility","zh":"使（某人/某事）变得敌对的过程；敌意的形成"},"examples":[{"en":"The hostilization of political debate made compromise almost impossible.","zh":"政治辩论的敌对化让妥协几乎不可能。"},{"en":"Misinformation can speed up the hostilization of relations between communities.","zh":"错误信息会加速社群关系的敌对化。"}]}],"synonyms":["hostility","antagonism","antagonization","alienation","deterioration"],"phonetic":"/ˌhɑstəlaɪˈzeɪʃən/","extraExplanation":["该词在现代英语里相对少见，更常见的表达是 hostility（敌意）、increasing hostility（敌意加剧）、the deterioration of relations（关系恶化）、the politicization/weaponization of something（某事被政治化/武器化，语境更具体）。","如果写作中想更自然：可用“the growing hostility between…”或“relations became hostile”来替代。"],"etymology":"由 hostile（敌对的）+ -ization（……化/……的过程）构成，字面义为“敌对化”。属于构词法上可成立但在日常英语中较少使用的名词形式。","mnemonic":["记成“hostile（敌对）+ -ization（……化）= 敌对化”。看到 -ization 就联想到中文的“……化/过程”。","联想中文“关系敌对化”：hostile（敌对的）一加上 -ization 就变成“变得敌对的过程”。"]}
{"word":"hostilize","summary":{"en":"Hostilize means to make someone/something hostile or to become hostile (rare).","zh":"hostilize 指“使变得敌对”，也可指“变得敌对”（较少见）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something hostile or unfriendly; to turn (a person, group, or situation) into an enemy-like relationship","zh":"使（某人/某事）变得敌对；使关系恶化到像敌人一样"},"examples":[{"en":"The harsh policy changes began to hostilize relations between the two communities.","zh":"严厉的政策变化开始使两个社群之间的关系变得敌对。"},{"en":"His constant accusations only hostilized the discussion and made cooperation impossible.","zh":"他不断的指责只会让讨论变得更敌对，使合作变得不可能。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become hostile or unfriendly (less common usage)","zh":"变得敌对、不友好（较少见用法）"},"examples":[{"en":"After weeks of rumors, people in the office started to hostilize toward one another.","zh":"谣言传了几周后，办公室里的人开始彼此敌对起来。"}]}],"synonyms":["antagonize","alienate","embitter","turn hostile","make hostile"],"phonetic":"/ˈhɑstɪˌlaɪz/","extraExplanation":["“hostilize”在现代英语中相对少见，更常见的表达是“make … hostile / turn … hostile”或动词“antagonize”（激怒、使对立）。“hostilize”与英式拼写“hostilise”属于同源变体，写作和正式场合更建议用更常见的替代词以避免显得生硬或不地道。"]}
{"word":"hosting","summary":{"en":"“Hosting” usually means organizing/presenting an event or providing hospitality, and it can also mean web/app hosting services.","zh":"“Hosting”通常指主办/主持活动或招待客人，也可指网站/应用的网络托管服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of being a host: organizing, providing for, or presenting an event, meeting, or program","zh":"主办；主持；招待：作为东道主来组织活动、提供接待或呈现节目"},"examples":[{"en":"The school is hosting a science fair this weekend.","zh":"学校这个周末将主办科学展。"},{"en":"Thank you for hosting us during our visit.","zh":"感谢你在我们拜访期间招待我们。"},{"en":"She did a great job hosting the awards ceremony.","zh":"她主持颁奖典礼做得很出色。"}]},{"partOfSpeech":"n.","definition":{"en":"the business/service of providing space, systems, or servers so a website or app can run online","zh":"（网络/技术）托管：提供服务器与系统资源，使网站或应用能够在线运行的服务"},"examples":[{"en":"We pay for web hosting to keep our site online 24/7.","zh":"我们付费购买网站托管服务，让网站全天候在线。"},{"en":"The company offers hosting and domain registration.","zh":"这家公司提供托管和域名注册。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “host”: to organize, provide for, or present","zh":"host 的现在分词：主办；招待；主持"},"examples":[{"en":"They are hosting a dinner for new students.","zh":"他们正在为新生举办晚宴。"},{"en":"The TV channel is hosting a live debate tonight.","zh":"这个电视台今晚将主持一场直播辩论。"}]}],"synonyms":["organizing","presenting","holding","entertaining","web hosting","site hosting"],"phonetic":"/ˈhoʊstɪŋ/","extraExplanation":["“Hosting”常见两大语境：①活动/节目层面（host an event / host a show）；②互联网技术层面（web hosting / cloud hosting）。在简历或新闻里，hosting 往往强调“负责组织与对外呈现”的角色。","在口语里也常说“Thanks for having us!”（谢谢招待）来表达对 hosting 的感谢。"]}
{"word":"hostis","summary":{"en":"hostis is a Latin word meaning “enemy,” often a public or foreign enemy in Roman texts.","zh":"hostis 是拉丁语，意为“敌人”，在古罗马文本中常指“外敌/公敌”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin noun) an enemy; in Roman usage, a public enemy or foreign opponent (not just a personal rival).","zh":"（拉丁语名词）敌人；在古罗马语境中常指“公敌/外敌”，强调对国家或群体的敌对方，而不只是私人仇人。"},"examples":[{"en":"In Caesar’s Latin, hostis often means the enemy army facing Rome.","zh":"在凯撒的拉丁文中，hostis 常指与罗马对阵的敌军。"},{"en":"The text contrasts civis (“citizen”) with hostis (“enemy/foreigner”).","zh":"文本把 civis（公民）与 hostis（敌人/外邦人）作对比。"}]},{"partOfSpeech":"other","definition":{"en":"(Broader/older sense) a stranger or foreigner—someone outside one’s community, who could be seen as an opponent.","zh":"（更宽泛/较早的含义）陌生人、外邦人——指共同体之外的人，有时会被视为潜在对手。"},"examples":[{"en":"In early contexts, a hostis might be simply a foreigner rather than a declared enemy.","zh":"在较早语境里，hostis 有时只是“外邦人”，不一定是正式宣战的敌人。"}]}],"synonyms":["(Latin) inimicus","enemy","foe","adversary"],"phonetic":"/ˈhɑstɪs/","extraExplanation":["hostis 是很多英语词的词源之一：hostile（敌对的）、hostility（敌意）都来自它。注意它和英语 host（主人/主办者）容易让人混淆：英语 host 多来自另一条拉丁词源（hospes，偏“客人/主人/款待”之意），但在更早的印欧语根层面，它们都和“陌生人/外人”这一概念有关。","在罗马观念里，hostis 往往带有“对国家的敌人”的意味；与之相对的私人层面的“仇人/敌手”常用 inimicus（字面有“非朋友”之意）。这种区分能帮助你读古典文本时把“公敌”与“私怨”分开。"]}
{"word":"hostle","summary":{"en":"A hostel is a low-cost place for travelers to stay, often with shared rooms and facilities.","zh":"Hostel 指面向旅行者的低价住宿，常有多人间与公共设施。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cheap place to stay for travelers, usually with shared rooms and shared bathrooms (a youth hostel is a common type)","zh":"（旅行者住的）旅舍、招待所；通常价格便宜，常见多人间和公共卫浴（“青年旅舍”很常见）"},"examples":[{"en":"We stayed in a hostel near the train station to save money.","zh":"为了省钱，我们住在火车站附近的一家旅舍。"},{"en":"The hostel has a shared kitchen, so you can cook your own meals.","zh":"这家旅舍有共用厨房，所以你可以自己做饭。"},{"en":"She met travelers from many countries at the youth hostel.","zh":"她在青年旅舍认识了来自很多国家的旅行者。"}]}],"synonyms":["youth hostel","budget accommodation","guesthouse (sometimes similar)"],"phonetic":"/ˈhɑstəl/","extraExplanation":["你写的“hostle”通常是拼写错误；常见正确拼法是“hostel”（旅舍）。","注意不要和“hustle”混淆：hustle 通常表示“忙碌奔波/催促/拼命干”或“骗钱（俚语）”，读音和意思都不同。"]}
{"word":"hostler","summary":{"en":"A hostler is a worker who takes care of horses at a stable or inn.","zh":"hostler 指在马厩或旅店等地照料马匹的马夫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to take care of horses, especially at an inn, stable, or racetrack (feeding, grooming, leading, and cleaning stalls)","zh":"（尤指旅店、马厩或赛马场的）马夫；照料马匹的人（喂养、梳理、牵引、清理马厩等）"},"examples":[{"en":"The hostler brushed the horses and filled the water buckets before dawn.","zh":"天还没亮，马夫就给马梳毛并把水桶装满。"},{"en":"In the old days, a hostler at an inn would take your horse to the stable.","zh":"过去在旅店里，马夫会把你的马牵到马厩去。"}]}],"synonyms":["ostler","stablehand","groom"],"phonetic":"/ˈhɑstlər/","extraExplanation":["“hostler”也常写作“ostler”，是较早的拼写形式。这个词在以马为主要交通工具的时代更常见；现代英语里多用于历史题材、文学作品或赛马行业语境。"]}
{"word":"hostlers","summary":{"en":"Hostlers are workers who care for horses (especially at stables or inns); in railroad use, they service and move locomotives.","zh":"hostlers 指照料马匹的马夫（尤在马厩或客栈）；在铁路语境中指负责机车移动与勤务维护的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stable worker who takes care of horses (feeding, grooming, and handling them), especially at an inn or stable","zh":"（尤指客栈或马厩的）马夫；照料马匹的人（喂养、梳洗、牵引等）"},"examples":[{"en":"The hostlers fed the horses and brushed them down before sunrise.","zh":"马夫们在日出前给马喂食并把它们刷洗干净。"},{"en":"At the old inn, a hostler took our horse to the stable for the night.","zh":"在那家老客栈里，一名马夫把我们的马牵到马厩过夜。"}]},{"partOfSpeech":"n.","definition":{"en":"(railroads) a worker who moves, fuels, or services locomotives in a yard or roundhouse","zh":"（铁路）机车勤务员；在机务段/车场移动、加油或维护机车的工人"},"examples":[{"en":"A hostler brought the engine to the platform and checked the fuel.","zh":"机车勤务员把机车开到站台并检查了燃料。"},{"en":"The hostlers worked overnight to prepare the locomotives for morning departures.","zh":"机车勤务员整夜工作，为早晨发车准备机车。"}]}],"synonyms":["stable hand","groom","ostler","railroad hostler","engine hostler"],"phonetic":"/ˈhɑstlərz/","extraExplanation":["“hostler”常见于历史题材、牛仔/西部小说或古典描写客栈与马车旅行的语境；现代日常英语里更常用“stable hand”（马厩工人）来表达第一义。","词源上与“hostel/host”（客栈/主人）有关，原指在客栈照料客人的马匹的人。","复数“hostlers”多用于描述一群马夫或一组铁路机车勤务员。"]}
{"word":"hostlership","summary":{"en":"Hostlership is a rare noun meaning the job or duties of a hostler (a person who takes care of horses).","zh":"Hostlership 是一个罕见名词，指马夫（照料马匹的人）的工作或职责。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The job, position, or duties of a hostler—someone employed to care for horses (and historically, sometimes to handle animals/vehicles at an inn or stable).","zh":"（罕见）“hostler（马夫/马厩工）”的工作、职位或职责；指照料马匹（历史上也可指在旅店/马厩处理牲畜或车辆的人）的职务。"},"examples":[{"en":"In the 1800s, he found steady work in hostlership at a coaching inn.","zh":"在19世纪，他在一家驿站旅店做马夫（hostlership）找到了稳定的工作。"},{"en":"The novel mentions his years of hostlership before he became a coach driver.","zh":"小说提到他在成为马车夫之前，当过多年的马夫（hostlership）。"}]}],"synonyms":["hostlership","ostlership","stable work","grooming (horses)"],"phonetic":"/ˈhɑstlərʃɪp/","extraExplanation":["“hostlership”非常少见，多数现代词典不收。你更可能想写的是 **hostel**（旅社/青年旅舍）相关词，或是拼到 **hostlership**（更常见的拼法）。","词根 **hostler** 源自较早的 **ostler**，原意与“在旅店照看马匹的人”有关，常见于历史、文学或西部题材语境。","如果你告诉我你看到这个词的句子或来源（书名/文章/截图），我可以帮你确认是不是拼写错误，以及在该语境里最自然的理解。"]}
{"word":"hostlerwife","summary":{"en":"A rare, old-fashioned word meaning “the wife of a hostler,” connected to inns and stables.","zh":"一个少见、较古旧的词，意为“马夫的妻子”，常与旅店和马厩的语境有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the wife of a hostler (a person who takes care of horses at an inn or stable); by extension, a woman associated with an inn’s stables","zh":"马夫（旅店或马厩里照看马匹的人）的妻子；引申为与旅店马厩工作相关的女性"},"examples":[{"en":"In older stories, a traveler might ask the hostlerwife for water and a clean stall.","zh":"在较老的故事里，旅人可能会向马夫的妻子要水，并请她帮忙准备干净的马厩。"},{"en":"The hostlerwife knew every horse that came through the inn.","zh":"马夫的妻子认识每一匹经过这家旅店的马。"}]}],"synonyms":["hostler’s wife","stableman’s wife","groom’s wife"],"phonetic":"/ˈhɑstlər waɪf/","extraExplanation":["这是一个较少见、带有历史色彩的合成词（hostler + wife）。hostler 指“旅店里照料马匹的人/马夫”，在汽车出现之前，长途旅行常依赖马匹，因此旅店与马厩是常见场景。","现代英语里更常见的相关表达是 hostler’s wife（带所有格）或直接说 the hostler’s wife / the stableman’s wife。拼成一个词 hostlerwife 多见于旧文本、方言写法或特定文学语境。"]}
{"word":"hostless","summary":{"en":"Hostless means “without a host,” most commonly in computing to describe systems or modes that don’t require a host device.","zh":"hostless 意为“无主机/无主持人”，最常见于计算机领域，指不需要主机设备即可运行的模式或系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a host; not requiring or involving a host system or device (especially in computing and networking).","zh":"无主机的；不需要或不涉及主机系统/设备的（尤用于计算机与网络语境）。"},"examples":[{"en":"Some USB devices can work in a hostless mode for simple data transfer.","zh":"一些 USB 设备可以在无主机模式下工作，用于简单的数据传输。"},{"en":"The software supports hostless installation, so you can run it directly from a drive.","zh":"该软件支持无主机安装，因此你可以直接从硬盘/U 盘运行。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without a host (a person who receives guests); lacking a host at an event or gathering.","zh":"无主持人的；（聚会、活动）没有主人/主持人接待的。"},"examples":[{"en":"The meeting felt awkward and hostless at first, until someone welcomed the visitors.","zh":"会议一开始显得有些尴尬、像是“无主持人”的，直到有人起身欢迎来宾。"}]}],"synonyms":["host-free","without a host","no-host (context-dependent)"],"phonetic":"/ˈhoʊstləs/","extraExplanation":["“hostless”在日常英语中不算常见，更常见的替代表达有：without a host、host-free、no-host（在某些语境里）。","在技术语境中，host 通常指“主机/宿主系统”（host computer / host machine）。因此 hostless 常用来描述“不依赖主机”的工作模式或架构（例如 hostless printing、hostless backup 等）。","在人际/活动语境里，host 指“主人/主持人”。不过这种用法更少见，通常会直接说 “there is no host” 或 “the event had no host.”"]}
{"word":"hostliness","summary":{"en":"warm, welcoming hospitality toward guests","zh":"对客人的热情欢迎与款待"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being friendly and welcoming to guests; hospitality","zh":"好客；待客友善与热情（相当于 hospitality）"},"examples":[{"en":"Visitors often praised the hostliness of the small town.","zh":"游客常常称赞这座小镇的好客。"},{"en":"Her hostliness made everyone feel at home within minutes.","zh":"她的热情好客让大家几分钟内就有宾至如归的感觉。"}]}],"synonyms":["hospitality","friendliness","welcomeness","cordiality","warmth"],"phonetic":"/ˈhoʊstlinəs/","extraExplanation":["hostliness 属于较少见（偏文学或较旧式）的表达；日常英语里通常说 hospitality（好客、款待）或 friendliness（友善）。","相关形容词 hostly 也比较少见；更常用的是 hospitable（好客的）。"],"etymology":"由 host（主人/东道主）+ -ly（构成形容词 hostly“像主人般的、好客的”）+ -ness（名词后缀，表示“……的特质”）组成；现代英语中更常用 hospitality 来表达同义。","mnemonic":["把它拆开记：host（东道主）+ -liness（“……的特质”）→ “像主人一样的特质”＝好客。","联想中文“东道主”：当好 host，自然就有 hostliness（好客）。"]}
{"word":"hostly","summary":{"en":"Hostly is a rare adjective meaning “hospitable” or “related to a host (someone who welcomes guests).”","zh":"hostly 是一个很少见的形容词，意思是“好客的”，或“与主人/主办者（接待来宾的人）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Hospitable; welcoming to guests.","zh":"（罕用）好客的；热情接待客人的。"},"examples":[{"en":"They offered a hostly welcome to travelers who arrived late at night.","zh":"他们对深夜到来的旅人给予了热情好客的欢迎。"},{"en":"In the old story, the innkeeper is described as hostly and kind.","zh":"在这个古老的故事里，旅店老板被描写得好客而善良。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to a host (a person who receives and entertains guests).","zh":"（罕用）与“主人/主办者”（接待并招待客人的人）有关的。"},"examples":[{"en":"Her hostly duties included greeting everyone at the door.","zh":"她作为主人应尽的职责包括在门口迎接每一位来宾。"},{"en":"He spoke in a hostly tone, making the group feel at ease.","zh":"他用主人般的语气说话，让大家感到放松。"}]}],"synonyms":["hospitable","welcoming","friendly","cordial"],"phonetic":"/ˈhoʊstli/","extraExplanation":["“hostly”在现代英语里非常少见，多见于较旧的文本或刻意的文学风格。日常表达“好客的”更常用 hospitable / welcoming / friendly。","它很容易被误读或误写成“ghostly”（幽灵般的）。如果你想表达“阴森、像幽灵一样”，更可能需要的是 ghostly。"]}
{"word":"hostname","summary":{"en":"a network name that identifies a particular machine or server","zh":"用于标识某台机器或服务器的网络名称"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the name that identifies a specific computer, device, or server on a network (often used with a domain name, e.g., in URLs or DNS)","zh":"（网络中）用来标识某台计算机/设备/服务器的名称（常与域名一起使用，如网址或 DNS 中）"},"examples":[{"en":"What’s the hostname of this server?","zh":"这台服务器的主机名是什么？"},{"en":"The hostname “www” is often used for websites, as in www.example.com.","zh":"“www”常用作网站的主机名，比如 www.example.com。"},{"en":"Change the hostname after you install the operating system.","zh":"安装操作系统后再修改主机名。"}]}],"synonyms":["host name","machine name","node name","computer name"],"phonetic":"/ˈhoʊstˌneɪm/","extraExplanation":["在很多系统里，hostname 是“本机的名字”（如一台电脑在局域网中的名称）；在互联网中常见为“子域/主机部分”，例如 mail.example.com 里的 mail。具体规则取决于 DNS 与系统设置。"],"etymology":"由 host（主机、提供服务的计算机）+ name（名称）组合而成；在计算机网络语境中固定指“用于识别主机的名字”。","mnemonic":["把它拆开记：host（主机）+ name（名字）= 主机的名字。","联想成“这台电脑在网络里的称呼/外号”，就是 hostname。"]}
{"word":"hostry","summary":{"en":"“Hostry” is not a standard English word; it is most likely a misspelling of “history.”","zh":"“hostry”不是标准英语单词；最可能是“history（历史）”的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) the study or record of past events, especially of human societies.","zh":"（可能想拼的是）历史；对过去事件（尤指人类社会）的研究或记载。"},"examples":[{"en":"I’m reading a book about ancient Roman history.","zh":"我在读一本关于古罗马历史的书。"},{"en":"She teaches history at a high school.","zh":"她在一所高中教历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the past events of a particular place, subject, or person; background information.","zh":"某个地方/主题/人的过往与背景；来历。"},"examples":[{"en":"What’s the history of this building?","zh":"这栋建筑有什么历史（来历）？"},{"en":"The company has a long history of innovation.","zh":"这家公司有很长的创新历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a record of what has happened, especially kept for medical, legal, or technical purposes.","zh":"（尤指医疗、法律或技术用途的）记录；病史；历史记录。"},"examples":[{"en":"The doctor asked about his medical history.","zh":"医生询问了他的病史。"},{"en":"Your browser history shows the websites you visited.","zh":"浏览器历史记录会显示你访问过的网站。"}]}],"synonyms":["past","background","record","chronicle"],"phonetic":"/ˈhɪstəri/","extraExplanation":["“hostry”不是常见英语单词，最可能是把“history”（历史）拼错了。","如果你原本想表达“旅店/客栈”，可能是在找“hostelry”（较正式用语）或更常用的“hotel”。"]}
{"word":"hosts","summary":{"en":"“Hosts” can mean the people who welcome guests, the act of hosting an event/program, or (in tech) network computers/servers.","zh":"“hosts”可指接待客人的主人们、主办/主持活动（动词第三人称单数），也可指（技术领域）网络主机/服务器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) People who receive guests and provide food, drink, or entertainment for them.","zh":"（名词复数）接待客人并提供食物、饮料或娱乐的人；主人（们）"},"examples":[{"en":"Thanks to our hosts for a wonderful dinner.","zh":"感谢我们的主人们准备了这么棒的晚餐。"},{"en":"The hosts welcomed everyone at the door.","zh":"主人们在门口欢迎每一位来宾。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To organize an event or program and welcome/serve guests or an audience.","zh":"（动词第三人称单数）主办；主持（活动或节目），并接待来宾或观众"},"examples":[{"en":"She hosts a weekly podcast about learning English.","zh":"她主持一个每周更新的英语学习播客。"},{"en":"Our school hosts an international festival every spring.","zh":"我们学校每年春天都会举办国际文化节。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Computers or servers that store websites, data, or services on a network.","zh":"（名词复数）网络中的主机；（提供网站/数据/服务的）服务器"},"examples":[{"en":"The IT team updated the hosts to improve security.","zh":"IT 团队更新了这些主机以提升安全性。"},{"en":"The website is down because one of the hosts failed.","zh":"网站无法访问，因为其中一台主机出了故障。"}]}],"synonyms":["organizers","presenters","emcees","providers","servers"],"phonetic":"/hoʊsts/","extraExplanation":["“host”在日常生活中最常见是“主人/东道主”。在正式活动里也常指“主持人”（电视节目、播客、颁奖礼等）。","计算机领域里，“host”指提供资源或服务的“主机/服务器”，和“guest（客户端/来访者）”形成对比。"]}
{"word":"hostship","summary":{"en":"Hostship means the duties or status of being a host, but it’s rare; people usually say hosting or hospitality.","zh":"Hostship 指“作为主人/东道主的职责或身份”，但用法很少见；更常用 hosting 或 hospitality。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the role, status, or duties of being a host; the act or practice of hosting (rare/nonstandard).","zh":"（罕见/不太规范）“作为主人/东道主”的身份或职责；招待、主办的行为或做法。"},"examples":[{"en":"Thank you for your warm hostship during our visit.","zh":"感谢你在我们来访期间热情款待。"},{"en":"Her hostship made everyone feel comfortable and welcome.","zh":"她的待客之道让每个人都感到放松、受欢迎。"},{"en":"The event succeeded largely because of the organizer’s careful hostship.","zh":"活动之所以成功，很大程度上是因为主办方细致周到的接待与安排。"}]}],"synonyms":["hosting","hospitality","hosthood","stewardship"],"phonetic":"/ˈhoʊstʃɪp/","extraExplanation":["“hostship”在现代英语里很少见，很多母语者更常说 hosting（主办/接待）或 hospitality（好客、款待）。","词尾 -ship 常用于表示“身份/状态/关系”（如 friendship 友谊、leadership 领导力）。因此 hostship 可以理解为“主人/东道主这一身份或其所体现的待客之道”，但写作中建议用更常见的词以避免显得不自然。"]}

