{"word":"hova","summary":{"en":"“Hova” is best known as Jay-Z’s nickname, and more generally a hip-hop slang term meaning someone is godlike or the best.","zh":"“Hova”最常见是 Jay-Z 的昵称；更广义上也可作嘻哈俚语，形容某人“神级/最强”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname for the rapper Jay-Z (Shawn Carter), used by fans and in music/hip-hop culture","zh":"Jay-Z（肖恩·卡特）的昵称；常见于粉丝称呼与嘻哈音乐语境"},"examples":[{"en":"Jay-Z is often called “Hova” in his songs and by his fans.","zh":"在他的歌曲里以及粉丝之间，Jay-Z 常被称为 “Hova”。"},{"en":"The DJ played some classic Hova tracks.","zh":"DJ 放了几首经典的 Hova（Jay-Z）歌曲。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, hip-hop) a way to suggest someone is godlike, untouchable, or the best at what they do","zh":"（俚语，嘻哈语境）形容某人“神级”、不可撼动、在某领域最强"},"examples":[{"en":"After that performance, people were calling him Hova.","zh":"那场表演之后，人们都说他简直是 Hova（神级）。"},{"en":"She’s the Hova of her team—always delivers under pressure.","zh":"她是团队里的 Hova——压力之下也总能稳稳发挥。"}]}],"synonyms":["Jay-Z","Jigga","GOAT (slang)","legend (informal)"],"phonetic":"/ˈhoʊvə/","extraExplanation":["“Hova”常被认为来自“Jehovah（耶和华）”的缩写/变体，用来营造“神一般的地位”的意象。Jay-Z在歌词与公众形象中也强化了这一称呼，因此在流行文化里“听到 Hova”经常指的就是他。","用法提示：在正式写作中一般不使用；多用于口语、歌词、评论音乐或嘻哈文化的语境。"]}
{"word":"Hove","summary":{"en":"“Hove” is usually the past form of “heave” (lift/pull; also nautical), and it can also be the place name Hove in southern England. In “hove to,” it means a ship is held steady to wait or face bad weather.","zh":"“Hove”通常是“heave”的过去式/过去分词（用力抬起、拉动；也用于航海）。它也可作英国南部地名“霍夫”。在“hove to”中指船只减速/停住并保持稳定以等待或应对恶劣天气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “heave” (to lift, pull, or move something heavy; also used in nautical English).","zh":"“heave”的过去式和过去分词（指用力抬起、拉动或移动沉重之物；也常见于航海用语）。"},"examples":[{"en":"He hove the suitcase into the trunk with both hands.","zh":"他双手把行李箱用力抬进后备箱。"},{"en":"Dark clouds hove into view on the horizon.","zh":"地平线上出现了乌云。"},{"en":"The crew hove the anchor up before sunrise.","zh":"船员在日出前把锚拉了上来。"}]},{"partOfSpeech":"n.","definition":{"en":"A coastal town in southern England, now part of the city of Brighton and Hove.","zh":"英国英格兰南部的海滨城镇，如今属于“布莱顿-霍夫（Brighton and Hove）”这座城市的一部分。"},"examples":[{"en":"She studied in Brighton and lived in Hove for a year.","zh":"她在布莱顿读书，并在霍夫住了一年。"},{"en":"We walked along the seafront in Hove.","zh":"我们沿着霍夫的海滨散步。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the phrase “hove to”: (of a ship) stopped or slowed and kept in a steady position, usually to wait or ride out rough weather.","zh":"用于短语“hove to”：（船只）减速或停住，并保持相对稳定的位置，常为等待或躲避恶劣天气。"},"examples":[{"en":"The captain ordered the ship to heave to; soon we were hove to in the storm.","zh":"船长下令让船“hove to”；很快我们就在暴风雨中保持了稳定的待命状态。"},{"en":"They stayed hove to until the fog cleared.","zh":"他们保持“hove to”直到大雾散去。"}]}],"synonyms":["lifted","pulled","lugged","threw","appeared"],"phonetic":"/hoʊv/","extraExplanation":["“hove”在现代英语里多见于书面语、新闻或航海语境；日常口语里更常用“lifted / pulled / threw / appeared”。","“hove into view”表示“突然/渐渐进入视野”，语气比“appeared”更有画面感。","作为地名的Hove通常与Brighton并列出现（Brighton and Hove），读音与动词形式相同，需要靠上下文判断。"]}
{"word":"hove","summary":{"en":"Hove is the past form of heave: to lift/throw with effort, and in nautical English it appears in “hove to” (a ship kept steady). It can also mean “appeared” in the literary phrase “hove into sight.”","zh":"hove 是 heave 的过去式/过去分词：指用力抬起/扔出；航海中常见于“hove to”（船停船并保持稳定）。也可在文学表达“hove into sight”中表示“出现/进入视野”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense and past participle of “heave”) to lift, pull, or throw something with effort.","zh":"（heave 的过去式和过去分词）用力抬起、拉起或扔出某物。"},"examples":[{"en":"They hove the heavy crate onto the truck.","zh":"他们把沉重的箱子用力抬上了卡车。"},{"en":"He hove a rock into the river.","zh":"他用力把一块石头扔进了河里。"}]},{"partOfSpeech":"v.","definition":{"en":"(nautical) to bring a ship to a stop or to a steady position, especially in the phrase “hove to.”","zh":"（航海）使船减速并保持稳定位置；常见于短语“hove to”（船停船/迎风待命）。"},"examples":[{"en":"The captain ordered the ship to be hove to during the storm.","zh":"暴风雨中，船长下令让船“hove to”（停船迎风待命）。"},{"en":"We stayed hove to until the fog lifted.","zh":"我们保持“hove to”，直到雾散。"}]},{"partOfSpeech":"v.","definition":{"en":"(literary, especially with “into view/sight”) to appear or come into view.","zh":"（文学用法，常与 into view/sight 连用）出现；进入视野。"},"examples":[{"en":"A sail hove into sight on the horizon.","zh":"地平线上出现了一面帆影。"},{"en":"The mountains hove into view as the clouds cleared.","zh":"云开之后，群山进入了视野。"}]}],"synonyms":["heaved","lifted","hauled","threw","appeared (in ‘hove into view’)"],"phonetic":"/hoʊv/","extraExplanation":["“hove”本身多被当作 heave 的过去式/过去分词来学习。现代英语中更常见的是 heave / heaved；但在航海语境里，“hove to”（船停船、迎风稳定）是固定搭配，仍很常用。","“hove into sight/view”带有较强的书面/文学色彩，常用于描写景物或船只‘突然映入眼帘’的画面感。"]}
{"word":"hove-to","summary":{"en":"to bring a ship into a waiting position, facing the wind","zh":"让船迎风停住（待命/避风浪）"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a ship) to stop or hold position by turning its bow into the wind and adjusting sails or engine, usually to wait, rest, or ride out bad weather.","zh":"（船只）迎风调整帆或动力，让船基本停住或缓慢漂移，常用于等待、休整或熬过恶劣天气。"},"examples":[{"en":"The captain ordered the crew to heave-to until the storm passed.","zh":"船长命令船员让船迎风停住，等风暴过去。"},{"en":"They hove-to overnight to make repairs safely.","zh":"他们让船迎风停了一夜，以便安全检修。"},{"en":"In heavy seas, the yacht was hove-to to reduce stress on the rigging.","zh":"在大浪中，游艇采取迎风停船来减轻索具的压力。"}]}],"synonyms":["heave-to","lay to","stand by","hold position"],"phonetic":"/ˌhoʊv ˈtuː/","extraExplanation":["常见写法有 heave-to / heave to / hove-to（过去式/过去分词常用 hove-to）。在日志或叙述中，hove-to 常用来描述“已经处于迎风停船状态”。","语感上更像一个“航海动作/状态”，通常出现在海事、航海小说、航海训练材料中；日常英语里不常见。"],"etymology":"源自航海用语 heave to（“把船调整到迎风停住/待命的状态”）。heave 原意为“用力拉/抬”，to 在此表示“到……的状态/方向”。过去多指帆船操作，如今也可用于机帆船。","mnemonic":["把 hove-to 想成“hold（停住）+ to（到某种状态）”：hove-to ≈ 到了“停住待命”的状态。","联想中文“迎风停船/顶风待命”，画面感很强：船头对着风，减少前进、等待风浪过去。"]}
{"word":"hovedance","summary":{"en":"“hovedance” is not a standard English word; it’s likely a misspelling or a made-up name.","zh":"“hovedance”不是标准英语词，更可能是拼写错误或自创名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It most likely looks like a misspelling or a made-up name (for example, a username, brand, or title).","zh":"不是标准英语单词，更像是拼写错误或人为造出来的名称（例如用户名、品牌名或作品标题）。"},"examples":[{"en":"I couldn’t find “hovedance” in a dictionary—did you mean “hoedown” or “hive dance”?","zh":"我在词典里找不到“hovedance”——你是不是想写“hoedown”或“hive dance”？"},{"en":"“Hovedance” appears to be a screen name rather than a common word.","zh":"“  Hovedance”看起来更像是网名，而不是常见词。"}]}],"synonyms":["(no standard synonyms)"],"phonetic":"/hoʊv dæns/","extraExplanation":["“hovedance”在常见语料与词典里基本没有固定释义，因此更可能是：\n1）把两个词拼在一起（hove + dance）形成的自创词；\n2）拼写想表达别的词。\n\n你可能想写的常见相关表达：\n- hoedown（n. /ˈhoʊdaʊn/）：乡村快舞/农夫舞会式的舞（常见于美国乡村音乐场景）。\n- hive dance（n.）：一般不常用；但 bee dance（蜜蜂舞）更常见，指蜜蜂用“摆尾舞/圆舞”传递信息。 \n\n如果你告诉我它出现的句子或场景（例如歌词、游戏名、社交媒体简介），我可以更准确判断它想表达的意思。"]}
{"word":"hovel","summary":{"en":"A hovel is a very small, poorly built, often dirty home or shelter.","zh":"hovel 指非常简陋破旧、常常肮脏的小屋或住处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, poorly built, and often dirty house or shelter","zh":"破旧简陋的小屋；（常指）又小又脏、搭建粗糙的住处"},"examples":[{"en":"They lived in a hovel with a leaking roof.","zh":"他们住在一间屋顶漏水的破屋里。"},{"en":"The charity helped replace unsafe hovels with stronger homes.","zh":"慈善机构帮助把不安全的破棚屋换成更坚固的房子。"}]}],"synonyms":["shack","hut","shanty","slum dwelling"],"phonetic":"/ˈhɑvəl/","extraExplanation":["“hovel”通常带有强烈的负面语气，暗示贫困、拥挤或不卫生。描述他人居住环境时可能显得很刺耳；如果是在写作或新闻语境里，多用于强调艰苦的生活条件。","在文学与社会纪实写作中，“hovel”常用来凸显阶级差距与城市贫民窟环境，例如描写“从豪宅到棚屋（from mansions to hovels）”来形成对比。"]}
{"word":"hovel-dweller","summary":{"en":"someone living in a very poor, small shelter","zh":"住在非常简陋贫困居所的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives in a hovel (a small, poor, and often dirty house or shelter).","zh":"住在破棚屋/破陋小屋里的人（常指居住条件很差、简陋甚至肮脏）。"},"examples":[{"en":"The charity focused on helping hovel-dwellers get clean water and safer housing.","zh":"这个慈善机构专注于帮助住在破棚屋里的人获得干净的饮用水和更安全的住房。"},{"en":"In the novel, the hero grows up as a hovel-dweller before leaving the village.","zh":"在小说里，主人公小时候住在破陋小屋里，后来才离开村庄。"}]}],"synonyms":["shanty resident","slum resident","squatter"],"phonetic":"ˈhɑvəl ˌdwɛlər","extraExplanation":["语气与文化提示：该词通常带有强烈的贫困与社会边缘化含义，可能显得刺耳或带评判色彩。更中性/尊重的表达可用 people living in substandard housing（居住在不达标住房的人）、residents of informal settlements（非正规住区居民）等，视语境而定。"],"etymology":"复合词：hovel（“破棚屋、破陋小屋”，源自中古英语，原意与“敞棚/简陋棚屋”相关）+ dweller（“居住者”，来自 dwell “居住”）。连字符常见于强调这是一个整体称谓。","mnemonic":["拆开记：hovel=“破棚屋”，dweller=“住的人”，合起来就是“住破棚屋的人”。","把 hovel 联想成“好(ho) 危(vel) 的房子”→房子很破很危险→住在那里的人。"]}
{"word":"hoveled","summary":{"en":"“Hoveled” means living in a hovel—very poor, cramped living conditions. It can also be a rare past form of “hovel.”","zh":"“hoveled”指住在棚屋/陋屋里，形容极贫困、狭小的居住状态；也可作罕见的“hovel”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living in a hovel; very poor, cramped, or dirty (used to describe people or their living conditions).","zh":"住在棚屋/陋屋里的；（形容人或居住环境）极其贫困、狭小或肮脏的。"},"examples":[{"en":"They were a hoveled family, squeezed into one damp room.","zh":"他们一家住得像住在棚屋里一样，挤在一间潮湿的房间里。"},{"en":"The novel describes hoveled workers in the back streets of the city.","zh":"这部小说描写了城市后街里住在陋屋中的工人。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) Past tense/past participle of “hovel”: to put someone into a hovel or poor shelter; to live in a hovel.","zh":"（罕见）“hovel”的过去式/过去分词：把某人安置在棚屋/简陋住处；（或）住在棚屋里。"},"examples":[{"en":"In the old text, families were hoveled near the fields for the season.","zh":"在那篇旧文本中，季节期间一些家庭被安置在田边的简陋住处。"}]}],"synonyms":["impoverished","squalid","shabby","slum-dwelling","destitute"],"phonetic":"/ˈhɑvəld/","extraExplanation":["“hoveled”更常见的拼写是英式英语里的“hovelled”（双写l）。美式英语通常写作“hoveled/ hoveled”，但这个词整体偏文学、历史描写，用来营造贫困与逼仄的氛围。","核心名词“hovel”指“简陋的小屋、棚屋”，常带有负面评价（脏、破、拥挤）。在现代日常英语中更常见的表达包括：living in a shack / in a slum / in squalor。"]}
{"word":"hoveler","summary":{"en":"A “hoveler” is someone who lives in a hovel—a very small, poor, roughly built home.","zh":"“hoveler”指住在棚屋/破屋（非常小、简陋、贫穷的住处）里的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives in a hovel (a small, poor, roughly built home)","zh":"住在棚屋/破屋里的人（棚屋指简陋、贫穷、粗糙搭建的住处）"},"examples":[{"en":"In the novel, the hoveler struggles to feed his family through the winter.","zh":"在小说里，这位住棚屋的人在冬天里艰难地养活家人。"},{"en":"The charity brought blankets and food to the hoveler on the edge of town.","zh":"慈善机构给住在城镇边缘棚屋里的人送去了毯子和食物。"}]}],"synonyms":["hovel-dweller","shanty-dweller","poor cottager"],"phonetic":"/ˈhɑvələr/","extraExplanation":["“hoveler”由“hovel（棚屋、破屋）+ -er（表示人）”构成，语气通常带有同情或批判贫困的色彩，但在现代英语中较少单独使用；更常见的表达是“a person living in a hovel”。","阅读文学作品时，它常用于描写社会底层、贫困或边缘化人群的处境；在正式写作中若指代真实群体，建议用更中性的人称表达，避免标签化。"]}
{"word":"hoveling","summary":{"en":"Hoveling means living in a hovel or in extremely poor, hovel-like housing conditions.","zh":"Hoveling 指住在陋屋/破棚屋里，或形容极其贫困、棚屋般的居住环境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"living in a hovel (a small, dirty, poorly built shelter) or in extremely poor housing conditions","zh":"住在破棚屋/陋屋里；形容居住环境极其简陋、肮脏、贫困"},"examples":[{"en":"The article described hoveling families crowded into makeshift shelters.","zh":"那篇报道描写了挤在临时棚屋里的贫困家庭。"},{"en":"He grew up hoveling on the edge of the city, without clean water or heat.","zh":"他在城市边缘的破棚屋里长大，没有干净的水和暖气。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of living in a hovel; (also) putting or forcing someone to live in hovel-like conditions","zh":"住在破棚屋里；（也可指）把某人安置/逼迫在棚屋般的恶劣居住条件中"},"examples":[{"en":"They survived by hoveling near the construction site for months.","zh":"他们靠在工地旁的破棚屋里栖身，撑了好几个月。"},{"en":"The policy was criticized for hoveling migrant workers in unsafe dorms.","zh":"这项政策因把外来务工人员“棚屋式安置”在不安全的宿舍里而受到批评。"}]}],"synonyms":["living in squalor","shack-dwelling","slum-dwelling","impoverished","destitute"],"phonetic":"/ˈhʌvəlɪŋ/","extraExplanation":["“hoveling”源自名词/动词 hovel（陋屋、破棚屋）。它带有很强的负面色彩，常见于新闻报道、社会评论或文学描写，用来强调贫困、拥挤与不人道的居住环境。","在现代英语里，“hoveling”并不算特别常用；更常见的表达是 living in a hovel / living in squalor（住在污秽贫困中）或 being housed in substandard conditions（被安置在不达标的条件下）。","文学与社会写作中常用 hovel 来营造“贫民窟/底层生活”的画面（例如维多利亚时代贫困题材作品里常见此类意象）。"]}
{"word":"hovelled","summary":{"en":"“Hovelled” usually describes people or places connected with hovels—very poor, small, uncomfortable housing; it can also be the past form of the rare verb “hovel.”","zh":"“hovelled”多用于形容与陋屋有关的人或地方（极其贫穷、狭小、简陋的居住环境）；也可作较少见动词“hovel”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Living in, made of, or resembling poor, small, uncomfortable huts (hovels); describing people or places associated with such housing.","zh":"（形容词）住在破棚屋/陋屋里的；由陋屋构成的；或像陋屋那样简陋、拥挤的（常用来形容贫困居住环境或相关的人群）。"},"examples":[{"en":"The writer described a hovelled village on the edge of the city.","zh":"作者描写了城郊一个由陋屋组成的村落。"},{"en":"In the novel, hovelled families struggled to survive the winter.","zh":"在小说里，住在陋屋里的家庭艰难地熬过冬天。"}]},{"partOfSpeech":"v.","definition":{"en":"(Verb, past tense/past participle of “hovel”) To put into a hovel or shelter in a poor, cramped place (rare).","zh":"（动词，hovel 的过去式/过去分词）把……安置在陋屋里；（使）栖身于狭小破旧之处（较少见）。"},"examples":[{"en":"They were hovelled in temporary shacks after the storm.","zh":"暴风雨后，他们被安置在临时棚屋里。"}]}],"synonyms":["slumlike","shack-like","squalid","impoverished","wretched"],"phonetic":"ˈhɑvəld","extraExplanation":["“hovelled”常见于文学或较正式的描写中，带有同情或批判意味，用来突出贫困、拥挤与居住条件恶劣。日常英语里更常说“people living in hovels / slums”或用“poor, cramped housing”来表达。"]}
{"word":"hoveller","summary":{"en":"A “hoveller” is someone who lives in a hovel—a very small, poor home.","zh":"“Hoveller”指住在破旧小屋（hovel）里的人，含贫困与阶层意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives in a hovel (a small, poor, roughly built home)","zh":"住在茅舍／破屋里的人；贫民"},"examples":[{"en":"In the old story, the hoveller survived the winter by sharing firewood with neighbors.","zh":"在那个老故事里，这位贫民靠和邻居分柴火熬过了冬天。"},{"en":"The novel contrasts the rich landowner with the hoveller at the edge of the village.","zh":"小说把富有的地主与村边的贫民作对比。"}]}],"synonyms":["hovel-dweller","pauper","poor person","slum dweller"],"phonetic":"/ˈhɑvələr/","extraExplanation":["“Hoveller”源自“hovel”（破旧的小屋、茅舍）。它带有明显的社会阶层与贫困色彩，常见于描写旧时代乡村贫穷、阶级差异的文学或历史语境中。","在现代英语里，这个词比较少用；更常见的表达是“a poor villager / a slum dweller / someone living in a shack”（视语境与地区而定）。使用时要注意语气可能显得冷硬或带评判色彩。"]}
{"word":"hovelling","summary":{"en":"“Hovelling” means living in a hovel or in very poor housing (verb/gerund use).","zh":"“hovelling”指住在陋屋/棚屋里或处于极其简陋的居住状态（多作动词-ing形式或动名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Living in a hovel (a very small, poor, dirty house) or staying in similarly poor conditions; the -ing form of the verb “to hovel.”","zh":"住在棚屋/陋屋里（很小、破旧、肮脏的住处），或以类似贫困简陋的方式栖身；动词 hovel 的 -ing 形式。"},"examples":[{"en":"After losing his job, he spent months hovelling in a leaking shack on the edge of town.","zh":"失业后，他在城郊一间漏雨的破棚屋里凑合住了好几个月。"},{"en":"The report described families hovelling in overcrowded rooms without heat.","zh":"报告描述了一些家庭挤在没有暖气的拥挤房间里，将就栖身。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or habit of living in very poor housing; a gerund use meaning “life in hovels.”","zh":"住在陋屋中的行为或习惯；作动名词用，意为“棚屋式的生活/住在破屋里的状态”。"},"examples":[{"en":"The charity’s goal is to end hovelling by providing safe, affordable homes.","zh":"该慈善机构的目标是通过提供安全、可负担的住房来终结“住破屋”的处境。"},{"en":"Hovelling is often linked to poverty and lack of basic services.","zh":"住在陋屋的现象常与贫困和基础服务匮乏有关。"}]}],"synonyms":["living in a shack","shacking up","roughing it","living in squalor"],"phonetic":"/ˈhɑvəlɪŋ/","extraExplanation":["“hovelling”在现代英语里并不常见；更常看到的是名词“hovel”（陋屋、棚屋）或形容词“hovel-like”（像棚屋一样破旧的）。","作为写作表达时，“hovelling”常带有强烈的社会批评色彩，用来强调居住条件的简陋与不体面。"]}
{"word":"hovels","summary":{"en":"“Hovels” means very small, poor, and badly built houses or shelters (plural of “hovel”).","zh":"“hovels”是“hovel”的复数，指非常简陋、贫穷、建得很差的房子或棚屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, poor, and often dirty or badly built house or shelter.","zh":"简陋的住所；破棚屋（通常又小又穷、肮脏或建得很差）。"},"examples":[{"en":"Many families were living in hovels without clean water.","zh":"许多家庭住在没有干净用水的破棚屋里。"},{"en":"The charity worked to replace unsafe hovels with proper housing.","zh":"该慈善机构致力于用合格住房替换不安全的破屋。"}]}],"synonyms":["shacks","shanties","huts","slums (area)"],"phonetic":"/ˈhɑvəlz/","extraExplanation":["“hovel”带有强烈的贬义和同情意味，常用于描述贫困、缺乏基本生活条件的居所；在报道贫民窟、社会不平等或历史上工人阶级生活时常见。","复数是“hovels”。与之相近但语气不同：shack（简陋小屋，语气可中性）、hut（小屋/棚屋，常中性）、slum（贫民窟，指地区而非单个房子）。"]}
{"word":"Hoven","summary":{"en":"“Hoven” is a literary/archaic word meaning “raised/heaved up” or “hovering/suspended,” related to the verb “heave.”","zh":"“Hoven”是文学/古语用法，意思多为“被抬高/被顶起”或“悬浮/盘旋”，与动词“heave（用力举起；翻涌）”有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary/archaic) Raised or lifted up; heaved upward.","zh":"（文学/古语）被举起的；被抬高的；被（用力）顶起的。"},"examples":[{"en":"A great rock lay hoven from the earth, as if a giant hand had pushed it up.","zh":"一块巨石像被巨人的手顶起似的，从地里凸起。"},{"en":"With the waves hoven high, the small boat looked even smaller.","zh":"浪头被顶得很高，小船看起来更渺小了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literary) Hanging or hovering in the air; suspended.","zh":"（文学）悬在空中的；盘旋的；悬浮的。"},"examples":[{"en":"Mist stood hoven over the lake at dawn.","zh":"黎明时分，薄雾悬在湖面上。"},{"en":"For a moment, a question seemed hoven between them, unspoken.","zh":"一时间，一个问题仿佛悬在两人之间，却无人开口。"}]},{"partOfSpeech":"other","definition":{"en":"(rare) Past participle form of “heave” (alongside “hove”); used mainly in older or poetic English.","zh":"（少见）动词 heave 的过去分词形式之一（也可用 hove）；多见于较旧或诗歌体英语。"},"examples":[{"en":"The anchor was hoven up before the ship set sail.","zh":"起航前，船锚被拉起。"}]}],"synonyms":["raised","lifted","heaved up","suspended","hovering"],"phonetic":"/ˈhoʊvən/","extraExplanation":["“Hoven”多出现在较老的英文或带诗意的描写里，现代日常英语更常用“raised / lifted / hovering”等词来表达。","它和动词“heave”（用力举起、抛起；海浪翻涌）有关：现代更常见的过去式/过去分词是“hove”，而“hoven”更偏方言或文学用法。","别与专有名词混淆：如人名/姓氏“Van Hoven”或地名中的“Hoven”，这些通常不读作词汇意义。"]}
{"word":"hoven","summary":{"en":"“Hoven” is an archaic form meaning “heaved/lifted,” and in nautical or literary use it can mean “appeared (in sight).”","zh":"“hoven”是较古老的形式，表示“被用力抬起/掀起”；在航海或文学语境中也可表示“（进入视野）显现出来”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Past participle of “heave”: lifted, raised, or thrown upward with effort.","zh":"（古语）“heave”的过去分词：被用力举起、抬起或向上抛起。"},"examples":[{"en":"The heavy chest was hoven onto the cart by two workers.","zh":"两个工人把沉重的箱子用力抬上了手推车。"},{"en":"A wave hoven by the storm crashed against the rocks.","zh":"被风暴掀起的巨浪拍打在岩石上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Nautical/literary) Used in phrases like “hoven in sight”: having come into view; appeared (especially of land or a ship).","zh":"（航海/文学）用于“hoven in sight”等表达：进入视野、显现出来（尤指陆地或船只）。"},"examples":[{"en":"At dawn, the island was hoven in sight.","zh":"黎明时分，那座岛进入了视野。"},{"en":"A sail was hoven on the horizon.","zh":"地平线上出现了一面帆。"}]}],"synonyms":["heaved","lifted","raised","hoisted","appeared","came into view"],"phonetic":"ˈhoʊvən","extraExplanation":["“hoven”在现代英语里很少单独使用，更多见于较老的文学或航海语境；现代更常用的是“heaved”或用动词短语“came into view / appeared”。","相关词形：heave（用力举起/投掷/（海浪）翻涌）→ hove（过去式，尤航海语境）→ hoven（较古老的过去分词/形容词用法）。"]}
{"word":"hovenia","summary":{"en":"Hovenia is a plant genus, especially known for Hovenia dulcis (the Japanese/Oriental raisin tree).","zh":"Hovenia 指一种树木的属名（枳椇属），尤其以枳椇 Hovenia dulcis（日本/东方葡萄干树）最有名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees in the buckthorn family (Rhamnaceae), best known for Hovenia dulcis, whose sweet, swollen flower stalks are sometimes eaten or used in traditional remedies","zh":"枳椇属（鼠李科）的一类树木属名；最常见的是枳椇（Hovenia dulcis），其甜味、膨大的花梗常被食用或用于传统用途"},"examples":[{"en":"Hovenia dulcis is sometimes called the Japanese raisin tree because the stalks taste sweet when dried.","zh":"枳椇（Hovenia dulcis）有时被叫作“日本葡萄干树”，因为它的花梗晒干后尝起来很甜。"},{"en":"The garden label listed the plant as Hovenia, but it didn’t specify the exact species.","zh":"花园的标签写着“枳椇属（Hovenia）”，但没有注明具体是哪一种。"}]}],"synonyms":["Japanese raisin tree","Oriental raisin tree","Hovenia dulcis"],"phonetic":"/hoʊˈviːniə/","extraExplanation":["“Hovenia”多见于植物学或园艺语境，日常英语里人们更常说具体物种名“hovenia dulcis”，或直接用俗名“Japanese raisin tree / Oriental raisin tree”。","词源上通常认为与欧洲人名有关（用来纪念某位名叫 Hoven 的人物），属于拉丁化的学名形式。"]}
{"word":"hover","summary":{"en":"Hover means to stay just above something (in the air), to linger nearby, or to remain around a level or decision.","zh":"Hover 指在空中/上方悬停或盘旋，也可指在旁边徘徊，或（数值、想法）在某一水平附近徘徊、摇摆。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to stay in one place in the air, or to move slowly just above something","zh":"（在空中）盘旋；悬停；（在某物上方）徘徊"},"examples":[{"en":"A helicopter hovered above the beach.","zh":"一架直升机在海滩上空盘旋。"},{"en":"Dragonflies hover over the water.","zh":"蜻蜓在水面上方悬停。"},{"en":"I hovered my hand over the button, not sure whether to press it.","zh":"我把手悬在按钮上方，犹豫要不要按下去。"}]},{"partOfSpeech":"vi.","definition":{"en":"to stay close to someone or something, often in an annoying or watchful way; to linger nearby","zh":"（常指令人不适地）在旁边徘徊、守着；紧跟不离"},"examples":[{"en":"The photographer hovered around the actors.","zh":"摄影师在演员周围转来转去。"},{"en":"My little brother kept hovering while I tried to study.","zh":"我学习时弟弟一直在旁边晃来晃去。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be uncertain, in-between two states, or close to a level (often with numbers, opinions, or decisions)","zh":"（在两种状态间）摇摆不定；（数值等）徘徊在…附近"},"examples":[{"en":"Unemployment is hovering around 5%.","zh":"失业率徘徊在5%左右。"},{"en":"Her opinion hovered between yes and no.","zh":"她的想法在“同意”和“不同意”之间摇摆。"}]}],"synonyms":["float","hang (in the air)","linger","loiter","circle","remain around"],"phonetic":"/ˈhʌvər/","extraExplanation":["“hover”最核心的画面感是“离地不远、停在空中/上方”，所以它既能描述直升机、昆虫，也常用于“手悬在按钮上方”这种动作。","在现代语境里常见搭配有：hover over（悬停在…上方；也可指威胁/危险“笼罩”）、hover around（在…附近徘徊；数值徘徊）。","计算机/手机界面中的“hover”指“鼠标悬停”（把鼠标指针停在某个元素上触发提示），中文常译为“悬停/鼠标移上”。"]}
{"word":"hover about","summary":{"en":"to linger nearby, often waiting or watching","zh":"在附近徘徊逗留（常在等待或观察）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to stay or move around a place without a clear purpose, often because you are waiting, watching, or feeling unsure","zh":"在某处附近徘徊、逗留（常因等待、观察或拿不定主意）"},"examples":[{"en":"He hovered about the doorway, unsure whether to come in.","zh":"他在门口徘徊，不确定要不要进来。"},{"en":"A few reporters hovered about the entrance, hoping for a comment.","zh":"几名记者在入口附近逗留，想等一句回应。"}]},{"partOfSpeech":"phrase","definition":{"en":"to remain close to someone, often in a slightly annoying or over-attentive way","zh":"围着某人转、紧跟在旁（常带一点烦人或过度关心的感觉）"},"examples":[{"en":"She hovered about her guests, offering snacks every few minutes.","zh":"她围着客人转，每隔几分钟就递点零食。"},{"en":"Stop hovering about me—I can do it myself.","zh":"别老在我旁边转——我自己能做。"}]}],"synonyms":["linger","loiter","hang around","hover around","mill about","wait around"],"phonetic":"/ˈhʌvɚ əˈbaʊt/","extraExplanation":["hover about 比 hover around 更偏英式一点；美式里也能用，但更常见的是 hover around。","语气上常暗示“没有明确目的、在等机会、或让人觉得有点碍事”。"],"etymology":"hover 来自中古英语，原义接近“停留、徘徊”，后来也常用于“（鸟/直升机）在空中盘旋”。about 表示“在……周围”。合起来就有“在附近徘徊/逗留”的意思。","mnemonic":["联想“hover=悬停/盘旋”，人“像直升机一样在周围转来转去”→ hover about=在附近徘徊。","about=“到处、周围”，把 hover 的“停留不走”范围扩到“周围一圈”。"]}
{"word":"hover around","summary":{"en":"to linger nearby or stay close to a level/value with small changes","zh":"在附近徘徊，或在某个数值/水平附近小幅波动"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to stay near a person or place without really joining in; to linger nearby","zh":"在某人或某地附近徘徊；不太参与地逗留在旁边"},"examples":[{"en":"Teenagers were hovering around the entrance, waiting for their friends.","zh":"青少年在入口附近徘徊，等朋友来。"},{"en":"I don’t like it when strangers hover around me on the subway.","zh":"我不喜欢陌生人在地铁里一直在我身边晃来晃去。"},{"en":"He hovered around the conversation but didn’t say much.","zh":"他在谈话旁边打转，但没怎么说话。"}]},{"partOfSpeech":"phrase","definition":{"en":"to remain close to a particular level, amount, or value; to fluctuate slightly around it","zh":"徘徊在某个数值/水平附近；在附近小幅波动"},"examples":[{"en":"Inflation has been hovering around 3% for months.","zh":"通货膨胀率几个月来一直徘徊在3%左右。"},{"en":"The temperature will hover around freezing tonight.","zh":"今晚气温会在冰点附近徘徊。"},{"en":"His test scores hover around average.","zh":"他的考试成绩一直在平均水平附近。"}]}],"synonyms":["hang around","linger","loiter","mill around","stay near","circle","remain near","fluctuate around","hover near","stay around"],"phonetic":"/ˈhʌvɚ əˈraʊnd/","extraExplanation":["常见语气：用于人时有时带一点“在旁边盯着/碍事”的感觉（比如店员一直跟着你），用于数据时则偏中性，等于“在……左右”。","搭配小提示：hover around + 人/地点/话题（徘徊在附近）；hover around + 数字/百分比/温度（在数值附近波动）。"],"etymology":"“hover”源自古英语/古北欧语系词，原意有“漂浮、盘旋、徘徊不定”；加上“around”后，强调“在周围附近徘徊/围着某个点上下波动”的感觉。","mnemonic":["把 hover 想成“像直升机在空中盘旋”，around 就是“围着……转”，合起来就是“围着……盘旋/徘徊”。","联想中文“徘徊在……左右”：hover around ≈ 徘徊 around（左右）。"]}
{"word":"hover over ...","summary":{"en":"stay above something, especially in midair; or (on screens) place the mouse pointer over an item without clicking","zh":"在某物上方停留/盘旋；或（屏幕上）鼠标移到某项上方但不点击"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(of a bird, aircraft, or person) to stay in one place in the air or just above something; to move slowly and remain close above","zh":"（鸟、飞行器或人）在空中或某物上方停留不动/盘旋；在上方缓慢移动并保持靠近"},"examples":[{"en":"A hawk hovered over the field, looking for prey.","zh":"一只鹰在田野上空盘旋，寻找猎物。"},{"en":"The helicopter hovered over the sea during the rescue.","zh":"救援时直升机在海面上方悬停。"}]},{"partOfSpeech":"phrase","definition":{"en":"(computing) to move the mouse pointer over an item on a screen without clicking, often to show more information or activate a menu","zh":"（计算机）将鼠标指针移到屏幕上的某个项目上方但不点击，通常会显示更多信息或触发菜单"},"examples":[{"en":"Hover over the icon to see its name.","zh":"把鼠标移到图标上方，就能看到它的名称。"},{"en":"When you hover over the link, it changes color.","zh":"当你把鼠标移到链接上方时，它会变色。"},{"en":"Hover over the chart to view the exact values.","zh":"把鼠标移到图表上方以查看精确数值。"}]}],"synonyms":["hover","hang over","float above","linger over","mouse over","roll over"],"phonetic":"/ˈhʌvər ˈoʊvər/","extraExplanation":["在软件/网页说明里，hover（悬停）通常指“鼠标经过但不点击”。手机触屏通常没有真正的hover，有些应用会用“长按”或“轻点”来替代悬停效果。"],"etymology":"“hover”源自中古英语，原意有“徘徊、停留不定、盘旋”的感觉；“over”来自古英语，表示“在……之上”。合在一起就是“在……上方停留/盘旋”。计算机里的用法是把“在上方停留”借用到鼠标指针停在某个元素上。","mnemonic":["联想“直升机hover（悬停）在你头上over（在上方）”。","把它记成“鼠标悬停在……上方”：hover=悬停，over=上方。"]}
{"word":"hoverboard","summary":{"en":"A hoverboard is a two-wheeled self-balancing ride that you control by leaning.","zh":"hoverboard 指两轮自平衡电动代步板，靠身体前后倾来控制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a self-balancing board with two wheels that you stand on and control by shifting your weight (often used for short rides on smooth ground).","zh":"一种带两轮的自平衡代步板；人站在板上，通过身体重心变化来控制方向与速度（常用于平坦路面短途代步）。"},"examples":[{"en":"He learned to ride a hoverboard in a few minutes, but he still wore a helmet.","zh":"他几分钟就学会了骑悬浮滑板，但还是戴了头盔。"},{"en":"Many schools don’t allow hoverboards because they can be dangerous indoors.","zh":"很多学校不允许带悬浮滑板，因为在室内可能有危险。"},{"en":"She uses her hoverboard to get from the dorm to the library.","zh":"她用悬浮滑板从宿舍到图书馆。"}]}],"synonyms":["self-balancing scooter","smart balance wheel"],"phonetic":"/ˈhʌvɚˌbɔrd/","extraExplanation":["“hoverboard”一词因电影《回到未来2》（Back to the Future Part II, 1989）而流行：片中的“hoverboard”是真正“悬浮”在空中的滑板（科幻设定）。现实生活里常见的hoverboard并不会悬浮，而是两轮自平衡电动板，因此有时也被称为“self-balancing scooter”。","使用相关提醒：早期产品曾因电池/充电安全问题引发关注；购买时可留意是否通过安全认证（如UL认证），并避免在湿滑路面、车流密集处或室内拥挤区域使用。"]}
{"word":"hovercar","summary":{"en":"A hovercar is a usually fictional car that floats above the ground instead of driving on the road.","zh":"hovercar 指一种多为科幻设定的“悬浮汽车”，能离地漂浮行驶而不接触路面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (usually fictional) car-like vehicle that can float above the ground and move without touching the road, often imagined to use anti-gravity or strong air/jet lift","zh":"（多为科幻作品中的）悬浮车；一种像汽车但能离地漂浮、无需接触路面行驶的交通工具，常被设想靠反重力或强气流/喷射升力实现"},"examples":[{"en":"In the movie, the hero escapes in a hovercar that glides over traffic.","zh":"在电影里，主角开着一辆悬浮车从车流上方滑行逃走。"},{"en":"Scientists haven’t built a true hovercar yet, but some prototypes can hover briefly using fans.","zh":"科学家还没造出真正的悬浮车，但有些原型车能靠风扇短暂悬浮。"},{"en":"Kids often draw hovercars when imagining the city of the future.","zh":"孩子们想象未来城市时常常会画悬浮车。"}]}],"synonyms":["flying car","hover vehicle","air car (less common)"],"phonetic":"/ˈhʌvərˌkɑr/","extraExplanation":["“hovercar”通常出现在科幻语境里（如未来城市、太空港等），比日常英语更偏“想象中的交通工具”。","词由“hover（悬停）+ car（汽车）”构成。常见相关表达有：hover vehicle（悬浮载具）、flying car（飞行汽车，强调能飞行而不只是离地悬浮）。"]}
{"word":"hovercraft","summary":{"en":"A hovercraft is a vehicle that floats on air and can travel over both water and land.","zh":"hovercraft 指“气垫船/气垫车”，靠空气垫悬浮，可在水面和陆地上行驶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A vehicle that travels over land or water by floating on a cushion of air (air-cushion vehicle).","zh":"一种依靠空气垫悬浮在地面或水面上行驶的交通工具（气垫船/气垫车）。"},"examples":[{"en":"We crossed the river by hovercraft in less than ten minutes.","zh":"我们坐气垫船过河，不到十分钟就到了。"},{"en":"The rescue team used a hovercraft to reach people in the flooded streets.","zh":"救援队用气垫船到达被洪水淹没的街道去救人。"}]}],"synonyms":["air-cushion vehicle","ACV"],"phonetic":"/ˈhʌvərˌkræft/","extraExplanation":["词源小知识：hovercraft 由 hover（盘旋/悬停）+ craft（船只/飞行器等“交通工具”）组成，字面意思是“会悬浮的交通工具”。","常见搭配：by hovercraft（乘气垫船）、hovercraft ride（气垫船体验）、hovercraft rescue（气垫船救援）。","文化/应用场景：在沼泽、浅水、冰面或洪水地区，气垫船因能“跨地形”而常用于救援与巡逻；也曾用于英国多佛—加来之间的跨海客运（20世纪后期较有名）。"]}
{"word":"hovercrafts","summary":{"en":"Hovercrafts are vehicles that move over land or water on a cushion of air.","zh":"hovercrafts 指“气垫船”，靠空气垫能在水面或陆地上行驶的交通工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A vehicle that travels over land or water by riding on a cushion of air, usually produced by fans.","zh":"气垫船：一种利用风扇等装置产生空气垫，从而能在水面或陆地上滑行的交通工具。"},"examples":[{"en":"We crossed the river in a hovercraft.","zh":"我们坐气垫船过了河。"},{"en":"Hovercrafts can travel over mud, sand, and shallow water.","zh":"气垫船可以在泥地、沙地和浅水上行驶。"}]}],"synonyms":["air-cushion vehicle","ACV"],"phonetic":"/ˈhʌvərˌkræfts/","extraExplanation":["“hovercraft”是可数名词；复数形式是“hovercraft”或“hovercrafts”，两种都正确，但“hovercrafts”在日常写作中更常见。","词源提示：hover（悬停）+ craft（交通工具/船只），字面意思是“会悬停的交通工具”，帮助记忆它“靠空气垫托起”的原理。"]}
{"word":"hovered","summary":{"en":"**Hovered** most commonly means “stayed floating or lingered nearby,” and in computing it means “with the mouse pointer resting over an on-screen item.”","zh":"**Hovered** 最常见是“盘旋/徘徊在附近”，在电脑语境中指“鼠标悬停在某个元素上方”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of **hover**: stayed in the air or near something without moving far away; lingered nearby (often as if waiting or watching).","zh":"**hover（盘旋/徘徊）** 的过去式/过去分词：在空中或某物附近停留、盘旋；（常指像在等待或注视一样）徘徊在旁。"},"examples":[{"en":"A hawk hovered above the field, looking for prey.","zh":"一只鹰在田野上方盘旋，寻找猎物。"},{"en":"She hovered near the door, unsure whether to leave.","zh":"她在门口徘徊，不确定是否要离开。"},{"en":"The cursor hovered over the button, ready to click.","zh":"光标停在按钮上方，随时准备点击。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj., in computing/UI) with a pointer positioned over something on a screen, often triggering a small effect or message (a “hover state”).","zh":"（形容词，常见于电脑/界面）指鼠标指针停在某个元素上方的状态，常会触发提示或视觉变化（“悬停状态”）。"},"examples":[{"en":"The hovered menu item turns blue.","zh":"被悬停的菜单项会变成蓝色。"}]}],"synonyms":["lingered","hung around","floated","paused","remained"],"phonetic":"/ˈhʌvərd/","extraExplanation":["在日常英语里，**hover** 常带有“靠得很近、像在等什么”的感觉：比如 *hover near the phone / hover around someone*，可能暗示紧张、犹豫，或有点“盯着/黏着”。","在科技语境中，**hovered** 多与鼠标相关：*hover over*（把鼠标移到……上方但不点击），常会出现 *tooltip*（提示框）或按钮变色。"]}
{"word":"hoverer","summary":{"en":"A hoverer is someone or something that hovers in the air or lingers nearby; informally, it can mean a person who stays close in an intrusive, watchful way.","zh":"hoverer 指在空中悬停或在附近徘徊的人/物；非正式用法也可指爱贴近别人、带点“盯着不放”感觉的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that hovers (stays in one place in the air, or lingers nearby without moving away).","zh":"盘旋者；徘徊者；（在空中）悬停的物体或（在附近）逗留不走的人。"},"examples":[{"en":"A hoverer stayed near the doorway, listening to the conversation.","zh":"有个人一直在门口徘徊，偷听谈话。"},{"en":"The drone is a steady hoverer, holding its position even in light wind.","zh":"这架无人机很稳定，微风中也能保持悬停。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Someone who remains close to another person, often in a watchful or intrusive way.","zh":"（非正式）老在别人身边转的人；（带贬义）盯梢般跟着的人。"},"examples":[{"en":"He’s a hoverer—he stands behind you while you work and asks too many questions.","zh":"他就是那种“爱盯着你干活”的人，总站在你身后问个不停。"},{"en":"Parents don’t want to be hoverers, but they still worry.","zh":"父母不想当“过度紧盯的那种人”，但还是会担心。"}]}],"synonyms":["loiterer","linger-er","onlooker","lurker","hanger-on"],"phonetic":"/ˈhʌvərər/","extraExplanation":["“hoverer”由动词“hover（盘旋；悬停；徘徊）+ 后缀“-er（表示人或物）”构成，意思就是“做 hover 这件事的人/东西”。","在描述人时，语气常带一点负面，类似“总在旁边盯着、不过界但让人不自在”的感觉；与“helicopter parent（直升机父母）”的概念有重叠，但“hoverer”更泛，用于任何爱在旁边“守着/盯着”的人。"]}
{"word":"hoverers","summary":{"en":"“Hoverers” means people or things that hover nearby; it can also mean users who hover a mouse over items on a screen.","zh":"“hoverers”指在附近徘徊/盘旋的人或物；也可指在界面上用鼠标悬停来查看信息的用户。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that hover (stay near or above a place, often without moving far), especially in a way that feels watchful, hesitant, or annoying.","zh":"徘徊者；盘旋者；（人或物）在某处附近或上方逗留/盘旋，常带有观察、犹豫或让人不舒服的感觉。"},"examples":[{"en":"There were a few hoverers near the doorway, waiting to see if the shop would open.","zh":"门口有几个人在徘徊，等着看店会不会开门。"},{"en":"Online, hoverers read the posts but rarely comment.","zh":"在网上，有些人只是“潜水”围观，很少留言。"}]},{"partOfSpeech":"n.","definition":{"en":"People who move a computer mouse over something on a screen (for example, to see a tip, preview, or menu).","zh":"（电脑操作）把鼠标指针悬停在屏幕某处的人（例如为了查看提示、预览或菜单）。"},"examples":[{"en":"Hoverers can see more options by pausing on the icon.","zh":"把鼠标悬停在图标上的用户可以看到更多选项。"},{"en":"The site is confusing for hoverers on a phone, because there is no mouse.","zh":"这个网站对手机用户不友好，因为手机上没有鼠标“悬停”。"}]}],"synonyms":["onlookers","lingering people","bystanders","watchers","lurkers"],"phonetic":"/ˈhʌvərərz/","extraExplanation":["“hoverers”是名词复数，单数是“hoverer”（指“在附近徘徊/盘旋的人或物”）。在日常英语里更常见的表达是“people who hover”或直接用动词“hover”。","在数字产品/界面语境中，“hover”特指“鼠标悬停（不点击）”，因此“hoverers”也可指习惯用鼠标悬停来获取信息的用户。"]}
{"word":"hoverfly","summary":{"en":"A hoverfly is a harmless fly that can look like a bee/wasp and often hovers around flowers.","zh":"hoverfly 指一种无害的苍蝇类昆虫，常像蜂/黄蜂并在花边悬停。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fly (insect) that often looks like a bee or wasp but cannot sting; it commonly hovers around flowers and helps with pollination.","zh":"一种常看起来像蜜蜂或黄蜂、但不会蜇人的苍蝇类昆虫；常在花朵附近悬停，也能帮助传粉。"},"examples":[{"en":"A hoverfly hovered over the lavender, sipping nectar.","zh":"一只食蚜蝇在薰衣草上方悬停，吸食花蜜。"},{"en":"Don’t worry—it’s a hoverfly, not a wasp.","zh":"别担心——那是食蚜蝇，不是黄蜂。"}]}],"synonyms":["syrphid fly","flower fly"],"phonetic":"/ˈhʌvərˌflaɪ/","extraExplanation":["“hoverfly”常指食蚜蝇科（Syrphidae）的昆虫。它们常用“拟态”让自己看起来像会蜇人的蜂或黄蜂，以吓退天敌，但本身通常无害。","在园艺语境中，hoverflies 常被视为“益虫”：成虫取食花蜜并传粉，许多种类的幼虫会捕食蚜虫等害虫。"]}
{"word":"hovering","summary":{"en":"Hovering means staying in the air or above something without moving far, or lingering (even figuratively); in tech it means keeping the cursor over something without clicking.","zh":"Hovering 指在空中（或上方）悬停/盘旋，也可指徘徊或某种感觉挥之不去；在科技语境中指鼠标光标悬停但不点击。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"staying in the air in one place, or moving slowly above something (often with wings or a machine); also used figuratively for being present but not fully acting","zh":"（在空中）盘旋、悬停；也可引申为（某事）挥之不去、若隐若现地存在"},"examples":[{"en":"A helicopter was hovering over the beach.","zh":"一架直升机在海滩上空盘旋。"},{"en":"A hawk hovered above the field, looking for prey.","zh":"一只鹰在田野上空盘旋，寻找猎物。"},{"en":"A sense of worry was hovering in the back of my mind.","zh":"一种担忧感一直在我心里挥之不去。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of moving a mouse cursor over something on a screen without clicking (common in technology contexts)","zh":"（鼠标）悬停：把光标移到屏幕上的某处但不点击（常见于科技语境）"},"examples":[{"en":"Try hovering over the icon to see a tooltip.","zh":"把鼠标悬停在图标上试试，会出现提示信息。"}]},{"partOfSpeech":"v.","definition":{"en":"lingering nearby; not fully leaving or committing (less common, often about people)","zh":"徘徊在附近；不离开也不明确行动（较少见，常用于描述人）"},"examples":[{"en":"He kept hovering near the doorway, unsure whether to come in.","zh":"他一直在门口徘徊，不确定要不要进来。"}]}],"synonyms":["float","hang (in the air)","circle","linger","loiter"],"phonetic":"/ˈhʌvərɪŋ/","extraExplanation":["“hovering”通常是动词 hover 的现在分词/动名词形式。描述真实场景时常与 over / above 连用（hover over/above）。","比喻用法里，“hovering”常表达一种情绪或威胁“萦绕不去”，语气比“thinking about”更有压迫感或持续感。","在电脑/手机界面中，hover 是非常常见的术语，指“光标悬停触发信息/效果”，不等于 click（点击）。"]}
{"word":"hoveringly","summary":{"en":"Hoveringly means “in a hovering or lingering way,” either literally (staying above/near) or figuratively (hesitant, watchful, or not fully resolved).","zh":"hoveringly 表示“盘旋/徘徊地”，既可指字面在上方或附近停留，也可指比喻意义上的犹豫、观望或悬而未决。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hovering way; staying near, above, or around something without settling or fully leaving.","zh":"以盘旋/徘徊的方式；在某物附近、上方或周围停留，但不真正停下或离开。"},"examples":[{"en":"A helicopter moved hoveringly above the rescue site.","zh":"一架直升机在救援地点上空盘旋着。"},{"en":"She stood hoveringly by the doorway, unsure whether to come in.","zh":"她在门口徘徊着，不确定要不要进来。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a hesitant or watchful way, as if waiting to act or decide.","zh":"以犹豫或警惕的方式；像是在等待行动或做决定。"},"examples":[{"en":"He spoke hoveringly, testing the room’s reaction before continuing.","zh":"他说得有些犹豫，先试探大家的反应再继续。"},{"en":"The topic hung hoveringly between them during dinner.","zh":"那件事在晚餐时像阴影一样悬在两人之间。"}]}],"synonyms":["lingeringly","hesitantly","uncertainly","watchfully","suspensively"],"phonetic":"/ˈhʌvərɪŋli/","extraExplanation":["“hoveringly”来自动词“hover”（盘旋、徘徊）。它在现代英语中相对少见，更常见的表达是用“hovering”作形容词/现在分词（例如：a hovering helicopter; a hovering doubt），或用短语“in a hovering way”。","除了字面“在空中盘旋”，它也常用作比喻：表示“某种情绪、话题、威胁、疑虑”久久不散（像悬着一样）。"]}
{"word":"hoverly","summary":{"en":"“Hoverly” is a very rare/nonstandard word meaning “in a hovering way” or “hovering/lingering.” It may also be a misspelling of “overly.”","zh":"“hoverly”非常少见/非标准，通常表示“以盘旋/悬停的方式”或“盘旋/逗留的”。也可能是把“overly（过度地）”拼错了。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hovering way; staying in one place in the air or moving slowly above something. (Very rare/nonstandard.)","zh":"以盘旋/悬停的方式；在某物上方停留或缓慢移动。（非常少见/非标准用法。）"},"examples":[{"en":"A hawk circled hoverly above the field.","zh":"一只鹰在田野上空盘旋。"},{"en":"The drone remained hoverly over the landing pad.","zh":"无人机在降落垫上方悬停。"}]},{"partOfSpeech":"adj.","definition":{"en":"Hovering or inclined to hover; lingering nearby instead of leaving. (Very rare/nonstandard.)","zh":"盘旋的；爱徘徊不走的、在附近逗留的。（非常少见/非标准用法。）"},"examples":[{"en":"She gave him a hoverly look, as if waiting for an answer.","zh":"她用一种“欲言又止、等回答”的眼神看着他。"}]}],"synonyms":["hovering","lingering","circling","loitering (nearby)","in a hovering way"],"phonetic":"/ˈhʌvərli/","extraExplanation":["“hoverly”在现代英语里几乎不作为常用词出现，很多情况下可能是拼写错误或自造词。常见表达通常用：\n- 副词：hovering / while hovering / in a hovering way\n- 形容词：hovering, lingering, watchful（视语境而定）","如果你想表达“过度地/太……”（常见搭配如 overly sensitive），你要找的很可能是“overly”（/ˈoʊvərli/），而不是“hoverly”。可以告诉我你的原句，我能帮你判断最合适的词。"]}
{"word":"hoverport","summary":{"en":"A docking/terminal area for hovercraft or hovering vehicles, especially in sci‑fi or future-transport contexts.","zh":"供气垫船或悬浮交通工具停靠与运营的港口/站点（多见于科幻或未来交通语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place where hovercraft or other hovering vehicles (real or imagined) can dock, load/unload, or take off and land.","zh":"（真实或科幻设定中）供气垫船或其他悬浮交通工具停靠、装卸、起降的场所；悬浮港/气垫港。"},"examples":[{"en":"The hovercraft arrived at the hoverport just before sunset.","zh":"气垫船在日落前抵达了气垫港。"},{"en":"In the novel, the city built a new hoverport above the river.","zh":"在小说里，这座城市在河上方建了一座新的悬浮港。"},{"en":"Please proceed to Gate 3 for boarding at the hoverport.","zh":"请前往3号登机口在悬浮港登乘。"}]}],"synonyms":["hovercraft terminal","hovercraft port","vertiport (similar concept)"],"phonetic":"/ˈhʌvərpɔrt/","extraExplanation":["“hoverport”通常是由 hover（悬停/悬浮）+ port（港口/口岸）构成的合成词，现实语境中较少见，更常见于科幻作品或未来交通设定。","在现实航空领域，更常用的近似词是“vertiport”（垂直起降机场，常用于直升机或eVTOL概念）。如果指气垫船的站点，也可用“hovercraft terminal/hovercraft port”。"]}
{"word":"hovers","summary":{"en":"“hovers” means “stays suspended or close by,” often used for flying objects, lingering people, or feelings that seem to hang over a situation.","zh":"“hovers”表示“悬停/盘旋”或“在附近徘徊”，也可比喻情绪或氛围“笼罩、萦绕”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a person, animal, or object) to stay in the air or near a place without moving far away; to float or remain suspended.","zh":"（人、动物或物体）在空中或某处附近停留不远；盘旋、悬停。"},"examples":[{"en":"A helicopter hovers above the river.","zh":"一架直升机在河面上方盘旋。"},{"en":"A bee hovers over the flowers.","zh":"一只蜜蜂在花朵上方盘旋。"}]},{"partOfSpeech":"vi.","definition":{"en":"to stay close to someone/something, often because you are waiting, watching, or feeling unsure; to linger.","zh":"（常因等待、观察或不确定而）在某人/某物附近徘徊；逗留。"},"examples":[{"en":"He hovers near the door, unsure whether to come in.","zh":"他在门口附近徘徊，不确定要不要进来。"},{"en":"Parents sometimes hover around their kids at the playground.","zh":"父母有时会在游乐场孩子身边转来转去。"}]},{"partOfSpeech":"vi.","definition":{"en":"to remain in someone’s mind or in a situation like a persistent presence (often used with “over”).","zh":"（常与 over 连用）如同阴影般挥之不去；萦绕在心头/笼罩。"},"examples":[{"en":"A sense of fear hovers over the town.","zh":"一种恐惧感笼罩着小镇。"},{"en":"That question still hovers in my mind.","zh":"那个问题仍在我脑海里挥之不去。"}]},{"partOfSpeech":"vi.","definition":{"en":"(technology) to place a cursor over something on a screen without clicking (often used with “over”).","zh":"（科技）将鼠标指针悬停在屏幕某处（但不点击，常与 over 连用）。"},"examples":[{"en":"If your cursor hovers over the icon, a tip appears.","zh":"如果鼠标悬停在图标上，会出现提示信息。"}]}],"synonyms":["floats","hangs","lingers","loiters","circles"],"phonetic":"/ˈhʌvərz/","extraExplanation":["“hovers” 是动词 hover 的第三人称单数现在时（he/she/it hovers）。例如：“The drone hovers.”（无人机在悬停。）","常见搭配：hover over（在……上方盘旋/笼罩/把鼠标悬停在……上）；hover around/near（在……附近徘徊）。","在日常表达里，hover 既可写实（直升机悬停），也常用作比喻（危险/担忧“笼罩”）。"]}
{"word":"hovertrain","summary":{"en":"A hovertrain is an air-cushion vehicle that floats just above a track to travel at high speed.","zh":"hovertrain 指依靠空气垫在轨道上方悬浮行驶的高速交通工具（气垫列车）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-speed passenger vehicle that travels just above a guideway on a cushion of air (air-cushion vehicle), reducing friction.","zh":"一种高速客运交通工具，依靠空气垫悬浮在轨道/导轨上方行驶，以减少摩擦。"},"examples":[{"en":"The hovertrain was designed to reduce friction by floating on a cushion of air.","zh":"气垫列车的设计目的是通过空气垫悬浮来减少摩擦。"},{"en":"In the 1960s and 1970s, engineers tested hovertrain prototypes for fast intercity travel.","zh":"在20世纪60到70年代，工程师测试过用于城市间高速出行的气垫列车原型。"}]}],"synonyms":["air-cushion train","air-cushion vehicle (ACV)","tracked hovercraft"],"phonetic":"/ˈhʌvərˌtreɪn/","extraExplanation":["“Hovertrain”多用于历史与工程语境：它指一种曾被认真研发的“气垫悬浮列车”概念/原型系统（类似气垫船的悬浮原理，但在专用导轨上运行）。不少项目后来被更成熟的高速铁路或磁悬浮（maglev）路线取代，因此在现实生活中你更常看到“high-speed rail / bullet train / maglev”等说法。","拼写上通常写作一个词“hovertrain”，也可见到“hover train”。词源上由“hover（悬停）+ train（列车）”组合而来，含义直观。"]}
{"word":"Hovis","summary":{"en":"Hovis is a well-known British bread brand, especially associated with wholemeal loaves.","zh":"Hovis 是英國知名的麵包品牌，特別與全麥麵包密切相關。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a popular British brand of bread, especially known for wholemeal (whole-wheat) loaves","zh":"（英國）霍維斯（Hovis），一個很知名的麵包品牌，特別以全麥麵包聞名"},"examples":[{"en":"I bought a loaf of Hovis wholemeal for sandwiches.","zh":"我買了一條 Hovis 全麥吐司來做三明治。"},{"en":"In the UK, Hovis is a common choice for everyday toast.","zh":"在英國，Hovis 是很多人日常烤吐司的常見選擇。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe bread made by or similar to the Hovis brand","zh":"（作修飾語）指「Hovis 的」或「類似 Hovis 風格的」麵包"},"examples":[{"en":"Could you pick up some Hovis bread on your way home?","zh":"你回家路上可以買點 Hovis 麵包嗎？"},{"en":"They served Hovis-style wholemeal rolls with soup.","zh":"他們用類似 Hovis 風格的全麥小餐包配湯。"}]}],"phonetic":"ˈhoʊvɪs","extraExplanation":["Hovis 是英國非常有代表性的麵包品牌之一，常讓人聯想到「日常、家常、可靠」的英式吐司與三明治文化。","名稱 Hovis 來自拉丁文片語「hominis vis」（大意是「人的力量／人的活力」），用來傳達營養與體力的概念。","Hovis 也因經典廣告而出名，例如 1970 年代的「Boy on the Bike（騎腳踏車的男孩）」廣告，常被視為英國廣告史上的名作。"]}

