{"word":"Hox","summary":{"en":"genes that guide embryonic body-pattern development","zh":"指导胚胎身体结构布局发育的一类基因"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of genes (homeobox genes) that control the body plan of an embryo—helping decide where major structures (like head, thorax, limbs) form along the head-to-tail axis","zh":"一类基因（同源盒基因家族），在胚胎发育中负责“身体蓝图”的制定，决定从头到尾不同部位应长出哪些主要结构（如头、躯干、四肢）"},"examples":[{"en":"Hox genes help determine where legs and other body parts develop during embryonic growth.","zh":"Hox 基因帮助决定胚胎发育过程中腿等身体部位在什么位置形成。"},{"en":"Mutations in Hox genes can lead to major changes in body structure.","zh":"Hox 基因发生突变可能导致身体结构出现显著变化。"},{"en":"In biology class, we learned that Hox gene order often matches expression from head to tail.","zh":"在生物课上我们学到：Hox 基因在染色体上的排列顺序常常对应其从头到尾的表达顺序。"}]}],"synonyms":["homeobox gene","homeotic gene","developmental gene"],"phonetic":"/hɑks/","extraExplanation":["Hox 基因在很多动物中都高度保守（从昆虫到哺乳动物），常被用来说明“共同祖先”与“发育机制的相似性”。","常见特点：Hox 基因在染色体上常成簇排列；其排列顺序与在胚胎中从前到后（头→尾）的表达区域往往有关，这种现象常被称为“共线性（collinearity）”。"],"etymology":"源自“homeobox（同源盒）/homeotic（同源异型）”相关研究中的命名；Hox 常用来指“homeobox genes（同源盒基因）”这一类控制体节与身体布局的基因。最早在果蝇等模式生物的发育遗传学研究中系统化。","mnemonic":["把 Hox 联想成“how（怎么）+ axis（轴线）”：它决定身体沿着头尾轴线“怎么长、长在哪”。","记成“盒子（box）里的指令”：Hox 属于 homeobox 基因，像放在“盒子”里的发育说明书。"]}
{"word":"hox","summary":{"en":"“hox” usually refers to HOX genes in biology; in everyday writing it may be a misspelling of “hoax.”","zh":"“hox”通常指生物学中的HOX基因；在日常书写中也可能是把“hoax（骗局/恶作剧）”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of genes (HOX genes) that help control an organism’s body plan during early development (for example, where the head, chest, and limbs form)","zh":"（生物学）HOX基因：一组在胚胎早期发育中帮助“规划身体结构”的基因（例如决定头部、躯干、四肢在什么位置形成）"},"examples":[{"en":"HOX genes help tell cells where they are along the body from head to tail.","zh":"HOX基因帮助细胞“知道”自己位于身体从头到尾的哪个位置。"},{"en":"Scientists study HOX gene changes to understand how different animals evolved body shapes.","zh":"科学家研究HOX基因的变化，以理解不同动物的身体形态如何演化。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation written as “HOX” (used in biology and sometimes in names/titles); in everyday English, people may also type “hox” by mistake when they mean “hoax”","zh":"“HOX”的缩写写法（常见于生物学或某些名称/标题中）；日常英语里也有人把“hoax（骗局/恶作剧）”误打成“hox”"},"examples":[{"en":"The paper discusses HOX expression in the developing embryo.","zh":"这篇论文讨论了胚胎发育过程中HOX基因的表达。"},{"en":"Did you mean “hoax” instead of “hox”?","zh":"你想写的是“hoax”而不是“hox”吗？"}]}],"synonyms":["HOX gene","homeobox gene"],"phonetic":"/hɑks/","extraExplanation":["HOX基因名称来自“homeobox”。它们常被称为“主控/调控”发育的基因之一，因为它们会开启或关闭许多其他基因，影响身体各部分的形成顺序与位置。","日常语境里“hox”本身并不是常用词；如果你是在聊天、新闻或社交媒体里看到它，很可能是专有名词（如基因）或把“hoax（骗局、恶作剧）”拼错了。"]}

