{"word":"hoy","summary":{"en":"“Hoy” is Spanish for “today.”","zh":"“hoy” 是西班牙语，意思是“今天”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Spanish) today; on this day.","zh":"（西班牙语）今天；在今天这一天。"},"examples":[{"en":"Hoy hace mucho frío.","zh":"今天很冷。"},{"en":"¿Vienes hoy o mañana?","zh":"你今天来还是明天来？"},{"en":"Hoy no tengo tiempo.","zh":"我今天没时间。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, Spanish) the present time; “today” as a noun idea.","zh":"（较少见，西班牙语）当下；“今日/今天”作为名词概念。"},"examples":[{"en":"Tenemos que vivir el hoy.","zh":"我们要活在当下。"},{"en":"El hoy es distinto al ayer.","zh":"今天（当下）不同于昨天。"}]}],"synonyms":["today","nowadays (in “hoy en día”)"],"phonetic":"/ɔɪ/","extraExplanation":["在西班牙语里，hoy 常和时间副词一起搭配：hoy mismo（就在今天/今天就）、hoy en día（如今/现在）、de hoy（今天的）。","发音上，hoy 的开头像英语 boy 里的 “oy” 音，整体接近 /ɔɪ/。"]}
{"word":"Hoya","summary":{"en":"a wax plant (genus Hoya); also a Georgetown University student/athlete.","zh":"球兰（蜡兰）一类的观赏植物；也指乔治城大学的学生/校队成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical climbing plant in the genus Hoya, often grown as a houseplant for its thick, waxy leaves and star-shaped, fragrant flowers (also called “wax plant”).","zh":"球兰属的热带藤本植物，常作室内观叶/观花植物，叶片厚而有蜡质感，花呈星形且常带香味（也常叫“蜡兰/蜡花”）。"},"examples":[{"en":"She grows a hoya on a sunny windowsill, and it blooms in summer.","zh":"她在朝阳的窗台上养了一盆球兰，夏天会开花。"},{"en":"This hoya has waxy leaves and clusters of sweet-smelling flowers.","zh":"这株球兰叶子有蜡质感，开花时会成簇而且很香。"}]},{"partOfSpeech":"n.","definition":{"en":"a student or athlete from Georgetown University (from the school cheer “Hoya Saxa”).","zh":"乔治城大学的学生或运动员（源自校呼“Hoyasaxa”）。"},"examples":[{"en":"He’s a Hoya who studied international relations at Georgetown.","zh":"他是乔治城大学的学生，学的是国际关系。"},{"en":"The Hoyas won the game last night.","zh":"乔治城大学队昨晚赢了比赛。"}]}],"synonyms":["wax plant","porcelainflower","Georgetown student","Georgetown athlete","Hoya Saxa"],"phonetic":"/ˈhɔɪ.ə/","extraExplanation":["植物语境里，hoya 通常特指“球兰属”观赏植物（常见如 Hoya carnosa），英文里也常用俗名 wax plant。","在美国校园文化里，Georgetown 的队名是 Hoyas；新闻或体育报道中出现 Hoya 往往指乔治城大学相关人或队伍。"],"etymology":"作为植物名：来自植物学命名，Hoya 为纪念18世纪英国园艺师 Thomas Hoy。作为乔治城大学称呼：来自校呼 “Hoya Saxa”（大致意为“这些岩石/这块岩石”），后来 “Hoya” 成为校友与校队的昵称。","mnemonic":["联想“HOY-a”≈“花呀”：球兰以“花”出名，开花像一串小星星。","看到大学语境（Georgetown、Hoyas、Saxa、NCAA）时，把 Hoya 直接记成“乔治城的人/队”。"]}
{"word":"hoya","summary":{"en":"“Hoya” is a tropical climbing houseplant (wax plant) known for waxy leaves and fragrant, star-shaped flowers.","zh":"hoya 指球兰（蜡兰）等热带藤本植物，以蜡质叶片和芳香星形花著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tropical climbing plant with thick, waxy leaves and clusters of fragrant, star-shaped flowers; also called “wax plant”","zh":"一种热带藤本植物，叶子厚且带蜡质光泽，开成簇的芳香星形花；也叫“蜡兰 / 蜡叶球兰（wax plant）”"},"examples":[{"en":"My grandma grows a hoya on the windowsill, and it blooms every summer.","zh":"我奶奶在窗台上养了一盆球兰（hoya），每年夏天都会开花。"},{"en":"Hoyas are popular houseplants because their flowers smell sweet at night.","zh":"球兰很受欢迎作为室内植物，因为它的花在夜里闻起来很香。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) used as a short name for the plant genus Hoya or for a plant in that group","zh":"（非正式）指球兰属（Hoya）或该属中的某一种植物的简称"},"examples":[{"en":"This hoya is a Hoya carnosa variety.","zh":"这株球兰是 Hoya carnosa（球兰/蜡兰）的一个品种。"},{"en":"Do you collect hoyas or other trailing plants?","zh":"你是收集球兰还是其他垂吊植物的人？"}]}],"synonyms":["wax plant","porcelain flower","Hoya (genus)"],"phonetic":"/ˈhɔɪ.ə/","extraExplanation":["“Hoya”是植物学属名，常见室内观叶/观花植物。英文里很多爱好者会直接说“a hoya / hoyas”来指球兰。","常见别名：wax plant（蜡质叶片的感觉）、porcelain flower（花看起来像瓷做的）。"]}
{"word":"hoyas","summary":{"en":"“Hoyas” means multiple hoya plants—popular tropical houseplants with waxy leaves and fragrant star-shaped flowers.","zh":"“hoyas”指多株/多种球兰（Hoya）——常见的热带室内植物，叶片蜡质，花多为芳香星形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tropical climbing or trailing houseplant (genus Hoya), often grown for its thick waxy leaves and clusters of fragrant, star-shaped flowers; plural of “hoya.”","zh":"一种热带藤本或垂吊的观叶/开花植物（球兰属 Hoya），常因其厚实蜡质叶片与成簇芳香的星形花而栽培；“hoya”的复数。"},"examples":[{"en":"I keep two hoyas on the windowsill because they like bright, indirect light.","zh":"我把两盆球兰放在窗台上，因为它们喜欢明亮的散射光。"},{"en":"These hoyas bloom in summer and the flowers smell sweet at night.","zh":"这些球兰在夏天开花，晚上花香很甜。"}]}],"synonyms":["wax plants","Hoya plants","porcelain flowers"],"phonetic":"/ˈhɔɪ.əz/","extraExplanation":["“Hoya”在英文植物圈里非常常见，通常指“球兰属”观赏植物（也有人叫 wax plant，意为“蜡质植物”）。当你看到标签写“hoyas”，通常就是多盆/多种球兰的统称。","注意大小写：植物属名在学术写法中常大写（Hoya），日常英语里也常写作 hoya / hoyas。"]}
{"word":"hoyden","summary":{"en":"A hoyden is a bold, high-spirited girl (old-fashioned; sometimes mildly negative).","zh":"hoyden 指活泼大胆的女孩（偏旧式用法，有时略带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lively, bold girl (often used in an old-fashioned way, and it can sound slightly disapproving).","zh":"（多为旧式用法）活泼大胆的女孩；有时带点不赞成的语气。"},"examples":[{"en":"In the old novel, she’s described as a hoyden who climbs trees and laughs loudly.","zh":"在那本老小说里，她被描写成一个会爬树、大声笑的“野丫头”。"},{"en":"He called her a hoyden, but she took it as a compliment.","zh":"他叫她“hoyden”，但她把这当成称赞。"}]}],"synonyms":["tomboy","wild child","rascal","imp"],"phonetic":"/ˈhɔɪdən/","extraExplanation":["“hoyden”常见于较早的英文学作品或较正式/文雅的语境里，带有一种“女孩不够淑女、太闹腾”的时代视角；现代英语里较少使用，且可能被认为带有性别刻板印象。若想中性表达“活泼、爱冒险的孩子”，可以说“an energetic kid / a lively child / a tomboy（略带性别色彩）”。"]}
{"word":"hoydened","summary":{"en":"“Hoydened” is a dated word meaning boisterous/tomboyish, or the past form of “hoyden” (to act in a loud, unruly way).","zh":"“hoydened”是较过时的词，指吵闹粗野、偏“假小子”的；也可作动词“hoyden”的过去式/过去分词（指喧闹嬉闹）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dated) Wild, boisterous, and a bit rough in behavior; tomboyish.","zh":"（过时）举止粗野、爱闹腾的；有点“假小子”式的。"},"examples":[{"en":"In the novel, the heroine is described as hoydened in her youth, always climbing trees and tearing her dress.","zh":"小说里写女主年少时十分“hoydened”，总爱爬树，把裙子扯破。"},{"en":"He remembered her as a hoydened child who never sat still at the table.","zh":"他记得她小时候很“hoydened”，吃饭时从来坐不住。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hoyden”: to behave in a loud, playful, and unruly way (often said of a girl in older usage).","zh":"“hoyden”的过去式/过去分词：吵闹地嬉闹、举止放肆（旧用法里常指女孩）。"},"examples":[{"en":"The children hoydened about the yard until dusk.","zh":"孩子们在院子里闹腾到黄昏。"},{"en":"She had hoydened through her school days, uninterested in being “ladylike.”","zh":"她学生时代一直闹闹腾腾，不在意要“淑女”。"}]}],"synonyms":["boisterous","rowdy","tomboyish","unruly"],"phonetic":"/ˈhɔɪdən(d)/","extraExplanation":["“hoyden / hoydened”在现代英语里比较少见，语气偏文学或复古（often ‘dated’）。","这个词历史上常用来评价女孩“不够文静/不够淑女”，带有性别刻板印象；现代写作中若用，建议注意语境，避免贬义或性别偏见。","更中性的现代替换可用：boisterous（吵闹活泼的）、rowdy（喧闹的）、tomboyish（偏假小子气的）。"]}
{"word":"hoydenhood","summary":{"en":"Hoydenhood means the state or behavior of being a hoyden—rowdy, mischievously playful high spirits (old-fashioned).","zh":"Hoydenhood 指“野丫头/淘气姑娘式”的状态或行为：吵闹、顽皮、粗野的活泼劲（较旧式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the behavior or condition of being a hoyden (a boisterous, rough, or mischievously playful girl or young woman); rowdy, unladylike high spirits (old-fashioned).","zh":"（旧式用法）像“野丫头/淘气姑娘”一样的行为或状态；粗野、吵闹、顽皮的活泼劲（带有传统性别刻板印象色彩）。"},"examples":[{"en":"In the novel, her aunt scolded her for her hoydenhood at the dinner table.","zh":"小说里，她的姑妈因为她在餐桌上的“野丫头”做派而责备她。"},{"en":"What the neighbors called “hoydenhood” was mostly just a child’s loud laughter and curiosity.","zh":"邻居们称作“hoydenhood（野丫头劲儿）”的，多半只是孩子大声的笑和好奇心。"}]}],"synonyms":["tomboyishness","rowdiness","boisterousness","mischief","high spirits"],"phonetic":"/ˈhɔɪdənˌhʊd/","extraExplanation":["“hoydenhood”由“hoyden（野丫头、淘气姑娘）+ -hood（……的状态/时期，如 childhood）”构成，意思就是“像hoyden那样的状态”。","这是带年代感、偏文学/讽刺的词，在现代英语中较少见；使用时要注意它可能暗含对女孩“不够淑女”的评判，语气可能不够中性。","在当代更中性的表达可用：tomboyishness（假小子气质）、rowdiness（吵闹/喧闹）、high spirits（兴致高昂、活力十足）。"]}
{"word":"hoydening","summary":{"en":"Hoydening means loud, playful, slightly wild behavior, often associated (in older usage) with a tomboyish girl.","zh":"Hoydening 指吵闹、爱玩、略显野性的行为；旧用法中常与“像假小子一样的女孩”的形象相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of behavior) loud, playful, and a bit rough or wild; behaving like a “hoyden” (a boisterous, tomboyish girl or young woman).","zh":"（指行为）吵闹、爱玩、带点粗野或放肆的；像“hoyden”（旧用法：举止豪放、像假小子一样的女孩/年轻女子）。"},"examples":[{"en":"The novel describes her childhood as full of hoydening adventures in the countryside.","zh":"小说把她的童年写成在乡间充满“疯玩式”的冒险。"},{"en":"At school she was known for her hoydening energy—always climbing, running, and laughing too loudly.","zh":"在学校里，她以“疯闹般”的精力出名——总在攀爬、奔跑，还笑得特别大声。"}]},{"partOfSpeech":"n.","definition":{"en":"boisterous or mischievous playing/behavior (used as a gerund noun).","zh":"喧闹、顽皮、带点野性的玩闹行为（作动名词使用）。"},"examples":[{"en":"The teacher tolerated a little hoydening during recess, but not in class.","zh":"老师能容忍课间有一点吵闹玩闹，但上课不行。"}]}],"synonyms":["boisterous","rowdy","high-spirited","mischievous","tomboyish"],"phonetic":"/ˈhɔɪdənɪŋ/","extraExplanation":["“hoydening”来自名词“hoyden”。“hoyden”在现代英语里偏旧、带时代色彩，常用来描写不太符合传统“淑女”期待的活泼、粗犷或像假小子一样的女孩。如今使用时要注意语气：在文学作品里常见，日常交流中可能显得带评判或刻板印象。更中性的表达可以用“rowdy/playful/boisterous”。"]}
{"word":"hoydenish","summary":{"en":"Hoydenish means boldly noisy and a bit rough, especially describing a girl in an old-fashioned way.","zh":"Hoydenish 指（多用于老派说法）女孩举止大胆喧闹、略显粗野、不太“淑女”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a girl or young woman) Bold, noisy, and a bit rough in behavior; not behaving in a “ladylike” way (often used in an old-fashioned or slightly critical tone).","zh":"（多指女孩或年轻女性）举止大胆、吵闹、带点粗野；不太“淑女”（常带有老派或略带批评的语气）。"},"examples":[{"en":"Her hoydenish laugh filled the room, and everyone turned to look.","zh":"她那种有点“疯丫头”式的笑声充满了房间，大家都转头看过来。"},{"en":"In the novel, she’s described as hoydenish—climbing trees and talking back to adults.","zh":"小说里形容她很“野丫头”——爬树、还会顶嘴大人。"},{"en":"Some people admired her hoydenish confidence, while others found it rude.","zh":"有些人欣赏她那种有点“男孩子气/野”的自信，另一些人却觉得没礼貌。"}]}],"synonyms":["boisterous","tomboyish","rowdy","lively","unruly"],"phonetic":"/ˈhɔɪdənɪʃ/","extraExplanation":["“hoydenish”来自名词“hoyden”，指举止粗野、爱闹腾的女孩（较老派用法）。因此这个词在现代英语里不算常用，常出现在文学作品、历史语境或带有评判色彩的描述中。","语气提示：用来形容女性时可能带有性别刻板印象（暗示女性应当“淑女”）。更中性的替代说法可根据语境选择：lively（活泼的）, boisterous（喧闹的）, tomboyish（像假小子一样的）。"]}
{"word":"hoydenishness","summary":{"en":"“Hoydenishness” means boisterous, rough, tomboy-like behavior, often said of a girl in an old-fashioned way.","zh":"“hoydenishness”指（多带旧式眼光）像“野丫头/假小子”那样粗野吵闹、活泼放肆的举止。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rough, noisy, or tomboy-like behavior (especially used about a girl or young woman); boisterousness that seems “unladylike” in a traditional sense.","zh":"（尤指对女孩/年轻女性的）野丫头式、粗野吵闹的举止；带有“不像淑女”的传统评判意味的活泼放肆。"},"examples":[{"en":"Her hoydenishness in childhood—climbing trees and coming home muddy—made her parents worry too much.","zh":"她小时候的“野丫头劲儿”——爬树、弄得一身泥回家——让父母过度担心。"},{"en":"The novel treats her hoydenishness as charm rather than a flaw.","zh":"小说把她的“野劲儿”写成一种魅力，而不是缺点。"}]}],"synonyms":["boisterousness","rowdiness","tomboyishness","wildness","roughness"],"phonetic":"/ˈhɔɪdənɪʃnəs/","extraExplanation":["“hoydenishness”来自形容词“hoydenish”（像野丫头的、粗野吵闹的），其词根“hoyden”指“举止粗鲁、爱闹的女孩”。现代英语里这个词较少见，而且常带有过时的性别期待与评判色彩；在正式写作中可用更中性的说法，如“boisterousness（活泼吵闹）”“rowdiness（喧闹）”“tomboyishness（假小子气）”。"]}
{"word":"hoydenism","summary":{"en":"Hoydenism means lively, mischievous, somewhat rough or tomboyish behavior (often associated with girls in older usage).","zh":"Hoydenism 指活泼顽皮、略显粗鲁或假小子式的“野丫头”行为（多见于较旧用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rough, bold, or playful behavior typical of a lively, mischievous girl or young woman; tomboyishness.","zh":"（多指活泼、顽皮、举止不拘的）“野丫头”式行为；假小子气；粗鲁却带玩闹意味的举止。"},"examples":[{"en":"Her friends teased her for her hoydenism when she climbed trees in a dress.","zh":"她穿着裙子爬树时，朋友们取笑她太“野丫头”了。"},{"en":"The character’s charm comes from her mix of kindness and a little hoydenism.","zh":"这个角色的魅力来自她的善良与一点点“野劲儿”的结合。"}]}],"synonyms":["tomboyishness","boisterousness","mischief","rowdiness"],"phonetic":"/ˈhɔɪdənɪzəm/","extraExplanation":["“hoydenism”来自“hoyden”（野丫头、假小子般的女孩），在较老派或文学语境里更常见。它有时带轻微的批评意味（觉得不够“淑女”），但也可能是带欣赏的语气（活泼、率真、不做作）。使用时要注意语境与对象是否会觉得被刻板印象化。","相关词：hoyden（n. 野丫头/假小子般的女孩）、tomboy（更常用，语气通常更中性）、boisterous（adj. 喧闹的、精力旺盛的）。"]}
{"word":"hoydens","summary":{"en":"“Hoydens” means boisterous, mischievous girls (plural), a somewhat old-fashioned and often judgmental term.","zh":"“hoydens”指一群喧闹爱闹的女孩（复数），属于较旧且常带批评意味的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hoyden”: a boisterous, rough, and playful girl; by extension, a person (usually a young woman) who behaves in a loud, wild, or tomboyish way.","zh":"“hoyden”的复数：喧闹、粗野又爱玩闹的女孩；也可泛指（多指年轻女性）举止大大咧咧、像“假小子”一样的人。"},"examples":[{"en":"In the old novel, the sisters are described as carefree hoydens who run barefoot through the fields.","zh":"在那本老小说里，姐妹俩被写成无忧无虑的“野丫头”，光着脚在田野里奔跑。"},{"en":"The headmaster complained that the girls were “hoydens,” but their teacher praised their energy and curiosity.","zh":"校长抱怨这些女孩是“野丫头”，但老师称赞她们精力充沛、好奇心强。"}]}],"synonyms":["tomboys","rowdy girls","high-spirited girls","mischievous girls"],"phonetic":"/ˈhɔɪdənz/","extraExplanation":["“hoyden(s)”在现代英语里偏旧式、带评判色彩，常用来指责女孩“不够淑女”，因此在正式或当代语境中使用要谨慎。","更中性、现代的替代表达可以是：tomboy（假小子，偏中性）、rowdy kids（吵闹的孩子们）、high-spirited girls（活泼的女孩们）。"]}
{"word":"hoyle","summary":{"en":"Hoyle refers to Edmond Hoyle, a famous authority on game rules, and appears in the phrase “according to Hoyle,” meaning strictly by the rules.","zh":"Hoyle指规则权威埃德蒙·霍伊尔，并常见于短语“according to Hoyle”，表示“严格按规则/按规范”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Edmond Hoyle (1672–1769), an English writer whose books set standard rules for card games; his name is used to mean an accepted authority on rules.","zh":"（专有名词）埃德蒙·霍伊尔（1672–1769），英国作家，因编写纸牌游戏规则而成为“权威规则”的代名词。"},"examples":[{"en":"Many players still treat Hoyle as the authority on classic card-game rules.","zh":"很多玩家仍把霍伊尔视为经典纸牌游戏规则的权威。"},{"en":"If you want the official rules, check a book inspired by Hoyle’s work.","zh":"如果你想看正式规则，可以查阅受霍伊尔著作影响的规则书。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Phrase) according to Hoyle: exactly according to the proper or official rules; strictly correct.","zh":"（短语）according to Hoyle：完全按正式/正确的规则来；严格合乎规范。"},"examples":[{"en":"We may have to do it according to Hoyle, even if it takes longer.","zh":"即使更费时间，我们也可能得按规范来做。"},{"en":"His resume is according to Hoyle—clear, honest, and well formatted.","zh":"他的简历很规范——清晰、真实、格式也很好。"},{"en":"The referee insisted the game be played according to Hoyle.","zh":"裁判坚持比赛必须严格按规则进行。"}]}],"synonyms":["rulebook","authority","official rules","by the book"],"phonetic":"/hɔɪl/","extraExplanation":["“according to Hoyle”常用于日常英语中，表示“按规矩/按官方标准”。它不只用于打牌或游戏，也可用于工作流程、文件格式、礼仪等场合，语气往往带一点“认真讲规矩”的感觉。","来源于埃德蒙·霍伊尔的纸牌规则书（18世纪），当时被广泛视为权威版本，因此他的名字逐渐演变成“规则本身”的象征。"]}
{"word":"hoyles","summary":{"en":"“Hoyle’s” refers to authoritative rules—especially in games—and appears in “according to Hoyle” meaning ‘by the book.’","zh":"“Hoyle’s”指（尤在游戏中）权威规则；短语“according to Hoyle”意为“按规矩/按正规做法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often in the phrase “according to Hoyle”) the accepted or authoritative rules or standard way of doing something, especially in games or procedures","zh":"（常见于短语“according to Hoyle”）公认的、权威的规则或标准做法，尤用于牌类游戏或办事流程"},"examples":[{"en":"We followed the rules according to Hoyle, so no one could complain.","zh":"我们完全按权威规则来做，所以没人能抱怨。"},{"en":"That’s not according to Hoyle—you can’t change the rules halfway through the game.","zh":"那不符合规范——比赛进行到一半不能改规则。"}]},{"partOfSpeech":"n.","definition":{"en":"a rulebook of card games and other games (historically published under the name “Hoyle’s”)","zh":"（历史上以“Hoyle’s”出版的）牌类游戏等的规则书、玩法手册"},"examples":[{"en":"My grandfather kept an old Hoyle’s on the shelf for card nights.","zh":"我爷爷书架上一直放着一本旧《霍伊尔规则书》，专门用来打牌夜查规则。"}]}],"synonyms":["by the book","according to the rules","properly","officially"],"phonetic":"/hɔɪlz/","extraExplanation":["“Hoyle’s”来自18世纪英国作家Edmond Hoyle（埃德蒙·霍伊尔）编写的牌戏规则汇编。后来“Hoyle’s”逐渐被用来泛指“权威规则/标准做法”。因此口语里说“according to Hoyle”不一定真的指那本书，而是强调“按正规、按规矩”。","用法提示：通常写作“Hoyle’s”（带撇号）或出现在固定搭配“according to Hoyle”。大小写一般保留（源自人名/书名）。"]}
{"word":"hoyman","summary":{"en":"An old-fashioned word for a sailor/boatman who worked on a small coastal sailing vessel called a hoy.","zh":"一个较古老的词，指在名为“hoy”的沿海小型帆船上工作的水手或船夫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A sailor or boatman who works on a hoy (a small coastal sailing vessel).","zh":"（古义）在“hoy”（一种小型沿海帆船）上工作的水手；船夫。"},"examples":[{"en":"In older British ports, a hoyman might carry goods between ships and shore.","zh":"在较早期的英国港口里，hoyman 可能负责在船只与岸边之间运送货物。"},{"en":"The story mentions a hoyman guiding the small vessel into the harbor.","zh":"故事里提到一位 hoyman 把小船引导进港。"}]}],"synonyms":["sailor","boatman","mariner","seaman"],"phonetic":"/ˈhɔɪmən/","extraExplanation":["“hoyman”来自“hoy”（一种常见于英国沿海的货运小帆船）+ “-man”（从事某职业的人）。这个词现在非常少见，多出现在历史/文学语境或旧港口相关描述中。","如果你是在姓名（如 Hoyman）或品牌/地名中看到它，那可能不是词汇意义上的“hoyman”，而是专有名词。"]}
{"word":"hoys","summary":{"en":"“Hoys” is the plural of “hoy,” meaning small historical coastal boats (mainly British usage).","zh":"“hoys”是“hoy”的复数，指旧时的小型沿海船只（主要为英式、历史用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “hoy”: a small boat or coastal sailing vessel used especially in the past (mainly British, historical).","zh":"“hoy”的复数：一种旧时常见的小型船只/沿海帆船（主要为英式用法，偏历史）。"},"examples":[{"en":"In the harbor, several hoys carried goods between the ships and the shore.","zh":"在港口里，几艘hoys在大船和岸边之间运送货物。"},{"en":"The museum’s model shows how hoys sailed along the English coast.","zh":"博物馆的模型展示了hoys如何沿着英格兰海岸航行。"}]}],"synonyms":["small boat","coastal vessel","sailing vessel"],"phonetic":"/hɔɪz/","extraExplanation":["“hoy”这个词在现代英语里不常见，多出现在历史写作、海事史、或文学作品里；日常英语更常用 boat / small ship / barge 等。","注意别和感叹词“Hoy!”混淆：在一些语言与地区（如受西班牙语影响的场景）“Hoy!”可用来招呼或引起注意，但那不是“hoys（船）”这个名词复数的用法。"]}

