{"word":"HR","summary":{"en":"HR means “human resources,” usually the department that handles hiring, pay, benefits, training, and workplace rules.","zh":"HR指“人力资源”，通常是负责招聘、薪酬福利、培训和公司制度等事务的部门。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"human resources; the department or function in a company that manages hiring, pay, benefits, training, and workplace policies","zh":"人力资源；公司里负责招聘、薪酬福利、培训与制度管理等工作的部门/职能"},"examples":[{"en":"If you have questions about your benefits, contact HR.","zh":"如果你对福利有疑问，请联系HR（人力资源部）。"},{"en":"HR is interviewing candidates this week.","zh":"HR这周在面试候选人。"},{"en":"She works in HR at a tech company.","zh":"她在一家科技公司做人力资源工作。"}]},{"partOfSpeech":"n.","definition":{"en":"the people in an organization considered as a workforce (less common in everyday conversation)","zh":"（较少用）把组织中的员工整体视为“人力资源/劳动力”"},"examples":[{"en":"The company is investing in HR development.","zh":"公司正在投入人力资源发展（人才培养）。"}]}],"synonyms":["human resources","the HR department","people team (company term)","personnel (more old-fashioned)"],"phonetic":"/ˌeɪtʃˈɑr/","extraExplanation":["“HR”是缩写，读作字母：H-R（/ˌeɪtʃˈɑr/）。口语和邮件里很常见：the HR department / HR team。","写正式文件时也常写全称“Human Resources”；在一些公司里可能用“People Team/People Ops”来代替HR，语气更强调“以人为本”。"]}
{"word":"hr","summary":{"en":"“HR” most commonly means Human Resources; it can also mean hour(s) in written time abbreviations.","zh":"“HR”最常指“人力资源（部门）”；在书面时间表达中也可表示“小时”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Human Resources: the department in a company that manages hiring, employee relations, pay/benefits, and workplace policies.","zh":"人力资源：公司里负责招聘、员工关系、薪酬福利和劳动/公司制度等事务的部门。"},"examples":[{"en":"You should contact HR if you have questions about your benefits.","zh":"如果你对福利有疑问，应该联系HR（人力资源部）。"},{"en":"HR scheduled my interview for next Tuesday.","zh":"HR把我的面试安排在下周二。"},{"en":"The company asked HR to update the workplace policy.","zh":"公司让HR更新工作制度。"}]},{"partOfSpeech":"n.","definition":{"en":"Hour(s): a written abbreviation used in schedules, instructions, or measurements of time.","zh":"小时：在时间表、说明或计量中常用的书面缩写。"},"examples":[{"en":"The flight is about 3 hr long.","zh":"这趟航班大约3小时。"},{"en":"Please wait 24 hr before taking the next dose.","zh":"请间隔24小时后再服用下一剂。"}]}],"synonyms":["Human Resources","personnel","HR department"],"phonetic":"/ˌeɪtʃ ˈɑr/","extraExplanation":["“HR”通常大写，口语里常读作字母名“H-R”。在职场语境中非常常见；写邮件时也可写“HR department”或直接写“HR”。","表示“小时”时更常见写法是“hr”（小写），复数一般写“hrs”。在正式写作中往往写全“hour(s)”。"]}
{"word":"HRD","summary":{"en":"HRD most often means Human Resource Development (employee training and growth), but it can also mean Human Resources Department or, in medicine, Homologous Recombination Deficiency.","zh":"HRD 最常见指“人力资源开发”（培训与人才发展），也可能指“人力资源部”，在医学中还可指“同源重组修复缺陷”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Human Resource Development: training and education that help employees build skills and grow in their careers (often a function inside HR).","zh":"人力资源开发：通过培训与学习提升员工技能、促进职业发展的工作（通常属于人力资源体系的一部分）。"},"examples":[{"en":"Our HRD team runs onboarding and leadership training.","zh":"我们的人力资源开发团队负责入职培训和领导力培训。"},{"en":"The company increased its HRD budget to support upskilling.","zh":"公司增加了人力资源开发预算来支持技能提升。"}]},{"partOfSpeech":"n.","definition":{"en":"Human Resources Department: the department that manages hiring, pay, benefits, and workplace policies (used in some organizations as a label for HR).","zh":"人力资源部：负责招聘、薪酬、福利与制度管理的部门（有些机构用 HRD 来指 HR 部门）。"},"examples":[{"en":"Please send the updated contract to HRD for review.","zh":"请把更新后的合同发给人力资源部审核。"}]},{"partOfSpeech":"n.","definition":{"en":"Homologous Recombination Deficiency: a genetics/oncology term describing a tumor’s reduced ability to repair DNA, which can affect treatment choices.","zh":"同源重组修复缺陷：遗传学/肿瘤学术语，指肿瘤修复 DNA 的能力下降，可能影响治疗方案选择。"},"examples":[{"en":"The report notes HRD status to guide therapy decisions.","zh":"报告标注了 HRD 状态，用于辅助治疗决策。"}]}],"synonyms":["Human resource development","learning and development (L&D)","talent development","HR department (HR)"],"phonetic":"/ˌeɪtʃ ɑr ˈdiː/","extraExplanation":["HRD 是缩写，在不同领域含义不同。日常职场语境里最常见的是 Human Resource Development（偏“培训/人才发展”），但有些公司也会把 HRD 当作 Human Resources Department（“人力资源部”）来用；医学文献里常见的是 Homologous Recombination Deficiency（同源重组修复缺陷）。阅读时可通过上下文（培训/制度 vs. 基因检测/肿瘤治疗）来判断。"]}
{"word":"hrd","summary":{"en":"HRD is usually an abbreviation meaning either Human Resources Department or Human Resource Development; it can also be a technical file type in some software.","zh":"HRD 通常是缩写，常指“人力资源部”或“人力资源发展（培训）”；在技术语境中也可能指某些软件的文件格式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Human Resources Department; the part of a company that handles hiring, pay, benefits, and employee policies.","zh":"（缩写）人力资源部；公司中负责招聘、薪酬福利与员工制度等的部门。"},"examples":[{"en":"Please send your updated address to HRD.","zh":"请把你更新后的地址发给人力资源部（HRD）。"},{"en":"HRD will contact you about the interview schedule.","zh":"人力资源部（HRD）会联系你确认面试安排。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Human Resource Development; training and learning programs that help employees improve skills and grow in their careers.","zh":"（缩写）人力资源开发/人力资源发展；帮助员工提升技能与职业成长的培训与学习项目。"},"examples":[{"en":"The company increased its HRD budget for leadership training.","zh":"公司增加了人力资源发展（HRD）的预算，用于领导力培训。"},{"en":"HRD focuses on long-term employee growth, not just onboarding.","zh":"人力资源发展（HRD）更关注员工的长期成长，而不只是入职培训。"}]},{"partOfSpeech":"other","definition":{"en":"(tech) A file format used in some software (often related to design, color profiles, or embroidery), depending on the program.","zh":"（技术）某些软件使用的文件格式（常见于设计、色彩配置或刺绣等领域），具体含义取决于软件。"},"examples":[{"en":"I can’t open this HRD file—what program created it?","zh":"我打不开这个 HRD 文件——它是用什么软件生成的？"},{"en":"Try exporting the design to a more common format instead of HRD.","zh":"试着把设计导出成更常见的格式，而不是 HRD。"}]}],"synonyms":["HR","Human Resources","Training and Development","L&D (Learning & Development)"],"phonetic":"/ˌeɪtʃ ɑr ˈdi/","extraExplanation":["“HRD”不是一个常见的日常英语单词，更多是缩写。不同公司/国家可能更常用“HR”（人力资源）而不是“HRD”。","如果你想表达“hard（很难/很努力）”，或是想查某个单词拼写，请告诉我你看到“hrd”的句子，我可以帮你判断具体意思。"]}
{"word":"hrdwre","summary":{"en":"Hardware means the physical equipment of a computer or machine; it can also mean tools and supplies sold in a hardware store.","zh":"Hardware 指电脑或机器的实体部件（硬件）；也可指五金店出售的工具与五金用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the physical parts of a computer or machine (not the programs)","zh":"（电脑或机器的）硬件；实体部件（不是软件程序）"},"examples":[{"en":"My laptop is slow, but the hardware is still fine—the problem is the software.","zh":"我的笔记本很慢，但硬件还好——问题在软件。"},{"en":"You may need new hardware to run that game smoothly.","zh":"你可能需要新的硬件才能流畅运行那个游戏。"}]},{"partOfSpeech":"n.","definition":{"en":"tools and building supplies sold in a hardware store (like nails, screws, and tools)","zh":"（五金店卖的）五金器具；工具与建材（如钉子、螺丝、工具等）"},"examples":[{"en":"I went to the hardware store to buy screws and a drill.","zh":"我去五金店买了螺丝和电钻。"},{"en":"We need some hardware to fix the door handle.","zh":"我们需要一些五金配件来修门把手。"}]}],"synonyms":["equipment","machinery","tools","computer components"],"phonetic":"/ˈhɑrdˌwer/","extraExplanation":["你输入的“hrdwre”很可能是“hardware”的拼写简写/打错。常见搭配：computer hardware（计算机硬件）、hardware requirements（硬件要求）、hardware upgrade（硬件升级）。","相关词对比：hardware（看得见摸得着的设备） vs. software（软件/程序） vs. firmware（固件：介于两者之间、写在设备里的底层程序）。"]}
{"word":"hrear","summary":{"en":"“hrear” is probably a typo for “hear,” meaning to perceive sound or to learn/receive information.","zh":"“hrear”很可能是“hear”的拼写错误，意思是“听见”或“听说/得知”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely a misspelling) to perceive sound with your ears; to listen and become aware of a sound or someone speaking.","zh":"（可能是拼写错误）听见；用耳朵感知声音；听到别人说话。"},"examples":[{"en":"I can’t hear you—can you speak louder?","zh":"我听不见你——你能大声一点吗？"},{"en":"Did you hear that noise outside?","zh":"你听到外面的声音了吗？"}]},{"partOfSpeech":"v.","definition":{"en":"to receive or learn information (often from another person or a source).","zh":"得知；听说（从别人或某种来源获得信息）。"},"examples":[{"en":"I heard that the store is closing next week.","zh":"我听说那家店下周要关门了。"},{"en":"We heard about the new policy in the meeting.","zh":"我们在会议上得知了新政策。"}]},{"partOfSpeech":"vt.","definition":{"en":"to listen to a case, request, or opinion officially (especially in court or a formal meeting).","zh":"（正式）听取；审理（案件、请求或意见）。"},"examples":[{"en":"The judge will hear the case tomorrow.","zh":"法官明天将审理这个案子。"},{"en":"The committee heard several proposals.","zh":"委员会听取了几个提案。"}]}],"synonyms":["listen","catch","perceive","learn","find out"],"phonetic":"/hɪr/","extraExplanation":["“hrear”本身不是常见英文单词，最可能是把 **hear** 拼错了。也有人会把它误打成 **rear**（后面/把…抬起）或 **heart**（心脏/内心），如果你想查的是其中一个词，告诉我我可以换成对应词条。"]}
{"word":"href","summary":{"en":"“href” is the HTML attribute that gives the URL a hyperlink (or related tag) points to.","zh":"“href” 是 HTML 属性，用来写出超链接（或相关标签）要指向的 URL（网址）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) An HTML attribute that specifies the URL (web address) a link points to; short for “hypertext reference.”","zh":"（计算机）HTML 的一个属性，用来指定链接指向的 URL（网址）；是 “hypertext reference（超文本引用）” 的缩写。"},"examples":[{"en":"In HTML, the <a> tag uses href to tell the browser where to go.","zh":"在 HTML 中，<a> 标签用 href 告诉浏览器要跳转到哪里。"},{"en":"Make sure the href starts with https:// for a secure link.","zh":"确保 href 以 https:// 开头，以获得安全链接。"},{"en":"The button looks like a link, but it won’t open anything without an href.","zh":"这个按钮看起来像链接，但没有 href 就打不开任何页面。"}]}],"synonyms":["hyperlink reference","link URL","target URL"],"phonetic":"/ˈeɪtʃrɛf/","extraExplanation":["href 最常见于超链接：<a href=\"https://example.com\">Text</a>。也常见于 <link>（引入 CSS）、某些 <area> 等标签中。","如果 href 以 # 开头（例如 href=\"#top\"），通常表示跳转到同一页面中的某个位置（锚点/片段）。","在日常口语或非技术写作中，人们一般会说 “link” 或 “URL”，只有在写代码、做前端/网页开发时才会直接说 “href”。"]}
{"word":"hreod","summary":{"en":"“hreod” is an Old English noun meaning “reed,” the plant that grows near water.","zh":"“hreod”是一个古英语名词，意思是“芦苇”，指生长在水边的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old English) a reed; a reed plant, especially one growing in wet places.","zh":"（古英语）芦苇；（尤指）生长在湿地的芦苇类植物。"},"examples":[{"en":"The Old English word “hreod” is related to modern English “reed.”","zh":"古英语“hreod”和现代英语“reed（芦苇）”有关。"},{"en":"In some Old English texts, “hreod” can describe reeds by a marsh or river.","zh":"在一些古英语文本里，“hreod”可以用来描写沼泽或河边的芦苇。"}]}],"synonyms":["reed"],"phonetic":"/reɪd/","extraExplanation":["“hreod”不是现代英语常用词，主要出现在古英语（约公元5–11世纪）的文本与研究中。现代英语对应词通常是“reed”。","拼写与读音在不同时期、不同方言的古英语里可能有差异；学习时常把它当作词源（etymology）材料来理解现代词汇。","在文学与意象上，芦苇常与“湿地、河岸、风声、脆弱但有韧性”等画面联系在一起；古英语诗歌里也常借自然景物营造氛围。"]}
{"word":"hreol","summary":{"en":"“hreol” is not a common English word; it’s probably a typo or a proper name/acronym.","zh":"“hreol”不是常见英语单词；很可能是拼写错误或专有名词/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/acronym. Common possibilities include “hero,” “hurl,” or “hole,” depending on context.","zh":"不是标准英语单词。更可能是拼写错误，或是人名/缩写。常见可能是“hero（英雄）”“hurl（猛扔）”或“hole（洞）”，需结合上下文判断。"},"examples":[{"en":"I couldn’t find “hreol” in an English dictionary—did you mean “hero” or “hurl”?","zh":"我在英语词典里找不到“hreol”——你想写的是“hero”还是“hurl”？"},{"en":"If you share the sentence where you saw “hreol,” I can help identify the correct word.","zh":"如果你把看到“hreol”的句子发给我，我可以帮你判断正确的词。"}]}],"synonyms":["hero","hurl","hole"],"extraExplanation":["“hreol”看起来像是键盘邻近字母导致的拼写误差（例如把 hero / hurl / hole 打错），也可能是专有名词（人名、地名、品牌）或游戏/网络用语缩写。把它出现的完整句子、主题（比如游戏、小说、聊天）、以及你想表达的意思发来，我就能更准确地给出对应词条与用法。"]}
{"word":"HRH","summary":{"en":"HRH = “His/Her Royal Highness,” a formal royal title used for princes/princesses.","zh":"HRH 是 “His/Her Royal Highness（殿下）”的缩写，用于正式称呼王室成员。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “His/Her Royal Highness,” a formal style used when addressing or referring to a prince or princess (and some other royals).","zh":"“His/Her Royal Highness（殿下）”的缩写，用于正式称呼或提及王子、公主等王室成员的尊称。"},"examples":[{"en":"The invitation was addressed to HRH The Princess of Wales.","zh":"邀请函的抬头写给了“HRH 威尔士王妃殿下”。"},{"en":"HRH attended the ceremony and spoke briefly to the guests.","zh":"殿下出席了仪式，并向来宾简短致辞。"},{"en":"In official documents, you may see it written as H.R.H.","zh":"在正式文件里，你可能会看到它写作 H.R.H.。"}]}],"synonyms":["His Royal Highness","Her Royal Highness","H.R.H."],"phonetic":"/ˌeɪtʃ ɑr ˈeɪtʃ/","extraExplanation":["“HRH”通常在英联邦及欧洲一些君主制国家的语境里出现，属于礼仪性很强的称谓缩写。写作时常放在姓名或头衔前：HRH Prince/Princess + 名称/封号。","口语里一般不会念成一个单词，而是按字母读：H-R-H。不同国家的王室礼仪规则不完全相同，是否使用HRH以及使用范围可能会随制度与时期变化。"]}
{"word":"hrifan","summary":{"en":"“hrifan” is not a recognized standard English word; please provide context or check spelling.","zh":"“hrifan” 不是标准英文单词；请提供上下文或检查拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not found as a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"未查到作为标准英文单词的用法，可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"Did you mean “riff on” (to improvise or build on an idea) or “Hryvnia” (Ukrainian currency)?","zh":"你是不是想写 “riff on”（即兴发挥/在某个想法上延伸）或 “hryvnia”（乌克兰货币）？"},{"en":"If you tell me the sentence you saw it in, I can identify the closest English word.","zh":"如果你把它出现的句子发给我，我可以帮你判断最接近的英文词。"}]}],"extraExplanation":["我这边更像是遇到了“拼写/转写”问题：\n1) 你是在哪里看到 hrifan 的（文章、歌词、游戏ID、聊天）？\n2) 你想表达的意思是什么，或能否给出包含它的整句？\n\n常见的相近可能：\n- riff on：在某个主题/点子上即兴发挥、延伸（很常见的搭配）\n- Ryazan / Rifampin 等：可能是专有名词/药名的一部分\n- 人名/昵称：很多ID并不对应词典词条"]}
{"word":"hrimfaxi","summary":{"en":"Hrimfaxi is a horse from Norse mythology associated with the night and the origin of morning dew.","zh":"Hrimfaxi 是北欧神话中与“夜晚”和“晨露的由来”相关的一匹神话之马。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Norse mythology) A mythical horse whose name means “frost mane.” It rides across the sky at night, and the foam (or dew) from its bit is said to fall to earth as morning dew.","zh":"（北欧神话）一匹神话中的马，名字意为“霜之鬃毛”。它在夜晚奔驰于天空，据说它口中嚼子上的泡沫（或唾沫）落到人间就成了清晨的露水。"},"examples":[{"en":"In Norse mythology, Hrimfaxi carries the night across the sky, leaving dew behind.","zh":"在北欧神话中，Hrimfaxi 驮着“黑夜”划过天空，留下了露水。"},{"en":"The poem mentions Hrimfaxi to explain why the grass is wet in the morning.","zh":"诗中提到 Hrimfaxi，用来解释为什么清晨草地会湿。"}]}],"synonyms":["Frostmane","Hrímfaxi"],"phonetic":"/ˈrɪmˌfæk.si/","extraExplanation":["“Hrimfaxi”来自古诺斯语：hrím（霜）+ faxi（鬃毛），直译常见为“Frostmane（霜鬃）”。","它常与“Skinfaxi（光鬃）”成对出现：Hrimfaxi 负责夜晚，Skinfaxi 负责白昼；这种成对意象用于解释自然现象（昼夜交替、晨露等）。","在现代奇幻作品中偶尔会被借用作马的名字或象征“夜、寒霜、黎明前的露水”等意象。"]}
{"word":"hring","summary":{"en":"“Hiring” means employing someone or the process of recruiting employees.","zh":"“hiring”表示“雇用某人”或“招聘员工的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of employing someone for a job; the process of choosing and paying a worker","zh":"雇用；招聘（指挑选并雇佣员工的过程）"},"examples":[{"en":"We’re hiring two new teachers this semester.","zh":"这学期我们要招聘两位新老师。"},{"en":"Hiring usually takes time because interviews and background checks are needed.","zh":"招聘通常需要时间，因为要面试并做背景调查。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “hire”: to pay someone to do a job for you, or to employ someone","zh":"“hire”的现在分词：雇用；聘用；付费请人做事"},"examples":[{"en":"They are hiring more staff to handle customer calls.","zh":"他们正在招聘更多员工来处理客户来电。"},{"en":"She’s hiring a photographer for the wedding.","zh":"她要为婚礼请一位摄影师。"}]}],"synonyms":["recruitment","employing","taking on (staff)","staffing"],"phonetic":"/ˈhaɪərɪŋ/","extraExplanation":["你输入的“hring”在英文里不常见，最可能是拼写错误，想写的是“hiring”（招聘/雇用）。如果你其实想查“ring”（戒指/铃声/环）或其他词，请告诉我上下文句子，我可以帮你确认。"]}
{"word":"hringan","summary":{"en":"“hringan” is an Old English form meaning “to ring; to sound,” related to modern “ring.”","zh":"“hringan”是古英语形式，意思是“鸣响；发出声音”，与现代英语“ring”同源、同义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Old English, archaic) to ring; to sound (like a bell).","zh":"（古英语/古用法）鸣响；发出（如钟的）声音。"},"examples":[{"en":"In Old English texts, hrīngan/hringan can describe a bell that rings loudly.","zh":"在古英语文本中，hrīngan/hringan 可用来描写钟声大作。"},{"en":"The word is related in meaning to modern English “ring.”","zh":"这个词在意义上与现代英语 ring（鸣响）有关。"}]}],"synonyms":["ring","sound","chime","toll"],"phonetic":"/ˈrɪŋɡən/","extraExplanation":["“hringan”多见于古英语（Old English）或学术转写中，不是现代英语常用词。古英语里常见的写法也包括“hrīngan”（带长音符号 ī）。","词首的“hr-”是古英语里常见的辅音组合，进入现代英语后通常简化为“r-”（所以现代英语是 ring）。","如果你本来想查的是现代英语“ringing”（例如：The phone is ringing. 电话在响），告诉我你的语境，我可以按现代用法给你更合适的释义与例句。"]}
{"word":"hrothgar","summary":{"en":"Hrothgar is best known as the Danish king in *Beowulf* who receives Beowulf and seeks help against Grendel.","zh":"Hrothgar 最常见的含义是《贝奥武夫》中的丹麦国王，他接待贝奥武夫并求助以对抗格伦德尔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legendary Danish king in the Old English epic poem *Beowulf*, ruler of the hall Heorot, who is threatened by the monster Grendel and helped by the hero Beowulf.","zh":"《贝奥武夫》（*Beowulf*）这部古英语史诗中的丹麦传奇国王，统治大厅“赫罗特”（Heorot）；其王国受怪物格伦德尔（Grendel）威胁，后由英雄贝奥武夫相助。"},"examples":[{"en":"In *Beowulf*, Hrothgar welcomes Beowulf to Heorot and asks for help against Grendel.","zh":"在《贝奥武夫》中，赫罗斯加欢迎贝奥武夫来到赫罗特，并请求他帮助对抗格伦德尔。"},{"en":"Hrothgar’s speeches often focus on wisdom, leadership, and the dangers of pride.","zh":"赫罗斯加的讲话常常强调智慧、领导力，以及骄傲带来的危险。"}]},{"partOfSpeech":"n.","definition":{"en":"A masculine given name of Old Germanic origin, now rare, sometimes used in literature or as a historical-style name.","zh":"源自古日耳曼语的男性名字，如今较少见，有时用于文学作品或作为带有古风/历史感的姓名。"},"examples":[{"en":"The author named the warrior Hrothgar to give the story an ancient, Germanic feel.","zh":"作者给那位战士取名为 Hrothgar，以营造古代日耳曼风格的氛围。"}]}],"phonetic":"/ˈhrɑθˌɡɑr/","extraExplanation":["“Hrothgar”常被英语学习者当作普通词来查，但它主要是专有名词（人名）。在《贝奥武夫》中，他是一位年长的国王形象：慷慨、重礼仪、重秩序，象征“好国王/好领袖”的理想，但也显出人类对暴力与命运的无力感。","名字常被解释为与“hrōþ”（名声、荣耀）相关，整体带有“以荣耀闻名/声名显赫”的意味（不同学者对细节解释略有差异）。","文学课堂里提到 Hrothgar 时，常会同时出现：Heorot（王厅）、Grendel（怪物）、Wealhtheow（王后）等关键词。"]}
{"word":"hrs","summary":{"en":"“hrs” means “hours.”","zh":"“hrs”表示“hours（小时）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “hours,” used in schedules, time logs, and notices.","zh":"“hours（小时）”的缩写，常用于时间表、工时记录、通知等场合。"},"examples":[{"en":"Business hrs: Mon–Fri 9 a.m.–6 p.m.","zh":"营业时间：周一至周五 早上9点至下午6点。"},{"en":"I worked 40 hrs this week.","zh":"我这周工作了40小时。"},{"en":"The repair will take about 2–3 hrs.","zh":"维修大约需要2到3小时。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) abbreviation pronounced by letters (“H-R-S”), mainly in forms or headings.","zh":"（较少见）按字母读作“H-R-S”的缩写，主要出现在表格或标题中。"},"examples":[{"en":"Total HRS: 12","zh":"总计小时数：12"},{"en":"Enter HRS worked for each day.","zh":"请输入每天的工作小时数。"}]}],"synonyms":["hours","hr","h"],"phonetic":"/ˈaʊɚz/","extraExplanation":["“hrs”多见于非正式或空间有限的书面场景（如门口告示、排班表、工时单、短信）。在正式写作里通常写全“hours”。","也常见相关缩写：hr（1小时）、h（多用于科学/技术语境）、min（分钟）。"]}
{"word":"hrundaz","summary":{"en":"“hrundaz” is not recognized as a standard English word; it’s likely a misspelling or a proper/fantasy name.","zh":"“hrundaz”不是标准英语词汇；更可能是拼写错误或专有/虚构名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a name, or a made-up/fantasy term.","zh":"不是标准英语单词；可能是拼写错误、人名，或虚构/奇幻用语。"},"examples":[{"en":"I couldn’t find “hrundaz” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“hrundaz”——你能把它出现的句子发我吗？"},{"en":"If you meant “hundreds,” the spelling is different.","zh":"如果你想写“hundreds（数百）”，拼写是不一样的。"}]}],"extraExplanation":["“hrundaz”在常见英文语料与词典中没有对应词条。最常见的情况是：\n1）拼写误差（例如键盘相邻字母导致多打/少打）；\n2）专有名词（人名、游戏ID、地名、品牌名）；\n3）虚构语言/奇幻设定用词。\n\n把原句或上下文发来（前后各1-2句），我可以帮你判断它可能想表达哪个词，以及正确拼写与含义。"]}
{"word":"hrytt","summary":{"en":"“hrytt” is not a recognized English word; it’s likely a typo or a name—please share the context.","zh":"“hrytt”不是可识别的英语单词；更可能是拼写错误或名字——请提供上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a typo, a name/username, or random letters. Common intended words include “hurt,” “hyatt,” or “try” depending on context.","zh":"不是标准英语单词；更可能是拼写错误、名字/用户名或随意字母组合。常见可能想写的是“hurt（受伤/伤害）”、“Hyatt（凯悦酒店）”或“try（尝试）”，取决于上下文。"},"examples":[{"en":"I can’t find “hrytt” in an English dictionary—did you mean “hurt”?","zh":"我在英语词典里找不到“hrytt”——你是不是想写“hurt”？"},{"en":"If you tell me the sentence where you saw “hrytt,” I can help you figure it out.","zh":"如果你把“hrytt”出现的句子发我，我可以帮你判断它是什么意思。"}]}],"phonetic":"/hɹɪt/","extraExplanation":["“hrytt”不像英语常见的拼写结构，也没有固定词义。最有效的办法是：把它出现的完整句子/截图发来，或说明你想表达的中文意思（比如“受伤”“尝试”等），我就能给出准确词汇与用法。","如果你想查的是“hurt”，它既可以作动词（伤害/使疼）也可以作形容词（受伤的/疼的）。你确认一下是否打错字母。"]}
{"word":"hrzn","summary":{"en":"“hrzn” is an informal abbreviation of “horizon.”","zh":"“hrzn”是“horizon（地平线）”的非正式缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Texting/informal) Abbreviation for “horizon,” meaning the line where the sky seems to meet the land or sea; often used in creative writing, gaming, or short captions.","zh":"（短信/非正式）“horizon（地平线）”的缩写，指天空似乎与陆地或海洋相接的那条线；常见于创作、游戏或简短配文。"},"examples":[{"en":"The sun sank below the hrzn.","zh":"太阳沉到了地平线（hrzn）以下。"},{"en":"We rode toward the hrzn for hours.","zh":"我们朝着地平线（hrzn）骑行了好几个小时。"},{"en":"New quests appear on the hrzn.","zh":"新的任务正在地平线（hrzn）上出现/即将到来。"}]}],"synonyms":["horizon","skyline (sometimes, in city contexts)","on the horizon (coming soon)"],"phonetic":"/həˈraɪzən/","extraExplanation":["“hrzn”通常不是标准英语单词，而是省略元音的缩写写法（horizon → hrzn），多见于社交媒体、短信、标题、用户名或游戏界面中。正式写作中建议使用完整拼写“horizon”。","在比喻用法里，“on the horizon”表示“即将发生/在望”，有时也会把“horizon”缩写成“hrzn”来保持简短或风格化。"]}

