{"word":"hyacine","summary":{"en":"“Hyacine” is a rare/nonstandard spelling; the standard word is “hyacinth” (a fragrant spring flower).","zh":"“hyacine”是罕见/非标准拼写；标准词是“hyacinth（风信子）”，指一种春季香花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Nonstandard) A misspelling or uncommon variant of “hyacinth,” a fragrant spring flower that grows in dense clusters.","zh":"（罕见/非标准）常见于把“hyacinth（风信子）”拼错或写成不常见的变体；指一种春季开花、花香浓郁、成簇开放的球根花卉。"},"examples":[{"en":"I think you meant “hyacinth,” not “hyacine.”","zh":"我觉得你想写的是“hyacinth（风信子）”，不是“hyacine”。"},{"en":"The garden was filled with hyacinths in early spring.","zh":"早春时花园里开满了风信子。"}]},{"partOfSpeech":"n.","definition":{"en":"A deep bluish‑purple color (from the flower name; much less common in everyday English).","zh":"深蓝紫色（源自花名；日常英语中较少用）。"},"examples":[{"en":"She wore a scarf in a hyacinth shade.","zh":"她戴了一条风信子色（深蓝紫色）的围巾。"}]}],"synonyms":["hyacinth","spring flower"],"phonetic":"/ˈhaɪəˌsɪnθ/","extraExplanation":["“Hyacine”在现代英语里并不是标准拼写。标准形式是 **hyacinth**，来源于希腊神话人物 Hyacinthus；因此在文学或艺术语境里，风信子有时带有“春天、青春、哀悼/纪念”的联想。"]}
{"word":"hyacinth","summary":{"en":"Hyacinth is a sweet-smelling spring flower that grows from a bulb and has dense clusters of small blooms.","zh":"Hyacinth 指风信子：一种香味浓郁的春季球根花卉，花朵成密集的穗状花序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant spring flower with a dense cluster of small, bell-shaped blooms, often grown from a bulb","zh":"风信子；一种有香味的春季球根花卉，花朵密集成穗状，常呈铃形"},"examples":[{"en":"The hyacinths in our garden bloom in early spring.","zh":"我们花园里的风信子在早春开花。"},{"en":"She put a pot of hyacinths on the windowsill for their sweet smell.","zh":"她在窗台上放了一盆风信子，因为它们很香。"},{"en":"Purple hyacinth is often used as a symbol of spring and renewal.","zh":"紫色风信子常被用来象征春天与新生。"}]}],"synonyms":["spring flower","bulb flower"],"phonetic":"/ˈhaɪəˌsɪnθ/","extraExplanation":["“Hyacinth”来自希腊神话人物 Hyacinthus（海辛托斯）。在一些西方文化语境里，风信子常与春天、重生和悼念等意象相关。","在文学与艺术中，hyacinth 有时不仅指花，也被用来营造“清新、芬芳、春日”氛围；例如 T. S. Eliot 的《荒原》中出现过 “hyacinth girl / hyacinth garden” 等意象。"]}
{"word":"hyacinthia","summary":{"en":"Hyacinthia most commonly refers to an ancient Spartan festival honoring Hyacinthus and Apollo; it can also be a rare feminine given name based on “hyacinth.”","zh":"Hyacinthia 最常指古代斯巴达纪念许阿金托斯与阿波罗的节庆；也可作源自“风信子”的罕见女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ancient Greece) a Spartan religious festival held in honor of Hyacinthus and Apollo.","zh":"（古希腊）斯巴达为纪念许阿金托斯（Hyacinthus）与阿波罗而举行的宗教节庆。"},"examples":[{"en":"The historian described the Hyacinthia as one of Sparta’s most important annual festivals.","zh":"这位历史学家把 Hyacinthia 描述为斯巴达最重要的年度节庆之一。"},{"en":"During the Hyacinthia, public life paused for rites, music, and communal gatherings.","zh":"在 Hyacinthia 期间，公共生活会暂停，人们举行仪式、音乐活动与集体聚会。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare feminine given name, formed from “hyacinth” (the flower) and used mostly as a literary or ornamental name.","zh":"一种较罕见的女性名字，源自“hyacinth（风信子）”，多用于文学化或装饰性的取名。"},"examples":[{"en":"In the novel, Hyacinthia is portrayed as quiet but determined.","zh":"在小说里，Hyacinthia 被刻画为安静却坚定的人。"},{"en":"They chose the name Hyacinthia for its floral, classical feel.","zh":"他们选择 Hyacinthia 这个名字，因为它带有花卉与古典气息。"}]}],"synonyms":["Hyakinthia","Festival of Hyacinthus"],"phonetic":"/ˌhaɪəˈsɪnθiə/","extraExplanation":["“Hyacinthia”更常见的写法也会见到 **Hyakinthia**（更贴近希腊语转写）。它与神话人物 **Hyacinthus（许阿金托斯）**有关：传说他是阿波罗所爱之人，意外身亡后化为风信子，因此节庆带有悼念与庆祝并存的色彩。","如果你是在文学/诗歌里看到这个词，它常用来营造“古希腊、仪式、花与青春消逝”的意象。"]}
{"word":"hyacinthian","summary":{"en":"Hyacinthian means “of or like a hyacinth,” often implying violet-purple color, sweet floral scent, or (in literature) thick dark curling hair.","zh":"hyacinthian 意为“与风信子有关/像风信子一样”，常暗示蓝紫色、清甜花香；在文学中也可指浓密乌黑的卷发。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hyacinth (a spring flower), or like a hyacinth in color or fragrance—often suggesting a rich violet-blue/purple shade or a sweet floral scent.","zh":"与风信子（春季花卉）有关的；像风信子一样的（常指浓郁的蓝紫/紫色或清甜的花香）。"},"examples":[{"en":"The room smelled hyacinthian after she set the flowers on the table.","zh":"她把花放到桌上后，房间里就有了一股风信子般的清香。"},{"en":"He wore a hyacinthian tie—a deep violet that stood out against the white shirt.","zh":"他系了一条风信子色的领带——深紫色在白衬衫前很显眼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Describing hair as thick, dark, and richly curling; a poetic image based on the hyacinth flower.","zh":"（文学用法）形容头发浓密、乌黑、卷曲丰美的（源自对风信子的诗意联想）。"},"examples":[{"en":"In the poem, the hero’s hyacinthian locks are mentioned to emphasize his beauty.","zh":"在诗中，英雄“风信子般的卷发”用来强调他的美貌。"},{"en":"She described him as having hyacinthian hair, dark and softly curled.","zh":"她形容他有风信子般的头发，乌黑而微卷。"}]}],"synonyms":["hyacinthlike","violet","purplish","floral-scented","fragrant"],"phonetic":"/ˌhaɪəˈsɪnθiən/","extraExplanation":["“hyacinthian”来自“hyacinth（风信子）+ -ian（……的）”。在诗歌与古典写作中，它常用来营造华丽、感官化的意象（颜色与香气）。","文学里常见搭配是“hyacinthian hair/locks（风信子般的头发/卷发）”，著名例子出现在约翰·济慈（John Keats）的作品中，用来描写浓密而卷曲的黑发。","需要注意：它是较少见、偏文学/修辞的形容词；日常英语更常说“purple/violet”或“hyacinth-scented”。"]}
{"word":"hyacinthin","summary":{"en":"Hyacinthin means hyacinth-colored (deep bluish-purple) or relating to a hyacinth; it’s a rare form, more commonly seen as “hyacinthine.”","zh":"hyacinthin 指“风信子色（深蓝紫）”或“与风信子有关”；这个形式较少见，更常见的是 hyacinthine。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a deep bluish-purple color; hyacinth-colored.","zh":"呈深蓝紫色的；风信子花色的。"},"examples":[{"en":"She wore a hyacinthin dress that looked blue in the shade and purple in the sun.","zh":"她穿着一条风信子紫的裙子，在阴影里偏蓝，在阳光下偏紫。"},{"en":"The sky turned hyacinthin just before nightfall.","zh":"傍晚前天空变成了深蓝紫色。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a hyacinth (the flower) or resembling it.","zh":"与风信子（花）有关的；像风信子的。"},"examples":[{"en":"A hyacinthin scent filled the room, sweet and floral.","zh":"房间里充满了风信子般的香气，甜美而花香浓郁。"}]}],"synonyms":["hyacinthine","violet","purplish-blue","indigo"],"phonetic":"/ˌhaɪəˈsɪnθɪn/","extraExplanation":["“hyacinthin”在现代英语里非常少见，更常见的拼写是“hyacinthine”。两者都可表示“风信子色（偏蓝紫）”或“与风信子有关”。在文学或诗歌描写颜色时更可能见到这种词。","词源上与希腊神话中的 Hyacinthus（海辛托斯）有关，英语里“hyacinth”既指风信子花，也可指一种宝石（常译作“风信子石/红锆石”），因此在旧文献中有时也会带一点古典、华丽的色彩联想。"]}
{"word":"hyacinthine","summary":{"en":"Hyacinthine means hyacinth-colored (deep violet/blue-purple) and is often used in poetic or literary descriptions.","zh":"Hyacinthine 指“风信子色的”（深紫/蓝紫），多用于诗意或文学性的描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the color of a hyacinth—typically a deep purple, violet-blue, or rich bluish-purple.","zh":"呈风信子颜色的；通常指深紫色、紫蓝色或浓郁的蓝紫色。"},"examples":[{"en":"She wore a hyacinthine scarf that looked violet in the shade and blue in the sun.","zh":"她围着一条风信子色的围巾，在阴影里看着偏紫，在阳光下又偏蓝。"},{"en":"The sky turned hyacinthine at dusk, just before the first stars appeared.","zh":"黄昏时天空变成了蓝紫色，第一颗星出现之前尤为明显。"}]},{"partOfSpeech":"adj.","definition":{"en":"Poetic: Related to or resembling a hyacinth flower (in appearance or fragrance).","zh":"（诗歌用语）与风信子有关的；像风信子花的（外观或香气）。"},"examples":[{"en":"The poem describes a hyacinthine perfume drifting through the garden.","zh":"诗中写到风信子般的香气在花园里飘散。"},{"en":"Hyacinthine blooms lined the path in early spring.","zh":"早春时，路边开满了风信子般的花。"}]}],"synonyms":["violet","purplish-blue","blue-purple","indigo (approx.)"],"phonetic":"/ˌhaɪəˈsɪnθaɪn/","extraExplanation":["“hyacinthine”比较常见于文学或较正式的描写中，用来表达一种偏紫偏蓝、带一点华丽感的色调。日常口语更常说“purple/violet/blue-purple”。","词源上来自“hyacinth（风信子）”，也与古希腊神话中美少年Hyacinthus有关，因此在诗歌里常带有一点古典、抒情的气息。"]}
{"word":"hyacinthlike","summary":{"en":"hyacinth-shaped or hyacinth-scented.","zh":"风信子般的（外形或香气）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hyacinth (the flower), especially in appearance or sometimes in scent.","zh":"像风信子（花）的；（尤指）外形相似，有时也可指气味类似。"},"examples":[{"en":"The garden had clusters of hyacinthlike blooms in soft purple and white.","zh":"花园里成簇的花开得很像风信子，淡紫和白色相间。"},{"en":"A hyacinthlike fragrance drifted through the room from the vase.","zh":"花瓶里飘出一股类似风信子的香气，弥漫在房间里。"},{"en":"The illustrator gave the character a hyacinthlike crown of petals.","zh":"插画师给角色画了一个像风信子一样的花瓣王冠。"}]}],"synonyms":["hyacinthine","hyacinth-like","hyacinth-scented","hyacinth-shaped"],"phonetic":"/haɪˈæsɪnθˌlaɪk/","extraExplanation":["hyacinthlike 常见于描写性语境（园艺、植物学、文学写作或艺术评论），用来强调“外观/气味让人联想到风信子”，并不一定表示它真的是风信子。","相关词 hyacinthine 也可表示“风信子般的/紫蓝色的”，但更偏文学或较少见。"],"etymology":"由 hyacinth（风信子）+ -like（像……一样）构成，字面义就是“像风信子一样的”。","mnemonic":["拆开记：hyacinth（风信子）+ like（像）→“像风信子”。","把它联想成“风信子 + 来客（like≈来客）”——“来客都像风信子一样香/美”。"]}
{"word":"hyacinths","summary":{"en":"Hyacinths are fragrant spring flowers; in myth/literature they can symbolize beauty, youth, and grief.","zh":"Hyacinths 指香味浓郁的春季花卉（风信子）；在神话与文学中也常象征美、青春与哀伤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hyacinths: fragrant spring flowers with dense clusters of small, bell-shaped blooms, often grown in gardens or pots.","zh":"风信子：一种带香味的春季花卉，花朵密集成串（小钟形花），常用于花园或盆栽。"},"examples":[{"en":"The garden was filled with hyacinths in early spring.","zh":"早春时，花园里开满了风信子。"},{"en":"She placed a pot of hyacinths on the windowsill for their sweet scent.","zh":"她把一盆风信子放在窗台上，闻它的甜香。"}]},{"partOfSpeech":"n.","definition":{"en":"(Myth & literature) Hyacinths can also refer to the flower connected with the Greek story of Hyacinthus, often symbolizing beauty, youth, and grief.","zh":"（神话与文学）“风信子”也可指与希腊神话人物 Hyacinthus 相关的花，常象征美、青春与哀伤。"},"examples":[{"en":"In some poems, hyacinths suggest both love and loss.","zh":"在一些诗歌里，风信子既暗示爱情，也暗示失去。"},{"en":"The painting includes hyacinths as a symbol of youth and mourning.","zh":"这幅画把风信子画进去，象征青春与哀悼。"}]}],"synonyms":["spring flowers","bulb flowers"],"phonetic":"/ˈhaɪəˌsɪnθs/","extraExplanation":["发音与拼写提示：单数是 hyacinth，复数加 -s 变成 hyacinths。","文化背景小知识：希腊神话中，Hyacinthus（海辛萨斯）是一位美少年，后来与死亡与哀悼的意象相关，因此“hyacinth/风信子”在部分文学作品中会带有“美丽但短暂、带着悲伤”的联想。","文学提及（便于你拓展阅读）：T. S. Eliot 的《荒原》（The Waste Land）里出现过 “hyacinth” 意象，用来营造记忆、欲望与情感张力。"]}
{"word":"hyacinthus","summary":{"en":"Hyacinthus refers to the hyacinth plant genus and, less commonly, to a Greek mythological youth named Hyacinthus.","zh":"Hyacinthus 可指风信子属植物，也较少见地指希腊神话中的少年海辛瑟斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of spring-flowering plants with fragrant, bell-shaped flowers, commonly called hyacinths","zh":"风信子属（春季开花、香味浓郁、钟形花的植物），常称“风信子”"},"examples":[{"en":"Hyacinthus blooms in early spring and fills the room with a sweet scent.","zh":"风信子在早春开花，让房间充满甜甜的香味。"},{"en":"The gardener planted Hyacinthus bulbs in the fall for spring flowers.","zh":"园丁在秋天种下风信子的球根，等春天开花。"}]},{"partOfSpeech":"n.","definition":{"en":"a youth in Greek mythology loved by Apollo; his death is linked to the hyacinth flower in later stories","zh":"希腊神话中的少年海辛瑟斯（Hyacinthus），相传与阿波罗相爱；其死亡在后世故事中常与风信子花的起源相联系"},"examples":[{"en":"In some retellings, Hyacinthus becomes a symbol of beauty and tragic loss.","zh":"在一些改写版本中，海辛瑟斯象征美与悲剧性的失落。"},{"en":"The poem alludes to Hyacinthus to suggest grief and remembrance.","zh":"这首诗借海辛瑟斯之典，暗示悲伤与追忆。"}]}],"synonyms":["hyacinth (common name)","spring bulb (general term)","Greek myth (context term)"],"phonetic":"/haɪəˈsɪnθəs/","extraExplanation":["“Hyacinthus”既可作植物学上的属名（拉丁学名常用大写），也可指神话人物名（专有名词通常首字母大写）。日常英语里更常见的是“hyacinth”（风信子）这个普通名词。","在文学里，风信子常被用来营造“春天、芬芳、短暂易逝的美”的意象；而神话中的Hyacinthus更常承载“悲剧、悼念、青春易逝”的联想。"]}
{"word":"hyades","summary":{"en":"The Hyades are a nearby star cluster in Taurus; in Greek mythology, they are rain-associated nymphs often mentioned in poetry.","zh":"Hyades 指金牛座附近的毕宿星团；在希腊神话中也指与降雨相关的一群宁芙，常见于诗歌表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a V-shaped open star cluster in the constellation Taurus, near the bright star Aldebaran; it forms the “face” of the bull and is one of the nearest star clusters to Earth.","zh":"位于金牛座、靠近毕宿五（Aldebaran）的V字形疏散星团；常被看作“公牛的脸”，也是距离地球较近的星团之一。"},"examples":[{"en":"On clear winter nights, you can spot the Hyades as a V-shape in Taurus.","zh":"在晴朗的冬夜，你可以在金牛座看到呈V字形的毕宿星团（Hyades）。"},{"en":"Astronomers study the Hyades to learn about how stars age, because it is relatively close to us.","zh":"天文学家研究毕宿星团，因为它离我们较近，有助于了解恒星如何随时间演化。"}]},{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) a group of nymphs associated with rain; their name is sometimes linked with “rainy weather” in older poetry.","zh":"（希腊神话）与降雨相关的一群宁芙（仙女）；在一些古典诗歌里常与“雨季/多雨天气”联系在一起。"},"examples":[{"en":"In mythology, the Hyades were nymphs whose sorrow was said to bring rain.","zh":"在神话中，毕宿星团（Hyades）被说成是会因悲伤而带来降雨的宁芙。"},{"en":"Some poets mention the “rainy Hyades” to suggest a stormy season.","zh":"一些诗人用“多雨的Hyades”来暗示风暴多发的季节。"}]}],"synonyms":["Hyades star cluster","open cluster","Taurus","Aldebaran (nearby)","Pleiades (related, nearby)"],"phonetic":"ˈhaɪəˌdiz","extraExplanation":["“Hyades”在英语里通常当作复数专有名词使用（指一群星/一组宁芙），但在句子里常被当作一个整体来看待。","古典文学中常见“the rainy Hyades（多雨的毕宿星团）”这一说法，用来象征季节性降雨或航海不利的天气；这种联想来自古人把星象与季节天气联系在一起的传统。","容易与另一个著名星团“Pleiades（昴星团）”混淆：两者都在金牛座附近，但Hyades呈V形并靠近毕宿五；Pleiades更像一小团紧密的星点。"]}
{"word":"hyaena","summary":{"en":"A less common spelling of “hyena,” a wild mammal known for strong jaws and a “laughing” call.","zh":"“hyena（鬣狗）”的较少见拼写；指以强壮颚和“笑声”般叫声闻名的野生哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hyena; a wild African (and some Asian) mammal that looks a bit like a dog, known for powerful jaws and loud calls often described as “laughing.”","zh":"鬣狗；一种生活在非洲（及部分亚洲）的野生哺乳动物，外形有点像狗，以强壮的颚和常被形容为“笑声”的叫声而闻名。"},"examples":[{"en":"A hyaena can crush bones with its strong jaws.","zh":"鬣狗可以用强壮的颚咬碎骨头。"},{"en":"In many wildlife documentaries, hyaenas are shown working together to find food.","zh":"在许多野生动物纪录片中，鬣狗常被拍到合作寻找食物。"}]}],"synonyms":["hyena","spotted hyena","striped hyena"],"phonetic":"/haɪˈiːnə/","extraExplanation":["“hyaena”是“hyena”的较少见拼写，多见于英式英语或较旧的写法；现代常用拼写是“hyena”。","在流行文化里，鬣狗有时被误解为“只会捡腐肉吃”，但现实中它们既会食腐也会捕猎；此外，斑鬣狗（spotted hyena）在生态系统中是重要的顶级食肉动物之一。","文学与象征上，“hyena/hyaena”常被用来比喻“残忍、嘲笑他人或贪婪的人”，但这种用法带有强烈贬义色彩，使用时要注意语境与礼貌。"]}
{"word":"hyaena-like","summary":{"en":"resembling a hyena, often in a harsh or predatory way","zh":"像鬣狗般的（常含残忍或趁机围攻之意）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the qualities, appearance, or behavior associated with a hyena (often suggesting scavenging, cruel laughter, or predatory opportunism).","zh":"像鬣狗的；具有鬣狗特征的（常带贬义，暗示拾荒般的、残忍的笑、或趁火打劫式的机会主义）。"},"examples":[{"en":"The villain’s hyaena-like laugh made the room feel colder.","zh":"反派那种像鬣狗一样的笑声让房间里更冷了。"},{"en":"Some tabloids used hyaena-like language, circling the celebrity’s mistakes.","zh":"一些小报用了“鬣狗般”的措辞，围着名人的错误不放。"},{"en":"He felt the crowd grow hyaena-like, eager to watch someone fail.","zh":"他感觉人群变得像鬣狗一样，急着看别人出丑。"}]}],"synonyms":["hyena-like","jackal-like","vulture-like","scavenging","predatory","merciless","cackling"],"phonetic":"/haɪˈiːnə laɪk/","extraExplanation":["语气与用法：多用于比喻，通常带负面评价，强调“残忍、嘲弄、围猎、捡便宜”的感觉，而不只是“长得像”。写作中常见于描写笑声（laugh）、人群（crowd）、媒体（press/tabloids）或目光（gaze）。"],"etymology":"由“hyaena（鬣狗）+ -like（像……一样）”构成的形容词；hyaena 来自拉丁语/希腊语词源，表示一种鬣狗类动物。拼写 hyaena 常见于英式写法；美式更常见 hyena-like。","mnemonic":["记忆法：把它拆开记——hyaena（鬣狗）+ like（像）=“像鬣狗一样”。","联想：鬣狗常被描述为“怪笑、捡食、围攻”，看到 -like 就想到“带有这种气质/行为”。"]}
{"word":"hyaenanche","summary":{"en":"Hyaenanche: a poisonous South African tree, especially noted for toxic seeds.","zh":"Hyaenanche：一种南非有毒树木，尤其以剧毒种子著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South African poisonous tree (Hyaenanche globosa) whose seeds have been used as a strong poison","zh":"一种南非有毒树木（Hyaenanche globosa，常称“鬣狗毒树”），其种子曾被用作强效毒药"},"examples":[{"en":"The hyaenanche is known for its highly poisonous seeds.","zh":"hyaenanche 以其剧毒的种子而闻名。"},{"en":"Historically, people used extracts from hyaenanche as poison.","zh":"历史上，人们曾使用 hyaenanche 的提取物作为毒药。"}]}],"synonyms":["hyena poison tree","Hyaenanche globosa"],"phonetic":"/haɪˈiːnænki/","extraExplanation":["这是一个较少见、偏植物学/历史用语的词，常作为学名属名或俗名出现，指“鬣狗毒树”。阅读资料时也可能看到完整学名 Hyaenanche globosa。","词形看起来与 hyena（鬣狗）有关，常见解释是因为该植物毒性强、与“致命毒药”的联想相关。"]}
{"word":"hyaenarctos","summary":{"en":"Hyaenarctos is an extinct genus of bears known from fossils, named for hyena-like features (especially strong jaws/teeth).","zh":"Hyaenarctos（鬣熊属）是已灭绝的熊科属名，因部分特征（尤其强壮的颌与牙）带有“鬣狗般”的感觉而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of bear-like mammals (family Ursidae) known from fossil remains, often described as a “hyena-bear” because some species had teeth and jaws adapted for strong biting and possibly scavenging.","zh":"鬣熊属：一种已灭绝的熊科（Ursidae）哺乳动物属，主要见于化石记录；常被称为“鬣熊/鬣狗熊”，因为一些物种的牙齿与下颌显示出强咬合力、可能偏向食腐等适应。"},"examples":[{"en":"Fossils of Hyaenarctos help scientists understand how ancient bears evolved different diets.","zh":"鬣熊属（Hyaenarctos）的化石帮助科学家了解古代熊类如何演化出不同的食性。"},{"en":"The museum label compared Hyaenarctos to modern bears but noted its unusually powerful jaws.","zh":"博物馆的说明牌把鬣熊属与现代熊类作比较，但指出它的下颌异常有力。"}]}],"synonyms":["extinct bear genus","ursid (general term)","prehistoric bear (general term)"],"phonetic":"/haɪˌiːnɑrktəs/","extraExplanation":["词源上可拆为 hyaena（鬣狗）+ 希腊语 arktos（熊），因此常见的直译或解释是“鬣狗般的熊/鬣熊”。","这是古生物学与动物学文献中常见的拉丁化属名；在日常英语里很少使用，更多出现在化石、演化与分类学语境中。"]}
{"word":"hyaenas","summary":{"en":"“Hyaenas” means “hyenas,” the plural form of hyena: a wild animal known for group behavior and loud calls.","zh":"“hyaenas”就是“hyenas”的另一种拼写，表示“鬣狗”的复数：一种常成群活动、叫声响亮的野生动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “hyena,” a wild mammal (dog-like in shape) known for living and hunting/scavenging in groups, especially in Africa and parts of Asia.","zh":"“hyena（鬣狗）”的复数。鬣狗是一种野生哺乳动物，外形有点像犬类，常成群活动与捕猎/食腐，主要分布在非洲及亚洲部分地区。"},"examples":[{"en":"Hyaenas are often heard at night, making loud whooping calls.","zh":"晚上常能听到鬣狗的声音，它们会发出响亮的“呼呼”叫声。"},{"en":"In the documentary, a group of hyaenas followed the lions from a distance.","zh":"在纪录片里，一群鬣狗远远地跟着狮子。"}]}],"synonyms":["hyenas"],"phonetic":"/haɪˈiːnəz/","extraExplanation":["“hyaena”与更常见的拼写“hyena”意思相同；“hyaena”多见于英式拼写或较正式/学术语境。","在一些文化作品中，“hyena/hyaenas”常被用作比喻，指“贪婪、爱嘲笑、趁火打劫的人”。这种用法带有贬义，使用时要注意语境与礼貌。"]}
{"word":"hyaenic","summary":{"en":"Hyaenic means “related to hyenas,” and it can also be used figuratively to describe cruel or scavenging behavior.","zh":"hyaenic 表示“与鬣狗有关的”，也可作比喻形容“残忍、趁火打劫/掠夺性的”行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of a hyena.","zh":"与鬣狗有关的；具有鬣狗特征的。"},"examples":[{"en":"The researchers described a hyaenic call used to coordinate the pack.","zh":"研究人员描述了一种用来协调群体行动的鬣狗式叫声。"},{"en":"Tracks around the camp suggested hyaenic activity during the night.","zh":"营地周围的足迹显示夜里有鬣狗出没。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, often negative) Cruel, scavenging, or predatory in a way people associate with hyenas.","zh":"（比喻，常含贬义）像鬣狗一样残忍、趁火打劫或掠夺性的。"},"examples":[{"en":"The article criticized the tabloids for their hyaenic pursuit of grief.","zh":"那篇文章批评小报对悲痛的“鬣狗式”追逐。"},{"en":"Some people saw the company’s behavior as hyaenic after the disaster.","zh":"灾难发生后，有人认为那家公司趁机牟利的做法很“鬣狗”。"}]}],"synonyms":["hyena-like","scavenging","predatory","rapacious"],"phonetic":"/haɪˈiːnɪk/","extraExplanation":["“hyaenic”来自“hyena（鬣狗）”，多用于较正式或文学性的描写；日常更常见的形容词是“hyena-like（像鬣狗的）”。","比喻义在英语里常带强烈评价色彩，用来批评“冷酷围观、趁人之危、掠夺性”的行为；使用时注意场合与语气。"]}
{"word":"hyaenid","summary":{"en":"A formal/scientific word meaning a hyena or a member of the hyena family; also an adjective meaning “related to hyenas.”","zh":"较正式/科学的词，指鬣狗或鬣狗科成员；也可作形容词，表示“与鬣狗（科）有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hyena or any animal in the hyena family (Hyaenidae).","zh":"鬣狗；或指鬣狗科（Hyaenidae）的动物。"},"examples":[{"en":"Spotted hyenas are the best-known hyaenids in Africa.","zh":"斑鬣狗是非洲最广为人知的鬣狗科动物。"},{"en":"The documentary compares cats, dogs, and hyaenids.","zh":"这部纪录片比较了猫科、犬科和鬣狗科动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to hyenas or the hyena family.","zh":"与鬣狗或鬣狗科有关的；鬣狗科的。"},"examples":[{"en":"Researchers described a hyaenid skull found at the site.","zh":"研究人员描述了在遗址发现的一具鬣狗科动物头骨。"},{"en":"The museum has a section on hyaenid evolution.","zh":"博物馆有一个关于鬣狗科演化的展区。"}]}],"synonyms":["hyena"],"phonetic":"/ˈhaɪəˌnɪd/","extraExplanation":["“hyaenid”常用于科学写作（动物学、古生物学），比日常用的“hyena”更正式，强调“鬣狗科”这一分类层级。","拼写来自拉丁化的科名 Hyaenidae（鬣狗科）；因此它既可指“某一种鬣狗”，也可泛指“鬣狗科成员”。"]}
{"word":"hyaenidae","summary":{"en":"Hyaenidae is the animal family that includes all hyenas (and the aardwolf).","zh":"Hyaenidae 指“鬣狗科”，包含所有鬣狗（以及土狼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the biological family that includes hyenas (such as the spotted hyena, striped hyena, brown hyena, and the aardwolf).","zh":"鬣狗科（生物分类中的一个“科”，包含斑鬣狗、条纹鬣狗、褐鬣狗以及土狼等）。"},"examples":[{"en":"The spotted hyena is a well-known member of Hyaenidae.","zh":"斑鬣狗是鬣狗科中最知名的成员之一。"},{"en":"Researchers compared the hunting behavior of Hyaenidae with that of large cats.","zh":"研究人员把鬣狗科动物的捕猎行为与大型猫科动物作了比较。"}]}],"synonyms":["hyena family"],"phonetic":"/haɪˈiːnədi/","extraExplanation":["“Hyaenidae”是拉丁化的动物分类名称，常用于学术写作或纪录片解说中；日常英语里更常说“hyenas（鬣狗）”。","虽然鬣狗外形有点像狗，但它们并不属于犬科（Canidae）；在演化关系上，鬣狗科与猫科同属食肉目（Carnivora）中的猫型亚目（Feliformia）。"]}
{"word":"hyaeniform","summary":{"en":"hyena-like; related to hyenas in scientific description.","zh":"鬣狗般的；（学术用法）与鬣狗类群有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hyena-like in appearance or characteristics.","zh":"像鬣狗的；具有鬣狗特征的。"},"examples":[{"en":"The artist gave the creature a hyaeniform head and powerful jaws.","zh":"艺术家给这个生物画上了鬣狗般的头部和强壮的下颚。"},{"en":"Its hyaeniform posture made it look both wary and ready to scavenge.","zh":"它鬣狗式的姿态让它看起来既警惕又随时准备拾荒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the mammal group that includes hyenas and their close relatives (used in scientific classification).","zh":"（生物分类用语）与鬣狗及其近亲类群有关的。"},"examples":[{"en":"Some papers discuss hyaeniform traits in the fossil record of carnivorous mammals.","zh":"一些论文讨论了食肉哺乳动物化石记录中的“鬣狗类”特征。"},{"en":"The specimen was compared with other hyaeniform carnivorans for identification.","zh":"为鉴定该标本，研究者把它与其他鬣狗类食肉动物作了比较。"}]}],"synonyms":["hyena-like","hyenoid"],"phonetic":"/haɪˈiːnəˌfɔrm/","extraExplanation":["在动物学里，你可能会看到更具体的分类名如 Hyaeniformia（鬣狗形类/鬣狗下目一类的名称，具体层级依不同分类体系而异）。日常英语中这个词很少见，更多出现在学术写作、化石研究或形态描述中。"],"etymology":"由“hyaena（鬣狗）+ -form（……形状的）”构成，字面意思是“鬣狗形的/像鬣狗的”。","mnemonic":["把它拆开记：hyaena（鬣狗）+ form（形状）＝“鬣狗的形状/鬣狗样”。"]}
{"word":"Hyaenodon","summary":{"en":"an extinct, hyena-like predatory mammal genus","zh":"一种已灭绝、外形类似鬣狗的掠食性哺乳动物属"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of large, meat-eating mammals that lived millions of years ago; often described as “hyena-like,” though not closely related to modern hyenas","zh":"一种已灭绝的大型食肉哺乳动物属，生活在数千万年前；常被形容为“像鬣狗”，但与现代鬣狗并非近亲"},"examples":[{"en":"Fossils of Hyaenodon have been found in parts of North America, Europe, and Asia.","zh":"Hyaenodon 的化石在北美、欧洲和亚洲的部分地区都有发现。"},{"en":"In the museum, the Hyaenodon skull showed strong jaws adapted for hunting.","zh":"在博物馆里，Hyaenodon 的头骨展示出为捕猎而适应的强壮颌骨。"}]}],"synonyms":["hyaenodont"],"phonetic":"/haɪˈiːnəˌdɑn/","extraExplanation":["它属于“鬣齿兽类”（Hyaenodonta，已灭绝的一支食肉哺乳动物），并不是现代食肉目（如猫、狗、鬣狗）的成员。之所以常被叫“像鬣狗”，主要是外形与生态位相似，而非亲缘关系很近。","在学术或科普文本里，这个词通常用于古生物学、博物馆展品说明、化石研究等语境。"],"etymology":"源自新拉丁语（科学命名）：hyaena（“鬣狗”）+ 希腊语 -odon / odous（“牙齿”）。字面意思接近“鬣狗的牙”。用于强调其显著的牙齿与食肉特征。","mnemonic":["拆开记：hyaena（鬣狗）+ odon（牙齿）→ “鬣狗的牙” → 联想到“牙很厉害的远古食肉兽”。","-odon 常见于“牙”的命名里（如 mastodon 乳齿象），看到 -odon 就想到“牙齿相关”。"]}
{"word":"hyaenodon","summary":{"en":"Hyaenodon is an extinct predatory mammal known from fossils; despite its name, it wasn’t a true hyena.","zh":"Hyaenodon（鬣齿兽）是一种已灭绝的化石食肉哺乳动物；尽管名字像“鬣狗”，但并不是真正的鬣狗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct carnivorous mammal (genus Hyaenodon) that lived millions of years ago and hunted other animals; it was not a true hyena, though its name suggests it.","zh":"一种已灭绝的食肉哺乳动物（鬣齿兽属 Hyaenodon），生活在数千万年前并捕食其他动物；它并不是真正的鬣狗，尽管名字看起来像。"},"examples":[{"en":"Fossils of Hyaenodon have been found in North America, Europe, and Asia.","zh":"人们在北美、欧洲和亚洲都发现过鬣齿兽（Hyaenodon）的化石。"},{"en":"The museum exhibit compared Hyaenodon with later predators to show how carnivores evolved.","zh":"博物馆展览把鬣齿兽（Hyaenodon）和更晚期的捕食者作比较，以展示食肉动物如何演化。"}]}],"synonyms":["Hyaenodon (genus name)","hyaenodont (related group term)"],"phonetic":"/haɪˈiːnəˌdɑn/","extraExplanation":["“Hyaenodon”源自希腊语，字面意思类似“鬣狗的牙齿”，指它的牙齿形态让早期学者联想到鬣狗；但它属于与现代食肉目（猫、狗、熊等）不同的一支古老类群（常称“鬣齿兽类/鬣齿兽目”，英文常见 hyaenodonts 或 Hyaenodonta）。","中文里常见译名是“鬣齿兽”。在科普或学术语境中，通常会保留拉丁学名 Hyaenodon 来避免与“鬣狗（hyena）”混淆。"]}
{"word":"hyaenodont","summary":{"en":"An extinct prehistoric carnivorous mammal known from fossils; a member of the order Hyaenodonta.","zh":"一种已灭绝的史前食肉哺乳动物（鬣齿兽目），主要通过化石为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prehistoric, extinct carnivorous mammal from the order Hyaenodonta, known from fossils (especially in Africa, Europe, Asia, and North America).","zh":"鬣齿兽（或“鬣齿兽类”）：一种已灭绝的史前食肉哺乳动物，属于鬣齿兽目（Hyaenodonta），主要通过化石为人所知，分布曾遍及非洲、欧洲、亚洲和北美。"},"examples":[{"en":"Scientists found hyaenodont fossils in rock layers dating to the Eocene.","zh":"科学家在可追溯到始新世的岩层中发现了鬣齿兽化石。"},{"en":"A hyaenodont was a top predator long before modern cats and dogs became common.","zh":"在现代猫科和犬科动物普遍出现之前，鬣齿兽曾是顶级捕食者之一。"}]}],"synonyms":["hyaenodontid","member of Hyaenodonta","(older/looser) creodont"],"phonetic":"/haɪˈiːnəˌdɑnt/","extraExplanation":["“hyaenodont”由“hyaena（鬣狗）”+“-odont（牙齿）”构成，名字强调其牙齿形态与食肉习性，但它们并不是现代鬣狗的直接祖先。","鬣齿兽类常被拿来和已废弃的旧分类“creodont（古食肉类）”相关联；现代研究多将它们独立归为鬣齿兽目（Hyaenodonta）。"]}
{"word":"hyaenodontid","summary":{"en":"an extinct carnivorous mammal of the Hyaenodontidae family","zh":"鬣齿兽科的一种已灭绝食肉哺乳动物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an extinct family of carnivorous mammals (Hyaenodontidae) that lived mainly in the Paleogene period","zh":"鬣齿兽科（Hyaenodontidae）的一员；一种已灭绝的食肉类哺乳动物（主要生活在古近纪）"},"examples":[{"en":"Fossils of a hyaenodontid were found in rock layers dated to the Eocene.","zh":"在可追溯到始新世的岩层中发现了鬣齿兽科动物的化石。"},{"en":"Researchers compare hyaenodontids with early carnivorans to understand how meat-eating mammals evolved.","zh":"研究者把鬣齿兽科动物与早期食肉目动物对比，以理解食肉哺乳动物的演化。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to hyaenodontids or their family (Hyaenodontidae)","zh":"与鬣齿兽科动物或鬣齿兽科（Hyaenodontidae）有关的"},"examples":[{"en":"The museum displayed a hyaenodontid skull next to other prehistoric predators.","zh":"博物馆将一件鬣齿兽科动物的头骨与其他史前掠食者并列展出。"},{"en":"This paper discusses hyaenodontid diversity in North Africa.","zh":"这篇论文讨论北非鬣齿兽科动物的多样性。"}]}],"synonyms":["hyaenodont","Hyaenodontidae member","hyaenodontid mammal"],"phonetic":"/haɪˌiːnəˈdɑːntɪd/","extraExplanation":["鬣齿兽科动物是已灭绝的掠食性哺乳动物类群，曾在非洲、欧亚和北美出现；它们并不属于现代的“食肉目”（如猫、狗、鬣狗），而是较早分化的一支。","在科普或论文里常与“carnivorans（食肉目动物）”对比：两者都吃肉，但亲缘关系不同，属于不同演化支系。"],"etymology":"来自“hyaena（鬣狗）+ odon/odont-（希腊语：牙齿）+ -id（表示某类生物成员）”。名称强调它们“像鬣狗一样的牙齿/咬合特征”，但并不等同于现代鬣狗。","mnemonic":["把它拆开记：hyaena（鬣狗）+ odont（牙）→ “像鬣狗的牙齿的那类动物”。","-id 常见于生物分类表示“……的一员”（如 felid 猫科动物），所以 hyaenodontid 就是“鬣齿兽科的一员”。"]}
{"word":"hyaenodontoid","summary":{"en":"Hyaenodontoid refers to an extinct group of carnivorous mammals (or a member of that group) known from fossils, especially in the Paleogene.","zh":"hyaenodontoid 指鬣齿兽类这一已灭绝的食肉哺乳动物类群（或其中成员），常见于古近纪化石研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) An extinct carnivorous mammal belonging to the group Hyaenodontoidea (often treated as part of the larger clade Hyaenodonta), known from the Paleogene period.","zh":"（名词）鬣齿兽类群（Hyaenodontoidea；常被归入更大的鬣齿兽类 Hyaenodonta）中的一种已灭绝食肉哺乳动物，主要见于古近纪化石记录。"},"examples":[{"en":"Fossils show that some hyaenodontoids were top predators in their ecosystems.","zh":"化石显示，一些鬣齿兽类在其生态系统中曾是顶级捕食者。"},{"en":"The museum’s new exhibit features a reconstructed hyaenodontoid skull.","zh":"博物馆的新展览展示了一具复原的鬣齿兽类头骨。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Relating to or characteristic of Hyaenodontoidea / Hyaenodonta.","zh":"（形容词）与鬣齿兽类（Hyaenodontoidea / Hyaenodonta）有关的；具有鬣齿兽类特征的。"},"examples":[{"en":"Researchers compared hyaenodontoid teeth with early carnivoran teeth.","zh":"研究人员将鬣齿兽类的牙齿与早期食肉目动物的牙齿进行了比较。"},{"en":"The paper discusses hyaenodontoid diversity in Africa and Eurasia.","zh":"论文讨论了非洲与欧亚大陆鬣齿兽类的多样性。"}]}],"synonyms":["hyaenodont"],"phonetic":"/haɪˈiːnəˌdɑnˌtɔɪd/","extraExplanation":["“hyaenodontoid”来自“hyaena（鬣狗）+ odont（牙齿）”，因为这类动物的牙齿形态在早期研究中让人联想到鬣狗，但它们并不是现代鬣狗或现代食肉目（Carnivora）的成员。","学术写作中常见于古生物学与系统分类学语境；不同作者可能把 Hyaenodontoidea 当作“超科/类群”，或直接使用更常见的“hyaenodont（鬣齿兽）”来指代相关成员。"]}
{"word":"hyahya","summary":{"en":"“Hyahya” isn’t standard English; it’s likely a name/username or a misspelling (e.g., “Yahya”).","zh":"“Hyahya”不是标准英语词；多半是人名/用户名或误拼（如“Yahya”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often used as a personal name, username, or a misspelling/variant of a name (for example, “Yahya”).","zh":"不是标准英语词；更常见于人名、用户名，或作为姓名的误拼/变体（例如“Yahya”）。"},"examples":[{"en":"Hyahya is the name on my gaming account.","zh":"Hyahya 是我游戏账号上的名字。"},{"en":"I’m not sure how to pronounce “Hyahya”—is it a name?","zh":"我不确定“Hyahya”怎么读——这是个名字吗？"}]}],"synonyms":["(no direct synonyms)"],"phonetic":"/haɪˈjɑːjɑː/","extraExplanation":["“Hyahya”在英语词典里通常找不到，可能是：1）你想写“Yahya”（常见阿拉伯男性名，对应《圣经》里的 John the Baptist/施洗约翰）；2）你想写“hiya”（口语里表示“hi”，=你好）；3）网络ID的自造拼写。","如果你告诉我它来自哪里（人名/歌名/游戏ID/你想表达“你好”等），我可以给出更准确的读音、含义和更贴切的例句。"]}
{"word":"Hyakinthia","summary":{"en":"an ancient Spartan festival honoring Hyacinthus and Apollo","zh":"古斯巴达纪念海亚金托斯与阿波罗的节日"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Spartan (Greek) festival held in honor of Hyacinthus and Apollo, traditionally celebrated at Amyclae near Sparta","zh":"古希腊斯巴达的“海亚金西亚节”（Hyakinthia/Hyacinthia），纪念海亚金托斯（Hyacinthus）与阿波罗（Apollo），传统上在斯巴达附近的阿密克莱（Amyclae）举行"},"examples":[{"en":"The Hyakinthia was one of Sparta’s most important annual religious festivals.","zh":"海亚金西亚节是斯巴达一年中最重要的宗教节庆之一。"},{"en":"Some accounts describe the Hyakinthia as moving from mourning to celebration over several days.","zh":"一些记载把海亚金西亚节描写为在数天内由哀悼逐渐转向庆祝。"},{"en":"In a study of Spartan culture, the Hyakinthia is often discussed alongside festivals dedicated to Apollo.","zh":"在研究斯巴达文化时，海亚金西亚节常与其他敬奉阿波罗的节日一起讨论。"}]}],"synonyms":["Hyacinthia","Festival of Hyacinthus"],"phonetic":"/ˌhaɪəˈkɪnθiə/","extraExplanation":["这是一个与斯巴达地方传统紧密相关的节日，地点通常指向阿密克莱（Amyclae）的阿波罗圣所。","古代资料常提到节期不止一天：早期部分带有哀悼海亚金托斯的色彩，随后转入敬奉阿波罗的宴饮与庆典。具体细节因来源不同而有差异。","在英文文献里，Hyakinthia 多见于古典学、希腊宗教与斯巴达社会史的讨论中，属于较学术的专名用词。"],"etymology":"源自古希腊语 Ὑακίνθια（Hyakinthia），字面意思是“与海亚金托斯有关的节庆/仪式”。Hyacinthus（海亚金托斯）是希腊神话中的美少年，与阿波罗的故事相关；该节名后来以拉丁化/英语化形式进入学术写作中，也常见拼写 Hyacinthia。","mnemonic":["把它拆成 “Hyakinth- + -ia”：前半段联想到 Hyacinth（风信子/海亚金托斯），后缀 -ia 常用于“节日/事务/地点”的名词——记成“风信子（海亚金托斯）的节”。","联想中文：海亚金托斯 → 风信子（hyacinth）→ 节日 Hyakinthia：‘风信子节’（但实际是神话人物与阿波罗的祭典）。"]}
{"word":"hyakume","summary":{"en":"A Japanese-derived term meaning “100 monme,” an old unit of weight used mainly in historical contexts.","zh":"源自日语的词，意为「一百匁」，日本旧重量单位，主要用于历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"hyakume (from Japanese 百目) is a Japanese term meaning “one hundred monme,” an old unit of weight. (Example: “The pearl was described as hyakume in old records.”)","zh":"hyakume（源自日语「百目」）指「一百匁（monme）」，是日本旧时的重量单位。（例： “在旧记录里，那颗珍珠被描述为 hyakume 的重量。”）"},"examples":[{"en":"Old documents sometimes record pearl or silver weights in hyakume.","zh":"旧文献有时会用 hyakume 来记录珍珠或白银的重量。"},{"en":"hyakume is not common in modern English; it usually appears in historical contexts.","zh":"hyakume 在现代英语中不常见，多出现在历史语境里。"}]}],"synonyms":["monme (related unit)","traditional Japanese weight unit"],"phonetic":"/hjɑˈkuːmeɪ/","extraExplanation":["「匁（monme）」是日本江户时期以来常见的传统重量单位之一，1匁约等于3.75克，因此「百目（hyakume）」约等于375克左右（具体换算会因历史时期与使用领域略有差异）。","在英语文本中，hyakume 通常作为外来词出现，多见于历史、古董、珠宝/珍珠贸易或日本度量衡相关的说明；现代日本日常更常用克（g）等公制单位。"]}
{"word":"hyal","summary":{"en":"Hyal- is a scientific prefix meaning “glassy/transparent,” found in words like “hyaline” and “hyaluronic acid.”","zh":"hyal- 是一个科学词根/前缀，表示“玻璃样/透明”，常见于 hyaline、hyaluronic acid 等词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix/combining form meaning “glassy” or “transparent,” used in scientific words related to hyaline tissue or hyaluronic acid","zh":"表示“玻璃样的、透明的”的前缀/词根，用于科学术语中，常与“透明软骨（hyaline）”或“透明质酸（hyaluronic acid）”相关"},"examples":[{"en":"Hyal- appears in words like hyaline cartilage.","zh":"hyal- 常见于诸如 hyaline cartilage（透明软骨）这样的词里。"},{"en":"Many skincare products mention hyaluronic acid (built from hyal-).","zh":"很多护肤品会写 hyaluronic acid（透明质酸，含 hyal- 这个词根）。"}]}],"synonyms":["hyaline- (related form in some terms)"],"phonetic":"ˈhaɪəl","extraExplanation":["“hyal-”源自希腊语 hýalos，意思是“玻璃”。因此它经常出现在医学/生物学词汇中，表达“玻璃样、透明”的概念。","常见相关词：hyaline（玻璃样的/透明的）、hyaluronan/hyaluronic acid（透明质酸/玻尿酸）、hyalitis（玻璃体炎，眼科用语）。","日常英语里几乎不会单独使用“hyal”，更多是作为构词成分出现。"]}
{"word":"hyalescence","summary":{"en":"Hyalescence means a glassy, clear, translucent appearance, often in medical/scientific descriptions.","zh":"Hyalescence 指玻璃样、清澈或半透明的外观，多用于医学/科学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a glassy, translucent, or clear appearance; the quality of looking like glass (often used in medical or scientific writing).","zh":"玻璃样外观；（类似玻璃的）半透明、清澈的性质（常见于医学或科学语境）。"},"examples":[{"en":"Under the microscope, the tissue showed hyalescence along the vessel wall.","zh":"在显微镜下，血管壁旁的组织呈现玻璃样外观。"},{"en":"The report noted areas of hyalescence, suggesting a hyaline change.","zh":"报告提到一些玻璃样区域，提示可能存在透明样变。"}]}],"synonyms":["glassiness","translucency","glassy appearance","hyalinity"],"phonetic":"/ˌhaɪəˈlɛsəns/","extraExplanation":["“hyalescence”来自词根“hyal-”（与玻璃或透明相关，源自希腊语 hýalos “玻璃”）。在病理学里常与“hyaline（透明样的/玻璃样的）”一起出现，描述组织因蛋白沉积等原因而呈现均匀、粉红、像玻璃一样的外观。","日常英语中更常用的表达是“glassy appearance / translucency / glassiness”。“hyalescence”属于偏学术、少见词。"]}
{"word":"hyalescent","summary":{"en":"Hyalescent means glass-like—clear, transparent, or delicately translucent.","zh":"Hyalescent 指“玻璃般的”，形容清澈透明或晶莹的半透明感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Glass-like; clear, transparent, or lightly translucent (often with a watery or crystal look).","zh":"玻璃般的；清澈透明或半透明的（常带水润、晶莹的感觉）。"},"examples":[{"en":"The lake looked hyalescent at dawn, reflecting the pale sky.","zh":"黎明时分，湖面晶莹通透，映着淡淡的天空。"},{"en":"She wore a hyalescent pendant that caught the light softly.","zh":"她戴着一枚通透的吊坠，柔和地映着光。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary/scientific) Resembling the vitreous humor of the eye or a smooth, glassy surface.","zh":"（文学/科学）类似眼球玻璃体的；呈光滑的玻璃质表面。"},"examples":[{"en":"Under the microscope, the tissue appeared hyalescent.","zh":"在显微镜下，这些组织呈现出玻璃样的透明感。"}]}],"synonyms":["transparent","translucent","glassy","crystalline","hyaline","clear"],"phonetic":"/ˌhaɪ.əˈlɛs.ənt/","extraExplanation":["“hyalescent”较少见，多用于文学描写、自然观察（如水面、雾气、宝石）或科学语境。它强调“玻璃般的清透/晶莹”，比常见的 transparent 更有画面感。","词源来自希腊语 hýalos（玻璃、晶体），与 hyaline（玻璃样的）同源；在生物/医学里，hyaline 常用来形容“玻璃样软骨/组织”。"]}
{"word":"hyalin","summary":{"en":"Hyalin is a clear structural protein, especially noted in sea urchin eggs after fertilization.","zh":"Hyalin 指一种透明的结构蛋白，尤其常见于海胆受精卵中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a clear, glassy (gel-like) structural protein found especially in the fertilized eggs of sea urchins and some other animals; it helps form a protective layer and supports early development.","zh":"（生物）透明、玻璃样（凝胶状）的结构蛋白，常见于海胆等动物的受精卵中；有助于形成保护层并支持早期发育。"},"examples":[{"en":"After fertilization, hyalin helps create a protective layer around the sea urchin egg.","zh":"受精后，hyalin 会帮助在海胆卵周围形成一层保护层。"},{"en":"In the lab, students observed a hyalin layer forming on the egg surface under the microscope.","zh":"在实验室里，学生在显微镜下观察到卵表面形成了 hylain（hyalin）层。"}]}],"synonyms":["hyaline protein","vitelline layer component (context-dependent)"],"phonetic":"/ˈhaɪəlɪn/","extraExplanation":["词源上与希腊语 *hyalos*（“玻璃”）有关，因此常带有“透明、玻璃样”的感觉。","容易和 **hyaline**（adj./n. 玻璃样的；透明软骨样组织）混淆：**hyalin**更常用作生物学名词，指特定的蛋白/物质；而 **hyaline**更常用来描述“玻璃样的、透明的”。"]}
{"word":"hyaline","summary":{"en":"Hyaline means glass-like and clear, and in biology it also describes tissue with a smooth, glassy look under a microscope.","zh":"hyaline 意为“玻璃样清澈、透明的”，在生物学中也指显微镜下呈均质、玻璃样外观的组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clear and glass-like; transparent or nearly transparent.","zh":"透明的；像玻璃一样清澈的。"},"examples":[{"en":"The insect’s wings looked hyaline in the sunlight.","zh":"那只昆虫的翅膀在阳光下看起来晶莹透明。"},{"en":"A hyaline layer of ice covered the puddle.","zh":"一层清澈如玻璃的薄冰覆盖在水坑上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Describing tissue or material that looks smooth, homogeneous, and glassy under a microscope (e.g., hyaline cartilage).","zh":"（生物/医学）指在显微镜下呈均质、光滑、玻璃样外观的组织或物质（如透明软骨）。"},"examples":[{"en":"Hyaline cartilage supports the nose and parts of the airway.","zh":"透明软骨支撑鼻部和部分气道。"},{"en":"The report mentioned hyaline change in the tissue.","zh":"报告提到该组织出现了玻璃样变。"}]}],"synonyms":["transparent","translucent","glassy","clear","crystalline"],"phonetic":"/ˈhaɪəˌlaɪn/","extraExplanation":["词源来自希腊语 hýalos（“玻璃”）。因此 hyaline 常用来强调“清澈、玻璃般的质感”，在生物学和医学里则更偏向描述“在显微镜下看起来均匀、玻璃样”的外观。","在自然书写与文学描写中，hyaline 有时用于营造“冷冽、清透、脆弱”的意象（例如冰、薄雾、翅膜等），比 plain 的 “transparent” 更有画面感。"]}
{"word":"hyalines","summary":{"en":"“Hyalines” usually means “glassy/transparent,” or the plural of “hyaline” in scientific writing, referring to hyaline substances/structures.","zh":"“hyalines”通常表示“玻璃样的、透明的”，或作为“hyaline”的复数用于科研语境，指玻璃样物质/结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Glassy, clear, or transparent (often used in biology or medicine).","zh":"玻璃样的；透明的；清澈的（常用于生物学或医学语境）。"},"examples":[{"en":"Under the microscope, the tissue showed hyaline (glassy) areas.","zh":"在显微镜下，这种组织呈现出透明的玻璃样区域。"},{"en":"The report mentioned hyaline cartilage in the joint.","zh":"报告提到了关节中的透明软骨。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of “hyaline”; can refer to hyaline substances or hyaline structures seen in tissue (scientific usage).","zh":"“hyaline”的复数；在科学语境中可指玻璃样物质或玻璃样结构。"},"examples":[{"en":"Pathology notes described scattered hyalines in the sample.","zh":"病理记录描述样本中散在的玻璃样物质。"},{"en":"The slide contained several hyalines that looked like clear droplets.","zh":"载玻片上有几处玻璃样结构，看起来像透明的小液滴。"}]}],"synonyms":["glassy","transparent","clear","translucent"],"phonetic":"/ˈhaɪəlaɪnz/","extraExplanation":["“hyaline”来自希腊语词根，意思与“玻璃”相关，所以常用来描述“像玻璃一样透明/半透明”的外观。","医学里常见搭配：hyaline cartilage（透明软骨，覆盖在关节表面）、hyaline degeneration（玻璃样变，指组织出现玻璃样改变的描述性术语）。","你输入的“hyalines”多见于科研/病理记录，表示复数；日常英语里更常直接用“hyaline”作形容词。"]}
{"word":"hyalinise","summary":{"en":"to undergo or cause glassy (hyaline) change in tissue","zh":"（组织）发生或导致玻璃样改变/变性"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Pathology) To become glassy and translucent (hyaline), especially in tissue; to undergo hyaline change.","zh":"（病理）变成玻璃样、半透明的（玻璃样变性）；组织发生玻璃样改变。"},"examples":[{"en":"With chronic injury, small blood vessels may hyalinise and become less flexible.","zh":"长期损伤后，小血管可能会发生玻璃样变性，变得不那么有弹性。"},{"en":"In some diseases, the walls of arterioles can gradually hyalinise.","zh":"在某些疾病中，小动脉壁可能会逐渐发生玻璃样变性。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Pathology) To cause tissue to become hyaline; to make something take on a glassy, hyaline appearance.","zh":"（病理）使组织呈玻璃样；使某物变得玻璃样、半透明。"},"examples":[{"en":"Prolonged inflammation can hyalinise the surrounding connective tissue.","zh":"长期炎症可能使周围结缔组织发生玻璃样变性。"},{"en":"The deposits can hyalinise the vessel wall over time.","zh":"这些沉积物久而久之会使血管壁发生玻璃样改变。"}]}],"synonyms":["hyalinize","glassify","vitrify"],"phonetic":"/ˈhaɪəˌlaɪnˌaɪz/","extraExplanation":["这是医学/病理学用词，常见于“hyalinise/hyalinize + tissue/vessel wall/arteriole”等搭配，用来描述组织在显微镜下呈均质、粉红、像玻璃一样的外观（即玻璃样变性）。","拼写提示：英式常用 hyalinise；美式常用 hyalinize。含义相同。"],"etymology":"源自希腊语 hýalos（“玻璃”），经由 hyaline（“玻璃样的”）+ 英式拼写后缀 -ise（美式常写作 -ize）；医学上用来描述组织出现“玻璃样”外观的变化。","mnemonic":["联想“hyal-≈hyaline＝玻璃样”，-ise 表“使……变成/变得”，合起来就是“使变玻璃样/变得玻璃样”。","把 hyal 想成“还要亮”(谐音梗：更亮更“像玻璃”)，记住与“透明、玻璃样”相关。"]}
{"word":"hyalinised","summary":{"en":"having a glassy, hyaline change in tissue","zh":"组织呈玻璃样变"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Pathology, histology) Turned into a smooth, glassy, pale (hyaline) material; showing hyaline change.","zh":"（病理/组织学）发生“玻璃样变”的；呈均质、透明/淡粉、像玻璃一样的改变。"},"examples":[{"en":"The biopsy showed hyalinised collagen in the scar tissue.","zh":"活检显示瘢痕组织中的胶原出现玻璃样变。"},{"en":"Small arteries may become thickened and hyalinised in long-term hypertension.","zh":"长期高血压时，小动脉可能增厚并发生玻璃样变。"}]},{"partOfSpeech":"other","definition":{"en":"Past participle of a rare verb meaning “to make or become hyaline.”","zh":"（罕见动词的过去分词）意为“使/变成玻璃样（透明均质）”。"},"examples":[{"en":"The tissue was described as hyalinised in the pathology report.","zh":"病理报告把该组织描述为发生了玻璃样变。"}]}],"synonyms":["hyalinized","glassy","hyaline"],"phonetic":"/ˈhaɪəˌlaɪnˌaɪzd/","extraExplanation":["在病理学里，hyalinised 常用来形容组织（如血管壁、胶原、肾小球等）出现“玻璃样变”：显微镜下看起来均质、淡粉、半透明，像玻璃一样。这是一种形态学描述，不等同于“透明软骨（hyaline cartilage）”，但两者都共享“玻璃样”的词源含义。"],"etymology":"来自 hya- / hyal-（源自希腊语 hyalos“玻璃”）+ -ine（形容词后缀，表示“……样的”）+ -ise/-ize（使……化），hyalinised 为英式拼写，对应美式 hyalinized。","mnemonic":["把 hyaline 记成“海盐（hǎi yán）一样晶亮透明”→ 玻璃样。","-ised ≈“已……化”：hyalinised = “已经玻璃样化了”。"]}
{"word":"hyalinity","summary":{"en":"glassy transparency; a hyaline, clear appearance","zh":"玻璃般的清澈透明感；玻璃样外观"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being glass-like—very clear, transparent, or delicately translucent","zh":"玻璃般的清澈感；透明或半透明的性质"},"examples":[{"en":"The poet described the morning air with a kind of hyalinity, as if the world were made of glass.","zh":"诗人把清晨的空气写得很“玻璃般清澈”，仿佛世界由玻璃构成。"},{"en":"Under the microscope, the tissue showed hyalinity in certain areas.","zh":"在显微镜下，这些组织的某些区域呈现出透明样的性质。"}]},{"partOfSpeech":"n.","definition":{"en":"in medicine/biology, a glassy, hyaline appearance in cells or tissues (often describing a specific pathological change)","zh":"（医学/生物）细胞或组织呈“玻璃样/透明样（hyaline）”外观的状态（常用于描述某种病理改变）"},"examples":[{"en":"The report noted hyalinity of the vessel walls.","zh":"报告中提到血管壁出现玻璃样改变。"},{"en":"Pathologists sometimes use the term hyalinity to describe glassy deposits seen in tissue sections.","zh":"病理学家有时用“hyalinity”来描述切片中可见的玻璃样沉积。"}]}],"synonyms":["transparency","clarity","lucidity","pellucidity","hyaline appearance"],"phonetic":"/ˌhaɪ.əˈlɪn.ə.ti/","etymology":"源自希腊语 hýalos（“玻璃”），经由 hyaline（“玻璃样的、透明的”）+ -ity（名词后缀，表示“性质/状态”）构成，强调“像玻璃一样的透明感”。","mnemonic":["把它拆开记：hyal-≈hyaline（玻璃样的）+ -ity（性质）→“玻璃样的性质”。","联想“海蓝（hya-）很清澈”，清澈到像玻璃：hyalinity＝清透感。"]}
{"word":"hyalinization","summary":{"en":"Hyalinization is a medical term for tissue becoming “glassy” due to hyaline material deposits.","zh":"Hyalinization 指组织因玻璃样物质沉积而出现“玻璃样”改变的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine/biology) The process in which tissue becomes glassy, smooth, and more transparent due to the build-up of a protein-like material (hyaline), often seen in disease or aging.","zh":"（医学/生物）玻璃样变：由于玻璃样（hyaline）样的蛋白样物质沉积，使组织变得光滑、呈“玻璃样”、较透明的过程，常见于疾病或老化相关变化。"},"examples":[{"en":"The pathologist noted hyalinization in the small blood vessels.","zh":"病理科医生在小血管中观察到了玻璃样变。"},{"en":"In chronic inflammation, hyalinization can appear in the affected tissue over time.","zh":"在慢性炎症中，受累组织随着时间推移可能出现玻璃样变。"}]}],"synonyms":["hyaline change","hyalinosis"],"phonetic":"/ˌhaɪ.ə.lə.nəˈzeɪ.ʃən/","extraExplanation":["词源提示：hyalinization 来自 hyaline（“玻璃样的、透明的”），源于希腊语 hýalos（“玻璃”）。因此这个词的核心意象就是“像玻璃一样”。","使用场景：该词多用于病理学报告、医学论文或检验结果描述，属于专业术语；日常英语很少使用。"]}
{"word":"hyalinize","summary":{"en":"Hyalinize means to become (or cause something to become) glassy and homogeneous in appearance, especially in tissues.","zh":"hyalinize 指（使）组织呈玻璃样、均质的外观，即发生/引起玻璃样变。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Medical/biology) To make tissue or a substance become glassy, clear, and homogeneous in appearance (to undergo or cause hyalinization).","zh":"（医学/生物）使组织或物质呈现“玻璃样、透明且均质”的外观；发生或引起玻璃样变（玻璃样化）。"},"examples":[{"en":"In chronic inflammation, small blood vessels may hyalinize over time.","zh":"在慢性炎症中，小血管可能会随着时间发生玻璃样化。"},{"en":"Pathologists noted that parts of the scar tissue had hyalinized.","zh":"病理学家注意到疤痕组织的部分区域已经玻璃样化。"},{"en":"The report described hyalinized collagen in the sample.","zh":"报告描述样本中存在玻璃样化的胶原。"}]}],"synonyms":["hyalinise","undergo hyalinization","become glassy"],"phonetic":"/ˈhaɪəˌlaɪˌnaɪz/","extraExplanation":["这个词多见于病理学报告或科研论文中，属于偏专业用语。常见搭配有：hyalinized tissue（玻璃样化组织）、hyalinized collagen（玻璃样化胶原）。","词源上与 hyaline（玻璃样的、透明的）相关；后缀 -ize 常表示“使……化/变成……”。"]}
{"word":"hyalinized","summary":{"en":"Hyalinized means having become glassy and translucent (“hyaline”), especially when describing tissue changes in pathology.","zh":"hyalinized 指（尤其在病理学中）组织呈现玻璃样、透明样外观的“玻璃样变”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changed into or showing a clear, glassy (“hyaline”) appearance, especially in body tissue under a microscope.","zh":"（尤指显微镜下的组织）发生“玻璃样（透明样）”改变，呈现透明、玻璃样外观的。"},"examples":[{"en":"The pathologist reported hyalinized connective tissue in the biopsy sample.","zh":"病理科医生在活检标本中报告发现结缔组织出现玻璃样变。"},{"en":"Long-standing scars may become hyalinized and look more glassy under the microscope.","zh":"长期存在的瘢痕组织可能发生玻璃样变，在显微镜下看起来更像玻璃一样透明。"}]}],"synonyms":["hyaline","glassy","hyalinised"],"phonetic":"/ˈhaɪəˌlɪnˌaɪzd/","extraExplanation":["“hyalinized”多用于医学/病理学语境，描述组织中蛋白质沉积或结构改变后呈现均质、透明样（像玻璃一样）的外观；常见搭配有 hyalinized tissue（玻璃样变组织）、hyalinized collagen（玻璃样变胶原）、hyalinized vessel wall（血管壁玻璃样变）。","词源上与希腊语 hýalos（玻璃）有关；英式拼写常见为 hyalinised。"]}
{"word":"hyalinizing","summary":{"en":"Hyalinizing describes a medical/pathology change where tissue becomes hyaline—glassy-looking and homogeneous.","zh":"hyalinizing 用于医学/病理语境，指组织发生玻璃样变，呈均质、似玻璃的改变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) causing tissue to become hyaline (glassy, homogeneous, and protein-rich), especially seen in pathology reports.","zh":"（医学）使组织发生“玻璃样变”（呈均质、似玻璃、富含蛋白的改变），常见于病理报告用语。"},"examples":[{"en":"The biopsy showed hyalinizing change in small blood vessels.","zh":"活检显示小血管出现玻璃样变。"},{"en":"Doctors described it as a hyalinizing process related to chronic inflammation.","zh":"医生将其描述为与慢性炎症相关的玻璃样变过程。"}]},{"partOfSpeech":"adj.","definition":{"en":"becoming hyaline; taking on a clear, glass-like appearance.","zh":"变为玻璃样的；呈现透明、似玻璃外观的。"},"examples":[{"en":"Under the microscope, the scar tissue looked hyalinizing over time.","zh":"在显微镜下，瘢痕组织随着时间推移看起来逐渐玻璃样化。"}]}],"synonyms":["hyaline","glassy","sclerosing (in some contexts)"],"phonetic":"/ˈhaɪəˌlaɪnˌaɪzɪŋ/","extraExplanation":["“hyalinizing”通常是动词 hyalinize 的现在分词/形容词用法，常出现在病理学描述里，如“hyalinizing arteriolosclerosis（小动脉玻璃样硬化）”或“hyalinizing fibrosis（玻璃样变性纤维化）”。它多用于说明显微镜下的形态改变，并不等同于某一种单独疾病名称。","词根 hyalin- 来自希腊语 hýalos，意为“玻璃”。因此这类词常带有“玻璃样、透明样”的形态学含义。"]}
{"word":"hyalinocrystalline","summary":{"en":"A rare medical adjective meaning “glassy and crystal-like in appearance.”","zh":"罕见的医学形容词，意为“外观呈玻璃样且带晶体样特征”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a glassy (hyaline) and crystal-like appearance; used especially in medical/pathology writing to describe deposits, membranes, or tissue changes that look smooth/transparent like glass and also resemble crystals.","zh":"呈玻璃样（透明、光滑）并带晶体样外观的；多用于医学/病理学语境，形容沉积物、膜或组织改变既像玻璃样又像晶体。"},"examples":[{"en":"Microscopy showed hyalinocrystalline material within the vessel wall.","zh":"显微镜下可见血管壁内有玻璃样-晶体样物质。"},{"en":"The report described a hyalinocrystalline deposit in the cornea.","zh":"报告描述角膜内存在玻璃样-晶体样沉积。"}]}],"synonyms":["hyaline","crystalline","glassy","crystal-like"],"phonetic":"/ˌhaɪ.əˌlaɪ.noʊˈkrɪs.tə.laɪn/","extraExplanation":["这是一个非常少见、偏专业的形容词，常见于病理学描述（如“沉积物”“变性物质”“膜样结构”）。\n\n词源可拆解为：hyalino-（来自 hyaline，意为“玻璃样、透明的”）+ crystalline（“晶体样的、像水晶的”）。写作中用来强调“外观/质地同时具备玻璃样与晶体样特征”，而不是指真正的玻璃或水晶。"]}
{"word":"hyalinosis","summary":{"en":"Hyalinosis is a medical term for the buildup of hyaline (glassy, translucent) material in tissues, often damaging small blood vessels.","zh":"Hyalinosis 指组织内沉积透明样（玻璃样）物质的病理改变，常累及小血管并造成损伤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which glassy, translucent (“hyaline”) material builds up in tissues (often in small blood vessels), causing thickening and damage.","zh":"（医学）透明样变性：组织（常见于小血管）内沉积“透明样/玻璃样（hyaline）”物质，导致组织增厚并受损。"},"examples":[{"en":"The biopsy showed hyalinosis in the kidney’s small blood vessels.","zh":"活检显示肾脏小血管出现透明样变性。"},{"en":"Long-standing diabetes can be associated with vascular hyalinosis.","zh":"长期糖尿病可能与血管透明样变性有关。"}]}],"synonyms":["hyaline deposition","hyaline change"],"phonetic":"/ˌhaɪəˌlɪˈnoʊsɪs/","extraExplanation":["词源提示：hyaline 来自希腊语，意为“玻璃样的、透明的”；-osis 常表示“病变/状态”。因此 hyalinosis 字面意思就是“出现玻璃样（透明样）物质的病变”。","常见语境：多出现在病理报告或医学论文中，如“arteriolar hyalinosis（小动脉透明样变性）”“glomerular hyalinosis（肾小球透明样变性）”。日常英语中很少使用。","学习提示：不要把它和 hyaline（形容词/名词，意为透明样的/透明软骨）混淆；hyalinosis 专指一种病理变化。"]}
{"word":"hyalins","summary":{"en":"“Hyalins” is the plural form of “hyalin,” meaning glassy, transparent-looking material seen in tissues (a medical/biology term).","zh":"hyalins 是 hyalin 的复数，指组织中出现的“玻璃样、透明样”的物质（医学/生物学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of hyalin: a clear, glassy-looking substance found in some tissues or cells (often discussed in biology/medicine).","zh":"hyalin 的复数：指在某些组织或细胞中出现的透明、玻璃样物质（常见于生物学/医学语境）。"},"examples":[{"en":"Under the microscope, the pathologist noted hyalins in the damaged tissue.","zh":"在显微镜下，病理学家注意到受损组织中有玻璃样物质（hyalins）。"},{"en":"Some diseases can cause protein deposits that look like hyalins.","zh":"某些疾病会导致蛋白沉积，看起来像玻璃样物质（hyalins）。"}]}],"synonyms":["hyaline material","glassy deposits"],"phonetic":"/ˈhaɪəlɪn/","extraExplanation":["词源上与希腊语 hýalos（“玻璃”）有关，所以它常用来描述“像玻璃一样透明/光亮”的外观。","在日常英语里更常见的是形容词 hyaline（“透明的；玻璃样的”），而 hyalin/hyalins 多出现在医学、病理学或组织学文本中。"]}
{"word":"hyalite","summary":{"en":"Hyalite is a clear, glassy type of opal found in certain rocks.","zh":"Hyalite 指一种透明、玻璃状的蛋白石，常见于特定岩石中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A clear, glassy variety of opal (hydrated silica), often found as colorless or pale mineral deposits in volcanic or hydrothermal rocks.","zh":"一种透明、玻璃状的蛋白石（含水二氧化硅）品种，常以无色或浅色矿物沉积的形式出现在火山岩或热液作用的岩石中。"},"examples":[{"en":"The geologist identified the clear coating on the rock as hyalite.","zh":"地质学家把岩石上那层透明的覆膜鉴定为透明蛋白石（hyalite）。"},{"en":"Hyalite can look like glass, but it is actually a type of opal.","zh":"透明蛋白石看起来像玻璃，但它其实是蛋白石的一种。"}]}],"synonyms":["opal","glass opal"],"phonetic":"/ˈhaɪəlaɪt/","extraExplanation":["词源与形态：hyalite 来自希腊语 hyalos（“玻璃”），因此常用来强调它“玻璃般透明”的外观。","学习提示：在矿物学/地质学语境中更常见；日常英语里较少使用。若是在珠宝语境，人们更常说 opal（蛋白石）。"]}
{"word":"hyalites","summary":{"en":"Hyalites are clear, glassy-looking opals (a type of hydrated silica).","zh":"hyalites 指透明、具玻璃光泽的蛋白石（含水二氧化硅）样本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a clear, colorless to pale opal (a form of hydrated silica), often with a glassy look; sometimes called “glass opal.”","zh":"玻璃蛋白石；一种透明到浅色、带玻璃光泽的蛋白石（含水二氧化硅）。"},"examples":[{"en":"The geologist identified the transparent bead-like stones as hyalites.","zh":"地质学家把这些透明、像珠子一样的石头鉴定为玻璃蛋白石。"},{"en":"Under strong light, the hyalite showed a glossy, glass-like surface.","zh":"在强光下，这块玻璃蛋白石呈现出有光泽的、像玻璃一样的表面。"}]}],"synonyms":["glass opal","opal"],"phonetic":"/ˈhaɪəlaɪts/","extraExplanation":["“Hyalite”来自希腊语 hýalos（意为“玻璃”），因此常见的别称是“glass opal（玻璃蛋白石）”。它属于蛋白石（opal）的一种，多用于矿物学语境；日常英语里更常见的词是 opal。","复数形式是 hyalites，常用来指多块这种矿物样本。"]}
{"word":"hyalithe","summary":{"en":"Hyalithe is a rare term (often spelled hyalite) for a clear, glassy variety of opal.","zh":"Hyalithe 是一个较少见的词（常见拼写为 hyalite），指透明、玻璃光泽的蛋白石品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mineralogy) A rare, glassy, usually colorless variety of opal (hydrated silica), sometimes called “glassy opal.”","zh":"（矿物学）一种罕见、玻璃光泽、通常无色的蛋白石（含水二氧化硅），也常被称为“玻璃蛋白石”。"},"examples":[{"en":"The collector labeled the clear, glassy specimen as hyalithe (hyalite).","zh":"收藏者把那块透明、玻璃状的标本标注为 hyalithe（也写作 hyalite）。"},{"en":"Under ultraviolet light, some hyalithe can glow a bright green.","zh":"在紫外线下，有些 hyalithe 会发出明亮的绿色荧光。"}]}],"synonyms":["hyalite","glassy opal","opal (var.)"],"phonetic":"/ˈhaɪəˌlaɪt/","extraExplanation":["“hyalithe”在英语中非常少见，更多时候会写作“hyalite”。它属于蛋白石（opal）的一种形态，常见特征是透明或半透明、玻璃光泽，有时含微量铀等杂质而产生荧光现象（并非所有样品都会）。","词源与希腊语“hyalos”（玻璃）有关，因此这种矿物的命名强调“像玻璃一样”的外观。"]}
{"word":"hyalitis","summary":{"en":"Hyalitis is a medical term for inflammation of the eye’s vitreous humor.","zh":"hyalitis 是医学术语，指眼内玻璃体的炎症（玻璃体炎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the vitreous humor (the clear, gel-like substance inside the eye).","zh":"玻璃体炎；指眼球内玻璃体（透明凝胶状物质）的炎症。"},"examples":[{"en":"The ophthalmologist suspected hyalitis because there were inflammatory cells in the vitreous.","zh":"眼科医生怀疑是玻璃体炎，因为玻璃体内看到炎症细胞。"},{"en":"Hyalitis can cause floaters and blurry vision.","zh":"玻璃体炎可能引起飞蚊症和视物模糊。"}]}],"synonyms":["vitritis","vitreitis"],"phonetic":"/ˌhaɪəˈlaɪtɪs/","extraExplanation":["词源提示：hyal- 来自希腊语 hyalos（意为“玻璃”），在医学中常指“玻璃体/透明样组织”；-itis 表示“炎症”。因此 hyalitis 字面意思是“玻璃体的炎症”。","临床语境中，hyalitis 常与 uveitis（葡萄膜炎）等眼内炎症一起被提及；日常英语里很少用，主要见于医学/眼科文献。"]}
{"word":"hyalo","summary":{"en":"“hyalo-” is a word part used in medical/anatomy terms, meaning “glassy/transparent” or “related to the vitreous body of the eye.”","zh":"“hyalo-”是医学/解剖学常用的构词成分，表示“玻璃样/透明的”或“与眼内玻璃体有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(combining form) relating to glass, something glassy/transparent, or the vitreous body (vitreous humor) of the eye.","zh":"（构词成分）表示“玻璃、透明如玻璃的”，或与眼内的玻璃体（玻璃体液）有关。"},"examples":[{"en":"The doctor mentioned a problem with the hyaloid artery in the eye.","zh":"医生提到眼睛里的玻璃体动脉（hyaloid artery）可能有问题。"},{"en":"In anatomy, “hyalo-” often appears in words connected to the vitreous body.","zh":"在解剖学中，“hyalo-”常见于与玻璃体有关的词里。"}]}],"phonetic":"/ˈhaɪəloʊ/","extraExplanation":["“hyalo-”来自希腊语 hýalos，意思是“玻璃”。因此它常用于医学与解剖学词汇中，尤其是描述“透明、玻璃样”或“玻璃体相关”的结构。","常见相关词：hyaloid（玻璃体的/玻璃样的）、hyaloid membrane（玻璃体膜）。注意：hyaluronic acid（透明质酸）里的“hyalu-”与“hyalo-”形似但不完全相同，拼写与来源略有差别。"]}
{"word":"hyaloandesite","summary":{"en":"Hyaloandesite is a glassy or fine-grained type of andesite with visible crystals, formed from intermediate volcanic magma.","zh":"玻璃安山岩是一种基质呈玻璃质或细粒、含可见斑晶的安山岩，由中性火山岩浆形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A volcanic rock type (a kind of andesite) that contains visible crystals (phenocrysts) embedded in a fine-grained or glassy groundmass, formed from intermediate magma.","zh":"一种火山岩（安山岩的一种），特征是含有可见的大晶体（斑晶），包裹在细粒或玻璃质的基质中，由中性（介于玄武岩与流纹岩之间）的岩浆形成。"},"examples":[{"en":"The outcrop includes hyaloandesite with plagioclase crystals in a dark, glassy matrix.","zh":"该露头包含玻璃安山岩，暗色玻璃质基质中有斜长石斑晶。"},{"en":"Geologists mapped a hyaloandesite flow along the old volcanic ridge.","zh":"地质学家在古火山山脊附近绘制出一条玻璃安山岩熔岩流的分布。"}]}],"synonyms":["andesite (general term)","porphyritic andesite"],"phonetic":"/ˌhaɪəloʊˈændəsaɪt/","extraExplanation":["“hyalo-”来自希腊语，意思与“玻璃”相关，提示这种岩石的基质常呈玻璃质（快速冷却导致晶体来不及长大）。","在野外识别时，可留意：深色细基质中夹杂较大的斑晶；新鲜断口可能带玻璃光泽，但风化后会变得暗哑粗糙。","它常与火山喷发环境有关（例如熔岩流或火山碎屑沉积），用于推断岩浆成分与冷却速度等地质过程。"]}
{"word":"hyalobasalt","summary":{"en":"Hyalobasalt is basalt that contains a notable amount of volcanic glass, formed by very rapid cooling (often near or under water).","zh":"玻玄武岩是含较多火山玻璃的玄武岩，通常由熔岩在（近）水环境中快速冷却形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of basaltic volcanic rock that contains a significant amount of volcanic glass (formed when lava cools very quickly, often in contact with water).","zh":"一种含有较多火山玻璃的玄武岩类火山岩（通常因熔岩快速冷却而形成，常见于与水接触时）。"},"examples":[{"en":"Geologists identified hyalobasalt in the coastal outcrops, suggesting the lava cooled rapidly near seawater.","zh":"地质学家在海岸露头中辨认出玻玄武岩，这表明熔岩可能在接近海水环境中快速冷却。"},{"en":"Because it cools so fast, hyalobasalt can look darker and more glassy than typical basalt.","zh":"由于冷却速度很快，玻玄武岩看起来可能比普通玄武岩更黑、更具玻璃质感。"}]}],"synonyms":["glassy basalt","basaltic glass (related)"],"phonetic":"/ˌhaɪəloʊˈbeɪsɔlt/","extraExplanation":["“hyalo-”源自希腊语，意为“玻璃”；因此该词字面上可理解为“玻璃质的玄武岩”。","玻玄武岩常与水下或近水环境的喷发有关（如海底火山、冰下火山等），因为水或冰会加速熔岩冷却，从而形成更多火山玻璃。","在野外或标本观察中，它往往表现为细粒、致密，并带有玻璃光泽；在薄片显微镜下可见玻璃基质与少量晶体（如橄榄石、辉石、斜长石）共存。"]}
{"word":"hyalocrystalline","summary":{"en":"Hyalocrystalline describes something that is partly glassy and partly crystalline, especially in geology.","zh":"hyalocrystalline 指兼具玻璃质与晶体特征的（尤用于地质学）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having both glassy (hyaline) and crystalline characteristics; partly glass-like and partly made of crystals (often used in geology or biology).","zh":"（多用于地质学或生物学）兼具玻璃状（透明、似玻璃）与晶体特征的；部分玻璃质、部分结晶的。"},"examples":[{"en":"The lava cooled so quickly that the rock became hyalocrystalline, with tiny crystals suspended in a glassy base.","zh":"熔岩冷却得很快，使岩石呈现玻晶质结构：细小晶体悬浮在玻璃质基质中。"},{"en":"Under the microscope, the sample showed a hyalocrystalline texture rather than a fully crystalline one.","zh":"在显微镜下，这个样品呈现玻晶质结构，而不是完全结晶的结构。"}]}],"synonyms":["glassy-crystalline","partly crystalline","semi-crystalline"],"phonetic":"/ˌhaɪəloʊˈkrɪstəlaɪn/","extraExplanation":["这个词较少见，多见于专业写作（如岩石学 petrology、火山岩描述）。常用来说明“基质是玻璃质，但其中又含有晶体”。","词源可拆解为 hyalo-（来自希腊语，意为“玻璃”）+ crystalline（“晶体的/结晶的”）。在中文地学语境中，常对应“玻晶质（结构）”。"]}
{"word":"hyalodacite","summary":{"en":"Hyalodacite is a silica-rich, light-colored volcanic rock (a glassy kind of dacite).","zh":"hyalodacite 指一种富硅、浅色、玻璃质较多的火山岩（英安岩的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light-colored volcanic rock (a type of dacite) that is high in silica and contains relatively little dark minerals; it commonly has clear volcanic glass and crystals of quartz and feldspar","zh":"一种浅色火山岩（英安岩 dacite 的一种），二氧化硅含量高、深色矿物较少；常含透明的火山玻璃，并夹有石英和长石等晶体"},"examples":[{"en":"The field notes describe a hyalodacite flow with scattered quartz crystals.","zh":"野外记录描述了一股含零星石英晶体的玻璃质英安岩熔岩流。"},{"en":"Under the microscope, the sample shows a glassy (hyalo-) matrix typical of hyalodacite.","zh":"在显微镜下，样品呈现典型的玻璃质（hyalo-）基质，这是玻璃质英安岩常见特征。"}]}],"synonyms":["dacite","silica-rich volcanic rock","glassy dacite"],"phonetic":"/ˌhaɪəloʊˈdeɪsaɪt/","extraExplanation":["词源提示：hyalo- 来自希腊语，意思是“玻璃”；dacite 指“英安岩”。因此 hyalodacite 字面意思就是“玻璃质的英安岩”。","地质语境中它多用于描述岩石的外观与结构：玻璃质含量较高、快速冷却形成的火山岩，常见于火山喷发后的熔岩流或火山碎屑沉积中。"]}
{"word":"hyalogen","summary":{"en":"“Hyalogen” is usually a misspelling of “halogen,” a reactive group of elements like chlorine and iodine that readily form salts.","zh":"“hyalogen”通常是“halogen（卤素）”的误拼：指氯、碘等一组活泼元素，容易与金属形成盐类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A halogen: one of a group of reactive chemical elements (fluorine, chlorine, bromine, iodine, and astatine) that often form salts with metals.","zh":"卤素：一组反应性较强的化学元素（氟、氯、溴、碘、砹），常与金属形成盐类。"},"examples":[{"en":"Chlorine is a halogen used to disinfect water.","zh":"氯是一种卤素，用于给水消毒。"},{"en":"Iodine, a halogen, is important for thyroid health in small amounts.","zh":"碘是一种卤素，少量时对甲状腺健康很重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to halogens, especially in chemistry (e.g., a halogen lamp).","zh":"与卤素有关的（尤用于化学语境，如“卤素灯”）。"},"examples":[{"en":"Halogen lamps produce a bright white light.","zh":"卤素灯能发出明亮的白光。"}]}],"synonyms":["halogen","Group 17 element"],"phonetic":"/ˈhælədʒən/","extraExplanation":["“hyalogen”在现代英语里非常少见，实际使用中通常是“halogen”的拼写错误或少数旧式/非标准写法。","词源：halogen 来自希腊语 hals（盐）+ -gen（产生），字面意思是“产盐者”，因为这类元素容易与金属生成盐（如氯化钠）。","常见搭配：halogen lamp（卤素灯）、halogenated（卤化的）、halide（卤化物，如 chloride 氯化物）。"]}
{"word":"hyalogens","summary":{"en":"Hyalogens is a rare technical plural noun meaning “glass-forming” substances (or, in older biology usage, things that produce a clear hyaline material).","zh":"hyalogens 是一个较少见的技术性复数名词，指“玻璃形成物”（或在较旧的生物学用法中指能生成透明样物质的成分）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Technical, rare) Substances that form or produce a glassy, transparent (“hyaline”) material; glass-formers (often referring to silica-rich materials).","zh":"（技术用语，较少见）能形成或产生玻璃状、透明（“玻璃样/透明样”）物质的材料；玻璃形成物（常指富含二氧化硅的材料）。"},"examples":[{"en":"Silica is one of the most common hyalogens in glass-making.","zh":"二氧化硅是制玻璃中最常见的玻璃形成物之一。"},{"en":"The recipe lists several hyalogens to help the mixture melt into a clear glass.","zh":"配方列出几种玻璃形成物，帮助混合物熔融成透明玻璃。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology, rare) Materials or components in tissue that produce a clear, glass-like (hyaline) substance.","zh":"（生物学，较少见）组织中能产生透明、玻璃样（透明样）物质的材料或成分。"},"examples":[{"en":"Some older texts describe certain secretions as hyalogens because they form a hyaline layer.","zh":"一些较早的文献把某些分泌物称为“透明样生成物”，因为它们会形成一层透明样结构。"}]}],"synonyms":["glass-formers","vitreous formers","silica-rich materials"],"phonetic":"/haɪˈælədʒənz/","extraExplanation":["这个词非常少见，多见于较旧或专业的材料学/生物学语境。","词源构词上通常可理解为 hyalo-（玻璃、透明）+ -gen（生成/产生）。","注意不要与更常见的 halogens（卤素：氟、氯、溴、碘等）混淆；两者拼写和含义都不同。"]}
{"word":"hyalograph","summary":{"en":"Hyalograph means a tool for writing/engraving on glass, or (less commonly) a person who does this work.","zh":"Hyalograph 指在玻璃上书写/雕刻的工具，也可指（较少见）从事此工作的玻璃蚀刻/雕刻者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tool or device used for writing, etching, or engraving on glass.","zh":"用于在玻璃上书写、蚀刻或雕刻的工具或装置。"},"examples":[{"en":"The museum displayed a 19th‑century hyalograph used to etch names onto glassware.","zh":"博物馆展出了一个19世纪的hyalograph，用来在玻璃器皿上蚀刻名字。"},{"en":"With a hyalograph, the artist could add fine lines to the glass surface.","zh":"用hyalograph，这位艺术家能在玻璃表面刻出细致的线条。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who writes or engraves on glass; a glass etcher/engraver.","zh":"在玻璃上书写或雕刻的人；玻璃蚀刻师/雕刻师。"},"examples":[{"en":"She trained as a hyalograph, specializing in decorative glass signs.","zh":"她受训成为一名hyalograph，专门制作装饰性的玻璃招牌。"},{"en":"The hyalograph signed the finished piece in the corner.","zh":"这位hyalograph在成品角落署了名。"}]}],"synonyms":["glass etcher","glass engraver","engraver"],"phonetic":"/ˈhaɪələˌɡræf/","extraExplanation":["这个词比较罕见、带一点旧式（archaic）的书面感。词根来自希腊语：hyalo- 表示“玻璃”，-graph 表示“书写/刻画”。在现代英语里更常见的说法是 glass etcher（玻璃蚀刻师）或 glass engraver（玻璃雕刻师）。"]}
{"word":"hyalographer","summary":{"en":"A very rare term for someone who performs or works with hyalography (vascular imaging using contrast).","zh":"一个非常少见的词，指从事“血管造影/血管成像（使用造影剂）”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who practices hyalography (the making or use of images of the blood vessels after injecting a contrast substance).","zh":"进行“血管造影”（在注入造影剂后制作或使用血管影像）的人；血管造影医师/技师。"},"examples":[{"en":"The hyalographer prepared the patient for a vascular imaging procedure.","zh":"血管造影人员为病人做血管影像检查前的准备。"},{"en":"In older medical texts, a hyalographer might be mentioned alongside radiologists.","zh":"在较早的医学文献中，可能会把血管造影人员与放射科医生并列提到。"}]}],"synonyms":["angiographer","radiologist","interventional radiologist"],"phonetic":"/ˌhaɪəˈlæɡrəfər/","extraExplanation":["这个词非常罕见，现代医学英语里更常用的是 radiologist（放射科医生）、angiographer / angiography specialist（血管造影人员/专家）或 interventional radiologist（介入放射科医生）。","词源提示：hyalography 来自 hyalo-（与“玻璃样/透明”相关的词根）+ -graphy（记录、成像）。不过在实际使用中，描述血管成像通常用 angio-（血管）更常见，因此你在当代语境中更可能看到 angiography 而不是 hyalography。"]}
{"word":"hyalography","summary":{"en":"Hyalography is a (now uncommon) medical imaging method used to examine the vitreous body of the eye.","zh":"Hyalography 指用于检查眼球玻璃体的（如今较少使用的）医学影像检查方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical imaging technique for examining the vitreous body (the clear, gel-like substance inside the eye), historically using radiographic methods and sometimes contrast material","zh":"一种用于检查眼球玻璃体（眼内透明的凝胶状物质）的医学影像检查方法；历史上多指放射学检查，有时会使用造影剂"},"examples":[{"en":"The ophthalmologist reviewed the report from the hyalography to assess damage inside the eye.","zh":"眼科医生查看了玻璃体造影（hyalography）的报告，以评估眼内损伤。"},{"en":"Hyalography is now rarely used because ultrasound and modern scanning methods are safer and more common.","zh":"由于超声检查和现代扫描更安全、更常见，hyalography 现在很少使用。"}]}],"synonyms":["vitreous imaging","ocular imaging"],"phonetic":"/ˌhaɪəˈlɑːɡrəfi/","extraExplanation":["词根拆解：hyalo- 来自希腊语，意为“玻璃、透明物”，在医学里常指“玻璃体（vitreous body）”；-graphy 表示“记录、成像、检查”。合起来就是“对玻璃体进行成像/检查”。","语域提示：这是较偏专业、且带历史色彩的术语。在现代临床语境中，更常见的说法通常会直接用 vitreous imaging、ocular ultrasound（眼部超声）或相关的现代影像检查名称。"]}
{"word":"hyaloid","summary":{"en":"Hyaloid means “related to the vitreous (glassy) body of the eye,” and can also refer to the hyaloid membrane itself.","zh":"Hyaloid 指“与眼内玻璃体（透明玻璃样结构）有关的”，也可指玻璃体膜本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the vitreous body (the clear, gel-like substance inside the eye).","zh":"与玻璃体有关的（玻璃体是眼内透明的凝胶状物质）。"},"examples":[{"en":"The doctor checked the hyaloid membrane during the eye exam.","zh":"医生在眼科检查中查看了玻璃体膜（hyaloid membrane）。"},{"en":"Hyaloid changes can affect vision if the vitreous pulls on the retina.","zh":"如果玻璃体牵拉视网膜，玻璃体相关改变（hyaloid changes）可能会影响视力。"}]},{"partOfSpeech":"n.","definition":{"en":"A structure in or related to the vitreous of the eye, especially the hyaloid membrane (a thin layer around the vitreous).","zh":"眼内与玻璃体相关的结构，尤指玻璃体膜（包裹玻璃体的薄层）。"},"examples":[{"en":"The surgeon noted a tear in the hyaloid.","zh":"外科医生注意到玻璃体膜出现撕裂。"}]}],"synonyms":["vitreous (in eye anatomy)","glassy (general meaning, less specific)"],"phonetic":"/ˈhaɪəˌlɔɪd/","extraExplanation":["“Hyaloid”常见于眼科语境：例如 anterior hyaloid（前玻璃体界面）、posterior hyaloid（后玻璃体界面/后玻璃体皮质）以及 hyaloid membrane（玻璃体膜）。","词源来自希腊语 hyalos，意为“玻璃”。因此它带有“透明、玻璃样”的含义，但在现代医学里多用于指“与玻璃体相关”。","胚胎期有一条 hyaloid artery（玻璃体动脉）为晶状体供血，出生后通常退化消失；若残留，临床上可能在检查报告中被提到。"]}
{"word":"hyaloiditis","summary":{"en":"Hyaloiditis is inflammation of the eye’s vitreous (hyaloid) body.","zh":"Hyaloiditis 指眼内玻璃体（玻璃样体）的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the hyaloid (vitreous body) in the eye, affecting the gel-like substance behind the lens and sometimes causing blurred vision, floaters, or eye discomfort.","zh":"玻璃体（hyaloid／vitreous body）发炎，影响晶状体后方的胶状物质，可能导致视力模糊、飞蚊或眼部不适。"},"examples":[{"en":"The ophthalmologist considered hyaloiditis after the patient reported new floaters and blurry vision.","zh":"病人说最近出现飞蚊和视力模糊后，眼科医生考虑可能是玻璃体炎（hyaloiditis）。"},{"en":"Hyaloiditis can be related to infection or autoimmune inflammation, so further tests may be needed.","zh":"玻璃体炎可能与感染或自身免疫性炎症有关，因此可能需要进一步检查。"}]}],"synonyms":["vitreitis","vitritis"],"phonetic":"/ˌhaɪ.əˌlɔɪˈdaɪ.tɪs/","extraExplanation":["词源提示：hyaloid- 来自希腊语，意为“玻璃样的”，在眼科里常指玻璃体相关结构；-itis 表示“炎症”。","这属于医学/眼科术语，日常英语中很少见；临床上更常用的相关说法包括 vitreitis（玻璃体炎）或 uveitis（葡萄膜炎，可能累及玻璃体）。若在报告中看到该词，通常出现在眼科检查或影像/病历记录里。"]}
{"word":"hyaloids","summary":{"en":"Hyaloids are eye-related (vitreous) structures—often referring to the fetal hyaloid artery and related membranes/canal; hyaloid can also be an adjective meaning “of the vitreous.”","zh":"Hyaloids 指与眼内玻璃体相关的结构，常指胎儿期的玻璃体动脉及相关膜/管道；hyaloid 也可作形容词，表示“与玻璃体有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun) Hyaloids: structures in or near the vitreous body of the eye, especially the fetal hyaloid artery and related membranes/canal.","zh":"（复数名词）hyaloids：眼内与玻璃体相关的结构，尤指胎儿期的玻璃体动脉（hyaloid artery）及相关的膜或管道等。"},"examples":[{"en":"In the fetus, the hyaloids help supply nutrients to the developing lens.","zh":"在胎儿期，hyaloids（如玻璃体动脉）帮助为正在发育的晶状体提供营养。"},{"en":"By birth, most hyaloids have regressed and are no longer functional.","zh":"到出生时，多数hyaloids会退化，不再发挥功能。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective, usually hyaloid) Relating to the vitreous humor (“glass-like” substance) in the eye.","zh":"（形容词，常用单数 hyaloid）与眼内玻璃体（“玻璃样”物质）有关的。"},"examples":[{"en":"The doctor noted a change along the hyaloid membrane.","zh":"医生注意到玻璃体膜（hyaloid membrane）附近出现了变化。"},{"en":"A hyaloid canal can sometimes be seen as a faint line in the vitreous body.","zh":"玻璃体管（hyaloid canal）有时可在玻璃体内看到一条淡淡的线。"}]}],"synonyms":["vitreous","vitreal"],"phonetic":"/ˈhaɪəˌlɔɪd/","extraExplanation":["词源小贴士：hyaloid 来自希腊语 hyalos（“玻璃”），因为玻璃体呈透明、玻璃样外观。","常见搭配：hyaloid artery（玻璃体动脉，胎儿期血管）、hyaloid canal（玻璃体管 / Cloquet’s canal）、hyaloid membrane（玻璃体膜）。这些多用于眼科解剖或医学语境。"]}
{"word":"hyaloliparite","summary":{"en":"A rare geology term meaning a glassy variety of rhyolite (liparite).","zh":"一个罕见的地质学术语，指玻璃质的流纹岩（liparite/rhyolite）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) A glassy form of liparite (rhyolite); essentially a volcanic rock with a high silica content that cooled so quickly it became largely glass rather than crystals.","zh":"（地质）一种玻璃质的“流纹岩/脂肪岩”（liparite，旧称）；指富含二氧化硅的火山岩因冷却过快而多呈火山玻璃、晶体很少的类型。"},"examples":[{"en":"In older geology texts, hyaloliparite is described as a glassy variety of rhyolite.","zh":"在较早的地质学教材里，hyaloliparite 被描述为流纹岩的一种玻璃质类型。"},{"en":"The sample looks more like hyaloliparite than typical rhyolite because it has a shiny, glass-like surface.","zh":"这块样品表面发亮、像玻璃，比起典型流纹岩更像 hyaloliparite。"}]}],"synonyms":["glassy rhyolite","rhyolite","volcanic glass"],"phonetic":"/ˌhaɪəloʊˈlɪpəˌraɪt/","extraExplanation":["这个词非常少见，多见于19世纪到20世纪早期的英文地质文献。现代更常用的说法是“glassy rhyolite（玻璃质流纹岩）”或直接称“volcanic glass（火山玻璃）”。","词源结构：hyalo- 表示“玻璃”，liparite 是“流纹岩（rhyolite）”的旧称之一，因此字面意思就是“玻璃质的流纹岩”。在阅读现代资料时，遇到 liparite 通常可以按 rhyolite 来理解。"]}
{"word":"hyalolith","summary":{"en":"Hyalolith is a rare word meaning a glassy-looking stone, sometimes referring to volcanic glass like obsidian.","zh":"Hyalolith 是个罕见词，指外观呈玻璃质感的石头，有时指黑曜石等火山玻璃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A glassy stone; a stone or rock with a glass-like appearance, sometimes used to refer to volcanic glass such as obsidian.","zh":"（罕见）“玻璃石”；外观呈玻璃质感的石头或岩石，有时也可泛指黑曜石等火山玻璃。"},"examples":[{"en":"The museum displayed a hyalolith that looked almost like black glass.","zh":"博物馆展出了一块玻璃石，看起来几乎像黑色玻璃。"},{"en":"Early writers sometimes used hyalolith to describe obsidian blades.","zh":"早期的一些作者有时用“玻璃石”来描述黑曜石制成的刀刃。"}]}],"synonyms":["volcanic glass","obsidian","glassy rock"],"phonetic":"/ˌhaɪələˈlɪθ/","extraExplanation":["词源提示：hyalolith 由希腊语词根 hyalo-（玻璃）+ -lith（石头）组成，字面意思就是“玻璃一样的石头”。这个词在现代英语中很少见，地质学语境里更常用 volcanic glass（火山玻璃）或 obsidian（黑曜石）。"]}
{"word":"hyalomelan","summary":{"en":"Hyalomelan is a dark, glassy volcanic rock, similar to obsidian.","zh":"Hyalomelan 指一种深色、玻璃质的火山岩，类似黑曜石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, glassy volcanic rock (a type of natural volcanic glass), similar to obsidian.","zh":"一种深色、玻璃质的火山岩（天然火山玻璃的一种），类似黑曜石。"},"examples":[{"en":"The geologist identified the glossy black fragment as hyalomelan formed by rapid cooling of lava.","zh":"地质学家将那块乌黑发亮的碎片鉴定为快速冷却的熔岩形成的玻璃质火山岩（hyalomelan）。"},{"en":"In the museum display, hyalomelan is placed next to obsidian to show their similar glassy texture.","zh":"在博物馆展柜里，hyalomelan 被放在黑曜石旁边，用来展示它们相似的玻璃质感。"}]}],"synonyms":["volcanic glass","obsidian (similar)"],"phonetic":"/ˌhaɪ.ə.loʊˈmɛl.ən/","extraExplanation":["词源提示：hyalomelan 来自希腊语词根 hyalo-（“玻璃”）+ melas（“黑色”），字面意思接近“黑色的玻璃”。","用法提示：这是地质学/矿物学中的较少见术语；更常见的相关词是 obsidian（黑曜石）。"]}
{"word":"hyalomere","summary":{"en":"Hyalomere is the clear outer zone of a platelet, involved in platelet shape change and clotting.","zh":"hyalomere 指血小板的透明外层（透明区），与血小板变形和凝血功能相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the clear, outer part of a blood platelet (a “transparent zone” of cytoplasm), important for changing shape and helping the platelet stick and clot.","zh":"（血小板的）透明外层/透明区；血小板细胞质较清亮的外周部分，有助于血小板变形、黏附并参与凝血。"},"examples":[{"en":"Under the microscope, the platelet’s hyalomere looks lighter than the center.","zh":"在显微镜下，血小板的透明区看起来比中心部分更浅（更清亮）。"},{"en":"Damage to structures in the hyalomere can affect how well platelets spread during clotting.","zh":"透明区内结构受损会影响血小板在凝血时铺展（扩张）的能力。"}]}],"synonyms":["clear zone (of a platelet)","peripheral zone (of a platelet)"],"phonetic":"/ˌhaɪ.əˈloʊ.mɪr/","extraExplanation":["词源提示：hyal- 来自希腊语，和“玻璃、透明”有关；-mere 有“部分、区段”的意思，所以 hyalomere 字面上可理解为“透明的部分”。","在一些生理学/血液学教材中，血小板常分为外周较清亮的 hyalomere（透明区）和中央较致密的 granulomere（颗粒区）。透明区通常与细胞骨架相关，帮助血小板改变形状并参与黏附。"]}
{"word":"hyalomucoid","summary":{"en":"Hyalomucoid is a (usually older) scientific term for a gel-like mucoprotein in connective tissue/mucus, often linked to hyaluronic acid.","zh":"Hyalomucoid 是一个（多见于较早文献的）科学术语，指结缔组织或黏液中的凝胶状黏蛋白/糖蛋白，常与透明质酸相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gel-like mucoprotein (glycoprotein) found in connective tissue and mucus, often associated with hyaluronic acid and contributing to a slippery, viscous texture","zh":"一种凝胶状的黏蛋白/糖蛋白，存在于结缔组织与黏液中，常与透明质酸相关，能让组织或分泌物呈现润滑、黏稠的质地"},"examples":[{"en":"In some older biology texts, hyalomucoid is described as part of the ground substance in connective tissue.","zh":"在一些较早的生物学教材里，hyalomucoid 被描述为结缔组织基质的一部分。"},{"en":"The sample contained proteins with hyalomucoid-like properties, making it thick and slippery.","zh":"该样品含有具有类似 hyalomucoid 特性的蛋白质，使其变得黏稠而润滑。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or resembling hyalomucoid; mucous and gel-like in character","zh":"与 hyalomucoid 有关的；或呈现类似黏液、凝胶状特征的"},"examples":[{"en":"Researchers noted a hyalomucoid layer on the surface that reduced friction.","zh":"研究人员注意到表面有一层 hyalomucoid 样的覆盖层，可降低摩擦。"}]}],"synonyms":["mucoprotein","glycoprotein"],"phonetic":"/ˌhaɪələˈmjuːkɔɪd/","extraExplanation":["这个词多见于较早期的生物化学/组织学文献，现代写法更常用更具体的术语（如 “hyaluronic acid/透明质酸”、 “glycoprotein/糖蛋白”、 “mucoprotein/黏蛋白” 等）来描述成分与功能。","词源上可拆成 hyalo-（与“透明、玻璃样/透明质酸”相关）+ mucoid（黏液样的），因此整体含义就是“透明质酸相关的黏液样物质”。"]}
{"word":"hyalonema","summary":{"en":"Hyalonema is a genus of deep-sea glass sponges with long, glass-like spicules that can form a rope-like stalk.","zh":"Hyalonema 是一种深海玻璃海绵属，以细长如玻璃丝的硅质骨针、常形成绳状“柄”为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of deep-sea glass sponges (class Hexactinellida) known for having long, glassy silica spicules often bundled into a rope-like stalk","zh":"海绵动物中的一属深海玻璃海绵（六放海绵纲），以细长、玻璃般的硅质骨针（spicules）常束成绳状“柄”而闻名"},"examples":[{"en":"Researchers collected a Hyalonema specimen from the deep seafloor to study its glassy spicules.","zh":"研究人员从深海海底采集了一件Hyalonema标本，用来研究它玻璃般的骨针。"},{"en":"The rope-like stalk of Hyalonema helps anchor the sponge in soft sediment.","zh":"Hyalonema绳状的“柄”有助于它在松软沉积物中固定自身。"}]}],"synonyms":["glass sponge","rope sponge"],"phonetic":"ˌhaɪəloʊˈniːmə","extraExplanation":["Hyalonema 这个属名来自希腊语词根：hyalos（“玻璃”）+ nema（“线、丝”），对应它像玻璃丝一样的骨针束。","它常被归在“玻璃海绵”（Hexactinellida）中，生活在较深海域；在科普文章里，有时会与另一种著名的玻璃海绵 Euplectella（“维纳斯花篮”）一起被提到，但它们并不是同一个属。"]}
{"word":"hyalophagia","summary":{"en":"Hyalophagia means eating glass (a rare and dangerous behavior, discussed mainly in medical contexts).","zh":"hyalophagia 指“吞食玻璃”，多见于医学语境，属于罕见且非常危险的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of eating glass or glass-like material (a rare medical term).","zh":"食玻璃癖；吞食玻璃（罕见的医学用语）。"},"examples":[{"en":"Hyalophagia is extremely dangerous because glass can cut the mouth, stomach, and intestines.","zh":"食玻璃癖非常危险，因为玻璃可能割伤口腔、胃和肠道。"},{"en":"A doctor may ask about hyalophagia when someone repeatedly swallows sharp objects.","zh":"当有人反复吞食尖锐物体时，医生可能会询问是否存在食玻璃癖。"}]}],"synonyms":["glass-eating","pica (as a broader category)"],"phonetic":"/ˌhaɪəloʊˈfeɪdʒə/","extraExplanation":["词源：来自希腊语 hyalo-（“玻璃”）+ -phagia（“进食、吞食”）。","在医学上它常被视为“异食癖（pica）”的一种极端表现；如果你在现实中遇到相关情况，应尽快寻求专业医疗帮助。"]}
{"word":"hyalophane","summary":{"en":"Hyalophane is a rare barium-rich feldspar mineral (a variety of orthoclase).","zh":"Hyalophane 是一种较罕见的富钡长石矿物（正长石的变种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a type of feldspar) that is a barium-rich variety of orthoclase, often found in metamorphic rocks.","zh":"一种较罕见的矿物（长石类），为富钡的正长石变种，常见于变质岩中。"},"examples":[{"en":"The specimen was identified as hyalophane because it contained unusually high barium for a feldspar.","zh":"这块标本被鉴定为 h​​​​yalophane（钡正长石），因为它的钡含量对长石来说异常高。"},{"en":"Hyalophane can occur alongside quartz and other feldspars in metamorphic settings.","zh":"在变质岩环境中，hyalophane 可能与石英及其他长石共生。"}]}],"synonyms":["barium orthoclase","barium feldspar"],"phonetic":"/haɪˈæl.ə.feɪn/","extraExplanation":["词源提示：hyalophane 来自希腊语词根，hyalos（玻璃）+ phaino（显现/呈现），名称与其常见的玻璃光泽有关。","矿物学小知识：它属于钾长石（正长石）系列中的富钡端员/变种，实际样品常与其他长石形成固溶体，因此鉴定通常需要化学分析或仪器测试（而不只看外观）。"]}
{"word":"hyalophyre","summary":{"en":"Hyalophyre is a glass-rich volcanic rock with visible crystals in a glassy groundmass.","zh":"Hyalophyre 指一种玻璃质基质中含斑晶的火山岩，可理解为“玻璃质斑岩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a volcanic igneous rock with a glassy (often rhyolitic) groundmass and larger visible crystals (phenocrysts); essentially a glass-rich porphyry","zh":"一种火山喷出岩：基质多为玻璃质（常偏流纹质），其中含有较大的可见晶体（斑晶）；可理解为“玻璃质的斑岩”"},"examples":[{"en":"Under the microscope, the sample shows feldspar phenocrysts set in a glassy hyalophyre matrix.","zh":"在显微镜下，这个样品显示长石斑晶镶嵌在玻璃质的 hyalophyre（玻璃斑岩）基质中。"},{"en":"The lava cooled so quickly that it formed hyalophyre rather than a fully crystalline rock.","zh":"熔岩冷却得非常快，因此形成了 hyalophyre（玻璃斑岩），而不是完全结晶的岩石。"}]}],"synonyms":["vitrophyre","glassy porphyry"],"phonetic":"/ˌhaɪəˈlɑːfaɪər/","extraExplanation":["词源上常分析为 hyalo-（“玻璃”，源自希腊语）+ -phyre（与 porphyry/斑岩相关的构词）。强调“玻璃质基质 + 斑晶”的结构特征。","在现代岩石学里，这个词相对少见，描述时常用更通用的说法，如 vitrophyre（玻璃斑岩/玻璃基质的斑状火山岩）、glassy porphyry（玻璃质斑岩），并可能根据成分进一步称为 rhyolitic vitrophyre（流纹质玻璃斑岩）。"]}
{"word":"hyalopilitic","summary":{"en":"Hyalopilitic describes a volcanic-igneous texture with felted microlites in a mostly glassy groundmass.","zh":"hyalopilitic 指火山岩中“玻璃质基质里毡状交织的微晶”的一种结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In geology) Describing an igneous rock texture where tiny, needle-like crystals (usually feldspar microlites) are felted together within a mostly glassy (non-crystalline) groundmass.","zh":"（地质学）指一种火成岩结构：细小针状晶体（多为长石微晶）呈毡状交织，嵌在以玻璃质（非晶质）为主的基质中。"},"examples":[{"en":"Under the microscope, the basalt shows a hyalopilitic groundmass with feldspar microlites in volcanic glass.","zh":"在显微镜下，这块玄武岩呈现玻璃—毡状结构：长石微晶分布在火山玻璃基质中。"},{"en":"The report describes a hyalopilitic texture typical of rapidly cooled lava.","zh":"报告描述了快速冷却熔岩常见的玻璃—毡状结构。"}]}],"synonyms":["hyalopilitic texture","microlitic (broader term)"],"phonetic":"/ˌhaɪəloʊpɪˈlɪtɪk/","extraExplanation":["词源提示：hyalo- 表示“玻璃（glass）”，-pilitic 与“毡状、毛毡般的纤维/针状集合体”相关。合起来强调“玻璃质基质 + 毡状微晶”的组合特征。","使用场景：多见于岩石薄片鉴定、火山岩（如玄武岩、安山岩）显微结构描述，常与“rapid cooling（快速冷却）”这一成因背景一起出现。"]}
{"word":"hyaloplasm","summary":{"en":"Hyaloplasm is the clear, gel-like fluid part of the cytoplasm (like cytosol) where organelles float and many reactions happen.","zh":"Hyaloplasm 指细胞质中透明、胶状的液体基质（类似细胞溶胶），细胞器在其中悬浮，许多反应在此发生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The clear, jelly-like fluid part of a cell’s cytoplasm (similar to the cytosol) in which cell structures and chemical reactions are suspended.","zh":"细胞质中透明、胶状的液体部分（类似“细胞溶胶”），细胞结构悬浮其中，许多化学反应在此进行。"},"examples":[{"en":"Many enzymes work in the hyaloplasm to help the cell produce energy.","zh":"许多酶在透明质基质（hyaloplasm）中发挥作用，帮助细胞产生能量。"},{"en":"Under the microscope, the hyaloplasm looks like a clear background around the organelles.","zh":"在显微镜下，透明质基质看起来像细胞器周围清澈的背景。"}]}],"synonyms":["cytosol","cytoplasmic matrix","ground substance (of cytoplasm)"],"phonetic":"/ˌhaɪəloʊˈplæzəm/","extraExplanation":["这是一个生物学/细胞学术语，较少用于日常英语。现代教材更常用“cytosol（细胞溶胶）”或“cytoplasm（细胞质）”。","词源上，“hyalo-”表示“玻璃样、透明的”，“-plasm”与“形成的物质/浆”有关，因此整体含义接近“透明的细胞质基质”。","使用时注意：hyaloplasm 通常指细胞质中不包括细胞器的“基质/液相”部分；而 cytoplasm 常包含细胞器在内的整个细胞质。"]}
{"word":"hyaloplasma","summary":{"en":"Hyaloplasma is the clear fluid matrix of the cytoplasm (cytosol) in which organelles are suspended.","zh":"Hyaloplasma 指细胞质中透明的液态基质（细胞溶质/细胞质基质），细胞器悬浮其中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The clear, jelly-like fluid part of the cytoplasm (cytosol), excluding organelles; the “background” substance in which cell structures are suspended.","zh":"（细胞）透明、胶状的细胞质基质（即细胞溶质/细胞液的一部分），不包括细胞器；是细胞结构悬浮其中的“背景”物质。"},"examples":[{"en":"In basic cell biology, hyaloplasma refers to the fluid matrix that surrounds organelles.","zh":"在基础细胞生物学中，hyaloplasma 指包围细胞器的液态基质。"},{"en":"Many metabolic reactions occur in the hyaloplasma before products are transported elsewhere in the cell.","zh":"许多代谢反应会先在 hyaloplasma 中进行，然后产物再被运送到细胞的其他部位。"}]}],"synonyms":["cytosol","cytoplasmic matrix","ground substance"],"phonetic":"/ˌhaɪ.ə.loʊˈplæz.mə/","extraExplanation":["词源提示：hyalo- 来自希腊语，意思与“玻璃、透明”相关；-plasma 表示“成形物质/浆”。因此 hyaloplasma 字面上有“透明的浆状物质”之意。","使用场景：这是较偏旧式或较专门的术语，现代教材更常用 cytosol（细胞溶质）或 cytoplasmic matrix（细胞质基质）。"]}
{"word":"hyaloplasmic","summary":{"en":"Hyaloplasmic means “related to the cell’s hyaloplasm/cytosol (the clear fluid part of the cytoplasm).”","zh":"hyaloplasmic 意为“与细胞透明质/细胞溶胶（细胞质中清澈的液体部分）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyaloplasm (the clear, fluid part of a cell’s cytoplasm, also called the cytosol), where many chemical reactions happen.","zh":"与透明质（细胞质中清澈的液体部分，也常称为细胞溶胶 cytosol）有关的；发生在细胞质液相中的。"},"examples":[{"en":"Many enzymes work in the hyaloplasmic fluid of the cell.","zh":"许多酶在细胞的透明质（细胞溶胶）中发挥作用。"},{"en":"The study focused on hyaloplasmic processes such as glycolysis.","zh":"这项研究聚焦于透明质中的过程，例如糖酵解。"}]}],"synonyms":["cytosolic","of the cytosol","hyaloplasmic (rare)"],"phonetic":"/ˌhaɪələˈplæzmɪk/","extraExplanation":["这是一个偏专业的细胞生物学词汇：hyaloplasm 通常指细胞质中“透明、液态”的部分，概念上很接近 cytosol（细胞溶胶）。在较新的教材/论文里，cystosol 更常用；hyaloplasmic 常见于较老或更强调“透明基质”这一说法的语境。","词形拆解有助记忆：hyalo- 表示“透明/玻璃样”（如 hyaline 玻璃样的），-plasm 与“细胞质/原生质”相关，-ic 表示“……的”。"]}
{"word":"hyalopsite","summary":{"en":"Hyalopsite is a rare term meaning volcanic glass (obsidian-like material).","zh":"hyalopsite 是一个罕见术语，指火山玻璃（类似黑曜石的玻璃质物质）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare or technical term for volcanic glass (an obsidian-like, glassy material formed when lava cools very quickly).","zh":"（罕见/术语）指火山玻璃（岩浆快速冷却形成的玻璃质物质，类似黑曜石）。"},"examples":[{"en":"The report described hyalopsite fragments mixed with ash near the crater.","zh":"报告描述了在火山口附近的火山灰中混有火山玻璃（hyalopsite）碎片。"},{"en":"Because it cools so fast, the lava can form hyalopsite instead of visible crystals.","zh":"由于冷却得非常快，岩浆可能形成火山玻璃（hyalopsite），而不是肉眼可见的晶体。"}]}],"synonyms":["volcanic glass","obsidian"],"phonetic":"/ˈhaɪəloʊpˌsaɪt/","extraExplanation":["这个词在现代英语中非常少见，更多出现在较旧的地质/岩石学文献里；很多情况下更常用的说法是 volcanic glass 或 obsidian（黑曜石）。","词首 hyalo- 来自希腊语，常表示“玻璃的、透明的”。如果你是在论文或标本标签上看到该词，建议同时核对上下文或原文语言（有时可能是较少用的分类名或拼写变体）。"]}
{"word":"hyalopterous","summary":{"en":"Hyalopterous means “having transparent, glass-like wings,” usually used to describe insects.","zh":"hyalopterous 指“具有透明如玻璃般翅膀的”，多用于描写昆虫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having clear, glass-like, translucent wings; describing an insect or other winged creature whose wings look transparent.","zh":"（多指昆虫等）具透明如玻璃般翅膀的；翅膀呈半透明状的。"},"examples":[{"en":"The hyalopterous insect looked as if its wings were made of thin glass.","zh":"那只透明翅的昆虫看起来仿佛翅膀是薄玻璃做的。"},{"en":"In the sunlight, the hyalopterous wings shimmered faintly.","zh":"在阳光下，那对透明翅微微闪光。"}]}],"synonyms":["glassy-winged","transparent-winged","translucent-winged"],"phonetic":"/ˌhaɪəˈlɑːptərəs/","extraExplanation":["这是一个较少见、偏文学/科学描写的形容词，常用于描写昆虫翅膀“透明、玻璃质感”的外观。","词源可拆为 hyalo-（“玻璃、透明”，源自希腊语）+ -pterous（“有翅的”，同源于 pter- “翅膀”），因此字面意思接近“玻璃翅的/透明翅的”。"]}
{"word":"hyalosiderite","summary":{"en":"Hyalosiderite is a yellow-green, magnesium-and-iron-bearing variety of the mineral olivine.","zh":"Hyalosiderite（玻铁橄榄石）是橄榄石的一种黄绿色变种，含镁和铁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow-green variety of olivine (a common rock-forming mineral), containing magnesium and iron; found in some volcanic rocks and meteorites","zh":"一种黄绿色的橄榄石（常见造岩矿物）变种，含镁和铁；可见于某些火山岩和陨石中"},"examples":[{"en":"The thin section showed hyalosiderite crystals scattered through the basalt.","zh":"薄片观察显示，玄武岩中散布着玻铁橄榄石晶体。"},{"en":"Some meteorites contain olivine that can be described as hyalosiderite.","zh":"一些陨石含有的橄榄石可被描述为玻铁橄榄石。"}]}],"synonyms":["olivine","chrysolite"],"phonetic":"/ˌhaɪ.əˈloʊˌsɪd.əˌraɪt/","extraExplanation":["词源：来自希腊语词根 hyalo-（“玻璃、透明”）与 sider-（“铁”），反映其外观与含铁成分。","地学语境：它常被当作橄榄石（olivine）中的一个成分/品种名，用来指介于富镁端元（forsterite）与富铁端元（fayalite）之间的组成范围。不同教材或论文对其使用频率不一，更多时候会直接用“olivine（橄榄石）+成分比例”来描述。"]}
{"word":"hyalospongia","summary":{"en":"Hyalospongia is a scientific genus name for a kind of glass sponge.","zh":"Hyalospongia 是一种玻璃海绵的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A scientific genus name referring to a type of glass sponge (a sponge with a silica-based skeleton).","zh":"（生物）一个科学属名，指某类“玻璃海绵”（骨骼主要由二氧化硅构成的海绵动物）。"},"examples":[{"en":"Researchers compared Hyalospongia specimens with other glass sponges under a microscope.","zh":"研究人员在显微镜下把Hyalospongia标本与其他玻璃海绵进行比较。"},{"en":"The paper lists Hyalospongia in a table of sponge genera found at the site.","zh":"论文在该地点发现的海绵属名表中列出了Hyalospongia。"}]}],"synonyms":["glass sponge","Hexactinellida"],"phonetic":"/ˌhaɪ.ə.loʊˈspʌn.dʒi.ə/","extraExplanation":["这是拉丁化的学名，常见于分类学、古生物或海洋生物学文献中。一般日常英语不常用，日常更常说 glass sponge（玻璃海绵）。","词源可拆解理解：hyalo- 来自希腊语，意为“玻璃”；spongia 意为“海绵”。看到这个结构时，可以推测与“玻璃状/硅质骨骼的海绵”相关。"]}
{"word":"hyalotekite","summary":{"en":"Hyalotekite is a rare lead–barium silicate mineral with a glassy luster.","zh":"Hyalotekite 是一种罕见的铅—钡硅酸盐矿物，具有玻璃光泽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare silicate mineral (a lead–barium silicate) known for its glassy luster, usually found in certain metamorphic or skarn-related rock environments.","zh":"一种罕见的硅酸盐矿物（以铅与钡的硅酸盐为主），常见玻璃光泽，通常产于某些变质岩或矽卡岩（skarn）等地质环境中。"},"examples":[{"en":"Hyalotekite is a rare mineral that collectors sometimes find in skarn deposits.","zh":"Hyalotekite（玻璃辉石/玻璃钙铅矿，音译名常见差异）是一种罕见矿物，收藏者有时会在矽卡岩矿床中发现它。"},{"en":"Under strong light, hyalotekite can show a glassy shine on fresh surfaces.","zh":"在强光下，hyalotekite 的新鲜断面可能会呈现玻璃般的光泽。"}]}],"phonetic":"/ˌhaɪ.ə.loʊˈtɛk.aɪt/","extraExplanation":["“Hyalotekite”这个名字常被解释为与希腊语词根有关：hyalos（玻璃）+（-tektos/-tek- 相关构词）+ -ite（矿物名常用后缀），用来强调它的“玻璃光泽”。","它属于专业矿物学词汇，日常英语中几乎不会出现；更常见于矿物鉴定报告、地质学论文或矿物标本说明中。","中文译名在资料中可能不完全统一；学习时可把它当作专有矿物名记忆（首字母大写与否依写作风格而定）。"]}
{"word":"hyalotype","summary":{"en":"Hyalotype is a rare term for an early photograph made on (or from) glass plates.","zh":"Hyalotype 是一个较少见的词，指早期在玻璃板上成像或由玻璃底片制作的照片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early kind of photograph made on glass, especially a picture produced on (or from) a glass plate negative.","zh":"一种早期的玻璃摄影（玻璃照片），尤指在玻璃板上成像或由玻璃底片印制出的照片。"},"examples":[{"en":"The museum displayed a hyalotype of the city taken in the 1850s.","zh":"博物馆展出了一张拍摄于19世纪50年代的城市玻璃照片（hyalotype）。"},{"en":"Because the hyalotype was on glass, it had to be handled very carefully.","zh":"因为这张hyalotype是在玻璃上制作的，所以必须非常小心地拿取。"}]}],"synonyms":["glass plate photograph","glass-plate negative","glass plate photo"],"phonetic":"/ˈhaɪələˌtaɪp/","extraExplanation":["词源提示：hyal- 来自希腊语，意思是“玻璃”，-type 有“印制形式/类型”的意思，因此 hyalotype 字面可理解为“玻璃制成的照片类型”。","语境提示：这个词多见于摄影史、博物馆/档案说明文字中；现代日常英语更常说 glass plate photograph（玻璃板照片）或 glass-plate negative（玻璃底片）。"]}
{"word":"hyalts","summary":{"en":"“Halt” means to stop (verb) or a stop (noun); less commonly it can describe a limping walk (adjective).","zh":"“halt”常指“停止”（动词）或“一次停顿/中止”（名词）；较少见时也可作形容词表示“跛的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to stop moving or doing something; to come to a stop","zh":"（使）停止；（使）停下"},"examples":[{"en":"The bus halted at the next stop.","zh":"公交车在下一站停下了。"},{"en":"Production was halted because of a safety problem.","zh":"由于安全问题，生产被迫停止。"}]},{"partOfSpeech":"n.","definition":{"en":"a stop or pause in movement or activity","zh":"停顿；中止；暂停"},"examples":[{"en":"After a brief halt, the parade continued.","zh":"短暂停顿后，游行继续进行。"},{"en":"Negotiations came to a halt last week.","zh":"谈判在上周陷入停滞。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person) having trouble walking; limping","zh":"（人）跛的；一瘸一拐的"},"examples":[{"en":"After the injury, he had a halt walk.","zh":"受伤之后，他走路有点跛。"}]}],"synonyms":["stop","pause","cease","standstill","freeze"],"phonetic":"/hɔlt/","extraExplanation":["你输入的“hyalts”在常见英语词典里通常不是标准拼写。它很可能是“halts”（halt 的第三人称单数/复数形式）或“halt”的拼写错误。","常见搭配：come to a halt（停下来/停滞）、bring … to a halt（使……停下）、halt production/traffic（停止生产/交通）。","“halt”作形容词表示“跛的”较少见，多见于较正式或文学语境；日常更常说“limp / limping（跛行）”。"]}
{"word":"hyaluronate","summary":{"en":"a form of hyaluronic acid used for moisturizing and lubrication","zh":"用于保湿与润滑的透明质酸相关制剂（盐/酯）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt or ester of hyaluronic acid, widely used in skincare, eye drops, and joint injections to help retain moisture and improve lubrication","zh":"透明质酸（玻尿酸）的盐或酯，常用于护肤品、滴眼液和关节注射，以帮助锁水并改善润滑"},"examples":[{"en":"This moisturizer contains sodium hyaluronate to help the skin hold water.","zh":"这款保湿霜含有透明质酸钠，帮助皮肤锁住水分。"},{"en":"The doctor recommended a hyaluronate injection to reduce knee pain and improve movement.","zh":"医生建议注射透明质酸制剂，以减轻膝盖疼痛并改善活动。"},{"en":"Some eye drops use hyaluronate to soothe dryness.","zh":"有些滴眼液使用透明质酸制剂来缓解干涩。"}]}],"synonyms":["sodium hyaluronate","hyaluronic acid","hyaluronan"],"phonetic":"/haɪˈæl.jə.rəˌneɪt/","extraExplanation":["日常成分表里更常见的是 sodium hyaluronate（透明质酸钠）。它与“hyaluronic acid（透明质酸）”相关：前者通常更稳定、配方更常用；两者都与保湿与润滑有关。","在医学语境里，hyaluronate 也可指用于关节腔的“黏弹补充剂”（viscosupplement），强调“润滑/缓冲”的作用。"],"etymology":"词根来自 hyalo-（与“玻璃、透明”相关，指透明的物质）+ -uron-（与“尿酸/尿酸类”相关的构词元素，源自早期命名）+ -ate（常用于表示“盐/酯/化合物”）。hyaluronate 指“透明质酸的盐或酯”。","mnemonic":["把 hyalo- 记成“像玻璃一样透明（透明=玻尿酸的联想点）”，看到 hyal- 就想到“玻/透明”。","结尾 -ate 常见于“盐/化学物质”（如 acetate），所以 hyaluronate 可联想为“玻尿酸的某种化学形态（盐/酯）”。"]}
{"word":"hyaluronic","summary":{"en":"Hyaluronic means “related to hyaluronic acid,” commonly used in skincare and medical contexts.","zh":"hyaluronic 意为“与透明质酸/玻尿酸有关的”，常用于护肤与医疗语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hyaluronic acid (a natural substance in the body that helps keep tissues moist and lubricated).","zh":"与“透明质酸/玻尿酸”有关的（人体内天然存在，帮助组织保湿与润滑的物质）。"},"examples":[{"en":"This moisturizer contains hyaluronic ingredients to help hydrate the skin.","zh":"这款保湿霜含有玻尿酸相关成分，帮助皮肤补水。"},{"en":"Doctors may use hyaluronic products to support joint comfort.","zh":"医生可能会使用含玻尿酸的产品来帮助关节更舒适。"}]}],"synonyms":["hyaluronate (related term)","HA (abbreviation, in skincare)"],"phonetic":"/ˌhaɪ.ə.ləˈrɑː.nɪk/","extraExplanation":["“hyaluronic”在日常英语里几乎总是出现在搭配中：hyaluronic acid（透明质酸/玻尿酸）。单独说“hyaluronic”通常是在省略“acid”，常见于护肤品宣传或成分表。","发音提示：重音在“-RON-”附近（hya-lu-RON-ic）。","护肤语境里常见说法：hyaluronic acid serum（玻尿酸精华）、hyaluronic gel（玻尿酸凝胶）。在英文中“hydrate”更偏“补水/含水”，而“moisturize”更偏“保湿/锁水”。"]}
{"word":"hyaluronidase","summary":{"en":"Hyaluronidase is an enzyme that breaks down hyaluronic acid, helping tissues become more permeable so fluids or injected medicines can spread.","zh":"hyaluronidase（透明质酸酶）是一种分解透明质酸的酶，可增加组织通透性，帮助液体或注射药物扩散。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme that breaks down hyaluronic acid in connective tissue, making tissues more permeable and helping fluids or injected medicines spread more easily","zh":"透明质酸酶：一种分解结缔组织中透明质酸的酶，使组织通透性增加，从而帮助体液或注射药物更容易扩散"},"examples":[{"en":"The doctor used hyaluronidase to help the injection spread more evenly under the skin.","zh":"医生使用透明质酸酶来帮助注射液在皮下更均匀地扩散。"},{"en":"In some clinics, hyaluronidase may be used to dissolve unwanted hyaluronic acid filler.","zh":"在一些诊所里，透明质酸酶可能用于溶解不理想的透明质酸填充剂。"}]}],"synonyms":["spreading factor"],"phonetic":"/haɪəˈrɑnəˌdeɪs/","extraExplanation":["在医学与美容领域，这个词常见于两类场景：①配合局麻药或皮下/皮内注射，让药液更快、更广泛地分散；②作为“填充剂修复/溶解”的处理手段，用于分解以透明质酸为主要成分的皮肤填充物。","词形可拆解理解：hyaluron-（透明质酸）+ -idase（表示“酶”的后缀）。发音重音通常在“-RON-”附近。","注意：它分解的是“透明质酸（hyaluronic acid）”，不是所有类型的填充剂都能被它溶解（例如某些非透明质酸类材料不适用）。"]}

