{"word":"Hybanthus","summary":{"en":"a botanical genus in the violet family","zh":"堇菜科的一属植物（学名）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the violet family (Violaceae), found mainly in tropical and subtropical regions","zh":"（植物）堇菜科（Violaceae）的一属开花植物，多见于热带与亚热带地区"},"examples":[{"en":"Hybanthus species are often studied for their medicinal compounds in traditional remedies.","zh":"一些 Hybanthus 属植物常因传统用药中的活性成分而被研究。"},{"en":"The field guide lists Hybanthus under the violet family (Violaceae).","zh":"这本野外图鉴把 Hybanthus 列在堇菜科（Violaceae）之下。"}]}],"phonetic":"/haɪˈbænθəs/","extraExplanation":["这是学名用词，日常英语里不常见，主要出现在植物分类、园艺、药用植物与生态研究的语境中。","作为属名通常首字母大写（Hybanthus），单复数在学术写作里常直接用属名指代“该属植物”。"],"etymology":"拉丁化的新拉丁植物学属名，源自希腊语构词：anthos 表“花”；前半部分 hyb- 的具体指涉在不同资料中解释不一，一般理解为描述花的形态特征而造的名称。","mnemonic":["记住后半段 -anthus/-anthos：和“花”有关（如 chrysanthemum 里也有 anth- 的影子）。","把 Hybanthus 拆成“hy + ban + thus”：看到 -thus 联想到“this/thus（如此）”，提示它是一个“专有名词/学名”，不是日常词。"]}
{"word":"hybanthus","summary":{"en":"Hybanthus is a scientific plant genus name, used mainly in botany.","zh":"Hybanthus 是一个植物学上的属名，主要用于学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants (often in the violet family), including small herbs or shrubs found in warm regions; in some modern classifications, many species are placed in the genus *Pombalia*.","zh":"一种开花植物属名（常归入堇菜科），多为热带或亚热带地区的小草本或灌木；在一些较新的分类中，该属的许多物种被并入 *Pombalia* 属。"},"examples":[{"en":"Researchers recorded several *Hybanthus* species in the tropical forest understory.","zh":"研究人员在热带森林下层植被中记录到几种 *Hybanthus*（海班瑟斯属）植物。"},{"en":"This specimen was labeled *Hybanthus*, though the latest checklist lists it as *Pombalia*.","zh":"这份标本被标注为 *Hybanthus*，但最新名录把它归为 *Pombalia*。"}]}],"synonyms":["(no true everyday synonyms; related: genus name, botanical name)"],"phonetic":"/haɪˈbænθəs/","extraExplanation":["这是一个植物学拉丁名，通常用于学术写作、植物志、标本标签等场景；日常英语里很少单独使用。","在生物分类学中，属名可能会因研究更新而调整；因此你可能会在不同资料里看到 *Hybanthus* 与 *Pombalia* 的用法差异。"]}
{"word":"hybern","summary":{"en":"“Hybern” is not standard; it usually means “hibernate”: to sleep through winter (animals) or to be inactive for a long time.","zh":"“hybern”不是规范拼写，通常指“hibernate”：冬眠，或（比喻）长期不活跃/暂停。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Common misspelling of) to spend the winter in a dormant or inactive state; to sleep for a long time during winter (used especially for some animals).","zh":"（常见拼写错误，对应）冬眠；（尤指某些动物）在冬季进入长时间的休眠状态。"},"examples":[{"en":"Bears hibernate during the coldest months.","zh":"熊在最冷的几个月里会冬眠。"},{"en":"Some animals hibernate to save energy when food is scarce.","zh":"有些动物在食物匮乏时冬眠以节省能量。"},{"en":"This frog can hibernate under mud for months.","zh":"这种青蛙可以在泥里冬眠数月。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative) to become inactive for a long period; to pause something for a while and start again later.","zh":"（比喻）长期不活跃；暂停一段时间，之后再重新开始。"},"examples":[{"en":"The project hibernated until the company had more funding.","zh":"这个项目一直搁置，直到公司有了更多资金。"},{"en":"My gym membership basically hibernates every winter.","zh":"我的健身会员卡基本上每到冬天就“沉睡”。"}]}],"synonyms":["sleep through the winter","be dormant","lie dormant","go inactive"],"phonetic":"/ˈhaɪbɚˌneɪt/","extraExplanation":["“hybern”不是标准拼写。你可能想写的是 **hibernate**（冬眠）。常见错误包括 *hybernate*、*hibern* 等。","词根 **hibern-** 来自拉丁语 *hibernus*（“冬天的”）。你可能在一些词里看到它，比如 **hibernation**（冬眠）。","另外，**Hibernia** 是古罗马人对“爱尔兰”的称呼，所以有时会见到 **Hibernian**（与爱尔兰有关的）这一形容词，但它和“冬眠”是不同词。"]}
{"word":"hybla","summary":{"en":"Hybla is a Sicilian place-name (especially the Hyblaean Mountains) and, in literature, can refer to famous Sicilian honey/bees.","zh":"Hybla 是西西里的地名（尤指伊布莱山），在文学中也可引申指著名的西西里蜂蜜/蜜蜂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A name used for places in Sicily in ancient/modern Italy, especially the Hyblaean Mountains (Monti Iblei) in southeastern Sicily; also used in history for several ancient towns called “Hybla.”","zh":"（专有名词）西西里（意大利）的一些地名，尤其指西西里东南部的伊布莱山（Hyblaean Mountains）；在历史中也可指数座名为“Hybla”的古城。"},"examples":[{"en":"We drove through the Hyblaean Mountains in southeastern Sicily.","zh":"我们开车穿过了西西里东南部的伊布莱山地区。"},{"en":"Some ancient sources mention more than one city called Hybla.","zh":"一些古代文献提到不止一座名为Hybla的城市。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Used in phrases like “Hyblaean honey/bees,” meaning famous Sicilian honey or bees (often praised in classical poetry).","zh":"（文学用法）用于“Hyblaean honey / Hyblaean bees”等表达，指（在古典诗歌中常被称颂的）西西里著名蜂蜜或蜜蜂。"},"examples":[{"en":"The poet praised her words as sweet as Hyblaean honey.","zh":"诗人称她的话甜如伊布莱的蜂蜜。"},{"en":"In classical-style writing, “Hyblaean bees” suggests rich, golden honey.","zh":"在仿古典风格的写作里，“伊布莱的蜜蜂”常暗示浓郁金黄的蜂蜜。"}]}],"synonyms":["Hyblaean Mountains","Monti Iblei","Iblei"],"phonetic":"/ˈhɪblə/","extraExplanation":["“Hybla / Hyblaean（伊布莱的）”常见于古典文学意象：西西里被认为盛产蜂蜜，因此“Hyblaean honey（伊布莱蜂蜜）”在英文里多带有“甜美、芬芳、诗意”的联想。","拼写与用法提示：地名通常写作 Hybla 或 Hyblaean（形容词）；如果你看到 Hyblaean honey/bees，多半是文学化表达，而不是日常口语。"]}
{"word":"hyblaea","summary":{"en":"Hyblaea is most often a scientific genus name for moths, and more rarely a classical/Latin reference linked to Hybla in Sicily (famous for its honey).","zh":"Hyblaea 最常见为蛾类的学名属名；较少见时作为古典/拉丁化典故，关联西西里的 Hybla 地区（以蜂蜜著称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of moths (family Hyblaeidae), including species whose caterpillars can feed on and damage certain trees (for example, teak).","zh":"一种蛾类属名（Hyblaeidae 家族，海布莱蛾属），其中一些物种的幼虫会取食并可能危害某些树木（如柚木）。"},"examples":[{"en":"In some regions, Hyblaea moth larvae are monitored because they can defoliate teak trees.","zh":"在一些地区，人们会监测海布莱蛾属（Hyblaea）的幼虫，因为它们可能会啃食柚木叶片导致落叶。"},{"en":"The report identified Hyblaea as the genus responsible for the damage seen on young leaves.","zh":"报告指出，造成嫩叶受害的昆虫属为海布莱蛾属（Hyblaea）。"}]},{"partOfSpeech":"n.","definition":{"en":"an older/Latin-style name connected with Hybla (an area in Sicily), best known from the phrase “Hyblaean (Hyblaea) honey,” meaning especially fine honey.","zh":"与意大利西西里岛“海布拉”（Hybla）地区有关的较古老/拉丁化名称，最常见于短语 “Hyblaean（Hyblaea） honey”（海布拉蜂蜜），引申为“上等蜂蜜”。"},"examples":[{"en":"The poet praised the sweetness of Hyblaea honey.","zh":"诗人称赞海布拉蜂蜜（Hyblaea honey）的甘甜。"},{"en":"In older texts, “Hyblaea” can appear as a classical reference to Sicily and its famous honey.","zh":"在较古老的文本中，“Hyblaea”有时作为古典典故指向西西里及其闻名的蜂蜜。"}]}],"phonetic":"/haɪˈbliːə/","extraExplanation":["“Hyblaea / Hyblaean”常见于古典文学意象：拉丁诗歌里会用“海布拉的蜜蜂/蜂蜜”来象征甜美与丰饶（例如维吉尔等诗人的传统意象）。日常英语里很少单独用 hyblaea；更常见的是出现在学名（昆虫分类）或古典典故中。","如果你是在生物学语境里看到它，通常指“海布莱蛾属（Hyblaea）”；如果是在文学或古典语境里看到它，多半与西西里（Hybla）和“著名的蜂蜜”有关。"]}
{"word":"hyblaean","summary":{"en":"Hyblaean means “of Hybla (Sicily),” often used in literature to suggest bees, honey, and honey-like sweetness.","zh":"Hyblaean 指“与西西里古地名希布拉有关的”，常用于文学中联想到蜜蜂、蜂蜜与蜜糖般的甜美。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hybla, an ancient district in Sicily (Italy), especially famous in poetry for its bees and honey; by extension, “honey-sweet” or “richly sweet.”","zh":"与（意大利）西西里岛古地名希布拉（Hybla）有关的，尤指诗歌中以蜜蜂与蜂蜜闻名；引申为“甜如蜂蜜的、甜美浓郁的”。"},"examples":[{"en":"The poet praised her Hyblaean voice—soft, warm, and honey-sweet.","zh":"诗人称赞她的“希布拉式”嗓音——柔和、温暖、甜如蜂蜜。"},{"en":"In classical verse, Hyblaean bees often symbolize abundance and sweetness.","zh":"在古典诗歌里，“希布拉的蜜蜂”常象征丰饶与甜美。"}]}],"synonyms":["Sicilian (context-dependent)","honeyed (figurative)","nectarous (poetic)"],"phonetic":"/haɪˈbliːən/","extraExplanation":["“Hyblaean”源自古代地名Hybla（希布拉），位于西西里岛一带；拉丁诗歌传统里常出现“Hyblaean bees（希布拉的蜜蜂）”，用来指著名的蜂蜜与甜美气息。","在英语里这个词很少用于日常对话，多见于文学、诗歌或带有古典风格的描写；写作时常用来营造“古典、馥郁、蜜甜”的意象。","文学提示：维吉尔（Virgil）的作品中有“Hyblaean bees”一类的典故，用来增强田园与丰收的氛围。"]}
{"word":"hyblan","summary":{"en":"“hyblan” isn’t a recognized English word; it’s probably a typo or a proper name.","zh":"“hyblan”不是常见英语词；多半是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username rather than a dictionary entry.","zh":"不是标准英语单词；更可能是拼写错误，或是人名/用户名等专有用法。"},"examples":[{"en":"I couldn’t find “hyblan” in an English dictionary—did you mean “hybrid” or “Hylan”?","zh":"我在英语词典里查不到“hyblan”——你是不是想写“hybrid（混合的）”或“Hylan（人名/品牌名）”？"}]}],"extraExplanation":["“hyblan”在常见英语词典中通常查不到。如果你能提供一句包含它的原句（或说明你想表达的意思/语境），我可以帮你判断最可能的正确拼写。","一些可能的接近拼写（取决于语境）：\n- hybrid（adj./n. 混合的；混合体）\n- Hylan（专有名词，可能是姓氏/品牌）\n- Hybla / Hyblaean（与意大利地名Hybla相关，较少见，偏文学/历史语境）"]}
{"word":"hybodont","summary":{"en":"Hybodont: an extinct shark-like fish known from fossils, especially teeth.","zh":"Hybodont：一种已灭绝的鲨形软骨鱼类，主要通过化石（尤其是牙齿）为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct shark-like cartilaginous fish (a member of the group Hybodontiformes) that lived from the Triassic to the Cretaceous period","zh":"一种已灭绝的鲨形软骨鱼类（属于“弓齿鲨目/弓齿鲨类”Hybdontiformes），生活在三叠纪到白垩纪时期"},"examples":[{"en":"Hybodonts were common in ancient seas long before most modern sharks evolved.","zh":"在大多数现代鲨鱼进化出来之前，弓齿鲨类在古代海洋中很常见。"},{"en":"Fossil teeth suggest this hybodont ate hard-shelled animals like crustaceans.","zh":"化石牙齿表明，这种弓齿鲨类可能以甲壳类等带硬壳的动物为食。"},{"en":"Scientists compared hybodont fossils from freshwater and marine sites to understand their habitats.","zh":"科学家对比了淡水与海洋地点出土的弓齿鲨类化石，以了解它们的栖息环境。"}]}],"synonyms":["hybodont shark","hybodontiform"],"phonetic":"/ˈhaɪboʊdɑːnt/","extraExplanation":["“Hybodont”常用于古生物学/地质学语境，指一类已灭绝的鲨形鱼，而不指现代仍存的鲨鱼。","词源相关：名称与属名 Hybodus 有关，来自希腊语词根，常被解释为与“隆起/驼峰（hybos）”和“牙齿（odous）”有关，暗示其牙齿形态在鉴定化石时很重要。","在科普或博物馆文本中，你也可能看到更具体的说法：hybodont shark（弓齿鲨类/弓齿鲨）或 hybodontiform（弓齿鲨目的）。"]}
{"word":"hybodontiform","summary":{"en":"of or belonging to an extinct order of sharks","zh":"与一种已灭绝的鲨鱼目相关或属于该类群"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an extinct group (order) of sharks that lived from the late Paleozoic to the Mesozoic era, known for distinctive teeth and fin spines.","zh":"与一类已灭绝的鲨鱼类群（一个“目”）有关；该类群从古生代晚期延续到中生代，以其独特的牙齿与鳍棘等特征而知名。"},"examples":[{"en":"Hybodontiform fossils are often identified by their teeth, which vary in shape depending on diet.","zh":"这类化石常通过牙齿来鉴定；牙形会随食性不同而变化。"},{"en":"The museum exhibit compares hybodontiform sharks with modern sharks to show evolutionary changes.","zh":"博物馆展览把这类古鲨与现代鲨对比，展示演化上的变化。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of that extinct group of sharks.","zh":"该已灭绝鲨鱼类群中的一种（个体或成员）。"},"examples":[{"en":"Some hybodontiforms lived in freshwater as well as marine environments.","zh":"有些这类古鲨既生活在淡水环境，也出现在海洋环境中。"},{"en":"Researchers described a new hybodontiform based on jaw and spine fragments.","zh":"研究者根据颌骨与鳍棘碎片描述了一种新的这类古鲨。"}]}],"synonyms":["hybodont","hybodont shark"],"phonetic":"/ˌhaɪboʊˈdɑːntɪfɔːrm/","extraExplanation":["这是古生物学与系统分类学用语，常见于论文、化石标本说明与博物馆展牌中。对应更常见的分类名称是 Hybodontiformes（隆脊齿鲨目）；“hybodontiform”多用作形容词，也可作名词泛指该目成员。"],"etymology":"词形来自“hybodont-（指‘隆脊齿鲨’类群名的词干，源自希腊语：hybos 表示‘隆起/驼峰’之意 + odous/odont- 表示‘牙’）+ -iform（拉丁语系后缀，意为‘……形的’）”。整体意思就是“像隆脊齿鲨那一类/属于那一类的”。","mnemonic":["把 -iform 记成“...形/…类”（如 dolphiniform=海豚形）；所以 hybodontiform≈“隆脊齿鲨那一类/那种形的”。","odont/odonto- 在很多词里都表示“牙”（如 orthodontics 牙齿矫正）；看到 hybodontiform 也能联想到“用牙齿来辨认的古鲨类”。"]}
{"word":"hybodus","summary":{"en":"Hybodus is the name of an extinct shark genus known from fossils.","zh":"Hybodus（弓齿鲨属）是一个已灭绝的鲨类属名，主要通过化石为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of shark-like fish (hybodont sharks) known from fossils, common from the late Paleozoic through the Mesozoic era.","zh":"一种已灭绝的鲨形鱼类属（弓齿鲨类/弓齿鲨目相关类群），主要通过化石发现而知，盛行于古生代晚期到中生代。"},"examples":[{"en":"The museum displayed Hybodus teeth alongside other shark fossils.","zh":"博物馆把弓齿鲨属（Hybodus）的牙齿与其他鲨鱼化石一起展出。"},{"en":"Scientists study Hybodus fossils to learn how early sharks evolved.","zh":"科学家研究弓齿鲨属的化石，以了解早期鲨类如何演化。"}]}],"synonyms":["hybodont shark","fossil shark (general)"],"phonetic":"/haɪˈboʊdəs/","extraExplanation":["“Hybodus”源自希腊语词根：hybos（隆起/驼峰）+ odous（牙齿），常被解释为“有隆起牙齿的”。","弓齿鲨类与现代鲨鱼不同，常见特征之一是牙齿形态多样（有的适合抓鱼，有的更适合压碎硬壳猎物），因此在古代海洋与河口等环境中较为成功。","该词多出现在古生物学、博物馆展牌、科普读物中；日常英语里很少使用，通常保留拉丁化学名的拼写与大写形式（Hybodus）。"]}
{"word":"hybosis","summary":{"en":"Hypnosis is a relaxed, focused state with increased openness to suggestion, and it can also mean the therapy method that uses it (or, figuratively, a spell-like fascination).","zh":"Hypnosis 指一种放松而专注、较易接受暗示的状态，也可指使用催眠的治疗方法；比喻用法可指令人着迷的影响力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state like sleep in which someone is very relaxed and more open to suggestion, often created by a trained person (a hypnotist).","zh":"一种类似睡眠的状态：人非常放松、注意力集中，更容易接受暗示；常由受过训练的人（催眠师）引导产生。"},"examples":[{"en":"Some people use hypnosis to help manage stress.","zh":"有些人用催眠来帮助缓解压力。"},{"en":"Under hypnosis, she remembered details she had forgotten.","zh":"在催眠状态下，她想起了一些原本忘记的细节。"},{"en":"The therapist used hypnosis to support smoking cessation.","zh":"治疗师用催眠来辅助戒烟。"}]},{"partOfSpeech":"n.","definition":{"en":"A method or treatment that uses hypnosis (especially in therapy).","zh":"催眠疗法；用催眠进行治疗的方法。"},"examples":[{"en":"He tried hypnosis for his fear of flying.","zh":"他尝试用催眠来改善自己对坐飞机的恐惧。"},{"en":"Hypnosis is sometimes used alongside counseling.","zh":"催眠有时会与心理咨询一起使用。"}]},{"partOfSpeech":"n.","definition":{"en":"A very strong, almost “spell-like” fascination or control that captures someone’s attention.","zh":"（比喻）强烈到像“着魔”一样的吸引力；令人沉迷的影响力。"},"examples":[{"en":"The audience watched in hypnosis as the dancer moved.","zh":"观众像被迷住一样看着舞者的动作。"},{"en":"He fell into a kind of hypnosis while listening to the waves.","zh":"听着海浪声，他进入了一种恍惚的沉浸状态。"}]}],"synonyms":["trance","suggestion therapy","hypnotherapy (therapy context)","spell (figurative)"],"phonetic":"/hɪpˈnoʊsɪs/","extraExplanation":["你输入的“hybosis”不是常见英文单词；最可能是拼写错误，通常想写的是“hypnosis”（催眠）。","“hypnosis”常与“hypnotize（催眠，使进入催眠状态）”“hypnotic（催眠的；令人着迷的）”搭配使用。","在文化语境里，英语中“hypnosis”既可指临床/心理治疗中的催眠，也常被用于舞台表演（stage hypnosis，舞台催眠）。现实中的医学/心理催眠通常更强调放松、专注与暗示，并不等同于“完全失去意识”。"]}
{"word":"hybrid","summary":{"en":"Hybrid means a combination of two different things, or a thing made from two types (common in cars, work styles, and biology).","zh":"Hybrid 指两种不同事物的结合，或由两种类型组成的事物（常用于汽车、工作方式与生物杂交）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made by combining two different things; mixed","zh":"由两种不同事物结合而成的；混合的"},"examples":[{"en":"A hybrid car uses both a gas engine and an electric motor.","zh":"混合动力汽车同时使用汽油发动机和电动机。"},{"en":"They created a hybrid schedule with some days in the office and some days at home.","zh":"他们制定了一个混合办公安排：有些天在办公室，有些天在家。"}]},{"partOfSpeech":"n.","definition":{"en":"something that is a combination of two different types (for example, in technology, plants, or animals)","zh":"混合体；由两种不同类型结合而成的事物（如科技、植物或动物）"},"examples":[{"en":"This device is a hybrid of a phone and a tablet.","zh":"这台设备是手机和平板的结合体。"},{"en":"Some orchids are hybrids bred for color and strength.","zh":"有些兰花是为颜色和抗性培育出的杂交品种。"}]}],"synonyms":["mixed","combined","blend","crossbreed"],"phonetic":"/ˈhaɪbrɪd/","extraExplanation":["“hybrid”常用在三个领域：①交通（hybrid car/vehicle 混合动力车）；②工作方式（hybrid work 混合办公）；③生物（hybrid plant/animal 杂交/混种）。语感上强调“两个不同系统/类型的结合”，不只是一般的“mixed”。","词源来自拉丁语 *hybrida*，原意与“杂交/混种”有关，因此在生物语境里非常常见；后来引申到科技与生活方式。","相关常见搭配：hybrid engine（混合动力引擎）、plug-in hybrid（插电式混合动力）、hybrid meeting（线上线下混合会议）、hybrid model（混合模式）。"]}
{"word":"hybrid car","summary":{"en":"a vehicle powered by both gas and electricity","zh":"同时使用燃油与电力驱动的汽车"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a car that uses two power sources—usually a gasoline engine and an electric motor—to drive the vehicle and improve fuel efficiency","zh":"混合动力汽车：使用两种动力来源（通常是汽油发动机+电动机）来驱动车辆，以提高燃油经济性"},"examples":[{"en":"She bought a hybrid car to save money on gas.","zh":"她买了一辆混合动力汽车来省油钱。"},{"en":"Hybrid cars are often quieter in city traffic because they can run on electricity at low speeds.","zh":"混合动力汽车在城市低速行驶时常可用电驱动，所以通常更安静。"},{"en":"Many hybrid cars recharge their batteries when you brake.","zh":"很多混合动力汽车在刹车时会给电池回充。"}]}],"synonyms":["hybrid vehicle","gas-electric car","hybrid"],"phonetic":"/ˈhaɪbrɪd kɑr/","extraExplanation":["常见相关概念：hybrid car（混动）≠ electric car/EV（纯电）；很多混动不需要外接充电，而 plug-in hybrid (PHEV) 可以外接充电、纯电续航更长。","在日常口语中也可简称为 a hybrid，例如：I drive a hybrid.（我开混动车。）"],"etymology":"hybrid 来自拉丁语 hybridus，表示“混合的”；hybrid car 指“混合动力的汽车”，常见于 20 世纪末汽车工业语境。","mnemonic":["把 hybrid 记成“混合的”：hy- 像“合/混”，-brid 联想到“bridge（桥）”，两种动力“桥接”在一起。","联想中文“混动”：混=hybrid，动=动力；hybrid car=混合动力车。"]}
{"word":"hybrid cars","summary":{"en":"vehicles powered by both an engine and an electric motor","zh":"同时由燃油发动机与电动机驱动的汽车"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a car that uses both a gasoline (or diesel) engine and an electric motor (with a battery), switching between them or combining them to improve fuel efficiency and reduce emissions","zh":"混合动力汽车：同时使用燃油发动机（汽油/柴油）和电动机（电池），在两者间切换或共同驱动，以提高油耗表现并减少排放"},"examples":[{"en":"Hybrid cars can save fuel in city traffic because the electric motor helps at low speeds.","zh":"混合动力汽车在城市拥堵路况下更省油，因为低速时电动机会提供帮助。"},{"en":"She chose a hybrid car to reduce emissions without worrying about charging every day.","zh":"她选择了混合动力汽车来减少排放，同时不必每天都为充电发愁。"},{"en":"Many hybrid cars recharge their batteries through braking, not by plugging in.","zh":"很多混合动力汽车通过刹车回收能量给电池充电，而不是通过插电。"}]}],"synonyms":["hybrids","hybrid vehicles","gas-electric cars","hybrid electric vehicles"],"phonetic":"/ˈhaɪbrɪd kɑrz/","extraExplanation":["常见类型：\n- Hybrid（普通油电混动）：主要靠发动机+电机配合，通常不需要外接充电。\n- Plug-in hybrid（插电式混动，PHEV）：电池更大，可外接充电，纯电行驶里程更长。\n注意：hybrid car 不等于 electric car（纯电动汽车，EV）。"],"etymology":"hybrid 来自拉丁语 hybrid(a)，原意与“混合、杂交”有关；在现代英语中引申为“由两种不同系统组合而成”。car 源自 car（车辆）。组合成 hybrid car(s) 指“采用两种动力系统的汽车”。","mnemonic":["hy-（像“混合”）+ brid（联想“bridge 桥”把两种动力“桥接”起来）→ 混合动力。"]}
{"word":"hybrid crops","summary":{"en":"crossbred farm plants combining traits from two parent varieties","zh":"由两种亲本杂交培育、综合优良性状的作物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"crop plants produced by crossing two different varieties or lines to combine desirable traits (such as higher yield or disease resistance).","zh":"通过杂交两种不同品种或系培育出来的作物，用来结合优良性状（如高产、抗病等）。"},"examples":[{"en":"Many farmers choose hybrid crops because they can produce higher yields.","zh":"许多农民选择杂交作物，因为它们可能带来更高产量。"},{"en":"Hybrid crops are often bred to resist common plant diseases.","zh":"杂交作物常被培育得更能抵抗常见植物病害。"},{"en":"In some regions, hybrid crops helped improve food security.","zh":"在一些地区，杂交作物帮助提升了粮食安全。"}]}],"synonyms":["hybrids","hybrid varieties","crossbred crops","hybrid plants"],"phonetic":"/ˈhaɪbrɪd krɑps/","extraExplanation":["“hybrid crops（杂交作物）”通常指传统育种中的杂交（把两个亲本品种/品系交配）。它不等同于“GMOs/转基因作物”：杂交是选择育种的一种方式，转基因是把特定基因通过生物技术导入。","在农业语境里常见搭配：hybrid corn（杂交玉米）、hybrid rice（杂交水稻）、plant hybrids（植物杂交种）。"],"etymology":"“hybrid”源自拉丁语 hybridus，意为“杂交的、混合的”；“crop”来自古英语 crop(p) ，与“收成/庄稼”相关。合起来指“杂交培育出来的作物”。","mnemonic":["hy-像“合、混”，-brid 联想 bridge（桥）：把两种品种“搭桥”连接起来 → 杂交。","crops 可联想“收成/庄稼”，和“杂交”合起来就是“杂交出来的庄稼”。"]}
{"word":"hybrid electric vehicle","summary":{"en":"A vehicle powered by both an engine and electric motor(s).","zh":"由内燃机与电动机共同驱动的车辆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A car that uses both an internal combustion engine (gasoline or diesel) and one or more electric motors, working together to improve fuel efficiency and reduce emissions.","zh":"一种同时使用内燃机（汽油或柴油）和一个或多个电动机协同工作的汽车，以提高燃油效率并减少排放。"},"examples":[{"en":"My next car might be a hybrid electric vehicle because I drive in heavy city traffic.","zh":"我下一辆车可能会买混合动力汽车，因为我经常在拥堵的城市路况里开。"},{"en":"Hybrid electric vehicles often use regenerative braking to recharge the battery while slowing down.","zh":"混合动力汽车常通过再生制动在减速时为电池充电。"},{"en":"Compared with a traditional gasoline car, a hybrid electric vehicle usually consumes less fuel on short trips.","zh":"与传统汽油车相比，混合动力汽车在短途出行中通常更省油。"}]}],"synonyms":["hybrid car","gas-electric car","HEV","hybrid vehicle"],"phonetic":"/ˈhaɪbrɪd ɪˈlɛktrɪk ˈviəkəl/","extraExplanation":["常见缩写：HEV（Hybrid Electric Vehicle）。","HEV 通常不需要外接充电；电池主要靠发动机发电与“再生制动”回收能量充电。","对比：PHEV（插电式混合动力）可以外接充电、纯电行驶里程更长；EV（纯电动）没有内燃机。"],"etymology":"由 hybrid（“混合的”）+ electric（“电动的”）+ vehicle（“交通工具/车辆”）组成；该术语在汽车工业中用于指“油电并用”的动力系统分类。","mnemonic":["记忆法：hybrid=“混合”，electric=“电”，vehicle=“车” → “混合+电+车”=“油电混合车”。","联想：看到 HEV 就想成“Hybrid + Electric + Vehicle”的首字母拼起来。"]}
{"word":"hybrid language","summary":{"en":"a mixed way of speaking that combines elements from multiple languages","zh":"由多种语言元素混合而成的表达方式"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A way of speaking or writing that combines elements from two or more languages (for example, vocabulary from one language and grammar from another), often used within a community or specific setting.","zh":"一种把两种或多种语言的元素混合在一起的表达方式（例如用一种语言的词汇、另一种语言的语法），常在某个群体或特定场景中使用。"},"examples":[{"en":"In some border towns, people naturally use a hybrid language in daily conversations.","zh":"在一些边境城镇，人们在日常对话中会很自然地使用一种混合语言。"},{"en":"Online communities sometimes create a hybrid language with English slang and local expressions.","zh":"网络社群有时会把英语俚语和本地说法混在一起，形成一种混合语言。"},{"en":"The novel shows characters switching into a hybrid language to express identity.","zh":"这部小说展示人物用混合语言来表达身份认同。"}]},{"partOfSpeech":"phrase","definition":{"en":"In linguistics, a relatively stable mixed language that develops when bilingual speakers systematically combine parts of different languages over time.","zh":"（语言学）一种较稳定的“混合语”，由双语使用者在较长时间里系统地融合不同语言的成分而形成。"},"examples":[{"en":"Researchers study how a hybrid language can become stable across generations.","zh":"研究者会探讨一种混合语言如何在几代人之间变得稳定。"},{"en":"Some hybrid languages preserve grammar from one source language but borrow many words from another.","zh":"有些混合语言保留一种来源语言的语法，同时从另一种语言大量借词。"}]}],"synonyms":["mixed language","language blend","linguistic hybrid","macaronic language","Spanglish","code-mixed speech"],"phonetic":"ˈhaɪbrɪd ˈlæŋɡwɪdʒ","extraExplanation":["“hybrid language”是比较宽泛的说法：可以指日常交流里的混合表达，也可以指语言学中较固定的“混合语”。","与 pidgin（皮钦语）/ creole（克里奥尔语）不同：pidgin 常是为沟通而形成的简化语；creole 通常指 pidgin 成为母语并发展完善后形成的语言；而 hybrid language 强调“混合来源”。","也不同于 code-switching（语码转换）：语码转换多是在同一段话里来回切换两种语言；hybrid language 更强调已经“融合”成一种风格或系统。"],"etymology":"hybrid 来自拉丁语 hybrida（杂交的、混合的）；language 来自拉丁语 lingua（舌头、语言）。合在一起字面义为“混合的语言”。","mnemonic":["hybrid≈“混搭/混合”，所以 hybrid language 就是“混搭的语言”。","把它想成“火锅语言”：不同“汤底”（语言）里的词和结构被放到同一锅里一起用。"]}
{"word":"hybrid rice","summary":{"en":"rice bred by crossing two parent varieties for better traits","zh":"由不同亲本杂交培育、以获得更优性状的水稻"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rice produced from crossing two different parent varieties to combine desirable traits such as higher yield and stronger disease resistance","zh":"由两种不同亲本稻种杂交培育而成的水稻，通常结合高产、抗病等优良性状"},"examples":[{"en":"Hybrid rice can produce more grain per hectare than many traditional varieties.","zh":"杂交水稻每公顷的产量可能比许多传统品种更高。"},{"en":"Farmers chose hybrid rice because it performed well in hot, humid weather.","zh":"农民选择杂交水稻，因为它在炎热潮湿的天气里表现很好。"},{"en":"Some hybrid rice seeds need to be bought each season to keep the same yield.","zh":"一些杂交水稻种子需要每季购买，才能保持相同的产量。"}]}],"synonyms":["crossbred rice","F1 rice"],"phonetic":"/ˈhaɪ.brɪd raɪs/","extraExplanation":["“杂交水稻”通常指利用杂种优势（heterosis）培育的水稻组合，比一般常规品种更高产；这一领域在中国发展尤其突出，常与袁隆平等育种科学家的贡献联系在一起。","注意区分：hybrid rice（杂交水稻）≠ genetically modified rice（转基因水稻）。杂交是传统育种方法，通过亲本杂交选择；转基因是把特定基因导入。"],"etymology":"“hybrid”来自拉丁语 hybridus（杂交的），指不同来源的交配/结合；“hybrid rice”作为农业术语，用来强调这种水稻是通过杂交育种获得的品种（或品系）。","mnemonic":["hy-brid 可以联想“混合的桥（bridge）”：把两种稻种“搭桥”混合，产生更强的后代。","把 hybrid 记成“混（hy）+ 结合（brid）”：两种亲本结合得到新稻种。"]}
{"word":"hybrid viewfinder","summary":{"en":"A camera viewfinder combining optical and electronic viewing.","zh":"结合光学与电子显示的相机取景器。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A camera viewfinder that combines an optical view (seeing through a window) with an electronic display, letting you switch between—or overlay—both.","zh":"一种把光学取景（通过小窗直接看）与电子显示取景结合在一起的相机取景器，可在两者间切换，或把信息叠加显示。"},"examples":[{"en":"This camera’s hybrid viewfinder lets you switch from an optical view to an electronic view instantly.","zh":"这台相机的混合取景器让你可以从光学取景瞬间切换到电子取景。"},{"en":"I use the hybrid viewfinder for street photography because I can see outside the frame.","zh":"我拍街拍时会用混合取景器，因为我能看到画面框外的情况。"},{"en":"In low light, the electronic part of the hybrid viewfinder makes focusing much easier.","zh":"在弱光下，混合取景器的电子部分让对焦更容易。"}]}],"synonyms":["dual viewfinder","optical-electronic viewfinder","OVF/EVF viewfinder","switchable viewfinder"],"phonetic":"/ˈhaɪbrɪd ˈvjuˌfaɪndɚ/","extraExplanation":["常见于部分旁轴风格机型（例如某些富士机型）：光学取景更自然、无延迟，还可能看到框外；电子取景能预览曝光/白平衡、放大对焦、显示直方图等信息。","不同厂商实现方式不同：有的是“光学/电子一键切换”，有的是在光学画面上叠加电子信息。"],"etymology":"“hybrid”源自拉丁语 hybrida（混合体）；“viewfinder”由 view（看）+ finder（寻找器/定位器）构成，原指帮助构图取景的装置。组合起来指“混合式取景器”。","mnemonic":["hybrid = “混血/混合”，viewfinder = “取景器”，合起来就是“混合取景器”。","记法：OVF（光学）+ EVF（电子）→ 变成“二合一”的取景方式。"]}
{"word":"hybrid-vigor","summary":{"en":"greater strength or productivity often seen in crossbred offspring","zh":"杂交后代常表现出的更强健或更高产的优势"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency for the offspring of genetically different parents (especially crossbred plants or animals) to be healthier, stronger, or more productive than either parent; heterosis","zh":"（不同遗传背景的亲本杂交后）后代往往更健康、更强壮或产量更高的现象；杂种优势（亦称“杂交优势/异交优势”）"},"examples":[{"en":"Many high-yield corn varieties were developed by taking advantage of hybrid vigor.","zh":"许多高产玉米品种就是利用杂种优势培育出来的。"},{"en":"Hybrid vigor can improve disease resistance, but it may decrease in later generations if the cross is not maintained.","zh":"杂种优势可能提升抗病性，但如果不持续保持杂交，后代几代之后优势可能会减弱。"}]}],"synonyms":["heterosis","hybrid advantage","crossbreeding advantage"],"phonetic":"ˈhaɪbrɪd ˈvɪɡɚ","extraExplanation":["常见使用场景：农业育种（玉米、水稻等杂交种）、畜牧育种（肉牛、家禽等）。","与“hybrid”在日常语境里的“混合动力车（hybrid car）”不同，hybrid vigor 专指生物学/育种学现象。","相关概念：inbreeding depression（近交衰退）常被认为是杂种优势的“反面效应”。"],"etymology":"由 hybrid（杂交的、混合的）+ vigor（活力、强健）组成；该术语在育种与遗传学语境中用来概括“杂交后代更强健”的现象，学术上常用同义词 heterosis（异交优势/杂种优势）。","mnemonic":["把它拆开记：hybrid（杂交）+ vigor（活力/强壮）= 杂交更有活力。","联想中文固定说法“杂种优势”：一杂交（hybrid）就更强健（vigor）。"]}
{"word":"hybrida","summary":{"en":"Hybrida is a Latin/scientific term meaning “hybrid,” commonly seen in plant names (e.g., *Rosa hybrida*).","zh":"Hybrida 是拉丁语/生物学用语，意为“杂交的/杂交体”，常见于植物学名中（如 *Rosa hybrida*）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a hybrid; especially a plant or organism produced by crossing two different species, varieties, or breeds (a Latin/scientific form often seen in botany)","zh":"杂交体；尤指由不同物种/品种/品系杂交产生的植物或生物（常见于拉丁语/生物学用法）"},"examples":[{"en":"In the greenhouse, the label said *Rosa hybrida*, meaning a hybrid rose.","zh":"在温室里，标签写着 *Rosa hybrida*，意思是“杂交玫瑰”。"},{"en":"Some garden plants are listed as *hybrida* because they come from two parent species.","zh":"有些园艺植物会标注 *hybrida*，因为它们来自两种亲本物种。"}]},{"partOfSpeech":"other","definition":{"en":"used in a scientific (Latin) name as a descriptor meaning “hybrid,” often placed after the genus name","zh":"（用于拉丁学名）作描述词，表示“杂交的”，常放在属名之后"},"examples":[{"en":"You’ll often see *hybrida* in plant names in catalogs and textbooks.","zh":"在植物目录和教材里，你常常会看到学名中出现 *hybrida*。"},{"en":"The epithet *hybrida* tells readers the plant has a mixed origin.","zh":"种加词 *hybrida* 会告诉读者这株植物有杂交来源。"}]}],"synonyms":["hybrid","crossbreed","hybridized (scientific context)"],"phonetic":"/haɪˈbrɪdə/","extraExplanation":["“hybrida”多见于植物学与园艺领域，是拉丁语形式（常作种加词/描述词）。例如 *Rosa hybrida* 通常指“杂交玫瑰”（园艺上许多现代玫瑰的统称），并不一定对应单一自然物种。","发音在英语环境里通常按“hybrid”的读法来读；在严谨的拉丁学名语境中，不同地区/学科也可能有略微不同的读法。"]}
{"word":"hybridae","summary":{"en":"“hybridae” is not standard everyday English; it’s a rare Latin-style form related to “hybrid.” Usually, write “hybrids.”","zh":"“hybridae”不是常见标准英语，多为拉丁式/分类学风格写法；一般应写“hybrids（杂交体/混合体）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare, Latin-style plural or taxonomic-looking form related to “hybrid”; not a standard everyday English word. In normal English, people usually say “hybrids.”","zh":"一种少见的拉丁式复数/分类学风格写法，与 hybrid（杂交体）相关；并非日常标准英语用词。一般英语里通常说 hybrids（杂交体/混合体）。"},"examples":[{"en":"In everyday English, you would write “hybrids,” not “hybridae.”","zh":"在日常英语中，你会写“hybrids”，而不是“hybridae”。"},{"en":"The report compares hybrids with purebred lines.","zh":"这份报告比较了杂交体与纯种系。"}]}],"synonyms":["hybrids","hybrid organisms","crossbreeds"],"phonetic":"/haɪˈbraɪdiː/","extraExplanation":["“hybridae”看起来像拉丁语/生物分类命名的形式：在动物分类中，家族常用后缀“-idae”（如 Felidae 猫科）。但“Hybridae”并不是常见、固定的英文词条；如果你是在学术或分类学语境中看到它，最好回到原文确认它是否是作者自造的类群名、拼写变体，或是否想表达“hybrids”。","如果你想表达“混合的/杂交的”，形容词用 hybrid；名词复数用 hybrids。"]}
{"word":"hybridal","summary":{"en":"“Hybridal” (rare) means “hybrid; mixed from different sources,” especially in older or academic writing.","zh":"“hybridal”（少见）意思是“杂交的/混合的”，多见于较旧或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Hybrid; made from a mix of different types, sources, or origins.","zh":"（少见）混合的；由不同类型、来源或起源混合而成的。"},"examples":[{"en":"The city is known for its hybridal culture, blending traditions from many immigrant communities.","zh":"这座城市以其“混合的”文化闻名，融合了许多移民社区的传统。"},{"en":"Some writers describe the novel as a hybridal form—part history, part fiction.","zh":"有些作家把这部小说称为一种“混合体”形式——一部分是历史，一部分是虚构。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, rare) Resulting from the crossing of two different species, varieties, or breeds; hybrid.","zh":"（生物学，少见）由两种不同物种、品种或种系杂交产生的；杂交的。"},"examples":[{"en":"Hybridal plants can sometimes be stronger than either parent type.","zh":"杂交植物有时会比任何一个亲本类型更强壮。"}]}],"synonyms":["hybrid","mixed","blended","composite"],"phonetic":"/haɪˈbraɪdəl/","extraExplanation":["“hybridal”在现代英语里非常少见，实际写作与日常交流中更常用的是“hybrid”（既可作形容词也可作名词）。如果你在学术或较老的文本里看到“hybridal”，通常可以理解为“hybrid”的同义替换。"]}
{"word":"hybridation","summary":{"en":"Hybridation means the process of forming a hybrid, most commonly through crossbreeding in biology, and more broadly the blending of different elements.","zh":"Hybridation 指形成“杂交体/混合体”的过程，最常见于生物杂交，也可引申为不同要素的融合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of creating a hybrid by crossing two different species, varieties, or strains (especially in biology and agriculture)","zh":"（尤指生物学、农业中）通过杂交不同物种、品种或品系而产生“杂交体/杂种”的过程"},"examples":[{"en":"Hybridation is widely used in plant breeding to produce crops that are more resistant to disease.","zh":"杂交广泛用于植物育种，以培育更抗病的作物。"},{"en":"The study examined hybridation between wild and domestic animals near human settlements.","zh":"该研究考察了人类聚居地附近野生动物与家养动物之间的杂交现象。"}]},{"partOfSpeech":"n.","definition":{"en":"a mixing or combination of different elements into one system (often in technology, culture, or ideas)","zh":"（引申义）不同要素的混合或融合（常用于科技、文化或思想领域）"},"examples":[{"en":"The hybridation of online and in-person classes has changed how many students learn.","zh":"线上与线下课程的融合改变了许多学生的学习方式。"},{"en":"This city is known for the hybridation of traditional and modern architecture.","zh":"这座城市以传统与现代建筑的融合而闻名。"}]}],"synonyms":["hybridization","crossbreeding","interbreeding","mixing","blending","fusion"],"phonetic":"/ˌhaɪbrɪdəˈzeɪʃən/","extraExplanation":["“hybridation”在英语里是可用的名词，但在日常与学术写作中更常见的是“hybridization”（美式拼法）或“hybridisation”（英式拼法）。如果你写的是美国英语论文，通常推荐用“hybridization”。","词根提示：hybrid（杂交的/混合的）+ -ation（名词后缀，表示“过程/行为”）。","相关词：hybrid (n./adj.) 杂交体/混合的；hybridize (v.) 使杂交/使融合；crossbreeding (n.)（动物）杂交繁育。"]}
{"word":"hybridisable","summary":{"en":"“Hybridisable” means “able to be hybridized or combined into a hybrid.”","zh":"“hybridisable”表示“可被杂交的；可融合成混合体的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be hybridized; capable of being crossed or combined to form a hybrid (in biology) or a mixed system/product (in technology or ideas).","zh":"可被杂交的；可进行混合/融合以形成“混合体”的（生物学上指杂交；科技或思想上指混合系统/产品）。"},"examples":[{"en":"Some plant varieties are easily hybridisable, so breeders can create new colors and flavors.","zh":"有些植物品种很容易杂交，因此育种者能培育出新的颜色和风味。"},{"en":"The two software tools are hybridisable, meaning they can be integrated into one workflow.","zh":"这两款软件工具具有可融合性，也就是说可以整合到同一个工作流程里。"}]}],"synonyms":["hybridizable","crossable","interbreedable","combinable","integrable"],"phonetic":"ˈhaɪbrɪˌdaɪzəbəl","extraExplanation":["“hybridisable”是英式拼写，更常见的美式拼写是“hybridizable”。两者意思相同。","词根提示：hybrid（混合体/杂交体）+ -ise/-ize（使……成为）+ -able（能够……的）。因此整体就是“能够被混合/杂交的”。"]}
{"word":"hybridisation","summary":{"en":"Hybridisation means the process of combining different things to form a hybrid; it’s also a key term in chemistry (orbital hybridization) and biology/genetics (DNA/RNA hybridisation).","zh":"Hybridisation 指“杂交/混合化”的过程；在化学中常指“轨道杂化”，在生物/遗传学中也可指“DNA/RNA 杂交”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making a hybrid by combining two different things (such as species, ideas, or technologies), resulting in a mixed form","zh":"杂交；混合化：把两种不同的事物（如物种、观念或技术）结合起来，形成混合体的过程"},"examples":[{"en":"Hybridisation between two plant varieties can create a stronger crop.","zh":"两种植物品种的杂交可以培育出更强壮的作物。"},{"en":"The hybridisation of online and in-person classes gives students more flexibility.","zh":"线上与线下课程的混合化让学生更灵活。"}]},{"partOfSpeech":"n.","definition":{"en":"in chemistry, the mixing of atomic orbitals to form new orbitals that help explain molecular shape and bonding (e.g., sp, sp2, sp3)","zh":"（化学）杂化：原子轨道相互“混合”形成新的杂化轨道，用来解释分子的形状与成键（如 sp、sp2、sp3）"},"examples":[{"en":"Carbon in methane shows sp3 hybridisation.","zh":"甲烷中的碳呈现 sp3 杂化。"},{"en":"Teachers often use hybridisation to explain why water has a bent shape.","zh":"老师常用杂化来解释为什么水分子是折线形。"}]},{"partOfSpeech":"n.","definition":{"en":"in biology and genetics, the pairing or combining of genetic material (such as DNA/RNA) from different sources, often for testing or research","zh":"（生物/遗传学）核酸杂交：来自不同来源的 DNA/RNA 互补配对或结合，常用于检测或研究"},"examples":[{"en":"DNA hybridisation can help identify a species or detect a virus.","zh":"DNA 杂交可以帮助鉴定物种或检测病毒。"}]}],"synonyms":["hybridization","mixing","crossbreeding","combination","integration"],"phonetic":"/ˌhaɪbrɪdəˈzeɪʃən/","extraExplanation":["“hybridisation”是英式拼写；美式更常写作“hybridization”。两者意思相同，只是拼写不同。","在日常语境里，它常指“把两种不同的东西结合成混合体”（例如教学模式、文化、技术）；在理科语境里更常指化学的“轨道杂化”或生物的“核酸杂交”。","词根“hybrid-”来自拉丁语，核心含义是“混合、杂交”。"]}
{"word":"hybridise","summary":{"en":"Hybridise means to combine or breed two different types to create a hybrid; it’s the British spelling of hybridize.","zh":"hybridise意为“杂交/融合成混合体”，是hybridize的英式拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(BrE spelling) to hybridize: to breed or combine two different types (plants, animals, ideas, technologies) to create something mixed.","zh":"（英式拼写）杂交；混合：将两种不同类型（植物、动物、想法、技术等）结合，产生混合体。"},"examples":[{"en":"Scientists hybridise two varieties of rice to produce a stronger crop.","zh":"科学家让两种水稻品种杂交，以培育更强壮的作物。"},{"en":"The company hybridised electric and gasoline power in its newest car model.","zh":"这家公司在最新车型中把电力与汽油动力结合成混合动力。"},{"en":"Some modern novels hybridise history and fantasy.","zh":"一些现代小说把历史与奇幻融合在一起。"}]}],"synonyms":["hybridize","crossbreed","interbreed","combine","mix","blend"],"phonetic":"/ˈhaɪbrəˌdaɪz/","extraExplanation":["“hybridise”是英式拼写；美式拼写更常见的是“hybridize”。两者意思相同。","词根提示：hybrid（杂交体、混合体）+ -ise/-ize（使……化/使成为）。在科技与文化语境里，常指“把两种体系融合成一种新形式”，不只限于生物学。"]}
{"word":"hybridised","summary":{"en":"“Hybridised” means “made into a hybrid / combined from two different things.” It can also be the past form of “hybridise.”","zh":"“hybridised”表示“混合化、杂交化”，也可作“hybridise”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(BrE spelling) Combined from two different types, ideas, or systems; made into a hybrid.","zh":"（英式拼写）由两种不同类型/思想/系统结合而成的；混合成“杂交体/混合体”的。"},"examples":[{"en":"Many modern cars are hybridised systems that use both petrol and electric power.","zh":"许多现代汽车是“混合化”的系统，同时使用汽油和电力。"},{"en":"The course has been hybridised, mixing online lessons with face-to-face classes.","zh":"这门课程被混合化了，把线上课程和线下课堂结合起来。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “hybridise”: to combine or mix two different things to create something new; in biology, to cross-breed.","zh":"“hybridise”的过去式/过去分词：把两种不同事物结合成新事物；（生物学）使杂交、进行杂交繁育。"},"examples":[{"en":"Scientists hybridised two plant varieties to produce a hardier crop.","zh":"科学家让两种植物品种杂交，培育出更耐寒的作物。"},{"en":"The company hybridised its old workflow with new AI tools.","zh":"这家公司把旧的工作流程与新的 AI 工具结合起来。"}]}],"synonyms":["hybridized","combined","blended","mixed","cross-bred"],"phonetic":"/ˈhaɪbrɪˌdaɪzd/","extraExplanation":["“hybridised”是英式拼写；美式更常写作“hybridized”。两者意思相同。","常见搭配：hybridised model/system/approach（混合模式/系统/方法）；在生物语境也常见：hybridised species/varieties（杂交物种/品种）。"]}
{"word":"hybridiser","summary":{"en":"A hybridiser is a person or thing that creates hybrids by combining two different types, especially in plant breeding.","zh":"hybridiser 指通过结合两种不同类型来产生杂交/混合结果的人或事物，尤其常用于园艺育种领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that hybridizes—i.e., combines two different types (such as plants, animals, ideas, or technologies) to produce a hybrid","zh":"杂交者；混合者（把两种不同类型的事物，如植物、动物、想法或技术结合起来，产生“混合/杂交”结果的人或事物）"},"examples":[{"en":"The hybridiser crossed two rose varieties to create a new color.","zh":"这位杂交者把两种玫瑰品种杂交，培育出一种新颜色。"},{"en":"In some EV designs, the hybridiser is the control system that blends power from the engine and motor.","zh":"在一些混合动力电动车设计中，“hybridiser”指的是把发动机与电机动力进行融合的控制系统。"}]}],"synonyms":["hybridizer","breeder","crossbreeder","cross-pollinator"],"phonetic":"/ˈhaɪbrəˌdaɪzər/","extraExplanation":["“hybridiser”多见于英式拼写；美式更常写作“hybridizer”。两者意思相同。","词根提示：hybrid（杂交的/混合的）+ -ise/-ize（使……）+ -er（做……的人/物）。在园艺、育种领域尤其常用。"]}
{"word":"hybridising","summary":{"en":"Hybridising means combining different things or crossbreeding to create a hybrid.","zh":"Hybridising 指把不同事物结合起来，或进行杂交以产生杂交种。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"combining two different things (ideas, methods, systems, etc.) to create something new; mixing","zh":"把两种不同的事物（想法、方法、系统等）结合起来，形成新的东西；混合"},"examples":[{"en":"The company is hybridising online and in-store shopping to improve the customer experience.","zh":"这家公司正在把线上购物和实体店购物结合起来，以提升顾客体验。"},{"en":"Her music is hybridising jazz with traditional folk sounds.","zh":"她的音乐把爵士和传统民谣的声音融合在一起。"}]},{"partOfSpeech":"v.","definition":{"en":"(biology/agriculture) producing a hybrid by crossing two different species, breeds, or varieties","zh":"（生物/农业）通过杂交不同的物种、品种或类型，培育出杂交种"},"examples":[{"en":"Scientists are hybridising two varieties of rice to make a stronger crop.","zh":"科学家正在把两种水稻品种杂交，以培育更强健的作物。"},{"en":"Bees can help by carrying pollen when farmers are hybridising plants.","zh":"当农民进行植物杂交时，蜜蜂可以通过传播花粉来提供帮助。"}]}],"synonyms":["hybridizing","combining","mixing","blending","crossbreeding"],"phonetic":"/ˈhaɪbrəˌdaɪzɪŋ/","extraExplanation":["“hybridising”是英式拼写；美式常写作“hybridizing”。两者意思相同，只是拼写习惯不同（-ise vs. -ize）。","词根“hybrid-”来自拉丁语，表示“杂交的、混合的”。在科技语境中常见如“hybrid system（混合系统）”“hybrid work（混合办公）”。"]}
{"word":"hybridism","summary":{"en":"Hybridism means a mixed combination of different things, especially in culture/language, and can also mean biological crossbreeding.","zh":"Hybridism 指不同事物的混合结合（尤指文化/语言），也可指生物学上的杂交。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice, process, or result of combining two different things (such as cultures, languages, styles, or ideas) to create something mixed","zh":"把两种不同事物（如文化、语言、风格或思想）结合在一起而形成混合体的做法、过程或结果"},"examples":[{"en":"Many modern cities show cultural hybridism in their food, music, and festivals.","zh":"许多现代城市在饮食、音乐和节庆上都体现出文化混合性。"},{"en":"The novel’s language is a kind of hybridism, mixing local slang with formal English.","zh":"这部小说的语言是一种混合性，把本地俚语和正式英语混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(in biology) the condition of being a hybrid, or the crossing of different species, breeds, or varieties","zh":"（生物学）杂交状态；不同物种、品种或变种之间的杂交"},"examples":[{"en":"Hybridism can produce plants that are more resistant to disease.","zh":"杂交可能培育出更抗病的植物。"},{"en":"Scientists discussed hybridism between closely related species.","zh":"科学家讨论了近缘物种之间的杂交现象。"}]}],"synonyms":["hybridity","mixing","blending","fusion","crossbreeding"],"phonetic":"/ˈhaɪbrɪˌdɪzəm/","extraExplanation":["“hybridism”常见于学术或正式语境（文化研究、语言学、生物学）。日常表达里更常用“hybridity”（混合性）或“mixing/blending”（混合/融合）。","词根提示：hybrid（杂交的/混合的）+ -ism（……主义/现象/倾向），因此强调“现象或倾向”，语气往往更抽象、更概念化。"]}
{"word":"hybridist","summary":{"en":"A hybridist is a person who creates or supports hybrids—either in a general sense (blending styles/systems) or, less commonly, in biology (hybridization).","zh":"hybridist 指主张或从事“混合/杂交”的人：可泛指融合不同风格或体系的人；较少见时指生物学中的杂交研究或育种者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who creates, promotes, or favors hybrids (things made by combining two different types, styles, or systems).","zh":"混合主义者；主张或偏好“混合体”（把两种不同类型、风格或体系结合起来的事物）的人。"},"examples":[{"en":"Some designers are hybridists who mix traditional craft with digital tools.","zh":"有些设计师是“混合主义者”，他们把传统工艺和数字工具结合起来。"},{"en":"The festival celebrated hybridists whose music blends jazz and hip-hop.","zh":"这个节日表彰那些把爵士和嘻哈融合在一起的音乐“混合主义者”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology, less common) A researcher or advocate of hybridization, especially the breeding or study of hybrid plants or animals.","zh":"（生物学，较少见）研究或主张杂交（杂交育种/杂交现象）的人，尤指研究或培育杂交动植物者。"},"examples":[{"en":"Early hybridists experimented with crossing different varieties of peas.","zh":"早期的杂交研究者尝试让不同品种的豌豆杂交。"},{"en":"The hybridist kept careful notes on which crosses produced stronger offspring.","zh":"这位杂交研究者仔细记录哪些杂交组合能产生更强壮的后代。"}]}],"synonyms":["hybridizer","breeder","experimentalist","mixer","fusion advocate"],"phonetic":"/ˈhaɪbrɪdɪst/","extraExplanation":["“hybridist”在现代英语中不算常用词，更常见的说法是“breeder（育种者）”“hybridization researcher（杂交研究者）”或在艺术/文化语境中说“someone who blends styles（融合风格的人）”。","词形结构：hybrid（混合体/杂交体）+ -ist（表示“从事者/拥护者”）。在不同领域（科技、艺术、文化、语言）都可能借用来指“主张融合的人”。"]}
{"word":"hybridity","summary":{"en":"Hybridity means the state of being mixed—especially a blend of cultures/identities or, in biology, being a hybrid.","zh":"Hybridity 指“混合性/杂糅状态”，常用于文化与身份的融合，也可指生物学上的“杂交性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being mixed from two or more different types, cultures, identities, or systems; a blend that creates something new","zh":"混合性；杂糅状态（由两种或多种不同类型、文化、身份或体系融合而成，并产生新的特征）"},"examples":[{"en":"The city’s food scene shows cultural hybridity, mixing local flavors with international techniques.","zh":"这座城市的美食景象体现了文化混合性，把本地风味与国际烹饪技法融合在一起。"},{"en":"Her music is known for hybridity—part jazz, part hip-hop, and part traditional folk.","zh":"她的音乐以“杂糅性”著称——一部分是爵士，一部分是嘻哈，还有一部分是传统民谣。"}]},{"partOfSpeech":"n.","definition":{"en":"in biology, the condition of being a hybrid; the result of crossing different species, varieties, or breeds","zh":"（生物学）杂交性；杂交状态（不同物种、品种或品系杂交所形成的特征/结果）"},"examples":[{"en":"Plant breeders study hybridity to develop crops that are more resistant to disease.","zh":"植物育种学家研究杂交性，以培育更抗病的作物。"},{"en":"The flower’s color variation is linked to hybridity from two parent varieties.","zh":"这种花的颜色变化与来自两种亲本品种的杂交性有关。"}]}],"synonyms":["mixing","blending","fusion","intermixture","syncretism"],"phonetic":"/haɪˈbrɪdəti/","extraExplanation":["“hybridity”在文化研究与后殖民研究中很常见，常用来讨论不同文化接触后形成的“第三种空间/新身份”，强调融合带来的创造性，也可能伴随张力与不平等。","词根来自“hybrid（杂交的/混合的）”，后缀“-ity”表示“……的状态/性质”。常见搭配：cultural hybridity（文化混合性）、linguistic hybridity（语言混合性）、identity hybridity（身份混合性）。"]}
{"word":"hybridizability","summary":{"en":"ability or potential to form hybrids","zh":"形成杂种（杂交）的能力或可能性"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability or potential to hybridize (to form a hybrid), especially in biology or breeding","zh":"（尤指生物学/育种中）发生杂交、形成杂种的能力或可能性"},"examples":[{"en":"Researchers tested the hybridizability of the two plant populations under controlled conditions.","zh":"研究人员在受控条件下测试了这两个植物种群的杂交能力。"},{"en":"Low hybridizability can help keep closely related species genetically distinct.","zh":"较低的杂交可能性有助于让近缘物种在遗传上保持区分。"}]}],"synonyms":["crossability","compatibility","hybridization potential","interbreeding potential"],"phonetic":"/ˌhaɪbrɪdˌaɪzəˈbɪləti/","extraExplanation":["这是一个偏学术/技术的名词，常见于进化生物学、遗传学、农业育种与生态学论文中。日常英语里更常用的表达是 ability to hybridize（杂交的能力）或 likelihood of hybridization（杂交的可能性）。","语义上常与 compatibility（相容性）、crossability（可杂交性）一起讨论；但 hybridizability 更强调“能不能形成杂种/杂交是否可发生”的总体潜力。"],"etymology":"由 hybridize（使杂交/杂交）+ -ability（……的能力）构成。hybrid 来自拉丁语 hybrida，意为“杂种；混合体”，后在生物学语境中发展为“不同品种/物种间交配产生后代”的概念。","mnemonic":["拆词记：hybrid（杂交/混合）+ -ize（使…）+ -ability（能力）→ “杂交的能力”。","联想中文：看到 -ability 就想“能力”，前面 hybrid- 对应“杂交/混合”，合起来就是“杂交能力”。"]}
{"word":"hybridizable","summary":{"en":"Hybridizable means “able to be hybridized or combined to form a hybrid.”","zh":"hybridizable 指“可杂交的；可混合组合形成杂交体/混合体的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be hybridized; capable of being combined with another type to create a hybrid (in biology, chemistry, or technology).","zh":"可杂交的；可与另一种类型结合形成“混合体/杂交体”的（用于生物、化学或科技语境）。"},"examples":[{"en":"These two plant varieties are hybridizable, so breeders can cross them to create a hardier crop.","zh":"这两种植物品种是可杂交的，所以育种者可以把它们杂交，培育出更耐寒的作物。"},{"en":"The new platform is hybridizable with existing systems, making integration easier.","zh":"这个新平台能与现有系统进行“混合式”兼容整合，因此更容易集成。"}]}],"synonyms":["hybridizable","crossable","interbreedable","compatible","integrable"],"phonetic":"/ˌhaɪbrəˈdaɪzəbəl/","extraExplanation":["“hybridizable”主要是技术/学术用词，日常对话里更常见的是“can be hybridized”或“compatible / integrable（可兼容/可整合）”，取决于具体语境。","构词：hybrid（混合体/杂交）+ -ize（使……化）+ -able（可……的）。在生物学里常指物种/品种能否杂交；在科技领域常指系统/架构是否支持混合部署或组合。"]}
{"word":"hybridization","summary":{"en":"Hybridization means the process of combining two different things—especially in biology (crossbreeding or DNA/RNA pairing)—to create a new mixture with features of both.","zh":"Hybridization 指把两种不同的事物结合起来的过程，常见于生物领域（杂交或 DNA/RNA 配对），形成兼具两者特征的新组合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of combining two different things (often species, ideas, methods, or technologies) to create a new mixture with features of both","zh":"杂交；混合化（把两种不同的事物——常见于物种、思想、方法或技术——结合起来，形成兼具两者特征的新组合）"},"examples":[{"en":"Hybridization between two plant varieties can produce a crop that is more resistant to disease.","zh":"两种植物品种的杂交可以培育出更抗病的作物。"},{"en":"In business, hybridization of online and in-person services is now common.","zh":"在商业领域，把线上服务与线下服务结合的混合化现在很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/chemistry) the joining or pairing of complementary genetic material (DNA/RNA) or molecules to form a stable combination","zh":"（生物/化学）杂交（指互补的遗传物质 DNA/RNA 或分子之间的配对结合，形成稳定组合）"},"examples":[{"en":"The lab used DNA hybridization to detect the presence of a specific gene.","zh":"实验室使用 DNA 杂交来检测某个特定基因是否存在。"},{"en":"Hybridization assays help researchers compare genetic similarity.","zh":"杂交实验能帮助研究者比较基因相似性。"}]}],"synonyms":["crossbreeding","mixing","blending","fusion","combination"],"phonetic":"/ˌhaɪbrədaɪˈzeɪʃən/","extraExplanation":["词源提示：hybrid 来自拉丁语 hybrida，意为“杂种/混合体”；-ization 表示“……的过程/行为”。因此 hybridization 字面就是“变成混合体的过程”。","常见搭配：hybridization between A and B（A 与 B 的杂交/融合）；genetic/DNA/RNA hybridization（遗传/DNA/RNA 杂交）；cultural hybridization（文化混合化）；policy/technology hybridization（政策/技术融合）。","语感区别：hybridization 更强调“过程/机制”；hybrid（名词/形容词）更强调“结果/产物”，如 a hybrid car（混合动力车）。"]}
{"word":"hybridization technique","summary":{"en":"a method for forming or detecting combinations, especially via DNA/RNA pairing in biology","zh":"用于形成或检测“组合/杂交”的方法，尤指生物学中的DNA/RNA配对检测"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a method used to create or detect a hybrid (a combination of two different things), especially in biology (e.g., breeding) or molecular biology (e.g., pairing complementary DNA/RNA strands to identify a sequence)","zh":"杂交技术；杂交法（指将两种不同来源的成分结合，或在分子生物学中让互补的DNA/RNA配对以检测/定位特定序列的方法）"},"examples":[{"en":"Plant breeders use a hybridization technique to combine disease resistance with higher yield.","zh":"植物育种者用杂交技术把抗病性和高产性结合起来。"},{"en":"The lab applied a hybridization technique to detect the presence of a specific viral gene.","zh":"实验室采用杂交法来检测是否存在某种特定的病毒基因。"},{"en":"Fluorescence in situ hybridization (FISH) is a hybridization technique used to locate genes on chromosomes.","zh":"荧光原位杂交（FISH）是一种用于在染色体上定位基因的杂交技术。"}]}],"synonyms":["crossbreeding method","hybrid method","DNA hybridization","nucleic acid hybridization","FISH"],"phonetic":"/ˌhaɪbrɪdəˈzeɪʃən tɛkˈnik/","extraExplanation":["在分子生物学里，hybridization 常指“核酸杂交”：单链DNA/RNA会与互补序列配对（像拉链一样对上），因此可用来检测、定位或定量某段序列。常见相关术语：probe（探针）、stringency（杂交严格性）、FISH（荧光原位杂交）、Southern/Northern blot（印迹杂交）。"],"etymology":"“hybridization”来自 hybrid（杂交体、混合体）+ -ization（……化/过程），表示“形成杂交/混合的过程”；“technique”表示“技术、方法”。合起来即“进行杂交/混合的具体方法”。","mnemonic":["把 hybrid 想成“混血/混合”，-ization 想成“……化/过程”，整体就是“变成混合/杂交的过程”；再加 technique=“技术”，即“让它杂交/配对的技术”。","联想“拉链配对”：核酸杂交就像两条拉链齿（互补碱基）对上，才能“合上”。"]}
{"word":"hybridizations","summary":{"en":"Hybridizations means processes (or results) of combining different things to form a hybrid, especially in biology and genetics.","zh":"Hybridizations 指将不同事物结合形成“混合体”的过程或结果，尤其常用于生物学与遗传学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of combining two different things (such as species, ideas, or technologies) to create a hybrid; the results of that process","zh":"杂交/混合的过程；将两种不同事物（如物种、观念或技术）结合而形成“混合体”的过程；也可指其产物"},"examples":[{"en":"Plant hybridizations can produce crops that are more resistant to disease.","zh":"植物杂交可以培育出更抗病的作物。"},{"en":"The hybridizations of old traditions with modern music created a new style.","zh":"把传统元素与现代音乐混合，产生了一种新风格。"},{"en":"In engineering, hybridizations of electric and gas power improve efficiency.","zh":"在工程领域，电力与燃油动力的混合方案能提升效率。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) the crossing of two different species, varieties, or genetically distinct individuals to produce offspring with mixed traits","zh":"（生物）两个不同物种/品种或遗传差异个体的交配（或人工授粉），以产生兼具特征的后代（杂交）"},"examples":[{"en":"Hybridizations between closely related species are more likely to succeed.","zh":"亲缘关系较近的物种之间更可能成功杂交。"},{"en":"Selective breeding often involves repeated hybridizations over many generations.","zh":"选育常常需要在许多代中反复进行杂交。"}]},{"partOfSpeech":"n.","definition":{"en":"(molecular biology) a method where a DNA or RNA strand binds to a complementary strand, used in tests and research","zh":"（分子生物学）核酸杂交：DNA或RNA与互补链结合的方法，用于检测与研究"},"examples":[{"en":"The lab confirmed the gene’s presence using hybridizations with a labeled probe.","zh":"实验室用带标记的探针进行核酸杂交，确认了该基因的存在。"},{"en":"Microarray experiments rely on many hybridizations happening at once.","zh":"基因芯片实验依赖大量同时发生的杂交反应。"}]}],"synonyms":["crossbreeding","mixing","blending","fusion","hybridization"],"phonetic":"/ˌhaɪbrɪdəˈzeɪʃənz/","extraExplanation":["“hybridizations”是名词复数形式；单数是“hybridization”。在日常语境里，它常泛指“混合/融合”，但在生物与分子生物学里是更专业、更具体的术语（如“杂交”“核酸杂交”）。"]}
{"word":"hybridize","summary":{"en":"Hybridize means to combine two different things into a new mixed form, or (in biology) to breed two different varieties/species.","zh":"Hybridize 指把两种不同事物结合成新的混合形式；也可指（生物学）不同品种/物种的杂交育种。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To combine two different things (such as ideas, methods, or technologies) to make a new mixed form.","zh":"把两种不同的事物（如想法、方法或技术）结合起来，形成一种新的混合形式。"},"examples":[{"en":"The company hybridized online learning with in-person classes.","zh":"这家公司把线上学习和线下课程结合起来。"},{"en":"Many modern cars hybridize electric power and gasoline engines.","zh":"许多现代汽车把电力驱动和汽油发动机结合起来。"}]},{"partOfSpeech":"v.","definition":{"en":"(Biology) To breed plants or animals from two different varieties or species so the offspring has traits from both.","zh":"（生物）让不同品种或物种的动植物杂交，使后代同时具有双方的特征。"},"examples":[{"en":"Farmers hybridize corn to improve yield and disease resistance.","zh":"农民通过杂交玉米来提高产量和抗病性。"},{"en":"Scientists hybridized two strains to create a hardier plant.","zh":"科学家将两个品系杂交，培育出更耐环境的植物。"}]}],"synonyms":["combine","blend","mix","merge","crossbreed"],"phonetic":"/ˈhaɪbrəˌdaɪz/","extraExplanation":["“hybridize”来自“hybrid（杂交的/混合的）”。在日常语境中常指“把两种系统或做法融合”，在生物学语境中更具体地指“杂交育种”。","常见相关词：hybrid（n./adj. 混合体；混合的）、hybridization（n. 杂交；融合）。"]}
{"word":"hybridized","summary":{"en":"“Hybridized” means made by combining two different types; it is also the past form of “hybridize.”","zh":"“hybridized”表示“由两种不同类型结合而成的（杂交的/混合的）”，也可作“hybridize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something such as a plant, animal, product, or idea) made by combining two different types; mixed to create a hybrid","zh":"（植物、动物、产品或想法等）通过结合两种不同类型而形成的；杂交的；混合而成的"},"examples":[{"en":"Hybridized corn can be more resistant to disease.","zh":"杂交玉米可能更抗病。"},{"en":"The company sells hybridized cars that use both gas and electricity.","zh":"这家公司销售混合动力汽车（结合汽油与电力）。"},{"en":"Her style is hybridized, blending classical music with hip-hop beats.","zh":"她的风格是混合的，把古典音乐和嘻哈节奏融合在一起。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “hybridize”: to combine two different types to produce a hybrid","zh":"“hybridize”的过去式/过去分词：使两种不同类型结合以产生杂交体；使混合"},"examples":[{"en":"Scientists hybridized two strains to create a stronger crop.","zh":"科学家把两种品系进行杂交，培育出更强壮的作物。"},{"en":"Over time, the language has hybridized with words from neighboring cultures.","zh":"随着时间推移，这种语言吸收了邻近文化的词汇，逐渐形成了混合特点。"}]}],"synonyms":["mixed","crossbred","combined","blended","merged"],"phonetic":"/ˈhaɪbrəˌdaɪzd/","extraExplanation":["“hybridized”常见于生物学/农业（杂交育种）以及更广义的“融合、混搭”（文化、语言、音乐、设计）。在基因或品种语境里，它通常强调“有目的的交配/组合”；在文化语境里，更强调“风格或元素的融合”。","相关词：hybrid（混合体；混合的）、hybridize（使杂交/使融合）、hybridization（杂交；融合过程）。注意不要与“genetically modified (GMO, 转基因)”混为一谈：杂交通常是同种或近缘种之间的繁殖组合，而转基因涉及直接改变DNA。"]}
{"word":"hybridizer","summary":{"en":"A hybridizer is someone (or sometimes something) that creates hybrids by combining two different types, especially through crossbreeding in plants or animals.","zh":"hybridizer 指通过把两种不同类型结合起来而创造“杂交/混合”结果的人（有时也指装置），常见于动植物杂交育种语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or organization that creates hybrids by crossbreeding (especially plants or animals) to combine desirable traits.","zh":"（尤指动植物育种中的）杂交者；进行杂交育种的人或机构，用交配/授粉来结合不同品种的优良性状。"},"examples":[{"en":"The hybridizer developed a new rose with a stronger fragrance.","zh":"这位杂交育种者培育出了一种香味更浓的新玫瑰。"},{"en":"Seed companies often hire expert hybridizers to improve crop yields.","zh":"种子公司常会聘请专业杂交育种者来提高作物产量。"}]},{"partOfSpeech":"n.","definition":{"en":"A machine, tool, or component that combines two different systems or materials to produce a hybrid result.","zh":"（机器/工具/部件）混合器；用于把两种不同系统或材料结合起来形成“混合/混合型”结果的装置。"},"examples":[{"en":"In the lab, a chemical hybridizer was used to blend two polymers into a tougher material.","zh":"在实验室里，研究人员用一种混合装置把两种聚合物结合成更坚韧的材料。"},{"en":"The engineer described the device as a hybridizer that merges analog and digital signals.","zh":"工程师把该设备描述为一种将模拟信号与数字信号融合的混合器。"}]}],"synonyms":["breeder","crossbreeder","plant breeder","hybrid breeder","mixer","blender"],"phonetic":"/ˈhaɪbrɪˌdaɪzər/","extraExplanation":["“hybridizer”来自“hybrid（杂交的/混合的）+ -ize（使成为）+ -er（做……的人/物）”。因此它既可以指“做杂交的人”，也可泛指“把两种不同事物结合起来的装置/工具”。","在园艺与农业语境中最常见：hybridizer 常指培育新品种的育种家（例如玫瑰、玉米等）。"]}
{"word":"hybridizers","summary":{"en":"“Hybridizers” means people or things that create hybrids by combining different types, especially in plant breeding or technology.","zh":"“Hybridizers”指通过结合不同类型来创造“杂交/混合”成果的人或事物，常见于植物育种或科技语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or tools that create hybrids by combining two different types (such as plants, animals, ideas, or technologies).","zh":"进行“杂交/混合”的人或工具；通过结合两种不同类型（如植物、动物、想法或技术）来产生“混合体/杂交体”的人或事物。"},"examples":[{"en":"Plant hybridizers developed a tomato that resists disease and tastes sweeter.","zh":"植物杂交育种者培育出一种既抗病又更甜的番茄。"},{"en":"In tech, hybridizers combine features from different systems to build a more flexible product.","zh":"在科技领域，混合器会把不同系统的特性结合起来，打造更灵活的产品。"}]}],"synonyms":["breeders","crossbreeders","innovators","mixers","integrators"],"phonetic":"/ˈhaɪbrɪˌdaɪzərz/","extraExplanation":["“hybridizers”是“hybridizer”的复数。常见语境包括：\n1) 农业/园艺：指进行杂交育种的人（如培育新品种的育种家）。\n2) 工程/科技/商业：比喻或泛指“把不同方案混合起来的人/工具/系统”。\n\n词根提示：hybrid（杂交的/混合的）+ -ize（使成为…）+ -er（做…的人/物）。"]}
{"word":"hybridizes","summary":{"en":"“Hybridizes” means (1) combines two different things to make a hybrid, (2) cross-breeds in biology, or (3) binds by DNA/RNA base pairing in molecular biology.","zh":"“Hybridizes”意为（1）把两种不同事物融合成混合形式；（2）生物学上的杂交繁育；或（3）分子生物学中DNA/RNA通过互补配对而“杂交”结合。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “hybridize”) to combine two different things to create a hybrid; to mix features from two sources.","zh":"（“hybridize”的第三人称单数）把两种不同的事物结合起来，形成“混合体/混合形式”；使具有两者特征。"},"examples":[{"en":"The company hybridizes online services with in-store support.","zh":"这家公司把线上服务和线下门店支持结合起来。"},{"en":"The new model hybridizes classic design with modern technology.","zh":"新款把经典设计与现代科技融合在一起。"}]},{"partOfSpeech":"v.","definition":{"en":"(biology) to produce offspring by crossing two different species, breeds, or varieties.","zh":"（生物学）使杂交；通过不同物种/品种/变种交配产生后代。"},"examples":[{"en":"Some plants hybridizes easily in the wild.","zh":"有些植物在野外很容易发生杂交。"},{"en":"Breeders hybridizes two varieties to improve disease resistance.","zh":"育种者让两种品种杂交，以提高抗病性。"}]},{"partOfSpeech":"v.","definition":{"en":"(genetics/molecular biology) to bind by complementary base pairing (e.g., DNA or RNA strands hybridize).","zh":"（遗传/分子生物学）通过互补碱基配对而结合（如DNA或RNA链“杂交”结合）。"},"examples":[{"en":"At the right temperature, the probe hybridizes to the target DNA.","zh":"在合适的温度下，探针会与目标DNA杂交结合。"},{"en":"The primer hybridizes near the gene of interest.","zh":"引物会在目标基因附近与模板杂交结合。"}]}],"synonyms":["combines","blends","mixes","crossbreeds","interbreeds"],"phonetic":"/ˈhaɪbrɪˌdaɪz/","extraExplanation":["“hybridizes”是动词“hybridize”的第三人称单数（he/she/it hybridizes）。常见名词是“hybrid”（杂交体/混合体），形容词常用“hybrid”（混合的）或“hybridized”（被杂交/被融合的）。","在日常语境里，hybridize 常指“把两种方式融合”（如线上+线下、传统+现代）；在科研语境里，常指“DNA/RNA杂交结合”，搭配词包括 probe、primer、target、sequence 等。"]}
{"word":"hybridizing","summary":{"en":"Hybridizing means combining different things to create a new mix, or (in biology) crossing plants/animals to produce a hybrid.","zh":"Hybridizing 指将不同事物融合成新的组合；在生物学中指对动植物进行杂交以培育杂交品种。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"combining two different things (ideas, systems, styles, etc.) to make something new; mixing or blending","zh":"把两种不同的事物（想法、系统、风格等）结合起来，创造出新的东西；混合、融合"},"examples":[{"en":"The company is hybridizing online learning with in-person classes.","zh":"这家公司正在把线上学习与线下课程融合起来。"},{"en":"Her design style comes from hybridizing traditional patterns with modern colors.","zh":"她的设计风格来自把传统图案与现代色彩融合在一起。"}]},{"partOfSpeech":"v.","definition":{"en":"(biology/agriculture) breeding or crossing different plants or animals to produce a hybrid with desired traits","zh":"（生物/农业）让不同品种的植物或动物杂交，培育出具有特定优良性状的杂交后代"},"examples":[{"en":"Researchers are hybridizing two rice varieties to improve disease resistance.","zh":"研究人员正在杂交两种水稻品种，以提高抗病能力。"},{"en":"Farmers have been hybridizing crops for generations to increase yield.","zh":"农民几代人一直在对作物进行杂交育种，以提高产量。"}]}],"synonyms":["combining","blending","mixing","integrating","crossing","crossbreeding"],"phonetic":"/ˈhaɪbrɪˌdaɪzɪŋ/","extraExplanation":["“hybridizing”是动词“hybridize”的现在分词/动名词形式，常见于学术写作与技术语境（如生物育种、工程设计、商业模式）。","在科技与商业中，它往往带有“取长补短、整合优势”的含义；在生物学中更偏向“杂交/杂交育种”的具体操作。"]}
{"word":"hybridoma","summary":{"en":"A hybridoma is a fused cell line used mainly to produce monoclonal antibodies.","zh":"杂交瘤是通过细胞融合得到的细胞系，主要用于生产单克隆抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lab-made cell line created by fusing an antibody-producing B cell with a myeloma (cancer) cell, used to produce large amounts of a single (monoclonal) antibody.","zh":"一种在实验室中将产生抗体的B细胞与骨髓瘤（肿瘤）细胞融合而成的细胞系，用来大量生产单一（单克隆）抗体。"},"examples":[{"en":"Scientists use hybridomas to make monoclonal antibodies for medical tests.","zh":"科学家用杂交瘤来制造用于医学检测的单克隆抗体。"},{"en":"A stable hybridoma can keep producing the same antibody for years.","zh":"稳定的杂交瘤可以多年持续产生同一种抗体。"},{"en":"The researchers screened many hybridoma cells to find the best antibody producer.","zh":"研究人员筛选了许多杂交瘤细胞，以找到最优的抗体生产者。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, any hybrid cell produced by fusing two different cells, especially in research.","zh":"更广义地说，指通过融合两种不同细胞得到的杂交细胞，尤用于科研语境。"},"examples":[{"en":"Cell fusion can create a hybridoma-like hybrid cell for studying gene expression.","zh":"细胞融合可以产生类似杂交瘤的杂交细胞，用于研究基因表达。"}]}],"synonyms":["hybrid cell line","monoclonal antibody–producing cell line"],"phonetic":"/ˌhaɪbrɪˈdoʊmə/","extraExplanation":["“hybridoma”由 hybrid（杂交的）+ -oma（肿瘤/瘤，医学后缀）组成；名字中的“-oma”来自参与融合的 myeloma（骨髓瘤）细胞。","杂交瘤技术与单克隆抗体生产密切相关，常与“筛选（screening）”“克隆（cloning）”“培养（culture）”等实验步骤一起出现。"]}
{"word":"hybridous","summary":{"en":"“Hybridous” is not standard English; use “hybrid” to mean “a mix of two types.”","zh":"“hybridous”不是标准英语；表达“混合的/杂交的”应使用“hybrid”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard/incorrect spelling of “hybrid” (meaning a mix of two different types). In most writing, use “hybrid,” not “hybridous.”","zh":"“hybrid（混合的/杂交的）”的非标准/错误拼写。正式写作中通常不用“hybridous”，应使用“hybrid”。"},"examples":[{"en":"This is a hybrid car (not “hybridous car”).","zh":"这是一辆混合动力汽车（不要写成“hybridous car”）。"},{"en":"The company offers a hybrid work schedule—some days at home, some in the office.","zh":"这家公司提供混合办公安排——有些天在家，有些天在办公室。"}]}],"synonyms":["hybrid","mixed","blended","hybridized"],"phonetic":"/ˈhaɪbrɪd/","extraExplanation":["“hybridous”在英语里不常见，通常会被视为拼写错误或非标准用法。想表达“混合的”，常用：hybrid（最常用）、mixed、blended；想表达“被混合/杂交而成”，也可用 hybridized（较正式/学术）。","词源小贴士：hybrid 来自拉丁语 hybrida，常用于生物（杂交）、科技（混合动力/混合系统）、工作方式（hybrid work）等语境。"]}
{"word":"hybrids","summary":{"en":"“Hybrids” means mixed types—especially organisms or things formed from two different kinds; it also commonly refers to hybrid vehicles.","zh":"“hybrids”指由两种不同类型混合而成的事物（常见于生物杂交或混合型产品），也常特指混合动力汽车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, animal, plant, or thing that is a mix of two different types or groups.","zh":"由两种不同类型或群体混合而成的人、动物、植物或事物。"},"examples":[{"en":"Mules are hybrids of a horse and a donkey.","zh":"骡子是马和驴的杂交后代。"},{"en":"Many garden flowers are hybrids bred for color and strength.","zh":"许多园艺花卉是为了颜色和抗性而培育的杂交品种。"},{"en":"The new laptop is a hybrid of a tablet and a traditional computer.","zh":"这款新笔记本电脑是平板和传统电脑的结合体。"}]},{"partOfSpeech":"n.","definition":{"en":"(In transportation) A vehicle that uses two kinds of power, especially a gasoline engine and an electric motor.","zh":"（交通领域）使用两种动力的车辆，尤其是汽油发动机与电动机结合的车辆。"},"examples":[{"en":"She drives a hybrid to save fuel in the city.","zh":"她开混合动力车在城市里省油。"},{"en":"Hybrids often switch to electric power at low speeds.","zh":"混合动力车在低速时常会切换为电力驱动。"}]},{"partOfSpeech":"adj.","definition":{"en":"Mixed; combining two different forms, methods, or ideas.","zh":"混合的；结合两种不同形式、方法或想法的。"},"examples":[{"en":"They created a hybrid work schedule with office days and remote days.","zh":"他们制定了“混合办公”安排，既有到办公室的日子也有远程办公的日子。"},{"en":"The course uses a hybrid approach: lectures plus hands-on practice.","zh":"这门课采用混合式方法：讲授加动手练习。"}]}],"synonyms":["mixes","crossbreeds","combinations","blends"],"phonetic":"/ˈhaɪbrɪdz/","extraExplanation":["“hybrid”来自拉丁语 hybrida，原意与“混血/杂交”有关。现代英语里它的用法很广：除了生物学上的“杂交”，还常用于科技与生活方式（如 hybrid car、hybrid work）。","单数是 hybrid；复数是 hybrids。重音通常在第一个音节：HY-brid。"]}
{"word":"hybris","summary":{"en":"Hybris (more commonly spelled hubris) means excessive pride that ignores limits and often leads to a fall.","zh":"hybris（更常写作 hubris）指过度的傲慢自大，无视界限，常导致失败或报应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive pride or self-confidence that makes someone ignore limits or warnings, often leading to a fall or punishment.","zh":"（常指）傲慢自大、过度自信，以致无视界限或警告，最终招致失败或惩罚。"},"examples":[{"en":"His hybris made him think he could never lose, so he took reckless risks.","zh":"他的傲慢自大让他以为自己永远不会失败，于是做出鲁莽的冒险。"},{"en":"In many stories, hybris is followed by a sudden downfall.","zh":"在许多故事中，傲慢自大之后往往紧接着突然的覆灭。"}]}],"synonyms":["hubris","arrogance","overconfidence","conceit","pride"],"phonetic":"/ˈhjuː.brɪs/","extraExplanation":["更常见的拼写是 **hubris**（发音相同）。**hybris** 主要见于古希腊语背景或学术写法，指人因“僭越本分、冒犯神明或道德秩序”的狂妄而遭报应。","在古希腊悲剧里，常见叙事是：**hubris（狂妄）→ nemesis（惩罚/报应）→ downfall（覆灭）**。例如《俄狄浦斯王》等作品常被用来讨论“人类对命运与权力的误判”。","学习提示：在现代英语里，**hubris** 常用于批评公众人物/公司/国家的“盲目自信”，语气偏负面，比单纯的 confidence（自信）更强、更不理性。"]}
{"word":"hybrises","summary":{"en":"“Hybrises” can mean (1) the plural of “hybris” (acts of arrogant pride) or (2) the verb form of UK “hybrise” meaning “hybridize.”","zh":"“Hybrises”既可指（1）“hybris”的复数（狂妄自大之举），也可指（2）英式动词“hybrise”的形式，意思是“使杂交/使混合（= hybridize）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of hybris) acts of arrogant pride—especially pride that leads to a fall or punishment.","zh":"（hybris 的复数）狂妄自大之举；尤指因傲慢而招致失败或惩罚的行为。"},"examples":[{"en":"Greek tragedies often warn that a hero’s hybrises can bring disaster.","zh":"希腊悲剧常警告：英雄的狂妄自大之举会招来灾祸。"},{"en":"His repeated hybrises at work cost him trust and support.","zh":"他在工作中一再的自大行为让他失去信任与支持。"}]},{"partOfSpeech":"v.","definition":{"en":"(chiefly UK spelling; 3rd person singular of hybrise) to make two different things combine into a hybrid; to hybridize.","zh":"（主要英式拼法；hybrise 的第三人称单数）使两种不同事物杂交/融合成混合体；使杂交；使混合化（= hybridize）。"},"examples":[{"en":"The lab hybrises two strains to create a hardier plant.","zh":"实验室让两个品系杂交，以培育更耐受的植物。"},{"en":"Some artists hybrises styles from different cultures in one performance.","zh":"有些艺术家会在一场表演中融合不同文化的风格。"}]}],"synonyms":["hubrises","arrogances","overconfidences","hybridizes","crossbreeds","blends"],"phonetic":"/haɪˈbraɪzɪz/","extraExplanation":["“hybris”来自希腊语“hubris（傲慢、过度自信）”，常用于文学与文化评论，尤其谈到“骄傲导致覆灭”的主题。","“hybrise”是英式拼法；美式更常写作“hybridize”。如果你想表达“傲慢自大”，通常用“hubris”（更常见拼法）而不是“hybris”。"]}
{"word":"hybristic","summary":{"en":"“Hubristic” means arrogantly overconfident—too proud in a way that ignores limits or risks.","zh":"“Hubristic” 指傲慢自大、过度自信，常含“忽视界限或风险”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing excessive pride or self-confidence; arrogantly overconfident (often in a way that ignores risks or other people).","zh":"傲慢自大、过度自信的；带有“目中无人、忽视风险/他人”的自负。"},"examples":[{"en":"His hubristic attitude made him believe he could never fail.","zh":"他傲慢自大的态度让他以为自己永远不会失败。"},{"en":"The company’s hubristic expansion plan ignored clear warning signs.","zh":"这家公司过度自信的扩张计划无视了明显的预警信号。"},{"en":"It was hubristic of her to think she could finish the project alone in one day.","zh":"她以为自己一天就能独自完成项目，这种想法有些自负。"}]}],"synonyms":["arrogant","overconfident","conceited","self-important"],"phonetic":"/hjuˈbrɪstɪk/","extraExplanation":["你输入的“hybristic”更常见的拼写是 **hubristic**（来自名词 **hubris**）。","**Hubris** 源于古希腊悲剧：指人因过度自负而“冒犯天意/触犯界限”，最终招致失败或惩罚。因此 **hubristic** 往往暗示“自大到忽视后果”。","常见搭配：**hubristic attitude/claim/decision/confidence**（傲慢的态度/言论/决定/自信）。","近义词：**arrogant, overconfident, conceited**。反义词：**humble, modest**。"]}

