{"word":"hye","summary":{"en":"“hye” is usually a misspelling of “hi/hey” used as an informal greeting; it can also be a rare surname.","zh":"“hye”通常是“hi/hey”的拼写错误，用作非正式问候；也可能是较少见的姓氏。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A common misspelling of “hi/hey,” used to greet someone informally.","zh":"“hi/hey”的常见拼写错误，用来非正式地打招呼。"},"examples":[{"en":"Hye! How are you? (Usually written: Hi!/Hey!)","zh":"Hye！你好吗？（通常写作：Hi!/Hey!）"}]},{"partOfSpeech":"n.","definition":{"en":"A rare surname (family name).","zh":"一种较少见的姓氏（家族姓）。"},"examples":[{"en":"Ms. Hye will join us for the meeting.","zh":"Hye女士会参加我们的会议。"}]}],"synonyms":["hi","hey","hello"],"phonetic":"/haɪ/","extraExplanation":["在英文聊天或社交媒体里，“hye”多半只是把“hey/hi”打错了；正式写作中建议用“hi/hey”。","如果你想表达韩语名字里的“혜”(Hye)，在英语里通常当作人名的一部分使用（例如 Hye-jin），发音和含义会因名字来源而不同。"]}
{"word":"hyemal","summary":{"en":"Hyemal means “related to winter.”","zh":"hyemal 表示“与冬季有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to winter; occurring in or typical of the winter season.","zh":"与冬季有关的；发生在冬季的；典型的冬季特征的。"},"examples":[{"en":"Hyemal winds can be harsh and dry in some regions.","zh":"在一些地区，冬季的风可能又冷又干，十分刺骨。"},{"en":"The hyemal rains arrive later than the summer storms.","zh":"冬季降雨到来得比夏季暴风雨更晚。"},{"en":"Some birds change their feeding habits during the hyemal months.","zh":"有些鸟在冬季的几个月里会改变觅食习惯。"}]}],"synonyms":["hiemal","winter","wintry","hibernal"],"phonetic":"/ˈhaɪ.ə.məl/","extraExplanation":["“hyemal”较罕见，更多见的拼写是“hiemal”。多用于较正式或学术语境（如气象、生态、地理写作），日常英语里通常直接说“winter”或“wintertime”。","词源来自拉丁语“hiems”（冬天）。在阅读中看到它时，可以把它理解为“winter-related”的书面替代词。"]}
{"word":"hyena","summary":{"en":"A hyena is a wild African animal with a dog-like body and a loud call that can sound like laughter.","zh":"hyena 指鬣狗：主要生活在非洲、外形像狗、叫声像笑声的野生动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wild animal that looks a bit like a dog and is known for its loud calls that can sound like laughter; hyenas live mainly in Africa and eat meat (and sometimes dead animals).","zh":"鬣狗：一种野生动物，外形有点像狗，以类似“笑声”的叫声闻名；主要生活在非洲，吃肉，也常吃腐肉。"},"examples":[{"en":"We saw a hyena near the road during our safari.","zh":"我们在野外游猎时在路边看到了一只鬣狗。"},{"en":"Hyenas often work in groups to find food.","zh":"鬣狗常常成群合作寻找食物。"},{"en":"The hyena’s call sounded like a strange laugh in the dark.","zh":"黑暗中鬣狗的叫声听起来像奇怪的笑声。"}]}],"synonyms":["spotted hyena","striped hyena"],"phonetic":"/haɪˈiːnə/","extraExplanation":["“hyena”在口语或文学里有时会被用来比喻“卑鄙、冷酷或趁火打劫的人”（如“a hyena in a suit”），这种用法带有强烈贬义，使用时要注意语境与礼貌。","虽然常见刻板印象把鬣狗说成“只会吃腐肉”，但真实的鬣狗（尤其是斑鬣狗 spotted hyena）也是很强的猎手，会主动捕猎。"]}
{"word":"hyena-like","summary":{"en":"resembling a hyena in sound or behavior, often in a harsh or cruel way","zh":"在声音或行为上像鬣狗（常含刺耳、残忍等贬义）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having qualities associated with a hyena, such as a harsh, cackling laugh or a cruel, scavenging manner.","zh":"像鬣狗的；带有鬣狗常见特征的（如刺耳的咯咯笑、残忍或以掠食/拾荒为主的行径）。"},"examples":[{"en":"He let out a hyena-like laugh that made everyone uncomfortable.","zh":"他发出一阵像鬣狗一样的笑声，让大家都很不舒服。"},{"en":"The tabloids described the crowd as hyena-like, eager for scandal.","zh":"小报把人群形容得像鬣狗一样，渴望丑闻。"}]}],"synonyms":["cruel","savage","vicious","predatory","scavenging","cackling"],"phonetic":"/haɪˈiːnə laɪk/","extraExplanation":["这个词多用于比喻和带强烈贬义的描写，常指“幸灾乐祸、残忍、爱捡便宜/围观别人失败”，而不只是“笑声像”。使用时注意语气可能很冒犯。","“hyena-like laugh” 是常见搭配，强调一种尖锐、断续、令人不安的笑。"],"etymology":"由“hyena（鬣狗）+ -like（像……的）”构成；-like 用来把名词变成形容词，表示“具有……特征”。","mnemonic":["拆开记：hyena（鬣狗）+ like（像）= 像鬣狗的。","联想中文：看到“hyena”就想到“鬣狗”常被文学/影视用来比喻“围观吃瓜、趁火打劫”的人。"]}
{"word":"hyenadog","summary":{"en":"hyenadog = a rare/informal term, usually meaning the African wild dog; sometimes a joke/description for a dog that looks like a hyena.","zh":"hyenadog＝少见的非正式说法，通常指非洲野犬；也可用来戏称“像鬣狗一样的狗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) Another name for the African wild dog (Lycaon pictus), a wild canine from sub-Saharan Africa, sometimes called the “painted dog.”","zh":"（非正式、少见）非洲野犬（彩绘犬，学名 Lycaon pictus）的别称；一种生活在撒哈拉以南非洲的野生犬科动物。"},"examples":[{"en":"The guide pointed out a pack of hyenadogs moving through the grass.","zh":"向导指着一群“hyenadogs”（非洲野犬）穿过草丛。"},{"en":"In older writing, you may see “hyenadog” used for the African wild dog.","zh":"在较早的文字里，你可能会看到用“hyenadog”来指非洲野犬。"}]},{"partOfSpeech":"n.","definition":{"en":"A dog described as looking or acting like a hyena (not a standard term; usually written as “hyena dog” in two words).","zh":"形容“像鬣狗一样”的狗（不是标准词；更常写作分开的“hyena dog”）。"},"examples":[{"en":"With its rough laugh and sharp profile, he joked that it was a hyena dog.","zh":"它的叫声像笑、侧脸线条又很尖，他开玩笑说那是一只“hyena dog”。"},{"en":"Most people would just say “a dog that looks like a hyena,” not “hyenadog.”","zh":"大多数人会说“看起来像鬣狗的狗”，而不是“hyenadog”。"}]}],"synonyms":["African wild dog","painted dog","Lycaon pictus","hyena dog"],"phonetic":"/haɪˈiːnə dɑɡ/","extraExplanation":["“hyenadog”不是常见的现代标准英语词，更多出现在旧资料、旅行/狩猎记述或口语化表达中。现代更推荐用更明确的名称：African wild dog / painted dog。","非洲野犬不是鬣狗，也不是家犬；它属于犬科，但外形和群体捕猎方式常让人联想到鬣狗，因此出现了这种别称。"]}
{"word":"hyenanchin","summary":{"en":"“Hainan chicken” usually refers to the dish Hainan chicken (rice): poached chicken served with fragrant rice and sauces.","zh":"“Hainan chicken”通常指“海南鸡（饭）”：白切/水煮鸡配香米饭与蘸酱的菜。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Hainan chicken (often in the dish name “Hainan chicken rice”): a Southeast Asian dish of poached chicken served with fragrant rice, usually with chili sauce and ginger-garlic sauce.","zh":"海南鸡（常见于菜名“海南鸡饭”）：一种东南亚常见菜肴，把白切/水煮鸡配上香米饭，通常搭配辣椒酱与姜蒜酱。"},"examples":[{"en":"I usually order Hainan chicken rice when I want something light but flavorful.","zh":"我想吃得清爽又有味道时，通常会点海南鸡饭。"},{"en":"This restaurant serves Hainan chicken with a spicy chili sauce on the side.","zh":"这家餐厅的海南鸡会另外配一小碟辣椒酱。"}]}],"synonyms":["Hainan chicken rice","Hainanese chicken rice"],"phonetic":"ˈhaɪˌnɑn ˈtʃɪkən","extraExplanation":["你输入的“hyenanchin”很可能是在拼写/输入法上想写 **Hainan chicken**（海南鸡，或海南鸡饭）。在英语菜单里更常见的完整说法是 **Hainan chicken rice**。","虽然名字里有“海南”，但这道菜在新加坡、马来西亚非常普遍，被认为是华人移民文化与当地饮食结合的代表菜之一。"]}
{"word":"hyenas","summary":{"en":"Hyenas = plural of hyena: wild mammals famous for a “laughing” call; they eat meat, often as scavengers.","zh":"hyenas 是 hyena 的复数：以“笑声”叫声闻名的野生哺乳动物，吃肉，常见为食腐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hyena; a wild, dog-like mammal found mainly in Africa and parts of Asia, known for a loud “laughing” call and for feeding on meat (often as a scavenger, sometimes as a hunter).","zh":"鬣狗；一种主要分布在非洲和部分亚洲的野生哺乳动物，外形有点像狗，以响亮的“笑声”叫声闻名，吃肉（常见为食腐，也会捕猎）。"},"examples":[{"en":"Hyenas often follow lions to eat what is left after a hunt.","zh":"鬣狗常常跟着狮子，吃狩猎后剩下的肉。"},{"en":"We heard hyenas laughing in the distance at night.","zh":"夜里我们听到远处鬣狗像在笑的叫声。"}]}],"synonyms":["hyena (singular)"],"phonetic":"/haɪˈiːnəz/","extraExplanation":["“hyenas”是“hyena”的复数形式。","在英语文化中，hyena 有时被用来比喻“贪婪、残忍或趁火打劫的人”，但这是带强烈贬义的用法；在真实生态里，鬣狗是重要的清道夫，对环境有益。","常见搭配：a pack/clan of hyenas（鬣狗群）；spotted hyena（斑鬣狗）；striped hyena（条纹鬣狗）。"]}
{"word":"hyenia","summary":{"en":"“Hyena” means a wild animal known for its laugh-like sound and for scavenging, though it can also hunt.","zh":"“Hyena”指鬣狗，以类似笑声的叫声和吃腐肉而闻名，但也会捕猎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hyena: a wild mammal from Africa and parts of Asia that looks somewhat like a dog, is known for a “laughing” sound, and often eats carrion (dead animals).","zh":"鬣狗：生活在非洲和部分亚洲的一种野生哺乳动物，外形有点像狗，以类似“笑声”的叫声而闻名，常以腐肉（动物尸体）为食。"},"examples":[{"en":"We saw a hyena near the campsite at night.","zh":"我们晚上在营地附近看到了一只鬣狗。"},{"en":"Hyenas are often misunderstood as only scavengers, but they can be skilled hunters too.","zh":"鬣狗常被误解为只吃腐肉，但它们也能成为很厉害的猎手。"}]}],"synonyms":["scavenger (figurative)","carnivore"],"phonetic":"/haɪˈiːnə/","extraExplanation":["你输入的“hyenia”通常是拼写错误；正确拼法是“hyena”（鬣狗）。","在一些英语语境里，\"a hyena\" 也可用来比喻“笑声刺耳的人”或“冷酷、爱占便宜的人”，但这种用法带有贬义，使用时要注意礼貌与语气。"]}
{"word":"hyenic","summary":{"en":"“Hyenic” is usually a misspelling of “hygienic” (clean and health-protecting).","zh":"“hyenic”通常是“hygienic”的拼写错误；“hygienic”意为“卫生的、能保护健康的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spelling note) The correct word is usually “hygienic,” meaning clean and good for health, especially by preventing disease.","zh":"（拼写提示）常见的正确拼写是 “hygienic”，意思是“卫生的、干净的”，尤其指能预防疾病、对健康有益。"},"examples":[{"en":"Food workers must follow hygienic practices, like washing their hands often.","zh":"餐饮从业者必须遵守卫生做法，比如经常洗手。"},{"en":"The clinic is clean and hygienic, so patients feel safer.","zh":"这家诊所干净又卫生，所以病人感觉更安心。"},{"en":"Using a hygienic water bottle helps reduce germs.","zh":"使用卫生的水瓶有助于减少细菌。"}]}],"synonyms":["clean","sanitary","sterile","germ-free"],"phonetic":"/haɪˈdʒiːnɪk/","extraExplanation":["“hyenic”多半是把“hygienic”拼错了：中间通常有“gy”（hy-gi-e-nic）。","“hygienic”常用来形容环境、习惯或产品（hygienic conditions/practices/products），语气比单纯的“clean（干净）”更强调“健康与防病”。","词源与“hygiene（卫生）”有关；日常搭配很常见：hygienic standards（卫生标准）、hygienic handling（卫生处理）。"]}
{"word":"hyeniform","summary":{"en":"Hyeniform means “hyena-like” (and less commonly, “related to hyenas” in biology).","zh":"hyeniform 意为“像鬣狗的”，较少见时也可指生物学上“与鬣狗（或鬣狗状特征）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hyena; hyena-like in appearance, behavior, or features.","zh":"像鬣狗的；具有鬣狗特征的（外形、行为或特质）。"},"examples":[{"en":"The story describes a hyeniform laugh that sounds harsh and wild.","zh":"故事里形容那笑声像鬣狗一样刺耳又狂野。"},{"en":"In the novel, the villain is given a hyeniform grin to emphasize cruelty.","zh":"在小说中，作者用“鬣狗般的笑容”来强调反派的残忍。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, less common) Relating to hyenas or to hyena-like carnivores in classification.","zh":"（生物学，较少见）与鬣狗有关的；或指分类学上“鬣狗类/鬣狗状”食肉动物的。"},"examples":[{"en":"The paper compares hyeniform and feliform traits among different carnivores.","zh":"论文比较了不同食肉动物的鬣狗状特征与猫型特征。"},{"en":"Fossils were discussed in terms of whether they fit a hyeniform lineage.","zh":"这些化石被讨论其是否符合某条“鬣狗状”演化支系。"}]}],"synonyms":["hyena-like","hyaeniform","hyaenid (biology)"],"phonetic":"/haɪˈiːnəˌfɔːrm/","extraExplanation":["“hyeniform”由“hyena（鬣狗）+ -form（形状、形态）”构成，字面意思就是“鬣狗形态的”。在文学或描述性写作里常用来渲染一种粗厉、贪婪或阴森的感觉（比如“hyeniform laugh/grin”）。","在动物分类里，你有时会看到更常用的对应词如“hyaenid（鬣狗科的）”“hyaeniform（鬣狗形的）”，但“hyeniform”也能用来表达“鬣狗状”的特征比较。"]}
{"word":"hyenine","summary":{"en":"Hy enine means “hyena-like,” often describing a harsh laugh or cruel, scavenging behavior.","zh":"hyenine意为“像鬣狗的”，常用来形容刺耳的笑声或残忍、掠夺/食腐式的行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or characteristic of a hyena (often suggesting a harsh laugh or scavenging behavior).","zh":"与鬣狗有关的；像鬣狗的；具有鬣狗特征的（常带有“刺耳的笑声”或“食腐/掠夺”的联想）。"},"examples":[{"en":"The villain let out a hyenine laugh that made everyone uneasy.","zh":"反派发出一阵鬣狗般刺耳的笑声，让大家都不安。"},{"en":"In the story, the warlord’s hyenine greed drove him to steal from the weak.","zh":"在故事里，军阀那种“鬣狗般”的贪婪驱使他去掠夺弱者。"}]}],"synonyms":["hyena-like","bestial","savage","scavenging"],"phonetic":"/ˈhaɪənaɪn/","extraExplanation":["“hyenine”来自“hyena（鬣狗）+ -ine（形容词后缀，表示‘……的/像……的’）”。在文学或评论中，它常带贬义或阴暗色彩，用来强调‘残忍、卑劣、食腐般’或‘尖笑刺耳’的感觉。","这个词相对少见，更常见的替代表达有：hyena-like（像鬣狗的）、bestial（兽性的）、scavenging（掠夺/食腐式的，作形容词用时需看语境）。"]}
{"word":"hyenoid","summary":{"en":"Hyenoid means “hyena-like; relating to or resembling a hyena.”","zh":"hyenoid 指“鬣狗般的；与鬣狗有关的或像鬣狗的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or resembling a hyena (in appearance, behavior, or features).","zh":"与鬣狗有关的；像鬣狗的（外貌、行为或特征上）。"},"examples":[{"en":"The creature in the story had a hyenoid grin and a harsh, laughing call.","zh":"故事里的生物露出鬣狗般的咧嘴笑，发出刺耳的“笑声”般叫声。"},{"en":"In old travel writing, some authors described certain scavengers as having hyenoid habits.","zh":"在一些旧的游记里，有作者把某些食腐动物的习性形容为“鬣狗般的”。"}]}],"synonyms":["hyena-like","hyaena-like"],"phonetic":"/haɪˈiːnɔɪd/","extraExplanation":["“hyenoid”由“hyena（鬣狗）+ -oid（……似的/……形的）”构成，常用于文学描写或较正式的写作中，强调“像鬣狗那样的”感觉（例如狞笑、贪食、食腐等联想）。","日常英语里更常说“hyena-like”。使用“hyenoid”时要注意语气：在描述人时通常带贬义或强烈的形象化色彩。"]}
{"word":"hyet","summary":{"en":"“hyet” is not standard English; it most likely means “yet,” which commonly means “up to now” or “however.”","zh":"“hyet”不是标准英语，通常是“yet”的拼写错误；“yet”常表示“到目前为止”或“然而/尽管如此”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Likely a misspelling of “yet.”","zh":"（非标准）很可能是“yet”的拼写错误。"},"examples":[{"en":"Did you mean “yet”? For example: “Have you eaten yet?”","zh":"你是不是想写“yet”？例如：“Have you eaten yet?”（你吃了吗？）"}]},{"partOfSpeech":"adv.","definition":{"en":"Up to now; until the present time (used mostly in negative sentences and questions).","zh":"到目前为止；迄今（多用于否定句和疑问句）。"},"examples":[{"en":"I haven’t finished my homework yet.","zh":"我还没完成作业。"},{"en":"Has the bus arrived yet?","zh":"公交车到了吗？"}]},{"partOfSpeech":"conj.","definition":{"en":"Nevertheless; in spite of that.","zh":"然而；尽管如此。"},"examples":[{"en":"It was raining, yet we still went for a walk.","zh":"下着雨，但我们还是去散步了。"}]},{"partOfSpeech":"adv.","definition":{"en":"Even; still (used for emphasis, often in comparisons or with “more”).","zh":"甚至；还（用于强调，常见于比较或搭配“more”等）。"},"examples":[{"en":"This solution is yet more effective.","zh":"这个方案甚至更有效。"},{"en":"It’s a small problem, yet it matters.","zh":"这是个小问题，但它也很重要。"}]}],"synonyms":["so far","still","however","nevertheless"],"phonetic":"/jɛt/","extraExplanation":["“hyet”不是现代英语里的常见单词。如果你是在聊天或作业里看到“hyet”，通常可以先判断是不是把“yet”多打了一个字母，或来自个别人的不规范拼写。","“yet”在口语中非常常见，尤其用于：疑问句（Has it…yet?）和否定句（haven’t…yet）。"]}
{"word":"hyetal","summary":{"en":"“hyetal” isn’t a recognized standard English word; it’s probably a typo or a proper name.","zh":"“hyetal”不是标准英语词；多半是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a proper name (e.g., a username, brand, or transliteration).","zh":"不是标准英语单词；很可能是拼写错误或专有名词（如用户名、品牌名或音译）。"},"examples":[{"en":"I couldn’t find “hyetal” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“hyetal”，你能把它出现的句子发我看看吗？"},{"en":"If “hyetal” is a name, please tell me the language or context so I can explain it better.","zh":"如果“hyetal”是人名/品牌名，请告诉我它的语言或使用场景，我可以更准确地解释。"}]}],"phonetic":"N/A","extraExplanation":["“hyetal”在常见英语词典中没有收录。最常见的情况是：\n1）打字或拼写错误：你可以检查是否想写的是更常见的词（例如 hotel, metal, hyoid, hyaline 等）。\n2）专有名词/音译：可能来自韩语姓名拼写、网名或品牌名。\n把原句或来源（网页/图片/对话）发来，我可以帮你判断它到底是哪一个词或是什么意思。"]}
{"word":"hyeto","summary":{"en":"“Hyeto” isn’t a standard English word; it’s likely a misspelling. Common possibilities include “hitherto” (until now) or “Kyoto” (the city in Japan).","zh":"“hyeto”不是标准英语单词，可能是拼写错误。常见的可能是“hitherto”（迄今为止）或“Kyoto”（日本城市京都）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word (likely a misspelling or a name).","zh":"不是标准英语单词（可能是拼写错误或专有名词）。"},"examples":[{"en":"I couldn’t find “hyeto” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“hyeto”——你能给我它出现的句子吗？"}]},{"partOfSpeech":"adv.","definition":{"en":"Possible intended word: “hitherto” (meaning “until now; up to this point”).","zh":"你可能想写的是：hitherto（意思是“直到现在；迄今为止”）。"},"examples":[{"en":"Hitherto, no one had questioned the plan.","zh":"迄今为止，还没有人质疑这个计划。"},{"en":"The region had hitherto been peaceful.","zh":"该地区此前一直很和平。"}]},{"partOfSpeech":"n.","definition":{"en":"Possible intended word: “Kyoto” (a city in Japan; proper noun).","zh":"你可能想写的是：Kyoto（日本城市“京都”；专有名词）。"},"examples":[{"en":"Kyoto is famous for its temples and traditional neighborhoods.","zh":"京都以寺庙和传统街区闻名。"}]}],"synonyms":["hitherto: so far","hitherto: until now","hitherto: up to now"],"phonetic":"/ˈhɪðərˌtu/","extraExplanation":["“hyeto”很可能是打字或自动纠错造成的拼写变形。你可以告诉我：1）你在哪看到它（文章/歌词/游戏/聊天）；2）前后一句是什么；3）你想表达的意思（比如“到目前为止/京都/别的”）。我就能更准确地给出词义和用法。"]}
{"word":"hyetograph","summary":{"en":"A hyetograph is a graph showing rainfall intensity (or amount) over time during a storm.","zh":"hyetograph 指显示一次降雨过程中降雨强度（或雨量）随时间变化的图表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chart or graph that shows how rainfall intensity (or amount) changes over time during a storm event.","zh":"雨量历线图；降雨过程线：用图表表示一次降雨过程中，降雨强度（或雨量）随时间变化的情况。"},"examples":[{"en":"The engineer used a hyetograph to estimate peak runoff from the storm.","zh":"工程师用雨量历线图来估算这场暴雨的径流峰值。"},{"en":"The hyetograph shows a short period of very intense rainfall in the middle of the event.","zh":"这张雨量历线图显示降雨过程中间有一段短时间的强降雨。"},{"en":"Please plot the rainfall data as a hyetograph with 5‑minute intervals.","zh":"请把降雨数据按5分钟间隔绘制成雨量历线图。"}]}],"synonyms":["rainfall intensity graph","rainfall distribution chart","storm rainfall chart"],"phonetic":"/ˈhaɪəˌtɑːɡræf/","extraExplanation":["词源上，hyeto- 来自希腊语，和“降雨”有关；-graph 表示“图/记录”。在水文学与城市排水设计中，hyetograph 常与 hydrograph（流量过程线）一起使用，用来理解“雨怎么下”以及“河/管网怎么涨”。","常见的绘图方式是：横轴为时间，纵轴为降雨强度（如 mm/h），并按固定时间步长（如 5 分钟、1 小时）画成柱状或阶梯状。"]}
{"word":"hyetograph-related","summary":{"en":"connected with rainfall-intensity-over-time graphs","zh":"与降雨强度随时间变化的图表有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to a hyetograph (a graph showing how rainfall intensity changes over time during a storm)","zh":"与雨强图（表示一次降雨过程中“降雨强度—时间”变化的图）有关的"},"examples":[{"en":"We used hyetograph-related data to estimate peak runoff.","zh":"我们使用与雨强图相关的数据来估算径流峰值。"},{"en":"Hyetograph-related parameters include storm duration and intensity distribution.","zh":"与雨强图相关的参数包括降雨历时和强度分布。"},{"en":"The report compares several hyetograph-related methods for design storms.","zh":"报告比较了几种与雨强图相关的设计暴雨方法。"}]}],"synonyms":["hyetograph-based","hyetograph-derived","storm-profile-related","rainfall-distribution-related"],"phonetic":"/ˌhaɪˈɛtəˌɡræf rɪˈleɪtɪd/","extraExplanation":["在水文学与城市排水设计中，hyetograph 常用于描述一场暴雨的“时间分配”（比如前峰型、后峰型、均匀型），以便进行径流计算、管网校核和设计暴雨构建。","注意：hyetograph-related 多见于技术写作；更口语或更常见的表达可说 “related to the hyetograph” 或 “hyetograph-based”。"],"etymology":"由 hyetograph（雨强图）+ related（相关的）构成。hyetograph 源自希腊语：hyetos（雨）+ -graph（书写/绘图），在水文学中指“降雨强度随时间变化的曲线/图”。","mnemonic":["hyeto- ≈ “雨”（可联想中文“下雨的‘雨’”）；-graph 是“图/写”，合起来就是“雨的图”。","把它拆开记：hyetograph + related = “和雨强图有关”。"]}
{"word":"hyetographic","summary":{"en":"Hyetographic means “related to a hyetograph,” a chart of rainfall intensity over time.","zh":"hyetographic 意为“与雨量过程线有关的”，雨量过程线用于展示雨强随时间变化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hyetograph (a chart showing how rainfall intensity changes over time during a storm).","zh":"与雨量过程线（hyetograph：展示一次降雨过程中“雨强随时间变化”的图表）有关的。"},"examples":[{"en":"The engineer created a hyetographic curve to represent rainfall intensity throughout the storm.","zh":"工程师绘制了一条雨量过程线（hyetographic curve），用来表示暴雨过程中雨强的变化。"},{"en":"Hyetographic data helped the team choose an appropriate drainage design.","zh":"雨量过程线相关数据帮助团队选择了合适的排水设计。"}]}],"synonyms":["hyetograph-related","rainfall-intensity (in context)","pluviographic (related term)"],"phonetic":"/ˌhaɪ.ə.təˈɡræf.ɪk/","extraExplanation":["“hyetographic”常见于水文学（hydrology）、水资源工程与城市排水/防洪领域，常与“hyetograph（雨量过程线）”“rainfall intensity（雨强）”“storm event（暴雨过程）”等搭配使用。","词源上，hyeto- 来自希腊语，意思与“降雨”相关；“-graph”表示“图/记录”。因此 hyetograph 是“记录降雨过程的图”，hyetographic 就是“与该图有关的”。"]}
{"word":"hyetographical","summary":{"en":"Hyetographical means “related to recording or graphing rainfall (a hyetograph).”","zh":"hyetographical 指“与降雨记录或绘制雨量图（hyetograph）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hyetograph or hyetography (the recording or graphing of rainfall, especially rainfall intensity over time).","zh":"与雨量图（hyetograph）或雨量记录/绘制（hyetography）有关的；尤指把降雨强度随时间变化绘成图表的。"},"examples":[{"en":"The engineer used hyetographical data to model stormwater runoff.","zh":"工程师用雨量图相关的数据来模拟暴雨径流。"},{"en":"A hyetographical chart shows how rainfall intensity changes during the storm.","zh":"雨量图相关的图表展示了暴雨过程中降雨强度如何变化。"}]}],"synonyms":["hyetographic","pluviographic (related, more general)"],"phonetic":"/ˌhaɪətəˈɡræfɪkəl/","extraExplanation":["“hyeto-”来自希腊语，意为“雨”。在水文学/气象学里，hyetograph（雨量图）通常是“横轴时间、纵轴降雨强度”的图，用于分析暴雨过程、排水系统设计、洪水预报等。","这个词较少见，更常见的相关词是 hyetograph（名词：雨量图）和 hyetography（名词：雨量记录/绘制）。"]}
{"word":"hyetographically","summary":{"en":"“Hyetographically” means “in terms of a hyetograph,” a rainfall-over-time graph used in meteorology and hydrology.","zh":"“hyetographically”意为“从雨量过程线角度/以雨量过程线方式”，用于气象与水文领域描述降雨随时间变化。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a hyetograph (a chart/graph showing rainfall amount or intensity over time).","zh":"以雨量过程线（hyetograph，一种显示降雨量或降雨强度随时间变化的图表）的方式；从雨量过程线的角度。"},"examples":[{"en":"The storm was analyzed hyetographically to show when the heaviest rain fell.","zh":"研究人员用雨量过程线的方式分析这场暴风雨，以显示最强降雨发生在什么时候。"},{"en":"Hyetographically, the rainfall peaked in the first hour and then steadily decreased.","zh":"从雨量过程线来看，降雨在第一小时达到峰值，随后逐渐减弱。"}]}],"synonyms":["on a hyetograph","using a hyetograph","in hyetograph form","in terms of a hyetograph"],"phonetic":"/ˌhaɪ.ɪ.təˈɡræf.ɪ.kli/","extraExplanation":["这是一个非常少见、偏气象/水文工程的副词，来自 hyetograph（雨量过程线）。更常见的表达是：“using a hyetograph / on a hyetograph / in hyetograph form（用雨量过程线/在雨量过程线上/以雨量过程线形式）”。","相关词：hyetograph（雨量过程线，名词）；hyetography（制作/研究雨量过程线的方法，名词，较少用）。","使用场景多见于降雨—径流模拟、城市排水设计、洪水分析等技术写作；在日常英语中几乎不会用到。"]}
{"word":"hyetography","summary":{"en":"Hyetography means the recording or description of rainfall, especially how it changes over time.","zh":"Hyetography 指对降雨的记录或描述，尤指降雨随时间变化的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the description, measurement, or recording of rainfall (precipitation), especially its amount and distribution over time in meteorology/hydrology","zh":"（气象/水文学中）对降雨（降水）的描述、测量或记录，尤指降雨量及其随时间的分布"},"examples":[{"en":"Hyetography helps researchers compare rainfall patterns across different storms.","zh":"降雨记录（hyetography）能帮助研究人员比较不同暴雨过程的降雨模式。"},{"en":"The report includes hyetography data showing when the heaviest rain occurred.","zh":"报告包含降雨记录数据，显示最强降雨发生在什么时候。"}]}],"synonyms":["pluviography","rainfall recording","precipitation recording"],"phonetic":"/ˌhaɪəˈtɑːɡrəfi/","extraExplanation":["词根来源：hyeto- 来自希腊语 hyetos，意为“雨”。在实际使用中，你更常见到相关词 hyetograph（降雨过程线/雨量图），指把降雨强度随时间变化画成图；hyetography 更偏向“记录/描述降雨”这一整体工作或资料。"]}
{"word":"hyetological","summary":{"en":"Hyetological means “related to rainfall,” especially in scientific study or measurement.","zh":"hyetological 意为“与降雨有关的”，尤用于科学研究或测量语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to rainfall; used in the study or measurement of rain.","zh":"与降雨有关的；用于研究或测量降雨的。"},"examples":[{"en":"Hyetological data help scientists understand how rainfall patterns are changing.","zh":"降雨学（hyetological）数据帮助科学家了解降雨模式如何变化。"},{"en":"The report includes hyetological charts showing monthly rainfall totals.","zh":"报告包含降雨学图表，展示每月降雨总量。"}]}],"synonyms":["rainfall-related","pluviological","meteorological (in context)"],"phonetic":"/ˌhaɪ.ɪ.təˈlɑː.dʒɪ.kəl/","extraExplanation":["词根提示：hyeto- 来自希腊语 *hyetos*（雨、降雨），-logy 表示“学科/研究”，因此 *hyetological* 字面意思是“关于降雨研究的”。","使用场景：这个词多见于气象学、水文学、环境科学等较正式或学术的语境；日常英语中更常说 *rainfall*（降雨量）或 *rain-related*（与雨有关的）。"]}
{"word":"hyetologist","summary":{"en":"A hyetologist is a scientist who studies rainfall.","zh":"hyetologist 指研究降雨（雨量与降雨规律）的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies rainfall; a scientist specializing in the measurement, patterns, and causes of rain (a rainfall expert).","zh":"研究降雨的人；专门测量、分析雨量与降雨规律的科学家（雨量学/降雨学专家）。"},"examples":[{"en":"The hyetologist analyzed 50 years of rainfall records to understand drought cycles.","zh":"这位降雨学家分析了50年的降雨记录，以了解干旱循环。"},{"en":"In flood-prone regions, hyetologists help engineers design safer drainage systems.","zh":"在易发洪水的地区，降雨学家会协助工程师设计更安全的排水系统。"}]}],"synonyms":["rainfall scientist","rainfall researcher","hyetology specialist"],"phonetic":"/ˌhaɪɪˈtɑːlədʒɪst/","extraExplanation":["hyetologist 来自希腊语词根：hyetos（“雨”）+ -logist（“……学者/研究者”）。相关学科名词是 hyetology（降雨学/雨量学）。在气象、气候研究与水文工程中都可能遇到这个词，但日常英语里较少用，更常见的说法是 “rainfall scientist” 或 “meteorologist who studies rainfall”。"]}
{"word":"hyetology","summary":{"en":"Hyetology means the scientific study of rainfall.","zh":"Hyetology 指“雨量学/降雨学”，即对降雨（降水）的科学研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of rainfall (precipitation), including how rain forms, how much falls, and how it varies over time and place","zh":"雨量学；降雨学（研究降雨/降水的形成、雨量多少及其时空变化的学科）"},"examples":[{"en":"Hyetology helps scientists understand long-term rainfall patterns.","zh":"雨量学帮助科学家了解长期的降雨模式。"},{"en":"Engineers use hyetology data when designing drainage systems and flood controls.","zh":"工程师在设计排水系统和防洪设施时会使用雨量学数据。"}]}],"synonyms":["rainfall study","precipitation science"],"phonetic":"/ˌhaɪəˈtɑlədʒi/","extraExplanation":["词源提示：hyetology 来自希腊语 hyetos（“雨”）+ -logy（“……学/研究”）。","相关词：hyetograph（雨量过程线/雨量柱状图，用来展示某次降雨随时间变化的强度）；pluviometer（雨量计）。"]}
{"word":"hyetometer","summary":{"en":"A hyetometer is an instrument for measuring rainfall, essentially a type of rain gauge.","zh":"Hyetometer 指“测量降雨量的仪器”，本质上就是一种雨量计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the amount of rainfall (precipitation) over a period of time; a type of rain gauge.","zh":"一种用来测量一段时间内降雨量（降水量）的仪器；属于雨量计/雨量筒的一种。"},"examples":[{"en":"The weather station uses a hyetometer to record daily rainfall totals.","zh":"气象站用雨量计（hyetometer）来记录每天的降雨总量。"},{"en":"After the storm, researchers checked the hyetometer data to see how much rain fell.","zh":"暴风雨过后，研究人员查看雨量计（hyetometer）的数据，看看下了多少雨。"}]}],"synonyms":["rain gauge","pluviometer"],"phonetic":"/ˌhaɪəˈtɑːmɪtɚ/","extraExplanation":["“Hyetometer”是较少见、偏技术的词，更常见的说法是“rain gauge（雨量计）”。","词源上，hyeto- 来自希腊语，表示“下雨/降雨”，-meter 表示“测量工具”。","在水文学与气象学中，你也可能看到相关词：hyetograph（降雨过程线/雨量历线），指“降雨强度随时间变化的图”。"]}
{"word":"hyetometric","summary":{"en":"Hyetometric means “about measuring rainfall.”","zh":"hyetometric 指“与降雨量测量有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the measurement of rainfall (precipitation), especially using a rain gauge (hyetometer).","zh":"与降雨量（降水量）的测量有关的，尤指用雨量计（hyetometer）进行测量。"},"examples":[{"en":"The researchers used hyetometric data to compare rainfall across the region.","zh":"研究人员使用测雨数据来比较该地区各处的降雨量。"},{"en":"Hyetometric records help engineers design drainage systems that can handle heavy storms.","zh":"测雨记录能帮助工程师设计能够应对强降雨的排水系统。"}]}],"synonyms":["rainfall-measurement","precipitation-measurement","pluviometric"],"phonetic":"/ˌhaɪ.ɪˈtɑː.mə.trɪk/","extraExplanation":["“hyetometric”来自动词根 hyeto-（表示“雨”），常见于气象学、水文学与环境工程领域。日常英语中更常用的说法是 “rainfall measurement / precipitation measurement” 或直接说 “rain-gauge data”。","相关名词：hyetometer（雨量计）、hyetometry（雨量测定）。相关图表：hyetograph（降雨强度随时间变化图）。"]}
{"word":"hyetometrograph","summary":{"en":"A hyetometrograph is a device that measures rainfall and records it automatically over time.","zh":"hyetometrograph 指一种能测量并自动记录降雨量随时间变化的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument that measures rainfall and automatically records it over time (a recording rain gauge).","zh":"一种测量降雨量并能随时间自动记录数据的仪器（记录式雨量计）。"},"examples":[{"en":"The weather station installed a hyetometrograph to track rainfall throughout the storm.","zh":"气象站安装了一台记录式雨量计，以便在暴风雨期间持续跟踪降雨量。"},{"en":"According to the hyetometrograph, most of the rain fell between 2 a.m. and 4 a.m.","zh":"根据记录式雨量计的数据，大部分降雨发生在凌晨两点到四点之间。"}]}],"synonyms":["recording rain gauge","pluviograph"],"phonetic":"/ˌhaɪiːtəˈmiːtrəˌɡræf/","extraExplanation":["这个词非常罕见，多见于早期或专业气象学文献。现代英语里更常用的说法是 recording rain gauge（记录式雨量计）或 pluviograph（自记雨量计）。","词源可拆解理解：hyeto- 来自希腊语，意为“雨”；-metro- 表示“测量”；-graph 表示“记录/绘图”。因此整体就是“测雨并记录的仪器”。"]}
{"word":"hyetometrographic","summary":{"en":"A rare technical adjective meaning “about measuring and recording rainfall.”","zh":"一个很少见的技术形容词，表示“与降雨量的测量与记录有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the measurement and recording of rainfall (rain-gauge data).","zh":"与降雨量的测量与记录（雨量计数据）有关的。"},"examples":[{"en":"The station keeps hyetometrographic records to track monthly rainfall trends.","zh":"该站保存雨量测记记录，用来追踪每月降雨趋势。"},{"en":"Hyetometrographic observations help farmers plan irrigation in dry seasons.","zh":"雨量测记观测能帮助农民在旱季规划灌溉。"}]}],"synonyms":["rainfall-recording","pluviometric","hyetographic"],"phonetic":"/ˌhaɪɪtoʊˌmiːtroʊˈɡræfɪk/","extraExplanation":["这个词非常少见，多用于气象学/水文学的书面语或旧式技术文本。","词根拆解有助于记忆：hyeto- 表示“雨/降雨”，metro- 表示“测量”，-graphic 表示“记录/描绘”，合起来就是“对降雨进行测量并记录的”。","更常见、现代的表达通常会用 rainfall measurement/recording，或 hyetograph（雨量过程线/雨量记录图）相关的说法。"]}

