{"word":"hyl","summary":{"en":"HYL is a casual texting abbreviation most often meaning “How you like (it)?”","zh":"HYL 是较口语的聊天缩写，最常见意思是“你觉得怎么样/你喜不喜欢？”"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An internet/texting abbreviation often used to mean “How you like (it)?” (asking for someone’s opinion).","zh":"网络/短信缩写，常用来表示“你觉得怎么样？/你喜不喜欢？”（询问对方看法）。"},"examples":[{"en":"I sent you the first draft—HYL?","zh":"我把第一版发给你了——你觉得怎么样？"},{"en":"New haircut. HYL?","zh":"新发型。你觉得好看吗？"}]},{"partOfSpeech":"other","definition":{"en":"Less commonly, an abbreviation for other phrases depending on the group/context (so the meaning may need confirmation).","zh":"较少见时也可能是其他短语的缩写，含义取决于圈子/语境（可能需要确认）。"},"examples":[{"en":"HYL—do you mean “How you like?” or something else?","zh":"HYL——你是指“你觉得怎么样？”还是别的意思？"}]}],"synonyms":["How do you like it?","What do you think?","Thoughts?"],"phonetic":"/eɪtʃ waɪ ɛl/","extraExplanation":["“HYL”通常按字母读（H-Y-L），多出现在聊天、评论、私信里，语气偏随意。","缩写在不同社区可能有不同含义；如果上下文不清楚，直接问一句 “What do you mean by HYL?” 是最稳妥的。"]}
{"word":"hyla","summary":{"en":"Hyla is a scientific genus name for certain tree frogs; it can also loosely mean a tree frog.","zh":"Hyla是部分树蛙的科学属名；也可较宽泛地指“树蛙”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small tree frogs (family Hylidae); sometimes used more generally to mean a tree frog","zh":"树蛙属（雨蛙科）的一类小型树蛙；有时也泛指“树蛙”"},"examples":[{"en":"We heard a hyla calling from the reeds after sunset.","zh":"日落后，我们听到芦苇丛里有一只树蛙在鸣叫。"},{"en":"The museum’s exhibit labels a few local species as Hyla.","zh":"博物馆的展览标签把几种本地物种标注为树蛙属（Hyla）。"}]}],"synonyms":["tree frog"],"phonetic":"/ˈhaɪlə/","extraExplanation":["“Hyla”是生物分类学里的属名，常见于拉丁学名（例如 *Hyla* + 物种名）。在日常英语中，人们更常说“tree frog（树蛙）”。","词源来自古希腊语，和“森林/树林”有关，呼应这类青蛙常栖息在树木或灌木附近。","不同地区的“树蛙”不一定都属于Hyla属；分类会随科学研究更新而调整。"]}
{"word":"hylactic","summary":{"en":"“Hylactic” means “related to matter; material or physical,” and it is a rare word mainly used in philosophical contexts.","zh":"“hylactic”意为“与物质相关、物质的/肉体的”，是一个较少见、主要用于哲学语境的词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to matter or the material world (as opposed to spirit or mind).","zh":"与物质或物质世界有关的（相对于精神或心灵）。"},"examples":[{"en":"Some philosophies describe reality as both mental and hylactic.","zh":"一些哲学认为现实既包含心灵层面，也包含物质层面。"},{"en":"The author contrasts spiritual longing with hylactic needs like food and shelter.","zh":"作者把精神渴望与食物、住所等物质需求作对比。"}]}],"synonyms":["material","physical","bodily","corporeal"],"phonetic":"/haɪˈlæk.tɪk/","extraExplanation":["“hylactic”很罕见，多见于哲学/神秘学语境，用来强调“物质性”。它来自希腊语词根 hyl-，与“hyle（物质、原质）”相关。","在现代英语中，更常用的替代词是 “material / physical / bodily”。如果你是在某本书里看到它，通常是在讨论“精神/心灵 vs. 物质”的二分。"]}
{"word":"hylactism","summary":{"en":"Hylactism is a rare noun meaning barking or the sound of barking, mainly used in literary or humorous contexts.","zh":"hylactism 是个罕见名词，表示“吠叫/犬吠声”，多见于文学或幽默语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or sound of barking; noisy yelping (often used in a literary or humorous way).","zh":"吠叫声；吠叫的行为（多用于文学或带幽默色彩的表达）。"},"examples":[{"en":"From the alley came a sudden hylactism that startled the neighbors.","zh":"小巷里突然传来一阵吠叫声，把邻居们吓了一跳。"},{"en":"The writer described the night as filled with wind, shadows, and distant hylactism.","zh":"作者描写夜晚充满了风、影子，以及远处隐约的犬吠。"}]}],"synonyms":["barking","bark","yelping","howling"],"phonetic":"/haɪˈlæk.tɪ.zəm/","extraExplanation":["这是一个非常罕见、偏文学的词，源自希腊语词根，含义与“狗叫/吠叫”相关。日常英语里通常用 bark（动词/名词）或 barking（名词）来表达。","在文学描写中，它常用来营造氛围（例如夜晚、荒野、紧张不安的场景），因为它听起来更“书面”、更有古典色彩。"]}
{"word":"hylaeosaurus","summary":{"en":"Hylaeosaurus is an early armored dinosaur genus discovered in England.","zh":"Hylaeosaurus（扁木龙）是发现于英国的早期装甲类恐龙属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of early armored dinosaurs from the Early Cretaceous period, known from fossil remains found in England.","zh":"扁木龙属：一种生活在白垩纪早期的装甲类恐龙属，化石主要在英国发现。"},"examples":[{"en":"Hylaeosaurus was one of the first dinosaurs ever described by scientists.","zh":"扁木龙是最早被科学家描述的恐龙之一。"},{"en":"The museum display compared Hylaeosaurus with other armored dinosaurs.","zh":"博物馆展览把扁木龙和其他装甲类恐龙作了对比。"}]}],"synonyms":["armored dinosaur","dinosaur"],"phonetic":"/haɪˌliːoʊˈsɔːrəs/","extraExplanation":["词源来自希腊语：hylē（森林/林地）+ sauros（蜥蜴），字面意思接近“森林蜥蜴”。","扁木龙由英国古生物学家吉迪恩·曼特尔（Gideon Mantell）在19世纪命名与研究，常与禽龙（Iguanodon）、巨齿龙（Megalosaurus）一起被提及为早期“恐龙”研究的重要代表。"]}
{"word":"hylarchic","summary":{"en":"Hylarchic describes a philosophy where matter is treated as the ruling principle or foundation of reality.","zh":"hylarchic 指一种把“物质”视为现实根本原则或主导基础的哲学观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a system or philosophy in which matter (physical substance) is treated as the basic ruling principle of reality.","zh":"（哲学用语）物质本原的；指把“物质/实体”视为现实的根本支配原则或基础的体系/观点。"},"examples":[{"en":"In a hylarchic worldview, mind is often explained as a product of matter.","zh":"在物质本原的世界观中，心灵常被解释为物质的产物。"},{"en":"Some critics argue that a strictly hylarchic model cannot fully account for consciousness.","zh":"一些批评者认为，严格的物质本原模型无法充分解释意识。"}]}],"synonyms":["materialistic","materialist","physicalist (near meaning)"],"phonetic":"/ˌhaɪlˈɑrkɪk/","extraExplanation":["词源提示：hylo- 来自希腊语 hylē（“物质、木材”），-archic 与 archē（“统治、原则、起源”）有关。合在一起可理解为“以物质为主导原则的”。","使用场景：该词非常罕见，多见于哲学讨论（例如与唯物主义、心物关系、形而上学框架的比较）。日常英语中更常用 materialistic / materialist（更常见但含义不完全等同）。"]}
{"word":"hylarchical","summary":{"en":"Hierarchical = organized into levels or ranks (usually spelled “hierarchical”).","zh":"Hierarchical＝按等级/层级组织的（常见正确拼写为 hierarchical）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled **hierarchical**) arranged in levels, where each level has more or less authority, importance, or rank than the ones below or above it.","zh":"（通常拼作 **hierarchical**）按层级排列的；有上下级之分的；等级分明的。"},"examples":[{"en":"The company has a **hierarchical** structure, with managers above team leaders.","zh":"这家公司有**层级式**结构，经理在组长之上。"},{"en":"In a **hierarchical** system, decisions often come from the top.","zh":"在**等级分明**的体系中，决定常常由上层做出。"},{"en":"The folders are organized in a **hierarchical** way: year → month → day.","zh":"这些文件夹按**层级**方式整理：年 → 月 → 日。"}]}],"synonyms":["ranked","tiered","graded","stratified","pecking-order"],"phonetic":"/ˌhaɪəˈrɑrkɪkəl/","extraExplanation":["你写的 **hylarchical** 很可能是 **hierarchical** 的拼写错误。常见混淆点：**hie-** 开头、以及中间的 **-arch-**（和“arch/archy”有关）。","词源提示：**hier-**（“神圣/祭司”）+ **-arch**（“统治/首领”）+ **-ical**（形容词后缀）。现代英语里主要表示“有层级、等级体系”的意思。"]}
{"word":"hylas","summary":{"en":"Hylas is a figure from Greek mythology, known as Heracles’ young companion who was abducted by water nymphs; his name is also used as a symbol of alluring, dangerous beauty in literature and art.","zh":"Hylas（希拉斯）是希腊神话人物，赫拉克勒斯的年轻同伴，取水时被水泽仙女掳走；在文学与艺术中也常被用作“迷人但危险的美”的象征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a handsome young companion (or servant) of Heracles (Hercules) who was lured away and abducted by water nymphs while fetching water.","zh":"（希腊神话）希拉斯：赫拉克勒斯（Hercules/Heracles）的年轻同伴（或侍从），在取水时被水泽仙女引诱并掳走。"},"examples":[{"en":"In the myth, Hylas disappears after the nymphs pull him into the spring.","zh":"在神话里，希拉斯被仙女拉进泉水后就消失了。"},{"en":"Some retellings show Heracles searching desperately for Hylas.","zh":"一些改写版本会写赫拉克勒斯焦急地寻找希拉斯。"}]},{"partOfSpeech":"n.","definition":{"en":"A literary or artistic reference to a beautiful youth whose allure leads to danger or loss (based on the myth of Hylas).","zh":"（文学/艺术引申）指“美貌少年—诱惑与危险并存”的意象（源自希拉斯的神话）。"},"examples":[{"en":"The novel uses Hylas as a symbol of attraction that pulls people off their path.","zh":"这部小说用“希拉斯”象征会让人偏离正轨的诱惑。"},{"en":"The painting echoes the Hylas story to suggest beauty can be entrapping.","zh":"这幅画借用希拉斯的故事暗示美可能具有束缚性。"}]}],"synonyms":["mythological figure","Greek myth character"],"phonetic":"/ˈhaɪləs/","extraExplanation":["“Hylas”多作为专有名词出现，常见于古希腊神话、史诗改写与艺术评论中。英美语境里常把他与“被水泽仙女引诱/掳走”的情节一起提及。","艺术史上很有名的作品是英国画家约翰·威廉·沃特豪斯（John William Waterhouse）的《Hylas and the Nymphs》（《希拉斯与仙女》），因此在美术馆、展览评论或文化新闻里也会看到这个名字。","拼写提示：Hylas 首字母大写（专有名词）。与植物学里的“hyl-（森林）”词根无直接常用联系；这里主要是神话人物名。"]}
{"word":"hylasmus","summary":{"en":"“hylasmus” is not a common English word; it is likely a scientific proper name or a misspelling.","zh":"“hylasmus”不是常见英文词汇；更可能是科学专名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word in general dictionaries; most often seen as a scientific/Latin-style proper name (for example, a genus or species name) or as a misspelling of a similar-looking term.","zh":"一般词典里不作为常见英文词汇出现；多见于科学/拉丁式的专有名词（如属名、种名等），或是某个近似词的拼写错误。"},"examples":[{"en":"I couldn’t find “hylasmus” in standard English dictionaries—can you share the sentence or field (biology, medicine, literature)?","zh":"我在常见英文词典里找不到“hylasmus”；你能提供它出现的句子或领域吗（生物/医学/文学等）？"},{"en":"In scientific writing, unusual capitalized forms like Hylasmus may be a genus name.","zh":"在科学写作中，像 Hylasmus 这类不常见且可能大写的形式，可能是某个属名。"}]}],"phonetic":"/haɪˈlæzməs/","extraExplanation":["“hylasmus”很可能不是普通英文单词，而是：\n1）某个学科里的拉丁学名（属名/种名）；或\n2）拼写误差（例如把其他词打错了）。\n如果你把它出现的上下文（前后一句）或来源（书名、论文、网页）贴出来，我可以更准确判断它指什么，并给出对应释义与用法。"]}
{"word":"hyle","summary":{"en":"Hyle is a rare philosophy term meaning basic matter or raw material substance, often contrasted with form or spirit.","zh":"Hyle 是较少见的哲学词，指基本的“质料/物质本体”，常与“形式”或“精神”相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy) matter or material substance—especially the raw, underlying “stuff” from which things are made (often contrasted with form, mind, or spirit).","zh":"（哲学）质料；物质本体——尤指构成万物的原始“材料/底层之物”（常与“形式”、心灵或精神相对）。"},"examples":[{"en":"In Aristotle’s thought, hyle is the matter that receives form to become a particular thing.","zh":"在亚里士多德思想中，hyle 是接受“形式”而成为具体事物的“质料”。"},{"en":"Some writers use “hyle” to discuss the difference between material reality and ideas.","zh":"有些作者用“hyle”来讨论物质现实与观念之间的差异。"}]}],"synonyms":["matter","material","substance","physical reality"],"phonetic":"/ˈhaɪli/","extraExplanation":["“hyle” 来自希腊语 ὕλη（hylē），原意接近“木材/树林”，后来在哲学语境中引申为“可被加工的材料”，即“质料”。","这是较少见的学术用词，日常英语更常用 matter / material / substance。","常见搭配与概念：hylē（质料） vs. form（形式）；也可见于“hylomorphism（质料-形式论）”讨论中。"]}
{"word":"hylean","summary":{"en":"Hylean means “forest-related,” especially describing tropical rainforest environments (often the Amazon).","zh":"hylean 指“与森林有关的”，尤用于描写热带雨林环境（常指亚马孙雨林）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a forest or dense woodland, especially a tropical rainforest (often used in scientific or literary descriptions).","zh":"与森林或茂密林地有关的；（尤指）热带雨林的（常用于科学或文学描写）。"},"examples":[{"en":"Researchers documented hylean bird species deep in the Amazon basin.","zh":"研究人员记录了亚马孙盆地深处的雨林（hylean）鸟类物种。"},{"en":"The novel opens with a hylean landscape—wet leaves, heavy shade, and constant insect sound.","zh":"小说以雨林（hylean）的景象开篇：潮湿的树叶、浓重的阴影，以及不绝于耳的虫鸣。"},{"en":"Many plants in this hylean zone depend on year-round humidity.","zh":"这片雨林（hylean）区域的许多植物依赖全年湿润的环境。"}]}],"synonyms":["forest","woodland","sylvan","jungle","rainforest"],"phonetic":"/haɪˈliːən/","extraExplanation":["“hylean”源自希腊语 hylē（意为“树林/木材”）。英语里常与专名“Hylea”相关，Hylea 常用来指亚马孙的热带雨林地区，因此该词在地理、生态学与文学中更常见，而在日常口语里较少使用。"]}
{"word":"hyleg","summary":{"en":"“hyleg” is not a common English word; it’s likely a typo or a proper name/specialized term.","zh":"“hyleg”不是常见英语词；多半是拼写错误或专有名词/小众术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling, a username/proper name, or a term from a specific field (game, brand, local language, etc.).","zh":"不是常见英语词典中的标准词；可能是拼写错误、用户名/专有名词，或某个特定领域（游戏、品牌、方言等）的用语。"},"examples":[{"en":"I couldn’t find “hyleg” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“hyleg”——你能把它出现的句子发我吗？"},{"en":"Is “hyleg” a name, a product, or a typo for another word?","zh":"“hyleg”是名字、产品名，还是另一个词的拼写错误？"}]}],"phonetic":"/ˈhaɪlɛɡ/","extraExplanation":["“hyleg”很可能是拼写打错了。你可以回想一下是不是想输入这些更常见的词：\n- hyle / hail（古英语或方言/常见词）\n- hygge（丹麦语借词，常见于英语语境）\n- hylid（生物学术语，树蛙科相关）\n如果你把原句或来源（文章/游戏/品牌/截图）发来，我可以更准确判断意思与用法。","发音这里无法保证准确；如果它是人名或品牌名，发音可能取决于创建者的读法。"]}
{"word":"hylegiacal","summary":{"en":"“Hylegiacal” is a rare astrology term meaning “related to the hyleg,” a key life-significator in a birth chart.","zh":"“hylegiacal”是很少见的占星术用语，表示“与hyleg（生命主点/生命主星）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hyleg—the “giver of life” or chief life-significator in traditional astrology (a key point in a birth chart used in judging vitality and lifespan).","zh":"（传统占星术）与“生命主星/生命主点”（hyleg，意为“生命的给予者”，用于判断生命力与寿命的关键点）有关的。"},"examples":[{"en":"In traditional astrology, the hylegiacal point is used when discussing vitality in a natal chart.","zh":"在传统占星术中，人们会用“hylegiacal（生命主点相关）”来讨论本命盘中的生命力。"},{"en":"Some older texts describe a “hylegiacal place” as especially important for life and health matters.","zh":"一些较早的文献把“hylegiacal place（生命主位）”描述为与生命和健康尤为相关的位置。"}]}],"synonyms":["hylegical"],"phonetic":"/ˌhaɪləˈdʒaɪəkəl/","extraExplanation":["这个词非常少见，多见于旧式/学术化的占星文献里；更常见的拼法是 hylegical（意义相同）。","hyleg 源自阿拉伯语传统占星术术语，后来进入拉丁语与英语占星写作体系；现代日常英语几乎不用。"]}
{"word":"hylegical","summary":{"en":"connected with material substance, especially in philosophy","zh":"与物质（质料）有关的（尤指哲学语境）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to matter or material substance (as opposed to mind or spirit), especially in philosophical discussions.","zh":"（尤用于哲学语境）与“物质/质料”有关的；偏向物质层面的（相对精神或心灵）。"},"examples":[{"en":"The author contrasts spiritual experience with hylegical reality.","zh":"作者把精神体验与物质层面的现实作了对比。"},{"en":"In that framework, the body is treated as a hylegical basis for perception.","zh":"在那个理论框架里，身体被视为知觉的物质基础。"}]}],"synonyms":["material","physical","bodily","corporeal","materialistic"],"phonetic":"/haɪˈliːdʒɪkəl/","extraExplanation":["这是较少见的学术词，多出现在哲学、神学或现象学写作中，用来强调“物质性、质料性”的维度。日常英语更常用 material / physical / bodily 等词来表达类似意思。"],"etymology":"源自希腊语 hylē（“木材、物质、质料”），在哲学传统中引申为“原初的物质/质料”；后加形容词后缀 -ical 构成，表示“与……有关的”。","mnemonic":["记作“hylo- = 质料/物质”（可联想中文“质料”的“质”），-ical = “……的”：合起来就是“物质的、质料相关的”。","把 hyle 想成“材料堆（木材/物料）”，hylegical 就是“跟材料有关的”。"]}
{"word":"hyli","summary":{"en":"“Hyli” is not a standard English word; you probably mean “highly” (= very; to a great degree).","zh":"“hyli”不是标准英语单词；你可能想写“highly”，意思是“非常；高度地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Likely intended: “highly”) to a great degree; very.","zh":"（可能想写：highly）非常；高度地；在很大程度上。"},"examples":[{"en":"I highly recommend this book for English learners.","zh":"我非常推荐这本书给英语学习者。"},{"en":"She is highly skilled at solving problems.","zh":"她解决问题的能力非常强。"},{"en":"The movie was highly popular last year.","zh":"这部电影去年非常受欢迎。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Likely intended: “highly”) in a high rank or respected position.","zh":"（可能想写：highly）地位高地；受高度尊敬地。"},"examples":[{"en":"He is highly regarded in his field.","zh":"他在自己的领域里备受尊敬。"},{"en":"The university is highly ranked worldwide.","zh":"这所大学在全球排名很高。"}]}],"synonyms":["very","extremely","greatly","strongly"],"phonetic":"/ˈhaɪli/","extraExplanation":["“hyli”本身不是常见的英语单词，最可能是把“highly”拼错了（少了字母 g，顺序也略有差异）。如果你想表达“非常/高度地”，一般用“highly”。","常见搭配：highly recommend（强烈推荐）、highly likely（很可能）、highly skilled（技术很高）、highly regarded（备受尊敬）、highly effective（非常有效）。"]}
{"word":"Hylian","summary":{"en":"related to Hyrule; a person from Hyrule; or its fictional script/language.","zh":"与海拉鲁有关；海拉鲁人；或其虚构文字/语言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hyrule (a fictional kingdom) or its people, culture, or language in Nintendo’s *The Legend of Zelda* series.","zh":"与海拉鲁（虚构王国）及其人民、文化或语言有关的（任天堂《塞尔达传说》系列）。"},"examples":[{"en":"The game includes Hylian symbols on ancient stone tablets.","zh":"游戏里古老的石碑上有海拉鲁式（Hylian）的符号。"},{"en":"Some fans try to learn Hylian writing as a fun hobby.","zh":"一些粉丝把学习海拉鲁文字当作有趣的爱好。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Hyrule, especially a member of the main human-like race in the series.","zh":"海拉鲁人；（尤指系列中主要的人类样种族成员）。"},"examples":[{"en":"Link is usually portrayed as a Hylian hero.","zh":"林克通常被塑造成一位海拉鲁英雄。"},{"en":"Hylians are often shown with slightly pointed ears.","zh":"海拉鲁人常被描绘成耳朵略尖。"}]},{"partOfSpeech":"n.","definition":{"en":"The fictional writing system or language associated with Hyrule (usage varies by game and fan community).","zh":"海拉鲁语／海拉鲁文字（虚构；具体指哪种形式会因不同作品与粉丝圈用法而异）。"},"examples":[{"en":"This chart explains how to read Hylian letters from the game.","zh":"这张表解释了如何读出游戏中的海拉鲁字母。"},{"en":"The sign is written in Hylian, but it’s actually a cipher for English.","zh":"招牌写的是海拉鲁文字，但其实是把英文加密后换字母呈现。"}]}],"synonyms":["of Hyrule","Hyrulean"],"phonetic":"ˈhaɪliən","extraExplanation":["在现实英语中，Hylian 属于“虚构作品专有名词衍生词”，常见于游戏讨论、同人创作与语言/文字解读（如“海拉鲁文字其实是英文替换密码”的设定在部分作品中出现）。","发音里常见的节奏是 HY-lee-ən（三拍），重音在第一拍。"],"etymology":"来自《塞尔达传说》世界观：Hyrule（海拉鲁）+ 形容词后缀 -ian（表示“……的／……人”），形成 Hylian（海拉鲁的／海拉鲁人）。","mnemonic":["把它拆成 Hyrule + -ian：就像 Canadian=加拿大的/加拿大人，Hylian=海拉鲁的/海拉鲁人。","联想“海拉鲁（Hyrule）→ 海利安（Hylian）”：看到 -ian 结尾，多半是在说“某地的人/某地的”。"]}
{"word":"hylic","summary":{"en":"Hylic means “material/physical,” and in some Gnostic traditions it describes a person dominated by worldly, material concerns.","zh":"Hylic 表示“物质的/肉体的”；在某些诺斯替传统中，也指被物质欲望主导、灵性层次较低的人或性质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to matter or the physical body; material (as opposed to spiritual or intellectual).","zh":"与物质或肉体有关的；物质的（相对于精神或思想层面）。"},"examples":[{"en":"The novel contrasts hylic desires with the characters’ moral ideals.","zh":"这部小说把物质欲望与人物的道德理想作对比。"},{"en":"He felt trapped in a hylic routine of eating, working, and sleeping.","zh":"他觉得自己被困在吃饭、工作、睡觉的物质化日常里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In some Gnostic and mystical traditions) Describing a person or nature that is dominated by material concerns and considered less spiritually developed.","zh":"（某些诺斯替/神秘传统中）指受物质层面支配、被视为灵性发展较低的人或性质。"},"examples":[{"en":"In that text, hylic people are contrasted with the “pneumatic,” who seek spiritual knowledge.","zh":"在那部文本中，“hylic（物质型）”与追求灵性知识的“pneumatic（灵性型）”形成对照。"}]}],"synonyms":["material","physical","corporeal","worldly"],"phonetic":"/ˈhaɪlɪk/","extraExplanation":["“hylic”源自希腊语 hylē（ὕλη），意思是“木材/原料”，后来引申为“物质、质料”。因此它常用于哲学或宗教语境，强调“物质性”与“灵性/精神性”的对立。","在诺斯替传统里，常见三分法：hylic（物质型）、psychic（心灵/理性型）、pneumatic（灵性型）。这些标签带有特定宗教世界观色彩，现代使用时通常出现在学术讨论或文学化表达中。"]}
{"word":"hylicism","summary":{"en":"Hylicism is a philosophical theory that reality is fundamentally material.","zh":"Hylicism 指一种哲学观点：现实的根本基础是物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief or theory that everything is ultimately made of matter; a strongly materialistic view of reality.","zh":"（哲学）物质论；认为万物最终都由物质构成的一种观点（强调物质是唯一或最根本的实在）。"},"examples":[{"en":"Hylicism argues that consciousness comes from physical processes in the brain.","zh":"物质论认为，意识来自大脑中的物理过程。"},{"en":"In some debates, hylicism is contrasted with spiritual or idealist philosophies.","zh":"在一些讨论中，物质论常与精神主义或唯心主义哲学相对比。"}]}],"synonyms":["materialism","physicalism","materialistic worldview"],"phonetic":"/ˈhɪlɪˌsɪzəm/","extraExplanation":["词源提示：hylicism 来自希腊语 hylē（意为“物质、原料”）。因此它通常出现在哲学语境里，强调“物质（matter）”是世界的基础。","用法提醒：在现代英文里 hylicism 相对少见；更常见的相关词是 materialism（唯物主义/物质主义）或 physicalism（物理主义）。hylicism 往往更偏“万物由物质构成”的传统表述。"]}
{"word":"hylicist","summary":{"en":"A hylicist is someone who believes only matter is real (a materialist).","zh":"hylicist 指认为只有物质真实存在的“唯物主义者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that only physical matter is real; a materialist (often used in philosophy or religious debates).","zh":"认为只有物质才是真实存在的人；唯物主义者（常用于哲学或宗教辩论语境）。"},"examples":[{"en":"In the debate, the hylicist argued that consciousness is just brain activity.","zh":"在辩论中，这位唯物主义者认为意识只是大脑活动。"},{"en":"She wasn’t persuaded by the hylicist view that the soul is an illusion.","zh":"她并不认同那种认为灵魂只是幻觉的唯物主义观点。"}]}],"synonyms":["materialist","physicalist"],"phonetic":"ˈhɪlɪsɪst","extraExplanation":["词源提示：hylicist 来自希腊语 hylē（ὕλη），意为“物质/原料”。因此 hylicist 的核心意思是“把现实理解为纯粹由物质构成的人”。","语体与使用：这个词相对少见，更多出现在哲学写作、神学争论或较正式的文本中。日常英语里更常用 materialist（唯物主义者）或 physicalist（物理主义者）。"]}
{"word":"Hylidae","summary":{"en":"the tree-frog family (a biological classification)","zh":"树蛙科（生物分类学中的“科”）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family of mostly arboreal frogs (tree frogs), found widely in the Americas and also in parts of Europe, Asia, and North Africa","zh":"（生物分类）树蛙科：一类多为树栖的青蛙，主要分布于美洲，也见于欧洲、亚洲及北非部分地区"},"examples":[{"en":"Many brightly colored tree frogs in Central America belong to the Hylidae.","zh":"中美洲许多色彩鲜艳的树蛙属于树蛙科。"},{"en":"The museum label lists the species as Hylidae (tree frogs).","zh":"博物馆标签把该物种标注为树蛙科（树蛙）。"}]}],"synonyms":["tree-frog family","hylids"],"phonetic":"/ˈhaɪlɪdi/","extraExplanation":["读生物学文献时，Hylidae 通常指“树蛙科”这一分类层级（family）。单数/复数形式常同形（the Hylidae），也可见非正式复数/成员称呼 hylids（树蛙科成员）。"],"etymology":"源自希腊语 hylē（森林、林地）+ 动物分类学后缀 -idae（“……科”），字面含义与“森林里的蛙”相关，后来作为正式科名使用。","mnemonic":["hy- 可联想中文“嗨/海”，想象“嗨！树上有只蛙”→树蛙。","-idae 是分类学常见后缀，看到它就想到“某某科”（如 Felidae 猫科），因此 Hylidae = 树蛙科。"]}
{"word":"hylidae","summary":{"en":"Hylidae is the scientific family name for many tree frogs.","zh":"Hylidae 是许多树蛙所属的科学分类“科名”（树蛙科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of frogs commonly called tree frogs, found in many parts of the world and often adapted for climbing (many have toe pads).","zh":"（两栖动物）树蛙科：一类常被称为“树蛙”的青蛙家族，分布广，常适应攀爬（很多种类有吸盘状趾垫）。"},"examples":[{"en":"The biologist identified the frog as a member of the Hylidae family.","zh":"生物学家确认这只青蛙属于树蛙科（Hylidae）。"},{"en":"Many Hylidae species live in trees and hunt insects at night.","zh":"许多树蛙科物种栖息在树上，夜间捕食昆虫。"}]}],"synonyms":["tree frog family","the family Hylidae"],"phonetic":"/haɪˈlaɪdi/","extraExplanation":["“Hylidae”是动物分类学中的“科名”（family name），在科学写作中常用作单数（a member of Hylidae）或表示一个类群（the family Hylidae）。","词源上与希腊语 hylē（意为“森林/树林”）有关，因此常与“树栖、林地”这一生态环境联想在一起。"]}
{"word":"hylids","summary":{"en":"Hylids are tree frogs belonging to the family Hylidae.","zh":"hylids 指雨蛙科（Hylidae）的树蛙（hylid 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tree frogs in the family Hylidae (the plural of “hylid”).","zh":"雨蛙科（Hylidae）的树蛙；“hylid”的复数。"},"examples":[{"en":"Many hylids live in trees and have toe pads that help them climb.","zh":"许多雨蛙科的树蛙生活在树上，脚趾的吸附垫帮助它们攀爬。"},{"en":"Researchers recorded the calls of hylids to identify different species at night.","zh":"研究人员录下雨蛙科树蛙的叫声，用来在夜间辨识不同物种。"}]}],"synonyms":["tree frogs","Hylidae (the hylid family)"],"phonetic":"/ˈhaɪlɪdz/","extraExplanation":["“Hylidae（雨蛙科）”是两栖纲无尾目的一大类群，常被称为“tree frogs（树蛙）”。并非所有雨蛙科成员都只生活在树上，但很多具有明显的趾端吸盘，适合攀爬。","词源上，“hyl-”来自希腊语 hylē（森林、树林），因此 hylid 常与“森林/树栖的蛙类”联想在一起。"]}
{"word":"hylism","summary":{"en":"Hylism is the philosophical idea that everything is fundamentally made of matter.","zh":"Hylism 指一种哲学观点：认为一切事物从根本上都是由物质构成的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The philosophical view that everything is ultimately made of matter (physical substance).","zh":"（哲学）物质一元论；认为万物最终都由“物质/实体”构成的观点。"},"examples":[{"en":"In hylism, even the mind is explained as a function of matter.","zh":"在物质一元论中，甚至心灵也被解释为物质的功能。"},{"en":"The essay compares hylism with idealism, which treats ideas as more fundamental than matter.","zh":"这篇文章把物质一元论与唯心主义作比较；后者认为观念比物质更根本。"}]}],"synonyms":["materialism","physicalism"],"phonetic":"/ˈhaɪˌlɪzəm/","extraExplanation":["词源：hylism 来自希腊语 hylē（ὕλη，“木材/质料/物质”），常与 Aristotle（亚里士多德）讨论“质料—形式”（hylomorphism）有关；不过 hylism 更强调“只有物质才是根本”。","在现代英语里，这个词较少见，学术写作中更常用 materialism（唯物主义）或 physicalism（物理主义）。hylism 有时带有更“古典哲学/形而上学”的语感。"]}
{"word":"hylist","summary":{"en":"A hylist is a (rare) term for a materialist—someone who believes matter is the fundamental reality.","zh":"hylist 是一个较少见的词，指唯物主义者，即认为物质是根本实在的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that matter (physical substance) is the basic reality; a materialist (a rare, academic word).","zh":"主张“物质是基本实在”的人；唯物主义者（较少见、偏学术用语）。"},"examples":[{"en":"In the debate, the hylist argued that consciousness comes from the brain’s physical processes.","zh":"在辩论中，那位唯物主义者认为意识来自大脑的物理过程。"},{"en":"Some philosophers contrast a hylist view with a spiritual or idealist view.","zh":"一些哲学家会把唯物主义观点与精神主义或唯心主义观点进行对比。"}]}],"synonyms":["materialist","physicalist"],"phonetic":"/ˈhaɪlɪst/","extraExplanation":["“hylist”来自希腊语词根 hylē（意为“物质、原料”）。在哲学语境里，它通常指倾向于“物质第一”的立场；日常英语中更常用的词是 materialist（唯物主义者）。","如果你想表达“喜欢把东西列成清单的人”，英语一般说 list-maker、planner，或更口语的 someone who loves making lists；“hylist”不用于这个意思。"]}
{"word":"hyll","summary":{"en":"“hyll” is a rare/archaic spelling of “hill,” and sometimes appears as a surname or place-name.","zh":"“hyll”多为“hill（小山/丘陵）”的古体/少见拼写，也可能作为姓氏或地名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An archaic or dialect spelling of “hill” (a raised area of land).","zh":"“hill（小山/丘陵）”的古体或方言拼写，指地面隆起的高地。"},"examples":[{"en":"In some old texts, you may see “hyll” where modern English writes “hill.”","zh":"在一些旧文本里，你可能会看到用“hyll”来表示现代英语的“hill”。"},{"en":"The path led up the hyll to a small church.","zh":"小路通向那座小山（hyll）上的一座小教堂。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare surname or place-name spelling (proper name).","zh":"一种少见的姓氏或地名拼写（专有名词）。"},"examples":[{"en":"Hyll is listed as a family name in some records.","zh":"在一些档案记录中，“Hyll”被列为姓氏。"}]}],"synonyms":["hill","knoll","rise"],"phonetic":"/hɪl/","extraExplanation":["“hyll”主要出现在较早期的英语拼写中（如中古英语时期），当时拼写尚未标准化。同一个词在不同地区、不同抄写者手中可能有多种写法。现代英语里一般用“hill”。","阅读古文或家谱/地名资料时，遇到“hyll”通常可按“hill”理解，发音也多按 /hɪl/ 处理。"]}
{"word":"hylle","summary":{"en":"“Hylle” is mainly a Norwegian/Swedish word meaning “shelf,” sometimes seen in English as a loanword or name.","zh":"“Hylle”主要是挪威语/瑞典语，意思是“架子/搁板”，在英语中多作为外来词或姓名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Loanword, Norwegian/Swedish) a shelf; a wall-mounted shelf unit.","zh":"（外来词，挪威语/瑞典语）架子；（常指）墙上置物架/搁板。"},"examples":[{"en":"In Norwegian, “hylle” means “shelf.”","zh":"在挪威语里，“hylle”的意思是“架子/搁板”。"},{"en":"She put her books on the hylle by the window.","zh":"她把书放在窗边的置物架上。"}]},{"partOfSpeech":"other","definition":{"en":"A Scandinavian surname or place/name element (not a standard English vocabulary word).","zh":"斯堪的纳维亚地区的姓氏或地名成分（不是标准英语词汇）。"},"examples":[{"en":"Hylle appears as a family name in some Scandinavian records.","zh":"在一些斯堪的纳维亚地区的记录里可以看到 Hylle 作为姓氏出现。"}]}],"synonyms":["shelf","wall shelf","shelving"],"phonetic":"ˈhɪlə","extraExplanation":["“hylle”并不是常见英语单词，更常见于挪威语/瑞典语语境；在英语材料中通常会以原词出现（例如产品名、说明书、家居类内容），英语里对应的常用词是 shelf / shelving。","如果你是在家具/收纳语境中看到它（例如北欧品牌、北欧生活方式文章），基本可以理解为“搁板、置物架”。"]}
{"word":"hyllus","summary":{"en":"Hyllus is a character from Greek mythology, known as the son of Heracles.","zh":"Hyllus 是希腊神话人物，以“赫拉克勒斯之子”而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The son of Heracles (Hercules) and Deianira, often associated with the Heraclidae (the descendants of Heracles) and their efforts to reclaim territory in Greece.","zh":"（希腊神话）赫拉克勒斯（海格力斯）与得伊阿妮拉之子，常与“赫拉克勒斯后裔”（Heraclidae）及其在希腊夺回/收复领土的传说相关。"},"examples":[{"en":"In Greek mythology, Hyllus is remembered as a leader among the descendants of Heracles.","zh":"在希腊神话中，Hyllus 常被认为是赫拉克勒斯后裔中的一位领袖。"},{"en":"The play mentions Hyllus grieving for his father, Heracles.","zh":"这部戏剧提到 Hyllus 为父亲赫拉克勒斯而悲伤。"}]}],"synonyms":["(proper name; no true synonyms)"],"phonetic":"ˈhɪləs","extraExplanation":["“Hyllus”主要出现在古希腊神话与古典文学中（如索福克勒斯《特拉喀斯女子》The Trachiniae），常被描写为赫拉克勒斯临终事件的见证者与承受者之一。","英语里该词通常作为专有名词使用，首字母大写（Hyllus）。在不同译本中，人名可能会有不同中文译名。"]}
{"word":"hylo","summary":{"en":"“Hylo” is most commonly a proper name (person/place/brand). It can also be informal shorthand for “hylo-” terms in philosophy.","zh":"“Hylo”最常见是专有名词（人名/地名/品牌名）。也可能是哲学中以“hylo-”开头术语的非正式缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A name used for people, places, or brands (e.g., “Hylo”).","zh":"（专有名词）用作人名、地名或品牌名的“Hylo”。"},"examples":[{"en":"Hylo is the name of a company that makes eye-care products.","zh":"Hylo 是一家生产眼部护理产品的公司名称。"},{"en":"I met someone named Hylo at the conference.","zh":"我在会议上认识了一个叫 Hylo 的人。"}]},{"partOfSpeech":"other","definition":{"en":"(Informal) A shortened form of words that begin with “hylo-,” especially in philosophy (most often related to “hylozoism”).","zh":"（非正式）以“hylo-”开头词语的缩略说法，尤见于哲学语境（最常见与“hylozoism 泛生论/物活论”相关）。"},"examples":[{"en":"In some notes, the author writes “hylo” as shorthand for hylozoism.","zh":"在一些笔记里，作者用“hylo”来简写 hylozoism（泛生论/物活论）。"}]}],"synonyms":["(as a name)","(shorthand) hylo-"],"phonetic":"/ˈhaɪloʊ/","extraExplanation":["“hylo-”来自希腊语 hylē，意思是“物质/木材”，常出现在学术词里：\n- hylozoism：一种哲学观点，认为物质本身具有生命或生命性。\n如果你是在找某个具体品牌（如眼药水 HYLO®）或某篇文章/作品中的“Hylo”，可以告诉我上下文，我可以给你更准确的释义。"]}
{"word":"hylobates","summary":{"en":"Hylobates is the scientific genus name for several gibbon species (small apes) in Southeast Asia.","zh":"Hylobates 是长臂猿属的学名（属名），包括多种生活在东南亚的长臂猿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small apes (gibbons) known for long arms and swinging through trees; found in Southeast Asia","zh":"长臂猿属（小型猿类的一属），以手臂很长、擅长在林间摆荡（臂行）著称，主要分布于东南亚"},"examples":[{"en":"Scientists recorded the morning calls of Hylobates in the rainforest.","zh":"科学家在雨林里记录了长臂猿属（Hylobates）清晨的鸣叫。"},{"en":"Several Hylobates species live in Thailand, Malaysia, and nearby regions.","zh":"长臂猿属的若干物种生活在泰国、马来西亚及周边地区。"}]}],"synonyms":["gibbon","gibbons (general term)"],"phonetic":"/haɪˈlɑːbəˌtiːz/","extraExplanation":["“Hylobates”是生物分类学中的属名，常写作斜体（Hylobates），首字母大写。它指的是“长臂猿属”，不是某一个具体物种。","词源来自希腊语：hylē（森林、树木）+ batēs（行走者），大意是“森林行者”，很贴合长臂猿在树冠层活动、用臂行摆荡前进的特征。"]}
{"word":"hylobatian","summary":{"en":"A rare adjective meaning “related to gibbons (Hylobatidae).”","zh":"一个较少见的形容词，意思是“与长臂猿（长臂猿科）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to gibbons (family Hylobatidae), especially in scientific or zoological contexts.","zh":"（多用于动物学/科学语境）与长臂猿有关的；长臂猿科（Hylobatidae）的。"},"examples":[{"en":"Researchers compared hylobatian calls with those of other apes.","zh":"研究人员把长臂猿科的叫声与其他类人猿的叫声进行了比较。"},{"en":"The museum’s primate display includes several hylobatian species.","zh":"博物馆的灵长类展区包含几种长臂猿科物种。"}]}],"synonyms":["hylobatid","gibbon (adj. use: gibbon calls/behavior)"],"phonetic":"/ˌhaɪloʊˈbeɪʃiən/","extraExplanation":["“hylobatian”是非常少见的形容词，更常见的相关词是“hylobatid”（长臂猿科的）或直接用“gibbon”（长臂猿）。","词根来自拉丁化的属名/科名：Hylobates/Hylobatidae；其中“hylo-”常与“森林”相关，“-bates”有“行走者”之意，因此常被解释为“森林行者”，贴合长臂猿的生活环境。"]}
{"word":"hylobatic","summary":{"en":"Hylobatic means “tree-dwelling,” especially describing gibbons and other animals adapted to living and moving in the forest canopy.","zh":"hylobatic 指“树栖的”，尤常描述长臂猿等适应在林冠层生活与活动的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Living in trees; adapted for life in the forest canopy (especially used of gibbons and other tree-dwelling animals).","zh":"（动物学）树栖的；生活在树上、适应林冠层生活的（尤常用于长臂猿等树栖动物）。"},"examples":[{"en":"Gibbons are highly hylobatic, moving quickly through the canopy by swinging from branch to branch.","zh":"长臂猿高度树栖，常通过在林冠层间摆荡快速移动。"},{"en":"The researchers compared hylobatic primates with ground-dwelling monkeys to study differences in shoulder anatomy.","zh":"研究人员将树栖灵长类与地栖猴类进行比较，以研究肩部解剖结构的差异。"}]}],"synonyms":["arboreal","tree-dwelling","canopy-dwelling"],"phonetic":"/ˌhaɪləˈbætɪk/","extraExplanation":["“hylobatic”是一个较少见的学术词，多见于动物学/灵长类研究语境，日常英语里更常用“arboreal（树栖的）”。","词源上与长臂猿属名“Hylobates”有关：hylo- 源自希腊语，意为“森林/树林”；-batic 来自表示“行走/走动”的词根，合起来可理解为“在森林（树上）活动的”。","在科研写作中，它常强调“在树上生活并以树冠层运动为主”的生态位，特别是长臂猿的摆荡式移动（brachiation）。"]}
{"word":"hylobatid","summary":{"en":"related to, or a member of, the gibbon family","zh":"与长臂猿科有关的；或指长臂猿科成员"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the gibbon family (Hylobatidae), the group of small apes known for swinging through trees","zh":"与长臂猿科（Hylobatidae）有关的；指长臂猿这一类较小的类人猿"},"examples":[{"en":"Hylobatid apes are famous for brachiation—moving by swinging from branch to branch.","zh":"长臂猿科的猿类以臂行著称——靠在树枝间摆荡移动。"},{"en":"The museum exhibit compares hylobatid vocal calls with those of great apes.","zh":"博物馆展览把长臂猿科的鸣叫与大型类人猿的叫声作比较。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the gibbon family (a gibbon)","zh":"长臂猿科成员；长臂猿"},"examples":[{"en":"A hylobatid uses long arms to travel quickly through the canopy.","zh":"长臂猿科动物用长臂在林冠层快速移动。"},{"en":"Researchers observed a hylobatid pair singing in the early morning.","zh":"研究人员观察到一对长臂猿清晨“对唱”。"}]}],"synonyms":["gibbon","lesser ape"],"phonetic":"/ˌhaɪloʊˈbætɪd/","extraExplanation":["长臂猿科（Hylobatidae）通常指“长臂猿/合趾猿”等较小型类人猿，主要分布在东南亚。它们以在树上用双臂摆荡（brachiation）移动、以及响亮复杂的鸣唱（常用于领地与配偶沟通）而知名。"],"etymology":"来自分类学用语：Hylobatidae（长臂猿科）+ 形容词后缀 -id/-tid，表示“属于某类群的；某类群的成员”。Hylobat- 源自属名 Hylobates。","mnemonic":["把它拆开记：hylo-（可联想“树林/forest”）+ bat（像“摆动/挥动”）+ -id（某类群的）→ “在树林里摆动的猿类那一科”。","联想中文：长臂猿“摆荡”很典型，看到 hylobatid 就想到“会摆荡的那类猿”。"]}
{"word":"hylobatine","summary":{"en":"Hylobatine means “related to gibbons,” and can also mean a gibbon itself (scientific usage).","zh":"hylobatine 表示“与长臂猿有关的”，也可指“长臂猿”（偏科学用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to gibbons (the small, tree-dwelling apes) or to the subfamily that includes them (Hylobatinae).","zh":"与长臂猿有关的；指长臂猿所属的亚科（长臂猿亚科，Hylobatinae）的。"},"examples":[{"en":"Hylobatine apes are known for moving through trees by swinging arm to arm.","zh":"长臂猿亚科的类人猿以在树间用手臂摆荡前进而闻名。"},{"en":"Researchers recorded hylobatine calls to study how gibbons communicate.","zh":"研究人员录制了长臂猿的鸣叫，以研究它们如何交流。"}]},{"partOfSpeech":"n.","definition":{"en":"A gibbon; a member of the gibbon subfamily (Hylobatinae).","zh":"长臂猿；长臂猿亚科（Hylobatinae）的一员。"},"examples":[{"en":"The zoo’s newest hylobatine quickly learned to use the climbing ropes.","zh":"动物园新来的长臂猿很快学会了使用攀爬绳索。"},{"en":"Unlike great apes, most hylobatines are smaller and highly agile in the canopy.","zh":"与大型类人猿不同，多数长臂猿体型更小，且在树冠层非常灵活。"}]}],"synonyms":["gibbon","hylobatid"],"phonetic":"/ˌhaɪləˈbeɪtaɪn/","extraExplanation":["这是一个偏学术/科普用词，更常见的日常说法是 gibbon（长臂猿）。在动物分类学里，Hylobatinae（长臂猿亚科）属于类人猿的一支，典型特征包括“臂行（brachiation）”——用长臂在枝间摆荡移动，以及响亮而有结构的鸣唱。词根 hyl- 来自希腊语，和“森林/林地”有关，因此也带有“林栖”的含义。"]}
{"word":"hylocereus","summary":{"en":"*Hylocereus* is a scientific name for a group of cactus plants associated with dragon fruit (pitaya).","zh":"*Hylocereus* 是与火龙果（pitaya）相关的一类仙人掌的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of climbing cactus plants (now often classified under the genus *Selenicereus*), best known for producing dragon fruit (pitaya).","zh":"一种攀缘仙人掌属（现常被归入 *Selenicereus* 属），最为人熟知的是结出火龙果（pitaya/红龙果等）。"},"examples":[{"en":"Dragon fruit usually comes from a cactus once commonly called *Hylocereus*.","zh":"火龙果通常来自一种过去常被称为 *Hylocereus* 的仙人掌。"},{"en":"In some older books, pitaya is listed under *Hylocereus* species.","zh":"在一些较旧的书里，pitaya（火龙果）会被列在 *Hylocereus* 的物种之下。"}]}],"synonyms":["dragon fruit cactus","pitaya cactus","Selenicereus (modern classification)"],"phonetic":"/ˌhaɪloʊˈsɪriəs/","extraExplanation":["“Hylocereus”是拉丁化的学名，常见于植物学、园艺和食品标签的成分或来源说明中。","近年的分类研究常把传统的 Hylocereus 并入“量天尺属”Selenicereus，因此你可能会在不同资料里看到两种属名并用。"]}
{"word":"hylocichla","summary":{"en":"Hylocichla is a scientific (Latin) genus name, now most commonly used for the wood thrush.","zh":"Hylocichla 是一个拉丁学名（属名），现代多用于指林鸫所属的属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for certain thrushes; in modern classification it is most commonly used for the wood thrush (Hylocichla mustelina).","zh":"（生物学）鸫科鸟类的一个属名；在现代分类中，这个属名最常指林鸫（Hylocichla mustelina）。"},"examples":[{"en":"Hylocichla mustelina is commonly known as the wood thrush.","zh":"Hylocichla mustelina 通常被称为林鸫。"},{"en":"Bird guides may list the wood thrush under the genus Hylocichla.","zh":"一些鸟类图鉴可能会把林鸫列在 Hylocichla 这个属下。"},{"en":"Scientists use Latin names like Hylocichla to avoid confusion across languages.","zh":"科学家使用像 Hylocichla 这样的拉丁学名，以避免不同语言之间的混淆。"}]}],"synonyms":["wood thrush (common name)","Hylocichla mustelina (species name)"],"phonetic":"/ˌhaɪloʊˈsɪklə/","extraExplanation":["这是一个拉丁化的学名（属名）。词源可拆为希腊语 hylē（树林、森林）+ kikhla（鸫鸟），大意是“森林里的鸫”。","在较早的分类中，Hylocichla 有时被用来包含多种“林鸫/夜鸫”类鸟；但常见的现代用法主要对应林鸫这一物种（Hylocichla mustelina）。不同资料可能因分类体系更新而略有差异。"]}
{"word":"hylocomium","summary":{"en":"Hylocomium is a genus of moss, especially the common stair-step moss found in cool forests.","zh":"Hylocomium 是一种苔藓属名，常指常见的“阶梯藓”，多见于凉爽的森林环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of moss, especially the common “stair-step moss,” that forms layered, fern-like mats on forest floors in cool or northern regions.","zh":"一种苔藓属植物（常见为“阶梯藓/层阶藓”），常在凉爽或北方森林地表形成层层叠叠、像蕨类一样的苔藓地毯。"},"examples":[{"en":"Hylocomium often carpets the ground in boreal forests.","zh":"Hylocomium 常常在北方针叶林里铺满地面。"},{"en":"The researchers recorded Hylocomium as an indicator of a moist, shaded habitat.","zh":"研究人员记录到 Hylocomium，作为潮湿、阴暗生境的指示植物。"}]}],"synonyms":["stair-step moss","moss (general)"],"phonetic":"/ˌhaɪləˈkoʊmiəm/","extraExplanation":["“Hylocomium”是植物学中的拉丁化属名，常见物种是 Hylocomium splendens，英文俗名多为 “stair-step moss（阶梯藓）”。之所以叫“阶梯”，是因为它的枝条一年年叠加，外形像一层层台阶。","这个词在日常英语里很少见，主要出现在生态学、植物学、林学的文章或野外调查记录中。"]}
{"word":"hylodes","summary":{"en":"Hylodes is the scientific genus name for certain South American stream frogs.","zh":"Hylodes是某些南美洲溪流栖息青蛙的属名（学名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a genus of small South American stream-dwelling frogs (scientific name: Hylodes).","zh":"（学名）Hylodes：一种生活在南美洲溪流环境中的小型青蛙属。"},"examples":[{"en":"Researchers recorded the calls of Hylodes frogs near a mountain stream.","zh":"研究人员在山间溪流附近录制了Hylodes属青蛙的鸣叫声。"},{"en":"Hylodes species are often studied because they live in fast-flowing forest streams.","zh":"由于生活在森林中流速较快的溪流里，Hylodes属的物种常被用来研究。"}]}],"synonyms":["stream frogs (genus Hylodes)"],"phonetic":"/haɪˈloʊdiːz/","extraExplanation":["“Hylodes”是生物分类学中的属名（genus），通常在学术写作里与具体物种名连用，例如：*Hylodes* + 物种加词（species epithet）。属名一般首字母大写，并常用斜体表示。"]}
{"word":"hylogenesis","summary":{"en":"Hylogenesis means the origin or formation of matter, a rare term mainly used in philosophical or historical contexts.","zh":"Hylogenesis 指“物质的起源或形成”，是一个较罕见、主要见于哲学或历史语境的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the origin or formation of matter (especially in philosophy or early scientific writing).","zh":"（尤用于哲学或早期科学写作中）物质的起源或形成。"},"examples":[{"en":"Some ancient philosophers debated whether hylogenesis could occur without a first cause.","zh":"一些古代哲学家讨论：没有第一因，物质是否还能发生“物质生成”（hylogenesis）。"},{"en":"The author uses “hylogenesis” to describe the world’s transition from chaos to material form.","zh":"作者用“hylogenesis”来描述世界从混沌转变为物质形态的过程。"}]}],"synonyms":["origin of matter","formation of matter","material genesis"],"phonetic":"/ˌhaɪloʊˈdʒɛnəsɪs/","extraExplanation":["词源提示：hyl- 来自希腊语 hylē（“木材/物质”），-genesis 来自 genesis（“产生、起源”）。因此 hylogenesis 字面意思是“物质的生成/起源”。","使用场景：该词非常少见，更多出现在哲学史、形而上学或较古老的科学文本中。现代英语里更常用的替代表达包括 the origin of matter（物质的起源）或 the formation of matter（物质的形成）。"]}
{"word":"hylogeny","summary":{"en":"Phylogeny means the evolutionary history and relatedness of organisms, often represented as a tree.","zh":"Phylogeny 指生物的进化历史与亲缘关系，常用树状图表示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the evolutionary history and relationships of a species or group of organisms (often shown as a family tree)","zh":"（某一物种或生物类群的）系统发育；进化谱系（常用“家谱树/系统树”来表示）"},"examples":[{"en":"Scientists study the phylogeny of birds to understand how different species are related.","zh":"科学家研究鸟类的系统发育，以了解不同物种之间的亲缘关系。"},{"en":"The diagram shows the phylogeny of mammals as a branching tree.","zh":"这张图用分支树展示了哺乳动物的系统发育关系。"}]}],"synonyms":["evolutionary history","evolutionary lineage"],"phonetic":"/faɪˈlɑːdʒəni/","extraExplanation":["词源提示：phylo- 来自希腊语，表示“族群/部族/类群”，-geny 表示“起源/生成”。因此 phylogeny 字面意思接近“类群的起源史”。","学习提示：phylogeny 常与 phylogenetic tree（系统发育树/进化树）、common ancestor（共同祖先）、evolutionary relationship（进化关系）等搭配使用。","拼写提醒：常见错误是把 phy- 写成 hy-（你输入的 hylogeny 少了 p）。标准拼写是 phylogeny。"]}
{"word":"hyloid","summary":{"en":"Hyloid usually means “glassy/transparent in appearance,” and more rarely can mean “related to tree frogs (genus Hyla).”","zh":"Hyloid 通常指“呈玻璃状、透明的”；更少见时可指“与雨蛙属（Hyla）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Glassy or transparent in appearance; like glass.","zh":"外观呈玻璃状的；透明或半透明的。"},"examples":[{"en":"Under the microscope, the tissue showed a hyloid sheen.","zh":"在显微镜下，这种组织呈现出玻璃样的光泽。"},{"en":"The gel formed a smooth, hyloid layer on the surface.","zh":"这种凝胶在表面形成了一层光滑的玻璃状薄膜。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, rare) Relating to or resembling tree frogs of the genus *Hyla*.","zh":"（生物学，较少用）与雨蛙属（*Hyla*）有关的；类似雨蛙的。"},"examples":[{"en":"Some older field guides group several species as hyloid frogs.","zh":"一些较早的野外指南把若干物种归为“雨蛙类（hyloid）”。"}]}],"synonyms":["glassy","hyaline","transparent"],"phonetic":"/ˈhaɪlɔɪd/","extraExplanation":["“hyloid”很少见，第一义常见于医学/生物学描述，意思接近“玻璃样的”，与更常用的“hyaline（玻璃样的、透明的）”在语感上相近。","词源上可追溯到表示“玻璃/透明”的希腊语词根（与 hyaline 同源）。","第二义来自 *Hyla*（雨蛙属）这一拉丁学名，因此在一些旧的分类或描述性文本里会看到 hyloid 用来指“雨蛙类”。"]}
{"word":"hyloist","summary":{"en":"A hyloist is someone who believes that matter is the fundamental reality, often viewing matter as having life or mind-like qualities.","zh":"hyloist 指海洛主义者：认为物质是根本实在，并常把物质看作具有生命或类似心灵性质的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes in hyloism—the idea that matter is the fundamental reality, or that matter itself has life or mind-like qualities.","zh":"海洛主义者；主张“物质为根本实在”或认为“物质本身具有生命/心灵性质”的人。"},"examples":[{"en":"Some early philosophers could be described as hyloists because they thought nature was alive.","zh":"一些早期哲学家可以被称为海洛主义者，因为他们认为自然是有生命的。"},{"en":"In the novel, the scientist becomes a hyloist and treats rocks and rivers as living systems.","zh":"在小说中，这位科学家变成了海洛主义者，把岩石和河流当作有生命的系统。"}]}],"synonyms":["hyloism believer","materialist (approx.)","monist (approx.)"],"phonetic":"/ˈhaɪ.loʊ.ɪst/","extraExplanation":["“hyloist”来自“hyloism”。词根源于希腊语 hylē（意为“木材/物质”），强调“物质”这一基础概念。","在英语语境里，它常用于哲学史、思想史或文学评论中，用来描述一种把自然视为“活的”“有内在能动性”的世界观；与严格的现代物理学用语不同，更偏思想立场。"]}
{"word":"hylology","summary":{"en":"Hylology is a rare philosophical term meaning the study or theory of matter.","zh":"hylology 是较少见的哲学术语，指对“物质/质料”的研究或理论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy) the study or theory of matter (especially “prime matter” or the material principle of things).","zh":"（哲学）物质学；关于“物质”（尤其是“原质/质料”或万物的物质原则）的研究或理论。"},"examples":[{"en":"In Aristotle’s tradition, hylology focuses on matter as one part of what makes a substance.","zh":"在亚里士多德传统中，物质学关注“物质/质料”作为构成实体的一部分。"},{"en":"Some metaphysics courses compare hylology with the study of form to explain how objects are constituted.","zh":"一些形而上学课程会把物质学与“形式”的研究对比，用来解释物体如何被构成。"}]}],"synonyms":["theory of matter","philosophy of matter","hyle theory"],"phonetic":"/haɪˈlɑlədʒi/","extraExplanation":["词源：来自希腊语 hylē（原意与“木材”相关，后引申为“质料/物质”）+ -logy（“……学/……论”）。因此 hylology 字面意思是“关于质料的学问”。","使用场景：该词在现代英语中很少见，多出现在哲学史、亚里士多德研究或讨论“质料—形式”（hylomorphism，质料形相论）的语境里。日常表达中更常用 matter（物质）或 materialism（唯物主义，注意含义不同）。"]}
{"word":"hylomorphic","summary":{"en":"Hylomorphic means “about the idea that things are made of matter plus form,” especially in Aristotelian philosophy.","zh":"hylomorphic 指“与质形论相关”：认为事物由质料（材料）与形式（组织/结构原则）共同构成，常见于亚里士多德哲学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the philosophical view that a physical thing is made of both matter (what it’s made of) and form (the structure or organizing principle that makes it the kind of thing it is).","zh":"指一种哲学观点：具体事物由“质料/材料”（它由什么构成）与“形式/形态”（使它成为某类事物的结构或组织原则）共同组成。"},"examples":[{"en":"Aristotle’s hylomorphic theory says a living body is matter organized by a soul as its form.","zh":"亚里士多德的质形论认为：生命体的身体是质料，而灵魂作为形式对其进行组织。"},{"en":"In a hylomorphic view, a statue isn’t just bronze; its shape and design also matter.","zh":"在质形论的视角下，雕像不只是青铜；它的形状与设计同样关键。"}]}],"synonyms":["Aristotelian","matter-and-form"],"phonetic":"/ˌhaɪləˈmɔrfɪk/","extraExplanation":["词源：来自希腊语 hylē（“质料/木料/材料”）+ morphē（“形态/形式”）。在英语里多用于哲学、神学、古典学等语境，常与 Aristotle（亚里士多德）和 Aquinas（阿奎那）的讨论相关。","常见搭配：hylomorphic theory（质形论）、hylomorphic union（质形结合，常用于身心或灵魂—身体的讨论）、hylomorphism（名词：质形论）。","使用提示：这是学术性很强的词，日常英语很少用；写作中通常用来精确指称“事物由质料与形式构成”的立场，而不是泛泛地说“结构很重要”。"]}
{"word":"hylomorphical","summary":{"en":"A philosophical adjective meaning “explained as made of both matter and form.”","zh":"哲学用语：指用“质料与形式共同构成”的观点来解释事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the idea that a physical thing is made of both matter (what it is made of) and form (the organizing structure that makes it the kind of thing it is).","zh":"与“质料—形式”观点有关：认为一个具体事物由“质料”（材料/物质）与“形式”（组织结构/使其成为某类事物的原则）共同构成。"},"examples":[{"en":"In Aristotle’s philosophy, a living organism is explained in hylomorphical terms: matter shaped by an organizing form.","zh":"在亚里士多德哲学中，生命体可以用“质料—形式”的方式来解释：质料被组织性的形式所塑造。"},{"en":"The professor compared a purely materialist view with a hylomorphical account of mind and body.","zh":"教授把纯粹的唯物主义观点与关于身心关系的“质料—形式”解释进行了对比。"}]}],"synonyms":["hylomorphic","Aristotelian (in context)","matter-and-form (descriptive)"],"phonetic":"/ˌhaɪloʊˈmɔrfɪkəl/","extraExplanation":["“hylomorphical”常见于哲学写作，更常用的拼写是 **hylomorphic**（意思相同）。","词源来自希腊语：**hylē**（质料/木材，引申为“物质”）+ **morphē**（形式/形状）。这一概念与亚里士多德对“实体”的分析密切相关：任何具体事物既有材料层面，也有使其成为某物的结构与功能层面。","在当代语境中，它常出现在形而上学、心灵哲学、神学或“身心一体”的讨论里，用来反对把事物仅仅还原为物理材料的解释。"]}
{"word":"hylomorphism","summary":{"en":"Hylomorphism is Aristotle’s view that every physical thing is a unity of matter and form.","zh":"Hylomorphism（质料—形式论）是亚里士多德的观点：一切物质事物都是“质料”和“形式”的统一体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophical theory (mainly from Aristotle) that says physical things are made of two inseparable aspects: matter (what something is made of) and form (the organizing structure or essence that makes it the kind of thing it is).","zh":"一种哲学理论（主要源自亚里士多德），认为物质事物由两种不可分离的方面构成：质料（东西由什么构成）与形式（使其成为某一类事物的组织结构或本质）。"},"examples":[{"en":"In Aristotle’s philosophy, hylomorphism explains how a statue is both bronze (matter) and a particular shape (form).","zh":"在亚里士多德哲学中，“质料—形式论”解释了雕像既是青铜（质料），又具有特定形状（形式）。"},{"en":"Some thinkers use hylomorphism to discuss what makes a living body different from a non-living object.","zh":"一些思想家用“质料—形式论”来讨论生命体与非生命物体的区别究竟在哪里。"}]}],"synonyms":["matter-and-form theory","Aristotelian hylomorphism","hylomorphic theory"],"phonetic":"/ˌhaɪloʊˈmɔrˌfɪzəm/","extraExplanation":["词源：来自希腊语 hylē（“木材/质料”）+ morphē（“形状/形式”），因此常译为“质料—形式论”或“形质论”。","常见语境：多出现在形而上学、心灵哲学、神学（如托马斯·阿奎那）等讨论中，用来解释“同一事物如何同时具有材料与结构/本质”。","学习提示：不要把“form”简单理解为“外形”；在哲学里它更接近“使某物成为某物的原则/结构/本质”，不一定只是外观。"]}
{"word":"hylomorphist","summary":{"en":"A hylomorphist believes that things are composed of both matter and form (an Aristotelian view).","zh":"hylomorphist 指相信“事物由质料与形式共同构成”的形质论者（亚里士多德传统）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes in hylomorphism—the idea (from Aristotle) that physical things are made of both matter and form.","zh":"“质料—形式论者”；指相信“质料形式说/形质论”的人（源自亚里士多德），认为物质事物由“质料（matter）”与“形式（form）”共同构成。"},"examples":[{"en":"As a hylomorphist, she argues that a living body cannot be fully explained by matter alone.","zh":"作为一名形质论者，她认为仅靠“质料”不足以完整解释活体。"},{"en":"Many medieval philosophers were hylomorphists influenced by Aristotle.","zh":"许多中世纪哲学家受亚里士多德影响，属于形质论者。"}]}],"synonyms":["hylomorphism advocate","Aristotelian (in metaphysics)","Thomist (in some contexts)"],"phonetic":"/ˌhaɪloʊˈmɔrˌfɪst/","extraExplanation":["“hylomorphist”来自希腊语词根：hylē（ὕλη，意为“木材/原料”，引申为“质料”）+ morphē（μορφή，意为“形状/形式”）。在亚里士多德传统里，“形式”不是外表的样子，而更接近“使某物成其为某物的结构、功能与本质”。","该观点在托马斯·阿奎那等经院哲学中很常见，也常用于讨论“身心关系”“灵魂与身体”“事物的本质/同一性”等问题。"]}
{"word":"hylomorphous","summary":{"en":"Hylomorphous means relating to the philosophical idea that things are composed of both matter and form.","zh":"hylomorphous 指与“事物由质料与形式共同构成”的哲学观点有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having to do with the idea that a physical thing is made of both matter (what it is made from) and form (the organizing structure that makes it the kind of thing it is).","zh":"与“质料—形式”观点有关：认为具体事物由“质料”（材料、构成物）与“形式”（组织结构、使其成为某类事物的原则）共同组成。"},"examples":[{"en":"In a hylomorphous view of a statue, the bronze is the matter and the shape is the form.","zh":"在一种质料—形式的观点里，雕像的青铜是质料，而造型就是形式。"},{"en":"Some philosophers argue that living beings are best understood in a hylomorphous way, not as simple machines.","zh":"一些哲学家认为，理解生命体最好采用质料—形式的方式，而不是把它们当作简单机器。"}]}],"synonyms":["hylomorphic","Aristotelian (in this context)"],"phonetic":"/ˌhaɪloʊˈmɔrfəs/","extraExplanation":["“hylomorphous”来自希腊词根：hylē（质料、木材）+ morphē（形状、形式）。它常见于讨论亚里士多德（Aristotle）的“质料—形式论”（hylomorphism）。在这种框架中，“形式”不是外表那么简单，更接近“组织与功能的原则”（让一团材料成为“这一个东西”的东西）。","现代英语里它非常书面、学术，日常对话很少用；更常见的相关词是“hylomorphism / hylomorphic（质料—形式论/质料—形式的）”。"]}
{"word":"hylomys","summary":{"en":"Hylomys is a scientific genus name for Southeast Asian gymnures (small insect-eating mammals related to hedgehogs).","zh":"Hylomys（林猬属）是一个动物学属名，指东南亚的猬（gymnure）类小型食虫哺乳动物，与刺猬近缘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small insect-eating mammals (gymnures) from Southeast Asia, related to hedgehogs and sometimes called short-tailed gymnures","zh":"（生物）林猬属：一种分布于东南亚、以昆虫为食的小型哺乳动物属，和刺猬近缘，常被称为“短尾猬（鼩）/短尾猬鼠（gymnure）”"},"examples":[{"en":"Researchers surveyed Hylomys populations in a lowland rainforest.","zh":"研究人员在低地雨林中调查了林猬属（Hylomys）的种群。"},{"en":"Hylomys is sometimes described as a short-tailed gymnure rather than a true mouse.","zh":"林猬属（Hylomys）有时被称为“短尾猬（gymnure）”，而不是真正的“鼠”。"}]}],"synonyms":["short-tailed gymnure (common name)","gymnure (broader group)"],"phonetic":"/ˌhaɪləˈmaɪs/","extraExplanation":["“Hylomys”是拉丁化的学名，常见于动物学/生态学论文中。词源来自希腊语：hylē（森林、树林）+ mys（鼠），因此字面有“林中之鼠”的感觉，但它并非啮齿类的鼠，而是与刺猬同科（Erinaceidae）的类群。"]}
{"word":"hylopathism","summary":{"en":"A philosophical doctrine that explains mind and consciousness as products of matter.","zh":"一种哲学学说，认为心灵与意识是物质的产物，可由物理过程解释。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief that mental life (thought, feeling, consciousness) is produced by matter and can be explained as the result of physical processes; a strongly materialist view of the mind","zh":"（哲学）物质生心论：认为思想、情感、意识等心灵活动由物质产生，并可用物理过程来解释；一种强烈的唯物主义心灵观"},"examples":[{"en":"Some early modern writers criticized hylopathism for reducing the soul to bodily motion.","zh":"一些近代早期的作者批评物质生心论，因为它把灵魂简化为身体的运动。"},{"en":"In a debate about consciousness, he rejected hylopathism and defended a non-material mind.","zh":"在关于意识的辩论中，他反对物质生心论，主张心灵并非纯物质的产物。"}]}],"synonyms":["materialism","physicalism","reductionism"],"phonetic":"/ˌhaɪloʊˈpæθɪzəm/","extraExplanation":["词源可拆为 hylo-（来自希腊语 hylē，意为“物质/木料”）+ -path-（来自希腊语 pathos，意为“感受/经历”）+ -ism（学说）。整体强调“感受与心灵现象由物质导致/决定”。","该词多见于哲学史或神学争论的语境，常被用来指一种把心灵现象完全还原为物理与生理机制的立场，语气往往带批判或反对意味。"]}
{"word":"hylopathist","summary":{"en":"A hylopathist is a (rare) term for someone who believes reality is entirely material.","zh":"hylopathist 是个很少见的词，指认为现实完全由物质构成的人（偏强烈唯物立场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that everything is fundamentally made of matter (a strongly materialist view of reality).","zh":"主张“万物本质皆为物质”的人（强调物质是现实的根本基础，偏向强烈的唯物主义观点）。"},"examples":[{"en":"Some critics described him as a hylopathist because he rejected any spiritual explanation.","zh":"一些批评者称他为 hylopathist，因为他拒绝任何精神层面的解释。"},{"en":"In the debate, the hylopathist argued that mind is only a product of the brain.","zh":"在辩论中，这位 hylopathist 认为心灵只是大脑的产物。"}]}],"synonyms":["materialist","physicalist","naturalist"],"phonetic":"/haɪˈlɑpəθɪst/","extraExplanation":["该词非常罕见，多见于哲学史/神学争论或批判性文章中，常用来指立场偏“极端唯物”的人；在现代更常用 materialist（唯物主义者）或 physicalist（物理主义者）。","词源上常被解释为来自希腊语词根 hylē（物质、木料）相关构词，整体含义指“以物质为根本”的思想立场。由于不常用，写作中使用时最好给出上下文或改用更常见的同义词。"]}
{"word":"hylopathy","summary":{"en":"Hylopathy is a rare term meaning either a materialist view of the mind (philosophy) or, very rarely, a disease affecting wood.","zh":"Hylopathy 是一个罕见词：可指哲学中以物质解释心灵的观点，也可极少见地指木材/木质组织的病害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, rare) The view that mental life (mind, soul, consciousness) is based on matter—essentially a form of materialism.","zh":"（哲学，罕见）认为精神活动（心灵、灵魂、意识）以物质为基础的观点；本质上是一种唯物主义立场。"},"examples":[{"en":"Some 19th‑century writers used “hylopathy” to argue that thought is a function of the brain’s material processes.","zh":"一些19世纪的作者用“hylopathy”来主张：思想是大脑物质过程的功能。"},{"en":"In that debate, hylopathy was contrasted with theories that treat the soul as independent from the body.","zh":"在那场争论中，hylopathy 常与“灵魂独立于身体”的理论相对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/Botany, very rare) A disease or pathological condition affecting wood or woody tissue.","zh":"（生物/植物学，极罕见）影响木材或木质组织的病害/病理状况。"},"examples":[{"en":"The report briefly mentioned hylopathy as a possible cause of weakening in the tree’s trunk.","zh":"报告简要提到 hylopathy 可能是树干变脆弱的原因之一。"}]}],"synonyms":["materialism","physicalism","(wood) rot","wood decay"],"phonetic":"/ˌhaɪˈlɑpəθi/","extraExplanation":["词源提示：hylo- 来自希腊语 hylē，既可指“木材”，也可引申为“原质/物质”；-pathy 表示“疾病/病理”或“感受/状态”。因此该词在不同语境中会出现“木材的病害”或“以物质解释心灵”的用法。","使用提醒：hylopathy 在现代英语中非常少见；哲学语境里更常见的对应词是 materialism（唯物主义）或 physicalism（物理主义）。"]}
{"word":"hylophagous","summary":{"en":"Hylophagous means “wood-eating” (feeding on wood).","zh":"hylophagous 意为“食木的/以木材为食的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"feeding on wood (especially eating wood as food).","zh":"以木材为食的（尤指把木头当作食物来吃的）。"},"examples":[{"en":"Termites are often described as hylophagous insects.","zh":"白蚁常被形容为食木性昆虫。"},{"en":"Some beetle larvae are hylophagous and live inside rotting logs.","zh":"有些甲虫幼虫以木材为食，生活在腐朽的原木里。"}]}],"synonyms":["wood-eating","wood-feeding","xylophagous"],"phonetic":"/ˌhaɪləˈfæɡəs/","extraExplanation":["词源：hylo- 表示“森林/木材”（源自希腊语 hylē），-phagous 表示“吃……的”（源自希腊语 phagein “吃”）。因此 hylophagous 字面意思就是“吃木头的”。","使用场景：这是偏生物学/生态学的书面词，日常英语更常说 wood-eating 或 wood-feeding。"]}
{"word":"hylotheism","summary":{"en":"Hylotheism is the belief that matter is divine, or that God is material.","zh":"hylotheism 指“物质是神圣的”或“神是物质性的”的信仰（物神论）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief that matter (the physical world) is divine, or that God is made of matter","zh":"物神论；主张“物质是神圣的”或“神由物质构成”的信仰"},"examples":[{"en":"In some ancient philosophies, hylotheism treated the material world as sacred rather than separate from the divine.","zh":"在一些古代哲学中，物神论把物质世界视为神圣的，而不是与神性分离。"},{"en":"The essay contrasts hylotheism with ideas that place God outside nature.","zh":"这篇文章把物神论与“上帝在自然之外”的观念作对比。"}]}],"synonyms":["material pantheism","hylozoism (related)"],"phonetic":"ˌhaɪləˈθiːɪzəm","extraExplanation":["词源：hylo- 来自希腊语 hylē（“物质、木料”），-theism 表示“有神论/信仰”。整体强调“神性与物质本身不可分”。","概念对比：hylotheism 通常比 pantheism（泛神论）更“物质化”，强调神是“物质的”；而 panentheism（泛在神论）则常说神“包含”宇宙但又“超越”宇宙。不同学者用法不完全一致，阅读时可看作者如何定义。","使用场景：该词偏学术，常见于宗教哲学、古典思想史或神学讨论中；日常英语里很少用。"]}
{"word":"hylotheist","summary":{"en":"A hylotheist believes matter is divine or that God and matter are essentially the same.","zh":"hylotheist 指认为“物质具有神性”或“神与物质同一”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that matter (the physical world) is the basic reality and is itself divine, or that God and matter are essentially the same.","zh":"主张“物质即神/神与物质同一”的人；认为物质（物质世界）是根本实在并具有神性的人。"},"examples":[{"en":"Some critics described the poet as a hylotheist because his poems treat nature as sacred matter.","zh":"一些评论家称这位诗人为“物质神论者”，因为他的诗把自然当作神圣的物质。"},{"en":"In debates about religion and philosophy, a hylotheist may reject the idea of a separate, non-material God.","zh":"在宗教与哲学的辩论中，物质神论者可能会否定一个独立于物质、非物质的上帝。"}]}],"synonyms":["material theist","pantheist (related)"],"phonetic":"/ˌhaɪloʊˈθiːɪst/","extraExplanation":["词源：hylo- 来自希腊语 hylē（“木材、物质”→“质料/物质”），-theist 来自 theos（“神”）。字面意思可理解为“把物质当作神的人”。","使用场景：这是一个较少见、偏学术的词，多出现在哲学史、宗教研究或文学批评中，用来描述一种把“神性”理解为内在于物质世界的观点。","易混概念：它常与 pantheist（泛神论者：神即万物）或 materialist（唯物论者：强调物质为本）被拿来对照；hylotheist 更强调“物质本身具有神性/即为神”。"]}
{"word":"hylotheistic","summary":{"en":"Hylotheistic means believing the divine is identical with, or fully present in, matter and the material universe.","zh":"hylotheistic 指“物质神论/质神论的”：认为神性与物质同一，或完全内在于物质与宇宙。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the belief that God (or the divine) is identical with matter, or that the divine exists in and as the material world.","zh":"与“物质神论/质神论”有关的：认为上帝（神性）与物质同一，或神性存在于并体现为物质世界。"},"examples":[{"en":"Some writers describe certain ancient philosophies as hylotheistic because they treat the universe itself as divine.","zh":"一些作者把某些古代哲学描述为“物质神论的”，因为它们把宇宙本身视为神圣。"},{"en":"The article contrasts hylotheistic views with religions that separate God from the material world.","zh":"这篇文章把“物质神论”的观点与把上帝和物质世界分开的宗教作对比。"}]}],"synonyms":["materialistic theism (contextual)","pantheistic (related, not identical)","immanent (related)"],"phonetic":"ˌhaɪloʊθiˈɪstɪk","extraExplanation":["词源提示：hylo- 来自希腊语 hylē（“物质、原料”），-theistic 与 theism（“有神论”）相关。hylotheistic 通常用于哲学/宗教学的讨论，强调“神性=物质/神性内在于物质”，与强调神超越世界的“超越神观”形成对照。","用法提示：这是学术性较强的词，日常英语很少用；写作中常见搭配有 hylotheistic belief/view/idea、a hylotheistic tradition。"]}
{"word":"hylotheistical","summary":{"en":"Hylotheistical means “connected to the belief that matter is divine or is God.”","zh":"hylotheistical 指“与认为物质是神/物质具有神性（物神论）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the belief that matter (physical substance) is divine or is itself God; treating the material world as God.","zh":"与“物神论/物质即神”的观念有关；认为物质（实体）本身是神，或把物质世界视为神。"},"examples":[{"en":"Some critics argued that the poem’s nature worship sounded almost hylotheistical, as if the forest itself were God.","zh":"一些批评者认为这首诗对自然的崇拜听起来几乎带有物神论色彩，仿佛森林本身就是神。"},{"en":"In the lecture, the professor contrasted pantheistic and hylotheistical views of the universe.","zh":"在讲座中，教授对比了泛神论与物神论式的宇宙观。"}]}],"synonyms":["hylotheistic","materialistic (in a religious/philosophical sense)","pantheistic (related, but not identical)"],"phonetic":"/ˌhaɪ.loʊ.θiˈɪs.tɪ.kəl/","extraExplanation":["这个词比较罕见，多见于哲学/神学写作。常见形式是 **hylotheistic**（形容词）和 **hylotheism**（名词，物神论）。","词源来自希腊语：**hylē**（“物质、木料”）+ **theos**（“神”）。","容易和 **pantheistic**（泛神论：神存在于万物之中）混淆；hylotheistical 更强调“物质本身就是神/神性属于物质本体”。"]}
{"word":"hylotomous","summary":{"en":"Hylotomous means “related to cutting wood,” a very rare/learned adjective.","zh":"hylotomous 指“与砍伐木材有关的”，是很少见、偏书面的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to cutting or chopping wood; wood-cutting.","zh":"（罕用）与砍伐、劈柴等“切割木材”有关的；伐木的。"},"examples":[{"en":"The village relied on hylotomous labor to supply firewood for the winter.","zh":"这个村庄依靠伐木、劈柴等与砍木有关的劳作来备足过冬的柴火。"},{"en":"He bought a sturdy axe for hylotomous work in the forest.","zh":"他买了一把结实的斧头，用来在森林里进行砍木作业。"}]}],"synonyms":["woodcutting","logging","lumbering"],"phonetic":"/ˌhaɪləˈtɑːməs/","extraExplanation":["这个词非常少见，多见于较旧或较学术的写法。构词上可理解为：hyl(o)- 来自希腊语 hylē（木材、森林），-tomous 与“切割”（如 anatomy 解剖）相关，因此整体含义指向“切木/伐木”。","现代英语里更常用的表达是 woodcutting / lumbering / logging（伐木），或用短语 cut/chop wood 来说“砍柴”。"]}
{"word":"hylotropic","summary":{"en":"Hylotropic means oriented toward physical matter—material-focused rather than spiritual or abstract.","zh":"hylotropic 指“偏向物质的/强调物质层面”的，常与精神或抽象层面相对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, oriented toward, or emphasizing physical matter rather than mind, spirit, or abstract ideas; material-focused.","zh":"与物质有关的；倾向于强调物质层面（而非心灵、精神或抽象观念）的；物质取向的。"},"examples":[{"en":"His explanation was purely hylotropic, focusing on the brain and chemicals rather than beliefs.","zh":"他的解释完全是物质取向的，只谈大脑和化学物质，而不谈信念。"},{"en":"Some critics say modern life can feel hylotropic—full of things to buy, but short on meaning.","zh":"有些批评者说，现代生活可能显得很“物质取向”——东西很多可买，但意义感不足。"}]}],"synonyms":["materialistic","matter-oriented","physical","worldly"],"phonetic":"/ˌhaɪləˈtrɑːpɪk/","extraExplanation":["这个词很少见，多出现在哲学或批评性写作中，用来表达“偏向物质/实体”的立场或风格。","词源可拆为希腊语 hylē（物质、原料）+ -tropic（转向、倾向），字面意思是“转向物质的/倾向物质的”。","注意不要和更常见的 lyotropic（溶致的，化学/液晶领域常见）混淆。"]}
{"word":"hylozoic","summary":{"en":"Hylozoic describes the belief that all matter is alive or life-like, often used in philosophy and sometimes in literary description of nature.","zh":"Hylozoic 指“万物有生”的观念：认为一切物质都有生命或生命性，多用于哲学语境，也可用于描写自然万物仿佛有生命的文学表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the idea (a belief in philosophy) that all matter is alive or has a life-like quality.","zh":"与“万物有生”（一种哲学观点）有关：认为所有物质都是有生命的，或具有类似生命的特性。"},"examples":[{"en":"In some hylozoic views, stones and rivers are seen as having a kind of inner life.","zh":"在一些万物有生的观点中，石头和河流被看作具有某种内在生命。"},{"en":"The poet used hylozoic imagery, describing the forest as if it could think and feel.","zh":"这位诗人用了“万物有生”的意象，把森林写得仿佛会思考、会感受。"}]}],"synonyms":["panpsychic","vitalistic"],"phonetic":"/ˌhaɪləˈzoʊɪk/","extraExplanation":["“hylozoic”来自希腊语：hylē（物质、木材）+ zōē（生命）。它常出现在哲学、宗教史、文学批评或生态思想讨论中，带有“自然万物都像有生命/有灵性”的意味。","注意区分：hylozoic（主张物质本身有生命）与 animistic（泛灵论，认为万物有“灵/精灵”）不完全相同；前者更强调“生命性在物质之中”，后者更强调“灵的存在”。","在文学语境里，它常用来形容把无生命之物写得像有生命（类似拟人/物活化）的风格，但它比普通的 personification（拟人）更偏“哲学化”的世界观色彩。"]}
{"word":"hylozoism","summary":{"en":"Hylozoism is the philosophical view that all matter is alive or has life-like qualities.","zh":"Hylozoism（泛生论）是一种哲学观点，认为一切物质在某种意义上都具有生命或类生命特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief that all matter (everything physical) is in some sense alive or has life-like qualities.","zh":"泛生论；认为一切物质（所有实体）在某种意义上都是“有生命的”或具有类似生命的特性。"},"examples":[{"en":"Some ancient philosophies sound like hylozoism because they treat nature as living and active.","zh":"一些古代哲学听起来像泛生论，因为它们把自然看作有生命且会主动作用的。"},{"en":"The poet’s description of “breathing stones” is not science, but it echoes hylozoism in a literary way.","zh":"诗人写“会呼吸的石头”并非科学说法，但在文学意义上呼应了泛生论。"}]}],"synonyms":["panvitalism","vitalism (related, broader)"],"phonetic":"/ˌhaɪləˈzoʊɪzəm/","extraExplanation":["词源：来自希腊语 hylē（物质、材料）+ zōē（生命），字面意思接近“物质即有生命”。","概念区别：hylozoism 强调“物质本身就有生命/生命性”；它不同于 animism（万物有灵，偏向“灵魂/精灵”观念），也不同于 panpsychism（泛心论，强调“意识/心灵”遍在）。","使用语域：这是哲学/思想史里的术语，日常英语很少用；写作中常出现在讨论古希腊思想、斯多亚学派、或浪漫主义自然观等语境。"]}
{"word":"hylozoist","summary":{"en":"A hylozoist is someone who believes all matter is alive or has a life-like principle.","zh":"hylozoist 指“泛生论者”，认为一切物质都具有生命或类似生命的内在原则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that all matter is alive or has a life-like principle (the view is called hylozoism)","zh":"泛生论者；认为一切物质都有生命（或类似生命的内在原则）的人（这种观点称为“泛生论”）"},"examples":[{"en":"Some early Greek thinkers are sometimes described as hylozoists because they thought nature was living.","zh":"一些早期希腊思想家有时被称为泛生论者，因为他们认为自然界是有生命的。"},{"en":"He isn’t religious, but he sounds like a hylozoist when he talks about stones and rivers having their own kind of life.","zh":"他并不宗教化，但当他谈到石头和河流也有其“生命”时，听起来像个泛生论者。"}]}],"synonyms":["hylozoism believer","panpsychism supporter (related, not identical)"],"phonetic":"/ˌhaɪloʊˈzoʊɪst/","extraExplanation":["“hylozoist”来自希腊语：hylē（物质、木材）+ zōē（生命）。在哲学史里，它常与自然哲学、某些泛神论式的自然观相邻，但并不等同于“万物有灵论”（animism）：后者更强调“灵”或“神灵”，而泛生论更强调“物质本身具生命性”。","在文学或修辞里，用“hylozoist”形容某人，往往带有“把无生命之物写得像有生命”这种气质（接近拟人化的世界观），常见于浪漫主义或自然写作语境。"]}
{"word":"hylozoistic","summary":{"en":"Hylozoistic describes the belief that all matter is alive or life-like.","zh":"Hylozoistic 指“泛生论”的观点：认为一切物质都具有生命或生命性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Believing that all matter (everything physical) is alive or has a life-like quality.","zh":"（哲学）认为一切物质（所有实体）都具有生命或类似生命的性质。"},"examples":[{"en":"Some ancient philosophies are hylozoistic, treating nature as something alive rather than mechanical.","zh":"一些古代哲学带有泛生论（hylozoistic）色彩，把自然视为“活的”，而不是纯机械的。"},{"en":"The poet’s hylozoistic imagery makes stones and rivers feel as if they can breathe.","zh":"这位诗人的泛生论式意象让石头和河流仿佛也会呼吸。"}]}],"synonyms":["hylozoic","panpsychist (related, not identical)","animistic (related, not identical)"],"phonetic":"/ˌhaɪloʊzoʊˈɪstɪk/","extraExplanation":["词源：来自希腊语 hylē（物质、木材）+ zōē（生命），合起来大意是“物质有生命”。","常见语境：多用于哲学、宗教研究、文学批评中，讨论“自然是否有生命/灵性”。它不等同于“万物有灵论（animism）”：hylozoism 更强调“物质本身就有生命性”，而 animism 往往强调“灵魂/精灵附着在万物之中”。","用法提示：hylozoistic 比较学术，日常英语很少用；写作中常用来描述某种世界观（a hylozoistic worldview）或艺术风格（hylozoistic imagery）。"]}
{"word":"hylozoistically","summary":{"en":"“Hylozoistically” means “in a hylozoist way,” viewing matter or nature as living.","zh":"“hylozoistically”意为“以物活论的方式”，把物质或自然视为有生命。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that reflects hylozoism (the belief that all matter is alive or has life-like qualities).","zh":"以“物活论”（认为一切物质都有生命或类似生命的性质）的方式；从物活论角度。"},"examples":[{"en":"Some early philosophers described the universe hylozoistically, treating nature as living and self-moving.","zh":"一些早期哲学家以物活论的方式描述宇宙，把自然看作有生命、能自我运动的整体。"},{"en":"The poet speaks hylozoistically about rivers and stones, as if they have feelings.","zh":"诗人以物活论的口吻谈论河流与石头，仿佛它们有情感。"}]}],"synonyms":["in a hylozoist way","animistically (often similar, but not identical)"],"phonetic":"ˌhaɪləzoʊˈɪstɪkli","extraExplanation":["“hylozoistically”源自“hylozoism”（物活论）：hylo- 表示“物质”（源于希腊语 hylē），-zo- 表示“生命”（源于希腊语 zōē），整体指“万物有生”。在英语里它多见于哲学、宗教研究、文学批评等语境，用来描述一种把自然/物质视作“活的”的阐释方式。","不要把它等同于“拟人化（personification）”：拟人化是修辞手法，而“hylozoistically”更强调一种世界观或哲学立场（当然文学分析中二者可能同时出现）。"]}

