{"word":"Hymen","summary":{"en":"a thin vaginal membrane; also a marriage-related term in Greek myth and older literature","zh":"阴道口附近的薄膜组织；亦可指希腊神话中的婚姻之神或古文中的婚礼颂歌/庆典"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin fold of tissue at or near the opening of the vagina; its shape and size vary widely from person to person.","zh":"（解剖）处于或接近阴道口的一层薄的组织皱襞；形态与大小因人而异。"},"examples":[{"en":"In most people, the hymen stretches naturally during exercise, tampon use, or sexual activity.","zh":"对大多数人来说，这层组织可能会在运动、使用卫生棉条或性行为中自然被拉伸。"},{"en":"A doctor explained that the hymen can look different from one patient to another.","zh":"医生解释说，不同患者的这层组织外观可能差异很大。"}]},{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the god of marriage; also the name for a wedding song or celebration in older literature.","zh":"（希腊神话）婚姻之神；在较古老的文学中也可指婚礼颂歌或婚礼庆典。"},"examples":[{"en":"The poem invokes Hymen to bless the marriage.","zh":"诗歌召唤婚姻之神为婚姻赐福。"},{"en":"In older texts, “hymen” can refer to a wedding song.","zh":"在较老的文本中，“hymen”有时指婚礼颂歌。"}]}],"synonyms":["membrane","vaginal membrane","wedding song","marriage hymn"],"phonetic":"ˈhaɪmən","extraExplanation":["文化与医学提示：把这层组织当作“是否处女/是否发生过性行为”的可靠证据是不准确的。它可能先天开口较大、弹性很强，也可能因运动、骑行、使用卫生棉条等而变化；是否出血也因人而异。更可靠的性健康评估应基于医学检查与个人病史，而非单一外观。"],"etymology":"源自希腊语 hymēn，意为“膜、薄皮”；同源也与希腊神话中的婚姻之神 Hymen（Hymenaeus）相关，因此在文学里出现“婚礼/婚歌”的意义。","mnemonic":["联想“海门”≈“入口的门”：它在阴道口附近（但不是封死的“门”）。","把它记成“薄膜”：hymen 的核心意思就是“膜（membrane）”。"]}
{"word":"hymen","summary":{"en":"The hymen is a variable thin membrane near the vaginal opening; culturally it has been used as a symbol of virginity, but it is not a reliable sign of sexual history.","zh":"hymen 指阴道口附近一层薄膜，个体差异很大；在文化上常被当作“贞洁”象征，但它并不能可靠判断性经历。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin, elastic membrane at or near the opening of the vagina; its shape and presence vary widely from person to person.","zh":"（解剖）处于阴道口附近的一层薄而有弹性的膜；其形态与是否明显因人而异。"},"examples":[{"en":"A doctor explained that the hymen can look different in different people.","zh":"医生解释说，不同人的处女膜外观可能不同。"},{"en":"Some people are born with very little hymenal tissue.","zh":"有些人天生处女膜组织就很少或不明显。"}]},{"partOfSpeech":"n.","definition":{"en":"In literature and older discussions, a symbol of virginity or sexual “purity” (a cultural idea rather than a reliable medical fact).","zh":"（文学/旧语境）作为“处女/贞洁”的象征（属于文化观念，并非可靠的医学判断依据）。"},"examples":[{"en":"The novel uses the hymen as a symbol of innocence, reflecting the era’s values.","zh":"小说把处女膜当作纯真象征，反映了那个时代的价值观。"}]}],"synonyms":["hymenal membrane","hymenal tissue"],"phonetic":"/ˈhaɪmən/","extraExplanation":["处女膜的状态（例如是否“完整”、是否出血）不能用来准确判断是否发生过性行为：它可能因运动、外伤、医学操作等产生变化，也可能在性行为中没有明显变化或出血。","在某些文化中，处女膜与“贞洁”被错误地强绑定，可能导致羞辱、歧视或暴力。现代医学与人权倡议普遍反对用所谓“处女膜检查”来评判个人。"]}
{"word":"hymen-related","summary":{"en":"connected with the hymen.","zh":"与处女膜有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the hymen (a thin membrane at the opening of the vagina).","zh":"与处女膜（阴道口附近的薄膜组织）有关的。"},"examples":[{"en":"The doctor noted a hymen-related tear after the injury.","zh":"医生在受伤后记录到与处女膜有关的撕裂。"},{"en":"She asked questions about hymen-related anatomy in a health class.","zh":"她在健康课上询问了与处女膜相关的解剖问题。"}]}],"synonyms":["hymenal","hymen-associated"],"phonetic":"/ˈhaɪmən rɪˌleɪtɪd/","extraExplanation":["文化与医学提醒：处女膜的形态差异很大，也可能因运动、使用卫生棉条或自然发育而变化；是否“完整”不能可靠地证明是否发生过性行为。“hymen-related”在医学语境中更中性，常用于描述解剖、出血、疼痛或损伤等。"],"etymology":"“hymen”来自希腊语，原指婚礼/婚姻之神 Hymen（Hymenaeus），后来在解剖学中用来指“处女膜”；“related”来自 relate（关联）+ -ed（表示“与……有关的”）。组合成“与处女膜有关的”。","mnemonic":["把它拆开记：hymen（处女膜）+ related（相关的）= “处女膜相关”。","联想“hymen”发音像“海门（hǎi mén）”，门=“开口/入口”，对应“阴道口附近的膜”。"]}
{"word":"hymenaea","summary":{"en":"Hymenaea is a genus of tropical trees, known for durable wood and resin (e.g., the jatobá tree).","zh":"Hymenaea 指热带乔木的一个属，以耐用木材和树脂闻名（如常称 jatobá 的物种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees in the pea family (Fabaceae), native mainly to Central and South America; some species (especially Hymenaea courbaril) produce hard, durable wood and resin used for varnish and incense.","zh":"（植物）海曼娜属：豆科的热带乔木属，主要分布于中美洲和南美洲；其中一些物种（尤指西印度角豆/巴西柯巴树 Hymenaea courbaril）能产出坚硬耐用的木材与树脂，可用于清漆、香料等。"},"examples":[{"en":"Hymenaea courbaril (often called jatobá) is valued for its strong timber.","zh":"Hymenaea courbaril（常叫作 jatobá）因木材坚硬而受重视。"},{"en":"Some Hymenaea species produce resin sometimes referred to as copal.","zh":"一些海曼娜属植物会分泌树脂，有时被称为 copal（柯巴脂）。"}]}],"synonyms":["jatobá (for Hymenaea courbaril)","copal tree (informal, for resin-producing species)"],"phonetic":"/ˌhaɪməˈniːə/","extraExplanation":["“Hymenaea”是拉丁学名，来自希腊语词根，和婚礼之神 Hymen（Hymenaeus）同源；命名上常见于植物学拉丁名中。","在日常英语里，这个词多出现在植物学、生态学或木材/树脂相关资料中；更常见的俗名是某些物种的名称，如“jatobá”（常指 Hymenaea courbaril）。"]}
{"word":"Hymenaeus","summary":{"en":"Greek marriage deity; also a traditional wedding song.","zh":"希腊婚姻之神；也指传统婚歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the god (or personification) of marriage and wedding ceremonies.","zh":"（希腊神话）婚姻与婚礼仪式之神／婚姻的拟人化形象。"},"examples":[{"en":"In the poem, the bride calls on Hymenaeus to bless the union.","zh":"在诗中，新娘祈求Hymenaeus为这段结合赐福。"},{"en":"Ancient writers often mention Hymenaeus during descriptions of weddings.","zh":"古代作家在描写婚礼时常提到Hymenaeus。"}]},{"partOfSpeech":"n.","definition":{"en":"A wedding song or chant, especially in ancient Greek and Roman tradition.","zh":"（尤指古希腊、古罗马）婚礼颂歌／婚歌。"},"examples":[{"en":"They sang a Hymenaeus as the couple entered the hall.","zh":"新人入场时，人们唱起了婚歌。"},{"en":"The chorus functions like a Hymenaeus, celebrating love and marriage.","zh":"合唱部分起到婚歌的作用，歌颂爱情与婚姻。"}]}],"synonyms":["Hymen","wedding song","nuptial song","epithalamium"],"phonetic":"/ˌhaɪmɪˈniːəs/","extraExplanation":["在英语文学里，Hymenaeus 常出现在古典题材的诗歌、戏剧与颂歌中，用来营造“古典婚礼”的氛围。相关体裁词是 epithalamium（婚礼颂诗）。"],"etymology":"源自拉丁语 Hymenaeus，来自古希腊语 Hyménaios（Ὑμέναιος），与 Hymen（婚姻、婚礼；亦指“处女膜”的词源同根）相关；在古典文学中既可指婚礼之神，也可指婚礼颂歌。","mnemonic":["把它拆成“hymn（赞美诗）+ -aeus”：婚礼上唱赞歌→联想到“婚礼颂歌/婚姻之神”。","联想中文“婚宴（hūn yàn）”：听起来像 Hymenaeus 的开头“Hy-”，婚宴对应婚礼场景。"]}
{"word":"hymenaeus","summary":{"en":"Hymenaeus refers to the Greek god of marriage and, in poetry, a wedding song or wedding celebration.","zh":"Hymenaeus 指希腊神话中的婚姻之神，也可在诗歌中指“婚歌”或“婚礼庆典”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The god or personification of marriage and wedding ceremonies; often invoked to bless a couple.","zh":"（希腊神话）婚姻与婚礼仪式的神（或人格化形象）；常被用来祈求新人得福。"},"examples":[{"en":"In Greek myths, Hymenaeus is called upon to bless the bride and groom.","zh":"在希腊神话中，人们会呼唤 Hymenaeus 来祝福新郎新娘。"},{"en":"The poem ends with an invocation to Hymenaeus, celebrating the couple’s union.","zh":"这首诗以对 Hymenaeus 的祈祷作结，赞颂这对恋人的结合。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/poetic) A wedding song or hymn sung in honor of a marriage; also the joyful cry associated with weddings.","zh":"（文学/诗歌）婚礼颂歌（婚歌）；也可指婚礼上的欢呼声。"},"examples":[{"en":"The chorus sang a Hymenaeus as the couple entered the hall.","zh":"新人入场时，合唱团唱起了一首婚礼颂歌（Hymenaeus）。"},{"en":"In older poetry, “Hymenaeus” can simply mean a wedding celebration.","zh":"在较古典的诗歌中，“Hymenaeus”也可直接表示“婚礼庆典”。"}]}],"synonyms":["Hymen","wedding hymn","nuptial song"],"phonetic":"/ˌhaɪməˈniːəs/","extraExplanation":["“Hymenaeus”来自希腊语（常见异体写法：Hymenaios/ Hymen）。在西方文学里，它既可当作婚姻之神的名字，也可借代“婚歌/婚礼的喜庆氛围”，属于偏文学、古典语境用词。","阅读古典作品时，你可能会见到类似呼喊“Sing Hymen!”或“Cry Hymenaeus!”的用法，意思是“唱婚歌/为新人欢呼”，并不是真的在进行宗教仪式。"]}
{"word":"hymenaic","summary":{"en":"A literary word meaning “wedding-related” or, more rarely, “a wedding song.”","zh":"一个文学用词，常指“与婚礼/婚姻有关的”，较少指“婚礼歌/新婚颂歌”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Related to marriage or a wedding; nuptial.","zh":"（文学用语）与婚姻或婚礼有关的；婚礼的；新婚的。"},"examples":[{"en":"They exchanged hymenaic vows beneath the old church arches.","zh":"他们在古老教堂的拱门下交换了婚礼誓言。"},{"en":"The poet describes the springtime as a hymenaic season, full of beginnings.","zh":"诗人把春天写成一个“婚礼般”的季节，充满新的开始。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, literary) A wedding song; an epithalamium.","zh":"（罕见/文学用语）婚礼歌；新婚颂歌（epithalamium）。"},"examples":[{"en":"The chorus sang a hymenaic as the couple entered the hall.","zh":"新人步入大厅时，合唱团唱起了婚礼歌。"}]}],"synonyms":["nuptial","marital","wedding","epithalamium"],"phonetic":"/ˌhaɪməˈniːɪk/","extraExplanation":["“hymenaic”来自希腊神话中的婚姻之神 Hymen（也写作 Hymenaeus）。因此它常带有古典、诗意的色彩，多见于文学或正式文体，而日常英语里更常用 wedding / marital / nuptial。","在诗歌与戏剧里，hymenaic 常用来营造庄重、古典的婚礼氛围；名词义接近“epithalamium（新婚颂歌）”。"]}
{"word":"hymenal","summary":{"en":"Medical adjective meaning “related to the hymen.”","zh":"医学形容词，表示“与处女膜有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hymen (a thin membrane at or near the vaginal opening).","zh":"与处女膜有关的；处女膜的（处女膜是位于或接近阴道口的一层薄膜）。"},"examples":[{"en":"The doctor noted a hymenal tear during the exam.","zh":"医生在检查中记录到处女膜有撕裂。"},{"en":"The report described hymenal tissue changes after childbirth.","zh":"报告描述了分娩后处女膜组织的变化。"}]}],"synonyms":["hymen-related","of the hymen"],"phonetic":"/haɪˈmiːnəl/","extraExplanation":["“hymenal”是医学语境中常见的形容词，来自“hymen（处女膜）”。日常英语里更常直接说“the hymen”或“hymen tissue”，而“hymenal”多用于病历、检查报告、法医学等正式文本。","文化与健康提醒：处女膜的形态差异很大，也可能因运动、使用卫生棉条、性行为或外伤等多种原因发生改变；“处女膜是否完整”不能可靠地证明是否发生过性行为。相关话题在不同文化中很敏感，使用时注意尊重与隐私。"]}
{"word":"hymeneal","summary":{"en":"Hymeneal means “related to marriage or a wedding,” and more rarely “related to the hymen/sexual union.”","zh":"hymeneal 指“与婚姻或婚礼有关的”，较少见时也可指“与处女膜/性交合有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to marriage, a wedding, or the wedding night.","zh":"与婚姻、婚礼或新婚之夜有关的；婚礼的。"},"examples":[{"en":"They returned from their hymeneal trip full of stories and photos.","zh":"他们从蜜月旅行回来，带回了许多故事和照片。"},{"en":"The novel ends with a hymeneal scene set under lanterns and music.","zh":"这部小说以一场在灯笼与音乐中展开的婚礼场景作结。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to the hymen or to sexual union.","zh":"（罕见）与处女膜或性交合有关的。"},"examples":[{"en":"The term can appear in older medical writing, though it is uncommon today.","zh":"这个词有时会出现在较早的医学写作中，但如今很少使用。"},{"en":"In modern contexts, writers usually choose clearer, less archaic wording.","zh":"在现代语境中，写作者通常会选择更清晰、不那么古旧的说法。"}]}],"synonyms":["nuptial","marital","wedding","matrimonial"],"phonetic":"/ˌhaɪməˈniːəl/","extraExplanation":["“hymeneal”源自“Hymen”（希腊神话中的婚姻之神，常与婚礼相联系），因此该词在文学或较正式、古典的语境里更常见。现代英语中更常用的表达是“wedding,” “marital,” “nuptial,” 或“honeymoon (trip)”。","用法提醒：该词带有明显的文雅/古风色彩（archaic/literary）。如果在日常写作或口语中使用，可能显得过于书面或刻意。"]}
{"word":"hymeneally","summary":{"en":"“Hymeneally” means “in a marriage- or wedding-related way,” but it is very rare; “nuptially” is more common.","zh":"“hymeneally”意为“与婚姻/婚礼相关地”，但极少见；更常用的是“nuptially”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that relates to marriage or a wedding; nuptially","zh":"（方式）与婚姻或婚礼有关地；婚礼地（相当于“nuptially”）"},"examples":[{"en":"The poem ends hymeneally, with the couple’s union presented as a new beginning.","zh":"这首诗以“婚姻主题”收尾，把两人的结合写成新的开始。"},{"en":"The novelist uses flowers and music hymeneally to signal that a wedding is near.","zh":"小说家用花与音乐作“婚礼式”的暗示，表明婚期将近。"}]}],"synonyms":["nuptially","matrimonially","weddingly"],"phonetic":"ˌhaɪməˈniəli","extraExplanation":["“hymeneally”非常少见，更常见的是形容词“hymeneal”（/ˌhaɪməˈniəl/，意为“婚礼的、婚姻的”）以及更常用的副词“nuptially”（婚礼地）。","词源来自古希腊神话中的婚姻之神 Hymen（或 Hymenaeus）。在诗歌、文学评论里，这类词常用来营造“婚礼/结合/祝福”的氛围，语体偏正式、带文学色彩。","如果你是在写作或考试中想表达“与婚姻有关地”，通常用“nuptially”会更自然、读者也更容易理解。"]}
{"word":"hymeneals","summary":{"en":"“Hymeneals” means weddings or nuptials, especially in a poetic or formal style.","zh":"“hymeneals”指婚礼／婚庆（多为诗意或正式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wedding or marriage ceremony; nuptials (often used in a poetic or formal style)","zh":"婚礼；婚姻仪式；婚庆（常用于诗歌或较正式的文体）"},"examples":[{"en":"The small town gathered to celebrate the couple’s hymeneals.","zh":"小镇的人们聚在一起庆祝这对新人的婚礼。"},{"en":"In the novel, the heroine’s hymeneals are described with flowers, music, and anxious hope.","zh":"在小说中，女主角的婚礼被描写得充满鲜花、音乐与忐忑的期待。"}]},{"partOfSpeech":"n.","definition":{"en":"wedding songs, poems, or festivities connected with marriage (literary usage)","zh":"婚礼颂歌／婚礼诗；与婚姻相关的庆典活动（文学用法）"},"examples":[{"en":"The poet composed hymeneals to honor the royal marriage.","zh":"诗人为王室婚姻写下婚礼颂歌以示致敬。"}]}],"synonyms":["wedding","nuptials","marriage ceremony","bridal rites"],"phonetic":"/ˌhaɪməˈniəlz/","extraExplanation":["“hymeneals”来自“Hymen”（希腊神话中的婚姻之神），因此这个词带有较强的文学与典雅色彩。日常英语中更常用的说法是“wedding”“marriage ceremony”或“nuptials”。","常见相关词：hymeneal（adj. 婚礼的、婚姻的，较少见），epithalamium（n. 婚礼颂诗，更偏文学/古典）。"]}
{"word":"hymenean","summary":{"en":"Hymenean means “related to marriage or weddings,” originally connected to Hymen in Greek mythology.","zh":"hymenean 意为“与婚姻/婚礼有关的”，源自希腊神话中的婚神 Hymen。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to marriage or a wedding; nuptial.","zh":"与婚姻或婚礼有关的；婚礼的（文雅/少见用法）。"},"examples":[{"en":"They exchanged hymenean vows in a small ceremony by the sea.","zh":"他们在海边一场小型仪式上交换了婚礼誓言。"},{"en":"The poem ends with a hymenean blessing for the couple.","zh":"这首诗以对新人婚姻的祝福作结。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Hymen, the figure in Greek mythology associated with marriage.","zh":"与希腊神话中象征婚姻的“婚神”Hymen有关的。"},"examples":[{"en":"In classical literature, hymenean imagery often signals an upcoming marriage.","zh":"在古典文学中，带有“hymenean”色彩的意象常暗示即将到来的婚姻。"}]}],"synonyms":["nuptial","matrimonial","wedding","hymeneal"],"phonetic":"/haɪˈmiːniən/","extraExplanation":["“hymenean”是较少见、较文学化的词，来自“Hymen”（希腊神话中的婚礼之神/婚神）。因此它常出现在诗歌或正式文体里，用来指“婚礼的、婚姻的”。","更常见的近形词是“hymeneal”（同义），日常英语里通常直接用“wedding”或“nuptial / matrimonial”表达。"]}
{"word":"hymenectomy","summary":{"en":"surgical removal of all or part of the hymen","zh":"通过手术切除部分或全部处女膜"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure to remove all or part of the hymen","zh":"（医疗）处女膜切除术；通过手术切除部分或全部处女膜"},"examples":[{"en":"The doctor explained the risks and recovery time for a hymenectomy.","zh":"医生说明了处女膜切除术的风险与恢复时间。"},{"en":"A hymenectomy may be recommended if the hymen causes pain or blocks menstrual flow.","zh":"如果处女膜引起疼痛或阻碍经血排出，医生可能会建议进行处女膜切除术。"}]}],"synonyms":["hymenal excision","hymen removal"],"phonetic":"/ˌhaɪməˈnɛktəmi/","extraExplanation":["这是医学术语，通常用于描述因解剖结构导致的疼痛、性交困难或经血排出受阻等情况的治疗方案之一。","在不同文化语境里，“处女膜”常被赋予社会或道德含义，但在医疗语境中该词主要指解剖结构；个体差异很大，且并不能作为判断“是否有过性行为”的可靠标准。"],"etymology":"来自 Greek “hymen”（处女膜；也与婚礼/婚姻之神 Hymen 的词源相关）+ “-ectomy”（外科切除术后缀，表示“切除”）。合起来字面义为“切除处女膜的手术”。","mnemonic":["记词缀：-ectomy = “切除术”（如 appendectomy 阑尾切除术）；hymen + ectomy → “处女膜切除”。"]}
{"word":"hymenia","summary":{"en":"Hymenia is the plural form of hymenium, meaning the spore-producing surface layer of many fungi.","zh":"Hymenia 是 hymenium 的复数，指许多真菌的产孢子可育表层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of hymenium: the spore-producing (fertile) surface layer of many fungi, especially on gills, pores, or the inner surface of cup fungi","zh":"hymenium 的复数：许多真菌（尤其是菌褶、菌孔或杯状子实体内部）用于产生孢子的可育表层"},"examples":[{"en":"Under the microscope, the hymenia showed many basidia and developing spores.","zh":"在显微镜下，这些 hymenia 显示出许多担子和正在形成的孢子。"},{"en":"Scientists compared the hymenia of two mushrooms to help identify the species.","zh":"科学家比较了两种蘑菇的 hymenia，以帮助鉴定物种。"}]}],"synonyms":["hymeniums","fertile layer (contextual)"],"phonetic":"/haɪˈmiːniə/","extraExplanation":["“hymenium”来自希腊语词根 hymen-（意为“膜、薄层”），在真菌学里指“产生孢子的薄层”。因此 hymenia 常见于学术文章、实验记录或物种鉴定描述中，日常英语里很少使用。"]}
{"word":"hymenial","summary":{"en":"Hymenial means “connected with marriage or weddings,” often in a formal or literary style.","zh":"hymenial 指“与婚姻或婚礼有关的”，多用于正式或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to marriage or a wedding; connected with a wedding ceremony.","zh":"与婚姻或婚礼有关的；婚礼的。"},"examples":[{"en":"The poet used hymenial imagery to describe the couple’s joy.","zh":"诗人用婚礼意象来描写这对新人的喜悦。"},{"en":"They held a small hymenial celebration with close friends and family.","zh":"他们只邀请亲友举办了一场小型的婚礼庆祝。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Hymen, the figure in Greek mythology associated with marriage.","zh":"与希腊神话中象征婚姻的“婚神”Hymen有关的。"},"examples":[{"en":"The painting includes a hymenial figure holding a torch.","zh":"这幅画里有一位象征婚姻的神祇形象，手持火炬。"}]}],"synonyms":["nuptial","marital","wedding (as an adjective)","matrimonial"],"phonetic":"/haɪˈmiːniəl/","extraExplanation":["“hymenial”较为正式、文学化，日常英语里更常用“wedding”“marital”“nuptial”。例如：nuptial vows（婚礼誓言）。","词源来自“Hymen”（婚神、婚礼之神）。在一些文学或艺术作品中，“hymenial”常用来营造庄重、古典的婚礼氛围。"]}
{"word":"hymenic","summary":{"en":"Hymenic means “related to the hymen,” and it is mostly used in medical writing.","zh":"hymenic 意为“与处女膜有关的”，多见于医学写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the hymen (a thin membrane at or near the vaginal opening); used mainly in medical contexts","zh":"与处女膜有关的；（主要用于医学语境）处女膜的"},"examples":[{"en":"The doctor noted hymenic tissue during the examination.","zh":"医生在检查中记录到了处女膜组织。"},{"en":"Hymenic variations are common and do not by themselves prove sexual activity.","zh":"处女膜的差异很常见，本身并不能证明是否发生过性行为。"}]}],"synonyms":["hymenal"],"phonetic":"/haɪˈmɛnɪk/","extraExplanation":["“hymenic”是医学/解剖学用语，日常英语里更常见的是“hymen”（名词）或“hymenal”（形容词，意思相近）。","在涉及性与身体检查的话题时，英语语境通常更强调医学客观与个人隐私；在公共场合使用该词要注意尊重与避免污名化。"]}
{"word":"hymenicolar","summary":{"en":"Hymenicolar describes organisms (usually fungi) that live on the spore-bearing surface (hymenium) of another fungus or lichen.","zh":"Hymenicolar 指（多为真菌）寄居/生长在另一真菌或地衣的产孢表面（菌褶层/子实层）上的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living on or growing on the hymenium (the spore-bearing surface) of another fungus, especially on mushrooms or lichens.","zh":"（生物/真菌学）生活在或生长在另一种真菌的菌褶层（产孢层、子实层表面）上的；尤指寄居在蘑菇或地衣的产孢表面上。"},"examples":[{"en":"Some tiny fungi are hymenicolar, growing directly on the gills of mushrooms.","zh":"有些微小的真菌是 hymenicolar，会直接长在蘑菇的菌褶上。"},{"en":"The researcher described a hymenicolar species found on a lichen’s spore-bearing surface.","zh":"研究者描述了一种在地衣产孢表面发现的 hymenicolar 物种。"}]}],"synonyms":["hymenicolous"],"phonetic":"/ˌhaɪməˈnɪkələr/","extraExplanation":["“hymenicolar”是非常少见的专业词，常见的对应形式是 **hymenicolous**（意思相同）。在学术文章里你更可能看到 hymenicolous。","词源上可拆为：hymeni-（与 hymenium 产孢层有关）+ -colar / -colous（表示“栖居于……的、居住的”），整体就是“栖居在产孢层上的”。","注意这里的 hymenium 指真菌的产孢表面（如蘑菇的菌褶/管孔表面），不是日常英语里常说的 hymen（处女膜）。"]}
{"word":"hymenicolous","summary":{"en":"living on the spore-bearing surface of a fungus","zh":"栖居在真菌子实层（产孢表面）上的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, especially mycology) Living on or in the hymenium—the spore-bearing surface of a fungus; often used for organisms (especially fungi) that grow on other fungi’s fruiting surfaces.","zh":"（生物学，尤指真菌学）生活在或附着于“子实层”（真菌产生孢子的表面）上的；常指长在其他真菌子实体表面的生物（多为真菌）。"},"examples":[{"en":"Some tiny parasitic fungi are hymenicolous, growing directly on the gills of mushrooms.","zh":"有些微小的寄生真菌是子实层栖的，会直接长在蘑菇的菌褶上。"},{"en":"The survey recorded several hymenicolous species on old bracket fungi.","zh":"调查在老的层孔菌（“树舌”类）上记录到了几种子实层栖物种。"}]}],"synonyms":["hymenium-dwelling","parasitic","epibiotic","inhabiting","dwelling"],"phonetic":"ˌhaɪmɪˈnɪkələs","extraExplanation":["在真菌学里，hymenium 指蘑菇菌褶、孔洞内壁等“产生孢子”的那层组织。hymenicolous 常用来描述“长在别的真菌孢子层表面”的真菌或微生物，因此在生态关系上常带有“寄生/共栖”的意味，但词本身重点是“栖息位置”。"],"etymology":"源自希腊语 hymen（意为“膜”，在真菌学中引申为“子实层/孢子层”）+ -colous（来自拉丁语 colere“居住、栖居”），合起来就是“栖居在子实层上的”。","mnemonic":["拆开记：hymen（子实层/孢子层）+ -colous（栖居的）=“住在子实层上的”。","联想中文：把它当作“孢子层里（或上）住着的（-colous）”。"]}
{"word":"hymeniferous","summary":{"en":"Hymeniferous means “bearing a hymenium,” the spore-producing surface of certain fungi.","zh":"hymeniferous意为“具子实层的”，指真菌上承载并产生孢子的表面层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mycology) Having or bearing a hymenium—the spore-producing surface layer of certain fungi (often on gills, pores, or teeth under the cap).","zh":"（真菌学）具菌褶层/子实层（hymenium）的；带有产生孢子的表面层（常见于菌盖下的菌褶、菌孔或菌齿）。"},"examples":[{"en":"Many mushrooms are hymeniferous, producing spores on gills beneath the cap.","zh":"许多蘑菇都是hymeniferous（具子实层的），在菌盖下的菌褶上产生孢子。"},{"en":"The hymeniferous surface is on the underside, where you can see pores instead of gills.","zh":"具子实层的表面在菌体下侧，你会看到菌孔而不是菌褶。"}]}],"synonyms":["hymenial","spore-bearing (in context)"],"phonetic":"/ˌhaɪməˈnɪfərəs/","extraExplanation":["这个词主要用于真菌学写作，不太会出现在日常英语里。它来自hymenium（子实层/菌褶层）+ -ferous（“携带、产生”的意思，如spore-bearing）。","hymenium指的是子实体上真正“产孢子”的那一层细胞。不同类群的真菌，子实层的位置和形态不同：有的在“菌褶”（gills）上，有的在“菌孔”（pores）里，还有的在“菌齿”（teeth/spines）表面。"]}
{"word":"hymeniophore","summary":{"en":"A mycology term for the spore-bearing surface/structure under a mushroom cap (gills, pores, or teeth).","zh":"真菌学术语：指蘑菇菌盖下产生并释放孢子的表面/结构（如菌褶、菌孔或齿状结构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In fungi (especially mushrooms), the spore-bearing surface or structure—such as gills, pores, or teeth—where spores are produced and released.","zh":"（真菌学，尤指蘑菇）产孢层/子实层结构：指产生并释放孢子的表面或构造，如菌褶（鳃状）、菌孔（管孔状）或齿状结构。"},"examples":[{"en":"Under the cap, the hymeniophore may have gills, pores, or tiny teeth.","zh":"在菌盖下方，产孢层结构可能是菌褶、菌孔或细小的齿状结构。"},{"en":"This species has a porous hymeniophore, so its underside looks like a sponge.","zh":"这种物种的产孢层是管孔状的，所以菌盖底面看起来像海绵。"},{"en":"Researchers compared hymeniophore shapes to help identify closely related mushrooms.","zh":"研究人员比较产孢层的形态，以帮助鉴别近缘蘑菇。"}]}],"synonyms":["spore-bearing surface","hymenium (related, not identical)"],"phonetic":"/ˌhaɪˈmiːniəˌfɔr/","extraExplanation":["词源小提示：hymenio- 来自希腊语 hymen（“膜、薄层”），-phore 来自 phoros（“携带、承载”）。合起来就是“承载产孢薄层的结构”。","在野外识别蘑菇时，观察“菌盖下面”很关键：同样都是蘑菇，下面可能是“菌褶（gills）”“管孔（pores）”“齿（teeth）”，这些都属于 hymeniophore 的不同类型。","容易混淆的词：hymenium（子实层/产孢层组织本身）指的是产生孢子的那层细胞组织；hymeniophore 更强调承载并呈现这层组织的“表面形态或结构”。"]}
{"word":"hymenium","summary":{"en":"The hymenium is the spore-producing tissue layer on the surface of many fungi.","zh":"hymenium 指许多真菌表面用于产生孢子的组织层（子实层）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In fungi (especially mushrooms), the spore-bearing tissue layer that covers surfaces like gills, pores, or teeth, where spores are produced (often via basidia or asci).","zh":"（真菌学）子实层：在真菌（尤其蘑菇）中覆盖在菌褶、菌孔或菌齿等表面的产孢组织层，孢子通常在此形成（如由担子或子囊产生）。"},"examples":[{"en":"Under a microscope, the hymenium is the layer where you can see basidia producing spores.","zh":"在显微镜下，子实层是你能看到担子产生孢子的那一层。"},{"en":"On a gilled mushroom, the hymenium lines the surface of the gills.","zh":"在有菌褶的蘑菇上，子实层分布在菌褶表面。"},{"en":"Some field guides describe the hymenium as smooth, wrinkled, or porous to help identify species.","zh":"一些野外图鉴会描述子实层是光滑、起皱或多孔的，以帮助鉴定物种。"}]}],"synonyms":["spore-bearing layer","fertile layer","hymenial layer"],"phonetic":"/haɪˈmiːniəm/","extraExplanation":["词源来自希腊语 hymēn（意为“膜、薄层”）+ -ium（名词后缀），强调它是一层“覆盖性的组织”。","在真菌分类与鉴定中，子实层的形态（如是否有菌褶/菌孔/菌齿、表面是否光滑）非常关键；它属于真菌“结实（产孢）结构”的一部分。","相关术语：hymenial（形容词，子实层的）；hymenophore（子实托/产孢体表面结构，指承载子实层的那部分，如菌褶或菌孔本身）。"]}
{"word":"hymenium-like","summary":{"en":"having the appearance or structure of a fungal spore-bearing surface layer","zh":"外观或结构类似真菌的产孢表面层"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hymenium (the spore-bearing surface layer in many fungi, such as the gills or pores where spores are produced).","zh":"类似菌被层的；像“菌被层（hymenium）”那样的（指许多真菌中产生孢子的表面层，如菌褶或菌孔表面）。"},"examples":[{"en":"Under the microscope, the inner surface shows a hymenium-like layer packed with spore-producing cells.","zh":"在显微镜下，内表面可见一层类似菌被层的结构，布满产生孢子的细胞。"},{"en":"The researcher described a hymenium-like tissue on the fruiting body’s underside.","zh":"研究者描述子实体下表面有一段类似菌被层的组织。"}]}],"synonyms":["hymenial","hymenioid","hymeniform"],"phonetic":"/haɪˈmiːniəm laɪk/","extraExplanation":["hymenium 指“真菌产生孢子的那一层表面组织”，常见位置包括蘑菇的菌褶（gills）、牛肝菌的菌孔（pores）等。hymenium-like 常用于论文或鉴定描述，强调“形态/组织结构像菌被层”，不一定表示它真正就是菌被层。"],"etymology":"源自 mycology（真菌学）术语 hymenium（菌被层），来自希腊语 hymen（意为“膜”），加上 -like（“像……一样的”）构成形容词，表示“具有菌被层样特征”。","mnemonic":["把 hymenium 记成“hymen(膜)+-ium(结构/组织)”→“一层膜状组织”；再加 -like 就是“像那层膜一样”。","联想：孢子像“粉”撒在蘑菇下面那层表面——那层表面就是 hymenium；hymenium-like = “像孢子表面那层”。"]}
{"word":"hymeniumnia","summary":{"en":"“Hymeniumnia” is not a standard English word; it most likely refers to “hymenium,” the spore-producing surface of a fungus.","zh":"“hymeniumnia”不是标准英语词；它很可能指“hymenium（子实层）”，即真菌产生孢子的表面层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A likely misspelling of hymenium: the spore-producing surface layer in many fungi (such as gills under a mushroom cap, pores in boletes, or the smooth surface in some fungi).","zh":"很可能是 hymenium 的拼写错误：许多真菌（如蘑菇的菌褶、牛肝菌的菌孔，或某些真菌的光滑表面）中产生孢子的表层。"},"examples":[{"en":"Under the cap, the gills form the hymenium where spores are made.","zh":"在菌盖下面，菌褶形成 hymenium（子实层），孢子就在这里产生。"},{"en":"The mycologist examined the hymenium under a microscope to identify the species.","zh":"真菌学家在显微镜下观察 hymenium（子实层）来鉴定物种。"}]}],"synonyms":["hymenial layer","spore-bearing surface"],"phonetic":"/haɪˈmiːniəm/","extraExplanation":["“hymenium”是生物学/真菌学术语，日常英语中很少用到。它指的是“产生孢子的那一层组织”，位置会因真菌类型不同而不同（菌褶、菌孔、子囊盘表面等）。","如果你想查的其实是其他词（例如拼写类似的专有名词或药名），可以告诉我它出现的句子或领域（生物/医学/地名等），我可以帮你精确匹配。"]}
{"word":"hymeniums","summary":{"en":"Hymeniums are the spore-producing surface layers of fungi.","zh":"hymeniums 指真菌产生孢子的表面层（子实层）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the spore-producing surface layer of a fungus (for example, the gills under a mushroom cap); “hymeniums” is the plural of “hymenium.”","zh":"（真菌的）子实层、菌褶层：产生孢子的表面层（例如蘑菇菌盖下的菌褶）；hymeniums 为 hymenium 的复数。"},"examples":[{"en":"The mushroom’s hymenium is on the gills under the cap.","zh":"这种蘑菇的子实层位于菌盖下方的菌褶上。"},{"en":"Scientists compared the hymeniums of different fungi to identify the species.","zh":"科学家比较不同真菌的子实层来鉴定物种。"}]}],"synonyms":["spore-bearing layer","fertile surface (fungi)"],"phonetic":"/haɪˈmiːniəmz/","extraExplanation":["hymenium 常见于真菌学（mycology）语境，指会形成并释放孢子的那一层组织。不同真菌的子实层位置不一样：有的在菌褶（gills）上，有的在菌孔（pores）内壁，有的在“刺状”（teeth）结构表面，这些特征常用于分类与辨识。","词源来自希腊语 hymen（意为“膜”），因为这层结构常像一层薄膜覆盖在表面。"]}
{"word":"hymeno","summary":{"en":"hymen/o is a medical word part meaning “hymen,” used to form clinical terms.","zh":"hymen/o 是表示“处女膜”的医学构词成分，用于构成临床术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a medical combining form meaning “hymen” (the thin membrane at the opening of the vagina), used in clinical terms","zh":"医学构词成分，表示“处女膜”，用于医学/临床术语中"},"examples":[{"en":"The term “hymenoplasty” contains the combining form “hymen/o.”","zh":"“hymenoplasty（处女膜修复术）”这个词包含构词成分“hymen/o”。"},{"en":"In medical vocabulary, “hymen/o” refers to the hymen, not to “hymn” (a religious song).","zh":"在医学词汇中，“hymen/o”指处女膜，不是“hymn（圣歌）”。"}]}],"synonyms":["hymen-","hymeno- (variant form)"],"phonetic":"/haɪˈmiːnoʊ/","extraExplanation":["“hymen/o”通常出现在医学术语里（更常见的变体是“hymen-”或“hymeno-”）。它来自希腊语“hymēn”，意为“膜”。","与处女膜相关的话题在不同文化中可能比较敏感；医学上强调的是解剖结构与健康信息，而不是对个人价值的评判。"]}
{"word":"hymenocallis","summary":{"en":"Hymenocallis is a genus of fragrant flowering plants commonly called spider lilies.","zh":"Hymenocallis 指文殊兰属植物，常见俗名为蜘蛛百合/蜘蛛兰，花形细长、常带香味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants (in the amaryllis family) often called “spider lilies,” known for their long, narrow petals that look like spider legs and their fragrant white flowers","zh":"文殊兰属（石蒜科）的一类开花植物，常被称为“蜘蛛百合/蜘蛛兰”，以细长如蜘蛛腿般的花瓣和常见的白色芳香花著称"},"examples":[{"en":"Hymenocallis blooms best in bright sun and warm weather.","zh":"文殊兰在充足阳光和温暖天气下开花最好。"},{"en":"The garden bed was lined with Hymenocallis, adding a clean white fragrance at night.","zh":"花坛边种了一排文殊兰，夜里散发出清清的白色花香。"}]}],"synonyms":["spider lily","beach spider lily"],"phonetic":"/ˌhaɪmənoʊˈkælɪs/","extraExplanation":["“Hymenocallis”来自希腊语词根：hymen-（意为“薄膜/膜”）+ kallos（意为“美”），可理解为“膜之美/美丽的薄膜”，常被用来形容其花部结构的精致。","常见俗名是“spider lily（蜘蛛百合）”。不过它并非真正的百合科（Liliaceae），而是石蒜科（Amaryllidaceae）；园艺中“百合”一词有时会被更宽泛地使用。"]}
{"word":"Hymenochaete","summary":{"en":"a genus of wood-growing crust fungi","zh":"一种木生壳状真菌属"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of crust-like fungi that grow on wood and often form thin, leathery patches on bark or dead logs","zh":"一种生长在木材上的壳状真菌属，常在树皮或枯木表面形成薄而韧的贴附菌层"},"examples":[{"en":"Researchers identified the orange-brown crust on the fallen branch as Hymenochaete.","zh":"研究人员把倒下树枝上橘褐色的壳状菌层鉴定为Hymenochaete。"},{"en":"Some Hymenochaete species help break down dead wood in forests.","zh":"一些Hymenochaete物种能帮助分解森林中的枯木。"}]}],"phonetic":"/ˌhaɪmiːnoʊˈkiːti/","extraExplanation":["这是生物分类学里的拉丁化属名，写作首字母大写（Hymenochaete），在科学写作中常用斜体。","该属多为木材腐生菌（有的也可为弱寄生），在生态系统中参与木质纤维分解；具体形态与危害因物种而异。"],"etymology":"词源来自希腊语：hymen- 表示“膜/薄层”，chaite 表示“毛/鬃毛”。名称暗示其菌层表面常见“毛状”结构。","mnemonic":["hymen≈“薄膜”，chaete≈“刚毛/鬃毛”：联想“带毛的薄膜状菌层”，更容易记住它是壳状木生真菌。"]}
{"word":"hymenochaete","summary":{"en":"Hymenochaete is a scientific genus name for certain wood-decay fungi that often appear as a tough crust on bark or dead wood.","zh":"Hymenochaete 是一个真菌属的学名，指一类常在树皮或枯木上形成坚韧壳状菌体的木腐真菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tough, crust-like wood-decay fungi that grow on tree bark or dead wood (a group within the order Hymenochaetales).","zh":"一种生长在树皮或枯木上的木腐真菌属（多呈坚韧的“壳状/贴生”菌体，隶属火层菌目 Hymenochaetales 相关类群）。"},"examples":[{"en":"The log was covered with Hymenochaete, forming a thin, brown crust.","zh":"那段枯木上长满了 Hymenochaete，形成一层薄薄的褐色菌壳。"},{"en":"Some Hymenochaete species help decompose dead wood in forests.","zh":"一些 Hymenochaete 的物种能帮助森林分解枯木。"}]}],"synonyms":["Hymenochaete (genus name)"],"phonetic":"/ˌhaɪmənoʊˈkiːti/","extraExplanation":["该词多见于生物学/真菌学语境，日常英语不常用；写作时通常首字母大写并用斜体：Hymenochaete（属名）。","词源可拆解理解：hymen- 表示“膜/菌膜（hymenium，担子菌的产孢子层）”，-chaete 源自希腊语，常与“毛、刺、刚毛”之意相关，用来描述该类群某些显微结构特征。"]}
{"word":"hymenogaster","summary":{"en":"Hymenogaster is a scientific genus name for underground, truffle-like fungi.","zh":"Hymenogaster是一个真菌属的学名，指地下生的“松露状”真菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of underground (truffle-like) fungi that form round, enclosed fruiting bodies and are often found in soil near tree roots","zh":"（真菌）地下生的“松露状”真菌属；其子实体多为球形或块状、封闭不张开，常生长在树根附近的土壤中"},"examples":[{"en":"Researchers found Hymenogaster species in the soil under oak and pine trees.","zh":"研究人员在橡树和松树下的土壤中发现了Hymenogaster属的物种。"},{"en":"Because Hymenogaster grows underground, it is easy to miss unless animals or digging expose it.","zh":"由于Hymenogaster在地下生长，除非被动物翻出或挖掘到，否则很容易被忽略。"}]}],"synonyms":["truffle-like fungus (general)","hypogeous fungus (general)"],"phonetic":"/ˌhaɪməˈnɑːɡæstɚ/","extraExplanation":["“Hymenogaster”是学名（拉丁化的属名），常用于生物学/真菌学语境，而不是日常英语。","词源上可分解为：hymeno-（与“膜、菌褶层/子实层”有关）+ -gaster（“胃、腹部”之意），大致传达“内部封闭的孢子产出结构”的形态特征。","这类地下真菌常与树木形成共生关系（如外生菌根），在生态系统中帮助植物吸收水分与矿物质。","拼写提示：Hymenogaster 的 gaster 不是 “-caster”。"]}
{"word":"hymenogastraceae","summary":{"en":"Hymenogastraceae is a scientific name for a family of fungi, often including underground or truffle-like species.","zh":"Hymenogastraceae 是真菌的一个“科”级分类名称，常包含地下或块菌状的种类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of fungi (mushrooms and truffle-like fungi) in the order Agaricales, including genera such as Hymenogaster; many species grow underground or partly underground.","zh":"【真菌】一科真菌（蘑菇类与块菌状真菌），隶属伞菌目（Agaricales），包括如 Hymenogaster 等属；许多种类在地下或半地下生长。"},"examples":[{"en":"Hymenogastraceae includes several truffle-like fungi found in forest soils.","zh":"Hymenogastraceae（膜孢腹菌科）包含多种块菌状真菌，常见于森林土壤中。"},{"en":"The researcher compared DNA sequences to confirm the specimen belongs to Hymenogastraceae.","zh":"研究人员通过比较 DNA 序列来确认该标本属于 Hymenogastraceae。"}]}],"synonyms":["the Hymenogastraceae family"],"phonetic":"/ˌhaɪmənoʊɡæˈstreɪsiˌi/","extraExplanation":["这是一个生物分类学名称：科名通常以 -aceae 结尾（如 Rosaceae 蔷薇科）。在正式写作中常用首字母大写（Hymenogastraceae）。","词源上可拆解理解：hymeno- 与“菌膜/子实层（hymenium）”相关，-gaster 与“腹/胃”相关，整体指向某类具有特定形态特征的真菌类群。","该类群的现代界定主要依赖分子系统学（DNA 证据）；不同资料中其范围与归属可能因分类学更新而略有变化。"]}
{"word":"hymenogenesis","summary":{"en":"a Hymenoptera-type reproductive system where unfertilized eggs produce males","zh":"膜翅目常见的生殖方式：未受精卵产生雄性"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A reproductive system common in Hymenoptera (bees, ants, wasps) where unfertilized eggs develop into males and fertilized eggs develop into females (a form of parthenogenesis linked to haplodiploidy).","zh":"一种常见于膜翅目（如蜜蜂、蚂蚁、黄蜂）的生殖方式：未受精的卵发育成雄性，受精卵发育成雌性（与单倍—双倍体机制相关的孤雌生殖形式）。"},"examples":[{"en":"In honeybees, hymenogenesis allows queens to produce male drones from unfertilized eggs.","zh":"在蜜蜂中，膜翅目式生殖使蜂王能用未受精卵产下雄蜂。"},{"en":"Researchers study hymenogenesis to understand sex determination in ants and wasps.","zh":"研究人员研究膜翅目式生殖，以理解蚂蚁和黄蜂的性别决定机制。"}]}],"synonyms":["arrhenotoky","haplodiploidy","parthenogenesis"],"phonetic":"/ˌhaɪmənoʊˈdʒɛnəsɪs/","extraExplanation":["常见对比：parthenogenesis（孤雌生殖）是更广义的术语；hymenogenesis通常专指膜翅目中“未受精卵→雄性、受精卵→雌性”的模式（常与haplodiploidy单倍—双倍体系统一起出现）。","这套机制有助于解释为什么蜜蜂、蚂蚁等社会性昆虫能通过控制受精与否来调节群体性别比例。"],"etymology":"源自希腊语构词：hymen-（与“膜翅目 Hymenoptera”相关，原义有“膜”之意）+ -genesis（“产生、起源、生成”）。整体字面义为“膜翅目（昆虫）的生成/繁殖方式”。","mnemonic":["把词拆开记：hymeno-≈Hymenoptera（膜翅目）+ genesis（生成）→“膜翅目昆虫的生成/繁殖方式”。","联想“genesis=创世/起源（常见于Genesis）”，所以是“某种起源/产生方式”。"]}
{"word":"hymenogeny","summary":{"en":"Hymenogeny is a rare mycology term meaning the development of a fungus’s spore-bearing surface (the hymenium).","zh":"hymenogeny 是真菌学中的罕见术语，指真菌产孢子表面组织（子实层）的形成或发育。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation or development of a hymenium (the spore-bearing surface) in fungi.","zh":"（真菌学）子实层（hymenium，产孢子的表面组织）的形成或发育。"},"examples":[{"en":"In many mushrooms, hymenogeny occurs on the gills, where spores are produced.","zh":"在许多蘑菇中，子实层的形成发生在菌褶上，孢子就在这里产生。"},{"en":"The paper describes how temperature can affect hymenogeny during fruiting-body development.","zh":"这篇论文描述了温度如何在子实体发育过程中影响子实层的形成。"}]}],"synonyms":["hymenogenesis","development of the hymenium","formation of the hymenium"],"phonetic":"ˌhaɪməˈnɑdʒəni","extraExplanation":["词源：hymen- 来自希腊语 hymēn（“膜、薄层”），-geny 表示“产生、形成”。在真菌学里，hymenium 指产孢子的“薄层/表面组织”，因此 hymenogeny 就是“子实层的形成”。","使用提示：这个词非常少见，多见于学术性的真菌学/植物学文献；更常见的写法是 hymenogenesis 或直接说 development/formation of the hymenium。"]}
{"word":"hymenoid","summary":{"en":"Hymenoid means “having a hymenium-like, spore-producing surface,” used mainly in mycology.","zh":"hymenoid 指“具有类似子实层（产孢表面）的结构”，主要用于真菌学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or relating to the mushroom genus *Hymenium* or to a hymenium (the spore-producing surface in many fungi).","zh":"拟褶层的；与（某些真菌的）褶层/子实层（产生孢子的表面）相关的或类似的。"},"examples":[{"en":"Under the microscope, the specimen shows a hymenoid layer where spores are produced.","zh":"在显微镜下，这个标本显示出一层拟褶层结构，即产生孢子的层。"},{"en":"The report describes hymenoid features consistent with a basidiomycete fungus.","zh":"报告描述了与担子菌相符的拟褶层特征。"}]}],"synonyms":["hymenial","hymenium-like"],"phonetic":"/ˌhaɪməˈnɔɪd/","extraExplanation":["这是一个较少见的生物学/真菌学术语，多用于学术论文、鉴定报告或显微观察描述中。","词源上来自希腊语 *hymen*（“膜、薄层”）与表示“……样的”的后缀 *-oid*（“类似”）；因此核心含义是“像一层膜/褶层那样的”。"]}
{"word":"hymenolepis","summary":{"en":"Hymenolepis is a genus of tapeworms; some species infect humans and can cause intestinal disease.","zh":"Hymenolepis 指膜样绦虫属；其中一些种类可感染人类并引起肠道疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tapeworms (small parasitic flatworms) that can infect humans and other animals, especially rodents; some species can cause intestinal infection (hymenolepiasis).","zh":"膜样绦虫属：一种绦虫（寄生扁形虫）的属名，可感染人类及其他动物（尤其是啮齿类）；其中某些种可引起肠道感染（膜样绦虫病）。"},"examples":[{"en":"Hymenolepis nana is one of the most common tapeworm infections in humans worldwide.","zh":"微小膜样绦虫（Hymenolepis nana）是全球人群中较常见的绦虫感染之一。"},{"en":"The doctor ordered a stool test to check for Hymenolepis eggs.","zh":"医生开了粪便检查来检测是否有膜样绦虫虫卵。"}]}],"synonyms":["tapeworm (general term)","cestode (scientific term)"],"phonetic":"/ˌhaɪməˈnoʊləpɪs/","extraExplanation":["词源提示：Hymenolepis 来自希腊语词根，hymen- 有“膜”的含义，-lepis 有“鳞片/鳞片状覆盖物”的含义，合起来可理解为“具有膜状结构的（虫体）”。","学习提示：这是医学/寄生虫学的专有名词，日常英语中不常见。常见搭配包括 Hymenolepis nana（微小膜样绦虫）、Hymenolepis diminuta（缩小膜样绦虫）、Hymenolepis infection（膜样绦虫感染）、tapeworm（绦虫）。","文化与语境：在公共卫生或医学写作里通常用拉丁学名斜体书写（如 *Hymenolepis*），口语交流中医生可能更常说 “tapeworm” 或 “dwarf tapeworm”。"]}
{"word":"hymenomycetal","summary":{"en":"Hymenomycetal means “related to the traditional group Hymenomycetes,” especially fungi that produce spores on an exposed spore-bearing surface.","zh":"hymenomycetal 指“与传统分类的膜菌类（Hymenomycetes）相关的”，尤指在外露子实层上产孢的真菌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Hymenomycetes (a traditional group of fungi that includes many mushrooms, toadstools, bracket fungi, and puffballs), especially those that produce spores on an exposed surface (the hymenium).","zh":"与“膜菌类”（Hymenomycetes，传统分类中的一类真菌）有关的；尤指在外露的产孢层（hymenium，子实层）上产生孢子的真菌。"},"examples":[{"en":"The paper describes several hymenomycetal species found on decaying logs.","zh":"这篇论文描述了几种生长在腐朽原木上的膜菌类（hymenomycetal）物种。"},{"en":"Hymenomycetal fungi often form visible fruiting bodies, such as mushrooms.","zh":"膜菌类真菌常常形成肉眼可见的子实体，例如蘑菇。"}]}],"synonyms":["hymenomycetous","basidiomycetous (broader)"],"phonetic":"/ˌhaɪmənoʊmaɪˈsiːtəl/","extraExplanation":["“hymenomycetal”属于学术/生物分类用语，日常英语中很少使用；在现代真菌分类里，“Hymenomycetes（膜菌纲）”多被视为较旧的传统分组，相关物种现在通常归入担子菌门（Basidiomycota）下更细的类群。","词形上：hymen-（子实层/膜）+ mycet-（真菌）+ -al（形容词后缀），字面意思就是“与子实层真菌相关的”。"]}
{"word":"hymenomycete","summary":{"en":"A hymenomycete is a fungus that makes spores on an exposed fertile surface (hymenium), common in many mushrooms.","zh":"hymenomycete 指在外露的菌褶层（子实层）上产生孢子的真菌，许多蘑菇属于这一类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fungus that produces spores on an exposed fertile surface (the hymenium), such as many mushrooms and bracket fungi","zh":"一种真菌：在外露的可育表面（称为菌褶层/子实层 hymenium）上产生孢子，例如许多蘑菇与木层孔菌（层架菌）等"},"examples":[{"en":"Many common mushrooms are hymenomycetes because their spores form on exposed gills or pores.","zh":"许多常见蘑菇属于 hymenomycete，因为它们的孢子在外露的菌褶或菌孔表面形成。"},{"en":"In the lab, we identified the specimen as a hymenomycete by examining its spore-bearing surface.","zh":"在实验室里，我们通过观察其产孢表面来判定该标本为 hymenomycete。"}]}],"synonyms":["basidiomycete (related)","mushroom-forming fungus (general)"],"phonetic":"/ˌhaɪmɪnoʊˈmaɪsiːt/","extraExplanation":["词源提示：hymeno- 来自希腊语，意为“膜/覆盖层”，在真菌学中指“菌褶层（hymenium，产孢的那一层）”；-mycete 表示“真菌”。合起来强调“孢子产生在外露的菌褶层上”。","使用语境：hymenomycete 多见于真菌学或生物学文献与课堂，日常英语里更常直接说 mushroom（蘑菇）或具体的分类名。","分类说明（简化）：传统上 hymenomycetes 常指担子菌类中“子实层外露”的一群；现代分类更常用 Basidiomycota（担子菌门）及其下的具体类群来表述。"]}
{"word":"hymenomycete-like","summary":{"en":"resembling fungi with an exposed spore-bearing surface (like gills or pores)","zh":"形态上类似具有外露子实层（如菌褶、菌孔）的真菌"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hymenomycete (a fungus that produces spores on an exposed spore-bearing surface, such as gills or pores; especially many familiar “mushroom-forming” fungi).","zh":"类似“子实层真菌/担子菌类（旧称 hymenomycete）”的；指外形或结构像在外露的子实层（如菌褶、菌孔）上产生孢子的那类真菌。"},"examples":[{"en":"Under the microscope, the specimen showed a hymenomycete-like spore-bearing surface.","zh":"在显微镜下，这个标本呈现出类似子实层真菌的产孢表面。"},{"en":"The field notes describe a hymenomycete-like fruiting body with gills.","zh":"野外记录描述其子实体类似子实层真菌，并具有菌褶结构。"}]}],"synonyms":["agaric-like","basidiomycete-like","mushroom-like"],"phonetic":"/ˌhaɪmənoʊˈmaɪsiːtˌlaɪk/","extraExplanation":["在传统真菌学里，“hymenomycetes”常用来指那些把孢子产生在外露子实层（hymenium）的真菌，如伞菌（有菌褶）、多孔菌（有菌孔）等。现代分类更多用“Basidiomycota（担子菌门）”及更细分的类群，但在形态描述或旧文献中仍可能见到 hymenomycete 及其派生形容词。","“-like”在学术写作里常表示“形态/特征相似”，不一定表示亲缘关系相同。"],"etymology":"由 hymeno-（源自希腊语，意为“膜、薄层”，在真菌学里指“子实层”）+ mycete（源自希腊语 mykēs“蘑菇/真菌”）+ -like（“像……一样的”）构成；hymenomycete 是较旧的分类用语，现代多归入担子菌相关类群来描述。","mnemonic":["拆开记：hymen（子实层那层“膜”）+ mycete（真菌）+ like（像）＝“像有子实层的真菌”。","联想中文：看到“菌褶/菌孔”这些外露的产孢面，就想到 hymenomycete-like。"]}
{"word":"hymenomycetes","summary":{"en":"Hymenomycetes is an older scientific term for fungi that bear spores on a hymenium (spore-producing layer), including many mushrooms and related forms.","zh":"Hymenomycetes 是一个较旧的科学术语，指在子实层（产孢层）上产生孢子的真菌类群，包含许多蘑菇及其近缘类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific group of fungi that produce their spores on a “hymenium” (a spore-bearing layer), including many mushrooms, brackets, and related fungi","zh":"（旧分类）担子菌类的一群真菌：其孢子产生在“子实层/子实组织”（hymenium，产孢层）上，包括许多蘑菇、层孔菌（木层孔/灵芝类外形的菌）及其近缘类群"},"examples":[{"en":"Many common mushrooms were once classified as Hymenomycetes in older textbooks.","zh":"在较老的教材里，许多常见的蘑菇曾被归为 Hymenomycetes（担子菌类的一部分旧类群）。"},{"en":"The lab manual mentions Hymenomycetes, but modern taxonomy uses different groupings.","zh":"实验手册提到 Hymenomycetes，但现代分类学已经使用不同的分组方式。"}]}],"synonyms":["basidiomycetes (broadly, in older usage)","agaricomycetes (modern, narrower context)"],"phonetic":"/ˌhaɪmɛnoʊmaɪˈsiːtiːz/","extraExplanation":["这是一个“旧的分类名”（historical taxonomic term）。过去常用来大致指一类以子实层（hymenium）产孢子的担子菌，但随着分子系统学发展，很多旧类群被重新划分，因此在新文献里更常见到 Basidiomycota（担子菌门）、Agaricomycetes（伞菌纲）等更现代的分类单位。","词源提示：hymeno- 来自希腊语，指“膜/薄层”（与子实层的“层”有关），-mycetes 表示“真菌”。","使用场景：该词多见于真菌学、植物病理学或老式分类系统的语境中；写作或考试如需“现代”表达，可查具体菌类在现行系统中的门/纲/目归属。"]}
{"word":"hymenomycetoid","summary":{"en":"An adjective meaning “Hymenomycetes-like,” used in mycology for fungi with a typical spore-bearing surface (like gills or pores).","zh":"形容词，表示“担子菌类群样”，真菌学中用于描述具有典型产孢表面（如菌褶或菌孔）的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, mycology) Resembling or related to Hymenomycetes (a large group of fungi that typically produce spores on a visible spore-bearing surface, such as gills or pores).","zh":"（生物/真菌学）类似于或与“担子菌类群（Hymenomycetes）”有关的；通常指具有明显的产孢表面（如菌褶或菌孔）的真菌特征。"},"examples":[{"en":"The specimen shows hymenomycetoid features, including a well-developed gill surface.","zh":"该标本呈现担子菌类群样特征，包括发育良好的菌褶表面。"},{"en":"Under the microscope, the hyphal arrangement looks hymenomycetoid rather than yeast-like.","zh":"在显微镜下，菌丝排列看起来更像担子菌类群样，而不是酵母样。"}]}],"synonyms":["hymenomycetous","hymenomycete-like"],"phonetic":"/ˌhaɪmənoʊmaɪˈsiːtɔɪd/","extraExplanation":["这是一个较少见的学术用词，常见于真菌分类与形态描述中。“-oid”表示“类似……的”，所以 hymenomycetoid 字面意思是“像 Hymenomycetes（传统分类中的一大类担子菌）那样的”。","现代分类学中，“Hymenomycetes”这一名称在不同体系里可能不再作为正式等级使用，但相关形态概念仍会在论文或描述中出现（例如强调有菌褶/菌孔等可见的产孢层 hymenium）。"]}
{"word":"hymenomycetous","summary":{"en":"An adjective for fungi that form spores on an exposed hymenium (often on gills or pores).","zh":"形容真菌在外露的子实层（如菌褶或菌孔）上形成孢子的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a group of fungi (traditionally called Hymenomycetes) that produce spores on an exposed fertile surface (a hymenium), often on gills, pores, or spines under a mushroom cap.","zh":"（真菌学）与“膜菌类”（传统上称 Hymenomycetes）有关的；指其孢子在外露的可育层（子实层/菌褶层，hymenium）上形成，常见于蘑菇伞下的菌褶、菌孔或菌刺等结构。"},"examples":[{"en":"Many familiar mushrooms are hymenomycetous, with spores produced on gills beneath the cap.","zh":"许多常见的蘑菇都属于膜菌类特征的（hymenomycetous），孢子在菌盖下的菌褶上产生。"},{"en":"The field guide describes the species as a hymenomycetous fungus with pores rather than gills.","zh":"这本野外图鉴把该物种描述为膜菌类特征的真菌，下面是菌孔而不是菌褶。"}]}],"synonyms":["hymenial (related, but broader)","basidiomycetous (related in many contexts)"],"phonetic":"/ˌhaɪmənoʊmaɪˈsiːtəs/","extraExplanation":["“hymen-”来自希腊语，意为“膜”，在真菌学里指子实层（hymenium）这层产生孢子的组织；“-mycetous”与“真菌”有关。","“Hymenomycetes（膜菌纲）”是较旧的分类用语；现代分类多用担子菌门（Basidiomycota）及其下的不同类群来描述。你仍可能在较老的书籍、论文或野外鉴定资料中看到 hymenomycetous 这个形容词。"]}
{"word":"hymenophore","summary":{"en":"A hymenophore is the spore-producing surface of a mushroom, such as gills or pores.","zh":"hymenophore 指蘑菇等真菌的產孢表面/構造，如菌褶或菌孔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In fungi (especially mushrooms), the spore-bearing surface or structure—such as gills, pores, or teeth—where spores are produced.","zh":"（真菌，尤指蘑菇）產生並釋放孢子的表面或構造，例如菌褶（gills）、菌孔（pores）或齒狀構造（teeth）。"},"examples":[{"en":"The mushroom’s hymenophore has gills under the cap.","zh":"這種蘑菇的菌蓋下面有菌褶狀的子實層托（hymenophore）。"},{"en":"Boletes have a pore-like hymenophore instead of gills.","zh":"牛肝菌類的子實層托是孔狀的，而不是菌褶狀的。"},{"en":"When identifying fungi, people often check the hymenophore type first.","zh":"鑑定真菌時，人們常先看子實層托的類型。"}]}],"synonyms":["spore-bearing surface","fertile surface","spore-producing surface"],"phonetic":"/haɪˈmɛnəˌfɔr/","extraExplanation":["詞源小提示：hymenophore 來自希臘語詞根 hymen-（膜、薄層）與 -phore（承載、攜帶）。它指的是「承載產孢組織的部位」。常見的 hymenophore 形態包括：gills（菌褶）、pores（菌孔）、teeth/spines（齒/刺狀），對野外辨識菇類很重要。"]}
{"word":"hymenophorum","summary":{"en":"A mycology term for the spore-bearing structure of a fungus (gills/pores/teeth) that carries the hymenium.","zh":"真菌学术语：指承载子实层、产生孢子的结构（如菌褶/菌孔/菌齿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mycology) The part of a mushroom or other fungus that bears the hymenium—the spore-producing surface (for example, gills, pores, or teeth).","zh":"（真菌学）菌褶体；指承载子实层（产生孢子的表面）的结构部分，例如菌褶、菌孔或菌齿。"},"examples":[{"en":"In many mushrooms, the gills form the hymenophorum.","zh":"在许多蘑菇中，菌褶构成菌褶体。"},{"en":"The hymenophorum can be made of pores instead of gills, as in boletes.","zh":"菌褶体也可能由菌孔而不是菌褶组成，例如牛肝菌类。"},{"en":"Researchers recorded the shape and color of the hymenophorum to help identify the species.","zh":"研究人员记录了菌褶体的形状和颜色，以帮助鉴定物种。"}]}],"synonyms":["spore-bearing surface","hymenial surface"],"phonetic":"/ˌhaɪməˈnɑːfərəm/","extraExplanation":["词源来自希腊语：hymen-（膜；也用于“子实层 hymenium”）+ -phor-（携带、承载）+ -um（名词词尾），字面意思是“承载子实层的结构”。","在野外辨认蘑菇时，hymenophorum 通常指“伞下面那一面”的结构类型：菌褶（gills）、菌孔（pores）、菌齿（teeth）等；这些结构的形态是分类与鉴定的重要特征。"]}
{"word":"hymenophyllaceae","summary":{"en":"Hymenophyllaceae is the filmy fern family—a group of very thin-leaved, moisture-loving ferns.","zh":"Hymenophyllaceae 指膜蕨科（filmy fern family），是一类叶片极薄、喜湿的蕨类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family of mostly delicate, moisture-loving ferns commonly called filmy ferns, often found in humid forests and near streams","zh":"（植物）膜蕨科：一类多为薄而透明、喜湿环境的蕨类植物，常见于潮湿森林与溪流附近（英文常称 filmy ferns）"},"examples":[{"en":"Many Hymenophyllaceae grow best in constantly humid, shaded habitats.","zh":"许多膜蕨科植物在持续湿润、阴凉的生境中长得最好。"},{"en":"The researchers recorded several Hymenophyllaceae species along the waterfall trail.","zh":"研究人员在瀑布步道沿线记录到了数种膜蕨科物种。"}]}],"synonyms":["filmy fern family"],"phonetic":"/ˌhaɪmənəˌfɪləˈseɪsiˌiː/","extraExplanation":["这是一个植物分类学名（科名），通常在学术写作中首字母大写：Hymenophyllaceae。","词源可拆解为希腊语：hymen-（“薄膜、膜”）+ phyll-（“叶”），指这类蕨的叶片极薄，常呈“薄膜状”。","日常英语里更常用的俗名是 filmy fern family（膜蕨/薄膜蕨家族），在园艺或自然观察语境中更易理解。"]}
{"word":"Hymenophyllaceae-related","summary":{"en":"associated with the filmy-fern family in botanical classification","zh":"与植物分类中的膜蕨科（薄膜蕨类）有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, characteristic of, or belonging to the fern family Hymenophyllaceae (the “filmy ferns”).","zh":"与膜蕨科（Hymenophyllaceae，常称“膜蕨/薄叶蕨”，即 filmy ferns）有关的；属于或具有该科特征的。"},"examples":[{"en":"The paper focuses on Hymenophyllaceae-related traits, especially their extremely thin fronds.","zh":"这篇论文关注与膜蕨科相关的性状，尤其是它们极薄的叶状体（叶片）。"},{"en":"Hymenophyllaceae-related species often grow in very humid forests.","zh":"与膜蕨科相关的物种常见于非常潮湿的森林环境。"},{"en":"Researchers compared Hymenophyllaceae-related ferns with other fern families to study water loss.","zh":"研究人员将膜蕨科相关的蕨类与其他蕨类科进行比较，以研究水分散失。"}]}],"synonyms":["associated with Hymenophyllaceae","Hymenophyllaceae-associated","filmy-fern-family-related"],"phonetic":"/ˌhaɪmənoʊˌfɪˈleɪsiː-i rɪˈleɪtɪd/","extraExplanation":["膜蕨科（Hymenophyllaceae）常被称为“filmy ferns（薄膜蕨）”，很多种类叶片非常薄，往往只有一层细胞厚，因此通常需要高湿环境（如云雾林、溪谷、瀑布附近）才能良好生长。","在学术写作里，“X-related”常用作形容词，表示“与X相关的/具有X特征的”，多见于论文标题、分类学、医学与科技语境。"],"etymology":"词源来自植物学科名 Hymenophyllaceae：由希腊语 hymen（膜、薄膜）+ phyllon（叶）构成 Hymenophyllum（“膜叶”的意思），再加上植物科名后缀 -aceae（“……科”）；“related”表示“相关的”。","mnemonic":["把 Hymeno- 想成“hymen=薄膜”，-phyll- 想成“phyll=叶”（像中文“叶”），合起来就是“膜叶的蕨”；再加 related=“相关”，即“和膜叶蕨这一科相关”。","记忆拆分：Hymen(o)=膜 + phyll=叶 + -aceae=某某科 → “膜叶蕨科”。"]}
{"word":"hymenophyllaceous","summary":{"en":"An adjective meaning “of or related to the filmy fern family (Hymenophyllaceae).”","zh":"形容词，表示“膜蕨科的；与膜蕨科有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the fern family Hymenophyllaceae, commonly called “filmy ferns.”","zh":"与膜蕨科（Hymenophyllaceae，俗称“膜蕨/薄膜蕨”）有关的；膜蕨科的。"},"examples":[{"en":"The botanist identified a hymenophyllaceous fern growing on the damp rock face.","zh":"植物学家鉴定出一株膜蕨科的蕨类，生长在潮湿的岩壁上。"},{"en":"Hymenophyllaceous species often prefer humid forests where their delicate fronds can stay moist.","zh":"膜蕨科的物种常偏好湿润的森林环境，因为它们纤薄的叶片需要保持湿润。"}]}],"synonyms":["Hymenophyllaceae-related","filmy-fern (used as an adjective in context)"],"phonetic":"/ˌhaɪməˌnɑfəˈleɪʃəs/","extraExplanation":["这个词主要用于植物分类与学术写作中，日常英语里很少见。它来自植物科名 Hymenophyllaceae（膜蕨科）+ 形容词后缀 -ous（“……的”）。膜蕨科常见特征之一是叶片非常薄、近乎半透明，常生长在潮湿、阴暗的环境中。"]}
{"word":"hymenophyllites","summary":{"en":"Hymenophyllites is a fossil genus name for fern-like plants resembling filmy ferns.","zh":"Hymenophyllites 是一个化石属名，用于指类似膜蕨的蕨状植物化石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name used for fossil fern-like plants, especially fossils resembling filmy ferns (family Hymenophyllaceae).","zh":"一个用于化石植物的属名，指类似“膜蕨”（膜蕨科 Hymenophyllaceae）的蕨类或蕨状植物化石。"},"examples":[{"en":"The shale layer contains Hymenophyllites along with other fern fossils.","zh":"这一页岩层含有 Hymenophyllites，以及其他蕨类化石。"},{"en":"Researchers compared Hymenophyllites specimens to modern filmy ferns to infer their habitat.","zh":"研究人员将 Hymenophyllites 标本与现代膜蕨比较，以推测其生境。"}]}],"synonyms":["fossil filmy fern","fossil fern (general)"],"phonetic":"/ˌhaɪməˈnɑfəˌlaɪts/","extraExplanation":["这是一个古植物学（paleobotany）里常见的“化石属名”（form genus / fossil genus）风格的拉丁化命名：当化石材料不完整、难以精确对应到现代某个属时，学者会用形态特征来建立或使用这类属名。","词尾 -ites 常见于化石相关的名称（表示“……的化石/矿化遗存/相关形态”），因此 Hymenophyllites 一看就很像文献中用于化石分类的名字。","在英文论文里它通常作为一个分类学名出现，是否需要斜体取决于期刊规范（很多期刊把属名按拉丁学名处理，用斜体）。"]}
{"word":"hymenophyllum","summary":{"en":"Hymenophyllum is a genus of “filmy ferns” with extremely thin, often translucent fronds that thrive in moist, shady habitats.","zh":"Hymenophyllum 指膜蕨属：叶片极薄、常半透明的“膜蕨”，多见于阴湿环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of very thin-leaved ferns called filmy ferns, usually found in cool, moist forests and near waterfalls; their fronds often look almost transparent.","zh":"（植物）膜蕨属：一类叶片极薄、常呈半透明的蕨类（又称“膜蕨/薄膜蕨”，filmy ferns），多生长在凉爽潮湿的森林、溪流或瀑布附近。"},"examples":[{"en":"Hymenophyllum often grows where the air stays humid, such as near streams and waterfalls.","zh":"膜蕨属植物常生长在空气长期潮湿的地方，例如溪流和瀑布附近。"},{"en":"Because its fronds are so thin, Hymenophyllum can dry out quickly if the habitat becomes too sunny or windy.","zh":"由于叶片非常薄，膜蕨属植物在环境过于暴晒或多风时很容易迅速失水。"}]}],"synonyms":["filmy fern (genus)"],"phonetic":"/ˌhaɪmənoʊˈfɪləm/","extraExplanation":["“Hymenophyllum”来自希腊语词根：hymen-（意为“膜”）+ phyllon（意为“叶”），字面意思就是“膜状的叶”，用来形容它极薄的叶片特征。","在英文自然写作或植物学语境中，它常与更宽泛的俗名“filmy fern（膜蕨/薄膜蕨）”一起出现；属名通常首字母大写并用斜体表示（Hymenophyllum）。"]}
{"word":"hymenopter","summary":{"en":"A hymenopter is an insect in the Hymenoptera group, such as a bee, wasp, or ant.","zh":"hymenopter 指膜翅目昆虫，如蜜蜂、黄蜂或蚂蚁等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An insect that belongs to the order Hymenoptera (the group that includes bees, wasps, ants, and sawflies).","zh":"膜翅目昆虫（属于膜翅目的一类昆虫，包括蜜蜂、黄蜂/胡蜂、蚂蚁和叶蜂等）。"},"examples":[{"en":"Bees and wasps are common hymenopters found in gardens.","zh":"蜜蜂和黄蜂是花园里常见的膜翅目昆虫。"},{"en":"Some hymenopters help farmers by pollinating crops or controlling pests.","zh":"有些膜翅目昆虫能通过授粉或控制害虫来帮助农民。"}]}],"synonyms":["hymenopteran","hymenopterous insect","Hymenoptera (as a group name)"],"phonetic":"/ˌhaɪməˈnɑːptər/","extraExplanation":["“hymenopter”在现代英语里较少单独使用，更常见的是“hymenopteran”（膜翅目昆虫）或直接说“a hymenopter insect”。","词源来自希腊语：hymen（膜）+ pteron（翅），字面意思是“有膜状翅膀的”。许多成员（如蜜蜂、黄蜂）有两对薄膜状翅；而蚂蚁的工蚁通常无翅，但仍属于同一目。","在日常语境里，如果你指的是会蜇人的那类，英语里更常用更具体的词，如“bee / wasp / hornet / ant”。"]}
{"word":"Hymenoptera","summary":{"en":"Hymenoptera is the insect order that includes bees, wasps, and ants.","zh":"Hymenoptera 指膜翅目，包括蜜蜂、黄蜂/胡蜂和蚂蚁等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of insects that includes bees, wasps, ants, and sawflies (many have membranous wings, and some live in colonies)","zh":"膜翅目（昆虫的一个“目”，包括蜜蜂、黄蜂/胡蜂、蚂蚁和叶蜂等；多为膜质翅膀，部分种类群居）"},"examples":[{"en":"Bees and ants are both Hymenoptera.","zh":"蜜蜂和蚂蚁都属于膜翅目。"},{"en":"The researcher studied Hymenoptera to understand pollination and colony behavior.","zh":"研究人员研究膜翅目昆虫，以了解授粉和群体行为。"}]}],"synonyms":["order Hymenoptera"],"phonetic":"/ˌhaɪməˈnɑːptərə/","extraExplanation":["词源来自希腊语：hymen（“膜”）+ pteron（“翅膀”），字面意思是“膜翅”。","在生物分类中，Hymenoptera 是“目”（order），比“科”（family）更大；英文中常用作单数或复数概念（如：Hymenoptera is… / Hymenoptera are…），取决于强调“该分类”还是“该类群中的成员”。","很多膜翅目昆虫（如蜜蜂、蚂蚁）在生态与人类生活中很重要：蜜蜂参与授粉；部分黄蜂会捕食害虫；但也可能蜇人，需要注意安全。"]}
{"word":"hymenoptera","summary":{"en":"Hymenoptera is the insect order that includes bees, wasps, ants, and sawflies.","zh":"Hymenoptera 指膜翅目，包括蜜蜂、黄蜂、蚂蚁和叶蜂等昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An order of insects that includes bees, wasps, ants, and sawflies; many species have two pairs of thin, clear wings and often a stinger (in some females).","zh":"膜翅目：一个昆虫目，包括蜜蜂、黄蜂、蚂蚁和叶蜂等；许多种类有两对薄而透明的翅膀，部分雌虫具有螫针（毒针）。"},"examples":[{"en":"Bees and ants are both members of Hymenoptera.","zh":"蜜蜂和蚂蚁都属于膜翅目。"},{"en":"Some hymenoptera live in complex social colonies.","zh":"有些膜翅目昆虫生活在复杂的社会性群体中。"},{"en":"The researcher studied hymenoptera to understand pollination and insect behavior.","zh":"研究人员研究膜翅目昆虫，以了解授粉与昆虫行为。"}]}],"synonyms":["order Hymenoptera"],"phonetic":"/ˌhaɪməˈnɑːptərə/","extraExplanation":["词源提示：Hymenoptera 来自希腊语，hymen-（“膜”）+ pteron（“翅膀”），字面意思是“膜质翅膀”。","学习提示：它是一个科学分类名（“一个目”），日常英语里更常用 bee/wasp/ant 等具体名称；在科普文章、生物课本、研究论文中更常见。","文化/文学中的常见场景：在自然写作与科普中，常用来讨论“社会性昆虫”（如蚂蚁、蜜蜂的分工协作）以及“授粉”（bees as pollinators）。"]}
{"word":"Hymenoptera-related","summary":{"en":"related to bees, wasps, ants, and their insect order","zh":"与蜜蜂、胡蜂、蚂蚁等膜翅目昆虫有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or concerning Hymenoptera, the insect order that includes bees, wasps, ants, and sawflies.","zh":"与膜翅目（包括蜜蜂、黄蜂/胡蜂、蚂蚁、叶蜂等）有关的。"},"examples":[{"en":"The study focused on Hymenoptera-related pollination in wildflower meadows.","zh":"这项研究聚焦于野花草地中与膜翅目相关的传粉作用。"},{"en":"She developed a severe allergy after a Hymenoptera-related sting.","zh":"她在一次与膜翅目相关的蜇伤后出现了严重过敏。"},{"en":"The museum has a Hymenoptera-related exhibit featuring bees and ants.","zh":"博物馆有一个与膜翅目相关的展览，展示蜜蜂和蚂蚁。"}]}],"synonyms":["hymenopteran","bee-related","wasp-related","ant-related"],"phonetic":"/ˌhaɪməˈnɑːptərə rɪˈleɪtɪd/","extraExplanation":["在科普或学术语境中更常见的对应形容词是 hymenopteran（膜翅目的）。日常表达若想更口语，也可用 bee-related（与蜜蜂有关的）、wasp-related（与黄蜂有关的）等，但范围会更窄。"],"etymology":"来自“Hymenoptera（膜翅目）+ related（相关的）”。Hymenoptera 源自希腊语：hymen（膜）+ pteron（翅），字面意思是“膜质翅膀”，指这类昆虫常见的透明膜翅特征。","mnemonic":["记忆法：Hymeno-≈“hymen（膜）”，-ptera≈“pter（翅）”，合起来“膜+翅”→膜翅目。再加 related=“相关”。","联想：看到 bees/wasps/ants（蜂/胡蜂/蚂蚁）就想到 Hymenoptera；“Hymenoptera-related”就是“跟这些有关”。"]}
{"word":"hymenopteran","summary":{"en":"A hymenopteran is an insect (or relating to insects) in the group that includes bees, wasps, and ants.","zh":"hymenopteran 指膜翅目昆虫（或与其相关的），包括蜜蜂、黄蜂/胡蜂和蚂蚁等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an insect that belongs to the order Hymenoptera, such as a bee, wasp, ant, or sawfly","zh":"膜翅目昆虫（属于膜翅目的一类昆虫，如蜜蜂、黄蜂/胡蜂、蚂蚁或叶蜂）"},"examples":[{"en":"Bees and ants are hymenopterans that often live in organized colonies.","zh":"蜜蜂和蚂蚁都是膜翅目昆虫，常常以有组织的群体生活。"},{"en":"Many hymenopterans help plants by pollinating flowers.","zh":"许多膜翅目昆虫会为花授粉，从而帮助植物繁殖。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of the insect order Hymenoptera","zh":"与膜翅目（Hymenoptera）有关的；具有膜翅目特征的"},"examples":[{"en":"The researcher recorded hymenopteran diversity in the forest.","zh":"研究人员记录了森林中的膜翅目多样性。"},{"en":"Some hymenopteran species have a painful sting.","zh":"一些膜翅目物种的蜇刺会很疼。"}]}],"synonyms":["hymenopterous","member of Hymenoptera"],"phonetic":"/ˌhaɪməˈnɑːptərən/","extraExplanation":["“hymenopteran”来自“Hymenoptera”（膜翅目）：hymen- 表示“膜”，-ptera 表示“翅”。因为这一类昆虫通常有两对透明、膜质的翅膀（也有例外，如蚂蚁工蚁无翅）。","在日常英语里更常见的说法是直接说“bees/wasps/ants”。“hymenopteran”多用于生物学、昆虫学或科普写作。"]}
{"word":"hymenopterist","summary":{"en":"A hymenopterist is a scientist who studies bees, wasps, ants, and other Hymenoptera insects.","zh":"hymenopterist 指研究膜翅目昆虫（如蜜蜂、黄蜂、蚂蚁等）的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies insects in the order Hymenoptera (especially bees, wasps, and ants).","zh":"研究膜翅目昆虫（尤其是蜜蜂、黄蜂/胡蜂、蚂蚁）的科学家。"},"examples":[{"en":"The hymenopterist collected ants and identified them under a microscope.","zh":"这位膜翅目昆虫学家采集了蚂蚁，并在显微镜下进行鉴定。"},{"en":"As a hymenopterist, she studies how bees communicate inside the hive.","zh":"作为膜翅目昆虫学家，她研究蜜蜂在蜂巢内如何交流。"}]}],"synonyms":["Hymenoptera specialist","entomologist (specializing in Hymenoptera)"],"phonetic":"/ˌhaɪməˈnɑːptərɪst/","extraExplanation":["词源拆解：hymenoptera（膜翅目；hymen- 表“膜”，-ptera 表“翅”）+ -ist（“……的研究者/从业者”）。因此 hymenopterist 就是“研究膜翅目的人”。","相关词：entomologist（昆虫学家，范围更广）；apiologist（研究蜜蜂的人，较少见）；myrmecologist（研究蚂蚁的人）。","使用场景：多见于学术文章、自然史写作、博物馆/大学研究职位介绍中；日常英语里更常说 “an insect scientist” 或 “an entomologist who studies bees/ants/wasps”。"]}
{"word":"hymenopterological","summary":{"en":"An academic adjective meaning “related to the study of bees, wasps, ants, and other Hymenoptera.”","zh":"一个偏学术的形容词，表示“与研究蜜蜂、黄蜂、蚂蚁等膜翅目昆虫有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hymenopterology—the scientific study of insects in the order Hymenoptera (such as bees, wasps, ants, and many sawflies).","zh":"与膜翅目昆虫学有关的；指研究膜翅目（如蜜蜂、黄蜂、蚂蚁及许多叶蜂等）的学科或内容。"},"examples":[{"en":"Her hymenopterological research focuses on how bees communicate inside the hive.","zh":"她的膜翅目昆虫学研究重点是蜜蜂在蜂巢内如何交流。"},{"en":"The museum has a small hymenopterological collection, mostly ants and wasps.","zh":"这家博物馆有一小批膜翅目相关的标本收藏，主要是蚂蚁和黄蜂。"}]}],"synonyms":["entomological (broader)","related to Hymenoptera"],"phonetic":"/ˌhaɪməˌnɑptəˈrɑlədʒɪkəl/","extraExplanation":["“Hymenopterological”是一个非常少见、偏学术的形容词，常见于论文、博物馆/标本馆说明或学术介绍中。日常英语里更常说“the study of bees/wasps/ants”或直接用“entomological（昆虫学的）”。","“Hymenoptera（膜翅目）”名称来自希腊语：hymen（膜）+ pteron（翅），指这类昆虫常见的“膜质翅”。"]}
{"word":"hymenopterologist","summary":{"en":"A hymenopterologist is a specialist who studies bees, wasps, ants, and related insects (Hymenoptera).","zh":"hymenopterologist 指专门研究膜翅目昆虫（如蜜蜂、黄蜂、蚂蚁等）的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies insects in the order Hymenoptera, such as bees, wasps, ants, and sawflies.","zh":"研究膜翅目昆虫（如蜜蜂、黄蜂、蚂蚁、叶蜂等）的科学家；膜翅目昆虫学家。"},"examples":[{"en":"The hymenopterologist identified the bee species by its wing veins and pollen baskets.","zh":"这位膜翅目昆虫学家通过翅脉和采粉篮辨认出蜜蜂的物种。"},{"en":"Our museum invited a hymenopterologist to give a talk about ants and their colonies.","zh":"我们博物馆邀请了一位膜翅目昆虫学家来讲解蚂蚁及其群体。"}]}],"synonyms":["entomologist (specializing in Hymenoptera)","insect scientist"],"phonetic":"/ˌhaɪməˌnɑːptəˈrɑːlədʒɪst/","extraExplanation":["“hymenopterologist”由三部分组成：Hymenoptera（膜翅目）+ -logist（研究者）+ -ist（从事者/专家）。Hymenoptera 源自希腊语，hymen- 表示“膜”，-ptera 表示“翅膀”，指这类昆虫常见的“膜质翅”。","在英文里更常见、更好用的说法是 “entomologist (who studies Hymenoptera)”（研究昆虫的昆虫学家，专攻膜翅目），因为 hymenopterologist 比较学术、少见。"]}
{"word":"hymenopterology","summary":{"en":"Hymenopterology is the scientific study of Hymenoptera—bees, wasps, ants, and related insects.","zh":"hymenopterology 指“膜翅目昆虫学”，即研究蜜蜂、黄蜂、蚂蚁等膜翅目昆虫的科学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of insects in the order Hymenoptera (such as bees, wasps, ants, and sawflies).","zh":"膜翅目昆虫学；研究膜翅目昆虫（如蜜蜂、黄蜂、蚂蚁、叶蜂等）的科学。"},"examples":[{"en":"She specializes in hymenopterology, especially the behavior of wild bees.","zh":"她专攻膜翅目昆虫学，尤其研究野生蜜蜂的行为。"},{"en":"Hymenopterology helps scientists understand pollination and the roles insects play in ecosystems.","zh":"膜翅目昆虫学帮助科学家理解传粉以及昆虫在生态系统中的作用。"}]}],"synonyms":["the study of Hymenoptera","entomology (broader term)","insect science (broader term)"],"phonetic":"/ˌhaɪməˌnɑpˌtɚˈɑlədʒi/","extraExplanation":["词源结构：hymenopter- 来自 Hymenoptera（膜翅目；hymen=“膜”，pteron=“翅”），-logy 表示“学科/研究”。整体字面意思是“研究膜翅目的学科”。","膜翅目常见成员包括蜜蜂、黄蜂、蚂蚁等，其中许多是“社会性昆虫”（例如蚂蚁群体、蜂群），因此该领域也常涉及群体行为、分工与信息交流等主题。","在实际语境中，这个词非常学术、偏专业；更常见的日常说法是 “the study of bees/wasps/ants” 或更广泛的 “entomology（昆虫学）”。"]}
{"word":"hymenopteron","summary":{"en":"A hymenopteron is an insect like a bee, wasp, or ant (order Hymenoptera).","zh":"hymenopteron 指膜翅目昆虫，如蜜蜂、黄蜂或蚂蚁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An insect of the order Hymenoptera (such as a bee, wasp, ant, or sawfly).","zh":"膜翅目昆虫（如蜜蜂、黄蜂、蚂蚁或叶蜂等）。"},"examples":[{"en":"Bees and ants are common hymenopterons found in many habitats.","zh":"蜜蜂和蚂蚁是在许多栖息地都很常见的膜翅目昆虫。"},{"en":"The researcher studied a hymenopteron to understand how social insects communicate.","zh":"研究人员研究了一种膜翅目昆虫，以了解社会性昆虫如何交流。"}]}],"synonyms":["hymenopteran","bee","wasp","ant"],"phonetic":"/ˌhaɪməˈnɑːptərən/","extraExplanation":["“hymenopteron”在现代英语中更常见的形式是“hymenopteran”，两者都指“膜翅目”的成员。","词源：来自希腊语词根 hymen（“膜”）+ pteron（“翅”），意思是“有膜状翅膀的（昆虫）”。膜翅目昆虫通常有两对透明翅，后翅较小，并通过小钩与前翅连接。","使用场景：多用于生物学、昆虫学等学术语境；日常英语里通常直接说 bee/wasp/ant。"]}
{"word":"hymenopterous","summary":{"en":"Hymenopterous means “related to Hymenoptera,” the insect group that includes bees, wasps, and ants.","zh":"hymenopterous 指“与膜翅目有关的”，膜翅目包括蜜蜂、黄蜂和蚂蚁等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to insects of the order Hymenoptera (such as bees, wasps, ants, and sawflies).","zh":"（形容词）与膜翅目昆虫有关的（如蜜蜂、黄蜂、蚂蚁、叶蜂等）。"},"examples":[{"en":"Bees and wasps are hymenopterous insects.","zh":"蜜蜂和黄蜂属于膜翅目的昆虫。"},{"en":"The garden’s hymenopterous visitors help pollinate the flowers.","zh":"花园里那些膜翅目“访客”帮助花朵授粉。"}]}],"synonyms":["hymenopteran","Hymenoptera-related"],"phonetic":"/ˌhaɪməˈnɑptərəs/","extraExplanation":["“hymenopterous”较偏学术/科普写作，日常更常用的是“Hymenoptera”（名词，膜翅目）或“hymenopteran”（形容词/名词）。","词源提示：来自希腊语 hymen（膜）+ pteron（翅），字面意思是“有膜质翅的”。膜翅目昆虫通常有两对薄翅，且许多种类有“细腰”（如蜂、蚁）。"]}
{"word":"hymenopttera","summary":{"en":"Hymenoptera is the insect order that includes bees, wasps, ants, and sawflies.","zh":"Hymenoptera 指昆虫“膜翅目”，包括蜜蜂、黄蜂/胡蜂、蚂蚁和叶蜂等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Entomology) The insect order that includes bees, wasps, ants, and sawflies—many species have two pairs of clear wings, and some live in complex social colonies.","zh":"（昆虫学）膜翅目：包括蜜蜂、黄蜂/胡蜂、蚂蚁和叶蜂等的一类昆虫。许多种类有两对透明翅，有些种类具有复杂的群居社会结构。"},"examples":[{"en":"Bees and ants are both in the order Hymenoptera.","zh":"蜜蜂和蚂蚁都属于膜翅目（Hymenoptera）。"},{"en":"Many Hymenoptera are important pollinators in gardens and farms.","zh":"许多膜翅目昆虫是花园和农田里重要的传粉者。"},{"en":"Some Hymenoptera, such as certain wasps, help control pests.","zh":"一些膜翅目昆虫（比如某些寄生蜂）能帮助控制害虫。"}]}],"synonyms":["order Hymenoptera","membrane-winged insects"],"phonetic":"/ˌhaɪməˈnɑːptərə/","extraExplanation":["你输入的拼写 **hymenopttera** 通常应为 **Hymenoptera**（膜翅目），中间一般不写双 t。","词源来自希腊语：**hymen**（薄膜）+ **ptera**（翅膀），字面意思接近“膜状翅的昆虫”。","许多膜翅目雌虫的“刺”与产卵器有关（例如蜜蜂、黄蜂），但并非所有膜翅目都会蜇人；蚂蚁中也只有部分种类会叮咬或喷酸。"]}
{"word":"hymenotome","summary":{"en":"A rare medical term for an instrument used to cut/open the hymen during surgery.","zh":"罕见医学词：指用于手术切开/打开处女膜的器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical instrument used to cut the hymen, or a tool used when performing a hymenotomy (a procedure to open an imperforate or obstructing hymen).","zh":"（医学）处女膜切开器：用于切开处女膜的外科器械；也可指用于进行处女膜切开术（用于打开无孔/阻塞性处女膜）的工具。"},"examples":[{"en":"In rare cases of an imperforate hymen, a surgeon may use a hymenotome during a hymenotomy.","zh":"在罕见的无孔处女膜病例中，外科医生可能在处女膜切开术中使用处女膜切开器。"},{"en":"The medical note listed the instruments prepared, including a hymenotome.","zh":"病历记录列出了准备的器械，其中包括处女膜切开器。"}]}],"synonyms":["hymen knife","hymenotome instrument"],"phonetic":"/ˌhaɪməˈnɑːtoʊm/","extraExplanation":["这是一个非常少见、偏专业的医学词汇，通常只出现在妇科/外科语境中。日常英语里几乎不会用到。","与“hymen（处女膜）”相关的词在不同文化里可能带有敏感或社会性含义；但在医学语境中，它主要指解剖结构与必要的治疗。","相关常见词：hymenotomy（处女膜切开术，手术名称）、incision（切口/切开）、gynecology（妇科）。"]}
{"word":"hymenotomies","summary":{"en":"“Hymenotomies” is the plural of “hymenotomy,” meaning surgical incisions of the hymen.","zh":"hymenotomies 是 hymenotomy 的复数，指“处女膜切开术”（对处女膜进行外科切开）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Surgical procedures in which the hymen is cut or incised (for example, to open an obstructed vaginal opening).","zh":"（复数）“处女膜切开术”：一种外科手术，通过切开处女膜（例如为了解除阴道口阻塞）。"},"examples":[{"en":"In rare cases, doctors may perform hymenotomies to treat an obstructive hymenal condition.","zh":"在少数情况下，医生可能会进行处女膜切开术来治疗处女膜造成的阻塞性问题。"},{"en":"The patient was counseled about the risks and benefits of hymenotomies before surgery.","zh":"手术前，医生向患者说明了处女膜切开术的风险与益处。"}]}],"synonyms":["hymenotomy","hymen incision","hymenectomy (related but not identical)"],"phonetic":"/ˌhaɪməˈnɑtəˌmiz/","extraExplanation":["这是医学/妇科语境中的专业词，日常英语中很少出现。若用于写作或翻译，通常需要注意隐私与文化敏感性：在医学上“hymen（处女膜）”是解剖结构，并不等同于“贞操/处女”的社会概念。","词形提示：hymenotomy 为单数；hymenotomies 为复数（-y 结尾变 -ies）。"]}
{"word":"hymenotomy","summary":{"en":"Hymenotomy is a medical procedure to cut/open the hymen, usually to relieve an obstruction or related symptoms.","zh":"hymenotomy 指“处女膜切开术”，是一种切开/打开处女膜以解除阻塞或相关症状的医疗操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A minor surgical procedure to cut or open the hymen (a thin membrane at the vaginal opening), usually to relieve blockage or allow normal menstrual flow or intercourse.","zh":"处女膜切开术：一种小型外科手术，用于切开或打开处女膜（阴道口处的薄膜），常用于解除阻塞，帮助月经正常排出或改善性交困难。"},"examples":[{"en":"The doctor recommended a hymenotomy to treat an imperforate hymen and relieve the patient’s pain.","zh":"医生建议进行处女膜切开术，以治疗处女膜闭锁并缓解患者疼痛。"},{"en":"After a hymenotomy, the patient was advised to follow specific hygiene and follow-up instructions.","zh":"处女膜切开术后，患者被建议遵循特定的卫生与复诊要求。"}]}],"synonyms":["incision of the hymen","hymenal incision"],"phonetic":"/ˌhaɪməˈnɑtəmi/","extraExplanation":["词源提示：hymen-（处女膜）+ -otomy（切开术）。-otomy 常用于医学名词，表示“切开/切开手术”（如 tracheotomy 气管切开术）。","使用语境：这是医学术语，常出现在妇科病历、手术说明或医学科普中。日常英语里较少使用；更口语的表达可能是 “a procedure to open/cut the hymen”。","文化与敏感性：不同文化对“处女膜/贞操”有强烈社会含义，但医学上处女膜形态差异很大，且“处女膜是否完整”并不能可靠判断是否发生过性行为。讨论该手术时通常以健康与治疗为核心。"]}
{"word":"hymens","summary":{"en":"“Hymens” is the plural of “hymen,” a thin vaginal membrane with wide natural variation; it’s sometimes used figuratively for “virginity,” but that link is often misleading.","zh":"“Hymens”是“hymen（处女膜）”的复数，指一种形态差异很大的薄膜；有时被比喻为“贞洁/处女”，但这种对应关系常不准确。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The plural of hymen: thin membranes that may partially cover the opening of the vagina; they vary widely in shape and can change naturally over time.","zh":"（解剖）hymen 的复数：可能部分覆盖阴道口的薄膜；形态差异很大，也会随时间自然变化。"},"examples":[{"en":"Doctors note that hymens vary a lot from person to person.","zh":"医生指出，不同人的处女膜差异很大。"},{"en":"Some hymens stretch or tear from sports, tampon use, or other non-sexual activities.","zh":"有些处女膜可能因运动、使用卫生棉条或其他非性行为活动而拉伸或破裂。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/figurative) Used to refer to virginity or sexual “purity” (a usage that can be culturally sensitive and often inaccurate).","zh":"（文学/比喻）用来指代“贞洁”或“性纯洁”（这种用法具有文化敏感性，且常带有不准确的观念）。"},"examples":[{"en":"In older literature, writers sometimes used “hymens” to symbolize innocence.","zh":"在较早的文学作品中，作者有时用“hymens”象征天真或纯洁。"},{"en":"Modern writing often avoids linking hymens directly with virginity.","zh":"现代写作常避免把处女膜与“是否处女”直接划等号。"}]}],"synonyms":["vaginal membrane","hymenal tissue"],"phonetic":"/ˈhaɪmənz/","extraExplanation":["“处女膜＝是否发生过性行为”的观念在医学上并不可靠：处女膜外观差异很大，也可能因多种非性原因发生改变；也有人天生处女膜很少或没有。","在一些文化语境中，“处女膜”被用来评价女性的“贞洁”，容易造成羞辱、偏见或压力。讨论该词时，较中性的表达是强调解剖事实与个体差异。","如果你是在写作或翻译中使用该词，建议根据语境选择更准确的说法（如“vaginal tissue/membrane”或直接描述医学事实），避免把它当作“处女”的证据。"]}
{"word":"hymettian","summary":{"en":"Hymettian means “from Mount Hymettus near Athens,” often referring to its famous honey.","zh":"Hymettian 指“来自雅典附近的希米托斯山”，常用来指其著名的蜂蜜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to Mount Hymettus (Hymettos) near Athens, Greece; especially used to describe the famous honey and thyme-scented products from that region.","zh":"与希米托斯山（位于希腊雅典附近）有关的；尤指该地区以百里香花蜜闻名的“希米托斯蜂蜜”等特产。"},"examples":[{"en":"The poem praises Hymettian honey as a symbol of sweetness and luxury.","zh":"这首诗称颂“希米托斯蜂蜜”，把它当作甜美与奢华的象征。"},{"en":"They served figs with Hymettian honey, following an old Greek-inspired recipe.","zh":"他们用无花果配希米托斯蜂蜜，做法灵感来自古希腊食谱。"}]}],"synonyms":["Attic (context-dependent)","Athenian (broader)"],"phonetic":"/haɪˈmɛtiən/","extraExplanation":["“Hymettian”是一个带古典色彩的文学/文化用词，常见搭配是“Hymettian honey（希米托斯蜂蜜）”。在英文诗歌或散文里，它常用来营造“古希腊、雅典、雅致甜美”的意象，而不只是地理形容词。","希米托斯山在古代就以蜂蜜著名，尤其因当地百里香（thyme）等芳香植物而使蜂蜜带有独特香气；所以在文学里“Hymettian”常暗示“芳香、甜美、精致”。"]}
{"word":"hymettic","summary":{"en":"Hymettic means connected with Mount Hymettus (famous for honey) and, in literary use, “honey-sweet” in taste or style.","zh":"hymettic 指与以蜂蜜闻名的希米托斯山有关；在文学中也可引申为“如蜜般甜美”（口味或文风/言辞）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"From or related to Mount Hymettus (near Athens, Greece), an area traditionally famous for its honey.","zh":"（源自）希米托斯山（Hymettus，雅典附近）或与之有关；该地传统上以蜂蜜闻名。"},"examples":[{"en":"The poet compared the region’s honey to Hymettic sweetness.","zh":"诗人把这片地区的蜂蜜比作“希米托斯式”的甜美。"},{"en":"In the museum shop, she bought a jar labeled Hymettic honey.","zh":"在博物馆商店里，她买了一罐标着“希米托斯蜂蜜”的蜂蜜。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Sweet like honey; honeyed in taste or style.","zh":"（文学用法）蜜一般甜的；（言辞/风格）甜美圆润、如蜜般的。"},"examples":[{"en":"He wrote in a Hymettic style that sounded smooth and flattering.","zh":"他用一种“如蜜般甜美”的文风写作，听起来圆滑又讨好。"},{"en":"Her Hymettic praise felt a little too sugary to be sincere.","zh":"她那“蜜糖般”的赞美甜得有些过头，让人怀疑是否真诚。"}]}],"synonyms":["honeyed","sweet","honey-like","nectarous"],"phonetic":"/haɪˈmɛtɪk/","extraExplanation":["“Hymettic”来自 Mount Hymettus（希米托斯山），古典传统里以出产优质蜂蜜出名，所以这个词在英语文学中常被用来比喻“蜂蜜般的甜美”，尤其形容语言、文风或奉承的话。","这个词比较书面和少见，常见于诗歌、古典题材写作或带有古风的修辞；日常英语里通常会用 “honeyed” 或 “sweet” 来表达相近意思。"]}
{"word":"hymn","summary":{"en":"A hymn is a song of praise—most often a religious worship song, but it can also mean a poem or song praising something deeply.","zh":"hymn 指“赞美之歌”，最常见是宗教礼拜中的赞美诗，也可泛指对某事物深情礼赞的诗歌或歌曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A song of praise or worship, especially one sung in a religious service.","zh":"赞美诗；圣歌（尤指在宗教礼拜中唱的赞美与敬拜之歌）。"},"examples":[{"en":"The congregation sang a hymn at the beginning of the service.","zh":"礼拜一开始，会众就唱了一首赞美诗。"},{"en":"Her favorite hymn reminds her of childhood Sundays.","zh":"她最喜欢的圣歌让她想起童年的周日礼拜。"}]},{"partOfSpeech":"n.","definition":{"en":"A song or poem that strongly praises someone or something (not always religious).","zh":"颂歌；赞歌（不一定宗教性的，用来强烈赞美某人或某事的歌曲或诗）。"},"examples":[{"en":"The poem is a hymn to nature’s beauty.","zh":"这首诗是一曲对大自然之美的赞歌。"},{"en":"In her speech, he heard a hymn to hard work and perseverance.","zh":"在她的演讲中，他听到的是对勤奋与坚持的颂扬。"}]}],"synonyms":["psalm","carol","chant","anthem","ode"],"phonetic":"/hɪm/","extraExplanation":["“hymn”通常指基督教传统中的赞美诗，但广义上也可指任何带有“颂赞”意味的歌曲或诗。常见搭配有：hymn book（赞美诗集）、hymn tune（赞美诗曲调）、to sing a hymn（唱赞美诗）。","文学与文化中常见“a hymn to ...”的写法，表示“对……的赞歌/礼赞”，语气比普通的“praise”更庄重、更有仪式感。"]}
{"word":"hymn-like","summary":{"en":"solemn and lyrical, like a hymn","zh":"庄严抒情、带有圣歌（赞美诗）般风格"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the style or feeling of a hymn; solemn, religious, or lyrical in a way that suggests a hymn.","zh":"具有赞美诗（圣歌）的风格或氛围；庄严、宗教感强，或带有类似圣歌的抒情性。"},"examples":[{"en":"The choir sang in a hymn-like style that filled the hall with calm.","zh":"合唱团用一种赞美诗般的风格演唱，让大厅充满了宁静。"},{"en":"Her hymn-like melody sounded simple but deeply moving.","zh":"她那首赞美诗般的旋律听起来简单，却非常动人。"},{"en":"The poem has a hymn-like tone, praising nature with quiet reverence.","zh":"这首诗带有赞美诗般的语气，以安静的敬意赞颂自然。"}]}],"synonyms":["hymnal","psalm-like","choral","solemn","reverent","devotional","songlike","lyrical"],"phonetic":"/hɪm laɪk/","extraExplanation":["“hymn-like”常用于描述音乐、诗歌、语言的“庄严、敬虔、赞颂”的气质，不一定真的与宗教有关；也可以只是像圣歌那样的节奏、旋律或氛围。","在文学评论里，它可能暗示一种“赞歌式”（praise/celebration）的写法：用简洁、重复、抑扬顿挫的句式来营造崇高或敬畏感。"],"etymology":"由“hymn（赞美诗/圣歌）+ -like（像……一样）”构成的复合形容词，用来表示“具有圣歌风格/感觉”。","mnemonic":["拆开记：hymn=“圣歌/赞美诗”，-like=“像……一样” → “像圣歌一样的”氛围。","联想：去教堂听到的合唱常常“庄严、纯净、缓慢”——这种感觉就是 hymn-like。"]}
{"word":"hymn-related","summary":{"en":"connected with hymns or their use and study","zh":"与圣诗（赞美诗）及其使用/研究有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with hymns (religious songs of praise), their lyrics, music, use in worship, or study","zh":"与“圣诗/赞美诗”（宗教赞美歌曲）有关的；涉及圣诗的歌词、旋律、礼拜使用或研究的"},"examples":[{"en":"The choir practiced hymn-related music for Sunday service.","zh":"合唱团为周日礼拜练习与圣诗相关的曲目。"},{"en":"She is writing a hymn-related article about the history of church singing.","zh":"她在写一篇与圣诗相关的文章，主题是教会歌唱的历史。"},{"en":"We looked at hymn-related vocabulary to understand the old lyrics.","zh":"我们学习了与圣诗相关的词汇，以便理解旧歌词。"}]}],"synonyms":["hymnal","sacred","religious","church","liturgical"],"phonetic":"/hɪm rɪˈleɪtɪd/","extraExplanation":["用法提示：hymn-related 通常出现在较正式或书面语中，表示“与圣诗有关的各方面”。日常口语里也可说 “related to hymns” 或 “about hymns”。","文化背景：在英语语境里，hymn 往往和基督教礼拜、教堂合唱、圣诗集（hymnbook）联系紧密；但更广义也可指宗教或庄严场合的颂歌。"],"etymology":"这是一个复合形容词：hymn（圣诗、赞美诗）+ related（相关的）。hymn 来自希腊语 hymnos，原指“赞歌/颂歌”，后来常指宗教场合的赞美诗；related 源自拉丁语，表示“连接、有关联”。英语中常用“名词 + -related”来表达“与……有关的”。","mnemonic":["把它拆开记：hymn（圣诗）+ related（相关的）＝“圣诗相关的”。","联想：hymn 和 him 同音（/hɪm/），想象 “him（祂/上帝）” 的歌 → 圣诗；再加 related 就是“跟圣诗有关”。"]}
{"word":"hymn-singing","summary":{"en":"Singing religious hymns, often in worship; or related to that activity.","zh":"唱赞美诗（宗教赞歌）的活动；或与之相关的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity of singing hymns (religious songs of praise), especially in a church or worship setting.","zh":"唱赞美诗（宗教赞歌）的活动，尤指在教堂或礼拜场合中。"},"examples":[{"en":"After the sermon, the congregation joined in hymn-singing.","zh":"讲道结束后，会众一起唱赞美诗。"},{"en":"Hymn-singing is a long-standing tradition in many Christian churches.","zh":"唱赞美诗是许多基督教教会由来已久的传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something related to singing hymns.","zh":"用于形容与唱赞美诗有关的。"},"examples":[{"en":"They held a hymn-singing service on Sunday evening.","zh":"他们在周日晚上举行了赞美诗歌唱礼拜。"},{"en":"The hymn-singing group practiced every week.","zh":"这个赞美诗歌唱小组每周排练。"}]}],"synonyms":["hymnody","carol-singing","worship singing","congregational singing","chanting"],"phonetic":"/ˈhɪm ˌsɪŋɪŋ/","extraExplanation":["在英语里，hymn 通常指基督教传统中的“赞美诗”（常见于 hymnbook/ hymnal 赞美诗集），而 song 更泛指“歌曲”。hymn-singing 往往带有集体参与（congregation）的氛围。","常见搭配：hymn-singing service（赞美诗礼拜/诗歌崇拜）、hymn-singing tradition（唱诗传统）、a hymn-singing congregation（唱诗的会众）。"],"etymology":"复合词：hymn（赞美诗，源自希腊语 hymnos，意为“赞歌”）+ singing（歌唱）。用连字符 hymn-singing 常见于书面表达，表示“唱赞美诗（这类歌唱）”。","mnemonic":["把它拆开记：hymn（赞歌）+ singing（唱）= “唱赞歌”。","联想中文场景：教堂里大家一起“唱诗”（赞美诗）= hymn-singing。"]}
{"word":"hymn-studying","summary":{"en":"connected with learning or analyzing hymns.","zh":"与学习或研读赞美诗相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(modifier) related to studying hymns (religious songs), especially as part of worship, choir practice, or religious education.","zh":"（作定语）与学习/研读赞美诗（宗教圣歌）有关的，常见于礼拜、合唱排练或宗教教育语境。"},"examples":[{"en":"She attends a hymn-studying group every Wednesday evening.","zh":"她每周三晚上参加一个研读赞美诗的小组。"},{"en":"The church organized a hymn-studying workshop to explain the lyrics and history.","zh":"教会组织了一场赞美诗研习工作坊，讲解歌词与历史。"},{"en":"I brought a notebook for hymn-studying notes during choir rehearsal.","zh":"我带了笔记本，在合唱排练时做赞美诗学习笔记。"}]}],"synonyms":["hymn study","hymn-learning","hymn analysis","hymn class"],"phonetic":"/hɪm ˈstʌdiɪŋ/","extraExplanation":["“hymn”在英语文化中通常指基督宗教传统中的会众或合唱所唱的宗教歌曲；在不同宗派与场景里也可能指更广义的宗教圣歌。","写作上常见两种：hymn studying（作名词短语）与 hymn-studying（作定语形容词，放在名词前更常用连字符）。"],"etymology":"由 hymn（赞美诗/圣歌）+ studying（学习）构成的连字符复合词。英语里常用“名词 + -ing”并用连字符连接，作形容词来修饰后面的名词（如 hymn-studying group/workshop）。","mnemonic":["把它拆开记：hymn（赞美诗）+ studying（学习）= “在学赞美诗”。连字符提示它常用来“修饰名词”。","联想中文“赞美诗研读/赞美诗学习”，看到 group / class / workshop 这类词时，很可能就用 hymn-studying 来作定语。"]}
{"word":"hymnal","summary":{"en":"A hymnal is a collection of hymns, usually used in religious worship; it can also mean “related to hymns.”","zh":"hymnal 指圣诗集（赞美诗歌集），常用于宗教礼拜；也可作形容词表示“与圣诗有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A book (or part of a book) containing hymns—religious songs meant to be sung in worship.","zh":"（常用于宗教礼拜的）赞美诗歌集；圣诗集。"},"examples":[{"en":"She picked up a hymnal and sang along during the service.","zh":"她拿起一本圣诗集，在礼拜中跟着一起唱。"},{"en":"Many churches place hymnals in the pews for everyone to use.","zh":"许多教堂会在长椅上放圣诗集，方便大家使用。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to hymns or the singing of hymns in worship.","zh":"与赞美诗有关的；用于（或涉及）唱圣诗的。"},"examples":[{"en":"The choir chose a hymnal arrangement for the opening song.","zh":"合唱团为开场曲选择了一个圣诗风格的编曲。"}]}],"synonyms":["hymnbook","songbook (religious context)","psalter (related, but more specific)"],"phonetic":"/ˈhɪm.nəl/","extraExplanation":["在英语文化中，hymnal 常指纸质的《圣诗集》，在基督教礼拜中很常见。现代也可能有“digital hymnal（电子圣诗集）”。","hymn（赞美诗）通常是歌本身；hymnal 是收录这些 hymns 的书（或资料集）。"]}
{"word":"hymnals","summary":{"en":"“Hymnals” are books of hymns used for singing, especially in church services.","zh":"“hymnals”指赞美诗集/圣诗歌本，常用于教会礼拜中的歌唱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Books that contain hymns (religious songs) for group singing, often used in churches.","zh":"赞美诗集；圣诗歌本（收录赞美诗的书，常用于教会集体歌唱）"},"examples":[{"en":"The church kept hymnals in the pews for everyone to use.","zh":"教会把赞美诗集放在长椅上，方便大家使用。"},{"en":"She opened the hymnal to the first song and began to sing softly.","zh":"她把赞美诗集翻到第一首歌，轻声唱了起来。"},{"en":"Some hymnals include music notes as well as the lyrics.","zh":"有些赞美诗集不仅有歌词，还包含乐谱。"}]}],"synonyms":["hymn books","songbooks"],"phonetic":"/ˈhɪmnəlz/","extraExplanation":["“Hymnal”是可数名词，复数是“hymnals”。通常指基督教礼拜中使用的歌本，但也可泛指收录宗教圣歌/赞美诗的书。","使用场景上，“hymnal”常与church（教会）、choir（合唱团）、pew（教堂长椅）、service（礼拜）等词一起出现。","在英语文化中，经典赞美诗（hymns）常与共同体礼拜、节日（如Christmas/Christmas carols）和仪式感相关；不同教派或地区可能使用不同版本的hymnals。"]}
{"word":"hymnaria","summary":{"en":"Hymnaria is a rare term meaning hymn collections or hymn books, often seen in scholarly or church-history writing.","zh":"hymnaria 是较罕见的词，指“赞美诗集/赞美诗书”，多见于学术或教会历史写作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Collections of hymns or hymn books (a rare plural form, often used in scholarly or church-history contexts).","zh":"赞美诗集；赞美诗书（较少见的复数形式，多用于学术或教会历史语境）。"},"examples":[{"en":"The researcher compared medieval hymnaria from different monasteries.","zh":"研究者比较了不同修道院的中世纪赞美诗集。"},{"en":"Several hymnaria were preserved in the cathedral library.","zh":"大教堂图书馆保存了几部赞美诗书。"}]}],"synonyms":["hymnals","hymnbooks","hymn collections"],"phonetic":"/hɪmˈnɛriə/","extraExplanation":["“hymnaria”在英文里非常罕见，常被当作拉丁化用法，通常可理解为“hymnary / hymnal（赞美诗集）”的复数或“hymnarium”的复数。","在礼仪与教会音乐研究中，hymnaria 往往指不同版本的赞美诗汇编手稿或书籍，用来比较文本、曲调与传统差异。"]}
{"word":"hymnaries","summary":{"en":"“Hymnaries” means hymnbooks—collections of hymns used especially in church worship.","zh":"“hymnaries”指赞美诗歌本（赞美诗集），尤指教会礼拜中使用的诗歌集。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) collections of hymns, especially books used in church services; hymnbooks.","zh":"（复数）赞美诗集；（尤指教会礼拜用的）赞美诗歌本。"},"examples":[{"en":"The choir director bought new hymnaries for the church.","zh":"合唱团指挥为教会买了新的赞美诗歌本。"},{"en":"Different hymnaries include different versions of the same hymn.","zh":"不同的赞美诗集可能收录同一首赞美诗的不同版本。"}]}],"synonyms":["hymnals","hymnbooks","collections of hymns"],"phonetic":"/ˈhɪmˌnɛriz/","extraExplanation":["“hymnary”在现代英语里相对少见，更常见的说法是“hymnal”（赞美诗歌本）。在一些宗派或出版传统中仍会用“hymnary”，其复数就是“hymnaries”。","常见搭配：church hymnary/hymnal（教会赞美诗歌本）、official hymnary（官方选定的赞美诗集）、compile a hymnary（编纂赞美诗集）。"]}
{"word":"hymnarium","summary":{"en":"A rare word meaning a hymnal—a book/collection of hymns used in worship.","zh":"较少见的词，指“圣诗集/赞美诗集”（hymnal），用于礼拜的赞美诗汇编。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a book or collection of hymns (songs of praise), used especially in Christian worship; a hymnal.","zh":"（尤指基督教礼拜中使用的）赞美诗集；圣诗集。"},"examples":[{"en":"The choir rehearsed from the hymnarium before Sunday service.","zh":"合唱团在周日礼拜前用赞美诗集排练。"},{"en":"In the monastery library, an old hymnarium lay beside prayer books.","zh":"在修道院图书馆里，一本古老的赞美诗集放在祈祷书旁。"}]}],"synonyms":["hymnal","songbook","psalter"],"phonetic":"/hɪmˈnɛriəm/","extraExplanation":["“hymnarium”较少见，更常用的英语是 “hymnal”。它来自拉丁语构词方式：hymn-（赞美诗）+ -arium（表示“用于……的地方/容器/集合”的后缀），因此含义是“赞美诗的汇编/集合”。","在历史语境中，这个词常见于宗教研究、教会音乐史或对中世纪/修道院手稿的描述；现代日常英语里通常不用它。"]}
{"word":"hymnariunaria","summary":{"en":"“hymnariunaria” isn’t a standard English word; it likely points to “hymnarium” (a collection/book of hymns).","zh":"“hymnariunaria”不是标准英语词；很可能是指“hymnarium”（赞美诗集/圣诗集）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. This looks like a misspelling; the closest common term is “hymnarium,” meaning a book/collection of hymns used in church services.","zh":"不是标准英语单词。看起来像拼写错误；最接近的常见词是“hymnarium”，指教会礼拜中使用的赞美诗集/圣诗集。"},"examples":[{"en":"I couldn’t find “hymnariunaria” in any dictionary—did you mean “hymnarium”?","zh":"我在词典里找不到“hymnariunaria”——你是不是想写“hymnarium”？"},{"en":"The choir uses a hymnarium to choose hymns for Sunday services.","zh":"合唱团使用一本圣诗集来挑选主日礼拜要唱的赞美诗。"}]}],"synonyms":["hymnal","hymn book","songbook (church)"],"phonetic":"/hɪmˈnɛriəm/","extraExplanation":["“hymnarium”源自拉丁语教会传统用语，常见于礼仪/教会音乐语境中；在日常英语里，人们更常说“hymn book”或“hymnal”（圣诗集）。","如果你想表达的是某首“赞美诗/圣歌”，最常用的词是“hymn”。如果你告诉我你想表达的语境（宗教礼拜、音乐、书名、还是人名/用户名），我可以帮你确认正确拼写与用法。"]}
{"word":"hymnary","summary":{"en":"A hymnary is a book or collected set of hymns, often used in church.","zh":"hymnary 指赞美诗集/圣诗集，常用于教会礼拜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a book or collection of hymns (songs of praise), especially for use in church services","zh":"赞美诗集；圣诗集（尤指教会礼拜中使用的赞美诗歌本或诗歌合集）"},"examples":[{"en":"The choir practiced from the church hymnary before Sunday service.","zh":"诗班在周日礼拜前用教会的赞美诗集练习。"},{"en":"She found her favorite hymn in an old hymnary on the shelf.","zh":"她在书架上一本旧的赞美诗集中找到了自己最喜欢的赞美诗。"}]}],"synonyms":["hymnal","hymn book","songbook (church)"],"phonetic":"/ˈhɪmnəri/","extraExplanation":["“hymnary”在现代英语中相对少见，更常见的词是“hymnal”（赞美诗歌本）。不过“hymnary”仍可用来表示“赞美诗的合集/汇编”，语感偏正式或带一点古典、宗教出版物的味道。","词根来自“hymn（赞美诗）+ -ary（表示集合/场所/相关之物）”，因此可理解为“收录赞美诗的书/集子”。"]}
{"word":"hymnbook","summary":{"en":"A hymnbook is a book of hymns used for singing in religious services, especially in churches.","zh":"hymnbook 指收录赞美诗的书，常用于教会礼拜时一起唱诗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A book containing hymns (religious songs of praise), often used in church services.","zh":"赞美诗集；圣诗本（收录宗教赞美诗的书，常用于教会礼拜）。"},"examples":[{"en":"Please turn to hymn 23 in the hymnbook.","zh":"请翻到赞美诗集里的第23首。"},{"en":"She found an old hymnbook in the church library.","zh":"她在教会图书馆里发现了一本旧的赞美诗集。"}]}],"synonyms":["hymnal","songbook (religious)"],"phonetic":"/ˈhɪmˌbʊk/","extraExplanation":["hymnbook 常见于基督教文化语境：礼拜时会用它来一起唱诗（congregational singing）。有些教会现在改用投影屏幕或电子版，但 hymnbook 仍是很传统、也很有仪式感的物件。","在文学作品中，hymnbook 有时象征“信仰、传统、共同记忆或安慰”。例如描写葬礼、复活节、圣诞节等场景时，作者可能提到翻开 hymnbook 来营造氛围。"]}
{"word":"hymnbooks","summary":{"en":"“Hymnbooks” means books of hymns used for singing in religious worship.","zh":"“hymnbooks”指用于宗教礼拜唱诗的赞美诗歌本/圣诗集。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Books containing hymns (religious songs) that people sing in worship services.","zh":"赞美诗歌本；圣诗集（用于礼拜中合唱/吟唱的宗教歌曲合集）。"},"examples":[{"en":"The church hands out hymnbooks at the door before the service starts.","zh":"礼拜开始前，教堂会在门口发放赞美诗歌本。"},{"en":"We sang from the hymnbooks during Sunday worship.","zh":"我们在周日礼拜时照着圣诗集唱诗。"}]}],"synonyms":["hymnals","psalmbooks","songbooks"],"phonetic":"/ˈhɪmˌbʊks/","extraExplanation":["“Hymnbook”常见于基督教语境，指收录赞美诗（hymns）的书。不同宗派或教会可能使用不同版本，里面常按主题、节期（如圣诞、复活节）或编号来编排，方便会众一起翻到同一首。","在一些教会里，传统纸质hymnbooks逐渐被投影歌词或电子版取代，但“hymnbook”仍是很常用的词。"]}
{"word":"hymned","summary":{"en":"“Hymned” means sang a hymn, or (literary) praised something in a song-like way.","zh":"“hymned”表示“唱赞美诗/圣歌”；也可作文学化用法，表示“歌颂、赞颂”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “hymn”: to sing a hymn (a religious song of praise), often in worship.","zh":"“hymn”的过去式/过去分词：唱圣歌（赞美诗），常用于宗教礼拜中。"},"examples":[{"en":"The congregation hymned quietly as the service began.","zh":"礼拜开始时，会众轻声唱起了圣歌。"},{"en":"They hymned a familiar song of praise at the funeral.","zh":"在葬礼上，他们唱了一首熟悉的赞美诗。"}]},{"partOfSpeech":"vt.","definition":{"en":"to praise or celebrate someone or something in a song-like or poetic way (literary).","zh":"以歌唱般或诗意的方式赞颂、歌颂（较文学化用法）。"},"examples":[{"en":"Poets have long hymned the beauty of the sea.","zh":"诗人们长期以来歌颂大海之美。"},{"en":"The article hymned her courage during the crisis.","zh":"那篇文章歌颂了她在危机中的勇气。"}]}],"synonyms":["sang","chanted","praised","extolled","celebrated"],"phonetic":"/hɪmd/","extraExplanation":["“hymn”原本指宗教赞美诗（常见于基督教传统），因此“to hymn”最自然的语境是礼拜、教堂合唱、宗教仪式等；引申义才是“歌颂/颂扬”，多见于文学或较正式的表达。","拼写小提示：动词“hymn”的过去式/过去分词直接加 -ed，但因为词尾是辅音群“mn”，读音通常简化成类似 /hɪmd/（m+n 的 n 不明显）。"]}
{"word":"hymner","summary":{"en":"“Hymner” means a person who writes hymns; it’s a rare, old-fashioned word.","zh":"“hymner”指写圣诗/赞美诗的人，是较少见、略显旧式的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes hymns; a hymn writer (rare, somewhat old-fashioned).","zh":"写圣诗/赞美诗的人；圣诗作者（较少用、略显旧式）。"},"examples":[{"en":"Isaac Watts is often called a great hymner in English-speaking church history.","zh":"艾萨克·瓦茨在英语教会历史中常被称为伟大的圣诗作者。"},{"en":"The book includes poems by well-known hymners of the 18th century.","zh":"这本书收录了18世纪一些知名圣诗作者的作品。"}]}],"synonyms":["hymn writer","hymnographer","composer (of hymns)"],"phonetic":"/ˈhɪmnər/","extraExplanation":["“hymner”在现代英语中不太常见，更常用的说法是 hymn writer（圣诗作者）或 hymnographer（圣诗创作者/圣诗作者，偏正式）。","词根 hymn（圣歌/赞美诗）+ -er（做某事的人）。注意拼写：hymn 里有不发音的 n，因此读音是 /hɪm/，hymner 读作 /ˈhɪmnər/。"]}
{"word":"hymnic","summary":{"en":"Hymnic means related to hymns or having a hymn-like, reverent praising style.","zh":"hymnic 指与赞美诗有关，或具有赞美诗般庄严、虔敬、颂扬的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hymn (a religious song of praise) or written in the style of a hymn—often formal, reverent, and praising.","zh":"与“圣歌/赞美诗”有关的；或具有赞美诗风格的——常带有庄严、虔敬、颂扬的语气。"},"examples":[{"en":"The choir performed a hymnic piece to open the service.","zh":"合唱团用一首带有赞美诗风格的作品为礼拜开场。"},{"en":"His hymnic language praised nature as if it were sacred.","zh":"他用近似赞美诗的语言歌颂自然，仿佛自然是神圣的。"},{"en":"The poem has a hymnic tone, full of gratitude and awe.","zh":"这首诗带有赞美诗般的语气，充满感恩与敬畏。"}]}],"synonyms":["hymnal","devotional","reverent","solemn","laudatory"],"phonetic":"/ˈhɪmnɪk/","extraExplanation":["“hymnic”来自“hymn（赞美诗/圣歌）”。它既可指直接与宗教赞美诗有关，也常被用来形容一种“像赞美诗那样”的表达方式：用庄严、崇敬、歌颂的语气来赞美上帝、自然、英雄或某种理想。","语域上较偏正式与文学性，常见于音乐评论、诗歌/文学评论或宗教语境。相关词：hymn（n. 赞美诗），hymnal（n./adj. 赞美诗集；赞美诗的）。"]}
{"word":"hymning","summary":{"en":"“Hymning” means singing hymns, or the act of hymn-singing, usually in a religious context.","zh":"“hymning”指唱赞美诗，或赞美诗吟唱这一行为，常用于宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of singing hymns; hymn-singing (often in a religious setting)","zh":"唱赞美诗；吟唱圣歌（常见于宗教场合）"},"examples":[{"en":"The church was filled with quiet hymning before the service began.","zh":"礼拜开始前，教堂里充满了轻声的赞美诗吟唱。"},{"en":"They found comfort in evening hymning and prayer.","zh":"他们在夜晚的赞美诗吟唱与祷告中得到安慰。"}]},{"partOfSpeech":"vi.","definition":{"en":"singing hymns (present participle of “hymn”)","zh":"唱赞美诗（动词 hymn 的现在分词）"},"examples":[{"en":"She sat by the piano, hymning softly.","zh":"她坐在钢琴旁，轻声唱着赞美诗。"},{"en":"The group walked down the road, hymning as they went.","zh":"一群人沿路走着，一边走一边唱着赞美诗。"}]}],"synonyms":["singing hymns","hymn singing","chanting (in a religious sense)"],"phonetic":"/ˈhɪmnɪŋ/","extraExplanation":["“hymning”在现代英语里不算常见，更常见的说法是“singing hymns”或名词短语“hymn singing”。在文学或较正式/宗教氛围的描写中，作者可能会用“hymning”来营造安静、庄重或抚慰人心的画面。"]}
{"word":"hymnist","summary":{"en":"A hymnist is usually someone who writes hymns; less commonly, it can mean someone who sings hymns.","zh":"hymnist 通常指“赞美诗作者”；较少情况下也可指“唱赞美诗的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes hymns (religious songs of praise), especially for use in worship","zh":"赞美诗作者；圣歌作者（创作宗教赞美诗，常用于礼拜）"},"examples":[{"en":"Isaac Watts is often called a famous English hymnist.","zh":"艾萨克·沃茨常被称为著名的英国赞美诗作者。"},{"en":"The church honored the local hymnist for her new hymnbook.","zh":"教会表彰了那位本地赞美诗作者，感谢她的新赞美诗集。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who sings hymns, especially as part of a worship service (less common)","zh":"唱赞美诗的人（较少见，尤指在礼拜中）"},"examples":[{"en":"The hymnist began the first verse, and everyone joined in.","zh":"领唱者先起了第一句，随后大家一起合唱。"}]}],"synonyms":["hymn writer","composer","songwriter"],"phonetic":"/ˈhɪmnɪst/","extraExplanation":["“hymnist”来自“hymn（赞美诗）+ -ist（从事者）”。现代英语里更常用来指“写赞美诗的人”。如果要强调“带领会众唱诗/领唱”，更常见的说法是“song leader”或“choir director”。","在英语文化语境中，“hymn”通常指基督教传统中的宗教赞美诗；写作者有时也会被称为“hymn writer”。"]}
{"word":"hymnists","summary":{"en":"Hymnists are people involved in writing, composing, or singing hymns.","zh":"hymnists 指从事圣诗（赞美诗）写作、谱曲或演唱的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who write, compose, or perform hymns (religious songs of praise); hymn writers or hymn singers.","zh":"写作、谱曲或演唱圣诗（赞美诗）的人；圣诗作者或圣诗演唱者。"},"examples":[{"en":"Many hymnists of the 18th century wrote songs that are still sung today.","zh":"许多18世纪的圣诗作者写下的歌曲至今仍在被传唱。"},{"en":"The choir invited local hymnists to lead the congregation in singing.","zh":"合唱团邀请当地的圣诗演唱者带领会众一起唱诗。"}]}],"synonyms":["hymn writers","hymn composers","hymn singers","psalmists","choristers"],"phonetic":"/ˈhɪmnɪsts/","extraExplanation":["“hymnist”由“hymn（圣诗/赞美诗）+ -ist（从事者）”构成，常见于基督教礼拜、诗歌与音乐史的语境中。它既可指“写圣诗的人”（如作词/作曲者），也可泛指“以圣诗为主要演唱或研究对象的人”，具体含义常看上下文。"]}
{"word":"hymnless","summary":{"en":"“Hymnless” means “without hymns,” often describing an event or setting where hymn singing is absent.","zh":"“hymnless”表示“没有赞美诗的”，常用来形容缺少唱赞美诗的场合或氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without hymns; lacking hymn singing or a hymn-like spirit (often describing a service, gathering, or atmosphere).","zh":"没有赞美诗的；缺乏唱赞美诗或“赞美诗般”氛围的（常形容礼拜、聚会或气氛）。"},"examples":[{"en":"Because of the power outage, the church held a hymnless service.","zh":"因为停电，教会举行了一场没有唱赞美诗的礼拜。"},{"en":"The memorial felt hymnless and quiet, focusing on spoken memories instead of music.","zh":"追思会显得没有赞美诗、很安静，重点放在口述回忆而不是音乐上。"}]}],"synonyms":["without hymns","unmusical (in context)","songless (approx.)"],"phonetic":"/ˈhɪmləs/","extraExplanation":["“hymnless”由 hymn（赞美诗）+ -less（“没有……的”）构成。它不算常用词，多见于文学或较正式的描写，用来强调一种“缺少宗教/庄严歌唱”的感觉。","在英语里，-less 常用于构成形容词：hopeless（无望的）、careless（粗心的）、speechless（说不出话的）等。"]}
{"word":"hymnlike","summary":{"en":"“Hymnlike” means having the solemn, reverent, song-like quality of a hymn.","zh":"“hymnlike”指具有赞美诗那种庄重、虔敬、如歌般的特质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hymn in style; sounding solemn, reverent, and often song-like (as if meant for worship or praise).","zh":"像赞美诗的；带有庄重、虔敬、如歌般（仿佛用于礼拜或赞颂）的风格。"},"examples":[{"en":"The poem’s hymnlike rhythm makes it feel like a prayer.","zh":"这首诗像赞美诗一样的节奏让它读起来像祈祷。"},{"en":"Her hymnlike voice filled the church with calm.","zh":"她那如赞美诗般的声音让教堂充满宁静。"},{"en":"The film ends with hymnlike music that suggests hope.","zh":"电影以如赞美诗般的音乐收尾，暗示希望。"}]}],"synonyms":["hymnal","reverent","solemn","devotional","chantlike"],"phonetic":"/ˈhɪmˌlaɪk/","extraExplanation":["“hymnlike”由 hymn（赞美诗）+ -like（像……的）构成，常用于文学评论或音乐描写，强调一种庄严、虔敬、带有宗教仪式感的气氛。","它不一定表示“真的来自宗教”，也可以比喻性地形容语言或旋律具有“赞美、颂歌、祈祷”那种抬高情绪与道德/精神意味的效果。"]}
{"word":"hymnode","summary":{"en":"“Hymnode” is a rare word meaning a hymn writer; many times people actually mean “hymnody.”","zh":"“hymnode”是罕见词，指赞美诗作者；很多情况下写的人其实想表达“hymnody”（赞美诗传统/作品总称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A person who writes or composes hymns; a hymn writer.","zh":"（罕见/古用）圣歌（赞美诗）的作者；写赞美诗的人。"},"examples":[{"en":"Isaac Watts is often remembered as a major English hymnode.","zh":"艾萨克·瓦茨常被认为是重要的英国赞美诗作者。"},{"en":"The church honored the hymnode for creating songs the congregation could easily sing.","zh":"教会表彰了这位赞美诗作者，因为他创作了会众容易传唱的歌曲。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling or mistaken form sometimes used for “hymnody” (the practice or body of hymns).","zh":"有时被误写成“hymnody”（指赞美诗传统/赞美诗作品总称）。"},"examples":[{"en":"If you meant the tradition of hymns, the usual word is “hymnody,” not “hymnode.”","zh":"如果你想表达“赞美诗传统/赞美诗总称”，常用词是“hymnody”，不是“hymnode”。"}]}],"synonyms":["hymnwriter","hymnist","hymnographer"],"phonetic":"/ˈhɪmˌnoʊd/","extraExplanation":["“hymnode”并不是现代英语里常见的标准词，更常见的是：\n- hymnwriter：赞美诗作者（通俗）\n- hymnist：写/唱赞美诗的人（语境较广）\n- hymnographer：赞美诗作者（较正式）\n如果你能告诉我你看到它的句子，我可以帮你判断这里到底想用哪个词。"]}
{"word":"hymnodic","summary":{"en":"Related to hymns or hymn-like style.","zh":"与圣诗/赞美诗相关；具有圣诗风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hymns (religious songs of praise) or to the writing, style, or tradition of hymns.","zh":"与圣诗/赞美诗有关的；（尤指）与圣诗的创作、风格或传统有关的。"},"examples":[{"en":"The choir studied hymnodic texts from the 18th century.","zh":"合唱团研读了18世纪的圣诗文本。"},{"en":"Her hymnodic style uses simple language and strong rhythm.","zh":"她的圣诗式风格用词朴素、节奏感很强。"}]}],"synonyms":["hymnal","hymnlike","liturgical","devotional"],"phonetic":"/hɪmˈnɑːdɪk/","extraExplanation":["hymnodic 是较少见、偏书面或学术的词，常用于讨论宗教音乐、圣诗文本、或“像圣诗一样的”写作风格（庄重、赞美、节奏感强）。","相关常用词：hymn（圣诗）、hymnody（圣诗创作/圣诗集/圣诗传统，名词）、hymnal（圣诗集，名词；圣诗的，形容词）。"],"etymology":"源自 hymn（圣诗、赞美诗）与后缀 -odic（“……风格的/……性质的”，常见于 melodic 等）。整体含义为“具有圣诗特征的；与圣诗相关的”。","mnemonic":["拆分记忆：hymn（圣诗）+ -odic（像……风格的）→ “圣诗风格的”。","联想 melodic（旋律优美的）：hymnodic 就是“像圣诗那样（有敬拜/赞美气质）的”。"]}
{"word":"hymnodical","summary":{"en":"Hymnodical means “related to hymns or hymn-style writing and music.”","zh":"hymnodical 意为“与赞美诗或赞美诗风格的写作与音乐有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hymns (religious songs of praise) or the writing, style, or tradition of hymns.","zh":"与赞美诗（宗教颂歌）有关的；指赞美诗的写作、风格或传统。"},"examples":[{"en":"The choir performed a hymnodical arrangement of the melody.","zh":"合唱团演唱了这段旋律的赞美诗风格改编版本。"},{"en":"Her research focuses on hymnodical language in early American churches.","zh":"她的研究聚焦于美国早期教会中的赞美诗语言。"}]}],"synonyms":["hymnic","hymnodic","hymnlike","sacred (in musical context)"],"phonetic":"/hɪmˈnɑdɪkəl/","extraExplanation":["“hymnodical”较少见，更常见的形容词是“hymnic”或“hymnodic”。三者都可表示“与赞美诗有关的”，但在学术语境（如音乐学、宗教学、文学研究）里会更常用到。","词根来自“hymn”（赞美诗）与表示“……的/……性质的”的形容词后缀“-ical”。与“hymnody”（赞美诗的创作与传统）常一起出现。"]}
{"word":"hymnodies","summary":{"en":"Hymnodies means hymns in general or the tradition/collections of writing and singing hymns.","zh":"hymnodies 指“赞美诗（总称）”，也可指创作与吟唱赞美诗的传统，或不同体系的赞美诗作品集合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hymns in general, or the art/tradition of writing, singing, or collecting hymns (religious songs of praise).","zh":"（总称）赞美诗；或指创作、吟唱、整理赞美诗的传统与艺术。"},"examples":[{"en":"The choir rehearsed hymnody for Sunday’s service.","zh":"合唱团为周日礼拜排练赞美诗。"},{"en":"The book surveys English hymnody from the 1700s to today.","zh":"这本书概述了18世纪至今的英国赞美诗传统。"}]},{"partOfSpeech":"n.","definition":{"en":"Specific collections or bodies of hymns (often in different styles or periods).","zh":"（复数）不同风格或不同时期的一组组赞美诗（作品集合）。"},"examples":[{"en":"The library holds hymnodies from various Protestant traditions.","zh":"图书馆收藏了来自不同新教传统的赞美诗集。"},{"en":"Scholars compare early Christian hymnodies with later ones.","zh":"学者们比较早期基督教赞美诗作品与后期作品。"}]}],"synonyms":["hymns","hymnody","church music","sacred songs"],"phonetic":"ˈhɪm.nə.di","extraExplanation":["“hymnodies”是“hymnody”的复数形式，在学术写作里常用来指“多套/多传统的赞美诗体系或作品集合”。在日常英语中，更常见的说法是“hymns”（赞美诗）或“church hymns”（教会赞美诗）。"]}
{"word":"hymnodist","summary":{"en":"A hymnodist is someone who writes hymns (religious songs of praise).","zh":"hymnodist 指“圣诗/赞美诗的作者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes hymns (religious songs of praise, especially in Christian worship).","zh":"圣诗作者；赞美诗作家（尤指基督教礼拜中用于赞美的诗歌作者）。"},"examples":[{"en":"Fanny Crosby is a famous hymnodist who wrote hundreds of hymns.","zh":"范妮·克罗斯比是一位著名的圣诗作者，创作了数百首赞美诗。"},{"en":"The church honored the hymnodist whose lyrics shaped its worship for generations.","zh":"教会表彰了那位圣诗作者，他的歌词影响了几代人的敬拜方式。"}]}],"synonyms":["hymn writer","hymnographer"],"phonetic":"/ˈhɪm.nə.dɪst/","extraExplanation":["“hymn”指“赞美诗/圣诗”，常见于基督教传统；“-odist”是表示“从事某种创作或表演的人”的后缀（类似“melodist”等），因此 hymnodist 就是“写赞美诗的人”。","近义词对比：hymn writer（更日常直白）、hymnographer（较书面/学术）、psalmist（更偏“诗篇作者/吟诵诗篇的人”，语境不同）。"]}
{"word":"hymnody","summary":{"en":"Hymnody means the tradition, collection, or the writing/study of hymns used in worship.","zh":"hymnody 指礼拜中使用的赞美诗的传统与体系，也可指赞美诗的创作与研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The writing, composing, or study of hymns (religious songs of praise), especially for use in worship.","zh":"赞美诗写作；圣诗创作与研究（尤指用于礼拜崇拜的宗教赞美歌曲）。"},"examples":[{"en":"She researched eighteenth-century hymnody for her thesis.","zh":"她的论文研究了18世纪的赞美诗写作与传统。"},{"en":"The church’s hymnody includes both traditional and modern songs.","zh":"这间教会的赞美诗曲目既有传统诗歌也有现代歌曲。"}]},{"partOfSpeech":"n.","definition":{"en":"A body or collection of hymns from a particular tradition, period, or community.","zh":"（某一传统、时期或群体的）赞美诗集；赞美诗曲目体系。"},"examples":[{"en":"African American hymnody has strongly influenced gospel music.","zh":"非裔美国人的赞美诗传统深刻影响了福音音乐。"},{"en":"The choir performed pieces drawn from early English hymnody.","zh":"合唱团演唱了选自早期英国赞美诗传统的作品。"}]}],"synonyms":["hymn writing","hymn tradition","sacred song repertoire"],"phonetic":"/ˈhɪm.nə.di/","extraExplanation":["“hymnody”常用于学术或宗教音乐语境，语气比“hymns”（赞美诗）更正式，强调“传统/体系”或“创作与研究”。","词形来源：hymn（赞美诗）+ -ody（表示“诗歌/作品集/写作”的后缀），类似于“melody（旋律）”的构词感觉。","相关词：hymnbook（赞美诗集）、hymnal（赞美诗歌本/赞美诗集，常作名词）、hymn writer（赞美诗作者）、sacred music（圣乐）。"]}
{"word":"hymnograher","summary":{"en":"A hymnographer is someone who writes hymns (religious songs of praise).","zh":"hymnographer 指创作圣诗/赞美诗的人（赞美诗作者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) A hymnographer is a person who writes hymns (religious songs of praise), especially for Christian worship.","zh":"（常见拼写错误）hymnographer 指“圣诗作者/赞美诗作者”，尤其指为基督教礼拜创作赞美诗的人。"},"examples":[{"en":"Isaac Watts is often called a famous hymnographer because he wrote many well-known church hymns.","zh":"艾萨克·沃茨常被称为著名的 hymnographer（赞美诗作者），因为他写了许多广为人知的教会圣诗。"},{"en":"The choir director introduced the hymnographer before the service began.","zh":"礼拜开始前，合唱团指挥介绍了这位 hymnographer（赞美诗作者）。"}]}],"synonyms":["hymn writer","hymnist"],"phonetic":"/hɪmˈnɑɡrəfər/","extraExplanation":["你输入的 “hymnograher” 少了一个字母 **p**，正确拼写是 **hymnographer**。","构词提示：**hymn**（圣诗/赞美诗）+ **-grapher**（写作者）。拼写时注意中间的 **-ngrapher** 连在一起。","使用场景：这个词在现代日常英语里不算常见，更常见的说法是 **hymn writer**（赞美诗作者）或更广义的 **songwriter**（歌曲作者），但在宗教或历史语境中用 **hymnographer** 很自然。"]}
{"word":"hymnographer","summary":{"en":"A hymnographer is someone who writes hymns (religious songs), often for worship.","zh":"hymnographer 指“赞美诗作者/圣诗作者”，即创作宗教赞美诗（常用于礼拜）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes hymns (religious songs of praise), especially for use in worship services.","zh":"赞美诗作者；圣诗作者（创作宗教赞美诗，常用于礼拜/崇拜仪式的人）。"},"examples":[{"en":"The hymnographer wrote new lyrics for the church choir to sing on Easter Sunday.","zh":"这位赞美诗作者为教会合唱团创作了新歌词，好在复活节主日演唱。"},{"en":"In the program notes, the hymnographer explained the meaning behind the hymn’s words.","zh":"在节目说明中，赞美诗作者解释了这首赞美诗歌词背后的含义。"}]}],"synonyms":["hymn writer","hymnist"],"phonetic":"/ˌhɪmˈɡræfər/","extraExplanation":["词源提示：hymn（赞美诗）+ -grapher（写作者）。-grapher 常见于“biographer（传记作者）”“cartographer（制图师）”等词，表示“从事写作/记录的人”。","语境区别：hymnwriter（赞美诗作者）更日常；hymnographer 更正式、学术或教会传统语境中常见，尤其谈到历史上的圣诗传统时会用到。","文化背景：在基督教传统中，hymnographer 往往不仅写“押韵好听”的歌词，也会关注神学含义与礼拜仪式的使用场景（节期、主题、会众可唱性等）。"]}
{"word":"hymnography","summary":{"en":"Hymnography means the writing or study of hymns (religious songs), especially in Christian worship.","zh":"hymnography 指赞美诗（圣诗）的创作或研究，尤与基督教礼拜相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The writing, composing, or scholarly study of hymns (religious songs of praise), especially for Christian worship.","zh":"赞美诗创作／圣诗写作；（对）赞美诗的研究，尤指基督教礼拜中的圣诗。"},"examples":[{"en":"She is researching early Byzantine hymnography for her thesis.","zh":"她正在为论文研究早期拜占庭的圣诗创作传统。"},{"en":"Medieval hymnography shaped how people learned theology through singing.","zh":"中世纪的圣诗创作影响了人们通过歌唱学习神学的方式。"}]}],"synonyms":["hymn writing","hymnody (close, but not identical)","hymn studies"],"phonetic":"/ˌhɪmˈnɑɡrəfi/","extraExplanation":["词源提示：hymnography = hymn（赞美诗）+ -graphy（书写、记录、写作/学科）。因此它既可指“写赞美诗这门技艺”，也可指“研究赞美诗的学科”。","使用场景：在日常英语里较少见，更常出现在宗教学、音乐学、历史或文学研究中。普通表达里，人们更常说 hymn writing（写赞美诗）或 hymn studies（赞美诗研究）。","文化背景：不同传统中的 hymnography 可能指向不同的礼拜与音乐体系，例如东正教常提到“拜占庭圣咏/圣诗传统”，天主教与新教也各有自己的圣诗体裁与著名作者。"]}
{"word":"hymnologic","summary":{"en":"Hymnologic means “related to hymns or the study of hymns.”","zh":"hymnologic表示“与赞美诗或赞美诗研究有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to hymns (religious songs of praise) or to the study of hymns.","zh":"与赞美诗（宗教颂歌）有关的；或与赞美诗研究有关的。"},"examples":[{"en":"The library has a small hymnologic collection of early church songbooks.","zh":"这座图书馆有一小批与赞美诗相关的馆藏，包括早期教会的诗歌集。"},{"en":"Her hymnologic research focuses on how melodies changed over time.","zh":"她的赞美诗研究聚焦于旋律如何随时间演变。"}]}],"synonyms":["hymnological","hymn-related","liturgical (in some contexts)"],"phonetic":"/ˌhɪm.nəˈlɑː.dʒɪk/","extraExplanation":["“hymnologic”较少见，更常见的说法是“hymnological”（赞美诗学的）或名词“hymnology”（赞美诗学/赞美诗研究）。","词根hymn-来自“hymn”（赞美诗）；后缀-log(ic)与“study/words（研究/学说）”有关，常见于biologic,ologic等词。"]}
{"word":"hymnological","summary":{"en":"Hymnological means “related to the study or analysis of hymns.”","zh":"hymnological 指“与赞美诗（圣诗）的研究或分析有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the study, writing, history, or analysis of hymns (religious songs of praise).","zh":"与赞美诗（圣诗）的研究、写作、历史或分析有关的；赞美诗学的。"},"examples":[{"en":"She wrote a hymnological article about how melodies shaped worship in the 1800s.","zh":"她写了一篇赞美诗学的文章，讨论19世纪旋律如何塑造礼拜。"},{"en":"The library has a hymnological collection of old hymnbooks and commentaries.","zh":"这座图书馆收藏了一批赞美诗学资料，包括古老的圣诗集和评注。"}]}],"synonyms":["hymn-related","hymn-studying","liturgical-music-related"],"phonetic":"/ˌhɪm.nəˈlɑː.dʒɪ.kəl/","extraExplanation":["“hymnological”来自 hymn（赞美诗）+ -logical（与……学/研究有关）。它多用于学术或教会音乐研究语境，比常见的“hymn”更正式。","常见相关词：hymnology（n. 赞美诗学）、hymnbook/hymnal（n. 圣诗集）、liturgical music（礼仪音乐）。","使用场景通常包括：神学、教会史、音乐学、礼拜学（worship studies）。日常对话里更常说“about hymns”或“church hymns”。"]}
{"word":"hymnologically","summary":{"en":"Hymnologically means ‘from the perspective of hymnology’—the study or analysis of hymns.","zh":"hymnologically 指“从赞美诗学/赞美诗研究的角度来看”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to hymnology (the study, history, or analysis of hymns).","zh":"以赞美诗学（研究、历史或分析赞美诗的学科）的角度；从赞美诗学上。"},"examples":[{"en":"Hymnologically, this song belongs to the 19th-century gospel tradition.","zh":"从赞美诗学角度看，这首歌属于19世纪的福音诗歌传统。"},{"en":"The hymn can be discussed hymnologically (its tune and text) or theologically (its message).","zh":"这首赞美诗既可以从赞美诗学角度（曲调与歌词）讨论，也可以从神学角度（信息）讨论。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a manner suitable for writing, editing, or evaluating hymns as hymns (their lyrics, meter, melody, and use in worship).","zh":"以“作为赞美诗来写作/编辑/评估”的方式（关注歌词、格律、旋律与礼拜使用）。"},"examples":[{"en":"The editor revised the text hymnologically, keeping the meter so it could be sung easily.","zh":"编辑以赞美诗写作的标准来修订歌词，保留格律，方便会众歌唱。"},{"en":"Hymnologically careful wording avoids awkward stresses when sung.","zh":"从赞美诗写作角度看，用词要谨慎，避免演唱时重音别扭。"}]}],"synonyms":["from a hymnology perspective","in hymnological terms","with respect to hymnology"],"phonetic":"/ˌhɪm.nəˈlɑː.dʒɪ.kli/","extraExplanation":["“hymnologically”来自“hymnology（赞美诗学）+ -ically”。它多见于学术或教会音乐写作中，用来说明讨论的角度是“赞美诗作为一种体裁”的层面（例如：歌词来源、格律、曲调类型、礼拜中的使用），而不只是一般的音乐评论或神学讨论。"]}
{"word":"hymnologist","summary":{"en":"A hymnologist is a scholar who studies hymns and their history and use in worship.","zh":"hymnologist 指研究赞美诗及其历史与礼拜使用的学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies hymns (religious songs of praise), especially their history, lyrics, and how they are used in worship.","zh":"赞美诗学者；研究圣诗（赞美诗）的人，尤指研究其历史、歌词与礼拜中的使用方式。"},"examples":[{"en":"The hymnologist explained why a 19th-century hymn became popular across different churches.","zh":"这位赞美诗学者解释了为什么一首19世纪的赞美诗会在不同教会中广受欢迎。"},{"en":"She is a hymnologist who compares the wording of hymns in different hymnals.","zh":"她是一位赞美诗学者，会比较不同赞美诗歌本中圣诗的措辞。"}]}],"synonyms":["hymn scholar","hymn researcher","hymn specialist"],"phonetic":"/hɪmˈnɑlədʒɪst/","extraExplanation":["“hymnologist”由 hymn（赞美诗）+ -ologist（研究……的人）构成，常见于神学、教会音乐（church music）、礼仪研究（liturgy）等领域。","在英语语境中，hymnologist 往往不只是“会唱赞美诗的人”，而是更偏向学术研究：追溯作者与时代背景、文本版本差异、曲调来源、以及在敬拜中的功能与影响。"]}
{"word":"hymnology","summary":{"en":"Hymnology is the academic study of hymns and their history, music, and role in worship.","zh":"hymnology 指对赞美诗及其历史、音乐与礼拜功能的学术研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study of hymns (religious songs of praise), including their history, authors, music, and use in worship.","zh":"赞美诗学；圣诗学：研究赞美诗（宗教颂歌）的学科，包括其历史、作者、音乐形式以及在礼拜中的使用。"},"examples":[{"en":"She wrote her thesis in hymnology, focusing on how hymns shaped community worship.","zh":"她的论文研究赞美诗学，重点探讨赞美诗如何塑造群体敬拜。"},{"en":"A course in hymnology can cover both the lyrics and the melodies of church hymns.","zh":"赞美诗学课程可能同时讲歌词与教会赞美诗的旋律。"}]}],"synonyms":["study of hymns","hymn studies"],"phonetic":"/hɪmˈnɑlədʒi/","extraExplanation":["“hymnology”由 hymn（赞美诗）+ -ology（……学/……研究）构成，常见于神学、宗教学、音乐学与礼拜学相关语境。","与 hymnology 相关的常见词：hymnal（赞美诗集）、hymnody（赞美诗创作/赞美诗传统，强调“写作与演唱的实践或传统”而非“学术研究”）。"]}
{"word":"hymns","summary":{"en":"“Hymns” are songs of praise, usually religious, but can also mean any song/poem that strongly celebrates something.","zh":"“hymns”指赞美之歌，通常是宗教圣歌，也可泛指歌颂某人或某事的赞歌/颂歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A song of praise or worship, especially one sung in a religious service (often Christian).","zh":"赞美诗；圣歌（尤指在宗教礼拜中唱的，常见于基督教传统）"},"examples":[{"en":"The congregation sang hymns at the beginning of the service.","zh":"会众在礼拜开始时唱了赞美诗。"},{"en":"She learned many hymns from her grandmother.","zh":"她从外祖母那里学会了许多圣歌。"}]},{"partOfSpeech":"n.","definition":{"en":"A song or poem that expresses strong praise for a person, idea, or country (not necessarily religious).","zh":"颂歌；赞歌（对人、理念或国家等的热烈赞美，不一定宗教性质）"},"examples":[{"en":"The poem is a hymn to nature and quiet living.","zh":"这首诗是一曲献给大自然与宁静生活的赞歌。"},{"en":"The book reads like a hymn to friendship.","zh":"这本书读起来像是在歌颂友谊。"}]}],"synonyms":["psalms","carols","chants","songs of praise","odes"],"phonetic":"/hɪmz/","extraExplanation":["“hymns”是“hymn”的复数。英语里“hymn”常与教堂、合唱、礼拜等场景关联；在文学中也常用作比喻，表示“对某事物的赞颂”。","常见搭配：sing hymns（唱圣歌）、a hymn to + 名词（对……的赞歌，如 a hymn to freedom）。","文化提示：不同宗教与传统都有类似“赞美歌/圣歌”的作品；英语语境里“hymn”最常让人联想到基督教会的会众合唱与管风琴伴奏。"]}
{"word":"hymnwise","summary":{"en":"“Hymnwise” means “in a hymn-like way” or “as related to hymns.”","zh":"“hymnwise”表示“以赞美诗的方式/风格”或“就赞美诗而言”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to hymns; in the style or manner of a hymn (especially about wording, structure, or singing).","zh":"以圣歌（赞美诗）相关的方式；以圣歌的风格/形式（尤指措辞、结构或演唱方式）。"},"examples":[{"en":"The melody is simple and hymnwise, easy for a whole congregation to sing.","zh":"这段旋律很简单，有赞美诗的风格，整个会众都容易跟着唱。"},{"en":"He rewrote the poem hymnwise so it could be used in church.","zh":"他把那首诗按赞美诗的方式改写，好在教会里使用。"}]}],"synonyms":["hymnlike","in hymn form","in a hymn-like style"],"phonetic":"/ˈhɪmˌwaɪz/","extraExplanation":["“hymnwise”比较少见，多见于音乐/宗教语境或编辑评论中，用来表达“从赞美诗的角度/按照赞美诗的形式”。","后缀“-wise”常表示“以……方式”或“就……而言”（如：clockwise 顺时针；likewise 同样地；moneywise 就钱而言）。因此“hymnwise”直观含义就是“在赞美诗风格/层面上”。","在更正式或更常见的表达里，也可以用：“in hymn form / in a hymn-like style / in terms of hymns”。"]}
{"word":"hymnwriter","summary":{"en":"a person who composes hymns","zh":"创作赞美诗的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes hymns (religious songs of praise, often used in worship)","zh":"赞美诗作者；圣诗作词/作曲者（创作用于礼拜或敬拜的宗教歌曲）"},"examples":[{"en":"Many churches still sing hymns written by 18th-century hymnwriters.","zh":"许多教会至今仍在唱18世纪赞美诗作者创作的圣诗。"},{"en":"She became a hymnwriter after joining the choir and studying scripture poetry.","zh":"她加入诗班并学习经文诗歌后，开始创作赞美诗。"}]}],"synonyms":["hymnist","songwriter","composer","lyricist"],"phonetic":"/ˈhɪmˌraɪtər/","extraExplanation":["hymnwriter 通常强调“创作赞美诗的作者”，可能写歌词、也可能写旋律（有时两者都做）。如果只强调写歌词，也可说 hymnist（更少见）或 lyricist（更泛指）。"],"etymology":"由 hymn（赞美诗、圣诗）+ writer（作者）构成的复合词，字面义就是“写赞美诗的人”。在英语里也常见写法 hymn writer（分开写）或 hyphenated 的 hymn-writer。","mnemonic":["拆开记：hymn（赞美诗）+ writer（作者）= 写赞美诗的人。","联想中文：‘圣诗’的‘作者’——看到 writer 就想到“写的人”。"]}

