{"word":"hyo","summary":{"en":"“Hyo” is not a common English word; it’s usually the romanized Korean 효, meaning “filial piety,” or a name syllable.","zh":"“hyo”不是常见英文词；多为韩语“효”的拼写，意为“孝（孝道）”，或作为人名音节出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/rare item in English; most often seen as a romanization of Korean “효 (hyo),” meaning “filial piety” (respect and care for one’s parents/elders), or as a syllable in Korean names.","zh":"英语里并非常见词；最常见是韩语“효（hyo）”的罗马拼写，意思是“孝（孝道）”，也常作为韩语人名中的一个音节。"},"examples":[{"en":"In Korean culture, “hyo” (효) emphasizes caring for parents and respecting elders.","zh":"在韩国文化中，“hyo”（효）强调赡养父母、尊敬长辈。"},{"en":"Her name includes the syllable “Hyo,” which can be written in different Chinese characters (hanja) depending on the meaning.","zh":"她的名字里有音节“Hyo”，具体含义会因所用汉字（韩文称“汉字/hanja”）不同而变化。"}]}],"synonyms":["filial piety","respect for parents"],"phonetic":"/hjoʊ/","extraExplanation":["“Hyo/효”对应的“孝”在东亚文化里常与儒家伦理相关，但在现代语境中也可以更宽泛地理解为对家人负责、关怀长辈。","如果你是在查英文缩写，“HYO”也可能出现在机构名、用户名或品牌名中；这类情况通常没有固定词典释义，需要结合上下文判断。"]}
{"word":"hyo-epiglottic","summary":{"en":"connected with the hyoid bone and the epiglottis.","zh":"与舌骨和会厌相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone and the epiglottis (often referring to the ligament connecting them).","zh":"与舌骨和会厌有关的（常指连接两者的舌骨会厌韧带）。"},"examples":[{"en":"The surgeon identified the hyo-epiglottic ligament before making the incision.","zh":"外科医生在切开前先确认了舌骨会厌韧带。"},{"en":"Swallowing involves coordinated movement of structures in the hyo-epiglottic region.","zh":"吞咽需要舌骨会厌区域相关结构的协调运动。"}]}],"synonyms":["hyoepiglottic"],"phonetic":"ˌhaɪoʊˌɛpɪˈɡlɑtɪk","extraExplanation":["写法上常见两种：hyo-epiglottic（带连字符）与 hyoepiglottic（不带连字符）。在医学文献中两者通常指同一概念，具体以教材或期刊风格为准。"],"etymology":"源自两个解剖词根的组合：hyo-（来自 hyoid，指“舌骨”）+ epiglottic（来自 epiglottis，指“会厌”）。用来表示“两者之间/与两者相关”。","mnemonic":["把它拆开记：hyo = 舌骨（hyoid），epi-glottic = 会厌/声门上方；合起来就是“舌骨—会厌相关”。","联想“hyo（像‘嗨哟’用力）抬起舌骨、会厌下盖保护气道”，帮助记住它和吞咽动作有关。"]}
{"word":"hyo-sternal","summary":{"en":"related to the hyosternum or to hyoid-and-sternum structures","zh":"与舌胸骨部（hyosternum）或舌骨—胸骨结构相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyosternum (a bony plate/region of the plastron in turtles and some other reptiles).","zh":"（动物解剖/动物学）与“舌胸骨板/舌胸骨部（hyosternum）”有关的；尤指龟类腹甲（plastron）中的一块骨板/区域。"},"examples":[{"en":"In many turtles, the hyosternal region helps support the front half of the plastron.","zh":"在许多龟类中，舌胸骨部（hyosternal region）有助于支撑腹甲的前半部分。"},{"en":"The specimen shows clear sutures between the hyosternal and hyposternal plates.","zh":"该标本显示舌胸骨板与下胸骨板（hyposternal）之间有清晰的骨缝。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally, relating to the hyoid (tongue) structures and the sternum (breastbone).","zh":"（更广义）与舌骨（hyoid）结构和胸骨（sternum）相关的。"},"examples":[{"en":"The paper discusses hyosternal connections in the throat-and-chest anatomy of the species.","zh":"论文讨论了该物种咽喉与胸部解剖中的舌—胸相关（hyosternal）连接。"}]}],"synonyms":["sternal","hyoid"],"phonetic":"/ˌhaɪoʊˈstɝːnəl/","extraExplanation":["hyosternum 常见于龟类解剖：腹甲（plastron）由多块骨板组成，常见命名包括 epiplastron、hyoplastron（= hyosternum 所指区域在不同资料中命名可能有差异）、hypoplastron、xiphiplastron 等。不同教材/论文的分区与术语可能不完全一致，阅读时可对照图示。"],"etymology":"由前缀 hyo-（来自希腊语，意为“与舌骨/舌有关”）+ sternal（“胸骨的”）构成；在动物学中也常用于指与龟类腹甲中的 hyosternum（舌胸骨部）相关的结构。","mnemonic":["hyo- 联想“舌(喉)相关”(= 舌骨 hyoid)，sternal 联想“胸骨/胸口”(= sternum)；合起来就是“舌/喉—胸”的解剖关系。","记成“hyo ≈ 嗓(喉)哟，sternal ≈ 胸骨”，帮助把部位定位到“喉部+胸部/腹甲骨板”。"]}
{"word":"hyobranchial","summary":{"en":"Hyobranchial means “related to the hyoid region and the gill arches,” mainly used in zoology/anatomy; it can also name a specific bone element in that region.","zh":"hyobranchial 指“与舌骨区域和鳃弓有关的”，主要用于动物学/解剖学；也可指该区域中的某块舌鳃骨（骨片）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid (tongue-supporting) region and the branchial (gill) arches, especially in fish and other vertebrates.","zh":"与舌骨（支撑舌头的骨区）和鳃弓（与鳃相关的骨/软骨结构）有关的，尤用于鱼类等脊椎动物的解剖学描述。"},"examples":[{"en":"In many fish, the hyobranchial skeleton supports the gills and parts of the throat.","zh":"在许多鱼类中，舌鳃（hyobranchial）骨骼系统支撑鳃以及咽喉的一些结构。"},{"en":"The researcher compared hyobranchial elements across species to study feeding evolution.","zh":"研究者比较不同物种的舌鳃相关骨片，以研究摄食方式的演化。"}]},{"partOfSpeech":"n.","definition":{"en":"A hyobranchial bone or element (one of the small bones/cartilages in the hyoid–gill-arch region), especially in fish anatomy.","zh":"舌鳃骨（或舌鳃骨片）：指舌骨—鳃弓区域的一块小骨/软骨结构，尤见于鱼类解剖。"},"examples":[{"en":"The specimen had an unusually shaped hyobranchial.","zh":"该标本的舌鳃骨形态异常。"}]}],"synonyms":["hyoid and branchial (related to)","branchial (context-dependent)","hyoid (context-dependent)"],"phonetic":"/ˌhaɪoʊˈbræŋkiəl/","extraExplanation":["这是一个比较专业的解剖学/动物学术语，常见于鱼类学、比较解剖学和古生物学论文中。日常英语里很少用。","词源可拆分理解：hyo-（与舌骨 hyoid 有关）+ branchial（与鳃 gills/鳃弓有关）。因此它描述的是“舌骨—鳃弓”这一解剖区域或其中的骨片。"]}
{"word":"hyocholalic","summary":{"en":"Echolalic means automatically repeating other people’s words or sounds.","zh":"Echolalic 指不由自主地重复他人的话或声音（回声式模仿）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to echolalia: the automatic repeating of another person’s words or sounds.","zh":"与“回声言语（模仿性重复）”有关的：不由自主地重复他人说过的话或声音。"},"examples":[{"en":"The therapist noted echolalic speech during the session.","zh":"治疗师注意到他在会谈中出现了回声式言语。"},{"en":"Some children go through an echolalic stage while learning language.","zh":"有些孩子在学习语言时会经历一个回声式模仿的阶段。"}]}],"synonyms":["imitative","repetitive","echoing"],"phonetic":"ˌɛkoʊˈlælɪk","extraExplanation":["你输入的“hyocholalic”不是常见英语单词，较可能是拼写误差，想写的是 **echolalic**（形容词）或 **echolalia**（名词：回声言语）。","**Echolalic** 常出现在语言发展、特殊教育或临床语境中；在日常英语里较少用。注意：描述真实个体时，尽量用中性、尊重的表达（如“echolalic speech”），避免把特征当作标签。"]}
{"word":"hyocholic","summary":{"en":"“Hyocholic” isn’t a standard English word. You probably mean “alcoholic,” meaning “containing alcohol” or “a person addicted to alcohol.”","zh":"“hyocholic” 不是标准英语词；你可能想写 “alcoholic”，意思是“含酒精的/与酒精有关的”或“酒精成瘾者（酗酒者）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to alcohol; containing alcohol","zh":"与酒精有关的；含酒精的"},"examples":[{"en":"This is an alcoholic drink, so you must be 21 to buy it in the U.S.","zh":"这是含酒精的饮料，所以在美国你必须年满21岁才能购买。"},{"en":"They serve both alcoholic and nonalcoholic options.","zh":"他们提供含酒精和不含酒精的选择。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who has an alcohol use disorder; someone addicted to alcohol","zh":"酒精成瘾者；酗酒者（有酒精使用障碍的人）"},"examples":[{"en":"He’s a recovering alcoholic and hasn’t had a drink in years.","zh":"他是一名戒酒中的酒精成瘾者，已经多年没喝酒了。"},{"en":"Alcoholics often need medical and emotional support to recover.","zh":"酒精成瘾者通常需要医疗和情感支持来康复。"}]}],"synonyms":["boozy","intoxicating","inebriating","a person with alcohol use disorder (AUD)"],"phonetic":"/ˌælkəˈhɑlɪk/","extraExplanation":["“hyocholic” 不是常见或标准的英语单词；你可能想写的是 **alcoholic**（最常见）、或 **alcohol**（酒精）。","如果你想表达“酒精成瘾者”，在正式或更尊重的语境中也常说 **a person with alcohol use disorder (AUD)**，比直接说 *an alcoholic* 更强调“人”而非标签。"]}
{"word":"hyoepiglottic","summary":{"en":"An anatomy term meaning “related to the hyoid bone and the epiglottis,” often referring to the hyoepiglottic ligament.","zh":"解剖学术语，意为“与舌骨和会厌相关的”，常指舌骨会厌韧带等结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone and the epiglottis (a flap of cartilage in the throat), especially describing structures that connect them.","zh":"与舌骨和会厌（喉咙里的一块软骨“盖子”）有关的；尤指连接二者的结构。"},"examples":[{"en":"The surgeon identified the hyoepiglottic ligament during the procedure.","zh":"外科医生在手术中辨认出了舌骨会厌韧带。"},{"en":"Swallowing involves movement of several hyoepiglottic structures.","zh":"吞咽过程中会牵涉到多个舌骨会厌相关结构的运动。"}]}],"synonyms":["(technical) hyoid-epiglottic"],"phonetic":"/ˌhaɪoʊˌɛpɪˈɡlɑtɪk/","extraExplanation":["这个词多见于医学/解剖学语境，日常英语里很少使用。最常见的搭配是 hyoepiglottic ligament（舌骨会厌韧带），指连接舌骨与会厌、在吞咽与保护气道过程中起作用的韧带。","拼写提醒：有时会与其他喉部相关词混淆；如果你想查的是某个具体结构（例如 ligament / fold / muscle），可以把完整词组发我。"]}
{"word":"hyoepiglottidean","summary":{"en":"An anatomical adjective meaning “connected with the hyoid bone and the epiglottis.”","zh":"一个解剖学形容词，表示“与舌骨和会厌有关（尤其指二者的连接）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone and the epiglottis (especially the connection between them, such as the hyoepiglottic ligament).","zh":"（解剖学）与舌骨和会厌有关的；尤指二者之间的连接结构（如舌骨会厌韧带）。"},"examples":[{"en":"The surgeon carefully identified the hyoepiglottidean ligament during the procedure.","zh":"手术中，外科医生仔细辨认了舌骨会厌韧带。"},{"en":"Swallowing involves coordinated movement of hyoepiglottidean structures to protect the airway.","zh":"吞咽时需要舌骨—会厌相关结构的协调运动，以保护气道。"}]}],"synonyms":["hyoepiglottic","hyo-epiglottic"],"phonetic":"/ˌhaɪ.oʊˌɛp.ɪˈɡlɑː.tɪ.di.ən/","extraExplanation":["这是一个非常少见、偏医学文献的形容词，常见的替代表达是 hyoepiglottic（“舌骨会厌的/舌骨—会厌相关的”）。","epiglottis（会厌）是喉部的一块软骨结构，吞咽时会帮助遮挡气道；hyoid bone（舌骨）位于颈部前方，为多块肌肉提供附着点，两者之间的韧带/肌肉对吞咽与发声都很重要。"]}
{"word":"hyoglossal","summary":{"en":"Hyoglossal means related to the hyoglossus muscle or the hyoid-and-tongue area in anatomy/medicine.","zh":"Hyoglossal 指与舌骨舌肌或解剖学中舌骨-舌部相关区域有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the hyoglossus muscle (a tongue muscle connected to the hyoid bone) or the area where the hyoid bone and tongue muscles are involved.","zh":"与舌骨舌肌（连接舌骨与舌头的肌肉）或与舌骨和舌部肌肉相关的部位有关的。"},"examples":[{"en":"The surgeon carefully identified the hyoglossal region before making the incision.","zh":"外科医生在切开之前仔细辨认了舌骨舌肌相关区域。"},{"en":"Pain near the hyoglossal area can sometimes be linked to tongue movement or swallowing.","zh":"舌骨舌肌相关区域附近的疼痛有时与舌头运动或吞咽有关。"}]}],"synonyms":["hyoglossus (related term)","hyoid-and-tongue (descriptive paraphrase)"],"phonetic":"/ˌhaɪoʊˈɡlɔsəl/","extraExplanation":["“hyoglossal”多见于解剖学与医学语境，常用于描述与“舌骨（hyoid）”和“舌（glossa/tongue）”相关的肌肉或区域。词源可拆为：hyo-（舌骨）+ gloss-（舌/舌头）+ -al（……的）。日常英语中几乎不用，主要在医学报告、教材或手术记录中出现。"]}
{"word":"hyoglossi","summary":{"en":"Hyoglossi = the paired hyoglossus muscles that connect the hyoid bone to the tongue and help move the tongue.","zh":"Hyoglossi 指左右成对的舌骨舌肌，连接舌骨与舌头，帮助舌头运动（如下压、后缩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, plural) the hyoglossus muscles—paired tongue muscles that run from the hyoid bone to the side of the tongue and help move the tongue (especially lowering and pulling it back).","zh":"（解剖学，复数）舌骨舌肌（hyoglossus muscles）——一对从舌骨延伸到舌侧的肌肉，主要帮助舌头下压并向后牵引。"},"examples":[{"en":"During dissection, the student identified the hyoglossi on both sides of the tongue.","zh":"在解剖过程中，学生辨认出了舌头两侧的舌骨舌肌（hyoglossi）。"},{"en":"The surgeon avoided damaging the hyoglossi while working near the floor of the mouth.","zh":"外科医生在处理口底附近时避免损伤舌骨舌肌（hyoglossi）。"}]}],"synonyms":["hyoglossus muscles","hyoglossus (plural)"],"phonetic":"ˌhaɪoʊˈɡlɑːsaɪ","extraExplanation":["“hyoglossi”常见于解剖或医学语境，可理解为“hyoglossus（舌骨舌肌）的复数形式”，强调左右两条肌肉。","词源可拆为：hyo-（舌骨，hyoid）+ gloss-（舌头，tongue）。","若你原本想查的是“hyoglossus”（单数/词典常用词头），也可以告诉我，我可以一并给出更常见的词条形式与用法。"]}
{"word":"hyoglossus","summary":{"en":"Hyoglossus is a tongue muscle connecting the hyoid bone to the tongue, helping lower and retract the tongue.","zh":"Hyoglossus（舌骨舌肌）连接舌骨与舌，帮助舌向下并稍向后运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thin muscle of the tongue that runs from the hyoid bone to the side of the tongue; it helps pull the tongue downward and slightly backward (important in swallowing and speech).","zh":"舌骨舌肌：一块较薄的舌肌，从舌骨连到舌的侧面；主要作用是使舌向下并略向后拉（对吞咽和发音很重要）。"},"examples":[{"en":"The surgeon identified the hyoglossus to avoid injuring nearby nerves during the procedure.","zh":"外科医生辨认出舌骨舌肌，以避免在手术中损伤附近的神经。"},{"en":"When you depress the tongue, the hyoglossus can contribute to that movement.","zh":"当你把舌头向下压时，舌骨舌肌会参与这种运动。"}]}],"synonyms":["tongue muscle (general)","hyoglossal muscle"],"phonetic":"/ˌhaɪoʊˈɡlɔsəs/","extraExplanation":["词源：hyō- 来自 “hyoid（舌骨）”，-glossus 来自希腊语 glōssa（舌）。字面意思就是“与舌骨相连的舌肌”。","解剖学小提示：舌骨舌肌属于“外舌肌”（extrinsic tongue muscles），与 genioglossus（颏舌肌）、styloglossus（茎突舌肌）、palatoglossus（腭舌肌）一起协同控制舌的位置与形态。"]}
{"word":"hyoglycocholic","summary":{"en":"Hyoglycocholic means “related to a bile acid found especially in pigs,” and is mainly used in scientific contexts.","zh":"hyoglycocholic 指“与一种主要见于猪的胆汁酸有关的”，主要用于生物化学/医学等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hyoglycocholic acid, a bile acid (a substance in bile) found especially in pigs.","zh":"与“猪甘氨胆酸（hyoglycocholic acid）”有关的；指一种胆汁酸（胆汁中的物质），尤其常见于猪。"},"examples":[{"en":"The paper measured hyoglycocholic compounds in pig bile samples.","zh":"这篇论文测量了猪胆汁样本中的 hyoglycocholic 化合物。"},{"en":"Hyoglycocholic acid is studied to understand differences among animal bile acids.","zh":"研究 hyoglycocholic acid 有助于理解不同动物胆汁酸的差异。"}]}],"synonyms":["hyoglycocholic acid–related","porcine bile acid–related"],"phonetic":"/ˌhaɪ.oʊˌɡlaɪ.koʊˈkɑː.lɪk/","extraExplanation":["词源提示：hyo- 表示“猪/与猪有关”（源自希腊语，常见于生物学术语）；-cholic 与“胆汁/胆酸”有关；glyco- 在这里与“甘氨酸结合（glycine-conjugated）”相关。整体多用于生物化学与医学文献。"]}
{"word":"hyoid","summary":{"en":"Hyoid: a small U-shaped bone in the neck that supports the tongue and is important for swallowing and speech.","zh":"hyoid（舌骨）：颈部前方的一块U形小骨，支撑舌头，并参与吞咽与发声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, U-shaped bone in the front of the neck that supports the tongue and helps with swallowing and speech.","zh":"舌骨：位于颈部前方的一块小型“U”形骨头，用来支撑舌头，并参与吞咽与发声。"},"examples":[{"en":"The doctor checked the patient’s hyoid bone after the neck injury.","zh":"颈部受伤后，医生检查了病人的舌骨。"},{"en":"The hyoid helps stabilize the tongue during swallowing.","zh":"舌骨在吞咽时帮助稳定舌头。"}]}],"synonyms":["hyoid bone"],"phonetic":"/ˈhaɪɔɪd/","extraExplanation":["“hyoid”来自希腊语，意思是“像字母U（希腊字母upsilon）形状的”。","舌骨很特别：它不像大多数骨头那样与其他骨头直接关节相连，而是主要通过肌肉和韧带“悬挂”在颈部，因此与吞咽、说话等动作密切相关。","常见搭配：hyoid bone（舌骨）、hyoid fracture（舌骨骨折）。在医学/法医学语境中可能会提到舌骨骨折与颈部受力有关。"]}
{"word":"hyoid-and-chin","summary":{"en":"the neck-and-jawfront area involving the hyoid bone and the chin","zh":"涉及舌骨与下巴的颈前—下颌前部区域"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"relating to or involving the hyoid bone (in the neck) and the chin area; used as a label for a region, measurement, or technique focusing on the underside of the jaw and front of the neck","zh":"与舌骨（颈部的一块骨头）和下巴区域有关；常作标签用于描述下颌下方与颈前部的区域、测量或相关操作/训练"},"examples":[{"en":"The surgeon marked the hyoid-and-chin region before the procedure.","zh":"手术前，外科医生在舌骨与下巴区域做了标记。"},{"en":"Pain in the hyoid-and-chin area can make swallowing uncomfortable.","zh":"舌骨与下巴一带的疼痛会让吞咽变得不舒服。"},{"en":"This exercise targets the muscles between the hyoid and the chin.","zh":"这个练习主要锻炼舌骨与下巴之间的肌肉。"}]}],"synonyms":["submental region","under-chin area","hyoid region"],"phonetic":"ˈhaɪɔɪd ən tʃɪn","extraExplanation":["“hyoid”指“舌骨”，位置在下颌骨（下巴下面）与喉部之间，是吞咽和发声相关肌肉的重要“支点”。因此在医学描述里，舌骨与下巴常被放在同一条解剖“线路”里讨论（如下颌下区、颈前区）。","连字符（hyoid-and-chin）常用于把两个名词当作一个整体修饰后面的词：如 hyoid-and-chin region / hyoid-and-chin muscles。若写作 hyoid and chin（无连字符），更像并列两个独立对象。"],"etymology":"“hyoid”来自希腊语，意为“像希腊字母Υ（upsilon）的形状”，指舌骨的形状；“chin”来自古英语，指下巴。“hyoid-and-chin”是现代医学/解剖语境里用连字符把两个部位并列的合成写法。","mnemonic":["记“hyoid”可联想“嗨哟（hyo-）”用力吞咽/发声时颈前会动——舌骨正参与这些动作。","把它当成“舌骨 + 下巴”的组合：看到 and-chin 就知道是在说下巴附近、下颌下方到颈前这一带。"]}
{"word":"hyoid-and-tongue","summary":{"en":"connected with the hyoid bone and the tongue, often in speech or swallowing","zh":"与舌骨及舌头相关（常指发音或吞咽）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone (a small U-shaped bone in the neck) and the tongue, especially in anatomy, speech, or swallowing contexts.","zh":"与舌骨（颈部一块U形小骨）和舌头有关的，常用于解剖、发音或吞咽等语境。"},"examples":[{"en":"The therapist checked hyoid-and-tongue movement during swallowing.","zh":"治疗师在吞咽时检查了舌骨—舌头的运动情况。"},{"en":"Some speech exercises focus on hyoid-and-tongue coordination.","zh":"有些发音训练会重点练习舌骨—舌头的协调。"}]},{"partOfSpeech":"n.","definition":{"en":"A combined area or system involving the hyoid bone and the tongue; used as a convenient label in medical or research writing.","zh":"指包含舌骨与舌头的组合区域/系统；多见于医学或研究写作中作为简化称呼。"},"examples":[{"en":"The study measured the hyoid-and-tongue in different head positions.","zh":"研究在不同头位下测量了舌骨—舌头系统的变化。"},{"en":"In imaging, the hyoid-and-tongue can be hard to separate clearly.","zh":"在影像检查中，舌骨—舌头区域有时不容易清晰分开。"}]}],"synonyms":["hyoid and tongue","hyoid bone and tongue","hyoid-tongue complex"],"phonetic":"/ˈhaɪˌɔɪd ænd tʌŋ/","extraExplanation":["舌骨本身不直接与其他骨头相连，而是通过肌肉和韧带“悬挂”在颈部；它和舌头、喉部一起参与吞咽与发音，所以在临床（如吞咽障碍评估）中常把它们放在同一组来讨论。","这种写法并非固定成语，更像是技术性标签；不同论文或报告里也可能写成 “hyoid and tongue” 或 “hyoid–tongue (complex)” 。"],"etymology":"这是现代医学/解剖写作中的组合式表达：hyoid 来自希腊语，意为“像字母 upsilon (υ) 的形状”，指舌骨的U形；and 连接两个解剖结构；tongue 源自古英语，指“舌头”。连字符用来表示它们作为一个整体概念被讨论。","mnemonic":["记忆：hyoid 听起来像“嗨-哦-一德”，想象喊“嗨哦！”时喉咙上方那块U形“小骨架”在动——这就是舌骨。","联想：吞咽/说话时“舌头动、舌骨也跟着动”，把它们当作一个“联动组”记：hyoid-and-tongue。"]}
{"word":"hyoid-mandibular","summary":{"en":"connected with the hyoid bone and the lower jaw","zh":"与舌骨及下颌相关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone and the mandible (lower jaw), especially describing an anatomical connection, region, or structure between them.","zh":"与舌骨和下颌骨（下颌）相关的，尤指描述两者之间的解剖连接、区域或结构。"},"examples":[{"en":"The report mentioned pain in the hyoid-mandibular region when swallowing.","zh":"报告提到患者吞咽时舌骨-下颌区域出现疼痛。"},{"en":"Some therapies target muscles near the hyoid-mandibular area to improve jaw movement.","zh":"一些治疗会针对舌骨-下颌附近的肌肉，以改善下颌活动。"}]}],"synonyms":["hyomandibular","hyoid and mandibular"],"phonetic":"/haɪˌɔɪd mænˈdɪbjələr/","extraExplanation":["这是医学/解剖学里的复合形容词，常见于影像学报告、手术记录或康复/吞咽与颌面部评估中，用来指“涉及舌骨与下颌之间/两者共同相关”的部位或结构。","临床上更常见的固定搭配可能会写成 “hyomandibular”（不加连字符的合成词）或出现在具体结构名里（例如某些韧带、肌群的描述）。不同教材/科室写法可能略有差异。"],"etymology":"由两部分构成：hyoid（“舌骨的”，源自希腊语 hyoeidēs，意为“像字母Υ形状的”）+ mandibular（“下颌的”，源自拉丁语 mandibula，意为“下颌/咀嚼用的颌骨”）。连字符常用于把两个解剖相关部位并列成一个复合形容词。","mnemonic":["把它拆开记：hyoid = 舌骨（吞咽、发声相关），mandibular = 下颌（咀嚼相关）；两者连在一起就想到“吞咽+下颌附近的连接区域”。","mandibular 和中文“下颌”一起联想：man-di-bu-lar 里有 “bu” 像“部位”的“部”，提示“下颌部位的”。"]}
{"word":"hyoid-mental","summary":{"en":"related to the hyoid bone and the chin","zh":"与舌骨和下巴（颏部）相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or connecting the hyoid bone (a small bone in the neck) and the mentum (the chin).","zh":"与舌骨（颈部的一块小骨）和颏部/下巴（mentum）相关的；连接舌骨与下巴的。"},"examples":[{"en":"The doctor measured the hyoid-mental distance during the airway exam.","zh":"医生在气道评估时测量了舌骨-颏部距离。"},{"en":"Pain was noted in the hyoid-mental region when swallowing.","zh":"吞咽时在舌骨-下巴相关区域出现疼痛。"}]}],"synonyms":["hyomental","hyo-mental"],"phonetic":"/ˌhaɪɔɪdˈmɛn(t)l/","extraExplanation":["临床上常见搭配是 hyomental distance（舌骨-颏部距离）：从下巴（颏点）到舌骨的距离，用于麻醉前评估气道和插管难度。也可能写作 hyomental 或 hyo-mental。"],"etymology":"由 hyoid（舌骨，源自希腊语，因形状像字母 upsilon）+ mental（此处指“颏/下巴”，来自拉丁语 mentum“下巴”）组合而成；在解剖与麻醉/气道评估语境中常见。","mnemonic":["把它拆开记：hyoid=舌骨，mental=下巴（不是“心理”）。所以 hyoid-mental=“舌骨-下巴”相关。"]}
{"word":"hyoid-related","summary":{"en":"connected with the hyoid bone in the neck.","zh":"与颈部舌骨有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the hyoid bone (a small U-shaped bone in the front of the neck that supports the tongue and helps with swallowing and speech).","zh":"与舌骨有关的（舌骨是位于颈前部、呈U形的小骨头，支撑舌头，并参与吞咽与发声）。"},"examples":[{"en":"The doctor noted hyoid-related pain when the patient swallowed.","zh":"病人吞咽时，医生注意到与舌骨相关的疼痛。"},{"en":"Hyoid-related muscles help move the tongue and larynx during speech.","zh":"与舌骨相关的肌肉在说话时帮助移动舌头和喉部。"},{"en":"The report discussed hyoid-related injuries after the accident.","zh":"报告讨论了事故后的舌骨相关损伤。"}]}],"synonyms":["hyoid","hyoidean"],"phonetic":"/ˈhaɪɔɪd rɪˈleɪtɪd/","extraExplanation":["舌骨（hyoid bone）很特别：它不像大多数骨头那样直接与其他骨头形成关节连接，而是主要靠肌肉和韧带“悬挂”在颈部，参与吞咽、发声与维持气道结构。"],"etymology":"“hyoid”来自希腊语，意为“像字母υ（upsilon）一样的”，用来形容舌骨的形状；“-related”表示“与……有关的”。因此该词组字面意思就是“与舌骨有关的”。","mnemonic":["把 hyoid 记成“嗨（hyo-）+ 哟（-oid）”，联想到“嗨哟”是发声用力的声音 → 和发声、吞咽有关的颈部结构。","“-related”=“相关”，整体就是“舌骨相关”。"]}
{"word":"hyoidal","summary":{"en":"“Hyoidal” means “related to the hyoid bone in the neck,” used mostly in medical/anatomy contexts.","zh":"“hyoidal”表示“与颈部的舌骨有关”，多用于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone (a small U-shaped bone in the front of the neck that supports the tongue and is important for swallowing and speech).","zh":"与舌骨有关的；舌骨的（舌骨是位于颈部前方、呈U形的小骨，支撑舌头，并与吞咽和发声有关）。"},"examples":[{"en":"The doctor examined the patient’s hyoidal region for tenderness.","zh":"医生检查了患者舌骨区域是否有压痛。"},{"en":"In anatomy class, we learned how hyoidal muscles help with swallowing.","zh":"在解剖课上，我们学习了舌骨相关肌肉如何帮助吞咽。"}]}],"synonyms":["hyoid","hyoidean"],"phonetic":"/haɪˈɔɪdəl/","extraExplanation":["“hyoidal”多见于医学/解剖学语境，日常英语里更常用“hyoid”（如：the hyoid bone，hyoid muscles）来表达“舌骨的/与舌骨相关的”。","舌骨的一个有趣特点是：它不像大多数骨头那样与其他骨头直接关节相连，而是主要通过肌肉和韧带“悬挂”在颈部，因此与发声与吞咽机制关系密切。"]}
{"word":"hyoidan","summary":{"en":"Hyoid refers to the hyoid bone in the neck, or things related to it.","zh":"hyoid 指颈部的舌骨，或与舌骨相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A U-shaped bone in the neck that supports the tongue and helps with swallowing and speaking.","zh":"（解剖）舌骨：位于颈部、呈“U”形的一块骨头，用来支撑舌头，并参与吞咽与发声。"},"examples":[{"en":"The doctor checked the hyoid bone after the neck injury.","zh":"颈部受伤后，医生检查了舌骨。"},{"en":"Some swallowing problems can involve the movement of the hyoid.","zh":"一些吞咽问题可能与舌骨的运动有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone (often used in anatomy, e.g., “hyoid muscles”).","zh":"（解剖）舌骨的；与舌骨有关的（常见于“hyoid muscles”等搭配）。"},"examples":[{"en":"The hyoid muscles help move the tongue and larynx.","zh":"舌骨肌群有助于带动舌头和喉部运动。"},{"en":"The scan showed inflammation near the hyoid area.","zh":"扫描显示舌骨附近区域有炎症。"}]}],"synonyms":["(adj.) lingual-supporting (less common)","(related term) hyoidean"],"phonetic":"/ˈhaɪɔɪd/","extraExplanation":["你输入的“hyoidan”不是常见英语单词，更可能是拼写误差或把词尾多打了一个“an”。最常见相关词是 **hyoid**（舌骨/舌骨的）。","词源：**hyoid** 来自希腊语，意思是“像字母 upsilon（υ）的形状”，因为舌骨的形状类似于该字母。","相关词：**hyoidean** 也可表示“舌骨的”，但在现代英语里更常用 **hyoid** 作形容词。"]}
{"word":"hyoideal","summary":{"en":"Hyoideal means “related to the hyoid bone” in the front of the neck.","zh":"hyoideal 表示“与颈前的舌骨有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone (a small U-shaped bone in the front of the neck that supports the tongue and helps with swallowing and speech).","zh":"与舌骨有关的；舌骨的（舌骨是颈部前方一块U形小骨，支撑舌头，参与吞咽与发声）。"},"examples":[{"en":"The doctor examined the hyoideal region after the patient reported throat pain.","zh":"病人说喉咙痛后，医生检查了舌骨相关的颈前区域。"},{"en":"In anatomy class, we learned how hyoideal muscles help move the tongue during swallowing.","zh":"在解剖课上，我们学习了舌骨相关肌肉如何在吞咽时帮助舌头运动。"}]}],"synonyms":["hyoid","hyoidean"],"phonetic":"/ˌhaɪ.ɔɪˈdiː.əl/","extraExplanation":["“hyoideal”在现代英语中较少见，更常用的说法是“hyoid”（如：hyoid bone 舌骨）或“hyoid/hyoidean”作形容词。医学或解剖学语境里出现时，通常就是指与舌骨及其周围结构（肌肉、韧带、区域）相关。"]}
{"word":"hyoidean","summary":{"en":"“Hyoidean” means “related to the hyoid bone” in the neck.","zh":"“hyoidean”意为“与颈部的舌骨有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone (a small U-shaped bone in the neck that supports the tongue and helps with swallowing and speech).","zh":"与舌骨有关的；舌骨的（舌骨是颈部一块小的 U 形骨头，支撑舌头，并参与吞咽与发音）。"},"examples":[{"en":"The doctor examined the hyoidean area after the patient reported neck pain.","zh":"病人说脖子疼后，医生检查了与舌骨相关的颈部区域。"},{"en":"In anatomy class, we learned how hyoidean muscles help move the tongue during swallowing.","zh":"在解剖课上，我们学习了舌骨相关的肌肉如何在吞咽时帮助舌头运动。"}]}],"synonyms":["hyoid"],"phonetic":"/haɪˈɔɪdiən/","extraExplanation":["“hyoidean”较少见，更常用的形式是“hyoid”（既可作形容词也可作名词，如 the hyoid bone）。在医学/解剖学语境中，你也可能看到“hyoid”用来修饰肌肉、神经、结构等（例如 hyoid muscles）。","词源来自希腊语，意思大致是“像字母 upsilon（υ）那样的形状”，用来描述舌骨的 U 形外观。"]}
{"word":"hyoides","summary":{"en":"Hyoid: the U-shaped bone in the front of the neck; also an adjective meaning “related to this bone.”","zh":"hyoid：颈部前方的U形舌骨；也可作形容词，表示“与舌骨有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) The hyoid bone: a small U-shaped bone in the front of the neck that supports the tongue and helps with swallowing and speaking.","zh":"（名词）舌骨：位于颈部前方、呈U形的小骨头，用于支撑舌头，并参与吞咽与发声。"},"examples":[{"en":"The doctor checked the patient’s hyoid after the neck injury.","zh":"医生在颈部受伤后检查了患者的舌骨。"},{"en":"In anatomy class, we learned how the hyoid supports the tongue.","zh":"在解剖课上，我们学习了舌骨如何支撑舌头。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Related to the hyoid bone or the area around it.","zh":"（形容词）与舌骨或其周围区域有关的。"},"examples":[{"en":"The scan showed swelling near the hyoid region.","zh":"扫描显示舌骨区域附近有肿胀。"},{"en":"They studied hyoid muscles involved in swallowing.","zh":"他们研究了参与吞咽的舌骨肌群。"}]}],"synonyms":["hyoid bone","lingual support bone (descriptive)"],"phonetic":"/ˈhaɪɔɪd/","extraExplanation":["“hyoides”常见于非英语拼写（例如西班牙语 *hioides*）或是把“hyoid”的复数/变体写法混用。在标准英语里更常用的词形是 **hyoid**（名词或形容词）。","词源来自希腊语 *hyoeides*，意思是“像希腊字母 upsilon（υ）一样的形状”，指舌骨的U形外观。"]}
{"word":"hyoids","summary":{"en":"“Hyoids” means the plural form of “hyoid,” referring to the small U-shaped bone(s) in the neck that support the tongue and help with swallowing and speech.","zh":"“hyoids”是“hyoid（舌骨）”的复数，指颈部支撑舌头并参与吞咽与发声的U形小骨头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hyoid: the small U-shaped bone(s) in the neck that support the tongue and help with swallowing and speaking.","zh":"hyoid（舌骨）的复数：位于颈部、呈U形的小骨头，用来支撑舌头，并参与吞咽与发声。"},"examples":[{"en":"In anatomy class, we learned how the hyoids support the tongue.","zh":"在解剖课上，我们学习了舌骨如何支撑舌头。"},{"en":"Damage near the hyoids can affect swallowing and speech.","zh":"舌骨附近受伤可能影响吞咽和说话。"}]}],"synonyms":["hyoid bones"],"phonetic":"/ˈhaɪɔɪdz/","extraExplanation":["“hyoid”来自希腊语，意思是“像字母 upsilon（Υ）一样”，因为舌骨的形状类似U形。","舌骨很特别：它通常不与其他骨头直接形成关节，而是由肌肉和韧带“悬挂”在颈部，因此在发声与吞咽的肌肉运动中很关键。","在法医学语境中，舌骨（尤其是角部）有时会被提到，因为某些颈部外力可能造成骨折；不过这并不是唯一或必然的判断依据。"]}
{"word":"hyolith","summary":{"en":"an extinct cone-shelled marine animal known from fossils","zh":"一种已灭绝的、圆锥壳的海洋动物化石类群"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct marine invertebrate (order Hyolitha) known only from fossils, typically with a small cone-shaped shell and a lid-like operculum; common in Paleozoic seas, especially from the Cambrian period.","zh":"一种已灭绝的海洋无脊椎动物（海螺类/海螺虫类，Hyolitha 目），仅见于化石；通常有小型圆锥状外壳，并带“盖子”般的厣（operculum）。在古生代海洋中常见，尤其寒武纪化石较多。"},"examples":[{"en":"Hyolith fossils are often found in Cambrian rocks alongside trilobites.","zh":"海螺类化石常与三叶虫一起出现在寒武纪岩层中。"},{"en":"The museum display showed a hyolith’s conical shell and its operculum.","zh":"博物馆展品展示了海螺类的圆锥形外壳和厣。"}]}],"synonyms":["hyolithid"],"phonetic":"/ˈhaɪ.ə.lɪθ/","extraExplanation":["海螺类（hyoliths）长期以来分类位置有争议：过去常被视为软体动物相关类群，近年研究多认为它们可能更接近“腕足动物”一支（如与腕足动物的某些特征相似），但仍属于已灭绝的独特类群。"],"etymology":"来自新拉丁语学名 Hyolithus / Hyolithes（古生物学术语）。后半部分 -lith 源自希腊语 lithos“石”（常用于表示“石、化石、岩石”相关事物）；前半部分 hyo- 的具体来源在资料中有不同解释，通常作为该类群命名构词的一部分保留。","mnemonic":["记 -lith = “石/化石”（如 monolith、lithograph），看到 hyolith 就联想到“某种石头里的古生物化石”。","可把 hyo- 读成“嗨哟”，加上 -lith“石”→“嗨哟！这块石头里有古生物（化石）”。"]}
{"word":"hyolith-associated","summary":{"en":"related to or occurring together with hyolith fossils","zh":"与海管动物化石相关或共现的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to, found with, or involving hyoliths (an extinct group of small marine animals with cone-shaped shells, common in Cambrian fossils).","zh":"与海管动物（hyoliths，一类已灭绝的海洋小型动物，常见锥形壳体寒武纪化石）有关的；与其共生/共现/相关研究的。"},"examples":[{"en":"The team reported a hyolith-associated microbial mat on the seafloor surface.","zh":"研究团队报告了一个与海管动物相关的海底微生物席。"},{"en":"Hyolith-associated fossils were concentrated in fine-grained mudstone layers.","zh":"与海管动物共现的化石主要集中在细粒泥岩层中。"},{"en":"They discussed hyolith-associated communities to reconstruct the Cambrian ecosystem.","zh":"他们讨论与海管动物相关的群落，以重建寒武纪生态系统。"}]}],"synonyms":["hyolith-related","hyolith-linked","hyolithic"],"phonetic":"/ˌhaɪ.əˈlɪθ əˈsoʊ.si.eɪ.tɪd/","extraExplanation":["hyoliths（海管动物）通常指寒武纪常见的一类已灭绝海洋生物，外壳多呈锥形，有时带“盖”（operculum）。文献里常用“X-associated”来表达“与X共现、相关或可能存在生态联系”。"],"etymology":"构词上是“hyolith + associated”。“hyolith”是古生物学术语，来自19世纪对这类寒武纪化石的命名；“associated”表示“相关的/伴随出现的”。整体意思就是“与hyolith有关的”。","mnemonic":["把它拆开记：hyolith（海管动物）+ associated（相关的）＝“和海管动物有关的”。","联想“associate＝建立联系”，看到化石组合里有hyolith，就说hyolith-associated（与它同层/同环境出现）。"]}
{"word":"hyolith-like","summary":{"en":"having a cone-shaped appearance similar to a hyolith fossil","zh":"呈海锥化石般的锥形外观"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hyolith (an extinct Paleozoic marine animal) in shape or appearance, especially having a small cone-like shell.","zh":"外形或外观类似海锥（Hyolith，一类古生代海洋灭绝动物），尤指具有小型锥形壳的。"},"examples":[{"en":"The fossil fragment is hyolith-like, with a narrow conical profile.","zh":"这块化石碎片呈海锥样，轮廓细长呈锥形。"},{"en":"Several hyolith-like shells were recovered from the Cambrian layer.","zh":"在寒武纪地层中发现了几枚海锥样的壳体。"}]}],"synonyms":["hyolithoid","cone-shaped","conical","funnel-shaped"],"phonetic":"ˈhaɪəˌlɪθ laɪk","extraExplanation":["Hyoliths（海锥）是古生代常见的海洋无脊椎动物，通常有一个锥形外壳，并带“盖子”（operculum）。因此在古生物学描述中，hyolith-like 常用来强调“细长锥形、像小号角/小锥壳”的外观，而不一定表示确切分类归属。"],"etymology":"由化石类群名 Hyolith（海锥；古生代海洋动物）+ -like（“像……一样的”）构成，用于形容“具有海锥那样的形态特征”。","mnemonic":["把它拆开记：hyo-lith-like ≈ “像一种化石（lith=石）那样”。看到 -like 就知道是“……一样的/……风格的”。"]}
{"word":"hyolithes","summary":{"en":"Hyolithes is a paleontology genus name for extinct marine animals known from cone-shaped fossil shells.","zh":"Hyolithes是古生物学属名，指以锥形壳化石著称的一类已灭绝海洋动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name used in paleontology for an extinct group of small marine animals (hyoliths) known mainly from cone-shaped fossil shells.","zh":"古生物学中的属名，指一类已灭绝的海洋动物（hyolith，海锥类/海锥动物），主要以锥形壳的化石为人所知。"},"examples":[{"en":"Hyolithes fossils are often found as small, cone-shaped shells in Cambrian rocks.","zh":"在寒武纪地层中，人们常发现Hyolithes的化石，多为小型的锥形壳。"},{"en":"The museum label identified the specimen as Hyolithes sp.","zh":"博物馆标签把该标本标为Hyolithes sp.（Hyolithes属的某种）。"}]}],"synonyms":["hyolith","Hyolithida","fossil hyolith"],"phonetic":"/haɪˈoʊlɪθiz/","extraExplanation":["Hyolithes是拉丁化的科学属名，常见于论文、化石图版和馆藏标签中；在较新的科普或综述里，也常直接用更通用的“hyolith(s)”来指代这一类动物。","Hyolith类动物生活在古生代海洋中（尤其寒武纪较常见），外壳通常呈圆锥状，并可能带有“盖”（operculum，壳口盖）等结构；因此在描述化石时，常会提到“cone-shaped shell（锥形壳）”“operculum（壳口盖）”等词。"]}
{"word":"hyolithid","summary":{"en":"A hyolithid is an extinct marine animal known from fossils, especially common in Cambrian deposits.","zh":"hyolithid 指一种已灭绝的海洋动物，只见于化石中，尤其常见于寒武纪地层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an extinct group of small marine animals (Hyolitha) known only from fossils, typically with a cone-shaped shell and sometimes a lid (operculum).","zh":"一种已灭绝的小型海洋动物类群（Hyolitha，海螺形动物）的成员，仅见于化石；常见特征是锥形外壳，有时带有壳盖（operculum）。"},"examples":[{"en":"Hyolithids are often found in Cambrian rock layers.","zh":"海螺形动物（hyolithids）常见于寒武纪地层中。"},{"en":"The fossil showed a conical shell typical of a hyolithid.","zh":"这块化石显示出典型的海螺形动物那种锥形外壳。"}]}],"synonyms":["hyolith"],"phonetic":"/ˌhaɪoʊˈlɪθɪd/","extraExplanation":["“hyolithid”来自古生物学分类：Hyolitha（海螺形动物门/纲的传统称呼）+ -id（表示“……类/……成员”的后缀）。","它不是日常英语词汇，多出现在博物馆说明、古生物论文或科普文章中；在这些语境里常与 Cambrian（寒武纪）、fossil（化石）、conical shell（锥形壳）等词一起出现。","关于它们与现代哪些动物更接近，学界曾有争论；科普资料可能会随着研究更新而调整表述。"]}
{"word":"Hyolithida","summary":{"en":"an extinct group of cone-shelled marine animals known from fossils","zh":"一种已灭绝的锥形壳海洋动物化石类群"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct order of small, cone‑shaped marine animals (hyoliths) that lived from the Cambrian to the Permian and are known mainly from fossil shells and a lid-like plate (operculum).","zh":"一种已灭绝的海洋动物类群（海百合虫/锥形壳动物“hyoliths”的一个目），外形多为小型锥状壳，主要通过化石壳体与“盖板”（operculum）为人所知，生存年代大致从寒武纪到二叠纪。"},"examples":[{"en":"Hyolithida fossils are common in some Cambrian rock layers.","zh":"在一些寒武纪地层中，Hyolithida 的化石相当常见。"},{"en":"The specimen was identified as Hyolithida based on its conical shell and operculum.","zh":"研究者根据其锥形壳与盖板特征，将该标本鉴定为 Hyolithida。"}]}],"synonyms":["hyoliths","Hyolitha"],"phonetic":"/ˌhaɪ.oʊˈlɪθ.ɪ.də/","extraExplanation":["这是一个古生物学/地质学术语，日常英语中很少出现，常见于论文、博物馆说明牌和地层化石目录。","Hyolithida 常被统称为 hyoliths（hyolith 类群的一部分）。其生态与系统分类在学术上曾有争议，现代研究多依据形态与化石证据进行重建。"],"etymology":"词源来自希腊语：hyo-（与“Hyolith-”相关的构词，用于指代“hyolith/锥形壳化石类群”）+ lithos（石头，表示化石/岩石中的遗存）+ -ida（动物分类学中常见的后缀，用于表示某个“目/类群”）。","mnemonic":["把它拆开记：hyo + lith（lith=石/化石，如 monolith/Neolithic）+ ida（某类群/某一目）→“石头里的某类群化石”。","联想中文“化石在石头里（lith）”，Hyolithida 就是“在石里发现的 hyolith 类群”。"]}
{"word":"hyolithidae","summary":{"en":"Hyolithidae: an extinct family of Cambrian marine animals known from cone-shaped fossils.","zh":"Hyolithidae：已灭绝的寒武纪海洋动物“海林虫”的一个科，以锥形化石为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct marine animals (hyoliths) that lived mainly in the Cambrian period, known from cone-shaped fossils with a lid-like cover (operculum).","zh":"海林虫科：一种已灭绝的海洋动物类群（海林虫的一科），主要生活在寒武纪，以锥形外壳化石及其“盖子”（厣，operculum）为特征。"},"examples":[{"en":"Hyolithidae fossils are common in some Cambrian rock layers.","zh":"在一些寒武纪岩层中，海林虫科的化石很常见。"},{"en":"The museum label described a cone-shaped shell as belonging to Hyolithidae.","zh":"博物馆的说明牌把一个锥形壳化石标为海林虫科。"}]}],"synonyms":["hyoliths (broader group)"],"phonetic":"/ˌhaɪəˈlɪθəˌdiː/","extraExplanation":["“Hyolithidae”是生物分类学里的“科”（family）名称，常见于古生物学文章和化石标注中；在日常英语里很少使用。","海林虫（hyoliths）长期以来分类位置有争议：早期常被当作软体动物相关类群，后来也有人提出与腕足动物（brachiopods）或其近亲有关。读到不同说法时，通常反映的是学界观点更新。","词形上以“-idae”结尾通常表示“科”，发音上多读作“eye-dee”，但具体到不同词会有细微差异。"]}
{"word":"hyolithoid","summary":{"en":"Hyolithoid means ‘hyolith-like’—describing fossils or features resembling the cone-shelled extinct marine animal called a hyolith.","zh":"hyolithoid 指“像海螺形动物（hyolith）的/与其有关的”，常用于描述化石或形态特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hyolith (an extinct small marine animal with a cone-shaped shell), or relating to hyoliths.","zh":"似海螺形动物（hyolith，一种已灭绝的海洋小型动物、常见锥形壳）或与其有关的。"},"examples":[{"en":"The fossil collection includes several hyolithoid shells from the Cambrian period.","zh":"这批化石收藏中包含几件寒武纪的海螺形（hyolithoid）壳体。"},{"en":"Researchers compared hyolithoid fossils with early mollusks to understand ancient marine life.","zh":"研究人员将海螺形（hyolithoid）化石与早期软体动物进行比较，以了解远古海洋生物。"}]}],"synonyms":["hyolith-like","hyolith-associated"],"phonetic":"/ˌhaɪəˈlɪθɔɪd/","extraExplanation":["词源结构：hyolith（海螺形动物的属名/类群名）+ -oid（“……似的/……形的”）。因此 hyolithoid 常用于古生物学与地质学写作，描述“像 hyolith 的形态”或“与 hyolith 有关”。","语域提示：这是非常专业的术语，日常英语几乎不用；多见于论文、博物馆说明文字、或化石鉴定报告中。","相关概念：hyolith 常被描述为有锥形壳，有的种类可能带有“支架/盖板”结构；在分类上曾与软体动物等类群进行过比较与讨论。"]}
{"word":"hyoliths","summary":{"en":"extinct cone-shelled marine fossil animal","zh":"已灭绝的圆锥壳海洋化石动物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct marine animal (known only from fossils) with a small cone-shaped shell, common in early Paleozoic seas, especially the Cambrian.","zh":"一种已灭绝的海洋动物（仅见于化石），有小型圆锥形外壳，常见于古生代早期海洋，尤其是寒武纪。"},"examples":[{"en":"Hyoliths are often found in Cambrian fossil beds.","zh":"Hyoliths 常见于寒武纪化石层中。"},{"en":"The museum displayed a hyolith shell beside trilobite fossils.","zh":"博物馆把一种 hyolith 的外壳化石和三叶虫化石并排展示。"}]}],"synonyms":["hyolithid"],"phonetic":"/ˈhaɪəˌlɪθ/","extraExplanation":["hyoliths 生活在约5亿多年前的海洋里，典型特征是圆锥形壳，以及像“盖子”一样的结构（operculum）。","它们的系统分类长期有争议：外形有点像软体动物的壳，但并不等同于现代贝类；在古生物学文章里常直接用类群名 Hyoliths（或 Hyolitha）来指这一类化石动物。"],"etymology":"源自古生物学命名用的希腊语构词：常解释为 hyalo-（“玻璃”）+ -lith（“石、矿物”）的组合，用来指这种“像小石锥一样的壳体”化石类群名称；后形成单数 hyolith，复数 hyoliths。","mnemonic":["拆词记：-lith 常见于 geology（地质）相关词里表示“石”（如 monolith），所以 hyolith 也与“石化的壳化石”联想。","发音联想：/haɪ/ 像“嗨”，想象在海里“嗨”的小锥形壳生物→海洋化石。"]}
{"word":"hyomandibula","summary":{"en":"Hyomandibula: a jaw-supporting bone in many fishes/amphibians, often discussed as evolutionarily related to the mammalian stapes (a middle-ear bone).","zh":"Hyomandibula：鱼类/两栖类中支撑并连接下颌与颅骨的骨；常用于说明其与哺乳动物中耳“镫骨”在演化上的关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bone in many fishes and amphibians that helps support the jaw and connects it to the skull (part of the hyoid arch).","zh":"（鱼类和两栖类中）一种帮助支撑下颌并将其连接到颅骨的骨（属于舌弓/舌骨弓的一部分）。"},"examples":[{"en":"In many bony fishes, the hyomandibula helps suspend the jaw from the skull.","zh":"在许多硬骨鱼中，hyomandibula（舌颌骨）帮助把下颌悬挂在颅骨上。"},{"en":"The specimen’s hyomandibula was damaged, making the jaw joint hard to study.","zh":"该标本的hyomandibula受损，使得下颌关节难以研究。"}]},{"partOfSpeech":"n.","definition":{"en":"(evolutionary anatomy) the structure that, in mammals, is related to the middle-ear bone called the stapes.","zh":"（演化解剖学）与哺乳动物中耳听小骨“镫骨（stapes）”同源/相关的结构。"},"examples":[{"en":"Some textbooks explain that the mammalian stapes is evolutionarily linked to the hyomandibula.","zh":"一些教材会解释：哺乳动物的镫骨在演化上与hyomandibula有关联。"},{"en":"Comparative anatomy often compares the hyomandibula in fishes with ear structures in mammals.","zh":"比较解剖学常把鱼类的hyomandibula与哺乳动物的耳部结构进行对比。"}]}],"synonyms":["hyomandibular bone"],"phonetic":"/ˌhaɪ.oʊ.mænˈdɪb.jə.lə/","extraExplanation":["这个词多见于动物学、解剖学与古生物学语境，日常英语里很少用。","词形可拆为：hyo-（与舌骨/舌相关）+ mandibula（下颌）。不同教材中文译名可能写作“舌颌骨”或“舌下颌骨”。","在脊椎动物演化讨论中，它常被用来说明“颌支撑结构如何逐步转化为中耳听骨”的经典案例。"]}
{"word":"hyomandibular","summary":{"en":"Hyomandibular describes something related to the hyomandibula, a jaw-supporting bone/cartilage in many fishes (and some amphibians).","zh":"Hyomandibular 指与舌颌骨（鱼类常见、支撑并连接下颌与颅骨的骨/软骨结构）相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Relating to the hyomandibula, a bone or cartilage in many fishes and some amphibians that supports the jaw and connects it to the skull.","zh":"（解剖学）与“舌颌骨/舌颌软骨（hyomandibula）”有关的；该结构见于许多鱼类及部分两栖类，用于支撑下颌并与颅骨相连。"},"examples":[{"en":"In many bony fish, the hyomandibular element helps transmit movement from the skull to the jaw.","zh":"在许多硬骨鱼中，舌颌骨相关结构有助于把颅骨的运动传递到下颌。"},{"en":"The researcher compared hyomandibular structures across different species of fish.","zh":"研究人员比较了不同鱼类物种之间的舌颌骨相关结构。"}]}],"synonyms":["hyoid-mandibular (rare)"],"phonetic":"/ˌhaɪoʊmænˈdɪbjələr/","extraExplanation":["词源可拆解为：hyo-（与舌骨/舌有关）+ mandibular（与下颌有关）。因此它多用于描述“连接/影响舌骨—下颌系统”的结构。","在进化生物学中，hyomandibula 常被讨论为与陆生脊椎动物中听小骨（如镫骨 stapes）演化相关的结构之一；因此 hyomandibular 也常出现在比较解剖与演化的语境里。","该词在日常英语中很少见，主要出现在解剖学、动物学、鱼类学或古生物学论文与教材中。"]}
{"word":"hyomental","summary":{"en":"Hyomental means “connected with the hyoid bone and the chin,” commonly used in medical anatomy (e.g., hyomental distance).","zh":"hyomental 指“与舌骨和下巴（颏部）相关”，常用于医学解剖/临床（如舌骨-颏距）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid bone (in the neck) and the chin (mentum).","zh":"与舌骨（颈部）和下巴（颏部）有关的；舌骨-颏部的。"},"examples":[{"en":"The clinician measured the hyomental distance as part of an airway assessment.","zh":"临床医生测量了舌骨-颏距，作为气道评估的一部分。"},{"en":"A reduced hyomental distance may suggest a potentially difficult intubation.","zh":"舌骨-颏距变短可能提示气管插管困难的风险增加。"}]}],"synonyms":["hyoid-mental","hyoid-and-chin (descriptive)"],"phonetic":"/ˌhaɪ.oʊˈmɛn.təl/","extraExplanation":["“hyomental”是医学/解剖学用语：hyo- 来自 hyoid（舌骨），-mental 来自 mentum（下巴/颏部）。常见搭配是 hyomental distance（舌骨-颏距），在麻醉与急救中用于评估气道。"]}
{"word":"hyoplastral","summary":{"en":"Hyoplastral is a rare zoology term meaning “related to the hyoplastron,” a bone of a turtle’s plastron (bottom shell).","zh":"Hyoplastral 是很少见的动物学词，指“与 hyoplastron（龟类腹甲/下壳的一块骨板）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoplastron (one of the paired bones in the front-middle part of a turtle’s plastron, the bottom shell).","zh":"与“hyoplastron（龟鳖类腹甲/下壳中前部的一对骨板）”有关的；属 hyoplastron 的。"},"examples":[{"en":"In many turtles, the hyoplastral bones help support the front half of the plastron.","zh":"在许多龟类中，hyoplastral（属 hyoplastron 的）骨板有助于支撑腹甲的前半部分。"},{"en":"The report describes damage near the hyoplastral region of the shell.","zh":"报告描述了龟壳靠近 hyoplastral（hyoplastron 区域）的损伤。"}]}],"synonyms":["plastral"],"phonetic":"/ˌhaɪoʊˈplæstrəl/","extraExplanation":["“hyoplastral”是非常少见的动物学/古生物学用语，主要出现在描述龟鳖类骨骼的学术文章或解剖图注里。","词根来源：plastron 指“龟的腹甲（下壳）”；hyoplastron 是腹甲中的特定骨板名称（通常为左右成对）。因此 hyoplastral 就是“与 hyoplastron 有关的”的形容词。","如果你是在某篇文章里看到的拼写，也可能是误拼。常见相关词包括：hyoplastron（名词）、plastral（形容词：腹甲的）、hypoplastron / hypoplastral（另一块腹甲骨板及其形容词）。"]}
{"word":"hyoplastron","summary":{"en":"Hyoplastron is a specific bone in the belly shell (plastron) of turtles and tortoises.","zh":"Hyoplastron 指龟鳖类腹甲中的一种特定骨板（成对）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A paired bone on the underside (plastron) of a turtle or tortoise shell, located toward the front-middle area of the belly shell.","zh":"龟鳖类（乌龟、陆龟等）腹甲（plastron）上的一对骨板，位置大致在腹甲前部偏中间区域。"},"examples":[{"en":"In many turtles, the hyoplastron helps support the front half of the plastron.","zh":"在许多龟类中，hyoplastron 有助于支撑腹甲的前半部分。"},{"en":"The fossil shows a well-preserved hyoplastron with clear sutures to neighboring bones.","zh":"这块化石的 hyoplastron 保存良好，与相邻骨板的缝合线很清晰。"}]}],"synonyms":["plastral bone","plastron bone (general)"],"phonetic":"/ˌhaɪoʊˈplæstrən/","extraExplanation":["这是一个动物解剖与古生物学常用词，主要出现在学术文章、博物馆说明牌、化石鉴定报告中。","词形可拆解理解：hypo- 表示“在……之下/下方”，plastron 指“腹甲”。不过在实际用法里，hyoplastron 是固定术语，指腹甲中的特定骨板（成对）。"]}
{"word":"hyoscapular","summary":{"en":"Hyoscapular is a rare anatomy adjective meaning ‘related to the hyoid bone and the scapula,’ often referring to structures linking them.","zh":"Hyoscapular 是一个较罕见的解剖学形容词，意思是“与舌骨和肩胛骨有关/连接二者的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(anatomy, rare) Relating to the hyoid bone (in the neck) and the scapula (shoulder blade), especially describing a structure that connects or involves both.","zh":"（解剖学，罕见）与舌骨（颈部）和肩胛骨（肩胛）有关的；尤指连接或同时涉及这两者的结构。"},"examples":[{"en":"Some older anatomy notes describe the omohyoid as part of a “hyoscapular” muscle group because it links the scapula and the hyoid.","zh":"一些较早的解剖笔记把肩胛舌骨肌（omohyoid）归入“hyoscapular（舌骨-肩胛）”肌群，因为它连接肩胛骨与舌骨。"},{"en":"In this context, “hyoscapular” simply means ‘between the hyoid and the scapula.’","zh":"在这里，“hyoscapular”只是表示“舌骨与肩胛骨之间的”。"}]}],"synonyms":["scapulohyoid","omohyoid-related"],"phonetic":"/ˌhaɪoʊˈskæpjələr/","extraExplanation":["“hyoscapular”在现代英语医学与解剖学写作中非常少见，更常见、更标准的说法通常是 **omohyoid**（肩胛舌骨肌）或形容词 **scapulohyoid**（肩胛—舌骨的）。","构词提示：**hyo-** 指舌骨（hyoid），**scapular** 指肩胛（scapula）。因此这个词的核心含义就是“舌骨与肩胛相关”。","如果你是在教材、论文或标注里看到该词，建议同时核对是否为拼写变体或旧式术语（例如把 scapulo- / omo- 的概念写成 hyo- + scapular）。"]}
{"word":"hyoscine","summary":{"en":"Hyoscine is a medicine (scopolamine) used for motion sickness and stomach cramps.","zh":"Hyoscine（东莨菪碱）是一种用于预防晕动病及缓解胃肠痉挛的药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine used to prevent nausea and vomiting (especially motion sickness) and to reduce stomach or intestinal cramps; also called scopolamine.","zh":"一种药物，用于预防恶心与呕吐（尤其是晕车/晕船），并缓解胃肠道痉挛；也叫东莨菪碱（scopolamine）。"},"examples":[{"en":"My doctor recommended hyoscine patches to prevent motion sickness on the cruise.","zh":"医生建议我在邮轮旅行时贴 hyoscine 贴片来预防晕船。"},{"en":"Hyoscine can help with stomach cramps, but it may cause dry mouth.","zh":"Hyoscine 可缓解胃痉挛，但可能会引起口干。"}]}],"synonyms":["scopolamine","hyoscine hydrobromide"],"phonetic":"/ˈhaɪəˌsiːn/","extraExplanation":["“Hyoscine”在英式英语中更常见；在美式英语里更常用名称是“scopolamine（东莨菪碱）”。在药房或说明书上你可能会看到“hyoscine hydrobromide（东莨菪碱氢溴酸盐）”或“scopolamine patch（东莨菪碱贴片）”。","它属于抗胆碱（anticholinergic）类药物，常见副作用包括口干、嗜睡、视物模糊等；用药需遵医嘱，尤其是青光眼、前列腺增生等人群应谨慎。"]}
{"word":"hyoscines","summary":{"en":"Hyoscines = multiple doses/types of hyoscine (scopolamine), a drug for motion sickness and stomach spasms.","zh":"Hyoscines 是 hyoscine（即 scopolamine，东莨菪碱）的复数，用于防晕动病与缓解胃肠痉挛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of hyoscine (scopolamine), a medicine used to prevent nausea (especially motion sickness) and to reduce stomach/intestinal spasms","zh":"hyoscine（东莨菪碱/莨菪碱的一种药名，常与 scopolamine 同义）的复数形式；一种用于预防恶心（尤其晕车/晕船）及缓解胃肠痉挛的药物"},"examples":[{"en":"Some travelers carry hyoscines to help prevent motion sickness.","zh":"一些旅行者会随身带 hyoscines 来预防晕车/晕船。"},{"en":"The doctor prescribed hyoscines to reduce painful stomach cramps.","zh":"医生开了 hyoscines 来缓解疼痛的胃痉挛。"}]}],"synonyms":["scopolamines","hyoscine","scopolamine"],"phonetic":"/ˈhaɪ.ə.saɪnz/","extraExplanation":["“Hyoscine”在英式英语医学语境里更常见；在美式英语里更常用名称是“scopolamine”。","它属于抗胆碱能药物（anticholinergic），可能引起口干、嗜睡、视线模糊等副作用；用药请遵医嘱。","词源与“Hyoscyamus”（莨菪属植物）有关，这类植物中含有相关生物碱。"]}
{"word":"hyoscyamine","summary":{"en":"Hyoscyamine is an anticholinergic medicine used to relieve smooth-muscle spasms (especially stomach/intestinal cramps).","zh":"Hyoscyamine 是一种抗胆碱能药，主要用于缓解平滑肌痉挛（常见为胃肠道绞痛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine (an anticholinergic) used to reduce spasms and cramping in the stomach, intestines, bladder, or other smooth muscles; it may also reduce secretions.","zh":"一种药物（抗胆碱能药），用于减少胃肠道、膀胱等平滑肌的痉挛与绞痛，也可能减少分泌物。"},"examples":[{"en":"My doctor prescribed hyoscyamine to help with intestinal cramping.","zh":"医生给我开了莨菪碱/东莨菪碱类药物（hyoscyamine），用来缓解肠道绞痛。"},{"en":"Hyoscyamine can cause a dry mouth, so drink water if your clinician says it’s safe for you.","zh":"Hyoscyamine 可能会引起口干；如果医生认为适合你，可以适当补充水分。"}]}],"synonyms":["antispasmodic","anticholinergic","atropine (related drug)"],"phonetic":"/ˌhaɪ.əˈsɑː.mi.ən/","extraExplanation":["Hyoscyamine 常见于肠易激综合征（IBS）相关痉挛、胃肠道或泌尿系统平滑肌痉挛等情况的对症缓解。它属于“抗胆碱能（anticholinergic）”类药物，作用机制大致是阻断乙酰胆碱对平滑肌的刺激，从而减少痉挛与分泌。","这个词来自植物属名 Hyoscyamus（莨菪属，历史上与“毒茄/莨菪”等植物相关），因此也带有植物来源的历史背景。","学习用法上，它多出现在处方与医学语境中；日常对话里更常说“an antispasmodic (medicine)”或直接说“a medicine for cramps”。注意：该类药物可能导致口干、便秘、视线模糊、心跳加快等副作用；具体用法与禁忌应以医生或药师指导为准。"]}
{"word":"Hyoscyamus","summary":{"en":"a genus of toxic henbane plants","zh":"莨菪属（常含毒性成分）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants known as henbane, containing toxic species used historically in medicine and for their psychoactive alkaloids","zh":"莨菪属（又称“毒参/莨菪、henbane”一类植物的属名），其中一些种有毒，历史上曾用于药用或因其含致幻生物碱而被提及"},"examples":[{"en":"Hyoscyamus niger (black henbane) contains potent alkaloids and must be handled with care.","zh":"Hyoscyamus niger（黑莨菪）含有强效生物碱，接触与使用都必须非常谨慎。"},{"en":"In old medical texts, Hyoscyamus was sometimes mentioned as a sedative, though its risks are serious.","zh":"在一些古老医书中，Hyoscyamus 曾被提到可作镇静用途，但其风险很高。"}]}],"synonyms":["henbane"],"phonetic":"/ˌhaɪoʊˈsaɪəməs/","extraExplanation":["这是一个植物学拉丁名，常见于药学、毒理学与植物学语境。该属的一些成员（如黑莨菪）含东莨菪碱、阿托品等生物碱；现实中不要自行采集或尝试使用。"],"etymology":"源自拉丁语 hyoscyamus，来自希腊语：hys（猪）+ kyamos（豆子），字面意思接近“猪豆”，与其古代俗称/联想有关，后来成为植物学属名。","mnemonic":["把它拆开记：Hyo- + -scyamus。可联想“药（yo）+ 使人迷糊（scy…像‘sleepy’的感觉）”，提醒它与镇静/致幻、毒性相关（仅作记忆联想）。","记成“henbane 的学名属”：看到 Hyoscyamus 就想到“莨菪属/毒性植物”。"]}
{"word":"hyoscyamus","summary":{"en":"Hyoscyamus is the botanical name for henbane, a poisonous nightshade plant once used in medicine and known for its hallucinogenic/toxic effects.","zh":"Hyoscyamus 是“黑莨菪（henbane）”的植物学名称，一种茄科有毒植物，曾用于医药但具有致幻与中毒风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous plant (henbane) in the nightshade family, historically used in medicine and as a hallucinogen","zh":"莨菪（天仙子属植物）；一种茄科的有毒植物，历史上曾用于药用或致幻"},"examples":[{"en":"Hyoscyamus (henbane) contains toxic compounds that can affect the nervous system.","zh":"莨菪（天仙子属）含有有毒成分，会影响神经系统。"},{"en":"In historical texts, hyoscyamus was sometimes mentioned as a remedy—though it was very risky.","zh":"在一些历史文献中，莨菪曾被提到可作药用——但风险极高。"}]}],"synonyms":["henbane","Hyoscyamus niger"],"phonetic":"/ˌhaɪ.əˈsaɪ.ə.məs/","extraExplanation":["“Hyoscyamus”是一个拉丁化的植物学名称，常指“henbane（黑莨菪）”，属于茄科（nightshade family）。它含有莨菪碱、东莨菪碱等生物碱，可能导致瞳孔放大、意识混乱、幻觉等中毒症状。","在英语里更常见的日常词是“henbane”。“Hyoscyamus”多用于植物学、药学或历史文献语境。阅读古代医书或文学作品时偶尔会遇到，但现代不建议把它当作“草药”随意使用。"]}
{"word":"hyosternal","summary":{"en":"Hyosternal means “related to the hyoid bone and the sternum,” often used in scientific anatomy.","zh":"hyosternal 指“与舌骨和胸骨相关的”，多用于解剖学等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyoid (a small bone in the neck) and the sternum (breastbone); describing a structure that connects or is associated with both, especially in anatomy or zoology.","zh":"（解剖/动物学）与舌骨（颈部的小骨）和胸骨（胸前的骨）有关的；用于描述连接或同时与两者相关的结构。"},"examples":[{"en":"The paper describes a hyosternal ligament found in certain animals.","zh":"这篇论文描述了某些动物中存在的舌骨—胸骨韧带（hyosternal ligament）。"},{"en":"In the dissection notes, we labeled the hyosternal region near the front of the neck and chest.","zh":"在解剖笔记里，我们标注了靠近颈前部与胸前部的舌骨—胸骨相关区域。"}]}],"synonyms":["hyo-sternal"],"phonetic":"/ˌhaɪoʊˈstɝːnəl/","extraExplanation":["这是一个比较少见的专业词，主要出现在解剖学、兽医学或动物学文献中。它通常用来修饰“ligament（韧带）/muscle（肌肉）/joint（关节）/apparatus（装置）”等名词，强调该结构与舌骨（hyoid）和胸骨（sternum）两者相关或连接。","构词上可理解为 hy(o)-（舌骨相关）+ sternal（胸骨的）。有时也会写作 hyo-sternal（带连字符），含义相同。"]}
{"word":"hyosternum","summary":{"en":"Hyosternum is a specific bony plate that makes up part of a turtle’s plastron (lower shell).","zh":"Hyosternum 指龟鳖类腹甲（下壳）上的一块特定骨板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bony plate in the plastron (the lower shell) of turtles and related reptiles, located toward the front-middle area of the underside.","zh":"（龟鳖类等爬行动物）腹甲（下壳）中的一块骨板，位置大致在腹甲前部偏中间处。"},"examples":[{"en":"In a turtle skeleton, the hyosternum forms part of the plastron on the underside.","zh":"在龟的骨骼标本中，hyosternum（舌胸骨板）构成腹甲（下壳）的一部分。"},{"en":"The fossil shows a well-preserved hyosternum, helping scientists identify the species.","zh":"这块化石的 hyosternum 保存得很好，帮助科学家鉴定物种。"}]}],"synonyms":["plastral bone (broader)","plastron plate (broader)"],"phonetic":"ˌhaɪoʊˈstɝnəm","extraExplanation":["这是比较专业的解剖学/古生物学词汇，常见于龟鳖类（chelonian）骨骼描述。腹甲的骨板常按位置分段命名，例如 epiplastron（前端）、hyosternum（前中部）、hypoplastron（后中部）、xiphiplastron（后端）。","词形上可理解为 hyo-（与“舌/舌骨”相关的前缀，用于表示该部位）+ sternum（胸骨），但在这里指的是龟腹甲中的特定骨板名称，而不是人类的胸骨。"]}
{"word":"hyostylic","summary":{"en":"Hyostylic describes a jaw-support system in many sharks where the jaws are supported mainly by the hyomandibula rather than being firmly fused to the skull.","zh":"Hyostylic（舌颌式）指许多鲨鱼等鱼类的一种颌部支撑方式：颌主要由舌颌骨支撑，而不是与头骨牢固融合。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a fish skull/jaw) having a jaw-suspension type in which the upper jaw is not firmly fused to the skull and the jaws are mainly supported by the hyomandibula (often described in sharks).","zh":"（指鱼类头骨/颌部）“舌颌式（颌悬挂）”的：上颌不与头骨牢固融合，颌主要由舌颌骨（hyomandibula）支撑（常见于鲨鱼等）。"},"examples":[{"en":"Many sharks have a hyostylic jaw suspension, which helps them protrude the jaws when feeding.","zh":"许多鲨鱼具有舌颌式颌悬挂结构，这有助于它们在捕食时将颌向前突出。"},{"en":"In comparative anatomy class, we contrasted hyostylic skulls with more rigid jaw attachments in other fishes.","zh":"在比较解剖课上，我们把舌颌式头骨与其他鱼类更坚固的颌部连接方式进行了对比。"}]}],"synonyms":["hyomandibular (related, not exact)"],"phonetic":"ˌhaɪoʊˈstɪlɪk","extraExplanation":["词源提示：hyostylic 来自 hy(o)-（与舌/舌骨相关）+ -stylic（与“支柱/支撑”相关），强调“由舌颌骨支撑颌”的结构特点。","语境提示：这是生物学/比较解剖学里的专业术语，多见于讲鱼类颌悬挂（jaw suspension）类型的教材与论文。"]}
{"word":"hyostyly","summary":{"en":"Hyostyly is a jaw-suspension type in which the upper jaw is supported mainly by the hyomandibula, common in many fishes.","zh":"Hyostyly（舌颌式悬吊）指上颌主要由舌颌骨支撑的一种颌部悬吊方式，常见于许多鱼类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of jaw suspension (especially in many sharks and bony fishes) in which the upper jaw is supported mainly by the hyomandibula rather than being firmly attached to the skull","zh":"（动物学）一种颌部悬吊方式（常见于许多鲨鱼与硬骨鱼）：上颌主要由舌颌骨/舌下颌骨（hyomandibula）支撑，而不是牢固地与头骨连接"},"examples":[{"en":"Many sharks show hyostyly, which helps the jaws move forward when feeding.","zh":"许多鲨鱼属于“hyostyly（舌颌式悬吊）”，这有助于它们在进食时把颌部向前伸出。"},{"en":"In class, we compared hyostyly with other jaw-suspension types in vertebrates.","zh":"课堂上我们把“hyostyly”与脊椎动物的其他颌部悬吊类型进行了比较。"}]}],"synonyms":["hyostylic jaw suspension","hyostylic suspension"],"phonetic":"/haɪˈɑs.tə.li/","extraExplanation":["词源提示：hyo- 与“舌骨/舌部相关结构”有关，-styly 来自表示“柱状支撑/结构类型”的构词成分；合起来强调“由舌颌骨等结构来支撑颌部”的特点。","学习关联：常与 autostyly（自颌式，颌与颅更直接连接）、amphistyly（两栖式/混合支撑）等术语一起出现，用于比较不同脊椎动物的颌部演化与取食方式。"]}
{"word":"hyothere","summary":{"en":"“hyothere” is most likely a misspelling of “hi there,” an informal way to say hello.","zh":"“hyothere”很可能是“hi there”的误拼写，是一种非正式的“你好/嗨”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An informal greeting meaning “hello.” Often written as “hi there.”","zh":"一种非正式的打招呼方式，相当于“你好/嗨”。常写作“hi there”。"},"examples":[{"en":"Hi there! How are you doing today?","zh":"嗨！你今天怎么样？"},{"en":"Hi there—do you need any help?","zh":"你好——你需要帮忙吗？"},{"en":"I saw your message and thought, “Hi there!”","zh":"我看到你的消息，就想着：“嗨！”"}]}],"synonyms":["hello","hi","hey","hey there"],"phonetic":"/haɪ ðɛr/","extraExplanation":["“hyothere”看起来像是把“hi there”连在一起并且拼写走样的写法，比较像聊天时的随手输入或打字错误。更标准、常见的写法是分开写：hi there。","“hi there”语气友好、轻松；比“hello”更随意，但一般不粗鲁，适合日常对话、客服开场白等。"]}
{"word":"hyotherium","summary":{"en":"Hyotherium is an extinct, fossil-known genus of pig-like mammals.","zh":"Hyotherium 指一种已灭绝、通过化石发现的似猪哺乳动物属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of pig-like mammals (suids) known from fossils, especially from the Miocene period.","zh":"（古生物）一种已灭绝的猪科（似猪）哺乳动物属，主要通过化石发现，常见于中新世地层。"},"examples":[{"en":"Hyotherium fossils help scientists understand how early pigs evolved.","zh":"Hyotherium（海欧西里乌姆属）的化石帮助科学家了解早期猪类如何演化。"},{"en":"The museum display compared Hyotherium with modern wild boars.","zh":"博物馆展览把 Hyotherium 和现代野猪作了对比。"}]}],"synonyms":["extinct suid","fossil pig (informal)"],"phonetic":"/ˌhaɪ.oʊˈθɪri.əm/","extraExplanation":["词源：来自希腊语前缀 hyo-（“猪”）+ therion（“野兽/动物”），字面意思接近“猪一样的野兽”。","这类词多用于学术语境（古生物学、地质年代介绍、博物馆说明牌）。日常英语中很少出现。","读音提示：重音常落在 -THIR- 音节上。"]}
{"word":"hyothyreoid","summary":{"en":"Hypothyroid means having an underactive thyroid (too little thyroid hormone).","zh":"hypothyroid 指“甲状腺功能减退的；甲状腺分泌激素不足的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having an underactive thyroid gland; producing too little thyroid hormone.","zh":"（医学）甲状腺功能减退的；甲状腺分泌的激素不足的。"},"examples":[{"en":"My doctor said I’m hypothyroid, so I take medicine every day.","zh":"医生说我有甲状腺功能减退，所以我每天都要吃药。"},{"en":"Hypothyroid patients may feel tired or gain weight easily.","zh":"甲状腺功能减退的患者可能会觉得疲劳，或更容易体重增加。"}]},{"partOfSpeech":"n.","definition":{"en":"A person with hypothyroidism (an underactive thyroid).","zh":"甲状腺功能减退者；患有甲状腺功能减退的人。"},"examples":[{"en":"In the study, hypothyroids were compared with healthy volunteers.","zh":"在这项研究中，甲状腺功能减退者与健康志愿者进行了比较。"}]}],"synonyms":["underactive thyroid","thyroid deficiency","low thyroid function"],"phonetic":"ˌhaɪpoʊˈθaɪrɔɪd","extraExplanation":["你输入的 **hyothyreoid** 常见是拼写错误，更常见的正确拼法是 **hypothyroid**（形容词/名词）。","相关名词是 **hypothyroidism**（甲状腺功能减退症），指“这种疾病/状态”；而 **hypothyroid** 更常用来描述“处于这种状态的人或情况”。","这是医学词汇，日常交流中也常用更通俗的说法：**underactive thyroid**（甲状腺功能低下/不活跃）。如涉及健康问题，最好以医生的诊断为准。"]}
{"word":"hyothyroid","summary":{"en":"Hypothyroid means having an underactive thyroid (too little thyroid hormone).","zh":"hypothyroid 指“甲状腺功能减退的（甲状腺激素分泌不足的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an underactive thyroid gland (producing too little thyroid hormone).","zh":"甲状腺功能减退的；甲状腺分泌的激素过少的。"},"examples":[{"en":"She was diagnosed as hypothyroid and started taking daily medication.","zh":"她被诊断为甲状腺功能减退，并开始每天服药。"},{"en":"Common signs of being hypothyroid include fatigue, weight gain, and feeling cold.","zh":"甲状腺功能减退的常见表现包括疲劳、体重增加以及怕冷。"},{"en":"If you are hypothyroid, regular blood tests can help adjust your dose.","zh":"如果你有甲减，定期验血有助于调整用药剂量。"}]},{"partOfSpeech":"n.","definition":{"en":"A person (or patient) who has an underactive thyroid.","zh":"甲状腺功能减退者（患者）。"},"examples":[{"en":"The clinic provides education for hypothyroids about diet and medication timing.","zh":"诊所为甲减患者提供关于饮食与用药时间的健康教育。"}]}],"synonyms":["underactive thyroid","low thyroid function"],"phonetic":"ˌhaɪpoʊˈθaɪrɔɪd","extraExplanation":["你输入的“hyothyroid”常见拼写应为 **hypothyroid**（少了一个 p，且中间是 *hypo-*）。","词根提示：**hypo-** 表示“低于、过少”，**thyroid** 指“甲状腺”。对应名词是 **hypothyroidism**（甲状腺功能减退症）；相反词是 **hyperthyroid / hyperthyroidism**（甲亢/甲状腺功能亢进）。","这是医学用语，日常交流中更常说 “I have hypothyroidism.”（我有甲减）或 “My thyroid is underactive.”（我的甲状腺功能偏低）。"]}

