{"word":"hyraces","summary":{"en":"“Hyraces” means more than one hyrax, a small rock-dwelling mammal found in Africa and the Middle East.","zh":"“Hyraces”指多只蹄兔（hyrax），一种生活在非洲和中东岩石地带的小型哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of hyrax: small, rabbit-like mammals (not actually rabbits) that live in Africa and the Middle East, often on rocky hillsides.","zh":"hyrax 的复数：一种体型小、看起来像兔子但并非兔类的哺乳动物，主要生活在非洲和中东，常见于岩石山地。"},"examples":[{"en":"We saw several hyraces sunbathing on the rocks.","zh":"我们看到几只蹄兔在岩石上晒太阳。"},{"en":"Hyraces live in groups and communicate with calls.","zh":"蹄兔群居生活，并用叫声交流。"}]}],"synonyms":["hyraxes"],"phonetic":"/ˈhaɪˌræksɪz/","extraExplanation":["“hyrax/蹄兔”在生物分类上和大象、海牛的亲缘关系更近，这点常让学习者惊讶；它们脚底有湿润的肉垫，能帮助在岩石上抓地攀爬。","拼写注意：单数是 hyrax（不是 *hyrace*）；复数常见两种：hyraces 和 hyraxes，都正确。"]}
{"word":"hyraceum","summary":{"en":"Hyraceum is a dried, resin-like deposit from rock hyrax waste, used mainly in perfumery for a musky animal scent.","zh":"蹄兔香是岩蹄兔排泄物长期沉积干燥形成的树脂状物质，主要用于香水以提供麝香般的动物气味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hard, resin-like material made from the dried urine and droppings of the rock hyrax (a small African mammal), traditionally used in perfumery for a musky, animal-like scent and in some folk medicines.","zh":"蹄兔香（hyraceum）：由岩蹄兔（非洲一种小型哺乳动物）的尿液和粪便长期堆积并干燥后形成的坚硬树脂状物质；传统上用于香水制造（带有麝香般的动物气味），也见于一些民间药用。"},"examples":[{"en":"Some niche perfumes use hyraceum to create a warm, animalic base note.","zh":"一些小众香水会用蹄兔香来营造温暖、带动物感的基调。"},{"en":"Because it is collected from old deposits, hyraceum is sometimes described as a natural “fossilized” scent material.","zh":"由于多从 오래 堆积的沉积物中采集，蹄兔香有时被形容为一种天然“化石化”的香料原料。"}]}],"synonyms":["hyrax dung","hyrax excrement (in perfumery context)","Africa stone (informal)"],"phonetic":"/haɪˈreɪsiəm/","extraExplanation":["“hyraceum”来自“hyrax（蹄兔）”一词的构词变化。它在香水语境里常被拿来类比“civet（灵猫香）”“castoreum（海狸香）”等动物性香材，但气味描述可能更偏干燥、皮革感、微甜与烟熏感（不同批次差异明显）。","由于涉及动物来源与采集方式，不同品牌会强调其是否为“非捕猎/可持续采集（cruelty-free harvesting）”；购买或使用时可留意相关说明。"]}
{"word":"hyrachyus","summary":{"en":"Hyrachyus is an extinct Eocene mammal often discussed as an early relative of tapirs and other odd-toed hoofed animals.","zh":"Hyrachyus 是一种已灭绝的始新世哺乳动物，常被提到是貘等奇蹄类动物的早期近亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hyrachyus: an extinct, small-to-medium-sized mammal that lived in the Eocene period and is considered an early relative of modern odd-toed hoofed animals (especially tapirs and, more distantly, rhinoceroses).","zh":"Hyrachyus：一种已灭绝的中小型哺乳动物，生活在始新世（Eocene），常被认为与现代奇蹄类有亲缘关系，尤其与貘（tapir）更接近，并被视为与犀牛的早期远亲。"},"examples":[{"en":"Scientists have studied Hyrachyus fossils to understand how early odd-toed hoofed mammals evolved.","zh":"科学家研究 Hyrachyus 的化石，以了解早期奇蹄类哺乳动物是如何演化的。"},{"en":"In a museum display of Eocene animals, Hyrachyus is often shown as a tapir-like ancestor.","zh":"在展示始新世动物的博物馆展柜中，Hyrachyus 常被呈现为类似貘的早期亲属。"}]}],"synonyms":["Eocene perissodactyl","early odd-toed ungulate"],"phonetic":"/haɪˈræk.i.əs/","extraExplanation":["这是一个古生物学中的属名（genus name），通常首字母大写：Hyrachyus。","它并不是现代动物的“直接祖先”，更准确的说法是“早期近亲/代表性类群”，用来帮助科学家拼接奇蹄类演化的线索。","词源一般认为来自希腊语构词：hyrax（蹄兔）+ -chyus（与猪/兽类相关的后缀形式），但在科普语境里更重要的是记住它属于始新世的早期奇蹄类谱系。"]}
{"word":"hyraci","summary":{"en":"“hyraci” is likely a misspelling of “hierarchy”: a ranked system or order of levels.","zh":"“hyraci”很可能是“hierarchy”的拼写错误：指有等级的体系或层级顺序。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “hierarchy.”","zh":"不是标准英语单词，可能是“hierarchy”的拼写错误。"},"examples":[{"en":"Did you mean “hierarchy” (h-i-e-r-a-r-c-h-y)?","zh":"你是不是想写“hierarchy”（h-i-e-r-a-r-c-h-y）？"}]},{"partOfSpeech":"n.","definition":{"en":"A system in which people or groups are ranked, with some having more power or importance than others.","zh":"等级制度；层级体系（人或群体按权力/重要性高低排列）。"},"examples":[{"en":"The company has a clear hierarchy, from interns to executives.","zh":"这家公司层级分明，从实习生到高管都有清晰的等级。"},{"en":"In many cultures, family hierarchy influences decision-making.","zh":"在许多文化中，家庭的长幼/辈分层级会影响决策。"}]},{"partOfSpeech":"n.","definition":{"en":"The ranking order itself (who is above or below whom).","zh":"等级顺序；上下级关系。"},"examples":[{"en":"I’m not sure where I fit in the hierarchy on this project.","zh":"我不确定在这个项目的上下级关系里我处于什么位置。"}]}],"synonyms":["chain of command","ranking","pecking order","power structure"],"phonetic":"/ˈhaɪərɑrki/","extraExplanation":["“hierarchy”常见拼写难点是中间的“ierar”。记忆小技巧：h + ierar + chy。","“hierarchy”既可指组织/社会的“等级制度”，也可指某个具体场景里的“上下级排序”。"]}
{"word":"hyracid","summary":{"en":"A “hyracid” is a hyrax (or something related to hyraxes), mainly used in zoological contexts.","zh":"“hyracid”指蹄兔（或与蹄兔有关的事物），主要用于动物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(zoology) A small, rabbit-sized African or Middle Eastern mammal related to the hyrax; also used to mean “related to hyraxes.”","zh":"（动物学）蹄兔类的小型哺乳动物（非洲与中东常见）；也可指“与蹄兔有关的”。"},"examples":[{"en":"A hyracid can look a bit like a large guinea pig, but it’s not a rodent.","zh":"蹄兔看起来有点像大号豚鼠，但它不是啮齿动物。"},{"en":"The rock hyrax is a well-known hyracid in parts of Africa.","zh":"岩蹄兔是非洲一些地区很常见的一种蹄兔类动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to, or characteristic of, hyraxes (hyracids).","zh":"（形容词）与蹄兔（蹄兔类动物）有关的；蹄兔的。"},"examples":[{"en":"Researchers described hyracid behavior in rocky habitats.","zh":"研究人员描述了岩石栖息地中蹄兔的行为。"},{"en":"A hyracid colony often lives among cliffs and boulders.","zh":"蹄兔群体常生活在悬崖和巨石之间。"}]}],"synonyms":["hyrax","rock hyrax","dassie"],"phonetic":"/haɪˈræsɪd/","extraExplanation":["“hyracid”常见于动物学语境，来自“hyrax（蹄兔）+ -id（表示某类动物/成员或“属于……的”）”。日常英语里更常用的是“hyrax”本词。","蹄兔在分类上并不是兔子或啮齿动物；它们与象、海牛等在演化关系上更接近（这是常见的趣味知识点）。"]}
{"word":"hyracidae","summary":{"en":"Hyracidae is the scientific family name for hyraxes.","zh":"Hyracidae 是“蹄兔科”的学名（科学分类中的科名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the zoological family that includes the hyraxes (small, hoof-like mammals found mainly in Africa and the Middle East)","zh":"蹄兔科（主要分布于非洲与中东的一类小型哺乳动物的生物分类“科”）"},"examples":[{"en":"The rock hyrax is a member of the family Hyracidae.","zh":"岩蹄兔属于蹄兔科（Hyracidae）。"},{"en":"Researchers compared DNA from Hyracidae with that of elephants and manatees.","zh":"研究人员将蹄兔科的DNA与大象和海牛的DNA作了比较。"}]}],"synonyms":["hyrax family"],"phonetic":"/haɪˈræsɪdi/","extraExplanation":["“Hyracidae”是生物分类学里的“科名”，常见后缀“-idae”表示“某某科”（例如 Felidae 猫科）。因此它在学术写作中常被当作一个专有名词来使用。","蹄兔看起来有点像啮齿类，但在演化关系上与象（elephants）和海牛（manatees）更接近，这一点常让学习者感到意外。"]}
{"word":"hyraciform","summary":{"en":"“Hyraciform” means hyrax-like—describing something that resembles or relates to a hyrax.","zh":"“hyraciform”意为“蹄兔形的/像蹄兔的”，用于描述与蹄兔有关或外形结构类似蹄兔的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hyrax-like; relating to or resembling a hyrax (a small, rabbit-sized mammal found in Africa and the Middle East).","zh":"像蹄兔的；与蹄兔有关的；形态或特征类似蹄兔的（蹄兔是一种生活在非洲与中东、体型像兔子大小的小型哺乳动物）。"},"examples":[{"en":"Early naturalists sometimes described certain fossils as hyraciform because of their teeth and skull shape.","zh":"早期的博物学家有时会因为牙齿和头骨形状，把某些化石描述为“hyraciform（蹄兔形的）”。"},{"en":"The report compared the animal’s body plan to a hyraciform mammal.","zh":"报告把这种动物的体型结构与“hyraciform（蹄兔形）”哺乳动物作了比较。"}]}],"synonyms":["hyrax-like","hyrax-shaped","hyraxine (rare/technical)"],"phonetic":"/haɪˈræsɪfɔrm/","extraExplanation":["“hyraciform”由“hyrax（蹄兔）+ -form（……形的）”构成，属于学术/科普写作中较少见的形容词，多出现在动物学、古生物学或比较解剖学的语境里。","蹄兔（hyrax）在外形上可能让人联想到啮齿类或兔子，但其亲缘关系更接近象类和海牛等（这点常被用作科普趣闻）。因此“hyraciform”通常强调“外形或结构相似”，不一定表示真正的亲缘关系。"]}
{"word":"hyracina","summary":{"en":"“hyracina” is a rare scientific/Latinized term connected to hyraxes (hyrax-related or hyrax-like).","zh":"“hyracina”是一个罕见的科学/拉丁化用语，表示与蹄兔有关或“像蹄兔的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare) A taxonomic/scientific term relating to hyraxes (small, rabbit-sized African and Middle Eastern mammals). It may be used as a Latinized label for a hyrax group in older zoological writing.","zh":"（罕见）与蹄兔（hyrax，一种生活在非洲与中东、体型像兔子的小型哺乳动物）有关的分类学/科学用语；在较旧的动物学文献中可能作为拉丁化名称指代某类蹄兔。"},"examples":[{"en":"In some older zoological notes, you may see Latinized terms like “Hyracina” used for hyrax-related groups.","zh":"在一些较旧的动物学笔记里，你可能会看到像 “Hyracina” 这样拉丁化的词用来指与蹄兔相关的类群。"},{"en":"The specimen was described as hyracina in form, meaning it resembled a hyrax.","zh":"该标本被描述为 “hyracina in form”，意思是外形类似蹄兔。"}]}],"synonyms":["hyrax","dassie","hyracoid"],"phonetic":"/haɪˈræsɪnə/","extraExplanation":["“hyracina”在现代英语里几乎不作为常用词出现，更像是旧式/学术性的拉丁化分类标签。不同文献中它可能对应“蹄兔相关类群”（例如某些亚科/类群名称）或用作“像蹄兔的”这种描述性用法。","如果你是在某篇论文、标本标签或词表中看到它，建议你同时确认上下文是否在讲：hyrax（蹄兔）、Hyracoidea（蹄兔目）、或某个更常见的分类名（例如Hyracidae蹄兔科）。这也可能是拼写变体或抄写误差。"]}
{"word":"hyracodon","summary":{"en":"Hyracodon: an extinct, small running mammal related to rhinoceroses, known from North American fossils.","zh":"Hyracodon：一种已灭绝、体型较小且善跑的犀牛近亲，主要见于北美化石记录。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct genus of small, fast-running prehistoric mammals related to modern rhinoceroses, known from fossils in North America (mainly the Oligocene period).","zh":"一种已灭绝的史前哺乳动物属，与现代犀牛有亲缘关系；体型较小、善于奔跑，化石主要发现于北美（以渐新世为主）。"},"examples":[{"en":"Hyracodon is often described as a lightweight, cursorial relative of early rhinoceroses.","zh":"Hyracodon 常被描述为早期犀牛类的“轻量级”、擅长奔跑的近亲。"},{"en":"Fossils of Hyracodon help scientists understand how rhino-like animals evolved in North America.","zh":"Hyracodon 的化石有助于科学家了解类似犀牛的动物在北美的演化过程。"}]}],"synonyms":["(no common everyday synonyms)"],"phonetic":"/haɪˈrækəˌdɑn/","extraExplanation":["词源提示：Hyracodon 来自希腊语元素，-odon 常见于动物命名中，意为“牙”（如 mastodon）。整体名称是早期古生物命名传统的一部分。","背景补充：它并不是“鬣狗”或“兔形动物”，而是奇蹄目（与马、貘、犀牛同一大类）的一支；在科普资料中常被拿来对比“更粗壮的犀牛”与“更擅长奔跑的近亲”。"]}
{"word":"hyracodont","summary":{"en":"A hyracodont is an extinct, long-legged rhino relative known from fossils.","zh":"hyracodont 指一种已灭绝、腿较长的犀牛近亲动物，主要通过化石为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct, long-legged, rhino-related mammal (a member of the group Hyracodonta) that lived millions of years ago and is known from fossils","zh":"一种已灭绝、四肢较长的犀科近亲哺乳动物（属于“海拉科齿目/海拉科齿类”Hyracodonta），生活在数百万年前，主要通过化石为人所知"},"examples":[{"en":"Scientists found hyracodont fossils in Central Asia.","zh":"科学家在中亚发现了海拉科齿类动物的化石。"},{"en":"A hyracodont was built for running, with longer legs than modern rhinos.","zh":"海拉科齿类动物更适合奔跑，它的腿比现代犀牛更长。"}]}],"synonyms":["hyracodontid","member of Hyracodonta"],"phonetic":"/haɪˈrækəˌdɑnt/","extraExplanation":["“Hyracodont”一词源自希腊语词根：hyrax（蹄兔）+ odon（牙齿），意思大致是“像蹄兔的牙齿”。它们并不是蹄兔，而是与犀牛同属奇蹄目（Perissodactyla）的远亲。","在古生物学语境中，hyracodont 常被描述为“奔跑型犀牛近亲”（running rhinoceros relative），强调其体型较轻、四肢较长，适应开阔环境的移动。"]}
{"word":"hyracodontid","summary":{"en":"an extinct rhino-like mammal from the family Hyracodontidae","zh":"鬣犀科的已灭绝“犀牛类”古哺乳动物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an extinct family of rhinoceros-like mammals (Hyracodontidae) that lived mainly in North America and Eurasia during the Eocene–Miocene periods","zh":"（已灭绝的）鬣犀科动物；一种外形类似犀牛的古哺乳动物，主要生活在始新世至中新世，分布于北美与欧亚大陆"},"examples":[{"en":"Fossils suggest some hyracodontids were fast runners compared with modern rhinos.","zh":"化石显示，一些鬣犀科动物可能比现代犀牛更擅长奔跑。"},{"en":"The museum display explains how a hyracodontid fits into the rhino family tree.","zh":"博物馆展板说明了鬣犀科动物在犀牛演化谱系中的位置。"}]}],"synonyms":["hyracodont"],"phonetic":"/ˌhaɪrəˈkɑːdənˌtɪd/","extraExplanation":["“Hyracodontid”来自“鬣犀科（Hyracodontidae）”，是古生物学/动物学里的分类名词。常见于科普文章、博物馆解说和学术资料中。","鬣犀科里包含一些著名的远古“犀牛类”，例如体型巨大、无角的Paraceratherium（有时也被称作Indricotherium），常被描述为史上最大的陆生哺乳动物之一。不同资料对其分类细节可能略有差异，但在学习词义时可把它理解为“已灭绝的犀牛近亲”。"]}
{"word":"hyracodontidae","summary":{"en":"Hyracodontidae is the scientific name of an extinct family of mammals related to rhinoceroses.","zh":"Hyracodontidae 是一个已灭绝的哺乳动物科名，与犀牛有亲缘关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct, rhinoceros-related mammals (hyrax-like rhinocerotoids) that lived mainly in the Eocene to Miocene periods","zh":"一类已灭绝的哺乳动物科，和犀牛有亲缘关系（外形或体态有时被描述为“像蹄兔的犀类”），主要生活在始新世到中新世"},"examples":[{"en":"Hyracodontidae includes several extinct species related to early rhinoceroses.","zh":"Hyracodontidae 包含若干与早期犀牛有关的已灭绝物种。"},{"en":"Fossils of hyracodontids help scientists understand how rhinos evolved.","zh":"Hyracodontidae（该科动物）的化石帮助科学家了解犀牛的演化。"}]}],"synonyms":["hyracodontids (informal plural/common term)"],"phonetic":"/ˌhaɪrəˈkɑːdənˌtaɪdi/","extraExplanation":["“Hyracodontidae”是动物分类学中的“科”（-idae 表示科名）。常见单数形式是“hyracodontid”（指该科的一员），复数“hyracodontids”。","名称词根中“hyraco-”与“hyrax（蹄兔）”有关，历史上有人用“像蹄兔的”来描述其体态；但它们并不是蹄兔，而是与犀牛同属“奇蹄目”系统的相关类群。"]}
{"word":"hyracodontids","summary":{"en":"an extinct group of rhino relatives, known from fossils","zh":"一种已灭绝、以化石为证的类犀近亲动物群"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Extinct, long-legged relatives of rhinoceroses (members of the family Hyracodontidae) that lived in the Eocene to Miocene and are sometimes described as “running rhinos.”","zh":"已灭绝的犀科近亲（Hyracodontidae 赫拉克多顿科的成员），多为长腿、善奔跑的类犀动物，生存于始新世至中新世。"},"examples":[{"en":"Fossils suggest hyracodontids were adapted for running across open habitats.","zh":"化石证据表明，赫拉克多顿科动物可能适应在开阔环境中奔跑。"},{"en":"Some researchers compare certain hyracodontids to modern animals in terms of limb structure and speed.","zh":"一些研究者会从四肢结构和速度角度，将部分赫拉克多顿科动物与现代动物作类比。"}]}],"synonyms":["hyracodonts","running rhinos"],"phonetic":"/haɪˌrækəˈdɑːn.tɪdz/","extraExplanation":["这是古生物学与动物分类学用语，常见于学术文章、博物馆展牌与科普读物。","它们不是现代蹄兔（hyrax）的近亲；名字里出现的 hyraco- 只是命名构词上的巧合，容易让人误会。"],"etymology":"源自属名 Hyracodon（来自希腊语词根，意为“蹄类/小兽”之类的古生物命名构词）+ 英语复数/类群后缀 -id（表示“……类/……科成员”）。hyracodontid 指“赫拉克多顿属相关类群的成员”，复数为 hyracodontids。","mnemonic":["拆开记：hyraco-（看起来像 hyrax“蹄兔”）+ -dont-（联想到 tooth“牙”，常见于生物学词根）+ -ids（“……类/……族”）。整体就是“某类古动物群”。","把它想成“跑得快的古犀”（running rhinos）这一常见外号，帮助快速抓住形象。"]}
{"word":"hyracodontoid","summary":{"en":"Hyracodontoid means “related to or like hyracodonts,” an extinct group of rhinoceros-like mammals; it can also mean a member of that group.","zh":"hyracodontoid 指“与海拉科顿类（已灭绝的类似犀牛的哺乳动物类群）有关的/像海拉科顿类的”，也可指该类群的成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the extinct group of rhinoceros-like mammals called hyracodonts (family Hyracodontidae).","zh":"与已灭绝的“海拉科顿类”（hyracodonts，海拉科顿科 Hyracodontidae）这种类似犀牛的哺乳动物类群有关的。"},"examples":[{"en":"Fossils from this site suggest a hyracodontoid mammal lived here during the Oligocene.","zh":"该地点的化石表明，在渐新世时期这里生活过一种海拉科顿类（hyracodontoid）哺乳动物。"},{"en":"The paper compares hyracodontoid teeth with those of early true rhinoceroses.","zh":"论文将海拉科顿类（hyracodontoid）的牙齿与早期真犀类的牙齿进行了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the hyracodont group (an extinct rhinoceros-like mammal).","zh":"海拉科顿类动物（已灭绝、类似犀牛的一类哺乳动物）的成员。"},"examples":[{"en":"Some scientists think certain giant “rhinos” were actually hyracodontoids rather than true rhinoceroses.","zh":"一些科学家认为，某些巨型“犀牛”其实属于海拉科顿类（hyracodontoids），而不是真正的犀牛。"},{"en":"The museum label identifies the skeleton as a hyracodontoid from Central Asia.","zh":"博物馆的说明牌将这具骨架标注为来自中亚的一种海拉科顿类（hyracodontoid）。"}]}],"synonyms":["hyracodontid"],"phonetic":"/haɪˌrækəˈdɑnˌtɔɪd/","extraExplanation":["词源提示：hyracodontoid = Hyracodon（属名）+ -oid（“……样的 / ……类的”）。因此它常用于古生物学/动物演化文献中，表示“海拉科顿类的、近似海拉科顿类的”。","用法提醒：在学术写作中，-oid 往往强调“形态或亲缘上的相似/归入某一更大类群”，但不一定等同于更严格的分类学词（例如 -idae 表示“科”）。有些文章也会用更具体的 hyracodontid（海拉科顿科的）来表达更明确的分类。"]}
{"word":"hyracoid","summary":{"en":"A hyracoid is a hyrax: a small herbivorous mammal from Africa and the Middle East.","zh":"hyracoid 指蹄兔：一种分布在非洲和中东的小型草食哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, plant-eating mammal (a hyrax) found mainly in Africa and the Middle East; it has a rabbit-like body but is more closely related to elephants and manatees.","zh":"蹄兔（又称岩兔）：一种小型草食哺乳动物，主要分布于非洲和中东；外形有点像兔子，但亲缘关系更接近大象和海牛。"},"examples":[{"en":"We spotted a hyracoid sunning itself on the rocks.","zh":"我们看到一只蹄兔在岩石上晒太阳。"},{"en":"In many field guides, hyracoids are described as relatives of elephants.","zh":"在许多野外图鉴中，蹄兔常被描述为大象的近亲。"}]}],"synonyms":["hyrax","dassie (South African English)"],"phonetic":"/ˈhaɪrəˌkɔɪd/","extraExplanation":["“hyracoid”常用于动物学语境，既可指“蹄兔（hyrax）个体”，也可更广义指“蹄兔类动物”（如蹄兔目 Hyracoidea）的成员；日常英语里更常见的词是“hyrax”。"]}
{"word":"Hyracoidea","summary":{"en":"the taxonomic order of hyraxes","zh":"蹄兔的分类“目”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific taxonomic order that includes the hyraxes (small, rabbit-sized herbivorous mammals found mainly in Africa and the Middle East)","zh":"（生物分类）蹄兔目：包含蹄兔等成员的一类哺乳动物分类“目”（主要分布于非洲及中东，体型小、食草）"},"examples":[{"en":"In zoology class, we learned that hyraxes belong to the order Hyracoidea.","zh":"在动物学课上，我们学到蹄兔属于蹄兔目（Hyracoidea）。"},{"en":"Researchers compared skull features across Hyracoidea to understand their evolution.","zh":"研究人员比较了蹄兔目不同成员的头骨特征，以了解它们的演化。"}]}],"synonyms":["hyrax order","hyracoids"],"phonetic":"/ˌhaɪrəˈkɔɪdiə/","extraExplanation":["这是一个严格的科学分类名（taxonomic order）。“-oidea”在生物学里常见，表示“某某类群/某某形”，你会在其他分类名中也看到类似结构。","蹄兔外形像啮齿类或兔子，但系统发育研究显示它们与象类、海牛等有较近的亲缘关系；这一点常被用来说明“外形相似不一定代表近亲”。"],"etymology":"来自希腊语词根：hyrax（蹄兔）+ -oidea（“……类/……形”的后缀，常用于分类名称），整体表示“蹄兔这一类（的动物）”。","mnemonic":["把它拆开记：hyrax（蹄兔）+ oidea（某某类）→“蹄兔这一类（的目）”。","读音像“high-ra-KOY-dee-uh”，想象“高山（high）岩石上住着蹄兔这一类”。"]}
{"word":"hyracoidea","summary":{"en":"Hyracoidea is the scientific order that includes hyraxes.","zh":"Hyracoidea 指“蹄兔目”，是包含蹄兔的一类动物分类（目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of small, rabbit-sized African mammals called hyraxes, which have short legs, rounded ears, and rubbery foot pads for climbing rocks","zh":"蹄兔目：一类生活在非洲和中东部分地区的小型哺乳动物（蹄兔）的分类群（目）。它们体型像兔子、四肢较短、耳朵圆，脚底有类似橡胶的肉垫，善于在岩石上攀爬"},"examples":[{"en":"The rock hyrax belongs to the order Hyracoidea.","zh":"岩蹄兔属于蹄兔目（Hyracoidea）。"},{"en":"In a zoo exhibit, the label listed Hyracoidea along with elephants and manatees as distant relatives.","zh":"在动物园展区的说明牌上，Hyracoidea（蹄兔目）被列为与大象和海牛有远亲关系的类群。"}]}],"synonyms":["hyrax order"],"phonetic":"/ˌhaɪrəˈkɔɪdiə/","extraExplanation":["“Hyracoidea”是动物分类学里的拉丁化名称，常见于科普、教材或动物园标牌中；日常英语里更常用“hyrax/ hyraxes（蹄兔）”来指具体动物。","有趣的系统分类背景：蹄兔与“大象、海牛”同属更大的亲缘谱系（Afrotheria 的一部分），这点常被用来说明“外形相似不一定代表亲缘近”。"]}
{"word":"hyracoidean","summary":{"en":"Hyracoidean means “related to hyraxes/the order Hyracoidea,” and less commonly it can mean a hyrax itself.","zh":"hyracoidean 指“与蹄兔/蹄兔目有关的”，较少情况下也可指“蹄兔目动物（蹄兔）本身”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hyraxes or to the mammal order Hyracoidea.","zh":"与蹄兔（hyrax）有关的；与蹄兔目（Hyracoidea）有关的。"},"examples":[{"en":"Hyraxes are the best-known hyracoidean mammals alive today.","zh":"蹄兔是现今仍存活的蹄兔目动物中最知名的一类。"},{"en":"The museum has a display on hyracoidean evolution in Africa and the Middle East.","zh":"博物馆有一个关于蹄兔目在非洲与中东地区演化的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the order Hyracoidea; a hyrax (less common usage).","zh":"蹄兔目动物；蹄兔（较少用法）。"},"examples":[{"en":"This fossil skull was identified as a hyracoidean.","zh":"这块化石头骨被鉴定为蹄兔目动物。"}]}],"synonyms":["hyracoid","hyrax-related","hyrax-like"],"phonetic":"/ˌhaɪrəˈkɔɪdiən/","extraExplanation":["“Hyracoidea”是哺乳动物的一个分类单元（蹄兔目）。现代蹄兔体型不大，但在演化关系上与象类、海牛等同属“非洲兽类”（Afrotheria）的一支，这常让学习者觉得意外。","在科普或学术写作中更常见名词“hyrax /ˈhaɪræks/（蹄兔）”与形容词“hyracoid /ˈhaɪrəˌkɔɪd/（蹄兔类的）”；“hyracoidean”更偏正式、分类学语境。"]}
{"word":"hyracoidian","summary":{"en":"“Hyracoidian” means ‘relating to hyraxes or their zoological group.’","zh":"“hyracoidian”意为“与蹄兔或其所属动物分类群有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the hyraxes (small, rabbit-sized mammals) or to the zoological group (order/suborder) that includes them.","zh":"与蹄兔（体型小、类似兔子的哺乳动物）有关的；或与包含蹄兔的动物分类群（目/亚目）有关的。"},"examples":[{"en":"Hyraxes are often described as members of a hyracoidian group in older zoology texts.","zh":"在较早的动物学教材里，蹄兔常被描述为属于“蹄兔类（hyracoidian）”的一个群。"},{"en":"The museum label noted hyracoidian fossils from North Africa.","zh":"博物馆的说明牌提到来自北非的蹄兔类化石。"}]}],"synonyms":["hyrax (related)","Hyracoidea (related)","hyracoid (rare)"],"phonetic":"/ˌhaɪrəˈkɔɪdiən/","extraExplanation":["“hyracoidian”来自 Hyracoidea（蹄兔总目/类群名称）+ -ian（表示“……的、与……有关的”）。","在现代分类学写法中，更常见的是用 Hyracoidea / hyrax 来表达；“hyracoidian”多见于学术或较旧的科普/动物学文献。","一个有趣的知识点：蹄兔外形像啮齿类或兔形目，但在演化关系上与象、海牛等（Afrotheria 相关谱系）有一定亲缘联系，这也是它们在教材里常被特别提及的原因。"]}
{"word":"hyracoids","summary":{"en":"Hyracoids are hyraxes (the order Hyracoidea), small herbivorous mammals mainly from Africa and the Middle East.","zh":"hyracoids 指蹄兔（蹄兔目 Hyracoidea）的类群，是主要分布在非洲和中东的小型食草哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of small, plant-eating mammals called hyraxes, found mainly in Africa and the Middle East","zh":"蹄兔目动物：一种小型食草哺乳动物（蹄兔）的类群，主要分布在非洲和中东"},"examples":[{"en":"Hyracoids often live among rocky cliffs where they can hide quickly.","zh":"蹄兔目动物常住在岩石峭壁间，方便迅速躲藏。"},{"en":"Although they look a bit like rodents, hyracoids are more closely related to elephants and sea cows.","zh":"虽然它们看起来有点像啮齿类动物，但蹄兔目动物与大象和海牛的亲缘关系更近。"}]}],"synonyms":["hyraxes","Hyracoidea"],"phonetic":"/haɪˈrækɔɪdz/","extraExplanation":["“hyracoid”来自“hyrax（蹄兔）”。“-oid”表示“……样的/……类的”，所以“hyracoids”就是“蹄兔类动物”。","常见于动物学、科普文章或纪录片解说中；日常口语里更常说“hyrax / hyraxes（蹄兔/蹄兔们）”。"]}
{"word":"hyracothere","summary":{"en":"Hyracothere (more commonly spelled Hyracotherium) is an extinct early horse from about 50 million years ago.","zh":"Hyracothere（更常见拼作Hyracotherium）指约五千万年前的已灭绝早期马类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct, small early horse (often called Eohippus) that lived about 50 million years ago; an important ancestor in the horse family.","zh":"一种已灭绝的早期小型马类（常被称为“始祖马/Eohippus”），生活在约五千万年前；被认为是马科演化中的重要早期成员。"},"examples":[{"en":"In the museum, we saw a model of Hyracotherium, the tiny early horse with several toes.","zh":"在博物馆里，我们看到了一件Hyracotherium的模型——那种有多趾的小型早期马类。"},{"en":"Scientists compare Hyracotherium fossils with modern horses to explain evolution over millions of years.","zh":"科学家将Hyracotherium的化石与现代马作比较，用来解释数百万年的演化过程。"}]}],"synonyms":["Hyracotherium","Eohippus","early horse"],"phonetic":"/ˌhaɪrəkoʊˈθɪriəm/","extraExplanation":["“hyracothere”常见于非正式写法或误拼，更标准的学名拼写是 **Hyracotherium**（也常见旧称/通俗称呼 **Eohippus**，“黎明之马/始祖马”）。","Hyracotherium并不是“蹄兔”(hyrax)；名字里虽有“hyraco-”，但它指的是研究早期马类时的命名背景与外形联想，而不是与蹄兔有亲缘关系。"]}
{"word":"hyracotheres","summary":{"en":"plural of an early, small horse-relative known from fossils","zh":"化石中已知的一类早期小型“马类近亲”（复数）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, early horse-like mammals that lived in the Eocene epoch; often discussed as early relatives of modern horses (plural).","zh":"（复数）始新世时期体型很小、类似马的早期哺乳动物，常被视为现代马的早期近亲。"},"examples":[{"en":"Fossils of hyracotheres show that early horse relatives were about the size of a dog.","zh":"始马类（hyracotheres）的化石显示，早期马的近亲大约只有狗那么大。"},{"en":"In many textbooks, hyracotheres are used to illustrate how horses changed over millions of years.","zh":"在许多教材里，始马类常用来说明马在数百万年中的演化变化。"}]}],"synonyms":["Eohippus","dawn horses","early horses"],"phonetic":"/ˌhaɪˌrækəˈθɪriz/","extraExplanation":["学习提示：在科普与教材中，hyracotheres 常被当作“早期马类”的代表来讲（有时也会提到更常见的名称 Eohippus）。不同资料在分类与命名上可能略有差异，但在学习语境里通常指非常早期、体型小、多趾的马的近亲。"],"etymology":"源自希腊语：hýrax（蹄兔/“hyrac-”）+ thērion（野兽/兽类，“-there”），原意大致是“像蹄兔的兽”。该名称最初用于化石分类，后来常与早期“原始马类”讨论相关。","mnemonic":["拆分记忆：hyrax（蹄兔）+ there（联想“兽类” thērion）→ “像蹄兔的兽”→ 化石里的一种早期小型“马亲戚”。","把 -there 记成“兽”(therion) 的音形联想：看见 -there/-ther 就想到“动物/兽类”的命名后缀。"]}
{"word":"hyracotherian","summary":{"en":"Hyracotherian means “related to Hyracotherium (Eohippus), an early horse,” and can also mean an early horse-like animal.","zh":"hyracotherian 指“与始祖马（Hyracotherium/Eohippus）这种早期马类有关的”，也可指“始祖马类（早期像马的动物）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Hyracotherium (also called Eohippus), a small early horse from the Eocene period, or to animals like it.","zh":"与“始祖马”（Hyracotherium，又称 Eohippus）或与其相似的早期马类动物有关的。"},"examples":[{"en":"Some textbooks describe Hyracotherium as a hyracotherian form in the early history of horses.","zh":"一些教材把始祖马描述为马类早期历史中的一种“始祖马型”（hyracotherian）形态。"},{"en":"The museum label calls the fossil a hyracotherian ancestor of later horses.","zh":"博物馆的标签把这块化石称为后来马类的“始祖马类”（hyracotherian）祖先。"}]},{"partOfSpeech":"n.","definition":{"en":"a hyracotherian animal; an early horse-like mammal similar to Hyracotherium.","zh":"始祖马类动物；指与始祖马相似的早期“像马”的哺乳动物。"},"examples":[{"en":"The fossil site contains several hyracotherians and other small mammals.","zh":"这个化石遗址包含若干始祖马类动物以及其他小型哺乳动物。"},{"en":"Paleontologists compared the teeth of a hyracotherian with those of modern horses.","zh":"古生物学家把一只始祖马类动物的牙齿与现代马的牙齿进行比较。"}]}],"synonyms":["eohippian","early horse","horse-like (early)"],"phonetic":"/ˌhaɪˌrækəˈθɪriən/","extraExplanation":["这个词多见于古生物学与科普写作，不是日常英语。它来自属名 Hyracotherium（历史上常被称作 Eohippus“曙马/始祖马”）加上形容词后缀 -ian，表示“与……有关的/……类的”。","在一些资料里，“Hyracotherium = 现代马的直接祖先”是较旧或简化的说法；现代研究更常把它看作马类进化树上早期、近缘的一支。阅读时可把 hyracotherian 理解为“早期马类/始祖马型”。"]}
{"word":"hyracotheriinae","summary":{"en":"Hyracotheriinae is a taxonomic name for very early horse relatives (often used in older classifications).","zh":"Hyracotheriinae 是一个分类学名称，指非常早期的马类近亲（多见于较旧的分类体系）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (now often historical) subfamily name used for some of the earliest, small, forest-dwelling horse relatives in the Eocene epoch, including the genus Hyracotherium (sometimes called Eohippus).","zh":"（多为历史用法的分类名）指始新世时期一些最早期、体型很小、生活在森林中的马科近亲类群的一个“亚科”名称，包括Hyracotherium（有时俗称“曙马”Eohippus）。"},"examples":[{"en":"Some older textbooks place Hyracotherium in the subfamily Hyracotheriinae.","zh":"一些较旧的教材把 Hyracotherium（始祖马类）归入 Hyracotheriinae 这个亚科。"},{"en":"Fossils linked to Hyracotheriinae help scientists explain how early horses differed from modern horses.","zh":"与 Hyracotheriinae 相关的化石能帮助科学家解释早期马类与现代马的差异。"}]}],"synonyms":["early horse subfamily (informal)","hyracotheres (informal)"],"phonetic":"/ˌhaɪrəkoʊˈθɪri.əˌniː/","extraExplanation":["这是拉丁化的动物分类学名称，结尾 -inae 表示“亚科”。不过不同研究会采用不同的系统分类；有些现代分类不再使用或较少使用 Hyracotheriinae，而是把相关类群放到其他更细的分支中。","Hyracotherium 常被大众科普称为“Eohippus（曙马）”，但两者在学术使用上可能有差异；阅读资料时要注意作者采用的命名体系与年代。"]}
{"word":"Hyracotherium","summary":{"en":"an early, small horse-like mammal known from fossils.","zh":"一种化石所知的早期小型马类近亲哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, early horse-like mammal (genus Hyracotherium) that lived about 55–45 million years ago; often discussed as an early stage in horse evolution.","zh":"一种体型很小的早期马类近亲哺乳动物（属名 Hyracotherium），生活在约5500万到4500万年前；常被用来说明马类演化的早期阶段。"},"examples":[{"en":"In our textbook, Hyracotherium is shown as an early relative of modern horses.","zh":"在我们的课本里，Hyracotherium 被展示为现代马的早期近亲。"},{"en":"Fossils of Hyracotherium suggest it lived in forests and ate soft leaves.","zh":"Hyracotherium 的化石显示它可能生活在森林里，吃柔软的叶子。"}]}],"synonyms":["Eohippus","dawn horse"],"phonetic":"/ˌhaɪrəkəˈθɪriəm/","extraExplanation":["在很多科普或旧教材中，你可能会看到它被称为 Eohippus（意为“黎明之马”）。现代分类学里常将两者视为同一类或近似处理，但不同资料的用法可能不一致。","它常被用作“马的演化”示例：体型像狗那么大，前脚多趾（常被描述为四趾）、后脚三趾，适合在林地行走；后来马科逐渐适应草原与奔跑，趾数减少、身体增大。"],"etymology":"来自新拉丁语属名 Hyracotherium，由希腊语 hyrak-（蹄兔/岩蹄兔，hyrax）+ thērion（野兽、动物）组成；早期命名者觉得它与蹄兔有些相似。","mnemonic":["拆开记：hyrax（蹄兔）+ otherium（像“兽/动物”），联想到“像蹄兔一样的小动物”。","把它和常见别名一起记：Hyracotherium ≈ Eohippus（黎明之马）→ “马的早期版本”。"]}
{"word":"hyracotherium","summary":{"en":"Hyracotherium is an extinct early horse-like mammal from the Eocene, often discussed as a very early relative in horse evolution.","zh":"Hyracotherium 指一种始新世的已灭绝早期类马哺乳动物，常被作为马类进化早期近亲来讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct, small, early horse-like mammal from the Eocene epoch, often described as having multiple toes and living in forested environments.","zh":"一种已灭绝的小型、早期“类马”哺乳动物，生活在始新世时期，常被描述为多趾、适合林地环境。"},"examples":[{"en":"Hyracotherium is often introduced in textbooks as one of the earliest animals in the horse lineage.","zh":"在教材里，Hyracotherium 常被介绍为马类谱系中最早期的动物之一。"},{"en":"Fossils of Hyracotherium suggest it was small and likely moved through forests rather than open grasslands.","zh":"Hyracotherium 的化石显示它体型较小，可能主要在森林中活动，而不是在开阔草原上奔跑。"}]}],"synonyms":["Eohippus (often used in popular writing)"],"phonetic":"/ˌhaɪ.rə.koʊˈθɪr.i.əm/","extraExplanation":["“Hyracotherium”来自希腊语词根：hyraco-（蹄兔/像蹄兔的）+ therion（野兽、动物），字面有“像蹄兔的野兽”之意，但它并不是蹄兔。","在很多英语科普材料里，你也会看到“Eohippus”这个名字。两者常被当作相近或相关的早期马类称呼；不同资料在分类与命名上可能有差异，但在入门学习中可先把它理解为“最早期的小型马类祖先之一”。","用法提示：这是专有名词，通常首字母大写；发音较长，写作与拼写在学术语境（古生物学、进化生物学）中更常见。"]}
{"word":"hyrate","summary":{"en":"Hydrate means to give or get enough water; in chemistry, it can mean forming/being a water-containing compound.","zh":"Hydrate 指补充或获得足够水分；在化学中也指水合/水合物（含水的化合物）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give someone or something enough water (or other fluids) so they do not become dry or dehydrated","zh":"（给人或物）补充足够水分（或液体），使其不缺水/不脱水"},"examples":[{"en":"Drink water regularly to stay hydrated, especially in hot weather.","zh":"要规律喝水保持水分充足，尤其是在炎热天气里。"},{"en":"The nurse reminded him to hydrate after the fever.","zh":"护士提醒他退烧后要补充水分。"}]},{"partOfSpeech":"v.","definition":{"en":"to add water to a substance; to form a compound by combining with water (chemistry)","zh":"（化学）使……水合；向某物中加入水，形成含结晶水的化合物"},"examples":[{"en":"In this reaction, the salt can hydrate and form crystals.","zh":"在这个反应中，这种盐会水合并形成晶体。"}]},{"partOfSpeech":"n.","definition":{"en":"a compound (usually a crystal) that contains water molecules as part of its structure (a “hydrate”)","zh":"（化学）水合物；含结晶水的化合物"},"examples":[{"en":"Copper(II) sulfate hydrate is blue, but the anhydrous form is white.","zh":"硫酸铜水合物是蓝色的，但无水形式是白色的。"}]}],"synonyms":["moisturize","rehydrate","water"],"phonetic":"/ˈhaɪdreɪt/","extraExplanation":["你输入的“hyrate”通常是拼写错误，正确拼写是 **hydrate**。","日常口语里更常说 **drink water**（喝水）或 **stay hydrated**（保持水分充足）。","相关词：**dehydrate**（使脱水/脱水），**hydration**（补水；水合）。"]}
{"word":"hyrax","summary":{"en":"A hyrax is a small, rock-dwelling mammal from Africa and the Middle East.","zh":"hyrax 指生活在非洲和中东、常在岩石区活动的小型哺乳动物“蹄兔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, rabbit-sized mammal found in Africa and the Middle East, with short ears and no visible tail, often living among rocks.","zh":"蹄兔：一种生活在非洲和中东的小型哺乳动物，体型像兔子，耳朵短、尾巴不明显，常栖息在岩石缝隙或山地岩区。"},"examples":[{"en":"We saw a hyrax sunbathing on the rocks in a South African nature reserve.","zh":"我们在南非的一个自然保护区里看到一只蹄兔在岩石上晒太阳。"},{"en":"Hyraxes live in groups and communicate with sharp calls.","zh":"蹄兔群居生活，并用尖锐的叫声交流。"}]}],"synonyms":["rock hyrax","dassie"],"phonetic":"/ˈhaɪˌræks/","extraExplanation":["“hyrax”在生物分类中常指“岩蹄兔”（rock hyrax）。它们外形有点像大型豚鼠或兔子，但并不是啮齿类。一个有趣的知识点是：蹄兔与大象、海牛在演化上有较近的亲缘关系（虽然外形差很多）。","在圣经/古代文献中，hyrax有时被译作“coney”或被误译为“rock rabbit”（岩兔），这会让学习者误以为它是兔子；现代英语里更常用“hyrax”或“rock hyrax”。"]}
{"word":"hyrax-like","summary":{"en":"resembling a hyrax","zh":"类似蹄兔的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a hyrax (a small, rabbit-sized mammal) in appearance or characteristics.","zh":"像蹄兔的；在外形或特征上类似蹄兔的。"},"examples":[{"en":"The fossil skull had a hyrax-like shape, with a short snout and rounded jaw.","zh":"这块化石头骨呈蹄兔般的形状，口鼻短、下颌圆。"},{"en":"The animal’s hyrax-like body and sturdy legs helped it climb rocky slopes.","zh":"它蹄兔似的身体和结实的腿让它能攀爬岩石斜坡。"}]}],"synonyms":["hyraxian","hyraxlike","hyrax-shaped"],"phonetic":"/ˈhaɪræks laɪk/","extraExplanation":["蹄兔（hyrax）是非洲和中东常见的小型哺乳动物，体型像兔子但亲缘关系很特别：现代研究显示它与大象、海牛同属“非洲兽类”一支。英文里用“hyrax-like”多见于动物学、古生物学或科普写作，用来做形态类比。"],"etymology":"由“hyrax（蹄兔）+ -like（像……的）”构成，用来描述外观或特征与蹄兔相似。","mnemonic":["把它拆开记：hyrax（蹄兔）+ like（像）=“像蹄兔的”。","联想中文：看到“hy-”当作“还（hai）”，想成“还像蹄兔一样”→“像蹄兔的”。"]}
{"word":"hyrax-related","summary":{"en":"connected with hyraxes","zh":"与蹄兔有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, resembling, or involving a hyrax (a small, rabbit-like mammal).","zh":"与蹄兔有关的；像蹄兔的；涉及蹄兔的。"},"examples":[{"en":"The museum added a hyrax-related display to its African mammals section.","zh":"博物馆在非洲哺乳动物展区新增了一个与蹄兔有关的展览。"},{"en":"Researchers compared hyrax-related fossils with early elephant relatives.","zh":"研究人员把与蹄兔相关的化石与早期象类亲属作比较。"}]}],"synonyms":["hyrax-associated","hyrax-linked","hyrax-connected"],"phonetic":"/ˈhaɪræks rɪˈleɪtɪd/","extraExplanation":["蹄兔（hyrax）虽然体型不大，但在演化关系上与大象、海牛更近，而不是与兔子或啮齿类更近；因此在科普或论文里常会看到“hyrax-related traits/fossils（与蹄兔相关的特征/化石）”这种表达。"],"etymology":"由“hyrax（蹄兔）+ related（相关的）”构成的复合形容词；常用于学术写作（如动物学、生态学、化石研究）来表示“与蹄兔有关”。","mnemonic":["把它拆开记：hyrax（蹄兔）+ related（相关的）=“蹄兔相关”。看到 related 就想到“某某相关”。"]}
{"word":"hyrax-shaped","summary":{"en":"shaped like a hyrax.","zh":"蹄兔形状的；像蹄兔外形的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the shape or form of a hyrax (a small, rabbit-sized African and Middle Eastern mammal).","zh":"呈蹄兔（常见于非洲与中东的一种小型哺乳动物）外形的；像蹄兔形状的。"},"examples":[{"en":"The artist carved a hyrax-shaped charm from wood.","zh":"艺术家用木头雕了一个蹄兔形状的护身符。"},{"en":"A hyrax-shaped rock sat near the entrance of the cave.","zh":"洞口附近有一块形状像蹄兔的岩石。"}]}],"synonyms":["hyrax-like","hyraxlike","hyrax-formed"],"phonetic":"/ˈhaɪræks ʃeɪpt/","extraExplanation":["蹄兔（hyrax）是一种体型不大、外形有点像豚鼠/兔子的小型哺乳动物，常见于非洲和中东的岩石地带。英语里用“X-shaped”来形容“像X的形状”。"],"etymology":"由“hyrax（蹄兔）+ shaped（……形状的）”构成的复合形容词；shaped 常用于表示“呈……形状”。","mnemonic":["记“shaped = 有……形状的”，看到“X-shaped”就翻译成“X形状的”。","hyrax 发音近似“嗨-拉克斯”，联想“嗨！小动物躲在岩石里（rocks）”，帮助记住它常见于岩石环境。"]}
{"word":"hyraxes","summary":{"en":"Hyraxes are small plant-eating mammals that live among rocks or in trees, mainly in Africa and the Middle East.","zh":"Hyraxes 指“蹄兔”，是一种小型食草哺乳动物，主要生活在非洲和中东的岩石区或树上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, rabbit-sized plant-eating mammals (hyraxes) found mainly in Africa and the Middle East, known for living among rocks or in trees.","zh":"蹄兔（hyraxes）：一种体型像兔子的小型食草哺乳动物，主要分布在非洲和中东，常栖息在岩石缝隙或树上。"},"examples":[{"en":"Hyraxes often sunbathe on warm rocks in the morning.","zh":"蹄兔常在清晨趴在温暖的岩石上晒太阳。"},{"en":"Although they look like rodents, hyraxes are more closely related to elephants than to rabbits.","zh":"虽然看起来像啮齿动物，但蹄兔与大象的亲缘关系比与兔子更近。"}]}],"synonyms":["hyrax","rock hyrax","dassie"],"phonetic":"/ˈhaɪ.ræk.sɪz/","extraExplanation":["“hyraxes”是复数；单数是“hyrax”。发音中常见的易错点是重音在前面：HY-rax。","蹄兔在圣经等古典文本中偶尔出现，英语里有时用较古老的词“coney/rock rabbit”来指代（尤其是岩蹄兔），但现代动物学与科普写作更常用“hyrax”。","它们的脚底有湿润的肉垫，像“吸盘”一样帮助在岩石上攀爬；这一点常被自然纪录片提到。"]}
{"word":"hyraxine","summary":{"en":"An uncommon or nonstandard term; likely a misspelling or a name needing context.","zh":"非常见/非标准用词；多半是拼写变体或专名，需上下文确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it may be a misspelling, a proper name, or a made-up term (for example in fiction or a brand name). If you share the sentence or context, I can help identify the intended word.","zh":"在主流英语词典中不算常见或标准词；可能是拼写错误、专有名词，或人为造词（如小说/品牌名）。如果你提供出现它的句子或上下文，我可以帮你判断原本想表达的词。"},"examples":[{"en":"I couldn’t find “hyraxine” in standard dictionaries; could you paste the sentence where you saw it?","zh":"我在常见词典里查不到“hyraxine”；你能把看到它的句子贴出来吗？"},{"en":"It may be a misspelling—check whether it was meant to be “hyrax” or a similar-looking word.","zh":"它可能是拼写错误——看看是否原本想写“hyrax”（蹄兔）或其他形似的词。"}]}],"extraExplanation":["如果你想表达的是动物“hyrax”（蹄兔），常见写法是 hyrax（复数 hyraxes 或 hyrax）。","如果它出现在药物/化学品/小说设定里，通常需要依赖该作品或领域的专门资料来确定含义与读音。"],"etymology":"可能是由“hyrax（蹄兔）”+“‑ine（英语里常见的后缀，用于表示‘与……有关’或某些化学物质名）”拼成的造词/拼写变体；但缺乏权威词典收录，无法确认其固定来源与用法。","mnemonic":["把它拆成“hyrax（蹄兔）+ -ine（常见后缀）”，先联想到‘跟蹄兔有关的某种东西/物质’，再结合上下文确认。"]}
{"word":"hyrcan","summary":{"en":"“Hyrcan” isn’t a standard English word; it’s usually a misspelling of “hurricane,” meaning a powerful tropical storm (and sometimes used figuratively for something very intense).","zh":"“hyrcan”不是标准英文，通常是“hurricane（飓风）”的拼写错误；“hurricane”指强烈热带风暴，也可作比喻表示“猛烈、混乱的冲击”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) Intended word: “hurricane,” a very strong tropical storm with violent winds and heavy rain.","zh":"（常见拼写错误）你可能想写的是“hurricane”，指热带地区形成的强烈风暴，伴随狂风和暴雨。"},"examples":[{"en":"I think you meant “hurricane,” not “hyrcan.”","zh":"我觉得你想写的是“hurricane”，不是“hyrcan”。"},{"en":"The hurricane forced people to leave the coastal town.","zh":"飓风迫使人们撤离沿海小镇。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation or event that feels sudden, powerful, and chaotic (figurative use).","zh":"（比喻）形容某事来得又快又猛、影响很大、让人措手不及的局面或事件。"},"examples":[{"en":"After the news broke, a hurricane of messages hit my phone.","zh":"消息一传开，我的手机就被“消息风暴”轰炸了。"},{"en":"She entered the office like a hurricane, changing everything in one day.","zh":"她像飓风一样闯进办公室，一天之内就改变了一切。"}]}],"synonyms":["tropical cyclone","typhoon","storm","tempest"],"phonetic":"/ˈhɝɪˌkeɪn/","extraExplanation":["“hyrcan”不是标准英文单词，最常见的对应词是“hurricane”。正确拼写：h-u-r-r-i-c-a-n-e。","“hurricane”在美式英语里重音通常在第一个音节（HUR-ri-cane）。在新闻里常和“Category 1–5（飓风等级）”“evacuation（撤离）”“storm surge（风暴潮）”一起出现。"]}
{"word":"hyrcanian","summary":{"en":"Hyrcanian means “from or relating to Hyrcania,” an ancient region near the Caspian Sea; it can also mean a person from that region in older writing.","zh":"Hyrcanian 指“海尔卡尼亚的/与海尔卡尼亚有关的”（里海附近的古代地区）；旧文献中也可指“海尔卡尼亚人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Hyrcania, an ancient region south and southeast of the Caspian Sea (in parts of modern-day Iran and nearby areas)","zh":"与海尔卡尼亚（Hyrcania）有关的；海尔卡尼亚的（古代里海以南及东南地区，约在今伊朗及其周边）"},"examples":[{"en":"The museum displayed a Hyrcanian seal from the Achaemenid period.","zh":"博物馆展出了一枚阿契美尼德时期的海尔卡尼亚印章。"},{"en":"Some classical writers described a Hyrcanian forest near the Caspian Sea.","zh":"一些古典作家描写了里海附近的海尔卡尼亚森林。"}]},{"partOfSpeech":"n.","definition":{"en":"(in older texts) a person from Hyrcania","zh":"（旧文献中）海尔卡尼亚人；来自海尔卡尼亚的人"},"examples":[{"en":"In the play, a Hyrcanian is mentioned as a foreign warrior.","zh":"在这部戏剧中，提到一位海尔卡尼亚人作为异邦战士。"}]}],"synonyms":["of Hyrcania","Caspian-region (context-dependent)"],"phonetic":"/hɚˈkeɪniən/","extraExplanation":["“Hyrcanian”常见于历史、考古与古典文学语境，属于相对冷僻的地域形容词。","英语里也常见“Hyrcanian Forest(s)”/“Hyrcanian mixed forests”，指伊朗里海南岸一带的古老阔叶林生态区（有时被称为‘里海海尔卡尼亚森林’）。","词源上源自古希腊/拉丁对该地区的称呼（Hyrcania）。在英文文学中，它偶尔作为一种‘异域、古老’的地名意象出现（例如莎士比亚《仲夏夜之梦》中提到“Hyrcanian tiger”）。"]}
{"word":"Hyrem","summary":{"en":"Not a standard dictionary word; likely a misspelling or a proper name.","zh":"非标准词条；多半是拼写错误或专有名词（如人名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name (proper noun). Common nearby spellings include “Hiram” (a male given name) or “harem” (a group of women associated with a man, historically in some cultures).","zh":"不是标准英语单词；更可能是拼写错误或人名（专有名词）。常见相近拼写有 “Hiram”（男性名字）或 “harem”（历史语境中与某男子相关的一群女性/后宫）。"},"examples":[{"en":"I can’t find “Hyrem” in standard dictionaries—did you mean “Hiram” or “harem”?","zh":"标准词典里查不到 “Hyrem”——你想写的是 “Hiram” 还是 “harem” 呢？"},{"en":"If “Hyrem” is a person’s name, please share the context sentence so I can help with pronunciation and meaning.","zh":"如果 “Hyrem” 是人名，请给我一句上下文，我可以帮你判断读音和含义。"}]}],"phonetic":"/ˈhaɪrɛm/","extraExplanation":["为了准确解释：请告诉我你在哪里看到 “Hyrem”（书名/人名/游戏ID/句子里）？","如果你想查的是：\n- Hiram：男性名（常见读音近似 /ˈhaɪrəm/）\n- harem：名词，常见读音 /ˈhɛrəm/（含历史文化语境，用法需谨慎）"],"etymology":"“Hyrem” 本身不常见，可能是对既有词/名字的改写或误拼。若你指的是 “Hiram”，它常见于《圣经》与英语姓名中；若指 “harem”，则来自阿拉伯语词源，带有明显历史文化语境。","mnemonic":["把它当作“可能拼错”的提醒：Hyrem 里有 y，容易把 Hiram 的 i 写成 y。","如果你想的是 harem：记成“ha-”开头、和历史宫廷/后宫语境相关。"]}
{"word":"Hyria","summary":{"en":"a rare ancient Greek place name found mainly in classical references","zh":"主要见于古典文献中的罕见古希腊地名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare proper name used in some classical sources for an ancient place in Greece (not common in modern English)","zh":"（罕见专有名）古典文献中出现的古希腊地名之一（现代英语中不常用）"},"examples":[{"en":"In some classical references, Hyria is listed among smaller ancient Greek settlements.","zh":"在一些古典参考资料里，Hyria 被列为古希腊较小的聚落之一。"},{"en":"I saw the name Hyria in a footnote while reading about Boeotia.","zh":"我在阅读关于玻奥提亚（Boeotia）的内容时，在脚注里看到了 Hyria 这个名字。"}]}],"phonetic":"/ˈhɪriə/","extraExplanation":["注意：Hyria 在现代英语里非常少见，通常只会在古典学、历史地理或考古相关材料中看到。","也有人会把它与拼写相近的 hydria（古希腊的一种“水罐/双耳瓶”）混淆；两者含义与用法不同。"],"etymology":"源自古希腊语地名（拉丁化后进入英语学术写作）。在英文里主要作为古典学/历史地理语境中的专名出现。","mnemonic":["把它当作“history（历史）里的稀有地名”：Hyria ≈ history 里出现的小地名。","看见 -ia 结尾可联想到很多地名（如 Asia, Syria），帮助记住它更像“地名”。"]}
{"word":"hyrian","summary":{"en":"Hyrian is a rare, mostly fictional term meaning “from Hyria” or “a person from Hyria.” It is not a standard everyday English word.","zh":"Hyrian 是一个较罕见、主要出现在虚构作品中的词，通常表示“来自Hyria的/与Hyria有关的”或“来自Hyria的人”，并非日常标准英语常用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; usually in fiction/fandom) relating to or coming from a place or people called “Hyria.” Often used as a made-up/creative adjective or demonym rather than standard English.","zh":"（罕见；多见于虚构作品/同人圈）与名为“Hyria”的地点或族群有关；通常作为创作出来的形容词或族名/地名指称，并非标准英语常用词。"},"examples":[{"en":"In the story, a Hyrian soldier guards the mountain pass.","zh":"在故事里，一名Hyrian士兵守卫着山口。"},{"en":"They described Hyrian ruins that predated the kingdom.","zh":"他们描述了早于王国时代的Hyrian遗迹。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from “Hyria” (a fictional or invented place).","zh":"来自“Hyria”的人（虚构或自创地点）。"},"examples":[{"en":"She introduced herself as a Hyrian from the northern coast.","zh":"她自我介绍说自己是来自北部海岸的Hyrian。"}]}],"synonyms":["Hyria(n) (invented demonym)","(in some contexts) Hylian (different word/spelling)"],"phonetic":"/ˈhaɪriən/","extraExplanation":["“Hyrian”不是主流词典里的常见英文词，更像是作者自创的世界观用词或粉丝用语。如果你是在游戏/动漫/小说里看到它，建议回到原作品确认“Hyrian”具体指哪个国家、种族或语言。","很多人可能把它和《塞尔达传说》里的“*Hylian*（海利亚人）”混淆；两者拼写不同、含义也取决于作品设定。若你想查的是“Hylian”，我也可以给出对应词条与用法。"]}
{"word":"hyrse","summary":{"en":"“hyrse” is not a standard English word; it’s usually a misspelling of “horse,” and sometimes of “hearse.”","zh":"“hyrse”不是标准英文单词；通常是“horse（马）”的误拼，有时也可能是“hearse（灵车）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/incorrect spelling that most commonly is intended to mean “horse.”","zh":"一种不规范/错误拼写，最常见是想写“horse（马）”。"},"examples":[{"en":"I think “hyrse” is a typo—did you mean “horse”?","zh":"我觉得“hyrse”是打字错误——你是不是想写“horse（马）”？"},{"en":"The word “horse” is spelled h-o-r-s-e.","zh":"“horse”的拼写是 h-o-r-s-e。"}]},{"partOfSpeech":"other","definition":{"en":"Sometimes “hyrse” may be a mistaken spelling of “hearse” (a vehicle used to carry a coffin at a funeral).","zh":"有时“hyrse”也可能是把“hearse（灵车）”拼错了（用于葬礼运送棺材的车辆）。"},"examples":[{"en":"Did you mean “hearse,” the funeral vehicle?","zh":"你是不是想写“hearse（灵车）”，就是葬礼用的车？"},{"en":"The hearse arrived quietly at the cemetery.","zh":"灵车安静地到达了墓地。"}]}],"synonyms":["horse","hearse","steed","funeral car"],"phonetic":"/hɔrs/","extraExplanation":["“hyrse”不是现代英语里的标准拼写，常见于打字错误、手写辨认错误或OCR扫描识别错误。","如果你能提供句子上下文（例如整句话/段落），我可以更准确判断你想表达的是“horse”还是“hearse”。"]}
{"word":"hyrst","summary":{"en":"“hyrst” is a rare/archaic spelling of “hurst,” meaning a wooded hill, often found in English place names or as a name.","zh":"“hyrst”是“hurst”的少见/古拼写，意为“长有树林的小山（林丘）”，常见于英国地名或姓名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/rare spelling) a wooded hill or small grove; often seen in English place names.","zh":"（古/少见拼写）长有树林的小山或小树林；常见于英国地名中。"},"examples":[{"en":"The old map labels the area as “hyrst,” meaning a wooded hill.","zh":"老地图把那片区域标为“hyrst”，意思是“长有树林的小山”。"},{"en":"Many English place names end in “-hurst,” once spelled “-hyrst.”","zh":"许多英国地名以“-hurst”结尾，而过去有时拼作“-hyrst”。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname or place name (proper noun) derived from the same root meaning “wooded hill.”","zh":"（专有名词）姓氏或地名，源自同一词根，含义为“林丘/林山”。"},"examples":[{"en":"She traced her family line back to a village called Hyrst.","zh":"她把家族谱系追溯到一个叫 Hyrst 的村庄。"}]}],"synonyms":["hurst","wooded hill","grove"],"phonetic":"/hɝst/","extraExplanation":["“hyrst”多被认为是古英语词源 *hyrst* 的拼写形式，意思接近“树林、林丘（wooded hill）”。现代英语里更常见的拼写是 **hurst**，常作为英国地名构词成分（如某某-hurst）。如果你是想查现代常用词，建议也试试输入 **hurst**。"]}

