{"word":"IB","summary":{"en":"an international school curriculum and diploma system","zh":"国际课程与文凭体系"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"International Baccalaureate: an international education program and set of qualifications for students (often including the DP for ages 16–19).","zh":"国际文凭组织（IB）：一种国际教育课程与学历体系（常见为16–19岁参加的DP课程）。"},"examples":[{"en":"She is in the IB program at her high school.","zh":"她在高中读IB课程。"},{"en":"Many universities recognize IB scores for admission or credit.","zh":"很多大学认可IB成绩用于录取或抵学分。"}]},{"partOfSpeech":"n.","definition":{"en":"IB (informal): the International Baccalaureate Diploma Programme (DP).","zh":"（口语）IB：特指IB文凭课程（DP）。"},"examples":[{"en":"IB is tough, but it helps you learn time management.","zh":"IB很有挑战，但能帮助你学会时间管理。"},{"en":"He chose IB instead of AP classes.","zh":"他选择了IB而不是AP课程。"}]}],"synonyms":["International Baccalaureate","IB Diploma","Diploma Programme"],"phonetic":"ˌaɪ ˈbiː","extraExplanation":["IB（国际文凭组织）提供多种项目：PYP（小学项目）、MYP（中学项目）、DP（大学预科/文凭项目）、CP（职业相关项目）。日常说“读IB”多半指DP。","在英美语境里，IB常与AP并列讨论：IB更强调跨学科、研究与写作（如EE拓展论文、TOK知识理论、CAS活动）。"],"etymology":"IB是“International Baccalaureate”的缩写。Baccalaureate源自中世纪拉丁语，原指获得学位的资格，后来在教育语境中表示“文凭/毕业资格”。","mnemonic":["把IB记成“I’m Busy（我很忙）”：读IB常常作业多、节奏快，很形象。","I = International（国际），B = Baccalaureate（文凭/资格）：国际 + 文凭。"]}
{"word":"ib","summary":{"en":"“IB” is a common abbreviation, most often for the International Baccalaureate; it can also mean “inbox” (DM me) or “inbound” in business contexts.","zh":"“IB”是常见缩写，最常指国际文凭组织（IB）；也可能在网络语境指“私信”，或在商业语境指“inbound（呼入/引流来的）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"International Baccalaureate: an international education program (and its diplomas) for middle and high school students.","zh":"国际文凭组织（IB）：一种面向中学阶段的国际课程体系及其文凭（如IBDP）。"},"examples":[{"en":"She’s in the IB Diploma Programme this year.","zh":"她今年在读IB文凭课程（IBDP）。"},{"en":"Many universities recognize IB scores for admission.","zh":"很多大学在录取时认可IB成绩。"}]},{"partOfSpeech":"other","definition":{"en":"(online slang) “inbox”: used to say you sent someone a private message.","zh":"（网络用语）“inbox/私信”：表示已给对方发了私信。"},"examples":[{"en":"IB—check your messages.","zh":"我私信你了——去看一下。"},{"en":"If you want the details, IB me.","zh":"想要细节的话，私信我。"}]},{"partOfSpeech":"other","definition":{"en":"(business/marketing) “inbound”: relating to customers who contact a company first (e.g., inbound leads).","zh":"（商业/营销）“inbound/引流来的”：指由客户主动找上门的（如“inbound leads”）。"},"examples":[{"en":"We’re focusing on IB leads this quarter.","zh":"我们这季度重点做inbound（IB）线索。"},{"en":"Inbound (IB) support handled most of the calls today.","zh":"今天大多数电话由inbound（IB）客服处理。"}]}],"synonyms":["International Baccalaureate","inbox (DM)","inbound"],"phonetic":"/ˌaɪˈbiː/","extraExplanation":["“IB”在不同语境里含义差别很大。最常见的正式含义是教育领域的 International Baccalaureate；在社交平台（尤其是聊天/评论区）里也常被当作“inbox（私信）”；在营销/客服语境中可能指“inbound（呼入/引流来的）”。","发音通常按字母读：I-B。正式写法多为大写“IB”。"]}
{"word":"iba","summary":{"en":"IBA is most commonly the acronym for the International Bar Association, and it can also refer to other organizations whose names shorten to IBA depending on context.","zh":"IBA 最常见指“国际律师协会”的缩写；也可能在不同语境中指代其他名称缩写为 IBA 的机构或组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Acronym) International Bar Association: a global organization of lawyers and bar associations.","zh":"（缩写）国际律师协会：由全球律师与各国律师协会组成的国际性组织。"},"examples":[{"en":"She attended the IBA conference to meet lawyers from around the world.","zh":"她参加了国际律师协会（IBA）的会议，去结识来自世界各地的律师。"},{"en":"The IBA publishes reports on legal ethics and the rule of law.","zh":"国际律师协会（IBA）会发布有关法律职业伦理与法治的报告。"}]},{"partOfSpeech":"n.","definition":{"en":"(Acronym) In some contexts, a short name for a specific institution or organization (for example, a university or business group) that uses the letters IBA.","zh":"（缩写）在某些语境中，用来指代名称首字母为 IBA 的特定机构或组织（例如某所大学或某个商业集团）。"},"examples":[{"en":"He earned his MBA from IBA in Karachi.","zh":"他在卡拉奇的 IBA 获得了工商管理硕士（MBA）学位。"},{"en":"Check IBA’s website for the application deadline.","zh":"申请截止日期请查看 IBA 的官网。"}]}],"synonyms":["International Bar Association (full name)"],"phonetic":"/ˌaɪ biː ˈeɪ/","extraExplanation":["“IBA”通常是大写的缩写词，读作字母音（I-B-A）。具体指什么要看上下文：在法律领域最常见的是 International Bar Association（国际律师协会）；在教育领域也可能指某些学校或机构（例如巴基斯坦的 Institute of Business Administration 常简称 IBA）。写作时第一次出现最好写全称，后面再用 IBA。"]}
{"word":"ibad","summary":{"en":"Ibad is usually a male name, and in Arabic/Islamic usage it can mean “servants/worshippers (of God).”","zh":"Ibad 通常是男性名字；在阿语/伊斯兰语境中也可指“（真主的）仆人/敬拜者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) A masculine given name used in Arabic- and Urdu-speaking communities, often understood as “worshipper/servant (of God).”","zh":"（人名）男性名字，常见于阿拉伯语/乌尔都语语境中，常被理解为“敬拜者/真主的仆人”。"},"examples":[{"en":"Ibad introduced himself at the meeting.","zh":"伊巴德在会议上做了自我介绍。"},{"en":"In some families, the name Ibad reflects a religious meaning.","zh":"在一些家庭中，名字 Ibad 带有宗教含义。"}]},{"partOfSpeech":"n.","definition":{"en":"(Islamic/Arabic context) “Servants of God; worshippers,” from Arabic ʿibād (عباد).","zh":"（伊斯兰/阿语语境）“真主的仆人；敬拜者”，源自阿拉伯语 ʿibād（عباد）。"},"examples":[{"en":"The text speaks of the righteous as ibad of God.","zh":"这段文字把义人称为真主的 ibad（仆人）。"},{"en":"In translation, ibad is often rendered as “servants” or “worshippers.”","zh":"在翻译中，ibad 常译为“仆人”或“敬拜者”。"}]}],"synonyms":["worshippers","servants (of God)"],"phonetic":"/ɪˈbɑd/","extraExplanation":["“Ibad/ʿibād”来自阿拉伯语词根 ع-ب-د（ʿ-b-d），与“崇拜、服侍”相关；你可能也见过相关词：ʿibādah（عبادة，意为“崇拜/礼拜”）、ʿabd（عبد，意为“仆人/奴仆”，也常见于人名如 Abdullah=“真主的仆人”）。","如果你是想查另一个拼写（例如 Ibadi 指“伊巴德派”），告诉我上下文或完整句子，我可以给你最准确的词条。"]}
{"word":"Ibadi","summary":{"en":"connected with Ibadism or a person who follows it","zh":"与伊巴德派有关；或指伊巴德派信徒"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Ibadism, a branch of Islam found especially in Oman and parts of North and East Africa","zh":"伊巴德派的；与伊巴德派（伊斯兰教的一支，尤见于阿曼及北非、东非部分地区）有关的"},"examples":[{"en":"Oman’s majority population is Ibadi.","zh":"阿曼的大多数人口属于伊巴德派。"},{"en":"The museum includes manuscripts from Ibadi communities.","zh":"这座博物馆收藏了来自伊巴德派社群的手稿。"}]},{"partOfSpeech":"n.","definition":{"en":"a follower of Ibadism","zh":"伊巴德派信徒；伊巴德派成员"},"examples":[{"en":"As an Ibadi, he described local religious customs to visitors.","zh":"作为一名伊巴德派信徒，他向来访者介绍了当地的宗教习俗。"},{"en":"Ibadis have their own legal and theological traditions within Islam.","zh":"伊巴德派在伊斯兰教内部有其独特的法学与神学传统。"}]}],"synonyms":["Ibadism","Ibadi Islam"],"phonetic":"/ɪˈbɑːdi/","extraExplanation":["学习提示：伊巴德派通常被视为伊斯兰教中的一个独立分支（与逊尼派、什叶派并列提及），在历史上与早期“哈瓦利吉派”有渊源，但现代语境中常强调其独立发展与温和、务实的社群传统。不同资料对其历史归类的表述可能不同，阅读时可注意作者立场与时代背景。"],"etymology":"来自阿拉伯语 Ibāḍī，源于早期人物 ʿAbd Allāh ibn Ibāḍ（伊本·伊巴德）的名字；用来指与其相关的宗教社群与传统。","mnemonic":["把它记成“伊巴德（Ibadi）= 伊巴德派（Ibadism）的形容词/名词形式”：看到 -i 结尾，常表示“某某…的/某某人”。","联想地名：阿曼（Oman）常与 Ibadi 一起出现——“阿曼—伊巴德派”是高频搭配。"]}
{"word":"ibadite","summary":{"en":"An Ibadite is a follower of Ibadism, or something related to that Islamic tradition.","zh":"Ibadite 指伊巴德派（伊巴德主义）的信徒，或与该伊斯兰传统有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Ibadism, a branch of Islam (most commonly associated today with Oman and parts of North and East Africa)","zh":"伊巴德派（伊巴德主义）的信徒；伊斯兰教的一个派别（当今多与阿曼及北非、东非部分地区相关）"},"examples":[{"en":"Many people in Oman are Ibadites.","zh":"阿曼有许多人是伊巴德派信徒。"},{"en":"The museum has an exhibit on Ibadite history and culture.","zh":"这家博物馆有一个关于伊巴德派历史与文化的展览。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Ibadism or its followers","zh":"伊巴德派的；与伊巴德主义或其信徒有关的"},"examples":[{"en":"Ibadite scholars produced important works on law and theology.","zh":"伊巴德派学者在法律与神学方面写下了重要著作。"},{"en":"They visited an Ibadite mosque during their trip.","zh":"旅行期间他们参观了一座伊巴德派清真寺。"}]}],"synonyms":["Ibadi"],"phonetic":"/ˈiːbəˌdaɪt/","extraExplanation":["“Ibadite / Ibadi”源自早期伊斯兰历史传统中的人物名称（常与阿卜杜拉·伊本·伊巴德 Abdullah ibn Ibad 相关）。在现代英语中，更常见的拼写是“Ibadi”（名词/形容词），而“Ibadite”属于同义但较少用、偏学术或历史语境的形式。"]}
{"word":"Ibaloi","summary":{"en":"the Ibaloi people of northern Luzon, or their language; also used as an adjective","zh":"指菲律宾吕宋岛北部的伊巴洛伊人或伊巴洛伊语，也可作形容词"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people mainly from the Benguet area in the Cordillera region of northern Luzon, Philippines","zh":"伊巴洛伊人：主要分布于菲律宾吕宋岛北部科迪勒拉山区（尤其本格特省）的一支原住民族群成员"},"examples":[{"en":"Many Ibaloi communities live in the highlands of Benguet.","zh":"许多伊巴洛伊社区居住在本格特的高地地区。"},{"en":"The museum features Ibaloi weaving and traditional tools.","zh":"博物馆展出了伊巴洛伊的织品和传统工具。"}]},{"partOfSpeech":"n.","definition":{"en":"the Austronesian language traditionally spoken by the Ibaloi people","zh":"伊巴洛伊语：伊巴洛伊人传统使用的一种南岛语系语言"},"examples":[{"en":"Her grandparents speak Ibaloi at home.","zh":"她的祖父母在家里讲伊巴洛伊语。"},{"en":"The booklet includes basic greetings in Ibaloi.","zh":"这本小册子收录了伊巴洛伊语的基本问候语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ibaloi people or their language and culture","zh":"与伊巴洛伊人、伊巴洛伊语或其文化相关的"},"examples":[{"en":"They attended an Ibaloi cultural festival.","zh":"他们参加了伊巴洛伊文化节。"},{"en":"The class studied Ibaloi oral traditions.","zh":"这门课学习了伊巴洛伊的口述传统。"}]}],"synonyms":["Ibaloy"],"phonetic":"/ˌiːbəˈlɔɪ/","extraExplanation":["在英语里，许多族名也同时指该族语言（例如 “a Tagalog / speak Tagalog”）。因此 Ibaloi 既可指“伊巴洛伊人”，也可指“伊巴洛伊语”。","作为专有名词，通常首字母大写：Ibaloi。"],"etymology":"源自民族名称“i-”+“Baloi/Badui”等地名或族群称呼的构词方式（在菲律宾一些语言中，i- 常有“来自……的人/属于……的人”的含义）；英语中用作族名与语言名。","mnemonic":["把 I- 理解为“某地的人”（类似“来自……的”），后面是族名 Baloi：Ibaloi = “巴洛伊人/伊巴洛伊人”。","读音像“ee-buh-LOY”，最后重音在 -loy，上扬记成“LOY（loy）”。"]}
{"word":"Ibaloy","summary":{"en":"an Indigenous people (and related language/culture) of northern Luzon in the Philippines","zh":"菲律宾吕宋岛北部的原住民族群（及其语言与文化）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of an Indigenous ethnolinguistic group traditionally living in the Benguet area of the Cordillera region in northern Luzon, Philippines.","zh":"菲律宾吕宋岛北部科迪勒拉山区（以本格特省一带为主）的原住民族群成员。"},"examples":[{"en":"Many Ibaloy families have long lived around Baguio and Benguet.","zh":"许多伊巴洛伊人长期居住在碧瑶及本格特一带。"},{"en":"The museum exhibit highlights Ibaloy history, land, and traditions.","zh":"该博物馆展览呈现伊巴洛伊人的历史、土地与传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Ibaloy people or their language and culture.","zh":"与伊巴洛伊人或其语言、文化相关的。"},"examples":[{"en":"She is learning Ibaloy songs for the cultural festival.","zh":"她正在学习伊巴洛伊族的歌曲，准备参加文化节。"},{"en":"The article discusses Ibaloy weaving practices.","zh":"这篇文章讨论了伊巴洛伊族的织布传统。"}]}],"synonyms":["Ibaloi"],"phonetic":"ˌiːbəˈlɔɪ","extraExplanation":["在菲律宾语境中，Ibaloy 既可指“族群/族人”，也常用来指其语言（有时写作 Ibaloi language）。在英文写作里通常首字母大写，表示专有名词。"],"etymology":"来自菲律宾本土族名（ethnonym），常见拼写变体为 Ibaloi；用于指称该族群及其语言与文化。","mnemonic":["把发音记成“ee-buh-LOY（伊-巴-洛伊）”，最后重音在“LOY”，像在说“洛伊”。","联想“Baguio（碧瑶）/Benguet（本格特）”这两个地名：常与该族群文化介绍一起出现。"]}
{"word":"iban","summary":{"en":"IBAN is the International Bank Account Number, a standardized code used to identify a bank account for international transfers.","zh":"IBAN 是国际银行账户号码，用于国际转账时标准化识别银行账户。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"International Bank Account Number (IBAN): a standardized code used to identify a specific bank account for international payments.","zh":"国际银行账户号码（IBAN）：一种标准化编码，用于在国际汇款中识别某个具体的银行账户。"},"examples":[{"en":"Please enter your IBAN so we can send the refund by bank transfer.","zh":"请填写你的 IBAN，我们才能通过银行转账退还款项。"},{"en":"My bank asked for the recipient’s IBAN and BIC to complete the international transfer.","zh":"我的银行要求提供收款人的 IBAN 和 BIC 才能完成国际汇款。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, the IBAN field/details on banking forms or payment pages.","zh":"引申义：银行表格或支付页面上的“IBAN”栏/IBAN 信息。"},"examples":[{"en":"The payment failed because the IBAN field was left blank.","zh":"支付失败了，因为 IBAN 一栏没有填写。"},{"en":"Double-check the IBAN details before you submit the transfer.","zh":"提交转账前请再次核对 IBAN 信息。"}]}],"synonyms":["International Bank Account Number","IBAN number (common but redundant)"],"phonetic":"/ˈaɪ.bæn/","extraExplanation":["IBAN 主要在欧洲及许多其他国家/地区使用，用来减少跨境转账出错；在美国通常更多使用路由号（routing number）和账号（account number）。","IBAN 是“账号标识格式”，不是银行卡号（card number）。很多国家的 IBAN 长度不同，通常由国家代码（如 DE、FR）、校验位和银行/账户信息组成。","常与 BIC/SWIFT code 搭配出现：IBAN 标识“哪个账户”，BIC/SWIFT 标识“哪家银行”。"]}
{"word":"ibanag","summary":{"en":"Ibanag refers to an ethnic group in northern Philippines and also the language they speak; it can also be used as an adjective about their culture.","zh":"Ibanag 指菲律宾北部的伊巴纳格族及其语言，也可作形容词表示与其文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to the Ibanag ethnic group of northern Philippines (mainly in the Cagayan Valley region).","zh":"伊巴纳格族人（菲律宾北部族群，主要分布在卡加延河谷地区）。"},"examples":[{"en":"My classmate is Ibanag, and her family is from Cagayan.","zh":"我的同学是伊巴纳格族，她家来自卡加延。"},{"en":"The festival featured Ibanag dances and traditional food.","zh":"节庆活动展示了伊巴纳格舞蹈和传统食物。"}]},{"partOfSpeech":"n.","definition":{"en":"the Austronesian language spoken by many Ibanag people in the Cagayan Valley.","zh":"伊巴纳格语（奥斯特罗尼西亚语系语言，主要在菲律宾卡加延河谷使用）。"},"examples":[{"en":"He can speak Ibanag at home but uses English at school.","zh":"他在家会说伊巴纳格语，但在学校用英语。"},{"en":"This story was translated from Ibanag into Filipino.","zh":"这个故事从伊巴纳格语翻译成了菲律宾语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ibanag people or their language and culture.","zh":"与伊巴纳格族或其语言、文化有关的。"},"examples":[{"en":"She is researching Ibanag history and oral traditions.","zh":"她正在研究伊巴纳格族历史和口述传统。"},{"en":"We tried an Ibanag dish made with local ingredients.","zh":"我们尝了一道用当地食材做的伊巴纳格菜。"}]}],"synonyms":["Ibanag people","Ibanag language"],"phonetic":"/ˈiːbəˌnɑɡ/","extraExplanation":["“Ibanag”既可以指族群，也可以指语言；在英文里常用同一个词表示两者，具体含义靠上下文判断。","它主要与菲律宾北部的卡加延省（Cagayan）及周边地区相关；谈地理文化时常会一起出现 “Cagayan Valley（卡加延河谷）”。","拼写有时会见到大小写变化：作为族群/语言名称通常首字母大写（Ibanag）；作为形容词也常大写。"]}
{"word":"iberes","summary":{"en":"“Iberes” is a rare historical term meaning the ancient Iberians, mostly found in classical or Latin contexts.","zh":"“Iberes”是一个罕见的历史用语，指古代的伊比利人，多见于古典学或拉丁语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, historical) An ancient people of the Iberian Peninsula (roughly modern Spain and Portugal); the Iberians. Also used as the Latin plural of “Iber.”","zh":"（罕见，历史用语）伊比利亚半岛（约今西班牙和葡萄牙）古代的民族：伊比利人。也可作“Iber”的拉丁语复数。"},"examples":[{"en":"In some classical histories, the Iberes are described as living along the eastern coast of the peninsula.","zh":"在一些古典史书中，Iberes 被描述为居住在半岛东海岸。"},{"en":"Modern writers usually say “Iberians” instead of “Iberes.”","zh":"现代作者通常用“Iberians”，而不是“Iberes”。"}]}],"synonyms":["Iberians","Iberian peoples"],"phonetic":"/aɪˈbɪriz/","extraExplanation":["“Iberes”多见于古典学、古代史或拉丁文语境，属于比较书面、学术、且不常用的形式。日常英语里几乎都用“Iberians（伊比利人）”。","如果你输入“iberes”是想查西班牙语或法语中的词，或其实想查“Iberia / Iberian”，告诉我上下文句子，我可以帮你确认最合适的词条。"]}
{"word":"iberi","summary":{"en":"Iberi refers to the ancient Iberian people of the Iberian Peninsula (mainly in what is now Spain).","zh":"Iberi 指伊比利亚半岛上的古代伊比里人（主要在今西班牙一带）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient people who lived mainly in the eastern and southern parts of the Iberian Peninsula (modern Spain and Portugal), especially before and during early Roman times","zh":"伊比里人；古代居住在伊比利亚半岛（今西班牙与葡萄牙）东部与南部的民族，尤其在罗马早期以前及期间"},"examples":[{"en":"The Iberi lived in parts of eastern Spain before Roman rule spread across the peninsula.","zh":"在罗马统治扩展到整个半岛之前，伊比里人生活在西班牙东部的一些地区。"},{"en":"Some museum exhibits compare Iberi artifacts with those of neighboring Celtic groups.","zh":"一些博物馆展品会把伊比里人的器物与邻近的凯尔特族群作比较。"}]}],"synonyms":["Iberians","Iberian people","Iberian peoples"],"phonetic":"/aɪˈbɪri/","extraExplanation":["“Iberi”在英语里较少单独使用，更常见的是“Iberians（伊比里人）”“Iberian（伊比利亚的/伊比里人的）”或“Iberia（伊比利亚半岛）”。如果你想表达“西班牙/葡萄牙相关”，日常英语通常用“Iberian”。","注意不要与“Ebro（埃布罗河）”或“Berber（柏柏尔人）”混淆。历史语境下，“Iberi”也可能出现在学术写作中，作为“Iberian peoples”的一种写法。"]}
{"word":"Iberia","summary":{"en":"the Iberian Peninsula (Spain and Portugal); also the name of Spain’s national airline","zh":"伊比利亚半岛（西班牙与葡萄牙地区）的称呼；也指西班牙国家航空公司名称"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical and geographic name for the Iberian Peninsula, mainly referring to Spain and Portugal","zh":"（历史与地理用语）伊比利亚：指伊比利亚半岛，主要包括西班牙和葡萄牙"},"examples":[{"en":"The Romans called much of the region Iberia.","zh":"罗马人把那一大片地区称为伊比利亚。"},{"en":"Portugal and Spain share the Iberia landmass, the Iberian Peninsula.","zh":"葡萄牙和西班牙同处伊比利亚这块陆地——伊比利亚半岛。"}]},{"partOfSpeech":"n.","definition":{"en":"Spain’s national airline (brand name)","zh":"伊比利亚航空（西班牙的国家航空公司品牌名）"},"examples":[{"en":"We flew to Madrid on Iberia.","zh":"我们搭乘伊比利亚航空飞往马德里。"},{"en":"Iberia has many routes between Europe and Latin America.","zh":"伊比利亚航空在欧洲与拉丁美洲之间有许多航线。"}]}],"synonyms":["Iberian Peninsula"],"phonetic":"/aɪˈbɪriə/","extraExplanation":["在英语语境里，Iberia多用于历史、地理、文化讨论（如“古伊比利亚人”“罗马时期的伊比利亚”）。现代日常谈地理更常说“the Iberian Peninsula”。","在航旅语境里，Iberia常直接指航空公司；写作时首字母大写。"],"etymology":"源自拉丁语“(H)iberia”，古代对伊比利亚半岛的称呼；英语沿用该历史地名。","mnemonic":["把它拆成“Iber- + -ia”，联想到“伊比利亚(半岛)”这一固定译名。","记忆联想：Iberia ≈ “I-ber-ia” 听起来像“伊-贝-利-亚”，和中文音译接近，容易对上。"]}
{"word":"iberia","summary":{"en":"Iberia usually means the Iberian Peninsula (Spain and Portugal), and can also be a poetic/historical name for Spain.","zh":"Iberia通常指伊比利亚半岛（西班牙与葡萄牙），也可作诗意/历史用语指西班牙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A region in southwestern Europe that includes Spain and Portugal; often called the Iberian Peninsula.","zh":"伊比利亚（半岛）：欧洲西南部地区，主要包括西班牙和葡萄牙，常称“伊比利亚半岛”。"},"examples":[{"en":"Spain and Portugal share the Iberian Peninsula.","zh":"西班牙和葡萄牙共享伊比利亚半岛。"},{"en":"Iberia has a rich mix of languages, food, and history.","zh":"伊比利亚拥有丰富多样的语言、饮食与历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A poetic or historical name for Spain (and sometimes Spain and Portugal together), especially in older writing.","zh":"（诗意或历史用法）伊比利亚：对西班牙（有时也泛指西班牙与葡萄牙）的称呼，多见于较旧的文章或文学语境。"},"examples":[{"en":"In old poems, “Iberia” sometimes means Spain.","zh":"在一些旧诗中，“Iberia”有时指西班牙。"},{"en":"The writer described the sunlit hills of Iberia.","zh":"作者描写了伊比利亚阳光照耀的丘陵。"}]}],"synonyms":["the Iberian Peninsula","Spain (poetic)"],"phonetic":"/aɪˈbɪriə/","extraExplanation":["“Iberia”源自古希腊/古罗马对该地区的称呼（与古地名“Hiberia”相关），后来在英文里既可作地理名词（伊比利亚半岛），也常带一点文学色彩，用来指代西班牙。","注意区分：英语里国家“Spain/Portugal”和地区“Iberia/Iberian Peninsula”不完全等同；说“Iberian”通常是“伊比利亚的（西班牙与葡萄牙相关的）”。"]}
{"word":"Iberia-related","summary":{"en":"connected with the Iberian Peninsula or with Iberia (often the airline), depending on context","zh":"与伊比利亚半岛相关；或在特定语境下与伊比利亚航空相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with Iberia, especially the Iberian Peninsula (Spain and Portugal) or Iberian culture, history, or languages.","zh":"与伊比利亚有关的；尤指与伊比利亚半岛（西班牙和葡萄牙）或其文化、历史、语言相关的。"},"examples":[{"en":"The museum has a special exhibit on Iberia-related art from the Middle Ages.","zh":"博物馆有一个关于中世纪伊比利亚相关艺术的特别展览。"},{"en":"She’s doing research on Iberia-related trade routes across the Mediterranean.","zh":"她在研究与伊比利亚相关的地中海贸易路线。"},{"en":"We studied Iberia-related influences in Latin American Spanish.","zh":"我们学习了拉丁美洲西班牙语中与伊比利亚相关的影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"Connected with Iberia (often meaning the Spanish airline Iberia) in travel or business contexts.","zh":"（旅行/商业语境）与伊比利亚航空（Iberia，西班牙航空公司）有关的。"},"examples":[{"en":"For Iberia-related baggage issues, contact the airline directly.","zh":"如遇伊比利亚航空相关的行李问题，请直接联系航空公司。"},{"en":"The app shows Iberia-related flight updates in real time.","zh":"这个应用会实时显示伊比利亚航空相关的航班动态。"}]}],"synonyms":["Iberian","Iberian Peninsula–related","Spain-and-Portugal-related","Iberia-associated","connected to Iberia"],"phonetic":"/aɪˈbɪriə rɪˈleɪtɪd/","extraExplanation":["“Iberia-related”在学术/历史/文化语境里通常指“伊比利亚半岛相关”。在机场、机票、客服等语境里，也常被理解为“伊比利亚航空相关”。看上下文最准确。","更常见的自然表达是用形容词“Iberian”（如 Iberian culture/peninsula）。 “Iberia-related”更像一种说明性的组合写法。"],"etymology":"“Iberia”源自拉丁语 Hiberia（对伊比利亚半岛的称呼），后用来指西班牙与葡萄牙所在地区；“-related”表示“与……有关的”。","mnemonic":["记法：Iberia = 伊比利亚（伊比利亚半岛/伊比利亚航空），related = 相关的；合起来就是“伊比利亚相关”。","联想：Iberian（伊比利亚的）更短更常用；看到“related”就知道是“说明性：跟……有关”。"]}
{"word":"Iberian","summary":{"en":"Iberian means “from or relating to Spain and Portugal (the Iberian Peninsula),” and can also refer to a person from that region.","zh":"Iberian 指“与伊比利亚半岛（西班牙与葡萄牙）相关的”，也可指该地区的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Iberian Peninsula (Spain and Portugal).","zh":"与伊比利亚半岛（西班牙和葡萄牙）有关的。"},"examples":[{"en":"Iberian culture includes traditions from both Spain and Portugal.","zh":"伊比利亚文化包含了西班牙和葡萄牙的传统。"},{"en":"The Iberian Peninsula is in southwest Europe.","zh":"伊比利亚半岛位于欧洲西南部。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Iberian Peninsula.","zh":"伊比利亚半岛的人；西班牙或葡萄牙人（泛指）。"},"examples":[{"en":"The museum exhibit focused on ancient Iberians.","zh":"博物馆展览聚焦于古代伊比利亚人。"},{"en":"Romans wrote about the Iberians who lived in the region.","zh":"罗马人曾记载居住在该地区的伊比利亚人。"}]}],"synonyms":["Spanish and Portuguese (contextual)","Iberia-related","peninsular (contextual)"],"phonetic":"/aɪˈbɪriən/","extraExplanation":["“Iberian”来自拉丁语“Iberia”，常用于地理、历史与文化语境。现代英语里它通常是中性、学术性的说法（如“Iberian Peninsula / Iberian languages / Iberian cuisine”）。","在历史学中，“the Iberians”有时特指古代居住在半岛东南部的一些民族（史前/古典时期），不完全等同于现代的“西班牙人/葡萄牙人”。"]}
{"word":"iberian","summary":{"en":"Iberian usually means “related to Spain and Portugal (the Iberian Peninsula),” and less commonly refers to a person from that region.","zh":"Iberian 通常表示“与西班牙和葡萄牙所在的伊比利亚半岛有关的”，较少情况下也可指“伊比利亚半岛的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Iberian Peninsula (Spain and Portugal).","zh":"与伊比利亚半岛（西班牙和葡萄牙）有关的；伊比利亚的。"},"examples":[{"en":"Iberian culture reflects influences from Spain, Portugal, and earlier civilizations.","zh":"伊比利亚文化融合了西班牙、葡萄牙以及更早文明的影响。"},{"en":"She studied Iberian history in college.","zh":"她在大学里学习伊比利亚历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Iberian Peninsula; a Spaniard or Portuguese (less common in everyday use).","zh":"伊比利亚半岛的人；（较少日常使用）指西班牙人或葡萄牙人。"},"examples":[{"en":"The museum exhibit featured the lives of ancient Iberians.","zh":"博物馆展览展示了古代伊比利亚人的生活。"},{"en":"Trade connected Iberians with other Mediterranean peoples.","zh":"贸易把伊比利亚人和其他地中海民族联系在一起。"}]}],"synonyms":["Spanish and Portuguese (context-dependent)","from the Iberian Peninsula"],"phonetic":"/aɪˈbɪriən/","extraExplanation":["“Iberian”来自拉丁语 *Hiberia*（古罗马对伊比利亚半岛的称呼之一）。在历史语境中，复数 “Iberians” 常常特指罗马统治前后居住在半岛上的一些古代民族，因此在学术/历史写作里更常见。","常见搭配：Iberian Peninsula（伊比利亚半岛）、Iberian ham（伊比利亚火腿，常指西班牙的 jamón ibérico）、Iberian lynx（伊比利亚猞猁）。"]}
{"word":"Iberians","summary":{"en":"People from Spain and Portugal (or, in historical contexts, an ancient pre-Roman people of the peninsula).","zh":"西班牙与葡萄牙所在半岛的人（或在历史语境中指罗马之前的古代族群）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from the Iberian Peninsula (mainly Spain and Portugal), or relating to that region.","zh":"伊比利亚半岛（主要是西班牙、葡萄牙）的人；或与该地区有关的事物。"},"examples":[{"en":"The Iberians have a long history of seafaring and trade.","zh":"伊比利亚半岛的人有悠久的航海与贸易历史。"},{"en":"Iberian cultures include Spanish and Portuguese traditions.","zh":"伊比利亚文化包括西班牙和葡萄牙的传统。"}]},{"partOfSpeech":"n.","definition":{"en":"An ancient pre-Roman people who lived in parts of the Iberian Peninsula, especially the east and south, known from archaeology and early historical sources.","zh":"古代伊比利亚人：罗马征服之前生活在伊比利亚半岛部分地区（尤其东部与南部）的民族，主要见于考古与早期史料记载。"},"examples":[{"en":"Archaeologists study Iberians through their inscriptions, pottery, and settlements.","zh":"考古学家通过碑铭、陶器和聚落来研究古代伊比利亚人。"},{"en":"Before Roman rule, several groups, including the Iberians, lived on the peninsula.","zh":"在罗马统治之前，半岛上居住着包括古代伊比利亚人在内的多个族群。"}]}],"synonyms":["Iberian people","Spaniards","Portuguese"],"phonetic":"/aɪˈbɪriən/","extraExplanation":["写作中“Iberians”常指“西班牙人和葡萄牙人（作为一个地区整体）”，但在历史/考古语境里也可能专指“古代伊比利亚人”。理解时可看上下文：出现“pre-Roman/archaeology/inscriptions”等词时，多半指古代民族。"],"etymology":"源自拉丁语“Iberia”（伊比利亚），可能与古人对半岛河流名称（如埃布罗河一带）的称呼有关；英语形容词/名词“Iberian”指“伊比利亚的/伊比利亚人”，复数为“Iberians”。","mnemonic":["把“Iber-”联想到“Ebro（埃布罗河）/Iberia（伊比利亚）”，看到“Iberians”就想到“伊比利亚半岛的人”。","记忆小法：Iberia ≈ “I + beer + ia”（我+啤酒+呀）→ 联想到西班牙/葡萄牙的饮食文化与地区名。"]}
{"word":"iberians","summary":{"en":"“Iberians” means people from Iberia, especially Spain and Portugal, often used in historical or geographic contexts.","zh":"“Iberians”指伊比利亚人，尤其是来自西班牙和葡萄牙的人，常用于历史或地理语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Iberia, especially the Iberian Peninsula (Spain and Portugal); can refer to ancient peoples of the region or to modern Spaniards/Portuguese in a broad sense","zh":"伊比利亚人：来自伊比利亚地区的人，尤其指伊比利亚半岛（西班牙和葡萄牙）的人；可指古代伊比利亚诸族，也可泛指现代西班牙人/葡萄牙人"},"examples":[{"en":"The Iberians traded with other Mediterranean cultures long before the Roman conquest.","zh":"在罗马征服之前很久，伊比利亚人就与其他地中海文化进行贸易。"},{"en":"The museum has an exhibit on ancient Iberians and their metalwork.","zh":"这家博物馆有一个关于古代伊比利亚人及其金属工艺的展览。"},{"en":"In this book, “Iberians” refers broadly to people from Spain and Portugal.","zh":"在这本书里，“Iberians”泛指来自西班牙和葡萄牙的人。"}]}],"synonyms":["Iberian people","Spaniards and Portuguese (broadly)","ancient Iberians (historical)"],"phonetic":"/aɪˈbɪriənz/","extraExplanation":["“Iberians”是复数形式；单数是“Iberian”（伊比利亚人/伊比利亚的）。","历史语境中，Iberians常指罗马统治前居住在伊比利亚半岛东部和南部的古代族群；而在现代地理语境中，常用于“the Iberian Peninsula（伊比利亚半岛）”，强调西班牙与葡萄牙的区域概念。","不要与“Latins（拉丁人）”或“Hispanics（西语裔/西班牙语文化圈）”混用：Iberian更偏地理与历史范围，Hispanic更偏语言与文化范围。"]}
{"word":"iberic","summary":{"en":"Iberic means “related to the Iberian Peninsula (Spain and Portugal),” and can also refer (less commonly) to the ancient Iberians or their language.","zh":"Iberic 指“伊比利亚半岛（西班牙、葡萄牙）相关的”，也可较少见地指古代伊比利亚人或其语言/文字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Iberian Peninsula (especially Spain and Portugal), or to its people, culture, or geography.","zh":"与伊比利亚半岛（尤其是西班牙和葡萄牙）有关的；伊比利亚的（指人、文化、地理等）。"},"examples":[{"en":"Iberic cuisine often features olive oil, seafood, and cured ham.","zh":"伊比利亚饮食常以橄榄油、海鲜和风干火腿为特色。"},{"en":"The museum has an Iberic art section with pieces from ancient Spain.","zh":"这座博物馆有一个伊比利亚艺术展区，展出古代西班牙的作品。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Referring to the ancient Iberians or their languages in pre-Roman Spain.","zh":"（较少见）指古代伊比利亚人，或指罗马统治前西班牙地区的伊比利亚语言/文字。"},"examples":[{"en":"Some inscriptions are written in an Iberic script that is still not fully understood.","zh":"一些铭文使用伊比利亚文字书写，至今仍未被完全破解。"},{"en":"Researchers compare Iberic terms with neighboring ancient languages.","zh":"研究者会把伊比利亚语词汇与周边古代语言作比较。"}]}],"synonyms":["Iberian","Spanish and Portuguese (context-dependent)","of the Iberian Peninsula"],"phonetic":"/aɪˈbɛrɪk/","extraExplanation":["“Iberic”通常是“伊比利亚的”的形容词，日常英文里更常见的是“Iberian”（如 Iberian Peninsula, Iberian culture）。在学术或考古语境中，“Iberic”也可能更偏向指古代伊比利亚人/伊比利亚语及其文字。","伊比利亚半岛（Iberian Peninsula）主要包括西班牙和葡萄牙；有时也会涉及安道尔、直布罗陀等地区，取决于语境。"]}
{"word":"iberis","summary":{"en":"Iberis is a genus of flowering plants (candytuft) often grown as a low, decorative garden flower.","zh":"Iberis 是屈曲花（candytuft）属的开花植物，常作为低矮的观赏园艺花卉栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the mustard family (Brassicaceae), commonly known as candytuft, often grown in gardens for clusters of white, pink, or purple flowers","zh":"一种十字花科（Brassicaceae）的开花植物属，常见英文名为 candytuft（屈曲花/糖屈曲花），常作为园艺观赏植物栽培，花多成簇，常见白、粉或紫色"},"examples":[{"en":"Iberis is popular in rock gardens because it forms neat, low mounds of flowers.","zh":"Iberis 在岩石花园里很受欢迎，因为它会长成整齐、低矮的花丛。"},{"en":"The border was planted with Iberis, creating a bright white edge in spring.","zh":"花坛边缘种了 Iberis，春天时形成一圈明亮的白色花边。"}]}],"synonyms":["candytuft","genus Iberis"],"phonetic":"/aɪˈbɪrɪs/","extraExplanation":["“Iberis”的属名与“Iberia（伊比利亚）”有关，指这种植物在欧洲西南部（如西班牙、葡萄牙一带）较常见。园艺语境中更常用的英文俗名是“candytuft”。"]}
{"word":"iberism","summary":{"en":"Iberism is the idea of unity or cooperation among the Iberian Peninsula, especially Spain and Portugal.","zh":"Iberism（伊比利亚主义）指强调伊比利亚半岛国家（主要是西班牙与葡萄牙）团结或合作的理念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political or cultural idea emphasizing the shared identity, unity, or cooperation of the peoples and countries of the Iberian Peninsula (Spain and Portugal), sometimes including closer ties between them.","zh":"一种政治或文化理念，强调伊比利亚半岛（西班牙与葡萄牙）各民族与国家的共同身份、团结或合作，有时也指两国更紧密的关系。"},"examples":[{"en":"Some 19th‑century thinkers promoted Iberism to encourage cooperation between Spain and Portugal.","zh":"一些19世纪思想家提倡“伊比利亚主义”，以促进西班牙与葡萄牙的合作。"},{"en":"In a cultural sense, Iberism can mean celebrating shared Iberian history and traditions.","zh":"在文化意义上，“伊比利亚主义”可以指赞颂伊比利亚共同的历史与传统。"}]}],"synonyms":["Pan-Iberianism","Iberian unity"],"phonetic":"/ˈaɪbərɪzəm/","extraExplanation":["“Iberism”来自“Iberia（伊比利亚）”，指伊比利亚半岛。该词常见于历史与政治学语境，尤其与19世纪欧洲民族国家形成时期的思想潮流有关。","注意不要与“imperialism（帝国主义）”混淆；两者拼写相近但意义不同。"]}
{"word":"iberite","summary":{"en":"“Iberite” is a rare/older word meaning “Iberian,” used for a person from Iberia or something related to Iberia.","zh":"“Iberite”是较少见/较旧的词，大致相当于“Iberian（伊比利亚人/伊比利亚的）”，可指伊比利亚的人或与伊比利亚相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person from Iberia (especially the Iberian Peninsula: Spain and Portugal); an Iberian.","zh":"伊比利亚人（尤指伊比利亚半岛：西班牙和葡萄牙的人）；伊比利亚居民。"},"examples":[{"en":"In older writings, the word “Iberite” sometimes appears as another term for an Iberian.","zh":"在较早的文字中，“Iberite”有时会作为“Iberian（伊比利亚人）”的另一种说法出现。"},{"en":"The historian described the Iberites as seafaring traders along the coast.","zh":"历史学家把伊比利亚人描写为沿海航行经商的海上贸易者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Iberia; Iberian.","zh":"与伊比利亚有关的；伊比利亚的。"},"examples":[{"en":"You may see “Iberite” used in older texts where modern English would usually say “Iberian.”","zh":"你可能会在旧文本里看到“Iberite”，而现代英语通常会用“Iberian”。"}]}],"synonyms":["Iberian","Spaniard","Portuguese"],"phonetic":"/aɪˈbɪraɪt/","extraExplanation":["“Iberite”在现代英语中非常少见，多半出现在较旧或较文学化的文本里；日常与学术写作更常用“Iberian”。","如果你的语境是矿物或化学名词，“iberite”也可能是专有名词/冷门术语或拼写误差；可以提供句子或出处，我可以帮你核对更准确的含义。"]}
{"word":"ibex","summary":{"en":"An ibex is a wild mountain goat known for its large, curved horns and cliff-climbing ability.","zh":"ibex 指一种擅长攀岩、以大而弯曲的角著称的高山野山羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wild mountain goat with large curved horns, found especially in Europe, North Africa, and parts of Asia.","zh":"一种生活在高山地区的野生山羊，长有粗大弯曲的角，主要分布于欧洲、北非及亚洲部分地区。"},"examples":[{"en":"We saw an ibex standing on a steep cliff in the Alps.","zh":"我们在阿尔卑斯山看到一只北山羊站在陡峭的悬崖上。"},{"en":"The ibex’s curved horns can grow very large.","zh":"北山羊的弯角能长得很大。"}]}],"synonyms":["mountain goat","wild goat"],"phonetic":"/ˈaɪbɛks/","extraExplanation":["“ibex”常见于自然纪录片与旅行写作中，强调它们擅长在岩壁与高海拔环境中攀爬与生存。","词源来自拉丁语“ibex”，在英语中读音固定；复数通常也是“ibex”，有时也见到“ibexes”。","文化小知识：阿尔卑斯北山羊（Alpine ibex）曾因过度捕猎而数量锐减，后来在保护措施下恢复，是欧洲野生动物保护的一个经典案例。"]}
{"word":"ibexes","summary":{"en":"“Ibexes” means more than one ibex—wild mountain goats known for long curved horns and cliff-climbing skills.","zh":"“ibexes”指不止一只 ibex（野生北山羊）：以长而弯曲的角和善于攀爬峭壁著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ibex: wild mountain goats with long, curved horns, found in Europe, Asia, and parts of Africa.","zh":"ibex 的复数：一种生活在高山地区的野生山羊，长有向后弯曲的长角，分布于欧洲、亚洲及非洲部分地区。"},"examples":[{"en":"Ibexes climb steep cliffs to escape predators.","zh":"野生北山羊会攀爬陡峭的悬崖来躲避捕食者。"},{"en":"We spotted two ibexes near the rocky ridge at sunrise.","zh":"日出时我们在岩石山脊附近看到两只野生北山羊。"}]}],"synonyms":["ibex"],"phonetic":"/ˈaɪbɛksɪz/","extraExplanation":["“Ibex”的复数常见两种：ibex（不变复数）和 ibexes（规则加 -es）。在新闻、纪录片或科普文章中两者都能见到，但“ibex”作复数更常见、更偏书面。","“Ibex”在中文里常译为“野生北山羊/北山羊”（也会按物种细分，如阿尔卑斯北山羊等）。它们善于攀岩的形象常出现在自然纪录片中。"]}
{"word":"ibices","summary":{"en":"“Ibices” means more than one ibis (a type of wading bird). It’s a less common plural; “ibises” is more common in everyday English.","zh":"“ibices”表示“鹮”的复数（多只鹮，一种涉禽）。它较少见；日常英语更常用“ibises”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ibis: long-legged wading birds with long, curved bills (e.g., the sacred ibis or the American white ibis).","zh":"ibis（鹮）的复数：一种长腿涉禽，喙细长并向下弯曲（例如圣鹮、美国白鹮）。"},"examples":[{"en":"We saw several ibices feeding in the shallow water.","zh":"我们看到几只鹮在浅水里觅食。"},{"en":"The wetland is home to herons, egrets, and ibices.","zh":"这片湿地是苍鹭、白鹭和鹮的栖息地。"}]}],"synonyms":["ibises"],"phonetic":"/ˈaɪbɪˌsiz/","extraExplanation":["“ibices”是一个较少见、偏书面/学术的复数形式；日常英语里更常用的复数是“ibises”。","发音上，“ibices”通常按“ibis + -es”来理解与拼读；如果你在观鸟或动物学语境中阅读文章，更可能遇到这种拼法。"]}
{"word":"ibid","summary":{"en":"“Ibid.” means “from the same source as the previous citation.”","zh":"“ibid.”表示“与上一条引文相同的来源（同上）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(in academic writing and footnotes) used to show that the information comes from the same source as the previous citation; short for Latin “ibidem” (“in the same place”).","zh":"（学术写作、脚注中）用于表示信息来源与上一条引文相同；源自拉丁语 ibidem，意为“在同一处/同一来源”。"},"examples":[{"en":"Smith argues that memory is shaped by culture. Ibid., 45.","zh":"史密斯认为记忆受文化塑造。同上（同一来源），第45页。"},{"en":"Jones, 2019, 112; ibid., 118.","zh":"琼斯（2019），第112页；同上，第118页。"}]}],"synonyms":["same source","same as above","idem (less common)"],"phonetic":"/ˈɪbɪd/","extraExplanation":["“ibid.”主要用于脚注/尾注的引文格式：当你的下一条注释引用的还是上一条注释的同一本书/同一篇文章时，可以用“ibid.”代替重复写作者与书名，再加上新页码。","不同写作规范对“ibid.”的使用限制不一样：有的（如部分 APA 版本）不鼓励使用，更常直接重复简短作者-年份信息；在交稿前最好查看老师或期刊的格式要求。","常见写法：Ibid.（句首常大写）或 ibid.；有时会写 “Ibid., p. 45” 或直接 “Ibid., 45”。"]}
{"word":"ibidem","summary":{"en":"“Ibidem” (often “ibid.”) means “in the same place,” used to repeat the immediately previous citation source.","zh":"“ibidem”（常写作“ibid.”）意为“同上/同一出处”，用于学术注释中重复紧接上一条的引文来源。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the same place (used in academic writing to show that a citation comes from the same source as the one immediately before it).","zh":"同处；同一出处（学术写作中用于表示该引文与紧接上一条引文出自同一来源）。"},"examples":[{"en":"Smith, History of Rome, 45; ibidem, 47.","zh":"Smith，《罗马史》，45页；同上，47页。"},{"en":"The second footnote says “ibid.” because it cites the same book as the first footnote.","zh":"第二条脚注写“ibid.”，因为它引用的是与第一条脚注相同的书。"}]}],"synonyms":["ibid.","in the same place","same source"],"phonetic":"/ˈɪbɪdəm/","extraExplanation":["“ibidem”是拉丁语，常缩写为“ibid.”，主要出现在脚注、尾注或参考文献注释里，现代英文正文中较少直接使用。","使用要点：通常只在“紧接前一个注释”引用同一来源时使用；如果中间插入了别的来源，一般就不再用“ibid.”。","和“idem”不同：“idem”强调“同一作者/同一人”；“ibidem/ibid.”强调“同一出处/同一书或同一位置”。不同学术格式（如Chicago、MLA、APA）对是否推荐使用“ibid.”不完全一致，有的更建议改写为简短作者-页码形式以避免歧义。"]}
{"word":"ibididae","summary":{"en":"Ibididae is the bird family that includes ibises and spoonbills.","zh":"Ibididae 指“鹮科”，包含鹮和琵鹭等涉禽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of long-legged wading birds that includes the ibises and spoonbills","zh":"（鸟类）鹮科：一类涉禽的生物分类科，包含鹮（ibis）和琵鹭（spoonbill）"},"examples":[{"en":"The glossy ibis belongs to the family Ibididae.","zh":"彩鹮属于鹮科（Ibididae）。"},{"en":"Many Ibididae species feed by probing mud in wetlands.","zh":"许多鹮科鸟类会在湿地里用喙探泥觅食。"}]}],"synonyms":["the ibis family"],"phonetic":"/aɪˈbɪdədiː/","extraExplanation":["“Ibididae”是动物分类学里的“科名”（family name），在科—属—种的层级中比“属”更高，比“目”更低。","读音上常分成三段来记：i-BID-i-dee；学术写作里通常首字母大写（Ibididae）。","它不是日常口语常用词，更常见的说法是“the ibis family（鹮科/鹮类）”或直接说“ibis / spoonbill（鹮/琵鹭）”。"]}
{"word":"ibidinae","summary":{"en":"“Ibidinae” is not common English; it is most likely an old/rare taxonomic name related to ibises, or a misspelling of the citation term “ibid.”.","zh":"“Ibidinae” 不是常见英语词；更可能是与鹮有关的旧/罕见分类学名称，或是引用用语 “ibid.” 的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) A (rare or obsolete) scientific name used for a subfamily of ibises; in many modern classifications, ibises are placed in the family Threskiornithidae (with subfamily names such as Threskiornithinae).","zh":"（动物学/分类学）一个（少见或较旧的）用于“鹮”类亚科的学名；在较新的分类中，鹮通常归入鹮科（Threskiornithidae），亚科名称常见如 Threskiornithinae。"},"examples":[{"en":"Some older sources list ibises under the name Ibidinae, but newer references often use different subfamily names.","zh":"一些较旧的资料会用 Ibidinae 来归类鹮，但更新的参考书往往使用不同的亚科名称。"},{"en":"If you see “Ibidinae” in a book, it is likely a taxonomic label rather than an everyday English word.","zh":"如果你在书里看到 “Ibidinae”，它多半是分类学标签，而不是日常英语词。"}]},{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling of “ibid.” (used in citations to mean “in the same place/source as the previous reference”).","zh":"并非标准英语词；可能是 “ibid.” 的拼写错误（文献引用中表示“同上/同一出处”）。"},"examples":[{"en":"Many style guides allow “ibid.” to refer to the same source as the previous footnote.","zh":"许多写作格式指南允许用 “ibid.” 指代与上一条脚注相同的出处。"},{"en":"If you meant “ibid.”, write it exactly as “ibid.” (often italicized in some styles).","zh":"如果你想写的是 “ibid.”，请按 “ibid.” 的形式准确书写（某些格式中常用斜体）。"}]}],"synonyms":["Threskiornithinae","ibises","ibid."],"phonetic":"/ˌaɪbəˈdaɪni/","extraExplanation":["“Ibidinae”看起来更像拉丁化的生物分类名称，而不是常用英语词汇；这种词常出现在动物学论文、博物志或较旧的分类体系中。","如果你能提供它出现的句子/上下文（例如论文段落或截图），我可以帮你判断到底是分类学用法还是把 “ibid.” 误写成了 “ibidinae”。"]}
{"word":"ibidine","summary":{"en":"“Ibid.” means “in the same source as the previous citation.” “ibidine” is likely a misspelling.","zh":"“Ibid.” 表示“同上（与上一条引用同一来源）”。“ibidine” 很可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of “ibid.” (from Latin “ibidem”), used in academic writing to mean “in the same source/place as the previous citation.”","zh":"不是标准英语词；很可能是 “ibid.”（源自拉丁语 ibidem）的拼写误差，常用于学术引用中，表示“同上（与上一条引用来自同一来源/同一处）”。"},"examples":[{"en":"If two footnotes cite the same book and page, the second one may use “Ibid.”","zh":"如果两条脚注引用同一本书同一页，第二条可以用 “Ibid.” 表示同上。"},{"en":"Smith, 2020, p. 45. Ibid., p. 47.","zh":"Smith, 2020, p. 45。同上，p. 47。"}]}],"synonyms":["ibidem","same source","as above"],"phonetic":"/ɪˈbɪd/","extraExplanation":["“Ibid.” 是拉丁语缩写，正式写作（尤其是人文社科的脚注/尾注体系）里常见。它通常只在“紧接着上一条注释且来源相同”时使用；如果中间隔了别的来源，通常改用作者-年份或简短书名来避免混淆。","不同格式指南（如 Chicago、APA 等）对 “Ibid.” 的使用规则不完全一致；有些现代写作风格更倾向重复简短引用而少用 “Ibid.”。"]}
{"word":"ibidium","summary":{"en":"“ibidium” is not a standard English word; it’s likely a misspelling of “iridium” or “rubidium.”","zh":"“ibidium”不是规范英语单词；很可能是“iridium（铱）”或“rubidium（铷）”的误拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or mistaken spelling; it is not a recognized English word in dictionaries. People often type this when they mean “iridium” or “rubidium” (both are chemical elements).","zh":"一种不规范或误拼写；它不是词典中认可的英语单词。人们常把它当作“iridium（铱）”或“rubidium（铷）”的误写（两者都是化学元素）。"},"examples":[{"en":"I couldn’t find “ibidium” in a dictionary—did you mean iridium or rubidium?","zh":"我在词典里找不到“ibidium”——你是想写 iridium 还是 rubidium？"},{"en":"In the lab report, replace “ibidium” with the correct element name and symbol.","zh":"在实验报告里，把“ibidium”改成正确的元素名称和符号。"}]}],"synonyms":["iridium","rubidium"],"phonetic":"/ɪˈrɪdiəm/","extraExplanation":["“iridium（铱）”的读音是 /ɪˈrɪdiəm/，元素符号 Ir；常见于化学、材料、耐腐蚀合金等语境。","“rubidium（铷）”的读音是 /ruˈbɪdiəm/，元素符号 Rb；常见于化学、原子钟、科研等语境。","如果你告诉我你看到这个词的上下文（例如化学课本/论文/对话），我可以帮你判断你想要的是哪个词，并给出更准确的释义和例句。"]}
{"word":"ibilao","summary":{"en":"Ibilao (more commonly bilao) is a Filipino bamboo winnowing tray; it can also mean to place/spread food or grains on that tray for winnowing or drying.","zh":"Ibilao（更常见为 bilao）指菲律宾的竹编簸箕/托盘；也可作动词，表示把食物或谷物放在这种托盘上簸或晾晒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat, round bamboo tray used in Filipino kitchens for winnowing rice (separating grain from chaff), drying food, or serving snacks; also spelled and more commonly known as “bilao.”","zh":"（菲律宾常见）一种扁平的圆形竹编托盘/簸箕，用来簸米（分离谷粒和糠）、晾晒食物或盛放小吃；更常见拼法为 bilao。"},"examples":[{"en":"They used a bilao/ibilao to winnow the rice after pounding it.","zh":"他们用 bilao/ibilao 把舂过的米簸一簸，筛掉糠皮。"},{"en":"Dry the fish on an ibilao under the sun for a few hours.","zh":"把鱼放在 ibilao 上晒几个小时。"}]},{"partOfSpeech":"v.","definition":{"en":"to put or spread something on a bilao (bamboo tray), especially for winnowing or drying.","zh":"（把东西）放到/铺到竹编托盘（bilao）上，尤指用于簸米或晾晒。"},"examples":[{"en":"Ibilao the grains so the husks blow away.","zh":"把谷粒放到簸箕上簸一簸，让糠皮被风吹走。"},{"en":"She ibilaoed the sliced mangoes to dry.","zh":"她把切片芒果铺在竹编托盘上晾干。"}]}],"synonyms":["bilao","winnowing tray","bamboo tray","sieve (similar use)"],"phonetic":"/ˌɪbɪˈlaʊ/","extraExplanation":["“Bilao/ibilao”多见于菲律宾语言与文化语境（如他加禄语等），属于日常生活器具词。英语里通常不把它当作标准英语词汇；在英语句子中出现时，多是保留原词来指代这种特定器具。","在菲律宾餐饮文化中，bilao 也常用来盛放共享式食物（例如拼盘海鲜、点心等），带有“家常、分享”的文化联想。"]}
{"word":"ibilis","summary":{"en":"Iblis: the chief devil in Islamic tradition, a jinn who disobeyed God and tempts humans.","zh":"Iblis（伊布利斯）：伊斯兰传统中的主要恶魔；一位违抗命令的精灵，后来引诱人类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Islam, the chief devil (similar in role to “Satan”), a jinn who refused to bow to Adam and was cast out, becoming a tempter of humans.","zh":"伊斯兰教中的主要恶魔（角色类似“撒旦”）；一位精灵（jinn），因拒绝向亚当叩拜而被逐出，后来引诱人类作恶。"},"examples":[{"en":"In the story, Iblis refuses to bow to Adam.","zh":"在这个故事里，伊布利斯拒绝向亚当叩拜。"},{"en":"Some writers compare Iblis to Satan, but the traditions are not exactly the same.","zh":"有些作者把伊布利斯与撒旦类比，但两种传统并不完全相同。"}]}],"synonyms":["Satan","the Devil","Shaytan"],"phonetic":"/ɪˈbliːs/","extraExplanation":["你输入的“ibilis”更常见的拼写是 **Iblis / Iblīs（伊布利斯）**。在伊斯兰叙事中，Iblis 通常被描述为精灵（jinn），并非天使；他因傲慢而拒绝服从命令，从而成为诱惑人类的存在。","在英语文本里，Iblis 常出现在宗教学、历史学与文学作品中，用来指代伊斯兰语境下的“魔鬼/诱惑者”。使用时建议尊重宗教差异：可说“similar to Satan in role（角色相似）”，但避免简单等同为完全同一个概念。"]}
{"word":"ibilitas","summary":{"en":"“Ibilitas” is mainly a Latin-style suffix meaning “-ability/-ibility,” not a common standalone English word.","zh":"“ibilitas”主要是拉丁语风格的词缀，表示“-ability/-ibility（……的能力/可……性）”，在英语里通常不单独使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Latin-derived suffix meaning “ability” or “capacity to be,” used in some academic or borrowed terms (often seen in Indonesian or Latin-based formations). It is not a common standalone word in everyday English.","zh":"源自拉丁语的词缀，表示“……的能力/性质/可……性”，常见于学术或外来构词中（在印尼语或拉丁语系构词里更常见）。在日常英语中通常不作为独立单词使用。"},"examples":[{"en":"In English, you usually see the idea of “-ibilitas” as “-ibility,” as in “responsibility.”","zh":"在英语里，“-ibilitas”的概念通常对应“-ibility”，例如 responsibility（责任/负责的能力与义务）。"},{"en":"Some academic terms borrowed into other languages use Latin-style endings like “-ibilitas.”","zh":"一些借入其他语言的学术词会使用类似“-ibilitas”的拉丁语式词尾。"}]}],"synonyms":["-ability","-ibility"],"phonetic":"/ˌɪbɪˈlɪtəs/","extraExplanation":["“ibilitas”更像是构词成分（词尾/后缀）而不是英语里的常用词条。英语里对应的常见形式是“-ability / -ibility”，用来把形容词或动词概念变成名词（表示“能力、性质、可……性”），例如：possible → possibility，available → availability。","如果你是在某个具体语境里看到“ibilitas”（例如某篇论文、印尼语材料或拉丁语短语），把原句发来我可以根据上下文判断它指的具体是哪一种“可……性/能力”。"]}
{"word":"ibility","summary":{"en":"-ibility is a suffix that forms nouns meaning a quality, state, or ability (often from adjectives ending in -ible).","zh":"-ibility 是构词后缀，用来把（常以 -ible 结尾的）形容词变成名词，表示性质、状态或能力。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a suffix used to form nouns meaning “the ability or quality of being (adjective)” or “the state/condition of being (adjective),” often corresponding to adjectives ending in -ible","zh":"后缀，用来构成名词，表示“……的能力/性质”或“……的状态/情况”，常与以 -ible 结尾的形容词对应"},"examples":[{"en":"possible → possibility (the state of being possible)","zh":"possible（可能的）→ possibility（可能性；可能的状态）"},{"en":"responsible → responsibility (the quality of being responsible)","zh":"responsible（负责的）→ responsibility（责任；负责任的品质）"},{"en":"accessible → accessibility (the quality of being accessible)","zh":"accessible（可进入/可使用的）→ accessibility（可达性；无障碍性）"}]}],"synonyms":["-ability","-ness (similar meaning in some words)"],"phonetic":"ɪˈbɪləti","extraExplanation":["“-ibility”本身通常不会单独作为一个词使用，而是作为构词后缀出现。","拼写提示：很多词在加 “-ibility” 时会把形容词词尾的 “-ible” 变成 “-ibility”（如 possible→possibility）；但也有不规则或不同后缀的情况（如 capable→capability 用的是 “-ability”）。"]}
{"word":"ibis","summary":{"en":"An ibis is a long-legged wetland bird with a long curved bill.","zh":"ibis 指“鹮”，一种栖息湿地、嘴长而弯的涉禽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long-legged wading bird with a long curved bill, often found near water and wetlands.","zh":"鹮：一种腿长、常在水边涉水觅食的鸟，嘴长而向下弯曲，常见于湿地与河湖附近。"},"examples":[{"en":"We saw an ibis walking slowly through the marsh, looking for food.","zh":"我们看到一只鹮在沼泽里慢慢走着，寻找食物。"},{"en":"The park’s lake attracts herons, egrets, and ibis during migration season.","zh":"迁徙季节，公园的湖会吸引苍鹭、白鹭和鹮。"}]}],"synonyms":["wading bird"],"phonetic":"/ˈaɪbɪs/","extraExplanation":["“ibis”在古埃及文化中很有象征意义：圣鹮（sacred ibis）常与智慧之神托特（Thoth）相关联，因此在艺术与文物中出现频繁。","日常英语里“ibis”多用于鸟类本身；在澳大利亚也常指“Australian white ibis”，因常在城市垃圾桶附近觅食而被戏称为“bin chicken”（垃圾桶鸡）。"]}
{"word":"ibis-bill","summary":{"en":"a long, down-curved bird bill like an ibis’s","zh":"像鹮一样细长下弯的鸟喙"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, curved bill like that of an ibis; also used for certain birds (such as the ibisbill) named for having such a bill","zh":"鹮嘴般细长下弯的喙；也可指因具有这种喙而得名的某些鸟类（如鹮嘴鹬）"},"examples":[{"en":"The bird’s ibis-bill helps it probe in mud and shallow water for food.","zh":"这种鸟的鹮嘴状喙有助于它在泥地和浅水中探寻食物。"},{"en":"Field guides describe the ibisbill as a shorebird with a distinctive ibis-bill.","zh":"野外图鉴常把鹮嘴鹬描述为一种具有明显“鹮嘴状喙”的涉禽。"}]}],"synonyms":["curved bill","decurved bill","long bill"],"phonetic":"/ˈaɪbɪs ˌbɪl/","extraExplanation":["注意拼写：ibis-bill（形容“鹮嘴状的喙”）与 ibisbill（一个具体鸟名，常译“鹮嘴鹬”）在英语里都可能出现；语境会告诉你是“喙的形状”还是“鸟名”。"],"etymology":"由 ibis（“鹮”，一种长喙涉禽）+ bill（“鸟喙”）构成的复合词，用来强调“像鹮一样的喙形”。","mnemonic":["把它拆开记：ibis（鹮）+ bill（喙）＝“像鹮的喙”。看到连字符就想到“两个词拼起来讲特征”。"]}
{"word":"ibisbill","summary":{"en":"An ibisbill is a rare Himalayan wading bird with a long, curved bill, often found along rocky rivers.","zh":"ibisbill 指一种较罕见的喜马拉雅山地涉禽，嘴细长弯曲，常见于岩石多的河流沿岸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long-billed wading bird (genus Ibidorhyncha) found in rocky river valleys of the Himalayas and nearby regions; also called the Tibetan ibisbill.","zh":"一种长嘴的涉禽（朱鹮鹬属 Ibidorhyncha），栖息于喜马拉雅及周边地区的岩石河谷，也常被称为“西藏朱鹮鹬/藏朱鹮鹬”（Tibetan ibisbill）。"},"examples":[{"en":"Birdwatchers traveled to the mountain river to look for an ibisbill among the rocks.","zh":"观鸟者来到山间河流，想在岩石间寻找朱鹮鹬（ibisbill）。"},{"en":"The ibisbill uses its long, curved bill to probe for insects in shallow water.","zh":"朱鹮鹬用它又长又弯的嘴在浅水里探寻昆虫。"}]}],"synonyms":["Tibetan ibisbill","ibis-bill"],"phonetic":"/ˈaɪbɪsˌbɪl/","extraExplanation":["“ibisbill”由“ibis（朱鹮）+ bill（鸟喙）”构成，意思是“像朱鹮一样的嘴”。虽然名字里有 ibis，但它并不属于朱鹮科，而是独立的一类山地河谷涉禽。"]}
{"word":"ibises","summary":{"en":"“Ibises” is the plural of “ibis,” meaning long-legged wading birds with long, curved bills.","zh":"“ibises”是“ibis”的复数，指一种长腿涉禽，喙细长并向下弯曲，常见于水域附近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ibis: a long-legged wading bird with a long, curved bill, often found near water (wetlands, rivers, coasts).","zh":"ibis 的复数：一种长腿涉禽，喙细长并向下弯曲，常见于湿地、河流或海岸等水域附近。"},"examples":[{"en":"We saw several ibises walking slowly through the marsh.","zh":"我们看到几只鹮在沼泽里慢慢走着。"},{"en":"In the park, ibises often look for food near the pond.","zh":"在公园里，鹮常在池塘边觅食。"}]},{"partOfSpeech":"n.","definition":{"en":"A plural form sometimes used for the ancient Egyptian symbol/bird called an ibis, especially in history, art, or museum contexts.","zh":"在历史、艺术或博物馆语境中，用来指“古埃及文化中与鹮相关的象征/形象”的复数形式。"},"examples":[{"en":"The exhibit shows paintings of ibises linked to Egyptian religion.","zh":"展览展示了与埃及宗教相关的鹮的绘画图像。"}]}],"synonyms":["wading birds"],"phonetic":"/ˈaɪˌbɪsiz/","extraExplanation":["“ibis”的复数有两种常见写法：ibises 和 ibides。现代英语里 ibises 更常用、更自然；ibides 较偏学术或较旧的用法。","在文化语境中，鹮常与古埃及的托特（Thoth）形象相关（常被描绘为鹮头人身），因此在讲古埃及艺术/宗教时会更容易遇到这个词。"]}
{"word":"Ibizan","summary":{"en":"Connected with Ibiza; also a breed of hunting dog from the island.","zh":"与伊维萨岛相关；也指源自该岛的一种猎犬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ibiza (a Spanish island in the Balearic Islands) or its people, culture, or style.","zh":"与伊维萨岛（西班牙巴利阿里群岛之一）及其居民、文化或风格有关的。"},"examples":[{"en":"They planned an Ibizan vacation with quiet beaches and local food.","zh":"他们计划了一次伊维萨风格的旅行，有安静的海滩和当地美食。"},{"en":"Ibizan nightlife became famous worldwide in the 1990s.","zh":"伊维萨的夜生活在20世纪90年代闻名全球。"}]},{"partOfSpeech":"n.","definition":{"en":"A dog of the Ibizan Hound breed, originally used for hunting (especially rabbits).","zh":"伊维萨猎犬（一个犬种），最初用于狩猎（尤其猎兔）。"},"examples":[{"en":"The Ibizan is tall, athletic, and very alert.","zh":"伊维萨猎犬身材高挑、运动能力强，而且非常警觉。"},{"en":"She adopted an Ibizan from a rescue group.","zh":"她从救援组织领养了一只伊维萨猎犬。"}]}],"synonyms":["Ibiza-related","Ibizan Hound"],"phonetic":"/ɪˈbiːzən/","extraExplanation":["“Ibiza”在西班牙语中读音接近“ee-BEE-tha”（在部分地区/语境也会接近“ee-BEE-za”）；英语里常见多种读法。“Ibizan”在英语中多用来形容与伊维萨的旅游、音乐文化（如电子音乐场景）相关的事物。"],"etymology":"来自地名 Ibiza（伊维萨岛）的英文形容词形式；表示“与伊维萨有关的”。作为犬种名时，指起源于该岛的猎犬。","mnemonic":["把 Ibizan 拆成“Ibiza + -n”：看到 -an / -n 这种结尾，常表示“某地的/与某地有关的人或事物”（如 American）。","联想“伊维萨=派对岛”，Ibizan 常用来形容那种度假、音乐、夜生活的风格。"]}
{"word":"ible","summary":{"en":"“-ible” is a suffix used to form adjectives meaning “able to be” or “capable of being.”","zh":"“-ible”是后缀，用来构成形容词，表示“可以被……的 / 能够……的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a suffix meaning “able to be” or “capable of being” (often used to form adjectives from verbs).","zh":"后缀，表示“可以被……的 / 能够……的”，常用来把动词变成形容词。"},"examples":[{"en":"If something is edible, it can be eaten safely.","zh":"如果某物是 edible，就表示它可以安全食用。"},{"en":"A visible sign is a sign that can be seen.","zh":"visible sign 指“可以看见的迹象”。"},{"en":"This task isn’t possible, so it isn’t feasible either.","zh":"这个任务不 possible（不可能），所以也不 feasible（不可行）。"}]}],"synonyms":["-able"],"phonetic":"ˈɪbəl","extraExplanation":["“-(i)ble”和“-able”很像，常见区别是：许多词来自拉丁语时更常用“-ible”（如 possible, visible, flexible），而更“活”的新组合词更常用“-able”（如 washable, readable）。但有不少是固定拼法，需要靠词汇记忆：possible（不是 *possiable），reliable（不是 *reliible）。","拼写小提示：动词以 -ce / -ge 结尾时，加 -able 常会保留 e（changeable）；但很多 -ible 词是历史遗留的固定形式（audible, sensible 等），没有统一规则可套用。"]}
{"word":"Iblei","summary":{"en":"a mountain region in southeastern Sicily","zh":"西西里岛东南部的山地地区"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mountain range and geographic area in southeastern Sicily, Italy (often called the Iblean Mountains).","zh":"意大利西西里岛东南部的一个山地山脉与地理区域（常称“伊布莱山脉”）。"},"examples":[{"en":"We drove through the Iblei to visit the Baroque towns of Ragusa and Modica.","zh":"我们开车穿过伊布莱地区，去参观拉古萨和莫迪卡的巴洛克小镇。"},{"en":"The Iblei are known for limestone landscapes, canyons, and small farming communities.","zh":"伊布莱地区以石灰岩地貌、峡谷和小型农业社区而闻名。"}]}],"synonyms":["Iblean Mountains","Monti Iblei","Hyblaean Mountains"],"phonetic":"ˈiːbleɪ","extraExplanation":["在英语里常见搭配是 the Iblei / the Iblean Mountains，用来指西西里岛东南部的丘陵与山地带。该区域包含多座以巴洛克建筑闻名的城镇（如 Ragusa、Modica、Noto 一带），也常出现在旅游与地理写作中。"],"etymology":"源自意大利语 Iblei（常指 Monti Iblei“伊布莱山脉”）；名称与古代地名 Hybla / Hyblaean（希腊-罗马时期的地名与称呼）有关，后来在意大利语与英语地理用法中固定下来。","mnemonic":["联想“意(Italia) + 布(ble) + 莱(lei)”：记成“意大利的伊布莱(山)”。","把 Iblei 记作“e-blei”，联想“山里像一层层‘累(lei)’起来的丘陵”。"]}
{"word":"Iblis","summary":{"en":"the chief devil figure in Islam, linked with pride and rebellion","zh":"伊斯兰传统中的首恶魔形象，常与傲慢与反叛相关"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Islam, the name of the chief devil who refused to bow to Adam and was cast out; often associated with Satan.","zh":"（伊斯兰教）易卜劣斯：拒绝向阿丹（亚当）叩拜而被放逐的首恶魔，常被视为与“撒旦”相近的形象。"},"examples":[{"en":"In the story, Iblis refuses to bow to Adam and is expelled.","zh":"在故事中，易卜劣斯拒绝向亚当叩拜，结果被驱逐。"},{"en":"Some writers use Iblis as a symbol of pride and disobedience.","zh":"一些作家把易卜劣斯当作“傲慢与违抗”的象征。"}]}],"synonyms":["Satan","Shaytan","the Devil"],"phonetic":"/ˈɪblɪs/","extraExplanation":["在伊斯兰传统里，Iblis 通常被描写为“精灵（jinn）”而非天使；他因傲慢拒绝服从真主的命令而堕落。","日常英语里写作 Iblis 多出现在宗教研究、文学/文化讨论或翻译作品中；更通用的对应词往往是 Satan 或 the Devil。"],"etymology":"源自阿拉伯语 Iblīs（إبليس）。常被认为与希腊语 diábolos（“诽谤者/魔鬼”，英语 devil 的词源之一）在概念上相近，因此在翻译与比较宗教学语境中常与 “Satan/Devil”并置讨论。","mnemonic":["记忆法：Iblis 发音像“伊-布-利斯”，可联想“伊（他）不（不愿）礼（行礼）斯（死撑）”→不愿行礼、因傲慢而堕落。","把 Iblis 里的“blis”联想到 bless（祝福）的反面：不是祝福，而是堕落的对立形象。"]}
{"word":"IBM","summary":{"en":"IBM is the abbreviation for International Business Machines, a large American technology company; it can also refer to the company’s products and services.","zh":"IBM 是 International Business Machines（国际商业机器公司）的缩写，指一家大型美国科技公司；也可泛指其产品与服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"International Business Machines Corporation, a major American technology company (often called “IBM”).","zh":"国际商业机器公司（IBM），一家美国大型科技公司。"},"examples":[{"en":"IBM is known for its work in enterprise computing and consulting.","zh":"IBM 以企业级计算和咨询服务闻名。"},{"en":"She got a job offer from IBM after graduation.","zh":"她毕业后收到了 IBM 的工作邀请。"}]},{"partOfSpeech":"n.","definition":{"en":"A brand name used to refer to IBM’s products, services, or systems (often in business or tech contexts).","zh":"用于指代 IBM 的产品、服务或系统的品牌名称（常见于商业或科技语境）。"},"examples":[{"en":"The company runs its databases on IBM servers.","zh":"这家公司在 IBM 服务器上运行数据库。"},{"en":"We use IBM software for data management.","zh":"我们使用 IBM 软件进行数据管理。"}]}],"synonyms":["International Business Machines","Big Blue"],"phonetic":"/ˌaɪ biː ˈɛm/","extraExplanation":["IBM 是首字母缩略词，读作三个字母：I-B-M，而不是当作一个词来读。","IBM 的昵称是 “Big Blue（蓝色巨人）”，常用来指这家公司本身，来源与其企业形象与早期标志性配色有关。"]}
{"word":"ibm","summary":{"en":"IBM is short for International Business Machines, a major U.S. technology company.","zh":"IBM 是 International Business Machines 的缩写，指一家重要的美国科技公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"International Business Machines (IBM): a large American technology company known for computers, enterprise software, cloud services, and consulting.","zh":"国际商业机器公司（IBM）：一家美国大型科技公司，以计算机、企业软件、云服务与咨询服务闻名。"},"examples":[{"en":"IBM provides cloud and consulting services for many banks and governments.","zh":"IBM 为许多银行和政府提供云服务与咨询服务。"},{"en":"She got a job at IBM as a software engineer.","zh":"她在 IBM 找到了一份软件工程师的工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(In tech history) IBM: a major early maker of mainframe computers and a key company in the development of modern business computing.","zh":"（科技史中）IBM：早期大型机的重要制造商，也是现代商业计算发展中的关键公司。"},"examples":[{"en":"In the 1960s and 1970s, IBM dominated the mainframe computer market.","zh":"在 20 世纪 60 到 70 年代，IBM 在大型机市场占据主导地位。"},{"en":"Many classic business systems were built to run on IBM mainframes.","zh":"许多经典的商业系统都是为运行在 IBM 大型机上而设计的。"}]}],"synonyms":["International Business Machines","Big Blue"],"phonetic":"/ˌaɪ biː ˈɛm/","extraExplanation":["IBM 是缩写（initialism），通常逐字母读作 “I-B-M”，而不是读成一个词。","在英语写作中，IBM 一般不加冠词：说 “I work at IBM”，而不是 “I work at the IBM”（除非特指某个 IBM 的部门/实体）。","文化上，IBM 常被称为 “Big Blue”，源于其品牌色与企业形象；你可能会在新闻或商业文章中看到这个别称。"]}
{"word":"Ibo","summary":{"en":"relating to the Igbo people or their language in southeastern Nigeria (older spelling)","zh":"指尼日利亚东南部伊格博族及其语言（较旧拼写）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Igbo people, an ethnic group mainly in southeastern Nigeria (\"Ibo\" is an older spelling of \"Igbo\")","zh":"伊博族/伊格博族人（主要分布在尼日利亚东南部；“Ibo”是“Igbo”的较旧拼写）"},"examples":[{"en":"She is Ibo (Igbo) and grew up in southeastern Nigeria.","zh":"她是伊博族（伊格博族）人，在尼日利亚东南部长大。"},{"en":"The novel includes Ibo traditions and proverbs.","zh":"这部小说包含伊博族的传统与谚语。"}]},{"partOfSpeech":"n.","definition":{"en":"the Igbo language, a major language of southeastern Nigeria","zh":"伊博语/伊格博语（尼日利亚东南部的重要语言）"},"examples":[{"en":"He can speak Ibo at home with his grandparents.","zh":"他在家可以和祖父母讲伊博语。"},{"en":"She is learning basic phrases in Ibo.","zh":"她正在学习一些伊博语的基础短语。"}]}],"synonyms":["Igbo"],"phonetic":"/ˈiːboʊ/","extraExplanation":["拼写提示：在当代英语中，“Igbo”更常用、更正式；“Ibo”多见于旧书、历史材料或人名/地名的固定写法。","文化背景：伊格博人是尼日利亚主要民族之一；相关文化常见于非洲文学作品中（如奇努阿·阿切贝作品里涉及伊格博社会与传统）。"],"etymology":"源自该民族对自身及语言的名称（更常见拼写为“Igbo”）。英语里曾广泛使用“Ibo”，现代写作与学术语境多改用“Igbo”，以更贴近当地发音与标准拼写。","mnemonic":["记拼写：现在常写“Igbo”，可以把中间的“gb”当作“合在一起的一组辅音”，提醒它是一个固定组合。","读音联想：/ˈiːboʊ/ 听起来像 “E-bo”，可联想“E(伊) + bo(博)”帮助记忆旧拼法 Ibo。"]}
{"word":"ibo","summary":{"en":"“ibo” can mean the Igbo people/language (often spelled “Igbo”), or the acronym IBO meaning the International Baccalaureate Organization.","zh":"“ibo”可以指伊格博族/伊格博语（常拼作“Igbo”），也可以指缩写 IBO，意为国际文凭组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also written Igbo) A member of the Igbo people, an ethnic group mainly in southeastern Nigeria; or the Igbo language.","zh":"（也写作 Igbo）伊博族/伊格博族人（主要居住在尼日利亚东南部）；或指伊格博语。"},"examples":[{"en":"The museum featured Ibo (Igbo) art from southeastern Nigeria.","zh":"博物馆展出了来自尼日利亚东南部的伊博（伊格博）艺术品。"},{"en":"She speaks Ibo/Igbo at home with her grandparents.","zh":"她在家里和祖父母说伊博语/伊格博语。"}]},{"partOfSpeech":"n.","definition":{"en":"International Baccalaureate Organization (often called the IB; now officially the International Baccalaureate).","zh":"国际文凭组织（常简称为 IB；现官方名称多用 International Baccalaureate）。"},"examples":[{"en":"Our school is authorized by the IBO to offer the IB Diploma Programme.","zh":"我们学校获得国际文凭组织（IBO）授权开设 IB 文凭课程。"},{"en":"She followed the IBO guidelines when planning the IB course.","zh":"她在规划 IB 课程时遵循 IBO 的指导原则。"}]}],"synonyms":["Igbo","IB (for International Baccalaureate)"],"phonetic":"/ˈiːboʊ/","extraExplanation":["“Ibo”是较早或非正式的拼写；在学术与官方语境中更常用“Igbo”。","“IBO”作为缩写在教育领域常见，但很多人日常更直接说“IB”；该组织的现行官方名称也多使用“International Baccalaureate”。"]}
{"word":"ibogaine","summary":{"en":"Ibogaine is a psychoactive substance from the iboga plant, researched for addiction treatment but often unapproved and potentially risky.","zh":"Ibogaine（伊波加因）是来自伊波加植物的精神活性物质，虽被研究用于成瘾治疗，但多未获批准且可能存在风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a psychoactive alkaloid from the iboga plant, studied for possible use in treating addiction but not approved for medical use in many countries and sometimes associated with serious health risks","zh":"一种来自伊波加（iboga）植物的致幻/精神活性生物碱；因可能用于成瘾治疗而被研究，但在许多国家尚未获准医疗使用，并且有时与严重健康风险相关"},"examples":[{"en":"Ibogaine has been researched for its potential effects on opioid withdrawal, but safety concerns remain.","zh":"伊波加因被研究用于可能缓解阿片类戒断反应，但安全性仍令人担忧。"},{"en":"Because ibogaine can affect the heart, people are warned not to use it without medical supervision.","zh":"由于伊波加因可能影响心脏，人们被警告不要在缺乏医疗监护的情况下使用。"}]}],"synonyms":["alkaloid","psychoactive substance"],"phonetic":"/ˈaɪboʊɡeɪn/","extraExplanation":["“Ibogaine”源自西非植物“iboga”（学名 Tabernanthe iboga）。它与一些中非地区（如加蓬）宗教/仪式传统中的“iboga”使用有关，但把传统宗教语境与现代“戒毒疗法”营销混为一谈并不准确。","在英语新闻与科普中，ibogaine常与“unapproved treatment（未获批准的疗法）”“clinic abroad（海外诊所）”“cardiac risks（心脏风险）”等搭配出现；阅读时可留意语境是在讲研究、监管还是商业宣传。"]}
{"word":"ibolium","summary":{"en":"“ibolium” isn’t a recognized English word; it’s likely a misspelling or a name—share context to identify it.","zh":"“ibolium”不是公认的英语词；更可能是拼写错误或名称——提供语境可帮助确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a brand/name, or a made-up term. Please share the sentence or context so I can identify the intended word.","zh":"这不是标准英语单词。可能是拼写错误、品牌/名称，或是自造词。请提供它出现的句子或语境，方便我判断你想表达的词。"},"examples":[{"en":"I couldn’t find “ibolium” in a dictionary—do you mean “ibuprofen” or another word?","zh":"我在词典里找不到“ibolium”——你是想写“ibuprofen（布洛芬）”还是别的词？"},{"en":"If “Ibolium” is a product name, please tell me the country or where you saw it.","zh":"如果“Ibolium”是产品名，请告诉我国家或你在哪里看到的。"}]}],"phonetic":"/ɪˈboʊliəm/","extraExplanation":["“ibolium”看起来像拉丁化/科幻风格的拼写（例如以 -ium 结尾常见于化学元素或虚构物质名称），但在常用英语词典中并不作为词条出现。","最常见的可能是拼写混淆：比如药名“ibuprofen（布洛芬）”或其他以 i- 开头、-ium 结尾的名称。给出原句我可以更准确地帮你定位。"]}
{"word":"ibota","summary":{"en":"Ibotta is a cashback (rebate) app/service used to earn money back from shopping, especially groceries.","zh":"Ibotta 是一款购物返现（回扣）应用/服务，常用于超市杂货购物返现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mobile app and service that gives you cash back (rebates) for shopping, especially groceries; also the company that runs this service","zh":"一款（及其公司）提供购物返现/回扣的手机应用与服务，尤其常用于超市杂货购物"},"examples":[{"en":"I use Ibotta to get cash back on groceries each week.","zh":"我每周用 Ibotta 在买杂货时拿返现。"},{"en":"Scan your receipt in Ibotta after you shop.","zh":"买完东西后，把小票在 Ibotta 里扫描/上传。"},{"en":"This deal offers $5 back through Ibotta.","zh":"这个优惠通过 Ibotta 返现 5 美元。"}]}],"synonyms":["cashback app","rebate app","rewards app"],"phonetic":"/aɪˈbɑːtə/","extraExplanation":["Ibotta 是一个美国品牌名，常见搭配有：“cash back through Ibotta / on Ibotta”（通过 Ibotta 返现）以及“redeem offers”（兑换/领取优惠）。","在实际使用中，你可能需要先在应用里“激活/领取”某个商品优惠，再在购物后上传收据或绑定会员卡来获得返现；不同商店和地区规则会不同。"]}
{"word":"Ibrahim","summary":{"en":"an Arabic male name; also the Islamic name for Abraham.","zh":"阿拉伯语男性名字；亦指伊斯兰语境中的亚伯拉罕（易卜拉欣）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, especially common in Arabic- and Muslim-majority cultures; the Arabic form of “Abraham.”","zh":"男性名字，常见于阿拉伯语与穆斯林文化圈；相当于英语名“Abraham（亚伯拉罕）”的阿语形式。"},"examples":[{"en":"Ibrahim is a popular name in many countries in the Middle East and Africa.","zh":"Ibrahim 在中东和非洲的许多国家都是很常见的名字。"},{"en":"His name is Ibrahim, but his English-speaking friends call him Abe.","zh":"他叫 Ibrahim，但讲英语的朋友叫他 Abe。"}]},{"partOfSpeech":"n.","definition":{"en":"in Islam, the prophet Abraham; a major religious figure associated with faith and devotion.","zh":"（伊斯兰语境）先知易卜拉欣，即《圣经》中的亚伯拉罕；重要的宗教人物，常与信仰与奉献联系在一起。"},"examples":[{"en":"In Islamic tradition, Ibrahim is remembered for his strong faith.","zh":"在伊斯兰传统中，易卜拉欣以坚定的信仰而被铭记。"},{"en":"Many stories about Ibrahim are shared across Judaism, Christianity, and Islam.","zh":"关于易卜拉欣的许多故事在犹太教、基督教和伊斯兰教中都有相通之处。"}]}],"synonyms":["Abraham","Abe"],"phonetic":"/ˈiːbrəhiːm/","extraExplanation":["用法提示：Ibrahim 通常重音在第一音节（EE-brah-heem）。在英语环境里，可能被拼写或读作更接近 “Abraham/艾布拉哈姆”，但 IBRĀHĪM 是独立且常见的名字形式。","文化背景：在穆斯林社区中，Ibrahim 是极受尊敬的先知名，因此也常被用来给孩子取名；在不同国家也会出现不同拼写（如 İbrahim、Ibraheem 等），但指向同一名字。"],"etymology":"源自阿拉伯语 Ibrāhīm（إِبْرَاهِيم）。一般认为与希伯来语 Abraham（“亚伯拉罕”）同源，是该名字在阿语与伊斯兰文化中的常见形式。","mnemonic":["记忆法：把它联想到中文常见译名“易卜拉欣”（yì-bǔ-lā-xīn），读音节奏和拼写 I-bra-him 很接近。","联想：Ibrahim = Abraham（亚伯拉罕）的阿语版本；看到 Ibra- 就想到 Abra-（同一来源）。"]}
{"word":"Ibrance","summary":{"en":"a brand-name cancer medicine (palbociclib)","zh":"一种抗癌处方药的商品名（帕博西尼）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand-name prescription medicine (palbociclib) used in cancer treatment, commonly for certain types of breast cancer, often taken with hormone therapy.","zh":"一种处方药的商品名（通用名 palbociclib 帕博西尼），用于癌症治疗，常见于某些类型乳腺癌，常与内分泌/激素治疗联合使用。"},"examples":[{"en":"Her doctor prescribed Ibrance along with hormone therapy.","zh":"医生给她开了 Ibrance，并配合内分泌（激素）治疗。"},{"en":"Ibrance is usually taken in cycles, so she marks the schedule on a calendar.","zh":"Ibrance 通常按疗程周期服用，所以她把用药日程标在日历上。"}]}],"synonyms":["palbociclib"],"phonetic":"/ˈaɪbræns/","extraExplanation":["发音提示：重音通常在开头，读起来像“EYE-brans”。","学习提示：在英文医疗语境里，药品常同时出现“商品名（Brand name）+ 通用名（generic name）”，例如 Ibrance (palbociclib)。","用法提示：它是处方抗癌药，涉及适应症与副作用等信息需以医生/药师指导为准；不要把药名当作可随意替换或自我用药的普通词。"],"etymology":"这是辉瑞（Pfizer）为药物 palbociclib 取的商品名；属于品牌命名，并非传统词源演变而来。","mnemonic":["把开头的 “I-” 想成 “I / 我”，联想“我（I）在‘BRANCE’这套疗程里按周期吃药”，帮助记住它常见的“按周期（cycle）服用”的用药语境。"]}
{"word":"Ibsen-inspired","summary":{"en":"Influenced by Ibsen’s realistic, socially critical drama.","zh":"受易卜生式现实主义与社会批判戏剧风格影响的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Influenced by the style, themes, or dramatic techniques of Henrik Ibsen (a Norwegian playwright), often involving realistic settings, moral conflict, and social criticism.","zh":"受挪威剧作家亨利克·易卜生的风格、主题或戏剧手法影响的；常带有现实主义场景、道德冲突与社会批判色彩。"},"examples":[{"en":"The film is Ibsen-inspired, focusing on a family secret that slowly destroys trust.","zh":"这部电影受易卜生启发，聚焦一个逐渐摧毁信任的家庭秘密。"},{"en":"She wrote an Ibsen-inspired play about gender roles and personal freedom.","zh":"她写了一部受易卜生启发的戏剧，探讨性别角色与个人自由。"},{"en":"The dialogue feels Ibsen-inspired: calm on the surface, but tense underneath.","zh":"这段对白很有易卜生式的味道：表面平静，底下却暗潮汹涌。"}]}],"synonyms":["Ibsenesque","influenced by Ibsen","realist","socially critical","naturalistic"],"phonetic":"ˈɪbzən ɪnˈspaɪrd","extraExplanation":["易卜生（Henrik Ibsen）代表作如《玩偶之家》《群鬼》，常写“体面外表下的压抑与谎言”、个人良知与社会规范的冲突。说某作品“Ibsen-inspired”，通常是在称它具备这种现实感、道德困境与社会批判的气质。","写作/评论中它多用连字符：Ibsen-inspired；有时也会写作 Ibsenesque（更偏“具有易卜生风格的”）。"],"etymology":"由“ Ibsen（易卜生的姓）+ inspired（受启发的）”构成的复合形容词。易卜生以现实主义戏剧与社会议题著称，因此该词常指“带有易卜生式的现实批判与心理张力”。","mnemonic":["把它拆开记：Ibsen + inspired = “易卜生 + 启发”。看到就联想到《玩偶之家》那种“家里看似平静、其实压力爆表”的剧情。","联想关键词：现实主义 + 社会批判 + 家庭/婚姻矛盾；这些特征出现时，就很“易卜生启发”。"]}
{"word":"Ibsen-like","summary":{"en":"in the realistic, socially critical style associated with Henrik Ibsen","zh":"具有易卜生式的现实主义与社会批判风格"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Similar to the style, themes, or dramatic methods of Henrik Ibsen, especially realistic plays that criticize society and explore moral conflict, family tension, and hidden secrets.","zh":"（在风格、主题或戏剧手法上）类似亨利克·易卜生的；尤指现实主义戏剧，带有社会批判、道德冲突、家庭矛盾与“隐秘真相”揭露的特点。"},"examples":[{"en":"The film feels Ibsen-like: a tidy home, then one secret unravels everything.","zh":"这部电影很有“易卜生式”的味道：一开始是体面的家庭，随后一个秘密把一切都扯开。"},{"en":"Her Ibsen-like dialogue is plain and direct, but it cuts deep.","zh":"她的对白很“易卜生式”：朴素直接，却很刺痛人心。"},{"en":"The story’s Ibsen-like ending refuses a neat, happy solution.","zh":"故事结尾很“易卜生式”，不肯给出圆满的皆大欢喜。"}]}],"synonyms":["Ibsenian","naturalistic","realist","psychological","hard-hitting","socially critical"],"phonetic":"/ˈɪb.sənˌlaɪk/","extraExplanation":["易卜生（1828–1906）常被视为现代现实主义戏剧的重要奠基者之一。他的作品（如《玩偶之家》《群鬼》）常写“体面外表下的裂缝”：家庭关系、性别角色、个人自由与社会规范的冲突。","“Ibsen-like”通常带有文学/评论语气：强调冷静、写实、心理与道德层面的紧张，以及对社会虚伪或压迫的揭露。"],"etymology":"来自挪威剧作家 Henrik Ibsen（亨利克·易卜生，19世纪）之姓 Ibsen + 形容词后缀 -like（“像……一样”）。常用于评论戏剧、电影、小说的现实主义气质与社会/道德议题。","mnemonic":["把 -like 记成“像……一样”，Ibsen-like 就是“像易卜生那样的（现实主义+社会批判）”。","联想《玩偶之家》：表面是“家”，内里是“困局”；一旦真相浮出，就很“易卜生式”。"]}
{"word":"Ibsenesque","summary":{"en":"in the style of Henrik Ibsen; serious, realistic drama about social or moral conflict","zh":"易卜生式的；严肃写实、聚焦社会或道德冲突的风格"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Norwegian playwright Henrik Ibsen or his works; resembling the themes and style of his plays (often serious, realistic, and focused on social or moral conflict).","zh":"与挪威剧作家亨利克·易卜生或其作品有关的；具有“易卜生式”风格的（常指严肃、写实，聚焦社会/道德冲突）。"},"examples":[{"en":"The film’s Ibsenesque tension comes from a family secret slowly surfacing at the dinner table.","zh":"这部电影的“易卜生式”张力来自一个家庭秘密在餐桌上逐渐浮出水面。"},{"en":"Her play is Ibsenesque in its realism and its criticism of social expectations.","zh":"她的剧本在写实手法和对社会期待的批判上很“易卜生式”。"}]}],"synonyms":["Ibsen-like","Ibsenish","realist","naturalistic","dramatic"],"phonetic":"ˌɪb.səˈnɛsk","extraExplanation":["易卜生（Henrik Ibsen）常被视为现代现实主义戏剧的重要奠基者之一，作品常以家庭与社会为舞台，揭示虚伪、压抑与道德困境（如《玩偶之家》《群鬼》）。因此 Ibsenesque 往往暗示：表面平静、内里冲突；角色被社会规范逼迫；结局不一定“圆满”，但很尖锐。"],"etymology":"源自作家姓氏 Ibsen + 形容词后缀 -esque（表示“……风格的/……式的”）。常用于评论戏剧、电影或小说的气质与主题。","mnemonic":["记后缀：-esque = “……风格的”，如 picturesque（如画的）。所以 Ibsen + -esque = “易卜生风格的”。","联想“易卜生＝一刀剖开家庭/社会真相”，Ibsenesque 常是“写实+揭露矛盾”的感觉。"]}
{"word":"ibsenian","summary":{"en":"Ibsenian means “related to Henrik Ibsen” or “in the realistic, socially critical style associated with his plays.”","zh":"Ibsenian 指“与易卜生或其作品相关”，也可指“具有易卜生戏剧那种写实、心理强烈并批判社会的风格”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Norwegian playwright Henrik Ibsen (1828–1906) or his works.","zh":"与挪威剧作家亨利克·易卜生（1828–1906）或其作品有关的。"},"examples":[{"en":"The professor assigned an Ibsenian drama for this week’s reading.","zh":"教授布置了本周阅读一部易卜生式（易卜生相关的）戏剧。"},{"en":"Her thesis explores Ibsenian themes of marriage, duty, and personal freedom.","zh":"她的论文探讨了易卜生作品中关于婚姻、责任与个人自由的主题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a style or tone associated with Ibsen’s plays—often realistic, psychologically intense, and critical of social rules.","zh":"具有“易卜生式”的风格或气质——常指写实、心理刻画强烈，并对社会规范带有批判性。"},"examples":[{"en":"The film’s Ibsenian tension comes from family secrets and moral pressure.","zh":"这部电影的“易卜生式”张力来自家庭秘密与道德压力。"},{"en":"It’s an Ibsenian ending: not comforting, but honest.","zh":"这是一个易卜生式的结局：不讨好观众，却很真实。"}]}],"synonyms":["Ibsenesque (less common)","Ibsen-like","realist (in literary context)"],"phonetic":"/ɪbˈsiːniən/","extraExplanation":["“Ibsenian”来自易卜生（Henrik Ibsen）的姓氏 + 形容词后缀 -ian，表示“……的 / 与……相关的”。","易卜生以《玩偶之家》（A Doll’s House）等作品闻名，常写中产家庭与社会道德的冲突；因此在文学评论里，Ibsenian 常暗示“现实主义戏剧、强烈的心理冲突、对社会虚伪的揭露”。","在英语里它多用于文学/戏剧评论语境；日常对话中较少见，常见搭配有：Ibsenian drama, Ibsenian themes, Ibsenian realism。"]}
{"word":"ibsenic","summary":{"en":"Ibsenic describes something in the style of Henrik Ibsen—serious, realistic drama with social critique and moral conflict.","zh":"Ibsenic 指具有易卜生式风格的作品：严肃写实、带社会批判并聚焦道德冲突。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, characteristic of, or reminiscent of the Norwegian playwright Henrik Ibsen—often describing serious, realistic drama that critiques social norms and explores moral conflict.","zh":"与挪威剧作家亨利克·易卜生（Henrik Ibsen）有关的；具有“易卜生式”风格的——常指严肃、写实、批判社会规范并探讨道德冲突的戏剧（或氛围）。"},"examples":[{"en":"The film has an Ibsenic tension: polite conversation on the surface, moral crisis underneath.","zh":"这部电影有一种易卜生式的张力：表面上客客气气的对话，底下却是道德危机。"},{"en":"Her play feels Ibsenic in its focus on family secrets and social hypocrisy.","zh":"她的戏剧因聚焦家庭秘密与社会虚伪而带有易卜生式的味道。"}]}],"synonyms":["Ibsen-like","realist","naturalistic","socially critical","problem-play"],"phonetic":"/ɪbˈsɛnɪk/","extraExplanation":["“Ibsenic”来自剧作家Henrik Ibsen（易卜生）的名字，常用来形容他的代表性写实社会剧风格：以家庭/婚姻/名誉等为切入点，揭露虚伪与压迫，并让人物在良知与社会期待之间挣扎。","常被提到的“易卜生式”作品包括《玩偶之家》（A Doll’s House）、《群鬼》（Ghosts）、《人民公敌》（An Enemy of the People）。在评论中说某部作品“Ibsenic”，通常是在强调它的社会批判力度与压抑而尖锐的心理现实感。"]}
{"word":"ibsenish","summary":{"en":"“Ibsenish” means ‘in the style of Henrik Ibsen’: realistic, serious drama about social and moral conflict.","zh":"“Ibsenish”意为“易卜生式的”：现实主义、严肃，聚焦社会与道德冲突的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling the style, themes, or tone of Henrik Ibsen’s plays—often realistic, serious, and focused on social problems and moral conflict.","zh":"带有“易卜生式”风格的：类似亨利克·易卜生戏剧的主题或语气——常见特点是现实主义、严肃，关注社会问题与道德冲突。"},"examples":[{"en":"The movie’s ending felt Ibsenish: quiet, tense, and full of unresolved moral questions.","zh":"这部电影的结尾很“易卜生式”：安静却紧绷，充满未解的道德疑问。"},{"en":"Her Ibsenish dialogue exposed the family’s secrets without any dramatic music or shouting.","zh":"她那“易卜生式”的对白在没有配乐煽情或大吵大闹的情况下，把家庭秘密揭开了。"}]}],"synonyms":["Ibsenesque","realistic","socially critical","dramatic","somber"],"phonetic":"/ˈɪb.sən.ɪʃ/","extraExplanation":["“Ibsenish”来自挪威剧作家亨利克·易卜生（Henrik Ibsen）。他以现实主义戏剧著名，常写婚姻、家庭、社会规范与个人自由之间的冲突（如《玩偶之家》）。因此形容某部作品“易卜生式”，通常暗示：情节更贴近现实、氛围克制但压迫感强、人物在伦理与社会压力中挣扎，结局可能不提供简单答案。","这个词多用于文学、戏剧、影评或评论写作，语气偏书面，有时也带一点“严肃得像舞台剧”的感觉。"]}
{"word":"ibsenism","summary":{"en":"Ibsenism means the style or influence of Henrik Ibsen’s realistic, socially critical drama.","zh":"Ibsenism 指易卜生的现实主义、社会批判戏剧风格或其影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ideas, style, or influence of the Norwegian playwright Henrik Ibsen, especially his realistic plays that criticize social hypocrisy and explore moral choices.","zh":"“易卜生主义”；指挪威剧作家亨利克·易卜生的思想、写作风格或影响，尤指其现实主义戏剧中对社会虚伪的批判与对道德抉择的探讨。"},"examples":[{"en":"Some critics accused the new drama of promoting ibsenism because it questioned traditional marriage.","zh":"一些评论家指责这部新戏在宣扬“易卜生主义”，因为它质疑传统婚姻。"},{"en":"In her literature class, she traced ibsenism in modern plays that focus on social problems.","zh":"在文学课上，她梳理了现代戏剧中关注社会问题的“易卜生主义”影响。"}]}],"synonyms":["Ibsen’s influence","Ibsen-esque realism","problem play tradition"],"phonetic":"/ˈɪbsənˌɪzəm/","extraExplanation":["“Ibsenism”多见于文学批评语境（19世纪末—20世纪初尤常见）。它常用来概括易卜生戏剧带来的“问题剧”（problem play）风潮：以现实社会议题为核心，通过家庭与个人冲突揭示阶级、性别、道德与法律等矛盾。","语气上，“Ibsenism”有时是中性描述（指风格/影响），有时也带一点批评意味，暗指作品过于“社会议题化”、说教或对传统价值过于挑战。","相关作品常被提及如《玩偶之家》（A Doll’s House）、《群鬼》（Ghosts）、《人民公敌》（An Enemy of the People），它们经常作为“易卜生式”现实主义与社会批判戏剧的代表。"]}
{"word":"ibsenite","summary":{"en":"An Ibsenite is a follower of Henrik Ibsen or something influenced by his realist, socially critical drama.","zh":"Ibsenite 指易卜生的追随者，或指受其现实主义与社会批判戏剧风格影响的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a supporter, admirer, or follower of the Norwegian playwright Henrik Ibsen, especially someone influenced by his realist ideas in drama and society.","zh":"易卜生主义者；（挪威剧作家）亨利克·易卜生的崇拜者、拥护者或追随者，尤指受其现实主义戏剧与社会观影响的人。"},"examples":[{"en":"In the 1890s, some critics mocked young theatergoers as Ibsenites for praising realistic plays.","zh":"在19世纪90年代，一些评论家嘲笑年轻的戏剧观众为“易卜生主义者”，因为他们推崇现实主义戏剧。"},{"en":"She became an Ibsenite after reading A Doll’s House and began questioning traditional family roles.","zh":"她读完《玩偶之家》后成了易卜生的追随者，并开始反思传统的家庭角色。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to, characteristic of, or influenced by Henrik Ibsen’s works and style (often implying serious realism and social critique).","zh":"易卜生的；与易卜生作品、风格有关的，或受其影响的（常暗示严肃的现实主义与社会批判）。"},"examples":[{"en":"The play’s Ibsenite dialogue feels natural and tense, like a real argument at home.","zh":"这部戏的“易卜生式”对白自然而紧张，像家中真实的争吵。"},{"en":"He preferred Ibsenite drama to light comedies because it dealt with social problems.","zh":"他更喜欢易卜生式戏剧而不是轻喜剧，因为前者讨论社会问题。"}]}],"synonyms":["Ibsen fan","Ibsen follower","Ibsen-inspired"],"phonetic":"/ˈɪbzəˌnaɪt/","extraExplanation":["“Ibsenite”常见于19世纪末至20世纪初的英语评论与文化讨论中。当时易卜生的现实主义戏剧（如《玩偶之家》）在欧洲与英美引发热议，支持者被称为“Ibsenites”。","在一些语境里该词可能带一点讽刺或贬义，暗指某人过于严肃、爱谈社会问题，或热衷“进步/改革”的戏剧与思想。"]}
{"word":"ibuprofen","summary":{"en":"Ibuprofen is a widely used NSAID medicine for pain relief, fever reduction, and inflammation control.","zh":"Ibuprofen（布洛芬）是一种常用的NSAID药物，用于止痛、退烧和抗炎消肿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common medicine used to reduce pain, fever, and swelling (inflammation). It is a type of NSAID (nonsteroidal anti-inflammatory drug).","zh":"一种常见的药物，用于缓解疼痛、退烧并减轻肿胀（炎症）。它属于NSAID（非甾体抗炎药）。"},"examples":[{"en":"I took ibuprofen for my headache, and it helped after about 30 minutes.","zh":"我头痛吃了布洛芬，大约30分钟后就缓解了。"},{"en":"The doctor said ibuprofen can reduce swelling in a sprained ankle.","zh":"医生说布洛芬可以减轻扭伤脚踝的肿胀。"},{"en":"If you have a fever, ibuprofen is one option, but follow the directions on the label.","zh":"如果你发烧，布洛芬是一种选择，但要按说明书用药。"}]}],"synonyms":["NSAID","pain reliever","anti-inflammatory"],"phonetic":"/ˌaɪ.bjuːˈproʊ.fən/","extraExplanation":["在美国，ibuprofen 常见品牌名有 Advil 和 Motrin；在中文语境里常译为“布洛芬”。","属于 NSAID：通常用于疼痛/炎症（如牙痛、经痛、肌肉酸痛）。但对部分人可能刺激胃、增加胃出血风险；有胃病史、正在服用抗凝药、或肾功能问题的人要先咨询医生/药师。","和 acetaminophen（对乙酰氨基酚/泰诺）不同：ibuprofen 更偏“消炎+止痛”，acetaminophen 更偏“止痛+退烧”，但不太消炎。用药选择应结合个人情况并遵医嘱。"]}
{"word":"ibycter","summary":{"en":"“ibycter” is not a recognized English word; it’s likely a typo or a proper name.","zh":"“ibycter”不是可识别的英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name (proper noun) rather than common vocabulary.","zh":"不是标准英语单词。更可能是拼写错误，或是专有名词（人名/地名/作品名）而非常用词汇。"},"examples":[{"en":"I can’t find “ibycter” in an English dictionary—could it be a typo?","zh":"我在英语词典里找不到“ibycter”——它会不会是拼写错了？"},{"en":"If you tell me the sentence where you saw “ibycter,” I can guess the intended word.","zh":"如果你把看到“ibycter”的句子发我，我可以帮你推测原本想写的词。"}]}],"extraExplanation":["“ibycter”看起来不像常见英语构词。它可能是：\n1）键盘误触/拼写错（例如少字母、字母顺序颠倒）；\n2）专有名词（人名、游戏ID、账号名、品牌名等）；\n3）与医学词根 *icter-*（与“黄疸”相关，如 *icterus*）混淆，但“ibycter”本身不对应常用词。\n\n你可以把它出现的上下文句子、你想表达的中文意思、或你怀疑的正确拼写发来，我再给你最可能的正确单词与用法。"]}
{"word":"ibycus","summary":{"en":"Ibycus was an ancient Greek lyric poet, also remembered through the legend of “the cranes of Ibycus.”","zh":"Ibycus 指古希腊抒情诗人伊比库斯，也常因“伊比库斯的鹤”的典故而被记住。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Greek lyric poet (6th century BCE) known for love poetry and for a famous legend about “the cranes of Ibycus.”","zh":"伊比库斯：古希腊抒情诗人（约公元前6世纪），以爱情诗作闻名，并因“伊比库斯的鹤”的传说而广为人知。"},"examples":[{"en":"Ibycus is often mentioned alongside other early Greek lyric poets.","zh":"伊比库斯常与其他早期希腊抒情诗人并列提及。"},{"en":"The story of “the cranes of Ibycus” is sometimes used as an example of justice catching up with a criminal.","zh":"“伊比库斯的鹤”的故事有时用来说明正义终会追上罪犯。"}]}],"synonyms":["Greek lyric poet","lyric poet"],"phonetic":"/ˈɪbɪkəs/","extraExplanation":["“伊比库斯的鹤”（the cranes of Ibycus）是一个著名传说：相传伊比库斯遇害前向天空中的鹤求证，后来凶手在剧场里看到鹤飞过，失言暴露，从而被揭发。该故事在德语文学中尤为有名，例如席勒（Schiller）的叙事诗《伊比库斯的鹤》（Die Kraniche des Ibykus）使其广泛流传。","英文里 Ibycus 通常作为专有名词出现（人名），首字母大写；也常在文学、古典学或“典故/寓意”语境中出现。"]}

