{"word":"IHC","summary":{"en":"a lab antibody test on tissue to detect specific proteins","zh":"在组织上用抗体检测特定蛋白的实验方法"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"immunohistochemistry: a laboratory method that uses antibodies to detect specific proteins (antigens) in tissue samples, often to help diagnose diseases such as cancers.","zh":"免疫组织化学：一种实验室方法，用抗体在组织样本中检测特定蛋白（抗原），常用于辅助诊断疾病（如肿瘤）。"},"examples":[{"en":"The pathologist ordered IHC to confirm the type of tumor.","zh":"病理医生安排做 IHC 来确认肿瘤类型。"},{"en":"IHC staining showed that the cells were positive for HER2.","zh":"IHC 染色显示这些细胞 HER2 为阳性。"},{"en":"IHC can help identify where a cancer likely started.","zh":"IHC 可以帮助判断癌症可能的原发部位。"}]}],"synonyms":["immunohistochemistry","antibody staining","immunostaining"],"phonetic":"/ˌaɪ eɪtʃ ˈsiː/","extraExplanation":["在病理科语境里，IHC 常与“染色/标记（staining）”“阳性/阴性（positive/negative）”“表达（expression）”一起出现，用来描述某个蛋白在组织中的存在与分布。","常见用途：区分肿瘤类型、判断肿瘤来源、评估治疗靶点（如 ER/PR、HER2、PD-L1 等）。"],"etymology":"缩写自 immuno-（免疫）+ histo-（组织）+ chemistry（化学/化学方法）。IHC 在医学检验和病理报告里常作为首字母缩略词使用。","mnemonic":["把 IHC 记成“Immuno + Histo + Chemistry”的首字母：免疫(I) + 组织(H) + 化学方法(C) → 用抗体在组织里做检测。"]}
{"word":"ihi","summary":{"en":"IHI is an abbreviation most commonly meaning the Institute for Healthcare Improvement, and sometimes referring to Japan’s IHI Corporation.","zh":"IHI 是一个缩写，最常见指“医疗保健改进研究所”，也可能指日本的 IHI 工业公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Institute for Healthcare Improvement (IHI): a U.S.-based nonprofit organization known for improving healthcare quality and patient safety.","zh":"医疗保健改进研究所（IHI）：一家美国非营利机构，以推动医疗质量与患者安全改进而闻名。"},"examples":[{"en":"Our hospital uses IHI guidelines to reduce medication errors.","zh":"我们医院采用 IHI 的指南来减少用药错误。"},{"en":"She attended an IHI training on quality improvement.","zh":"她参加了 IHI 的质量改进培训。"}]},{"partOfSpeech":"n.","definition":{"en":"IHI Corporation: a Japanese engineering and heavy-industry company (often written simply as IHI).","zh":"IHI 株式会社：日本的一家工程与重工业公司（常直接写作 IHI）。"},"examples":[{"en":"IHI produces equipment used in energy and aerospace industries.","zh":"IHI 生产用于能源与航空航天行业的设备。"}]}],"phonetic":"/ˌaɪ eɪtʃ ˈaɪ/","extraExplanation":["“IHI”通常按字母逐个读作 “I-H-I”（不是读成一个单词）。在不同语境里含义可能不同：医疗领域常指 Institute for Healthcare Improvement；商业/工业新闻里可能指日本的 IHI 公司。看上下文（hospital/quality improvement vs. engineering/industry）最容易判断。"]}
{"word":"ihlat","summary":{"en":"“ihlat” isn’t a standard English word; it’s likely a misspelling or a proper name.","zh":"“ihlat”不是标准英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a name (proper noun).","zh":"不是标准英语单词；更可能是拼写错误或专有名词（名称）。"},"examples":[{"en":"I couldn’t find “ihlat” in major English dictionaries—did you mean “inhalant” or “inhaler”?","zh":"我在主要英语词典里找不到“ihlat”——你是不是想写“inhalant（吸入剂）”或“inhaler（吸入器）”？"}]}],"extraExplanation":["“ihlat”在英语里不常见，最常见情况是打字漏字母或拼写颠倒。你可以回我：你想表达的中文意思、完整句子，或你看到它的上下文，我就能准确帮你匹配目标词。","如果你是在写与“吸入”有关的词，常见正确拼写包括：inhaler（吸入器/吸入式喷雾）、inhalant（吸入剂）、inhale（吸入）。如果你指的是地名/人名，也可能是某个专名的转写。"]}
{"word":"ihleite","summary":{"en":"“ihleite” isn’t recognized as a standard English word; it’s likely a typo or a name. Share context to identify the intended word.","zh":"“ihleite”不是常见英语词，可能是拼写错误或专有名词；请提供上下文以确认你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name (proper noun), or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、专有名词（人名/地名），或来自其他语言的词。"},"examples":[{"en":"I can’t find “ihleite” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“ihleite”，你能把它出现的句子发我吗？"},{"en":"If you meant “highlight,” the spelling is h-i-g-h-l-i-g-h-t.","zh":"如果你想写“highlight（突出/高亮）”，拼写是 h-i-g-h-l-i-g-h-t。"}]}],"phonetic":"/aɪˈlaɪt/","extraExplanation":["“ihleite”很像键入时漏/错按导致的拼写（例如想写 highlight、ignite 等）。如果你把上下文句子、来源（书/网站/聊天）、或你想表达的中文意思发来，我可以帮你精准判断是哪一个词，并给出正确发音与用法。"]}
{"word":"ihp","summary":{"en":"IHP is an initialism; its exact meaning depends on the context (often an Individual Learning/Healthcare Plan in schools).","zh":"IHP 是首字母缩略词；具体含义取决于语境（在学校里常指个别化学习/健康照护计划）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(initialism) The abbreviation “IHP,” usually said as separate letters; its meaning depends on the context (organization, program, or term name).","zh":"（首字母缩略词）“IHP”通常按字母分别读；具体含义取决于语境（某个组织、项目或术语名称）。"},"examples":[{"en":"What does IHP stand for in this document?","zh":"在这份文件里，IHP代表什么？"},{"en":"In healthcare, IHP can mean different programs, so please check the full name.","zh":"在医疗语境中，IHP可能指不同项目，所以请确认其全称。"}]},{"partOfSpeech":"other","definition":{"en":"(common use, education) Individualized/Individual Learning Plan (sometimes shortened as IHP in some schools).","zh":"（常见用法，教育）个别化学习计划（有些学校会把它简称为 IHP）。"},"examples":[{"en":"The teacher reviewed the student’s IHP goals for this semester.","zh":"老师查看了这名学生本学期的 IHP 目标。"},{"en":"Parents can ask for an IHP meeting if extra support is needed.","zh":"如果需要额外支持，家长可以要求召开 IHP 会议。"}]},{"partOfSpeech":"other","definition":{"en":"(common use, healthcare) Individualized/Individual Healthcare Plan, a written plan for managing a student’s medical needs at school.","zh":"（常见用法，医疗/学校）个别化健康照护计划：用于在学校管理学生医疗需求的书面方案。"},"examples":[{"en":"The school nurse created an IHP for the child’s asthma.","zh":"校医为孩子的哮喘制定了 IHP。"},{"en":"Staff should read the IHP before the field trip.","zh":"出发去校外活动前，工作人员应阅读 IHP。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/aɪ eɪtʃ piː/","extraExplanation":["“IHP”不是一个固定单词，而是缩写（initialism）。最稳妥的做法是：在第一次出现时写出全称（例如 Individual Healthcare Plan），后面再用 IHP。","如果你告诉我 IHP 出现的领域（学校/医疗/商业/工程等）或给我一句原文，我可以帮你精准判断它在你那段文字里的意思。"]}
{"word":"ihram","summary":{"en":"Ihram is the sacred state (and the simple clothing) Muslims adopt before Hajj or Umrah, with special rules and a focus on purity and devotion.","zh":"Ihram 指穆斯林在朝觐或小朝觐前进入的神圣戒禁状态，也可指所穿的简朴戒衣，强调洁净、克制与虔敬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Islam, the special state of ritual purity and dedication a person enters before performing Hajj (pilgrimage) or Umrah, with specific rules to follow.","zh":"伊斯兰教中，朝觐（Hajj）或小朝觐（Umrah）前进入的一种“戒禁/受戒”状态，表示洁净与专注，并需遵守特定禁戒。"},"examples":[{"en":"Before starting Umrah, he entered ihram at the miqat.","zh":"开始小朝觐前，他在指定地点（miqat）进入了戒禁状态（ihram）。"},{"en":"While in ihram, pilgrims avoid certain actions, such as using perfume.","zh":"处于戒禁状态（ihram）时，朝觐者会避免某些行为，例如使用香水。"}]},{"partOfSpeech":"n.","definition":{"en":"The simple clothing worn for Hajj or Umrah—especially the two plain white cloths worn by men.","zh":"朝觐或小朝觐时穿的简朴服装；尤指男性常穿的两块素白布（上披、下裹）。"},"examples":[{"en":"He put on his ihram and prepared to begin the rites.","zh":"他穿上戒衣（ihram），准备开始仪式。"},{"en":"The white ihram symbolizes equality among pilgrims.","zh":"白色戒衣（ihram）象征朝觐者之间的平等。"}]}],"synonyms":["ritual consecration","pilgrim’s garb","sacred state"],"phonetic":"/ˈiːrɑːm/","extraExplanation":["“ihram”源自阿拉伯语，既可指“状态”（受戒/戒禁），也可指“衣服”（戒衣）。在Hajj与Umrah中，人们在特定地点（miqat）开始进入ihram：除了更注重洁净、祈祷与克制外，也有一些禁戒（如男性通常不剪发、不剪指甲、不用香水等，具体细节依传统与教法解释而定）。","服装层面：男性常穿两块不缝合的白布，以强调朴素与平等；女性一般穿端庄、符合宗教规范的日常衣着，不一定是两块白布。使用时可说 “enter ihram / be in ihram / put on ihram”。"]}
{"word":"ihrams","summary":{"en":"Ihram (plural: ihrams) means either the simple garment worn by Muslim pilgrims during Hajj/Umrah or the sacred state of consecration with specific rules.","zh":"Ihram（复数：ihrams）既指穆斯林朝觐/副朝时穿的戒衣，也指进入朝觐仪式后的受戒状态与相关戒律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple white garment (often two unsewn pieces of cloth for men) worn by Muslim pilgrims during Hajj or Umrah","zh":"（穆斯林在朝觐Hajj或副朝Umrah时穿的）戒衣；通常为白色、朴素的衣物（男性多为两块未缝合的布）"},"examples":[{"en":"He put on his ihram before entering Mecca for Umrah.","zh":"他在进入麦加进行副朝前穿上了戒衣。"},{"en":"Pilgrims in ihram look very similar, emphasizing equality.","zh":"穿着戒衣的朝觐者看起来很相似，强调人人平等。"}]},{"partOfSpeech":"n.","definition":{"en":"the sacred state a pilgrim enters for Hajj or Umrah, with specific religious rules (for example, avoiding certain actions)","zh":"（朝觐或副朝时进入的）受戒状态；一种神圣的仪式状态，需要遵守特定戒律"},"examples":[{"en":"Once in ihram, he avoided cutting his hair and nails.","zh":"一旦进入受戒状态，他就避免剪头发和指甲。"},{"en":"They entered ihram at the miqat, the designated boundary.","zh":"他们在米卡特（规定界线处）进入受戒状态。"}]}],"synonyms":["pilgrimage garment","state of consecration"],"phonetic":"/ˈɪrɑːm/","extraExplanation":["“ihram”源自阿拉伯语，既可指“戒衣”（衣着），也可指“受戒状态”（仪式身份）。英语里这两种用法都常见，需结合语境判断。","在很多英语文章中会写作“in ihram”（处于受戒状态）或“wearing ihram”（穿着戒衣）。复数是 “ihrams”。","文化背景补充：戒衣的朴素与统一，常被解释为象征谦卑与平等；不同性别与学派在具体穿着与规定上可能有差异。"]}
{"word":"IHS","summary":{"en":"An initialism whose meaning depends on context, commonly a U.S. health agency or “in-house” services.","zh":"一个需看语境的字母缩写，常指美国卫生机构或“内部服务”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Indian Health Service: a U.S. federal agency that provides healthcare services to American Indians and Alaska Natives.","zh":"（美国）印第安人卫生服务局：为美洲印第安人和阿拉斯加原住民提供医疗服务的联邦机构。"},"examples":[{"en":"She works as a nurse for the IHS in Arizona.","zh":"她在亚利桑那州的 IHS 做护士。"},{"en":"The clinic receives funding through the IHS.","zh":"这家诊所通过 IHS 获得资金支持。"}]},{"partOfSpeech":"other","definition":{"en":"In-house services (abbr.): services provided within an organization, not outsourced.","zh":"（缩写）内部服务：由机构内部提供、而非外包的服务。"},"examples":[{"en":"We handle design IHS to keep costs down.","zh":"我们把设计做成内部服务（IHS），以降低成本。"},{"en":"The company moved IT support from contractors to IHS.","zh":"公司把 IT 支持从承包商改为内部服务（IHS）。"}]},{"partOfSpeech":"other","definition":{"en":"Acronym used by some companies/brands (e.g., IHS Markit, now part of S&P Global): a name for business information and analytics services.","zh":"一些公司/品牌名称中的缩写（如 IHS Markit，现并入标普全球 S&P Global）：指商业信息与数据分析服务机构。"},"examples":[{"en":"The report was published by IHS Markit.","zh":"这份报告由 IHS Markit 发布。"},{"en":"We used IHS data to estimate market demand.","zh":"我们用 IHS 的数据来估算市场需求。"}]}],"synonyms":["Indian Health Service","in-house","internal services"],"phonetic":"/ˌaɪ eɪtʃ ˈɛs/","extraExplanation":["如果你能提供一句包含“IHS”的原句或所在领域（医疗/公司/学校/宗教等），我可以帮你锁定最准确的含义。","在邮件、报告、合同里，缩写往往是“组织名/部门名/服务模式”的简写；同一缩写在不同国家或行业可能完全不同。"],"etymology":"这是由三个字母组成的首字母缩略词（initialism），通常按字母逐个读（I-H-S）。具体含义取决于上下文：在美国医疗语境中常指 Indian Health Service；在职场语境中也可能被用来表示 in-house（内部的）服务；在商业语境中也可能指公司名称（如 IHS Markit）。","mnemonic":["把它当成拼读字母：I / aɪ /（像“爱”）+ H（“H”谐音“爱吃”里的“吃”开头音）+ S（“S”像“丝”），记成“爱-H-丝”，提醒自己这是缩写要看上下文。","看到医疗相关材料时，优先联想到 Indian Health Service（印第安人卫生服务局）。"]}
{"word":"ihs","summary":{"en":"IHS is most commonly the abbreviation for the U.S. Indian Health Service; it can also refer to a Christian symbol, or other organization names depending on context.","zh":"IHS 最常见是美国“印第安人健康服务局”的缩写；也可指一种基督宗教符号，或在不同语境下代表其他机构名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Indian Health Service,” a U.S. federal agency that provides health care services to American Indians and Alaska Natives.","zh":"“Indian Health Service（美国印第安人健康服务局）”的缩写，是美国联邦机构，为美国原住民与阿拉斯加原住民提供医疗健康服务。"},"examples":[{"en":"She works as a nurse for the IHS in Arizona.","zh":"她在亚利桑那州的 IHS 担任护士。"},{"en":"The clinic is funded through the IHS.","zh":"这家诊所由 IHS 提供资金支持。"}]},{"partOfSpeech":"other","definition":{"en":"a Christian symbol (a “christogram”) made from the letters IHS, commonly seen on churches and religious art.","zh":"一种基督宗教符号（“基督字母组合”），由 IHS 三个字母组成，常见于教堂与宗教艺术中。"},"examples":[{"en":"The IHS symbol was carved above the church door.","zh":"教堂门上方刻着 IHS 符号。"},{"en":"You can see IHS on many older Catholic altars.","zh":"在许多较古老的天主教祭坛上都能看到 IHS。"}]},{"partOfSpeech":"other","definition":{"en":"the letters “I-H-S” used as an abbreviation in names of organizations (the meaning depends on context).","zh":"字母缩写“I-H-S”，可代表不同机构名称（具体含义取决于语境）。"},"examples":[{"en":"What does IHS stand for in this document?","zh":"在这份文件里，IHS 代表什么？"},{"en":"IHS could mean different things in different countries.","zh":"在不同国家里，IHS 可能代表不同含义。"}]}],"synonyms":["Indian Health Service (in U.S. healthcare context)"],"phonetic":"/ˌaɪ eɪtʃ ˈɛs/","extraExplanation":["在英语里，缩写 IHS 的常见读法是逐字母读（I-H-S）。它的具体含义高度依赖语境：在美国公共卫生/医疗语境中最常见的是 Indian Health Service。","作为宗教符号时，IHS 常被解释为拉丁化的希腊语“耶稣”（Jesus）之名的字母组合，也常与天主教传统联系更紧密。"]}
{"word":"iht","summary":{"en":"IHT is an abbreviation most commonly meaning “Inheritance Tax” (UK), and in medical contexts it can mean “intrahospital transfer.”","zh":"IHT 是一个缩写，最常见指（英国的）Inheritance Tax“遗产税”；在医疗语境中也可指 intrahospital transfer“院内转运”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inheritance Tax (especially in the UK): a tax paid on money or property someone leaves when they die.","zh":"（尤指英国的）遗产税：对逝者留下的金钱或财产所征收的税。"},"examples":[{"en":"In the UK, families may have to pay IHT if the estate is above the threshold.","zh":"在英国，如果遗产总额超过免税门槛，家人可能需要缴纳 IHT（遗产税）。"},{"en":"They hired an accountant to plan for IHT and reduce the tax bill legally.","zh":"他们请了会计师做 IHT（遗产税）规划，以合法降低税负。"}]},{"partOfSpeech":"n.","definition":{"en":"Intrahospital transfer: moving a patient from one place to another within the same hospital (used in medical contexts).","zh":"（医学）院内转运：在同一家医院内部将病人从一个地点转到另一个地点。"},"examples":[{"en":"The patient needed an IHT from the emergency department to the ICU.","zh":"病人需要从急诊科进行 IHT（院内转运）到重症监护室。"},{"en":"During IHT, staff must monitor the patient’s oxygen level and blood pressure.","zh":"在 IHT（院内转运）过程中，工作人员必须监测病人的血氧和血压。"}]}],"synonyms":["Inheritance Tax","estate tax","intrahospital transfer"],"phonetic":"/aɪ eɪtʃ tiː/","extraExplanation":["“IHT”是缩写，不同领域含义不同。日常生活里最常见的是英国语境下的 Inheritance Tax（遗产税）；在医疗英语里也常见 intrahospital transfer（院内转运）。如果你告诉我上下文（金融/法律/医疗/聊天），我可以给出最贴切的解释与用法。"]}

