{"word":"ing","summary":{"en":"-ing is usually a suffix that forms the -ing form of verbs (present participle/gerund) and can also help make nouns and adjectives.","zh":"-ing 通常是后缀，用来构成动词的 -ing 形式（现在分词/动名词），也可用于构成名词和形容词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common suffix added to verbs to form the present participle or gerund (e.g., “working”), often used for actions in progress or for naming an activity.","zh":"常见的动词后缀，用来构成现在分词或动名词（如 working），常表示正在进行的动作，或把动作当作“活动/事情”来指称。"},"examples":[{"en":"She is studying right now.","zh":"她现在正在学习。"},{"en":"Swimming is good exercise.","zh":"游泳是很好的运动。"},{"en":"I heard someone singing outside.","zh":"我听到外面有人在唱歌。"}]},{"partOfSpeech":"other","definition":{"en":"A noun-forming suffix meaning “the activity of” or “the result of” an action (e.g., “building,” “painting”).","zh":"名词化后缀，表示“……的活动”或“……的结果/作品”（如 building 建筑物/建造，painting 绘画/画作）。"},"examples":[{"en":"The building is very old.","zh":"这栋建筑很古老。"},{"en":"Her painting won first prize.","zh":"她的画得了一等奖。"}]},{"partOfSpeech":"other","definition":{"en":"An adjective-forming suffix meaning “having the quality of” (common in words like “interesting,” “boring,” “exciting”).","zh":"形容词后缀，表示“具有……特征/让人感到……的”（常见于 interesting 有趣的、boring 无聊的、exciting 令人兴奋的）。"},"examples":[{"en":"That movie was really interesting.","zh":"那部电影真的很有趣。"},{"en":"The lecture was boring, so I got sleepy.","zh":"讲座很无聊，所以我困了。"}]},{"partOfSpeech":"other","definition":{"en":"An informal spelling in some names or slang (e.g., “Dancing” in titles), but “-ing” itself is not usually a standalone word in standard English.","zh":"在一些名称、标题或俚语拼写中可能出现，但在标准英语里 “-ing” 通常不是独立单词，而是后缀。"},"examples":[{"en":"The sign says “No Smoking.”","zh":"牌子上写着“禁止吸烟”。"}]}],"phonetic":"/ɪŋ/","extraExplanation":["拼写规则小提示：很多动词加 -ing 会有拼写变化：\n1) 以不发音的 e 结尾：去 e + ing（make → making, write → writing）。\n2) “辅音 + 元音 + 辅音”且重读在最后一音节：双写末尾辅音 + ing（run → running, sit → sitting）。\n3) 以 ie 结尾：变 ie 为 y + ing（lie → lying, die → dying）。","语法功能上，-ing 形式常见三种用法：\n1) 进行时：be + V-ing（I am working）。\n2) 动名词作主语/宾语：V-ing 作“事情”（Reading helps me relax）。\n3) 现在分词作修饰/补语：a smiling child；I saw him running."]}
{"word":"Inga","summary":{"en":"a personal name; also a tropical tree genus","zh":"人名；也指一种热带豆科树木的属名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used in several cultures","zh":"人名（名字）；在多种文化中使用的名字"},"examples":[{"en":"Inga introduced herself at the start of the meeting.","zh":"Inga 在会议开始时做了自我介绍。"},{"en":"I got an email from Inga this morning.","zh":"我今天早上收到了 Inga 的邮件。"}]},{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees in the pea family, common in Central and South America","zh":"印加豆属（热带树木的一属，豆科），常见于中美洲与南美洲"},"examples":[{"en":"The farm planted Inga trees to provide shade for coffee plants.","zh":"农场种植印加豆属的树为咖啡树提供遮阴。"},{"en":"Some Inga species produce long pods with sweet pulp.","zh":"一些印加豆属物种会结出长豆荚，里面有甜甜的果肉。"}]}],"synonyms":["ice-cream bean","guama"],"phonetic":"/ˈɪŋɡə/","extraExplanation":["作为人名：在北欧较常见，读音一般为“ING-guh”。不同国家/语言里读法可能略有变化。","作为植物：印加豆属里有些树的果荚因果肉香甜，在英语里常被叫作“ice-cream bean”（冰淇淋豆/冰淇淋果）。"],"etymology":"作人名时，常见于北欧语境（如挪威、瑞典等），历史上也可追溯到日耳曼语族的人名传统；作植物学名称时，“Inga”是拉丁化的属名，用于分类学命名。","mnemonic":["发音记忆：像“英(ing) + 额(a)”连起来，/ˈɪŋɡə/。","植物义联想：把 Inga 想成“in（在） + ga（嘎）”，在热带雨林里“在那儿”的豆科大树。"]}
{"word":"inga","summary":{"en":"“Inga” is most commonly a female first name, especially in Scandinavia; it can also be a rare place name.","zh":"“Inga”最常见是女性名字（尤其在北欧）；也可能是较少见的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (used especially in Scandinavian countries).","zh":"女性名字（尤其常见于北欧/斯堪的纳维亚国家）。"},"examples":[{"en":"Inga moved to the U.S. when she was ten.","zh":"Inga 十岁时搬到了美国。"},{"en":"I met Inga at a language exchange club.","zh":"我在语言交换社团认识了 Inga。"}]},{"partOfSpeech":"other","definition":{"en":"(rare in English) used as a place name in some regions.","zh":"（英语中较少见）在某些地区用作地名。"},"examples":[{"en":"They drove through Inga on their way to the coast.","zh":"他们在去海岸的路上开车经过 Inga。"}]}],"phonetic":"/ˈɪŋɡə/","extraExplanation":["“Inga”在英语里最常见的用法是人名（专有名词），因此通常不翻译，只是音译或直接保留原拼写。","在北欧文化中，它常被视为传统女性名；具体来源可能与更长的名字或古日耳曼语词根相关，但在日常英语使用中一般不需要追溯词源。"]}
{"word":"ingaevones","summary":{"en":"Ingaevones are early West Germanic North Sea coastal peoples; the term is also used in linguistics for the North Sea Germanic dialect group.","zh":"Ingaevones 指北海沿岸的早期西日耳曼族群；也可指语言学上的“北海日耳曼”方言群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical/linguistics) A group of early West Germanic peoples living around the North Sea coast; in linguistics, the name is also used for the North Sea Germanic dialect group (often linked with early ancestors of English, Frisian, and some Saxon varieties).","zh":"（历史/语言学）早期西日耳曼人的一支，主要分布在北海沿岸；在语言学中也用来指“北海日耳曼语支/方言群”，常与英语、弗里西语及部分撒克逊语的早期祖先相关。"},"examples":[{"en":"Some scholars connect Old English features with the Ingaevones (North Sea Germanic) area.","zh":"一些学者把古英语的某些特征与英加埃沃内斯（北海日耳曼）地区联系起来。"},{"en":"Roman writers mentioned the Ingaevones as peoples living near the ocean.","zh":"罗马作家提到英加埃沃内斯是生活在海边的族群。"}]}],"synonyms":["Ingvaeones","North Sea Germanic peoples","Ingvaeonic (in linguistics)"],"phonetic":"/ˌɪŋɡəˈvoʊniːz/","extraExplanation":["常见拼写变体是 **Ingvaeones**（更接近拉丁拼写），**Ingaevones** 也见于学术写作。","这个名称常被认为出自罗马史学家塔西佗（Tacitus）的记载，他把日耳曼人分成几大群体（如 Ingaevones / Istvaeones / Herminones）。这些分类带有古代作者的视角，未必等同于现代民族概念。","在语言学里提到 **Ingvaeonic / Ingvaeonic languages** 时，通常指“北海日耳曼”共同特征（例如某些鼻音前辅音变化等），常用于讨论早期英语与弗里西语的接近关系。"]}
{"word":"ingaevonic","summary":{"en":"Ingvaeonic refers to the North Sea-related subgrouping of West Germanic peoples/languages, often discussed in connection with Old English and related dialects.","zh":"Ingvaeonic（英格瓦翁语/北海日耳曼语）指与北海沿岸相关的西日耳曼部族/语言分支的学术称呼，常与古英语及其相关方言一起讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Ingvaeones (an early West Germanic tribal grouping mentioned by Roman writers) or to the North Sea branch of West Germanic languages traditionally associated with them.","zh":"与“英格瓦翁人”（罗马文献中记载的早期西日耳曼部族群）有关的；或指传统上与其相关的西日耳曼语“北海分支”（常称“北海日耳曼语”）的。"},"examples":[{"en":"Some linguists describe Old English as showing strong Ingvaeonic features.","zh":"一些语言学家认为古英语具有明显的英格瓦翁语（北海日耳曼语）特征。"},{"en":"Ingvaeonic is often discussed alongside terms like “North Sea Germanic.”","zh":"“Ingvaeonic（英格瓦翁语/北海日耳曼语）”常与“North Sea Germanic（北海日耳曼语）”等术语一起讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"The Ingvaeonic (North Sea Germanic) branch or group of West Germanic languages/dialects (a label used in historical linguistics).","zh":"英格瓦翁语（北海日耳曼语）：西日耳曼语中的一支/一组语言或方言（历史语言学中的标签）。"},"examples":[{"en":"In that course, we briefly compared Ingvaeonic with other West Germanic groupings.","zh":"在那门课里，我们简要比较了英格瓦翁语与其他西日耳曼语分组。"}]}],"synonyms":["North Sea Germanic","Ingvaeonic languages","Ingvaeonic dialects"],"phonetic":"/ˌɪŋ.viˈɑː.nɪk/","extraExplanation":["“Ingvaeonic”更常见的拼写是“Ingvaeonic”，你输入的“ingaevonic”可能是大小写或拼写变体。","在历史语言学里，这个术语常用来讨论北海沿岸相关方言（如与古英语、古弗里斯兰语、古撒克逊语等的联系）。它更像一种“学术分组标签”，不一定等同于一个单一、统一的语言。","有时会提到“英格瓦翁鼻音脱落（Ingvaeonic nasal spirant law）”等现象，用来解释某些词形变化（例如在特定音环境下鼻音的弱化或消失）。"]}
{"word":"ingallantry","summary":{"en":"“Ingallantry” means a lack of gallantry—behavior that is not courteous or chivalrous.","zh":"“Ingallantry”指缺乏殷勤或骑士风度，表现为不礼貌、不体贴的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of gallantry; ungentlemanly or unchivalrous behavior (especially toward women)","zh":"不够殷勤或不够骑士风度；不绅士、不体贴（尤指对女性）的行为"},"examples":[{"en":"His ingallantry shocked the guests—he refused to offer his seat to an older woman.","zh":"他的不绅士行为让宾客很震惊——他拒绝给一位年长女士让座。"},{"en":"The novel portrays the hero’s early ingallantry before he learns respect and courtesy.","zh":"这部小说描写了男主在学会尊重与礼貌之前，早期的不体贴与无礼。"}]}],"synonyms":["discourtesy","rudeness","ungentlemanliness","ungraciousness","incivility"],"phonetic":"/ˌɪnˈɡæləntri/","extraExplanation":["“ingallantry”比较少见，更多时候会用更常见的词来表达类似意思，比如“rudeness（粗鲁）”“discourtesy（无礼）”“ungraciousness（不够体面/不够有风度）”。\n\n它由前缀“in-（不、非）”+“gallantry（殷勤、勇敢、骑士风度）”构成，语气通常带有道德评价，常出现在较正式或带文学色彩的语境中。"]}
{"word":"ingan","summary":{"en":"“ingan” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“ingan”不是标准英语单词；多半是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is usually a misspelling or a name (proper noun).","zh":"不是标准英语单词；通常是拼写错误或人名/地名（专有名词）。"},"examples":[{"en":"“ingan” doesn’t appear in most English dictionaries—could you check the spelling?","zh":"“ingan”在大多数英语词典里查不到——你能确认一下拼写吗？"},{"en":"Did you mean “inane” (silly) or “ingenious” (clever)?","zh":"你是不是想写“inane”（愚蠢的）或“ingenious”（聪明的）？"}]}],"phonetic":"/ˈɪŋɡən/","extraExplanation":["“ingan”更像是拼写误差。你可以告诉我：1）你看到它的句子/上下文；2）你想表达的中文意思；或3）是否来自印尼语/其他语言。我就能更准确地给出对应的英文词。","常见可能想查的相近英文：\n- inane（adj. 愚蠢的、空洞的）\n- ingenious（adj. 有独创性的、机智的）\n- ingot（n. 金属锭）\n- in-game（adj. 游戏内的，常写作 in-game）"]}
{"word":"ingang","summary":{"en":"“Ingang” is a Dutch word meaning “entrance/entry,” not standard English.","zh":"“ingang”是荷兰语，意思是“入口/进入处”，不是标准英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word) In Dutch, “ingang” means an entrance or entry (often seen on signs).","zh":"（不是标准英语词）在荷兰语里，“ingang”指“入口、进入处”（常见于标志牌）。"},"examples":[{"en":"The sign said “Ingang,” so we knew where to enter the building.","zh":"标志上写着“Ingang”，所以我们知道从哪里进入大楼。"},{"en":"Please use the main ingang after 9 a.m.","zh":"请在上午9点后使用主入口（ingang）。"}]},{"partOfSpeech":"n.","definition":{"en":"An act of entering; entry (less common, more formal/abstract in Dutch contexts).","zh":"进入；入内（较少见，更偏正式/抽象的荷兰语用法）。"},"examples":[{"en":"Security checks happen before the ingang to the concert hall.","zh":"进入音乐厅前会进行安检。"}]}],"synonyms":["entrance","entry","entryway","doorway"],"phonetic":"/ˈɪn.ɡɑŋ/","extraExplanation":["“ingang”常见于荷兰、比利时（荷语区）公共场所的指示牌，意思就是“入口”。如果你在德语环境里看到类似的词，通常是“Eingang”（也是“入口”）。","在英文写作里一般不要用“ingang”，除非你在引用原文标识、地名/机构用语或在讨论荷兰语。英文对应最常用的是 entrance / entry / entryway。"]}
{"word":"ingangs","summary":{"en":"“ingangs” is not standard English; it’s usually Dutch/Afrikaans-related, meaning “(of) entrance/entry,” often in compounds.","zh":"“ingangs”不是标准英语词；通常与荷兰语/南非荷兰语有关，表示“入口/进入（相关）”，常见于复合词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often seen as a Dutch/Afrikaans form related to “ingang” meaning “entrance/entry,” especially as a part of compound words (like “ingangs- …”).","zh":"不是标准英语词。最常见于荷兰语/南非荷兰语中，与“ingang（入口/进入）”相关，常作为复合词的组成部分（如“ingangs- …”）。"},"examples":[{"en":"This doesn’t appear in English; in Dutch, you might see it in compounds like “ingangsdatum” (entry/start date).","zh":"这个词在英语里不常见；在荷兰语中，你可能会在“ingangsdatum”（生效日/开始日期）这类复合词里看到它。"},{"en":"Please use the main English word “entrance” if you mean the place you go in.","zh":"如果你想表达“入口（进门的地方）”，英语里请用“entrance”。"}]}],"synonyms":["entrance","entry","entryway"],"phonetic":"/ˈɪnˌɡɑŋs/","extraExplanation":["在荷兰语里，“ingang”=入口/进入；“ingangs-”常作为前缀出现在正式用语里，表示“与进入/生效有关”，例如：\n- ingangsdatum（生效日）\n- ingangscontrole（入口检查）\n你输入的“ingangs”可能是从这些复合词里截取出来的部分，或是拼写/输入法导致的形式。","如果你想查的是英语单词，请告诉我上下文句子，或确认你想查的是不是：\n- in gangs（分成帮派/成群结队）\n- ingang（荷兰语：入口）\n- earnings / engages 等相近拼写。"]}
{"word":"ingannation","summary":{"en":"“ingannation” is not a recognized English word; it’s probably a misspelling or a name.","zh":"“ingannation”不是被认可的英语单词；多半是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a typographical error, or a proper name (e.g., a username, brand, or place).","zh":"不是标准英语单词。很可能是拼写错误、打字错误，或是专有名词（如用户名、品牌名、地名）。"},"examples":[{"en":"I couldn’t find “ingannation” in an English dictionary—do you mean “indignation” or “imagination”?","zh":"我在英语词典里找不到“ingannation”——你是不是想写“indignation（愤慨）”或“imagination（想象力）”？"},{"en":"The essay says “ingannation,” but I think the correct word is “incarnation.”","zh":"文章里写的是“ingannation”，但我觉得正确的词可能是“incarnation（化身/体现）”。"}]}],"synonyms":["indignation","imagination","incarnation","ingratiation"],"phonetic":"/ˌɪŋɡæˈneɪʃən/","extraExplanation":["“ingannation”看起来像把某个常见英语词打错了。最接近、也最常被混淆的可能是：\n1) indignation /ˌɪn.dɪɡˈneɪ.ʃən/（愤慨、义愤）\n2) imagination /ɪˌmædʒ.əˈneɪ.ʃən/（想象力）\n3) incarnation /ˌɪn.kɑːrˈneɪ.ʃən/（化身；具体体现）\n如果你把原句（前后各一两句话）贴出来，我可以根据语境判断你真正要找的词。"]}
{"word":"ingate","summary":{"en":"Ingate (often written “in-gate”) means an entrance gate, and in logistics it can mean the recorded time an item enters a terminal.","zh":"ingate（常写作 in-gate）指入口闸门；在物流语境中也可指进入码头/堆场的入闸时间记录。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an entrance gate; a gate used for entering a place (such as a venue, stadium, or facility)","zh":"入口闸门；用于进入某处的门/闸口（如场馆、体育场或设施）"},"examples":[{"en":"Please show your ticket at the ingate.","zh":"请在入口闸口出示你的票。"},{"en":"The crowd moved quickly through the ingate when the doors opened.","zh":"开门后，人群很快从入口闸口涌入。"}]},{"partOfSpeech":"n.","definition":{"en":"(logistics/ports) the moment or record of a container or vehicle entering a terminal (“in-gate time”)","zh":"（物流/港口）集装箱或车辆进入码头/堆场的时间点或记录（入闸时间）"},"examples":[{"en":"The container’s in-gate time was 9:12 a.m.","zh":"该集装箱的入闸时间是上午9点12分。"},{"en":"You may be charged if you miss the terminal’s in-gate cutoff.","zh":"如果错过码头的入闸截止时间，你可能会被收费。"}]}],"synonyms":["entrance gate","entry gate","main gate","in-gate (hyphenated form)"],"phonetic":"/ˈɪnˌɡeɪt/","extraExplanation":["“ingate”在现代英语里不算常见，更常见的写法是带连字符的“in-gate”，尤其在港口物流、会展/场馆管理等行业语境中。","在普通日常对话里，人们更常说“entrance (gate)”“main gate”“entry gate”等。"]}
{"word":"ingates","summary":{"en":"“Ingates” is the plural of “ingate,” a casting channel/opening that guides molten metal into a mold cavity.","zh":"“Ingates”是“ingate（内浇口）”的复数，指铸造中引导熔融金属进入型腔的通道或开口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In metal casting, an opening or channel in the mold that lets molten metal flow into the mold cavity (also written “in-gate”).","zh":"（金属铸造中）浇口/内浇口：模具中让熔融金属流入型腔的开口或通道（也写作 in-gate）。"},"examples":[{"en":"The engineer adjusted the ingates to reduce air bubbles in the casting.","zh":"工程师调整了内浇口，以减少铸件中的气泡。"},{"en":"If the ingate is too small, the mold may not fill completely.","zh":"如果内浇口太小，型腔可能无法完全充满。"}]}],"synonyms":["in-gates","gates (casting)","ingate openings"],"phonetic":"/ˈɪnˌɡeɪts/","extraExplanation":["“ingate / in-gate”属于制造业与材料工程领域的专业词汇，日常英语中很少用到。常见相关部件还包括 sprue（直浇道）、runner（横浇道）等。","你输入的“ingates”多半是复数形式（多个浇口），或是把“in gates”连写了。如果你原本想查的是人名/地名（如 Ingates 作为姓氏）或短语，请告诉我具体语境，我可以按正确词条解释。"]}
{"word":"ingather","summary":{"en":"Ingather means to gather or bring things/people in together, sometimes in a literary sense of harvesting crops.","zh":"Ingather 指把人或物“收拢、聚集到一起”，也可较文学地表示“收割入仓”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to gather or collect people or things into one place; to bring in (often for safekeeping or harvest)","zh":"把人或物聚集到一起；收拢、收集（常指为安全或收获而“收进来”）"},"examples":[{"en":"As the storm approached, the shepherd ingathered the sheep into the barn.","zh":"暴风雨临近时，牧羊人把羊群赶进谷仓里。"},{"en":"The volunteers ingathered donations from around the neighborhood.","zh":"志愿者从社区各处收集捐款。"}]},{"partOfSpeech":"v.","definition":{"en":"to harvest or bring in crops (a less common, more literary use)","zh":"收割、把庄稼收进来（较少见、偏文学/书面用法）"},"examples":[{"en":"By late autumn, farmers had ingathered the last of the wheat.","zh":"到深秋时，农民已把最后一批小麦收割入仓。"}]}],"synonyms":["gather","collect","round up","bring in","gather up"],"phonetic":"/ˌɪnˈɡæðɚ/","extraExplanation":["“ingather”由 in-（向内）+ gather（聚集/收集）构成，语感上比 gather 更强调“收拢到里面、集中起来”。在现代英语中更常见的是动词短语 bring in / gather up / collect。","相关名词形式有 ingathering（聚集；收获；也可指宗教语境中的“聚拢、归聚”）。在《圣经》或宗教文字里，有时会用到“ingathering（of exiles）”来表达“流亡者归回/归聚”的概念。"]}
{"word":"ingathered","summary":{"en":"“Ingathered” means gathered/collected together, especially a harvest brought in; it’s also the past form of “ingather.”","zh":"“ingathered”指被收拢、聚集在一起的（尤指庄稼收割后入仓）；也可作动词“ingather”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of crops, people, or things) gathered or collected together; brought in, especially for storage or safety.","zh":"（作物、人或物）被收拢、聚集在一起的；（尤指）收割后入仓的、收集起来以保存或确保安全的。"},"examples":[{"en":"By late October, most of the wheat was ingathered and stored in the barn.","zh":"到十月下旬，大部分小麦都已收割入仓，储存在谷仓里。"},{"en":"The letters were ingathered from different archives and published as a single volume.","zh":"这些信件从不同档案馆汇集起来，最终结集出版。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “ingather”: to gather in; to collect, especially a harvest.","zh":"“ingather”的过去式/过去分词：收拢；收集；（尤指）收割并把庄稼运入仓内。"},"examples":[{"en":"They ingathered the apples before the first frost.","zh":"他们在第一次霜冻前把苹果都采收归拢了。"},{"en":"Funds were ingathered from small donations across the community.","zh":"资金通过社区各处的小额捐款汇集起来。"}]}],"synonyms":["gathered","collected","harvested","assembled","rounded up"],"phonetic":"/ˌɪnˈɡæðərd/","extraExplanation":["“Ingather(ed)”在现代日常英语中不算常用，更常见的说法是“gathered/collected/harvested”。但它在宗教或文学语境里更常出现，带有一种“归拢、汇聚、收成已入库”的庄重色彩。","相关文化用法：在《圣经》语境中常见“ingathering（招聚/归回）”，例如“the ingathering of the exiles”（流亡者的归聚/归回），指人群被召回、聚集。"]}
{"word":"ingatherer","summary":{"en":"An ingatherer is a person who gathers in things, especially crops; in literary/religious use, it can mean someone who brings people together.","zh":"ingatherer 指“收拢、收集的人”，常指收割庄稼的人；在文学/宗教用法中也可指使人归聚、召集的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who gathers things in (especially crops at harvest time); a collector.","zh":"收割者；采集者；（尤指）在收获季节把庄稼收拢的人；收集者。"},"examples":[{"en":"During harvest, ingatherers moved through the fields from dawn to dusk.","zh":"在收获季节，收割者从黎明到黄昏穿行在田野里。"},{"en":"The museum hired an ingatherer to collect oral histories from the community.","zh":"博物馆雇了一位采集者来收集社区的口述历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary or religious) someone who brings people or things together; one who “gathers in” spiritually or socially.","zh":"（文学或宗教用语）召集者；使人或事物归聚的人；（引申）把人“带回”信仰或群体的人。"},"examples":[{"en":"In the poem, the rain is an ingatherer, drawing every sound back to the earth.","zh":"在这首诗里，雨像召集者，把一切声音都拉回大地。"},{"en":"Some sermons describe mercy as an ingatherer that brings the lost home.","zh":"有些布道把怜悯描写成“召回者”，把迷失的人带回家。"}]}],"synonyms":["harvester","gatherer","collector","reaper"],"phonetic":"/ˈɪnˌɡæðərɚ/","extraExplanation":["“Ingatherer”由 in-（进入、收拢）+ gather（聚集、收集）+ -er（做某事的人）构成，整体意思就是“把东西收拢起来的人”。","在宗教语境中，它有时与 “the ingathering” （归聚、聚集）相关联，尤其在《圣经》或带有圣经色彩的英文写作里，常用来表达“把人召回/聚集”的象征意义。"]}
{"word":"ingathering","summary":{"en":"Ingathering means collecting things in, especially a harvest, and it can also refer to a religious idea of harvest or people being gathered together.","zh":"Ingathering 指“收拢、收集进来”（尤指收获），也可指宗教语境中的“丰收/聚集归入”的概念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of gathering things in (especially a harvest); also, the collected result","zh":"（尤指收获季）把东西收拢、收集进来的过程；也可指收集到的成果"},"examples":[{"en":"The ingathering of apples began in early September.","zh":"九月初开始采收苹果。"},{"en":"After the storm, the volunteers helped with the ingathering of supplies.","zh":"暴风雨过后，志愿者帮助把物资集中收拢起来。"}]},{"partOfSpeech":"n.","definition":{"en":"a religious season or festival celebrating a harvest or spiritual “gathering in,” especially in Judaism","zh":"（宗教用语）庆祝丰收或“聚拢归入”的节期/节庆，尤指犹太传统中的相关节期"},"examples":[{"en":"In some translations, Sukkot is linked to the idea of an ingathering at the end of the harvest.","zh":"在一些译本中，住棚节（Sukkot）与“收成结束时的聚拢/收获”这一概念相关。"},{"en":"The reading described an ingathering of people from many places.","zh":"诵读内容描写了来自各地人群的聚集归来。"}]}],"synonyms":["harvest","gathering","collection","bringing in"],"phonetic":"/ˈɪnˌɡæðərɪŋ/","extraExplanation":["词形上，ingathering = in-（进入、向内）+ gathering（收集、聚集）。在现代英语里它不算高频词，常见于较正式或文学性的语境（如描写秋收、宗教节期、或象征性的“把人/资源聚拢起来”）。","宗教语境里，常见搭配是 the Ingathering（首字母大写）或 ingathering of the exiles，指“流亡者归回/回归故土”的观念，在犹太文化与相关文本讨论中较常见。"]}
{"word":"ingathers","summary":{"en":"“In gathers” means fabric is pulled together into small folds (gathered/ruched), especially in sewing and clothing.","zh":"“in gathers” 指布料被抽紧形成细小的褶皱（抽褶/打褶），多用于缝纫与服装描述。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"in small folds or wrinkles made by pulling fabric together (common in sewing and clothing descriptions)","zh":"（布料）打褶的；抽褶成皱的（常用于缝纫与服装描述）"},"examples":[{"en":"The skirt falls in gathers at the waist.","zh":"这条裙子在腰部有抽褶垂下来。"},{"en":"She stitched the fabric so it lay in gathers along the seam.","zh":"她把布料缝好，让它沿着接缝形成褶皱。"}]}],"synonyms":["gathered","in pleats (similar, but pleats are usually pressed/structured)","ruched"],"phonetic":"/ɪn ˈɡæðɚz/","extraExplanation":["你输入的 **“ingathers”** 多半是把 **“in gathers”** 写在一起了；英语里通常分开写：**in gathers**。","在服装/家纺语境中，**gathers** 指“用线抽紧形成的一圈圈小褶（抽褶）”。常见搭配：**gathered skirt/dress**（抽褶裙/连衣裙）、**gather at the waist**（腰部抽褶）、**gathering thread**（抽褶线）。","如果你本来想查动词 **gather**（收集、聚集），告诉我句子或上下文，我也可以按那个词义解释。"]}
{"word":"inge","summary":{"en":"“Inge” is mainly used as a personal name (common in Germanic/Scandinavian contexts), not a common everyday English word.","zh":"“Inge”主要用作人名（常见于德语/北欧文化圈），不是常见的日常英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually a woman’s name) used in Germanic and Scandinavian cultures.","zh":"一个人名（多为女性名），常见于德语及北欧（日耳曼语族）文化圈。"},"examples":[{"en":"Inge is a common name in Sweden and Germany.","zh":"Inge 在瑞典和德国是比较常见的名字。"},{"en":"I met a designer named Inge at the conference.","zh":"我在会议上认识了一位叫 Inge 的设计师。"}]}],"synonyms":["(proper name)"],"phonetic":"/ˈɪŋɡə/","extraExplanation":["“Inge”在英语里主要作为人名使用，并不是常见的普通词汇。如果你想查的是拼写相近的常用词，可能是：\n- hinge（铰链；关键点）\n- tinge（淡淡的颜色/感觉）\n- singe（轻微烧焦）\n- binge（放纵；狂欢式做某事）\n- cringe（畏缩；尴尬难堪）\n你可以告诉我你想表达的句子，我可以帮你确定正确的词。"]}
{"word":"ingeldable","summary":{"en":"“ingeldable” is not standard; it most likely means “ineligible” (not qualified/allowed).","zh":"“ingeldable” 不是标准用词；很可能想表达 “ineligible”（不符合条件/没有资格）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of “ineligible.”","zh":"不是标准英语单词；很可能是把 “ineligible” 拼错了。"},"examples":[{"en":"I couldn’t find “ingeldable” in a dictionary—did you mean “ineligible”?","zh":"我在词典里找不到 “ingeldable”——你是不是想写 “ineligible”？"},{"en":"If you are under 18, you may be ineligible to vote.","zh":"如果你未满18岁，你可能没有投票资格。"}]},{"partOfSpeech":"adj.","definition":{"en":"(If you meant “ineligible”) not allowed or not qualified to do something; not meeting the requirements.","zh":"（如果你想写的是 “ineligible”）不符合条件的；没有资格的；不被允许的。"},"examples":[{"en":"He is ineligible for the scholarship because his grades are too low.","zh":"他的成绩太低，所以不符合申请奖学金的条件。"},{"en":"This discount is for members only; non-members are ineligible.","zh":"这个折扣只给会员；非会员不适用。"},{"en":"Applicants become ineligible if they submit the form after the deadline.","zh":"如果申请人在截止日期后提交表格，就会失去资格。"}]}],"synonyms":["disqualified","unqualified","not eligible","excluded"],"phonetic":"/ˌɪnˈɛlɪdʒəbəl/","extraExplanation":["“ingeldable” 很可能是把 **ineligible**（没有资格的）拼错了：常见拼写是 *ineligible*，而不是 *ingeldable*。","记忆小提示：*in-*（不）+ *eligible*（有资格的）→ *ineligible*（没资格的）。","如果你想表达“可以吃的/可入口的”，更常见的词是 **edible** 或 **ingestible**（较正式）。"]}
{"word":"ingem","summary":{"en":"“ingem” is not a common English word; it’s likely a typo or an incomplete form.","zh":"“ingem”不是常见英语词，更可能是拼写错误或未写完整。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It is most likely a typo or incomplete form (for example, you may have meant “ingeminate” or “gem”).","zh":"“ingem”不是常见词典中的标准英语单词，更可能是拼写错误或未写完整（例如你可能想写“ingeminate”或“gem”）。"},"examples":[{"en":"I can’t find “ingem” in standard English dictionaries—did you mean “gem” or “ingeminate”?","zh":"我在常见英语词典里找不到“ingem”，你是不是想写“gem”或“ingeminate”？"},{"en":"Please share the full sentence with “ingem” so I can infer the intended word.","zh":"请把包含“ingem”的完整句子发我，我可以帮你推断你想表达的词。"}]}],"phonetic":"/ˈɪn.dʒɛm/","extraExplanation":["如果你想表达“重复强调（某句话/观点）”，可能是想用 **ingeminate**（较少见，意为“反复重申、再三强调”）。\n如果你想表达“宝石”，那通常用 **gem**。\n也有可能你看到的是人名/姓氏/品牌名（专有名词），这种情况下需要上下文（句子、来源、国家/领域）才能确定含义。"]}
{"word":"Ingemar","summary":{"en":"a Swedish male given name","zh":"瑞典常见的男性名字"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name, most commonly Swedish (a variant of Ingmar).","zh":"男性名字，最常见于瑞典（常被视为 Ingmar 的变体）。"},"examples":[{"en":"Ingemar moved to the U.S. for graduate school.","zh":"Ingemar 为了读研究生搬去了美国。"},{"en":"Have you met Ingemar? He’s on our design team.","zh":"你见过 Ingemar 吗？他在我们设计团队。"}]}],"synonyms":["Ingmar"],"phonetic":"/ˈɪŋɡəˌmɑr/","extraExplanation":["这是专有名词（人名）。在英文语境里通常按原名拼写使用，不翻译；如果需要中文，可音译为“英厄马尔/英格马尔”等，但具体译法会因地区与个人偏好不同。"],"etymology":"源自北欧日耳曼语系的人名传统：常分析为以北欧神名/祖先名元素“Ing-”（与古北欧、古日耳曼文化中的 Ing/Yngvi 相关）+ “-mar”（常见于人名结尾，含“著名/有名”之意）。在瑞典语中常见拼写包括 Ingemar 与 Ingmar。","mnemonic":["把它联想成“Ing + (ge)mar”：看到结尾 -mar，想到很多北欧名字里常出现的结尾（像“有名的人”）。","容易与拼写 Ingmar 混淆：记成 Inge- 多一个 e，更常见于 Ingemar。"]}
{"word":"ingeminate","summary":{"en":"Ingeminate means to repeat or restate something many times, often for emphasis.","zh":"Ingeminate 指反复重复或重申某事，常用于强调。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to repeat (something) again and again; to restate for emphasis","zh":"反复说（或做）某事；一再重申以加强语气"},"examples":[{"en":"The coach ingeminated the same advice: focus on the basics.","zh":"教练反复强调同一句建议：专注基础。"},{"en":"She ingeminated her warning until everyone took it seriously.","zh":"她一再重申警告，直到大家都认真对待。"}]}],"synonyms":["repeat","reiterate","restress","emphasize","underscore"],"phonetic":"/ɪnˈdʒɛm.ə.neɪt/","extraExplanation":["“Ingeminate”是比较罕见、偏书面或古典色彩的词，常用于强调“反复重申”。日常英语里更常用的替代说法有：repeat, reiterate, emphasize, stress（如：He reiterated his point. / She stressed the importance of safety.）。","词源来自拉丁语 in-（加强）+ geminare（使成双、重复），所以带有“再来一次、重复加倍”的感觉。在文学或演讲语境中用它，会显得更正式、修辞感更强。"]}
{"word":"ingeminated","summary":{"en":"“Ingeminated” means repeated again and again, especially for emphasis (a literary/formal word).","zh":"“ingeminated”指反复出现或一再强调的（偏文学/正式用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Repeated or said again and again; reiterated (often in literary or formal writing).","zh":"反复的；一再重申的（常见于文学或较正式的表达）。"},"examples":[{"en":"Her ingeminated warnings finally made everyone take the storm seriously.","zh":"她一再重申的警告终于让大家认真对待这场风暴。"},{"en":"The poem’s ingeminated refrain creates a steady, chanting rhythm.","zh":"这首诗反复出现的叠句营造出稳定、吟诵般的节奏。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “ingeminate”: to repeat or restate for emphasis.","zh":"“ingeminate”的过去分词：为强调而重复、重申。"},"examples":[{"en":"The speaker ingeminated the key point to ensure it was understood.","zh":"演讲者反复强调关键点，以确保大家理解。"}]}],"synonyms":["reiterated","repeated","restated","emphasized","doubled"],"phonetic":"/ɪnˈdʒɛm.əˌneɪ.tɪd/","extraExplanation":["“ingeminated / ingeminate”较少用于日常口语，更常见于文学、演讲评论或学术写作中，用来表达“反复强调”的修辞效果。","词源来自拉丁语 in-（加强）+ geminus（双重的、成对的），因此带有“加倍、重复”的意味。"]}
{"word":"ingeminating","summary":{"en":"“Ingeminating” means repeating or reiterating something, often to emphasize it.","zh":"“ingeminating”表示反复重复或重申（常用于强调）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “ingeminate”) repeating something again and again; reiterating for emphasis.","zh":"（“ingeminate”的现在分词）反复重复某事；为了强调而一再重申。"},"examples":[{"en":"The coach kept ingeminating the same instruction: “Keep your eyes on the ball.”","zh":"教练不断重复同一句指令：“眼睛盯住球。”"},{"en":"She spoke calmly, ingeminating her reasons until everyone understood.","zh":"她语气平静地反复说明自己的理由，直到大家都明白。"}]}],"synonyms":["repeating","reiterating","restating","emphasizing","stressing"],"phonetic":"/ɪnˈdʒɛmɪneɪtɪŋ/","extraExplanation":["“Ingeminating”是比较少见、偏文学或正式的用法。更常见的替代表达有：repeating, reiterating, emphasizing, stressing。","词源上与拉丁语“geminus（成双的）”有关，带有“再来一次/重复一遍”的含义；因此常用于强调某句话或观点被刻意重复。"]}
{"word":"ingemination","summary":{"en":"Ingemination means repeating words or ideas—especially in speech or writing—to emphasize a point.","zh":"Ingemination 指在讲话或写作中通过重复词语或观点来强调重点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric, formal) The act of repeating a word, phrase, or idea for emphasis; repeated saying.","zh":"（修辞/正式用语）为强调而重复某个词、短语或观点；反复说。"},"examples":[{"en":"The speaker used ingemination—“We will not give up, we will not give up”—to strengthen the message.","zh":"演讲者用了 ingemination（反复强调）——“我们不会放弃，我们不会放弃”——来加强信息。"},{"en":"In poetry, ingemination can create a strong rhythm and emotional intensity.","zh":"在诗歌中，ingemination 能制造强烈的节奏感和情绪张力。"}]}],"synonyms":["repetition","reiteration","recurrence","emphasis","anaphora (related)","epizeuxis (related)"],"phonetic":"/ɪnˌdʒɛmɪˈneɪʃən/","extraExplanation":["这是一个偏文学/修辞学的词，日常英语里更常用 repetition（重复）、reiteration（反复强调）、repeating for emphasis（为了强调而重复）。","常见的相关修辞术语：anaphora（首语重复：连续句子开头重复）、epizeuxis（紧接重复：同一词立刻重复，如“Never, never!”）、refrain（叠句/副歌）。ingemination 常可作为“重复强调”的较宽泛说法。"]}
{"word":"ingender","summary":{"en":"Engender means to cause or produce something, especially a feeling or situation.","zh":"Engender 指“引起、造成、使产生”，尤用于引发某种情绪或局面。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cause something to exist or happen; to produce or create (especially a feeling, situation, or condition)","zh":"使产生；引起；造成（尤指情绪、局面或状况）"},"examples":[{"en":"The new policy engendered a lot of debate among employees.","zh":"新政策在员工中引发了大量讨论。"},{"en":"Fear can engender hatred if it is not addressed.","zh":"如果不去正视，恐惧可能会滋生仇恨。"},{"en":"Her kindness engendered trust in the team.","zh":"她的善意在团队中建立了信任。"}]}],"synonyms":["cause","create","produce","generate","give rise to","bring about"],"phonetic":"/ɛnˈdʒɛndɚ/","extraExplanation":["你输入的“ingender”更常见是拼写误差，标准拼写通常为 **engender**。","**engender** 常用于较正式的书面语（新闻、论文、演讲），语气比 *cause* 更正式；搭配上常见：engender **fear / trust / conflict / resentment / sympathy / change**。","词源来自法语/拉丁语，和“生成、产生（to generate）”的概念接近。文学和评论写作里常用来描述“某种因素导致某种情绪或社会效果”。"]}
{"word":"ingene","summary":{"en":"“Ingene” is usually a misspelling of “ingenue”: an innocent young woman character (or someone who seems naïve).","zh":"“ingene”通常是“ingenue”的误拼：指戏剧/影视中的天真少女角色，或看起来很单纯的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “ingenue”) a young, innocent, and often inexperienced woman character in a play, movie, or story; by extension, a real person who seems sweet and naïve.","zh":"（通常拼作 ingenue）戏剧、电影或小说中的“天真少女/纯真女主”类型角色；引申指现实中显得单纯、天真的年轻女性。"},"examples":[{"en":"She was cast as the ingenue in the romantic comedy.","zh":"她在那部浪漫喜剧里被选为“天真少女”类型的角色。"},{"en":"The novel begins with an ingenue who slowly learns how the city works.","zh":"小说以一位天真少女开场，她逐渐学会城市的生存规则。"},{"en":"He tried to present her as an ingenue, but she was much more capable than that.","zh":"他想把她塑造成“傻白甜”，但她其实更能干。"}]}],"synonyms":["naive young woman","innocent","naif","girl-next-door (type)"],"phonetic":"/ˈænʒənuː/","extraExplanation":["你输入的“ingene”不是常见英文拼写，通常是法语借词“ingenue”（英式常写 ingénue）。“-en-”和“-eu-”的拼写容易写错。","词源来自法语 ingénu/ingénue，原意接近“天真、未被世故污染”。在英语里多用于舞台剧、电影、文学的“角色类型”（archetype）。","语体提示：在现代语境里用来形容真人时，可能带有轻微“把人看扁/过度天真”的意味；写作时注意语气与场合。"]}
{"word":"ingenerability","summary":{"en":"Ingenerability is a rare noun meaning either ‘cannot be generated/produced’ or (archaically) ‘innate, inborn nature.’","zh":"ingenerability 是个罕见名词，常指“不可生成/不可产生”，古语中也可指“先天性、与生俱来”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The quality of being unable to be generated, produced, or brought into existence.","zh":"（罕见）指无法被生成、产生或使其出现的性质；不可生成性。"},"examples":[{"en":"Some philosophers argued that certain truths have a kind of ingenerability—they do not come from experience.","zh":"一些哲学家认为某些真理具有一种“不可生成性”——它们并非来自经验。"},{"en":"In older scientific writing, the term was used to contrast what can be produced in a lab with what has ingenerability.","zh":"在较早的科学写作中，这个词用来对比“能在实验室里制造出来的东西”和“具有不可生成性的东西”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare/archaic) The quality of being inborn or innate; something naturally implanted rather than acquired.","zh":"（极罕见/古语）指天生的、与生俱来的性质；先天性。"},"examples":[{"en":"The author treated virtue as an ingenerability of the soul, not a skill learned later.","zh":"作者把美德看作灵魂的先天属性，而不是后天学来的技能。"}]}],"synonyms":["uncreatability","non-generation","innateness","inbornness"],"phonetic":"/ˌɪnˌdʒɛnərˈæbəlɪti/","extraExplanation":["这个词在现代英语里几乎不用，更多见于旧式哲学/神学/早期科学语境。日常表达更常用：uncreatability（不可被创造）、non-generation（不生成）、innateness（先天性）。","拼写上容易让学习者联想到 generate（生成）或 ingenuous/ingenuity（天真/巧思），但它并不是常见词汇；写作时若追求清晰，建议改用更常见的替代词。"]}
{"word":"ingenerable","summary":{"en":"Ingenerable is a rare adjective meaning “innate/inborn,” and more rarely “not able to be generated or produced.”","zh":"Ingenerable 是个罕见形容词，常指“天生的/先天的”，更罕见时指“无法生成或产生的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Innate; inborn; existing naturally in a person or thing rather than learned or acquired.","zh":"（罕见）天生的；先天的；并非后天习得或获得，而是自然存在于人或事物之中的。"},"examples":[{"en":"She had an ingenerable sense of rhythm, even before any formal lessons.","zh":"她在接受任何正规训练之前就有一种天生的节奏感。"},{"en":"Some writers spoke of ingenerable virtues—qualities a person seems born with.","zh":"有些作家会谈到“天生的美德”——仿佛一个人出生就带着的品质。"}]},{"partOfSpeech":"adj.","definition":{"en":"(very rare) Not able to be generated or produced; incapable of being created through ordinary processes.","zh":"（极罕见）无法生成或产生的；不能通过常规过程被制造出来的。"},"examples":[{"en":"In that old text, the author calls the substance ingenerable, meaning it cannot be produced by nature’s usual methods.","zh":"在那篇旧文本中，作者称这种物质为“ingenerable”，意思是它不能用自然的常规方式产生。"}]}],"synonyms":["innate","inborn","inherent","natural"],"phonetic":"/ɪnˈdʒɛnərəbəl/","extraExplanation":["“ingenerable”在现代英语中非常少见，多出现在较旧的文学/哲学语境里。日常表达中，表示“天生的”更常用 innate / inborn / inherent。","它也容易被误读或拼写混淆为 ingenious（有创造力的）或 ingenuous（天真坦率的）。如果你是在写作或考试中遇到该词，建议先确认上下文或原文拼写。"]}
{"word":"ingenerably","summary":{"en":"“ingenerably” is not standard English; you probably meant “generally” or “invariably.”","zh":"“ingenerably”不是规范英语；你可能想写“generally（通常）”或“invariably（总是）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/incorrect spelling. “ingenerably” is not a recognized word in modern English; it is usually a misspelling or typo.","zh":"非标准/错误拼写。“ingenerably”在现代英语中不是规范词，通常是拼写错误或打字错误。"},"examples":[{"en":"I couldn’t find “ingenerably” in a dictionary—did you mean “generally” or “invariably”?","zh":"我在词典里找不到“ingenerably”——你是不是想写“generally（通常）”或“invariably（总是）”？“"}]},{"partOfSpeech":"adv.","definition":{"en":"Most likely intended meaning: “generally” (usually; in most cases).","zh":"最可能的本意：generally（通常；大体上；在大多数情况下）。"},"examples":[{"en":"People generally prefer clear instructions.","zh":"人们通常更喜欢清晰的指示。"},{"en":"I generally take the subway to work.","zh":"我通常坐地铁上班。"}]},{"partOfSpeech":"adv.","definition":{"en":"Another possible intended meaning: “invariably” (always; without exception).","zh":"另一个可能的本意：invariably（总是；无一例外）。"},"examples":[{"en":"She invariably arrives five minutes early.","zh":"她总是提前五分钟到。"},{"en":"Bad data will invariably lead to bad results.","zh":"糟糕的数据必然会导致糟糕的结果。"}]}],"synonyms":["generally","invariably","usually","typically"],"phonetic":"/ɪnˈdʒɛnərəbli/","extraExplanation":["从拼写结构看，你写的“ingenerably”很像把“generally（通常）”或“invariably（总是）”拼错了；也有人会把“ingeniously（巧妙地）”误写成类似形式。","如果你把原句贴出来，我可以根据语境判断你最想表达的是“通常/大体上”（generally）还是“总是/必然”（invariably），并帮你改成自然的英文表达。"]}
{"word":"ingenerate","summary":{"en":"“Ingenerate” (archaic/literary) means “innate; inborn; natural from the start.”","zh":"“ingenerate”（较古旧/文学用语）意思是“先天的；与生俱来的；天生的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Inborn; natural; existing from the start (often describing a quality, feeling, or tendency).","zh":"天生的；先天的；与生俱来的（常形容品质、情感或倾向）。"},"examples":[{"en":"She had an ingenerate kindness that made people feel safe around her.","zh":"她有一种与生俱来的善良，让人待在她身边就感到安心。"},{"en":"The writer describes an ingenerate fear that cannot be explained by experience alone.","zh":"作者描写了一种无法仅用经历解释的天生恐惧。"}]}],"synonyms":["innate","inborn","inherent","natural","inbred","native"],"phonetic":"/ɪnˈdʒɛnərət/","extraExplanation":["“ingenerate”较为古旧/文学用语，现代英语中更常用：innate, inborn, inherent, natural。","词形上可理解为 in-（在……之内）+ generate（产生），强调“从内部自然而然产生、非后天形成”。在莎士比亚等早期英语作品或仿古文体中偶尔会见到。"]}
{"word":"ingenerated","summary":{"en":"“Ingenerated” is a rare formal word meaning “innate/inborn” or “formed from within.”","zh":"“ingenerated”是很少见的正式用词，意思是“天生的/与生俱来的”或“在内部形成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) Existing naturally in someone or something from birth; innate; inborn.","zh":"（罕见/正式）与生俱来的；天生的；固有的。"},"examples":[{"en":"Fear of loud noises can be partly ingenerated in humans.","zh":"对巨大声响的恐惧在人类身上可能部分是与生俱来的。"},{"en":"She believed kindness was ingenerated, not taught.","zh":"她认为善良是天生的，不是教出来的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) Produced within; formed or developed inside something rather than added from outside.","zh":"（罕见/正式）在内部产生的；由内形成的（而非外部加入的）。"},"examples":[{"en":"The writer speaks of ingenerated heat within the body.","zh":"作者谈到身体内部生成的热量。"}]}],"synonyms":["innate","inborn","inherent","inbred (not always the same meaning)","intrinsic"],"phonetic":"/ɪnˈdʒɛnəˌreɪtɪd/","extraExplanation":["“ingenerated”在现代英语里非常少见，更常见的是“innate / inborn / inbred（语义不同，需谨慎）”。如果你在旧文学或哲学/神学文本中看到它，通常是在说某种品质或倾向“本来就存在”。","词源上与拉丁语“generare（产生、生成）”有关，前缀“in-”有“在……之内”的意思，所以可理解为“在内部生成的 / 天生的”。","有时你会看到更常用的形态“ingenerate”（形容词），意思与这里类似：与生俱来或内在生成。"]}
{"word":"ingenerately","summary":{"en":"“Ingenerately” means “innately; inherently,” and it is rare/archaic in modern English.","zh":"“ingenerately”意为“天生地；本质上地”，在现代英语中较罕见、偏古语。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an innate or inborn way; naturally; inherently (rare or archaic).","zh":"以天生的方式；与生俱来地；本质上地（较罕见或古语）。"},"examples":[{"en":"Some people seem ingenerately curious, always asking questions about how things work.","zh":"有些人似乎天生就很有好奇心，总是在问事物是如何运作的。"},{"en":"He believed virtue was ingenerately present in every child, needing only good guidance.","zh":"他相信美德在每个孩子身上与生俱来，只需要良好的引导。"}]}],"synonyms":["innately","inherently","naturally","by nature"],"phonetic":"/ɪnˈdʒɛnərətli/","extraExplanation":["“ingenerately”源自形容词“ingenerate”（意为“天生的、固有的”），在现代英语中非常少见。日常写作里更常用的替代词是“innately / inherently / naturally”。","在文学或较古典的语境中，它有时用来强调“不是后天学来的，而是本性如此”。"]}
{"word":"ingenerating","summary":{"en":"“Ingenerating” isn’t standard English; you likely mean “generating” (producing/creating) or the phrase “in generating” (during the process of generating).","zh":"“ingenerating”不是标准英语；你多半想写“generating”（生成/产生）或短语“in generating”（在生成过程中）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard word) Often a misspelling or accidental merging of “in generating” or “generating.” If you mean the action of producing/creating something, use “generating.”","zh":"（不是标准英语单词）常见于把 “in generating”（在生成过程中）或 “generating”（生成、产生）误拼/连写在一起。若你想表达“产生/生成某物的动作”，通常用 “generating”。"},"examples":[{"en":"I think you meant “generating,” not “ingenerating.”","zh":"我觉得你想写的是“generating”，不是“ingenerating”。"},{"en":"In generating the report, the system combines data from three sources.","zh":"在生成报告的过程中，系统会把三个来源的数据合并起来。"}]},{"partOfSpeech":"v.","definition":{"en":"producing or creating something; causing something to exist (present participle/gerund of “generate”).","zh":"产生、生成、制造（“generate”的现在分词/动名词形式）。"},"examples":[{"en":"The company is generating new ideas for the product.","zh":"这家公司正在为产品产生新的想法。"},{"en":"Generating electricity from wind is becoming more common.","zh":"用风来发电（产生电力）越来越常见。"},{"en":"The discussion is generating a lot of interest.","zh":"这场讨论正在引起（产生）很多关注。"}]}],"synonyms":["producing","creating","making","forming","causing","bringing about"],"phonetic":"ˈdʒɛnəˌreɪtɪŋ","extraExplanation":["“ingenerating”在英语里通常不被当作一个独立单词使用，最常见情况是：\n1）把短语“in generating …”（在生成/产生……时）连写了；\n2）把“generating”前面多打了一个“in-”。\n如果你把它贴到句子里，我可以帮你判断应该改成“generating”还是“in generating”。"]}
{"word":"ingeneration","summary":{"en":"“Ingeneration” is a rare term meaning the process of producing/creating; in modern English it’s often better replaced by “generation” or “the generation of …,” and sometimes it’s a mistaken form of “in/within a generation.”","zh":"“ingeneration”较罕见，可指“生成/产生的过程”；现代英语中更常用“generation”或“the generation of …”，有时它只是把“in/within a generation（在一代人之内）”误写成一个词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) the act or process of generating or producing something; creation/formation.","zh":"（罕见/技术用语）生成或产生某物的行为或过程；创造/形成。"},"examples":[{"en":"Some older scientific texts discuss the ingeneration of heat during chemical reactions.","zh":"一些较早的科学文献会讨论化学反应过程中热量的生成。"},{"en":"The theory tried to explain the ingeneration of ideas in the mind.","zh":"该理论试图解释观念在头脑中的生成。"}]},{"partOfSpeech":"other","definition":{"en":"(Nonstandard in modern English) Often a misspelling or mistaken single-word form of the phrase “in generation,” meaning “within a generation” or “during a generation.”","zh":"（现代英语中不规范）常见于把短语“in generation”（意为“在一代人之内/在某一代期间”）误写成一个词。"},"examples":[{"en":"In modern writing, it’s clearer to say “within a generation” rather than “in generation.”","zh":"在现代写作中，用“within a generation”比“in generation”更清晰。"},{"en":"Technology can change dramatically within a generation.","zh":"科技在一代人之内可能发生巨变。"}]}],"synonyms":["generation","creation","formation","production"],"phonetic":"/ˌɪnˌdʒɛnəˈreɪʃən/","extraExplanation":["“ingeneration”在当代英语里非常少见，读者可能会把它当作拼写错误或过时用法。写作时更常用：generation（名词，一代；产生）、generation of + 名词（……的产生/生成）、within a generation（在一代人之内）、regeneration（再生/重建）。","如果你是在生物学语境里想表达“（组织）再生”，通常用 regeneration；如果是想表达“产生/生成（热、能量、想法等）”，更自然的表达是 the generation of heat/energy/ideas。"]}
{"word":"ingenerative","summary":{"en":"Ingenerative means “not generating/producing,” and in rare biological use, “not reproductive.”","zh":"ingenerative 指“不能生成/产生的”；在较少见的生物学用法中指“不能繁殖的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not producing, creating, or generating; lacking the power to generate (often used in technical or older writing).","zh":"不产生的；不具生成能力的（常见于技术性或较旧的用法）。"},"examples":[{"en":"Some early scientists described certain minerals as ingenerative because they do not reproduce like living things.","zh":"一些早期科学家把某些矿物称为 ingenerative，因为它们不像生物那样繁殖。"},{"en":"The author contrasts generative forces in nature with ingenerative matter.","zh":"作者把自然界的生成力量与不生成的物质作对比。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, rare) Not capable of reproduction; non-reproductive.","zh":"（生物学，较少见）不能繁殖的；非生殖性的。"},"examples":[{"en":"Worker ants are sometimes described as ingenerative individuals within the colony.","zh":"工蚁有时被描述为蚁群中 ingenerative 的个体。"},{"en":"The paper distinguishes generative tissues from ingenerative ones.","zh":"论文区分了生殖组织与非生殖组织。"}]}],"synonyms":["non-generative","nonproductive","infertile","non-reproductive"],"phonetic":"/ɪnˈdʒɛnərətɪv/","extraExplanation":["这个词比较少见，多见于早期自然科学/哲学语境。构词上是 in-（否定前缀，“不”）+ generative（生成的、繁殖的）。现代英语里更常用的表达是 non-generative / non-reproductive / infertile（视语境而定）。"]}
{"word":"ingeniary","summary":{"en":"“Ingeniary” is not standard English; it’s usually a misspelling of “engineering” or “ingenious.”","zh":"“ingeniary”不是标准英语，通常是把“engineering”或“ingenious”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; not an accepted English word in most dictionaries. It is usually a misspelling of “engineering” (the field/work of designing and building) or “ingenious” (very clever).","zh":"非标准拼写；多数英语词典不收录。通常是把 “engineering”（工程学/工程工作）或 “ingenious”（机智的、巧妙的）拼错了。"},"examples":[{"en":"I think you mean “engineering,” not “ingeniary.”","zh":"我觉得你想写的是 “engineering”，不是 “ingeniary”。"},{"en":"If you wanted to describe something clever, use “ingenious.”","zh":"如果你想表达“很巧妙/很聪明”，用 “ingenious”。"}]}],"synonyms":["engineering","ingenious","engineer"],"phonetic":"/ˌɛn.dʒəˈnɪr.ɪŋ/","extraExplanation":["“engineering”常指学科或职业（工程学/工程师的工作）；“ingenious”是形容词，形容人或点子很聪明、很有创意。","拼写小提示：engineer（工程师）→ engineering（工程学/工程相关的）；ingenious（机智的）里有 -gen-，和“generate（产生）”同源，含“想出点子”的感觉。"]}
{"word":"ingeniate","summary":{"en":"“Ingeniate” is not a standard modern English word; it’s likely a misspelling of “ingenious/ingenuous/ingenuity” or a confusion with rare “ingenuate.”","zh":"“Ingeniate”不是现代英语的标准词；通常是把 “ingenious / ingenuous / ingenuity” 拼错，或与很罕见的 “ingenuate” 混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern usage; it is most likely a misspelling or a mistaken form of another word (such as “ingenious,” “ingenuous,” or “ingenuate”).","zh":"现代英语中并不存在的标准词；多半是拼写错误或把其他单词写错了（例如 “ingenious（有创造力的）”、“ingenuous（天真的/坦率的）” 或较罕见的 “ingenuate”）。"},"examples":[{"en":"I can’t find “ingeniate” in a standard dictionary—did you mean “ingenious”?","zh":"我在常见词典里找不到 “ingeniate”——你是不是想写 “ingenious”？"},{"en":"She built an ingenious solution with simple tools.","zh":"她用简单工具想出了一个很有创造力的解决方案。"},{"en":"He sounded ingenuous, not trying to hide his feelings.","zh":"他听起来很坦率（甚至有点天真），没有刻意隐藏自己的感受。"}]}],"synonyms":["ingenious","ingenuous","ingenuity"],"phonetic":"/ɪnˈdʒiːniˌeɪt/","extraExplanation":["“ingeniate”最常见的情况是拼错。你可以告诉我你想表达的意思（“有创造力/聪明”还是“天真/坦率”，或“使……变得巧妙/设计”之类），我就能帮你选对词。","常见易混词：\n- ingenious /ɪnˈdʒiːniəs/：有创造力的、巧妙的（强调“聪明的点子/设计”）。\n- ingenuous /ɪnˈdʒɛnjuəs/：天真的、坦率的（强调“单纯、不做作”）。\n- ingenuity /ˌɪndʒəˈnuːəti/：创造力、巧思（名词）。","另外，“ingenuate”是非常少见的词，在现代英语中几乎不用；日常写作与考试通常用 ingenious / ingenuity 来表达。"]}
{"word":"ingenie","summary":{"en":"Ingénue (often written ingenue) means an innocent, inexperienced young woman—especially as a character type in theater/film.","zh":"Ingénue（常写作 ingenue）指天真、缺乏经验的年轻女子，尤指戏剧/影视中的“天真少女”角色类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in stories, theater, or film) a young woman who is innocent, inexperienced, and often charming in a natural way.","zh":"（尤用于故事、戏剧或电影中）天真、缺乏经验、带有自然魅力的年轻女子（常指“天真少女/清纯女主”类型）。"},"examples":[{"en":"She was cast as the ingénue in the romantic comedy.","zh":"她在那部浪漫喜剧里被选为“天真少女”角色。"},{"en":"At first he treated her like an ingénue who needed protecting.","zh":"起初他把她当成需要保护的天真女孩。"}]},{"partOfSpeech":"n.","definition":{"en":"a performer who typically plays an innocent young woman role.","zh":"（演员）常扮演“天真少女”这类角色的人。"},"examples":[{"en":"In her early career, she was known as an ingénue on Broadway.","zh":"她早期在百老汇以出演天真少女角色而闻名。"}]}],"synonyms":["naïf","innocent","young innocent heroine","girl-next-door (similar vibe)"],"phonetic":"ˈænʒəˌnuː","extraExplanation":["你输入的“ingenie”更常见是把 **ingénue**（有时不写重音符号写作 *ingenue*）拼错了。","**ingénue**源自法语，常用于影视/戏剧的“角色类型”讨论；它强调“天真、未经世事”的形象，有时也带一点刻板印象的意味。","注意不要和 **genie**（精灵/神灯里的精灵）混淆：*genie* 读音、含义都不同。"]}
{"word":"ingenier","summary":{"en":"Engineer: a person who designs/builds systems, or the act of designing/planning something (sometimes in a strategic or manipulative way).","zh":"engineer：工程师；也可作动词，表示设计/建造/周密安排（有时含“策划操纵”之意）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who designs, builds, or improves machines, structures, or systems (for example, bridges, software, or engines).","zh":"工程师；从事设计、建造或改进机器、结构或系统的人（如桥梁、软件或发动机）。"},"examples":[{"en":"My sister is a software engineer.","zh":"我姐姐是一名软件工程师。"},{"en":"Engineers designed the bridge to handle strong winds.","zh":"工程师把这座桥设计得能承受强风。"}]},{"partOfSpeech":"vt.","definition":{"en":"To design, build, or plan something using technical knowledge and careful organization.","zh":"设计；建造；用工程技术与周密规划来实现某事。"},"examples":[{"en":"They engineered a new battery that lasts longer.","zh":"他们设计出一种更耐用的新电池。"},{"en":"The team engineered the system to be safe and reliable.","zh":"团队把系统设计得既安全又可靠。"}]},{"partOfSpeech":"vt.","definition":{"en":"To arrange something in a clever or strategic way in order to get a desired result (sometimes negative: “to manipulate”).","zh":"策划；安排（以达到某种结果；有时带贬义，指“操纵/算计”）。"},"examples":[{"en":"She engineered a meeting with the hiring manager.","zh":"她设法安排了一次与招聘经理的会面。"},{"en":"The scandal was engineered to damage his reputation.","zh":"这场丑闻被策划出来以损害他的名声。"}]}],"synonyms":["designer","developer","builder","architect","technician"],"phonetic":"/ˌɛn.dʒəˈnɪr/","extraExplanation":["你输入的“ingenier”常见于把“engineer”拼错或受法语/西语拼写影响（例如法语 ingénieur、西语 ingeniero）。英文标准拼写是 engineer。","engineer 的词源与“engine（发动机/引擎）”有关，早期也指“制造军事器械或攻城器具的人”，后来扩展为各类工程领域的专业人员。"]}
{"word":"ingenio","summary":{"en":"“Ingenio” is a Spanish noun meaning “ingenuity/clever creativity,” and in some Caribbean/Latin American contexts it can also mean a “sugar mill.”","zh":"“ingenio”是西语名词，常指“机智/巧思/创造性的聪明才智”，在部分加勒比/拉美语境中也可指“糖厂（制糖庄园）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) ingenuity; creativity or cleverness in solving problems or making ideas.","zh":"（西语）机智；巧思；在解决问题或产生点子时的创造力与聪明才智。"},"examples":[{"en":"Her solution showed real ingenio—simple, but brilliant.","zh":"她的解决方案很有 ingenio——简单却很巧妙。"},{"en":"The engineer’s ingenio saved the project time and money.","zh":"工程师的 ingenio 为项目省下了时间和成本。"}]},{"partOfSpeech":"n.","definition":{"en":"(Caribbean/Latin America, historical) a sugar mill or sugar plantation complex, especially one with equipment for processing sugarcane.","zh":"（加勒比/拉美，历史用法）糖厂；甘蔗制糖庄园综合体，尤指带有制糖设备的地方。"},"examples":[{"en":"In colonial records, an ingenio often meant a sugar mill with its surrounding lands.","zh":"在殖民时期的文献里，ingenio 常指糖厂及其周边土地。"},{"en":"Some museums preserve the ruins of an old ingenio to show the region’s sugar history.","zh":"一些博物馆保留了旧 ingenio 的遗址，用来展示当地的制糖历史。"}]}],"synonyms":["ingenuity","cleverness","wit","resourcefulness","creativity"],"phonetic":"/ɪnˈhɛn.joʊ/","extraExplanation":["在西语文化中，ingenio 常带有“机智、妙语、巧思”的气质，既可以指解决问题的聪明办法，也可指幽默风趣的“才思”。","常见固定搭配：ingenio y creatividad（机智与创造力）；tener ingenio（有巧思/很机灵）。","文学与文化里也常见“ingenio”与“wit（妙语、机智）”相近的用法，用来称赞一个人的口才、点子或创意。"]}
{"word":"ingeniosity","summary":{"en":"“Ingeniosity” is a rare form meaning “ingenuity” (inventive cleverness). In modern English, “ingenuity” is the preferred word.","zh":"“ingeniosity”是个很少见的形式，意思接近“ingenuity”（机智与创造力）。现代英语中更推荐用“ingenuity”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonstandard) The quality of being inventive and clever; ingenuity.","zh":"（罕见/非标准用法）机智与创造力；巧思；独创性。"},"examples":[{"en":"Her ingeniosity helped the team solve the problem with limited tools.","zh":"她的机智与创造力帮助团队在工具有限的情况下解决了问题。"},{"en":"The device shows remarkable ingeniosity in its simple design.","zh":"这个装置的简洁设计体现了非凡的巧思。"}]}],"synonyms":["ingenuity","inventiveness","resourcefulness","creativity","cleverness"],"phonetic":"/ˌɪndʒəˈnuːəti/","extraExplanation":["“ingeniosity”在现代英语中非常少见，很多情况下被视为不太规范的用法。更常见、更自然的词是：\n- “ingenuity”（最常用，表示“巧思/创造力”）\n- “ingeniousness”（也可用，但不如“ingenuity”常见）\n写作或考试中建议优先使用“ingenuity”。"]}
{"word":"ingeniosus","summary":{"en":"*Ingeniosus* is a Latin adjective meaning “clever, inventive, talented.”","zh":"*ingeniosus* 是拉丁语形容词，意为“聪明的、有创造力的、有才智的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin) clever, inventive, or talented; having a quick, creative mind.","zh":"（拉丁语）聪明的；有创造力的；富有才智的。"},"examples":[{"en":"In Latin texts, *ingeniosus* describes someone who solves problems in an inventive way.","zh":"在拉丁文献中，*ingeniosus*用来形容能以巧妙方式解决问题的人。"},{"en":"The teacher praised the student as *ingeniosus* for designing a simple but effective tool.","zh":"老师称赞那位学生很*ingeniosus*，因为他设计了一个简单却有效的工具。"}]}],"synonyms":["ingenious","inventive","clever","resourceful","bright"],"phonetic":"/ɪnˌdʒiːniˈoʊsəs/","extraExplanation":["*ingeniosus* 来自拉丁语 *ingenium*（天赋、才智、机智），强调“与生俱来的聪慧/才思”和“善于发明创造”。","它与英语 *ingenious*（巧妙的、有创造力的）以及 *ingenuity*（独创性）同源；学习时可以把 *ingeniosus* 当作“拉丁语版的 ingenious”。","在英语写作中直接使用 *ingeniosus* 较少见，通常出现在古典学、拉丁语学习或学术讨论中，用来保留原文语感。"]}
{"word":"ingenious","summary":{"en":"Ingenious means very clever and original, especially in creating a smart solution or design.","zh":"Ingenious 指“非常聪明且有创意”，尤指想出巧妙的解决办法或设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clever and original; able to think of new ideas or solve problems in a creative way.","zh":"聪明且有创意的；善于想出新点子或用巧妙的方法解决问题的。"},"examples":[{"en":"She came up with an ingenious solution to the space problem in her small apartment.","zh":"她想出了一个巧妙的办法，解决了小公寓的空间问题。"},{"en":"It was an ingenious design—simple, cheap, and effective.","zh":"那是个精巧的设计——简单、便宜又有效。"}]},{"partOfSpeech":"adj.","definition":{"en":"Skillfully made or arranged; showing clever planning or construction.","zh":"构思精巧的；制作或安排得很巧妙、体现周密设计的。"},"examples":[{"en":"The mystery novel has an ingenious plot that keeps readers guessing.","zh":"这本推理小说的情节设计很巧妙，让读者一直猜个不停。"}]}],"synonyms":["clever","inventive","resourceful","original","brilliant"],"phonetic":"/ɪnˈdʒiːniəs/","extraExplanation":["“ingenious”强调“机智、巧思、创意解决问题”，常用来夸方法、设计、点子或情节；不要和“ingenuous（天真坦率的）”混淆，两者拼写很像但意思相反方向。","词源来自拉丁语词根与“gen/geno（生、产生）”相关，带有“产生新想法、发明”的感觉，所以常搭配 solution/idea/device/design/plan/plot 等名词。"]}
{"word":"ingeniously","summary":{"en":"Ingeniously means “in a clever and inventive way,” often praising an original solution or design.","zh":"ingeniously 意为“巧妙地、富有创意地”，常用于称赞独创的解决办法或设计。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a clever, original, and inventive way; using imagination and skill to solve a problem or create something.","zh":"以巧妙、有创意且富有发明性的方式；运用想象力与技巧来解决问题或创造事物。"},"examples":[{"en":"She ingeniously used a paper clip to fix the loose button.","zh":"她巧妙地用回形针把松掉的纽扣临时固定住。"},{"en":"The app ingeniously turns short breaks into quick language lessons.","zh":"这个应用巧妙地把碎片时间变成快速的语言学习课。"},{"en":"The writer ingeniously connects the two storylines near the end.","zh":"这位作家在结尾处巧妙地把两条故事线联系起来。"}]}],"synonyms":["cleverly","inventively","resourcefully","creatively","shrewdly"],"phonetic":"/ɪnˈdʒiːniəsli/","extraExplanation":["“ingeniously”来自形容词“ingenious（有独创性的、聪明机智的）”，常用来赞赏方法或设计“巧而有效”，比“smartly（聪明地）”更强调“新颖、会想办法”。","常见搭配：ingeniously designed（巧妙设计的）、ingeniously simple（巧妙到极简）、ingeniously solved（巧妙解决）、ingeniously disguised（巧妙伪装）。","文学/正式写作中常用于评论作品结构或构思：如“ingeniously plotted（情节构思巧妙）”。"]}
{"word":"ingeniousness","summary":{"en":"Ingeniousness means the quality of being clever and original in thinking, especially in solving problems.","zh":"Ingeniousness 指“机智与独创性”，尤其指善于用巧妙办法解决问题的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being very clever, original, and good at thinking of new ideas or solutions","zh":"机智与独创性；有创造性地想出新点子或解决办法的能力"},"examples":[{"en":"The ingeniousness of her design solved a problem that had frustrated the team for months.","zh":"她设计的独创性解决了一个困扰团队好几个月的问题。"},{"en":"We admired his ingeniousness in finding a cheap, simple way to fix the machine.","zh":"我们很佩服他能想出一种便宜又简单的办法来修好机器。"}]},{"partOfSpeech":"n.","definition":{"en":"a clever idea, plan, or invention (less common)","zh":"巧妙的想法、计划或发明（较不常用）"},"examples":[{"en":"The exhibition displayed many ingeniousnesses from young inventors.","zh":"展览展示了许多年轻发明者的巧妙创意。"}]}],"synonyms":["ingenuity","cleverness","inventiveness","resourcefulness","originality"],"phonetic":"/ɪnˈdʒiːniəsnəs/","extraExplanation":["“ingeniousness”来自形容词“ingenious”（有独创性的、机智的）。日常英语里更常说“ingenuity”（独创性、巧思），意思非常接近：\n- “ingenuity”更常见、更自然；\n- “ingeniousness”更直白地表示“有多聪明/多有创意的这种特质”。\n另外注意不要和“ingenuous”（天真坦率的、单纯的）混淆：两者拼写很像，但意思不同。"]}
{"word":"ingenit","summary":{"en":"“ingenit” isn’t a standard English word; it’s likely a misspelling of “ingenious” (clever, inventive) or “ingenuous” (innocent, honest).","zh":"“ingenit”不是标准英语单词；很可能是把 “ingenious”（巧妙、有创造力）或 “ingenuous”（天真坦率）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “ingenious” or “ingenuous.”","zh":"不是标准英语单词，很可能是把 “ingenious” 或 “ingenuous” 拼错了。"},"examples":[{"en":"I couldn’t find “ingenit” in an English dictionary—did you mean “ingenious”?","zh":"我在英语词典里查不到 “ingenit”——你是不是想写 “ingenious”？"},{"en":"Many learners mix up “ingenious” and “ingenuous.”","zh":"很多学习者会把 “ingenious” 和 “ingenuous” 搞混。"}]},{"partOfSpeech":"adj.","definition":{"en":"(If you meant “ingenious”) very clever at inventing or solving problems in an original way.","zh":"（如果你想写 “ingenious”）有独创性的聪明；善于发明或解决问题。"},"examples":[{"en":"She came up with an ingenious plan to save time.","zh":"她想出了一个巧妙的省时方案。"},{"en":"The engineer designed an ingenious device.","zh":"那位工程师设计了一个精巧的装置。"}]},{"partOfSpeech":"adj.","definition":{"en":"(If you meant “ingenuous”) honest, open, and a bit too trusting; not trying to deceive.","zh":"（如果你想写 “ingenuous”）天真坦率的；不设防、没有欺骗意图的。"},"examples":[{"en":"He gave an ingenuous smile and answered directly.","zh":"他露出天真的微笑，直截了当地回答。"},{"en":"Her question sounded ingenuous, not sarcastic.","zh":"她的问题听起来很单纯，并不是讽刺。"}]}],"synonyms":["ingenious: clever, inventive, resourceful","ingenuous: innocent, frank, sincere"],"phonetic":"/ɪnˈdʒiːniəs/","extraExplanation":["“ingenious”和“ingenuous”是英语里非常常见的一组“易混词”。\n- ingenious = in + genius（像有“天才”一样）→ 强调“聪明、有巧思、巧妙”。\n- ingenuous 与“genuine（真诚的）”在感觉上更接近 → 强调“坦率、天真、不狡猾”。\n如果你告诉我上下文句子，我可以帮你判断你更想表达哪一个。"]}
{"word":"ingenital","summary":{"en":"“Ingenital” is a rare, formal word meaning “present from birth,” similar to “congenital.”","zh":"“ingenital”很少见，意思是“先天的/出生即有的”，接近“congenital”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) Existing from birth; inborn; congenital.","zh":"（罕用/较正式）先天的；与生俱来的；先天性（congenital）的近义/变体用法。"},"examples":[{"en":"The doctor noted an ingenital heart defect that had been present since birth.","zh":"医生记录到一种先天性心脏缺陷，从出生起就存在。"},{"en":"Some older texts use “ingenital” where modern English prefers “congenital” or “innate.”","zh":"一些较老的文本会用“ingenital”，而现代英语更常用“congenital”或“innate”。"}]}],"synonyms":["congenital","inborn","innate"],"phonetic":"/ɪnˈdʒɛnɪtəl/","extraExplanation":["“ingenital”在现代英语中非常少见，通常会被认为是拼写错误或过时用法。写作与学术表达中更推荐用：congenital（先天性的，常用于疾病/生理缺陷）或 innate（天生的，常用于能力/特质）。","词源上与拉丁语“genitus（出生、产生）”有关，同源词还包括：genital（生殖的）、generate（产生）、genetics（遗传学）。注意：ingenital 不等于 in genital（在生殖器里/方面），后者是两个词。"]}
{"word":"ingenite","summary":{"en":"“Ingenite” is not standard English; it’s likely a misspelling of a similar word (often “ignite” or “ingenuity”).","zh":"“ingenite” 不是标准英语词；多半是拼写错误，可能想写“ignite”或“ingenuity”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern dictionaries; it is most likely a misspelling of another word (such as “ignite,” “ingénue,” or “ingenuity”).","zh":"“ingenite” 不是现代英语词典中的标准单词；很可能是其他单词的拼写错误（例如 “ignite”“ingénue” 或 “ingenuity”）。"},"examples":[{"en":"I couldn’t find “ingenite” in the dictionary—did you mean “ignite”?","zh":"我在词典里找不到 “ingenite”——你是不是想写 “ignite”？"},{"en":"If you meant “ingenuity,” you could say: “Her ingenuity solved the problem.”","zh":"如果你想表达 “ingenuity（聪明才智）”，可以说：“Her ingenuity solved the problem（她的聪明才智解决了问题）。”"}]}],"phonetic":"N/A","extraExplanation":["最常见的可能是把 **ignite** 拼错了：ignite /ɪɡˈnaɪt/，意思是“点燃；（引发情绪/讨论）激起”。例：The spark ignited the fire.（火花点燃了火。）","也可能你想写法语借词 **ingénue**（英语里也用，常指“天真单纯的年轻女子/戏剧中的纯真女主角”）。","如果你想表达“聪明、机智的创造力”，更可能是 **ingenuity**。如果你告诉我你想表达的中文意思或给一句上下文，我可以帮你锁定正确单词。"]}
{"word":"ingenium","summary":{"en":"Ingenium means natural talent or inventive cleverness (and, in literary use, one’s inborn disposition).","zh":"Ingenium 指天赋与创造性的聪慧才智（文学用法也可指与生俱来的性情）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(formal) Natural ability or talent, especially for inventing, thinking creatively, or solving problems.","zh":"（正式用语）天赋；才智，尤指发明创造、创意思考或解决问题的能力。"},"examples":[{"en":"Her ingenium showed early—she built simple machines from spare parts as a child.","zh":"她的才智很早就显露出来——小时候就能用零件拼装简易机器。"},{"en":"The team succeeded through patient testing as much as through ingenium.","zh":"团队的成功既来自耐心的测试，也来自才智与巧思。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary) A person’s inborn character or temperament; one’s natural disposition.","zh":"（文学用语）与生俱来的性情；天性；气质。"},"examples":[{"en":"He wrote as if guided by his own ingenium rather than by fashion.","zh":"他写作时仿佛受自身天性引导，而非追逐潮流。"}]}],"synonyms":["genius","ingenuity","talent","aptitude","resourcefulness"],"phonetic":"/ɪnˈdʒiːniəm/","extraExplanation":["“Ingenium”源自拉丁语，意为“与生俱来的天赋/本性”。在英语里它较少用于日常口语，更常见于学术、文学或修辞性写作中，用来强调“天生的聪慧与创造力”。","可与“genius”对比理解：两者都与“天赋”有关，但“ingenium”更书面、更强调一种内在的创造性能力与机智。"]}
{"word":"ingent","summary":{"en":"“Ingent” means extremely large; it’s a rare, old-fashioned word.","zh":"“ingent”意为“极其巨大”，是一个较少见、偏古旧的词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very large; enormous (rare/old-fashioned).","zh":"非常大的；巨大的（较少见/偏古旧用法）。"},"examples":[{"en":"An ingent crowd filled the streets after the game.","zh":"比赛结束后，街上挤满了巨大的人群。"},{"en":"They faced an ingent task: rebuilding the town after the storm.","zh":"他们面临一项艰巨的任务：在暴风雨后重建小镇。"}]}],"synonyms":["enormous","immense","gigantic","huge","massive"],"phonetic":"/ˈɪndʒənt/","extraExplanation":["“ingent”在现代英语中很少使用，更常见的替代词是“enormous / immense / gigantic / huge”。","它多见于较正式或文学性的语境，用来强调数量或规模“异常之大”。","常见拼写易混：如果你想表达“独立的”，应是“independent”；如果是“无辜的”，是“innocent”。"]}
{"word":"ingenu","summary":{"en":"An ingénue is a young, innocent female character (or someone with that vibe), especially in theater/film.","zh":"ingénue 指（尤指戏剧/电影中的）天真纯洁、缺乏经验的年轻女性角色，也可指给人这种感觉的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young, innocent, and often inexperienced woman in a story, play, or film (or a person who seems like this)","zh":"（故事、戏剧或电影中的）天真纯洁、缺乏经验的年轻女子；（或）给人这种印象的人"},"examples":[{"en":"She often gets cast as the ingénue in romantic comedies.","zh":"她经常在浪漫喜剧里被选来演“天真少女”这种角色。"},{"en":"The film contrasts the cynical detective with an ingénue who still believes in justice.","zh":"这部电影把愤世嫉俗的侦探与仍然相信正义的天真少女形成对比。"}]},{"partOfSpeech":"adj.","definition":{"en":"innocent, naive, or openly sincere in a way that seems youthful (less common)","zh":"天真无邪的；单纯率真的（较不常用）"},"examples":[{"en":"Her ingénue charm made the interview feel unusually honest.","zh":"她那种天真率真的魅力让采访显得格外真诚。"}]}],"synonyms":["naive girl","innocent young woman","young innocent character"],"phonetic":"/ˈænʒənuː/","extraExplanation":["“ingénue”（常写作 ingénue，带重音符号；也常见不带符号的 ingenue）来自法语，原意与“天真、朴素”相关。英语里多用于影视/戏剧选角与人物类型，常与“cynic（愤世嫉俗者）”“femme fatale（致命女人）”等角色类型形成对照。","读音上，英语里常把它读成接近“AN-zhuh-noo”的感觉；注意它不是“ingenious（有创造力的）/ingenue（天真少女）”这一组。"]}
{"word":"ingenue","summary":{"en":"An “ingenue” is an innocent young woman—especially a common character type in movies and theater; it can also describe a sweet, innocent style.","zh":"“Ingenue”指天真纯洁的年轻女子，尤指影视戏剧中常见的“纯情少女”角色；也可形容带有这种气质的风格或形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A young, innocent (often inexperienced) woman, especially a character type in films, theater, or novels.","zh":"（尤指电影、戏剧或小说中的）天真纯洁的年轻女子；“纯情少女”式角色。"},"examples":[{"en":"She was cast as the ingenue in the romantic comedy.","zh":"她在那部浪漫喜剧中被选为“纯情少女”角色。"},{"en":"Early in her career, she often played the ingenue opposite older, more worldly characters.","zh":"她职业生涯早期常常饰演“天真少女”，与更老练的角色形成对照。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or typical of an innocent young woman (often describing a role, look, or style).","zh":"（描述角色、形象或风格）带有“天真少女”气质的；纯真无邪的。"},"examples":[{"en":"The film gave her an ingenue image that followed her for years.","zh":"那部电影让她形成了“纯情少女”的形象，并伴随了她很多年。"},{"en":"She wore an ingenue white dress that made her look even younger.","zh":"她穿了一条带有“纯真少女”气质的白裙子，让她看起来更年轻。"}]}],"synonyms":["naive girl","innocent young woman","sweetheart","naif (related)"],"phonetic":"/ˈænʒənuː/","extraExplanation":["“Ingénue”源自法语，原意接近“天真的、单纯的”。英语里多用于表演艺术的“角色类型”（typecasting），常与成熟老练的“femme fatale（蛇蝎美人）”或“matron（端庄年长女性）”等类型形成对照。","使用场景上，它常带有“角色设定/荧幕形象”的意味；现实生活中直接称某人为 ingenue 可能带一点“被看作太天真”或“被包装成纯情形象”的暗示，语气取决于上下文。"]}
{"word":"ingenues","summary":{"en":"“Ingenues” is the plural of “ingénue”: an innocent, inexperienced young woman, especially a common character type in theater/film.","zh":"“ingenues”是“ingénue/ingenue”的复数：指天真、缺乏经验的年轻女子；也指戏剧/电影中常见的“天真女主角”角色类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A young woman who is innocent, inexperienced, and somewhat naïve (often seen as charming or genuine).","zh":"（常指）天真、纯真、缺乏经验的年轻女子；有点单纯、稚嫩。"},"examples":[{"en":"In her first big-city job, she was an ingénue who trusted everyone.","zh":"她第一次到大城市工作时很单纯，几乎谁都信。"},{"en":"The novel follows an ingénue learning how power works in high society.","zh":"这部小说写的是一位天真的年轻女子逐渐了解上流社会权力运作的过程。"}]},{"partOfSpeech":"n.","definition":{"en":"In theater and film, a role type: a sweet, innocent young female character (often the romantic lead).","zh":"（戏剧/电影）角色类型：天真可爱、纯洁的年轻女性角色（常为女主或爱情线核心人物）。"},"examples":[{"en":"She was cast as the ingénue opposite a more worldly heroine.","zh":"她被选中饰演天真女主角，与更老练的女主角形成对照。"},{"en":"Classic comedies often include an ingénue and a witty best friend.","zh":"经典喜剧里常常会有一位天真女主角和一个机智的闺蜜/好友。"}]}],"synonyms":["naive young woman","innocent young woman","newcomer","greenhorn (informal)","ingénue role"],"phonetic":"/ˈænʒəˌnuː/","extraExplanation":["“ingénue”来自法语，本义与“天真、缺乏世故”有关；英语里常保留法语拼写的重音符号（é），但日常书写中也常见不带重音的“ingenue”。","你输入的“ingenues”是复数形式；单数是“ingénue/ingenue”。这个词传统上带有性别色彩（多指女性角色），在现代语境中使用时可注意是否需要更中性的表达（如“naive newcomer / innocent newcomer”）。"]}
{"word":"ingenuities","summary":{"en":"“Ingenuities” means multiple clever, creative ideas or inventive solutions (plural of “ingenuity”).","zh":"“Ingenuities”指多个巧思、创意或独创的解决办法，是“ingenuity”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Creative or clever ideas or methods; inventive solutions (plural of “ingenuity”).","zh":"巧思；独创性；机智的想法或方法（“ingenuity”的复数）。"},"examples":[{"en":"The engineer’s ingenuities saved the team time and money.","zh":"这位工程师的巧思为团队节省了时间和成本。"},{"en":"We admired the small ingenuities in the design, like hidden storage and easy-to-clean parts.","zh":"我们很欣赏这个设计里的小巧思，比如隐藏式收纳和易清洁的部件。"}]},{"partOfSpeech":"n.","definition":{"en":"Uncommon: clever devices, tricks, or intricate creations; ingenious things (plural of “ingenuity” in a concrete sense).","zh":"不常见：精巧的装置、技巧或复杂的创作；精妙之物（把“ingenuity”当作具体事物来用的复数）。"},"examples":[{"en":"The museum displayed mechanical ingenuities from the 1800s.","zh":"博物馆展出了19世纪的机械巧制。"},{"en":"Her notebook was full of little ingenuities for organizing daily life.","zh":"她的笔记本里写满了整理日常生活的小妙招。"}]}],"synonyms":["inventions","innovations","clever ideas","creative solutions","brainwaves"],"phonetic":"/ˌɪn.dʒəˈnu.ə.tiz/","extraExplanation":["“ingenuities”是名词复数，单数是“ingenuity”。日常更常用不可数形式“ingenuity”来表达“聪明才智/创造力”（e.g., Human ingenuity is amazing. 人类的创造力很惊人）。用复数“ingenuities”时，通常强调“许多具体的巧思/点子/做法”。","注意不要和“ingenuous”（天真坦率的）混淆；两者拼写相近但意思不同。"]}
{"word":"ingenuity","summary":{"en":"Ingenuity means creative cleverness—finding original, practical solutions to problems.","zh":"Ingenuity 指“有创意的机智/巧思”，能想出原创且实用的解决办法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability to think of clever, original, and useful ideas, especially for solving problems or making things work with limited resources.","zh":"独创性；巧思；机智（尤指在资源有限时想出聪明、实用的办法来解决问题的能力）。"},"examples":[{"en":"With a little ingenuity, they fixed the broken door using only tape and wire.","zh":"他们靠一点巧思，只用胶带和铁丝就把坏掉的门修好了。"},{"en":"Her ingenuity turned a simple app idea into a tool that helps thousands of students.","zh":"她的独创性把一个简单的应用想法变成了帮助成千上万学生的工具。"},{"en":"Human ingenuity has made it possible to live in very harsh climates.","zh":"人类的巧思与创造力让我们能够在非常恶劣的气候中生活。"}]}],"synonyms":["creativity","inventiveness","resourcefulness","originality","cleverness"],"phonetic":"/ˌɪn.dʒəˈnuː.ə.ti/","extraExplanation":["常见搭配：human ingenuity（人类的创造力）、with ingenuity（凭借巧思）、a display of ingenuity（展现独创性）。","语感提示：ingenuity 指“聪明的创造性解决问题”；不要和 ingenuity 的近形词 ingenuous（天真坦率的）混淆。两者词源相关，但现代含义不同。","写作中常用于赞赏创新与应变能力，也常出现在科技、工程、创业、日常“用简陋工具解决难题”的语境。"]}
{"word":"ingenuous","summary":{"en":"Ingenuous describes someone who is innocent and honestly straightforward, without hidden motives.","zh":"Ingenuous 用来形容一个人天真真诚、坦率不设防，没有隐藏动机。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing innocent, childlike honesty; not trying to trick anyone.","zh":"天真坦率的；真诚而不设防的（不耍心机）。"},"examples":[{"en":"Her ingenuous smile made everyone trust her right away.","zh":"她天真坦率的笑容让大家立刻就信任了她。"},{"en":"He asked an ingenuous question that revealed he didn’t understand the situation yet.","zh":"他问了一个天真的问题，暴露出他还没理解当时的情况。"}]},{"partOfSpeech":"adj.","definition":{"en":"Open and straightforward in expression; candid in a simple, unaffected way.","zh":"直率的；不矫饰的（表达自然、没有做作）。"},"examples":[{"en":"She gave an ingenuous account of what happened, without exaggerating.","zh":"她用坦率自然的方式讲述了发生的事，没有夸大。"},{"en":"The book has an ingenuous style that feels personal and direct.","zh":"这本书的文风自然真诚，读起来很私人、很直接。"}]}],"synonyms":["innocent","naive","candid","open","artless","guileless"],"phonetic":"/ɪnˈdʒɛnjuəs/","extraExplanation":["容易混淆：ingenuous（天真坦率）≠ ingenious（有创造力的、聪明的）。两者拼写很像，但意思差很多。","语气与使用场景：ingenuous 通常是褒义，强调“真诚/不设防”；但在某些语境也可能带一点“过于天真、缺乏世故”的含义。","常见搭配：an ingenuous smile（天真的笑容）、an ingenuous remark（不加修饰的评论）、an ingenuous question（天真的问题）。"]}
{"word":"ingenuously","summary":{"en":"Ingenuously means doing or saying something sincerely and innocently, without hidden motives or tricks.","zh":"Ingenuously 指以真诚、天真、坦率的方式行事或说话，没有隐藏动机或欺骗。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a sincere, innocent, and open way, without trying to trick anyone.","zh":"以真诚、单纯、坦率的方式；不耍心机、不欺骗。"},"examples":[{"en":"She ingenuously admitted that she didn’t understand the joke.","zh":"她很坦率地承认自己没听懂那个笑话。"},{"en":"He asked ingenuously if he could join the meeting, not realizing it was private.","zh":"他单纯地问自己能不能参加会议，却没意识到那是个私密会议。"},{"en":"The child spoke ingenuously, trusting everyone in the room.","zh":"那个孩子天真地说着话，信任房间里的每一个人。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a straightforward and artless way; appearing simple rather than clever or calculating.","zh":"以朴素直接、毫不矫饰的方式；显得不精明算计。"},"examples":[{"en":"The story is told ingenuously, with little irony or sarcasm.","zh":"这个故事讲得很质朴，几乎没有反讽或挖苦。"},{"en":"He smiled ingenuously, as if the answer were obvious.","zh":"他直率地笑了笑，仿佛答案显而易见。"}]}],"synonyms":["sincerely","innocently","openly","naively","candidly"],"phonetic":"/ɪnˈdʒɛn.ju.əs.li/","extraExplanation":["注意区分：ingenuous（天真、坦率） vs. ingenious（有创造力、聪明）。拼写很像，但意思几乎相反。","语气提示：说某人“ingenuously”通常偏中性或略带温和的“天真感”；有时也暗示“有点不够世故”。"]}
{"word":"ingenuousness","summary":{"en":"Ingenuousness means sincere openness, and sometimes innocent naivety.","zh":"Ingenuousness 指真诚坦率，也可指因缺乏经验而显得天真单纯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being honest, sincere, and open; saying what you truly think or feel without trying to deceive.","zh":"真诚；坦率；不虚伪（直说自己真实想法与感受，不试图欺骗）。"},"examples":[{"en":"People trusted her because of her ingenuousness.","zh":"大家因为她的真诚而信任她。"},{"en":"His ingenuousness made the apology feel real, not rehearsed.","zh":"他的坦率让道歉显得真诚，而不是排练出来的。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being innocent or naive, often because of limited experience.","zh":"天真；单纯；缺乏世故（常因阅历不足而显得不够精明）。"},"examples":[{"en":"Her ingenuousness about office politics surprised her coworkers.","zh":"她对办公室政治的天真让同事们很惊讶。"},{"en":"The film captures the ingenuousness of childhood.","zh":"这部电影捕捉了童年的单纯天真。"}]}],"synonyms":["sincerity","candor","frankness","openness","innocence","naivete"],"phonetic":"/ɪnˈdʒɛnjuəsnəs/","extraExplanation":["“ingenuousness”来自形容词“ingenuous”（真诚的；天真的）加名词后缀“-ness”。学习时要特别注意不要和“ingenious”（/ɪnˈdʒiniəs/，聪明有创造力的）混淆：两者拼写相近，但含义完全不同。","在文学与叙事中，“ingenuousness”常用来塑造人物的可信度（真诚）或“纯真视角”（天真），例如描写一个新来者对社会规则不设防、因此更显真实。"]}
{"word":"ingenuousnesses","summary":{"en":"“Ingenuousnesses” means multiple instances or kinds of ingenuousness—open, sincere, and unguarded honesty.","zh":"“ingenuousnesses”指多次或多种“天真坦率、真诚不设防”的表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ingenuousness: the qualities or instances of being ingenuous (honest, open, and not trying to deceive).","zh":"ingenuousness 的复数：指“天真坦率、真诚不设防（不试图欺骗）”的品质或具体表现（多次/多种表现）。"},"examples":[{"en":"Her letters were full of ingenuousnesses—small, unguarded truths that made them feel sincere.","zh":"她的信里充满了许多“天真坦率”的表现——一些不加防备的小实话，让信读起来格外真诚。"},{"en":"In interviews, audiences often respond well to these ingenuousnesses because they feel human and direct.","zh":"在采访中，观众往往会对这些“真诚不做作”的流露反应很好，因为它们显得有人味、很直接。"}]}],"synonyms":["sincerities","candors","franknesses","openheartednesses"],"phonetic":"/ɪnˈdʒɛnjuəsnəsɪz/","extraExplanation":["“ingenuousnesses”是比较少见的复数形式。通常“ingenuousness”作为抽象名词更常用（不可数），但在文学或评论写作中，作者有时会用复数来强调“多种/多次具体的坦率流露”。","注意区分：ingenuous（天真坦率、真诚） vs. disingenuous（不真诚、假装）。拼写上容易混淆。"]}
{"word":"ingeny","summary":{"en":"Ingeny is not a standard English word; you may mean ingénue (ingenue): a naïve, innocent young woman, often a character type in stories.","zh":"“ingeny”不是标准英文词；你可能想写的是 ingénue（也常写作 ingenue）：指天真无邪的年轻女子，常见于戏剧/影视/小说中的角色类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: ingénue) A young, innocent, and trusting woman, especially a character in a play, film, or novel who is sweet and inexperienced.","zh":"（你可能想写的是：ingénue）天真无邪的年轻女子；尤指戏剧、电影或小说中善良、缺乏世故经验的“纯真少女”角色。"},"examples":[{"en":"She was cast as the ingénue in the romantic comedy.","zh":"她在那部浪漫喜剧里被选为“纯真少女”角色。"},{"en":"The story starts with an ingénue who slowly learns how the world works.","zh":"故事以一个天真少女开场，她逐渐学会了解这个世界的运作方式。"},{"en":"He treated her like an ingénue, even though she was more experienced than he thought.","zh":"他把她当成天真无知的少女，尽管她比他想的更有经验。"}]}],"synonyms":["ingenue","naïve girl","innocent young woman"],"phonetic":"/ˈænʒəˌnu/","extraExplanation":["“ingénue”来自法语，常用于戏剧/影视选角类型（typecasting），与“天真、未受世故污染”的形象有关。","拼写提示：正确拼法是 ingénue（常写作 ingenue，不写重音符号）。你输入的 “ingeny” 更像是拼写错误。","相关词：naive（天真的），innocent（纯真的）；相对角色类型可对比 femme fatale（致命女人）或 sophisticate（老练的人）。"]}
{"word":"inger","summary":{"en":"\"inger\" is not a common standalone English word; it’s likely a typo or part of another word.","zh":"“inger”通常不是独立的英语单词；更可能是拼写错误或其他单词的一部分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is usually a misspelling, a truncated form (part of a longer word), or a proper name (e.g., a surname).","zh":"不是标准英语单词；通常是拼写错误、被截断的词（较长单词的一部分），或专有名词（例如姓氏）。"},"examples":[{"en":"\"Inger\" isn’t a common English word—did you mean \"ginger\" or \"singer\"?","zh":"“inger”不是常见英文单词——你是不是想写“ginger（姜/姜黄色）”或“singer（歌手）”？"},{"en":"I think you typed only part of the word, like \"finger\" without the first letter.","zh":"我觉得你可能只输入了单词的一部分，比如把“finger（手指）”的第一个字母漏掉了。"}]}],"phonetic":"/ˈɪŋɡɚ/","extraExplanation":["如果你告诉我你想表达的中文意思，或提供一个完整句子/上下文，我可以更准确地判断你想查的词。","常见最接近的拼写包括：ginger（姜；姜黄色的）、singer（歌手）、linger（逗留；徘徊）、finger（手指）。你想查哪一个？"]}
{"word":"ingerir","summary":{"en":"to take something into the body; also, to absorb information","zh":"摄入（食物/饮品/药物）；也可指吸收信息"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to eat or drink something; to take something into the body (especially food, drink, or medicine)","zh":"摄入；吃下；（尤指食物、饮料或药物）进入体内"},"examples":[{"en":"The doctor said you should not ingest alcohol while taking this medicine.","zh":"医生说服药期间不要摄入酒精。"},{"en":"After the hike, he ingested a lot of water to rehydrate.","zh":"徒步后他喝了很多水来补充水分。"},{"en":"Some plants can be harmful if ingested by children.","zh":"有些植物如果被儿童误食会有害。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to absorb or take in information, ideas, or experiences","zh":"（引申）吸收；接收（信息、观念或经历）"},"examples":[{"en":"She ingested every detail of the lecture and asked smart questions.","zh":"她把讲座的细节都吸收了，还问了很有水平的问题。"},{"en":"It’s easier to ingest new vocabulary when you see it in context.","zh":"在语境中看到新词更容易吸收记住。"}]}],"synonyms":["ingest","consume","swallow","take in","absorb"],"phonetic":"/ˌɪn.dʒəˈrɪr/","extraExplanation":["*ingerir* 是西班牙语和葡萄牙语里的动词，对应英语常用词 **ingest**（更偏正式/医学语境）。日常口语里英语更常说 **eat/drink/take**（吃/喝/服用）。"],"etymology":"源自拉丁语 *ingerere*（in- “进入” + gerere “携带、带来”），原意是“把……带进去”，后来引申为“吞入/摄入”。在西班牙语/葡萄牙语中形成 *ingerir*，意思与英语 *ingest* 很接近。","mnemonic":["记成英语 **ingest** 的“亲戚词”：*in-*（进）+“ger/gest”（带、搬）→“带进身体里”＝摄入。","联想中文“引入体内”：*in-*≈“进”，-*gerir* 让你想到“引入/进入”。"]}
{"word":"ingerminate","summary":{"en":"Ingerminate is a rare verb meaning to insert a bud/germ (often by grafting) or, figuratively, to plant an idea so it starts to grow.","zh":"Ingerminate 是个罕见动词，指把芽/萌芽植入（常指芽接嫁接），也可比喻为把想法“种进”心里使其滋长。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To plant or insert a bud or germ (a beginning seed/sprout) into something; to graft by budding, so it can grow.","zh":"（罕见）把芽或“萌芽/胚”（生长的开端）植入某物中；（尤指）用芽接法进行嫁接，使其生长。"},"examples":[{"en":"The gardener ingerminated a peach bud onto the older tree to improve the fruit.","zh":"园丁把桃树的芽接到老树上，以改良果实。"},{"en":"In spring, farmers may ingerminate new varieties onto hardy rootstock.","zh":"春天，农民可能把新品种用芽接法嫁接到抗性强的砧木上。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative, rare) To implant an idea, feeling, or tendency so it begins to grow and develop.","zh":"（比喻，罕见）把某种想法、情感或倾向“植入”人心，使其开始滋长发展。"},"examples":[{"en":"Good teachers try to ingerminate curiosity in their students.","zh":"好老师会努力在学生心中“种下”好奇心。"},{"en":"The novel ingerminated doubt about the hero’s choices.","zh":"这部小说让人对主人公的选择生出怀疑。"}]}],"synonyms":["graft","bud (onto)","implant","instill","plant (an idea)"],"phonetic":"/ɪnˈdʒɝːməˌneɪt/","extraExplanation":["这个词非常少见，多见于较旧的书面英语或带有修辞色彩的写作。日常英语里更常用 plant (an idea), instill, implant；园艺语境下常用 graft, bud/graft by budding。","词源上可理解为 in-（使进入）+ germinate（发芽），但它并不等同于常见的 germinate（发芽）；ingerminate 更强调“把芽/萌芽植入别处”的动作。"]}
{"word":"ingest","summary":{"en":"Ingest means to take something into your body (or, in tech, into a system), especially in formal contexts.","zh":"Ingest 指“摄入/吞下”，多用于正式语境；在科技领域也可指“导入并接收数据”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take in (food, drink, medicine, or information) into the body or mind","zh":"摄入；吞下（食物、饮料、药物）；（也可指）吸收/接收信息"},"examples":[{"en":"You should ingest the medicine with water, not juice.","zh":"你应该用水吞服这种药，不要用果汁。"},{"en":"Some apps ingest data from many websites to show you one report.","zh":"有些应用会从多个网站导入/吸收数据，给你一份综合报告。"}]},{"partOfSpeech":"v.","definition":{"en":"to swallow or eat something (often used in formal or scientific writing)","zh":"吞食；吞咽（常用于较正式或科学语境）"},"examples":[{"en":"Do not ingest any chemicals unless a doctor tells you to.","zh":"除非医生指示，否则不要吞食任何化学品。"},{"en":"The study measured how much sugar participants ingested each day.","zh":"该研究测量了参与者每天摄入多少糖。"}]}],"synonyms":["consume","swallow","take in","absorb"],"phonetic":"/ɪnˈdʒɛst/","extraExplanation":["“ingest”语体偏正式，日常口语更常说 eat / drink / take (medicine)。在科技语境里，“ingest data”很常见，意思是“把数据导入系统并让系统开始处理”。","常见搭配：ingest food/water/medicine；accidentally ingest（误食）；data ingestion（数据摄取/导入）。"]}
{"word":"ingesta","summary":{"en":"Ingesta means the substances (food, drink, etc.) that are taken into the body, mainly used in medical or scientific contexts.","zh":"ingesta 指“摄入物”（食物、饮料等进入体内的物质），主要用于医学或科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food, drink, or other substances taken into the body (especially the digestive tract); what is ingested.","zh":"摄入物：进入身体（尤指消化道）的食物、饮料或其他物质。"},"examples":[{"en":"Doctors may ask about a patient’s ingesta to understand possible causes of stomach pain.","zh":"医生可能会询问患者的摄入物，以了解胃痛的可能原因。"},{"en":"In nutrition studies, researchers record daily ingesta such as meals, snacks, and beverages.","zh":"在营养研究中，研究人员会记录每天的摄入物，如正餐、零食和饮料。"},{"en":"Certain medications can affect how the body processes ingesta.","zh":"某些药物会影响身体处理摄入物的方式。"}]}],"synonyms":["food intake","dietary intake","consumed substances","ingested material"],"phonetic":"/ɪnˈdʒɛstə/","extraExplanation":["“ingesta”多用于医学/生理学语境，是拉丁语复数形式（单数可作“ingestum”，但日常英语里很少用单数）。在普通英语中，人们通常说“food and drink”或用动词“ingest（摄入）”。","常与“excreta（排泄物）”对比：ingesta 指“进入体内的”，excreta 指“排出体外的”。"]}
{"word":"ingestant","summary":{"en":"An ingestant is something swallowed into the body, especially in medical or scientific contexts.","zh":"ingestant 指被吞咽进入体内的东西，多用于医学或科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance that is taken into the body by swallowing (food, drink, or sometimes a drug).","zh":"（通过吞咽）摄入体内的物质；摄入物（如食物、饮料，有时也指药物）。"},"examples":[{"en":"Coffee is a common ingestant in many people’s morning routines.","zh":"咖啡是很多人早晨习惯中常见的摄入物。"},{"en":"The doctor asked about possible ingestants before the stomach pain started.","zh":"医生在胃痛开始前询问了可能摄入过的东西。"}]}],"synonyms":["substance consumed","something ingested","intake substance"],"phonetic":"/ɪnˈdʒɛstənt/","extraExplanation":["“Ingestant”是较正式、偏医学/毒理学用语，常出现在病历记录、急诊问诊或研究报告中，用来概括“患者吃了/喝了/吞了什么”。日常英语里更常说：something you ate/drank, what you took in, food/drink.","词根帮助记忆：in-（进入）+ gest（携带/运送；同源于digest, gestation）。与之相关的常见词：ingest（摄入，动词）、ingestion（摄入，名词）。"]}
{"word":"ingested","summary":{"en":"“Ingested” means “taken in,” especially swallowed (medicine/food), and by extension absorbed (information) or imported (data).","zh":"“ingested”表示“被摄入/吸收/导入”，常指吞咽摄入（药物、食物），也可引申为吸收信息或导入数据。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past form of “ingest”: to take food, drink, or a substance into the body by swallowing or absorbing it.","zh":"“ingest”的过去式/过去分词：指通过吞咽或吸收把食物、饮料或某种物质摄入体内。"},"examples":[{"en":"She ingested the medicine with a glass of water.","zh":"她用一杯水把药吞了下去。"},{"en":"The patient may have ingested something toxic.","zh":"病人可能摄入了有毒物质。"}]},{"partOfSpeech":"vt.","definition":{"en":"taken in mentally: absorbed (information, ideas, or experiences).","zh":"（引申）在头脑中吸收、理解（信息、观点或经历）。"},"examples":[{"en":"He ingested a lot of new information during the training.","zh":"培训期间他吸收了很多新信息。"},{"en":"It takes time to ingest feedback and make changes.","zh":"吸收反馈并做出改变需要时间。"}]},{"partOfSpeech":"vt.","definition":{"en":"in computing: imported into a system so it can be stored, processed, or analyzed.","zh":"（计算机）把数据导入系统，以便存储、处理或分析。"},"examples":[{"en":"The logs were ingested into the database overnight.","zh":"日志在夜间被导入数据库。"},{"en":"After the files are ingested, the system indexes them automatically.","zh":"文件导入后，系统会自动为它们建立索引。"}]},{"partOfSpeech":"adj.","definition":{"en":"as an adjective: having been swallowed or taken in.","zh":"作形容词：已被吞下或摄入的。"},"examples":[{"en":"The ingested dose was small but still caused symptoms.","zh":"摄入剂量虽小，但仍引发了症状。"}]}],"synonyms":["swallowed","consumed","absorbed","took in","imported","loaded"],"phonetic":"/ɪnˈdʒɛstɪd/","extraExplanation":["“ingest”来自拉丁语 in-（进入）+ gerere（携带、带来）。所以核心画面是“把东西带进身体/系统里”。","在正式写作中，“ingest”比“eat/drink”更偏医学或科学语境；日常说“吃/喝”通常用 eat/drink。"]}
{"word":"ingester","summary":{"en":"An ingester is either a system that imports data or a person/animal that takes something in (ingests it).","zh":"ingester 可指“数据导入/摄取系统”，也可指“摄入者（人或动物）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or software component that takes in (imports) data from another source so it can be stored, processed, or analyzed.","zh":"（数据）摄取器；数据导入工具：把来自其他来源的数据接收并导入，以便存储、处理或分析的设备或软件组件。"},"examples":[{"en":"The log ingester collects events from all servers every minute.","zh":"这个日志摄取器每分钟从所有服务器收集事件。"},{"en":"We built an ingester to pull data from the API into our database.","zh":"我们做了一个摄取器，把 API 的数据拉到我们的数据库里。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or animal that ingests (swallows or takes in) something, especially food, medicine, or substances.","zh":"摄入者；吞食者：指摄入（吞咽或吸收）某物的人或动物，尤其是食物、药物或其他物质。"},"examples":[{"en":"Caffeine affects each ingester differently depending on body size and tolerance.","zh":"咖啡因对不同摄入者的影响不同，取决于体型和耐受度。"},{"en":"The report warns that heavy alcohol ingesters face higher health risks.","zh":"报告警告，大量饮酒的摄入者面临更高的健康风险。"}]}],"synonyms":["data importer","data pipeline component","consumer","user"],"phonetic":"/ɪnˈdʒɛstɚ/","extraExplanation":["“Ingester”来自动词“ingest”（摄入、吸收）+ 表示“……的人/物”的后缀“-er”。在日常英语里，人们更常用“consumer / user / eater / drinker”等词；“ingester”在医疗/科研语境或数据工程（data ingestion）语境中更常见。","在数据领域，“ingester”常指数据管道中的一个模块，负责接收数据（如日志、消息队列、传感器数据），可能还会做初步清洗、去重、分批写入等。相关常见搭配：data ingestion（数据摄取/导入）、ingestion pipeline（摄取管道）、ingest data（摄取数据）。"]}
{"word":"ingestible","summary":{"en":"“Ingestible” means safe and suitable to be swallowed (eaten or drunk).","zh":"“ingestible”表示“可被吞咽摄入且安全的”，即可吃或可喝的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be eaten or drunk safely; edible.","zh":"可食用的；可吞咽且安全的。"},"examples":[{"en":"Make sure the berries are ingestible before you eat them.","zh":"吃之前要确认这些浆果是可食用的。"},{"en":"Only ingestible liquids are allowed in this area.","zh":"这个区域只允许可饮用（可吞咽）的液体。"}]}],"synonyms":["edible","eatable","consumable","drinkable"],"phonetic":"/ɪnˈdʒɛstəbəl/","extraExplanation":["“Ingestible”来自动词 ingest（摄入、吞下）+ 形容词后缀 -ible（“能够……的”）。","在日常英语里更常用的词是 edible（可食用的）。ingestible 常见于更正式或技术性的语境，比如食品安全、药品/补充剂说明，或强调“可以吞咽进入体内”的含义（不仅仅是“能吃”）。"]}
{"word":"ingesting","summary":{"en":"“Ingesting” means swallowing something into the body, or (more formally) taking in data/information for processing.","zh":"“ingesting”指吞咽摄入体内；也可指（较正式/科技语境）摄取并处理数据或信息。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Taking food, drink, or medicine into the body by swallowing (the present participle of “ingest”).","zh":"（动词 ingest 的现在分词）吞咽，把食物、饮料或药物吃/喝进体内。"},"examples":[{"en":"She is ingesting a small tablet with water.","zh":"她正用水吞服一小片药。"},{"en":"Avoid ingesting anything for two hours before the test.","zh":"检测前两小时内避免进食或饮用任何东西。"}]},{"partOfSpeech":"v.","definition":{"en":"Taking in and processing information or data (often used in computing or formal writing).","zh":"（常用于计算机或正式语境）摄取并处理信息或数据。"},"examples":[{"en":"The system is ingesting log files from multiple servers.","zh":"系统正在从多台服务器摄取日志文件。"},{"en":"It can take time to ingest so much new information.","zh":"要消化（吸收）这么多新信息需要时间。"}]}],"synonyms":["swallowing","consuming","taking in","absorbing","importing (data)"],"phonetic":"/ɪnˈdʒɛstɪŋ/","extraExplanation":["“ingest”比“eat / drink”更正式，常见于医学、说明书、安全提示（如“Do not ingest”=“请勿吞食”）。","在科技语境里，“data ingesting/ingestion”指把外部数据导入系统并进行初步处理（如清洗、解析、入库）。"]}
{"word":"ingestion","summary":{"en":"Ingestion means taking something in—usually into the body (food/medicine), and in computing it can mean bringing data into a system.","zh":"Ingestion 指“摄入”，常用于身体摄入食物/药物；在计算机领域也可指“数据导入/数据摄取”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of taking something into the body, especially food, drink, or medicine","zh":"（尤指食物、饮料或药物的）摄入；吞食"},"examples":[{"en":"Regular ingestion of vegetables can improve health.","zh":"经常摄入蔬菜有助于改善健康。"},{"en":"The medication should be taken with food to reduce stomach discomfort after ingestion.","zh":"这种药应随餐服用，以减少摄入后对胃的刺激。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) the process of collecting and bringing data into a system so it can be stored or analyzed","zh":"（计算机）数据摄取；数据导入（把数据收集并导入系统以存储或分析的过程）"},"examples":[{"en":"The team built a tool for daily data ingestion from multiple sources.","zh":"团队构建了一个工具，用于每天从多个来源进行数据导入。"},{"en":"Faster ingestion helps the dashboard show near real-time results.","zh":"更快的数据摄取能让仪表盘显示接近实时的结果。"}]}],"synonyms":["intake","consumption","swallowing","data import","data intake"],"phonetic":" /ɪnˈdʒɛstʃən/","extraExplanation":["“ingestion”来自拉丁语词根（in- “进入” + gerere “携带/带来”），核心意思就是“把某物带进来”。在医学语境多指“摄入食物或药物”；在科技语境中常指“把数据导入系统”。"]}
{"word":"ingestion-related","summary":{"en":"Related to taking something into the body (especially by eating, drinking, or swallowing).","zh":"与摄入体内有关（尤指吃、喝、吞咽）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with taking something into the body, especially eating, drinking, or swallowing (and sometimes absorbing information or substances).","zh":"与“摄入”有关的，尤指吃、喝、吞咽（有时也指吸收信息或物质）。"},"examples":[{"en":"The report focused on ingestion-related illnesses caused by contaminated water.","zh":"这份报告聚焦于受污染水源引起的摄入相关疾病。"},{"en":"Read the label for ingestion-related warnings before using the product.","zh":"使用该产品前请阅读与摄入相关的警示信息。"}]}],"synonyms":["intake-related","oral","swallowing-related","consumption-related"],"phonetic":"/ɪnˈdʒɛs.tʃən rɪˈleɪ.tɪd/","extraExplanation":["常见使用场景：医学（ingestion-related symptoms/illness）、毒理学（ingestion-related exposure）、产品说明（ingestion-related hazards/warnings）。","与 digestion-related（消化相关）区别：ingestion 指“入口/吞下”的动作或过程；digestion 指“在胃肠中分解消化”的过程。"],"etymology":"由 ingestion（“摄入”，来自拉丁语 in- “进入” + gerere “携带/带来”，引申为“带入体内”）+ related（“相关的”）组合而成的复合形容词，常用于医学、毒理学与安全说明中。","mnemonic":["把 ingestion 记成“in（进）+ gest（带/携）→ 把东西带进身体里＝摄入”。所以 ingestion-related 就是“跟摄入有关的”。","联想中文搭配：看到 related 就想到“相关”；ingestion-related ≈ “摄入相关”。"]}
{"word":"ingestive","summary":{"en":"Ingestive means “related to taking substances into the body,” especially eating and drinking.","zh":"ingestive 意为“与摄入体内有关的”，常指进食、饮水等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to ingestion—the act of taking food, drink, or another substance into the body (usually through the mouth).","zh":"与“摄入/吞入”有关的；指把食物、饮料或其他物质（通常经口）进入体内的。"},"examples":[{"en":"Ingestive behavior includes eating, drinking, and swallowing.","zh":"摄入性行为包括进食、饮水和吞咽。"},{"en":"The study focused on ingestive patterns in children, such as how often they snack.","zh":"这项研究关注儿童的摄入模式，例如他们吃零食的频率。"}]}],"synonyms":["ingestion-related","dietary (context-dependent)","oral (in some medical contexts)"],"phonetic":"/ɪnˈdʒɛstɪv/","extraExplanation":["“ingestive”多见于医学、营养学、心理学与动物行为学语境（如“ingestive behavior 摄入行为”），日常英语里更常用“eating/drinking”或“dietary”。","词根提示：来自“ingest（摄入）+ -ive（构成形容词）”。理解为“与ingest有关的”即可。"]}
{"word":"ingests","summary":{"en":"“Ingests” means “takes in,” especially into the body (and sometimes information, in formal use).","zh":"“ingests”意为“摄入/吸收”，多指进入体内；正式用法也可指“吸收理解信息”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take something into the body (usually by swallowing, but also by breathing in or absorbing)","zh":"摄入（通常指吞咽进入体内，也可指吸入或吸收）"},"examples":[{"en":"She ingests her medicine with water every morning.","zh":"她每天早上用水吞服药物。"},{"en":"The body ingests nutrients from food and uses them for energy.","zh":"身体从食物中摄取营养，并将其用于提供能量。"},{"en":"In some workplaces, workers may ingest harmful dust if safety rules are ignored.","zh":"在一些工作场所，如果忽视安全规定，工人可能会摄入有害粉尘。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take in information or ideas and understand them (formal)","zh":"吸收并理解（信息或想法）（较正式）"},"examples":[{"en":"He ingests a lot of news every day, but tries to check reliable sources.","zh":"他每天吸收大量新闻，但会尽量核对可靠来源。"},{"en":"Give yourself time to ingest the new rules before the test.","zh":"在考试前给自己一些时间消化这些新规则。"}]}],"synonyms":["takes in","consumes","swallows","absorbs","intakes"],"phonetic":"/ɪnˈdʒɛsts/","extraExplanation":["“ingests”是动词“ingest”的第三人称单数（he/she/it ingests）。这个词在医学、营养学、毒理学等语境中很常见，比“eat/drink”更正式、更偏“进入体内/摄入”的客观描述。"]}
{"word":"inghamite","summary":{"en":"Inghamite usually means someone from a place named Ingham; it can also mean a member of the historical English religious group called the Inghamites.","zh":"Inghamite通常指来自名为Ingham的地方的人；也可指历史上英格兰“英厄姆派（Inghamites）”这一宗教团体的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from a place called Ingham (for example, Ingham County in Michigan, USA, or Ingham in England); a local resident or native","zh":"英厄姆（Ingham）某地的人（如美国密歇根州英厄姆县，或英格兰的Ingham）；当地居民/本地人"},"examples":[{"en":"She’s an Inghamite who grew up near Lansing.","zh":"她是英厄姆县本地人，在兰辛附近长大。"},{"en":"Many Inghamites commute to nearby cities for work.","zh":"很多英厄姆当地人通勤到附近城市工作。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Inghamites, an 18th‑century English Christian group associated with Benjamin Ingham","zh":"英厄姆派（Inghamites）成员：18世纪英格兰的一个基督教团体，与本杰明·英厄姆（Benjamin Ingham）有关"},"examples":[{"en":"Some records mention Inghamites meeting in small house gatherings.","zh":"一些史料提到英厄姆派在小型家庭聚会中集会。"},{"en":"Benjamin Ingham’s followers were sometimes called Inghamites.","zh":"本杰明·英厄姆的追随者有时被称为英厄姆派。"}]}],"synonyms":["resident of Ingham (place-name demonym)","local (in Ingham)","member of the Inghamites"],"phonetic":"/ˈɪŋəmˌaɪt/","extraExplanation":["“Inghamite”既可作地名的居民称呼（demonym），也可指历史上的宗教群体。“Inghamites”多见于18世纪英国宗教史语境，和卫斯理派/福音复兴运动有交集；在现代日常英语里更常见的是“某地居民”的用法（若当地确实使用这个称呼）。"]}
{"word":"inghilois","summary":{"en":"“Inghilois” is an archaic/nonstandard spelling meaning “English.”","zh":"“Inghilois”是“English（英语/英格兰的）”的一种古拼写/非标准拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/archaic spelling) English; relating to England, its people, or the English language.","zh":"（非标准/古拼写）English（英语/英格兰的）；与英格兰、英国人或英语有关的。"},"examples":[{"en":"In some medieval texts, you may see spellings like “Inghilois” for what we call “English” today.","zh":"在一些中世纪文本里，你可能会看到用“Inghilois”来表示今天我们说的“English（英语/英格兰的）”。"},{"en":"The manuscript describes the story in “Inghilois,” meaning it is written in English.","zh":"手稿说这段故事是用“Inghilois”写的，意思就是用英语写的。"}]},{"partOfSpeech":"n.","definition":{"en":"English (the language).","zh":"英语（这门语言）。"},"examples":[{"en":"She speaks English at work.","zh":"她在工作中说英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"From or connected with England; English-speaking.","zh":"英格兰的；与英格兰有关的；讲英语的。"},"examples":[{"en":"an English accent","zh":"英式口音"},{"en":"English literature","zh":"英国文学"}]}],"synonyms":["English","British (sometimes, but not always equivalent)"],"phonetic":"/ˈɪŋɡlɪʃ/","extraExplanation":["“Inghilois”不是现代英语里的常用拼写，更常见于中古时期或仿古写法中，接近古法语/盎格鲁-诺曼语里的“Englois/Angleis”（意为“英国的/英语的”）。如果你是在某段古文、歌词、家谱或手稿里看到它，通常可以按现代的“English”来理解。"]}
{"word":"ingine","summary":{"en":"“Ingine” is usually a misspelling of “engine,” meaning a machine that provides power (especially in vehicles) or a computing system like a search engine.","zh":"“ingine”通常是“engine”的拼写错误，意思是（车辆等的）发动机/引擎，也可指（计算机的）搜索引擎等系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “engine”) A machine that uses power (such as fuel, electricity, or steam) to make something move or work, especially in a vehicle.","zh":"（通常拼作“engine”）发动机；引擎：利用燃料、电力或蒸汽等动力让东西运转或移动的机器，尤指车辆中的动力装置。"},"examples":[{"en":"The car’s engine wouldn’t start on a cold morning.","zh":"在寒冷的早晨，这辆车的发动机发动不起来。"},{"en":"A jet engine produces thrust to push the plane forward.","zh":"喷气发动机产生推力，使飞机向前飞行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A system or program that processes information to produce results (for example, a search engine).","zh":"（计算机）引擎：处理信息并输出结果的系统或程序（如搜索引擎）。"},"examples":[{"en":"This website uses a powerful search engine.","zh":"这个网站使用了强大的搜索引擎。"},{"en":"The game engine controls graphics and physics.","zh":"游戏引擎控制画面和物理效果。"}]}],"synonyms":["motor","machine","power plant","search engine"],"phonetic":"ˈɛn.dʒɪn","extraExplanation":["“ingine”通常被认为是拼写错误；标准拼写是“engine”。发音为 /ˈɛn.dʒɪn/，注意中间的音是类似“j”的 /dʒ/，不是 /g/。","在日常英语里，“engine”既指真实的机械发动机，也常引申为“推动某事的力量/机制”（如 search engine、game engine）。"]}
{"word":"ingirt","summary":{"en":"“Ingirt” is a literary/old-fashioned word meaning “surrounded/encircled,” or “to surround.”","zh":"“ingirt”是文学/古语用词，表示“被环绕/被围住”，也可作动词表示“环绕、围住”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary/archaic) surrounded or encircled (as if by a belt or ring).","zh":"（文学/古语）被环绕的；被围住的（像被腰带或圈子围起）。"},"examples":[{"en":"The town lay ingirt by hills on every side.","zh":"那座小镇四面群山环绕。"},{"en":"A garden ingirt with tall walls felt quiet and safe.","zh":"一座被高墙围起的花园让人觉得安静又安全。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Literary/archaic) to surround; to encircle; to gird around.","zh":"（文学/古语）环绕；围住；束在周围。"},"examples":[{"en":"A stone wall ingirt the old orchard.","zh":"一堵石墙围住了那片老果园。"},{"en":"Mist ingirt the valley at dawn.","zh":"黎明时分，薄雾笼罩着山谷。"}]}],"synonyms":["surrounded","encircled","girded","ringed","enclosed"],"phonetic":"/ɪnˈɡɝt/","extraExplanation":["“ingirt”由前缀 in-（使……处于某种状态/包围之中）+ “girt/gird”（束紧、围住）构成，多见于诗歌或较老的英语文本；现代英语更常用 “surrounded / encircled / girded (by/with)”。","在文学描写中，它常用来营造画面感（如城镇被群山“环抱”、花园被高墙“圈起”），语气比日常的 “surrounded” 更古典、更诗意。"]}
{"word":"ingiver","summary":{"en":"“Ingiver” is a rare word meaning a giver or instiller—someone/something that puts ideas, feelings, or qualities into others.","zh":"“Ingiver”很少见，指给予者/灌输者——把想法、情感或特质带给他人的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) A person or thing that gives, puts in, or instills something (especially an idea, feeling, or quality) into someone.","zh":"（罕见/古旧）给予者；灌输者；把某种东西（尤指想法、情感或特质）“注入”他人心中的人或事物。"},"examples":[{"en":"Good teachers can be ingivers of confidence as well as knowledge.","zh":"好老师不仅传授知识，也能灌输自信。"},{"en":"Some writers describe art as an ingiver of hope during hard times.","zh":"有些作家把艺术描述为困境中的希望给予者。"}]}],"synonyms":["instiller","source","giver","provider"],"phonetic":"/ˈɪnˌɡɪvər/","extraExplanation":["“ingiver”在现代英语中非常少见，很多时候人们更常用的说法是“someone/something that instills …（灌输……的人/事）”“a giver of …（……的给予者）”或“source of …（……的来源）”。","如果你原本想表达“屈服的人/让步的人”，更常见的表达是“one who gives in”或名词“a giver-in（很少用）”。也可能是拼写误差：如“engraver（雕刻师）”“injurer（伤害者）”等。你可以告诉我你的句子语境，我可以帮你确定想要的词。"]}
{"word":"ingiving","summary":{"en":"“Ingiving” is not standard; it usually means “in giving” or is a misspelling of “ungiving.”","zh":"“ingiving”不是标准用词；通常是“in giving”的连写或“ungiving”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word; most often it is a typo or a spacing issue (usually meaning “in giving”), or a mistaken form of “ungiving” (harsh, not forgiving).","zh":"不是现代英语中的标准单词；多见于拼写错误或漏空格（通常指“in giving”＝“在给予/给出时”），也可能是把“ungiving”（冷酷的、不宽容的）写错了。"},"examples":[{"en":"I think you meant “in giving,” as in: In giving feedback, be kind but clear.","zh":"我觉得你想写的是“in giving”，例如：在给反馈时，要友善但清晰。"},{"en":"If you meant “ungiving,” you could say: The desert sun was ungiving.","zh":"如果你想写“ungiving”，可以说：沙漠的太阳毫不留情。"}]}],"synonyms":["in giving","ungiving","unforgiving"],"phonetic":"/ɪnˈɡɪvɪŋ/","extraExplanation":["“ingiving”几乎不会作为一个独立词出现在规范英语里。常见情况：1）把短语“in giving”（在给予/提供……时）连写了；2）把形容词“ungiving”（严酷的、冷漠的、不会原谅/不宽容的）误拼了。","如果你把它当作“in giving”来用，记得通常要分开写；如果你想表达“严酷、不留情面”，更地道的词是“ungiving / unforgiving”。"]}
{"word":"ingle","summary":{"en":"“Ingle” is an old-fashioned word meaning a fireplace or hearth, often used in literary contexts to evoke warmth and home.","zh":"“Ingle”是较古旧的词，指壁炉或炉边，常见于文学语境，用来营造温暖与家的意象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fireplace or hearth; sometimes used to mean the fire burning there","zh":"壁炉；炉边（有时也指炉火）"},"examples":[{"en":"They sat by the ingle and talked until midnight.","zh":"他们坐在炉边聊到半夜。"},{"en":"In old poems, “ingle” often suggests warmth and home.","zh":"在一些古诗里，“ingle”常用来表达温暖与家的感觉。"}]}],"synonyms":["hearth","fireplace"],"phonetic":"/ˈɪŋɡəl/","extraExplanation":["“ingle”是比较古旧、带文学色彩的词，在现代英语里不常用。日常更常说：fireplace（壁炉）、hearth（炉边/炉台）。","它在苏格兰英语与旧文学作品中更常见，常用来营造“家、温暖、团聚”的意象。","如果你本来想查的是更常见的“single”（单个的；单身的），告诉我我可以另做一个词条。"]}
{"word":"inglenook","summary":{"en":"Inglenook means a warm, cozy corner around a fireplace, often recessed and sometimes with seating.","zh":"Inglenook 指壁炉旁（或壁炉凹位内）的温暖、舒适小角落，常带座位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, cozy corner by a fireplace (or built-in bench area) that feels warm and sheltered.","zh":"（壁炉旁的）小而温馨的角落；（常带壁炉长凳的）暖和、隐蔽的壁炉角"},"examples":[{"en":"They sat in the inglenook and read stories while the fire crackled.","zh":"他们坐在壁炉角里，听着柴火噼啪作响读故事。"},{"en":"The old cottage had an inglenook big enough for two chairs.","zh":"那间老乡村小屋有个壁炉角，大到能放下两把椅子。"}]},{"partOfSpeech":"n.","definition":{"en":"A design feature in traditional houses: the recessed area around a fireplace, sometimes with seating, meant to keep people close to the heat.","zh":"（传统住宅的）壁炉凹进去的一块区域；常带座位，用来让人靠近火源取暖的空间设计"},"examples":[{"en":"The renovation preserved the original inglenook fireplace.","zh":"这次翻修保留了原来的壁炉凹位式壁炉。"},{"en":"In period dramas, families often gather around the inglenook in the evening.","zh":"在年代剧里，一家人晚上常常围在壁炉角旁。"}]}],"synonyms":["fireside nook","fireplace corner","hearthside corner"],"phonetic":"/ˈɪŋɡəlˌnʊk/","extraExplanation":["“Inglenook”多见于英式语境，带有一种“乡村、古老、温暖”的文化意象，常出现在描写小屋（cottage）、客厅（parlor）或传统壁炉生活的文字里。","词源上，ingle（旧词，指火或炉火）+ nook（角落），因此字面意思就是“炉火旁的角落”。"]}
{"word":"inglenooks","summary":{"en":"Inglenooks are cozy corners by a fireplace, often a warm, sheltered spot for sitting.","zh":"Inglenooks 指壁炉旁温暖、隐蔽的舒适角落，常用于坐卧取暖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cozy corner or recess by a fireplace (often with a built-in seat); a snug nook","zh":"壁炉旁的舒适角落（常带内置座位）；温暖的小角落"},"examples":[{"en":"They read quietly in the inglenook beside the fire.","zh":"他们在壁炉旁的壁炉角里安静地读书。"},{"en":"The old cottage had an inglenook where guests could warm up after a walk.","zh":"那间老小屋有个壁炉角，客人散步回来可以在那里取暖。"}]}],"synonyms":["nook","cozy corner","fireside nook","hearthside corner"],"phonetic":"/ˈɪŋɡəlˌnʊk/","extraExplanation":["“Inglenook”主要见于英式英语与文学/怀旧语境，常用来描写乡间小屋（cottage）里壁炉旁的“暖角”。其中“ingle-”与“火/炉火”有关，“nook”是“角落”。在现代美式日常口语里较少见，更常用“cozy corner by the fireplace”。"]}
{"word":"ingles","summary":{"en":"English means the English language, or something related to England or the English language.","zh":"English 指“英语（这门语言）”，也可指“与英格兰或英语有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the English language","zh":"英语（这门语言）"},"examples":[{"en":"I’m studying English for work.","zh":"我为了工作在学英语。"},{"en":"Do you speak English?","zh":"你会说英语吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to England, its people, or the English language","zh":"英格兰的；英格兰人的；英语的"},"examples":[{"en":"She loves English literature.","zh":"她喜欢英国文学。"},{"en":"We had an English teacher from London.","zh":"我们有一位来自伦敦的英语老师。"}]}],"synonyms":["(language) English","(adj.) British (sometimes, but not always the same)"],"phonetic":"/ˈɪŋɡlɪʃ/","extraExplanation":["“ingles”常见于西班牙语/葡萄牙语里，标准写法通常是带重音的“inglés”（西语）或“inglês”（葡语），意思是“英语/英国（或英格兰）的”。在英语里对应的词是“English”。"]}
{"word":"inglesa","summary":{"en":"“inglesa” is Spanish for “English” (feminine) and can also mean “an Englishwoman.”","zh":"“inglesa”是西班牙语，表示“英国的/英语的”（阴性），也可指“英国女人/英格兰女性”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish, feminine) English; from England/the English language or culture.","zh":"（西班牙语，阴性）英格兰的；英语的；与英格兰/英语文化有关的。"},"examples":[{"en":"Ella es profesora inglesa.","zh":"她是一位英国女老师。"},{"en":"Estoy leyendo una novela inglesa.","zh":"我正在读一本英国小说。"},{"en":"La comida inglesa es muy distinta a la mexicana.","zh":"英国菜和墨西哥菜很不一样。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) an Englishwoman; a woman from England (sometimes used more broadly for a British woman, depending on context).","zh":"（西班牙语）英国女子；英格兰女性（有时语境中也泛指英国女性）。"},"examples":[{"en":"Conocí a una inglesa en el museo.","zh":"我在博物馆认识了一位英国女士。"},{"en":"La inglesa habló en español con mucha fluidez.","zh":"那位英国女士西班牙语说得很流利。"}]}],"synonyms":["británica","de Inglaterra"],"phonetic":"/inˈɡlesə/","extraExplanation":["“inglesa”是西班牙语形容词/名词的阴性形式：阳性是“inglés”。复数分别是“inglesas / ingleses”。","在西语里说“英语（这门语言）”通常用名词“inglés”（如：Hablo inglés. 我会说英语）。若说“英文的/英语的书”，可用形容词：un libro inglés / una novela inglesa。","“inglesa”严格来说指“英格兰的/英格兰人（女性）”。如果你想明确表达“英国的/英国人”，也常见“británica / británico”。"]}
{"word":"ingleside","summary":{"en":"Ingleside is a proper name, usually a place name, and is also well known as a fictional home in the Anne of Green Gables series.","zh":"Ingleside 通常是专有地名；在文学中也因《绿山墙的安妮》系列（《Anne of Ingleside》）而广为人知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for towns, neighborhoods, or estates called “Ingleside.”","zh":"（专有名词）地名：“Ingleside”，可指名为 Ingleside 的城镇、社区或庄园/宅邸。"},"examples":[{"en":"She grew up in Ingleside, a small community near the coast.","zh":"她在一个靠近海岸、名为 Ingleside 的小社区长大。"},{"en":"We stopped for lunch in Ingleside on our road trip.","zh":"我们自驾途中在 Ingleside 停下来吃午饭。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a fictional home/community in literature, especially in the “Anne of Green Gables” series (“Anne of Ingleside”).","zh":"（文学用法）小说中的住所/社区名，尤指《绿山墙的安妮》系列中的 “Ingleside”（如《安妮的英格尔赛德》/《Anne of Ingleside》）。"},"examples":[{"en":"In the novel, Ingleside is the home Anne shares with her family.","zh":"在小说里，Ingleside 是安妮与家人共同生活的家。"},{"en":"Many readers remember the warm domestic scenes set at Ingleside.","zh":"许多读者都记得故事发生在 Ingleside 的温馨家庭场景。"}]}],"synonyms":["(place-name; no direct synonym)","hillside (similar feel, not the same meaning)"],"phonetic":"/ˈɪŋɡəlˌsaɪd/","extraExplanation":["“Ingleside”常被理解为“English side/英国一侧”的感觉，但在现实中它多作为地名使用，不一定有固定、统一的词源解释。","文学上最有名的用例来自露西·莫德·蒙哥马利（L. M. Montgomery）的《绿山墙的安妮》系列之一《Anne of Ingleside》，因此很多读者一看到这个词会联想到安妮婚后的家庭生活。"]}
{"word":"inglobate","summary":{"en":"“Inglobate” is a formal verb meaning to combine or incorporate things into one whole.","zh":"“inglobate”是较正式的动词，表示把事物合并、纳入并形成一个整体。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To gather or combine into one whole; to make into a single mass or group.","zh":"把……合并成一个整体；使……聚合成一团或一组。"},"examples":[{"en":"The smaller teams were inglobated into one department.","zh":"较小的团队被合并成一个部门。"},{"en":"Over time, the village was inglobated into the growing city.","zh":"随着时间推移，这个村庄被并入了不断扩张的城市。"}]},{"partOfSpeech":"vt.","definition":{"en":"To take in; to absorb or incorporate (often used in formal or scientific writing).","zh":"吸收；纳入（常见于较正式或科学语境）。"},"examples":[{"en":"The new policy inglobates several earlier rules.","zh":"新政策纳入了几条早先的规定。"},{"en":"This model inglobates data from multiple sources.","zh":"这个模型整合了多个来源的数据。"}]}],"synonyms":["incorporate","integrate","combine","merge","absorb","unite"],"phonetic":"/ɪnˈɡloʊ.beɪt/","extraExplanation":["“inglobate”比较少见，常见于较正式的写作或学术语境。日常英语里更常用的替代表达有：incorporate（纳入/并入）、integrate（整合）、combine（合并）、merge（合并）、absorb（吸收/并入）。","词源上与“globe（球体/整体）”有关，带有“形成一个整体、包在一起”的感觉，因此常用来表示“把分散的部分聚成一个整体”。"]}
{"word":"inglobe","summary":{"en":"Englobe means to include or encompass something within a larger whole.","zh":"Englobe 指“把……纳入整体之中；涵盖/包围”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to include something as part of a whole; to encompass or surround","zh":"把……包括在内；包围；涵盖"},"examples":[{"en":"The new policy englobe(s) both remote and in-office workers.","zh":"新政策涵盖了远程员工和办公室员工。"},{"en":"Her responsibilities englobe budgeting, hiring, and training.","zh":"她的职责包括预算、招聘和培训。"},{"en":"A thick wall seemed to englobe the old garden.","zh":"一堵厚墙似乎把老花园围了起来。"}]}],"synonyms":["include","encompass","cover","embrace","contain"],"phonetic":"/ɛnˈɡloʊb/","extraExplanation":["“englobe”在现代英语里比较少见，更常用的替代词是“include / encompass / cover”。在学术或正式写作中偶尔会出现，意思接近“把许多部分纳入一个整体”。","词源上与法语“englober”有关，因此在语气上常带一点“整体包住/统摄”的感觉，而不仅仅是简单“包含”。"]}
{"word":"inglobed","summary":{"en":"Inglobed means completely enclosed or enveloped; it can also be the past participle of “inglobe,” meaning to enclose or include fully.","zh":"inglobed 指“被完全包住/包围”的（偏文学）；也可作动词 inglobe 的过去分词，表示“把……完全包住或纳入”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often literary) Enclosed, surrounded, or wrapped up as if inside a globe or shell; completely enveloped.","zh":"（常见于文学用语）被包住的；被包围的；仿佛置于球体或外壳之中，完全被裹住。"},"examples":[{"en":"The island sat inglobed in mist, as if sealed inside a pale glass sphere.","zh":"小岛被雾气包围，仿佛封存在一只淡色的玻璃球里。"},{"en":"Her voice sounded inglobed in the scarf, soft and muffled.","zh":"她的声音像是被围巾裹住了，柔和而含混。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “inglobe”: to enclose, surround, or include completely.","zh":"“inglobe”的过去分词：把……包住；围住；完全包含在内。"},"examples":[{"en":"Dark clouds inglobed the moon, and the road vanished into shadow.","zh":"乌云把月亮遮得严严实实，路也隐没在阴影里。"},{"en":"The report inglobed several smaller studies into one overview.","zh":"这份报告把几项较小的研究整合进一个总览中。"}]}],"synonyms":["enveloped","surrounded","enclosed","encased","shrouded","contained"],"phonetic":"/ɪnˈɡloʊbd/","extraExplanation":["“inglobed/inglobe”属于偏古雅或诗性用词，现代英语中更常用 enveloped（包裹）、surrounded（包围）、enclosed（封闭）、included/contained（包含）。在文学描写里，它常用来制造“被整体包覆、像置于球体之中”的画面感。"]}
{"word":"inglobing","summary":{"en":"“Inglobing” is usually a misspelling of “englobing,” meaning including or enclosing something completely.","zh":"“inglobing”通常是“englobing”的误拼，意思是“把……整体包括在内/完全包围”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(usually spelled “englobing”) including or enclosing something as a whole; surrounding and taking it in.","zh":"（通常拼作“englobing”）把……整体包括在内；包围并纳入其中。"},"examples":[{"en":"The report focuses on climate change, englobing issues like energy, transport, and agriculture.","zh":"这份报告聚焦气候变化，涵盖能源、交通和农业等议题。"},{"en":"A single policy risks englobing many different communities with different needs.","zh":"一项单一政策可能会把许多需求不同的群体一并纳入。"}]},{"partOfSpeech":"vt.","definition":{"en":"present participle of “englob” (a formal/rare verb): to include, contain, or surround completely.","zh":"“englob”的现在分词（较正式/较少见的动词）：把……包括进去；容纳；完全包围。"},"examples":[{"en":"The bay englobes several small islands.","zh":"这个海湾环抱着几座小岛。"},{"en":"Her job englobes planning, teaching, and community outreach.","zh":"她的工作包括规划、教学和社区推广。"}]}],"synonyms":["including","encompassing","covering","containing","embracing"],"phonetic":"/ɛnˈɡloʊbɪŋ/","extraExplanation":["“inglobing”本身非常少见，多数情况下是把“englobing”拼错了。写作中更常用的替代词有：including / encompassing / covering / containing。","“englob-”来自法语/拉丁语词根，和“globe（球体/全球）”有联系，语感上有“把东西圈进一个整体里”的意思。"]}
{"word":"inglorious","summary":{"en":"Inglorious describes something that lacks honor or fame—often a shameful defeat or an unnoticed, uncelebrated role.","zh":"inglorious 用来形容“没有荣耀/名声”的事物，常指不光彩的失败，也可指默默无闻、不被称颂的角色或工作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not famous, honorable, or admired; shameful or disappointing.","zh":"不光彩的；不值得称赞的；可耻的或令人失望的。"},"examples":[{"en":"They suffered an inglorious defeat in the final game.","zh":"他们在最后一场比赛中遭遇了一场不光彩的惨败。"},{"en":"He left the company in an inglorious way, after a public scandal.","zh":"在公开丑闻之后，他以一种不光彩的方式离开了公司。"},{"en":"The plan ended in inglorious failure.","zh":"这个计划以不光彩的失败告终。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without glory or recognition; humble and unnoticed.","zh":"没有荣耀或认可的；平凡不显眼的。"},"examples":[{"en":"Many workers do the inglorious tasks that keep a city running.","zh":"许多工人做着不显眼却维系城市运转的工作。"},{"en":"She spent years in inglorious service, rarely receiving thanks.","zh":"她多年默默服务，很少得到感谢。"}]}],"synonyms":["shameful","dishonorable","disgraceful","unheroic","uncelebrated","unsung"],"phonetic":"/ɪnˈɡlɔriəs/","extraExplanation":["词源提示：in- 表示“否定/没有”，glorious 表示“光荣的”，所以 inglorious 字面意思就是“没有光荣的”。在新闻与评论写作中，它常用来形容“丢脸的失败”或“并不值得骄傲的结局”。","用法区别：glorious 更偏“辉煌、值得赞美”，而 inglorious 常带负面评价（可耻/丢人），但在某些语境也可较中性，指“默默无闻、不被看见”。"]}
{"word":"ingloriously","summary":{"en":"In a shameful or undistinguished way; without glory or honor.","zh":"以可耻或不显赫的方式；没有光荣或荣誉地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is shameful, embarrassing, or not worthy of respect.","zh":"以可耻的、丢脸的、令人不尊敬的方式。"},"examples":[{"en":"The team lost ingloriously in the final minutes of the game.","zh":"球队在比赛最后几分钟丢脸地输了。"},{"en":"He was dismissed ingloriously after the scandal became public.","zh":"丑闻公开后，他很不光彩地被解雇了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that lacks glory, honor, or success; without distinction.","zh":"以不显赫、无荣誉或无成就的方式；平淡无名地。"},"examples":[{"en":"After years of hard work, the project ended ingloriously, with little to show for it.","zh":"辛苦多年后，这个项目平淡收场，几乎没有成果可展示。"},{"en":"Many small businesses close ingloriously, quietly disappearing from the street.","zh":"许多小企业默默无闻地倒闭，悄悄从街上消失。"}]}],"synonyms":["shamefully","disgracefully","ignominiously","dishonorably","without distinction"],"phonetic":"/ɪnˈɡlɔriəsli/","extraExplanation":["“ingloriously”来自 in-（否定前缀）+ glorious（光荣的）。它常用来评价失败或结局的“难看/不体面”，语气比 simply “badly” 更带有道德或名誉上的批评。","语用提示：如果只是“表现不好”，用 “poorly/badly”；如果强调“丢脸、名声受损或不光彩的结局”，用 “ingloriously” 更贴切。"]}
{"word":"ingloriousness","summary":{"en":"Ingloriousness means the state of lacking glory or honor—being obscure, uncelebrated, or even shameful.","zh":"ingloriousness 指“缺乏荣耀/名声”的状态，可表示默默无闻，也可带“可耻、不光彩”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of lacking honor, fame, or admirable achievement; obscurity or shame.","zh":"缺乏荣耀、名声或令人敬佩成就的状态；默默无闻或可耻。"},"examples":[{"en":"He feared the ingloriousness of being forgotten after all his hard work.","zh":"他害怕自己辛苦付出后仍会被遗忘的那种不光彩与默默无闻。"},{"en":"The novel contrasts public glory with the ingloriousness of everyday survival.","zh":"这部小说将公众的荣光与日常求生的平凡（甚至不体面）形成对比。"}]}],"synonyms":["obscurity","dishonor","shame","ignominy","humiliation"],"phonetic":"/ɪnˈɡlɔriəsnəs/","extraExplanation":["“ingloriousness”来自形容词“inglorious”（不光彩的、无名的）+ 名词后缀“-ness”（表示“……的状态/性质”）。常用于较正式或文学性的语境，用来强调“没有荣耀/不值得称道”的感觉。","它有时带有道德评判（可耻、丢脸），有时只是强调“无名、没有被看见”（not celebrated）。需要根据上下文判断语气。"]}
{"word":"inglu","summary":{"en":"“Inglu” is usually a misspelling of igloo/iglu: a dome-shaped shelter, traditionally a snow house used by Inuit people.","zh":"“inglu”通常是 igloo/iglu 的误拼：指圆顶状住处，传统上是因纽特人建造的雪屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled iglu) A dome-shaped snow house traditionally built by Inuit people as a temporary shelter.","zh":"（也写作 iglu）一种圆顶状的雪屋，传统上由因纽特人建造，用作临时住所/避难所。"},"examples":[{"en":"We learned how an iglu (igloo) can stay warm inside even when it’s freezing outside.","zh":"我们学到即使外面很冷，iglu（雪屋）里面也能保持温暖。"},{"en":"In the museum, there was a model of an Inuit iglu.","zh":"在博物馆里，有一个因纽特人雪屋的模型。"}]},{"partOfSpeech":"n.","definition":{"en":"A small dome-shaped shelter (not necessarily made of snow), sometimes used as a general term for a simple hut or tent-like structure.","zh":"一种小型圆顶状的简易住处（不一定用雪做），有时泛指简陋的小屋或帐篷式结构。"},"examples":[{"en":"The winter festival set up modern “igloo” tents for visitors.","zh":"冬季节日为游客搭建了现代的“雪屋”帐篷。"}]}],"synonyms":["snow house","shelter","hut"],"phonetic":"/ˈɪɡluː/","extraExplanation":["“inglu”更常见的标准拼写是“igloo”，也可见“iglu”。这个词来自因纽特语（Inuktitut）中表示“房子/住所”的词，后来进入英语。","文化提示：并非所有因纽特人都住在雪屋；igloo/iglu 多用于特定地区与季节的临时避寒。"]}
{"word":"inglut","summary":{"en":"“Inglut” is a rare/archaic verb meaning “to swallow.”","zh":"“inglut”是一个罕见/古语动词，意思是“吞下、咽下”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) To swallow; to take something down the throat.","zh":"（罕见/古语）吞下；咽下。"},"examples":[{"en":"The child tried to inglut the bitter medicine quickly.","zh":"孩子想把苦药赶紧吞下去。"},{"en":"He could hardly inglut a single bite because of his sore throat.","zh":"因为喉咙痛，他几乎咽不下一口。"}]}],"synonyms":["swallow","gulp","ingest"],"phonetic":"/ɪnˈɡlʌt/","extraExplanation":["“inglut”在现代英语中几乎不用，多见于古旧文本或词源/医学拉丁语相关的讨论；日常更常用的词是“swallow”“gulp”“ingest”。","它与拉丁语词根有关，含义围绕“吞咽”。在阅读古文或诗歌时见到它，可以直接按“swallow（吞下）”理解。"]}
{"word":"inglutition","summary":{"en":"A formal/medical word meaning “swallowing.”","zh":"较正式/医学用词，意思是“吞咽”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of swallowing food, drink, or saliva","zh":"吞咽；咽下（食物、饮料或唾液的动作）"},"examples":[{"en":"After the surgery, the doctor checked her ability for safe inglutition.","zh":"手术后，医生检查她是否能安全吞咽。"},{"en":"Pain during inglutition can be a sign of a throat infection.","zh":"吞咽时疼痛可能是咽喉感染的迹象。"}]}],"synonyms":["swallowing","deglutition"],"phonetic":"/ˌɪnɡluˈtɪʃən/","extraExplanation":["这是一个比较正式、医学/生理学用词，日常英语更常用 swallowing（吞咽）。在医学语境里，你也可能看到相关词：deglutition（吞咽，和 inglutition 意思很接近）、dysphagia（吞咽困难）。","词源上来自拉丁语 in-（向内）+ glutire（吞下），因此带有“吞入体内”的含义。"]}
{"word":"ingluvial","summary":{"en":"“Ingluvial” means “related to a bird’s crop (food-storage pouch in the throat).”","zh":"“ingluvial”意为“与鸟类嗉囊（喉部储食囊）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the crop (a pouch in a bird’s throat used to store and soften food) or to feeding through the crop.","zh":"与（鸟类）嗉囊有关的；指嗉囊这一储存并软化食物的囊袋，或指经由嗉囊进行的摄食/喂食。"},"examples":[{"en":"Some birds produce “crop milk,” an ingluvial secretion used to feed their young.","zh":"一些鸟类会分泌“嗉囊乳”，这是一种用于哺育幼鸟的嗉囊分泌物。"},{"en":"The veterinarian examined the bird for an ingluvial infection before prescribing treatment.","zh":"兽医在开具治疗方案前先检查这只鸟是否有嗉囊感染。"},{"en":"Researchers measured how long food stayed in the ingluvial pouch after feeding.","zh":"研究人员测量了进食后食物在嗉囊袋中停留的时间。"}]}],"synonyms":["crop-related","ingluvian"],"phonetic":"ɪnˈɡluviəl","extraExplanation":["“ingluvial”常见于动物学、鸟类学与兽医学语境，日常英语中很少使用。","词源来自拉丁语 ingluvies，意为“嗉囊/咽喉”。常见搭配有 ingluvial pouch（嗉囊袋）与 ingluvial secretion（嗉囊分泌物）。"]}
{"word":"ingluvian","summary":{"en":"related to a bird’s crop (food-storage pouch)","zh":"与鸟类嗉囊（食物储存囊）有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the crop (the food-storage pouch) in birds or some other animals.","zh":"与（鸟类等的）嗉囊有关的；嗉囊的。"},"examples":[{"en":"The veterinarian examined the bird’s ingluvian pouch for signs of infection.","zh":"兽医检查了这只鸟的嗉囊，看看是否有感染迹象。"},{"en":"Ingluvian disorders can affect how a bird stores and softens food before digestion.","zh":"嗉囊相关的疾病会影响鸟在消化前储存并软化食物的过程。"},{"en":"The paper describes ingluvian function in seed-eating species.","zh":"这篇论文描述了食籽鸟类嗉囊的功能。"}]}],"synonyms":["crop","crop-related","ingluvial","gular"],"phonetic":"/ɪnˈɡluːviən/","extraExplanation":["嗉囊（crop）是许多鸟类食道的一部分，用来暂存食物，有时也帮助软化食物；因此 ingluvian 多见于兽医学、解剖学与动物学语境。","日常英语里更常说 crop（嗉囊）或 crop-related；ingluvian 属于偏专业、较少见的形容词。"],"etymology":"源自拉丁语 inglūviēs / ingluvies（“嗉囊；喉部/食物囊”），词根与“吞咽、喉咙里的食物囊”相关；英语中以 -an 构成形容词，表示“与……有关的”。","mnemonic":["把它拆成 in + gluv：联想到“glue（胶水）把食物先‘黏’在一个袋子里”，就像嗉囊先储存食物。","记 ingluv- ≈ “in-glove（在手套里）”：食物先被“装进一个袋子里”，对应嗉囊的储存功能。"]}
{"word":"ingluvies","summary":{"en":"Ingluvies is a scientific term for a food-storage pouch (especially a bird’s crop/craw).","zh":"ingluvies 是科学用语，指用于储存食物的囊状结构，尤指鸟类的嗉囊（嗉子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology/Anatomy) the crop or “craw,” a pouch in a bird’s throat used to store and soften food before digestion.","zh":"（动物学/解剖）嗉囊（也叫“嗉子/嗉囊”），鸟类喉部的囊状结构，用来暂存并软化食物，之后再进入消化过程。"},"examples":[{"en":"The veterinarian checked the pigeon’s ingluvies for signs of blockage.","zh":"兽医检查了鸽子的嗉囊，看是否有阻塞迹象。"},{"en":"Seeds may sit in the ingluvies for a short time before moving into the stomach.","zh":"种子可能会在嗉囊里短暂停留，然后再进入胃部。"}]},{"partOfSpeech":"n.","definition":{"en":"(Entomology) a storage sac in the digestive tract of some insects, used for holding food.","zh":"（昆虫学）某些昆虫消化道中的贮食囊，用于暂时储存食物。"},"examples":[{"en":"In some insects, food is held in the ingluvies before further digestion.","zh":"在一些昆虫体内，食物会先储存在贮食囊中，再继续消化。"}]}],"synonyms":["crop (bird)","craw"],"phonetic":"/ɪnˈɡluːviːz/","extraExplanation":["“ingluvies”来自拉丁语，原意与“喉咙/贪食”相关，在现代英语中主要用于动物学或昆虫学等较专业的语境。日常英语更常说 bird’s crop 或 craw。","注意：它常被当作一个学术名词使用，即使形式上以 -s 结尾，也可能被当作单数或复数来用（取决于作者/学科习惯）。阅读文献时可根据动词单复数来判断。"]}
{"word":"ingluviitis","summary":{"en":"Ingluविiitis is inflammation of a bird’s crop.","zh":"ingluviitis 指鸟类嗉囊的炎症（嗉囊炎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the crop (the food-storage pouch) in birds.","zh":"鸟类嗉囊（储食囊）的炎症。"},"examples":[{"en":"The vet diagnosed the parrot with ingluviitis after noticing a swollen crop.","zh":"兽医发现鹦鹉的嗉囊肿胀后，诊断为嗉囊炎（ingluviitis）。"},{"en":"Poor hygiene and spoiled feed can increase the risk of ingluviitis in young chicks.","zh":"卫生条件差和变质饲料会增加雏鸡患嗉囊炎（ingluviitis）的风险。"}]}],"synonyms":["crop inflammation","ingluvitis"],"phonetic":"/ˌɪŋɡluːviˈaɪtɪs/","extraExplanation":["这是一个兽医学/鸟类医学中的罕见术语：crop 指鸟类颈部的“嗉囊”，用于暂存食物；-itis 是英语中常见的“炎症”后缀（如 tonsillitis 扁桃体炎）。","在实际交流中，兽医或饲养者也可能用更直白的说法，例如 “crop inflammation（嗉囊发炎）”，或使用拼写变体 “ingluvitis”。"]}
{"word":"ingluvious","summary":{"en":"“Inglorious” means not honorable or not celebrated; often used for shameful defeats or undignified endings.","zh":"“inglorious”指“不光彩的/不体面的”，也可指“无荣光、默默无名的”，常用来形容失败或不体面的结局。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bringing honor, praise, or pride; shameful or undignified.","zh":"不光彩的；不体面的；可耻的。"},"examples":[{"en":"It was an inglorious defeat, but the team learned a lot from it.","zh":"那是一场不光彩的失败，但球队从中学到了很多。"},{"en":"He left the company in an inglorious way after the scandal.","zh":"丑闻之后，他以不体面的方式离开了公司。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking glory or fame; not celebrated or famous.","zh":"无荣光的；不出名的；不受颂扬的。"},"examples":[{"en":"She worked in an inglorious job behind the scenes, but her role was essential.","zh":"她做着幕后不显眼的工作，但她的角色至关重要。"},{"en":"Most inventions begin with inglorious trial and error.","zh":"大多数发明都始于不那么光鲜的反复试错。"}]}],"synonyms":["shameful","disgraceful","undignified","uncelebrated","unheroic"],"phonetic":"/ɪnˈɡlɔriəs/","extraExplanation":["你输入的“ingluvious”不是常见英文单词；最接近、最常用的拼写是 **inglorious**。","词根提示：**in-**（不、非）+ **glory**（荣耀）→ “没有荣耀/不光彩”。","常见搭配：**inglorious defeat**（不光彩的失败）、**an inglorious end**（不体面的结局）。","文化用法：在新闻、历史或文学中常用来评价失败、丑闻或不体面的结局，语气偏负面，也可用于描述“默默无名但必要”的工作（较温和）。"]}
{"word":"ingluvitis","summary":{"en":"inflammation of a bird’s crop","zh":"鸟类嗉囊发炎"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of a bird’s crop (the pouch in the throat used to store and soften food).","zh":"（鸟类）嗉囊炎；嗉囊（储存并软化食物的喉部囊袋）发炎。"},"examples":[{"en":"The veterinarian diagnosed the chicken with ingluvitis after noticing swelling in the crop.","zh":"兽医发现鸡的嗉囊肿胀后，诊断为嗉囊炎。"},{"en":"Poor hygiene and spoiled feed can increase the risk of ingluvitis in backyard birds.","zh":"卫生条件差和变质饲料会增加后院饲养鸟类发生嗉囊炎的风险。"}]}],"synonyms":["crop inflammation","sour crop"],"phonetic":"/ˌɪnɡluˈvaɪtɪs/","extraExplanation":["嗉囊（crop）是许多鸟类在食管下段的“暂存袋”，会先把食物储存、浸软再进入胃。嗉囊炎可能与感染、霉变饲料、异物刺激或饲养管理不当有关。日常语境里有时也会听到 sour crop（嗉囊发酵/积食导致的“酸嗉囊”），但它不一定等同于严格意义上的嗉囊炎。"],"etymology":"源自拉丁语词根 ingluvies / ingluvia，意为“嗉囊、咽喉里的食物囊”，加上医学常用后缀 -itis（“炎症”），字面就是“嗉囊的炎症”。","mnemonic":["拆开记：-itis = “炎症”（如 tonsillitis 扁桃体炎），ingluv- ≈ “in gluv(ie)”联想“在喉咙的食物袋里”，合起来就是“嗉囊发炎”。"]}
{"word":"ingly","summary":{"en":"“-ingly” is a suffix used to make adverbs meaning “in a … way,” especially from -ing adjectives (e.g., charmingly).","zh":"“-ingly”是构词后缀，用来把词变成副词，表示“以……的方式”，常接在 -ing 形容词后（如 charmingly）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(suffix) Used to form adverbs meaning “in a … way,” often from adjectives ending in -ing (e.g., charming → charmingly).","zh":"（后缀）用于构成副词，表示“以……的方式/带有……的特点”，常接在以 -ing 结尾的形容词后（如 charming → charmingly）。"},"examples":[{"en":"She smiled charmingly at the guests.","zh":"她对客人迷人地微笑。"},{"en":"The child looked longingly at the toy.","zh":"孩子渴望地看着那个玩具。"},{"en":"He spoke jokingly, but his point was serious.","zh":"他开玩笑地说，但他的观点很认真。"}]},{"partOfSpeech":"other","definition":{"en":"(rare/standalone) A misspelling or incomplete form when someone intends to write an -ingly adverb (e.g., ‘surprisingly’).","zh":"（少见/单独出现）常见于拼写错误或没写完整的情况：本想写带 -ingly 的副词（如 surprisingly）。"},"examples":[{"en":"I think you meant ‘interestingly,’ not ‘ingly.’","zh":"我觉得你想写的是“interestingly”，不是“ingly”。"}]}],"synonyms":["-ly (as a general adverb-forming suffix)"],"phonetic":"ˈɪŋɡli","extraExplanation":["“-ingly”本质上不是一个独立单词，而是构词后缀：通常由“形容词词干 + -ly”构成副词。对于以 -ing 结尾的形容词（amusing, shocking, striking 等），加 -ly 后就得到 amusingly, shockingly, strikingly。","有些 -ingly 副词在语气上常带“说话者态度/评价”，如 Interestingly, Surprisingly, Strangely 等，常用于句首作评论：“Interestingly, … / Surprisingly, …”。"]}
{"word":"Ingmar","summary":{"en":"a Scandinavian male first name","zh":"斯堪的纳维亚地区的男性名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scandinavian male given name (first name), used especially in Sweden and nearby countries","zh":"一个斯堪的纳维亚地区的男性名字（名），在瑞典及周边国家较常见"},"examples":[{"en":"Ingmar is a common enough name in Sweden, though not everywhere.","zh":"Ingmar 在瑞典算是比较常见的名字，但在其他地方不一定常见。"},{"en":"Ingmar introduced himself and spelled his name for the receptionist.","zh":"Ingmar 自我介绍时还给前台拼读了自己的名字。"}]}],"phonetic":"/ˈɪŋmɑr/","extraExplanation":["在英语语境里，这个名字最为人熟知的联想之一是瑞典导演 Ingmar Bergman（英格玛·伯格曼）。因此在电影/艺术话题中看到它的概率更高。","发音要点：开头是 /ɪŋ/，像 sing 的结尾音；重音通常在第一音节。"],"etymology":"源自北欧人名：一般被解释为由古北欧/日耳曼元素 Ing-（与古代北欧的“英格/因格”相关的神名或部族名元素）+ -mar（常被解释为“著名/名声”一类含义的名字成分）组合而成。","mnemonic":["把它分成两段记：Ing + mar。mar 可以联想到“mark（名声/标记）”，帮助记住这是个名字。","发音联想：开头像“英(Ing-)”，整体听起来有点像“英格玛”，中文音译也能辅助记忆。"]}
{"word":"ingnue","summary":{"en":"An ingénue is a young, innocent, inexperienced woman—often a character type in movies or plays.","zh":"ingénue（常写作 ingenue）指天真、缺乏经验的年轻女子，常用于影视戏剧中的角色类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A young woman (or young actor) who seems innocent, sweet, and inexperienced; often a role type in theater/film.","zh":"（尤指戏剧/电影中的）天真纯洁、缺乏世故经验的年轻女子；也指扮演这类角色的女演员。"},"examples":[{"en":"She was cast as the ingénue in the romantic comedy.","zh":"她在那部浪漫喜剧中被选来饰演“天真少女”角色。"},{"en":"The director wanted an ingénue who felt natural, not overly polished.","zh":"导演想要一个感觉自然、不太“老练”的天真少女形象。"}]}],"synonyms":["naïf","innocent","young woman","girl next door"],"phonetic":"/ˈænʒənuː/","extraExplanation":["你输入的“ingnue”更常见的拼写是 **ingénue**（也常写作 **ingenue**）。这个词来自法语，原意与“天真、未受世故影响”有关。","在英语里它常用于“角色类型”（typecasting）：强调一种可爱、无辜、初入社会的气质。有时也可能带一点刻板印象或性别角色的意味，语境不同褒贬会变化。"]}
{"word":"ingoing","summary":{"en":"“Ingoing” means entering or moving inward; it’s often used in formal or paired contrast with “outgoing.”","zh":"“ingoing”表示“进入的/向内的”，多见于较正式语境，常与“outgoing（出去的）”成对使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Going in; entering a place or moving toward the inside.","zh":"进入的；向内的；进来的。"},"examples":[{"en":"The ingoing tide lifted the boats closer to the shore.","zh":"涨潮（向岸涌入的潮水）把船抬得更靠近岸边。"},{"en":"Please use the left door for ingoing traffic and the right door for outgoing traffic.","zh":"请走左边的门进入（进出分流），右边的门出去。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that goes in (less common); the act of entering.","zh":"（较少用）进入之物；进入的行为。"},"examples":[{"en":"The building has separate ingoings and outgoings to reduce crowding.","zh":"这栋楼把入口和出口分开，以减少拥挤。"}]}],"synonyms":["incoming","entering","inbound","inward","inflowing"],"phonetic":"/ˈɪnˌɡoʊ.ɪŋ/","extraExplanation":["“ingoing”在现代英语里不如“incoming/entering”常用，更常见于书面语、技术语境（如交通分流、潮汐/水流方向）或为了与“outgoing”成对使用。"]}
{"word":"ingoingness","summary":{"en":"“Ingoingness” is a rare noun meaning inward movement or inwardness (inner character).","zh":"“ingoingness”是很少见的名词，表示向内进入/向内的趋势，或事物的内在性（内在特质）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of going inward; inward movement or direction (literal or figurative)","zh":"向内进入的性质；向内的移动或方向（可指字面或比喻）"},"examples":[{"en":"The hallway’s ingoingness made the room feel quiet and private.","zh":"走廊那种“向内延伸”的感觉让房间显得安静而私密。"},{"en":"In meditation, she focused on the ingoingness of her attention rather than external noise.","zh":"在冥想中，她把注意力放在“向内收摄”的状态上，而不是外界的噪音。"}]},{"partOfSpeech":"n.","definition":{"en":"the inner character or “inwardness” of something; its internal nature","zh":"事物的内在特质；内在性（强调内部本质）"},"examples":[{"en":"The essay explores the ingoingness of the poem—what it feels like from the inside.","zh":"这篇文章探讨这首诗的“内在性”——从内部体验它是什么感觉。"},{"en":"He valued the ingoingness of kindness, not just public displays of it.","zh":"他看重善意的内在真实，而不只是公开的表现。"}]}],"synonyms":["inwardness","inner nature","interiority","inward movement"],"phonetic":"/ˈɪnˌɡoʊɪŋnəs/","extraExplanation":["“ingoingness”非常少见，更多时候人们会用更常见的词：inwardness（内在性）、inward movement（向内移动）、interiority（内在状态/内心世界，较书面）。","构词上是 ingoing（进入的、向内的）+ -ness（名词后缀，表示“……的性质/状态”）。因此它通常带一点“临时造词”或“修辞强调”的味道，常见于哲学、神学、文学评论等更书面的语境。"]}
{"word":"ingomar","summary":{"en":"Ingomar is mainly a male given name, often seen as a variant of the Scandinavian name Ingmar; it can also appear as a character or title name in older European works.","zh":"Ingomar 主要是男性名字，常被视为斯堪的纳维亚名字 Ingmar 的变体；也可能在较早的欧洲作品中作为人物名或标题名出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name (a variant spelling of Ingmar), used mainly in Scandinavian contexts","zh":"男性名字（Ingmar 的变体拼写），多见于斯堪的纳维亚语境"},"examples":[{"en":"Ingomar is a Swedish-sounding name, similar to Ingmar.","zh":"Ingomar 听起来很像瑞典名字，和 Ingmar 很接近。"},{"en":"We named our son Ingomar to honor his Scandinavian roots.","zh":"我们给儿子取名 Ingo­mar，以纪念他的斯堪的纳维亚血统。"}]},{"partOfSpeech":"other","definition":{"en":"a name used for characters or titles in older European literature and theater","zh":"在较早的欧洲文学与戏剧中用作人物名或作品名的名字"},"examples":[{"en":"The novel features a character named Ingomar, portrayed as a proud outsider.","zh":"小说里有个叫 Ingomar 的人物，被刻画成骄傲的局外人。"},{"en":"Ingomar appears in some older stage works as an exotic or “northern” figure.","zh":"在一些老戏剧作品里，Ingomar 常作为带有“北方/异域”气质的人物出现。"}]}],"synonyms":["Ingmar","Ingemar"],"phonetic":"ˈɪŋɡoʊˌmɑr","extraExplanation":["“Ingomar”通常被认为与北欧名字“Ingmar”相关：其中 Ing- 常被解释为与古北欧的神祇/祖先名（如 Ing/Yngvi）有关，-mar 在一些日耳曼名字中可与“著名、荣耀”之意相关。不同语言与改写作品中，拼写可能在 Ingmar / Ingomar / Ingemar 之间变化。","在英语环境里它多作为专有名词出现，因此一般不翻译；使用时注意首字母大写。若你是在某本书、电影或歌曲里看到该词，可以告诉我出处，我可以给你更准确的语境解释。"]}
{"word":"ingorge","summary":{"en":"Ingorge means to stuff or fill up—especially to eat greedily or to fill something until it’s packed.","zh":"Ingorge 指“塞满/灌满”，常用来表示“狼吞虎咽、暴食”或把某物填得很满。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fill (someone or something) with food or other material; to stuff or overfill","zh":"把（某人或某物）塞满；使充满（食物或其他东西）；填得过饱"},"examples":[{"en":"After the festival, the kids ingorged themselves on sweets.","zh":"节日过后，孩子们大吃糖果，吃得很撑。"},{"en":"The river ingorged the valley with muddy water after the storm.","zh":"暴风雨过后，河水把山谷灌满了浑浊的泥水。"}]},{"partOfSpeech":"vi.","definition":{"en":"to eat or drink greedily; to gorge oneself","zh":"狼吞虎咽地吃（喝）；暴食"},"examples":[{"en":"He ingorged at the buffet and felt sick later.","zh":"他在自助餐上暴吃一顿，后来觉得不舒服。"},{"en":"Some animals ingorge before winter to store fat.","zh":"有些动物会在冬天前暴食来储存脂肪。"}]}],"synonyms":["gorge","stuff","cram","devour","engorge"],"phonetic":"/ɪnˈɡɔrdʒ/","extraExplanation":["“ingorge”在现代英语中比较少见，更多时候人们直接用更常见的“gorge (oneself) (on…)”（暴食/大吃）或“stuff”（塞满）。","词形上，“in-”有“使进入/使处于……”的感觉，结合“gorge”（吞咽、塞满）就形成“使（自己或某物）塞得很满/吃得很撑”的意思。","在描写性较强的文学或较正式的语境里，“ingorge”有时用来强调“填满、灌满”的画面感（例如洪水、烟雾、泥沙等把某处塞满）。"]}
{"word":"ingot","summary":{"en":"An ingot is a block of metal cast into a solid shape for storage or further use.","zh":"ingot 指浇铸成型的金属锭，便于储存、运输或后续加工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A solid block of metal (such as gold, silver, or iron), usually made by pouring molten metal into a mold, for storage, transport, or later processing.","zh":"（金属）锭；（如金、银、铁等）把熔融金属倒入模具后形成的固体块，用于储存、运输或后续加工。"},"examples":[{"en":"The refinery produced gold ingots for export.","zh":"这家炼厂生产金锭用于出口。"},{"en":"Workers poured molten steel into molds to make ingots.","zh":"工人把熔融钢水倒入模具里制成钢锭。"},{"en":"The museum displayed a silver ingot from an ancient shipwreck.","zh":"博物馆展出了一块来自古代沉船的银锭。"}]}],"synonyms":["bar","bullion (for precious metals)","block"],"phonetic":"/ˈɪŋɡət/","extraExplanation":["“ingot”常出现在金融与贵金属语境中，例如“gold ingot（金锭）”“silver ingot（银锭）”。在投资领域更常见的说法是“gold bar（金条）”，含义接近，但“ingot”更偏向工业/冶炼后的原始铸块，而“bar”更像标准化的条形规格。","词源来自法语/拉丁语，核心意思与“浇铸成块的金属”有关，因此它通常强调“铸造出来的金属块”这一制作方式。"]}
{"word":"ingoted","summary":{"en":"An ingot is a cast block of metal; “ingoted” is the (rare) past form meaning ‘cast into ingots.’","zh":"ingot 指“金属锭/铸块”；ingoted 是较少见的动词过去式，意为“铸成锭”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually) a block of metal—such as gold, silver, iron, or steel—cast into a simple shape for storage, transport, or later processing.","zh":"（通常指）铸成规则形状、便于储存、运输或再加工的金属块（如金、银、铁、钢等），即“锭”。"},"examples":[{"en":"The mint stored the gold in ingots inside a secure vault.","zh":"造币厂把金子以金锭的形式存放在安全的金库里。"},{"en":"Steel ingots are often reheated and rolled into sheets.","zh":"钢锭常被重新加热并轧制成钢板。"}]},{"partOfSpeech":"vt.","definition":{"en":"To form (metal) into an ingot; to cast into ingots.","zh":"把（金属）铸成锭；铸锭。"},"examples":[{"en":"After refining, the metal is ingoted for shipment.","zh":"精炼后，金属会被铸成锭以便运输。"},{"en":"The factory ingoted the alloy before sending it to another plant.","zh":"工厂先把合金铸成锭，再送往另一家工厂。"}]}],"synonyms":["bar","bullion","block","slab"],"phonetic":"/ˈɪŋɡət/","extraExplanation":["“ingoted”通常是动词“to ingot”的过去式/过去分词，但这个动词在现代英语里比较少见；更常见的表达是“cast into ingots”（铸成锭）或“poured into molds”（倒入模具）。","如果你本来想查的是名词，正确拼写一般是“ingot”（单数）/“ingots”（复数）。"]}
{"word":"ingoting","summary":{"en":"“Ingoting” is a rare metallurgy term meaning casting metal into ingots; it can also be the -ing form of the rare verb “to ingot.”","zh":"“ingoting”是较少见的冶金用语，指把金属浇铸成锭；也可视为罕见动词“to ingot”的-ing形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(metallurgy, uncommon) the process of casting molten metal into ingots; the act of forming metal into block-shaped ingots for storage or further processing.","zh":"（冶金/较少用）把熔融金属浇铸成锭（钢锭、金属锭等）的过程；把金属制成锭状以便储存或后续加工。"},"examples":[{"en":"The plant is upgrading its ingoting line to reduce defects in the steel ingots.","zh":"工厂正在升级铸锭生产线，以减少钢锭缺陷。"},{"en":"After refining, the copper is ingoting before it is shipped to manufacturers.","zh":"铜精炼后会先铸成铜锭，再运往制造商。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle/gerund of \"ingot\" (a rare verb): to cast or form metal into ingots.","zh":"“ingot”的现在分词/动名词（较少见的动词）：把金属浇铸/制成金属锭。"},"examples":[{"en":"They are ingoting the aluminum to make it easier to transport.","zh":"他们正在把铝浇铸成锭，以便更容易运输。"},{"en":"Ingoting and rolling are two separate steps in the production process.","zh":"铸锭和轧制是生产流程中两个不同的步骤。"}]}],"synonyms":["casting into ingots","ingot casting","casting","forming (metal) into ingots"],"phonetic":"/ˈɪŋɡətɪŋ/","extraExplanation":["“ingoting”在日常英语里很少见，更常见的说法是：**casting into ingots**（浇铸成锭）、**ingot casting**（铸锭）、或直接用名词短语 **the ingot stage/process**（铸锭阶段/流程）。","如果你原本想输入的是 **ingot**（金属锭），那是更常用的词；“ingoting”多出现在冶金、金属加工等技术语境里。"]}
{"word":"ingotman","summary":{"en":"“Ingotman” is a rare noun meaning a worker who makes or handles metal ingots; it can also be a name/surname.","zh":"“Ingotman”是个较少见的名词，指制作或处理金属锭的工人；也可能被当作人名/姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes, handles, or works with metal ingots (solid blocks of metal), especially in a foundry or metalworks. (This word is rare; more common terms are “foundry worker” or “metalworker.”)","zh":"（罕用）铸锭工；从事金属锭（铸锭）生产、搬运或加工的人，常见于铸造厂/冶金行业。（更常用的说法是 foundry worker / metalworker。）"},"examples":[{"en":"The ingotman stacked the cooled aluminum ingots for shipping.","zh":"铸锭工把冷却后的铝锭堆放好，准备装运。"},{"en":"In old factory records, an “ingotman” might be listed among the foundry staff.","zh":"在旧工厂档案中，“ingotman”有时会被列为铸造车间的员工之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname or name used for a person or account (uncommon).","zh":"（不常见）用作人名/姓氏或账号名。"},"examples":[{"en":"The email address belongs to someone named Ingotman.","zh":"这个邮箱地址属于一位名叫 Ingotman 的人。"}]}],"synonyms":["foundry worker","metalworker","smelter","factory worker"],"phonetic":"/ˈɪŋɡɑtˌmæn/","extraExplanation":["“ingotman”在现代英语里不算常见词，更自然的表达通常是 foundry worker（铸造厂工人）、metalworker（金属工）、smelter（冶炼工，语境相关）或 operator（操作员）。如果你原本想查的是“ingot”（金属锭）这个词，也可以告诉我，我可以补充更常用的搭配与例句。"]}
{"word":"ingotmen","summary":{"en":"“Ingotmen” means workers who handle or process metal ingots, usually in a steel or metal plant.","zh":"“ingotmen”指在钢铁或金属工厂中处理、搬运或加工金属锭的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Workers (especially in metal or steel plants) who handle, move, or process ingots (large blocks of metal) as part of production.","zh":"（尤指金属或钢铁厂里的）铸锭工；负责搬运、处理或加工金属锭（大块金属）的工人。"},"examples":[{"en":"The ingotmen guided the glowing metal blocks onto the rollers.","zh":"铸锭工把通红的金属锭引导到滚轮上。"},{"en":"In the old steelworks, ingotmen worked long shifts near intense heat.","zh":"在老式钢厂里，铸锭工在高温附近长时间轮班工作。"}]}],"synonyms":["steelworkers","foundry workers","metalworkers"],"phonetic":"/ˈɪŋɡətˌmɛn/","extraExplanation":["“ingotmen”是相对少见的词，通常出现在较老的工业/钢铁生产语境中（例如描写传统钢厂的文章或纪实作品）。现代更常见的说法会用更泛的职业名词，如“steelworkers / foundry workers / metalworkers”。","构词：ingot（铸锭、金属锭）+ -man（从事某项工作的人）；复数为 ingotmen。"]}
{"word":"ingots","summary":{"en":"Ingots are cast blocks of metal used for storage, transport, or further manufacturing.","zh":"ingots 指铸成块状的金属锭，用于储存、运输或后续制造加工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A block of metal (such as gold, silver, steel, or aluminum) cast into a simple shape for storage, transport, or later processing.","zh":"（金、银、钢、铝等）铸成的金属锭；为便于储存、运输或后续加工而制成的块状金属。"},"examples":[{"en":"The factory buys aluminum ingots and melts them to make cans.","zh":"工厂购买铝锭并将其熔化来生产易拉罐。"},{"en":"Gold ingots were stored in the bank’s vault.","zh":"金锭被存放在银行金库里。"}]}],"synonyms":["bars","bullion (for precious metals)","metal blocks"],"phonetic":"/ˈɪŋɡət/","extraExplanation":["“ingot”常用于工业与贵金属语境，强调“铸成的标准块状原料”，与“ore（矿石）”不同：ore是含金属的天然矿石，ingot是冶炼后再铸形的金属块。","在历史与文学/影视中，金锭（gold ingots）常象征财富与权力；在贸易与投资语境里也可能与“bullion（贵金属条/块）”一起出现。"]}
{"word":"ingracious","summary":{"en":"Ingracious means not polite or thankful; rude or unpleasant in manner.","zh":"Ingracious 指不礼貌或不知感恩的；态度粗鲁、不讨人喜欢。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not polite, grateful, or pleasant; rude or unkind (often describing words, actions, or a person’s manner).","zh":"不礼貌的；不知感恩的；不讨人喜欢的（常形容言行或态度粗鲁、刻薄）。"},"examples":[{"en":"It was ingracious of him to complain right after receiving a gift.","zh":"他刚收到礼物就抱怨，显得很不知感恩。"},{"en":"Her ingracious remark made the guests uncomfortable.","zh":"她那句不礼貌的话让客人很不舒服。"}]}],"synonyms":["rude","ungrateful","discourteous","impolite","churlish"],"phonetic":"/ɪnˈɡreɪʃəs/","extraExplanation":["词根提示：in- 表示“否定”，gracious 表示“有礼的、亲切的、慷慨的”。所以 ingracious 字面就是“缺少 gracious 那种风度”。","语气与用法：ingracious 常用于较正式的书面或批评场合，比 rude 更偏向“欠缺风度/不懂感激”，而不一定是故意攻击。","常见搭配：ingracious comment/remark（不礼貌的评论）、ingracious response（不得体的回应）、ingracious behavior（失礼的行为）。","近义词辨析：rude（粗鲁，范围更广）、ungrateful（不感恩，强调“没谢意”）、discourteous（无礼，偏正式）、churlish（粗鄙、刻薄，语气更强）。反义词：gracious、courteous、kind、appreciative。"]}
{"word":"ingraciousness","summary":{"en":"rudeness or lack of grace","zh":"无礼或不优雅的状态"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being rude, unfriendly, or lacking warmth and courtesy; unkindness in manner","zh":"无礼；不友善；缺乏礼貌与温和的态度"},"examples":[{"en":"He answered with ingraciousness, as if the question had offended him.","zh":"他用很不客气的态度回答，好像这个问题冒犯了他。"},{"en":"A small apology can soften the ingraciousness of a harsh reply.","zh":"一句小小的道歉可以缓和尖刻回答带来的无礼感。"}]},{"partOfSpeech":"n.","definition":{"en":"a lack of grace, elegance, or pleasing style; awkwardness","zh":"不优雅；不得体；笨拙（在举止或表达上）"},"examples":[{"en":"Despite some ingraciousness in his speech, his message was sincere.","zh":"尽管他说话有些不得体，但他的意思很真诚。"},{"en":"The scene’s emotional power was weakened by the actor’s ingraciousness.","zh":"演员的不够自然得体削弱了这一幕的情感力量。"}]}],"synonyms":["rudeness","unkindness","discourtesy","coldness","unfriendliness","impoliteness","awkwardness","ungracefulness"],"phonetic":"/ɪnˈɡreɪʃəsnəs/","extraExplanation":["该词较偏书面语，常用于评价“态度/语气/举止”不够客气或不够得体。日常口语里更常用 rudeness、unkindness、coldness、awkwardness。"],"etymology":"来自形容词 ingracious（不和善的、不优雅的）：in-（否定）+ gracious（亲切有礼的、优雅的，源自拉丁语 gratia“恩惠、优雅、感谢”）。ingraciousness 是其名词形式，表示“缺乏 gracious 的品质”。","mnemonic":["把它拆开记：in-（不）+ gracious（有礼/优雅）+ -ness（名词）→“不礼貌/不优雅的状态”。","联想中文：gracious≈“有礼有节/优雅”，加 in- 就变成“没礼貌、很不客气”。"]}
{"word":"ingraft","summary":{"en":"Ingraft means to graft tissue into another plant/body, or (figuratively) to firmly instill an idea or habit.","zh":"Ingraft 指“嫁接/移植（组织）”，也可比喻为“把观念或习惯牢固地植入/灌输”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Botany/medicine) To insert a graft (a piece of plant tissue or living tissue/organ) into another plant or body so it can grow or heal together.","zh":"（植物/医学）把接穗（植物组织）或活组织移植到另一株植物或身体上，使其结合生长或修复。"},"examples":[{"en":"The gardener ingrafted a new apple variety onto the old tree.","zh":"园丁把一种新的苹果品种接到那棵老树上。"},{"en":"Surgeons may ingraft skin to help a severe burn heal.","zh":"外科医生可能会进行皮肤移植来帮助严重烧伤愈合。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To fix an idea, habit, or attitude firmly into someone’s mind; to instill.","zh":"（比喻）把某种观念、习惯或态度牢固地灌输到某人心中；使根深蒂固。"},"examples":[{"en":"Her teacher ingrafted a love of reading in her from an early age.","zh":"她的老师从小就在她心里种下了对阅读的热爱。"},{"en":"The training ingrafted safety habits that stayed with the workers for years.","zh":"这次培训把安全习惯深深植入工人心中，并持续多年。"}]}],"synonyms":["graft","implant","transplant","instill","inculcate"],"phonetic":"/ɪnˈɡræft/","extraExplanation":["“ingraft”由 in-（进入）+ graft（嫁接/移植）构成，原义是把“接穗/组织”接进去；因此它很常见的引申义就是“把某种品质或观念植入心里”。","在现代英语里，这个词偏正式、偏书面；日常表达更常用 “graft … onto …”（嫁接到……上）或 “instill/implant”（灌输/植入）。"]}
{"word":"ingraftation","summary":{"en":"Ingraftation means grafting or implanting something into something else, literally or metaphorically; it is rare and somewhat archaic.","zh":"Ingraftation 指“嫁接/植入”的过程，可用于字面或比喻义；该词较罕见且略显古旧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of grafting something onto something else; implantation or insertion (often used in older or formal writing)","zh":"把某物嫁接到另一物上的行为或过程；植入、插入（多见于较古旧或正式的用法）"},"examples":[{"en":"The gardener studied the ingraftation of a new branch onto the apple tree.","zh":"园丁研究如何把一根新枝嫁接到苹果树上。"},{"en":"Some writers spoke of the ingraftation of new customs into society.","zh":"一些作者会谈到把新风俗“植入”社会之中。"}]}],"synonyms":["grafting","engraftment","implantation","insertion","introduction"],"phonetic":"/ɪnˌɡræfˈteɪʃən/","extraExplanation":["“ingraftation”在现代英语里很少用，更常见的是“grafting / engraftment”（园艺上的“嫁接”）或在比喻义中用“implantation / introduction”（把观念、习惯等“引入/植入”）。","词形上可理解为 in-（使进入）+ graft（嫁接/移植）+ -ation（名词后缀，表示过程/行为）。在阅读旧文献或宗教/哲学类文字时更可能遇到。"]}
{"word":"ingrafted","summary":{"en":"Ingrafted means “deeply implanted or firmly fixed,” and it is also the past form of ingraft, “to graft onto a plant” or “to introduce so it becomes a lasting part.”","zh":"Ingrafted 表示“深深植入、根深蒂固的”，也可作 ingraft 的过去式，指“嫁接”或“使某事物长期融入、成为一部分”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an idea, habit, quality, etc.) firmly fixed in someone’s mind or character; deeply implanted.","zh":"（指观念、习惯、品质等）牢牢植入（心里/性格中）的；根深蒂固的。"},"examples":[{"en":"Respect for others was ingrafted in her from childhood.","zh":"从小别人就把尊重他人的观念深深植入她心里。"},{"en":"Some fears become ingrafted through repeated bad experiences.","zh":"一些恐惧会因反复的糟糕经历而根深蒂固。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of ingraft: to join (a shoot or bud) to a plant so it grows there; to insert or introduce something so it becomes a lasting part of something else (often figurative).","zh":"ingraft 的过去式：把（芽/枝）嫁接到植物上使其生长；（常作比喻）把某事物引入并使其成为持久的一部分。"},"examples":[{"en":"The gardener ingrafted a new variety onto the old apple tree.","zh":"园丁把一个新品种嫁接到那棵老苹果树上。"},{"en":"The teacher ingrafted good study habits into the class.","zh":"老师把良好的学习习惯灌输给全班同学。"}]}],"synonyms":["implanted","instilled","embedded","inbred","ingrained"],"phonetic":"/ɪnˈɡræf.tɪd/","extraExplanation":["“ingraft”原本是园艺术语：把植物的枝芽接到另一株植物上，让它们长成一个整体。英语里常把它引申为“把某种品质/观念植入到人或制度中”，语气比“teach”更强调“深入、长期、像长在里面一样”。","在宗教与文学语境中也常见（尤其是《圣经》英译本里），用来描写人被“接入/融入”某个群体或信仰传统，因此带一点书面、古典的色彩。"]}
{"word":"ingrafter","summary":{"en":"An ingrafter is someone who grafts—most commonly a person who grafts plants (rarely, someone who performs tissue grafting).","zh":"ingrafter 指“进行嫁接/移植的人”，最常见是植物嫁接者（较少指组织移植操作者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who grafts (joins) plant parts so they grow as one plant; a grafter.","zh":"嫁接者；把植物的枝条/芽接到另一株植物上使其共同生长的人。"},"examples":[{"en":"The ingrafter carefully attached the apple scion to the rootstock.","zh":"这位嫁接者小心地把苹果接穗接到砧木上。"},{"en":"In spring, an ingrafter may graft roses to create hardier plants.","zh":"在春天，嫁接者可能会给玫瑰嫁接，以培育更耐寒的植株。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who performs grafting in a medical sense (joining tissue), though this use is rare.","zh":"（较少用）施行组织移植/皮肤移植的人（如外科医生）。"},"examples":[{"en":"The surgeon acted as an ingrafter during the skin-graft procedure.","zh":"在皮肤移植手术中，这位外科医生承担了移植操作。"}]}],"synonyms":["grafter","grafting specialist","horticulturist (when in a plant-care role)"],"phonetic":"/ɪnˈɡræftər/","extraExplanation":["“ingrafter”并不常见，更常用的是“grafter”（嫁接者）或直接说“a person who grafts plants”。它由 in-（表示“使……进入/加上”这一类含义的前缀，用法较宽泛）+ graft（嫁接/移植）+ -er（做某事的人）构成。日常园艺语境里，用“grafter”更自然。"]}
{"word":"ingrafting","summary":{"en":"Ingrafting means grafting a plant part onto another plant, or (figuratively) planting an idea or habit so it becomes permanent.","zh":"Ingrafting 指对植物进行嫁接；也可比喻把观念或习惯“植入”并使之成为长期的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Horticulture) the act of joining a cutting or bud from one plant onto another plant so they grow together.","zh":"（园艺）把一种植物的枝条或芽接到另一株植物上，使其结合并继续生长（嫁接）的行为。"},"examples":[{"en":"In early spring, the gardener focused on ingrafting apple varieties onto hardy rootstock.","zh":"在早春，园丁把不同的苹果品种进行嫁接到耐寒的砧木上。"},{"en":"Proper tools and clean cuts make ingrafting more likely to succeed.","zh":"合适的工具和干净的切口会让嫁接更容易成功。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) the process of adding an idea, habit, or quality into someone or something so it becomes a lasting part.","zh":"（比喻）把某种观念、习惯或品质“植入”到某人/某物中，使其成为长期的一部分。"},"examples":[{"en":"The program aims at ingrafting a sense of responsibility in new volunteers.","zh":"该项目旨在把责任感“植入”到新志愿者心中。"},{"en":"Over time, daily practice is ingrafting discipline into her routine.","zh":"久而久之，每天的练习把自律融入了她的日常。"}]}],"synonyms":["grafting","bud grafting","implanting","instilling","inculcating"],"phonetic":"/ɪnˈɡræf.tɪŋ/","extraExplanation":["“ingrafting”通常是动词“ingraft”的动名词/现在分词形式，用于描述“正在嫁接”或“嫁接这件事”。在现代日常英语中更常见的表达是“grafting / grafting onto”。","园艺语境里常见搭配：ingraft A onto B（把A嫁接到B上）；rootstock（砧木）、scion（接穗）。比喻用法多见于较正式或文学性的写作。"]}
{"word":"ingraftment","summary":{"en":"Ingraftment means successful “take” and growth of a transplant (most commonly in medicine); less commonly, it means the act of grafting plants.","zh":"Ingraftment 通常指移植物在体内成功植入并生长（医学最常用）；较少见时也可指植物嫁接过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) The successful establishment and growth of transplanted cells, tissues, or an organ in a recipient’s body (also spelled “engraftment”).","zh":"（医学）移植的细胞、组织或器官在受体体内成功“植入并存活、生长”（也作 engraftment）。"},"examples":[{"en":"The patient’s blood counts improved after bone marrow engraftment.","zh":"骨髓成功植入（并开始工作）后，病人的血细胞计数有所改善。"},{"en":"Doctors monitored engraftment to ensure the transplant was working.","zh":"医生监测植入情况，以确认移植是否生效。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/planting, less common) The act or process of grafting—joining one plant part to another so they grow together.","zh":"（生物/园艺，较少见）嫁接的行为或过程——把一种植物的部位接到另一株上，使其共同生长。"},"examples":[{"en":"In some manuals, ingraftment refers to grafting a fruit tree onto a hardy rootstock.","zh":"在一些手册里，ingraftment 指把果树嫁接到抗逆性强的砧木上。"}]}],"synonyms":["engraftment","transplant take","grafting (plant sense)"],"phonetic":"/ɪnˈɡræftmənt/","extraExplanation":["在现代英语里，“engraftment”更常见；“ingraftment”多见于医学/科研语境或较旧的写法。","医学语境下常见搭配：“engraftment failure（植入失败）”“time to engraftment（植入所需时间）”“neutrophil engraftment（中性粒细胞植入/恢复）”。","词源与构词：graft 原指“嫁接”；医学借用这一意象来描述移植物在体内“接上并长起来”的过程。"]}
{"word":"ingrafts","summary":{"en":"“Ingrafts” means (1) instills something firmly in someone’s mind/character, or (2) grafts a bud/scion into another plant (third-person singular form of “ingraft”).","zh":"“Ingrafts”表示（1）把某种观念/品质牢牢灌输、植入，（2）把芽或枝条嫁接到另一株植物上（为动词“ingraft”的第三人称单数形式）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular) to fix or plant something firmly in someone’s mind, habits, or character; to instill.","zh":"（第三人称单数）把某种想法、习惯或品质牢牢植入（某人心里）；灌输。"},"examples":[{"en":"The teacher ingrafts a love of reading in her students through daily story time.","zh":"老师通过每天的故事时间，把对阅读的热爱植入学生心中。"},{"en":"Good manners are often ingrafts from early childhood.","zh":"良好的礼貌常常是从幼年起就被灌输形成的。"}]},{"partOfSpeech":"vt.","definition":{"en":"(third-person singular) to join a plant part (a scion or bud) onto another plant so it grows there; to graft in.","zh":"（第三人称单数）（园艺）把枝条或芽接到另一株植物上使其生长；嫁接进去。"},"examples":[{"en":"In spring, the gardener ingrafts new buds onto the old apple tree.","zh":"春天，园丁把新芽嫁接到老苹果树上。"},{"en":"This method ingrafts the desired variety onto a stronger rootstock.","zh":"这种方法把想要的品种嫁接到更强壮的砧木上。"}]}],"synonyms":["instills","implants","inculcates","grafts","grafts in"],"phonetic":"/ɪnˈɡræfts/","extraExplanation":["“ingrafts”来自动词“ingraft”，由 in-（进入、向内）+ graft（嫁接）构成。它既可用于园艺的“嫁接”，也常用于比喻：把观念/品质“像嫁接一样”牢固地植入人的思想或性格中。","当你看到“ingrafts”，通常是在一般现在时里搭配第三人称单数主语（he/she/it）。原形是“ingraft”，过去式/过去分词常见为“ingrafted”。"]}
{"word":"ingrain","summary":{"en":"Ingrain means to make something firmly fixed in someone’s mind or deeply set into a material.","zh":"Ingrain 指让某种观念/习惯在心中根深蒂固，或让污渍/颜色等深深渗入材料中。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To fix an idea, habit, or feeling firmly in someone’s mind so it becomes hard to change.","zh":"（使观念、习惯或情感）根深蒂固地进入某人心中；使牢固形成，难以改变。"},"examples":[{"en":"From an early age, the importance of honesty was ingrained in him.","zh":"从小起，诚实的重要性就深深植入了他的心中。"},{"en":"Years of training ingrained good study habits in the students.","zh":"多年的训练让学生们养成了根深蒂固的良好学习习惯。"}]},{"partOfSpeech":"vt.","definition":{"en":"To work a stain, dye, or pattern deeply into a material so it becomes part of it.","zh":"（使污渍、染料或图案）深深渗入（材料）；使（颜色/痕迹）牢固附着。"},"examples":[{"en":"The red wine can ingrain quickly if you don’t clean it right away.","zh":"红酒如果不立刻清理，很快就会渗进布料里。"},{"en":"The dirt was ingrained in the carpet after months without cleaning.","zh":"几个月不清洁后，灰尘已经深深嵌进了地毯里。"}]}],"synonyms":["instill","implant","embed","root","impress"],"phonetic":"/ɪnˈɡreɪn/","extraExplanation":["“ingrain”常见搭配：be ingrained in sb（在某人心中根深蒂固）；ingrain sth in/into sb（把某种观念/习惯灌输给某人）。","词义来自“grain（纹理/颗粒）”，比喻像进入木纹一样深入；因此常用来形容观念或习惯“深入骨髓”。","同义表达可用：instill（灌输，较正式）、implant（植入，偏比喻）、root（使生根）。其中“ingrain”强调“久而久之变得难以改变”。"]}
{"word":"ingrained","summary":{"en":"Ingrained means “deeply fixed and hard to change,” especially for habits or beliefs; it can also describe a stain or smell that is firmly set in.","zh":"ingrained 指“根深蒂固、难以改变”（多用于习惯或信念）；也可指污渍或气味“牢牢附着、很难去除”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a habit, belief, or feeling) fixed so deeply that it is hard to change.","zh":"（习惯、信念或感受）根深蒂固的；牢固到很难改变的。"},"examples":[{"en":"A fear of public speaking can become ingrained after a bad experience.","zh":"经历一次糟糕的事情后，对公开演讲的恐惧可能会变得根深蒂固。"},{"en":"It’s an ingrained habit to check my phone first thing in the morning.","zh":"一早醒来先看手机成了我根深蒂固的习惯。"},{"en":"Respect for elders is ingrained in many cultures.","zh":"尊敬长辈在许多文化中是根深蒂固的观念。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fixed firmly into a surface (often describing dirt or a mark).","zh":"（污渍、痕迹等）深深嵌入的；牢牢附着的。"},"examples":[{"en":"The shirt had an ingrained stain that wouldn’t wash out.","zh":"这件衬衫上有一块洗不掉的顽固污渍。"},{"en":"Years of smoke left an ingrained smell in the walls.","zh":"多年的烟味在墙里留下了挥之不去的气味。"}]}],"synonyms":["deep-seated","entrenched","deeply rooted","firmly established","embedded"],"phonetic":"/ɪnˈɡreɪnd/","extraExplanation":["“Ingrained”来自动词“ingrain”，本义与“让东西像染料一样渗进纤维”有关，所以常用来形容某种东西“渗透得很深、难以去除”。因此它既可比喻习惯/观念的“根深蒂固”，也可字面形容污渍/气味的“洗不掉、去不掉”。","常见搭配：an ingrained habit/belief/attitude（根深蒂固的习惯/信念/态度）；deeply ingrained（深深根植的）；ingrained prejudice（根深蒂固的偏见，使用时注意语境与礼貌）。"]}
{"word":"ingrainedly","summary":{"en":"“Ingrainedly” means doing something in a deeply habitual, hard-to-change way.","zh":"“ingrainedly”表示以一种根深蒂固、难以改变的习惯方式去做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a deeply fixed, habitual way that is hard to change.","zh":"以根深蒂固、习以为常且很难改变的方式。"},"examples":[{"en":"He ingrainedly distrusts strangers because of past experiences.","zh":"因为过去的经历，他对陌生人有一种根深蒂固的不信任。"},{"en":"The team ingrainedly relies on the same routine before every game.","zh":"这支队伍在每场比赛前都习惯性地依赖同一套流程。"}]}],"synonyms":["deeply","firmly","habitually","instinctively"],"phonetic":"/ɪnˈɡreɪnɪdli/","extraExplanation":["“ingrainedly”是由形容词“ingrained（根深蒂固的）”加副词后缀“-ly”构成，但在实际英语中非常少见。很多时候母语者更常用“deeply / firmly / habitually / as a matter of habit”来表达同样意思。","常见搭配更自然：deeply ingrained（深深根植的）、an ingrained habit（根深蒂固的习惯）。如果你想让表达更地道，可以把“ingrainedly + 动词”改写为“have a deeply ingrained tendency to + 动词”。"]}
{"word":"ingrainedness","summary":{"en":"“Ingrainedness” means the degree to which something is deeply fixed and hard to change.","zh":"“ingrainedness”指某事物根深蒂固、难以改变的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being deeply fixed in someone’s habits, mind, or character and therefore hard to change.","zh":"（习惯、观念、性格等）根深蒂固、难以改变的程度。"},"examples":[{"en":"The ingrainedness of these habits makes them hard to break.","zh":"这些习惯根深蒂固，所以很难改掉。"},{"en":"We were surprised by the ingrainedness of prejudice in the community.","zh":"我们对这种偏见在社区里根深蒂固的程度感到惊讶。"}]}],"synonyms":["deep-rootedness","entrenchment","embeddedness"],"phonetic":"/ɪnˈɡreɪndnəs/","extraExplanation":["“ingrainedness”来自形容词 ingrained（根深蒂固的）+ 名词后缀 -ness（……的状态/性质）。它属于较少见、偏正式的抽象名词；日常表达里更常用 “how ingrained … is / the extent to which … is ingrained”，或直接用 “deep-rootedness”（根深蒂固的程度）。","相关表达：deep-rootedness（更常见的名词）、entrenchment（更偏学术/政治语境的“固化/根深蒂固”）、a deeply ingrained habit/belief（常见搭配）。"]}
{"word":"ingraining","summary":{"en":"Ingraining means making an idea or habit deeply fixed and hard to change.","zh":"Ingraining 指把观念或习惯深深根植，使之难以改变。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle/gerund of “ingrain”) Fixing an idea, habit, or attitude so firmly in someone’s mind that it becomes hard to change.","zh":"（“ingrain”的现在分词/动名词）把某种想法、习惯或态度深深灌输/根植于某人心中，以至于很难改变。"},"examples":[{"en":"Years of training are ingraining good safety habits in the team.","zh":"多年的训练正在把良好的安全习惯深深地根植在团队中。"},{"en":"The teacher focuses on ingraining basic grammar through daily practice.","zh":"老师通过每天练习来强化并牢牢记住基础语法。"},{"en":"Some stereotypes become ingraining over time if no one challenges them.","zh":"如果没人去质疑，一些刻板印象会随着时间变得根深蒂固。"}]},{"partOfSpeech":"v.","definition":{"en":"Embedding something deeply (often used more literally, but less common in everyday speech).","zh":"（较少见的字面用法）把某物深深嵌入/渗入。"},"examples":[{"en":"Mud was ingraining into the fabric after the hike.","zh":"徒步后，泥巴深深渗进了布料里。"},{"en":"Smoke can be ingraining in curtains if the room isn’t ventilated.","zh":"如果房间不通风，烟味会渗进窗帘里。"}]}],"synonyms":["instilling","embedding","rooting","entrenching","implanting","drilling (into)"],"phonetic":"/ɪnˈɡreɪnɪŋ/","extraExplanation":["“ingraining”常用于教育、训练、家庭影响等语境，强调“长期反复→变得根深蒂固”。常见搭配：ingrain values/habits/discipline; be ingrained in someone.","词源上与“grain（纹理/纤维）”有关，带有“像进入木纹/布纹一样深入”的形象感，所以常用来比喻观念或习惯深入人心。"]}
{"word":"ingrains","summary":{"en":"“Ingrains” means to make something deeply fixed in the mind or firmly established; less commonly, to set a stain/dye permanently into fabric.","zh":"“ingrains”表示把想法/习惯等深深灌输或使其根深蒂固；较少见时也指让染色/污渍渗入织物而难以去除。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fix an idea, habit, or attitude firmly in someone’s mind so it becomes hard to change","zh":"把某种想法、习惯或态度深深灌输（使其根深蒂固、难以改变）"},"examples":[{"en":"From a young age, she was ingrained with the belief that hard work matters.","zh":"从小她就被灌输“努力很重要”的信念。"},{"en":"Years of training ingrained good safety habits in the team.","zh":"多年的训练让团队养成了牢固的安全习惯。"},{"en":"It’s difficult to unlearn behaviors that were ingrained in childhood.","zh":"童年时期形成（被灌输）的行为很难改掉。"}]},{"partOfSpeech":"v.","definition":{"en":"to become deeply rooted or firmly established (often used with “in” or “into”)","zh":"（常与 in/into 连用）变得根深蒂固、牢固确立"},"examples":[{"en":"The idea that success equals money is ingrained in many cultures.","zh":"“成功等于金钱”的观念在许多文化中根深蒂固。"},{"en":"Over time, the routine ingrained into his daily life.","zh":"随着时间推移，这个习惯融入并固定在他的日常生活里。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to work a dye or stain into fabric so it becomes permanent","zh":"（较少见）把染料/污渍渗入织物纤维，使之难以去除"},"examples":[{"en":"The red wine ingrained into the carpet before anyone noticed.","zh":"红酒在被发现前就已经渗进地毯里了。"},{"en":"Scrubbing too hard can spread the stain and ingrain it further.","zh":"刷得太用力反而会把污渍扩散，让它更“渗进去”。"}]}],"synonyms":["instill","implant","root","embed","entrench"],"phonetic":"/ɪnˈɡreɪn/","extraExplanation":["“ingrains”多见于一般现在时第三人称单数（He/She/It ingrains...）或名词复数较少见；词典基本形是“ingrain”。","常见搭配：be ingrained in（深植于……中）；ingrain someone with something（把……灌输给某人）；ingrained habit/belief/attitude（根深蒂固的习惯/信念/态度）。","语气上，“ingrained”常暗示‘很难改变’，既可中性（如安全习惯），也可偏负面（如偏见）。"]}
{"word":"ingram","summary":{"en":"Ingram is mainly a surname (and sometimes a first name) and can also be a place name.","zh":"Ingram 主要是英文姓氏（有时作名字），也可作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) and sometimes a given name; also used as the name of some towns/places (especially in the U.S.)","zh":"英格拉姆：常见的英文姓氏（有时也作名字）；也可指一些地名（尤其在美国）"},"examples":[{"en":"Her last name is Ingram.","zh":"她的姓是英格拉姆。"},{"en":"Mr. Ingram will speak at the meeting today.","zh":"英格拉姆先生今天会在会议上发言。"},{"en":"They drove through Ingram on their road trip.","zh":"他们自驾旅行时经过了英格拉姆（这个地方）。"}]}],"phonetic":"/ˈɪŋɡræm/","extraExplanation":["“Ingram”多见于英语国家的人名系统中，最常用作姓氏。作为名字（first name）也存在，但相对少见。","词源上一般认为与中古时期的日耳曼语人名有关，常被解释为由“Ing-”（与古日耳曼文化中的名字/神祇或部族名有关的成分）+ 表示“乌鸦”等含义的成分组合而来；在不同家族与地区里，具体来源说法可能略有差异。"]}
{"word":"ingrammaticism","summary":{"en":"Ingrammaticism means ungrammaticality—grammar that is incorrect in speech or writing.","zh":"ingrammaticism 指“不合语法/语法不正确”的状态，多用于较正式或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being ungrammatical; lack of correct grammar in speech or writing.","zh":"不合语法；语法不正确的状态（指口语或书面语中的语法错误）"},"examples":[{"en":"The teacher pointed out the ingrammaticism in the sentence and explained how to fix it.","zh":"老师指出这个句子里的不合语法之处，并解释如何修改。"},{"en":"Some casual messages contain ingrammaticism, but the meaning is still clear.","zh":"一些随意的短信里会有不合语法的地方，但意思仍然清楚。"}]}],"synonyms":["ungrammaticality","incorrect grammar","grammatical error"],"phonetic":"/ˌɪnɡrəˈmætɪsɪzəm/","extraExplanation":["这是一个较少见、偏学术的词，通常在语言学、写作批评或编辑语境中出现。日常英语更常用的说法是 ungrammaticality（不合语法）或直接说 a grammatical error / incorrect grammar（语法错误/语法不正确）。","构词上：in-（不、非）+ grammatical（语法的）+ -ism（……现象/特征）。这里的 -ism 表示“某种现象或倾向”，不一定像“主义”那样带强烈意识形态含义。"]}
{"word":"ingramness","summary":{"en":"A proper place name, often meaning a headland/locality called “Ingram Ness.”","zh":"一个地名专有名词，常指名为“Ingram Ness”的岬地或所在地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ingramness (also written Ingram Ness) is a place name (proper noun), typically referring to a coastal point/headland or a specific locality that includes the element “ness.”","zh":"Ingramness（也可写作 Ingram Ness）是一个地名（专有名词），通常指带有“ness”这一构词成分的海角/岬地，或某个包含该成分的具体地区名称。"},"examples":[{"en":"We marked Ingramness on the map before starting our coastal walk.","zh":"出发沿海徒步前，我们先在地图上标出了 Ingramness。"},{"en":"The guide said the cliffs near Ingram Ness can be windy in the afternoon.","zh":"导游说 Ingram Ness 附近的悬崖下午风会比较大。"}]}],"synonyms":["Ingram Ness"],"phonetic":"/ˈɪŋɡræm nɛs/","extraExplanation":["“ness”常见于英国（尤其苏格兰、北英格兰及受北欧语影响地区）的地名中，意思大致是“岬、海角、伸入海中的陆地”。因此 Ingramness 这类名称往往与海岸地形有关。","如果你是在某本书、地图或家谱资料里看到 Ingramness，它也可能是较少见的拼写、旧拼法，或把“Ingram Ness”连写成一个词的写法。建议结合出现的国家/郡县/坐标来确认具体指向。"]}
{"word":"ingrandize","summary":{"en":"An archaic verb meaning “to enlarge” or, more commonly, “to exaggerate and make something seem more important.”","zh":"一个罕用/古义动词，意思是“扩大”，更常见的是“夸大、抬高（使显得更重要）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To make something seem greater, more important, or more powerful than it really is; to exaggerate or glorify.","zh":"（古义/罕用）夸大；抬高（某事物的重要性、价值或影响力）；美化渲染。"},"examples":[{"en":"The biography ingrandizes the hero’s achievements and ignores his failures.","zh":"这本传记夸大了主人公的成就，并忽略了他的失败。"},{"en":"Don’t ingrandize a small mistake into a disaster.","zh":"别把一个小错误夸大成一场灾难。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To increase in size or scope; to enlarge.","zh":"（古义/罕用）使变大；扩大（规模、范围等）。"},"examples":[{"en":"They tried to ingrandize the garden by adding a new section.","zh":"他们想通过增加一块新区域来扩大花园。"},{"en":"The company ingrandized its operations across the state.","zh":"这家公司把业务扩展到了全州。"}]}],"synonyms":["aggrandize","exaggerate","inflate","magnify","embellish"],"phonetic":"/ɪnˈɡrænˌdaɪz/","extraExplanation":["“ingrandize”在现代英语中非常少见，更常用的拼写是“aggrandize”。在阅读较早期的文本（或受古拼写影响的写作）时可能会遇到它。","词源上与“grand（伟大）”同源，带有“使变得更大/更重要”的核心含义；现代用法里多用于指“夸大功绩、抬高地位”等。"]}
{"word":"ingrapple","summary":{"en":"A rare/archaic verb meaning to grapple with or tightly seize; sometimes used poetically for becoming entangled.","zh":"一个罕见/古体动词，意为与……扭打或紧紧抓住；也可诗意地指彼此纠缠交织。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare/archaic) To grapple with; to seize, clasp, or hold tightly, often in a struggle.","zh":"（罕见/古体）与……扭打、搏斗；紧抓、紧抱（常带有挣扎或对抗之意）。"},"examples":[{"en":"The wrestlers ingrappled each other and fell to the mat.","zh":"摔跤手彼此扭住对方，摔倒在垫子上。"},{"en":"In the story, the hero ingrappled the thief before he could run.","zh":"在故事里，英雄在小偷逃跑前一把将他擒住。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare/poetic) To become closely intertwined or entangled, physically or emotionally.","zh":"（罕见/诗意）紧密交织、纠缠在一起（可指身体或情感层面）。"},"examples":[{"en":"Vines ingrappled around the old fence after years of neglect.","zh":"多年无人打理，藤蔓缠绕在旧篱笆上。"},{"en":"Their lives ingrappled through shared work and hardship.","zh":"他们的生活因共同的工作与艰辛而紧紧交织在一起。"}]}],"synonyms":["grapple","seize","clasp","grip","entangle","lock (horns)"],"phonetic":"/ɪnˈɡræpəl/","extraExplanation":["“ingrapple”非常少见，多见于较早期英语或仿古写作中，可理解为 in-（使进入/加强）+ grapple（扭打、抓住），语感上比普通的 “grapple” 更强调“紧紧抓住、纠缠在一起”。现代英语中通常用 “grapple (with)”, “seize”, “clasp”, “grip”, “entangle”。"]}
{"word":"ingrate","summary":{"en":"An ingrate is a person who doesn’t show gratitude after receiving kindness or help.","zh":"ingrate 指受到帮助或善意后却不懂感恩的人，语气较强、偏正式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not show gratitude; someone who is ungrateful, especially after receiving help or kindness","zh":"忘恩负义的人；不知感恩的人（尤其是在受到帮助或善意之后）"},"examples":[{"en":"After everything she did for him, he called him an ingrate.","zh":"在她为他做了那么多之后，他竟说她是个忘恩负义的人。"},{"en":"I don’t want to sound like an ingrate, but this gift really isn’t useful for me.","zh":"我不想显得不知感恩，但这份礼物对我来说确实不太实用。"}]}],"synonyms":["ungrateful person","thankless person","poor returner (less common)"],"phonetic":"/ˈɪnɡreɪt/","extraExplanation":["“ingrate”是比较正式、带强烈批评意味的词，常用于书面语或严肃语境。日常口语里更常说“ungrateful person”。","词源来自拉丁语：in-（不）+ gratus（感激的、令人愉快的），与“gratitude（感激）”“grateful（感激的）”同源。","用法提示：当你想表达“我不是不感恩，但……”时，更礼貌的说法是“I don’t mean to be ungrateful, but …”以降低冒犯感。"]}
{"word":"ingrateful","summary":{"en":"Ungrateful means not thankful, or (of work) hard and not appreciated.","zh":"ungrateful 指“不知感恩/不领情”，也可指（工作等）“吃力不讨好”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not showing thanks or appreciation for help, kindness, or gifts; unthankful.","zh":"忘恩负义的；不知感恩的；不领情的。"},"examples":[{"en":"It felt ungrateful to complain after they helped me so much.","zh":"他们帮了我那么多，我再抱怨就显得很不知感恩。"},{"en":"She wrote a note to avoid seeming ungrateful.","zh":"她写了张感谢便条，免得显得不领情。"},{"en":"Don’t be ungrateful—say thank you.","zh":"别忘恩负义——说声谢谢。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a lack of appreciation; unpleasantly hard or unrewarding (often describing work or tasks).","zh":"（常形容工作/任务）吃力不讨好的；辛苦却回报不多的。"},"examples":[{"en":"Cleaning up after the event was ungrateful work.","zh":"活动结束后的清理工作很吃力不讨好。"},{"en":"He does a lot of ungrateful tasks that no one notices.","zh":"他做了很多没人注意到的吃力不讨好的活。"}]}],"synonyms":["unappreciative","unthankful","thankless"],"phonetic":"/ʌnˈɡreɪtfəl/","extraExplanation":["“un-”是否定前缀，表示“没有/不”。“ungrateful”=“not grateful（不感激的）”。","常见搭配：feel/seem/sound ungrateful（显得不知感恩）；be ungrateful for sth（对某事不领情）；ungrateful task/job（吃力不讨好的任务/工作）。","近义词（语气由轻到重）：unappreciative（不懂感激的，较中性）、thankless（不被感谢的/吃力不讨好）、unthankful（不感激的）。反义词：grateful（感激的）、appreciative（懂得感激的）。"]}
{"word":"ingratefully","summary":{"en":"“Ingratefully” means “in an ungrateful way,” showing little or no thanks.","zh":"“ingratefully”表示“以不感激的方式”，指不表达或很少表达感谢。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an ungrateful way; without showing thanks or appreciation.","zh":"以忘恩负义/不感激的方式；不表示感谢或欣赏。"},"examples":[{"en":"He spoke ingratefully about the people who had supported him.","zh":"他忘恩负义地谈论那些支持过他的人。"},{"en":"It felt ingratefully dismissive to ignore her help and never say thank you.","zh":"无视她的帮助、从不道谢，让人感觉很不知感恩、很敷衍。"}]}],"synonyms":["ungratefully","thanklessly","unappreciatively","without gratitude"],"phonetic":"/ɪnˈɡreɪtfəli/","extraExplanation":["“ingratefully”来自形容词“ungrateful”（不感激的），加上副词后缀“-ly”。在真实交流中，人们更常用“ungratefully”（同义）或直接用短语表达，如“without thanking them / without showing appreciation”。","注意语气：用“ingratefully”评价别人时通常带有批评或道德判断（觉得对方‘不知感恩’）。如果想更委婉，可以说“not very appreciative”或“didn’t acknowledge the help”。"]}
{"word":"ingratefulness","summary":{"en":"Ingratefulness means a lack of gratitude or appreciation for kindness or help received.","zh":"Ingratefulness 指“不知感恩/缺乏感激”，对他人的善意或帮助没有应有的感谢与珍惜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being grateful; lack of appreciation for help, kindness, or benefits received","zh":"忘恩负义；不知感恩；对他人的帮助、善意或利益缺乏感谢与珍惜"},"examples":[{"en":"She was hurt by his ingratefulness after everything she had done for him.","zh":"她为他做了那么多，他却不知感恩，这让她很受伤。"},{"en":"The letter complained about the public’s ingratefulness toward healthcare workers.","zh":"这封信抱怨公众对医护人员的付出缺乏感恩。"}]}],"synonyms":["ingratitude","unthankfulness","lack of appreciation"],"phonetic":"/ɪnˈɡreɪtfəlnəs/","extraExplanation":["词形关系：ingratefulness 来自形容词 ungrateful（不感恩的）/ 名词 ingratitude（忘恩负义、不感激）。在现代英语里，ingratitude 比 ingratefulness 更常见、更正式；ingratefulness 更强调“这种状态/特质”。","语体与语气：这个词常带有道德评价，语气偏强，常用于表达“我（或社会）认为你理应感谢却没有”。日常表达里也可用 less appreciative / not thankful 来更委婉。"]}
{"word":"ingrately","summary":{"en":"“Ingrately” means “in an ungrateful way,” describing speech or behavior that shows no thanks.","zh":"“ingrately”表示“以不感激的方式”，用来形容言行表现出不领情、忘恩负义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows a lack of gratitude; unthankfully.","zh":"以不感激的方式；忘恩负义地。"},"examples":[{"en":"He spoke ingrately about the people who helped him.","zh":"他用忘恩负义的口吻谈论那些帮助过他的人。"},{"en":"She acted ingrately, refusing to say thank you after receiving the gift.","zh":"她表现得很不领情，收了礼物却拒绝说谢谢。"}]}],"synonyms":["ungratefully","thanklessly"],"phonetic":"/ɪnˈɡreɪtli/","extraExplanation":["“ingrately”来自形容词“ingrate”（忘恩负义的/不知感恩的），其中“in-”在这里是否定前缀，和“grateful（感激的）”形成对比。","使用场景上，这个词带有明显的批评语气，通常用于评价某人的态度或言行不够感恩。口语里更常用“ungratefully”。"]}
{"word":"ingrates","summary":{"en":"“Ingrates” is the plural of “ingrate,” meaning people who are ungrateful.","zh":"“ingrates”是“ingrate”的复数，指忘恩负义的人、不知感恩的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not show gratitude; an ungrateful person","zh":"忘恩负义的人；不知感恩的人"},"examples":[{"en":"After everything she did for him, he called him an ingrate.","zh":"在她为他做了那么多之后，他却说他是个忘恩负义的人。"},{"en":"Don’t be an ingrate—say thank you when someone helps you.","zh":"别做忘恩负义的人——有人帮你要说谢谢。"}]}],"synonyms":["ungrateful person","thankless person","bad turner"],"phonetic":"/ɪnˈɡreɪt/","extraExplanation":["“ingrate”多用于较正式或带有强烈责备语气的场合，含义比“ungrateful person”（不感恩的人）更尖锐。常见搭配：call someone an ingrate（骂某人忘恩负义）、ungrateful ingrate（强调其忘恩负义）。","词源上与“grateful / gratitude”（感激/感恩）同源，前缀in-表示否定（不）。"]}
{"word":"ingratiate","summary":{"en":"Ingratiate means to try to win someone’s favor, often by flattering them.","zh":"ingratiate 指通过讨好、奉承来博取某人的好感（常带不真诚意味）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to try to gain someone’s approval or favor by doing or saying things that please them (often in an insincere way)","zh":"（常指带有不真诚、讨好意味地）通过说或做让对方高兴的事来博取好感"},"examples":[{"en":"He tried to ingratiate himself with his boss by praising every idea in the meeting.","zh":"他在会议上夸赞老板的每个想法，试图讨好老板、博取好感。"},{"en":"Some salespeople ingratiate themselves with customers by offering small compliments.","zh":"有些销售会对顾客说些小恭维来拉近关系、博取好感。"},{"en":"It’s okay to be polite, but don’t ingratiate yourself just to get what you want.","zh":"礼貌没问题，但别为了达到目的而刻意讨好。"}]}],"synonyms":["curry favor","flatter","butter up","fawn"],"phonetic":"/ɪnˈɡreɪʃiˌeɪt/","extraExplanation":["词源提示：来自拉丁语 in-（使……进入）+ gratia（好感、恩宠）。核心画面是“把自己放进别人的好感里”。","常见搭配：ingratiate oneself with sb（讨好某人）；ingratiate oneself into/with a group（设法打入某个圈子）。","语气与近义词区分：ingratiate 往往暗含“刻意/不真诚”的评价；而 be friendly / be courteous（友好/礼貌）更中性。类似但更口语的还有 suck up to（拍马屁，较贬）。"]}
{"word":"ingratiated","summary":{"en":"Ingratiated means having tried to win someone’s favor, often by flattering or being overly eager.","zh":"ingratiated 指（为了博取好感而）讨好、奉承某人，常暗示过于刻意或不真诚。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to try to gain someone’s favor by pleasing them (often in a way that feels too eager or insincere)","zh":"通过讨好、奉承来博取某人的好感（常带有过于刻意或不真诚的意味）"},"examples":[{"en":"He ingratiated himself with his boss by constantly praising her ideas.","zh":"他不断称赞老板的想法，借此讨好老板、博取好感。"},{"en":"The salesperson ingratiated herself with friendly small talk before mentioning the price.","zh":"那位销售先用友好的闲聊来拉近关系，然后才提到价格。"}]}],"synonyms":["flattered","buttered up","cozied up to","courted favor"],"phonetic":"/ɪnˈɡreɪʃiˌeɪtɪd/","extraExplanation":["“ingratiated”是动词“ingratiate”的过去式/过去分词，常见搭配是：ingratiate oneself with sb（讨好某人）。","语气上常带轻微贬义：暗示这种“讨好”可能是为了私利、显得谄媚；如果只是单纯“相处融洽/赢得好感”，更中性可以用“get along with / win someone over”。"]}
{"word":"ingratiates","summary":{"en":"“Ingratiates” means tries to win someone’s favor through deliberate friendliness or flattery.","zh":"“ingratiates” 指通过刻意的友好或奉承来博取某人的好感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually with “with”) to try to gain someone’s approval or favor by being especially pleasant, helpful, or flattering.","zh":"（常与 with 连用）通过特别讨好、殷勤或奉承来博取某人的好感/欢心。"},"examples":[{"en":"He ingratiates himself with the boss by staying late and praising every idea.","zh":"他通过加班并称赞老板的每个想法来讨老板欢心。"},{"en":"Some salespeople ingratiate themselves with customers before mentioning the price.","zh":"有些销售会先和顾客套近乎、博好感，然后才提价格。"}]}],"synonyms":["curry favor","brown-nose","flatter","toady","butter up"],"phonetic":"ɪnˈɡreɪʃiˌeɪts","extraExplanation":["“ingratiates” 是动词 “ingratiate” 的第三人称单数（he/she/it ingratiates）。常见结构：ingratiate oneself with sb（让自己在某人那里受欢迎）。","这个词通常带一点负面或批评意味，暗示“刻意讨好/巴结”，比 simply “be friendly” 更不真诚。"]}
{"word":"ingratiating","summary":{"en":"Ingratiating describes someone who flatters or acts overly nice to win favor, often seeming insincere.","zh":"ingratiating 形容为了博取好感而奉承、过分讨好，常给人不真诚的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trying to gain someone’s approval or favor by flattering them or being overly agreeable (often seen as insincere).","zh":"试图通过奉承或过分讨好来赢得他人的好感或支持（常带有“不真诚”的含义）。"},"examples":[{"en":"He gave an ingratiating smile and said the boss’s idea was “brilliant.”","zh":"他露出讨好的笑容，还说老板的主意“太妙了”。"},{"en":"Her ingratiating tone made people suspect she wanted something.","zh":"她那种讨好的语气让人怀疑她是有求于人。"},{"en":"The waiter was friendly without being ingratiating.","zh":"服务员很友好，但并不显得刻意讨好。"}]}],"synonyms":["flattering","fawning","sycophantic","obsequious"],"phonetic":"/ɪnˈɡreɪʃiˌeɪtɪŋ/","extraExplanation":["词源上与拉丁语“gratus”（令人愉快的、受欢迎的）有关。ingratiating 的核心感觉是“让自己变得让人喜欢”，但在现代英语里常暗示“刻意讨好、带目的的奉承”。","常见搭配：ingratiating smile（讨好的微笑）、ingratiating manner/tone（讨好的举止/语气）。对比：friendly（友好，中性或褒义） vs. ingratiating（讨好，常偏贬义）。","文学/叙事中常用来描写“谄媚者/马屁精”的形象，例如政治、职场、宫廷类情节里，角色用 ingratiating 的方式接近权力人物以获取利益。"]}
{"word":"ingratiatingly","summary":{"en":"“Ingratiatingly” means doing or speaking in a flattering, approval-seeking way, often seeming insincere.","zh":"“ingratiatingly”指以讨好、奉承的方式行事或说话，常暗示不够真诚。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that tries to win someone’s approval or favor by being extra polite, flattering, or helpful (often in a way that feels insincere).","zh":"以一种试图通过过分礼貌、奉承或讨好来赢得他人好感/支持的方式（常带有“虚伪、做作”的感觉）。"},"examples":[{"en":"He smiled ingratiatingly and offered to carry her bags, hoping she would say yes.","zh":"他带着讨好似的笑容主动帮她提包，希望她会答应。"},{"en":"The salesperson spoke ingratiatingly, praising my “excellent taste” to push the deal.","zh":"销售员用奉承讨好的语气夸我“品味真好”，想促成交易。"},{"en":"She laughed ingratiatingly at the boss’s jokes, even when they weren’t funny.","zh":"即使老板的笑话并不好笑，她也用讨好的方式笑得很大声。"}]}],"synonyms":["flatteringly","obsequiously","servilely","fawningly"],"phonetic":"/ɪnˈɡreɪʃi.eɪtɪŋli/","extraExplanation":["“ingratiatingly”来自动词“ingratiate (oneself)”，意思是“（使自己）讨人喜欢、巴结、取悦”。常见搭配：smile/speak/laugh/nod ingratiatingly。","语气提示：这个词通常带负面含义，暗示动机是为了利益或地位，而不是真诚的友善。想表达中性“友好地”，更常用 warmly / politely / kindly。","近义词细微差别：obsequiously（更卑躬屈膝、奴颜婢膝）；flatteringly（强调“奉承式地”）；servilely（强调“像仆人一样低贱地”）。"]}
{"word":"ingratiation","summary":{"en":"Ingratiation means trying to win someone’s favor through flattery or pleasing behavior, often in an insincere way.","zh":"Ingratiation 指通过奉承或刻意迎合来博取好感的行为，常带“不真诚、带目的”的贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of trying to gain someone’s favor or approval by flattering them or doing things to please them, often in a way that feels insincere.","zh":"（常含贬义）奉承、讨好：为了获得别人的好感或认可而刻意拍马屁或迎合对方，往往显得不真诚。"},"examples":[{"en":"His compliments sounded like ingratiation rather than genuine praise.","zh":"他的夸奖听起来更像是讨好，而不是真心的赞美。"},{"en":"She avoided ingratiation and spoke honestly, even when it was unpopular.","zh":"她避免奉承讨好，即使不受欢迎也坚持说实话。"},{"en":"Ingratiation may work in the short term, but it can damage trust.","zh":"讨好也许短期有效，但会破坏信任。"}]}],"synonyms":["flattery","sycophancy","fawning","brown-nosing"],"phonetic":"/ɪnˌɡreɪʃiˈeɪʃən/","extraExplanation":["词源上来自拉丁语，核心含义是“让自己进入对方的好感（favor）之中”。因此它常带有“带目的的讨好”这种负面语气，和真诚的称赞（genuine praise）不一样。","常见搭配：ingratiation with sb.（对某人讨好）；through ingratiation（通过讨好手段）。近义词里，flattery（奉承）更强调“说好听的话”，sycophancy（谄媚）更强烈、更贬义；而 charm（魅力）通常偏中性甚至褒义。"]}
{"word":"ingratiatory","summary":{"en":"“Ingratiatory” describes flattering behavior meant to win favor, often seeming insincere.","zh":"“ingratiatory”指为博取好感而刻意奉承的（常显得不真诚）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to gain someone’s approval or favor by flattering them in a way that may feel insincere.","zh":"（为博取好感或恩宠而）讨好的、逢迎的；（常带）虚情假意的奉承。"},"examples":[{"en":"His ingratiatory smile made her feel uneasy, as if he wanted something.","zh":"他那种讨好的笑容让她觉得不自在，好像他有所求。"},{"en":"The email used an ingratiatory tone to persuade the manager to say yes.","zh":"那封邮件用讨好的语气来劝经理答应。"},{"en":"She avoided ingratiatory compliments and spoke honestly instead.","zh":"她避免那种逢迎式的夸奖，而是选择坦诚表达。"}]}],"synonyms":["fawning","sycophantic","toadying","obsequious","flattering"],"phonetic":"/ɪnˈɡreɪʃiəˌtɔri/","extraExplanation":["“ingratiatory”常用于描述一种“为了得到好处而刻意讨好”的语气、微笑或行为，因此带有负面或怀疑的意味。它与“friendly（友好）”不同：friendly更真诚自然；ingratiatory更像带目的的奉承。","词源上与“ingratiate oneself（使自己受欢迎/讨好）”有关，常见搭配：an ingratiatory smile/tone/remark（讨好的笑容/语气/话）。文学或叙事中，它常用来刻画“阿谀奉承的人物形象”。"]}
{"word":"ingratitude","summary":{"en":"Ingratitude means a lack of gratitude—failing to appreciate or thank someone for kindness or help.","zh":"Ingratitude 指“缺乏感恩”，即没有珍惜或感谢他人的善意与帮助。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of gratitude; not appreciating or acknowledging kindness or help you received","zh":"忘恩负义；不懂感恩；对他人的帮助或善意不表示感谢或不珍惜"},"examples":[{"en":"She felt hurt by his ingratitude after everything she had done for him.","zh":"在她为他做了那么多之后，他的忘恩负义让她感到受伤。"},{"en":"Many parents worry that their children will show ingratitude as they grow older.","zh":"许多父母担心孩子长大后会变得不懂感恩。"},{"en":"He wrote a message to apologize for his earlier ingratitude.","zh":"他写了一条信息，为自己先前的不懂感恩道歉。"}]}],"synonyms":["ungratefulness","thanklessness","lack of appreciation"],"phonetic":"/ɪnˈɡrætəˌtud/","extraExplanation":["词源上，in- 表示“否定/不”，gratitude 表示“感激”，因此 ingratitude 字面意思就是“没有感激”。","语气上 ingratitude 比 “not thankful” 更正式、更强烈，常用于表达被辜负、被冷落的情绪，也常出现在文章或演讲中。","常见搭配：show ingratitude（表现出忘恩负义），accuse someone of ingratitude（指责某人忘恩负义），a sense of ingratitude（忘恩负义的感觉/心态）。"]}
{"word":"ingratitudes","summary":{"en":"Ingratitudes means a lack of gratitude, or (in plural) specific ungrateful acts or remarks.","zh":"ingratitudes 指“不感恩/忘恩负义”，也可用复数表示“一次次具体的不领情言行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being ungrateful; lack of appreciation for kindness or help","zh":"忘恩负义；不感恩；对他人善意缺乏感激"},"examples":[{"en":"She was hurt by his ingratitude after all she had done for him.","zh":"在为他付出那么多之后，他的忘恩负义让她很受伤。"},{"en":"The letter complains about the ingratitude shown to the volunteers.","zh":"这封信抱怨志愿者们遭到的“不被感激”。"}]},{"partOfSpeech":"n.","definition":{"en":"unkind or unfriendly actions or words that show you are not grateful (often used in the plural: “ingratitudes”)","zh":"（常用复数）不领情的言行；表示不感激的举动或话语"},"examples":[{"en":"He remembered small ingratitudes—no thank-you, no reply, no recognition.","zh":"他记得一些细微的不领情：没有感谢、没有回复、没有认可。"},{"en":"Over time, their relationship was worn down by repeated ingratitudes.","zh":"久而久之，反复的不领情让他们的关系被消磨了。"}]}],"synonyms":["ungratefulness","thanklessness","insensitivity","lack of appreciation"],"phonetic":"/ɪnˈɡrætəˌtud/","extraExplanation":["“ingratitude”通常是不可数名词，表示一种“品性/状态”；但在写作或较正式的语境里也会用复数“ingratitudes”来指一件件具体的“不领情之举”（有点像“many small slights/insults”的感觉）。","常见搭配：show ingratitude（表现出忘恩负义）、a sense of ingratitude（忘恩感/不感恩的态度）、accuse someone of ingratitude（指责某人忘恩负义）。","近义词辨析：ingratitude强调“没有感激之心”；“rudeness”更偏“无礼”；“betrayal”更强烈，偏“背叛”。"]}
{"word":"ingrave","summary":{"en":"Ingrave means to carve something into a surface, or (figuratively) to make something unforgettable in someone’s mind; it’s a less common spelling of *engrave*.","zh":"ingrave 指“刻（在表面上）”，也可比喻“铭刻在心/难以忘记”；它是 *engrave* 的较少见拼写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Also spelled **engrave**) To cut or carve words, designs, or lines into a hard surface (such as metal, stone, wood, or glass).","zh":"（也常拼作 **engrave**）把文字、图案或线条刻在坚硬表面上（如金属、石头、木头或玻璃）。"},"examples":[{"en":"They ingraved her name on the ring.","zh":"他们把她的名字刻在戒指上。"},{"en":"The artist ingraved a detailed pattern into the metal plate.","zh":"艺术家在金属板上刻出了精细的图案。"}]},{"partOfSpeech":"vt.","definition":{"en":"To fix something deeply in someone’s memory or mind (figurative).","zh":"（比喻）使某事深深印在某人的记忆或心中。"},"examples":[{"en":"That day was ingraved in his memory.","zh":"那一天深深刻在他的记忆里。"},{"en":"Her advice became ingraved in my mind.","zh":"她的建议深深印在我脑海中。"}]}],"synonyms":["engrave","carve","etch","inscribe","chisel"],"phonetic":"/ɪnˈɡreɪv/","extraExplanation":["“ingrave”是较少见的拼写，现代英语更常用“engrave”。在学习和写作中，除非是在古旧文本、特定品牌/作品用法或刻意的风格选择里，一般建议用更常见的“engrave”。","比喻用法中，常见搭配是 **be engraved/ingraved in/on someone’s memory/mind**，意思是“牢记在心/刻骨铭心”。"]}
{"word":"ingravescence","summary":{"en":"Ingravescence means a gradual worsening, especially of an illness or symptom.","zh":"Ingravescence 指（尤指疾病或症状）逐渐加重、恶化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of becoming more severe (especially of a disease, symptom, or problem).","zh":"（尤指疾病、症状或问题）逐渐加重、恶化的过程。"},"examples":[{"en":"The doctor monitored the ingravescence of the infection over the weekend.","zh":"医生在周末期间监测感染逐渐加重的情况。"},{"en":"Early treatment can prevent the ingravescence of chronic pain.","zh":"及早治疗可以防止慢性疼痛逐渐加重。"}]},{"partOfSpeech":"n.","definition":{"en":"A worsening stage or period; an increase in intensity.","zh":"恶化阶段；强度的增加。"},"examples":[{"en":"By the third day, there was a clear ingravescence in her fever.","zh":"到第三天，她的发烧明显进入了加重阶段。"},{"en":"The report warns of an ingravescence of the economic downturn if action is delayed.","zh":"报告警告说，如果延迟行动，经济下滑可能会进一步加重。"}]}],"synonyms":["worsening","deterioration","aggravation","decline"],"phonetic":"/ˌɪnɡrəˈvɛsəns/","extraExplanation":["这个词比较书面、偏医学/学术语境，日常英语里更常用 worsening、deterioration、aggravation 来表达“恶化/加重”。","词源上可理解为拉丁语前缀 in-（“向……/进入”）+ grav-（“重”），整体含义就是“变得更重/更严重”。"]}
{"word":"ingravescent","summary":{"en":"Ingravescent means “gradually getting worse,” especially used in medical writing.","zh":"ingravescent 指“逐渐加重、逐步恶化”，多用于医学或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) becoming worse gradually, especially in severity or intensity of symptoms.","zh":"（医学）逐渐加重的；症状或病情逐步恶化的。"},"examples":[{"en":"The patient entered an ingravescent phase, with pain increasing day by day.","zh":"病人进入逐渐加重期，疼痛一天比一天更强。"},{"en":"Doctors watched for ingravescent fever after the first week of infection.","zh":"感染第一周后，医生密切观察是否出现逐渐加重的发热。"}]}],"synonyms":["worsening","deteriorating","progressively worse","aggravating"],"phonetic":"/ˌɪnɡrəˈvɛsənt/","extraExplanation":["这是一个较少见、偏医学/学术的词，常用于描述“症状逐步加重”的过程；在日常英语中更常用 worsening / getting worse / progressively worse。","词源上可拆理解：in-（向内/加强）+ gravescent（趋于严重的，来自 Latin gravis “沉重、严重”）。因此整体语感是“越来越严重”。","常见搭配：ingravescent symptoms / ingravescent course (of illness) / ingravescent fever。与之相对的表达可用 remitting（缓解的）、improving（好转的）。"]}
{"word":"ingravidate","summary":{"en":"A rare formal verb meaning “to impregnate; to make pregnant.”","zh":"一个罕见的正式动词，意思是“使怀孕；使受孕”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone pregnant; to impregnate (rare, formal/medical).","zh":"使（某人）怀孕；使受孕（罕见、较正式/医学用语）。"},"examples":[{"en":"The report used the term “ingravidate,” meaning to impregnate.","zh":"报告中使用了“ingravidate”一词，意思是“使受孕”。"},{"en":"In modern English, people usually say “impregnate” instead of “ingravidate.”","zh":"在现代英语中，人们通常说“impregnate（使怀孕）”，而不是“ingravidate”。"}]}],"synonyms":["impregnate","make pregnant","get (someone) pregnant"],"phonetic":"/ɪnˈɡrævəˌdeɪt/","extraExplanation":["“ingravidate”非常少见，日常交流几乎不用；写作中更常见、也更自然的表达是“impregnate / get (someone) pregnant / become pregnant”。","词源上与拉丁语“gravidus（怀孕的）”相关（同源词：gravid, gravidity）。因为涉及生育/性相关语境，用词时要注意正式程度与尊重他人。"]}
{"word":"ingravidation","summary":{"en":"A rare/older noun meaning impregnation—the process of becoming or making pregnant.","zh":"一个少见/偏旧式的名词，意为“使受孕（受精、怀孕）的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making someone or something pregnant; impregnation","zh":"使受孕的行为或过程；受精；怀孕（多指使其怀孕/受孕的过程）"},"examples":[{"en":"In older medical texts, the term “ingravidation” was sometimes used to mean impregnation.","zh":"在较早的医学文献中，“ingravidation”有时用来表示“使受孕/受精”。"},{"en":"The report describes ingravidation as occurring shortly after ovulation.","zh":"该报告描述受孕发生在排卵后不久。"}]}],"synonyms":["impregnation","conception","fertilization"],"phonetic":"/ɪnˌɡrævɪˈdeɪʃən/","extraExplanation":["“ingravidation”非常少见、偏旧式/学术用语；现代英语更常用“impregnation”“conception”或“fertilization”（语境不同用词不同）。","词源上与拉丁语“gravidus”（怀孕的）有关；前缀“in-”在这里有“进入/使成为”的感觉，整体指“使进入怀孕状态”。","使用时注意语体：在日常交流中用它会显得生僻或不自然，更适合引用历史医学文献或讨论词源。"]}
{"word":"ingreat","summary":{"en":"An ingrate is someone who is not grateful for help or kindness.","zh":"ingrate 指对别人的帮助或好意不懂感恩的人（忘恩负义的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not show gratitude for help or kindness; an ungrateful person","zh":"忘恩负义的人；不知感恩的人"},"examples":[{"en":"After everything she did for him, he acted like an ingrate.","zh":"她为他做了那么多，他却表现得像个忘恩负义的人。"},{"en":"Don’t be an ingrate—say thank you when someone helps you.","zh":"别当忘恩负义的人——别人帮了你要说谢谢。"}]},{"partOfSpeech":"adj.","definition":{"en":"not showing gratitude; ungrateful (less common)","zh":"不感恩的；忘恩负义的（较少见）"},"examples":[{"en":"He gave an ingrate response instead of appreciating the gift.","zh":"他对礼物的回应很不领情，而不是表示感谢。"}]}],"synonyms":["ungrateful person","thankless person","ingratitude (related noun)"],"phonetic":"/ˈɪnˌɡreɪt/","extraExplanation":["你输入的“ingreat”常见情况是拼写误差，更可能想查的是 **ingrate**（忘恩负义的人）。另一个容易混淆的是短语 **in great + 名词**（例如 *in great danger* 处于极大危险中；*in great detail* 非常详细地），它需要空格，不是一个单词。","词源提示：**ingrate** 来自拉丁语词根 *gratus*（“感激的、令人愉快的”），同根词有 **grateful**（感激的）、**gratitude**（感激）。语气上 **ingrate** 比单纯说 “ungrateful” 更强，更像带批评。"]}
{"word":"ingredience","summary":{"en":"An ingredient is a part of a recipe or, more generally, an element that contributes to a result.","zh":"ingredient 指做菜的原料/配料，也可泛指促成结果的要素、组成部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A food item used to make a dish; one of the parts of a recipe.","zh":"（烹饪）原料；配料（做一道菜的食材之一）"},"examples":[{"en":"The soup has only three ingredients: tomatoes, garlic, and salt.","zh":"这道汤只有三种原料：番茄、大蒜和盐。"},{"en":"Check the ingredients list if you have allergies.","zh":"如果你有过敏史，请查看配料表。"}]},{"partOfSpeech":"n.","definition":{"en":"One part or element of something (not only food) that helps create a result.","zh":"（泛指）要素；组成部分（促成某种结果的一部分）"},"examples":[{"en":"Trust is an important ingredient in any relationship.","zh":"信任是任何关系中重要的要素。"},{"en":"Practice is a key ingredient for improvement.","zh":"练习是进步的关键因素。"}]},{"partOfSpeech":"adj.","definition":{"en":"Forming part of something; acting as a component (less common).","zh":"构成……的一部分的；起组成作用的（较少用）"},"examples":[{"en":"Chance is an ingredient factor in the story.","zh":"偶然性是这个故事中的一个组成因素。"}]}],"synonyms":["component","element","constituent","factor"],"phonetic":"/ɪnˈɡriːdiənt/","extraExplanation":["“ingredience”通常是拼写错误；正确拼写是 **ingredient**（复数：ingredients）。","常见搭配：**ingredients list**（配料表）、**main ingredient**（主要原料）、**secret ingredient**（秘密配方/关键因素）。在非烹饪语境里，ingredient 常用于比喻：如 “the ingredients for success”（成功的要素）。"]}
{"word":"ingrediens","summary":{"en":"“Ingredients” means the materials/foods used to make something, or (figuratively) an important factor needed for success.","zh":"“Ingredients”指制作某物所用的原料/成分，也可引申为成功所需的重要因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Correct spelling: ingredients) the foods or substances used to make a dish, product, or mixture.","zh":"（正确拼写：ingredients）用于制作菜肴、产品或混合物的原料；成分。"},"examples":[{"en":"Check the ingredients before you buy it if you have allergies.","zh":"如果你有过敏史，购买前先查看配料表/成分表。"},{"en":"This soup has simple ingredients: tomatoes, onions, and garlic.","zh":"这道汤的原料很简单：西红柿、洋葱和大蒜。"},{"en":"Water is an important ingredient in many medicines.","zh":"水是许多药物中的重要成分。"}]},{"partOfSpeech":"n.","definition":{"en":"a necessary part or quality that helps make something successful.","zh":"（比喻）成功所必需的要素；关键因素。"},"examples":[{"en":"Patience is a key ingredient in learning a new language.","zh":"耐心是学习新语言的关键要素。"},{"en":"Trust is an essential ingredient in any healthy relationship.","zh":"信任是任何健康关系中不可或缺的要素。"}]}],"synonyms":["components","elements","materials","parts","constituents"],"phonetic":"/ɪnˈɡriːdiənts/","extraExplanation":["你输入的“ingrediens”是拼写错误，常见正确拼写是“ingredients”（复数）或“ingredient”（单数）。","在包装上常见搭配：ingredients list（配料表/成分表）；常见表达：key ingredient（关键因素）、active ingredient（有效成分，常用于药品/护肤品）。"]}
{"word":"ingredient","summary":{"en":"An ingredient is something you put into a dish or product; it can also mean an important factor in achieving a result.","zh":"ingredient 指做菜或制作产品时加入的“原料/成分”，也可引申为促成结果的“要素/因素”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the foods or substances used to make a particular dish, product, or mixture.","zh":"（烹饪或制作时用的）原料；成分。"},"examples":[{"en":"Flour is a basic ingredient in many breads.","zh":"面粉是许多面包的基本原料。"},{"en":"Check the ingredient list if you have allergies.","zh":"如果你有过敏史，请查看配料表。"}]},{"partOfSpeech":"n.","definition":{"en":"A quality, factor, or element that helps produce a result (often used in a more abstract way).","zh":"（抽象）要素；因素（促成某种结果的元素）。"},"examples":[{"en":"Trust is an important ingredient in a healthy relationship.","zh":"信任是健康关系中的重要因素。"},{"en":"Patience is a key ingredient for learning a new language.","zh":"耐心是学习一门新语言的关键要素。"}]}],"synonyms":["component","element","constituent","factor"],"phonetic":"/ɪnˈɡriːdiənt/"}
{"word":"ingredients","summary":{"en":"“Ingredients” means the things used to make food or a product, and it can also mean the key factors that help create a result.","zh":"“Ingredients”指制作食物或产品所用的原料/成分，也可引申为促成某结果的关键要素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Foods or substances used to make a dish, product, or mixture.","zh":"（烹饪或制作中使用的）原料；成分"},"examples":[{"en":"What ingredients do we need to make pancakes?","zh":"做煎饼我们需要哪些原料？"},{"en":"The soup has simple ingredients: tomatoes, onions, and garlic.","zh":"这道汤的原料很简单：番茄、洋葱和大蒜。"},{"en":"Always check the ingredients list if you have allergies.","zh":"如果你有过敏史，一定要查看配料表。"}]},{"partOfSpeech":"n.","definition":{"en":"A quality or factor that helps create a result (often used with “for” or “in”).","zh":"（促成某结果的）要素；因素（常与 for / in 搭配）"},"examples":[{"en":"Patience is an important ingredient for success.","zh":"耐心是成功的重要要素。"},{"en":"Trust is a key ingredient in a healthy relationship.","zh":"信任是健康关系中的关键因素。"}]}],"synonyms":["components","elements","materials","parts","factors"],"phonetic":"/ɪnˈɡriːdiənts/","extraExplanation":["“Ingredients”通常用复数，尤其是在谈论食谱或包装上的“ingredients list（配料表）”。单数“ingredient”指某一种原料/成分。","在英式英语里，包装上也常见“ingredients”；美式英语同样常用。口语里谈食品时也会说“what’s in it?”（里面有什么成分/原料？）。"]}
{"word":"ingress","summary":{"en":"Ingress means entering or an entrance, and it can also mean something (like water or air) coming in.","zh":"Ingress 指进入或入口；也可指水、空气等的涌入（多用于正式或技术语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of entering; the way or right to enter a place","zh":"进入；入口；进入的权利"},"examples":[{"en":"Use the side door for ingress to the building.","zh":"进入这栋楼请走侧门。"},{"en":"The concert hall has clear signs showing ingress and egress.","zh":"音乐厅有清晰的标识指示入口和出口。"},{"en":"Security checked everyone at the point of ingress.","zh":"安保在入口处检查每个人。"}]},{"partOfSpeech":"n.","definition":{"en":"the coming in or accumulation of something (such as water, light, or air)","zh":"（水、光、空气等的）涌入；进入并聚集"},"examples":[{"en":"Engineers worked to stop the ingress of water into the tunnel.","zh":"工程师努力阻止水涌入隧道。"},{"en":"Seal the windows to prevent the ingress of cold air.","zh":"把窗户封好以防冷空气进入。"}]}],"synonyms":["entry","entrance","access","admission","inflow"],"phonetic":"/ˈɪnɡrɛs/","extraExplanation":["“Ingress”比较正式，常见于建筑、法律和工程语境，尤其和“egress（出口/离开）”成对出现：ingress and egress（出入口/进出）。","日常口语里更常用 enter / entrance / entry；在技术文档里则常用 water ingress（进水）、dust ingress（进尘）等。"]}
{"word":"ingresses","summary":{"en":"“ingresses” is the plural of the noun “ingress” (entrances/entry) or the third-person singular form of the verb “ingress” (to enter, often technical).","zh":"“ingresses”可作名词复数，表示“入口/进入”；也可作动词第三人称单数，表示“进入”（多用于技术或正式语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun of “ingress”) entrances; ways or places you can enter, or the act/process of entering.","zh":"（“ingress”的复数名词）入口；进入的通道；进入这一行为/过程。"},"examples":[{"en":"The building has two main ingresses: the front door and the side gate.","zh":"这栋楼有两个主要入口：正门和侧门。"},{"en":"During emergencies, keep all ingresses clear.","zh":"紧急情况下，请保持所有入口畅通。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular verb of “ingress”) to enter or to go in (often used in technical or formal writing).","zh":"（“ingress”的第三人称单数动词）进入；进到……里（多见于技术或正式语境）。"},"examples":[{"en":"Water ingresses through tiny cracks in the seal.","zh":"水会通过密封处的细小裂缝渗入。"},{"en":"New data ingresses into the system every hour.","zh":"新数据每小时都会进入系统。"}]}],"synonyms":["entrances","entries","access points","entryways","goes in","enters"],"phonetic":"/ˈɪnˌɡrɛs/","extraExplanation":["“ingress”在日常口语里不如“entrance / enter”常见；在工程、建筑、安全规范、IT/网络等领域更常用。比如“water ingress（进水/渗水）”“ingress traffic（入站流量）”。","在网络语境里常与“egress（出站/外出）”成对使用：ingress=进、egress=出。"]}
{"word":"ingression","summary":{"en":"Ingression is a formal noun meaning “entering” or “the right to enter,” and less commonly “the beginning/first appearance of something.”","zh":"ingression 是较正式的名词，主要指“进入/进入权”，较少也可指“某事物的开端或初现”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of entering or the right/permission to enter a place.","zh":"进入的行为；进入某地的权利/许可。"},"examples":[{"en":"No ingression is allowed after the doors close.","zh":"大门关闭后禁止进入。"},{"en":"The sign warned against unauthorized ingression to the lab.","zh":"告示警告：未经许可不得进入实验室。"}]},{"partOfSpeech":"n.","definition":{"en":"A beginning or first appearance of something, especially in a gradual way.","zh":"（事物的）开始、初现，尤指逐渐发生的开端。"},"examples":[{"en":"They noticed the ingression of winter in the colder mornings.","zh":"他们从更冷的清晨察觉到冬天的来临。"},{"en":"The essay traces the ingression of new ideas into public debate.","zh":"这篇文章追溯新观念进入公共讨论的开端。"}]}],"synonyms":["entry","entrance","access","ingress","advent","onset"],"phonetic":"/ɪnˈɡrɛʃən/","extraExplanation":["“ingression”较正式、书面，日常英语里更常用“entry/entrance/access”（进入/入口/通行权）。在法律、公告、或较古典的文风中更可能见到“ingression”。","词源上来自拉丁语“ingredi”（进入），与“ingress”（进入、进入权）同源；在现代英语里“ingress”比“ingression”更常见。","常见搭配：unauthorized ingression（未经许可的进入）、right of ingression and egression（进入与离开的权利，常见于法律/地产语境）。"]}
{"word":"ingressive","summary":{"en":"Ingressive means “moving inward” or, in linguistics, “spoken while breathing in.”","zh":"Ingressive 指“向内进入的”，在语言学中也指“吸气式发音的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics/phonetics) Made while breathing in, not out; produced with an inward airflow.","zh":"（语言学/语音学）吸气式的；在吸气时发出的（气流向内）。"},"examples":[{"en":"In some accents, a quick “yeah” can be spoken with ingressive airflow.","zh":"在某些口音里，简短的“yeah”有时会用吸气式气流说出来。"},{"en":"The teacher explained that ingressive sounds are less common than egressive (outgoing) ones in English.","zh":"老师解释说，吸气式的声音在英语里不如呼气式（向外）常见。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Moving inward, entering, or directed into a body or a part; incoming.","zh":"（生物/医学）向内的；进入的；导入的；传入的。"},"examples":[{"en":"The report described ingressive movement of fluid into the tissue.","zh":"报告描述了液体向组织内的内向进入运动。"},{"en":"Ingressive flow can affect how substances are absorbed.","zh":"向内的流动会影响物质的吸收方式。"}]}],"synonyms":["inward","incoming","inhaling (linguistics context)","inspiratory (medical context)"],"phonetic":"/ɪnˈɡrɛsɪv/","extraExplanation":["在语音学里，英语大多数语音是“呼气式/外向气流”（egressive），也就是边呼气边发音；“ingressive（吸气式）”更少见，但在某些方言或口语情境中，会出现吸气说“yeah / yep / no”等短词的现象。它常给人一种“轻声回应、表示惊讶或犹豫”的语气感。","词源上，ingressive 来自 in-（向内）+ gress（行走/进入；同根词如 progress, regress），字面就是“向内进入的”。"]}
{"word":"ingressiveness","summary":{"en":"Ingressiveness means the quality of entering or moving inward; in phonetics, it can mean being produced with inward airflow.","zh":"Ingressiveness 指“进入/向内移动的性质”；在语音学中也可指“吸气式（内向气流）发音的特征”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of entering or moving inward; a tendency to go into something (formal/rare)","zh":"进入性；向内进入的倾向（较正式/少见）"},"examples":[{"en":"The ingressiveness of water through the cracked seal caused slow damage.","zh":"水通过破裂密封处的进入性导致了缓慢的损坏。"},{"en":"Researchers measured the chemical’s ingressiveness into the soil after heavy rain.","zh":"研究人员在暴雨后测量了该化学物质进入土壤的程度。"}]},{"partOfSpeech":"n.","definition":{"en":"(phonetics) the quality of being produced with an inward airflow, as in some speech sounds","zh":"（语音学）内向气流发音性；用吸气气流发出的语音特征"},"examples":[{"en":"In class we discussed the ingressiveness of certain clicks in southern African languages.","zh":"课堂上我们讨论了南部非洲一些语言中某些咔嗒音的内向气流发音特征。"},{"en":"English is mostly spoken with outward airflow, so ingressiveness is uncommon for most learners.","zh":"英语主要使用呼气气流发音，所以对大多数学习者来说内向气流发音并不常见。"}]}],"synonyms":["penetration","infiltration","entry","inward movement"],"phonetic":"/ˈɪnˌɡrɛsɪvnəs/","extraExplanation":["“ingressiveness”来自形容词“ingressive”（进入的；内向气流的），而“ingressive”又与“ingress”（进入，入口）同源。日常英语中更常见的说法通常是“penetration”（渗入/穿透）、“infiltration”（渗透）或“entry”（进入）。","语音学里的“ingressive”指“吸气式气流（inward airflow）”发音，与英语常见的“egressive”（呼气式气流）相对。很多语言现象会用“ingressive/egressive”来描述气流方向。"]}
{"word":"ingreve","summary":{"en":"Ingreve is usually a proper name, not a common English word.","zh":"Ingreve通常是专有名词，不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Ingreve” is not a standard English vocabulary word; it is most likely a proper name (a surname or place name) seen in specific contexts (e.g., family names, usernames, or local names).","zh":"“Ingreve”不是常见的英语词汇；更可能是专有名词（姓氏或地名），多出现在特定语境中（如家族姓、用户名或地方名称）。"},"examples":[{"en":"The message was signed, “A. Ingreve.”","zh":"信息落款是“A. Ingreve”。"},{"en":"Ingreve is listed as a last name in the records.","zh":"档案中把Ingreve列为姓氏。"}]}],"phonetic":"/ˈɪnɡrɛv/","extraExplanation":["“Ingreve”可能是拼写误差：\n- 如果你想表达“刻上、雕刻”，常见词是 **engrave**（动词）。\n- 如果你想到的是英国戏剧家 **William Congreve**（康格里夫），拼写是 **Congreve**。\n把原句或出现它的上下文发我，我可以帮你判断到底是哪一个。"]}
{"word":"Ingrid","summary":{"en":"a Scandinavian-origin female given name","zh":"源自北欧的女性名字"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, common in Scandinavia and also used in English-speaking countries","zh":"女性名字（常见于北欧国家，也用于英语国家）"},"examples":[{"en":"Ingrid is joining our team next Monday.","zh":"Ingrid 下周一会加入我们的团队。"},{"en":"I met Ingrid at a conference in Stockholm.","zh":"我在斯德哥尔摩的一场会议上认识了 Ingrid。"}]}],"synonyms":["Inga","Astrid","Sigrid"],"phonetic":"/ˈɪŋɡrɪd/","extraExplanation":["在英语语境里，Ingrid 通常被视为带有“北欧气质”的名字。著名人物包括瑞典演员 Ingrid Bergman（英格丽·褒曼），因此在国际上辨识度较高。","发音要点：开头是 /ɪŋ/，像 sing 里的 -ng- 音；重音在第一音节：IN-grid。"],"etymology":"源自古诺尔斯语（Old Norse）Ingfríðr：Ing- 与北欧神话相关（常被解释为与神祇/部族名“Ing/Yngvi”有关）+ fríðr（意为“美丽、可爱、受喜爱”）。后来作为北欧常见女性名进入多种欧洲语言，并被英语吸收使用。","mnemonic":["把它拆成发音记忆：IN（像“因”）+ grid（像“格子/网格”），联想成“因（IN）为网格（grid）很有条理的人”，= Ingrid。","联想名人：Ingrid Bergman（英格丽·褒曼），用影视记忆更牢。"]}
{"word":"ingross","summary":{"en":"“Ingross” is a rare/archaic word meaning “in bulk/wholesale,” or (as a verb) “to write a document out in its final formal form” (like “engross”).","zh":"“Ingross”是罕见/古旧词，意思是“整批地/批发地”；作动词时指“把文件誊写成正式定稿”（类似“engross”）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In bulk; wholesale; all together rather than in separate parts.","zh":"整批地；批发地；整体地（而不是零散地）。"},"examples":[{"en":"They sold the books ingross to a single buyer.","zh":"他们把这批书整批卖给了一个买家。"},{"en":"The land was leased ingross, not in small plots.","zh":"这片土地是整体出租的，而不是分成小块出租。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To write out a document in full and in its final, formal form; to engross.","zh":"（古义）把文件誊写成完整的正式定稿；誊写（同 engross）。"},"examples":[{"en":"The clerk was asked to ingross the contract before it was signed.","zh":"书记员被要求在签署前把合同誊写成正式定稿。"},{"en":"After revisions, the agreement was ingrossed for the record.","zh":"修改后，该协议被誊写成定稿以供存档。"}]}],"synonyms":["in bulk","wholesale","altogether","engross","copy out"],"phonetic":"/ɪnˈɡroʊs/","extraExplanation":["“ingross”在现代英语中非常少见，更多时候你会看到拼写为“engross”。“engross”除了“誊写成正式定稿（法律/文书用语）”外，在现代更常用的意思是“使全神贯注、占据（某人注意力）”，例如：*The novel engrossed me.*（这本小说让我入迷）。","“ingross（整批地）”这个用法带有历史色彩，常见于旧式商业、土地、法律语境；日常英语里通常用 *in bulk*（成批地）或 *wholesale*（批发地）来表达。"]}
{"word":"ingrossing","summary":{"en":"Engrossing means extremely interesting and attention-holding.","zh":"Engrossing 指非常有趣、引人入胜，让人全神贯注。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"So interesting and absorbing that it holds your full attention.","zh":"非常吸引人、引人入胜的；让人全神贯注的。"},"examples":[{"en":"It was an engrossing novel—I couldn’t put it down.","zh":"那本小说引人入胜——我放不下。"},{"en":"The documentary is engrossing, even for people who don’t like history.","zh":"这部纪录片很吸引人，即使是不喜欢历史的人也会看得入迷。"},{"en":"We had an engrossing conversation that lasted for hours.","zh":"我们进行了一场引人入胜的谈话，持续了好几个小时。"}]}],"synonyms":["captivating","fascinating","absorbing","gripping","riveting"],"phonetic":"ɪnˈɡroʊsɪŋ","extraExplanation":["你输入的“ingrossing”通常是拼写误写；标准拼写是“engrossing”。","“engrossing”常用来形容书、电影、故事、谈话、讲座等“让人沉浸其中”的体验，语气偏褒义。","相关词：动词“engross”（使全神贯注；也可指“正式誊写/抄写（文件）”，较少见）；名词“engrossment”（全神贯注；或正式誊写的文本）。"]}
{"word":"ingroup","summary":{"en":"An ingroup is the group you identify with and feel you belong to, often contrasted with an outgroup.","zh":"ingroup 指你认同并觉得自己属于的“内群体”，常与 outgroup（外群体）相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A social group you feel you belong to, whose members share an identity, loyalty, or common interests (often contrasted with an outgroup).","zh":"你觉得自己“属于其中”的群体；成员之间共享身份认同、忠诚或共同利益（常与外群体 outgroup 相对）。"},"examples":[{"en":"At work, the design team became my ingroup, so I naturally trusted their opinions more.","zh":"在工作中，设计团队成了我的内群体，所以我会更自然地信任他们的看法。"},{"en":"Sports fans often treat their team’s supporters as the ingroup and everyone else as the outgroup.","zh":"体育迷常把支持自己球队的人当作内群体，把其他人当作外群体。"},{"en":"Teachers can reduce ingroup bias by mixing students into new groups for projects.","zh":"老师可以通过把学生重新混合分组做项目来减少内群体偏见。"}]}],"synonyms":["in-group","inner circle","one’s group","clique (informal, often negative)"],"phonetic":"/ˈɪnˌɡruːp/","extraExplanation":["“ingroup”也常写作“in-group”。在社会心理学里，它常和“ingroup bias（内群体偏见）”“ingroup favoritism（内群体偏袒）”一起出现，指人们更容易偏爱、信任或优先照顾自己所属的群体成员。","日常语境中，这个词不一定带贬义：它既可以只是描述“圈子/自己人”，也可能暗示排他性（例如不让外群体参与）。正式写作中常用连字符 in-group。"]}
{"word":"ingroups","summary":{"en":"“Ingroups” is the plural of “ingroup”: groups you identify with as “us,” often contrasted with out-groups.","zh":"“ingroups”是“ingroup”的复数：你认同并视为“我们”的群体，常与“out-group（外群体）”对比。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A social group that you feel you belong to and identify with, often contrasted with an out-group.","zh":"你觉得自己属于并认同的“自己人”群体（常与 out-group“外群体”相对）。"},"examples":[{"en":"In high school, it was easy to tell which students were part of the in-group.","zh":"在高中，很容易看出哪些学生属于“自己人”那一群。"},{"en":"People often trust the in-group more than outsiders.","zh":"人们往往更信任自己所属的群体，而不是外人。"},{"en":"The manager tried to break down barriers between in-groups and new employees.","zh":"经理试图打破“圈内人”和新员工之间的隔阂。"}]}],"synonyms":["in-group","inner circle","clique","insiders"],"phonetic":"/ˈɪnˌɡrup/","extraExplanation":["“in-group”常见于社会心理学与社会学，强调“我们（we）”的归属感与偏好；与“out-group（外群体）”一起出现很频繁。","拼写上既可写作 in-group（更常见、较正式），也可写作 ingroup；复数为 in-groups / ingroups。","讨论“in-group bias（内群体偏见）”时要注意语境：它描述一种常见心理倾向，并不一定等同于有意的歧视，但可能导致不公平对待。"]}
{"word":"ingrow","summary":{"en":"Ingrow means to grow inward into the skin or tissue, especially referring to nails or hair.","zh":"Ingrow 指（指甲或毛发）向内生长、长进皮肤或组织里。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to grow inward (into surrounding tissue) instead of outward, often causing pain or irritation (commonly used for hair or nails)","zh":"（毛发或指甲）向内生长、长进皮肤里，常引起疼痛或发炎"},"examples":[{"en":"His toenail began to ingrow and became very painful.","zh":"他的脚趾甲开始向内生长，变得很疼。"},{"en":"Tight shoes can make a nail ingrow more easily.","zh":"鞋子太紧会让指甲更容易向内生长。"},{"en":"Some people get ingrown hairs that ingrow after shaving.","zh":"有些人刮完胡子/体毛后会出现向内生长的倒长毛。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something (especially hair or a nail) to grow inward","zh":"使（毛发或指甲等）向内生长"},"examples":[{"en":"Repeated pressure can ingrow the edge of the nail.","zh":"反复的挤压会使指甲边缘向内长。"}]}],"synonyms":["grow inward","grow into the skin","become ingrown"],"phonetic":"/ˈɪnˌɡroʊ/","extraExplanation":["“ingrow”在日常英语里不算特别常见；更常见的说法是形容词“ingrown”，例如“an ingrown toenail（嵌甲/趾甲内生）”或“ingrown hair（倒长毛）”。在医疗或护理语境中也常用短语“grow into the skin（长进皮肤里）”。"]}
{"word":"ingrowing","summary":{"en":"“Ingrowing” describes something (especially a nail) growing inward into surrounding tissue; it can also be the -ing form of “ingrow.”","zh":"“ingrowing”指（尤指指甲）向内生长并长进周围组织；也可作“ingrow”的-ing形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in medicine) Growing inward into surrounding tissue, instead of outward; most commonly said of a nail or hair.","zh":"（尤用于医学）向内生长、长进周围组织里；最常指嵌甲（趾甲内生）或倒生毛发。"},"examples":[{"en":"He went to the clinic for an ingrowing toenail.","zh":"他因为趾甲内生（嵌甲）去诊所看病。"},{"en":"Tight shoes can make an ingrowing nail worse.","zh":"鞋子太紧会让嵌甲更严重。"}]},{"partOfSpeech":"adj.","definition":{"en":"(biology/botany) Growing inward as part of a developmental process.","zh":"（生物/植物）作为发育过程的一部分向内生长。"},"examples":[{"en":"Some tissues show ingrowing cells during healing.","zh":"在愈合过程中，一些组织会出现细胞向内生长。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of “ingrow”: to grow inward.","zh":"“ingrow”的现在分词：向内生长。"},"examples":[{"en":"The roots are ingrowing into cracks in the wall.","zh":"根正在向内长进墙上的裂缝里。"}]}],"synonyms":["ingrown","inward-growing","embedded"],"phonetic":"/ˈɪnˌɡroʊɪŋ/","extraExplanation":["“ingrowing”在日常英语里最常出现在固定搭配“ingrowing toenail（嵌甲/趾甲内生）”。更常见、更口语的说法是“ingrown”（如：an ingrown toenail）。","与“in-grown/ingrown”相比，“ingrowing”更强调“正在向内生长”的过程感，在医学/书面语中更常见；日常对话里通常直接说“ingrown”。"]}
{"word":"ingrown","summary":{"en":"Ingrown usually describes hair or a toenail that grows into the skin, causing irritation or pain; it can also mean emotionally or socially inward/closed-off.","zh":"Ingrown 通常指毛发或趾甲向内长进皮肤里引起不适或疼痛；也可比喻情绪或社交上更内向、封闭。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Growing inward instead of outward, especially into the skin (common with hair or toenails).","zh":"（尤指毛发或脚趾甲）向内生长、长进皮肤里的（常见于“倒生毛/嵌甲”）。"},"examples":[{"en":"I have an ingrown toenail, and it really hurts when I walk.","zh":"我得了嵌甲，走路时很疼。"},{"en":"Shaving too closely can cause ingrown hairs.","zh":"刮得太贴皮肤可能会导致倒生毛。"}]},{"partOfSpeech":"adj.","definition":{"en":"Growing or developing inward in a figurative or psychological way; turned in on itself.","zh":"（比喻/心理）向内发展、内向的；封闭在自我之中的。"},"examples":[{"en":"After the loss, he became more ingrown and quiet.","zh":"经历那次失去之后，他变得更内向、更安静。"},{"en":"An ingrown community can be suspicious of outsiders.","zh":"一个过于封闭的社区可能会对外来者抱有戒心。"}]}],"synonyms":["inward-growing","embedded","inward","introverted"],"phonetic":"/ˈɪnˌɡroʊn/","extraExplanation":["医学常见搭配：ingrown toenail（嵌甲），ingrown hair（倒生毛/内生毛）。日常表达里更常说“an ingrown toenail / ingrown hairs”，而不是单独说“an ingrown”。","护理与就医提示（一般信息）：轻度倒生毛可尝试温水热敷、避免继续剃刮刺激；嵌甲若出现红肿、化脓、发热或疼痛加重，建议就医处理。"]}
{"word":"ingrownness","summary":{"en":"“Ingrownness” means the condition of being ingrown, especially referring to an ingrown toenail or hair.","zh":"“ingrownness”指“内生”的状态，尤其常用于描述嵌甲或倒生毛发。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or condition of being ingrown (growing inward instead of outward), especially used about a toenail or hair.","zh":"内生（向内生长而不是向外生长）的状态；常指嵌甲或倒生毛发的情况。"},"examples":[{"en":"The doctor said the pain was caused by ingrownness of the toenail.","zh":"医生说疼痛是由脚趾甲内生（嵌甲）的情况引起的。"},{"en":"Regular trimming can sometimes prevent ingrownness around the nail edge.","zh":"定期修剪有时能预防指甲边缘出现内生的情况。"}]}],"synonyms":["ingrowth","being ingrown","ingrown condition"],"phonetic":"/ˈɪnˌɡroʊn.nəs/","extraExplanation":["“ingrownness”在日常英语里不算常见，更常用的说法是“an ingrown toenail（嵌甲）”或“ingrown hair（倒生毛发）”。","词形上它是由“ingrown（内生的）+ -ness（名词后缀，表示状态）”构成，意思就是“内生的状态”。在医疗或较正式的写作中偶尔会出现。"]}
{"word":"ingrowth","summary":{"en":"Ingrowth means inward growth, especially tissue (or hair/nails) growing into surrounding tissue; it’s common in medical/biological contexts.","zh":"Ingrowth 指“向内生长”，常见于医学/生物语境，尤其指组织（或毛发/指甲）长入周围组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An inward growth; something (such as hair, a nail, or tissue) that grows into surrounding tissue instead of outward.","zh":"内向生长；（如毛发、指甲或组织）向周围组织里长进去的东西。"},"examples":[{"en":"He went to the clinic for an ingrown toenail—an ingrowth of the nail into the skin.","zh":"他因为嵌甲去诊所了——指甲向皮肤里长的内向生长。"},{"en":"The dentist checked the x-ray for signs of tissue ingrowth around the implant.","zh":"牙医查看了X光片，看看种植体周围是否有组织内生长的迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/medicine, the process of cells or tissue growing into an area, often into a foreign material (like an implant).","zh":"（生物/医学）内生长过程；细胞或组织长入某个区域，常指长入外来材料（如植入物）中。"},"examples":[{"en":"Successful healing depends on healthy tissue ingrowth.","zh":"成功的愈合取决于健康的组织内生长。"},{"en":"The new scaffold material encourages bone ingrowth.","zh":"这种新的支架材料能促进骨内生长。"}]}],"synonyms":["inward growth","ingrown growth","infiltration (in biology/medicine)"],"phonetic":"/ˈɪnˌɡroʊθ/","extraExplanation":["“ingrowth”常用于医学/生物学语境；日常生活中更常听到的是“ingrown”，例如“an ingrown toenail（嵌甲/脚趾甲长进肉里）”。","词形提示：in-（向内）+ growth（生长）。在论文或医疗说明里，“tissue/bone ingrowth（组织/骨内生长）”是固定搭配，强调“长入内部/长进去”的方向感。"]}
{"word":"ingrowths","summary":{"en":"Ingrowths are inward-growing (often abnormal) growths in tissue, or figuratively, developments arising from within a system.","zh":"Ingrowths 指向内生长（常为异常）的组织增生，也可比喻为从系统内部产生的发展或问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Abnormal or unwanted growths that grow inward (into surrounding tissue), especially in medicine or biology.","zh":"（尤用于医学/生物学）向内生长、侵入周围组织的异常或不需要的增生/赘生物。"},"examples":[{"en":"The doctor examined the ingrowths around the toenail.","zh":"医生检查了脚趾甲周围的向内生长组织（嵌甲相关增生）。"},{"en":"Microscopy showed ingrowths of tissue into the damaged area.","zh":"显微镜检查显示组织向受损区域内生长。"}]},{"partOfSpeech":"n.","definition":{"en":"Developments or features that arise from within a system or group (a figurative use).","zh":"（比喻用法）从体系或群体内部产生的发展、特征或问题。"},"examples":[{"en":"The report warns about ingrowths of bias in the decision-making process.","zh":"报告警告决策过程中可能滋生的偏见。"},{"en":"Some cultural ingrowths strengthened the community over time.","zh":"一些文化的内生发展随着时间增强了社区凝聚力。"}]}],"synonyms":["inward growths","abnormal growths","tissue overgrowth","encroachment","internal developments"],"phonetic":"ˈɪnˌɡroʊθs","extraExplanation":["“ingrowths”是复数形式，单数是“ingrowth”。在医学语境里常见于描述“向内生长”的情况，比如 ingrown toenail（嵌甲）相关的组织增生，或血管/神经向某个区域“长入”(in-growth) 的现象。","日常英语里更常说“abnormal growths / tissue growth”或直接用更具体的词（如“ingrown hair”倒生毛发）；“ingrowth(s)”偏书面、技术性更强。"]}
{"word":"ingruent","summary":{"en":"Ingruent means not fitting or not matching the situation; out of harmony.","zh":"ingruent 指“不相称、不协调”，与情境或整体格格不入。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not fitting well with something; lacking harmony or agreement; unsuitable in the context.","zh":"不相称的；不协调的；与情境不相符的。"},"examples":[{"en":"His casual jokes felt ingruent at the serious memorial service.","zh":"在庄重的追悼会上，他随意的玩笑显得很不合时宜。"},{"en":"The bright neon sign looked ingruent on the quiet, historic street.","zh":"在安静的历史街区里，那块亮眼的霓虹招牌显得格格不入。"}]}],"synonyms":["incongruent","inappropriate","out of place","inharmonious","mismatched"],"phonetic":"/ɪnˈɡruːənt/","extraExplanation":["“ingruent”在现代英语中比较少见，更常用的是“incongruent”。两者意思非常接近，都表示“不协调/不相称”。","它与“congruent（相符的；一致的）”有关：在数学/几何里，congruent常指“全等的”；在日常语境里指“与……一致/相符”。“ingruent”则强调“与整体不搭”。"]}
{"word":"ings","summary":{"en":"“-ing” is a common ending used to make present participles and gerunds; “ing/ings” can also (rarely) mean a meadow or pasture in some dialects.","zh":"“-ing”是常见词尾，用于构成现在分词和动名词；“ing/ings”在一些方言中也可（较罕见）指草地或牧场。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Suffix) Added to a verb to form the present participle (used in continuous tenses) or a gerund (a verb used like a noun).","zh":"（后缀）加在动词后面，构成现在分词（用于进行时）或动名词（动词名词化）。"},"examples":[{"en":"She is studying right now.","zh":"她现在正在学习。"},{"en":"Swimming is good exercise.","zh":"游泳是很好的运动。"},{"en":"I enjoy reading before bed.","zh":"我喜欢睡前阅读。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare noun meaning a meadow or pasture (used in some dialects, especially in Scotland and Northern England). The plural is “ings.”","zh":"（罕见名词）指草地、牧场（多见于方言用法，尤其苏格兰及英格兰北部）。复数形式为“ings”。"},"examples":[{"en":"They walked across the ings by the river.","zh":"他们走过河边的那片草地。"},{"en":"Cattle grazed on the ings in summer.","zh":"夏天牛群在那片牧场上吃草。"}]}],"synonyms":["meadow","pasture","grassland"],"phonetic":"/ɪŋ/","extraExplanation":["“ings”本身不太常作为独立常用词出现。日常英语里你更常见到的是“-ing”作为词尾（后缀），比如 playing, working。","“-ing”有两大核心功能：①现在分词（配合 be 动词构成进行时：is/are/am + V-ing）；②动名词（把动作当“事情/活动”来讲：V-ing 作主语或宾语）。","拼写规则小提醒：以不发音的 e 结尾常去 e 再加 -ing（make → making）；“辅元辅”且重读时常双写末尾辅音再加 -ing（run → running）。"]}
{"word":"inguen","summary":{"en":"Ingénue means an innocent, naïve young woman—especially a typical character type in theater or film.","zh":"Ingénue 指“天真少女”（尤其是戏剧/电影中的典型角色类型），也可泛指显得纯真、缺乏经验的年轻女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Theater, film) a young, innocent, and often naïve female character; by extension, a person (usually a young woman) who seems innocent and inexperienced.","zh":"（戏剧/电影）“天真少女”型角色：年轻、纯真、常带点不谙世事的女性角色；引申为看起来天真、缺乏经验的人（多指年轻女性）。"},"examples":[{"en":"She was cast as the ingénue in the romantic comedy.","zh":"她在那部浪漫喜剧里被选来演“天真少女”角色。"},{"en":"He thought she was an ingénue, but she was far more perceptive than he expected.","zh":"他以为她很天真不懂世事，但她比他想的更敏锐。"}]}],"synonyms":["naïve young woman","innocent","girl-next-door (type)","naïf (similar term)"],"phonetic":"/ˈænʒənuː/","extraExplanation":["“inguen”常见为拼写错误，更标准的拼写是 ingénue（英文中常保留法语重音符号，也可写作 ingenue）。","词源来自法语 ingénu/ingénue，原意接近“天真、坦率、未经世事”。在英语里主要用于戏剧、电影的角色类型（typecasting）讨论，有时带一点“刻板印象/男性凝视”的文化语境，使用时注意语气和场合。"]}
{"word":"inguilty","summary":{"en":"Guilty means responsible for a wrongdoing (especially a crime) or feeling regret/shame about doing something wrong.","zh":"guilty 指“有罪的/犯错的”，也指“感到内疚、后悔的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having done something wrong or illegal; responsible for a crime or bad action","zh":"有罪的；犯了错或违法的；对不良行为负有责任的"},"examples":[{"en":"He felt guilty after lying to his friend.","zh":"他对朋友撒谎后感到内疚。"},{"en":"The jury found her guilty of theft.","zh":"陪审团裁定她盗窃罪成立。"}]},{"partOfSpeech":"adj.","definition":{"en":"feeling regret or shame because you think you did something wrong","zh":"内疚的；因认为自己做错事而感到后悔或羞愧的"},"examples":[{"en":"I’m guilty about not calling my parents more often.","zh":"我因为没常给父母打电话而感到内疚。"},{"en":"Don’t try to make me feel guilty for saying no.","zh":"别因为我拒绝就想让我产生愧疚感。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing that someone feels regret or is hiding something (often about their face or behavior)","zh":"（神情或举止）显得心虚的；带着愧疚感的"},"examples":[{"en":"He gave a guilty look and quickly changed the subject.","zh":"他露出心虚的表情，赶紧换了话题。"}]}],"synonyms":["culpable","responsible","at fault","ashamed","remorseful"],"phonetic":"/ˈɡɪlti/","extraExplanation":["“inguilty”不是常见英语单词。你可能想查的是 **guilty**（有罪的/内疚的），或法律用语 **not guilty**（无罪/不认罪）。","常见搭配：**guilty of + 名词/动名词**（犯……罪/做了……错事）；**feel guilty (about/for...)**（为……感到内疚）；**guilty pleasure**（“罪恶感的小享受”，指明知不太健康/不太体面但仍喜欢的事）。"]}
{"word":"inguinal","summary":{"en":"Inguinal means “related to the groin,” and is most often used in medical contexts.","zh":"inguinal 意为“腹股沟的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the groin (the area where the lower abdomen meets the thigh).","zh":"腹股沟的；与腹股沟（下腹部与大腿交界处）有关的。"},"examples":[{"en":"The doctor examined the patient for inguinal pain.","zh":"医生检查了病人的腹股沟疼痛。"},{"en":"An inguinal hernia can cause a bulge in the groin area.","zh":"腹股沟疝可能会导致腹股沟部位出现隆起。"}]}],"synonyms":["groin (informal/common word)","groin-related (descriptive)"],"phonetic":"/ˈɪŋɡwənəl/","extraExplanation":["“inguinal”常见于医学语境，搭配很固定，如：inguinal hernia（腹股沟疝）、inguinal canal（腹股沟管）、inguinal lymph nodes（腹股沟淋巴结）。","词源来自拉丁语 inguen（腹股沟）。日常英语里更常说 groin（腹股沟），而不是 inguinal。"]}
{"word":"inguinal-scrotal","summary":{"en":"Related to both the groin and the scrotum.","zh":"与腹股沟和阴囊两处相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the groin (inguinal region) and the scrotum; involving both areas (often used to describe swelling, hernias, or surgery).","zh":"与腹股沟（腹股沟区）和阴囊有关的；涉及这两个部位的（常用于描述肿胀、疝气或手术等）。"},"examples":[{"en":"The doctor noted an inguinal-scrotal swelling on the right side.","zh":"医生记录到右侧有腹股沟—阴囊部位的肿胀。"},{"en":"An inguinal-scrotal hernia may extend from the groin down into the scrotum.","zh":"腹股沟—阴囊疝可能从腹股沟向下延伸进入阴囊。"}]}],"synonyms":["inguinoscrotal","groin-scrotal"],"phonetic":"/ˈɪŋɡwə-nəl ˈskroʊt̬əl/","extraExplanation":["这是医学/解剖学用语，常见于体检记录、影像学报告和外科（尤其疝气）描述中。日常英语中很少用。","写法上也可能见到不带连字符的 inguinoscrotal；意思相同，都是“腹股沟与阴囊相关的”。"],"etymology":"由两个解剖学词组成：inguinal（源自拉丁语 inguen，意为“腹股沟”）+ scrotal（源自拉丁语 scrotum，指“阴囊”）。连字符表示“同时涉及两处区域”。","mnemonic":["把它拆开记：inguinal = “腹股沟”，scrotal = “阴囊”；中间的连字符表示“连接/同时涉及”。"]}
{"word":"inguino","summary":{"en":"inguino- is a medical word part meaning “related to the groin.”","zh":"inguino- 是医学构词成分，表示“与腹股沟有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(combining form, medical) relating to the groin (the area where the abdomen meets the upper thigh). Often used before another word, as in “inguinofemoral.”","zh":"（构词成分/医学）表示“腹股沟的、与腹股沟有关的”（腹部与大腿上部交界处）。常放在词前组成复合词，如“inguinofemoral（腹股沟-股骨的）”。"},"examples":[{"en":"The report mentions an inguinofemoral lymph node.","zh":"报告中提到了一个腹股沟-股骨区的淋巴结。"},{"en":"Inguino- is a medical combining form that refers to the groin area.","zh":"inguino- 是一个医学构词成分，指腹股沟区域。"}]}],"synonyms":["groin","inguinal","inguinofemoral"],"phonetic":"/ˈɪŋɡwɪnoʊ/","extraExplanation":["“inguino-”来自拉丁语词根 *inguen*（腹股沟）。在英语里它通常不是一个独立单词，而是出现在医学/解剖学术语中。","日常英语更常用的词是 **groin**（腹股沟）以及形容词 **inguinal**（腹股沟的）。例如：inguinal hernia（腹股沟疝）。","如果你想查的是意大利语/西班牙语里的“inguino”，告诉我上下文或句子，我也可以帮你对应到最合适的英语词。"]}
{"word":"inguinoabdominal","summary":{"en":"An adjective meaning “related to the groin and the abdomen.”","zh":"形容词：指“与腹股沟和腹部相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the groin (inguinal region) and the abdomen.","zh":"与腹股沟（腹股沟区）和腹部两者有关的；腹股沟-腹部的。"},"examples":[{"en":"The surgeon examined the inguinoabdominal area for signs of swelling.","zh":"外科医生检查了腹股沟-腹部区域是否有肿胀迹象。"},{"en":"Pain radiating from the groin to the lower belly can be described as inguinoabdominal pain.","zh":"从腹股沟放射到下腹的疼痛可以描述为腹股沟-腹部疼痛。"}]}],"synonyms":["inguinal and abdominal","groin-and-abdominal"],"phonetic":"/ˌɪŋɡwaɪnoʊæbˈdɑmənəl/","extraExplanation":["这是医学/解剖学用词，常见写法也会用连字符：inguino-abdominal，用来强调“腹股沟（inguinal）+腹部（abdominal）”两个区域一起涉及。","inguinal 来自拉丁语 inguen（腹股沟）；abdominal 与 abdomen（腹部）相关。多用于病历记录、体格检查描述或手术/疼痛定位。"]}
{"word":"inguinocrural","summary":{"en":"A medical adjective meaning “of the groin and thigh,” especially their junction.","zh":"医学形容词，指“与腹股沟和大腿（股部）相关”，尤指两者交界处。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the groin (inguinal area) and the thigh (crural area), especially the region where they meet.","zh":"与腹股沟（腹股沟区）和大腿（股部）有关的，尤指两者交界处的区域。"},"examples":[{"en":"The doctor examined the inguinocrural region for swelling.","zh":"医生检查了腹股沟-股部（腹股沟与大腿交界处）是否有肿胀。"},{"en":"A rash appeared along the inguinocrural fold after the hike.","zh":"徒步后，皮疹出现在腹股沟-股部皱襞处。"}]}],"synonyms":["inguinofemoral","inguinal and crural"],"phonetic":"/ɪŋˌɡwaɪnoʊˈkrʊrəl/","extraExplanation":["该词多见于解剖学、皮肤科或外科的书面语中，日常英语里不常用。常见搭配有 inguinocrural region（腹股沟-股部区域）和 inguinocrural fold（腹股沟-股部皱襞）。","词源结构：inguino- 表示“腹股沟”，-crural 表示“股/腿”（源自拉丁语 cruris，意为“腿”）。看到这类复合词时，通常可以通过词根直接推测解剖位置。"]}
{"word":"inguinocutaneous","summary":{"en":"A medical adjective meaning “related to the groin and the skin.”","zh":"医学形容词，表示“与腹股沟及皮肤有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the groin (inguinal area) and the skin (cutaneous).","zh":"与腹股沟（inguinal）和皮肤（cutaneous）有关的；腹股沟皮肤的。"},"examples":[{"en":"The doctor examined the inguinocutaneous region for signs of infection.","zh":"医生检查了腹股沟皮肤区域是否有感染迹象。"},{"en":"An inguinocutaneous rash can be caused by friction, sweat, or fungal infection.","zh":"腹股沟皮肤的皮疹可能由摩擦、出汗或真菌感染引起。"}]}],"synonyms":["inguinal and cutaneous","groin-skin (informal)"],"phonetic":"/ˌɪŋɡwənoʊ kjuːˈteɪniəs/","extraExplanation":["这是医学/解剖学用词，由两部分构成：inguino-（指腹股沟/腹股沟区）+ cutaneous（皮肤的）。多用于描述部位、症状或手术相关结构，而不是日常英语。","在临床语境中，腹股沟皮肤问题常见原因包括：摩擦导致的刺激、潮湿闷热引发的间擦疹、真菌感染（如股癣 tinea cruris）等；若出现持续疼痛、肿块、渗液或发热，应及时就医。"]}
{"word":"inguinodynia","summary":{"en":"Inguinodynia is a medical term meaning pain in the groin.","zh":"inguinodynia 是医学术语，意思是腹股沟疼痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pain in the groin (the area where the thigh meets the lower abdomen).","zh":"腹股沟疼痛（大腿与下腹交界处的疼痛）。"},"examples":[{"en":"After the surgery, he reported inguinodynia on the right side.","zh":"手术后，他说右侧出现了腹股沟疼痛。"},{"en":"The doctor asked whether the inguinodynia got worse when she coughed or lifted heavy objects.","zh":"医生询问她咳嗽或搬重物时腹股沟疼痛是否会加重。"}]}],"synonyms":["groin pain","inguinal pain"],"phonetic":"/ɪnˌɡwaɪ.noʊˈdɪn.i.ə/","extraExplanation":["这是医学用语：inguino- 表示“腹股沟”，-dynia 表示“疼痛”（同源于表示疼痛的词根）。日常英语里更常说 groin pain。常见相关情况包括：腹股沟疝（hernia）、肌肉拉伤、淋巴结肿大、髋关节问题或术后慢性疼痛等。若疼痛持续、加重，或伴随肿块、发热、恶心等症状，应尽快就医。"]}
{"word":"inguinofemoral","summary":{"en":"related to the groin and thigh region","zh":"与腹股沟及大腿交界区域相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the groin (inguinal region) and the thigh (femoral region), especially the area where they meet.","zh":"与腹股沟（腹股沟区）和大腿（股区）有关的，尤指两者相接的部位。"},"examples":[{"en":"The surgeon examined the inguinofemoral region for swelling.","zh":"外科医生检查了腹股沟—股部区域是否有肿胀。"},{"en":"Inguinofemoral lymph nodes can become tender during infection.","zh":"感染时，腹股沟—股部淋巴结可能出现压痛。"}]}],"synonyms":["groin-thigh","inguinal-femoral","groin and thigh"],"phonetic":"/ˌɪŋɡwɪnoʊˈfɛmərəl/","extraExplanation":["这是较专业的医学/解剖学用语，常见于“inguinofemoral lymph nodes（腹股沟—股部淋巴结）”“inguinofemoral crease（腹股沟—股部皱褶/沟）”等搭配中。日常英语更常用 groin（腹股沟）与 thigh（大腿）来表达。"],"etymology":"由拉丁语词根组合而成：inguin-（腹股沟，源自拉丁语 inguen“腹股沟”）+ femoral（股的/大腿的，源自拉丁语 femur“股骨/大腿”）。属于医学解剖学复合形容词。","mnemonic":["把它拆开记：inguin-≈“in groin”（腹股沟）+ femoral≈“femur”（股骨/大腿）→“腹股沟+大腿相关”。","联想中文：腹股沟（“阴沟”谐音提示 inguin-）+ 股（femur/ femoral）→ 腹股沟—股部。"]}
{"word":"inguinogenital","summary":{"en":"connected with the groin and genital organs","zh":"与腹股沟及生殖器相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the groin and the genital (reproductive) organs.","zh":"与腹股沟及生殖器（生殖器官）有关的。"},"examples":[{"en":"The doctor examined the inguinogenital area for swelling and pain.","zh":"医生检查了腹股沟-生殖器区域是否有肿胀和疼痛。"},{"en":"Some infections can spread to inguinogenital tissues.","zh":"某些感染可能扩散到腹股沟-生殖器组织。"}]}],"synonyms":["inguinal-genital","genital","inguinal"],"phonetic":"/ˌɪŋɡwɪnoʊˈdʒɛnɪtəl/","extraExplanation":["这是医学/解剖学用语，常用于描述一个“区域”或“结构/症状”的范围（腹股沟到外生殖器附近）。在日常英语中很少使用，更多见于临床记录、解剖描述或学术文章中。"],"etymology":"源自拉丁语词根组合：inguino- 来自 inguen（腹股沟），genital 来自 genus / genitalis（生殖的）。合起来表示“腹股沟与生殖器相关的”。","mnemonic":["把它拆开记：inguino- ≈ inguinal（腹股沟的） + genital（生殖的）→ “腹股沟+生殖器”。","联想中文：看到 “-genital” 就想到“生殖器”；前面的 “inguino-” 形似 inguinal（腹股沟），两段一拼就明白。"]}
{"word":"inguinolabial","summary":{"en":"A medical adjective meaning “connected to the groin and the labia.”","zh":"医学形容词，指“与腹股沟和阴唇相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the groin (inguinal area) and the labia (the external folds of the vulva).","zh":"与腹股沟（腹股沟区）和阴唇（外阴的皮肤皱襞）有关的。"},"examples":[{"en":"The clinician noted mild swelling in the inguinolabial region.","zh":"临床医生记录到腹股沟—阴唇区有轻度肿胀。"},{"en":"Pain can sometimes be felt along the inguinolabial fold.","zh":"疼痛有时会沿着腹股沟—阴唇褶皱出现。"}]}],"synonyms":["inguinovulvar","groin-and-labia (informal paraphrase)"],"phonetic":"/ˌɪŋɡwənoʊˈleɪbiəl/","extraExplanation":["这是医学/解剖学用语，常见于妇科、泌尿外科、影像学或体格检查记录中；日常英语里很少使用。","词源可拆解理解：inguino-（来自 inguinal，意为“腹股沟的”）+ labial（意为“阴唇的/唇状的”）。","涉及私密部位的术语在临床语境中是中性、专业的表达；在非医疗场合使用时要注意场合与对方感受。"]}
{"word":"inguinoscrotal","summary":{"en":"A medical adjective meaning “involving the groin and the scrotum.”","zh":"医学形容词，表示“涉及腹股沟和阴囊的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the groin (inguinal region) and the scrotum, especially describing an area, swelling, or hernia that extends from the groin down into the scrotum.","zh":"与腹股沟（腹股沟区）和阴囊有关的；尤指描述从腹股沟延伸到阴囊的部位、肿胀或疝。"},"examples":[{"en":"The doctor noted an inguinoscrotal swelling on the right side.","zh":"医生记录到右侧有腹股沟—阴囊部位的肿胀。"},{"en":"An inguinoscrotal hernia may cause a bulge that becomes more noticeable when standing or coughing.","zh":"腹股沟—阴囊疝可能导致鼓包，在站立或咳嗽时更明显。"}]}],"synonyms":["inguinal-scrotal","inguinal and scrotal"],"phonetic":"/ˌɪŋɡwənoʊˈskroʊtəl/","extraExplanation":["这是医学/解剖学术语，常见于体检记录、超声/CT报告或外科讨论中，不太用于日常英语。","词由两部分构成：inguino-（与腹股沟有关）+ scrotal（与阴囊有关）。常搭配：inguinoscrotal hernia（腹股沟—阴囊疝）、inguinoscrotal swelling（腹股沟—阴囊肿胀）、inguinoscrotal mass（腹股沟—阴囊肿块）。"]}
{"word":"inguinovulvar","summary":{"en":"related to the groin and the vulva","zh":"与腹股沟及外阴相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the groin (inguinal area) and the vulva; used especially in medical contexts (e.g., describing skin conditions, lymph nodes, or pain in that region).","zh":"与腹股沟（腹股沟区）和外阴两者相关的；多用于医学语境（如描述该区域的皮肤问题、淋巴结或疼痛）。"},"examples":[{"en":"The doctor examined the inguinovulvar area for signs of infection.","zh":"医生检查了腹股沟—外阴区域是否有感染迹象。"},{"en":"She reported inguinovulvar discomfort after the surgery.","zh":"她表示术后出现腹股沟—外阴部位不适。"}]}],"synonyms":["inguinal-vulvar","groin-vulvar"],"phonetic":"/ˌɪŋɡwənoʊˈvʌlvɚ/","extraExplanation":["这是非常专业的医学形容词，日常英语中几乎不会用到。常见于病历、解剖学描述或检查记录中。","构词上属于“部位A + 部位B”的组合，用来精确标注涉及的解剖区域。类似结构还有例如 cervicofacial（颈部-面部的）。"],"etymology":"医学复合词：inguino- 来自 inguinal（腹股沟的，源自拉丁语 inguen“腹股沟”）+ vulvar（外阴的，源自拉丁语 vulva“外阴/子宫”）。合起来表示“腹股沟与外阴相关”。","mnemonic":["拆开记：inguino-≈“腹股沟”（联想“in-groin”虽然不严格但好记）+ vulvar=“外阴”。两部分合起来就是“腹股沟+外阴”。","把它当作地图定位词：看到两个部位连在一起，就理解为“跨两个区域/同时涉及两个区域”。"]}
{"word":"inguklimiut","summary":{"en":"Inguklimiut appears to be an Inuit-language place-based group name; “-miut” means “people of a place.”","zh":"Inguklimiut 看起来是因纽特语中按地名形成的族群/居民称呼；“-miut”表示“某地的人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(In Inuit languages, especially Inuktitut) a group of people identified by place of origin; likely meaning “the people of Ingukli-/Inukli- (a place name).”","zh":"（因纽特语言，尤指因纽特语 Inuktitut）按居住地/出身地命名的一群人；大意可能是“来自 Ingukli-/Inukli-（某地名）的人们”。"},"examples":[{"en":"In some Inuit community names, the ending “-miut” means “people of a place.”","zh":"在一些因纽特社区/族群名称中，词尾“-miut”表示“某地的人”。"},{"en":"Depending on the region, the spelling of a -miut name may vary in English letters.","zh":"因地区不同，用拉丁字母拼写的“-miut”名称可能会有不同写法。"}]}],"synonyms":["-miut (suffix usage)","people of (a place)"],"phonetic":"/ɪˌnuːkliˈmiːut/","extraExplanation":["这个词看起来像是因纽特语（Inuktitut）里常见的构词：**-miut** 表示“某地的人/居民”（相当于英语的 “people of …”）。前半部分通常是一个地名或地理称呼，因此 **Inguklimiut** 很可能是“某个叫 Ingukli-/Inukli- 的地方的人”。\n\n不过，**Inguklimiut** 这个具体拼写我无法在常见英语词典中直接对应到一个固定条目，可能是：\n1）特定地区的转写/拼写变体；\n2）人名、社群名、家族/项目名；\n3）你想查的词有拼写误差（例如 Inuklimiut / -miut 结构的其他词）。\n\n如果你能告诉我它出现的语境（书名/文章/一句话）或是否有大写（Inguklimiut vs inguklimiut），我可以更准确地解释。"]}
{"word":"ingulf","summary":{"en":"“Ingulf” is usually a misspelling of “engulf,” meaning to surround or swallow completely.","zh":"“ingulf” 通常是 “engulf” 的误拼，意思是“完全包围或吞没”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually spelled “engulf”) to cover, surround, or swallow something completely, often quickly.","zh":"（常写作 engufl）完全覆盖、包围或吞没某物，常带有“迅速、彻底”的感觉。"},"examples":[{"en":"Within minutes, smoke engulfed the entire room.","zh":"几分钟之内，浓烟就吞没了整个房间。"},{"en":"A huge wave engulfed the small boat.","zh":"一阵巨浪吞没了那条小船。"},{"en":"She was engulfed in sadness after the news.","zh":"听到这个消息后，她陷入了悲伤之中。"}]}],"synonyms":["swallow","overwhelm","consume","surround","submerge"],"phonetic":"/ɪnˈɡʌlf/","extraExplanation":["“ingulf” 通常被认为是拼写错误；标准拼写是 **engulf**。","**engulf** 常用于描述自然力量（火、烟、水）或强烈情绪/状态（fear, sadness）“把人包围住”，比普通的 cover 更强调“彻底吞没”的画面感。","词源上与“gulp（大口吞咽）”有关，因此带有“吞下去”的形象。"]}
{"word":"ingulfed","summary":{"en":"“Engulfed” means completely swallowed up or surrounded; it is the past form of “engulf.”","zh":"“engulfed”表示“被完全吞没/包围”，是“engulf”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of something large or powerful) to swallow up, cover, or take in completely.","zh":"（多指强大或范围很大的事物）吞没；淹没；完全包围或席卷。"},"examples":[{"en":"The waves engulfed the small boat in seconds.","zh":"海浪在几秒钟内吞没了小船。"},{"en":"A thick fog engulfed the city, making it hard to see.","zh":"浓雾笼罩了整座城市，几乎看不清路。"},{"en":"She felt engulfed by sadness after the news.","zh":"听到这个消息后，她感到悲伤将自己彻底淹没。"}]},{"partOfSpeech":"other","definition":{"en":"(past tense/past participle) of “engulf.”","zh":"“engulf”的过去式/过去分词形式。"},"examples":[{"en":"The fire spread quickly and engulfed the building.","zh":"火势迅速蔓延，吞没了整栋大楼。"},{"en":"By the time we arrived, the storm had engulfed the entire coastline.","zh":"我们到达时，风暴已经席卷了整段海岸线。"}]}],"synonyms":["swallowed up","consumed","overwhelmed","surrounded","enveloped"],"phonetic":"/ɪnˈɡʌlft/","extraExplanation":["“engulf”常用于自然灾害或强烈情绪等语境，带有“突然、彻底、难以抵抗”的感觉。比“cover”更强调被完全吞没、无处可逃。","常见搭配：engulfed in flames（被烈焰吞没）、engulfed by smoke/fog（被烟/雾笼罩）、engulfed by fear/sorrow（被恐惧/悲伤淹没）。"]}
{"word":"ingulfing","summary":{"en":"“Engulfing” means completely surrounding or overwhelming; it’s the -ing form of “engulf.”","zh":"“Engulfing”表示“吞没、完全包围、压倒性地淹没”，是动词“engulf”的-ing形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something large or strong) surrounding, covering, or swallowing something completely; overwhelming.","zh":"（力量或规模很大）把……完全包围、吞没；（情绪/局面）压倒性的。"},"examples":[{"en":"A thick, engulfing fog covered the road.","zh":"浓重的吞没式大雾笼罩了道路。"},{"en":"She felt an engulfing sense of panic.","zh":"她感到一阵压倒性的恐慌。"},{"en":"The flames were engulfing the building within minutes.","zh":"几分钟内火焰就吞没了整栋楼。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “engulf”: to surround and cover completely; to swallow up.","zh":"“engulf”的现在分词：吞没；包围并覆盖；使被卷入/淹没。"},"examples":[{"en":"Water is engulfing the lower floors after the storm.","zh":"暴风雨后，水正淹没较低的楼层。"},{"en":"Social media can be engulfing if you don’t set limits.","zh":"如果不设限，社交媒体会让人很“被淹没”。"}]}],"synonyms":["overwhelming","all-consuming","smothering","swallowing","enveloping"],"phonetic":"/ɪnˈɡʌlfɪŋ/","extraExplanation":["你写的“ingulfing”常见于拼写错误；标准拼写是 **engulfing**（e-n-g-u-l-f-i-n-g）。","“engulf”常用于比喻：不仅是“火/水/雾吞没”，也可指“情绪、工作、压力把人淹没”。","在金融K线里有术语 **engulfing pattern（吞没形态）**，如 bullish engulfing（看涨吞没）/ bearish engulfing（看跌吞没），表示一根K线“包住/吞没”前一根的实体。"]}
{"word":"ingulfment","summary":{"en":"Engulfment means the act of being completely surrounded and covered, literally (by water, fire, etc.) or figuratively (by emotion or pressure).","zh":"Engulfment 指“被完全包围并吞没”的过程，可指真实的水火烟等，也可指情绪或压力等抽象事物的“压倒性袭来”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of surrounding and covering something completely; being swallowed up or overwhelmed","zh":"吞没；包围并完全覆盖；（比喻）被淹没/压倒的过程"},"examples":[{"en":"The engulfment of the small boat by the wave happened in seconds.","zh":"小船被巨浪吞没只发生在几秒钟内。"},{"en":"She described the engulfment of grief after the loss.","zh":"她形容失去之后悲伤像潮水般将人吞没。"}]}],"synonyms":["swallowing up","overwhelming","submergence","immersion","inundation"],"phonetic":"/ɪnˈɡʌlfmənt/","extraExplanation":["“Engulfment”来自动词“engulf”（吞没、席卷、使陷入），常用于描述自然力量（火、洪水、海浪、烟雾）把某物完全包住，也常用于抽象意义（恐惧、悲伤、工作压力）“压得人喘不过气”。","近义表达在写作中常见：the wave’s engulfment / engulfed by flames / overwhelmed by emotion（更口语、更常用）。"]}
{"word":"ingulfs","summary":{"en":"“Ingulfs” is usually a misspelling of “engulfs,” meaning to completely cover something or to overwhelm someone with a feeling or situation.","zh":"“ingulfs”通常是“engulfs”的误拼，意思是“吞没/完全覆盖”，也可指“使（情绪或处境）淹没、压倒”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cover or surround something completely, as if swallowing it","zh":"吞没；包围；完全覆盖（好像把它“吞下去”）"},"examples":[{"en":"A huge wave engulfed the boat within seconds.","zh":"巨浪在几秒内就吞没了那条船。"},{"en":"Smoke quickly engulfed the room after the fire started.","zh":"火灾发生后，烟雾迅速笼罩了整个房间。"}]},{"partOfSpeech":"v.","definition":{"en":"to involve someone deeply in a strong feeling or situation","zh":"使深陷（某种强烈情绪或处境）；使卷入"},"examples":[{"en":"She was engulfed by grief after hearing the news.","zh":"听到消息后，她被悲痛淹没。"},{"en":"The project soon engulfed his entire weekend.","zh":"这个项目很快占据了他整个周末。"}]}],"synonyms":["swallow up","overwhelm","consume","surround","cover"],"phonetic":"/ɛnˈɡʌlfs/","extraExplanation":["“ingulfs”常见是动词“engulf”的第三人称单数（he/she/it engulfs）。拼写以 e 开头：engulf，而不是 *ingulf。","词源上，“engulf”与“gulf（海湾、深渊）”相关，画面感是“把东西拖进深处/深渊里”，因此常与海浪、火焰、烟雾等搭配，也常用于比喻情绪。"]}
{"word":"ingurgitate","summary":{"en":"Ingurgitate is a rare verb meaning to swallow or gulp down something greedily or in large amounts.","zh":"ingurgitate 是一个很少见的动词，意思是狼吞虎咽地吞下或大量吞咽。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To swallow something greedily or in large amounts; to gulp down.","zh":"（罕见）狼吞虎咽地吞下；大量吞食；大口吞咽。"},"examples":[{"en":"After the hike, he ingurgitated a whole bottle of water in seconds.","zh":"徒步后，他几秒钟就把一整瓶水咕咚咕咚喝完了。"},{"en":"The dog ingurgitated its food so fast that it started coughing.","zh":"那只狗吃得太快，结果呛得咳嗽起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Technical/medical, rare) To cause something (such as fluid) to be swallowed or taken in.","zh":"（技术/医学用语，罕见）使（液体等）被吞入；使摄入。"},"examples":[{"en":"The nurse helped the patient ingurgitate the liquid medicine.","zh":"护士帮助病人把液体药吞下去。"}]}],"synonyms":["gulp","guzzle","devour","swallow","down"],"phonetic":"/ɪnˈɡɝdʒəˌteɪt/","extraExplanation":["这个词在现代英语里非常少见，日常更常用的说法是 gulp down（大口吞下）、guzzle（猛喝）、devour（狼吞虎咽地吃）、swallow greedily（贪婪地吞咽）。","词源上与拉丁语 gurges（“漩涡、深渊；吞噬之处”）有关，因此带有“被卷进去般地吞下”的意象；不过在当代写作中可能显得过于生僻或刻意。"]}
{"word":"ingurgitated","summary":{"en":"Ingurgitated means “swallowed/ate greedily” (and less commonly, “absorbed in large amounts”). It’s rare and often sounds formal or humorous.","zh":"ingurgitated 表示“狼吞虎咽地吞下/吃下”，较少见也可指“大量吸收（信息等）”。该词少用，语气常显得正式或带幽默夸张。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(formal or humorous) Swallowed or ate something quickly and greedily; gulped down.","zh":"（正式或带幽默感）狼吞虎咽地吞下；大口吃下。"},"examples":[{"en":"He ingurgitated the sandwich in two bites and rushed out the door.","zh":"他两口就把三明治狼吞虎咽地吞下，然后冲出门。"},{"en":"After the hike, we ingurgitated hot soup like we hadn’t eaten all day.","zh":"徒步之后，我们像一整天没吃东西一样把热汤大口喝下。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, less common) Took in or absorbed something in large amounts, often without careful thought.","zh":"（比喻，较少见）大量吸收/接受（信息等），常带有“不加思考地塞进脑子里”的意味。"},"examples":[{"en":"Some students ingurgitated facts for the test but forgot them a week later.","zh":"有些学生为了考试把知识点硬背下去，但一周后就忘了。"},{"en":"He ingurgitated online opinions without checking sources.","zh":"他不核实来源就把网上的观点照单全收。"}]}],"synonyms":["gulped down","devoured","wolfed down","gobbled up","swallowed","ingested"],"phonetic":"ɪnˈɡɝːdʒɪˌteɪtɪd","extraExplanation":["“ingurgitated”是动词“ingurgitate”的过去式/过去分词，日常英语里非常少见，常见替代词有：gulped down, devoured, wolfed down（狼吞虎咽）。","词源可追溯到拉丁语：in-（进入）+ gurges（喉咙/咽喉、漩涡之意延伸为“吞入”），因此这个词常带一种“往喉咙里猛塞”的画面感，写作时可用于夸张或讽刺语气。","在较正式或旧式文本中偶尔见到；现代口语与写作通常不用，除非你刻意追求幽默、戏谑或“古典/学术腔”的效果。"]}
{"word":"ingurgitating","summary":{"en":"“Ingurgitating” means eating/drinking greedily (or, figuratively, taking in too much without thinking). It’s a rare, formal-sounding word.","zh":"“ingurgitating”指狼吞虎咽地吃喝；也可比喻不加筛选地大量吸收信息等。这个词较少见，偏书面、常带夸张或批评语气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “ingurgitate”) eating or drinking something quickly and in large amounts; swallowing greedily.","zh":"（“ingurgitate”的现在分词）狼吞虎咽地吃或喝；贪婪地吞咽。"},"examples":[{"en":"He sat on the couch, ingurgitating chips while watching TV.","zh":"他坐在沙发上看电视，一边狼吞虎咽地吃薯片。"},{"en":"The tourists were ingurgitating street food as if they hadn’t eaten all day.","zh":"游客们像一整天没吃过饭一样，大口大口地吃着街头小吃。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative, often critical) taking in something in an excessive, unselective way, such as information or media.","zh":"（比喻义，常带批评）过量、缺乏筛选地“摄入”信息、媒体等。"},"examples":[{"en":"She was ingurgitating online advice, but none of it was tailored to her situation.","zh":"她把网上的建议一股脑儿都“吞”下去了，但没有一条真正适合她的情况。"}]}],"synonyms":["gobbling","scarfing","devouring","wolfing down","gulping"],"phonetic":"/ɪnˈɡɝːdʒəˌteɪtɪŋ/","extraExplanation":["“ingurgitate”在现代英语里很少见，语气通常偏正式或带一点讽刺/幽默，常用来强调“吃得很猛、很贪”。日常口语里更常说：gobble (down), scarf (down), devour。","词源来自拉丁语，含有“吞入喉咙/咽下去”的意思。因为词形比较“书面”，写作中用它往往是在刻意营造夸张或批评的效果。"]}
{"word":"ingurgitation","summary":{"en":"Ingurgitation is a noun meaning greedy swallowing or taking in a lot (sometimes humorous or formal).","zh":"Ingurgitation 是名词，指狼吞虎咽或大量摄入（常见于幽默或较正式的语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of swallowing or taking something in greedily (often used humorously or in formal/literary writing).","zh":"狼吞虎咽地吞下；贪婪地摄入（常带幽默或较正式/文学的语气）。"},"examples":[{"en":"His ingurgitation of the buffet dinner shocked everyone at the table.","zh":"他在自助餐前狼吞虎咽的样子把同桌的人都看惊了。"},{"en":"The novel describes the character’s ingurgitation as a sign of stress and emptiness.","zh":"小说把角色的暴食描写成压力与空虚的表现。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of pouring, stuffing, or filling something up, especially in a way that feels excessive (rare).","zh":"（罕见）倒入、塞入或填满；尤其指过量地灌入/填充。"},"examples":[{"en":"The ingurgitation of coal into the furnace was nonstop during the storm.","zh":"暴风雪期间，煤被不停地灌进炉膛。"}]}],"synonyms":["gobbling","guzzling","devouring","wolfing down","gluttony"],"phonetic":"/ɪnˌɡɝːdʒəˈteɪʃən/","extraExplanation":["词源上来自拉丁语 *gurgit-*（“喉咙、咽喉、吞咽”相关）与前缀 *in-*（“向内”）。因此它常见于较书面、讽刺或夸张的语境，用来强调“吞得很多、吞得猛”。","常见近义表达（更自然、更常用）有：*gobbling*, *guzzling*, *wolfing down*, *devouring*。在日常英语里，人们一般不会说 *ingurgitation*，而会用这些更口语的词。"]}
{"word":"ingush","summary":{"en":"Ingush refers to the Ingush people, their language, or anything related to their culture in the North Caucasus (Ingushetia).","zh":"Ingush 指印古什人、印古什语，或与北高加索地区（印古什共和国）印古什文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of the Ingush people, a North Caucasian ethnic group mainly from Ingushetia (in the Russian Federation).","zh":"印古什人：主要来自俄罗斯联邦印古什共和国（北高加索地区）的一个民族的成员。"},"examples":[{"en":"Many Ingush families have strong traditions of hospitality.","zh":"许多印古什家庭有着重视待客之道的传统。"},{"en":"An Ingush elder told stories about village life in the mountains.","zh":"一位印古什长者讲述了山中村落的生活故事。"}]},{"partOfSpeech":"n.","definition":{"en":"The Ingush language, a Northeast Caucasian language spoken chiefly in Ingushetia and nearby areas.","zh":"印古什语：一种东北高加索语系的语言，主要在印古什共和国及周边地区使用。"},"examples":[{"en":"She can speak Ingush and Russian.","zh":"她会说印古什语和俄语。"},{"en":"The book includes basic phrases in Ingush.","zh":"这本书收录了印古什语的基础短语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Ingush people, their language, or their culture.","zh":"印古什的：与印古什民族、印古什语或其文化相关的。"},"examples":[{"en":"Ingush music often features distinctive rhythms.","zh":"印古什音乐常有独特的节奏。"},{"en":"They served traditional Ingush dishes at the festival.","zh":"他们在节日上提供了传统的印古什菜肴。"}]}],"synonyms":["Ingushetian (less common)"],"phonetic":"ɪnˈɡʊʃ","extraExplanation":["“Ingush”常用作名词（指人或语言）和形容词（指与其文化相关）。在英语新闻或学术写作中，你可能会看到“Ingush Republic / Ingushetia（印古什共和国）”“Ingush language（印古什语）”等搭配。","“Ingush”也可能出现在讨论北高加索历史、族群与语言的语境中；属于较专门的地理与民族名称，日常口语中不算常见。"]}
{"word":"Ingushetian","summary":{"en":"connected with Ingushetia or the Ingush people (and sometimes their language)","zh":"与印古什共和国或印古什人相关（有时也指其语言）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Ingushetia (a republic in the North Caucasus region of Russia), or to its people, culture, or institutions","zh":"与印古什共和国（俄罗斯北高加索地区）有关的；与当地人民、文化或机构有关的"},"examples":[{"en":"She is researching Ingushetian history in the North Caucasus.","zh":"她正在研究北高加索地区的印古什历史。"},{"en":"The museum has a small collection of Ingushetian traditional clothing.","zh":"这家博物馆收藏了一小部分印古什传统服饰。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Ingushetia; an Ingush person","zh":"印古什共和国的人；印古什人"},"examples":[{"en":"Several Ingushetians in the diaspora organized a cultural festival.","zh":"一些海外的印古什人组织了一场文化节。"}]},{"partOfSpeech":"n.","definition":{"en":"the Ingush language (a Northeast Caucasian language)","zh":"印古什语（东北高加索语系的一种语言）"},"examples":[{"en":"He can speak Ingushetian and Russian.","zh":"他会说印古什语和俄语。"}]}],"synonyms":["Ingush"],"phonetic":"/ˌɪŋɡʊˈʃiːʃən/","extraExplanation":["“Ingushetian”在英语里常用作形容词（如 Ingushetian culture / Ingushetian society）。指“语言”时，也常见更直接的说法“Ingush (language)”。"],"etymology":"来自“Ingushetia（印古什共和国）”加形容词/名词后缀“-an/-ian”，表示“……的/……人”。“Ingushetia”与族名“Ingush（印古什人）”相关。","mnemonic":["把它拆成“Ingushetia（印古什共和国）+ -n/-ian（……的/……人）”，看到后缀就联想到“某地的/某地人”。","联想“Ingush（印古什）”这个更常见的族名：Ingushetian ≈ 与 Ingush 相关。"]}
{"word":"ingustable","summary":{"en":"“Ingus table” isn’t a standard English word. You probably mean “unpalatable”: unpleasant to taste, or (figuratively) hard to accept.","zh":"“ingustable”不是标准英语单词。你可能想写的是“unpalatable”：难吃的；（比喻）难以接受的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard spelling) Likely intended: “unpalatable”—not pleasant to taste; unpleasant to eat or drink.","zh":"（非标准拼写）你可能想写的是 unpalatable：味道不好；难以下咽的。"},"examples":[{"en":"The medicine was unpalatable, so I drank water right after.","zh":"这药很难入口，所以我马上喝了水。"},{"en":"Some people find black coffee unpalatable at first.","zh":"有些人一开始觉得黑咖啡不好喝。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Hard to accept or approve of; unpleasant in a non-food sense.","zh":"（比喻）难以接受的；令人不快的（不指食物）。"},"examples":[{"en":"It was unpalatable news, but we needed to hear it.","zh":"这是个难以接受的消息，但我们必须知道。"},{"en":"The proposal is unpalatable to many employees.","zh":"这个提案让很多员工难以认同。"}]}],"synonyms":["distasteful","disgusting","tasteless","unsavory","hard to accept"],"phonetic":"/ˌʌnˈpælətəbəl/","extraExplanation":["“ingustable”在英语里不常见，通常会被当作拼写错误。和“味道/口感”相关的常用词更可能是：unpalatable（难吃的/难以接受的）、distasteful（令人反感的）、tasteless（没味道的/不得体的）。","词根提示：palatable 来自 palate（上颚/味觉），意思是“可口的、合胃口的”；加上 un- 变成否定：unpalatable。","如果你原本想表达“适合被吃/可食用”，正确词更可能是 edible（可食用的）或 ingestible（可吞食的）。"]}
{"word":"Ingvaeones","summary":{"en":"an ancient North Sea–associated Germanic tribal group (and a related linguistic grouping)","zh":"与北海沿岸相关的古代日耳曼部族分支（及相关语言学分组）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ancient history) A group of early Germanic peoples traditionally associated with the North Sea coast; in historical linguistics, the ancestral group linked to the Ingvaeonic (North Sea Germanic) languages/dialects.","zh":"（古代史）早期日耳曼人的一个传统分支，通常与北海沿岸有关；（历史语言学）与“英格瓦埃奥尼克/北海日耳曼语支（方言）”相关的祖先群体。"},"examples":[{"en":"Some scholars connect Old English features with the Ingvaeones and the broader North Sea Germanic area.","zh":"一些学者将古英语的某些特征与英格瓦埃奥尼斯人以及更广泛的北海日耳曼区域联系起来。"},{"en":"In Roman-era sources, the Ingvaeones are mentioned as one division of the Germanic peoples.","zh":"在罗马时代的文献中，英格瓦埃奥尼斯人被提到是日耳曼人的一个分支。"}]}],"synonyms":["Ingaevones","North Sea Germans","Ingvaeonic peoples"],"phonetic":"ˌɪŋviˈoʊniːz","extraExplanation":["这个词多用于学术语境（古代史、历史语言学），日常英语中很少见。","在一些分类里，Ingvaeones 常与（Istvaeones、Irminones）并列，作为罗马作者对日耳曼人的三分法之一。","语言学里的 “Ingvaeonic” 常用来讨论古英语、古弗里西语、古撒克逊语之间的一些共同特征（即“北海日耳曼”特征）。"],"etymology":"源自拉丁化的人名/族名形式（常见拼写变体为 Ingaevones），罗马作者（如普林尼、塔西佗）用它来分类日耳曼诸族。该名称常被解释为与神话祖先/神祇“Ing/ Yngvi（英格/英维）”有关，后来在语言学中也用来指“北海日耳曼（Ingvaeonic）”这一相关群体或特征圈。","mnemonic":["把它拆成 Ing + vaeones：记住 Ing 常被认为是神话祖先名；整体可联想到“北海沿岸那一支日耳曼人”。","联想发音：Ing- 开头像中文“英-”，容易想到“英（英格兰）语的早期背景”和北海日耳曼圈。"]}
{"word":"Ingvaeonic","summary":{"en":"connected to the North Sea group of early West Germanic languages (especially English and Frisian).","zh":"与西日耳曼语中“北海日耳曼语支”（尤指英语、弗里斯兰语等的早期共同特征）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) relating to the Ingvaeonic (North Sea Germanic) group of West Germanic languages and dialects, especially early forms linked to English, Frisian, and some Low German varieties.","zh":"（语言学）与英格瓦埃奥尼克语支（北海日耳曼语支）有关的；指西日耳曼语中与古英语、弗里斯兰语及部分低地德语相关的一支（或其早期特征）。"},"examples":[{"en":"Some sound changes in Old English are often described as Ingvaeonic features.","zh":"古英语里一些语音变化常被描述为英格瓦埃奥尼克（北海日耳曼）特征。"},{"en":"Frisian is frequently discussed in connection with Ingvaeonic developments.","zh":"弗里斯兰语常常与英格瓦埃奥尼克的发展一起被讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Ingvaeones, an ancient Germanic people mentioned by Roman writers; by extension, someone associated with the Ingvaeonic group.","zh":"英格瓦埃奥尼斯人：罗马作家记载的古代日耳曼族群之一；引申为与英格瓦埃奥尼克语支相关的人。"},"examples":[{"en":"Tacitus lists the Ingvaeones among the early Germanic groupings.","zh":"塔西佗在记载早期日耳曼族群划分时提到英格瓦埃奥尼斯人。"}]}],"synonyms":["North Sea Germanic"],"phonetic":"ˌɪŋviːˈɑːnɪk","extraExplanation":["在历史语言学里，Ingvaeonic 常与 “North Sea Germanic（北海日耳曼语支）” 并用，用来讨论英语、弗里斯兰语及部分低地德语之间共享的早期特征（例如某些鼻音相关的音变、词形变化的趋同等）。这是学术分类术语，日常英语里很少见。"],"etymology":"源自拉丁化名称 Ingvaeones（罗马史家对一支日耳曼人的称呼），再加形容词后缀 -ic，形成表示“与……相关的”的 Ingvaeonic。","mnemonic":["把它拆成 Ing- + -vae- + -onic，联想“英（Ing）语/英格兰周边 + 北海沿岸（海上）= 北海日耳曼”，帮助记住它指向英语与其近亲的早期语支。"]}

