{"word":"ink","summary":{"en":"Ink is a liquid used for writing/printing; it can also mean the dark fluid from squid, and as a verb it means to sign or write with ink.","zh":"ink 指用于书写/印刷的墨水；也可指乌贼等喷出的墨汁；作动词时表示用墨水写下或签署。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colored liquid used for writing, drawing, or printing.","zh":"墨水；用于书写、绘画或印刷的有色液体。"},"examples":[{"en":"My pen ran out of ink.","zh":"我的笔没墨水了。"},{"en":"The printer needs more ink.","zh":"打印机需要更多墨水。"},{"en":"She sketched the outline in ink.","zh":"她用墨水勾勒了轮廓。"}]},{"partOfSpeech":"n.","definition":{"en":"The dark fluid produced by some sea animals (such as squid) to protect themselves.","zh":"（章鱼、乌贼等）喷出的墨汁；用来自我保护的深色液体。"},"examples":[{"en":"The squid released ink to escape.","zh":"乌贼喷出墨汁逃跑。"},{"en":"In the aquarium, the tank water turned dark with ink.","zh":"在水族箱里，水因墨汁变黑了。"}]},{"partOfSpeech":"v.","definition":{"en":"To write, sign, or mark something with ink.","zh":"用墨水写下、签署或做标记。"},"examples":[{"en":"Please ink your name at the bottom of the form.","zh":"请用墨水在表格底部签名。"},{"en":"They inked the contract yesterday.","zh":"他们昨天签了合同。"}]}],"synonyms":["writing fluid","printer ink","inkjet ink"],"phonetic":"/ɪŋk/","extraExplanation":["“ink”在新闻、体育和商业语境里常作动词，表示“签约/签署”。例如：a player inked a deal（某球员签下合约）。","文化用法：短语“in black and white”常与ink相关，强调“白纸黑字、写清楚的证据”。"]}
{"word":"inka","summary":{"en":"Inka (more commonly spelled Inca) refers to the Inca people, their empire/civilization, or the Inca ruler.","zh":"Inka（更常见拼作 Inca）指印加民族、印加帝国/文明，或印加君主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Inca (also spelled Inka): the Indigenous people who built a large empire in the Andes of South America (especially in present-day Peru) before Spanish conquest; also used to describe their culture, language, and rulers","zh":"印加（也拼作 Inka）：西班牙征服前在南美安第斯地区（尤指今秘鲁）建立大型帝国的原住民族；也可指其文化、语言与统治者"},"examples":[{"en":"Machu Picchu is a famous site from the Inca civilization.","zh":"马丘比丘是印加文明的著名遗址。"},{"en":"The Inca Empire grew quickly in the 1400s.","zh":"印加帝国在15世纪迅速扩张。"},{"en":"She is studying Inca history in her Latin American studies class.","zh":"她在拉丁美洲研究课上学习印加历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Inca ruler or royal family (sometimes written with a capital letter)","zh":"印加统治者或王室（常用大写表示）"},"examples":[{"en":"The Inca was considered both a political leader and a religious figure.","zh":"印加君主既被视为政治领袖，也被视为宗教人物。"},{"en":"Spanish accounts often describe meetings with the Inca.","zh":"西班牙人的记载常描述他们与印加君主的会面。"}]}],"synonyms":["Inca"],"phonetic":"ˈɪŋkə","extraExplanation":["“Inka/印加”是拼写差异：英语里更常见 Inca，但在一些学术写法、或更接近克丘亚语（Quechua）发音的转写中会用 Inka。","在英语文本中常见搭配：Inca Empire（印加帝国）, Inca civilization（印加文明）, Inca road system（印加道路系统）。","文学与旅行写作里常用 Inca 来营造“失落古文明”的意象，例如描写安第斯山脉、马丘比丘与石砌建筑技艺等。"]}
{"word":"inkberries","summary":{"en":"Inkberries are the dark berries—and the evergreen shrub that bears them—commonly found in eastern North America and used in landscaping.","zh":"inkberries 指深色（近黑色）的浆果，也指结这种果实的常绿灌木（墨果冬青），多见于北美东部并常用于园林绿化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of evergreen shrub (especially in eastern North America) with small dark berries; often used in landscaping. It is also the common name for the berries of this plant.","zh":"一种常绿灌木（多见于北美东部），结小而深色的浆果；常用于园林绿化。“inkberries”也可指这种植物结的浆果。"},"examples":[{"en":"Inkberries are often planted as low hedges because they stay green all year.","zh":"墨果冬青常被种作矮篱，因为它们四季常绿。"},{"en":"Birds eat the inkberries in winter when other food is scarce.","zh":"冬天其他食物稀少时，鸟会吃墨果冬青的果实。"}]}],"synonyms":["inkberry (singular)","Ilex glabra","evergreen shrub"],"phonetic":"/ˈɪŋkˌbɛriz/","extraExplanation":["“inkberry”常指植物名“墨果冬青”（Ilex glabra），属于冬青属。它的果实通常不被人当作食用浆果（与蓝莓等不同），但对鸟类等野生动物很重要。","英文里也会用“inkberry”形容果实颜色很深、像墨水一样黑（ink + berry）。"]}
{"word":"inkberry","summary":{"en":"Inkberry is a type of evergreen holly shrub with dark berries, common in eastern North America and used in landscaping.","zh":"Inkberry 指一种结深色果实的常绿冬青灌木，原产北美东部，常用于园林绿化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An evergreen shrub (Ilex glabra) native to eastern North America, with small dark berries and glossy leaves, often used in landscaping and wetland gardens.","zh":"墨果冬青（Ilex glabra）：一种原产于北美东部的常绿灌木，结小而深色的浆果、叶片有光泽，常用于园林绿化和湿地花园。"},"examples":[{"en":"Inkberry is often planted as a low hedge because it stays green in winter.","zh":"墨果冬青常被种作低矮的绿篱，因为它在冬天也能保持常绿。"},{"en":"We chose inkberry for the rain garden since it tolerates wet soil.","zh":"我们在雨水花园里选择墨果冬青，因为它能适应潮湿的土壤。"}]}],"synonyms":["inkberry holly","Ilex glabra"],"phonetic":"/ˈɪŋkˌbɛri/","extraExplanation":["“Inkberry”这个名字来自它的深色果实：早期有人会用果实的汁液来做染料或写字的墨水（并非现代常用做法）。","它属于冬青属（holly, Ilex）。和有刺叶的传统“holly”相比，inkberry的叶缘通常较平滑，因此在园艺中也常被当作更“柔和”的常绿灌木选择。","在美国英语里它更多出现在园艺、生态修复、湿地植物等语境中；日常对话里不算常见。"]}
{"word":"inkblot","summary":{"en":"An inkblot is a mark made by spilled ink, or a patterned ink image used in psychological testing (Rorschach).","zh":"inkblot 指墨水渍/墨点，也可指心理测验中的墨迹图（罗夏墨迹测验）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A spot or smear of ink, especially one made accidentally on paper.","zh":"墨水渍；墨点（尤指不小心滴到纸上的污渍）"},"examples":[{"en":"There’s an inkblot on the corner of my homework page.","zh":"我的作业纸角上有个墨水渍。"},{"en":"He tried to cover the inkblot with correction fluid.","zh":"他试图用涂改液盖住那个墨点。"}]},{"partOfSpeech":"n.","definition":{"en":"A patterned ink image used in psychological tests to see what a person might perceive in it (often referring to the Rorschach test).","zh":"（心理测验用的）墨迹图（常指罗夏墨迹测验，用来观察人从墨迹中会看出什么）"},"examples":[{"en":"In the inkblot test, people describe what they see in each picture.","zh":"在墨迹测验中，人们描述自己在每张图里看到了什么。"},{"en":"Some critics say an inkblot can be interpreted in many different ways.","zh":"一些批评者认为墨迹图可以有很多不同解读。"}]}],"synonyms":["ink stain","blot","smear","Rorschach"],"phonetic":"/ˈɪŋkˌblɑt/","extraExplanation":["“inkblot”由“ink（墨水）+ blot（污渍）”构成，日常多指不小心弄脏的墨点；在文化语境中常与“Rorschach inkblot test（罗夏墨迹测验）”相关。","在媒体与评论写作里，inkblot有时会被用作比喻：某个信息、事件或政策像“墨迹图”一样，让不同的人投射出不同解读（强调“含糊、可被多重解释”）。"]}
{"word":"inkblots","summary":{"en":"“Inkblots” means stains or spots of ink, and it can also refer to the ambiguous ink patterns used in the Rorschach test.","zh":"“Inkblots”指墨渍/墨点，也可指罗夏墨迹测验中那种模糊的墨迹图案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blot or spot of ink; a stain made by spilled or smeared ink.","zh":"墨渍；墨水留下的污点或斑点。"},"examples":[{"en":"There were inkblots all over my notebook after my pen leaked.","zh":"我的笔漏墨后，笔记本上到处都是墨渍。"},{"en":"He tried to wipe away the inkblots, but the paper tore.","zh":"他想把墨渍擦掉，但纸被擦破了。"}]},{"partOfSpeech":"n.","definition":{"en":"Inkblot tests or patterns (often referring to the Rorschach test), used to explore how people interpret ambiguous images.","zh":"墨迹测验的图案（常指罗夏墨迹测验），用来观察人们如何解读模糊图像。"},"examples":[{"en":"The therapist showed her a series of inkblots and asked what she saw.","zh":"治疗师给她看了一系列墨迹图案，问她看到了什么。"},{"en":"People joked that the movie felt like a string of inkblots—everyone saw something different.","zh":"人们开玩笑说这部电影像一串墨迹图案——每个人看法都不一样。"}]}],"synonyms":["ink stains","blots","smudges","Rorschach patterns"],"phonetic":"/ˈɪŋkˌblɑts/","extraExplanation":["“Inkblot”最常见的文化背景是“Rorschach inkblot test（罗夏墨迹测验）”。它并不是“有标准答案”的测验，而是利用图像的模糊性，让人自由联想；在日常英语里也常被引申为“同一件事每个人都能看出不同含义”。","拼写与数：单数 inkblot；复数 inkblots。这个词也可作定语，如 inkblot test（墨迹测验）、inkblot pattern（墨迹图案）。"]}
{"word":"inkbush","summary":{"en":"Inkbrush is a common name for a shrub with very dark berries, often referring to inkberry holly.","zh":"inkbush/inkbrush 常指结近黑色浆果的灌木，常用来指墨果冬青等植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub with very dark (almost black) berries; often used as a common name for the inkberry holly (Ilex glabra) and similar plants","zh":"结深色（近黑色）浆果的灌木；常作俗名指“墨果冬青”（Ilex glabra）等类似植物"},"examples":[{"en":"Inkbrush grows well in sandy coastal areas and stays green through winter.","zh":"墨果灌木在海岸的沙地里长得很好，而且冬天也常绿。"},{"en":"The gardener planted inkbush as a low hedge because it’s hardy and tidy.","zh":"园丁种了墨果灌木当低矮的树篱，因为它耐寒又整齐。"}]}],"synonyms":["inkberry","inkberry holly","Ilex glabra"],"phonetic":"/ˈɪŋkˌbʊʃ/","extraExplanation":["“inkbush”不是非常固定的单一物种名，而是英语里的俗名（common name），在不同地区可能指不同植物；在美国语境里常和“inkberry（墨果冬青，Ilex glabra）”互换使用。","之所以叫“ink-”，通常与果实颜色很深有关；历史上某些深色浆果也会被拿来做染料或“像墨水一样的颜色”来描述，但现代更多是颜色联想而非真的用来制墨。"]}
{"word":"inked","summary":{"en":"“Inked” most commonly means written/marked with ink; it can also mean ink-stained, tattooed (informal), or signed under contract (informal).","zh":"“inked”最常指“用墨水写/做标记”；也可指“沾墨的/被墨水弄脏的”，口语里还可指“有纹身的”或“已签约的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “ink”) to write, draw, print, or mark something using ink.","zh":"（动词 ink 的过去式/过去分词）用墨水书写、绘画、印刷或做标记。"},"examples":[{"en":"She inked her signature at the bottom of the form.","zh":"她在表格底部用墨水签了名。"},{"en":"The editor inked a note in the margin.","zh":"编辑在页边用墨水写了一条备注。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having ink on it; marked or stained with ink.","zh":"沾有墨水的；被墨水标记或弄脏的。"},"examples":[{"en":"Be careful—your fingers are inked.","zh":"小心——你的手指沾了墨水。"},{"en":"He handed me an inked page with corrections.","zh":"他递给我一页写满修改痕迹的纸。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Tattooed; having tattoos.","zh":"（非正式）纹身的；身上有纹身的。"},"examples":[{"en":"He’s heavily inked on both arms.","zh":"他两只胳膊上都有很多纹身。"},{"en":"Some workplaces still judge people who are inked.","zh":"有些职场仍会对有纹身的人带有偏见。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, business/sports) Having signed a contract or deal.","zh":"（非正式，商业/体育）签约的；达成并签署协议的。"},"examples":[{"en":"The team inked a new striker last week.","zh":"球队上周签下了一名新前锋。"},{"en":"The partnership is inked and ready to announce.","zh":"合作已签署完成，准备公布。"}]}],"synonyms":["written","signed","tattooed","marked","stained"],"phonetic":"/ɪŋkt/","extraExplanation":["“inked”表示“纹身的”时，常见于口语与流行文化（如音乐、街头文化、运动圈），语气通常中性，但也可能带有“很酷/很有个性”的暗示。正式写作中更常用 tattooed。","表示“签约”的 ink / inked 在体育新闻和商业报道里很常见，来源于“用墨水签合同”的画面感。"]}
{"word":"inken","summary":{"en":"Inken is most commonly used as a female first name, especially in Northern Germany.","zh":"Inken 通常用作女性名字，尤见于德国北部。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name, used especially in Northern Germany (Frisia) and sometimes in Scandinavia.","zh":"女性名字，常见于德国北部（弗里西亚地区），在斯堪的纳维亚也偶尔使用。"},"examples":[{"en":"Inken moved to the U.S. for graduate school.","zh":"Inken 为了读研究生搬到了美国。"},{"en":"I met someone named Inken at the conference in Hamburg.","zh":"我在汉堡的会议上认识了一个叫 Inken 的人。"}]}],"synonyms":["Inka","Inke","Inga"],"phonetic":"/ˈɪŋkən/","extraExplanation":["“Inken”多被视为德语/弗里西亚地区的女性名，常被解释为对某些以 -ina/-ke 结尾名字的昵称或变体（不同来源说法略有差异）。","如果你本来想查的是英语单词“ink”（墨水）或动词“to ink”（用墨水写/签），告诉我你要的词，我可以给出对应的释义与例句。"]}
{"word":"inker","summary":{"en":"An inker is usually someone (or sometimes a tool) that applies ink—especially in printing or comics, where an inker draws the final ink lines over a pencil sketch.","zh":"inker 通常指“上墨的人/装置”，常见于印刷或漫画行业；在漫画里尤其指在铅笔稿上用墨线描出最终线条的描线师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker or device used to apply ink, especially in printing (e.g., someone who inks lines or a machine part that spreads ink).","zh":"上墨的人；涂墨装置（尤用于印刷，如给线条上墨的人或把油墨均匀涂开的机器部件）。"},"examples":[{"en":"In old print shops, an inker would spread ink evenly on the plate before printing.","zh":"在老式印刷作坊里，上墨工会在印刷前把油墨均匀涂在印版上。"},{"en":"The inker checked the color and coverage before the posters went to press.","zh":"上墨人员在海报开印前会检查颜色和覆盖度。"}]},{"partOfSpeech":"n.","definition":{"en":"In comics and illustration, the artist who goes over pencil drawings with ink to create clean, final lines.","zh":"（漫画/插画）描线师；勾线师（用墨线把铅笔稿描成清晰的最终线条的画师）。"},"examples":[{"en":"The penciler created the layout, and the inker finished the bold outlines.","zh":"铅笔稿画师负责构图，描线师完成粗黑的外轮廓。"},{"en":"A good inker can make the same sketch look sharper and more dramatic.","zh":"优秀的描线师能让同一张草图看起来更利落、更有张力。"}]},{"partOfSpeech":"n.","definition":{"en":"A pen used to apply ink, especially in a technical or older sense.","zh":"上墨笔；蘸墨笔（较偏技术或旧式用法）。"},"examples":[{"en":"He chose a fine inker for detailed lettering.","zh":"他选了一支细尖上墨笔来写精细的字。"}]}],"synonyms":["comic inker","ink artist","line artist","printer's inker"],"phonetic":"/ˈɪŋkɚ/","extraExplanation":["在漫画行业里常见搭配是 penciler（画铅笔稿的人）与 inker（描线的人）。有时也会听到 ink（v. 用墨描线/上墨）这个动词：The artist inked the page.（画师给这一页描了线）。","日常英语里“pen（笔）”更常用；“inker”表示“笔”的用法相对少见，多出现在特定行业或语境中。"]}
{"word":"inkerman","summary":{"en":"Inkerman is a place near Sevastopol in Crimea and is also the name of an important 1854 battle in the Crimean War.","zh":"Inkerman 指克里米亚塞瓦斯托波尔附近的地名，也可指1854年克里米亚战争中的“英克曼战役”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A district (and former town) near Sevastopol in Crimea, known for its limestone cliffs, caves, and historic sites.","zh":"英克曼（Inkerman），位于克里米亚塞瓦斯托波尔附近的地区（曾为城镇），以石灰岩峭壁、洞穴和历史遗迹而闻名。"},"examples":[{"en":"We visited Inkerman to see the caves and the old monastery carved into the rock.","zh":"我们去了英克曼，看岩洞和凿刻在岩壁上的古老修道院。"},{"en":"Inkerman lies close to Sevastopol, an important port on the Black Sea.","zh":"英克曼靠近塞瓦斯托波尔，这是黑海的重要港口。"}]},{"partOfSpeech":"n.","definition":{"en":"The Battle of Inkerman (1854), a major battle of the Crimean War fought near Sevastopol between Russian forces and the British-French-Ottoman alliance.","zh":"英克曼战役（1854年），克里米亚战争中的重要战役之一，发生在塞瓦斯托波尔附近，由俄军与英法奥同盟交战。"},"examples":[{"en":"In the Crimean War, the Battle of Inkerman became known for fierce fighting in heavy fog.","zh":"在克里米亚战争中，英克曼战役因大雾中的惨烈近战而出名。"},{"en":"Some histories describe Inkerman as a turning point in the siege of Sevastopol.","zh":"一些史书将英克曼视为塞瓦斯托波尔围城战中的一个转折点。"}]}],"synonyms":["Battle of Inkerman","Inkerman (Crimea)","Inkerman Cave Monastery"],"phonetic":"/ˈɪŋkərmən/","extraExplanation":["“Inkerman”在英语里通常作为专有名词出现：要么指地名（靠近塞瓦斯托波尔的地区），要么指1854年的“英克曼战役”。在阅读历史材料时，若上下文出现Crimean War（克里米亚战争）、siege of Sevastopol（围攻塞瓦斯托波尔）等词，往往是在指战役而非地名。"]}
{"word":"inkers","summary":{"en":"“Inkers” usually means people who apply ink to artwork, especially comic artists who ink pencil drawings.","zh":"“Inkers”通常指给作品上墨的人，尤其是把铅笔线稿描成墨线的漫画描墨师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who apply ink, especially artists who ink drawings (often in comics) or workers who fill in printed lines.","zh":"给作品上墨的人；尤其指给线稿描墨的画师（常见于漫画行业），或负责用墨把印刷线条补全的工作人员。"},"examples":[{"en":"The penciler sketched the scene, and the inkers added clean black lines.","zh":"铅笔稿画师先画出场景，描墨师再加上干净利落的黑色线条。"},{"en":"In many comic credits, inkers are listed separately from colorists.","zh":"在很多漫画的署名里，描墨师会和上色师分开列出。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “inker”: a pen or device that applies ink (less common).","zh":"“inker”的复数：上墨工具或涂墨装置（较少见）。"},"examples":[{"en":"The lab tested different inkers to see which produced the sharpest lines.","zh":"实验室测试了不同的上墨装置，看看哪一种线条最清晰。"}]}],"synonyms":["ink artists","comic inkers","line artists"],"phonetic":"/ˈɪŋkərz/","extraExplanation":["在英语的漫画制作流程里，常见分工是：penciler（铅笔稿）→ inker（描墨/勾线）→ colorist（上色）→ letterer（字效）。因此你在漫画封面或版权页看到“inkers”，通常就是指负责把铅笔线稿用墨线“定稿”的人。","注意不要和“thinkers（思想家们）”混淆；发音和拼写都很接近，但意义完全不同。"]}
{"word":"inket","summary":{"en":"“Inket” is a rare word meaning a small ink container (like an inkwell), or sometimes a small amount of ink.","zh":"“inket”是个很少见的词，通常指装墨水的小容器（类似inkwell），有时也可指少量墨水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) A small container or utensil for holding ink; an inkstand/inkwell.","zh":"（罕见/旧式）装墨水的小容器或用具；墨水瓶/墨水缸。"},"examples":[{"en":"He kept an inket on the desk beside his quill pen.","zh":"他在羽毛笔旁的桌上放着一个墨水小器具（inket）。"},{"en":"In older writings, “inket” may refer to an inkwell used for handwriting.","zh":"在较早的文字里，“inket”有时指书写用的墨水瓶（inkwell）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A small amount of ink.","zh":"（罕见）少量墨水。"},"examples":[{"en":"Just an inket of ink was left in the bottle.","zh":"瓶里只剩下一点点墨水了。"}]}],"synonyms":["inkwell","inkstand"],"phonetic":"/ˈɪŋkɪt/","extraExplanation":["“inket”在现代英语中非常少见，更常用的词是“inkwell”（墨水瓶/墨水缸）或“ink”本身。","很多学习者会把“inket”看成“inkjet”（喷墨）的拼写错误；如果你想表达“喷墨打印机/喷墨技术”，正确拼写是“inkjet”。"]}
{"word":"inkfish","summary":{"en":"Inkfish is an informal word for a squid or cuttlefish, known for releasing ink.","zh":"Inkfish 是鱿鱼或墨鱼的口语说法，强调它们会喷墨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a squid or cuttlefish (an animal that releases ink as a defense); used as an informal name rather than a strict scientific term","zh":"鱿鱼或墨鱼（遇到危险会喷墨自卫的动物）；更偏口语称呼，不是严格的科学术语"},"examples":[{"en":"We saw an inkfish shoot a cloud of ink and disappear.","zh":"我们看到一只“inkfish”喷出一团墨汁然后消失了。"},{"en":"This recipe uses inkfish ink to color the pasta black.","zh":"这个食谱用“inkfish”的墨汁把意大利面染成黑色。"}]}],"synonyms":["squid","cuttlefish","cephalopod"],"phonetic":"/ˈɪŋkˌfɪʃ/","extraExplanation":["“inkfish”在现代英语里并不算常见，更常用的是“squid（鱿鱼）”或“cuttlefish（墨鱼）”。如果你在菜单、渔市或文学描写里看到“inkfish”，通常是在强调“会喷墨”的特点。","与食物相关时，人们更常说“squid ink（鱿鱼墨）”或“cuttlefish ink（墨鱼墨）”，比如“squid-ink pasta（墨汁意面）”。"]}
{"word":"inkholder","summary":{"en":"An inkholder is a container used to hold ink for a dipping pen.","zh":"inkholder 指用来盛放墨水、供蘸水笔使用的墨水容器/墨水座。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small container (often part of a desk set) used for holding ink for dipping a pen","zh":"墨水座；墨水瓶座（常见于书桌套装中，用来盛放墨水，供蘸水笔使用）"},"examples":[{"en":"On the old wooden desk, a brass inkholder sat beside a stack of letters.","zh":"在那张旧木桌上，一个黄铜墨水座放在一叠信件旁边。"},{"en":"She dipped the pen into the inkholder and began to write carefully.","zh":"她把笔尖蘸进墨水座里，开始认真书写。"}]}],"synonyms":["inkwell","ink bottle","inkstand"],"phonetic":"/ˈɪŋkˌhoʊldɚ/","extraExplanation":["“inkholder”多见于较旧的语境（传统书写用品）。在现代英语中，更常见的说法是“inkwell”（墨水瓶/墨水槽）或“ink bottle”（墨水瓶）。它常与羽毛笔、蘸水笔（dip pen）以及旧式书桌文具套装（desk set）一起出现，带有一点复古或文学氛围。"]}
{"word":"inkhorn","summary":{"en":"“Inkhorn” means an old-fashioned ink container, and it can also refer to overly bookish, showy vocabulary (an “inkhorn term”).","zh":"“inkhorn”既指旧式墨水容器，也可指过于书面、卖弄学问的词汇（inkhorn term）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small container (often shaped like a horn) used for holding ink; an inkwell.","zh":"墨水瓶；（常做成角状的）装墨水的小容器。"},"examples":[{"en":"The clerk dipped his quill into the inkhorn before signing the document.","zh":"书记员把羽毛笔蘸进墨水瓶里，然后在文件上签字。"},{"en":"In old illustrations, a writer often carries an inkhorn at his belt.","zh":"在一些古老插图里，写作者常把墨水瓶系在腰带上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often in the phrase “inkhorn term”) A word that is long, bookish, and overly learned—used in a way that can sound unnatural or showy.","zh":"（常见于短语“inkhorn term”）过于书面、学究气、刻意卖弄的词；用起来显得不自然或装腔作势。"},"examples":[{"en":"Some readers dislike inkhorn terms because they make simple ideas harder to understand.","zh":"有些读者不喜欢“学究式词汇”，因为它们让简单的意思变得难懂。"},{"en":"He replaced the inkhorn wording with plain English to make the message clearer.","zh":"他把卖弄的书面措辞换成了通俗英语，让信息更清楚。"}]}],"synonyms":["inkwell","ink bottle","inkpot","(for sense 2) pretentious word","pedantic term","bookish word"],"phonetic":"/ˈɪŋkˌhɔrn/","extraExplanation":["“inkhorn”最初指装墨水的器具（常由动物角制成），后来在16世纪英语里引申出“inkhorn terms（墨水角词）”这一说法，用来讽刺某些人刻意借用拉丁语/希腊语的长词，显得矫揉造作。","现代写作建议里偶尔还会提到“avoid inkhorn terms（避免学究式词汇）”，意思是尽量用清晰、自然、读者友好的表达。"]}
{"word":"inkhornism","summary":{"en":"Inkhornism means using overly learned, unnatural vocabulary (or an individual pretentious word/phrase) that makes writing or speech harder to understand.","zh":"Inkhor nism 指过度学究、刻意生僻的用词（也可指某个具体的矫饰词语/说法），常使表达更难懂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The use of unusual, overly learned, or “bookish” words (often borrowed from Latin or Greek) in a way that sounds unnatural, pretentious, or hard to understand.","zh":"（常指从拉丁语或希腊语借来）刻意使用生僻、过于学究气的词语，使表达显得不自然、卖弄或难懂。"},"examples":[{"en":"Some readers felt the essay was full of inkhornism and needed simpler language.","zh":"一些读者觉得这篇文章充满了“卖弄词藻”的表达，应该用更简单的语言。"},{"en":"His speech was clear, but occasional inkhornism distracted the audience.","zh":"他的演讲总体清晰，但偶尔的生僻用词让听众分心。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific “inkhorn” word or phrase—an affected, artificially learned expression.","zh":"某个具体的“墨水角式”词语/说法：刻意装学问、显得矫揉造作的表达。"},"examples":[{"en":"The editor removed a few inkhornisms to make the article more readable.","zh":"编辑删掉了几处矫饰的词语，让文章更易读。"}]}],"synonyms":["pretentious diction","pedantry","verbosity","high-flown language","bombast"],"phonetic":"/ˈɪŋkˌhɔrnˌɪzəm/","extraExplanation":["“Inkhorn”原指装墨水的小角瓶（像角制容器），16世纪英国文坛曾有“inkhorn controversy”（墨水角之争）：一些作家大量引入拉丁语/希腊语词汇来“抬高”英语，反对者则认为这种写法华而不实、妨碍大众理解。由此产生 inkhor(n)ism 一词，用来批评过分卖弄学问的用词。"]}
{"word":"inkhornist","summary":{"en":"An inkhornist is someone criticized for using overly fancy, learned vocabulary instead of clear, simple English.","zh":"inkhornist 指因使用过于华丽、生僻、学究式词汇而被批评的人，常暗含“卖弄辞藻、不够清楚”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often criticized) who uses overly learned, artificial, or showy words—especially Latinate “inkhorn terms”—instead of simple, clear language; a pedantic writer or speaker.","zh":"（常带贬义）指爱用生僻、矫饰、卖弄学问的词（尤指拉丁/法语来源的“墨壶词”）来代替朴素清晰表达的人；卖弄辞藻的作者或说话者。"},"examples":[{"en":"Some critics called him an inkhornist because his essays were full of rare Latin-based words.","zh":"一些评论家称他为“inkhornist”，因为他的文章充满了罕见的拉丁词根词。"},{"en":"Her teacher advised her to avoid sounding like an inkhornist and to write more plainly.","zh":"老师建议她别写得像“inkhornist”那样卖弄词藻，要更朴实清楚。"},{"en":"The speech tried to impress the audience, but the inkhornist style made it hard to follow.","zh":"这篇演讲想给听众留下深刻印象，但那种卖弄辞藻的风格反而让人难以理解。"}]}],"synonyms":["pedant","word-monger","pompous writer","affected speaker"],"phonetic":"/ˈɪŋkˌhɔrnɪst/","extraExplanation":["“inkhornist”源于16世纪英语中的“inkhorn terms”（墨壶词）。当时有人反对把过多拉丁语/希腊语的学术词硬塞进英语，认为这种写法矫揉造作、脱离大众语言。","“inkhorn”（墨壶/便携式墨水角）暗示写作者把“学问”装在墨壶里，借用生僻词来显得博学，因此该词常用于讽刺。","相关文化语境：文艺复兴时期英语迅速吸收外来词，既推动了词汇发展，也引发“写得太学究、太华丽是否必要”的争论。"]}
{"word":"inkhornize","summary":{"en":"To inkhornize is to use overly fancy or obscure vocabulary in a pedantic way.","zh":"“inkhornize”指用过于华丽或生僻的词来表达，显得矫饰、卖弄。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to use overly fancy, bookish, or obscure words (\"inkhorn terms\"), especially in a way that sounds pedantic or unnatural","zh":"（尤指）使用过于华丽、书卷气或生僻的词语（“墨水瓶式词汇”），使表达显得卖弄或不自然"},"examples":[{"en":"He tried to sound intelligent, but he just inkhornized every sentence with rare Latin words.","zh":"他想显得很聪明，但他每句话都塞进稀奇的拉丁词，反而像在卖弄。"},{"en":"Good writing should be clear—don’t inkhornize when simple words will do.","zh":"好写作应当清晰——能用简单词就别“墨水瓶化”。"}]}],"synonyms":["embroider (language)","overword","be pretentious","use high-flown language","be verbose"],"phonetic":"/ˈɪŋkˌhɔrnˌaɪz/","extraExplanation":["“inkhornize”源自“inkhorn”（旧时装墨水的角制小瓶）。16世纪英国有“inkhorn controversy（墨水瓶争论）”：一些学者喜欢从拉丁语/希腊语借入新词，被批评为写作晦涩、矫饰；因此“inkhorn”逐渐带有“书呆子式用词”的贬义。","这个词很少用于日常口语，更常见于语言学/写作风格讨论中，用来批评“过度堆砌高大上词汇”的表达方式。"]}
{"word":"inkhornizer","summary":{"en":"An inkhornizer is a (usually criticized) writer or speaker who uses overly fancy, learned vocabulary instead of clear language.","zh":"inkhornizer 指（常带贬义）爱用卖弄学问的华丽词藻、而不重视清晰表达的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (especially a writer or speaker) who uses overly long, learned, or “fancy” words in a pedantic way; someone who favors “inkhorn terms.”","zh":"（尤指写作者或演讲者）爱用冗长、学究气的“华丽词藻”的人；偏好使用“墨水瓶词”（inkhorn terms）的人。"},"examples":[{"en":"Some critics mocked him as an inkhornizer because his essays were full of Latin-based words.","zh":"一些评论家嘲笑他是个 inkhornizer，因为他的文章里满是拉丁语词根的词。"},{"en":"She rewrote the paragraph to sound clearer and less like an inkhornizer.","zh":"她重写了那段话，让它更清楚，也没那么“卖弄学问”。"}]}],"synonyms":["pedant","word-monger","pretentious writer","grandiloquent speaker","verbosity"],"phonetic":"/ˈɪŋkˌhɔrnˌaɪzər/","extraExplanation":["“Inkhorn”原指装墨水的角制小瓶，后来在16—17世纪的英语里引申出“inkhorn terms”，用来讽刺从拉丁语/希腊语硬造或生搬硬套的“书斋词汇”。“Inkhornizer”因此带有批评意味，强调用词浮夸、为显学问而不顾清晰表达。","这个词非常少见、偏历史语境；现代英语更常用的说法有 pedant（书呆子/迂腐的人）、pretentious writer（矫饰的写作者）、uses grandiloquent language（辞藻浮夸）。"]}
{"word":"inkhorns","summary":{"en":"“Inkhorns” can mean old portable ink containers, or (more often in writing criticism) overly learned, hard-to-read words (“inkhorn terms”).","zh":"“inkhorns”既可指旧时便携式墨水壶，也可指（写作批评中常用）故作高深、难读的学究词（inkhorn terms）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small containers (often made from horn) used for carrying ink, especially in the past.","zh":"（尤指过去用牛角等制成的）便携式墨水壶/墨水容器。"},"examples":[{"en":"The scribe kept his pens and inkhorns in a leather pouch.","zh":"抄写员把羽毛笔和墨水壶放在一个皮袋里。"},{"en":"In the museum, you can see old inkhorns alongside quills and parchment.","zh":"在博物馆里，你可以看到旧式墨水壶与羽毛笔、羊皮纸陈列在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often negative, old-fashioned) Unusual or overly “learned” words used to sound educated; also called “inkhorn terms.”","zh":"（常含贬义，较旧式）为显得有学问而使用的生僻、过于学究气的词；也叫“inkhorn terms（学究词）”。"},"examples":[{"en":"Some writers avoided inkhorns because they wanted their English to stay simple and clear.","zh":"一些作家避免使用“学究词”，因为他们希望英语保持简洁明了。"},{"en":"The teacher warned that too many inkhorns can make your writing hard to read.","zh":"老师提醒：学究气太重的生僻词会让文章难读。"}]}],"synonyms":["ink bottle","inkwell","inkhorn terms","pedantic words","high-flown language"],"phonetic":"/ˈɪŋkˌhɔrn/","extraExplanation":["“inkhorn”原指装墨水的小角壶（常用动物角制作），后来引申为“书斋气/学究气的词”。在16世纪文艺复兴时期，英语大量从拉丁语、希腊语借词，有人支持丰富词汇，也有人反对滥用生僻外来词，于是出现了“inkhorn controversy（学究词之争）”。因此当“inkhorn(s)”指词汇时，语气通常偏批评：说某人故意用难词来显得更有学问。"]}
{"word":"inkie","summary":{"en":"“Inkie” is usually a playful/nonstandard form of “inky,” meaning ink-covered or ink-dark; it’s not common in standard English.","zh":"“inkie”通常是“inky”的俏皮/非标准写法，表示“沾墨的、墨黑的”；在标准英语中不常见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A nonstandard or playful spelling of “inky,” meaning covered with ink or dark like ink.","zh":"“inky”的非标准或俏皮拼写，意思是“沾满墨水的 / 像墨一样黑的”。"},"examples":[{"en":"My fingers were inkie after I changed the printer cartridge.","zh":"我换打印机墨盒后，手指变得黑乎乎的（沾满墨）。"},{"en":"The inkie stain wouldn’t wash out of the shirt.","zh":"衬衫上的墨渍怎么洗都洗不掉。"}]},{"partOfSpeech":"n.","definition":{"en":"A very informal word for something small and related to ink (for example, an ink mark), used rarely and mostly in casual writing.","zh":"非常口语、较少见的说法，指与墨水有关的小东西（如小墨点/墨痕），多见于随意表达。"},"examples":[{"en":"There’s a tiny inkie on the corner of the page.","zh":"纸角上有个小小的墨点。"}]}],"synonyms":["inky","ink-stained","blackened"],"phonetic":"/ˈɪŋki/","extraExplanation":["“inkie”在标准英语词典里并不常见；多数情况下，人们想写的是“inky”。如果你是在特定作品、品牌名、昵称或方言里看到“inkie”，用法可能会有专门含义，需要结合上下文确认。"]}
{"word":"inkier","summary":{"en":"Inkier means “more inky”: darker or more ink-black, and sometimes more gloomy or hard to see.","zh":"Inkier 表示“更像墨水一样黑”：更黑、更阴暗；也可指更难看清或更晦暗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of inky: darker, blacker, or more like ink in color.","zh":"inky 的比较级：更黑的、更像墨水颜色的。"},"examples":[{"en":"The sky grew inkier as the storm moved in.","zh":"暴风雨逼近时，天空变得更黑了。"},{"en":"This pen makes an inkier line than the pencil.","zh":"这支笔画出来的线比铅笔更黑。"}]},{"partOfSpeech":"adj.","definition":{"en":"More gloomy, mysterious, or hard to see/understand (often describing night, shadows, or writing).","zh":"更阴沉的、更神秘的；更难看清/难理解的（常形容夜色、阴影或文字）。"},"examples":[{"en":"The alley looked inkier at the far end, where the streetlights didn’t reach.","zh":"小巷尽头路灯照不到，看起来更阴暗。"},{"en":"His notes became inkier and harder to read as he rushed.","zh":"他写得很急，笔记变得更“黑糊糊”的，也更难辨认。"}]}],"synonyms":["darker","blacker","murkier","gloomier"],"phonetic":"/ˈɪŋkiər/","extraExplanation":["“inkier”是形容词“inky”的比较级（一般在词尾加 -er）。常见搭配有：inkier sky/night/shadows（更黑的天空/夜色/阴影）、inkier line（更黑的线条）。","文学描写里，“inky/inkier”常用来营造夜晚或海面的深黑感与神秘感，相当于更有画面感的“darker”。"]}
{"word":"inkies","summary":{"en":"“Inkies” usually means small ink spots/stains (informal), but in South African English it can also be an offensive slur for an Indian person.","zh":"“inkies”通常指小墨点/墨渍（口语）；但在南非英语中也可能是针对印度裔人士的冒犯性贬称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Small spots or blobs of ink; ink stains (plural of “inkie”).","zh":"（非正式）小墨点；墨渍（“inkie”的复数）。"},"examples":[{"en":"There are a few inkies on my shirt from the pen.","zh":"我的衬衫上被笔弄出了几个小墨点。"},{"en":"Try using a blotter to clean up the inkies on the page.","zh":"试试用吸墨纸把纸上的墨渍吸掉。"}]},{"partOfSpeech":"n.","definition":{"en":"(South African English, offensive) A derogatory term for an Indian person.","zh":"（南非英语，冒犯性用语）对印度裔人士的贬称。"},"examples":[{"en":"That word is a slur; don’t use it.","zh":"那个词是侮辱性的贬称，不要使用。"},{"en":"The school has a policy against racist language, including slurs like “inkies.”","zh":"学校禁止使用种族歧视语言，包括像“inkies”这样的贬称。"}]}],"synonyms":["ink spots","ink stains","blots","smudges"],"phonetic":"/ˈɪŋkiz/","extraExplanation":["“inkies”更常被理解为“inkie（小墨点/墨渍）”的复数，语气偏口语。在某些地区（尤其南非），“inkies”也可能被当作种族侮辱语使用；即使在引用他人原话时也应谨慎，建议用更中性的表达（如“Indian person/印度裔人士”）或直接说明“a slur（贬称）”。"]}
{"word":"inkiest","summary":{"en":"“Inkiest” means the darkest—deep, inky black.","zh":"“Inkiest”表示“最墨黑的、最漆黑的”，强调深浓如墨的黑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The most inky; very dark or deep black (often used to describe night, shadows, or darkness).","zh":"最墨黑的；漆黑的、黑得发亮的（常形容夜晚、阴影或黑暗）。"},"examples":[{"en":"The moon disappeared behind clouds, and the sky turned inkiest black.","zh":"月亮躲进云后，天空变成了最墨黑的黑色。"},{"en":"We walked along the inkiest part of the alley, where the streetlights couldn’t reach.","zh":"我们走在巷子里最漆黑的地方，路灯照不到那里。"}]}],"synonyms":["darkest","blackest","pitch-black","inky"],"phonetic":"/ˈɪŋkiɪst/","extraExplanation":["“inkiest”是形容词“inky”的最高级（inky → inkier → inkiest）。英语里常用“inky/inkiest + 名词”来营造文学化的画面感，比如“inky darkness / inkiest night”。","“inky”本义与“ink（墨水）”相关，所以它的黑往往带有“浓、深、像墨水一样铺开”的感觉；比起单纯的“black”，更强调质感与氛围。"]}
{"word":"inkindle","summary":{"en":"Inkindle means to ignite something or to arouse strong feelings or interest, especially in formal or literary style.","zh":"Inkindle 意为“点燃；（多用于正式/文学语境）激起、唤起强烈情感或兴趣”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to set on fire; to ignite or kindle","zh":"点燃；引燃"},"examples":[{"en":"A single spark can inkindle dry leaves in seconds.","zh":"一个火星就能在几秒内点燃干燥的树叶。"},{"en":"The campfire was inkindled at dusk to keep everyone warm.","zh":"黄昏时人们点起篝火来取暖。"}]},{"partOfSpeech":"vt.","definition":{"en":"to arouse or intensify a feeling, interest, or desire (often used in formal or literary writing)","zh":"（多用于正式/文学语境）激起；唤起并增强（情感、兴趣或欲望）"},"examples":[{"en":"Her speech inkindled hope in the audience.","zh":"她的演讲在听众心中激起了希望。"},{"en":"Old photos can inkindle forgotten memories.","zh":"旧照片能唤起被遗忘的回忆。"},{"en":"The story inkindled his desire to travel.","zh":"这个故事激起了他旅行的渴望。"}]}],"synonyms":["ignite","kindle","spark","set alight","arouse","stir","awaken","enkindle"],"phonetic":"/ɪnˈkɪndəl/","extraExplanation":["“inkindle”由前缀 in-（使……进入某种状态）+ kindle（点燃）构成，语气比“kindle”更书面、更强调“点燃/唤起”的过程。","在现代日常英语里它不算常用，更常见的替代说法是“ignite”“kindle”“spark”“stir up”。在写作中用它会带一点诗意或古典感。"]}
{"word":"inkiness","summary":{"en":"Inkiness means the quality of being inky: very dark like ink, or stained with ink.","zh":"Inkiness 指“墨黑/像墨一样”的特性，也可指“带墨迹、被墨水弄脏”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being inky—dark like ink, or stained/marked with ink.","zh":"“墨色/像墨一样”的特性；也可指“被墨水弄脏、带墨迹”的状态。"},"examples":[{"en":"The inkiness of the sky made the streetlights look brighter.","zh":"天空的墨黑让路灯显得更亮。"},{"en":"Be careful with that pen—the inkiness on your fingers will stain your shirt.","zh":"小心那支笔——手指上的墨迹会把衬衫弄脏。"}]}],"synonyms":["darkness","blackness","inkiness (staining sense: ink stains)","murkiness"],"phonetic":"/ˈɪŋkinəs/","extraExplanation":["“inkiness”是由形容词“inky（墨黑的；沾满墨水的）”加名词后缀“-ness”构成，用来把“性质/状态”名词化。常见于描写性的写作（如文学或评论）来强调颜色的深、暗，或强调墨迹带来的脏污感。","语感上，“inkiness”比直接说“darkness”更有画面感：它不仅表示黑，还暗示“像墨一样”的质地或染色效果。"]}
{"word":"inkinesses","summary":{"en":"“Inkinesses” means multiple instances or kinds of deep, ink-like darkness (plural of inkiness).","zh":"“Inkinesses”指多处或多种“墨一般的浓黑/漆黑感”，是 inkiness 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “inkiness”: the quality of being very dark like ink; or several instances/areas of deep, inky darkness (often in writing, stains, shadows, or water).","zh":"“inkiness”的复数：像墨水一样很黑的特质；或多处/多次呈现出的浓黑、墨黑感（常指文字、污渍、阴影或水面等）。"},"examples":[{"en":"The photo captured the sea’s inkinesses—dark patches where the clouds blocked the moon.","zh":"这张照片捕捉到大海的多处墨黑——乌云遮住月光时形成的暗色斑块。"},{"en":"Different pens produce different inkinesses on cheap paper.","zh":"不同的笔在便宜纸上会呈现出不同的墨色浓黑程度。"}]}],"synonyms":["darkness","blackness","ink-blackness","gloom"],"phonetic":"/ˈɪŋkinəsɪz/","extraExplanation":["“-ness”通常把形容词变成名词（如 inky → inkiness），表示“……的性质/状态”。这类名词多为不可数，但在强调“多种表现/多处区域/多次情况”时，也会用复数（inkinesses）。","“inky”常用于描写文学性的“墨黑/漆黑”（如 inky night, inky water）。因此 inkinesses 在描写景物或视觉效果的语境里更常见，而在日常口语里相对少见。"]}
{"word":"inking","summary":{"en":"Inking means applying ink (especially in printing, art, or tattooing) or the act of writing/drawing with ink.","zh":"Inking 指上墨/涂墨的过程（常见于印刷、绘画、纹身），也可指用墨水书写或绘画的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of applying ink, especially in printing, drawing, or tattooing","zh":"上墨；涂墨的过程（尤指印刷、绘画或纹身中的上色/上墨）"},"examples":[{"en":"Proper inking is important for clear, sharp prints.","zh":"正确的上墨对获得清晰锐利的印刷效果很重要。"},{"en":"The artist finished the sketch and then moved on to inking.","zh":"画家完成草图后，开始进行描线/上墨。"},{"en":"After the stencil, the tattoo inking began.","zh":"转印完成后，纹身的上墨（刺墨）步骤开始了。"}]},{"partOfSpeech":"v.","definition":{"en":"using ink to write, mark, or draw (present participle of “ink”)","zh":"用墨水书写、标记或绘画（“ink”的现在分词）"},"examples":[{"en":"She is inking the outlines before adding color.","zh":"她正在先用墨线描出轮廓，再上颜色。"},{"en":"He sat at the table, inking notes in the margin.","zh":"他坐在桌旁，在页边用墨水写下注释。"}]}],"synonyms":["inking process","applying ink","insertion (tattoo context)","inking (art)","inking in"],"phonetic":"/ˈɪŋkɪŋ/","extraExplanation":["“inking”常见于艺术与设计语境，尤其是漫画/插画流程：penciling（铅笔起稿）→ inking（勾线/上墨）→ coloring（上色）。","作名词时，inking指“上墨这道工序”；作动词时是ink的现在分词，表示“正在用墨水写/画/标记”。","在纹身语境里，inking可泛指“刺墨/上色”的过程，但正式表达也常说tattooing或tattoo work。"]}
{"word":"inkings","summary":{"en":"“Inkings” means instances of applying ink or the ink marks/drawings produced.","zh":"“Inkings”指上墨的行为/次数，或上墨产生的墨迹与线条（“inking”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of applying ink; instances of inking (often in art, comics, printing, or stamp-making)","zh":"上墨；涂墨的过程；上墨的行为/次数（常用于绘画、漫画、印刷或盖章等语境）"},"examples":[{"en":"The illustrator did several inkings before choosing the final look.","zh":"这位插画师上墨了好几版，才选定最终的效果。"},{"en":"Early inkings can look rough, but they help define the shapes.","zh":"早期的上墨可能比较粗糙，但有助于把形体定清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"drawings or marks made with ink; inked lines or areas","zh":"墨迹；用墨画出的线条/笔触；上墨后的图形"},"examples":[{"en":"Her notebook is full of quick inkings and small sketches.","zh":"她的笔记本里满是随手的墨笔涂写和小速写。"},{"en":"The page showed dark inkings along the border.","zh":"那页纸的边缘有一圈较深的墨迹。"}]}],"synonyms":["inking","ink work","ink marks","ink lines"],"phonetic":"/ˈɪŋkɪŋz/","extraExplanation":["“inkings”是“inking”的复数形式。在漫画/插画工作流程里，常见顺序是：pencils（铅笔稿）→ inks/inking（描线与上墨）→ colors（上色）。在印刷语境中，“inking”也可指给印版/滚筒上墨的步骤。"]}
{"word":"inkish","summary":{"en":"“Inkish” means slightly inky—somewhat dark or blackish, like ink.","zh":"“inkish”指“略带墨色的”，有点暗黑、像墨水的颜色或质感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat like ink in color or appearance; slightly blackish or dark, as if stained with ink.","zh":"带点墨水般的颜色或样子；略呈黑色/深色，像被墨水染过一样。"},"examples":[{"en":"The clouds turned inkish before the storm arrived.","zh":"暴风雨来临前，云层变得有点墨黑。"},{"en":"Under the dim lamp, the water looked inkish and deep.","zh":"在昏暗的灯光下，水面看起来发暗如墨，深不见底。"}]}],"synonyms":["inky","blackish","dark","sooty","dusky"],"phonetic":"/ˈɪŋkɪʃ/","extraExplanation":["“inkish”不是非常常见的日常词，更常见的表达有“inky”“inky-black”“blackish”。“-ish”这个后缀表示“有点儿、稍微”，所以“inkish”强调“像墨一样，但不是完全的墨黑”。在文学描写里，它常用来营造阴沉、神秘或压抑的氛围。"]}
{"word":"inkjet","summary":{"en":"Inkjet refers to a type of printer (or the printing method) that sprays tiny drops of ink to make text or images.","zh":"Inkjet 指一种通过喷出微小墨滴来打印文字或图像的打印方式，也可指喷墨打印机。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a printer) using tiny drops of ink sprayed through small nozzles to print text or images, often in color.","zh":"（指打印机）使用喷嘴喷出极细小的墨滴来打印文字或图像，常用于彩色打印。"},"examples":[{"en":"I bought an inkjet printer for home because it’s good for printing photos.","zh":"我买了一台家用喷墨打印机，因为它很适合打印照片。"},{"en":"This inkjet model is cheaper, but the ink cartridges can be expensive.","zh":"这款喷墨机更便宜，但墨盒可能比较贵。"}]},{"partOfSpeech":"n.","definition":{"en":"An inkjet printer.","zh":"喷墨打印机。"},"examples":[{"en":"The office inkjet is out of ink again.","zh":"办公室那台喷墨打印机又没墨了。"},{"en":"Can you send the file to the inkjet in room 203?","zh":"你能把文件发到203室的喷墨打印机吗？"}]}],"synonyms":["inkjet printer"],"phonetic":"/ˈɪŋkˌdʒɛt/","extraExplanation":["“inkjet”常与“laser（激光）”对比：喷墨通常更适合照片与彩色输出、机器价格较低；激光打印速度快、文字锐利、单页成本常更低。","常见搭配：inkjet printer（喷墨打印机）, inkjet cartridge（喷墨墨盒）, inkjet paper/photo paper（喷墨纸/相纸）。"]}
{"word":"inkle","summary":{"en":"Inkle usually means a narrow woven tape (or the craft of weaving it on an inkle loom).","zh":"Inkle 通常指窄幅机织带，也可指用织带织机编织这种织带的手艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A narrow woven ribbon or tape, often used for trimming, tying, or crafts.","zh":"（用于装饰、绑扎或手工的）窄幅机织带/织带。"},"examples":[{"en":"She finished the gift with a strip of blue inkle.","zh":"她用一条蓝色织带把礼物装饰好了。"},{"en":"Inkle tape is often used for bag straps and decorative edges.","zh":"织带常用于包带和装饰性包边。"}]},{"partOfSpeech":"v.","definition":{"en":"To weave using a simple narrow-band loom (an inkle loom).","zh":"用窄幅织带机（织带织机）织窄带。"},"examples":[{"en":"He learned to inkle colorful bands on a small loom.","zh":"他学会在小织机上织出彩色织带。"},{"en":"She inkles a few centimeters each evening as practice.","zh":"她每天晚上练习织几厘米的织带。"}]}],"synonyms":["tape","ribbon","trim","webbing (narrow)"],"phonetic":"/ˈɪŋkəl/","extraExplanation":["“Inkle”常出现在手工纺织/编织语境里，尤其是“inkle weaving（织带编织）”和“inkle loom（织带织机）”。它不是日常高频词，但在工艺、服装辅料、历史服饰复原等领域很常见。"]}
{"word":"inkles","summary":{"en":"“Inckles” usually means narrow woven tapes (plural of inkle); rarely, it can be a verb meaning “hints.”","zh":"“inkles”通常指狭窄的织带（inkle 的复数）；极少情况下作动词，表示“暗示”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Narrow woven tape or braid (often used for straps, trims, and decorative edging); plural form of “inkle.”","zh":"狭窄的织带/编带（常用于背带、包带、衣物装饰边等）；“inkle”的复数。"},"examples":[{"en":"She bought a few inkles to make bag straps.","zh":"她买了几条织带来做包带。"},{"en":"The costume was finished with colorful inkles along the hem.","zh":"这套服装用彩色织带装饰了下摆。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/old-fashioned) Third-person singular form of “inkle”: to hint or suggest something indirectly.","zh":"（罕见/较古旧）“inkle”的第三人称单数：含蓄地暗示、间接透露。"},"examples":[{"en":"He inkles that something is wrong but won’t say it directly.","zh":"他暗示好像出了问题，但不愿直说。"}]}],"synonyms":["woven tape","braid","trim","ribbon","hint","imply"],"phonetic":"/ˈɪŋkəlz/","extraExplanation":["“Inkle”常与织造有关：传统上用“inkle loom（织带织机）”来织出结实、窄幅的带子，可用于背带、腰带、书签、服饰滚边等手工项目。","作为动词“inkle（暗示）”在现代英语中很少用，更常见的表达是 hint, imply, suggest。"]}
{"word":"inkless","summary":{"en":"“Inkless” means having no ink or not using ink, especially in modern printing or pen technology.","zh":"“inkless”表示“无墨的/不使用墨水的”，常用于现代打印或书写技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without ink; not containing or using ink.","zh":"无墨的；不含墨水的；不使用墨水的。"},"examples":[{"en":"Inkless printers can produce images without liquid ink.","zh":"无墨打印机可以在不使用液体墨水的情况下打印图像。"},{"en":"She preferred an inkless pen for quick notes on her tablet.","zh":"她更喜欢用无墨笔在平板上快速记笔记。"}]}],"synonyms":["no-ink","without ink","ink-free"],"phonetic":"/ˈɪŋkləs/","extraExplanation":["“Inkless”常见于科技语境，尤其是“inkless printer（无墨打印机）”。它通常指热敏打印（thermal printing，靠加热让特殊纸显色）或ZINK等无墨成像技术（通过热激活纸张/相纸中的染料晶体显色）。","日常写作里“inkless”不如“without ink / no-ink”常见；但在产品说明、广告文案中很常用，用来强调“省耗材、少维护”。"]}
{"word":"inklike","summary":{"en":"“Inklike” means “like ink,” especially very dark or ink-looking.","zh":"“inklike”意为“像墨水的”，常指墨黑、深色或呈现墨水般外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling ink in color, texture, or appearance (often very dark, bluish-black, or fluid-looking).","zh":"像墨水的；具有墨水般的颜色、质地或外观（常指很深的蓝黑色或带流动感的样子）。"},"examples":[{"en":"The sky turned inklike before the storm, almost black at the horizon.","zh":"暴风雨来临前，天空变得像墨水一样深，地平线处几乎发黑。"},{"en":"She painted an inklike wash across the paper to create a night effect.","zh":"她在纸上刷了一层墨水般的淡涂，营造出夜晚的效果。"},{"en":"An inklike stain spread across his sleeve after the pen leaked.","zh":"钢笔漏墨后，墨水般的污渍在他的袖子上扩散开来。"}]}],"synonyms":["inky","ink-black","pitch-black (for color)","dark","in-darkened tones"],"phonetic":"/ˈɪŋkˌlaɪk/","extraExplanation":["“inklike”比较少见，写作中常用来制造画面感或文学气氛，尤其形容夜色、海水、阴影、污渍等。日常口语里更常见的替代词是“inky”（墨黑的）或“ink-black”（像墨一样黑）。"]}
{"word":"inkling","summary":{"en":"Inkling means a slight, vague idea, feeling, or hint—often used for a small suspicion or partial understanding.","zh":"Inkling 指对某事的些微、模糊的想法或预感，也可指一点点线索或浅显了解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A slight idea, feeling, or suspicion about something; a small hint.","zh":"对某事的些微想法、感觉或怀疑；一点点线索。"},"examples":[{"en":"I had an inkling that something was wrong.","zh":"我隐约觉得哪里不对。"},{"en":"She didn’t have the slightest inkling of what was happening.","zh":"她对正在发生的事一点都不知情。"},{"en":"Do you have any inkling who took my keys?","zh":"你有没有一点线索是谁拿了我的钥匙？"}]},{"partOfSpeech":"n.","definition":{"en":"A vague or slight understanding of something.","zh":"对某事模糊、浅显的了解。"},"examples":[{"en":"I have an inkling of how the app works, but I’m not confident yet.","zh":"我大概知道这个应用怎么用，但还不太有把握。"},{"en":"He has an inkling of French from living in Canada.","zh":"因为住过加拿大，他对法语略懂一点。"}]}],"synonyms":["hint","hunch","suspicion","notion","glimmer"],"phonetic":"/ˈɪŋklɪŋ/","extraExplanation":["“inkling”常和不定冠词连用：an inkling（有一点点感觉/线索）。也常见搭配：the slightest/faintest inkling（丝毫/极其微弱的察觉）。","语气上，“inkling”比“idea”更弱、更不确定，接近“隐约感觉到”。常用于表达自己并没有确凿证据，只是有一点预感或线索。"]}
{"word":"inklings","summary":{"en":"“Inklings” means small, not-yet-clear ideas or a slight suspicion.","zh":"“inklings”指不太清晰的想法或隐约的怀疑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, vague ideas or feelings that you may not fully understand yet; a slight suspicion.","zh":"（模糊的）想法；隐约的感觉；一点点怀疑"},"examples":[{"en":"I had an inkling that something was wrong, but I couldn’t explain why.","zh":"我隐约觉得哪里不对，但又说不出原因。"},{"en":"She had an inkling he was planning a surprise party.","zh":"她隐约猜到他在筹备惊喜派对。"}]}],"synonyms":["hunch","suspicion","hint","feeling","notion"],"phonetic":"/ˈɪŋklɪŋz/","extraExplanation":["“inkling”常和动词搭配：have/get an inkling (that...)（隐约觉得/隐约猜到……）。语气通常表示“并不确定、只是朦胧的直觉”。","词源上与“ink”（墨水）无关；更接近“轻微暗示/迹象”的意思。","文化小知识：The Inklings（“墨友社/因克林小组”）是20世纪英国作家社团（如C.S. Lewis、J.R.R. Tolkien）常用的名称。这里是专有名词，含义与日常的“inkling（隐约的想法）”不同。"]}
{"word":"inkmaker","summary":{"en":"“Inkmaker” means a person or company that makes ink; it’s an uncommon word and often written as “ink maker” or “ink manufacturer.”","zh":"“inkmaker”指制墨者或制墨公司；该词不算常见，常写作“ink maker”或用“ink manufacturer”表达更自然。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that makes ink, especially for writing, printing, or calligraphy.","zh":"制墨者；制墨公司（尤指制造书写、印刷或书法用墨水/墨的个人或企业）。"},"examples":[{"en":"The printer buys pigment inks directly from a local inkmaker.","zh":"这家印刷厂直接从本地制墨商那里购买颜料墨水。"},{"en":"She visited an old inkmaker to learn how traditional inks are made.","zh":"她去拜访了一位老制墨匠，学习传统墨是如何制作的。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) something used to make ink, such as a tool, device, or ingredient source.","zh":"（罕见）制墨器具或制墨来源（如工具、装置或原料来源）。"},"examples":[{"en":"In early notes, he called the oak-gall mixture an “inkmaker.”","zh":"在早期笔记里，他把橡树五倍子混合物称作“制墨材料”。"}]}],"synonyms":["ink manufacturer","ink producer","ink maker","ink supplier"],"phonetic":"/ˈɪŋkˌmeɪkər/","extraExplanation":["“inkmaker”不是特别常见的标准词，更常见的说法是“ink manufacturer”（墨水制造商）或“ink maker”（分开写）。在品牌名、用户名、工作头衔或复合名词中会更常见。","复合词构成：ink（墨水/墨）+ maker（制造者）。在写作中如果指职业或公司，用法最自然。"]}
{"word":"inkmaking","summary":{"en":"Inkmaking means the craft or process of making ink.","zh":"Inkmaking 指制作墨水/制墨的工艺或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or craft of making ink (for writing, drawing, or printing)","zh":"制墨；制作墨水的过程或工艺（用于书写、绘画或印刷）"},"examples":[{"en":"Inkmaking was once an important skill in many print shops.","zh":"在过去，制墨曾是许多印刷作坊里一项重要技能。"},{"en":"The class introduced traditional inkmaking using soot and natural binders.","zh":"这门课介绍了用烟灰和天然黏合剂进行的传统制墨方法。"},{"en":"She researched inkmaking techniques for her calligraphy project.","zh":"她为书法项目研究了制墨技巧。"}]}],"synonyms":["ink making","ink production","ink manufacture","ink preparation"],"phonetic":"/ˈɪŋkˌmeɪkɪŋ/","extraExplanation":["“inkmaking”是由“ink + making”构成的复合词，但在现代英语里更常写作分开的“ink making”（两个词），尤其在学术或说明文中更自然。作为修饰语时，也常见“ink-making”（加连字符）用于名词前，如“ink-making process（制墨过程）”。","在艺术与传统工艺语境（如书法、版画、手工颜料）中更容易看到这个词；日常生活里人们更常说“make ink”或“ink production”。"]}
{"word":"inkman","summary":{"en":"Inkman usually means a person who makes or supplies ink; more rarely, an old-fashioned term for a clerk/writer.","zh":"Inkman 通常指制墨/供墨/卖墨的人；更少见时可指古旧用法的文书或写字员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes, sells, or supplies ink (especially in older usage, e.g., for printing or writing).","zh":"（较旧用法）制墨、卖墨或供应墨水的人（尤指印刷或书写领域）。"},"examples":[{"en":"In the old print shop, the inkman prepared fresh ink for the press.","zh":"在那家老印刷铺里，供墨工为印刷机调配新墨。"},{"en":"The stationer and the inkman sold writing supplies to travelers.","zh":"文具商和卖墨人向旅人出售书写用品。"}]},{"partOfSpeech":"n.","definition":{"en":"A clerk or writer; someone whose work is mainly writing (rare/archaic).","zh":"（罕见/古旧）文书、书记；以写作为主要工作的人。"},"examples":[{"en":"He began his career as an inkman, copying letters by hand.","zh":"他以文书起步，靠手抄信件为生。"}]}],"synonyms":["ink seller","stationer","scribe","clerk"],"phonetic":"/ˈɪŋkmən/","extraExplanation":["“inkman”在现代英语里很少见，多见于历史语境（如旧式印刷作坊分工）或作为姓氏使用。如果你是在某本书、剧本或游戏里看到它，可能是作者用来营造复古/行业氛围的称呼。"]}
{"word":"inknit","summary":{"en":"“Inknit” is an archaic verb meaning to knit or bind something tightly into something else, or (figuratively) to connect closely.","zh":"“inknit”是一个古/罕用动词，指把……织入并紧密结合，也可比喻为使紧密相连。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) To knit in; to weave or join something tightly into something else.","zh":"（古/罕用）把……织入；把某物紧密地编入或融入另一物中。"},"examples":[{"en":"The artisan inknit gold thread into the cloth for decoration.","zh":"工匠把金线织入布料中作装饰。"},{"en":"Over time, small traditions became inknit into the family’s daily life.","zh":"随着时间推移，一些小传统被融入了这家人的日常生活。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative, archaic) To bind closely; to make people or ideas strongly connected.","zh":"（比喻，古/罕用）使紧密结合；使人与想法强烈连结在一起。"},"examples":[{"en":"Shared hardship inknit the team into a united group.","zh":"共同的艰难把团队紧紧凝聚成一个整体。"},{"en":"The novel shows how memory can inknit the past and present.","zh":"这部小说展示了记忆如何把过去与现在紧密连结。"}]}],"synonyms":["knit into","interweave","entwine","bind","link"],"phonetic":"/ˌɪnˈnɪt/","extraExplanation":["“inknit”在现代英语里非常少见，更多会看到更常用的表达：knit into（织入/融入）、interweave（交织）、bind together（结合）。","它也常被认为与较古老或文学化的形式“enknit / en-knit”（使缠结、使紧密结合）有关；在阅读古文或诗歌时偶尔会遇到。"]}
{"word":"inknot","summary":{"en":"“Inknot” isn’t a standard word; it usually refers to the idiom “in a knot” = very nervous or worried.","zh":"“inknot” 不是标准单词；通常指习语 “in a knot”，表示非常紧张或担心。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Nonstandard) Likely a misspelling of the idiom “in a knot,” meaning very nervous, upset, or worried.","zh":"（非标准用法）很可能是习语 “in a knot” 的拼写错误，意思是非常紧张、烦恼或担心。"},"examples":[{"en":"Before the interview, my stomach was in a knot.","zh":"面试前我紧张得胃都揪在一起。"},{"en":"She was in a knot waiting for the test results.","zh":"她等检查结果时焦虑得不行。"}]}],"synonyms":["anxious","nervous","worried","tense"],"phonetic":"/ɪn ə nɑt/","extraExplanation":["“inknot” 不是常见英语单词；更自然的写法通常是分开写成 “in a knot”。","“knot”（结）常用来比喻“拧成一团、打结”的感觉，所以 “in a knot” 形容情绪或身体感觉像打结一样不舒服。","相关表达：be all tied up（很紧张/忙得不可开交）、have butterflies in one’s stomach（心里七上八下）。"]}
{"word":"inkos","summary":{"en":"“inkos” isn’t a common English word; it likely needs context (misspelling, name, or acronym).","zh":"“inkos”不是常见英语单词；多半需要语境（可能是拼写错误、名字或缩写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a username/brand name, or an acronym that needs context.","zh":"不是标准英语单词；更可能是拼写错误、用户名/品牌名，或需要上下文才能确定含义的缩写。"},"examples":[{"en":"I can’t find “inkos” in an English dictionary—did you mean “ink” or another word?","zh":"我在英语词典里找不到“inkos”——你是不是想写“ink”或别的词？"},{"en":"If “inkos” is a brand or a name, please share a sentence where you saw it.","zh":"如果“inkos”是品牌或名字，请给我一句你看到它的原句。"}]}],"phonetic":"ˈɪŋkoʊz","extraExplanation":["“inkos”很像拼写误差（多打了字母或少打了字母）。如果你告诉我它出现的语境（例如一整句话、网页/游戏/软件里看到的），我可以更准确判断是不是某个缩写、专有名词，或你本来想查的是“ink / inking / inkling / income”等词。","如果你想查的是常见词“ink”（墨水），也可以直接回复我：你是想学“ink”这个词吗？我可以给你标准词条、用法和例句。"]}
{"word":"inkosi","summary":{"en":"Inkosi means a chief/king or a respectful title (“sir/lord”) in Zulu/Xhosa contexts.","zh":"Inkosi 指“酋长/国王”，也可作尊称（类似“先生/大人/主”），常见于祖鲁语/科萨语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Zulu/Xhosa and some other Southern African languages) a chief, leader, or king; also used as a respectful title meaning “sir” or “lord.”","zh":"（祖鲁语/科萨语等南部非洲语言）酋长、领袖或国王；也可作尊称，类似“先生/大人/主”。"},"examples":[{"en":"The villagers greeted the inkosi with respect at the community meeting.","zh":"村民在社区会议上恭敬地迎接这位酋长（inkosi）。"},{"en":"In some contexts, people may say “Inkosi” as a title of honor.","zh":"在某些语境中，人们会用“Inkosi”作为尊称。"}]}],"synonyms":["chief","leader","king","lord (context-dependent)"],"phonetic":"/ɪnˈkoʊsi/","extraExplanation":["“Inkosi”来自祖鲁语/科萨语等班图语系语言，常用于传统社会结构中指部族首领或统治者。在现代语境里也可能作为礼貌称呼（类似对有地位者的敬称），具体含义要看说话场合与当地文化。","在南非语境中，你可能会看到类似用法出现在歌曲、仪式、或对传统领袖（traditional leaders）的报道中。使用时建议尊重语境与对方身份。"]}
{"word":"inkpad","summary":{"en":"An inkpad is a pad of ink used to ink a stamp for stamping.","zh":"inkpad 指用于给图章上墨、方便盖章的印台/印泥垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pad (usually felt or foam) soaked with ink, used to ink a rubber stamp before stamping paper","zh":"（通常为毡或海绵的）印台；印泥垫，用来给橡皮图章上墨后盖章"},"examples":[{"en":"She pressed the stamp onto the inkpad and stamped the envelope.","zh":"她把图章按在印台上，然后在信封上盖了章。"},{"en":"Use a black inkpad for the address stamp.","zh":"地址章请用黑色印台。"},{"en":"The inkpad is drying out, so we need to add a few drops of ink.","zh":"印台快干了，需要滴几滴印油。"}]}],"synonyms":["ink pad","stamp pad"],"phonetic":"/ˈɪŋkˌpæd/","extraExplanation":["在英语里也常说 ink pad（分开写），意思相同。办公用品场景中还会见到 stamp pad（更通用的说法），以及 self-inking stamp（自带印台、按下就能盖章的图章）。"]}
{"word":"inkpot","summary":{"en":"An inkpot is a container for ink; in literary criticism it can also mean overly learned, pedantic vocabulary or style.","zh":"inkpot 指“墨水壶/墨水瓶”；在文学评论中也可指“过分卖弄学问的用词或文风”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small container (often with a lid) used to hold ink for dipping a pen.","zh":"墨水壶；墨水瓶（常带盖，用来盛墨水，便于蘸笔书写）。"},"examples":[{"en":"She opened the inkpot and dipped the fountain pen nib into the ink.","zh":"她打开墨水壶，把钢笔尖蘸了蘸墨水。"},{"en":"The desk had an old inkpot beside a stack of letters.","zh":"书桌上有一个旧墨水壶，旁边是一摞信件。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary or critical) Overly bookish or pedantic writing or vocabulary; words that sound learned but feel unnatural.","zh":"（文学/评论用法）过分卖弄学问的文风或词汇；听起来“很高级”但不自然的用词（“墨水味”很重）。"},"examples":[{"en":"The editor cut some inkpot vocabulary to make the article clearer.","zh":"编辑删掉了一些过于“墨水味”的词，让文章更清晰。"},{"en":"He avoids inkpot language and writes in plain English.","zh":"他避免使用卖弄学问的语言，而用朴素的英语写作。"}]}],"synonyms":["inkwell","ink bottle","pedantic language","pompous diction","inkpot words"],"phonetic":"/ˈɪŋkˌpɑt/","extraExplanation":["“inkpot”本义是盛墨水的容器；引申义常出现在文学评论里，尤其与“inkpot words（墨水瓶词）”搭配，指文艺复兴时期一些作家大量借用拉丁语/希腊语词汇，导致英语表达显得生硬、炫技。这个用法带有批评意味，强调“难懂、不自然”。"]}
{"word":"inkpots","summary":{"en":"“Inkpots” means small containers for ink, used especially with dip pens; it’s the plural of “inkpot.”","zh":"“inkpots”指盛放墨水的小容器（常与蘸水笔搭配使用），是“inkpot”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Containers (small pots or bottles) that hold ink for writing or drawing, especially with a dip pen; plural of “inkpot.”","zh":"墨水壶；盛放墨水的小容器（尤指供蘸水笔书写/绘画使用）；为 inkpot 的复数。"},"examples":[{"en":"The teacher kept several inkpots on the desk for students to share.","zh":"老师在桌上放了好几只墨水壶，供学生共用。"},{"en":"Old letters were often written with a dip pen and an inkpot.","zh":"旧时的信件常用蘸水笔配合墨水壶书写。"}]}],"synonyms":["ink bottles","ink containers"],"phonetic":"/ˈɪŋkˌpɑts/","extraExplanation":["“inkpot”在现代日常生活中不太常见，因为多数人使用圆珠笔、中性笔或打印设备。它更常出现在历史场景、复古文具、书法与钢笔/蘸水笔爱好者的语境中。","在文学或描写场景时，inkpot(s)常用来营造“旧式书写”“书房/学校课堂”“手写文稿”的氛围。"]}
{"word":"inkra","summary":{"en":"“inkra” isn’t a common English dictionary word; it’s likely a name, acronym, or misspelling.","zh":"“inkra”不是常见英语词典词汇；更可能是专有名词、缩写或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a proper name (e.g., a company, product, username) or a misspelling of another word.","zh":"不是标准英语词汇；更可能是专有名词（如公司/产品/用户名）或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “inkra” in a standard English dictionary—can you share a sentence where you saw it?","zh":"我在标准英语词典里查不到“inkra”——你能提供一个看到它的句子吗？"},{"en":"Inkra is the name of a small business in my area.","zh":"Inkra 是我所在地区一家小公司的名字。"}]}],"phonetic":"/ˈɪŋkrə/","extraExplanation":["“inkra”在常见英语词典中通常查不到。如果你是在某个句子、品牌、游戏、小说或社交平台上看到的，它很可能是：① 专有名词（人名/地名/品牌名）；② 缩写或首字母词；③ 拼写接近的词（例如 ink、intra-、Inca 等）。\n\n你可以告诉我：你在哪里看到它、想表达什么含义、或给我一个完整句子，我就能更准确地解释。"]}
{"word":"inkroot","summary":{"en":"Inkroot is a traditional name for a plant (often pokeweed) whose berries can be used to make a dark ink or dye—and it can also mean that ink itself.","zh":"Inkroot 指一种传统上可用浆果制墨/染色的植物（常指美洲商陆），也可指由其制成的深色墨水或染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant (especially pokeweed) whose berries were traditionally used to make a dark purple ink or dye.","zh":"（尤指）美洲商陆等植物；其浆果传统上可制成深紫色墨水或染料。"},"examples":[{"en":"In early America, some people made homemade ink from inkroot berries.","zh":"在早期的美国，有些人用“inkroot”的浆果自制墨水。"},{"en":"The fabric was dyed a purplish color using inkroot juice.","zh":"这块布用 inkroot 的汁液染成了偏紫的颜色。"}]},{"partOfSpeech":"n.","definition":{"en":"The dark purple ink or dye made from the berries of this plant.","zh":"由这种植物的浆果制成的深紫色墨水或染料。"},"examples":[{"en":"The letter was written in inkroot, which faded to brown over time.","zh":"这封信是用 inkroot 写的，时间久了颜色褪成了棕色。"},{"en":"Artists sometimes experiment with inkroot as a natural pigment.","zh":"有些艺术家会用 inkroot 作为天然颜料来做实验。"}]}],"synonyms":["pokeweed","ink plant","natural dye"],"phonetic":"/ˈɪŋkˌruːt/","extraExplanation":["“Inkroot”是比较少见、带有历史/民俗色彩的词，常和北美植物“pokeweed（美洲商陆）”相关。早期有人把其浆果汁当作墨水或染料，但颜色可能会随时间褪色、变棕。","注意：pokeweed（美洲商陆）在现实中有毒性，尤其是根和叶；不要因为看到“inkroot”就自行采食或自制墨水。"]}
{"word":"inks","summary":{"en":"“Inks” most commonly means more than one kind of ink; it can also mean “signs a contract” or “applies ink.”","zh":"“inks”通常指“多种墨水/油墨”；也可作动词，表示“签合同”或“上墨/用墨水标记”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “ink”: colored liquid used for writing, printing, or drawing.","zh":"“ink”的复数：用于书写、印刷或绘画的有色液体（墨水）。"},"examples":[{"en":"The artist uses different inks for calligraphy.","zh":"这位艺术家用不同的墨水来写书法。"},{"en":"Newspaper inks can stain your fingers.","zh":"报纸油墨可能会把手指染脏。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “ink”: to sign (a contract) or to cover/mark something with ink.","zh":"“ink”的第三人称单数：给（合同）签字；或用墨水涂写/标记某物。"},"examples":[{"en":"She inks the agreement after her lawyer reviews it.","zh":"律师审阅后，她在协议上签字。"},{"en":"The printer inks the plates before each run.","zh":"每次印刷前，印刷机会给印版上墨。"}]}],"synonyms":["writing fluid","printer's ink","signs (a contract)","finalizes (a deal)"],"phonetic":"/ɪŋk/","extraExplanation":["在新闻和商业语境里，常见搭配是 **ink a deal / ink a contract**，意思是“正式签约/敲定交易”，强调从口头谈妥到写下来并签字这一刻。"]}
{"word":"inkshed","summary":{"en":"Inkshed means quick, informal writing (often unpolished), and it can also refer to a specific writing-sharing practice or the Canadian journal/community called Inkshed.","zh":"Inkshed 指快速、非正式且常未精炼的文字；也可指一种写作分享讨论的教学实践，或加拿大的期刊/社群《Inkshed》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Informal writing produced quickly or in large amounts, often seen as unpolished “ink on paper.”","zh":"（非正式）随手写下的大量文字；（常含）不够精炼的“纸上墨迹”。"},"examples":[{"en":"The editor asked the writer to cut the inkshed and keep only the strongest paragraphs.","zh":"编辑让作者删掉那些“堆砌的文字”，只保留最有力的段落。"},{"en":"His notebook was full of inkshed—ideas scribbled down before they were organized.","zh":"他的笔记本里满是随手写下的内容——先记下点子，再慢慢整理。"}]},{"partOfSpeech":"n.","definition":{"en":"A writing-and-discussion practice (and the name of a Canadian journal/community) focused on short, shared pieces of writing and reflection.","zh":"一种“写作—分享—讨论”的实践（也指加拿大的相关期刊/社群名称），强调短文写作与交流反思。"},"examples":[{"en":"Our seminar used an inkshed activity: five minutes of writing, then we exchanged papers to respond.","zh":"我们的研讨课做了一个 inkshed 活动：写五分钟，然后互换文章做回应。"},{"en":"She published a reflection in Inkshed, the journal connected to writing studies in Canada.","zh":"她在加拿大写作研究相关的期刊《Inkshed》上发表了一篇反思文章。"}]}],"synonyms":["scribbling","freewriting","draft","rough writing","wordiness"],"phonetic":"/ˈɪŋkˌʃɛd/","extraExplanation":["“inkshed”原本带一点贬义色彩，像是在说“只是把墨水洒在纸上”，暗示文字冗长、缺乏打磨。现代教学语境里也会中性使用，表示快速写作、自由写作，用来激发想法。","在写作教学中，inkshed 常见形式是限时写作（比如 3–10 分钟），然后把文字分享给同伴阅读、做简短回应；重点是生成想法与交流，而不追求立刻完美。"]}
{"word":"inkslinger","summary":{"en":"An informal term for a writer, often used humorously (sometimes slightly critical).","zh":"写作者的非正式说法，常带幽默语气（有时略带调侃）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A writer, especially one who writes professionally (e.g., a journalist, novelist, or copywriter).","zh":"（非正式）写作者；尤指职业写作的人（如记者、小说家、文案等）。"},"examples":[{"en":"As an experienced inkslinger, she can turn a rough idea into a clear article overnight.","zh":"作为一名经验丰富的写作者，她能在一夜之间把粗糙的想法写成清晰的文章。"},{"en":"The magazine hired a few new inkslingers to cover local news.","zh":"这家杂志雇了几位新记者来报道本地新闻。"}]},{"partOfSpeech":"n.","definition":{"en":"(often humorous or slightly critical) Someone who produces a lot of writing, sometimes seen as formulaic or done mainly for pay.","zh":"（常带幽默或略带贬义）大量产出文字的人；有时暗示写作套路化或主要是为赚钱而写。"},"examples":[{"en":"He’s a talented inkslinger, but some of his columns feel a bit rushed.","zh":"他很会写，但有些专栏文章让人觉得有点赶工。"},{"en":"In the office they joked that the marketing inkslingers could write a slogan for anything.","zh":"在办公室里大家开玩笑说市场部的文案能给任何东西写口号。"}]}],"synonyms":["writer","journalist","author","copywriter","scribbler","wordsmith"],"phonetic":"/ˈɪŋkˌslɪŋɚ/","extraExplanation":["“inkslinger”由“ink（墨水）+ slinger（投掷者/甩动者）”构成，形象地把写作比作“甩墨水”。因此它常用于口语或媒体语境，语气更随意。","它通常不算粗鲁，但可能带一点自嘲或调侃的味道：把写作当成一种“手艺活/苦差事”，尤其在新闻业、广告文案、专栏写作等高产环境里常见。","写正式场合（简历、学术写作）一般用 writer / journalist / author / copywriter 等更中性词；“inkslinger”更适合随笔、对话、标题或带幽默的自我介绍。"]}
{"word":"inkslinging","summary":{"en":"Inkslinging means doing writing work—especially journalism—often said in an informal, slightly humorous way.","zh":"inkslinging 指写作工作，尤指新闻写作；常用于非正式、略带幽默（有时自嘲/讽刺）的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) The act or work of writing, especially journalism or other professional writing.","zh":"（非正式）写作的工作或行为，尤指新闻写作或职业写作。"},"examples":[{"en":"She got tired of daily inkslinging and moved into editing.","zh":"她厌倦了每天的新闻写作，后来转做编辑。"},{"en":"Inkslinging paid the bills while he worked on his novel at night.","zh":"写稿养家糊口，而他晚上继续写小说。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Describing writing-related work, often with a slightly humorous or cynical tone.","zh":"（非正式）形容与写作相关的工作，常带一点幽默或略带挖苦的语气。"},"examples":[{"en":"He’s an inkslinging reporter who never misses a deadline.","zh":"他是个写稿的记者，从不误截稿。"},{"en":"After years in the inkslinging world, she knows how headlines get made.","zh":"在写稿圈子摸爬滚打多年后，她很清楚标题是怎么来的。"}]}],"synonyms":["writing","journalism","reporting","copywriting","scribbling (informal)"],"phonetic":"/ˈɪŋkˌslɪŋɪŋ/","extraExplanation":["“inkslinging”来自口语表达“ink-slinger”（写稿的人、记者），由 ink（墨水）+ sling（甩、抛）构成，带有“把墨水甩到纸上/把文字甩出去”的形象感，所以常见于自嘲或带点讽刺的语境。","用法提示：多用于媒体、写作行业的轻松语气；在正式写作中更常用 writing / journalism / reporting。"]}
{"word":"inkstain","summary":{"en":"An inkstain is a spot or mark made by ink.","zh":"inkstain 指墨水造成的污渍或斑点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mark or spot made by spilled or smeared ink, usually on paper, clothing, or skin.","zh":"墨水弄出的污渍或斑点（常见于纸张、衣物或皮肤上）。"},"examples":[{"en":"There’s an inkstain on the corner of the page.","zh":"这一页的角落上有一块墨渍。"},{"en":"He got an inkstain on his shirt while signing the form.","zh":"他签表时把衬衫弄上了墨渍。"},{"en":"Try blotting the inkstain with a paper towel—don’t rub it.","zh":"用纸巾轻轻按压墨渍试试——别用力擦。"}]}],"synonyms":["ink spot","ink blot","stain"],"phonetic":"/ˈɪŋkˌsteɪn/","extraExplanation":["“Inkstain”是由 ink（墨水）+ stain（污渍）构成的复合名词，常用于日常场景（写字、签名、用钢笔等）以及洗涤建议中。","在一些文学或比喻用法里，inkstain 有时象征“写作/记录留下的痕迹”或“无法轻易抹去的过往”，但最常见仍是字面意思。"]}
{"word":"inkstand","summary":{"en":"An inkstand is a desk container/stand for ink used with a dip pen, common in older writing settings.","zh":"inkstand 指放在桌上的墨水容器/墨水座，用于蘸水笔写字，常见于较早的书写场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small container or stand that holds ink (often with a built-in inkwell), used for writing with a dip pen; also called an inkwell set.","zh":"墨水台；墨水座（常带墨水瓶/墨水槽），用于蘸水笔书写；也可指一套墨水瓶座。"},"examples":[{"en":"She dipped the pen into the inkstand before signing the letter.","zh":"她把笔尖蘸了蘸墨水台里的墨水，然后在信上签名。"},{"en":"On the desk sat an old brass inkstand next to the candles.","zh":"桌上有一个旧的黄铜墨水台，旁边放着蜡烛。"}]}],"synonyms":["inkwell","inkpot"],"phonetic":"/ˈɪŋkˌstænd/","extraExplanation":["“inkstand”常见于较早的英语文本与历史场景，因为在钢笔、圆珠笔普及之前，人们多用蘸水笔写字，需要桌面上的墨水容器。","语体上带有一点“古典/书卷气”，在小说里常用来营造旧式书房、办公室或维多利亚时代的氛围。","相关词：inkwell（墨水瓶/墨水槽，通常强调容器本身），dip pen（蘸水笔），writing desk（写字台）。"]}
{"word":"inkstandish","summary":{"en":"“Inkstandish” is a rare, humorous adjective meaning “inkstand-like,” often suggesting an old-fashioned, desk-and-ink writing vibe.","zh":"“inkstandish”是个罕见、带幽默感的形容词，意为“像墨水台/墨水瓶的”，常用来营造或调侃一种复古的书桌写作气息。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, humorous) Resembling or characteristic of an inkstand (an inkwell/ink container), often suggesting something old-fashioned, desk-bound, or “writerly.”","zh":"（罕见，带幽默色彩）像墨水台/墨水瓶（盛墨容器）的；带有“老式书桌写字”气息的。"},"examples":[{"en":"The poem has an inkstandish charm—like something written by lamplight at a wooden desk.","zh":"这首诗有种“墨水台式”的迷人气息——像在木桌旁点着灯写出来的。"},{"en":"He used an inkstandish word that sounded politely old-fashioned.","zh":"他用了一个“墨水台式”的词，听起来很礼貌、很古雅。"}]}],"synonyms":["old-fashioned","writerly","bookish","antiquated"],"phonetic":"/ˈɪŋkˌstændɪʃ/","extraExplanation":["“inkstandish”并不是常见词，更像是把 inkstand（墨水台/墨水瓶）加上后缀 -ish（“有点像……的”）临时造出来的形容词，常用于调侃或营造复古写作氛围。","inkstand 指传统的盛墨容器；现代更常见的相关词是 inkwell。"]}
{"word":"inkstands","summary":{"en":"“Inkstands” are containers that hold ink for writing, especially with dip pens (plural of inkstand).","zh":"“Inkstands”指盛放墨水、供蘸水笔书写使用的墨水台/墨水座，是 inkstand 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A container (often with a small bottle or well) used to hold ink for writing with a dip pen; plural of “inkstand.”","zh":"（用于蘸水笔书写的）墨水台、墨水座；“inkstand”的复数。"},"examples":[{"en":"On the old desk, there were two inkstands beside a stack of letters.","zh":"在那张旧书桌上，两只墨水台放在一叠信件旁边。"},{"en":"Before fountain pens became common, many writers kept inkstands at home.","zh":"在钢笔普及之前，许多写作者家里都会备着墨水台。"}]}],"synonyms":["inkwells","ink bottles","ink containers"],"phonetic":"/ˈɪŋkˌstændz/","extraExplanation":["“Inkstand”偏英式、旧式用法，常见于描写19世纪到20世纪初的书房、办公室或学校场景；美式英语里也能用，但更常见的现代说法是“inkwell”（墨水瓶/墨水槽）或直接说“a bottle of ink”。","在文学或历史叙述中，inkstand 常带有“传统书写、文书工作、旧时代日常”的氛围，用来营造复古或正式的场景感。"]}
{"word":"inkster","summary":{"en":"“Inkster” usually means (old-fashioned/humorous) a person associated with ink, and it can also be a surname or place name.","zh":"“inkster”通常指（老派/幽默）与墨水相关的人，也可作姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes, sells, or uses ink a lot (especially a writer or printer); an old-fashioned or humorous word","zh":"制墨者、卖墨者，或经常用墨水的人（尤指作家或印刷工）；带有老派或幽默色彩的说法"},"examples":[{"en":"He’s an old inkster who still writes every letter by hand.","zh":"他是个老派“墨水匠”，现在还坚持手写每一封信。"},{"en":"Back then, every inkster in town knew the printer’s shop.","zh":"那时候，镇上每个用墨水吃饭的人都知道那家印刷铺。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name) or a place name (for example, Inkster in Michigan, USA)","zh":"姓氏（家族名）或地名（例如美国密歇根州的 Inkster）"},"examples":[{"en":"Her last name is Inkster.","zh":"她的姓是 Inkster。"},{"en":"They drove through Inkster on the way to Detroit.","zh":"他们去底特律的路上开车经过了 Inkster。"}]}],"synonyms":["writer","printer","scribbler","ink-slinger"],"phonetic":"/ˈɪŋkstɚ/","extraExplanation":["“inkster”在现代英语中不算常见，更常见的表达是“writer”（作家/写作者）、“printer”（印刷工）、或更口语化的“ink-slinger”（带点俏皮地说写字很多的人）。","作为地名或姓氏时通常首字母大写：Inkster。"]}
{"word":"inkstick","summary":{"en":"An inkstick is a solid stick of traditional ink that you grind with water on an inkstone to make ink for calligraphy.","zh":"Inkstick 指“墨条/墨锭”，加水在砚台上研磨成墨汁，用于书法与水墨画。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A solid stick of ink (usually made from soot and animal glue) that you grind with water on an inkstone to make black ink, especially for Chinese/Japanese calligraphy and brush painting.","zh":"墨条；固体墨（通常由烟灰与动物胶制成），在砚台上加水研磨成墨汁，常用于中日书法与水墨画。"},"examples":[{"en":"She ground an inkstick on the inkstone until the ink turned deep black.","zh":"她在砚台上研磨墨条，直到墨汁变得乌黑。"},{"en":"Traditional calligraphy sets often include a brush, paper, an inkstick, and an inkstone.","zh":"传统书法套装常包含毛笔、纸、墨条和砚台。"}]}],"synonyms":["Chinese ink stick","India ink (bottled; not the same)","solid ink"],"phonetic":"/ˈɪŋkˌstɪk/","extraExplanation":["“Inkstick”多用于介绍东亚文房用具时的英文语境，对应中文“墨条/墨锭”。制作上常以松烟或油烟制成，加入胶并压模成形；使用时在砚台上加少量水慢慢研磨，可控制墨色浓淡与质感。","在文化上，它常与“文房四宝（笔、墨、纸、砚）”一起出现；相较于瓶装墨水，研墨被视为一种更“仪式感”的准备过程。"]}
{"word":"inkstone","summary":{"en":"An inkstone is a stone slab used to grind ink for traditional calligraphy; it can also symbolize scholarly study and a writer’s desk.","zh":"Inkstone 指用于磨墨的砚台，也可引申象征学问与书斋文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stone (or stone-like) slab used to grind solid ink sticks with water to make ink, especially in traditional Chinese, Japanese, and Korean calligraphy.","zh":"砚台；用于加水研磨墨条制墨的石板（尤指中日韩传统书法用具）。"},"examples":[{"en":"He poured a little water onto the inkstone and ground the ink stick slowly.","zh":"他在砚台上倒了一点水，慢慢地磨墨。"},{"en":"In traditional calligraphy, the “Four Treasures of the Study” include the brush, ink, paper, and inkstone.","zh":"在传统书法中，“文房四宝”包括笔、墨、纸、砚。"}]},{"partOfSpeech":"n.","definition":{"en":"The inkstone as a symbol of scholarship, classical learning, or a writer’s study.","zh":"（象征义）砚台；象征学问、文人雅士或书斋文化。"},"examples":[{"en":"His desk was simple, but the old inkstone suggested years of study.","zh":"他的书桌很朴素，但那方旧砚台暗示了多年的苦读。"},{"en":"The poem praises the quiet life of books and inkstone.","zh":"这首诗歌赞美了书卷与砚台相伴的清静生活。"}]}],"synonyms":["ink slab","calligraphy inkstone","writing stone"],"phonetic":"/ˈɪŋkˌstoʊn/","extraExplanation":["“Inkstone”常对应中文“砚/砚台”。在书法与国画传统里，砚台不仅是工具，也常被视为文人气质与学养的象征，因此文学作品中会用“inkstone”来暗示“书斋”“读书人”“士人生活”。","在英语里，现代日常写作很少用到inkstone；它更常出现在艺术、历史、博物馆、东亚文化与书法相关语境中。常见搭配有：inkstone set（砚台套装）、carved inkstone（雕刻砚）、to grind ink on an inkstone（在砚台上磨墨）。"]}
{"word":"inkweed","summary":{"en":"Inkweed is a common name for plants—often pokeweed—whose dark berry juice stains like ink.","zh":"Inkweed 是一种俗名，常指美洲商陆等植物，其深色浆果汁会像墨水一样染色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (common name) whose dark berries or juice can stain like ink; often refers to pokeweed.","zh":"“墨草/墨汁草”（俗名）：一种果汁呈深色、会像墨水一样染色的植物；常指“美洲商陆（pokeweed）”。"},"examples":[{"en":"The kids came home with purple hands after touching inkweed berries.","zh":"孩子们摸了墨草的浆果后回家，手都变成紫色了。"},{"en":"In some areas, people call pokeweed “inkweed” because its juice stains fabric.","zh":"在一些地区，人们把美洲商陆叫作“墨草”，因为它的汁液会把布料染色。"}]}],"synonyms":["pokeweed","inkberry (sometimes, regional)"],"phonetic":"ˈɪŋkˌwid","extraExplanation":["“inkweed”是民间俗称，不是严格的植物学名称；在北美语境里常用来指pokeweed（美洲商陆，Phytolacca americana）。","之所以叫“inkweed”，是因为成熟浆果的深紫色汁液曾被用来临时书写或染色；但这种植物（尤其是浆果、根等部位）可能有毒，不建议食用或让孩子随意接触。"]}
{"word":"inkwell","summary":{"en":"An inkwell is a small container for ink, traditionally used for dipping pens.","zh":"inkwell 指装墨水的小容器，传统上用于蘸笔写字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small container that holds ink, especially for dipping a pen.","zh":"墨水瓶；墨水盂（尤指用于蘸笔的盛墨小容器）。"},"examples":[{"en":"She dipped her fountain pen into the inkwell and began to write.","zh":"她把钢笔蘸了蘸墨水瓶里的墨水，开始写字。"},{"en":"On the old desk sat an inkwell beside a stack of letters.","zh":"旧书桌上，墨水瓶旁边放着一摞信。"}]}],"synonyms":["ink pot","ink bottle"],"phonetic":"/ˈɪŋkˌwɛl/","extraExplanation":["“inkwell”常让人联想到早期书写文化：在自来水笔与圆珠笔普及前，人们常用蘸水笔（dip pen）反复蘸墨水瓶写字。如今多见于历史场景、文学描写或复古文具语境。","在文学与历史语境里，inkwell有时带一点象征意味：写作、记录、教育、官僚文书等。例如描写“桌上有墨水瓶与羽毛笔”常用于营造旧时代的氛围。"]}
{"word":"inkwells","summary":{"en":"Inkwells are small containers used to hold ink, especially for dip pens; the word often appears in historical or vintage writing contexts.","zh":"Inkwells 指盛放墨水的小容器，多用于蘸水笔书写；常出现在历史或复古书写的语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small container (often glass, ceramic, or metal) that holds ink for dipping a pen.","zh":"墨水瓶；蘸水笔用的小容器（常为玻璃、陶瓷或金属），用来盛放墨水。"},"examples":[{"en":"She refilled the inkwell before writing the letter with a dip pen.","zh":"她在用蘸水笔写信前先把墨水瓶加满。"},{"en":"Old desks sometimes have built-in inkwells.","zh":"老式书桌有时会内置墨水瓶孔位。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural form) More than one inkwell.","zh":"（复数形式）多个墨水瓶。"},"examples":[{"en":"The museum displayed inkwells from different centuries.","zh":"博物馆展出了不同时代的墨水瓶。"}]}],"synonyms":["ink bottle","ink pot"],"phonetic":"/ˈɪŋkˌwɛl/","extraExplanation":["“inkwell”常让人联想到钢笔普及前的写作方式：用蘸水笔（dip pen）反复蘸墨。如今较少见，更多出现在博物馆、复古文具、或文学作品对“旧时代书写”的描写中。","相关文化用法：英语里有时会用“inkwell”营造怀旧、书卷气氛的场景，例如描写作家在书桌前写作、或19世纪信件往来。"]}
{"word":"inkwood","summary":{"en":"Inkwood is a name for a dye-producing wood/tree historically associated with making dark dye used in inks and textiles.","zh":"Inkwood 指能产深色染料、历史上与制墨和染织相关的染料木/树（常与苏木 logwood 等联系）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree whose heartwood is used to make a dark dye once used in inks (often referring to logwood), or the wood from such a tree","zh":"（常指苏木 logwood 等）可用来制成深色染料（过去也用于制墨水）的树；或这种树的木材"},"examples":[{"en":"In the 1800s, inkwood dye was used to color fabrics and sometimes to tint inks.","zh":"在19世纪，inkwood 提取的染料被用来给布料染色，有时也用于给墨水上色。"},{"en":"The museum displayed blocks of inkwood alongside other traditional dye-woods.","zh":"博物馆把一块块 inkwood 与其他传统染料木一起展出。"}]}],"synonyms":["logwood","dye-wood"],"phonetic":"/ˈɪŋkˌwʊd/","extraExplanation":["“inkwood”多为地方性俗名，不同地区可能指不同树种，但共同点是其木材/树皮能产生深色染料，历史上与“制墨”或“染色”有关。","在历史语境中它常与“logwood（苏木）”联系紧密；logwood 提取的染料（如 hematoxylin）曾广泛用于染织与书写材料。阅读旧文献时，可结合地理与年代判断具体指哪种树。"]}
{"word":"inkwoods","summary":{"en":"“Inkwoods” usually means the plural of “inkwood,” a regional common name for certain plants associated with dark staining or dye/ink use.","zh":"“Inkwoods”通常是“inkwood”的复数，表示某些与深色染色液/染料或“墨色染渍”相关的植物的地区性俗名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of inkwood: types of shrubs or small trees whose dark wood or bark has been used for making dye or ink-like stains (also used as a common name for several different plants in different regions).","zh":"inkwood 的复数：指一些灌木或小乔木的统称，这类植物的深色木材或树皮曾被用来制作染料或类似墨水的染色液（在不同地区可能指不同植物）。"},"examples":[{"en":"Local guides pointed out several inkwoods along the trail and explained how people once used their bark for staining.","zh":"当地向导在小径旁指给我们看几株 inkwoods，并解释过去人们如何用它们的树皮来染色。"},{"en":"The field notes mention “inkwoods” as a common name, not a single exact species.","zh":"野外记录里提到“inkwoods”是俗名，并不对应唯一的确切物种。"}]}],"synonyms":["dye-wood","staining wood","logwood (sometimes loosely)"],"phonetic":"/ˈɪŋkˌwʊdz/","extraExplanation":["“inkwood/inkwoods”在英语里比较少见，且常见于自然观察、地方植物志或历史用材/染料的语境。它更像“俗名”（common name），不同地区可能把不同植物叫作 inkwood，因此如果你是在某本书、某个岛屿/州的资料里看到它，最好结合地点去查对应的具体学名（Latin name）。","如果你指的是专有名词（例如品牌名、用户名、地名或作品名）“Inkwoods”，请告诉我出现它的上下文（句子/网页/地区），我可以按专名为你解释用法与含义。"]}
{"word":"inkwriter","summary":{"en":"“Inkwriter” is an uncommon word meaning a person or device that writes with ink, often referring to a pen (especially in older usage).","zh":"“inkwriter”是不太常见的词，指用墨水书写的人或装置，常在较旧的用法中指墨水笔/钢笔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or device that writes using ink (for example, a pen, fountain pen, or an early printing/writing mechanism).","zh":"用墨水书写的人或装置（例如钢笔、墨水笔，或早期的印写/书写机械）。"},"examples":[{"en":"Before ballpoint pens became common, many people preferred an inkwriter for everyday letters.","zh":"在圆珠笔普及之前，很多人写日常信件更喜欢用墨水笔。"},{"en":"The museum displayed an old inkwriter used for careful, formal handwriting.","zh":"博物馆展出了一支旧式墨水笔，用来进行工整、正式的书写。"}]}],"synonyms":["pen","fountain pen","writer"],"phonetic":"/ˈɪŋkˌraɪtər/","extraExplanation":["“inkwriter”在现代英语里并不常见，更常见的说法是“pen / fountain pen（钢笔）”。在一些旧式广告、产品名或技术语境中，它可能指“用墨水记录/书写的装置”（例如早期记录仪）或“墨水笔”这类工具。若你是在特定品牌、型号或专业领域（例如仪器记录）看到它，可以告诉我上下文，我能帮你确认更准确的含义。"]}
{"word":"inky","summary":{"en":"“Inky” means ink-colored or ink-covered, and it can also describe very dark or moody style/atmosphere.","zh":"“inky”指墨水色的或沾墨的，也可形容漆黑如墨或带阴郁氛围的风格/气氛。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or resembling ink in color (usually dark blue or black), or covered/marked with ink.","zh":"墨水色的（通常深蓝或黑色）；沾满/带有墨迹的。"},"examples":[{"en":"She wore an inky blue dress to the evening party.","zh":"她穿了一条墨蓝色的裙子去参加晚宴。"},{"en":"The page was smudged with inky fingerprints.","zh":"那页纸被沾着墨迹的指纹弄脏了。"},{"en":"In the inky darkness, we could barely see the road.","zh":"在漆黑如墨的黑暗中，我们几乎看不清路。"}]},{"partOfSpeech":"adj.","definition":{"en":"Like ink in style or mood—dark, intense, or slightly gloomy (often describing writing, art, or atmosphere).","zh":"（风格/氛围）如墨般的：阴郁、浓烈或带点冷暗感（常形容文字、艺术或气氛）。"},"examples":[{"en":"The novel has an inky, mysterious tone.","zh":"这部小说的基调阴郁而神秘。"},{"en":"Her drawings use inky lines to create strong contrast.","zh":"她用墨一般的线条来营造强烈对比。"}]}],"synonyms":["ink-black","jet-black","dark","shadowy","ink-stained"],"phonetic":"/ˈɪŋki/","extraExplanation":["“inky”既可以很字面地表示“墨水的/沾墨的”，也常用于文学或写作里比喻“漆黑如墨的（darkness）”。这种用法带有画面感，比单纯说“very dark”更有气氛。","常见搭配：inky black（墨黑/漆黑）、inky blue（墨蓝）、inky darkness（墨一般的黑暗）、inky stains（墨渍）、inky fingerprints（沾墨指纹）。"]}

