{"word":"inn","summary":{"en":"An inn is a small hotel/guesthouse (often cozy and traditional); in British or historical use, it can also mean a pub/tavern, sometimes with rooms.","zh":"inn 指小旅馆/客栈（常带温馨传统氛围）；在英式或历史语境中也可指酒馆/旅店（有时提供住宿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small hotel or guesthouse, often with a cozy, traditional feel; a place where travelers can stay overnight and usually eat.","zh":"（常指规模较小、较有传统氛围的）小旅馆、客栈；旅行者可过夜并通常可用餐的地方。"},"examples":[{"en":"We stayed at a quiet inn near the lake for two nights.","zh":"我们在湖边一家安静的客栈住了两晚。"},{"en":"The inn serves breakfast to guests every morning.","zh":"这家小旅馆每天早上为住客提供早餐。"}]},{"partOfSpeech":"n.","definition":{"en":"In Britain (and sometimes in historical contexts), a pub or tavern, sometimes with rooms for lodging.","zh":"（英式用法及一些历史语境中）酒馆/旅店（有时也提供住宿房间）。"},"examples":[{"en":"They met at the village inn for a drink after work.","zh":"他们下班后在村里的酒馆碰面喝一杯。"}]}],"synonyms":["guesthouse","small hotel","lodging house","tavern (BrE/historical)","pub (BrE)"],"phonetic":"/ɪn/","extraExplanation":["“inn”在英语文化中常带有“路边歇脚处”的意象，比“hotel”更小、更亲切、可能更有地方特色；但现代实际使用中两者有时也会被较宽泛地混用。","文学与历史里，“inn”常是旅人相遇、打听消息、剧情展开的地点。例如莎士比亚和狄更斯作品中常出现“inn”作为社会百态的缩影。"]}
{"word":"innage","summary":{"en":"Innage is a (usually historical) fee for storing goods, especially wine or grain; more rarely it can mean the amount stored.","zh":"Innage 指（多为历史语境中）存放货物的仓储/寄存费用，尤指葡萄酒或谷物；更少见时也可指存放的数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fee charged for storing goods (especially wine or grain), or for the right to store them, often in a warehouse or cellar.","zh":"（存放货物的）仓储费；（尤指葡萄酒、谷物等的）寄存费；也可指“存放权/寄存权”的费用。"},"examples":[{"en":"The merchant paid innage for keeping the barrels in the dockside warehouse.","zh":"商人支付了寄存费，把一桶桶货物存放在码头仓库里。"},{"en":"Historically, innage was often listed among local duties on wine and grain.","zh":"在历史上，innage 常被列为针对葡萄酒和谷物的地方性税费之一。"}]},{"partOfSpeech":"n.","definition":{"en":"The amount or quantity of goods stored; stored goods (rare).","zh":"（罕见）存放的数量；存货。"},"examples":[{"en":"Records noted the innage of grain kept for the winter months.","zh":"记录中注明了为冬季储存的谷物数量。"}]}],"synonyms":["storage fee","warehousing charge","storage charges","warehouse fee"],"phonetic":"/ˈɪnɪdʒ/","extraExplanation":["“innage”是较少见、偏历史/法律/贸易语境的词，常出现在旧账簿、港口税则、地方赋税或酒类/粮食仓储相关文件里。现代英语更常用“storage fee / warehousing charge / storage charges”。","词形上常被解释为与“in（在内）+ -age（名词后缀，表示费用/行为/结果）”相关，强调“存放在里面而产生的费用”。"]}
{"word":"innan","summary":{"en":"“Innan” is an archaic word meaning “within/inside,” and in Scots or older use it can also mean “before.”","zh":"“innan”是一个较古旧的词，常表示“在……之内/里面”；在苏格兰英语或旧用法中也可表示“在……之前”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(archaic/literary) inside; within (a place, limits, or time).","zh":"（古风/文学用语）在……里面；在……之内（指地点、范围或时间）"},"examples":[{"en":"He waited innan the old stone walls.","zh":"他在古老的石墙之内等待。"},{"en":"Peace must be found innan ourselves.","zh":"平静必须在我们自身之内找到。"}]},{"partOfSpeech":"conj.","definition":{"en":"(Scots/older use) before; earlier than (often used like a conjunction).","zh":"（苏格兰英语/较旧用法）在……之前；早于（常作连词用）"},"examples":[{"en":"Finish your work innan you go out.","zh":"你出去之前把作业做完。"},{"en":"It will be dark innan long.","zh":"不久就会天黑。"}]}],"synonyms":["within","inside","before","ere (archaic)"],"phonetic":"ˈɪnən","extraExplanation":["“innan”在现代标准英语里非常少见，更多出现在古诗、圣经式语体或历史小说中，表达“within（在……之内）”的感觉。","在苏格兰英语（Scots）以及一些旧文本里，“innan”也可表示“before（在……之前）”。学习时可以把它当作带有古典/地域色彩的替代词，日常写作更常用“within / before”。"]}
{"word":"innards","summary":{"en":"“Innards” means the inside parts of a body (organs) or, more generally, the internal workings of something.","zh":"“Innards”指（人或动物的）内脏，也可泛指某物的内部结构或运作机制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The inside parts of something, especially the internal organs of a person or animal.","zh":"（人或动物的）内脏；（某物的）内部构造。"},"examples":[{"en":"The fish was cleaned, and its innards were removed.","zh":"鱼被清理干净，内脏被取出。"},{"en":"He felt sick to his stomach, like his innards were twisting.","zh":"他胃里难受，感觉内脏在翻搅。"}]},{"partOfSpeech":"n.","definition":{"en":"The inner workings or hidden internal parts of a machine, system, or organization.","zh":"（机器、系统或组织的）内部结构；内部运作机制。"},"examples":[{"en":"I don’t understand the innards of the computer, but I can use it.","zh":"我不懂电脑的内部构造，但我会用。"},{"en":"The article explained the innards of the banking system in simple terms.","zh":"那篇文章用简单的方式解释了银行系统的内部运作。"}]}],"synonyms":["guts","entrails","internal organs","insides","inner workings"],"phonetic":"/ˈɪnərdz/","extraExplanation":["“Innards”通常以复数形式出现，语气偏口语，有时带一点“粗粝/直白”的感觉；在正式写作中谈到“器官”更常用“internal organs”，谈到“内部结构/机制”常用“inner workings”。","常见搭配：the innards of + 名词（the innards of a phone/engine/system）；也可用作比喻表达强烈不适：feel it in your innards（更口语）。"]}
{"word":"innascibility","summary":{"en":"Innascibility is a rare term meaning the quality of being unbegotten—not born—often used in theological discussions.","zh":"Innascibility 是个少见词，主要指“非受生/非由出生而来”的性质，常用于神学讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Theology, rare) The state or quality of being unbegotten—having no origin by birth; “not born.”","zh":"（神学，用词较少）“非受生/非由出生而来”的性质；指没有通过出生而有起源、未被生出的状态。"},"examples":[{"en":"In some Christian theological writings, innascibility is discussed as an attribute of God the Father.","zh":"在一些基督教神学著作中，“innascibility（非受生性）”被讨论为圣父的一个属性。"},{"en":"The author contrasts innascibility with being begotten.","zh":"作者把“innascibility（非受生性）”与“被生/受生”作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) The impossibility or inability of something to be born or come into existence by birth.","zh":"（非常少见）某物不可能/无法通过“出生”而产生的状态。"},"examples":[{"en":"The term is so uncommon that it often needs explanation in modern writing.","zh":"这个词非常少见，因此在现代写作中常常需要额外解释。"}]}],"synonyms":["unbegottenness","not-bornness","unoriginatedness (context-dependent)"],"phonetic":"/ˌɪnˌnæsəˈbɪləti/","extraExplanation":["词源：来自拉丁语 in-（否定）+ nasci（出生）。因此它的核心意思是“不是通过出生而来”。","使用语域：它多见于神学或哲学语境，日常英语几乎不用。更常见的替代表达包括 “unbegotten” 或 “not born”。","在基督教三位一体讨论中：有些传统会用“innascibility”指“圣父不是被生出来的”（与“圣子被生”相对）。不同宗派或译法可能用“非受生性/无生性/非所生”。"]}
{"word":"innascible","summary":{"en":"“Innascible” isn’t standard English; you probably mean “inaccessible” = hard to reach, use, or understand.","zh":"“innascible”不是标准英文；你可能想写“inaccessible”，意思是难以到达、使用或理解。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: **inaccessible**) not easy or possible to reach, enter, use, or understand.","zh":"（可能想写：**inaccessible**）难以到达的；难以进入/使用的；难以理解的。"},"examples":[{"en":"The village becomes inaccessible during the winter because the roads are covered in snow.","zh":"冬天道路被雪覆盖，这个村庄就变得难以到达。"},{"en":"Some parts of the website are inaccessible to users who rely on screen readers.","zh":"网站的某些部分对依赖屏幕阅读器的用户来说无法访问。"},{"en":"His writing style is so academic that it feels inaccessible to beginners.","zh":"他的写作风格太学术了，对初学者来说不易理解。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Formal) difficult to meet, talk to, or approach socially.","zh":"（正式）难以接近的；不易交往的。"},"examples":[{"en":"The manager seemed inaccessible, so employees hesitated to share concerns.","zh":"经理看起来不太好接近，所以员工不敢提出担忧。"}]}],"synonyms":["unreachable","hard to reach","impossible to access","out of reach","unapproachable"],"phonetic":"/ˌɪn.ækˈsɛs.ə.bəl/","extraExplanation":["“innascible”不是常见英文单词，通常被视为拼写错误。最接近且常用的词是 **inaccessible**（in- 否定前缀 + accessible 可接近的/可使用的）。","相关词：**accessible**（可到达的/可使用的）；**accessibility**（可达性；无障碍性，尤其指残障友好设计）。"]}
{"word":"innate","summary":{"en":"Innate means ‘inborn’ or ‘natural’: something you have from birth or something that is built-in as a basic quality.","zh":"Innate 表示“与生俱来的、天生的”，也可指“内在固有的”（作为基本特性本身就存在）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing in someone from birth; natural, not learned or trained.","zh":"与生俱来的；天生的；不是后天学习或训练得来的。"},"examples":[{"en":"She has an innate sense of rhythm.","zh":"她有一种与生俱来的节奏感。"},{"en":"Language ability is partly innate and partly learned.","zh":"语言能力部分是天生的，部分是后天习得的。"},{"en":"He showed an innate kindness toward strangers.","zh":"他对陌生人表现出天生的善意。"}]},{"partOfSpeech":"adj.","definition":{"en":"Built into the nature of a person or thing; inherent (a basic quality that is part of it).","zh":"内在固有的；本质上就包含的（作为某人或某物的基本特性）。"},"examples":[{"en":"There is an innate risk in investing your savings in one company.","zh":"把积蓄都投在一家公司里本身就有固有风险。"},{"en":"The system has innate limits that we can’t ignore.","zh":"这个系统有其内在限制，我们不能忽视。"}]}],"synonyms":["inborn","natural","inherent","inbred"],"phonetic":"/ɪˈneɪt/","extraExplanation":["“innate”常与“ability / talent / behavior / sense / trait”等搭配，强调“天生的”。对比：\n- innate（天生的） vs. learned（后天习得的）\n- innate（与生俱来） vs. acquired（后天获得的）\n- innate（先天的） vs. inborn（同义但更口语一些）/ inherent（强调“内在固有”）","词源上来自拉丁语“innatus”（意为“生来就有的”）。在心理学、生物学里常用来讨论“先天与后天”（nature vs. nurture）的问题。"]}
{"word":"innately","summary":{"en":"“Innately” means “by nature; from birth, not learned.”","zh":"“innately”表示“天生地、与生俱来地（非后天习得）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is natural and already part of someone or something from birth; not learned.","zh":"天生地；与生俱来地；不是后天习得地。"},"examples":[{"en":"She is innately curious and asks a lot of questions.","zh":"她天生就很好奇，总爱问很多问题。"},{"en":"Some people are innately better at recognizing faces.","zh":"有些人天生更擅长辨认人脸。"},{"en":"We aren’t innately afraid of public speaking; we often learn that fear.","zh":"我们并非天生害怕公开演讲；这种恐惧往往是后天形成的。"}]}],"synonyms":["by nature","naturally","inherently"],"phonetic":"/ɪˈneɪtli/","extraExplanation":["“innately”常和描述性形容词搭配，如 innately talented（天赋异禀）、innately kind（天性善良）、innately human（人类与生俱来的）。","语气上，“innately”比 “naturally” 更强调“出生就有、内在固有”，而 “naturally” 也可表示“理所当然地/当然”。例如：Naturally, I agreed.（当然，我同意了。）这里不能用 innately。"]}
{"word":"innateness","summary":{"en":"Innateness means an inborn quality or the idea that some abilities are present from birth, not learned.","zh":"Innateness 指“先天性”，也可指认为某些能力与生俱来、并非后天学习的观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being inborn; something you are born with rather than learned or gained later.","zh":"先天性；与生俱来的特质（不是后天学习或获得的）。"},"examples":[{"en":"Some researchers argue that language ability involves both learning and innateness.","zh":"一些研究者认为，语言能力既包含学习，也包含先天性。"},{"en":"They debated the innateness of moral instincts.","zh":"他们讨论了道德本能是否具有先天性。"}]},{"partOfSpeech":"n.","definition":{"en":"In linguistics and psychology: the idea that certain mental abilities or knowledge are hard-wired in the brain from birth.","zh":"（语言学/心理学）先天论：认为某些心理能力或知识是出生时就“写入”大脑的。"},"examples":[{"en":"Chomsky’s work made the question of innateness central to modern linguistics.","zh":"乔姆斯基的研究让“先天性”问题成为现代语言学的核心议题。"},{"en":"The course compares innateness with behaviorist views of learning.","zh":"这门课比较先天论与行为主义的学习观点。"}]}],"synonyms":["inbornness","innate nature","inherency","naturalness"],"phonetic":"/ɪˈneɪtnəs/","extraExplanation":["“innateness”来自形容词“innate”（先天的、与生俱来的）加名词后缀“-ness”（表示“性质/状态”）。常用于学术语境，尤其是心理学、语言学、哲学中的“先天 vs. 后天（nature vs. nurture）”讨论。","常见搭配：the innateness of + 名词（……的先天性）；argue for/against innateness（支持/反对先天论）；innateness hypothesis（先天性假说）。","在语言学里常与“universal grammar（普遍语法）”等概念一起出现，强调人类可能具有某种先天的语言习得机制。"]}
{"word":"innatism","summary":{"en":"Innatism is the belief that some knowledge or mental structures are inborn rather than learned from experience.","zh":"Innatism 指“先天论/先天机制论”，认为某些知识或心智结构是与生俱来的，而非完全由经验习得。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The view that certain ideas, knowledge, or mental capacities are inborn (present from birth) rather than learned only through experience.","zh":"先天论；认为某些观念、知识或心智能力是与生俱来的（出生时就有），而不完全来自后天经验与学习。"},"examples":[{"en":"In philosophy, innatism is often discussed in debates about whether the mind is born with ideas.","zh":"在哲学中，先天论常出现在关于“心灵是否生来就带有观念”的争论里。"},{"en":"Some researchers criticize innatism and argue that language ability develops mainly through interaction and learning.","zh":"一些研究者批评先天论，认为语言能力主要通过互动与学习发展起来。"}]},{"partOfSpeech":"n.","definition":{"en":"In linguistics or psychology, the claim that specific structures (especially for language) are innate and shape how we learn.","zh":"（语言学/心理学）先天机制论：主张某些特定结构（尤其与语言相关）是先天存在的，并影响我们如何学习。"},"examples":[{"en":"A strong form of innatism suggests children are born with a built-in grammar framework.","zh":"一种较强的先天机制论认为，儿童出生时就带有内建的语法框架。"},{"en":"The class compared innatism with empiricism when discussing how children acquire vocabulary.","zh":"课堂在讨论儿童如何习得词汇时，把先天机制论与经验主义作了比较。"}]}],"synonyms":["nativism (in philosophy/psychology)","theory of innate ideas","innate-structure view"],"phonetic":"/ɪˈneɪtɪzəm/","extraExplanation":["“innatism”常见于哲学、心理学与语言学的学术语境，日常口语里更常说“the idea that X is innate（某事是先天的观点）”。","词根提示：innate（先天的）+ -ism（主义/学说），因此“innatism”就是“主张先天性”的理论立场。","相关对立概念常是 empiricism（经验主义）或 the blank slate（白板说/心灵白板）。"]}
{"word":"innatist","summary":{"en":"someone who believes some knowledge or abilities are inborn","zh":"主张部分知识或能力是先天与生俱来的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that some ideas, abilities, or knowledge are inborn (present from birth), not learned only from experience.","zh":"先天论者；主张某些观念、能力或知识是与生俱来的，而不完全来自后天经验的人。"},"examples":[{"en":"In the debate about language learning, the innatist argues that humans are born with a built-in capacity for grammar.","zh":"在关于语言学习的讨论中，先天论者认为人类天生就具备掌握语法的内在能力。"},{"en":"Some psychologists are innatists, emphasizing genetic influences on behavior.","zh":"一些心理学家是先天论者，强调基因对行为的影响。"}]}],"synonyms":["nativist","rationalist","believer in innate ideas"],"phonetic":"/ɪˈneɪtɪst/","extraExplanation":["常见对立概念：empiricist（经验论者），认为知识主要来自经验与学习。","在语言学里常与“先天语法/语言习得机制”相关（例如讨论儿童为何能快速掌握母语）。"],"etymology":"来自 innat(e)（先天的）+ -ist（“……主义者/信奉者”）。在哲学与心理语言学语境中，用来指主张“先天观念/先天能力”的人。","mnemonic":["拆词记忆：innate（先天的）+ -ist（某种观点的人）→“相信先天的人”。","联想中文：先天论 = “生下来就有（innate）”的观点。"]}
{"word":"innative","summary":{"en":"“innative” is usually a misspelling; the standard word is “innate” (natural, inborn).","zh":"“innative”通常是拼写错误；标准用词是“innate”，表示“天生的、与生俱来的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly: **innate**) Existing from birth; natural, not learned. Example: “She has an innate sense of rhythm.” / “她天生就有节奏感。”","zh":"（常见正确拼写：**innate**）与生俱来的；天生的；非后天习得的。例：“She has an innate sense of rhythm.” / “她天生就有节奏感。”"},"examples":[{"en":"Kindness can be partly innate and partly learned.","zh":"善良可能一部分是天生的，一部分是后天学会的。"},{"en":"He has an innate ability to calm people down.","zh":"他天生就有让人冷静下来的能力。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/incorrect form) **innative** is usually treated as a misspelling of **innate** in modern English.","zh":"（较少/不规范用法）**innative** 在现代英语里通常被视为 **innate** 的拼写错误。"},"examples":[{"en":"I wrote “innative,” but the correct spelling is “innate.”","zh":"我写成了“innative”，但正确拼写是“innate”。"}]}],"synonyms":["inborn","natural","inherent","built-in"],"phonetic":"/ɪˈneɪt/","extraExplanation":["“innate”常用于心理、能力、性格等：innate talent（天赋）、innate immunity（先天免疫）。","容易混淆：innovative（创新的）和 invasive（侵入性的/扩散的）拼写相似但意思不同。"]}
{"word":"innato","summary":{"en":"Innato means “innate” or “inborn”—a quality you’re born with, not something you learn.","zh":"innato 意为“先天的/天生的”，指与生俱来的品质，而非后天习得。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Spanish/Italian) innate; inborn; existing from birth rather than learned.","zh":"（源自西班牙语/意大利语）先天的；天生的；与生俱来的（不是后天学来的）。"},"examples":[{"en":"She has an innato sense of rhythm, even without formal training.","zh":"她有一种先天的节奏感，即使没有受过正规训练。"},{"en":"Some fears seem innato, while others are shaped by experience.","zh":"有些恐惧似乎是天生的，而另一些则由经历塑造。"}]}],"synonyms":["innate","inborn","congenital","natural"],"phonetic":"/iˈnɑtoʊ/","extraExplanation":["“innato”在英语里不算常用词，更常见的对应表达是“innate / inborn / congenital”。在英文写作中使用“innato”通常带有外语色彩，可能出现在引用、人物对白或强调文化/语言背景的语境中。"]}
{"word":"innatural","summary":{"en":"“Innatural” is a rare, mostly literary word meaning “not natural” or “contrary to nature/normal feeling.” In modern English, “unnatural” is much more common.","zh":"“innatural”是较少见、偏文学或旧式的词，意为“不自然的/违背天性或常情的”。现代英语更常用“unnatural”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not natural; unnatural or abnormal (rare; mostly literary or old-fashioned).","zh":"不自然的；反常的（较少见，多用于文学或较旧的用法）。"},"examples":[{"en":"The plant showed an innatural color after weeks without sunlight.","zh":"这株植物在几周不见阳光后呈现出不自然的颜色。"},{"en":"He spoke with an innatural calm that made everyone uneasy.","zh":"他以一种反常的冷静说话，让大家都不安。"}]},{"partOfSpeech":"adj.","definition":{"en":"Contrary to nature or normal human feeling, especially about family or relationships (e.g., “innatural cruelty”).","zh":"违背天性或常情的（尤指亲情或人际关系，如“反人性的残忍”）。"},"examples":[{"en":"In the story, the ruler’s innatural cruelty toward his own son shocked the court.","zh":"在故事里，统治者对亲生儿子的反常残忍震惊了朝廷。"},{"en":"She called it an innatural act to abandon one’s children.","zh":"她说抛弃孩子是一种违背人性的行为。"}]}],"synonyms":["unnatural","abnormal","unnatural-looking","unusual","against nature"],"phonetic":"/ɪˈnætʃərəl/","extraExplanation":["“innatural”在现代英语里非常少见，通常用更常见的“unnatural”。在旧文学/宗教或古典文本中，你可能会见到“innatural”来强调“违背天性、常情”。","构词上是前缀“in-（不、非）+ natural（自然的）”。现代英语更倾向用“un-”构成反义（unnatural）。"]}
{"word":"innaturality","summary":{"en":"Innaturality means the quality of being unnatural, often suggesting forced or artificial behavior or an abnormal situation.","zh":"innaturality 指“不自然”的性质，常含“做作/不真诚”或“反常”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being unnatural—especially behavior, feelings, or style that seems forced, artificial, or not sincere.","zh":"不自然；矫揉造作（尤指行为、情感或表达方式显得做作、不真诚）"},"examples":[{"en":"His compliments had an air of innaturality, as if he were reading from a script.","zh":"他的赞美带着一种不自然的感觉，仿佛是在照着稿子念。"},{"en":"She spoke with a slight innaturality when she tried to sound confident.","zh":"她试图显得自信时，说话带着些许不自然。"}]},{"partOfSpeech":"n.","definition":{"en":"The state of being contrary to what is normal, natural, or expected in nature or in a situation.","zh":"违背常态/常理；反常（指与自然或情境中通常会发生的情况不一致）"},"examples":[{"en":"Critics noted the innaturality of the plot twist, which didn’t fit the characters’ choices.","zh":"评论者指出这个剧情反转很反常，与人物的选择不相符。"},{"en":"The innaturality of the silence after the announcement made everyone uneasy.","zh":"宣布之后那种反常的沉默让大家都不安。"}]}],"synonyms":["unnaturalness","artificiality","affectedness","awkwardness","contrivance"],"phonetic":"/ˌɪnˌnætʃəˈrælɪti/","extraExplanation":["“innaturality”不是日常高频词，更常见的替代说法有：unnaturalness（不自然）、artificiality（人工/做作）、affectedness（矫饰/装腔作势）、awkwardness（尴尬/别扭）。写作中如果想更自然，通常用这些词更常见。","构词上：in-（否定前缀）+ natural + -ity（名词后缀），表示“缺乏自然性/自然状态”。在文学评论或较正式的写作里可能出现，用来评价言行、文风或情节是否“真实可信”。"]}
{"word":"innaturally","summary":{"en":"“Innaturally” means “in an unnatural or oddly forced way,” often suggesting something feels strange or off.","zh":"“Innaturally”表示“以不自然、显得别扭或做作的方式”，常暗示让人觉得怪或不对劲。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not natural, normal, or typical; in an artificial or forced manner.","zh":"以不自然、不正常或不符合常态的方式；显得做作或勉强。"},"examples":[{"en":"He smiled innaturally, as if he were trying too hard to look friendly.","zh":"他笑得很不自然，好像太用力想显得友好。"},{"en":"The room was innaturally quiet after the argument.","zh":"争吵之后，房间里安静得不正常。"}]}],"synonyms":["unnaturally","artificially","awkwardly","oddly","strangely"],"phonetic":"/ˌɪnˈnætʃ(ə)rəli/","extraExplanation":["“innaturally”常带有说话者的主观感受：不仅表示“不是自然发生的”，也常暗示“怪、别扭、让人不安”。在叙事写作中，它常用来营造紧张气氛（如“innaturally silent/bright/still”）。","构词上是 in-（否定）+ naturally（自然地）。注意它不同于“supernaturally（超自然地）”，后者强调“超出自然规律”。"]}
{"word":"innavigable","summary":{"en":"“Innavigable” means not navigable—impossible or unsafe to travel through (especially by boat).","zh":"“innavigable”指“不可航行的/不可通航的”，即无法或不宜通过（尤指船只航行）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be navigated; too difficult or unsafe to travel through by ship, boat, or sometimes by people or vehicles.","zh":"不可航行的；无法（或不宜）用船只通过的；有时也指难以通行的。"},"examples":[{"en":"In winter, the river becomes innavigable because of thick ice.","zh":"冬天河面结了厚冰，河道就变得不可航行。"},{"en":"After the storm, debris made the harbor temporarily innavigable.","zh":"暴风雨过后，漂浮残骸让港口一度无法通航。"},{"en":"The mountain pass was nearly innavigable without a guide.","zh":"没有向导的话，那条山口几乎无法通行。"}]}],"synonyms":["unnavigable","not navigable","impassable","inaccessible"],"phonetic":"/ɪnˈnævɪɡəbəl/","extraExplanation":["“innavigable”由否定前缀 in-（不、无）+ navigable（可航行的）构成，意思直观，但在现代英语中相对少见；更常见的表达是 “not navigable” 或 “unnavigable”。","常见搭配包括：innavigable river/channel/harbor/waters（不可通航的河流/航道/港口/水域）。用于比喻时可指“难以推进/难以穿越”的情况，但正式语体更常用。"]}
{"word":"inne","summary":{"en":"“inne” is not a standard English word; it is most often a misspelling of “inn” (a small hotel).","zh":"“inne”不是标准英语词；最常见是把“inn”（小旅馆/客栈）拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard English) “inne” is usually a misspelling of “inn,” meaning a small hotel or lodging place, often with a restaurant or pub.","zh":"（非标准英语）“inne”通常是“inn”的拼写错误；“inn”指小旅馆/客栈，常带餐厅或酒吧。"},"examples":[{"en":"We stayed at a cozy inn near the lake.","zh":"我们住在湖边一家舒适的小旅馆。"},{"en":"The old inn serves breakfast and dinner.","zh":"那家老客栈提供早餐和晚餐。"}]}],"synonyms":["hotel","lodge","guesthouse"],"phonetic":"/ɪn/","extraExplanation":["“inne”本身在现代标准英语里不是常用词。你可能想查的是：\n1) inn（客栈/小旅馆）；\n2) inner（内部的，形容词）；\n3) in（在……里面，介词/副词）。\n如果你告诉我上下文句子，我可以帮你确认最合适的词。"]}
{"word":"inned","summary":{"en":"“Inned” is a rare form meaning either “stayed at an inn” or (rarely) “brought in/moved inside.”","zh":"“inned”很少见，通常表示“投宿于旅馆”，也可（罕见）表示“把……收进来/移到里面”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “inn”: to stay in (or lodge at) an inn.","zh":"“inn”的过去式/过去分词：住在小旅馆（客栈）里；投宿于旅馆。"},"examples":[{"en":"We inned at a small hotel near the river for two nights.","zh":"我们在河边的一家小旅馆住了两晚。"},{"en":"After a long walk, they inned in the nearest village.","zh":"走了很久之后，他们在最近的村子里投宿。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) past tense / past participle of “in” (as a verb): to bring in, collect, or move something inside.","zh":"（罕见）作动词“in”的过去式/过去分词：把……带进来；收进来；移到里面。"},"examples":[{"en":"Before the storm, the farmer inned the tools and closed the barn.","zh":"暴风雨来之前，农夫把工具收进来并关上了谷仓。"},{"en":"They inned the laundry because the sky looked dark.","zh":"他们把衣服收进来，因为天看起来要下雨。"}]}],"synonyms":["stayed (at an inn)","lodged","put inside","brought in","took in"],"phonetic":"/ɪnd/","extraExplanation":["“inned”在现代英语里非常少见。你更常会看到：\n- “stayed at an inn”（住旅馆）而不是“inned”。\n- “brought in / took in”（拿进来/收进来）而不是把“in”当动词用。\n如果你是在文学作品、历史文本或方言语境里看到“inned”，通常就是上面两种意思之一。"]}
{"word":"inneity","summary":{"en":"Inneity means the state or quality of being inborn (innate), not learned.","zh":"Inneity 指“先天性/与生俱来的特质”，强调不是后天学习来的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being inborn or innate; something that exists in you from birth rather than being learned","zh":"先天性；天生的特质（与后天学习相对）"},"examples":[{"en":"Some researchers discuss whether language ability is mostly learned or partly a matter of inneity.","zh":"一些研究者讨论语言能力主要是后天习得，还是部分来自先天性。"},{"en":"She believed his kindness had a natural inneity that training could not create.","zh":"她认为他的善良有一种天生的先天性，是训练无法凭空塑造的。"}]}],"synonyms":["innateness","innate nature","inbornness"],"phonetic":"/ɪˈniːəti/","extraExplanation":["“inneity”是一个较少见、偏学术的名词，来自拉丁语词根 *innatus*（天生的）。日常英语里更常用的是 **innateness** 或直接用形容词 **innate**（例如：innate talent 天赋）。","它常出现在心理学、语言学与哲学的“先天—后天”（nature vs. nurture）讨论中：例如讨论某种能力/倾向是否“与生俱来”。"]}
{"word":"inner","summary":{"en":"Inner means “inside” (not outer) and can also describe your private thoughts and feelings.","zh":"inner 表示“内部的/内侧的”，也可形容“内心的、个人的思想与感受”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The inside part of something; not the outer surface.","zh":"内侧的；里面的；不是外表的部分。"},"examples":[{"en":"The inner pocket of my jacket is big enough for my phone.","zh":"我夹克的内袋够大，可以放手机。"},{"en":"Please write your name on the inner cover of the book.","zh":"请把你的名字写在书的内封上。"}]},{"partOfSpeech":"adj.","definition":{"en":"Private or personal thoughts and feelings; the part of you that other people usually cannot see.","zh":"内心的；个人的思想与感受（通常别人看不见的那部分）。"},"examples":[{"en":"She tries to stay calm, but she feels nervous in her inner world.","zh":"她努力保持冷静，但在内心世界里其实很紧张。"},{"en":"Meditation can help you listen to your inner voice.","zh":"冥想能帮助你聆听内心的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s internal organs, especially the stomach and intestines (often plural: inners).","zh":"（尤指）内脏；肠胃等（常用复数 inners）。"},"examples":[{"en":"The cold drink upset his inners.","zh":"那杯冷饮让他肠胃不舒服。"}]}],"synonyms":["inside","internal","inward","interior","private"],"phonetic":"/ˈɪnər/","extraExplanation":["“inner”常和名词搭配：inner city（市中心的贫困社区/内城）、inner circle（核心圈子）、inner peace（内心平静）、inner child（内在小孩）。注意：inner city在美国语境里常涉及种族与贫困等社会议题，使用时要尊重与谨慎。","文学或写作中，“inner”常用来强调人物的心理活动，比如 inner thoughts / inner conflict（内心冲突），帮助读者看到角色“外表之下”的真实感受。"]}
{"word":"inner city","summary":{"en":"“Inner city” means the older central part of a city, often referring to neighborhoods with fewer resources and higher poverty (especially in American English).","zh":"“inner city”指城市较老的中心区域；在美式英语中常用来指资源较少、贫困率较高的市中心社区。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an area) the older, central part of a city, often used to refer to neighborhoods with higher poverty and fewer resources.","zh":"（地区）城市的老旧中心区域；常用来指贫困率较高、资源较少的市中心社区。"},"examples":[{"en":"She teaches at a school in the inner city.","zh":"她在市中心贫困社区的一所学校教书。"},{"en":"The program supports inner-city youth with tutoring and job training.","zh":"这个项目通过辅导和职业培训来支持市中心社区的青少年。"}]},{"partOfSpeech":"n.","definition":{"en":"the older, central area of a city, sometimes contrasted with the suburbs.","zh":"城市的老旧中心区域；有时与“郊区”相对。"},"examples":[{"en":"Rents are rising in the inner city.","zh":"市中心地区的租金正在上涨。"},{"en":"They moved from the suburbs to the inner city for a shorter commute.","zh":"为了通勤更近，他们从郊区搬到了市中心。"}]}],"synonyms":["central city","downtown (partial)","urban core"],"phonetic":"/ˌɪnər ˈsɪti/","extraExplanation":["在美国语境里，“inner city”有时带有刻板印象色彩，常被用来暗示贫困、犯罪或少数族裔聚居。表达更中性时，可以说“central city neighborhoods（市中心社区）”“urban neighborhoods（城市社区）”或直接说具体街区/城市名。","与之相对的常见搭配是“suburbs（郊区）”“suburban（郊区的）”。在城市规划或社会议题中也会出现“inner-city schools/housing/youth”等固定搭配。"]}
{"word":"inner-bone","summary":{"en":"the inside part of a bone; internal to a bone","zh":"骨头内部的部分；骨内的"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the inner part of a bone (the tissue/structure inside the hard outer layer)","zh":"（骨头的）内层；骨内侧的组织/结构（相对外面的硬骨皮质层）"},"examples":[{"en":"The surgeon checked the inner-bone area for bleeding.","zh":"外科医生检查了骨内层区域是否出血。"},{"en":"Damage can spread from the outer surface into the inner bone.","zh":"损伤可能从外表面扩散到骨内层。"}]},{"partOfSpeech":"adj.","definition":{"en":"located inside a bone; relating to the inside of a bone","zh":"骨内的；与骨头内部相关的"},"examples":[{"en":"The scan showed an inner-bone lesion.","zh":"扫描显示骨内有一个病灶。"},{"en":"Inner-bone pain may feel deep and hard to pinpoint.","zh":"骨内疼痛常常感觉很深、不容易准确定位。"}]}],"synonyms":["internal bone","inside of the bone","endosteal bone","intramedullary"],"phonetic":"/ˈɪnər boʊn/","extraExplanation":["在解剖学里，骨头常被简单分为“外层的致密骨（cortical bone）”和“内部的松质骨/海绵骨（cancellous/spongy bone）”。“inner-bone”不是非常固定的标准术语，更像是描述性表达；更专业的说法有时会用 endosteal（骨内膜相关的）或 intramedullary（骨髓腔内的），具体取决于指的是骨内膜、松质骨，还是骨髓腔。"],"etymology":"由英语 inner（“内侧的”）+ bone（“骨头”）组成的复合/连字符写法。更常见于医学或解剖学语境中，用来直观描述“骨头的内侧/内部”。","mnemonic":["inner = “内”，bone = “骨”；合起来就是“内骨/骨内层”，按字面记最稳。","联想中文常说“骨子里”（= inside the bone）来帮助记忆“在骨头内部/很深处”。"]}
{"word":"inner-canonical","summary":{"en":"interpreted or analyzed within the boundaries of an accepted canon","zh":"在既定正典体系内部进行的解读/分析"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to interpretation or analysis done from within an accepted canon (a recognized set of authoritative texts), focusing on how parts of the canon explain or shape each other.","zh":"（尤用于圣经/文献研究）指在既定“正典”（被权威认可的一组文本）内部进行的解读或分析，强调正典内部各文本之间如何相互解释、相互塑造。"},"examples":[{"en":"The paper uses an inner-canonical approach to read the prophets alongside the Torah.","zh":"这篇论文用“内正典”的方法，把先知书放在与《律法书》并读的框架里来解读。"},{"en":"An inner-canonical reading highlights themes that repeat across different books in the canon.","zh":"内正典式阅读会突出正典中不同书卷反复出现的主题。"}]}],"synonyms":["within-the-canon","canonical","intra-canonical","canon-based"],"phonetic":"/ˌɪnər kəˈnɑːnɪkəl/","extraExplanation":["常见于神学与圣经研究（Biblical Studies）的术语，如 inner-canonical interpretation/criticism（内正典诠释/批评）。它通常强调：把一段经文放回“整本正典”的语境中理解，而不是只从历史背景或单一文本来源来解释。","在更宽泛的人文学科里，也可借用来指“在某一经典体系（如某学科公认的经典著作）内部”进行的解读，但最常见还是宗教经典研究语境。"],"etymology":"由 inner（“内部的”）+ canonical（“正典的、权威文本体系的”）构成。canonical 源自希腊语 kanōn，原意是“标尺、规范”，后来引申为“被认可的规范/书目（正典）”。","mnemonic":["inner = “里面的”；canonical = “正典/权威经典的”。合起来就是“在正典里面看问题”。","记 canon = “规范/正典”，像“标尺”一样定标准；inner-canonical 就是“用这把标尺在体系内部对照、互证”。"]}
{"word":"inner-city","summary":{"en":"in a city’s central area, often linked to poverty and limited resources","zh":"城市中心区域的；常带“较贫困、资源不足”的含义"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in the central parts of a city, often referring to areas with lower income levels and fewer public resources (schools, housing, services).","zh":"位于城市中心区域的；常指较贫困、公共资源较少（如学校、住房、服务不足）的市中心社区（带有社会经济含义）。"},"examples":[{"en":"She teaches at an inner-city high school.","zh":"她在一所市中心（较贫困社区）的高中任教。"},{"en":"The program offers after-school tutoring for inner-city kids.","zh":"这个项目为市中心社区的孩子提供课后辅导。"}]},{"partOfSpeech":"n.","definition":{"en":"The central part of a city, sometimes implying social or economic disadvantage.","zh":"（某些语境中）市中心区域；有时暗含社会或经济弱势。"},"examples":[{"en":"He grew up in the inner-city and moved to the suburbs later.","zh":"他在市中心社区长大，后来搬到了郊区。"}]}],"synonyms":["downtown","city-center","central-city","urban core"],"phonetic":"/ˌɪnɚ ˈsɪti/","extraExplanation":["语气与敏感性：inner-city 在美国语境中经常与贫困、治安、教育资源不足等议题绑定，有时会被用作对特定族群或社区的刻板印象代称。写作或表达时，若只想表达地理位置，可用 “in the city center / downtown”; 若强调资源与政策议题，可更具体地说 “underserved neighborhoods / low-income urban neighborhoods”。"],"etymology":"由 inner（“内部的、中心的”）+ city（“城市”）构成，20世纪中后期在美国英语中更常见，用来指城市中心区域，后来也常与贫困、资源不足等社会议题一起出现。","mnemonic":["把它拆开记：inner（更里面=更中心）+ city（城市）→ “城市内部/中心区域”。"]}
{"word":"inner-ear","summary":{"en":"The deep part of the ear responsible for hearing and balance.","zh":"负责听觉与平衡的耳朵深部结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The part of the ear deep inside the head that helps you hear and keep your balance (it includes the cochlea and the vestibular system).","zh":"内耳：位于头部深处、负责听觉与平衡的耳部结构（包括耳蜗与前庭系统等）。"},"examples":[{"en":"An inner-ear infection can cause dizziness as well as hearing problems.","zh":"内耳感染除了影响听力，也可能引起头晕。"},{"en":"The doctor checked her inner ear to see why she felt off balance.","zh":"医生检查了她的内耳，看看她为什么会失去平衡感。"}]}],"synonyms":["labyrinth","internal ear"],"phonetic":"ˌɪnər ˈɪr","extraExplanation":["内耳主要包括两大功能区：耳蜗（cochlea，负责把声音振动转成神经信号）和前庭系统（vestibular system，负责平衡与空间方向感）。因此内耳问题常见症状除了听力下降，还可能有眩晕、恶心、走路不稳。"],"etymology":"由 inner（“内侧的”）+ ear（“耳朵”）组成的复合名词，用来区分外耳（outer ear）、中耳（middle ear）和内耳（inner ear）。","mnemonic":["记成“三段耳”：outer ear 外耳、middle ear 中耳、inner ear 内耳；inner=“里面的”，所以内耳=最里面那段。","联想“inner=内”，中文直接对应“内耳”，几乎不用额外翻译。"]}
{"word":"inner-elbow","summary":{"en":"the inside bend of the arm at the elbow","zh":"手肘內側的彎曲處（肘窩）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The inside bend of the arm at the elbow; the area where the forearm meets the upper arm (the side that folds when you bend your arm).","zh":"手肘內側／肘窩：手臂彎曲時內側形成的凹處（前臂與上臂連接、會折起來的那一面）。"},"examples":[{"en":"The nurse drew blood from the inner elbow.","zh":"護理師從肘窩處抽血。"},{"en":"He had a rash on the inner elbow after wearing a new sweater.","zh":"他穿了新毛衣後，肘窩內側起了疹子。"},{"en":"Bend your arm and place the strap against your inner elbow.","zh":"彎起手臂，把帶子貼在肘窩位置。"}]}],"synonyms":["elbow crease","antecubital fossa","inside of the elbow","inner arm"],"phonetic":"ˈɪnɚ ˈɛlboʊ","extraExplanation":["常見於醫療情境：抽血、打點滴、量血壓時的說明可能提到這個部位。正式醫學上也常用更專業的說法，如 “antecubital fossa”（肘前窩），但日常英語說 “inner elbow” 更直觀。"],"etymology":"由 inner（內側的）+ elbow（手肘）組成的描述性複合詞，用來指「手肘的內側」這個具體位置；在醫療與日常指示中常見。","mnemonic":["把它拆開記：inner=內側，elbow=手肘 → 「手肘內側」。","聯想抽血：很多人抽血是在「肘窩」→ 想到抽血就想到 inner elbow。"]}
{"word":"inner-layer","summary":{"en":"the inside layer of something","zh":"某物的内层"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the layer on the inside of something; a layer closer to the center than other layers","zh":"内层；里层（指比其他层更靠里面、靠近中心的一层）"},"examples":[{"en":"The jacket’s inner-layer is made of soft fleece to keep you warm.","zh":"这件夹克的内层是柔软的抓绒，用来保暖。"},{"en":"Apply the cream to the inner-layer of skin where it feels dry.","zh":"把乳霜涂在感觉干燥的皮肤内层部位。"},{"en":"Engineers tested the inner-layer of the pipe for cracks.","zh":"工程师检测了管道内层是否有裂纹。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that is on the inside layer of an object or structure","zh":"内层的；位于里层的"},"examples":[{"en":"The inner-layer fabric is breathable but still blocks wind.","zh":"内层面料透气，但仍能挡风。"},{"en":"Use inner-layer insulation to reduce heat loss.","zh":"使用内层保温材料来减少热量流失。"}]}],"synonyms":["inner layer","interior layer","inside layer","inner lining","underlayer","substratum"],"phonetic":"/ˈɪnɚ ˌleɪɚ/","extraExplanation":["连字符用法小提示：作定语放在名词前时更常见连字符（inner-layer coating 内层涂层）；单独当名词短语时常不加连字符（the inner layer of the coating 涂层的内层）。"],"etymology":"这是一个复合词：inner（内部的）+ layer（层）。用连字符多见于技术写作、产品说明或需要强调“作为一个整体概念”时；日常英语里也常写作 inner layer（不加连字符）。","mnemonic":["inner = 里面的；layer = 层。合起来就是“里面那一层”。","记成“in（在里面）+ layer（层）”，想到“夹心/洋葱”一层层往里剥，最里面那层就是 inner-layer。"]}
{"word":"inner-leaved","summary":{"en":"having inner layers of leaves; inward or hidden","zh":"具有内层叶子的；引申为内在或隐秘的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having inner leaves; described as having leaves on the inside or nearer the center (often in botanical or descriptive writing).","zh":"有内层叶子的；（常用于植物学或描写中）指叶子位于内部或更靠近中心。"},"examples":[{"en":"The inner-leaved bud stayed protected through the cold nights.","zh":"那颗内层叶子的芽在寒冷的夜里一直受到保护。"},{"en":"Trim the inner-leaved parts carefully to avoid damaging the core.","zh":"修剪内层叶子的部分要小心，避免伤到菜心。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Private, inward, or hidden—like something kept within layers.","zh":"（引申）内在的、隐秘的；像被层层包裹、藏在里面的。"},"examples":[{"en":"He spoke with an inner-leaved calm that didn’t show on his face.","zh":"他带着一种内敛的平静，说不出来却能感觉到。"},{"en":"Her inner-leaved thoughts remained unshared.","zh":"她那些藏在心底的想法一直没有说出口。"}]}],"synonyms":["inner","inward","hidden","layered","leafy"],"phonetic":"ˌɪnɚ ˈlivd","extraExplanation":["这是一个较少见的描写性/植物学用词，更常见的表达包括 inner leaves（内层叶子）、inner leafy layers（内侧叶层）或 inner foliage（内侧枝叶）。在写作中它带一点“文学化的压缩”，把短语变成一个形容词。"],"etymology":"由 inner（内部的）+ leaved（有……叶的）构成的复合形容词；-leaved 常用于描述“具有某种叶子特征”的植物或结构（如 broad-leaved）。","mnemonic":["记成“inner（里面）+ leaves（叶子）”：里面那一层叶子＝内层叶。","联想中文“菜心外面一圈圈叶子”：越往里越‘inner-leaved’。"]}
{"word":"inner-shin","summary":{"en":"the inside area of the shin on the lower leg","zh":"小腿胫部（小腿前侧）的内侧区域"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the inside part of the shin (the front of the lower leg), closer to the other leg; often used when describing pain, injuries, or where something touches the leg","zh":"小腿胫骨（小腿前侧）靠内侧、靠另一条腿的一边；常用于描述疼痛、受伤或接触位置"},"examples":[{"en":"I feel a sharp pain along my inner-shin when I run downhill.","zh":"我下坡跑时，小腿胫骨内侧会有刺痛感。"},{"en":"The soccer ball hit him on the inner-shin.","zh":"足球砸到了他小腿胫骨的内侧。"},{"en":"The brace rubbed against my inner-shin and left a red mark.","zh":"护具磨到了我小腿胫骨内侧，留下了一道红印。"}]}],"synonyms":["inner shin","inside shin","medial shin","inner tibia","inside of the shin"],"phonetic":"/ˈɪnər ʃɪn/","extraExplanation":["日常更常说法通常是 the inner shin 或 the inside of my shin；带连字符 inner-shin 多见于笔记、运动训练记录或产品说明里，用来强调“一个具体的接触/疼痛点”。","解剖学语境下也可能对应 medial shin（“小腿内侧”）或更具体的 medial tibia（“胫骨内侧”），但普通交流用 inner shin 就足够。"],"etymology":"由 inner（“内侧的”）+ shin（“小腿胫部/胫骨前侧”）组合而成的描述性复合表达，常见于运动、医学或日常身体部位定位。","mnemonic":["inner=内侧；shin=小腿胫部。合起来就是“小腿胫部的内侧”。","记成“in-ner（在里面）+ shin（小腿）”：在小腿里面那一侧。"]}
{"word":"inner-solar","summary":{"en":"in the region closer to a solar system’s star","zh":"（行星系中）更靠近恒星的内侧区域"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located within the inner part of a solar system, especially the region closer to the star (often including the rocky planets).","zh":"位于行星系内部、靠近恒星的区域（常指包含类地行星的内侧区域）。"},"examples":[{"en":"Mercury, Venus, Earth, and Mars are usually called the inner-solar planets.","zh":"水星、金星、地球和火星通常被称为内太阳系行星。"},{"en":"The probe was designed to survive inner-solar heat and radiation.","zh":"这艘探测器的设计目标是能承受内太阳系的高温与辐射。"}]}],"synonyms":["inner solar system","intrasolar"],"phonetic":"/ˌɪnər ˈsoʊlər/","extraExplanation":["在具体文章里，“inner-solar”常是“inner solar system（内太阳系）”的简写式用法。不同资料对“内太阳系”的边界定义可能略有差异：有的以小行星带为界，有的以霜线（snow line）附近为参考。阅读时可看上下文的定义。"],"etymology":"由 inner（内部的）+ solar（太阳的、与恒星有关的）构成的复合形容词；常见于天文学语境，用来对比 outer-solar（外太阳系/外侧区域）。","mnemonic":["把它拆开记：inner=“内”，solar=“太阳/恒星相关”，合起来就是“太阳系内部的/靠近太阳的”。","联想中文常说的“内行星/类地行星”区域：越“内”越靠近太阳、越热。"]}
{"word":"inner-speech","summary":{"en":"silent self-talk used for thinking and self-guidance","zh":"用于思考与自我引导的无声自我对话"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the silent voice in your mind used for thinking in words, talking to yourself mentally, and planning what to say or do","zh":"内心言语；心中默念的“自我对话”，用语言在脑中思考、计划与自我提醒"},"examples":[{"en":"When I’m nervous, my inner speech gets very critical.","zh":"我紧张的时候，内心言语会变得很苛刻。"},{"en":"She used inner speech to rehearse her presentation before going on stage.","zh":"她上台前用内心言语在脑中预演演讲。"},{"en":"Mindfulness can help you notice inner speech without getting carried away by it.","zh":"正念练习能帮助你觉察内心言语，而不被它牵着走。"}]},{"partOfSpeech":"n.","definition":{"en":"(in psychology and language development) self-directed speech that becomes internal over time and helps with self-control and problem-solving","zh":"（心理学/语言发展）指向自我的言语，随着发展逐渐“内化”，用来调控行为与解决问题"},"examples":[{"en":"Researchers study how children’s private speech develops into inner speech.","zh":"研究者会研究儿童的“私语”如何发展成内心言语。"},{"en":"Inner speech can support working memory during difficult tasks.","zh":"在困难任务中，内心言语能支持工作记忆。"}]}],"synonyms":["inner voice","self-talk","internal monologue","self-dialogue","mental speech"],"phonetic":"/ˈɪnɚ ˌspiːtʃ/","extraExplanation":["常见相关术语：inner voice（内在声音，偏日常说法）；self-talk（自我对话，可包含说出声或在心里说）；private speech（私语/自言自语，常指儿童会说出声的自我引导语言）。","在维果茨基（Vygotsky）的理论中，儿童先用外显语言与他人互动，随后出现“私语”来指导自己，最终逐渐内化为 inner speech，用于自我调节与思考。"],"etymology":"由 inner（“内在的”）+ speech（“言语”）构成的现代复合词；学术语境里常见于心理学与语言发展研究，用来指“在心里说话”的现象。","mnemonic":["把 inner 记成“内”（内部的），speech 记成“说话”，合起来就是“在内心说话”。","联想中文“心里OS”：很多时候 inner speech 就是脑内小剧场/自我旁白。"]}
{"word":"inner-toothed","summary":{"en":"having teeth-like edges on the inside","zh":"内侧带齿状突起的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having tooth-like projections on the inner side or inner edge (often used in descriptions of plants or specialized parts).","zh":"（多用于植物学或专业描述）内侧或内缘带有齿状突起的；内齿状的。"},"examples":[{"en":"The leaf margin is inner-toothed, with small serrations pointing inward.","zh":"叶缘呈内齿状，小锯齿朝向内侧。"},{"en":"Under a microscope, the inner-toothed surface helps the structure grip fibers.","zh":"在显微镜下可见，这种内齿状表面有助于结构抓住纤维。"}]}],"synonyms":["inward-toothed","serrated","toothed"],"phonetic":"ˌɪnərˈtuːθt","extraExplanation":["这个词比较少见，常出现在植物形态描述（如叶缘、萼片边缘）或对某些器件/结构表面的技术性描写中。日常英语里更常见的表达是：toothed on the inside / teeth on the inner edge。"],"etymology":"复合词：inner（内部的）+ toothed（有齿的）。用于把“齿状突起”具体定位在“内侧/内缘”。","mnemonic":["把它拆开记：inner（内侧）+ toothed（有齿的）= “内侧长牙/内侧有齿”。","联想中文“内齿”：看到 inner 就想到“内”，tooth 想到“齿”。"]}
{"word":"innerly","summary":{"en":"“Innerly” is a rare adverb meaning “inwardly; in one’s inner feelings or thoughts,” and it’s usually replaced by “inwardly” or “internally.”","zh":"“innerly”是个很少见的副词，意思是“在内心地/内在地”，通常用更常见的“inwardly”或“internally”来代替。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare) In an inner way; in one’s mind or feelings rather than outwardly.","zh":"（少见）在内心（或内在）地；指在想法、感受层面，而不是表面上。"},"examples":[{"en":"She smiled, but innerly she felt nervous.","zh":"她笑了，但内心其实很紧张。"},{"en":"He seemed calm; innerly, he was angry.","zh":"他看起来很冷静；其实内心很生气。"}]}],"synonyms":["inwardly","internally","deep down"],"phonetic":"/ˈɪnɚli/","extraExplanation":["“innerly”在现代英语里非常少见，更多时候人们会用更自然、更常见的副词：**inwardly**（在内心地）或 **internally**（在内部/内在地）。在写作或正式表达中，建议优先用 inwardly。","词形提示：**inner + -ly**（形容词 + 副词后缀）按构词法没问题，但习惯用法上不常用，所以读者可能觉得别扭或像非母语表达。"]}
{"word":"innermore","summary":{"en":"“Innermore” is not standard; it’s usually read as “inner more” (= deeper inside). Prefer “further inside,” “more inner,” or “innermost.”","zh":"“innermore”不是标准用词，通常会被当作“inner more”（更深入内部）。更推荐用“further inside / more inner / innermost”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually understood as a misspelling or as two words: “inner more” meaning “more inside / deeper within.” In most writing, use “more inner,” “further inside,” or “innermost” instead.","zh":"不是标准英语单词。通常会被理解为拼写错误，或当作两个词“inner more”（更靠里面／更深入内部）。正式写作中更常用“more inner”“further inside”或“innermost”。"},"examples":[{"en":"The phrase “inner more” could mean “deeper inside,” but “innermost” sounds more natural.","zh":"“inner more”可以表示“更深入内部”，但用“innermost”更自然。"},{"en":"She looked further inside the box, not just at the outer layer.","zh":"她往盒子里更深处看，而不只是看外层。"}]}],"synonyms":["further inside","deeper inside","more inward","innermost"],"phonetic":"ˌɪnɚ ˈmɔɹ","extraExplanation":["“innermore”在词典中几乎找不到，母语者也很少这样写；如果你想表达“最里面的”，常用innermost（如：the innermost room）。","如果你想表达“永远/一直”，常用evermore或forever（文学/诗歌里evermore更常见，如：for evermore）。","如果你能提供一句包含“innermore”的原句，我可以帮你判断它到底想表达哪一种意思，并给出更地道的改写。"]}
{"word":"innermost","summary":{"en":"Innermost means the deepest/most central part, or someone’s most private feelings and thoughts.","zh":"innermost 指“最里面的/最深处的”，也可指“内心最深处的（最私密的情感与想法）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The most central or deepest part, especially inside something.","zh":"最里面的；最深处的（尤指在某物内部）。"},"examples":[{"en":"Keep the documents in the innermost drawer of the desk.","zh":"把文件放在书桌最里面的抽屉里。"},{"en":"The innermost room of the temple is not open to visitors.","zh":"寺庙最里面的房间不对游客开放。"}]},{"partOfSpeech":"adj.","definition":{"en":"Someone’s most private thoughts, feelings, or true self.","zh":"内心最深处的；最隐秘的想法或感受。"},"examples":[{"en":"She shared her innermost fears with her best friend.","zh":"她把内心最深处的恐惧告诉了最好的朋友。"},{"en":"The poem expresses the writer’s innermost emotions.","zh":"这首诗表达了作者内心最深处的情感。"}]}],"synonyms":["deepest","inmost","most private","most central"],"phonetic":"/ˈɪnərˌmoʊst/","extraExplanation":["词形小提示：inner（内部的）+ -most（最……的）→ innermost（最内部的）。常见近义表达有 “the deepest part” “the very center”。","用法搭配：既可修饰具体地点/物体（innermost drawer/room/part），也可修饰抽象名词（innermost thoughts/feelings/secrets）。","常见文学/经典语感：英语里常用 “in the innermost …” 来营造“深入核心/直达内心”的感觉。"]}
{"word":"innermostly","summary":{"en":"“Innermostly” means “deep down; in your most private thoughts or feelings.”","zh":"“innermostly”意为“在内心最深处；打心底里”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the deepest or most private part of someone’s thoughts, feelings, or being; deep down.","zh":"在内心最深处；在最隐秘的思想或情感深处；打心底里。"},"examples":[{"en":"Innermostly, she feared that she would disappoint her family.","zh":"在内心最深处，她害怕自己会让家人失望。"},{"en":"He seemed calm, but innermostly he was anxious.","zh":"他表面很镇定，但内心深处其实很焦虑。"},{"en":"Innermostly, I knew I had to apologize.","zh":"打心底里，我知道我必须道歉。"}]}],"synonyms":["deep down","inwardly","in my heart","at heart"],"phonetic":"/ˈɪnərˌmoʊstli/","extraExplanation":["“innermostly”非常少见，更常用的说法是“deep down / in my heart / in the depths of my mind”。它由“innermost（最内心的）+ -ly（副词后缀）”构成，强调“最深层、最隐秘”的心理状态。"]}
{"word":"innerness","summary":{"en":"Innerness means the quality of being inward or deep within, often used in a literary or reflective sense.","zh":"Innerness 指“内在性/内心深处”，多带文学或反思色彩，现代英语中相对少用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being inner; inwardness; the deep internal part of something (often abstract).","zh":"“内在性；内里状态”；指某物的内部、内心或深层本质（多用于抽象表达）。"},"examples":[{"en":"Her writing has a quiet innerness that makes readers slow down and reflect.","zh":"她的写作带着一种安静的内在感，让读者放慢脚步去思考。"},{"en":"Meditation helped him notice his innerness instead of constantly chasing outside approval.","zh":"冥想帮助他留意自己的内在，而不是一直追求外界认可。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The inner part or interior of a place or object.","zh":"（较少用）某个地方或物体的内部、里面。"},"examples":[{"en":"The candle lit up the room’s innerness, revealing shapes in the corners.","zh":"蜡烛照亮了房间的内部，显出角落里的轮廓。"},{"en":"They explored the cave’s innerness carefully, step by step.","zh":"他们小心翼翼地一步步探索洞穴的内部。"}]}],"synonyms":["inwardness","inner life","interiority","depth","interior"],"phonetic":"/ˈɪnərnəs/","extraExplanation":["“innerness”在现代英语里不算常用，更常见的词是“inner life / inwardness / interior”。当你想表达更文学、更抽象的“内心深处的感觉或气质”时，才可能选用“innerness”。","构词上是 inner（内部的/内在的）+ -ness（把形容词变成名词，表示“……的状态/性质”），类似：kind → kindness，dark → darkness。"]}
{"word":"inners","summary":{"en":"“Inners” usually means the inside parts/layers of something, and more rarely (informally) members of an inner circle.","zh":"“inners”通常指某物的内部部分/内层；较少见地（非正式）指核心圈子成员、内部人士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the inside parts or layers of something; internal components","zh":"某物的内部部分；内层；内部构件"},"examples":[{"en":"After the storm, the tent’s inners were completely soaked.","zh":"暴风雨过后，帐篷的内层完全湿透了。"},{"en":"The engineers checked the machine’s inners to find the problem.","zh":"工程师检查了机器的内部构件来找出问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) people who belong to a private or influential group; insiders","zh":"（非正式）核心圈子里的人；内部人士"},"examples":[{"en":"Only the inners knew the real plan.","zh":"只有核心圈子的人才知道真正的计划。"},{"en":"She wasn’t one of the inners, so she heard the news later.","zh":"她不是内部人士，所以消息听得比较晚。"}]}],"synonyms":["insides","internal parts","components","inner layers","insiders"],"phonetic":"/ˈɪnɚz/","extraExplanation":["“inners”常见于口语或非正式写作里，多表示“内部的东西/内层”。正式表达里常用“the inside (of ...)”“internal parts/components”。\n\n表示“内部人士”时，更常见、也更标准的词是“insiders / people on the inside”。“inners”在这个意思上更少见，通常带一点圈内人/小圈子之感。"]}
{"word":"innersole","summary":{"en":"An innersole is a cushioned, supportive layer inside a shoe (often removable) that your foot rests on.","zh":"innersole 指鞋内的鞋垫/内垫层（常可拆卸），用于缓冲和支撑脚部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A removable inner layer inside a shoe that your foot rests on; it adds cushioning, support, warmth, or improves fit.","zh":"鞋垫；鞋内可拆卸的内层垫片，用于缓冲、支撑、保暖或改善合脚度。"},"examples":[{"en":"These shoes come with a soft innersole for extra comfort.","zh":"这双鞋自带柔软的鞋垫，更加舒适。"},{"en":"I replaced the innersoles to get better arch support.","zh":"我换了鞋垫来获得更好的足弓支撑。"},{"en":"If the innersole gets wet, take it out and let it dry.","zh":"如果鞋垫湿了，把它取出来晾干。"}]}],"synonyms":["insole","shoe insert","footbed"],"phonetic":"/ˈɪnərˌsoʊl/","extraExplanation":["常见拼写还有 insole，更常用；innersole 也能理解，但在商品说明里通常写 insole 或 removable insole。","相关词汇：arch support（足弓支撑）、cushioning（缓冲）、orthotic insole（矫形鞋垫/定制鞋垫）、liner（内衬）。","注意区分：innersole/insole（鞋垫，可拆卸或内置的一层） vs. outsole（外底，鞋子接触地面的部分） vs. midsole（中底，常见于运动鞋，负责缓震）。"]}
{"word":"innersoles","summary":{"en":"Innersoles are the inner bottoms of shoes or inserts placed inside shoes for comfort or support.","zh":"Innersoles 指鞋的内底或放入鞋内用于舒适和支撑的鞋垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the inner part of a shoe that your foot rests on; an insert placed inside a shoe for comfort or support","zh":"鞋的内底（脚踩着的那一层）；也指放进鞋里用来增加舒适度或支撑的鞋垫/内垫"},"examples":[{"en":"These innersoles are soft and make my shoes more comfortable.","zh":"这些内底很软，让我的鞋更舒服。"},{"en":"He replaced the innersoles because they were worn out.","zh":"他把内底换掉了，因为已经磨损了。"},{"en":"I use supportive innersoles when I run.","zh":"我跑步时会用有支撑力的内底（鞋垫）。"}]}],"synonyms":["insoles","shoe inserts","footbeds","orthotic insoles"],"phonetic":"/ˈɪnərˌsoʊlz/","extraExplanation":["常见相关词：sole（鞋底的总称）、outsole（外底/接触地面的那层）、insole 或 innersole（内底/鞋垫）。在日常英语里更常用 insole；innersole 也能理解，但频率较低。","如果是用于矫正足弓或医疗用途的“功能鞋垫”，也常叫 orthotic / orthotic insole。"]}
{"word":"innerspring","summary":{"en":"An innerspring is a mattress (or cushion) built with metal coil springs inside.","zh":"innerspring 指内部有金属弹簧圈支撑的床垫（或坐垫），即弹簧床垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of mattress (or furniture cushion) that uses a system of metal coil springs inside for support","zh":"（床垫或坐垫的）内置弹簧结构；弹簧床垫（使用金属弹簧圈提供支撑）"},"examples":[{"en":"We chose an innerspring mattress because it feels more supportive.","zh":"我们选了弹簧床垫，因为感觉支撑性更好。"},{"en":"This innerspring is too firm for me; I prefer a softer mattress.","zh":"这款弹簧床垫对我来说太硬了；我更喜欢软一点的。"},{"en":"The hotel bed was an old innerspring, and it squeaked when I moved.","zh":"酒店的床是旧式弹簧床垫，我一翻身就会吱吱响。"}]}],"synonyms":["spring mattress","coil-spring mattress"],"phonetic":"/ˈɪnərsprɪŋ/","extraExplanation":["在北美，“innerspring (mattress)”很常见，常与“memory foam（记忆棉）”“latex（乳胶）”“hybrid（混合：弹簧+泡棉）”对比。一般来说，弹簧床垫透气性较好、弹性明显，但如果做工或材料较普通，可能更容易出现“吱响（squeak）”或局部塌陷。","拼写上也常写作 innerspring；有时会看到 inerspring（少见，通常被视为拼写错误）。"]}
{"word":"innervate","summary":{"en":"To innervate is mainly a medical verb meaning “to supply with nerves,” and more rarely a formal verb meaning “to energize or invigorate.”","zh":"innervate 主要是医学动词，指“给予神经支配/神经分布”；较少见的正式用法是“使振奋、注入动力”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Medicine/biology) To supply an organ or body part with nerves; to connect nerves to it so it can send and receive signals.","zh":"（医学/生物）支配（器官或身体部位）；使其获得神经分布，以便传递神经信号。"},"examples":[{"en":"The facial nerve innervates the muscles used for smiling and frowning.","zh":"面神经支配用于微笑和皱眉的肌肉。"},{"en":"Damage to the nerve can prevent it from properly innervating the hand.","zh":"神经受损会导致它无法正常支配手部。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative, formal) To give energy, strength, or motivation to someone or something; to invigorate.","zh":"（引申义，正式）使振奋；给予力量或动力；激励。"},"examples":[{"en":"The coach’s speech innervated the team before the final game.","zh":"教练的讲话在决赛前激励了球队。"},{"en":"A sense of purpose innervated her work.","zh":"使命感为她的工作注入了动力。"}]}],"synonyms":["supply with nerves","nerve","stimulate","energize","invigorate","motivate"],"phonetic":"/ɪˈnɝːveɪt/","extraExplanation":["词源上与“nerve（神经）”同源：in-（使进入）+ nerve 的拉丁词根（nervus）。因此在医学语境中含义非常具体：某条神经“支配/控制”某块肌肉或器官。","引申义“使振奋”在现代英语中相对少见，阅读时遇到多半是较正式或文学化的用法；日常表达更常用 energize / motivate / invigorate。"]}
{"word":"innervated","summary":{"en":"“Innervated” means “supplied with nerves; controlled or activated by nerves,” often used in medical or biology contexts.","zh":"“innervated”指“受神经支配的/有神经分布的”，多用于医学或生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Supplied with nerves; having nerve fibers that control sensation or movement.","zh":"（生物/医学）受神经支配的；有神经纤维分布、负责感觉或运动控制的。"},"examples":[{"en":"The tongue is richly innervated, which is why it’s so sensitive to touch and taste.","zh":"舌头的神经分布非常丰富，所以它对触觉和味觉特别敏感。"},{"en":"After the injury, the doctor checked whether the muscle was still properly innervated.","zh":"受伤后，医生检查那块肌肉是否仍然得到正常的神经支配。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “innervate”: to supply (a body part) with nerves or to activate it via nerves.","zh":"“innervate”的过去式/过去分词：使（身体部位）有神经分布；通过神经支配/激活。"},"examples":[{"en":"The facial muscles are innervated by the facial nerve.","zh":"面部肌肉由面神经支配。"},{"en":"This region is innervated mainly by branches of the trigeminal nerve.","zh":"该区域主要由三叉神经的分支支配。"}]}],"synonyms":["supplied with nerves","nerve-supplied","neural (in some contexts)"],"phonetic":"ˈɪnərˌveɪtɪd","extraExplanation":["“innervated”常见于解剖学、神经科学和临床描述，用来说明某块皮肤、器官或肌肉“由哪条神经负责”。常与by连用：be innervated by…（由……神经支配）。","注意不要和 enervated 混淆：enervated 意为“使人虚弱/无力的；筋疲力尽的”，和神经支配无关，拼写相近但含义差别很大。"]}
{"word":"innervates","summary":{"en":"“Innervates” means a nerve supplies and controls a body part; more formally, it can also mean to energize or strengthen.","zh":"“innervates”主要指神经支配身体部位；在较正式表达中也可指赋予活力或力量。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a nerve) to supply a part of the body with nerves, especially to control movement or sensation.","zh":"（神经）支配（身体某部位），为其提供神经连接，尤其与运动或感觉控制有关。"},"examples":[{"en":"The facial nerve innervates muscles that help you smile and blink.","zh":"面神经支配帮助你微笑和眨眼的肌肉。"},{"en":"These sensory fibers innervate the skin, allowing you to feel touch and pain.","zh":"这些感觉纤维支配皮肤，使你能感受到触摸和疼痛。"}]},{"partOfSpeech":"vt.","definition":{"en":"More generally, to give energy, vitality, or strength to something (often used in formal or literary writing).","zh":"（更广义、较正式/文学）赋予活力或力量；使振奋。"},"examples":[{"en":"A shared purpose innervates the team during difficult times.","zh":"共同的目标在困难时期赋予团队力量。"},{"en":"The speech innervates the audience with hope.","zh":"这场演讲用希望激励了听众。"}]}],"synonyms":["supply with nerves","nerve","enervate (NOT same meaning)","energize","invigorate","inspire"],"phonetic":"/ɪˈnɝːveɪts/","extraExplanation":["“innervates”是动词“innervate”的第三人称单数（he/she/it innervates）。医学/解剖学语境里最常见，常见搭配有“innervate a muscle/organ/region（支配某块肌肉/器官/区域）”。","在科学写作中经常出现被动语态：“is innervated by …（由……神经支配）”，例如：“The diaphragm is innervated by the phrenic nerve.”（膈肌由膈神经支配）。","“赋予活力/力量”的引申义更偏书面与文学表达，日常英语里更常用“energize, inspire, invigorate”等词。"]}
{"word":"innervating","summary":{"en":"“Innervating” means supplying a body part with nerves or stimulating it through nerves; it’s the -ing form of “innervate.”","zh":"“innervating”指对身体部位进行神经支配或通过神经进行刺激；是动词“innervate”的-ing形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine/biology) Supplying an organ or body part with nerves; affecting it through nerve signals.","zh":"（医学/生物）对器官或身体部位进行神经支配的；通过神经信号影响其功能的。"},"examples":[{"en":"The vagus nerve is important for innervating the heart and many digestive organs.","zh":"迷走神经对心脏以及许多消化器官的神经支配非常重要。"},{"en":"Damage to the nerves innervating the hand can cause weakness or numbness.","zh":"支配手部的神经受损可能导致无力或麻木。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “innervate”: to supply an organ or body part with nerves, or to stimulate it via nerves.","zh":"“innervate”的现在分词：使某器官/部位获得神经支配；或通过神经刺激使其活动。"},"examples":[{"en":"Motor neurons are innervating the muscle fibers, causing them to contract.","zh":"运动神经元正在支配肌纤维，使其收缩。"},{"en":"Surgeons try to avoid cutting nerves innervating the facial muscles.","zh":"外科医生会尽量避免切断支配面部肌肉的神经。"}]}],"synonyms":["supplying nerves to","neural control (context-dependent)","nerve supply (noun phrase)"],"phonetic":"/ɪˈnɝːveɪtɪŋ/","extraExplanation":["“innervating/innervate”是医学英语里非常常见的词，多用于解剖学、生理学、神经科学文章。日常英语里很少用，通常会改说“the nerve supplies…”（某神经供应/支配…）或“controls…”（控制…）。","词形提示：innervate（动词 原形）→ innervating（现在分词/进行时/作形容词）→ innervated（过去式/过去分词）。常见搭配：nerves innervating + body part（支配…的神经）、innervate a muscle/organ（支配某肌肉/器官）。"]}
{"word":"innervation","summary":{"en":"Innervation means the nerve supply to a body part, or the process of nerves connecting to it.","zh":"Innervation 指某部位的神经支配，或神经与该部位建立连接的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The supply of nerves to a body part or organ, allowing it to feel sensations and/or control movement.","zh":"（解剖/生理）神经支配：神经分布到某个身体部位或器官，使其产生感觉和/或控制运动。"},"examples":[{"en":"Damage to the nerve can reduce the innervation of the hand, causing weakness or numbness.","zh":"神经受损会减少手部的神经支配，导致无力或麻木。"},{"en":"Doctors checked the muscle’s innervation to understand why it wasn’t moving normally.","zh":"医生检查了肌肉的神经支配情况，以了解它为什么不能正常运动。"}]},{"partOfSpeech":"n.","definition":{"en":"The process by which nerves develop in or connect to a tissue or organ.","zh":"（发育/连接过程）神经进入并连接到组织或器官的过程（神经化/神经支配形成）。"},"examples":[{"en":"During development, proper innervation is essential for coordinated movement.","zh":"在发育过程中，正确的神经支配形成对协调运动至关重要。"},{"en":"Researchers studied innervation in the skin to learn how touch sensitivity develops.","zh":"研究人员研究皮肤的神经支配形成，以了解触觉敏感性如何发展。"}]}],"synonyms":["nerve supply","neural supply","neural innervation"],"phonetic":"/ˌɪnɚˈveɪʃən/","extraExplanation":["词源提示：innervation 来自 in-（进入）+ nerve（神经）相关词根，整体意思就是“神经进入并支配某处”。","常见搭配：sensory innervation（感觉神经支配）、motor innervation（运动神经支配）、nerve innervation（神经支配，略显重复但在医学语境中常见）。","易混词：innervate（v. 使……受神经支配）。注意它在现代医学中通常指“提供神经支配”，而不是“让人紧张/刺激”。"]}
{"word":"innervational","summary":{"en":"“Innervational” means “related to nerve supply (innervation)” and is mainly used in medical/anatomy contexts.","zh":"“innervational”意为“与神经支配有关的”，主要用于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the supply of nerves to a part of the body (innervation), especially in anatomy and medicine.","zh":"与（身体某部位的）神经支配有关的；神经支配的（常用于解剖学与医学语境）。"},"examples":[{"en":"Doctors examined the patient’s innervational pattern to understand the cause of muscle weakness.","zh":"医生检查了患者的神经支配模式，以了解肌无力的原因。"},{"en":"Damage to the nerve can change the innervational control of the hand.","zh":"神经受损会改变手部的神经支配控制。"}]}],"synonyms":["innervatory","neural","neurological","nerve-related"],"phonetic":"/ˌɪnərˈveɪʃənəl/","extraExplanation":["“innervational”是较偏专业、较少见的形容词，更常见的写法是“innervatory”或直接用“innervation”（名词，如 nerve innervation）。在医学论文或解剖学描述中，你也会看到“innervated”（被神经支配的）来表达类似意思。"]}
{"word":"innervations","summary":{"en":"“Innervations” means the nerve supply to body parts, or the process of supplying nerves.","zh":"“innervations”指身体部位的神经支配（神经供应），也可指神经支配的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The supply of nerves to a body part (such as a muscle or organ), enabling movement or sensation.","zh":"（解剖/生理）神经支配：某个身体部位（如肌肉或器官）所获得的神经供应，使其能够产生运动或感觉。"},"examples":[{"en":"Damage to the nerve can change the innervation of the hand, making it weak or numb.","zh":"神经受损会改变手部的神经支配，导致无力或麻木。"},{"en":"The doctor tested muscle strength to check whether its innervation was normal.","zh":"医生检查肌力来判断该肌肉的神经支配是否正常。"}]},{"partOfSpeech":"n.","definition":{"en":"In anatomy, the act or process of supplying nerves to a body part.","zh":"（解剖）神经支配的过程：神经向某个组织分布、连接并发挥作用的过程。"},"examples":[{"en":"During development, innervation of the limb occurs in stages.","zh":"在发育过程中，四肢的神经支配是分阶段完成的。"},{"en":"Researchers studied the innervation of facial muscles to better understand expression.","zh":"研究人员研究面部肌肉的神经支配，以更好理解表情机制。"}]}],"synonyms":["nerve supply","nerve distribution"],"phonetic":"/ˌɪnərˈveɪʃənz/","extraExplanation":["“innervations”是复数形式；单数是“innervation”。在医学语境里常见搭配有：nerve innervation（神经支配）、sensory innervation（感觉神经支配）、motor innervation（运动神经支配）。","词源提示：in-（使……进入/向内）+ nerve（神经）相关词根，整体含义就是“使某部位获得神经连接/支配”。"]}
{"word":"innervatory","summary":{"en":"connected with nerve supply and control of body tissues","zh":"与器官/组织的神经支配与控制有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the supply or control of an organ or tissue by nerves (innervation).","zh":"与“神经支配/神经传入传出”有关的；指神经对器官或组织的供给与控制。"},"examples":[{"en":"Damage to the innervatory pathways can reduce muscle strength.","zh":"神经支配通路受损会降低肌力。"},{"en":"The study focused on innervatory patterns in the hand muscles.","zh":"这项研究关注手部肌肉的神经支配模式。"}]}],"synonyms":["neural","nervous","innervational"],"phonetic":"/ˌɪnərˈveɪtɔri/","extraExplanation":["在医学英语里，更常见的说法是 innervation（名词：神经支配）和 innervate（动词：使……受神经支配）。你也可能见到 innervational（形容词），用法与 innervatory 接近，但出现频率更高。"],"etymology":"源自拉丁语词根 in-（使……进入）+ nervus（神经）相关构词，核心概念是“innervate（使获得神经支配）”。“innervatory”是较少见的形容词形式，常见于解剖学与生理学语境。","mnemonic":["把它拆开记：inner（里面的）+ nerve（神经）→“里面的神经系统在管控/支配”。","联想中文：innerv-≈“in nerve（进到神经里）”→“神经支配相关”。"]}
{"word":"innerve","summary":{"en":"Innerve means to supply a body part with nerves, or (figuratively) to give strength and motivation.","zh":"Innerve 指“为……提供神经支配”，也可引申为“使振奋、给予力量与动力”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(biology) To supply with nerves; to provide nerve connections to a body part or organ.","zh":"（生物）使（器官/组织）具有神经支配；为……提供神经连接。"},"examples":[{"en":"The sciatic nerve innerve(s) the muscles of the leg.","zh":"坐骨神经支配腿部肌肉。"},{"en":"Damage to the nerves that innerve the hand can reduce sensation and movement.","zh":"支配手部的神经受损会降低感觉和运动能力。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) To give strength, energy, or courage to; to stimulate or motivate.","zh":"（比喻）使振奋；给予力量/勇气；激励。"},"examples":[{"en":"Her words innerved the team to keep going despite setbacks.","zh":"她的话激励团队即使遇到挫折也要坚持下去。"},{"en":"A clear purpose can innerve people to work through difficult times.","zh":"明确的目标能让人在艰难时期更有干劲。"}]}],"synonyms":["innervate","supply with nerves","energize","inspire","encourage"],"phonetic":"/ɪˈnɝv/","extraExplanation":["“innerve”来自拉丁语 in-（使……进入）+ nervus（神经）。在现代英语里，它更常见于医学/生物学写作中；日常表达里，表示“激励/鼓舞”时通常会用 inspire、energize、encourage 等更常用的词。","拼写提示：innerve 不是 “innervate” 的错误拼法，但 innervate 在专业语境里更常见。"]}
{"word":"innerved","summary":{"en":"“Innerved” is a rare word meaning “encouraged/strengthened (made more confident or determined).”","zh":"“innerved”是较少见的词，意思是“受到鼓舞/变得更坚定（更有信心或决心）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person) mentally strengthened; encouraged or supported so you feel more confident or determined.","zh":"（指人）受到鼓舞的；精神上更坚定的；被支持后更有信心的。"},"examples":[{"en":"After her coach praised her effort, she felt innerved and ready to compete again.","zh":"教练表扬了她的努力后，她受到鼓舞，准备再次参赛。"},{"en":"The community’s support innerved him during a difficult time.","zh":"社区的支持在艰难时期鼓舞了他。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form/participle of a rare verb meaning “to provide with nerves; to strengthen the inner power.” In modern English, people usually say “encouraged,” “emboldened,” or “strengthened.”","zh":"一个较少见动词的过去式/过去分词，意思是“赋予力量/勇气；增强内在力量”。现代英语更常用 encouraged、emboldened 或 strengthened。"},"examples":[{"en":"The speech innerved the listeners to speak up.","zh":"那场演讲鼓起了听众的勇气，让他们敢于发声。"}]}],"synonyms":["encouraged","emboldened","heartened","strengthened","reassured"],"phonetic":"/ɪˈnɝvd/","extraExplanation":["“innerved”较少见，容易与“unnerved”（使人紧张/失去镇定）混淆。两者意思相反：innerved = 更有勇气/更坚定；unnerved = 变得不安/失去冷静。","词源上与“nerve（神经/勇气）”有关，在较旧或文学化的语境中可能出现；日常表达更建议用 encouraged / emboldened / reassured / strengthened。"]}
{"word":"innerves","summary":{"en":"“Innerves” is the third-person singular form of “innerve,” meaning (1) to supply an organ/body part with nerves, or (2) (literary) to energize or strengthen.","zh":"“innerves”是“innerve”的第三人称单数形式，意思是（1）神经支配/提供神经连接；（2）（文学用法）使振奋、赋予力量。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a nerve) to supply an organ or body part with nerves; to connect nerves to a muscle, gland, or tissue.","zh":"（神经）支配（某器官或身体部位）；为（肌肉/腺体/组织）提供神经连接。"},"examples":[{"en":"The facial nerve innerves the muscles used for smiling.","zh":"面神经支配用于微笑的肌肉。"},{"en":"Damage to the nerve can affect the area it innerves.","zh":"神经受损会影响它所支配的区域。"}]},{"partOfSpeech":"v.","definition":{"en":"(literary, less common) to give energy, strength, or a strong feeling to someone; to stimulate or enliven.","zh":"（文学用法，较少见）赋予力量或活力；激励；使振奋。"},"examples":[{"en":"The speech innerved the crowd and pushed them to act.","zh":"这场演讲鼓舞了人群，促使他们采取行动。"},{"en":"She felt innerved by the challenge.","zh":"她因挑战而感到振奋。"}]}],"synonyms":["innervate","supply (with nerves)","energize","enliven","stimulate"],"phonetic":"/ɪˈnɝːv/","extraExplanation":["“innerves”是动词“innerve”的第三人称单数现在时：He/She/It innerves...；过去式/过去分词常见为“innerved”。","医学语境中更常用的是“innervate”（意思几乎相同，更常见、更标准）；在非医学语境里，“innerve”有时带有文学色彩，表示“使充满力量/情感”。"]}
{"word":"innerving","summary":{"en":"“Innerving” can mean “unsettling” in informal use, but it also commonly appears in medical contexts as the -ing form of “innervate” (to supply nerves to a body part).","zh":"“innerving”口语里有时被用来表示“让人不安”，但它也常见于医学语境，作为“innervate（神经支配）”的 -ing 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making someone feel nervous, uneasy, or unsettled (often used like “unnerving”).","zh":"让人紧张、不安、心里发毛的（常被当作“unnerving”的用法）。"},"examples":[{"en":"The silence in the empty hallway was innerving.","zh":"空走廊里的寂静让人心里发毛。"},{"en":"It’s innerving to realize you forgot your phone on the train.","zh":"意识到把手机忘在火车上会让人很不安。"}]},{"partOfSpeech":"v.","definition":{"en":"Supplying nerves to a body part; controlling it through nerves (the -ing form of “innervate,” used in medical/scientific writing).","zh":"为某个身体部位提供神经支配；通过神经控制（“innervate”的 -ing 形式，多用于医学/科研语境）。"},"examples":[{"en":"The facial nerve is innerving the muscles used for smiling.","zh":"面神经支配用于微笑的肌肉。"},{"en":"Researchers studied the neurons innerving the diaphragm.","zh":"研究人员研究了支配膈肌的神经元。"}]}],"synonyms":["unnerving","unsettling","disturbing","nerve-wracking","disquieting"],"phonetic":"/ɪˈnɝːvɪŋ/","extraExplanation":["日常英语里，表达“让人不安/紧张”更常用的是 **unnerving**（以 un- 表示“使人失去镇定”）。你输入的 **innerving** 在一般写作中常被视为拼写误用，但在医学领域它也可能是 **innervate**（神经支配）的现在分词，用法完全不同。","记忆法：**unnerving = make you nervous**（让你紧张）；**innervate = give nerves to**（给予神经支配）。"]}
{"word":"inness","summary":{"en":"“Inness” is mainly a surname, especially referring to the American painter George Inness.","zh":"“Inness”主要作姓氏，常指美国画家乔治·英内斯。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), best known from the American landscape painter George Inness (1825–1894).","zh":"姓氏（家族名）；最常见的联想是美国风景画家乔治·英内斯（George Inness，1825–1894）。"},"examples":[{"en":"The museum has a quiet landscape by Inness in its American collection.","zh":"那家博物馆的美国馆藏里有一幅英内斯的宁静风景画。"},{"en":"I read an article comparing Inness with other 19th‑century landscape painters.","zh":"我读过一篇文章，把英内斯和其他19世纪的风景画家作比较。"}]}],"synonyms":["(surname)"],"phonetic":"/ˈɪnəs/","extraExplanation":["“inness”本身不是常见英语单词；如果你想查的是常用词，可能是拼写接近的：\n- “illness”（疾病）\n- “inness”也可能是把 “-ness”（名词后缀，如 happiness）误当成一个单词\n你可以告诉我你看到它的句子或上下文，我能帮你确认最可能的目标词与意思。"]}
{"word":"innest","summary":{"en":"“Innest” is a rare/old-fashioned superlative meaning “most inner,” usually expressed today as “innermost.”","zh":"“innest”是较罕见/古旧的说法，表示“最里面的”，现代通常用“innermost”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare or archaic) The most inner; deepest inside. Commonly replaced by “innermost.”","zh":"（罕见或古旧）最里面的；最深处的。通常用“innermost”。"},"examples":[{"en":"At the innest chamber of the temple, only priests were allowed to enter.","zh":"在寺庙最深处的内殿，只有祭司才被允许进入。"},{"en":"She kept her hopes in her innest heart, not ready to share them.","zh":"她把希望藏在内心最深处，还没准备好分享。"}]}],"synonyms":["innermost","deepest","inmost"],"phonetic":"/ˈɪnɚst/","extraExplanation":["“innest”是“inner”的一种非常少见的最高级形式；现代英语几乎都用“innermost”。因此在写作、考试或正式场合建议用“innermost”。","你更可能在旧文学、仿古写作或诗歌里看到“innest”，用来营造古典或抒情的语感。"]}
{"word":"innet","summary":{"en":"“Innet” is a rare dialect/archaic word meaning “inner,” and it can also mean “to bring in and store crops.”","zh":"“innet”是少见的方言/古用词，可指“内部的”，也可作动词表示“把庄稼收进来并储存”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dialect/archaic, esp. Scottish) Inner; located on the inside.","zh":"（方言/古用，尤指苏格兰）内部的；里面的。"},"examples":[{"en":"He felt a quiet innet peace after the long walk.","zh":"长途步行后，他感到一种安静的内心平和。"},{"en":"Keep the innet pocket for valuables.","zh":"把贵重物品放在内侧口袋里。"}]},{"partOfSpeech":"v.","definition":{"en":"(dialect/archaic) To bring in and store a crop (such as hay or grain), especially into a barn.","zh":"（方言/古用）把（干草、谷物等）收进来并储存起来（尤指收进谷仓）。"},"examples":[{"en":"They worked all day to innet the hay before the rain.","zh":"他们干了一整天，赶在下雨前把干草收进来。"},{"en":"Farmers would innet the grain after harvest.","zh":"农民会在收割后把谷物收贮起来。"}]}],"synonyms":["inner","inward","bring in","store","stow"],"phonetic":"/ˈɪnət/","extraExplanation":["“innet”在现代英语里很少见，更多出现在苏格兰英语/方言或较旧的文本中；日常交流中通常用“inner”（内部的）或“bring in / store”（收进来并储存）。","学习者常把“innet”误当作“internet”（互联网）或“innate”（天生的、先天的）。如果你想查的是其中一个词，也可以告诉我，我会给出对应解释与例句。"]}
{"word":"innholder","summary":{"en":"An innholder is a person who runs or owns an inn.","zh":"innholder 指经营或拥有小旅馆/客栈的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who owns or manages an inn (a small hotel or guesthouse).","zh":"旅店老板；小客栈（小旅馆）的经营者/管理者。"},"examples":[{"en":"The innholder welcomed us and showed us to our room.","zh":"旅店老板欢迎了我们，并带我们去房间。"},{"en":"In the story, the innholder hears travelers’ news from many places.","zh":"在故事里，旅店老板从各地旅人那里听到许多消息。"}]}],"synonyms":["innkeeper","host","landlord (of an inn)","proprietor"],"phonetic":"/ˈɪnˌhoʊldɚ/","extraExplanation":["“Innholder”是比较传统/文学感的用词，现代英语里更常见的是“innkeeper”或更泛用的“hotel owner / manager”。在英美文学或历史题材中，innholder常出现在描写旅途、驿站、客栈的场景里。"]}
{"word":"inning","summary":{"en":"An inning is a division of a game (especially baseball/softball) when teams take turns batting and fielding; it can also mean a person’s or group’s period of opportunity.","zh":"inning 指（棒球/垒球）“一局”，也可比喻为某人或某群体“发挥作用的一段时期/机会”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In baseball or softball, one of the nine (or more) equal parts of a game, in which each team gets a turn to bat and a turn to field.","zh":"（棒球/垒球）一局；比赛被分成若干等份，每局双方各有一次进攻（打击）和防守（守备）的机会。"},"examples":[{"en":"The score was 2–1 after the first inning.","zh":"第一局结束后比分是2比1。"},{"en":"He struck out two batters in the seventh inning.","zh":"他在第七局三振了两名打者。"},{"en":"The game went into extra innings.","zh":"比赛进入了延长局。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular period or ‘turn’ in an activity or situation (often used in the phrase “have your inning”).","zh":"（比喻）一段时期；（做某事的）轮次/机会（常见于短语“have your inning”）。"},"examples":[{"en":"Every generation has its inning to shape the future.","zh":"每一代人都有自己塑造未来的一段时期。"},{"en":"Let her have her inning—she’s earned a chance to lead.","zh":"让她上场/让她当一回主角吧——她值得一次带领大家的机会。"}]}],"synonyms":["frame","round","period","stretch","turn"],"phonetic":"/ˈɪnɪŋ/","extraExplanation":["在美式棒球里，一场常规比赛通常是9局（innings）；每一局分为上半局（top of the inning，客队进攻）和下半局（bottom of the inning，主队进攻）。如果打平，可能会进入延长局（extra innings）。","在板球（cricket）中也用 inning，但更常见的拼写是 innings（既可作单数也可作复数，视地区与语境而定）。"]}
{"word":"innings","summary":{"en":"“Innings” most commonly means the parts of a baseball/softball game called innings, and it can also mean a stage in a longer process (especially an early stage).","zh":"“innings”最常指棒球/垒球比赛中的“局”，也可比喻指一个较长过程中的某个阶段（尤其是早期阶段）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A division of a baseball or softball game in which each team has a turn to bat and a turn to field (one half is a “top” or “bottom” inning).","zh":"（棒球/垒球）“局”：比赛的一个分段；每队在一局中各有一次进攻（打击）和防守（守备）的机会（上半局/下半局）。"},"examples":[{"en":"The game was tied at 2–2 in the seventh inning.","zh":"比赛在第七局时以2比2打平。"},{"en":"He hit a home run in the bottom of the ninth inning.","zh":"他在第九局下半局打出了一记全垒打。"}]},{"partOfSpeech":"n.","definition":{"en":"A stage or period in a process, especially an early or middle stage (often used in business, politics, or planning).","zh":"（比喻）阶段、时期；尤指某个过程的早期或中期（常用于商业、政治或规划语境）。"},"examples":[{"en":"We’re still in the early innings of the project, so plans may change.","zh":"我们还处在项目的早期阶段，所以计划可能会变。"},{"en":"The company is in the first innings of expanding overseas.","zh":"这家公司正处于海外扩张的起步阶段。"}]}],"synonyms":["inning","stage","phase","period","round"],"phonetic":"ˈɪnɪŋz","extraExplanation":["“Innings”来自“inning”（单数）加复数 -s。口语里常说“top of the inning（上半局）/ bottom of the inning（下半局）”。","英式英语里“innings”在板球（cricket）中也很常见：一队的一次打击阶段叫 an innings（单数），复数可指多次打击阶段；而在棒球里通常谈的是每一局（inning）的上下半局结构。","比喻用法（in the early innings）源自棒球，意思是“还早、才刚开始”，带有“别急着下结论”的语气。"]}
{"word":"inninmorite","summary":{"en":"“In memoriam” means “in memory of” and is used to honor someone who has died.","zh":"“in memoriam”意为“为纪念（已故之人）”，常用于题献、讣告或纪念文字。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"in memory of someone who has died; used in dedications, obituaries, or on memorials","zh":"为纪念已故的人；常用于题献、讣告或纪念碑（墓碑）等"},"examples":[{"en":"This book is dedicated in memoriam to my father.","zh":"本书题献给我的父亲，以作纪念。"},{"en":"A small plaque was placed in memoriam near the old tree.","zh":"在那棵老树旁放了一块小牌匾以作纪念。"}]}],"synonyms":["in memory of","in remembrance of"],"phonetic":"/ˌɪn məˈmɔriəm/","extraExplanation":["“in memoriam”是拉丁语，字面意思是“在记忆中/为了纪念”。英语里常直接用这句拉丁短语，出现在讣告、追思文章、墓碑刻字或作品题献中。","常见相关表达：in memory of（更口语、更常用）；a memorial for/to sb（为某人设立的纪念物/纪念活动）。"]}
{"word":"innisfail","summary":{"en":"Innisfail is a proper noun used as a town name, especially in Australia (Queensland) and Canada (Alberta).","zh":"Innisfail 是专有名词，常用作城镇名称，尤其指澳大利亚昆士兰州和加拿大阿尔伯塔省的同名城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name used for towns, especially Innisfail in Queensland, Australia, and Innisfail in Alberta, Canada","zh":"一个地名，常指城镇名称，尤其是澳大利亚昆士兰州的 Innisfail，以及加拿大阿尔伯塔省的 Innisfail"},"examples":[{"en":"Innisfail, Queensland is known for its tropical weather and nearby rainforest.","zh":"澳大利亚昆士兰州的 Innisfail 以热带气候和附近的雨林而闻名。"},{"en":"She moved to Innisfail, Alberta for work.","zh":"她为了工作搬到了加拿大阿尔伯塔省的 Innisfail。"}]}],"phonetic":"/ˈɪnɪsˌfeɪl/","extraExplanation":["“Innisfail”源自盖尔语（常写作“Inis Fáil”），是爱尔兰的诗意别称之一，常被解释为“命运之岛/预言之岛”。一些英语国家的城镇使用这个名字，带有文化与历史上的爱尔兰意象。","作为专有名词，它通常不翻译，直接音译或保留原拼写；使用时常在后面加地区来避免歧义（如 Innisfail, Queensland / Innisfail, Alberta）。"]}
{"word":"innitency","summary":{"en":"Inattention means a lack of focus or careful notice—being careless or distracted.","zh":"Inattention 指注意力不集中或疏忽，表现为不够留心或分心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of attention; not paying careful notice.","zh":"注意力不集中；疏忽；不留心。"},"examples":[{"en":"The mistake happened because of inattention to detail.","zh":"这个错误是因为对细节不够留心而发生的。"},{"en":"Inattention in class can make it harder to understand the lesson.","zh":"上课不专心会让理解课程变得更难。"}]},{"partOfSpeech":"n.","definition":{"en":"A moment or period when you are not focused; distraction.","zh":"走神的一刻；分心的时期。"},"examples":[{"en":"A brief inattention to the road can cause an accident.","zh":"开车时哪怕短暂走神也可能引发事故。"},{"en":"During his inattention, he missed an important announcement.","zh":"他走神时错过了一条重要通知。"}]}],"synonyms":["carelessness","distraction","lack of attention","heedlessness"],"phonetic":"/ˌɪnəˈtɛnʃən/","extraExplanation":["“innitency”不是常见或标准的英语单词拼写。你可能想写的是 **inattention**（疏忽/不专心）或 **inattentiveness**（不专心的状态）。如果你告诉我上下文句子，我也可以帮你确认最合适的词。","**inattention** 常用于固定搭配：**inattention to detail**（对细节不够注意/疏忽）。在学习和工作场景里很常见。"]}
{"word":"innkeeper","summary":{"en":"An innkeeper is the owner or manager of an inn (a small hotel).","zh":"innkeeper指旅店/客栈的老板或经营者（类似小旅馆的管理者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who owns or manages an inn (a small hotel or place that provides lodging, and often food and drink).","zh":"旅店老板；客栈经营者（经营或管理提供住宿、常也提供餐饮的旅店/小旅馆的人）。"},"examples":[{"en":"The innkeeper greeted us warmly and showed us to our room.","zh":"旅店老板热情地迎接我们，并带我们去房间。"},{"en":"Ask the innkeeper where the best local restaurant is.","zh":"问问旅店老板哪家本地餐馆最好。"},{"en":"In many stories, the innkeeper hears travelers’ news first.","zh":"在许多故事里，旅店老板往往最先听到旅人的消息。"}]}],"synonyms":["host","proprietor","hotelier"],"phonetic":"/ˈɪnˌkiːpər/","extraExplanation":["“innkeeper”由“inn（旅店/小客栈）+ keeper（看管者/经营者）”组成，字面意思是“经营旅店的人”。在英美文化与文学中，inn（客栈）常出现在旅行、冒险或乡村背景里，因此innkeeper也常被塑造成消息灵通、善于与人打交道的角色。","相关词对比：hotelier更偏正式、用于酒店业；landlord在英式英语中可指酒吧/旅馆老板，但更常见意思是“房东”。"]}
{"word":"innkeepers","summary":{"en":"Innkeepers are people who own or run an inn (a small, often traditional lodging place).","zh":"innkeepers 指经营或管理客栈/小旅馆的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who own or manage an inn (a small hotel or lodging place, often traditional or family-run).","zh":"旅店老板；客栈经营者（经营或管理小型旅馆/客栈的人，常带有传统或家庭式的意味）。"},"examples":[{"en":"The innkeepers welcomed us with tea and showed us to our room.","zh":"旅店老板用茶招待我们，并带我们去房间。"},{"en":"In many villages, innkeepers also act as local guides for travelers.","zh":"在许多村庄里，旅店老板也会充当旅行者的向导。"},{"en":"The innkeepers asked guests to be quiet after 10 p.m.","zh":"旅店老板要求客人在晚上十点后保持安静。"}]}],"synonyms":["hosts","inn owners","lodging proprietors"],"phonetic":"/ˈɪnˌkiːpərz/","extraExplanation":["“innkeeper”由“inn（客栈/小旅馆）+ keeper（看管者/经营者）”构成；复数为 innkeepers。相比 hotel owner/manager，“innkeeper”更常见于具有历史感、乡村或传统风格的住宿语境，也常出现在文学作品或旅行叙事中。","在英美文化中，inn 常让人联想到路边驿站、乡村旅馆，带有“温暖、朴素、地方性”的氛围；因此 innkeepers 也常被描写为热情好客、熟悉当地消息的人。"]}
{"word":"innkeeping","summary":{"en":"running and managing an inn as a business","zh":"经营并管理旅馆（客栈）的行业/活动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the business or activity of running an inn (a small hotel, often in the countryside or for travelers)","zh":"经营旅馆（通常指小型、面向旅客的客栈/小旅店）的行业或活动"},"examples":[{"en":"Innkeeping can be a demanding job because guests arrive at all hours.","zh":"经营旅馆可能很辛苦，因为客人随时都会到达。"},{"en":"They got into innkeeping after renovating an old country house.","zh":"他们翻新了一栋老乡村房子后，开始经营旅馆。"},{"en":"Her family has a long tradition of innkeeping in the mountain town.","zh":"她家在那座山城里有着悠久的旅馆经营传统。"}]}],"synonyms":["hospitality","hotel management","lodging business","running an inn"],"phonetic":"/ˈɪnˌkiːpɪŋ/","extraExplanation":["在现代英语里，innkeeping 比较偏正式或偏书面，更常见的说法是 running an inn / hotel management / hospitality business。若指具体的人，常用 innkeeper（旅店老板/掌柜）。"],"etymology":"由 inn（客栈/小旅店）+ keeping（经营、管理）构成。keeping 在这里表示“打理、经营”的意思；innkeeping 字面即“经营客栈/旅店”。","mnemonic":["拆开记：inn（客栈）+ keep（打理/照看）→ “把客栈打理好”就是经营旅馆。","联想中文“客栈掌柜在门口迎客、管房间、管早餐”——这些事合起来就是 innkeeping。"]}
{"word":"innland","summary":{"en":"Inland means away from the coast, or toward the interior of a country.","zh":"Inland 指“内陆的；远离海岸的”，也可表示“向内陆”或“内陆地区”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a place) away from the coast; inside a country, not near the sea.","zh":"（地方）内陆的；远离海岸的；在国内陆而非靠海的。"},"examples":[{"en":"They moved from a coastal town to an inland city.","zh":"他们从海边小镇搬到了内陆城市。"},{"en":"Inland areas are often warmer in summer than the coast.","zh":"内陆地区夏天通常比沿海更热。"}]},{"partOfSpeech":"adv.","definition":{"en":"toward or into the interior of a country, away from the coast.","zh":"向内陆；往远离海岸的地方。"},"examples":[{"en":"After landing, we drove inland for two hours.","zh":"登陆后，我们向内陆开了两个小时。"},{"en":"The storm moved inland overnight.","zh":"暴风雨在夜间向内陆移动。"}]},{"partOfSpeech":"n.","definition":{"en":"the inland part of a country or region (the interior).","zh":"内陆地区；内地。"},"examples":[{"en":"Trade routes connected the coast with the inland.","zh":"贸易路线把沿海与内陆连接起来。"}]}],"synonyms":["interior","landlocked (often for countries)","away from the coast","in the interior"],"phonetic":"/ˈɪnˌlænd/","extraExplanation":["“innland”常见于把英文 **inland** 拼错成双写 n 的情况。标准拼写是 **inland**（一个 n + 两个 n? 实际只有一个 n 开头：in-）。","在地理语境里，**inland** 常与 **coastal**（沿海的）、**offshore**（离岸的）对比使用。"]}
{"word":"innless","summary":{"en":"“Innless” is a rare/nonstandard adjective meaning “having no inns; without lodging.”","zh":"“innless”是罕见/非标准形容词，意思是“没有旅店/投宿处的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/nonstandard) Having no inns or lodging houses; without places for travelers to stay.","zh":"（罕见/非标准用法）没有旅店或客栈的；缺少供旅人投宿处的。"},"examples":[{"en":"It was an innless stretch of road, so we packed food and water.","zh":"那是一段没有旅店的路程，所以我们带了食物和水。"},{"en":"The village felt innless and isolated after dark.","zh":"天黑后，这个村子显得没有旅店可住、也很孤立。"}]}],"synonyms":["with no inns","without lodging","no hotels","remote"],"phonetic":"ˈɪn.ləs","extraExplanation":["“innless”不是常见的标准英语词。在实际写作里更自然的表达通常是：“with no inns / without an inn / no lodging / no hotels”。","如果一定要用，常见写法会加连字符：“inn-less”，表示“inn + -less（无……的）”。","如果你想表达的不是“没有旅店”，请告诉我你看到它的句子上下文，我可以帮你判断是否是拼写错误或想写成别的词（例如 *endless*、*illness* 等）。"]}
{"word":"innobedient","summary":{"en":"“Innobedient” is not standard; it usually means “disobedient” (not willing to obey).","zh":"“innobedient”不是标准用法；通常指“disobedient（不服从的/不听话的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) Usually intended to mean “disobedient”: not willing to obey rules, orders, or authority.","zh":"（非标准拼写）通常想表达“disobedient（不服从的）”：不愿意遵守规则、命令或权威的。"},"examples":[{"en":"“Innobedient” is not a standard English word; you probably mean “disobedient.”","zh":"“innobedient”不是标准英文单词；你可能想写“disobedient（不服从的）”。"},{"en":"The child was disobedient and refused to do his homework.","zh":"这个孩子很不听话，拒绝写作业。"},{"en":"Employees can be punished for being disobedient to company rules.","zh":"员工如果不遵守公司规定，可能会受到处罚。"}]}],"synonyms":["disobedient","rebellious","defiant","unruly","insubordinate"],"phonetic":"/ˌdɪsəˈbiːdiənt/","extraExplanation":["“innobedient”在英语里不常见、也不算规范拼写。常见的正确词是 disobedient（不服从的）。如果你想表达“对上级不服从/违抗命令（尤指在组织或军队中）”，还可以用 insubordinate（更正式、更强烈）。","disobedient 由前缀 dis-（表示“否定/相反”）+ obedient（顺从的）构成，字面意思就是“不是顺从的”。"]}
{"word":"innocence","summary":{"en":"Innocence means (1) being not guilty, and (2) being pure or naive due to lack of experience.","zh":"Innocence 主要指（1）无罪、清白；（2）因缺乏经验而显得天真、纯真。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being not guilty of a crime or wrongdoing","zh":"无罪；清白（指没有犯下罪行或做错事）"},"examples":[{"en":"The new evidence proved his innocence.","zh":"新的证据证明了他的清白。"},{"en":"She maintained her innocence throughout the trial.","zh":"在整个审判过程中，她始终坚持自己无罪。"}]},{"partOfSpeech":"n.","definition":{"en":"a lack of knowledge, experience, or understanding, especially about life’s dangers or complicated realities","zh":"天真；无知（尤指对生活的危险或复杂现实缺乏了解与经验）"},"examples":[{"en":"His innocence made him trust people too easily.","zh":"他的天真让他太容易相信别人。"},{"en":"Moving to the city quickly ended her innocence.","zh":"搬到城市后，她的天真很快就被打破了。"}]},{"partOfSpeech":"n.","definition":{"en":"purity and simplicity; the quality of being gentle, harmless, and uncorrupted (often used in art and literature)","zh":"纯真；纯洁与质朴（常用于艺术与文学语境，强调温柔、无害、未被污染）"},"examples":[{"en":"The poem celebrates the innocence of childhood.","zh":"这首诗歌颂了童年的纯真。"},{"en":"The story contrasts innocence with ambition and greed.","zh":"故事将纯真与野心、贪婪作对比。"}]}],"synonyms":["purity","naivety","guiltlessness","blamelessness","simplicity"],"phonetic":"/ˈɪnəsəns/","extraExplanation":["“innocence”来自拉丁语词根，核心意思是“没有伤害/没有罪过”。因此它既可指法律上的“无罪”，也常指道德与心理层面的“纯真、未受世故影响”。","在英语文学里，“innocence vs. experience（纯真与经验/世故）”是常见主题（如威廉·布莱克的《天真与经验之歌》）。这里的“innocence”通常不只是“幼稚”，也带有“未经腐化的善意与清澈”。","常见搭配：prove/establish innocence（证明清白）；claim/maintain innocence（声称/坚持无罪）；childhood innocence（童年纯真）；lose one’s innocence（失去纯真，常指第一次直面残酷现实）。注意语境不同，语气可从法律正式到文学抒情。"]}
{"word":"innocences","summary":{"en":"“Innocences” is the plural of “innocence,” meaning multiple cases of being not guilty or multiple instances of purity/childlike simplicity.","zh":"“innocences”是“innocence”的复数，可指多种“无罪/清白”的情况，也可指多段“纯真/天真”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “innocence”: the state(s) of being not guilty of a crime or wrongdoing; lack of responsibility for something bad.","zh":"“innocence”的复数：无罪；清白；不应为某件坏事负责的状态（或多种情况）。"},"examples":[{"en":"The court examined the new evidence and declared their innocences.","zh":"法院审查了新证据，宣布他们无罪。"},{"en":"She tried to prove her innocences in different incidents at work.","zh":"她试图证明自己在工作中不同事件里都是清白的。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “innocence”: lack of knowledge about the harsh or complex parts of life; purity or childlike simplicity (often used in writing).","zh":"“innocence”的复数：不谙世事；纯真；天真（文学或描写性语境中常用）。"},"examples":[{"en":"In the novel, the characters’ innocences fade as they grow up.","zh":"在小说里，人物随着成长逐渐失去纯真。"},{"en":"The poet contrasts the innocences of childhood with the doubts of adulthood.","zh":"诗人把童年的纯真与成人的疑虑作对比。"}]}],"synonyms":["blamelessness","purity","naivety","guilelessness","clean record"],"phonetic":"/ˈɪnəsənsɪz/","extraExplanation":["“innocence”通常是不可数名词（如：childhood innocence），但在谈“不同的无罪情形/多段纯真时期/多个人的清白”时可以用复数“innocences”。","在法律语境更常见的固定搭配是“prove someone’s innocence（证明某人无罪）”；“innocences”多用于强调“多起事件/多人/多方面的清白”。"]}
{"word":"innocencies","summary":{"en":"“Innocencies” is the plural of “innocence,” meaning either multiple cases of being not guilty/pure, or many small, naive, harmless actions or qualities.","zh":"“innocencies”是“innocence”的复数，可指多方面/多次的清白与纯真，也可指许多天真无害的小行为、小特质或话语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “innocence”: the state of being not guilty or not involved in wrongdoing; purity of intention.","zh":"“innocence”的复数：清白；无罪；纯真（没有恶意的状态）。"},"examples":[{"en":"The investigation confirmed their innocencies.","zh":"调查证实了他们的清白。"},{"en":"Stories about childhood often focus on lost innocencies.","zh":"关于童年的故事常常聚焦于逝去的纯真。"}]},{"partOfSpeech":"n.","definition":{"en":"Naive or harmless qualities, actions, or remarks (often used in the plural to emphasize small, gentle “acts of innocence”).","zh":"天真无害的特质、行为或话语（常用复数，强调一些“小小的纯真/无心之举”）。"},"examples":[{"en":"Her little innocencies made everyone smile.","zh":"她那些小小的天真无害之举让大家都笑了。"},{"en":"He asked a few innocencies that sounded silly but sincere.","zh":"他问了几个听起来有点傻却很真诚的天真问题。"}]}],"synonyms":["purity","blamelessness","naivety","childlike simplicity","harmlessness"],"phonetic":"/ˈɪnəsənsiz/","extraExplanation":["“Innocence”既可作不可数名词（表示抽象的“纯真/无罪”），也可在特定语境中用复数“innocencies”，用来强调“多次/多方面的清白”或“许多细小的天真举动”。","常见搭配：lost innocencies（逝去的纯真）、prove/establish someone’s innocence（证明某人无罪）。文学与评论里也常用“the loss of innocence/innocencies”来谈从童年到成人的变化。"]}
{"word":"innocency","summary":{"en":"“Innocency” means “innocence” (being innocent or free from guilt), but “innocence” is the more common modern form.","zh":"“innocency”表示“无辜/天真”（同“innocence”），但现代英语更常用“innocence”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being innocent; lack of guilt, wrongdoing, or harmful intent (often used in a formal or literary style).","zh":"无辜；清白；天真无害的状态（常用于较正式或文学语境）。"},"examples":[{"en":"The evidence supported his innocency, and the charges were dropped.","zh":"证据证明他清白无辜，于是指控被撤销了。"},{"en":"She spoke with a kind of childhood innocency that made everyone trust her.","zh":"她带着一种孩童般的天真说话，让大家都愿意相信她。"}]}],"synonyms":["innocence","blamelessness","purity","guiltlessness"],"phonetic":"/ˈɪnəsənsi/","extraExplanation":["“innocency”是“innocence”的变体形式：两者都表示“无辜/天真”，但现代英语里更常用的是“innocence”。在法律或较正式的写作中偶尔会看到“innocency”。","在文学中，“innocency/innocence”常与“experience（世故/经验）”形成对照，用来讨论从纯真到成熟（或堕落）的变化。一个常被提到的文学标题是威廉·布莱克的《Songs of Innocence and of Experience》（《天真与经验之歌》）。"]}
{"word":"innocent","summary":{"en":"Innocent means not guilty, not aware of wrongdoing, or harmless/pure; it can also mean an innocent person (someone who is not to blame).","zh":"Innocent 常指“无罪/清白”、 “不知情”、或“纯真无害（有时偏天真）”；也可作名词指“无辜的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not guilty of a crime or wrongdoing; free from blame.","zh":"无罪的；清白的；没有做错事的。"},"examples":[{"en":"He was proven innocent in court.","zh":"他在法庭上被证明是无罪的。"},{"en":"She insisted she was innocent of any cheating.","zh":"她坚称自己完全没有作弊。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not having knowledge of something (often something bad or complicated); unaware.","zh":"（对某事）不知情的；不了解的（常指不好的或复杂的事）。"},"examples":[{"en":"I was innocent of their plan until yesterday.","zh":"直到昨天我才知道他们的计划；之前我一直不知情。"}]},{"partOfSpeech":"adj.","definition":{"en":"Pure and simple; not intended to harm; sometimes meaning naive.","zh":"纯真无害的；天真的（有时带“单纯、好骗”的含义）。"},"examples":[{"en":"It was an innocent question, not an insult.","zh":"那只是个无心的问题，并不是在侮辱人。"},{"en":"He gave her an innocent smile.","zh":"他对她露出一个天真的微笑。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, especially a child, who is harmless or has been hurt because of others’ wrongdoing (often plural: the innocent).","zh":"无辜的人（尤指儿童）；因他人过错而受害的人（常用复数：the innocent 无辜者）。"},"examples":[{"en":"The war harmed many innocent people.","zh":"战争伤害了许多无辜的人。"},{"en":"We must protect the innocent.","zh":"我们必须保护无辜者。"}]}],"synonyms":["not guilty","blameless","unaware","harmless","pure","naive"],"phonetic":"/ˈɪnəsənt/","extraExplanation":["“innocent”常和法律语境搭配（innocent / guilty），也常用来形容“没有恶意”的行为（an innocent mistake 无心之过）。在口语里，innocent 还可能带一点“天真、容易受骗”的语气，是否褒义要看上下文。","常见搭配：innocent of（对……无罪/不知情）、innocent victim（无辜受害者）、innocent until proven guilty（无罪推定：在被证明有罪前视为无罪）。","文学与文化中，“the innocent”常作为一种道德意象，指纯真或无辜者；例如在讨论战争、暴力、社会不公时，经常用来强调受害者并没有做错事。"]}
{"word":"innocent-looking","summary":{"en":"Seeming harmless or pure in appearance, sometimes deceptively.","zh":"外表看似无害或单纯（有时带有迷惑性）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Appearing harmless, simple, or friendly (sometimes in a misleading way).","zh":"看起来无害、单纯或友善的（有时带有“表面无辜、其实不然”的意味）。"},"examples":[{"en":"It was an innocent-looking email, but it contained a virus link.","zh":"那封邮件看起来很正常无害，但里面有病毒链接。"},{"en":"He gave me an innocent-looking smile and said nothing.","zh":"他露出一副无辜的微笑，却什么也没说。"},{"en":"The innocent-looking question made her realize he knew the secret.","zh":"那个看似随意无害的问题，让她意识到他知道秘密。"}]}],"synonyms":["harmless-looking","benign-looking","innocuous-looking","angelic-looking","deceptively harmless"],"phonetic":"/ˈɪnəsənt ˌlʊkɪŋ/","extraExplanation":["语气与用法：innocent-looking 常用于带一点“反差/警惕”的语境，暗示“看起来没问题，但可能有问题”。如果只是单纯描述“长相很天真”，也可以用，但更常见的是这种“表面无害”的含义。","常见搭配：an innocent-looking smile/face/child; an innocent-looking email/message/app; an innocent-looking package/object。","写法提示：多作定语放在名词前（an innocent-looking boy）。也可作表语（The device looked innocent-looking, but it was dangerous. 不过更自然会说 looked innocent）。"],"etymology":"由 innocent（无辜的、无害的）+ looking（看起来……的）构成的复合形容词；常用来强调“外表呈现出的感觉”，并暗示外表可能与真实情况不一致。","mnemonic":["把它拆开记：innocent（无辜/无害）+ looking（看起来）。=“看起来很无辜”。","联想中文：‘长得一脸无害’——常用来提醒自己：别只看外表。"]}
{"word":"innocent-seeming","summary":{"en":"Appearing harmless or innocent on the surface.","zh":"表面上看起来无害或无辜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Appearing harmless or not guilty, even if that impression may be misleading.","zh":"看起来无害或无辜的（即使这种印象可能是误导的）。"},"examples":[{"en":"An innocent-seeming question started a heated argument.","zh":"一个看似无害的问题引发了激烈争论。"},{"en":"She made an innocent-seeming comment that embarrassed him.","zh":"她说了一句看似无心的话，却让他很尴尬。"},{"en":"The email looked innocent-seeming, but it was actually a scam.","zh":"那封邮件看起来挺无害，但其实是诈骗。"}]}],"synonyms":["apparently innocent","harmless-looking","innocuous-looking","benign-looking","seemingly harmless","seemingly innocent"],"phonetic":"/ˈɪnəsənt ˈsiːmɪŋ/","extraExplanation":["seeming 常带有“表面如此但可能并非如此”的语气；因此 innocent-seeming 往往暗含“看起来没问题，但可能有猫腻”。","写法上常用连字符（innocent-seeming）放在名词前作定语：an innocent-seeming remark/question/email。也可不加连字符（innocent seeming），但在正式写作里连字符更清晰。"],"etymology":"由“innocent（无辜的、无害的）+ seeming（看似……的）”构成的复合形容词；seeming 表示“表面上像”，常暗示“未必真实”。","mnemonic":["seem=“似乎/看起来”，innocent-seeming=“看起来 innocent（无辜）”。记成：外表无辜≠真的无辜。","把它联想到中文常说的“看着挺无害/看着挺单纯”，提醒自己这是“表面印象”。"]}
{"word":"innocenter","summary":{"en":"“Innocenter” is not standard English. Use “more innocent” instead.","zh":"“innocenter”不是标准英语；应使用“more innocent”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) a mistaken form for the comparative of “innocent.” In standard English, say “more innocent” (not “innocenter”).","zh":"（非标准/罕见）常见误写，用来表示“innocent（无辜的/天真的）”的比较级。标准英语应说“more innocent”（而不是“innocenter”）。"},"examples":[{"en":"Nonstandard: She looks innocenter than her brother. (Better: She looks more innocent than her brother.)","zh":"非标准：She looks innocenter than her brother.（更好：She looks more innocent than her brother. 她看起来比她哥哥更无辜/更天真。）"},{"en":"In formal writing, avoid “innocenter” and use “more innocent.”","zh":"在正式写作中避免使用“innocenter”，改用“more innocent”。"}]}],"synonyms":["more innocent","more naïve (for “more childlike/less experienced”)","more blameless (for “less guilty”)"],"phonetic":"/ˈɪnəsəntər/","extraExplanation":["“innocent”的比较级通常不用“-er”，而用“more + 形容词”。这是因为“innocent”音节较多（3个音节：in-no-cent），英语里许多多音节形容词更常用“more/most”来构成比较级/最高级。","如果你想表达“更无辜”（没有做错事）与“更天真”（缺乏经验）这两种不同感觉，可以根据语境选择：more innocent（更无辜/更天真）、more naïve（更天真、更不谙世事）。"]}
{"word":"innocentest","summary":{"en":"“Innocentest” is a rare/nonstandard way to say “most innocent.” Use “most innocent” in standard English.","zh":"“innocentest”是表示“最无辜/最天真”的少见、不标准写法；标准英语中用“most innocent”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Superlative form of “innocent,” meaning “the most innocent.” In modern English, people usually say “most innocent,” not “innocentest.”","zh":"（不标准/少见）“innocent”的最高级，表示“最无辜的/最天真的”。现代英语中通常说“most innocent”，而不是“innocentest”。"},"examples":[{"en":"Of all the kids, she seemed the most innocent.","zh":"在所有孩子里，她看起来最天真。"},{"en":"(Rare) He was the innocentest of them all.","zh":"（少见）他是他们当中最无辜的。"}]}],"synonyms":["most innocent","purest (context-dependent)","most blameless (formal)"],"phonetic":"/ˈɪnəsəntɪst/","extraExplanation":["“innocent”是多音节形容词，比较级/最高级通常用 more / most：more innocent / most innocent，而不是加 -er / -est。","“innocentest”偶尔会出现在口语、儿童语言、或带幽默/故意夸张的写法中；在正式写作里建议避免，用“most innocent”。","拼写提示：如果你原本想写的是“innocentest”，更可能是把“innocentest”打错了；标准词形是 innocent（原级）。"]}
{"word":"innocently","summary":{"en":"“Innocently” means either “without bad intention” or “in a naive, trusting way,” and sometimes “in a sexually pure way,” depending on context.","zh":"“innocently”可指“无恶意、并非故意”，也可指“天真、轻信”，有时还指“纯洁、不带性暗示”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you did not intend to do anything wrong; without guilt or bad intention.","zh":"以无恶意、无罪过的方式；并非故意做坏事。"},"examples":[{"en":"I innocently mentioned her age, not realizing it was sensitive.","zh":"我无意中提到她的年龄，没意识到这是个敏感话题。"},{"en":"He insisted he had innocently taken the wrong bag at the airport.","zh":"他坚称自己是在机场无意中拿错了包。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is simple, trusting, or naive (sometimes used critically).","zh":"以单纯、轻信、天真的方式（有时带批评意味）。"},"examples":[{"en":"She innocently believed everything she read online.","zh":"她天真地相信了网上看到的一切。"},{"en":"The child looked up innocently and asked, “Why?”","zh":"孩子一脸天真地抬头问：“为什么？”"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is sexually pure or not sexually suggestive.","zh":"以纯洁、不带性暗示的方式。"},"examples":[{"en":"It was an innocently romantic story, suitable for younger readers.","zh":"那是个纯洁浪漫的故事，适合年轻读者。"},{"en":"They were holding hands innocently, just as friends.","zh":"他们只是像朋友一样单纯地牵着手。"}]}],"synonyms":["naively","harmlessly","blamelessly","purely","simply"],"phonetic":"/ˈɪnəsəntli/","extraExplanation":["“innocently”来自形容词“innocent（无辜的/天真的）”+ 副词后缀“-ly”。它既可表示“并非故意做错事”，也可表示“天真单纯”。语境不同，语气可能中性（无意）或略带批评（太天真）。","文学与叙事中，“innocently”常用来制造反差：表面“天真/无意”的行为，可能引发严重后果，从而突出人物的无辜、社会的复杂或命运的讽刺。"]}
{"word":"innocentness","summary":{"en":"“Innocentness” means the state of being innocent—either not guilty or childlike purity. In modern English, “innocence” is much more common.","zh":"“innocentness”指“无辜/清白”或“纯真/天真”的状态；现代英语中更常用的是“innocence”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being innocent; not guilty of a crime or wrongdoing","zh":"清白；无罪；无辜（没有犯罪或做错事的状态）"},"examples":[{"en":"The court found no evidence of guilt, so his innocentness was recognized.","zh":"法院没有发现有罪证据，因此他的清白得到了确认。"},{"en":"She tried to prove her innocentness with emails and receipts.","zh":"她试图用邮件和收据来证明自己的清白。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being inexperienced or not aware of bad things; childlike purity or simplicity","zh":"纯真；天真；不谙世事（像孩子一样的单纯与无邪）"},"examples":[{"en":"There was an innocentness in his questions that made everyone smile.","zh":"他的问题里有一种天真，让大家都笑了。"},{"en":"The story captures the innocentness of childhood.","zh":"这个故事抓住了童年的纯真。"}]}],"synonyms":["innocence","purity","naivety","blamelessness"],"phonetic":"/ˈɪnəsəntnəs/","extraExplanation":["“innocentness”可以用，但在更自然的英语里，人们更常说：\n- 表示“清白/无罪”：innocence（更常用）、proof of innocence\n- 表示“天真/纯真”：innocence（更常用）、childlike innocence、naivety（更强调“不懂世故”）\n在正式写作或法律语境中，用“innocence”会更地道。"]}
{"word":"innocents","summary":{"en":"“Innocents” means people who are not guilty, or (often children) people who are pure and naive.","zh":"“innocents”指“无辜的人”，也可指（常为孩子）“纯真、天真的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are not guilty of a crime or wrongdoing.","zh":"无辜的人；清白的人（未犯错或未犯罪）。"},"examples":[{"en":"The new evidence helped free the innocents who had been wrongly convicted.","zh":"新的证据帮助那些被冤枉定罪的无辜者重获自由。"},{"en":"War often harms innocents who have no power to stop it.","zh":"战争常常伤害那些无力阻止它的无辜平民。"}]},{"partOfSpeech":"n.","definition":{"en":"People, especially children, who are innocent in a moral sense—pure, naive, or without experience of evil.","zh":"（尤指儿童）天真纯洁的人；不谙世事的人。"},"examples":[{"en":"The story is told through the eyes of the innocents, who cannot understand the adults’ cruelty.","zh":"故事从天真孩子的视角讲述，他们无法理解成人的残酷。"},{"en":"He tried to protect the innocents from the harsh realities of the world.","zh":"他试图保护那些天真的人免受世界残酷现实的伤害。"}]}],"synonyms":["the blameless","the guiltless","the uncorrupted","the naive"],"phonetic":"/ˈɪnəsənts/","extraExplanation":["“innocents”是名词复数，来自形容词“innocent（无辜的/天真的）”。常见搭配有“protect the innocents（保护无辜者）”“harm innocents（伤害无辜者）”。","在新闻和法律语境里，“the innocents”通常指“无辜者/无罪的人”；在文学或口语里，也可带有“纯真、稚嫩”的情感色彩。"]}
{"word":"innocuity","summary":{"en":"Innocuity means “harmlessness”—the state of not causing harm or offense.","zh":"innocuity 指“无害性/无伤大雅”，强调不会造成伤害或冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being harmless; not likely to cause damage, offense, or danger","zh":"无害性；无恶意；不会造成伤害、冒犯或危险的特性"},"examples":[{"en":"The innocuity of the joke depended on the audience and the context.","zh":"这个笑话是否“无伤大雅”，取决于听众和语境。"},{"en":"Scientists tested the innocuity of the substance before approving its use.","zh":"科学家在批准使用前测试了该物质的无害性。"}]}],"synonyms":["harmlessness","benignity","safety","innocuousness"],"phonetic":"/ˌɪnəˈkjuːəti/","extraExplanation":["词根提示：来自拉丁语 in-（不）+ nocuus（有害的）。所以 innocuity 字面意思就是“无害”。","语体与使用：innocuity 比 harmlessness 更正式，常见于学术写作、法律/政策讨论或媒体评论中，用来强调“没有造成不良后果/冒犯”的性质。","搭配建议：the innocuity of + 名词（the innocuity of a chemical / a remark / an action）；prove/demonstrate innocuity（证明无害性）。"]}
{"word":"innoculate","summary":{"en":"Inoculate means to protect against disease by vaccination, or to introduce a small amount of something to start a process; it can also mean “protect mentally” from harmful ideas.","zh":"Inoculate 指通过接种疫苗预防疾病；也可指在实验中接种少量物质以启动过程；还可作比喻义，指让人对有害观点产生“免疫”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone (or an animal) a vaccine to protect against a disease","zh":"给（人或动物）接种疫苗以预防疾病"},"examples":[{"en":"The nurse inoculated the child against measles.","zh":"护士给孩子接种了麻疹疫苗。"},{"en":"Many travelers are inoculated before visiting certain countries.","zh":"许多旅客在去某些国家之前会先接种疫苗。"}]},{"partOfSpeech":"vt.","definition":{"en":"to introduce a small amount of a substance (such as bacteria, yeast, or cells) into something to start a process or test an effect","zh":"将少量物质（如细菌、酵母或细胞）接种/植入到某物中，以启动过程或测试影响"},"examples":[{"en":"The scientist inoculated the culture with bacteria.","zh":"科学家把细菌接种到培养基中。"},{"en":"They inoculated the soil with beneficial microbes.","zh":"他们给土壤接种了有益微生物。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to protect someone from an idea or influence by exposing them to a weaker form of it first","zh":"（比喻）通过先让人接触较弱形式的观点/影响，从而使其产生“免疫”并受到保护"},"examples":[{"en":"Teachers try to inoculate students against misinformation.","zh":"老师努力让学生对虚假信息产生“免疫力”。"},{"en":"The program aims to inoculate young people against extremist propaganda.","zh":"该项目旨在让年轻人对极端主义宣传产生“免疫力”。"}]}],"synonyms":["vaccinate","immunize","inject","introduce","seed"],"phonetic":"/ɪˈnɑːkjəˌleɪt/","extraExplanation":["你写的是 **innoculate**，常见正确拼写是 **inoculate**（只有一个 n）。在医学语境里更常用 **vaccinate**；但 **inoculate** 在科学实验（把微生物“接种”到培养基）和比喻义（让人对错误观念“免疫”）中非常常见。","词源上与“把东西接到里面/接上去”的意思有关，因此既能指“接种疫苗”，也能指实验里“接种培养”。"]}
{"word":"innoculated","summary":{"en":"Inoculated means vaccinated (or, figuratively, mentally prepared) to resist something harmful.","zh":"Inoculated 指“已接种疫苗”，也可比喻“提前做准备，从而对不良影响有免疫力”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of inoculate) Given a vaccine or other medical preparation to protect against a disease.","zh":"（inoculate 的过去式/过去分词）接种疫苗或其他制剂，以预防疾病。"},"examples":[{"en":"The children were inoculated against measles before starting school.","zh":"孩子们在入学前接种了麻疹疫苗。"},{"en":"Most travelers are inoculated before visiting certain countries.","zh":"许多旅客在前往某些国家前会先接种疫苗。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) Protected someone from harmful ideas or influences by preparing them in advance (often used with “against”).","zh":"（比喻）让某人提前有心理准备，从而“免疫”不良观念或影响（常与 against 搭配）。"},"examples":[{"en":"The workshop inoculated new employees against common online scams.","zh":"这场培训让新员工对常见网络诈骗有了“免疫力”。"},{"en":"Reading diverse viewpoints can inoculate you against misinformation.","zh":"阅读多元观点能让你对错误信息更不容易受骗。"}]}],"synonyms":["vaccinated","immunized","protected","fortified"],"phonetic":"/ɪˈnɑːkjəˌleɪtɪd/","extraExplanation":["你写的 **innoculated** 通常是拼写错误，标准拼写是 **inoculated**（一个 n）。容易和 **innocent**（无辜的）或 **inoculate** 的发音混淆。","比喻用法里，**inoculate someone against X** 很常见，意思是“让某人对 X 不易受影响/不易上当”，相当于中文里“打预防针、提高免疫力”的说法。"]}
{"word":"innoculating","summary":{"en":"“Inoculating” means vaccinating or introducing something (literally or figuratively) to build protection or test growth.","zh":"“inoculating” 指接种疫苗；也可指把微生物/物质接种进去；还可比喻让人对某种影响提前“建立免疫”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of inoculate) Giving someone a vaccine to protect them from a disease; vaccinating.","zh":"（inoculate 的现在分词）给某人接种疫苗以预防疾病；给……打预防针。"},"examples":[{"en":"The clinic is inoculating children against flu this week.","zh":"诊所这周正在为孩子们接种流感疫苗。"},{"en":"Many countries started inoculating healthcare workers first.","zh":"许多国家先开始为医护人员接种。"}]},{"partOfSpeech":"v.","definition":{"en":"Introducing a microorganism or substance into something (often for scientific testing or growth).","zh":"将微生物或某种物质接种/引入到某物中（常用于实验、培养）。"},"examples":[{"en":"The researcher is inoculating the agar plates with bacteria.","zh":"研究人员正在把细菌接种到琼脂培养皿上。"},{"en":"We’re inoculating the culture to see how fast it grows.","zh":"我们正在给培养物接种，观察它生长速度。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) Preparing someone to resist an idea, influence, or criticism by exposing them to a small amount of it first.","zh":"（比喻）通过先让人接触少量的观点/影响/批评来“增强免疫力”，使其更能抵抗。"},"examples":[{"en":"The teacher is inoculating students against misinformation by showing common tricks used in fake news.","zh":"老师通过展示假新闻常见套路，来让学生对错误信息“免疫”。"},{"en":"He tried inoculating the team against criticism by discussing possible complaints beforehand.","zh":"他事先讨论可能的抱怨，试图让团队对批评更有心理准备。"}]}],"synonyms":["vaccinating","immunizing","introducing","implanting","seeding"],"phonetic":"/ɪˈnɑːkjəˌleɪtɪŋ/","extraExplanation":["“innoculating” 常见于拼写错误；正确拼写通常是 “inoculating”。很多人会因为 “innocent（无辜的）” 或 “inoculation（接种）” 的发音联想而多写一个 n。","“inoculate” 源自与“接种/移植芽、嫁接”相关的词根，后来引申为“接种疫苗”，再进一步发展出比喻义：让人对某种影响‘产生免疫’。"]}
{"word":"innoculation","summary":{"en":"Inoculation means giving a vaccine to protect against disease; it can also mean “preparing” someone to resist harmful ideas.","zh":"Inoculation 指接种疫苗以预防疾病；也可比喻为让人提前准备，从而抵御有害观念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Correct spelling: inoculation) A medical process in which a vaccine is given to help protect the body from a disease (immunization).","zh":"（正确拼写：inoculation）接种疫苗以帮助身体预防疾病的过程（免疫接种）。"},"examples":[{"en":"Many children receive inoculation against measles before starting school.","zh":"许多孩子在上学前会接种麻疹疫苗。"},{"en":"The doctor recommended an inoculation to reduce the risk of infection.","zh":"医生建议接种疫苗以降低感染风险。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of introducing a vaccine or a weakened form of a germ into the body to produce immunity.","zh":"将疫苗或减毒病原体引入体内以产生免疫力的行为。"},"examples":[{"en":"Inoculation trains the immune system to recognize a virus.","zh":"接种能训练免疫系统识别病毒。"},{"en":"After inoculation, mild fever can happen for a day or two.","zh":"接种后可能会有一两天的轻微发烧。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) The act of protecting someone against harmful ideas or influences by preparing them in advance.","zh":"（比喻）通过提前准备，使人对有害思想或影响产生“免疫”的做法。"},"examples":[{"en":"Media literacy can be a kind of inoculation against misinformation.","zh":"媒体素养可以成为对抗错误信息的一种“免疫接种”。"},{"en":"Parents try to provide inoculation against peer pressure by talking openly at home.","zh":"父母会通过在家坦诚沟通，让孩子对同伴压力产生“免疫”。"}]}],"synonyms":["vaccination","immunization","shot","jab","injection"],"phonetic":"/ɪˌnɑːkjəˈleɪʃən/","extraExplanation":["你输入的拼写“innoculation”很常见，但标准拼写是 **inoculation**（只有一个 n）。","词源来自拉丁语 *inoculare*，原意与“把芽接到植物上”（嫁接）有关；后来引申为把少量病原或疫苗“引入体内”来产生保护。","日常英语里，**vaccination**（疫苗接种）更常用、更口语；**inoculation**稍偏正式，也常出现在科普或学术语境。"]}
{"word":"innocuous","summary":{"en":"Innocuous means harmless or not likely to offend or cause trouble, sometimes suggesting something only seems harmless.","zh":"innocuous 表示“无害的/不冒犯的/不太会惹麻烦的”，有时暗含“看似无害但可能另有影响”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not harmful, offensive, or likely to cause trouble; seeming safe or harmless.","zh":"无害的；不冒犯的；不太可能引起麻烦的（看起来很安全/很“没杀伤力”）。"},"examples":[{"en":"The comment sounded innocuous, but it actually hurt her feelings.","zh":"这句话听起来无伤大雅，但其实伤到了她的感情。"},{"en":"It started as an innocuous question about work and turned into an argument.","zh":"一开始只是一个关于工作的无害问题，后来却变成了争吵。"},{"en":"Don’t click links that look innocuous—they can still be scams.","zh":"不要点那些看起来无害的链接——它们也可能是诈骗。"}]}],"synonyms":["harmless","inoffensive","benign","safe","mild"],"phonetic":"/ɪˈnɑkjuəs/","extraExplanation":["“innocuous”常用来表示“表面无害，但可能有潜在影响/风险”。因此它经常出现在安全、职场沟通、政治话语、网络诈骗等语境里。","词根提示：in-（不）+ noc（伤害，见于 noxious“有害的”）。理解这个对记忆很有帮助：innocuous ≈ “not harmful”。","近义词细微差别：harmless 更口语、直观；innocuous 更正式，强调“不会引起反感或麻烦/没有威胁”。"]}
{"word":"innocuously","summary":{"en":"“Innocuously” means “in a harmless, nonthreatening way.”","zh":"“innocuously”表示“以无害、无威胁的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a harmless or nonthreatening way; without causing damage, danger, or offense.","zh":"无害地；不具威胁地；不冒犯地（以不会造成伤害、危险或不快的方式）。"},"examples":[{"en":"The dog wagged its tail innocuously and walked away.","zh":"那只狗无害地摇着尾巴，然后走开了。"},{"en":"What sounded innocuously funny at first later turned out to be hurtful.","zh":"一开始听起来只是无伤大雅的玩笑，后来却被证明很伤人。"},{"en":"A small, innocuously named file can still contain a virus.","zh":"一个名字看起来很普通无害的小文件也可能含有病毒。"}]}],"synonyms":["harmlessly","benignly","inoffensively","nonthreateningly"],"phonetic":"/ɪˈnɑkjəwəsli/","extraExplanation":["“innocuously”来自形容词“innocuous”（无害的），常用于对比“表面无害”与“实际可能有影响/风险”的情况，尤其在安全（网络安全、产品风险）或人际交流（言语是否冒犯）中很常见。","易混：innocently（天真地/无辜地）强调动机或品格；innocuously强调结果或性质“没有伤害/威胁”。"]}
{"word":"innocuousness","summary":{"en":"Innocuousness means the quality of being harmless, or sometimes the quality of seeming harmless.","zh":"innocuousness 指“无害性”，也可指“看起来无害（但可能暗藏风险）”的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being harmless; not likely to cause harm, offense, or trouble","zh":"无害性；不冒犯性；不会引起麻烦的性质"},"examples":[{"en":"The innocuousness of the joke was clear—no one felt insulted.","zh":"这个玩笑的无害性很明显——没有人觉得被冒犯。"},{"en":"They tested the chemical to confirm its innocuousness for human use.","zh":"他们测试这种化学品，以确认它对人类使用是无害的。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of seeming harmless (sometimes hiding risk or real intent)","zh":"表面无害（有时可能掩盖风险或真实意图）的性质"},"examples":[{"en":"The email’s innocuousness made people click the link without thinking.","zh":"这封邮件看起来很无害，让人们不假思索就点了链接。"},{"en":"Behind the innocuousness of his question, she sensed criticism.","zh":"在他看似无害的问题背后，她感觉到了批评的意味。"}]}],"synonyms":["harmlessness","benignity","innocence","safety"],"phonetic":"/ɪˈnɑːkjuəsnəs/","extraExplanation":["“innocuousness”来自形容词“innocuous（无害的）”，后缀“-ness”把形容词变成名词，表示“……的性质/状态”。","在现实语境里，它既可以是中性褒义（真的安全、无害），也可以带一点警惕意味（看起来无害但可能有隐患）。常与“appearance（外表）/seeming（看似）/behind（在……背后）”等搭配。"]}
{"word":"innocuousnesses","summary":{"en":"harmlessness; lack of offensiveness (plural cases)","zh":"无害性；不冒犯性（复数用法，指多种情况）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “innocuousness”: the quality of being harmless, not likely to offend, or not causing trouble (in more than one case)","zh":"“innocuousness”的复数：指“无害、不冒犯、不会引起麻烦/争议”的特质（用于多个事例或多种表现）"},"examples":[{"en":"The report lists several innocuousnesses of the new ingredient, including its mild taste and low toxicity.","zh":"报告列出了这种新成分的多种“无害性”，包括味道温和和低毒性。"},{"en":"In different cultures, what seems like a joke can lose its innocuousnesses and become offensive.","zh":"在不同文化中，看似玩笑的话可能不再“无冒犯性”，反而变得冒犯。"}]}],"synonyms":["harmlessness","benignity","inoffensiveness","innocuity","safety"],"phonetic":"ɪˈnɑkjəwəsnəsɪz","extraExplanation":["这个词形（innocuousnesses）比较少见，因为“innocuousness”通常是不可数抽象名词；但在学术写作、法律/医学或风格分析中，有时会用复数来强调“多种无害之处/多项无冒犯特征”。","常见搭配：the innocuousness of …（……的无害性/不冒犯性）；seem/appear innocuous（看起来无害）。"],"etymology":"源自拉丁语 in-（否定）+ nocuus（有害的）→ innocuous（无害的）+ -ness（名词后缀，表示“性质/状态”）；-es 表示复数。","mnemonic":["拆词记：in-（不）+ noc（伤害/有害）+ -uous（形容词）→ innocuous（无害的）；再加 -ness 变“无害性”。","联想中文：把 “noc” 想成“弄（nòng）”你=伤害你；in-noc-uous 就是“不弄你”，所以“无害/不冒犯”。"]}
{"word":"innodate","summary":{"en":"Inundate means to flood with water or to overwhelm with a large amount of something.","zh":"Inundate 指“（洪水）淹没”，也可比喻“（信息、工作等）大量涌来使人应接不暇”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To flood an area with a large amount of water.","zh":"（使）被大量的水淹没；泛滥。"},"examples":[{"en":"After days of heavy rain, the river inundated nearby farms.","zh":"连续几天大雨后，河水淹没了附近的农田。"},{"en":"The storm surge inundated parts of the coast.","zh":"风暴潮淹没了部分海岸地区。"}]},{"partOfSpeech":"vt.","definition":{"en":"To overwhelm someone or something with a very large amount of things (such as work, messages, or information).","zh":"（大量事物）涌来使不堪承受；使应接不暇（如工作、信息、请求）。"},"examples":[{"en":"Customer service was inundated with complaints.","zh":"客服部门被投诉淹没，忙得不可开交。"},{"en":"I was inundated with emails after the announcement.","zh":"公告发布后，我的邮箱被邮件“淹没”了。"},{"en":"The news cycle can inundate people with alarming stories.","zh":"新闻循环可能用大量令人焦虑的报道让人应接不暇。"}]}],"synonyms":["flood","swamp","overwhelm","deluge"],"phonetic":"/ˈɪnənˌdeɪt/","extraExplanation":["你输入的“innodate”通常是拼写错误；正确拼写更常见的是 **inundate**。","**inundate** 常用在两类语境：一是字面“洪水淹没”，二是比喻“信息/工作/请求大量涌来”。比喻用法在新闻、职场英语里非常常见。","在文学或较正式写作中，inundate 带有一种“来势汹汹、量大到压倒性”的语感，比一般的 *receive a lot of* 更有画面感。"]}
{"word":"innominability","summary":{"en":"Innominability means the state of being unnameable or unnamed, often used in formal, literary, or philosophical contexts.","zh":"innominability 指“不可命名性/未命名状态”，多见于正式、文学或哲学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being impossible or difficult to name; unnameability","zh":"难以命名的性质；不可命名性"},"examples":[{"en":"The horror in the story is heightened by its innominability—no one can even say what it is.","zh":"故事中的恐怖因为其不可命名性而更强烈——没有人甚至能说清那是什么。"},{"en":"She struggled to describe the feeling, caught between language and innominability.","zh":"她努力描述那种感觉，在语言与不可命名之间徘徊。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality or state of being unnamed or having no accepted name (often in formal or philosophical writing)","zh":"未被命名、没有公认名称的状态（常见于正式或哲学性写作）"},"examples":[{"en":"In early research, the phenomenon remained in innominability until better measurements were developed.","zh":"在早期研究中，这一现象在更好的测量方法出现前一直处于“未命名”的状态。"},{"en":"The poet writes about the innominability of grief, which resists easy labels.","zh":"诗人写到悲伤的不可命名性——它不接受轻易的标签。"}]}],"synonyms":["unnameability","namelessness","ineffability","indescribability"],"phonetic":"/ɪˌnɑmənəˈbɪləti/","extraExplanation":["词源提示：in-（否定前缀）+ Latin *nomen*（“名字”）相关词根，核心意思是“没有名字/不能命名”。","用法提示：这个词非常少见，更多时候英语会用 *unnameability* 或 *namelessness* 来表达；在文学与哲学语境里也常与 *ineffability*（“不可言说性”）并提，但两者不完全相同：*innominability* 偏“无法命名”，*ineffability* 偏“无法用语言表达”。","文学语境：现代文学中常用“不可命名/无名之物”的主题来制造神秘或恐惧感；例如塞缪尔·贝克特（Samuel Beckett）作品中也常探讨“无法被命名的自我/经验”（可联想到 *The Unnamable* 的主题氛围）。"]}
{"word":"innominable","summary":{"en":"Innominable means unnameable—so awful or shameful that it feels unfit to mention.","zh":"Innominable 指“不可名状的”——坏到或可耻到让人觉得不该提起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"So bad, shameful, or disgusting that you feel it should not be named or spoken about; unmentionable.","zh":"糟糕、可耻或令人厌恶到让人觉得不该说出口的；不可名状的、不可提的。"},"examples":[{"en":"The report described an innominable act of cruelty.","zh":"报告描述了一起不可名状的残忍行为。"},{"en":"He refused to repeat the innominable insult.","zh":"他拒绝复述那句不堪入耳的侮辱。"}]}],"synonyms":["unnameable","unnamable","unspeakable","unmentionable","indescribable"],"phonetic":"/ɪˈnɑmənəbəl/","extraExplanation":["“innominable”较少见、带文学/正式语气，常用来强调“连名字都不配提”。词源来自拉丁语：in-（不）+ nominare（命名）。","它有时会被误认为或用来替代更常见的“abominable（可憎的、极坏的）”。两者都表示“非常糟糕”，但“innominable”更强调“不可言说/不愿点名”。"]}
{"word":"innominables","summary":{"en":"“Innominables” means “the unnamables”—things or people too unpleasant or hard to name; it can also be the plural adjective form of “innominable.”","zh":"“innominables”指“不可名状之物/人”，也可作形容词“innominable”的复数形式，表示难以启齿、不能明说的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun, rare) People or things considered so unpleasant, shameful, or hard to describe that you avoid naming them directly; “the unnamables.”","zh":"（复数名词，较少用）指令人厌恶、羞耻或难以描述到不愿直呼其名的人或事；“不可名状之物/人”。"},"examples":[{"en":"The report mentioned “certain innominables” without describing them in detail.","zh":"报告提到“一些不可名状之事”，但没有细说。"},{"en":"In gossip, she hinted at a few innominables and then changed the subject.","zh":"在八卦里，她暗示了几件不可名状的事，然后就转移了话题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Plural form of the adjective “innominable”: impossible or inappropriate to name or describe openly.","zh":"“innominable”的复数形容词形式：难以启齿、不能公开命名或描述的。"},"examples":[{"en":"They made innominables accusations and offered no evidence.","zh":"他们提出了一些难以启齿的指控，却拿不出证据。"}]}],"synonyms":["unnamables","unspeakables","indescribables","the unmentionables"],"phonetic":"/ɪˈnɑmənəbəlz/","extraExplanation":["“innominable”来自拉丁语词根：in-（不）+ nominare（命名）。英语里更常见的近义表达是“unnamable / unspeakable / indescribable”。","在文学语境中，你可能会联想到塞缪尔·贝克特（Samuel Beckett）的作品《The Unnamable》（法语原名《L’Innommable》）。有时“the innominables”会被用来带点文学色彩地指“无法命名/无法言说之物”。"]}
{"word":"innominata","summary":{"en":"Innominata is a Latin-based word used mainly as (1) an older anatomical plural for the hip bones, and (2) a rare literary term meaning “unnamed women,” often linked to Rossetti’s work.","zh":"Innominata 源自拉丁语，主要用于两种语境：(1) 解剖学旧称，作复数指两块髋骨；(2) 文学中较罕见，指“无名的女性”，常与罗塞蒂作品相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, plural) the hip bones; each is an innominate bone (os coxae) in older terminology.","zh":"（解剖学，复数）髋骨；旧术语中每一块称为“无名骨/髋骨”（os coxae）。"},"examples":[{"en":"In older anatomy textbooks, the pelvis was described as being formed by two innominata and the sacrum.","zh":"在一些较早的解剖学教材里，骨盆被描述为由两块髋骨（innominata）和骶骨组成。"},{"en":"The term innominata is old-fashioned; most modern sources say “hip bones” or “ossa coxae.”","zh":"innominata 这个说法比较旧；现代资料多用“hip bones（髋骨）”或“ossa coxae”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary, rare) “unnamed women,” especially the anonymous or uncredited female voices behind famous poems or love stories; also used as a title reference (e.g., Rossetti’s sonnet sequence).","zh":"（文学用法，罕见）“无名的女性/未被署名的女性”，常指名作或爱情叙事背后那些匿名或未被认可的女性声音；也可用作标题指代（如罗塞蒂的十四行诗组）。"},"examples":[{"en":"Rossetti’s sonnets give a voice to an innominata—an unnamed woman speaking back to a tradition of male-centered love poetry.","zh":"罗塞蒂的十四行诗为一位“无名女性”（innominata）发声，回应以男性为中心的爱情诗传统。"},{"en":"The essay highlights the innominata of literature: women whose stories were preserved without their names.","zh":"这篇文章强调文学中的“无名女性”：故事被保存下来，却没有留下姓名的女性。"}]}],"synonyms":["unnamed","anonymous","innominate","unidentified"],"phonetic":"ɪˌnɑməˈnɑtə","extraExplanation":["词源上来自拉丁语 innominata，意思是“未命名的、无名的”（in- “不” + nominare “命名”）。在英文里更常见的对应词是 innominate / unnamed / anonymous。","解剖学里 “innominate bone（无名骨）”是旧称，指髋骨（os coxae）。如今临床与教材多直接说 hip bone/coxal bone。","文学语境中常与克里斯蒂娜·罗塞蒂（Christina Rossetti）的《Monna Innominata》（1881）相关：她借“无名的女子”这一概念，想象并书写那些在传统爱情诗里常被当作“缪斯/对象”却不具名的女性主体。"]}
{"word":"innominate","summary":{"en":"Innominate means “unnamed,” and it also appears in older anatomy terms for body parts once described as “unnamed.”","zh":"innominate 意为“未命名的/无名的”，也常见于较旧的解剖学术语中，用来指曾被称为“无名”的身体结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not named or not having an official name; unnamed.","zh":"未命名的；没有正式名称的；无名的。"},"examples":[{"en":"The report mentioned an innominate donor who asked to stay anonymous.","zh":"报告提到一位未具名的捐赠者，他要求保持匿名。"},{"en":"They found an innominate village on the old map, marked only with a dot.","zh":"他们在旧地图上发现一个无名村庄，只用一个点标记。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, older/technical) Used in names for certain body parts that were once described as “unnamed,” such as the innominate bone (hip bone) or the innominate artery/vein (brachiocephalic artery/vein).","zh":"（解剖学，较旧/偏专业）用于某些曾被称为“无名”的身体结构名称，如无名骨（髋骨）或无名动脉/静脉（头臂动脉/静脉）。"},"examples":[{"en":"In older anatomy texts, you may see “innominate bone” instead of “hip bone.”","zh":"在较早的解剖学教材中，你可能会看到“innominate bone”用来代替“hip bone（髋骨）”。"},{"en":"The surgeon identified the innominate artery before proceeding.","zh":"外科医生在继续操作前先辨认了无名动脉（头臂动脉）。"}]}],"synonyms":["unnamed","anonymous","unidentified","nameless"],"phonetic":"/ɪˈnɑməneɪt/","extraExplanation":["词源：来自拉丁语 *in-*（不）+ *nominare*（命名），字面意思就是“未被命名的”。","用法提示：日常英语里更常用 *unnamed* 或 *anonymous*；*innominate* 更常见于正式写作、法律/报告语体，或较旧的解剖学术语。"]}
{"word":"innominatum","summary":{"en":"In law, innominatum means “unnamed”—an unclassified contract or legal action without a traditional label.","zh":"在法律语境中，innominatum 指“无名的”：不易归入传统类别、没有固定名称的合同或诉讼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Legal Latin) unnamed; not given a specific name or category.","zh":"（法律拉丁语）无名的；未被赋予特定名称或类别的。"},"examples":[{"en":"The judge referred to it as an innominatum agreement because it didn’t fit a standard contract type.","zh":"法官将其称为“innominatum（无名）协议”，因为它不符合标准合同类型。"},{"en":"Some legal systems still discuss actions innominatum when a claim has no traditional label.","zh":"在一些法系中，仍会讨论“actions innominatum（无名诉讼）”，用于指没有传统名称的请求。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law) an unnamed contract or legal action—one that falls outside the usual named categories.","zh":"（法律）无名合同或无名诉讼：不属于常见“有名”类别的合同或法律请求。"},"examples":[{"en":"They argued the deal was an innominatum, so general principles should apply.","zh":"他们主张该交易属于无名合同，因此应适用一般原则。"},{"en":"Because it was treated as innominatum, the court focused on the parties’ intent and fairness.","zh":"由于被视为无名类型，法院更关注当事人的真实意思与公平性。"}]}],"synonyms":["unnamed","innominate","unclassified","not categorized"],"phonetic":"/ˌɪnɑməˈneɪtəm/","extraExplanation":["“innominatum”源自拉丁语：in-（不）+ nomin-（名字）+ -atum（词尾），字面意思就是“没有名字的”。在法律语境中，它常用来对比“有名合同/有名之诉”（named/nominate contracts/actions），强调该事项不容易被归入传统分类。","在罗马法与部分大陆法传统中常见相关概念，如“contractus innominati（无名合同）”。在英语法律写作里更常见的对应英语词是“innominate”（无名的/不归类的）。"]}
{"word":"innomine","summary":{"en":"In nomine (often misspelled “innomine”) means “in the name of,” used in religious phrases; it’s also a music title/genre for certain Renaissance instrumental pieces.","zh":"In nomine（常被误写为“innomine”）意为“奉……之名”，多用于宗教用语；也可指文艺复兴时期某类器乐作品的标题/体裁。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Latin phrase) “in the name (of).” Often used in Christian prayer formulas, especially “In nomine Patris…” (“In the name of the Father…”).","zh":"（拉丁语短语）“以……之名 / 奉……之名”。常见于基督教祷告公式中，如“In nomine Patris…”（“奉父之名……”）。"},"examples":[{"en":"The priest began, “In nomine Patris, et Filii, et Spiritus Sancti.”","zh":"神父以“In nomine Patris, et Filii, et Spiritus Sancti.”（奉父、及子、及圣灵之名）开始祷告。"},{"en":"The choir sang a piece titled In Nomine during the service.","zh":"唱诗班在礼拜中演唱了一首名为《In Nomine》的作品。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) A title/genre label for instrumental works (especially in Renaissance England) based on a melody associated with the words “in nomine.”","zh":"（音乐）一种标题/体裁标签：尤指英国文艺复兴时期的器乐曲，常以与“in nomine”相关的旋律为基础写作。"},"examples":[{"en":"Many Tudor composers wrote In Nomine consort pieces for viols.","zh":"许多都铎时期作曲家为维奥尔琴合奏写过“In Nomine”作品。"}]}],"synonyms":["in the name of","by the authority of","in God's name"],"phonetic":"/ɪn ˈnoʊmɪneɪ/","extraExplanation":["“innomine”更常见的写法是“In nomine”（分开写）。它来自拉丁语，在宗教语境里常与“In nomine Patris…”连用，相当于英文的“In the name of …”。","音乐里“In Nomine”在英国尤其有名：一些作曲家把弥撒/圣歌中唱到“in nomine”的那段旋律当作固定旋律（cantus firmus）来发展成器乐合奏曲，因此标题直接叫《In Nomine》。"]}
{"word":"innovant","summary":{"en":"“innovant” is a rare English word meaning “innovative,” and sometimes “an innovator.” In everyday English, use “innovative/innovator” instead.","zh":"“innovant”在英语中较少见，通常表示“创新的”，有时也指“创新者”。日常英语更常用“innovative / innovator”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) innovative; introducing new ideas, methods, or products.","zh":"（少见）创新的；引入新想法、新方法或新产品的。"},"examples":[{"en":"The company is known for its innovant approach to sustainable packaging.","zh":"这家公司以其在可持续包装方面的创新做法而闻名。"},{"en":"She prefers to work with teams that are open and innovant.","zh":"她更喜欢与开放、富有创新精神的团队合作。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) a person or group that innovates; an innovator.","zh":"（少见，正式）创新者；改革者。"},"examples":[{"en":"Early innovators were often viewed as innovants who challenged tradition.","zh":"早期的创新者常被视为挑战传统的改革者。"}]}],"synonyms":["innovative","groundbreaking","cutting-edge","innovator","pioneer"],"phonetic":"/ˈɪnəˌvɑnt/","extraExplanation":["“innovant”在英语里非常少见，更常见的对应词是“innovative”（创新的）或“innovator”（创新者）。你可能会在法语语境、品牌命名、学术/法律的正式文本里看到它。","词源上与拉丁语“innovare”（使更新）同源；法语中“innovant”常用作形容词，意为“有创新性的”。"]}
{"word":"innovate","summary":{"en":"Innovate means to introduce new ideas or methods, especially to improve something.","zh":"Innovate 指引入新想法或新方法，尤其是为了改进某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to create or introduce a new idea, method, product, or way of doing something (often to improve it)","zh":"创新；引入新点子、新方法或新产品（通常为了改进）"},"examples":[{"en":"Companies must innovate to stay competitive.","zh":"公司必须不断创新，才能保持竞争力。"},{"en":"She innovated by using recycled materials in her designs.","zh":"她在设计中使用回收材料，这是一种创新。"}]},{"partOfSpeech":"v.","definition":{"en":"to make changes in a traditional system or practice by introducing something new","zh":"在传统制度或做法中引入新事物，从而改革或改良"},"examples":[{"en":"The school is trying to innovate in the way it teaches reading.","zh":"这所学校正在尝试在阅读教学方式上进行创新。"}]}],"synonyms":["create","introduce","modernize","revamp","pioneer"],"phonetic":"/ˈɪnəˌveɪt/","extraExplanation":["“innovate”常见搭配：innovate in + 领域/方面（在……方面创新）；innovate with + 工具/材料（用……来创新）。","词义侧重“把新东西带进来并落地”，不一定是从零发明（那更接近 invent）。例如：把现有技术用在新场景，也可以叫 innovate。"]}
{"word":"innovated","summary":{"en":"“Innovated” means “introduced a new idea or method” and is the past form of “innovate.”","zh":"“Innovated”表示“进行了创新、引入新方法或新想法”，是“innovate”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to introduce something new (a method, idea, product, or system), or to make changes that create something new and useful; past tense/past participle of “innovate.”","zh":"引入新事物（方法、想法、产品或系统），或通过改变创造出新的、有用的东西；“innovate”的过去式/过去分词。"},"examples":[{"en":"The company innovated by using recycled materials in its packaging.","zh":"这家公司通过在包装中使用可回收材料来进行创新。"},{"en":"During the pandemic, many teachers innovated with online lessons.","zh":"在疫情期间，许多老师在网课方面进行了创新。"},{"en":"She has innovated new ways to organize community volunteers.","zh":"她已经创新出组织社区志愿者的新方法。"}]}],"synonyms":["introduced","pioneered","developed","modernized","revamped","improved"],"phonetic":"/ˈɪnəˌveɪtɪd/","extraExplanation":["“innovated”常见于商业、科技、教育等语境，强调“带来新东西”或“用新方式解决问题”。它不一定表示“发明（invent）”从零创造；也可以是对已有事物的改进（比如流程优化、服务模式更新）。","语法提示：过去式 innovated 常用于叙述过去发生的创新；过去分词则常与助动词连用（has/have/had innovated）表示“到某时为止已经完成的创新”。"]}
{"word":"innovates","summary":{"en":"“innovates” means “creates or introduces something new,” and it is the third-person singular present form of “innovate.”","zh":"“innovates”表示“进行创新、引入新事物”，是“innovate”的一般现在时第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to introduce new ideas, methods, or products; to make changes by creating something new","zh":"引入新想法、方法或产品；通过创造新事物来进行改进和变革"},"examples":[{"en":"The company innovates by using AI to improve customer service.","zh":"这家公司通过使用人工智能来改进客户服务，从而进行创新。"},{"en":"Good teachers innovate to keep lessons interesting and effective.","zh":"优秀的老师会不断创新，让课堂更有趣、更有效。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular present) forms of “innovate”: he/she/it innovates","zh":"“innovate”的一般现在时第三人称单数：他/她/它进行创新"},"examples":[{"en":"She innovates in the kitchen by mixing traditional recipes with new flavors.","zh":"她在厨房里通过把传统菜谱和新口味结合起来进行创新。"},{"en":"Our team innovates when we listen to users and test new ideas quickly.","zh":"当我们倾听用户并快速测试新想法时，我们的团队就在创新。"}]}],"synonyms":["creates","develops","invents","pioneers","modernizes"],"phonetic":"/ˈɪnəˌveɪts/","extraExplanation":["“innovates”是动词“innovate”的第三人称单数形式，常见于一般现在时，用来描述习惯性、经常发生的创新行为（例如：A company innovates…）。","常见搭配：innovate in + 领域（在某领域创新）；innovate by + 方法（通过某种方式创新）。在商业语境里，“innovate”通常指推出新产品/新流程；在教育、艺术等语境里，也可指用新方法改进。"]}
{"word":"innovating","summary":{"en":"“Innovating” means creating or introducing new ideas or improvements; it can describe an innovative style or the ongoing action of innovate.","zh":"“innovating”表示“创新/引入新想法或改进”，既可形容“创新的”，也可表示“正在创新”的动作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"creating or introducing new ideas, methods, or products (often to improve something)","zh":"创新的；引入新点子/新方法/新产品（通常为了改进）"},"examples":[{"en":"The company is known for its innovating culture and fast experiments.","zh":"这家公司以创新文化和快速试验而闻名。"},{"en":"Teachers are innovating new ways to make online classes more engaging.","zh":"老师们正在创新新的方法，让线上课程更有吸引力。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of developing and using new ideas, methods, or products","zh":"创新；开发并采用新想法/新方法/新产品的行为"},"examples":[{"en":"Innovating takes time, money, and a willingness to learn from failure.","zh":"创新需要时间、资金，以及从失败中学习的意愿。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “innovate”: to create or introduce something new; to improve by making changes","zh":"“innovate”的现在分词：创新；引入新事物；通过改变来改进"},"examples":[{"en":"They are innovating in battery design to make electric cars cheaper.","zh":"他们正在电池设计上创新，让电动车更便宜。"},{"en":"She keeps innovating instead of copying what others do.","zh":"她一直在创新，而不是照搬别人做法。"}]}],"synonyms":["innovative","pioneering","creative","groundbreaking","inventive"],"phonetic":"/ˈɪnəˌveɪtɪŋ/","extraExplanation":["“innovating”常见于两种语境：\n1）作形容词：an innovating company/approach（一个创新型的公司/方法）；\n2）作动词进行时：We are innovating…（我们正在创新…）。\n日常口语里，人们更常说“innovative”（创新的）来做形容词。","词源：innovate 来自拉丁语 *innovare*（使更新）。因此它常暗含“改进/更新现有事物”的感觉。"]}
{"word":"innovatio","summary":{"en":"“Innovatio” is a rare, Latin-based form meaning “innovation”; in modern English, use “innovation.”","zh":"“Innovatio”是罕见的拉丁语系形式，意思接近“innovation（创新）”；现代英语中通常用“innovation”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; not standard modern English) A Latin-based form meaning “innovation,” referring to introducing something new or renewing something in a new way. In English, people almost always use “innovation.”","zh":"（罕见；非现代标准英语）源自拉丁语的形式，意思接近“innovation（创新）”，指引入新的事物或以新的方式更新。在英语里几乎总是用“innovation”。"},"examples":[{"en":"The report repeatedly uses “innovatio,” but in modern English “innovation” is the usual word.","zh":"这份报告反复使用“innovatio”，但在现代英语中通常用“innovation”。"},{"en":"The author treats innovatio as the act of renewing old practices with new ideas.","zh":"作者把 innovatio 理解为用新观念更新旧做法的行为。"}]},{"partOfSpeech":"n.","definition":{"en":"In historical or scholarly writing, the concept of changing established customs, methods, or beliefs by introducing novelty.","zh":"在历史或学术语境中，指通过引入新元素来改变既有习俗、方法或观念的概念。"},"examples":[{"en":"In times of crisis, innovatio may be seen as either progress or a threat to tradition.","zh":"在危机时期，innovatio 可能被视为进步，也可能被视为对传统的威胁。"}]}],"synonyms":["innovation","renewal","reform","novelty"],"phonetic":"/ˌɪnəˈveɪʃən/","extraExplanation":["“Innovatio”来自拉丁语 innovare（使之更新、改革），与英语 innovation 同源。现代英语几乎不用 innovatio；如果你是在写论文或简历，建议用 innovation。","常见搭配（用 innovation）：technological innovation（技术创新）、innovation in education（教育创新）、drive innovation（推动创新）。"]}
{"word":"innovation","summary":{"en":"Innovation means a new idea or improvement, or the process of creating and applying new ideas to bring value.","zh":"innovation 指“新的改进/新点子”，也指“创造并应用新点子的过程”，强调带来价值与改变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A new idea, method, product, or way of doing something that brings improvement or solves a problem.","zh":"创新；革新：一种新的想法、方法、产品或做事方式，用来带来改进或解决问题。"},"examples":[{"en":"The company’s latest innovation made the app faster and easier to use.","zh":"这家公司最新的创新让应用更快、更好用。"},{"en":"Innovation in healthcare can save lives.","zh":"医疗领域的创新可以拯救生命。"}]},{"partOfSpeech":"n.","definition":{"en":"The process or activity of creating and introducing new ideas or technologies.","zh":"创新活动；创新过程：创造并引入新点子或新技术的过程。"},"examples":[{"en":"Government funding can support innovation in clean energy.","zh":"政府资助可以支持清洁能源领域的创新。"},{"en":"A culture of innovation encourages people to experiment and learn from mistakes.","zh":"创新文化会鼓励人们尝试，并从错误中学习。"}]}],"synonyms":["new idea","novelty","advancement","breakthrough","improvement"],"phonetic":"/ˌɪnəˈveɪʃən/","extraExplanation":["“Innovation”常与“invention（发明）”对比：invention 更强调“从零到一”的发明创造；innovation 更强调“把新点子真正用起来并产生价值”，包括改良与推广。例如：发明了触屏（invention），把触屏做成大众可用的智能手机体验（innovation）。","常见搭配：innovation in + 领域（innovation in education/medicine）；drive/foster/encourage innovation（推动/促进创新）；an innovation hub（创新中心）；incremental innovation（渐进式创新）与 disruptive innovation（颠覆式创新）。","在商业与科技语境里，innovation 往往隐含“可落地、可规模化（scalable）、能带来用户价值/商业价值”的意思。"]}
{"word":"innovation-friendly","summary":{"en":"supportive of innovation","zh":"支持创新、利于创新的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supportive of new ideas, new technology, or new ways of doing things; creating conditions where innovation can happen easily.","zh":"对创新友好；支持新点子、新技术或新做法，并营造有利于创新发生的环境。"},"examples":[{"en":"The company is trying to build an innovation-friendly culture where employees can test new ideas quickly.","zh":"这家公司正努力打造一种对创新友好的文化，让员工能快速测试新想法。"},{"en":"They introduced innovation-friendly policies, such as funding small experiments and reducing approval steps.","zh":"他们推出了对创新友好的政策，比如资助小规模试验并减少审批环节。"},{"en":"An innovation-friendly city attracts startups and skilled workers.","zh":"一个对创新友好的城市更能吸引初创企业和高技能人才。"}]}],"synonyms":["supportive of innovation","innovation-supportive","innovation-enabling","pro-innovation","forward-looking","progressive"],"phonetic":"ˌɪnəˈveɪʃən ˈfrɛndli","extraExplanation":["常见搭配：innovation-friendly environment/culture/policies/regulations/ecosystem（创新友好的环境/文化/政策/法规/生态）。","语气偏正式，常用于报告、新闻和商业写作。口语里也可说 supportive of innovation 或 encourages innovation。"],"etymology":"由 innovation（创新）+ friendly（友好的、支持的）构成的复合形容词，常用连字符表示“对……有利/友好”。多见于商业、政策、城市发展等语境。","mnemonic":["把它拆开记：innovation（创新）+ friendly（友好）= “对创新很友好”。","联想“友好=好做事”：流程更简化、允许试错、给资源→更容易创新。"]}
{"word":"innovation-resistant","summary":{"en":"Unwilling or slow to adopt new ideas or change.","zh":"不愿或很慢接受新点子与改变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not willing to accept, adopt, or support new ideas, methods, or technologies; hard to change in response to innovation.","zh":"抗拒创新的；不愿接受、采用或支持新点子、新方法或新技术的；对创新带来的改变不易动摇的。"},"examples":[{"en":"Some large organizations are innovation-resistant because they fear risk and failure.","zh":"一些大型组织之所以抗拒创新，是因为他们害怕风险和失败。"},{"en":"An innovation-resistant culture can slow down product development.","zh":"一种抗拒创新的文化会拖慢产品开发。"},{"en":"The company wasn’t failing—it was simply innovation-resistant in a fast-changing market.","zh":"这家公司并非经营失败，而是在快速变化的市场里对创新反应迟钝、偏抗拒。"}]}],"synonyms":["resistant to change","change-resistant","innovation-averse","closed-minded","inflexible","traditionalist"],"phonetic":"/ˌɪnəˈveɪʃən rɪˈzɪstənt/","extraExplanation":["常见搭配：innovation-resistant mindset/culture/organization/industry（抗拒创新的思维/文化/组织/行业）。","语气通常偏批评或中性描述，强调“阻力”与“改变难度”，并不一定等同于“保守（conservative）”，更强调对“新事物/新方法”不愿采纳。","近义表达：resistant to innovation；反义表达：innovation-friendly, innovation-driven, open to innovation。"],"etymology":"由 innovation（创新）+ resistant（抵抗的）组成的复合形容词。resistant 源自拉丁语 resistere“反抗、抵住”。整体意思就是“对创新具有抵抗性/不易被创新改变”。","mnemonic":["把它拆开记：innovation（创新）+ resistant（抵抗）=“对创新有抵抗力”。","联想“抗药性（drug-resistant）”的说法：一样是“对某种东西不容易起作用/不容易接受”，这里换成“创新”。"]}
{"word":"innovational","summary":{"en":"Innovational means “related to innovation,” but it is much less common than innovative.","zh":"innovational 意为“与创新有关的”，但使用频率远低于更常见的 innovative。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Less common) relating to new ideas, methods, or changes; connected with innovation.","zh":"（较少见）与新想法、新方法或变革有关的；与创新相关的。"},"examples":[{"en":"The company is known for its innovational approach to customer service.","zh":"这家公司以其在客户服务方面的创新性做法而闻名。"},{"en":"They made several innovational improvements to the design.","zh":"他们对设计做出了几项创新性的改进。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) used to describe something that produces or encourages innovation.","zh":"（较少见/偏技术）用于描述能产生或促进创新的事物。"},"examples":[{"en":"The lab created an innovational environment where students could experiment freely.","zh":"实验室营造了一个促进创新的环境，让学生可以自由实验。"},{"en":"She wanted an innovational culture, not just a single new product.","zh":"她想要的是一种创新文化，而不只是一个新产品。"}]}],"synonyms":["innovative","groundbreaking","novel","original","forward-looking"],"phonetic":"/ˌɪnəˈveɪʃənəl/","extraExplanation":["“innovational”在现代英语里不如“innovative”常用。日常写作/口语中通常用“innovative”（创新的）或“innovation”（创新）。例如：an innovative idea / an innovative company。","词形关系：innovation（n. 创新）→ innovative（adj. 常用）→ innovational（adj. 较少见）。如果你在学术或较正式文本中看到“innovational”，一般理解为“与创新相关的/促进创新的”。"]}
{"word":"innovationist","summary":{"en":"An innovationist is someone who strongly supports or promotes innovation; rarely, it can describe an innovation-promoting style.","zh":"innovationist 指积极支持或推动创新的人；少数情况下也可作形容词，表示“主张创新的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who strongly supports or promotes new ideas, methods, or changes (innovation)","zh":"创新主义者；积极支持或推动新观念、新方法或变革的人"},"examples":[{"en":"As an innovationist, she constantly looks for better ways to serve customers.","zh":"作为一名创新主义者，她不断寻找更好的方式来服务顾客。"},{"en":"The company hired an innovationist to help redesign its outdated workflow.","zh":"公司聘请了一位创新主义者来帮助重设计过时的工作流程。"}]},{"partOfSpeech":"adj.","definition":{"en":"favoring or promoting innovation; open to new approaches (less common)","zh":"主张创新的；倾向于采用新方法的（较少见）"},"examples":[{"en":"He took an innovationist approach to teaching by using more project-based learning.","zh":"他采取了更“创新主义”的教学方式，更多使用项目式学习。"}]}],"synonyms":["innovator","innovation advocate","innovation champion","reformer","progressive"],"phonetic":"/ˌɪnəˈveɪʃənɪst/","extraExplanation":["“innovationist”在现代英语中不算常见，更常用的是“innovator”（创新者）或“innovation advocate/champion”（创新倡导者/推动者）。如果想表达“喜欢尝试新方法的人”，也可以用“forward-thinking”（有前瞻性的）或“progressive”（进步的，视语境而定）。","构词法：innovation（创新）+ -ist（表示“从事者/支持者/信奉者”的后缀，如 artist, realist）。因此它强调的是“立场/倾向”：支持创新、推崇创新。"]}
{"word":"innovations","summary":{"en":"“Innovations” means new ideas or improvements introduced to create better products, services, or ways of doing things.","zh":"“innovations”指创新：引入新的想法或改进，以带来更好的产品、服务或做事方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"New ideas, methods, or products; the act or result of introducing something new that improves how things are done.","zh":"创新；新方法/新点子/新产品；引入新事物并带来改进的行为或结果。"},"examples":[{"en":"Smartphone innovations changed how people communicate and work.","zh":"智能手机的创新改变了人们沟通和工作的方式。"},{"en":"The company invests in innovations to stay competitive.","zh":"这家公司投资于创新，以保持竞争力。"},{"en":"Not all innovations succeed, but they can teach valuable lessons.","zh":"并非所有创新都会成功，但它们能带来宝贵的经验。"}]}],"synonyms":["new developments","advances","breakthroughs","improvements"],"phonetic":"/ˌɪnəˈveɪʃənz/","extraExplanation":["“innovations”是名词复数，单数是“innovation”。作学术或商业语境时很常见：强调“改进”和“带来价值”，不一定是“全世界第一次”，也可以是对旧事物的有效升级。","常见搭配：technological innovations（技术创新）、product innovations（产品创新）、process innovations（流程创新）、drive/boost innovation(s)（推动/促进创新）、innovation in education/healthcare（教育/医疗领域的创新）。","词源提示：来自拉丁语 innovare（使更新），in-（向内/使…）+ novus（新的）。理解“更新、改造”的核心含义有助于记忆。"]}
{"word":"innovative","summary":{"en":"“Innovative” means creative and new, especially in a way that improves or adds value.","zh":"“Innovative”表示“有创新性的”，强调新的做法或想法能带来改进或价值。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Introducing new ideas, methods, or products; creative in a way that brings something new and useful.","zh":"引入新想法、新方法或新产品的；有创新性的，能带来新的且有用的改变。"},"examples":[{"en":"The company is known for its innovative design.","zh":"这家公司以其创新性的设计而闻名。"},{"en":"Teachers tried innovative ways to help students learn English.","zh":"老师们尝试用创新的方法帮助学生学习英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Using new technology or a new approach in a particular field.","zh":"在某一领域采用新技术或新做法的。"},"examples":[{"en":"They developed an innovative medical device.","zh":"他们研发了一种创新型医疗设备。"}]}],"synonyms":["creative","original","inventive","groundbreaking","cutting-edge"],"phonetic":"/ˈɪnəˌveɪtɪv/","extraExplanation":["“Innovative”通常带正面评价，强调“新”不仅是不同，而且更有效或更有价值。与“new（新的）”相比，它更强调创造性和改进；与“invention（发明）”相比，它不一定是从零到一的发明，也可以是对已有事物的改良或新用法（例如创新的教学法）。","常见搭配：innovative idea/design/approach/solution/technology/product；也常用于商业与科技语境，如 “innovative startup（创新型初创公司）”。"]}
{"word":"innovativeinventor","summary":{"en":"“Innovative inventor” means a creative inventor who produces new, original ideas or inventions.","zh":"“Innovative inventor”指富有创造力、能提出新颖原创想法或发明的发明家。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an inventor who creates new and original ideas, methods, or products (a very creative inventor)","zh":"具有创新精神的发明家；能提出新颖原创想法、方法或产品的发明者"},"examples":[{"en":"She is an innovative inventor who designs low-cost medical devices.","zh":"她是一位富有创新精神的发明家，设计低成本的医疗设备。"},{"en":"The innovative inventor tested dozens of prototypes before the final version worked.","zh":"这位创新型发明家在最终版本成功之前测试了几十个原型。"}]}],"synonyms":["creative inventor","pioneering inventor","groundbreaking inventor"],"phonetic":"/ˈɪnəˌveɪtɪv ɪnˈvɛntɚ/","extraExplanation":["你输入的“innovativeinventor”更像是把两个词连在一起：innovative（创新的）+ inventor（发明家）。常见写法是“innovative inventor”（分开写）。","词义小提示：innovative强调“带来新方法/新点子”；inventor强调“发明出新装置/新产品的人”。两者合在一起，强调这个发明家不只是改良，而是常常提出新思路。"]}
{"word":"innovatively","summary":{"en":"“Innovatively” means “in an innovative way”—using new, creative methods or ideas.","zh":"“innovatively”表示“以创新的方式”，强调用新方法或新想法来做事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a new, creative, or original way; using new ideas or methods.","zh":"以创新的方式；用新点子或新方法来做事。"},"examples":[{"en":"The company is using AI innovatively to reduce energy waste.","zh":"这家公司正在以创新的方式使用人工智能来减少能源浪费。"},{"en":"She solved the problem innovatively by combining two simple tools.","zh":"她把两种简单工具结合起来，以创新的方式解决了这个问题。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that introduces something new (often in technology, design, business, or art).","zh":"以带来新事物的方式（常用于科技、设计、商业或艺术语境）。"},"examples":[{"en":"The architect arranged the rooms innovatively to let in more natural light.","zh":"建筑师以创新的方式安排房间布局，让更多自然光进入。"}]}],"synonyms":["creatively","originally","in a new way","inventively"],"phonetic":"ˈɪnəˌveɪtɪvli","extraExplanation":["“innovatively”来自形容词“innovative（创新的）”，常见结构是：do/use/apply + something + innovatively（以创新方式做/用/应用某物）。","语体上较正式，学术写作、商业报告和科技新闻中更常见；日常口语里更常用“in a new way / creatively（以新的方式/有创意地）”。"]}
{"word":"innovativeness","summary":{"en":"“Innovativeness” means the quality or ability to create and apply new, useful ideas.","zh":"“innovativeness”指“创新性/创新能力”，即创造并应用有用新想法的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able to introduce new ideas, methods, or products; creativity in making useful new changes","zh":"创新性；提出新想法、新方法或新产品的能力与特质（强调有用的新变化）"},"examples":[{"en":"The company is known for the innovativeness of its designs.","zh":"这家公司以其设计的创新性而闻名。"},{"en":"We need more innovativeness in solving customer problems.","zh":"我们需要在解决客户问题上更有创新性。"}]}],"synonyms":["creativity","inventiveness","originality"],"phonetic":"/ˈɪnəˌveɪtɪvnəs/","extraExplanation":["“innovativeness”是名词，来自“innovative（创新的）+ -ness（名词后缀）”，意思是“……的性质/程度”。在商务、教育和研究语境中很常见，用来评价组织、产品或个人“是否善于创新”。","近义词里，“innovation”更偏“创新这一件事/成果（一个新点子或新产品）”，而“innovativeness”更偏“创新能力/特质（持续产生并实践新想法的倾向）”。","搭配很常见：innovativenss of + 名词（of the team / of the product）；high/low innovativeness（高/低创新性）；encourage/foster innovativeness（鼓励/培养创新性）。"]}
{"word":"innovator","summary":{"en":"An innovator is someone who brings in new ideas or methods and helps create improvements.","zh":"innovator 指提出并推动新点子/新方法的人，强调带来改进与变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who introduces new ideas, methods, or products, often improving how something is done.","zh":"创新者；引入新想法、新方法或新产品的人，常常用来改进做事方式的人。"},"examples":[{"en":"She is an innovator in online education, creating new ways for students to learn.","zh":"她是在线教育领域的创新者，创造了学生学习的新方式。"},{"en":"The company hired an innovator to redesign its services and stay competitive.","zh":"公司聘请了一位创新者来重新设计服务，以保持竞争力。"}]}],"synonyms":["pioneer","trailblazer","trendsetter","visionary","reformer"],"phonetic":"/ˈɪnəˌveɪtər/","extraExplanation":["词根提示：innovator 来自 innovate（创新）+ -or（表示“做某事的人”）。所以 innovator 直观含义就是“进行创新的人”。","常见搭配：an innovator in/at + 领域（如 an innovator in medicine 医学领域的创新者）；business/tech innovator（商业/科技创新者）。","语感区分：innovator 强调“提出并推动新东西落地的人”；inventor（发明家）更偏向“发明出前所未有的装置/技术”。很多人两者都可能是，但词义侧重点不同。"]}
{"word":"innovators","summary":{"en":"“Innovators” means people who create or introduce new ideas, methods, or products, often bringing change.","zh":"“innovators”指创新者：创造或引入新想法、新方法或新产品，从而带来改变的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who introduce new ideas, methods, or products; creators of change through innovation.","zh":"创新者；提出并实现新想法、新方法或新产品的人。"},"examples":[{"en":"Many innovators in technology focus on solving everyday problems.","zh":"许多科技领域的创新者专注于解决日常问题。"},{"en":"The company rewards innovators who experiment and learn from mistakes.","zh":"公司奖励那些敢于尝试并从错误中学习的创新者。"}]},{"partOfSpeech":"n.","definition":{"en":"People who adopt and promote new ideas or styles earlier than most others.","zh":"（观念或风格的）先行者；比多数人更早接受并推广新事物的人。"},"examples":[{"en":"In fashion, innovators often take risks that later become trends.","zh":"在时尚界，先行者常常冒险尝试，后来这些做法会变成潮流。"}]}],"synonyms":["pioneers","trailblazers","creators","visionaries","early adopters"],"phonetic":"/ˈɪnəˌveɪtərz/","extraExplanation":["“Innovator”常与“inventor（发明家）”对比：inventor 更强调“发明出新东西”，innovator 更强调“把新想法用起来并带来改变”（例如改进流程、商业模式或把技术落地）。","词形提示：innovators 是复数形式；单数是 innovator。常见搭配：innovator in + 领域（an innovator in education/healthcare）；innovative（adj. 创新的）。"]}
{"word":"innovatory","summary":{"en":"“Innovatory” means innovative—introducing new ideas or methods (often formal/BrE).","zh":"“innovatory”意为“创新的”，强调引入新想法或新方法（常见于正式/英式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using or introducing new ideas, methods, or designs; innovative.","zh":"采用或引入新想法、新方法或新设计的；创新的。"},"examples":[{"en":"The company is known for its innovatory approach to online education.","zh":"这家公司以其对在线教育的创新做法而闻名。"},{"en":"They proposed an innovatory design that reduces energy use.","zh":"他们提出了一种能降低能耗的创新设计。"}]}],"synonyms":["innovative","groundbreaking","pioneering","original","cutting-edge"],"phonetic":"/ˈɪnəˌveɪtəri/","extraExplanation":["“innovatory”常见于英式英语或较正式的书面语（如政策、研究、商业报告），在日常口语中更常用“innovative”。两者意思很接近，但“innovatory”有时更强调“开创/引入新的事物”的性质。","词源上与拉丁语“innovare”（更新、使变新）相关，同词族还有“innovation（创新）”“innovate（创新；改革）”。"]}
{"word":"innovatus","summary":{"en":"Innovatus is a Latin borrowing meaning “renewed/made new,” mainly used in formal or stylistic contexts rather than everyday English.","zh":"Innovatus 是借用的拉丁语词，意为“更新的/焕然一新的”，多用于正式或文风化语境，不常用于日常英语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Latin word meaning “renewed; made new; innovated,” used mainly in mottos, academic writing, names, or stylistic contexts (not standard everyday English).","zh":"拉丁语词，意为“更新的；使之焕然一新的；革新的”，多用于格言、学术语境、名称或文风化表达（不是常见的日常英语用词）。"},"examples":[{"en":"The seal included the Latin word “innovatus” to suggest renewal and progress.","zh":"徽章上写着拉丁语“innovatus”，用来表达“更新与进步”的含义。"},{"en":"In the program notes, the composer described the theme as innovatus—reborn in a modern style.","zh":"在节目说明中，作曲家把主题称为“innovatus”，意思是以现代风格“重生”。"}]}],"synonyms":["renewed","revitalized","refreshed","modernized","innovated"],"phonetic":"ˌɪnəˈveɪtəs","extraExplanation":["“innovatus”来自拉丁语动词 innovare（使更新、使革新）的过去分词，字面含义是“被更新/被革新”。因此它更像“renewed / made new”而不是英语里常见的 innovation（创新）的名词用法。","在英语文本中看到 innovatus 时，通常是借用拉丁语来营造庄重、古典或“格言式”的感觉；如果你要写现代英语表达，多数情况下用 renewed、revitalized、modernized、innovated 更自然。"]}
{"word":"innoxious","summary":{"en":"Innoxious means “harmless” or “not harmful,” but it’s uncommon in modern English.","zh":"innoxious 意为“无害的”，但在现代英语中不常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Harmless; not likely to cause injury, pain, or trouble.","zh":"无害的；不会造成伤害、痛苦或麻烦的。"},"examples":[{"en":"The plant is innoxious to humans, so it’s safe to touch.","zh":"这种植物对人类无害，所以摸起来是安全的。"},{"en":"They used an innoxious cleaning solution around the children.","zh":"他们在孩子周围使用了无害的清洁剂。"}]}],"synonyms":["harmless","inoffensive","benign","nonharmful","innocuous"],"phonetic":"ɪˈnɑkʃəs","extraExplanation":["“innoxious”在现代英语中比较少见，更常用的词是“harmless”或“innocuous”。","词源上由 in-（不）+ noxious（有害的）构成；noxious 常见于 “noxious fumes（有毒烟雾）”。","注意拼写：很多学习者想表达“无害的”时会写成 innoxious，但更常见、考试/写作更推荐的是 innocuous（多指“看起来无害、不会引起危险或强烈反应”）。"]}
{"word":"innoxiously","summary":{"en":"“Innoxiously” means “harmlessly,” but it is rare and formal.","zh":"“innoxiously”意思是“无害地”，但用法很少见且偏正式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a harmless way; without causing harm or injury (rare, formal).","zh":"以无害的方式；不造成伤害或损害地（罕见、较正式）。"},"examples":[{"en":"The chemical was tested to ensure it would act innoxiously on the skin.","zh":"这种化学物质经过测试，以确保它对皮肤的作用是无害的。"},{"en":"She spoke innoxiously, careful not to insult anyone.","zh":"她说话很谨慎、无伤大雅，避免冒犯任何人。"}]}],"synonyms":["harmlessly","inoffensively","innocuously","benignly"],"phonetic":"/ɪˈnɑkʃəsli/","extraExplanation":["“innoxiously”非常少见，多见于较老的书面语或学术/法律式表达。日常英语里更常用的近义词是“harmlessly（无害地）”“inoffensively（不冒犯地）”。","它容易与“innocuously（不显眼地；无害地）”混淆；“innocuously”在现代英语更常见。"]}
{"word":"innoxiousness","summary":{"en":"Innoxiousness means harmlessness—the state of not causing harm or offense.","zh":"Innoxiousness 指“无害性”，即不会造成伤害或冒犯的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being harmless; not causing injury, trouble, or offense.","zh":"无害性；无伤害（或无冒犯）的特质。"},"examples":[{"en":"The chemical’s innoxiousness was confirmed by repeated safety tests.","zh":"多次安全测试证实了这种化学品的无害性。"},{"en":"She spoke with an innoxiousness that made even criticism sound gentle.","zh":"她说话带着一种不具攻击性的无害感，连批评听起来都很温和。"}]}],"synonyms":["harmlessness","innocuousness","safety","benignity"],"phonetic":"/ɪˈnɑkʃəsnəs/","extraExplanation":["“innoxiousness”来自形容词“innoxious”（无害的、不会造成伤害的），词根与拉丁语“noxa”（伤害）有关；前缀“in-”在这里表示否定，整体含义类似“没有伤害”。","这个词在现代英语中比较少见，更常用、更自然的表达是“harmlessness”或“innocuousness”（尤指“不冒犯、不惹事”的无害）。在学术或正式语境里可能会看到“innoxious”。"]}
{"word":"inns","summary":{"en":"“Inns” means small hotels or traditional guesthouses for travelers (plural of “inn”).","zh":"“inns”是“inn”的复数，指供旅客住宿的（通常较小、较传统的）旅馆/客栈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “inn”: small hotels, often in the countryside or along roads, that provide lodging (and sometimes food) for travelers","zh":"“inn”的复数：通常指规模较小的旅馆/客栈，多见于乡村或公路沿线，为旅客提供住宿（有时也提供餐食）"},"examples":[{"en":"The hikers stayed at two different inns during their trip.","zh":"徒步旅行者在旅途中住了两家不同的旅馆。"},{"en":"Many old inns in England have centuries of history.","zh":"英国许多老客栈都有数百年的历史。"},{"en":"We booked a room at one of the lakeside inns for the weekend.","zh":"我们在湖边的一家旅馆订了周末的房间。"}]}],"synonyms":["guesthouses","small hotels","lodges","hostels (sometimes)"],"phonetic":"/ɪnz/","extraExplanation":["在英美文化里，inn 常让人联想到更“传统/温馨”的住宿：可能有餐厅、酒吧（pub）、壁炉等氛围感。现代英语里也常用 hotel 更通用；但一些店会刻意用 Inn 作店名来营造古典或乡村风格（如 Holiday Inn 是连锁品牌名称）。"]}
{"word":"Innu","summary":{"en":"the Indigenous Innu people (and their language) in northeastern Canada.","zh":"加拿大东北部的因纽原住民族（及其语言）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a First Nations people in northeastern Canada, mainly in Labrador and Quebec; also the language they speak (Innu-aimun).","zh":"加拿大东北部（主要在拉布拉多与魁北克）的一个原住民族；也可指他们使用的语言（Innu-aimun）。"},"examples":[{"en":"The Innu have long lived in Nitassinan, their ancestral homeland.","zh":"因纽人长期生活在 Nitassinan——他们的祖居地。"},{"en":"Some schools offer programs that include Innu-aimun alongside English and French.","zh":"一些学校开设包含 Innu-aimun（因纽语）以及英语和法语的课程。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Innu people or their language and culture.","zh":"与因纽人、因纽语或其文化相关的。"},"examples":[{"en":"The museum partnered with local communities to present Innu stories respectfully.","zh":"博物馆与当地社群合作，以尊重的方式呈现因纽故事。"},{"en":"She is studying Innu place names to understand local history.","zh":"她在研究因纽地名，以理解当地历史。"}]}],"synonyms":["Montagnais","Innu people"],"phonetic":"ˈɪnu","extraExplanation":["易混点：Innu（因纽人）与 Inuit（因纽特人）不是同一个民族；两者都生活在加拿大北方地区，但历史、语言与文化传统不同。","书写与用法：作为族名通常首字母大写（Innu）。指语言时也常见“Innu-aimun”。在正式写作中，优先使用社群自称与当地组织所采用的名称。"],"etymology":"来自因纽人自称（Innu），意思接近“人/人们”。在英语与法语资料中曾常见旧称“Montagnais（蒙塔涅）”，但当代更倾向使用社群自称“Innu”。","mnemonic":["记忆：Innu≈“in”+“nu（努）”，联想“人在这儿（in）努力生活（努）”，帮助你记住它指“一个民族/人们”。"]}
{"word":"innuate","summary":{"en":"“Innuate” means to suggest something indirectly; it is rare in modern English.","zh":"“innuate”意为“含蓄地暗示/影射”，在现代英语中很少用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hint at or suggest something indirectly (often in a subtle or not openly stated way)","zh":"（多指含蓄地）暗示、影射、旁敲侧击地表达"},"examples":[{"en":"He kept innuating that the project failed because of poor leadership.","zh":"他一直在暗示这个项目失败是因为领导不力。"},{"en":"The article innuates a scandal but offers no clear evidence.","zh":"这篇文章影射有丑闻，但没有给出明确证据。"},{"en":"She didn’t accuse anyone directly—she just innuated that someone was lying.","zh":"她没有直接指控任何人，只是暗示有人在说谎。"}]}],"synonyms":["imply","hint","insinuate","allude (to)","suggest"],"phonetic":"/ˈɪn.ju.eɪt/","extraExplanation":["“innuate”在现代英语中非常少见，日常写作里更常用的是“imply”（暗示）或“hint”（提示）。","很多学习者会把它和“innuendo”（n. 影射/含沙射影的话，常带性暗示或负面含义）混淆；“innuate”强调“以不直接的方式暗示”，不一定带性意味。","如果你在学术或正式写作中想表达“影射/暗指”，更自然的搭配是：imply, insinuate, allude to。"]}
{"word":"innubilous","summary":{"en":"Innubilous means cloudless and clear (often of the sky), and in literary use can mean emotionally “unclouded.”","zh":"Innubilous 指“晴朗无云、清澈”的（常形容天空）；文学中也可指情绪或心境“无阴霾、澄明”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clear and cloudless; not covered by clouds (used especially of the sky).","zh":"晴朗无云的；无云遮蔽的（多用于形容天空）。"},"examples":[{"en":"We woke up to an innubilous sky after two days of rain.","zh":"连下了两天雨后，我们醒来时天空晴朗无云。"},{"en":"The mountain looked sharper under the innubilous morning light.","zh":"在晴朗无云的晨光下，那座山看起来更清晰。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Clear, calm, or untroubled in mood or expression; unclouded.","zh":"（文学用法）澄澈平静的；不受烦扰的；心境“无阴霾”的。"},"examples":[{"en":"Her innubilous confidence reassured the team.","zh":"她那份澄澈而沉稳的自信让团队安心。"},{"en":"He wrote with an innubilous simplicity, free of bitterness.","zh":"他写作朴素澄明，没有怨怼之气。"}]}],"synonyms":["cloudless","clear","unclouded","serene","bright"],"phonetic":"/ɪˈnuːbjələs/","extraExplanation":["“Innubilous”非常少见，带有明显的文学/修辞色彩。日常英语更常用 cloudless、clear、sunny、unclouded。","词源上可理解为 in-（否定）+ nubilous（多云的），因此字面意思是“非多云的”。在诗歌或散文里，它也可借喻“心境无阴霾、情绪清明”。"]}
{"word":"innuendo","summary":{"en":"An innuendo is an indirect hint—often sexual or insulting—rather than a clear statement.","zh":"innuendo 指不直接明说的暗示或影射，常带性暗示或侮辱意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An indirect or subtle hint, often suggesting something negative or inappropriate (especially sexual).","zh":"含沙射影的暗示；影射（常带负面或色情意味）。"},"examples":[{"en":"Her comment sounded like an innuendo about his age.","zh":"她的话听起来像是在影射他的年龄。"},{"en":"The movie uses a lot of sexual innuendo, so it’s not for kids.","zh":"这部电影有很多带性暗示的桥段，所以不适合孩子看。"}]}],"synonyms":["insinuation","hint","implication","suggestion","double entendre"],"phonetic":"ˌɪn.juˈɛn.doʊ","extraExplanation":["“innuendo”常用于描述说话者不明说、但让人“听得出来”的暗示，语气往往不友好或带挑逗意味。使用时要注意场合：在正式写作或职场沟通中，指责别人“make innuendos”可能很尖锐。","词源来自拉丁语，原义类似“通过点头/暗示”。在法律或新闻语境中，它也可指“含蓄的指控/影射”，强调不直接明说但造成影响。","相关表达：\"make innuendos\"（说含沙射影的话）、\"a thinly veiled innuendo\"（几乎不加掩饰的暗示）、\"double entendre\"（双关语，常含性暗示；比innuendo更强调语言的“双重意思”）。"]}
{"word":"innuendo-laden","summary":{"en":"full of indirect (often sexual) hints","zh":"充满影射（常带性暗示）的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of indirect, often humorous hints or suggestions, especially about sex or something improper, rather than saying it directly.","zh":"充满影射、含沙射影的暗示（常带幽默感），尤其指性或不太得体的内容；不明说而是拐弯暗示。"},"examples":[{"en":"The movie is funny but a bit innuendo-laden, so it may not be suitable for kids.","zh":"这部电影很好笑，但暗示梗很多，可能不太适合小孩。"},{"en":"He made an innuendo-laden comment that made everyone uncomfortable.","zh":"他讲了一句充满影射的评论，让大家都很尴尬。"},{"en":"The song’s lyrics are innuendo-laden, hinting at romance without being explicit.","zh":"这首歌的歌词暗示很多，用影射来表达暧昧而不直白。"}]}],"synonyms":["suggestive","implied","hinting","double-entendre-filled","allusive"],"phonetic":"/ˌɪn.juˈɛn.doʊ ˈleɪ.dən/","extraExplanation":["“innuendo-laden”常用于描述笑话、台词、歌词、评论等：内容表面正常，但听者能“听懂弦外之音”。","语气多为批评或提醒（不够得体/有点低俗），但也可能是中性描述（比如喜剧风格）。","同类结构：meaning-laden（意味深长的）、symbolism-laden（充满象征的）、jargon-laden（术语堆砌的）。"],"etymology":"“innuendo”源自拉丁语 innuere（点头示意、暗示），后来在英语里发展为“影射、暗指（常带不雅或性暗示）”。“-laden”表示“充满……的、装满……的”，所以 innuendo-laden 就是“充满影射暗示的”。","mnemonic":["把 -laden 记成“laden=载满/满载”（像“货车装满货”）；innuendo-laden=“装满暗示”的。","联想“in + nuance（细微差别）”：虽然拼写不同，但都让人想到“不是明说、靠细微暗示去懂”。"]}
{"word":"innuendoed","summary":{"en":"Innuendoed means “hinted or suggested indirectly,” and it’s a rare verb form of innuendo.","zh":"innuendoed 指“以影射/暗示的方式表达”，是 innuendo 的罕见动词形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To hint or suggest something indirectly, often something critical, offensive, or sexual; past tense/past participle form.","zh":"（罕用）以暗示的方式影射、含沙射影地表达（常带批评、冒犯或性暗示）；过去式/过去分词。"},"examples":[{"en":"He innuendoed that she got the job because of her connections.","zh":"他影射她得到那份工作是因为有关系。"},{"en":"The comedian innuendoed about the couple’s relationship without saying anything directly.","zh":"那位喜剧演员用暗示的方式拿那对情侣的关系开玩笑，但没有明说。"}]}],"synonyms":["hinted","implied","insinuated","suggested","alluded"],"phonetic":"/ˌɪn.juˈɛn.doʊd/","extraExplanation":["“innuendoed”来自名词“innuendo（含沙射影、影射）”的动词化用法，但在现代英语里很少见。写作与口语中更常用：hinted（暗示）、implied（暗指）、insinuated（含沙射影/暗讽）。","在语气上，“innuendo/innuendoed”常带有“不直接说、让人自己领会”的意味，尤其用于带讽刺、八卦或性暗示的表达。"]}
{"word":"innuendoes","summary":{"en":"“Innuendoes” means indirect hints—often with rude or sexual suggestions—without saying things plainly.","zh":"“innuendoes”指不直接说明、而用含沙射影方式暗示（常带粗俗或性意味）的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Indirect or subtle hints, often suggesting something rude or sexual without saying it directly.","zh":"影射；含沙射影（常带有粗俗或性暗示，但不明说）"},"examples":[{"en":"The movie is full of innuendoes, but nothing is stated openly.","zh":"这部电影充满了各种影射，但没有任何内容被公开明说。"},{"en":"His jokes relied on innuendo rather than direct insults.","zh":"他的玩笑更多靠含沙射影，而不是直接侮辱。"},{"en":"She avoided innuendoes at work to keep the conversation professional.","zh":"她在工作场合避免用影射话语，以保持对话专业。"}]}],"synonyms":["insinuations","hints","suggestions","double entendres","allusions"],"phonetic":"/ˌɪn.juˈɛn.doʊz/","extraExplanation":["“innuendoes”是“innuendo”的复数形式。日常写作中也常见复数拼写“innuendos”（不带e），两种都算正确。","在英语语境里，innuendo常与幽默、八卦或攻击性言论相关：说话者用“你懂的”式暗示，让听者自己联想，从而既达到效果又保留否认空间（plausible deniability）。","文学与戏剧中，innuendo常用于塑造人物机智、讽刺社会风气，或在审查较严的环境下表达敏感内容。"]}
{"word":"innuendoing","summary":{"en":"“Innuendoing” means hinting indirectly (often suggestively), though it’s an uncommon verb form; people more often say “insinuating” or “making innuendos.”","zh":"“innuendoing”指用影射的方式暗示（常带挑逗意味），但作为动词形式较少见，更常说“insinuating”或“making innuendos”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “innuendo”) hinting something indirectly, often in a suggestive or insulting way.","zh":"（“innuendo”的现在分词）用含沙射影的方式暗示某事，常带挑逗或讽刺/攻击意味。"},"examples":[{"en":"He kept innuendoing about her promotion, as if she didn’t earn it.","zh":"他一直用影射的方式谈她的升职，好像她不是凭实力得来的一样。"},{"en":"The host was innuendoing, and the audience understood the joke without anything being said directly.","zh":"主持人在打擦边球式的暗示，观众不用明说也听懂了笑点。"}]}],"synonyms":["insinuating","hinting","suggesting","implying","making innuendos"],"phonetic":"/ˌɪn.juˈɛn.doʊ.ɪŋ/","extraExplanation":["“innuendo”更常见的词性是名词（an innuendo：影射/含沙射影的话）。把它当作动词用（to innuendo）比较少见，因此“innuendoing”在日常英语里也不太常用。更自然的表达通常是：insinuating（影射、暗示）、hinting（暗示）、making innuendos（说影射的话）。","语气上，“innuendoing”往往带有负面评价：说话者在“拐弯抹角”地让人联想到某种（常是性或丑闻）含义，而不是直接说明。"]}
{"word":"innuendos","summary":{"en":"“Innuendos” are indirect, suggestive hints or remarks (often negative or sexual).","zh":"“innuendos”指带暗示（常为负面或性暗示）的影射话/暗讽话，为“innuendo”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An indirect (often suggestive) remark or hint—especially one that implies something negative or sexual without saying it directly.","zh":"影射、暗示（常带挑逗或讥讽意味）的说法；不明说而让人“听懂”的话，尤其指含有负面或性暗示的言语。"},"examples":[{"en":"The comedian’s jokes were full of innuendos, but he never said anything explicit.","zh":"那位喜剧演员的段子充满暗示，但他从不把话说得露骨。"},{"en":"Her comment sounded like an innuendo about his honesty.","zh":"她那句话听起来像是在影射他的诚实。"},{"en":"Try to avoid sexual innuendos at work.","zh":"在工作场合尽量避免带性暗示的话。"}]}],"synonyms":["hint","implication","insinuation","suggestion","double entendre"],"phonetic":"/ˌɪn.juˈɛn.doʊ/","extraExplanation":["“innuendos”是复数形式；单数是“innuendo”。在正式或中性语境里也可用来指“拐弯抹角的影射/暗讽”，但在日常英语中常见搭配是“sexual innuendo（性暗示）”。","语气上，“innuendo”通常带有让对方难堪、挑逗、或故意不直说的感觉；如果你只是想表达“委婉表达/暗示”，更中性的是“hint”或“implication”。"]}
{"word":"innuit","summary":{"en":"Inuit refers to Indigenous peoples of the Arctic, commonly used as both singular and plural in English.","zh":"Inuit 指北极地区的原住民族群“因纽特人”，在英语中常可作单复数通用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of Indigenous peoples living mainly in the Arctic regions of Canada, Greenland, and Alaska; the word is often used as both singular and plural in English.","zh":"因纽特人：主要生活在加拿大、格陵兰和阿拉斯加等北极地区的原住民族群；在英语里常同时作单数和复数使用。"},"examples":[{"en":"The Inuit have rich traditions of storytelling and art.","zh":"因纽特人拥有丰富的讲故事与艺术传统。"},{"en":"Many Inuit communities live in Nunavut in northern Canada.","zh":"许多因纽特社区生活在加拿大北部的努纳武特地区。"},{"en":"She is Inuit and speaks Inuktitut at home.","zh":"她是因纽特人，在家说因纽特语（Inuktitut）。"}]}],"synonyms":["Inuk (singular form in some contexts)"],"phonetic":"/ˈɪn.ju.ɪt/","extraExplanation":["你输入的“innuit”常见于把“Inuit”拼错；标准拼法是 Inuit（首字母通常大写）。","用法上：Inuit 在英语里常既作单数也作复数（如“an Inuit person / Inuit people”）；也可用 Inuk 表示“一个因纽特人”。","文化与称呼：在许多语境中 Inuit 被认为比 “Eskimo” 更尊重、更准确（但具体用词也会因地区与个人偏好而异）。","相关词：Inuktitut（因纽特语的一种/加拿大常见的因纽特语言名称）；Nunavut（加拿大的因纽特占多数的地区）。"]}
{"word":"innumerabilis","summary":{"en":"Innumerabilis is a Latin adjective meaning “countless/innumerable,” mainly seen in scholarly or poetic English contexts.","zh":"Innumerabilis 是拉丁语形容词，意为“无数的/数不清的”，在英语中多见于学术或诗歌等较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in English mainly in scholarly, religious, or poetic contexts) countless; too many to be counted.","zh":"（拉丁语；英语中多见于学术、宗教或诗歌语境）无数的；多到数不清的。"},"examples":[{"en":"The night sky seemed innumerabilis, filled with stars beyond counting.","zh":"夜空仿佛无数，布满了数也数不清的星星。"},{"en":"In older texts, you may see “innumerabilis” describing God’s mercy as limitless.","zh":"在较古的文本中，你可能会看到用“innumerabilis”来形容上帝的慈悲无穷无尽。"}]}],"synonyms":["innumerable","countless","numberless","myriad"],"phonetic":"/ɪˌnuːməˈrɑːbɪlɪs/","extraExplanation":["“innumerabilis”是拉丁语形容词，来自 in-（不、无）+ numerare（计数）。现代英语更常用的对应词是 innumerable / countless。","在英语语境里，它通常作为引用拉丁文（如格言、神学文本、古典文学研究）出现，而不是日常用词。"]}
{"word":"innumerability","summary":{"en":"“Innumerability” means the state of being too many to count—countlessness.","zh":"“innumerability”指“多到无法计数的状态”，即“无数（性）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too many to be counted; countlessness.","zh":"多得数不清；无数（性）。"},"examples":[{"en":"The innumerability of stars in the night sky made her feel small.","zh":"夜空中星星的无数，让她觉得自己很渺小。"},{"en":"They were struck by the innumerability of tiny details in the painting.","zh":"他们被这幅画里数不清的细节所震撼。"}]}],"synonyms":["countlessness","incalculability","innumerableness","myriadness","infinity"],"phonetic":"/ɪˌnuːmɚəˈbɪləti/","extraExplanation":["“innumerability”比较少见，更常用的说法是“innumerable” (adj. 无数的) 或 “countless” (adj. 数不清的)，以及名词“countlessness / infinity”（视语境而定）。","构词：in-（不）+ numerable（可数的）+ -ity（名词后缀），字面意思是“不可计数的性质”。","使用语域：偏书面或文学表达，常用来强调规模巨大、难以统计（如星星、问题、细节、选择）。"]}
{"word":"innumerable","summary":{"en":"Innumerable means 'so many that you cannot count them.'","zh":"innumerable 表示“多到无法计数”，强调数量极其庞大。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too many to be counted; countless.","zh":"多得数不清的；无数的。"},"examples":[{"en":"She has made innumerable small sacrifices for her family.","zh":"她为家人做出了无数次小小的牺牲。"},{"en":"The night sky was filled with innumerable stars.","zh":"夜空布满了数不清的星星。"},{"en":"They faced innumerable challenges while building the project.","zh":"他们在建设这个项目时遇到了无数挑战。"}]}],"synonyms":["countless","numberless","myriad","innumerous"],"phonetic":"/ɪˈnuːmərəbəl/","extraExplanation":["词源上可拆成 in-（否定）+ numer-（数字、计数）+ -able（能够……的），字面意思是“不能被数出来的”。","常见搭配：innumerable times（无数次）、innumerable reasons（无数理由）、innumerable stars（繁星无数）。语气通常比 many 更强，接近 countless / numberless。"]}
{"word":"innumerableness","summary":{"en":"Innumerableness means the quality of being countless—too many to count.","zh":"Innumerableness 指“多得数不清”的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being too many to be counted; countlessness","zh":"多得数不清的状态；无数性"},"examples":[{"en":"The innumerableness of stars in the night sky made her feel small.","zh":"夜空中星星的无数，让她感到自己很渺小。"},{"en":"He was overwhelmed by the innumerableness of emails waiting in his inbox.","zh":"收件箱里堆着数不清的邮件，让他不知所措。"}]}],"synonyms":["countlessness","myriadness","numberlessness","incalculability","immensity"],"phonetic":"/ɪˈnuːmərəbəlnəs/","extraExplanation":["“innumerableness”由形容词“innumerable（数不清的）”+ 名词后缀“-ness（……的状态/性质）”构成，意思很直观，但在现代英语里相对少见。更常用的表达是“the countless number of … / the sheer number of … / countlessness”。在正式写作中偶尔会出现，用来强调“多到无法计数”的感觉。"]}
{"word":"innumerably","summary":{"en":"“Innumerably” means “in countless numbers; too many to count.”","zh":"“innumerably”表示“无数地；多得数不清地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too many to be counted; in countless numbers.","zh":"多得数不清地；无数地。"},"examples":[{"en":"The night sky was filled with innumerably bright stars.","zh":"夜空布满了无数颗明亮的星星。"},{"en":"She has been helped in innumerably small ways by her neighbors.","zh":"邻居在无数个细小的方面帮助过她。"}]}],"synonyms":["countlessly","incalculably","in countless numbers","numberlessly"],"phonetic":"ɪˈnuːmɚəbli","extraExplanation":["“innumerably”来自 in-（不）+ numerable（可数的）。常见搭配有：innumerably many / innumerably varied（多得数不清 / 多种多样）。","语气上比 “very many” 更强调“无法计数”的感觉，常用于文学描写或较正式的写作，例如描写星星、可能性、细节、影响等。"]}
{"word":"innumerate","summary":{"en":"Innumerate means lacking basic number skills or not able to deal with numbers well.","zh":"Innumerate 指缺乏基本数字能力、不善于处理数字或计数。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to count, or lacking basic number skills; not numerate.","zh":"不会数数的；缺乏基本数字能力的（不善于处理数量或数字）。"},"examples":[{"en":"He felt embarrassed because he was innumerate and couldn’t calculate the tip.","zh":"他因为自己不善于处理数字、算不出小费而感到尴尬。"},{"en":"Some adults are not illiterate, but they are innumerate, so budgeting is hard.","zh":"有些成年人并非文盲，但数字能力不足，所以做预算很困难。"}]}],"synonyms":["not numerate","bad with numbers","countless (incorrect—means “innumerable”)"],"phonetic":"/ɪˈnuːməɹət/","extraExplanation":["“innumerate”较少见，日常更常用“not good with numbers”“bad at math”或“lacking numeracy”。","词形结构：in-（不、非）+ numerate（有数字能力的）。不要和“innumerable”（无数的）混淆：innumerable=数量多得数不清；innumerate=不会数或数字能力不足。"]}
{"word":"innumerous","summary":{"en":"Innumerous means extremely many—so many that you can’t count them.","zh":"Innumerous 表示“多得数不清的、无数的”，常用于较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too many to be counted; very many.","zh":"多得数不清的；无数的。"},"examples":[{"en":"She has received innumerous messages since the announcement.","zh":"自从发布公告以来，她收到了无数条消息。"},{"en":"Innumerous stars filled the night sky.","zh":"夜空中布满了无数颗星星。"}]}],"synonyms":["countless","innumerable","myriad","numerous"],"phonetic":"/ɪˈnuːmərəs/","extraExplanation":["“Innumerous”常用于较正式的书面语，强调数量之大以至于“数不过来”。常见搭配有：innumerous reasons（无数个理由）、innumerous times（无数次）、innumerous people（无数人）。","词形上来自拉丁语前缀 in-（不/无）+ numerous（众多的），字面意思就是“不是‘能数得清的’”。","注意：在现代英语里，“countless”更口语、更常用；“innumerable”与“innumerous”意思很接近，但“innumerable”更常见。"]}
{"word":"innutrient","summary":{"en":"A nutrient is a substance in food that your body needs to stay healthy.","zh":"nutrient 指食物中人体维持健康所需的营养素/营养成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance in food that the body needs to grow, repair itself, and stay healthy (for example, vitamins, minerals, protein, fat, and carbohydrates).","zh":"营养素；（食物中的）营养成分（如维生素、矿物质、蛋白质、脂肪、碳水化合物等），人体生长、修复和维持健康所必需。"},"examples":[{"en":"Vegetables provide important nutrients like fiber and vitamins.","zh":"蔬菜能提供重要的营养素，比如膳食纤维和维生素。"},{"en":"Calcium is a nutrient that helps build strong bones.","zh":"钙是一种有助于强健骨骼的营养素。"},{"en":"A balanced diet includes a variety of nutrients.","zh":"均衡饮食包含多种营养素。"}]}],"synonyms":["nutriment","nourishment","food substance"],"phonetic":"/ˈnuːtriənt/","extraExplanation":["你输入的 **innutrient** 很可能是拼写错误；常见正确拼写是 **nutrient**。","构词小提示：**nutri-** 与“滋养/营养”相关（如 *nutrition* 营养、*nutritious* 有营养的）。"]}
{"word":"innutrition","summary":{"en":"“Innutrition” is a rare noun meaning the process of nourishing the body—essentially nutrition or nourishment.","zh":"“Innutrition” 是一个罕用名词，指滋养身体的过程，本质上就是“营养/滋养”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) The act or process of nourishing the body; nutrition; nourishment.","zh":"（罕用/专业）滋养身体的行为或过程；营养；养分供给。"},"examples":[{"en":"Innutrition refers to the body’s process of taking in and using nutrients from food.","zh":"Innutrition 指的是身体从食物中摄取并利用营养素的过程。"},{"en":"The report discussed how stress can affect innutrition and overall health.","zh":"报告讨论了压力如何影响营养吸收与整体健康。"}]}],"synonyms":["nutrition","nourishment","nurture","feeding"],"phonetic":"/ˌɪn.nuˈtrɪʃ.ən/","extraExplanation":["“innutrition”在现代英语中非常少见，多见于较旧的医学/生理学写作里，用来强调“营养进入体内并被利用”的过程。现代更常用的词是“nutrition”（营养）或“nourishment”（滋养/营养）。如果你是在论文或教材里看到它，通常可理解为 nutrition 的更书面或更强调“内在摄取”的表达。"]}
{"word":"innutritious","summary":{"en":"Innutritious means lacking nutrients and not good for health.","zh":"Innutritious 指“缺乏营养的，对健康不利的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not providing enough nutrients to support health; lacking vitamins, minerals, protein, etc.","zh":"（食物）缺乏营养的；不能提供足够营养以维持健康的"},"examples":[{"en":"Instant noodles can be filling, but they’re often quite innutritious.","zh":"方便面可能很顶饱，但往往营养不足。"},{"en":"A diet that is mostly sugary drinks and chips is innutritious.","zh":"如果饮食主要是含糖饮料和薯片，那就是缺乏营养的。"},{"en":"The doctor warned that an innutritious diet may lead to fatigue and poor immunity.","zh":"医生警告说，营养不足的饮食可能导致疲劳和免疫力下降。"}]}],"synonyms":["unhealthy","non-nutritious","low-nutrient","nutrient-poor"],"phonetic":"/ˌɪnnuˈtrɪʃəs/","extraExplanation":["这个词由前缀 in-（表示“否定/不”）+ nutritious（有营养的）构成，意思就是“没有营养”。","它常用来评价“食物/饮食习惯”，语气比较直接，有时带一点批评意味。更中性的说法可以用 low in nutrients（营养含量低）或 not very nutritious（不太有营养）。","常见搭配：innutritious food/diet/meal（缺乏营养的食物/饮食/一餐）。"]}
{"word":"innutritiousness","summary":{"en":"“Innutritiousness” means the state or quality of having little or no nutritional value.","zh":"“Innutritiousness”指“缺乏营养、营养价值很低”的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being not nutritious; having little or no nutritional value.","zh":"缺乏营养的性质；几乎没有营养价值。"},"examples":[{"en":"The innutritiousness of many sugary snacks means they fill you up without helping your body much.","zh":"许多高糖零食的缺乏营养性在于：它们会让你觉得饱，但对身体帮助不大。"},{"en":"She avoided the innutritiousness of fast food by cooking simple meals at home.","zh":"她通过在家做简单饭菜来避免快餐的缺乏营养性。"}]}],"synonyms":["poor nutritional value","low nutritional value","lack of nutrition","nutritional emptiness"],"phonetic":"/ˌɪn.nuˈtrɪʃ.əs.nəs/","extraExplanation":["“Innutritiousness”来自形容词“innutritious（缺乏营养的）”，前缀 in- 表示“不”，后接 nutritive/nutritious（有营养的），再加名词后缀 -ness 表示“……的性质/状态”。","这个词在日常口语中不算常见，更常见的表达是 “lack of nutrition / poor nutritional value / low nutritional value（营养价值低）”。在学术或正式写作（如健康报告、营养学文章）中更可能出现。"]}
{"word":"innutritive","summary":{"en":"“Innutritive” means not providing enough nutrients or nourishment.","zh":"“innutritive” 指（食物等）营养价值很低或几乎没有营养。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Providing little or no nourishment; not nutritious.","zh":"（食物）几乎不含营养的；无营养价值的。"},"examples":[{"en":"Soda is often described as innutritive because it has lots of sugar but few nutrients.","zh":"汽水常被说成是无营养的，因为糖很多但营养素很少。"},{"en":"If snacks are mostly innutritive, you may feel hungry again soon.","zh":"如果零食大多没什么营养，你可能很快又会觉得饿。"}]}],"synonyms":["not nutritious","nutrient-poor","lacking nutrients","non-nutritive"],"phonetic":"/ˌɪnˈnuːtrɪtɪv/","extraExplanation":["词形提示：in- 表示“否定/相反”，nutritive 来自 nutrition（营养）。因此 innutritive 直观含义就是“缺乏营养的”。","使用场景：这个词在日常口语中不算常见，更常见的说法是 not nutritious / lacking nutrients / nutrient-poor。innutritive 更偏书面或科普/营养学语境。","同类表达的语气差别：junk food（垃圾食品）带有更强的评价色彩；innutritive 更中性，强调“营养价值低”这一事实。"]}
{"word":"innyard","summary":{"en":"An innyard is the yard/courtyard of an inn, especially in older or historical contexts.","zh":"innyard 指旅店的院子/庭院，多用于较旧或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A yard or courtyard belonging to an inn (a small hotel), often used for arriving coaches, unloading goods, or gathering outdoors.","zh":"旅店（小型酒店）的院子/庭院，过去常用于马车到达、卸货或户外聚集。"},"examples":[{"en":"The travelers left their horses in the innyard before going inside for supper.","zh":"旅客们先把马拴在旅店院子里，然后进屋吃晚饭。"},{"en":"Children played in the innyard while the adults talked near the doorway.","zh":"大人们在门口聊天时，孩子们在旅店院子里玩耍。"}]}],"synonyms":["inn yard","courtyard","inn courtyard","yard"],"phonetic":"/ˈɪnˌjɑrd/","extraExplanation":["“innyard”比较少见，更多时候写作两个词“inn yard”，或用更常见的“courtyard (庭院)”来表达。","在英美历史语境里，旅店常是驿站性质（供旅客与马匹休息），院子可能是马厩、停靠马车、装卸货物与社交活动的空间；在一些旧小说或历史描写中会出现。"]}

