{"word":"inracinate","summary":{"en":"Inracinate means “to make something take deep root” or “to become deeply rooted,” often used about ideas, habits, or feelings.","zh":"inracinate 指“使深深扎根/根深蒂固”或“变得根深蒂固”，常用于观念、习惯、情感等抽象事物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to plant or fix deeply; to cause (an idea, habit, or feeling) to become firmly established","zh":"使深深扎根；使（观念、习惯、情感等）根深蒂固"},"examples":[{"en":"Good teaching can inracinate a love of reading in children.","zh":"良好的教学能在孩子心中扎根对阅读的热爱。"},{"en":"Over time, fear became inracinated in the community.","zh":"久而久之，恐惧在社区里根深蒂固。"}]},{"partOfSpeech":"vi.","definition":{"en":"to take root deeply; to become firmly settled","zh":"深深扎根；变得牢固、稳定"},"examples":[{"en":"If the plant inracinates, it will survive the winter better.","zh":"如果植物扎稳根，它更能熬过冬天。"}]}],"synonyms":["entrench","root","implant","ingrain","embed","be deeply rooted"],"phonetic":"/ɪnˈræsəˌneɪt/","extraExplanation":["“inracinate”较少见，更常见的同义表达是“take root”“become entrenched”“be deeply rooted”。写作中若担心读者不熟悉，可用这些更常用的说法替换。","词源来自拉丁语 radix（“根”），因此常用于比喻：思想/偏见/传统“扎根”。可联想词：eradicate（连根除掉）与 radish（小萝卜，同源）。"]}
{"word":"inradii","summary":{"en":"“Inradii” is the plural of “inradius,” meaning the radii of inscribed circles (usually in triangles).","zh":"“inradii”是“inradius（内切圆半径）”的复数，指（通常在三角形中）内切圆的多个半径。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of inradius: the radii of circles inscribed inside shapes (especially triangles), each touching all sides","zh":"inradius（内切圆半径）的复数：指内切于图形（尤指三角形）且与各边相切的圆的半径（多个）"},"examples":[{"en":"Different triangles can have very different inradii, even if their areas are similar.","zh":"即使面积相近，不同的三角形也可能有非常不同的内切圆半径（inradii）。"},{"en":"We calculated the inradii of several polygons to compare how “tight” the incircles fit.","zh":"我们计算了几个多边形的内切圆半径（inradii），来比较内切圆贴合得有多“紧”。"}]}],"synonyms":["inradius"],"phonetic":"/ɪnˈreɪdi.aɪ/","extraExplanation":["“inradii”多见于数学/几何语境，是“inradius”的不规则复数形式：inradius → inradii（类似 radius → radii）。","inradius（内切圆半径）通常指三角形内切圆的半径；对应的相关概念有 circumradius（外接圆半径）。在三角形中常用公式：r = A / s（r为内切圆半径，A为面积，s为半周长）。","如果你输入的“inradii”其实是想写“in radii”（在……半径范围内/以半径表示），那属于两个词的搭配，而不是这个几何名词。可告诉我上下文句子，我可以帮你判断。"]}
{"word":"inradius","summary":{"en":"The radius of a circle inscribed in a shape (especially a triangle), tangent to all sides.","zh":"图形（尤指三角形）的内切圆半径，即与各边相切的内切圆的半径。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The radius of a circle that fits inside a shape (especially a triangle) and touches all its sides; the radius of an inscribed circle.","zh":"内切圆半径；（尤指三角形的）内切圆的半径，即与各边都相切的内切圆的半径。"},"examples":[{"en":"In a triangle, the inradius is the distance from the incenter to any side.","zh":"在三角形中，内切圆半径是从内心到任意一边的距离。"},{"en":"We used the triangle’s area and semiperimeter to calculate the inradius.","zh":"我们用三角形的面积和半周长来计算内切圆半径。"},{"en":"The inradius is smaller than the circumradius for any non-equilateral triangle.","zh":"对于任何非等边三角形，内切圆半径都小于外接圆半径。"}]}],"synonyms":["inscribed circle radius","radius of the incircle"],"phonetic":"/ˈɪnˌreɪdiəs/","extraExplanation":["在三角形里，内切圆半径常用公式：r = A / s，其中 A 是面积，s 是半周长（s = (a+b+c)/2）。","“in-”表示“在……里面”，radius 表示“半径”，合起来就是“内侧的半径”。常与 incenter（内心）一起出现。"]}
{"word":"inradiuses","summary":{"en":"Inradius is a geometry term meaning the radius of a circle inscribed in a polygon (often a triangle).","zh":"Inradius 是几何术语，指多边形（常见为三角形）的内切圆半径。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geometry) the radius of the largest circle that can fit inside a polygon (especially a triangle), touching all sides; the radius of an inscribed circle.","zh":"（几何）内切圆半径：能放在多边形（尤指三角形）内部、并与各边相切的最大圆的半径。"},"examples":[{"en":"In an equilateral triangle, the inradius is smaller than the circumradius.","zh":"在等边三角形中，内切圆半径比外接圆半径小。"},{"en":"We used the formula for the inradius to solve the triangle problem.","zh":"我们用内切圆半径的公式来解这道三角形题。"}]}],"synonyms":["inscribed-circle radius","incircle radius"],"phonetic":"/ˈɪnˌreɪdiəs/","extraExplanation":["你输入的“inradiuses”不是常见标准拼写。你可能想写的是 **inradius**（内切圆半径）的复数：常见写法是 **inradii**，也有人写 **inradiuses**（较少见，但可理解）。","不要把 **inradius** 和 **radius**（半径）混淆：**radius** 是任何圆的半径；**inradius** 特指“内切圆”的半径。"]}
{"word":"inrail","summary":{"en":"Inrail means the inner rail of a track, especially in horse racing.","zh":"inrail 指赛道的内侧栏杆，尤用于赛马语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the inner rail of a track (especially a horse-racing track); the rail closest to the center of the course","zh":"（赛道的）内侧栏杆；（尤指赛马场）靠近赛道中心的一侧护栏"},"examples":[{"en":"The horse saved ground by running along the inrail.","zh":"那匹马贴着内侧栏杆跑，从而少跑了距离。"},{"en":"Jockeys often fight for position near the inrail at the first turn.","zh":"在第一个弯道处，骑师们常常争夺靠近内侧栏杆的位置。"}]}],"synonyms":["inner rail","inside rail","rail (inner side)"],"phonetic":"/ˈɪnˌreɪl/","extraExplanation":["“inrail”多用于赛马或赛车场景，强调“贴着内圈跑”，因为内圈路线更短，通常更省体力、也更容易占据有利位置。","更常见的写法是 two words：\"in rail\"，或带连字符：\"in-rail\"；在解说或赛事报道中也常见短语 \"on the inrail\"（贴内栏）。"]}
{"word":"inreality","summary":{"en":"“In reality” means “in fact; the true situation,” often used to contrast appearance or belief with what is actually true.","zh":"“in reality”意为“实际上/事实上”，常用来对比表象或想法与真实情况。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"used to introduce the true situation, often contrasting with what seems true or what people believe","zh":"实际上；事实上（常用来对比表面情况或人们的想法）"},"examples":[{"en":"It looks complicated, but in reality it’s quite simple.","zh":"它看起来很复杂，但实际上很简单。"},{"en":"He seemed confident; in reality, he was nervous.","zh":"他看起来很自信；事实上他很紧张。"},{"en":"In reality, most changes take time.","zh":"事实上，大多数改变都需要时间。"}]}],"synonyms":["in fact","actually","in actual fact","as a matter of fact"],"phonetic":"/ɪn riˈæləti/","extraExplanation":["“in reality”通常写作两个词：in reality（不是一个词*inreality*）。常见于说明文、新闻和日常对话，用来“纠正误解/揭示真相”。","语气上比“actually”更正式一点；写作中常放在句首并用逗号隔开：In reality, …","相近表达：in fact, in actual fact, as a matter of fact（语气略不同，但都可表示“事实上”）。"]}
{"word":"inregister","summary":{"en":"“In register” means correctly aligned, especially in printing when color layers line up.","zh":"“in register”指“对准/校准到位”，尤指印刷中多色图层“套准”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of parts, marks, or systems) correctly aligned so they match or line up as intended.","zh":"（部件、标记或系统）对准的；校准的；彼此吻合的（按预期排列一致）。"},"examples":[{"en":"Make sure the two images are in register before you print the final version.","zh":"在打印最终版本之前，确保两张图像已经对准（套准）。"},{"en":"The technician adjusted the sensors until they were in register.","zh":"技术员调整传感器，直到它们校准到位。"}]},{"partOfSpeech":"adj.","definition":{"en":"(printing) properly positioned so different color layers line up exactly; correctly “registered.”","zh":"（印刷）套准的；（多色）各色版/图层准确重合的。"},"examples":[{"en":"The cyan and magenta plates are slightly out of register, so the text looks blurry.","zh":"青版和品红版有点没套准，所以文字看起来发虚。"},{"en":"When the colors are in register, the edges look sharp.","zh":"当颜色套准时，边缘看起来会很清晰。"}]}],"synonyms":["aligned","in alignment","registered","in sync","properly lined up"],"phonetic":"/ɪn ˈrɛdʒɪstər/","extraExplanation":["你输入的“inregister”更常见的写法是 **in register**（分开写）或 **in-register**（作形容词时加连字符）。相反的说法是 **out of register**（没对准/没套准），在印刷与设计领域非常常用。"]}
{"word":"inrigged","summary":{"en":"“Inrigged” isn’t standard English; you probably mean “rigged” (fixed/arranged, often unfairly) or “unrigged” (not fitted with gear).","zh":"“inrigged”不是标准英语；你可能想写“rigged”（被操纵/被安排好的，常含不公平）或“unrigged”（未装配/已拆索具）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “rigged” or “unrigged,” depending on context.","zh":"不是标准英语单词。很可能是把“rigged（被操纵的/装配好的）”或“unrigged（未装配的/拆下索具的）”拼错了。"},"examples":[{"en":"I couldn’t find “inrigged” in a dictionary—did you mean “rigged”?","zh":"我在词典里找不到“inrigged”——你是不是想写“rigged”？"},{"en":"If you mean a boat with its equipment removed, the usual word is “unrigged.”","zh":"如果你指把船上的索具设备拆掉，常用词是“unrigged”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rigged) set up or arranged, often in a dishonest way so the result is unfair.","zh":"（rigged）被操纵的；被做过手脚的（常指不公平、作弊式地安排结果）。"},"examples":[{"en":"People accused the game of being rigged.","zh":"人们指责比赛被操纵了。"},{"en":"It felt like a rigged test because some students got the answers early.","zh":"这次考试让人觉得被做了手脚，因为有些学生提前拿到了答案。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rigged) equipped or fitted with the necessary gear (especially of a ship/boat: sails, ropes, etc.).","zh":"（rigged）（尤指船只）装好索具/装备好的；装配好的。"},"examples":[{"en":"The boat was fully rigged and ready to sail.","zh":"这艘船索具都装好了，随时可以起航。"},{"en":"They rigged the lights for the stage show.","zh":"他们为舞台演出把灯光设备装好了。"}]}],"synonyms":["fixed","manipulated","set up","biased","prearranged"],"phonetic":"/rɪɡd/","extraExplanation":["“inrigged”在常见英语语料和主流词典中不作为标准词条出现。最常见情况是把“rigged”误写成“inrigged”。","如果你是在航海/船舶语境里看到的，想表达“拆除索具、未装配”的状态，常用的是“unrigged”。","如果你能提供一句原文（前后各1句）或说明语境（游戏/考试/航海等），我可以帮你准确判断应该用哪个词。"]}
{"word":"inrigger","summary":{"en":"An inrigger is rowing rigging (or a boat) with oarlocks mounted inside the hull, not on external outriggers.","zh":"inrigger 指赛艇的“内支架/内桨架”结构（或使用该结构的船）：桨锁装在船体内部，而非外伸支架上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rowing) A type of boat rigging where the oarlocks (riggers) are attached inside the hull rather than on external arms (outriggers).","zh":"（赛艇）一种“内支架/内桨架”装置：桨架（桨架座/桨锁）安装在船体内部，而不是装在伸出船体外侧的支架（外支架）上。"},"examples":[{"en":"This training shell is an inrigger, so the oarlocks sit closer to the center of the boat.","zh":"这条训练艇是内支架艇，所以桨锁更靠近船的中线。"},{"en":"Some clubs use inriggers for beginners because they can feel more stable in certain conditions.","zh":"有些俱乐部会给初学者用内支架艇，因为在某些条件下会感觉更稳。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Describing a boat or setup that uses inrigger-style rigging.","zh":"（较少见）形容使用内支架式桨架的船或配置。"},"examples":[{"en":"They practiced in an inrigger boat before switching to modern outriggers.","zh":"他们先用内支架艇训练，后来才换成现代外支架艇。"}]}],"synonyms":["inboard rigger","inboard rig","inrigger rigging"],"phonetic":"/ˈɪnˌrɪɡər/","extraExplanation":["“inrigger”主要出现在赛艇/划船语境中，对应“outrigger（外支架）”。现代赛艇更常见的是外支架（桨架伸出船体外），而“inrigger”带有更传统或特定训练器材的意味。","如果你是在非赛艇语境看到 inrigger，很可能是拼写误差（常见词是 outrigger）。"]}
{"word":"inrighted","summary":{"en":"“Inrighted” (rare/archaic) means legally given a right or put into rightful possession; today people usually say “entitled” or “granted the right.”","zh":"“inrighted”（罕见/古语）指“被法律赋予权利”或“被置于合法应得的拥有状态”；现代更常说“entitled / granted the right”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of an archaic verb meaning “to give someone a legal right” or “to put someone in rightful possession.”","zh":"（古语/罕见）动词的过去式/过去分词，意思是“赋予某人合法权利”或“使某人获得其应得的权利/合法所有权”。"},"examples":[{"en":"After the court’s decision, the tenants were inrighted to remain in their homes.","zh":"法院裁决后，租户获得合法权利，可以继续住在原来的房子里。"},{"en":"The treaty inrighted the community to use the river for fishing.","zh":"该条约赋予社区在这条河里捕鱼的权利。"}]}],"synonyms":["entitled","authorized","empowered","granted","vested (with rights)"],"phonetic":"/ɛnˈraɪtɪd/","extraExplanation":["“inrighted”在现代英语里几乎不用，更多见到的拼写是“enrighted”（同义、同样偏古/法律语境）。日常表达通常会用更常见的说法，比如：be entitled to（有权……）、be granted the right to（被授予……的权利）、be restored to one’s rights（恢复权利）。","词根上可以理解为 in-/en-（使……进入某种状态）+ right（权利/正当的），整体就是“使某人获得权利/使其正当化”。"]}
{"word":"inring","summary":{"en":"In-ring means “inside the ring,” especially describing action or performance in boxing or wrestling.","zh":"in-ring 指“在擂台/拳台内（发生）的”，常用于拳击或摔角等场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening inside the ring (the fighting/wrestling area), especially in boxing, wrestling, or other combat sports.","zh":"（尤指拳击、摔角等格斗运动）在擂台/拳台内发生的；擂台上的。"},"examples":[{"en":"Fans remember him for his in-ring skills more than his interviews.","zh":"粉丝记住他的更多是擂台上的实力，而不是他的采访表现。"},{"en":"The coach focused on in-ring strategy for the next match.","zh":"教练把重点放在下一场比赛的擂台战术上。"},{"en":"Her in-ring performance improved a lot this season.","zh":"她这赛季的擂台表现进步很大。"}]}],"synonyms":["ringside (related)","in the ring","inside the ring"],"phonetic":"/ˈɪn ˌrɪŋ/","extraExplanation":["“in-ring”更常见的拼写是带连字符的 in-ring；写成一个词“inring”较少见，多出现在社媒、标题或非正式文本中。","常见搭配：in-ring skills（擂台技术）、in-ring action（擂台对抗/场面）、in-ring performance（擂台表现）。"]}
{"word":"inro","summary":{"en":"An inro is a traditional Japanese small case worn at the waist, often lacquered, used to carry small items like medicine.","zh":"inro（印笼）是日本传统的随身小盒，常为漆器，系在腰间用来装药或其他小物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small Japanese case (often lacquered) worn at the waist to hold small items like medicine seals; traditionally hung from the sash (obi) with a cord and a netsuke toggle.","zh":"（日本传统）印笼：一种小型多层盒（常为漆器），系在和服腰带（obi）上，用来装药、印章等小物；通常用绳子和“根付”（netsuke）固定。"},"examples":[{"en":"The museum displayed an inro decorated with gold lacquer and cranes.","zh":"博物馆展出了一只用金漆装饰、绘有仙鹤的印笼。"},{"en":"In Edo-period Japan, people carried medicine in an inro at their waist.","zh":"在日本江户时期，人们会把药装在印笼里系在腰间。"}]}],"synonyms":["inrō","Japanese lacquer case"],"phonetic":"/ˈɪn.roʊ/","extraExplanation":["“inro”更常见的拼写是带长音符号的 **inrō**（日语：印籠）。英语里常省略长音符号写成 inro。","印笼通常由几层小盒叠在一起，用绳子贯穿；绳子末端常配一个小雕刻物 **netsuke（根付）** 来防止整套物件从腰带上滑落。","在英语语境中，这个词多见于艺术史、博物馆说明、古董收藏等领域。"]}
{"word":"inroad","summary":{"en":"Inroad means a breakthrough or progress into a new area, often used in the phrase “make inroads into.” It can also mean something is gradually consuming time, money, or advantages.","zh":"inroad 指在原本难进入的领域取得突破或进展（常见搭配 make inroads into）；也可指逐渐消耗/侵蚀时间、金钱或优势。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an opportunity to advance or gain influence in a place, group, or activity that was difficult to enter before; a successful beginning of involvement","zh":"（原本难进入的领域或群体中的）突破口；进展；初步的成功进入"},"examples":[{"en":"The new app helped the company make inroads into the Asian market.","zh":"这款新应用帮助公司在亚洲市场打开了局面。"},{"en":"She’s made real inroads in the tech industry through her internship.","zh":"她通过实习在科技行业取得了实质性进展。"}]},{"partOfSpeech":"n.","definition":{"en":"progress that reduces something over time (such as time, money, or an advantage)","zh":"（对时间、金钱、优势等的）消耗；侵蚀；削弱"},"examples":[{"en":"Rising costs are making inroads on our savings.","zh":"不断上涨的成本正在侵蚀我们的存款。"},{"en":"Long meetings can make serious inroads into your afternoon.","zh":"冗长的会议会严重占用你的下午时间。"}]}],"synonyms":["breakthrough","progress","advance","foothold","encroachment"],"phonetic":"/ˈɪnˌroʊd/","extraExplanation":["“inroad”常用复数“inroads”，因为强调“逐步进入/不断取得进展”的过程：make inroads into + 领域/市场/群体（在……中打开局面）。","词源上可理解为“向内走出一条路”：in-（进入）+ road（道路），引申为“打通进入的通道/突破口”。"]}
{"word":"inroader","summary":{"en":"An “inroader” is a (rare) word for an invader/raider, or figuratively, something that encroaches on time, space, or a market.","zh":"“inroader”是个较少见的词，指入侵者/袭击者；也可比喻逐渐侵占时间、空间或市场的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group that makes an inroad; an invader or raider that enters another area to attack, steal, or take control","zh":"进行“侵入/突袭”的人或团体；入侵者、袭击者"},"examples":[{"en":"The village built a watchtower to spot inroaders before they reached the farms.","zh":"村子建了瞭望塔，以便在入侵者到达农田前发现他们。"},{"en":"In the old tale, the inroaders crossed the river at night.","zh":"在那则古老的故事里，袭击者在夜里渡河。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) someone or something that gradually encroaches on a space, activity, or market","zh":"（比喻）逐渐侵占某个空间、活动或市场的人或事物"},"examples":[{"en":"Smartphones can be inroaders into study time if you don’t set limits.","zh":"如果不设限，智能手机可能会侵占你的学习时间。"},{"en":"The new brand became an inroader in the local market within a year.","zh":"这个新品牌在一年内就成了本地市场的“入侵者”。"}]}],"synonyms":["invader","raider","intruder","encroacher"],"phonetic":"/ˈɪnˌroʊdər/","extraExplanation":["“inroader”比较少见，来自名词“inroad”（侵入、突袭；对某事物的侵蚀）。现代英语里更常用的表达是“invader / raider / intruder”（人）或“encroachment”（现象）。在文学或历史叙述中用“inroader”会带有更强的“突袭、掠夺”色彩。"]}
{"word":"inroads","summary":{"en":"Inroads means gradual progress into something—often harmful ‘encroachment,’ or gaining influence/success in a new area (usually in “make inroads into/on”).","zh":"inroads 指逐步“侵害/蚕食”，也可指在新领域“打开局面、取得进展”，常见于 make inroads into/on。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) Harmful or gradual progress into something, especially an unwanted effect on an area, group, or resource.","zh":"（通常用复数）逐步造成的侵害；（对某领域/群体/资源的）蚕食、侵袭（多指不受欢迎的影响）。"},"examples":[{"en":"The disease made serious inroads into the population.","zh":"这种疾病对该地区人口造成了严重侵害。"},{"en":"Urban development is making inroads into farmland.","zh":"城市开发正在蚕食农田。"},{"en":"The company’s costs have made inroads into its profits.","zh":"公司的成本侵蚀了利润。"}]},{"partOfSpeech":"n.","definition":{"en":"Progress or success in gaining influence in a new area or among a new group (often in the phrase “make inroads into/on”).","zh":"（在新领域或新群体中）取得进展、打开局面、逐渐获得影响力（常用于短语“make inroads into/on”）。"},"examples":[{"en":"Streaming services have made inroads into traditional television.","zh":"流媒体服务已经在传统电视领域打开了局面。"},{"en":"The brand is making inroads into the Asian market.","zh":"该品牌正在逐步进入亚洲市场。"}]}],"synonyms":["encroachment","intrusion","advance","progress","headway"],"phonetic":"/ˈɪnˌroʊdz/","extraExplanation":["“inroad”原意与“road（道路）”有关，可理解为“向内开出一条路”，因此既可表示负面的“侵入/侵害”，也可表示中性的“进入并取得进展”。","常见搭配：make inroads into/on sth（对……造成侵蚀；或在……取得进展）。语气取决于语境：对利润/传统/隐私多为负面；对市场/受众多为中性或正面。"]}
{"word":"inrol","summary":{"en":"“Inrol” is not standard; it most likely means “enroll,” meaning to register/join officially.","zh":"“inrol”不是标准拼写；最可能是“enroll”，意思是正式注册/报名/加入。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Nonstandard spelling) likely means “enroll”: to officially join or register for a course, program, or membership.","zh":"（非标准拼写）很可能是“enroll（注册/报名）”：正式加入或登记参加课程、项目或成为会员。"},"examples":[{"en":"I need to enroll in the math class before Friday.","zh":"我需要在周五前报名数学课。"},{"en":"She enrolled at a local university last year.","zh":"她去年入读了一所本地大学。"},{"en":"You can enroll online or in person.","zh":"你可以在线或到现场注册。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put someone on an official list (for example, students, members, voters).","zh":"把某人登记到正式名单上（如学生名单、会员名单、选民名单）。"},"examples":[{"en":"The school enrolled 200 new students this semester.","zh":"这所学校本学期录取/注册了200名新生。"},{"en":"They enrolled volunteers for the event.","zh":"他们为活动登记了志愿者。"}]}],"synonyms":["register","sign up","join","enlist"],"phonetic":"/ɪnˈroʊl/","extraExplanation":["“inrol”不是常见的英语单词拼写，最常见的对应是美式拼写“enroll”（英式拼写常见为“enrol”）。如果你想表达“扮演某个角色/以某种身份”，通常说“in a role”或“in the role of…”。"]}
{"word":"inroll","summary":{"en":"“Inroll” is usually a misspelling of “enroll,” meaning to officially register or sign up.","zh":"“inroll”通常是“enroll”的拼写错误，意思是正式报名或注册。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Common spelling: enroll) To officially sign up or register for a course, program, or service.","zh":"（常见拼写：enroll）报名；注册（课程、项目或服务）。"},"examples":[{"en":"I enrolled in an English class at the community college.","zh":"我在社区学院报名了一门英语课。"},{"en":"You can enroll online or at the front desk.","zh":"你可以在线注册，或在前台办理报名。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put someone into a program or list officially (often used in formal contexts).","zh":"（正式）把某人登记在册；为某人办理入学/注册。"},"examples":[{"en":"The school enrolled 200 new students this year.","zh":"这所学校今年招收并登记了200名新生。"},{"en":"The clinic enrolled patients in a free health program.","zh":"诊所把病人登记参加了一个免费的健康项目。"}]}],"synonyms":["register","sign up","join","enter"],"phonetic":"/ɪnˈroʊl/","extraExplanation":["“inroll”不是标准英语拼写，通常是把“enroll”（美式）或“enrol”（英式）拼错了。","在美国英语中更常见的是“enroll / enrollment”；英式英语常见“enrol / enrolment”。"]}
{"word":"inrolling","summary":{"en":"“Inrolling” is not a common standard word; it usually means “enrolling” (signing up/registering) or, rarely, “rolling inward.”","zh":"“inrolling”不是常见标准词；通常是指“enrolling”（报名/注册）的误拼，或极少情况下指“向内卷/向内折”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Uncommon/likely misspelling) The act of enrolling—officially joining, registering, or signing up for something (like a class, school, or program).","zh":"（不常见/可能是拼写错误）指“enrolling”的动作：正式加入、注册或报名（如课程、学校或项目）。"},"examples":[{"en":"I’m enrolling in an English class next week.","zh":"我下周要报名一个英语课。"},{"en":"Online enrollment opens on Monday, so please enroll early.","zh":"线上注册周一开放，所以请尽早报名。"}]},{"partOfSpeech":"other","definition":{"en":"(Very rare) Bringing something inward by rolling or folding it in; usually written as “in-rolling” or expressed as “rolling in.”","zh":"（非常少见）把某物通过卷起/折叠的方式向内收；通常写作“in-rolling”，或用“roll/rolling in”表达。"},"examples":[{"en":"She rolled in the edges of the dough to seal it.","zh":"她把面团边缘向内卷起，把它封好。"},{"en":"The storm rolled in quickly.","zh":"暴风雨很快逼近（袭来）。"}]}],"synonyms":["enrolling","registering","signing up","joining","rolling in"],"phonetic":"/ɪnˈroʊlɪŋ/","extraExplanation":["“inrolling”不是常见标准拼写。你可能想写的是 **enrolling**（报名/注册），这是学习和学校场景里最常用的。","如果你的意思是“向内卷/向内折”，更自然的写法是 **in-rolling**（较少见，多为技术/描述性用语）或直接用短语 **roll in / roll inward**。","如果你给我一个完整句子（你想表达的上下文），我可以帮你判断到底该用 *enrolling* 还是 *rolling in*，并改成更地道的英文。"]}
{"word":"inrooted","summary":{"en":"“Inrooted” (rare) means deeply rooted or firmly established.","zh":"“inrooted”（少见）表示“根深蒂固的；牢固确立的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Firmly fixed or deeply rooted (in a place, habit, or belief); strongly established.","zh":"（少见）深深扎根的；牢固确立的（在某处、习惯或信念中）。"},"examples":[{"en":"The tradition is inrooted in the town’s history.","zh":"这项传统深深扎根于这座小镇的历史中。"},{"en":"Years of fear left an inrooted mistrust of authority.","zh":"多年的恐惧留下了对权威根深蒂固的不信任。"}]}],"synonyms":["deeply rooted","rooted","ingrained","entrenched","embedded"],"phonetic":"/ɪnˈruːtɪd/","extraExplanation":["“inrooted”不是现代英语中的常用词，更常见的是“rooted / deeply rooted / entrenched / ingrained”。在一些较旧或文学化的写法里，前缀“in-”可表示“使进入/置于……之中”，因此“inrooted”可理解为“被深深扎入（心里或某处）”。写作或考试中建议优先用“deeply rooted / ingrained / entrenched”，更自然、更常见。"]}
{"word":"inrub","summary":{"en":"“In a rub” means being in trouble or in a difficult/awkward situation.","zh":"“in a rub” 指“陷入麻烦或处于困难/尴尬的处境”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"in trouble; in a difficult or awkward situation (often because of a mistake or lack of time/money).","zh":"陷入麻烦；处于困难或尴尬的处境（常因犯错、时间/金钱不够等）。"},"examples":[{"en":"I’m in a rub—I forgot my wallet and the bill is due now.","zh":"我可麻烦了——我忘带钱包了，但账单现在就要付。"},{"en":"She got in a rub when her computer crashed right before the deadline.","zh":"她在截止前电脑崩溃，结果陷入了麻烦。"},{"en":"If you’re ever in a rub, call me and I’ll help.","zh":"如果你什么时候遇到困难，给我打电话，我会帮你。"}]}],"synonyms":["in trouble","in a bind","in a jam","in a pickle"],"phonetic":"/ɪn ə rʌb/","extraExplanation":["你输入的 “inrub” 不是常见的单词，更可能是想写 **in a rub**（口语/非正式表达）。","**rub** 本意是“摩擦”，但在这里引申为“棘手点/难处”（像被卡住、磨得不舒服的感觉），因此 **in a rub** 表示“陷入困境”。","语气偏口语，常用来轻描淡写地说自己遇到小到中等程度的麻烦。更正式可用 **in trouble / in a difficult situation**。"]}
{"word":"inrun","summary":{"en":"Inrun is the ski-jumping approach ramp where an athlete slides down to build speed before takeoff.","zh":"Inrun 指跳台滑雪中运动员起跳前用于加速的助滑道/助滑坡道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ski jumping) the steep ramp or track a jumper slides down to build speed before taking off; the approach run.","zh":"（跳台滑雪）助滑道；运动员起跳前用来加速的下滑坡道/滑道。"},"examples":[{"en":"The jumper crouched low on the inrun to gain speed.","zh":"运动员在助滑道上压低身体以获得更高速度。"},{"en":"A windy inrun can make the takeoff harder to control.","zh":"助滑道上风大时，更难控制起跳。"}]}],"synonyms":["approach run","in-run","in-run ramp"],"phonetic":"/ˈɪnˌrʌn/","extraExplanation":["“inrun”多用于跳台滑雪（ski jumping）领域，指从出发台到起跳台之间那段用于加速的坡道/轨道；与之对应的常见术语还有“takeoff（起跳台）”“landing hill（落地区）”“outrun（冲刺/减速区）”。","词形上由“in + run”构成，但在这个运动语境中是专门名词，不等同于日常说的“run（跑步）”。"]}
{"word":"inrunning","summary":{"en":"“In the running” means still being considered and having a chance to win or be chosen.","zh":"“In the running”表示仍在考虑/竞争中，仍有机会获胜或被选中。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(usually in the phrase “in the running”) still being considered and still having a chance to win, be chosen, or succeed.","zh":"（常用于短语“in the running”）仍在被考虑之中，仍有机会获胜、被选中或成功。"},"examples":[{"en":"She’s still in the running for the scholarship.","zh":"她仍然有机会拿到奖学金。"},{"en":"After the second interview, three candidates were still in the running.","zh":"第二轮面试后，仍有三名候选人在角逐中。"},{"en":"Our team is in the running for first place.","zh":"我们队仍有机会拿第一名。"}]}],"synonyms":["in contention","in the race","still a candidate","still in contention"],"phonetic":"/ɪn ðə ˈrʌnɪŋ/","extraExplanation":["你输入的“inrunning”通常写作 **in the running**（更常见）或 **in-running**（较少见、偏专业）。日常英语里，如果你想表达“仍有机会/仍在竞争”，一般用 **in the running**。","常见搭配：**be in the running for + 名词**（有机会获得……）；反义表达可用 **be out of the running**（无缘、没机会了）。","词源/语感：**running** 在这里不是“跑步”，而更像“赛跑/竞赛”的比喻，用来表示“竞争过程”中的候选者还在“赛道上”。"]}
{"word":"inruption","summary":{"en":"“Inruption” isn’t a standard English word; it’s usually a misspelling of “irruption,” meaning a sudden entering or influx.","zh":"“inruption”不是标准英语词；通常是“irruption”的误拼，表示“突然闯入/突然涌入”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard) “inruption” is usually a misspelling of “irruption” (a sudden entering/invasion) or sometimes confused with “interruption.”","zh":"（非标准用法）“inruption”通常是“irruption”（突然闯入/入侵）的拼写错误，也有人把它和“interruption”（打断）混淆。"},"examples":[{"en":"I couldn’t find “inruption” in most dictionaries; the correct word is usually “irruption.”","zh":"我在大多数词典里找不到“inruption”；正确的词通常是“irruption”。"},{"en":"If you mean someone stopped you while you were speaking, you probably want “interruption.”","zh":"如果你想表达“说话时被打断”，你可能要用“interruption”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Meaning of the likely intended word “irruption”) a sudden, forceful entry into a place; a sudden invasion or influx (often used in formal writing).","zh":"（更可能想写的词“irruption”的意思）突然、强行进入某地；突然的入侵或涌入（常见于较正式的写作）。"},"examples":[{"en":"The city faced an irruption of tourists during the holiday weekend.","zh":"假日期间这座城市迎来游客的突然涌入。"},{"en":"The report warned of an irruption of armed groups across the border.","zh":"报告警告可能出现武装团体越境的突然闯入/入侵。"},{"en":"An irruption of noise from the street broke the quiet mood.","zh":"街上的一阵喧闹突然闯入，打破了安静的氛围。"}]}],"synonyms":["irruption","invasion","incursion","influx","inrush"],"phonetic":"/ɪˈrʌpʃən/","extraExplanation":["“irruption”来自拉丁语词根 rumpere（“打破、冲破”），含有“冲破进入”的感觉，因此常搭配 influx/into/ of 来写得更正式：an irruption of + 人/事物。","常见混淆：\n- interruption：强调“被打断”（会议、谈话、工作）。\n- eruption：强调“喷发/爆发”（火山、疾病、情绪等）。\n- irruption：强调“突然闯入/涌入”（人群、军队、噪音等）。"]}
{"word":"inrush","summary":{"en":"Inrush means a sudden, forceful coming in; in engineering it often refers to inrush current when power is first switched on.","zh":"inrush 指突然、猛烈的涌入；在工程领域常指设备刚通电时出现的浪涌电流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden flowing in, or a rapid arrival of something (often people, water, air, or emotion).","zh":"突然涌入；猛然进入（常指人群、水、空气或情绪等迅速进入）。"},"examples":[{"en":"There was an inrush of customers when the store opened.","zh":"商店一开门，顾客突然涌入。"},{"en":"Cold air came in with an inrush as the window broke.","zh":"窗户破裂时，一股冷空气猛然涌入。"}]},{"partOfSpeech":"n.","definition":{"en":"In electricity, a sudden large amount of current that flows when a device is switched on (often called inrush current).","zh":"（电学）浪涌电流；设备刚接通电源时瞬间出现的大电流（常称 inrush current）。"},"examples":[{"en":"The engineer added a soft-start circuit to reduce inrush.","zh":"工程师加了软启动电路来降低浪涌电流。"},{"en":"High inrush current can trip a breaker even if the motor runs normally afterward.","zh":"即使电机之后运行正常，过大的浪涌电流也可能让断路器跳闸。"}]}],"synonyms":["influx","rush","surge","inflow","onslaught"],"phonetic":"/ˈɪnˌrʌʃ/","extraExplanation":["“inrush”由 in-（向内）+ rush（猛冲、急流）构成，语感上比 “inflow” 更强调“突然、快速、带冲击力”的进入。","在工程语境里更常见的固定搭配是 “inrush current（浪涌电流）”；日常写作中指人群/空气/情绪时也可用，但不如 “rush in / influx” 常见。"]}
{"word":"inrushes","summary":{"en":"Inrushes means sudden rushes inward (plural noun) or “rushes in” (verb).","zh":"inrushes 可指“（多次）向内涌入/冲入”（名词复数），也可作动词表示“（它/他/她）突然涌入”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of inrush) sudden movements or flows that rush inward, often in large amounts (people, air, water, etc.).","zh":"（inrush 的复数）突然向内涌入的动作或流动，常指大量的人群、空气、水等。"},"examples":[{"en":"With the doors open, cold inrushes of air filled the hallway.","zh":"门一打开，寒冷的空气一阵阵涌入走廊。"},{"en":"The announcer paused as loud inrushes of applause drowned out her voice.","zh":"主持人停顿了一下，因为一阵阵热烈的掌声盖过了她的声音。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of inrush) to rush in suddenly and forcefully.","zh":"（inrush 的第三人称单数）突然且猛烈地涌入、冲入。"},"examples":[{"en":"After the storm breaks, water inrushes through the damaged window.","zh":"暴风雨一停，水就从破损的窗户猛地涌入。"},{"en":"When the gate opens, the crowd inrushes onto the field.","zh":"大门一开，人群就冲进了场地。"}]}],"synonyms":["inflows","surges","rushes","floods","streams in","pours in"],"phonetic":"/ˈɪnˌrʌʃɪz/","extraExplanation":["在工程/电工语境里，inrush 常见于 inrush current（“浪涌电流/启动冲击电流”），指设备刚启动或通电瞬间出现的短时间大电流；inrushes 可以指这种现象发生的多次“浪涌”。"]}
{"word":"inrushing","summary":{"en":"“Inrushing” means something that rushes inward suddenly, or the sudden act of rushing in.","zh":"“inrushing”表示突然快速向内涌入的，或“涌入/冲入”这一突发过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"moving in suddenly and quickly; rushing inward","zh":"突然快速地涌入的；冲进来的"},"examples":[{"en":"An inrushing crowd filled the station within minutes.","zh":"一群突然涌入的人群在几分钟内挤满了车站。"},{"en":"She felt an inrushing wave of relief when she heard the news.","zh":"听到这个消息时，她感到一阵如潮水般涌来的宽慰。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of rushing in; a sudden inflow","zh":"涌入；冲入；突然的流入"},"examples":[{"en":"There was an inrushing of cold air when the door opened.","zh":"门一开，一股冷空气猛地灌了进来。"},{"en":"The town prepared for the inrushing of visitors during the festival.","zh":"小镇为节日期间游客的涌入做了准备。"}]}],"synonyms":["influx","rush","surge","inflow","pouring in"],"phonetic":"/ˈɪnˌrʌʃɪŋ/","extraExplanation":["“inrushing”由 in-（向内）+ rushing（冲、奔）组成。它既可写作形容词修饰名词（an inrushing crowd），也可作名词表示“涌入/冲入”这一事件（an inrushing of air）。","在文学或较正式的描写中常用来渲染“突然、不可阻挡”的感觉，也可用于抽象事物（情绪、记忆、声音）的“涌来”。"]}

