{"word":"inta","summary":{"en":"“inta” is a dialectal, informal form of “into.”","zh":"“inta”是方言/非正式的“into”写法或读法。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(dialect, informal) A spoken or written contraction of “into,” common in Scots and some Northern English varieties.","zh":"（方言/非正式）“into”的缩写形式，常见于苏格兰英语（Scots）及部分英格兰北部口语/书写中。"},"examples":[{"en":"Come inta the kitchen and warm up.","zh":"到厨房里来暖和一下。"},{"en":"He slipped inta the crowd and disappeared.","zh":"他溜进人群里就不见了。"}]}],"synonyms":["into"],"phonetic":"/ˈɪn.tə/","extraExplanation":["“inta”多用于表现口语音变或地方口音（尤其是苏格兰语境），在正式写作中通常应写作“into”。","在文学或对白里看到“inta”，往往是作者用来营造地域感、人物身份或口语真实感。"]}
{"word":"intablature","summary":{"en":"A rare term meaning a transcription written in tablature, especially for fretted string instruments.","zh":"较少见的词，指把作品改写成指法谱（如吉他、鲁特琴等）的谱子或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or result of writing music in tablature (a notation system that shows finger positions on an instrument such as lute or guitar).","zh":"把音乐写成“指法谱/六线谱（tablature）”的行为，或写成这种谱子的结果（常用于鲁特琴、吉他等显示按弦位置的记谱法）。"},"examples":[{"en":"The performer prepared an intablature of the vocal piece for solo lute.","zh":"演奏者把那首声乐作品改写成适合独奏鲁特琴的指法谱。"},{"en":"This edition includes an intablature alongside the standard staff notation.","zh":"这个版本除了五线谱外，还附有一份指法谱改写。"}]}],"synonyms":["tablature transcription","intabulation","tab"],"phonetic":"/ɪnˈtæbləˌtʃʊr/","extraExplanation":["“Intablature”较少见，更多时候你会看到动词“intabulate（把……写成指法谱）”、名词“intabulation（改写成指法谱）”，或直接说“tablature transcription / tab”。","在文艺复兴与巴洛克早期的器乐传统中，常把歌曲或复调作品改写为鲁特琴、维奥尔琴等可弹奏的指法谱；这种改写不仅是抄写，也可能包含装饰音与和声的再处理。"]}
{"word":"intabulate","summary":{"en":"“Intabulate” means to organize information into a table (a formal synonym of “tabulate”).","zh":"“intabulate”指把信息整理成表格（较正式，近义于“tabulate”）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put information into a table; to arrange or record data in rows and columns (same idea as “tabulate”)","zh":"把信息列成表格；把数据按行列整理/记录（含义接近 tabulate）"},"examples":[{"en":"The researchers intabulated the survey results by age group.","zh":"研究人员按年龄组把调查结果整理成表格。"},{"en":"Please intabulate these monthly expenses so we can compare categories.","zh":"请把这些每月支出列成表格，这样我们就能比较各类别。"}]}],"synonyms":["tabulate","put into a table","table","arrange systematically","chart"],"phonetic":"/ɪnˈtæbjəˌleɪt/","extraExplanation":["“intabulate”是较少见、偏正式的用词，在现代英语中更常用“tabulate”或“put into a table”。写作或报告中如果用“intabulate”，语气会显得更学术/古典一些。","构词上：in-（使进入/置入）+ tabulate（列表/制表）。","常见搭配：intabulate data/results/figures；也可用被动：The data were intabulated (into a table)."]}
{"word":"intabulation","summary":{"en":"the act of putting information into a table; also a music-arranging term for tablature","zh":"把信息整理成表格；亦指音乐上改编为指法谱/器乐可演奏版本"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of recording or arranging information in a table (tabular form); tabulation","zh":"把信息记录/整理成表格的行为；制表"},"examples":[{"en":"The researcher began the intabulation of survey results to spot patterns.","zh":"研究人员开始把问卷结果制成表格，以便发现规律。"},{"en":"Errors during intabulation can change the final totals.","zh":"制表过程中的错误会影响最终合计。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) the arrangement of a piece—especially vocal music—into tablature or a form playable on an instrument such as lute or keyboard","zh":"（音乐）把乐曲（常见为声乐作品）改编成谱表/指法谱（tabulature），使之适合鲁特琴或键盘等器乐演奏"},"examples":[{"en":"Renaissance musicians were known for the intabulation of popular chansons for lute.","zh":"文艺复兴时期的音乐家以把流行香颂改编成鲁特琴指法谱而闻名。"},{"en":"The intabulation preserves the melody but adds idiomatic instrumental patterns.","zh":"这种改编保留了旋律，同时加入更符合器乐演奏习惯的织体与型态。"}]},{"partOfSpeech":"n.","definition":{"en":"(formal) the act of entering something into an official record or register","zh":"（正式）把内容登记到正式记录/名册中的行为"},"examples":[{"en":"The clerk completed the intabulation of the agreement in the registry.","zh":"书记员完成了将协议登记入册的工作。"}]}],"synonyms":["tabulation","table-making","data tabulation","data entry","registration","recording","transcription","arrangement"],"phonetic":"/ɪnˌtæbjəˈleɪʃən/","extraExplanation":["这个词在日常英语中比较少见：在一般学术或办公语境里，更常用 tabulation（制表）或 data entry（数据录入）。","在音乐史写作中，intabulation 是一个常见术语，尤其用于文艺复兴与巴洛克早期的“把声乐作品改编成鲁特琴/键盘可演奏版本”的传统。"],"etymology":"来自拉丁语词根 tabula（“木板、表格”），经由中世纪/近代拉丁语构词 in-（“使进入/置入”）+ tabula + -tion（名词后缀），字面可理解为“放入表格/登记入表”。","mnemonic":["把它拆开记：in + tab + ulation ≈ “放进表（tab）里” → “制表/登记”。","tab 让人想到“标签页/表格”，intabulation 就是“把东西整理进表格里”。"]}
{"word":"intact","summary":{"en":"Intact means “whole and undamaged,” or “unchanged in its essential form.”","zh":"intact 表示“完好无损的、完整的”，也可指“本质上未受损、未改变的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Whole and not damaged or broken; complete.","zh":"完好无损的；完整的。"},"examples":[{"en":"The package arrived intact, with nothing missing.","zh":"包裹完好无损地送达，没有丢任何东西。"},{"en":"After the accident, the phone screen was still intact.","zh":"事故之后，手机屏幕仍然完好。"},{"en":"The museum kept the ancient vase intact for hundreds of years.","zh":"博物馆让这只古老的花瓶数百年都保存完好。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not harmed or changed in an important way; still the same in essence (often about ideas, traditions, or relationships).","zh":"（本质上）未受损、未改变的；依然如故的（常指观念、传统、关系等）。"},"examples":[{"en":"Even after the move, their friendship remained intact.","zh":"即使搬家后，他们的友谊依然如故。"},{"en":"The author tried to keep the original meaning intact in the translation.","zh":"译者努力在翻译中保留原意不变。"}]}],"synonyms":["undamaged","whole","complete","unbroken","unchanged"],"phonetic":"/ɪnˈtækt/","extraExplanation":["词源提示：intact 来自拉丁语 in-（不）+ tactus（触碰、接触），原意接近“未被触碰过的”，引申为“未被破坏、保持原状”。","常见搭配：remain/stay intact（保持完好/保持不变）；keep something intact（使某物保持完整）；largely intact（大体完好）。","用法提醒：intact 通常不说 *very intact*（不太自然）；更常用 completely/fully/largely intact（完全/充分/大体完好）。"]}
{"word":"intactible","summary":{"en":"“Intactible” is not standard English; you probably mean “intact,” meaning complete and not damaged.","zh":"“intactible”不是规范英语；你大概率想说“intact”，意思是“完整的、未受损的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard) “intactible” is not a commonly accepted English word. Most often, people mean “intact” (not broken or damaged; complete).","zh":"（非标准用法）“intactible”不是常见或规范的英语单词。人们通常想表达的是“intact”（完好无损的；完整的）。"},"examples":[{"en":"After the move, the mirror was still intact.","zh":"搬家之后，那面镜子仍然完好无损。"},{"en":"Keep the seal intact until you’re ready to use the product.","zh":"在你准备使用产品之前，请保持封条完好。"}]}],"synonyms":["undamaged","whole","complete","unbroken"],"phonetic":"/ɪnˈtækt/","extraExplanation":["“intactible”多半是把“intact（完整的/未受损的）”拼错了。标准拼写是 intact（美式音标 /ɪnˈtækt/）。","如果你想表达“难以处理/棘手的”，更可能是 intractable；如果想表达“无形的/难以触摸到的”，更可能是 intangible。你可以告诉我你想表达的中文意思，我可以帮你选最合适的词。"]}
{"word":"intactile","summary":{"en":"“Intactile” is not a standard English word; it’s usually a mistaken or invented form, often confused with “intact” or “tactile.”","zh":"“intactile”不是标准英语单词；多为误写或自造词，常与“intact（完好无损）”或“tactile（触觉的）”混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare / nonstandard) Not commonly recognized in standard English; sometimes used as a blend or mistaken form related to “intact” or “tactile.”","zh":"（罕见/非标准）在标准英语中不常见；有时被当作混合词或误写，与“intact（完好无损）”或“tactile（触觉的）”相关。"},"examples":[{"en":"I couldn’t find “intactile” in a standard dictionary—did you mean “intact” or “tactile”?","zh":"我在标准词典里找不到“intactile”——你是想说“intact（完好无损）”还是“tactile（触觉的）”？"},{"en":"The museum has tactile displays for visitors who learn through touch.","zh":"博物馆有触觉展品，方便通过触摸来学习的访客。"}]}],"synonyms":["intact","tactile"],"phonetic":"/ɪnˈtæk.taɪl/","extraExplanation":["“intactile”更像是拼写错误或自造词：\n- 你如果想表达“完好无损、未受损坏”，通常用 **intact**。\n- 你如果想表达“与触觉/触摸有关”，通常用 **tactile**。\n\n如果你能告诉我它出现的句子或上下文（例如论文、产品说明、艺术评论等），我也可以帮你判断作者想表达的确切意思。"]}
{"word":"intactly","summary":{"en":"“Intactly” means “in an intact (undamaged, unchanged) condition,” but it’s uncommon; most speakers use “intact” instead.","zh":"“intactly”表示“完整无损地/未被改变地”，但不常用；更常见的是直接用“intact”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an intact state; without being damaged, broken, or changed.","zh":"完整无损地；原封不动地。"},"examples":[{"en":"The package arrived intactly, with no tears or dents.","zh":"包裹完整无损地送达了，没有撕裂或凹痕。"},{"en":"After the storm, the old photo album was found intactly preserved in a dry box.","zh":"暴风雨过后，那本旧相册在干燥盒里被发现保存完好。"}]}],"synonyms":["undamaged","unharmed","whole","completely","entirely"],"phonetic":"/ɪnˈtæktli/","extraExplanation":["“intactly”在现代英语中比较少见；更常用、更自然的表达是用形容词“intact”作补语：The package arrived intact. / Everything remained intact.","在学术或较正式的写作里，也可能看到“remain intact”或“be left intact”等搭配；用“intactly”会显得偏书面或不常用。"]}
{"word":"intactness","summary":{"en":"Intactness means the state of being whole and undamaged.","zh":"Intactness 指“完整无损、保持原状”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being intact—whole, complete, and not damaged or changed.","zh":"完整无损的状态；保持原状、未被破坏或未被改变的性质。"},"examples":[{"en":"Engineers checked the bridge’s intactness after the earthquake.","zh":"工程师在地震后检查了桥梁是否完好无损。"},{"en":"The museum monitors the intactness of ancient paintings by controlling light and humidity.","zh":"博物馆通过控制光线和湿度来监测古画的完好程度。"}]}],"synonyms":["integrity","soundness","wholeness","completeness"],"phonetic":"/ɪnˈtæk(t)nəs/","extraExplanation":["“intactness”来自形容词“intact”（完整的、未受损的）+ 名词后缀“-ness”（表示“性质/状态”）。在学术或正式语境（工程、医学、文物保护、数据安全等）中更常见；日常口语里更常用“condition”“integrity”或直接说“it’s intact”。","相关词区别：\n- intactness：强调“是否完整无损”的状态（偏客观检查）。\n- integrity：既可指物体结构完整性，也常指“正直/诚信”（含价值判断）。\n- wholeness：更偏“整体性/完整感”，有时带抽象含义。"]}
{"word":"intactus","summary":{"en":"“Intactus” is a Latin form meaning “untouched; uninjured.” In modern English, use “intact.”","zh":"“Intactus”是拉丁语形式，意为“未被触碰的；未受损的”。现代英语通常用“intact”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard modern English) A Latin form meaning “untouched; uninjured.” In English writing, it may appear in academic or historical contexts, but the normal English word is “intact.”","zh":"（非现代标准英语）拉丁语形式，意思是“未被触碰的；未受损的”。在英语中多见于学术或历史语境；日常英语通常用“intact”。"},"examples":[{"en":"The manuscript is described in Latin as intactus, meaning it remained untouched.","zh":"这份手稿在拉丁文中被描述为 intactus，意思是它一直未被触动。"},{"en":"Most readers will understand “intact” more easily than intactus.","zh":"大多数读者会更容易理解“intact”，而不是 intactus。"}]}],"synonyms":["intact","untouched","unspoiled","unharmed"],"phonetic":"/ɪnˈtækt/","extraExplanation":["“Intactus”来自拉丁语前缀 in-（不）+ tactus（触碰、接触；源自 tangere“触摸”）。英语里的“intact”就是从这个拉丁词形发展而来，含义更口语、更常用。","写作建议：除非你在引用拉丁原文、讨论古典文献或做词源学说明，否则用“intact”更自然。"]}
{"word":"intagli","summary":{"en":"Intaglio means a recessed engraving/design, especially the printmaking method where ink sits in cut-in lines on a plate.","zh":"intaglio 指“凹刻/凹版”：尤其是指墨在凹下线条中、通过压印转到纸上的凹版印刷工艺，也可指凹刻图案本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A printmaking process where the image is cut or etched into a metal plate, and ink is held in the recessed (cut-in) lines; paper is pressed into the grooves to pick up the ink.","zh":"（版画）凹版印刷法：把图像刻蚀在金属版上，墨水留在凹下去的线条里，再用压力把纸压入沟槽取墨成像。"},"examples":[{"en":"Many classic art prints were made using intaglio techniques like etching and engraving.","zh":"许多经典艺术版画是用凹版技术（如蚀刻、雕刻）制作的。"},{"en":"The museum displayed an intaglio print with extremely fine lines.","zh":"博物馆展出了一张线条极其精细的凹版版画。"}]},{"partOfSpeech":"n.","definition":{"en":"A design or pattern that is carved or engraved into a surface (the opposite of a raised relief).","zh":"凹刻的图案；刻入表面的纹样（与浮雕相对）。"},"examples":[{"en":"The ring had an intaglio of a bird cut into the stone.","zh":"这枚戒指的宝石上凹刻着一只鸟的图案。"},{"en":"You can feel the intaglio with your fingertip because it is cut below the surface.","zh":"你用指尖能摸到这个凹刻，因为它是在表面之下刻出来的。"}]}],"synonyms":["engraving","etching","intaglio printing","incised design"],"phonetic":"/ɪnˈtæl.i.oʊ/","extraExplanation":["你输入的“intagli”常见于“intaglio”的复数形式（intaglios），或是把 intaglio 拼错/截断了。标准单数是 intaglio。","词源来自意大利语 intaglio（意为“雕刻”）。在艺术史里常与 etching（蚀刻）、engraving（雕刻）、drypoint（干刻）等凹版工艺一起出现。"]}
{"word":"intagliated","summary":{"en":"Intagliated means “engraved/cut into a surface,” especially in the intaglio style used in printmaking or gem carving.","zh":"intagliated 指“以阴刻（凹刻）方式刻入表面”的，常用于版画或宝石雕刻语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(art) Engraved or carved into a surface (incised), especially in the intaglio style used in printmaking and gem carving.","zh":"（艺术）以“凹刻/阴刻”方式刻入表面（刻下去）的；尤指版画或宝石雕刻中的凹版/阴刻工艺。"},"examples":[{"en":"The ring had an intagliated seal carved into the stone.","zh":"这枚戒指的宝石上刻有一个阴刻（凹刻）的印章图案。"},{"en":"Intagliated lines can hold ink and print darker on paper.","zh":"阴刻的线条能蓄墨，因此在纸上印出来会更深。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of intagliate: to engrave or carve into a material in an intaglio (incised) manner.","zh":"intagliate 的过去式/过去分词：以阴刻（凹刻）的方式在材料上雕刻/刻蚀。"},"examples":[{"en":"The artist intagliated the copper plate before printing.","zh":"艺术家先在铜版上做阴刻处理，然后再进行印刷。"}]}],"synonyms":["engraved","incised","carved","etched"],"phonetic":"/ɪnˈtæliˌeɪtɪd/","extraExplanation":["“intaglio”常见于版画术语：线条或图案是刻进金属（如铜版）或其他材料的凹槽里，上墨后再擦去表面墨迹，纸在压力下把凹槽里的墨吸出来，因此凹刻部分通常更黑、更清晰。","词源上与意大利语 intagliare（“雕刻/切刻”）有关；在现代英语里更常见的是 intaglio（名词/形容词用法）或 engraved/incised（更通用的表达），“intagliated”相对较少见，偏艺术史/工艺语境。"]}
{"word":"intagliation","summary":{"en":"Intagliation means the process of carving/engraving a recessed design into a surface, especially for intaglio printmaking.","zh":"Intagliation 指把图案刻入材料表面之下（凹刻）的工艺过程，常用于凹版制版与印刷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or art of making an image by cutting, carving, or engraving lines into a surface (especially metal) so the design is recessed (below the surface), as used in intaglio printmaking","zh":"（尤指在金属上）用刻、雕、蚀刻等方式把线条刻进材料表面之下（凹下去）的制版/雕刻工艺；常用于凹版（intaglio）印刷"},"examples":[{"en":"The artist demonstrated intagliation on a copper plate before making the print.","zh":"艺术家在制作版画前，先在铜版上示范了凹刻制版（intagliation）。"},{"en":"Fine banknotes often rely on intagliation to create sharp lines and a raised ink texture.","zh":"精细的纸币常用凹版工艺来形成清晰线条和可触摸的油墨质感。"}]}],"synonyms":["intaglio","engraving","etching","intaglio printing"],"phonetic":"/ɪnˌtæl.iˈeɪ.ʃən/","extraExplanation":["“intagliation”在现代英语中相对少见；更常见的相关词是“intaglio”（凹版/凹刻法）以及“engraving/etching”（雕刻/蚀刻）。在艺术史或印刷语境里，intagliation可理解为“采用凹版方式进行刻制/制版的过程”。","词源关联意大利语“intaglio”（意为“切入、刻入”）。学习时可以把它和“relief printing（凸版印刷）”对比：凹版是线条刻在凹处，凸版是图文凸起在表面。"]}
{"word":"intaglio","summary":{"en":"Intaglio means an engraved (cut-in) design, or the printmaking method that uses engraved lines to hold ink.","zh":"intaglio 指“凹雕/阴刻的图案”，也指“凹版印刷”这种用刻线盛墨来印刷的方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A design that is cut or engraved into a surface (often used in jewelry, metalwork, or printing).","zh":"（图案）凹雕/阴刻：把图案刻进材料表面内部（常见于珠宝、金属工艺或印刷）。"},"examples":[{"en":"The ring has an intaglio of a lion carved into the stone.","zh":"这枚戒指的宝石上阴刻着一只狮子。"},{"en":"Museum visitors admired the ancient intaglio on a Roman gem.","zh":"博物馆的游客欣赏一枚罗马宝石上的古代凹雕图案。"}]},{"partOfSpeech":"n.","definition":{"en":"A printing method where ink sits in engraved lines; the paper is pressed into the cuts to pick up the ink (e.g., etching, engraving).","zh":"凹版印刷：油墨停留在刻出的凹槽里，纸张受压进入凹槽把油墨带出（如蚀刻、雕刻）。"},"examples":[{"en":"Etching is an intaglio process used for fine art prints.","zh":"蚀刻是一种用于艺术版画的凹版工艺。"},{"en":"Intaglio printing is known for crisp lines and rich texture.","zh":"凹版印刷以线条清晰、质感厚实而著称。"}]}],"synonyms":["engraving","etching","incised design","intaglio printing"],"phonetic":"/ɪnˈtælioʊ/","extraExplanation":["“intaglio”来自意大利语 intagliare（“刻、雕”），核心概念是“往里刻”（与浮雕 cameo/relief 的“凸起”相对）。","在艺术史语境里，intaglio 常用于指古代宝石雕刻（如印章戒指上的阴刻图案），也用于讨论版画技法（蚀刻、铜版雕刻等）。"]}
{"word":"intaglioed","summary":{"en":"“Intaglioed” means engraved into a surface (cut below it), or the past form of “intaglio,” especially in printmaking.","zh":"“intaglioed”指用凹刻法把图案刻入表面（线条在表面之下）；也可作 intaglio 的过去式/过去分词，尤用于凹版印刷。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a design or surface) engraved or carved into a material so the lines are cut below the surface (an “incised” look).","zh":"（指图案或表面）以凹刻方式雕刻的；线条被刻入材料表面之下的（呈“凹陷/内雕”效果）。"},"examples":[{"en":"The ring had an intaglioed seal with a lion design.","zh":"那枚戒指上有一个凹刻的印章，图案是一只狮子。"},{"en":"She wore a necklace with an intaglioed gemstone cameo.","zh":"她戴着一条项链，吊坠是一颗带凹刻图案的宝石。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “intaglio” (to engrave a design into a surface, especially for printmaking).","zh":"“intaglio”的过去式/过去分词：以凹刻法把图案刻入表面（尤指用于凹版印刷）。"},"examples":[{"en":"The artist intaglioed the plate before inking it for printing.","zh":"艺术家先在版上凹刻图案，再上墨进行印刷。"}]}],"synonyms":["engraved","incised","carved","etched"],"phonetic":"/ɪnˈtælioʊd/","extraExplanation":["“Intaglio”源自意大利语，字面有“刻进去”的意思。在版画里，凹版（intaglio printing）常见工艺包括铜版雕刻（engraving）、蚀刻（etching）等：墨会停留在凹下去的刻痕里，压印到纸上。与之相对的是凸版（relief printing），墨在凸起的部分。","在首饰与雕刻艺术中，intaglioed 常用来形容宝石或印章石上的“阴刻/内雕”图案（图像凹进去），与“cameo”（浮雕、图像凸出来）常被对比提及。"]}
{"word":"intaglioing","summary":{"en":"“Intaglioing” means making an intaglio engraving—cutting a design into a surface, often for printmaking.","zh":"「intaglioing」指進行凹版雕刻／凹版製作：把圖案刻入表面，常用於版畫印刷。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of creating an intaglio image (a design cut or engraved into a surface), especially for printmaking","zh":"凹版製作／凹版雕刻：把圖案刻入材料表面（形成凹陷線條或凹槽）的過程，常用於版畫印刷"},"examples":[{"en":"She spent the afternoon intaglioing a copper plate for a small edition of prints.","zh":"她花了一個下午在銅版上做凹版雕刻，準備印一小批版畫。"},{"en":"Intaglioing requires steady hands because every cut will appear in the final print.","zh":"凹版製作需要手很穩，因為每一道刻痕都會出現在最後的印刷成品上。"}]}],"synonyms":["engraving","etching","incising","carving"],"phonetic":"/ɪnˈtælioʊɪŋ/","extraExplanation":["「intaglioing」在實際英文中不算常見，更常見的說法是用動詞「engraving / etching」來描述；或用名詞說「doing intaglio (printmaking)」。","Intaglio（凹版）是一種版畫技法：把線條刻進金屬（如銅板、鋅板），上墨後擦去表面油墨，讓凹槽裡的墨在加壓下轉印到紙上，因此常能呈現細緻線條與深淺層次。","字源來自義大利語 intaglio，與「tagliare（切、割）」相關，核心概念就是「刻進去／切進去」。"]}
{"word":"intaglios","summary":{"en":"“Intaglios” are engraved designs cut into a surface (sunken carving), often on gemstones or used for seals; it’s the plural of “intaglio.”","zh":"“Intaglios” 指凹刻在材料表面之内的雕刻图案（凹雕），常见于宝石雕刻与印章；为 “intaglio” 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Engraved designs or pictures cut into the surface of a hard material (like stone, glass, or metal), often used in jewelry, seals, or printing; plural of “intaglio.”","zh":"（雕刻）凹刻图案或图像：把图案刻进坚硬材料（如宝石、玻璃、金属）表面之内，常用于珠宝、印章或版画；为 intaglio 的复数。"},"examples":[{"en":"The museum displayed Roman intaglios carved into gemstones.","zh":"博物馆展出了刻在宝石上的罗马凹刻印章（intaglios）。"},{"en":"She collected antique rings with intaglios used as personal seals.","zh":"她收藏带有凹刻印章图案的古董戒指，用来作为个人印记。"},{"en":"Under the light, the intaglios revealed fine lines and tiny details.","zh":"在灯光下，这些凹刻作品显现出细密的线条和微小的细节。"}]}],"synonyms":["engraved gems","seal engravings","intaglio carvings"],"phonetic":"/ɪnˈtæljoʊz/","extraExplanation":["“intaglio”与“cameo（浮雕）”常被一起提到：intaglio 是“凹进去”的雕刻（刻入材质内），而 cameo 是“凸出来”的雕刻（浮在表面）。","在古罗马与文艺复兴时期，宝石凹刻常用于“印章戒指”：把凹刻图案压在蜡或软材上，会留下凸起的印记，便于签署或封缄文件。","在版画领域里，intaglio 也可指“凹版印刷”工艺（如铜版蚀刻/雕刻）：墨留在刻痕里，再转印到纸上。"]}
{"word":"intagliotype","summary":{"en":"Intagliotype refers to a (rare) intaglio-based printing method that prints from recessed lines on a plate.","zh":"Intagliotype 指一种较少见的凹版印刷方法，从版上的凹陷线条处印出图像。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of intaglio printing process (a method that prints from recessed lines cut or etched into a metal plate), sometimes used for reproducing images.","zh":"一种凹版印刷工艺（把线条刻蚀在金属版的凹陷处，再从凹陷处上墨印刷），有时用于复制图像。"},"examples":[{"en":"The museum label noted that the illustration was made using an intagliotype process.","zh":"博物馆的说明牌写道，这幅插图使用了 intagliotype（凹版印刷）工艺制作。"},{"en":"Early publishers experimented with intagliotype to reproduce detailed pictures for books.","zh":"早期出版商曾尝试用 intagliotype 来为书籍复制细节丰富的图像。"}]}],"synonyms":["intaglio (printing)","intaglio print","engraving","etching","photogravure"],"phonetic":"/ɪnˈtæl.i.oʊ.taɪp/","extraExplanation":["这是一个相对少见的术语，常见于较老的印刷/版画资料中，可理解为“某种凹版（intaglio）制版与印刷法”。实际阅读时，如果你看到它出现在艺术史或印刷史语境里，通常与金属凹版、蚀刻、照相制版等概念相关。","词形上由 intaglio（意大利语来源，意为“刻入/凹刻”）+ type（方式/印刷版式）构成。由于用法不如 etching（蚀刻）、engraving（雕刻）、photogravure（珂罗版/照相凹版）常见，很多现代资料会用更通用的说法来替代。"]}
{"word":"intail","summary":{"en":"Entail means “to involve or require something as a necessary part or result.”","zh":"Entail 表示“必然包含或需要某事；使某结果不可避免”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to involve (something) as a necessary part or result; to require","zh":"必然包含；需要；使成为必然结果"},"examples":[{"en":"This job entails working on weekends sometimes.","zh":"这份工作有时需要周末上班。"},{"en":"A small mistake can entail serious consequences.","zh":"一个小错误可能会带来严重后果。"},{"en":"Buying a house entails a lot of paperwork.","zh":"买房必然伴随大量文件手续。"}]},{"partOfSpeech":"vt.","definition":{"en":"(formal) to cause something to happen as a direct result","zh":"（正式）导致；引起（作为直接结果）"},"examples":[{"en":"The policy change entailed higher costs for students.","zh":"这项政策变化导致学生的成本更高。"},{"en":"Delays may entail extra fees.","zh":"延误可能会导致额外费用。"}]}],"synonyms":["involve","require","necessitate","result in","lead to"],"phonetic":"/ɛnˈteɪl/","extraExplanation":["你输入的“intail”通常是拼写错误，正确拼写多为 **entail**。","词感提示：**entail** 常用于较正式的书面语，搭配很固定：**entail + 名词/动名词**（entail costs / entail doing something）。","易混词：**detail**（细节）拼写相近但意思不同；**entitle**（使有权利）也别混淆。"]}
{"word":"intake","summary":{"en":"Intake most commonly means the amount you take in (food/drink/air), and it can also mean an entry opening or a group of people admitted at one time.","zh":"Intake 最常指“摄入量/吸入量”，也可指“入口（如进气口）”，或指“某一批次的招收/录取人数”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the amount of something (especially food, drink, or air) that is taken into the body or a machine/process","zh":"摄入量；吸入量（尤指食物、饮料、空气，或机器/流程中进入的量）"},"examples":[{"en":"Try to reduce your daily sugar intake.","zh":"尽量减少你每天的糖分摄入量。"},{"en":"The doctor asked about his fluid intake.","zh":"医生询问了他的液体摄入量。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of taking something in; receiving","zh":"吸收/摄取的行为或过程；接收"},"examples":[{"en":"Adequate intake of protein is important for growth.","zh":"充足的蛋白质摄入对生长很重要。"},{"en":"The intake of new information can be overwhelming at first.","zh":"一开始接收新信息可能会让人不知所措。"}]},{"partOfSpeech":"n.","definition":{"en":"a place or opening where something enters (such as an air intake on an engine)","zh":"入口；进气口（如发动机的进气口）"},"examples":[{"en":"Make sure the air intake isn’t blocked.","zh":"确保进气口没有被堵住。"}]},{"partOfSpeech":"n.","definition":{"en":"the number of people accepted into an organization at one time (such as a university intake)","zh":"（某一时期的）招收人数；录取批次（如大学某届新生）"},"examples":[{"en":"This year’s intake is larger than last year’s.","zh":"今年的招收人数比去年多。"},{"en":"The program has two intakes a year: spring and fall.","zh":"这个项目一年有两次招生：春季和秋季。"}]}],"synonyms":["consumption","ingestion","uptake","inlet","admission"],"phonetic":"/ˈɪnˌteɪk/","extraExplanation":["词源上，intake 来自 “take in（吸入/摄入/接收）”，因此既可指“量”（sugar intake），也可指“入口”（air intake），还常用于教育/机构语境表示“某一批次的录取/招收”（the fall intake）。","常见搭配：daily intake（每日摄入量）、calorie intake（热量摄入）、intake form/interview（入学/入职登记表或面谈，偏机构流程用法）。"]}
{"word":"intaker","summary":{"en":"An intaker is someone (or something) that takes something in, or a staff member who handles intake/admissions information.","zh":"intaker 指“吸入/摄入者（或装置）”，也可指负责接待登记、收集入院/入所信息的工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that takes something in (such as air, food, information, or materials)","zh":"吸入者；摄入者；（泛指）把某物吸入/纳入的人或事物"},"examples":[{"en":"A snorkel is an intaker of air while your face is in the water.","zh":"当你的脸在水里时，呼吸管就是一个吸入空气的装置。"},{"en":"As a heavy caffeine intaker, he should cut down on coffee.","zh":"作为一个咖啡因摄入量很大的人，他应该减少咖啡的摄入。"}]},{"partOfSpeech":"n.","definition":{"en":"a person responsible for receiving new clients, patients, or students and collecting their basic information (common in healthcare or social services)","zh":"（医疗/社工等）接待登记人员；入院/入学/入所信息采集人员"},"examples":[{"en":"The intaker asked for her ID and insurance information.","zh":"接待登记人员询问了她的身份证和保险信息。"},{"en":"Please speak with the intaker before you meet the counselor.","zh":"在见咨询师之前，请先和接待登记人员沟通。"}]}],"synonyms":["consumer","receiver","admissions staff","intake coordinator","intake specialist"],"phonetic":"/ˈɪnˌteɪkər/","extraExplanation":["“intaker”不是非常常见的日常词。更常见的表达是：\n- 表示“摄入者”：a person who consumes/takes in…（如 a heavy coffee drinker / high sugar consumer）\n- 表示“接待登记的人”：intake coordinator / intake specialist / admissions staff\n在技术语境里（机器、管道、发动机），更常用“intake”作名词或作形容词：intake valve（进气阀）、air intake（进气口）。"]}
{"word":"intakes","summary":{"en":"“Intakes” is the plural of “intake,” meaning the act/amount of taking in (food, air, etc.), an entrance (like an air intake), or a group admitted at one time (a new student/employee intake).","zh":"“intakes”是“intake”的复数，可指摄入/吸入的过程、摄入量、入口（如进气口），或同一批录取/招收的人（如一届新生/新员工）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of taking in something (such as air, food, water, or information)","zh":"摄入；吸入；吸收（如空气、食物、水或信息等）"},"examples":[{"en":"A high salt intake can raise blood pressure.","zh":"高盐摄入会升高血压。"},{"en":"The nurse recorded his daily fluid intake.","zh":"护士记录了他每日的液体摄入量。"}]},{"partOfSpeech":"n.","definition":{"en":"the amount of something taken in during a period of time","zh":"摄入量；吸入量（在一段时间内摄取的数量）"},"examples":[{"en":"Try to increase your fiber intake gradually.","zh":"尽量逐步增加你的膳食纤维摄入量。"},{"en":"Her calorie intake was too low for an active athlete.","zh":"对一名活跃的运动员来说，她的热量摄入过低。"}]},{"partOfSpeech":"n.","definition":{"en":"a place or opening where something enters (for example, an air intake on a machine)","zh":"入口；进气口；进水口（东西进入的开口或位置）"},"examples":[{"en":"Make sure the air intake isn’t blocked by dust.","zh":"确保进气口没有被灰尘堵住。"},{"en":"Water leaked near the intake pipe.","zh":"进水管附近漏水了。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) a group of people admitted at one time (such as new students or employees)","zh":"（同一批）招收/录取的人；新生/新员工一届"},"examples":[{"en":"This year’s intake of first-year students is the largest in a decade.","zh":"今年录取的一年级新生人数是十年来最多的。"},{"en":"The company’s summer intake starts in June.","zh":"公司的暑期新员工一批从六月开始。"}]}],"synonyms":["consumption","inhalation","uptake","admission"],"phonetic":"/ˈɪnˌteɪks/","extraExplanation":["“intakes”通常是名词“intake”的复数，用在：①不同种类的摄入（salt intakes, sugar intakes）②不同人/组的摄入量比较（students’ intakes）③不同批次的录取（the 2026 intake）。","在英式英语里，“intake”表示“一届新生/一批新员工”很常见；美式英语也能用，但在某些场景下也会说“incoming class”或“new hires.”"]}
{"word":"intaminated","summary":{"en":"“Intaminated” is usually a misspelling of “contaminated,” meaning polluted or made impure/unsafe (literally or figuratively).","zh":"“intaminated” 通常是 “contaminated” 的拼写错误，意思是被污染、被弄脏或变得不纯/不安全（也可作比喻用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled) affected by harmful substances (like germs, chemicals, or dirt), making something impure or unsafe.","zh":"（常见拼写为 contaminated）被有害物质（如细菌、化学品或污物）污染，使其变得不纯或不安全。"},"examples":[{"en":"The water was contaminated, so we couldn’t drink it.","zh":"水被污染了，所以我们不能喝。"},{"en":"Be careful not to touch contaminated surfaces in the lab.","zh":"在实验室里要小心，不要触碰被污染的表面。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) influenced by something considered bad or dishonest, making it less pure or trustworthy.","zh":"（比喻）受到被认为不良或不诚实的影响，使其不再“纯粹”或不可信。"},"examples":[{"en":"The investigation was contaminated by rumors and false information.","zh":"这项调查被谣言和错误信息干扰了。"},{"en":"She worried her good memories were contaminated by regret.","zh":"她担心美好的回忆被后悔“污染”了。"}]}],"synonyms":["polluted","tainted","impure","infected","spoiled"],"phonetic":"/kənˈtæməˌneɪtɪd/","extraExplanation":["“intaminated” 通常不是标准英文单词，多数情况下是把 contaminated 拼错了（常见漏掉开头的 con-）。","contaminated 来自动词 contaminate（污染；玷污）。在科学、食品安全与公共卫生语境中非常常见。","搭配很常见：contaminated water/food/air（被污染的水/食物/空气），contaminated sample（受污染的样本），cross-contaminated（交叉污染）。"]}
{"word":"intangibilities","summary":{"en":"Intangibilities are non-physical things—like trust or atmosphere—or, in business, valuable non-physical assets such as brand and patents.","zh":"Intangibilities 指无形的事物（如信任、氛围等），也可指商业中的无形资产（如品牌、专利等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things you cannot touch or measure directly, such as feelings, trust, reputation, or atmosphere.","zh":"无形的事物；无法直接触摸或精确衡量的东西（如感情、信任、名声、氛围等）。"},"examples":[{"en":"In customer service, the intangibilities—like empathy and trust—often matter as much as speed.","zh":"在客户服务中，同理心和信任等无形因素往往和效率一样重要。"},{"en":"The hotel’s success comes from intangibilities: a welcoming vibe and genuine care.","zh":"这家酒店的成功来自无形之处：热情的氛围与真诚的关怀。"}]},{"partOfSpeech":"n.","definition":{"en":"In business and accounting, non-physical assets that create value, such as brand recognition, patents, or goodwill.","zh":"（商业/会计）无形资产；能带来价值的非实体资产，如品牌知名度、专利或商誉。"},"examples":[{"en":"The company invests heavily in intangibilities like its brand and software design.","zh":"公司在品牌与软件设计等无形资产上投入很大。"},{"en":"After the merger, they had to estimate the value of key intangibilities.","zh":"并购后，他们必须估算关键无形资产的价值。"}]}],"synonyms":["intangibles","non-physical factors","nonmaterial things","soft factors","intangible assets"],"phonetic":"/ɪnˌtæn.dʒəˈbɪl.ə.tiz/","extraExplanation":["“intangibilities”是复数形式，单数是“intangibility”。常见搭配：the intangibles / intangible benefits（无形的好处）、soft skills（软技能，常被视为“无形因素”）。在会计语境中也常直接说“intangible assets（无形资产）”，比“intangibilities”更正式、更常用。"]}
{"word":"intangibility","summary":{"en":"Intangibility means the quality of being non-physical or hard to measure, often used for abstract qualities (like trust) or business assets (like patents).","zh":"Intangibility 指“无形性/难以衡量的特质”，常用于抽象品质（如信任）或商业中的无形资产（如专利）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being intangible: unable to be touched or physically measured; existing as an idea, feeling, or abstract value.","zh":"无形性；不可触及、难以用物理方式衡量的特质；以观念、情感或抽象价值存在。"},"examples":[{"en":"The intangibility of trust makes it hard to measure, but easy to feel when it’s missing.","zh":"信任的无形性让它很难衡量，但一旦缺失就很容易感受到。"},{"en":"A brand’s value often depends on intangibility—reputation, loyalty, and public perception.","zh":"一个品牌的价值常常取决于无形因素——名誉、忠诚度和公众印象。"}]},{"partOfSpeech":"n.","definition":{"en":"In business or accounting, the non-physical nature of an asset (such as goodwill, patents, or software).","zh":"（商业/会计）无形资产的非物质属性（如商誉、专利或软件等）。"},"examples":[{"en":"The company’s intangibility is reflected in its patents and research know-how.","zh":"这家公司的无形性体现在它的专利和研发知识诀窍上。"},{"en":"Investors sometimes struggle with the intangibility of digital products compared with factories or land.","zh":"与工厂或土地相比，投资者有时更难把握数字产品的无形性。"}]}],"synonyms":["immateriality","abstractness","nonphysicality"],"phonetic":"/ɪnˌtæn.dʒəˈbɪl.ə.ti/","extraExplanation":["词形拆解：in-（否定）+ tangible（可触摸的/可明确衡量的）+ -ity（名词后缀，表示“性质/状态”），因此 intangibility 就是“不可触及/不可具体衡量的性质”。","使用场景提示：日常表达里更常见的是 intangible（形容词），如 “intangible benefits”（无形收益）；intangibility 更偏书面语、学术或商业语境。"]}
{"word":"intangible","summary":{"en":"Intangible means not physical or touchable—something like a feeling, quality, or (in business) a non-physical asset with value.","zh":"Intangible 指“无形的、不可触摸的”，可指情感/特质等，也可指商业中的“无形资产”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be touched or physically measured; existing as an idea, feeling, or quality rather than a material object.","zh":"无形的；不可触摸或难以用物理方式衡量的；以观念、情感或特质的形式存在，而非实体。"},"examples":[{"en":"Trust is intangible, but it strongly affects how teams work together.","zh":"信任是无形的，但它会强烈影响团队如何合作。"},{"en":"Music can create an intangible sense of comfort.","zh":"音乐能带来一种无形的安心感。"},{"en":"The value of a good reputation is often intangible.","zh":"良好声誉的价值往往是无形的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Business/law) Not having a physical form but still having value, such as a brand name, patent, or copyright.","zh":"（商业/法律）无实体但具有价值的（资产），如品牌、专利或版权等。"},"examples":[{"en":"A company’s intangible assets include its brand and customer relationships.","zh":"一家公司的无形资产包括其品牌和客户关系。"},{"en":"Patents are intangible property that can be bought or sold.","zh":"专利是可以被买卖的无形财产。"}]}],"synonyms":["immaterial","nonphysical","incorporeal","abstract","unseen"],"phonetic":"/ɪnˈtændʒəbəl/","extraExplanation":["词源提示：in- 表示“否定/不”，tangible 来自拉丁语 tangere（“触摸”）。因此 intangible 字面意思就是“无法触摸的”。","常见搭配：intangible benefits（无形收益，如满意度、忠诚度）、intangible qualities（无形特质，如魅力、气质）、intangible assets（无形资产）。","写作/文学语感：intangible 常用来描写“氛围、情绪、存在感”等难以量化的东西，例如“an intangible feeling of hope（无形的希望感）”。"]}
{"word":"intangibleness","summary":{"en":"Intangibleness means the quality of being intangible—real but not physical or easy to define.","zh":"Intangibleness 指“无形性”：真实存在但非实体、难以触摸或清晰界定的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being intangible; not able to be touched, physically measured, or easily defined.","zh":"无形性；不可触摸、不可用物理方式衡量或不易界定的特质。"},"examples":[{"en":"The brand’s intangibleness—trust and reputation—can be more valuable than its buildings.","zh":"这个品牌的无形性——信任与口碑——可能比它的建筑更有价值。"},{"en":"She tried to describe the intangibleness of the moment, but words felt insufficient.","zh":"她试着描述那一刻的无形感，但觉得语言不够用。"}]}],"synonyms":["intangibility","immateriality","nonphysicality","elusiveness"],"phonetic":"/ɪnˈtændʒəbəlnəs/","extraExplanation":["“Intangibleness”是由形容词 intangible（无形的）加名词后缀 -ness 构成。日常英语中更常用的名词是 “intangibility”（无形性、不可触知性），在商业、会计和法律语境里尤其常见。","在文学或写作里，用 “intangibleness” 往往带有更“抽象、诗意”的色彩，用来强调某种难以言说、难以捉摸的感觉或气氛。"]}
{"word":"intangibles","summary":{"en":"“Intangibles” means non-physical things—either abstract qualities (like trust) or, in business, non-physical assets (like patents).","zh":"“intangibles”指无形的事物：既可指抽象品质（如信任），也可指商业中的无形资产（如专利）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that exist and matter but cannot be touched or physically measured (such as qualities, benefits, or ideas).","zh":"无形的事物；看不见、摸不着但很重要的东西（如品质、好处或观念）。"},"examples":[{"en":"In a job interview, confidence and attitude are important intangibles.","zh":"在面试中，自信和态度是很重要的无形因素。"},{"en":"A brand’s reputation is one of its most valuable intangibles.","zh":"品牌声誉是它最有价值的无形资产之一。"},{"en":"They discussed the intangibles that make a team succeed, like trust and communication.","zh":"他们讨论了让团队成功的无形因素，比如信任和沟通。"}]},{"partOfSpeech":"n.","definition":{"en":"In accounting/business: non-physical assets that can have value (for example, patents, trademarks, goodwill).","zh":"（会计/商业）无形资产：没有实体形态但具有价值的资产（如专利、商标、商誉）。"},"examples":[{"en":"The company’s intangibles include patents and software rights.","zh":"这家公司的无形资产包括专利和软件权利。"},{"en":"After the merger, accountants revalued the intangibles on the balance sheet.","zh":"并购之后，会计人员重新评估了资产负债表上的无形资产。"}]}],"synonyms":["nonphysical assets","abstract factors","nonmaterial things","intangibles (assets)","goodwill"],"phonetic":"/ɪnˈtændʒəbəlz/","extraExplanation":["“intangibles”是复数形式，单数是“intangible”。日常表达里常说“the intangibles”（那些无形因素），强调虽然看不见但会影响结果。","在商业语境中，“intangibles”常与“tangibles（有形资产）”对比：tangibles是设备、房产等看得见摸得着的东西；intangibles是专利、品牌、商誉等。"]}
{"word":"intangibly","summary":{"en":"Intangibly means “in an intangible way”—not physically measurable, often subtle but influential.","zh":"intangibly 表示“以无形的方式”；不可用物理衡量，常指微妙但有影响的变化或作用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that cannot be touched or physically measured; existing as a feeling, quality, or influence rather than a material thing.","zh":"以一种无法触摸或用物理方式衡量的方式；作为感受、品质或影响而存在，而非具体的物质。"},"examples":[{"en":"Good leaders build trust, which may seem intangible, but it affects every decision in a team.","zh":"优秀的领导者会建立信任；信任看似无形，却会影响团队的每一个决定。"},{"en":"The town’s history intangibly shaped how people treated newcomers.","zh":"小镇的历史无形中塑造了人们对待新来者的方式。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a subtle, hard-to-define way; not obvious but still present.","zh":"以微妙、难以界定的方式；不明显但确实存在。"},"examples":[{"en":"After the apology, the atmosphere changed intangibly—quieter, softer, less tense.","zh":"道歉之后，气氛无形中变了——更安静、更柔和、也没那么紧绷。"},{"en":"The music intangibly connected them, even though they didn’t speak the same language.","zh":"尽管他们语言不通，音乐却无形地把他们连在了一起。"}]}],"synonyms":["subtly","imperceptibly","invisibly","indirectly"],"phonetic":"/ɪnˈtændʒəbli/","extraExplanation":["词形提示：intangibly 来自形容词 intangible（“无形的、不可触摸的”）+ 副词后缀 -ly。常用搭配有：intangibly influence（无形地影响）、intangibly benefit（带来无形收益）、intangibly change（无形中改变）。","语体与场景：多用于讨论“文化、信任、声誉、氛围、价值观、品牌”等看不见但很重要的因素；在商业语境中也常见（如“intangible assets/无形资产”相关表达）。"]}
{"word":"intangle","summary":{"en":"Entangle means to twist together physically or to involve someone in a complicated, hard-to-escape situation.","zh":"Entangle 指“（物理上）缠绕在一起”，也指“（抽象上）使卷入复杂、难以脱身的局面或关系”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something twisted together with something else; to tangle","zh":"使（某人或某物）与别的东西缠绕在一起；使纠结、缠住"},"examples":[{"en":"Her hair got entangled in the wind.","zh":"她的头发被风吹得缠在一起。"},{"en":"The fishing line became entangled around the rock.","zh":"鱼线缠在了石头上。"}]},{"partOfSpeech":"vt.","definition":{"en":"to involve someone in a complicated situation, relationship, or conflict that is hard to escape","zh":"使卷入（复杂局面/关系/纠纷）；使陷入难以脱身的处境"},"examples":[{"en":"He got entangled in a legal dispute over the contract.","zh":"他因合同问题卷入了一场法律纠纷。"},{"en":"Try not to get entangled in office politics.","zh":"尽量别卷入办公室政治。"},{"en":"They became emotionally entangled after working together for months.","zh":"他们一起工作了几个月后，情感上变得纠缠不清。"}]}],"synonyms":["tangle","snare","trap","involve","embroil"],"phonetic":"/ɛnˈtæŋɡəl/","extraExplanation":["你输入的“intangle”通常是拼写错误，正确拼写是“entangle”。发音以 /en-/ 开头。","常见搭配：entangle A in B（使A卷入B）；be entangled with/in（与……纠缠/陷入……）。","词源上 en- 有“使进入/使处于”的意思，tangle 是“缠结”，合起来就是“使缠结、使陷入”。"]}
{"word":"intaria","summary":{"en":"“Intaria” is not a standard English vocabulary word; it is usually a proper name or a misspelling of a similar word.","zh":"“Intaria”不是标准英语词汇；通常是专有名称，或是与其他近似词的拼写混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a common standard English word; most often seen as a name (e.g., a company/product name, username, or a proper noun).","zh":"不是常见的标准英语单词；最常见的用法是作为名字（例如公司/产品名、用户名或专有名词）。"},"examples":[{"en":"I couldn’t find a dictionary entry for “Intaria,” but it may be a brand name.","zh":"我在词典里找不到“Intaria”的词条，但它可能是一个品牌名。"},{"en":"“Intaria” appears as a proper name in some online contexts.","zh":"“Intaria”在一些网络语境中作为专有名称出现。"}]}],"phonetic":"/ɪnˈtɑriə/","extraExplanation":["“intaria”很可能是拼写误差。最常见的相近词有：\n1) intarsia /ɪnˈtɑrʒə/：木工或石材的“镶嵌工艺/拼嵌细工”（尤指用不同颜色木材拼成图案）。\n2) inertia /ɪˈnɝʃə/：物理学“惯性”，也可比喻“惰性/缺乏改变的动力”。\n如果你告诉我你看到这个词的句子或领域（艺术/物理/品牌/人名），我可以帮你确定最可能的目标词并给出准确释义与例句。"]}
{"word":"intarissable","summary":{"en":"Intarissable means “inexhaustible” or “never running dry,” often describing energy, ideas, or praise.","zh":"intarissable 表示“取之不尽、永不枯竭”，常形容精力、想法或赞美。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"inexhaustible; never seeming to run out (of energy, ideas, patience, praise, etc.)","zh":"取之不尽的；似乎永不枯竭的（精力、点子、耐心、赞美等）"},"examples":[{"en":"She has an intarissable supply of good ideas.","zh":"她的好点子似乎取之不尽。"},{"en":"His intarissable optimism kept the team going.","zh":"他那永不枯竭的乐观精神让团队坚持了下去。"},{"en":"The novel is full of intarissable humor.","zh":"这部小说充满了源源不断的幽默感。"}]}],"synonyms":["inexhaustible","unfailing","boundless","endless","bottomless"],"phonetic":"ˌɪnˈtærɪsəbəl","extraExplanation":["“intarissable”是法语借词，来自法语动词“tarir”（变干、枯竭）的否定形式，字面意思是“不会枯竭的”。在英语语境中较为少见，常用于偏文学、评论或抒情表达。","更常见、自然的英语替代词有：inexhaustible（最常用）、endless、unfailing、boundless。写作时如果读者不熟悉法语词，优先选用这些替代词会更清晰。"]}
{"word":"intarsa","summary":{"en":"“Intarsa” is usually a misspelling of “intarsia,” a technique for making pictures or patterns by fitting different colors/materials together (especially in woodwork or knitting).","zh":"“intarsa”通常是“intarsia”的误拼：指通过拼嵌不同颜色/材料来做出图案或画面（常见于木工镶嵌或编织嵌花）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely meant: intarsia) A decorative craft technique where different colored pieces (in wood, stone, or yarn) are fitted or knitted together to form a picture or pattern.","zh":"（多半是指：intarsia）一种装饰工艺：把不同颜色的材料（如木头、石材）拼嵌在一起，或在编织中用不同颜色的纱线“嵌入”来形成图案或画面。"},"examples":[{"en":"She made an intarsia pillow with a red heart in the center.","zh":"她用嵌花编织法做了一个抱枕，中间有一颗红色的心形图案。"},{"en":"The cabinet door was decorated with wood intarsia showing flowers and birds.","zh":"橱柜门上用木质镶嵌装饰，图案是花和鸟。"}]},{"partOfSpeech":"other","definition":{"en":"(Uncommon form) “Intarsa” itself is not a standard English word; it is often a misspelling or shortened form of “intarsia.”","zh":"（不常见形式）“intarsa”本身不是标准英语词；常见情况是把“intarsia”拼错或简写了。"},"examples":[{"en":"If you saw “intarsa” in a pattern, it probably meant “intarsia.”","zh":"如果你在编织图解里看到“intarsa”，多半是想写“intarsia”。"}]}],"synonyms":["inlay","marquetry","mosaic (similar idea)","colorwork (knitting)"],"phonetic":"/ɪnˈtɑrziə/","extraExplanation":["“Intarsia”源自意大利语，常与木工的“拼木镶嵌”以及针织中的“嵌色/嵌花编织”相关。针织里它通常用于大色块图案：每个色块用独立线团（bobbin），不像提花（Fair Isle）那样把长浮线带在背面。"]}
{"word":"intarsas","summary":{"en":"Intarsia: decorative inlay work, especially using different woods to form patterns or pictures.","zh":"Intarsia：装饰性镶嵌/木拼镶嵌工艺，常用不同木材拼出图案或画面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) Decorative inlay work made by fitting pieces of wood (or sometimes stone/metal) together to form patterns or pictures, especially on furniture.","zh":"（可能是拼写错误）“intarsia”指镶嵌装饰工艺：把不同颜色/材质的木片（有时也用石材、金属）拼接嵌入，形成图案或画面，常见于家具装饰。"},"examples":[{"en":"The antique cabinet door is decorated with floral intarsia.","zh":"那扇古董橱柜门上有花卉图案的木质镶嵌装饰。"},{"en":"She learned intarsia to create detailed pictures using different woods.","zh":"她学习木拼镶嵌工艺，用不同木材制作细致的画面。"}]}],"synonyms":["inlay","wood inlay","marquetry (related)"],"phonetic":"/ɪnˈtɑrziə/","extraExplanation":["你输入的“intarsas”在英语里不常见，更常见的词是 **intarsia**（名词）。如果你是在看工艺/家具/艺术相关内容，很大概率就是它。","**intarsia** 常与 **marquetry（木皮镶嵌/薄木贴拼）** 一起出现：intarsia 更强调用较厚的木块/木片“拼嵌成画”，marquetry 常用更薄的木皮贴面拼花。"]}
{"word":"intarsia","summary":{"en":"Intarsia is a decorative inlay technique (especially in wood) and also a knitting method for making color-block patterns using separate yarn sections.","zh":"intarsia 指一种装饰性的镶嵌拼花工艺（尤指木工嵌木），也指一种用分区纱线织出色块图案的嵌花编织法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative technique used especially in woodworking, where pieces of different colored materials (often wood) are fitted together like a mosaic to form a picture or pattern on a flat surface.","zh":"（尤指木工中的）嵌木镶嵌工艺：把不同颜色或材质（常为木材）的薄片切割后拼嵌在平面上，像马赛克一样形成图案或画面。"},"examples":[{"en":"The cabinet doors were decorated with intarsia showing flowers and birds.","zh":"柜门上用嵌木镶嵌做出了花鸟图案。"},{"en":"In the museum, we saw Renaissance furniture with fine intarsia work.","zh":"在博物馆里，我们看到了带有精美嵌木镶嵌的文艺复兴时期家具。"}]},{"partOfSpeech":"n.","definition":{"en":"A knitting technique that creates patterns with blocks of color by using separate sections of yarn, rather than carrying a strand across the back.","zh":"（编织）嵌花编织法：用不同颜色的纱线分区编织出色块图案，而不是把不用的纱线从背面一直带过去。"},"examples":[{"en":"She knitted an intarsia sweater with a large geometric design.","zh":"她织了一件嵌花毛衣，上面有很大的几何图案。"},{"en":"Intarsia is great for big color shapes, while fair isle is better for small repeating patterns.","zh":"嵌花适合做大色块图形，而费尔岛（提花）更适合小而重复的花纹。"}]}],"synonyms":["inlay","marquetry (wood)","colorwork (knitting)"],"phonetic":"/ˌɪnˈtɑrziə/","extraExplanation":["“intarsia”源自意大利语，常与“inlay（镶嵌）”一起出现：intarsia更强调把不同颜色/材质的片块拼成画面，表面通常较为平整；而某些木工“inlay”也可指把材料嵌入凹槽形成线条或装饰。","在英语里它多用于艺术、家具、工艺品语境；在手工编织圈子里则是一个常见术语。"]}
{"word":"intarsias","summary":{"en":"“Intarsias” means decorative inlay designs made from fitted pieces of different-colored wood; it’s the plural of “intarsia.”","zh":"“intarsias”指用不同颜色木片拼嵌成的装饰图案/嵌木细工，是“intarsia”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Decorative inlay work (especially in wood), made by fitting pieces of different-colored wood (or sometimes other materials) together to form pictures or patterns; plural of “intarsia.”","zh":"（尤指木材的）嵌木细工／镶嵌工艺：将不同颜色的木片（有时也包括其他材料）拼嵌成图案或画面；为“intarsia”的复数。"},"examples":[{"en":"The cabinet doors were decorated with intarsias of flowers and birds.","zh":"橱柜门上装饰着花鸟图案的嵌木细工。"},{"en":"The museum displayed Renaissance furniture with intricate intarsias.","zh":"博物馆展出了带有精美嵌木镶嵌的文艺复兴时期家具。"},{"en":"She learned how to design intarsias by cutting and fitting tiny pieces of wood.","zh":"她通过切割并拼合小木片来学习如何设计嵌木镶嵌图案。"}]}],"synonyms":["inlay","wood inlay","inlaid work","marquetry (related)"],"phonetic":"/ɪnˈtɑrsiə/","extraExplanation":["“Intarsia”源自意大利语，常与文艺复兴时期的家具与镶嵌装饰相关。英文里既可指“这种工艺”，也可指“镶嵌成品/图案”。","易混词：marquetry（贴木细工/木皮镶嵌）通常用薄木皮贴拼在表面；intarsia更常指较厚的木块/木片嵌入并打磨齐平，呈现更立体的效果。","单复数：单数 intarsia；复数 intarsias。艺术史或工艺语境里也可能把 intarsia 当作不可数名词使用。"]}
{"word":"intarsiate","summary":{"en":"Intarsiate means “decorated with inlaid (intarsia) patterns,” especially in artistic crafts.","zh":"intarsiate 指“带有嵌饰/镶嵌（intarsia）图案装饰的”，多用于工艺与艺术品描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Decorated with inlaid patterns (intarsia), especially in woodwork, stonework, or other craft surfaces.","zh":"带有“嵌饰/镶嵌（intarsia）”图案装饰的（尤指木工、石材或其他工艺表面）。"},"examples":[{"en":"The cabinet doors were intarsiate, showing a floral design made from different woods.","zh":"橱柜门做了嵌木装饰，用不同木材拼出花卉图案。"},{"en":"In the museum, you can see intarsiate panels from Renaissance Italy.","zh":"在博物馆里，你可以看到来自意大利文艺复兴时期的嵌饰镶板。"}]}],"synonyms":["inlaid","marquetried","inset","ornamented"],"phonetic":"/ɪnˈtɑr.si.eɪt/","extraExplanation":["“intarsiate”源自意大利语，与“intarsia（嵌饰/镶嵌工艺）”同源。英语里更常用的是名词 intarsia，以及形容词 inlaid / marquetried；intarsiate 较少见，多出现在艺术史、工艺品描述或带意大利语风格的文字中。","在手工编织领域常见的是 intarsia knitting（嵌花编织/换色嵌织），但“intarsiate”作为形容词在该领域并不常用。"]}
{"word":"intarsist","summary":{"en":"An intarsist is someone who creates intarsia—decorative images made by fitting pieces of wood together.","zh":"intarsist 指从事 intarsia（木质拼嵌/镶嵌画）制作的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes intarsia—decorative pictures or patterns made by fitting together pieces of wood (or other materials) in a mosaic-like inlay.","zh":"镶嵌木工（intarsia）工艺师；用不同木片（或其他材料）拼嵌成图案/画面的匠人。"},"examples":[{"en":"The museum invited an intarsist to demonstrate traditional wood-inlay techniques.","zh":"博物馆邀请了一位镶嵌木工艺师来展示传统的木质镶嵌技法。"},{"en":"As an intarsist, she selects woods of different colors to create shading without paint.","zh":"作为一名镶嵌木工艺师，她选择不同颜色的木材来做明暗层次，而不用上漆。"}]}],"synonyms":["intarsia artist","wood-inlay artist","inlay craftsman"],"phonetic":"/ɪnˈtɑr.sɪst/","extraExplanation":["“intarsist”在现代英语中比较少见，更常见的是“intarsia”（这门工艺/作品本身）以及“intarsia artist / intarsia craftsman”（做这种工艺的人）。","“intarsia”一词源自意大利语，常用来指把不同木片切割、打磨后拼接成图像的装饰工艺，类似“木质拼嵌画”。与“marquetry（薄木皮拼花）”相比，intarsia 通常使用较厚的木块，能做出更明显的立体层次。"]}
{"word":"intastable","summary":{"en":"“Intastable” is not standard English; it’s likely a misspelling (often “unstable” or “in a stable”).","zh":"“intastable”不是标准英语，通常是误拼（常见为“unstable”或“in a stable”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of another word or phrase (common possibilities: “in a stable” or “unstable”).","zh":"不是标准英语单词。它很可能是其他单词或短语的拼写错误（常见可能：in a stable 或 unstable）。"},"examples":[{"en":"I couldn’t find “intastable” in a dictionary—did you mean “unstable”?","zh":"我在词典里找不到“intastable”——你是想写“unstable（不稳定的）”吗？"},{"en":"If you meant the location, you can write: “The horse is in a stable.”","zh":"如果你指地点，可以写：“The horse is in a stable.（马在马厩里。）”}],"}]}],"phonetic":"/ɪn.təˈsteɪ.bəl/","extraExplanation":["“intastable”看起来像是把音拼出来的误拼。最常见的两种修正：\n1) “in a stable” /ɪn ə ˈsteɪbəl/：表示“在马厩里/在稳定的环境中”。\n2) “unstable” /ʌnˈsteɪbəl/：形容“（情绪、局势、结构等）不稳定的”。\n\n你能把包含这个词的完整句子发我吗？我可以更准确判断你想表达哪一个。"]}
{"word":"intaxable","summary":{"en":"“Intaxable” is a rare/nonstandard form usually intended to mean “not taxable.” Use “nontaxable” or “tax-exempt” in standard English.","zh":"“intaxable” 属于罕见且不标准的写法，通常想表达“免税的”。标准英语建议用 “nontaxable” 或 “tax-exempt”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Not taxable; not subject to tax.","zh":"（非标准/罕见用法）免税的；不需缴税的。"},"examples":[{"en":"Some benefits may be intaxable under certain rules, but the official term is usually “nontaxable.”","zh":"在某些规定下，一些福利可能被说成 intaxable，但更正式的说法通常是 “nontaxable”。"},{"en":"If the allowance is intaxable, you don’t include it in your taxable income.","zh":"如果这项补贴是“免税的”，你就不把它计入应税收入。"}]},{"partOfSpeech":"other","definition":{"en":"(Commonly intended meaning in writing) Likely a misspelling of “untaxable” or “nontaxable.”","zh":"（写作中常见的本意）很可能是 “untaxable” 或 “nontaxable” 的拼写错误。"},"examples":[{"en":"Correct: This scholarship is nontaxable in many cases.","zh":"正确：这类奖学金在很多情况下是免税的。"},{"en":"Correct: The item is tax-exempt (untaxable) with proper documentation.","zh":"正确：凭相关文件，该项目可享受免税（untaxable/tax-exempt）。"}]}],"synonyms":["nontaxable","tax-exempt","untaxable"],"phonetic":"/ˌɪnˈtæk.sə.bəl/","extraExplanation":["“intaxable”在现代英语中不是常见、标准的词，容易让人困惑。日常与正式语境更常用：\n- nontaxable（免税的/不计入应税收入的）\n- tax-exempt（免税的，常见于法律/税务文件）\n- untaxable（不可征税的/免税的，较少见但可用）\n\n如果你是在税务、工资或报税表格里看到“intaxable”，很可能是拼写错误或内部用语；建议以文件里的正式术语（nontaxable / tax-exempt）为准。"]}

