{"word":"inthral","summary":{"en":"Inthral is an archaic form of enthrall/enthral, meaning either to enslave or (more commonly today) to captivate completely.","zh":"inthral 是 enthrall/enthral 的古体写法，表示“使为奴/控制”，也可指（现代更常见的）“使深深着迷、完全吸引”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To enslave; to hold someone in bondage or under complete control.","zh":"（古体）使为奴；使受束缚或完全控制。"},"examples":[{"en":"In old tales, the villain sought to inthral the villagers by force.","zh":"在古老故事里，反派试图用武力使村民沦为奴隶。"},{"en":"They feared being inthralled by a ruler who allowed no dissent.","zh":"他们害怕被一个不容异议的统治者控制得像奴隶一样。"}]},{"partOfSpeech":"vt.","definition":{"en":"To captivate or fascinate so strongly that someone’s attention feels “held.”","zh":"使着迷；使深深吸引，以至于注意力仿佛被“抓住”。"},"examples":[{"en":"The audience was inthralled by the storyteller’s voice.","zh":"观众被讲故事的人声音深深吸引。"},{"en":"She felt inthralled by the city’s night lights.","zh":"她被这座城市的夜景灯光迷住了。"}]}],"synonyms":["enthrall","enthral","captivate","fascinate","enchant","spellbind"],"phonetic":"/ɪnˈθrɔl/","extraExplanation":["“inthral”是“enthral/enthrall”的古体或较少见拼写。现代英语更常用enthrail/enthrall，尤其是比喻义“使着迷”。","词源与“thral(l)”有关，古英语中有“奴隶、被束缚的人”的意思，所以这个词最早的核心含义是“使为奴、使受控”，后来引申出“迷住、吸引得无法自拔”。","写作时如果不是刻意营造古风或文学语气，一般建议用更常见的拼写“enthrall”。"]}
{"word":"inthrall","summary":{"en":"Inthrall means to captivate completely, or (more negatively) to subjugate as if enslaving.","zh":"Inthrall 意为使人完全着迷；也可指（更偏负面）像奴役一样使人屈从。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to captivate or fascinate someone completely; to hold someone’s attention and interest strongly","zh":"使某人着迷；深深吸引，使全神贯注"},"examples":[{"en":"The documentary about space exploration inthralls audiences from start to finish.","zh":"这部关于太空探索的纪录片从头到尾都让观众着迷。"},{"en":"She was inthralled by the storyteller’s voice and vivid details.","zh":"她被讲故事者的声音和生动细节深深吸引。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bring someone under control as if enslaved; to subjugate","zh":"像奴役一样控制；使屈从"},"examples":[{"en":"The tyrant tried to inthrall the region through fear and propaganda.","zh":"暴君试图通过恐惧和宣传来控制并压迫该地区。"},{"en":"In the novel, the hero resists being inthralled by power.","zh":"在小说中，主人公抗拒被权力奴役。"}]}],"synonyms":["enthrall","captivate","fascinate","spellbind","enslave","subjugate"],"phonetic":"/ɪnˈθrɔl/","extraExplanation":["“inthrall”是“enthrall”的较少见拼写变体，含义相同。日常写作中更常见的是“enthrall”。","这个词带有“被牢牢控制”的画面感：既可以是积极的“迷住”，也可以是消极的“奴役/压制”。语境决定褒贬。"]}
{"word":"inthralled","summary":{"en":"Inthralled means completely fascinated or captivated (a less common spelling of enthralled).","zh":"inthralled 意为“着迷的、被深深吸引的”，是 enthralled 的较少见拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"completely fascinated or captivated; unable to stop paying attention","zh":"着迷的；被深深吸引的；目不转睛的"},"examples":[{"en":"The audience was inthralled by her storytelling.","zh":"观众被她的讲故事方式深深吸引。"},{"en":"I was inthralled to hear how the city changed over time.","zh":"我着迷地听着这座城市如何随着时间变化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fascinate or captivate someone completely (past tense/past participle: inthralled)","zh":"使着迷；使深深吸引（inthralled 为过去式/过去分词）"},"examples":[{"en":"The documentary inthralled viewers with rare footage.","zh":"这部纪录片用罕见影像让观众看得入迷。"},{"en":"She has been inthralled by astronomy since childhood.","zh":"她从小就对天文学着迷。"}]}],"synonyms":["enthralled","captivated","fascinated","spellbound","mesmerized"],"phonetic":"/ɪnˈθrɔld/","extraExplanation":["“inthralled”是“enthralled”的拼写变体，较少见；在美式英语里更常用“enthralled”。两者意思相同：被强烈吸引、迷住。","词源和“thrall（奴仆、束缚）”有关，原本有“被控制、受支配”的含义；现代用法多为比喻，通常表达“被迷住”，语气偏正面。使用时注意语境，避免让人误解为被操控。"]}
{"word":"inthralling","summary":{"en":"Enthralling means extremely interesting or exciting—so captivating that it holds your full attention.","zh":"Enthralling 指“非常有趣或刺激、让人着迷到全神贯注”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very interesting or exciting in a way that holds your attention completely; captivating.","zh":"非常吸引人、令人着迷的；让人全神贯注的。"},"examples":[{"en":"It was an enthralling story—I couldn’t put the book down.","zh":"那是个引人入胜的故事——我书都放不下。"},{"en":"The documentary is enthralling from start to finish.","zh":"这部纪录片从头到尾都很吸引人。"},{"en":"She gave an enthralling performance on stage.","zh":"她在舞台上的表演令人着迷。"}]}],"synonyms":["captivating","fascinating","gripping","spellbinding","absorbing"],"phonetic":"/ɪnˈθrɔlɪŋ/","extraExplanation":["“inthralling”通常被视为“enthralling”的拼写错误；标准拼写是 enthralling。","词根来自 enthrall（使着迷/使受控制），原义与“被俘虏、受奴役”有关，引申为“被完全吸引住”。日常语境里它是褒义，表示注意力被牢牢抓住。"]}
{"word":"inthrallment","summary":{"en":"Inthrallment means being deeply captivated (most common), and more formally it can mean being in bondage or under someone’s control.","zh":"inthrallment 指“深深着迷”（最常见），更正式时也可指“受束缚/受人控制、奴役”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of being completely fascinated or captivated; strong enjoyment and interest that holds your attention.","zh":"入迷；着迷；被深深吸引的状态。"},"examples":[{"en":"The audience watched in inthrallment as the magician finished the final trick.","zh":"魔术师完成最后一个把戏时，观众看得入迷。"},{"en":"She listened in inthrallment to his stories about living abroad.","zh":"她入迷地听他讲在国外生活的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, more formal) A state of being under someone’s power or control; bondage or subjection.","zh":"（较少见，较正式）受他人控制的状态；奴役；束缚。"},"examples":[{"en":"The novel portrays a leader who keeps people in inthrallment through fear.","zh":"这部小说描写一位领袖用恐惧让人们受其控制。"},{"en":"He struggled to break free from emotional inthrallment.","zh":"他努力摆脱情感上的束缚。"}]}],"synonyms":["enchantment","fascination","captivation","absorption","spellbound (phrase)","bondage","subjection"],"phonetic":"/ɪnˈθrɔlmənt/","extraExplanation":["“inthrallment”来自“in thrall”（在束缚之中）这一较古老的表达，thrall 原本有“奴仆、受奴役的人”的意思，所以这个词既可以表示“被迷住”，也能保留“被控制/束缚”的较严肃含义。","现代英语里更常见的拼写是“enthrallment”（或英式拼写“enchantment/enthralment”相关），在日常写作中如果想表达“着迷”，用“enthrallment”更自然；“inthrallment”更偏文学/古风。"]}
{"word":"inthralls","summary":{"en":"“Inthralls” usually means “in thrall”: strongly captivated by or under the control of someone or something.","zh":"“inthralls”多为非标准拼写，通常指“in thrall”：被某人/某物强烈吸引或受其支配。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Under someone’s power or strong influence; captivated, controlled, or “enslaved” (often used as “in thrall to someone/something”).","zh":"受某人/某物强烈影响或控制；被迷住、被支配（常用搭配：in thrall to...）。"},"examples":[{"en":"Many readers were in thrall to the novel’s vivid characters.","zh":"许多读者都被小说中生动的人物深深吸引。"},{"en":"He seemed in thrall to his boss and rarely disagreed.","zh":"他似乎受老板支配，几乎从不反对。"},{"en":"She was in thrall to the idea of quick success.","zh":"她被“迅速成功”的想法所蛊惑。"}]}],"synonyms":["captivated","enthralled","spellbound","under someone’s influence","in someone’s power"],"phonetic":"/ɪn ˈθrɔl/","extraExplanation":["“inthralls”通常是把短语写成一个词的非标准拼写。更常见、规范的写法是 **in thrall**（也常见 **in thrall to ...**）。","**thrall** 这个词在较早的英语里有“奴隶、受奴役的人”的意思，因此 **in thrall** 带有“被束缚/被控制”的语感；现代用法里也很常指“被强烈吸引、着迷”。","文学/正式语境中更常见该表达；日常口语里也可以用 **captivated by**（被吸引）、**under someone’s spell**（着魔似的被影响）来替换。"]}
{"word":"inthralment","summary":{"en":"Inthralment means deep fascination or being under strong control; it’s a less common, older-looking spelling of enthrallment.","zh":"inthralment 指“深深着迷”或“受强力控制/束缚”；它是 enthrallment 较少见、较文学化的拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of being completely fascinated or captivated; deep, absorbing interest.","zh":"着迷；入迷；被深深吸引的状态。"},"examples":[{"en":"The audience listened in inthralment as the storyteller spoke.","zh":"说书人开讲时，观众听得入了迷。"},{"en":"Her inthralment with space exploration began when she was a child.","zh":"她从小就开始对太空探索着迷。"}]},{"partOfSpeech":"n.","definition":{"en":"A state of being held in bondage or under strong control (literal or figurative).","zh":"被奴役；受强力控制（字面或比喻）。"},"examples":[{"en":"The novel describes a kingdom living in inthralment to a cruel ruler.","zh":"这部小说描写了一个王国被残暴统治者奴役的处境。"},{"en":"He gradually escaped the inthralment of fear and began to speak up.","zh":"他逐渐摆脱恐惧的束缚，开始敢于发声。"}]}],"synonyms":["enthrallment","fascination","captivation","absorption","enchantment","bondage","subjection"],"phonetic":"/ɪnˈθrɔlmənt/","extraExplanation":["“inthralment”更常见的拼写是“enthrallment”。“in-”这个拼写带有较旧/文学化的味道，在现代日常英语中相对少见。","词根与“thrall（奴隶、受控的人）”有关，所以这个词既能表示“被迷住”，也保留了“被束缚、被控制”的隐含意义。写作时若想更中性、更常用，通常选“enthrallment”；若想更古典或强调“束缚感”，可以用“inthralment”。"]}
{"word":"inthrals","summary":{"en":"Enthrall means to fascinate someone completely, sometimes suggesting a figurative kind of control.","zh":"Enthrall 指让人完全着迷；也可比喻为对某人产生一种控制或束缚。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to capture someone’s attention completely; to fascinate or charm","zh":"使某人完全着迷；迷住；吸引住"},"examples":[{"en":"The documentary enthralled the audience from start to finish.","zh":"这部纪录片从头到尾都把观众迷住了。"},{"en":"She was enthralled by the story’s vivid characters.","zh":"她被故事里鲜活的人物深深吸引。"}]},{"partOfSpeech":"vt.","definition":{"en":"(often figurative) to hold someone in a kind of control, as if they were a slave","zh":"（常为比喻）控制/束缚某人，仿佛使其成为奴隶"},"examples":[{"en":"He felt enthralled by the expectations of others.","zh":"他觉得自己被他人的期待所束缚。"},{"en":"The hero refuses to be enthralled by fear.","zh":"主人公拒绝被恐惧支配。"}]}],"synonyms":["captivate","fascinate","charm","spellbind","enchant"],"phonetic":"/ɪnˈθrɔl/","extraExplanation":["你输入的“inthrals”不是标准拼写；最常见的对应词是 **enthralls**（第三人称单数）或 **enthralled**（过去式/过去分词），动词原形是 **enthrall**。","词源上，**thrall** 在古英语里有“奴隶、受支配的人”的意思，所以 **enthrall** 既可以表示“迷住”，也保留了“使受控制/束缚”的比喻含义。","常见搭配：**be enthralled by**（被……迷住）、**enthrall an audience**（迷住观众）。文学/叙述性写作中常用来表达强烈、持续的吸引力。"]}
{"word":"inthrone","summary":{"en":"Inthrone means to enthrone: to place a ruler on a throne, or (figuratively) to make someone/something supreme.","zh":"inthrone 意为“使登基/加冕”，也可比喻“把某人/某事奉为至高、置于最高地位”（相当于 enthrone）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic or less common) To place someone on a throne; to make someone king/queen by crowning or formally installing them.","zh":"（较古旧或不常用）使某人登上王位；为某人加冕或正式拥立为君主。"},"examples":[{"en":"The nobles gathered to inthrone the new king after the old ruler died.","zh":"旧王去世后，贵族们聚集起来拥立新王登基。"},{"en":"The ceremony was meant to inthrone her as the rightful queen.","zh":"这场仪式旨在为她加冕，使她成为合法的女王。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To place someone or something in a position of highest power, honor, or importance.","zh":"（比喻）使某人或某物居于至高权力、荣誉或重要地位。"},"examples":[{"en":"In some organizations, tradition can inthrone seniority over creativity.","zh":"在一些组织里，传统可能会让资历凌驾于创造力之上。"},{"en":"The media can inthrone a celebrity overnight.","zh":"媒体可能让一位名人一夜之间被捧上神坛。"}]}],"synonyms":["enthrone","crown","install","inaugurate","exalt"],"phonetic":"/ɪnˈθroʊn/","extraExplanation":["“inthrone”在现代英语里不如“enthrone”常见，常被视为较古旧或文学性的拼写变体。日常写作与学习中一般优先使用“enthrone”。","比喻用法里，它常带有“把某人/某事抬到最高位置、奉为圭臬”的含义，有时也隐含批评意味（如盲目崇拜）。"]}
{"word":"inthroned","summary":{"en":"Inthroned means placed on a throne or formally installed into power, often in ceremonial, religious, or literary contexts.","zh":"Inthroned 指“被立为君主/被加冕登基”或“被正式就任高位”（常见于仪式、宗教或文学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Placed on a throne; made a king, queen, or ruler (often in a ceremonial or poetic sense).","zh":"被加冕登基的；被立为君主或统治者的（常用于仪式或诗歌式表达）。"},"examples":[{"en":"After the ceremony, the new monarch was inthroned before the cheering crowd.","zh":"仪式结束后，新君主在欢呼的人群前登基就位。"},{"en":"The painting shows an inthroned queen holding a scepter.","zh":"这幅画描绘了一位手持权杖、端坐王座的女王。"}]},{"partOfSpeech":"adj.","definition":{"en":"Formally installed into a high office, especially a bishop in a cathedral (church context).","zh":"被正式就任高位的；（尤指教会语境中）主教在主教座堂被正式就职/就座的。"},"examples":[{"en":"The bishop was inthroned in the cathedral during a solemn service.","zh":"主教在庄严的礼拜中于主教座堂举行就座就职仪式。"},{"en":"In some traditions, a leader is inthroned as a sign of spiritual authority.","zh":"在一些传统中，领袖会以“就座”的形式被正式确立其属灵权威。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense or past participle of \"inthrone\": to place (someone) on a throne or in a position of power.","zh":"\"inthrone\" 的过去式/过去分词：使（某人）登上王座；使掌权。"},"examples":[{"en":"They inthroned the young prince after his father's death.","zh":"父亲去世后，他们拥立年幼的王子登基。"},{"en":"The legend says the hero was inthroned by the gods.","zh":"传说这位英雄被众神拥立登上王位。"}]}],"synonyms":["enthroned","crowned","installed","seated"],"phonetic":"/ɪnˈθroʊnd/","extraExplanation":["“inthroned”多见于历史叙述、宗教仪式描述和文学/诗歌语体，比日常英语更正式。日常更常说“crowned（加冕）”或“installed（就任）”。","宗教用法中常与“enthroned”接近，强调在教堂中的“就座”仪式（与主教座位 cathedra 相关）。","词形提示：in-（使进入某状态）+ throne（王座）。常见近义词：enthroned、crowned、installed；反义倾向：dethroned（被废黜）。"]}
{"word":"inthrones","summary":{"en":"“inthrones” is likely a misspelling of “enthrones,” meaning to place someone on a throne or, figuratively, to make something supreme.","zh":"“inthrones”很可能是“enthrones”的误拼，意思是让某人登基/加冕，或引申为把某事奉为至高无上。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely) the verb form of “enthrone”: to place someone on a throne; to make someone a king/queen or an official leader.","zh":"（很可能）是动词“enthrone”的形式：把某人扶上王位；使某人成为君主或正式领导者。"},"examples":[{"en":"The nobles enthroned the young prince after the old king died.","zh":"老国王去世后，贵族们拥立年幼的王子登基。"},{"en":"In the story, the people enthrone her as their new leader.","zh":"在故事里，人们拥立她成为新的领袖。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) to treat an idea, person, or value as the most important—almost like a ruler.","zh":"（引申）把某种观念、某个人或某种价值奉为至高无上，像“供上王位”一样。"},"examples":[{"en":"The company enthroned profit above everything else.","zh":"这家公司把利润奉为至高无上。"},{"en":"Some fans enthrone celebrities and forget they’re just people.","zh":"有些粉丝把明星捧上神坛，忘了他们也只是普通人。"}]}],"synonyms":["crown","install","inaugurate","anoint","elevate"],"phonetic":"/ɪnˈθroʊnz/","extraExplanation":["你输入的“inthrones”不是常见标准拼写。最接近的常用词是 **enthrones**（动词 *enthrone* 的第三人称单数：he/she/it enthrones）。","词源提示：*en-*（使…进入/处于某状态）+ *throne*（王座）。写作或新闻里常用来描述“加冕/登基”；在评论性文章里也常用作比喻，表示“把某事物抬到最高地位”。","如果你原本想表达“in thrones”（在王座上/在一排王座之间），那通常需要分开写，并且语境更偏文学或宗教（如《圣经》中提到的“thrones”作为天使阶级之一）。"]}
{"word":"inthrong","summary":{"en":"Inthrong means to crowd in or fill a place, often in a poetic or old-fashioned style.","zh":"Inthrong 指（人或物）涌入、挤满某处，常见于诗歌或较古雅的用法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to crowd in; to pack or fill (a place) with people or things","zh":"（使）涌入；（把某处）挤满、塞满（人或物）"},"examples":[{"en":"Fans inthronged the narrow street outside the theater.","zh":"粉丝们涌入剧院外那条狭窄的街道。"},{"en":"By noon, shoppers had inthronged the market stalls.","zh":"到中午时，购物的人已经把市场摊位挤得满满当当。"}]},{"partOfSpeech":"vi.","definition":{"en":"to gather or press in (often used in poetic or old-fashioned writing)","zh":"聚集、拥入（多见于诗歌或较古雅的表达）"},"examples":[{"en":"Dark thoughts seemed to inthrong his mind as he walked home alone.","zh":"他独自走回家时，阴郁的念头像潮水般涌上心头。"},{"en":"Birds inthronged the branches at dusk.","zh":"黄昏时，鸟儿聚集在树枝上。"}]}],"synonyms":["crowd in","throng","pack","fill","jam"],"phonetic":"/ɪnˈθrɔŋ/","extraExplanation":["“inthrong”较少见，带有明显的文学/古风色彩，日常英语里更常用“crowd in/into”“throng”“pack”“fill up”。","词形上可理解为前缀“in-（向内）”+“throng（人群；蜂拥）”，强调“往里面挤、往里涌”的感觉。"]}
{"word":"inthroning","summary":{"en":"Inthroning means the formal act or ceremony of placing someone on a throne—installing a monarch or high leader (often used in religious contexts too).","zh":"inthroning 指让某人正式登基或就任的行为/仪式（也常用于宗教语境，如主教就座仪式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ceremony or act of formally placing a king, queen, or other leader (often a bishop) on a throne; an installation into high office","zh":"（国王、女王或宗教领袖如主教的）登基/就座大典；正式就任、加冕（就职）"},"examples":[{"en":"The inthroning of the new monarch drew crowds from across the country.","zh":"新君的登基大典吸引了全国各地的民众。"},{"en":"In some churches, the bishop’s inthroning takes place in the cathedral.","zh":"在一些教会传统中，主教的就座（就任）仪式在主教座堂举行。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of inthrone: formally installing someone as a ruler or high-ranking leader","zh":"inthrone 的现在分词：使某人登基/就任；正式拥立、册立"},"examples":[{"en":"The council is inthroning the new leader in a public ceremony.","zh":"议会正在通过公开仪式拥立新领袖。"},{"en":"They spent weeks preparing for inthroning rites and celebrations.","zh":"他们花了数周为登基仪式和庆典做准备。"}]}],"synonyms":["enthroning","coronation","installation","accession","inauguration"],"phonetic":"/ɪnˈθroʊnɪŋ/","extraExplanation":["“inthrone”是“enthrone”的较少见变体；在现代英语中更常用的是“enthroning”。","这个词常见于庄重、正式或宗教语境（如主教在主教座堂的“就座”仪式），日常口语里较少使用。"]}
{"word":"inthronistic","summary":{"en":"A rare adjective meaning “related to enthronement or being placed on a throne.”","zh":"一个很少见的形容词，意思是“与登基/即位/就任王位有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to putting someone on a throne; connected with enthronement (being made a king, queen, or other high religious leader).","zh":"与“登基/即位/就任（王位或高位宗教职位）”有关的；关于加冕或就座于王位的。"},"examples":[{"en":"The museum displayed inthronistic artifacts from the coronation ceremony.","zh":"博物馆展出了与加冕/登基仪式有关的文物。"},{"en":"Her research focuses on inthronistic rituals in medieval Europe.","zh":"她的研究聚焦于中世纪欧洲的即位仪式。"}]}],"synonyms":["enthronement-related","coronation-related","regal","royal"],"phonetic":"/ˌɪnθroʊˈnɪstɪk/","extraExplanation":["“inthronistic”非常罕见，多见于学术或仿古（带有古风/文献风格）的写法。现代英语更常用：enthro(n)ement（登基/就任）、coronation（加冕）、enthrone（使登基/使就任）。","构词上可理解为 in-（使进入某种状态）+ throne（王位）+ -istic（……的/与……相关的），意思就是“与登上王位相关的”。","容易与“intronic”（与基因内含子 intron 有关）混淆；两者含义完全不同。"]}
{"word":"inthronizate","summary":{"en":"An archaic verb meaning “to enthrone; to officially install someone as a ruler (or sometimes a bishop).”","zh":"一个古语动词，意为“使登基/加冕；（有时）使主教等正式就任”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To place someone on a throne; to make someone a king/queen or officially install a ruler.","zh":"（古语）使登基；使就位于王座；正式拥立为君主。"},"examples":[{"en":"The nobles gathered to inthronizate the new monarch after the old king died.","zh":"旧王去世后，贵族们聚集起来，使新君主登基。"},{"en":"In old chronicles, a bishop might be said to be inthronizated in a cathedral.","zh":"在古老的编年史中，主教有时会被说成在大教堂“就座/就任”（即正式就职）。"}]}],"synonyms":["enthrone","enthronize","crown","install"],"phonetic":"/ɪnˈθroʊnəˌzeɪt/","extraExplanation":["“inthronizate”非常罕见，带有明显的古风色彩。现代英语更常用的是 **enthrone**（动词）或 **enthronize**（英式拼写为 enthronise）。","它常出现在较旧的宗教或历史语境中：不仅可指君主“登基”，也可指主教等宗教领袖在主教座堂的“就任/安座”（类似中文的“就职典礼”概念）。","词根与“throne（王座）”相关；前缀 in- 有“置入、置于……之中”的意味，使整体含义接近“置于王座之上”。"]}
{"word":"inthronization","summary":{"en":"Inthronization is a formal ceremony of installing a monarch or a high religious leader (especially a bishop) into office.","zh":"Inthronization 指君主登基或宗教高层（尤指主教）正式就职就座的仪式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ceremony or act of formally placing a king, queen, or other leader in power (often by seating them on a throne).","zh":"（国王、女王或其他领袖）登基/即位的仪式或行为（常指被正式安置在王座上）。"},"examples":[{"en":"The country held a grand inthronization for the new king.","zh":"这个国家为新国王举行了盛大的登基仪式。"},{"en":"Crowds gathered outside the palace to celebrate the inthronization.","zh":"人群聚集在宫殿外庆祝即位典礼。"}]},{"partOfSpeech":"n.","definition":{"en":"A formal installation ceremony for a high religious leader (especially a bishop) in a cathedral, often involving seating them in an official chair (cathedra).","zh":"（尤指主教）在大教堂中的正式就职/就座仪式，通常包括坐上象征权威的座椅（cathedra）。"},"examples":[{"en":"The bishop’s inthronization took place in the cathedral on Sunday.","zh":"主教的就职就座仪式在周日于大教堂举行。"},{"en":"During the inthronization, the new bishop was led to the cathedra.","zh":"在就座仪式中，新主教被引领到主教座椅前。"}]}],"synonyms":["enthronement","coronation","installation","investiture"],"phonetic":"/ˌɪnθroʊnəˈzeɪʃən/","extraExplanation":["“inthronization”由 in-（使进入某种状态）+ throne（王座）构成，字面意思是“置于王座之上”。\n在宗教语境中，与“enthronement”相近，但“inthronization”更常用来强调主教在大教堂“就座”（cathedra）这一象征性动作。"]}
{"word":"inthronize","summary":{"en":"Inthronize means to place someone on a throne, or figuratively to raise someone or something to the highest status.","zh":"inthronize 指使某人登基/加冕，也可比喻把某人或某事奉为至高无上。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To place someone on a throne; to formally make someone a king, queen, or ruler.","zh":"使（某人）登基；立（某人）为君主；正式让某人成为国王/女王/统治者。"},"examples":[{"en":"The prince was enthronized after the death of his father.","zh":"王子在父王去世后登基。"},{"en":"The ceremony enthronized her as queen in front of the whole nation.","zh":"在全国人民面前，这场仪式使她加冕为女王。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give someone very high status or power, as if placing them on a throne (often used in a critical or figurative way).","zh":"（比喻，常带批评）把……奉为至高无上；让……拥有极高地位或权力。"},"examples":[{"en":"Fans sometimes enthronize celebrities and forget they are ordinary people.","zh":"粉丝有时会把名人奉为神明，忘了他们也只是普通人。"},{"en":"The new policy enthronized profit above all other values.","zh":"新政策把利润奉为高于一切的价值。"}]}],"synonyms":["enthronize","enthrone","crown","install","inaugurate","elevate"],"phonetic":"/ɪnˈθroʊnaɪz/","extraExplanation":["“inthronize”更常见的拼写是“enthronize”（美式也常见“enthrone”作动词）。两者意思相同：字面是“登上王座”，引申为“把某人/某事捧到最高地位”。","词根联想：throne（王座）→ enthrone/enthronize（使上王座）。在宗教语境中也可指主教等的“就任/就座”仪式（如“enthronement”）。"]}
{"word":"inthrow","summary":{"en":"“inthrow” isn’t standard; the intended phrase is usually “in (the) throes of,” meaning ‘in the middle of an intense or difficult process.’","zh":"“inthrow”不是规范写法；通常应为“in (the) throes of”，意思是“正处于激烈/艰难过程之中”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“inthrow” is not a standard English word; it is most often a misspelling of the phrase “in throes (of).”","zh":"“inthrow”不是标准英语单词；它最常见的是短语“in throes (of)”的拼写错误。"},"examples":[{"en":"I think you meant “in throes of,” not “inthrow.”","zh":"我觉得你想写的是“in throes of”，不是“inthrow”。"}]},{"partOfSpeech":"phrase","definition":{"en":"in throes (of): in the middle of a strong, difficult, or chaotic process (such as change, debate, pain, or conflict).","zh":"in throes (of)：正处于某个强烈、艰难或混乱过程的关键阶段（如变革、争论、痛苦或冲突）。"},"examples":[{"en":"The company is in the throes of a major reorganization.","zh":"这家公司正处于重大重组的阵痛期。"},{"en":"The city was in the throes of a heated political debate.","zh":"这座城市正陷入激烈的政治争论之中。"},{"en":"She was in the throes of grief after the loss.","zh":"失去之后，她沉浸在强烈的悲痛之中。"}]}],"synonyms":["in the midst of","in the middle of","in the grip of","in a period of","undergoing"],"phonetic":"/ɪn θroʊz/","extraExplanation":["“throe”原意是“（剧烈的）疼痛、痉挛”，所以“in throes of …”带有“阵痛/挣扎中”的画面感，常用来形容处在剧烈变化或强烈情绪的阶段。","固定搭配更常见的是复数：in the throes of + 名词（如 change, crisis, debate）。单数“in a throe of …”较少见。","易混点：不要写成“in throws of”。throw 是“投掷”，意思不同。"]}
{"word":"inthrust","summary":{"en":"“Inthrust” means a strong push or movement inward, or something that forces its way in.","zh":"“inthrust”指强力向内推进/冲入，或指向内侵入的力量或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a forceful push or movement inward; something that thrusts into an area (often used in geology or formal writing).","zh":"向内的猛推/冲入；（常用于地质或较正式的写作中）向内侵入的事物/力量。"},"examples":[{"en":"The earthquake created an inthrust of rock layers that changed the shape of the ridge.","zh":"地震造成岩层向内挤压（inthrust），改变了山脊的形状。"},{"en":"The city felt the inthrust of new ideas as students arrived from around the world.","zh":"来自世界各地的学生到来，让这座城市感受到新思想的涌入（inthrust）。"}]}],"synonyms":["inward thrust","influx","intrusion","incursion","push"],"phonetic":"/ˈɪnθrʌst/","extraExplanation":["“inthrust”由前缀“in-（向内）”+ “thrust（猛推/插入）”构成，语感偏书面、技术或比喻表达。日常英语里更常用“influx（涌入）”“intrusion（闯入/侵入）”“push inward（向内推）”等。"]}

