{"word":"intubate","summary":{"en":"Intubate means to insert a breathing tube, usually into the trachea, to help someone breathe or during anesthesia.","zh":"intubate 指插入导管（多为气管插管），用于帮助呼吸或在麻醉/手术中控制呼吸。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put a tube into someone’s body—most often into the windpipe (trachea)—to help them breathe or to deliver anesthesia","zh":"给人体插入导管——最常见是插入气管（气管插管）——以帮助呼吸或进行麻醉"},"examples":[{"en":"The doctors had to intubate the patient because she couldn’t breathe on her own.","zh":"因为病人无法自主呼吸，医生不得不给她进行气管插管。"},{"en":"He was intubated during surgery so the anesthesiologist could control his breathing.","zh":"他在手术中被插管，以便麻醉医生控制他的呼吸。"}]}],"synonyms":["tube","insert a breathing tube","perform intubation"],"phonetic":"/ˈɪn.tuˌbeɪt/","extraExplanation":["“intubate”是医学用语，日常对话中通常不会用。新闻里常见于重症或急救场景（如呼吸衰竭、严重肺炎等）。","常见搭配：intubate a patient（给病人插管）、be intubated（被插管）、endotracheal intubation（气管内插管）。需要注意：它并不等同于“插针/打点滴（IV）”，而是与呼吸道相关的“插管”。"]}
{"word":"intubated","summary":{"en":"Intubated means a breathing tube has been placed in a person’s windpipe to help them breathe, often in emergency care or during surgery.","zh":"Intubated 指已进行气管插管，把呼吸管置入气管以帮助呼吸，常见于急救或手术期间。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a patient) having a tube placed into the windpipe (trachea), usually through the mouth, to help breathing—often connected to a ventilator.","zh":"（病人）已被插管（通常经口将管子置入气管），以帮助呼吸——常会连接呼吸机。"},"examples":[{"en":"After the surgery, he was intubated in the ICU to support his breathing.","zh":"手术后，他在重症监护室被插管以支持呼吸。"},{"en":"The doctor explained that being intubated can make it hard to speak.","zh":"医生解释说，插管后会很难说话。"}]},{"partOfSpeech":"vt.","definition":{"en":"To place a tube into a person’s windpipe (trachea), typically to keep the airway open or to provide ventilation.","zh":"给（某人）进行气管插管；将管子置入气管内，通常用于保持气道通畅或进行机械通气。"},"examples":[{"en":"Paramedics intubated the patient because he could not breathe on his own.","zh":"急救人员因病人无法自主呼吸而为其进行插管。"},{"en":"The anesthesiologist may intubate you before certain operations.","zh":"在某些手术前，麻醉医生可能会为你插管。"}]}],"synonyms":["on a breathing tube","on a ventilator (often)","tube-assisted breathing","intubation (noun form)"],"phonetic":"/ˈɪn.təˌbeɪ.tɪd/","extraExplanation":["在医疗语境里，intubated 常见于新闻或病情通报，含义通常是“已上呼吸机/需要呼吸支持”的严重程度提示，但是否接呼吸机取决于具体情况。","相关常用词：extubate（拔管）、intubation（插管）、ventilator（呼吸机）、ICU（重症监护室）。"]}
{"word":"intubates","summary":{"en":"“Intubates” means “puts a tube into someone’s body,” especially into the trachea to help them breathe.","zh":"“intubates”指“进行插管”，尤指插入气管以帮助呼吸。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to insert a tube into a person’s body, especially into the windpipe (trachea) to help them breathe (often using a ventilator)","zh":"给人体插入导管；尤指将管子插入气管以帮助呼吸（常需接呼吸机）"},"examples":[{"en":"The doctors intubated the patient to keep his airway open.","zh":"医生给病人插管，以保持气道通畅。"},{"en":"She was intubated during surgery and closely monitored afterward.","zh":"她在手术中被插管，术后也被密切监测。"}]}],"synonyms":["tube","insert a breathing tube","place an endotracheal tube"],"phonetic":"/ˈɪn.tuˌbeɪts/","extraExplanation":["“intubates”是动词“intubate”的第三人称单数形式（he/she/it intubates），常见于医疗语境与病历记录。","日常英语中更常听到被动说法：be intubated（被插管）。","相关词：intubation（插管，名词）；extubate（拔管，动词）。"]}
{"word":"intubating","summary":{"en":"“Intubating” means putting a medical tube in someone—usually into the windpipe—to help them breathe or receive anesthesia.","zh":"“intubating”指为病人插入医疗导管，通常是气管插管，用于帮助呼吸或麻醉。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to insert a medical tube into someone’s body (most commonly into the windpipe) to help them breathe, give anesthesia, or protect the airway","zh":"（医疗）将导管插入人体（最常见为插入气管）以帮助呼吸、实施麻醉或保护气道"},"examples":[{"en":"The doctor is intubating the patient to help them breathe.","zh":"医生正在为病人插管以帮助其呼吸。"},{"en":"She was intubating patients in the emergency room all night.","zh":"她整晚都在急诊室为病人插管。"}]}],"synonyms":["placing a breathing tube","tube insertion","airway intubation"],"phonetic":"/ɪnˈtuːbeɪtɪŋ/","extraExplanation":["“intubating”是动词“intubate”的现在分词/动名词形式，常见于医疗语境（如急诊、ICU、麻醉）。","日常英语里更常说“put someone on a breathing tube/put a tube in”来描述同一行为；“intubate”属于更专业、更正式的说法。"]}
{"word":"intubation","summary":{"en":"Intubation is a medical procedure of placing a tube into the airway (or another body passage) to help a person breathe or keep a passage open.","zh":"Intubation 指医疗中的“插管”，最常见为将管子插入气道（气管）以帮助呼吸或保持通道通畅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical procedure where a doctor places a tube into a person’s airway (usually the windpipe) to help them breathe, often using a ventilator.","zh":"（医疗）插管；将管子放入气道（通常是气管）以帮助呼吸，常与呼吸机配合使用。"},"examples":[{"en":"After the accident, the patient needed intubation to keep their airway open.","zh":"事故后，病人需要插管来保持气道通畅。"},{"en":"In severe pneumonia, intubation may be required if oxygen levels stay low.","zh":"在严重肺炎中，如果血氧持续偏低，可能需要进行插管。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of inserting a tube into the body, especially into the airway for breathing support.","zh":"插入管子的行为或过程；尤指为呼吸支持将管子插入气道。"},"examples":[{"en":"The team prepared the equipment before beginning intubation.","zh":"团队在开始插管前准备好了设备。"},{"en":"Proper training is important to perform safe intubation.","zh":"进行安全的插管操作需要良好的培训。"}]}],"synonyms":["airway intubation","endotracheal intubation","tube insertion"],"phonetic":"/ˌɪn.tuːˈbeɪ.ʃən/","extraExplanation":["“Intubation”最常见指“气管插管”（endotracheal intubation）。在新闻或医疗剧里常听到“put on a ventilator（上呼吸机）”，通常意味着先进行插管，再用呼吸机帮助呼吸。","词形上：in-（进入）+ tube（管）+ -ation（名词后缀，表示过程/行为）。常见相关词：intubate（v. 给……插管）、extubation（n. 拔管）。"]}
{"word":"intubationist","summary":{"en":"An intubationist is a clinician who performs airway intubation.","zh":"intubationist 指执行气管插管（气道插管）的临床医护人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical professional (usually a doctor, anesthesiologist, emergency physician, or specially trained clinician) who performs intubation—placing a tube into a patient’s airway to help them breathe or to protect the airway.","zh":"执行气管插管的医疗专业人员（通常是医生、麻醉科/急诊医生或受过专门训练的临床人员），把管子放入患者气道以帮助呼吸或保护气道。"},"examples":[{"en":"The intubationist prepared the equipment before the patient arrived in the emergency room.","zh":"插管操作人员在病人到达急诊室之前就准备好了设备。"},{"en":"In critical care, an experienced intubationist can make the procedure faster and safer.","zh":"在重症监护中，经验丰富的插管操作人员能让操作更快、更安全。"}]}],"synonyms":["airway specialist","anesthesiologist (often)","clinician trained in intubation"],"phonetic":"/ˌɪn.tuˈbeɪ.ʃə.nɪst/","extraExplanation":["“intubationist”在英语中相对少见，临床上更常见的说法包括：\"anesthesiologist\"（麻醉科医生）、\"airway specialist\"（气道专科/气道专家）、\"clinician trained in intubation\"（受过插管训练的临床医护）。不同医院与国家对谁能插管、如何称呼，规范可能不同。","词根帮助记忆：\"intubation\"（插管）来自 \"tube\"（管子）。加上 \"-ist\" 表示“从事某种工作的人”。","语境提示：该词多见于医学写作或讨论团队分工时；在日常对话中，说 \"the doctor intubated the patient\"（医生给病人插管）更自然。"]}
{"word":"intubator","summary":{"en":"An intubator is a person who performs airway intubation; less commonly, it can mean a device used to help intubate.","zh":"intubator 指进行气管插管的人；较少情况下也可指协助插管的器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often a doctor, anesthesiologist, paramedic, or respiratory therapist) who performs intubation—placing a tube into a patient’s airway to help them breathe.","zh":"进行气管插管的人（常见为医生、麻醉科医师、急救人员或呼吸治疗师），即将管子置入患者气道以帮助呼吸。"},"examples":[{"en":"The ER team called the most experienced intubator for the patient with severe breathing trouble.","zh":"急诊团队为严重呼吸困难的患者叫来了最有经验的插管人员。"},{"en":"During surgery, the anesthesiologist acted as the intubator and secured the airway.","zh":"手术中，麻醉科医师负责插管并确保气道通畅。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool or device used to help place an airway tube (less common usage).","zh":"用于协助放置气道管的器械/装置（较少见用法）。"},"examples":[{"en":"In some kits, an intubator may refer to a simple device that helps guide the tube into place.","zh":"在某些器械包里，“intubator”可能指一种帮助引导导管就位的简易装置。"}]}],"synonyms":["airway specialist","anesthesiologist (in many cases)","paramedic (in emergency settings)","clinician who intubates"],"phonetic":"/ˈɪn.tuː.beɪ.tɚ/","extraExplanation":["在临床英语里更常见的说法是“a clinician who intubates / an experienced airway operator”，或直接说“the anesthesiologist intubated the patient”。“intubator”能用，但在论文或正式记录中不一定是最标准的名词。","相关词汇：intubation（气管插管）、intubate（给……插管）、endotracheal tube/ET tube（气管插管管道）、airway（气道）、ventilator（呼吸机）。"]}
{"word":"intubatting","summary":{"en":"“Intubatting” is probably a misspelling of “intubating”: placing a tube into a patient’s airway to help breathing.","zh":"“intubatting”很可能是“intubating”的拼写错误：给病人插管（多指气管插管）以帮助呼吸。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Likely a misspelling of “intubating” (from the verb “intubate”): putting a tube into someone’s airway (or another body passage), especially to help them breathe during emergency care or surgery.","zh":"很可能是“intubating”（动词“intubate”的现在分词）的拼写错误：把管子插入人的气道（或其他体内通道），尤其用于急救或手术中帮助呼吸。"},"examples":[{"en":"The doctor is intubating the patient to help them breathe.","zh":"医生正在给病人插管，以帮助他们呼吸。"},{"en":"The team practiced intubating on a training mannequin.","zh":"团队在训练用的人体模型上练习插管。"}]}],"synonyms":["intubation","insert a tube","place a breathing tube"],"phonetic":"/ˈɪn.tuˌbeɪ.tɪŋ/","extraExplanation":["“Intubate / intubating”是医学语境里很常见的词，日常对话中不常用。通常指“气管插管”（endotracheal intubation），与麻醉、急救、重症监护（ICU）等场景相关。","如果你想表达名词“插管这个过程/措施”，更常用“intubation”（气管插管/插管）。"]}
{"word":"intube","summary":{"en":"“Intube” means to insert a tube into the body, especially the airway, for medical care (often expressed as “intubate” in modern English).","zh":"“intube”指把导管插入人体（尤指气道）用于医疗处理；现代英语中更常用“intubate”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to insert a tube into a person’s body (especially into the airway) for breathing support or medical treatment; similar to “intubate.”","zh":"把导管插入人体（尤其是插入气道）以帮助呼吸或进行治疗；类似于“intubate（插管）”。"},"examples":[{"en":"The doctor had to intube the patient to help them breathe.","zh":"医生不得不给病人插管，帮助他们呼吸。"},{"en":"In severe cases, patients may be intubed and placed on a ventilator.","zh":"在严重情况下，病人可能会被插管并使用呼吸机。"}]}],"synonyms":["intubate","tube (a patient)"],"phonetic":"/ɪnˈtub/","extraExplanation":["“intube”在日常英语里不算常见，更常用的医学表达是“intubate”（动词）和“intubation”（名词）。新闻或医疗场景中常说“be intubated”。","常见搭配：intubate a patient（给病人插管），endotracheal intubation（气管插管），a breathing tube（呼吸管）。"]}
{"word":"intue","summary":{"en":"Intuit means to sense or understand something instinctively, without conscious reasoning.","zh":"Intuit 指“不经推理而凭直觉领会/感觉到”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to know or understand something quickly and without needing to consciously reason it out; to sense something instinctively","zh":"不经明确推理就迅速理解或知道；凭直觉感觉到"},"examples":[{"en":"I intuited that something was wrong from his tone of voice.","zh":"我从他的语气中直觉到事情不对。"},{"en":"She intuited what the customer wanted before he finished speaking.","zh":"她在顾客还没说完前就直觉明白他想要什么。"}]}],"synonyms":["sense","perceive","infer","gather"],"phonetic":"/ɪnˈtuːɪt/","extraExplanation":["“intue”不是标准英语拼写；你可能想写的是“intuit”。","词根来自拉丁语 intuērī，意思是“凝视、注视、看进去”，后来引申为“凭直觉看出/领会”。","常见搭配：intuit that…（直觉到……）、intuitively（凭直觉地）。相关词：intuition（直觉，名词）。"]}
{"word":"intuent","summary":{"en":"“Intuit” means to understand or know something instinctively, without conscious reasoning.","zh":"“Intuit”指不经过刻意思考，凭直觉理解或知道某事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to know or understand something based on instinct or a feeling rather than deliberate reasoning or direct evidence","zh":"凭直觉（而非严密推理或直接证据）知道或理解某事"},"examples":[{"en":"I intuited that she was upset even before she said anything.","zh":"她还没开口，我就凭直觉感觉到她不开心。"},{"en":"From his tone, I intuited that the meeting would be difficult.","zh":"从他的语气里，我直觉到这次会议会很棘手。"}]}],"synonyms":["sense","feel","guess","infer","perceive"],"phonetic":"/ɪnˈtuːɪt/","extraExplanation":["“intuent”在英语里不常见，通常是拼写错误；你可能想查的是 **intuit**（动词：凭直觉理解）或 **intuition**（名词：直觉）。","词源上与拉丁语 *intueri*（意为“注视、观照”）有关，因此有“直接看出来/一下子领会”的感觉。日常使用中，**intuit** 比较书面，口语里更常说 **sense**、**have a feeling**。"]}
{"word":"intuicity","summary":{"en":"Intuicity means the quality of being intuitive—grasping things quickly without conscious reasoning.","zh":"Intuicity 指“直觉性”，即不经刻意思考就能迅速领会或判断的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being intuitive; understanding or deciding something quickly without conscious reasoning","zh":"直觉性；不经刻意思考而迅速理解或判断的特质"},"examples":[{"en":"Good design has a kind of intuiticity—you know how to use it right away.","zh":"好的设计有一种直觉性——你马上就知道怎么用。"},{"en":"Her intuiticity helped her sense that something was wrong.","zh":"她的直觉性帮助她感觉到事情不对劲。"}]}],"synonyms":["intuition","intuitiveness","instinct","gut feeling"],"phonetic":"/ˌɪn.tuˈɪs.ə.ti/","extraExplanation":["“intuicity”在现代英语里比较少见，更常见、自然的说法是“intuition”（直觉）、“intuitiveness”（直观/直觉性）或“intuitive nature”（直觉的特质）。如果你在写作或正式场合使用，通常建议用这些更常用的词，以避免读者觉得生僻或像是临时造词。","构词上可理解为“intuition（直觉）+ -icity（表示‘性质/状态’）”，类似于“electricity（电）/ authenticity（真实性）”这种名词化结尾。"]}
{"word":"intuit","summary":{"en":"“Intuit” means to understand or know something immediately by instinct, without conscious reasoning.","zh":"“intuit”指不经推理而凭直觉立刻理解或知道某事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to know or understand something immediately, without needing conscious reasoning or evidence; to sense it by instinct.","zh":"不经推理或证据就立刻知道或理解；凭直觉感觉到。"},"examples":[{"en":"I intuited that something was wrong the moment I walked in.","zh":"我一走进去就直觉到有些不对劲。"},{"en":"She intuited his hesitation even though he smiled.","zh":"尽管他在笑，她还是直觉到他的犹豫。"},{"en":"With experience, you can intuit what a customer needs.","zh":"有了经验，你就能直觉判断顾客需要什么。"}]}],"synonyms":["sense","feel","perceive","infer","guess","have a hunch"],"phonetic":"/ɪnˈtuːɪt/","extraExplanation":["“intuit”常用于比较正式或书面语，意思接近“凭直觉领会/洞察”。日常口语里更常说“sense”“feel”“have a hunch”。","词源来自拉丁语 *intueri*（意为“凝视、审视”），引申为“内在地看见、直接领会”。因此它常带有“洞察”或“心里早就明白”的语感。","注意搭配：常见结构是“intuit that + 从句”（如：intuit that he was lying）或“intuit + 名词”（如：intuit the truth）。"]}
{"word":"intuitable","summary":{"en":"Intuitable means “able to be understood or known by intuition,” and it’s a less common, more academic alternative to “intuitive.”","zh":"Intuitable 指“可凭直觉理解或认识的”，较少见，更偏学术语境，可视为比 intuitive 更强调“可被直觉把握”的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be known or understood by intuition rather than by careful reasoning or proof.","zh":"可凭直觉认识或理解的（不必经过严密推理或证明）。"},"examples":[{"en":"Some patterns are intuitable once you have enough experience.","zh":"有了足够经验后，有些规律是可以凭直觉把握的。"},{"en":"Her decision felt intuitable, even if she couldn’t explain it logically.","zh":"她的决定似乎凭直觉就能理解，尽管她无法用逻辑解释。"}]},{"partOfSpeech":"adj.","definition":{"en":"Obvious or easy to grasp in an intuitive way; immediately “makes sense” to many people.","zh":"直观易懂的；让人一看就“觉得有道理”的。"},"examples":[{"en":"The new app design is more intuitable for first-time users.","zh":"这款应用的新设计对首次使用者更直观易懂。"},{"en":"A good metaphor can make a difficult idea intuitable.","zh":"一个好的比喻能让难懂的概念变得更直观。"}]}],"synonyms":["intuitive","instinctive","self-evident","easily grasped"],"phonetic":"/ɪnˈtuːɪtəbəl/","extraExplanation":["“intuitable”在日常英语里相对少见，更常见的表达是“intuitive（直觉的/直观的）”或“can be intuited（可以凭直觉得出）”。例如：This can be intuited from experience.（这可以从经验中凭直觉得出。）","词形来源：intuition（直觉）→ intu-it（凭直觉知道）+ -able（可……的）。在学术写作（哲学、数学、认知科学）中更可能见到，用来强调“可被直觉把握”，而不一定是“正确/被证明的”。"]}
{"word":"intuited","summary":{"en":"“Intuited” means “understood or sensed by intuition,” the past form of “intuit.”","zh":"“intuited”表示“凭直觉理解/察觉”，是“intuit”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “intuit”: to understand or know something immediately without deliberate reasoning (by intuition).","zh":"“intuit”的过去式/过去分词：凭直觉立刻理解或知道某事，而不是经过详细推理。"},"examples":[{"en":"She intuited that something was wrong before anyone said a word.","zh":"在任何人开口之前，她就凭直觉感觉到出了问题。"},{"en":"From his tone, I intuited he didn’t want to continue the conversation.","zh":"从他的语气里，我直觉判断他不想继续谈下去。"},{"en":"The detective intuited the motive, even without clear evidence yet.","zh":"即使还没有明确证据，侦探也直觉推断出了动机。"}]}],"synonyms":["sensed","felt","perceived","gathered","inferred (informal/loose)"],"phonetic":"/ɪnˈtuːɪtɪd/","extraExplanation":["“intuit/intuited”常用于表达一种“未经完整推理、但很快抓到要点”的理解；语气通常比“guess(猜)”更有把握一些，但又不如“know(知道)”那么确定。","词源上与“intuition（直觉）”同源，来自拉丁语，含义与“看进去/洞察”相关。"]}
{"word":"intuiting","summary":{"en":"“Intuiting” means sensing or understanding something directly by intuition, without conscious reasoning; it’s the -ing form of “intuit.”","zh":"“Intuiting”指凭直觉直接觉察或理解某事，是“intuit”的 -ing 形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to understand or sense something directly, without needing conscious reasoning or clear evidence; to “feel” what is true","zh":"凭直觉理解或觉察某事；不经明确推理或证据就“感觉到”什么是真的"},"examples":[{"en":"She was intuiting that something was wrong, even before anyone spoke.","zh":"在任何人开口之前，她就凭直觉感觉到有些不对劲。"},{"en":"Good teachers are often intuiting what a student needs next.","zh":"优秀的老师常常能凭直觉把握学生下一步需要什么。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common, more formal) to grasp the meaning or pattern of something quickly and accurately","zh":"（较少见、较正式）迅速而准确地领会某事的含义或规律"},"examples":[{"en":"After a few sessions, he was intuiting the logic behind the new system.","zh":"学了几次之后，他就迅速领会了新系统背后的逻辑。"}]}],"synonyms":["sensing","feeling","perceiving","picking up on","reading","guessing (informal)"],"phonetic":"/ɪnˈtuːɪtɪŋ/","extraExplanation":["“intuiting”是动词“intuit”的现在分词/动名词形式，常用于进行时（is intuiting）或作名词性用法（Intuiting can be hard to explain）。","在日常英语里，人们更常说“have a feeling (that)...”“sense (that)...”或“intuition”，而“intuit”本身偏书面、学术或正式表达。","词源上与“intuition（直觉）”同源，来自拉丁语中表示“看、凝视”的词根，因此常带有“直接看出/直接洞察”的语感。"]}
{"word":"intuition","summary":{"en":"Intuition is immediate understanding or a gut feeling—knowing without conscious reasoning.","zh":"Intuition 指“直觉/第六感”，是不经有意识推理就产生的立刻理解或判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability to understand or know something immediately, without needing to consciously reason it out; a “gut feeling.”","zh":"直觉：不经过有意识的推理就立刻理解或知道某事的能力；一种“第六感/凭感觉”。"},"examples":[{"en":"My intuition told me something was wrong, so I double-checked the numbers.","zh":"我的直觉告诉我哪里不对，所以我又把数字核对了一遍。"},{"en":"She trusted her intuition and chose the smaller company, which later grew quickly.","zh":"她相信自己的直觉，选择了那家较小的公司，后来它增长很快。"}]},{"partOfSpeech":"n.","definition":{"en":"An idea or understanding that comes from that immediate feeling rather than from step-by-step thinking.","zh":"由直觉产生的想法/领悟：不是通过一步步思考得出的理解。"},"examples":[{"en":"His intuition about the character’s motives makes the story feel believable.","zh":"他对人物动机的直觉让故事显得可信。"}]}],"synonyms":["gut feeling","instinct","hunch","sixth sense","insight"],"phonetic":"/ˌɪn.tuˈɪʃ.ən/","extraExplanation":["“Intuition” 常与 “logic（逻辑）/reasoning（推理）” 对比使用：直觉不等于乱猜，而是可能来自经验的快速总结；但它也可能受偏见影响，所以在重要决定上常见搭配是 “trust your intuition, but verify”（相信直觉，但要验证）。","常见搭配：intuition about（对……的直觉/直观判断）；rely on/trust your intuition（依靠/相信直觉）；intuitive（adj. 直觉的；易懂的）。"]}
{"word":"intuition-based","summary":{"en":"guided by gut feeling rather than analysis or data","zh":"凭直觉而非分析或数据来判断"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using intuition (a “gut feeling”) rather than formal analysis, strict rules, or detailed data.","zh":"以直觉（“凭感觉”）为依据的，而不是依靠严格分析、固定规则或大量数据。"},"examples":[{"en":"The manager made an intuition-based decision after meeting the candidate in person.","zh":"经理在当面见过候选人后，做出了一个基于直觉的决定。"},{"en":"In the early stage, our product design was intuition-based, not data-driven.","zh":"在早期阶段，我们的产品设计更多是凭直觉，而不是数据驱动。"},{"en":"Intuition-based judgments can be fast, but they may miss hidden risks.","zh":"基于直觉的判断可能很快，但也可能忽略隐藏风险。"}]}],"synonyms":["instinctive","gut-driven","intuitive","non-analytical"],"phonetic":"/ˌɪn.tuˈɪʃ.ən beɪst/","extraExplanation":["常见对比表达：intuition-based（凭直觉） vs. data-based / evidence-based（基于数据/证据） vs. rule-based（基于规则）。在职场写作中，用它描述“决策方式/判断方式”，语气通常中性，但在强调科学性场合可能暗示“缺少数据支持”。"],"etymology":"由 intuition（直觉，来自拉丁语 intuēri“凝视、直观地看”）+ based（以……为基础）构成的复合形容词；常用连字符表示“以……为依据”。","mnemonic":["把它拆开记：intuition = 直觉；based = 基于……。合起来就是“基于直觉”。","联想中文：凭“直觉”做决定——“感觉对了就上”。"]}
{"word":"intuitional","summary":{"en":"“Intuitional” means based on intuition or relating to intuition; it’s a less common, more formal alternative to “intuitive.”","zh":"“intuitional”意为“凭直觉的/与直觉相关的”，较少用、较正式，日常更常用“intuitive”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Based on intuition; understood or decided by a quick feeling rather than by careful reasoning or proof.","zh":"凭直觉的；基于直觉理解或判断的（不是通过严密推理或证据）。"},"examples":[{"en":"Her intuitional sense told her something was wrong.","zh":"她的直觉告诉她有些不对劲。"},{"en":"Some artists make intuitional choices about color and shape.","zh":"有些艺术家在颜色和形状上会做出直觉式的选择。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to intuition as a mental ability (often used in academic or philosophical writing).","zh":"与“直觉”这种心理能力有关的（常见于学术或哲学语境）。"},"examples":[{"en":"The paper discusses intuitional knowledge and logical argument.","zh":"这篇论文讨论了直觉性知识与逻辑论证。"},{"en":"In philosophy, some truths are treated as intuitional rather than inferred.","zh":"在哲学中，有些真理被视为直觉性的，而非推导得出。"}]}],"synonyms":["intuitive","instinctive","gut-level","nonrational"],"phonetic":"/ˌɪn.tuˈɪʃ.ən.əl/","extraExplanation":["“intuitional”不如“intuitive”常见；日常英语里更自然的说法通常是 intuitive（直觉的、直观的）或 instinctive（本能的）。例如：an intuitive decision / an instinctive reaction。","词形提示：intuition（n. 直觉）→ intuitional / intuitive（adj. 直觉的）。如果你是在写论文或偏正式的文字，intuitional 可能出现得更多。"]}
{"word":"intuitionalism","summary":{"en":"Intuitionalism is the view that intuition can directly give us certain knowledge, especially in ethics or mathematics.","zh":"直觉主义指认为直觉能直接带来某些知识，常用于伦理学或数学哲学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief that some knowledge—especially in morality or mathematics—can be known directly by intuition (an immediate sense or insight), not only by reasoning or observation.","zh":"直觉主义：认为某些知识——尤其是道德或数学领域的知识——可以通过直觉（直接的领悟或洞见）获得，而不必完全依赖推理或观察。"},"examples":[{"en":"In ethics, intuitionalism says we can recognize some moral truths immediately, such as that cruelty is wrong.","zh":"在伦理学中，直觉主义认为我们能立刻识别某些道德真理，比如“残忍是错误的”。"},{"en":"She defended intuitionalism, arguing that our basic moral judgments do not always come from careful calculation.","zh":"她为直觉主义辩护，认为我们的基本道德判断并不总是来自精密的计算。"}]},{"partOfSpeech":"n.","definition":{"en":"A view in the philosophy of mathematics that emphasizes intuition as central to understanding mathematical truth and meaning (often contrasted with formalism).","zh":"（数学哲学）直觉主义：强调直觉在理解数学真理与意义中具有核心地位的观点（常与“形式主义”相对）。"},"examples":[{"en":"Intuitionalism in mathematics questions whether every statement is either true or false in the classical sense.","zh":"数学中的直觉主义会质疑：是否每个命题都能以经典方式判定为“非真即假”。"},{"en":"The course compared formalism, logicism, and intuitionalism as different foundations for mathematics.","zh":"这门课比较了形式主义、逻辑主义与直觉主义，作为数学不同的基础观。"}]}],"synonyms":["intuitionism","moral intuitionism"],"phonetic":"/ˌɪn.tuˈɪʃ.ə.nəlˌɪz.əm/","extraExplanation":["在英语学术语境里，intuitionalism 常见于两大领域：伦理学（moral intuitionalism）和数学哲学（intuitionism）。有时日常写作里也会把它泛指“重直觉的观点”，但正式讨论时通常会说明具体领域。","词形提示：intuition（直觉）+ -al（形容词后缀）+ -ism（主义/学说）。相关词包括 intuitive（直觉的）、intuitionist（直觉主义者）。"]}
{"word":"intuitionalist","summary":{"en":"An intuitionalist is someone who believes intuition can give direct knowledge or self-evident truths, especially in philosophy/ethics or in the mathematical school of intuitionism.","zh":"intuitionalist 指直觉主义者：相信直觉能直接提供知识或不证自明的真理，常见于哲学/伦理学语境，也可指数学直觉主义学派的支持者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that some knowledge or truths are known directly through intuition (an immediate “inner sense”) rather than through reasoning, observation, or formal proof.","zh":"直觉主义者：相信某些知识或真理可以通过直觉（直接的“内在感受”）获得，而不主要依赖推理、观察或形式证明的人。"},"examples":[{"en":"As an intuitionalist, she trusts her gut feeling when making quick decisions.","zh":"作为直觉主义者，她在需要快速决策时更相信自己的直觉。"},{"en":"The debate was between empiricists who wanted evidence and intuitionalists who emphasized inner certainty.","zh":"这场辩论发生在主张证据的经验主义者与强调内在确定性的直觉主义者之间。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy or ethics, someone who holds that certain moral principles are self-evident and can be grasped intuitively.","zh":"（哲学/伦理学）认为某些道德原则是不证自明、可由直觉直接把握的人。"},"examples":[{"en":"Some intuitionalists argue that we immediately recognize cruelty as wrong.","zh":"一些直觉主义者认为，我们会立刻直观地意识到残忍是错误的。"},{"en":"In her essay, he criticizes the intuitionalist view as too subjective.","zh":"在文章中，他批评直觉主义观点过于主观。"}]},{"partOfSpeech":"n.","definition":{"en":"In mathematics (especially the foundations of math), a supporter of intuitionism: the view that math objects are constructed by the mind and that some classical proof methods (like certain uses of the law of excluded middle) are not always accepted.","zh":"（数学，尤指数学基础）直觉主义（intuitionism）的支持者：认为数学对象由心智建构，并且不总是接受某些经典证明方法（如对“排中律”的某些使用）。"},"examples":[{"en":"An intuitionalist may reject a proof that relies on the law of excluded middle in certain contexts.","zh":"在某些语境下，直觉主义者可能会拒绝依赖排中律的证明。"},{"en":"Intuitionalists influenced constructive approaches to mathematics and logic.","zh":"直觉主义者影响了数学与逻辑中的构造性方法。"}]}],"synonyms":["intuitionist","believer in intuition","moral intuitionist","constructivist (math context)"],"phonetic":"/ˌɪn.tuˈɪʃ.ə.nə.lɪst/","extraExplanation":["“intuitionalist”常见于学术语境，尤其是哲学（认识论、伦理学）与数学基础。日常生活里更常用的词是“intuitive person（直觉型的人）”。","词形上：intuition（直觉）+ -al（……的）+ -ist（……主义者/信奉者）。在数学里与荷兰数学家L.E.J. Brouwer（布劳威尔）的“intuitionism（直觉主义）”有关。"]}
{"word":"intuitionally","summary":{"en":"“Intuitionally” means “based on intuition”; in everyday English, “intuitively” is more common.","zh":"“intuitionally”意为“凭直觉地”；日常英语中更常用“intuitively”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is based on intuition (a quick understanding or feeling rather than step-by-step reasoning).","zh":"凭直觉地；基于直觉地（不是靠一步步推理，而是靠一种迅速的理解或感觉）。"},"examples":[{"en":"She intuitively knew something was wrong, even before anyone said a word.","zh":"她凭直觉就知道出事了，甚至在没人开口之前。"},{"en":"Good teachers often intuitively sense when students are confused.","zh":"优秀的老师常常能凭直觉察觉学生什么时候困惑。"}]}],"synonyms":["intuitively","instinctively","by intuition"],"phonetic":"/ˌɪn.tuˈɪʃ.ə.nəl.i/","extraExplanation":["“Intuitionally”意思正确，但在日常英语里更常用的是“intuitively”。在写作和口语中，用“intuitively”会更自然、更常见。","词形提示：intuition（直觉，名词）→ intuitive（凭直觉的，形容词）→ intuitively / intuitionally（凭直觉地，副词）。","语体差异：在学术或较正式的语境里偶尔会看到“intuitionally”（如哲学、心理学讨论），但频率仍低于“intuitively”。"]}
{"word":"intuitionism","summary":{"en":"Intuitionism is a philosophy claiming some truths are known directly by intuition; in math it refers to Brouwer’s view emphasizing constructive proofs and often rejecting the law of excluded middle in some cases.","zh":"直觉主义是一种认为某些真理可由直觉直接认识的哲学观点；在数学中常指布劳威尔的学说，强调构造性证明，并在某些情形下不接受排中律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophy (especially in mathematics and ethics) that says some truths are known directly by intuition rather than proved by logic or learned from experience.","zh":"（尤指数学与伦理学中的）直觉主义：认为某些真理可以通过直觉直接把握，而不是靠逻辑证明或经验学习得来的一种哲学观点。"},"examples":[{"en":"In ethics, intuitionism says we can recognize some moral truths immediately, without needing a long argument.","zh":"在伦理学中，直觉主义认为我们能立刻辨认出某些道德真理，而不必依赖冗长的论证。"},{"en":"Mathematical intuitionism rejects some proof methods that treat infinity as a completed object.","zh":"数学直觉主义拒绝某些把“无限”当作已完成对象来处理的证明方法。"}]},{"partOfSpeech":"n.","definition":{"en":"More specifically, a movement in the philosophy of mathematics (linked to L. E. J. Brouwer) that treats mathematics as a human mental construction and often does not accept the law of excluded middle in all cases.","zh":"更具体地说：数学哲学中的一个流派（常与布劳威尔 L. E. J. Brouwer 相关），把数学看作人类心智的建构，并且在某些情形下不接受“排中律”。"},"examples":[{"en":"Brouwer’s intuitionism influenced later work in constructive mathematics and logic.","zh":"布劳威尔的直觉主义影响了后来的构造性数学与逻辑研究。"},{"en":"From an intuitionist viewpoint, proving “either P or not P” may require a constructive method, not just a classical argument.","zh":"从直觉主义的观点看，要证明“要么P，要么非P”，可能需要构造性的方法，而不只是经典论证。"}]}],"synonyms":["intuitionist philosophy","constructivism (math, related)","ethical intuitionism (ethics, related)"],"phonetic":"/ˌɪn.tuˈɪʃ.ənˌɪz.əm/","extraExplanation":["“Intuitionism”常见于两大语境：\n1）伦理学：认为某些“善/恶”“对/错”的判断是自明的（self-evident），人们可直接直觉把握。\n2）数学：强调“构造性”（constructive）证明，倾向于只承认能被明确构造或给出方法的数学对象与存在性结论。","词形提示：intuition（直觉）+ -ism（主义/学说）。在学术写作中它通常是不可数名词（uncountable），但也可在讨论不同学派时用复数“intuitionisms”。"]}
{"word":"intuitionist","summary":{"en":"An intuitionist is someone who believes intuition can lead to knowledge; in math/philosophy it also means a supporter of the intuitionism school.","zh":"intuitionist 指相信直觉能带来知识的人；在数学/哲学中也指直觉主义学派的支持者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that some knowledge or truth can be understood directly through intuition (an inner sense), not only through logical reasoning or evidence","zh":"直觉主义者：相信有些知识或真理可以通过直觉（内在感知）直接把握，而不只依靠逻辑推理或证据的人"},"examples":[{"en":"As an intuitionist, she often trusts her gut feeling when making quick decisions.","zh":"作为直觉主义者，她在做快速决定时常常相信自己的直觉。"},{"en":"The debate contrasted empiricists, who rely on evidence, with intuitionists, who emphasize inner knowledge.","zh":"这场辩论对比了依靠证据的经验主义者与强调内在认知的直觉主义者。"}]},{"partOfSpeech":"n.","definition":{"en":"(in philosophy and mathematics) a supporter of intuitionism, a view that stresses mental constructions and rejects certain kinds of “proof by contradiction” as establishing existence","zh":"（哲学与数学）直觉主义的支持者：强调“心智建构”，并不接受某些“反证法”能证明“存在性”的立场拥护者"},"examples":[{"en":"Some intuitionists do not accept a proof that shows something must exist without constructing it explicitly.","zh":"一些直觉主义者不接受那种只证明“必然存在”却没有明确构造出来的证明。"},{"en":"In class we compared classical logic with intuitionist approaches to mathematical proof.","zh":"课堂上我们比较了经典逻辑与直觉主义的数学证明方法。"}]}],"synonyms":["intuition-based thinker","intuition advocate","intuitionism supporter"],"phonetic":"/ˌɪn.tuˈɪʃ.ə.nɪst/","extraExplanation":["这个词常见于学术语境：日常英语里更常说“someone who relies on intuition（依赖直觉的人）”。“intuitionist”更像一个立场标签，带有“主义/学派”的意味。","文学提示：Colson Whitehead 的小说《The Intuitionist》使用了“intuitionist”这一概念来讨论直觉、权力与制度等主题（此处为文化背景提示，不要求读者了解数学直觉主义）。"]}
{"word":"intuitionistic","summary":{"en":"“Intuitionistic” means relating to intuitionism in math/logic, emphasizing constructive proof rather than assuming all classical logical principles.","zh":"“intuitionistic”指数学/逻辑中的直觉主义，强调构造性证明，而非无条件采用所有经典逻辑原则。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mathematics/logic) Relating to intuitionism: a view that mathematical truth is based on what can be mentally constructed or proven, so some forms of “proof by contradiction” are not accepted as general methods.","zh":"（数学/逻辑）直觉主义的；与直觉主义有关：认为数学真理建立在可被心智构造或证明的基础上，因此不把某些“反证法/归谬法”当作普遍可用的证明方法。"},"examples":[{"en":"In intuitionistic logic, you cannot always conclude that either a statement or its negation must be true.","zh":"在直觉主义逻辑中，你不能总是断定“一个命题或它的否定”必有一个为真。"},{"en":"The paper compares classical and intuitionistic proofs of the same theorem.","zh":"这篇论文比较了同一条定理的经典证明与直觉主义证明。"}]}],"synonyms":["intuitionist (in some contexts)","constructive (often related)"],"phonetic":"/ˌɪn.tuː.ɪˈʃə.nɪs.tɪk/","extraExplanation":["“intuitionistic”常见于两个搭配：intuitionistic logic（直觉主义逻辑）与 intuitionistic mathematics（直觉主义数学）。它与“intuitive（直觉的）”不同：intuitive 更偏日常语感；intuitionistic 是严格的学术术语。","直觉主义传统上与数学家 L.E.J. Brouwer（布劳威尔）相关；其核心影响之一是：不把“排中律”（对任意命题 P，都有 P∨¬P）视为无条件成立，因此很多经典逻辑中的推理在直觉主义体系里需要更谨慎的证明方式。","在计算机科学里，直觉主义逻辑与类型论、构造性证明关系密切：证明往往对应可构造的对象或算法，因此你会在证明助理（proof assistants）或程序语言理论中看到这个词。"]}
{"word":"intuitionless","summary":{"en":"Intuitionless means “without intuition,” often suggesting a rigid or overly mechanical way of thinking.","zh":"intuitionless 意为“缺乏直觉的”，常暗示思考方式刻板或过于机械。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking intuition; not guided by instinctive understanding or a “gut feeling.”","zh":"缺乏直觉的；不凭直观判断或“第六感”来理解或决定的。"},"examples":[{"en":"His intuitionless approach relied only on checklists and rules.","zh":"他那种缺乏直觉的做法只依靠清单和规则。"},{"en":"The plan felt intuitionless, as if no one considered how people would actually behave.","zh":"这个计划让人觉得缺乏直觉，好像没人考虑人们实际会怎么做。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More critical tone) Overly mechanical or rigid; showing little sensitivity, insight, or human judgment.","zh":"（较批评的语气）过于机械或刻板的；缺少敏感度、洞察力或人情判断的。"},"examples":[{"en":"The feedback was efficient but intuitionless, missing the emotions behind the issue.","zh":"这份反馈很高效，但显得缺乏直觉，没有看到问题背后的情绪。"},{"en":"An intuitionless manager may follow policy perfectly yet still lose the team’s trust.","zh":"一个缺乏直觉的经理可能完全按制度办事，却仍会失去团队的信任。"}]}],"synonyms":["not intuitive","lacking intuition","without intuition","mechanical","rigid"],"phonetic":"/ˌɪn.tuˈɪʃən.ləs/","extraExplanation":["“intuitionless”= intuition（直觉）+ -less（没有……的）。英语里 -less 常用来构成形容词，如 homeless（无家可归的）、careless（粗心的）、endless（无尽的）。","这个词在日常英语中不算常见；更常见的表达有 “lacking intuition / not intuitive / without intuition”。“intuitionless”往往带一点批评意味，强调“太死板、不够会读懂人或情境”。"]}
{"word":"intuitions","summary":{"en":"“Intuitions” means more than one intuition: immediate understanding or gut judgments without deliberate reasoning.","zh":"“intuitions”是“intuition”的复数，指多个直觉：不经推理的即时理解或本能判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Immediate understanding or a feeling about something without conscious reasoning.","zh":"直觉；不经推理就产生的理解或感觉。"},"examples":[{"en":"I had an intuition that something was wrong.","zh":"我直觉觉得哪里不对。"},{"en":"Her intuitions about people are usually accurate.","zh":"她对人的直觉通常很准。"},{"en":"Trust your intuition when the facts are unclear.","zh":"当事实不清楚时，相信你的直觉。"}]},{"partOfSpeech":"n.","definition":{"en":"Basic beliefs or gut feelings that guide how someone thinks or decides (often used in plural: intuitions).","zh":"（常用复数）直觉判断；影响思考或决策的本能看法。"},"examples":[{"en":"Our intuitions about fairness shape the way we see the law.","zh":"我们对公平的直觉判断会影响我们看待法律的方式。"},{"en":"People may have different intuitions about what is polite.","zh":"人们对什么算礼貌可能有不同的直觉判断。"}]}],"synonyms":["hunches","gut feelings","instincts","impressions"],"phonetic":"/ˌɪn.tuˈɪʃ.ənz/","extraExplanation":["“Intuitions”是“intuition”的复数，常用于谈“多种直觉判断/直觉想法”，尤其在心理学、伦理学、日常讨论中很常见。","常见搭配：have an intuition that…（直觉觉得……）；trust/follow your intuition（相信/听从直觉）；gut intuition/feeling（本能直觉/感觉）。","注意区分：intuition（直觉）≠ instinct（本能，偏生物反应）≠ insight（洞见，常指深入理解后的灵光一现）。"]}
{"word":"intuitive","summary":{"en":"Intuitive means understanding something quickly without deliberate reasoning, or (for design) being easy to use naturally.","zh":"Intuitive 指“凭直觉就能理解/判断”，也可指（设计）“直观易用、容易上手”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to understand or know something quickly without needing conscious reasoning; based on feelings or immediate understanding.","zh":"直觉的；不需刻意思考就能迅速理解或知道的；基于直觉或当下的理解。"},"examples":[{"en":"She has an intuitive sense of what her students need.","zh":"她对学生需要什么有一种直觉性的把握。"},{"en":"The new app is intuitive—you can use it without reading instructions.","zh":"这款新应用很直观，你不用看说明也会用。"},{"en":"He made an intuitive decision and turned out to be right.","zh":"他凭直觉做了决定，结果证明是对的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a design or system) Easy to understand and use naturally; user-friendly and clear.","zh":"（指设计/系统）直观易用的；符合使用习惯、容易上手的。"},"examples":[{"en":"The website layout is clean and intuitive.","zh":"这个网站的布局干净而直观。"},{"en":"Good maps are intuitive: you instantly see where you are.","zh":"好的地图很直观：你一眼就能看出自己在哪。"}]}],"synonyms":["instinctive","insightful","perceptive","natural","user-friendly (for design)"],"phonetic":"/ɪnˈtuːɪtɪv/","extraExplanation":["“intuitive”常有两种常见用法：一是形容人“凭直觉就懂/就会”，二是形容产品或界面“直观、好上手”。中文里第一个更接近“直觉的”，第二个更接近“直观的/易用的”。","词源来自拉丁语 intuērī（“注视、洞察”），因此它强调一种“直接看出来/直接领会”的感觉，而不是一步步推理。","在文学与日常表达中，常见搭配有：intuitive sense（直觉感）、intuitive understanding（直觉理解）、intuitive grasp（直觉把握）、intuitive interface/design（直观界面/设计）。"]}
{"word":"intuitive-eating","summary":{"en":"Eating guided by internal hunger and fullness cues rather than diet rules.","zh":"以身体的饥饿与饱足感为依据、而非节食规则来进食。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A way of eating that focuses on listening to your body’s hunger, fullness, and satisfaction signals rather than following strict diet rules.","zh":"一种进食方式，强调倾听身体的饥饿、饱足与满足感信号，而不是遵循严格的节食规则。"},"examples":[{"en":"She started intuitive eating to stop obsessing over calories and feel more at peace with food.","zh":"她开始练习直觉饮食，以停止对热量的过度执着，并与食物更和平地相处。"},{"en":"With intuitive eating, he checks in with his hunger level before getting seconds.","zh":"实行直觉饮食时，他会在添第二份前先确认自己的饥饿程度。"},{"en":"Many people pair intuitive eating with gentle nutrition and mental health support.","zh":"很多人会把直觉饮食与温和营养原则以及心理健康支持结合起来。"}]}],"synonyms":["mindful eating","non-diet approach","eat by hunger cues","attuned eating"],"phonetic":"ɪnˈtuːɪtɪv ˈiːtɪŋ","extraExplanation":["语境提示：它常出现在营养学、心理健康与身体意象（body image）讨论中。核心思想通常包括：尊重饥饿与饱足信号、减少食物“好/坏”的道德化标签、把健康目标从“控制体重”转向“照顾身心”。","用法提示：英语里常说 “practice intuitive eating”（练习直觉饮食）或 “an intuitive-eating approach”（直觉饮食取向）。有时也写作 intuitive eating（不加连字符）；加连字符更多用于作定语时（e.g., intuitive-eating coach）。"],"etymology":"“Intuitive eating”直译为“直觉饮食”，由形容词 intuitive（凭直觉的）+ eating（进食）组成。作为健康与营养领域的术语，1990年代因相关著作与倡议而广泛传播，用来对比“节食文化（diet culture）”中的外部规则式饮食。","mnemonic":["拆分记忆：in- + tuit（可联想“推断/直觉”）+ -ive（形容词后缀）→ intuitive=“凭直觉的”；intuitive + eating=“跟着身体感觉吃”。","联想中文：把它当作“听身体的话吃饭”，饿了吃、饱了停、吃得舒服最重要。"]}
{"word":"intuitively","summary":{"en":"“Intuitively” means “by intuition”—in a way that feels naturally understandable without detailed reasoning.","zh":"“intuitively”意为“凭直觉地”，指不用细致推理就自然觉得明白或判断为真的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that feels natural to understand without needing to think carefully or use formal rules; by instinct.","zh":"凭直觉地；不用仔细推理或正式规则就觉得自然明白地。"},"examples":[{"en":"Intuitively, you can tell which button turns the light on.","zh":"凭直觉你就能分辨哪个按钮是开灯的。"},{"en":"She intuitively understood what he meant, even before he explained.","zh":"她还没等他解释就直觉地明白了他的意思。"},{"en":"The design is intuitively easy to use.","zh":"这个设计用起来直觉上就很顺手（很容易上手）。"}]},{"partOfSpeech":"adv.","definition":{"en":"Based on immediate feelings or a quick sense of what is true, rather than on detailed analysis.","zh":"基于即时的感觉或快速判断，而不是基于细致分析地。"},"examples":[{"en":"Intuitively, it seems wrong to punish someone for a mistake they couldn’t avoid.","zh":"凭直觉来看，因为无法避免的错误去惩罚某人似乎不公平。"},{"en":"Intuitively, most people expect prices to rise when demand increases.","zh":"凭直觉，大多数人会认为需求增加时价格会上涨。"}]}],"synonyms":["by intuition","instinctively","naturally","without thinking"],"phonetic":"/ɪnˈtuːɪtɪvli/","extraExplanation":["“Intuitively”来自“intuition（直觉）”。在日常英语里，它常用来表示“我说的不是严格证明，但从直觉/常识上很合理”。在学术写作中也常见，用来引出非正式的解释或先给读者一个大致的理解框架（之后再给严格推导）。","常见搭配：intuitively obvious（直觉上明显）、intuitively clear（直觉上清楚）、intuitively understand（直觉地理解）、intuitively appealing（直觉上很有吸引力/很合理）。","易混点：intuitively ≠ instinctively（本能地）。instinctively更偏“生理/本能反应”，而intuitively更偏“心里快速领会或判断”。"]}
{"word":"intuitiveness","summary":{"en":"Intuitiveness means how naturally understandable or easy to use something is without instruction.","zh":"Intuitiveness 指某事物在无需说明的情况下是否“自然易懂、容易上手”的直观程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to understand or use without needing much explanation; how naturally something “makes sense.”","zh":"直观性；不需太多解释就容易理解或上手的特质；“一看就懂/一用就会”的程度。"},"examples":[{"en":"The app’s intuitiveness makes it popular with first-time users.","zh":"这款应用的直观性让第一次使用的人也很容易上手，因此很受欢迎。"},{"en":"We tested the intuitiveness of the menu by asking people to find settings without help.","zh":"我们让人们在不帮助的情况下找设置，用来测试菜单的直观性。"}]}],"synonyms":["ease of use","user-friendliness","clarity","simplicity"],"phonetic":"/ɪnˈtuːɪtɪvnəs/","extraExplanation":["“intuitiveness”常见于产品设计/用户体验（UX）语境，强调界面或流程是否符合用户的直觉。更口语、更常见的说法是“how intuitive it is（有多直观）”，因为“intuitiveness”本身偏书面、偏技术写作。","词形关联：intuitive（adj. 直观的）→ intuitiveness（n. 直观性）；intuition（n. 直觉）是更常见的名词，但意义更偏“人的直觉”，而不是“设计的直观程度”。"]}
{"word":"intuitivism","summary":{"en":"Intuitivism is the belief that some truths—especially moral truths—can be known directly through intuition rather than mainly through reasoning or evidence.","zh":"Intuitivism（直觉主义）指一种观点：某些真理（尤指道德真理）可以通过直觉直接认识，而不主要依赖推理或证据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A view (especially in ethics) that some truths—such as what is right or wrong—can be known directly through intuition rather than mainly through reasoning, rules, or observation.","zh":"（尤指伦理学中的）直觉主义：认为某些真理（如对错、善恶）可以通过直觉直接被认识，而不主要依赖推理、规则或经验观察。"},"examples":[{"en":"In moral philosophy, intuitivism says we can sometimes know an action is wrong without doing a long calculation.","zh":"在道德哲学中，直觉主义认为我们有时不需要复杂推算，也能知道某个行为是错误的。"},{"en":"Her argument leans toward intuitivism: she trusts immediate moral judgment more than strict rules.","zh":"她的论证偏向直觉主义：她更相信即时的道德判断，而不是严格的规则。"}]},{"partOfSpeech":"n.","definition":{"en":"A broader philosophical view that emphasizes intuition as a basic source of knowledge in some area (for example, mathematics or metaphysics).","zh":"更广义的哲学观点：强调在某些领域（如数学或形而上学）直觉是知识的重要来源。"},"examples":[{"en":"Some forms of intuitivism in mathematics focus on what can be clearly constructed in the mind.","zh":"数学中的某些直觉主义强调能在心智中清楚“构造”出来的内容。"}]}],"synonyms":["intuitionism","moral intuitionism"],"phonetic":"/ɪnˈtuːɪtɪˌvɪzəm/","extraExplanation":["英语里 intuitivism 常见于学术写作，最常指“道德直觉主义”（moral intuitivism）：认为我们对某些道德命题（如“无端伤害他人是错的”）有一种直接的、非推导式的把握。20世纪讨论中常会提到 W. D. Ross 等学者。","不要把 intuitivism 简单等同于“凭感觉做决定”。在哲学语境中，它讨论的是“知识/理由从哪里来”，而不是鼓励不加思考的冲动行为。","数学语境里更常见的相关词是 intuitionism（直觉主义，常与 L. E. J. Brouwer 相关）。intuitivism 有时也会被用来泛指强调直觉的立场，但具体含义要看上下文。"]}
{"word":"intuitivist","summary":{"en":"An intuitivist is someone who believes intuition can directly provide knowledge or moral truth.","zh":"intuitivist 指相信直觉能直接提供知识或道德真理的人（多用于哲学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that some knowledge or moral truths can be known directly through intuition rather than through reasoning, evidence, or experience alone","zh":"直觉主义者；相信某些知识或道德真理可通过直觉直接把握，而不只依赖推理、证据或经验的人"},"examples":[{"en":"As an intuitivist, she trusts her immediate sense of right and wrong.","zh":"作为直觉主义者，她相信自己对对错的即时直觉。"},{"en":"The debate compared the intuitivist view with a more evidence-based approach.","zh":"这场辩论把直觉主义观点与更强调证据的方法作了比较。"}]}],"synonyms":["intuitionist","moral intuitionist","rationalist (sometimes contrasted, context-dependent)"],"phonetic":"/ɪnˈtuːɪtɪvɪst/","extraExplanation":["“Intuitivist”常出现在哲学语境，尤其与伦理学中的“直觉主义（intuitionism）”相关：主张人能直接“看出/觉察到”某些道德事实（如“伤害无辜是错的”）而不必先通过复杂推导。","在数学/逻辑领域也有“直觉主义（intuitionism）”，与布劳威尔（L. E. J. Brouwer）相关，强调数学对象需可被构造；在这种语境下的“intuitivist”指持该数学哲学立场的人。","日常英语里更常用的是形容词“intuitive（直觉的）”，而“intuitivist”相对更学术、更少见。"]}
{"word":"intuito","summary":{"en":"Intuito means “intention/purpose,” mainly used in Spanish/Portuguese contexts (e.g., “with the intuito of …”).","zh":"Intuito 表示“意图/目的”，多用于西语/葡语语境（如“为了……的用意”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly in Spanish/Portuguese contexts) an intention, aim, or purpose; a goal you have in mind.","zh":"（多见于西语/葡语语境）意图；目的；用意；心里想达成的目标。"},"examples":[{"en":"He did it with the intuito of helping his family.","zh":"他这么做的用意是为了帮助家人。"},{"en":"With no bad intuito, she asked a lot of questions.","zh":"她并无恶意，只是问了很多问题。"}]}],"synonyms":["intention","purpose","aim","objective"],"phonetic":"/ɪnˈtuːɪtoʊ/","extraExplanation":["“intuito”在西班牙语里常见于固定搭配 **con el intuito de + 动词**，意思相当于英语 **with the intention of / in order to**（“为了……”）。在英语写作中它不是常用词；如果你的读者主要是英语使用者，通常改用 *intention/purpose/aim* 更自然。","不要和英语 **intuition**（直觉）混淆：拼写相近但含义不同。"]}
{"word":"intuits","summary":{"en":"“Intuits” means “senses or understands immediately by intuition” (third-person singular of “intuit”).","zh":"“intuits”表示“凭直觉察觉/领会”，是动词“intuit”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to understand or know something immediately without conscious reasoning; to sense","zh":"凭直觉立刻理解或知道；直觉地察觉"},"examples":[{"en":"She intuits that something is wrong even before anyone says a word.","zh":"甚至在没人开口之前，她就直觉到出了问题。"},{"en":"A good teacher intuits when a student is confused and slows down.","zh":"好老师会直觉到学生在困惑，于是放慢节奏。"},{"en":"He intuits what the other person needs from a single glance.","zh":"他从对方的一眼就直觉到对方需要什么。"}]}],"synonyms":["senses","perceives","detects","discerns","feels","intuits"],"phonetic":"/ɪnˈtuːɪts/","extraExplanation":["“intuits”是动词“intuit”的第三人称单数现在时（he/she/it intuits）。常与that从句搭配：intuits that...","语感区分：intuit 强调“没有明确证据或推理过程的直觉领会”；deduce/figure out 更偏“推理得出”；guess 可能更随意、把握更低。"]}
{"word":"intumesce","summary":{"en":"Intumesce means to swell or become enlarged, especially from absorbing fluid.","zh":"Intumesce 指肿胀、膨大，尤其是因吸收水分或液体而变大。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to swell or become enlarged (often from taking in fluid)","zh":"（常因吸收水分而）肿胀、膨大"},"examples":[{"en":"The wound began to intumesce after the sting.","zh":"被蜇伤后，伤口开始肿胀。"},{"en":"When dry seeds are soaked, they intumesce and soften.","zh":"干燥的种子浸泡后会膨大并变软。"}]}],"synonyms":["swell (up)","expand","enlarge","puff up"],"phonetic":"/ˌɪn.tuːˈmɛs/","extraExplanation":["“intumesce”较为正式/书面，常见于医学、生物学与植物学语境。日常英语里更常说“swell (up)”。","词源来自拉丁语前缀“in-”（使……进入某种状态）+ “tumescere”（开始肿起），与“tumor（肿瘤）”“tumid（肿胀的）”同源。","常见搭配：intumesce rapidly（迅速肿胀）、intumesce with fluid（因液体而肿胀）、intumescent tissue（肿胀的组织）。"]}
{"word":"intumesced","summary":{"en":"“Intumesced” means swollen or enlarged (often in medical or literary contexts) and is the past form of “intumesce.”","zh":"“intumesced”意为“肿胀的/膨大的”（常见于医学或文学语境），也是动词“intumesce”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often in biology/medicine) swollen or enlarged, especially from fluid.","zh":"（常用于生物/医学）肿胀的、膨大的（尤指因液体导致）。"},"examples":[{"en":"After the sting, the skin became red and intumesced within minutes.","zh":"被蜇后，皮肤几分钟内就发红并肿了起来。"},{"en":"The doctor noted an intumesced area around the wound.","zh":"医生记录到伤口周围有一片肿胀区域。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) having swollen up; puffed up or distended.","zh":"（文学用法）鼓胀的、膨起的；膨胀起来的。"},"examples":[{"en":"Clouds hung low, intumesced with rain.","zh":"云层压得很低，像是吸饱了雨水般鼓胀。"},{"en":"The river looked intumesced after days of storms.","zh":"暴风雨持续几天后，河水看起来涨得鼓鼓的。"}]},{"partOfSpeech":"v.","definition":{"en":"Simple past / past participle of “intumesce” (to swell).","zh":"“intumesce”（肿胀/膨大）的过去式/过去分词。"},"examples":[{"en":"The tissue intumesced after the injection.","zh":"注射后组织出现了肿胀。"}]}],"synonyms":["swollen","puffy","bloated","distended","inflamed"],"phonetic":"/ˌɪn.tuˈmɛst/","extraExplanation":["“intumesced”较正式、偏学术，常见于医学报告、科研写作或文学描写。日常英语更常用swollen / puffy / bloated。","词源来自拉丁语前缀in-（使……）+ tumescere（开始肿胀，源自tumere“肿”）。因此它常带有“逐渐鼓起/膨胀”的感觉。","搭配提示：常与tissue/skin/area/region等医学名词连用；文学中也可形容clouds（云）、river（河水）等“鼓胀”的意象。"]}
{"word":"intumescence","summary":{"en":"Intumescence means swelling or enlargement, especially in medical/biological or botanical contexts.","zh":"Intumescence 指“肿胀/膨大”，多用于医学、生物学或植物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical/biology) swelling; an enlargement of a body part or tissue, often caused by fluid, inflammation, or increased blood flow.","zh":"（医学/生物）肿胀；身体部位或组织的膨大，常由液体积聚、炎症或血流增加引起。"},"examples":[{"en":"The doctor noted a mild intumescence around the ankle after the sprain.","zh":"医生注意到脚踝在扭伤后出现轻微肿胀。"},{"en":"In some infections, intumescence of the lymph nodes can occur.","zh":"在一些感染中，淋巴结可能会肿大。"}]},{"partOfSpeech":"n.","definition":{"en":"(Botany) a swelling or thickening on a plant organ, such as a stem or leaf.","zh":"（植物学）植物器官的膨大或增厚，如茎或叶的隆起。"},"examples":[{"en":"The botanist recorded an intumescence on the leaf surface under the microscope.","zh":"植物学家在显微镜下记录到叶片表面的隆起。"},{"en":"Certain plant diseases cause intumescence on young shoots.","zh":"某些植物病害会导致嫩枝出现膨大。"}]}],"synonyms":["swelling","enlargement","edema","tumescence"],"phonetic":"/ˌɪn.tuˈmɛs.əns/","extraExplanation":["词源提示：intumescence 来自拉丁语词根 in-（向内/进入）+ tumere（肿胀）。和常见词 tumble（翻滚）无关，但和 tumor（肿瘤，源自“肿起”）在词源感觉上相近。","语域与用法：这是偏正式、学术/医学写作常用词，日常口语更常说 swelling。医学语境里它不一定表示严重疾病，只是“肿起/肿大”的描述性术语。"]}
{"word":"intumescent","summary":{"en":"Intumescent means “swelling” (in biology/medicine) or “expanding when heated” (in fire-protective materials).","zh":"intumescent 指“肿胀的”（医学/生物）或“遇热膨胀的”（防火材料常用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Swelling; becoming enlarged, often because of fluid or heat.","zh":"肿胀的；膨胀的（常因液体、热量等导致体积变大）。"},"examples":[{"en":"The nurse noted intumescent tissue around the wound.","zh":"护士注意到伤口周围的组织出现肿胀。"},{"en":"After the injection, the skin looked slightly intumescent.","zh":"注射后，皮肤看起来有些轻微肿起。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Materials) Expanding when heated, especially to form a protective insulating layer (common in fire safety products).","zh":"（材料）受热会膨胀的，尤指形成保护性的隔热层（常见于防火材料）。"},"examples":[{"en":"Intumescent paint expands in a fire to help protect steel beams.","zh":"遇火时，膨胀型（防火）涂料会膨胀，从而帮助保护钢梁。"},{"en":"The contractor specified an intumescent sealant around the cable openings.","zh":"承包商在电缆孔洞周围指定使用膨胀型防火密封胶。"}]}],"synonyms":["swollen","swelling","tumid","puffy","inflamed","expanding","fire-retardant (contextual)"],"phonetic":"/ˌɪn.tuːˈmɛs.ənt/","extraExplanation":["“intumescent”常见于医学/生物学语境（指组织肿胀）和建筑防火语境（如intumescent paint/coat/strip/sealant）。日常英语里更常用“swollen / swelling”。","词源上来自拉丁语前缀in-（使……）+ tumescere（开始肿起），与“tumor（肿瘤）”“tumid（肿胀的）”有词根关联。"]}
{"word":"intumescing","summary":{"en":"Intumescing means “swelling” or “becoming enlarged,” especially in medical or scientific contexts.","zh":"intumescing 指“正在肿胀/膨大”，多见于医学或科学语境。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of tissue, organs, or a surface) to swell; to become enlarged, often because of fluid, inflammation, or growth.","zh":"（组织、器官或表面）肿胀；膨大，常因液体积聚、炎症或生长而变大。"},"examples":[{"en":"After the injury, the surrounding tissue began intumescing within hours.","zh":"受伤后，周围组织在数小时内开始肿胀。"},{"en":"The gums may be intumescing due to infection and should be checked by a dentist.","zh":"牙龈可能因感染而肿胀，应该让牙医检查。"},{"en":"In spring, plant buds are intumescing as they prepare to open.","zh":"春天里，植物花芽在开放前逐渐膨大。"}]},{"partOfSpeech":"adj.","definition":{"en":"swelling; becoming enlarged (used as a descriptive form, especially in medical or scientific writing).","zh":"肿胀的；正在膨大的（多用于医学或科学语境的描述）。"},"examples":[{"en":"The doctor noted an intumescing mass near the site of inflammation.","zh":"医生记录到炎症部位附近有一个正在肿大的肿块。"},{"en":"They observed intumescing cells under the microscope after exposure to the chemical.","zh":"接触该化学物质后，他们在显微镜下观察到细胞出现膨胀。"}]}],"synonyms":["swelling","enlarging","inflaming","puffing up","distending"],"phonetic":"/ˌɪn.tuˈmɛsɪŋ/","extraExplanation":["“intumescing”是动词“intumesce”的现在分词形式，在医学、生物学、植物学中更常见，日常英语里通常用更简单的词如“swelling / swollen”。","词源来自拉丁语：in-（向内/使……）+ tumescere（开始肿起），与“tumor（肿瘤/肿块）”同源，但“intumesce”本身并不一定表示肿瘤，只表示“肿胀/膨大”这一过程。"]}
{"word":"intumulate","summary":{"en":"“Intumulate” isn’t standard; the intended word is usually “intimate” (close/personal).","zh":"“intumulate” 不是标准用法；通常想表达的是 “intimate（亲密的／私密的）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; you probably mean “intimate.”","zh":"这不是标准英语单词；你可能想写的是 “intimate（亲密的／亲近的）”。"},"examples":[{"en":"I think you meant “intimate,” not “intumulate.”","zh":"我觉得你想写的是 “intimate”，不是 “intumulate”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) Close and personal; having a warm, private relationship.","zh":"（形容词）亲密的；关系亲近而私密的。"},"examples":[{"en":"They are intimate friends who tell each other everything.","zh":"他们是很亲密的朋友，什么都彼此倾诉。"},{"en":"The article includes intimate details about her childhood.","zh":"这篇文章包含她童年时期的私密细节。"}]},{"partOfSpeech":"vt.","definition":{"en":"(v.) To state or suggest indirectly; to hint.","zh":"（动词）暗示；委婉地表示。"},"examples":[{"en":"He intimated that he might quit the job.","zh":"他暗示自己可能会辞职。"}]}],"synonyms":["close","personal","private","friendly","suggest","hint"],"phonetic":"/ˈɪn.tə.mət/","extraExplanation":["“intimate” 读作 /ˈɪn.tə.mət/（形容词）时重音在第一个音节；作动词 “to intimate” /ˈɪn.təˌmeɪt/ 时也常见重音变化。拼写 “intumulate” 多半是把发音听错或把词形类比到 “accumulate” 之类的词造成的。"]}
{"word":"intune","summary":{"en":"In tune means ‘in harmony’ or ‘at the correct musical pitch.’","zh":"In tune 表示“和谐一致/很合拍”，也可指“音准正确、不跑调”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(of people, music, or things) in harmony; matching well in mood, opinion, or style.","zh":"（人、音乐或事物）和谐一致；在情绪、观点或风格上很合拍。"},"examples":[{"en":"The band was in tune, and the song sounded great.","zh":"乐队配合得很默契，这首歌听起来很棒。"},{"en":"After the meeting, the team felt in tune about the plan.","zh":"会议结束后，团队对这个计划的看法很一致。"}]},{"partOfSpeech":"phrase","definition":{"en":"(of an instrument or voice) at the correct pitch; not too high or too low.","zh":"（乐器或嗓音）音准正确；不跑调。"},"examples":[{"en":"My guitar is finally in tune.","zh":"我的吉他终于调准了。"},{"en":"She checked the piano to make sure it was in tune.","zh":"她检查了钢琴，确保音准没问题。"}]}],"synonyms":["harmonious","in harmony","well-matched","on pitch"],"phonetic":"/ɪn tun/","extraExplanation":["“intune”常见于把短语写成一个词的拼写；更标准的写法是 **in tune**。","另外，**Microsoft Intune** 是微软的产品名（移动设备与应用管理工具），属于专有名词，发音和拼写与短语 **in tune** 不同但容易混淆。"]}
{"word":"inturbidate","summary":{"en":"Inturbidate means to make something (especially water) cloudy or muddy, or to become cloudy.","zh":"inturbidate 指使（尤指水）变浑浊，或（自己）变浑浊。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a liquid or situation cloudy, muddy, or less clear; to disturb clarity","zh":"使（液体或情况）变浑浊；使不清晰；搅乱清晰度"},"examples":[{"en":"Heavy rain can inturbidate the river within minutes.","zh":"大雨会在几分钟内把河水搅得浑浊。"},{"en":"Rumors may inturbidate the truth and confuse the public.","zh":"谣言可能会让真相变得不清不楚，并使公众困惑。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become cloudy or muddy (especially of water)","zh":"（尤指水）变得浑浊"},"examples":[{"en":"After the storm, the water inturbidated near the shore.","zh":"暴风雨过后，岸边的水变浑浊了。"}]}],"synonyms":["muddy","cloud (up)","make turbid","stir up","befoul"],"phonetic":"/ɪnˈtɝːbɪˌdeɪt/","extraExplanation":["这个词非常少见，多见于较旧或较学术的英文写作（尤其是科学/医学/自然观察类文本）。日常英语里更常用 make muddy / make cloudy / muddy / cloud (up) / stir up。","词源上可理解为 in-（使……进入某种状态）+ turbid（浑浊的）。turbid 常用于描述水质、玻璃、空气等“透明度下降”的状态；引申到信息与判断时，也有“把事情弄得不清楚”的意思。"]}
{"word":"inturgescence","summary":{"en":"Inturgescence means swelling or enlargement, usually from fluid or blood buildup.","zh":"Inturgescence 指因液体或血液增多等造成的肿胀或膨大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"swelling or enlargement caused by an increase of fluid, blood, or internal pressure (engorgement).","zh":"（因液体、血液增加或内部压力上升而导致的）肿胀、膨大；充血性肿胀。"},"examples":[{"en":"The doctor noted inturgescence around the wound, suggesting inflammation.","zh":"医生观察到伤口周围出现充血性肿胀，提示可能有炎症。"},{"en":"After the bite, there was rapid inturgescence of the skin.","zh":"被咬后，皮肤迅速发生肿胀。"}]}],"synonyms":["swelling","engorgement","distention","edema"],"phonetic":"/ˌɪn.tɚˈdʒɛs.əns/","extraExplanation":["这是一个较少见、偏医学/生物学的词，常用于较正式或学术性的描述；日常英语里更常用 swelling、puffiness、(blood) engorgement 或 distention。","词源上可理解为 in-（向内/进入）+ turgescence（膨胀、肿胀）；相关词：turgid（肿胀的；文风夸张的）、turgescence（肿胀）。"]}
{"word":"inturn","summary":{"en":"“In turn” means (1) one after another, in sequence; or (2) as a result/in response—one thing leads to another.","zh":"“in turn”表示（1）依次、轮流；（2）因此/反过来——一件事引起另一件事。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"one after another; in sequence (each person does something when it is their time)","zh":"依次；轮流（按顺序一个接一个地）"},"examples":[{"en":"Please speak in turn so everyone can be heard.","zh":"请依次发言，这样每个人都能被听见。"},{"en":"The students answered the questions in turn.","zh":"学生们轮流回答问题。"}]},{"partOfSpeech":"phrase","definition":{"en":"as a result; in response; in return (one thing leads to another)","zh":"因此；反过来；作为回应（某事引起另一件事）"},"examples":[{"en":"Her success inspired others, who in turn supported her project.","zh":"她的成功激励了其他人，而其他人也反过来支持了她的项目。"},{"en":"Higher costs can, in turn, raise prices for customers.","zh":"更高的成本反过来可能会提高顾客的价格。"}]}],"synonyms":["one by one","successively","sequentially","in sequence","in return","as a result","consequently"],"phonetic":"/ɪn tɝn/","extraExplanation":["常见写法是两个词：in turn。你输入的“inturn”一般被视为拼写错误。","不要和“intern（实习生）”混淆：intern /ˈɪn.tɝn/ 是名词，意思完全不同。","“in turn”可放在句首、句中或句末；表示“因此/反过来”时常用逗号隔开：..., which in turn ..."]}
{"word":"inturned","summary":{"en":"In-turned means turned inward (often describing feet/knees) or bent inward (like an edge).","zh":"In-turned 指“向内转的”（常形容脚/膝）或“向内弯折的”（如边缘内折）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a body part, especially the feet or knees) turned inward toward the center of the body; turned in.","zh":"（指身体部位，尤指脚或膝）向内侧转的；内翻的；内扣的。"},"examples":[{"en":"The child walks with slightly in-turned feet.","zh":"这个孩子走路时脚尖有点内扣。"},{"en":"The doctor noticed his knees were in-turned and suggested an evaluation.","zh":"医生注意到他的膝盖有内翻，建议做进一步评估。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of an edge, surface, or object) bent or folded inward.","zh":"（指边缘、表面或物体）向内弯折的；向内卷的。"},"examples":[{"en":"The metal sheet had an in-turned edge for safety.","zh":"这块金属板的边缘向内折起，以确保安全。"},{"en":"Choose a bowl with an in-turned rim to reduce spills.","zh":"选一个内卷口的碗，可以减少洒出。"}]}],"synonyms":["inward-turning","turned-in","inward","inverted"],"phonetic":"/ˌɪnˈtɝnd/","extraExplanation":["“inturned”更常见的标准写法是带连字符的 **in-turned**。如果你原本想写的是 **in turn**（“轮流；反过来；因此”）或 **interned**（“拘禁；实习”），我也可以分别给你对应词条与例句。"]}
{"word":"inturning","summary":{"en":"“In turn” means either “one after another (in order)” or “as a result; in return.”","zh":"“in turn” 常表示“依次/轮流”，也可表示“反过来/因此（结果）”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Often written as “in turn”) One after another in a particular order; each person does something when it is their time.","zh":"（常写作 in turn）依次地；轮流地；按顺序地，每个人轮到自己时做某事。"},"examples":[{"en":"The students answered the questions in turn.","zh":"学生们依次回答问题。"},{"en":"We took turns driving; in turn, I drove the last two hours.","zh":"我们轮流开车；轮到我时，我开了最后两个小时。"},{"en":"Each country spoke in turn during the meeting.","zh":"会议中各国依次发言。"}]},{"partOfSpeech":"phrase","definition":{"en":"As a result of something; in return; consequently.","zh":"作为结果；反过来；因此。"},"examples":[{"en":"He encouraged his team, and they worked harder in turn.","zh":"他鼓励了团队，结果他们反而更努力工作了。"},{"en":"Lower prices can increase demand, which in turn creates more jobs.","zh":"更低的价格会增加需求，而这反过来会创造更多工作。"}]}],"synonyms":["one by one","in order","successively","one after another","consequently","as a result","in return"],"phonetic":"/ɪn ˈtɝn/","extraExplanation":["“inturning” 不是常见标准拼写；最常见的表达是把它分开写：in turn。","in turn 的两个常用意思要靠语境区分：①“依次/轮流”（强调顺序）②“反过来/因此”（强调因果或连锁反应）。","常见搭配：take turns (doing sth)（轮流做某事）；which in turn…（这反过来会……）。"]}
{"word":"inturns","summary":{"en":"“In turn” most often means “one after another” or “as a result; which then causes something else.”","zh":"“in turn”常表示“依次/轮流”，也可表示“因此/进而（引出连锁结果）”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"one after another; each person does something when it is their time","zh":"轮流；依次（一个接一个地做）"},"examples":[{"en":"The students answered the questions in turn.","zh":"学生们依次回答问题。"},{"en":"We took turns driving, and we stopped for coffee in turn.","zh":"我们轮流开车，也依次停下来喝咖啡。"}]},{"partOfSpeech":"phrase","definition":{"en":"as a result of something; and this causes another thing","zh":"因此；进而（表示因果连锁反应）"},"examples":[{"en":"The roads were icy, and this in turn caused many delays.","zh":"道路结冰了，而这反过来导致了许多延误。"},{"en":"Better sleep improves focus, which in turn helps you learn faster.","zh":"更好的睡眠会提升专注力，而这进而帮助你学得更快。"}]}],"synonyms":["one by one","in sequence","successively","as a result","consequently"],"phonetic":"/ɪn ˈtɝn/","extraExplanation":["你输入的“inturns”通常是拼写/空格错误。更常见的写法是 **in turn**（两个词）。\n- **in turn**：最常用，可表示“依次/轮流”，也可表示“因此/进而”。\n- **in turns**：较少见，通常强调“分成几轮/几次轮流”（例如多次轮换），日常表达多数情况下仍用 **take turns** 或 **in turn**。","常见搭配：**take turns (doing sth)**=轮流做某事；**in turn**常出现在解释因果关系的书面语或学术表达中（如“X, which in turn leads to Y”）。"]}
{"word":"intuse","summary":{"en":"Intuse is a rare word meaning “obtuse” or “blunt,” especially for an angle wider than 90 degrees.","zh":"intuse 是很少見的字，意思是「鈍的／不尖的」，特別可指大於90度的「鈍角」。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Obtuse; not sharp or pointed (often used of angles, meaning greater than 90°).","zh":"鈍的；不尖的、不銳利的（常指角度，意為大於90°的鈍角）。"},"examples":[{"en":"In geometry, an intuse angle is wider than a right angle.","zh":"在幾何中，intuse angle（鈍角）比直角更大。"},{"en":"The tool’s blade was intuse, so it couldn’t cut cleanly.","zh":"這把工具的刀刃很鈍，所以切不乾淨。"}]}],"synonyms":["obtuse","blunt"],"phonetic":"/ɪnˈtjuːs/","extraExplanation":["「intuse」在現代英語中非常少見，多半會用更常見的「obtuse」（鈍角的／遲鈍的）或「blunt」（不尖的、鈍的）來表達。","如果你其實想查的是「in use」（正在使用中），那是兩個字的片語，意思是「在使用中／啟用中」，例如：\"This machine is in use.\"（這台機器正在使用中。）"]}
{"word":"intussuscept","summary":{"en":"Intussuscept means to take something in internally by absorption or incorporation (a term mostly used in biology/medicine).","zh":"Intussuscept 指通过内部吸收或内陷的方式把某物纳入结构/体内（多用于生物或医学语境）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(biology/medicine) To take something in by internal absorption or incorporation, so it becomes part of a structure or body.","zh":"（生物/医学）通过内部吸收或内陷的方式把某物纳入体内或结构中，使其成为其中一部分。"},"examples":[{"en":"Some organisms can intussuscept nutrients directly through their body surface.","zh":"有些生物可以通过体表直接内吸收（intussuscept）营养物质。"},{"en":"In older medical writing, the bowel was described as able to intussuscept into itself.","zh":"在较早的医学文献中，肠道被描述为可能发生向自身内陷的内吸收/内套现象（intussuscept）。"}]}],"synonyms":["incorporate","absorb","take in","assimilate"],"phonetic":"ˌɪn.tə.səˈsɛpt","extraExplanation":["这个词在现代医学里更常见的是名词 **intussusception（肠套叠）**：一段肠管“套入”相邻肠段，可能导致腹痛、呕吐等，需要及时就医。动词 **intussuscept** 相对少见，多见于较旧或较学术的文本。","词源上来自拉丁语，含义类似“把……收进去/套进去”。学习时可把它和更常用的 **intussusception** 联想记忆。"]}
{"word":"intussusception","summary":{"en":"Intussusception is when part of the intestine folds into an adjacent part, potentially causing blockage and reduced blood flow.","zh":"intussusception（肠套叠）指一段肠子套入相邻肠段，可能导致肠梗阻并影响血供。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which one part of the intestine slides into the next part (like a telescope), which can block food and blood flow","zh":"一种医学情况：一段肠子“套进”相邻的一段（像伸缩望远镜一样），可能造成肠道阻塞并影响血液供应"},"examples":[{"en":"The baby was taken to the ER with severe stomach pain, and doctors suspected intussusception.","zh":"宝宝因剧烈腹痛被送到急诊，医生怀疑是肠套叠。"},{"en":"Early treatment of intussusception can prevent serious damage to the intestine.","zh":"尽早治疗肠套叠可以避免肠道受到严重损伤。"}]}],"synonyms":["intestinal invagination","bowel telescoping"],"phonetic":"/ˌɪn.tə.səˈsɛp.ʃən/","extraExplanation":["词源提示：intus-（拉丁语，意为“在里面”）+ suscipere（意为“接收/承接”），形象地表达“把一段肠子收进另一段里”的状态。","常见语境：多见于医学/急救场景，尤其在婴幼儿中更常听到。典型症状描述可能包括阵发性腹痛、呕吐、便血（有时被形容为“果酱样便”）。这类信息仅用于理解词义；出现症状应及时就医。","文学/比喻用法：在日常或文学英语中几乎不作比喻使用，通常保持严格的医学含义。"]}
{"word":"intussusceptive","summary":{"en":"A medical/scientific adjective meaning “involving one part folding into or slipping inside another part.”","zh":"医学/科研用形容词，指“某一部分折入或套入另一部分之中”的过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a process in which one part folds into or slides inside another part (especially in the body).","zh":"与“套叠式/内陷式”的过程有关：某一部分折入或滑入另一部分之中（尤指人体内）。"},"examples":[{"en":"Doctors suspected an intussusceptive process in the patient’s intestine.","zh":"医生怀疑患者肠道发生了套叠式的过程。"},{"en":"The report described intussusceptive growth of the tumor into nearby tissue.","zh":"报告描述肿瘤以“内陷/套入”的方式向邻近组织生长。"}]}],"synonyms":["invaginating","telescoping"],"phonetic":"/ˌɪn.tə.səˈsɛp.tɪv/","extraExplanation":["这个词主要用于医学与生物学语境，最常见关联是“肠套叠”（intussusception）：一段肠管像望远镜一样套进另一段肠管，可能导致腹痛、呕吐等，需要及时处理。","词源上与拉丁语有关：in-（进入）+ suscipere（接纳/承接），核心意象就是“一个部分进入另一个部分里面”。","在血管生成（angiogenesis）研究中，也会出现“intussusceptive angiogenesis”（套叠式血管生成），指血管内形成隔膜样结构，把一个血管腔分隔成两个。"]}

