{"word":"Inuit","summary":{"en":"Inuit refers to an Indigenous Arctic people (and also describes things related to them, such as culture and language).","zh":"Inuit 指北极地区的因纽特原住民民族，也可作形容词表示与其文化或语言相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people who traditionally live in the Arctic regions of Canada, Greenland, and Alaska","zh":"因纽特人：传统上生活在加拿大、格陵兰和阿拉斯加等北极地区的原住民民族成员"},"examples":[{"en":"Many Inuit communities live in Nunavut in northern Canada.","zh":"许多因纽特社区居住在加拿大北部的努纳武特地区。"},{"en":"Inuit artists are known for carvings and prints that reflect Arctic life.","zh":"因纽特艺术家以反映北极生活的雕刻和版画而闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Inuit people, their languages, or their culture","zh":"因纽特的：与因纽特人、其语言或文化相关的"},"examples":[{"en":"She is studying Inuit history and culture at university.","zh":"她在大学学习因纽特历史与文化。"},{"en":"The museum has an Inuit exhibit featuring traditional clothing and tools.","zh":"博物馆有一个因纽特展览，展示传统服饰和工具。"}]}],"synonyms":["Inuk (singular, often used in Inuit languages)","Inuit people"],"phonetic":"ˈɪn.juː.ɪt","extraExplanation":["“Inuit”在因纽特语中大意是“人们”，单数常用“Inuk”。在英语里日常也常把“Inuit”当作单复数同形（one Inuit / many Inuit）。","在北美语境中，“Inuit”通常比“Eskimo”更被尊重、更准确；“Eskimo”在一些地区可能被视为不恰当或过时（不过在阿拉斯加某些语境里仍可能出现）。写作或交流时，优先使用具体族群名称（如“Inuit”或更细分的群体名）会更稳妥。"]}
{"word":"inuit","summary":{"en":"Inuit refers to Indigenous peoples of the Arctic (and can also mean ‘related to them’).","zh":"Inuit 指北极地区的原住民族（也可作形容词表示“与因纽特有关的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of Indigenous peoples who traditionally live in the Arctic regions of Canada, Greenland, and Alaska","zh":"因纽特人：传统上居住在加拿大、格陵兰和阿拉斯加等北极地区的原住民族成员"},"examples":[{"en":"Many Inuit communities maintain strong traditions of hunting and storytelling.","zh":"许多因纽特社区仍保有强烈的狩猎与口述故事传统。"},{"en":"The museum worked with Inuit artists to present their work respectfully.","zh":"博物馆与因纽特艺术家合作，以尊重的方式呈现他们的作品。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Inuit people, their languages, or cultures","zh":"因纽特的：与因纽特人、其语言或文化有关的"},"examples":[{"en":"She is studying Inuit languages and how they express relationships with the land.","zh":"她正在研究因纽特语言，以及这些语言如何表达与土地的关系。"},{"en":"We attended an exhibit of Inuit sculpture and printmaking.","zh":"我们参观了因纽特雕刻与版画展。"}]}],"synonyms":["Inuk (singular, often used in some contexts)","Iñupiat (related group term, Alaska-specific)"],"phonetic":"/ˈɪn.ju.ɪt/","extraExplanation":["“Inuit”在英语中既可作名词也可作形容词。现代语境里更推荐用“Inuit”而不是“Eskimo”（该词在许多场合被视为不尊重或过时，尤其在加拿大）。","“Inuit”在因纽特语中常被解释为“人”（people）。单数有时写作“Inuk”，复数为“Inuit”，但在英文写作里常直接用“Inuit”表示单数或复数；是否区分取决于地区与写作规范。","文化与政治语境很重要：不同地区与群体的自称可能不同（例如阿拉斯加部分群体可能使用“Iñupiat”“Yupik”等），写作时最好以当事群体的偏好为准。"]}
{"word":"inuits","summary":{"en":"“Inuits” means the Inuit people (plural), Indigenous peoples of the Arctic; in formal English, “Inuit” is often used as both singular and plural.","zh":"“Inuits”指“因纽特人”（复数），即北极地区的原住民族群；较正式英语中常用“Inuit”作单复数同形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of Inuit: Indigenous peoples of the Arctic regions of Canada, Greenland, and Alaska","zh":"Inuit 的复数：居住在加拿大、格陵兰与阿拉斯加等北极地区的因纽特原住民族群"},"examples":[{"en":"Many Inuits in northern Canada speak Inuktitut as well as English.","zh":"加拿大北部的许多因纽特人既说因纽特语（Inuktitut），也说英语。"},{"en":"The museum worked with Inuits to present their history respectfully.","zh":"博物馆与因纽特人合作，以尊重的方式呈现他们的历史。"}]}],"synonyms":["Inuit (plural form commonly used)","the Inuit people"],"phonetic":"/ˈɪn.juˌɪt/","extraExplanation":["“Inuit”在英语里常被当作单复数同形（one Inuit / many Inuit）。写作“Inuits”也会出现，但在学术与较正式语境中更常见的是用不加-s的“Inuit”。","用词敏感性：在加拿大语境中，“Inuit”通常被认为是更合适、更尊重的称呼；“Eskimo”在加拿大多被视为不恰当或冒犯（在阿拉斯加部分社区对该词的态度可能不同，但仍建议优先使用具体族群名称，如 Inuit、Yupik 等）。","“Inuit”原意常被解释为“人”（people）。因此有时会看到“I n u i t people（因纽特人）”这样的搭配；但也有人认为这有点重复，实际使用以当地社群偏好为准。"]}
{"word":"inukshuk","summary":{"en":"An Inuit stone landmark used as a sign or guide in the Arctic.","zh":"北极地区因纽特人等用石头堆成的路标/标志，用于指引与标记地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stone landmark built by Inuit and other Arctic peoples, often shaped like a person, used to guide travelers, mark routes, or point to important places.","zh":"因纽特人等北极地区民族堆砌的石头标志（常呈“人形”），用于指路、标示路线或提示重要地点。"},"examples":[{"en":"We saw an inukshuk on the ridge, showing the safest path across the tundra.","zh":"我们在山脊上看到一个因纽特石标，指示穿越苔原最安全的路线。"},{"en":"The museum display explained how an inukshuk can mark a good fishing spot.","zh":"博物馆的展览说明了因纽特石标也可以用来标记好渔点。"}]}],"synonyms":["stone marker","cairn (related)","landmark"],"phonetic":"/ɪˈnʊkˌʃʊk/","extraExplanation":["“Inukshuk”来自因纽特语系，常被理解为“像人一样起作用的东西/替人办事的东西”。它不只是装饰物，传统上与生存和导航密切相关。","在现代语境里它有时被当作“加拿大北方/因纽特文化”的象征使用（如纪念品、标志设计）。在使用或购买相关图案时，尊重其文化意义、避免仅当作摆设会更合适。","拼写提示：常见变体有 inukshuk / inuksuk；而更“人形”的那类有时也会被称为 inunnguaq（更像“人的形状”）。"]}
{"word":"inula","summary":{"en":"Inula is a genus of yellow-flowered plants in the daisy family.","zh":"Inula 指菊科旋覆花属的一类黄色花植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the daisy family with yellow, daisy-like flowers (some species are called fleabane or elecampane)","zh":"菊科旋覆花属的植物，常开黄色、类似雏菊的花（部分物种俗称“飞蓬/驱蚤草”或“土木香”）"},"examples":[{"en":"Inula grows well in sunny gardens and attracts pollinators.","zh":"旋覆花属植物适合在阳光充足的花园里生长，还能吸引传粉昆虫。"},{"en":"Elecampane is an inula species that has been used in traditional herbal preparations.","zh":"土木香是旋覆花属的一种，曾用于传统草本制剂。"}]}],"synonyms":["elecampane","fleabane"],"phonetic":"/ˈɪn.jə.lə/","extraExplanation":["“Inula”是植物学中的拉丁属名，英语里常见于园艺、草药或植物科普语境；日常口语中更常用具体俗名（如 elecampane）。","相关词：daisy family（菊科）、pollinator（传粉昆虫）、herbal（草本的）。"]}
{"word":"inulaceous","summary":{"en":"Inulaceous means “related to or resembling Inula (elecampane-type) plants.”","zh":"inulaceous 指“与旋覆花属（如土木香）植物有关或相似的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling plants of the genus Inula (such as elecampane), or the botanical group associated with them.","zh":"（植物学）与旋覆花属（Inula，如土木香/旋覆花类）有关的；或外形、特征类似旋覆花属植物的。"},"examples":[{"en":"Elecampane is an inulaceous plant once used in traditional herbal remedies.","zh":"土木香属于旋覆花属植物（inulaceous），过去常用于传统草药疗法。"},{"en":"The field guide described the specimen as an inulaceous herb with yellow, daisy-like flowers.","zh":"野外图鉴将该标本描述为一种旋覆花属类型的草本植物，开黄色、似雏菊的花。"}]}],"synonyms":["Inula-related","elecampane-like","Inuleae (context-specific)"],"phonetic":"ˌɪn.jəˈleɪ.ʃəs","extraExplanation":["这是一个非常少见、偏学术的植物学形容词，常见于分类学或植物志写作中。日常英语里几乎不用。","Inula 常见代表是 elecampane（Inula helenium），在西方草药传统中较有名；因此你可能在草药、植物志或老式博物学文本里见到 inulaceous。"]}
{"word":"inulase","summary":{"en":"Inulase (more commonly written “inulinase”) is an enzyme that breaks down inulin into simpler sugars, especially fructose.","zh":"Inulase（更常写作 inulinase）指菊粉酶，用于将菊粉分解成更简单的糖，尤其是果糖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme that breaks down inulin (a plant storage carbohydrate) into simpler sugars such as fructose; also spelled inulinase","zh":"菊粉酶；一种将菊粉（植物储藏性碳水化合物）分解为更简单糖类（如果糖）的酶；也常拼作 inulinase"},"examples":[{"en":"Inulase is used in some food and biotech processes to produce fructose from inulin.","zh":"菊粉酶用于一些食品与生物技术工艺中，把菊粉转化为果糖。"},{"en":"The lab measured inulase activity to see how quickly the inulin was broken down.","zh":"实验室测量了菊粉酶活性，以了解菊粉被分解的速度。"}]}],"synonyms":["inulinase"],"phonetic":"/ˌɪn.jəˈlaɪ.neɪs/","extraExplanation":["“inulase”在实际英文资料中更常见、也更标准的拼写是“inulinase”。如果你是在论文、产品说明或实验记录里看到“inulase”，它通常指的就是“inulinase”（菊粉酶）。","“菊粉（inulin）”常见于菊苣（chicory）、菊芋（Jerusalem artichoke）等植物；菊粉酶在食品工业（果糖/低聚果糖制备）与发酵相关研究中较常出现。"]}
{"word":"inulases","summary":{"en":"Inulases are enzymes that break down the plant fiber inulin into simpler sugars (often fructose).","zh":"Inulases（菊粉酶）是分解菊粉这种植物纤维、生成更简单糖（常为果糖）的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of inulinase: enzymes that break down inulin (a plant fiber) into simpler sugars such as fructose.","zh":"inulinase（菊粉酶）的复数：能把菊粉（植物纤维）分解成更简单糖（如果糖）的酶。"},"examples":[{"en":"Inulases are used in some food and biotechnology processes to convert inulin into fructose.","zh":"菊粉酶在某些食品与生物技术工艺中用于把菊粉转化为果糖。"},{"en":"Researchers compared different inulases to see which worked best at low temperatures.","zh":"研究人员比较了不同的菊粉酶，以找出哪一种在低温下效果最好。"}]}],"synonyms":["inulinases","inulinase enzymes"],"phonetic":"/ˈɪnjəlɪˌneɪsɪz/","extraExplanation":["“inulases”比较少见，更多时候你会看到单数“inulinase”或复数“inulinases”。你的拼写“inulases”可能是简写、拼写变体，或是把“inulinases”少写了一个“in”。如果你是在论文/说明书里看到的，我也可以帮你根据上下文确认具体指的是哪一种酶（如 endo-/exo-inulinase）。"]}
{"word":"inulin","summary":{"en":"Inulin is a plant-based soluble fiber (a prebiotic) often used in foods and supplements to support gut health.","zh":"Inulin（菊粉）是一种植物来源的可溶性纤维（益生元），常用于食品与补充剂以支持肠道健康。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of soluble dietary fiber found in many plants, often used as a prebiotic to support beneficial gut bacteria and improve digestion.","zh":"一种可溶性膳食纤维，存在于许多植物中，常作为“益生元”帮助有益肠道菌生长并促进消化健康。"},"examples":[{"en":"Chicory root is a common source of inulin in many fiber supplements.","zh":"菊苣根是许多纤维补充剂中菊粉（inulin）的常见来源。"},{"en":"Some people add inulin to smoothies to increase their daily fiber intake.","zh":"有些人会在奶昔/果昔里加入菊粉来增加每日纤维摄入量。"},{"en":"Because inulin is a prebiotic fiber, it may cause gas at first for some people.","zh":"由于菊粉是益生元纤维，有些人刚开始食用时可能会胀气。"}]},{"partOfSpeech":"n.","definition":{"en":"In biochemistry, a storage carbohydrate (a chain of fructose units) found in plants such as chicory, Jerusalem artichoke, and dahlia.","zh":"在生物化学中，植物的储存性碳水化合物（由多个果糖单元连接而成），常见于菊苣、菊芋和大丽花等植物。"},"examples":[{"en":"Plants store energy as starch or as inulin, depending on the species.","zh":"不同植物会以淀粉或菊粉的形式储存能量。"},{"en":"Researchers extracted inulin from Jerusalem artichoke for food science experiments.","zh":"研究人员从菊芋中提取菊粉用于食品科学实验。"}]}],"synonyms":["chicory root fiber","prebiotic fiber","soluble fiber"],"phonetic":"/ˈɪn.jə.lɪn/","extraExplanation":["“Inulin”在食品配料表里有时会以“chicory root fiber（菊苣根纤维）/chicory root extract（菊苣根提取物）”等形式出现，本质上常指富含菊粉的成分。","菊粉属于FODMAP的一种（可发酵碳水），对肠易激综合征（IBS）人群可能更容易引起腹胀或不适；增加摄入时通常建议从小剂量开始。"]}
{"word":"inulins","summary":{"en":"Inulins are plant-based dietary fibers often used as prebiotics to support gut bacteria.","zh":"菊粉是一类来自植物的膳食纤维，常作为益生元帮助肠道有益菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inulins are a group of naturally occurring dietary fibers (a type of carbohydrate) found in many plants. They are often used as prebiotics to support beneficial gut bacteria.","zh":"菊粉（inulins）是一类天然存在于多种植物中的膳食纤维（属于碳水化合物的一种）。它们常作为“益生元”来帮助有益肠道菌生长。"},"examples":[{"en":"Many yogurt products add inulins to increase fiber and support gut health.","zh":"很多酸奶产品会添加菊粉来提高纤维含量并支持肠道健康。"},{"en":"Chicory root is a common source of inulins used in food processing.","zh":"菊苣根是食品加工中常用的菊粉来源。"},{"en":"Some people may feel bloated if they suddenly eat a lot of inulins.","zh":"有些人如果突然摄入大量菊粉，可能会感觉胀气。"}]}],"synonyms":["inulin","prebiotic fiber","chicory root fiber","dietary fiber"],"phonetic":"/ˈɪn.jə.lɪnz/","extraExplanation":["“inulin”通常用作不可数名词（inulin），但在科研或配料表语境中也会用复数“inulins”来强调“不同类型/不同链长的菊粉混合物”。","菊粉常被归为可溶性膳食纤维与益生元，常见于菊苣根、洋葱、大蒜、芦笋等植物；在食品中也常用于增加口感（更顺滑）或降低糖脂带来的热量感。","学习提示：配料表里可能会看到“inulin”或“chicory root fiber”（菊苣根纤维），通常指的就是菊粉或含菊粉的纤维成分。"]}
{"word":"inuloid","summary":{"en":"Inuloid means “inulin-like”—either describing or naming a plant carbohydrate similar to inulin.","zh":"inuloid 指“类似菊粉的（菊粉样）”，可作形容词或名词，常用于指植物中与菊粉相近的碳水化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Resembling or related to inulin (a plant carbohydrate) or inulin-like substances (often found in roots and tubers).","zh":"（形容词）类似菊粉（inulin，一种植物碳水化合物）或与菊粉样物质有关的（常见于根和块茎中）。"},"examples":[{"en":"Chicory contains inuloid carbohydrates that can act like dietary fiber.","zh":"菊苣含有菊粉样（inuloid）的碳水化合物，作用类似膳食纤维。"},{"en":"The researcher measured inuloid compounds in the plant root extract.","zh":"研究人员测量了植物根部提取物中的菊粉样化合物。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) An inulin-like substance; a carbohydrate in plants that is chemically similar to inulin.","zh":"（名词）菊粉样物质；在植物中与菊粉在化学性质上相近的碳水化合物。"},"examples":[{"en":"Some medicinal plants store energy as an inuloid rather than starch.","zh":"一些药用植物储存能量的形式是菊粉样物质，而不是淀粉。"},{"en":"This sample contains an inuloid that breaks down into fructose units.","zh":"这个样本含有一种菊粉样物质，可分解成果糖单位。"}]}],"synonyms":["inulin-like","fructan-related","inulinaceous"],"phonetic":"/ˈɪn.jəˌlɔɪd/","extraExplanation":["“inuloid”多见于较专业的植物学、食品化学或营养学语境，用来泛指“像菊粉那一类的物质”。菊粉及其“菊粉样物质”常被归入fructans（果聚糖）一类，在人体中通常不被完全消化，因此常与“膳食纤维/益生元（prebiotic）”的功能讨论相关。","词源上与植物属名 Inula（旋覆花属）有关；历史上人们在某些菊科植物根部发现类似菊粉的储能物质，因此形成这类命名。"]}
{"word":"inum","summary":{"en":"Inum is a Unix/Linux term meaning “inode number,” the unique identifier for a file’s inode on a filesystem.","zh":"inum 是 Unix/Linux 里的术语，意思是 “inode 编号”，用于在文件系统中唯一标识文件 inode 的数字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing, especially Unix/Linux) an inode number; a unique number that identifies a file’s inode (its metadata record) on a filesystem.","zh":"（计算机用语，尤指 Unix/Linux）inode 编号；用于在文件系统中唯一标识某个文件 inode（文件的元数据记录）的数字编号。"},"examples":[{"en":"Run “ls -i” to see each file’s inum (inode number).","zh":"运行 “ls -i” 可以看到每个文件的 inum（inode 编号）。"},{"en":"Hard-linked files share the same inum because they point to the same inode.","zh":"硬链接的文件会共享同一个 inum，因为它们指向同一个 inode。"}]}],"synonyms":["inode number","inode"],"phonetic":"/ˈaɪˌnʌm/","extraExplanation":["在 Unix/Linux 文件系统里，文件名和 inode 是分开的：目录记录“文件名 → inode 编号（inum）”的映射；inode 里保存权限、所有者、时间戳、数据块位置等信息（但通常不直接保存文件名）。因此同一个 inode 可以对应多个文件名（硬链接）。"]}
{"word":"inumbrate","summary":{"en":"Innumerate means lacking basic ability to understand or use numbers.","zh":"innumerate 指缺乏基本数字理解与运算能力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"lacking basic number skills; unable to understand or work with simple mathematics (like percentages, budgets, or statistics)","zh":"缺乏基本数字能力的；不擅长理解或处理简单数学（如百分比、预算、统计）"},"examples":[{"en":"He is financially successful, but he’s surprisingly innumerate and often misreads bills.","zh":"他在财务上很成功，但数字能力却出奇地弱，经常看错账单。"},{"en":"Some people feel anxious about math and describe themselves as innumerate.","zh":"有些人对数学感到焦虑，会说自己“数字能力很差”。"}]}],"synonyms":["bad at math","number-blind","mathematically illiterate","poor with numbers"],"phonetic":"/ɪˈnuːmərət/","extraExplanation":["你输入的“inumbrate”常见是拼写错误；正确拼写通常是 **innumerate**。","**innumerate** 常用于新闻、教育、职场语境，强调“看不懂数据/不会算”的现实影响（例如被误导的统计信息、错误的预算判断等）。也常与 **illiterate（文盲）** 类比：illiterate 是读写能力差，innumerate 是数字能力差。"]}
{"word":"inumbration","summary":{"en":"Inumbration is a rare word meaning either shading/casting a shadow or (literarily) giving a faint, incomplete suggestion or outline of an idea.","zh":"Inumbration（罕用）可指“投下阴影/遮蔽”，也可指（文学用法）“对想法的隐约暗示或不完整轮廓”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of casting a shadow over something; shading or darkening.","zh":"（罕用）给某物投下阴影；遮蔽、使变暗。"},"examples":[{"en":"The tall trees created an inumbration over the path.","zh":"高大的树木在小路上投下了一片阴影。"},{"en":"In winter, the low sun and nearby buildings cause long inumbration on the street.","zh":"冬天太阳角度低，加上附近建筑物的影响，街道上会出现很长的阴影。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, literary) A faint suggestion or partial outline of an idea; an imperfect sketch or hint.","zh":"（罕用，文学）对某个想法的隐约暗示；不完整的轮廓、粗略的提示。"},"examples":[{"en":"Her early notes were only an inumbration of the final argument.","zh":"她早期的笔记只是对最终论证的粗略提示。"},{"en":"The poem gives an inumbration of grief without naming it directly.","zh":"这首诗没有直接点明“悲伤”，却隐约暗示了它。"}]}],"synonyms":["shadowing","shading","obscuring","hint","suggestion","outline"],"phonetic":"/ˌɪnʌmˈbreɪʃən/","extraExplanation":["“inumbration”常见的拼写是 **inumbration**（也可见到较少的变体拼写），来源与“shadow（阴影）”相关的拉丁词根，语感偏文学、古旧，现代英语中不常用。","很多学习者会把它和 **enumeration**（列举、枚举）混淆：两者拼写相近，但含义完全不同。若你本来想表达“列举”，更可能要用 **enumeration**。"]}
{"word":"inunct","summary":{"en":"Inunct (rare) means to anoint or smear with oil/ointment.","zh":"inunct（罕见）指用油或药膏涂抹、傅油。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To rub or smear (something) with an ointment or oil; to anoint.","zh":"（罕见/古语）用油膏或油涂抹（某物）；给……抹药；（引申）膏抹、傅油。"},"examples":[{"en":"The physician inuncted the wound with a soothing salve.","zh":"医生用舒缓的药膏涂抹伤口。"},{"en":"In older texts, priests may be described as inuncting a person with holy oil.","zh":"在较早的文本里，可能会写到神职人员用圣油为人傅油。"}]}],"synonyms":["anoint","apply ointment","smear","rub","salve"],"phonetic":"/ɪˈnʌŋkt/","extraExplanation":["“inunct”非常少见，现代英语更常用“anoint”“apply ointment”“smear”“rub (with oil/ointment)”。","词源来自拉丁语 *inungere*（涂抹、上油）。因此它常出现在医学、宗教仪式或较古典的书面语境中。","拼写上容易与“induct（使就职/引入）”混淆；两者意义无关。"]}
{"word":"inunction","summary":{"en":"Inunction means rubbing a medicinal ointment or oil onto the skin (anointing by rubbing).","zh":"inunction 指把药膏或油等通过摩擦涂抹在皮肤上的行为（敷擦、膏摩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of rubbing an ointment, oil, or medicine onto the skin; anointing by rubbing.","zh":"（把药膏、油等）涂抹在皮肤上的行为；（通过摩擦方式的）敷擦、膏摩。"},"examples":[{"en":"The doctor recommended daily inunction of the cream on the affected area.","zh":"医生建议每天把药膏涂抹在患处。"},{"en":"In some traditional treatments, inunction is used to help medicine absorb through the skin.","zh":"在一些传统疗法中，会用敷擦来帮助药物经皮吸收。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance used for rubbing on the body, especially a medicinal ointment (less common).","zh":"用于涂抹身体的物质，尤指药膏（较少用）。"},"examples":[{"en":"The nurse prepared an inunction to soothe the patient’s irritated skin.","zh":"护士准备了一种外用涂剂来缓解病人皮肤刺激。"}]}],"synonyms":["anointing","application (of ointment)","rubbing","smearing","unction"],"phonetic":"/ɪˈnʌŋkʃən/","extraExplanation":["该词多见于医学或较正式的书面语境。日常英语更常说 apply ointment/cream（涂药膏）或 rub in a cream（把乳霜揉进去）。","词源来自拉丁语 inungere（给……涂油、敷擦），与 unguent（软膏、药膏）同源。"]}
{"word":"inunctum","summary":{"en":"A rare historical/medical term for an ointment or something rubbed onto the skin; sometimes used to mean “anointed.”","zh":"一个罕见的历史/医学词，指软膏或揉擦涂在皮肤上的药物；有时也可指“已被涂抹（受膏）的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare; historical/medical) An ointment; something applied by rubbing in (an inunction).","zh":"（罕见；历史/医学用语）软膏；通过揉擦涂抹在皮肤上的东西（擦剂、擦药法所用的药膏）。"},"examples":[{"en":"The old text recommended an inunctum of mercury for certain skin diseases.","zh":"那本旧医书建议用含汞的软膏（inunctum）来治疗某些皮肤病。"},{"en":"In the museum display, jars of inunctum sat beside other apothecary remedies.","zh":"在博物馆展柜里，一罐罐软膏（inunctum）与其他药剂师的传统药品摆在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"(very rare) Anointed; smeared with ointment (used like an adjective in some older writing).","zh":"（极罕见）涂过油膏的；被抹上药膏的（在某些旧文献中可作形容词用）。"},"examples":[{"en":"The bandage was placed on the inunctum skin.","zh":"绷带敷在已涂药的皮肤上。"}]}],"synonyms":["ointment","salve","unguent","inunction"],"phonetic":"ɪˈnʌŋktəm","extraExplanation":["“inunctum”源自拉丁语，和英语里的 *inunction*（擦药法、擦剂）同源，核心意思是“涂抹、揉擦使药物渗入”。在现代英语里它非常少见，通常会用 *ointment*（软膏）或 *inunction* 来表达更自然。"]}
{"word":"inunctuosity","summary":{"en":"Inunctuosity means a lack of warmth, enthusiasm, or vividness (and sometimes literal dryness).","zh":"inunctuosity 指缺乏热情与感染力（有时也指字面上的干涩、不油润）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of enthusiasm, warmth, or emotional “fervor,” especially in speaking or writing; a dry or uninspiring quality.","zh":"（尤指说话或写作中）缺乏热情、温暖或感染力；干巴、无激励性的感觉。"},"examples":[{"en":"His lecture was accurate, but its inunctuosity made the room feel sleepy.","zh":"他的讲座很准确，但缺乏感染力，让整个房间都昏昏欲睡。"},{"en":"The novel’s inunctuosity comes from its flat dialogue and distant tone.","zh":"这部小说的乏味感来自平淡的对话和疏离的语气。"}]},{"partOfSpeech":"n.","definition":{"en":"Lack of “unction” in the literal sense: not oily or lubricated; dryness.","zh":"（字面义）缺少油脂或润滑；干涩。"},"examples":[{"en":"The mixture’s inunctuosity made it hard to spread evenly.","zh":"这份混合物因为不够油润，很难均匀涂开。"}]}],"synonyms":["dryness","dullness","flatness","coldness","lack of enthusiasm","uninspiredness"],"phonetic":"/ˌɪnʌŋkˈtuːəsɪti/","extraExplanation":["这个词非常罕见，多见于较老或较学术的英语文本。它由 in-（否定）+ unctuosity（油润；热情、感染力）构成。","unctuosity 的比喻义与宗教/修辞传统有关：unction 原指“涂油/膏抹”（也可引申为“带着虔敬与热忱的表达”），所以 inunctuosity 常用来批评讲话或文字“干、冷、没劲”。"]}
{"word":"inunctuous","summary":{"en":"Unctuous means either “oily/rich in texture” (often food) or, more commonly, “overly flattering and insincere” in speech or behavior.","zh":"Unctuous 既可指“油润浓郁的（口感/质地）”，更常指“过分奉承、圆滑而不真诚的（言行）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of speech, writing, or behavior) too smooth, flattering, or polite in a way that feels insincere; oily.","zh":"（指言语、文章或行为）过分圆滑、奉承，显得不真诚；油腔滑调的。"},"examples":[{"en":"His unctuous compliments made everyone uncomfortable.","zh":"他那种油腔滑调的恭维让大家都觉得不舒服。"},{"en":"The unctuous apology sounded more like public relations than real regret.","zh":"那段虚情假意的道歉听起来更像公关话术，而不是真心悔意。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a smooth, oily, or greasy texture; rich and fatty (often about food).","zh":"（质地）光滑油润的；油腻的、肥厚的（常用于食物）。"},"examples":[{"en":"The sauce was unctuous and buttery.","zh":"这酱汁油润浓郁，带着黄油的香气。"},{"en":"Some people love the unctuous texture of slow-cooked pork.","zh":"有些人很喜欢慢炖猪肉那种肥厚油润的口感。"}]}],"synonyms":["oily","smarmy","slick","obsequious","ingratiating","buttery"],"phonetic":"/ˈʌŋk.tʃu.əs/","extraExplanation":["你输入的 **inunctuous** 通常是拼写错误；标准拼写是 **unctuous**。","词源来自拉丁语 *unguentum*（药膏、油膏），所以它既能形容“油润的质地”，也引申为“说话像抹了油一样滑、过分奉承而不真诚”。","在文学或评论中，**unctuous** 常用来批评某人的“假客气/假关心”，语气偏负面。"]}
{"word":"inundable","summary":{"en":"“Inundable” means floodable or likely to be flooded, and sometimes figuratively ‘easy to be overwhelmed.’","zh":"“inundable”指“可被淹没的/易受洪水侵袭的”，也可引申为“容易被大量事物压倒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be flooded; likely to be covered with water.","zh":"可被淹没的；易受洪水侵袭的。"},"examples":[{"en":"The village sits on inundable land near the river.","zh":"这个村庄位于河边易被淹没的土地上。"},{"en":"They avoid building houses in inundable areas during the rainy season.","zh":"雨季他们会避免在易受淹的地区建房。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Likely to be overwhelmed by a large amount of something (such as requests, messages, or emotions).","zh":"（引申）容易被大量事物“淹没/压垮”的（如请求、信息或情绪）。"},"examples":[{"en":"After the announcement, the office was inundable with emails.","zh":"公告发布后，办公室可能会被大量邮件“淹没”。"},{"en":"New teachers can feel inundable with paperwork at first.","zh":"新老师一开始可能会被大量文书工作压得喘不过气。"}]}],"synonyms":["flood-prone","floodable","liable to flooding","susceptible to flooding","overwhelmable"],"phonetic":"/ɪˈnʌn.də.bəl/","extraExplanation":["“inundable”在现代英语里相对少见，更常见的是用“flood-prone”（易洪涝的）、“floodable”（可被淹的）或直接说“liable to flooding”。在写作中用“inundable”会显得更偏正式/书面。","词源上来自拉丁语“inundare”（淹没、泛滥），与常见动词“inundate”（使淹没；使大量涌入）同源。日常表达里更常用“be inundated with + 名词”（被……淹没/充斥）。"]}
{"word":"inundant","summary":{"en":"Inundate means to flood with water or to overwhelm with a large amount of something (like messages or work).","zh":"inundate 指“洪水般淹没”（字面水淹），也可比喻“使大量涌来而不堪承受”（如信息、工作）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually passive) To cover or flood an area with a large amount of water.","zh":"（常用被动）用大量的水淹没；使泛滥。"},"examples":[{"en":"After the hurricane, the town was inundated with seawater.","zh":"飓风过后，小镇被海水淹没了。"},{"en":"Heavy rains inundated the rice fields.","zh":"暴雨淹没了稻田。"}]},{"partOfSpeech":"vt.","definition":{"en":"To overwhelm someone or something with a very large amount of things (messages, work, requests, information, etc.).","zh":"（比喻）使不堪承受；使应接不暇（如信息、工作、请求等大量涌来）。"},"examples":[{"en":"Customer service was inundated with complaints after the update.","zh":"更新后，客服被投诉淹没了。"},{"en":"I’ve been inundated with emails all morning.","zh":"我整个上午都被邮件轰炸得应接不暇。"}]},{"partOfSpeech":"vi.","definition":{"en":"To flood; to arrive in great numbers (often used with “with”).","zh":"泛滥；大量涌入（常与 with 连用）。"},"examples":[{"en":"During the sale, shoppers inundated the website.","zh":"促销期间，购物者大量涌入该网站。"},{"en":"The office was inundated with new applications.","zh":"办公室收到了大量新申请。"}]}],"synonyms":["flood","overwhelm","swamp","deluge","engulf"],"phonetic":"/ˈɪnənˌdeɪt/","extraExplanation":["你输入的 “inundant” 常见是拼写错误；正确词通常是 **inundate**（动词）。另一个相关词是形容词 **inundated**（被淹没的/被大量信息淹没的）。","词源提示：**inundate** 来自拉丁语 *inundare*，与 *unda*（波浪）相关，所以既可指“水淹”，也常用作比喻“信息/工作像洪水一样涌来”。"]}
{"word":"inundate","summary":{"en":"Inundate means to flood an area with water or, figuratively, to overwhelm someone with too many things at once.","zh":"inundate 指用大量水淹没，也可引申为大量信息/工作等涌来使人不堪承受。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To flood a place with a large amount of water.","zh":"（大量的水）淹没、泛滥。"},"examples":[{"en":"After days of heavy rain, the river inundated nearby towns.","zh":"连续几天大雨后，河水淹没了附近的城镇。"},{"en":"The storm surge inundated the coastal roads.","zh":"风暴潮淹没了沿海公路。"}]},{"partOfSpeech":"vt.","definition":{"en":"To overwhelm someone with a lot of things at once (messages, requests, work, information).","zh":"（用大量事物）使不堪承受；铺天盖地地涌来（如信息、请求、工作）。"},"examples":[{"en":"Customer service was inundated with calls after the outage.","zh":"停电之后，客服被大量来电淹没。"},{"en":"She felt inundated with emails on Monday morning.","zh":"周一早上她觉得邮件多得让人喘不过气。"},{"en":"New learners are often inundated with unfamiliar vocabulary at first.","zh":"初学者一开始常常会被大量陌生词汇“淹没”。"}]}],"synonyms":["flood","swamp","overwhelm","deluge"],"phonetic":"ˈɪnənˌdeɪt","extraExplanation":["“inundate”比“flood”更正式，常用于新闻报道、学术写作，既可指真实洪水，也常用作比喻（信息、请求、任务像洪水一样涌来）。","词源来自拉丁语，含义与“wave/overflow（涌出、漫过）”相关，因此自带“来势很猛、量很大”的语感。","常见搭配：be inundated with + 名词（be inundated with emails/questions/orders）。","写作区分：flood 更口语；inundate 更书面、更强调“压倒性数量”。"]}
{"word":"inundated","summary":{"en":"Inundated means flooded with water or overwhelmed with too much of something.","zh":"inundated 表示被洪水淹没，或引申为被大量事物淹没、应接不暇。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often passive) Flooded or covered with a lot of water.","zh":"（常用被动）被大量水淹没；被洪水覆盖。"},"examples":[{"en":"After the storm, the streets were inundated with water.","zh":"暴风雨过后，街道被水淹没了。"},{"en":"Several homes were inundated when the river rose quickly.","zh":"河水迅速上涨时，有几户人家被淹了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often passive) Overwhelmed with a large amount of things (emails, requests, information, work).","zh":"（常用被动）被大量事物（邮件、请求、信息、工作等）淹没；应接不暇。"},"examples":[{"en":"I’ve been inundated with emails all week.","zh":"我这周一直被邮件淹没。"},{"en":"The customer service team was inundated with complaints after the update.","zh":"更新之后，客服团队被投诉淹没了。"},{"en":"New parents can feel inundated with advice from everyone.","zh":"新手父母可能会觉得被各种建议包围，难以招架。"}]}],"synonyms":["flooded","swamped","overwhelmed","deluged"],"phonetic":"/ˈɪnənˌdeɪtɪd/","extraExplanation":["inundated 来自动词 inundate（使淹没/使泛滥；也可引申为“使应接不暇”）。在新闻里常见于自然灾害语境（flooding），在职场或日常中常用来形容信息量或任务量过大。","常见搭配：be inundated with + 名词（emails / requests / information / calls / complaints）。语气比 “very busy” 更强，强调“数量多到让人难以处理”。"]}
{"word":"inundates","summary":{"en":"“Inundates” means “floods” or “overwhelms with a large amount,” often used for water or for too much information/work.","zh":"“inundates”表示“淹没、泛滥”，也可比喻“大量涌来使人不堪承受”，常用于洪水或信息/工作量等。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to flood or cover with a large amount of water (or another liquid)","zh":"（水或其他液体）淹没；漫过"},"examples":[{"en":"Heavy rain inundated the streets overnight.","zh":"大雨一夜之间淹没了街道。"},{"en":"The storm surge inundated coastal homes.","zh":"风暴潮淹没了沿海的房屋。"}]},{"partOfSpeech":"v.","definition":{"en":"to overwhelm someone or something with a large amount of things (information, messages, requests, etc.)","zh":"（大量信息/消息/请求等）使不堪承受；淹没式涌来"},"examples":[{"en":"After the video went viral, she was inundated with emails.","zh":"视频爆红后，她收到了海量邮件，忙不过来。"},{"en":"Try not to inundate new students with too many rules on the first day.","zh":"第一天尽量不要用太多规定把新生“轰炸”得喘不过气。"}]}],"synonyms":["flood","swamp","overwhelm","deluge","submerge"],"phonetic":"/ˈɪnənˌdeɪts/","extraExplanation":["“inundate”既可指真实的“洪水淹没”，也常用于比喻：像洪水一样“信息/工作量涌来”。学习时可以把它和“overwhelm（压垮）”联想在一起，但“inundate”更强调“数量很多、来势很猛”。","形式说明：你输入的“inundates”是第三人称单数现在时（he/she/it inundates）。常见时态：inundate / inundated / inundating。"]}
{"word":"inundating","summary":{"en":"Inundating means flooding with water or overwhelming with too much of something (often used figuratively for emails, requests, information, etc.).","zh":"inundating 指（被）洪水淹没；也常作比喻，指（被）大量信息、请求等“淹没/充斥”，多到难以应付。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Flooding (covering an area with a large amount of water), or causing something to be overwhelmed by too much of something.","zh":"（水）泛滥、淹没；也可指用大量事物“淹没/充斥”某人或某处，使其不堪承受。"},"examples":[{"en":"The river was inundating nearby fields after days of heavy rain.","zh":"连续几天大雨后，河水正在淹没附近的田地。"},{"en":"During the sale, customer service was inundating with emails and calls.","zh":"促销期间，客服被大量邮件和电话“淹没”了。"},{"en":"Social media can feel inundating when you try to keep up with everything.","zh":"当你试图跟上所有信息时，社交媒体会让人感觉信息量大到“压得喘不过气”。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “inundate”: to flood an area or overwhelm someone/something with a very large amount.","zh":"“inundate”的现在分词：使（某地）被水淹没；或以大量事物使（人/事）应接不暇。"},"examples":[{"en":"The storm is inundating the coastline.","zh":"暴风雨正在淹没海岸线。"},{"en":"News about the event kept inundating my inbox.","zh":"关于那场活动的消息不断涌进我的收件箱。"}]}],"synonyms":["flooding","swamping","overwhelming","engulfing","deluging"],"phonetic":"/ˈɪnənˌdeɪtɪŋ/","extraExplanation":["“inundate”源自拉丁语，原义与“波浪涌上来”有关，所以既可用于真实的洪水，也常用于比喻：信息、请求、工作量、情绪等“像洪水一样涌来”。","常见搭配：be inundated with + 名词（被……淹没/充斥）；inundate someone with questions/emails/requests（用大量问题/邮件/请求让某人应接不暇）。","语气通常比“many/a lot”更强，带有“多到令人吃不消、难以处理”的感觉。"]}
{"word":"inundation","summary":{"en":"Inundation means a flood or an overwhelming amount of something arriving at once.","zh":"inundation 指“洪水/淹没”，也可比喻“某事物大量涌来、应接不暇”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flood; an overflowing of water that covers land that is usually dry.","zh":"洪水；（通常干燥的土地被水）淹没、泛滥。"},"examples":[{"en":"After days of heavy rain, the town faced an inundation that covered roads and homes.","zh":"连续几天暴雨后，小镇遭遇洪水，道路和房屋都被淹了。"},{"en":"The river’s inundation forced residents to evacuate to higher ground.","zh":"河水泛滥迫使居民撤离到更高的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation in which you receive or experience too much of something (information, messages, requests, etc.).","zh":"（信息、消息、请求等的）大量涌来；应接不暇。"},"examples":[{"en":"The support team got an inundation of emails after the website went down.","zh":"网站宕机后，客服团队收到了大量邮件，忙得不可开交。"},{"en":"Students can feel overwhelmed by an inundation of notifications.","zh":"学生可能会被铺天盖地的通知弄得不堪重负。"}]}],"synonyms":["flood","deluge","overflow","torrent","onslaught"],"phonetic":"ˌɪnənˈdeɪʃən","extraExplanation":["词源上来自拉丁语 in-（进入）+ unda（波浪、水），核心意象是“水波涌入”。因此它既可指真实的洪水，也常用来比喻“（像洪水一样）大量涌来”的信息或任务。","常见搭配：an inundation of emails/messages/requests（大量邮件/消息/请求）；be inundated with…（被……淹没、被……淹得应接不暇）。"]}
{"word":"inundations","summary":{"en":"“Inundations” means floods or, figuratively, an overwhelming influx of things.","zh":"“inundations”指洪水、淹水，也可比喻（信息、请求等）大量涌入。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Floods; times when water covers land that is usually dry (often after heavy rain or storms).","zh":"洪水；淹水（常指暴雨或风暴后水覆盖原本干燥的土地）。"},"examples":[{"en":"After days of rain, the town faced severe inundations.","zh":"连下了几天雨后，这个小镇遭遇了严重的洪水。"},{"en":"Coastal inundations are becoming more common during stronger storms.","zh":"随着风暴更强，沿海地区的淹水变得更常见。"}]},{"partOfSpeech":"n.","definition":{"en":"Overwhelming amounts of things (such as emails, requests, or information) arriving at once.","zh":"（事物的）涌入、蜂拥而至（如邮件、请求或信息一下子大量到来）。"},"examples":[{"en":"After the announcement, we received an inundation of questions.","zh":"公告发布后，我们一下子收到了大量问题。"},{"en":"She felt an inundation of messages as soon as she turned on her phone.","zh":"她一打开手机，就感觉消息蜂拥而至。"}]}],"synonyms":["floods","deluges","overflows","surges","influxes"],"phonetic":"/ˌɪn.ənˈdeɪ.ʃənz/","extraExplanation":["“inundations”是名词复数，单数是“inundation”。它来自拉丁语词根，含有“淹没、漫过”的画面感，因此既可用于真实的洪水，也常用于比喻“数量多到让人招架不住”。","常见搭配：an inundation of + 名词（an inundation of emails/questions/complaints）。写作中用它比“a lot of”更正式、更有冲击力。"]}
{"word":"inundator","summary":{"en":"An inundator is a person or thing that floods an area or overwhelms others with too much of something.","zh":"Inundator 指使某地被淹没的人或事物，也可比喻用大量信息等让人应接不暇的来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that inundates (floods) an area with water","zh":"使某地被洪水淹没的人或事物；（造成）洪水泛滥者"},"examples":[{"en":"The broken levee became an inundator, sending water into nearby neighborhoods.","zh":"决堤的堤坝成了“淹没者”，把水冲进了附近的社区。"},{"en":"After days of heavy rain, the river turned into an inundator of the valley.","zh":"连下几天大雨后，这条河成了山谷的“淹没者”。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) someone or something that overwhelms people with a large amount of something (such as messages, complaints, or information)","zh":"（比喻）用大量事物（如信息、消息、投诉等）淹没、压倒他人的人或事物"},"examples":[{"en":"During the crisis, social media became an inundator of rumors and half-truths.","zh":"危机期间，社交媒体成了谣言和半真半假的信息的“淹没者”。"},{"en":"His inbox was an inundator of requests after the announcement.","zh":"公告发布后，他的收件箱被请求“淹没”了。"}]}],"synonyms":["flooder","overwhelmer","deluger","source of flooding","torrent"],"phonetic":"/ˈɪnənˌdeɪtər/","extraExplanation":["“inundator”在现代英语中比较少见，更常用的是动词“inundate”（淹没；使应接不暇）或名词“flood / flooding”。写作时用“inundator”会显得偏正式或刻意文学化。","构词上：inundate + -or（表示“做某事的人/物”），类似：educate → educator，decorate → decorator。"]}
{"word":"inundatory","summary":{"en":"“Inundatory” means flood-causing or flood-prone (rare, formal).","zh":"“inundatory”意为“引发洪水的/易发生洪水的”（少见、较正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing or tending to cause flooding; overflowing with water (rare, formal).","zh":"引起或容易引起洪水的；泛滥的（少见、较正式）。"},"examples":[{"en":"After days of rain, the river became an inundatory force that covered nearby fields.","zh":"连日降雨后，河水变成了引发洪水的力量，淹没了附近的田地。"},{"en":"The report warned that the low-lying district is inundatory during hurricane season.","zh":"报告警告说，这片低洼地区在飓风季节容易发生洪水。"}]}],"synonyms":["flooding","flood-prone","inundating","overflowing"],"phonetic":"/ˈɪnənˌdeɪtɔri/","extraExplanation":["“inundatory”是比较少见的书面词，常见替代表达包括：flooding（会淹水的）、flood-prone（易受洪水影响的）、inundating（正在淹没的）。","词根关联：来自拉丁语 inundare（泛滥、淹没），与常用词 inundate（淹没；使不胜负荷）同源。写作中更常用 inundated（被淹没/被信息淹没）或 inundation（洪水；泛滥）。"]}
{"word":"inunderstandable","summary":{"en":"“Inunderstandable” is not standard spelling; the usual word is “ununderstandable” (informal) or “incomprehensible/unintelligible” (more natural).","zh":"“inunderstandable” 不是标准拼写；常用说法是 “ununderstandable”（较口语）或更自然的 “incomprehensible / unintelligible”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be understood; unclear in meaning (common in casual use, but not the standard/formal word).","zh":"难以理解的；意思不清楚的（口语中有人用，但不算最标准/正式的说法）。"},"examples":[{"en":"His explanation was ununderstandable, so I asked him to say it again more slowly.","zh":"他的解释让人听不懂，所以我请他再慢一点说一遍。"},{"en":"The handwriting was so messy that the note was ununderstandable.","zh":"字迹太潦草了，这张便条根本看不懂。"}]}],"synonyms":["incomprehensible","unintelligible","confusing","unclear","hard to understand"],"phonetic":"/ˌʌnˌʌn.dɚˈstæn.də.bəl/","extraExplanation":["你输入的 **inunderstandable** 一般被视为拼写错误。英语里更常见的表达是：**ununderstandable**（不太正式/不推荐作正式写作）、**incomprehensible**（更正式）、**unintelligible**（听不清/难辨认，常用于语言、口音、录音、字迹）。","前缀对比：**un-** 常表示“否定”（unhappy），而 **in-** 也可否定但通常跟拉丁来源词搭配（incomplete）。因此 *inunderstandable* 不符合常见构词习惯。"]}
{"word":"inunderstanding","summary":{"en":"“inunderstanding” is not standard; it’s usually “understanding” or the phrase “in understanding / in our understanding.”","zh":"“inunderstanding”不是标准写法；通常应写“understanding”，或短语“in understanding / in our understanding（按我们的理解）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Likely a misspelling. In standard English, people usually write either “understanding” (the noun) or the phrase “in understanding” / “in our understanding.”","zh":"（非标准用法）很可能是拼写错误。标准英语里通常写成名词“understanding（理解）”，或写成短语“in understanding / in our understanding（在……的理解中）”。"},"examples":[{"en":"This sentence sounds incorrect: “Inunderstanding the problem is hard.”","zh":"这句话听起来不对：“Inunderstanding the problem is hard.”"},{"en":"Better: “Understanding the problem is hard.”","zh":"更自然：“Understanding the problem is hard.”"},{"en":"Also possible: “In our understanding, this approach is safer.”","zh":"也可以：“In our understanding, this approach is safer.”"}]},{"partOfSpeech":"phrase","definition":{"en":"“in understanding” (phrase): used to mean “regarding understanding” or “as we understand it,” often in formal writing.","zh":"“in understanding”（短语）：表示“就理解而言 / 按我们的理解”，多见于较正式的表达。"},"examples":[{"en":"In understanding cultural differences, patience matters.","zh":"在理解文化差异方面，耐心很重要。"},{"en":"There is progress in understanding how memory works.","zh":"在理解记忆如何运作方面已经有进展。"}]}],"synonyms":["understanding","comprehension","in our view","as we understand it"],"phonetic":"/ɪn ˌʌndɚˈstændɪŋ/","extraExplanation":["“inunderstanding”本身不算常见或被认可的英语单词；如果你是在论文/报告里看到，多半是排版把“in understanding”连在一起了，或是拼写错误。","如果你想表达“理解（能力/状态）”，用名词 understanding：e.g., “a deeper understanding of history（对历史更深的理解）”。","如果你愿意，把你看到“inunderstanding”的完整句子贴出来，我可以帮你判断原意该用哪一种写法。"]}
{"word":"Inupiaq","summary":{"en":"Inupiaq refers to an Indigenous people of northern Alaska, their language, and anything related to their culture.","zh":"Inupiaq 指阿拉斯加北部的因纽皮亚特原住民、他们的语言（因纽皮亚克语），以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous Arctic people of northern and northwestern Alaska (also written Iñupiaq; plural: Iñupiat)","zh":"（阿拉斯加北部与西北部的）因纽皮亚特人；因纽皮亚克族人（亦写作 Iñupiaq；复数 Iñupiat）"},"examples":[{"en":"Many Inupiaq communities live along Alaska’s northern coast.","zh":"许多因纽皮亚克社区生活在阿拉斯加北部海岸一带。"},{"en":"She is Inupiaq and grew up hearing traditional stories from her grandparents.","zh":"她是因纽皮亚克族，从小听祖父母讲传统故事长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Inuit language (or group of dialects) traditionally spoken by the Inupiaq people in Alaska","zh":"因纽皮亚克语（因纽皮亚特人在阿拉斯加传统使用的因纽特语支语言/方言群）"},"examples":[{"en":"He is learning Inupiaq to speak with elders in his village.","zh":"他在学因纽皮亚克语，以便和村里的长者交流。"},{"en":"The school offers an Inupiaq language class.","zh":"这所学校开设因纽皮亚克语课程。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Inupiaq people or their language and culture","zh":"因纽皮亚克族（人）、语言或文化的"},"examples":[{"en":"They hosted an Inupiaq cultural event featuring dance and drumming.","zh":"他们举办了一场因纽皮亚克文化活动，有舞蹈和鼓乐表演。"},{"en":"The museum has an Inupiaq exhibit about life in the Arctic.","zh":"博物馆有一个因纽皮亚克展区，介绍北极地区的生活。"}]}],"synonyms":["Iñupiaq","Inupiat (plural)","Inuit (broader term)"],"phonetic":"/iˈnuːpiˌæk/","extraExplanation":["“Inupiaq/Iñupiaq”和“Inupiat”常让学习者混淆：一般来说，Iñupiaq 多作单数（一个人）或作形容词/语言名；Inupiat 常作复数（一群人）。","在书写中常见字母“ñ”（Iñupiaq）是较准确的拼写，但在英文日常文本里也常简写为 Inupiaq。"]}
{"word":"inurbane","summary":{"en":"Inurbane means not polite or not socially refined—rude, lacking urbane manners.","zh":"inurbane 意为“不礼貌、缺乏风度”，偏书面，用来形容言行粗鲁或不够文雅。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not polite or socially refined; rude or lacking good manners (often in speech or behavior).","zh":"不礼貌的；粗鲁的；缺乏社交修养的（常指言谈或举止）。"},"examples":[{"en":"It was inurbane of him to interrupt her in the middle of the meeting.","zh":"他在会议中途打断她说话，这种行为很不礼貌。"},{"en":"Her inurbane comments made the guests uncomfortable.","zh":"她那些粗鲁的评论让客人们很不自在。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not characteristic of a city or of urban sophistication; uncultured or unsophisticated.","zh":"不具城市气质或都市老练的；不够文雅、显得土气的。"},"examples":[{"en":"He worried his accent sounded inurbane at the formal dinner.","zh":"他担心自己的口音在正式晚宴上听起来不够文雅。"}]}],"synonyms":["impolite","rude","uncivil","boorish","churlish","ungracious"],"phonetic":"/ˌɪnɝˈbeɪn/","extraExplanation":["词源上，inurbane = in-（否定）+ urbane（温文尔雅、老练的）。urbane 来自拉丁语 urbanus（“城市的”），所以这个词既可指“没礼貌”，也可带有“缺乏都市风度/不够文雅”的含义。","语体提示：inurbane 比 rude 更书面、更含蓄，常用于批评某人的“失礼/欠缺风度”，而不是直接骂人。","近义词细微差别：impolite（一般不礼貌）、uncivil（不文明、欠礼）、boorish（粗鲁没教养，语气更重）、churlish（脾气坏、无礼）。"]}
{"word":"inurbanely","summary":{"en":"“Inurbanely” means “rudely or impolitely; not in a civilized, refined manner.”","zh":"“inurbanely”表示“无礼地、粗鲁地；不文明、不文雅地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rude, impolite, or uncivil way; without courtesy or refined manners.","zh":"无礼地；不礼貌地；粗鲁地（缺乏礼貌或教养地）。"},"examples":[{"en":"He replied inurbanely, ignoring her question and walking away.","zh":"他无礼地回答，连她的问题都不理就走开了。"},{"en":"The customer spoke inurbanely to the staff, which made everyone uncomfortable.","zh":"那位顾客对员工说话很粗鲁，让大家都很不舒服。"}]}],"synonyms":["rudely","impolitely","uncivilly","discourteously","gruffly"],"phonetic":"/ɪnˈɝːbeɪnli/","extraExplanation":["“inurbanely”来自形容词“inurbane”（粗鲁的、不文雅的），其反义词是“urbane”（文雅的、彬彬有礼的）。词根与“urban（城市的）”同源，早期含义与“城市生活带来的礼仪与修养”相关；因此“urbane”带有“有教养、谈吐得体”的感觉，而“inurbanely”就是“反其道而行之”。","这个词比较正式、偏书面语。日常口语里更常说“rudely / impolitely”。"]}
{"word":"inurbaneness","summary":{"en":"Inurbaneness means rudeness or a lack of politeness, especially in a formal or literary style.","zh":"inurbaneness 指无礼或缺乏礼貌，语体较正式、偏书面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rudeness or lack of politeness; an unrefined or discourteous manner.","zh":"无礼；缺乏礼貌；举止粗鲁、不得体。"},"examples":[{"en":"His inurbaneness during the meeting offended several colleagues.","zh":"他在会议上的无礼冒犯了好几位同事。"},{"en":"Please address the complaint without inurbaneness.","zh":"请在处理投诉时避免无礼的言辞和态度。"}]}],"synonyms":["rudeness","impoliteness","discourtesy","incivility"],"phonetic":"/ˌɪnˈɝːbənnəs/","extraExplanation":["“inurbaneness”较为少见、偏正式，多见于书面语或较旧的文风中。","词源上可理解为 in-（否定前缀，“不、非”）+ urbane（有教养的、彬彬有礼的）+ -ness（名词后缀，“性质/状态”），字面意思就是“缺乏彬彬有礼的状态”。","在现代英语里更常用的近义表达是 “rudeness / impoliteness / discourtesy”。"]}
{"word":"inurbanity","summary":{"en":"Inurbanity means rudeness or a lack of politeness (a formal word).","zh":"inurbanity 指“无礼、缺乏礼貌”，属于较正式的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rudeness or lack of politeness; an uncivil or impolite manner (formal).","zh":"无礼；缺乏礼貌；粗鲁的举止（较正式用语）。"},"examples":[{"en":"The reviewer criticized the host’s inurbanity toward the guests.","zh":"评论者批评主持人对客人缺乏礼貌。"},{"en":"A single sharp remark can be taken as inurbanity in a tense meeting.","zh":"在紧张的会议中，一句尖刻的话就可能被视为无礼。"},{"en":"She apologized for her inurbanity and tried to speak more calmly.","zh":"她为自己的失礼道歉，并努力更平和地说话。"}]}],"synonyms":["rudeness","impoliteness","discourtesy","incivility","boorishness"],"phonetic":"/ˌɪnɝˈbænɪti/","extraExplanation":["“inurbanity”较少见、偏书面，常用于批评某人的言行不够得体。","词源上由否定前缀 in-（不）+ urbanity（文雅、礼貌）构成；urbanity 来自拉丁语 urbanus（城市的、文雅的），传统观念里“城市礼仪”与“得体谈吐”相关。","近义词里更常用的日常表达包括 rudeness / impoliteness / discourtesy。"]}
{"word":"inure","summary":{"en":"Inure means to become (or make someone) accustomed to something unpleasant or difficult, often in the phrase “be inured to.”","zh":"Inure 指（自己或使他人）对不愉快或困难的事物逐渐习惯，常见用法是 “be inured to…”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to become used to something unpleasant or unfamiliar; to get accustomed (often used with “to”).","zh":"（对不愉快或陌生的事物）逐渐习惯；适应（常与 to 连用）。"},"examples":[{"en":"New interns quickly become inured to long hours during busy season.","zh":"新来的实习生在旺季很快就习惯了长时间工作。"},{"en":"After a few weeks, she was inured to the cold mornings.","zh":"几周之后，她已经习惯了寒冷的清晨。"},{"en":"It’s easy to become inured to bad news if you see it every day.","zh":"如果每天都看到坏消息，人很容易变得麻木、习以为常。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone used to something difficult or unpleasant (often used in the passive: “be inured to”).","zh":"使某人习惯于（艰难或不愉快的事物）（常用被动：be inured to）。"},"examples":[{"en":"He was inured to criticism after years in the public eye.","zh":"在公众视线下多年后，他对批评已经习以为常。"},{"en":"The training is meant to inure recruits to stress.","zh":"这项训练旨在让新兵适应压力。"}]}],"synonyms":["become accustomed to","get used to","be habituated to","harden (to)","be desensitized to"],"phonetic":"/ɪˈnjʊr/","extraExplanation":["“inure”较正式，日常更常用“get used to / become accustomed to / be used to”。","常见搭配：be inured to + 名词/动名词（如 be inured to pain/pressure/criticism）。","语感上常带有“因长期接触而变得不再敏感/不再受影响”的意味，接近“麻木”。"]}
{"word":"inured","summary":{"en":"Inured means accustomed to something unpleasant or difficult; it can also mean making someone get used to hardship.","zh":"inured 指“对艰难/不愉快的事习以为常”，也可指“使某人适应艰苦”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Accustomed to something unpleasant or difficult, so it no longer strongly affects you.","zh":"习惯于（不愉快或艰难的事），以至于不再受强烈影响。"},"examples":[{"en":"After years of night shifts, she became inured to irregular sleep.","zh":"在多年上夜班后，她已经习惯了不规律的睡眠。"},{"en":"People living near the airport can become inured to the noise.","zh":"住在机场附近的人可能会渐渐习惯噪音。"},{"en":"He was inured to criticism after working in politics.","zh":"在政界工作后，他对批评已经习以为常。"}]},{"partOfSpeech":"v.","definition":{"en":"(Often in the form “inure someone to something”) To make someone accustomed to something, especially hardship or discomfort.","zh":"（常用“inure someone to something”）使某人习惯于某事，尤指艰苦或不适。"},"examples":[{"en":"The training inured them to cold weather and long marches.","zh":"训练使他们适应了寒冷天气和长途行军。"},{"en":"Growing up with strict rules inured him to self-discipline.","zh":"在严格的规则下长大，使他习惯了自律。"}]}],"synonyms":["accustomed","used to","hardened","seasoned","desensitized"],"phonetic":"/ɪˈnʊrd/","extraExplanation":["“inured”常见于较正式的书面语，尤其搭配介词“to”：be inured to sth（对……已习惯/不再敏感）。它通常强调对不愉快事物的“麻木/适应”，语气比“used to”更偏向经历过一段时间的磨炼。","常见近义表达差别：“accustomed to”较中性；“hardened to”更强调变得冷硬、情感上不易受触动；“desensitized to”更偏心理或生理上的“脱敏”。"]}
{"word":"inuredness","summary":{"en":"Inuredness means being used to something, especially hardship, so it no longer affects you as strongly.","zh":"Inuredness 指对某事（尤指艰难或不愉快的事）已经习惯、耐受，因而不再那么受影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being accustomed to something, especially something unpleasant or difficult","zh":"习惯于（尤指不愉快或艰难的事）的状态；麻木感；耐受性"},"examples":[{"en":"Years of night shifts gave her a kind of inuredness to fatigue.","zh":"多年的夜班让她对疲劳产生了一种“习惯了”的麻木感。"},{"en":"His inuredness to criticism made him calm during tense meetings.","zh":"他对批评的习惯与耐受，让他在紧张的会议上也很冷静。"},{"en":"The team’s inuredness to pressure came from constant practice and tough games.","zh":"球队对压力的耐受来自持续训练和艰难比赛。"}]}],"synonyms":["hardiness","toughness","habituation","resilience","immunity (figurative)"],"phonetic":"/ɪˈnjʊrdnəs/","extraExplanation":["“inuredness”来自动词“inure”（使习惯/使适应），常见搭配是“be inured to + 名词/动名词”（对……已经习惯）。这个名词较正式、较少见；日常表达更常用“being used to… / accustomedness / habituation”。","语气上，“inuredness”常带有“长期经历后变得不再敏感、甚至有点麻木”的含义，尤其用于艰苦环境、痛苦、批评或压力等语境。"]}
{"word":"inurement","summary":{"en":"Inurement means becoming used to hardship, or (in legal English) something taking effect for someone’s benefit.","zh":"inurement 指逐渐习惯艰难不快之事；在法律语境中指某事生效并归某人受益。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of becoming used to something unpleasant or difficult; habituation.","zh":"（对不愉快或艰难事物的）习惯；逐渐适应。"},"examples":[{"en":"Over time, her inurement to public criticism made her less anxious.","zh":"随着时间推移，她逐渐习惯了公众的批评，因此不那么焦虑了。"},{"en":"Inurement to long winters is common in northern communities.","zh":"在北方社区，人们普遍会逐渐适应漫长的冬季。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law) The act of taking effect or being applied to someone’s benefit (often used in the phrase “inure to the benefit of”).","zh":"（法律）生效并使某人受益；归于……之利（常见于短语“inure to the benefit of”）。"},"examples":[{"en":"Any refunds will inure to the benefit of the customer.","zh":"任何退款都将归客户受益。"},{"en":"The agreement states that certain rights inure to the heirs.","zh":"协议规定某些权利归继承人受益。"}]}],"synonyms":["habituation","adaptation","acclimation","desensitization","benefit (legal sense)"],"phonetic":"/ɪˈnʊrmənt/","extraExplanation":["“inurement”来自动词“inure”（使习惯；使生效并有利于）。日常英语里更常用“inure / be inured to + 名词”表达“对……习惯了”。名词形式“inurement”较正式，尤其在法律文本中更常见。","常见搭配：\n- inurement to hardship/criticism（对艰难/批评的习惯）\n- inure to the benefit of sb（归某人之利；对某人有利）"]}
{"word":"inurements","summary":{"en":"Inurement means (1) a resulting benefit (often legal/formal), or (2) the process of becoming used to something.","zh":"Inurement 指（1）（常见于法律/正式语境）由某事带来的利益/收益，或（2）逐渐习惯、适应某事的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often legal or formal) A benefit, advantage, or profit that results from something.","zh":"（常用于法律或正式语境）由某事带来的利益、好处或收益。"},"examples":[{"en":"Any tax savings will be an inurement to the company.","zh":"任何税收节省都将成为该公司的收益（利益）。"},{"en":"The contract states that the rights and benefits are an inurement to the heirs.","zh":"合同规定这些权利与利益将归继承人享有（构成对继承人的利益）。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of becoming used to something unpleasant; acclimatization.","zh":"对不愉快事物逐渐习惯的过程；适应。"},"examples":[{"en":"Through repeated practice, his inurement to criticism grew.","zh":"通过反复练习，他逐渐习惯了批评。"},{"en":"Living abroad led to her inurement to a different pace of life.","zh":"在国外生活使她适应了不同的生活节奏。"}]}],"synonyms":["benefit","advantage","gain","profit","acclimatization","habituation"],"phonetic":"/ɪnˈjʊrmənt/","extraExplanation":["“inurements”更常见的词形是单数“inurement”或复数“inurements”。这个词来自动词“inure”（使习惯；使生效/使归于某方），在合同、遗嘱、公司章程等法律文本中很常见，意思多偏向“利益/收益归属于……”。","注意不要和“enrollment（注册）”“endowment（捐赠基金）”混淆。法律语境里常见搭配：“inure to the benefit of …”（利益归……；对……有利）。"]}
{"word":"inures","summary":{"en":"“Inures” (from “inure”) means “makes someone used to something,” or in formal/legal English, “takes effect/benefits someone.”","zh":"“inures”（来自 inure）意为“使某人习惯/适应某事”，在正式/法律语境中也可指“生效并使某人受益”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone become used to something unpleasant, difficult, or unfamiliar (often: “inure someone to”).","zh":"使（某人）习惯于（不愉快、困难或陌生的事物）；使适应（常用：inure someone to）。"},"examples":[{"en":"Years of night shifts inured her to working while others slept.","zh":"多年的夜班让她习惯了别人睡觉时自己工作。"},{"en":"He became inured to criticism after posting his art online.","zh":"把作品发到网上后，他渐渐习惯了批评。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become used to something over time (less common; often used in passive: “be inured to”).","zh":"逐渐习惯；变得适应（较少用；常见被动：be inured to）。"},"examples":[{"en":"Over time, they inured to the cold winters in the Midwest.","zh":"时间久了，他们逐渐适应了美国中西部寒冷的冬天。"},{"en":"She is inured to long meetings and tight deadlines.","zh":"她已经习惯了冗长的会议和紧迫的截止日期。"}]},{"partOfSpeech":"vi.","definition":{"en":"(legal/business) to take effect or bring a benefit to someone (often: “inure to the benefit of”).","zh":"（法律/商业）生效并使……受益（常用：inure to the benefit of）。"},"examples":[{"en":"Any profits from the project inure to the benefit of the community.","zh":"该项目的任何利润都将惠及社区。"},{"en":"The insurance proceeds will inure to the beneficiary named in the policy.","zh":"保险金将使保单中指定的受益人受益。"}]}],"synonyms":["accustom","harden","desensitize","habituate","condition"],"phonetic":"/ɪˈnjʊrz/","extraExplanation":["“inure”常见于较正式的书面语：日常口语里更常用“get used to / be accustomed to”。","词源上与“use（使用/习惯）”有关，核心感觉是“通过反复接触而变得不再敏感、能承受”。","注意搭配：be inured to + 名词/动名词；inure someone to + 名词/动名词；inure to the benefit of + 人/机构（法律语域常见）。"]}
{"word":"inuring","summary":{"en":"Inuring means gradually becoming used to something difficult; in formal/legal use, it can mean a benefit or effect accruing to someone (“inuring to”).","zh":"inuring 指逐渐习惯（多指困难或不愉快的事）；在正式/法律语境中也可指利益或效力“归于/及于某人”（inuring to）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"becoming accustomed to something unpleasant or difficult (often through repeated experience)","zh":"（常因反复经历而）逐渐习惯于不愉快或困难的事"},"examples":[{"en":"After months of early shifts, she is inuring herself to waking up at 5 a.m.","zh":"经过几个月的早班，她正逐渐习惯早上五点起床。"},{"en":"Living abroad helped him inure himself to loneliness at first.","zh":"在国外生活让他起初逐渐适应了孤独。"}]},{"partOfSpeech":"v.","definition":{"en":"(formal, often in legal/business writing) taking effect for someone’s benefit; resulting in an advantage, usually in the pattern “inuring to (someone)”","zh":"（正式用法，常见于法律/商务语境）对某人产生效力并使其受益；通常用于“inuring to（某人）”结构"},"examples":[{"en":"Any profits from the sale are inuring to the shareholders.","zh":"出售所得的任何利润都将归股东受益。"},{"en":"The insurance benefits are inuring to the named beneficiary.","zh":"保险金将由指定受益人享有。"}]}],"synonyms":["accustoming","adapting","habituating","getting used to"],"phonetic":"/ɪˈnʊrɪŋ/","extraExplanation":["“inuring”来自动词 inure（常见搭配：inure someone to something / inure oneself to something），语气偏正式，多用于书面语。日常口语更常说 get used to 或 become accustomed to。","注意拼写与含义：inure（使习惯/适应）不要和 injure（伤害）混淆。","法律语境里常见短语 “inure to the benefit of … / inure to …”，表示“利益归于……/对……生效并使其受益”。"]}
{"word":"inurn","summary":{"en":"Inurn means to put ashes or remains into an urn; in literary use, it can mean to enclose or preserve something as if in an urn.","zh":"Inurn 指将骨灰或遗骸放入骨灰坛/瓮中；在文学用法中也可指像置于瓮中一样封存或珍藏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to place (especially ashes or remains) into an urn; to put in an urn","zh":"将（尤指骨灰或遗骸）放入骨灰坛/瓮中；入瓮安置"},"examples":[{"en":"After the cremation, the family chose to inurn the ashes in a small marble urn.","zh":"火化后，家人选择把骨灰入坛，放在一个小型大理石骨灰坛中。"},{"en":"The cemetery has a columbarium where remains can be inurned.","zh":"这座墓园有骨灰龛位，可将遗骸（骨灰）入龛安置。"}]},{"partOfSpeech":"vt.","definition":{"en":"(literary) to enclose, preserve, or “enshrine” something as if in an urn","zh":"（文学用法）封存、珍藏；如置于瓮中般“奉藏/供奉”"},"examples":[{"en":"She wrote poems to inurn her memories of home.","zh":"她写诗来封存自己关于故乡的记忆。"},{"en":"Time seems to inurn certain moments, keeping them bright and untouchable.","zh":"时间仿佛会封存某些瞬间，让它们明亮而不可触及。"}]}],"synonyms":["enshrine","entomb","inter (ashes)","deposit (in an urn)","lay to rest"],"phonetic":"/ɪnˈɝn/","extraExplanation":["“inurn”由前缀 in-（使进入）+ urn（瓮/骨灰坛）构成，常见于殡葬语境（如 columbarium 骨灰龛、inurnment 入龛/入坛安置）。","日常英语里更常用的表达是 “place the ashes in an urn” 或 “inter the ashes”（安葬/下葬）。"]}
{"word":"inurned","summary":{"en":"“Inurned” means “placed in an urn” (especially ashes), or more generally “sealed/preserved as if in an urn,” and it is a literary/formal past form of “inurn.”","zh":"“inurned”指把（尤指骨灰）安置入骨灰坛中；也可引申为像放入坛中那样封存/保存，是较正式或文艺用法的“inurn”的过去式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary) To place someone’s remains in an urn; to bury or enclose (especially ashes) in an urn.","zh":"（文艺/较少用）把（遗体或骨灰）放入骨灰坛；把……安葬/收殓于坛中。"},"examples":[{"en":"After the cremation, her ashes were inurned beside her parents'.","zh":"火化后，她的骨灰被安放在父母旁边的骨灰坛位。"},{"en":"In the poem, the hero is inurned under a quiet cypress tree.","zh":"在这首诗里，英雄被“收殓入坛”，安置在一棵安静的柏树下。"}]},{"partOfSpeech":"vt.","definition":{"en":"(By extension, literary) To enclose, store, or preserve something as if in an urn.","zh":"（引申，文艺）像放入坛中那样封存、收藏或保存（某物）。"},"examples":[{"en":"The old letters were inurned in a wooden box for decades.","zh":"那些旧信件被封存在一个木盒里几十年。"},{"en":"Memory inurns small moments and makes them last.","zh":"记忆把细小的瞬间封存起来，让它们变得长久。"}]}],"synonyms":["enshrined","interred","entombed","placed in an urn","sealed","preserved"],"phonetic":"/ɪnˈɝnd/","extraExplanation":["“inurned”是动词“inurn”的过去式/过去分词，常见于正式、宗教或纪念场合（如骨灰安置、陵园管理用语），也会出现在诗歌散文中。","词根与“urn（骨灰坛/瓮）”有关：in-（使进入）+ urn（坛/瓮），字面就是“放进坛里”。在现代日常英语中更常说“place the ashes in an urn”或“inter the ashes”。"]}
{"word":"inurning","summary":{"en":"Inurn means to place cremated remains in an urn, or (literarily) to enclose or bury something as if in an urn.","zh":"inurn 指把骨灰/遗骸装入骨灰坛安置；也可作文学化比喻，表示像装坛封存一样将某物埋葬或封存。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to place the ashes or remains of a dead person in an urn; to enclose in an urn","zh":"把（骨灰或遗骸）放入骨灰坛；装入坛中安置"},"examples":[{"en":"After the cremation, the family inurned his ashes in a small urn.","zh":"火化后，家人把他的骨灰装入一个小骨灰坛中安置。"},{"en":"The cemetery offers services to inurn cremated remains in a niche wall.","zh":"公墓提供将骨灰安放在壁龛（骨灰龛墙）里的服务。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, literary) to entomb, enclose, or shut away as if in an urn","zh":"（比喻/文学）像装入骨灰坛一样封存、埋葬或藏起"},"examples":[{"en":"He tried to inurn his grief, but it returned whenever he heard that song.","zh":"他试图把悲伤封存起来，但每次听到那首歌又会涌上心头。"},{"en":"The old letters were inurned in a box, untouched for decades.","zh":"那些旧信件被封存在一个盒子里，几十年无人触碰。"}]}],"synonyms":["enshrine","inter","entomb","bury","deposit"],"phonetic":"/ɪnˈɝn/","extraExplanation":["“inurn”比较少见，更常出现在殡葬场景（如columbarium骨灰堂、niche骨灰龛）或文学化表达中。日常英语里通常说“put the ashes in an urn / place the ashes in an urn”。","词源上由“urn（骨灰坛）”构成，前缀in-表示“使进入/放入”。因此它的核心画面感是“放入坛中并封存”。"]}
{"word":"inurnment","summary":{"en":"Inurnment means placing cremated remains in an urn, often for storage or burial in a columbarium.","zh":"Inurnment 指将火化后的骨灰装入骨灰坛，并进行安放或安葬（常见于骨灰堂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of placing cremated remains (ashes) in an urn; burial or storage of remains in an urn.","zh":"将火化后的骨灰安放入骨灰坛（骨灰瓮）中的行为；入瓮安葬/安置。"},"examples":[{"en":"The family chose inurnment in a columbarium niche.","zh":"家属选择将骨灰安放在骨灰堂的壁龛中。"},{"en":"After the memorial service, the inurnment took place privately.","zh":"追思礼拜之后，入瓮安置在私下进行。"}]}],"synonyms":["urn burial","interment (of ashes)","placement in an urn"],"phonetic":"/ɪnˈɝːnmənt/","extraExplanation":["“inurnment”多用于殡葬语境，尤指骨灰入坛后安放在骨灰堂（columbarium）的格位（niche）中。","词源上可理解为 in-（进入）+ urn（骨灰坛/瓮），是相对正式、书面或礼仪用语；日常表达也常说 “placing the ashes in an urn / placing the urn” 。"]}
{"word":"inurns","summary":{"en":"“Inurns” means “puts ashes/remains into an urn,” and it can also be used poetically to mean “to enclose or preserve like in an urn.”","zh":"“inurns”指“将骨灰/遗骸装入骨灰瓮”，也可作文学用法表示“像入瓮般封存或埋葬”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular of inurn) to place cremated remains (ashes) in an urn; to put something into an urn.","zh":"（inurn 的第三人称单数）把（火化后的）骨灰装入骨灰瓮；把某物放入瓮/坛中。"},"examples":[{"en":"After the ceremony, the family inurns the ashes in a small urn.","zh":"仪式结束后，家人把骨灰装入一个小骨灰瓮中。"},{"en":"The funeral home inurns the remains according to the family’s wishes.","zh":"殡仪馆按照家属意愿将遗骸骨灰装入骨灰瓮。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Literary) to enclose, entomb, or preserve as if in an urn.","zh":"（文学用法）像放入瓮中那样封存、埋葬、珍藏。"},"examples":[{"en":"In the poem, memory inurns the summer light.","zh":"在那首诗里，记忆把夏日的光封存起来。"}]}],"synonyms":["enshrines","entombs","inter","enclose"],"phonetic":"/ɪnˈɝːn/","extraExplanation":["“inurn”比较少见，多用于殡葬语境（尤其是火化后的“骨灰入瓮/入龛”）。因此“inurns”通常出现在正式说明、流程文件或较文学化的文字中。","构词提示：in-（使进入）+ urn（瓮/骨灰瓮）。相关名词常见用法是“inurnment”（骨灰安置/入瓮）。"]}
{"word":"inusitate","summary":{"en":"Inusitate means “unusual” or “rare,” but it is archaic and seldom used in modern English.","zh":"inusitate 表示“不同寻常/罕见”，但属于古旧词，现代英语中很少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unusual; uncommon; not typical (archaic or very formal).","zh":"不寻常的；罕见的；非典型的（古旧或非常正式用法）。"},"examples":[{"en":"The museum displayed an inusitate artifact from a lost island culture.","zh":"博物馆展出了一件来自失落岛屿文化的罕见文物。"},{"en":"Her inusitate calm during the crisis surprised everyone.","zh":"危机中她异常的冷静让所有人都很惊讶。"}]}],"synonyms":["unusual","rare","uncommon","atypical","extraordinary"],"phonetic":"/ɪˈnuːzɪˌteɪt/","extraExplanation":["这个词在现代英语中非常少见，更常用的是 unusual、rare、uncommon。","拼写提示：你输入的“inusitate”基本是正确拼写，但在日常写作里用它可能显得过于书面或古风。"]}
{"word":"inusitateness","summary":{"en":"Inusitateness means “unusualness” or “rarity,” but it is a very rare, old-fashioned noun in modern English.","zh":"inusitateness 表示“不寻常、罕见”，但在现代英语中非常少见且偏古雅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being unusual, uncommon, or out of the ordinary (very rare/old-fashioned word)","zh":"不寻常；罕见；异乎寻常（非常少见/偏古雅的用词）"},"examples":[{"en":"The inusitateness of his request surprised everyone in the room.","zh":"他这个请求的不同寻常让房间里的人都很惊讶。"},{"en":"In old writing, authors sometimes used “inusitateness” to describe strange events.","zh":"在较早的文章里，作者有时会用“inusitateness”来形容怪异的事件。"}]}],"synonyms":["unusualness","rarity","oddness","strangeness","uncommonness"],"phonetic":"/ɪnˌjuːzɪˈteɪtnəs/","extraExplanation":["“inusitateness”来自形容词“inusitate”（意为“不常见的、罕见的”）+ 名词后缀“-ness”。“inusitate”本身也很少见，现代英语更常用：unusual / uncommon / rarity / oddness。","拼写提醒：这个词非常少见，很多时候人们想找的其实是更常见的词，比如：inquisitiveness（好奇心）或 inattentiveness（不专心）。如果你告诉我你想表达的中文意思或句子语境，我可以帮你选最自然的词。"]}
{"word":"inusitation","summary":{"en":"A very rare noun meaning “unusualness; rarity.”","zh":"一个非常罕见的名词，意思是“不寻常；罕见”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare) The quality of being unusual; something uncommon or out of the ordinary.","zh":"（非常罕见）不寻常、罕见的性质；不常见的事物。"},"examples":[{"en":"The professor noted the inusitation of the word in modern English.","zh":"教授指出这个词在现代英语中的罕见性。"},{"en":"Its inusitation makes it sound old-fashioned.","zh":"它的罕见性让它听起来很古旧。"}]}],"synonyms":["rarity","unusualness","uncommonness"],"phonetic":"/ˌɪn.juːzɪˈteɪʃən/","extraExplanation":["“inusitation”不是现代英语里的常用词，很多拼写检查也不会收录。它通常被视为由形容词 **inusitate**（罕见的、不寻常的）引申出来的名词形式，但在当代写作中几乎不用。","如果你想表达“暗示/影射”，更常见的词是 **insinuation**；如果你想表达“非同寻常/罕见”，更自然的选择是 **unusualness** 或 **rarity**。"]}
{"word":"inust","summary":{"en":"“Inust” is a rare word meaning “burned/branded into; deeply impressed.”","zh":"“inust” 是个罕用词，意思是“被烙进/烧进……的；深深刻入的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) Burned or branded into something; impressed as if by burning (e.g., a mark, image, or memory).","zh":"（罕用，正式）被烧灼/烙印进某物里的；仿佛用火烧而留下的印记（也可指记忆、印象等深深刻入）。"},"examples":[{"en":"The old seal was inust on the leather cover.","zh":"旧印章的痕迹被烙在皮革封面上。"},{"en":"Years of hardship left an inust memory that he could not forget.","zh":"多年的艰辛留下了难以磨灭的记忆，深深刻在他心里。"}]}],"synonyms":["burned into","branded","etched","engraved","impressed"],"phonetic":"ɪˈnʌst","extraExplanation":["“inust” 在现代英语中非常少见，多见于较旧或较文学化的文本。它来自拉丁语 *inustus*，与“burn（烧）/brand（烙印）”的意象相关，常用来形容“印记像被烧进去一样牢固”。","如果你想表达日常英语里的“深深印在……上/心里”，更常用：**engraved on/in**, **burned into**, **branded**, **etched into**。"]}
{"word":"inustion","summary":{"en":"A rare word meaning cauterization (burning tissue as treatment).","zh":"一个较少见的词，意思是“烧灼术/烙灼”（用灼烧进行治疗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of burning or cauterizing tissue (especially as a medical treatment); cauterization","zh":"（尤指医疗手段的）灼烧；烧灼术；烙灼"},"examples":[{"en":"In older medical texts, inustion was used to stop bleeding by sealing a wound with heat.","zh":"在较早的医学文献中，inustion 常用于用热封闭伤口以止血。"},{"en":"The doctor decided against inustion because it could leave more scarring than other treatments.","zh":"医生决定不采用烧灼术，因为它可能比其他治疗方式留下更多疤痕。"}]}],"synonyms":["cauterization","cautery","burning","searing"],"phonetic":"/ɪˈnʌs.tʃən/","extraExplanation":["这是一个非常少见、偏古旧/学术的词，主要出现在早期医学或拉丁化的英语写作中。现代英语里更常用 cauterization（烧灼、烙灼）来表达同一概念。","词源来自拉丁语 inustio，含义是“烧进去/烙上去”。"]}
{"word":"inutile","summary":{"en":"“Inutile” means useless or pointless (formal).","zh":"“inutile”表示“无用的、徒劳的”（较正式书面语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"useless; not helpful or effective; not worth using","zh":"无用的；不起作用的；不值得使用的"},"examples":[{"en":"Arguing with him is inutile—you won’t change his mind.","zh":"跟他争论是无用的——你改变不了他的想法。"},{"en":"They spent money on an inutile project that never helped customers.","zh":"他们把钱花在一个无用的项目上，结果一点也没帮到客户。"}]}],"synonyms":["useless","pointless","futile","unhelpful","ineffective"],"phonetic":"/ɪˈnuːt̬l/","extraExplanation":["“inutile”是一个较正式、书面语的词，日常口语里更常用“useless”“pointless”“not worth it”。","词源上来自拉丁语前缀“in-”（不）+“utile”（有用的），因此字面意思就是“不有用的”。","使用时常带有“白费力气/徒劳”的语气，尤其用于评价做法、争论、努力或计划。"]}
{"word":"inutilely","summary":{"en":"“Inutilely” means doing something in a useless, ineffective way, often after trying hard but getting no result.","zh":"“inutilely”表示“徒劳地、无用地”，常指费力去做但没有任何效果。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a useless or ineffective way; without producing a helpful result.","zh":"徒劳地；无用地；没有效果地。"},"examples":[{"en":"I tried inutilely to fix the old printer; it kept jamming.","zh":"我徒劳地想修好那台旧打印机；它一直卡纸。"},{"en":"She argued inutilely with the customer, and the situation only got worse.","zh":"她无用地和顾客争辩，结果情况反而更糟。"}]}],"synonyms":["in vain","uselessly","to no avail","ineffectively","fruitlessly"],"phonetic":"/ɪnˈjuːtaɪlli/","extraExplanation":["“inutilely”来自形容词“inutile”（无用的、无益的），在现代英语中相对少见；更常用、更自然的表达是“in vain”“uselessly”“to no avail”。","搭配提示：常与“try/attempt/argue/protest/struggle”等动词连用，用来强调努力没有结果。","语体建议：在正式或文学风格中更可能见到“inutilely”；日常口语一般不太用。"]}
{"word":"inutilities","summary":{"en":"“Inutilities” means useless things or details; it can also refer to “uselessness” (more often said as “inutility”).","zh":"“inutilities”指无用之物或无用的细节；也可指“无用性”（更常用单数 inutility）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) useless things, actions, or features; things that have no practical value.","zh":"（复数）无用之物；无实际价值的事物、行为或特征。"},"examples":[{"en":"The report was full of inutilities that didn’t help decision-making.","zh":"这份报告里充满了无用内容，对决策没有帮助。"},{"en":"He cleared the drawer of old cables and other inutilities.","zh":"他清理抽屉，把旧线缆等无用之物都扔掉了。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the state or quality of being useless; lack of usefulness (usually “inutility”).","zh":"（较少见）无用性；缺乏用途（通常用单数 inutility）。"},"examples":[{"en":"They criticized the inutility of the policy in rural areas.","zh":"他们批评这项政策在农村地区缺乏实际作用。"},{"en":"She argued that the extra steps added only inutility.","zh":"她认为这些额外步骤只增加了无用性。"}]}],"synonyms":["useless things","pointless details","nonessentials","trivia (in context)","waste","inefficiency"],"phonetic":"/ˌɪn.juˈtɪl.ə.tiz/","extraExplanation":["“inutilities”来自较少见的名词 inutility（意为“无用、无价值”），常见于较正式或文学化的语境。日常英语里更常用的表达有：useless things, pointless details, unnecessary extras, waste, inefficiency 等。","拼写提示：不要与 utilities（公用事业；水电煤）混淆。inutilities 不是“公用事业”的否定，而是“无用之物/无用性”。"]}
{"word":"inutility","summary":{"en":"Inutility means “uselessness” or lack of practical value, and it is a formal, written-word choice.","zh":"inutility意为“无用、无益、缺乏实际价值”，语体较正式，多用于书面表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Uselessness; the state of not being useful or not producing a helpful result.","zh":"无用；无益（指没有用处或没有产生有帮助的结果的状态）"},"examples":[{"en":"He felt a deep sense of inutility after the project was canceled.","zh":"项目取消后，他感到一种深深的无用感。"},{"en":"The report criticized the inutility of the policy and asked for changes.","zh":"报告批评了该政策的无效与无益，并要求作出改变。"}]}],"synonyms":["uselessness","futility","ineffectiveness","worthlessness"],"phonetic":"/ˌɪnjuˈtɪləti/","extraExplanation":["“inutility”较正式、偏书面，在现代日常英语中不如“uselessness”常见。写作中用于强调某事“毫无用处/无实际价值”的抽象状态。","词形结构：in-（否定前缀）+ utility（效用、实用性）。与“utility”形成对比：utility强调“有用/实用”，inutility强调“无用/无效”。"]}
{"word":"inutilized","summary":{"en":"Inutilized means made useless or ineffective; it is an uncommon word in modern English.","zh":"inutilized 指“被弄得无用/失效的”，但在现代英语中较少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of inutilize) to make something useless or ineffective; to render unusable.","zh":"（inutilize 的过去式/过去分词）使某物变得无用或失效；使不可用。"},"examples":[{"en":"The explosion inutilized the old bridge, so it had to be replaced.","zh":"爆炸使那座旧桥失去作用，因此不得不更换。"},{"en":"Several key parts were inutilized by rust and could not be repaired.","zh":"几个关键部件因生锈而失效，无法修复。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, uncommon) made useless; rendered ineffective or unusable.","zh":"（形容词，少见）被弄得无用的；失效的；不可用的。"},"examples":[{"en":"After the storm, the roads were inutilized for days.","zh":"暴风雨过后，道路好几天都无法使用。"},{"en":"The inutilized equipment sat in storage until it was recycled.","zh":"那些失效的设备一直放在仓库里，直到被回收。"}]}],"synonyms":["rendered useless","disabled","made unusable","wrecked","ruined","inactivated"],"phonetic":"/ɪnˈjuːtəˌlaɪzd/","extraExplanation":["“inutilized”在现代英语里非常少见，读者更常看到/使用的是：render useless（使无用）、disable（使失去功能/使瘫痪）、make unusable（使不可用）、inactivate（使失活/使停止运作，常见于技术或生物语境）。","词根上与“utility（效用）”相关：in-（使…不/否定）+ utility（效用）+ -ize（使成为…）→ inutilize（使失去效用）。在正式写作中可用更常见的表达以避免显得生僻。"]}
{"word":"inutterable","summary":{"en":"Unutterable means impossible to express in words, often describing very strong feelings; it can also mean not to be spoken (literary).","zh":"Unutterable 指“难以言喻的”，常形容强烈情感；文学中也可指“不可说出口的/不可提及的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Impossible to express in words; too intense, shocking, or deep to describe.","zh":"难以用言语表达的；（情感或程度）强烈到说不出来的。"},"examples":[{"en":"She felt an unutterable sadness after hearing the news.","zh":"听到这个消息后，她感到一种难以言喻的悲伤。"},{"en":"The scene filled him with unutterable fear.","zh":"那一幕让他充满难以言喻的恐惧。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Not to be spoken aloud; unspeakable or forbidden to mention.","zh":"（文学用法）不宜说出口的；不可提及的；讳莫如深的。"},"examples":[{"en":"In the story, the villain’s name was treated as unutterable.","zh":"在故事里，反派的名字被当作不可说出口的禁忌。"},{"en":"They hinted at an unutterable secret.","zh":"他们暗示有一个不可明说的秘密。"}]}],"synonyms":["indescribable","inexpressible","unspeakable","ineffable"],"phonetic":"/ʌnˈʌtərəbəl/","extraExplanation":["你输入的 **inutterable** 通常被认为是拼写变体或误拼；标准常用形式是 **unutterable**。","构词上：**un-** 表示“否定/不”，**utter** 表示“说出/表达”，加 **-able** 表示“能够……的”，合起来就是“不能说出的”。","常见搭配：**unutterable sorrow/joy/horror**（难以言喻的悲伤/喜悦/恐惧）。该词带有较强的文学色彩，日常口语中也可用 **indescribable**（难以描述的）来替换。"]}
{"word":"InuYasha","summary":{"en":"InuYasha is the title of a famous Japanese manga/anime and also the name of its half-demon main character.","zh":"InuYasha（《犬夜叉》）既是知名日漫/动画的作品名，也指其中的半妖主角犬夜叉。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Japanese manga and anime series by Rumiko Takahashi, about a modern schoolgirl who travels to Japan’s past and teams up with a half-demon named InuYasha to recover magical jewel shards.","zh":"《犬夜叉》：高桥留美子创作的日本漫画与动画作品，讲述现代女学生穿越到日本战国时代，与半妖犬夜叉一起寻找并回收“四魂之玉”碎片的故事。"},"examples":[{"en":"I started watching InuYasha because I like fantasy stories set in old Japan.","zh":"我开始看《犬夜叉》，因为我喜欢以古代日本为背景的奇幻故事。"},{"en":"InuYasha mixes action, romance, and Japanese folklore.","zh":"《犬夜叉》把动作、恋爱和日本民间传说融合在一起。"}]},{"partOfSpeech":"other","definition":{"en":"The main character of the series: a half-demon (half human, half dog-demon) who uses a sword called Tessaiga.","zh":"作品中的主角名：半妖（半人半犬妖），使用名为“铁碎牙”的刀。"},"examples":[{"en":"InuYasha can be rude sometimes, but he cares about his friends.","zh":"犬夜叉有时说话很冲，但他很在乎伙伴。"},{"en":"Kagome and InuYasha often argue, but they trust each other.","zh":"戈薇和犬夜叉经常吵架，但彼此信任。"}]}],"synonyms":["Inu-Yasha","犬夜叉"],"phonetic":"/ˌiːnuːˈjɑːʃə/","extraExplanation":["“InuYasha”是英文常见写法，也可见作“Inu-Yasha”。日文写作「犬夜叉」（いぬやしゃ）。其中「犬」=狗，「夜叉」源自佛教与东亚文化语境里的“夜叉”（梵语 Yaksha），常被塑造成凶猛的鬼神/护法形象；作品借用这一意象来营造“半妖”的神秘与力量感。","作品背景常与日本战国时代、神社、御守、妖怪传说等元素结合；理解这些文化符号（如“妖怪”“结界”“神树”等）能帮助更顺畅地看懂剧情。","英文里它通常当作专有名词使用：可指“作品名”或“角色名”。在写作中一般不加冠词（不说 *the InuYasha*），但可说 “the InuYasha series”。"]}

