{"word":"Io","summary":{"en":"Io is a proper noun: a figure from Greek mythology, a volcanic moon of Jupiter, or a personal name.","zh":"Io 是专有名词：可指希腊神话人物伊娥、木星的火山活跃卫星木卫一，或用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A priestess loved by Zeus who was turned into a cow and wandered the world; her story explains suffering and transformation in many retellings.","zh":"（希腊神话）伊娥：宙斯所爱的一位女祭司，被变成母牛并四处漂泊；她的故事常用来表现苦难与蜕变。"},"examples":[{"en":"In Greek myth, Io is transformed into a cow to hide her from Hera.","zh":"在希腊神话中，伊娥被变成母牛，以躲避赫拉。"},{"en":"The play references Io to suggest a long journey of hardship.","zh":"这部戏提到伊娥，暗示一段艰难而漫长的旅程。"}]},{"partOfSpeech":"n.","definition":{"en":"Astronomy: A large moon of Jupiter, famous for intense volcanic activity.","zh":"（天文学）木卫一（Io）：木星的一颗大卫星，以强烈的火山活动闻名。"},"examples":[{"en":"Io is the most volcanically active world in the solar system.","zh":"木卫一被认为是太阳系中火山活动最强的天体。"},{"en":"Scientists studied Io’s eruptions using infrared images.","zh":"科学家用红外图像研究木卫一的喷发。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name (given name) used in various cultures; sometimes chosen for its short, modern feel.","zh":"人名：用于不同文化中的名字；有时因简短、现代感而被选用。"},"examples":[{"en":"Io introduced herself and spelled her name: I-O.","zh":"Io自我介绍，并把名字拼出来：I-O。"}]}],"phonetic":"/ˈaɪ.oʊ/","extraExplanation":["大小写很重要：作为专有名词通常写作“Io”（人名、神话人物、木卫一）。","读音在英语里常见为 /ˈaɪ.oʊ/（两拍，类似“EYE-oh”）。","“Io”与“IO / I/O（input/output，输入/输出）”不是同一个词；后者通常全大写并带斜杠，用于计算机语境。"]}
{"word":"io","summary":{"en":"I/O means input and output in computing—data going into and coming out of a system, or the interfaces that handle it.","zh":"I/O 在计算机中指“输入/输出”：数据进入与离开系统的过程，或负责这些操作的接口/部件。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Computing) Input/Output: the flow of data into a computer system (input) and out from it (output), or the parts that handle this.","zh":"（计算机）输入/输出：数据进入系统（输入）与从系统离开（输出）的过程，或负责处理这些操作的部分。"},"examples":[{"en":"This program is slow because it does a lot of disk I/O.","zh":"这个程序很慢，因为它做了很多磁盘 I/O（读写）。"},{"en":"Keyboard and mouse are input devices; the screen is an output device—together they’re basic I/O.","zh":"键盘和鼠标是输入设备；屏幕是输出设备——它们一起构成基础的 I/O。"},{"en":"The server’s I/O is overloaded, so requests take longer to finish.","zh":"服务器的 I/O 过载了，所以请求完成得更慢。"}]},{"partOfSpeech":"n.","definition":{"en":"A port or connection on a device used for sending/receiving signals or data.","zh":"设备上的输入/输出端口或接口，用于发送/接收信号或数据。"},"examples":[{"en":"Check the audio I/O settings to choose the right microphone.","zh":"检查音频 I/O 设置以选择正确的麦克风。"},{"en":"This interface provides two channels of I/O.","zh":"这个接口提供两个通道的输入/输出。"}]}],"synonyms":["input/output","data transfer","read/write (context: storage)"],"phonetic":"ˌaɪ ˈoʊ","extraExplanation":["在英文里常写作 “I/O”（带斜杠），读作 “eye-oh”。技术文档里还会出现 “I/O bound”（受 I/O 限制）与 “CPU bound”（受 CPU 限制）。"]}
{"word":"IOC","summary":{"en":"IOC is an abbreviation most commonly meaning the International Olympic Committee; it can also mean Indicator of Compromise (cybersecurity) or Initial Operating Capability.","zh":"IOC 是缩略语，最常见指国际奥林匹克委员会；也可指（网络安全）入侵指标或（项目/军事）初始运行/作战能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"International Olympic Committee; the organization that oversees the Olympic Games and the Olympic Movement.","zh":"国际奥林匹克委员会；负责管理奥运会及奥林匹克运动的组织。"},"examples":[{"en":"The IOC announced new rules for future Olympic Games.","zh":"IOC 宣布了未来奥运会的新规则。"},{"en":"The city submitted its bid to the IOC to host the Olympics.","zh":"该城市向 IOC 递交了申办奥运会的申请。"}]},{"partOfSpeech":"n.","definition":{"en":"(Cybersecurity) Indicator of Compromise; a clue or piece of evidence that suggests a system may have been attacked or infected (for example, a malicious file hash or suspicious IP address).","zh":"（网络安全）入侵指标；指示系统可能遭到攻击或感染的线索或证据（如恶意文件哈希值、可疑 IP 地址等）。"},"examples":[{"en":"The security team shared IOCs to help other companies block the attack.","zh":"安全团队共享了 IOCs，帮助其他公司拦截这次攻击。"},{"en":"We found an IOC in the logs that matched known malware behavior.","zh":"我们在日志中发现了与已知恶意软件行为匹配的 IOC。"}]},{"partOfSpeech":"n.","definition":{"en":"Initial Operating Capability; the stage when a system, product, or military unit can perform some required tasks, even if it is not fully complete yet.","zh":"初始作战/运行能力；指系统、产品或部队已具备执行部分要求任务的能力，但可能尚未完全定型或全面部署。"},"examples":[{"en":"The project reached IOC after the first successful field test.","zh":"该项目在首次成功的现场测试后达到了 IOC。"},{"en":"They expect IOC by next year, with full capability later.","zh":"他们预计明年达到 IOC，之后再实现全面能力。"}]}],"synonyms":["International Olympic Committee","Indicator of Compromise","Initial Operating Capability"],"phonetic":"/ˌaɪ oʊ ˈsiː/","extraExplanation":["“IOC”是缩略语，最常见的读法是逐字母读：/ˌaɪ oʊ ˈsiː/（类似“I-O-C”）。","在不同领域里“IOC”含义差别很大：体育新闻里几乎总是指国际奥委会；网络安全报告里常指“入侵指标”，而且常用复数 IOCs；军事、工程或项目管理语境里则常指“初始运行/作战能力”。阅读时要用上下文判断。"]}
{"word":"iocs","summary":{"en":"IOCs usually means “Indicators of Compromise,” evidence that a system may have been breached.","zh":"IOCs 通常指“入侵指标”，即显示系统可能被入侵的各种证据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Indicators of Compromise: pieces of evidence that suggest a computer system, account, or network may have been attacked or infected (for example, a suspicious file hash or a malicious IP address).","zh":"入侵指标：用来表明电脑系统、账号或网络可能遭到攻击或感染的证据（例如可疑文件哈希、恶意 IP 地址）。"},"examples":[{"en":"The security team shared IOCs like malicious domains and file hashes.","zh":"安全团队分享了域名和文件哈希等入侵指标（IOCs）。"},{"en":"We scanned the network for IOCs after the phishing incident.","zh":"钓鱼事件发生后，我们在网络中扫描入侵指标（IOCs）。"},{"en":"If these IOCs match your logs, isolate the affected machine immediately.","zh":"如果这些入侵指标（IOCs）与你的日志匹配，请立刻隔离受影响的机器。"}]}],"synonyms":["indicators of compromise","security indicators","threat indicators"],"phonetic":"/ˌaɪ.oʊˈsiːz/","extraExplanation":["IOCs 常见于网络安全与事件响应（Incident Response）语境，复数写作 IOCs，单数常写 IOC。","常见 IOC 类型包括：IP/域名、URL、文件哈希（MD5/SHA-256）、可疑文件名/路径、注册表项、进程名、邮件主题或发件人等。","与 IOCs 相关的另一个概念是 TTPs（战术、技术与流程）：IOCs 更像“线索/痕迹”，TTPs 更像“攻击者的做法”。"]}
{"word":"iod","summary":{"en":"IOD is an abbreviation most commonly meaning “iodine” or “interocular distance,” depending on context.","zh":"IOD是一个缩写，最常见的含义是“碘（iodine）”或“瞳距/两眼间距（interocular distance）”，取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) iodine; used in some medical, nutrition, or lab contexts to refer to iodine (the chemical element).","zh":"（缩写）碘；在部分医学、营养学或实验室语境中用来指“碘”（化学元素）。"},"examples":[{"en":"The supplement label says it contains 150 mcg IOD per serving.","zh":"补充剂标签写着每份含有150微克的碘（IOD）。"},{"en":"The lab report notes low IOD levels and recommends further testing.","zh":"化验报告提示碘（IOD）水平偏低，建议进一步检查。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) interocular distance; the distance between the centers of the eyes, used in optometry/vision measurements.","zh":"（缩写）瞳距/两眼间距（interocular distance）；验光或视觉测量中使用的两眼中心间距离。"},"examples":[{"en":"The optician measured my IOD to fit the glasses properly.","zh":"验光师测量了我的瞳距（IOD），以便把眼镜配得更合适。"},{"en":"Different IOD values can affect how a VR headset feels.","zh":"不同的瞳距（IOD）数值会影响VR头显的佩戴体验。"}]}],"synonyms":["iodine","interocular distance","PD (pupillary distance)"],"phonetic":"/ˌaɪ.oʊˈdiː/","extraExplanation":["“IOD”不是日常英语里常见的普通单词，更常见于专业缩写。具体含义要看领域：在营养/医学里可能指“iodine（碘）”，在验光/视光学里常指“interocular distance（瞳距）”。","正式写作中，第一次出现建议写全称（iodine / interocular distance），后面再用缩写，以免读者误解。"]}
{"word":"iodal","summary":{"en":"“Iodal” means related to or containing iodine, but it’s relatively uncommon in everyday English.","zh":"“iodal”意为“与碘有关的/含碘的”，但在日常英语中比较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to iodine; containing or involving iodine.","zh":"与碘有关的；含碘的；涉及碘的。"},"examples":[{"en":"The doctor ordered an iodal contrast agent for the imaging test.","zh":"医生为这项影像检查开了含碘的造影剂。"},{"en":"Some disinfectants have iodal properties because iodine can kill germs.","zh":"有些消毒剂具有含碘的特性，因为碘可以杀死细菌。"}]}],"synonyms":["iodine-related","iodinated","iodiferous"],"phonetic":"/aɪˈoʊdəl/","extraExplanation":["“iodal”在现代英语里比较少见，更多时候会用“iodine (碘)”作名词，或用“iodized (加碘的)”来形容食盐等（如 iodized salt = 加碘盐）。","在医学语境中，更常见的搭配是“iodinated contrast (含碘造影剂)”；如果你在说明书或旧一些的专业文本里看到“iodal”，通常就是指“与碘相关/含碘”。"]}
{"word":"iodamoeba","summary":{"en":"Iodamoeba is a genus of amoebas, especially a usually non-harmful species that may live in the human intestine.","zh":"Iodamoeba 指碘阿米巴属，尤指一种通常无明显致病性的肠道共栖变形虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of amoebas (single-celled organisms), especially Iodamoeba bütschlii, which can live in the human intestine and is usually considered non-harmful (a commensal).","zh":"碘阿米巴属（一类单细胞变形虫）；尤指布氏碘阿米巴，可寄居在人类肠道中，通常被认为对人体无明显危害（共栖生物）。"},"examples":[{"en":"The stool sample showed cysts of Iodamoeba bütschlii.","zh":"粪便标本中发现了布氏碘阿米巴的包囊。"},{"en":"Iodamoeba is often reported in parasitology labs as an intestinal commensal rather than a pathogen.","zh":"在寄生虫学实验室里，碘阿米巴常被报告为肠道共栖者，而非致病原。"}]}],"synonyms":["Iodamoeba bütschlii (species name)"],"phonetic":"/ˌaɪoʊdəˈmiːbə/","extraExplanation":["“Iodamoeba”是科学拉丁命名：iod- 与“碘”（iodine）有关，常用于提示其包囊内的结构在碘染色下更容易被观察到；“amoeba”指变形虫。","在医学检验语境中，它通常出现在粪便寄生虫检查报告里。多数情况下发现它不等于“感染生病”，但可能提示饮食/饮水卫生或粪口传播风险，需要结合医生判断。"]}
{"word":"iodate","summary":{"en":"An iodate is a chemical compound containing the iodate ion (IO₃⁻), commonly used in chemistry and in iodized salt.","zh":"iodate 指含碘酸根（IO₃⁻）的化合物（碘酸盐/碘酸酯），常见于化学与加碘盐等场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt or ester of iodic acid (HIO₃), containing the iodate ion (IO₃⁻)","zh":"碘酸盐（或碘酸酯）；指含有碘酸根离子（IO₃⁻）的化合物，是碘酸（HIO₃）的盐或酯"},"examples":[{"en":"Potassium iodate is added to table salt in some countries to help prevent iodine deficiency.","zh":"在一些国家，会在食盐中添加碘酸钾，以帮助预防缺碘。"},{"en":"In the lab, iodate can act as an oxidizing agent under acidic conditions.","zh":"在实验室里，碘酸盐在酸性条件下可以起到氧化剂的作用。"}]}],"synonyms":["iodate salt","salt of iodic acid"],"phonetic":"/ˈaɪəˌdeɪt/","extraExplanation":["“iodate”主要用于化学与营养强化（如加碘盐）相关语境。常见的有 potassium iodate（碘酸钾，KIO₃）与 sodium iodate（碘酸钠，NaIO₃）。与“iodide（碘化物，I⁻）”不同，“iodate（碘酸盐，IO₃⁻）”中碘的氧化态更高，因此更偏“氧化性”这一化学特征。"]}
{"word":"iodated","summary":{"en":"Iodated means containing iodate or having iodate added (often in salt).","zh":"iodated 指“含碘酸根/加了碘酸盐的”，常用于“加碘酸盐食盐”等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing iodate (IO₃⁻) or treated with an iodate compound.","zh":"（化学）含有碘酸根（IO₃⁻）的；用碘酸盐处理过的。"},"examples":[{"en":"The report mentions iodated salt used to prevent iodine deficiency.","zh":"报告提到使用加碘酸盐的食盐来预防缺碘。"},{"en":"Some bread is made with iodated dough conditioners.","zh":"有些面包会使用含碘酸盐的面团改良剂。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of the verb “iodate”: to add iodate to something or to convert something into an iodate.","zh":"动词“iodate”的过去式/过去分词：给某物加入碘酸盐；使某物变成碘酸盐。"},"examples":[{"en":"The water sample was iodated before analysis.","zh":"水样在分析前被加入了碘酸盐进行处理。"},{"en":"They iodated the salt at the factory to improve iodine intake.","zh":"他们在工厂里给食盐加碘酸盐，以改善碘摄入。"}]}],"synonyms":["iodized","iodine-fortified","iodate-treated"],"phonetic":"/ˈaɪəˌdeɪtɪd/","extraExplanation":["“iodated”常见于食品与公共卫生语境，例如“iodated salt（加碘酸盐食盐）”。需要注意它与“iodized（加碘）”很接近：两者都表示“加碘”，但“iodated”更强调使用“碘酸盐（如碘酸钾 potassium iodate）”这一具体形式。"]}
{"word":"iodates","summary":{"en":"“Iodates” means salts that contain the iodate ion (IO3−); it’s the plural of “iodate.”","zh":"“iodates”指“碘酸盐”（含碘酸根 IO3− 的盐类），是“iodate”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical salt containing the iodate ion (IO₃⁻), used in chemistry and sometimes to add iodine in products like iodized salt (depending on the specific compound).","zh":"（化学）碘酸盐：含有碘酸根离子（IO₃⁻）的盐类，用于化学实验与工业；某些碘酸盐也可用于补充碘（视具体化合物而定）。"},"examples":[{"en":"Potassium iodate is sometimes used to iodize table salt in some countries.","zh":"在一些国家，碘酸钾有时用于给食盐加碘。"},{"en":"The lab stored iodates separately from reducing agents for safety.","zh":"为安全起见，实验室把碘酸盐与还原剂分开存放。"}]}],"synonyms":["iodate salts","IO3− salts"],"phonetic":"/ˈaɪoʊˌdeɪt/","extraExplanation":["“iodates”是“iodate”的复数形式。常见的碘酸盐包括 potassium iodate（碘酸钾）和 sodium iodate（碘酸钠）。在英语里它更偏学术/技术用词，日常对话中不常见。"]}
{"word":"iodating","summary":{"en":"“Iodating” is a technical chemistry word meaning converting something into an iodate or forming iodate during a process.","zh":"“iodating”是化学技术用语，指把某物转化为碘酸盐或在处理过程中形成碘酸盐。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act/process of converting a substance into an iodate (a chemical salt containing the iodate ion, IO₃⁻), or treating something so that iodate forms","zh":"（化学）使某物转化为碘酸盐（含碘酸根 IO₃⁻ 的盐）的过程；或通过处理使其形成碘酸盐"},"examples":[{"en":"In the lab, researchers are iodating the sample to study how iodate compounds behave in water.","zh":"在实验室里，研究人员正在对样品进行碘酸盐化处理，以研究碘酸盐化合物在水中的表现。"},{"en":"Iodating the solution can change its oxidation state and affect the final reaction results.","zh":"对溶液进行碘酸盐化处理可能会改变其氧化态，并影响最终反应结果。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “iodate” (used in technical writing, especially chemistry)","zh":"“iodate”的现在分词（多见于化学等技术性写作）"},"examples":[{"en":"They are iodating the mixture before measuring the concentration.","zh":"他们在测量浓度之前正在对混合物进行碘酸盐化处理。"}]}],"synonyms":["iodizing (often the intended word in non-chemistry contexts)","forming iodate","oxidizing to iodate"],"phonetic":"/ˈaɪoʊˌdeɪtɪŋ/","extraExplanation":["“iodating”不是日常英语里常见的词，更多出现在化学语境。它通常来自动词“iodate”（使……形成碘酸盐/使……成为碘酸盐）。","容易混淆的词有：\n- “iodize / iodise”：给（盐等）加碘（如“iodized salt 加碘盐”），日常更常见。\n- “iodine”：碘（元素名）。\n如果你是在食品营养或“食盐加碘”语境里看到“iodating”，更可能想表达的是“iodizing”。"]}
{"word":"iodation","summary":{"en":"Iodation means adding iodine to something, especially adding iodine to salt for public health.","zh":"Iodation 指向某物中加入碘，尤指为公共健康目的给食盐加碘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of adding iodine (or iodide/iodate compounds) to something, especially adding iodine to salt to prevent iodine deficiency","zh":"碘化；加碘（指向某物中加入碘或碘化物/碘酸盐，尤指给食盐加碘以预防缺碘）"},"examples":[{"en":"Many countries require iodation of table salt to reduce thyroid problems caused by iodine deficiency.","zh":"许多国家要求对食盐进行加碘，以减少因缺碘引起的甲状腺问题。"},{"en":"The label says this is iodized salt, meaning it has gone through iodation.","zh":"标签上写这是加碘盐，意思是它经过了加碘处理。"}]}],"synonyms":["iodization","iodide supplementation","salt iodization"],"phonetic":"/ˌaɪəˈdeɪʃən/","extraExplanation":["“iodation”在一般英语里相对少见，更常见的说法是“iodization /ˌaɪədəˈzeɪʃən/”（加碘，尤其指食盐加碘）。在公共卫生语境中，你会更频繁看到“salt iodization”（食盐加碘）或“iodized salt”（加碘盐）。","词形上，“iod-”来自 iodine（碘），“-ation”表示“……的过程/行为”。因此它字面意思就是“进行加碘的过程”。"]}
{"word":"iodations","summary":{"en":"“Iodations” is the plural of “iodation,” meaning the process of adding or introducing iodine, especially in food or chemistry.","zh":"“iodations”是“iodation”的复数，指加碘或引入碘的过程，常见于食品营养与化学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of adding iodine (often to food or salt) or introducing iodine into a substance (chemistry).","zh":"加碘；（化学）使某物引入碘的过程。"},"examples":[{"en":"Iodation of table salt helps prevent iodine deficiency.","zh":"食盐加碘有助于预防碘缺乏。"},{"en":"In the lab, the chemist studied the iodation of an organic compound.","zh":"在实验室里，化学家研究一种有机化合物的碘化反应。"}]}],"synonyms":["iodization","iodination","iodide addition"],"phonetic":"/ˌaɪəˈdeɪʃən/","extraExplanation":["“iodations”较少见，通常是名词复数，单数多写作“iodation”。在公共健康语境中，更常见的词是“iodization”（加碘化，尤指食盐加碘），而在有机化学里也常用“iodination”（碘化反应）来表示把碘引入分子。","拼写小提示：iod-（碘）来自希腊语词根，和“iodine（碘）”同源；“-ation”表示“……的过程/作用”。如果你是在看化学论文或食品营养资料，原文更可能是“iodination/iodization”。"]}
{"word":"iode","summary":{"en":"“iode” is not standard English; it’s usually the French word for “iodine” or a misspelling of “iodine.”","zh":"“iode”不是标准英语；通常是法语“碘（iodine）”或“iodine”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard form in English; most often a misspelling or a French word meaning “iodine.” In English, the correct word is usually “iodine.”","zh":"英语中并非常用或标准拼写；多半是拼写错误，或来自法语，意思是“碘”。英语里通常应写作“iodine（碘）”。"},"examples":[{"en":"In English, you would usually write “iodine,” not “iode.”","zh":"在英语里通常写作“iodine”，而不是“iode”。"},{"en":"The French word “iode” refers to iodine, an element used in iodized salt.","zh":"法语“iode”指“碘”，一种用于加碘盐的化学元素。"}]}],"synonyms":["iodine","I"],"phonetic":"/ˈaɪəˌdaɪn/","extraExplanation":["“iode”在法语里很常见（= 英语 iodine）。如果你是在化学/营养学语境里看到的，英语更常用：iodine（碘）、iodide（碘化物）。","如果你想查的是缩写“IODE”，请告诉我具体领域/上下文（例如组织名、课程名、文件标题），我可以按那个含义解释。"]}
{"word":"iodhydrate","summary":{"en":"“Iodhydrate” is a rare, nonstandard chemistry term, usually meaning “iodine hydrate” (a water-containing crystalline compound of iodine).","zh":"“iodhydrate”是罕见且非标准的化学用词，通常指“iodine hydrate（碘水合物/碘水合晶体）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard term, usually seen in older chemistry writing, referring to a hydrate (water-containing crystal) involving iodine—often meaning “iodine hydrate” (an iodine–water crystalline compound).","zh":"一种非常少见、非标准的用词，多见于较早的化学文献，指与碘有关的“水合物”（含结晶水的晶体），常用来表示“碘水合物/碘水合晶体”。"},"examples":[{"en":"Some older texts describe iodine forming an “iodhydrate” at low temperatures.","zh":"一些较早的文献描述碘在低温下会形成“iodhydrate（碘水合物）”。"},{"en":"In modern writing, you are more likely to see the term iodine hydrate instead of iodhydrate.","zh":"在现代写法中，你更可能看到 iodine hydrate（碘水合物）而不是 iodhydrate。"}]}],"synonyms":["iodine hydrate","iodine clathrate (in some contexts)"],"phonetic":"/ˌaɪoʊˈhaɪdreɪt/","extraExplanation":["“iodhydrate”在当代英语里几乎不用，很多情况下可能是拼写变体、旧译名，或把 iodine hydrate（碘水合物）简写/误写成一个词。","如果你是在化学语境里遇到它，建议回到原文上下文确认它具体指哪一种“碘的水合物/含水晶体”（不同体系写法可能不同）。","如果你想查的是日常英语单词，可能你要输入的是 dehydrate（脱水）或 hydrate（水合/补水）；你可以告诉我原句，我帮你判断。"]}
{"word":"iodhydric","summary":{"en":"“Iodhydric” is a rare chemistry adjective meaning “hydriodic,” related to hydrogen iodide (HI) or hydriodic acid.","zh":"“iodhydric”是很少见的化学形容词，意思相当于“hydriodic”，指与碘化氢（HI）或氢碘酸有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to hydrogen iodide (HI), especially in water; the same as hydriodic.","zh":"（化学）与碘化氢（HI）有关的；尤指其水溶液（氢碘酸）；同 hydriodic。"},"examples":[{"en":"Hydrogen iodide dissolved in water is sometimes described as an iodhydric (hydriodic) acid solution.","zh":"碘化氢溶于水后，有时会被描述为 iodhydric（即 hydriodic）酸溶液。"},{"en":"In older texts, you may see “iodhydric acid” used where modern books say “hydriodic acid.”","zh":"在较旧的文献中，你可能会看到用“iodhydric acid”来指现代教材所说的“hydriodic acid（氢碘酸）”。"}]}],"synonyms":["hydriodic","hydriodic acid (as a noun phrase)"],"phonetic":"/ˌaɪ.oʊdˈhaɪ.drɪk/","extraExplanation":["“iodhydric”在现代英语中非常少见，多出现在旧式或翻译体的化学用语里。如今更常用的对应词是“hydriodic”，名词通常写作“hydriodic acid”。","词形理解：iod- 表示“碘”，-hydric 表示“与氢有关/含氢的”。但标准化学命名里通常不用“iodhydric”这一拼法。"]}
{"word":"iodhydrin","summary":{"en":"Iodhydrin is a chemistry term for an iodoalcohol (a compound containing both iodine and –OH), often formed from alkenes.","zh":"Iodhydrin 是化学术语，指含“碘(I)”与“羟基(–OH)”的碘醇，常由烯烃反应生成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains both an iodine atom (I) and a hydroxyl group (–OH), usually on neighboring carbon atoms; often formed when iodine reacts with an alkene in the presence of water (or similar conditions).","zh":"碘醇（含碘与羟基的化合物）：分子中同时含有碘原子（I）和羟基（–OH），通常位于相邻的碳原子上；常由碘在有水等条件下与烯烃反应生成。"},"examples":[{"en":"In organic synthesis, an iodhydrin can be made by adding iodine and water across a carbon–carbon double bond.","zh":"在有机合成中，碘和水可以加成到碳碳双键上生成碘醇（iodhydrin）。"},{"en":"The iodhydrin was then converted into an epoxide under basic conditions.","zh":"该碘醇随后在碱性条件下转化为环氧化物。"}]}],"synonyms":["iodohydrin","iodoalcohol","halohydrin (broader term)"],"phonetic":"/ˌaɪoʊˈdaɪdrɪn/","extraExplanation":["“iodhydrin”在现代教材与论文中更常见的拼写是“iodohydrin”。它属于“卤代醇（halohydrin）”的一种（卤素可为Cl/Br/I）。","在反应语境里，碘醇常作为中间体：羟基与碘位于邻位时，碱可促使分子内取代，生成环氧化物（epoxide），这是有机合成里很常见的一步。"]}
{"word":"iodic","summary":{"en":"Iodic means “related to iodine,” especially in chemistry (e.g., iodic acid).","zh":"iodic 意为“与碘有关的/含碘的”，多用于化学语境（如 iodic acid 碘酸）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to iodine; containing iodine.","zh":"与碘有关的；含碘的。"},"examples":[{"en":"Seaweed is rich in iodic compounds.","zh":"海藻富含含碘化合物。"},{"en":"The lab tested the sample for iodic content.","zh":"实验室检测了样品中的含碘量。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to iodic acid (HIO₃), a chemical acid made from iodine and oxygen.","zh":"（化学）与碘酸（HIO₃）有关的。"},"examples":[{"en":"Iodic acid is used as an oxidizing agent in some reactions.","zh":"在某些反应中，碘酸可用作氧化剂。"},{"en":"The solution contained iodic acid, so we handled it carefully.","zh":"溶液中含有碘酸，因此我们小心处理。"}]}],"synonyms":["iodine-related","iodinated"],"phonetic":"/aɪˈɑdɪk/","extraExplanation":["“iodic”主要出现在化学或医学相关语境中；日常英语里更常见的是 iodine（碘）或 iodide（碘化物）。","常见搭配：iodic acid（碘酸）。另外还有 periodic（周期性的）容易与其拼写混淆，但含义完全不同。"]}
{"word":"iodid","summary":{"en":"Iodide is a compound (or ion form) of iodine, commonly discussed in chemistry and thyroid-related health topics.","zh":"Iodide 指碘以离子形式（I⁻）存在的碘化物，常见于化学与甲状腺健康相关话题中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound containing iodine in the form of the iodide ion (I⁻); often used in chemistry, medicine, and nutrition","zh":"（化学）碘化物；含有碘离子（I⁻）的化合物，常见于化学、医药与营养领域"},"examples":[{"en":"Potassium iodide is sometimes used to help protect the thyroid during certain nuclear emergencies.","zh":"在某些核事故紧急情况下，碘化钾有时用于帮助保护甲状腺。"},{"en":"The lab tested the sample for iodide levels.","zh":"实验室检测了样品中的碘化物含量。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to iodide (especially the iodide ion)","zh":"（形容词用法）与碘化物（尤其是碘离子）有关的"},"examples":[{"en":"The solution contains iodide ions.","zh":"该溶液含有碘离子。"},{"en":"Iodide deficiency can affect thyroid function.","zh":"碘化物（碘摄入）不足会影响甲状腺功能。"}]}],"synonyms":["iodide ion","I⁻","potassium iodide (KI)","sodium iodide (NaI)"],"phonetic":"/ˈaɪəˌdaɪd/","extraExplanation":["你输入的“iodid”更常见的正确拼写是 **iodide**（碘化物）。在日常健康语境里，人们也会提到 **iodized salt**（加碘盐），与预防缺碘相关。注意：**iodine（碘）**是元素本身，而 **iodide（碘化物/碘离子）**通常指碘以离子形式存在时的化学形态。"]}
{"word":"iodide","summary":{"en":"Iodide is the iodide ion (I⁻) or a compound (often a salt) that contains it.","zh":"Iodide 指碘离子（I⁻），也可指含有该离子的化合物（常见为盐类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains iodide ions (I⁻), such as sodium iodide (NaI) or potassium iodide (KI)","zh":"含有碘离子（I⁻）的化合物，例如碘化钠（NaI）或碘化钾（KI）"},"examples":[{"en":"Potassium iodide is sometimes used to protect the thyroid in certain radiation emergencies.","zh":"在某些辐射紧急情况下，碘化钾有时用于保护甲状腺。"},{"en":"The lab prepared a solution of sodium iodide for the experiment.","zh":"实验室为实验配制了一份碘化钠溶液。"}]},{"partOfSpeech":"n.","definition":{"en":"the iodide ion (I⁻) itself, a negatively charged form of iodine","zh":"碘离子（I⁻）本身，即带负电的碘形态"},"examples":[{"en":"In this reaction, iodide is oxidized to iodine.","zh":"在这个反应中，碘离子被氧化成碘单质。"},{"en":"The test detects iodide in water samples.","zh":"该测试可检测水样中的碘离子。"}]}],"synonyms":["iodide ion","I−","iodine salt"],"phonetic":"/ˈaɪəˌdaɪd/","extraExplanation":["“Iodide”常和“iodine（碘）”一起出现，但两者不同：iodine通常指元素碘（如 I2），而iodide指带负电的碘离子（I⁻）或含这种离子的盐类（如 KI）。在营养与健康语境中，人们提到的“碘盐”常与碘（或碘化物）的添加有关。"]}
{"word":"iodides","summary":{"en":"“Iodides” is the plural of “iodide,” meaning compounds containing iodide ions (I⁻).","zh":"“iodides”是“iodide”的复数，指含有碘离子（I⁻）的化合物/盐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Salts or compounds that contain iodide ions (I⁻), often used in chemistry and medicine.","zh":"含有碘离子（I⁻）的盐或化合物，常用于化学与医学领域。"},"examples":[{"en":"In the lab, we tested several iodides to see which ones dissolve easily in water.","zh":"在实验室里，我们测试了几种碘化物，看看哪些更容易溶于水。"},{"en":"Some iodides are used in medical imaging as part of contrast agents.","zh":"一些碘化物用于医学成像，作为造影剂的一部分。"}]}],"synonyms":["iodide salts","iodine compounds"],"phonetic":"/ˈaɪəˌdaɪdz/","extraExplanation":["“iodides”是“iodide”的复数形式，常见于化学/医学语境。日常英语里更常见的是具体名称，如“potassium iodide（碘化钾）”。","在营养与健康语境中，人们也会提到“iodide”与甲状腺相关（身体需要少量碘来合成甲状腺激素），但补充应遵医嘱。"]}
{"word":"iodids","summary":{"en":"Iodide is an iodine-containing ion or compound, especially the iodide ion (I⁻) found in salts like potassium iodide.","zh":"Iodide 指含碘离子（I⁻）的离子或化合物，常见于碘化钾等盐类中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical ion or compound that contains iodine in the form of iodide (I⁻), often found in salts (e.g., potassium iodide).","zh":"一种含有碘离子（I⁻）的化学离子或化合物，常见于盐类中（如碘化钾）。"},"examples":[{"en":"Table salt is sometimes fortified with iodide to help prevent iodine deficiency.","zh":"食盐有时会添加碘化物，以帮助预防缺碘。"},{"en":"The doctor prescribed potassium iodide in an emergency plan.","zh":"医生在应急方案中开了碘化钾。"}]},{"partOfSpeech":"n.","definition":{"en":"the iodide ion (I⁻) specifically, used in chemistry when discussing reactions and solutions.","zh":"（特指）碘离子（I⁻），化学中用于讨论反应与溶液时的说法。"},"examples":[{"en":"Silver nitrate reacts with iodide to form a yellow precipitate.","zh":"硝酸银与碘离子反应会生成黄色沉淀。"},{"en":"The sample tested positive for iodide in the solution.","zh":"样品检测显示溶液中含有碘离子。"}]}],"synonyms":["iodide ion","I− (iodide)","iodine salt"],"phonetic":"/ˈaɪəˌdaɪd/","extraExplanation":["你输入的“iodids”更常见的正确拼写是 **iodides**（iodide 的复数：碘化物/碘化物类化合物）。单数形式是 **iodide**。","在日常英语里，iodide 多出现在医学与化学语境（如“iodide in salt”食盐加碘、或实验中的“iodide ion”碘离子）。"]}
{"word":"iodiferous","summary":{"en":"Iodiferous means “containing or producing iodine,” used mostly in scientific contexts.","zh":"iodiferous 意为“含碘的/产碘的”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scientific) containing iodine, producing iodine, or having an iodine-like quality.","zh":"（科学用语）含碘的；产碘的；具有碘样特征的。"},"examples":[{"en":"Some seaweeds grow in iodine-rich waters and are described as iodiferous.","zh":"一些海藻生长在富含碘的海水中，因此可被描述为“含碘的（iodiferous）”。"},{"en":"Geologists reported iodiferous brine in several deep wells.","zh":"地质学家报告说，几口深井中发现了含碘盐水。"}]}],"synonyms":["iodine-rich","iodine-bearing","containing iodine"],"phonetic":"/ˌaɪoʊˈdɪfərəs/","extraExplanation":["这是一个相对少见、偏学术的词，常见于化学、地质学、海洋生物与矿物学语境，用来说明“含有/产出碘”的性质。日常英语里更常用 iodine-rich（富含碘的）或 contains iodine（含碘）。"]}
{"word":"iodimetric","summary":{"en":"Iodimetric means “related to iodimetry,” a titration method using iodine to measure reducing agents.","zh":"iodimetric 指“与碘量法（用碘滴定测定还原剂）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an analytical chemistry method (iodimetry) that uses iodine (I₂) in a titration to measure the amount of a reducing agent (something that donates electrons).","zh":"（分析化学）与“碘量法/碘滴定法（iodimetry）”有关的；指用碘（I₂）作滴定剂来测定还原剂（供电子物质）含量的方法。"},"examples":[{"en":"We used an iodimetric titration to determine how much vitamin C was in the tablet.","zh":"我们用碘量滴定来测定这片维生素C片中维生素C的含量。"},{"en":"The report compares iodimetric and iodometric methods for analyzing sulfur dioxide.","zh":"报告比较了碘量法和碘量间接法在测定二氧化硫方面的差异。"}]}],"synonyms":["iodimetry-related","iodine titration (context-dependent)"],"phonetic":"/ˌaɪoʊdəˈmɛtrɪk/","extraExplanation":["“iodimetric”来自 iodine（碘）+ -metric（测量的）。在常见用法里，它特指“直接用碘作滴定剂”的碘量法（iodimetry）。\n\n学习提示：常与“iodometric（碘量间接法）”对比。iodometric 通常是先生成碘（例如用碘化物在氧化剂作用下放出碘），再用硫代硫酸钠滴定；而 iodimetric 是直接用碘溶液滴定还原性物质。"]}
{"word":"iodimetry","summary":{"en":"Iodimetry is a titration method that uses iodine to measure the amount of another substance.","zh":"iodimetry 指用碘参与的滴定来测定其他物质含量的分析方法（碘量法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A laboratory method of chemical analysis that measures how much iodine is used (or produced) in a titration to find the amount of another substance, often a reducing agent such as vitamin C or sulfites.","zh":"一种化学分析方法：通过滴定过程中碘的消耗量（或生成量）来测定另一种物质的含量，常用于测定还原性物质，如维生素C或亚硫酸盐。"},"examples":[{"en":"In our lab, we used iodimetry to determine the vitamin C content of orange juice.","zh":"在实验课上，我们用碘量法测定橙汁中的维生素C含量。"},{"en":"Iodimetry often uses starch as an indicator because it turns blue-black in the presence of iodine.","zh":"碘量法常用淀粉作指示剂，因为遇到碘会变成蓝黑色。"}]}],"synonyms":["iodine titration","iodine titrimetry"],"phonetic":"/ˌaɪoʊˈdɪmətri/","extraExplanation":["“iodimetry（碘量法）”常与“iodometry（碘量滴定/碘量法的另一类）”混淆：在很多教材里，iodimetry通常指“用标准碘溶液直接滴定还原剂（碘被消耗）”；而iodometry常指“先生成碘（例如用碘化物被氧化生成I₂），再用硫代硫酸钠滴定碘”。不同课程/地区的用法可能略有差异，读论文或教材时建议看清具体反应体系与滴定剂。","词源提示：iod- 来自 iodine（碘），-metry 来自希腊语“measure（测量）”，整体意思就是“用碘来测量（定量分析）”。"]}
{"word":"iodin","summary":{"en":"Iodine is a chemical element needed for thyroid health; it can also mean an iodine-based antiseptic used on skin.","zh":"Iodine 指“碘”这种人体所需的化学元素，也可指外用的含碘消毒液。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol I) used by the body to make thyroid hormones; commonly added to salt or taken as a supplement to prevent iodine deficiency","zh":"碘（化学元素，符号 I）；人体用来合成甲状腺激素，常加到食盐中或作为补充剂以预防缺碘"},"examples":[{"en":"Iodine is important for healthy thyroid function.","zh":"碘对甲状腺的正常功能很重要。"},{"en":"Many countries sell iodized salt to help prevent iodine deficiency.","zh":"许多国家销售加碘盐来帮助预防缺碘。"}]},{"partOfSpeech":"n.","definition":{"en":"a dark-brown antiseptic solution containing iodine, used on skin to help prevent infection","zh":"含碘的消毒液（常呈深棕色），用于皮肤表面帮助预防感染"},"examples":[{"en":"The nurse cleaned the cut with iodine before covering it.","zh":"护士先用碘消毒液清洁伤口，再进行包扎。"},{"en":"Some people are sensitive to iodine antiseptics.","zh":"有些人对含碘消毒剂比较敏感。"}]}],"synonyms":["I","iodine solution","antiseptic (iodine-based)"],"phonetic":"/ˈaɪəˌdaɪn/","extraExplanation":["你输入的“iodin”通常是拼写不完整或拼错，标准拼法是 **iodine**。","注意区分：**iodine（碘）** 是元素；**iodide（碘化物）** 是含碘的化合物/离子（如 potassium iodide 碘化钾）。","在医疗语境里，日常说的“iodine”常指外用的碘伏/碘酊等消毒制剂；但具体产品成分不同，表达时可说 **iodine solution** 或直接说品牌/类型。"]}
{"word":"iodinate","summary":{"en":"Iodinate means to add iodine to something, especially salt, or to treat something with iodine in a scientific/medical setting.","zh":"iodinate 指给某物加碘（尤其是食盐），或在科研/医疗情境中用碘处理某物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add iodine to something (often salt, food, or water) to prevent iodine deficiency and related health problems","zh":"给某物（常见于食盐、食物或饮用水）添加碘，以预防缺碘及相关健康问题"},"examples":[{"en":"Many countries iodinate table salt to help prevent goiter.","zh":"许多国家会对食盐进行加碘，以帮助预防甲状腺肿大。"},{"en":"This program aims to iodinate salt in rural areas where people get too little iodine.","zh":"该项目旨在为农村地区的食盐加碘，因为那里的人群碘摄入不足。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat a substance with iodine in a lab or medical context (for staining, disinfection, or chemical reactions)","zh":"在实验室或医疗环境中用碘处理某种物质（用于染色、消毒或化学反应）"},"examples":[{"en":"The technician iodinated the sample before examining it under the microscope.","zh":"技术员在显微镜观察前用碘处理了样本。"},{"en":"Some solutions are iodinated to make certain structures easier to see.","zh":"有些溶液会进行碘化处理，以便更清晰地观察某些结构。"}]}],"synonyms":["iodize","add iodine to","fortify (with iodine)","iodize salt","treat with iodine"],"phonetic":"/ˈaɪəˌdɪneɪt/","extraExplanation":["“iodinate”来自“iodine（碘）+ -ate（使……化/使含有……）”。在公共卫生语境里，最常见搭配是“iodinated salt（加碘盐）”。","注意与“iodize”区分：两者都可表示“加碘”，但在某些地区或专业写作中，“iodize/iodise”更常见；“iodinated”也常用作形容词，表示“已加碘的”。"]}
{"word":"iodinated","summary":{"en":"Iodinated means “containing iodine” or “treated with iodine,” especially in medical contrast agents.","zh":"iodinated 指“含碘的”或“用碘处理过的”，尤其常见于医学造影剂等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing iodine; having iodine added (often for medical imaging or disinfection).","zh":"含碘的；加了碘的（常用于医学造影或消毒）。"},"examples":[{"en":"The doctor ordered an iodinated contrast scan to get a clearer image.","zh":"医生安排了使用含碘造影剂的扫描，以获得更清晰的图像。"},{"en":"Some people are allergic to iodinated contrast dye.","zh":"有些人对含碘造影剂过敏。"}]},{"partOfSpeech":"adj.","definition":{"en":"Treated with iodine (to disinfect or to label a substance in research).","zh":"用碘处理过的（用于消毒或在研究中做标记）。"},"examples":[{"en":"The wound was cleaned with an iodinated solution.","zh":"伤口用碘溶液清洗过。"},{"en":"Researchers used an iodinated compound to track how the drug moved in the body.","zh":"研究人员使用含碘化合物来追踪药物在体内的移动。"}]}],"synonyms":["iodine-containing","iodine-treated","iodized"],"phonetic":"/ˈaɪəˌdeɪtɪd/","extraExplanation":["在医疗语境中最常见的搭配是 iodinated contrast（含碘造影剂/碘造影剂），常用于 CT 等检查。若你看到 iodine allergy（碘过敏）的说法，临床上更多指对“含碘造影剂”的过敏反应，而不是对食盐中的碘本身。","词形来源：iodinated = iodine（碘）+ -ate（使……化/处理）+ -ed（过去分词作形容词），意思就是“被加了碘/被碘处理过的”。"]}
{"word":"iodinates","summary":{"en":"“Iodinates” can mean “adds iodine/treats with iodine” (verb form of iodinate) or “iodinate compounds” (plural noun in chemistry).","zh":"“iodinates”既可表示“进行碘化/用碘处理”（动词形式），也可指“iodinate类化合物”（化学名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(chemistry) third-person singular of “iodinate”: to add iodine to a substance, or to treat something with iodine (often for disinfection or in chemical reactions).","zh":"（化学）“iodinate”的第三人称单数：向物质中引入碘；或用碘处理（常用于消毒或化学反应）。"},"examples":[{"en":"The lab iodinates the sample to trace how the compound reacts.","zh":"实验室给样品进行碘化处理，以追踪该化合物如何反应。"},{"en":"This process iodinates the solution so it can be measured more easily.","zh":"这个过程会使溶液碘化，从而更容易测量。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “iodinate”: a chemical compound (a salt or ester) related to iodic acid, used in specialized chemical contexts.","zh":"“iodinate”的复数：与碘酸相关的一类化合物（盐或酯），用于较专业的化学语境。"},"examples":[{"en":"Some iodinates are studied for their stability under heat.","zh":"有些碘酸盐/碘酸酯（iodinates）会因其耐热稳定性而被研究。"},{"en":"The paper compares iodides, iodates, and iodinates in different conditions.","zh":"论文比较了碘化物、碘酸盐以及碘酸酯/碘酸盐类（iodinates）在不同条件下的表现。"}]}],"synonyms":["iodizes","adds iodine to","treats with iodine","iodinizes"],"phonetic":"/aɪˈoʊdəˌneɪts/","extraExplanation":["“iodinate”在日常英语里很少见，更常见的是“iodine”（碘）、“iodide”（碘化物）和“iodate”（碘酸盐）。在化学写作中，“iodinate(s)”可能指某类与碘酸有关的盐/酯；但具体含义常依论文或配方的命名习惯而定。","拼写提示：如果你想表达“碘酸盐（IO₃⁻的盐）”，更常用的词是“iodate(s)”。如果你能提供一句原文，我可以帮你判断这里的“iodinates”究竟是动词还是名词、以及最贴切的中文译法。"]}
{"word":"iodinating","summary":{"en":"Iodinating means treating something with iodine or adding iodine to it, especially in medicine, public health, and chemistry.","zh":"iodinating 指用碘处理或给某物加入碘，常用于医学、公共卫生和化学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add iodine to something, or to treat something with iodine (for example, salt, water, or a wound)","zh":"给某物加入碘；用碘处理/消毒（例如给食盐加碘、给水加碘或用碘处理伤口）"},"examples":[{"en":"Many countries are iodinating table salt to help prevent iodine deficiency.","zh":"许多国家正在对食盐进行加碘，以帮助预防碘缺乏。"},{"en":"The nurse is iodinating the skin before the injection.","zh":"护士在注射前用碘处理皮肤进行消毒。"}]},{"partOfSpeech":"vt.","definition":{"en":"(chemistry) to introduce iodine into a molecule through a chemical reaction","zh":"（化学）通过反应把碘引入分子结构中（进行碘化反应）"},"examples":[{"en":"The lab is iodinating the compound to make it easier to detect.","zh":"实验室正在对该化合物进行碘化，以便更容易检测。"},{"en":"Iodinating aromatic rings often changes their reactivity.","zh":"对芳香环进行碘化通常会改变其反应性。"}]}],"synonyms":["iodizing","adding iodine","iodine-treating","iodination"],"phonetic":"/ˈaɪəˌdeɪˌneɪtɪŋ/","extraExplanation":["“iodinating”是动词“iodinate”的现在分词/动名词形式，常见于科学、医学和公共卫生语境。","在公共卫生中，“iodinating salt”通常指“给食盐加碘”（也可说“iodizing salt”）；两者意思接近，但“iodizing”在日常与政策文本中更常见。"]}
{"word":"iodination","summary":{"en":"Iodination means the process of adding iodine—commonly in chemistry/biology (to modify or label molecules) and sometimes in medicine (disinfecting with iodine).","zh":"Iodination 指“碘化”的过程：最常见于化学/生物中为分子引入碘（用于改性或标记），也可指医学上用碘进行消毒处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry/biology) The process of adding iodine to a substance, or introducing iodine into a molecule (often to label it or change its chemical properties).","zh":"（化学/生物）碘化；把碘加入某种物质，或把碘引入分子中的过程（常用于标记或改变其化学性质）。"},"examples":[{"en":"Iodination is used to label proteins so researchers can track them.","zh":"碘化常用于给蛋白质做标记，方便研究人员追踪它们。"},{"en":"The lab performed iodination of the compound to make it easier to detect.","zh":"实验室对该化合物进行了碘化处理，使其更容易被检测到。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medicine) Treatment or disinfection by applying iodine, especially to wounds or skin.","zh":"（医学）用碘进行处理或消毒，尤指用于伤口或皮肤。"},"examples":[{"en":"The nurse cleaned the cut with iodination before bandaging it.","zh":"护士先用碘消毒伤口，再进行包扎。"}]}],"synonyms":["iodization","iodizing","iodine labeling","iodine treatment"],"phonetic":"/ˌaɪoʊdɪˈneɪʃən/","extraExplanation":["“iodination”来自“iodine（碘）+ -ation（……的过程）”。在科研语境里最常见的是指把碘原子接到分子上（例如有机合成中的芳环碘化），或用放射性碘（如 I-125、I-131）对蛋白/抗体进行“标记”，便于成像或定量。","医学上更常见的日常表达是“use iodine to disinfect / apply iodine”，而不是正式名词“iodination”；在论文或说明书里才更可能看到该名词。"]}
{"word":"Iodine","summary":{"en":"Iodine is a chemical element needed by the body in small amounts and also refers to iodine-based antiseptics used for disinfection.","zh":"碘既指人体所需的化学元素（微量营养素），也可指用于消毒的含碘制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical element (symbol I) that the human body needs in small amounts, especially for healthy thyroid function; often added to salt to prevent deficiency.","zh":"碘（化学元素，符号 I）：人体所需的微量元素，尤其与甲状腺功能有关；常添加到食盐中以预防缺碘。"},"examples":[{"en":"Many countries add iodine to table salt to help prevent thyroid problems.","zh":"许多国家在食盐中添加碘，以帮助预防甲状腺问题。"},{"en":"Seafood and seaweed are natural sources of iodine.","zh":"海鲜和海藻是碘的天然来源。"}]},{"partOfSpeech":"n.","definition":{"en":"A dark purple substance used as an antiseptic or disinfectant, especially in “iodine solution,” to clean skin or wounds.","zh":"（消毒用）碘制剂：深紫色物质，常以“碘溶液/碘酒”的形式用于皮肤或伤口消毒。"},"examples":[{"en":"The nurse cleaned the cut with iodine before applying a bandage.","zh":"护士先用碘给伤口消毒，然后再贴上绷带。"},{"en":"Some people are sensitive to iodine-based antiseptics.","zh":"有些人对含碘的消毒剂比较敏感。"}]}],"synonyms":["I","iodized salt (related)","antiseptic (related)","disinfectant (related)"],"phonetic":"/ˈaɪəˌdaɪn/","extraExplanation":["“iodine”来自希腊语 iodes，意为“紫色的”，因为碘蒸气呈紫色。","日常语境里常见搭配：iodized salt（加碘盐）、iodine deficiency（缺碘）、iodine solution/tincture of iodine（碘溶液/碘酒）。"]}
{"word":"iodine","summary":{"en":"Iodine is an element needed for thyroid health and is also used as a disinfectant.","zh":"碘是一种对甲状腺健康必需的元素，也常用作消毒剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (I) used in small amounts by the body to make thyroid hormones; often added to salt or used in medicine","zh":"碘（化学元素I）：人体少量必需，用于合成甲状腺激素；常被添加到食盐中或用于医药"},"examples":[{"en":"Iodine is essential for healthy thyroid function.","zh":"碘对健康的甲状腺功能至关重要。"},{"en":"Many countries sell iodized salt to help prevent iodine deficiency.","zh":"许多国家出售加碘盐来帮助预防缺碘。"},{"en":"The doctor cleaned the cut with an iodine solution.","zh":"医生用碘溶液清洁伤口。"}]},{"partOfSpeech":"v.","definition":{"en":"to treat or disinfect something with iodine","zh":"用碘处理（或消毒）某物"},"examples":[{"en":"They iodine the wound before putting on a bandage.","zh":"他们先用碘给伤口消毒，再贴上绷带。"}]}],"synonyms":["element I","iodized salt (related)","povidone-iodine (related)"],"phonetic":"/ˈaɪəˌdaɪn/","extraExplanation":["“iodine”这个词来自希腊语词根，和“紫色/紫罗兰色”有关，因为碘在加热时会产生紫色蒸气。","常见搭配：iodized salt（加碘盐）、iodine deficiency（缺碘）、tincture of iodine（碘酊/碘酒）、povidone-iodine（聚维酮碘，常见消毒剂）。"]}
{"word":"iodines","summary":{"en":"“Iodines” is the plural of “iodine,” used when talking about different kinds/sources of iodine or iodine-based antiseptics.","zh":"“iodines”是“iodine（碘）”的复数，用于指不同种类/来源的碘或不同的含碘消毒制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of iodine (a chemical element used in the body and in medicine).","zh":"iodine（碘）的复数形式；指多种“碘”或含碘物质/用量。"},"examples":[{"en":"Some seaweeds contain higher levels of iodines than most vegetables.","zh":"有些海藻的含碘量比大多数蔬菜更高。"},{"en":"The lab compared different iodines used in the reaction.","zh":"实验室比较了反应中使用的不同含碘物质。"}]},{"partOfSpeech":"n.","definition":{"en":"different iodine-based antiseptic solutions (plural), often used for disinfecting skin.","zh":"（复数）不同种类的含碘消毒剂（如碘酒、碘伏等），常用于皮肤消毒。"},"examples":[{"en":"The clinic keeps several iodines for different types of wounds.","zh":"诊所备有几种含碘消毒剂，用于不同类型的伤口。"},{"en":"She used one of the iodines to clean the cut before bandaging it.","zh":"她用其中一种含碘消毒剂清洁伤口后再包扎。"}]}],"synonyms":["iodine compounds","iodine solutions","povidone-iodine (type)","tincture of iodine (type)"],"phonetic":"ˈaɪəˌdaɪn","extraExplanation":["“iodines”并不如“iodine”常见。日常语境里多用不可数名词“iodine”（如：need more iodine）。当说“不同种类/来源的碘或含碘制剂”“多次用量/样品”时，才更可能用复数“iodines”。","常见相关表达：iodized salt（加碘盐）、iodine deficiency（碘缺乏）、povidone-iodine（聚维酮碘/碘伏）、tincture of iodine（碘酒）。"]}
{"word":"iodinium","summary":{"en":"Iodinium is a positively charged iodine species, often referring to an iodonium ion used in organic chemistry.","zh":"Iodinium 指带正电的含碘物种，常用来指有机化学中的碘鎓（iodonium）离子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A positively charged iodine-containing ion (a cation), especially a hypervalent iodine(III) species used in organic chemistry (often called an iodonium ion).","zh":"“碘鎓离子”：带正电的含碘离子（阳离子），尤指有机化学中常见的高价碘(III)物种（也常称为 iodonium ion）。"},"examples":[{"en":"The reaction proceeds via an iodinium intermediate that activates the double bond.","zh":"该反应通过一个碘鎓中间体进行，它会活化双键。"},{"en":"In the lab, iodonium salts are often used as electrophilic iodine sources.","zh":"在实验室里，碘鎓盐常被用作亲电碘试剂来源。"}]}],"synonyms":["iodonium","iodonium ion","iodonium cation"],"phonetic":"/ˌaɪəˈdɪniəm/","extraExplanation":["“iodinium”在英文文献中相对少见，更常见的标准写法是“iodonium”（如 iodonium ion / iodonium salt）。不同教材或论文可能因为命名体系而出现“iodinium”。","它通常出现在有机反应机理中，用来描述“碘作为正电中心”的中间体或盐类；若你是在阅读化学论文，看到的多半与加成反应、芳基转移或亲电碘化有关。"]}
{"word":"iodinophil","summary":{"en":"Iodinophil means “iodine-loving”: it describes cells/tissues/particles that bind iodine and stain easily; it can also name such a structure.","zh":"iodinophil 意为“嗜碘的/易被碘染色的”，用于描述对碘有亲和力、染色明显的细胞/组织/颗粒，也可作名词指这种结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Showing an affinity for iodine; easily stained by iodine (often used for certain cells, bacteria, or tissues).","zh":"（生物/医学）嗜碘的；对碘有亲和力的；容易被碘染色的（常用于描述某些细胞、细菌或组织）。"},"examples":[{"en":"Under the microscope, the lab noted iodinophil granules that turned dark after iodine staining.","zh":"在显微镜下，实验室观察到嗜碘颗粒，在碘染色后变深。"},{"en":"Some organisms are described as iodinophil because their structures bind iodine strongly.","zh":"有些生物被描述为嗜碘的，因为它们的结构会强烈结合碘。"}]},{"partOfSpeech":"n.","definition":{"en":"Something (such as a cell or particle) that is iodinophil—i.e., it takes up iodine stain readily.","zh":"（某物）嗜碘体；易吸收碘染色的细胞或颗粒等。"},"examples":[{"en":"The report mentioned several iodinophils in the sample.","zh":"报告提到样本中有几个嗜碘体。"}]}],"synonyms":["iodinophilic","iodophilic"],"phonetic":"ˌaɪoʊˈdɪnəfɪl","extraExplanation":["词源提示：iodino- 表示“碘”，-phil 表示“喜爱/亲和”。因此 iodinophil 字面意思是“喜欢碘的”。","使用场景：多见于组织学、微生物学或寄生虫学的实验记录，描述“被碘染色后更明显”的结构（例如某些颗粒、包涵体等）。在日常英语中几乎不用。","相关词：iodinophilic（更常见的同义形容词，意思相同）；对比：eosinophilic（嗜伊红的）、basophilic（嗜碱的），都是“对某种染料有亲和力”的表达。"]}
{"word":"iodinophile","summary":{"en":"Iodinophile describes something (or someone/thing in a sample) that readily takes up iodine stain—showing an affinity for iodine.","zh":"Iodinophile 指对碘有亲和力、容易被碘染色的（或样本中的嗜碘性结构/细胞）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Able to be stained by iodine; showing a strong affinity for iodine in a lab test.","zh":"（生物/医学）可被碘染色的；在实验检测中对碘有较强亲和力的。"},"examples":[{"en":"Some starch-rich granules are iodinophile and turn dark when iodine is added.","zh":"一些富含淀粉的颗粒具有嗜碘性，加入碘后会变深色。"},{"en":"The report described iodinophile structures under the microscope.","zh":"报告描述了显微镜下的嗜碘性结构。"}]},{"partOfSpeech":"n.","definition":{"en":"A structure, cell, or organism that takes up iodine stain readily.","zh":"（指结构/细胞/生物）容易吸收碘染色的对象；嗜碘性结构（或细胞/生物）。"},"examples":[{"en":"The lab noted several iodinophiles in the sample.","zh":"实验室在样本中记录到几个嗜碘性结构。"}]}],"synonyms":["iodinophilic","iodophilic","iodine-staining"],"phonetic":"/aɪˈoʊdəˌnaɪl/","extraExplanation":["这个词多见于显微镜检查、组织学/细胞学或微生物学语境，常用于描述“对碘染色反应明显”的结构（例如含淀粉或多糖的物质在碘作用下颜色变化更明显）。","词形上可类比 -phile（“喜爱/亲和”），表示“对……有亲和力”。实际写作中也常见同义形容词 iodinophilic（嗜碘性的）。"]}
{"word":"iodinophilic","summary":{"en":"Iodinophilic describes something that has an affinity for iodine, especially something that stains readily with iodine in laboratory testing.","zh":"Iodinophilic 用来描述对碘有亲和性、在实验（尤其碘染色）中容易被碘染色的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Having an affinity for iodine; easily stained or colored by iodine in lab tests.","zh":"（生物/医学）嗜碘的；对碘有亲和性；在实验中容易被碘染色的。"},"examples":[{"en":"Some carbohydrates are iodinophilic and turn dark when iodine is added.","zh":"一些碳水化合物具有嗜碘性，加入碘后会变深色。"},{"en":"The pathologist noted iodinophilic granules under the microscope after iodine staining.","zh":"病理学家在碘染色后在显微镜下观察到嗜碘性颗粒。"}]}],"synonyms":["iodine-affinitive","iodophilic"],"phonetic":"/ˌaɪ.oʊ.dɪn.əˈfɪl.ɪk/","extraExplanation":["这个词常见于组织学/病理学报告。“-philic”表示“喜爱/亲和”，如 hydrophilic（亲水）、lipophilic（亲脂）。因此 iodinophilic 字面意思就是“对碘有亲和性”，通常指某些结构在碘染色中更容易显色。","常见相关检测是“碘-淀粉反应”：淀粉遇碘呈蓝黑色，因此含淀粉或与之相关的结构在某些语境下会被描述为 iodinophilic。"]}
{"word":"iodinophilous","summary":{"en":"Iodinophilous describes something that readily takes up iodine stain or shows an affinity for iodine, often in lab contexts.","zh":"iodinophilous 指“嗜碘的/易被碘染色的”，常用于实验室或医学检验语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology/chemistry) Easily stained by iodine; having an affinity for iodine (often used for tissues or granules that turn blue-black with iodine, such as starch).","zh":"（生物/化学）易被碘染色的；对碘有亲和力的（常用于描述遇碘呈蓝黑色反应的组织或颗粒，如淀粉）。"},"examples":[{"en":"Starch granules are strongly iodinophilous and turn blue-black when iodine is added.","zh":"淀粉颗粒具有明显的嗜碘性，加碘后会变成蓝黑色。"},{"en":"Under the microscope, the pathologist noted iodinophilous material in the sample.","zh":"在显微镜下，病理学家观察到样本中有嗜碘性物质。"}]}],"synonyms":["iodophilic","iodine-loving","iodine-affine"],"phonetic":"/ˌaɪoʊdəˈnɑfələs/","extraExplanation":["这个词较少出现在日常英语里，更多用于实验室/医学检验语境（组织学、微生物学、食品检测等）。","词形拆解：iodine（碘）+ -philo-（喜欢/亲和）+ -ous（形容词后缀），字面意思就是“喜欢碘的/对碘有亲和力的”。"]}
{"word":"iodins","summary":{"en":"“Iodins” is most likely a misspelling of “iodine,” a needed chemical element and also a common disinfectant solution.","zh":"“iodins”很可能是“iodine”的拼写错误；iodine 指必需的化学元素“碘”，也可指常见的消毒用碘溶液。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: iodine) A chemical element (symbol I) that the human body needs in small amounts, especially for healthy thyroid function; commonly added to salt.","zh":"（可能想写：iodine）一种化学元素（符号 I），人体少量必需，尤其与甲状腺健康有关；常被添加到食盐中。"},"examples":[{"en":"Many people get iodine from iodized salt.","zh":"很多人通过加碘盐获取碘。"},{"en":"A lack of iodine can cause thyroid problems.","zh":"缺碘可能引起甲状腺问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A dark liquid or solution containing iodine, used to clean and disinfect skin and wounds (often called iodine or tincture of iodine).","zh":"含碘的深色消毒液，用于清洁、消毒皮肤和伤口（常称“碘酒/碘溶液”）。"},"examples":[{"en":"The nurse cleaned the cut with iodine.","zh":"护士用碘酒给伤口消毒。"},{"en":"Apply iodine to the area before the procedure.","zh":"操作前在该部位涂抹碘溶液。"}]}],"synonyms":["iodine","I","tincture of iodine","iodine solution"],"phonetic":"/ˈaɪəˌdaɪn/","extraExplanation":["你输入的“iodins”不是常见英文单词；最可能是“iodine”的拼写错误。","“iodine”在化学中元素符号是 I，常见搭配：iodized salt（加碘盐）、iodine deficiency（碘缺乏）、tincture of iodine（碘酒）。","发音注意：重音在第一个音节（I-uh-dine）。"]}
{"word":"iodisation","summary":{"en":"Iodisation means adding iodine, especially to salt for public health.","zh":"Iodisation 指加碘，尤指对食盐加碘以改善公共健康。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of adding iodine to something (especially table salt) to prevent iodine deficiency","zh":"加碘；碘化处理（尤指在食盐中加入碘，以预防缺碘）"},"examples":[{"en":"Many countries require the iodisation of table salt to help prevent iodine deficiency.","zh":"许多国家要求对食盐进行加碘处理，以帮助预防缺碘。"},{"en":"Public health campaigns often explain why salt iodisation is important for thyroid health.","zh":"公共卫生宣传常解释为什么食盐加碘对甲状腺健康很重要。"}]}],"synonyms":["iodization","iodine fortification","salt iodization"],"phonetic":"/ˌaɪəˌdaɪˈzeɪʃən/","extraExplanation":["“iodisation”是英式拼写；美式英语更常写作“iodization”。两者意思完全相同。","“iodisation of salt / salt iodisation”常出现在公共卫生与营养学语境中，指通过在食盐中加入适量碘来降低甲状腺肿、发育问题等与缺碘相关的风险。"]}
{"word":"iodism","summary":{"en":"Iodism means iodine poisoning or illness caused by too much iodine.","zh":"iodism 指“碘中毒”，即因过量碘引起的不适或中毒反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition caused by excessive exposure to iodine, leading to symptoms of iodine poisoning (such as a metallic taste, mouth/throat irritation, runny nose, or skin reactions).","zh":"碘中毒；因摄入或接触过量碘而引起的一种医学状况，可出现金属味、口咽刺激、流鼻涕或皮疹等症状。"},"examples":[{"en":"The doctor suspected iodism after the patient reported a metallic taste and irritation in the mouth.","zh":"病人说口中有金属味并伴随口腔刺激后，医生怀疑是碘中毒（iodism）。"},{"en":"Using iodine supplements incorrectly can, in rare cases, lead to iodism.","zh":"不当使用碘补充剂在少数情况下可能导致碘中毒（iodism）。"}]}],"synonyms":["iodine poisoning","iodine toxicity"],"phonetic":"/ˈaɪəˌdɪzəm/","extraExplanation":["“Iodism”多用于医学/药学语境，日常英语里更常见的说法是“iodine poisoning（碘中毒）”或“iodine toxicity（碘毒性）”。","它通常与含碘药物、造影剂或高剂量补充剂有关；如果你在读医学材料，常会看到与“thyroid（甲状腺）”相关的讨论，因为碘与甲状腺功能密切相关。"]}
{"word":"iodisms","summary":{"en":"Iodism is a medical term for illness or symptoms caused by too much iodine in the body.","zh":"Iodism 是医学术语，指因体内碘过量而引起的不适或中毒症状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A condition caused by excessive iodine in the body (iodine poisoning), often from overuse of iodine-containing medicines or supplements.","zh":"（医学）碘中毒：体内碘摄入过量导致的一种状况，常见于过度使用含碘药物或补充剂。"},"examples":[{"en":"After taking high-dose iodine drops for weeks, she developed symptoms of iodism.","zh":"连续几周服用大剂量碘滴剂后，她出现了碘中毒的症状。"},{"en":"The doctor asked about seaweed supplements because iodism can affect the thyroid.","zh":"医生询问他是否在吃海藻补充剂，因为碘中毒会影响甲状腺。"}]}],"synonyms":["iodine poisoning","iodine toxicity"],"phonetic":"/ˈaɪəˌdɪzəm/","extraExplanation":["你输入的“iodisms”通常是名词“iodism”的复数形式，意思是“碘中毒/碘过量反应”。它不是常见词，主要用于医学或健康语境。","它很容易和“idioms（习语）”拼写混淆：idiom /ˈɪdiəm/ 指“固定搭配、习惯用语”，而 iodism /ˈaɪəˌdɪzəm/ 指“碘过量导致的中毒反应”。如果你本来想问的是 idioms，请告诉我，我可以按“习语”来解释。"]}
{"word":"iodite","summary":{"en":"Iodite is a chemistry word meaning a compound containing the iodite ion (IO₂⁻).","zh":"Iodite 是化学词，指含有亚碘酸根（IO₂⁻）的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical ion or compound containing the iodite ion (IO₂⁻), usually formed as a salt of iodous acid (HIO₂).","zh":"一种含有“亚碘酸根”（IO₂⁻）的离子或化合物，通常是亚碘酸（HIO₂）的盐。"},"examples":[{"en":"Iodites are relatively uncommon compared with iodides and iodates.","zh":"与碘化物和碘酸盐相比，亚碘酸盐相对少见。"},{"en":"In inorganic chemistry, an iodite contains iodine in a lower oxidation state than an iodate.","zh":"在无机化学中，亚碘酸盐里的碘氧化态比碘酸盐更低。"}]}],"synonyms":["iodite ion","iodous acid salt"],"phonetic":"/ˈaɪəˌdaɪt/","extraExplanation":["“iodite”是化学术语，日常英语中很少见；更常见的是“iodide（碘化物，I⁻）”和“iodate（碘酸盐，IO₃⁻）”。\n\n注意别把“iodite”拼成或读成“iodide”。两者只有一个字母不同，但所指的离子不同，化学性质也不同。"]}
{"word":"iodization","summary":{"en":"Iodization is the process of adding iodine, especially to table salt, to help prevent iodine deficiency.","zh":"Iodization 指“加碘处理”，尤其是给食盐加碘，以帮助预防缺碘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of adding iodine to something (especially table salt) to prevent iodine deficiency in the diet","zh":"加碘；碘化处理（尤指在食盐中添加碘，以预防饮食中的缺碘问题）"},"examples":[{"en":"Many countries require iodization of table salt to reduce thyroid problems caused by iodine deficiency.","zh":"许多国家要求对食盐进行加碘处理，以减少因缺碘引起的甲状腺问题。"},{"en":"The company improved public health by ensuring proper iodization during salt production.","zh":"该公司通过在制盐过程中确保适当加碘，促进了公共健康。"}]}],"synonyms":["iodisation","iodine fortification","salt iodization"],"phonetic":"/ˌaɪədəˈzeɪʃən/","extraExplanation":["“iodization”在公共卫生语境中最常见，尤其指“食盐加碘”（salt iodization / iodized salt）。其目的通常是预防碘缺乏导致的甲状腺肿大（goiter）以及儿童发育相关问题。","拼写提示：英式英语也常见“iodisation”。日常更常说“iodized salt（加碘盐）”而不是“iodization”。"]}
{"word":"iodize","summary":{"en":"Iodize means to add iodine—most often to salt—or to treat something with iodine.","zh":"iodize 指加碘（最常见是给食盐加碘），或用碘对某物进行处理。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add iodine to something (especially salt) to prevent iodine deficiency","zh":"给某物（尤指食盐）加碘，以预防缺碘"},"examples":[{"en":"Many countries iodize salt to help prevent thyroid problems.","zh":"许多国家会给食盐加碘，以帮助预防甲状腺问题。"},{"en":"This label says the salt is iodized.","zh":"这个标签写着这款盐是加碘盐。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat with iodine as a disinfectant or in a chemical process","zh":"用碘处理（用于消毒或化学处理）"},"examples":[{"en":"The solution was iodized to reduce bacterial growth.","zh":"为了减少细菌滋生，这种溶液用碘处理过。"},{"en":"Some test papers are iodized for laboratory use.","zh":"一些试纸会用碘处理以供实验室使用。"}]}],"synonyms":["iodise","add iodine to","fortify (with iodine)"],"phonetic":"/ˈaɪəˌdaɪz/","extraExplanation":["“iodize”常见于公共卫生语境，尤其是“iodized salt（加碘盐）”。加碘的目的主要是补充膳食中的碘，帮助预防因缺碘导致的甲状腺肿大等问题。","拼写提示：美式英语常用“iodize”，英式英语也常见“iodise”。"]}
{"word":"iodized","summary":{"en":"Iodized means iodine has been added (especially to salt) for health reasons.","zh":"iodized 表示“加了碘的”（尤指加碘盐），通常出于健康预防目的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of salt) having iodine added, usually to help prevent iodine deficiency and related health problems.","zh":"（指盐）加了碘的；通常用于帮助预防缺碘及相关健康问题。"},"examples":[{"en":"We buy iodized salt for everyday cooking.","zh":"我们买加碘盐用于日常做饭。"},{"en":"Some doctors recommend iodized salt to support healthy thyroid function.","zh":"一些医生建议使用加碘盐来支持甲状腺健康。"}]}],"synonyms":["iodised","iodine-fortified"],"phonetic":"/ˈaɪəˌdaɪzd/","extraExplanation":["“iodized salt（加碘盐）”在很多国家是常见的公共卫生措施之一，用少量的碘强化食盐，帮助减少因缺碘导致的甲状腺肿大等问题。","写法上也常见“iodised”（英式拼写），意思相同。","日常用法里，“iodized”最常修饰“salt（盐）”，也可用于“iodized oil（加碘油）”“iodized water（加碘水）”等较少见的搭配。"]}
{"word":"iodizer","summary":{"en":"“Iodizer” usually means an iodine-containing additive (often used in salt), or a person/device that adds iodine.","zh":"“iodizer”通常指（常用于食盐的）加碘剂，或指给产品加碘的人/设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to something (especially table salt) to provide iodine; an iodine-containing additive","zh":"加碘剂；（尤指食盐中的）含碘添加剂，用来补充碘"},"examples":[{"en":"This salt contains an iodizer to help prevent iodine deficiency.","zh":"这种盐含有加碘剂，有助于预防缺碘。"},{"en":"The label lists an iodizer among the ingredients.","zh":"配料表里把加碘剂列为其中一项。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or device that iodizes something (adds iodine to it)","zh":"加碘者；加碘设备（给某物添加碘的人或装置）"},"examples":[{"en":"The plant uses an automatic iodizer to treat the salt evenly.","zh":"工厂使用自动加碘设备，让食盐加碘更均匀。"},{"en":"An iodizer monitors the iodine level during production.","zh":"加碘操作人员在生产过程中监测碘含量。"}]}],"synonyms":["iodizing agent","iodine additive","iodization equipment"],"phonetic":"/ˈaɪəˌdaɪzər/","extraExplanation":["“iodizer”不是最常见的日常词；在食品与公共卫生语境里，更常见的说法是“iodized salt（加碘盐）”，或动词“iodize（加碘）”。","在一些国家/地区，加碘盐是一项重要的公共卫生措施，用来降低碘缺乏相关问题（如甲状腺肿大等）的风险；因此你常会在包装上看到“iodized”。"]}
{"word":"iodizers","summary":{"en":"“Iodizers” are things or people that add iodine to a product, especially salt.","zh":"“iodizers”指给产品添加碘的装置/人/化学剂，尤指食盐加碘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People, machines, or chemicals that add iodine to something (especially adding iodine to table salt).","zh":"给某物添加碘的人、机器或化学剂（尤指给食盐加碘）。"},"examples":[{"en":"Many salt producers use iodizers to mix a small amount of iodine into salt.","zh":"许多食盐生产商使用加碘设备把少量碘混入食盐中。"},{"en":"The factory checked its iodizers to make sure the iodine level was correct.","zh":"工厂检查了加碘装置，以确保碘含量正确。"}]}],"synonyms":["iodizing machines","iodization equipment","iodine adders","iodizing agents"],"phonetic":"/ˈaɪəˌdaɪzər/","extraExplanation":["“iodizers”是“iodizer”的复数。最常见语境是“iodized salt（加碘盐）”的生产：在食盐中加入微量碘，有助于预防因缺碘导致的甲状腺问题。","在日常英语里更常见的说法通常是“iodization equipment（加碘设备）”“iodizing machine（加碘机）”或直接说“to iodize salt（给盐加碘）”。"]}
{"word":"iodizes","summary":{"en":"“Iodizes” means adds iodine (often to salt) or treats something with iodine for disinfecting.","zh":"“iodizes”表示添加碘（常指食盐加碘），或用碘进行处理以消毒。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add iodine to something (especially table salt) to prevent iodine deficiency","zh":"在某物中添加碘（尤其是食盐加碘），以预防缺碘"},"examples":[{"en":"The company iodizes its salt to help prevent iodine deficiency.","zh":"这家公司给食盐加碘，以帮助预防缺碘。"},{"en":"Many countries require that some salt sold in stores iodizes the diet indirectly.","zh":"许多国家要求市售部分食盐加碘，从而间接为饮食补碘。"}]},{"partOfSpeech":"v.","definition":{"en":"to treat with iodine as a disinfectant or antiseptic","zh":"用碘处理（用于消毒或杀菌）"},"examples":[{"en":"In an emergency, he iodizes the water before drinking it.","zh":"紧急情况下，他会用碘处理水后再饮用。"}]}],"synonyms":["iodinate","add iodine","fortify (with iodine)"],"phonetic":"/ˈaɪəˌdaɪz/","extraExplanation":["“iodizes”是动词“iodize”的第三人称单数（he/she/it iodizes）。英式拼写常见为“iodise”。","“iodized salt（加碘盐）”与公共健康相关：在一些地区，通过食盐加碘可降低甲状腺肿（goiter）等缺碘问题的发生率。"]}
{"word":"iodizing","summary":{"en":"Iodizing means adding iodine to something (especially salt) or treating something with iodine.","zh":"iodizing 指给某物加碘（尤指食盐加碘），或用碘对某物进行处理。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"adding iodine to something (especially table salt) to prevent iodine deficiency","zh":"在某物中加入碘（尤其是在食盐中加碘），以预防缺碘"},"examples":[{"en":"Many countries require iodizing salt to help prevent goiter.","zh":"许多国家规定食盐必须加碘，以帮助预防甲状腺肿。"},{"en":"The factory is iodizing the salt before it is packaged.","zh":"工厂在包装前正在对食盐进行加碘处理。"}]},{"partOfSpeech":"v.","definition":{"en":"treating something with iodine (for chemical/medical purposes)","zh":"用碘处理某物（用于化学或医疗目的）"},"examples":[{"en":"The lab is iodizing the sample to trace the reaction more clearly.","zh":"实验室正在用碘处理样品，以更清楚地追踪反应。"},{"en":"Some solutions are iodized to achieve a specific chemical effect.","zh":"有些溶液会进行加碘处理，以达到特定的化学效果。"}]}],"synonyms":["adding iodine","iodination","iodizing salt","iodizing (treating with iodine)"],"phonetic":"/ˈaɪəˌdaɪzɪŋ/","extraExplanation":["“iodizing”是动词“iodize”的现在分词/动名词形式；英式拼写常见为“iodise / iodising”。","“食盐加碘”在公共卫生中很常见，因为碘是合成甲状腺激素所必需的微量元素；缺碘可能影响代谢与儿童发育。"]}
{"word":"iodo","summary":{"en":"“Iodo-” is a chemistry prefix meaning “containing iodine” or “iodine-substituted.” As “iodo” alone, it may appear as a Spanish/Italian word for “iodine,” but English usually uses “iodine.”","zh":"“iodo-”是化学前缀，表示“含碘/碘代”。单独写作“iodo”时多为西语/意语中的“碘”，英文一般说“iodine”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, as a prefix) Containing iodine, or having an iodine atom attached in a molecule.","zh":"（化学，作前缀）含碘的；分子中连有碘原子的。"},"examples":[{"en":"Iodoform is a yellow compound that contains iodine.","zh":"碘仿是一种含碘的黄色化合物。"},{"en":"An iodo-substituted ring has iodine attached to the ring structure.","zh":"“碘代”取代的环结构表示该环上连有碘原子。"}]},{"partOfSpeech":"n.","definition":{"en":"A nonstandard/loanword form meaning “iodine” (common in Spanish/Italian), not typically used as an English word in everyday writing.","zh":"外来语/非标准用法：指“碘”（在西班牙语/意大利语中常见），但日常英文里通常不用这个词。"},"examples":[{"en":"In Spanish, “iodo” means “iodine.” In English, you would usually say “iodine.”","zh":"在西语里“iodo”就是“碘”；在英文里通常说“iodine”。"}]}],"synonyms":["iodine","iodinated","iodine-containing"],"phonetic":"ˈaɪoʊdoʊ","extraExplanation":["“iodo-”在英文科技写作中非常常见，多见于有机化学命名，表示“碘代/含碘”。例如：iodobenzene（碘苯）、iodoform（碘仿）。","如果你是在论文或化学题目里看到“iodo”，通常它是前缀的一部分（iodo-），而不是一个独立的英文单词。"]}
{"word":"iodobehenate","summary":{"en":"“Iodobehenate” is a specialized chemistry term for an iodinated behenate (a behenic-acid salt or ester).","zh":"iodobehenate 是偏专业的化学用语，指一种“碘代的山嵛酸盐/山嵛酸酯（behenate）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound: an iodinated form of behenate (a salt or ester of behenic acid, a long-chain fatty acid).","zh":"一种化学化合物：碘代的“山嵛酸盐/山嵛酸酯”（山嵛酸 behenic acid 的盐或酯，属长链脂肪酸衍生物）。"},"examples":[{"en":"In the lab notebook, the sample was labeled as iodobehenate and stored away from light.","zh":"在实验记录本里，样品被标记为 iodobehenate，并避光保存。"},{"en":"Iodobehenate can be described as an iodinated derivative of behenic-acid-based compounds.","zh":"Iodobehenate 可以被描述为一种以山嵛酸相关化合物为基础的碘代衍生物。"}]}],"synonyms":["iodinated behenate","behenate iodide"],"phonetic":"/ˌaɪ.oʊ.doʊˈbɛhəˌneɪt/","extraExplanation":["这是一个非常偏专业的化学名词：前缀 iodo- 表示“含碘/碘代”，而 behenate 指“山嵛酸（behenic acid）的盐或酯”。在很多语境里，它更多出现在化学品目录、实验记录、材料/医药相关文献中。","因为属于具体化合物名称，不同资料可能会用来指某一类“碘代山嵛酸盐/酯”或某个特定结构的物质；如果你有出现它的句子或产品/文献来源，我可以帮你进一步确认更精确的指代。"]}
{"word":"iodobenzene","summary":{"en":"Iodobenzene is a benzene ring with one iodine atom attached, used as a reagent in organic synthesis.","zh":"iodobenzene（碘代苯）是苯环上连接一个碘原子的化合物，常用于有机合成作试剂或起始原料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical compound made of a benzene ring with one iodine atom attached (formula: C6H5I). It is used in organic chemistry as a starting material to make other compounds.","zh":"碘代苯；一种苯环上连有一个碘原子的化合物（化学式：C6H5I），常用作有机合成中的原料或中间体。"},"examples":[{"en":"Iodobenzene is often used to prepare substituted aromatic compounds in the lab.","zh":"在实验室里，碘代苯常用于制备取代的芳香族化合物。"},{"en":"The reaction started with iodobenzene and a palladium catalyst.","zh":"该反应以碘代苯为起始物，并使用了钯催化剂。"}]}],"synonyms":["phenyl iodide","iodobenzol"],"phonetic":"/ˌaɪoʊdoʊˈbɛnzin/","extraExplanation":["“Iodo-”表示“含碘/与碘有关”，而“benzene”是“苯”。因此 iodobenzene 直译就是“碘 + 苯”。","在有机化学中，碘代苯属于“芳基卤化物”（aryl halide）。碘（I）通常比氯/溴更容易在某些反应中被“替换”或参与偶联反应，因此它在合成中很常见。","常见近义/别名：phenyl iodide（苯基碘）。"]}
{"word":"iodobromite","summary":{"en":"Iodobromite is a rare silver-halide mineral, mainly silver bromide with some silver iodide.","zh":"Iodobromite 是一种罕见的银卤化物矿物，主要为溴化银并含少量碘化银。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (or mineral mixture) made mainly of silver bromide with some silver iodide; essentially a natural mixed silver halide.","zh":"一种罕见矿物（或矿物混合物），主要由溴化银并含少量碘化银组成；本质上是天然的“混合银卤化物”。"},"examples":[{"en":"Iodobromite is sometimes described as a mixture between bromargyrite and iodargyrite.","zh":"Iodobromite 有时被描述为溴银矿（bromargyrite）与碘银矿（iodargyrite）之间的混合物。"},{"en":"Because it contains silver, iodobromite can occur in some silver ore deposits.","zh":"由于含银，iodobromite 可能出现在某些银矿矿床中。"}]}],"synonyms":["silver iodobromide","mixed silver halide"],"phonetic":"ˌaɪoʊˈbroʊmaɪt","extraExplanation":["词源上可拆为 iodo-（碘）+ brom-（溴）+ -ite（矿物/岩石名常见后缀），意思直观指向“含碘与溴的矿物”。","在材料与摄影语境里，类似的“银溴碘化物（silver iodobromide）”常指含少量碘化银的溴化银，用于提高感光特性；不过矿物学里的 iodobromite 更强调天然产出。"]}
{"word":"iodocasein","summary":{"en":"Iodocasein is an iodine–casein compound used mainly as a source of iodine, especially in animal feed.","zh":"Iodocasein（碘酪蛋白）是碘与酪蛋白结合的化合物，主要用于提供碘，常见于动物饲料等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound made by combining iodine with casein (a milk protein), used mainly as a source of iodine (especially in animal feed and some supplements).","zh":"一种将碘与酪蛋白（牛奶蛋白）结合而成的化合物，主要用作碘的来源（常见于动物饲料及部分补充剂）。"},"examples":[{"en":"The veterinarian recommended an iodine source such as iodocasein for the herd.","zh":"兽医建议给这群牲畜补充一种碘来源，例如碘酪蛋白。"},{"en":"Some feeds list iodocasein on the label as an added iodine ingredient.","zh":"有些饲料在标签上会标注添加了“碘酪蛋白”作为补充碘的成分。"}]}],"synonyms":["iodinated casein"],"phonetic":"/ˌaɪoʊdoʊˈkeɪsiɪn/","extraExplanation":["词源与构成：iodo- 表示“含碘/与碘有关”，casein 指“酪蛋白”，合起来就是“含碘的酪蛋白”。","用途提示：它多见于畜牧业的饲料配方，用来提供碘；碘是合成甲状腺激素所需的微量元素。","使用语境：这是偏专业的化学/营养学名词，日常英语中不常见；阅读配料表、兽医或饲料营养资料时更可能遇到。"]}
{"word":"iodochlorid","summary":{"en":"A rare chemistry term for a compound containing iodine and chlorine; often seen as iodochloride.","zh":"一个少见的化学术语，指含碘和氯的化合物；更常见拼写为 iodochloride。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical compound that contains both iodine and chlorine (or an iodinated chloride); used mainly as a technical term in chemistry.","zh":"一种同时含有碘和氯的化合物（或“碘化的氯化物”）；主要用于化学领域的技术用语。"},"examples":[{"en":"The paper reports an iodochlorid intermediate formed during the reaction.","zh":"论文报道了反应过程中形成的一种 iodochlorid（含碘氯）中间体。"},{"en":"Iodochlorid compounds are discussed mostly in specialized chemistry texts.","zh":"iodochlorid 这类化合物多见于专业化学文献中。"}]}],"synonyms":["iodochloride","iodine chloride","ICl (in some contexts)"],"phonetic":"/ˌaɪoʊdoʊˈklɔrɪd/","extraExplanation":["这个词非常少见，更常见的写法是 **iodochloride**。在化学命名中，它通常指“含碘与氯的化合物”或“碘参与形成的氯化物/加成物”。具体结构要看上下文（例如反应机理、配位化合物或卤素加成产物）。","如果你是在阅读论文或实验记录，建议同时检索：**iodochloride / iodine chloride / ICl（碘一氯化物）**，因为作者可能使用不同拼写或不同层级的命名方式。"]}
{"word":"iodochloride","summary":{"en":"Iodochloride is a chemical term for an iodine–chlorine compound, commonly iodine monochloride (ICl).","zh":"iodochloride 是化学术语，指碘与氯形成的化合物，常见为一氯化碘（ICl）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound made of iodine and chlorine, especially iodine monochloride (ICl), an interhalogen used as a reagent in chemistry","zh":"一种由碘和氯组成的化合物，尤指一氯化碘（ICl），属于卤素间化合物，常用作化学试剂"},"examples":[{"en":"Iodochloride (ICl) is often used to add iodine and chlorine across a double bond in organic chemistry.","zh":"在有机化学中，碘氯化物（ICl）常用于在双键上加成碘和氯。"},{"en":"The lab stored the iodochloride in a sealed container because it reacts easily.","zh":"实验室把碘氯化物密封保存，因为它很容易发生反应。"}]}],"synonyms":["iodine monochloride","ICl","iodine chloride"],"phonetic":"/ˌaɪoʊdoʊˈklɔːraɪd/","extraExplanation":["“iodochloride”是化学领域用语，日常英语里很少见。很多情况下它指的就是 ICl（iodine monochloride，一氯化碘），也可能被更广义地用来指“碘-氯”类化合物。具体含义最好结合上下文（比如是否写了化学式 ICl 或实验用途）。","ICl 属于“卤素间化合物（interhalogen）”，通常具有较强反应性与刺激性；在真实实验中需要注意安全与规范储存。"]}
{"word":"iodochromate","summary":{"en":"Iodochromate is an iodine-containing chromate compound/ion, used mainly as a technical chemistry term.","zh":"Iodochromate 指含碘的铬酸盐化合物/离子，主要是化学专业术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (or ion) that contains both iodine (iodo-) and a chromate group; iodochromates are iodine-containing chromate salts or complexes used mainly in chemistry contexts.","zh":"一种同时含有碘（iodo-）与铬酸根（chromate）结构的化合物（或离子）；碘铬酸盐多见于化学语境中，属于含碘的铬酸盐或配合物。"},"examples":[{"en":"The paper mentions an iodochromate complex that changes color during the reaction.","zh":"论文提到一种碘铬酸配合物，会在反应过程中发生颜色变化。"},{"en":"Iodochromate salts are uncommon in everyday language and mostly appear in lab or textbook discussions.","zh":"“iodochromate（碘铬酸盐）”在日常语言中不常见，主要出现在实验室或教材讨论中。"}]}],"synonyms":["iodochromate salt","iodochromate ion","iodo-chromate"],"phonetic":"/ˌaɪoʊdoʊˈkroʊmeɪt/","extraExplanation":["这个词由 iodo-（表示“含碘的/碘代的”）+ chromate（“铬酸盐/铬酸根”）构成，属于化学命名用语。","在有机化学里，你可能会看到类似结构的试剂名称（例如以“某某 iodochromate”命名的氧化剂）；但具体化学式与性质取决于它与哪种阳离子或配体结合。"]}
{"word":"iodocresol","summary":{"en":"Iodocresol is an iodine-containing cresol antiseptic used to disinfect and kill germs.","zh":"碘甲酚是一种含碘的甲酚类消毒剂，用于杀菌与消毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical antiseptic (a cresol compound containing iodine) used to kill germs, especially in some medical and dental products","zh":"一种含碘的甲酚类化学消毒剂（抗菌防腐剂），用于杀灭细菌，常见于部分医疗与牙科制剂中"},"examples":[{"en":"The dentist applied an antiseptic containing iodocresol to help reduce bacterial growth.","zh":"牙医使用了含碘甲酚的消毒剂来帮助减少细菌滋生。"},{"en":"Some older formulations listed iodocresol among their disinfecting ingredients.","zh":"一些较早的配方会把碘甲酚列为消毒成分之一。"}]}],"synonyms":["antiseptic","disinfectant","iodinated cresol"],"phonetic":"/ˌaɪ.oʊ.doʊˈkriː.sɔːl/","extraExplanation":["“iodocresol”由“iodo-（碘）”和“cresol（甲酚）”构成，属于专业化学/药学词汇，日常英语中不常见。","在真实使用中，你更常在成分表或产品说明里看到它；若需要写作或口语表达，可用更通用的词替换，如“an antiseptic/disinfectant ingredient（消毒成分）”。","因为是化学品名，不同地区对其具体配方与监管可能不同；阅读药品或牙科材料信息时以当地说明为准。"]}
{"word":"iododerma","summary":{"en":"Iododerma is a rash caused by a reaction to iodine or iodide medicines.","zh":"iododerma（碘疹）指对碘或碘化物产生反应而引起的皮疹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A skin eruption (rash) caused by sensitivity to iodine or iodide medicines, often appearing as acne-like bumps, pustules, or ulcers.","zh":"由对碘或碘化物（含碘药物）过敏/不耐受引起的皮肤疹，常表现为类似痤疮的丘疹、脓疱或溃疡。"},"examples":[{"en":"After starting an iodide supplement, she developed iododerma on her face and chest.","zh":"开始服用碘化物补充剂后，她的脸和胸部出现了碘疹。"},{"en":"The doctor suspected iododerma because the rash began soon after iodine-based treatment.","zh":"医生怀疑是碘疹，因为皮疹在使用含碘治疗后不久就出现了。"}]}],"synonyms":["iodide dermatitis","iodine rash","iodine-induced eruption"],"phonetic":"/ˌaɪoʊdəˈdɝmə/","extraExplanation":["这是较少见、偏医学场景的词，常见于皮肤科或药物不良反应（drug reaction）的讨论。","词源拆解：iodo-（碘）+ -derma（皮肤）。临床上通常会追问近期是否使用含碘药物/造影剂等，并考虑停用相关药物、对症治疗。"]}
{"word":"iodoethane","summary":{"en":"Iodoethane is an organic chemical (ethyl iodide) used as a lab reagent to add an ethyl group.","zh":"碘乙烷（乙基碘）是一种有机化学品，常作实验室试剂用于引入乙基。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colorless, flammable organic liquid (C2H5I) used mainly as a chemical reagent in labs to add an ethyl group in synthesis.","zh":"碘乙烷（C2H5I），一种无色、易燃的有机液体，主要用作实验室试剂，用于在有机合成中引入乙基（ethyl group）。"},"examples":[{"en":"In the lab, we used iodoethane to ethylate the amine.","zh":"在实验室里，我们用碘乙烷让胺发生乙基化反应。"},{"en":"Iodoethane should be handled in a fume hood because its vapors can be harmful.","zh":"碘乙烷应在通风橱中操作，因为其蒸气可能有害。"}]}],"synonyms":["ethyl iodide","iodoethane (systematic name: iodoethane)"],"phonetic":"/ˌaɪ.oʊ.doʊˈeθ.eɪn/","extraExplanation":["“iodo-”表示“含碘的/碘代的”，“-ethane”表示“乙烷”。因此 iodoethane 字面意思是“碘代乙烷”，常见同义写法是 **ethyl iodide**（乙基碘）。","它属于“卤代烃”（alkyl halide/haloalkane）一类，化学上常用于亲核取代反应（如 SN2）把乙基连接到其他分子上。由于具有刺激性与挥发性，安全操作通常要求戴手套并在通风橱中使用。"]}
{"word":"iodoform","summary":{"en":"Iodoform is a yellow chemical with a strong antiseptic smell, used as a disinfectant (especially in medical/dental settings).","zh":"碘仿是一种黄色化学物质，带强烈消毒气味，用作消毒剂（尤见于医药/牙科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow, crystalline chemical (CHI3) with a strong antiseptic smell, used mainly as a disinfectant in medicine and dentistry","zh":"碘仿（CHI3）；一种黄色结晶状化学物质，有明显的消毒气味，主要用于医药和牙科中的消毒"},"examples":[{"en":"The dentist packed the socket with iodoform gauze to help prevent infection.","zh":"牙医用碘仿纱布填塞伤口，以帮助预防感染。"},{"en":"Iodoform has a distinctive smell that many people associate with hospitals.","zh":"碘仿有一种很独特的气味，很多人会把它和医院联系在一起。"}]}],"synonyms":["triiodomethane","iodoform gauze (related term)"],"phonetic":"ˈaɪəˌdoʊfɔːrm","extraExplanation":["“iodoform”由“iodo-（碘）+ -form（与早期化学命名有关）”构成。它曾在外科消毒中更常见，但现代临床中因刺激性气味、替代消毒剂增多等原因使用相对减少，不过在某些敷料（如碘仿纱布）和牙科处理中仍会见到。"]}
{"word":"iodoforms","summary":{"en":"“Iodoforms” is the plural of iodoform, a yellow antiseptic chemical used in medicine and chemistry.","zh":"“Iodoforms”是“iodoform（碘仿）”的复数，指一种黄色的消毒防腐化学物质，也常见于化学实验相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"iodoform; a yellow, crystalline chemical (CHI₃) with a strong smell, used as an antiseptic and in laboratory chemistry.","zh":"碘仿；一种黄色结晶状化学物质（CHI₃），气味较强，曾用于消毒防腐，也常见于实验室化学中。"},"examples":[{"en":"The nurse applied a small amount of iodoform to help prevent infection.","zh":"护士涂了一点碘仿来帮助预防感染。"},{"en":"In chemistry class, we learned that iodoform can form a yellow precipitate in a certain test.","zh":"在化学课上，我们学到在某种测试中碘仿会形成黄色沉淀。"}]}],"synonyms":["triiodomethane"],"phonetic":"/ˌaɪ.oʊˈdɔr.fɔrm/","extraExplanation":["你写的 **iodoforms** 是复数形式；单数是 **iodoform**（碘仿）。","碘仿在现代临床上已不如从前常用，因为气味强烈且有更合适的替代消毒剂；但在有机化学里常被提到，尤其与“碘仿反应/碘仿试验（iodoform test）”相关，用来检测某些结构的化合物是否会生成黄色碘仿沉淀。"]}
{"word":"iodogallicin","summary":{"en":"Iodogallicin is a very uncommon chemical term for an iodine-containing compound related to gallic acid, mostly seen in older or specialized texts.","zh":"Iodogallicin 是非常少见的化学术语，指与没食子酸相关的含碘化合物，多出现在较旧或专业文献中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare chemical name referring to an iodine-containing compound related to gallic acid (used mainly in older chemistry/biochemistry writing).","zh":"一种较少见的化学名称，指与没食子酸（gallic acid）相关、含碘的化合物（多见于较早的化学/生化文献）。"},"examples":[{"en":"The paper mentions iodogallicin as an iodine-substituted derivative of gallic acid.","zh":"这篇论文提到 iodogallicin 是没食子酸的含碘取代衍生物。"},{"en":"I couldn’t find iodogallicin in modern catalogs; the name seems historical or uncommon.","zh":"我在现代目录里找不到 iodogallicin；这个名称似乎较旧或不常用。"}]}],"synonyms":["iodo-gallic (compound)","iodogallic acid (possible related term)"],"phonetic":"/ˌaɪoʊdoʊˈɡælɪsɪn/","extraExplanation":["这个词在现代英语里非常罕见，很多时候可能是：①旧称/旧拼写；②某篇文章里的特定命名；③把更常见的名称写错了（例如 *iodogallic acid* 或其他“iodo- + gallic-”的化合物）。","如果你能提供出处（论文、产品标签、句子或图片），我可以帮你确认它指的是哪一种具体结构/通用名，以及更常用的现代叫法。"]}
{"word":"iodohippurate","summary":{"en":"Iodohippurate is a radioactive tracer used in kidney imaging to test renal function.","zh":"Iodohippurate（碘马尿酸示踪剂）是一种用于肾脏显像、评估肾功能的放射性示踪剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a radioactive form of iodohippuric acid used as a tracer in medical imaging to evaluate kidney function (especially renal blood flow and tubular secretion).","zh":"一种含放射性的碘马尿酸（或其衍生物），作为示踪剂用于医学成像，以评估肾功能（尤其是肾血流与肾小管分泌功能）。"},"examples":[{"en":"The doctor ordered a renal scan using iodohippurate to assess how well each kidney was working.","zh":"医生安排用碘马尿酸示踪剂进行肾扫描，以评估每个肾脏的工作情况。"},{"en":"Iodohippurate is cleared quickly by the kidneys, which makes it useful for functional imaging.","zh":"碘马尿酸会被肾脏较快清除，因此适合用于功能性成像。"}]}],"synonyms":["iodohippuric acid (in context)","radioiodinated hippurate (general term)"],"phonetic":"/ˌaɪoʊdoʊˈhɪpjəˌreɪt/","extraExplanation":["该词多见于核医学/放射性药物语境，常与“renal scan（肾显像）”“tracer（示踪剂）”一起出现。","临床上常指放射性标记的碘马尿酸类制剂（例如用于肾动态显像的某些放射性药物），用于观察肾脏摄取与排泄的过程，从而推断肾功能。"]}
{"word":"iodohydrate","summary":{"en":"A rare chemistry term meaning an iodine-containing compound in its hydrated (water-containing crystal) form.","zh":"一个罕见的化学词，指“含碘化合物的水合物（含结晶水的晶体形式）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, rare) A hydrate form of an iodine-containing compound; a crystalline substance that includes water molecules in its structure and contains iodine (often used in older or specialized chemical writing).","zh":"（化学，罕用）含碘化合物的水合物形式；一种晶体物质，其结构中包含结晶水并含有碘（常见于较旧或较专门的化学文献）。"},"examples":[{"en":"The paper reports an iodohydrate that loses water when gently heated.","zh":"论文报道了一种碘水合物，轻微加热时会失去结晶水。"},{"en":"This iodohydrate crystallizes easily but decomposes under strong light.","zh":"这种碘水合物易结晶，但在强光下会分解。"}]}],"synonyms":["iodine hydrate (context-dependent)","hydrate (general)"],"phonetic":"ˌaɪoʊdoʊˈhaɪdreɪt","extraExplanation":["这个词在现代英语化学教材里非常少见，更多像是由 iodo-（“含碘的”）+ hydrate（“水合物”）拼成的描述性用语，而不是一个高频的标准术语。","如果你是在某篇论文/说明书里看到它，建议同时核对化学式或上下文：作者可能想表达“某种含碘化合物的水合物”，也可能是拼写或译名差异。现代文献更常直接写成“X hydrate”（某某的水合物）或用具体名称（如 iodide hydrate、iodate hydrate 等）。"]}
{"word":"iodohydric","summary":{"en":"“Iodohydric” is a rare chemistry adjective meaning related to hydrogen iodide (HI) / hydriodic acid.","zh":"“iodohydric” 是一个很少见的化学形容词，表示与碘化氢（HI）/ 氢碘酸有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, rare) Relating to hydrogen iodide (HI) or hydriodic acid; containing iodine and hydrogen.","zh":"（化学，少见）与碘化氢（HI）或氢碘酸有关的；含有碘与氢的。"},"examples":[{"en":"In older chemistry texts, “iodohydric acid” refers to hydriodic acid (HI).","zh":"在较早的化学文献中，“iodohydric acid”指的就是氢碘酸（HI）。"},{"en":"The solution was described as iodohydric, meaning it contained hydrogen iodide.","zh":"该溶液被描述为 iodohydric，意思是含有碘化氢。"}]}],"synonyms":["hydriodic (acid)","hydrogen iodide (related)"],"phonetic":"/ˌaɪoʊdoʊhaɪˈdrɪk/","extraExplanation":["这个词非常不常见，多见于较旧的化学写法。现代更常用的说法是：hydriodic acid（氢碘酸）或 hydrogen iodide（碘化氢）。","词形可拆解为 iodo-（碘）+ hydric（与氢有关的）。在化学命名里，类似结构也会出现在一些历史术语中。"]}
{"word":"iodohydrin","summary":{"en":"An iodohydrin is an organic compound (often a β-iodo alcohol) containing both iodine and an –OH group, commonly made from alkenes.","zh":"iodohydrin 指一种同时含碘和羟基的有机化合物（常为 β-碘代醇），常由烯烃反应生成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organic compound that contains both an iodine atom (I) and a hydroxyl group (–OH), usually on neighboring carbon atoms; often formed by adding iodine and water (or an iodinating reagent) across a carbon–carbon double bond.","zh":"一种同时含有碘原子（I）和羟基（–OH）的有机化合物，通常这两者位于相邻碳原子上；常由“碘+水”（或相关碘化试剂）对碳碳双键加成生成。"},"examples":[{"en":"In the lab, the alkene was converted into an iodohydrin under mild conditions.","zh":"在实验室里，该烯烃在温和条件下被转化为碘代醇（iodohydrin）。"},{"en":"The iodohydrin can be used as an intermediate to make an epoxide.","zh":"这种碘代醇可以作为中间体进一步制备环氧化物。"}]}],"synonyms":["iodoalcohol","β-iodo alcohol","beta-iodo alcohol"],"phonetic":"/ˌaɪoʊdoʊˈhaɪdrɪn/","extraExplanation":["“iodohydrin”里的“hydrin”可理解为“含有羟基的加成产物”这一类旧式命名习惯；在现代有机化学语境中，它通常指“β-碘代醇”（相邻位带 I 和 –OH）。","它常见于烯烃的卤代-羟基化（halohydrin formation）反应：与“chlorohydrin / bromohydrin”类似，只是卤素换成碘。由于碘离去能力较好，碘代醇常被用来做后续环化（例如生成环氧化物）或取代反应的前体。"]}
{"word":"iodol","summary":{"en":"Iodol is an old trade name for an iodine-based antiseptic powder.","zh":"Iodol 是一种旧式的商品名，指含碘的消毒粉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trade name for an iodine-containing antiseptic powder (historically used on wounds to prevent infection)","zh":"（商品名）一种含碘的消毒粉（过去常用于伤口，帮助预防感染）"},"examples":[{"en":"In older medical texts, iodol is mentioned as a wound antiseptic.","zh":"在一些较早的医学文献中，会提到 iodol 作为伤口消毒剂。"},{"en":"The doctor used an iodine-based antiseptic such as iodol to reduce the risk of infection.","zh":"医生使用了含碘的消毒剂（例如 iodol）来降低感染风险。"}]}],"synonyms":["iodine antiseptic","antiseptic powder","iodoform (related)"],"phonetic":"/ˈaɪoʊˌdɔl/","extraExplanation":["“Iodol”更常见于旧式医学/药学语境中，多作为商品名出现；在现代英语日常交流里非常少用。","它与碘（iodine）相关，拼写看起来像“iod-”开头的化学/药物词（如 iodoform）。如果你是想查“idol（偶像）”或“iodine（碘）”，告诉我语境我可以帮你确认。"]}
{"word":"iodols","summary":{"en":"An idol is someone (or something) that people admire or even worship, sometimes too much.","zh":"idol 指被人崇拜或高度仰慕的人或物；可指明星偶像，也可指宗教中的神像/假神，有时含“过度崇拜”的批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous person (such as a singer, actor, or athlete) who is greatly admired and followed by many people","zh":"（歌手、演员、运动员等）偶像；受大众崇拜的名人"},"examples":[{"en":"She became a teen idol after her first album.","zh":"她的第一张专辑发行后就成了青少年偶像。"},{"en":"He’s an idol to millions of fans worldwide.","zh":"他是全球数百万粉丝的偶像。"}]},{"partOfSpeech":"n.","definition":{"en":"an image or object that people worship as a god; a false god","zh":"（被当作神来拜的）偶像、神像；假神"},"examples":[{"en":"The story warns against worshiping idols.","zh":"这个故事警告人们不要崇拜偶像（假神）。"},{"en":"The temple contained idols made of stone and gold.","zh":"寺庙里有用石头和黄金制成的神像。"}]},{"partOfSpeech":"n.","definition":{"en":"something that is admired too much, sometimes in an unhealthy way","zh":"被过度崇拜的事物（有时带负面含义）"},"examples":[{"en":"For him, money became an idol.","zh":"对他来说，金钱成了被过度崇拜的东西。"},{"en":"The book criticizes the idol of success at any cost.","zh":"这本书批评“不惜一切代价追求成功”的崇拜。"}]},{"partOfSpeech":"vt.","definition":{"en":"to worship or admire someone or something too much (less common)","zh":"（较少用）把……当偶像崇拜；过度崇拜"},"examples":[{"en":"Some people idol their favorite celebrities.","zh":"有些人把自己喜欢的明星当偶像崇拜。"}]}],"synonyms":["hero","celebrity","star","icon","false god"],"phonetic":"/ˈaɪdəl/","extraExplanation":["你输入的 **iodols** 很可能是拼写错误，正确拼法通常是 **idols**（idol 的复数）。","**idol** 在流行文化中多指“明星偶像”；在宗教或文学语境里常指“被当作神来拜的偶像/假神”，因此有时会带批评意味。","词源上与希腊语/拉丁语中表示“形象、幻影”的词有关，所以在较严肃的文本里，**idol** 也可暗示“把不该当神的东西神化”。"]}
{"word":"iodomercurate","summary":{"en":"Iodomercurate is a chemical term for an iodide–mercury complex, often the tetraiodomercurate(II) ion used in analytical reagents.","zh":"iodomercurate 是化学术语，指含碘与汞的配合物/复合离子，常见为用于分析试剂的四碘合汞(II)离子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical complex (an ion or salt) that contains both iodide (iodo-) and mercury (mercurate), often referring to mercury(II) iodide complexes such as tetraiodomercurate(II)","zh":"一种同时含有碘离子（iodo-）与汞酸根/汞配合物（mercurate）的化学配合物（离子或盐），常指汞(II)的碘配合物，如四碘合汞酸根"},"examples":[{"en":"In Nessler’s reagent, tetraiodomercurate is used to detect ammonia in solution.","zh":"在奈斯勒试剂中，四碘合汞酸根常用于检测溶液中的氨。"},{"en":"The lab manual mentions an iodomercurate complex, so handle it with care because mercury compounds are toxic.","zh":"实验手册提到一种碘合汞配合物，因此要小心操作，因为汞化合物有毒。"}]}],"synonyms":["tetraiodomercurate","iodomercurate(II) complex","mercury(II) iodide complex"],"phonetic":"/ˌaɪoʊdoʊˈmɝːkjərət/","extraExplanation":["“iodomercurate”多见于化学/分析化学语境，常与“四碘合汞酸根”有关，典型结构是 [HgI4]2−（tetraiodomercurate(II)）。","该类含汞化合物具有毒性与环境危害，学习或实验场景中通常会强调通风、避免皮肤接触，并按危化品规范处置。"]}
{"word":"iodomercuriate","summary":{"en":"Iodomercuriate is a chemistry term for a mercury–iodide complex ion (an iodomercury complex anion), such as [HgI4]2−.","zh":"Iodomercuriate 是化学术语，指汞与碘离子形成的络合阴离子，例如 [HgI4]2−。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chemistry) A complex ion containing mercury (Hg) bonded to iodide (I⁻) ligands; an iodomercury complex anion (often written as iodomercurate), such as tetraiodomercurate(II), [HgI4]2−.","zh":"（化学）含有汞（Hg）与碘离子（I⁻）配位形成的络合阴离子；碘汞络合物阴离子（也常写作 iodomercurate），例如四碘合汞(II)离子 [HgI4]2−。"},"examples":[{"en":"In qualitative analysis, an iodomercuriate complex may form when mercury(II) reacts with excess iodide.","zh":"在定性分析中，当汞(II)与过量碘离子反应时，可能形成碘汞络合物（iodomercuriate）络离子。"},{"en":"The solution’s color change can indicate formation of tetraiodomercuriate(II), an iodomercuriate species.","zh":"溶液的颜色变化可能表明生成了四碘合汞(II)（tetraiodomercuriate(II)），这是一种 iodomercuriate 物种。"}]}],"synonyms":["iodomercurate","tetraiodomercurate(II) (specific example)"],"phonetic":"/ˌaɪoʊdˌmɝːkjəˈreɪt/","extraExplanation":["这个词在英语里更常见的拼写是 iodomercurate（尤其在命名具体阴离子如 tetraiodomercurate(II) 时）。iodomercuriate 属于较少见/变体用法，但指向同一类“碘配位的汞络合阴离子”。","它常出现在无机化学与分析化学语境中（例如研究汞与卤离子的配位平衡、沉淀/络合反应）。注意汞化合物具有毒性，实验与处理需严格遵循安全规范。"]}
{"word":"iodomethane","summary":{"en":"Iodomethane is a chemical (CH3I), also called methyl iodide, used mainly in labs to add a methyl group.","zh":"碘甲烷是一种化学物质（CH3I），又称碘化甲基，主要用于实验中进行甲基化反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colorless (sometimes pale yellow) liquid chemical, CH3I, used in organic chemistry as a methylating agent; also called methyl iodide.","zh":"一种无色（有时呈淡黄色）的液体化学物质，化学式为 CH3I，用于有机化学中作为甲基化试剂；也称为“碘甲烷/碘化甲基”。"},"examples":[{"en":"In the lab, iodomethane is often used to add a methyl group to a molecule.","zh":"在实验室里，碘甲烷常用来给分子引入一个甲基。"},{"en":"Methyl iodide (iodomethane) should be handled in a fume hood because it is toxic.","zh":"碘化甲基（碘甲烷）有毒，操作时应在通风橱中进行。"}]}],"synonyms":["methyl iodide","iodomethyl"],"phonetic":"/ˌaɪoʊdoʊˈmɛθeɪn/","extraExplanation":["“iodo-”表示“含碘的/与碘有关的”，methane 是“甲烷”；iodomethane 字面意思就是“带碘的甲烷”。","碘甲烷在有机合成中很常见，常用于把—O⁻、—S⁻、—N⁻等亲核基团“甲基化”。","安全提示：它具有毒性和挥发性，可能刺激眼睛和呼吸道；学习或实验中通常会强调佩戴防护并在通风条件下使用。"]}
{"word":"iodometric","summary":{"en":"Iodometric means “related to iodometry,” a titration method that uses iodine to measure chemical substances (often oxidizers).","zh":"iodometric 指“与碘量法有关”，即利用碘参与的滴定分析来测定物质（常见为氧化剂）的含量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to iodometry: an analytical chemistry method that measures oxidizing or reducing agents by using iodine (I₂) and titration, often with sodium thiosulfate.","zh":"与碘量法（iodometry）有关的：一种分析化学方法，通过生成/使用碘（I₂）并进行滴定（常用硫代硫酸钠）来测定氧化剂或还原剂的含量。"},"examples":[{"en":"They used an iodometric titration to determine the amount of bleach in the sample.","zh":"他们用碘量滴定来测定样品中漂白剂的含量。"},{"en":"The report lists iodometric methods for measuring dissolved oxygen in water.","zh":"报告列出了用于测定水中溶解氧的碘量法。"}]}],"synonyms":["iodometry-related","iodometric titration (phrase)","iodometric analysis (phrase)"],"phonetic":"/ˌaɪˌoʊdəˈmɛtrɪk/","extraExplanation":["“iodometric”来自“iodometry（碘量法）”。在实验室里常见的思路是：让被测物（常是氧化剂）把碘离子 I⁻ 氧化成碘 I₂，然后用硫代硫酸钠 Na₂S₂O₃ 滴定 I₂ 的量来反推被测物含量。","常与“iodimetric（碘量滴定法）”对比：iodimetric 通常指“直接用标准碘溶液滴定还原剂”，而 iodometric 常指“先生成碘，再滴定碘”。学习时重点记住：iodometric = 间接测定（通过碘作为中间体）。"]}
{"word":"iodometrical","summary":{"en":"“Iodometrical” means “related to iodometry,” a titration-based chemical analysis using iodine.","zh":"“iodometrical”表示“与碘量法有关的”，指用碘参与滴定的化学分析方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to iodometry (a chemical analysis method that uses iodine in titration to measure the amount of another substance).","zh":"与碘量法（用碘参与滴定来测定其他物质含量的化学分析方法）有关的。"},"examples":[{"en":"The lab report includes an iodometrical titration to determine copper concentration.","zh":"实验报告包含一次碘量滴定，用来测定铜的浓度。"},{"en":"Iodometrical methods are common in testing oxidizing agents in solution.","zh":"在检测溶液中的氧化剂时，碘量法相关的方法很常见。"}]}],"synonyms":["iodometric","iodometry-based"],"phonetic":"/ˌaɪoʊdəˈmɛtrɪkəl/","extraExplanation":["“iodometrical”常见于化学/分析化学语境，和“iodometric”意义基本相同，只是形式更偏传统或书面。","碘量法（iodometry）通常利用碘/碘离子（I₂/I⁻）的氧化还原反应：常见做法是先让待测物生成（或消耗）碘，再用硫代硫酸钠滴定碘来计算含量。"]}
{"word":"iodometrically","summary":{"en":"“Iodometrically” means “using iodometry (iodine-based titration) as the measurement method.”","zh":"“iodometrically”意为“用碘量法（碘相关滴定）进行测定”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses iodometry (an analytical chemistry method that measures a substance by iodine-based titration).","zh":"以碘量法（分析化学中用碘相关滴定来测定物质含量的方法）的方式；用碘量法地。"},"examples":[{"en":"The chlorine content was determined iodometrically.","zh":"氯含量是用碘量法测定的。"},{"en":"We analyzed the sample iodometrically to quantify the oxidizing agent.","zh":"我们用碘量法分析样品，以定量该氧化剂。"},{"en":"Iodometrically measured results were reported in milligrams per liter (mg/L).","zh":"用碘量法测得的结果以毫克每升（mg/L）报告。"}]}],"synonyms":["by iodometry","using iodometric titration","iodometrically (in method descriptions)"],"phonetic":"/ˌaɪoʊdəˈmɛtrɪkli/","extraExplanation":["“iodometrically”多见于实验报告、论文方法部分，常用来说明“采用碘量滴定/碘量法进行测定”。\n碘量法常用于测定氧化性物质（或通过间接反应测定某些还原性/金属离子），典型表述包括：determined/measured/analyzed iodometrically。"]}
{"word":"iodometry","summary":{"en":"Iodometry is an analytical chemistry method that uses iodine-based reactions in titration to measure the amount/concentration of a substance.","zh":"Iodometry（碘量法）是一种分析化学滴定方法，通过与碘相关的反应来测定物质的含量或浓度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of titration (chemical test) that uses iodine reactions to measure how much of a substance is present, often by producing or consuming iodine and then measuring it","zh":"一种利用碘的反应来进行定量分析的滴定法（化学测定方法）；通常通过生成或消耗碘，再对碘进行滴定来测出物质含量"},"examples":[{"en":"In the lab, we used iodometry to determine the concentration of bleach in a cleaning solution.","zh":"在实验室里，我们用碘量法测定清洁溶液中漂白剂的浓度。"},{"en":"Iodometry is commonly used to measure oxidizing agents by tracking iodine produced during the reaction.","zh":"碘量法常用于测定氧化剂，通过追踪反应中生成的碘来定量。"}]}],"synonyms":["iodine titration","iodine-based titration"],"phonetic":"/ˌaɪ.oʊˈdɑː.mə.tri/","extraExplanation":["“iodometry”常和“iodimetry”一起出现、容易混淆：一般说法是 iodimetry（碘直接滴定法）用“碘溶液去滴定待测物”；iodometry（碘量法/间接法）则是先让待测物把碘从碘化物中“释放出来”，再用硫代硫酸钠等把碘滴定掉。不同教材有时用词不完全一致，但实验思路通常按这一区分。","词源上来自“iodo-（碘）+ -metry（测量）”，字面意思就是“用碘来测量”。"]}
{"word":"iodonium","summary":{"en":"Iodonium is an iodine-based positively charged ion, most often encountered in organic chemistry as part of iodonium salts.","zh":"Iodonium（碘鎓）是以碘为中心的带正电离子，常在有机化学中以碘鎓盐的形式出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a positively charged iodine-containing ion (a cation), often written as R2I+ in organic chemistry; compounds containing this ion are called iodonium salts","zh":"含碘的带正电离子（阳离子），在有机化学中常写作 R2I+；含这种离子的化合物称为“碘鎓盐”"},"examples":[{"en":"Diaryliodonium salts are widely used as reagents in organic synthesis.","zh":"二芳基碘鎓盐在有机合成中被广泛用作试剂。"},{"en":"The reaction proceeds through an iodonium intermediate.","zh":"该反应通过一个碘鎓中间体进行。"}]}],"synonyms":["iodonium ion","iodonium cation","iodonium salt (related term)"],"phonetic":"ˌaɪ.oʊˈdoʊni.əm","extraExplanation":["“iodonium”通常出现在有机化学与材料化学语境中，指“高价碘（常见为碘(III)）”形成的阳离子中心；与之配对的阴离子（如 BF4−、OTf− 等）构成碘鎓盐。","碘鎓盐常被用作电亲试剂（可把芳基/烷基片段转移给底物），也常见于光引发体系（例如某些光固化树脂/涂料中）。"]}
{"word":"iodophor","summary":{"en":"An iodophor is an iodine-based disinfectant that releases iodine slowly and is used for sanitizing skin and equipment.","zh":"iodophor 指一种缓释碘的含碘消毒剂，用于皮肤与器械/设备的消毒清洁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A disinfectant made by binding iodine to a carrier (often a detergent), so it releases iodine slowly and is less irritating; commonly used to sanitize skin and equipment.","zh":"一种含碘消毒剂：将碘与载体（常为清洁剂/表面活性剂）结合，使碘缓慢释放、刺激性较低；常用于皮肤与器械/设备消毒。"},"examples":[{"en":"Before surgery, the nurse cleaned the skin with an iodophor solution.","zh":"手术前，护士用含碘消毒液清洁皮肤。"},{"en":"Many dairy farms use iodophor to sanitize milking equipment.","zh":"许多奶牛场用含碘消毒剂给挤奶设备消毒。"}]}],"synonyms":["povidone-iodine","iodine disinfectant","iodine sanitizer"],"phonetic":"/aɪˈɑːdəˌfɔːr/","extraExplanation":["“iodophor”常见于医疗、食品加工、畜牧与实验室语境。与“tincture of iodine（碘酊）”相比，iodophor 往往更温和、染色和刺激性相对小，但仍可能导致对碘敏感者不适。","常见类型是“povidone-iodine（聚维酮碘）”，在包装或说明书中也可能直接以此名称出现。使用时通常需要按说明稀释，并注意接触时间（contact time）才能达到消毒效果。"]}
{"word":"iodophors","summary":{"en":"Iodophor (plural: iodophors) is an iodine-based disinfectant that releases iodine slowly.","zh":"iodophor（复数 iodophors）指一种含碘的消毒剂，能缓慢释放碘发挥杀菌作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a disinfectant made by binding iodine to a carrier (usually a detergent or polymer) so it releases iodine slowly and is less irritating than plain iodine","zh":"碘伏（将碘与载体〔常为表面活性剂或聚合物〕结合而成的消毒剂，可缓慢释放碘，通常比直接用碘刺激性更小）"},"examples":[{"en":"The clinic uses an iodophor to disinfect skin before injections.","zh":"诊所在注射前用碘伏给皮肤消毒。"},{"en":"Food-processing equipment is sometimes cleaned with an iodophor solution.","zh":"食品加工设备有时会用碘伏溶液清洁消毒。"},{"en":"Povidone-iodine is a common iodophor found in first-aid kits.","zh":"聚维酮碘（碘伏）是急救箱里常见的一种碘伏制剂。"}]}],"synonyms":["povidone-iodine","iodine disinfectant","iodophor solution"],"phonetic":"/ˈaɪəˌdoʊfɔr/","extraExplanation":["“iodophor”来自“iodo-（碘）+ -phor（携带者）”，字面意思是“携带碘的物质”。它通过“缓释”方式释放有效碘，因此更稳定、气味/刺激性往往更低。","你输入的“iodophors”是复数形式：one iodophor（一个碘伏制剂）→ two iodophors（两种/两份碘伏制剂）。日常更常见的说法也包括“iodophor solution（碘伏溶液）”。","与之相关但不完全等同：tincture of iodine（碘酊，酒精碘，通常更刺激）；povidone-iodine（聚维酮碘，最常见的碘伏类型）。"]}
{"word":"iodoprotein","summary":{"en":"An iodoprotein is an iodine-containing protein, often discussed in thyroid biology or laboratory labeling.","zh":"iodoprotein 指“含碘蛋白”，常用于甲状腺生物学或实验室蛋白标记等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein that contains iodine as part of its structure (often formed by iodination), especially in the body (e.g., in the thyroid) or in laboratory/medical contexts","zh":"含碘蛋白；结构中含有碘元素（常由“碘化”形成）的蛋白质，常见于人体（如甲状腺）或实验/医学语境中"},"examples":[{"en":"Some iodoproteins in the thyroid are involved in making thyroid hormones.","zh":"甲状腺中的一些含碘蛋白参与甲状腺激素的生成。"},{"en":"In the lab, researchers labeled the protein to create an iodoprotein for tracing experiments.","zh":"在实验室里，研究人员给蛋白做标记，制备含碘蛋白用于追踪实验。"}]}],"synonyms":["iodinated protein","iodine-containing protein"],"phonetic":"/ˌaɪ.oʊ.doʊˈproʊ.tiːn/","extraExplanation":["词源构成：iodo- 表示“碘/与碘有关”，protein 表示“蛋白质”。因此 iodoprotein 字面意思就是“含碘的蛋白”。","常见相关领域：生理学（甲状腺与激素合成）、生物化学（蛋白碘化/标记）、核医学与免疫检测（用碘同位素进行示踪或检测）。","学习提示：它属于较专业的科技词汇；日常英语中更常见的说法是 iodinated protein（碘化蛋白）或具体名称（如 thyroglobulin 甲状腺球蛋白，属于重要的含碘蛋白之一）。"]}
{"word":"iodopsin","summary":{"en":"Iodopsin is a cone-cell visual pigment in the retina that supports color vision in bright light.","zh":"iodopsin（碘视蛋白）是视网膜视锥细胞中的感光色素，主要支持明视觉与色觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light-sensitive pigment in the cone cells of the retina, involved in color vision (especially in brighter light).","zh":"视网膜视锥细胞中的一种感光色素，参与色觉（尤其在强光环境下）。"},"examples":[{"en":"Iodopsin helps cone cells respond to light, supporting color vision in daylight.","zh":"碘视蛋白帮助视锥细胞对光作出反应，支持日光下的色觉。"},{"en":"Some textbooks mention iodopsin when explaining how cones differ from rods.","zh":"一些教材在解释视锥细胞与视杆细胞的区别时会提到碘视蛋白。"}]}],"synonyms":["photopsin","cone opsin","cone pigment"],"phonetic":"/aɪˈɑːdɑːpsɪn/","extraExplanation":["“Iodopsin”是较偏旧式或传统的说法，现代生物学/医学语境中更常用更具体的术语，如“cone opsins（视锥视蛋白）”，并按波长分为S/M/L（对应短/中/长波；大致与蓝/绿/红敏感相关）。","它与“rhodopsin（视紫红质）”常一起对比：rhodopsin主要存在于视杆细胞，负责暗光视觉；iodopsin/视锥视蛋白主要存在于视锥细胞，负责明视觉与色觉。"]}
{"word":"iodopsins","summary":{"en":"Iodopsins are cone-cell visual pigments used for color vision in bright light.","zh":"iodopsins 指锥状细胞中的视觉色素，主要用于强光下的颜色视觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Light-sensitive visual pigments in the cone cells of the retina, involved in color vision (especially in brighter light).","zh":"视网膜锥状细胞中的感光视觉色素，参与颜色视觉（尤其在强光/明视觉条件下）。"},"examples":[{"en":"Iodopsins help the eye detect different wavelengths of light, which we experience as color.","zh":"碘视紫质帮助眼睛识别不同波长的光，我们因此感知到颜色。"},{"en":"Cone cells contain iodopsins, while rod cells mainly contain rhodopsin.","zh":"锥状细胞含有碘视紫质，而杆状细胞主要含有视紫红质（rhodopsin）。"}]}],"synonyms":["cone opsins","photopsins","cone pigments"],"phonetic":"/aɪˈɑːdɑp.sɪnz/","extraExplanation":["“iodopsin”常见于生理学/眼科学语境，指锥状细胞的视觉色素系统；现代教材也更常用“cone opsins（锥状视蛋白/视锥蛋白）”或更广义的“photopsins”来讲解。","词形提示：iodopsins 是复数；单数是 iodopsin。词根 iod- 与“碘（iodine）”同源，历史上与化学反应特性相关的命名有关，但学习时可把它理解为“锥状细胞的感光色素”。"]}
{"word":"iodoso","summary":{"en":"“Odioso” (often misspelled as “iodoso”) is a Spanish/Italian adjective meaning “odious, hateful, very unpleasant.”","zh":"“odioso”（常被误写成“iodoso”）是西班牙语/意大利语形容词，意思是“可憎的、讨厌的、令人厌恶的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish/Italian) hateful; unpleasant or deeply disliked; “odious.”","zh":"（西班牙语/意大利语）可憎的；令人厌恶的；非常不受喜欢的（相当于英语 odious）。"},"examples":[{"en":"In Spanish, “un hombre odioso” means “an odious (hateful) man.”","zh":"在西班牙语中，“un hombre odioso”意思是“一个可憎/讨厌的男人”。"},{"en":"She said his comment was odioso—so offensive that no one wanted to continue the conversation.","zh":"她说他的评论很 odioso——太冒犯了，以至于没人想继续谈下去。"}]}],"synonyms":["odious","hateful","detestable","repulsive","offensive"],"phonetic":"/oʊdiˈoʊsoʊ/","extraExplanation":["你输入的“iodoso”很可能是拼写误差；更常见的是西班牙语/意大利语的“odioso”。英语里对应的常用词是“odious”（可憎的、令人厌恶的）。","在日常西语中，“odioso”既可形容人（讨厌的人），也可形容事（令人厌烦/可恶的事）。意大利语用法相近。"]}
{"word":"iodosobenzene","summary":{"en":"Iodosobenzene is an organoiodine reagent (C6H5IO) mainly used as a mild oxidant in organic synthesis.","zh":"碘代亚氧基苯是一种有机碘试剂（C6H5IO），主要在有机合成中用作温和氧化剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pale-yellow aromatic organoiodine compound (C6H5IO) in which iodine is in a higher oxidation state; used mainly as an oxidizing reagent and as a precursor to other hypervalent iodine compounds in organic chemistry.","zh":"碘代亚氧基苯（C6H5IO），一种淡黄色的芳香族有机碘化合物（碘处于较高氧化态）；主要在有机化学中用作氧化试剂，或作为其他高价碘化合物的前体。"},"examples":[{"en":"In the synthesis, iodosobenzene was used as a mild oxidant to convert the sulfide to a sulfoxide.","zh":"在该合成中，碘代亚氧基苯被用作温和的氧化剂，将硫醚氧化为亚砜。"},{"en":"The reaction mixture turned cloudy after adding iodosobenzene, indicating the reagent was dispersing in the solvent.","zh":"加入碘代亚氧基苯后，反应液变得浑浊，说明该试剂在溶剂中开始分散。"}]}],"synonyms":["PhIO","iodosylbenzene"],"phonetic":"/ˌaɪoʊˌdoʊsoʊˈbɛnzin/","extraExplanation":["“iodosobenzene”是由“iodoso-（表示含有I=O或类似结构的碘氧基、与高价碘相关）+ benzene（苯环）”构成的化学命名。它常出现在有机合成文献中，与“高价碘试剂（hypervalent iodine reagents）”这一类温和、选择性较好的氧化/转化试剂相关。"]}
{"word":"iodospongin","summary":{"en":"Iodospongin is a rare scientific term referring to a marine sponge–derived compound.","zh":"Iodospongin 是一个较少见的科学术语，指来源于海绵的海洋天然产物（化合物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A little-used name in scientific contexts for a marine-derived compound (a natural product) reported from sponges; not a common everyday English word and rarely found in general dictionaries.","zh":"一个较少使用的科学名称，指报道来源于海绵的海洋天然产物（化合物）；不是日常英语词，在通用词典中也很少收录。"},"examples":[{"en":"Iodospongin has been mentioned in a few older reports on chemicals isolated from marine sponges.","zh":"Iodospongin 在一些较早的关于从海绵中分离化学物质的报告中被提到。"},{"en":"If you see the term iodospongin, check the original paper to confirm its structure and modern name.","zh":"如果你看到 iodospongin 这个术语，最好查阅原始论文来确认其结构和现代命名。"}]}],"synonyms":["(no common synonyms in general English)"],"phonetic":"/ˌaɪ.oʊ.doʊˈspʌn.dʒɪn/","extraExplanation":["这个词非常冷门，更多像“特定论文/数据库里出现过的化合物名”，而不是常见英语词汇。不同资料可能会出现拼写差异或被更新的系统命名（IUPAC 名称）/同义名。","学习和检索建议：如果你在文献里遇到 iodospongin，最好连同来源（作者、年份、期刊）一起检索，或在化学数据库（如 PubChem、ChemSpider）中用“来源海绵种名 + iodospongin”交叉查询，以避免同名或误拼。"]}
{"word":"iodotannic","summary":{"en":"Iodotannic means “related to iodine and tannic acid,” often in older medical/chemical contexts.","zh":"iodotannic 指“与碘和鞣酸有关的”，多见于旧时医学/化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made from iodine and tannic acid (often referring to an old medicinal compound, such as “iodotannic acid”).","zh":"与碘和鞣酸有关的；由碘与鞣酸制成的（常指旧时药用化合物，如“碘鞣酸/碘鞣酸盐”等）。"},"examples":[{"en":"Some 19th-century medical texts mention iodotannic preparations for throat infections.","zh":"一些19世纪的医学文献提到用碘鞣酸类制剂治疗咽喉感染。"},{"en":"The label described the solution as iodotannic, indicating it combined iodine with tannic acid.","zh":"标签写着“iodotannic”，表示该溶液将碘与鞣酸结合在一起。"}]}],"synonyms":["iodo-tannic","iodine–tannic (acid)","iodotannate (related form)"],"phonetic":"/ˌaɪˌoʊdəˈtænɪk/","extraExplanation":["“iodotannic”属于较少见、偏历史/专业的用词，多出现在旧药典、历史医学资料或化学命名中，现代英语里更常见的说法是直接写成“iodine + tannic acid”或使用更具体的化学名称（如 iodotannic acid）。","构词提示：iodo- 表示“含碘/与碘有关”，tannic 表示“鞣酸的/与鞣酸有关”。","阅读旧文献时要注意：不同年代或不同作者可能把相关物质写成 iodotannic acid、iodo-tannic 等近似形式。"]}
{"word":"iodotherapy","summary":{"en":"Iodotherapy means treating a disease using iodine, often for thyroid problems (including radioiodine therapy).","zh":"iodotherapy 指“碘疗法”，用碘（含碘药物）治疗疾病，常见于甲状腺问题（包括放射性碘治疗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"treatment using iodine (or iodine-based medicine), especially to manage thyroid conditions; it can include forms like radioiodine therapy.","zh":"碘疗法：使用碘（或含碘药物）进行治疗，尤其常用于甲状腺相关疾病；也可能包括放射性碘治疗等形式。"},"examples":[{"en":"The endocrinologist recommended iodotherapy to treat her overactive thyroid.","zh":"内分泌科医生建议用碘疗法来治疗她的甲状腺功能亢进。"},{"en":"After surgery, the patient received iodotherapy to reduce the chance of the thyroid cancer returning.","zh":"手术后，患者接受了碘疗法，以降低甲状腺癌复发的风险。"}]}],"synonyms":["iodine therapy","radioiodine therapy","RAI therapy"],"phonetic":"/ˌaɪoʊdoʊˈθɛrəpi/","extraExplanation":["“Iodotherapy”较少见，更常见的表达是“iodine therapy”（碘治疗）或“radioiodine therapy / radioactive iodine (RAI) therapy”（放射性碘治疗）。","放射性碘治疗常用于甲亢（如格雷夫斯病）以及部分甲状腺癌术后清除残余甲状腺组织。该治疗需要严格遵医嘱，部分情况下需短期隔离或避免接触孕妇与婴幼儿。","词源上：iodo- 来自 iodine（碘）；-therapy 表示“治疗”。发音时重音通常落在“THAIR-”附近。"]}
{"word":"iodothyrin","summary":{"en":"Iodothyrin is a rare/older medical term for an iodine-containing thyroid hormone–related substance.","zh":"Iodothyrin 是较少见、偏旧的医学术语，指与甲状腺激素相关的含碘物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) A thyroid hormone–related substance containing iodine; an older or less common term used for iodine-containing thyroid compounds (often discussed alongside thyroxine/T4 and triiodothyronine/T3).","zh":"（医学，用语较少）一种与甲状腺激素相关、含碘的物质；较旧或不常用的术语，常用于指代含碘的甲状腺化合物（常与甲状腺素T4、三碘甲状腺原氨酸T3一并讨论）。"},"examples":[{"en":"In early endocrinology texts, iodothyrin was described as an iodine-containing product of the thyroid gland.","zh":"在早期内分泌学教材中，iodothyrin 被描述为甲状腺产生的含碘产物。"},{"en":"The paper compared iodothyrin-like compounds with modern measurements of T3 and T4.","zh":"该论文将类似 iodothyrin 的化合物与现代对 T3 和 T4 的测量进行了比较。"}]}],"synonyms":["thyroxine (T4)","triiodothyronine (T3)","iodothyronine"],"phonetic":"/ˌaɪoʊdoʊˈθaɪrɪn/","extraExplanation":["这个词在现代医学英语中很少见，更常见、更标准的相关词是：thyroxine（甲状腺素，T4）和 triiodothyronine（或 liothyronine，三碘甲状腺原氨酸，T3）。如果你是在老文献、旧版词典或历史性研究里看到 iodothyrin，它往往是对“含碘的甲状腺激素/提取物/相关化合物”的较笼统叫法。","拼写提示：你输入的 iodothyrin 可能与 iodothyronine（碘甲状腺原氨酸类）混淆；后者在现代文献中更常见。若你能提供原句或出处，我可以帮你判断作者具体指 T3、T4，还是更泛指的甲状腺含碘物质。"]}
{"word":"iodous","summary":{"en":"“Iodous” is a rare chemistry adjective meaning related to iodous acid (HIO₂) or iodine in the +3 oxidation state.","zh":"“iodous”是较罕见的化学形容词，指与亚碘酸（HIO₂）或碘的+3价氧化态有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to iodous acid (HIO₂) or to iodine in the +3 oxidation state; containing iodine in this form.","zh":"（化学）与亚碘酸（HIO₂）或碘的+3价氧化态有关；含有这种形态的碘。"},"examples":[{"en":"In some older chemistry texts, “iodous” compounds are discussed alongside iodic and hypoiodous compounds.","zh":"在一些较早的化学教材中，“iodous（亚碘的）”化合物会与iodic（碘的）和hypoiodous（次亚碘的）化合物一起讨论。"},{"en":"The term iodous is most often used when naming acids or salts derived from iodous acid.","zh":"“iodous”这个词最常用于命名由亚碘酸衍生的酸或盐。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, general) Having to do with iodine; iodine-related.","zh":"（罕见，一般用法）与碘有关的；含碘的。"},"examples":[{"en":"The paper used the word iodous to describe an iodine-related reaction, though “iodine-containing” is more common today.","zh":"论文用“iodous”来描述与碘有关的反应，不过现在更常用“iodine-containing（含碘的）”。"}]}],"synonyms":["iodine-related","iodine-containing"],"phonetic":"/ˈaɪəˌdoʊəs/","extraExplanation":["“iodous”不是日常英语词汇，主要出现在化学命名体系里。常见的相关词还有：hypoiodous（次亚碘的，+1）、iodous（亚碘的，+3）、iodic（碘的，+5）。不同后缀通常对应不同的氧化态与酸（或其盐）的命名传统。"]}
{"word":"iodoxy","summary":{"en":"“Iodoxy” is a rare chemistry adjective meaning “related to an iodoxy (—IO₂) group or iodine(V) oxo compounds.”","zh":"“iodoxy”是化学中较少见的形容词，指“与碘氧基（—IO₂）或碘(V)含氧化合物有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, rare) Relating to an iodoxy group (—IO₂) or to iodine(V) oxo compounds, as in “iodoxybenzene.”","zh":"（化学，用法少见）与“碘氧基”（—IO₂）或碘(V)含氧化合物有关的；如“iodoxybenzene（碘氧基苯）”。"},"examples":[{"en":"IBX is an iodoxy-based oxidant used in organic synthesis.","zh":"IBX 是一种以“碘氧基”结构为特征的氧化剂，用于有机合成。"},{"en":"The paper discusses reactions of iodoxy compounds with alcohols.","zh":"这篇论文讨论了碘氧基化合物与醇的反应。"}]}],"synonyms":["iodine(V)","iodic (related)","hypervalent iodine (contextual)"],"phonetic":"/aɪˈɑːdɑːksi/","extraExplanation":["“iodoxy”在日常英语中几乎不用，主要出现在有机化学/科研语境里，常与具体化合物名称连用（如 iodoxybenzene）或指某类高价碘（尤其碘(V)）含氧基团/试剂。","如果你是在化学文献里看到的词，也可能与常见试剂缩写有关（例如 IBX：2-iodoxybenzoic acid，2-碘氧基苯甲酸）。","若你原本想查的是拼写相近的常用词，请告诉我上下文句子；我也可以帮你判断是否应为 iodine（碘）、iodic（碘酸的/含碘的）等。"]}
{"word":"iodoxybenzene","summary":{"en":"Iodoxybenzene is a hypervalent iodine compound used as a strong oxidizing reagent in organic chemistry.","zh":"iodoxybenzene（碘氧苯/碘酰苯）是一种高价碘化合物，常用作有机化学中的强氧化剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (PhIO₂) used as an oxidizing reagent in organic chemistry; also called iodylbenzene","zh":"一种化学化合物（PhIO₂），在有机化学中用作氧化剂；也称为“碘酰苯 / iodylbenzene”"},"examples":[{"en":"Iodoxybenzene is sometimes used to oxidize alcohols to aldehydes or ketones.","zh":"碘氧苯有时用于将醇氧化为醛或酮。"},{"en":"Because it is a strong oxidant, iodoxybenzene must be handled with care in the lab.","zh":"由于它是强氧化剂，碘氧苯在实验室中必须小心操作。"}]}],"synonyms":["iodylbenzene","PhIO2"],"phonetic":"/ˌaɪ.oʊˌdɑːk.siˈbɛn.ziːn/","extraExplanation":["“iodoxy-”里的“oxy”与“氧（oxygen）”有关；“iodoxybenzene”字面意思可理解为“带有高价碘-氧基团的苯”。它属于“高价碘化合物（hypervalent iodine compounds）”，常见于有机合成中的温和/选择性氧化反应语境。","在不同教材/论文中也可能写作“iodoxy benzene”或更常见的同义名“iodylbenzene（碘酰苯）”。作为强氧化剂，通常需要遵守化学品安全规范（避免与可燃/还原性物质接触、注意粉尘与摩擦等风险）。"]}
{"word":"iodyrite","summary":{"en":"Iodyrite is a rare mineral form of silver iodide (AgI), also known as iodargyrite.","zh":"iodyrite 指一种稀有的碘化银（AgI）矿物，也叫 iodargyrite（碘银矿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral made of silver iodide (AgI), usually found in dry, oxidized zones of silver deposits; also called iodargyrite","zh":"一种稀有矿物，成分为碘化银（AgI），常见于银矿床的干燥氧化带；亦称“碘银矿/碘化银矿”（iodargyrite）"},"examples":[{"en":"The geologist identified pale-yellow iodyrite in the oxidized zone of the old silver mine.","zh":"地质学家在旧银矿的氧化带中辨认出淡黄色的碘银矿（iodyrite）。"},{"en":"Iodyrite is essentially natural silver iodide found as a mineral.","zh":"碘银矿（iodyrite）本质上就是以矿物形式出现的天然碘化银。"}]}],"synonyms":["iodargyrite","silver iodide"],"phonetic":"/aɪˈoʊdəˌraɪt/","extraExplanation":["“iodyrite”在现代矿物学中较少单独使用，更常见的正式名称是“iodargyrite”（碘银矿）。两者通常指同一种矿物：碘化银（AgI）。","它的颜色常呈淡黄到黄绿色，常与其他银的次生矿物一起出现在干旱环境或强氧化条件下的矿脉中。"]}
{"word":"iof","summary":{"en":"IOF is an abbreviation most commonly used for a Brazilian tax on financial transactions.","zh":"IOF 常指巴西对金融交易征收的一种税的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) a written abbreviation for “Imposto sobre Operações Financeiras,” a Brazilian tax charged on certain financial transactions (such as loans, foreign exchange, and insurance).","zh":"（缩写）“Imposto sobre Operações Financeiras”的缩写，指巴西对部分金融交易（如贷款、外汇、保险等）征收的税。"},"examples":[{"en":"The bank included IOF in the total cost of the international transfer.","zh":"银行把 IOF 计入了这笔国际转账的总费用。"},{"en":"When exchanging currency in Brazil, you may be charged IOF.","zh":"在巴西兑换货币时，可能会被收取 IOF。"}]}],"synonyms":["Imposto sobre Operações Financeiras"],"phonetic":"/ˌaɪ.oʊˈɛf/","extraExplanation":["“IOF”在英语文本里通常出现在与巴西金融、旅行换汇、跨境付款相关的语境中，多见于账单、费用明细或财经新闻。","如果你本来想输入的是英文介词“of”，那是另一条词条：of /əv/ 或 /ʌv/，表示“……的/属于……”。你也可以告诉我你想查哪一个。"]}
{"word":"iolite","summary":{"en":"Iolite is a blue‑violet gemstone (cordierite), also used to name the mineral itself.","zh":"Iolite 指蓝紫色宝石“堇青石”（cordierite 的宝石级品种），也可指该矿物本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blue to violet gemstone (a variety of the mineral cordierite), often cut for jewelry","zh":"一种蓝紫色的宝石（矿物“堇青石”cordierite 的宝石级品种），常用于珠宝镶嵌"},"examples":[{"en":"She wore a ring set with an iolite that looked deep blue in the shade.","zh":"她戴着一枚镶有堇青石的戒指，在阴影里看起来是深蓝色。"},{"en":"Iolite is sometimes chosen as a more affordable alternative to sapphire.","zh":"堇青石有时会被选作更实惠的蓝宝石替代品。"}]},{"partOfSpeech":"n.","definition":{"en":"the mineral cordierite itself, typically found in metamorphic rocks","zh":"矿物“堇青石”（cordierite）本身，常见于变质岩中"},"examples":[{"en":"The sample contained iolite crystals formed during metamorphism.","zh":"这份样品含有在变质作用中形成的堇青石晶体。"}]}],"synonyms":["cordierite","water sapphire (trade name)"],"phonetic":"/ˈaɪ.əˌlaɪt/","extraExplanation":["“iolite”常被称为“water sapphire（海蓝宝石/水蓝宝石）”，但它并不是蓝宝石；这种叫法更多是市场上的形容。","它有明显的多色性（从不同角度看会呈现蓝色、紫色甚至偏灰黄），因此在选购和切割时会特别讲究角度。","有一种流行说法称它为“Viking’s compass（维京罗盘石）”，传说航海者利用其偏振特性在阴天辨别太阳方向；这更多是文化故事与推测，现代常作为有趣的背景介绍。"]}
{"word":"iolites","summary":{"en":"Iolites are blue-violet gemstones (the plural of iolite).","zh":"Iolites 指蓝紫色的宝石“iolite”的复数（堇青石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a usually blue to violet gemstone (a mineral) sometimes used in jewelry; the plural form is “iolites.”","zh":"一种通常呈蓝色到紫色的宝石矿物，可用于珠宝；复数形式为“iolites”。"},"examples":[{"en":"She wore a ring set with iolite and silver.","zh":"她戴着一枚镶有堇青石（iolite）和银的戒指。"},{"en":"The jeweler showed us several iolites in different shades of blue.","zh":"珠宝商给我们看了几颗不同蓝色深浅的堇青石。"}]}],"synonyms":["cordierite"],"phonetic":"/ˈaɪəˌlaɪt/","extraExplanation":["“iolite”常译作“堇青石（宝石级）”。它的颜色可能随观察角度变化（有时会呈现偏灰、偏紫或偏黄的色调），因此挑选时常会在不同光线与角度下观察。","在一些通俗读物中，iolite 有时被称为“viking’s compass（维京罗盘）”，说法源于其在某些情况下可帮助判断光线方向的传闻；这更多是文化故事与科普话题，在珠宝语境中仍以宝石属性与颜色为主。"]}
{"word":"ion","summary":{"en":"Ion most commonly means a charged atom or molecule; “-ion” can also be a suffix that forms nouns meaning an action or result.","zh":"ion 通常指“带电的原子或分子（离子）”；“-ion”也可作后缀，用来构成表示“行为/过程/结果”的名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An electrically charged atom or molecule that has lost or gained one or more electrons.","zh":"离子：失去或获得一个或多个电子而带电的原子或分子。"},"examples":[{"en":"Salt breaks into sodium ions and chloride ions in water.","zh":"食盐在水中会分解成钠离子和氯离子。"},{"en":"Hydrogen ions make a solution more acidic.","zh":"氢离子会使溶液更酸。"}]},{"partOfSpeech":"other","definition":{"en":"A suffix meaning “action, process, or result,” used to form nouns (e.g., expansion, discussion).","zh":"后缀 -ion：表示“行为、过程或结果”，用来构成名词（如 expansion 扩张，discussion 讨论）。"},"examples":[{"en":"The ending “-ion” often turns a verb into a noun: decide → decision.","zh":"“-ion”常把动词变成名词：decide → decision（决定）。"},{"en":"Many academic words end in “-ion,” like “information” and “education.”","zh":"很多学术词以“-ion”结尾，比如 information（信息）和 education（教育）。"}]}],"synonyms":["charged particle","cation","anion"],"phonetic":"/ˈaɪ.ən/","extraExplanation":["科学里的 ion（离子）读音是 /ˈaɪ.ən/，不要和“iron”（铁）混淆；iron 的发音是 /ˈaɪ.ərn/，多了一个 /r/ 音。","在化学中，带正电的离子叫 cation（阳离子），带负电的离子叫 anion（阴离子）。","作为词尾 -ion 时，它通常来自拉丁语的名词化形式，常见于正式或书面英语；口语里有时会用更简单的同义词（如 help instead of assistance）。"]}
{"word":"ional","summary":{"en":"“-ional” is an adjective-forming suffix meaning “related to.”","zh":"“-ional”是构成形容词的后缀，表示“与……有关的/……的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A suffix used to form adjectives meaning “relating to, connected with, or characterized by” something (often from a noun ending in -ion).","zh":"（后缀）用于构成形容词，表示“与……有关的、……方面的、具有……性质的”（常由以 -ion 结尾的名词派生）。"},"examples":[{"en":"education → educational: relating to education.","zh":"education（教育）→ educational（教育的）：与教育有关的。"},{"en":"nation → national: relating to a nation.","zh":"nation（国家）→ national（国家的）：与国家有关的。"},{"en":"profession → professional: relating to a profession; also meaning skilled or trained.","zh":"profession（职业）→ professional（职业的/专业的）：与职业有关；也可表示“专业的、受过训练的”。"}]}],"synonyms":["-al","-ic","-ary","-ive"],"phonetic":"/ʃənəl/","extraExplanation":["“-ional”通常不是一个独立单词，而是后缀；更常见的拼写还包括“-tional”（如 national, international）。","发音会随前面的词根变化：例如 national 里听起来像 /ˈnæʃənəl/，educational 里也常有 /ʃənəl/ 这一段。","学习时可以把它整体理解为“……的”，并注意它常把名词变成形容词：region→regional，tradition→traditional，emotion→emotional（拼写会有变化）。"]}
{"word":"ionary","summary":{"en":"“Ionary” is not a standard English word; it’s likely a typo or part of another word (often “dictionary”).","zh":"“ionary”不是标准英文单词；多半是拼写错误或其他单词的一部分（常见为“dictionary”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; it is most likely a misspelling or a fragment of another word (for example, part of “dictionary”).","zh":"本身不是标准英文单词；更可能是拼写错误或某个单词的一部分（例如“dictionary”的一段）。"},"examples":[{"en":"“Ionary” isn’t a common English word—did you mean “dictionary”?","zh":"“ionary”不是常见英文单词——你是不是想写“dictionary（词典）”？"},{"en":"If you can share the full sentence, I can help you find the correct word.","zh":"如果你能提供完整句子，我可以帮你确定正确的单词。"}]}],"phonetic":"/ˈaɪəˌnɛri/","extraExplanation":["“ionary”很可能来自你想输入的单词的一部分。最常见的情况是你想写“dictionary（词典）”。如果你把原句贴出来，我也可以根据上下文判断你要表达的意思。"]}
{"word":"ione","summary":{"en":"“Ione” is mainly used as a proper noun (a female name or a place name).","zh":"“Ione”主要是专有名词（女性名字或地名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ione: a given name (used for women) and sometimes a place name (e.g., Ione, California).","zh":"Ione：女性名字（人名），有时也用作地名（如美国加州的 Ione）。"},"examples":[{"en":"Ione is meeting us for coffee after class.","zh":"Ione 下课后要和我们去喝咖啡。"},{"en":"They drove through Ione on their way to the mountains.","zh":"他们去山里的路上开车经过了 Ione。"}]}],"phonetic":"/aɪˈoʊni/","extraExplanation":["“Ione”在英语里主要作为专有名词使用（人名/地名），不是常见的普通词汇。","很多学习者输入“ione”其实是想查“ion”（离子）。如果你想查的是 ion，请告诉我，我可以给你它的发音、词义和例句。"]}
{"word":"ioni","summary":{"en":"“ioni” isn’t standard English; it usually refers to “ion/ions” (charged particles) or is Italian for “ions.”","zh":"“ioni”不是标准英语；通常指英语的“ion/ions（离子）”，或是意大利语中“离子（复数）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often, “ioni” is either (1) a misspelling of “ion/ions” in English, or (2) the Italian plural of “ione” (“ion”).","zh":"不是标准英语单词。“ioni”最常见的情况是：(1) 英语里把“ion/ions（离子）”拼错了；或(2) 意大利语中“ione（离子）”的复数形式。"},"examples":[{"en":"I think you meant “ions,” the charged particles in salt water.","zh":"我觉得你想写的是“ions”，也就是盐水里的带电粒子（离子）。"},{"en":"In Italian, “ioni” means “ions.”","zh":"在意大利语里，“ioni”的意思是“离子（复数）”。"}]},{"partOfSpeech":"n.","definition":{"en":"ion: an atom or molecule that has an electric charge because it has lost or gained electrons.","zh":"ion：因失去或获得电子而带电的原子或分子（离子）。"},"examples":[{"en":"Sodium becomes a positive ion in salt (Na⁺).","zh":"钠在食盐中会变成带正电的离子（Na⁺）。"},{"en":"The battery works by moving ions between two materials.","zh":"电池通过让离子在两种材料之间移动来工作。"}]}],"synonyms":["charged particle","cation","anion"],"phonetic":"/ˈaɪɑn/","extraExplanation":["如果你是在化学/物理语境下看到“ioni”，大概率是非英语文本（尤其是意大利语）或英文里把“ions”拼成了“ioni”。英语里通常用“ion”（单数）和“ions”（复数）。"]}
{"word":"Ionic","summary":{"en":"Ionic mainly means “related to ions or ionic bonding” in chemistry, and it can also describe the Ionic style of Greek columns in architecture.","zh":"Ionic 主要指化学中的“与离子或离子键有关的”；也可指建筑中的“爱奥尼柱式”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to ions (charged atoms or groups of atoms) or to bonding formed by the attraction between positive and negative ions.","zh":"（化学）与离子（带电的原子或原子团）有关的；或指由正负离子相互吸引形成的“离子键/离子结合”。"},"examples":[{"en":"Table salt (sodium chloride) is an ionic compound.","zh":"食盐（氯化钠）是一种离子化合物。"},{"en":"Water can dissolve many ionic substances.","zh":"水能溶解许多离子性物质。"},{"en":"An ionic bond forms when electrons are transferred from one atom to another.","zh":"当电子从一个原子转移到另一个原子时，就会形成离子键。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Architecture) Relating to the Ionic order, a classical Greek style of column recognized by its scroll-shaped capitals (volutes).","zh":"（建筑）与古典希腊的“爱奥尼柱式/伊奥尼柱式”（Ionic order）有关；其柱头常见卷涡形装饰（volutes）。"},"examples":[{"en":"The museum entrance uses Ionic columns.","zh":"博物馆入口使用了爱奥尼式柱子。"},{"en":"Ionic capitals often have spiral scrolls on both sides.","zh":"爱奥尼柱头常在两侧有螺旋卷涡装饰。"}]}],"synonyms":["ion-related","ionized (context-dependent)","Ionic-order (architecture)"],"phonetic":"/aɪˈɑnɪk/","extraExplanation":["“Ionic”在化学里最常见，和“covalent（共价的）”相对：离子键通常涉及电子转移；共价键通常是共享电子。","建筑中的“Ionic”来自古希腊小亚细亚的爱奥尼亚（Ionia）地区；古典柱式常见三种：Doric（多立克，较朴素厚重）、Ionic（爱奥尼，较纤细有卷涡）、Corinthian（科林斯，更华丽有叶饰）。"]}
{"word":"ionic","summary":{"en":"Ionic usually means “related to ions,” especially ionic bonds/compounds in chemistry; it can also mean “related to ancient Ionia,” especially the Ionic architectural order.","zh":"ionic通常指“与离子有关的”（如离子键、离子化合物）；也可指“与古希腊爱奥尼亚有关的”，尤其是爱奥尼亚柱式等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to ions (charged atoms or molecules) or involving the attraction between positive and negative ions, especially in chemistry.","zh":"与离子（带电的原子或分子）有关的；尤指化学中由正负离子相互吸引形成或参与的。"},"examples":[{"en":"Table salt is an ionic compound made of sodium and chloride ions.","zh":"食盐是一种离子化合物，由钠离子和氯离子组成。"},{"en":"Ionic bonds form when one atom transfers electrons to another.","zh":"当一个原子把电子转移给另一个原子时，就会形成离子键。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the ancient Greek region of Ionia or its people, dialect, or architectural style (Ionic order).","zh":"与古希腊的爱奥尼亚（Ionia）地区及其人民、方言或建筑风格（爱奥尼亚柱式）有关的。"},"examples":[{"en":"The temple features Ionic columns with scroll-shaped capitals.","zh":"这座神庙采用爱奥尼亚柱式的柱子，柱头像卷轴一样。"},{"en":"The Iliad was preserved in several Greek dialects, including Ionic.","zh":"《伊利亚特》在多种希腊方言中流传，其中包括爱奥尼亚方言。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involving movement/flow of ions, especially in liquids or biological systems.","zh":"涉及离子的移动或流动的（尤指在溶液或生物系统中）。"},"examples":[{"en":"Sports drinks help replace ionic electrolytes lost through sweat.","zh":"运动饮料有助于补充因出汗流失的离子电解质。"},{"en":"The battery relies on ionic conduction through the electrolyte.","zh":"电池依靠电解质中的离子传导来工作。"}]}],"synonyms":["ion-related","ionized","(architecture) Ionian"],"phonetic":"/aɪˈɑnɪk/","extraExplanation":["“ionic”在科学语境最常见，常与这些词搭配：ionic bond（离子键）、ionic compound（离子化合物）、ionic charge（离子电荷）、ionic strength（离子强度）、electrolyte（电解质）。","注意区分：ionic（离子键/离子） vs. covalent（共价键/共享电子）。离子键常见于“金属 + 非金属”，如 NaCl。","第二个含义来自古希腊三大柱式之一：Doric（多立克）、Ionic（爱奥尼亚）、Corinthian（科林斯）。Ionic柱式常见特征是柱头的“卷涡”（scroll/volute）。"]}
{"word":"ionical","summary":{"en":"“Ionical” is not standard; you probably mean “ironical/ironic,” meaning “showing irony.”","zh":"“ionical”不是标准拼写；你多半想写“ironical/ironic”，意思是“带有反讽/讽刺意味的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling of “ironical” (or “ironic”).","zh":"不是标准英语单词。通常是把 “ironical”（或 “ironic”）拼错了。"},"examples":[{"en":"I think you mean “ironical,” not “ionical.”","zh":"我觉得你想写的是 “ironical”，不是 “ionical”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Ironical: using or showing irony; meaning the opposite of what is said, often in a humorous or critical way.","zh":"Ironical：带有反讽意味的；说的话表面意思与真实意思相反，常带幽默或批评。"},"examples":[{"en":"His “helpful” comment was ironical and made everyone uncomfortable.","zh":"他那句“很有帮助”的评论其实是反讽，让大家都很尴尬。"},{"en":"It’s ironical that the fire station burned down.","zh":"消防站竟然着火烧了，这真是讽刺。"}]}],"synonyms":["ironic","sarcastic","wry"],"phonetic":"/aɪˈrɑnɪkəl/","extraExplanation":["“Ironical”和“ironic”意思几乎相同；现代英语里更常用“ironic”。","常见搭配：an ironic/ironical remark（反讽的话）、It’s ironic that...（讽刺的是……）。","注意区分：ironic（反讽/讽刺的）≠ ionic（离子的，化学用语，发音也不同）。"]}
{"word":"ionicism","summary":{"en":"Ionicism usually means a feature of Ionic Greek (or the use of one), and more rarely it can mean ionic character in chemistry.","zh":"Ionicism通常指爱奥尼亚希腊语的方言特征（或对其使用）；更少见时也可指化学中的“离子性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word, grammatical form, or style that is characteristic of Ionic Greek (the Ionic dialect), or the use of such a feature in another variety of Greek or in writing.","zh":"（古典语言学）爱奥尼亚方言（Ionic Greek）特有的词语、语法形式或文体特征；或在其他希腊语变体/写作中使用这种特征。"},"examples":[{"en":"The poet’s language includes several Ionicisms, which suggest an older or more regional style.","zh":"这位诗人的语言里包含一些“爱奥尼亚式”特征，暗示了更古老或更具地域色彩的风格。"},{"en":"Editors sometimes mark an Ionicism to explain why a form differs from standard Attic Greek.","zh":"编辑有时会标注某处为“爱奥尼亚式”，用来解释它为何不同于标准的阿提卡希腊语。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The quality of being ionic; ionic character or behavior, especially in discussion of chemical bonding.","zh":"（罕见，化学）离子性的性质；指化学键合中的离子特征或离子行为。"},"examples":[{"en":"Increasing electronegativity differences usually increases the ionicism of a bond.","zh":"电负性差通常越大，键的离子性就越强。"},{"en":"The paper compares covalency and ionicism across a series of compounds.","zh":"这篇论文比较了一系列化合物中的共价性与离子性。"}]}],"synonyms":["Ionic feature","Ionic form","dialectal feature","ionic character","ionicity"],"phonetic":"/aɪˈɑnɪˌsɪzəm/","extraExplanation":["“Ionicism”最常见于古典学/希腊语研究：Ionic（爱奥尼亚）是古希腊的一种重要方言，与Attic（阿提卡方言）关系密切；在文学史上，史诗与部分抒情传统会保留或混用一些“爱奥尼亚式”形式，因此研究者会用该词来指出文本中的方言痕迹或文体选择。","化学义项里更常见的说法是“ionic character（离子性）”或“ionicity（离子度）”；“ionicism”在现代化学教材与论文中相对少见。"]}
{"word":"ionicities","summary":{"en":"“Ionicities” means the degrees of ionic character in chemical bonds or compounds.","zh":"“ionicities”指化学键或化合物的离子性程度（离子键特征的强弱），为“ionicity”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the degree to which a chemical bond (or compound) behaves like it is made of ions rather than shared electrons; the “ionic character” of a bond","zh":"（化学键或化合物的）离子性；指其更像由离子构成而非共享电子的程度（即“离子键特征”的强弱）"},"examples":[{"en":"Chemists compare bond ionicities using electronegativity differences.","zh":"化学家会用电负性差来比较化学键的离子性。"},{"en":"The ionicity of sodium chloride is very high, so it behaves as a typical ionic compound.","zh":"氯化钠的离子性很高，因此表现为典型的离子化合物。"},{"en":"As ionicity increases, the bond tends to become more polar.","zh":"离子性越强，键通常越极性。"}]}],"synonyms":["ionic character","degree of ionicity","ionicity index"],"phonetic":"/aɪˈɑnɪsəti/","extraExplanation":["“ionicities”是“ionicity”的复数形式，常见于化学、材料科学等学术语境，用来比较不同键或不同材料的离子性高低。","离子性通常与“电负性差（electronegativity difference）”相关：差值越大，键的离子性一般越强。实际计算可能使用不同模型或指标，因此在论文里可能看到“estimated/measured ionicity”。"]}
{"word":"ionicity","summary":{"en":"Ionicity means how ionic a chemical bond is—how much electrons are transferred or shifted between atoms.","zh":"Ionicity 指化学键有多“离子化”，也就是电子在原子之间转移或偏移的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the degree to which a chemical bond has ionic character (how much electron density is shifted from one atom to another, often linked to electronegativity difference)","zh":"离子性；（化学键的）离子特征程度（指电子密度从一个原子向另一个原子偏移的程度，常与电负性差有关）"},"examples":[{"en":"A larger electronegativity difference usually means higher ionicity in the bond.","zh":"电负性差越大，化学键的离子性通常越高。"},{"en":"Chemists compare ionicity to predict whether a compound behaves more like an ionic salt or a covalent molecule.","zh":"化学家会比较离子性，以预测某种化合物更像离子盐还是共价分子。"}]}],"synonyms":["ionic character","degree of ionicity"],"phonetic":"/aɪˌɑːnɪsɪti/","extraExplanation":["“ionicity”常用于无机化学与材料科学，用来描述键的性质在“共价—离子”光谱上的位置，而不是非黑即白地把键分成两类。","常见相关指标：电负性差（ΔEN）、偶极矩、以及用实验/计算估算的“部分电荷”。不同教材或论文对“离子性百分比”的计算方法可能不同。"]}
{"word":"ionicization","summary":{"en":"“Ionicization” means ionization—the process of forming ions by gaining or losing electrons; “ionization” is the standard spelling.","zh":"“ionicization”指电离（作用），即原子/分子得失电子形成离子的过程；标准拼写通常是“ionization”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process in which an atom or molecule becomes an ion (gets an electric charge) by losing or gaining electrons.","zh":"电离（作用）：原子或分子通过失去或获得电子而变成带电的离子（获得电荷）的过程。"},"examples":[{"en":"Ionization happens when atoms lose electrons in a strong electric field.","zh":"在强电场中，原子失去电子就会发生电离。"},{"en":"The UV light from the sun causes ionization in the upper atmosphere.","zh":"太阳的紫外线会使高层大气发生电离。"}]},{"partOfSpeech":"n.","definition":{"en":"In everyday writing, a less common spelling of “ionization” (the standard form).","zh":"日常写作中较少见的拼写形式，等同于更标准的“ionization”。"},"examples":[{"en":"Most textbooks use the spelling “ionization,” not “ionicization.”","zh":"大多数教材使用“ionization”，而不是“ionicization”。"}]}],"synonyms":["ionization","ionizing","charging (in some contexts)"],"phonetic":"/ˌaɪənaɪˈzeɪʃən/","extraExplanation":["“ionicization”在英语里不算常见，更多时候被视为“ionization”的变体拼写。标准拼写是 ionization（美式和常见国际写法）。","相关词汇：ion（离子），ionic（离子的），ionize（使电离/电离）。在物理、化学、等离子体等语境中最常见。"]}
{"word":"ionicize","summary":{"en":"“Ionicize” means to (cause something to) become ionized—turned into ions; the more common word is “ionize.”","zh":"“ionicize”意为（使）电离、形成离子；更常用、更标准的说法是“ionize”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn (an atom, molecule, or substance) into ions by adding or removing electrons; to cause ion formation","zh":"（使）电离；通过得失电子使原子、分子或物质形成离子"},"examples":[{"en":"Ultraviolet light can ionicize the gas in the upper atmosphere.","zh":"紫外线会使高层大气中的气体电离。"},{"en":"The strong electric field ionicized some of the air molecules.","zh":"强电场使部分空气分子发生了电离。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become ionized; to form ions","zh":"电离；变成离子状态"},"examples":[{"en":"At high temperatures, the gas begins to ionicize.","zh":"在高温下，这种气体开始电离。"}]}],"synonyms":["ionize"],"phonetic":"/ˈaɪəˌnaɪz/","extraExplanation":["“Ionicize”在科学写作中可用，但更常见、更标准的动词是“ionize”。在美式英语里，学术与工程领域通常写作/说“ionize”（如：ionized air, ionization energy）。因此考试、论文、报告里优先用“ionize”。"]}
{"word":"ionics","summary":{"en":"Ionics refers to the science or technology of ions and their behavior, especially in materials and devices; less commonly, it can mean ionic substances/properties in general.","zh":"Ionics 指研究或应用离子行为的学科/技术（尤指材料与器件中的离子传输等）；较少情况下也可泛指离子性物质或离子特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or technology of ions (electrically charged atoms or molecules), especially their behavior in materials and devices","zh":"离子学；研究或应用离子（带电的原子或分子）在材料与器件中行为的学科/技术"},"examples":[{"en":"Ionics is important in designing better batteries and fuel cells.","zh":"离子学在设计更好的电池和燃料电池方面很重要。"},{"en":"The course covers basics of ionics and ion transport in solids.","zh":"这门课涵盖离子学基础以及离子在固体中的传输。"}]},{"partOfSpeech":"n.","definition":{"en":"ionic substances or ionic properties in general (less common)","zh":"（较少用）离子性物质；离子特性（统称）"},"examples":[{"en":"The researcher compared the ionics of different salts in solution.","zh":"研究人员比较了不同盐在溶液中的离子特性。"},{"en":"Changes in the ionics of the material affected its conductivity.","zh":"材料离子特性的变化影响了其导电性。"}]}],"synonyms":["ion science","solid-state ionics","ionic technology"],"phonetic":"/aɪˈɑnɪks/","extraExplanation":["“Ionics”多见于科研与工程语境，常与“ion transport（离子传输）”“solid-state ionics（固态离子学）”“ionic conductivity（离子电导率）”等搭配。","日常英语里更常用形容词“ionic（离子的）”来描述事物，例如“ionic bond（离子键）”“ionic liquid（离子液体）”。","学术上也有期刊名称包含“ionics”（如与固态离子学相关的期刊/会议），因此在文献中常见作学科名使用。"]}
{"word":"ionidium","summary":{"en":"Ionidium is a botanical genus name for certain tropical violet-family plants.","zh":"Ionidium 是植物学属名，指一类热带堇菜科植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the violet family (Violaceae), found mainly in tropical regions (often treated as part of the genus Hybanthus in some classifications).","zh":"一种堇菜科（Violaceae）的开花植物属，主要分布在热带地区（在某些分类体系中常被并入 Hybanthus 属）。"},"examples":[{"en":"Researchers recorded several Ionidium species in a tropical forest survey.","zh":"研究人员在热带森林调查中记录了几种 Ionidium 属植物。"},{"en":"The paper discusses whether Ionidium should be merged with Hybanthus.","zh":"这篇论文讨论 Ionidium 是否应与 Hybanthus 合并。"}]}],"synonyms":["Hybanthus (in some classifications)"],"phonetic":"/aɪˈɑnɪdiəm/","extraExplanation":["这是一个植物学属名，写作 **Ionidium** 时通常要首字母大写（拉丁学名属名的规范写法）；小写 **ionidium** 多见于非正式文本或拼写不规范的情况。","该词在日常英语中非常罕见，通常只在植物分类学、生态调查、学术论文或植物标本记录里出现。"]}
{"word":"ionisable","summary":{"en":"Ionisable means capable of becoming an ion under certain conditions (often depending on pH).","zh":"ionisable 指“可电离的”，即在特定条件下（常与 pH 有关）能够变成离子的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to become an ion (gain or lose electrons, or split into charged parts) under certain conditions.","zh":"可电离的；在特定条件下能够变成离子（通过得失电子或裂解成带电部分）。"},"examples":[{"en":"Many ionisable drugs are absorbed differently depending on the pH of the stomach and intestine.","zh":"许多可电离的药物会因胃和肠道的酸碱度（pH）不同而呈现不同的吸收方式。"},{"en":"This ionisable group becomes negatively charged at higher pH.","zh":"这个可电离基团在较高的 pH 下会带负电。"},{"en":"Ionisable salts dissolve in water and form charged particles.","zh":"可电离的盐类溶于水后会形成带电粒子。"}]}],"synonyms":["ionizable","dissociable","capable of ionization"],"phonetic":"/ˈaɪənaɪzəbəl/","extraExplanation":["“ionisable”是英式拼写；美式更常写作“ionizable”。两者意思相同。","常用于化学、药学与生物化学语境：物质是否“可电离”往往与溶液的pH有关，从而影响溶解度、穿膜能力与药物吸收。","不要与“ionized（已电离的）”混淆：ionisable强调“能够/有可能电离”，ionized强调“已经电离”。"]}
{"word":"ionisation","summary":{"en":"Ionisation is the process (or level) of forming ions by adding or removing electrons.","zh":"Ionisation 指电离：通过得失电子形成离子的过程，或某环境中的电离程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making an atom or molecule into an ion (a particle with an electric charge), usually by removing or adding electrons","zh":"电离（作用）：使原子或分子变成带电的离子（通常通过失去或获得电子）的过程"},"examples":[{"en":"Ionisation happens when high-energy radiation knocks electrons off atoms.","zh":"当高能辐射把电子从原子上击落时，就会发生电离。"},{"en":"The flame causes ionisation of the gas, allowing it to conduct electricity.","zh":"火焰会使气体电离，从而让它能够导电。"}]},{"partOfSpeech":"n.","definition":{"en":"the degree or amount of ions formed in a substance or environment","zh":"电离程度：某种物质或环境中形成离子的数量或强弱"},"examples":[{"en":"Scientists measured the ionisation level in the upper atmosphere.","zh":"科学家测量了高层大气中的电离水平。"},{"en":"Higher temperatures can increase ionisation in some gases.","zh":"在某些气体中，更高的温度会提高电离程度。"}]}],"synonyms":["ionization","charging","ion formation"],"phonetic":"/ˌaɪənəˈzeɪʃən/","extraExplanation":["“ionisation”是英式拼写；美式英语更常写作“ionization”。两者意思完全相同。","常见搭配：ionisation energy（电离能）、ionisation chamber（电离室）、ionisation level（电离水平）。","与“radiation（辐射）”相关的语境中，“ionisation”常用来解释辐射为何会对生物组织造成影响，因为它会改变分子结构。"]}
{"word":"ionise","summary":{"en":"Ionise means to make atoms or molecules become ions by adding or removing electrons (UK spelling of ionize).","zh":"ionise 指使原子或分子通过得失电子而变成离子（“ionize”的英式拼写）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(UK spelling) To turn an atom or molecule into an ion by giving it an electric charge (by removing or adding electrons).","zh":"（英式拼写）使（原子或分子）电离；通过失去或得到电子而带上电荷，变成离子。"},"examples":[{"en":"High-energy radiation can ionise the air.","zh":"高能辐射会使空气电离。"},{"en":"In a plasma, many particles are ionised.","zh":"在等离子体中，许多粒子是电离的。"}]}],"synonyms":["ionize","charge","electrify"],"phonetic":"/ˈaɪəˌnaɪz/","extraExplanation":["“ionise”是英式拼写，美式更常写作“ionize”。两者意思完全相同。","常见搭配：ionise the gas/air（使气体/空气电离）；ionised particles（电离粒子）；ionisation energy（电离能）。","在科学语境中常见于物理、化学与医学（如放射线、电离辐射 ionising radiation）。日常英语中不太常用。"]}
{"word":"ionised","summary":{"en":"Ionised means made into ions (electrically charged particles), usually by energy like heat or radiation; it can also describe water treated to change/remove ions in some contexts.","zh":"Ionised 指“被电离的”，即变成带电的离子；在某些语境中也可指水等经过处理以改变或减少离子含量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having been turned into ions (atoms or molecules with an electric charge) by gaining or losing electrons","zh":"被电离的；已变成离子（原子或分子因得失电子而带电）"},"examples":[{"en":"The gas becomes ionised at very high temperatures.","zh":"气体在非常高的温度下会被电离。"},{"en":"Ionised air can conduct electricity better than normal air.","zh":"电离空气比普通空气更能导电。"}]},{"partOfSpeech":"adj.","definition":{"en":"(chemistry/medicine) treated to remove ions, so that mineral salts are reduced or removed (e.g., ionised water as a product name in some contexts)","zh":"（化学/医学）经处理以减少或去除离子，使矿物盐含量降低（在某些语境中也用于产品名，如“离子化水/电离水”）"},"examples":[{"en":"Some labs use ionised water for cleaning glassware.","zh":"一些实验室使用离子化水来清洗玻璃器皿。"}]}],"synonyms":["ionized","charged","electrified"],"phonetic":"/ˈaɪəˌnaɪzd/","extraExplanation":["英式拼写常见为 ionised；美式更常写 ionized。读音相同。","在科学语境里，ionised 通常强调“被电离而带电”；在日常产品宣传里，“ionised water/ionized water”有时被用得比较宽泛，实际含义可能接近“去离子水（deionized water）”，具体要看上下文与技术说明。"]}
{"word":"ioniser","summary":{"en":"An ioniser is a device that creates ions, commonly used in air purifiers or scientific instruments.","zh":"ioniser 指“电离器/离子发生器”，能产生离子，常见于空气净化设备或科研仪器中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that produces ions (electrically charged particles), often used to clean air, reduce static electricity, or prepare samples in laboratories","zh":"电离器；离子发生器：一种产生离子（带电粒子）的装置，常用于空气净化、消除静电或实验室样品处理"},"examples":[{"en":"The air purifier has an ioniser to help remove smoke and dust from the air.","zh":"这台空气净化器带有电离器，有助于去除空气中的烟雾和灰尘。"},{"en":"In the lab, the technician checked the ioniser before running the mass spectrometer.","zh":"在实验室里，技术员在运行质谱仪之前检查了电离器。"}]}],"synonyms":["ionizer","ion generator"],"phonetic":"/ˈaɪəˌnaɪzər/","extraExplanation":["“ioniser”是英式拼写；美式常写作“ionizer”。两者意思相同。","在空气净化语境中，ioniser通常通过释放负离子让微粒更容易聚集并被过滤或沉降；有些设备也可能产生少量臭氧（ozone），购买或使用时可留意说明与安全标准。"]}
{"word":"ionises","summary":{"en":"“Ionises” means “turns into ions” (3rd person singular of ionise/ionize).","zh":"“ionises”意为“使电离/变成离子”，是ionise/ionize的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(3rd person singular) to change atoms or molecules into ions by gaining or losing electrons (often by heat, electricity, chemicals, or radiation).","zh":"（第三人称单数）使原子或分子电离：通过失去或获得电子变成离子（常由高温、电、化学作用或辐射引起）。"},"examples":[{"en":"Strong UV light ionises the air, which can help form a visible plasma.","zh":"强紫外线会使空气电离，从而有助于形成可见的等离子体。"},{"en":"In a battery, the solution ionises and allows charged particles to move.","zh":"在电池中，溶液会电离，使带电粒子能够移动。"}]},{"partOfSpeech":"v.","definition":{"en":"to expose something to ionizing radiation so that it becomes ionized or produces ions.","zh":"使接触电离辐射，从而使其电离或产生离子。"},"examples":[{"en":"Doctors try to limit how much tissue ionises during an X-ray procedure.","zh":"医生会尽量限制在X光检查过程中被电离的组织量。"}]}],"synonyms":["ionizes","charges","electrifies","forms ions"],"phonetic":"/ˈaɪəˌnaɪzɪz/","extraExplanation":["“ionises”是英式拼写；美式更常写作“ionizes”。两者意思相同。","这个词多用于科学语境（化学、物理、生物、医学成像等）。日常英语里更常见名词“ion”或形容词“ionized / ionised”。"]}
{"word":"ionising","summary":{"en":"Ionising means causing ion formation (often said of radiation) and is the British spelling of ionizing.","zh":"ionising 指“使电离/产生离子”（常说电离辐射），是 ionizing 的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing atoms or molecules to become ions by removing or adding electrons (often describing radiation or a process in physics/chemistry).","zh":"使原子或分子变成离子（通过失去或获得电子；常用于描述辐射或物理/化学过程）。"},"examples":[{"en":"Ionising radiation can damage living cells.","zh":"电离辐射可能会损伤活细胞。"},{"en":"Scientists used an electric field to create an ionising effect in the gas.","zh":"科学家用电场在气体中产生电离效应。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “ionise” (British spelling): the act of making something form ions.","zh":"“ionise”（英式拼写）的现在分词：正在使某物电离。"},"examples":[{"en":"The device is ionising the air to reduce static electricity.","zh":"这个装置正在使空气电离以减少静电。"},{"en":"High-energy particles are ionising molecules along their path.","zh":"高能粒子沿着路径正在使分子电离。"}]}],"synonyms":["ionizing","charging (in some contexts)","ion-forming"],"phonetic":"/ˈaɪəˌnaɪzɪŋ/","extraExplanation":["“ionising”是英式拼写；美式更常写作“ionizing”。在科学与公共健康语境中，最常见的搭配是“ionising radiation（电离辐射）”，指能量足以把电子从原子/分子中打出来的辐射（如X射线、γ射线等），与“non-ionising（非电离）”相对。"]}
{"word":"ionism","summary":{"en":"Ionism is an uncommon term in chemistry meaning ionization or, historically, the ionic theory of electrolytes.","zh":"Ionism 是一个不常见的化学用词，指“离子化”，或在历史语境中指电解质的“离子理论”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The formation or presence of ions; ionization.","zh":"（化学）离子化；离子的形成或存在。"},"examples":[{"en":"Salt dissolves in water through ionism, producing positive and negative ions.","zh":"盐溶于水时会发生离子化，产生正离子和负离子。"},{"en":"Heat and radiation can increase ionism in a gas.","zh":"热和辐射会增加气体中的离子化程度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry, historical) The theory that electrolytes in solution exist largely as ions (associated with Arrhenius’s ionic theory).","zh":"（化学，历史用法）关于电解质在溶液中主要以离子形式存在的理论（常与阿伦尼乌斯的离子理论相关）。"},"examples":[{"en":"Early studies of conductivity supported ionism in salt solutions.","zh":"早期的电导研究支持盐溶液中存在“离子理论/离子学说”。"},{"en":"In modern textbooks, this idea is usually explained under ionic theory rather than ionism.","zh":"在现代教材中，这个观点通常以“离子理论”来讲，而不太用 ionism 这个词。"}]}],"synonyms":["ionization","ionic theory","electrolytic dissociation"],"phonetic":"/ˈaɪəˌnɪzəm/","extraExplanation":["“ionism”在日常英语里非常少见，更多见于较老的化学文献；现代更常用的词是“ionization（离子化）”或“ionic theory（离子理论）”。","相关背景：阿伦尼乌斯（Svante Arrhenius）提出电解质在水溶液中解离成离子的观点，用来解释溶液导电等现象。"]}
{"word":"ionist","summary":{"en":"Ionist: a rare word meaning someone who studies or works with ions.","zh":"ionist：较少见，指研究或从事离子相关工作的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies or works with ions (electrically charged particles), especially in chemistry or physics; an ion specialist (rare).","zh":"研究或从事“离子”（带电粒子）相关工作的人，尤指化学或物理领域的离子研究者（较少见用法）。"},"examples":[{"en":"The ionist explained how ions move through the solution during electrolysis.","zh":"这位离子研究者解释了电解过程中离子如何在溶液中移动。"},{"en":"As an ionist, she focuses on ion transport in batteries.","zh":"作为研究离子的专家，她主要研究电池中的离子传输。"}]}],"synonyms":["ion researcher","electrochemist","chemist","physicist"],"phonetic":"/ˈaɪəˌnɪst/","extraExplanation":["“ionist”在现代英语里非常少见，通常人们会直接说“chemist / physicist / electrochemist（化学家/物理学家/电化学家）”，或用更具体的表达如“researcher in ion transport（离子传输研究者）”。","如果你本来想输入的是“Zionist（犹太复国主义者/支持以色列建国或相关政治理念的人）”，那是另一个完全不同的词：Zionist /ˈzaɪənɪst/。如果你告诉我你想表达的语境（化学还是政治/宗教），我可以帮你确认。"]}
{"word":"ionium","summary":{"en":"Ionium is an old name for the radioactive isotope thorium-230 (Th-230).","zh":"Ionium 是放射性同位素钍-230（Th-230）的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A radioactive substance later identified as the isotope thorium-230, found in uranium ores and produced in the decay of uranium.","zh":"（历史用语）一种放射性物质，后来被确认是钍-230同位素；存在于铀矿中，并在铀的衰变过程中生成。"},"examples":[{"en":"Early researchers called the mysterious radioactive material in uranium ore “ionium,” before it was identified as thorium-230.","zh":"早期研究者在确认其为钍-230之前，把铀矿中那种神秘的放射性物质称为“ionium”。"},{"en":"In modern chemistry and physics, “ionium” is rarely used; scientists usually write Th-230 or thorium-230.","zh":"在现代化学与物理中，“ionium”很少使用；科学家通常写作 Th-230 或“钍-230”。"}]}],"synonyms":["thorium-230","Th-230"],"phonetic":"/aɪˈoʊniəm/","extraExplanation":["“Ionium”是20世纪初放射化学发展时期的命名：当时一些放射性产物还未被清楚归入某个元素或同位素，于是会先用临时名称（如ionium）标记。后来随着同位素概念与测定技术成熟，ionium被确认属于钍（thorium）的一个同位素：钍-230。","钍-230常出现在“铀系衰变链”（uranium decay series）中：它由铀-234等衰变产生，并继续衰变为镭-226等产物。"]}
{"word":"ioniums","summary":{"en":"“Ioniums” is the plural of “ionium,” an old term for the radioactive isotope thorium-230 (Th-230).","zh":"“Ioniums”是“ionium”的复数，是钍-230（Th-230）这一放射性同位素的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of ionium) a historical name for the radioactive isotope thorium-230 (Th-230).","zh":"（ionium 的复数）一种历史名称，指放射性同位素钍-230（Th-230）。"},"examples":[{"en":"Early papers on radioactivity sometimes mention ioniums when discussing decay series.","zh":"早期的放射性研究论文在讨论衰变系列时有时会提到 ioniums。"},{"en":"Today, scientists usually write “thorium-230” instead of “ionium.”","zh":"如今，科学家通常写“thorium-230（钍-230）”，而不是“ionium”。"}]}],"synonyms":["thorium-230","Th-230"],"phonetic":"/aɪˈoʊniəmz/","extraExplanation":["“Ionium”是20世纪早期放射化学中的旧称，后来被确认为钍的一种同位素（Th-230），因此现代学术与教材中多不再使用该名称。","Th-230常出现在铀系（uranium decay series）的衰变链里；在地质年代测定（如铀系定年）等领域会见到它的现代写法。"]}
{"word":"ionizable","summary":{"en":"Ionizable means “able to form ions (become charged), often in solution,” a term common in chemistry and pharmacology.","zh":"ionizable 指“能电离、能形成离子（带电）”，常用于化学与药学等领域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to form ions (charged particles) by gaining or losing electrons, often in solution (like water).","zh":"可电离的；能形成离子（带电粒子）的，通常指在溶液（如水）中通过得失电子而产生离子。"},"examples":[{"en":"Salt is ionizable in water, so it conducts electricity when dissolved.","zh":"盐在水中是可电离的，所以溶解后能导电。"},{"en":"Whether a drug is ionizable affects how easily it passes through cell membranes.","zh":"药物是否可电离会影响它穿过细胞膜的难易程度。"}]}],"synonyms":["ion-forming","capable of ionization","dissociable"],"phonetic":"/ˈaɪəˌnaɪzəbəl/","extraExplanation":["“ionizable”常见于化学、药学与生物化学语境，尤其在讨论酸/碱性质与pH时：分子在不同pH下会有不同程度的电离，进而影响溶解度、吸收与反应性。","常与“ionizable group（可电离基团）”搭配，如—COOH（羧基）、—NH2（氨基）等。"]}
{"word":"ionization","summary":{"en":"Ionization is the process (or level) of forming ions when atoms or molecules gain or lose electrons.","zh":"Ionization 指原子或分子通过得失电子形成离子的过程，或指产生离子的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which an atom or molecule becomes electrically charged by losing or gaining electrons (forming ions)","zh":"电离；离子化：原子或分子通过失去或获得电子而带电（形成离子）的过程"},"examples":[{"en":"Ionization happens when an atom loses an electron and becomes a positive ion.","zh":"当原子失去一个电子并变成带正电的离子时，就发生了电离。"},{"en":"High-energy radiation can cause ionization in the air.","zh":"高能辐射会使空气发生电离。"}]},{"partOfSpeech":"n.","definition":{"en":"the degree or amount of ions produced in a substance or system","zh":"电离程度；离子化程度：在某种物质或系统中产生离子的数量或水平"},"examples":[{"en":"The sensor measures the ionization level inside the chamber.","zh":"该传感器测量腔室内的电离水平。"},{"en":"Changes in temperature can affect the ionization of a gas.","zh":"温度变化会影响气体的电离程度。"}]}],"synonyms":["charging","formation of ions"],"phonetic":"/ˌaɪənəˈzeɪʃən/","extraExplanation":["“ionization”常见于物理、化学与医学语境：例如“ionization energy（电离能）”指把电子从原子/分子上移走所需的能量；“ionizing radiation（电离辐射）”如X射线、伽马射线等，能把物质电离，因此在医疗影像中有用途，但也需要注意辐射防护。"]}
{"word":"ionizations","summary":{"en":"Ionizations means multiple processes or events in which atoms or molecules become charged ions.","zh":"Ionizations 指多个“电离”过程或电离事件，即原子或分子变成带电离子的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the processes of making atoms or molecules into ions (charged particles) by adding or removing electrons","zh":"电离：通过失去或获得电子，使原子或分子变成带电离子（带电粒子）的过程"},"examples":[{"en":"Ionizations happen when high-energy radiation knocks electrons off atoms.","zh":"当高能辐射把电子从原子上击出时，就会发生电离。"},{"en":"Scientists measured the ionizations in the air after the storm.","zh":"科学家测量了暴风雨后空气中的电离情况。"}]},{"partOfSpeech":"n.","definition":{"en":"separate events or amounts of ionizing that occur in a system (the plural form of “ionization”)","zh":"（复数）多次/多种电离事件或电离量（“ionization”的复数形式）"},"examples":[{"en":"The detector counts ionizations to estimate the radiation level.","zh":"探测器通过计数电离事件来估算辐射水平。"},{"en":"Different gases produce different ionizations under the same voltage.","zh":"在相同电压下，不同气体会产生不同的电离情况。"}]}],"synonyms":["ionization events","charging processes","ionizing processes"],"phonetic":"/ˌaɪənəˈzeɪʃənz/","extraExplanation":["“ionizations”常见于物理、化学与医学成像/辐射防护语境。日常英语里更常用单数“ionization”来泛指“电离这一现象/过程”；用复数时，往往强调“多次电离事件”或“不同条件下的电离结果”。","相关概念：ion（离子）、ionize（使电离）、ionizing radiation（电离辐射）、ionization energy（电离能）。"]}
{"word":"ionize","summary":{"en":"Ionize means to give something an electric charge so it becomes an ion, or to become an ion.","zh":"ionize 指“使……电离/使成为离子”，也可指“（自身）电离/变成离子”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To turn an atom or molecule into an ion by giving it an electric charge (by removing or adding electrons).","zh":"（化学）使原子或分子带电，变成离子（通过失去或得到电子）。"},"examples":[{"en":"High-energy radiation can ionize the air around it.","zh":"高能辐射会使周围的空气电离。"},{"en":"The gas is ionized inside the tube to produce light.","zh":"气体在管内被电离，从而产生光。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become ionized (to form ions).","zh":"电离；变成离子。"},"examples":[{"en":"At very high temperatures, some gases ionize easily.","zh":"在很高的温度下，一些气体很容易电离。"},{"en":"As the plasma cools, fewer particles ionize.","zh":"当等离子体冷却时，电离的粒子会减少。"}]}],"synonyms":["charge","electrify","ionize (become charged)"],"phonetic":"/ˈaɪəˌnaɪz/","extraExplanation":["“ionize”常出现在物理/化学与工程语境，如等离子体（plasma）、电离层（ionosphere）、电离辐射（ionizing radiation）。在日常生活中常见于“ionizing radiation（电离辐射）”与“ionizer（离子发生器）”。","词形提示：ion（离子）+ -ize（使……化）→ ionize（使……变成离子/电离）；名词 ionization（电离），形容词 ionized（已电离的）。"]}
{"word":"ionized","summary":{"en":"Ionized means made into ions (electrically charged) by gaining or losing electrons; it’s also the past form of “ionize.”","zh":"ionized 指“被电离的/已电离的”，即因得失电子而变成离子并带电；也可作 ionize 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changed into ions by gaining or losing electrons (often because of heat, radiation, or an electric current).","zh":"被电离的；变成离子状态的（通常因受热、辐射或电流而得失电子）。"},"examples":[{"en":"The gas becomes ionized at very high temperatures.","zh":"气体在非常高的温度下会被电离。"},{"en":"Ionized air can carry an electric charge.","zh":"被电离的空气可以携带电荷。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a molecule, atom, or substance) converted into ions; made electrically charged.","zh":"（指分子、原子或物质）转化为离子；带电的。"},"examples":[{"en":"The solution contains ionized calcium.","zh":"这种溶液含有离子化的钙。"},{"en":"Some medicines work only after they become ionized in the stomach.","zh":"有些药物只有在胃里离子化后才会起作用。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “ionize”: to change into ions by adding/removing electrons.","zh":"“ionize”的过去式/过去分词：使电离，使变成离子（通过得失电子）。"},"examples":[{"en":"The radiation ionized the atoms in the chamber.","zh":"辐射使腔室里的原子发生了电离。"},{"en":"A strong electric field can ionize nearby molecules.","zh":"强电场可以使附近的分子电离。"}]}],"synonyms":["electrically charged","charged","ionized (form)"],"phonetic":"/ˈaɪəˌnaɪzd/","extraExplanation":["“ionized”常见于科学与医学语境：如ionized air（电离空气）、ionized calcium（离子钙，医学检验指标）。日常英语里更常见的是“charged（带电的）”或“electrified（通电/带电的）”，但在讲原子/分子层面的带电变化时通常用“ionized”。","词形提示：ion（离子）+ -ize（使……化）→ ionize（使电离）→ ionized（被电离的/已电离的）。"]}
{"word":"ionizer","summary":{"en":"An ionizer is a device that creates ions, commonly used in air cleaners or to reduce static.","zh":"ionizer 指“电离器/离子发生器”，用于产生离子，常见于空气净化或消除静电。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that produces ions (charged particles), often used to clean air, reduce static electricity, or help certain machines work.","zh":"电离器；离子发生器：一种产生离子（带电粒子）的装置，常用于空气净化、减少静电或辅助某些设备运行。"},"examples":[{"en":"We bought an air purifier with an ionizer to help reduce dust in the bedroom.","zh":"我们买了一台带电离器的空气净化器，想减少卧室里的灰尘。"},{"en":"The ionizer can help remove static from the plastic film during packaging.","zh":"在包装过程中，电离器可以帮助去除塑料膜上的静电。"}]}],"synonyms":["ion generator","air ionizer","static eliminator"],"phonetic":"/ˈaɪəˌnaɪzər/","extraExplanation":["在家电广告里，ionizer 常指“负离子发生器”。有些产品会同时产生少量臭氧（ozone），对呼吸道敏感的人应注意使用环境与产品说明。","词根理解：ion（离子）+ -ize（使……化）+ -er（……者/器）。理解构词有助于记忆相关词：ion / ionic / ionize / ionization。"]}
{"word":"ionizers","summary":{"en":"Ionizers are devices that produce ions, commonly found in air-cleaning equipment and some scientific/industrial settings.","zh":"Ionizers 指“电离器”，能产生离子，常见于空气清洁设备以及科研/工业场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Devices that make ions (electrically charged particles) in the air or another substance, often used to change air quality or support certain processes.","zh":"电离器；使空气或其他物质产生离子（带电粒子）的装置，常用于改善空气状况或辅助某些工艺。"},"examples":[{"en":"Some air purifiers include ionizers to charge particles so they clump together and are easier to filter.","zh":"有些空气净化器带电离功能，让微粒带电并凝聚，从而更容易被过滤。"},{"en":"In a lab, ionizers can be used to help control static electricity on sensitive equipment.","zh":"在实验室里，电离器可用于帮助控制精密设备上的静电。"}]}],"synonyms":["ion generator","air ionizer"],"phonetic":"/ˈaɪəˌnaɪzərz/","extraExplanation":["“Ionizer”来自“ion（离子）+ -ize（使……化）+ -er（……的器具/人）”。日常语境里最常见的是“空气电离器/带电离功能的空气净化器”。","与“air purifier（空气净化器）”不同，ionizer 指“产生离子”的部件或设备；它不一定等同于“过滤式净化”。有些人会关注其是否会产生少量臭氧（ozone），购买或使用时可查看产品说明与安全标准。"]}
{"word":"ionizes","summary":{"en":"Ionizes means “makes something become ions (electrically charged particles),” or “becomes ions.”","zh":"ionizes 表示“使……电离变成离子（带电粒子）”，也可表示“发生电离”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to change an atom or molecule into an ion by giving it an electric charge (usually by removing or adding electrons)","zh":"使原子或分子带电，变成离子（通常通过失去或得到电子）"},"examples":[{"en":"High-energy radiation ionizes the air around it.","zh":"高能辐射会使周围空气电离。"},{"en":"This device ionizes gas so it can conduct electricity.","zh":"这个装置使气体电离，从而能够导电。"}]},{"partOfSpeech":"v.","definition":{"en":"to become ionized; to turn into ions","zh":"发生电离；变成离子"},"examples":[{"en":"In a strong electric field, some molecules ionizes more easily.","zh":"在强电场中，有些分子更容易发生电离。"},{"en":"At very high temperatures, the gas ionizes quickly.","zh":"在很高温度下，气体会快速电离。"}]}],"synonyms":["charges","electrifies","ionifies"],"phonetic":"/ˈaɪəˌnaɪzɪz/","extraExplanation":["“ionize”的词形：原形 ionize，第三人称单数 ionizes，过去式/过去分词 ionized，现在分词 ionizing。","在科学写作里常见搭配：ionize the air/gas（使空气/气体电离）、ionizing radiation（电离辐射）、ionization energy（电离能）。","日常语境中有时会看到“ionize the air（离子化空气）”用于空气净化或美容仪广告，但其实际效果与安全性需要根据具体产品与科学证据判断。"]}
{"word":"ionizing","summary":{"en":"Ionizing means able to create ions (charged particles), especially describing high-energy radiation like X-rays.","zh":"ionizing 指“能使物质电离、产生离子（带电粒子）的”，常用来形容 X 光等高能电离辐射。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing atoms or molecules to form ions (charged particles) by removing or adding electrons, usually because of strong energy such as radiation.","zh":"使原子或分子形成离子（带电粒子）的；通常指在强能量（如辐射）作用下通过失去或得到电子而电离的。"},"examples":[{"en":"Ionizing radiation can damage living cells if exposure is too high.","zh":"电离辐射如果暴露量过高，可能会损伤活细胞。"},{"en":"X-rays are a type of ionizing radiation used in medical imaging.","zh":"X 光是一种用于医学成像的电离辐射。"}]}],"synonyms":["ion-forming","ion-producing"],"phonetic":"/ˈaɪəˌnaɪzɪŋ/","extraExplanation":["“ionizing”常见于科学与医学语境：ionizing radiation（电离辐射）、ionizing energy（电离能/电离能量）、ionizing dose（电离剂量）。与之相对的是non-ionizing radiation（非电离辐射，如可见光、无线电波），通常能量不足以把电子从原子中“打出来”。","词形关系：ion（离子）→ ionize（使电离，动词）→ ionizing（现在分词/形容词）。在学术写作里，ionizing常作定语修饰名词，如ionizing radiation。"]}
{"word":"ionogen","summary":{"en":"An ionogen is something that forms ions, especially in solution.","zh":"ionogen 指能形成离子（尤其在溶液中会电离）的物质或分子中的电离基。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often a functional group in a molecule) that can produce ions, especially in solution; an ion-forming compound or group","zh":"能产生离子的物质（常指分子中的官能团），尤指在溶液中能电离的成分；电离基／成离子物质"},"examples":[{"en":"In water, the ionogen part of the molecule can release ions and increase conductivity.","zh":"在水中，分子里的电离基部分可以释放离子并提高导电性。"},{"en":"Researchers tested different ionogens to improve the drug’s solubility.","zh":"研究人员测试了不同的电离基，以提高该药物的溶解度。"}]}],"synonyms":["ion-forming substance","electrolyte (related)","ionizable group (related)"],"phonetic":"/aɪˈɑːnədʒən/","extraExplanation":["“ionogen”主要出现在化学、材料与药剂学语境里，常用来强调“能电离/能生成离子”的结构或添加剂（例如某些带酸性/碱性基团的分子片段）。在一般英语里不算常用词，更常见的相关词是“ionize（电离）”“electrolyte（电解质）”以及“ionic（离子的）”。"]}
{"word":"ionogenic","summary":{"en":"Ionogenic means “ion-producing” or “able to form ions,” often used in chemistry and pharmacology.","zh":"ionogenic 指“产离子/可电离的”，常用于化学与药学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing ions, or causing substances to form ions (especially in water or in biological systems).","zh":"产生成离子或促使物质形成离子（尤指在水溶液或生物体系中）。"},"examples":[{"en":"Some ionogenic compounds dissociate in water and release charged particles.","zh":"一些产离子化合物在水中会电离并释放带电粒子。"},{"en":"The drug’s ionogenic groups can affect how easily it crosses cell membranes.","zh":"该药物的产离子基团会影响它穿过细胞膜的难易程度。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or characteristic of ion formation or ion-producing reactions.","zh":"与离子形成或产离子反应有关的；具有产离子特征的。"},"examples":[{"en":"Researchers compared ionogenic and non-ionogenic surfactants in the formulation.","zh":"研究人员比较了该配方中产离子型与非离子型表面活性剂。"},{"en":"Ionogenic behavior often changes with pH.","zh":"产离子行为常随 pH 值变化而改变。"}]}],"synonyms":["ion-forming","ion-producing","ionizable"],"phonetic":"/ˌaɪ.ə.noʊˈdʒɛn.ɪk/","extraExplanation":["“ionogenic”常见于化学、材料与药学文献中，用来强调“会产生离子/可电离”的性质。与“ionic（离子的）”相比，ionogenic更强调“生成离子”的过程或能力。","常见搭配：ionogenic groups（产离子基团）、ionogenic surfactant（产离子型表面活性剂）、ionogenic polymer（可电离聚合物）。"]}
{"word":"ionogens","summary":{"en":"“Ionogens” are substances that form ions, often used in chemistry similarly to “electrolytes.”","zh":"“Ionogens”指能产生离子的物质，在化学中常与“electrolytes（电解质）”用法相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances that produce ions (charged particles) when dissolved in a solvent or when melted; ion-forming compounds (often similar in meaning to electrolytes).","zh":"能在溶剂中溶解或熔融时产生离子（带电粒子）的物质；成离子化合物（常与“电解质”含义接近）。"},"examples":[{"en":"Acids, bases, and salts are common ionogens in water.","zh":"酸、碱和盐是在水中常见的成离子物质。"},{"en":"The solution conducts electricity because it contains ionogens that dissociate into ions.","zh":"该溶液能导电，是因为其中含有会解离成离子的成离子物质。"}]}],"synonyms":["electrolytes","ion-formers","ionizing agents"],"phonetic":"/aɪˈɑnədʒən/","extraExplanation":["“ionogen”在化学语境中较偏学术、较少见；日常或基础化学更常用“electrolyte（电解质）”。但两者并非永远完全等同：有些场合“ionogen”更强调“能生成离子/促成离子形成”这一性质。","词形：ionogens 是复数；单数为 ionogen。"]}
{"word":"ionomer","summary":{"en":"An ionomer is a polymer that contains charged (ionic) groups, giving it special strength, sealing, and ion-transport properties.","zh":"ionomer 指含有带电（离子）基团的聚合物，因此常具有更好的强度、密封性或离子传导等特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of polymer (plastic) that contains ionic (charged) groups, which can change the material’s strength, flexibility, and ability to conduct ions","zh":"一种含有离子（带电）基团的聚合物（塑料）；这些带电基团会影响材料的强度、柔韧性以及离子传导等性质"},"examples":[{"en":"Some golf ball covers are made from an ionomer to improve durability.","zh":"一些高尔夫球的外皮会用离聚物（ionomer）制作，以提高耐用性。"},{"en":"The engineer chose an ionomer film because it seals well and resists punctures.","zh":"工程师选择了离聚物薄膜，因为它密封性好，而且抗穿刺。"},{"en":"In certain batteries, ionomer materials help move ions through the device.","zh":"在某些电池中，离聚物材料有助于让离子在器件中移动。"}]}],"synonyms":["ionic polymer","ion-containing polymer"],"phonetic":"/ˌaɪəˈnoʊmər/","extraExplanation":["词源提示：ionomer = ion（离子）+ -mer（“单元/聚合物”相关后缀，见 polymer）。意思直观：带“离子特性”的聚合物。","常见应用语境：包装材料的热封层、运动器材（如高尔夫球外皮）、以及电化学领域（某些膜/粘结材料）。在材料品牌或产品说明中也可能看到该词。"]}
{"word":"ionomers","summary":{"en":"Ionomers are polymers that contain ionic groups; these charged sites can make the material tougher and more damage-resistant.","zh":"Ionomers（离聚物）是含离子基团的聚合物；这些带电位点能增强材料的韧性与抗损伤能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ionomer: a polymer (plastic-like material) that contains ionic (charged) groups, which can form strong links between chains and improve toughness, adhesion, or resistance to damage.","zh":"ionomer 的复数：一种含有离子（带电）基团的聚合物（类似塑料的材料）。这些离子基团可在分子链之间形成较强的“离子交联”，常用来提高韧性、粘附性或抗损伤能力。"},"examples":[{"en":"Ionomers are often used in packaging films because they can be tough and resistant to punctures.","zh":"Ionomers 常用于包装薄膜，因为它们结实且不易被刺穿。"},{"en":"Some golf ball covers are made from ionomers to improve durability.","zh":"有些高尔夫球外壳使用 ionomers 制作，以提高耐用性。"},{"en":"The researchers compared ionomers with ordinary polyethylene in the stress test.","zh":"研究人员在应力测试中将 ionomers 与普通聚乙烯进行了比较。"}]}],"synonyms":["ionomers (plural)","ionomer materials","ionically modified polymers"],"phonetic":"/ˈaɪəˌnoʊmɚ/","extraExplanation":["“ionomer（离聚物）”通常指在聚合物主链上只有一小部分（常见是几％）带有可离子化的基团（如羧酸盐）。这些离子基团会在材料内部聚集成“离子团簇”，像可逆的物理交联点一样，让材料既保持可加工性，又更耐冲击、更耐撕裂。","常见应用包括：包装薄膜、热封层、粘结/涂层材料、以及某些运动器材（如高尔夫球外层）。在文献或材料工程语境中，ionomers 往往与“surlyn（杜邦的某类离聚物商标）”一起出现。"]}
{"word":"ionone","summary":{"en":"“ionone” isn’t a recognized English word; please provide context or confirm the intended spelling.","zh":"“ionone”不是常见英文词；请提供上下文或确认你想输入的正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username/product name, or a misspelling of a similar-looking word (for example, “ion,” “in one,” or “I/O: none”).","zh":"不是标准英文单词。它可能是拼写错误、用户名/产品名，或与某个相似词混淆（例如“ion（离子）”、“in one（合为一体）”或“I/O: none（无输入/输出）”。"},"examples":[{"en":"I couldn’t find “ionone” in a dictionary—can you share the sentence you saw it in?","zh":"我在词典里找不到“ionone”——你能提供你看到它的句子吗？"},{"en":"Did you mean “ion” (a charged particle) or “in one” (combined)?","zh":"你是想说“ion（离子）”还是“in one（合为一体/一起）”？"}]}],"extraExplanation":["“ionone”更像是把两个部分连在一起的拼写（例如 ion + one / in + one），或是特定领域的代号/品牌名。为了给出准确释义，请把它出现的上下文（完整句子、领域：化学/编程/游戏等）发我，或告诉我你想表达的中文意思。"]}
{"word":"ionones","summary":{"en":"Ionones are aromatic compounds used in perfumery and flavoring, known for violet-like floral notes.","zh":"Ionones 是用于香水与香精的芳香化合物，以类似紫罗兰的花香调著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ionones are fragrant chemical compounds used in perfumes and flavors, often described as having a violet-like, woody, or fruity smell (plural of ionone).","zh":"Ionones（紫罗兰酮类）是一类带香味的化学化合物，常用于香水与香精（食用香料）中，气味常被形容为紫罗兰般、木质或果香调。"},"examples":[{"en":"Many “violet” perfumes get their signature note from ionones.","zh":"许多“紫罗兰”香水的标志性香调来自 ionones。"},{"en":"Ionones are used in flavoring to add a soft floral nuance.","zh":"Ionones 也用于调味香精中，带来柔和的花香细节。"}]}],"synonyms":["violet note compounds","fragrance ingredients","aroma chemicals"],"phonetic":"/aɪˈoʊ.noʊnz/","extraExplanation":["ionone（单数）常见于香精香料领域，尤其与“紫罗兰香调”相关；常见类别包括 α-ionone 与 β-ionone，不同异构体会带来细微但可辨的气味差异。","在英语里它多出现在配方表、材料说明或香评中；日常口语里较少直接说 ionones，更常说“violet note（紫罗兰香调）”。"]}
{"word":"ionopause","summary":{"en":"Ionopause: the boundary where a planet’s ionosphere meets the surrounding solar-wind plasma.","zh":"ionopause：行星电离层与太阳风等离子体相互平衡的边界（电离层顶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In space science, the boundary where a planet’s ionosphere (upper atmosphere filled with charged particles) meets and is balanced against the surrounding plasma/solar wind; above this boundary, the solar wind strongly influences the region.","zh":"（航天/空间物理）电离层顶：行星电离层（含大量带电粒子的高层大气）与周围等离子体/太阳风相互平衡的边界；在此之上，太阳风的影响通常更强。"},"examples":[{"en":"Scientists measured changes in the ionopause during a strong solar storm.","zh":"科学家在一次强太阳风暴期间测量了电离层顶的变化。"},{"en":"On Venus, the ionopause can move up or down depending on solar wind pressure.","zh":"在金星上，电离层顶会随着太阳风压力的变化而上移或下移。"},{"en":"The probe crossed the ionopause and entered a region dominated by the solar wind.","zh":"探测器穿越电离层顶，进入了一个由太阳风主导的区域。"}]}],"synonyms":["ionospheric boundary","ionosphere–solar wind boundary"],"phonetic":"/aɪˈoʊnəˌpɔz/","extraExplanation":["这个词常用于行星科学（如金星、火星）和空间天气研究。与地球不同，一些没有强全球磁场的行星，其高层大气更直接与太阳风相互作用，因此“ionopause（电离层顶）”的位置会随太阳活动而明显变化。","词源可拆分理解：iono-（与离子/电离有关）+ -pause（来自希腊语词根，表示“停止/界限”，在这里可理解为“到此为界”）。"]}
{"word":"ionophore","summary":{"en":"An ionophore is a substance that helps ions cross cell membranes, often used in biology; some also act like antibiotics by disrupting ion balance.","zh":"ionophore 指帮助离子跨越细胞膜的物质，常用于生物实验；其中一些也可通过扰乱离子平衡发挥类似抗生素的作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often a small molecule) that helps specific ions (like K+, Na+, or Ca2+) move across a cell membrane by carrying them or forming a channel.","zh":"离子载体（常为小分子物质），能帮助特定离子（如 K+、Na+、Ca2+）穿过细胞膜，可通过“携带”离子或形成通道来实现。"},"examples":[{"en":"Valinomycin is an ionophore that transports potassium ions across membranes.","zh":"缬氨霉素（valinomycin）是一种离子载体，能将钾离子跨膜运输。"},{"en":"Researchers used an ionophore to change the calcium level inside the cells.","zh":"研究人员使用离子载体来改变细胞内的钙离子水平。"},{"en":"Ionophores can disrupt membrane ion balance and affect cell function.","zh":"离子载体可能会破坏膜两侧的离子平衡，从而影响细胞功能。"}]},{"partOfSpeech":"n.","definition":{"en":"In microbiology and medicine, an ionophore may refer to an antibiotic-like compound that kills or inhibits microbes by disturbing ion gradients across their membranes.","zh":"在微生物学与医学语境中，离子载体也可指一类“类似抗生素”的化合物，通过扰乱微生物细胞膜的离子梯度来抑制或杀死微生物。"},"examples":[{"en":"Some ionophore antibiotics are used in veterinary medicine to control certain infections.","zh":"一些离子载体类抗生素用于兽医领域以控制某些感染。"},{"en":"The bacteria became less sensitive to the ionophore over time.","zh":"随着时间推移，这些细菌对该离子载体的敏感性降低了。"}]}],"synonyms":["ion carrier","ion transporter","channel-forming compound","ionophoric antibiotic"],"phonetic":"/aɪˈɑːnəˌfɔːr/","extraExplanation":["“ionophore”由“ion（离子）+ -phore（携带者/搬运者）”构成，字面意思是“离子的搬运者”。","常见类型包括：载体型（carrier，如 valinomycin）与通道型（channel former，如 gramicidin）。它们常被用于实验中操控细胞内外离子浓度、研究膜电位与离子梯度。"]}
{"word":"ionornis","summary":{"en":"Ionornis is a scientific genus name for an extinct Cretaceous diving seabird, mainly used in paleontology.","zh":"Ionornis 是一个古生物学中使用的属名，指白垩纪晚期已灭绝的潜水海鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name used for an extinct, diving seabird from the Late Cretaceous; in many sources it is treated as closely related to (or historically confused with) Hesperornis.","zh":"（生物）“Ionornis”是一个用于指称白垩纪晚期已灭绝潜水海鸟的属名；在不少资料中，它与（或曾被混同于）Hesperornis（西方鸟）关系很近，甚至被视作历史上的分类用名。"},"examples":[{"en":"Ionornis is an extinct bird known from fossils found in Cretaceous rock layers.","zh":"Ionornis 是一种已灭绝的鸟类，已知于在白垩纪岩层中发现的化石。"},{"en":"Some older references list Ionornis as a separate genus, while others connect it to Hesperornis.","zh":"一些较早的资料把 Ionornis 列为独立的属，而另一些则将它与 Hesperornis 联系在一起。"}]}],"synonyms":["Hesperornis","Hesperornithiformes"],"phonetic":"ˌaɪoʊˈnɔrnɪs","extraExplanation":["这是一个拉丁化的学名（属名），日常英语里很少见，主要出现在古生物学/鸟类学的学术语境中。","词形来源可拆为：ion-（常见于希腊语系构词中）+ ornis（希腊语“鸟”），因此整体带有“某种鸟”的命名风格。","不同资料对其分类地位可能不一致：有的把它当作有效属名，有的将其视为与 Hesperornis 相关的历史用名或近缘类群；阅读时可注意作者采用的分类体系。"]}
{"word":"ionosphere","summary":{"en":"The ionosphere is a charged layer of Earth’s upper atmosphere that influences radio and GPS signals.","zh":"电离层是地球高层大气中带电的区域，会影响无线电与GPS信号传播。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A layer of Earth’s upper atmosphere (about 60–1,000 km above the surface) filled with charged particles (ions) that can affect radio signals.","zh":"电离层：地球高层大气的一部分（约离地表60–1000公里），含有大量带电粒子（离子），会影响无线电信号传播。"},"examples":[{"en":"Shortwave radio signals can bounce off the ionosphere and travel long distances.","zh":"短波无线电信号可以借助电离层反射，从而传播到很远的地方。"},{"en":"Solar storms can disturb the ionosphere and cause communication problems.","zh":"太阳风暴会扰动电离层，造成通信问题。"},{"en":"Scientists measure changes in the ionosphere to better predict GPS accuracy.","zh":"科学家测量电离层的变化，以更好地预测GPS定位精度。"}]}],"synonyms":["upper atmosphere (context-dependent)","ionized layer (technical)"],"phonetic":"/aɪˈɑnəˌsfɪr/","extraExplanation":["“Iono-”来自希腊语，意为“离子”；“-sphere”表示“层/球体”。因此 ionosphere 直译为“离子层”。","电离层会被太阳辐射（尤其是紫外线和X射线）“电离”，白天通常更强；夜间会减弱，但某些高度的电离层仍然存在。","在日常语境里，它常与 radio communications（无线电通信）、GPS signals（GPS信号）、aurora（极光）等话题一起出现。"]}
{"word":"ionospheres","summary":{"en":"Ionospheres are the ionized upper-atmosphere regions (plural of ionosphere) that influence radio communication and satellite signals.","zh":"ionospheres 是 ionosphere（电离层）的复数，指大气中被电离的高层区域，会影响无线电通信与卫星信号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ionized (electrically charged) upper layer of a planet’s atmosphere that affects radio waves and is influenced by the Sun.","zh":"（行星）大气中被电离（带电）的高层区域，会影响无线电波传播，并受太阳活动影响。"},"examples":[{"en":"Earth’s ionosphere helps bounce some radio signals over long distances.","zh":"地球的电离层能让一些无线电信号“反射”到很远的地方。"},{"en":"During strong solar storms, the ionosphere can disrupt GPS and shortwave radio.","zh":"在强太阳风暴期间，电离层可能干扰 GPS 和短波广播。"}]}],"synonyms":["ionosphere (singular)","upper atmosphere (broader)","ionized layer"],"phonetic":"/aɪˈɑnəˌsfɪrz/","extraExplanation":["“ionospheres”是复数形式；单数是“ionosphere”。词根：ion（离子）+ sphere（球体/层），字面意思是“离子层”。","在日常科普语境里，人们常把它看作“上层大气的一部分”，更准确地说它是按电离特性划分的区域，通常与太阳紫外线/粒子活动密切相关。"]}
{"word":"ionospheric","summary":{"en":"Ionospheric means “related to the ionosphere,” a charged upper-atmosphere layer that influences radio signals and space-weather effects.","zh":"ionospheric 指“与电离层有关的”，电离层是含带电粒子的高层大气区域，会影响无线电信号与空间天气现象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the ionosphere, a high layer of Earth’s atmosphere that contains many charged particles (ions) and affects radio communication.","zh":"与电离层有关的；电离层是地球高层大气中含有大量带电粒子（离子）的区域，会影响无线电通信。"},"examples":[{"en":"Ionospheric conditions can change how far shortwave radio signals travel.","zh":"电离层状况会改变短波无线电信号能传播多远。"},{"en":"The scientist studied ionospheric disturbances during a solar storm.","zh":"这位科学家研究了太阳风暴期间的电离层扰动。"}]}],"synonyms":["ionospheric (no common everyday synonym)","of the ionosphere"],"phonetic":"/ˌaɪ.ə.nəˈsfɛr.ɪk/","extraExplanation":["“ionospheric”常见于科学、气象与通信领域，尤其与“space weather（空间天气）”“solar storm（太阳风暴）”“radio propagation（无线电传播）”等话题一起出现。","电离层大致位于地表以上约60–1000公里范围内；太阳辐射会使气体电离，因此白天与夜晚的电离层状态不同，也会导致通信效果不同。"]}
{"word":"ionospherically","summary":{"en":"An adverb meaning “in a way related to the ionosphere.”","zh":"副词：表示“以与电离层有关的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to, happens in, or is caused by the ionosphere (the charged upper layer of Earth’s atmosphere).","zh":"以与电离层（地球大气上部带电区域）有关的方式；在电离层中发生或由电离层引起地。"},"examples":[{"en":"Radio signals can be affected ionospherically, especially at night.","zh":"无线电信号可能会受到电离层方面的影响，尤其是在夜间。"},{"en":"Researchers measured ionospherically induced delays in GPS timing.","zh":"研究人员测量了由电离层引起的 GPS 授时延迟。"}]}],"synonyms":["with respect to the ionosphere","in the ionosphere","due to the ionosphere"],"phonetic":"/aɪˌɑːnəˈsfɪrɪkli/","extraExplanation":["“ionospherically”是比较少见的学术/技术用语，常见于航天、无线电通信与地球物理文献中。日常英语里更常用的表达是“in the ionosphere”或“due to the ionosphere / because of the ionosphere”。","词形结构：ionosphere（电离层）+ -ic（形容词后缀）+ -ally（副词后缀）。常见相关词：ionospheric（电离层的，adj.），ionosphere（n.）。"]}
{"word":"ionoxalis","summary":{"en":"Ionoxalis is a botanical genus name used for certain wood-sorrel (Oxalidaceae) plants, mainly in scientific contexts.","zh":"Ionoxalis 是用于某些酢浆草类植物的属名（学名），主要出现在科学与分类学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for certain wood-sorrel plants (family Oxalidaceae), used mainly in botanical classification.","zh":"（植物学）酢浆草科（Oxalidaceae）中某些酢浆草类植物的属名（学名），主要用于植物分类学语境。"},"examples":[{"en":"In older botanical texts, some species were listed under the genus Ionoxalis.","zh":"在一些较早的植物学文献中，有些物种曾被归入 Ionoxalis 这个属。"},{"en":"The herbarium label records the plant as Ionoxalis, though modern sources may classify it differently.","zh":"标本馆标签把这株植物记为 Ionoxalis，不过现代资料可能会有不同的分类处理。"}]}],"synonyms":["Oxalis","wood sorrel","oxalis"],"phonetic":"/ˌaɪ.ə.noʊˈzæl.ɪs/","extraExplanation":["Ionoxalis 属名多见于分类学或旧版植物志中；在较新的分类系统里，相关物种可能被并入或改归到更常见的属（例如 Oxalis，常译“酢浆草/木酢浆草”）。具体归属会随研究证据（形态与分子数据）更新而变化。","读到 Ionoxalis 时，可以把它理解为“某类酢浆草的学名标签”，用于学术、标本、植物志或拉丁学名场景；日常英语更常用 wood sorrel 或 oxalis。"]}
{"word":"ions","summary":{"en":"Ions are electrically charged atoms or molecules (plural of ion).","zh":"ions 是 ion 的复数，指带电的原子或分子（离子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Atoms or molecules that have an electrical charge because they have lost or gained electrons.","zh":"离子：由于失去或得到电子而带电的原子或分子。"},"examples":[{"en":"Salt breaks into sodium ions and chloride ions in water.","zh":"食盐在水中会分解成钠离子和氯离子。"},{"en":"Positive ions are called cations, and negative ions are called anions.","zh":"带正电的离子叫阳离子，带负电的离子叫阴离子。"}]},{"partOfSpeech":"n.","definition":{"en":"In everyday product language, tiny charged particles in air that some devices claim to produce to help reduce odors or particles (often a marketing term; effectiveness varies).","zh":"在日常产品宣传中，指一些设备宣称产生的空气中微小带电粒子，用于减少异味或颗粒（常带营销色彩，效果因产品而异）。"},"examples":[{"en":"The ad says the air purifier releases ions to freshen the room.","zh":"广告说这款空气净化器会释放离子来让房间空气更清新。"},{"en":"Check independent tests before trusting ion-related claims.","zh":"在相信“离子”相关宣传前，最好查看独立测试结果。"}]}],"synonyms":["charged particles","cations","anions"],"phonetic":"/ˈaɪən/","extraExplanation":["“ions”是“ion”的复数形式。单数：an ion；复数：ions。","记忆点：ion（离子）来自“electric charge（电荷）”。失去电子→带正电（阳离子，cation）；得到电子→带负电（阴离子，anion）。"]}
{"word":"iontophoresis","summary":{"en":"Iontophoresis is a medical technique that uses a mild electric current to deliver medicine through the skin, and it is also used to treat excessive sweating.","zh":"Iontophoresis（离子导入法）是一种用微弱电流帮助药物透皮吸收的医疗技术，也常用于治疗多汗症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical treatment that uses a mild electric current to help medicine (usually in gel or solution form) pass through the skin.","zh":"一种医疗治疗方法：用微弱电流帮助药物（通常为凝胶或溶液）透过皮肤进入组织。"},"examples":[{"en":"The physical therapist used iontophoresis to deliver anti-inflammatory medication to my shoulder.","zh":"物理治疗师用离子导入法把消炎药导入我的肩部。"},{"en":"Iontophoresis can be used in clinics to treat localized pain without an injection.","zh":"在诊所里，离子导入法可用于治疗局部疼痛，而不需要打针。"}]},{"partOfSpeech":"n.","definition":{"en":"A treatment for excessive sweating (hyperhidrosis) that uses water and a low electric current, often for hands or feet.","zh":"一种用于治疗多汗症（出汗过多）的方法：通常让手或脚浸在水中，并施加低强度电流。"},"examples":[{"en":"She started iontophoresis sessions for sweaty palms, and the sweating gradually decreased.","zh":"她开始做手汗的离子导入疗程，出汗逐渐减少。"},{"en":"Many people do iontophoresis at home with a device recommended by their doctor.","zh":"很多人在医生建议下使用设备在家进行离子导入治疗。"}]}],"synonyms":["transdermal drug delivery (method)","electrotransdermal delivery","electrotherapy (broad term)"],"phonetic":"/ˌaɪ.ɑn.tə.fəˈri.sɪs/","extraExplanation":["“iontophoresis”由“ion-（离子）+ -phoresis（搬运/传递）”构成，字面意思是“用离子来传递”。临床上常见于物理治疗、皮肤科（如多汗症）等场景。","它通常被译为“离子导入法/离子电渗疗法”。不同机构可能用词略有差异，但核心概念都是借助电流促进药物或离子通过皮肤。"]}
{"word":"ioparameters","summary":{"en":"I/O parameters are the inputs a system takes and the outputs it produces.","zh":"I/O parameters 指系统/函数接收的输入与产生的输出参数。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Parameters that specify what data (inputs) a program/function/system receives and what results (outputs) it returns or produces.","zh":"用于规定程序/函数/系统接收哪些数据（输入）以及返回或产生哪些结果（输出）的参数。"},"examples":[{"en":"Before calling the function, check its I/O parameters: it takes a file path as input and returns a list of lines as output.","zh":"在调用这个函数之前先确认它的 I/O 参数：输入是文件路径，输出是一组文本行。"},{"en":"The API document clearly describes the I/O parameters for each endpoint.","zh":"API 文档清楚地描述了每个接口的 I/O 参数。"}]},{"partOfSpeech":"phrase","definition":{"en":"In hardware or systems design, settings or signals that define how a device or module communicates with other components (its input and output behavior).","zh":"在硬件或系统设计中，用来规定设备/模块如何与其他组件通信的设置或信号（其输入与输出行为）。"},"examples":[{"en":"Changing the I/O parameters can affect how the sensor reports data to the controller.","zh":"更改 I/O 参数会影响传感器如何把数据上报给控制器。"},{"en":"We tuned the I/O parameters to match the voltage and timing requirements.","zh":"我们调整了 I/O 参数以匹配电压与时序要求。"}]}],"synonyms":["input/output parameters","inputs and outputs","interface parameters","API inputs and outputs"],"phonetic":"/ˌaɪ.oʊ pəˈræmɪtərz/","extraExplanation":["“I/O”是“input/output”（输入/输出）的缩写，常见于编程、接口文档、硬件说明书等场景。","写作时也常见两种形式：I/O parameters（最常见）与 input/output parameters（更正式、更适合面向非技术读者）。","有时人们也会说“input parameters / output parameters”；严格来说，output parameter 在某些语言里指“通过参数返回结果”（如 out 参数），而更普遍的“输出”也可能是返回值、打印到屏幕、写入文件等。"]}
{"word":"ior","summary":{"en":"IOR is an abbreviation used mainly in technical contexts, most commonly meaning “index of refraction.”","zh":"IOR 是主要用于技术语境的缩写，最常见表示“折射率”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) index of refraction (also called refractive index): a number that shows how much light slows down and bends in a material.","zh":"（缩写）折射率（也叫折光指数）：表示光在某种材料中传播时减速并发生偏折程度的数值。"},"examples":[{"en":"Water has an IOR of about 1.33.","zh":"水的折射率（IOR）大约是 1.33。"},{"en":"In 3D graphics, changing the IOR makes glass look more or less realistic.","zh":"在 3D 图形中，调整 IOR 会让玻璃看起来更真实或更不真实。"}]},{"partOfSpeech":"other","definition":{"en":"(computing, abbrev.) Interoperable Object Reference / Internet Object Reference: a technical identifier used in some distributed-computing systems (especially CORBA) to locate an object/service.","zh":"（计算机，缩写）可互操作对象引用 / Internet 对象引用：在某些分布式计算系统（尤其是 CORBA）中用于定位对象/服务的技术标识符。"},"examples":[{"en":"The client stores the IOR so it can reconnect to the remote object later.","zh":"客户端保存 IOR，以便之后重新连接远程对象。"},{"en":"The server returned an IOR that points to the new service.","zh":"服务器返回了一个指向新服务的 IOR。"}]}],"synonyms":["refractive index (for the optics meaning)"],"phonetic":"/aɪ oʊ ɑr/","extraExplanation":["“IOR”通常只在专业语境中出现（物理、光学、3D 渲染或分布式系统）。在日常英语里很少把它当作普通单词使用。","读法一般按字母读：I-O-R。不同领域含义不同，遇到时最好结合上下文（比如是否在讲光线、材质，或是在讲网络/分布式对象）。"]}
{"word":"iority","summary":{"en":"A priority is something (or the right) that comes first because it is more important or urgent.","zh":"priority 指因更重要或更紧急而需要“优先处理”的事情，或“优先权”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is more important than other things and should be dealt with first.","zh":"优先事项；最重要的事（比其他事情更重要，应先处理）。"},"examples":[{"en":"Safety is our top priority.","zh":"安全是我们的首要任务。"},{"en":"Paying rent has to be a priority this month.","zh":"这个月付房租必须优先处理。"}]},{"partOfSpeech":"n.","definition":{"en":"The right or advantage of being served, considered, or done before others.","zh":"优先权；优先处理的权利或优势。"},"examples":[{"en":"Emergency vehicles have priority at intersections.","zh":"紧急车辆在路口有优先通行权。"},{"en":"Students with disabilities may receive priority registration.","zh":"残障学生可能会获得优先选课资格。"}]}],"synonyms":["precedence","importance","urgency","top concern"],"phonetic":"/praɪˈɔrəti/","extraExplanation":["你输入的“iority”通常不是一个独立的英语单词，更常见的是你想查“priority”（优先；优先事项）。","词源提示：priority 来自“prior”（更早的、在前的），所以它的核心感觉是“先于其他的、排在前面的”。","常见搭配：top/first priority（首要任务）；a high/low priority（高/低优先级）；give priority to...（优先考虑……）；priority list（优先清单）；priority lane/boarding（优先通道/优先登机）。"]}
{"word":"iortn","summary":{"en":"“iortn” is not a recognized English word; it’s likely a misspelling. Share the context to identify the intended word.","zh":"“iortn”不是标准英语单词，可能是拼写错误；给出上下文可帮助确定你想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or random letters. You may have meant a different word such as “intro,” “iron,” “into,” or “irony/ironic.”","zh":"不是标准英语单词，可能是拼写错误或随意字母组合。你可能想输入的是 “intro”（介绍/开场）、“iron”（铁/熨烫）、“into”（进入到）、或 “irony/ironic”（讽刺/讽刺的）等。"},"examples":[{"en":"“iortn” isn’t in most English dictionaries—did you mean “intro”?","zh":"“iortn”在大多数英语词典中找不到——你是不是想写“intro”？"},{"en":"If you tell me the sentence you saw it in, I can guess the intended word.","zh":"如果你把它出现的句子发给我，我可以帮你推测原本想表达的单词。"}]}],"synonyms":["intro","into","iron","irony","ironic"],"extraExplanation":["“iortn”看起来像是字母顺序打乱或键盘误触。把它放回原句（或告诉我你想表达的中文意思），我就能更准确地判断你要查的是哪个词。常见可能：intro（开场/简介）、into（进入到）、iron（铁/熨烫）、irony/ironic（讽刺/讽刺的）。"]}
{"word":"iOS","summary":{"en":"Apple’s mobile operating system for iPhone.","zh":"苹果用于 iPhone 的移动操作系统。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Apple’s mobile operating system used mainly on iPhone (and historically on iPod touch), providing the interface and core features that apps run on.","zh":"苹果公司的移动操作系统，主要用于 iPhone（历史上也用于 iPod touch），提供界面与应用运行所需的核心功能。"},"examples":[{"en":"My iPhone is running the latest version of iOS.","zh":"我的 iPhone 正在运行最新版本的 iOS。"},{"en":"This app requires iOS 16 or later.","zh":"这个应用需要 iOS 16 或更高版本。"},{"en":"iOS updates often include security fixes.","zh":"iOS 更新通常包含安全修复。"}]}],"synonyms":["iPhone OS (older name)","Apple mobile OS"],"phonetic":"ˌaɪ.oʊˈɛs","extraExplanation":["iOS 原名是 iPhone OS（2007 年随第一代 iPhone 推出），2010 年左右改称 iOS。","与 Android（谷歌生态）相比，iOS 常被认为在软硬件整合、更新一致性与隐私权限提示方面更集中统一，但可自定义程度相对更少。","在日常英语中，人们常说 “on iOS / for iOS”（在 iOS 上/适用于 iOS），或用 “iOS app”“iOS update” 这类搭配。"]}
{"word":"ios","summary":{"en":"iOS is Apple’s mobile operating system for iPhones.","zh":"iOS 是苹果公司用于 iPhone 的移动操作系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Apple’s mobile operating system used on iPhone (and historically on iPad and iPod touch), providing the interface, security, and apps platform.","zh":"苹果公司的移动操作系统，主要用于 iPhone（历史上也用于 iPad 和 iPod touch），提供界面、安全机制和应用运行平台。"},"examples":[{"en":"My iPhone is running iOS 17.","zh":"我的 iPhone 正在运行 iOS 17。"},{"en":"Some apps work only on iOS and not on Android.","zh":"有些应用只支持 iOS，不支持 Android。"},{"en":"After the iOS update, my battery life improved.","zh":"更新 iOS 之后，我的电池续航变好了。"}]}],"synonyms":["Apple mobile operating system","iPhone OS (older name)"],"phonetic":"ˌaɪ.oʊˈɛs","extraExplanation":["“iOS”是“iPhone Operating System”的缩写，后来成为苹果移动系统的正式名称。","现在 iPad 使用的系统通常叫“iPadOS”，但很多人日常口语里仍会把它统称为 iOS（尤其在泛指苹果移动生态时）。","写作上常见：iOS（首字母小写 i，后接大写 OS）。口语里也常直接说“i-OS”。"]}
{"word":"ioskeha","summary":{"en":"“ioskeha” is not recognized as a standard English word; it likely needs context or corrected spelling.","zh":"“ioskeha”不是标准英语词；需要语境或更正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, or a word from another language. Please provide the intended spelling or a sentence for context.","zh":"不是标准英语单词；更可能是拼写错误、用户名，或来自其他语言的词。请提供正确拼写或放在句子中的语境。"},"examples":[{"en":"I couldn’t find a dictionary entry for “ioskeha.” Could you share a sentence where you saw it?","zh":"我在词典里查不到“ioskeha”。你能给我一个你看到它的句子吗？"},{"en":"If you meant “Iroquois,” the spelling is different.","zh":"如果你想写的是“Iroquois（易洛魁）”，拼写会不一样。"}]}],"extraExplanation":["目前“ioskeha”在常见英语词典中没有收录。它可能是：\n1）拼写错误（例如输入法/键盘误触）；\n2）专有名词（人名、地名、游戏/小说角色名、账号名）；\n3）其他语言的词或音译。\n\n你可以把它出现的整句/截图发我，或告诉我你想表达的意思（比如“某个民族/神话人物/地名/角色”），我就能更准确地判断。"]}
{"word":"IOT","summary":{"en":"IoT means the Internet of Things: connected physical devices that collect and share data for automation and remote control.","zh":"IoT 指“物联网”：连接到互联网的实体设备，通过收集与共享数据实现自动化和远程控制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Internet of Things: a network of physical devices (like sensors, appliances, cars, and machines) connected to the internet so they can collect and share data, often enabling remote control and automation","zh":"物联网：把各种实体设备（如传感器、家电、汽车、机器等）连接到互联网，使其能收集并交换数据，常用于远程控制与自动化"},"examples":[{"en":"Many smart home products are part of the IoT, like smart lights and thermostats.","zh":"许多智能家居产品都属于物联网，比如智能灯和智能温控器。"},{"en":"Factories use IoT sensors to monitor machines and prevent breakdowns.","zh":"工厂使用物联网传感器来监测机器并预防故障。"},{"en":"IoT devices should be updated regularly to reduce security risks.","zh":"物联网设备应定期更新，以降低安全风险。"}]}],"synonyms":["Internet of Things","connected devices","smart devices"],"phonetic":"/ˌaɪ.oʊˈtiː/","extraExplanation":["“IoT”是“Internet of Things”的缩写，读作字母 I-O-T。中文常译为“物联网”。","物联网常见场景包括：智能家居、智慧城市、车联网、工业物联网（IIoT）、可穿戴设备与医疗监测等。","学习时可顺带记常搭配：IoT device（物联网设备）, IoT sensor（物联网传感器）, IoT network/platform（物联网网络/平台）, smart/connected device（智能/互联设备）。","文化与安全提示：在英语语境里谈IoT时，经常会提到 privacy（隐私）和 cybersecurity（网络安全），因为设备可能收集大量个人或运行数据。"]}
{"word":"IoT","summary":{"en":"IoT means the Internet of Things: everyday physical objects connected to the internet to collect/share data and enable automation or remote control.","zh":"IoT 指“物联网”：让现实物体联网以采集/共享数据，并实现自动化或远程控制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Internet of Things) a network of physical objects (like sensors, appliances, cars, and machines) connected to the internet so they can collect and share data, and sometimes be controlled remotely.","zh":"（物联网）指把现实中的物体（如传感器、家电、汽车、机器等）连接到互联网，使其能够采集并共享数据，有时还能被远程控制的网络。"},"examples":[{"en":"Smart thermostats and fitness trackers are common IoT devices.","zh":"智能恒温器和健身追踪器是常见的物联网设备。"},{"en":"The factory used IoT sensors to monitor temperature and reduce energy use.","zh":"这家工厂用物联网传感器监测温度并降低能耗。"},{"en":"IoT security is important because connected devices can be targets for hackers.","zh":"物联网安全很重要，因为联网设备可能成为黑客攻击目标。"}]}],"synonyms":["Internet of Things","the IoT"],"phonetic":"/ˌaɪ.oʊˈtiː/","extraExplanation":["“IoT”是缩写，读作字母：I-O-T。正式写法常见为“the IoT”或直接写“IoT”。","常见相关词：IoT device（物联网设备）、IoT sensor（物联网传感器）、IoT network/platform（物联网网络/平台）、smart home（智能家居）、industrial IoT/IIoT（工业物联网）。","在新闻与商业语境里，IoT常与隐私（privacy）、数据（data）、互联互通（interoperability）和网络安全（cybersecurity）一起出现。"]}
{"word":"iota","summary":{"en":"Iota means either a very small amount or the Greek letter used in academic contexts.","zh":"iota 指“极少量/一丁点儿”，也指希腊字母 iota（在学术语境中常用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very small amount; a tiny bit.","zh":"极少量；一丁点儿。"},"examples":[{"en":"There isn’t an iota of truth in that rumor.","zh":"那个谣言一点真实性都没有。"},{"en":"He didn’t show an iota of regret.","zh":"他没有表现出一丝后悔。"}]},{"partOfSpeech":"n.","definition":{"en":"The ninth letter of the Greek alphabet (Ι, ι), used in science and math to represent certain variables or quantities.","zh":"希腊字母表的第九个字母（Ι, ι）；在科学与数学中常用来表示变量或量。"},"examples":[{"en":"In some formulas, iota is used as a symbol for a variable.","zh":"在一些公式中，iota 被用作变量符号。"},{"en":"The word comes from the Greek letter iota.","zh":"这个词源自希腊字母 iota。"}]}],"synonyms":["tiny amount","trace","bit","speck"],"phonetic":"/aɪˈoʊtə/","extraExplanation":["“not an iota”是很常见的固定搭配，意思是“丝毫不、一点也不”。语气比“not a bit”更正式一些，常见于书面语或较正式的口语。","在文化与文学中，“iota”常被用来强调“极小、微不足道”。它的“极小”含义也和“iota在希腊字母里是很小的一个字母”的联想有关。"]}
{"word":"iotacism","summary":{"en":"Iotacism is a sound change where several vowels shift to the “ee” (/i/) sound, especially in Greek.","zh":"Iotacism 指多种元音向“i/ee”（/i/）音靠拢的语音变化，尤见于希腊语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pronunciation change where different vowel sounds become pronounced like “ee” (the “iota” sound), especially in later Greek.","zh":"（语音变化）不同的元音逐渐读成类似“i”（/i/，像英语“ee”）的音，尤指后期希腊语中常见的现象。"},"examples":[{"en":"In Modern Greek, several letters are pronounced the same because of iotacism.","zh":"在现代希腊语里，一些字母之所以发音相同，是因为发生了 iotacism（“i”化）。"},{"en":"Iotacism can make older spellings difficult to interpret from pronunciation alone.","zh":"iotacism 会让仅凭读音来理解较早时期的拼写变得更困难。"}]},{"partOfSpeech":"n.","definition":{"en":"In a broader (sometimes informal) sense, overusing the “i” sound in speech or writing.","zh":"（更广义、较口语/非正式）在说话或写作中过度使用或偏爱“i/ee”这类音。"},"examples":[{"en":"Some critics jokingly described the character’s accent as a kind of iotacism.","zh":"有评论者开玩笑说这个角色的口音有点像“iotacism”。"}]}],"synonyms":["iotation","sound merger (to /i/)","vowel merger"],"phonetic":"/aɪˈɑːtəˌsɪzəm/","extraExplanation":["“Iotacism”来自希腊字母 iota（ι）。它最常见于希腊语历史语音学：例如在现代希腊语中，η、ι、υ、ει、οι、υι 等多种写法常读作 /i/，这会造成“同音不同拼”的现象。","学习/阅读提示：在阅读古希腊语或《新约希腊语》相关资料时，你可能会看到 iotacism 被用来解释拼写差异、押韵变化、或抄写错误（因为很多音变得一样，写错更容易发生）。"]}
{"word":"iotacisms","summary":{"en":"Iotacisms are vowel-to-/i/ sound changes in Greek and the related spelling confusions they can cause; “iotacisms” is the plural form of “iotacism.”","zh":"Iotacisms 指希腊语中多个元音向 /i/（“ee”）音合并的变化，以及由此引发的拼写/抄写混淆；iotacisms 为 iotacism 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics, especially in Greek) a sound change in which several vowels or diphthongs shift toward the /i/ (“ee”) sound, often merging in pronunciation.","zh":"（语言学，尤指希腊语）一种语音变化：多个元音或双元音向 /i/（“一”音、“ee”音）靠拢，常导致读音合并。"},"examples":[{"en":"In later Greek, iotacism caused several different vowel spellings to be pronounced the same way.","zh":"在后期希腊语中，iotacism 使多种不同的元音拼写读起来变成同一个音。"},{"en":"Teachers may mention iotacism when explaining why some Greek words sound alike but are spelled differently.","zh":"老师在解释为什么一些希腊语词听起来一样却拼写不同，可能会提到 iotacism。"}]},{"partOfSpeech":"n.","definition":{"en":"A writing or spelling error that results from that /i/ sound-merger, especially confusion among letters that came to be pronounced alike.","zh":"由这种 /i/ 合并发音引起的书写或拼写错误，尤指把后来发音相同的字母写混。"},"examples":[{"en":"Some manuscript variants are explained as iotacisms rather than intentional changes.","zh":"一些手稿中的异文更可能是 iotacisms（因读音合并导致的误写），而不是刻意改动。"},{"en":"The editor corrected a likely iotacism where the scribe confused two similar-sounding vowel spellings.","zh":"编辑更正了一处疑似 iotacism：抄写员把两种听起来相近的元音拼写写混了。"}]}],"synonyms":["itacism","vowel merger","spelling confusion (from sound change)"],"phonetic":"/aɪˈoʊtəˌsɪzəm/","extraExplanation":["“iotacisms”是复数形式，单数是“iotacism”。名称来自希腊字母“iota（ι）”，因为很多元音逐渐读成类似 iota 的 /i/ 音。","在希腊语学习与古文献（包括新约希腊文）校勘中，这个概念常被用来解释：为什么不同拼写在后来读音相同，从而容易出现抄写混淆与异文。"]}
{"word":"iotacismus","summary":{"en":"Iotacismus (iotacism) is a linguistic term for the merging of several Greek vowel sounds into the /i/ (“ee”) sound, especially in later/Modern Greek.","zh":"Iotacismus（iotacism，i 音化）指希腊语中多个元音/双元音逐渐合并并读成 /i/（类似“ee”）的语音变化，尤见于后期与现代希腊语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) The pronunciation of different Greek vowel sounds as /i/ (like the “ee” sound), especially in later Greek; also, a spelling/pronunciation change where several vowels and diphthongs merge into an “i” sound.","zh":"（语言学）“i 音化”：把古希腊语中原本不同的元音/双元音读成同一个 /i/（类似英语“ee”）的现象，常见于后期希腊语；也可指这些元音在拼写与发音上逐渐合并为“i”音的变化。"},"examples":[{"en":"In Modern Greek, several older vowel spellings share the same /i/ sound—this merger is often discussed under iotacism.","zh":"在现代希腊语中，一些古老的元音拼写读起来都是同一个 /i/ 音——这种合并常用“iotacism（i 音化）”来讨论。"},{"en":"A student of Greek may confuse η, ι, υ, ει, οι because iotacism makes them sound alike today.","zh":"学习希腊语的人可能会把 η、ι、υ、ει、οι 搞混，因为 i 音化使它们在今天听起来很像。"}]}],"synonyms":["iotacism","vowel merger","sound change"],"phonetic":"/ˈaɪ.oʊ.təˌsɪz.əm/","extraExplanation":["“Iotacismus”是拉丁化拼写，对应英语更常见的形式是“iotacism”。词源与希腊字母“ι”（iota）有关，因为合并后的目标读音接近 iota 的音。","在文本学/抄写研究里，i 音化会导致“同音异写”的拼写错误：抄写者听到或想到 /i/，可能把原本应写的 η、ει、οι 等写成别的同音拼写。"]}
{"word":"iotacist","summary":{"en":"An iotacist is someone who pronounces certain vowels as /i/ (iota-like), especially in Greek studies.","zh":"iotacist 指把某些元音读成 /i/（类似 iota 音）的人，常用于希腊语研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who pronounces certain vowels or vowel combinations as the sound /i/ (like the Greek letter iota), especially in the context of Greek language history or textual studies","zh":"（尤指在希腊语历史或文献研究中）把某些元音或元音组合读成 /i/（类似希腊字母 iota 音）的说话者或书写者"},"examples":[{"en":"Some scholars argue the scribe was an iotacist, which may explain the spelling errors in the manuscript.","zh":"一些学者认为这位抄写员有“iotacism（i 音化）”倾向，这可能解释了手稿中的拼写错误。"},{"en":"In later Greek, an iotacist might pronounce several different vowel spellings with the same “ee” sound.","zh":"在后期希腊语中，iotacist 可能会把好几种不同的元音拼写都读成同一个“ee”音。"}]}],"synonyms":["itacist"],"phonetic":"/aɪˈɑːtəsɪst/","extraExplanation":["这个词主要见于语言学与古典学（Classicists/Greek studies）。“iotacism（i 音化）”指希腊语中多个元音逐渐合并为 /i/ 音的现象；因此 iotacist 指“有这种发音（或由此产生拼写习惯）的人/抄写员”。在英语里更常见的拼写是 itacist（少一个 o）。"]}
{"word":"iotas","summary":{"en":"“Iotas” usually means very tiny amounts or details (often in “not one iota”); it can also be the plural of the Greek letter iota.","zh":"“iotas”通常指“极少量/微小细节”（常见于“not one iota”）；也可指希腊字母 iota 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Very small amounts; tiny details (often used in the phrase “not one iota”).","zh":"极少量；微不足道的细节（常用于短语“not one iota”）"},"examples":[{"en":"There isn’t one iota of truth in that rumor.","zh":"那个谣言一点真实性都没有。"},{"en":"Her decision didn’t change one iota after hearing the criticism.","zh":"听了批评之后，她的决定丝毫没有改变。"}]},{"partOfSpeech":"n.","definition":{"en":"The plural of iota (the ninth letter of the Greek alphabet), used in academic or technical contexts.","zh":"iota 的复数；希腊字母表中第九个字母的名称（多用于学术或技术语境）"},"examples":[{"en":"The manuscript contains several iotas written in the margin.","zh":"那份手稿的页边空白处写了好几个 iota。"}]}],"synonyms":["a bit","a shred","a trace","the slightest amount"],"phonetic":"/aɪˈoʊtəz/","extraExplanation":["“iota”原本是希腊字母ι，因为这个字母很小，英语里引申出“极小的量、丝毫”的意思，因此常见固定搭配是“not one iota”（一点也不）。","现代英语里“iotas”多用于强调“连一点点都没有/改变不了”，属于比较正式或书面化的表达。"]}
{"word":"iotization","summary":{"en":"Iotization is a linguistic sound change where a consonant becomes palatal or picks up a /j/ (“y”) glide, often due to a nearby /j/ or /i/.","zh":"Iotization 指语言学中的音变：辅音在/j/（y音）或/i/等前元音影响下腭化或带上/j/滑音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) A sound change in which a consonant becomes palatal or gains a /j/ (“y”) glide, often under the influence of a following /j/ or front vowel (like /i/).","zh":"（语言学）一种语音变化：辅音在后接/j/（英语y音）或前元音（如/i/）的影响下变得腭化，或出现/j/的滑音成分。"},"examples":[{"en":"In some Slavic languages, iotization changed certain consonants before /j/ into more palatal sounds.","zh":"在一些斯拉夫语言中，iotization使某些辅音在/j/前变成更腭化的音。"},{"en":"The textbook contrasts palatalization in general with iotization caused specifically by a /j/ sound.","zh":"教材把一般的腭化与由/j/音特别引起的iotization作了对比。"}]}],"synonyms":["iotation","(j-)palatalization","glide insertion (j)"],"phonetic":"/ˌaɪ.oʊ.təˈzeɪ.ʃən/","extraExplanation":["这个词主要出现在历史语言学/比较语言学里，常用来描述“受/j/（y音）影响而发生的腭化或带上y滑音”的过程，尤其常见于对斯拉夫语族等语言的音变讨论。","不要把 iotization 和 iotacism 混淆：iotacism 指希腊语里多个元音逐渐并入类似/i/的读音（与字母 iota 相关），而 iotization 更强调/j/（y）引发的辅音变化。"]}
{"word":"iotize","summary":{"en":"“Iotize” means to make something an IoT-enabled device or system by adding connectivity, sensors, and software.","zh":"“Iotize”指把某物做成具备物联网能力的设备或系统（加上连接、传感器和软件）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to turn something into an Internet of Things (IoT) device or system by adding sensors, connectivity, and software so it can collect data and communicate over a network","zh":"使某物“物联网化”（加入传感器、网络连接与软件），让它能采集数据并通过网络通信"},"examples":[{"en":"The company plans to iotize its vending machines so they can report inventory levels in real time.","zh":"这家公司计划把自动售货机物联网化，让它们能实时上报库存。"},{"en":"We iotized the factory equipment to monitor temperature and predict failures.","zh":"我们把工厂设备物联网化，用来监测温度并预测故障。"}]}],"synonyms":["make IoT-enabled","add IoT capabilities","connect to the IoT","digitize (related, broader)"],"phonetic":"/aɪˈɑːt.aɪz/","extraExplanation":["“iotize”是较新的行业用语/新造词，来自缩写“IoT (Internet of Things)” + 动词后缀“-ize”（表示“使……化/使成为……”）。在正式写作中也常见替代表达：“add IoT capabilities to… / connect … to the IoT / enable IoT on …”。","在发音上，很多人会把“IoT”按字母读成“eye-oh-tee”，因此“iotize”通常读作类似“eye-AH-tize”。实际使用中可能因公司/地区而略有差异。"]}
{"word":"iotized","summary":{"en":"Iotized means “changed in sound under the influence of /j/ (yod), often becoming more palatal,” and it can also be the past form of iotize.","zh":"iotized 指“在/j/（yod）的影响下发生语音变化（常趋向腭化）”，也可作 iotize 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Changed in pronunciation by the influence of a following /j/ (“y” sound), often becoming more palatal (closer to the hard palate).","zh":"（语言学）因后面出现/j/（类似英语y的音）而发生语音变化，常表现为更“腭化”（发音部位更靠近硬腭）。"},"examples":[{"en":"In some historical sound changes, /k/ before /j/ became more iotized and shifted toward a palatal sound.","zh":"在一些历史音变中，/k/ 在 /j/ 前会发生 iotized（受/j/影响的变化），逐渐向更腭化的音靠拢。"},{"en":"The iotized consonants in the older stage of the language later developed into new consonant sounds.","zh":"该语言较早阶段中的 iotized（受/j/影响的）辅音后来发展成了新的辅音音位。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of iotize (“to apply iotation; to cause a sound to change under the influence of /j/”).","zh":"iotize 的过去式/过去分词（意为“使发生 iotation；在/j/影响下促使语音变化”）。"},"examples":[{"en":"The author argues that scribes iotized certain consonants in spelling to reflect pronunciation.","zh":"作者认为抄写员在拼写上把某些辅音 iotized（用受/j/影响的形式表达），以反映当时的发音。"}]}],"synonyms":["palatalized","yodized"],"phonetic":"/ˈaɪəˌtaɪzd/","extraExplanation":["“iotized / iotize”多见于历史语言学、语音学讨论，日常英语几乎不用。它与“yod（/j/）”密切相关：很多语言在历史上出现过“辅音 + /j/”导致的腭化或读音变化。","学习上可以把它近似理解为“yodized（受/j/影响）”或“palatalized（腭化的）”。不同语言传统里术语使用会有差异：有的研究更常用 palatalization，而 iotation 更强调/j/这一触发因素。"]}
{"word":"iotizing","summary":{"en":"Ionizing means causing ionization (making charged particles), especially in “ionizing radiation.”","zh":"Ionizing 指“电离的/使电离的”，常见于“电离辐射”等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually in science) causing atoms or molecules to become charged (ions) by removing or adding electrons; often used in the phrase “ionizing radiation.”","zh":"（多用于科学）使原子或分子失去或得到电子而带电（形成离子）的；常用于短语“电离辐射”。"},"examples":[{"en":"X-rays are a type of ionizing radiation.","zh":"X射线是一种电离辐射。"},{"en":"Ionizing energy can damage living cells if the dose is high.","zh":"如果剂量很高，电离能量会损伤活细胞。"}]},{"partOfSpeech":"v.","definition":{"en":"the “-ing” form of ionize: to make something become ionized.","zh":"ionize 的“-ing”形式：使……电离（带电）。"},"examples":[{"en":"The device is ionizing the air to reduce static electricity.","zh":"这台设备正在使空气电离，以减少静电。"},{"en":"Scientists are ionizing gas in the lab to study plasma.","zh":"科学家正在实验室中使气体电离，以研究等离子体。"}]}],"synonyms":["ionizing (radiation)","ion-generating","electrifying (in science contexts)"],"phonetic":"/ˈaɪəˌnaɪzɪŋ/","extraExplanation":["你输入的“iotizing”很可能是拼写错误，常见正确拼写是 **ionizing**（电离的）。英语里没有常用词 *iotizing*。","常见搭配：**ionizing radiation（电离辐射）**，指能把物质电离的辐射，例如X射线、伽马射线。与之相对的是 **non-ionizing radiation（非电离辐射）**，如可见光、无线电波。"]}
{"word":"IOU","summary":{"en":"An IOU is a note that says you owe someone money or a favor.","zh":"IOU 指欠条，也可泛指“欠你一个人情/帮忙”的表示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a written note or informal document that shows you owe someone money or a favor","zh":"（非正式）欠条；表示你欠别人钱或人情的书面/简写凭据"},"examples":[{"en":"He gave me an IOU for $20 until payday.","zh":"他给了我一张20美元的欠条，等发薪日再还。"},{"en":"Don’t worry—I owe you one. Consider it an IOU.","zh":"别担心，我欠你一次人情，就当我给你打了个IOU。"}]}],"synonyms":["debt note","acknowledgment of debt","promissory note (more formal)"],"phonetic":"/ˌaɪ oʊ ˈjuː/","extraExplanation":["IOU 来自英文句子 “I owe you”（我欠你），常写作 I.O.U. 或 IOU。它既可以指真正的欠条（欠钱），也常用于口语里表示“欠你一个人情/帮忙”。","在正式金融或法律场合，人们更常用 promissory note（本票/借据）或 debt acknowledgment（债务确认）。IOU 通常比较随意，未必具有强法律效力，具体取决于内容与当地法规。"]}
{"word":"iou","summary":{"en":"An IOU is a written note saying you owe someone money; it can also be used as an informal verb meaning “to owe.”","zh":"IOU 指表示欠款的书面欠条；也可作非正式动词，表示“欠（钱）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a written promise to pay someone a particular amount of money; a debt note","zh":"（非正式）欠条；借据；表示欠款的书面凭证"},"examples":[{"en":"He gave me an IOU for $50 and promised to pay me back next week.","zh":"他给了我一张50美元的欠条，并答应下周还我。"},{"en":"If you can’t pay now, at least write an IOU so we both remember the amount.","zh":"如果你现在付不了，至少写张欠条，这样我们都记得金额。"}]},{"partOfSpeech":"v.","definition":{"en":"to owe someone money (often used humorously or informally)","zh":"（非正式/幽默）欠（某人）钱；欠账"},"examples":[{"en":"I still IOU you for lunch.","zh":"午饭钱我还欠着你呢。"}]}],"synonyms":["debt note","promissory note","I owe you"],"phonetic":"/ˌaɪˈoʊˈjuː/","extraExplanation":["IOU 是 “I owe you” 的缩写，意思是“我欠你（钱）”。在日常生活中常用来写在纸条上表示暂时欠款，但在法律上是否具有强制力取决于写法、金额、日期、签名以及当地法律。","在正式场合或金额较大时，更常见的说法是 promissory note（本票/借据）或 written acknowledgment of debt（书面债务确认）。"]}
{"word":"ioudaios","summary":{"en":"*Ioudaios* is a Koine Greek term meaning “Judean”; depending on context it may also mean “Jew.”","zh":"*Ioudaios* 是通用希腊语词，基本义为“犹太地人（Judean）”，在不同语境下也可指“犹太人（Jew）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Koine Greek word meaning a person from Judea (a “Judean”); in many contexts it is also used to mean a “Jew” (a member of the Jewish people/religion).","zh":"一个希腊语（通用希腊语）词，指“犹太地人/犹太地区的人（Judean）”；在许多语境中也用来指“犹太人（Jew）”（犹太民族或犹太教成员）。"},"examples":[{"en":"In some New Testament passages, *Ioudaios* can mean “Judean” (from Judea) rather than “Jew” in a broad sense.","zh":"在一些《新约》经文中，*Ioudaios* 可能更接近“犹太地人（来自犹太地）”，而不一定是广义的“犹太人”。"},{"en":"Translators decide whether *Ioudaios* is best rendered as “Judean,” “Jew,” or sometimes “Jewish leaders,” depending on context.","zh":"译者会根据上下文判断 *Ioudaios* 更适合译为“犹太地人”“犹太人”，或有时译作“犹太领袖/犹太当局”等。"}]}],"synonyms":["Judean","Jew"],"phonetic":"/juːˈdeɪ.ɑs/","extraExplanation":["词形背景：*Ioudaios*（Ἰουδαῖος）源自“犹大/犹太（Judah/Judea）”。早期常偏地理含义（“犹太地人”），后来也常带民族/宗教含义（“犹太人”）。","语境与敏感性：在某些《新约》段落里，把 *Ioudaios* 一律译成“犹太人”可能会让现代读者误以为是在指整个犹太民族；不少学者与译本会视语境改译为“犹太地人”或更具体的“犹太领袖/当局”，以避免误读与不必要的泛化。","学习提示：判断含义时可以看对比对象是谁（如“加利利人/撒玛利亚人/外邦人”）、谈论的是地理归属还是宗教身份、以及叙事场景（耶路撒冷/犹太地 vs. 更广阔的罗马世界）。"]}
{"word":"iour","summary":{"en":"“iour” is an old/nonstandard spelling of “your.” Use “your” in modern English.","zh":"“iour”是“your”的古体/非标准拼写；现代英语应写作“your”。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"An archaic or nonstandard spelling of “your” (second-person possessive determiner), meaning “belonging to you.”","zh":"“your”的古体或非标准拼写，表示“你的/你们的（所属）”。"},"examples":[{"en":"Iour grace, I beg your pardon. (archaic style)","zh":"阁下（您的恩典），恳请您宽恕。（古体风格）"},{"en":"Please bring your book tomorrow. (modern spelling)","zh":"请明天把你的书带来。（现代拼写）"}]}],"synonyms":["your"],"phonetic":"/jʊr/","extraExplanation":["“iour”常见于中古英语/早期现代英语的手稿或旧印刷文本中，属于拼写尚未统一时期的变体；在现代英语写作中应使用“your”。","有时也可能只是把“your”打错（键盘输入错误）。如果你是在现代对话、作业或邮件里看到“iour”，通常应改为“your”。"]}
{"word":"ious","summary":{"en":"“-ious” is a suffix that forms adjectives meaning “having the quality of” or “showing/tending to” a state or feeling (e.g., curious, serious, anxious).","zh":"“-ious”是构成形容词的后缀，常表示“具有……特征/性质”或“表现出/倾向于”某种状态或情绪（如 curious, serious, anxious）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(suffix) Used to form adjectives meaning “having the quality of,” “full of,” or “characterized by” something.","zh":"（后缀）用于构成形容词，表示“具有……性质/特征的”“充满……的”“以……为特征的”。"},"examples":[{"en":"curious — wanting to know more; full of curiosity.","zh":"curious — 好奇的；充满好奇心的。"},{"en":"serious — having a serious quality; not joking.","zh":"serious — 严肃的；认真的。"},{"en":"mysterious — having the quality of mystery; hard to explain.","zh":"mysterious — 神秘的；难以解释的。"}]},{"partOfSpeech":"other","definition":{"en":"(suffix) In many words, it creates an adjective meaning “tending to” or “showing” a state or feeling.","zh":"（后缀）在许多词中，用来构成形容词，表示“倾向于/表现出”某种状态或情绪。"},"examples":[{"en":"furious — showing extreme anger.","zh":"furious — 暴怒的；极其生气的。"},{"en":"anxious — tending to worry; feeling worry.","zh":"anxious — 焦虑的；担心的。"}]}],"phonetic":"/iəs/","extraExplanation":["“-ious”通常读作弱读 /iəs/（像“ee-uhs”的轻读）。不同单词里重音位置不一样：curiOUS, mysteriOUS, anxiOUS。","拼写小规律：以 -y 结尾的名词/形容词加 -ious 时，常把 y 变成 i：mystery → mysterious，glory → glorious。","容易混淆：-ious 和 -ous 很像，但不完全一样；例如 dangerous 是 -ous，不是 -ious。看词根来源与固定拼写更可靠。"]}
{"word":"Iowa","summary":{"en":"Iowa is a U.S. state in the Midwest.","zh":"Iowa（爱荷华州）是美国中西部的一个州。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in the Midwestern United States, known for agriculture (especially corn and soybeans) and for being an early, influential state in U.S. presidential elections.","zh":"美国中西部的一个州，以农业（尤其是玉米和大豆）以及在美国总统选举中较早、影响力较大的初选（党团会议）而闻名。"},"examples":[{"en":"Iowa is famous for its cornfields and small towns.","zh":"爱荷华州以玉米地和小城镇而闻名。"},{"en":"Many presidential candidates visit Iowa early in the election season.","zh":"许多总统候选人会在选举季初期就去爱荷华州拜访选民。"}]}],"synonyms":["the Hawkeye State"],"phonetic":"/ˈaɪəwə/","extraExplanation":["“Iowa”既指州名，也可指“爱荷华州人”或“爱荷华州的”（如：Iowa voters 爱荷华州选民）。","发音提示：开头的字母 I 读作 /aɪ/（类似“爱”），重音在第一个音节：/ˈaɪəwə/。"]}
{"word":"iowan","summary":{"en":"Iowan means a person from Iowa, or something related to Iowa.","zh":"Iowan 指“爱荷华州人”，也可作形容词表示“爱荷华州的／与爱荷华州有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. state of Iowa","zh":"爱荷华州人（美国爱荷华州的居民）"},"examples":[{"en":"She’s an Iowan who moved to Chicago for work.","zh":"她是爱荷华州人，后来为了工作搬到芝加哥。"},{"en":"Many Iowans follow college basketball closely.","zh":"许多爱荷华州人很关注大学篮球。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Iowa or its people","zh":"爱荷华州的；与爱荷华州或其居民有关的"},"examples":[{"en":"Iowan farms produce a lot of corn and soybeans.","zh":"爱荷华州的农场出产大量玉米和大豆。"},{"en":"Iowan culture is often described as friendly and community-minded.","zh":"爱荷华州文化常被形容为友好、重视社区。"}]}],"synonyms":["Iowa resident","Hawkeye (informal)"],"phonetic":"/ˈaɪoʊən/","extraExplanation":["“Iowan”通常首字母大写（Iowan），因为它是专有名词（地名/族称）。","爱荷华州的昵称是“the Hawkeye State（鹰眼之州）”，所以有时会用非正式说法“a Hawkeye”指爱荷华州人（但在体育语境更常见，如爱荷华大学队名 Hawkeyes）。"]}
{"word":"iowans","summary":{"en":"“Iowans” means people from the U.S. state of Iowa.","zh":"“Iowans”指美国爱荷华州的人（爱荷华州居民）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who live in, come from, or are associated with the U.S. state of Iowa (plural of “Iowan”).","zh":"爱荷华州人；来自或与美国爱荷华州有关的人（“Iowan”的复数）。"},"examples":[{"en":"Many Iowans enjoy outdoor activities like fishing and hiking.","zh":"许多爱荷华州人喜欢钓鱼、徒步等户外活动。"},{"en":"The program offers scholarships to Iowans who want to study teaching.","zh":"这个项目为想学习师范的爱荷华州居民提供奖学金。"},{"en":"Iowans voted in the caucuses early in the election season.","zh":"爱荷华州人在选举季初期参加了党团会议投票。"}]}],"synonyms":["people from Iowa","Iowa residents"],"phonetic":"/ˈaɪoʊwənz/","extraExplanation":["“Iowan / Iowans”是美国州名 Iowa（爱荷华州）的居民称呼（demonym），在英文中通常要大写：Iowan, Iowans。","在美国政治新闻里，爱荷华州常因“党团会议（Iowa caucuses）”而被频繁提到，因此你会常看到“what Iowans think/said/voted”等表达。"]}
{"word":"iowt","summary":{"en":"“iowt” isn’t a standard word; it’s likely a typo or an unclear abbreviation (often intended as “IOW” = “in other words”).","zh":"“iowt”不是标准单词；很可能是拼写错误或不常见缩写（常见的应是“IOW”=“换句话说”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as an unclear or non-standard abbreviation/typo, sometimes intended to mean “IOW” (= in other words).","zh":"不是标准英语单词。它多半被当作不清楚的缩写或输入错误出现；有时可能是想写“IOW”（= in other words，意思是“换句话说”）。"},"examples":[{"en":"I’m not sure what “iowt” means here—did you mean “IOW” (in other words)?","zh":"我不太确定这里的“iowt”是什么意思——你是想写“IOW”（换句话说）吗？"},{"en":"IOW, we should leave early to avoid traffic.","zh":"换句话说，我们应该早点出发以避开交通。"}]}],"synonyms":["in other words","that is","to put it another way","i.e."],"phonetic":"/ˌaɪ.oʊˌdʌbəl.juˈti/","extraExplanation":["“IOW”是比较常见的网络简写，表示“in other words（换句话说）”。但“IOWT”并不常见、也不算固定用法，所以读者可能看不懂。","如果你告诉我你看到“iowt”的句子/上下文，我可以帮你判断它到底想表达什么，或推荐更自然的写法（比如：in other words / that is / i.e.）。"]}

