{"word":"IP","summary":{"en":"Either intellectual property or the Internet Protocol, depending on context.","zh":"常指“知识产权”或“互联网协议”，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"intellectual property: creations of the mind (such as inventions, books, music, designs, and brand names) that the law protects.","zh":"知识产权：指人的智力成果（如发明、书籍、音乐、设计、品牌等），并受法律保护。"},"examples":[{"en":"The company hired a lawyer to protect its IP before launching the new product.","zh":"公司在推出新产品前请了律师来保护其知识产权。"},{"en":"Sharing that software code online could violate someone’s IP.","zh":"把那段软件代码分享到网上可能会侵犯他人的知识产权。"}]},{"partOfSpeech":"n.","definition":{"en":"Internet Protocol: the set of rules that lets computers send data across the internet; commonly seen in “IP address.”","zh":"互联网协议：让计算机在互联网上传输数据的一套规则；常见于“IP 地址”。"},"examples":[{"en":"Your IP address can change when you restart the router.","zh":"重启路由器后，你的 IP 地址可能会变化。"},{"en":"The app uses IP to deliver data between servers.","zh":"这个应用通过互联网协议在服务器之间传输数据。"}]}],"synonyms":["intellectual property","copyright","patent","trademark","Internet Protocol"],"phonetic":"/ˌaɪˈpiː/","extraExplanation":["在商业/法律语境里，IP 多指“知识产权”（版权 copyright、专利 patent、商标 trademark 等都属于相关概念）。","在计算机/网络语境里，IP 多指“互联网协议”，最常见搭配是 IP address（IP 地址）。"],"etymology":"“IP”是英语中常见的首字母缩略词（initialism）：既可代表 intellectual property，也可代表 Internet Protocol。具体含义通常由语境决定。","mnemonic":["记成“Important Protection”：需要被保护的重要东西 → 常联想到知识产权（IP）。","看到“IP address/网络/路由器/router”等词时，IP 基本就是 Internet Protocol（互联网协议）。"]}
{"word":"ip","summary":{"en":"IP usually means either intellectual property (legal rights over creative works) or Internet Protocol (a core internet networking system).","zh":"IP 通常有两种常见含义：知识产权（对创作成果的法律权利）或互联网协议（网络通信的核心协议）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Intellectual property: creations of the mind (like inventions, designs, music, writing, and brand names) that the law protects (for example through patents, copyrights, and trademarks).","zh":"知识产权：指人的智力创作成果（如发明、设计、音乐、文字作品、品牌名称等），并受到法律保护（如专利、版权、商标等）。"},"examples":[{"en":"The company protects its IP with patents and trademarks.","zh":"这家公司用专利和商标来保护自己的知识产权。"},{"en":"Don’t copy the logo—it’s someone else’s IP.","zh":"不要抄那个标志——那是别人的知识产权。"}]},{"partOfSpeech":"n.","definition":{"en":"Internet Protocol: the set of rules used to send data across the internet; often seen in terms like IP address.","zh":"互联网协议：在互联网中传输数据的一套规则；常见于“IP 地址”等说法。"},"examples":[{"en":"Your device needs an IP address to connect to the internet.","zh":"你的设备需要一个 IP 地址才能连接到互联网。"},{"en":"The site blocked the user’s IP after too many failed logins.","zh":"登录失败次数太多后，该网站封禁了这个用户的 IP。"}]}],"synonyms":["intellectual property","Internet Protocol","IP address (related)"],"phonetic":"/ˌaɪˈpiː/","extraExplanation":["在商业与法律语境里，IP 常指“知识产权”，尤其在影视/游戏行业还会延伸为“IP 角色/世界观/系列”（例如“打造一个强 IP”），意思是可持续开发、可授权变现的内容资产。","在网络技术语境里，IP 几乎总是指 Internet Protocol（互联网协议）；注意不要与“IP 地址（地址本身）”混为一谈。"]}
{"word":"IPA","summary":{"en":"IPA usually means the International Phonetic Alphabet, a standard system for writing pronunciation.","zh":"IPA 通常指“国际音标”，是一套用于标注发音的标准符号系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the International Phonetic Alphabet: a system of symbols used to write down speech sounds (pronunciation) in a consistent way across languages","zh":"国际音标：一套用来记录语音（发音）的符号系统，可跨语言一致地标注发音"},"examples":[{"en":"Look up the word in a dictionary and check the IPA to learn the pronunciation.","zh":"在词典里查这个词，并查看 IPA 来学习它的发音。"},{"en":"In linguistics class, we used IPA symbols to describe English vowel sounds.","zh":"在语言学课上，我们用 IPA 符号来描述英语元音。"}]}],"synonyms":["International Phonetic Alphabet","phonetic alphabet (in linguistics)"],"phonetic":"/ˌaɪ piː ˈeɪ/","extraExplanation":["IPA 常见于词典（尤其是学习型词典）里的“发音栏”。例如 /kæt/ 表示 cat。不同词典可能也会用另一套标音（如美式词典常见的简化拼音），但 IPA 是更通用、更标准的写法。"]}
{"word":"iPad","summary":{"en":"iPad: Apple’s touchscreen tablet computer.","zh":"iPad：苹果的触控平板电脑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A brand of tablet computer made by Apple, with a touchscreen and the iPadOS operating system.","zh":"iPad：苹果公司推出的平板电脑品牌，采用触控屏并运行 iPadOS 系统。"},"examples":[{"en":"She takes notes on her iPad during class.","zh":"她上课时用 iPad 记笔记。"},{"en":"I read e-books on my iPad every night.","zh":"我每天晚上都用 iPad 看电子书。"}]}],"synonyms":["tablet","tablet computer"],"phonetic":"/ˈaɪˌpæd/","extraExplanation":["“iPad”是专有名词（品牌名），一般首字母大写。日常英语里也常被当作普通名词使用：an iPad / my iPad。","发音里重音通常在第二个音节（-PAD）。","相关表达：iPad Pro（更高端机型）、iPad Air、iPad mini；以及常见搭配如 iPad case（保护壳）、iPad charger（充电器）、iPad screen（屏幕）。"]}
{"word":"Ipai","summary":{"en":"Likely a proper name or acronym; meaning depends on context.","zh":"多半是专有名词或缩写；含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most often seen as a name, username, brand, or an acronym depending on context.","zh":"不是常见英语词典词条；更常见于名字、用户名、品牌名，或在特定语境中作为缩写使用。"},"examples":[{"en":"I couldn’t find “Ipai” in a standard English dictionary—could you share the sentence where you saw it?","zh":"我在常见英语词典里找不到“Ipai”，你能把看到它的句子发我吗？"},{"en":"“Ipai” may be a product name rather than a vocabulary word.","zh":"“Ipai”可能是产品名，而不是一般词汇。"}]}],"extraExplanation":["你是想查 “IPA”（国际音标）吗？如果你想要“英式/美式音标”，也可以把单词发我。","如果它是缩写（例如组织名/项目名），请告诉我它出现的领域：AI、医学、法律、学校、公司等。"],"etymology":"目前无法确定其词源；它更像专有名词/缩写。请提供上下文（句子、领域、是否全大写 IPAI）以便判断。"}
{"word":"ipalnemohuani","summary":{"en":"Ipalnemohuani is a Nahuatl sacred title meaning “the one by whom we live,” referring to the divine life-sustaining source in Aztec tradition.","zh":"Ipalnemohuani 是纳瓦特尔语的神圣尊称，意为“我们赖以生存者”，指阿兹特克传统中赐生并维系万物的神圣本源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Nahuatl) “the one by whom we live”; an honorific title for the divine life-giver in Aztec (Mexica) religion, often linked with the creator deity concept.","zh":"（纳瓦特尔语）“我们赖以生存者 / 赐生者”；阿兹特克（墨西加）宗教中对神圣生命赐予者的尊称，常与“创造神”的观念相关。"},"examples":[{"en":"In some readings of Aztec philosophy, Ipalnemohuani refers to the sacred source that sustains life.","zh":"在一些对阿兹特克哲学的解读中，Ipalnemohuani 指维系生命的神圣本源。"},{"en":"The poet-priests praised Ipalnemohuani as the giver of breath and daily survival.","zh":"诗人与祭司称颂 Ipalnemohuani 为赐予气息、让人得以日常生存的神圣存在。"}]}],"synonyms":["life-giver","the sustainer","creator (concept)"],"phonetic":"/iˌpɑlneɪmoʊˈwɑni/","extraExplanation":["Ipalnemohuani 来自纳瓦特尔语，常被解释为“我们赖以生存者/使我们得以活着者”。它更像一种神名或尊号，而不一定是单一、具有人格形象的“某位神”。","在一些学术与翻译传统中，它常被与 Ometeotl（“二元之神”）等概念并提，用来讨论阿兹特克思想里关于“创造/维系万物”的最高神圣原则。","拼写与发音在英文资料中可能有不同转写方式；学习时可把它当作外来专名，重点理解其文化含义。"]}
{"word":"IPC-related","summary":{"en":"connected with a particular IPC context","zh":"与特定语境中的 IPC 有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or concerning “IPC” (whatever “IPC” refers to in the given context).","zh":"与“IPC”有关的；涉及“IPC”的（具体含义取决于语境中 IPC 指什么）。"},"examples":[{"en":"We fixed an IPC-related bug in the messaging module.","zh":"我们修复了消息模块里一个与 IPC 相关的缺陷。"},{"en":"The report focuses on IPC-related regulations and compliance.","zh":"这份报告重点讨论与 IPC 相关的法规与合规要求。"}]}],"synonyms":["connected to IPC","associated with IPC","linked to IPC","IPC-associated","IPC-specific"],"phonetic":"/ˌaɪ piː ˈsiː rɪˈleɪtɪd/","extraExplanation":["“IPC”在不同领域含义不同，常见有：\n1) 计算机：Inter-Process Communication（进程间通信）；\n2) 专利：International Patent Classification（国际专利分类）；\n3) 人道援助：Integrated Food Security Phase Classification（粮食安全阶段分类，常简称 IPC）。\n阅读时可通过上下文（如 software/process/message、patent/classification、food security/humanitarian）判断具体所指。","写法上也常见：IPC related（不加连字符）、IPC-related（加连字符，更像复合形容词）、IPC-specific（更强调“专门针对 IPC”）。"],"etymology":"构词方式：首字母缩略词 “IPC” + related（“相关的”）。常用于技术与政策写作里，作定语说明“与 IPC 有关”。","mnemonic":["把它拆开记：IPC + related = “跟 IPC 有关系”。看到 related 就联想到中文“相关”。","连字符“-”像“把两段绑在一起”，表示“IPC 和 related 绑在一起当形容词用”。"]}
{"word":"ipecac","summary":{"en":"Ipecac is a (now rarely used) medicine that causes vomiting.","zh":"Ipecac（吐根制剂）是一种如今很少使用的催吐药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (from the ipecac plant) that was formerly used to make someone vomit, especially in cases of poisoning","zh":"吐根制剂（源自吐根植物；过去常用于催吐，尤其在中毒时）"},"examples":[{"en":"Years ago, some parents kept a bottle of ipecac at home in case a child swallowed something harmful.","zh":"多年前，一些家长会在家里备一瓶吐根制剂，以防孩子误吞有害物质。"},{"en":"Doctors now rarely recommend ipecac because safer, more effective treatments are available.","zh":"如今医生很少建议使用吐根制剂，因为有更安全、更有效的治疗方式。"}]}],"synonyms":["emetic","syrup of ipecac"],"phonetic":"/ˈɪpəˌkæk/","extraExplanation":["“Ipecac”常见于较老的英文资料、影视或回忆性叙述中；现代急救与中毒处理通常不再建议自行催吐，是否需要处理应联系毒物控制中心或专业医生。","词源来自葡萄牙语（与巴西原住民语言相关），原指一种可作药用的植物根。"]}
{"word":"ipecacs","summary":{"en":"Ipecacs are older ipecac-based medicines once used to induce vomiting.","zh":"ipecacs 指吐根（ipecac）制成的旧式药物，曾用于催吐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ipecac: a medicine (especially in the past) made from the ipecac plant root, used to cause vomiting and sometimes to treat coughs.","zh":"ipecac 的复数：由吐根（ipecac）植物根部制成的一种药物（过去更常见），曾用于催吐，有时也用于止咳。"},"examples":[{"en":"In older homes, you might find ipecacs in a medicine cabinet, but they are rarely recommended today.","zh":"在一些老房子里，你可能会在药柜里看到 ipecacs（吐根制剂），但如今几乎不再推荐使用。"},{"en":"The clinic stopped stocking ipecacs after medical advice changed.","zh":"随着医疗建议改变，这家诊所不再储备 ipecacs。"}]}],"synonyms":["syrup of ipecac (common phrase)","emetic (more general)"],"phonetic":"/ˈɪpəˌkæk/","extraExplanation":["“ipecac”常见于短语“syrup of ipecac（吐根糖浆）”。过去中毒时人们会用它催吐，但现代医学通常不建议自行催吐，更多强调立即联系中毒控制中心或急救服务，并遵循专业指导。","拼写提示：你写的“ipecacs”通常是 ipecac 的复数形式；单数更常见。也可能是拼写误差（如 ipecac / ipecacs）。"]}
{"word":"ipecacuanha","summary":{"en":"Ipecacuanha (ipecac) is a plant, or a medicine made from its root, traditionally used to induce vomiting.","zh":"ipecacuanha（吐根）指一种药用植物或其根制成的药物，传统上用于催吐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicinal plant (also called ipecac) whose roots were traditionally used to make a drug that causes vomiting (an emetic).","zh":"一种药用植物（也叫 ipecac/吐根），其根部传统上可制成催吐药（催吐剂）。"},"examples":[{"en":"In the past, syrup of ipecacuanha was kept in some homes for poison emergencies.","zh":"过去，一些家庭会备着吐根糖浆，以应对中毒紧急情况。"},{"en":"The doctor explained that ipecacuanha is no longer commonly recommended for most ingestions.","zh":"医生解释说，对于大多数误食情况，吐根如今已不再常被推荐使用。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine made from the root of the ipecacuanha plant, especially in the phrase “syrup of ipecac.”","zh":"由吐根（ipecacuanha）植物根部制成的药物，尤指“吐根糖浆（syrup of ipecac）”。"},"examples":[{"en":"The label warned that the syrup of ipecacuanha should only be used under medical advice.","zh":"标签警示：吐根糖浆应仅在医疗建议下使用。"},{"en":"He had heard of ipecacuanha as an old-fashioned remedy for inducing vomiting.","zh":"他听说过吐根是一种老式的催吐疗法。"}]}],"synonyms":["ipecac","syrup of ipecac","emetic"],"phonetic":"/ˌɪpəˌkækjuˈɑnə/","extraExplanation":["“ipecacuanha”常简写为“ipecac”。它在英语里多出现在医学/历史语境，尤其是“syrup of ipecac（吐根糖浆）”。","在美国等地，过去曾建议在某些中毒情况下使用吐根催吐；但现代中毒处理指南通常不建议常规使用（因可能造成误吸、延误正确处理等风险）。遇到误食/中毒更应联系毒物控制中心或急诊。","拼写较长且不常用，读写时可先记住核心词根“ipecac”，日常交流更常用它。"]}
{"word":"ipecacuanhic","summary":{"en":"Ipecacuanha (ipecac) is a medicine from a plant root, formerly used to make people vomit and sometimes used to loosen mucus.","zh":"Ipecacuanha（ipecac）是一种由植物根制成的药物，过去常用于催吐，有时也用于祛痰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in the phrase “syrup of ipecac”) a medicine made from the dried root of a South American plant, formerly used to cause vomiting (an emetic), and sometimes used in very small doses as an expectorant (to help cough up mucus).","zh":"（常见于短语“ipecac 糖浆 / syrup of ipecac”）一种由南美洲植物干燥根部制成的药物，过去常用来催吐（催吐剂），有时也以极小剂量作祛痰剂（帮助咳出痰）。"},"examples":[{"en":"In older first-aid guides, syrup of ipecac was sometimes recommended for certain poisonings.","zh":"在较早的急救指南中，ipecac 糖浆有时被建议用于某些中毒情况。"},{"en":"Today, most doctors advise against keeping ipecac at home for routine emergencies.","zh":"如今，多数医生不建议在家中常备 ipecac 来应对一般紧急情况。"}]}],"synonyms":["ipecac","syrup of ipecac","emetic (general term)"],"phonetic":"/ˌɪpəˈkækjuənə/","extraExplanation":["你输入的“ipecacuanhic”不是常见标准拼写；最常见的词形是 **ipecacuanha**（也写作 **ipecac**）。","历史上，ipecac 被用于让人呕吐，曾出现在家庭急救箱里；但现代医学通常不建议自行使用催吐剂，因为对多种毒物/误吞情况可能弊大于利，应优先联系毒物控制中心或医生。","词源与文化背景：ipecacuanha 来自葡萄牙语，进一步追溯到巴西土著语言（常被解释为“让人呕吐的植物”之类的意思）。在英语文学和影视中，它常作为“旧式家庭药/急救手段”的标志性道具出现。"]}
{"word":"iph","summary":{"en":"“IPH” is usually an abbreviation, most commonly meaning “inches per hour” (a rate, often rainfall).","zh":"“IPH”通常是缩写，最常见指“英寸/小时”（一种速率，常用于降雨强度）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) inches per hour; a unit used to measure a rate (especially rainfall intensity).","zh":"（缩写）英寸/小时；用于表示速率的单位（尤其常见于降雨强度）。"},"examples":[{"en":"The storm is producing rainfall of 2 IPH in some areas.","zh":"这场风暴在一些地区的降雨强度达到每小时2英寸（2 IPH）。"},{"en":"Flooding becomes more likely when the rain rate exceeds 1 IPH.","zh":"当降雨强度超过每小时1英寸（1 IPH）时，更容易发生洪水。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., medicine) used in some contexts for medical terms (e.g., forms of pulmonary hypertension); meaning depends on the document.","zh":"（缩写，医学）在一些语境中用于医学术语（如某些类型的肺动脉高压）；具体含义取决于文件/上下文。"},"examples":[{"en":"The chart lists IPH under the patient’s cardiopulmonary diagnoses.","zh":"病历在患者的心肺诊断中列出了 IPH。"},{"en":"Ask your doctor what IPH stands for in your report.","zh":"请询问医生你的报告里 IPH 具体指什么。"}]}],"synonyms":["in./hr","in/hr","inches per hour"],"phonetic":"/ˌaɪ piː ˈeɪtʃ/","extraExplanation":["“IPH”通常是首字母缩写，不是一个固定的普通英文单词。最常见的用法之一是在气象/水文里表示“inches per hour（英寸/小时）”。","在医学资料中，“IPH”可能指不同疾病名称的缩写，不同医院、论文或报告的写法也可能不同；如果你能提供一句原文或领域（气象/医学/工程等），我可以更精准地解释。"]}
{"word":"iphigenia","summary":{"en":"Iphigenia is a figure from Greek myth and tragedy, known as Agamemnon’s daughter connected to a near-sacrifice to Artemis and to Euripides’ plays.","zh":"Iphigenia（伊菲革涅亚）是希腊神话与悲剧人物，阿伽门农之女，因与献祭阿耳忒弥斯（及欧里庇得斯相关戏剧）而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A princess in Greek mythology, daughter of Agamemnon and Clytemnestra, who is (in many versions) almost sacrificed to the goddess Artemis so the Greek fleet can sail to Troy.","zh":"希腊神话中的公主，阿伽门农与克吕泰涅斯特拉之女；在许多版本中她几乎被献祭给女神阿耳忒弥斯，以换取希腊舰队顺利驶向特洛伊。"},"examples":[{"en":"In the myth, Agamemnon is told that only the sacrifice of Iphigenia will calm the winds.","zh":"在神话里，预言说只有献祭伊菲革涅亚才能平息风势。"},{"en":"Many retellings show Iphigenia facing her fate with courage.","zh":"许多改写版本描写伊菲革涅亚以勇气面对命运。"},{"en":"The story of Iphigenia is tied to the beginning of the Trojan War.","zh":"伊菲革涅亚的故事与特洛伊战争的开端密切相关。"}]},{"partOfSpeech":"n.","definition":{"en":"A character and title used in Greek tragedy and later literature, especially in Euripides’ plays “Iphigenia in Aulis” and “Iphigenia in Tauris.”","zh":"希腊悲剧及后世文学中常用的人物与题名，尤指欧里庇得斯的《在奥利斯的伊菲革涅亚》和《在陶里斯的伊菲革涅亚》。"},"examples":[{"en":"We read Euripides’ Iphigenia in Aulis to discuss duty and family.","zh":"我们阅读欧里庇得斯的《在奥利斯的伊菲革涅亚》，讨论责任与家庭。"},{"en":"In Iphigenia in Tauris, she serves as a priestess far from home.","zh":"在《在陶里斯的伊菲革涅亚》中，她远离故乡担任女祭司。"}]}],"synonyms":["mythological figure","Greek heroine","tragic heroine"],"phonetic":"/ˌɪfɪdʒəˈnaɪə/","extraExplanation":["“Iphigenia”常见发音为 /ˌɪfɪdʒəˈnaɪə/（美式）；中文常译作“伊菲革涅亚”。","故事核心常被用来讨论：权力者的选择、战争的代价、个人牺牲与道德两难。不同版本结局不一：有的说她被真正献祭，有的说阿耳忒弥斯在最后一刻救走她并以鹿替代。","文学与文化中常见用法：作者可能借“Iphigenia”象征“被当作代价的无辜者/为了集体目标被牺牲的人”。"]}
{"word":"iphimedia","summary":{"en":"“Iphimedia” is most likely a brand/company name related to media, not a common English word.","zh":"“Iphimedia”多半是与媒体相关的品牌/公司名，并非通用英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (brand or company name) used for a media-related business, product, or platform; not a standard dictionary word in general English.","zh":"专有名词（品牌或公司名），常用于媒体相关的企业、产品或平台；一般英语词典中并非常见词。"},"examples":[{"en":"Iphimedia produces short videos and social-media content for small businesses.","zh":"Iphimedia 为小型企业制作短视频和社交媒体内容。"},{"en":"Please contact Iphimedia’s support team if you have account issues.","zh":"如果你的账户有问题，请联系 Iphimedia 的客服团队。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˌaɪfiˈmiːdiə/","extraExplanation":["“Iphimedia”更可能是自造/品牌拼写，而不是普通英语词汇；具体含义取决于它出现的语境（公司官网、App 名称、邮箱域名、项目名等）。","读音通常按英语拼读拆分为 Iphi + media（media /ˈmiːdiə/）。如果你是想查别的词（如 ephemera, multimedia, media），也可以把句子发来，我可以帮你确认。"]}
{"word":"iphis","summary":{"en":"Iphis is a mythological name best known from Ovid’s *Metamorphoses*; it can refer to more than one character, so context matters.","zh":"Iphis（伊菲斯）是古典神话中的人名，最常见于奥维德《变形记》；它也可能指不同角色，因此需依上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"In Greek/Roman mythology (especially in Ovid’s *Metamorphoses*), a girl raised as a boy who is later transformed into a man so he can marry Ianthe.","zh":"希腊/罗马神话人物（尤见于奥维德《变形记》）：一个女孩被当作男孩抚养，后来被神明变为男子，从而得以与伊安忒（Ianthe）结婚。"},"examples":[{"en":"In Ovid’s *Metamorphoses*, Iphis is raised as a son to protect the family from punishment.","zh":"在奥维德《变形记》中，伊菲斯（Iphis）为了让家人免受惩罚，被当作儿子抚养。"},{"en":"The story of Iphis and Ianthe is often discussed in classes about myth and identity.","zh":"伊菲斯与伊安忒的故事常在讨论神话与身份议题的课程中出现。"}]},{"partOfSpeech":"other","definition":{"en":"Another mythological figure in Ovid: a man named Iphis who dies after being rejected by Anaxarete.","zh":"奥维德作品中的另一位神话人物：名叫伊菲斯（Iphis）的男子，因被阿纳克萨瑞忒（Anaxarete）拒绝而身亡。"},"examples":[{"en":"A different Iphis appears in myth as Anaxarete’s lover, whose death leads to her punishment.","zh":"神话中还有另一位伊菲斯，是阿纳克萨瑞忒的追求者；他的死亡引发她受到惩罚。"}]}],"phonetic":"/ˈaɪfɪs/","extraExplanation":["“Iphis”是一个古典神话中的专名，不同作品里可能指不同人物；学习时要看上下文（例如是否出现Ianthe或Anaxarete、是否在《变形记》中）。","伊菲斯与伊安忒的故事常被用来讨论“性别角色/社会期待”与“神话叙事如何处理身份与爱情”等主题；但在不同文化与课堂语境中，解读角度可能差异很大。"]}
{"word":"iPhone","summary":{"en":"iPhone: Apple’s smartphone brand.","zh":"iPhone：苹果公司的智能手机品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A brand of smartphone made by Apple, known for iOS, its camera, and its app ecosystem.","zh":"苹果公司推出的智能手机品牌，以 iOS 系统、相机功能和应用生态闻名。"},"examples":[{"en":"I bought a new iPhone last week.","zh":"我上周买了一部新的 iPhone。"},{"en":"Her iPhone takes very clear photos.","zh":"她的 iPhone 拍出来的照片很清晰。"}]}],"synonyms":["Apple smartphone","smartphone","cell phone","mobile phone"],"phonetic":"/ˈaɪˌfoʊn/","extraExplanation":["“iPhone”是苹果公司（Apple）在 2007 年发布的产品名，首字母 i 常被解释为 internet（互联网）、individual（个人）等营销含义，但更多是一种品牌命名风格。","在英语中通常写作 iPhone（小写 i + 大写 P），复数可写 iPhones。日常交流里也常直接说 “my phone”，不一定每次都说 iPhone。"]}
{"word":"ipid","summary":{"en":"IPID is most commonly the acronym for South Africa’s Independent Police Investigative Directorate, which investigates police misconduct.","zh":"IPID 最常见指南非“独立警察调查局”，负责调查警察不当行为等问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(acronym) Independent Police Investigative Directorate — a South African government body that investigates misconduct and criminal offenses involving the police.","zh":"（缩写）独立警察调查局（Independent Police Investigative Directorate）——南非负责调查警察不当行为与涉警犯罪的政府机构。"},"examples":[{"en":"The case was referred to IPID for an independent investigation.","zh":"该案件已移交 IPID 进行独立调查。"},{"en":"IPID released a report on allegations of police brutality.","zh":"IPID 发布了一份关于警方暴力指控的报告。"}]},{"partOfSpeech":"n.","definition":{"en":"(acronym, general) A set of letters used as an organization or technical abbreviation; the exact meaning depends on the field and country.","zh":"（缩写，泛指）作为机构或技术术语的字母缩写；具体含义取决于领域和国家/地区。"},"examples":[{"en":"In this article, IPID refers to a South African oversight agency.","zh":"在本文中，IPID 指的是南非的一个监督机构。"},{"en":"Always check the context to know what an acronym like IPID means.","zh":"遇到 IPID 这种缩写时，要根据上下文确认其含义。"}]}],"synonyms":["Independent Police Investigative Directorate","police oversight body","watchdog agency"],"phonetic":"ˌaɪ piː aɪ ˈdiː","extraExplanation":["“IPID”在南非新闻与法律语境中最常见。它的职责类似一些国家的“警察内部/外部监督调查机构”，常见于涉及执法问责（accountability）、警察暴力（police brutality）、羁押死亡（death in custody）等话题。","发音通常按字母逐个读：I-P-I-D。写作时一般全大写。"]}
{"word":"ipidae","summary":{"en":"Ipididae is an older taxonomic name for bark beetles, often reclassified today under Scolytinae within Curculionidae.","zh":"Ipididae 是樹皮甲蟲的舊式分類名稱；現今多改歸在象鼻蟲科中的 Scolytinae。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(taxonomy) A former scientific family name for bark beetles; in many modern classifications these beetles are treated as a subfamily (Scolytinae) within the weevil family (Curculionidae).","zh":"（分類學）樹皮甲蟲的一個舊式科名；在許多現代分類中，這一類群多被歸為象鼻蟲科（Curculionidae）中的一個亞科（Scolytinae）。"},"examples":[{"en":"Some older forestry books refer to bark beetles as the family Ipididae.","zh":"一些較舊的林業書會把樹皮甲蟲稱作 Ipididae 這個科。"},{"en":"In newer sources, many species once placed in Ipididae are listed under Scolytinae (Curculionidae).","zh":"在較新的資料中，許多曾歸入 Ipididae 的物種會列在 Curculionidae（象鼻蟲科）的 Scolytinae（亞科）之下。"}]}],"synonyms":["bark beetles","Scolytinae"],"phonetic":"/ˌɪpɪˈdaɪdi/","extraExplanation":["你輸入的「ipidae」很可能是拼寫少了一個 d 的「Ipididae」。這是拉丁化的分類名稱，通常用於學術文章、昆蟲學或林業病蟲害資料中。","分類名稱常會隨研究更新而調整，所以在查資料時，建議同時用「Ipididae」與「Scolytinae」作為關鍵字交叉搜尋，以免漏掉新舊文獻。"]}
{"word":"ipil","summary":{"en":"Ipil is a tropical hardwood tree (and its wood) from the Philippines/Southeast Asia, known for strength and durability.","zh":"Ipil指菲律宾/东南亚的一种热带硬木树（也指其木材），以坚硬耐用著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical hardwood tree (common in the Philippines and Southeast Asia), valued for its strong, durable wood","zh":"一种热带硬木树（常见于菲律宾及东南亚），木材坚硬耐用、很受重视"},"examples":[{"en":"The old house had ipil posts that were still solid after decades.","zh":"那栋老房子的立柱用的是ipil木，几十年后依然很结实。"},{"en":"Ipil is sometimes used for flooring because it resists wear.","zh":"ipil木有时用来做地板，因为很耐磨。"}]},{"partOfSpeech":"n.","definition":{"en":"the wood of the ipil tree, used in construction and furniture","zh":"ipil树的木材（常用于建筑和家具）"},"examples":[{"en":"They chose ipil for the door frame to make it more durable.","zh":"他们选用ipil木做门框，让它更耐用。"},{"en":"The table is made from ipil, a heavy, long-lasting hardwood.","zh":"这张桌子用ipil木制成，是一种厚重、耐用的硬木。"}]}],"synonyms":["hardwood","tropical hardwood","merbau (trade name, sometimes related)"],"phonetic":"ˈiːpɪl","extraExplanation":["“Ipil”是菲律宾常见的树名之一，也经常直接指这种木材本身。在木材贸易或英文资料中，你也可能看到它与“merbau”等近似或相关的商品名一起出现（不同地区命名与分类可能不完全一致）。"]}
{"word":"ipil-ipil","summary":{"en":"a fast-growing tropical fodder tree (Leucaena leucocephala)","zh":"一种热带速生的饲料树（银合欢）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fast-growing tropical tree (Leucaena leucocephala) whose leaves and seed pods are often used as animal fodder, green manure, and firewood; in some places it can become invasive","zh":"银合欢（Leucaena leucocephala），一种热带速生树；叶与豆荚常作饲料、绿肥或薪柴，但在部分地区可能成为入侵物种"},"examples":[{"en":"Farmers plant ipil-ipil as a quick source of fodder for goats.","zh":"农民种植银合欢，作为山羊的快速饲料来源。"},{"en":"Because ipil-ipil grows so quickly, it can spread beyond farms into nearby fields.","zh":"由于银合欢生长很快，它可能从农田扩散到附近地块。"},{"en":"The village uses dried ipil-ipil branches for firewood.","zh":"村里用晒干的银合欢枝条当柴火。"}]}],"synonyms":["leucaena","lead tree","white leadtree"],"phonetic":"ˌɪpɪlˈɪpɪl","extraExplanation":["在东南亚与热带地区很常见：可固氮、改良土壤，因此也被用于防风固沙与绿肥；但因繁殖力强，在部分国家/地区被列为需要控制的外来入侵植物。","“ipil-ipil”是地方名；在学术、农业资料里更常见学名 Leucaena leucocephala 或英文名 lead tree。"],"etymology":"来自菲律宾语（常见为他加禄语等南岛语系语言）名称 ipil-ipil；英文中多作为该树的地方俗名使用。","mnemonic":["把它想成“一直一批一批（ipil-ipil）长出来的树”——强调它长得快、繁殖力强。","联想“叶子可以喂（喂→wèi）”动物：银合欢常被当作饲料树。"]}
{"word":"ipilipil","summary":{"en":"Ipil-ipil is a tropical tree (Leucaena leucocephala) used for fodder, fuel, shade, and soil improvement, but it can be invasive in some places.","zh":"Ipil-ipil 指银合欢（一种热带树），常用于饲料、燃料、遮荫与改良土壤，但在一些地区可能具有入侵性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tropical tree (Leucaena leucocephala) with feathery leaves and seed pods, often grown for fodder (animal feed), firewood, shade, and soil improvement; sometimes considered invasive outside its native area","zh":"银合欢（一种热带小乔木，学名 Leucaena leucocephala），叶子呈羽状复叶、结荚果；常用于饲料、柴火、遮荫与改良土壤；在原生地以外有时被视为入侵植物"},"examples":[{"en":"In some tropical farms, ipil-ipil is planted to provide fodder for goats.","zh":"在一些热带农场里，人们会种植银合欢（ipil-ipil）来给山羊提供饲料。"},{"en":"The roadside was lined with ipil-ipil trees, but locals worried they were spreading too fast.","zh":"路边种着一排银合欢（ipil-ipil），但当地人担心它们蔓延得太快。"}]}],"synonyms":["leucaena","lead tree","Leucaena leucocephala"],"phonetic":"/ˌiːpɪlˈiːpɪl/","extraExplanation":["“ipil-ipil”常见于菲律宾与东南亚语境，名称来自当地语言的称呼；英语中也常直接借用该词。","它在农林复合经营（agroforestry）中很常见：生长快、可固氮、耐修剪，因此被用来当绿肥、篱笆或防风树。","在部分地区由于繁殖力强，可能挤压本地植物生长；写作或口语中可根据语境补充“(a type of leucaena/lead tree)”帮助听者理解。"]}
{"word":"ipl","summary":{"en":"“IPL” most commonly refers to the Indian Premier League (cricket). In computing (especially IBM/mainframe), it can also mean Initial Program Load (system boot).","zh":"“IPL”最常见指印度板球超级联赛；在计算机领域（尤其IBM/大型机）也可指初始程序装入（系统启动/引导）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Indian Premier League: a professional men’s Twenty20 cricket league in India (often written as “the IPL”).","zh":"印度板球超级联赛：印度的职业男子T20（Twenty20）板球联赛（常写作“IPL”）。"},"examples":[{"en":"The IPL attracts top cricket players from around the world.","zh":"IPL吸引了来自世界各地的顶级板球选手。"},{"en":"My friends stay up late to watch IPL matches.","zh":"我的朋友们会熬夜看IPL比赛。"},{"en":"He supports Mumbai Indians in the IPL.","zh":"他在IPL里支持孟买印第安人队。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing, mainly IBM/mainframe) Initial Program Load: the process of starting a computer system by loading an operating system into memory; similar to “booting.”","zh":"（计算机领域，主要用于IBM/大型机）初始程序装入：把操作系统装入内存以启动系统的过程；类似“引导/启动”。"},"examples":[{"en":"After the update, the server required an IPL to restart properly.","zh":"更新后，服务器需要进行一次IPL才能正常重启。"},{"en":"The technician ran an IPL to load the operating system.","zh":"技术员执行IPL来加载操作系统。"}]}],"synonyms":["Indian Premier League","Initial Program Load","boot (computing)"],"phonetic":"/ˌaɪ piː ˈɛl/","extraExplanation":["在体育语境里，“the IPL”通常默认指印度板球超级联赛。它是T20赛制（每队20局）的联赛，以节奏快、娱乐性强、商业化程度高而出名。","在IT语境里，“IPL”多见于IBM大型机或相关文档，含义接近更通用的“boot（启动）”。具体指哪一个，通常看上下文：聊比赛、球队、球员=板球；聊服务器、操作系统、重启=计算机。"]}
{"word":"ipm","summary":{"en":"“IPM” is an abbreviation. Common meanings: “in a private message” (online) and “Integrated Pest Management” (pest control).","zh":"“IPM”是缩写，常见意思包括：网络用语“在私信里”，以及害虫防治领域的“综合虫害管理”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(online) “in a private message” — used to say you will send details privately instead of posting publicly.","zh":"（网络用语）“在私信里”——表示会把信息私下发给对方，而不是公开发布。"},"examples":[{"en":"I’ll send you the address IPM.","zh":"我把地址私信发你（IPM）。"},{"en":"Can you explain the problem IPM? It’s too long for the comments.","zh":"你能私信跟我解释一下吗？评论区写太长了。"}]},{"partOfSpeech":"other","definition":{"en":"Integrated Pest Management — a way of controlling pests by using a mix of methods (monitoring, prevention, and limited pesticides) to reduce harm to people and the environment.","zh":"综合虫害管理——用多种方法（监测、预防、必要时少量用药等）来控制害虫，尽量降低对人和环境的影响。"},"examples":[{"en":"The farm uses IPM to reduce pesticide use.","zh":"这家农场使用综合虫害管理（IPM）来减少农药使用。"},{"en":"IPM starts with monitoring insects before spraying anything.","zh":"综合虫害管理（IPM）会先监测虫情，再决定是否需要喷药。"}]}],"synonyms":["PM","DM (in some platforms)","Integrated Pest Management (spelled out)"],"phonetic":"/ˌaɪ pi ˈɛm/","extraExplanation":["“IPM”是缩写，不同领域意思差很多。聊天/论坛里常见的是“in a private message（私信里）”，多写成IPM或PM；而农业、园艺、公共卫生等语境里更常指“Integrated Pest Management（综合虫害管理）”。看上下文（是否在讨论私聊/地址，还是在讨论害虫/农药）最关键。"]}
{"word":"IPO","summary":{"en":"IPO means “initial public offering,” the first public sale of a company’s shares.","zh":"IPO指“首次公开募股”，即公司首次向公众出售股票并进入公开市场交易。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Initial Public Offering: the first time a private company sells shares to the public on a stock exchange (or public market)","zh":"首次公开募股：一家私人公司第一次向公众出售股份并在证券交易所（或公开市场）上市融资"},"examples":[{"en":"The company raised $500 million in its IPO.","zh":"这家公司通过IPO筹集了5亿美元。"},{"en":"After years as a private firm, they filed for an IPO.","zh":"作为私营公司多年后，他们提交了IPO申请。"},{"en":"The IPO price was set at $18 per share.","zh":"IPO发行价定为每股18美元。"}]}],"synonyms":["initial public offering","public offering","stock market debut","flotation"],"phonetic":"/ˌaɪ piː ˈoʊ/","extraExplanation":["IPO通常意味着公司“上市”。常见流程包括：选择承销商（投行）、准备招股说明书、路演（向投资者介绍公司）、定价与配售、挂牌交易。","IPO后公司的股票会在公开市场交易，公司的信息披露与监管要求也会显著增加。","口语中也常说“go public（上市）”来表达进行IPO或成为上市公司。"]}
{"word":"ipocras","summary":{"en":"Ipocras is a historical (medieval) spiced, sweetened wine, often written as “hippocras.”","zh":"Ipocras 指一种中世纪的香料甜酒（常见拼写为 hippocras）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medieval spiced, sweetened wine (usually red), often filtered and served warm or at room temperature; a historical drink similar to mulled wine","zh":"（中世纪的）香料甜酒（通常为红酒），常经过过滤，可温热或常温饮用；一种类似热红酒的历史饮品"},"examples":[{"en":"At the medieval fair, they served ipocras with cinnamon and ginger.","zh":"在中世纪集市上，他们供应加了肉桂和姜的 ipocras（香料甜酒）。"},{"en":"The recipe calls for wine, honey, and warm spices to make ipocras.","zh":"这个配方用葡萄酒、蜂蜜和暖香料来做 ipocras。"}]}],"synonyms":["hippocras","spiced wine","mulled wine"],"phonetic":"/ˈhɪpəˌkræs/","extraExplanation":["Ipocras 更常见的拼写是 hippocras（英法中古文本中常见），来源与“希波克拉底（Hippocrates）”相关：传统做法会用一种被称为“希波克拉底袖（Hippocrates’ sleeve）”的布袋/滤袋来过滤香料渣，因此得名。","它在中世纪欧洲常见于宴会与节庆场合，既是饮品也带有“助消化、暖身”的民间观念。现代英语里属于历史/文学语境用词，日常更常说 spiced wine 或 mulled wine。","在英文文学与历史写作中，你可能会在描写骑士、宫廷宴会或修道院生活的段落里遇到 hippocras/ipocras。"]}
{"word":"IPod","summary":{"en":"iPod: Apple’s portable digital music player; sometimes used informally to mean any MP3 player.","zh":"iPod：苹果的便携式数字音乐播放器；有时也被非正式地用来泛指 MP3 播放器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small portable digital music player made by Apple, used to store and play audio (and on some models, video).","zh":"苹果公司推出的一种便携式数字音乐播放器，用来存储并播放音频（部分型号也可播放视频）。"},"examples":[{"en":"I used to listen to music on my iPod on the bus.","zh":"我以前坐公交时会用 iPod 听音乐。"},{"en":"She loaded podcasts and audiobooks onto her iPod.","zh":"她把播客和有声书导入了她的 iPod。"}]},{"partOfSpeech":"n.","definition":{"en":"A general term some people use for any portable music player (informal, by extension).","zh":"（引申、非正式）有些人用来泛指任何便携式音乐播放器的说法。"},"examples":[{"en":"My dad calls every MP3 player an “iPod.”","zh":"我爸把所有 MP3 播放器都叫“iPod”。"}]}],"synonyms":["MP3 player","digital audio player","portable music player"],"phonetic":"/ˈaɪpɑd/","extraExplanation":["“iPod”是 Apple 的商标名，写法通常是小写 i + 大写 P（iPod）。口语中人们有时会把它当作泛称，但在正式写作里更建议用“MP3 player / digital audio player”来泛指。","iPod 系列在 2000 年代非常流行，也推动了数字音乐、iTunes 与播客（podcast）的普及；“podcast”这个词就与 iPod 的流行有历史关联。"]}
{"word":"iPod","summary":{"en":"An Apple portable media player; sometimes used informally for any MP3 player.","zh":"苹果的便携式音乐/多媒体播放器；有时也被非正式地用来泛指 MP3 播放器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small portable music (and media) player made by Apple, used to store and play digital audio files.","zh":"苹果公司出品的便携式音乐（及多媒体）播放器，用来储存并播放数字音频文件。"},"examples":[{"en":"I used to listen to podcasts on my iPod during my commute.","zh":"我以前通勤时会用 iPod 听播客。"},{"en":"She kept all her favorite songs on an iPod.","zh":"她把所有喜欢的歌都存到一台 iPod 里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Any small MP3 player, even if it is not made by Apple.","zh":"（非正式）泛指任何小型 MP3 播放器，即使不是苹果出品。"},"examples":[{"en":"He called it an iPod, but it was actually a different brand.","zh":"他把它叫作 iPod，但其实是别的牌子。"}]}],"synonyms":["portable music player","MP3 player","digital audio player"],"phonetic":"ˈaɪpɑd","extraExplanation":["“iPod”是苹果（Apple）的品牌名，通常首字母 i 小写、Pod 大写。很多时候人们会把它当作“MP3 播放器”的代称，但严格来说它指苹果的 iPod 产品线。","iPod 在 2000 年代非常流行，后来被智能手机逐渐取代；苹果已陆续停产大多数型号（iPod touch 也已停产），但在英语里它仍常用来指代那类便携播放器或一种时代记忆。"]}
{"word":"ipod","summary":{"en":"An Apple-made portable digital music player.","zh":"苹果推出的便携式数字音乐播放器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small portable music player made by Apple (first released in 2001) that stores and plays digital audio files (and later, videos and apps on some models)","zh":"iPod：苹果公司推出的便携式音乐播放器（2001年首次发布），用于存储并播放数字音频文件（部分后期机型也可播放视频、运行简单应用）"},"examples":[{"en":"I used to listen to music on my iPod during my commute.","zh":"我以前通勤时会用 iPod 听音乐。"},{"en":"She found her old iPod and it still had playlists from high school.","zh":"她找到了旧 iPod，里面还保留着高中时的歌单。"}]}],"synonyms":["MP3 player (general term)","digital music player"],"phonetic":"/ˈaɪpɑːd/","extraExplanation":["iPod 属于专有名词（品牌名），常写作 iPod；口语里也有人把它当作“任何MP3播放器”的泛称，但严格来说指苹果的产品。","在流行文化里，iPod 常与 2000 年代的“下载音乐/数字音乐时代”联系在一起；后来智能手机普及后，iPod 的日常使用减少，但仍是一个具有时代感的词。"]}
{"word":"ipomea","summary":{"en":"Ipomoea is the plant genus that includes many morning glories and the sweet potato.","zh":"Ipomoea 指牵牛花属，包含多种牵牛花以及红薯/甘薯等植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants that includes many kinds of morning glories and the sweet potato (Ipomoea batatas)","zh":"牵牛花属（旋花科的一属开花植物），包括许多牵牛花类植物以及甘薯/红薯（Ipomoea batatas）"},"examples":[{"en":"Morning glories belong to the genus Ipomoea.","zh":"牵牛花属于牵牛花属（Ipomoea）。"},{"en":"The sweet potato is a species of Ipomoea.","zh":"甘薯（红薯）是牵牛花属（Ipomoea）的一种。"}]}],"synonyms":["morning glory (common name for many Ipomoea plants)","sweet potato (a species: Ipomoea batatas)"],"phonetic":"/ˌaɪpəˈmiːə/","extraExplanation":["你写的“ipomea”常见拼写应为 **Ipomoea**（属名通常首字母大写，斜体书写在学术文章中更常见）。","**Ipomoea** 是拉丁化的植物学命名：在日常英语里，人们更常说 **morning glory（牵牛花）** 或 **sweet potato（红薯/甘薯）**，而不是属名。","发音提示：重音通常在“ME”-这一音节（-MEE-）上。"]}
{"word":"Ipomoea","summary":{"en":"a plant genus that includes many morning glories and the sweet potato","zh":"包含多種牽牛花與甘薯的植物屬"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of twining or trailing flowering plants in the morning glory family, including many species called morning glories and the sweet potato","zh":"旋花科的一個植物屬，多為藤本或匍匐生長，常見的「牽牛花／朝顏」多屬於此，甘薯（地瓜）也屬於此屬"},"examples":[{"en":"Ipomoea includes many garden morning glories with trumpet-shaped flowers.","zh":"Ipomoea（番薯屬）包含許多園藝常見的牽牛花，花朵多呈喇叭狀。"},{"en":"The sweet potato is Ipomoea batatas.","zh":"甘薯（地瓜）的學名是 Ipomoea batatas。"},{"en":"Some Ipomoea species spread quickly and can become invasive.","zh":"有些 Ipomoea 物種蔓延很快，可能成為入侵植物。"}]}],"synonyms":["morning glory","sweet potato"],"phonetic":"/ˌaɪ.pəˈmiː.ə/","extraExplanation":["Ipomoea 是植物學上的「屬名」，寫作時通常斜體且首字母大寫（Ipomoea）。在科學寫作中，屬名後常接種小名，如 Ipomoea purpurea（紫牽牛）、Ipomoea batatas（甘薯）。","日常英語裡，人們更常用 common name（俗名）如 morning glory（牽牛花）或 sweet potato（甘薯）；但在學術、園藝標示與檢索資料時，Ipomoea 更精確。"],"etymology":"源自新拉丁語（學名用語），由希臘語詞根組合而來：ips（「蠕蟲」）+ homoios（「相似的」），可能用來比喻其纏繞蔓生的莖像蠕蟲般延伸。","mnemonic":["用諧音記：Ipomoea ≈「愛爬米呀」→ 這類植物很會「爬」（纏繞蔓生）。","聯想「morning glory（牽牛花）」：常見的牽牛花很多都屬於 Ipomoea。"]}
{"word":"ipomoea","summary":{"en":"Ipomoea is the botanical genus name for morning glories and related climbing plants, including the sweet potato.","zh":"Ipomoea 是牵牛花属的植物学属名，包括牵牛花及其近缘攀援植物，也包含甘薯（红薯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of twining or climbing plants in the morning glory family (Convolvulaceae), known for funnel-shaped flowers; it includes the sweet potato and many ornamental morning glories.","zh":"牵牛花属（旋花科）的一个植物属，多为缠绕或攀援植物，常开漏斗状花；其中包括甘薯（红薯）以及许多观赏牵牛花。"},"examples":[{"en":"Ipomoea includes many garden morning glories with bright blue or purple flowers.","zh":"牵牛花属包含许多园艺牵牛花，花色常见亮蓝或紫色。"},{"en":"The sweet potato is Ipomoea batatas.","zh":"甘薯（红薯）的学名是 Ipomoea batatas。"}]}],"synonyms":["morning glory (common name for many species)","sweet potato (for Ipomoea batatas)"],"phonetic":"/ˌaɪpəˈmiːə/","extraExplanation":["“Ipomoea”是植物学拉丁名，常见于学名（如 *Ipomoea purpurea* 紫牵牛、*Ipomoea batatas* 甘薯）。日常英语里更常说 **morning glory**（牵牛花）或 **sweet potato**（红薯），而“ipomoea”多用于学术、园艺标签、植物图鉴。","词源来自希腊语构词，常被解释为与其“缠绕蔓生”的生长习性有关（许多种会绕着支架或其他植物攀爬）。"]}
{"word":"ipomoeas","summary":{"en":"Ipomoeas are plants in the genus Ipomoea, commonly known as morning glories (and including the sweet potato).","zh":"ipomoeas 指旋花属（Ipomoea）的植物，常见为牵牛花/喇叭花类，也包括甘薯（红薯/地瓜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plants in the genus Ipomoea (morning glories), including some important species such as the sweet potato.","zh":"旋花属（Ipomoea）的植物（常称“牵牛花/喇叭花”一类），其中包括一些重要物种，如甘薯（红薯/地瓜）。"},"examples":[{"en":"Ipomoeas are often grown for their trumpet-shaped flowers.","zh":"旋花属植物常因其喇叭状花朵而被栽培。"},{"en":"Some ipomoeas climb quickly and can cover a fence in summer.","zh":"有些旋花属植物攀爬很快，夏天能爬满篱笆。"},{"en":"The sweet potato is one of the best-known ipomoeas.","zh":"甘薯（红薯/地瓜）是旋花属中最有名的植物之一。"}]}],"synonyms":["morning glories","Ipomoea (genus)"],"phonetic":"/ˌaɪpəˈmiːə/","extraExplanation":["“Ipomoeas”是“ipomoea”的复数形式；在园艺语境里常泛指“牵牛花/喇叭花类”藤本。","旋花属既有观赏植物（如常见的牵牛花），也有重要作物（甘薯）；所以遇到该词时，可根据上下文判断是指“花”还是“作物相关的物种”。"]}
{"word":"ipomoein","summary":{"en":"Ipomoein is a resin-glycoside compound found in some morning glory (Ipomoea) plants.","zh":"Ipomoein 是一种存在于部分牵牛花属（Ipomoea）植物中的树脂糖苷类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a type of resin glycoside) found in some morning glory plants (genus Ipomoea), studied mainly in pharmacology and plant chemistry","zh":"一种化学化合物（树脂糖苷类），存在于一些牵牛花属（Ipomoea）植物中，主要在药理学与植物化学研究中出现"},"examples":[{"en":"Researchers isolated ipomoein from an Ipomoea species to study its biological activity.","zh":"研究人员从某种牵牛花属植物中分离出 ipomoein，以研究其生物活性。"},{"en":"Ipomoein is mentioned in papers on the resin glycosides of morning glory relatives.","zh":"在关于牵牛花近缘植物“树脂糖苷”的论文中会提到 ipomoein。"}]}],"synonyms":["resin glycoside (general term)","natural product (general term)"],"phonetic":"/ˌaɪpəˈmiːɪn/","extraExplanation":["词源提示：Ipomoein 这个名称来自植物属名 Ipomoea（牵牛花属）+ 常见化学后缀 -in（常用于给某类物质/化合物命名）。","使用场景：该词多见于学术论文、化学成分分析、天然产物与药理研究中，日常英语里几乎不会用到。"]}
{"word":"Ippolit","summary":{"en":"a Russian male given name (variant of Hippolytus).","zh":"俄语男性名（Hippolytus 的变体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name used mainly in Russian and some other Slavic-language contexts (a form of “Hippolytus”).","zh":"男性名字，主要见于俄语及部分斯拉夫语语境中（相当于“Hippolytus/希波吕托斯”的一种形式）。"},"examples":[{"en":"Ippolit is an old-fashioned Russian first name, so you may see it in classic novels.","zh":"Ippolit 是较古典、带年代感的俄语男性名，所以你可能在经典小说里见到它。"},{"en":"In the story, Ippolit speaks with surprising honesty about illness and death.","zh":"在故事里，Ippolit 以出人意料的坦诚谈论疾病与死亡。"}]}],"synonyms":["Hippolytus","Hippolyte"],"phonetic":"/ɪˈpɑːlɪt/","extraExplanation":["在英语阅读中，你可能在陀思妥耶夫斯基《白痴》（The Idiot）里遇到 Ippolit（有译作“伊波利特/伊波利特”等）。不同译本会因为转写体系不同而出现拼法差异。"],"etymology":"来自俄语人名 Ипполит（Ippolit），对应拉丁语 Hippolytus，源于古希腊语 Hippolytos；传统解释常与“马（hippos）”相关，整体为古希腊人名的音译/转写形式。","mnemonic":["把它当作“希波吕托斯 Hippolytus”的俄语版：Hippolytus → Ippolit（开头的 Hip- 变成 Ip-，整体更短）。","联想中文常见译名“伊波利特”：I-ppo-lit ≈ 伊-波-利-特（按音节记忆）。"]}
{"word":"IPR","summary":{"en":"IPR most commonly means intellectual property rights; in U.S. patent law it can also mean inter partes review.","zh":"IPR最常指“知识产权权利”；在美国专利法语境中也可指“双方复审”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"intellectual property rights: legal rights that protect creations of the mind (such as inventions, brand names, designs, music, books, and software).","zh":"知识产权（IP）权利：用于保护智力成果（如发明、商标、外观设计、音乐、书籍、软件等）的法律权利。"},"examples":[{"en":"The company filed patents to strengthen its IPR in the new technology.","zh":"公司申请了专利来强化其在这项新技术上的知识产权（IPR）。"},{"en":"Respecting IPR helps creators earn money from their work.","zh":"尊重知识产权有助于创作者从作品中获得收益。"},{"en":"The contract includes an IPR clause about who owns the software code.","zh":"合同中包含一条知识产权条款，规定软件代码归谁所有。"}]},{"partOfSpeech":"n.","definition":{"en":"Inter Partes Review: a U.S. Patent and Trademark Office (USPTO) process that allows someone to challenge the validity of an issued patent.","zh":"双方复审：美国专利商标局（USPTO）的一种程序，允许他人对已授权专利的有效性提出挑战。"},"examples":[{"en":"The competitor requested an IPR to challenge the patent claims.","zh":"竞争对手提出双方复审（IPR），以挑战该专利的权利要求。"},{"en":"If the IPR is instituted, the patent owner must defend the patent at the USPTO.","zh":"如果双方复审被立案，专利权人就必须在USPTO为该专利进行抗辩。"}]}],"synonyms":["intellectual property rights","IP rights","intellectual property (IP)"],"phonetic":"ˌaɪ piː ˈɑr","extraExplanation":["“IPR”通常出现在商业、法律与科技语境中，很多时候是“intellectual property rights”的总称；日常对话里更常直接说“IP”或“IP rights”。","在美国专利法律语境里，“IPR”也常专指“Inter Partes Review（双方复审）”。看文件时可以通过搭配词判断含义：如“IPR clause / licensing / infringement”多为知识产权权利；如“file/request/institute an IPR at the USPTO”多为双方复审。"]}
{"word":"ipr","summary":{"en":"IPR most commonly means intellectual property rights (legal protection for creative work and inventions).","zh":"IPR 最常指知识产权（权），即对创作与发明等成果的法律保护。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"intellectual property rights; the legal rights that protect creations such as inventions, brands, writing, music, and designs (often used in business and law).","zh":"知识产权（权）；保护发明、商标、文字作品、音乐与设计等创作成果的法律权利（多用于商业与法律语境）。"},"examples":[{"en":"The company strengthened its IPR to protect its new technology.","zh":"公司加强了知识产权保护，以保护其新技术。"},{"en":"Teachers reminded students to respect IPR and not copy articles without permission.","zh":"老师提醒学生要尊重知识产权，不要未经许可复制文章。"},{"en":"IPR disputes can happen when two brands use similar logos.","zh":"当两个品牌使用相似标志时，可能会发生知识产权纠纷。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a technical abbreviation used in specific fields (e.g., computing or engineering), where the exact meaning depends on the context.","zh":"（较少见）在特定技术领域（如计算机或工程）中的缩写；具体含义取决于上下文。"},"examples":[{"en":"In this document, IPR refers to a register in the processor.","zh":"在这份文件中，IPR 指处理器中的某个寄存器。"},{"en":"If you’re unsure what IPR means here, check the glossary or earlier definitions.","zh":"如果你不确定这里 IPR 的意思，可以查看术语表或前文定义。"}]}],"synonyms":["intellectual property rights","IP rights"],"phonetic":"/ˌaɪ piː ˈɑr/","extraExplanation":["在日常与职场英语里，IPR 最常指 intellectual property rights（知识产权/知识产权权利）。常见相关词：patent（专利）、copyright（版权/著作权）、trademark（商标）、trade secret（商业秘密）。","读作字母：I-P-R。写作时常见于合同、公司政策、学术诚信说明与跨境电商平台规则（如“IPR complaint/claim”表示知识产权投诉/申诉）。"]}
{"word":"ipratropium","summary":{"en":"Ipratropium is an inhaled bronchodilator medicine that helps open the airways and makes breathing easier, commonly used for COPD.","zh":"Ipratropium（异丙托溴铵）是一种常用的吸入性支气管扩张药，帮助打开气道、改善呼吸，常用于慢阻肺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (often inhaled) that relaxes the muscles in the airways, making breathing easier; used for conditions like COPD and sometimes asthma","zh":"一种药物（常以吸入方式使用），可放松气道平滑肌、扩张支气管，从而帮助呼吸；常用于慢阻肺（COPD），有时也用于哮喘"},"examples":[{"en":"My doctor prescribed ipratropium to help with my COPD symptoms.","zh":"医生给我开了异丙托溴铵来缓解我的慢阻肺症状。"},{"en":"In the emergency room, she was given a nebulizer treatment with ipratropium.","zh":"在急诊室里，她通过雾化吸入使用了异丙托溴铵治疗。"},{"en":"Ipratropium can reduce wheezing and shortness of breath for some patients.","zh":"对一些患者来说，异丙托溴铵可以减轻喘鸣和气短。"}]}],"synonyms":["bronchodilator (category)","anticholinergic (category)"],"phonetic":"/ˌɪprəˈtroʊpiəm/","extraExplanation":["“Ipratropium”在医学英语中是通用名（generic name），常见商品名包括 Atrovent。中文常译为“异丙托溴铵”。","它属于“抗胆碱药/抗毒蕈碱药”（anticholinergic/antimuscarinic）一类支气管扩张剂：通过阻断乙酰胆碱在气道的作用来减少支气管收缩和分泌物。","常见剂型：吸入气雾剂（inhaler）、雾化溶液（nebulizer solution）、鼻喷剂（nasal spray，用于流鼻涕等）。不同剂型用途不同。","常见不适包括口干、喉咙刺激、咳嗽；若药液进入眼睛，可能诱发眼部不适或加重青光眼风险。用药方式与禁忌需遵医嘱。"]}
{"word":"iproniazid","summary":{"en":"Iproniazid is an early MAOI antidepressant, now rarely used due to serious safety and interaction risks.","zh":"异丙烟肼是一种早期MAOI类抗抑郁药，因安全性与相互作用风险较高而现已较少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug (an antidepressant) that inhibits monoamine oxidase (MAOI); it was one of the first medicines used to treat depression but is now rarely used because it can cause serious side effects and dangerous food/drug interactions","zh":"异丙烟肼；一种单胺氧化酶抑制剂（MAOI）类抗抑郁药。它曾是最早用于治疗抑郁的药物之一，但因副作用较大以及与食物/药物相互作用风险高，如今很少使用"},"examples":[{"en":"Iproniazid was an early MAOI used to treat depression.","zh":"异丙烟肼是早期用于治疗抑郁症的单胺氧化酶抑制剂。"},{"en":"Because of safety concerns, doctors rarely prescribe iproniazid today.","zh":"由于安全性方面的担忧，如今医生很少开具异丙烟肼。"}]}],"synonyms":["MAOI (class term)","monoamine oxidase inhibitor (class term)"],"phonetic":"/aɪˈproʊniəˌzɪd/","extraExplanation":["异丙烟肼最初与结核病治疗相关，后来观察到患者情绪改善，促成了现代抗抑郁药物研究的发展，被视为精神药理学早期的重要里程碑之一。","MAOI类药物（包括异丙烟肼）可能与含酪胺较高的食物（如部分陈年奶酪、腌制/发酵食品等）产生危险相互作用；具体饮食与用药限制必须遵医嘱。","词源提示：-zid/-azid等结尾常见于药物名称；学习时可把它当作专有药名记忆，不必强行拆分。"]}
{"word":"IPRs","summary":{"en":"IPRs means intellectual property rights—legal protections for creations like inventions, works, software, and brands.","zh":"IPRs 指知识产权，即对发明、作品、软件与品牌等创作成果的法律保护权利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"intellectual property rights (legal rights that protect creations such as inventions, books, music, software, designs, and brand names)","zh":"知识产权（保护发明、作品、软件、设计、商标等创作成果的法律权利）"},"examples":[{"en":"The company licensed its IPRs to a partner in Asia.","zh":"这家公司把其知识产权授权给了亚洲的一家合作伙伴。"},{"en":"Strong IPRs can encourage innovation by protecting new ideas.","zh":"健全的知识产权制度可以通过保护新点子来鼓励创新。"}]}],"synonyms":["IP rights","intellectual property rights","intellectual property (IP)"],"phonetic":"ˌaɪ piː ˈɑːrz","extraExplanation":["IPRs 是 intellectual property rights 的缩写，常见于商业、科技、法律与国际贸易文件中（如合同、政策、WTO/TRIPS 相关讨论）。","常见类别包括：专利（patents）、版权（copyrights）、商标（trademarks）、商业秘密（trade secrets）。不同国家/地区的保护期限与执法力度可能不同，因此跨境合作时常会专门写“IPRs clause（知识产权条款）”。","读法上通常按字母读：I-P-Rs；写作中也常见单数 IPR 或更直白的 IP rights。"]}
{"word":"ips","summary":{"en":"IPS is commonly an acronym for a cybersecurity Intrusion Prevention System or a display technology called In-Plane Switching; it can also mean multiple IP addresses (“IPs”).","zh":"IPS 常见含义是网络安全的“入侵防御系统”，或显示器技术“平面转换（IPS 面板）”；也可指多个 IP 地址（IPs）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing, cybersecurity) Intrusion Prevention System: a security tool that monitors network traffic and automatically blocks malicious activity.","zh":"（计算机/网络安全）入侵防御系统：监控网络流量并自动阻止恶意活动的安全工具。"},"examples":[{"en":"Our company installed an IPS to block suspicious traffic in real time.","zh":"我们公司部署了 IPS 来实时阻止可疑流量。"},{"en":"The IPS detected the attack and dropped the malicious packets.","zh":"IPS 检测到攻击并丢弃了恶意数据包。"}]},{"partOfSpeech":"n.","definition":{"en":"(tech, displays) In-Plane Switching: a type of LCD screen technology known for better color accuracy and wider viewing angles (often called an “IPS panel”).","zh":"（科技/显示器）平面转换（IPS）：一种 LCD 屏幕技术，以更好的色彩表现和更广的可视角度著称（常说“IPS 面板/IPS 屏”）。"},"examples":[{"en":"This monitor uses an IPS panel, so the colors look consistent from the side.","zh":"这台显示器用的是 IPS 面板，所以从侧面看颜色也比较一致。"},{"en":"For photo editing, many people prefer IPS displays.","zh":"做修图时，很多人更偏好 IPS 屏幕。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of IP (Internet Protocol) address; different “IPs” means different network addresses.","zh":"IP（互联网协议）地址的复数；不同的“IPs”指不同的网络地址。"},"examples":[{"en":"The logs show multiple IPs trying to access the account.","zh":"日志显示有多个 IPs 尝试登录这个账号。"},{"en":"We blocked those IPs after repeated failed login attempts.","zh":"多次登录失败后，我们把那些 IPs 屏蔽了。"}]}],"synonyms":["intrusion prevention system","IPS panel","IP addresses"],"phonetic":"/ˌaɪ piː ˈɛs/","extraExplanation":["“IPS”在英语里通常作为缩写使用：网络安全领域最常见的是 Intrusion Prevention System；数码/显示器领域常指 In-Plane Switching（IPS 面板）。在网络语境里写“IPs”时，多数人指多个 IP 地址。具体含义要看上下文（如安全设备、显示器参数、服务器日志等）。"]}
{"word":"ipse","summary":{"en":"Ipse is a Latin term used in English mainly in academic contexts meaning “self” or “the very person/thing.”","zh":"Ipse 是拉丁语词，在英语中多见于学术语境，意思是“自我/本人/正是那位（那件）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in English writing) “self,” “himself,” or “the person/thing in question,” often to emphasize identity.","zh":"（拉丁语；用于英语写作）“自身/本人/正是那位（那件）”，常用于强调身份或“就是那一个”。"},"examples":[{"en":"In some scholarly writing, ipse is used to stress “the self” as an idea.","zh":"在一些学术写作中，ipse 用来强调“自我”这一概念。"},{"en":"The author contrasts ipse (self) with what society expects from a person.","zh":"作者把 ipse（自我）与社会对个人的期待作对比。"}]}],"synonyms":["self","oneself","the very person","the person himself"],"phonetic":"/ˈɪp.si/","extraExplanation":["ipse 是拉丁语代词/强调用语，字面义接近“本人/正是他”。在英语中它通常只出现在哲学、神学、古典学等语境里，不算日常词汇。","常见相关表达：ipse dixit（“他本人如此说”，意为“权威断言/不容置疑的说法”），在讨论“只因权威说了就相信”的论证方式时会出现。","在哲学里还可能看到 ipseity（源自 ipse），指“自性/自我性/自我同一性”等概念。"]}
{"word":"ipseand","summary":{"en":"“ipseand” is not a recognized English word; it’s probably a typo or nonstandard text.","zh":"“ipseand”不是常见英语单词，更可能是拼写错误或非标准文本。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a typo, username, or a misheard/misspelled term. If you tell me the sentence or what you meant to type, I can identify the intended word (e.g., “ipstand”/“iPad”/“inspire and …” etc.).","zh":"不是标准英语单词；更可能是拼写错误、用户名，或听错/打错的词。如果你提供原句或想表达的意思，我可以帮你找出你真正想要的单词。"},"examples":[{"en":"I can’t find “ipseand” in a dictionary—could you share the full sentence?","zh":"我在词典里找不到“ipseand”——你能把完整句子发我吗？"},{"en":"Did you mean a different word, like “instead” or something similar?","zh":"你是不是想写别的词，比如“instead（而不是）”或类似的词？"}]}],"phonetic":"/ˈɪp.si.ænd/","extraExplanation":["“ipseand”看起来像把两个片段连在一起的输入（例如手滑少打了空格/字母）。如果你告诉我：1）它出现的句子；2）你想表达的中文意思；3）是否来自游戏ID/品牌/缩写，我就能更准确地判断你要查的词。","如果你其实想查拉丁语“ipse”（意思是“他自己/本身”，有时用于英语学术语境），也可以告诉我，我能按拉丁词源给你解释。"]}
{"word":"ipsedixitish","summary":{"en":"“Ipsedixitish” means ‘asserted like an ipse dixit’—accepted because an authority says it, not because it’s proven.","zh":"“ipsedixitish”表示“带有权威式断言的”：因为权威这么说就被接受，而不是因为有证据证明。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Having the character of an “ipse dixit”: stated as true just because someone important says so, without evidence or explanation.","zh":"（非正式）带有“ipse dixit（权威式断言）”的味道：因为权威人物这么说就被当成真理，但缺少证据或论证。"},"examples":[{"en":"The article felt a bit ipsedixitish—lots of claims, but no data to back them up.","zh":"这篇文章有点“权威式断言”的感觉——主张很多，但没有数据支撑。"},{"en":"When a boss gives an ipsedixitish order, it can shut down honest discussion.","zh":"当老板下达一种“我说了算”的命令时，往往会扼杀真诚的讨论。"},{"en":"Her explanation wasn’t ipsedixitish; she showed sources and walked us through the reasoning.","zh":"她的解释并不是“我说了算”；她给出了来源，并带我们一步步看推理过程。"}]}],"synonyms":["dogmatic","authoritarian","unsubstantiated","unsupported","because-I-said-so"],"phonetic":"/ˌɪpseɪ ˈdɪksɪt ɪʃ/","extraExplanation":["“ipse dixit”是拉丁语，字面意思是“他本人说的”。英语里常用来批评一种论证方式：把权威的话当作结论本身，而不是提供证据。","“ipsedixitish”是把“ipse dixit”加上英语形容词后缀“-ish”（表示“有点……的、带……风格的”）构成的非正式说法，带有轻微讽刺或批评语气。","更常见的相关表达有：“because I said so”（因为我说了算）、“an appeal to authority”（诉诸权威，常指逻辑谬误）、“unsupported assertion”（缺乏依据的断言）。"]}
{"word":"ipsedixitism","summary":{"en":"Ipse dixitism means treating a claim as true just because an authority says it, without evidence.","zh":"Ipse dixitism 指“因为权威这么说就当真”，缺少证据与论证的武断做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or practice of asserting something as true simply because an authority (or the speaker) says so, without providing evidence or reasoning; a dogmatic appeal to authority.","zh":"“凭权威一句话就算数”的习惯或做法：仅因为权威（或说话者本人）这么说，就把某事当作真理，而不给出证据或推理；带有武断的“诉诸权威”。"},"examples":[{"en":"In science, ipse dixitism is a problem because claims need evidence, not just reputation.","zh":"在科学中，“ipsedixitism（凭权威断言）”是个问题，因为主张需要证据，而不是只靠名气。"},{"en":"The manager’s ipse dixitism shut down discussion: “Do it this way because I said so.”","zh":"经理的“凭权威断言”让讨论直接终止：“就按我说的做。”"},{"en":"Good teachers avoid ipse dixitism and explain the reasons behind rules.","zh":"好的老师会避免“凭权威断言”，而是解释规则背后的理由。"}]}],"synonyms":["dogmatism","appeal to authority","authoritarianism","unsupported assertion","say-so"],"phonetic":"/ˌɪpseɪ ˈdɪksɪtˌɪzəm/","extraExplanation":["词源来自拉丁语短语 **ipse dixit**，字面意思是“他本人说的”。历史上常用来指某些学派（常被提到的是毕达哥拉斯学派）把某位大师的话当作无需证明的权威结论。英语里 **ipse dixit** 可作名词，指“武断的断言/权威之言”；加上 **-ism** 形成 **ipse dixitism**，强调这种“以权威代替论证”的倾向或作风。","在写作或辩论中，这个词常用来批评一种思维方式：把“谁说的”当成证据，而不是关注“为什么成立”。与常见的逻辑谬误“诉诸权威（appeal to authority）”含义相近。"]}
{"word":"ipsedixitist","summary":{"en":"An ipse dixitist is someone who insists something is true just because an authority said it, not because there is evidence.","zh":"ipse dixitist 指那种“因为权威说了就算数”、缺少证据却坚持其为真的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who treats an authority’s statement as unquestionably true, without evidence; someone who relies on an “ipse dixit” (a dogmatic assertion).","zh":"把权威的话当作不容质疑的真理、而不提供证据的人；依赖“权威断言/我说了算”（ipse dixit）的人。"},"examples":[{"en":"He argued like an ipse dixitist, repeating what his professor said instead of giving reasons.","zh":"他像个“权威断言主义者”一样争辩，只重复教授的话，却不给出理由。"},{"en":"The committee rejected her proposal because it sounded ipse dixitist: strong claims, little proof.","zh":"委员会否决了她的提案，因为听起来像“凭权威就下结论”：主张很强，却几乎没有证据。"},{"en":"Good science avoids ipse dixitist thinking and asks for data and methods.","zh":"好的科学会避免“权威式的想当然”，而是要求数据和方法。"}]}],"synonyms":["dogmatist","authoritarian thinker","appeal-to-authority arguer","doctrinaire"],"phonetic":"/ˌɪp.si ˈdɪk.sɪ.tɪst/","extraExplanation":["这个词很少见，通常用来批评一种论证方式：只因“某个重要人物说过/我说了算”就当作结论成立，而不去检验证据。\n\n“ipse dixit”是拉丁语，字面意思是“他本人说的”。传统上常与古希腊毕达哥拉斯学派联系在一起：据说门徒会用“老师说的”来终结争论。现代英语里它常指“诉诸权威（appeal to authority）式的武断断言”。"]}
{"word":"ipseity","summary":{"en":"Ipseity means selfhood—the quality of being oneself, especially discussed in philosophy, psychology, or literature.","zh":"Ipseity 指“自我性/自我同一性”，强调一个人作为“自己”的独特存在与持续的自我感，多用于哲学、心理学或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being oneself; one’s unique selfhood or identity","zh":"自我性；自我同一性（作为“我自己”的独特存在/身份）"},"examples":[{"en":"The novel explores ipseity through a narrator who keeps questioning who he really is.","zh":"这部小说通过一个不断追问“我到底是谁”的叙述者来探讨自我性。"},{"en":"In therapy, she tried to rebuild her sense of ipseity after years of being told what to be.","zh":"在治疗中，她试着在多年被他人定义之后重建自己的自我同一感。"}]},{"partOfSpeech":"n.","definition":{"en":"(philosophy) the sense of self that stays the same across time, even as experiences and roles change","zh":"（哲学）即使经历与社会角色改变，仍持续保持的“自我”感"},"examples":[{"en":"Some philosophers argue that memory plays a key role in ipseity.","zh":"一些哲学家认为记忆在自我同一性中起关键作用。"},{"en":"Her diaries show how her ipseity remained stable despite moving to a new country.","zh":"她的日记显示，即使移居他国，她的自我同一感仍相对稳定。"}]}],"synonyms":["selfhood","selfness","individuality","personal identity","sense of self"],"phonetic":"/ɪpˈsiːəti/","extraExplanation":["“ipseity”较少用于日常口语，更常见于哲学、心理学与文学批评中，用来谈论“作为自己”的独特性与连续性。","词源来自拉丁语 ipse（“自己、本人”）。因此它强调的是“我之为我”的性质，而不只是一般的 identity（身份/认同）。","在现象学与存在主义语境里，ipseity 常与 alterity（他者性）对照：一个人如何经验到“我”以及“非我/他者”。"]}
{"word":"ipsilateral","summary":{"en":"Ipsilateral means “on the same side of the body.”","zh":"ipsilateral 指“同侧的（在身体同一侧）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"On the same side of the body (or of a structure) as something else.","zh":"（解剖/医学）与另一结构或病变位于身体（或器官）的同一侧。"},"examples":[{"en":"The patient reported pain in the ipsilateral knee after the ankle injury.","zh":"脚踝受伤后，病人说同侧膝盖也疼。"},{"en":"Weakness was found in the ipsilateral arm and leg.","zh":"在同侧的手臂和腿部发现了无力。"}]}],"synonyms":["same-side","on the same side"],"phonetic":"/ˌɪp.səˈlæt̬.ɚ.əl/","extraExplanation":["“ipsi-”来自拉丁语，意思是“同一/自身”；“lateral”与“侧”有关。所以 ipsilateral 字面意思就是“同一侧的”。在医学影像、神经学和外科描述中很常见，用来精确定位症状或病变的位置。","常与 contralateral（对侧的）一起使用：例如“右侧脑卒中可能导致左侧（contralateral）肢体无力”，但也有情况会描述为“同侧（ipsilateral）症状”，取决于神经通路与具体病变位置。"]}
{"word":"ipsilaterally","summary":{"en":"Ipsilaterally means “on the same side of the body.”","zh":"ipsilaterally 意为“在身体同一侧（同侧地）”，多用于医学/解剖语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"On the same side of the body as something else (often used in medicine or anatomy).","zh":"（常用于医学/解剖学）在身体的同一侧；同侧地。"},"examples":[{"en":"The patient reported pain ipsilaterally, on the same side as the injury.","zh":"患者描述疼痛为同侧痛，即在受伤的同一侧。"},{"en":"The reflex causes ipsilaterally controlled muscles to contract.","zh":"该反射会使同侧控制的肌肉收缩。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that affects or relates to the same side (contrasted with contralaterally, the opposite side).","zh":"以影响或关联同一侧的方式（与 contralaterally“对侧地”相对）。"},"examples":[{"en":"Damage to this area can produce symptoms that appear ipsilaterally.","zh":"该区域受损可能导致症状出现在同侧。"},{"en":"The surgeon approached ipsilaterally to avoid crossing critical structures.","zh":"外科医生选择从同侧入路，以避免跨越关键结构。"}]}],"synonyms":["on the same side","on the ipsilateral side"],"phonetic":"/ˌɪp.sɪˈlæt.ə.rəl.i/","extraExplanation":["词源拆解：ipsi- 来自拉丁语，意为“同一/自身”；lateral 来自“侧面”。合起来就是“同侧地”。","常见搭配：ipsilateral pain（同侧疼痛）、ipsilateral limb（同侧肢体）、ipsilateral lesion（同侧病灶）。在医学报告或影像学描述中很常见。","对比记忆：ipsilateral = 同侧；contralateral = 对侧。两者常成对出现，用来描述症状、神经通路或病灶位置。"]}
{"word":"ipso","summary":{"en":"“Ipso” is a Latin-based word used mostly in set phrases (especially “ipso facto”), meaning “by that very fact; by itself.”","zh":"“ipso”是源自拉丁语的词，主要出现在固定短语（尤其“ipso facto”）中，表示“正因为该事实；本身就/就其本身而言”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, used in English mainly in set phrases) “by that very fact; by itself.” Most often seen in “ipso facto.”","zh":"（拉丁语借词，多用于固定短语）“正因为那个事实；本身就/就其本身而言”。最常见于短语“ipso facto”。"},"examples":[{"en":"He resigned, and was ipso facto no longer the team leader.","zh":"他辞职了，因此（ipso facto）不再是团队负责人。"},{"en":"The rule doesn’t say that being late is ipso facto a failure.","zh":"规定并没有说迟到就必然（ipso facto）算失败。"}]}],"synonyms":["per se","by itself","therefore (in “ipso facto” contexts)"],"phonetic":"ˈɪpsoʊ","extraExplanation":["“ipso”来自拉丁语代词“ipse”（意为“他/她/它自己、那个本身”）的一个格变化形式。在英语里几乎不单独使用，而是保留在法律、学术或正式文体的固定搭配中。","常见搭配：\n- ipso facto：因此、就事实本身而言（常带“自动导致”的语气）\n- ipso jure：依法、依法律本身\n这些表达在法律写作中较常见，日常英语更常用“therefore / as a result / automatically / by itself”等。"]}
{"word":"IPX","summary":{"en":"IPX most commonly refers to a water-resistance rating in the IP code where dust protection is unspecified (X). It can also mean an older networking protocol: Internetwork Packet Exchange.","zh":"IPX 最常见指 IP 防护等级中“只标注防水、未标注防尘（X）”的写法；也可指一种较旧的网络协议：Internetwork Packet Exchange（IPX）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(electronics/product ratings) Used in an IP (Ingress Protection) code to show a device’s water-resistance level when dust protection is not specified (e.g., IPX7).","zh":"（电子产品/防护等级）用于 IP（防护等级）代码中，表示设备的防水等级；其中 X 表示未标注防尘等级（如 IPX7）。"},"examples":[{"en":"These earbuds are rated IPX7, so they can handle being dropped in water briefly.","zh":"这款耳机是 IPX7 等级，所以短时间掉进水里一般也能承受。"},{"en":"IPX4 means it resists splashes, but it isn’t meant for swimming.","zh":"IPX4 表示可防泼溅，但不适合游泳时使用。"}]},{"partOfSpeech":"other","definition":{"en":"(computing, older) Internetwork Packet Exchange, a network protocol used mainly with Novell NetWare.","zh":"（计算机/较旧）Internetwork Packet Exchange（网际数据包交换协议），主要用于 Novell NetWare 等旧式网络系统。"},"examples":[{"en":"That company’s legacy system once used IPX instead of TCP/IP.","zh":"那家公司以前的旧系统曾用 IPX 而不是 TCP/IP。"}]}],"synonyms":["IP rating (in the waterproof sense)","Internetwork Packet Exchange (full form)"],"phonetic":"aɪ piː ɛks","extraExplanation":["在防护等级里常见的格式是 IP +（防尘数字）+（防水数字）。比如 IP67：6 是防尘，7 是防水。写成 IPX7 时，X 不代表“更高级”，只是表示“没有提供防尘等级”。","生活中谈到手机、耳机、运动手表的“IPX”时，几乎都是在讲防水/防泼溅；而计算机网络里的 IPX 属于历史性术语，现在多数环境已由 TCP/IP 取代。"]}

