{"word":"IQ","summary":{"en":"IQ is a test-based number intended to represent general intelligence (intelligence quotient).","zh":"IQ 指通过测验得到、用来表示一般智力水平的分数（智力商数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a number meant to show someone’s general intelligence, usually measured by standardized tests; short for “intelligence quotient.”","zh":"智商（智力商数）：用标准化测验得出的分数，旨在表示一个人的一般认知能力。"},"examples":[{"en":"His IQ score was above average, but he still had to study hard.","zh":"他的智商分数高于平均水平，但他仍然需要努力学习。"},{"en":"Some employers avoid using IQ tests because they can be unfair or misleading.","zh":"有些雇主避免使用智商测试，因为它们可能不公平或具有误导性。"}]}],"synonyms":["intelligence quotient","IQ score","intelligence test score"],"phonetic":"/aɪˈkjuː/","extraExplanation":["“IQ”来自短语“intelligence quotient（智力商数）”，早期用于把人的测试表现与同年龄平均水平进行比较。","在现代心理学与教育中，IQ更多被看作对某些认知能力（如逻辑推理、语言、空间能力）的近似测量，并不能完整代表创造力、情商、动机或社会能力。","日常表达中，人们有时会用“high IQ/low IQ”来夸奖或贬低别人；在跨文化交流里，为了礼貌与准确，建议谈具体能力或表现（e.g., problem-solving skills）而不是直接评价“智商”。"]}
{"word":"iq","summary":{"en":"IQ is a test-based score (intelligence quotient) used to estimate cognitive ability.","zh":"IQ 指“智商”（智力商数），是一种基于测验的分数，用来估计认知能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A number intended to show a person’s ability to think, learn, and solve problems, based on a standardized test (short for “intelligence quotient”).","zh":"智商；智力测验分数（“intelligence quotient”的缩写），通常用标准化测验来表示一个人的学习与解决问题能力。"},"examples":[{"en":"Her IQ score was above average, but she also worked very hard.","zh":"她的智商分数高于平均水平，但她也非常努力。"},{"en":"IQ tests don’t measure every kind of intelligence, like creativity or emotional skills.","zh":"智商测试并不能衡量所有类型的智力，比如创造力或情绪能力。"}]}],"synonyms":["intelligence quotient","IQ score"],"phonetic":"/ˌaɪˈkjuː/","extraExplanation":["“IQ”来自“intelligence quotient（智力商数）”。在日常英语里，人们也会用它泛指“聪明程度”，但这样用有时会显得以分数评判他人，可能不够礼貌或不够全面。","更中性、常见的表达：smart（聪明的）、quick learner（学得快的人）、good at problem-solving（善于解决问题）。"]}
{"word":"iqal","summary":{"en":"Likely a typo, name, or context-specific acronym rather than a common English word.","zh":"更可能是拼写错误、专名或特定语境的缩写，并非常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a typo, a proper name, or an acronym used in a specific field.","zh":"不是常见英语词典里的标准词；更可能是拼写错误、专有名词（人名/地名/产品名）或某个领域的缩写。"},"examples":[{"en":"I couldn’t find “iqal” in an English dictionary—could you share the sentence it appears in?","zh":"我在英语词典里找不到“iqal”——你能把它出现的句子发我吗？"},{"en":"If “IQAL” is an acronym, its meaning depends on the context (school, work, software, etc.).","zh":"如果“IQAL”是缩写，它的含义会取决于语境（学校、工作、软件等）。"}]}],"extraExplanation":["你可以告诉我：它是大写还是小写（IQAL vs iqal）？来自哪里（文章、聊天、课程、软件界面）？出现的完整句子是什么？我就能更准确判断它是缩写、拼写错误，还是外来词/专名。"],"etymology":"“iqal”本身没有稳定的英语词源记录；若写作大写“IQAL”，更像是不同机构/项目自定义的缩写。"}
{"word":"IQR-related","summary":{"en":"related to the interquartile range used in statistics","zh":"与统计学中的四分位距有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with the interquartile range (IQR), a statistic that measures the spread of the middle 50% of data.","zh":"与四分位距（IQR）有关的；指用来描述数据中间50%分散程度的统计量相关的。"},"examples":[{"en":"We used an IQR-related rule to identify outliers in the dataset.","zh":"我们用与IQR相关的规则来识别数据集中的离群值。"},{"en":"The report focuses on IQR-related measures rather than the standard deviation.","zh":"这份报告重点讨论与IQR相关的指标，而不是标准差。"},{"en":"IQR-related summaries are often preferred when the data are skewed.","zh":"当数据偏态时，往往更偏好使用与IQR相关的汇总方式。"}]}],"synonyms":["interquartile-range-related","quartile-based","IQR-based"],"phonetic":"/ˌaɪ kjuː ˈɑr rɪˈleɪtɪd/","extraExplanation":["IQR（四分位距）= Q3 − Q1，表示中间50%数据的范围。常见的“1.5×IQR规则”用来找离群值：小于 Q1−1.5×IQR 或大于 Q3+1.5×IQR 的点通常被视为离群点。"],"etymology":"“IQR”是 *interquartile range*（四分位距）的缩写；“related”表示“相关的”。合起来常用于统计学语境，指“与四分位距有关的”。","mnemonic":["把 IQR 记成“1/4（quartile，四分位）+ range（范围）”，所以 IQR-related 就是“跟四分位范围有关的”。","联想箱线图（box plot）：箱体长度就是 IQR；看到箱线图就想到 IQR-related 指标。"]}
{"word":"iqs","summary":{"en":"IQs means the plural of IQ, referring to intelligence quotient scores or (informally) people’s intelligence levels.","zh":"IQs 是 IQ 的复数，指智商分数，或（非正式）指人的智力水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of IQ: intelligence quotient scores (numbers from tests meant to estimate cognitive ability).","zh":"IQ 的复数：智商分数（用测试得出的数字，用来估计认知能力）。"},"examples":[{"en":"The study compared the students’ IQs over a ten-year period.","zh":"这项研究比较了学生们十年间的智商分数。"},{"en":"People can have different IQs but still succeed in different ways.","zh":"人们的智商分数可能不同，但仍然可以用不同方式取得成功。"}]},{"partOfSpeech":"n.","definition":{"en":"informal: levels of intelligence (often used casually, not as a precise measure).","zh":"非正式：智力水平（常用于口语化表达，不一定指严格的测量）。"},"examples":[{"en":"Their IQs are off the charts, but they still need teamwork to finish the project.","zh":"他们聪明得不得了，但完成项目仍然需要团队合作。"},{"en":"Don’t judge someone’s IQs from one mistake.","zh":"别因为一次失误就评判别人的智力水平。"}]}],"synonyms":["intelligence","smarts","brainpower"],"phonetic":"/aɪ kjuː/","extraExplanation":["“IQ”是“intelligence quotient（智力商数/智商）”的缩写；在英文里写作“IQs”表示复数，读法通常是 /aɪ kjuːz/（日常交流中也有人直接说“IQs”）。","文化与语用提醒：在很多英语语境里，单用IQ来评价一个人可能显得武断或不礼貌；现代教育/职场更常强调“skills（技能）”“emotional intelligence/EQ（情商）”“grit（韧性）”“creativity（创造力）”等更全面的能力。"]}

