{"word":"ix","summary":{"en":"IX most commonly means the Roman numeral 9.","zh":"IX 最常见的含义是罗马数字9。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the Roman numeral for nine (9).","zh":"罗马数字“IX”，表示数字9。"},"examples":[{"en":"The chapter is labeled IX.","zh":"这一章标为“IX”。"},{"en":"He wrote IX instead of 9 on the clock face.","zh":"他在钟面上写了“IX”，而不是9。"}]},{"partOfSpeech":"other","definition":{"en":"a common abbreviation in titles for “International” or “Information Exchange,” depending on context (less common in everyday English).","zh":"在标题或名称中常见的缩写，可能表示“International（国际）”或“Information Exchange（信息交换）”，具体含义取决于语境（日常英语中较少见）。"},"examples":[{"en":"Please check what IX stands for in this company’s name.","zh":"请确认这家公司名称里的“IX”代表什么。"},{"en":"In some project documents, IX may mean “information exchange.”","zh":"在一些项目文件中，IX 可能指“信息交换”。"}]}],"synonyms":["9","nine (when written in Roman numerals)"],"phonetic":"/aɪks/","extraExplanation":["“IX”是罗马数字体系的一部分，采用“减法规则”：I（1）放在X（10）前面表示10−1=9。常见的还有IV（4）、XL（40）、CM（900）等。"]}
{"word":"ixia","summary":{"en":"Ixia is a flowering plant (African corn lily), often grown for its delicate, star-shaped blooms.","zh":"Ixia 指一种观赏开花植物（非洲玉米百合），以细长花茎和星形小花著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the iris family (Iridaceae), known for slender stems and star-shaped flowers; often grown as an ornamental (common name: African corn lily).","zh":"鸢尾科（Iridaceae）的一属开花植物，茎细长、花多呈星形，常作观赏花卉（俗称“非洲玉米百合”）。"},"examples":[{"en":"Ixia blooms in late spring and does best in full sun.","zh":"Ixia 常在晚春开花，在充足日照下长得最好。"},{"en":"The florist added pink ixia to the bouquet for a light, airy look.","zh":"花艺师在花束里加入粉色 ixia，让整体更轻盈清爽。"}]}],"synonyms":["African corn lily","wandflower"],"phonetic":"/ˈɪksiə/","extraExplanation":["发音提示：在英语里常读作“IK-see-uh”。","词源小知识：Ixia 是植物学拉丁名，来自古典语言传统的命名方式；日常英语中多把它当作花名使用，常见于园艺与花艺语境。"]}
{"word":"ixiaceae","summary":{"en":"Ixiaceae is an older scientific name for a plant family, now usually included in the iris family (Iridaceae).","zh":"Ixiaceae 是一个较旧的植物科名，现多被并入鸢尾科（Iridaceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now mostly obsolete) botanical family name for certain flowering plants, especially including the genus Ixia; these plants are now generally classified in the iris family (Iridaceae).","zh":"（植物学）一个较旧、现多已弃用的植物科名，主要涵盖如“非洲菖兰属（Ixia）”等开花植物；这些植物现在通常归入“鸢尾科（Iridaceae）”。"},"examples":[{"en":"In older botany books, you may see Ixia placed in the family Ixiaceae.","zh":"在较早的植物学书籍里，你可能会看到非洲菖兰属（Ixia）被归入Ixiaceae（菖兰科）。"},{"en":"Modern classifications usually treat Ixiaceae as part of Iridaceae rather than a separate family.","zh":"现代分类法通常认为Ixiaceae并非独立成科，而是归入鸢尾科（Iridaceae）。"}]}],"synonyms":["Iridaceae (modern classification context)"],"phonetic":"/ˌɪk.siˈeɪ.si.iː/","extraExplanation":["Ixiaceae 属于较早的分类体系用名：随着植物系统学（尤其是基于形态与分子证据的研究）发展，许多“旧科名”被合并或调整。如今在学术与园艺资料中，更常用 Iridaceae（鸢尾科）来涵盖这些类群。","词形提示：以 -aceae 结尾通常表示“植物科名”（例如 Rosaceae 蔷薇科、Asteraceae 菊科），因此 Ixiaceae 直译可理解为“与 Ixia 相关的一科”。"]}
{"word":"ixiama","summary":{"en":"“Ixiama” is most likely a proper name (often a place name), commonly seen as the spelling “Ixiamas” in Bolivia.","zh":"“Ixiama”很可能是专有名词（多为地名）；更常见的拼写是玻利维亚的“Ixiamas”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ixiama: a proper name that most commonly refers to a place name (often seen as “Ixiamas”), in northern Bolivia.","zh":"Ixiama：专有名词，通常作为地名出现（更常见拼写为 “Ixiamas”），位于玻利维亚北部。"},"examples":[{"en":"Ixiamas is a town in the La Paz Department of Bolivia.","zh":"Ixiamas 是玻利维亚拉巴斯省的一个城镇。"},{"en":"I couldn’t find “ixiama” in an English dictionary, but it may be a place name or a misspelling of “Ixiamas.”","zh":"我在英语词典里找不到 “ixiama”，但它可能是地名，或是 “Ixiamas” 的拼写错误。"}]}],"synonyms":["Ixiamas"],"phonetic":"/ˌɪk.siˈɑː.mə/","extraExplanation":["“Ixiama”看起来不像常见英语词汇，更像是专有名词（地名/人名/品牌名）的拼写。最接近、也更常见的地名是玻利维亚的 **Ixiamas**（多一个 s）。","如果你是在文章、地图或游戏/小说里看到这个词，发我一句原文上下文（前后各 1 句）或截图，我可以帮你确认它具体指什么、以及更准确的读法和含义。"]}
{"word":"ixias","summary":{"en":"Ixias refers to a genus of yellow-and-white pierid butterflies, or butterflies belonging to that genus.","zh":"Ixias 指粉蝶科的一属黄白色蝴蝶，也可泛指属于该属的蝴蝶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of yellow-and-white butterflies in the family Pieridae, found mainly in South and Southeast Asia (scientific name: Ixias).","zh":"（生物）粉蝶科的一属蝴蝶，常见黄白色，主要分布于南亚与东南亚（学名：Ixias）。"},"examples":[{"en":"Ixias butterflies are often seen in sunny open areas and gardens.","zh":"Ixias 属的蝴蝶常见于阳光充足的开阔地和花园。"},{"en":"The field guide lists several Ixias species found in Thailand.","zh":"这本野外图鉴列出了泰国分布的多种 Ixias 属物种。"}]},{"partOfSpeech":"n.","definition":{"en":"individual butterflies that belong to the genus Ixias (plural use).","zh":"Ixias 属的蝴蝶个体（复数用法）。"},"examples":[{"en":"In the dry season, ixias can look paler than usual.","zh":"在旱季，ixias（这些 Ixias 蝴蝶）看起来可能比平时更淡。"}]}],"synonyms":["pierid butterflies","butterflies (Ixias genus)"],"phonetic":"ˈɪksiəs","extraExplanation":["“Ixias”通常作为学名使用，首字母大写（Ixias）。你输入的“ixias”更像是不严格的写法或在口语/记录里作为复数泛指该属的蝴蝶。","学名读法在英语里可能因地区或个人习惯略有差异；学习时重点是能辨认它是“蝴蝶属名/分类名”。"]}
{"word":"ixil","summary":{"en":"Ixil refers to an Indigenous Maya people of Guatemala, their language, and the region often called the Ixil Triangle.","zh":"Ixil 指危地马拉的玛雅原住民伊希尔人、他们的语言（伊希尔语），以及常被称为“伊希尔三角地区”的相关区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mayan language spoken mainly by the Ixil people in the Guatemalan highlands.","zh":"伊希尔语：主要由危地马拉高地的伊希尔人使用的一种玛雅语系语言。"},"examples":[{"en":"She is learning Ixil to communicate with elders in the community.","zh":"她正在学习伊希尔语，以便和社区里的长者交流。"},{"en":"Ixil is one of the Mayan languages of Guatemala.","zh":"伊希尔语是危地马拉的玛雅语系语言之一。"}]},{"partOfSpeech":"n.","definition":{"en":"the Ixil people; an Indigenous Maya community from Guatemala (also used as an adjective: Ixil culture, Ixil villages).","zh":"伊希尔人：危地马拉的玛雅原住民群体（也可作形容词：伊希尔文化、伊希尔村庄）。"},"examples":[{"en":"Ixil communities have preserved many traditional weaving styles.","zh":"伊希尔社区保留了许多传统的织布风格。"},{"en":"The museum exhibit highlights Ixil textiles and patterns.","zh":"博物馆展览展示了伊希尔纺织品和图案。"}]},{"partOfSpeech":"n.","definition":{"en":"the “Ixil Triangle,” a region in Guatemala (around Nebaj, Chajul, and Cotzal) closely associated with Ixil communities.","zh":"伊希尔三角地区：危地马拉一个与伊希尔社区密切相关的区域（大致在内瓦赫、查胡尔、科察尔一带）。"},"examples":[{"en":"Many visitors travel to the Ixil Triangle for its mountain scenery and markets.","zh":"许多游客前往伊希尔三角地区，欣赏山地风景并逛集市。"}]}],"synonyms":["(no direct synonyms; related: Maya, Mayan languages, Guatemala Highlands)"],"phonetic":"/iˈʃil/","extraExplanation":["“Ixil”通常首字母大写，因为多指族群、语言或地名（专有名词）。","发音中间的“x”在该词里常读作 /ʃ/（类似英文 sh 的音），所以常听到“ee-SHEEL”。","在一些历史与人权语境中，“Ixil”也会出现在关于危地马拉内战时期对伊希尔社区暴力事件的讨论中；写作与翻译时宜保持尊重与准确。"]}
{"word":"ixion","summary":{"en":"Ixion is a figure from Greek mythology, often used as a symbol of endless punishment (the spinning wheel).","zh":"Ixion 是希腊神话人物，常被用作“无尽惩罚/折磨”的象征（旋转之轮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A king of the Lapiths who betrayed Zeus’s hospitality and was punished by being bound to a spinning, fiery wheel in the underworld.","zh":"（希腊神话）拉庇泰人的国王伊克西翁（Ixion），因背叛宙斯的款待而受罚，被绑在冥界一只燃烧旋转的轮子上永远受刑。"},"examples":[{"en":"In Greek myth, Ixion is remembered for his terrible punishment on a spinning wheel.","zh":"在希腊神话中，伊克西翁因被绑在旋转的轮子上受刑而闻名。"},{"en":"The story of Ixion is often used as a warning about betraying trust and hospitality.","zh":"伊克西翁的故事常被用来警示人们不要背叛信任与款待。"}]},{"partOfSpeech":"n.","definition":{"en":"A literary allusion to endless punishment or suffering (from the myth of Ixion).","zh":"（文学典故）指无尽的惩罚或折磨（源自伊克西翁受刑的神话）。"},"examples":[{"en":"The novel describes guilt as an Ixion’s wheel that never stops turning.","zh":"小说把罪疚写成一只永不停转的“伊克西翁之轮”。"},{"en":"For him, the daily routine became an Ixion-like torment.","zh":"对他来说，日复一日的例行工作成了类似“伊克西翁式”的折磨。"}]}],"synonyms":["Ixion’s wheel","the wheel of Ixion","endless punishment (figurative)"],"phonetic":"/ˈɪk.si.ən/","extraExplanation":["“Ixion”通常以专名出现，首字母大写为 Ixion；中文常译作“伊克西翁”。","神话要点：伊克西翁先犯下谋杀等罪，又在宙斯收留后企图冒犯赫拉；宙斯用“云塑的赫拉”（Nephele）试探他，最终将他绑在永远旋转的火轮上。这个故事在西方文化中常与“忘恩负义、亵渎神圣款待（hospitality）”联系在一起。","相关表达：Ixion’s wheel / the wheel of Ixion（伊克西翁之轮）常用来比喻“永无止境的折磨”。"]}
{"word":"ixionian","summary":{"en":"Ixionian means “connected with Ixion,” often implying endless punishment or a repetitive cycle of torment.","zh":"Ixionian意为“与伊克西翁有关”，常引申为“无尽惩罚/循环折磨”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Ixion (a figure in Greek mythology), especially suggesting punishment, torment, or being bound to a repeating cycle (like Ixion’s wheel).","zh":"与伊克西翁（希腊神话人物）有关的；尤指带有惩罚、折磨或被困在不断循环之中的意象（如“伊克西翁之轮”）。"},"examples":[{"en":"The poem describes an Ixionian punishment: the hero is trapped in an endless loop of regret.","zh":"这首诗描写了一种“伊克西翁式”的惩罚：主人公被困在无尽的悔恨循环里。"},{"en":"She called the job’s daily repetition an Ixionian wheel.","zh":"她把那份工作每天的重复称作“伊克西翁之轮”。"}]}],"synonyms":["Ixion-like","punitive","tormenting","cyclical"],"phonetic":"/ɪkˈsaɪəniən/","extraExplanation":["“Ixionian”来自希腊神话中的伊克西翁（Ixion）。传说他犯下重罪，被众神惩罚绑在燃烧的轮子上永远旋转，因此在英语里常用来比喻“永无止境的折磨/循环性的惩罚”。这个词比较少见，多出现在文学、评论或修辞性写作中，用来制造浓厚的神话与悲剧色彩。"]}
{"word":"ixodes","summary":{"en":"Ixodes: a genus of hard ticks; some species can transmit diseases like Lyme disease.","zh":"Ixodes：硬蜱属；部分物种可传播莱姆病等疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of hard-bodied ticks (family Ixodidae), including several species that can bite humans and animals and spread diseases such as Lyme disease","zh":"硬蜱属（一类硬蜱，隶属硬蜱科 Ixodidae）；其中一些种类会叮咬人和动物，并可能传播疾病（如莱姆病）"},"examples":[{"en":"Ixodes ticks are common in wooded areas and tall grass.","zh":"硬蜱属的蜱虫常见于林地和高草丛。"},{"en":"The doctor explained that Lyme disease is often transmitted by Ixodes species.","zh":"医生解释说，莱姆病常由硬蜱属的某些种类传播。"},{"en":"After hiking, she checked her legs for Ixodes ticks.","zh":"徒步之后，她检查腿上有没有硬蜱属的蜱虫。"}]}],"synonyms":["tick","hard tick"],"phonetic":"/ɪkˈsoʊdiːz/","extraExplanation":["“Ixodes”是拉丁化的科学属名，日常英语里更常说“tick（蜱虫）”，或在医学/公共卫生语境中说“deer tick（鹿蜱）/blacklegged tick（黑脚蜱）”。","在北美，最常被提到的相关种是 Ixodes scapularis（可传播莱姆病等）；在欧洲常见 Ixodes ricinus。具体风险与地区、季节有关。","发音在英语中常见为 /ɪkˈsoʊdiːz/；这是学术语境词，写作时通常首字母大写（Ixodes）以符合生物分类命名习惯。"]}
{"word":"ixodian","summary":{"en":"Ixodian means “related to the hard tick family (Ixodidae).”","zh":"ixodian 指“与硬蜱科（Ixodidae）相关的/属于硬蜱科的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or belonging to the tick family Ixodidae (hard ticks).","zh":"与硬蜱科（Ixodidae，常称“硬蜱/硬蜱类”）有关的；属于硬蜱科的。"},"examples":[{"en":"Ixodian ticks can attach firmly to the skin and feed on blood.","zh":"硬蜱科（ixodian）的蜱虫会牢牢叮附在皮肤上吸血。"},{"en":"The veterinarian checked the dog for ixodian parasites after the hike.","zh":"徒步后，兽医检查了这只狗是否带有硬蜱科的寄生虫。"}]}],"synonyms":["hard-tick (related)","Ixodidae (technical family name)"],"phonetic":"/aɪkˈsoʊdiən/","extraExplanation":["“Ixodian”来自拉丁化的分类名称 Ixodidae（硬蜱科）。在日常英语里更常见的说法是 hard tick（硬蜱）或 tick（蜱虫）。","这个词多用于医学、兽医学、昆虫学/节肢动物学等专业语境；如果你是在普通对话或新闻里看到，可能是在讨论蜱传疾病（如莱姆病等）。"]}
{"word":"ixodiasis","summary":{"en":"Ixodiasis means a tick-caused infestation or disease.","zh":"Ixodiasis 指由蜱虫引起的寄生或相关病症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A disease or infestation caused by ticks (especially hard ticks in the family Ixodidae), often involving tick bites and sometimes the transmission of infections.","zh":"由蜱虫（尤其是硬蜱科 Ixodidae）引起的蜱虫寄生或相关疾病，通常表现为被蜱叮咬，并可能伴随传播感染。"},"examples":[{"en":"After hiking in tall grass, the patient developed ixodiasis and needed the tick removed safely.","zh":"在高草丛徒步后，患者出现了蜱虫寄生（ixodiasis），需要安全地取出蜱虫。"},{"en":"Doctors checked for infections after ixodiasis because some ticks can transmit Lyme disease.","zh":"医生在处理蜱虫寄生（ixodiasis）后也检查是否感染，因为有些蜱会传播莱姆病。"}]}],"synonyms":["tick infestation","tick-borne infestation","tick parasitism"],"phonetic":"/ˌɪkˌsoʊˈdaɪəsɪs/","extraExplanation":["这是一个医学/寄生虫学用词，不太常见；日常英语里更常说“tick infestation”（蜱虫寄生）或“tick bite”（蜱虫叮咬）。","词根来源：Ixodes 是“硬蜱属”的属名，-iasis 常见于表示“病症/寄生状态”（如 psoriasis）。","健康提示（非医疗建议）：若发现蜱虫叮附，通常建议用尖头镊子贴近皮肤夹住蜱口器，稳稳向外拔出；避免挤压蜱体或涂油，以免增加病原传播风险。出现发热、皮疹或关节痛等症状应尽快就医。"]}
{"word":"ixodic","summary":{"en":"Ixodic means “related to ticks” or “tick-borne,” used mostly in scientific and medical contexts.","zh":"ixodic 指“与蜱有关的/蜱媒的”，多用于医学与科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to ticks (especially hard ticks of the family Ixodidae), or caused/spread by ticks.","zh":"与蜱（尤指硬蜱科 Ixodidae）有关的；由蜱引起或传播的。"},"examples":[{"en":"The doctor asked about possible ixodic exposure during the hiking trip.","zh":"医生询问在那次徒步旅行中是否可能有蜱叮咬（蜱类）暴露。"},{"en":"Lyme disease is an ixodic illness because it is transmitted by ticks.","zh":"莱姆病属于蜱媒疾病，因为它由蜱传播。"}]}],"synonyms":["tick-borne","tick-related","tick-transmitted"],"phonetic":"/aɪˈzɑdɪk/","extraExplanation":["“ixodic”来自“Ixodidae / Ixodes”（硬蜱科/硬蜱属）的词根“ixod-”。它多见于医学、兽医与生物学写作中，用来描述“蜱相关/蜱媒”的暴露、疾病或生态关系。日常英语里更常用的说法是“tick-borne”（蜱媒的）或“tick-related”（与蜱有关的）。"]}
{"word":"ixodid","summary":{"en":"Ixodid refers to a hard tick (family Ixodidae), often discussed in medical or veterinary contexts because it can carry diseases.","zh":"Ixodid 指“硬蜱”（硬蜱科 Ixodidae），多用于医学或兽医学语境，因为它可能携带并传播疾病。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A hard tick (family Ixodidae), a blood-feeding parasite that commonly attaches to mammals (including humans) and can spread diseases.","zh":"硬蜱（硬蜱科 Ixodidae），一种吸血寄生虫，常附着在哺乳动物（包括人类）身上，并可能传播疾病。"},"examples":[{"en":"Ixodid ticks can transmit Lyme disease in some regions.","zh":"在一些地区，硬蜱可能传播莱姆病。"},{"en":"The veterinarian removed an ixodid tick from the dog’s ear.","zh":"兽医从狗的耳朵上取下了一只硬蜱。"}]},{"partOfSpeech":"n.","definition":{"en":"A hard tick; a member of the family Ixodidae.","zh":"硬蜱；硬蜱科（Ixodidae）的一员。"},"examples":[{"en":"An ixodid was found attached to the hiker’s leg after the trip.","zh":"徒步结束后，有人发现一只硬蜱附在那位徒步者的腿上。"}]}],"synonyms":["hard tick","ixodid tick","tick (general)"],"phonetic":"/ɪkˈsɑːdɪd/","extraExplanation":["“Ixodid”是科学/医学语境中较常见的词，日常英语里更常直接说“tick（蜱虫）”。","硬蜱与“软蜱（soft ticks, family Argasidae）”相对：硬蜱通常背部有明显的硬质盾板（scutum），而软蜱外观更柔软、缺少明显盾板。"]}
{"word":"ixodidae","summary":{"en":"Ixodidae is the scientific family name for hard ticks.","zh":"Ixodidae 是“硬蜱”的科学分类名称（蜱科/硬蜱科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of ticks known as hard ticks, with a hard shield on the back; many species can bite humans and animals and may spread diseases","zh":"蜱科（硬蜱科）：一类“硬蜱”，背部有坚硬的盾板；许多种会叮咬人和动物，并可能传播疾病"},"examples":[{"en":"Ixodidae includes many hard ticks that feed on the blood of mammals and birds.","zh":"蜱科包含许多以哺乳动物和鸟类血液为食的硬蜱。"},{"en":"Some Ixodidae species can carry pathogens that cause illnesses such as Lyme disease.","zh":"某些蜱科物种可能携带病原体，导致例如莱姆病等疾病。"}]}],"synonyms":["hard ticks"],"phonetic":"/ɪkˈsɑːdɪdi/","extraExplanation":["“Ixodidae”是拉丁化的科学名称（分类学用语），日常英语里更常说“hard ticks（硬蜱）”。","读到这类词时，可以把它当作“某某科（-idae）”的生物分类后缀：例如Felidae（猫科）、Canidae（犬科）。"]}
{"word":"ixodids","summary":{"en":"“Ixodids” means hard ticks—blood-feeding parasites in the family Ixodidae.","zh":"“ixodids”指硬蜱（硬蜱科 Ixodidae 的蜱类），以吸血为生的寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"hard ticks (members of the family Ixodidae); blood-feeding parasites found on animals and sometimes humans","zh":"硬蜱（蜱总科中“硬蜱科 Ixodidae”的成员）；以吸血为生的寄生虫，常寄生于动物，有时也会叮咬人类"},"examples":[{"en":"Ixodids can attach firmly to a host and feed for days.","zh":"硬蜱会牢牢附着在宿主体表，并可连续吸血数天。"},{"en":"Some ixodids can transmit diseases such as Lyme disease.","zh":"一些硬蜱可能传播莱姆病等疾病。"},{"en":"Wear long sleeves and check your skin after hiking in areas where ixodids live.","zh":"在可能有硬蜱出没的地区徒步后，建议穿长袖并检查皮肤。"}]}],"synonyms":["hard ticks","ticks (general)"],"phonetic":"/ɪkˈsɑːdɪdz/","extraExplanation":["“ixodids”是复数形式，单数为“ixodid”。在日常英语里更常用的说法是“(hard) ticks（（硬）蜱）”。","硬蜱与“soft ticks（软蜱，Argasidae）”相对；硬蜱背部通常有较硬的盾板（scutum），这是常见的识别特征之一。","在公共卫生语境中，蜱可能携带并传播病原体（如莱姆病等）。如果被蜱叮咬且出现发热、皮疹或不适，应及时就医并说明暴露史。"]}
{"word":"ixora","summary":{"en":"Ixora is a tropical flowering shrub with bright clusters of small flowers, often used as an ornamental plant.","zh":"Ixora（龙船花）是一种热带开花灌木，常开成簇的鲜艳小花，常用于观赏与园艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical flowering shrub (genus Ixora) with clusters of small, tube-shaped flowers, often grown as an ornamental plant","zh":"一种热带开花灌木（龙船花属 Ixora），开成簇的小管状花，常作观赏植物"},"examples":[{"en":"Ixora is popular in tropical gardens because it blooms in bright clusters.","zh":"龙船花在热带花园里很受欢迎，因为它会开出一簇簇鲜艳的花。"},{"en":"They planted red ixora along the walkway for color.","zh":"他们在人行道旁种了红色的龙船花来增添色彩。"}]}],"synonyms":["jungle geranium","flame of the woods"],"phonetic":"/aɪˈzɔrə/","extraExplanation":["“Ixora”常见于园艺语境，中文常译作“龙船花”，也有人称其为“仙丹花”。花色多样（红、橙、粉、黄等），在东南亚与南亚的庭园与城市绿化中很常见。","在英语里你也可能看到它的俗名：jungle geranium（丛林天竺葵）、flame of the woods（林中火焰），但这些不是严格的学名。"]}
{"word":"ixoras","summary":{"en":"Ixoras are tropical flowering shrubs with bright flower clusters; “ixoras” is the plural form.","zh":"Ixoras 指热带的仙丹花（仙丹花属）开花灌木，“ixoras”是其复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ixora: flowering tropical shrubs (genus Ixora) with dense clusters of small, brightly colored flowers.","zh":"ixora 的复数：仙丹花属（Ixora）的热带开花灌木，花朵细小但成簇密集、颜色鲜艳。"},"examples":[{"en":"The hotel garden is lined with ixoras in red and orange.","zh":"酒店花园两旁种着红色和橙色的仙丹花。"},{"en":"Ixoras grow well in warm, humid weather.","zh":"仙丹花在温暖潮湿的天气里长得很好。"}]}],"synonyms":["ixora","jungle geranium","flame of the woods"],"phonetic":"/aɪˈzɔrə/","extraExplanation":["Ixora 常见于东南亚、南亚与热带地区的庭园绿化；中文常叫“仙丹花”，英文也常称 jungle geranium / flame of the woods（不同地区用法略有差异）。","园艺上多喜酸性土、充足光照与稳定温度；在气温较低的地方常作为盆栽或温室植物。"]}
{"word":"ixtle","summary":{"en":"Ixtle is a strong fiber from agave plants, used for ropes, twine, and brushes.","zh":"Ixtle 是一种来自龙舌兰植物的坚韧纤维，常用于绳索、麻线和刷子等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tough natural fiber obtained from certain agave plants (especially henequen and other Mexican agaves), used to make rope, twine, brushes, sacks, and similar goods.","zh":"（龙舌兰属植物，尤指墨西哥的剑麻等）提取的一种坚韧天然纤维，用于制作绳索、麻线、刷子、麻袋等。"},"examples":[{"en":"The artisan wove a bag from ixtle fibers.","zh":"这位手工艺人用 ixtle 纤维编了一个袋子。"},{"en":"Traditional brushes were often made with ixtle because it is strong and durable.","zh":"传统刷子常用 ixtle 制作，因为它结实耐用。"}]}],"synonyms":["sisal","henequen","agave fiber"],"phonetic":"/ˈɪkstəl/","extraExplanation":["“ixtle”一词源自西班牙语，常与墨西哥及中美洲的龙舌兰纤维工艺相关。在英文中它属于较专业/地域文化词汇，阅读有关传统手工艺、农业或纤维材料的文章时更常见。","相关近义词（按材料/用途接近）：sisal（剑麻纤维）、henequen（剑麻的一种/其纤维）。在一些语境里，ixtle 可能被更泛化地用来指多种龙舌兰纤维。"]}
{"word":"ixtles","summary":{"en":"Ixtles are strong agave fibers used for making rope, twine, brushes, and similar goods.","zh":"Ixtles 指从龙舌兰提取的结实纤维，常用于制作绳索、麻线、刷子等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of ixtle) a strong natural fiber from certain agave plants, used to make rope, twine, brushes, or coarse cloth.","zh":"（ixtle 的复数）一种从某些龙舌兰植物提取的结实天然纤维，用于制作绳索、麻线、刷子或粗布。"},"examples":[{"en":"The artisans used ixtles to weave a durable rope.","zh":"工匠们用 ixtles 编织出耐用的绳子。"},{"en":"Brushes made from ixtles are common in some traditional crafts.","zh":"在一些传统手工艺中，用 ixtles 制成的刷子很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the agave plant (or its leaves) that produces ixtle fiber.","zh":"（较少见）出产 ixtle 纤维的龙舌兰植物（或其叶片）。"},"examples":[{"en":"Farmers cultivated ixtle plants in dry regions.","zh":"农民在干旱地区种植能产 ixtle 纤维的龙舌兰。"}]}],"synonyms":["agave fiber","sisal","henequen"],"phonetic":"ˈɪk.stəl","extraExplanation":["你输入的 **ixtles** 通常是名词复数，单数是 **ixtle**。","词源上经由西班牙语进入英语，源自纳瓦特尔语（墨西哥原住民语言）词根，常与墨西哥及中美洲的传统纤维工艺相关。","它与 **sisal（剑麻纤维）**、**henequen（龙舌兰麻）** 概念接近，但不一定完全相同；在不同地区可能指不同龙舌兰纤维。"]}

