{"word":"jharal","summary":{"en":"“Jharal” is not common English; it’s usually a name (person/place/brand).","zh":"“jharal”不是常见英语词，多作姓名/地名/品牌等专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper noun (a surname, place name, or brand name).","zh":"不是标准英语词汇；最常见的用法是专有名词（姓氏、地名或品牌名）。"},"examples":[{"en":"I couldn’t find “Jharal” in an English dictionary, but it may be a family name.","zh":"我在英语词典里找不到“Jharal”，但它可能是一个姓氏。"},{"en":"The package was shipped by Jharal Logistics.","zh":"包裹由 Jharal 物流公司寄出。"}]}],"phonetic":"/dʒəˈrɑːl/","extraExplanation":["“jharal”看起来更像来自南亚语言（如印地语/尼泊尔语/旁遮普语等）的转写，或是人名/地名。在不同语言与拼写系统里，发音和含义可能差别很大。","如果你能告诉我它出现的句子、语境（例如：人名、地名、物品名称），或原始文字（如天城文/尼泊尔文等），我可以给出更准确的释义、词源和例句。"]}
{"word":"jheel","summary":{"en":"Jheel means a lake or natural pond in South Asian English.","zh":"jheel 指（南亚英语中）湖或天然池塘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) a lake or natural pond, especially in India or Pakistan.","zh":"（南亚英语）湖；天然池塘（尤指印度或巴基斯坦的湖泊/水塘）。"},"examples":[{"en":"Many migratory birds gather around the jheel in winter.","zh":"冬天，许多候鸟会聚集在这片jheel（湖/水塘）周围。"},{"en":"We walked along the jheel at sunrise.","zh":"我们在日出时沿着jheel（湖边/塘边）散步。"}]}],"synonyms":["lake","pond","lagoon (sometimes)","wetland (related)"],"phonetic":"/dʒil/","extraExplanation":["“jheel”（也常拼作 jhil / jheel）来自印地语/乌尔都语“झील / جھیل”，意思就是“湖、池塘”。在印度英语或巴基斯坦英语的语境中很常见，但在更广泛的国际英语里不算常用。","在南亚地名中经常能看到它，例如“Bhopal’s Upper Lake (Bhojtal)”一带也可能被当地人称作某个 jheel；很多湿地保护区的名字里也会出现 jheel。"]}
{"word":"jhool","summary":{"en":"“Jhool” (South Asian English) means a swing/swaying motion or the drape of fabric; it can also be used as a verb meaning “to swing/sway.”","zh":"“Jhool”（南亚英语）指摇摆/悬荡的动作或布料的垂感；也可作动词表示“摇摆/晃动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Hindi/Urdu) a swing, sway, or hanging motion; the way something drapes or falls loosely.","zh":"（南亚英语；源自印地语/乌尔都语）摇摆、悬荡的动作；也指布料等松垂、下垂的“垂感/摆动感”。"},"examples":[{"en":"The hammock has a gentle jhool in the breeze.","zh":"吊床在微风里轻轻地晃着。"},{"en":"This skirt has a nice jhool when you walk.","zh":"这条裙子走起来垂感和摆动感很好。"}]},{"partOfSpeech":"v.","definition":{"en":"to swing or sway; to hang and move back and forth (informal, South Asian English).","zh":"（非正式，南亚英语）摇摆；悬着前后晃动。"},"examples":[{"en":"The baby likes to jhool in the cradle.","zh":"宝宝喜欢在摇篮里摇啊摇。"},{"en":"The earrings jhool as she turns her head.","zh":"她一转头，耳环就跟着晃动。"}]}],"synonyms":["swing","sway","rock","drape","hang"],"phonetic":"/dʒuːl/","extraExplanation":["“Jhool”常见于印度/巴基斯坦等地的英语口语或双语环境里，用来表达“摇摆/悬荡”或“衣料垂坠的效果”。在更标准的国际英语里，通常会用 swing、sway、drape、hang loosely 等词来表达。"]}
{"word":"jhow","summary":{"en":"“jhow” is not a standard English word; it’s usually a typo or a nickname/stylized spelling.","zh":"“jhow”不是标准英语单词；通常是拼写错误或昵称/个性化写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a typo or stylized spelling (for example, someone accidentally typing “j” before “how,” or using it as a username/nickname).","zh":"不是标准英语单词。最常见的情况是拼写错误或个性化写法（例如把“how”前面多打了一个 j，或把它当作网名/昵称）。"},"examples":[{"en":"I think you meant “how,” not “jhow.”","zh":"我觉得你想写的是“how”，不是“jhow”。"},{"en":"“jhow” doesn’t show up in most English dictionaries.","zh":"“jhow”在大多数英语词典里查不到。"}]}],"phonetic":"/dʒaʊ/","extraExplanation":["“jhow”没有公认的固定含义，因此在正式写作中不建议使用。","如果你本来想问的是“how”（怎么样/如何），常见用法有：How are you?（你好吗？）、How to do it（怎么做）。","如果“jhow”是某个特定领域/社群（游戏ID、缩写、专有名词）的用法，请告诉我上下文句子或平台，我可以帮你判断它在那个语境里的意思。"]}
{"word":"jhuria","summary":{"en":"“Jhuria” is likely a proper name/transliteration, not a standard English word.","zh":"“Jhuria”多半是专有名词/音译拼写，不是标准英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (a surname, given name, or place name) written in Roman letters (e.g., from South Asia). Meaning depends on the language and context.","zh":"不是标准英语词。更可能是用拉丁字母拼写的专有名词（姓氏、名字或地名，常见于南亚语境等）。具体含义取决于来源语言和使用场景。"},"examples":[{"en":"My classmate’s last name is Jhuria.","zh":"我同学的姓是 Jhuria。"},{"en":"Jhuria is not an English dictionary word; it may be a name or a transliteration.","zh":"Jhuria 不是英语词典里的词；它可能是名字或音译拼写。"}]}],"phonetic":"/dʒuˈriə/","extraExplanation":["“Jhuria”看起来像是音译/转写（transliteration）的拼写，而不是英语词汇。如果你能告诉我它来自哪种语言（例如印地语/旁遮普语/尼泊尔语等）、出现在哪里（人名、地名、账号、歌曲歌词、文档句子），我可以更准确地解释含义与用法。","英语里遇到这种词时，常见处理方式是把它当作专有名词：首字母大写、通常不做复数变化（除非指一家人/一个群体），并按原语言习惯或对方自报的发音来读。"]}
{"word":"jhvh","summary":{"en":"“jhvh” isn’t an English word. It’s probably a typo or initials—please provide the intended word or a sentence for context.","zh":"“jhvh”不是英文单词，可能是输入错误或首字母缩写；请提供你想查的单词或句子语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word; likely a typo, keyboard smash, abbreviation, or initials. If you meant a real word, please retype it or share the context (a sentence).","zh":"不是常见的英文单词；很可能是打错、随手敲键盘、缩写或首字母。如果你想查的是某个真实单词，请重新输入或提供所在句子语境。"},"examples":[{"en":"I typed “jhvh” by accident—can you help me find the word I meant?","zh":"我不小心打成了“jhvh”——你能帮我找出我本来想输入的单词吗？"},{"en":"If you share the sentence, I can guess what “jhvh” was supposed to be.","zh":"如果你把句子发出来，我可以帮你猜“jhvh”原本想写的是什么。"}]}]}

