{"word":"jnana","summary":{"en":"Jnana means spiritual knowledge or liberating insight in Hindu philosophy.","zh":"Jnana 指印度教哲学中的“灵性知识/解脱性的洞见”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu philosophy) spiritual knowledge or insight, especially the direct understanding of ultimate reality (often contrasted with action or devotion).","zh":"（印度教哲学）灵性知识/智慧，尤指对终极实相的直接洞见（常与“行动”或“虔 devotion”相对）。"},"examples":[{"en":"In Vedanta, jnana is the kind of knowledge that frees a person from ignorance.","zh":"在吠檀多哲学中，jnana 指能使人摆脱无明的那种知识。"},{"en":"She was drawn to jnana yoga, which emphasizes self-inquiry and understanding.","zh":"她对“智瑜伽”（jnana yoga）很感兴趣，因为它强调自我探究与理解。"},{"en":"The text describes jnana as more than information—it is lived insight.","zh":"这部经典把 jnana 描写为不仅是信息，更是一种被活出来的洞见。"}]}],"synonyms":["spiritual knowledge","wisdom","insight","gnosis"],"phonetic":"/ˈdʒnɑːnə/","extraExplanation":["“Jnana”来自梵语“jñāna”（ज्ञान），在英语中多见于宗教、哲学与瑜伽语境，通常不译或音译为“吉纳纳/智”。","在印度思想传统中，常把修行路径概括为：jnana（智/知）、karma（业/行动）、bhakti（爱与奉献）。其中 jnana 更偏向通过分辨与内省获得解脱性的理解。","英语写法有时也见“jñāna”（带变音符号）或“gyana”。不同译写主要是转写系统差异，核心含义相近。"]}
{"word":"jnanamarga","summary":{"en":"Jnanamarga means the “path of knowledge” in Hindu philosophy: a route to liberation through self-inquiry, study, and realization of the true Self.","zh":"Jnanamarga 指印度教哲学中的“知识/智慧之道”：通过自我探究、研习与体证真我而趋向解脱的修行路径。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(In Hindu philosophy) the “path of knowledge” — a spiritual way to liberation (moksha) through self-inquiry, study, and direct realization of the true Self (Atman/Brahman).","zh":"（印度教哲学）“知识/智慧之道”——通过自我探究、研习与对真我（我/梵）的直接体证而走向解脱（moksha）的修行道路。"},"examples":[{"en":"In the Bhagavad Gita, jnanamarga is often discussed alongside other paths like devotion and action.","zh":"在《薄伽梵歌》中，jnanamarga 常与奉爱之道和行动之道等其他修行道路一起被讨论。"},{"en":"She was drawn to jnanamarga, spending time in meditation and studying Advaita Vedanta texts.","zh":"她倾向于 jnanamarga，通过禅修并研读不二论（Advaita Vedanta）经典来修行。"},{"en":"Teachers sometimes recommend a mix of jnanamarga and bhakti for balanced practice.","zh":"老师们有时会建议把 jnanamarga 与 bhakti（奉爱）结合，以取得更平衡的修行。"}]}],"synonyms":["jnana marga","jñāna-mārga","path of knowledge","path of wisdom","jnana yoga"],"phonetic":"/ˌdʒnɑːnəˈmɑːrɡə/","extraExplanation":["词源与写法：jnāna（ज्ञान）意为“知识、智慧、觉知”，mārga（मार्ग）意为“道路、路径”。常见英文转写有 jnana marga / jñāna-mārga。","读音提示：开头的“jn-”在英语里不常见，许多人会读成接近“juh-NAH-nuh-MAR-guh”。在学术或印度语境中，“jñ”有时接近“gy/ny”的连读音。","文化语境：jnanamarga 通常与 bhakti-marga（奉爱之道）和 karma-marga（行动/业之道）并列，三者都是通往解脱的主要路径，但不同传统会强调的重点不同。"]}
{"word":"jnanas","summary":{"en":"“Jnanas” means forms of spiritual knowledge or wisdom (plural of jnana) in Hindu/Buddhist contexts.","zh":"“Jnanas”指（jnana 的复数）印度教/佛教语境中的灵性知识与智慧（真知）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu and Buddhist traditions) spiritual knowledge or wisdom—especially knowledge that leads toward liberation or enlightenment; plural of jnana.","zh":"（印度教与佛教传统中）灵性知识、智慧，尤指通向解脱或觉悟的“真知”；为 jnana 的复数。"},"examples":[{"en":"In the text, the teacher speaks of different jnanas that arise through meditation and study.","zh":"在这部经典里，老师谈到通过禅修与研习而生起的不同“真知”（jnanas）。"},{"en":"They discussed how devotion and jnanas can support each other on a spiritual path.","zh":"他们讨论了虔敬与“真知”（jnanas）如何在修行道路上彼此支持。"}]}],"synonyms":["spiritual wisdom","insight","gnosis","enlightening knowledge"],"phonetic":"/dʒəˈnɑːnəz/","extraExplanation":["“Jnana（ज्ञान）”是梵语词，常见于瑜伽与印度哲学语境，核心意思是“知/智”，更偏向“直观、体悟到的真理”，而不只是日常的事实性知识。","在英语中常与“jnana yoga（智瑜伽/智慧之道）”一起出现，强调通过辨析、学习与内观来获得解脱相关的智慧。","拼写以“jn-”开头不符合英语常见拼写习惯，所以英语读音多为约化的“juh-NAH-nuh”，复数常写 jnanas。"]}
{"word":"jnanashakti","summary":{"en":"Jnanashakti means “the power/energy of knowledge,” an inner capacity for wisdom and true insight in Indian philosophical traditions.","zh":"Jnanashakti 指“知识／智慧之力”，在印度哲学传统中常指一种获得洞见与觉悟的内在能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Indian philosophy, especially some Hindu and yogic traditions) the “power/energy of knowledge” or “wisdom power,” understood as an inner spiritual capacity to perceive truth and gain insight.","zh":"（印度哲学中，尤见于部分印度教与瑜伽传统）“知识之力／智慧之力”，指一种内在的灵性能力，用以洞见真理、获得觉悟与深层理解。"},"examples":[{"en":"In the text, jnanashakti is described as the inner power that turns learning into real insight.","zh":"文中把 jnanashakti 描述为一种内在力量，能把学习转化为真正的洞见。"},{"en":"Some teachers say meditation strengthens jnanashakti, making the mind clearer and more discerning.","zh":"一些老师认为冥想能增强 jnanashakti，使心更清明、更有辨别力。"}]}],"synonyms":["wisdom power","power of knowledge","spiritual insight","inner knowing"],"phonetic":"/dʒəˈnɑːnə ˈʃʌkti/","extraExplanation":["这是梵语复合词：jnāna（ज्ञान，意为“知识／觉知／智慧”）+ śakti（शक्ति，意为“力量／能量／神圣能力”）。常见音译写法包括 jnana shakti、jnānaśakti 等。","在不同传统里，它有时被理解为“认知的能力”（更偏心理/认识论），有时被理解为“灵性的智慧能量”（更偏宗教/修行语境）。具体含义通常取决于作者或流派。","发音提示：词首“jn-”在英语里不常见，实际说话时很多学习者会把它读得更接近“juh-NAH-na SHUK-tee”，能被理解即可。"]}
{"word":"jnanayoga","summary":{"en":"Jnana yoga is a Hindu spiritual path that seeks freedom through knowledge and self-inquiry.","zh":"Jnana yoga（智慧瑜伽/知瑜伽）是印度教的一条修行道路，强调以知识与自我探究求得解脱。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(In Hindu philosophy) a spiritual path that focuses on gaining liberation through knowledge, self-inquiry, and understanding the true nature of the self (often linked with Vedanta).","zh":"（印度教哲学中）“智慧瑜伽/知瑜伽”：以知识、内省与探究自我本质来获得解脱的修行道路（常与吠檀多思想相关）。"},"examples":[{"en":"He studied Advaita Vedanta and practiced jnana yoga through daily self-inquiry.","zh":"他研习不二论吠檀多，并通过每日的自我探究来修习智慧瑜伽。"},{"en":"In some traditions, jnana yoga emphasizes reflection and discrimination between what is temporary and what is eternal.","zh":"在一些传统中，智慧瑜伽强调反思，并辨别短暂之物与永恒之物。"}]},{"partOfSpeech":"phrase","definition":{"en":"More broadly, the practice of using study, contemplation, and philosophical reasoning as a form of yoga or spiritual discipline.","zh":"更广义地说：把学习、沉思与哲学推理当作一种“瑜伽/修行”的实践方式。"},"examples":[{"en":"For her, reading sacred texts and discussing them with a teacher is part of jnana yoga.","zh":"对她来说，阅读经典并与导师讨论，是智慧瑜伽的一部分。"},{"en":"Some people combine jnana yoga with meditation to balance thinking and direct experience.","zh":"有些人把智慧瑜伽与冥想结合，以平衡思辨与直接体验。"}]}],"synonyms":["the path of knowledge","self-inquiry (in Vedanta contexts)","Advaita Vedanta practice (related)"],"phonetic":"/dʒəˈnɑːnə ˈjoʊɡə/","extraExplanation":["“Jnana”来自梵语“jñāna”（意为“知识/智慧”），常被音译为“智”“慧”；“yoga”原义有“结合/修行/方法”之意。英语里常写作 jnana yoga，也可见拼写 jñāna yoga。","在印度传统中常把瑜伽道路分为几类：如 karma yoga（业瑜伽/行动之道）、bhakti yoga（奉爱瑜伽/信爱之道）、raja yoga（王瑜伽/禅定之道）等；jnana yoga 通常与“以智慧见真我”这一路径相关。","不少英语作品会用它来指“以哲学思辨与自我探问为核心的修行”。在现代语境中，它有时也被泛化为“以学习与理解为核心的灵性道路”，但具体含义会因宗派与作者而异。"]}
{"word":"jnanendriya","summary":{"en":"Jnānendriya means a sense organ—an organ of perception/knowledge in Indian philosophy and yoga.","zh":"Jnānendriya 指感官，即印度哲学与瑜伽中“知觉/认知的器官”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Indian philosophy and yoga) a sense organ; an “organ of knowledge/perception” that receives information from the outside world (such as hearing, touch, sight, taste, or smell).","zh":"（印度哲学/瑜伽术语）感官；“认知/知觉之器官”，指接收外界信息的器官（如听觉、触觉、视觉、味觉、嗅觉）。"},"examples":[{"en":"In yoga philosophy, the jnanendriyas are the five senses: hearing, touch, sight, taste, and smell.","zh":"在瑜伽哲学中，jnanendriya 指五种感官：听、触、视、味、嗅。"},{"en":"Meditation practices often train you to observe the jnanendriya without immediately reacting.","zh":"冥想练习常训练你观察感官（jnanendriya）的活动，而不是立刻做出反应。"}]}],"synonyms":["sense organ","organ of perception","indriya"],"phonetic":"/ˌnjɑːnɛnˈdriːjə/","extraExplanation":["jnanendriya 来自梵语 jñānendriya：jñāna（知识/认知）+ indriya（能力、感官/器官）。在一些体系（如数论、瑜伽传统）中，通常说有“五种 jñānendriya”，对应耳、皮肤、眼、舌、鼻（分别与听、触、视、味、嗅相关）。","相关经典讨论常见于数论（Sāṃkhya）与《瑜伽经》等传统语境；现代英语里多见于瑜伽课堂、冥想书籍与印度哲学导论中。"]}

