{"word":"jymold","summary":{"en":"“Jymold” isn’t a standard word; you probably meant “mold”: fungus in damp places, or the act/tool of shaping something.","zh":"“jymold” 不是标准单词；你可能想写 “mold”：指潮湿处的霉菌，也可指“塑造/使成形”或“模具”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo for “mold.”","zh":"这不是标准英语单词；可能是把 “mold” 拼错了。"},"examples":[{"en":"Did you mean “mold” (the fungus) or “mold” (to shape something)?","zh":"你是想说 “mold”（霉菌）还是 “mold”（塑形/铸造）？"}]},{"partOfSpeech":"n.","definition":{"en":"A type of fungus that grows in damp places, often seen as a fuzzy or colored coating.","zh":"霉；霉菌（常在潮湿处生长，表面呈绒毛状或带颜色的覆盖物）。"},"examples":[{"en":"There’s mold on the bathroom ceiling.","zh":"浴室天花板上有霉。"},{"en":"Throw the bread away if you see mold on it.","zh":"如果面包上长霉了，就把它扔掉。"}]},{"partOfSpeech":"vt.","definition":{"en":"To shape or form something, often with your hands or a tool; to influence how something develops.","zh":"塑造；使成形（用手或工具）；影响……的发展。"},"examples":[{"en":"She molded the clay into a small bowl.","zh":"她把黏土捏成了一个小碗。"},{"en":"Good teachers can mold students’ confidence.","zh":"好老师能塑造学生的自信。"}]},{"partOfSpeech":"n.","definition":{"en":"A hollow container used to give shape to a material (like metal, plastic, or cake batter) as it cools or bakes.","zh":"模具；模型（用来让金属、塑料或蛋糕糊等成形的容器）。"},"examples":[{"en":"Pour the chocolate into the mold and let it cool.","zh":"把巧克力倒进模具里，让它冷却。"},{"en":"Grease the cake mold so it won’t stick.","zh":"在蛋糕模具上抹点油，防止粘住。"}]}],"synonyms":["fungus (for the noun)","mildew (similar, often on surfaces)","shape","form","sculpt"],"phonetic":"/moʊld/","extraExplanation":["“mold” 在美式英语中常用拼写为 mold；英式英语常写作 “mould”。两者意思相同，只是拼写地区差异。","如果你看到的是 “gym mold”，通常是指健身房更衣室、淋浴间等潮湿处滋生的霉菌；清洁、通风和除湿很重要。"]}
{"word":"jynginae","summary":{"en":"“jynginae” isn’t a recognized English word; it’s likely a name/username or a misspelling. Share the context and I can help identify the intended word.","zh":"“jynginae”不是常见英语词；更可能是人名/网名或拼写错误。提供上下文后我可以帮你判断你想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a personal name, username, or a misspelling/romanization from another language.","zh":"不是标准英语单词。看起来更像人名、网名，或来自其他语言的拼写/罗马字转写。"},"examples":[{"en":"My username is “jynginae” on that platform.","zh":"我在那个平台注册的用户名是“jynginae”。"},{"en":"I’m not sure what “jynginae” means—could you share the context?","zh":"我不确定“jynginae”是什么意思——你能提供一下使用语境吗？"}]}],"extraExplanation":["目前在常见英语词典与语料中找不到“jynginae”。如果你是在歌词、聊天、游戏ID或社交媒体上看到的，它很可能是专有名词（昵称/人名）而非可直接翻译的词。","如果你想查的是某个英语单词，请把原句贴出来，或告诉我你想表达的意思（例如：听起来像哪个词、可能的正确拼写）。我也可以根据上下文帮你猜测更接近的拼写。"]}
{"word":"jyngine","summary":{"en":"“jyngine” is likely a misspelling of “engine,” meaning a machine that produces power to move vehicles or run equipment; it can also mean a railway locomotive or a driving force (figuratively).","zh":"“jyngine” 很可能是 “engine” 的拼写错误；engine 指产生动力的发动机/引擎，也可指铁路机车，或比喻“推动力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “engine”) A machine that converts energy (such as fuel or electricity) into motion or power, especially to move a vehicle or run equipment.","zh":"（你可能想写：engine）引擎；发动机：把燃料或电能等能量转化为动力/运动的机器，常用于驱动车辆或设备。"},"examples":[{"en":"The car’s engine wouldn’t start this morning.","zh":"今天早上这辆车的发动机发动不起来。"},{"en":"This generator uses a small engine to produce electricity.","zh":"这台发电机用一个小型发动机来发电。"},{"en":"Turn off the engine before you get out of the car.","zh":"下车前先把发动机关掉。"}]},{"partOfSpeech":"n.","definition":{"en":"A locomotive on a railway; also used informally for a train engine.","zh":"（铁路）机车；火车头（也可非正式地指火车的动力机）。"},"examples":[{"en":"The engine pulled a long line of freight cars.","zh":"机车牵引着一长串货车。"},{"en":"We watched the steam engine at the museum.","zh":"我们在博物馆看了那台蒸汽机车。"}]},{"partOfSpeech":"n.","definition":{"en":"The main cause or driving force behind something (often used figuratively).","zh":"（比喻）推动力；根本动力；主要原因。"},"examples":[{"en":"Innovation is the engine of economic growth.","zh":"创新是经济增长的引擎。"},{"en":"Trust is the engine that keeps a team working well.","zh":"信任是让团队顺畅运作的动力。"}]}],"synonyms":["motor","machine","power plant","locomotive","driving force"],"phonetic":"/ˈendʒən/","extraExplanation":["“jyngine” 不是常见英文单词，很可能是把 “engine” 拼错了（开头多了 j）。正确拼写：engine。","词源小知识：engine 来自拉丁语 ingenium（天赋、巧思），早期可指“巧妙装置/器械”，后来逐渐固定为“发动机/引擎”。","常见搭配：engine oil（机油）, engine room（机舱/发动机舱/机房）, engine failure（发动机故障）, start the engine（启动发动机）。"]}
{"word":"jynx","summary":{"en":"“Jynx” is usually a nonstandard spelling of “jinx,” meaning bad luck (noun) or to bring bad luck (verb).","zh":"“jynx”通常是“jinx”的非标准拼写，可指“霉运/不祥之物”（名词）或“把好运说没、使倒霉”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “jinx”) A person, thing, or situation believed to bring bad luck, or a spell of bad luck.","zh":"（常见拼写为“jinx”）被认为会带来厄运的人、事物或情况；也指一段倒霉的时期。"},"examples":[{"en":"Some fans think the old stadium is a jinx for the team.","zh":"有些球迷觉得那座老球场会给球队带来霉运。"},{"en":"I’m not superstitious, but this feels like a jinx.","zh":"我不迷信，但这感觉像是不祥之兆。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Commonly spelled “jinx”) To cause bad luck for someone or something; to “curse” in a light, informal way.","zh":"（常见拼写为“jinx”）使（某人/某事）倒霉；（口语、较轻松地）“诅咒/带来霉运”。"},"examples":[{"en":"Don’t say we’ll win yet—you’ll jinx it.","zh":"别现在就说我们会赢——你会把好运说没的。"},{"en":"I told her the project was going smoothly, and I think I jinxed it.","zh":"我跟她说项目进展很顺利，结果我觉得我把它“说坏了”。"}]},{"partOfSpeech":"other","definition":{"en":"(Kids’ game) If two people say the same word at the same time, one may say “Jinx!” meaning the other must stay quiet until their name is spoken (rules vary).","zh":"（儿童游戏）两个人同时说出同一个词时，有人会喊“Jinx!”表示对方要保持安静，直到别人叫出其名字（规则因地而异）。"},"examples":[{"en":"We both said “pizza,” and he yelled, “Jinx!”","zh":"我们俩同时说了“披萨”，他就喊：“Jinx!”"},{"en":"In their game, you can’t talk after “jinx” until someone says your name.","zh":"按他们的玩法，喊了“jinx”后你就不能说话，直到有人叫你的名字。"}]}],"synonyms":["bad luck","curse","hex","hoodoo"],"phonetic":"/dʒɪŋks/","extraExplanation":["“jynx”通常被视为“jinx”的非标准拼写（多见于网名、品牌名或随意拼写）。在正式写作中建议用“jinx”。","词源上，“jinx”与“带来厄运/不祥”的民间观念有关；日常使用里常带一点玩笑语气：Don’t jinx it.（别乌鸦嘴/别把好运说没了。）"]}
{"word":"jyotishi","summary":{"en":"a Vedic (Indian) astrologer","zh":"吠陀（印度）占星师"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a practitioner of Jyotish (Vedic astrology); an Indian astrologer who interprets horoscopes and gives guidance based on traditional Hindu astrological systems","zh":"印度吠陀占星（Jyotish）的从业者；根据传统印度占星体系解读星盘、提供建议的占星师"},"examples":[{"en":"Before the wedding date was fixed, the family consulted a jyotishi for an auspicious time.","zh":"婚期敲定前，家人请一位jyotishi挑选吉时。"},{"en":"The jyotishi studied his birth chart and suggested practical steps, not just predictions.","zh":"这位jyotishi研究了他的出生星盘，给出的不只是预言，还有一些可行的建议。"},{"en":"In some communities, a jyotishi may be invited to bless a new home with a brief ritual.","zh":"在一些社群里，新居入宅时可能会请jyotishi来做简短的祈福仪式。"}]}],"synonyms":["astrologer","Vedic astrologer","Jyotish practitioner"],"phonetic":"/dʒoʊˈtɪʃi/","extraExplanation":["Jyotish 常译为“吠陀占星”或“印度占星”，在南亚文化中既与占星也与传统历法、择日（选择吉时）等实践有关。使用该词时，通常带有特定文化语境，和泛称的 astrologer（占星师）相比更具体。"],"etymology":"源自梵语 jyotiṣī，来自 jyotiṣa（意为“天文学/占星学”，字面与“光、星光”相关）。在英语里多用来指从事“吠陀占星（Jyotish）”的人。","mnemonic":["把它拆成发音记忆：jyo-TI-shi（重点在 TI），联想“吉优-提-师”＝“会看‘吉’时的老师/师傅”。","联想 Jyotish 里有“jyo-”像“jo（光）”，把它和“星光/光明”联系起来，记成“看星光的人”。"]}
{"word":"Jyutping","summary":{"en":"a romanization system for Cantonese pronunciation","zh":"用拉丁字母標記粵語讀音的轉寫系統"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a romanization system used to write Cantonese pronunciation with the Latin alphabet and tone numbers","zh":"一種用拉丁字母加聲調數字來標記粵語讀音的拼音／轉寫系統"},"examples":[{"en":"I’m learning Cantonese with Jyutping so I can pronounce words more accurately.","zh":"我用粵拼學粵語，這樣可以更準確地發音。"},{"en":"Many Cantonese dictionaries show characters with Jyutping and tone numbers.","zh":"很多粵語詞典會把漢字配上粵拼和聲調數字。"}]}],"synonyms":["Cantonese romanization","Cantonese transliteration"],"phonetic":"/ˈjuːt.pɪŋ/","extraExplanation":["粵拼常用 1–6（有時到 9）表示聲調，並用字母組合標記聲母、韻母；在學習發音、輸入法、詞典標音上很常見。","常見的另一種粵語轉寫是 Yale（耶魯拼音）；不同系統在拼寫與標調方式上有所差異。"],"etymology":"「Jyutping」源自粵語：Jyut（粵，廣東話）+ ping（拼，拼音）。作為一套系統名稱，常以專有名詞形式使用。","mnemonic":["把它拆成「Jyut=粵」「ping=拼」，直接記成「粵拼」。"]}

