{"word":"kb","summary":{"en":"KB usually means “kilobyte” (file size) or “knowledge base” (support articles), depending on context.","zh":"KB通常指“千字节（文件大小单位）”或“知识库（支持/文档文章）”，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"kilobyte; a unit of digital information, commonly used to describe file size.","zh":"千字节；表示数字信息量的单位，常用于描述文件大小。"},"examples":[{"en":"The photo is about 300 KB, so it will upload quickly.","zh":"这张照片大约300 KB，所以会很快上传。"},{"en":"Please keep the attachment under 500 KB.","zh":"请把附件控制在500 KB以内。"}]},{"partOfSpeech":"n.","definition":{"en":"knowledge base; a collection of helpful information (often articles or FAQs) used for support or learning, especially in workplaces and software.","zh":"知识库；用于支持或学习的信息集合（常见为文章、FAQ），多用于公司或软件客服场景。"},"examples":[{"en":"Check the KB for troubleshooting steps before contacting support.","zh":"联系技术支持前，先去知识库看看排查步骤。"},{"en":"We updated the KB article with the latest policy.","zh":"我们用最新政策更新了这篇知识库文章。"}]},{"partOfSpeech":"other","definition":{"en":"(informal texting) shorthand for “okay, cool” or a brief acknowledgment in chat; usage varies by community.","zh":"（非正式聊天）在部分社群中作简短回应，类似“行/好/收到”；用法因圈子而异。"},"examples":[{"en":"—Meet at 7? —kb.","zh":"—7点见？—kb（行/收到）。"}]}],"synonyms":["kilobyte","knowledge base","KB article"],"phonetic":"/ˌkeɪˈbiː/","extraExplanation":["在电脑存储里，KB有时被当作1000字节（十进制），有时被当作1024字节（二进制）。更严格的写法是：1000字节=KB，1024字节=KiB（kibibyte）。","“KB=knowledge base（知识库）”常见于企业内部、客服系统或软件文档中，比如“KB article（知识库文章）”。"]}
{"word":"kbar","summary":{"en":"kbar is short for kilobar, a pressure unit used mainly in scientific contexts.","zh":"kbar是kilobar（千巴）的缩写，主要用于科学领域的压力单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kilobar: a unit of pressure equal to 1,000 bar (about 100 megapascals), used especially in geology and high-pressure physics","zh":"千巴：压力单位，等于1000巴（约100兆帕），常用于地质学与高压物理"},"examples":[{"en":"The experiment was run at pressures up to 20 kbar.","zh":"该实验在高达20千巴的压力下进行。"},{"en":"Metamorphic minerals can form at several kbar deep underground.","zh":"变质矿物可能在地下深处、数千巴的压力下形成。"}]}],"synonyms":["kilobar","kbar (kilobar)","1000 bar"],"phonetic":"/ˈkeɪˌbɑr/","extraExplanation":["在日常英语里很少用kbar；更多出现在学术论文、地学（如变质作用、岩石圈压力）和高压材料研究中。","换算参考：1 kbar = 1000 bar ≈ 100 MPa；而1 bar ≈ 大气压（略小于1 atm）。"]}
{"word":"kbars","summary":{"en":"Kbars (plural of kbar) means kilobars, a pressure unit used mainly in geology and high-pressure research.","zh":"Kbars 是 kbar 的复数，表示“千巴”，一种主要用于地质与高压研究的压力单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of pressure equal to 1,000 bars (100 megapascals), used especially in geology and high-pressure science; “kbars” is the plural form.","zh":"压力单位，等于1000 bar（即100兆帕），常用于地质学与高压科学；“kbars”为其复数形式。"},"examples":[{"en":"The rock formed at pressures of about 10 kbars.","zh":"这种岩石大约在10 kbar的压力下形成。"},{"en":"The experiment reached 25 kbars in the pressure chamber.","zh":"实验在加压腔内达到了25 kbar。"}]}],"synonyms":["kilobar","kbar"],"phonetic":"ˈkeɪˌbɑr","extraExplanation":["kbar 常见于地球科学论文里，用来描述地壳或地幔环境的“成岩/变质压力”。作为直观换算：1 kbar = 100 MPa ≈ 1×10^8 Pa。日常生活中很少用到这个单位。"]}
{"word":"kbps","summary":{"en":"kbps = kilobits per second, a common way to describe internet speed or audio/video bitrate.","zh":"kbps 指“每秒千比特”，常用来描述网速或音视频的比特率。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Kilobits per second; a unit for measuring data transfer speed (how many thousands of bits are sent each second).","zh":"每秒千比特；用于衡量数据传输速度的单位（每秒传输多少“千个比特”）。"},"examples":[{"en":"This song streams at 128 kbps, so the audio quality is okay but not very high.","zh":"这首歌以 128 kbps 串流，所以音质还可以，但不算很高。"},{"en":"My internet speed is only 600 kbps, so video calls often lag.","zh":"我的网速只有 600 kbps，所以视频通话经常卡。"}]},{"partOfSpeech":"other","definition":{"en":"(Common use in audio/video) A bitrate setting that affects quality and file size; higher kbps usually means better quality and a larger file.","zh":"（音视频常用）比特率设置，会影响质量和文件大小；kbps 越高通常质量越好、文件越大。"},"examples":[{"en":"Try 320 kbps MP3 if you want better sound.","zh":"如果你想要更好的音质，可以试试 320 kbps 的 MP3。"},{"en":"Lower the bitrate to 64 kbps to make the file smaller.","zh":"把比特率降到 64 kbps，让文件更小。"}]}],"synonyms":["kilobits per second","bitrate (in context)"],"phonetic":"/ˌkeɪ biː piː ˈɛs/","extraExplanation":["kbps 里的 b 是 bit（比特，小写），不是 Byte（字节，大写 B）。1 Byte = 8 bits，所以 800 kbps 大约等于 100 kB/s（千字节/秒）。","在网络速率里，有时 k 按 1000 计算；而在存储容量里常见的 KiB、MiB 则按 1024 计算。看到不同写法时注意单位体系。"]}
{"word":"KBS","summary":{"en":"KBS most commonly means the Korean Broadcasting System, and in computing it can also mean a knowledge-based system.","zh":"KBS 最常见指韩国广播公司；在计算机领域也可指基于知识的系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Korean Broadcasting System (South Korea’s national public broadcaster).","zh":"韩国广播公司（韩国的国家级公共广播电视机构）。"},"examples":[{"en":"KBS News reported the results of the election on TV and online.","zh":"KBS 新闻在电视和网络上报道了选举结果。"},{"en":"I watched a KBS drama to practice listening to Korean.","zh":"我看了一部 KBS 的韩剧来练习韩语听力。"}]},{"partOfSpeech":"n.","definition":{"en":"A knowledge-based system: a computer system that uses stored expert knowledge (rules/facts) to help make decisions or solve problems.","zh":"基于知识的系统：利用存储的专家知识（规则/事实）来辅助决策或解决问题的计算机系统。"},"examples":[{"en":"The hospital built a KBS to help doctors check possible diagnoses.","zh":"医院建立了一个 KBS 来帮助医生核对可能的诊断。"},{"en":"In class, we compared a KBS with modern machine-learning models.","zh":"在课上，我们把 KBS 和现代机器学习模型做了比较。"}]}],"synonyms":["Korean Broadcasting System (for the broadcaster)","knowledge-based system (for the computing sense)"],"phonetic":"/keɪ bi ɛs/","extraExplanation":["“KBS”是缩写，含义取决于语境。谈韩国媒体时，几乎总指“Korean Broadcasting System”；在计算机/人工智能课程或文献里，常指“knowledge-based system”。","读法通常按字母念：K-B-S（/keɪ bi ɛs/）。"]}

