{"word":"kh","summary":{"en":"“kh” is usually seen as an abbreviation (often for Cambodia/Khmer) or as a letter pair used in spelling/transliteration.","zh":"“kh”通常作为缩写（常指柬埔寨／高棉）出现，或作为拼写／转写中的字母组合。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Cambodia / Khmer (often used as a country code or language label, e.g., “KH” for Cambodia).","zh":"（缩写）柬埔寨／高棉（常用作国家代码或语言标签，例如“KH”表示柬埔寨）。"},"examples":[{"en":"I’m traveling to KH next month for a conference.","zh":"我下个月要去 KH（柬埔寨）参加会议。"},{"en":"The website lists Khmer as “kh.”","zh":"这个网站把高棉语标成“kh”。"}]},{"partOfSpeech":"other","definition":{"en":"(linguistics) A letter pair used in some spellings/transliterations to represent a “k + h” sound, as in “khaki,” or to show a special consonant sound in some languages.","zh":"（语言学）在一些拼写／转写中用来表示“k+h”的字母组合（如 khaki），或在某些语言中表示一种特殊辅音。"},"examples":[{"en":"In English, “kh” appears in words like “khaki.”","zh":"在英语里，“kh”出现在“khaki（卡其色）”这类词中。"},{"en":"Some transliteration systems use “kh” to show a rougher “k” sound.","zh":"一些转写系统用“kh”来表示更“粗擦”的 k 类发音。"}]}],"synonyms":["KH","Cambodia","Khmer"],"phonetic":"/keɪ eɪtʃ/","extraExplanation":["“KH”是柬埔寨的常见国家代码（ISO 3166-1 alpha-2）。语言代码方面，高棉语在一些场景也会写作“kh”，但更标准的语言代码常见为“km”（ISO 639-1）。","如果你本来想输入的是频率单位“千赫”，标准写法是“kHz”（kilohertz），而不是“kh”。"]}
{"word":"kha","summary":{"en":"“kha” is a Thai polite particle (often used by women) added to the end of a sentence or used as a polite “yes/okay.”","zh":"“kha”是泰语礼貌语气词（多为女性使用），常放句末或用来礼貌地表示“是的/好的”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A Thai polite ending particle (romanized as “kha”) used mainly by women to show politeness or soft emphasis at the end of a sentence; it can also be used to answer “yes/okay” politely.","zh":"泰语礼貌语气词（常罗马化写作 “kha”），主要由女性在句末使用以表示礼貌或柔和强调；也可用于礼貌地回应“是的/好的”。"},"examples":[{"en":"Thank you kha.","zh":"谢谢你（kha，女性礼貌语气词）。"},{"en":"Yes, kha. I understand.","zh":"是的（kha）。我明白了。"},{"en":"Wait a moment, kha.","zh":"请稍等一下（kha）。"}]}],"synonyms":["ka","ค่ะ (kha)","คะ (kha)","khrap (male equivalent)"],"phonetic":"/kɑː/","extraExplanation":["“kha”通常对应泰文“ค่ะ/คะ”，多用于女性说话；男性更常用“khrap/krub（ครับ）”。","它不是英语单词，而是泰语的礼貌语气词；放在句尾时更自然，相当于用语气表达“礼貌、柔和”。","在英文聊天或旅游场景中，人们会用罗马字写作“kha/ka”，拼写可能因系统不同而变化。"]}
{"word":"khaddar","summary":{"en":"Khaddar is a coarse handspun, handwoven cloth (often cotton) from South Asia, and it can also describe clothing made from that cloth.","zh":"Khaddar 指南亚常见的手纺手织粗布（多为棉），也可用来形容“由这种布制成的”衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coarse, durable cloth (usually cotton) that is handspun and handwoven in South Asia; often associated with local, traditional textile-making.","zh":"（南亚常见的）卡达布/土布：一种较粗、结实的手纺手织布料（多为棉），常与本地传统纺织有关。"},"examples":[{"en":"He wore a simple khaddar kurta in the summer heat.","zh":"他在炎热的夏天穿了一件朴素的卡达布库尔塔（长衫）。"},{"en":"The artisan sells khaddar fabric dyed with natural colors.","zh":"这位工匠出售用天然染料染色的卡达布布料。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of khaddar cloth; homespun in a traditional style.","zh":"由卡达布（手纺手织土布）制成的；传统“家织布”风格的。"},"examples":[{"en":"She chose a khaddar shawl because it was breathable and sturdy.","zh":"她选了一条卡达布披肩，因为透气又耐用。"},{"en":"They prefer khaddar clothing for everyday wear in the village.","zh":"在村里，他们更喜欢穿卡达布衣物作为日常穿着。"}]}],"synonyms":["khadi","homespun","handspun cloth","handwoven cloth"],"phonetic":"/ˈkɑːdɑːr/","extraExplanation":["“Khaddar”常与“khadi（卡迪布）”并用或互指，在不同地区拼写与用法略有差异。它在南亚不仅是布料名称，也常带有“本土手工、支持乡村经济”的文化意味。","在印度独立运动语境中，手纺手织布（khadi/khaddar）曾被强调为自给自足与反对殖民时期工业纺织品的一种象征。"]}
{"word":"khaddars","summary":{"en":"Khaddars are types of rough handspun, handwoven cotton cloth (or clothes made from it) in South Asia.","zh":"Khaddars 指南亚常见的粗手纺手织棉布，或用这种布制成的衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) A rough, handspun and handwoven cotton cloth; also cloth or clothing made from it (plural: khaddars).","zh":"（南亚）一种较粗的手纺手织棉布；也可指用这种布做成的布料或衣物（复数：khaddars）。"},"examples":[{"en":"He wore a khaddar kurta in the summer heat.","zh":"他在夏日炎热中穿着一件khaddar（手纺棉布）库尔塔长衫。"},{"en":"The shop sells khaddars in natural colors like white and beige.","zh":"那家店出售本色的khaddar布料，比如白色和米色。"}]}],"synonyms":["khadi","homespun cloth","handspun cloth"],"phonetic":"/ˈkʌdər/","extraExplanation":["“Khaddar”常与“khadi（卡迪布）”相关，都是南亚语境中指手纺手织布的词；在印度独立运动与“国货运动（Swadeshi）”的历史中，手纺布被赋予支持本土生产、反对殖民经济控制的象征意义。不同地区也可能把较厚、较粗的手织棉/棉混纺布称为khaddar，用于耐穿或较凉爽季节的衣物。"]}
{"word":"khadi","summary":{"en":"Khadi is traditional Indian handspun, handwoven cloth (often cotton), and it can also describe clothing made from that cloth.","zh":"Khadi 指印度传统的手纺手织布（常为棉布），也可指用这种布做的衣物或“卡迪布制的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a handspun, handwoven cloth (often cotton) from India; also the cloth or clothing made from it","zh":"（印度）卡迪布；手纺手织布（常为棉布）；也指用这种布做的衣物"},"examples":[{"en":"She bought a khadi scarf at a local handloom market in India.","zh":"她在印度当地的手织市场买了一条卡迪布围巾。"},{"en":"Khadi is valued for being breathable and comfortable in hot weather.","zh":"卡迪布因透气、适合炎热天气而受到喜爱。"},{"en":"The designer used khadi fabric to highlight traditional Indian craftsmanship.","zh":"设计师使用卡迪布面料来凸显印度传统工艺。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of khadi cloth","zh":"卡迪布制的；用手纺手织布做的"},"examples":[{"en":"He wore a khadi kurta to the ceremony.","zh":"他在仪式上穿了一件卡迪布库尔塔（长衫）。"},{"en":"The brand sells khadi shirts and simple cotton dresses.","zh":"这个品牌出售卡迪布衬衫和简洁的棉质连衣裙。"}]}],"synonyms":["handloom cloth","handwoven cloth","homespun (approx.)"],"phonetic":"/ˈkɑːdi/","extraExplanation":["“khadi”（也常拼作“khaddar”）在印度近现代史上有重要象征意义：甘地（Gandhi）在“自力更生/国货运动（Swadeshi movement）”中推广纺车与卡迪布，鼓励人们抵制英国工业纺织品，支持本土手工与经济独立。","在当代语境里，khadi常与“手工、在地工艺、可持续/慢时尚”联系在一起，但在不同地区与品牌中，面料成分与工艺也可能有差异（如棉、丝、羊毛混纺等）。"]}
{"word":"khadis","summary":{"en":"Khadi is a traditional Indian hand-spun, hand-woven cloth, often linked to sustainability and India’s independence movement.","zh":"Khadi 是一种源自印度的手纺手织传统布料，常与可持续理念及印度独立运动的历史象征联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hand-spun, hand-woven cloth (usually cotton, sometimes silk or wool), traditionally made in India and associated with village weaving and self-reliance","zh":"卡迪布；手纺手织布（通常为棉布，也可为丝或羊毛），源自印度传统织造，常与乡村织布与自力更生观念相关"},"examples":[{"en":"She bought a khadi scarf from a local artisan market.","zh":"她在当地手工艺人集市买了一条卡迪布围巾。"},{"en":"The shirt is made of khadi cotton, so it feels breathable in summer.","zh":"这件衬衫是卡迪棉布做的，所以夏天穿很透气。"},{"en":"Many designers now use khadi to support sustainable fashion.","zh":"许多设计师如今使用卡迪布来支持可持续时尚。"}]}],"synonyms":["handwoven cloth","homespun cloth","khaddar"],"phonetic":"/ˈkɑdi/","extraExplanation":["“Khadi”（也常拼作“khaddar”）在印度历史与文化中很有象征意义：在20世纪印度独立运动期间，甘地（Gandhi）提倡纺线与穿着khadi，以抵制英国工业纺织品，并鼓励本土手工业与经济自立。","你输入的“khadis”通常是“khadi”的复数，表示“多种/多件khadi制品”（例如不同款式的khadi布料、衣物）。在英文里也常直接用“khadi”作不可数名词来指这种布料。"]}
{"word":"khaf","summary":{"en":"“Khaf” is a non-standard spelling used online to mean “afraid/scared,” influenced by Urdu/Hindi or Arabic.","zh":"“khaf”多为网络/口语中的非标准拼写，受乌尔都语/印地语或阿拉伯语影响，用来表达“害怕/恐惧”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Informal transliteration from Urdu/Hindi or Arabic) afraid; scared; feeling fear.","zh":"（非正式音译，源自乌尔都语/印地语或阿拉伯语）害怕的；恐惧的；感到担心。"},"examples":[{"en":"Don’t be khaf—nothing bad is going to happen.","zh":"别 khaf（别害怕）——不会有坏事发生。"},{"en":"He sounded khaf when he heard the noise outside.","zh":"他听到外面的声音时听起来很害怕。"}]},{"partOfSpeech":"v.","definition":{"en":"(In Arabic/Urdu usage) to fear; to be afraid (often seen as “khauf/khof” for “fear”).","zh":"（在阿拉伯语/乌尔都语用法中）害怕；恐惧（也常见写作 khauf/khof 表示“恐惧”）。"},"examples":[{"en":"Some people write it as “khauf/khof,” meaning “fear.”","zh":"有些人会写成“khauf/khof”，意思是“恐惧”。"}]}],"synonyms":["afraid","scared","fearful","anxious"],"phonetic":"/kɑf/","extraExplanation":["“khaf”不是标准英语词条，更常见于聊天、字幕或移民社群的拉丁字母拼写（romanization）。不同地区会有不同拼法（如 khaf / khauf / khof），发音里的“kh”往往接近一种英语里不常见的摩擦音（类似德语 Bach 的音）。如果你告诉我它出现的句子或语境（比如哪种语言/地区），我可以给出更准确的对应词和用法。"]}
{"word":"khafajeh","summary":{"en":"Khafajeh is primarily a surname; it may also be a variant spelling connected to Al-Khafaji/Khafaji in Arabic usage.","zh":"Khafajeh 主要是一个姓氏；也可能是与阿拉伯语用法中 Al-Khafaji/Khafaji 相关的拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), most commonly found among Persian/Iranian and some Arabic-speaking communities; used to identify a person’s family or lineage.","zh":"一个姓氏，常见于波斯语/伊朗人及部分阿拉伯语社群；用于表示一个人的家族或血缘来源。"},"examples":[{"en":"Dr. Khafajeh will speak at the conference today.","zh":"Khafajeh 医生今天会在会议上发言。"},{"en":"I met Ms. Khafajeh through a mutual friend.","zh":"我通过一位共同的朋友认识了 Khafajeh 女士。"}]},{"partOfSpeech":"other","definition":{"en":"A spelling variant of Al-Khafaji/Khafaji, sometimes used to refer to the Khafaja (Khafajah) tribal name in Arabic contexts.","zh":"Al-Khafaji/Khafaji 的一种拼写变体；在阿拉伯语语境中有时与“Khafaja（Khafajah）”部族名称相关。"},"examples":[{"en":"Some records list the name as Khafajeh, while others use Khafaji.","zh":"有些记录写作 Khafajeh，另一些则用 Khafaji。"}]}],"synonyms":["Khafaji","Al-Khafaji","Khafaje"],"phonetic":"/kɑːfəˈdʒeɪ/","extraExplanation":["“Khafajeh/Khafaje(h)”通常不是英语词汇，而是姓名的拉丁字母转写。由于从阿拉伯语或波斯语转写到英文时没有唯一标准，同一个姓氏可能出现多种拼写（如 Khafajeh / Khafaje / Khafaji / Al-Khafaji）。","英文里遇到这类姓名时，最礼貌且最准确的做法是询问当事人偏好的读音与拼写（例如：How do you pronounce your last name?）。"]}
{"word":"khafs","summary":{"en":"“Khafs” is not a standard English word; it’s likely an Arabic transliteration meaning “lowering/reduction,” and sometimes appears in sensitive cultural discussions.","zh":"“Khafs”不是标准英语词，更可能是阿拉伯语音译，意为“降低/减少”，有时也会出现在敏感的文化议题讨论中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare transliteration of an Arabic term (more commonly written “khafd” or “khafḍ”), meaning “lowering” or “reduction.” In some cultural/religious discussions, it may also refer to a form of female genital cutting (a sensitive and harmful practice).","zh":"一种少见的阿拉伯语音译写法（更常写作“khafd/khafḍ”），本义为“降低、减弱、减少”。在一些文化/宗教语境中，它也可能指代一种女性生殖器切割（敏感且有害的做法）。"},"examples":[{"en":"I couldn’t find “khafs” in standard English dictionaries; it seems to be an Arabic transliteration.","zh":"我在常见英语词典里找不到“khafs”，它看起来像是阿拉伯语音译。"},{"en":"In some writings, “khafs/khafd” is discussed in a cultural context, but it’s important to approach the topic with care.","zh":"在一些文章中会在文化语境里讨论“khafs/khafd”，但这是个需要谨慎对待的话题。"}]}],"synonyms":["khafd","lowering","reduction"],"phonetic":"/kɑfs/","extraExplanation":["“khafs”并不是常见英语词汇；更可能是把阿拉伯语词音译到拉丁字母后的拼写变体。不同地区/作者会用不同拼写（如 khafd、khafḍ、khafs），因此检索时建议尝试多种拼法。","如果你是在特定文章、宗教/文化讨论或人名中看到“khafs”，它的含义可能会因语境而变化；你可以把原句发来，我可以帮你按语境精确解释。"]}
{"word":"khagiarite","summary":{"en":"“khagiarite” is not recognized as a common English word; it likely needs spelling or context to identify.","zh":"“khagiarite”不是常见英语词；需要核对拼写或提供上下文才能确定其含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling, a very rare technical term, or a proper name (e.g., a mineral/species/place name).","zh":"这不是常见英语词典里的标准词；可能是拼写错误、非常罕见的专业术语，或专有名词（如矿物/物种/地名等）。"},"examples":[{"en":"I can’t find “khagiarite” in standard English dictionaries—could you check the spelling?","zh":"我在常见英语词典里找不到“khagiarite”——你能检查一下拼写吗？"},{"en":"If “khagiarite” is a scientific name, please share the field (geology, biology, etc.) so I can define it accurately.","zh":"如果“khagiarite”是科学名称，请告诉我所属领域（地质、生物等），我才能更准确地解释。"}]}],"phonetic":"N/A","extraExplanation":["如果你是在论文、矿物/岩石目录或商品名里看到的这个词，建议你：\n1) 贴出原句（上下文）或截图；\n2) 确认大小写与拼写（专有名词常区分大小写）；\n3) 告诉我来源（书名/网站/学科）。\n这样我可以判断它到底是拼写变体、音译词，还是某个非常小众的术语。"]}
{"word":"khahoon","summary":{"en":"“Khahoon” is a romanized Hindi/Urdu phrase related to “to eat,” often meaning “I’ll eat” or “Should I eat?” depending on context.","zh":"“Khahoon”是印地语/乌尔都语里与“吃”有关的罗马字拼写，常表示“我会吃/我要吃”或“要不要吃”，取决于语境。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A romanized Hindi/Urdu phrase (खाऊँ / کھاؤں), usually meaning “I will eat,” “I would eat,” or “may/should I eat?” depending on context and tone.","zh":"一个印地语/乌尔都语的拉丁字母拼写（खाऊँ / کھاؤں），常表示“我会吃 / 我想吃 / 我该不该吃（要不要吃）”，具体含义取决于语境和语气。"},"examples":[{"en":"If I’m hungry, I might say “khahoon” to mean “I’ll eat.”","zh":"如果我饿了，可能会说“khahoon”，意思接近“我会吃（我就吃）”。"},{"en":"In a question, it can mean “Should I eat now?”","zh":"在疑问句里，它也可能表示“我现在要不要吃？”"}]},{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling or a personal transliteration. If you meant an English word, please share the sentence.","zh":"这不是标准英语单词；可能是拼写错误或个人音译。如果你想查的是英语词，请提供所在句子以便确认。"},"examples":[{"en":"I saw “khahoon” in a chat—what language is it?","zh":"我在聊天里看到“khahoon”——这是什么语言？"}]}],"synonyms":["khaun","khaaun","kha hoon"],"phonetic":"/kɑː huːn/","extraExplanation":["“khahoon”常见于南亚语言的罗马字（Roman Urdu / Roman Hindi）书写。它对应的动词来自“kha-（吃）”，并带有表示“我”的词尾/助动成分；在口语里可表达将来、意愿或带建议/征询的语气（类似“我要吃吗/我就吃吧”）。","不同的人会写成 khaun / khāū̃ / kha hoon / khahoon 等多种拼法。若你把原句发来（例如前后文、是否是疑问句），我可以更准确地翻译成英文/中文。"]}
{"word":"khaiki","summary":{"en":"Khaki means a light yellowish-brown color and also describes clothing in that color, often associated with uniforms.","zh":"Khaki 指卡其色（浅黄褐色），也可形容卡其色的衣物，常与制服相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light yellowish-brown color, often used for uniforms and casual clothing","zh":"卡其色；一种浅黄褐色，常用于制服和休闲服装"},"examples":[{"en":"He wore khaki pants and a white shirt to work.","zh":"他穿着卡其裤和白衬衫去上班。"},{"en":"The room was painted a warm khaki color.","zh":"房间刷成了温暖的卡其色。"}]},{"partOfSpeech":"adj.","definition":{"en":"light yellowish-brown (especially describing cloth or clothing)","zh":"卡其色的；浅黄褐色的（尤指布料或衣物）"},"examples":[{"en":"She chose a khaki jacket for the trip.","zh":"她为旅行选了一件卡其色夹克。"},{"en":"Many schools require khaki uniforms.","zh":"许多学校要求穿卡其色制服。"}]}],"synonyms":["tan","beige","sand-colored","light brown"],"phonetic":"/ˈkɑːki/","extraExplanation":["你输入的“khaiki”通常是拼写错误；更常见的正确拼写是 **khaki**。","“khaki”一词最初来自南亚语言（如乌尔都语/印地语），意思接近“尘土色”。在英语里它常与军装、制服文化相关，因此也带有“耐脏、实用、朴素”的联想。","常见搭配：**khaki pants/trousers**（卡其裤）、**khakis**（口语：卡其裤，复数用法很常见）。"]}
{"word":"khair","summary":{"en":"Khair means “goodness/well-being” and can also be used to ask “Are you okay?” in some cultures.","zh":"Khair 常表示“善、福祉/安康”，也可用作口语问候，表示“你还好吗/怎么了？”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Arabic, Urdu, Persian, etc.) goodness, well-being, or something good; used to talk about welfare or a good outcome.","zh":"（阿拉伯语、乌尔都语、波斯语等）“善、好、福祉/安康”；也可指“好事、好的结果”。"},"examples":[{"en":"I wish you khair and peace.","zh":"我祝你安康（khair）与平安。"},{"en":"They prayed for khair for the whole family.","zh":"他们为全家祈求好事与福祉（khair）。"}]},{"partOfSpeech":"int.","definition":{"en":"(as a casual question) “Is everything okay?” or “What’s going on?” depending on context and tone.","zh":"（口语问句）根据语气可表示“还好吗/没事吧？”或“怎么了/发生什么事了？”"},"examples":[{"en":"Khair? You look worried.","zh":"Khair？你看起来有点担心。"},{"en":"He texted, “Khair?” after I went quiet.","zh":"我突然不说话后，他发消息问：“Khair？”"}]}],"synonyms":["goodness","well-being","welfare","good outcome"],"phonetic":"/kaɪr/","extraExplanation":["“khair”常写作 خير（阿拉伯语）。在很多穆斯林文化语境里，它和祝福、祈愿密切相关，比如“khair inshallah”（意为“大概会是好事/若真主愿意会顺利”）。","在不同地区发音会有差异：有的更接近喉音“kh”（类似清擦音），也有人在英语语境里简化为更像/k/的读法。"]}
{"word":"khaja","summary":{"en":"Khaja is a South Asian sweet pastry, often layered and soaked in sugar syrup.","zh":"Khaja 是一种南亚甜点，多层起酥，常裹或浸糖浆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South Asian sweet pastry (often layered and fried or baked), usually soaked in sugar syrup; popular in parts of India and Nepal","zh":"一种南亚甜点（常见做法是多层起酥后油炸或烘烤），通常会裹或浸糖浆；在印度和尼泊尔部分地区很常见"},"examples":[{"en":"We bought khaja from a sweet shop and shared it with tea.","zh":"我们从甜品店买了 khaja，配茶一起分享。"},{"en":"Khaja is often served during festivals and family celebrations.","zh":"Khaja 常在节日和家庭庆祝活动中供应。"},{"en":"The khaja was crispy on the outside and syrupy inside.","zh":"这块 khaja 外脆内甜，带着糖浆的口感。"}]}],"synonyms":["South Asian sweet pastry","festival sweet"],"phonetic":"/ˈkɑːdʒə/","extraExplanation":["“Khaja”更多是南亚饮食文化里的词，不是日常英语核心词汇；在英文语境中通常直接借用原词（loanword），在菜单或旅行/美食写作里更常见。","不同地区的 khaja 做法和口感会有差异：有的更像多层酥皮甜点，有的会更硬脆；常见搭配是糖浆、豆蔻（cardamom）等香料。"]}
{"word":"khajur","summary":{"en":"Khajur is a South Asian word commonly used to mean “date” (the fruit) or the date palm.","zh":"Khajur 是南亚常用词，通常指“椰枣（水果）”，也可指椰枣树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) a date (the fruit), or a date palm.","zh":"（南亚英语）椰枣（这种水果）；也可指椰枣树/椰枣棕榈。"},"examples":[{"en":"Would you like some khajur after dinner?","zh":"晚饭后你想吃点椰枣（khajur）吗？"},{"en":"She bought a packet of khajur from the Indian grocery store.","zh":"她从印度杂货店买了一包椰枣（khajur）。"},{"en":"In some regions, khajur trees are grown in hot, dry climates.","zh":"在一些地区，椰枣树（khajur）会种在炎热干燥的气候里。"}]}],"synonyms":["date","dates","date palm"],"phonetic":"/kəˈdʒʊr/","extraExplanation":["“khajur/khajoor”常见于印地语、乌尔都语等南亚语言的转写，在南亚语境里多指“椰枣（date）”。在英文对话中使用时，通常属于带有地域文化色彩的词汇；更通用的英语说法是“date”或“dates”。","注意不要与英语里的“cashew（腰果）”混淆：两者读音相近但含义完全不同。"]}
{"word":"khakanship","summary":{"en":"Khakanship means the rank/office or reign of a khakan (khagan), a supreme ruler in some Central Asian steppe empires.","zh":"Khakanship 指“可汗（大汗）”这一最高统治者的职位/地位或在位时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, rank, or period of rule of a khakan (also spelled khagan/qağan), a title for a supreme ruler or “emperor” in some Turkic and Mongolic empires","zh":"可汗（亦拼作 khagan/qağan）这一最高统治者头衔的职位、地位，或其在位时期"},"examples":[{"en":"After the leader’s death, rival clans fought over the khakanship.","zh":"首领去世后，各部族为争夺可汗之位而交战。"},{"en":"The chronicler described the khakanship as a sacred duty to unite the tribes.","zh":"史官将可汗统治描述为一种神圣职责，用以统一各部族。"}]}],"synonyms":["khaganate","the reign of the khagan","sovereignty (context-dependent)"],"phonetic":"/ˈkɑkənʃɪp/","extraExplanation":["“khakanship”是由头衔“khakan/khagan/qağan”（常译“可汗”“大汗”）+ 后缀 “-ship”（表示“身份/职位/状态”，如 kingship 王权）构成的抽象名词。","该词多见于历史研究或翻译语境，讨论突厥、蒙古及相关草原政权的最高统治结构；在一般现代英语中比较少用，写作时也常用更常见的拼写“khaganate”（可汗国）或直接写“the reign/office of the khagan”（可汗的在位/职位）。"]}
{"word":"khakham","summary":{"en":"“Khakham” is not a standard English word; it is most likely a proper name with no fixed meaning in English.","zh":"“Khakham”不是标准英语词汇；更可能是专有名词（人名/地名），在英语中没有固定词义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English vocabulary word). It may be used as a personal name, family name, or place name in some cultures, but it has no widely accepted dictionary meaning in English.","zh":"专有名词（不是标准英语词汇）。在某些文化中可能作为人名、姓氏或地名使用，但在英语里没有公认的词典释义。"},"examples":[{"en":"My classmate Khakham speaks three languages.","zh":"我的同学 Khakham 会说三种语言。"},{"en":"Khakham is listed as a contact in my phone.","zh":"Khakham 在我的手机里是一个联系人。"}]}],"phonetic":"ˈkɑːkɑːm","extraExplanation":["“khakham”不常见于英语词典里，所以很可能是音译/拼写变体或某种语言中的名字（如南亚、东南亚等地区的人名/地名）。","如果你是想查某个英文单词，可能存在拼写错误。你可以告诉我它出现的句子或语境（例如一段短信/文章/地名/人名），我可以帮你判断它的来源、正确拼写，以及最贴切的含义。"]}
{"word":"khaki","summary":{"en":"Khaki is a light brown/yellow-brown color and also describes clothing in that color, often associated with uniforms or casual pants.","zh":"Khaki 指卡其色（浅棕或偏黄棕），也可形容卡其色的衣物，常与制服或休闲裤风格相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light brown or yellowish-brown color, often like dust or sand","zh":"卡其色；一种浅棕色或偏黄的棕色，常像尘土或沙子的颜色"},"examples":[{"en":"The walls were painted khaki to match the desert theme.","zh":"墙被刷成卡其色，以搭配沙漠主题。"},{"en":"She chose a khaki backpack because it doesn’t show dirt easily.","zh":"她选了一个卡其色的背包，因为不容易显脏。"}]},{"partOfSpeech":"adj.","definition":{"en":"made in or having a khaki color (often used for casual or uniform-style clothing)","zh":"卡其色的；（常指休闲或制服风格的）卡其色衣物/布料"},"examples":[{"en":"He wore khaki pants and a white shirt to the interview.","zh":"他穿着卡其裤和白衬衫去面试。"},{"en":"Our school uniform includes a khaki skirt.","zh":"我们的校服包括一条卡其色的裙子。"}]}],"synonyms":["tan","beige","light brown","sand-colored"],"phonetic":"/ˈkɑːki/","extraExplanation":["“khaki”最早来自印地语/乌尔都语，意思与“尘土色”相关。后来在英军殖民时期被用来指一种适合隐蔽的土黄色制服颜色，因此常和“制服、工装、军装风格”联系在一起。"]}
{"word":"khakied","summary":{"en":"Khakied means dressed in khaki-colored clothing, often suggesting a uniform or practical outdoor style.","zh":"Khakied 指“穿着卡其色衣服的”，常带有制服或实用户外风格的联想。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing khaki (light brown/greenish-brown) clothing; dressed in khaki, often associated with uniforms or practical outdoor wear.","zh":"穿着卡其色（浅棕/黄褐或略带绿的棕色）衣服的；身着卡其装的（常让人联想到制服或实用的户外穿着）。"},"examples":[{"en":"The soldiers, khakied and dusty, marched back to camp.","zh":"士兵们身着卡其色军装、满身尘土，行军回到营地。"},{"en":"He arrived in a khakied jacket and hiking boots.","zh":"他穿着卡其色夹克和登山靴到了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made khaki-colored; turned into a khaki shade (less common).","zh":"变成卡其色的；被染成卡其色的（较少见）。"},"examples":[{"en":"After months in the sun, the originally green fabric looked khakied.","zh":"在阳光下晒了几个月后，原本绿色的布料看起来发黄褐了（呈卡其色）。"}]}],"synonyms":["dressed in khaki","khaki-clad","uniformed"],"phonetic":"/ˈkɑːkid/","extraExplanation":["“khaki”一词源自南亚语言（常说来自乌尔都语/波斯语相关词根），本义与“尘土、土色”有关，所以卡其色常给人耐脏、朴素、实用的感觉。","“khakied”多见于描写性写作（尤其是军旅/旅行/户外场景），日常口语里更常说“wearing khaki”或“dressed in khaki”。"]}
{"word":"khakilike","summary":{"en":"Khakilike means “similar to khaki,” especially in color (tan/light brown) or in a plain, practical style.","zh":"Khakilike 指“像卡其的”，多用于颜色（浅棕/土黄）或朴素、实用的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling khaki in color (a light brown/tan) or having a similar plain, practical look like khaki clothing.","zh":"像卡其色的；呈浅棕/土黄色的；或外观风格像卡其服装那样朴素、实用的。"},"examples":[{"en":"The walls were painted a khakilike tan that made the room feel calm.","zh":"墙刷成一种类似卡其色的浅棕色，让房间显得很安静。"},{"en":"He wore a khakilike jacket that looked practical and outdoorsy.","zh":"他穿了一件卡其风格的夹克，看起来很实用、很适合户外。"},{"en":"The bird’s feathers had a khakilike shade that helped it blend into dry grass.","zh":"那只鸟的羽毛带着类似卡其色的色调，能让它在干草里更好地伪装。"}]}],"synonyms":["khaki-colored","tan","beige","khaki-like","drab"],"phonetic":"/ˈkækiˌlaɪk/","extraExplanation":["“khaki”原指一种“尘土色/土黄色”的颜色，也常指卡其布或卡其裤等服装风格；来源与军装、制服有关，因此带有“朴素、耐用、实用”的联想。把 -like 加在后面（khaki + like）就是“像卡其（颜色/风格）一样”的意思。","写作上也常见带连字符的形式：khaki-like。"]}
{"word":"khakis","summary":{"en":"Khakis are tan cotton twill trousers (or the fabric), and “khaki” can also mean the tan color.","zh":"Khakis 指卡其裤/卡其布；khaki 也可指卡其色（浅棕、土黄色）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Light-brown (tan) trousers, often made of cotton twill; also the fabric used to make them.","zh":"卡其裤（浅棕/土黄色的长裤），也可指“卡其布”（常用于做裤子的棉质斜纹布）。"},"examples":[{"en":"He wore khakis and a white shirt to the office.","zh":"他穿着卡其裤和白衬衫去办公室。"},{"en":"Our school uniform includes khakis.","zh":"我们学校的校服包括卡其裤。"},{"en":"These khakis are comfortable for traveling.","zh":"这条卡其裤很适合旅行，穿起来很舒服。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the color of khaki; light brown or tan.","zh":"卡其色的；浅棕色/土黄色的。"},"examples":[{"en":"She chose a khaki jacket for the fall weather.","zh":"她选了一件卡其色夹克来应对秋天的天气。"},{"en":"The bag comes in black, navy, and khaki.","zh":"这个包有黑色、海军蓝和卡其色可选。"}]}],"synonyms":["chinos","tan pants","khaki-colored","twill (fabric)"],"phonetic":"/ˈkækiz/","extraExplanation":["“khaki”源自南亚语言（常见说法与印地语/乌尔都语中表示“尘土、尘色”的词有关），后来在英军制服中流行，用于在野外更不显眼。如今“khakis”在美式英语里很常指一类休闲长裤（偏正式但不算西装裤），常见于上班、校服或“business casual（商务休闲）”穿搭。","用法提示：当你说“a pair of khakis / my khakis”通常指“卡其裤”；当你说“khaki (color)”更像在说“卡其色”。另外，“khakis”不一定都是卡其色，也可能指这种款式/布料的裤子。"]}
{"word":"khalal","summary":{"en":"Khalal is a rare loanword meaning a defect or disturbance (not the same as halal).","zh":"Khalal 是较少见的外来词，意为“缺陷/紊乱”，不同于表示“清真”的 halal。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Arabic, used in some Islamic/South Asian contexts) a defect, flaw, or disturbance in how something works; an imbalance or problem in a system.","zh":"（源自阿拉伯语，见于部分伊斯兰/南亚语境）缺陷、漏洞；运作上的紊乱或失衡。"},"examples":[{"en":"There is a khalal in the process, so we need to review each step.","zh":"流程里有个khalal（漏洞/问题），所以我们需要逐步检查。"},{"en":"The report points to a khalal in the supply chain that caused delays.","zh":"报告指出供应链中存在khalal（失衡/故障点），导致了延误。"}]}],"synonyms":["defect","flaw","fault","problem","imbalance","disorder"],"phonetic":"/kəˈlɑl/","extraExplanation":["在英语里 **khalal** 并不常见，更多是把阿拉伯语 **خلل**（khalal，意为“缺陷/紊乱”）音译过来，在宗教讲座、乌尔都语/阿拉伯语背景的英文交流中偶尔出现。","很多学习者会把 **khalal** 和更常见的 **halal**（清真、合规的）混淆：**halal** 指“宗教上允许的”，而 **khalal** 指“缺陷/问题”。如果你的意思是“清真”，正确拼写通常是 **halal**。"]}
{"word":"khalat","summary":{"en":"A ceremonial “robe of honor” given as a mark of favor, especially in Islamic courts.","zh":"一种礼仪性的“赐袍/荣袍”，常见于伊斯兰宫廷，用来表示恩宠或奖赏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ceremonial robe or cloak, especially an honorary garment given by a ruler in parts of the Islamic world (also spelled khilat).","zh":"（尤指伊斯兰文化圈中）“荣袍/赐袍”，一种礼仪性的长袍或披风，常由统治者赐予以示荣誉（也可拼作 khilat）。"},"examples":[{"en":"The ambassador was presented with a khalat as a sign of royal favor.","zh":"大使获赐一件 khalat，以示王室恩宠。"},{"en":"In the museum, you can see a richly embroidered khalat worn at court ceremonies.","zh":"在博物馆里，你能看到一件在宫廷典礼上穿过、绣工精美的 khalat。"}]}],"synonyms":["robe","cloak","ceremonial robe","robe of honor","khilat"],"phonetic":"/kəˈlɑt/","extraExplanation":["这个词多见于历史、人类学或博物馆语境，指“赐袍/荣袍”的制度：统治者把衣袍赏赐给臣属或来访使节，用来表达认可、封赏或建立政治关系。","拼写上常见 khalat / khilat 两种，来源与地区用法有关；阅读史料时可把它理解为“荣誉性礼服”，不等同于日常衣服。"]}
{"word":"khaldian","summary":{"en":"Khaldian usually means ‘related to Ibn Khaldun or his ideas’; it can also (rarely) mean a follower of Ibn Khaldun.","zh":"Khaldian通常指“与伊本·赫勒敦及其思想有关的”；也可（较少见）指“赫勒敦思想的追随者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Arab historian and social thinker Ibn Khaldun (1332–1406), or to his ideas (especially about society, history, and the rise and fall of states).","zh":"与阿拉伯历史学家、社会思想家伊本·赫勒敦（Ibn Khaldun，1332–1406）或其思想有关的（尤指社会、历史以及国家兴衰的理论）。"},"examples":[{"en":"Some scholars take a Khaldian view of history, focusing on how social bonds weaken over time.","zh":"一些学者用“赫勒敦式（Khaldian）”的历史观来看问题，强调社会凝聚力如何随时间减弱。"},{"en":"The article offers a Khaldian explanation for why dynasties collapse after a few generations.","zh":"这篇文章用“赫勒敦式”的解释来说明为什么王朝往往几代之后就会崩溃。"}]},{"partOfSpeech":"n.","definition":{"en":"A person connected with Ibn Khaldun’s thought; a follower or admirer of Ibn Khaldun (rare).","zh":"与伊本·赫勒敦思想有关的人；赫勒敦思想的追随者或拥护者（较少见）。"},"examples":[{"en":"In that seminar, two self-described Khaldians argued for studying politics through social cohesion.","zh":"在那次研讨课上，两位自称“赫勒敦派（Khaldian）”的人主张用社会凝聚力来研究政治。"}]}],"synonyms":["Khaldunian","Ibn Khaldun’s","Khaldunist (rare)"],"phonetic":"/ˈkæl.di.ən/","extraExplanation":["“Khaldian”在英语里非常少见，更常见的形容词是“Khaldunian”。如果你是在某篇文章里看到“Khaldian”，它很可能是在指伊本·赫勒敦或其理论。","也有人把“Khaldian”误写成“Chaldean”（迦勒底的，古代美索不达米亚地区相关）。如果你能提供句子语境，我可以帮你判断具体含义。"]}
{"word":"khalif","summary":{"en":"Khalif is a less common spelling of caliph, meaning a Muslim ruler or leader historically seen as Muhammad’s successor.","zh":"khalif 是 caliph 的较少见拼写，指历史上被视为穆罕默德继任者的穆斯林统治者/领袖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Muslim ruler known as a caliph—the traditional successor to the Prophet Muhammad as a political and sometimes religious leader of the Islamic community.","zh":"哈里发（亦作 khalif）：穆斯林统治者称号，传统上被视为先知穆罕默德在政治（有时也包含宗教）领导上的继任者。"},"examples":[{"en":"The Abbasid khalifs ruled from Baghdad for centuries.","zh":"阿拔斯王朝的哈里发以巴格达为都城统治了数百年。"},{"en":"In some histories, the khalif is described as both a ruler and a symbol of unity.","zh":"在一些历史著作中，哈里发既被描述为统治者，也被视为团结的象征。"}]}],"synonyms":["caliph"],"phonetic":"/ˈkælɪf/","extraExplanation":["“khalif”是“caliph”的另一种拼写，常见于旧式英文转写或不同转写体系（源自阿拉伯语 خَلِيفَة‎，意为“继任者/代理者”）。现代英语更常用拼写是“caliph”。","在历史语境中，“caliphate/khalifate”（哈里发国/哈里发制度）指由哈里发领导的政治体制或国家；在不同历史时期与不同地区，其实际权力与宗教权威程度差异很大。"]}
{"word":"khalifa","summary":{"en":"Khalifa means “caliph”: a historical Muslim leader; it can also appear as a personal name or surname.","zh":"khalifa 意为“哈里发/caliph”：历史上的穆斯林领袖头衔；也可作为人名或姓氏出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim ruler or religious leader, traditionally seen as the successor to the Prophet Muhammad and the leader of the Islamic community (often spelled in English as “caliph”).","zh":"哈里发；穆斯林统治者或宗教领袖，传统上被视为先知穆罕默德的继承者与伊斯兰共同体的领袖（英语常拼作 caliph）。"},"examples":[{"en":"After the Prophet’s death, different groups disagreed about who should become the next khalifa.","zh":"先知去世后，不同群体对谁应成为下一任哈里发产生了分歧。"},{"en":"The Abbasid khalifas ruled from Baghdad for centuries.","zh":"阿拔斯王朝的哈里发以巴格达为中心统治了数百年。"}]},{"partOfSpeech":"n.","definition":{"en":"a title or part of a name used in some Arabic- and Muslim-majority cultures (and sometimes used as a surname).","zh":"在一些阿拉伯语及穆斯林占多数的文化中使用的头衔或人名成分（有时也作为姓氏）。"},"examples":[{"en":"His family name is Khalifa.","zh":"他的姓是 Khalifa。"},{"en":"In some contexts, “Khalifa” is used as an honorific in names.","zh":"在某些语境中，“Khalifa”会作为名字中的尊称/称号成分。"}]}],"synonyms":["caliph"],"phonetic":"/kəˈliːfə/","extraExplanation":["“Khalifa/哈里发”来自阿拉伯语 خَلِيفَة (khalīfa)，本义与“继任者、接替者”有关。英语里更常见的拼法是 caliph（发音相近），中文一般译作“哈里发”。","历史上常见的“哈里发国”包括：正统哈里发（Rashidun）、倭马亚王朝（Umayyad）、阿拔斯王朝（Abbasid）等。学习历史文章时，注意它既可能指具体个人，也可能指制度或头衔。","当它作为人名/姓氏（如某些阿拉伯国家的名字）时，语境通常与历史“哈里发”头衔无关，需要根据上下文判断。"]}
{"word":"khalifas","summary":{"en":"“Khalifas” means “caliphs”: Muslim rulers/leaders titled khalifa, historically seen as successors to the Prophet Muhammad.","zh":"“khalifas”意为“哈里发们”：历史上被称为khalifa/caliph的穆斯林统治者或领袖，常被视为先知穆罕默德的继承者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of khalifa (also spelled caliph): a Muslim ruler regarded as the political and religious successor to the Prophet Muhammad, especially in early Islamic history.","zh":"khalifa（亦作 caliph）的复数：指被视为先知穆罕默德在政治与宗教上的继承者的穆斯林统治者，尤指伊斯兰早期历史中的哈里发。"},"examples":[{"en":"The Umayyad and Abbasid khalifas ruled large parts of the Islamic world.","zh":"倭马亚与阿拔斯王朝的哈里发统治过伊斯兰世界的广大地区。"},{"en":"Historians debate how much authority different khalifas actually had.","zh":"历史学家讨论不同哈里发实际拥有多大权力。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, Muslim leaders titled “khalifa/caliph” in certain regions or periods (a historical title).","zh":"更广义地指在某些地区或时期被称为“khalifa/caliph”的穆斯林领袖（历史称号）。"},"examples":[{"en":"Some local rulers adopted the title of khalifa to strengthen their legitimacy.","zh":"一些地方统治者采用“哈里发”这一头衔来加强其统治的合法性。"}]}],"synonyms":["caliphs","khalifahs"],"phonetic":"/kəˈliːfəz/","extraExplanation":["“khalifa/哈里发”源自阿拉伯语 خَلِيفَة（khalīfa），本义与“继任者/代理者”相关。英语中常见拼写是 caliph；khalifa 更接近阿拉伯语的转写，也常见于人名（如 Khalifa）或组织名称中。","在现代语境里，“khalifa/caliph”有时也会出现在新闻或历史讨论中，但它既是宗教—政治历史概念，也可能被不同团体以不同方式解读；使用时注意具体历史背景与指代对象。"]}
{"word":"khalifat","summary":{"en":"“Khalifat” is another spelling of “caliphate/khilafat,” meaning the rule or realm of a caliph; it can also refer to the 1919–1924 Khilafat Movement in British India.","zh":"“khalifat”是“caliphate/khilafat”的另一种拼写，指哈里发的制度、统治或国家；也可指1919–1924年英属印度的“哈里发运动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the caliphate; the office, rule, or realm of a caliph (a political and religious leader in Islamic history)","zh":"哈里发制度／哈里发国；指哈里发（伊斯兰历史上的政教领袖）的职位、统治或其统治的国家（地区）"},"examples":[{"en":"After the fall of the Ottoman khalifat, many Muslims debated what political leadership should look like.","zh":"奥斯曼哈里发制度瓦解后，许多穆斯林开始讨论政治领导应当是什么样的。"},{"en":"Some history books describe how different dynasties claimed the khalifat.","zh":"一些历史书会讲到不同王朝如何宣称自己拥有哈里发的正统地位。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) the Khilafat Movement (1919–1924), a political movement in British India that supported the Ottoman caliphate","zh":"（常大写）“哈里发运动”（1919–1924）；英属印度时期支持奥斯曼哈里发制度的政治运动"},"examples":[{"en":"The Khilafat Movement became linked with India’s wider independence movement.","zh":"哈里发运动后来与印度更广泛的独立运动产生了联系。"},{"en":"In class, we learned how leaders used the Khalifat issue to mobilize public support.","zh":"课堂上我们学到，领袖们如何借“哈里发问题”来动员民众支持。"}]}],"synonyms":["caliphate","khilafat","khilafah","khalifate"],"phonetic":"/kɪˈlɑːfət/","extraExplanation":["“khalifat”在英文里更常见的拼写是 **caliphate**（也见 **khilafah/khilafat/khalifate**），来源于阿拉伯语 **khalīfa**（意为“继任者”）。","在一般历史语境中，它多指“哈里发的政权/制度”；在南亚历史语境中，**Khilafat** 也常特指20世纪初的“哈里发运动”。"]}
{"word":"khalifate","summary":{"en":"Khalifate is a less common spelling of caliphate—an Islamic state or system ruled by a caliph.","zh":"khalifate 是 caliphate 的不常见拼写，指由哈里发统治的伊斯兰国家或政治制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant spelling) caliphate: a form of Islamic government or a state/empire ruled by a caliph (a political and religious leader in early Islamic history).","zh":"（异拼）caliphate（哈里发国/哈里发制度）：由“哈里发”（早期伊斯兰历史中的政治与宗教领袖）统治的伊斯兰政体、国家或帝国。"},"examples":[{"en":"The Abbasid caliphate made Baghdad a major center of learning.","zh":"阿拔斯王朝的哈里发国使巴格达成为重要的学术中心。"},{"en":"Historians debate how much power different caliphates held over time.","zh":"历史学家讨论不同时期各哈里发国的权力有多大。"}]}],"synonyms":["caliphate"],"phonetic":"/ˈkælɪˌfeɪt/","extraExplanation":["“khalifate”在英语里不如“caliphate”常见，更多见于旧式拼写或不同转写体系（把阿拉伯语发音转写成拉丁字母的方式）。现代学术与新闻写作通常用“caliphate”。","“caliphate”既可指一种“制度”（哈里发统治的体制），也可指具体的“政权/时期”（如 Rashidun、Umayyad、Abbasid 等）。语境不同，含义会有制度性或历史政权之分。","在当代语境中，“caliphate”有时会被极端组织用作政治口号；学习与使用时，注意区分历史概念与现代政治宣传语境，避免误解。"]}
{"word":"khalifs","summary":{"en":"“Khalifs” means “caliphs,” the plural of khalif: Muslim rulers seen as successors to Muhammad in early Islamic history.","zh":"“khalifs”意为“caliphs（哈里发们）”，是 khalif 的复数，指被视为穆罕默德之后继承宗教与政治权威的伊斯兰统治者（尤指早期历史）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of khalif (also spelled caliph): a Muslim ruler regarded as the political and religious successor to the Prophet Muhammad, especially in early Islamic history.","zh":"khalif 的复数（也拼作 caliph）：哈里发；被认为是穆罕默德先知之后的宗教与政治继承者的伊斯兰统治者，尤指早期伊斯兰历史中的领袖。"},"examples":[{"en":"The early khalifs helped spread Islam across a wide region.","zh":"早期的哈里发推动伊斯兰教在广阔地区传播。"},{"en":"Different dynasties claimed authority through their own khalifs.","zh":"不同王朝通过各自的哈里发来主张统治合法性。"}]}],"synonyms":["caliphs"],"phonetic":"/ˈkeɪlɪfs/","extraExplanation":["“khalif / caliph（哈里发）”来自阿拉伯语 *khalīfa*，意思是“继任者、代理者”。英语里更常见的拼写是 **caliph**；**khalif** 属于较少见、偏旧式或更接近阿语音译的拼写。","历史语境里常提到“正统哈里发（Rashidun）”“倭马亚（Umayyad）”“阿拔斯（Abbasid）”等王朝。现代新闻中有时也会用“caliphate（哈里发国/哈里发制度）”来指一种政教合一的统治理念或相关政治主张。"]}
{"word":"khalkha","summary":{"en":"Khalkha refers to the largest Mongol subgroup in Mongolia and also to their Mongolian dialect; it can be used as a noun or an adjective.","zh":"Khalkha 指蒙古国人数最多的蒙古族支系“喀尔喀”，也可指其蒙古语方言；可作名词或形容词使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major subgroup of the Mongols in Mongolia; the largest ethnic group in modern Mongolia","zh":"喀尔喀（蒙古族的主要支系之一）；现代蒙古国人数最多的族群"},"examples":[{"en":"Most people in Mongolia today are Khalkha Mongols.","zh":"今天蒙古国的大多数人是喀尔喀蒙古人。"},{"en":"The Khalkha played an important role in Mongolia’s history.","zh":"喀尔喀人在蒙古历史中扮演了重要角色。"}]},{"partOfSpeech":"n.","definition":{"en":"the Khalkha dialect of Mongolian, which strongly influences (and is close to) standard Mongolian in Mongolia","zh":"喀尔喀方言（蒙古语的一种方言，对蒙古国的标准蒙古语影响很大，也与其非常接近）"},"examples":[{"en":"She speaks Khalkha at home and uses standard Mongolian at school.","zh":"她在家说喀尔喀方言，在学校使用标准蒙古语。"},{"en":"Many textbooks in Mongolia are based on Khalkha pronunciation.","zh":"蒙古国的许多教材以喀尔喀的发音为基础。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Khalkha people or their dialect","zh":"与喀尔喀人或喀尔喀方言有关的"},"examples":[{"en":"Khalkha traditions are well known across Mongolia.","zh":"喀尔喀传统在蒙古国各地都很有名。"},{"en":"He is studying Khalkha vocabulary and pronunciation.","zh":"他在学习喀尔喀的词汇和发音。"}]}],"synonyms":["Khalkha Mongols","Khalkha dialect","Mongolian (standard, in Mongolia)"],"phonetic":"/ˈkɑːlkə/","extraExplanation":["“Khalkha”常见拼写也有“Khalkh/Khalkha”；中文多译作“喀尔喀”。它既可指族群（喀尔喀蒙古人），也可指语言变体（喀尔喀方言）。","在英语里写作专有名词时通常首字母大写：Khalkha。谈到语言时也常说“the Khalkha dialect (of Mongolian)”。"]}
{"word":"khalsa","summary":{"en":"Khalsa is the Sikh community of initiated members (and also an adjective for things related to that identity and practice).","zh":"Khalsa 指锡克教中已受戒的成员共同体，也可作形容词表示与该身份与实践相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Sikhism, the community (or collective body) of initiated Sikhs who have undergone the Amrit ceremony and commit to the Khalsa code of conduct.","zh":"在锡克教中，指已接受“阿姆利特（Amrit）”入教仪式并遵守“卡尔萨（Khalsa）”纪律规范的受戒锡克教徒共同体（集体）。"},"examples":[{"en":"Many Sikhs choose to join the Khalsa through the Amrit ceremony.","zh":"许多锡克教徒会通过阿姆利特（Amrit）仪式加入卡尔萨（Khalsa）。"},{"en":"The Khalsa emphasizes equality, service, and courage.","zh":"卡尔萨强调平等、服务与勇气。"},{"en":"On Vaisakhi, some families commemorate the founding of the Khalsa.","zh":"在丰收节（Vaisakhi）期间，一些家庭会纪念卡尔萨的创立。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Khalsa or to initiated Sikh identity and practice.","zh":"与卡尔萨（受戒锡克教徒群体）相关的；指受戒锡克教徒的身份与实践。"},"examples":[{"en":"He follows Khalsa traditions in his daily life.","zh":"他在日常生活中遵循卡尔萨传统。"},{"en":"The ceremony includes Khalsa vows and prayers.","zh":"仪式包含卡尔萨的誓言与祈祷。"}]}],"synonyms":["the initiated Sikh community","Sikh brotherhood (context-dependent)"],"phonetic":"/ˈkɑːlsə/","extraExplanation":["“Khalsa”源自旁遮普语/波斯语传统，常被解释为“纯净、纯洁”。它在锡克教历史中具有核心意义：1699年，锡克教第十代古鲁戈宾德·辛格（Guru Gobind Singh）在Vaisakhi（丰收节）创立Khalsa，以强调信仰纪律、平等与共同身份。","加入Khalsa通常通过Amrit（圣甜水）受戒仪式完成；与Khalsa身份相关的常见外在标志包括“五K”（如Kesh不剪发、Kara钢手镯等）。在不同社群中，实践方式可能有差异，表达时可尊重个体选择。"]}
{"word":"khalsah","summary":{"en":"Khalsa: the initiated Sikh community founded in 1699; also an adjective meaning ‘related to the Khalsa.’","zh":"Khalsa：1699年建立的受洗锡克教徒共同体；也可作形容词，表示“与卡尔萨相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Khalsa: the community of initiated Sikhs, founded by Guru Gobind Singh in 1699 (often written with a capital K)","zh":"卡尔萨（Khalsa）：受洗入教的锡克教徒共同体，由第十代锡克教导师古鲁·戈宾德·辛格于1699年建立（常大写）"},"examples":[{"en":"She took Amrit and became a member of the Khalsa.","zh":"她接受阿姆里特洗礼，成为卡尔萨的一员。"},{"en":"Many Khalsa Sikhs keep the Five Ks as a sign of faith.","zh":"许多卡尔萨锡克教徒遵守“五K”，作为信仰的标志。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Khalsa or to initiated Sikhs","zh":"与卡尔萨或受洗锡克教徒相关的"},"examples":[{"en":"He wore a Khalsa-style turban for the ceremony.","zh":"他在仪式上戴了卡尔萨风格的头巾。"}]}],"synonyms":["Khalsa","initiated Sikh community","Sikh brotherhood"],"phonetic":"/ˈkɑːlsə/","extraExplanation":["你输入的 **khalsah** 常见为拼写变体或误拼，标准写法通常是 **Khalsa**。","**Khalsa** 在锡克教中含有“纯净/自由”的含义，强调平等、纪律与服务他人（seva）的精神。","“加入 Khalsa”通常指接受 **Amrit**（入教洗礼）。入教者传统上会采用姓氏 **Singh**（男性）或 **Kaur**（女性），以强调平等与共同身份。"]}
{"word":"khamal","summary":{"en":"“Khamal” is most commonly seen as a personal name (often a variant of “Kamal”); in some regional English it can also mean a porter/load-carrier.","zh":"“Khamal”最常见是人名（常为“Kamal”的变体拼写）；在一些地区英语语境中也可指“搬运工/挑夫”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name (proper noun), often a variant spelling of “Kamal,” used in several cultures.","zh":"人名（专有名词），常被视为“Kamal”的一种拼写变体，在多种文化中使用。"},"examples":[{"en":"Khamal is a name you might see spelled as Kamal in other places.","zh":"Khamal 这个名字在别的地方也可能拼作 Kamal。"},{"en":"Khamal introduced himself at the start of the meeting.","zh":"Khamal 在会议开始时做了自我介绍。"}]},{"partOfSpeech":"n.","definition":{"en":"(Regional/loanword; South Asian / Middle Eastern English contexts) A porter or someone who carries loads for others.","zh":"（地区性/外来词；在南亚/中东英语语境中）搬运工；挑夫。"},"examples":[{"en":"They hired a khamal to carry the luggage to the bus.","zh":"他们雇了一个 khamal 把行李搬到大巴上。"},{"en":"In the bazaar, a khamal offered to help with the heavy bags.","zh":"在集市里，一个 khamal 主动帮忙搬重袋子。"}]}],"synonyms":["Kamal","Hamal","Hammal"],"phonetic":"/kəˈmɑl/","extraExplanation":["“khamal”在英语里不算常见标准词，更常见于人名或把阿拉伯语/乌尔都语等词音译到英语时的拼写。不同地区可能写成Kamal / Hammal / Hamal等，含义也会随来源词不同而变化。","如果你是在特定文章、歌词、地名或对话里看到的“khamal”，告诉我上下文一句话，我可以更准确判断它指的是人名、地名，还是“搬运工”等含义。"]}
{"word":"khami","summary":{"en":"Khami is a place name in Zimbabwe, best known for the UNESCO-listed Khami Ruins near Bulawayo; it can also refer to the nearby Khami River.","zh":"Khami 是津巴布韦的地名，最常指布拉瓦约附近被列入世界遗产的卡米遗址；也可指附近的卡米河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an archaeological site and former city near Bulawayo, Zimbabwe, known for its stone-walled ruins and as the capital of the Torwa state (15th–17th centuries).","zh":"卡米遗址：位于津巴布韦布拉瓦约附近的考古遗址与古城遗迹，以石砌城墙闻名，曾是托尔瓦（Torwa）政权（约15—17世纪）的都城。"},"examples":[{"en":"We visited Khami to learn about Zimbabwe’s precolonial history.","zh":"我们参观了卡米遗址，了解津巴布韦的殖民前历史。"},{"en":"Khami’s stone terraces show impressive craftsmanship.","zh":"卡米的石砌台地展示了精湛的工艺。"}]},{"partOfSpeech":"n.","definition":{"en":"(geography) the Khami River, a river near Bulawayo in southwestern Zimbabwe.","zh":"（地理）卡米河：津巴布韦西南部布拉瓦约附近的一条河流。"},"examples":[{"en":"The Khami River flows west of Bulawayo.","zh":"卡米河从布拉瓦约以西流过。"}]}],"phonetic":"/ˈkɑmi/","extraExplanation":["“Khami Ruins / 卡米遗址”于1986年被列入联合国教科文组织世界遗产。它常被拿来与“大津巴布韦（Great Zimbabwe）”对比：两者都以干砌石建筑著称，但卡米以层层台地与装饰性石砌图案更有特色。"]}
{"word":"khamseen","summary":{"en":"Khamseen is a hot, dry, dusty wind common in Egypt and nearby North Africa, especially in spring.","zh":"Khamseen 指常见于埃及及邻近北非、尤在春季出现的干热夹沙尘的热风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hot, dry, dusty wind that blows in Egypt and nearby parts of North Africa, especially in spring","zh":"（尤指春季吹袭埃及及北非部分地区的）卡姆辛热风；干热、夹沙尘的热风"},"examples":[{"en":"During the khamseen, the sky can turn yellow with dust.","zh":"卡姆辛热风来时，天空可能因沙尘而变得发黄。"},{"en":"We stayed indoors because the khamseen made the air hard to breathe.","zh":"我们待在室内，因为卡姆辛热风让空气难以呼吸。"},{"en":"The novel describes a village waiting for the khamseen to pass.","zh":"小说描写了一个村庄等待卡姆辛热风过去。"}]}],"synonyms":["khamsin","hot desert wind","dust-laden wind"],"phonetic":"/kæmˈsiːn/","extraExplanation":["“khamseen”也常拼作“khamsin / khamsin wind”。词源来自阿拉伯语“خمسين（khamsīn）”，意为“五十”，传统上指这种风季大约持续五十天（并非每天都吹）。","在旅行与新闻语境中，它常与“dust storm（沙尘暴）”“sandstorm（沙暴）”一起出现，用来强调能见度差、空气干燥与高温等特点。"]}
{"word":"khamseens","summary":{"en":"Khamseens are hot, dry, dusty winds in Egypt and nearby regions, common in spring.","zh":"khamseens 指埃及及周边地区春季常见的炎热、干燥、夹沙尘的强风（喀姆辛风）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hot, dry, dust-filled wind that blows in Egypt and the eastern Mediterranean, especially in spring; often causing hazy skies and sudden heat","zh":"（埃及及东地中海地区，尤指春季的）喀姆辛风／热沙风；一种炎热、干燥、夹带尘沙的风，常导致天空昏黄、气温骤升"},"examples":[{"en":"A khamsin can turn a clear afternoon into a dusty haze within minutes.","zh":"喀姆辛风能在几分钟内把晴朗的下午变成尘土弥漫的昏黄天空。"},{"en":"The weather report warned of a khamsin, so we kept the windows shut.","zh":"天气预报提醒可能有喀姆辛风，所以我们把窗户关紧了。"}]}],"synonyms":["khamsin","sandstorm","dust storm","sirocco"],"phonetic":"/kæmˈsin/","extraExplanation":["“khamseens”常见于口语或非正式写法，更标准的拼写是 **khamsin**（单数），复数可写 **khamsins**。","词源来自阿拉伯语 **khamsīn**（خمسين），意为“五十”，传统上指这种风在一年中大约持续/出现约五十天的时段（多在春季）。","在英语里它常被当作一种地域性自然现象来提及，类似的风名还有 **sirocco**（西罗科热风，范围更广，常指从撒哈拉吹向地中海的热风）。"]}
{"word":"khamsin","summary":{"en":"A khamsin is a hot, dry, dusty spring wind in Egypt and nearby regions.","zh":"khamsin 指埃及及周边地区春季常见的炎热、干燥、夹沙尘的风（卡姆辛热风）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hot, dry, dusty wind that blows across Egypt and nearby regions, especially in spring, often bringing sandstorms and reduced visibility","zh":"（尤指春季吹过埃及及周边地区的）卡姆辛热风；一种炎热、干燥、夹沙尘的风，常引发沙尘暴并降低能见度"},"examples":[{"en":"A khamsin swept through Cairo, turning the sky yellow with dust.","zh":"一阵卡姆辛热风扫过开罗，把天空染成尘土的黄色。"},{"en":"During the khamsin, people closed windows and wore masks to keep out sand.","zh":"在卡姆辛热风期间，人们关紧窗户、戴上口罩来防沙。"}]}],"synonyms":["sand-laden wind","hot desert wind","sirocco (related)"],"phonetic":"/kæmˈsiːn/","extraExplanation":["“khamsin”一词来自阿拉伯语“五十”（khamsīn），因为这种风在传统说法中常与大约“五十天”的季节性时段相关（并不表示连续吹五十天）。","在英语中它通常指埃及及东地中海一带的这种季节性热风；不同地区也会用其他名称称呼类似现象（如 sirocco 等）。","在文学与新闻写作里，khamsin 常被用来营造“灼热、窒息、尘沙弥漫”的氛围，带有强烈的地域与季节意象。"]}
{"word":"khamsins","summary":{"en":"Khamsins are hot, dry, dust-filled winds in Egypt and nearby areas, common in spring.","zh":"khamsins 指埃及及周边地区春季常见的又热又干、夹沙尘的热风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hot, dry, dusty winds that blow across Egypt and nearby regions, especially in spring (plural of “khamsin”).","zh":"（khamsin 的复数）喀姆辛热风；主要指春季在埃及及周边地区吹起的又热又干、夹带沙尘的风。"},"examples":[{"en":"In March, khamsins can turn the sky yellow with dust.","zh":"在三月，喀姆辛热风会把天空吹得尘土泛黄。"},{"en":"The museum closed early because khamsins made the air hard to breathe.","zh":"因为喀姆辛热风让空气难以呼吸，博物馆提前关门。"},{"en":"Travelers covered their faces as the khamsins swept through the desert road.","zh":"当喀姆辛热风横扫沙漠公路时，旅行者把脸遮了起来。"}]}],"synonyms":["sandstorm winds","hot desert winds","dust-laden winds"],"phonetic":"/kɑmˈsinz/","extraExplanation":["“khamsin”源自阿拉伯语，和“50”有关：传统上指这种热风季节大约持续五十天左右（常在春季出现），因此得名。","在英语里更常见的拼写是“khamsin / khamseen / khamsheen”；复数可写作“khamsins”。","在文学与旅行写作中，khamsin常用来营造压迫、窒息、混乱的氛围：热浪、沙尘、能见度下降，象征环境的艰难或情势的动荡。"]}
{"word":"khamti","summary":{"en":"Khamti refers to the Khamti (Tai Khamti) people, their language, or things related to their culture.","zh":"khamti 指坎提人（泰族支系）、坎提语，或与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Khamti (Tai Khamti) people, a Tai ethnic group mainly living in parts of Myanmar and Northeast India (especially Arunachal Pradesh and Assam)","zh":"坎提人（泰族支系之一），主要分布在缅甸及印度东北部（尤以阿鲁纳恰尔邦、阿萨姆邦）"},"examples":[{"en":"Many Khamti communities in Arunachal Pradesh celebrate traditional festivals with music and dance.","zh":"印度阿鲁纳恰尔邦的许多坎提社区会用音乐和舞蹈庆祝传统节日。"},{"en":"She interviewed Khamti elders about local history and customs.","zh":"她采访了坎提族长者，了解当地历史与习俗。"}]},{"partOfSpeech":"n.","definition":{"en":"the Khamti language, a Tai language spoken by the Khamti people","zh":"坎提语（泰语支语言之一），由坎提族人使用"},"examples":[{"en":"He can speak Khamti at home and English at school.","zh":"他在家说坎提语，在学校说英语。"},{"en":"The museum displayed a short text translated into Khamti.","zh":"博物馆展示了一段被翻译成坎提语的短文。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Khamti people or their language and culture","zh":"与坎提人、坎提语或其文化有关的"},"examples":[{"en":"They served Khamti-style food at the cultural event.","zh":"他们在文化活动上提供了坎提风味的食物。"},{"en":"The researcher collected Khamti folktales for a bilingual book.","zh":"研究者收集坎提民间故事，用于一本双语书。"}]}],"synonyms":["Tai Khamti"],"phonetic":"/ˈkɑmti/","extraExplanation":["“Khamti”在英文里多作为专有名词使用，常见搭配有：Tai Khamti（泰坎提/坎提泰族）、Khamti people（坎提人）、Khamti language（坎提语）。","拼写有时也会见到“Khampti”等变体；正式写作中建议按资料来源或社群常用拼写为准。"]}
{"word":"khan","summary":{"en":"Khan most commonly means a ruler’s title (like “Genghis Khan”); less commonly, it can mean a historical roadside inn (caravanserai).","zh":"khan 最常指统治者称号（如“成吉思汗”）；较少见时也可指历史上的路边驿站/客栈（caravanserai）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a title meaning a ruler or leader, especially in Central Asia and the Mongol/Turkic world","zh":"（尤指中亚、蒙古/突厥世界的）可汗；汗（统治者或领袖的称号）"},"examples":[{"en":"Genghis Khan founded the Mongol Empire.","zh":"成吉思汗建立了蒙古帝国。"},{"en":"The khan called a meeting of tribal leaders.","zh":"可汗召集了各部族首领开会。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asia, historical) a roadside inn or lodging place for travelers; a caravanserai","zh":"（南亚，历史用法）旅店；驿站；客栈（供旅人歇脚的地方）"},"examples":[{"en":"Merchants rested for the night in a khan along the trade route.","zh":"商人在商路旁的驿站里过夜休息。"},{"en":"The old khan was built to serve travelers and their animals.","zh":"那座老驿站是为旅人及其牲畜而建的。"}]}],"synonyms":["ruler","leader","chieftain","sovereign","caravanserai"],"phonetic":"/kɑn/","extraExplanation":["“khan”一词源自突厥语/蒙古语系，常用作统治者头衔，在英语中最常见于历史语境（如“Genghis Khan”成吉思汗）。","在南亚历史语境里，“khan”有时指“caravanserai”（商队驿站/客栈）。现代英语里这一义项较少见，多出现在历史、旅行或文学描写中。","“Khan”也常见作姓氏（尤其在南亚与穆斯林社群中），但作为姓时通常不翻译为“可汗”。"]}
{"word":"khanate","summary":{"en":"A khanate is a state ruled by a khan, commonly used for historical Central Asian and Mongol-era kingdoms.","zh":"khanate 指由“汗”统治的汗国，常用于中亚与蒙古时代的历史国家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A kingdom or state ruled by a khan, especially in Central Asia and the Mongol world.","zh":"由“汗”（khan）统治的汗国；尤指中亚与蒙古世界中的国家或政权。"},"examples":[{"en":"The Golden Horde was a Mongol khanate that ruled parts of Eastern Europe and Russia.","zh":"金帐汗国是一个蒙古汗国，曾统治东欧和俄罗斯的部分地区。"},{"en":"After the Mongol Empire broke apart, several khanates formed across Eurasia.","zh":"蒙古帝国分裂后，欧亚大陆出现了多个汗国。"}]}],"synonyms":["realm","kingdom","state","principality"],"phonetic":"/ˈkɑːneɪt/","extraExplanation":["“khanate”由“khan（汗）+ -ate（表示领地/政体）”构成，意思类似于“由某种头衔统治的国家”。常见于历史语境，如Chagatai Khanate（察合台汗国）、Ilkhanate（伊儿汗国）、Crimean Khanate（克里米亚汗国）。","在英语写作中，它通常是一个中性、学术/历史用语；讨论时注意区分不同汗国的时间、地域与族群背景，避免把所有中亚游牧政权简单归为同一类。"]}
{"word":"khanates","summary":{"en":"“Khanates” means multiple states or territories ruled by a khan.","zh":"“khanates”指多个由“汗/可汗”统治的国家或领地（汗国）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of khanate: territories or states ruled by a khan (a leader in some Central Asian and Mongol/Turkic cultures).","zh":"khanate（汗国）的复数：由“khan（可汗/汗）”统治的领地或国家（常见于中亚及蒙古、突厥相关文化与历史语境）。"},"examples":[{"en":"After the Mongol Empire weakened, several khanates emerged across Eurasia.","zh":"蒙古帝国衰落后，欧亚大陆各地出现了多个汗国。"},{"en":"Historians often compare the politics of the different khanates in the region.","zh":"历史学家常常比较该地区不同汗国的政治状况。"}]}],"synonyms":["khanate (singular)","khandom (rare)"],"phonetic":"/ˈkɑːneɪts/","extraExplanation":["“汗国（khanate）”多见于历史书写，尤其与蒙古帝国及其分裂后的政权有关，例如金帐汗国（Golden Horde）、察合台汗国（Chagatai Khanate）等。","词形：khan + -ate（表示“统治范围/领地”的构词方式），所以 khanate 可理解为“汗的统治地/政权”。在现代英语里属于偏历史/学术用词，日常对话中不常用。"]}
{"word":"khanda","summary":{"en":"Khanda means either a traditional Indian double‑edged sword or (capitalized) the Sikh emblem featuring a central double‑edged sword.","zh":"Khanda 可指印度传统双刃剑，也可（首字母大写）指锡克教的 Khanda 徽记，中央图形为双刃剑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Indian double‑edged sword, often associated with North India and historical martial use","zh":"（印度传统武器）一种双刃剑，常见于北印度历史与武术传统中"},"examples":[{"en":"The museum displayed a khanda used by cavalry in the 18th century.","zh":"博物馆展出了据称为18世纪骑兵使用过的 khanda（双刃剑）。"},{"en":"In the ceremony, the elder held a khanda as a symbol of protection and duty.","zh":"在仪式中，长者手持 khanda，象征守护与责任。"}]},{"partOfSpeech":"n.","definition":{"en":"the Sikh emblem (also called the Khanda), featuring a double‑edged sword in the center, a circle, and two curved swords; it symbolizes key Sikh beliefs","zh":"（锡克教标志）也称 Khanda：中央为双刃剑，配以圆环与两把弯刀的徽记，用来象征锡克教的重要信念"},"examples":[{"en":"You can often see the Khanda on Sikh flags and gurdwaras (Sikh temples).","zh":"你常能在锡克教旗帜和 gurdwara（锡克教寺庙）上看到 Khanda 标志。"},{"en":"She wore a small khanda pendant to represent her Sikh identity.","zh":"她戴着一枚小小的 khanda 吊坠，用来表达自己的锡克教身份认同。"}]}],"synonyms":["double-edged sword","Sikh emblem","Sikh symbol"],"phonetic":"/ˈkʌndə/","extraExplanation":["“Khanda”既可以指武器（双刃剑），也可以特指锡克教徽记。谈到宗教符号时，语境通常会大写为“Khanda”，表示标志本身；小写“khanda”更常被理解为剑。","锡克教的 Khanda 徽记一般由三部分构成：中央双刃剑（象征真理与正义）、外圈圆环（象征永恒与一体）、两把弯刀（常被解释为灵性与世俗责任的平衡）。不同社群的解读细节可能略有差异，表达时保持尊重与开放更合适。"]}
{"word":"khandait","summary":{"en":"Khandait: a community name in Odisha, India, historically linked to a warrior tradition.","zh":"Khandait：印度奥迪沙邦的社群名称，历史上与武士传统相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Khandait (also spelled Khandayat) community of Odisha, India, historically associated with a warrior/militia tradition and later known mainly as a landholding and farming community","zh":"坎达伊特（也拼作 Khandayat）族群成员；印度奥迪沙邦的一个社群，历史上与武士/民兵传统有关，后来多以地主与农耕社群为主"},"examples":[{"en":"In Odisha’s history, the Khandaits were often described as having a warrior tradition.","zh":"在奥迪沙的历史叙述中，坎达伊特常被描述为具有武士传统。"},{"en":"Some families identify as Khandait (Khandayat) and keep community customs during festivals and weddings.","zh":"一些家庭认同自己是坎达伊特（Khandayat），并在节庆与婚礼中延续社群习俗。"}]}],"synonyms":["Khandayat"],"phonetic":"/kʌnˈdaɪt/","extraExplanation":["“Khandait / Khandayat”多见于南亚历史、人类学与社会学语境，是一种社群/种姓名称；在不同资料里其历史地位与社会分类可能表述不一，建议结合具体地区与学术来源理解。","英文里常见变体拼写：Khandayat（更常见）、Khandait。作为专名使用时通常首字母大写：a Khandait; the Khandaits。"]}
{"word":"khanga","summary":{"en":"A khanga is a colorful East African cotton wrap cloth, often printed with a Swahili proverb, used as clothing or for everyday purposes.","zh":"khanga 指东非常见的彩色棉质裹布，常印有斯瓦希里语短句，可作服饰或日常用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brightly colored rectangular cotton cloth from East Africa, often printed with a border and a Swahili proverb; worn as a wrap, skirt, scarf, baby carrier, or used as a household cloth","zh":"（东非）坎加布/康加布：一种色彩鲜艳的长方形棉布，常印有边框和斯瓦希里语谚语；可用作披巾、围裙/裹裙、头巾、背婴布或家用布"},"examples":[{"en":"She wrapped a khanga around her waist like a skirt.","zh":"她把一块坎加布围在腰间，当作裹裙。"},{"en":"Many khangas have a Swahili saying printed along the bottom.","zh":"很多坎加布在下方会印着一句斯瓦希里语格言。"},{"en":"He bought khangas in a market in Tanzania as gifts.","zh":"他在坦桑尼亚的集市上买了坎加布当礼物。"}]}],"synonyms":["kanga","East African wrap cloth","printed wrap"],"phonetic":"/ˈkɑːŋɡə/","extraExplanation":["“khanga”常见拼写也作“kanga”。在肯尼亚、坦桑尼亚等地很常见，既是服饰也是日常用品。","传统坎加布常有三部分：装饰边框、中间图案，以及底部的斯瓦希里语短句（用来表达祝福、态度或心情）。在当地文化里，这些文字有时也起到含蓄沟通的作用。"]}
{"word":"khanikos","summary":{"en":"“Khanikos” is most likely a surname or transliterated name, not a common English word with a standard dictionary meaning.","zh":"“Khanikos”多半是姓氏或外来语音译的人名，并非英语中常见、具有标准词典释义的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname); not a standard English vocabulary word with a widely agreed meaning.","zh":"专有名词（通常为姓氏）；不是英语里常见、且有公认词义的词汇。"},"examples":[{"en":"Dr. Khanikos will speak at the conference tomorrow.","zh":"Khanikos 博士将于明天在会议上发言。"},{"en":"I emailed Ms. Khanikos to confirm the appointment.","zh":"我给 Khanikos 女士发邮件确认预约。"}]}],"synonyms":["(as a name) no true synonyms"],"phonetic":"/kəˈnɪkoʊs/","extraExplanation":["“Khanikos”在常见英语词典中通常查不到作为普通词的固定释义，更可能是人名/姓氏，或来自其他语言的音译/拼写变体。","如果你是想找某个近似拼写的英文词：它可能与希腊语词根 -nikos/-nikos 的音译形式有关；也有人会把希腊语“μηχανικός（michanikós，工程师/机械师）”误写成类似“khanikos”的形式。若你能提供一句原文语境（在哪篇文章/哪个领域看到的），我可以更准确判断词源与含义。"]}
{"word":"khanjar","summary":{"en":"Khanjar means a traditional curved dagger, especially associated with Middle Eastern and South Asian cultures.","zh":"khanjar 指一种传统弯刀/匕首，尤与中东和南亚文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional curved dagger from the Middle East and South Asia, often worn as a symbol of heritage or status.","zh":"（中东及南亚的）传统弯刀/匕首，常被佩戴作为文化身份或地位的象征。"},"examples":[{"en":"At the museum, we saw an ornate khanjar with a silver sheath.","zh":"在博物馆里，我们看到一把带银质刀鞘、装饰华丽的坎贾尔弯刀。"},{"en":"In some Gulf cultures, men may wear a khanjar for ceremonial occasions.","zh":"在一些海湾地区的文化中，男性可能在仪式场合佩戴坎贾尔弯刀。"},{"en":"The novel described the hero drawing a khanjar from his belt.","zh":"小说描写主人公从腰带上抽出一把坎贾尔弯刀。"}]}],"synonyms":["dagger","knife","dirk"],"phonetic":"/ˈkɑːndʒər/","extraExplanation":["“khanjar”一词来自阿拉伯语/波斯语（خنجر），英语里多用于指带弯曲刀身的传统匕首或短刀。","不同地区的款式会有差异：例如阿曼的国徽中就有著名的“khanjar”形象；也常与也门等地的“jambiya（詹比亚弯刀）”一起被提及，但两者并不总是完全相同。","在英文语境里，它既可指真实武器，也常出现在历史题材、旅行写作或文学描写中，用来营造地域与时代氛围。"]}
{"word":"khanjee","summary":{"en":"“khanjee” is not a standard English word; it’s usually a misspelling of “kanji,” the Chinese characters used in Japanese.","zh":"“khanjee”不是标准英语词；通常是把“kanji（漢字）”（日语里使用的汉字）拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling of) “kanji”: Chinese characters used in Japanese writing.","zh":"（常见拼写误写）“kanji（漢字）”：日语书写中使用的汉字。"},"examples":[{"en":"I’m learning kanji to read Japanese signs and menus.","zh":"我在学习汉字（kanji），这样就能读懂日文的路标和菜单。"},{"en":"This word is written in kanji, not in hiragana.","zh":"这个词是用汉字（kanji）写的，不是用平假名写的。"}]},{"partOfSpeech":"n.","definition":{"en":"A single kanji character.","zh":"一个汉字（kanji）字符。"},"examples":[{"en":"The kanji for “water” is 水.","zh":"“水”的汉字（kanji）是「水」。"},{"en":"That kanji has many readings, so it can be confusing.","zh":"那个汉字（kanji）有很多读音，所以会让人困惑。"}]}],"synonyms":["Japanese characters","Chinese characters (in Japanese writing)","kanji (standard spelling)","hiragana (related)","katakana (related)"],"phonetic":"/ˈkɑːndʒi/","extraExplanation":["“kanji”来自日语「漢字」，字面意思就是“汉字”。在日语里，汉字通常用来表示词根/词义；而平假名（hiragana）和片假名（katakana）主要用来写语法成分、外来词等。","如果你看到有人写成 “khanjee / kanjee / kanji”，一般都是在用拉丁字母拼写日语时的不同写法或误写；标准拼写是 **kanji**。"]}
{"word":"khankah","summary":{"en":"A khankah is a Sufi lodge/monastery where people gather for spiritual practice and teaching.","zh":"khankah 指苏菲派的道堂/修道院，是进行修行与讲学聚会的场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Sufi lodge or monastery—a place where members of a Sufi order live, gather for prayer, teaching, meditation, and communal rituals (such as dhikr).","zh":"（苏菲派的）修道院／道堂；苏菲教团成员居住与聚会之处，用于礼拜、讲学、静修及集体仪式（如念诵赞主 dhikr）。"},"examples":[{"en":"Visitors are welcome at the khankah during public dhikr ceremonies.","zh":"在公开的念诵赞主（dhikr）仪式期间，访客通常可以进入这座 khankah 参观。"},{"en":"The poet spent time in a khankah, listening to Sufi teachers and learning devotional songs.","zh":"那位诗人曾在一座 khankah 里待过一段时间，聆听苏菲导师讲解并学习赞歌。"}]}],"synonyms":["Sufi lodge","Sufi monastery","dervish lodge","tekke","khanqah"],"phonetic":"/kɑnˈkɑ/","extraExplanation":["“khankah”也常拼作“khanqah”。词源多认为来自波斯语，指苏菲教团的宗教与社会活动中心；在不同地区可与土耳其语的“tekke”、南亚语境中的“dargah”（常偏向圣徒陵寝/圣祠）相关但不完全等同。"]}
{"word":"khans","summary":{"en":"“Khans” is the plural of “khan,” most commonly a historical title for Central Asian/Middle Eastern rulers or leaders; less commonly it can mean inns/caravanserais.","zh":"“khans”是“khan”的复数，最常见指历史上中亚/中东统治者或领袖的称号；较少见时也可指客栈/商队旅店。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of khan: a title used by some rulers or leaders in Central Asia and the Middle East, especially in Turkic and Mongol societies (historical).","zh":"khan 的复数：可汗/汗（历史上中亚与中东部分突厥、蒙古等社会中对统治者或领袖的称号）。"},"examples":[{"en":"The khans competed for control of trade routes across the степpe.","zh":"这些可汗争夺对草原商路的控制权。"},{"en":"In the history unit, we learned how different khans ruled parts of the Mongol Empire.","zh":"在历史课上，我们学到不同的可汗如何统治蒙古帝国的部分地区。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of khan: a traditional inn or caravanserai (a roadside lodging for travelers), especially in parts of the Middle East (less common).","zh":"khan 的复数：传统客栈/驿站（商旅投宿处，类似商队旅店），多见于中东部分地区（较少见用法）。"},"examples":[{"en":"Merchants rested in khans along the old caravan routes.","zh":"商人们在古老的商队路线上沿途的驿站投宿休整。"}]}],"synonyms":["rulers","leaders","sovereigns","warlords (context-dependent)","caravanserais (2nd meaning)"],"phonetic":"/kɑnz/","extraExplanation":["“khan（汗/可汗）”常与蒙古与突厥历史相关：例如成吉思汗（Genghis Khan）中的 “Khan” 就是称号而非姓氏。英语里复数一般加 -s 变成 “khans”。","在英文史学语境中，“khan”既可指具体统治者的头衔，也可泛指某个地区的汗国（khanate）统治者；读到时可以结合上下文判断。","第二个意思“客栈/商队旅店”在中东城市地名或历史建筑介绍中偶尔出现（如某些古城中的旧商栈），现代日常英语较少用。"]}
{"word":"khansama","summary":{"en":"Khansama means a (often head) cook in a South Asian household, mainly seen in older/colonial contexts.","zh":"Khansama 指南亚家庭中的（常为主厨的）厨师，多见于较旧或殖民时期语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cook or head cook, especially in an Indian or South Asian household (often in older or colonial-era contexts)","zh":"（尤指印度/南亚家庭里，常见于较旧或殖民时期语境的）厨师；主厨"},"examples":[{"en":"The khansama prepared a full dinner for the guests.","zh":"这位 khansama 为客人准备了一桌晚餐。"},{"en":"In the old bungalow, the khansama managed the kitchen and the servants who helped him.","zh":"在那座旧式洋房里，khansama 负责厨房，也管理帮忙的仆役。"}]}],"synonyms":["cook","chef","household cook","head cook"],"phonetic":"/kɑːnˈsɑːmə/","extraExplanation":["这个词多见于英印英语（Anglo-Indian English）或与南亚历史相关的英文作品中，带有时代与阶层色彩：常用于描写殖民时期的家庭、官邸或“洋房（bungalow）”里的雇佣人员体系。现代日常英语里更常用 cook / chef / household cook。","在阅读小说或历史材料时，khansama 往往暗示“家中的资深厨师/管家式厨师”，不只是做饭，也可能负责采购、安排菜单、管理厨房帮工。"]}
{"word":"khansamah","summary":{"en":"A (often head) household cook, especially in older South Asian/colonial-era English.","zh":"（多见于旧时南亚/殖民时期语境）家庭厨师，常指主厨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in South Asia, especially in older/colonial-era English) a household cook, often the head cook in a large home.","zh":"（南亚用语，尤见于较旧/殖民时期英语）家庭厨师；（尤指）大户人家里的主厨。"},"examples":[{"en":"The khansamah prepared dinner for the entire household.","zh":"这位 khansamah 为全家准备了晚餐。"},{"en":"In the novel, the khansamah runs the kitchen with strict routines.","zh":"在小说里，khansamah 以严格的规矩管理厨房。"}]}],"synonyms":["cook","household cook","head cook","chef (context-dependent)"],"phonetic":"/kɑnˈsɑmə/","extraExplanation":["这个词多见于“英属印度时期/英印英语（Anglo-Indian English）”的语境，今天在一般现代英语中较少使用；现代写法更常见的是 khansama 或 khansamah。","词源来自印地语/乌尔都语等“khānsāmā”，历史上常指大户人家中负责厨房与餐食安排的男性主厨或管事。使用时要注意语境：它带有特定历史与阶层色彩，在当代写作中可用但最好交代背景。"]}
{"word":"khansaman","summary":{"en":"A historical South Asian term for a household head cook or dining steward.","zh":"一个带历史色彩的南亚词，指家庭中的主厨或负责餐饮事务的管事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, especially historical) A household servant in charge of cooking and managing food and dining in a home; a head cook or steward.","zh":"（南亚用语，尤指历史语境）负责做饭并管理餐食与餐厅事务的家仆；主厨或餐饮管家。"},"examples":[{"en":"During the colonial period, a khansaman often supervised the kitchen staff in an English household in India.","zh":"在殖民时期，khansaman 常在印度的英国家庭里管理厨房雇员。"},{"en":"The khansaman planned the menu and made sure dinner was served on time.","zh":"khansaman 负责安排菜单，并确保晚餐准时上桌。"}]}],"synonyms":["head cook","household steward","kitchen steward","butler (sometimes)"],"phonetic":"/kɑnˈsɑmə/","extraExplanation":["“khansaman”（也常拼作 khansamah / khansama）多见于英式英语与殖民地历史叙述，指英印时代家庭雇佣体系中的职位。放在现代语境时，可能带有时代色彩；更中性、通用的说法常用 cook（厨师）、household steward（家政管家）或 butler（管家，职责不一定包括做饭）。","词源上一般认为与波斯语/乌尔都语的称呼有关；在不同地区，其职责范围可能从“主厨”到“负责餐饮与采购的管事”不等。"]}
{"word":"khanum","summary":{"en":"Khanum is a respectful title or form of address for a woman in several Middle Eastern, Central Asian, and South Asian cultures, similar to “lady/madam.”","zh":"Khanum 是中东、中亚与南亚部分地区对女性的尊称或称呼方式，类似于“夫人/女士”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in parts of Central and South Asia and the Middle East) a respectful title for a woman, similar to “lady” or “madam,” often used after a name.","zh":"（中亚、南亚及中东部分地区）对女性的尊称，类似于“夫人 / 女士”，常接在名字之后使用。"},"examples":[{"en":"In the novel, the narrator addresses her as Amina Khanum to show respect.","zh":"在小说里，叙述者称她为 Amina Khanum 以示尊敬。"},{"en":"They invited the khanum of the household to speak first.","zh":"他们请这户人家的女主人（khanum）先发言。"}]},{"partOfSpeech":"n.","definition":{"en":"a polite form of address used when speaking directly to a woman in some cultures (similar to “ma’am”).","zh":"（某些文化语境中）对女性当面称呼的礼貌用语，近似于“夫人 / 女士 / 您”。"},"examples":[{"en":"Khanum, would you like some tea?","zh":"夫人，您要喝点茶吗？"},{"en":"Excuse me, khanum—your scarf fell.","zh":"不好意思，女士——您的围巾掉了。"}]}],"synonyms":["madam","lady","ma'am","begum"],"phonetic":"/ˈkɑːnəm/","extraExplanation":["“Khanum”（也常拼作 khanum/khānum/hanım/khanoom）源自突厥语与波斯语文化圈，历史上常用于对有地位或受尊敬女性的称呼，相当于“某某夫人”。","不同地区发音与拼写差异很大：例如土耳其语常见对应形式是“hanım”。在英文文本里多用于文学作品、历史叙述或跨文化对话中。","使用时要注意语境：它带有明显的地域与文化色彩；在英语日常生活中不常见，除非在相关社群或特定场景中。"]}
{"word":"khaos","summary":{"en":"“Khaos” is usually a stylized spelling of “chaos,” meaning disorder or confusion; in literature it can also mean the original “formless” state of the world.","zh":"“khaos”多为“chaos”的风格化拼写，意思是“混乱；无序”；在文学/神话中也可指“宇宙初始的混沌”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of complete disorder or confusion, where things seem out of control","zh":"混乱无序的状态；一片乱象"},"examples":[{"en":"The classroom fell into chaos after the bell rang.","zh":"铃声一响，教室里就乱成一团。"},{"en":"Traffic was in chaos after the accident.","zh":"事故发生后，交通一片混乱。"}]},{"partOfSpeech":"n.","definition":{"en":"the idea of a formless, mixed-up beginning of the world (often used in mythology or literature)","zh":"（神话/文学中）宇宙初始的混沌状态"},"examples":[{"en":"In some stories, the world begins with chaos and then becomes ordered.","zh":"在一些故事里，世界始于混沌，随后才变得有秩序。"}]}],"synonyms":["disorder","confusion","mayhem","turmoil","mess"],"phonetic":"/ˈkeɪɑːs/","extraExplanation":["“khaos”常见于对“chaos”的非标准拼写或风格化拼写（例如用户名、品牌名）。标准英语拼写是“chaos”。","词源上，“chaos”来自希腊语“khaos/chaos”，原意与“空隙、深渊、混沌”有关，所以在文学与神话语境中常指“天地未分的混沌”。","常见搭配：in chaos（陷入混乱）、descend into chaos（陷入混乱）、cause chaos（造成混乱）、total/complete chaos（彻底混乱）。"]}
{"word":"khaph","summary":{"en":"“khaph” is not common in English; it usually refers to the Hebrew letter כ, more commonly spelled kaf/kaph.","zh":"“khaph” 在英语中不常见；通常指希伯来字母 כ，更常写作 kaf/kaph。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare transliteration of the Hebrew letter כ, more commonly written as kaf or kaph (the 11th letter of the Hebrew alphabet). In modern usage it represents a “k” sound; with a dot (dagesh) it’s /k/, and without it it can be a softer sound (often like /kh/ in some traditions).","zh":"一种较少见的音译写法，指希伯来字母 כ（更常见的写法是 kaf 或 kaph，即希伯来字母表第11个字母）。现代用法中通常表示“k”音；带点（dagesh）时读 /k/，不带点时在某些传统里会更“柔”和更接近 /kh/ 的感觉。"},"examples":[{"en":"In some transliteration systems, you may see khaph used for the Hebrew letter kaf/kaph (כ).","zh":"在一些转写系统里，你可能会看到 khaph 用来表示希伯来字母 kaf/kaph（כ）。"},{"en":"Most English textbooks spell it kaf or kaph rather than khaph.","zh":"大多数英文教材会写 kaf 或 kaph，而不是 khaph。"}]},{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is often a misspelling of kaph/kaf or a personal/brand name.","zh":"不是标准英语单词；常见情况是把 kaph/kaf 拼错，或作为人名/品牌名使用。"},"examples":[{"en":"If you meant the Hebrew letter, try searching for kaph or kaf instead of khaph.","zh":"如果你指的是那个希伯来字母，建议用 kaph 或 kaf 搜索，而不是 khaph。"}]}],"synonyms":["kaf","kaph","caph"],"phonetic":"/kɑːf/","extraExplanation":["“kh”常见于把闪族语言（如希伯来语、阿拉伯语）中的喉音/擦音转写成拉丁字母时，用来提示它不是英语里的普通 /k/。但不同教材、学者或宗教传统的转写规则不一样，所以会出现 kaph/kaf/khaph 等多种拼法。"]}
{"word":"khaphs","summary":{"en":"“khaphs” is not a recognized English word; it’s probably a misspelling or a proper name.","zh":"“khaphs”不是常见英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/handle.","zh":"不是标准英语单词，可能是拼写错误，或是人名/用户名/专有名词。"},"examples":[{"en":"I can’t find “khaphs” in an English dictionary—did you mean “perhaps” or “chaps”?","zh":"我在英语词典里找不到“khaphs”——你想说的是“perhaps（也许）”还是“chaps（小伙子们）”吗？"},{"en":"If “Khaphs” is a username or brand name, it may not have a dictionary definition.","zh":"如果“Khaphs”是用户名或品牌名，它可能没有词典里的固定释义。"}]}],"extraExplanation":["“khaphs”看起来像是把某个英文词打错了。你可以告诉我：\n1）它出现在哪个句子里（整句发我）\n2）你想表达的中文意思是什么\n3）是否是人名/地名/游戏或作品里的专有名词\n我就能更准确地帮你确认正确拼法并解释含义。"]}
{"word":"khar","summary":{"en":"“Khar” usually means “donkey” in Hindi/Urdu, and it can also be an insulting slang word meaning “idiot.”","zh":"“khar”在印地语/乌尔都语中通常指“驴”，也可作带侮辱的俚语，指“笨蛋/傻子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Hindi/Urdu) a donkey.","zh":"（南亚英语；源自印地语/乌尔都语）驴。"},"examples":[{"en":"In the village story, a khar carries water up the hill every day.","zh":"在那个乡村故事里，一头khar每天把水驮上山。"},{"en":"The farmer tied his khar near the gate.","zh":"农夫把他的khar拴在门口附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(Hindi/Urdu slang, often insulting) a stupid person; an “idiot.”","zh":"（印地语/乌尔都语俚语，常带侮辱）笨蛋；傻子。"},"examples":[{"en":"Don’t call people khar—it’s rude and can start a fight.","zh":"别叫别人khar——这很粗鲁，可能会引起冲突。"},{"en":"He apologized for using the word khar in anger.","zh":"他为自己生气时说了khar而道歉。"}]}],"synonyms":["donkey","ass","fool (insulting context)"],"phonetic":"/kɑr/","extraExplanation":["“khar/khār（खर/خر）”在印地语/乌尔都语里本义是“驴”。因为英语里也会用donkey/ass表示“蠢人”，所以它在口语里也常被引申为骂人的话。","在跨文化交流中，这个词如果用来称呼人，通常会被理解为侮辱；更安全的表达是直接用英语的donkey（字面）或avoid name-calling（避免人身称呼）。"]}
{"word":"kharaj","summary":{"en":"Kharaj is a historical term for a land tax used in Islamic states, often connected to agricultural land.","zh":"Kharaj 是一个历史术语，指伊斯兰国家中的土地税，常与农地征税有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, in Islamic states) a land tax, especially one charged on non-Muslim-owned or conquered agricultural land.","zh":"（历史用语，伊斯兰国家）土地税；尤指对非穆斯林拥有或征服得来的农地征收的地税。"},"examples":[{"en":"In many medieval Islamic administrations, kharaj was collected from farmland to support the treasury.","zh":"在许多中世纪伊斯兰政权中，kharaj 会从农地征收，用来充实国库。"},{"en":"The document mentions kharaj alongside other taxes paid by village farmers.","zh":"文件中提到 khaaraj（kharaj）与其他由村庄农民缴纳的税并列出现。"}]}],"synonyms":["land tax","tribute (historical context)","tax (historical)"],"phonetic":"/kəˈrɑːdʒ/","extraExplanation":["“Kharaj（خراج）”源自阿拉伯语，常见于伊斯兰历史、经济史与中东研究语境。它通常指“土地税/地租性质的税”，与“jizya（吉兹亚，人头税/丁税，常与非穆斯林相关）”等概念并列讨论，但两者不是同一种税。","不同地区与不同时期对 kharaj 的具体征收对象、税率与制度安排会有差异；在学术文章或历史书中看到时，最好结合时代（如倭马亚、阿拔斯等）和当地制度来理解。"]}
{"word":"kharakt","summary":{"en":"Character most commonly means a person in a story, a person’s personality/moral qualities, a written symbol, or someone’s reputation.","zh":"Character 最常见的意思是“（故事中的）角色”“（人的）性格/品格”“字符/符号”和“名誉/声望”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person in a story, movie, play, or game","zh":"（故事、电影、戏剧或游戏中的）角色"},"examples":[{"en":"My favorite character in the movie is the brave sister.","zh":"我最喜欢电影里那个勇敢的姐姐角色。"},{"en":"The novel has many characters, but the main character is easy to remember.","zh":"这本小说有很多角色，但主角很容易记住。"}]},{"partOfSpeech":"n.","definition":{"en":"a person’s personality and moral qualities (who someone really is)","zh":"（一个人的）性格；品格（一个人真正的为人）"},"examples":[{"en":"She has a kind character and always helps others.","zh":"她品格善良，总是帮助别人。"},{"en":"It takes time to build good character.","zh":"培养良好的品格需要时间。"}]},{"partOfSpeech":"n.","definition":{"en":"a letter, number, or symbol in writing or printing","zh":"（书写或印刷中的）字符；字母/数字/符号"},"examples":[{"en":"Your password must include at least eight characters.","zh":"你的密码必须至少包含八个字符。"},{"en":"This Chinese character means “mountain.”","zh":"这个汉字的意思是“山”。"}]},{"partOfSpeech":"n.","definition":{"en":"the public reputation of a person or place","zh":"（个人或地方的）名誉；声望"},"examples":[{"en":"The town is known for its friendly character.","zh":"这个小镇以友好的名声而闻名。"},{"en":"He worried that the scandal would damage his character.","zh":"他担心丑闻会损害他的名誉。"}]}],"synonyms":["role","persona","personality","nature","symbol","reputation"],"phonetic":"/ˈkærɪktɚ/","extraExplanation":["你输入的 **kharakt** 很可能是在拼写 **character**。英语里 *ch* 常发 /k/（如 *school*）或 /tʃ/（如 *chair*），而 **character** 的开头发 /ˈkær-/，所以听起来像“ka-”。","词源小知识：*character* 来自希腊语 *kharaktēr*，原义与“刻印、印记”有关，所以它既能表示“文字/符号”，也能引申为“人的特质、品格”。","常见搭配：*main character*（主角）, *in character*（入戏/符合角色）, *out of character*（不符合某人一贯性格）。"]}
{"word":"kharia","summary":{"en":"Kharia refers to an Indigenous community in eastern/central India and also to their traditional language.","zh":"Kharia 指印度东部/中部的卡里亚原住民族群，也指他们的传统语言（卡里亚语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous (Adivasi) community in eastern and central India, especially in Jharkhand, Odisha, and Chhattisgarh.","zh":"（印度）卡里亚人：印度东部与中部（尤指贾坎德邦、奥迪沙邦、恰蒂斯加尔邦）的原住民（阿迪瓦西）族群成员。"},"examples":[{"en":"The Kharia are one of the many Indigenous communities in eastern India.","zh":"卡里亚人是印度东部众多原住民社区之一。"},{"en":"Some Kharia families maintain traditional farming and forest-based livelihoods.","zh":"一些卡里亚家庭仍保有传统的农耕与林地相关生计方式。"}]},{"partOfSpeech":"n.","definition":{"en":"the language traditionally spoken by the Kharia people; it is often classified within the Munda branch of the Austroasiatic language family.","zh":"卡里亚语：卡里亚人传统使用的语言；常被归类为南亚语系（Austroasiatic）的蒙达语支（Munda）。"},"examples":[{"en":"In some villages, elders still speak Kharia at home.","zh":"在一些村庄里，长者在家里仍会说卡里亚语。"},{"en":"Researchers record Kharia stories to help preserve the language.","zh":"研究者记录卡里亚语故事，以帮助保存这门语言。"}]}],"synonyms":["(people) Adivasi (broader term)","(language) Munda language (broader category)"],"phonetic":"/kəˈhɑːriə/","extraExplanation":["“Kharia”在英文里多作为专名使用（族群名、语言名），常见于人类学、语言学与印度社会研究语境。","不同地区可能有不同的书写与拼写习惯（如大小写、转写差异）；讨论语言时常写作“Kharia (language)”。"]}
{"word":"kharif","summary":{"en":"Kharif is the South Asian monsoon (summer) cropping season, with sowing at the start of the rains and harvest in autumn.","zh":"Kharif（卡里夫）指南亚的雨季（夏季）作物季：随季风雨开始播种，秋季收获。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In South Asia) the main summer monsoon cropping season, when crops are sown with the onset of the rains and harvested in autumn.","zh":"（南亚）雨季主作季（卡里夫季）；通常在季风雨开始时播种，秋季收获。"},"examples":[{"en":"Rice is a major kharif crop in many parts of India.","zh":"在印度许多地区，水稻是重要的卡里夫季作物。"},{"en":"Farmers waited for the first monsoon showers before planting their kharif crops.","zh":"农民在播种卡里夫季作物前，会等待第一场季风雨。"},{"en":"Kharif planting often depends heavily on timely rainfall.","zh":"卡里夫季的播种往往高度依赖降雨是否及时。"}]}],"synonyms":["monsoon season (in agriculture)","monsoon crop season","summer crop season (South Asia)"],"phonetic":"/kəˈrif/","extraExplanation":["“kharif/卡里夫”主要用于印度、巴基斯坦、孟加拉国等南亚语境的农业报道与政策文件中，属于区域性词汇。","它常与“rabi/拉比”（冬季作物季）成对出现：一般理解为雨季作物（kharif）与旱凉季作物（rabi）的对比。","词源上来自阿拉伯语，原意与“秋季”相关；在南亚农业中转而指“随季风雨开始播种、秋季收获”的这一季。"]}
{"word":"kharijite","summary":{"en":"Kharijite means a member of the early Islamic Khārijite sect; it can also be used figuratively (often critically) for someone seen as extreme and uncompromising.","zh":"kharijite 指伊斯兰早期哈瓦利吉派成员；也可作转义（常带批评）指被视为极端且不妥协的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an early Islamic sect (the Khārijites) that broke away from the main Muslim community after a political dispute in the 7th century, known for strict ideas about who counts as a true Muslim and for opposing rulers they saw as unjust","zh":"（历史）哈瓦利吉派成员：伊斯兰早期（公元7世纪）因政治分歧而从主流穆斯林社群分离出来的一个派别成员；以对“真正的穆斯林”标准较严、反对其认为不公正的统治者而闻名"},"examples":[{"en":"Some medieval chronicles describe conflicts between the caliph’s forces and Kharijite groups.","zh":"一些中世纪史书记载了哈里发军队与哈瓦利吉派团体之间的冲突。"},{"en":"In history classes, students may learn how the Kharijites emerged after disagreements over leadership.","zh":"在历史课上，学生可能会学习哈瓦利吉派如何在关于领导权的分歧后出现。"}]},{"partOfSpeech":"n.","definition":{"en":"(often lowercase) someone viewed as extremely strict, rebellious, or uncompromising, especially in a political or religious context (a figurative or often critical label)","zh":"（常用小写，转义/常带贬义）指被认为极端严苛、叛逆或不妥协的人，尤用于政治或宗教语境中的标签"},"examples":[{"en":"The columnist dismissed the hardliners as “kharijites,” suggesting they refused any compromise.","zh":"专栏作者把强硬派斥为“kharijites”，暗示他们拒绝任何妥协。"},{"en":"Be careful with the term: calling someone a kharijite can be a loaded accusation.","zh":"要谨慎使用这个词：称某人为 kharijite 可能是带强烈指控意味的说法。"}]}],"synonyms":["Khārijite","Khārijī"],"phonetic":"/kəˈrɪdʒaɪt/","extraExplanation":["“Kharijite”来自阿拉伯语“Khārijī”（意为“退出者/分离者”），指早期伊斯兰历史上在第一次内战时期因政治立场而“退出”原阵营的一派。","现代语境中把某人称作（小写）kharijite 往往是带立场的修辞用法，容易引发误解或冒犯；在写作或讨论时最好明确你是指历史派别还是比喻性的“极端/不妥协”。"]}
{"word":"kharoshthi","summary":{"en":"Kharoshthi is an ancient script used in ancient Gandhāra (roughly modern Pakistan/Afghanistan), especially for inscriptions and manuscripts.","zh":"Kharoshthi（佉卢文）是一种古代文字，主要流行于古代犍陀罗地区（约今巴基斯坦/阿富汗），常见于碑铭与手稿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient writing system (script) used mainly in what is now Pakistan and Afghanistan, especially for the Gāndhārī language, from about the 3rd century BCE to the 3rd century CE","zh":"一种古代文字书写系统（字母/文字），主要用于今巴基斯坦和阿富汗一带，常用来书写犍陀罗语（Gāndhārī），大约流行于公元前3世纪至公元3世纪"},"examples":[{"en":"Scholars study Kharoshthi inscriptions to learn about early Buddhist communities.","zh":"学者研究佉卢文（Kharoshthi）碑铭，以了解早期佛教社群。"},{"en":"This coin has a short Kharoshthi legend on one side.","zh":"这枚钱币的一面有一段简短的佉卢文（Kharoshthi）铭文。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj., also written as Kharoshthi) relating to this script or texts written in it","zh":"（形容词用法，也常写作Kharoshthi）与佉卢文这种文字或用其书写的文献有关的"},"examples":[{"en":"The museum displayed several Kharoshthi manuscripts on birch bark.","zh":"博物馆展出了几份写在桦树皮上的佉卢文（Kharoshthi）手稿。"}]}],"synonyms":["Kharoṣṭhī","Kharosthi script","Gandhari script"],"phonetic":"/kəˈroʊʃθi/","extraExplanation":["“Kharoshthi”也常见拼写为“Kharoṣṭhī”。它通常从右向左书写，与婆罗米（Brahmi）并列为南亚早期重要文字之一。","佉卢文常出现在钱币、石刻与桦树皮文书中，和丝绸之路、贵霜王朝时期的交流研究也有关联。"]}
{"word":"kharouba","summary":{"en":"Kharouba is a North African term for carob (the carob pod or tree).","zh":"kharouba 是北非地区对“角豆（carob）”（角豆荚或角豆树）的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Maghrebi Arabic loanword) a carob pod or the carob tree; carob.","zh":"（马格里布阿拉伯语借词）角豆荚或角豆树；角豆（carob）。"},"examples":[{"en":"In Algeria, people may call carob pods kharouba and use them in traditional drinks or sweets.","zh":"在阿尔及利亚，人们可能把角豆荚叫作 kharouba，并用来做传统饮料或甜点。"},{"en":"The market stall was selling kharouba alongside dates and figs.","zh":"摊位上在卖 kharouba，旁边还有椰枣和无花果。"}]}],"synonyms":["carob","carob pod","carob tree"],"phonetic":"/kəˈruːbə/","extraExplanation":["“kharouba”常见于北非（如摩洛哥、阿尔及利亚、突尼斯）的口语用法，来源于当地阿拉伯语/方言中对“角豆（carob）”的称呼（常见写法有 kharouba / kharrouba）。在英语语境里更常用标准词 carob；kharouba 多出现在移民社区、食谱、或文化介绍中。","由于阿拉伯语里常有类似“kh-”的喉音（英语里没有完全对应的音），英语转写与读法可能因地区而不同；把它读得接近“kuh-ROO-buh”通常能被理解。"]}
{"word":"kharroubah","summary":{"en":"Kharroubah usually refers to carob (the carob tree or its pods), and it can also be a surname/place name in North Africa.","zh":"Kharroubah 通常指“角豆/角豆树或其豆荚”，也可能是在北非语境中的姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Maghrebi Arabic loanword; often spelled kharrouba/kharroubah) the carob tree or its dark brown pods, used to make a sweet, cocoa-like syrup or powder.","zh":"（源自马格里布阿拉伯语的外来词，常见拼写为 kharrouba/kharroubah）角豆树；或其深褐色豆荚，可用来做带可可风味的甜浆/粉。"},"examples":[{"en":"In Algeria, people sometimes make a sweet drink from kharroubah (carob) syrup.","zh":"在阿尔及利亚，人们有时会用 kharroubah（角豆）糖浆做甜饮。"},{"en":"The market sold kharroubah pods alongside dates and almonds.","zh":"集市上把 kharroubah（角豆）荚和椰枣、杏仁一起卖。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name or place name in some North African contexts (spelling varies in English).","zh":"（在部分北非语境中）姓氏或地名（英语拼写常有不同）。"},"examples":[{"en":"Her last name is Kharroubah, and it’s sometimes spelled Kharrouba in documents.","zh":"她的姓是 Kharroubah，但在一些文件里也会拼作 Kharrouba。"}]}],"synonyms":["carob","locust bean","carob pod","carob tree"],"phonetic":"/kɑːˈruːbə/","extraExplanation":["“kharroubah/kharrouba”多见于北非（如阿尔及利亚、突尼斯、摩洛哥）的口语或法语转写语境。因为阿拉伯语里有英语不常见的喉音/摩擦音，不同的人会用 kh、h、或直接用 k 来转写，所以拼写与读音常不完全一致。","角豆（carob）在地中海饮食文化中很常见：可做糖浆（类似蜜）、烘焙粉（带焦糖/可可般风味），也常被当作不含咖啡因的“可可替代品”。"]}
{"word":"khartoum","summary":{"en":"Khartoum is the capital city of Sudan, at the meeting point of the Blue and White Nile.","zh":"Khartoum（喀土穆）是苏丹首都，位于青尼罗河与白尼罗河交汇处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Sudan, located where the Blue Nile and White Nile meet.","zh":"喀土穆：苏丹的首都，位于青尼罗河与白尼罗河的汇合处。"},"examples":[{"en":"Khartoum is Sudan’s capital and its main political center.","zh":"喀土穆是苏丹的首都，也是主要的政治中心。"},{"en":"The Blue Nile and the White Nile meet near Khartoum.","zh":"青尼罗河和白尼罗河在喀土穆附近汇合。"}]}],"synonyms":["Khartoum (proper noun)"],"phonetic":"/kɑrˈtum/","extraExplanation":["“Khartoum”常见于新闻与历史语境：殖民时期、尼罗河流域地理、以及近现代苏丹政治与冲突报道中。","发音提示：重音通常在第二音节（kahr-TOOM）。"]}
{"word":"khartoumer","summary":{"en":"“Khartoumer” means a person from Khartoum (Sudan).","zh":"“Khartoumer” 指喀土穆（苏丹）的人/居民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Khartoum, the capital city of Sudan; a resident of Khartoum","zh":"喀土穆人；喀土穆（苏丹首都）的居民"},"examples":[{"en":"She’s a Khartoumer who moved abroad for graduate school.","zh":"她是喀土穆人，后来出国读研究生。"},{"en":"Many Khartoumers commute across the city for work each day.","zh":"许多喀土穆居民每天穿城通勤上班。"}]}],"synonyms":["Khartoum resident","Khartoumian"],"phonetic":"/kɑrˈtuːmər/","extraExplanation":["“Khartoumer”是以城市名 Khartoum（喀土穆）加上表示“……人”的后缀 -er 构成的称呼，但在英文里并不是最常见、最固定的写法。你也可能会看到 “Khartoumian” 用来表示喀土穆人。","在正式写作中，如果不确定某地的标准称呼，可以用更中性的表达：“a resident of Khartoum（喀土穆的居民）”。"]}
{"word":"kharua","summary":{"en":"“Kharua” is generally not an English vocabulary word; it’s likely a transliterated name or local term from another language.","zh":"“kharua”一般不是英语词汇；更可能是其他语言的音译人名/地名或地方用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a transliteration from South Asian languages (e.g., Assamese/Hindi/Bengali) and may refer to a local name, family name, place name, or a culture-specific term.","zh":"不是标准英语词；通常是南亚语言（如阿萨姆语/印地语/孟加拉语等）的音译，可能指人名、姓氏、地名或某个特定文化语境中的词。"},"examples":[{"en":"I couldn’t find “kharua” in an English dictionary—what language is it from?","zh":"我在英语词典里找不到“kharua”——它来自哪种语言？"},{"en":"The document mentions Kharua as a village name, not an English vocabulary word.","zh":"这份文件里把 Kharua 当作村名提到，而不是英语词汇。"}]}],"phonetic":"/kəˈruːə/","extraExplanation":["“kharua”更像是把其他语言的词用拉丁字母拼出来（音译/转写）。不同地区、不同语言里含义可能完全不同，因此需要上下文才能准确定义。","如果你能提供：它出现的句子/段落、所属语言（或国家/地区）、是否为人名/地名/品牌名，我可以帮你判断最可能的含义与更自然的英文表达方式。"]}
{"word":"kharwa","summary":{"en":"Kharwa refers to a community in western India traditionally linked with seafaring and fishing, and it can also be used as an adjective meaning “of the Kharwa community.”","zh":"Kharwa指印度西部一个传统与航海、渔业相关的社群，也可作形容词表示“卡尔瓦社群的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Kharwa community, traditionally associated with seafaring and fishing in parts of western India (especially Gujarat).","zh":"卡尔瓦（Kharwa）族群成员；该社群在印度西部（尤以古吉拉特邦）传统上与航海、渔业等海上职业相关。"},"examples":[{"en":"His grandfather is Kharwa and worked on fishing boats along the Gujarat coast.","zh":"他祖父是卡尔瓦族人，曾在古吉拉特海岸的渔船上工作。"},{"en":"Some Kharwa families have long histories of seafaring and coastal trade.","zh":"一些卡尔瓦家庭有悠久的航海与沿海贸易历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Kharwa community.","zh":"与卡尔瓦（Kharwa）社群有关的；卡尔瓦族的。"},"examples":[{"en":"They served Kharwa-style coastal seafood at the festival.","zh":"节庆上他们提供了带有卡尔瓦沿海特色的海鲜料理。"},{"en":"She is researching Kharwa history and maritime culture.","zh":"她正在研究卡尔瓦的历史与海洋文化。"}]}],"synonyms":["Kharwa community"],"phonetic":"/ˈkɑrwə/","extraExplanation":["“Kharwa”更常见于南亚语境中作专有名词（族群/社群名称）。不同地区的拼写可能略有差异；在正式写作中，建议保留大写（Kharwa），并在首次出现时用一句话说明其地理与文化背景。"]}
{"word":"kharwar","summary":{"en":"Kharwar most commonly refers to an Indigenous community in India, and it can also mean the language associated with that community.","zh":"Kharwar 常指印度的一个原住民社群，也可指与该社群相关的语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to the Kharwar, an Indigenous (Adivasi) community found mainly in parts of northern and eastern India.","zh":"卡尔瓦尔人（Kharwar）：主要分布在印度北部与东部部分地区的原住民（阿迪瓦西）群体成员。"},"examples":[{"en":"The museum exhibit included photos of Kharwar communities and their traditional farming tools.","zh":"博物馆展览里有卡尔瓦尔社区的照片和他们传统农具的图片。"},{"en":"Some Kharwar families in the region work in agriculture and seasonal labor.","zh":"该地区一些卡尔瓦尔家庭从事农业和季节性劳务。"}]},{"partOfSpeech":"n.","definition":{"en":"the language (or a variety of speech) associated with the Kharwar community, sometimes discussed alongside nearby regional languages in India.","zh":"卡尔瓦尔语：与卡尔瓦尔群体相关的语言（或方言/语体），有时在研究中会与印度周边地区语言一起讨论。"},"examples":[{"en":"The researcher recorded short stories told in Kharwar to document local oral traditions.","zh":"研究者录下用卡尔瓦尔语讲述的短故事，以记录当地口述传统。"},{"en":"In school, students may speak Kharwar at home but use Hindi in class.","zh":"在学校里，学生在家可能说卡尔瓦尔语，但在课堂上使用印地语。"}]}],"synonyms":["(for the people) Kharwar people","(for the language) Kharwar language"],"phonetic":"/kɑrˈwɑr/","extraExplanation":["“Kharwar”多作为专有名词使用，通常指印度的一个部族/社群名称；在不同邦与地区，身份认同、名称拼写与语言归属的说法可能有所差异。","如果你是在历史、民族志或语言学文章里看到这个词，建议结合出现的地区（例如某个邦或县）来判断它具体指“族群”还是“语言/方言”。"]}
{"word":"khasa","summary":{"en":"Khasa usually refers to the Khas people of the Himalayas, and sometimes to the language(s) historically linked to them.","zh":"Khasa 通常指喜马拉雅地区的卡斯（Khas）族群，有时也指与其相关的历史语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ethnolinguistic group native to parts of the Himalayas (especially western Nepal and nearby regions), often called the Khas people","zh":"喜马拉雅地区（尤其尼泊尔西部及周边）的一支族群，常称为卡斯人（Khas people）"},"examples":[{"en":"Many Nepali surnames, such as Thapa and Rana, are associated with the Khas community.","zh":"尼泊尔的一些姓氏，如 Thapa 和 Rana，常与卡斯（Khas）族群有关。"},{"en":"The Khasa people historically lived in the hill regions of western Nepal.","zh":"卡斯人历史上多居住在尼泊尔西部的丘陵地区。"}]},{"partOfSpeech":"n.","definition":{"en":"the language(s) historically associated with the Khas people; sometimes used in older writing to refer to early forms connected to Nepali","zh":"与卡斯人相关的语言（或语言群）；在较旧的文献中有时用来指与尼泊尔语早期形态有关的语言"},"examples":[{"en":"Some historical sources mention Khasa when discussing the development of Nepali.","zh":"一些历史资料在讨论尼泊尔语的发展时会提到“Khasa”。"},{"en":"The term Khasa can be confusing, because it may refer to people, language, or a historical kingdom depending on context.","zh":"“Khasa”这个词可能会让人困惑，因为它在不同语境下可能指族群、语言或历史上的政权。"}]}],"synonyms":["Khas","Khas people","Khas Arya (context-specific)"],"phonetic":"/ˈkɑːsə/","extraExplanation":["“Khasa/Khas”在学术与历史语境中常见，但在日常英语里并不是高频词。拼写也可能出现变体（如 Khas、Khasa）。","如果你是想查乌尔都语/印地语里的“khaas/khās”（意思更接近“特别的、专门的”），那通常拼作 khaas，而不是 khasa。你可以告诉我你看到它的句子或出处，我能更准确判断。"]}
{"word":"khasi","summary":{"en":"Khasi refers to an ethnic group in Meghalaya, India, and the language they speak.","zh":"Khasi 指印度梅加拉亞邦的卡西族，以及他們所使用的卡西語。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (ethnic group) mainly living in the Indian state of Meghalaya, especially in the Khasi Hills region","zh":"卡西族：主要居住在印度梅加拉亞邦（Khasi Hills 等地）的一個民族"},"examples":[{"en":"Many Khasi people live in and around Shillong, the capital of Meghalaya.","zh":"許多卡西族人居住在梅加拉亞邦首府西隆及其周邊地區。"},{"en":"The Khasi community has a rich tradition of music and storytelling.","zh":"卡西族社群有豐富的音樂與口述故事傳統。"}]},{"partOfSpeech":"n.","definition":{"en":"the language spoken by the Khasi people (also called Khasi); it belongs to the Austroasiatic language family","zh":"卡西語：卡西族所使用的語言，屬於南亞語系（Austroasiatic）"},"examples":[{"en":"She is learning Khasi to communicate with her grandparents.","zh":"她正在學卡西語，好和祖父母交流。"},{"en":"Road signs in Meghalaya may appear in English, Hindi, and Khasi.","zh":"梅加拉亞邦的路標可能會同時使用英語、印地語和卡西語。"}]}],"phonetic":"/ˈkɑːsi/","extraExplanation":["「Khasi」在英文中常作專有名詞使用，指民族或語言；寫作時通常首字母大寫（Khasi）。","卡西族在社會文化上以母系（matrilineal）傳承而聞名：家族血緣與部分財產傳承常以女性一方為主。"]}
{"word":"khass","summary":{"en":"Khass is a South Asian English loanword meaning “special” or “particular,” and can also refer to a “special person/thing.”","zh":"Khass 是南亚语境中的英语借词，意思是“特别的/特定的”，也可指“特别的人或事物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asian English, from Urdu/Hindi) special; particular; not ordinary.","zh":"（南亚英语用法，源自乌尔都语/印地语）特别的；特定的；不一般的。"},"examples":[{"en":"This mango is khass—much sweeter than the regular ones.","zh":"这个芒果很khass——比普通的甜得多。"},{"en":"We prepared something khass for the guests.","zh":"我们为客人准备了特别的东西。"}]},{"partOfSpeech":"n.","definition":{"en":"a special person or thing; something chosen as special.","zh":"特别的人或事物；被选作“特别”的东西。"},"examples":[{"en":"She’s my khass friend—I can tell her anything.","zh":"她是我特别的朋友——我什么都能跟她说。"},{"en":"Save this box for the khass items.","zh":"把这个盒子留给特别的物品用。"}]}],"synonyms":["special","particular","exclusive","distinctive"],"phonetic":"/kɑːs/","extraExplanation":["“khass/ khaas”多见于南亚语境（印度、巴基斯坦等）的英语口语或社交媒体拼写，来自乌尔都语/印地语“khās/khāṣṣ”，意思是“特别、专门、特定”。在标准英语写作里通常用 special / particular / exclusive 来表达。","拼写上也常见 khas、khaas、khās 等版本；发音和拼写会随地区与个人习惯变化。"]}
{"word":"khat","summary":{"en":"Khat is a plant (and its leaves) that people chew or brew as a stimulant, especially in East Africa and the Arabian Peninsula.","zh":"Khat（卡特/恰特）指一种植物及其叶子，人们常咀嚼或泡饮以提神，尤见于东非与阿拉伯半岛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant whose leaves are chewed or brewed as a stimulant, commonly used in parts of East Africa and the Arabian Peninsula.","zh":"一种植物，其叶子常被咀嚼或泡饮作为兴奋剂，主要流行于东非和阿拉伯半岛部分地区。"},"examples":[{"en":"In some communities, people gather in the afternoon to chew khat and talk for hours.","zh":"在一些社区，人们下午聚在一起嚼卡特叶，聊天好几个小时。"},{"en":"The newspaper reported debates about khat and public health.","zh":"报纸报道了关于卡特叶与公共健康的争论。"}]},{"partOfSpeech":"n.","definition":{"en":"The leaves of this plant, used as a mild stimulant drug.","zh":"（该植物的）叶子，被用作温和的兴奋性药物。"},"examples":[{"en":"He bought fresh khat leaves, which lose strength as they dry out.","zh":"他买了新鲜的卡特叶；这种叶子一旦变干，效果就会减弱。"},{"en":"Some countries restrict the sale of khat.","zh":"一些国家限制卡特叶的销售。"}]}],"synonyms":["qat","Catha edulis"],"phonetic":"/kɑt/","extraExplanation":["“khat”在英语里通常指植物Catha edulis及其叶子。其主要活性成分与兴奋作用有关，因此在不同国家可能被视为传统习俗用品或受管制物质。具体法律因国家/地区而异。","常见搭配：chew khat（嚼卡特叶）、khat session（嚼卡特叶的聚会/时段）、fresh khat leaves（新鲜卡特叶）。拼写变体：qat。"]}
{"word":"khatib","summary":{"en":"A khatib is a Muslim preacher who delivers the khutbah, especially the Friday sermon at a mosque.","zh":"khatib 指伊斯兰教在清真寺宣讲呼图白（尤其是周五主麻演讲）的布道者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Islam, a preacher who delivers the sermon (especially the Friday sermon, the khutbah) at a mosque.","zh":"（伊斯兰教）在清真寺宣讲布道、尤其是在主麻日（周五）宣讲“呼图白/聚礼演讲”（khutbah，库图白）的布道者。"},"examples":[{"en":"The khatib delivered the Friday sermon to a packed mosque.","zh":"那位khatib在座无虚席的清真寺里做了周五的主麻演讲。"},{"en":"During Ramadan, different khatibs were invited to speak each week.","zh":"在斋月期间，每周都会邀请不同的khatib来讲道。"}]}],"synonyms":["preacher","sermon-giver","orator"],"phonetic":"/kəˈtiːb/","extraExplanation":["“khatib”（也常拼作 khateeb）来自阿拉伯语 خطيب，字面意思接近“演说者/演讲者”。在很多语境中，它特指在清真寺站在讲坛（minbar）上发表呼图白（khutbah）的那个人。","khatib 不一定等同于 imam（伊玛目）。imam 通常指带领礼拜的人或宗教领袖；而 khatib 强调“宣讲/讲道”的角色。有时同一人兼任两种职责，但也可能分开。","如果你在新闻或历史文本中看到该词，它常与“Friday prayers（主麻日礼拜）”“sermon（布道/讲道）”“khutbah（呼图白）”一起出现。"]}
{"word":"khatin","summary":{"en":"Khatyn: a Belarusian village destroyed in 1943, now known for a WWII civilian memorial.","zh":"Khatyn：白俄罗斯一座在1943年被毁的村庄，如今以纪念二战平民遇难者的纪念馆闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Khatyn (often spelled Khatyn or Khatyn’) is the name of a former village in Belarus that was destroyed by Nazi forces in 1943; it is now known mainly for the Khatyn Memorial, which commemorates civilians killed during World War II.","zh":"Khatyn（常见拼写：Khatyn）是白俄罗斯一个已不存在的村庄名；该村于1943年在二战期间被纳粹军队焚毁并造成平民死亡。如今它主要因“哈丁纪念馆（Khatyn Memorial）”而闻名，用于纪念战争中遇难的平民。"},"examples":[{"en":"We learned about the Khatyn Memorial while studying World War II in Belarus.","zh":"我们在学习白俄罗斯的二战历史时了解了哈丁纪念馆。"},{"en":"Khatyn is remembered as a symbol of the many villages destroyed during the war.","zh":"哈丁被人们铭记为战争中许多被毁村庄的象征。"}]}],"phonetic":"/hɑːˈtiːn/","extraExplanation":["“Khatyn”在英语里有时会与“Katyn（卡廷）”混淆：Katyn通常指二战时期在波兰发生的“卡廷惨案（Katyn massacre）”。两者地点与事件不同，但拼写和发音相近，阅读历史资料时要特别留意。"]}
{"word":"khatri","summary":{"en":"Khatri is the name of a North Indian community (often associated with Punjab) and is also used as a surname.","zh":"Khatri 指印度北部（常与旁遮普相关）的一个社群名称，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Khatri community, a traditionally merchant-and-administrator caste group found mainly in North India (especially Punjab); the term can also be used as a surname","zh":"卡特里族群（Khatri）成员：印度北部（尤以旁遮普）常见的传统商人/行政阶层社群；该词也常用作姓氏"},"examples":[{"en":"Her family is Khatri, originally from Punjab.","zh":"她家是卡特里族群，祖籍在旁遮普。"},{"en":"Singh is common, but some people use Khatri as a surname.","zh":"Singh 很常见，但有些人用 Khatri 作为姓氏。"}]}],"synonyms":["Khatri (surname)","Kshatriya (related historical term)"],"phonetic":"/ˈkɑːtri/","extraExplanation":["“Khatri”在英语里多写作大写（Khatri），因为它常指特定社群/族群名称或姓氏。","它与“Kshatriya（刹帝利）”在历史上常被联系（词源与社会阶层传统有关），但在现代语境中更多是具体社群身份的称呼；不同地区与家庭的认同与背景可能差异很大。","谈到种姓/社群话题时，英语交流中通常建议保持尊重与谨慎，避免把个人能力或性格与出身标签直接绑定。"]}
{"word":"khats","summary":{"en":"“Khats” means more than one “khat”—stimulant leaves chewed or brewed in some cultures.","zh":"“khats”是“khat”的复数，指多份恰特叶（在部分文化中被咀嚼或泡饮、具有轻微兴奋作用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of khat: the leaves of a shrub (Catha edulis) that are chewed or brewed for a mild stimulant effect.","zh":"khat 的复数：一种灌木（阿拉伯茶／恰特，学名 Catha edulis）的叶子，人们会咀嚼或泡饮以获得轻微的兴奋（刺激）作用。"},"examples":[{"en":"Customs officers found several bags of khats in the suitcase.","zh":"海关人员在行李箱里发现了几袋 khats（恰特叶）。"},{"en":"Some people chew khats to stay awake during long evenings.","zh":"有些人会嚼 khats 来在漫长的夜晚保持清醒。"}]}],"synonyms":["khat leaves","qat","qat leaves"],"phonetic":"/kɑt/","extraExplanation":["“khat”（常译“恰特”“阿拉伯茶”）在部分东非与阿拉伯半岛地区具有社交与文化背景，但在一些国家/地区被列为管制物质或违禁品；具体规定因地而异。","英语里复数通常写作“khats”，也常见直接用不可数用法“khat”（把它当作一种物质/习惯来谈）。"]}
{"word":"khatti","summary":{"en":"Khatti means “sour/tangy,” commonly used in South Asian contexts (from Hindi/Urdu).","zh":"Khatti 表示“酸的/酸爽的”，常见于南亚语境（源自印地语/乌尔都语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asian English, from Hindi/Urdu) sour; tart; tangy in taste or smell.","zh":"（南亚英语，源自印地语/乌尔都语）酸的；带酸味的；酸爽的（味道或气味）。"},"examples":[{"en":"The mangoes are still khatti, so let them ripen for a few days.","zh":"芒果还很khatti（很酸），再放几天熟一熟吧。"},{"en":"I like khatti chutney with samosas.","zh":"我喜欢用khatti（酸味的）酸辣酱配萨莫萨（炸三角）。"}]},{"partOfSpeech":"n.","definition":{"en":"Sourness or a sour/tangy flavor (used in casual South Asian contexts).","zh":"酸味；酸酸的口感（多见于南亚语境的口语表达）。"},"examples":[{"en":"This dish has a nice khatti that balances the spice.","zh":"这道菜的酸味（khatti）很好，能把辣味平衡住。"}]}],"synonyms":["sour","tart","tangy"],"phonetic":"/ˈkʌti/","extraExplanation":["“khatti/khattī（खट्टी/کھٹی）”在印地语、乌尔都语、旁遮普语等语言里很常见，常用来形容食物的“酸”。在英语对话中，多见于南亚社群的日常英语（South Asian English），属于带文化语境的借词。","你可能会看到固定搭配“khatti-meethi（酸甜的）”，常用来形容某些零食、酸辣酱、腌菜、糖果或生活经历“酸甜交织”。","在标准英语写作中，一般会改用 sour / tart / tangy；而在谈论南亚菜时保留“khatti”会更地道、更有文化色彩。"]}
{"word":"khattish","summary":{"en":"“Khattish” is an uncommon, informal adjective meaning “khat-like” or “somewhat related to khat.”","zh":"“khattish”并非常见标准词，通常是非正式用法，表示“有点像/带有恰特草（khat）特征的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat like khat (a stimulant plant) in effect, smell, taste, or cultural association; khat-like.","zh":"有点像恰特草（khat，一种兴奋性植物）的；带有恰特草特征或联想的；类似恰特草的。"},"examples":[{"en":"The tea had a slightly khattish bitterness, like something herbal and stimulating.","zh":"这杯茶有点“khattish”的苦味，像带点草本、提神的东西。"},{"en":"He joked that the late-night chat felt khattish—everyone was unusually awake and talkative.","zh":"他开玩笑说深夜聊天有点“khattish”——大家都异常清醒、健谈。"}]}],"synonyms":["khat-like","khat-ish","herbal-stimulant-like"],"phonetic":"/ˈkɑːtɪʃ/","extraExplanation":["“khattish”不是常见的标准英语词；更可能是把“khat（恰特草）”加上形容词后缀“-ish（有点……的）”的临时造词，写作也常见为“khat-ish”。","khat常指东非与阿拉伯半岛部分地区咀嚼的植物（学名Catha edulis），含有兴奋成分；在一些国家/地区其使用具有法律与文化争议。如果你是在某篇文章、歌词或社交媒体里看到这个词，它多半是在借“khat”的文化联想来表达“提神、兴奋、上头”的感觉。","如果你其实想查的是“catty（刻薄的、爱说人闲话的）”或“hattish（像帽子般的）”，把原句发我，我可以帮你确认最合适的词。"]}
{"word":"khaya","summary":{"en":"Khaya most commonly refers to African mahogany (a group of African trees and their wood), and it can also be used as a personal name.","zh":"Khaya 最常见的意思是“非洲桃花心木”（非洲楝属树及其木材），也可作人名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African trees whose wood is sold as African mahogany (often used for furniture and instruments)","zh":"楝科非洲楝属（其木材常被称为“非洲桃花心木”，常用于家具与乐器）"},"examples":[{"en":"This table is made from khaya, a type of African mahogany.","zh":"这张桌子是用 khaya（非洲桃花心木的一种）做的。"},{"en":"Many guitar makers like khaya for its warm tone and nice grain.","zh":"很多吉他制作者喜欢用 khaya，因为它的音色温暖、纹理漂亮。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (used in several cultures; meaning depends on language and family tradition)","zh":"人名（在多种文化中使用；含义因语言与家族传统而异）"},"examples":[{"en":"Khaya is my friend’s name.","zh":"Khaya 是我朋友的名字。"},{"en":"How do you pronounce Khaya?","zh":"Khaya 这个名字怎么读？"}]}],"synonyms":["African mahogany","khaya mahogany"],"phonetic":"/ˈkaɪ.ə/","extraExplanation":["“Khaya”在英语里最常见于植物学与木材贸易领域，指非洲产的非洲楝属树木。木材市场上常把它归为“African mahogany（非洲桃花心木）”，但它不一定等同于“真桃花心木”（常指 Swietenia 属）。","在日常交流中，如果你在装修、家具、乐器话题里看到 khaya，通常指材料；如果出现在自我介绍或名单里，更可能是人名，需要结合上下文判断。"]}
{"word":"khayal","summary":{"en":"Khayal means “thought/imagination” in Hindi/Urdu, and it also names a major genre of Hindustani classical vocal music.","zh":"Khayal 在印地语/乌尔都语中指“想法/想象”，也指印度斯坦（北印度）古典声乐的重要体裁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Hindi/Urdu) a thought, idea, feeling, or something imagined; imagination.","zh":"（印地语/乌尔都语）想法、念头、感受；想象（力）。"},"examples":[{"en":"The poem expresses the poet’s khayal about love and loss.","zh":"这首诗表达了诗人关于爱与失去的种种念想（khayal）。"},{"en":"It was just a khayal—nothing confirmed yet.","zh":"那只是个念头（khayal）——还没有任何确定的消息。"}]},{"partOfSpeech":"n.","definition":{"en":"Khayal: a major style (genre) of North Indian (Hindustani) classical vocal music, known for improvisation and expressive melody.","zh":"Khayal：北印度（印度斯坦）古典声乐的重要流派/体裁，以即兴发挥与富有表现力的旋律著称。"},"examples":[{"en":"She is training in khayal singing with a classical guru.","zh":"她正在跟随古典音乐老师学习 khayal 演唱。"},{"en":"Tonight’s concert features a khayal performance in raga Yaman.","zh":"今晚的音乐会将演出拉格 Yaman 的 khayal。"}]}],"synonyms":["thought","idea","imagination","fancy","Hindustani classical (music)"],"phonetic":"/kəˈjɑːl/","extraExplanation":["“Khayal”源自波斯语/阿拉伯语词根，核心含义与“想象、思绪”相关；因此在音乐语境中，它也暗示演唱者通过即兴来“展开想象”。","在印度斯坦古典音乐里，khayal 通常以某个拉格（raga，旋律框架）为基础，配合塔拉（tala，节奏循环）进行发展；常见有较慢的 vilambit（慢板）和较快的 drut（快板）段落。","英文中常以专有名词形式出现（首字母可大写：Khayal），多见于音乐评论、世界音乐课程或南亚文化相关文本。"]}
{"word":"khazar","summary":{"en":"Khazar refers to a medieval Turkic people and their state north of the Black and Caspian Seas.","zh":"Khazar 指中世紀早期黑海與里海以北的突厥語族民族「可薩人」，也可指其政權「可薩汗國」。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Khazars, a Turkic-speaking people who lived north of the Black Sea and the Caspian Sea in the early Middle Ages","zh":"可薩人：中世紀早期生活在黑海與里海以北地區的突厥語族民族之一"},"examples":[{"en":"The Khazar elite played an important role in trade between Europe and Asia.","zh":"可薩人的上層階級在歐亞之間的貿易中扮演了重要角色。"},{"en":"Some historians study how the Khazars interacted with Byzantium and the early Rus’ states.","zh":"一些歷史學者研究可薩人如何與拜占庭以及早期羅斯諸國互動。"}]},{"partOfSpeech":"n.","definition":{"en":"the Khazar state (also called the Khazar Khaganate), a medieval empire that existed roughly from the 7th to the 10th century","zh":"可薩汗國（可薩帝國）：約7世紀至10世紀存在的中世紀政權"},"examples":[{"en":"The Khazar Khaganate controlled key routes along the Volga and the steppe.","zh":"可薩汗國控制了伏爾加河與草原地帶的重要通道。"},{"en":"Sources about the Khazar empire come from Arabic, Byzantine, and Hebrew writings.","zh":"關於可薩帝國的史料來自阿拉伯、拜占庭與希伯來文獻。"}]}],"synonyms":["Khazar Khaganate (for the state)"],"phonetic":"/ˈkɑzɑr/","extraExplanation":["「Khazar / Khazars」在英文中通常首字母大寫，因為它是專有名詞（民族或國家）。","可薩汗國在歐亞草原的歷史中很有名的一點，是部分統治階層可能曾改宗猶太教；但相關細節仍有學術爭論，需看史料來源與研究觀點。"]}
{"word":"khazarian","summary":{"en":"Khazarian means “of the Khazars” or “a Khazar,” referring to a medieval Turkic people and their steppe empire.","zh":"Khazarian 指“与可萨人/可萨汗国有关的”，或“可萨人”，涉及中世纪草原地区的一个突厥民族及其政权。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Khazars, a Turkic people and the medieval Khazar Khaganate (roughly 7th–10th centuries) in the Pontic–Caspian steppe region.","zh":"与可萨人（Khazars，一支突厥语族民族）及其中世纪可萨汗国（约公元7—10世纪，黑海—里海草原地区）有关的。"},"examples":[{"en":"The museum has a small exhibit of Khazarian coins and trade goods.","zh":"博物馆有一个小型展区，展示可萨汗国时期的硬币和贸易物品。"},{"en":"Some historians study Khazarian diplomacy between Byzantium and the early Rus.","zh":"一些历史学家研究可萨与拜占庭及早期罗斯之间的外交关系。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who was a member of the Khazar people; a Khazar.","zh":"可萨人；可萨民族的一员。"},"examples":[{"en":"The text mentions a Khazarian serving as a frontier commander.","zh":"文献提到一位可萨人担任边境指挥官。"},{"en":"Archaeologists debate whether this burial can be identified as Khazarian.","zh":"考古学家争论这座墓葬是否能被认定为可萨人的。"}]}],"synonyms":["Khazar","of the Khazars"],"phonetic":"/kəˈzɛriən/","extraExplanation":["“Khazarian”来自“Khazar（可萨人）+ -ian（表示‘与……有关的人/事’）”。常见于历史、考古与中世纪欧亚研究语境。","在通俗文化或网络讨论中，“Khazarian”有时会被不当用来指涉或影射某些族群（尤其与犹太史相关的争议话题），容易引发误解甚至偏见；学术写作中通常更中性地使用“Khazar/Khazar Khaganate”。"]}
{"word":"khazen","summary":{"en":"Khazen is mainly used as a surname (family name), especially in Arabic-speaking contexts, and it is often associated with the meaning “keeper/treasurer” from Arabic roots.","zh":"Khazen 主要用作姓氏（家族名），在阿拉伯语背景中较常见；其词源常与“保管者/司库”之意相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), found especially among Arabic-speaking communities (e.g., Lebanon).","zh":"姓氏（家族名）；在阿拉伯语社群中较常见（例如黎巴嫩）。"},"examples":[{"en":"Ms. Khazen will speak at the conference tomorrow.","zh":"Khazen 女士将于明天在会议上发言。"},{"en":"I saw the name Khazen on the class list.","zh":"我在班级名单上看到了 Khazen 这个姓。"}]},{"partOfSpeech":"other","definition":{"en":"(from Arabic roots) related to the idea of a “keeper/treasurer,” someone who stores or guards something valuable.","zh":"（源自阿拉伯语词根）含有“保管者/ خزينة 管库者、 خزّان 类似含义”的语感，可理解为“看守、保管财物的人（如司库、库管）”。"},"examples":[{"en":"The surname is often explained as coming from a word meaning “treasurer.”","zh":"这个姓氏常被解释为源自一个表示“司库/财物保管者”的词。"},{"en":"In some contexts, people connect Khazen with the idea of guarding resources.","zh":"在某些语境里，人们会把 Khazen 和“守护/保管资源”的概念联系起来。"}]}],"synonyms":["(surname) —","treasurer (meaning-related)","keeper (meaning-related)"],"phonetic":"/kɑːˈzɛn/","extraExplanation":["“Khazen”常见为音译拼写，具体读音会因家庭、地区与英语环境而略有差异。","在黎巴嫩历史与社会语境中，Khazen 也可能指一个知名家族姓氏；如果你是在某本书、新闻或名单里看到它，多半是人名/姓氏而不是普通英语词汇。"]}
{"word":"khazenim","summary":{"en":"“Khazenim” means Jewish cantors (plural), who lead prayers and singing in a synagogue.","zh":"“khazenim”指“犹太会堂的领唱/诵经者”（复数），负责带领祷告吟诵与会众歌唱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun) Jewish cantors—people who lead congregational singing and chant prayers in a synagogue.","zh":"（复数名词）犹太会堂的领唱/诵经者——带领会众唱诵与吟唱祷文的人。"},"examples":[{"en":"The khazenim led the congregation through the High Holiday prayers.","zh":"这些 khazenim 带领会众完成了犹太新年与赎罪日的祷文吟唱。"},{"en":"Several khazenim were invited to perform traditional melodies at the community event.","zh":"社区活动邀请了几位 khazenim 演唱传统圣歌旋律。"}]}],"synonyms":["cantors","chazzanim","synagogue cantors"],"phonetic":"/xɑˈzɑnɪm/","extraExplanation":["“khazenim”多见于对希伯来语/意第绪语词汇的拉丁字母转写；更常见的拼写是“chazzanim”（单数 chazzan）。","词源来自希伯来语“חזן”（ḥazzan），在犹太礼拜传统中指负责带领祷告吟诵与会众歌唱的人。不同社群与转写体系会造成拼写差异（如 kh/ch、a/e）。"]}
{"word":"khazens","summary":{"en":"“Khazens” is a playful, nonstandard spelling of “cousins.”","zh":"“khazens”是“cousins（表亲/堂亲）”的玩笑式非标准拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard, playful spelling of “cousins” (relatives who share grandparents), often used online to imitate pronunciation or a particular accent.","zh":"“cousins（表亲/堂亲）”的非标准、玩笑式拼写，常见于网络，用来模仿发音或某种口音。"},"examples":[{"en":"My khazens are visiting this weekend.","zh":"我的“khazens”（表亲/堂亲）这个周末要来。"},{"en":"In the meme, “khazens” is just a funny way to write “cousins.”","zh":"在那个梗图里，“khazens”只是把“cousins”写得好玩一点。"}]}],"synonyms":["cousins"],"phonetic":"ˈkʌzənz","extraExplanation":["“khazens”不是标准英语拼写，正式写作、学校作业、邮件中应使用“cousins”。","这种拼写常见于网络聊天、梗图或角色口吻（比如刻意用拼写来表现口音/语气）。使用时注意场合，避免让人误以为你不知道正确拼法。"]}
{"word":"kheda","summary":{"en":"Kheda is most commonly a place name in Gujarat, India; it can also mean (khedda) an old method/enclosure for capturing wild elephants.","zh":"Kheda最常见是印度古吉拉特邦的地名；也可指（khedda）一种旧时围捕野象的方法或围栏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a district and city name in Gujarat, western India (often written “Kheda” as a proper noun).","zh":"（专有名词）印度西部古吉拉特邦的一个地区名/城市名，常写作“Kheda”。"},"examples":[{"en":"She grew up in Kheda district in Gujarat.","zh":"她在古吉拉特邦的凯达地区长大。"},{"en":"The project supports farmers in Kheda, India.","zh":"该项目支持印度凯达的农民。"}]},{"partOfSpeech":"n.","definition":{"en":"(also spelled “khedda”) a traditional method of capturing wild elephants by driving them into an enclosure; also the enclosure itself.","zh":"（亦作khedda）一种传统的捕捉野生大象的方法：把象群驱赶进围栏；也可指该围栏本身。"},"examples":[{"en":"In older accounts, hunters used a kheda to capture elephants.","zh":"在较早的记载中，猎人用“kheda（围捕法）”来捕捉大象。"},{"en":"The elephants were driven toward the kheda enclosure.","zh":"大象被驱赶向kheda围栏。"}]}],"synonyms":["Khedda"],"phonetic":"ˈkeɪdə","extraExplanation":["“Kheda”作地名时属于专有名词，常见于印度地理、新闻与个人经历叙述中。","“kheda/khedda”作英语词汇时多见于历史记述与殖民时期的旅行/狩猎文本；现代语境更强调野生动物保护，因此该词带有明显的历史色彩。"]}
{"word":"khedah","summary":{"en":"“Khedah” is a South Asian term for a fenced enclosure used to capture and tame wild elephants.","zh":"“khedah”是南亚用语，指用于围捕并驯服野生大象的围栏式围场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) An enclosure or stockade used to capture and tame wild elephants (often by driving them into the enclosure).","zh":"（南亚）用于围捕并驯服野生大象的围栏/木栅围场（常通过驱赶把象群赶入其中）。"},"examples":[{"en":"The villagers built a khedah near the river to capture elephants safely.","zh":"村民们在河边建了一个khedah，用更安全的方式围捕大象。"},{"en":"In the past, elephants were sometimes driven into a khedah and then trained for work.","zh":"过去，人们有时把大象赶进khedah，然后训练它们劳动。"}]}],"synonyms":["khedda","stockade","enclosure","corral"],"phonetic":"/ˈkɛdə/","extraExplanation":["“khedah”也常写作“khedda”（更常见的拼写），在英语里属于带有历史与殖民时期记录色彩的词，主要出现在关于印度/南亚狩猎、林业与驯象的描写中。","词源来自印地语/乌尔都语“kheḍā”，本义与“围捕/围栏”相关。现代英语日常对话中很少用，多见于历史、民族志、旅行写作或文学描写。","一些英文作品（如英属印度背景的游记或冒险叙事）会提到用围栏、陷阱或驱赶法进行“elephant khedda/khedah”，带有特定时代背景；阅读时可留意其语境可能涉及对野生动物与当地社群的不同视角。"]}
{"word":"khedahs","summary":{"en":"Khedahs are enclosures used (especially in India) to trap wild elephants.","zh":"khedahs 指（尤在印度）用于围捕野生大象的栅寨/围栏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of khedah) an enclosure or stockade used in South Asia (especially India) to trap and capture wild elephants, often as part of an organized elephant round-up.","zh":"（khedah 的复数）一种用于南亚（尤指印度）捕捉野生大象的围栏/栅寨，常用于有组织的“围捕大象”活动。"},"examples":[{"en":"The hunters drove the herd toward the khedahs at dawn.","zh":"猎人们在黎明时分把象群赶向那些 khedahs（捕象围栏）。"},{"en":"In older accounts of colonial India, khedahs are described as large wooden stockades built near forest routes.","zh":"在一些关于英属印度的旧记载里，khedahs 被描述为沿森林通道搭建的大型木制栅寨。"}]}],"synonyms":["elephant enclosure","stockade","corral","pen"],"phonetic":"/kəˈdɑ/","extraExplanation":["“khedah”（也常见拼写 kheddah）源自南亚语言（多认为与印地语/乌尔都语相关），在英文里多出现在历史、旅行写作或殖民时期的叙述中。现代语境更常用更中性的说法如 “elephant corral/enclosure” 或直接描述为 “elephant capture enclosure”。"]}
{"word":"khedas","summary":{"en":"Khedas usually means “villages/rural settlements” (plural of kheda) in a South Asian context, or multiple places called Kheda depending on the text.","zh":"Khedas 通常指“乡村/农村聚落”（kheda 的复数，南亚语境），也可能指多个名为 Kheda 的地点，需结合上下文判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Hindi/Gujarati) villages or rural settlements; plural of kheda.","zh":"（南亚英语；源自印地语/古吉拉特语）乡村、农村聚落；kheda 的复数。"},"examples":[{"en":"Many families moved from the khedas to the city for work.","zh":"许多家庭为了工作从乡村搬到城市。"},{"en":"The festival is celebrated across the khedas every year.","zh":"这个节日每年在各个乡村都会庆祝。"}]},{"partOfSpeech":"n.","definition":{"en":"A plural form sometimes used to refer to places named Kheda (e.g., the Kheda district/region in Gujarat, India), depending on context.","zh":"在某些语境中指名为 Kheda 的多个地点（例如印度古吉拉特邦的 Kheda 地区/县等），具体要看上下文。"},"examples":[{"en":"He traveled through the Khedas of central Gujarat.","zh":"他穿行于古吉拉特邦中部的多个 Kheda 地区/地点。"}]}],"synonyms":["villages","rural settlements","hamlets"],"phonetic":"/ˈkeɪdəz/","extraExplanation":["“kheda”在南亚语境里更常见作地名（如印度古吉拉特邦的 Kheda 区），或在地方语言里指“村庄/乡村聚落”。如果你是在某段特定文章、历史事件或家族/地名记录里看到“khedas”，欢迎把原句发来，我可以帮你判断更准确的含义与用法。","英语里更常见的对应表达通常是 villages / rural villages / hamlets。"]}
{"word":"khediva","summary":{"en":"A rare term for the wife or female counterpart of Egypt’s khedive (viceroy) in the Ottoman-era context.","zh":"一个较少见的词，指奥斯曼时期埃及“赫迪夫”（总督/副王）的妻子或女性对应称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the wife or female counterpart of a khedive (the viceroy/ruler of Egypt under the Ottoman Empire).","zh":"（埃及“赫迪夫”——奥斯曼帝国时期埃及总督/统治者的）妻子或女性对应称号。"},"examples":[{"en":"In a historical novel, the khediva appears at court ceremonies beside the khedive.","zh":"在一部历史小说中，这位 khediva 在宫廷仪式上陪伴着赫迪夫出场。"},{"en":"The museum label mentioned gifts presented to the khediva during the late 1800s.","zh":"博物馆的说明牌提到，19世纪末有人向这位 khediva 进献礼物。"}]}],"synonyms":["khedivah","khedive’s wife"],"phonetic":"/kəˈdiːvə/","extraExplanation":["“Khediva”是较少见的拼写形式，也常见作“khedivah”。词根来自奥斯曼—波斯语传统的头衔用法；“khedive”指19世纪到20世纪初奥斯曼帝国名义下统治埃及的总督/副王（如伊斯梅尔·帕夏）。因此“khediva”多出现在历史研究、博物馆说明、或历史小说语境中。"]}
{"word":"khedival","summary":{"en":"“Khedival” means “connected with the Khedive (ruler of Egypt) or the Khedivate period/government.”","zh":"“khedival”表示“与埃及赫迪夫（统治者称号）或赫迪夫时期/政权有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a khedive (the former title of the ruler/viceroy of Egypt under the Ottoman Empire) or to the period/government connected with that title.","zh":"与“赫迪夫”（奥斯曼帝国时期埃及统治者/总督的称号）有关的；与赫迪夫统治时期或其政权有关的。"},"examples":[{"en":"The museum has documents from the khedival administration in nineteenth-century Egypt.","zh":"博物馆收藏了19世纪埃及赫迪夫政权时期的行政文件。"},{"en":"Cairo’s khedival-era buildings show strong European influence.","zh":"开罗的赫迪夫时期建筑呈现出明显的欧洲影响。"},{"en":"Historians discuss khedival reforms that reshaped Egypt’s economy.","zh":"历史学家讨论了赫迪夫时期重塑埃及经济的改革。"}]}],"synonyms":["khedive-related","Egyptian (historical context)"],"phonetic":"/kəˈdiːvəl/","extraExplanation":["“khedival”来自“khedive”（赫迪夫）+ 形容词后缀“-al”，意思是“……的/与……有关的”。“赫迪夫”是19世纪到20世纪初埃及统治者常用的头衔，名义上隶属奥斯曼帝国，常见于历史、政治与建筑等语境。阅读史料时也会看到“the Khedivate of Egypt”（埃及赫迪夫国/赫迪夫政体）等说法。"]}
{"word":"khedivate","summary":{"en":"Khedivate means a territory ruled by a khedive, especially Egypt under khedives (1867–1914).","zh":"khedivate 指由赫迪夫统治的领地，尤指1867–1914年赫迪夫时期的埃及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A territory or state ruled by a khedive (a viceroy), especially Egypt when it was governed by khedives under Ottoman authority (1867–1914).","zh":"由“赫迪夫”（奥斯曼帝国名义下的总督/副王）统治的领地或国家；尤指1867–1914年间由赫迪夫统治的埃及。"},"examples":[{"en":"Under the Khedivate of Egypt, Cairo underwent major modernization projects.","zh":"在埃及赫迪夫时期，开罗经历了重大的现代化建设项目。"},{"en":"The Suez Canal became central to the Khedivate’s economy and foreign relations.","zh":"苏伊士运河成为赫迪夫时期经济与对外关系的核心。"}]}],"synonyms":["viceroyalty","viceroyship","(historical) Egypt under the khedives"],"phonetic":"/kəˈdiːveɪt/","extraExplanation":["“Khedivate”最常见的用法是指“Egyptian Khedivate（埃及赫迪夫国/赫迪夫时期的埃及）”。当时埃及名义上隶属奥斯曼帝国，但在行政、财政与外交上逐渐获得更大自主空间。","相关历史线索：1867年“khedive（赫迪夫）”头衔被正式承认；1914年第一次世界大战爆发后，英国宣布埃及为保护国，赫迪夫体制结束，改为“苏丹国（Sultanate of Egypt）”。","阅读中常见搭配：the Khedivate of Egypt, during the Khedivate, Khedival (adj.) politics/period（“khedival”为形容词，意为“赫迪夫的/赫迪夫时期的”）。"]}
{"word":"khedive","summary":{"en":"Khedive = the historical title of Egypt’s Ottoman-era viceroy/ruler (1867–1914).","zh":"khedive 指奥斯曼时期埃及统治者/副王的历史称号（约1867—1914年）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A title for the Ottoman viceroy (governor) of Egypt, especially used by Egypt’s rulers from 1867 to 1914.","zh":"（历史）“赫迪夫”：奥斯曼帝国授予埃及总督/副王的称号，尤指1867—1914年埃及统治者所用的头衔。"},"examples":[{"en":"The Khedive of Egypt tried to modernize Cairo with new roads and buildings.","zh":"埃及的赫迪夫试图通过修建道路和建筑来推动开罗的现代化。"},{"en":"Many history books describe how the Khedive’s finances became tied to European lenders.","zh":"许多历史书会提到赫迪夫的财政如何与欧洲放贷者紧密相连。"}]}],"synonyms":["viceroy","governor","ruler"],"phonetic":"/kəˈdiːv/","extraExplanation":["“Khedive”来自土耳其语（与波斯语词根有关），大意是“领主/统治者”。这个称号体现了埃及在名义上仍属于奥斯曼帝国、但在实际政治上拥有较大自治的特殊地位。","常见搭配：the Khedive of Egypt；也可指某位具体人物，如 Isma'il Pasha（伊斯梅尔帕夏）或 Abbas II（阿巴斯二世）。","历史背景小提示：1914年英国建立保护国后，这个头衔被“苏丹”（Sultan of Egypt）取代，之后埃及又改称“国王”（King）。"]}
{"word":"khedives","summary":{"en":"Khedives is the plural of khedive, a historical title for the Ottoman-era ruler of Egypt (and the person who held that title).","zh":"khedives 是 khedive 的复数，指奥斯曼时期埃及统治者（总督/副王）的历史称号，也可指担任该称号的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical title for the ruler (viceroy) of Egypt under the Ottoman Empire, especially in the 1800s","zh":"（历史）“赫迪夫”：奥斯曼帝国时期埃及统治者（总督/副王）的称号，尤指19世纪"},"examples":[{"en":"The Khedives modernized parts of Egypt in the 19th century.","zh":"19世纪的赫迪夫推动了埃及部分现代化。"},{"en":"The title ‘Khedive’ was used by Egypt’s rulers before it was replaced by ‘Sultan’ and later ‘King.’","zh":"在“苏丹”与后来的“国王”称号出现之前，埃及统治者曾使用“赫迪夫”这一称号。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who held the title of Khedive","zh":"（具体某位）担任“赫迪夫”这一称号的人"},"examples":[{"en":"Isma'il Pasha was a well-known Khedive of Egypt.","zh":"伊斯梅尔·帕夏是埃及著名的赫迪夫之一。"},{"en":"The khedive’s court attracted officials and foreign advisers.","zh":"赫迪夫的宫廷吸引了官员和外国顾问。"}]}],"synonyms":["viceroy","ruler","governor"],"phonetic":"/kəˈdiːv/","extraExplanation":["“Khedive”来自波斯语词源，意为“领主/君主”。在英语史料中常见于近代埃及与奥斯曼帝国关系的讨论。","复数是 khedives（你输入的形式）。单数是 khedive。","在阅读历史文本时，它常与 viceroy（副王/总督）、Ottoman Empire（奥斯曼帝国）、Egyptian modernization（埃及现代化）等主题一起出现。"]}
{"word":"khediviah","summary":{"en":"Khediviah is a rare spelling used for “khedival/khedivial” (related to the khedive of Egypt) and sometimes for “khedivate.”","zh":"khediviah 是罕见拼写，通常指“赫迪夫的”（khedival/khedivial），有时也指“赫迪夫国/赫迪夫统治”（khedivate）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; variant spelling) relating to a khedive (the Ottoman-era viceroy/ruler of Egypt) or to the Khedivate of Egypt.","zh":"（罕见；拼写变体）与“赫迪夫”（奥斯曼时期埃及的总督/统治者）或“埃及赫迪夫国”有关的；赫迪夫的。"},"examples":[{"en":"Some older histories describe Egypt’s “khediviah administration” when discussing the late 1800s.","zh":"一些较早的历史著作在讨论19世纪末时，会用“khediviah administration（赫迪夫时期的行政）”来描述埃及。"},{"en":"The museum displayed coins from the khediviah period of Egypt.","zh":"博物馆展出了埃及赫迪夫时期的硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) the office, rank, or system of rule of a khedive; khedivate.","zh":"（极罕见）赫迪夫的职位、头衔或统治体制；赫迪夫国（khedivate）。"},"examples":[{"en":"The author uses “khediviah” to refer to the political structure under the khedive.","zh":"作者用“khediviah”来指赫迪夫治下的政治结构。"}]}],"synonyms":["khedival","khedivial","khedivate"],"phonetic":"/kəˈdiːviəl/","extraExplanation":["“khediviah”并不是现代英语里常见或规范的拼写。更常见、也更容易在词典里查到的是：\n- khedive（名词：赫迪夫）\n- khedival / khedivial（形容词：赫迪夫的）\n- khedivate（名词：赫迪夫国/赫迪夫统治）","历史背景：Khedive（赫迪夫）是奥斯曼帝国时期授予埃及统治者的一种称号，常用于19世纪到20世纪初（大致1867–1914）的埃及政体语境。阅读历史类英文材料时更常见到 “Khedivate of Egypt（埃及赫迪夫国）”。","用法建议：写作时如果你想表达“赫迪夫的”，通常用 khedival（或 khedivial）；想表达“赫迪夫国/统治体制”，用 khedivate 更清晰、也更标准。"]}
{"word":"khedivial","summary":{"en":"Khedivial means “connected with the khedive (historical ruler of Egypt) or his era/government.”","zh":"khedivial 指“与埃及历史上的赫迪夫（统治者/总督）及其统治时期或政府有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a khedive (a historical title for the ruler or viceroy of Egypt under the Ottoman Empire) or to the period and government connected with that ruler.","zh":"与“赫迪夫”（奥斯曼帝国时期埃及的统治者/总督这一历史头衔）有关的；与赫迪夫统治时期或其政府有关的。"},"examples":[{"en":"The museum displayed documents from the khedivial administration in Egypt.","zh":"博物馆展出了埃及赫迪夫政府时期的行政文件。"},{"en":"Some buildings in Cairo date back to the khedivial era.","zh":"开罗的一些建筑可以追溯到赫迪夫时期。"},{"en":"They studied khedivial reforms that shaped modern Egyptian institutions.","zh":"他们研究了影响现代埃及制度的赫迪夫时期改革。"}]}],"synonyms":["khedive-related","Egyptian (historical context)","Ottoman-era (in Egypt)"],"phonetic":"/kəˈdiːviəl/","extraExplanation":["“khedivial”来自“khedive”（赫迪夫）+ 形容词后缀 -al，常用于历史、政治与建筑语境。","“赫迪夫”是奥斯曼体系下授予埃及统治者的称号，常与19世纪后期至20世纪初的“埃及赫迪夫国（Khedivate of Egypt）”联系在一起（大致从1867年至1914年）。","在阅读史料时，你可能会看到类似搭配：khedivial government（赫迪夫政府）、khedivial decree（赫迪夫敕令/法令）、khedivial palace（赫迪夫宫殿）。"]}
{"word":"khediviate","summary":{"en":"A historical realm ruled by a khedive, especially Egypt (1867–1914).","zh":"由赫迪夫统治的历史政体，尤指1867—1914年的埃及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical state or territory ruled by a khedive (especially Egypt under the Ottoman Empire’s nominal authority, 1867–1914).","zh":"由“赫迪夫”（khedive，埃及的总督/副王）统治的历史政体或领地（尤指名义上隶属奥斯曼帝国的埃及，1867—1914年）。"},"examples":[{"en":"The Khediviate of Egypt carried out major modernization projects in the late 1800s.","zh":"19世纪末，埃及赫迪夫领推进了许多现代化工程。"},{"en":"In some history books, the period before the British protectorate is described as the Khediviate.","zh":"在一些历史书中，英国保护国之前的那段时期被称为“赫迪夫领时期”。"},{"en":"The Suez Canal became central to the Khediviate’s finances and foreign influence.","zh":"苏伊士运河成为赫迪夫领财政与外国影响力的核心。"}]}],"synonyms":["Khedivate","Egyptian Khedivate","Khedivate of Egypt"],"phonetic":"/kəˈdiːviˌeɪt/","extraExplanation":["“khediviate”常见的另一种拼写是“Khedivate”。它来自“khedive（赫迪夫）”，是奥斯曼体系下埃及统治者的一种头衔。","历史上通常指埃及从“赫迪夫制度”确立（1867年起）到一战期间英国结束其名义地位（1914年）这段时期。阅读史料时也会见到更具体的称法，如“Egyptian Khedivate / Khedivate of Egypt”。"]}
{"word":"khedwo","summary":{"en":"“khedwo” isn’t a recognized English word; it’s likely a name, transliteration, or misspelling.","zh":"“khedwo”不是常见英语词；更可能是人名/音译或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a name, or a transliteration from another language.","zh":"不是标准英语单词；可能是拼写错误、人名/地名，或来自其他语言的音译。"},"examples":[{"en":"I couldn’t find “khedwo” in an English dictionary—can you share the sentence where you saw it?","zh":"我在英语词典里找不到“khedwo”——你能把它出现的句子发我吗？"},{"en":"If you meant “shadow,” the spelling is different.","zh":"如果你想写的是“shadow（影子）”，拼写就不一样。"}]}],"phonetic":"/ˈkɛdwoʊ/","extraExplanation":["“khedwo”看起来更像是音译拼写（比如把某种语言的发音用拉丁字母写出来），而不是英语词汇。","如果你告诉我它出现的语境（一句话/一段文字）、来源（歌曲、社交媒体、游戏、某个语言/地区），我可以更准确判断它可能对应的词。","也可能是打字误差：请确认是否想输入类似的英语词（例如 shadow / shed / meadow 等），或是否少了/多了字母。"]}
{"word":"khella","summary":{"en":"Khella is a Mediterranean plant (Ammi visnaga), known for its toothpick-like dried stems and occasional use in herbal products.","zh":"Khella 指一种地中海植物（Ammi visnaga），以可作牙签的干燥茎和在草药产品中的使用而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Mediterranean plant (Ammi visnaga) whose dried flower stalks have been used as toothpicks and in traditional herbal medicine; also called toothpick plant.","zh":"一种地中海植物（学名 Ammi visnaga），其干燥花梗曾被用作牙签，也用于传统草药用途；又称“牙签草/牙签植物”。"},"examples":[{"en":"In some markets, dried khella stems are sold as natural toothpicks.","zh":"在一些市场上，会出售干燥的 khella 茎当作天然牙签。"},{"en":"The herb shop labeled the product as khella, but it also listed the Latin name Ammi visnaga.","zh":"那家草药店把产品标为 khella，同时也标注了拉丁学名 Ammi visnaga。"}]}],"synonyms":["toothpick plant","Ammi visnaga","toothpick weed"],"phonetic":"/ˈkɛlə/","extraExplanation":["khella 在英语里属于较少见的借词，常见于草药、植物学或保健品标签中。","传统用法里常把它与“放松平滑肌、舒缓痉挛”等说法联系在一起，但现代使用需谨慎：可能与药物相互作用或引起不适，尤其是孕期、哺乳期或有慢性病者应先咨询专业人士。","在不同地区，产品名可能写作 khella、khillah，或直接用学名 Ammi visnaga。"]}
{"word":"khellin","summary":{"en":"Khellin is a natural compound from the khella plant, studied for medicinal effects (especially muscle-relaxing).","zh":"Khellin 是来自 khella 植物的一种天然化合物，因可能具有药用（尤其放松平滑肌）作用而被研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical compound (a furanochromone) found in the plant khella (Ammi visnaga), studied and sometimes used in medicine for its smooth-muscle–relaxing effects (for example, in breathing passages or urinary tract).","zh":"一种天然化学成分（呋喃色原酮类），存在于植物“克利拉/阿米伞形草”（khella，学名 Ammi visnaga）中；因可能具有放松平滑肌的作用而被研究，并在医学上曾被用于与呼吸道或泌尿道相关的用途。"},"examples":[{"en":"Researchers isolated khellin from the khella plant to study its effects on airway muscles.","zh":"研究人员从 khella 植物中分离出 khellin，用来研究它对气道肌肉的影响。"},{"en":"Khellin has been discussed historically as a natural compound linked to the development of later asthma medications.","zh":"在历史资料中，khellin 常被提到是一种与后续哮喘药物研发有关的天然化合物。"}]}],"synonyms":["khella compound","Ammi visnaga constituent"],"phonetic":"/ˈkɛlɪn/","extraExplanation":["“khellin”多见于药学、植物化学与医学史语境，不是日常英语高频词。拼写来自植物名 khella（Ammi visnaga，伞形科）。","在现代医学中，它更多作为研究对象或药物研发的历史线索被提及；具体使用与安全性需以专业医疗建议为准。"]}
{"word":"khemia","summary":{"en":"Khemia is a rare historical word meaning alchemy, and sometimes early chemistry.","zh":"khemia 是一个少见的历史词，主要指炼金术，有时也指早期意义上的化学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) Alchemy; the early, mystical form of chemistry that aimed to transform substances (for example, turning base metals into gold) and to discover universal remedies.","zh":"（历史用语）炼金术；化学的早期神秘形态，试图转化物质（如把贱金属变成黄金）并寻找万能药。"},"examples":[{"en":"In medieval Europe, many scholars studied khemia in hopes of making gold.","zh":"在中世纪欧洲，许多学者研究 khemia，希望能炼出黄金。"},{"en":"Some early writings on khemia mixed careful observation with spiritual beliefs.","zh":"一些早期的 khemia 著作把细致的观察与宗教/灵性信念混合在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, historical) Chemistry; the study of substances and how they change.","zh":"（少见，历史用语）化学；研究物质及其变化的学科。"},"examples":[{"en":"In older texts, khemia could refer to what we now call chemistry.","zh":"在较早的文本中，khemia 有时指我们现在所说的“化学”。"}]}],"synonyms":["alchemy","early chemistry","chemical art"],"phonetic":"/ˈkiːmiə/","extraExplanation":["“khemia/khēmia”常被认为是“chemistry（化学）”一词的词源之一：经由希腊语/晚期希腊语的 khēmia（常与炼金术相关），再到阿拉伯语 al-kīmiyāʾ（其中 al- 是定冠词“the”），最后进入欧洲语言。","它在英语里非常少见，现代英语更常用的对应词是 “alchemy（炼金术）” 或 “chemistry（化学）”。如果你是想拼 “alchemy”，那是最常见的写法。"]}
{"word":"khepesh","summary":{"en":"A khepesh is an ancient Egyptian curved sickle-sword.","zh":"khepesh 指古埃及的弯刃镰形剑（镰刀剑）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a curved ancient Egyptian sword (a “sickle-sword”), used especially in the Bronze Age and often shown in pharaohs’ battle scenes","zh":"（古埃及）弯刃镰形剑／镰刀剑；一种青铜时代常见的弯曲兵器，壁画中常见法老持用"},"examples":[{"en":"The museum displayed a khepesh next to other Bronze Age weapons.","zh":"博物馆把一把 khepesh 和其他青铜时代武器一起展出。"},{"en":"In many carvings, the pharaoh holds a khepesh as a symbol of royal power.","zh":"在许多雕刻中，法老手持 khepesh，象征王权与武力。"}]}],"synonyms":["khopesh","sickle-sword"],"phonetic":"/ˈkɛpɛʃ/","extraExplanation":["“khepesh”常见的学术/大众拼写也有“khopesh”。两者多指同一种武器，只是转写（把古埃及语/相关语音写成拉丁字母）方式不同。","这种武器的典型外形像镰刀：前段弯曲、适合劈砍与钩拉。它既是实用兵器，也在艺术与仪式图像中代表统治与胜利。","发音在英语中不算完全固定；学习时认得拼写和常见替代拼写（khopesh）通常更重要。"]}
{"word":"kherwari","summary":{"en":"Kherwari refers to a group of Munda (Austroasiatic) languages in India, and can also mean “related to” that language group.","zh":"Kherwari 指印度蒙达语族中的一个语群（南亚语系），也可作形容词表示“与该语群/其族群相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) A subgroup of the Munda branch of the Austroasiatic language family, including languages such as Santali, Mundari, and Ho, spoken mainly in eastern and central India.","zh":"（语言学）南亚语系（Austroasiatic）中蒙达语族（Munda）的一个分支/语群，包含桑塔利语（Santali）、蒙达里语（Mundari）、霍语（Ho）等，主要分布在印度东部与中部。"},"examples":[{"en":"Santali is often classified as a major Kherwari language.","zh":"桑塔利语常被归类为主要的科赫瓦里（Kherwari）语言之一。"},{"en":"The research compares sound changes across Kherwari languages.","zh":"这项研究比较了科赫瓦里语群内部各语言的语音演变。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Kherwari language group or its speakers.","zh":"与科赫瓦里语群或其使用者相关的。"},"examples":[{"en":"The museum has a small collection of Kherwari folk songs.","zh":"这家博物馆收藏了一小部分科赫瓦里语群的民歌。"},{"en":"She studies Kherwari grammar as part of her fieldwork in India.","zh":"她在印度做田野调查时研究科赫瓦里语群的语法。"}]}],"synonyms":["Kherwarian"],"phonetic":"/kɛrˈwɑri/","extraExplanation":["“Kherwari”在英语学术写作里多见于语言分类语境；更常见的同义写法是“Kherwarian”。","这不是一个日常英语词汇，通常出现在语言学、人类学、南亚研究等领域的书籍、论文或博物馆/文化项目介绍中。"]}
{"word":"kherwarian","summary":{"en":"Kherwarian refers to a major branch of the Munda (Austroasiatic) languages, especially in eastern/central India, and can also mean a language or speaker from that branch.","zh":"Kherwarian 指孟达语族（南亚语系）中的一个重要语支（多在印度东/中部），也可指该语支的语言或其使用者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Kherwarian branch of the Munda languages (Austroasiatic family), spoken mainly in eastern and central India (e.g., Santali, Mundari, Ho).","zh":"与孟达语族（南亚语系）中的“克赫尔瓦里语支（Kherwarian）”有关的；主要分布在印度东部和中部（如桑塔利语、蒙达里语、霍语等）。"},"examples":[{"en":"Santali is one of the best-known Kherwarian languages.","zh":"桑塔利语是最著名的克赫尔瓦里语支语言之一。"},{"en":"The study compares Kherwarian vocabulary across several Munda-speaking communities.","zh":"这项研究比较了多个孟达语社群中克赫尔瓦里语支的词汇。"}]},{"partOfSpeech":"n.","definition":{"en":"a Kherwarian language or a speaker of a Kherwarian language (used mainly in linguistics/anthropology).","zh":"克赫尔瓦里语支语言；或克赫尔瓦里语支语言的使用者（主要用于语言学/人类学语境）。"},"examples":[{"en":"The survey lists three Kherwarian varieties spoken in the district.","zh":"调查列出了该地区使用的三种克赫尔瓦里语支变体。"},{"en":"She interviewed Kherwarian speakers about traditional songs.","zh":"她采访了克赫尔瓦里语支语言的使用者，了解传统歌曲。"}]}],"synonyms":["Munda (context-dependent)","South Munda (closely related term)"],"phonetic":"/ˌkɛrˈwɑriən/","extraExplanation":["“Kherwarian”在日常英语里不常见，多出现在语言学、民族学和南亚研究的学术写作中。","该术语通常与“South Munda（南孟达语支）”的分类讨论相关；不同学者的细分可能略有差异，但常见成员包括 Santali、Mundari、Ho 等。","拼写上首字母常大写（Kherwarian），因为它是专名/分类名；用于修饰“languages / branch / subgroup”等名词时最常见。"]}
{"word":"khesari","summary":{"en":"Khesari is a South Asian legume (grass pea) eaten as dal; long-term heavy consumption may be risky.","zh":"Khesari 指南亚常见的豆类（草豌豆），可做达尔食用；长期大量食用可能有健康风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South Asian pulse (a type of legume), also called grass pea, whose dried seeds are eaten as dal but can be harmful if eaten in large amounts for a long time","zh":"（南亚常见的）一种豆类作物，又称草豌豆；其干籽可做达尔（豆汤/豆泥）食用，但若长期大量食用可能有健康风险"},"examples":[{"en":"In some parts of India, khesari is cooked as dal when other lentils are expensive.","zh":"在印度的一些地区，当其他扁豆比较贵时，人们会把 khesari 煮成达尔来吃。"},{"en":"The government warned people not to rely on khesari as the only staple food.","zh":"政府提醒人们不要把 khesari 当作唯一的主食长期依赖。"}]}],"synonyms":["grass pea","Lathyrus sativus","khesari dal"],"phonetic":"/kəˈsɑːri/","extraExplanation":["“Khesari”在英语里多见于南亚语境，常指“khesari dal”（草豌豆的豆子）。在印度、孟加拉等地，它耐旱、产量稳定，所以在欠收或贫困时期更常被食用。","需要注意的是：草豌豆若长期大量食用，可能与一种神经系统疾病“lathyrism（豆类神经病）”有关，因此在一些地区会有管控或食用建议。日常学习英语时，把它理解为“一种南亚常见的豆类食材名称”最实用。"]}
{"word":"khet","summary":{"en":"Khet is most often an Egyptology term for the Nile’s inundation season (also spelled Akhet). It can also be a transliterated name with meaning depending on the original language.","zh":"Khet 最常见是埃及学术语，指尼罗河的泛滥季（也常拼作 Akhet）。它也可能是某些语言音译的人名/地名，含义需看原语言与语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Egypt, in Egyptology) The inundation season of the Nile; often written as “Akhet.”","zh":"（古埃及/埃及学）尼罗河的“泛滥季/洪水季”，常写作“Akhet”。"},"examples":[{"en":"Farmers planned their work around Khet, when the Nile flooded the fields.","zh":"农民会围绕 Khet（泛滥季）来安排农活，因为尼罗河会淹没田地。"},{"en":"In many textbooks, Khet is listed as the first season of the ancient Egyptian year.","zh":"在许多教材中，Khet 被列为古埃及一年中的第一个季节。"}]},{"partOfSpeech":"other","definition":{"en":"(South Asia/Middle East contexts) A transliteration sometimes used for a place name or surname; meaning depends on the source language.","zh":"（南亚/中东语境）一种音译拼写，可能是地名或姓氏；具体含义取决于原语言。"},"examples":[{"en":"Khet appears as a family name in some records.","zh":"在一些记录中，Khet 会作为姓氏出现。"},{"en":"Please confirm the spelling of “Khet,” since it may be a transliteration.","zh":"请确认 “Khet” 的拼写，因为它可能是音译。"}]}],"synonyms":["Akhet (common spelling)"],"phonetic":"/kɛt/","extraExplanation":["在英语里，“khet”不是常见词，最常见的学术用法来自古埃及历法：一年三季之一的“泛滥季”。更常见的拼法是“Akhet”（前面多一个 a-），在书籍、博物馆说明牌和历史课程中更容易见到。","如果你看到的是人名/地名的“Khet”，它很可能来自不同语言的音译（例如阿拉伯语、波斯语、印地语等），发音与含义会随原语言变化；需要具体语境才能准确定义。"]}
{"word":"kheth","summary":{"en":"Kheth is a less-common name for the Hebrew letter ח, mainly seen in transliteration or older reference works.","zh":"Kheth 是希伯来字母 ח 的一种较不常见的名称，多用于转写体系或较旧的参考资料中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the name of a letter in some Semitic alphabets, especially the Hebrew letter ח (more commonly called het/chet), used in transliteration systems","zh":"某些闪米特字母中的一个字母名，尤指希伯来字母 ח（更常称作 het/chet），常用于转写体系"},"examples":[{"en":"In some older textbooks, you may see kheth used for the Hebrew letter ח.","zh":"在一些较旧的教材中，你可能会看到用 kheth 来指希伯来字母 ח。"},{"en":"The sound written as kheth in one system may be spelled het or chet in another.","zh":"在一种体系里写作 kheth 的音，在另一种体系中可能拼作 het 或 chet。"}]}],"synonyms":["het","chet"],"phonetic":"/kɛθ/","extraExplanation":["“kheth”多见于学术或较旧的转写/音译体系，用来表示希伯来语字母 ח（现代常见写法是 het 或 chet）。","这个字母对应的发音在不同语言和口音中不完全一样，英语里常用 kh/ch 来近似表示一种“喉部摩擦音”，所以会出现多种拼法。","如果你是想查英语常用词，“kheth”并不常见；也可能是拼写输入错误。你可以告诉我你在哪个语境（书名/句子/语言课）看到它，我可以更准确解释。"]}
{"word":"kheths","summary":{"en":"“kheths” isn’t standard English; it may be a misspelling or a plural form of “kheth” meaning farmland in some South Asian contexts.","zh":"“kheths”不是标准英语；可能是拼写错误，或在部分南亚语境中作为“kheth（农田/田地）”的复数用法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a transliteration from another language (meaning depends on context).","zh":"不是标准英语单词；很可能是拼写错误或从其他语言音译而来（具体含义取决于语境）。"},"examples":[{"en":"I couldn’t find “kheths” in an English dictionary—could you share the sentence it appears in?","zh":"我在英语词典里查不到“kheths”，你能把它出现的句子发我吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(Possible loanword, South Asian context) Plural of “kheth,” meaning a field/farmland (used in some South Asian languages and sometimes seen in English writing about rural life).","zh":"（可能的外来词，南亚语境）“kheth”的复数，指田地/农田（在一些南亚语言中常见，英语描写乡村生活时偶尔会借用）。"},"examples":[{"en":"After the monsoon, the kheths turned bright green with new rice plants.","zh":"季风雨过后，农田里新栽的稻苗让田地一片翠绿。"},{"en":"Many families work in the kheths from early morning.","zh":"许多家庭一大早就在田地里干活。"}]}],"synonyms":["fields","farmland","cropland"],"phonetic":"/kɛθs/","extraExplanation":["“kheths”在英语里不常见，最常见的情况是：\n1）你想写的是别的英语单词（例如拼写相近的词），\n2）它是某种语言（如印地语/尼泊尔语/旁遮普语等）中“田地/农田”的音译，在英文文章里被借用。\n如果你把原句或告诉我是哪种语言/地区用法，我可以更准确地解释、给更自然的英文表达。"]}
{"word":"khets","summary":{"en":"“khets” is a South Asian English plural meaning cultivated fields or farmland.","zh":"“khets”是南亚英语里表示“农田/耕地”的复数说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Hindi/Urdu) farmland or a cultivated field; plural form of khet.","zh":"（南亚英语；源自印地语/乌尔都语）农田；耕地。“khet”的复数形式。"},"examples":[{"en":"The farmers walked out to their khets early in the morning to water the crops.","zh":"农民一大早就走到自家的田里给庄稼浇水。"},{"en":"After the monsoon, the khets turned green with new rice plants.","zh":"季风雨过后，稻秧让田地变得一片翠绿。"}]}],"synonyms":["fields","farmland","cropland","paddies"],"phonetic":"/keɪts/","extraExplanation":["“khet”在印地语/乌尔都语里常指“耕地、田地”。英语里写作 khet / khets 多见于谈论南亚农村、农业或民俗的语境，并不算常见的标准英语词汇。","拼写里的“kh-”常用来表示南亚语言中的送气音（类似更用力的 k）。不同地区转写和读音会有差异：有人在英语里读得更接近“ket/keit”。"]}
{"word":"khevzur","summary":{"en":"Khevzur refers to a person from the Khevsur Georgian highland group, or something related to their culture.","zh":"Khevzur 指赫夫苏尔人（格鲁吉亚高地族群成员），也可指与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Khevsur people, a Georgian highland ethnic group from the Khevsureti region in the Caucasus Mountains (northeastern Georgia)","zh":"赫夫苏尔人（Khevsur）：格鲁吉亚高地民族之一，主要来自高加索山区格鲁吉亚东北部的赫夫苏列季（Khevsureti）地区"},"examples":[{"en":"The museum exhibit included traditional clothing worn by a Khevzur.","zh":"博物馆展览里有赫夫苏尔人穿的传统服饰。"},{"en":"A Khevzur guide explained local customs to the hikers.","zh":"一位赫夫苏尔向导向徒步者讲解了当地习俗。"}]},{"partOfSpeech":"adj.","definition":{"en":"of or relating to the Khevsur people or their culture","zh":"赫夫苏尔人的；与赫夫苏尔文化有关的"},"examples":[{"en":"They studied Khevzur folk songs and mountain rituals.","zh":"他们研究赫夫苏尔民歌和山地仪式。"},{"en":"The writer described a Khevzur village in the highlands.","zh":"作家描写了高地上的一个赫夫苏尔村庄。"}]}],"synonyms":["Khevsur"],"phonetic":"/ˈkɛv.zʊr/","extraExplanation":["“Khevzur”也常见拼写为“Khevsur”，指居住在格鲁吉亚东北部高山地区的族群（地区名为Khevsureti）。在英语里更常把它当作族名/族群成员来用。","在旅行与人类学语境中，你可能会看到与他们的山地生活、传统服饰、民歌与地方习俗相关的描述。"]}
{"word":"khi","summary":{"en":"“khi” is not a common English word; it’s usually Vietnamese for “when/while” or a context-specific acronym.","zh":"“khi” 不是常见英语词；通常是越南语“当……的时候/在……期间”，或特定语境下的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “khi” is most often seen as (1) a Vietnamese word meaning “when/while,” or (2) an abbreviation/initialism in specific fields (meaning depends on context).","zh":"不是标准英语单词。“khi”最常见于：(1) 越南语，意思是“当……的时候/在……期间”；或 (2) 某些领域的缩写（具体含义取决于上下文）。"},"examples":[{"en":"Vietnamese: “Khi tôi đến, trời đã tối.” (“When I arrived, it was already dark.”)","zh":"越南语：“Khi tôi đến, trời đã tối.”（“当我到的时候，天已经黑了。”）"},{"en":"If you saw “KHI” in a document, share the sentence—it may be an acronym with a special meaning.","zh":"如果你在文章里看到 “KHI”，把完整句子发我，它可能是某个缩写/首字母词，有特定含义。"}]}],"extraExplanation":["在英语学习场景里，如果你是想查一个英文单词，请确认拼写：是不是想输入 “key”（钥匙/关键）、“kid”（孩子）、“khaki”（卡其色）或其他相近词？\n也可能是你看到人名/地名（例如 Khi 作为姓或地名的一部分）。给我上下文（句子、领域、图片）我就能准确解释。"]}
{"word":"khidmatgar","summary":{"en":"Khidmatgar means a servant/attendant, especially in South Asian or colonial-era contexts.","zh":"Khidmatgar 指“仆人/侍从”，多见于南亚或殖民时期语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a servant or attendant; someone who provides personal service (used in South Asian contexts, from Urdu/Persian influence).","zh":"仆人；侍从；提供个人服务的人（多用于南亚语境，受乌尔都语/波斯语影响）。"},"examples":[{"en":"In the old household, a khidmatgar brought tea to guests in the drawing room.","zh":"在旧式大家庭里，khidmatgar 会在客厅给客人端茶。"},{"en":"The hotel hired a khidmatgar to assist elderly visitors with their bags.","zh":"酒店雇了一名 khidmatgar 帮助年长住客提行李。"}]}],"synonyms":["servant","attendant","household help","valet","porter"],"phonetic":"/kɪdˈmʌt ɡɑr/","extraExplanation":["这个词常见于英属印度时期及其相关的英语书写（尤其是描写殖民时期家庭、军营或旅馆的作品）里，用来指“家仆/勤务员”。在当代英语中不算常用，更常用的说法是 servant、attendant、household help、porter（按具体工作而定）。","词源上可拆理解为“khidmat（服务）+ gar（做……的人）”，因此字面就是“提供服务的人”。在历史语境里可能带有阶层与殖民色彩，使用时注意场合与语气，避免不必要的冒犯。"]}
{"word":"khidmutgar","summary":{"en":"Khidmutgar means a domestic servant or attendant, mainly seen in South Asian or colonial-era contexts.","zh":"Khidmutgar 指家仆或侍从，多见于南亚或殖民时期相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a domestic servant or attendant (especially in South Asia, or in older/colonial-era English writing about India)","zh":"（尤指南亚或旧时/殖民时期英语文本中）家仆；侍从；服务员（多指男性）"},"examples":[{"en":"In the old novel, a khidmutgar brings tea to the guests.","zh":"在那本旧小说里，一位 khidmutgar 把茶端给客人。"},{"en":"The traveler wrote that his khidmutgar helped arrange the luggage and meals.","zh":"那位旅行者写道，他的 khidmutgar 帮忙打点行李和餐食。"}]}],"synonyms":["servant","attendant","waiter (context-dependent)","house servant"],"phonetic":"/ˈkɪd.mət.ɡɑːr/","extraExplanation":["这个词来自南亚语言（常见解释为源自乌尔都语/印地语 khidmat“服务”相关词），在19–20世纪描写英属印度的英语作品与旅行记中较常见。现代英语日常对话里很少用到。","在当代语境中，如果你想用更中性/常见的英语表达，可根据具体工作用 waiter（服务员）、attendant（侍者/工作人员）、housekeeper（管家/家务管理者）、domestic worker（家政人员）等替代。使用 khidmutgar 时要注意它带有历史与阶层色彩。"]}
{"word":"khila","summary":{"en":"Khila is usually a South Asian personal name; it’s linked to a word meaning “to bloom/blossom.” In English, it’s not a standard common vocabulary word, so meaning depends on context.","zh":"Khila 通常是南亚人名，常与“开花/绽放”的词源相关。在英语中它不是常见标准词汇，具体含义需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun; from South Asian languages) a personal name, often understood as “bloomed / blossomed,” related to Hindi/Urdu khilnā (“to bloom, to open (like a flower)”).","zh":"（专有名词；源自南亚语言）人名，常被理解为“绽放/盛开”，与印地语/乌尔都语 khilnā（“开花、绽开”）有关。"},"examples":[{"en":"Khila is a popular name in some South Asian communities.","zh":"Khila 是一些南亚社群中会使用的名字。"},{"en":"Her parents chose the name Khila to suggest a life that would “blossom.”","zh":"她的父母取名 Khila，是希望她的人生能“绽放”。"}]},{"partOfSpeech":"other","definition":{"en":"(In English writing) a romanized spelling/transliteration that may represent different words across languages, so the exact meaning depends on the person’s language and context.","zh":"（在英语书写中）一种罗马字母拼写/音译形式，可能对应不同语言里的不同词，因此具体含义取决于使用者的语言与语境。"},"examples":[{"en":"I saw “khila” in a chat—what language is it from?","zh":"我在聊天里看到“khila”——它来自哪种语言？"},{"en":"In some languages, “khila” can be a verb form meaning “bloomed,” but it isn’t a standard English word.","zh":"在一些语言里，“khila”可能是表示“开了花/盛开了”的动词形式，但它不是标准英语词。"}]}],"synonyms":["(as a meaning) blossom","bloom"],"phonetic":"/ˈkiːlə/","extraExplanation":["“kh”常用于音译南亚语言中的送气音/kʰ/，英语里没有完全对应的音，所以有人会把 Khila 念成“KEE-luh”或更接近原音的“khi-LAH”。","如果你告诉我：你看到它的句子、来自哪种语言/地区（例如 Hindi/Urdu/Bengali 等），我可以把它在该语言里的具体词性和含义解释得更准确。"]}
{"word":"khilat","summary":{"en":"A khilat is a ceremonial robe (or set of clothes) given by a ruler as an honor or sign of appointment.","zh":"Khilat 指统治者赐予的礼袍或成套衣物，用来表示恩宠、嘉奖或任命。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an honorific robe or set of garments given by a ruler or high official as a mark of favor, recognition, or appointment (common in South Asian and Islamic courts)","zh":"（南亚与伊斯兰宫廷中常见的）荣誉礼袍／赐衣；统治者或高官赐予他人的衣袍或成套服饰，用以表示恩宠、嘉奖或任命"},"examples":[{"en":"The governor presented a khilat to the poet for his service at court.","zh":"总督向这位诗人赐予一套khilat，以表彰他在宫廷中的贡献。"},{"en":"Receiving a khilat signaled the official’s new rank.","zh":"获得khilat象征这位官员得到新的品级与身份。"}]}],"synonyms":["robe of honor","ceremonial robe","honorific garment"],"phonetic":"/kɪˈlɑːt/","extraExplanation":["“Khilat”多见于历史、民族志与殖民时期文献，指一种带有政治与礼仪意义的“赐衣”制度：通过赠予衣袍（有时还包括头巾、腰带、首饰等），公开确认受赠者的地位、忠诚或职位。","词源常追溯到波斯语/乌尔都语使用传统；在莫卧儿帝国以及后来的地区政权中很常见。英语语境里通常保留外来词拼写，用于描述特定历史文化现象。"]}
{"word":"khilioi","summary":{"en":"Khilioi is a Greek-form word used in academic/Biblical contexts meaning “thousands” (the plural of “a thousand”).","zh":"Khilioi 是希腊语形式的词，常用于学术/《圣经》语境，表示“成千的/几千”（“一千”的复数）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Greek, used in scholarly or Biblical contexts) “thousands” or “a thousand” (plural form).","zh":"（希腊语词，常见于学术或《圣经》语境）“几千/成千的；一千（的复数形式）”。"},"examples":[{"en":"In the Greek text, **khilioi** means “thousands.”","zh":"在希腊语原文里，**khilioi** 的意思是“成千的/几千”。"},{"en":"Some commentaries translate **khilioi** as “a thousand,” depending on context.","zh":"一些注释书会根据上下文把 **khilioi** 译作“一千”。"}]}],"synonyms":["thousands","a thousand (context-dependent)"],"phonetic":"/ˈkɪliɔɪ/","extraExplanation":["**khilioi** 通常对应希腊语 **χίλιοι**（转写也常见 *chilioi*），字面意思是“千（复数）”。","它常出现在神学、古典学、语言学等讨论希腊语文本的场合，而不是现代英语的日常用词。","英语中常见相关词根 **chili-**（如 *chiliad* “一千年/一千个的一组”），以及科学计量前缀 **kilo-**（“千”），都与这个“千”的概念有关。"]}
{"word":"khir","summary":{"en":"“Khir” is usually a variant spelling of either the South Asian dessert kheer (milk pudding) or the Arabic/Urdu word khair (“goodness; well-being”), depending on context.","zh":"“khir”多半是变体拼写：要么指南亚甜点 kheer（奶布丁/米布丁），要么指阿拉伯语/乌尔都语 khair（善、安好），具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) A milk-based dessert similar to rice pudding; commonly spelled kheer.","zh":"（南亚英语）一种牛奶甜点，类似米布丁；更常见的拼写是 kheer。"},"examples":[{"en":"For dessert, we had khir with cardamom and almonds.","zh":"甜点我们吃了加豆蔻和杏仁的 khir（奶布丁）。"},{"en":"My neighbor taught me how to make khir during Diwali.","zh":"排灯节期间，邻居教我怎么做 khir。"}]},{"partOfSpeech":"other","definition":{"en":"A nonstandard/romanized spelling seen in some Arabic/Urdu contexts, often intended as khair, meaning “goodness; well-being.”","zh":"一种不规范的拉丁字母转写，在阿拉伯语/乌尔都语语境中常用来指 khair，意为“善、好事、安好/平安”。"},"examples":[{"en":"He texted, “All khir?” meaning “Is everything okay?”","zh":"他发短信说“All khir?”意思是“都还好吗？”"},{"en":"They said, “Inshallah, khir,” hoping for good news.","zh":"他们说“Inshallah, khir”，希望有好消息/好结果。"}]}],"synonyms":["kheer","rice pudding","milk pudding","khair","goodness","well-being"],"phonetic":"/kɪr/","extraExplanation":["“khir”本身不是标准英语单词，常见于把南亚或阿拉伯语词汇用拉丁字母拼出来的写法，因此在英文材料里可能出现多种拼写（khir/kheer；khir/khair）。","如果你是在菜单里看到，多半指甜点 kheer/khir；如果你是在聊天或宗教/问候语境里看到，多半是 khair（善、安好）的意思。你也可以告诉我你看到它的句子，我可以帮你判断是哪一种。"]}
{"word":"khirka","summary":{"en":"Khirka is a Sufi cloak/robe, often symbolizing initiation or affiliation with a spiritual lineage.","zh":"Khirka 指苏菲派的披风/长袍，常象征入门或与某一精神传承的归属关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Sufi cloak or patched robe, often given by a spiritual teacher as a sign of initiation, blessing, or connection to a Sufi lineage","zh":"（苏菲派的）披风/补丁长袍；常由导师授予，象征入门、祝福或与某一苏菲传承的联系"},"examples":[{"en":"The teacher placed a khirka on the student to mark his initiation into the order.","zh":"导师把一件khirka披在学生身上，以标志他加入该教团的入门仪式。"},{"en":"In the story, the traveler’s khirka shows he belongs to a Sufi lineage.","zh":"在故事里，旅人的khirka表明他属于某个苏菲传承。"}]},{"partOfSpeech":"n.","definition":{"en":"a loose outer garment or cloak (a broader, less common use in English, based on the same Middle Eastern term)","zh":"宽松外衣/斗篷（在英语中较少见的引申用法，源自同一中东方言/阿语词）"},"examples":[{"en":"He wore a simple khirka over his clothes to stay warm at night.","zh":"夜里他在衣服外披了一件简单的khirka保暖。"}]}],"synonyms":["cloak","robe","mantle","khirqa"],"phonetic":"/ˈkɪrkə/","extraExplanation":["“khirka”常见的学术转写也写作“khirqa / khirqa(h)”（源自阿拉伯语 خِرْقَة‎），在苏菲传统中不只是衣物，也是一种象征性的“传承标记”：表示师徒关系、精神许可（ijazah）或加入特定修行团体（ṭarīqa）。","很多文本会强调“补丁袍”这一形象：象征朴素、苦修与对物质欲望的克制。在英语里它多出现在宗教研究、历史或文学译作中。"]}
{"word":"khirkah","summary":{"en":"A khirkah is a Sufi cloak/robe, often patched, symbolizing initiation or spiritual lineage.","zh":"khirkah指苏菲派的披风/长袍（常为补丁袍），象征入门或灵性传承。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Sufi cloak or robe (often a patched garment) symbolizing spiritual initiation, belonging, or the transmission of a teacher’s blessing in Islamic mysticism","zh":"（苏菲派的）披风/长袍（常为补丁袍），象征灵性入门、归属，或师徒间祝福与传承"},"examples":[{"en":"After the ceremony, the sheikh placed a khirkah on the new disciple’s shoulders.","zh":"仪式结束后，谢赫把一件khirkah披在新弟子的肩上。"},{"en":"In the story, the wanderer’s khirkah is patched and worn from years of travel.","zh":"故事里，那位漂泊者的khirkah满是补丁，因多年旅途而磨旧。"}]}],"synonyms":["Sufi cloak","dervish cloak","patched robe","patched cloak"],"phonetic":"/ˈkɪr.kə/","extraExplanation":["khirkah（也常拼作khirqa/khirqah）来自阿拉伯语 خِرْقَة（khirqa），本义与“布片、破布”相关，因此常指“补丁袍”。在苏菲传统中，授予khirkah可是一种象征性的“传衣”仪式：表示弟子被纳入修行谱系（silsila），或接受导师的许可与加持。","在英文人文、宗教研究写作中，你也可能看到“patched cloak/robe（补丁披风/袍子）”作为解释性翻译；在文学语境里，它常被用来暗示清贫、谦卑、漫游修行或神秘主义者的身份。"]}
{"word":"khirkahs","summary":{"en":"Khirkahs are Sufi cloaks/robes, often symbolizing initiation or membership in a Sufi order.","zh":"Khirkahs 指苏菲派的斗篷/长袍，常象征入门或教团归属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rough cloak or robe worn by Sufis (Islamic mystics), often given by a spiritual teacher as a sign of initiation or belonging to a Sufi order","zh":"（苏菲派伊斯兰神秘主义者穿的）粗布斗篷/长袍；也常由导师授予，作为入门或归属某一苏菲教团的象征"},"examples":[{"en":"The dervish wore a simple khirkah during the ceremony.","zh":"那位苦行僧在仪式上穿着一件朴素的 khirkah（苏菲斗篷）。"},{"en":"After years of study, he received a khirkah from his teacher as a sign of acceptance.","zh":"经过多年的学习，他从导师那里得到一件 khirkah，作为被接纳的标志。"}]}],"synonyms":["Sufi cloak","robe","dervish cloak","khirqa"],"phonetic":"/ˈkɪr.kəz/","extraExplanation":["“khirkah”（也拼作 khirqa）来自阿拉伯语，在苏菲传统里不仅是衣物，也常被视为“传承/许可”的象征：导师为弟子披上或授予斗篷，表示精神道路上的承认与连接。","在英语文本中它多出现在宗教学、伊斯兰史、或波斯/中东文化相关的写作里；普通日常英语中较少见。"]}
{"word":"khis","summary":{"en":"“khis” isn’t standard English; it’s likely a typo for “this” or “kiss.”","zh":"“khis”不是标准英语词，更可能是把“this”或“kiss”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of “this” or “kiss,” depending on context.","zh":"不是标准英语单词；更可能是把 “this（这/这个）” 或 “kiss（亲吻）” 拼错了，具体取决于语境。"},"examples":[{"en":"Did you mean “this”? Example: This is my book.","zh":"你是不是想写 “this”？例句：This is my book.（这是我的书。）"},{"en":"Did you mean “kiss”? Example: He gave her a kiss on the cheek.","zh":"你是不是想写 “kiss”？例句：He gave her a kiss on the cheek.（他亲了她的脸颊。）"}]}],"phonetic":"/kɪs/","extraExplanation":["“khis”在常见英语词典里一般查不到。如果你能把它放进一句话里（或告诉我你想表达的中文意思），我可以更准确判断你要的词。","如果你是打字时把 t 误按成 k，那么 “khis” 很可能就是 “this”。如果你想表达“亲一下”，则更可能是 “kiss”。"]}
{"word":"khitan","summary":{"en":"Khitan refers to an ancient northeastern Asian people (founders of the Liao Dynasty), their extinct language, or anything related to them.","zh":"Khitan 指古代东北亚的契丹民族（辽朝的建立者）、其已灭绝的语言，或与契丹相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a nomadic people from northeastern Asia who established the Liao Dynasty (907–1125) in parts of what is now northern China and Mongolia","zh":"契丹人：来自东北亚的游牧民族成员，曾在今中国北方及蒙古一带建立辽朝（907–1125）"},"examples":[{"en":"The Khitan played a major role in the history of northern China during the Liao Dynasty.","zh":"契丹人在辽朝时期对中国北方历史产生了重要影响。"},{"en":"Many place names and records from the Liao period mention the Khitan.","zh":"辽代的许多地名和史料都提到契丹人。"}]},{"partOfSpeech":"n.","definition":{"en":"the now-extinct language spoken by the Khitan people","zh":"契丹语：契丹人使用、现已灭绝的语言"},"examples":[{"en":"Scholars still study Khitan through inscriptions and surviving texts.","zh":"学者仍通过碑铭与遗存文献研究契丹语。"},{"en":"Some Khitan writing remains difficult to fully decode.","zh":"部分契丹文字至今仍难以完全破译。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Khitan people, their culture, or their language","zh":"契丹的：与契丹人、其文化或语言相关的"},"examples":[{"en":"A museum exhibit displayed Khitan art and clothing.","zh":"博物馆展出了契丹风格的艺术品与服饰。"},{"en":"The book includes a chapter on Khitan history.","zh":"这本书包含一章关于契丹历史的内容。"}]}],"synonyms":["Khitai","Cathay (historical)"],"phonetic":"/ˈkiːtən/","extraExplanation":["“Khitan/契丹”在中世纪对外交流中影响很大：欧洲人曾用“Cathay（契丹）”指代中国（尤其是北方地区），这个词源与“Khitan”有关，因此你可能在古地图、旅行记或文学作品里看到“Cathay”。","契丹建立的辽朝与宋、西夏等政权并存，相关历史常见于“Liao Dynasty（辽朝）”“Kara-Khitai/Western Liao（西辽）”等条目。"]}
{"word":"khitmatgar","summary":{"en":"A South Asian term meaning “servant/attendant,” often seen in historical or regional contexts.","zh":"南亚语境中的词，意为“仆人/侍者”，多见于历史或地域性用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English/Urdu/Hindi) A servant; an attendant or household helper.","zh":"（南亚英语/乌尔都语/印地语）仆人；侍者；家务帮工。"},"examples":[{"en":"The family hired a khitmatgar to help with cooking and cleaning.","zh":"这家人雇了一位 khitmatgar 来帮忙做饭和打扫。"},{"en":"In some old novels set in British India, a khitmatgar may serve tea to guests.","zh":"在一些以英属印度为背景的老小说里，khitmatgar 可能会给客人端茶。"}]}],"synonyms":["servant","attendant","household helper","domestic worker"],"phonetic":"/ˈkɪtmətˌɡɑr/","extraExplanation":["这个词常见于乌尔都语（khidmatgār/خدمتگار）以及相关的南亚语境中，字面含义与“服务、侍奉（khidmat）”有关。","在现代英语里它并不常用，多见于历史叙述、殖民时期背景作品或南亚英语交流中；日常表达通常会用 servant、helper、attendant 等更通用的词。","拼写在拉丁字母转写时可能有变体（如 khidmatgar / khitmatgar），读写会因地区与转写习惯不同而略有差异。"]}
{"word":"khitmutgar","summary":{"en":"A South Asian term (often seen in older writing) meaning a servant or attendant.","zh":"南亚用语（多见于较旧的英文描写），指“仆人/侍从”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, formal or old-fashioned) a servant; an attendant who does helpful duties in a household or for a person.","zh":"（南亚用语，较正式或较旧）仆人；侍从；为家庭或个人提供服务的人。"},"examples":[{"en":"The old novels describe a khitmutgar bringing tea to the guests.","zh":"老小说里常写到有位 khitmutgar 给客人端茶。"},{"en":"He worked as a khitmutgar in a British-era household.","zh":"他在英属时期的一户人家里当过 khitmutgar（佣人）。"}]}],"synonyms":["servant","attendant","household help","domestic worker"],"phonetic":"/ˈkɪt.mət.ɡɑr/","extraExplanation":["“khitmutgar”（也常拼作 *khidmatgar*）来自印地语/乌尔都语等南亚语言，和“服务、侍奉”（*khidmat*）有关。常见于印度/巴基斯坦语境或描写殖民时期、旧式大户人家的英文作品中。","在现代日常英语里不算常用；如果你只是想表达“佣人/服务员”，更常见的中性说法是 *servant*, *household help*, *attendant*。使用该词时注意语境与尊重，避免带有贬义或刻板印象。"]}
{"word":"khivan","summary":{"en":"Khivan means “of/from Khiva” (a historic city in Uzbekistan) and can also mean a person from Khiva.","zh":"Khivan表示“希瓦的/来自希瓦的”，也可指“希瓦人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Khiva, a historic city in present-day Uzbekistan (or to the former Khanate of Khiva).","zh":"与希瓦（今乌兹别克斯坦的一座历史名城，或昔日“希瓦汗国”）有关的；希瓦的。"},"examples":[{"en":"The museum displays Khivan carpets and ceramics from Central Asia.","zh":"这座博物馆展出了来自中亚的希瓦地毯和陶器。"},{"en":"She studies Khivan architecture, especially the old walls and madrasas.","zh":"她研究希瓦的建筑，尤其是古城墙和宗教学校。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Khiva.","zh":"希瓦人；来自希瓦的人。"},"examples":[{"en":"A Khivan told us stories about life inside the old city.","zh":"一位希瓦人给我们讲了在古城里生活的故事。"}]}],"synonyms":["of Khiva","from Khiva"],"phonetic":"ˈkiːvən","extraExplanation":["“Khivan”是地名Khiva（常译“希瓦”）的形容词/名词形式，在历史、旅行写作或中亚研究中较常见。","希瓦位于历史上的花剌子模（Khorezm）地区，老城Itchan Kala（希瓦内城）以保存完好的城墙、清真寺与宣礼塔闻名，也常出现在丝绸之路相关语境中。"]}
{"word":"khlysti","summary":{"en":"Khlysti: a historical Russian mystical Christian sect; “a Khlysti” means a member of that sect.","zh":"Khlysti：历史上的俄罗斯神秘主义基督教教派；“a Khlysti”指该教派的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Khlysty (also spelled Khlysti), a mystical Russian Christian sect known historically for intense, ecstatic religious rituals","zh":"“鞭派”（Khlysty/Khlysti）成员：一种历史上的俄罗斯神秘主义基督教教派，以强烈、恍惚式的宗教仪式而闻名"},"examples":[{"en":"In some histories of Imperial Russia, the Khlysti are mentioned as a secretive religious sect.","zh":"在一些关于俄国沙皇时期的历史著作中，会提到 Khlysti 是一个隐秘的宗教教派。"},{"en":"The novel briefly refers to the Khlysti to show how diverse religious life was in nineteenth-century Russia.","zh":"小说中简要提到 Khlysti，用来表现19世纪俄罗斯宗教生活的多样性。"}]}],"synonyms":["Khlysty","Khlysts","Russian mystical sect"],"phonetic":"/ˈklɪsti/","extraExplanation":["“Khlysti/Khlysty”源自俄语复数形式，英语里常用作复数（the Khlysti），也可当作单复同形使用。常见拼写有 Khlysti 与 Khlysty。","该词带有明显历史与宗教背景，许多记载来自外部观察者或官方文献，描述可能存在偏见；阅读相关资料时可对来源与语境保持敏感。","在英语写作中通常作为专有名词使用，首字母大写（Khlysti），多出现在历史、宗教学或俄罗斯文学研究语境中。"]}
{"word":"khmer","summary":{"en":"Khmer refers to the main ethnic group of Cambodia, the Khmer language, and things related to Cambodia and its culture.","zh":"Khmer 指柬埔寨的主体民族（高棉人）、高棉语，以及与柬埔寨及其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Cambodia, or an ethnic group that makes up the majority of Cambodia’s population","zh":"高棉人；柬埔寨人（柬埔寨的主体民族）"},"examples":[{"en":"Many Khmer people celebrate the Khmer New Year in April.","zh":"许多高棉人在四月庆祝高棉新年。"},{"en":"She is Khmer and grew up near Phnom Penh.","zh":"她是高棉人，在金边附近长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the main language of Cambodia","zh":"高棉语（柬埔寨的主要语言）"},"examples":[{"en":"I’m learning Khmer to talk with my neighbors.","zh":"我在学高棉语，好和邻居交流。"},{"en":"This sign is written in Khmer and English.","zh":"这个标牌用高棉语和英语写的。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Cambodia, its people, or its language","zh":"高棉的；柬埔寨的；与高棉人或高棉语相关的"},"examples":[{"en":"We tried Khmer food at a small restaurant.","zh":"我们在一家小餐馆尝了高棉菜。"},{"en":"He studies Khmer history and literature.","zh":"他研究高棉历史和文学。"}]}],"synonyms":["Cambodian","Khmer people","Khmer language"],"phonetic":"/kəˈmɛr/","extraExplanation":["“Khmer”常用来指柬埔寨的主体民族、他们的语言，以及与柬埔寨文化相关的事物。作形容词时，很多场合也会看到“Cambodian”（柬埔寨的），但谈到语言时通常用“Khmer language / the Khmer language”。","发音上，英语里常见读法接近“kuh-MAIR”（重音在后）。","涉及历史时可能会出现“Khmer Rouge”（红色高棉，20世纪的政治组织）。这是敏感且沉重的话题，日常交流中如需提及，语气应保持尊重与谨慎。"]}
{"word":"khodja","summary":{"en":"Khodja (also spelled Khoja) can mean a respectful title like “master/teacher,” or it can refer to a member of the Khoja community in South Asia.","zh":"Khodja（也拼作 Khoja）既可指“先生/老师”等尊称，也可指南亚的 Khoja 社群成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A title of respect in parts of the Middle East, Central Asia, and South Asia, meaning “master,” “sir,” or “teacher.”","zh":"（历史用语）在中东、中亚与南亚部分地区使用的尊称，意为“主人/先生/老师”。"},"examples":[{"en":"In old travel writing, a merchant might be addressed as a khodja to show respect.","zh":"在早期游记中，人们可能用 khodja 来尊称一位商人，以示敬意。"},{"en":"The students waited for the khodja to begin the lesson.","zh":"学生们等着 khodja 开始上课。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Khoja (also spelled Khodja) community, a South Asian Muslim group historically associated with Ismaili Islam (especially Nizari Ismailis).","zh":"Khoja（也拼作 Khodja）社群的成员：南亚穆斯林群体之一，历史上常与伊斯玛仪派（尤其尼查里伊斯玛仪派）相关。"},"examples":[{"en":"Her family identifies as Khoja, and many relatives live in East Africa and Canada.","zh":"她的家族认同为 Khoja，许多亲属居住在东非和加拿大。"},{"en":"The museum exhibit included photos from Khoja communities along the Indian Ocean.","zh":"博物馆展览包括印度洋沿岸 Khoja 社群的照片。"}]}],"synonyms":["Khoja","khwaja","hodja"],"phonetic":"/ˈkoʊdʒə/","extraExplanation":["“Khodja / Khoja”常被视为同一个词的不同转写方式（从波斯语/阿拉伯语等语言转写到拉丁字母时，拼法会变）。常见来源是波斯语/奥斯曼语中的“khwāja（意为主、先生）”。","在英语语境里：如果写作历史称号，通常不需要大写；如果指“Khoja 社群/族群/身份”，更常见的写法是大写“Khoja”，并作为专有名词使用。"]}
{"word":"khoja","summary":{"en":"Khoja is most commonly a noun for a member of the Khoja community (often Nizari Ismaili Shia). Less commonly, it can be an honorific meaning “master/sir.”","zh":"Khoja 常用作名词，指科贾社群成员（常与尼扎里派伊斯玛仪什叶派相关）；较少见时也可作敬称，意为“主人/先生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Khoja community—historically a South Asian Muslim group, many of whom today are Nizari Ismaili Shia (often associated with the Aga Khan).","zh":"“科贾（Khoja）”社群成员——历史上源自南亚的穆斯林群体；如今其中许多人属于尼扎里派伊斯玛仪（什叶派）传统（常与阿迦汗相关）。"},"examples":[{"en":"Many Khoja families in East Africa have roots in Gujarat and Sindh.","zh":"东非许多科贾家庭的祖源可追溯到古吉拉特和信德地区。"},{"en":"She studied Khoja history and migration in the Indian Ocean region.","zh":"她研究了科贾社群在印度洋地区的历史与迁徙。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a respectful title meaning “master” or “sir,” related to the Persian/Arabic word khwāja/khwaja.","zh":"（较少见）一种敬称，意为“主人 / 先生”，与波斯语/阿拉伯语 khwāja/khwaja 同源。"},"examples":[{"en":"In some older texts, khwaja/khoja is used as an honorific before a person’s name.","zh":"在一些较旧的文本中，khwaja/khoja 会作为敬称放在姓名前。"}]}],"synonyms":["Khwaja (variant spelling)"],"phonetic":"/ˈkoʊdʒə/","extraExplanation":["“Khoja”常见于历史、宗教研究与族群研究语境。不同地区与家族背景下，科贾社群的宗教归属可能不完全相同；在当代英语里最常指与尼扎里派伊斯玛仪传统相关的科贾人群。","拼写上常见变体有 Khoja / Khwaja / Khaja 等；在英文资料里也可能被当作姓氏或族群名称使用。"]}
{"word":"khojah","summary":{"en":"“Khojah/Khoja” most commonly refers to a member of the Khoja community; it can also be a historical respectful title meaning “master/teacher” or “merchant.”","zh":"“khojah/khoja”最常指科贾社群成员；也可作历史性敬称，意为“师傅/老师”或“商人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Khoja community, a South Asian Muslim group (especially in India and Pakistan), many of whom are historically associated with Ismaili Islam.","zh":"（Khoja）科贾族群成员：南亚（尤指印度、巴基斯坦）的穆斯林社群之一，历史上不少人与伊斯玛仪派（Ismaili）传统有关。"},"examples":[{"en":"Many Khojas in East Africa trace their family roots back to Gujarat.","zh":"东非的许多科贾人把家族根源追溯到古吉拉特邦。"},{"en":"The community center was founded by Khoja merchants who settled near the coast.","zh":"这个社区中心由在海岸附近定居的科贾商人创建。"}]},{"partOfSpeech":"n.","definition":{"en":"in some South Asian and Middle Eastern contexts, a respectful title meaning “master/teacher” or “merchant,” used historically for certain traders or community leaders.","zh":"在部分南亚和中东语境中，作敬称用法，意为“师傅/老师”或“商人”，历史上可用于某些商贾或社群领袖。"},"examples":[{"en":"In older texts, “Khoja” could be used as a title before a person’s name.","zh":"在较早的文本中，“Khoja”有时可作为头衔放在人名前面。"},{"en":"The record mentions a khoja who helped organize trade in the port city.","zh":"记录提到一位“khoja”协助组织港口城市的贸易。"}]}],"synonyms":["Khoja"],"phonetic":"/ˈkoʊdʒə/","extraExplanation":["“Khoja”（也常见拼写：Khoja；复数 Khojas）源自波斯语/阿拉伯语传统里的称谓，后来在南亚语境中逐渐发展为族群/社群名称。","在英语里它多作为专有名词使用（可大写 Khoja），指特定社群时建议尊重当事人的自我认同与宗教/文化多样性；不同地区的 Khoja 可能在宗派与习俗上并不完全相同。"]}
{"word":"khoka","summary":{"en":"Khoka usually means a small roadside kiosk or stall in South Asia.","zh":"Khoka通常指南亚地区的路边小摊/小亭子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, especially Indian/Pakistani English) A small roadside kiosk or stall, often selling snacks, tea, cigarettes, or small daily items.","zh":"（南亚用法，尤指印度/巴基斯坦英语）路边的小摊位或小亭子，常卖零食、茶、香烟或日用品。"},"examples":[{"en":"I bought chai at a khoka near the bus stop.","zh":"我在公交站附近的一个khoka买了奶茶。"},{"en":"There’s a khoka outside the office that sells samosas.","zh":"办公室外面有个khoka卖萨莫萨（三角炸饺）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) An empty shell or casing; something hollowed out.","zh":"（较少见）空壳；外壳；被掏空的东西。"},"examples":[{"en":"The fruit looked fine outside, but it was a hollow khoka inside.","zh":"水果外表看起来没问题，但里面却是空壳（khoka）。"}]}],"synonyms":["kiosk","stall","booth","stand"],"phonetic":"/ˈkoʊkə/","extraExplanation":["“khoka”更常见于南亚地区的日常英语或本地语言夹杂的英语语境中（如印度、巴基斯坦的城市街头）。在更标准的国际英语里，人们更常说“kiosk”“stall”“booth”来表达类似意思。","不同地区拼写可能出现“khokha / khoka”，含义也会受当地语言影响；如果你告诉我你看到这个词的国家/句子，我可以帮你确认最准确的意思。"]}
{"word":"khokani","summary":{"en":"“Khokani” is usually a proper name (not a common English word); its meaning depends on context and origin.","zh":"“Khokani”通常是专有名词（不是常见英文词）；具体含义取决于语境与来源。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word; most often seen as a proper name (e.g., a surname or place/ethnic identifier) in South Asian contexts, depending on spelling and source.","zh":"不是标准英文词条；最常见为专有名词（如姓氏、地名或族群/地域称呼），多见于南亚语境，具体含义取决于拼写与来源。"},"examples":[{"en":"My classmate’s last name is Khokani.","zh":"我同学的姓是 Khokani。"},{"en":"The document lists ‘Khokani’ as a family name.","zh":"文件中把 “Khokani” 列为一个姓氏。"}]}],"phonetic":"/koʊˈkɑːni/","extraExplanation":["“khokani”更像是音译/拼写变体，而不是英语词汇。不同拼法可能对应不同来源（例如姓氏、地名、语言或族群名称），含义会随地区与语言而变。","如果你能提供：①它出现的句子/语境，②是否是人名/地名，③你看到的原文拼写（大小写、是否有重音符号），我可以更准确地解释它的指代与常见用法。"]}
{"word":"khole","summary":{"en":"“K-hole” is slang for an intense dissociative state from a high dose of ketamine; it can also be used loosely to mean being mentally checked out.","zh":"“K-hole”是指大剂量氯胺酮引起的强烈解离状态；也可引申为精神不在线、发懵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A dissociated, trance-like state caused by a high dose of ketamine, where a person may feel detached from their body and surroundings and may be unable to move or communicate normally.","zh":"（俚语）因大剂量氯胺酮（K粉）引起的解离/恍惚状态，可能感到与身体和环境分离，并可能暂时难以行动或正常交流。"},"examples":[{"en":"He said he accidentally fell into a K-hole and couldn’t speak for a while.","zh":"他说自己不小心进入了K-hole，一段时间说不出话。"},{"en":"People online warn that a K-hole can be frightening and risky.","zh":"网上有人提醒说，K-hole 可能令人恐惧，而且有风险。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) A situation where someone is mentally “checked out,” confused, or unresponsive, compared to the drug effect.","zh":"（引申）形容某人像“断线”一样神游、迷糊或反应迟钝（类比药物效果）。"},"examples":[{"en":"After the all-night flight, I was in a total K-hole at the meeting.","zh":"通宵飞行后，我在会议上完全神游了。"},{"en":"Sorry—I spaced out for a second, not a K-hole, just tired.","zh":"抱歉——我刚才走神了一下，不是K-hole，只是太累了。"}]}],"synonyms":["dissociative state","ketamine blackout (informal)","spaced-out state (figurative)"],"phonetic":"/ˈkeɪ hoʊl/","extraExplanation":["“K-hole”更常见的拼写是带连字符的 **K-hole**（K 来自 ketamine 的首字母）。你写的 **khole** 多半是非正式拼写或打字省略。","这个词强烈关联药物语境；在日常交流中使用可能显得突兀或不合适。若你是在学术/医疗/新闻语境中遇到，建议使用更中性的表达，如 “ketamine-induced dissociation（氯胺酮导致的解离状态）”。","健康与安全提醒：现实中高剂量或不明来源的物质可能带来严重风险；若遇到疑似药物中毒或意识异常，应尽快联系当地急救服务。"]}
{"word":"kholia","summary":{"en":"“Kholia” is usually a name, not a standard English vocabulary word.","zh":"“kholia”通常是人名/姓氏，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; most commonly seen as a personal or family name (surname) in South Asia (e.g., India/Pakistan) or as a transliteration from a local language.","zh":"不是主流英语词典中的标准英语词；最常见的用法是作为人名/姓氏（常见于南亚，如印度/巴基斯坦），或作为当地语言的拉丁字母转写。"},"examples":[{"en":"Kholia is my last name.","zh":"Kholia 是我的姓。"},{"en":"I met Ms. Kholia at the conference.","zh":"我在会议上认识了 Kholia 女士。"}]}],"phonetic":"/ˈkoʊliə/","extraExplanation":["“Kholia”也可能是南亚语言的转写（例如印地语/乌尔都语里与“打开”有关的词形），但仅凭这个拼写无法确定准确含义与词性。","如果你能提供一句包含 kholia 的原句、它出现的国家/语言环境，或想表达的意思，我可以更精确地给出对应的英文词或翻译。"]}
{"word":"khond","summary":{"en":"Khond (also spelled Kondh) refers to an Indigenous people of eastern/central India, and it can also refer to their language(s).","zh":"Khond（亦作 Kondh）指印度东部/中部的一个原住民族群，也可指其语言（或语言群）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous (Adivasi) community in eastern and central India, especially in Odisha and nearby states; also spelled Kondh.","zh":"印度东部与中部（尤以奥迪沙邦及周边地区）的一个原住民（阿迪瓦西）族群成员；也常拼作 Kondh。"},"examples":[{"en":"She is Khond (Kondh) and grew up in the hills of Odisha.","zh":"她是 Khond（Kondh）族，成长于奥迪沙邦的山区。"},{"en":"The museum has an exhibit on Khond weaving traditions.","zh":"博物馆有一个关于 Khond 族织造传统的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Dravidian language spoken by some Khond (Kondh) communities.","zh":"Khond（Kondh）族部分社群使用的达罗毗荼语系语言（统称为孔德语/孔德诸语言）。"},"examples":[{"en":"He can speak Khond at home and Odia at school.","zh":"他在家说 Khond 语，在学校说奥里亚语。"}]}],"synonyms":["Kondh"],"phonetic":"/kɑnd/","extraExplanation":["“Khond”是英语中较早见到的一种拼写，常见于殖民时期文献；如今在学术与官方语境里更常用“Kondh”。在写作或报道中，优先采用当事社群与当地机构更常使用的拼写通常更尊重。","该词多作为专有名词使用：写作时通常首字母大写（Khond/Kondh）。"]}
{"word":"khorassan","summary":{"en":"Khorassan (more often spelled Khorasan) is a historic region centered in northeastern Iran and a modern Iranian provincial name.","zh":"Khorassan（更常拼作 Khorasan）指以伊朗东北为核心的历史地区，也可指伊朗现代的呼罗珊各省。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A historic region in northeastern Iran and nearby areas (parts of modern Iran, Afghanistan, Turkmenistan, and Uzbekistan), famous in Persian history and culture.","zh":"（专有名词）呼罗珊：伊朗东北部及周边一带的历史地区（大致涵盖今伊朗、阿富汗、土库曼斯坦、乌兹别克斯坦的部分地区），在波斯历史与文化中很重要。"},"examples":[{"en":"Khorassan was a major cultural center during several Persian dynasties.","zh":"呼罗珊在多个波斯王朝时期是重要的文化中心。"},{"en":"The traveler crossed into Khorassan on the way to Herat.","zh":"旅人前往赫拉特的路上进入了呼罗珊地区。"}]},{"partOfSpeech":"n.","definition":{"en":"A modern Iranian province name often written as Khorasan (now divided into North, Razavi, and South Khorasan).","zh":"呼罗珊（常拼作 Khorasan）：伊朗现代的省名用法（现已分为北呼罗珊、省会马什哈德所在的拉扎维呼罗珊、以及南呼罗珊）。"},"examples":[{"en":"Mashhad is in Razavi Khorasan Province.","zh":"马什哈德在拉扎维呼罗珊省。"},{"en":"He is doing fieldwork in South Khorasan.","zh":"他正在南呼罗珊做田野调查。"}]}],"synonyms":["Khorasan","Greater Khorasan","Khurasan"],"phonetic":"/ˌkɔrəˈsɑn/","extraExplanation":["“Khorassan”更常见的拼写是“Khorasan”。不同拼写来自把波斯语/阿拉伯语地名转写成拉丁字母时的差异；在学术写作中两者都可能出现。","呼罗珊在英语语境里常带有“历史上的大呼罗珊（Greater Khorasan）”的文化与地理含义；而在新闻或旅游语境里，更多指伊朗的现代行政区（Khorasan 各省）。","呼罗珊也常与当地特产联系在一起，例如“Khorasan saffron（呼罗珊藏红花）”，在烹饪与贸易语境中很常见。"]}
{"word":"khorde","summary":{"en":"“Khorde” isn’t standard English; it’s likely a misspelling of “chord” or “horde.”","zh":"“khorde”不是标准英语，可能是“chord”或“horde”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most often a misspelling of “chord” (music) or “horde” (a large crowd).","zh":"不是标准英语单词；最常见是把“chord（和弦/弦）”或“horde（一大群人）”拼错了。"},"examples":[{"en":"I couldn’t find “khorde” in the dictionary—did you mean “chord” or “horde”?","zh":"我在词典里找不到“khorde”——你是想写“chord”还是“horde”？"}]}],"synonyms":["chord","horde"],"phonetic":"/kɔrd/","extraExplanation":["“chord”常见于音乐语境（a C chord=C和弦）；也可指弦（the vocal chords=声带，注意拼写是chords）。\n“horde”指“一大群人/动物”，常见搭配：a horde of tourists（一大群游客）。\n如果你告诉我你看到“khorde”的句子或领域（音乐/游戏/人名/地名），我可以帮你确定准确拼写和含义。"]}
{"word":"khot","summary":{"en":"“khot” is not a standard English word; it’s usually a name or a transliteration, or possibly a typo for a similar word.","zh":"“khot”不是标准英语词；通常是人名/转写形式，或可能是相近单词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard word in English; most often seen as a proper name (a surname) or as a romanized spelling from other languages rather than an English vocabulary word.","zh":"不是标准英语词汇；最常见于专有名词（如姓氏），或作为其他语言的拉丁字母转写，而非英语常用词。"},"examples":[{"en":"I couldn’t find “khot” in a standard English dictionary—was it a name or a typo?","zh":"我在标准英语词典里找不到“khot”——它是名字还是拼写错误？"},{"en":"Khot is sometimes used as a family name in English-language writing.","zh":"在英文写作中，Khot 有时用作姓氏。"}]}],"synonyms":["(no standard synonyms in English; depends on intended word)"],"phonetic":"/koʊt/","extraExplanation":["“khot”在英语里通常不作为普通词使用，所以很难给出固定、通用的词义。你可以告诉我它出现的句子或语境（例如聊天、歌词、小说、地名/人名），我就能更准确判断。","常见可能性：1）拼写误差：你是否想写 knot（结）、coat（外套）或 hot（热的）等？2）人名/姓氏：Khot。3）外来语转写：在某些南亚/东南亚语言的拉丁转写中可能出现，但意义取决于具体语言。"]}
{"word":"khotan","summary":{"en":"Khotan is the traditional English name for Hotan, a Silk Road oasis city and the ancient kingdom centered there.","zh":"Khotan 是和田（Hotan）的传统英文写法，指丝绸之路上的绿洲城市及以此为中心的古代王国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic oasis city on the southern edge of the Taklamakan Desert (in today’s Xinjiang, China), famous for its role on the Silk Road.","zh":"历史上的绿洲城市，位于塔克拉玛干沙漠南缘（今中国新疆），以丝绸之路重镇而闻名。"},"examples":[{"en":"Merchants traveling the Silk Road often stopped in Khotan to rest and trade.","zh":"丝绸之路上的商旅常在和田（Khotan）停留休整并进行贸易。"},{"en":"Khotan was known for producing fine jade and silk.","zh":"和田（Khotan）以出产优质玉石和丝绸闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"An ancient kingdom centered on the oasis of Khotan, influential in Silk Road culture and the spread of Buddhism in Central Asia.","zh":"以和田绿洲为中心的古代王国，对丝绸之路文化交流及佛教在中亚传播具有影响。"},"examples":[{"en":"Historical records describe Khotan as a Buddhist kingdom with active translation and learning.","zh":"史料记载和田（Khotan）曾是佛教王国，翻译与学术活动兴盛。"},{"en":"Archaeologists study manuscripts from Khotan to understand Silk Road languages and religion.","zh":"考古学家研究出土的和田（Khotan）文书，以了解丝绸之路的语言与宗教。"}]}],"synonyms":["Hotan","Hetian"],"phonetic":"/koʊˈtɑːn/","extraExplanation":["“Khotan”是英语中对“和田”的传统转写；现代英文更常见拼写是 **Hotan**（按普通话拼音而来）。","和田在历史上以“和田玉”闻名，也因为位于丝绸之路南道而成为商贸与文化交流的重要节点。"]}
{"word":"khotana","summary":{"en":"Khotana refers to things or people connected with Khotan/Hotan (Hetian), a historic Silk Road oasis region in Xinjiang, China.","zh":"Khotana 指与和田（Khotan/Hotan，亦称于阗）这一丝绸之路绿洲地区及其历史文化相关的事物或人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Khotan (also spelled Hotan), an oasis region and historical kingdom on the southern Silk Road in today’s Xinjiang, China; also used for the culture, language, or people associated with it.","zh":"与和田（亦拼作 Khotan/Hotan）有关的；指位于中国新疆、丝绸之路南道上的绿洲地区及其历史王国，也可指其文化、语言或相关人群。"},"examples":[{"en":"Khotana art reflects strong Buddhist influence along the Silk Road.","zh":"Khotana 的艺术反映了丝绸之路上强烈的佛教影响。"},{"en":"Some scholars study Khotana texts to learn about early Central Asian Buddhism.","zh":"一些学者研究 Khotana 文献，以了解中亚早期佛教。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Khotan/Hotan, or someone associated with that region (rare in modern English).","zh":"和田/于阗人；指来自该地区或与该地区有关的人（现代英语中较少用）。"},"examples":[{"en":"In the story, a Khotana guides the travelers through the desert route.","zh":"故事里，一位 Khotana 带领旅人穿越沙漠路线。"}]}],"synonyms":["Khotan","Hotan","Hetian","Khotanese"],"phonetic":"/koʊˈtɑːnə/","extraExplanation":["“Khotana”在英语里并不是非常常见的标准词形，更常见的是“Khotan”（历史拼写）或“Hotan”（现代拼写，对应中文“和田”）。","历史上的“Khotan/于阗”是丝绸之路南道的重要绿洲王国之一，与佛教传播、玉石贸易（尤其是和田玉）等主题经常一起出现。","如果你是在查语言名称，更常见的说法是“Khotanese”（和田语/于阗语），属于中古时期的伊朗语支语言。"]}
{"word":"khoum","summary":{"en":"“khoum” is not a standard English word; it is usually a misspelling or variant referring to Khartoum (Sudan’s capital).","zh":"“khoum”不是标准英语词；通常是对 Khartoum（喀土穆，苏丹首都）的误拼或变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard spelling; most often it appears as a shortened or mistaken form of “Khartoum,” the capital city of Sudan.","zh":"一种很少见、非标准的拼写；最常见的情况是它作为“Khartoum（喀土穆）”的缩写或误拼——喀土穆是苏丹的首都。"},"examples":[{"en":"I think you mean Khartoum, not “khoum.”","zh":"我觉得你想写的是 Khartoum（喀土穆），不是“khoum”。"},{"en":"Khartoum lies near where the Blue Nile and White Nile meet.","zh":"喀土穆位于青尼罗河与白尼罗河的汇合附近。"}]}],"synonyms":["Khartoum"],"phonetic":"/kɑrˈtuːm/","extraExplanation":["“khoum”在英语里不是常见标准词条。如果你是在看地图、新闻或历史资料，最可能对应的是 Sudan（苏丹）的首都“Khartoum（喀土穆）”。","英语里把阿拉伯语地名转写成拉丁字母时，拼写常有不同版本；因此容易出现类似的变体或误拼。若你能提供上下文句子或来源（书名/链接/截图），我可以更准确判断你要查的词。"]}
{"word":"khoums","summary":{"en":"Khoums (often spelled khums in English) means “one-fifth,” especially the traditional Islamic one-fifth share/tax set aside for religious or communal use.","zh":"Khoums（英语更常写作 khums）意为“五分之一”，尤指伊斯兰传统中用于宗教或社区用途的“五分之一”份额/税。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam) a one-fifth share or tax; traditionally, one-fifth of certain types of wealth (such as war booty or some forms of income) set aside for religious or community purposes.","zh":"（伊斯兰教）“五分之一”的份额或税；传统上指对某些财富（如战利品或部分收入）按五分之一提取，用于宗教或社区用途。"},"examples":[{"en":"In some historical sources, khoums refers to the one-fifth of war booty reserved for the state or religious authorities.","zh":"在一些历史文献中，khoums 指战利品中保留给国家或宗教权威的五分之一。"},{"en":"The text explains how khoums was distributed within the community according to religious law.","zh":"这篇文章解释了在宗教法下，khoums 如何在社区内部分配。"}]}],"synonyms":["khums","one-fifth tax","one-fifth share"],"phonetic":"/kʊmz/","extraExplanation":["khoums 常见于法语或北非语境的拼写，是阿拉伯语 khums/khumus（خمس，“五分之一”）的转写；英语里更常见的拼写是 khums。","该词多出现在历史、伊斯兰法（fiqh）或宗教研究写作中；日常英语交流中较少使用。"]}
{"word":"khowar","summary":{"en":"Khowar is a language spoken mainly in Chitral, northern Pakistan, and the word can also describe things related to that language or its speakers.","zh":"Khowar 指主要在巴基斯坦北部奇特拉尔地区使用的科瓦语，也可作形容词表示“与科瓦语/其使用者相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Dardic (Indo-Aryan) language spoken mainly in northern Pakistan, especially in the Chitral region","zh":"科瓦语（Khowar）：一种达尔德语支（属印欧语系—印度-雅利安语族）的语言，主要在巴基斯坦北部奇特拉尔（Chitral）地区使用"},"examples":[{"en":"Khowar is widely spoken in Chitral District in northern Pakistan.","zh":"科瓦语在巴基斯坦北部的奇特拉尔地区使用广泛。"},{"en":"She is learning Khowar to communicate with her host family.","zh":"她正在学习科瓦语，好和寄宿家庭交流。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Khowar language or its speakers","zh":"与科瓦语或其使用者相关的"},"examples":[{"en":"He collected Khowar folk songs and recorded their lyrics.","zh":"他收集了科瓦语民歌，并记录了歌词。"},{"en":"The museum displayed Khowar cultural artifacts from the region.","zh":"博物馆展出了来自该地区的科瓦尔文化文物。"}]}],"synonyms":["Chitrali (language)"],"phonetic":"/ˈkoʊ.wɑr/","extraExplanation":["“Khowar”有时也被称为“Chitrali（奇特拉尔语）”，但在学术与当地使用中，“Khowar”更常用来指语言本身。","它主要使用在巴基斯坦的吉尔吉特-巴尔蒂斯坦附近及开伯尔-普什图省的奇特拉尔一带；在阿富汗也有少量使用者。","在英语里，语言名称通常首字母大写（Khowar）。如果指“科瓦语的/与科瓦语相关的”，也常用同一个词作形容词。"]}
{"word":"khronika","summary":{"en":"Khronika is a Slavic (often Russian) transliteration meaning “chronicle,” and sometimes a “news chronicle/newsreel.”","zh":"Khronika 常是斯拉夫语（多为俄语）的转写，意思是“编年史/纪事”，有时也指“新闻纪要/新闻短片”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chronicle; a record of events in the order they happened (often used as a transliteration of the Russian word “хроника”).","zh":"编年史；按时间顺序记录事件的纪事（常见于俄语“хроника”的转写）。"},"examples":[{"en":"The book is written like a khronika, describing events year by year.","zh":"这本书写得像一部“khronika”，按年份逐一描述事件。"},{"en":"In the archive, we found a khronika of the town’s history.","zh":"在档案馆里，我们找到了一部关于这座城镇历史的“khronika”。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some Slavic contexts) a news chronicle or newsreel—a regular report of current events.","zh":"（某些斯拉夫语语境）新闻纪要/新闻短片：定期报道时事的栏目或影片。"},"examples":[{"en":"They watched the weekly khronika before the main film.","zh":"主片开始前，他们看了每周的新闻短片（khronika）。"},{"en":"The radio station aired a morning khronika of local events.","zh":"这家电台播出了本地早间新闻简报（khronika）。"}]}],"synonyms":["chronicle","annals","record","history","newsreel"],"phonetic":"/krəˈnɪkə/","extraExplanation":["“khronika”多见于俄语或其他斯拉夫语言的拉丁字母转写，对应英语更常用的词是“chronicle”。在英文写作中，除非你在讨论俄语文本、书名、节目名或专有名词，一般建议直接用“chronicle / chronicle news”。"]}
{"word":"khronikos","summary":{"en":"khronikos: a Greek-derived adjective meaning “related to time; chronological,” and by origin connected to the idea behind “chronic.”","zh":"khronikos：源自希腊语的形容词，意为“与时间有关的；按时间顺序的”，词源上也与“chronic（慢性的/长期的）”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(From Greek) relating to time; chronological. In English, it is usually seen in academic contexts or as the root behind words like “chronicle,” “chronology,” and “chronic.”","zh":"（源自希腊语）与“时间”有关的；按时间顺序的。在英语中多见于学术语境，或作为词根出现在 chronicle（编年史）、chronology（年代学）、chronic（慢性的）等词中。"},"examples":[{"en":"In some linguistics books, khronikos is used to describe something that is time-based or chronological.","zh":"在一些语言学书籍里，khronikos 用来描述“以时间为基础”或“按时间顺序”的概念。"},{"en":"A khronikos account would list events in the order they happened.","zh":"khronikos 式的叙述会按事情发生的先后顺序来排列。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a long duration; “chronic” (less common as a direct English usage of khronikos, but connected by origin).","zh":"与“长期持续”有关的；“慢性的/长期的”（作为 khronikos 的英语直接用法较少见，但在词源上与 chronic 相连）。"},"examples":[{"en":"The Greek root behind chronic comes from the idea of something lasting over time.","zh":"chronic 背后的希腊词根来自“随时间持续存在”的概念。"}]}],"synonyms":["chronological","temporal","time-related"],"phonetic":"/krɑˈnɪkəs/","extraExplanation":["khronikos（更常见的转写也有 chronikos）来自希腊语 χρόνος（khronos，“时间”）。因此在英语里常见的相关词包括：chronology（年代学/按时间排列）、chronological（按时间顺序的）、chronicle（编年史/记载）、anachronism（时代错误/错置）。","如果你是在医学语境里想表达“慢性的”，英语最常用的是 chronic，而不是 khronikos。","在古典文学或学术写作里，有时会保留希腊语转写形式来强调“希腊原典概念”，但日常英语中通常不用 khronikos。"]}
{"word":"khronos","summary":{"en":"Khronos refers to “Time” personified in Greek-influenced contexts, and it is also used today as a proper name (especially the Khronos Group in tech).","zh":"Khronos 可指希腊文化语境中的“时间（拟人化）”，也可指现代的专有名称（尤其是科技领域的 Khronos Group）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The personification of time; often used in English writing to mean “Time” as a powerful, unstoppable force.","zh":"（希腊神话）时间的拟人化；在英语写作中常用来指“时间”这一不可阻挡的力量。"},"examples":[{"en":"In the poem, Khronos is pictured as a silent ruler who turns youth into age.","zh":"在这首诗中，Khronos 被描绘成沉默的统治者，把青春变成衰老。"},{"en":"The painting shows Khronos with an hourglass, reminding viewers that time never stops.","zh":"这幅画把 Khronos 画成拿着沙漏的形象，提醒观众时间永不停歇。"}]},{"partOfSpeech":"n.","definition":{"en":"A modern proper name used for organizations and products, especially the Khronos Group, an industry consortium that creates graphics/compute standards (e.g., OpenGL, Vulkan).","zh":"现代专有名词用法：常指 Khronos Group（科纳斯/克罗诺斯组织），制定图形与计算相关行业标准的联盟（如 OpenGL、Vulkan）。"},"examples":[{"en":"The game engine added support for a Khronos standard to improve graphics performance.","zh":"这个游戏引擎加入了对 Khronos 标准的支持，以提升图形性能。"},{"en":"Vulkan is maintained by the Khronos Group.","zh":"Vulkan 由 Khronos Group 维护。"}]}],"synonyms":["Chronos","Father Time"],"phonetic":"/ˈkroʊnɑs/","extraExplanation":["在英语里你可能还会看到 Chronos / Kronos / Khronos 等不同拼写，来源多与希腊语音译习惯有关，含义通常都指“时间的拟人化”。","注意不要和 Cronus/Kronos（克洛诺斯，泰坦神，宙斯之父）混淆：Cronus 是一位神祇的名字，而 Chronos 更常被用来表示“时间”。在一些作品里二者会被混用，但学术/神话区分时一般不同。","文学与艺术中常把 Khronos 画成“时间老人（Father Time）”式形象（如沙漏、镰刀等意象），用来表达时间带来的改变与无可逆转。"]}
{"word":"khrushchev","summary":{"en":"Khrushchev is the name of a major Soviet leader (Nikita Khrushchev) and can also describe things connected to his era or policies.","zh":"Khrushchev 指苏联重要领导人尼基塔·赫鲁晓夫之名，也可作定语表示与其时代或政策有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nikita Khrushchev (1894–1971), a Soviet leader who served as First Secretary of the Communist Party (1953–1964) and Premier (1958–1964). He is known for de-Stalinization, Cold War crises, and promoting peaceful coexistence with the West.","zh":"赫鲁晓夫（1894–1971），苏联领导人，曾任苏共中央第一书记（1953–1964）与部长会议主席/总理（1958–1964）。他以“去斯大林化”、冷战时期的重大危机处理，以及提出与西方“和平共处”而知名。"},"examples":[{"en":"Khrushchev criticized Stalin’s rule in a major speech in 1956.","zh":"赫鲁晓夫在1956年的一次重要讲话中批评了斯大林的统治。"},{"en":"During the Cold War, Khrushchev was a central figure in the Cuban Missile Crisis.","zh":"在冷战时期，赫鲁晓夫是古巴导弹危机中的关键人物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as a modifier to describe something related to Nikita Khrushchev or his era/policies.","zh":"作定语使用，指“与赫鲁晓夫本人、其时代或政策相关的”。"},"examples":[{"en":"The Khrushchev era brought important political changes to the Soviet Union.","zh":"赫鲁晓夫时期给苏联带来了重要的政治变化。"},{"en":"They discussed Khrushchev-style reforms in the 1960s.","zh":"他们讨论了20世纪60年代赫鲁晓夫式的改革。"}]}],"synonyms":["Nikita Khrushchev","Khrushchev era","Soviet leader"],"phonetic":"/ˈkrʊʃ.tʃɛv/","extraExplanation":["英文里专名“Khrushchev”常见两种拼法来源：俄语“Хрущёв”的转写差异（有时也写作 Khrushchyov / Khrushchov）。","他在西方语境中常被提到的一个文化梗是“在联合国敲鞋”（shoe-banging incident），虽然具体细节和真伪在历史记录中存在争议，但常被用来表现其强硬、戏剧化的公众形象。"]}
{"word":"khu","summary":{"en":"“khu” is usually a name or abbreviation (often “KHU” for Kyung Hee University), not a common English word.","zh":"“khu”通常是名称或缩写（常见如“KHU”指庆熙大学），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as an abbreviation or a proper name (e.g., a university, organization, or a family name).","zh":"不是标准英语单词；最常见作缩写或专有名词（例如大学、机构名称或姓氏）。"},"examples":[{"en":"KHU announced the new scholarship program this semester.","zh":"KHU 在本学期公布了新的奖学金项目。"},{"en":"Her last name is Khu.","zh":"她的姓是 Khu。"}]},{"partOfSpeech":"other","definition":{"en":"(Abbreviation) A common use is Kyung Hee University (South Korea), often written as “KHU” in school-related contexts.","zh":"（缩写）常见用法之一是指韩国的庆熙大学（Kyung Hee University），在校务语境中常写作 “KHU”。"},"examples":[{"en":"He is applying to KHU for graduate school.","zh":"他正在申请 KHU 的研究生项目。"},{"en":"The conference will be hosted at KHU Seoul Campus.","zh":"会议将在 KHU 首尔校区举办。"}]}],"synonyms":["abbreviation","acronym","initialism","proper name"],"phonetic":"/ku/","extraExplanation":["“khu / KHU”更像是拉丁字母拼写的名称或缩写，而不是英语词典里的常规词汇。实际含义通常要看上下文：比如学校简称、机构名、用户名、或人名（在一些文化中可作姓氏）。","如果你能提供一句包含“khu”的原句或说明你想查的是哪种用法（人名/学校/缩写/网络用语），我可以给出更准确的释义与用法建议。"]}
{"word":"khuai","summary":{"en":"“khuai” is not standard English; it’s often an informal spelling for Mandarin “kuài (快),” meaning “fast/quick.”","zh":"“khuai”不是标准英文，常见于把中文“kuài（快）”非正式地拼写成拉丁字母，意思是“快/迅速”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard Romanization spelling sometimes used to represent Mandarin Chinese “kuài (快),” meaning “fast/quick,” especially in informal contexts (e.g., menus, usernames, or older/local transliterations). It is not a standard English word.","zh":"一种非标准的拉丁拼写，有时用来表示中文普通话“kuài（快）”，意思是“快、迅速”。它不是标准英文词。"},"examples":[{"en":"On the menu, “khuai” likely means “quick/fast,” from Chinese kuài (快).","zh":"菜单上的“khuai”多半来自中文“快（kuài）”，意思是“快/迅速”。"},{"en":"I couldn’t find “khuai” in an English dictionary; it may be a transliteration from Chinese.","zh":"我在英文词典里找不到“khuai”，它可能是从中文音译过来的拼写。"}]}],"synonyms":["fast","quick","rapid"],"phonetic":"/kwaɪ/","extraExplanation":["更常见、更规范的拼写是拼音 **kuai/kuài**（例如：kuài cān = 快餐 “fast food”）。","如果你其实想查的是英文单词，可能是：**khaki**（卡其色/卡其布），或法语借词 **quay**（码头，读 /kiː/）。你可以告诉我语境（在哪看到的、想表达什么），我可以帮你确定最可能的词。"]}
{"word":"khubber","summary":{"en":"“Khubber” is not a recognized English word; it’s likely a name, misspelling, or a transliteration (possibly related to “news”).","zh":"“khubber”不是标准英语词；更可能是名字、拼写错误或音译（可能与“新闻/消息”有关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a surname/username, or a transliteration from another language.","zh":"不是标准英语单词。可能是拼写错误、人名/网名，或来自其他语言的音译。"},"examples":[{"en":"I couldn’t find “khubber” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里找不到“khubber”，你能提供你看到它的句子吗？"},{"en":"“Khubber” might be a name or a user handle rather than an English vocabulary word.","zh":"“khubber”更可能是名字或用户名，而不是英语词汇。"}]}],"extraExplanation":["“khubber”很可能是其他语言的音译/拼写变体。例如在印地语/乌尔都语里有“khabar（消息、新闻）”，在孟加拉语里常见“khobor（新闻）”。如果你是想表达“新闻/消息”，请告诉我你看到的语境或原语言，我可以帮你确认最合适的英文词（如 news, information, update）。","也可能是你想拼的英文单词：比如 rubber（橡胶；橡皮）, hubbub（喧闹；嘈杂）等。给我一句包含它的原句，我能更准确判断。"]}
{"word":"khud","summary":{"en":"Khud means “self / oneself,” often used to stress doing something personally (South Asian usage).","zh":"khud 表示“自己/自身”，常用于南亚语境中强调“亲自、自己做”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Urdu/Hindi/Persian) “self; oneself.” Often used in South Asian speech or writing (including South Asian English) to emphasize that someone did something personally, without help.","zh":"（源自乌尔都语/印地语/波斯语）“自己；自身”。常见于南亚语境（含南亚英语）中，用来强调某人亲自做某事、没有他人代劳。"},"examples":[{"en":"I fixed it khud, so it may not look perfect.","zh":"我是自己（khud）修的，所以可能看起来不太完美。"},{"en":"She wants to do it khud, without anyone’s help.","zh":"她想自己（khud）做，不要任何人帮忙。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used for emphasis meaning “personally / on your own.”","zh":"用于强调，表示“亲自 / 靠自己”。"},"examples":[{"en":"You should go and see it khud.","zh":"你应该亲自（khud）去看看。"},{"en":"He cooked the whole meal khud.","zh":"他整顿饭都是亲自（khud）做的。"}]}],"synonyms":["myself","yourself","oneself","personally","on your own"],"phonetic":"/xʊd/","extraExplanation":["“khud”（خود）在波斯语与乌尔都语里都很常见，基本义是“自己”。在印地语/乌尔都语的日常表达中，经常出现在诸如“khud se（自己来/靠自己）”“khud ko（自己/把自己…）”等搭配里。","发音上，很多南亚语言里的词首会有类似英语里没有的“x”音（像德语 Bach 的开头音）。在英语书写中常用 kh- 来近似表示。"]}
{"word":"khula","summary":{"en":"Khula is a wife-initiated Islamic divorce, often involving returning the mahr or offering compensation to end the marriage.","zh":"Khula 指伊斯兰法中由妻子提出的离婚，常涉及返还聘礼或给予补偿以解除婚姻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Islamic law, a form of divorce initiated by the wife, usually involving her returning the mahr (marriage gift) or offering compensation to the husband in exchange for ending the marriage.","zh":"在伊斯兰法中，指由妻子提出的离婚形式，通常需要她返还聘礼（mahr）或给予丈夫一定补偿，以换取解除婚姻关系。"},"examples":[{"en":"She petitioned the court for a khula after years of conflict.","zh":"多年的矛盾之后，她向法院申请以 khula 方式离婚。"},{"en":"In some countries, khula can be granted by a judge even if the husband refuses.","zh":"在一些国家，即使丈夫不同意，法官也可能判决准予 khula 离婚。"},{"en":"The article compared talaq and khula in modern family law.","zh":"那篇文章比较了现代家庭法中的 talaq 与 khula。"}]}],"synonyms":["wife-initiated divorce (Islamic law)","Islamic divorce (khula)","dissolution of marriage"],"phonetic":"/ˈkuːlə/","extraExplanation":["“khula”（也常拼作 khulʿ / khulaʿ）来自阿拉伯语，核心含义与“解除、脱离”有关。在英语新闻与学术写作中，它常用于讨论穆斯林婚姻制度与家庭法。","不同国家与法学流派对 khula 的程序和条件规定差异很大：有的强调双方协商与补偿（类似“协议解除”），有的则允许在特定条件下由法官裁决。","与之常被对照的术语是 “talaq”（通常指丈夫发起的离婚）。实际使用时要注意语境与法律体系，避免把任何一种做法简单等同于所有穆斯林社会的通行规则。"]}
{"word":"khulda","summary":{"en":"Khulda is most commonly a feminine name of Arabic origin meaning “eternal/immortal,” and it can also appear as a less-common place-name spelling variant.","zh":"Khulda 最常见是阿拉伯语来源的女性名字，意为“永恒／不朽”；也可能是某些地名在不同转写下的拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (from Arabic), often understood as “eternal/immortal,” sometimes associated with the idea of lasting paradise.","zh":"（阿拉伯语来源的）女性名字，常被理解为“永恒的／不朽的”，有时也与“永恒的乐园”这一意象相关。"},"examples":[{"en":"Khulda is a traditional name in some Arabic-speaking families.","zh":"Khulda 在一些阿拉伯语家庭中是较传统的名字。"},{"en":"Her name, Khulda, is said to mean “eternal.”","zh":"据说她的名字 Khulda 的意思是“永恒的”。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a place name spelling variant; may refer to locations transliterated as Khulda/Khalda (depending on the system used).","zh":"（较少见）地名的拼写变体；可能指在不同转写系统下写作 Khulda / Khalda 的地点。"},"examples":[{"en":"Some maps write the neighborhood as Khalda, while others use Khulda.","zh":"有些地图把该社区写作 Khalda，也有的写作 Khulda。"}]}],"synonyms":["Khalda","Khalida","Khuld"],"phonetic":"/ˈkʊldə/","extraExplanation":["“Khulda/Khuldā”常被认为与阿拉伯语词根 خ-ل-د（kh-l-d）相关，这个词根带有“长久、永恒、不朽”的含义。在宗教或文学语境中，你可能会看到与“永恒的居所/乐园”相关的表达（例如带有“永恒”含义的短语），但作为人名时通常更偏向“永恒、不朽”的祝福意味。","由于英语里没有阿拉伯语的“kh”喉音（类似摩擦音），英文环境中发音和拼写会有多种近似方式，因此同一个名字可能出现不同拼法（如 Khulda / Khalda / Khalida 等）。"]}
{"word":"khuskhus","summary":{"en":"Khuskhus means poppy seeds, commonly used in South Asian cooking, often ground into a paste for flavor and thickness.","zh":"Khuskhus 指罂粟籽，在南亚料理中很常见，常磨成糊用来增香并增稠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) Poppy seeds, used as a cooking ingredient (often ground into a paste) in Indian, Pakistani, Bangladeshi, and Nepali cuisines.","zh":"（南亚英语）罂粟籽（常磨成糊作调味或增稠），常见于印度、巴基斯坦、孟加拉、尼泊尔等地的料理中。"},"examples":[{"en":"Add a spoon of khuskhus paste to thicken the curry.","zh":"加入一勺 khuskhus（罂粟籽）糊来让咖喱更浓稠。"},{"en":"Khuskhus is often used in korma and some festive sweets.","zh":"khuskhus 常用于 korma（奶油坚果咖喱）以及一些节庆甜点中。"},{"en":"She soaked khuskhus in warm milk before grinding it.","zh":"她先把 khuskhus 用温牛奶浸泡再研磨。"}]}],"synonyms":["poppy seeds","khas khas","posto (regional)"],"phonetic":"/ˈkʊsˌkʊs/","extraExplanation":["“khuskhus”也常写作“khas khas”（印地语/乌尔都语常见拼法）。在南亚家庭料理里，它既能增稠（像坚果酱一样让酱汁更顺滑），也能带来淡淡的坚果香。","不同国家/地区对罂粟籽的销售与携带规定不一；虽然烹饪用籽通常不含可致幻成分，但出入境或网购前最好查当地法规。"]}
{"word":"khussak","summary":{"en":"“Khussak” is not a standard English word; it’s likely a name or a transliteration. You may have meant a similar-looking word such as “Cossack.”","zh":"“khussak”不是标准英语词；更可能是人名或外语转写。你可能想写的是外形相近的词，比如“Cossack（哥萨克）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare spelling that is not recognized as a standard English word; it is most often seen as a name (e.g., a surname/username) or a transliteration from another language.","zh":"一种不被视为标准英语词汇的罕见拼写；更常见于人名（如姓氏/用户名）或其他语言的音译/转写。"},"examples":[{"en":"I couldn’t find an English dictionary entry for “khussak,” so it may be a name or a transliteration.","zh":"我在英语词典里找不到“khussak”的词条，所以它可能是人名或音译/转写。"},{"en":"If you meant “Cossack,” the spelling is different and the meaning changes.","zh":"如果你想写的是“Cossack（哥萨克）”，拼写不同，意思也会改变。"}]}],"phonetic":"/kʊˈsɑk/","extraExplanation":["“khussak”本身不像是常见英语单词。它可能来自其他语言（例如南亚语言）的转写，不同地区/系统的拼写会不一致。","你可能想找的是拼写相近的英语词，比如：Cossack（哥萨克：历史上东欧草原的哥萨克人/骑兵群体）。如果你告诉我它出现的句子或语境（人名、地名、歌曲歌词、聊天用语等），我可以更准确判断。"]}
{"word":"khutba","summary":{"en":"A khutba is an Islamic sermon, especially the Friday sermon in a mosque.","zh":"khutba 指伊斯兰教讲道，尤指清真寺的周五主麻讲道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sermon or formal address delivered in a mosque, especially during the Friday congregational prayer (Jumu‘ah) or on Eid.","zh":"（伊斯兰教）在清真寺发表的讲道/讲词，尤指主麻日（聚礼）或开斋节、宰牲节等节日礼拜时的讲道。"},"examples":[{"en":"The imam gave a khutba about compassion and honesty.","zh":"伊玛目发表了一篇关于慈悲与诚实的库特白（讲道）。"},{"en":"Many people arrive early to listen quietly to the Friday khutba.","zh":"很多人会提前到达，安静聆听周五的库特白（主麻讲道）。"}]}],"synonyms":["sermon","homily"],"phonetic":"/ˈkʊt.bə/","extraExplanation":["“Khutba”（也常拼作 khutbah）来自阿拉伯语 خُطْبَة（khuṭbah），在英语里通常指具有宗教与社会劝诫性质的正式讲道。","在主麻礼拜中，khutba 常与礼拜仪式相连，听众一般会安静聆听；它既可能谈信仰与道德，也可能涉及社区关怀等主题。","书写与发音：英语里常见拼写有 khutba / khutbah；末尾 h 有时不发音或很轻。不同地区的拼写与转写方式可能不同。"]}
{"word":"khutbah","summary":{"en":"A khutbah is an Islamic sermon given in a mosque, especially before Friday (Jumu'ah) prayer or on Eid.","zh":"khutbah 指伊斯兰在清真寺中的讲道，尤指主麻（周五聚礼）或开斋节等节日礼拜时的讲辞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sermon (formal religious speech) delivered in a mosque, especially during the Friday congregational prayer (Jumu'ah) or on Eid.","zh":"（清真寺中的）宗教讲道/布道，尤指主麻聚礼（周五聚礼，Jumu'ah）或开斋节、古尔邦节等节日礼拜时的讲辞。"},"examples":[{"en":"The imam delivered the khutbah before the Friday prayer.","zh":"伊玛目在周五主麻礼拜前发表了讲辞（khutbah）。"},{"en":"During Eid, the khutbah reminded the community to care for the poor.","zh":"在开斋节期间，讲辞（khutbah）提醒大家关爱贫困者。"}]}],"synonyms":["sermon","religious address"],"phonetic":"/ˈkʊt.bə/","extraExplanation":["“Khutbah”来自阿拉伯语“خُطْبَة (khuṭbah)”，在伊斯兰传统中是一种有固定礼仪位置的讲道。英语里常见拼写有 khutbah / khutba / khotbah。","在许多地区的主麻礼拜中，khutbah 通常包含劝诫、经文或教诲，并与群体生活相关的主题（如品德、互助、社会责任）。使用时建议尊重宗教语境，例如说 “deliver/give a khutbah（发表讲辞）”。"]}
{"word":"khutuktu","summary":{"en":"Khutuktu is a title for a highly revered reincarnate Buddhist lama, especially in Mongolian (and related Tibetan Buddhist) contexts.","zh":"Khutuktu 是蒙古（及相关藏传佛教）语境中对高地位转世活佛的称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high-ranking Buddhist lama in Mongolia or Tibet, especially one believed to be the reincarnation of a previous spiritual leader (a “living Buddha”).","zh":"（蒙古或西藏佛教中）地位很高的活佛称号，尤指被认为是前世高僧转世的宗教领袖。"},"examples":[{"en":"The Jebtsundamba Khutuktu was an important religious figure in Mongolia.","zh":"哲布尊丹巴呼图克图是蒙古重要的宗教人物。"},{"en":"In older Western writings, a khutuktu might be described as a “living Buddha.”","zh":"在较早的西方著作中，khutuktu 有时被称作“活佛”。"}]}],"synonyms":["living Buddha","reincarnate lama","tulku"],"phonetic":"/kuˈtʊk.tu/","extraExplanation":["“Khutuktu”常见于历史、宗教学和旅行写作中，带有明显的地域与时代色彩；现代学术写作里也常直接用具体称号（如 Jebtsundamba Khutuktu / 哲布尊丹巴呼图克图）来指代特定人物。","该词多源自蒙古语/藏传佛教语境的音译，在英文文献中也可能见到不同拼写（如 Khutukhtu 等），属于专名体系的一部分。"]}
{"word":"khuzi","summary":{"en":"“khuzi” is not a standard English word; it’s likely a name, transliteration, or misspelling.","zh":"“khuzi”不是标准英语词；更可能是人名、音译/转写，或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a personal name, a transliteration from another language, or a misspelling/variant of a different word.","zh":"不是标准英语词汇。可能是人名、其他语言的音译/转写，或是某个英文词的拼写变体/拼错。"},"examples":[{"en":"I couldn’t find a dictionary definition for “khuzi”; where did you see it?","zh":"我查不到“khuzi”的词典释义；你是在哪里看到的？"},{"en":"If “khuzi” is a name, the meaning depends on the language and culture it comes from.","zh":"如果“khuzi”是名字，它的含义取决于来源语言和文化。"}]}],"phonetic":"/ˈkuːzi/","extraExplanation":["“khuzi”在常见英语词典里通常查不到。你可以告诉我它出现的语境（一句话/哪种语言/是否是人名或地名）我就能更准确判断。","有时有人把英式俚语 **khazi**（意为“厕所”）误写成类似拼法；如果你原本想问的是 **khazi**，也可以直接告诉我。"]}
{"word":"khvat","summary":{"en":"“Khvat” is a rare English-form transliteration from Russian, meaning a grasp/grip or reach (and sometimes the idea of ‘having enough’).","zh":"“khvat”是源自俄语的少见音译词，可指抓握/握力、够得着的范围，也可引申为“够用”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword/transliteration from Russian) a grasp, grip, or reach; the act of grabbing or having enough of something.","zh":"（源自俄语的音译/借词）抓握、握力或够得着的距离；也可指“抓取/拿到”或“够用的数量”这一概念。"},"examples":[{"en":"He caught the rope with a strong khvat and pulled himself up.","zh":"他用很强的 khvat（握力）抓住绳子，把自己拉了上去。"},{"en":"The shelf was just out of my khvat, so I asked for help.","zh":"架子刚好超出我的 khvat（够得着的范围），所以我请别人帮忙。"}]},{"partOfSpeech":"other","definition":{"en":"(rare; as a name/term in some contexts) a transliterated element used in Russian-related writing, names, or cultural references.","zh":"（较少见）在与俄语/俄文化相关的文本、姓名或引用中出现的音译词素或用语。"},"examples":[{"en":"In the novel, the author uses “khvat” to keep a Russian flavor in the dialogue.","zh":"在小说里，作者用“khvat”来保留对话的俄语风味。"}]}],"synonyms":["grip","grasp","hold","reach"],"phonetic":"/kvɑt/","extraExplanation":["“khvat”通常是俄语“хват”的拉丁字母转写。它和俄语动词“хватать”（抓、够、够用）同源，所以在不同语境里可对应“握力/抓握”“够得着”“足够的量”等意思。英语里并不是常用词，更多出现在翻译、文学、历史或带俄语色彩的写作中。"]}
{"word":"khwarazmian","summary":{"en":"Khwarazmian means “from Khwarazm,” and it can also refer to the extinct Khwarazmian language.","zh":"Khwarazmian 指“来自花剌子模（Khwarazm）的”，也可指已消亡的花剌子模语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Khwarazm (Khwarezm), a historical region in Central Asia, or to its people and culture.","zh":"与花剌子模（Khwarazm/Khwarezm，中亚的历史地区）有关的；花剌子模人的；花剌子模文化的。"},"examples":[{"en":"The museum has a small collection of Khwarazmian ceramics.","zh":"这家博物馆收藏了一小批花剌子模陶器。"},{"en":"She is reading about Khwarazmian history along the Silk Road.","zh":"她在阅读与丝绸之路相关的花剌子模历史。"}]},{"partOfSpeech":"n.","definition":{"en":"The Khwarazmian language, an extinct Eastern Iranian language once spoken in the Khwarazm region.","zh":"花剌子模语：一种已消亡的东伊朗语支语言，曾在花剌子模地区使用。"},"examples":[{"en":"Some medieval texts preserve a few words of Khwarazmian.","zh":"一些中世纪文献保留了少量花剌子模语词汇。"},{"en":"The class compared Khwarazmian with other Iranian languages.","zh":"课堂上把花剌子模语与其他伊朗语进行了比较。"}]}],"synonyms":["Khwarezmian"],"phonetic":"/kwɑːˈræzmiən/","extraExplanation":["“Khwarazmian”也常拼作“Khwarezmian”。不同拼写主要来自对同一地名在不同转写体系中的处理。","花剌子模（Khwarazm）大致位于今天乌兹别克斯坦与土库曼斯坦一带，历史上与波斯文化圈、伊斯兰世界及丝绸之路交流密切。","在英语中，这个词多见于历史、考古、语言学等学术语境，日常对话中较少使用。"]}

