{"word":"kje","summary":{"en":"“KJE” is usually an acronym, not a regular English word; its meaning depends on context (sometimes “King James Edition”).","zh":"“KJE”通常是缩略词而不是英语单词；含义取决于语境（有时指“King James Edition/詹姆士王译本”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as an acronym/initialism whose meaning depends on context (for example, a project name, an organization, or someone’s initials).","zh":"不是标准英语单词；最常见是首字母缩略词，具体含义取决于语境（例如项目名、组织名或人名缩写）。"},"examples":[{"en":"I saw “KJE” in the document, but it wasn’t defined—what does it stand for?","zh":"我在文件里看到“KJE”，但没有解释——它代表什么？"},{"en":"KJE might be someone’s initials in an email signature.","zh":"KJE 可能是邮件签名里的姓名缩写。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare, context-specific) “King James Edition,” referring to the King James Bible in some informal labels.","zh":"（较少见，特定语境）“King James Edition（詹姆士王译本）”，在一些非正式标注中指《钦定版圣经》。"},"examples":[{"en":"This study compares NIV with KJE wording in a few passages.","zh":"这项研究比较了 NIV 与 KJE 在部分经文中的措辞。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌkeɪ dʒiː ˈiː/","extraExplanation":["“KJE”在英语里并不常见、也不固定指某一个意思。最可靠的方法是看它出现的领域（例如：学校/期刊/公司/游戏/宗教文本）以及它前后是否有全称。","如果你把“KJE”出现的句子或截图发我，我可以帮你根据上下文判断它最可能代表什么。"]}
{"word":"kjeldahl","summary":{"en":"Kjeldahl refers to a widely used method for measuring nitrogen, often to estimate protein content.","zh":"Kjeldahl 指一种常用的测氮方法，常用于估算蛋白质含量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical method for measuring the amount of nitrogen in a sample (often used to estimate protein content in food and agricultural materials).","zh":"凯氏定氮法；一种测定样品中氮含量的化学方法（常用于估算食品、饲料等的蛋白质含量）。"},"examples":[{"en":"The lab used the Kjeldahl method to determine the protein content of the flour.","zh":"实验室用凯氏定氮法测定面粉的蛋白质含量。"},{"en":"Kjeldahl analysis is common in food quality control.","zh":"凯氏分析在食品质量控制中很常见。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Kjeldahl method or its equipment and procedures.","zh":"与凯氏定氮法相关的；指该方法的设备或操作流程。"},"examples":[{"en":"We followed the Kjeldahl procedure step by step.","zh":"我们按步骤执行凯氏定氮流程。"},{"en":"The technician prepared the Kjeldahl apparatus for digestion.","zh":"技术员为消化步骤准备了凯氏装置。"}]}],"synonyms":["Kjeldahl method","Kjeldahl analysis","Kjeldahl nitrogen determination"],"phonetic":"/ˈkjɛlˌdɑl/","extraExplanation":["“Kjeldahl”来自丹麦化学家Johan Gustav Christoffer Thorsager Kjeldahl（约1883年提出该法）。它最常见的搭配是“Kjeldahl method / Kjeldahl analysis / Kjeldahl nitrogen”。","在科研与检测语境中，它通常读作一个专有名词；写作时首字母大写（Kjeldahl）。"]}
{"word":"kjeldahlization","summary":{"en":"Kjeldahlization means using (or carrying out) the Kjeldahl method to convert and measure nitrogen in a sample.","zh":"Kjeldahlization 指进行凯氏定氮法处理，以转化并测定样品中的氮含量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of measuring total nitrogen in a sample using the Kjeldahl method (by converting nitrogen compounds into ammonium and then quantifying it)","zh":"用凯氏定氮法测定样品总氮含量的过程（将含氮化合物转化为铵盐/氨，再进行定量）"},"examples":[{"en":"The lab reported the protein content after Kjeldahlization of the flour sample.","zh":"实验室在对面粉样品进行凯氏定氮处理后，报告了其蛋白质含量。"},{"en":"Kjeldahlization is still widely used in food testing and agricultural analysis.","zh":"凯氏定氮处理在食品检测和农业分析中仍被广泛使用。"}]},{"partOfSpeech":"n.","definition":{"en":"a pretreatment step in which a sample is digested with strong acid so its nitrogen is converted into a measurable form (used before titration or instrumental measurement)","zh":"一种前处理步骤：用强酸消化样品，把其中的氮转化为可测量的形式（常在滴定或仪器测定前使用）"},"examples":[{"en":"After Kjeldahlization, the solution was made alkaline to release ammonia.","zh":"凯氏消化处理后，将溶液碱化以释放氨。"},{"en":"Incomplete Kjeldahlization can lead to underestimated nitrogen results.","zh":"凯氏消化不完全会导致氮含量结果偏低。"}]}],"synonyms":["Kjeldahl analysis","Kjeldahl digestion","the Kjeldahl method","nitrogen determination"],"phonetic":"/ˌkjɛlˌdɑːlɪˈzeɪʃən/","extraExplanation":["“Kjeldahlization”来自“Kjeldahl（凯尔达）”，指丹麦化学家Johan Kjeldahl提出的凯氏定氮法。该方法经典步骤通常包括：消化（硫酸等将有机氮转为铵盐）→碱化蒸馏（释放氨）→滴定定量。它常用于食品/饲料中“粗蛋白”测定（蛋白质≈氮×换算系数，如6.25；不同原料系数可能不同）。","在现代英语中更常见的说法是“the Kjeldahl method”或“Kjeldahl analysis/digestion”；“Kjeldahlization”属于较少见、偏技术写法。"]}
{"word":"kjeldahlize","summary":{"en":"“Kjeldahlize” means to test a material’s nitrogen (often protein) content using the Kjeldahl method.","zh":"“Kjeldahlize”指用凯氏定氮法测定材料的氮含量（常用于估算蛋白质）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to measure the nitrogen (and often protein) content of a substance using the Kjeldahl method","zh":"用凯氏（Kjeldahl）定氮法测定某物中的氮含量（并常据此估算蛋白质含量）"},"examples":[{"en":"The lab kjeldahlized the flour to estimate its protein content.","zh":"实验室用凯氏定氮法测定面粉的氮含量，以估算其蛋白质含量。"},{"en":"Before labeling the feed, the technicians kjeldahlized several samples for quality control.","zh":"在给饲料做标签前，技术人员用凯氏定氮法检测了多份样品进行质量控制。"}]}],"synonyms":["do a Kjeldahl analysis","determine nitrogen by the Kjeldahl method","analyze for nitrogen"],"phonetic":"/ˈkjɛldɑːlˌaɪz/","extraExplanation":["“Kjeldahlize”来自丹麦化学家 Johan Kjeldahl 的姓氏。凯氏定氮法是经典的化学分析方法，常用于食品科学、农业与环境检测中，通过测得总氮来推算蛋白质含量（通常用“总氮 × 系数”）。","该词在日常英语中很少见，更常见的表达是 “do a Kjeldahl analysis” 或 “determine nitrogen by the Kjeldahl method”。"]}
{"word":"kju","summary":{"en":"Queue means a line of people/things waiting, or (in computing) an ordered list of items to be processed; it can also mean to wait in line.","zh":"Queue 指排队的队伍/队列，也可指（计算机）按顺序处理的队列；作动词表示排队等候。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a line of people, vehicles, or things waiting for their turn","zh":"（人、车或事物的）队列；排队等候的队伍"},"examples":[{"en":"We waited in a long queue for concert tickets.","zh":"我们为买演唱会门票排了很长的队。"},{"en":"There’s a queue at the coffee shop every morning.","zh":"那家咖啡店每天早上都有人排队。"}]},{"partOfSpeech":"vi.","definition":{"en":"to wait in a line; to form a line","zh":"排队等候；列队"},"examples":[{"en":"People queued outside the store before it opened.","zh":"商店开门前，人们就在外面排队等候。"},{"en":"You may need to queue for a taxi at the airport.","zh":"在机场你可能需要排队等出租车。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) a list where items are handled in the order they arrive (first in, first out)","zh":"（计算机）队列：按进入顺序处理的列表（先进先出）"},"examples":[{"en":"Your print job is in the queue.","zh":"你的打印任务在队列里。"},{"en":"The system processes requests in a queue.","zh":"系统以队列方式处理请求。"}]}],"synonyms":["line","waiting line","row","queue up","wait in line"],"phonetic":"/kjuː/","extraExplanation":["“kju”常用来表示发音 /kjuː/。对应的常见单词有 **queue**（排队/队列）和 **cue**（提示/暗示/开拍提示），两者同音但意思不同：queue 更偏“排队”，cue 更偏“提示信号”。","**queue** 这个词的有趣之处在于：虽然拼写很长，但除了第一个字母 q 之外，后面的 **ueue** 在发音里几乎不“发声”。","在英式英语和美式英语里，queue 的读音都很接近 /kjuː/。日常场景里常说 “stand in line”（美式更常见）≈ “queue”（英式更常见）。"]}

