{"word":"kL","summary":{"en":"kiloliter; 1,000 liters.","zh":"千升；等于 1,000 升。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A symbol for kiloliter(s), a metric unit of volume equal to 1,000 liters.","zh":"千升（kiloliter）的符号；一种体积单位，等于 1,000 升。"},"examples":[{"en":"The tank can hold 3 kL of water.","zh":"这个水箱能装 3 kL 的水。"},{"en":"The report lists daily usage in kL.","zh":"报告用 kL 来列出每日用水量。"}]}],"synonyms":["kiloliter","cubic meter","m3"],"phonetic":"/keɪ ˈɛl/","extraExplanation":["书写习惯：kL 中的 k 必须小写（表示 kilo-），L 通常大写（避免与数字 1 混淆）。","换算：1 kL = 1,000 L = 1 m³（立方米）。在水费/用水统计中常见。"],"etymology":"“kL”由公制前缀 kilo-（k，表示“千”）+ liter（L，升）组成，用于表示 1,000 升的体积单位。","mnemonic":["把 k 想成“kilo=千”，L 想成“liter=升”，合起来就是“千升”。","记住 1 m³ = 1,000 L，所以 1 kL = 1 m³。"]}
{"word":"kl","summary":{"en":"“KL/kl” is most commonly an abbreviation for Kuala Lumpur, or (as kL) the unit kiloliter; it can also be someone’s initials.","zh":"“KL/kl”最常见是吉隆坡的缩写，或（写作kL）表示体积单位“千升”；也可能是人名/机构的首字母。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Kuala Lumpur, the capital city of Malaysia.","zh":"（缩写）吉隆坡，马来西亚的首都。"},"examples":[{"en":"I have a layover in KL before flying to Bangkok.","zh":"我去曼谷前会在KL（吉隆坡）转机。"},{"en":"KL is known for the Petronas Twin Towers.","zh":"KL（吉隆坡）以双子塔闻名。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., science) kiloliter (kL), a unit of volume equal to 1,000 liters.","zh":"（缩写，理科）千升（kL），体积单位，等于1000升。"},"examples":[{"en":"The tank holds 2 kL of water.","zh":"这个水箱能装2千升水。"},{"en":"Record the result in kL, not liters.","zh":"请用kL（千升）记录结果，不要用升。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) the letters “K.L.” used as initials for a person, organization, or place name.","zh":"（缩写）“K.L.”作为姓名、机构或地名的首字母缩写。"},"examples":[{"en":"The memo was signed by K.L.","zh":"备忘录由K.L.署名。"},{"en":"Ask KL if the meeting time has changed.","zh":"问一下KL会议时间有没有变。"}]}],"synonyms":["Kuala Lumpur","kL","initials"],"phonetic":"ˌkeɪˈɛl","extraExplanation":["“KL”通常是缩写，具体意思很依赖上下文；在科学计量里常写作“kL”（k小写、L大写），在地名里常写作“KL”（都大写）。如果你告诉我你在哪个语境看到“kl”（聊天、地图、作业、游戏等），我可以给出更准确的解释。"]}
{"word":"klaberjass","summary":{"en":"Klaberjass is a Dutch trick‑taking card game (often spelled “klaverjas”).","zh":"Klaberjass 是一种荷兰的吃墩纸牌游戏（常拼作“klaverjas”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trick‑taking card game popular in the Netherlands (often spelled “klaverjas”), usually played by four people in two partnerships","zh":"一种在荷兰很流行的吃墩（trick‑taking）纸牌游戏（常拼作“klaverjas/klaverjassen”），通常四人分两组对抗进行"},"examples":[{"en":"My Dutch friends taught me klaberjass after dinner.","zh":"晚饭后，我的荷兰朋友教我玩 klaberjass。"},{"en":"They meet every weekend to play klaberjass in pairs.","zh":"他们每周末都会两两组队聚在一起玩 klaberjass。"}]}],"synonyms":["klaverjas","klaverjassen"],"phonetic":"/ˈklɑːbərˌjæs/","extraExplanation":["“Klaberjass”在英语里较少见，更常见的写法是荷兰语“klaverjas”（也可见复数/动词形式 klaverjassen）。它属于“吃墩牌戏”一类，和 bridge（桥牌）、euchre（尤克牌）在玩法结构上有相似之处：出牌赢一墩、计算得分、通常有主牌（trump）。","词源上与荷兰语有关：klaver = “梅花（♣）”，jas 与“杰克/侍从牌（jack）”相关。不同地区规则可能略有差别，因此如果要学玩法，最好先确认使用哪一套规则。"]}
{"word":"Klafter","summary":{"en":"a historical German/Austrian length unit roughly like a fathom; based on an armspan","zh":"德语区历史长度单位，约等于“一寻”，源于“臂展”概念"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Central European (especially German/Austrian) unit of length, roughly equal to a fathom (about 6 feet or ~1.8 meters; exact value varied by region and time)","zh":"（中欧传统长度单位，尤指德语区）“Klafter”，大致相当于一“寻”（约6英尺/约1.8米；不同地区与时期数值不一）"},"examples":[{"en":"In old Austrian records, timber was sometimes measured in Klafter.","zh":"在旧奥地利档案里，木材有时会用“Klafter”来计量。"},{"en":"The tunnel length was listed as 120 Klafter in a 19th‑century document.","zh":"一份19世纪文献把隧道长度记为120“Klafter”。"}]},{"partOfSpeech":"n.","definition":{"en":"an armspan; the distance between the fingertips of outstretched arms (the idea behind the unit)","zh":"臂展；双臂平举时两手指尖之间的距离（该单位的来源概念）"},"examples":[{"en":"He estimated the rope by eye—about one Klafter, an armspan.","zh":"他凭目测估算那段绳子——大约一“Klafter”，也就是一个臂展。"},{"en":"The word originally referred to a body-based measure like an armspan.","zh":"这个词最初指的是一种以人体为基准的计量方式，比如臂展。"}]}],"synonyms":["fathom","armspan","span","toise"],"phonetic":"/ˈklɑftɚ/","extraExplanation":["这是历史计量单位：在不同邦国、行业（如木材、矿业、建筑）里换算并不完全一致，所以遇到旧文献时最好查该地区当时的标准。","在英语语境中它不常见，多出现在历史、家谱、地方志或翻译作品里。"],"etymology":"源自德语 Klafter，和表示“抓握/抱住”的词源有关，早期与“用双臂环抱、两臂伸展的距离”相关；后来固定为地区性长度单位，常被视为接近英语 fathom（寻）。","mnemonic":["联想“抓（抓握=clasp）+ 远（farthom=一寻）”：Klafter 和 fathom 类似，都是“臂展/一寻”的长度。"]}
{"word":"klafter","summary":{"en":"Klafter is a historical German-language unit of length (like a fathom), often used for timber, about 1.8 m depending on place/time.","zh":"Klafter 是历史上的德语长度单位（类似“寻”），常用于木材计量，约1.8米但会因地区/时代而异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former Austrian/German unit of length (a “fathom”), used especially for measuring wood; roughly about 1.8 meters (varies by region and time)","zh":"（旧）奥地利/德语区的长度单位，类似“英寻（fathom）”，常用于量木材；约等于1.8米左右（各地各时期略有差异）"},"examples":[{"en":"In old records, timber was sometimes counted by the Klafter rather than by meters.","zh":"在旧档案里，木材有时用“Klafter”来计量，而不是用米。"},{"en":"The document lists the bridge length as “20 Klafter,” which needs conversion to modern units.","zh":"文件把桥的长度写成“20 Klafter”，需要换算成现代单位。"}]}],"synonyms":["fathom (approx.)","old unit of length","historical measure"],"phonetic":"/ˈklɑːftɚ/","extraExplanation":["“Klafter”来自德语，历史上在奥地利及周边地区使用较多，常被翻译成“寻/英寻（fathom）”。它的具体长度并不完全统一：不同城市、邦国或行业标准会有差别，因此阅读历史文献时通常需要查该地区当时的换算表。","在一些资料里，“Klafter”也可能指一“堆/垛”木材的计量方式（与长度单位相关联），所以遇到木材贸易或林业语境时要结合上下文判断。"]}
{"word":"klaftern","summary":{"en":"Klaftern is the plural of Klafter, a historical German/Austrian unit of measure (usually length), about 1.8 m depending on place and time.","zh":"Klaftern 是 Klafter 的复数，指德语区历史计量单位（多为长度），按地区与时代不同约合1.8米左右。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) a German/Austrian historical unit of length (and sometimes a measure for firewood or mined ore), roughly about 1.8 meters depending on region and period.","zh":"（复数）“Klafter（克拉夫特）”的复数形式；德语区（德国/奥地利）历史上的长度单位（有时也用作柴火或矿石的计量单位），不同地区与时代换算不一，约相当于1.8米左右。"},"examples":[{"en":"The old land records listed the boundary as 40 Klaftern from the river.","zh":"旧地契把边界写成“离河岸40 Klaftern”。"},{"en":"In the archive, mining tunnels were measured in Klaftern rather than meters.","zh":"在档案里，矿井巷道用 Klaftern 而不是米来计量。"}]}],"synonyms":["Klafter","(roughly) fathoms","(context-dependent) cord"],"phonetic":"/ˈklɑftərn/","extraExplanation":["“Klafter”源自德语，原意与“张开双臂的距离（fathom 的概念）”相近，因此常被拿来和英语的 fathom 类比。","历史上各地标准不统一：有的地方按人体尺度，有的按官方尺制；在奥地利等地常见换算约为1.896米左右，但不同文献会出现不同数值。","在木材贸易中也可能指“一堆/一垛柴火”的体积计量（类似“cord”），具体含义要看上下文（长度还是木柴/矿石的计量）。"]}
{"word":"klaijaz","summary":{"en":"“klaijaz” isn’t recognized as an English word; it’s likely a misspelling or a name/ID.","zh":"“klaijaz”不是可识别的英语单词；更可能是拼写错误或名字/ID。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名、人名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “klaijaz” in an English dictionary—did you mean another word?","zh":"我在英语词典里找不到“klaijaz”——你是不是想输入另一个词？"},{"en":"If you tell me the sentence where you saw it, I can help guess the intended word.","zh":"如果你把看到它的句子发给我，我可以帮你推测原本想表达的词。"}]}],"phonetic":"N/A","extraExplanation":["你可以检查一下：\n1）是否少/多打了字母（尤其是 a/e/i、j/z 这类容易手滑的字母）；\n2）是否想输入某个常见词（比如又短又常见的词更容易拼错）；\n3）它是否是人名、品牌名、游戏/社交平台ID。\n\n把你想表达的中文意思、或出现它的上下文句子贴出来，我就能更准确地帮你对照可能的正确英文。"]}
{"word":"Klallam","summary":{"en":"a Native American people of Washington’s Olympic Peninsula, or their language.","zh":"华盛顿州奥林匹克半岛的原住民族（克拉勒姆族）或其语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people of the Olympic Peninsula in Washington State (also spelled Clallam; includes communities such as the Jamestown S’Klallam, Lower Elwha Klallam, and Port Gamble S’Klallam).","zh":"（美国华盛顿州奥林匹克半岛的）克拉勒姆族/克拉勒姆人（亦作 Clallam；包括 Jamestown S’Klallam、Lower Elwha Klallam、Port Gamble S’Klallam 等社区）。"},"examples":[{"en":"The museum worked with Klallam elders to curate the exhibit.","zh":"博物馆与克拉勒姆族长者合作策划展览。"},{"en":"Several Klallam communities are based near the Strait of Juan de Fuca.","zh":"多个克拉勒姆族社区位于胡安·德富卡海峡附近。"}]},{"partOfSpeech":"n.","definition":{"en":"the Coast Salish language traditionally spoken by the Klallam people (often called Klallam or S’Klallam).","zh":"克拉勒姆语（沿海萨利希语支的一种；克拉勒姆族传统语言，常称 Klallam 或 S’Klallam）。"},"examples":[{"en":"She is taking a class to learn Klallam.","zh":"她正在上课学习克拉勒姆语。"},{"en":"The school invited speakers to share songs in Klallam.","zh":"学校邀请母语者分享用克拉勒姆语演唱的歌曲。"}]}],"synonyms":["Clallam","S'Klallam","Klallam language","Clallam people"],"phonetic":"/ˈklæləm/","extraExplanation":["在美国语境中，谈到 Klallam 往往涉及太平洋西北地区原住民族历史与当代文化复振（如语言课程、地名复原、传统艺术与生态知识）。","拼写差异较常见：Clallam 常见于地名与县名（Clallam County），而部落与语言复振项目中也常用 Klallam 或 S’Klallam。"],"etymology":"该词多被认为来自邻近原住民族（如马卡族）对该族的称呼，后被英语记录并出现不同拼写（Klallam/Clallam 等）。现代部落名称中常见的 “S’Klallam” 也反映了本族语言的发音与书写方式。","mnemonic":["记忆法：把它拆成听感“k + lallam”，中间的“lall”像重复的“啦啦”，读起来有节奏：/ˈklæləm/。","联想地名：看到华盛顿州的 Clallam County，可联想到同源的族名/语言名 Klallam。"]}
{"word":"klam","summary":{"en":"“Klam” is not a standard English word; it is usually a misspelling of “clam.”","zh":"“klam”不是标准英语单词，通常是“clam”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling of “clam.” In standard English, the correct word is “clam.”","zh":"“clam”的非标准拼写。在标准英语中，正确写法是“clam”。"},"examples":[{"en":"Did you mean “clam” (the shellfish), not “klam”?","zh":"你是不是想写“clam”（蛤蜊/贝类），而不是“klam”？"},{"en":"The menu says clam chowder.","zh":"菜单上写着蛤蜊浓汤（clam chowder）。"}]}],"synonyms":["clam"],"phonetic":"/klæm/","extraExplanation":["“klam”在英语里通常不被当作正式单词使用，多半是拼写错误或个别名字/缩写（如品牌、用户名）。如果你告诉我语境（句子/领域/国家），我也可以帮你判断是否是某个缩写或专有名词。","如果你要找的是“clam”，它最常见的意思是“蛤蜊、贝类（可食用的海产）”，也可以作动词表示“挖蛤蜊/捡蛤蜊”。常见搭配：clam chowder（蛤蜊浓汤）、clam up（口语：突然不说话/变得沉默）。"]}
{"word":"klamath","summary":{"en":"Klamath refers to a Native American people (and their language) in southern Oregon, and it is also the name of several major places there, such as the Klamath River and Klamath Falls.","zh":"Klamath（克拉马斯）既可指俄勒冈州南部的原住民民族及其语言，也常用作当地重要地名，如克拉马斯河与克拉马斯瀑布城。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Native American people of southern Oregon (also called the Klamath Tribes, often referring to the Klamath, Modoc, and Yahooskin peoples together).","zh":"（美国）克拉马斯族：美国俄勒冈州南部的原住民民族（“Klamath Tribes/克拉马斯部族”常也泛指克拉马斯、莫多克与亚胡斯金等群体的联合称呼）。"},"examples":[{"en":"The Klamath Tribes have worked for decades to protect salmon habitats.","zh":"克拉马斯部族几十年来一直致力于保护鲑鱼的栖息地。"},{"en":"We learned about Klamath history and culture in a local museum.","zh":"我们在当地博物馆了解了克拉马斯族的历史与文化。"}]},{"partOfSpeech":"n.","definition":{"en":"The Klamath language, an Indigenous language historically spoken in southern Oregon (today often described as endangered or in revitalization efforts).","zh":"克拉马斯语：历史上在俄勒冈州南部使用的原住民语言（如今多被认为处于濒危或复兴阶段）。"},"examples":[{"en":"The community runs classes to support Klamath language revitalization.","zh":"社区开设课程，支持克拉马斯语的复兴。"},{"en":"Some place names in the region come from Klamath.","zh":"该地区的一些地名源自克拉马斯语。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for several places and natural features in the U.S. Pacific Northwest, especially the Klamath River, Klamath Lake, and Klamath Falls.","zh":"克拉马斯：美国太平洋西北地区若干地名与自然地理名称，尤指克拉马斯河、克拉马斯湖与克拉马斯瀑布城（Klamath Falls）。"},"examples":[{"en":"They went rafting on the Klamath River.","zh":"他们去克拉马斯河漂流了。"},{"en":"Klamath Falls is in southern Oregon near the California border.","zh":"克拉马斯瀑布城位于俄勒冈州南部，靠近加利福尼亚州边界。"}]}],"synonyms":["Klamath Tribes"],"phonetic":"/ˈklæməθ/","extraExplanation":["“Klamath”在英文里通常作为专有名词使用，首字母大写；指民族、语言或地名时都很常见。","在美国语境中，“Klamath Tribes”常是官方或组织名称；日常表达里也会用“Klamath people”来指该民族。"]}
{"word":"klan","summary":{"en":"“Klan” is usually either a rare spelling of “clan,” or (when capitalized) a shortened name for the Ku Klux Klan.","zh":"“klan”通常要么是“clan”的少见拼写，要么（大写“Klan”）是“Ku Klux Klan（3K党）”的简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A less common spelling of “clan”: a close-knit family group or social group, especially one connected by shared ancestry.","zh":"“clan（氏族/家族团体）”的不常见拼写：指关系紧密的家族或社会群体，常因共同祖先而联系在一起。"},"examples":[{"en":"In the story, the hero returns to his clan after many years away.","zh":"在故事里，英雄多年后回到自己的氏族。"},{"en":"They come from a large clan with a long family history.","zh":"他们来自一个历史悠久的大家族。"}]},{"partOfSpeech":"n.","definition":{"en":"(Capitalized: Klan) A shortened name for the Ku Klux Klan, a racist, white-supremacist extremist organization in the United States.","zh":"（首字母大写：Klan）“Ku Klux Klan（3K党）”的简称：美国的种族主义、白人至上主义极端组织。"},"examples":[{"en":"The museum exhibit explains the violence and intimidation used by the Klan.","zh":"博物馆展览讲解了3K党使用的暴力与恐吓手段。"},{"en":"Many communities worked together to resist the Klan’s influence.","zh":"许多社区共同努力抵制3K党的影响。"}]}],"synonyms":["clan","family group","kin","tribe"],"phonetic":"/klæn/","extraExplanation":["拼写提示：在现代英语里，“clan”是标准拼写；“klan”通常很少单独使用。若看到“Klan”大写，常特指“Ku Klux Klan”，属于强烈负面、具有历史创伤的语境，用词时应非常谨慎。","文化语境：在新闻、历史、博物馆文本中，“the Klan”常直接指该组织；学术或公共写作里通常会明确写出“Ku Klux Klan (KKK)”以避免歧义。"]}
{"word":"klangfarbe","summary":{"en":"Klangfarbe means the tone color (timbre) that makes one instrument/voice sound different from another.","zh":"Klangfarbe 指“音色/音色的颜色感（timbre）”，即让不同乐器或人声听起来不同的声音特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the characteristic “tone color” or timbre of a sound—what makes the same note sound different on different instruments or voices (a term borrowed from German, used in music).","zh":"音色；（同一音高在不同乐器/人声上呈现的）声音“颜色”或质感——使同一个音听起来不同的特征（源自德语，常用于音乐语境）。"},"examples":[{"en":"A flute and a violin can play the same note, but their Klangfarbe is very different.","zh":"长笛和小提琴可以演奏同一个音，但它们的音色（Klangfarbe）非常不同。"},{"en":"The composer changes the orchestra’s Klangfarbe by switching from strings to brass.","zh":"作曲家通过把弦乐换成铜管来改变乐队的音色（Klangfarbe）。"},{"en":"She loves the warm Klangfarbe of his baritone voice.","zh":"她很喜欢他男中音嗓音温暖的音色（Klangfarbe）。"}]}],"synonyms":["timbre","tone color","tone quality"],"phonetic":"/ˈklɑŋˌfɑrbə/","extraExplanation":["这是一个德语外来词：Klang=“声音/响声”，Farbe=“颜色”。英语里通常用更常见的词 timbre 或 tone color；在音乐理论、配器（orchestration）和声学讨论中，Klangfarbe 有时用来强调“音色像颜色一样可被‘调配’与‘对比’”。","在某些写作里（尤其谈到20世纪音乐与配器法），Klangfarbe 也会出现在“音色旋律（Klangfarbenmelodie）”这个概念中，指用不断变化的音色来形成类似旋律的效果。"]}
{"word":"klanism","summary":{"en":"Klanism means the racist ideology or influence connected to the Ku Klux Klan (KKK).","zh":"Klanism 指与三K党（KKK）有关的种族主义意识形态或其影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the beliefs, practices, or influence associated with the Ku Klux Klan (KKK), especially its white-supremacist ideology and racist intimidation","zh":"与“三K党”（Ku Klux Klan，KKK）相关的信仰、做法或影响，尤指其白人至上主义思想与种族主义恐吓行为"},"examples":[{"en":"The article discusses how Klanism fueled racial violence in some communities.","zh":"这篇文章讨论了“三K党主义”如何在一些社区助长种族暴力。"},{"en":"Local leaders publicly rejected Klanism and called for equal rights.","zh":"当地领导人公开反对“三K党主义”，并呼吁平等权利。"}]}],"synonyms":["Ku Klux Klan ideology","KKK ideology","white supremacy","racist extremism"],"phonetic":"/ˈklænɪzəm/","extraExplanation":["“Klanism”源自“the Klan”（三K党）+ 后缀“-ism”（表示某种主义/思想体系）。它通常用于历史、政治或社会评论中，带有强烈负面含义，指向种族主义与极端主义。","在美国历史语境里，三K党与反黑人、反移民、反犹太等仇恨活动有关；使用该词时一般是在批判或分析这类意识形态的影响。写作中如果担心读者不熟悉，也可先写全称“Ku Klux Klan (KKK)”再用“Klanism”。"]}
{"word":"klans","summary":{"en":"“Klans” is the plural of “Klan,” usually referring to the Ku Klux Klan (KKK), a white-supremacist hate group in U.S. history.","zh":"“Klans”是“Klan”的复数，通常指美国历史上的三K党（KKK），一个白人至上主义仇恨组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Klan; most often used to refer to the Ku Klux Klan (KKK), a U.S. white-supremacist hate group.","zh":"Klan 的复数；多指美国“三K党”（Ku Klux Klan, KKK），一个宣扬白人至上主义的仇恨组织。"},"examples":[{"en":"The book discusses how the Klans used intimidation and violence to control communities.","zh":"这本书讨论了三K党如何用恐吓和暴力来控制社区。"},{"en":"Many leaders publicly condemned the Klans’ racist ideology.","zh":"许多领导人公开谴责三K党的种族主义意识形态。"}]}],"synonyms":["KKK","Ku Klux Klan"],"phonetic":"/klænz/","extraExplanation":["“Klan”在历史与新闻语境里常常默认指“三K党（KKK）”。它起源于美国内战后（19世纪）的一些白人至上主义组织，曾通过恐怖威胁、私刑等方式压迫非裔美国人及其他少数群体。由于强烈的历史创伤与仇恨属性，使用该词时应注意语境与表达方式（如在学术、历史、新闻报道中较常见）。"]}
{"word":"Klansman","summary":{"en":"a member of the Ku Klux Klan","zh":"三K党成员"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ku Klux Klan, a racist and violent extremist organization in the United States","zh":"三K党（Ku Klux Klan）的成员；该组织是美国历史上以种族主义与暴力恐吓著称的极端团体成员"},"examples":[{"en":"The film shows a Klansman taking part in a hateful rally.","zh":"这部电影展示了一名三K党成员参加仇恨集会的情节。"},{"en":"Historians document how Klansmen used intimidation to stop Black people from voting.","zh":"历史学家记录了三K党成员如何用恐吓手段阻止黑人投票。"}]}],"synonyms":["KKK member","Ku Klux Klan member","Klansperson"],"phonetic":"/ˈklænzmən/","extraExplanation":["“Ku Klux Klan（KKK）”起源于19世纪美国内战后，长期以白人至上主义为核心，曾通过暴力、恐吓与私刑针对黑人及其他少数群体。该词带有强烈负面与历史创伤色彩，常见于历史、新闻或反歧视语境中。"],"etymology":"由“Klan”（三K党组织名称的一部分）+ “-sman”（表示“……的人/成员”）构成；字面意思是“该组织的成员”。","mnemonic":["把它拆开记：Klan（联想到KKK）+ man（人）→“KKK的人/成员”。","联想中文：看到“Klansman”就想到“某个极端组织的成员”，语境多与种族主义、仇恨犯罪相关。"]}
{"word":"klansman","summary":{"en":"A klansman is a member of the Ku Klux Klan, a racist and violent white-supremacist group in U.S. history.","zh":"Klansman 指三K党的成员；三K党是美国历史上的白人至上主义、种族主义且以暴力闻名的组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ku Klux Klan (KKK), a U.S. white-supremacist organization known for racism and violence","zh":"三K党（KKK）的成员；美国的白人至上主义组织成员，该组织以种族主义与暴力著称"},"examples":[{"en":"The documentary interviews former klansmen about how they were recruited.","zh":"这部纪录片采访了前三K党成员，讲述他们是如何被招募的。"},{"en":"The museum exhibit explains how klansmen used intimidation to deny Black Americans their rights.","zh":"博物馆展览解释了三K党成员如何通过恐吓来剥夺非裔美国人的权利。"}]}],"synonyms":["KKK member","Ku Klux Klan member"],"phonetic":"/ˈklænzmən/","extraExplanation":["“Klansman”来自“(Ku Klux) Klan + man”。它通常指三K党的男性成员，但在一些语境中也被用作泛指“该组织的成员”。","这是一个带有强烈负面与历史创伤的词，常出现在历史、新闻或反种族主义讨论中。日常交流里应谨慎使用，避免被误解为认同或美化该组织。"]}
{"word":"klanswoman","summary":{"en":"A female member of the Ku Klux Klan (KKK), a racist white-supremacist extremist group.","zh":"三K党（KKK）的女性成员；该组织是种族主义的白人至上极端团体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who is a member of the Ku Klux Klan (the KKK), a U.S. white-supremacist and racist extremist organization","zh":"三K党（KKK）的女性成员；三K党是美国的白人至上、种族主义极端组织"},"examples":[{"en":"The documentary interviewed a former klanswoman about how she left the KKK.","zh":"这部纪录片采访了一位前“三K党女性成员”，讲述她如何离开该组织。"},{"en":"The book describes how some klanswomen helped spread racist ideas in their communities.","zh":"这本书描述了部分三K党女性成员如何在社区中传播种族主义观念。"}]}],"synonyms":["Klan member","KKK member","Ku Klux Klanswoman"],"phonetic":"ˈklænzˌwʊmən","extraExplanation":["“klanswoman”由“Klan”（指 Ku Klux Klan）+“woman”构成，带有强烈的历史与政治负面含义。使用时要注意语境，多见于历史、新闻报道或学术讨论中。","三K党在美国历史上与反黑人、反移民、反犹等暴力与恐吓行为相关；在严肃写作中常写作“Ku Klux Klanswoman”以避免歧义。"]}
{"word":"klaproth","summary":{"en":"Klaproth is a German surname, most commonly referring to the chemist Martin Heinrich Klaproth, and sometimes to the linguist Julius Klaproth.","zh":"Klaproth 是德国姓氏，最常指化学家马丁·海因里希·克拉普罗特，有时也指语言学家尤利乌斯·克拉普罗特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A German surname best known from Martin Heinrich Klaproth (1743–1817), a chemist who helped establish modern analytical chemistry and identified several chemical elements.","zh":"德国姓氏，最常见于马丁·海因里希·克拉普罗特（1743–1817），一位化学家，对现代分析化学的发展贡献很大，并鉴定了多种化学元素。"},"examples":[{"en":"Klaproth is often mentioned in the history of analytical chemistry.","zh":"在分析化学史中，经常会提到克拉普罗特（Klaproth）。"},{"en":"In a lecture, the professor cited Klaproth’s careful measurements as a model of good scientific practice.","zh":"在课堂上，教授引用克拉普罗特严谨的测量方法，作为良好科学实践的典范。"}]},{"partOfSpeech":"n.","definition":{"en":"Sometimes used to refer to Julius Klaproth (1783–1835), a German linguist and orientalist known for work on Asian languages and cultures.","zh":"有时也指尤利乌斯·克拉普罗特（1783–1835），一位德国语言学家与东方学者，以研究亚洲语言与文化著称。"},"examples":[{"en":"Some older academic writings cite Klaproth when discussing early European studies of Asian languages.","zh":"一些较早的学术著作在谈到欧洲早期的亚洲语言研究时会引用克拉普罗特（Klaproth）。"}]}],"phonetic":"/ˈklɑːprɔːt/","extraExplanation":["“Klaproth”本身不是普通词汇，而是专有名词（姓氏）。在英文材料里如果单独出现、且语境与化学相关，通常指化学家 Martin Heinrich Klaproth；若与语言、亚洲研究相关，则可能指 Julius Klaproth。","文学性提及不算常见，但在“科学史/化学史”类书籍与文章中较常出现，作为人物名或学术贡献的引用对象。"]}
{"word":"klaprotholite","summary":{"en":"Klaprotholite: a very rare, mainly historical mineral name used in older geology/mineralogy sources.","zh":"Klaprotholite：一种非常罕见、主要见于旧文献的矿物名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral name used in geology/mineralogy (found mainly in older sources), named in honor of the German chemist Martin Heinrich Klaproth","zh":"（地质/矿物学用语）一种罕见矿物的名称（多见于较早文献），以德国化学家马丁·海因里希·克拉普罗特命名"},"examples":[{"en":"Klaprotholite is a term you may only see in historical mineral lists.","zh":"Klaprotholite 这个词你多半只会在较早的矿物名录里看到。"},{"en":"The museum label mentions klaprotholite, but modern references may use a different name.","zh":"博物馆的标签写着 klaprotholite，但现代资料可能用的是另一个名称。"}]}],"phonetic":"/ˌklæp.rəˈθɑr.əˌlaɪt/","extraExplanation":["这是一个非常冷门的矿物名称，常见于旧版矿物学书籍或矿物名录中。遇到它时，建议同时查：标本产地、同义名/旧名（obsolete name）、以及是否已被重新命名或并入其他矿物种。","词源上常见的构词方式是：人名（Klaproth）+ -lite/-olite（表示“矿物/石”），类似的命名在矿物学里很常见。"]}
{"word":"klaskino","summary":{"en":"“klaskino” isn’t a common English word; it’s probably a name/handle or a misspelling. Share the context for an accurate meaning.","zh":"“klaskino”不是常见英语词；更可能是名称/账号或拼写误差。提供上下文才能准确解释。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a username, brand, or place name) or a misspelling of another word.","zh":"不是标准英语单词。更可能是专有名词（如用户名、品牌名或地名），或是其他单词的拼写错误。"},"examples":[{"en":"I saw “klaskino” in the comments, but I’m not sure what it refers to.","zh":"我在评论里看到“klaskino”，但不确定它指的是什么。"},{"en":"Is “klaskino” a username or the name of a game?","zh":"“klaskino”是用户名还是某个游戏的名字？"}]}],"phonetic":"/klæsˈkiːnoʊ/","extraExplanation":["“klaskino”在常见英语词典里通常查不到。如果你是在某个特定场景看到它（例如：游戏、音乐、社交账号、地名、产品名），它可能是自造词或专有名词。","如果你想确认含义，请把它出现的完整句子/截图发来，或告诉我来源语言与场景；也可能是想写“casino”“klassic/klasik”“Klasky”等相近拼写，我可以帮你判断。"]}
{"word":"klatch","summary":{"en":"A klatch is an informal get-together for casual conversation, often over coffee.","zh":"Klatch 指非正式的聊天小聚，常常是一群人围着咖啡闲聊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal social gathering where people chat, often over coffee (often in the phrase “coffee klatch”)","zh":"（非正式的）聊天聚会；常指围着咖啡聊天的聚会（常用于短语“coffee klatch”）"},"examples":[{"en":"My neighbors have a coffee klatch every Saturday morning.","zh":"我的邻居们每周六早上都会有个“咖啡聊天聚会”。"},{"en":"The meeting turned into a klatch about local news.","zh":"那次会议最后变成了聊当地新闻的闲聊聚会。"}]},{"partOfSpeech":"v.","definition":{"en":"to gather and chat casually (less common)","zh":"（较少见）聚在一起闲聊"},"examples":[{"en":"They klatched in the kitchen while dinner cooked.","zh":"晚饭在煮的时候，他们在厨房里闲聊。"}]}],"synonyms":["coffee klatch","get-together","gathering","chat","hangout","meetup"],"phonetic":"/klætʃ/","extraExplanation":["“Klatch”常出现在“coffee klatch”里，带有一种轻松、家常的社交氛围，常见于邻里或朋友间的小聚。","词源与意第绪语（Yiddish）/德语中表示“闲聊、八卦”的词有关，因此有时也暗含“聊家常、聊八卦”的意味，但语气通常不算贬义。"]}
{"word":"klatches","summary":{"en":"“Klatches” is the plural of “klatch”: informal gatherings for friendly conversation, often over coffee.","zh":"“klatches”是“klatch”的复数：指非正式的闲聊聚会，常伴随喝咖啡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"informal social gatherings where people meet to chat (often over coffee)","zh":"（非正式的）聊天聚会；（常指）一起喝咖啡闲聊的聚会"},"examples":[{"en":"After the meeting, a few coworkers stayed for a klatch in the break room.","zh":"会议结束后，几位同事留在休息室里小聚闲聊。"},{"en":"The café is popular for weekend klatches.","zh":"这家咖啡馆很适合周末来个聊天小聚。"}]}],"synonyms":["get-together","chat","gathering","coffee chat","kaffeeklatsch"],"phonetic":"/klætʃ/","extraExplanation":["“klatch”的复数是“klatches”。这个词常见于“kaffeeklatsch”（德语来源，字面是“咖啡闲聊”），在英语里用来指大家围坐聊天的轻松聚会，带一点温馨、八卦或社区社交的氛围。"]}
{"word":"klathaz","summary":{"en":"“klathaz” isn’t a recognized English dictionary word; it’s probably a name, a made-up term, or a misspelling.","zh":"“klathaz”不是词典中的标准英语词；更可能是名字、自造词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, a proper name, or an invented term (e.g., in a game, fantasy story, or username).","zh":"不是标准英语词汇；可能是拼写错误、专有名词，或人为创造的词（例如出现在游戏、奇幻故事或用户名中）。"},"examples":[{"en":"I couldn’t find “klathaz” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“klathaz”——你能把它出现的句子发我吗？"},{"en":"In some fantasy settings, “Klathaz” might be used as a character or place name.","zh":"在一些奇幻设定中，“Klathaz”可能被用作人物名或地名。"}]}],"phonetic":"/ˈklæθæz/","extraExplanation":["“klathaz”看起来不像常见英语单词，也不符合常见词根/词缀的拼写规律。最常见的情况是：①拼写有误（例如少/多了字母）；②是人名、地名、品牌名；③是游戏/小说中的自造词。","你可以提供更多信息以便我准确解释：它来自哪里（游戏/书/网页）？是否首字母大写？前后句是什么？你想确认的是发音、意思还是用法？"]}
{"word":"klatsch","summary":{"en":"Klatsch means gossip or a chatty gathering where people share news (often about others).","zh":"Klatsch 指“八卦闲聊”，也可指人们聚在一起聊天（常带点谈论他人的意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"casual gossip; chatter about other people’s personal lives (often in a social setting).","zh":"闲聊八卦；关于他人私生活的流言蜚语（常见于社交场合）。"},"examples":[{"en":"At the salon, the conversation quickly turned into klatsch about local celebrities.","zh":"在美发沙龙里，话题很快变成了关于本地名人的八卦。"},{"en":"I try to avoid office klatsch because it can hurt people.","zh":"我尽量避免办公室八卦，因为它可能伤害别人。"}]},{"partOfSpeech":"n.","definition":{"en":"a social gathering where people chat, especially to exchange news or gossip.","zh":"（尤指交换消息或八卦的）社交聚会、闲聊会。"},"examples":[{"en":"They hosted a Sunday morning klatsch with coffee and pastries.","zh":"他们周日早晨办了个咖啡加点心的闲聊聚会。"},{"en":"The book club became more of a klatsch than a discussion group.","zh":"这个读书会更像是闲聊聚会，而不是讨论小组。"}]}],"synonyms":["gossip","chitchat","small talk","tattle (informal)","buzz (informal)"],"phonetic":"/klɑtʃ/","extraExplanation":["“Klatsch”在美式英语里带一点“德语/意第绪语借词”的味道，常让人联想到社区里（比如邻里、家庭圈、办公室）那种轻松但可能有点多嘴的八卦氛围。","词源上常被追溯到德语/意第绪语里与“聊天、闲谈”相关的表达；在英语里多用于名词，语气通常比中性词“conversation”更偏向“八卦/流言”。"]}
{"word":"klatsches","summary":{"en":"“Klatsches” means pieces of gossip or casual chatter about other people (plural of “klatsch”).","zh":"“klatsches”指各种八卦、闲聊（“klatsch”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “klatsch”: gossip or talk about other people’s private lives, often in a casual/social setting.","zh":"“klatsch”的复数：八卦闲聊；议论他人私事的闲谈，常见于社交场合。"},"examples":[{"en":"After lunch, the office was full of klatsches about the new manager.","zh":"午饭后，办公室里全是关于新经理的各种八卦。"},{"en":"She avoids klatsches because they can hurt people.","zh":"她会避开八卦闲谈，因为这可能会伤害别人。"}]}],"synonyms":["gossip","chitchat","small talk","idle talk"],"phonetic":"/ˈklætʃɪz/","extraExplanation":["“klatsch”来自意第绪语/德语文化语境，常指社交聚会中的闲聊、八卦。在英语里语气通常略带贬义，暗示内容不够严肃或不够尊重隐私。","拼写上常见单数 klatsch，复数多写 klatsches；有时也会看到复数 klatsch（不加 -es），但 klatsches 更直观。"]}
{"word":"klaudia","summary":{"en":"Klaudia is a female first name, a variant of Claudia, especially used in Central/Eastern Europe.","zh":"Klaudia 是女性名字，是 Claudia 的变体拼写，尤其中东欧地区更常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a variant spelling of “Claudia”), used in several European languages, especially Polish and German.","zh":"女性名字（“Claudia/克劳迪娅”的变体拼写），在多种欧洲语言中使用，尤其常见于波兰语和德语环境。"},"examples":[{"en":"Klaudia is a common first name in Poland.","zh":"Klaudia 是波兰很常见的名字。"},{"en":"Klaudia introduced herself at the meeting.","zh":"Klaudia 在会议上做了自我介绍。"}]}],"synonyms":["Claudia"],"phonetic":"/ˈklaʊdiə/","extraExplanation":["“Klaudia”通常对应拉丁语来源的“Claudia”。在英语语境里更常见的拼写是“Claudia”，而用“K”开头的拼写更符合中东欧语言的拼写习惯（例如波兰语里常用K来对应英语的C音）。","作为人名时一般不翻译“含义”，但若了解来源：Claudia 与古罗马家族名“Claudius”有关，常被解释为与“跛的/瘸的”相关的古老词根；现代使用中主要被当作传统名字，不带贬义。"]}
{"word":"klauen","summary":{"en":"German verb “klauen” most commonly means “to steal” (informal); less commonly it can mean “to claw/scratch.”","zh":"德语动词“klauen”最常见是“偷”（口语）；较少见时也可表示“用爪子抓/抓挠”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal, German) to steal; to take something that isn’t yours","zh":"（德语口语）偷；顺手牵羊（把不属于自己的东西拿走）"},"examples":[{"en":"Someone stole my bike last night.","zh":"昨晚有人把我的自行车偷走了。"},{"en":"Don’t steal—ask first.","zh":"别偷东西——先问清楚。"},{"en":"He was caught stealing candy from the store.","zh":"他被抓到在店里偷糖果。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common, German) to claw at; to scratch with claws","zh":"（较少见，德语）用爪子抓；抓挠"},"examples":[{"en":"The cat clawed at the couch.","zh":"猫用爪子抓沙发。"}]}],"synonyms":["steal","nick","swipe","pinch"],"phonetic":"/ˈklaʊ̯ən/","extraExplanation":["“klauen”在德语里最常见的意思是“偷”，语气偏口语、随意；更中性/正式的说法通常是“stehlen”。","这个词和名词“Klaue”（爪子）有词源联系，所以也能表示“用爪子抓”，但日常交流里你看到“klauen”几乎都是“偷”的意思。","对应的英语口语近义词常见有：steal（中性）、nick / swipe / pinch（更口语，地区感更强）。"]}
{"word":"Klaus","summary":{"en":"a German-origin male given name, also used as a surname","zh":"源自德语的男性名字，也可作姓氏"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name common in German-speaking countries; originally a short form of Nikolaus (Nicholas)","zh":"常见于德语国家的男性名字；源自 Nikolaus（尼古拉斯）的简称/昵称"},"examples":[{"en":"Klaus is a common first name in Germany and Austria.","zh":"在德国和奥地利，这个名字很常见。"},{"en":"Klaus introduced himself and shook everyone’s hand.","zh":"他自我介绍后，和每个人握了手。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏"},"examples":[{"en":"Dr. Klaus will present the research results today.","zh":"Klaus 博士今天将展示研究结果。"}]}],"synonyms":["Nikolaus","Nicholas"],"phonetic":"/klaʊs/","extraExplanation":["在英语语境里，这个名字常让人联想到德语/北欧文化背景的人物；在流行文化中也常见（如影视角色名）。","注意不要与 Santa Claus（圣诞老人）混淆：Claus 是“尼古拉斯/圣尼古拉斯”相关传统中的另一种形式，而 Klaus 通常被理解为德语人名拼写。"],"etymology":"源自德语名 Klaus，是 Nikolaus 的简称；Nikolaus 对应英语的 Nicholas，最早来自希腊语，含义常被解释为“人民的胜利/胜利属于人民”（nikē“胜利”+ laos“人民”）。","mnemonic":["把它联想成“德语版 Nicholas”：看到 K 开头 + -laus 结尾，就想起德语名字常见拼写。","发音像英语的“clouse”（与 house 押韵）：Klaus /klaʊs/。"]}
{"word":"klaus","summary":{"en":"Klaus is most commonly a German/Northern European male name, often linked to Nikolaus (Nicholas). It can also be a surname.","zh":"Klaus最常见的是德语区/北欧常见的男性名字，常与Nikolaus（Nicholas）相关；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, common in German-speaking and some Northern European cultures (often a short form of “Nikolaus,” related to “Nicholas”)","zh":"男性名字，常见于德语区及部分北欧国家；常被视为“Nikolaus（尼古拉斯）”的简称，与“Nicholas（尼古拉斯）”同源"},"examples":[{"en":"Klaus moved to the U.S. for graduate school.","zh":"Klaus为了读研究生搬到美国。"},{"en":"Do you know how to spell Klaus correctly?","zh":"你知道“Klaus”怎么正确拼写吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（家族姓）"},"examples":[{"en":"Dr. Klaus will see you now.","zh":"Klaus医生现在会见你。"}]}],"synonyms":["Nikolaus","Nicholas"],"phonetic":"/klaʊs/","extraExplanation":["“Klaus”通常源自德语名“Nikolaus”的昵称形式；而“Nicholas/尼古拉斯”来自希腊语，含义大致与“人民的胜利”有关。","学习时注意不要和“Santa Claus（圣诞老人）”混淆：两者拼写不同，但“Claus”确实与“Nikolaus”的德语传统有关，所以在文化上有联系。","在流行文化中，“Klaus”也常见作角色名（如动画电影《Klaus》、美剧《The Umbrella Academy》中的角色等），因此你可能会在影视或小说里遇到它。"]}
{"word":"Klausen","summary":{"en":"a German-language surname or a place name, depending on context","zh":"多指德语语境中的姓氏，也可能是地名（需结合上下文判断）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), especially in German-speaking countries and among people of German heritage.","zh":"（常见于德语地区或德裔人群的）姓氏。"},"examples":[{"en":"Dr. Klausen will present the research at the conference.","zh":"Klausen 博士将在会议上展示这项研究。"},{"en":"I met someone named Klausen in my German class.","zh":"我在德语课上认识了一个姓 Klausen 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used in parts of Europe (for example, a district/area name in some regions), depending on local context.","zh":"（视具体地区而定的）地名，可指欧洲部分地区的某个区域/地段名称。"},"examples":[{"en":"Their hotel is near Klausen, so they can walk to the old town.","zh":"他们的酒店在 Klausen 附近，所以可以步行去老城。"},{"en":"The hiking trail passes through Klausen before reaching the valley.","zh":"徒步路线会先经过 Klausen，再到山谷。"}]}],"phonetic":"/ˈklaʊzən/","extraExplanation":["这是专有名词（人名/地名），在英文里通常首字母大写，且一般不加冠词（例如：Klausen lives in…）。","如果你是在某篇文章、地图或人物介绍里看到 Klausen，提供上下文（国家/城市/句子）会更容易确定它指的是姓氏还是具体地名。"],"etymology":"多见于德语语境中的专有名词。拼写形式常见于德语姓氏与地名传统：一些姓氏来源于地名（居住地/出身地），也可能与古老的人名或地形称呼有关。具体词源会因是“哪一个”Klausen（哪一支家族或哪一处地名）而不同。","mnemonic":["把它联想成常见德语名“Nikolaus（尼古拉乌斯）”的昵称“Klaus（克劳斯）”，Klaus + -en 让你想到“德语姓/地名的样子”。"]}
{"word":"klausis","summary":{"en":"“Clause” means a grammar unit with a subject and verb, or a section/term in a contract. “Clauses” is the plural form.","zh":"“Clause”指（1）语法中的从句（含主语和谓语），或（2）合同/法律文件中的条款；“clauses”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of words with a subject and a verb, usually forming part of a sentence (in grammar)","zh":"（语法）从句：含有主语和谓语的一组词，通常构成句子的一部分"},"examples":[{"en":"The sentence has two clauses: “I called you” and “because I was worried.”","zh":"这个句子有两个从句：“我给你打电话”和“因为我担心。”"},{"en":"A dependent clause cannot stand alone as a complete sentence.","zh":"从属从句不能单独构成完整句子。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific section of a legal document or contract","zh":"（法律/合同）条款：法律文件或合同中的一个具体部分"},"examples":[{"en":"Please read the confidentiality clause before you sign.","zh":"签字前请先阅读保密条款。"},{"en":"There is a clause that allows you to cancel within 30 days.","zh":"有一条条款允许你在30天内取消。"}]}],"synonyms":["provision","term","section","condition"],"phonetic":"/klɔz/","extraExplanation":["“klausis”不是常见英文单词；最可能是把 **clauses**（clause 的复数）拼错了。英语里 **cl** 常发 /kl/，所以看起来像“klaus-”也容易误写。","学习语法时常见搭配：**independent clause（独立/主句）**、**dependent clause（从属从句）**；在合同语境常见：**privacy clause（隐私条款）**、**termination clause（终止条款）**。"]}
{"word":"klaverjas","summary":{"en":"a Dutch trick-taking partnership card game","zh":"一种荷兰的四人搭档吃墩牌戏"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Dutch trick-taking card game for four players in two partnerships, usually played with a 32-card deck (7 through Ace).","zh":"一种荷兰的“吃墩”（trick-taking）纸牌游戏，通常四人两组对抗，常用32张牌（7到A）。"},"examples":[{"en":"My host family taught me klaverjas after dinner.","zh":"晚饭后，寄宿家庭教我玩 klaverjas。"},{"en":"Klaverjas is popular in the Netherlands, especially in cafés and family gatherings.","zh":"klaverjas 在荷兰很常见，尤其是在咖啡馆和家庭聚会中。"}]}],"synonyms":["Dutch card game","trick-taking game","partnership card game"],"phonetic":"/ˈklɑːvərˌjɑːs/","extraExplanation":["它常被拿来与法语圈的 belote（贝洛特）相比较：两者都属于吃墩类、搭档对抗、并有“叫牌/定王牌”的核心机制。不同地区规则细节差异很大（例如如何定王牌、计分与奖惩），但作为词汇理解时，把它记成“荷兰传统吃墩牌戏”就足够。"],"etymology":"来自荷兰语 klaver（“梅花/三叶草”，指扑克牌花色“梅花”）+ jas（“J牌/杰克”），字面可理解为“梅花J”，反映该游戏与王牌花色及关键牌的计分传统有关。","mnemonic":["把 klaver 想成“clover（三叶草）= 梅花♣”，jas 想成“J牌”，合起来就是“梅花J”，容易联想到这是一种牌类游戏。"]}
{"word":"klaverjassen","summary":{"en":"a Dutch trick-taking card game","zh":"一种荷兰的吃墩纸牌游戏"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Dutch trick-taking card game played (most often) by four players in two partnerships, using a 32-card deck and featuring bidding and trump.","zh":"一种荷兰的“吃墩”纸牌游戏（常见为四人两队），使用32张牌，包含叫牌与将牌（王牌）规则。"},"examples":[{"en":"We played klaverjassen after dinner while talking about the old days.","zh":"晚饭后我们一边聊天回忆往事，一边玩klaverjassen。"},{"en":"My Dutch host family taught me klaverjassen during the holidays.","zh":"假期里，我的荷兰寄宿家庭教我玩klaverjassen。"}]}],"synonyms":["Dutch card game","trick-taking game"],"phonetic":"/ˈklɑvərˌjɑsən/","extraExplanation":["文化小贴士：klaverjassen 在荷兰很常见，常被当作家庭聚会或酒吧里的传统纸牌游戏；规则因地区与牌友习惯会有小差异。","玩法概念：它属于 trick-taking（吃墩）类游戏，和 bridge（桥牌）或 euchre（尤克尔）同一大类；核心是配合队友赢“墩”并利用将牌得分。"],"etymology":"来自荷兰语：klaver（“梅花”，即扑克牌花色“clubs/梅花”）+ jassen（源自动词 jassen，和出牌、打牌的说法有关）。整体字面可理解为“玩梅花（相关的）牌”。","mnemonic":["拆开记：klaver ≈ “clover/三叶草”联想到“梅花♣”；jassen 可联想成“jazz”→聚会时玩牌很热闹。","把它想成“梅花（klaver）+ 打牌（jassen）= 玩一种和梅花花色相关的荷兰牌戏”。"]}
{"word":"klavern","summary":{"en":"Klavern means a local chapter of the Ku Klux Klan.","zh":"Klavern 指三K党的地方分会（支部）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a local chapter (branch) of the Ku Klux Klan, a white supremacist hate organization in the United States","zh":"（美国）三K党（Ku Klux Klan，白人至上主义仇恨组织）的地方分会/支部"},"examples":[{"en":"The report described how a Klavern recruited members in the region.","zh":"报告描述了该地区一个三K党地方分会如何招募成员。"},{"en":"Historians found records of several Klaverns operating in the 1920s.","zh":"历史学家发现了20世纪20年代有多个三K党分会活动的记录。"}]}],"synonyms":["KKK chapter","local chapter","branch"],"phonetic":"/ˈklævɚn/","extraExplanation":["“Klavern”主要出现在与三K党相关的历史或新闻语境中，属于高度敏感词汇；在写作或讨论时，建议明确其“仇恨组织”的性质，以避免给人中立化或美化的印象。","词形带有三K党内部常用的“Kla-”拼写风格（如“Klan”），用于营造组织内部的专门术语感；现代英语中一般不会在日常语境使用。"]}
{"word":"klaverns","summary":{"en":"“Klaverns” means local chapters of the Ku Klux Klan (KKK).","zh":"“Klaverns”指三K党的地方分会/支部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"local chapters (branches) of the Ku Klux Klan (KKK), a white-supremacist extremist organization in the United States","zh":"（美国）三K党（Ku Klux Klan, KKK）的地方分会/支部；白人至上主义极端组织的基层组织"},"examples":[{"en":"In the 1920s, Klaverns operated in many towns and held public rallies.","zh":"在20世纪20年代，许多城镇都有三K党的地方分会，并举行公开集会。"},{"en":"Some historical records describe how Klaverns tried to influence local politics.","zh":"一些历史记录描述了这些地方分会如何试图影响地方政治。"}]}],"synonyms":["KKK chapters","local Klan chapters","Klan chapters"],"phonetic":"ˈkleɪvɝnz","extraExplanation":["“Klavern”是三K党内部对“地方组织/分会”的专用称呼；复数为“Klaverns”。这一词常见于历史研究、档案材料或新闻报道中，用来指该组织在不同地区的基层单位。由于三K党与种族主义暴力和恐吓密切相关，现代语境中使用该词通常带有强烈的历史与道德指向，需谨慎对待其语境与目的。"]}
{"word":"klavier","summary":{"en":"“Klavier” is a German-derived word meaning a keyboard instrument, especially a piano, often seen in classical music titles.","zh":"“Klavier”源自德语，指键盘乐器，尤指钢琴，常见于古典音乐作品标题与相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from German) a keyboard instrument, especially a piano; sometimes used more broadly to mean “keyboard” (including harpsichord/clavichord) in music history or in titles of classical works.","zh":"（源自德语）键盘乐器，尤指钢琴；在音乐史语境或古典作品标题中，有时也泛指键盘乐器（如大键琴、击弦古钢琴等）。"},"examples":[{"en":"She studied the Klavier pieces by Mozart for her recital.","zh":"她为独奏会练习了莫扎特的《Klavier》（键盘）作品。"},{"en":"In German, “Klavier” can mean “piano” in everyday speech.","zh":"在德语日常用法中，“Klavier”常常就是“钢琴”的意思。"},{"en":"Bach’s The Well-Tempered Clavier is famous among keyboard players.","zh":"巴赫的《平均律钢琴曲集》（The Well-Tempered Clavier）在键盘演奏者中非常有名。"}]}],"synonyms":["piano","keyboard","harpsichord","clavichord"],"phonetic":"/klɑˈviɚ/","extraExplanation":["“Klavier”主要是德语词。在英语里它不算常用日常词汇，更多出现在古典音乐语境（尤其是作品名、学术写作、唱片曲目单）。","著名作品名：Bach《The Well-Tempered Clavier》（德语 Das Wohltemperierte Klavier）。这里的“Clavier/Klavier”是较旧的拼写/用法，强调“键盘乐器”而不一定只限定为现代钢琴。"]}
{"word":"klaxon","summary":{"en":"A klaxon is a very loud warning horn or siren; it can also mean to sound such an alarm.","zh":"klaxon 指很响的警报喇叭/警报器；也可作动词表示发出这种警报声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very loud alarm horn or siren used as a warning signal (often on vehicles, in factories, or for emergency alerts)","zh":"（用于警报的）高分贝喇叭；警报器（常见于车辆、工厂或紧急警报系统）"},"examples":[{"en":"The fire drill started when the klaxon blared through the hallway.","zh":"消防演习开始时，警报器在走廊里刺耳地响了起来。"},{"en":"A klaxon on the ship warned everyone to put on life jackets.","zh":"船上的警报器提醒所有人穿上救生衣。"},{"en":"When the timer reached zero, a klaxon sounded to signal the end of the test.","zh":"计时归零时，警报器响起，表示测试结束。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a loud warning sound like a siren or alarm horn","zh":"（像警报器一样）发出刺耳的警报声"},"examples":[{"en":"At noon, the factory sirens klaxoned across the neighborhood.","zh":"中午时分，工厂的警报声在社区上空响起。"},{"en":"The alarm suddenly klaxoned, and everyone stopped what they were doing.","zh":"警报突然尖鸣，大家都停下了手头的事。"}]}],"synonyms":["siren","alarm","warning horn","horn","air-raid siren"],"phonetic":"/ˈklæk.sən/","extraExplanation":["“Klaxon”最初是一个品牌名（早期电喇叭/警报器），后来在英语里常被当作普通名词使用。","在新闻、小说或影视里，klaxon 常用来营造紧张感：它通常不是普通“car horn”，而是更像“紧急警报/空袭警报”那种刺耳、压迫感强的声音。"]}
{"word":"klaxons","summary":{"en":"“Klaxons” means loud warning sirens, especially for emergencies.","zh":"“Klaxons”指（紧急情况下使用的）高声警报器/汽笛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A loud warning siren or horn, especially one used for emergencies (for example, on vehicles, in factories, or during air-raid alerts).","zh":"（通常指紧急情况使用的）高声警报器/汽笛，例如警车、工厂或防空警报。"},"examples":[{"en":"The klaxons sounded and everyone evacuated the building.","zh":"警报器响了，所有人都撤离了大楼。"},{"en":"We heard klaxons from the street as an ambulance rushed by.","zh":"救护车疾驰而过时，我们从街上听到刺耳的警报声。"},{"en":"The city tested the emergency klaxons at noon.","zh":"中午城市进行了紧急警报器的测试。"}]}],"synonyms":["sirens","alarms","horns","warning sirens"],"phonetic":"/ˈklæk.sənz/","extraExplanation":["“klaxon”最早是一个品牌名，后来变成通用词，用来指那种非常刺耳、用于警告的喇叭/警报声。","在文学或新闻中，“klaxons”常用来营造紧张、危机逼近的氛围（例如灾难、战争、警车追逐等场景）。","“klaxons”是复数形式；单数是“a klaxon”。也常见搭配：the klaxons blared/sounded（警报器大作/响起）。"]}
{"word":"Klea","summary":{"en":"a female first name, often linked to the idea of fame or glory","zh":"女性名字，常与“名声/荣耀”的含义相关"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name, used in several cultures (often as a variant of Clea/Kleia), sometimes interpreted as meaning “fame” or “glory” based on Greek roots","zh":"女性名字；在多种文化中使用（常被视为 Clea/Kleia 的变体）；常被解释为与“名声/荣耀”相关（源自希腊语词根）"},"examples":[{"en":"Klea moved to New York for graduate school.","zh":"Klea 去纽约读研究生。"},{"en":"Our new teammate is named Klea.","zh":"我们的新队友叫 Klea。"},{"en":"Klea is a popular girl’s name in some Balkan communities.","zh":"在一些巴尔干地区社群中，Klea 是较常见的女孩名。"}]}],"synonyms":["Clea","Kleia","Clio"],"phonetic":"/ˈkliːə/","extraExplanation":["英语里人名通常首字母大写（Klea），发音与拼写可能因家庭语言/地区而略有不同。若你指的是具体人物、品牌或作品名，也可能有不同含义。"],"etymology":"多被视为希腊语来源名字的变体（如 Kleia/Clea），与希腊语词根 *kleos*（“名声、荣誉”）相关；也常见于巴尔干地区（如阿尔巴尼亚）作为现代人名使用。","mnemonic":["联想希腊语 *kleos*≈“clue/clear（清楚被看见）→有名气”，记成“清清楚楚被大家看到＝有名/荣耀”。"]}
{"word":"kleagle","summary":{"en":"A kleagle is a (historical) recruiter/organizer for the Ku Klux Klan.","zh":"kleagle 指（历史上）三K党的招募员/组织者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A recruiter or organizer for the Ku Klux Klan, especially one who recruited new members.","zh":"（历史用语）三K党（Ku Klux Klan）的招募员/组织者，尤指负责吸收新成员的人。"},"examples":[{"en":"In the 1920s, a kleagle might visit towns to recruit members for the Klan.","zh":"在20世纪20年代，所谓的 kleagle 可能会走访城镇，为三K党招募成员。"},{"en":"The newspaper article described how a kleagle organized local meetings.","zh":"那篇报纸文章描述了一名 kleagle 如何组织地方集会。"}]}],"synonyms":["recruiter (general)","organizer (general)"],"phonetic":"/ˈkliːɡəl/","extraExplanation":["这个词与美国白人至上主义与种族恐怖的历史密切相关，属于强烈负面且具有伤害性的语境。阅读历史材料时可能会遇到，但在日常交流中通常不使用。","词源上，三K党内部常用一些听起来“神秘/夸张”的头衔来包装组织结构；kleagle 就是其中之一，用来指招募新成员、扩张势力的人。"]}
{"word":"kleagles","summary":{"en":"“Kleagles” means recruiters/organizers for the Ku Klux Klan (historical term).","zh":"“kleagles”指三K党的招募人员／组织入会者（历史用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a recruiter or membership organizer for the Ku Klux Klan (KKK) (historical; offensive association).","zh":"三K党（Ku Klux Klan, KKK）的招募人员／拉会员的人（历史用语；与仇恨组织相关，具有冒犯性联想）。"},"examples":[{"en":"In the 1920s, kleagles traveled town to town trying to recruit new members.","zh":"在20世纪20年代，kleagles 会从一个城镇到另一个城镇，试图招募新成员。"},{"en":"The article mentions kleagles as part of the Klan’s organizational structure.","zh":"这篇文章提到 kleagles 是三K党组织结构的一部分。"}]}],"synonyms":["Klan recruiter","membership organizer"],"phonetic":"/ˈkliːɡəlz/","extraExplanation":["“Kleagle”是三K党内部使用的头衔之一，常指负责招募、宣传和组织入会的人；“kleagles”是其复数形式。","该词几乎只出现在历史研究、新闻报道或讨论美国种族主义与极端主义的语境中；在日常英语里很少使用。","由于与宣扬白人至上、反犹主义与暴力恐吓等仇恨活动相关，使用或引用时需注意语境与表达目的，避免误用造成伤害。"]}
{"word":"klebsiella","summary":{"en":"Klebsiella is a genus of bacteria that can cause serious infections, especially in healthcare settings.","zh":"Klebsiella（克雷伯氏菌属）是一类细菌，尤其在医疗环境中可能引起较严重的感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of bacteria that can cause infections (especially pneumonia, urinary tract infections, or bloodstream infections), often in hospitals; some strains are resistant to antibiotics","zh":"克雷伯氏菌属（常见致病细菌之一），可引起感染（尤其是肺炎、尿路感染或血流感染），在医院环境中更常见；部分菌株对抗生素耐药"},"examples":[{"en":"The lab report showed Klebsiella in the urine culture.","zh":"化验报告显示尿培养中有克雷伯氏菌。"},{"en":"Doctors are monitoring the patient for a possible Klebsiella pneumonia infection.","zh":"医生正在监测患者是否可能为克雷伯氏菌肺炎感染。"},{"en":"Good hand hygiene helps prevent the spread of Klebsiella in hospitals.","zh":"良好的手卫生有助于防止医院内克雷伯氏菌的传播。"}]}],"synonyms":["Klebsiella pneumoniae (specific species)","K. pneumoniae (abbrev.)"],"phonetic":"/ˌklɛb.siˈɛl.ə/","extraExplanation":["“Klebsiella”是细菌属名，来自德国微生物学家Theodor Klebs的姓氏；常见相关表达包括“Klebsiella pneumoniae（肺炎克雷伯菌）”“Klebsiella infection（克雷伯菌感染）”。","在新闻或医疗语境中，你也可能看到“drug-resistant Klebsiella（耐药克雷伯菌）”或“carbapenem-resistant Klebsiella/CRE（碳青霉烯耐药的肠杆菌科细菌，其中可包括克雷伯菌）”，强调治疗更困难。"]}
{"word":"kleeneboc","summary":{"en":"“kleeneboc” isn’t standard; you probably meant “Kleenex,” a common word for facial tissue.","zh":"“kleeneboc”不是常见英语；你可能想写“Kleenex”，口语里常指面纸/纸巾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “Kleenex”) a brand name commonly used to mean a facial tissue.","zh":"（可能想写：Kleenex）纸巾品牌名，口语中常泛指“面纸/抽纸”。"},"examples":[{"en":"Do you have a Kleenex?","zh":"你有纸巾吗？（口语常说 Kleenex）"},{"en":"He grabbed a Kleenex and wiped his nose.","zh":"他拿了一张纸巾擦了擦鼻子。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) to wipe or blow your nose with a tissue.","zh":"（非正式）用纸巾擦鼻子/擤鼻涕。"},"examples":[{"en":"She Kleenexed her nose quietly during the movie.","zh":"电影里她悄悄用纸巾擤了擤鼻子。"}]},{"partOfSpeech":"other","definition":{"en":"“kleeneboc” is not a standard English word; it may be a misspelling of “Kleenex” or another brand/product name.","zh":"“kleeneboc”不是标准英语单词；可能是“Kleenex”或其他品牌/产品名的拼写错误。"},"examples":[{"en":"Did you mean “Kleenex” (tissue)?","zh":"你是想写“Kleenex”（纸巾）吗？"}]}],"synonyms":["tissue","facial tissue"],"phonetic":"/ˈkliːnɛks/","extraExplanation":["“Kleenex”原本是商标名，但在日常英语里常被“泛化”成普通名词，像有人会用它指任何品牌的纸巾。这种现象叫“商标通用化”（类似的还有“Band-Aid”“Q-tip”等）。在正式写作里更建议写 tissue / facial tissue。"]}
{"word":"kleenebok","summary":{"en":"“kleenebok” isn’t a standard word; it’s likely meant to be “Kleenex” or “Reebok.”","zh":"“kleenebok”不是标准词；很可能是想写“Kleenex”或“Reebok”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or playful blend. It may be intended to mean “Kleenex” (facial tissue) or “Reebok” (a sportswear brand), depending on context.","zh":"不是标准英语单词；通常是拼写错误或玩笑式拼合词。可能想写的是“Kleenex”（纸巾品牌/面巾纸）或“Reebok”（运动品牌），需结合语境判断。"},"examples":[{"en":"I can’t find “kleenebok” in a dictionary—did you mean “Kleenex” or “Reebok”?","zh":"我在词典里找不到“kleenebok”——你是想写“Kleenex”还是“Reebok”？"},{"en":"If you meant tissues, you can say: “Do you have a Kleenex?”","zh":"如果你指纸巾，可以说：“Do you have a Kleenex?”（你有纸巾吗？）"},{"en":"If you meant the brand, you can say: “He bought a pair of Reeboks.”","zh":"如果你指品牌，可以说：“He bought a pair of Reeboks.”（他买了一双锐步鞋。）"}]}],"phonetic":"/ˈkliːnibɑːk/","extraExplanation":["“Kleenex”是美国常见商标名，口语里常被当作“纸巾/面巾纸”的泛称使用（类似把某些品牌名当作物品名）。如果你提供一句完整句子或你想表达的中文意思，我可以帮你确定最可能的目标词并给出更准确的释义与用法。"]}
{"word":"kleenex","summary":{"en":"Kleenex is a tissue brand name that many people use to mean any facial tissue.","zh":"Kleenex 是纸巾品牌名，但很多人把它当作“面巾纸/纸巾”的通用说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for a disposable tissue; often used as a common word for any facial tissue.","zh":"一次性纸巾的品牌名；在口语中常被当作普通名词，用来指任何面巾纸/纸巾。"},"examples":[{"en":"Do you have a Kleenex? I need to blow my nose.","zh":"你有纸巾吗？我想擤鼻涕。"},{"en":"He handed me a Kleenex when I started crying.","zh":"我开始哭的时候，他递给我一张纸巾。"},{"en":"In some places, people say “Kleenex” even when the tissue isn’t that brand.","zh":"在一些地方，人们就算用的不是那个牌子，也会说“Kleenex”来指纸巾。"}]}],"synonyms":["tissue","facial tissue"],"phonetic":"/ˈkliːnɛks/","extraExplanation":["“Kleenex”是一个典型的“商标泛化”（brand name becoming a generic term）例子：品牌名在日常使用中变成了某类产品的通用叫法，类似英语里有人用“Band-Aid”泛指创可贴。正式写作中通常用“tissue”更中性、更准确。"]}
{"word":"kleig","summary":{"en":"“Kleig” is most commonly a misspelling of “Klieg,” meaning a powerful studio spotlight used in film/photo settings.","zh":"“kleig”多为“Klieg”的误拼，指电影/摄影棚里使用的强力聚光灯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually written “Klieg”) a very bright studio spotlight, especially one used in filmmaking or photography.","zh":"（通常写作“Klieg”）强力摄影棚聚光灯；尤指电影或摄影用的高亮灯。"},"examples":[{"en":"The actor blinked under the Klieg lights during the interview.","zh":"演员在采访时被强光摄影灯照得直眨眼。"},{"en":"They set up Kliegs to light the scene evenly.","zh":"他们架起强力聚光灯，让场景受光更均匀。"}]}],"synonyms":["spotlight","studio light","floodlight"],"phonetic":"/kliːɡ/","extraExplanation":["“Klieg / Klieg light”源自早期电影照明设备制造商Kliegl Brothers（Kliegl兄弟公司）的品牌名，后来在英语里常被当作普通名词使用，表示“摄影棚强光灯”。","你输入的“kleig”更常见的拼写是“Klieg”。在现代语境里，人们也常直接说“studio lights / spotlights”。"]}
{"word":"Klein-related","summary":{"en":"connected to Klein (especially Klein-named concepts in math/physics).","zh":"与“克莱因”相关的（尤指数学/物理中以其命名的概念）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with (or derived from) the work, ideas, or named concepts of someone called Klein—especially in math/physics, Felix Klein (e.g., the Klein bottle or Klein group).","zh":"与“克莱因”（Klein）相关的；尤指与数学/物理中以费利克斯·克莱因命名的概念有关（如克莱因瓶、克莱因群）。"},"examples":[{"en":"The paper studies a Klein-related topological surface known as the Klein bottle.","zh":"这篇论文研究一种与克莱因相关的拓扑曲面——克莱因瓶。"},{"en":"We used a Klein-related symmetry argument to simplify the model.","zh":"我们用一个与克莱因相关的对称性论证来简化模型。"}]},{"partOfSpeech":"adj.","definition":{"en":"more generally, associated with a person, brand, or topic named Klein (in context, the field usually makes clear which one).","zh":"更一般地说：与名为 Klein 的人物、品牌或议题有关（通常由语境/领域决定具体指谁）。"},"examples":[{"en":"This archive contains Klein-related correspondence from the 1930s.","zh":"这份档案包含 1930 年代与 Klein 相关的通信。"},{"en":"The exhibit includes Klein-related sketches and notes.","zh":"展览包含与 Klein 相关的素描和笔记。"}]}],"synonyms":["Kleinian","Klein-associated","Klein-connected"],"phonetic":"ˈklaɪn rɪˈleɪtɪd","extraExplanation":["在数学里最常见的语境是费利克斯·克莱因（Felix Klein, 1849–1925）：例如 Klein bottle（克莱因瓶，一种不可定向曲面）和 Klein group（克莱因四元群）。","因为 Klein 是常见姓氏，“Klein-related”在非数学语境下可能指其他 Klein（如不同学者、艺术家或品牌）。阅读时可用上下文判断。"],"etymology":"由专有名词 Klein（德语姓氏，常译“克莱因”）+ related（“相关的”）构成的复合形容词；常用于学术写作中，表示“与某位 Klein 或以其命名的概念有关”。","mnemonic":["把它拆开记：Klein + related = “和克莱因有关的”。遇到 Klein bottle / Klein group 时就能立刻联想到。"]}
{"word":"kleinian","summary":{"en":"Kleinian means “related to Klein,” most often Felix Klein in mathematics/geometry or Melanie Klein in psychoanalysis.","zh":"Kleinian 意为“与克莱因有关”，常指数学/几何中的费利克斯·克莱因，或精神分析中的梅兰妮·克莱因及其学派。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the mathematician Felix Klein or to his work, especially Klein’s ideas in geometry (e.g., Klein geometry, the Klein bottle).","zh":"（数学）与数学家费利克斯·克莱因（Felix Klein）或其研究有关的，尤指克莱因在几何学中的思想（如克莱因几何、克莱因瓶）。"},"examples":[{"en":"The course includes Kleinian geometry and its links to symmetry.","zh":"这门课包括克莱因几何及其与对称性的联系。"},{"en":"A Kleinian model can describe certain non-Euclidean geometries.","zh":"克莱因式模型可以描述某些非欧几里得几何。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the psychoanalyst Melanie Klein or to her school of psychoanalysis (Kleinian analysis), focusing on early childhood development and unconscious fantasy.","zh":"（心理分析）与精神分析学家梅兰妮·克莱因（Melanie Klein）或其学派有关的（克莱因学派/克莱因式分析），强调早期儿童发展与无意识幻想。"},"examples":[{"en":"She read a Kleinian account of how children handle anxiety.","zh":"她读到一篇克莱因学派关于儿童如何处理焦虑的论述。"},{"en":"In Kleinian theory, play can reveal a child’s inner conflicts.","zh":"在克莱因学派理论中，游戏可以揭示儿童的内在冲突。"}]}],"synonyms":["Klein-related","Kleinian geometry (math usage)","Kleinian analysis (psychology usage)"],"phonetic":"/ˈklaɪniən/","extraExplanation":["“Kleinian”来自专有名词“Klein”（克莱因）+ 形容词后缀“-ian”，表示“与某人/某学派/某思想有关”。在学术语境里常见于数学（Felix Klein）与精神分析（Melanie Klein）两条不同传统，需结合上下文判断。"]}
{"word":"kleinite","summary":{"en":"Kleinite is a rare mercury-related mineral name used mainly in geology/mineralogy.","zh":"Kleinite 是一种罕见的含汞相关矿物名称，主要出现在地质/矿物学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a mercury ammonium sulfate) found in some mercury ore deposits; it is mainly discussed in geology and mineralogy.","zh":"一种罕见矿物（含汞与铵的硫酸盐类矿物），可见于某些汞矿床中；主要用于地质学与矿物学语境。"},"examples":[{"en":"Kleinite is rarely mentioned outside of mineralogy textbooks.","zh":"除矿物学教材外，人们很少提到 kleinite。"},{"en":"The museum label listed kleinite among several mercury-related minerals from the deposit.","zh":"博物馆标签把 kleinite 列在该矿床的几种“含汞矿物”之中。"}]}],"synonyms":["(no common everyday synonyms)"],"phonetic":"/ˈklaɪnaɪt/","extraExplanation":["这是一个专业词汇，日常英语中几乎不会用到；更常见的学习重点通常是 *mineral*（矿物）、*ore*（矿石）、*deposit*（矿床）等。","词尾 *-ite* 常见于矿物名称（如 *calcite*, *halite*），通常表示“某种矿物/岩石”。"]}
{"word":"Kleist-inspired","summary":{"en":"Influenced by Heinrich von Kleist’s literary/dramatic style or themes.","zh":"受德国作家克莱斯特的文学/戏剧风格或主题影响的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Influenced by the writing, themes, or dramatic style associated with Heinrich von Kleist (a German playwright and novelist), often suggesting intense emotion, moral conflict, psychological tension, or sharply turning plots.","zh":"受德国作家海因里希·冯·克莱斯特（Heinrich von Kleist）的作品主题或戏剧风格影响的；常暗示强烈情绪、道德冲突、心理张力或剧情急转。"},"examples":[{"en":"The director staged a Kleist-inspired tragedy full of sudden reversals and moral dilemmas.","zh":"导演把这部受克莱斯特启发的悲剧搬上舞台，充满了剧情急转与道德两难。"},{"en":"Her Kleist-inspired short story explores how one small mistake can destroy a life.","zh":"她那篇受克莱斯特启发的短篇小说探讨了一个小失误如何摧毁人生。"},{"en":"The film’s Kleist-inspired mood is tense and unsettling, even in quiet scenes.","zh":"这部电影带着受克莱斯特启发的气质，即使在安静的场景里也紧绷而令人不安。"}]}],"synonyms":["Kleistian","Kleist-like","Kleist-derived","Kleist-influenced","German Romantic","dramatic","tragic","psychological","intense"],"phonetic":"/klaɪst ɪnˈspaɪɚd/","extraExplanation":["克莱斯特（1777–1811）是德语文学的重要作家，代表作常被认为具有强烈冲突、命运感与心理张力；常见联想包括《破瓮记》（The Broken Jug）、《洪堡亲王》（Prince of Homburg）、《迈克尔·科尔哈斯》（Michael Kohlhaas）。","在英语里，“X-inspired”通常表示“受X启发/影响”，X可以是作家、艺术家、文化或具体作品；用于学术评论或影评、书评中较常见。"],"etymology":"由专有名词 Kleist（指德国作家 Heinrich von Kleist）+ inspired（“受启发的/受影响的”）构成；常用于评论文学、戏剧、电影等作品的风格或主题取向。","mnemonic":["把它拆开记：Kleist + inspired = “被克莱斯特启发的”。看到 inspired 就想到“灵感来源”。","联想“克莱斯特=冲突很强的戏剧/故事”，所以 Kleist-inspired 往往意味着“紧张、急转、道德困境”。"]}
{"word":"Kleist-like","summary":{"en":"having a tense, twist-driven, psychologically intense style associated with Kleist","zh":"具有克莱斯特式的紧张、强烈心理冲突与突发转折的风格"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling the style, themes, or tone associated with the German writer Heinrich von Kleist—often tense, psychologically intense, morally ambiguous, and driven by sudden twists or extreme conflict.","zh":"（风格）类似德国作家海因里希·冯·克莱斯特的写法或气质——常带有紧张感、强烈的心理冲突、道德暧昧，以及突如其来的转折或极端对抗。"},"examples":[{"en":"The story’s abrupt reversals and mounting dread feel distinctly Kleist-like.","zh":"这个故事的突兀反转与不断累积的恐惧感，明显带有克莱斯特式的味道。"},{"en":"Her dialogue is spare and urgent, giving the whole scene a Kleist-like intensity.","zh":"她的对话简短而急迫，使整场戏呈现出克莱斯特式的强烈张力。"},{"en":"The film is Kleist-like in how it traps its characters between duty and desire.","zh":"这部电影以“责任与欲望两难夹击”来困住角色，呈现出克莱斯特式的特征。"}]}],"synonyms":["Kleistian","Kleist-esque","tragic","grim","intense","Kafkaesque"],"phonetic":"/ˈklaɪst laɪk/","extraExplanation":["克莱斯特（1777–1811）以戏剧与小说著称，常写到法律与正义的冲突、误解与偶然引爆的灾难性后果、人物在高压下的心理崩裂与道德困境。作为形容词时，更多是“气质/结构相似”，不一定表示具体致敬或改编。"],"etymology":"由专名“(Heinrich von) Kleist”加后缀“-like（像……一样）”构成；用于评论写作/戏剧/电影时，表示“具有克莱斯特式特征”。","mnemonic":["把它拆开记：Kleist + like = “像克莱斯特一样”。看到“-like”就联想到“……风格/……味道”。","联想关键词：紧（紧张）、狠（冲突）、转（反转）——“克莱斯特式：紧狠转”。"]}
{"word":"kleistian","summary":{"en":"Kleistian means “connected with Heinrich von Kleist or typical of his intense, tragic style,” and can also mean “a follower or admirer of Kleist.”","zh":"Kleistian 指“与作家克莱斯特有关或具有其强烈、悲剧性风格的”，也可指“克莱斯特的追随者/崇拜者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the German writer Heinrich von Kleist (1777–1811) or to the themes, style, and tone found in his works (often tense, psychologically intense, and tragic).","zh":"与德国作家海因里希·冯·克莱斯特（Heinrich von Kleist，1777–1811）有关的；或指其作品中常见的主题、文风与氛围（常带紧张、心理强度高、偏悲剧色彩）。"},"examples":[{"en":"The play’s sudden violence and moral uncertainty feel distinctly Kleistian.","zh":"这部戏里突如其来的暴力与道德上的不确定感，带有明显的“克莱斯特式”特征。"},{"en":"Her short story uses a Kleistian twist where a small mistake leads to disaster.","zh":"她的短篇小说用了“克莱斯特式”的转折：一个小失误最终酿成大祸。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who admires, studies, or is strongly influenced by Heinrich von Kleist.","zh":"克莱斯特的崇拜者、研究者，或深受其影响的人。"},"examples":[{"en":"As a Kleistian, he often compares modern drama to Kleist’s tragedies.","zh":"作为一名“克莱斯特派”，他常把现代戏剧与克莱斯特的悲剧作比较。"}]}],"synonyms":["Kleist-like","in the style of Kleist","Kleist-inspired"],"phonetic":"/ˈklaɪstiən/","extraExplanation":["“Kleistian”是由作家姓氏“Kleist”加上形容词后缀“-ian”构成，类似“Shakespearean（莎士比亚式的）”“Kafkaesque（卡夫卡式的）”。","克莱斯特的代表作常被提到的有《破瓮记》（The Broken Jug）、《洪堡亲王》（Prince of Homburg）、《米夏埃尔·科尔哈斯》（Michael Kohlhaas）。在文学评论中，用“Kleistian”通常是在强调剧情的紧绷推进、突发转折、人物心理的激烈冲突与悲剧性后果。"]}
{"word":"Kleitos","summary":{"en":"An Ancient Greek male name, often seen in English history as Cleitus; it can refer to notable figures in Alexander’s era or Greek sculpture.","zh":"古希腊男性名字（英文中常写作 Cleitus），可指亚历山大时代人物或古希腊雕塑家等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male name from Ancient Greek, written as Kleitos (also commonly Latinized as Cleitus); it appears in several famous historical figures.","zh":"古希腊男性名字，写作 Kleitos（也常拉丁化为 Cleitus）；历史上有多位著名人物使用此名。"},"examples":[{"en":"In some English histories of Alexander the Great, Kleitos is spelled as Cleitus.","zh":"在一些英文的亚历山大大帝史书里，Kleitos 也会拼作 Cleitus。"},{"en":"Kleitos is a Greek name that shows up in both art history and military history.","zh":"Kleitos 这个希腊名字在艺术史和军事史中都能见到。"}]},{"partOfSpeech":"n.","definition":{"en":"Most commonly, a reference to Kleitos (Cleitus) the Black, a Macedonian officer and companion of Alexander the Great in the 4th century BCE.","zh":"最常见的特指用法：指“黑色克利托斯”（Kleitos/Cleitus the Black），公元前4世纪亚历山大大帝麾下的马其顿将领与亲信之一。"},"examples":[{"en":"Cleitus (Kleitos) the Black is known for saving Alexander’s life at the Battle of the Granicus.","zh":"“黑色克利托斯”（Cleitus/Kleitos）以在格拉尼库斯河战役中救过亚历山大的命而闻名。"},{"en":"The story of Kleitos and Alexander is often told as a tragedy of pride and anger.","zh":"Kleitos 与亚历山大的故事常被讲成一出关于骄傲与愤怒的悲剧。"}]},{"partOfSpeech":"n.","definition":{"en":"A reference to Kleitos (Cleitus) the Elder, an important Ancient Greek sculptor associated with a canon of ideal proportions.","zh":"也可指“老克利托斯”（Kleitos/Cleitus the Elder），古希腊重要雕塑家之一，与理想比例的规范传统有关。"},"examples":[{"en":"Some textbooks mention Kleitos the Elder alongside other Classical Greek sculptors.","zh":"一些教材会把老克利托斯与其他古典时期希腊雕塑家并列提及。"},{"en":"Kleitos is sometimes discussed in relation to how the Greeks imagined the ‘ideal’ body.","zh":"谈到希腊人如何想象“理想人体”时，有时会提到 Kleitos。"}]}],"synonyms":["Cleitus"],"phonetic":"/ˈklaɪtoʊs/","extraExplanation":["英文资料里 Kleitos 与 Cleitus 常指同一个人名（只是不同转写/拼法）。读历史书时可以把它当作“同名异拼”。","如果你在亚历山大大帝相关内容里看到 Kleitos，通常指的是 Cleitus the Black；在艺术史/雕塑史语境里则更可能指 Kleitos the Elder。"],"etymology":"源自古希腊语人名 Κλεῖτος（Kleitos），与“名声、荣耀”（kleos）相关的词根有关；英语中常见的拼写 Cleitus 来自拉丁化/英译传统。","mnemonic":["把 Kleitos 记成“kleos（荣耀/名声）+ 人名后缀”，可以联想到“有名的人”。","遇到 Cleitus 也别慌：多半就是 Kleitos 的另一种拼法，读音和指代通常一致。"]}
{"word":"klendusic","summary":{"en":"“klendusic” is most likely a surname or username, not a common English word.","zh":"“klendusic”很可能是姓氏或用户名，并非常见英文单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (most likely a surname or username). It is not a standard English vocabulary word.","zh":"专有名词（很可能是姓氏或用户名），不是标准英语词汇。"},"examples":[{"en":"I saw “klendusic” as a username in an online forum.","zh":"我在一个网络论坛里看到“klendusic”作为用户名。"},{"en":"Ms. Klendusic will join the meeting at 3 p.m.","zh":"Klendusic 女士会在下午三点参加会议。"}]}],"synonyms":["(proper name; no true synonyms)"],"phonetic":"/klɛnˈduːzɪk/","extraExplanation":["“Klendusic”看起来更像是源自南斯拉夫/巴尔干地区的姓氏拼写（例如克罗地亚、塞尔维亚等语言背景常见的字母组合），因此在英语里通常按人名处理：首字母大写（Klendusic），用作姓氏或账号名。","如果你是想查一个英文单词，可能存在拼写误差。你可以告诉我它出现的句子或上下文，我可以帮你判断是否应为另一个词（例如相近拼写的英文词或姓名）。"]}
{"word":"klendusity","summary":{"en":"“klendusity” isn’t a recognized English word; it likely refers to “clandestinity,” meaning secrecy or hidden activity.","zh":"“klendusity”不是规范英语词；很可能是“clandestinity”，表示“秘密/隐蔽的状态或活动”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“klendusity” is not a standard English word. It looks like a misspelling of “clandestinity” (the state of being secret or hidden).","zh":"“klendusity”不是标准英语单词，看起来像是“clandestinity”的拼写错误，意为“秘密/隐蔽的状态”。"},"examples":[{"en":"I couldn’t find “klendusity” in a dictionary—did you mean “clandestinity”?","zh":"我在词典里找不到“klendusity”——你是不是想写“clandestinity”？"},{"en":"The deal was done in clandestinity, away from reporters.","zh":"这笔交易在秘密状态下完成，避开了记者。"}]},{"partOfSpeech":"n.","definition":{"en":"clandestinity: the condition of being done secretly, often because it is illegal or disapproved of.","zh":"clandestinity：秘密进行的状态，常因违法或不被认可而隐蔽。"},"examples":[{"en":"The group operated in clandestinity for years.","zh":"这个组织多年在秘密状态下活动。"},{"en":"There was an air of clandestinity around the late-night meetings.","zh":"深夜会议带着一种隐秘的气氛。"}]}],"synonyms":["secrecy","secretiveness","covert activity","stealth","privacy"],"phonetic":"/klænˈdɛstənɪti/","extraExplanation":["“clandestinity”来自形容词“clandestine”（秘密的）。更常见的日常表达是“in secret / secretly / underground”。如果你告诉我“klendusity”出现的句子或语境，我也可以帮你确认最可能的正确拼法。"]}
{"word":"klendusive","summary":{"en":"“Klendusive” is not standard English; you probably mean “conclusive” (decisive, leaving no doubt).","zh":"“klendusive”不是标准英语；你很可能想写“conclusive”（决定性的、不容置疑的）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or mishearing of “conclusive.”","zh":"不是标准英语单词；很可能是把 “conclusive” 拼错或听错了。"},"examples":[{"en":"I couldn’t find “klendusive” in the dictionary—did you mean “conclusive”?","zh":"我在词典里找不到 “klendusive”，你是不是想写 “conclusive”？"},{"en":"The results were conclusive, so the debate ended.","zh":"结果是决定性的，所以争论结束了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended word) “conclusive”: proving something clearly; leaving no doubt; decisive.","zh":"（可能你想写的词）“conclusive”：能清楚证明某事的；不容置疑的；决定性的。"},"examples":[{"en":"We still don’t have conclusive evidence.","zh":"我们仍然没有确凿的证据。"},{"en":"The final test was conclusive and confirmed the diagnosis.","zh":"最后的检测具有决定性，证实了诊断。"}]}],"synonyms":["decisive","definitive","certain","clear-cut"],"phonetic":"/kənˈkluːsɪv/","extraExplanation":["“conclusive”常见搭配：conclusive evidence（确凿证据）、conclusive proof（决定性证明）、conclusive results（明确/决定性的结果）。","如果你是在表达“包含所有人/不排除任何人”，你可能想要的是 “inclusive”（包容的；包含在内的）。如果你告诉我原句，我可以帮你确认最合适的词。"]}
{"word":"Kleo","summary":{"en":"a personal name, often related to Cleo/Cleopatra and linked to a Greek root meaning “glory.”","zh":"人名用法：常与 Cleo/Cleopatra 相关，带有希腊语“荣耀/名声”的词源含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name, often used as a short form of names like “Cleopatra,” and sometimes used independently as a modern name","zh":"人名：常作为“Cleopatra（克娄巴特拉）”等名字的昵称/简写，也可作为独立的现代名字使用"},"examples":[{"en":"Kleo is a nickname for Cleopatra in some contexts.","zh":"在某些语境里，Kleo 是 Cleopatra 的昵称。"},{"en":"Her stage name is Kleo.","zh":"她的艺名是 Kleo。"}]},{"partOfSpeech":"other","definition":{"en":"a spelling variant of “Clio/Cleo,” associated with Greek roots meaning “glory” and sometimes linked to the Muse of history in Greek mythology","zh":"拼写变体：与 Clio/Cleo 相关，源自希腊语词根“荣耀/名声”，有时也让人联想到希腊神话中的历史缪斯（Clio）"},"examples":[{"en":"The name Kleo echoes the Greek idea of fame or glory.","zh":"Kleo 这个名字带有希腊语里“名声/荣耀”的意涵。"},{"en":"In mythology, Clio is the Muse of history; Kleo can feel similar in style.","zh":"在神话里 Clio 是历史缪斯；Kleo 在风格上给人相近的感觉。"}]}],"synonyms":["Cleo","Clio","Cleopatra"],"phonetic":"/ˈkliːoʊ/","extraExplanation":["作为人名时，Kleo 的读音与更常见的 Cleo 通常相同。用于英语语境里，多数人会把它当作独特拼写的 Cleo。","如果你指的是影视/游戏/品牌名中的 “Kleo”，具体含义可能取决于作品设定；给我上下文我可以更精准解释。"],"etymology":"多见作人名拼写。常被视为 Cleopatra 的昵称/简写；也可与希腊语 kleos（意为“荣耀、名声”）同源的名字传统相关，英语里常见近形为 Cleo/Clio。","mnemonic":["联想中文“克-里-欧”（k-lee-oh）三段式发音，读起来像“克里欧”。","记词源：kleo ~ kleos（荣耀/名声）→ 想成“名字要出名=有荣耀”。"]}
{"word":"Kleon","summary":{"en":"a male name, also the Greek-form spelling of the Athenian figure often written as Cleon","zh":"男性名字；也可指常写作 Cleon 的那位雅典人物的希腊式拼写"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name; a variant spelling of Cleon, used in some English contexts to reflect the original Greek form","zh":"男性名字；“Cleon”的一种拼写变体，在英语中有时用来更贴近希腊语原拼法"},"examples":[{"en":"Kleon is a common transliteration used in some books about ancient Greece.","zh":"在一些关于古希腊的书里，Kleon 是常见的音译写法。"},{"en":"They named their son Kleon after a historical figure.","zh":"他们以一位历史人物为名，给儿子取名叫 Kleon。"}]},{"partOfSpeech":"n.","definition":{"en":"an Athenian politician and military leader from the Peloponnesian War era (often spelled Cleon in English)","zh":"伯罗奔尼撒战争时期的雅典政治家兼将领（英语里常拼作 Cleon）"},"examples":[{"en":"In many English translations, Kleon appears as Cleon.","zh":"在许多英文译本中，Kleon 会写成 Cleon。"},{"en":"Kleon is discussed as a powerful voice in Athenian democratic politics.","zh":"Kleon 常被讨论为雅典民主政治中很有影响力的声音。"}]}],"synonyms":["Cleon"],"phonetic":"ˈkliːɑːn","extraExplanation":["在英语世界里，历史人物的名字常有不同拼写：比如用拉丁化传统写法（Cleon）或更贴近希腊字母的转写（Kleon）。两者通常指同一人，差别主要在拼写习惯与学术体系。"],"etymology":"源自古希腊语 Kleōn（Κλέων），与 kleos（κλέος，“名声、荣耀”）同源；英语中更常见拼写为 Cleon，Kleon 多用于更“希腊化”的转写。","mnemonic":["联想希腊词根 kleos（“荣耀/名声”）：Kleon ≈ “带来名声的人”。","记拼写：K- 开头常见于“更希腊化”的转写（Kleon），而日常英语更常见 C-（Cleon）。"]}
{"word":"klepht","summary":{"en":"A Greek mountain bandit or guerrilla fighter, especially during Ottoman rule; sometimes viewed as a resistance hero.","zh":"指奥斯曼时期希腊山区的山贼或游击战士；有时也被视为反抗者/民族英雄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of a group of Greek bandits or guerrilla fighters, especially in the mountains during the Ottoman period; often seen as both outlaw and freedom fighter.","zh":"（尤指奥斯曼统治时期希腊山区的）克莱夫特：一类希腊山贼/游击战士，常被视为既是“亡命之徒”也可能是“反抗者/自由斗士”。"},"examples":[{"en":"In some histories, the klephts are described as bandits who later became symbols of resistance.","zh":"在一些历史叙述中，克莱夫特最初被描写为山贼，后来却成了反抗的象征。"},{"en":"The novel mentions a klepht band hiding in the mountains.","zh":"小说里提到一伙克莱夫特藏在山中。"}]}],"synonyms":["brigand","bandit","guerrilla","outlaw"],"phonetic":"/klɛft/","extraExplanation":["“klepht”来自希腊语 κλέφτης（kléftis，“小偷/盗贼”），与英语词根“klepto-”（如 kleptomania 偷窃癖）同源。","在希腊文化语境里，klepht 常带有复杂评价：既可能指抢掠的匪徒，也可能被浪漫化为反抗奥斯曼统治的游击者；民歌（klephtic songs）中常出现对他们的描写。"]}
{"word":"klepht-like","summary":{"en":"having the look or spirit of Greek mountain fighters often linked with bandit-hero imagery","zh":"带有希腊山地武装（兼具“山贼/民间英雄”意象）气质或风格的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a klepht; having the style, behavior, or image of the Greek klephts (mountain fighters often seen as bandits and folk heroes).","zh":"像希腊“klepht”（山地游击战士/绿林好汉）那样的；带有其作风、行为或形象特征的。"},"examples":[{"en":"The novel’s hero has a klepht-like swagger, living by his own rules in the mountains.","zh":"小说里的主角有一种“klepht式”的豪气，在山里按自己的规矩生活。"},{"en":"In the painting, the figure wears a klepht-like costume with a sash and weapons.","zh":"画里的人物穿着带腰带、佩武器的“klepht式”服装。"}]}],"synonyms":["bandit-like","outlaw-like","guerrilla-like","brigandish","rebellious"],"phonetic":"/ˈklɛftˌlaɪk/","extraExplanation":["在希腊历史与民间叙事中，klepht 常呈现双重形象：一方面是“山贼/抢掠者”，另一方面也被浪漫化为反抗奥斯曼统治的自由战士与民间英雄。因此 klepht-like 可能带有“桀骜不驯、带武装的山地游击/绿林气质”的联想，具体褒贬取决于语境。","常见于历史写作、文学描写与艺术评论，用来形容人物气质、服饰风格或叛逆的生活方式。"],"etymology":"源自希腊语“klephtēs”（意为“盗贼”），英语中用 klepht 指奥斯曼时期希腊山地武装/匪徒；“-like”表示“像……一样”，合起来表示“具有 klepht 特征的”。","mnemonic":["把 klepht 记成“klept-（偷）”的近亲：英语里有 kleptomaniac（盗窃癖）。klepht-like 就是“带点山贼/绿林气质的那种感觉”。"]}
{"word":"klephtic","summary":{"en":"Klephtic means “connected with the Greek klephts,” historically bandit-guerrilla figures often linked to resistance and folk culture.","zh":"klephtic 指“与希腊克莱夫特（土匪/游击者）有关的”，常用于历史、文学与民俗语境，带有抵抗与民间英雄的文化联想。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the klephts (klephtai): Greek bandits or guerrilla fighters, especially those active in the Ottoman-era Balkans and in the lead-up to Greek independence.","zh":"与“克莱夫特”（klephts/klephtai）有关的：指奥斯曼时期巴尔干地区、尤其是希腊境内的山地“土匪/游击战士”，并常与希腊独立运动的历史背景相关。"},"examples":[{"en":"The novel’s klephtic hero lives in the mountains and fights the occupiers.","zh":"小说里的“克莱夫特式”英雄生活在山中，与占领者作战。"},{"en":"Researchers examined klephtic songs to understand rural resistance and identity.","zh":"研究者通过分析“克莱夫特民歌”来理解乡村抵抗与身份认同。"}]}],"synonyms":["klepht-like","brigandish","bandit-like"],"phonetic":"/ˈklɛftɪk/","extraExplanation":["“klepht”一词源自希腊语 κλέφτης（kléftis，“盗贼”之意），与英语词根“klept-（偷窃）”同源，如“kleptomania（盗窃癖）”。因此“klephtic”在字面上带有“盗贼的”色彩，但在历史与文学语境里常指一种山地游击/反抗传统，也可带有浪漫化的“义匪”意味。","“klephtic songs（克莱夫特民歌）”是希腊民间歌曲传统的一部分，常歌唱山地生活、自由、反抗与荣誉；在文学或历史写作中，看到“klephtic”通常是在召唤这种文化意象。"]}
{"word":"klephtism","summary":{"en":"Klephtism means the bandit-and-guerrilla lifestyle associated with Greek klephts, often linked to resistance in Ottoman-era Greece.","zh":"Klephtism 指与希腊“克莱夫特”相关的劫掠式游击生活方式，常与奥斯曼时期希腊的反抗活动相联系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or way of life of klephts (Greek mountain fighters/outlaws), especially banditry and guerrilla resistance under Ottoman rule","zh":"（尤指奥斯曼统治时期）希腊“克莱夫特”（山地义匪/游击队）式的生活方式；带有劫掠色彩的游击与反抗活动"},"examples":[{"en":"Some historians describe klephtism as both banditry and a form of resistance.","zh":"一些历史学者把 klephtism 既描述为劫掠行为，也视为一种反抗形式。"},{"en":"Folk songs often celebrate klephtism as a symbol of freedom in the mountains.","zh":"民歌里常把 klephtism 赞颂为山地自由精神的象征。"}]}],"synonyms":["brigandage","banditry","guerrilla warfare","outlawry"],"phonetic":"ˈklɛftɪzəm","extraExplanation":["词源上，klepht 来自希腊语，意为“盗贼/劫掠者”，与英语词根 klept-（如 kleptomania“盗窃癖”）同源，但 klephtism 更偏向特定历史文化语境：指希腊山区义匪/游击群体的社会现象，而不是心理学意义的“偷窃冲动”。","在希腊独立运动的叙事中，klephts 常被浪漫化为自由斗士；但在现实中，他们也可能从事掠夺与收取“保护费”等活动，因此该词常带有“亦正亦邪”的历史评价。"]}
{"word":"klephts","summary":{"en":"Klephts were Greek mountain bandits/guerrillas under Ottoman rule, often remembered as freedom fighters in Greek tradition.","zh":"Klephts 指奥斯曼统治时期的希腊山地武装／游击队（也常被称为盗匪），在希腊传统中常被纪念为反抗者与自由斗士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a group of Greek bandits and guerrilla fighters who resisted Ottoman rule (especially in the 18th–19th centuries) and later became celebrated as freedom fighters in Greek history","zh":"（尤指18–19世纪）希腊的“克莱夫特”（klepht）成员：在奥斯曼统治时期活动的山地武装／游击队，既被视为盗匪也被后世歌颂为反抗者与民族英雄"},"examples":[{"en":"In the story, the klephts hide in the mountains and raid Ottoman supply lines.","zh":"在故事里，klephts 躲进山里，袭击奥斯曼军队的补给线。"},{"en":"Greek folk songs often praise klephts for their bravery and independence.","zh":"希腊民歌常常歌颂 klephts 的勇敢与不屈。"}]}],"synonyms":["Greek guerrillas","Greek bandits","freedom fighters (context-dependent)"],"phonetic":"/klɛfts/","extraExplanation":["“Klepht”（希腊语 κλέφτης）本义与“偷窃者/盗贼”相关（可联想到英语词根 *klepto-*，如 *kleptomania* “盗窃癖”）。但在历史语境中，klephts 往往兼具“山地盗匪”和“反抗奥斯曼统治的游击队”双重身份，因此在文学与民间传统里常带有浪漫化的英雄色彩。","常见相关词：*armatoles*（奥斯曼时期被授权维持治安的地方武装；有时与 klephts 互相转化或对立）。","读音提示：词尾 -phts 在英语里常简化成 /fts/ 的连读感觉。"]}
{"word":"klept","summary":{"en":"Klept- is a word part meaning “steal” or “thief,” seen in words like kleptomania and kleptocracy.","zh":"Klept- 是表示“偷/盗”或“盗贼”的词根，常见于 kleptomania（盗窃癖）、kleptocracy（盗贼统治）等词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (combining form) meaning “steal” or “thief,” used in words about stealing","zh":"（词根/构词成分）表示“偷/盗”或“盗贼”，用于与偷窃相关的词中"},"examples":[{"en":"Kleptomania is a mental health condition in which someone feels a strong urge to steal.","zh":"Kleptomania（盗窃癖）是一种心理健康问题，患者会有强烈的偷窃冲动。"},{"en":"A kleptocracy is a government run by leaders who steal money from the country.","zh":"A kleptocracy（盗贼统治/掠夺性统治）指由贪腐领导人掠夺国家财富的政府。"},{"en":"Some insects are kleptoparasites: they steal food caught by other animals.","zh":"有些昆虫是 kleptoparasites（盗食寄生者）：它们会偷走别的动物捕到的食物。"}]}],"synonyms":["steal","pilfer","rob"],"phonetic":"/klɛpt/","extraExplanation":["“klept-”来自古希腊语 *kleptein*（偷窃）。它通常不会单独当作一个完整单词使用，而是作为前缀/词根出现在较正式或学术的词里（如 *kleptomania*, *kleptocracy*）。"]}
{"word":"kleptic","summary":{"en":"Kleptic means relating to stealing or having a tendency to steal.","zh":"Kleptic 指与偷窃有关，或有偷盗倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person, habit, or system) involving stealing; having a tendency toward theft.","zh":"（指人、习惯或制度）与偷窃有关的；有偷盗倾向的。"},"examples":[{"en":"The store installed more cameras to reduce kleptic behavior.","zh":"商店安装了更多摄像头来减少偷窃行为。"},{"en":"In the novel, the kleptic character survives by pickpocketing in crowded streets.","zh":"在小说中，那个爱偷东西的角色靠在拥挤的街道上扒窃为生。"}]}],"synonyms":["thieving","stealing","sticky-fingered","light-fingered","pilfering"],"phonetic":"/ˈklɛptɪk/","extraExplanation":["“kleptic”源自希腊语词根 *klept-*（意为“偷”），常见于一些相关词：*kleptomaniac*（盗窃癖患者）、*kleptomania*（盗窃癖）、*kleptocracy*（盗贼统治／贪腐政府）。在日常英语里，“kleptic”相对少见，更常用的是“thieving / sticky-fingered / prone to stealing”。","文学或新闻写作中有时用“kleptic”来强调一种“反复、习惯性”或“系统性”的偷窃色彩，比单纯说“stolen”更带评价意味。"]}
{"word":"kleptistic","summary":{"en":"Kleptistic means ‘inclined to steal,’ but it’s rare; in most situations, people use thieving, kleptomaniac, or kleptocratic (political context).","zh":"kleptistic 表示“有偷窃倾向的”，但非常罕用；多数场合更常用 thieving、kleptomaniac，或在政治语境用 kleptocratic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Inclined to steal; having a tendency toward theft (often used humorously or informally).","zh":"（罕用）有偷窃倾向的；爱顺手牵羊的（常带玩笑或非正式语气）。"},"examples":[{"en":"He joked that his cat was a little kleptistic because it kept bringing home shiny things.","zh":"他开玩笑说他的猫有点“爱偷”，因为它总把亮闪闪的东西叼回家。"},{"en":"The article described the corrupt officials’ kleptistic habits of taking public money for themselves.","zh":"文章形容那些腐败官员有侵吞公款的“偷盗式”习惯。"}]}],"synonyms":["thieving","sticky-fingered","kleptomaniac","kleptomaniacal","kleptocratic"],"phonetic":"/klɛpˈtɪstɪk/","extraExplanation":["“kleptistic”在现代英语中非常少见，有时会被当作“自造词/非标准用法”。更常见、更自然的表达包括：\n- kleptomaniac / kleptomaniacal：指“盗窃癖（症）/ 有盗窃癖倾向的”\n- thieving：爱偷的（更口语、直接）\n- kleptocratic：指“盗贼统治的、以侵吞为特征的（政府/体制）”，多用于政治语境","词根提示：klepto- 来自希腊语，意为“偷”；常见于 kleptomania（盗窃癖）、kleptocracy（盗贼统治）。"]}
{"word":"kleptobiosis","summary":{"en":"getting food by stealing it from other animals","zh":"通过从其他动物那里偷取食物来获取食物的行为"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a behavior in which an animal gets food by stealing it (or part of it) from another animal that has already collected or caught it","zh":"（动物行为）通过从其他动物那里偷取其已捕获或已收集的食物来获取食物的行为；食物盗窃寄生"},"examples":[{"en":"Some seabirds practice kleptobiosis by snatching fish from other birds in midair.","zh":"一些海鸟会进行 kleptobiosis，在空中从其他鸟嘴里抢走鱼。"},{"en":"In the documentary, the crab used kleptobiosis to steal scraps from a larger predator.","zh":"纪录片里，那只螃蟹用 kleptobiosis 从更大的捕食者那里偷走残余食物。"},{"en":"Researchers compared kleptobiosis with hunting to see which strategy costs less energy.","zh":"研究人员把 kleptobiosis 和捕猎进行比较，看看哪种策略更省能量。"}]}],"synonyms":["food theft","stealing food","kleptoparasitism"],"phonetic":"/ˌklɛp.tə.baɪˈoʊ.sɪs/","extraExplanation":["它常出现在生态学/动物行为学语境，和更常见的术语“kleptoparasitism（盗食寄生）”相关；很多文章会把两者近似使用，但“kleptoparasitism”更强调“寄生式”的生态关系，而“kleptobiosis”更像对“偷食这种生活方式/策略”的描述。","常见场景包括：海鸟在空中抢夺猎物、鬣狗或豺从大型猫科处偷食、昆虫或甲壳类偷取其他个体的储粮/食物碎片。"],"etymology":"源自希腊语词根：klepto-（偷窃）+ -biosis（生活方式/生存状态）。该词用于动物生态学，指“以偷食为生”的取食策略。","mnemonic":["拆词记：klepto = “偷”（联想“kleptomaniac 偷窃癖”），biosis = “生活方式”，合起来就是“靠偷吃过日子”。","把它记成“klepto + b(i)o-（生物/生命）”：生物的“偷”法——偷别人的食物。"]}
{"word":"kleptobiotic","summary":{"en":"stealing food/resources from other animals as a feeding strategy","zh":"以偷抢其他动物的食物/资源为觅食策略"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Getting food or resources by stealing them from other animals, rather than finding or hunting them directly.","zh":"（生物）通过从其他动物那里“偷抢”食物或资源来获取营养，而不是自己觅食或捕猎。"},"examples":[{"en":"Frigatebirds are famous for kleptobiotic behavior, forcing other seabirds to drop their catch.","zh":"军舰鸟以典型的“盗食”行为闻名，会逼迫其他海鸟把捕到的鱼吐出或掉落。"},{"en":"The researchers recorded kleptobiotic interactions during the breeding season.","zh":"研究人员记录了繁殖季节里发生的盗食互动。"}]}],"synonyms":["kleptoparasitic","thieving","parasitic"],"phonetic":"/ˌklɛp.toʊ.baɪˈɑː.tɪk/","extraExplanation":["常见近义概念是 kleptoparasitic（盗食寄生的）：在生态学里更常用，强调“像寄生一样靠偷取别的个体的食物获利”。kleptobiotic 语感更偏“以偷食为生活方式/策略”。","典型例子包括：军舰鸟（frigatebirds）抢海鸟的鱼；某些鸥类（gulls）或贼鸥（skuas）也会追逐其他鸟类让其吐出或掉落食物。"],"etymology":"源自希腊语构词：klepto-（偷）+ bio-（生命）+ -tic（形容词后缀）。整体意思就是“以偷取方式维生的”。","mnemonic":["把它拆开记：klepto- = 偷（联想“kleptomaniac 偷窃癖”），biotic = 生物/生命 → “靠偷来活的”。","联想中文：biota=生物群落/生物，klepto=“克雷普托”听起来像“可偷”→“可偷来维生”。"]}
{"word":"kleptocracies","summary":{"en":"rule by officials who steal public wealth","zh":"掌权者系统性侵吞公共财富的统治体制"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Governments or ruling systems in which those in power steal public money and resources for personal gain.","zh":"一种由掌权者为个人利益而侵吞公共资金与资源的政府或统治体制（“盗贼统治”）。"},"examples":[{"en":"Many citizens protested because they felt they were living under kleptocracies.","zh":"许多公民上街抗议，因为他们觉得自己生活在盗贼统治之下。"},{"en":"Journalists investigated how kleptocracies hide stolen wealth through offshore accounts.","zh":"记者调查了盗贼政权如何通过离岸账户隐藏赃款。"},{"en":"In history classes, students compare kleptocracies with more accountable systems of government.","zh":"在历史课上，学生把盗贼统治与更负责任的政府体制作比较。"}]}],"synonyms":["corrupt regime","kleptocracy","plunderocracy","predatory state","graft"],"phonetic":"/ˈklɛptəˌkræsi/","extraExplanation":["它常用于政治学与新闻语境，强调“国家被当成提款机”：腐败不只是个别官员收贿，而是统治集团系统性掠夺公共财富。","近义概念里，plutocracy 强调“富人统治”，kleptocracy 强调“以偷窃和侵吞为核心的统治”。"],"etymology":"源自希腊语：kleptēs（“小偷”）+ -kratia（“统治/政体”）。字面意思就是“盗贼的统治”。英语中常用单数 kleptocracy，复数为 kleptocracies。","mnemonic":["拆词记：klepto-≈“偷”（如 kleptomaniac 偷窃癖）+ -cracy=“统治”（democracy 民主、bureaucracy 官僚体制）→“偷出来的政体”。","联想中文：把国家当“提款机”的政权＝盗贼统治。"]}
{"word":"kleptocracy","summary":{"en":"rule marked by leaders stealing public wealth","zh":"以掌权者掠夺公共财富为特征的统治/政体"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A government or ruling class in which those in power steal public money or resources for personal gain.","zh":"“盗贼政治”：掌权者通过权力侵吞公共资金或资源、以谋取私利的政权或统治集团。"},"examples":[{"en":"Many citizens protested, saying the country had become a kleptocracy.","zh":"许多公民上街抗议，说这个国家已经变成了盗贼政治。"},{"en":"In a kleptocracy, corruption is not an exception—it is the system.","zh":"在盗贼政治中，腐败不是例外，而是体制本身。"},{"en":"Journalists investigated how the kleptocracy moved money abroad through shell companies.","zh":"记者调查这个盗贼政治如何通过空壳公司把钱转移到海外。"}]}],"synonyms":["plutocracy","corruption","graft","embezzlement","misrule"],"phonetic":"/klɛpˈtɑkrəsi/","extraExplanation":["常与“corruption（腐败）”“cronyism（裙带关系）”“embezzlement（贪污/挪用）”一起出现。它通常用于批评性的政治语境，强调“国家资源被当作私产掠夺”。","相关对比：democracy（民主，demos=人民）/ aristocracy（贵族统治，aristo=最优秀）/ bureaucracy（官僚体制，bureau=办公机构）。理解“-cracy”有助于记一组政治类词汇。"],"etymology":"源自希腊语词根：klepto-（偷窃）+ -cracy（统治、政体）。字面意思是“由偷窃者统治的政体”。","mnemonic":["记词根：klepto=偷，cracy=统治 → “小偷在统治”。","联想中文“盗贼政治/贼来治国”：听起来荒谬，但正好提醒它是强烈贬义词。"]}
{"word":"kleptocratic","summary":{"en":"Characterized by rulers stealing public wealth.","zh":"以掌权者侵吞公共财富为特征的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a government or ruling class that uses its power to steal public money and resources for personal gain.","zh":"与“盗贼统治”有关的；指政府或统治阶层滥用权力侵吞公共财富、以公肥私的。"},"examples":[{"en":"Many citizens protested what they called a kleptocratic system that enriched a small elite.","zh":"许多市民抗议他们所说的“盗贼统治”体制，让少数精英暴富。"},{"en":"The report described kleptocratic networks that moved stolen funds through offshore accounts.","zh":"报告描述了盗贼式的利益网络，如何通过离岸账户转移赃款。"},{"en":"Journalists investigated kleptocratic practices in state-owned companies.","zh":"记者调查了国有企业中的盗贼式腐败做法。"}]}],"synonyms":["corrupt","predatory","plundering","rapacious","thieving","venal"],"phonetic":"/ˌklɛp.təˈkræt.ɪk/","extraExplanation":["常与 *kleptocracy*（盗贼统治）搭配使用。它通常用于批评一种系统性的政治腐败：掌权者不仅收受贿赂，而是把国家当作“提款机”，通过垄断资源、操控合同、任人唯亲等方式把公共财富转为私人财富。","语气较强，常见于新闻、政治评论与学术写作中，比单纯说“corrupt（腐败的）”更强调“掠夺国家资产”的结构性特征。"],"etymology":"源自“klepto-（偷窃）”+“-cratic（统治的）”。“klepto-”来自希腊语 *kleptein*（偷），“-cracy/-cratic”来自希腊语 *kratos*（权力、统治）。因此 *kleptocratic* 字面意思就是“以偷窃为特征的统治”。","mnemonic":["拆开记：klepto=“kleptomaniac（偷窃癖）”那种“偷”，-cratic=“民主 democratic/官僚 bureaucratic”里的“统治/体制”。合起来就是“靠偷来统治的”。","联想中文：听起来像“克里普托（klepto）”，把国家财富“克走/偷走”的统治=盗贼统治。"]}
{"word":"kleptomania","summary":{"en":"Kleptomania is a disorder that causes an uncontrollable urge to steal, often without need or profit.","zh":"Kleptomania（偷窃癖）是一种会引发难以控制的偷窃冲动的心理障碍，常与需求或获利无关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mental health condition in which a person feels a strong, repeated urge to steal things, often items they do not need or that have little value","zh":"一种心理健康障碍：当事人反复、强烈地冲动去偷东西，常常偷的是并不需要或价值不高的物品"},"examples":[{"en":"Kleptomania is different from ordinary theft because the stealing is driven by an uncontrollable urge.","zh":"偷窃癖不同于一般偷窃，因为其行为往往由难以控制的冲动驱动。"},{"en":"She sought treatment after realizing her shoplifting might be linked to kleptomania.","zh":"她意识到自己的商店行窃可能与偷窃癖有关后，开始寻求治疗。"}]}],"synonyms":["compulsive stealing","impulse-control disorder"],"phonetic":"/ˌklɛp.təˈmeɪ.ni.ə/","extraExplanation":["词源：klepto- 来自希腊语，意为“偷”；-mania 意为“狂热/强迫性的冲动”。合起来表示“对偷窃的强迫性冲动”。","使用提醒：日常语境中有时会被随意用来开玩笑（比如“我对文具是kleptomania”），但它本是严肃的医学/心理学术语；如果在谈真实的人或案件，表达上更需谨慎与尊重。","区分概念：kleptomania 强调“冲动控制困难”；而普通的 theft/shoplifting 多与获利、报复或机会主义等动机相关。即便如此，现实中法律层面仍可能承担后果。"]}
{"word":"kleptomaniac","summary":{"en":"A kleptomaniac is someone who repeatedly feels an uncontrollable urge to steal.","zh":"kleptomaniac 指“反复出现、难以控制偷窃冲动的人（盗窃癖患者）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who has a mental health condition that causes a repeated, hard-to-control urge to steal, often stealing things they do not need or cannot easily use.","zh":"盗窃癖患者；一种心理健康问题导致反复、难以控制的偷窃冲动的人（常偷不需要或用不上的东西）。"},"examples":[{"en":"The doctor explained that a kleptomaniac may steal without planning or needing the item.","zh":"医生解释说，盗窃癖患者可能会在没有预谋、也不需要物品的情况下偷东西。"},{"en":"She apologized and sought treatment because her behavior was linked to kleptomania, not greed.","zh":"她道歉并寻求治疗，因为她的行为与盗窃癖有关，而不是贪婪。"},{"en":"The novel portrays a kleptomaniac whose secret stealing creates constant fear of being caught.","zh":"小说刻画了一位盗窃癖患者，秘密偷窃让他/她一直害怕被抓。"}]}],"synonyms":["person with kleptomania","compulsive thief","shoplifter (informal, not the same)"],"phonetic":"/ˌklɛp.təˈmeɪ.niˌæk/","extraExplanation":["“klepto-”来自希腊语，意思是“偷”；“-maniac”表示“被某种冲动驱使的人”。因此它强调的是“冲动与失控”，而不一定是为了金钱或利益。","在日常语境中，这是一个带有诊断色彩且可能具污名的词。更中性的表达可以说：someone with kleptomania（有盗窃癖的人）。","与常见的“thief（小偷）”不同，kleptomaniac强调一种反复出现、难以控制的心理冲动；但在法律/社会层面仍可能要承担后果。"]}
{"word":"kleptomaniacal","summary":{"en":"Kleptomaniacal means having an uncontrollable urge to steal, linked to kleptomania; it can also be used informally to mean “always taking things,” but that can be insensitive.","zh":"Kleptomaniacal 指“有偷窃癖/难以控制的偷窃冲动”，与偷窃癖相关；也可非正式指“总爱顺手拿东西”，但可能不够敏感需谨慎使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a compulsive, uncontrollable urge to steal (related to the mental health condition kleptomania).","zh":"患有偷窃癖的；有强迫性、难以控制的偷窃冲动的（与“偷窃癖”这种心理健康问题有关）。"},"examples":[{"en":"The report described his behavior as kleptomaniacal rather than planned theft.","zh":"报告把他的行为描述为“偷窃癖式的”，而不是有预谋的盗窃。"},{"en":"She sought treatment after realizing her kleptomaniacal impulses were getting worse.","zh":"她意识到自己的偷窃冲动越来越严重后，去寻求了治疗。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, sometimes joking) Showing a strong tendency to “take” things that aren’t yours, even in small ways.","zh":"（非正式，有时带玩笑）总爱顺手拿走不属于自己的东西，哪怕是小物件。"},"examples":[{"en":"Don’t be kleptomaniacal with office supplies—ask before you take anything.","zh":"别对办公用品“顺手牵羊”了——拿之前先问一声。"}]}],"synonyms":["compulsive","kleptomanic"],"phonetic":"/ˌklɛp.tə.məˈneɪ.ə.kəl/","extraExplanation":["“kleptomaniacal”来自“kleptomania（偷窃癖）”。在严肃语境中，它指一种可能与心理健康相关的强迫性冲动，因此在描述他人时要注意避免污名化；更中性的说法包括：“compulsive stealing”或“an impulse to steal”。","用法提示：它常用于医学/法律/新闻语境（如“kleptomaniacal behavior/impulses”）。在日常对话里用来开玩笑可能显得不敏感，建议谨慎。"]}
{"word":"kleptomaniacs","summary":{"en":"“Kleptomaniacs” means people who have kleptomania—repeated urges to steal, often without practical need.","zh":"“Kleptomaniacs”指盗窃癖患者——反复出现偷窃冲动，常常并非出于实际需要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who have kleptomania: a mental health condition that causes repeated urges to steal things, often without needing or wanting them.","zh":"患有盗窃癖的人：一种心理健康问题，会导致反复产生偷窃冲动，常常并非因为需要或真正想要那些东西。"},"examples":[{"en":"Kleptomaniacs may steal small items even if they can easily afford them.","zh":"盗窃癖患者可能会偷一些小东西，即使他们完全买得起。"},{"en":"The therapist explained that kleptomaniacs often feel tension before stealing and relief afterward.","zh":"治疗师解释说，盗窃癖患者常在偷之前感到紧张，偷完后反而感到如释重负。"}]}],"synonyms":["people with kleptomania","compulsive thieves (context-dependent)"],"phonetic":"/ˌklɛp.təˈmeɪ.ni.æk/","extraExplanation":["“Kleptomaniac(s)”是“kleptomania（盗窃癖）”的名词形式。它通常用于心理学/精神医学语境，强调这是一种冲动控制障碍，而不是简单的“人品不好”或“贪心”。日常交流中使用时要注意尊重与避免污名化。","词源来自希腊语：kleptein（偷）+ mania（狂热/强烈冲动）。"]}
{"word":"kleptomanias","summary":{"en":"Kleptomanias is the plural of kleptomania—compulsive, uncontrollable urges to steal (often discussed as multiple cases).","zh":"Kleptomanias 是 kleptomania 的复数，指多起/多种“盗窃癖”（难以控制的偷窃冲动）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of kleptomania: repeated cases or forms of a mental disorder in which a person feels a strong, uncontrollable urge to steal (often items they do not need)","zh":"kleptomania（盗窃癖/偷窃冲动症）的复数：指多起/多种“无法控制的偷窃冲动”这一心理障碍（常偷并不需要的物品）"},"examples":[{"en":"The doctor said the clinic had treated several kleptomanias over the years.","zh":"医生说这家诊所多年来治疗过好几起盗窃癖病例。"},{"en":"They discussed kleptomanias in a lecture on impulse-control disorders.","zh":"他们在一场关于冲动控制障碍的讲座中讨论了盗窃癖。"}]}],"synonyms":["compulsive stealing (plural contexts)","impulse-control disorders (broader term)"],"phonetic":"/ˌklɛp.təˈmeɪ.ni.ə/","extraExplanation":["“kleptomania”来自希腊语词根：klept-（偷窃）+ -mania（狂热/强迫冲动）。在日常英语里更常用单数“kleptomania”指这种病；复数“kleptomanias”多用于学术或统计语境，表示不同病例或不同类型的表现。","注意区分：kleptomania（病症）≠ theft/stealing（行为/犯罪）。前者强调冲动难以控制，属于心理健康话题；后者是一般意义上的偷窃。"]}
{"word":"kleptomanic","summary":{"en":"Compulsively driven to steal; relating to kleptomania.","zh":"与偷窃癖有关；有难以控制的偷窃冲动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an uncontrollable repeated urge to steal things, often items that are not needed or valuable.","zh":"有偷窃癖的；反复出现难以控制的偷窃冲动（常常偷的东西并非必需或值钱）。"},"examples":[{"en":"The doctor said his behavior seemed kleptomanic rather than planned theft.","zh":"医生说他的行为更像是偷窃癖，而不是有预谋的盗窃。"},{"en":"She felt ashamed because her kleptomanic impulses kept returning.","zh":"她感到羞愧，因为偷窃癖的冲动总是反复出现。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who has kleptomania.","zh":"偷窃癖患者。"},"examples":[{"en":"The article interviewed a kleptomanic who was seeking treatment.","zh":"那篇文章采访了一位正在寻求治疗的偷窃癖患者。"},{"en":"He didn’t think of himself as a criminal, but he admitted he was a kleptomanic.","zh":"他不认为自己是罪犯，但他承认自己有偷窃癖。"}]}],"synonyms":["compulsive","impulsive","kleptomaniacal"],"phonetic":"/ˌklɛp.təˈmæn.ɪk/","extraExplanation":["“kleptomanic”通常指一种心理/精神健康相关的强迫性偷窃冲动（kleptomania）。它与“thief/stealing”这种以获利为目的的盗窃不同，但在法律上偷窃仍可能构成犯罪。日常表达中尽量谨慎使用，避免给人贴标签。"],"etymology":"来自希腊语 kleptein（偷窃）+ mania（狂热、强迫性冲动）。最初用于医学语境，后来也用于日常描述“有偷窃癖的”。","mnemonic":["拆开记：klepto- = 偷（同根如“kleptocracy 盗贼统治”），-manic = 狂热/强迫（像“maniac”）。合起来就是“偷东西上瘾/停不下来”。","联想中文：‘盗（klepto）+ 迷（manic≈迷恋/上头）’→ 对偷东西有强迫性冲动。"]}
{"word":"kleptomanist","summary":{"en":"A kleptomanist is someone who has kleptomania and feels a repeated, uncontrollable urge to steal.","zh":"kleptomanist 指患盗窃癖的人，特点是反复、难以控制的偷窃冲动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has kleptomania, a mental health condition that causes a repeated, hard-to-control urge to steal items (often not needed or for little value)","zh":"患有盗窃癖的人；指因心理健康问题而反复、难以控制地想偷拿物品的人（常常并非出于需要或物品价值）"},"examples":[{"en":"The doctor explained that a kleptomanist may steal even when they can afford to pay.","zh":"医生解释说，盗窃癖患者即使买得起也可能会偷拿。"},{"en":"The novel portrays a kleptomanist who feels shame after each incident.","zh":"这部小说刻画了一位盗窃癖患者，每次事后都感到羞愧。"}]}],"synonyms":["person with kleptomania","kleptomaniac"],"phonetic":"/ˌklɛp.təˈmeɪ.ni.ɪst/","extraExplanation":["“kleptomanist”源自希腊语词根：klepto-（偷窃）+ -mania（狂热/强迫冲动）+ -ist（……的人）。日常表达中更常见的是“person with kleptomania（患盗窃癖的人）”。","在新闻或日常对话里，用“kleptomanist”指代某人可能带有标签化或不够尊重的语感；在讨论心理健康议题时，更建议用“someone with kleptomania”来强调“人”而非“病”。","注意区分：kleptomania（盗窃癖）强调强迫性冲动，不等同于一般意义上出于利益或报复而偷窃的“thief（小偷）”。"]}
{"word":"kleptoparasitic","summary":{"en":"stealing food caught or gathered by others (especially animals)","zh":"（尤指动物）靠偷取他者捕获/收集的食物为生的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In biology/ecology) describing an animal that gets food by stealing prey or food that another animal has caught or collected, rather than hunting/foraging itself.","zh":"（生物/生态）指通过偷取其他动物捕获或收集到的猎物/食物来进食的（而不是自己捕猎/觅食的）。"},"examples":[{"en":"Frigatebirds are famous for kleptoparasitic behavior, forcing other seabirds to drop their catch.","zh":"军舰鸟以盗寄生行为著称，会逼迫其他海鸟把捕到的鱼吐出或掉落。"},{"en":"The researchers compared kleptoparasitic gulls with gulls that mostly forage on their own.","zh":"研究人员比较了以盗寄生为主的海鸥与主要靠自己觅食的海鸥。"},{"en":"In crowded colonies, kleptoparasitic tactics can be more successful than hunting.","zh":"在拥挤的繁殖群落里，盗寄生策略有时比捕猎更容易成功。"}]}],"synonyms":["food-stealing","piratical","thieving","parasitic"],"phonetic":"/ˌklɛp.toʊˌpær.əˈsɪt.ɪk/","extraExplanation":["这是生态学术语，常用来描述“抢食/偷猎物”的取食策略，例如军舰鸟抢其他海鸟口中的鱼，或鬣狗、贼鸥等趁他者得手后夺取食物。","它强调的是“食物来源被夺取”，不等同于一般的寄生（寄生是长期依附宿主取资源），也不等同于单纯的掠食（自己捕获猎物）。"],"etymology":"由希腊语词根组合而来：klepto- 表“偷窃”（同源于“kleptomaniac 偷窃癖”），parasite 表“寄生者”，加 -ic 构成形容词，字面即“偷窃式寄生的”。","mnemonic":["拆开记：klepto=“偷”（联想 kleptomaniac 偷窃癖）+ parasitic=“寄生的”→“靠偷来寄生式吃饭”。","联想中文：看到“klepto-”就想到“掂走/顺走”，整词=“顺走别人辛苦抓到的食物”。"]}
{"word":"kleptoparasitism","summary":{"en":"stealing another animal’s food as a feeding strategy","zh":"以偷抢他者食物为取食策略"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A feeding behavior where an animal steals food or prey that another animal has caught, killed, or collected.","zh":"（生物学）一种取食行为：动物窃取其他动物捕获、杀死或收集到的食物/猎物来进食。"},"examples":[{"en":"Seagulls often show kleptoparasitism by snatching fish from other birds in midair.","zh":"海鸥常表现出盗食寄生：在空中从其他鸟类嘴里抢走鱼。"},{"en":"In the documentary, a hyena followed the lions and used kleptoparasitism to steal their kill.","zh":"纪录片里，鬣狗跟着狮群，用盗食寄生抢走它们捕到的猎物。"},{"en":"Researchers measured how often kleptoparasitism happened when food was scarce.","zh":"研究人员测量了食物短缺时盗食寄生发生的频率。"}]}],"synonyms":["food stealing","piracy","kleptoparasitic behavior"],"phonetic":"/ˌklɛp.toʊˈpær.əˌsaɪ.tɪz.əm/","extraExplanation":["它不是“寄生虫住在宿主体内/体表”的那种寄生，而更强调“抢别人的食物”这种生态互动。","常见于海鸟（如贼鸥、海鸥）、某些猛禽、鬣狗等；在食物紧缺或竞争激烈时更容易发生。","相关概念：scavenging（食腐/捡尸）是吃已经死掉的动物；kleptoparasitism 通常是从“正在占有食物的个体”那里直接抢走。"],"etymology":"由希腊语词根组合而成：klepto-（“偷窃”，同 kleptomaniac「盗窃癖」）+ parasitism（“寄生”）。字面意思就是“通过偷窃方式进行的寄生性取食”。","mnemonic":["拆开记：klepto = “偷”（联想 kleptomaniac 盗窃癖）；parasitism = “寄生”。合起来就是“靠偷来寄生式地吃”。","联想中文：‘盗’（偷）+‘寄生’（靠别人），就是“盗食寄生”。"]}
{"word":"kleptophobia","summary":{"en":"Kleptophobia is a strong fear related to stealing—often fear of stealing oneself, and sometimes fear of theft/robbery.","zh":"Kleptophobia 指与偷窃相关的强烈恐惧——常指害怕自己会去偷，有时也指害怕被偷/被抢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear of stealing or of being tempted to steal (sometimes also used for fear of thieves/robbery).","zh":"对“偷窃”或“自己会忍不住去偷”的强烈恐惧（有时也被用来指对小偷/被抢劫的恐惧）。"},"examples":[{"en":"He has kleptophobia and worries he might steal something by accident.","zh":"他有偷窃恐惧症，担心自己会不小心偷东西。"},{"en":"Some people with kleptophobia avoid shops to reduce anxiety.","zh":"一些有偷窃恐惧症的人会避免去商店，以减少焦虑。"}]}],"synonyms":["fear of stealing","fear of theft","fear of being robbed"],"phonetic":"/ˌklɛp.təˈfoʊ.bi.ə/","extraExplanation":["词源：klepto- 来自希腊语，意为“偷”，-phobia 意为“恐惧”。这种词结构在英语里很常见（如 arachnophobia 蜘蛛恐惧症）。","用法提示：kleptophobia 不是医学上非常常见、非常固定的诊断用词；在专业语境里更常见的是用更具体的表达，例如“fear of stealing / fear of theft / fear of being robbed”。","易混词：kleptomania（偷窃癖）指“反复、冲动性地偷窃”的行为倾向；而 kleptophobia 指“对偷窃相关情境的恐惧/焦虑”，两者含义相反。"]}
{"word":"klesha","summary":{"en":"Klesha means a mental affliction (like greed, anger, or ignorance) that disturbs the mind and causes suffering.","zh":"klesha 指“烦恼/心的染污”，如贪、嗔、痴等，会扰乱内心并带来痛苦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Buddhism and some Hindu/Yoga traditions) a mental affliction or “defilement” that clouds the mind and leads to unskillful actions and suffering (for example, greed, hatred, or ignorance).","zh":"（佛教及部分印度教/瑜伽传统中）“烦恼/染污心”的总称；指会蒙蔽心识、引发不善行为并导致痛苦的心理状态（如贪、嗔、痴等）。"},"examples":[{"en":"Meditation is often taught as a way to notice kleshas without reacting to them.","zh":"禅修/冥想常被教导为一种方法：觉察烦恼（kleshas），但不立刻跟随反应。"},{"en":"In Buddhist practice, anger is treated as a klesha that can be transformed through awareness and compassion.","zh":"在佛教修行中，愤怒被视为一种烦恼（klesha），可以通过觉察与慈悲来转化。"}]}],"synonyms":["affliction","defilement","mental poison","hindrance","impurity"],"phonetic":"/ˈklɛʃə/","extraExplanation":["“klesha”（也常写作 klesa）源自梵语，进入英语多用于宗教学、佛学与瑜伽语境，日常英语里比较少见。","在不同传统里列表不完全相同：佛教常讲“三毒”（贪、嗔、痴）等；《瑜伽经》中常见“五烦恼”（无明、我执/我慢、贪、嗔、对死亡的恐惧/执生）。"]}
{"word":"Kleve","summary":{"en":"a German place name; also a historical duchy name and a surname","zh":"德国地名；也可指历史上的克莱沃公国名称及姓氏"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A town in western Germany (North Rhine–Westphalia) near the Dutch border; in English contexts it may also be referred to by its historical/English form “Cleves.”","zh":"德国西部（北莱茵-威斯特法伦州）靠近荷兰边境的一座城市；在英语语境中有时也会用其历史/英语名称“Cleves”。"},"examples":[{"en":"Kleve is close to the Netherlands, so you’ll often hear Dutch spoken nearby.","zh":"Kleve 靠近荷兰，所以附近常能听到荷兰语。"},{"en":"She took a day trip from Düsseldorf to Kleve by train.","zh":"她从杜塞尔多夫坐火车去 Kleve 一日游。"}]},{"partOfSpeech":"other","definition":{"en":"A historical region/title: the Duchy of Cleves (German: Herzogtum Kleve), an important territory in the Holy Roman Empire.","zh":"历史上的地区/头衔：克莱沃公国（德语：Herzogtum Kleve），曾是神圣罗马帝国的重要领地之一。"},"examples":[{"en":"In early modern European history, Kleve (Cleves) appears in discussions of dynastic politics.","zh":"在近代早期欧洲史中，Kleve（Cleves）常出现在王朝政治的讨论里。"},{"en":"Old maps sometimes label the area as the Duchy of Cleves rather than Kleve.","zh":"老地图上有时会标作“Duchy of Cleves（克莱沃公国）”，而不是 Kleve。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏。"},"examples":[{"en":"Mr. Kleve will present the research findings today.","zh":"Kleve 先生今天将展示研究结果。"}]}],"synonyms":["Cleves"],"phonetic":"/kleɪv/","extraExplanation":["在英语历史文化中，“Anne of Cleves”（安妮·克莱沃）是亨利八世的第四任王后；这里的“Cleves”指的就是德语“Kleve”相关的历史地区称呼。","作为地名时，Kleve 在英文文本中有时会保留德语拼写“Kleve”，有时会用传统英语形式“Cleves”，两者指向同一地区传统。"],"etymology":"源自德语地名“Kleve”。英语里历史上常见的对应形式是“Cleves”，尤其在旧史书与王朝史（如都铎时期）语境中更常出现。","mnemonic":["记忆法：把它想成“cl(e)ave（劈开）”的声音联想：/kleɪv/，但拼写是 Kleve。看到 K- 开头，多半是德语/地名风格。"]}
{"word":"klezmer","summary":{"en":"Klezmer is traditional Eastern European Jewish instrumental music, often heard at weddings and celebrations.","zh":"klezmer 指传统的东欧犹太器乐风格，常用于婚礼与庆典场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A style of traditional Jewish instrumental music, especially from Eastern Europe, often played at weddings and celebrations and featuring instruments like clarinet, violin, and accordion.","zh":"克莱兹默音乐：一种传统的犹太（尤指东欧犹太）器乐风格，常在婚礼与庆典上演奏，常见乐器有单簧管、小提琴、手风琴等。"},"examples":[{"en":"We heard a lively klezmer band at the wedding.","zh":"我们在婚礼上听到了一支热闹的克莱兹默乐队。"},{"en":"Klezmer music can sound joyful, but it can also express deep sadness.","zh":"克莱兹默音乐听起来可以很欢快，但也能表达很深的悲伤。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to this style of music.","zh":"与克莱兹默音乐风格有关的；克莱兹默的。"},"examples":[{"en":"She loves klezmer clarinet solos.","zh":"她很喜欢克莱兹默风格的单簧管独奏。"},{"en":"They played a klezmer tune before dinner.","zh":"他们在晚餐前演奏了一首克莱兹默曲子。"}]}],"synonyms":["Jewish folk music","Yiddish folk music"],"phonetic":"/ˈklɛzmər/","extraExplanation":["“klezmer”一词来自意第绪语（Yiddish），源头可追溯到希伯来语“klei zemer”（意为“音乐的器具/乐器”）。如今英语里常用来指这种音乐风格，而不仅仅是指乐手或乐器。","在美国，克莱兹默在20世纪末出现“复兴”（revival）：许多音乐家将其与爵士、民谣、甚至摇滚融合，因此你可能在现代舞台或电影配乐里听到更“跨界”的klezmer。","相关词汇：Yiddish（意第绪语）、Ashkenazi（阿什肯纳兹犹太人/文化）、wedding band（婚礼乐队）、freylekhs/hora（常见的舞曲类型/舞蹈）。"]}
{"word":"klick","summary":{"en":"“Klick” most commonly means “kilometer” in military/outdoor slang; it can also be an informal spelling of “click.”","zh":"“klick”最常指“公里”（军队/户外俚语）；也可作为“click”的非正式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kilometer (1,000 meters), especially in military or outdoor slang","zh":"一公里（1000米），尤用于军队或户外活动的俚语"},"examples":[{"en":"It’s about five klicks to the checkpoint.","zh":"到检查点大概有五公里。"},{"en":"We hiked a couple of klicks before it got dark.","zh":"天黑前我们走了几公里。"}]},{"partOfSpeech":"n.","definition":{"en":"a nonstandard spelling of “click,” meaning a short sharp sound or the act of pressing/choosing something (often used to look casual or to imitate sound)","zh":"“click”的非标准拼写，可指“咔哒声”或“点击/按下/选择”（常用于口语化或拟声）"},"examples":[{"en":"I heard a klick and the door unlocked.","zh":"我听到一声咔哒，门就解锁了。"},{"en":"Just klick the button to continue. (informal spelling)","zh":"点一下按钮继续。（非正式拼写）"}]},{"partOfSpeech":"v.","definition":{"en":"to travel a certain distance measured in kilometers (slang, less common)","zh":"（俚语，较少见）按“公里”计算地行进/走过（某段路程）"},"examples":[{"en":"We klicked another ten before stopping to rest.","zh":"我们又走了十公里才停下来休息。"}]}],"synonyms":["kilometer","km","click (standard spelling)"],"phonetic":"/klɪk/","extraExplanation":["“klick”最常见的用法来自军队口语，把kilometer缩短成klick（也常写作click）。在军事电影、军旅小说和户外徒步语境里很常见。","在普通书面英语中，更推荐写kilometer或km；表示“点击/咔哒声”则用标准拼写click。"]}
{"word":"klicket","summary":{"en":"“Klicket” is not a common standard English word; it’s usually a misspelling of “cricket” or a phonetic spelling of “click it.”","zh":"“klicket”不是常见标准英语词；通常是“cricket”的误拼，或把“click it（点击它）”按发音写出来。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or uncommon spelling; in most contexts it is likely a misspelling of “cricket” (the insect or the sport) or a phonetic/texting spelling of “click it.”","zh":"一种不规范或少见的拼写；多数语境下很可能是把“cricket”（蟋蟀/板球）拼错了，或是把“click it”（点它/点击它）按发音写成了“klicket”。"},"examples":[{"en":"Did you mean “cricket” (the sport) instead of “klicket”?","zh":"你想表达的是“cricket”（板球）而不是“klicket”吗？"},{"en":"If the message says “klicket,” it may just mean “click it.”","zh":"如果信息里写“klicket”，它可能只是想说“click it”（点击它）。"}]}],"phonetic":"/ˈklɪkɪt/","extraExplanation":["“klicket”不是常见的标准英语词条，因此具体含义高度依赖你看到它的上下文（比如是在聊天、游戏用户名、品牌名，还是拼写错误）。如果你能提供一句完整例句或截图，我可以更准确判断它到底指“cricket”还是“click it”，或是否是专有名词。"]}
{"word":"klieg","summary":{"en":"Klieg (usually “Klieg light”) means a powerful studio spotlight used for filming or photography.","zh":"Klieg（多指“Klieg light”）是用于影视或摄影的强光聚光灯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in the phrase “Klieg light(s)”) a very bright studio spotlight used in filmmaking, TV, or photography.","zh":"（多用于短语“Klieg light(s)”）电影、电视或摄影棚里用的强光聚光灯（高亮度摄影灯）。"},"examples":[{"en":"The actor blinked under the hot Klieg lights.","zh":"演员在炽热的摄影棚强光下直眨眼。"},{"en":"Reporters set up Klieg lights outside the courthouse.","zh":"记者在法院外架起了强光摄影灯。"},{"en":"She wasn’t used to being in front of Klieg lights and cameras.","zh":"她不习惯站在强光摄影灯和镜头前。"}]}],"synonyms":["spotlight","studio light","floodlight","arc light"],"phonetic":"/kliːɡ/","extraExplanation":["“Klieg light”来自美国Kliegl Brothers公司（20世纪早期）生产的弧光/聚光灯品牌名，后来在英语里被当作通用名词使用，类似“thermos（保温瓶）”“kleenex（纸巾）”这种由品牌演变来的词。","常见搭配：under the Klieg lights（在聚光灯下；引申为在公众关注下）。"]}
{"word":"Klierf","summary":{"en":"Not a standard dictionary word; likely a name or misspelling.","zh":"非标准词汇；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling, a surname, or a brand/name.","zh":"不是常见英语词典中的标准词；可能是拼写错误、姓氏，或品牌/名字。"},"examples":[{"en":"I couldn’t find “Klierf” in the dictionary—do you mean “cliff” or a person’s name?","zh":"我在词典里查不到“Klierf”——你是想写“cliff”，还是某个人名？"},{"en":"Klierf appears in the email signature, so it might be a last name.","zh":"“Klierf”出现在邮件签名里，所以它可能是姓氏。"}]}],"synonyms":["cliff","clear","cleric"],"phonetic":"/klɪrf/","extraExplanation":["如果你能提供一句包含“Klierf”的原句、领域（游戏/科技/德语名字等）、或你想表达的中文意思，我可以更准确判断它是否应为：cliff /klɪf/（悬崖）、clear /klɪr/（清楚的）、或其他词。"],"etymology":"暂无可靠词源信息：因为它不是常见英语词汇，可能来自人名、商标，或是拼写变体。"}
{"word":"klikitat","summary":{"en":"“klikitat” isn’t a standard English word; it likely needs context or is a misspelling (possibly of “click it”).","zh":"“klikitat”不是标准英语单词；可能需要上下文判断，或是“click it”等的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a username/brand, so the meaning depends on context.","zh":"不是标准英语单词。它可能是拼写错误、用户名或品牌名，具体含义需要看上下文。"},"examples":[{"en":"I can’t find “klikitat” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“klikitat”——你能把它出现的句子发我吗？"},{"en":"Maybe you meant “click it” or “Klikitat” as a name.","zh":"你可能想写的是“click it”，或者“Klikitat”作为一个名称。"}]}],"phonetic":"/ˈklɪkɪˌtæt/","extraExplanation":["“klikitat”看起来像是拼写变体或专有名词，而不是常见英语词汇。最常见的可能性：\n1) 你想写的是短语“click it”（点/点击它）。\n2) 它是人名、地名、品牌名或账号名。\n3) 它来自其他语言或方言的转写。\n如果你把原句、所在网站/游戏/聊天语境，或你想表达的中文意思发来，我可以更准确判断，并给出对应的英文表达。"]}
{"word":"klimax","summary":{"en":"Climax (often misspelled as “klimax”) means the highest or most intense point, especially in a story or situation; it can also be a verb meaning “to reach that peak.”","zh":"Climax（常被写成“klimax”）指最高点或最紧张、最关键的时刻，尤其用于故事或事件；也可作动词表示“达到高潮”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the most exciting, important, or intense point in a story, movie, speech, or situation","zh":"（故事、电影、演讲或事件的）高潮；最紧张、最关键的时刻"},"examples":[{"en":"The climax of the film happens when the hero finally tells the truth.","zh":"电影的高潮出现在英雄终于说出真相的时候。"},{"en":"Tension builds slowly, then reaches a climax near the end.","zh":"紧张感慢慢累积，然后在结尾附近达到高潮。"}]},{"partOfSpeech":"n.","definition":{"en":"the highest point or peak of something (often after a gradual rise)","zh":"（事物逐渐上升后的）最高点；顶峰"},"examples":[{"en":"Their success reached a climax in the 1990s.","zh":"他们的成功在20世纪90年代达到顶峰。"},{"en":"The party came to a climax when everyone started singing together.","zh":"当大家一起唱歌时，派对气氛达到顶点。"}]},{"partOfSpeech":"n.","definition":{"en":"(in biology) the final, stable stage of an ecological community (less common in everyday English)","zh":"（生物学）顶极群落；生态演替的最终稳定阶段（日常较少用）"},"examples":[{"en":"After many years, the forest may become a climax community.","zh":"经过许多年，这片森林可能会形成顶极群落。"}]},{"partOfSpeech":"v.","definition":{"en":"to reach the most intense or important point","zh":"达到高潮；到达最紧张或最关键的时刻"},"examples":[{"en":"The debate climaxed with a direct question from the audience.","zh":"辩论在观众的直接提问中达到高潮。"},{"en":"The music builds and then climaxes in the final chorus.","zh":"音乐逐渐推进，并在最后的副歌达到高潮。"}]}],"synonyms":["peak","high point","turning point","crescendo","pinnacle"],"phonetic":"/ˈklaɪmæks/","extraExplanation":["“klimax”不是最常见的英语拼写；英语标准拼写是 **climax**。在一些语言（如德语、土耳其语等）中常用 **k** 来对应英语的 **c** 音，所以你可能在外文语境或非标准拼写里看到“klimax”。","词源提示：来自希腊语 *klimax*，原意是“梯子/阶梯”，引申为“逐步上升到顶点”。因此它常与“build up（逐步累积）”“reach a climax（达到高潮）”等搭配。","文学/叙事中常说“rising action → climax → resolution（上升情节→高潮→结局）”，用来分析故事结构。"]}
{"word":"klin","summary":{"en":"“Klin” is usually a proper noun (a Russian town) or a surname; it is not a common English vocabulary word.","zh":"“Klin”通常是专有名词（俄罗斯地名）或姓氏；并不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A town in Russia (Moscow Oblast), sometimes mentioned in English texts as a place name (proper noun).","zh":"俄罗斯的一个城镇（莫斯科州克林市），在英文中作为地名出现（专有名词）。"},"examples":[{"en":"Tchaikovsky spent his final years in Klin.","zh":"柴可夫斯基在克林度过了生命的最后几年。"},{"en":"They drove from Moscow to Klin for a day trip.","zh":"他们从莫斯科开车到克林一日游。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname) used in English contexts (less common).","zh":"一个姓氏，在英语语境中可能出现（较少见）。"},"examples":[{"en":"Dr. Klin will present the research at the conference.","zh":"克林博士将在会议上展示这项研究。"}]}],"phonetic":"/klɪn/","extraExplanation":["“Klin”不是常见的英语单词，更常见的是作为地名或人名出现。","克林（Klin）在文化上常与俄罗斯作曲家柴可夫斯基有关：他晚年居住于此，如今当地有柴可夫斯基故居博物馆。","如果你其实想查的是“clean”（/kliːn/，意为“干净的；清洁”），告诉我我可以按“clean”来解释与举例。"]}
{"word":"kling","summary":{"en":"Kling is most commonly a surname; it’s not a common everyday English word.","zh":"Kling 最常见用法是姓氏；它不是常见的日常英文词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name).","zh":"姓氏（家族名字）。"},"examples":[{"en":"Dr. Kling published a new study on climate policy.","zh":"Kling 医生发表了一项关于气候政策的新研究。"},{"en":"My teacher’s last name is Kling.","zh":"我老师的姓是 Kling。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare) A brand/name element used in company or product names; meaning depends on the specific context.","zh":"（较少见）用作公司名或产品名的一部分；具体含义取决于语境。"},"examples":[{"en":"I saw the word Kling on the label, but I’m not sure what it refers to.","zh":"我在标签上看到了 Kling 这个词，但不确定它指什么。"}]}],"phonetic":"/klɪŋ/","extraExplanation":["“Kling”在英语里并不是常见的普通词汇，更常见的是作为人名/姓氏出现。","如果你本来想查的是 **cling**（发音相近，意思是“紧贴/依恋”），告诉我你的例句或上下文，我可以帮你区分与纠正拼写。","在流行文化中，有时人们会把“Kling”和《星际迷航》里的 **Klingon**（克林贡人）联想到一起，但“Kling”本身并不是标准的相关词条。"]}
{"word":"klingsor","summary":{"en":"Klingsor is a proper name best known as a legendary sorcerer and as the villain in Wagner’s *Parsifal*, often used as a cultural reference to a dark, manipulative magician-like figure.","zh":"Klingsor 是一个专名，最常指圣杯传说中的传奇巫师、以及瓦格纳《帕西法尔》中的反派，并常被引申为“阴暗、善于操控的魔法师式人物”的文化典故。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A legendary sorcerer/enchanter in medieval German Arthurian romance, especially in stories about Parsifal (Parzival) and the Holy Grail.","zh":"（专有名词）中世纪德语亚瑟王/圣杯传说中的一位传奇巫师/魔法师，尤其常见于帕西法尔（Parzival）与圣杯故事中。"},"examples":[{"en":"In some Grail legends, Klingsor uses magic to trap knights who seek the Holy Grail.","zh":"在一些圣杯传说里，Klingsor 用魔法困住寻找圣杯的骑士。"},{"en":"The name Klingsor often signals a powerful but dangerous enchanter.","zh":"“Klingsor”这个名字常常暗示一个强大但危险的魔法师。"}]},{"partOfSpeech":"n.","definition":{"en":"A main antagonist in Richard Wagner’s opera *Parsifal*—a magician who opposes the Grail knights.","zh":"（专有名词）理查德·瓦格纳歌剧《帕西法尔》（*Parsifal*）中的主要反派：与圣杯骑士对立的魔法师。"},"examples":[{"en":"In Wagner’s *Parsifal*, Klingsor tries to corrupt the hero through deception and enchantment.","zh":"在瓦格纳的《帕西法尔》中，Klingsor 试图用欺骗与魔法诱惑并腐化主人公。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, a literary or cultural reference to a sinister magician-like figure; also a character name used in later works (e.g., Hermann Hesse’s *Klingsor’s Last Summer*).","zh":"（引申）在文学与文化中用来指代“阴暗的魔法师式人物”的典故/称呼；也作为后世作品中的人物名（如黑塞《Klingsor 的最后一个夏天》）。"},"examples":[{"en":"The critic called the ruthless adviser “a Klingsor,” implying he manipulated people behind the scenes.","zh":"评论家把那位冷酷的顾问称作“一个 Klingsor”，暗示他在幕后操控他人。"},{"en":"Hesse’s *Klingsor’s Last Summer* uses the name for an intense, artist-like character.","zh":"黑塞的《Klingsor 的最后一个夏天》借用这个名字塑造了一个强烈、带有艺术家气质的人物。"}]}],"synonyms":["sorcerer","enchanter","magician"],"phonetic":"/ˈklɪŋzɔr/","extraExplanation":["“Klingsor”最早广为人知的来源之一是中世纪德语骑士文学（如沃尔夫拉姆·冯·埃申巴赫的《帕尔齐法尔》）。在这些文本里，他常与“圣杯考验”“诱惑与陷阱”等主题相关，因此在后世作品中常被当作“危险的操控者/诱惑者”的文化符号。","发音与拼写常见于德语语境，但在英语里多作为专名直接借用；使用时通常不加冠词（不说 *a the Klingsor*，除非是在打比方：*a Klingsor* = “一个像 Klingsor 那样的人”）。"]}
{"word":"klino","summary":{"en":"“Klino” isn’t standard English; it’s a Greek-based form meaning “to lean/incline,” and it shows up indirectly in English words like incline, decline, and -cline terms.","zh":"“Klino”不是标准英语词；它源自希腊语，核心意思是“倾斜/使倾向”，并间接影响了英语中的 incline、decline 以及含 -cline 的学术词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) A transliteration of the Ancient/Modern Greek verb κλίνω (klínō), meaning “to lean,” “to bend,” or “to incline.”","zh":"（非标准英语词）源自希腊语动词 κλίνω（klínō）的拉丁转写，意思是“倾斜、弯曲、使倾向/靠向”。"},"examples":[{"en":"In Greek, klino can mean “I lean” or “I incline.”","zh":"在希腊语里，klino 可以表示“我倾斜/我靠向/我使倾向”。"},{"en":"The English word “incline” is related to the same Greek root idea: “leaning toward.”","zh":"英语单词“incline（倾向/斜坡）”与这一希腊语词根表达的“向某处倾斜/倾向”有关。"}]},{"partOfSpeech":"other","definition":{"en":"A root seen in English scientific/medical vocabulary (via Greek), especially in words related to “leaning” or “sloping,” such as the suffix “-cline.”","zh":"（词根用法）在英语科学/医学词汇中常见的希腊语来源词根概念，常体现在后缀“-cline（倾斜）”等形式里。"},"examples":[{"en":"“Decline” originally relates to “leaning down,” and now commonly means “to refuse” or “to decrease.”","zh":"“Decline”最初与“向下倾斜”有关，如今常用义是“拒绝”或“下降”。"},{"en":"In geology, “anticline” and “syncline” describe types of folds (slopes) in rock layers.","zh":"在地质学中，“anticline（背斜）”和“syncline（向斜）”描述岩层褶皱的形态（与倾斜/坡度相关）。"}]}],"synonyms":["incline (conceptually)","lean (conceptually)","bend (conceptually)"],"phonetic":"/ˈkliːnoʊ/","extraExplanation":["“klino”本身通常不会作为英语单词使用；更常见的是它的“词根影响”出现在英语里，比如：incline（倾向/斜坡）、decline（下降/拒绝）、recline（斜躺）。","“-cline”在学术语境（尤其地质学）里很常见：anticline（背斜）和 syncline（向斜）都跟“倾斜/弯曲”这一核心概念有关。","如果你是在某个产品名、品牌名、用户名里看到“klino”，那可能是借用了希腊语词根来传达“倾斜、躺靠、舒适姿势”等联想。"]}
{"word":"klinokinesis","summary":{"en":"non-directional movement where turning rate changes with stimulus intensity","zh":"刺激强度改变时，动物通过改变转向频率表现出的非定向运动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of kinesis (non-directional movement) in which an animal changes the rate or frequency of turning in response to the intensity of a stimulus (such as light, humidity, or temperature), rather than moving directly toward or away from it","zh":"（趋动的一种）一种非定向运动：动物会根据刺激强度（如光照、湿度、温度）改变“转弯的频率/转向率”，但并不是直接朝向或远离刺激源移动"},"examples":[{"en":"In woodlice, klinokinesis makes them turn more often in dry areas, increasing the chance of reaching a moist place.","zh":"在潮虫身上，干燥环境会引发klinokinesis，使它们更频繁转向，从而更可能找到潮湿区域。"},{"en":"Klinokinesis is studied in simple behavioral experiments where light intensity is changed but no clear direction is provided.","zh":"在一些基础行为实验中，研究者会改变光强但不提供明确方向，用来观察klinokinesis。"}]}],"synonyms":["kinesis"],"phonetic":"/ˌklaɪnoʊkɪˈniːsɪs/","extraExplanation":["与 taxis（趋性）不同：taxis 是“有方向”的（朝向/远离刺激源），而 klinokinesis 是“无方向”的，只是刺激越强（或越弱）就越容易/越频繁转弯。","常与 orthokinesis 对比：orthokinesis 指“速度/活动量随刺激强度变化”，klinokinesis 指“转向频率随刺激强度变化”。"],"etymology":"源自希腊语词根：klino- 表示“倾斜、转向”，kinesis 表示“运动”。合起来指“通过转向频率变化表现出来的运动反应”。","mnemonic":["把它拆开记：klino-（联想“倾斜/拐弯”）+ kinesis（运动）→“拐弯式的运动反应”。","中文联想：“看（kli-像‘看’）到刺激就更爱拐（-no-联想‘扭’）来扭去”，强调“转向频率变”。"]}
{"word":"klip","summary":{"en":"“Klip” means “rock/stone,” mainly used in South African English.","zh":"“klip”主要在南非英语中使用，意思是“岩石/石头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rock or stone (especially in South African English, from Afrikaans/Dutch usage).","zh":"岩石；石头（尤用于南非英语，源自南非荷兰语/荷兰语用法）。"},"examples":[{"en":"We climbed up the klip to get a better view of the valley.","zh":"我们爬上那块岩石，好看得更清楚山谷的景色。"},{"en":"The trail was covered with loose klip, so we walked carefully.","zh":"小路上满是松动的碎石，所以我们走得很小心。"}]}],"synonyms":["rock","stone","boulder"],"phonetic":"/klɪp/","extraExplanation":["“klip”在标准美式英语里不常见，更常见的是“rock/stone”。它常出现在南非英语或南非地名、文学描写中（例如描写灌木丛、山地地貌时）。","词源上与南非荷兰语（Afrikaans）和荷兰语“klip”（石头）相关；在南非语境里属于自然、质朴的地貌词汇。"]}
{"word":"klipbok","summary":{"en":"Klipbok is a South African term for a small antelope found in rocky areas, often meaning “klipspringer.”","zh":"klipbok是南非语境中的词，指岩石地带的小型羚羊，常用来指“岩跳羚/岩羚”（klipspringer）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small African antelope associated with rocky places (South African usage; often referring to the klipspringer).","zh":"（南非用法）一种生活在岩石地带的小型非洲羚羊；常指“岩羚/岩跳羚”（klipspringer）。"},"examples":[{"en":"We spotted a klipbok standing perfectly still on the rocks.","zh":"我们看到一只klipbok静静地站在岩石上。"},{"en":"In some South African English, people may call a klipspringer a klipbok.","zh":"在某些南非英语里，人们可能会把岩跳羚（klipspringer）称作klipbok。"}]}],"synonyms":["klipspringer","rock antelope","buck (general)"],"phonetic":"/ˈklɪpˌbɑk/","extraExplanation":["“klipbok”多见于南部非洲语境，来源于南非荷兰语/南非语：klip（石头）+ bok（公羊/羚羊、buck）。因此它字面意思接近“岩石上的羚羊”。","不同地区或说话者可能用它泛指“岩石地带的羚羊”，但更常被用来指“klipspringer（岩跳羚/岩羚）”。在正式动物学或全球通行的英语里，写作与检索时通常用“klipspringer”。"]}
{"word":"klipdachs","summary":{"en":"Klipdachs means a rock hyrax (dassie), a small African mammal that lives among rocky cliffs.","zh":"Klipdachs 指“岩蹄兔/蹄兔（dassie）”，一种生活在岩石与悬崖地带的非洲小型哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, rabbit-sized African mammal (a rock hyrax) that lives among rocks and cliffs; also called a dassie.","zh":"一种生活在岩石和悬崖地带的非洲小型哺乳动物（岩蹄兔/蹄兔），也叫 dassie（蹄兔的南非俗称）。"},"examples":[{"en":"We spotted a klipdachs sunning itself on the rocks.","zh":"我们看到一只 klipdachs 在岩石上晒太阳。"},{"en":"Klipdachs live in colonies and warn each other when danger is near.","zh":"Klipdachs 常群居，发现危险时会互相警示。"}]}],"synonyms":["rock hyrax","hyrax","dassie"],"phonetic":"/ˈklɪpˌdɑːks/","extraExplanation":["“klipdachs”常见于南非英语与自然纪录片语境，源自南非荷兰语/南非语（Afrikaans），其中 klip 意为“岩石”，dassie/dachs 指“蹄兔”（民间称呼）。","虽然外形有点像兔子或豚鼠，但蹄兔与大象和海牛在演化上更接近；这是很多英文科普材料里常提到的有趣点。"]}
{"word":"klipdas","summary":{"en":"“klipdas” isn’t a standard English word; it’s likely a misspelling or a name.","zh":"“klipdas”不是标准英语词，可能是拼写错误或专有名词（如名字）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a word from another language.","zh":"不是标准英语单词，可能是拼写错误、用户名/品牌名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “klipdas” in an English dictionary—did you mean “clip” or “clipped”?","zh":"我在英语词典里找不到“klipdas”——你是不是想写“clip（夹/剪辑）”或“clipped（已剪辑的/剪短的）”？"},{"en":"If “Klipdas” is a name, please share the sentence you saw it in.","zh":"如果“Klipdas”是一个名字，请把你看到它的句子发我。"}]}],"synonyms":["clip","clipped","clips"],"phonetic":"ˈklɪp.dæs","extraExplanation":["“klipdas”很像打字或拼写误差。常见的接近词包括：clip（剪、夹、剪辑）、clipped（剪短的/剪辑过的）、Clips（剪辑片段）。","你可以把：1）原句；2）想表达的中文意思；3）是否是人名/地名/品牌名 发来，我就能更准确地判断。"]}
{"word":"klipfish","summary":{"en":"Klipfish is salted, dried fish eaten in South Africa, usually soaked and cooked before serving.","zh":"Klipfish 指南非常见的盐渍风干鱼，通常会先浸泡再烹调食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A South African food: fish that is salted and dried until firm, then usually soaked and cooked before eating.","zh":"一种南非食物：把鱼用盐腌制并风干至结实，食用前通常会先浸泡再烹调。"},"examples":[{"en":"Klipfish is often soaked overnight to remove some of the salt.","zh":"Klipfish 通常会浸泡一整晚，以去掉部分盐分。"},{"en":"They served a traditional klipfish dish with potatoes and a creamy sauce.","zh":"他们端上了一道传统的 klipfish 菜，配土豆和奶油酱汁。"},{"en":"In some Cape Town homes, klipfish is a special-occasion ingredient.","zh":"在开普敦的一些家庭里，klipfish 是逢年过节才会用的食材。"}]}],"synonyms":["klipvis","salted dried fish","salt fish"],"phonetic":"/ˈklɪp.fɪʃ/","extraExplanation":["词源常与南非荷兰语/南非语（Afrikaans）有关：klip（石头）+ vis（鱼）。拼写也常见作 klipvis。","它并不是单指某一种鱼类，更像是一种“加工方式”（盐腌+风干）。不同地区可能用不同鱼种制作。","在南非西开普的家常与传统菜中较常见，做法多为先浸泡回软并降低咸度，再与土豆、洋葱、奶油或白酱等同煮。"]}
{"word":"kliphaas","summary":{"en":"Kliphaas is a South African word for the rock hyrax (dassie).","zh":"Kliphaas是南非用语，指岩蹄兔（dassie）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English; from Afrikaans) a rock hyrax (also called a “dassie”), a small, rabbit-like mammal that lives among rocks.","zh":"（南非英语；源自南非荷兰语Afrikaans）蹄兔（也叫“dassie”），一种体型小、外形有点像兔子、常栖息在岩石间的哺乳动物。"},"examples":[{"en":"We saw a kliphaas sunning itself on the rocks near the lookout point.","zh":"我们在观景点附近看到一只蹄兔（kliphaas）在岩石上晒太阳。"},{"en":"In some parts of South Africa, people call the rock hyrax a kliphaas or dassie.","zh":"在南非的一些地方，人们把岩蹄兔叫作kliphaas或dassie。"}]}],"synonyms":["rock hyrax","hyrax","dassie"],"phonetic":"/ˈklɪp.hɑs/","extraExplanation":["“kliphaas”来自南非荷兰语（Afrikaans）：klip=“岩石/石头”，haas=“野兔”。名字字面像“岩兔”，但实际指的是蹄兔（hyrax），并不是真正的兔子。因为外形相似、又常在岩石上活动，所以得名。","在英语语境中它多出现在南非相关的自然、旅行或文学描写里；更通用的英文说法是“rock hyrax”，口语常用“dassie”。"]}
{"word":"klippe","summary":{"en":"A klippe is an isolated remnant of a thrust sheet left after erosion.","zh":"Klippe指逆冲推覆体经侵蚀后留下的孤立残块（飞来岩块）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In geology, an isolated block of rock (often a remnant of a thrust sheet) left behind after erosion, typically surrounded by different rock types.","zh":"（地质）孤立的岩块（常为逆冲推覆体的残留体），经侵蚀后与原主体分离，常被不同岩性围绕。"},"examples":[{"en":"The field team mapped a klippe of limestone sitting on much older shale.","zh":"野外小组绘制了一处石灰岩的“飞来岩块”，它位于更古老的页岩之上。"},{"en":"Erosion can isolate a klippe from the main thrust sheet over time.","zh":"随着时间推移，侵蚀可能把“飞来岩块”从主要推覆体中分离出来。"}]}],"synonyms":["outlier (geology)","erosional remnant","thrust-sheet remnant"],"phonetic":"/ˈklɪpi/","extraExplanation":["“Klippe”是德语借词（原意与“悬崖/岩块”相关），在构造地质学里常与“nappe（推覆体）”一起出现：大型推覆体被侵蚀切割后，残留的孤立岩体就可能被称为klippe。复数常写作“klippen”。"]}
{"word":"klippen","summary":{"en":"Klippen (plural of klippe) are isolated remnants of a thrust sheet left after erosion, used mainly in geology.","zh":"Klippen 是地质术语（klippe 的复数），指逆冲推覆体被侵蚀后残留的孤立岩块。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In geology, isolated blocks of rock left behind after erosion separates them from a larger thrust sheet (a large slab of rock pushed over another). “Klippen” is the plural of “klippe.”","zh":"（地质）“Klippe”的复数。指在侵蚀作用后，与较大的逆冲岩片（被推覆到另一岩层之上的巨大岩板）分离、残留下来的孤立岩块。"},"examples":[{"en":"The field guide pointed out several klippen formed by ancient thrusting and later erosion.","zh":"野外指南指出了几处由古老的逆冲推覆作用并经后期侵蚀形成的 klippen。"},{"en":"On the map, the klippen appear as small outcrops separated from the main nappe.","zh":"在地图上，这些 klippen 显示为与主推覆体（nappes）分离的小型露头。"}]}],"synonyms":["isolated thrust-sheet remnant","thrust outlier"],"phonetic":"/ˈklɪpən/","extraExplanation":["“Klippe / klippen”源自德语，在英文地质学中作为借词使用，常见于构造地质与山脉造山带（如阿尔卑斯）研究语境。","注意不要与日常德语里的“die Klippen（悬崖、峭壁）”混淆；英语里作为地质术语时，含义更专门，指与推覆体相关的“残留孤立岩块”。","相关术语：与“klippe”相对的是“fenster（构造窗）”，指侵蚀或剥蚀后露出下覆岩层的“窗口”。"]}
{"word":"klipspringer","summary":{"en":"A klipspringer is a small African antelope that lives on rocky terrain and is known for agile jumping.","zh":"klipspringer（岩羚）是一种生活在非洲岩石地形中的小型羚羊，以敏捷跳跃著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small African antelope that lives in rocky hills and is famous for jumping and balancing on rocks","zh":"一种生活在非洲岩石山地的小型羚羊，以善于跳跃、在岩石上灵活站立而闻名"},"examples":[{"en":"We spotted a klipspringer standing on a cliff ledge above the valley.","zh":"我们看到一只岩羚站在山谷上方的悬崖岩架上。"},{"en":"The klipspringer can move quickly across steep, rocky ground.","zh":"岩羚能在陡峭的岩石地形上快速移动。"}]}],"synonyms":["rock jumper","antelope"],"phonetic":"ˈklɪpˌsprɪŋər","extraExplanation":["“Klipspringer”一词来自南非荷兰语（Afrikaans），klip 意为“岩石”，springer 意为“跳跃者”，字面意思就是“岩石跳跃者”。","它们的蹄子较小、适合踩在岩石边缘，常成对活动，栖息在多岩石的山坡与峭壁附近。"]}
{"word":"klipvis","summary":{"en":"a South African term for a rock-dwelling coastal fish","zh":"南非用语：栖息岩礁近岸的海鱼（地方俗称）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English) a rock-dwelling coastal fish; often used as a local name for certain rockfish/rock-cod–type species.","zh":"（南非英语）一种栖息在礁石、岩岸附近的海鱼；常作为某些“岩鱼/石斑类（地方俗称）”鱼种的统称或俗名。"},"examples":[{"en":"The menu listed grilled klipvis with lemon and garlic butter.","zh":"菜单上写着“烤klipvis（岩礁鱼）”，配柠檬和蒜香黄油。"},{"en":"Fishermen warned that klipvis are hard to spot among the rocks.","zh":"渔民提醒说，klipvis在岩石间不容易看见。"},{"en":"In some South African markets, klipvis refers to different local species depending on the coast.","zh":"在南非一些市场里，klipvis在不同海岸可能指不同的本地鱼种。"}]}],"synonyms":["rockfish","rock cod","reef fish"],"phonetic":"/ˈklɪp.vɪs/","extraExplanation":["这是明显的地域词（多见于南非语境）。在不同地区/渔市里，它可能对应不同的具体鱼种，因此更像“地方俗称/统称”，不是严格的生物学单一物种名称。"],"etymology":"源自南非荷兰语/荷兰语：klip（“岩石”）+ vis（“鱼”），字面意思是“岩石鱼”，引申为“栖息在岩礁附近的鱼”。","mnemonic":["拆开记：klip≈“clip/石头边缘”联想到“岩石”，vis在多种欧洲语言里与“鱼”有关（如法语 poisson 也常见于菜单语境），合起来就是“岩石里的鱼”。","联想中文：看见“klipvis”就想“石头（klip）+鱼（vis）= 石鱼/岩礁鱼”。"]}
{"word":"klismoi","summary":{"en":"Klismoi are ancient Greek-style chairs (plural of klismos), known for their elegant curved design.","zh":"Klismoi指古希腊式椅子（klismos的复数），以优雅的弧形线条著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(art/design) A type of ancient Greek chair with a curved, elegant back and legs; often seen in classical art and later “neoclassical” furniture. “Klismoi” is the plural of “klismos.”","zh":"（艺术/设计）一种古希腊椅子，特点是靠背与椅腿线条优雅、呈弧形；常见于古典艺术作品与后来的新古典主义家具中。“klismoi”是“klismos”的复数。"},"examples":[{"en":"The museum displayed two klismoi beside a marble statue from the Classical period.","zh":"博物馆在一尊古典时期的大理石雕像旁展出了两把klismoi（古希腊式椅）。"},{"en":"Neoclassical designers copied the klismos shape, so you may see klismoi in modern interiors.","zh":"新古典主义设计师借鉴了klismos的造型，所以你也可能在现代室内装饰中看到klismoi。"}]}],"synonyms":["klismos chairs","ancient Greek chairs","neoclassical chairs"],"phonetic":"/ˈklɪz.mɔɪ/","extraExplanation":["“Klismos”（单数）是希腊语词，英文里常用于艺术史、考古与家具设计语境；“klismoi”是其希腊式复数形式。日常英语里更常直接说“klismos chair(s)”。","发音在英语中不算完全固定；很多人会按英文习惯读成类似“KLIZ-moy”。"]}
{"word":"klismos","summary":{"en":"A klismos is an elegant ancient Greek chair with curved legs and a curved back.","zh":"Klismos 指一种优雅的古希腊椅子，特点是弯曲的椅腿与弧形靠背。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of ancient Greek chair known for its elegant, curved backrest and outward-curving legs.","zh":"一种古希腊椅子，以优雅的弧形靠背和向外弯曲的椅腿为特征。"},"examples":[{"en":"The museum displayed a reconstructed klismos chair from classical Greece.","zh":"博物馆展出了一把复原的古典时期希腊 klismos 椅。"},{"en":"In the painting, the figure sits on a klismos with a curved back.","zh":"在画中，人物坐在一把带弧形靠背的 klismos 椅上。"}]}],"synonyms":["ancient Greek chair","classical chair"],"phonetic":"/ˈklaɪzməs/","extraExplanation":["“Klismos”源自希腊语，常用来指公元前5世纪左右流行的一种椅型。它在古希腊陶瓶画与浮雕中经常出现，因线条轻盈、比例优美，后来在欧洲的新古典主义家具设计中也被复兴与模仿。","在英语里它属于较专业的艺术史/家具史词汇，日常生活中不常用；写作时常见于博物馆说明、室内设计或古典文化语境。"]}
{"word":"klister","summary":{"en":"Klister is a very sticky grip wax for cross-country skis, used mainly in wet or icy snow.","zh":"Klister 指越野滑雪用的高黏度抓地蜡，多用于湿雪或结冰雪况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very sticky type of grip wax used on cross-country skis, especially in wet or icy conditions","zh":"（越野滑雪用的）克里斯特蜡；一种非常黏的抓地蜡，常用于潮湿或结冰的雪况"},"examples":[{"en":"The snow was wet and icy, so she applied klister for better grip.","zh":"雪又湿又结冰，所以她涂了克里斯特蜡来增强抓地力。"},{"en":"Be careful—klister is extremely sticky and can get on your gloves.","zh":"小心——克里斯特蜡特别黏，容易沾到手套上。"},{"en":"Many skiers carry both hard wax and klister to match changing conditions.","zh":"很多滑雪者会同时带硬蜡和克里斯特蜡，以应对变化的雪况。"}]}],"synonyms":["grip wax","ski wax"],"phonetic":"/ˈklɪstər/","extraExplanation":["“Klister”常见于北欧与越野滑雪语境，源自瑞典语，指一种在“湿雪/冰壳/接近融化”的复杂雪况下仍能提供抓地力的滑雪蜡。由于非常黏，涂抹与清理时通常会用到刮板与专用清洁剂。"]}
{"word":"klisters","summary":{"en":"Klisters are sticky ski waxes used for grip in wet or icy snow.","zh":"Klisters 指用于湿雪或冰雪条件、增强抓地力的黏性滑雪蜡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural: klisters) A sticky type of ski wax used mainly in wet, icy, or coarse-grained snow to improve grip (especially for cross-country skis).","zh":"（常用复数：klisters）一种很黏的滑雪蜡，主要用于潮湿、结冰或粗颗粒雪面，以增强抓地力（尤指越野滑雪）。"},"examples":[{"en":"The temperature rose above freezing, so I put on klisters for better grip.","zh":"气温升到零度以上，所以我涂了klister（黏蜡）来增强抓地力。"},{"en":"Klisters can feel messy, but they work well on icy tracks.","zh":"Klister会比较黏、容易弄脏，但在结冰的雪道上很管用。"}]}],"synonyms":["ski wax","grip wax (specific type)"],"phonetic":"/ˈklɪstər/","extraExplanation":["“Klister”多见于北欧和越野滑雪语境，源自瑞典语，意思接近“黏的东西”。在英语滑雪圈里常直接用这个外来词。","使用上通常与“hard wax（硬蜡）”对比：硬蜡适合干冷细雪；klister更适合湿雪、冰面或雪晶粗的情况。"]}
{"word":"klm","summary":{"en":"Royal Dutch Airlines; also used as a simple letter-label.","zh":"荷兰皇家航空；也可作字母标签使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A major airline based in the Netherlands; the initials of its Dutch name, commonly known in English as KLM (Royal Dutch Airlines).","zh":"荷兰的一家大型航空公司；其荷兰语公司名的首字母缩写，英文中常称为KLM（荷兰皇家航空）。"},"examples":[{"en":"We flew to Amsterdam on KLM.","zh":"我们搭乘KLM飞往阿姆斯特丹。"},{"en":"KLM is part of the Air France–KLM group.","zh":"KLM是法航—荷航集团的一部分。"}]},{"partOfSpeech":"other","definition":{"en":"A sequence of letters (K–L–M) sometimes used as a simple label (for example, in lists, buttons, or file names).","zh":"字母序列K–L–M，有时用作简单标签（例如清单、按钮或文件名中的标记）。"},"examples":[{"en":"Press the KLM key on the remote to open the menu.","zh":"按遥控器上的KLM键打开菜单。"}]}],"synonyms":["Royal Dutch Airlines"],"phonetic":"/keɪ ɛl ɛm/","extraExplanation":["在英文里，像KLM这种缩写通常按字母逐个读（比如“kay-el-em”），多用于机构、品牌、组织名称。写作时常用全大写。","如果你原本想问的是“km”（kilometer，公里），那是另一个缩写；KLM与“公里”无直接关系。"],"etymology":"作为航空公司名称：KLM来自荷兰语公司名“Koninklijke Luchtvaart Maatschappij”的首字母缩写，意思大致是“皇家航空公司”。该品牌自20世纪初沿用至今，在国际场景中常直接读作字母名。","mnemonic":["把KLM记成“看（K）—路（L）—迈（M）”：出行坐飞机看路程，联想到航空公司更容易记。","联想“去荷兰(Amsterdam) → KLM”：看到KLM就想到荷兰与阿姆斯特丹。"]}
{"word":"kln","summary":{"en":"“kln” is usually an abbreviation or typo, not a common English word.","zh":"“kln”通常是缩写或拼写/输入错误，不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually an abbreviation or a typo. Its meaning depends on the context (field, country, document, or message).","zh":"不是标准英语单词；通常是缩写或输入错误。具体含义取决于上下文（领域、国家、文件或聊天语境）。"},"examples":[{"en":"I saw “KLN” in the email, but I don’t know what it stands for.","zh":"我在邮件里看到“KLN”，但我不知道它代表什么。"},{"en":"Could you tell me what “kln” means in this sentence?","zh":"你能告诉我在这个句子里“kln”是什么意思吗？"}]}],"phonetic":"klɛn","extraExplanation":["“KLN/kln”更像是缩写。不同场景可能代表不同东西（例如组织名、地名、产品型号、学校/课程简称等）。如果你把它出现的完整句子或所在领域（例如工程、医学、聊天、游戏等）发我，我可以更准确地解释。"]}
{"word":"klo","summary":{"en":"“klo” is not a common English word; it’s usually an acronym, a name, or a typo, so you need context to know what it means.","zh":"“klo”不是常见英语词；多半是缩写、名字或打字错误，需要上下文才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most often seen as a name, a username, or an acronym whose meaning depends on the context.","zh":"不是标准英语单词；最常见于人名、用户名或缩写，具体含义取决于上下文。"},"examples":[{"en":"What does “KLO” stand for in this message?","zh":"这条信息里的“KLO”是什么意思/代表什么？"},{"en":"I saw “klo” in a comment, but it didn’t seem like an English word.","zh":"我在评论里看到“klo”，但看起来不像英语单词。"}]},{"partOfSpeech":"other","definition":{"en":"Sometimes a typo or informal spelling in chats (for example, someone may mistype another short word). The intended meaning must be guessed from the surrounding text.","zh":"有时是聊天中的打字错误或随意拼写（例如把别的短词打错）。需要结合上下文判断原意。"},"examples":[{"en":"Did you mean “kilo” or “KO” instead of “klo”?","zh":"你写的“klo”是想说“kilo”还是“KO”吗？"},{"en":"If a word looks strange, ask for clarification: “Sorry—what does ‘klo’ mean here?”","zh":"如果一个词看起来很奇怪，可以问清楚：“不好意思，这里的‘klo’是什么意思？”"}]}],"phonetic":"/kloʊ/","extraExplanation":["“KLO”也可能是特定机构、公司、项目的缩写（例如学校、社团、系统名等），这种情况下必须提供完整句子或来源平台才能确定含义。","如果你是在某个语言的社交媒体上看到“klo”（例如印尼语口语里常见的缩写），那它可能不是英语用法。把原句发来我可以帮你判断。"]}
{"word":"klobuk","summary":{"en":"a traditional Central European hat; in English, a loanword used mainly in cultural or folk contexts.","zh":"中欧传统帽；英语中多作外来词用于民俗/文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hat (especially a traditional Czech/Slovak-style hat, often brimmed).","zh":"帽子；（尤指）捷克/斯洛伐克传统帽（常带帽檐）。"},"examples":[{"en":"He wore a black klobuk as part of his folk costume.","zh":"他在民族服饰中戴了一顶黑色的传统帽（klobuk）。"},{"en":"In the museum, a klobuk is displayed next to other Central European clothing.","zh":"在博物馆里，一顶klobuk和其他中欧服饰一起展出。"}]}],"synonyms":["hat","cap","brimmed hat"],"phonetic":"/ˈkloʊbʊk/","extraExplanation":["在捷克语和斯洛伐克语里，klobuk/klobúk 是日常词，泛指“帽子”；但在英语文本中通常带有“地域/民族风格”的色彩，用来指中欧传统帽饰。","英文里更常见的对应词是 hat / cap；klobuk 更像是“借用外来词”，常出现在民俗、历史、服装研究或旅行描写中。"],"etymology":"源自斯拉夫语词汇（如捷克语/斯洛伐克语 klobúk），本义就是“帽子”，进入英语时多用于描述中欧传统服饰或民俗语境。","mnemonic":["把它拆成发音记忆：klo-buk ≈ “klo（克罗）+ buk（布克）”，想象“克罗地亚/中欧风的布料做的帽子”，就联想到“中欧传统帽”。","联想中文“扣（kòu）+布（bù）”：把帽子“扣”在头上、帽子常是“布”做的 → 记住是“帽子”。"]}
{"word":"kLOC","summary":{"en":"a software metric equal to 1,000 lines of code.","zh":"等于一千行代码的软件度量单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit used in software engineering meaning “one thousand lines of source code,” often used to estimate project size or productivity.","zh":"软件工程中的计量单位，表示“一千行源代码”，常用来估算项目规模或生产率。"},"examples":[{"en":"The legacy system is about 250 kLOC, so refactoring will take time.","zh":"这个遗留系统大约有 250 kLOC，所以重构会花不少时间。"},{"en":"They reported defects per kLOC to compare modules of different sizes.","zh":"他们用“每 kLOC 的缺陷数”来比较不同规模的模块。"}]}],"synonyms":["thousand lines of code","LOC","KSLOC"],"phonetic":"/ˌkeɪˌɛl.oʊˈsiː/","extraExplanation":["kLOC 常出现在项目管理与质量报告里（例如“缺陷/ kLOC”“成本/ kLOC”）。但它也常被批评：代码行数会受语言、风格、自动生成代码等影响，不能单独代表难度或价值。"],"etymology":"来自度量前缀 k-（kilo-，表示“千”）+ LOC（lines of code，“代码行数”）的缩写组合，用于软件规模度量。","mnemonic":["把 k 当成“kilo=千”（和 kg、km 一样），LOC 就是 lines of code：合起来就是“千行代码”。","联想中文：k≈“千”的度量前缀，LOC≈“代码行”，所以 kLOC=“千行代码量”。"]}
{"word":"klockmannite","summary":{"en":"Klockmannite is a mineral consisting mainly of copper selenide (CuSe).","zh":"Klockmannite 是一种主要由硒化铜（CuSe）组成的矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral made mainly of copper selenide (CuSe), typically found in some selenium-rich ore deposits.","zh":"一种矿物，主要成分为硒化铜（CuSe），常见于富硒的矿床或矿石中。"},"examples":[{"en":"Klockmannite is a copper selenide mineral that can occur with other selenium-bearing minerals.","zh":"Klockmannite 是一种硒化铜矿物，可能与其他含硒矿物共生。"},{"en":"The lab identified the dark metallic grains as klockmannite (CuSe).","zh":"实验室将这些深色金属光泽的颗粒鉴定为 klockmannite（CuSe）。"}]}],"synonyms":["copper selenide (mineral context)"],"phonetic":"/ˈklɑk.mə.naɪt/","extraExplanation":["“klockmannite”是矿物学术语，来源于人名（常见于以矿物学家命名的矿物）。在实际阅读中，它多出现于地质报告、矿物鉴定、矿床学与矿物标本说明中。","它与“copper selenide（硒化铜）”是密切相关的概念：前者指特定矿物名称（具有矿物学定义与结构），后者是化学类别/组成的泛称。"]}
{"word":"kloesse","summary":{"en":"“Clothes” means the things you wear; “clothe” (more formal) means to dress or provide clothing.","zh":"“clothes”指衣服、服装；“clothe”（更正式）指给……穿衣或提供衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things that you wear (shirts, pants, dresses, etc.); clothing","zh":"衣服；服装（你穿在身上的东西，如衬衫、裤子、裙子等）"},"examples":[{"en":"I need to buy new clothes for work.","zh":"我需要买一些新的上班衣服。"},{"en":"Put your dirty clothes in the laundry basket.","zh":"把脏衣服放进洗衣篮里。"},{"en":"It’s cold today, so wear warm clothes.","zh":"今天很冷，所以穿暖和的衣服。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover or dress someone or something; to provide clothing","zh":"给……穿衣；覆盖；为……提供衣物"},"examples":[{"en":"She clothed the child in a warm coat.","zh":"她给孩子穿上了一件暖和的外套。"},{"en":"The charity helps clothe people in need.","zh":"这个慈善机构帮助有需要的人获得衣物。"}]}],"synonyms":["clothing","apparel","garments"],"phonetic":"/kloʊðz/","extraExplanation":["“kloesse”很可能是拼写错误；常见目标词是 **clothes**（衣服）。","**clothes** 是复数名词，通常不用作单数；说“一件衣服”常用 **a piece/item of clothing** 或直接说具体种类（a shirt, a coat）。","动词形式是 **clothe**（较正式），日常更常用 **dress**（给……穿衣）或 **wear**（穿着）。"]}
{"word":"klom","summary":{"en":"“klom” isn’t a standard English word; it’s likely a typo or a name/abbreviation.","zh":"“klom”不是标准英语单词；更可能是拼写错误或专有名词/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo or a name/abbreviation.","zh":"不是标准英语单词，可能是拼写错误、姓名或缩写。"},"examples":[{"en":"I can’t find “klom” in major English dictionaries—did you mean “clown,” “clock,” or “KLM”?","zh":"在主要英语词典里查不到“klom”——你是不是想写“clown（小丑）”、“clock（时钟）”或“KLM（荷航）”？"},{"en":"If you tell me the sentence you saw it in, I can help you figure out the meaning.","zh":"如果你把它出现的句子发给我，我可以帮你判断它的意思。"}]}],"extraExplanation":["“klom”更像是：①拼写错误（少打/多打字母）；②某种专有名词（游戏ID、品牌名、地名、人名）；③缩写（如航空公司KLM，通常写作大写）。建议你提供上下文（整句/来源/想表达的中文意思），我就能给出最可能的正确单词与用法。"]}
{"word":"Klondike","summary":{"en":"Klondike is a Yukon region famous for the 1890s gold rush; it can also mean a chance to get rich, and it’s the name of a U.S. ice-cream-bar brand.","zh":"Klondike指加拿大育空地区因19世纪90年代淘金热而闻名的克朗代克；也可引申为“发财机会”，并且还是美国一种雪糕品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in northwestern Canada (in the Yukon) famous for the Klondike Gold Rush in the late 1890s; often used to refer to that gold-rush area and history","zh":"克朗代克（加拿大育空地区的一片区域），因19世纪90年代末的“克朗代克淘金热”而闻名；也常用来指那段淘金历史与地区"},"examples":[{"en":"Many people traveled to the Klondike hoping to find gold.","zh":"许多人前往克朗代克，希望能找到黄金。"},{"en":"The museum has photos from the Klondike Gold Rush.","zh":"博物馆里有克朗代克淘金热时期的照片。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a place or opportunity where people hope to get rich quickly","zh":"（非正式）“发财宝地；暴富机会”（指人们期望能快速致富的地方或机会）"},"examples":[{"en":"In the 1990s, some people saw the internet as a new Klondike.","zh":"在20世纪90年代，有些人把互联网看作新的“克朗代克”。"},{"en":"Everyone rushed in, thinking it was their Klondike.","zh":"大家一拥而上，以为那就是自己的“发财机会”。"}]},{"partOfSpeech":"n.","definition":{"en":"a brand name for an ice cream bar (especially in the U.S.)","zh":"（尤指在美国）“Klondike”冰淇淋棒/雪糕品牌名"},"examples":[{"en":"He bought a Klondike bar at the gas station.","zh":"他在加油站买了一根Klondike雪糕。"}]}],"synonyms":["(figurative) gold mine","(figurative) bonanza","(figurative) El Dorado"],"phonetic":"ˈklɑnˌdaɪk","extraExplanation":["“Klondike”源自当地原住民语言（经法语/英语转写），后来因1896年前后在育空河流域发现黄金而爆红，形成“Klondike Gold Rush”（克朗代克淘金热）。这段历史在北美文化里常象征“冒险、淘金、暴富梦”。","文学与文化里常见“Klondike”意象：例如杰克·伦敦（Jack London）的多部作品以育空淘金时代为背景（如《野性的呼唤》）。这也强化了“艰苦环境+寻金冒险”的联想。"]}
{"word":"klondike","summary":{"en":"Klondike most commonly refers to a Yukon region in Canada and the famous late-1800s gold rush there; it can also mean a Klondike Bar or a solitaire game.","zh":"Klondike最常指加拿大育空的克朗代克地区及19世纪末的克朗代克淘金热；也可指“Klondike Bar”雪糕或一种接龙纸牌游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in the Yukon Territory of northwestern Canada, famous for major gold discoveries in the late 1800s (especially along the Klondike River).","zh":"（加拿大西北部育空地区的）克朗代克地区；因19世纪末的重大淘金发现而闻名（尤其在克朗代克河流域）。"},"examples":[{"en":"Many fortune-seekers traveled to the Klondike after gold was discovered there.","zh":"在那里发现黄金后，许多追逐财富的人前往克朗代克。"},{"en":"The museum has photos from early camps in the Klondike region.","zh":"博物馆里有克朗代克地区早期营地的照片。"}]},{"partOfSpeech":"n.","definition":{"en":"the Klondike Gold Rush (1896–1899), a historical event when tens of thousands of people rushed to the area hoping to find gold.","zh":"克朗代克淘金热（1896–1899）；指成千上万人涌入当地寻金的历史事件。"},"examples":[{"en":"The novel is set during the Klondike, when life was harsh and uncertain.","zh":"这部小说以克朗代克淘金热时期为背景，当时生活艰苦而充满不确定。"},{"en":"He studied how the Klondike changed the economy of the Pacific Northwest.","zh":"他研究克朗代克淘金热如何改变了太平洋西北地区的经济。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a Klondike Bar, a popular American ice-cream treat coated in chocolate.","zh":"（常大写）克朗代克雪糕/冰淇淋棒（Klondike Bar）；美国常见的巧克力脆皮冰淇淋点心。"},"examples":[{"en":"I grabbed a Klondike from the freezer after dinner.","zh":"晚饭后我从冰箱里拿了一根克朗代克雪糕。"},{"en":"The commercial asked, “What would you do for a Klondike Bar?”","zh":"广告里问：“为了克朗代克雪糕你愿意做什么？”"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a type of solitaire card game sometimes called “Klondike” (the classic one-player game many people know from computers).","zh":"（较少见）一种纸牌接龙游戏，常称“Klondike/克朗代克接龙”（很多人熟悉的经典电脑单人接龙）。"},"examples":[{"en":"When the internet went down, she played Klondike on her laptop.","zh":"网络断了的时候，她在笔记本上玩克朗代克接龙。"},{"en":"Klondike solitaire is easy to learn but not always easy to win.","zh":"克朗代克接龙容易学，但不一定容易赢。"}]}],"synonyms":["Yukon (region)","gold rush (general meaning)"],"phonetic":"/ˈklɑn.daɪk/","extraExplanation":["“Klondike”这个名字来自当地原住民语言（经由法语拼写影响），原意常被解释为“用木桩敲（河水）/打桩”的意思，和早期在河里捕鱼、设陷阱等做法有关。","克朗代克淘金热与美国作家杰克·伦敦（Jack London）的作品关系密切，例如《野性的呼唤》（The Call of the Wild）和《白牙》（White Fang）都借用了育空/淘金热时期的严酷环境与人性考验。"]}
{"word":"klondiker","summary":{"en":"A Klondiker is someone who went to the Klondike during the Klondike Gold Rush, usually to look for gold.","zh":"Klondiker 指在克朗代克淘金热时期前往克朗代克地区的人，通常是去淘金的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who went to the Klondike region (in northwestern Canada) during the Klondike Gold Rush, especially to search for gold","zh":"在“克朗代克淘金热”时期前往加拿大西北部克朗代克地区的人，尤指去淘金的人"},"examples":[{"en":"Stories of tough Klondikers often describe months of travel through snow and ice.","zh":"关于坚韧的克朗代克淘金者的故事常常描写他们在冰雪中跋涉数月。"},{"en":"Her great-grandfather was a Klondiker who tried his luck in the goldfields.","zh":"她的曾祖父是一名克朗代克淘金者，曾去金矿区碰碰运气。"}]}],"synonyms":["prospector","gold seeker","gold rush miner"],"phonetic":"/ˈklɑnˌdaɪkər/","extraExplanation":["“Klondiker”来自“Klondike”（克朗代克），多与1896–1899年前后的“Klondike Gold Rush（克朗代克淘金热）”相关。当时许多人涌入育空地区（Yukon）寻找金矿，因此“Klondiker”带有“淘金者/探矿者、冒险者”的历史色彩。","拼写提醒：常见名词是“Klondiker”；更常见的地名/形容用法是“Klondike”（如：Klondike Gold Rush）。"]}
{"word":"klong","summary":{"en":"Klong usually means a Thai canal (often spelled “khlong”); it can also mean a traditional Thai drum.","zh":"Klong 通常指泰国的运河（常拼作 khlong）；也可指一种泰国传统鼓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Thai) a canal or waterway, especially in Thailand (often spelled “khlong”).","zh":"（源自泰语）运河；河渠（尤指泰国的水道，常见拼写为“khlong”）。"},"examples":[{"en":"Bangkok is famous for its network of klongs.","zh":"曼谷以其纵横交错的运河（klongs）而闻名。"},{"en":"We took a small boat through the klong to see local markets.","zh":"我们乘小船穿过运河（klong）去看当地市场。"}]},{"partOfSpeech":"n.","definition":{"en":"a traditional Thai drum (a loanword sometimes written “klong/khlong”).","zh":"泰国传统鼓（一种外来词，有时写作“klong/khlong”）。"},"examples":[{"en":"The music featured a klong and other Thai percussion instruments.","zh":"这段音乐使用了泰国鼓（klong）和其他打击乐器。"}]}],"synonyms":["canal","waterway","channel"],"phonetic":"/klɔŋ/","extraExplanation":["“Klong”更常见于旅游、地理或文化介绍中，指泰国的水道系统；学术或更贴近泰语转写的拼法常为“khlong”。","在泰国文化语境里，“khlong/klong”既可能指运河，也可能指某些类型的传统鼓；具体含义通常要看上下文（地理/交通 vs. 音乐/表演）。"]}
{"word":"klongs","summary":{"en":"Klongs are Thai canals/waterways; the word can also mean a traditional Thai drum (often spelled khlong).","zh":"klongs 指泰国的运河/水道；也可指泰国传统鼓（常拼作 khlong）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a canal or waterway in Thailand, especially in and around Bangkok; plural: klongs.","zh":"（泰国的）运河；（尤指）曼谷及周边地区的水道；复数：klongs。"},"examples":[{"en":"Many traditional houses in Bangkok once faced the klongs instead of the roads.","zh":"曼谷许多传统民居过去是朝向运河（klongs）而不是马路的。"},{"en":"We took a boat through the klongs to see local markets.","zh":"我们坐船穿行在运河（klongs）里去看当地的集市。"}]},{"partOfSpeech":"n.","definition":{"en":"a traditional Thai drum (often spelled khlong); plural: klongs.","zh":"（泰国传统）鼓（常见拼写为 khlong）；复数：klongs。"},"examples":[{"en":"The dancers entered as the klongs began to play.","zh":"鼓（klongs）声一响，舞者就登场了。"}]}],"synonyms":["canals","waterways","khlongs"],"phonetic":"/klɔŋ/","extraExplanation":["“klong”常见于旅行写作与地理语境，指泰国的运河系统；更常见的英语转写是“khlong”，因为泰语里有送气音，英语里有时用“kh-”来表示。","“klongs of Bangkok”（曼谷运河）在英语文本中很常见，涉及“水上生活、河岸社区、浮动市场”等文化意象。"]}
{"word":"klooch","summary":{"en":"“Klooch” is a Chinook Jargon word meaning “woman/wife,” but in modern English it is often considered offensive when used for Indigenous women.","zh":"“klooch”源自奇努克行话，原意为“女人/妻子”，但在现代英语中用于指原住民女性时常被认为具有冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chinook Jargon, Northwestern North America) a woman; sometimes specifically a wife.","zh":"（奇努克混合语/奇努克行话，北美西北部）女人；有时特指妻子。"},"examples":[{"en":"In some historical records, “klooch” was used to mean “woman” in Chinook Jargon.","zh":"在一些历史记载中，“klooch”在奇努克行话里用来表示“女人”。"},{"en":"The trader wrote that he met a “klooch” and her family at the river camp.","zh":"那位商人写道，他在河边营地遇到一位“klooch”和她的家人。"}]},{"partOfSpeech":"n.","definition":{"en":"(often offensive today) a term used by outsiders for an Indigenous woman in the Pacific Northwest; commonly felt as disrespectful or racist in modern English.","zh":"（如今常被视为冒犯）外来者用来指北美太平洋西北地区原住民女性的称呼；在现代英语中常被认为不尊重或带有种族歧视色彩。"},"examples":[{"en":"Avoid using “klooch” in modern conversation, because many people experience it as a slur.","zh":"现代交流中应避免使用“klooch”，因为许多人会把它当作侮辱性称呼。"},{"en":"The book discusses how words like “klooch” shifted from trade jargon into offensive labels.","zh":"那本书讨论了像“klooch”这样的词如何从贸易行话演变成带冒犯性的标签。"}]}],"synonyms":["woman","wife (historical sense)","Indigenous woman (preferred modern alternative)"],"phonetic":"/kluːtʃ/","extraExplanation":["“klooch”源自太平洋西北地区历史上的贸易混合语（Chinook Jargon），与表示“女人/妻子”的形式（常见作“kloochman/kluchman”等拼写变体）有关。后来在殖民语境与刻板印象中被外来者用来指原住民女性，因此在当代英语里常被视为不尊重甚至带侮辱性。","学习与使用建议：若你想表达“原住民女性”，可用更中性、尊重的说法（如“Indigenous woman”或具体民族名称+“woman”）。只有在讨论历史文本、语言学或引用原文时，才可能需要提到该词，并应注明其冒犯性。"]}
{"word":"kloof","summary":{"en":"A kloof is a deep, narrow valley or gorge, commonly used in South African English.","zh":"kloof 指深而窄的山谷或峡谷，常见于南非英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep, narrow valley or gorge, especially in South Africa.","zh":"（尤指南非的）峡谷；深而窄的山谷。"},"examples":[{"en":"They hiked along the edge of a kloof at sunrise.","zh":"他们在日出时沿着峡谷边缘徒步。"},{"en":"After heavy rain, water rushed through the kloof.","zh":"暴雨过后，水流冲过峡谷。"}]}],"synonyms":["gorge","ravine","canyon"],"phonetic":"/kluːf/","extraExplanation":["“kloof”常见于南非英语，源自南非荷兰语/荷兰语“kloof”，意为“裂缝、峡谷”。在描写南非地貌（如桌山周边、山地灌木丛地区）时很常用。","相关近义词可按语境选择：gorge（峡谷，常有河流）、ravine（沟壑/深谷）、canyon（大峡谷，常指规模更大者）。"]}
{"word":"kloofs","summary":{"en":"“Kloofs” means deep, narrow ravines/valleys, mainly used in South African English.","zh":"“kloofs”指深而狭窄的峡谷/山谷，主要见于南非英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “kloof”: a deep, narrow valley or ravine (especially in South Africa).","zh":"“kloof”的复数：深而狭窄的山谷、峡谷（尤用于南非语境）。"},"examples":[{"en":"The hikers followed a stream down into the kloofs.","zh":"徒步者沿着溪流走进那些深谷里。"},{"en":"In the Western Cape, steep slopes often drop into dramatic kloofs.","zh":"在西开普省，陡峭的坡面常常直落入壮观的峡谷。"}]}],"synonyms":["ravines","gorges","canyons","valleys"],"phonetic":"/kluf/","extraExplanation":["“kloof”常见于南非英语，源自南非荷兰语/南非语（Afrikaans），本义接近“裂缝、沟壑、峡谷”。在南非地名中也很常见，例如某些地名会包含“Kloof”。","书面英语中，在南非以外的地区更常用“ravine”“gorge”“canyon”等词；选择哪一个取决于地形大小与语境。"]}
{"word":"klootch","summary":{"en":"A regional/older word meaning “to clutch; hold tightly,” especially associated with the Pacific Northwest.","zh":"一个带地区色彩/较旧的词，意思是“抓紧、紧握”，常与美国西北部用语有关。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to grasp or hold tightly; to clutch","zh":"抓紧；紧握（相当于 clutch）"},"examples":[{"en":"He klootched the rope with both hands to keep from slipping.","zh":"他用双手紧紧抓住绳子，防止滑落。"},{"en":"The child klootched her mom’s coat in the crowd.","zh":"在人群中，孩子紧紧抓住妈妈的外套。"}]},{"partOfSpeech":"n.","definition":{"en":"a tight grasp or hold; a clutch","zh":"紧握；抓住（名词用法，较少见）"},"examples":[{"en":"With a firm klootch on the railing, she stepped down carefully.","zh":"她牢牢抓住栏杆，小心地下台阶。"}]}],"synonyms":["clutch","grip","grasp","hold tight"],"phonetic":"/klutʃ/","extraExplanation":["“klootch”多见于美国西北部（Pacific Northwest）的地区用语，来源与 Chinook Jargon（奇努克混合语/商贸语）有关，常见拼写还有 klutch / klooch / klootch。","它在意义上与标准英语“clutch（抓紧）”非常接近；写作时一般建议用更常见的“clutch”，除非你在表现地方口吻、历史背景或口语风格。"]}
{"word":"klootchman","summary":{"en":"A historical term from Chinook Jargon meaning “woman,” later used in frontier English for a Native woman or female partner; now often considered offensive.","zh":"源自奇努克混合语的历史词，原意为“女人”，后在边疆英语中指原住民女性或女伴；如今常被视为冒犯用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, now often offensive) A Native woman in the Pacific Northwest; in older frontier writing it was also used for a wife, female partner, or domestic servant (especially in relations between white settlers and Native peoples).","zh":"（历史用语，现常被视为冒犯）指太平洋西北地区的原住民女性；在早期边疆文字中也被用来指“妻子/女伴/女佣”，尤其出现在白人移民与原住民之间的关系语境里。"},"examples":[{"en":"The word appears in some 19th‑century diaries, but many readers today consider it derogatory.","zh":"这个词出现在一些19世纪的日记里，但如今许多读者认为它带有贬义。"},{"en":"In modern writing, it’s better to say “Native woman” or name the specific Nation/tribe when known.","zh":"在现代写作中，更建议说“原住民女性”，或在可能时写出具体的民族/部族名称。"}]}],"synonyms":["Native woman (preferred modern wording)","Indigenous woman (preferred modern wording)"],"phonetic":"/ˈkluːtʃmən/","extraExplanation":["“klootchman”（也常见拼写：clootchman / klootchman）源自 Chinook Jargon（奇努克混合语/皮钦语）中的 *klúuchman*，原义接近“女人”。随着殖民时期的使用，它在一些英语边疆叙事里被带上了刻板印象与不平等关系的含义，因此在当代语境中往往被视为不尊重甚至侮辱。","如果你是在阅读历史文本：可以把它当作“当时的用词”，并在转述或写作时用更中性、准确的表达替换（例如：Indigenous woman / Native woman，或具体族名）。"]}
{"word":"klop","summary":{"en":"Klop usually means “knock/tap” (v.) or “a knock” (n.), mainly in South African usage; it can also be an informal nickname for Jürgen Klopp.","zh":"Klop 通常指“敲/轻敲”（动词）或“敲击声”（名词），多见于南非英语；也可能是对教练 Jürgen Klopp 的非正式简称。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to knock (on a door), tap, or beat something repeatedly (often used in South African English, from Afrikaans/Dutch)","zh":"敲（门）、轻敲；反复敲打/击打（常见于南非英语，源自南非荷兰语/荷兰语）"},"examples":[{"en":"Someone is klopping at the door—can you check who it is?","zh":"有人在敲门——你能去看看是谁吗？"},{"en":"He klopped the table to get everyone’s attention.","zh":"他敲了敲桌子来引起大家注意。"}]},{"partOfSpeech":"n.","definition":{"en":"a knock or a series of knocks; a tapping sound","zh":"敲击声；一阵敲门声"},"examples":[{"en":"I heard a klop on the window late at night.","zh":"我深夜听到窗户上传来一声敲击。"},{"en":"After a few klops, the door finally opened.","zh":"敲了几下之后，门终于开了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sports) a shortened form some fans use for football coach Jürgen Klopp, though the common spelling is “Klopp”","zh":"（非正式，体育）一些球迷对足球教练尤尔根·克洛普（Jürgen Klopp）的简称，但更常见的拼写是“Klopp”"},"examples":[{"en":"Some fans online call him “Klop,” but “Klopp” is the standard spelling.","zh":"有些球迷在网上叫他“Klop”，但标准拼写是“Klopp”。"}]}],"synonyms":["knock","tap","pound","rap"],"phonetic":"/klɑp/","extraExplanation":["“klop”在标准美式英语中不算常用词，更常见的是 knock, tap, pound 等。它常见于南非英语语境，来自南非荷兰语（Afrikaans）/荷兰语的同源词，意思与英语 knock 很接近。","如果你是在足球语境看到“Klop”，多数情况下是指教练 Jürgen Klopp；正式拼写一般为“Klopp”（双写 p）。"]}
{"word":"klops","summary":{"en":"A Polish-style meatball or a dish featuring such meatballs.","zh":"波兰风味的肉丸，或以此肉丸为主的菜肴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Polish-style meatball, often made from minced meat (commonly pork or beef) and served in a sauce or broth; “klops” can refer to one meatball, and it may also be used as a menu name for the dish.","zh":"（波兰风味）肉丸；常用绞肉（多为猪肉或牛肉）制作，并配酱汁或汤汁食用；“klops”既可指一颗肉丸，也可作为菜名指这道料理。"},"examples":[{"en":"I ordered klops with mushroom sauce for dinner.","zh":"我晚餐点了蘑菇酱汁的波兰肉丸（klops）。"},{"en":"The soup comes with one large klops in the bowl.","zh":"这碗汤里有一颗很大的波兰肉丸（klops）。"}]}],"synonyms":["meatball","Polish meatball","klopsy (plural form)"],"phonetic":"/klɑps/","extraExplanation":["“Klops”常见于波兰与中东欧菜谱/餐馆菜单；在波兰语里更常见的复数形式是“klopsy”（多颗肉丸）。不同地区做法不一：有的会在肉馅里加面包屑、洋葱、鸡蛋或香料，再用肉汁、蘑菇酱等搭配。"]}
{"word":"klopsy","summary":{"en":"Polish-style meatballs as a dish name.","zh":"作为菜名的波兰风味肉丸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Polish-style meatballs (often simmered in sauce); the plural form is commonly used in English to refer to the dish.","zh":"波兰风味肉丸（常在酱汁中炖煮）；在英语里常用复数形式来指这道菜。"},"examples":[{"en":"We had klopsy with mashed potatoes for dinner.","zh":"我们晚餐吃了波兰肉丸（klopsy）配土豆泥。"},{"en":"Her grandmother’s klopsy are slow-cooked in a creamy mushroom sauce.","zh":"她奶奶做的波兰肉丸会用奶油蘑菇酱慢炖。"}]}],"synonyms":["meatballs","klops"],"phonetic":"/ˈklɑp.si/","extraExplanation":["“klopsy”更多见于与波兰饮食相关的语境（家常菜、移民家庭食谱、餐馆菜单等）。不同地区做法会变化：可能用猪肉/牛肉混合，加入面包屑、洋葱和香料，再做成肉丸煎/烤后炖入酱汁。"],"etymology":"来自波兰语：单数常见为“klops”（肉丸/肉饼），复数为“klopsy”。英语语境中有时直接借用该复数形式来指这道肉丸菜。","mnemonic":["把它联想成“clumps（成团）”→ 肉馅“成团”变成肉丸；读音相近，记住它是“肉丸成团”。"]}
{"word":"klosh","summary":{"en":"Klosh is a rare Pacific Northwest dialect word meaning “good/OK,” sometimes used as an exclamation.","zh":"Klosh是较少见的太平洋西北地区方言词，意思是“好/没问题”，也可作感叹用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Pacific Northwest, informal, dialect) good; fine; okay; satisfactory.","zh":"（美国太平洋西北地区，非正式/方言）好的；不错；可以；令人满意的。"},"examples":[{"en":"The weather is klosh today—perfect for a walk.","zh":"今天天气很klosh——很适合散步。"},{"en":"Don’t worry, everything’s klosh.","zh":"别担心，一切都没问题（都挺好）。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal) an expression meaning “good!” “okay!” or “all right!”","zh":"（非正式）感叹用法：表示“好！”“可以！”“行！”"},"examples":[{"en":"“Klosh—let’s start at noon,” she said.","zh":"“行——那我们中午开始吧，”她说。"},{"en":"“Klosh!” he replied, and hung up.","zh":"“好！”他回答道，然后挂了电话。"}]}],"synonyms":["good","fine","OK","all right"],"phonetic":"/klɑʃ/","extraExplanation":["“klosh”常见于美国太平洋西北地区（如华盛顿州、俄勒冈州、卑诗一带）的历史语境里，多被认为来自奇努克混合语（Chinook Jargon）的“kloshe/klush”，意思是“好、可以”。","现代英语中它非常少见，更多出现在地方史、旧小说、口述记录或带地域色彩的对话里。日常口语更常用 good / fine / OK。"]}
{"word":"klosse","summary":{"en":"“klosse” usually refers to German dumplings (German: *Klöße*), often potato or bread dumplings served as a side dish.","zh":"“klosse”通常指德国的团子/丸子（德语 *Klöße*），多为土豆或面包团子，常作配菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German-style dumpling (often made from potatoes, bread, or flour), typically served as a side dish with meat and gravy; “klosse” is an English-friendly spelling of German *Klöße* (plural of *Kloß*).","zh":"德国风格的团子/丸子（常用土豆、面包或面粉制作），通常作为配菜搭配肉类和酱汁；“klosse”常被用作德语 *Klöße*（*Kloß* 的复数）的便于输入/阅读的拼写。"},"examples":[{"en":"The roast came with red cabbage and potato klosse.","zh":"烤肉配了红甘蓝和土豆团子（klosse）。"},{"en":"In Bavaria, people often eat Klöße with gravy in winter.","zh":"在巴伐利亚，人们冬天常把 Klöße 配肉汁一起吃。"}]}],"synonyms":["dumplings","potato dumplings","bread dumplings","Klöße","Knödel"],"phonetic":"ˈkloʊsə","extraExplanation":["“Kloß/Knödel”在德语区都可指“丸子/团子”，但地区用词不同：南德、奥地利更常见的是 *Knödel*；*Kloß* 在中北部也很常用。","德语复数是 *Klöße*（带变音符号 ö）。在没有德语键盘时，有时会写成 *Kloesse*；“klosse”也会在英文菜单或食谱里出现，属于外来词的简化拼写。"]}
{"word":"klowet","summary":{"en":"Not a standard English word; likely a misspelling (often of “closet”).","zh":"不是标准英语单词；很可能是拼写错误（常见是把“closet”拼错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“klowet” is not a standard English word. It is likely a misspelling or a non-English word/name. Common intended words include “closet” (a small room/cupboard for clothes) or “clot”/“clothed” depending on context.","zh":"“klowet” 不是标准英语单词，更可能是拼写错误，或是其他语言/名字。常见可能想写的是 “closet”（衣橱/壁橱），也可能与 “clot / clothed” 等词有关，需结合上下文判断。"},"examples":[{"en":"Did you mean “closet”? For example: “My coat is in the closet.”","zh":"你是不是想写 “closet”？例如：“我的外套在衣橱里。”"},{"en":"I couldn’t find “klowet” in a dictionary, so I checked the spelling.","zh":"我在词典里找不到 “klowet”，所以我检查了拼写。"}]}],"extraExplanation":["如果你能提供一句包含“klowet”的原句、它出现的场景（聊天/游戏/课本/人名/地名等）或你想表达的中文意思，我可以更准确地判断你要找的词（例如 closet / cloister / clotted 等）。","英语里有些发音接近“kloh-wet/klow-et”的词不多，所以更常见的情况是把“closet”拼错，或是输入法/听写导致的错误。"]}
{"word":"kluck","summary":{"en":"“Kluck” is a less common spelling of “cluck,” meaning the sound a hen makes, or (humorously) a disapproving/fussing sound or manner of speaking.","zh":"“Kluck”是“cluck”的不常见拼写，表示母鸡的咯咯叫声，也可（带幽默）指人表示不赞同/爱唠叨的声音或说话方式。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to make a short, low sound like a chicken (especially a hen)","zh":"（尤指母鸡）发出咯咯的叫声"},"examples":[{"en":"The hen klucked softly to her chicks.","zh":"母鸡轻轻地对小鸡咯咯叫。"},{"en":"I heard chickens klucking in the yard.","zh":"我听见院子里的鸡在咯咯叫。"}]},{"partOfSpeech":"vi.","definition":{"en":"to speak in a way that shows disapproval or fussing (often used humorously)","zh":"（常带幽默）用表示不赞同或爱唠叨的语气说话"},"examples":[{"en":"My aunt klucked at me for not wearing a coat.","zh":"我没穿外套，姨妈就用责备的语气念叨我。"},{"en":"He klucked disapprovingly when he saw the messy room.","zh":"他看到乱糟糟的房间时不满地啧啧出声。"}]},{"partOfSpeech":"n.","definition":{"en":"a short, low chicken-like sound","zh":"（像鸡一样的）咯咯声"},"examples":[{"en":"A kluck came from the coop.","zh":"鸡舍里传来一声咯咯叫。"}]}],"synonyms":["cluck","cackle","tsk"],"phonetic":"/klʌk/","extraExplanation":["“kluck”更常见的标准拼写是“cluck”。两者发音和意思基本相同；“kluck”多见于非标准拼写、儿童读物、方言化写法或为了表现声音的拟声词效果。","“cluck/kluck”既可指母鸡呼唤小鸡的声音，也常被借用来形容人发出表示不赞同、担心或唠叨的声音（类似‘tsk’那种感觉）。"]}
{"word":"klucker","summary":{"en":"“Klucker” is usually a nonstandard spelling of “clucker,” meaning a hen; it can also be an offensive slang term in some contexts.","zh":"“klucker”通常是“clucker”的非标准拼写，常指母鸡；在某些语境中也可能是带侮辱性的俚语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or misspelled form of “clucker,” meaning a hen (female chicken), especially one making the “cluck” sound.","zh":"“clucker”的非标准拼写或误拼，指母鸡（尤其是发出“咯咯/咯咯哒”叫声的那种）。"},"examples":[{"en":"The clucker stayed close to her chicks in the yard.","zh":"那只母鸡在院子里紧紧跟着小鸡。"},{"en":"I heard a clucker outside the window early in the morning.","zh":"一大早我就听到窗外有母鸡在叫。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, offensive in some contexts) A derogatory term for a person who is addicted to crack cocaine.","zh":"（俚语，在一些语境中带侮辱性）对“强效可卡因（crack）成瘾者”的贬称。"},"examples":[{"en":"That word is often used to insult people, so it’s better not to say it.","zh":"那个词常被用来辱骂别人，所以最好不要使用。"}]}],"synonyms":["hen","chicken","clucking hen"],"phonetic":"/ˈklʌkər/","extraExplanation":["“klucker”不是常见标准英语拼写；更常见的是“clucker”。如果你是在聊天、游戏名、昵称或方言里看到“klucker”，可能是为了造型/个性化而把 c 换成 k。","如果你想表达“母鸡/咯咯叫的鸡”，建议在正式写作中用“hen”或“clucking hen”，更清晰也更中性。","“clucker”在某些英语社区里也可能是侮辱性俚语（与毒品成瘾相关）。遇到不确定语境时，避免使用这个词更稳妥。"]}
{"word":"kludge","summary":{"en":"A “kludge” is a messy, improvised fix that works for now; it can also mean to make such a fix.","zh":"“kludge”指能暂时奏效但很粗糙的拼凑式解决方案；也可作动词表示用这种方式临时修补。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A clumsy or improvised solution that works, even if it’s messy or not well designed.","zh":"一个勉强能用但很笨拙、临时拼凑的解决方案（不够优雅或不够好设计）。"},"examples":[{"en":"The app runs, but it’s held together by a kludge that we should replace later.","zh":"这个应用能跑起来，但其实是靠一个拼凑的权宜之计撑着，之后应该替换掉。"},{"en":"We used a quick kludge to meet the deadline.","zh":"为了赶上截止日期，我们用了一个临时凑出来的办法。"}]},{"partOfSpeech":"v.","definition":{"en":"To patch or fix something in a quick, messy way so it works for now.","zh":"用一种临时、比较粗糙的方式修补/改造，使其暂时能用。"},"examples":[{"en":"I kludged the script so it wouldn’t crash during the demo.","zh":"我临时把脚本修补了一下，这样演示时就不会崩溃。"},{"en":"They kludged together a workaround instead of redesigning the system.","zh":"他们拼凑了一个替代方案，而不是重新设计系统。"}]}],"synonyms":["hack","workaround","patch","jury-rig","quick fix"],"phonetic":"/klʌdʒ/","extraExplanation":["“kludge”常见于计算机与工程语境，带有“能用就行、但不漂亮”的评价色彩。语气通常偏口语、略带自嘲或批评。","拼写有时会见到“kluge”（尤其在技术圈），但“kludge”更常被用来强调“笨重/拼凑”的感觉。","近义词（语气相近）：hack（临时招数/小技巧，语感有时更正面或中性）、workaround（绕开问题的办法，较中性）、patch（补丁）。反义倾向：elegant solution（优雅解）、clean design（干净的设计）。"]}
{"word":"kludged","summary":{"en":"Kludged means “fixed or built in a quick, messy, temporary way,” especially in tech.","zh":"kludged 指“用临时、笨拙但能用的方式拼凑/修补”，尤其常见于科技语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"made a quick, messy, temporary fix by combining parts or using an awkward solution (especially in computing/engineering)","zh":"（尤指在计算机/工程领域）用临时、笨拙但能凑合的办法拼凑出一个“权宜之计”式的解决方案"},"examples":[{"en":"I kludged a fix so the app wouldn’t crash during the demo.","zh":"我临时拼凑了一个修补办法，让这个应用在演示时不至于崩溃。"},{"en":"They kludged the old system to work with the new database.","zh":"他们用很凑合的方式把旧系统勉强改到能和新数据库一起用。"},{"en":"The solution was kludged together with scripts and manual steps.","zh":"这个方案是靠脚本加手动步骤拼凑出来的。"}]},{"partOfSpeech":"adj.","definition":{"en":"improvised or patched together in a crude way; not elegant but functional","zh":"（事物）粗糙地拼凑/临时改出来的；不优雅但能用的"},"examples":[{"en":"It’s a kludged workflow, but it gets the job done.","zh":"这套流程很凑合，但确实能把事办成。"},{"en":"We’re running on a kludged setup until the proper parts arrive.","zh":"在合适的零件到之前，我们先用这套临时拼凑的配置顶着。"}]}],"synonyms":["patched","cobbled together","jury-rigged","lashed together","improvised"],"phonetic":"/klʌdʒd/","extraExplanation":["“kludged”是动词“kludge”的过去式/过去分词，常见于科技语境，语气通常带一点自嘲或批评：能用但不漂亮、不够可靠、以后最好重做（refactor）。","在实际沟通里，它比“fixed”更强调“权宜之计/补丁式修复”。例如：kludged a solution（拼凑方案）、kludged together（东拼西凑）。","拼写上常见变体有“kluge”。含义接近，但在不同圈子里偏好不同；写作时可按团队习惯统一。"]}
{"word":"kludges","summary":{"en":"“Kludges” means makeshift, messy fixes or patches that work but aren’t well-designed.","zh":"“kludges”指能用但不够优雅、常是临时拼凑的修补/补丁式解决方案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “kludge”: a quick, messy, temporary solution that works but is not elegant or well-designed.","zh":"“kludge”的复数：指一种凑合用、杂乱但能运作的临时解决方案，不够优雅或设计不佳。"},"examples":[{"en":"The app is held together with kludges that will be hard to maintain.","zh":"这个应用靠一堆“凑合方案”撑着，以后会很难维护。"},{"en":"Instead of redesigning the system, they kept adding kludges.","zh":"他们没有重新设计系统，而是不断加补丁式的“凑合方案”。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “kludge”: to patch or fix something quickly in a crude way so it works for now.","zh":"“kludge”的第三人称单数：指用粗糙、临时的方式快速修补，让它暂时能用。"},"examples":[{"en":"He kludges the code to pass the demo, but it may break later.","zh":"他为了通过演示临时把代码凑合好，但之后可能会出问题。"},{"en":"She kludges a workaround instead of solving the root cause.","zh":"她先凑合出一个替代方案，而没有解决根本原因。"}]}],"synonyms":["patches","workarounds","band-aid fixes","stopgaps","quick fixes"],"phonetic":"/klʌdʒɪz/","extraExplanation":["“kludge/kludges”常见于工程、编程语境，带一点自嘲或批评意味：能跑就行，但不够“干净”（clean）、不够“优雅”（elegant）。","拼写上也常见“kluge”。两者在口语里经常混用，但很多人会把“kludge”更明确地理解为“笨重但能用的拼凑修补”。"]}
{"word":"kludging","summary":{"en":"Kludging means making something work with a quick, improvised, not-so-elegant fix (often in tech).","zh":"Kludging 指用快速、临时、但不够优雅的方式把问题先解决（常见于技术语境）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Computing) Using a quick, messy, or temporary fix to make something work, often not in an elegant or well-designed way.","zh":"（计算机/工程）用一种快速、粗糙或临时的“补丁式”方法把东西先弄能用，通常不够优雅或不够合理。"},"examples":[{"en":"We’re kludging a solution for now, and we’ll refactor it next week.","zh":"我们先用一个临时方案凑合着跑起来，下周再重构。"},{"en":"The app is running, but it’s mostly kludging—don’t expect it to scale well.","zh":"应用是能跑了，但主要靠“拼补式修修补补”，别指望它扩展性好。"}]},{"partOfSpeech":"n.","definition":{"en":"A period or act of doing this kind of quick, improvised fixing.","zh":"这种“临时拼补式修理/改造”的过程或做法。"},"examples":[{"en":"After hours of kludging, the demo finally worked.","zh":"折腾了好几个小时的临时拼补后，演示终于能用了。"},{"en":"Too much kludging in the codebase makes bugs harder to find.","zh":"代码里临时拼补太多，会让排查 bug 更难。"}]}],"synonyms":["patching","jury-rigging","workaround","hack (informal)","band-aid fix"],"phonetic":"/ˈklʌdʒɪŋ/","extraExplanation":["“kludging”来自俚语动词“kludge”。常见于软件开发、硬件维修等语境，语气通常偏负面：强调“能用就行”的权宜之计，而不是干净、可维护的设计。","你可能还会见到拼写“kluge”。两者在技术圈常被混用；在实际交流中，重点是表达“临时凑合/不够优雅的解决办法”。"]}
{"word":"kluges","summary":{"en":"“Kluges” means patched-together, awkward but workable fixes (especially in tech).","zh":"“Kluges”指（尤指技术领域）拼凑出来的、别扭但能用的临时修补方案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “kluge”: an awkward but practical solution made by patching things together, often as a quick fix in engineering or software.","zh":"“kluge”的复数：指一种用拼凑/打补丁方式做出的“别扭但能用”的解决方案，常见于工程或软件中的临时修补。"},"examples":[{"en":"The old system is held together with kluges, but it still runs.","zh":"这个旧系统靠一堆“拼凑式补丁”勉强撑着，但还能运行。"},{"en":"Instead of redesigning the app, they added more kluges to meet the deadline.","zh":"他们没有重新设计这个应用，而是为了赶工又加了更多临时拼凑的方案。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) Forms of the verb “to kluge”: to create or fix something quickly in a clumsy but workable way.","zh":"（非正式）动词“to kluge”的某种形式：用笨拙但可行的方式快速拼凑出或修补某物。"},"examples":[{"en":"We kluged a workaround until the real fix was ready.","zh":"在真正的修复完成前，我们先拼凑了一个临时替代方案。"},{"en":"She kluged the script to handle one more input format.","zh":"她临时改了下脚本，让它能多处理一种输入格式。"}]}],"synonyms":["workarounds","patches","band-aid fixes","quick fixes","hacks"],"phonetic":"/kluːdʒ/","extraExplanation":["“kluge”常用于技术语境，语气通常带一点吐槽：不是“优雅的设计”，而是“先能用再说”的补丁方案。","在团队沟通里，如果有人说某段代码是“a kluge”，往往暗示：将来最好重构（refactor）或重新设计。"]}
{"word":"klunk","summary":{"en":"Klunk means a heavy dull sound, to make that sound, or informally an old unreliable car.","zh":"Klunk 指沉重的钝响、发出这种声音；口语里也可指破旧不可靠的车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heavy, dull sound (like something metal hitting or moving awkwardly)","zh":"（沉重、低沉的）哐当声；钝响（常指金属碰撞或笨拙移动发出的声音）"},"examples":[{"en":"There was a loud klunk when the lid fell shut.","zh":"盖子“哐当”一声重重合上。"},{"en":"I heard a klunk in the engine and the car started shaking.","zh":"我听到发动机里传来一声钝响，车开始抖动。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a heavy, dull sound; to move or hit with such a sound","zh":"发出哐当声；（以发出钝响的方式）碰撞或笨拙移动"},"examples":[{"en":"The old washing machine klunked loudly during the spin cycle.","zh":"那台旧洗衣机脱水时发出很大的哐当声。"},{"en":"The door klunked shut behind him.","zh":"门在他身后哐当一声关上了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) an old, cheap, or unreliable car","zh":"（非正式）破旧的车；老旧不可靠的车（常带一点嫌弃或自嘲）"},"examples":[{"en":"I’m still driving my old klunk, but it gets me to work.","zh":"我还在开那辆破旧的车，但它能把我送到公司。"},{"en":"He bought a klunk because it was all he could afford.","zh":"他买了辆破车，因为他只能负担得起这个。"}]}],"synonyms":["clunk","thud","clang","bang","rattle"],"phonetic":"/klʌŋk/","extraExplanation":["“klunk”属于拟声词（onomatopoeia），模仿“重物碰撞/机械卡顿”的声音。写作中常用来让画面更有“声音感”，尤其在描述老旧机器、车门、金属部件时很常见。","拼写有时也会见到“clunk”。两者意思非常接近；“clunk”更常见一些。"]}
{"word":"klutz","summary":{"en":"A “klutz” is a clumsy person who often makes small accidents.","zh":"“klutz”指笨手笨脚、容易出小意外的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A clumsy person who often drops things or has accidents.","zh":"笨手笨脚的人；常出糗、常出意外的人。"},"examples":[{"en":"I’m such a klutz—I spilled coffee on my shirt again.","zh":"我真是个笨手笨脚的人——我又把咖啡洒到衬衫上了。"},{"en":"Don’t give me the glass vase; I’m a klutz.","zh":"别把玻璃花瓶交给我，我很容易手滑弄坏。"},{"en":"He’s a lovable klutz in romantic comedies.","zh":"在浪漫喜剧里，他常演那种讨喜的“笨拙角色”。"}]}],"synonyms":["clumsy person","butterfingers","oops machine"],"phonetic":"/klʌts/","extraExplanation":["“klutz”源自意第绪语（Yiddish），在美式英语里很常见，语气多半是轻松自嘲或开玩笑；但当面用来形容别人可能显得不礼貌。更礼貌的说法可以用 “clumsy” 或 “a bit uncoordinated”。"]}
{"word":"klutzes","summary":{"en":"“Klutzes” is the plural of “klutz,” meaning clumsy people.","zh":"“klutzes”是“klutz”的复数，指“笨手笨脚的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A clumsy person who often drops things or moves awkwardly.","zh":"笨手笨脚的人；经常掉东西或动作很别扭的人。"},"examples":[{"en":"I’m such a klutz—I spilled coffee on my shirt again.","zh":"我真是太笨手笨脚了——又把咖啡洒到衬衫上了。"},{"en":"He’s a klutz on the dance floor, but he still has fun.","zh":"他在舞池里很笨拙，但还是玩得很开心。"},{"en":"Don’t worry about breaking it—everyone is a klutz sometimes.","zh":"别担心弄坏——每个人有时候都会笨手笨脚的。"}]}],"synonyms":["clumsy person","butterfingers","bungler"],"phonetic":"/klʌts/","extraExplanation":["“klutz”带有口语、略带调侃的语气，通常不算很恶毒，但对陌生人或正式场合可能显得不礼貌；对朋友自嘲或熟人之间玩笑更常见。","词形：单数 klutz；复数 klutzes（你输入的就是复数）。","常见搭配：a total klutz（超级笨手笨脚的人）、I’m a klutz（我很笨拙）、klutz moment（笨拙时刻）。"]}
{"word":"klutzier","summary":{"en":"“Klutzier” means “more clumsy/awkward,” the comparative form of “klutzy.”","zh":"“Klutzier”表示“更笨拙/更手忙脚乱”，是“klutzy”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More clumsy or awkward than someone or something else; having more accidents or dropping things more often.","zh":"比别人更笨拙、更手忙脚乱的；更容易出错、摔倒或掉东西的。"},"examples":[{"en":"I’m even klutzier when I’m tired.","zh":"我一累就更笨手笨脚。"},{"en":"He’s klutzier than his sister and always bumps into furniture.","zh":"他比他妹妹更笨拙，总是撞到家具。"},{"en":"This phone case makes my hands feel klutzier because it’s so slippery.","zh":"这个手机壳太滑了，让我觉得自己更手滑、更笨拙。"}]}],"synonyms":["clumsier","more awkward","more accident-prone","more butterfingered"],"phonetic":"/ˈklʌtsiər/","extraExplanation":["“Klutz”源自意第绪语（Yiddish），在美式英语里很常见，语气通常偏口语、带一点自嘲或轻松的吐槽，不算很严厉的侮辱。","“Klutzier”是形容词“klutzy”的比较级（-ier），常用于两者对比：A is klutzier than B。最高级是“klutziest”。"]}
{"word":"klutziest","summary":{"en":"“Klutziest” means the most clumsy or awkward (the superlative of “klutzy”).","zh":"“Klutziest”表示“最笨拙的、最不灵活的”，是“klutzy”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most clumsy or awkward; having the worst coordination (superlative form of “klutzy”).","zh":"最笨拙的；最不灵活的（“klutzy”的最高级）。"},"examples":[{"en":"I’m the klutziest person in the office—I spill coffee all the time.","zh":"我在办公室里最笨拙——我老是把咖啡洒出来。"},{"en":"That was my klutziest moment: I tripped right in front of the stage.","zh":"那是我最糗、最笨拙的一次：我在舞台前直接绊倒了。"},{"en":"He’s one of the klutziest dancers, but he practices every day.","zh":"他算是最不灵活的舞者之一，但他每天都在练习。"}]}],"synonyms":["clumsiest","most awkward","most uncoordinated","butterfingered"],"phonetic":"/ˈklʌtsiəst/","extraExplanation":["“klutziest”来自形容词“klutzy”的最高级形式（klutzy → klutzier → klutziest），常用于自嘲或轻松口吻。","词根“klutz”源自意第绪语（Yiddish），在美式英语里很常见，意思是“笨手笨脚的人”。在正式写作中更常用 clumsiest / most awkward。"]}
{"word":"klutziness","summary":{"en":"Klutziness means clumsiness—being awkward and often causing small accidents.","zh":"Klutziness 指“笨拙、笨手笨脚”，常导致小失误或小事故。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clumsiness; the quality of moving or behaving in an awkward way that often causes accidents or mistakes.","zh":"笨拙；动作或行为不灵活、容易出错或引发小事故的特质。"},"examples":[{"en":"His klutziness made him spill coffee on his notes again.","zh":"他太笨手笨脚了，又把咖啡洒在笔记上。"},{"en":"She laughed at her own klutziness after tripping over nothing.","zh":"她被自己“平地摔”的笨拙逗笑了。"},{"en":"A little klutziness is normal when you’re learning a new sport.","zh":"学习一项新运动时，出现一点笨拙很正常。"}]}],"synonyms":["clumsiness","awkwardness","lack of coordination","butterfingers (informal)"],"phonetic":"/ˈklʌtsi.nəs/","extraExplanation":["“klutziness”来自名词“klutz”（笨手笨脚的人），常被认为与意第绪语（Yiddish）词源有关，带一点口语、轻松甚至自嘲的语气。","用法小提示：它通常指“身体动作不协调”造成的尴尬或小事故；如果想表达“做事不熟练”，也可以说“awkwardness”或“lack of coordination”，语气更中性。"]}
{"word":"klutzy","summary":{"en":"“Klutzy” means clumsy or awkward in a casual, often humorous way.","zh":"“klutzy”指笨拙、手脚不灵活，语气偏口语，常带点幽默或自嘲。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clumsy and awkward, often causing small accidents (like dropping things or bumping into objects).","zh":"笨拙的；手脚不灵活的，常常会不小心弄掉东西或撞到东西。"},"examples":[{"en":"I’m so klutzy—I spilled coffee on my shirt again.","zh":"我太笨手笨脚了——又把咖啡洒到衬衫上了。"},{"en":"He felt klutzy trying to dance for the first time.","zh":"他第一次跳舞时觉得自己很笨拙。"},{"en":"Be careful with the glass; I’m a bit klutzy today.","zh":"小心那个玻璃杯；我今天有点笨手笨脚。"}]}],"synonyms":["clumsy","awkward","ungainly","butterfingered"],"phonetic":"/ˈklʌtsi/","extraExplanation":["“klutzy”常带一点自嘲或轻松的语气，比“clumsy”更口语、更有“憨憨的、常出小状况”的感觉。","拼写变体：也常见“klutzy / klutz(y)”相关用法；名词“klutz”指“笨手笨脚的人”（如：He’s a real klutz）。","搭配提示：常用在“feel/look/seem klutzy（感觉/看起来很笨拙）”“be klutzy with your hands（手不灵巧）”。"]}
{"word":"Kluxer","summary":{"en":"A (derogatory) term for a member of the Ku Klux Klan (KKK).","zh":"指（三K党）Ku Klux Klan（KKK）的成员（常含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often derogatory) A member of the Ku Klux Klan (KKK), a racist extremist organization in the United States.","zh":"（常含贬义）三K党（Ku Klux Klan，KKK）的成员；美国的种族主义极端组织成员。"},"examples":[{"en":"The article described how local Kluxers used intimidation to keep Black voters away from the polls.","zh":"这篇文章描述了当地的三K党成员如何用恐吓手段阻止黑人选民前往投票站。"},{"en":"Historians document violence carried out by Kluxers during Reconstruction and later periods.","zh":"历史学家记录了重建时期及之后三K党成员实施的暴力行为。"}]}],"synonyms":["Klansman","KKK member","Klan member"],"phonetic":"/ˈklʌksər/","extraExplanation":["“Kluxer”来自“Ku Klux（Klan）”，在英语中多用于历史叙述、新闻报道或批评语境，通常带有强烈负面色彩。","三K党是美国历史上臭名昭著的白人至上主义组织，与种族恐怖、私刑与政治暴力相关。使用该词时应注意场合与语气，避免不必要的冒犯或误用。","更中性、常见的说法是“KKK member”或“Klansman”（但也常带贬义）。"]}
{"word":"kluxer","summary":{"en":"A Kluxer is a member of the Ku Klux Klan (KKK).","zh":"Kluxer 指三K党（KKK）的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ku Klux Klan (KKK), a racist extremist organization in the United States","zh":"三K党（Ku Klux Klan，简称 KKK）的成员；该组织是美国的种族主义极端团体"},"examples":[{"en":"The novel portrays a town terrified by Kluxers who use violence and intimidation.","zh":"这部小说描写了一个被三K党成员用暴力与恐吓手段笼罩的小镇。"},{"en":"He condemned the Kluxer rally as hateful and dangerous.","zh":"他谴责那场三K党成员的集会充满仇恨且危险。"}]}],"synonyms":["KKK member","Klansman"],"phonetic":"/ˈklʌk.sɚ/","extraExplanation":["“Kluxer”来自“Ku Klux”，是对三K党成员的称呼，常见于历史叙述、新闻报道或文学作品中。该词带有强烈的负面与谴责意味，通常用于指出对方与白人至上主义、反黑人与排外暴力有关联。","三K党在美国历史上与种族恐怖、私刑暴力和对少数族群的系统性威胁密切相关。因此在写作或讨论中，使用该词时要注意语境与立场：多用于批评、揭露或历史说明，而非中性描述。"]}
{"word":"klva","summary":{"en":"“KLVA” isn’t a regular English word; it’s usually an acronym/codename and needs context to interpret.","zh":"“KLVA”不是常规英语词汇；通常是缩写/代号，需要结合语境才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A sequence of letters (K-L-V-A) that is not a standard English word; it is most often seen as an acronym, username, code, or a U.S. radio/TV call sign depending on context.","zh":"由字母组成的序列（K-L-V-A），不是标准英语单词；多见于缩写、用户名、代号，或在特定语境下可能是美国电台/电视台呼号。"},"examples":[{"en":"I saw “KLVA” in the file name, but it didn’t explain what it meant.","zh":"我在文件名里看到“KLVA”，但没有说明它是什么意思。"},{"en":"Can you tell me what KLVA stands for in this document?","zh":"你能告诉我在这份文件里 KLVA 是什么缩写吗？"}]}],"synonyms":["acronym","abbreviation","code","call sign"],"phonetic":"/keɪ ɛl viː eɪ/","extraExplanation":["“KLVA”本身没有固定的词典义，常见情况包括：\n1）缩写：不同机构/项目会赋予不同含义；\n2）代号/变量名：在软件、账号、内部资料里常见；\n3）呼号：美国广播电台/电视台常用四个字母作呼号（如K***或W***开头），但是否指呼号需要具体来源确认。\n\n如果你能提供它出现的场景（例如：句子、行业、文件类型、国家/地区），我可以更准确判断。"]}
{"word":"Klymenos","summary":{"en":"a Greek mythological proper name (variant of Clymenus).","zh":"希腊神话专名（Clymenus 的异拼）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name from Greek mythology; an English/Latinized spelling variant of “Clymenus,” used for several different mythological figures (often a king or hero).","zh":"希腊神话中的专名；英文/拉丁化拼写变体，对应 “Clymenus（克吕墨诺斯）”，可指多个不同的神话人物（常见为国王或英雄）。"},"examples":[{"en":"In some retellings, Klymenos appears as a king in Greek myth, though details vary by source.","zh":"在一些改写版本里，Klymenos 被写作希腊神话中的一位国王，但不同来源细节不一。"},{"en":"The spelling Klymenos is sometimes used to keep closer to the Greek-style “Kly-” form.","zh":"有时会用 Klymenos 这种拼写，以更贴近希腊式的 “Kly-” 形式。"}]}],"synonyms":["Clymenus"],"phonetic":"/ˈklaɪmənəs/","extraExplanation":["这是一个“神话专名”，不像普通词那样有单一、固定的词义；阅读时要结合作者、谱系（家族关系）与故事版本来确认具体指的是哪一位 Klymenos/Clymenus。","在英文资料里，你可能会同时看到 Klymenos 与 Clymenus；前者更像“按希腊字母转写”，后者更常见于较旧的拉丁化拼法。"],"etymology":"源自古希腊语名字 Κλύμενος（转写：Klymenos / Klymenos），常见拉丁化形式为 Clymenus。名字含义多被解释为与“名声、听闻”相关（可理解为“有名的、闻名的”一类）。不同神话人物同名，导致叙述会随作者与传统而变化。","mnemonic":["把 Kly- 看成“克里/克吕”的音（像中文里译名常见的“克吕-”），-menos 联想到“某某人名后缀”，提示这是“人名/神话名”。","遇到 Clymenus 也别慌：Klymenos ≈ Clymenus，属于同名异拼。"]}
{"word":"klystron","summary":{"en":"A vacuum-tube device used to generate or amplify microwave (very high-frequency) radio signals.","zh":"一种用于产生或放大微波（超高频）信号的真空电子管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of vacuum tube that generates or amplifies very high-frequency radio waves (microwaves), often used in radar and communications equipment.","zh":"一种真空电子管，用来产生或放大超高频无线电波（微波），常用于雷达与通信设备。"},"examples":[{"en":"Older radar systems used a klystron to produce a powerful microwave signal.","zh":"较早期的雷达系统会用速调管产生强大的微波信号。"},{"en":"The technician replaced the klystron to restore the transmitter’s output power.","zh":"技术人员更换了速调管，以恢复发射机的输出功率。"}]}],"synonyms":["microwave tube","microwave amplifier tube"],"phonetic":"/ˈklaɪstrɑn/","extraExplanation":["“klystron”常译为“速调管”。它通过让电子束在电场中“速度调制”，再在腔体谐振结构中把电子束的能量转移到微波上，从而实现放大或振荡。","该词来自希腊语词根，和“波浪、冲击/波动”相关；在工程语境里常见于雷达、卫星通信、粒子加速器与微波发射设备等领域。"]}
{"word":"klystrons","summary":{"en":"Klystrons are vacuum tubes used to generate or amplify microwaves, especially in radar and high-power scientific equipment.","zh":"Klystrons（速调管）是真空电子管，用于产生或放大微波，常见于雷达和高功率科研设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of klystron: a type of vacuum tube that generates or amplifies very high-frequency radio waves (microwaves), often used in radar, satellite communication, and particle accelerators.","zh":"klystron 的复数：一种真空电子管，用来产生或放大超高频无线电波（微波），常用于雷达、卫星通信和粒子加速器等设备。"},"examples":[{"en":"The lab replaced the old klystrons to improve the accelerator’s power output.","zh":"实验室更换了旧的速调管（klystrons），以提高加速器的输出功率。"},{"en":"Many radar systems historically relied on klystrons as microwave amplifiers.","zh":"许多雷达系统在早期曾依赖速调管作为微波放大器。"}]}],"synonyms":["microwave vacuum tube","microwave amplifier tube","RF power tube"],"phonetic":"/ˈklaɪstrɑnz/","extraExplanation":["“klystron”在中文里常译为“速调管”。它属于微波真空电子器件的一种，核心原理是利用电子束在腔体中“速度调制”，从而把直流电子束能量转成微波能量或实现放大。","词源方面，“klystron”来自希腊语词根（与“波浪冲击/喷涌”相关的意象有关），在工程语境中通常作为专业术语出现，日常英语里不常用。"]}
{"word":"Klytemnestra","summary":{"en":"A mythic Greek queen known for killing her husband Agamemnon and for themes of revenge and justice in tragedy.","zh":"希腊神话中的王后，以弑夫阿伽门农以及悲剧中的复仇与正义主题而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A queen of Mycenae in Greek mythology, wife of Agamemnon and mother of Orestes, Electra, and Iphigenia; famous for killing Agamemnon after his return from the Trojan War.","zh":"希腊神话中的迈锡尼王后，阿伽门农之妻，俄瑞斯忒斯、厄勒克特拉与伊菲革涅亚之母；以在特洛伊战争后阿伽门农归来时将其杀害而闻名。"},"examples":[{"en":"In many retellings, Klytemnestra murders Agamemnon as revenge for their daughter’s death.","zh":"在许多改写版本中，克吕泰涅斯特拉为了女儿之死复仇而杀了阿伽门农。"},{"en":"The character of Klytemnestra is often portrayed as both a grieving mother and a political actor.","zh":"克吕泰涅斯特拉常被刻画为既悲痛的母亲、又精于权力运作的政治人物。"}]},{"partOfSpeech":"n.","definition":{"en":"A literary and cultural symbol of betrayal, vengeance, and disputed justice, especially in Greek tragedy (notably Aeschylus’s Oresteia).","zh":"文学与文化中的象征形象：背叛、复仇与“正义是否成立”的争议，尤见于希腊悲剧（尤其是埃斯库罗斯《俄瑞斯忒亚》）。"},"examples":[{"en":"Modern writers sometimes use Klytemnestra to explore how power and violence shape family life.","zh":"现代作家有时借克吕泰涅斯特拉来探讨权力与暴力如何影响家庭。"},{"en":"In The Oresteia, Klytemnestra’s actions raise questions about whether revenge can ever be justice.","zh":"在《俄瑞斯忒亚》中，克吕泰涅斯特拉的行为引出“复仇是否能成为正义”的疑问。"}]}],"synonyms":["Clytemnestra"],"phonetic":"/ˌklaɪtəmˈnɛstrə/","extraExplanation":["她的故事常与“阿伽门农献祭女儿伊菲革涅亚”这一情节相连：这常被当作她复仇动机的重要来源。","相关经典文本：埃斯库罗斯《阿伽门农》（《俄瑞斯忒亚》第一部）；后续还涉及俄瑞斯忒斯为父报仇、引发新的“正义与法律”主题。"],"etymology":"源自古希腊语 Κλυταιμνήστρα（Klytaimnḗstra）。英语中也常见拉丁化拼写 Clytemnestra；两种拼写都指同一人物。","mnemonic":["把开头的 K 看成“Knife（刀）”的 K：她在很多版本中与弑夫的暴力情节联系紧密。","记发音节奏：Kly-te-mnes-tra（克-吕-泰-涅-斯-特拉），中间的 -mnes- 像“mnemonic（记忆法）”里的 mn 组合，提醒这里有不太常见的辅音组合。"]}

