{"word":"KR","summary":{"en":"A context-dependent abbreviation.","zh":"语境决定含义的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that can mean different things depending on context (for example, a country code, a currency symbol, or an organization name).","zh":"一个缩写，具体含义取决于语境（例如国家代码、货币符号或机构名称）。"},"examples":[{"en":"In the shipping form, KR is used as a country code.","zh":"在运输表格里，KR 被用作国家代码。"},{"en":"I saw “KR” in the chat, but I wasn’t sure what it referred to.","zh":"我在聊天里看到“KR”，但不确定它指什么。"}]}],"synonyms":["abbreviation","initialism","acronym","code"],"phonetic":"ˌkeɪˈɑr","extraExplanation":["最常见的含义之一：在国际场景里，KR 常用来指韩国（Korea, Republic of；国家代码常见于物流、网站地区、电话区号相关资料中）。","也可能指货币符号/缩写：在一些语境里会用 kr 表示“克朗/克朗（krona/krone）”，如瑞典、挪威、丹麦等（大小写与具体写法会因地区与排版而不同）。","在游戏、科技、社群里，KR 也可能是某个服务器（韩国服）、战队、项目或人名缩写。要准确释义，需要看到完整句子或领域。"],"etymology":"“KR”通常不是一个独立词源的英文单词，而是由两个字母组成的缩写/代码；它的意义来自具体系统或领域的约定（如国家代码、货币缩写、公司/机构缩写等）。","mnemonic":["把 KR 记成“K(orea) R(epublic)”：在很多国际资料里看到 KR，先联想到“韩国”。"]}
{"word":"Kr","summary":{"en":"Kr most commonly means the chemical symbol for krypton; it can also be an abbreviation for Scandinavian “krona/krone” currencies.","zh":"Kr 最常指元素“氪”的化学符号；也可作北欧货币“克朗”的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the chemical symbol for krypton, a noble gas element","zh":"氪的化学符号；氪是一种惰性气体元素"},"examples":[{"en":"Kr is the symbol for krypton on the periodic table.","zh":"在元素周期表上，Kr 是氪的符号。"},{"en":"Some lamps use krypton (Kr) gas to improve efficiency.","zh":"一些灯泡会使用氪（Kr）气体来提高效率。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “kronor/kroner,” the currency units of some Scandinavian countries (usage varies by country)","zh":"“kronor/kroner（克朗）”的缩写；用于部分北欧国家的货币单位（各国用法略有不同）"},"examples":[{"en":"The ticket costs 250 kr.","zh":"这张票要 250 克朗（kr）。"},{"en":"Prices were listed in kr on the receipt.","zh":"小票上价格用 kr（克朗）标注。"}]}],"phonetic":"/ˈkrɪpˌtɑn/","extraExplanation":["“Kr”在科学语境里最常见是“氪”的元素符号；在旅游/购物语境里，小写“kr”更常见，通常指北欧货币“克朗”。具体是哪一国（如瑞典、挪威、丹麦）要看上下文或货币代码（SEK/NOK/DKK）。"]}
{"word":"kr","summary":{"en":"“kr” most often refers to Korea/South Korea (informally) or the code “KR”; it can also have community-specific meanings in texting/gaming.","zh":"“kr”最常见指韩国/与韩国有关（非正式）或代码“KR”；在短信/游戏里也可能有圈内含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “Korea,” often used in internet usernames, sports contexts, or country-code style labeling (but less formal than “KR” as a code).","zh":"“Korea（韩国/朝鲜半岛）”的缩写，常见于网络用户名、体育语境或类似国家标签的用法（但不如国家代码“KR”正式）。"},"examples":[{"en":"He plays on the KR server most nights.","zh":"他大多数晚上都在 KR（韩国）服务器玩。"},{"en":"Her handle ends with “kr,” so people assume she’s from Korea.","zh":"她的用户名以“kr”结尾，所以大家以为她来自韩国。"}]},{"partOfSpeech":"other","definition":{"en":"The country code for South Korea in some systems (more formally written as “KR,” from “Republic of Korea”).","zh":"在某些系统中代表韩国的国家代码（更正式写法为“KR”，来自“Republic of Korea / 大韩民国”）。"},"examples":[{"en":"Set your region to KR to see South Korea-specific results.","zh":"把地区设为 KR，就能看到韩国地区的结果。"},{"en":"The package has “KR” on the label, indicating it was shipped from South Korea.","zh":"包裹标签上有“KR”，表示它从韩国寄出。"}]},{"partOfSpeech":"other","definition":{"en":"A short form used in texting or gaming to mean “kill/revive,” “kinda rude,” or other community-specific meanings (not standard; meaning depends on context).","zh":"在短信或游戏社群里可能表示“kill/revive（击杀/复活）”“kinda rude（有点没礼貌）”等非标准含义；具体意思取决于语境。"},"examples":[{"en":"What does “kr” mean here? I think it’s a clan tag.","zh":"这里的“kr”是什么意思？我觉得它可能是战队标记。"},{"en":"Different communities use “kr” differently, so ask the poster.","zh":"不同圈子对“kr”的用法不一样，所以最好问发帖的人。"}]}],"synonyms":["KR","ROK (in some contexts)"],"phonetic":"/keɪ ɑr/","extraExplanation":["“KR”作为国家代码常见于网络与产品标签；严格来说，国际车牌国家代码韩国常见“ROK”，而域名后缀是“.kr”。因此你如果是在网址、邮箱、服务器或商品产地里看到“kr”，多半与韩国相关。","如果你告诉我你看到“kr”的完整句子/截图位置（游戏聊天、网址、课程笔记等），我可以给出更准确的释义。"]}
{"word":"kra","summary":{"en":"“KRA” is usually an abbreviation (most often Kenya Revenue Authority), and its meaning depends on context.","zh":"“KRA”通常是缩写（最常指肯尼亚税务局），具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation most commonly used for the Kenya Revenue Authority (the national tax collection agency of Kenya).","zh":"常用缩写，最常指肯尼亚税务局（Kenya Revenue Authority，肯尼亚国家税收征管机构）。"},"examples":[{"en":"You can file your tax return through the KRA online portal.","zh":"你可以通过 KRA 的线上平台申报纳税。"},{"en":"The company received a notice from KRA about unpaid VAT.","zh":"公司收到了 KRA 关于未缴增值税的通知。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can also refer to other organizations depending on context (for example, Korean Racing Authority in South Korea).","zh":"也可能指其他机构的缩写，具体看语境（例如韩国的韩国马事会 Korean Racing Authority）。"},"examples":[{"en":"The report cited data published by the KRA.","zh":"该报告引用了 KRA 发布的数据。"},{"en":"In Korea, KRA often refers to the Korean Racing Authority.","zh":"在韩国语境里，KRA 常指韩国马事会。"}]}],"synonyms":["tax authority (contextual)","revenue agency (contextual)"],"phonetic":"/ˌkeɪ.ɑːrˈeɪ/","extraExplanation":["“KRA”本身不是一个常见的英语单词，通常读作字母拼读（K-R-A）。具体含义高度依赖语境：你看到它出现在哪个国家/行业/文件里，往往就能确定指的是哪家机构。","如果你指的不是缩写，而是某个语言里的词（例如人名、地名、网络用语），告诉我它出现的句子或领域，我可以更精确解释。"]}
{"word":"kraal","summary":{"en":"A kraal is a fenced enclosure for livestock (especially in southern Africa); less commonly, it can mean a traditional village of huts.","zh":"kraal 指（尤指南部非洲）圈养家畜的围栏/畜栏；较少情况下也可指由草屋组成的传统村寨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in southern Africa) a fenced enclosure for cattle or other livestock; a corral.","zh":"（尤指南部非洲）围起来圈养牛或其他家畜的畜栏；牲畜围栏。"},"examples":[{"en":"At night, the cattle were brought into the kraal for safety.","zh":"晚上，人们把牛赶进畜栏以确保安全。"},{"en":"The farmer repaired the fence around the kraal.","zh":"农夫修好了畜栏周围的栅栏。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a small traditional settlement or village of huts, especially associated with some southern African communities.","zh":"（较少用）传统的小型聚落或“村寨”（多间草屋/茅屋组成），常与南部非洲一些社群相关。"},"examples":[{"en":"The guide described life in a nearby kraal.","zh":"导游介绍了附近一个传统村寨的生活。"},{"en":"They visited a kraal to learn about local customs.","zh":"他们参观了一个村寨来了解当地习俗。"}]}],"synonyms":["corral","pen","enclosure"],"phonetic":"/krɑl/","extraExplanation":["“kraal”常见于南部非洲语境（如南非英语）。它与“corral（畜栏）”意思接近，词源一般认为与南非荷兰语/南非语（Afrikaans）有关，也可能受葡萄牙语/西班牙语中表示“围栏”的词影响。","使用时注意文化语境：当它指“传统村寨”时，最好在上下文中说明具体地点或社群，避免把不同文化的聚落笼统化。"]}
{"word":"kraaled","summary":{"en":"“Kraaled” means livestock have been penned in a kraal, or it is the past form of “kraal” (to pen animals).","zh":"“kraaled”指牲畜被圈进克拉尔畜栏里；也可作动词“kraal”（把牲畜圈起来）的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of livestock) kept or enclosed in a kraal (a fenced pen, especially in southern Africa).","zh":"（指牲畜）被关在克拉尔围栏/畜栏里（常见于南部非洲的一种围起来的牲畜栏）。"},"examples":[{"en":"At night the sheep were kraaled to protect them from predators.","zh":"晚上羊群被赶进畜栏（kraaled），以防掠食动物。"},{"en":"The cattle stay kraaled until the morning herding begins.","zh":"牛群一直被圈在畜栏里，直到早晨放牧开始。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past and past participle of “kraal”: to put animals into a kraal; to pen or enclose.","zh":"动词“kraal”的过去式/过去分词：把牲畜赶进畜栏；圈起、关起来。"},"examples":[{"en":"They kraaled the goats before the storm arrived.","zh":"暴风雨来前，他们把山羊赶进畜栏。"},{"en":"By dusk, the animals had been kraaled safely.","zh":"到黄昏时，动物都已被安全地圈进畜栏。"}]}],"synonyms":["penned","enclosed","corralled","confined"],"phonetic":"/kreɪld/","extraExplanation":["“kraal / kraaled”多见于南部非洲语境（如南非、纳米比亚、博茨瓦纳等）的英语写作与报道中，带有地域文化色彩。","词源通常与南非荷兰语（Afrikaans）及更早的殖民时期用语有关；在当代英语里，它常用于描述牧民生活、野外保护区或农业场景。"]}
{"word":"kraaling","summary":{"en":"“Kraaling” means putting animals (especially cattle) into a kraal (an enclosure), mainly in southern African English.","zh":"“Kraaling”主要指南部非洲英语中“把牲畜（尤指牛）赶进畜栏/围栏里”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “kraal”) putting cattle or other animals into a fenced enclosure, especially in southern Africa.","zh":"（动词 kraal 的现在分词）把牛或其他牲畜赶进围栏/畜栏里（尤指南部非洲语境）。"},"examples":[{"en":"At dusk, the herders were kraaling the cattle to keep them safe from predators.","zh":"黄昏时，牧民把牛赶进畜栏里，以防捕食者。"},{"en":"They spent the evening kraaling goats near the village.","zh":"他们傍晚把山羊赶进村子附近的围栏。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the act or process of enclosing animals in a kraal.","zh":"（少见）把牲畜圈入畜栏的行为或过程。"},"examples":[{"en":"Kraaling was done early so the animals could rest overnight.","zh":"很早就进行“赶入畜栏”的工作，让牲畜夜里能休息。"}]}],"synonyms":["penning","enclosing","corralling","herding into a pen"],"phonetic":"/ˈkrɑlɪŋ/","extraExplanation":["“kraal”常见于南非、纳米比亚等地的英语语境，原指村落或牲畜围栏（有时也指传统聚落本身）。词源常被认为与南非荷兰语（Afrikaans）有关，并可能追溯到葡萄牙语 *curral*（牲畜栏）。","在现代英语里更常见的通用说法是 *penning*（把动物赶入圈栏）或 *herding into a pen*。若写作更国际化的英语文本，可优先用这些表达。"]}
{"word":"kraals","summary":{"en":"“Kraals” is the plural of “kraal,” meaning livestock enclosures or (in some contexts) traditional rural settlements in southern Africa.","zh":"“Kraals”是“kraal”的复数，常指（南部非洲的）畜栏，也可指传统村落/茅屋群（多见于历史或人类学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “kraal”) a fenced enclosure for cattle or other livestock, especially in southern Africa.","zh":"（kraal 的复数）畜栏；（尤指南部非洲的）围起来的牲畜圈。"},"examples":[{"en":"At night, the cattle were kept in the kraals for safety.","zh":"晚上，牛被关在畜栏里以确保安全。"},{"en":"The ranger checked the kraals near the village before dark.","zh":"护林员在天黑前检查了村子附近的畜栏。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of “kraal”) a traditional rural settlement or group of huts in parts of southern Africa.","zh":"（kraal 的复数）（南部非洲部分地区的）传统村落；茅屋群。"},"examples":[{"en":"The guide explained how families lived in kraals in earlier times.","zh":"导游讲解了早些年家庭如何居住在传统村落里。"},{"en":"Some historic kraals are preserved as cultural sites.","zh":"一些历史性的传统村落被保存为文化遗址。"}]}],"synonyms":["cattle pen","enclosure","corral","boma","livestock yard"],"phonetic":"/krɑl/","extraExplanation":["“kraal”常见于与南部非洲有关的历史、旅行与人类学语境；来源与殖民时期的接触有关，英语里多通过南非荷兰语（Afrikaans）进入。","在现代语境中，描述社区或族群时更建议使用具体、尊重的称呼（例如具体民族/地区名或“village/settlement”），而把“kraal(s)”更多用于历史或畜牧设施的含义。"]}
{"word":"krachai","summary":{"en":"a Thai aromatic fingerroot used in cooking","zh":"泰式料理常用的香料根茎（指根姜/手指姜）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Southeast Asian rhizome (fingerroot) used as an aromatic ingredient in Thai and other regional cooking, valued for its peppery, earthy flavor.","zh":"一种东南亚常用的香料根茎（指根姜/手指姜），常用于泰国等地烹饪，风味辛香、带泥土与胡椒感。"},"examples":[{"en":"The curry gets a deeper aroma when you add krachai.","zh":"加了指根姜后，这道咖喱的香气会更浓郁。"},{"en":"Krachai is often sliced thin and stir-fried with seafood.","zh":"指根姜常切薄片，和海鲜一起快炒。"},{"en":"If you can’t find krachai, some recipes suggest using ginger, though the flavor is different.","zh":"如果买不到指根姜，有些食谱会建议用姜代替，但味道不一样。"}]}],"synonyms":["fingerroot","Chinese keys"],"phonetic":"/krəˈtʃaɪ/","extraExplanation":["也常被称为“fingerroot（手指姜）”，外形像一簇细长“手指”。在泰式料理里常见于咖喱、炒菜、汤品，尤其与海鲜很搭。","不同地区可能会把它和普通姜、南姜（galangal）混淆；但krachai的香气更“草本+胡椒”，口感也更脆一些。"],"etymology":"源自泰语「กระชาย」（krachai），指一种用于烹饪与传统草药的根茎；英语中多作为外来词直接借用泰语音译。","mnemonic":["联想“kra-CHAI”：像“茶/菜”里加的一种香料根——泰国菜常用。","记成“手指形的根（fingerroot）”：看到细长分叉的根茎，就想到krachai。"]}
{"word":"krad","summary":{"en":"a radiation dose unit equal to 1,000 rads.","zh":"辐射吸收剂量单位，等于 1,000 rad。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of absorbed radiation dose equal to 1,000 rads (used especially in older engineering/medical contexts).","zh":"吸收剂量单位，等于 1,000 rad（多见于较旧的工程/医学语境）。"},"examples":[{"en":"The cable insulation was tested to withstand 50 krad of radiation.","zh":"这种电缆绝缘层经过测试，可承受 50 krad 的辐射剂量。"},{"en":"Older reports may list exposure levels in krad instead of gray.","zh":"较旧的报告可能用 krad 而不是 gray（戈瑞）来标注剂量。"}]}],"synonyms":["kilorad","rad","gray"],"phonetic":"/ˈkeɪˌræd/","extraExplanation":["rad 是旧的吸收剂量单位；现代 SI 单位更常用 gray（Gy）。","换算：1 rad = 0.01 Gy；因此 1 krad = 1000 rad = 10 Gy。","在辐射硬化（radiation-hardened）材料、电子器件可靠性测试等领域，你可能仍会看到 krad（常写作 krad(Si) 等特定材料基准）。"],"etymology":"由前缀 k-（kilo-，表示“千”）+ rad（radiation absorbed dose，“辐射吸收剂量”单位）构成；属于按十进制倍数扩展的计量写法。","mnemonic":["把它拆开记：k（kilo=千）+ rad（辐射剂量单位）→ “千个 rad”。","联想中文“千拉德”：看到 k 就想到“千”，krad 就是“千 rad”。"]}
{"word":"kradol","summary":{"en":"“kradol” is not a recognized English vocabulary word; it’s likely a misspelling or a proper name.","zh":"“kradol”不是常见或标准英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name.","zh":"不是标准英语单词；可能是拼写错误或专有名词（名字/地名）。"},"examples":[{"en":"I can’t find “kradol” in standard English dictionaries—did you mean “gradual” or “cradle”?","zh":"我在标准英语词典里找不到“kradol”——你是不是想写“gradual（逐渐的）”或“cradle（摇篮）”？"},{"en":"If “Kradol” is a person or place, please share the context or sentence.","zh":"如果“Kradol”是人名或地名，请提供上下文或完整句子。"}]}],"extraExplanation":["“kradol”看起来更像是：\n1）拼写错误（常见可能：gradual /ˈɡrædʒuəl/，或 cradle /ˈkreɪdəl/）；\n2）非英语来源的转写（例如某些语言的人名/地名/品牌名）；\n3）你在游戏、小说、社交媒体里看到的专有名词。\n给我一句你看到它的原句/来源，我可以帮你判断它最可能对应哪个词，以及正确意思和用法。"]}
{"word":"kraft","summary":{"en":"Kraft most commonly refers to strong brown wrapping paper (“kraft paper”), and it can also describe things made by the kraft paper-making process. It’s also a well-known brand/surname (Kraft).","zh":"Kraft 最常指“牛皮纸”（kraft paper）这种结实的棕色包装纸，也可作形容词表示与牛皮纸或其制浆工艺有关；此外它还是常见姓氏/品牌名（如食品品牌 Kraft）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, coarse brown paper used especially for wrapping and packaging (often called “kraft paper”).","zh":"（常说 kraft paper）牛皮纸：一种结实、粗糙的棕色纸，常用于包装、包裹。"},"examples":[{"en":"I wrapped the book in kraft paper before mailing it.","zh":"我寄书之前先用牛皮纸把它包好。"},{"en":"Kraft paper bags are common in grocery stores.","zh":"杂货店里常见牛皮纸袋。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of or relating to kraft paper, or produced by the kraft process (a method for making strong paper from wood pulp).","zh":"牛皮纸的；与牛皮纸有关的；或指“牛皮纸制浆法”（一种把木浆做成更结实纸张的工艺）。"},"examples":[{"en":"They used kraft packaging to protect the bottles.","zh":"他们用牛皮纸包装来保护瓶子。"},{"en":"The company specializes in kraft pulp for shipping boxes.","zh":"这家公司专门生产用于运输纸箱的牛皮纸浆。"}]},{"partOfSpeech":"other","definition":{"en":"A surname or brand name, especially the U.S. food company Kraft (often seen on products).","zh":"姓氏或品牌名；尤其指美国食品公司 Kraft（常见于商品包装上）。"},"examples":[{"en":"She bought Kraft cheese for the sandwiches.","zh":"她买了卡夫（Kraft）的奶酪做三明治。"},{"en":"Kraft is a common last name in some English-speaking countries.","zh":"Kraft 在一些英语国家是比较常见的姓氏。"}]}],"synonyms":["brown paper","wrapping paper","packing paper"],"phonetic":"/kræft/","extraExplanation":["“kraft”原本来自德语，意思是“力量、强度”。“kraft paper/ kraft process”之所以用这个词，是因为这种制浆法做出来的纸通常更结实，适合包装和运输。"]}
{"word":"krafts","summary":{"en":"Kraft usually refers to strong brown packaging paper (“kraft paper”), and it can also describe things made with it or relate to the kraft papermaking process.","zh":"Kraft 通常指结实的棕色包装纸（牛皮纸，kraft paper），也可作形容词表示“牛皮纸的/与硫酸盐制浆法有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually in “kraft paper”) a strong, rough brown paper used for bags, packaging, and envelopes.","zh":"（常见于“kraft paper”）牛皮纸；一种结实、粗糙的棕色包装纸，常用于纸袋、包装和信封。"},"examples":[{"en":"These cookies come in a small kraft paper bag.","zh":"这些饼干装在一个小牛皮纸袋里。"},{"en":"Please wrap the book in kraft paper before shipping it.","zh":"寄出前请用牛皮纸把这本书包好。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to kraft paper or the kraft process (a method for making strong paper).","zh":"与牛皮纸或硫酸盐制浆法（制造强韧纸张的方法）有关的。"},"examples":[{"en":"We use kraft packaging for heavier items.","zh":"我们用牛皮纸包装更重的物品。"},{"en":"Kraft pulp is valued for its strength.","zh":"牛皮纸浆以强度高而受重视。"}]},{"partOfSpeech":"n.","definition":{"en":"(often “Kraft”) a family name; also used in brand/company names (e.g., Kraft).","zh":"（常写作“Kraft”）姓氏；也常用于品牌/公司名称（如 Kraft）。"},"examples":[{"en":"Kraft is a well-known name in the food industry.","zh":"Kraft 是食品行业里很知名的名字。"}]}],"synonyms":["brown paper","packing paper","wrapping paper"],"phonetic":"/kræft/","extraExplanation":["“kraft”来自德语 Kraft，意思是“力量、强度”。这也是为什么 kraft paper 通常指“结实耐用的包装纸”。","你输入的“krafts”多半是“kraft”的复数（较少见），意思是“多种/多张牛皮纸”或“不同类型的 kraft 产品”。在日常英语里更常说 “kraft paper” 或 “kraft bags”。"]}
{"word":"krag","summary":{"en":"Krag most commonly means a steep, rugged cliff or rocky crag; it can also refer to the Krag–Jørgensen rifle.","zh":"Krag 最常见意思是陡峭崎岖的岩崖/峭壁；也可指克拉格-约根森步枪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a steep, rugged cliff or rocky crag (often by the sea or in mountainous areas)","zh":"（常指海边或山区的）陡峭崎岖的岩壁；峭壁；岩崖"},"examples":[{"en":"The lighthouse stood on a high krag above the waves.","zh":"灯塔矗立在海浪之上的高峭岩崖上。"},{"en":"They climbed to the top of the krag to watch the sunset.","zh":"他们爬上峭壁顶端看日落。"}]},{"partOfSpeech":"n.","definition":{"en":"(also Krag) a type of rifle, especially the Krag–Jørgensen used by some armies in the late 1800s","zh":"（亦作 Krag）克拉格步枪；尤指19世纪末一些军队使用的Krag–Jørgensen（克拉格-约根森）步枪"},"examples":[{"en":"The museum displayed a Krag rifle from the 1890s.","zh":"博物馆展出了一支19世纪90年代的克拉格步枪。"}]}],"synonyms":["crag","cliff","rocky outcrop","precipice"],"phonetic":"/kræɡ/","extraExplanation":["“krag”作“峭壁/岩崖”时并不算非常常用，更常见的近义词是 crag / cliff / rocky outcrop。在描写北欧或海岸风光的文学与旅行写作中更容易见到。","这个词与北欧语言有关：挪威语/丹麦语中有类似形式，常用来指岩石突起或峭壁，因此在英语里带一点“地貌描写、偏文学/地理”的风格。"]}
{"word":"kragerite","summary":{"en":"“Kragerite” is not a standard dictionary word; it is likely a proper name or a rare/coinage that looks like a mineral name because of the suffix “-ite.”","zh":"“kragerite”不是常见词典词条；更可能是专有名词或罕见/自造词，因为“-ite”结尾使它看起来像矿物名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A term that is not found in major modern English dictionaries; it most likely functions as a proper name (e.g., a surname, brand, or place-related name) or as a coined/rare scientific-style word (the ending “-ite” often suggests a mineral or rock).","zh":"一个在主流现代英语词典中较难查到的词；更可能是专有名词（如姓氏、品牌或地名相关名称），或是人为造词/非常罕见的“科学风格”词（后缀“-ite”常暗示矿物或岩石）。"},"examples":[{"en":"I can’t find “kragerite” in standard dictionaries—do you have a sentence or source where you saw it?","zh":"我在常见词典里找不到“kragerite”——你能提供你看到它的句子或出处吗？"},{"en":"Because it ends in “-ite,” it may be a made-up mineral name in a story or game.","zh":"因为它以“-ite”结尾，它可能是小说或游戏里虚构的矿物名称。"}]}],"phonetic":"ˈkreɪɡəˌraɪt","extraExplanation":["“kragerite”以“-ite”结尾，这个后缀在英语里常用于矿物/岩石名称（如 graphite 石墨、calcite 方解石），也常见于“某某的追随者/流派成员”（如 Jacobite 雅各宾派/詹姆斯党人）。因此它看起来像“矿物名”或“仿科学名”。","如果你是从论文、游戏设定、小说、商品名或人名列表里看到的，这个词很可能是专名或作者自创词。给我原句或相关领域（地质？游戏？品牌？人名？）我可以更准确判断含义与读音。"]}
{"word":"krageroite","summary":{"en":"“krageroite” isn’t a recognized English word; it’s probably a misspelling or a proper name.","zh":"“krageroite”不是常见英文词；很可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a proper name (e.g., a username, brand, place, or surname).","zh":"不是标准英语词；更可能是拼写错误或专有名词（如用户名、品牌、地名或姓氏）。"},"examples":[{"en":"I couldn’t find “krageroite” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里查不到“krageroite”——你能把它出现的句子发我吗？"},{"en":"It might be a name rather than a vocabulary word.","zh":"它可能是一个名字，而不是词汇。"}]}],"extraExplanation":["目前没有常见英文词条“krageroite”。最有效的做法是：\n1）把它所在的原句贴出来；\n2）告诉我它来自哪里（书/游戏/网页/人名/地名）；\n3）确认大小写与拼写是否准确。\n\n另外，它的拼写看起来可能接近这些形式（仅供排查）：\n- “Krag…”开头的姓氏或地名\n- 含“‑ite”结尾的词（英语中常表示“某类矿物/某类人/某种追随者”，如 graphite, meteorite, Israelite）。\n如果你想表达的是其中某个常见词，请告诉我你要的意思，我可以帮你锁定正确拼写与用法。"]}
{"word":"krait","summary":{"en":"A krait is a highly venomous Asian snake.","zh":"krait 指亚洲常见的一种剧毒环蛇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A highly venomous snake found mainly in South and Southeast Asia, known for its banded body and dangerous neurotoxic bite.","zh":"环蛇（主要分布于南亚与东南亚的一种剧毒蛇），常见特征是身体有环状花纹，毒液多为神经毒，咬伤很危险。"},"examples":[{"en":"A krait is mostly active at night, so people are more likely to encounter it after dark.","zh":"环蛇多在夜间活动，所以人们更可能在天黑后遇到它。"},{"en":"The doctor treated the patient for a suspected krait bite.","zh":"医生对疑似被环蛇咬伤的病人进行了治疗。"}]}],"synonyms":["banded krait","common krait"],"phonetic":"/kreɪt/","extraExplanation":["“krait”这个词常见于自然纪录片、野外安全指南和医学急救语境（如“snakebite”蛇咬伤）。在一些地区，环蛇可能会进入村庄或屋内，因此当地会强调夜间照明与避免赤脚行走等安全措施。","常见近缘与相关词：cobra（眼镜蛇）、viper（蝰蛇）；但环蛇通常被归在眼镜蛇科（Elapidae），其毒性常以影响神经系统为主。"]}
{"word":"kraits","summary":{"en":"Kraits are highly venomous Asian snakes (Bungarus) often recognized by dark bodies with light bands.","zh":"Krait 指亚洲的剧毒环蛇（Bungarus属），常见深色身体配浅色横纹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of highly venomous snake found mainly in South and Southeast Asia, known for its potent neurotoxic bite and often dark body with pale bands.","zh":"一种主要分布在南亚和东南亚的剧毒蛇（环蛇/金环蛇等），以强烈的神经毒毒液著称，常见特征是深色身体配浅色横纹。"},"examples":[{"en":"Kraits are usually active at night, so people may not notice them during the day.","zh":"环蛇通常在夜间活动，所以白天人们可能不容易注意到它们。"},{"en":"Doctors treat krait bites as a medical emergency because the venom can affect breathing.","zh":"医生把环蛇咬伤当作急症处理，因为毒液会影响呼吸。"}]}],"synonyms":["banded krait","common krait","Bungarus (genus)"],"phonetic":"/kreɪt/","extraExplanation":["“krait”是从印度次大陆语言进入英语的词（常见说法与印地语/乌尔都语等有关），在英语里多指Bungarus属的“环蛇”。在中文里有时也会按具体种类称为“金环蛇”“银环蛇”等。","文化与科普语境中常会提到环蛇“夜行性、相对隐蔽、毒性强”。但野外遇到蛇类请以当地权威机构/专业人士信息为准，避免自行接触。"]}
{"word":"Krakatau","summary":{"en":"Krakatau is an Indonesian volcanic island (also called Krakatoa), famous for the catastrophic 1883 eruption; it can also be used metaphorically for a violent outburst.","zh":"Krakatau（喀拉喀托/克拉卡托亚）是印尼著名火山岛，以1883年灾难性大喷发闻名；也可比喻突然猛烈的爆发。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a volcanic island (and volcano) in Indonesia, famous for its extremely powerful 1883 eruption; often spelled “Krakatoa” in English.","zh":"喀拉喀托火山（印尼的火山岛/火山），因1883年的超级大喷发而闻名；英语中常写作“Krakatoa”。"},"examples":[{"en":"Krakatau lies in the Sunda Strait between Java and Sumatra.","zh":"喀拉喀托位于巽他海峡，介于爪哇岛和苏门答腊岛之间。"},{"en":"The 1883 eruption of Krakatau was heard thousands of kilometers away.","zh":"1883年喀拉喀托火山喷发的声音在数千公里外都能听到。"},{"en":"Scientists still study Krakatau to understand how large eruptions affect climate and oceans.","zh":"科学家至今仍研究喀拉喀托，以了解大型喷发如何影响气候与海洋。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a sudden, violent event or outburst, compared to a major volcanic eruption.","zh":"（比喻）像火山爆发一样的突然、猛烈的事件或情绪爆发。"},"examples":[{"en":"The debate turned into a Krakatau of shouting and anger.","zh":"这场辩论变成了像“喀拉喀托”般的怒吼与愤怒爆发。"},{"en":"His announcement caused a Krakatau in the office.","zh":"他的宣布在办公室引发了一场“大爆发”。"}]}],"synonyms":["Krakatoa","Anak Krakatau"],"phonetic":"/ˌkrɑːkəˈtaʊ/","extraExplanation":["“Krakatau”和“Krakatoa”指同一个地方：前者更接近印尼语拼写，后者是英语里更常见的传统写法。","1883年的喷发引发巨大海啸，并对全球气候产生影响；其爆炸声常被描述为人类历史上最响亮的自然声音之一。","“Anak Krakatau”（意为“喀拉喀托之子”）是后来在火山口附近形成的新火山岛，活动仍较频繁。"]}
{"word":"Krakatoa","summary":{"en":"the Indonesian volcano/island famous for its 1883 eruption; also a metaphor for an enormous boom","zh":"以1883年大喷发著名的印尼火山/火山岛；也可引申指巨大的轰鸣爆炸声"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a volcanic island in Indonesia (in the Sunda Strait) famous for its catastrophic 1883 eruption; often used to refer to the volcano itself","zh":"印尼巽他海峡的一座火山岛（或指该火山本体），因1883年的灾难性大喷发而闻名"},"examples":[{"en":"Krakatoa lies between Java and Sumatra in Indonesia.","zh":"喀拉喀托火山位于印尼爪哇岛和苏门答腊岛之间。"},{"en":"The 1883 eruption of Krakatoa was heard thousands of miles away.","zh":"1883年喀拉喀托火山喷发的巨响在数千英里外都能听到。"},{"en":"Scientists still study Krakatoa to better understand explosive eruptions and tsunamis.","zh":"科学家至今仍研究喀拉喀托火山，以更好理解爆炸性喷发与海啸。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) a sudden, extremely loud explosion or burst of sound, like a volcano","zh":"（引申）突然的、极其巨大的爆炸或轰鸣声（像火山一样）"},"examples":[{"en":"When the door slammed, it sounded like Krakatoa in the quiet hallway.","zh":"门猛地一关，在安静的走廊里简直像“喀拉喀托式”的巨响。"},{"en":"The thunder was Krakatoa-loud last night.","zh":"昨晚的雷声大得像火山爆发。"}]}],"synonyms":["Krakatau","volcano","cataclysm","explosion","boom"],"phonetic":"/ˌkrækəˈtoʊə/","extraExplanation":["1883年喷发造成巨大海啸与广泛破坏，并引发全球范围的异常天空颜色与气候影响，是近代最著名的火山事件之一。","喀拉喀托喷发后形成的火山活动区后来出现新火山岛“Anak Krakatau”（意为“喀拉喀托之子”），也常出现在新闻与科普文章中。"],"etymology":"源自印尼语地名“Krakatau”（常见英文拼写为Krakatoa）。该名称因1883年大喷发被全球媒体广泛报道而进入英语常用词汇与文化记忆。","mnemonic":["音像“咔啦咔啦”+“偷啊/托啊”，联想火山喷发时岩石碎裂、轰隆作响的“咔啦咔啦”声音。","记成“crack（裂开）+ a + toa（像‘巨响’）”：地壳裂开→爆炸巨响→火山喷发。"]}
{"word":"krake","summary":{"en":"“Krake” is uncommon in English; it usually connects to “kraken” (a legendary sea monster) or, in German, means “octopus.”","zh":"“Krake”在英语中较少见；多与“kraken（海怪）”相关，或在德语中表示“章鱼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A less common form or spelling related to “kraken”; in some contexts it refers to a legendary sea monster.","zh":"“kraken（海怪）”的较少见变体/拼写；在一些语境中指传说中的海中巨兽。"},"examples":[{"en":"In old sea tales, a krake could drag a ship beneath the waves.","zh":"在古老的航海传说里，krake 可能会把船拖入海底。"},{"en":"The novel describes a krake rising from the dark ocean like a nightmare.","zh":"小说描写 krake 从幽暗的海中升起，像噩梦一般。"}]},{"partOfSpeech":"n.","definition":{"en":"In German and some related usages, “Krake” means an octopus (sometimes used loosely for a squid-like creature).","zh":"在德语及相关用法中，Krake 指“章鱼”（有时也宽泛指类似乌贼/触手类生物）。"},"examples":[{"en":"In German, Krake usually refers to an octopus, not a mythic monster.","zh":"在德语里，Krake 通常指章鱼，而不是神话海怪。"},{"en":"The aquarium label said: Krake (octopus).","zh":"水族馆的标签写着：Krake（章鱼）。"}]}],"synonyms":["kraken","sea monster","octopus"],"phonetic":"/ˈkrɑːkə/","extraExplanation":["“Krake/krake”在英语里不算常见，更多时候你会看到更通行的拼写“kraken”。如果你是在游戏、奇幻作品或北欧神话相关内容里遇到它，通常指“海怪”。","如果你是在德语语境（菜单、说明牌、新闻等）里看到“Krake”，最常见就是“章鱼”。判断含义的关键是：看语言环境与是否在讲神话/怪物。"]}
{"word":"kraken","summary":{"en":"A kraken is a legendary giant sea monster; figuratively, it can mean a powerful, unstoppable force.","zh":"Kraken 指传说中的巨型海怪；引申义可指强大、难以阻挡的力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a legendary giant sea monster (often described as squid- or octopus-like) said to live off the coast of Norway and Greenland","zh":"（传说中的）北海巨型海怪；常被描绘成巨大的乌贼/章鱼，传说出没于挪威和格陵兰附近海域"},"examples":[{"en":"In old sailors’ stories, a kraken could pull an entire ship underwater.","zh":"在古老的水手故事里，海怪克拉肯能把整艘船拖入海底。"},{"en":"The movie shows a kraken rising from the sea with huge tentacles.","zh":"电影里海怪克拉肯从海中升起，伸出巨大的触手。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, often figurative) something extremely powerful, frightening, or hard to stop","zh":"（非正式/比喻）强大而可怕、难以阻挡的事物（或力量）"},"examples":[{"en":"The scandal released a kraken of public anger.","zh":"这起丑闻释放出一股难以遏制的民愤。"},{"en":"Once the team found its rhythm, it felt like they had unleashed the kraken.","zh":"球队一旦进入状态，就像“放出了克拉肯”，势不可挡。"}]}],"synonyms":["sea monster","leviathan","beast","menace"],"phonetic":"/ˈkrækən/","extraExplanation":["“Kraken”来自北欧民间传说（尤其是挪威/冰岛一带的海怪故事），后来被英语吸收并广泛出现在文学与流行文化中。","在现代英语里，kraken 常出现在夸张或幽默的表达中，例如 “Release/Unleash the Kraken!”（放出克拉肯！）用来形容释放强大力量或突然火力全开。","文学与文化提示：很多海怪意象会让人联想到《白鲸》（Moby-Dick）等海洋文学传统；kraken 也常见于奇幻作品、游戏与电影的命名。"]}
{"word":"krakens","summary":{"en":"“Krakens” is the plural of “kraken,” a legendary giant sea monster; it can also mean a powerful, frightening force in a figurative way.","zh":"“krakens”是“kraken”的复数，指传说中的巨型海怪；也可作比喻，指强大而可怕的力量或存在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “kraken”: a legendary giant sea monster, often described as squid- or octopus-like, said to attack ships.","zh":"“kraken”的复数：传说中的巨型海怪，常被描写成类似巨型乌贼或章鱼，会袭击船只。"},"examples":[{"en":"Sailors’ tales warned that krakens could drag whole ships under the sea.","zh":"水手的传说警告说，krakens 会把整艘船拖入海底。"},{"en":"The movie shows krakens rising from the deep during a storm.","zh":"电影里在暴风雨中出现了从深海升起的 krakens。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) very powerful, frightening, or hard-to-control forces or beings.","zh":"（比喻）非常强大、可怕或难以控制的力量或存在。"},"examples":[{"en":"Some people call giant tech companies “krakens” because of their influence.","zh":"有人把大型科技公司称为“krakens”，因为它们影响力巨大。"},{"en":"He felt like he was fighting krakens when he tried to fix all the problems alone.","zh":"当他试图独自解决所有问题时，感觉就像在与 krakens 作战。"}]}],"synonyms":["sea monster","monster","behemoth","leviathan","giant squid"],"phonetic":"/ˈkrɑkən/","extraExplanation":["“Kraken”源自斯堪的纳维亚（北欧）民间传说，最早常见于挪威、冰岛一带的海上传闻。现代英语里它既指传说海怪，也常被流行文化（电影、游戏、小说）用来营造“深海未知恐惧”的氛围。","在文学与流行文化中常见的相关表达有：release the kraken（放出怪物/释放强大力量，带戏谑或夸张语气）；the kraken awakens（沉睡的威胁苏醒）。"]}
{"word":"Krakovian","summary":{"en":"connected with Kraków, Poland, or a person from there","zh":"与波兰克拉科夫有关；或指克拉科夫人"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Kraków (Cracow), a major city in southern Poland, or to its people or culture","zh":"与波兰南部城市克拉科夫（Kraków/Cracow）及其居民、文化有关的"},"examples":[{"en":"The museum has a Krakovian collection of medieval religious art.","zh":"这家博物馆收藏了一批克拉科夫地区的中世纪宗教艺术品。"},{"en":"She studies Krakovian history, especially the city’s Renaissance period.","zh":"她研究克拉科夫的历史，尤其是该城的文艺复兴时期。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Kraków (Cracow)","zh":"克拉科夫人（来自克拉科夫的居民）"},"examples":[{"en":"As a Krakovian, he grew up near the Old Town.","zh":"作为一个克拉科夫人，他在老城附近长大。"}]}],"synonyms":["Cracovian"],"phonetic":"/krəˈkoʊviən/","extraExplanation":["拼写提示：英语里常见的形容词/居民称呼是 Cracovian（对应英文旧拼法 Cracow）。Krakovian 能被理解，但在正式写作中更建议用 Cracovian。","发音小点：重音通常在第二音节：kra-KO-vi-an。"],"etymology":"由地名 Kraków（英语常写作 Cracow）加后缀 -ian 构成，表示“……的 / ……人”。该拼写在英语中较少见，更常见的是 Cracovian。","mnemonic":["把它拆开记：Kraków + -ian（像 Canadian, Italian），意思就是“克拉科夫的/克拉科夫人”。","联想“Kraków 的 W 像 V 的音”，所以写作 Krakovian 里出现 -v- 更好记。"]}
{"word":"Krakow","summary":{"en":"A historic, culturally important city in southern Poland.","zh":"波兰南部一座历史悠久、文化地位重要的城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in southern Poland, known for its well-preserved medieval Old Town and its role as a historic center of Polish culture and learning.","zh":"波兰南部的重要城市，以保存完好的中世纪老城闻名，也是波兰文化与学术的历史重镇。"},"examples":[{"en":"We spent three days in Krakow visiting the Old Town and Wawel Castle.","zh":"我们在克拉科夫待了三天，参观了老城和瓦维尔城堡。"},{"en":"Krakow is often considered one of the cultural capitals of Poland.","zh":"克拉科夫常被认为是波兰的文化之都之一。"}]}],"synonyms":["Cracow"],"phonetic":"/ˈkrɑːkaʊ/","extraExplanation":["发音提示：英文里常读作“KRAH-kow”（第一音节重读），结尾的“-ow”类似英语里的“cow”的元音。","文化小背景：克拉科夫曾长期是波兰王国的重要政治与文化中心；今天以历史建筑、大学传统（如雅盖隆大学）和博物馆艺术氛围著称。"],"etymology":"源自波兰语“Kraków”。英文中也常见另一种拼写“Cracow”，多与拉丁化拼写传统有关。名称常被民间传说与人物“克拉克（Krak）”联系在一起，但更早的词源细节并不完全确定。","mnemonic":["联想记忆：把它拆成“kra + kow”，想成“喀（kra）—口（kow）”，去“喀拉科夫（克拉科夫）”旅行要“开口”点餐问路。","易混拼写：Krakow = 英文常用拼写；Cracow = 另一常见拼写变体（同一个城市）。"]}
{"word":"Krakowiak","summary":{"en":"a lively Polish folk dance and its music from the Kraków region","zh":"源自克拉科夫地区的波兰民间舞蹈及其舞曲"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lively Polish folk dance and its music, originally from the Kraków region, typically in fast duple time (2/4) with a strong, syncopated rhythm.","zh":"一种活泼的波兰民间舞蹈及其配乐，起源于克拉科夫（Kraków）地区，常为快速的二拍子（2/4），节奏有明显的切分感。"},"examples":[{"en":"The orchestra played a krakowiak, and the dancers responded with quick, stamping steps.","zh":"乐队演奏起克拉科维亚克舞曲，舞者用快速、跺脚的步伐呼应。"},{"en":"In the ballet, the final scene includes a krakowiak to evoke Polish folk tradition.","zh":"在这部芭蕾中，终场加入克拉科维亚克舞来营造波兰民俗氛围。"},{"en":"She recognized the piece as a krakowiak by its bright tempo and accented rhythm.","zh":"她从明快的速度和重音节奏判断出那首曲子是克拉科维亚克舞曲。"}]}],"synonyms":["Polish folk dance","folk dance","Polish dance","dance tune"],"phonetic":"/ˌkrɑːkəˈviːæk/","extraExplanation":["常见拼写为 *Krakowiak*（也可小写 *krakowiak*）。在古典音乐里，它有时作为“舞曲体裁/民族舞曲”出现（例如肖邦作品中可见相关风格影响），用来呈现波兰民间色彩。"],"etymology":"源自波兰语 *krakowiak*，字面含义为“克拉科夫人/来自克拉科夫的（舞）”；英语借入后主要指该地区的民间舞与舞曲。","mnemonic":["把它拆开记：Kraków（克拉科夫）+ -iak（像“某地的人/风格”），联想到“来自克拉科夫的舞”。","想象“克拉科夫（Kraków）”的“Kra-kra”像跺脚声，提示这种舞很有节奏、很热闹。"]}
{"word":"krakowiak","summary":{"en":"Krakowiak is a lively Polish folk dance (and the music style for it) from the Kraków region.","zh":"Krakowiak 指源自波兰克拉科夫地区的一种活泼民间舞蹈，也可指其对应的舞曲风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Polish folk dance from the Kraków (Cracow) region, usually in fast duple time (2/4), often danced by couples or in a group.","zh":"一种源自波兰克拉科夫（Kraków/Cracow）地区的活泼民间舞蹈，通常为快速的二拍子（2/4），常由男女成对或群舞表演。"},"examples":[{"en":"They performed a krakowiak in traditional Polish costumes.","zh":"他们穿着传统波兰服饰表演了一段克拉科维亚克舞。"},{"en":"The festival ended with a krakowiak and a round of applause.","zh":"节庆以一段克拉科维亚克舞和热烈掌声结束。"}]},{"partOfSpeech":"n.","definition":{"en":"music written in the style or rhythm of the krakowiak dance.","zh":"以克拉科维亚克舞的节奏或风格创作的音乐（作品）。"},"examples":[{"en":"The pianist played a krakowiak that sounded bright and energetic.","zh":"钢琴家演奏了一首克拉科维亚克风格的曲子，听起来明快有活力。"},{"en":"This piece is labeled “Krakowiak,” indicating its dance rhythm.","zh":"这首作品标注为“Krakowiak”，表示它采用该舞蹈的节奏。"}]}],"synonyms":["Polish folk dance","Cracovienne"],"phonetic":"/ˌkrɑːkoʊˈviːæk/","extraExplanation":["“Krakowiak”来自波兰语，字面上与“Kraków（克拉科夫）”有关。英语里有时也会见到法语名称“Cracovienne”。","在一些古典音乐与舞台作品中，作曲家会用“krakowiak”来指一种带有波兰民间色彩、节奏明快的舞曲段落；对学习者来说，可把它理解为“特定地区的传统舞/舞曲名称”。"]}
{"word":"kral","summary":{"en":"Kral is not standard English; it’s a foreign word meaning “king,” often seen in translations, names, or cultural contexts.","zh":"Kral不是标准英语词；它是外来词，意思是“国王”，常见于翻译、人名或文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard English) A word in several languages (e.g., Turkish, some South Slavic languages) meaning “king.” In English, it may appear in names, translations, or cultural contexts.","zh":"（非标准英语）在多种语言中（如土耳其语、部分南斯拉夫语族语言）表示“国王”。在英语里多见于人名、翻译或文化语境中。"},"examples":[{"en":"In Turkish, “kral” means “king.”","zh":"在土耳其语中，“kral”意思是“国王”。"},{"en":"The subtitle translated the chant as “Long live the kral!” meaning “Long live the king!”","zh":"字幕把口号译成“Long live the kral!”，意思是“国王万岁！”"},{"en":"His online username is Kral, suggesting power or leadership.","zh":"他的网名是Kral，暗示力量或领导者形象。"}]}],"synonyms":["king","monarch","ruler"],"phonetic":"/krɑl/","extraExplanation":["“kral”常被认为与斯拉夫语中的“kralj/korol”等词同源，而这些词又与查理大帝（Charlemagne，拉丁名Carolus）的名字有关：历史上查理大帝影响巨大，他的名字在一些地区逐渐演变为“国王”的称呼。","英语里遇到“kral”时，通常应把它当作外来词：如果是在翻译/字幕/新闻语境，多半直接理解为“king”；如果是人名或网名，则不一定需要翻译。"]}
{"word":"krama","summary":{"en":"Krama most commonly means the polite/formal level of Javanese used to show respect; less commonly, it can mean a ritual procedure in Sanskrit-based contexts.","zh":"Krama 最常指爪哇语中用于表达尊敬的礼貌/正式语体；较少见时也可指梵语传统语境中的仪式程序或仪轨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Javanese) the polite or formal level of speech used to show respect, especially when speaking to elders, strangers, or people of higher status.","zh":"（爪哇语）敬语/礼貌语体：用于表达尊敬的正式语域，常对长辈、陌生人或地位较高者使用。"},"examples":[{"en":"When speaking to his teacher, he chose krama instead of casual Javanese.","zh":"和老师说话时，他选择用 krama（敬语体），而不是随意的爪哇语口语。"},{"en":"Learning krama helps you sound respectful in many Javanese communities.","zh":"学习 krama 能帮助你在许多爪哇社群中表达得更得体、更尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common; from Sanskrit traditions) an action, ritual, or prescribed procedure, especially in religious contexts.","zh":"（较少见；源自梵语传统）行为、仪式或规定的程序（尤指宗教语境中的仪轨/步骤）。"},"examples":[{"en":"The text describes the krama to be followed during the ceremony.","zh":"这段文字描述了仪式中需要遵循的 krama（仪轨/步骤）。"}]}],"synonyms":["honorific register","polite speech level","high Javanese (krama)"],"phonetic":"/ˈkrɑmə/","extraExplanation":["在爪哇语里，人们常把语体分成不同“等级”，最常被提到的是 ngoko（较随意/亲密）与 krama（较正式/礼貌）。使用哪一种，往往取决于双方关系、年龄差、社会场合与礼貌需求。","在日常英语里，krama 多出现在语言学、东南亚文化研究、旅行或学习印尼与爪哇文化的语境中；一般聊天不会用到。"]}
{"word":"Krambambuli","summary":{"en":"a cherry liqueur and a well-known German literary title/name","zh":"一种樱桃利口酒；也指德语文学中著名的同名作品/名字"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cherry-flavored brandy liqueur (a sweet, strong cordial), traditionally associated with Central/Eastern European drinking culture","zh":"一种樱桃风味的白兰地利口酒（甜、酒精度较高的“甜酒/餐后酒”），常与中东欧饮酒文化相关"},"examples":[{"en":"They offered guests a small glass of Krambambuli after dinner.","zh":"他们在晚餐后请客人喝了一小杯 Krambambuli。"},{"en":"The old recipe tastes like cherry brandy with warm spices.","zh":"这份老配方喝起来像樱桃白兰地，带一点温热香料味。"}]},{"partOfSpeech":"n.","definition":{"en":"a title/name best known from German-language literature, especially the novella “Krambambuli” (about a dog), and sometimes used as a dog’s name","zh":"德语文学中著名的书名/名字，尤指小说《Krambambuli》（讲一只狗的故事）；也常被用作狗名"},"examples":[{"en":"In class we read “Krambambuli,” a famous Austrian story about loyalty.","zh":"课上我们读了《Krambambuli》，一篇著名的奥地利“忠诚”主题故事。"},{"en":"They named their rescue dog Krambambuli after the novella.","zh":"他们把领养的救助犬取名 Krambambuli，来自那部小说。"}]}],"synonyms":["cherry brandy","liqueur","cordial","novella"],"phonetic":"ˌkrɑm.bɑmˈbuː.li","extraExplanation":["在英语语境里，Krambambuli 多半作为外来词出现：要么指“樱桃甜酒/利口酒”，要么作为文学与文化典故（同名小说）被提及。","德语作品《Krambambuli》常被归为奥地利文学中讨论“忠诚、归属与道德选择”的代表性短篇/中篇故事之一。"],"etymology":"源自德语 Krambambuli。早期常用来指一种在但泽（今波兰格但斯克）一带流行的樱桃利口酒；其名称也与18世纪在德语地区流传的歌曲《Krambambuli》有关，后来又因玛丽·冯·埃布纳-埃申巴赫（Marie von Ebner-Eschenbach）的同名小说而广为人知。","mnemonic":["记音：把它拆成“krambam-BU-li”，重音在 BU，读起来像一串“咚咚咚”的鼓点，容易记。","联想：看到结尾 -buli 就想成“布里”，前面是“咔啦咔啦/咚咚”的拟声——像喝甜酒后暖暖的感觉。"]}
{"word":"Krameria","summary":{"en":"a rhatany-type shrub genus whose astringent roots have traditional medicinal use","zh":"一种拉坦尼类小灌木属，其收敛性的根传统上可入药/作染料"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small shrubs (family Krameriaceae), native mainly to the Americas, whose roots are astringent and have been used in traditional medicine and dyes; also used to refer to the plant, especially “rhatany.”","zh":"一属小灌木（克拉美利亚科），主要原产美洲；其根具有收敛性，传统上用于草药、染料等；有时也特指“拉坦尼（rhatany）”这类植物。"},"examples":[{"en":"In some herbal traditions, krameria root was used for its astringent properties.","zh":"在一些草药传统中，克拉美利亚的根因其收敛性而被使用。"},{"en":"The label lists krameria extract as an ingredient in the mouthwash.","zh":"标签上写着这款漱口水含有克拉美利亚提取物。"}]}],"synonyms":["rhatany"],"phonetic":"ˈkreɪmɪriə","extraExplanation":["在英语资料里，Krameria 常与 rhatany（拉坦尼）一起出现：rhatany 更常用来指该属植物的药用根。不同地区与不同时期的草药书可能会把“krameria/rhatany”当作近似同义来使用。"],"etymology":"源自新拉丁语 Krameria，以18世纪奥地利植物学家 Heinrich Johann Nepomuk von Crantz（其姓氏常见写作 Kramer/Crantz 的相关拉丁化形式）命名；作为属名用于植物分类学。","mnemonic":["把它拆成“Kra- + -meria”，联想成“植物学家的名字被用来命名一个属”，很多属名都有这种“人名＋拉丁词尾”的形式。","记住常见搭配：krameria root / krameria extract；看到 root、extract 这类词，就容易想到它多出现在草药/成分表语境。"]}
{"word":"krameria","summary":{"en":"Krameria is a plant genus best known for rhatany, whose roots are rich in tannins and were traditionally used as an astringent and for tanning/dyeing.","zh":"Krameria 指克拉梅里亚属植物，以拉坦尼（rhatany）最为人熟知，其根富含鞣质，传统上用于收敛性药用以及鞣革/染色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, shrub-like plants (Krameria), native mainly to the Americas, including the rhatany plants whose roots have been used in traditional medicine and in tanning/dyeing because they contain a lot of tannins.","zh":"克拉梅里亚属植物（Krameria）：主要分布在美洲的一类小型灌木状植物，其中包括“拉坦尼（rhatany）”，其根因富含鞣质，传统上用于药用、鞣革或染色。"},"examples":[{"en":"Rhatany comes from plants in the genus Krameria.","zh":"拉坦尼（rhatany）来源于克拉梅里亚属（Krameria）的植物。"},{"en":"Some historical records mention Krameria root being used for its astringent properties.","zh":"一些历史记载提到克拉梅里亚属植物的根因具有收敛性而被使用。"}]}],"synonyms":["rhatany","Krameria genus"],"phonetic":"/krəˈmɪriə/","extraExplanation":["“Krameria”是植物学中的拉丁学名（属名），日常英语里不算常见；更常见的相关词是“rhatany（拉坦尼）”，尤其在草药、牙科制剂或历史文献中会出现。","该属名来源于人名纪念（常见于生物分类命名传统）；在阅读科普或学术材料时，首字母常大写并用斜体表示为 *Krameria*。"]}
{"word":"krameria-related","summary":{"en":"associated with the plant genus Krameria (rhatany) or its products","zh":"与克拉美里亚属（拉坦尼）植物或其制品有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the plant genus Krameria (rhatany), its species, or products made from it","zh":"与克拉美里亚属植物（拉坦尼/紫胶根 rhatany）、其物种或其制品有关的"},"examples":[{"en":"The paper compares several Krameria-related extracts used in traditional remedies.","zh":"这篇论文比较了几种用于传统疗法的“克拉美里亚属相关”提取物。"},{"en":"We excluded Krameria-related ingredients because of limited safety data for children.","zh":"由于缺乏儿童安全性数据，我们排除了与克拉美里亚属相关的成分。"},{"en":"The museum displayed Krameria-related specimens collected in the Andes.","zh":"博物馆展出了在安第斯山采集的克拉美里亚属相关标本。"}]}],"synonyms":["rhatany-related","Krameria-associated","Krameria-linked","Krameria-connected"],"phonetic":"/krəˈmɪriə rɪˈleɪtɪd/","extraExplanation":["Krameria 常见英文名为 rhatany，指一类原产美洲（如安第斯地区）的植物。其根部在历史上曾用于口腔护理或收敛性（astringent）制品中，因此在成分表、草本说明或植物学资料里可能出现 “Krameria-related”。","这种“X-related”结构在英文里很常见，用来表示“与X有关/相关”，尤其用于科研、医疗、政策等需要避免过度断言的语境。"],"etymology":"由专名 Krameria（以植物学命名传统形成的属名）+ related（“相关的”）构成的复合形容词；常见于学术或说明性文本中。","mnemonic":["把它拆开记：Krameria（一个植物属名）+ related（相关的）= “与Krameria有关的”。遇到不认识的属名也能靠 related 猜大意。","联想中文：related ≈ “有关/相关”，看到连字符 “-” 就当作“把两块信息粘起来”。"]}
{"word":"krameriaceae","summary":{"en":"Krameriaceae is the botanical family that includes Krameria (rhatany).","zh":"Krameriaceae 指包含拉坦尼属（Krameria，rhatany）的植物科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flowering plants (order Zygophyllales) that includes the genus Krameria, often called the rhatany family; many species are shrubs or subshrubs found mainly in the Americas.","zh":"紫葳目中的一个被子植物科，包含拉坦尼属（Krameria），常称为“拉坦尼科/拉坦尼植物科”；多为灌木或亚灌木，主要分布在美洲。"},"examples":[{"en":"Krameriaceae is a small plant family best known for the genus Krameria.","zh":"Krameriaceae 是一个较小的植物科，最知名的是拉坦尼属（Krameria）。"},{"en":"Some Krameriaceae species grow in dry regions and attach to other plants for water and nutrients.","zh":"一些 Krameriaceae 的物种生长在干旱地区，会依附其他植物获取水分和养分。"}]}],"synonyms":["rhatany family"],"phonetic":"/ˌkræməˈraɪəsiˌiː/","extraExplanation":["这是一个植物分类学术语，常见于植物志、标本标签和科普文章中。词尾 -aceae 是植物“科名”的常见拉丁化后缀（如 Rosaceae 蔷薇科）。","Krameria（拉坦尼属）的英文俗名 rhatany 也常用于指其根部提取物，在传统上曾被用于口腔护理或草药制品中；现代用途与安全性应以可靠资料为准。"]}
{"word":"krameriaceous","summary":{"en":"A botanical adjective meaning “of or related to the plant family Krameriaceae.”","zh":"植物学用语，指“克拉梅瑞科（Krameriaceae）植物科的；与之相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Krameriaceae (a small group of mostly American shrubs and herbs, including the genus Krameria).","zh":"（植物）克拉梅瑞科（Krameriaceae）植物科的；与克拉梅瑞科植物有关的。"},"examples":[{"en":"The specimen was identified as krameriaceous based on its floral structure.","zh":"根据花的结构，这个标本被鉴定为克拉梅瑞科的植物。"},{"en":"Some krameriaceous plants are adapted to dry, sandy habitats.","zh":"一些克拉梅瑞科植物适应干燥、沙质的生境。"}]}],"synonyms":["of the family Krameriaceae","krameria-related"],"phonetic":"/ˌkræməˌraɪˈeɪʃəs/","extraExplanation":["这是一个较少见的植物学形容词，来自植物科名 Krameriaceae，用于学术写作、植物志（flora）、分类检索表等场景。日常英语中几乎不会用到。","Krameriaceae 以属名 Krameria 命名，其中一些物种常见英文名包括 rhatany（拉坦尼），在历史上曾用于传统草药或染料相关记载。"]}
{"word":"kran","summary":{"en":"Kran is a non-standard English borrowing that most often refers to a construction crane; less commonly it can mean a tap/faucet in some European-language contexts.","zh":"kran 在英语中属于不太标准的外来词，最常指“起重机”；在某些欧洲语言语境下也可指“水龙头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Borrowed from German/Scandinavian languages) a crane; a large machine used to lift and move heavy objects, especially on construction sites.","zh":"（源自德语/北欧语言的外来词）起重机；用于吊起、搬运重物的大型机械，常见于工地。"},"examples":[{"en":"A new kran was brought in to lift the steel beams.","zh":"一台新的起重机被运来吊装钢梁。"},{"en":"You can see the kran above the building site.","zh":"你可以看到工地上方的那台起重机。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common; influenced by Dutch/Scandinavian use) a tap/faucet for controlling water flow.","zh":"（较少见；受荷兰语/北欧语言影响）水龙头；控制水流的阀门。"},"examples":[{"en":"Turn off the kran when you’re done washing your hands.","zh":"洗完手后把水龙头关上。"},{"en":"The kran is leaking, so we need to fix it.","zh":"水龙头在漏水，所以我们需要修理。"}]}],"synonyms":["crane","derrick","tap","faucet"],"phonetic":"/krɑn/","extraExplanation":["“kran”在标准英语里不算常用词，更多出现在讨论德国/北欧语境、工程设备清单、或翻译/外籍人士口语中。日常英语更常说“crane（起重机）”和“tap/faucet（水龙头）”。","拼写上也容易与英语里的“cran-”（如cranberry 蔓越莓）混淆，但它们来源与含义不同。"]}
{"word":"Krang","summary":{"en":"a TMNT villain character name","zh":"《忍者龜》系列的反派角色名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fictional villain character from the Teenage Mutant Ninja Turtles (TMNT) animated series and related media, often shown as a brain-like alien who controls a robot body","zh":"《忍者龜》（TMNT）動畫及相關作品中的虛構反派角色，常被描繪成類似大腦的外星生物，能操控機器人身體"},"examples":[{"en":"In the cartoon, Krang often argues with Shredder about who should be in charge.","zh":"在動畫裡，Krang 常常和 Shredder 爭論到底誰才該當老大。"},{"en":"Krang usually appears as a brain-like creature inside a robot suit.","zh":"Krang 通常以「像大腦的生物躲在機器人外殼裡」的形象出現。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name or nickname used by fans, often referencing the TMNT character","zh":"（多為粉絲用法）作為人名或暱稱使用，通常是在致敬《忍者龜》的 Krang"},"examples":[{"en":"Online, he goes by Krang as his gaming handle.","zh":"他在網路上用 Krang 當作遊戲暱稱。"}]}],"phonetic":"/kræŋ/","extraExplanation":["文化背景：Krang 是 TMNT 系列中很知名的反派之一，常與 Shredder（雪德／施萊德）同盟或互相牽制；在流行文化中提到 “Krang” 時，多半就是在指這個角色。","用法提醒：作為專有名詞通常大寫 Krang；若只是粉絲暱稱，也常保留大寫以表致敬。"],"etymology":"源自 1987 年《Teenage Mutant Ninja Turtles》電視動畫中創作的角色名；屬於虛構專有名詞，並非由常見英語詞根規則組成，之後在漫畫、玩具、遊戲等周邊中延伸使用。","mnemonic":["記法：把它想成「大腦外星人」的音感——Krang 聽起來像有點「怪、硬」的聲音，聯想到反派的冷硬感。","聯想：K + rang（像「響起」）→ 一出場就很有存在感的反派登場「叮」一下。"]}
{"word":"krang","summary":{"en":"Krang is best known as a TMNT villain: a brain-like alien character that often controls a robot body.","zh":"Krang 最常见的含义是《忍者神龟》里的反派角色：类似大脑的外星生物，常操控机器人身体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a fictional character (an alien brain-like villain) from the Teenage Mutant Ninja Turtles series, often shown controlling a robot body.","zh":"《忍者神龟》（Teenage Mutant Ninja Turtles）系列中的虚构角色：一个类似大脑的外星反派，常操控机器人身体行动。"},"examples":[{"en":"Krang is one of the main villains in some Teenage Mutant Ninja Turtles cartoons.","zh":"在一些《忍者神龟》动画里，Krang 是主要反派之一。"},{"en":"In the show, Krang usually speaks through a big robot body.","zh":"在剧中，Krang 通常通过一个大型机器人身体说话、行动。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, fandom) something that resembles or references the character Krang—especially a brain-like creature in a mech or suit.","zh":"（非正式，粉丝用语）指“像 Krang 一样的东西/梗”，尤其是“脑状生物驾驶机甲或穿在外壳里”的设定。"},"examples":[{"en":"That villain is basically a Krang: a brain creature inside a robot.","zh":"那个反派基本就是“Krang”式设定：一个脑状生物在机器人里面。"},{"en":"The game has a Krang-like boss in a metal suit.","zh":"这个游戏里有个类似 Krang 的穿金属外壳 Boss。"}]}],"synonyms":["(proper name) Krang (TMNT character)","Krang-like (describing a similar creature/setup)"],"phonetic":"/kræŋ/","extraExplanation":["“Krang”主要是专有名词，来自 1980–1990 年代流行的美式漫画与动画《Teenage Mutant Ninja Turtles》（中文常译《忍者神龟》）。在不同版本里设定略有差异，但核心形象是“外星大脑/异形生物 + 机器人身体”。","在英语里它通常直接当作角色名使用；粉丝语境中也会把“Krang-like”用来形容类似的设定或致敬。"]}
{"word":"Krang-like","summary":{"en":"resembling a brain-like alien character; weird or alien in a Krang way","zh":"像“外星大脑怪”那样的；带克朗式的怪诞/外星感"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling Krang (a pop-culture character often depicted as a talking brain-like alien), especially in appearance or vibe.","zh":"像克朗（流行文化角色，常被描绘成会说话的“外星大脑”）的；尤指外形或氛围相似。"},"examples":[{"en":"The villain’s brain-in-a-jar design felt Krang-like.","zh":"反派那种“罐中大脑”的设定很有克朗那味。"},{"en":"The movie uses a Krang-like creature—wet, pink, and unsettling.","zh":"电影里用了一个很“克朗式”的生物：湿滑、粉红、让人不舒服。"},{"en":"His Krang-like laugh made the whole room go quiet.","zh":"他那种很克朗式的怪笑让全场瞬间安静。"}]}],"synonyms":["Krang-esque","alien-like","grotesque","otherworldly"],"phonetic":"/ˈkræŋ laɪk/","extraExplanation":["Krang 是《忍者龟》宇宙里很有代表性的反派形象：常见设定是“有智慧、会说话的粉红色大脑状外星人”，有时还会操控机械身体。因此 Krang-like 往往暗示：脑状外形、黏滑触感、外星/怪诞气质，或“聪明但诡异”的感觉。","这种写法属于“专有名词 + -like”的口语/网文风格，比起正式词汇更像一种文化梗（pop-culture reference）。"],"etymology":"由《忍者龟》（Teenage Mutant Ninja Turtles）系列中的角色名“Krang”加后缀“-like”（意为“像……的”）构成；用于非正式语境，把某人/某物与该角色的典型形象或气质类比。","mnemonic":["把 -like 记成“像……一样”：Krang + like = “像克朗一样”。","联想画面：粉红色“大脑怪”= Krang 的标志性形象；看到“脑子+怪诞外星感”就想到 Krang-like。"]}
{"word":"krank","summary":{"en":"Krank is an informal word meaning “sick,” and sometimes “mentally disturbed/weird,” but it’s uncommon in standard English and may come from German influence.","zh":"Krank 是个非正式词，多指“生病的”，有时也指“精神不正常/怪异”，但在标准英语中不常见，可能受德语影响。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Sick or unwell; not feeling healthy.","zh":"（非正式）生病的；不舒服的。"},"examples":[{"en":"I stayed home because I felt krank all day.","zh":"我整天都觉得不舒服，所以待在家里。"},{"en":"You look a bit krank—do you want some tea?","zh":"你看起来有点不舒服——要不要喝点茶？"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Mentally disturbed or weird in a troubling way (often used humorously, but can be offensive).","zh":"（非正式）精神不正常的；怪得让人不安的（常带玩笑语气，但可能冒犯他人）。"},"examples":[{"en":"That idea sounds kind of krank—are you sure it’s safe?","zh":"那个主意听起来有点不靠谱——你确定安全吗？"},{"en":"Please don’t call people krank; it can be hurtful.","zh":"请不要说别人“精神不正常”；这可能会伤害人。"}]}],"synonyms":["sick","ill","unwell","under the weather","queasy","strange","disturbed"],"phonetic":"/kræŋk/","extraExplanation":["“krank”不是常见的标准英语拼写，更常见于德语（krank=生病的）。在英语里它偶尔出现在方言、俚语、或受德语影响的语境中；日常英语更常用“sick / ill / unwell”。","如果你是在网络、歌曲或游戏里看到“krank”，它有时也被用来表示“很酷/很炸裂（疯狂得厉害）”，但这种用法很口语、地区化，建议根据上下文判断。"]}
{"word":"krans","summary":{"en":"Krans most commonly means a wreath/garland, especially in Afrikaans or South African English.","zh":"Krans 最常见的意思是“花环/花圈”，多见于南非语或南非英语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wreath or garland of flowers (especially in Afrikaans/South African English usage).","zh":"（尤指南非、源自南非荷兰语/南非语的用法）花环；花圈。"},"examples":[{"en":"They laid a krans at the memorial to honor the victims.","zh":"他们在纪念碑前献上一个花圈，以悼念遇难者。"},{"en":"She wore a small krans of wildflowers in her hair.","zh":"她把一小圈野花花环戴在头发上。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"姓氏（人名）。"},"examples":[{"en":"Ms. Krans will lead the meeting today.","zh":"Krans 女士今天将主持会议。"}]}],"synonyms":["wreath","garland","floral wreath"],"phonetic":"/krɑns/","extraExplanation":["“krans”常见于南非语（Afrikaans），与荷兰语“krans”同源，意思就是“花环/花圈”。在更广泛的英语语境中通常会直接用“wreath”。","在南非英语里，“krans”也可能出现在地名或自然景观描述中（如某些地貌名称），但最常见、最实用的记法仍是“花环/花圈”。"]}
{"word":"krantz","summary":{"en":"Krantz is mainly used as a surname or a name for places/organizations.","zh":"Krantz 主要用作姓氏，也可作为地点或机构的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), seen in English-speaking countries; it is not a common everyday vocabulary word.","zh":"（人名）姓氏“Krantz”；在英语国家中可见，但不是日常英语词汇。"},"examples":[{"en":"Dr. Krantz will speak at the conference tomorrow.","zh":"Krantz 博士明天将在会议上发言。"},{"en":"My teacher’s last name is Krantz.","zh":"我老师的姓是 Krantz。"}]},{"partOfSpeech":"other","definition":{"en":"(by extension) a name used for companies, buildings, or places that are named after someone with the surname Krantz.","zh":"（引申）用作公司、建筑或地点名称，通常源自姓氏 Krantz。"},"examples":[{"en":"They met at the Krantz Building downtown.","zh":"他们在市中心的 Krantz 大楼见面。"},{"en":"She works at Krantz & Co.","zh":"她在 Krantz & Co. 工作。"}]}],"phonetic":"/krænts/","extraExplanation":["“Krantz”多见于德语/斯堪的纳维亚语背景的姓氏拼写。不同家族的来源可能不同，但常与德语姓氏“Krantz/Krantz(e)”的拼写变体有关。","在英语语境中，它通常被当作专有名词（人名/机构名）使用，因此一般不翻译，只做音译或保留原拼写。"]}
{"word":"krantzite","summary":{"en":"Krantzite is a rare, mostly historical term seen in some mineralogy contexts; without source context, its exact modern meaning is uncertain.","zh":"Krantzite 是一个罕见且多为历史用法的矿物学相关术语；缺少来源上下文时，很难确定其现代对应含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) A name occasionally found in older mineralogy sources for a mineral specimen; the exact modern mineral it refers to can vary by author or catalog, so it is best treated as a historical/collector’s term unless you have a specific context.","zh":"（罕见/旧称）在一些较早的矿物学资料中偶尔出现的矿物名称；它在现代对应的具体矿物可能因作者或目录而异，因此若缺少上下文，通常应视为历史/收藏用名。"},"examples":[{"en":"The museum label lists the sample as “krantzite,” but the modern classification is unclear.","zh":"博物馆标签把这块标本标为“krantzite”，但它在现代分类中对应哪种矿物并不明确。"},{"en":"In a 19th‑century catalog, “krantzite” appears as a trade name rather than a standardized mineral species.","zh":"在一份19世纪的目录里，“krantzite”更像是商品名，而不是规范的矿物种名。"}]}],"phonetic":"/ˈkrænt.saɪt/","extraExplanation":["“krantzite”并不是现代英语常用词，也较少见于主流词典。它更可能出现在旧矿物学文献、私人收藏目录或博物馆旧标签中。","如果你能提供它出现的句子、书名/论文、或产地信息（例如某矿区、某收藏家/商号），往往才能判断它在该来源里具体指代哪一种矿物。","拼写上也可能与专有名词有关（如人名/姓氏 Krantz + -ite，-ite 常用于矿物名后缀），建议核对原文拼写与上下文。"]}
{"word":"krapfen","summary":{"en":"A jam- or custard-filled fried sweet pastry from Central Europe, like a jelly doughnut.","zh":"一种中欧油炸甜点，常夹果酱或卡仕达，类似果酱甜甜圈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Central European (especially Austrian and southern German) deep-fried sweet yeast dough pastry, often filled with jam or custard and dusted with powdered sugar; similar to a jelly doughnut.","zh":"一种中欧甜点（尤指奥地利与德国南部）：油炸的甜酵母面团点心，常夹果酱或卡仕达，并撒糖粉；类似果酱甜甜圈。"},"examples":[{"en":"I tried a jam-filled krapfen at a bakery in Vienna.","zh":"我在维也纳的一家面包店尝了一个夹果酱的 krapfen。"},{"en":"For Carnival, they served warm krapfen with powdered sugar.","zh":"狂欢节时，他们端上了热腾腾、撒着糖粉的 krapfen。"},{"en":"Krapfen are basically Austrian-style jelly doughnuts.","zh":"Krapfen 基本上就是奥式的果酱甜甜圈。"}]}],"synonyms":["jelly doughnut","jam doughnut","Berliner","doughnut"],"phonetic":"ˈkrɑːpfən","extraExplanation":["Krapfen 是德语借词，在英语里多用于旅行、美食语境。不同地区名称会变：在德国很多地方也叫 Berliner（但在柏林反而常叫 Pfannkuchen），在奥地利常见 Krapfen。","它常与狂欢节/四旬斋前的节庆饮食有关（如 Fasching、Karneval）；传统口味多为杏子酱（apricot jam），也常见香草卡仕达等。"]}
{"word":"krapina","summary":{"en":"Krapina is a town in northern Croatia and also refers to a nearby archaeological site famous for Neanderthal discoveries.","zh":"克拉皮纳是克罗地亚北部的城镇，也可指附近因尼安德特人发现而著名的考古遗址。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in northern Croatia, known as the administrative center of Krapina-Zagorje County.","zh":"克拉皮纳（Krapina）：克罗地亚北部的一座城镇，也是克拉皮纳-扎戈列县的行政中心。"},"examples":[{"en":"Krapina is a small town in northern Croatia, not far from Zagreb.","zh":"克拉皮纳是克罗地亚北部的一座小城，离萨格勒布不远。"},{"en":"They stopped in Krapina to explore the Zagorje region.","zh":"他们在克拉皮纳停留，去探索扎戈列地区。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in archaeology) a famous prehistoric site near Krapina where many Neanderthal remains were discovered.","zh":"（考古语境）克拉皮纳遗址：位于克拉皮纳附近、出土大量尼安德特人遗骸的著名史前遗址。"},"examples":[{"en":"The Krapina site provided important evidence about Neanderthal life in Europe.","zh":"克拉皮纳遗址为研究欧洲尼安德特人的生活提供了重要证据。"},{"en":"In class, we discussed fossils found at Krapina and what they reveal about human evolution.","zh":"课堂上我们讨论了克拉皮纳出土的化石，以及它们对人类演化研究的意义。"}]}],"phonetic":"/krəˈpiːnə/","extraExplanation":["“Krapina”是地名，英语里通常直接使用原名，首字母大写。","克拉皮纳最广为人知的国际影响来自19世纪末的考古发现：这里出土了大量尼安德特人骨骼与遗物，因此在英文资料里常见到“the Krapina Neanderthals（克拉皮纳尼安德特人）”或“the Krapina site（克拉皮纳遗址）”的说法。"]}
{"word":"kras","summary":{"en":"Kras usually refers to a region in Slovenia (the source of the term “karst”); more rarely it is used as an alternate spelling of “karst.”","zh":"Kras通常指斯洛文尼亚的克拉斯地区（“karst/喀斯特”一词的来源）；较少情况下也会被当作“karst”的另一种拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a limestone plateau region in southwestern Slovenia (near Italy), historically called the Karst; the place-name that gave rise to the geology term “karst.”","zh":"（专名）克拉斯：位于斯洛文尼亚西南部（靠近意大利）的石灰岩高原地区，历史上也称“喀斯特高原（Karst）”；“karst/喀斯特”这一地质术语即源于该地名。"},"examples":[{"en":"The Kras region is known for caves, sinkholes, and underground rivers.","zh":"克拉斯地区以洞穴、塌陷坑和地下河而闻名。"},{"en":"Many geology textbooks explain that the word “karst” comes from Kras/Karst in Slovenia.","zh":"许多地质教材会说明，“karst（喀斯特）”一词源自斯洛文尼亚的Kras/Karst（克拉斯/喀斯特高原）。"}]},{"partOfSpeech":"n.","definition":{"en":"a less common spelling used in some contexts for “karst,” referring to landscapes formed by the dissolving of limestone (caves, sinkholes, etc.).","zh":"（较少见拼写）“karst（喀斯特）”的另一种写法，指石灰岩等可溶性岩石被溶蚀形成的地貌（如洞穴、天坑/塌陷坑等）。"},"examples":[{"en":"This area has kras features such as caves and sinkholes.","zh":"这个地区有喀斯特特征，比如洞穴和塌陷坑。"}]}],"synonyms":["Karst"],"phonetic":"/krɑs/","extraExplanation":["“Kras”是斯洛文尼亚语地名；德语常写作“Karst”。英语里的“karst（喀斯特）”通过德语进入学术与地理用语，因此在英语里更常见的是“karst”，而不是“kras”。","如果你是在科学/地理语境里看到“kras”，多数情况下可以理解为“karst（喀斯特地貌）”；但在旅游、历史或地图语境里，它更可能指斯洛文尼亚的Kras地区本身。"]}
{"word":"krasis","summary":{"en":"Krasis means a mixture or balance (especially of bodily humors in ancient Greek medicine), and more rarely the fusion of words/sounds in linguistics.","zh":"krasis 指“混合/调和”（尤指古希腊医学中的体液平衡），较少见的用法指语言学中的词或语音融合/缩合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(ancient Greek thought, medicine, or philosophy) A mixing or blend, especially the balance of bodily qualities (humors) thought to determine someone’s temperament or health.","zh":"（古希腊思想/医学/哲学）混合、调和；尤指体液（四体液）之间的平衡，被认为会影响人的体质、健康与气质。"},"examples":[{"en":"In some ancient medical texts, a person’s health depended on their krasis—the right balance of humors.","zh":"在一些古代医学文献中，一个人的健康取决于其krasis——体液的适当平衡。"},{"en":"The philosopher described a calm temperament as the result of a well-ordered krasis.","zh":"这位哲学家把平和的性情描述为良好调和（krasis）的结果。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics, rare) The merging of two words or sounds into one form; a contraction or fusion.","zh":"（语言学，较少见）两个词或语音合并为一个形式；缩合、融合。"},"examples":[{"en":"Some writers use “krasis” to talk about the fusion of sounds in casual speech.","zh":"有些作者用“krasis”来指口语中语音的融合现象。"},{"en":"The study noted a krasis-like contraction where two vowels merge into one.","zh":"研究指出一种类似krasis的缩合：两个元音合并成一个。"}]}],"synonyms":["mixture","blend","balance","fusion","contraction"],"phonetic":"/ˈkræsɪs/","extraExplanation":["“Krasis”来自希腊语 κρᾶσις（krâsis），原义是“混合、调和”。在古希腊医学中，它常与“四体液说”（血液、黏液、黄胆汁、黑胆汁）相关，指体液的比例与平衡，从而解释健康与性格（temperament）。","现代英语中该词较少见，多出现在古典学、医学史、哲学史或少量语言学讨论里；日常表达里更常用 mix/blend/balance，语言学里更常见 contraction/fusion。"]}
{"word":"Krasnodar","summary":{"en":"A city in southern Russia; capital of Krasnodar Krai.","zh":"俄罗斯南部城市，克拉斯诺达尔边疆区首府。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southern Russia, the administrative center of Krasnodar Krai (region), near the Kuban River; an important economic and transportation hub for the North Caucasus area.","zh":"俄罗斯南部城市，克拉斯诺达尔边疆区（地区）首府，位于库班河附近；是北高加索一带重要的经济与交通枢纽。"},"examples":[{"en":"Krasnodar is known for its warm climate compared with much of Russia.","zh":"与俄罗斯许多地区相比，克拉斯诺达尔以较温暖的气候闻名。"},{"en":"She flew to Krasnodar for a business meeting in the region.","zh":"她飞去克拉斯诺达尔参加当地的商务会议。"},{"en":"The football club FC Krasnodar is based in the city.","zh":"足球俱乐部“克拉斯诺达尔足球俱乐部（FC Krasnodar）”位于这座城市。"}]}],"phonetic":"/ˌkræz.nəˈdɑr/","extraExplanation":["地名里的“krasno-”有时会让学习者联想到英语“crimson（深红）”，但两者并非同源；这里主要是俄语词根的历史含义。","在英语新闻与旅行语境中，Krasnodar常与“Krasnodar Krai（克拉斯诺达尔边疆区）”一起出现，用来区分“城市”与“行政区”。"],"etymology":"源自俄语“Краснодар”。“krasno-”在古俄语里可有“美丽/红色”之意，“-dar”意为“礼物/赠礼”。该城旧称“叶卡捷琳诺达尔”（Yekaterinodar，意为“叶卡捷琳娜的赠礼”），1920年改为现名。","mnemonic":["把它拆成“krasno + dar”：dar≈“达（到）/给”，联想“红色的礼物/美丽的赠礼”，记住它是一个城市名。","联想旧名“Yekaterinodar（叶卡捷琳娜的赠礼）→改名为Krasnodar（美丽/红色的赠礼）”，用“赠礼”这条线串起来。"]}
{"word":"krat","summary":{"en":"“Krat” is not a standard English word; it’s most often an informal abbreviation for “kratom,” or a rare name/surname spelling.","zh":"“krat”不是标准英语词；最常见是“kratom（卡痛/克拉痛）”的非正式缩写，或少见的人名/姓氏拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, not standard) A shortened form of “kratom,” a plant whose leaves are sometimes used for stimulant or pain-relief effects.","zh":"（非标准口语）“kratom（卡痛/克拉痛）”的缩写：一种植物，其叶子有时被用来提神或缓解疼痛。"},"examples":[{"en":"Some people online call kratom “krat,” but that spelling isn’t common in dictionaries.","zh":"有人在网上把 kratom 写成“krat”，但这种写法在词典里并不常见。"},{"en":"He said he was trying “krat,” meaning kratom, to help with his energy.","zh":"他说他在试“krat”（指 kratom）来提升精力。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare surname or name spelling; not a common English vocabulary word.","zh":"较少见的姓氏或名字拼写；不是常见英语词汇。"},"examples":[{"en":"Krat is listed as a family name in some records.","zh":"在一些记录中，Krat 被列为姓氏。"}]}],"synonyms":["kratom (standard form)"],"phonetic":"/kræt/","extraExplanation":["“krat”本身不是主流英文单词，最常见的情况是网络缩写或拼写变体。更标准的写法通常是 **kratom**。","关于 **kratom**：在一些国家/地区它涉及法律与健康风险争议；如果你是在阅读新闻、论坛或医学相关内容，建议核对语境并使用更标准的词形（kratom）。"]}
{"word":"krater","summary":{"en":"A krater is usually an ancient Greek bowl for mixing wine and water; in science it can also mean a named crater-like feature.","zh":"krater通常指古希腊用来把葡萄酒与水混合的调酒缸；在科学语境中也可指被命名的火山口或撞击坑等地貌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a large bowl used to mix wine with water, often beautifully painted and used at banquets (symposia).","zh":"（古希腊）调酒缸：一种大碗，用来把葡萄酒与水混合，常有精美绘画装饰，多用于宴饮（酒宴/会饮）。"},"examples":[{"en":"At the symposium, servants mixed wine and water in a krater before pouring it into cups.","zh":"在会饮上，仆人先在调酒缸里把酒和水混合，再倒进杯子里。"},{"en":"The museum displayed a red-figure krater decorated with a scene from Greek myth.","zh":"博物馆展出了一只红绘调酒缸，上面画着希腊神话场景。"}]},{"partOfSpeech":"n.","definition":{"en":"In geology and planetary science, a volcanic or impact crater—especially when a specific feature is formally named “Krater.”","zh":"（地质学/行星科学）火山口或撞击坑；尤其指被正式命名为“Krater”的特定地貌。"},"examples":[{"en":"Satellite images revealed a large krater near the lava field.","zh":"卫星图像显示熔岩原附近有一个巨大的火山口。"},{"en":"Researchers compared the shape of the krater to nearby impact craters.","zh":"研究人员把这个火山口的形状与附近的撞击坑作比较。"}]}],"synonyms":["mixing bowl (ancient context)","wine-mixing vessel","crater (scientific context)"],"phonetic":"/ˈkreɪtər/","extraExplanation":["“krater”来自古希腊语，和“混合（mix）”有关；在古希腊文化里，直接喝纯葡萄酒被认为不够得体，因此常用krater把酒按比例兑水后再饮用。","考古学里常见的几种krater类型包括 bell krater（钟形调酒缸）、volute krater（涡卷耳调酒缸）等；它们常用于讲述神话或日常生活场景的陶器绘画。"]}
{"word":"kraters","summary":{"en":"Kraters are large ancient Greek vessels used for mixing wine and water (plural of krater).","zh":"Kraters 指古希腊用于把酒与水混合的大型陶器（krater 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of krater: a large ancient Greek bowl or vase used for mixing wine with water, often seen in museums and archaeology.","zh":"krater 的复数：古希腊用来把葡萄酒与水混合的大型碗形器/陶器（常见于博物馆与考古语境）。"},"examples":[{"en":"The museum displayed several kraters painted with scenes from Greek myths.","zh":"博物馆展出了几件绘有希腊神话场景的 kraters（调酒大陶器）。"},{"en":"Archaeologists found broken kraters near the remains of a banquet hall.","zh":"考古学家在宴会厅遗址附近发现了破碎的 kraters。"}]}],"synonyms":["mixing bowl (contextual)","wine-mixing vessel"],"phonetic":"/ˈkreɪtər/","extraExplanation":["“krater”读音接近“CRAY-ter”，但它不是“crater（火山口/坑）”。两者拼写和含义不同，写作与翻译时容易混淆。","在古希腊酒宴（symposium）文化中，krater 是核心器物：葡萄酒通常会先在 krater 中与水混合，再分到酒杯里饮用。"]}
{"word":"kratia","summary":{"en":"Kratia is a Greek-derived combining form meaning “rule” or “power,” best known in English through words ending in -cracy (e.g., democracy).","zh":"Kratia 是源自希腊语的构词成分，表示“统治/权力”，在英语中最常通过以 -cracy 结尾的词（如 democracy）出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Greek combining form meaning “rule,” “power,” or “government,” seen in English words like democracy and aristocracy (often appearing in English as -cracy).","zh":"源自希腊语的构词成分，表示“统治 / 权力 / 政体”，常见于英语词汇中（在英语里常对应为后缀 -cracy）。"},"examples":[{"en":"Democracy literally means “rule by the people.”","zh":"democracy 字面意思是“人民统治”。"},{"en":"Aristocracy refers to “rule by the best” or the nobility.","zh":"aristocracy 指“精英/贵族统治”。"},{"en":"Bureaucracy is “rule by offices,” meaning a system run by officials.","zh":"bureaucracy 可理解为“官僚体系的统治/运作”，即由官员管理的系统。"}]},{"partOfSpeech":"other","definition":{"en":"(rare as an independent English word) “government; political rule,” used mainly when discussing Greek terms or political theory.","zh":"（很少单独作为英语词使用）“政权 / 统治”，多见于讨论希腊语术语或政治理论的语境。"},"examples":[{"en":"In some academic writing, -kratia is discussed as a root meaning political power.","zh":"在一些学术写作中，会讨论 -kratia 作为表示政治权力的词根。"}]}],"synonyms":["rule","power","government"],"phonetic":"/ˈkrɑːtiə/","extraExplanation":["-kratia（κρατία）来自古希腊语，和表示“力量/权力”的词有关；英语里更常见的形式是 -cracy（如 democracy, plutocracy）。","学习时可以把它当作“谁在统治”的模板：demo-（人民）+ -cracy（统治）→ democracy；pluto-（财富）+ -cracy → plutocracy（富豪统治）。"]}
{"word":"kratogen","summary":{"en":"Kratogen usually refers to a kratom-based product (often a brand name) and can also be used informally to mean “containing kratom.”","zh":"Kratogen 通常指卡痛相关产品（常为商标名），也可被非正式地用来表示“含卡痛成分的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually a brand name) A product made from or containing kratom (Mitragyna speciosa), often marketed as an extract, capsule, or drink shot.","zh":"（通常为商标名）一种由卡痛（Mitragyna speciosa）制成或含有卡痛成分的产品，常被宣传为提取物、胶囊或口服“shot”。"},"examples":[{"en":"He bought Kratogen capsules online, thinking they were a mild herbal supplement.","zh":"他在网上买了 Kratogen 胶囊，以为只是温和的草本补充剂。"},{"en":"The store keeps Kratogen behind the counter and checks ID before selling it.","zh":"这家店把 Kratogen 放在柜台后面，出售前会查验身份证件。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or containing kratom (used informally in product descriptions).","zh":"与卡痛有关的；含卡痛成分的（常见于非正式的商品描述）。"},"examples":[{"en":"This is a kratogen blend with added flavoring.","zh":"这是一个添加了调味的“kratogen”混合配方。"},{"en":"Some websites use “kratogen” as a catch‑all label for kratom-based items.","zh":"有些网站把“kratogen”当作卡痛类商品的统称标签来用。"}]}],"synonyms":["kratom extract","kratom product","kratom shot"],"phonetic":"/ˈkrætədʒɛn/","extraExplanation":["“Kratogen”更常见于商品名或营销用语，并不是标准词典里常见的英语词。不同商家可能用它指代不同浓度/形式的卡痛制品。","卡痛在一些地区属于受管制或存在法律限制的物质；同时它可能带来成瘾、药物相互作用等健康风险。学习和使用这个词时，建议了解当地法规，并把它视为特定产品/品牌语境下的称呼。"]}
{"word":"kratogenic","summary":{"en":"Kratogenic means “related to a craton,” the ancient, stable core of a continent.","zh":"kratogenic 表示“与克拉通有关”，即大陆内部古老而稳定的核心地块。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) relating to a craton (also called a kratogen): the old, stable interior part of a continent.","zh":"（地质）与克拉通（也称“克拉托根/kratogen”）有关的：指大陆内部古老而稳定的地块。"},"examples":[{"en":"Kratogenic rocks are typically very old and have remained relatively unchanged for billions of years.","zh":"克拉通（kratogenic）岩石通常非常古老，并且在数十亿年里相对稳定、变化很小。"},{"en":"The diamond-bearing pipes are often associated with kratogenic regions.","zh":"含金刚石的火山岩筒常与克拉通（kratogenic）地区有关。"}]}],"synonyms":["cratonic","craton-related"],"phonetic":"/ˌkrætəˈdʒɛnɪk/","extraExplanation":["“kratogenic”是非常少见的地质学术语，更常见的对应词是“cratonic”（克拉通的、克拉通地区的）。","词根来自“kratogen/kratogeny”（旧式用法，指克拉通或克拉通形成/稳定的概念）+ 形容词后缀“-ic”。在现代文献里，你更可能见到“craton / cratonic”。","如果你是在别的语境里看到这个词（例如生物、化学或网络用语），也可能是拼写误差；可以把原句发来，我能帮你确认具体含义。"]}
{"word":"kratom","summary":{"en":"a Southeast Asian plant whose leaves are used as a psychoactive herbal product","zh":"一种东南亚植物，其叶子常作为具有精神活性作用的草本制品使用"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical Southeast Asian tree whose leaves are used as a herbal product, sometimes for stimulant effects in small amounts and for pain relief or sedation in larger amounts.","zh":"一种东南亚热带树木（其叶子常被制成草本产品）；少量时可能带来提神效果，较大量时可能用于止痛或产生镇静作用。"},"examples":[{"en":"Some people use kratom to stay alert, while others use it for pain management.","zh":"有些人使用它来提神清醒，也有人用它来缓解疼痛。"},{"en":"Kratom products are regulated differently depending on the country or state.","zh":"不同国家或州对它的监管规定不一样。"}]}],"synonyms":["Mitragyna speciosa","krathom"],"phonetic":"/ˈkreɪtəm/","extraExplanation":["文化与使用背景：在泰国、马来西亚等地，传统上有人嚼叶或泡茶来提神、减轻疲劳或缓解疼痛。","安全与法律：其活性成分会作用于人体受体系统，可能带来依赖、戒断或与药物相互作用的风险；不同地区法律与管制差异很大，使用前应了解当地法规并谨慎咨询专业人士。"],"etymology":"源自泰语“krathom”（也常见转写为 kratom），指“卡痛树/其叶”。英文中多指该植物或其叶制品；学名为 Mitragyna speciosa。","mnemonic":["联想记忆：把它记成“k + rat + tom（卡-鼠-汤）”，很多人用它泡成“草本茶/汤”。"]}
{"word":"Kratos","summary":{"en":"A name linked to the idea of power/strength; also a famous video game protagonist.","zh":"与“力量/权力”相关的名字；也指知名游戏主角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the personification of strength or power (a divine figure associated with force and authority).","zh":"在希腊神话中，力量/权力的拟人化神祇（与强制力与权威相关）。"},"examples":[{"en":"In some Greek myths, Kratos appears as a figure who represents raw strength and authority.","zh":"在一些希腊神话里，他作为象征“纯粹力量与权威”的形象出现。"},{"en":"The name comes from an ancient Greek word meaning “power.”","zh":"这个名字源自古希腊语，含义是“力量/权力”。"}]},{"partOfSpeech":"n.","definition":{"en":"A fictional character, best known as the main protagonist of the video game series God of War.","zh":"虚构角色名，最知名的是游戏《战神》（God of War）系列的主角。"},"examples":[{"en":"Kratos is the main character in God of War.","zh":"他是《战神》系列的主角。"},{"en":"Many players recognize Kratos for his fierce fighting style and tragic backstory.","zh":"许多玩家对他凶悍的战斗风格与悲剧性的身世印象深刻。"}]}],"synonyms":["power","strength","might"],"phonetic":"/ˈkrɑːtoʊs/","extraExplanation":["注意：Kratos 常见于现代流行文化（尤其是《战神》系列），但它本来是希腊语词根“权力/统治”的拟人化名称之一。不同文本对其家族关系与戏份描述不一。"],"etymology":"源自古希腊语 κράτος (krátos)，意为“力量、权力、统治”。这个词根也出现在一些英语构词中（如 democracy 中的 -cracy 表示“统治/政体”）。","mnemonic":["把它和 -cracy（如 democracy 民主）联想：-cracy = 统治/权力；Kratos 就是“权力/力量”的来源词根之一。","中文记忆：Kra- 听起来像“克拉”，可联想“克（制）住一切的力量”→ 权力/力量。"]}
{"word":"kratos","summary":{"en":"Kratos can refer to a Greek myth figure who personifies strength/power, or to the main character in the *God of War* video games.","zh":"Kratos 既可指希腊神话中象征“力量/权力”的拟人化角色，也可指游戏《战神》系列的主角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the personification (minor god/daimon) of strength, might, or power, often associated with enforcing Zeus’s will.","zh":"希腊神话中“力量/权力”的拟人化（小神/精灵神），常与执行宙斯的意志有关。"},"examples":[{"en":"In Greek myths, Kratos represents brute strength and authority.","zh":"在希腊神话里，Kratos 象征着蛮力与权威。"},{"en":"Kratos appears in some stories alongside other figures who embody power and force.","zh":"Kratos 在一些故事中会与其他象征权力与强制的角色一同出现。"}]},{"partOfSpeech":"n.","definition":{"en":"A fictional character and the main protagonist in the video game series *God of War*.","zh":"电子游戏《战神》（*God of War*）系列的主角角色名。"},"examples":[{"en":"Kratos is the playable character in *God of War*.","zh":"Kratos 是《战神》里玩家操控的角色。"},{"en":"Many players recognize Kratos by his intense fighting style and tragic backstory.","zh":"许多玩家通过他激烈的战斗风格和悲剧身世来辨认 Kratos。"}]}],"synonyms":["(myth) personification of strength","(gaming) God of War protagonist"],"phonetic":"/ˈkreɪtɑːs/","extraExplanation":["“Kratos”源自古希腊语“κράτος (kratos)”，意思是“力量、统治、权力”。它也出现在一些常见词根中：如“democracy（民主，demos=人民 + -cracy=统治）”“autocracy（专制）”，其中“-cracy”与“kratos”同源。","在古希腊悲剧《被缚的普罗米修斯》（*Prometheus Bound*，传统上归于埃斯库罗斯）中，Kratos（力量）与 Bia（暴力）一起押送普罗米修斯并执行惩罚，体现“强制力量”的象征意义。"]}
{"word":"kraunhia","summary":{"en":"Kraunhia is an older botanical name for wisteria, now generally replaced by Wisteria.","zh":"Kraunhia 是“紫藤”的旧植物学属名，如今一般由 Wisteria 取代。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a former scientific genus name for wisteria (especially Asian wisterias); now usually treated as part of the genus Wisteria","zh":"（植物学）紫藤属（旧属名，尤指亚洲紫藤）；现多并入“Wisteria（紫藤属）”"},"examples":[{"en":"In older botany books, you may see Asian wisteria listed under the genus Kraunhia.","zh":"在较旧的植物学书里，你可能会看到亚洲紫藤被归在 Kraunhia 这个属名下。"},{"en":"The name Kraunhia is rarely used today; most references use Wisteria instead.","zh":"如今 Kraunhia 这个名称很少使用；大多数资料改用 Wisteria。"}]}],"synonyms":["Wisteria","wisteria"],"phonetic":"/ˈkraʊnhiə/","extraExplanation":["Kraunhia 是历史上的分类名称，现代分类系统通常把它并入紫藤属 Wisteria，因此你在新出版的植物百科、园艺书或植物名录中不太会看到它。","在阅读旧文献或旧标本标签时，Kraunhia 常作为 Wisteria 的同物异名（synonym）出现：意思指向同一类植物，但名称更新了。"]}
{"word":"kraurite","summary":{"en":"“Kraurite” is not a recognized common English word; it’s likely a misspelling—context is needed to identify the intended term.","zh":"“kraurite”不是常见英语词，可能是拼写错误；需要上下文才能确定你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a very rare proper name/technical term. Please share the sentence or the intended spelling.","zh":"不是标准英语单词；更可能是拼写错误，或非常罕见的专有名词/技术词。请提供原句或你想要的正确拼写。"},"examples":[{"en":"I couldn’t find “kraurite” in a regular English dictionary—could you check the spelling?","zh":"我在常见英语词典里找不到“kraurite”，你能再确认一下拼写吗？"},{"en":"If you tell me the context, I can help guess what word you meant.","zh":"如果你告诉我上下文，我可以帮你推测你想表达的词。"}]}],"phonetic":"/ˈkraʊˌraɪt/","extraExplanation":["“kraurite”很可能是以下词的误拼（仅供参考）：\n1) kryptonite（氪石，超人故事里让超人变弱的矿石；常用比喻：某人的“致命弱点”）\n2) kaurite / kauri（与“贝壳树脂/考里树、考里松”相关的词，较偏专业）\n3) kraut（口语，指德国人；有时带贬义，用时要非常谨慎）\n\n把你看到这个词的句子贴出来，我可以更准确判断。"]}
{"word":"kraurosis","summary":{"en":"A rare medical term for tissue atrophy and shrinkage, especially of the vulva.","zh":"一个较少见的医学词，指组织干燥萎缩、变薄，尤指外阴部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Abnormal drying, shrinking, and thinning (atrophy) of body tissue, especially of the vulva (often called “kraurosis vulvae”).","zh":"（医学）组织异常干燥、萎缩、变薄（萎缩性改变），尤指外阴部（常称“外阴萎缩症/外阴干枯萎缩”，kraurosis vulvae）。"},"examples":[{"en":"The gynecologist noted signs consistent with kraurosis of the vulva.","zh":"妇科医生观察到一些与外阴部 kraurosis（萎缩性改变）相符的体征。"},{"en":"Kraurosis may cause discomfort, dryness, or pain, so medical evaluation is important.","zh":"Kraurosis 可能引起不适、干燥或疼痛，因此进行医疗评估很重要。"}]}],"synonyms":["(vulvar) atrophy","atrophy","kraurosis vulvae"],"phonetic":"/krɔːˈroʊsɪs/","extraExplanation":["这个词在日常英语中非常少见，主要出现在医学文献或病历里。更常见的相关说法可能是“vulvar atrophy（外阴/阴道萎缩）”或与“lichen sclerosus（外阴硬化性苔藓）”等疾病一起被讨论。","由于涉及私密部位与症状描述，英语交流时通常会用更中性、尊重的表达；如果是身体不适，建议使用“symptoms/diagnosis/treatment”等客观词汇，并及时就医。"]}
{"word":"kraurotic","summary":{"en":"“Kraurotic” isn’t standard; it likely means “neurotic” (very anxious/overly worried).","zh":"“kraurotic”不是标准单词；很可能是“neurotic”（很焦虑/过度担心）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “neurotic.”","zh":"不是标准英语单词；很可能是把“neurotic”拼错了。"},"examples":[{"en":"I couldn’t find “kraurotic” in a dictionary—did you mean “neurotic”?","zh":"我在词典里找不到“kraurotic”——你是不是想写“neurotic”？"},{"en":"Correct spelling: He gets neurotic about being late.","zh":"正确拼写：他对迟到这件事会变得很焦虑、神经质。"}]},{"partOfSpeech":"adj.","definition":{"en":"(about a person) very anxious, worried, or overly sensitive; often used informally, sometimes critically.","zh":"（形容人）很焦虑、很爱担心、过度敏感；多为非正式用法，有时带批评语气。"},"examples":[{"en":"She’s neurotic about checking her email.","zh":"她会很焦虑地反复查看邮件。"},{"en":"I’m not being neurotic—I just want to be prepared.","zh":"我不是神经质——我只是想做好准备。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is very anxious or overly worried (informal).","zh":"非常焦虑、爱担心的人（非正式）。"},"examples":[{"en":"He calls himself a neurotic, but he’s just careful.","zh":"他自称“很神经质”，但其实只是比较谨慎。"}]}],"synonyms":["anxious","overly worried","high-strung","tense","uptight"],"phonetic":"/nʊˈrɑtɪk/","extraExplanation":["“neurotic”来自心理学语境里的“neurosis（神经症）”。在日常英语中，它常被用来泛指“过度焦虑/过度担心”，不一定是正式诊断用语。对别人使用时可能显得不礼貌或带贬义，写作或正式场合可用 more anxious / overly worried / very sensitive 等更中性的表达。"]}
{"word":"krausen","summary":{"en":"Krausen is the foamy cap (or the foam ring it leaves) formed during active beer fermentation.","zh":"Krausen 指啤酒旺盛发酵时形成的泡沫层，或泡沫消退后留下的泡沫圈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick, foamy layer that forms on top of beer (or other fermenting liquids) during active fermentation, made of yeast, proteins, and bubbles.","zh":"（啤酒等）发酵最旺盛时表面形成的厚泡沫层（由酵母、蛋白质与气泡等组成）。"},"examples":[{"en":"The brewer waited for a healthy krausen to form before checking fermentation progress.","zh":"酿酒师等到形成健康的 krausen（发酵泡沫层）后，才检查发酵进度。"},{"en":"When the krausen rose quickly, they attached a blow-off tube to prevent overflow.","zh":"当 krausen 快速上升时，他们接上排气管以防溢出。"}]},{"partOfSpeech":"n.","definition":{"en":"A ring or stain left on the inside of a fermentation vessel after the foam drops (showing the highest level the foam reached).","zh":"发酵泡沫消退后在发酵容器内壁留下的一圈泡沫痕迹（显示泡沫曾到达的最高位置）。"},"examples":[{"en":"You can see the krausen ring on the fermenter—fermentation was very active yesterday.","zh":"你看发酵桶上的 krausen 泡沫圈——昨天发酵非常旺。"}]}],"synonyms":["fermentation foam","foam cap","krausen ring"],"phonetic":"/ˈkraʊzən/","extraExplanation":["这个词常见于精酿啤酒与家酿圈子，源自德语 brewing 用语；在英文里也常写作 kraeusen。它通常与“爆发式发酵期（high kräusen）”相关：泡沫最厚、二氧化碳最强的时候。"]}
{"word":"Krausist","summary":{"en":"a supporter of Krause’s philosophical movement","zh":"克劳泽哲学思潮的支持者"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower or supporter of Krausism (the philosophical ideas of Karl Christian Friedrich Krause), especially influential in parts of Spanish- and Portuguese-speaking intellectual history","zh":"克劳斯主义者；信奉或支持“克劳斯主义”（德国哲学家克劳泽的思想）的人，尤其在西班牙语/葡萄牙语思想史中较有影响"},"examples":[{"en":"In 19th-century Spain, many reform-minded educators were described as Krausists.","zh":"在19世纪的西班牙，许多倡导改革的教育家被称为克劳斯主义者。"},{"en":"Some Krausists argued that education should cultivate moral progress as well as knowledge.","zh":"一些克劳斯主义者主张教育不仅要传授知识，也要培养道德进步。"},{"en":"The essay traces how Krausist ideas entered university debates.","zh":"这篇文章追溯了克劳斯主义思想如何进入大学论辩。"}]}],"synonyms":["Krausian"],"phonetic":"/ˈkraʊzɪst/","extraExplanation":["克劳斯主义（Krausism）常被概括为一种强调“人与社会、自然与神之间和谐关系”的思想取向，在19世纪伊比利亚半岛及拉丁美洲的教育改革、自由主义思想与世俗化讨论中出现较多。阅读历史或思想史文献时更常见。"],"etymology":"来自德国哲学家 Karl C. F. Krause（克劳泽）的姓氏 + 英语后缀 -ist（表示“某学说/主义的追随者或支持者”）。","mnemonic":["记后缀：-ist = “某某主义/流派的人”（如 artist, socialist）。所以 Kraus + ist = “克劳泽学说的人”。","联想中文：看到“主义者”就想到英语里常用 -ist 来表示“……主义者”。"]}
{"word":"krausite","summary":{"en":"A Krausite is a follower of the philosopher Krause or something related to his philosophical movement, Krausism.","zh":"krausite 指克劳泽主义者，或指与哲学家克劳泽及其思想流派（克劳泽主义）相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower or supporter of the philosopher Karl Christian Friedrich Krause and his ideas (Krausism)","zh":"克劳泽主义者；拥护（或追随）德国哲学家克劳泽（K. C. F. Krause）思想的人"},"examples":[{"en":"In late 19th-century Spain, several Krausites promoted educational reform.","zh":"在19世纪末的西班牙，一些克劳泽主义者推动了教育改革。"},{"en":"He was known as a Krausite intellectual who argued for moral progress and tolerance.","zh":"他以克劳泽主义知识分子的身份闻名，主张道德进步与宽容。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Krause or to Krausism","zh":"与克劳泽（Krause）或克劳泽主义（Krausism）相关的"},"examples":[{"en":"Krausite philosophy emphasizes harmony between individuals, society, and nature.","zh":"克劳泽主义哲学强调个体、社会与自然之间的和谐。"},{"en":"The article discusses Krausite influences on modern liberal education.","zh":"这篇文章讨论了克劳泽主义对现代自由教育的影响。"}]}],"synonyms":["Krausist","follower of Krause"],"phonetic":"/ˈkraʊzaɪt/","extraExplanation":["“Krausite / Krausism”来自德国哲学家 Karl Christian Friedrich Krause（1781–1832）的思想传统。在英语语境中，这个词多出现在思想史、教育史或西班牙近代史相关文本里。","克劳泽主义在19世纪西班牙知识界影响较大，常与教育改革、世俗化、宽容与“理性宗教”讨论联系在一起。"]}
{"word":"Kraut","summary":{"en":"fermented cabbage; also an offensive term for a German person","zh":"发酵卷心菜（酸菜）；也可作对德国人的蔑称（冒犯）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sauerkraut; finely cut cabbage fermented in brine, often eaten as a side dish or topping (especially in Central/Eastern European and American deli foods).","zh":"酸菜（常指用盐水发酵的卷心菜丝，常见于中东欧料理与美式熟食店配菜/配料）。"},"examples":[{"en":"I had a hot dog with mustard and kraut.","zh":"我吃了一个热狗，上面加了黄芥末和酸菜。"},{"en":"Add a spoonful of kraut to the sandwich for a tangy flavor.","zh":"在三明治里加一勺酸菜，会更酸爽开胃。"}]},{"partOfSpeech":"n.","definition":{"en":"(Offensive slang) A German person.","zh":"（冒犯性俚语）对德国人的蔑称。"},"examples":[{"en":"That word is considered insulting; avoid using it to refer to people.","zh":"这个词用来指人被认为是侮辱性的，尽量不要这样用。"},{"en":"In wartime movies, you may hear it used as an insult.","zh":"在一些战争题材电影里，你可能会听到它被当作辱骂用语。"}]}],"synonyms":["sauerkraut","fermented cabbage"],"phonetic":"/kraʊt/","extraExplanation":["日常语境里，k r a u t 多数指“酸菜/发酵卷心菜”。但如果用来称呼德国人，会带有明显侮辱性与历史偏见（常见于战争时期辱骂用语），建议避免对人使用。"],"etymology":"源自德语“Kraut”，原意是“香草/草本植物”，也可指“卷心菜”。英语里先用于食物含义（如酸菜），在20世纪战争语境中又被用作对德国人的蔑称。","mnemonic":["联想“crout-”的发音像“口（kou）酸味儿（suan wei）”，想到酸菜的酸爽口感。","把它记成“德国菜里的卷心菜（Kraut）→ 发酵后就是酸菜”。"]}
{"word":"kraut","summary":{"en":"“Kraut” most commonly refers to sauerkraut (informal), but it can also be an offensive slur for a German person—avoid using it to describe people.","zh":"“kraut”常指（口语）德式酸菜，但也可作对德国人的侮辱性蔑称；不要用它来指人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually offensive) A German person; used as an ethnic slur.","zh":"（通常带侮辱性）德国人；对德国人的蔑称。"},"examples":[{"en":"He used the word “kraut” for Germans, which is offensive and should be avoided.","zh":"他用“kraut”来称呼德国人，这是侮辱性的，应该避免使用。"},{"en":"Some older war movies contain slurs like “kraut,” but modern English avoids them.","zh":"一些老的战争电影里会出现像“kraut”这样的蔑称，但现代英语一般会避免使用。"}]},{"partOfSpeech":"n.","definition":{"en":"Sauerkraut; cabbage that has been fermented and has a sour taste (informal).","zh":"酸菜（特指德式酸菜）；发酵后的酸味卷心菜（非正式说法）。"},"examples":[{"en":"I’ll have the bratwurst with kraut, please.","zh":"我要一份配酸菜的烤香肠，谢谢。"},{"en":"This sandwich comes with kraut and mustard.","zh":"这个三明治配有酸菜和芥末。"}]}],"synonyms":["sauerkraut","German (neutral term)"],"phonetic":"/kraʊt/","extraExplanation":["“kraut”来自“sauerkraut”（德式酸菜）。在英语里它既可以指食物（相对中性、口语），也曾在战争语境中被用作对德国人的蔑称（明显冒犯）。日常交流中指人时应避免使用；若要表达“德国人”，用“German (person/people)”。","在阅读历史材料、老电影或战争文学时可能会遇到该词作辱称出现；理解其含义即可，但不建议在现实对话中复用。"]}
{"word":"krauthead","summary":{"en":"An extremely offensive slur for a German person; avoid using it.","zh":"对德国人的极其冒犯性的侮辱语；应避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very offensive slur for a German person (or someone perceived as German).","zh":"（非常冒犯的）对德国人（或被认为是德国人的人）的侮辱性称呼。"},"examples":[{"en":"The teacher explained that “krauthead” is a hateful term and should never be used.","zh":"老师说明“krauthead”是带仇恨的词，绝不应该使用。"},{"en":"The novel includes the slur to show the character’s prejudice.","zh":"小说中出现这个侮辱词是为了表现人物的偏见。"}]}],"synonyms":["slur (general term)","ethnic slur","German (neutral alternative)"],"phonetic":"/ˈkraʊtˌhɛd/","extraExplanation":["这是由“kraut”（酸菜，sauerkraut 的俗称）+“head”拼成的贬称，带有把德国人与刻板饮食形象绑定的意味，因此属于歧视性语言。","该词在战争与民族对立语境中更常见（尤其与一战、二战相关的宣传或辱骂语），在现代英语里使用会被视为仇恨言论；学习时可用于识别与理解文本，但不建议在对话中使用。","更中性与礼貌的说法是“German person / German”或直接用对方姓名与国籍/身份的正规表达。"]}
{"word":"krauts","summary":{"en":"“Krauts” most commonly means sauerkraut/fermented cabbage in food contexts, but it can also be an offensive slur for Germans.","zh":"“Krauts”最常指食物语境中的酸菜/发酵卷心菜，但也可作对德国人的侮辱性称呼（应避免使用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “kraut”: usually fermented cabbage (sauerkraut). In everyday English, this sense is most common in food contexts.","zh":"“kraut”的复数：通常指发酵卷心菜（酸菜/德国酸菜）。日常英语里在饮食语境中最常见。"},"examples":[{"en":"I like krauts and pickles on my sandwich.","zh":"我喜欢在三明治里加酸菜和腌黄瓜。"},{"en":"This hot dog comes with krauts on top.","zh":"这份热狗上面配了酸菜。"}]},{"partOfSpeech":"n.","definition":{"en":"A derogatory slur for Germans (plural). This is offensive and should be avoided.","zh":"对德国人的贬损性称呼（复数）。这是冒犯性的用语，应避免使用。"},"examples":[{"en":"That word is offensive; please don’t use it to describe Germans.","zh":"那个词很冒犯；请不要用它来称呼德国人。"}]}],"synonyms":["sauerkraut","fermented cabbage","pickled cabbage"],"phonetic":"/kraʊts/","extraExplanation":["作为侮辱性称呼时，“kraut(s)”主要流行于一战、二战及其后的英语语境，和“sauerkraut（酸菜）”这种被认为具有德国特色的食物有关，因此带有刻板印象色彩。","在正式写作、公共场合或跨文化交流中，建议用“Germans / German people（德国人）”等中性表达；在历史文本里遇到该词，通常是在反映当时的偏见或战争宣传语言。"]}
{"word":"krautweed","summary":{"en":"An uncommon informal word meaning a weed or wild herb; in some places it can refer to ragweed or similar allergy-causing weeds.","zh":"一个不太常见的非正式词，指杂草或野生草本；在部分地区也可能指豚草等致敏杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, uncommon) A weed or wild herb; sometimes used as a casual name for plants that grow like weeds and can be cooked as greens.","zh":"（非正式；不常见）杂草或野生草本植物；有时泛指像杂草一样疯长、甚至可当野菜吃的植物。"},"examples":[{"en":"After the rain, krautweed sprang up along the fence.","zh":"下过雨后，篱笆旁冒出了不少杂草。"},{"en":"Some older neighbors called the wild greens “krautweed” and cooked them with bacon.","zh":"有些上了年纪的邻居把野菜叫“krautweed”，还会和培根一起煮。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, regional) A casual name for ragweed or similar nuisance weeds that cause allergies.","zh":"（罕见；地区用法）豚草或类似会惹人烦、可能引发过敏的杂草的俗称。"},"examples":[{"en":"My allergies get worse when the krautweed starts flowering.","zh":"一到那些“krautweed”开花，我的过敏就更严重了。"}]}],"synonyms":["weed","wild herb","ragweed","wild greens"],"phonetic":"ˈkraʊtˌwid","extraExplanation":["“krautweed”不是常见标准词，更多见于口语或地区性用法，具体指哪种植物常取决于当地习惯。","注意：单词“kraut”在某些语境里可能是对德国人的贬称（尤其在历史/战争语境中）。在日常交流中，如果你不确定对方感受，更安全的说法是“weed / wild herb / ragweed”等。"]}
{"word":"kravers","summary":{"en":"“kravers” is not standard; it usually means “cravers” (people who crave something) or a context-specific community name.","zh":"“kravers”不是标准拼写；通常指“cravers”（渴望某物的人），或在特定语境下作为社群/群体名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Likely meant “cravers”: people who crave something; people who strongly want something.","zh":"（非标准拼写）很可能是想写 “cravers”：指“渴望某物的人；非常想要某物的人”。"},"examples":[{"en":"Late-night cravers often look for snacks that are quick and salty.","zh":"深夜“特别想吃的人”常常会找又快又咸的零食。"},{"en":"Sugar cravers may find it hard to skip dessert.","zh":"特别想吃甜食的人可能很难不吃甜点。"}]},{"partOfSpeech":"n.","definition":{"en":"A casual/online nickname or group label (e.g., a fandom name or community name), depending on context.","zh":"一种随意的网名/群体称呼（比如粉丝名或社群名），具体含义取决于语境。"},"examples":[{"en":"In the comments, the Kravers shared tips and inside jokes.","zh":"在评论区里，“Kravers”分享技巧和圈内梗。"},{"en":"She calls her followers Kravers as a fun community name.","zh":"她把粉丝称为“Kravers”，作为一种有趣的社群名。"}]}],"synonyms":["cravers","people who crave","fans","followers"],"phonetic":"ˈkreɪvɚz","extraExplanation":["“kravers”在标准英语词典里不常见，更常见的拼写是“cravers”（来自动词 crave“渴望”）。如果你是在某个平台/游戏/社群里看到“Krav ers/kravers”，它也可能是专有名词（群名、用户名、品牌名等）。","如果你能提供一句原文（它出现的句子/平台/主题），我可以更准确判断它到底是“cravers”的变体，还是特定圈子的专用称呼。"]}
{"word":"kreatic","summary":{"en":"“Kreatic” isn’t standard English; it’s probably a misspelling of “creative” or the poetry term “cretic.”","zh":"“kreatic”不是标准英语词，通常是“creative”或诗歌术语“cretic”的拼写误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of another word (commonly “cretic” in poetry, or “creative” in general writing).","zh":"不是标准英语单词。很可能是其他词的拼写错误（常见为诗歌中的“cretic”，或日常写作中的“creative”）。"},"examples":[{"en":"I couldn’t find “kreatic” in a dictionary—did you mean “creative”?","zh":"我在词典里找不到“kreatic”——你想写的是“creative”吗？"},{"en":"In a poetry class, the intended word might be “cretic,” a type of meter.","zh":"在诗歌课里，你想表达的可能是“cretic”，一种诗律/韵律格。"}]},{"partOfSpeech":"n.","definition":{"en":"cretic (likely intended): a metrical foot in poetry with the pattern stressed–unstressed–stressed (— ⏑ —).","zh":"（可能想写的词）cretic：诗歌中的一种音步，重读–轻读–重读（— ⏑ —）。"},"examples":[{"en":"The line includes a cretic foot: — ⏑ —.","zh":"这一行包含一个 cretic 音步：— ⏑ —。"}]}],"synonyms":["creative","innovative","imaginative"],"phonetic":"/ˈkriːtɪk/","extraExplanation":["“kreatic”这种拼写在英语里不常见；如果你是在写“有创意的”，通常用 creative。","“cretic”属于诗歌格律术语，来源与古典诗歌传统相关；一般只在文学/诗歌分析中会见到。"]}
{"word":"krebs","summary":{"en":"“Krebs” most commonly refers to the Krebs cycle, an energy-producing process in cells.","zh":"“Krebs”最常指“克雷布斯循环”，即细胞内产生能量的重要过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually in “the Krebs cycle”) a key series of chemical reactions in cells that produces energy; also called the citric acid cycle or TCA cycle.","zh":"（常用于“the Krebs cycle”）细胞内产生能量的一系列关键化学反应；也叫“柠檬酸循环 / 三羧酸循环（TCA循环）”。"},"examples":[{"en":"In biology class, we learned how the Krebs cycle helps cells make energy.","zh":"在生物课上，我们学习了克雷布斯循环如何帮助细胞产生能量。"},{"en":"Oxygen is important because the Krebs cycle is closely linked to aerobic respiration.","zh":"氧气很重要，因为克雷布斯循环与有氧呼吸密切相关。"},{"en":"The citric acid cycle is another name for the Krebs cycle.","zh":"柠檬酸循环是克雷布斯循环的另一个名称。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially known from the scientist Hans Adolf Krebs.","zh":"姓氏（Krebs），尤其因科学家汉斯·阿道夫·克雷布斯而为人所知。"},"examples":[{"en":"Hans Krebs won a Nobel Prize for describing the Krebs cycle.","zh":"汉斯·克雷布斯因描述克雷布斯循环而获得诺贝尔奖。"}]}],"synonyms":["citric acid cycle","TCA cycle"],"phonetic":"/krɛbz/","extraExplanation":["“Krebs”来自德语姓氏；在英语里最常见的用法几乎就是生物学术语“the Krebs cycle”。","汉斯·阿道夫·克雷布斯（Hans Adolf Krebs）在1937年阐明该循环，1953年获得诺贝尔生理学或医学奖。"]}
{"word":"kreep","summary":{"en":"“Kreep” is a nonstandard spelling of “creep.” The standard word means (1) to move quietly/carefully, (2) to spread or increase gradually, or (3) an unpleasant, creepy person.","zh":"“kreep”是“creep”的非标准拼写。标准词可指：①悄悄移动；②逐渐蔓延/缓慢上升；③令人不舒服的怪人（贬义）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling of “creep.” It’s often used online or in informal writing, sometimes for style or to sound edgy.","zh":"“creep”的非标准拼写。常见于网络或非正式写作，有时是为了风格化或营造“阴森/怪”的感觉。"},"examples":[{"en":"I saw “kreep” in the comments, but the correct spelling is “creep.”","zh":"我在评论里看到有人写“kreep”，但正确拼写是“creep”。"}]},{"partOfSpeech":"v.","definition":{"en":"to move slowly, quietly, and carefully (often to avoid being noticed)","zh":"（悄悄地）缓慢、小心地移动（常为了不被注意到）"},"examples":[{"en":"She crept down the stairs so she wouldn’t wake the baby.","zh":"她悄悄地下楼，免得吵醒宝宝。"},{"en":"Fog crept across the road.","zh":"雾气慢慢地蔓延到路面上。"}]},{"partOfSpeech":"n.","definition":{"en":"an unpleasant person who makes others feel uncomfortable, especially by acting in a creepy or inappropriate way","zh":"让人不舒服的人（尤指行为诡异或不合适、令人反感的人）"},"examples":[{"en":"He kept staring at her, and she thought he was a creep.","zh":"他一直盯着她看，她觉得他很恶心/很变态。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a feeling, change, or problem) to increase or spread slowly and gradually","zh":"（指感觉、变化或问题）慢慢增加/逐渐蔓延"},"examples":[{"en":"Doubt began to creep into his mind.","zh":"疑虑开始慢慢爬上他的心头。"},{"en":"Prices have been creeping up all year.","zh":"物价一整年都在缓慢上涨。"}]}],"synonyms":["crawl","sneak","slip","edge","lurk"],"phonetic":"/kriːp/","extraExplanation":["“kreep”不是标准拼写。在正式写作、考试、工作邮件里建议用“creep”。","“creep (n.)”在口语里带较强贬义，有时接近“怪人/猥琐的人”。使用时注意语气与场合，避免不必要的冒犯。"]}
{"word":"kreeps","summary":{"en":"“kreeps” is a nonstandard spelling of “creeps,” meaning either an uneasy scary feeling (“the creeps”) or unpleasant people (“creeps”), and it can also be the verb “creep” (move/increase slowly).","zh":"“kreeps”多为“creeps”的网络非标准拼写，可指“心里发毛的感觉（the creeps）”、也可指“令人反感的人（creeps）”，还可作动词表示“悄悄移动/逐渐增加”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common spelling: creeps) A feeling of fear or disgust that makes you uncomfortable.","zh":"（常见拼写：the creeps）一种让人不舒服的恐惧或厌恶感。"},"examples":[{"en":"That empty house at night gives me the creeps.","zh":"那栋空房子在晚上让我起鸡皮疙瘩、心里发毛。"},{"en":"His sudden smile gave her the creeps.","zh":"他突然的笑让她觉得很不舒服、心里发毛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common spelling: creeps) People who behave in a rude, scary, or inappropriate way (informal).","zh":"（常见拼写：creeps，非正式）行为粗鲁、吓人或令人反感的人；怪人。"},"examples":[{"en":"Ignore those creeps and stay with your friends.","zh":"别理那些怪人，跟朋友待在一起。"},{"en":"She reported the creep who kept following her.","zh":"她举报了那个一直跟踪她的怪人。"}]},{"partOfSpeech":"v.","definition":{"en":"(Common spelling: creeps) To move slowly and quietly, often trying not to be noticed.","zh":"（常见拼写：creeps）缓慢而悄悄地移动，常带有不想被发现的意味。"},"examples":[{"en":"The cat creeps toward the bird.","zh":"猫悄悄地朝鸟靠近。"},{"en":"He crept out of the room so he wouldn’t wake anyone.","zh":"他悄悄溜出房间，免得吵醒别人。"}]},{"partOfSpeech":"v.","definition":{"en":"(Common spelling: creeps) To increase or spread slowly over time.","zh":"（常见拼写：creeps）逐渐增加；慢慢蔓延。"},"examples":[{"en":"Prices keep creeping up.","zh":"价格一直在慢慢上涨。"},{"en":"Doubt crept into her mind.","zh":"疑虑慢慢涌上她的心头。"}]}],"synonyms":["creeps","the creeps","weirdos","perverts (strong/possibly offensive)","sneaks","slithers","edges up"],"phonetic":"/kriːps/","extraExplanation":["“kreeps”通常是网络上的非标准拼写，用来模仿/强调“creeps”的感觉（比如更俏皮或更怪异的语气）。正式写作中一般写作“creeps”。","固定搭配“give someone the creeps”=“让某人心里发毛/起鸡皮疙瘩”。“the creeps”常指这种不舒服的感觉，而“a creep / creeps”更常指“令人反感的人”。注意语气：用来形容他人可能带有强烈负面评价。"]}
{"word":"kreese","summary":{"en":"Kreese is mainly a surname, widely recognized as the name of a character (John Kreese) in The Karate Kid and Cobra Kai.","zh":"Kreese 主要是一个姓氏，广为人知的是《龙威小子》和《眼镜蛇道馆》中的角色（John Kreese）的姓。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname, best known in pop culture as John Kreese, a character from The Karate Kid and the TV series Cobra Kai (a strict, intimidating karate sensei).","zh":"一个姓氏；在流行文化中最知名的是《龙威小子》（The Karate Kid）与剧集《眼镜蛇道馆》（Cobra Kai）里的角色 John Kreese——一位严厉、强势、带压迫感的空手道教练（sensei）。"},"examples":[{"en":"Kreese is the former sensei of Cobra Kai in the Karate Kid universe.","zh":"Kreese 是《龙威小子》世界观中眼镜蛇道馆（Cobra Kai）的前任教练。"},{"en":"In Cobra Kai, Kreese represents a harsher, more ruthless teaching style.","zh":"在《眼镜蛇道馆》中，Kreese 代表一种更严苛、更不择手段的教学风格。"}]}],"phonetic":"/kris/","extraExplanation":["“Kreese”通常不是普通英语词汇，而是专有名词（姓氏）。在影视语境里，它常用来指代角色 John Kreese，因此理解时要结合作品背景：他与“Cobra Kai/眼镜蛇道馆”的“强硬训练、崇尚胜利”的理念紧密相关。","如果你在字幕或对话里看到 “Kreese said…” 这类用法，它基本等同于“（Kreese 这个人）说……”，属于用姓氏称呼人物的常见英语表达。"]}
{"word":"Krefeld","summary":{"en":"A city in western Germany near Düsseldorf, historically linked to textiles.","zh":"德国西部靠近杜塞尔多夫的城市，历史上与纺织业相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in North Rhine–Westphalia, western Germany, near Düsseldorf, historically known for textiles (especially velvet and silk).","zh":"德国西部北莱茵-威斯特法伦州的一座城市，靠近杜塞尔多夫，历史上以纺织业（尤指天鹅绒与丝绸）闻名。"},"examples":[{"en":"Krefeld is located near Düsseldorf in western Germany.","zh":"克雷费尔德位于德国西部，靠近杜塞尔多夫。"},{"en":"The museum highlights Krefeld’s history as a textile center.","zh":"这座博物馆展示了克雷费尔德作为纺织中心的历史。"}]}],"synonyms":["Crefeld"],"phonetic":"/ˈkrɛfɛlt/","extraExplanation":["英语里这是专有名词（地名），首字母必须大写：Krefeld。","在文化与历史语境中，Krefeld 常与“天鹅绒与丝绸之城”（Velvet and Silk City）这一称呼相关，用来强调其纺织传统。"],"etymology":"地名来源于中古低地德语/德语地区的地名构词；结尾 -feld 常见于德语地名中，意为“田地/原野”。整体含义可理解为“某处的田地（feld）”，具体前缀部分与当地早期地形/聚落名称有关。","mnemonic":["记法：把它拆成“kre + feld”。德语 feld≈“field（田地）”，看到 -feld 结尾可联想到“某某田/原野”的地名。","联想：Krefeld 以丝绸、天鹅绒闻名，可把它记成“（Krefeld）= 织物之城”。"]}
{"word":"kreil","summary":{"en":"Krill are tiny shrimp-like sea animals that many ocean animals eat.","zh":"Krill 指磷虾：一种很小、像虾的海洋动物，是很多海洋动物的食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) Tiny shrimp-like sea animals (small crustaceans) that live in large groups and are a major food source for whales, seals, penguins, and many fish.","zh":"（常用复数）磷虾：一种体型很小、像虾的海洋甲壳类动物，常成群出现，是鲸、海豹、企鹅和许多鱼类的重要食物来源。"},"examples":[{"en":"Whales feed on krill in cold oceans.","zh":"鲸在寒冷海域以磷虾为食。"},{"en":"Antarctic krill are an important part of the marine food chain.","zh":"南极磷虾是海洋食物链中非常重要的一环。"},{"en":"Some people take krill oil as a supplement.","zh":"有些人把磷虾油当作保健补充剂。"}]}],"synonyms":["plankton (broader term)","small crustaceans"],"phonetic":"/krɪl/","extraExplanation":["你输入的 **kreil** 更常见的标准拼写是 **krill**（磷虾）。在英语里通常说 *krill*（既可指单数也可指复数），也常见表达 *krill oil*（磷虾油）。"]}
{"word":"kreis","summary":{"en":"Kreis is a German noun meaning either “circle” or (in Germany/Austria) an administrative district/county.","zh":"Kreis 是德语名词，可指“圆/圈”，也可指（德国/奥地利的）“行政区/县（郡）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German) a circle; a round shape or ring.","zh":"（德语）圆；圆形；环"},"examples":[{"en":"Draw a Kreis on the paper, then color it in.","zh":"在纸上画一个圆，然后把它涂上颜色。"},{"en":"The kids sat in a Kreis during story time.","zh":"讲故事时间，孩子们围成一圈坐着。"}]},{"partOfSpeech":"n.","definition":{"en":"(Germany/Austria) a district or county-level administrative area.","zh":"（德国/奥地利）行政区；县（或郡）级地区"},"examples":[{"en":"She works for the local Kreis government.","zh":"她在当地的县（区）政府工作。"},{"en":"This village belongs to a different Kreis.","zh":"这个村庄隶属于另一个县（区）。"}]}],"synonyms":["circle","ring","district","county"],"phonetic":"/kraɪs/","extraExplanation":["“Kreis”在德语里既可以指几何意义上的“圆”，也常用于德国的行政区划，类似英语里的“district / county”。在地址或官方文件中常见（如：Landkreis 表示“乡村县/郡”，Stadtkreis 表示“市辖区/城市县”）。"]}
{"word":"Kreisrat","summary":{"en":"district/county council or a member of it in German-speaking administration","zh":"德语地区的县/区议会，或该议会的议员"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a district/county council (the governing body) in parts of the German-speaking world; also used for the council’s meetings or decisions depending on context","zh":"（德语地区）县/区议会（地方行政层级的议会机构）；语境中也可指议会会议或其决议"},"examples":[{"en":"The Kreisrat approved the budget for the next year.","zh":"县/区议会通过了下一年度的预算。"},{"en":"She spoke in front of the Kreisrat about local transportation.","zh":"她在县/区议会上就本地交通发言。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of a district/county council; a district councilor","zh":"县/区议会议员；县/区议会代表"},"examples":[{"en":"He was elected as a Kreisrat in his hometown.","zh":"他在家乡当选为县/区议会议员。"},{"en":"Several Kreisräte supported the new environmental policy.","zh":"多位县/区议会议员支持新的环保政策。"}]}],"synonyms":["district council","county council","council","councilor","councillor"],"phonetic":"/ˈkraɪsˌrɑt/","extraExplanation":["这是典型的德语行政与政治词汇。在英文资料里常按功能翻译为 “district council / county council”，但要注意：德语的 Kreis 往往介于“市”和“州/省”之间，具体对应关系会因国家与州而异。","复数形式常见为 Kreisräte（带变音符 ä），指“多位议员”。如果只指机构本身，语境通常会让你判断是“议会”还是“议员”。"],"etymology":"德语复合词：Kreis（行政区/县、区）+ Rat（议会、委员会、参议机构）。字面意思是“地区的议会/委员会”。不同地区（如德国各州、瑞士部分地区）制度细节可能不同。","mnemonic":["拆词记：Kreis≈“圈/区域”（想成一个圈起来的行政区）+ Rat≈“议会/委员会”（联想英文 rate/rat 不要混淆，记成“开会讨论给建议”）。","把 Rat 记成“商量出办法（出主意）”，所以 Kreisrat 就是“一个行政区里负责商量决策的机构/人”。"]}
{"word":"kreistag","summary":{"en":"Kreistag: a German district council (elected local assembly) that governs a Landkreis/Kreis.","zh":"Kreistag：德国县/区层级的民选地方议会机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Germany) the elected district council that governs a Landkreis (rural district) or a Kreis (district), making local decisions such as budgets, services, and regional planning.","zh":"（德国）县/区议会：管理“Landkreis（农村县）/Kreis（区）”的民选议会机构，负责预算、公共服务与区域规划等地方决策。"},"examples":[{"en":"The Kreistag approved the district budget for next year.","zh":"县议会（Kreistag）批准了明年的区县预算。"},{"en":"Residents can attend some Kreistag meetings to follow local debates.","zh":"居民可以旁听部分县议会会议，了解地方议题的讨论。"},{"en":"The new policy was discussed first in the Kreistag before it was implemented.","zh":"新政策先在县议会中讨论，之后才实施。"}]}],"synonyms":["district council","county council (approx.)","Kreisrat (related term)"],"phonetic":"/ˈkraɪs.tɑːɡ/","extraExplanation":["“Kreistag”是德语行政词汇，常见于德国新闻与政府网站。它通常指“Landkreis（农村县）”层级的议会，不等同于城市的“Stadtrat（市议会）”。","德国地方行政大致可理解为：联邦州（Bundesland）→（部分地区有行政区 Regierungsbezirk）→县/区（Kreis或Landkreis）→乡镇/市镇（Gemeinde）。Kreistag属于“县/区”这一层级。","在英文语境中，Kreistag有时会被解释性翻译为“district council”或“county council”，但严格对应关系会因国家制度不同而略有差异。"]}
{"word":"kreistle","summary":{"en":"“Kreistle” is not a standard English word; it is usually a misspelling of “crystal.”","zh":"“kreistle”不是标准英语词；通常是把 “crystal（晶体/水晶/清澈的）” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling; not recognized as a common English word. In most cases, it is likely a misspelling of “crystal” (a clear mineral/glass, or something very clear).","zh":"非标准拼写；不是常见英语单词。多数情况下可能是 “crystal”（水晶/晶体；也可指“非常清澈、清晰的事物”）的拼写错误。"},"examples":[{"en":"I think you meant “crystal,” not “kreistle.”","zh":"我想你要写的是 “crystal”，不是 “kreistle”。"},{"en":"The vase is made of crystal and looks very clear.","zh":"这个花瓶是水晶（或水晶玻璃）做的，看起来非常清澈。"}]}],"synonyms":["crystal","clear","transparent"],"phonetic":"/ˈkrɪstəl/","extraExplanation":["“kreistle”在英语词典里一般查不到，常见原因是：拼写错误、名字/姓氏、或方言/自造词。","如果你原本想表达“水晶/晶体/清澈”，标准拼写是 crystal（美式常用发音 /ˈkrɪstəl/）。","如果你能提供它出现的句子或上下文（比如一整句话、来源文本、想表达的意思），我可以更准确判断你要找的词。"]}
{"word":"kreitonite","summary":{"en":"Kryptonite is the fictional mineral that weakens Superman, and it also means someone’s special weakness.","zh":"Kryptonite（氪石）是会削弱超人的虚构矿物，也常用来比喻某人的“致命弱点/克星”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fictional mineral from the Superman stories that weakens or can harm Superman; often used to mean a person’s special weakness","zh":"（虚构的）氪石：出自《超人》故事的矿物，会削弱或伤害超人；也常比喻“某人的致命弱点/克星”"},"examples":[{"en":"In the movies, kryptonite makes Superman lose his strength.","zh":"在电影里，氪石会让超人失去力量。"},{"en":"Spicy food is my kryptonite—I can’t say no.","zh":"辣的食物是我的“克星”——我很难拒绝。"},{"en":"Public speaking used to be her kryptonite, but she’s getting better.","zh":"公开演讲过去是她的致命弱点，但她正在变得更好。"}]}],"synonyms":["weakness","Achilles' heel","fatal flaw"],"phonetic":"/ˈkrɪp.tə.naɪt/","extraExplanation":["你写的“kreitonite”更常见的拼写是 **kryptonite**（氪石）。这是流行文化里非常常用的隐喻，用来形容“某个让人瞬间变弱/难以抵抗的点”。","文化背景：kryptonite 来自 DC 漫画《Superman》，最早在 1940 年代的广播剧中出现，后来在漫画、电影与电视剧中广泛使用。日常口语里常说 “X is my kryptonite”。"]}
{"word":"kreittonite","summary":{"en":"“Kreittonite” is usually a misspelling of “kryptonite,” meaning Superman’s weakness and, by extension, any critical weakness.","zh":"“kreittonite”通常是“kryptonite”的误拼：指超人的克星“氪石”，也可引申为任何致命弱点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) “Kryptonite,” a fictional substance from Superman stories that weakens Superman; more generally, something that makes a strong person or plan suddenly weak.","zh":"（常见拼写错误）“kryptonite（氪石）”，出自《超人》故事的虚构物质，会让超人失去力量；引申为让强者/计划突然变弱的“致命弱点”。"},"examples":[{"en":"In the Superman comics, kryptonite can make Superman weak.","zh":"在《超人》漫画里，氪石会让超人变得虚弱。"},{"en":"Public speaking is my kryptonite—I get nervous fast.","zh":"公开演讲是我的“致命弱点”——我很快就紧张。"},{"en":"A single security flaw can be the kryptonite of an otherwise great app.","zh":"一个安全漏洞可能就是一款原本很棒的应用的“致命弱点”。"}]}],"synonyms":["Achilles’ heel","weak spot","downfall"],"phonetic":"/ˈkrɪp.təˌnaɪt/","extraExplanation":["你写的“kreittonite”通常是把 **kryptonite** 拼错了。标准拼法是 *kryptonite*，常见发音里会听到类似“krip-”。","“kryptonite”在日常英语里常被当作比喻，用来形容一个人或事物最怕的东西（弱点、克星）。写作时多用于口语或轻松语气。","相关表达：**Achilles’ heel**（阿喀琉斯之踵＝致命弱点，偏正式）；**weak spot**（弱点/软肋）；**one’s downfall**（导致失败的东西）。"]}
{"word":"kreitzman","summary":{"en":"Kreitzman is a surname (a family name).","zh":"Kreitzman 是一个姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). It is used to refer to a person or family named Kreitzman.","zh":"一个姓氏（家族姓）。用来指姓 Kreitzman 的人或家族。"},"examples":[{"en":"Dr. Kreitzman will present the research findings tomorrow.","zh":"Kreitzman 医生明天将展示研究结果。"},{"en":"I emailed Ms. Kreitzman to ask about the schedule.","zh":"我给 Kreitzman 女士发了邮件询问日程安排。"}]}],"phonetic":"/ˈkraɪtsmən/","extraExplanation":["“Kreitzman”更常见为人名中的姓（专有名词），不是日常词汇，因此通常不翻译含义；在写作中按姓氏使用并首字母大写。","其拼写和发音常见于德语或意第绪语（Yiddish）背景的姓氏，但具体家族来源会因个人/家谱而异。"]}
{"word":"krelos","summary":{"en":"“krelos” is not a recognized common English word; it may be a misspelling or a proper name. Please provide context.","zh":"“krelos” 不是常见英语词，可能是拼写错误或专有名词。请提供上下文以便判断。"},"extraExplanation":["“krelos” 不是常见英语单词，可能是：\n1) 拼写错误（例如想写的是 *Kreolos / Creoles / Krelos* 之类）；\n2) 专有名词（人名、游戏/小说角色名、品牌名、地名等）；\n3) 其他语言的词（并非英语）。\n\n如果你把它出现的句子或来源贴出来（例如一整句、网页/游戏/书名），我可以根据语境判断它最可能的含义与正确拼写。"]}
{"word":"kremersite","summary":{"en":"Kremersite is a rare purple sulfate mineral, also called ferric ammonium alum.","zh":"kremersite 指一种罕见的紫色硫酸盐矿物，也称铁铵明矾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a sulfate) made of ferric ammonium sulfate, typically forming purple to violet crystals; also known as ferric ammonium alum.","zh":"一种较罕见的硫酸盐矿物，化学成分为三价铁的硫酸铵复盐（常呈紫色到紫罗兰色晶体）；也可称为“铁铵明矾”。"},"examples":[{"en":"The specimen was labeled as kremersite, showing deep purple crystals.","zh":"这件标本被标注为 kremersite（克雷默石），呈现深紫色晶体。"},{"en":"Kremersite is a sulfate mineral sometimes discussed alongside other alum minerals.","zh":"kremersite 属于硫酸盐矿物，有时会与其他明矾类矿物一起讨论。"}]}],"synonyms":["ferric ammonium alum","iron ammonium alum"],"phonetic":"ˈkrɛmərˌsaɪt","extraExplanation":["kremersite 在矿物学中通常指“铁铵明矾”（ferric ammonium sulfate dodecahydrate，常写作 NH₄Fe(SO₄)₂·12H₂O），以紫色晶体为特征。","词尾 -ite 常见于矿物名称（如 calcite 方解石、malachite 孔雀石），表示“某种矿物/岩石”。","该词多见于地质、矿物标本与学术语境，日常英语中很少使用。"]}
{"word":"Kremlin","summary":{"en":"Kremlin usually means the fortified complex in central Moscow, and by extension it can mean the Russian government/leadership in political contexts.","zh":"Kremlin 通常指莫斯科市中心的克里姆林宫；在政治新闻中也常转喻指俄罗斯政府/最高领导层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The main fortified complex in central Moscow that includes important government buildings (such as the seat of Russia’s president) and historic churches and palaces.","zh":"莫斯科市中心的克里姆林宫（城堡/要塞群），包含重要政府建筑（如俄罗斯总统办公地）以及历史悠久的教堂与宫殿。"},"examples":[{"en":"Tourists lined up to visit the Kremlin and see its cathedrals.","zh":"游客排队参观克里姆林宫，观看那里的大教堂。"},{"en":"The meeting was held inside the Kremlin walls.","zh":"会议在克里姆林宫的城墙内举行。"}]},{"partOfSpeech":"n.","definition":{"en":"The Russian government, especially its top leaders, spoken of as a symbol (metonymy) in news and political writing.","zh":"（新闻/政治语境中）用来指代俄罗斯政府，尤其是最高领导层（以地名代政府的“转喻”用法）。"},"examples":[{"en":"The Kremlin said it would respond to the new sanctions.","zh":"克里姆林宫方面表示将对新制裁作出回应。"},{"en":"Analysts are watching how the Kremlin handles the crisis.","zh":"分析人士正在关注克里姆林宫将如何处理这场危机。"}]}],"synonyms":["the Russian government","the Russian leadership","Moscow (in political context)"],"phonetic":"/ˈkrɛm.lɪn/","extraExplanation":["“Kremlin”原本是俄语里“城堡/要塞”的意思（并非只指莫斯科那一处）。俄国一些城市也有自己的“kremlin”（如喀山克里姆林），但英语里不加说明时通常默认指莫斯科的克里姆林宫。","媒体写作中常见的用法是“以地点代机构/政府”（如：the White House=美国政府/总统办公室；Downing Street=英国首相办公室）。因此看到“The Kremlin said...”时，通常理解为“俄罗斯官方/政府发言”。"]}
{"word":"kremlin","summary":{"en":"The Kremlin is the fortified government complex in Moscow; “the Kremlin” also means the Russian government or leadership.","zh":"Kremlin 指莫斯科的克里姆林宫；the Kremlin 也常转指俄罗斯政府或领导层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fortified central complex in Moscow that contains major government buildings (including the official residence and offices of Russia’s president)","zh":"（莫斯科）克里姆林宫（位于市中心的要塞式建筑群，包含重要政府建筑，如俄罗斯总统的官邸与办公地点）"},"examples":[{"en":"Tourists lined up to visit the Kremlin and see the old cathedrals inside.","zh":"游客排队参观克里姆林宫，观看里面古老的教堂。"},{"en":"A meeting was held at the Kremlin on Monday.","zh":"周一在克里姆林宫举行了一场会议。"}]},{"partOfSpeech":"n.","definition":{"en":"(often “the Kremlin”) the Russian government or its leaders, spoken of indirectly (a metonym)","zh":"（常作 the Kremlin）克里姆林宫（转喻：指俄罗斯政府或其领导层）"},"examples":[{"en":"The Kremlin denied the report.","zh":"克里姆林宫否认了这则报道。"},{"en":"Analysts are watching how the Kremlin will respond.","zh":"分析人士正在关注俄罗斯政府将如何回应。"}]}],"synonyms":["the Russian government","Moscow (as a political metonym)"],"phonetic":"/ˈkrɛm.lɪn/","extraExplanation":["“Kremlin”来自俄语“кремль”，本义是“城堡、要塞”。俄罗斯不少城市也有自己的“kremlin”（城堡区），但英语里不加说明时通常特指莫斯科的克里姆林宫。","英语中常用定冠词说“the Kremlin”来表示“俄罗斯政府/高层”，类似用法还有“the White House”（美国政府/总统团队）、“Downing Street”（英国首相/政府）。"]}
{"word":"kremlinologist","summary":{"en":"A specialist who interprets Russian/Soviet government politics—often by analyzing subtle clues in official information.","zh":"通过官方信息中的细微线索来解读俄/苏政府政治与权力动向的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies and tries to interpret the policies, decisions, and power relationships of the Russian (formerly Soviet) government—especially by closely analyzing official statements and small clues.","zh":"“克里姆林宫问题专家”：研究并试图解读俄罗斯（旧时也指苏联）政府的政策、决策与权力关系的人，常通过分析官方声明和细微线索来推断内情。"},"examples":[{"en":"During the Cold War, Kremlinologists read speeches for tiny hints about leadership changes.","zh":"冷战时期，克里姆林宫问题专家会从演讲中寻找细微线索，推断领导层是否更迭。"},{"en":"Some journalists became Kremlinologists, comparing photos and wording to guess who was gaining influence.","zh":"一些记者成了“克里姆林宫问题专家”，会对比照片与措辞来猜测谁的影响力在上升。"},{"en":"Today the term is sometimes used more broadly for anyone who analyzes an opaque organization from limited information.","zh":"如今这个词有时也被引申为：在信息有限、组织不透明的情况下进行推断分析的人。"}]}],"synonyms":["Russia watcher","Sovietologist","political analyst","policy analyst"],"phonetic":"/ˌkrɛm.lɪˈnɑː.lə.dʒɪst/","extraExplanation":["“Kremlin”指莫斯科的克里姆林宫，也常被用来代称俄罗斯（或当时苏联）最高权力中心；“-ologist”表示“研究……的人”。这个词在英语里常带一点“从蛛丝马迹推理内情”的意味，语气有时略带调侃，但也可中性使用。"]}
{"word":"kremlinologists","summary":{"en":"Kremlinologists are people who analyze Soviet/Russian leadership and politics—often by interpreting indirect clues; by extension, anyone who reads subtle signs to guess an organization’s inner politics.","zh":"“kremlinologists”指研究苏联/俄罗斯高层政治的人，常通过间接线索推断动向；引申为靠蛛丝马迹猜测组织内部权力与政治的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialist who studies the leaders and politics of the Soviet Union (and later Russia), often by interpreting indirect clues (such as speeches, photos, or official announcements).","zh":"“克里姆林宫观察家/苏联（后来的俄罗斯）政治分析专家”，常通过间接线索（如讲话、合影、官方公告等）来推测高层政治动向的人。"},"examples":[{"en":"During the Cold War, many Kremlinologists tried to predict who would become the next Soviet leader.","zh":"冷战时期，许多“克里姆林宫观察家”试图预测谁会成为下一任苏联领导人。"},{"en":"Some journalists joked that Kremlinologists could read political meaning into where officials stood in a photo.","zh":"一些记者打趣说，“克里姆林宫观察家”能从官员在合影里站的位置读出政治含义。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly (often humorous), someone who analyzes an organization’s inner politics by reading subtle signs rather than direct information.","zh":"更广义（常带幽默）：指通过细微迹象而非直接信息来分析某个组织内部权力与政治的人。"},"examples":[{"en":"Office Kremlinologists noticed who got invited to the closed-door meeting.","zh":"“办公室克里姆林学家”会注意到谁被邀请参加了闭门会议。"},{"en":"Fans became Kremlinologists, decoding every pause in the band’s announcement.","zh":"粉丝们成了“克里姆林宫观察家”，解读乐队声明里的每一次停顿。"}]}],"synonyms":["Sovietologist","political analyst","Russia watcher","pundits","insiders (informal)"],"phonetic":"/ˌkrɛm.lɪˈnɑl.ə.dʒɪsts/","extraExplanation":["“Kremlinologist”源自“Kremlin（克里姆林宫）+ -ologist（研究……的人）”。在冷战时期，苏联政治高度不透明，外界常只能从公开但有限的信息推测权力变化，因此这个词带有“从蛛丝马迹推断内幕”的意味。","现代英语里常把它延伸为一种略带调侃的说法，用来形容对任何封闭体系（公司、政府、体育俱乐部等）“过度解读信号、猜测权力走向”的人。"]}
{"word":"kremlinology","summary":{"en":"Kremlinology means analyzing Soviet/Russian (or any secretive) politics by interpreting indirect clues when direct information is scarce.","zh":"Kremlinology 指在信息不透明时，通过解读间接线索来分析苏联/俄罗斯（或任何神秘组织）的政治与权力动向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study or practice of analyzing Soviet (and later Russian) politics by interpreting indirect clues—such as official photos, speeches, seating order, or small changes in wording—because reliable information is limited.","zh":"“克里姆林宫学/克里姆林学”：通过解读间接线索（如官方照片、讲话、座位安排、措辞变化等）来分析苏联（后来也指俄罗斯）政治的研究或做法，因为可靠信息往往有限。"},"examples":[{"en":"During the Cold War, journalists often relied on kremlinology to guess who was gaining power.","zh":"冷战时期，记者常常依靠“克里姆林宫学”来猜测谁的权力在上升。"},{"en":"A minor change in the official statement led to a new wave of kremlinology among analysts.","zh":"官方声明中一个小小的改动，引发了分析人士新一轮的“克里姆林学”解读。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, the practice of trying to understand any secretive organization or government by reading between the lines and interpreting limited, indirect information.","zh":"（泛指）通过“字里行间”的推断、解读有限且间接的信息来理解任何不透明的组织或政府的做法。"},"examples":[{"en":"Fans did some kremlinology on the company’s vague announcement to predict the next product.","zh":"粉丝们对公司含糊的公告做了一番“克里姆林学式解读”，来预测下一款产品。"},{"en":"Office kremlinology isn’t always accurate, but it can reveal what people are worried about.","zh":"办公室里的“克里姆林学”未必准确，但它能反映大家在担心什么。"}]}],"synonyms":["political analysis","reading between the lines","guesswork","speculation"],"phonetic":"/ˌkrɛm.lɪˈnɑl.ə.dʒi/","extraExplanation":["词源与背景：Kremlin 指莫斯科的“克里姆林宫”（俄罗斯国家权力象征之一）；-ology 表示“……学/研究”。该词在冷战时期流行，用来形容西方观察者在信息不透明的环境下，通过细节推断苏联高层政治动向。","语体提示：常带一点“揣测、过度解读”的语气；用于日常语境时，往往是半开玩笑地说“像研究克里姆林一样去猜”。"]}
{"word":"kremlins","summary":{"en":"“Kremlins” is the plural of “kremlin,” most often referring to the Kremlin as the Russian government, or more literally to Russian city citadels called kremlins.","zh":"“kremlins”是“kremlin”的复数，最常见指“克里姆林宫”转喻为俄罗斯政府；也可字面指俄罗斯一些城市的“克里姆林”（城堡/要塞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) The Kremlin, meaning the Russian government or its leadership (a common metonym in news and politics).","zh":"（复数）“克里姆林宫”，常作转喻，指俄罗斯政府或其领导层（新闻与政治语境常见）。"},"examples":[{"en":"The kremlins denied involvement in the cyberattack.","zh":"克里姆林宫方面否认参与了这次网络攻击。"},{"en":"Talks with the kremlins resumed after months of tension.","zh":"在数月紧张之后，与克里姆林宫方面的谈判恢复了。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Fortified citadels in Russia called a “kremlin,” typically the historic central fortress of a city.","zh":"（复数）俄罗斯一些城市的“克里姆林”（城堡/要塞），通常指城市历史中心的防御性堡垒。"},"examples":[{"en":"Several old Russian cities still have kremlins with thick walls and towers.","zh":"一些俄罗斯古城至今仍保留着城墙厚实、塔楼林立的克里姆林要塞。"},{"en":"We visited the kremlins of Kazan and Novgorod on our trip.","zh":"旅行中我们参观了喀山和诺夫哥罗德的克里姆林要塞。"}]}],"synonyms":["the Russian government","Russian leadership","the Kremlin (metonym)","citadels","fortresses"],"phonetic":"/ˈkrɛm.lɪnz/","extraExplanation":["“Kremlin”来自俄语“кремль”，原意与城市中心的防御堡垒有关。英语里最常见的是专指莫斯科的克里姆林宫，因此在媒体中常用“The Kremlin”代指俄罗斯中央政府（类似用“The White House”指美国政府）。","写法上：专指莫斯科建筑群/政府时常大写“the Kremlin”；泛指各城市的要塞时可小写“a kremlin / kremlins”。"]}
{"word":"krems","summary":{"en":"Krems is a city in Austria on the Danube, also associated with a nearby wine-producing area.","zh":"Krems（克雷姆斯）是奥地利多瑙河畔的一座城市，也常指其周边著名的葡萄酒产区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northeastern Austria on the Danube River (often said as “Krems an der Donau”).","zh":"奥地利东北部多瑙河畔的一座城市（常说作“克雷姆斯—多瑙河畔”，Krems an der Donau）。"},"examples":[{"en":"We stopped in Krems on our way through the Wachau Valley.","zh":"我们穿越瓦豪河谷时在克雷姆斯停了一站。"},{"en":"Krems is known for its riverside views and historic old town.","zh":"克雷姆斯以河畔风景和历史悠久的老城而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"the area around Krems that is known for Austrian white wines (often linked with the Kremstal and nearby Wachau wine regions).","zh":"以白葡萄酒闻名的克雷姆斯周边葡萄酒产区（常与Kremstal及邻近的瓦豪Wachau产区相关）。"},"examples":[{"en":"This Grüner Veltliner comes from near Krems.","zh":"这款绿维特利纳（Grüner Veltliner）来自克雷姆斯附近。"},{"en":"They booked a wine tasting near Krems in early autumn.","zh":"他们在初秋预订了克雷姆斯附近的葡萄酒品鉴。"}]}],"synonyms":["Krems an der Donau"],"phonetic":"/krɛmz/","extraExplanation":["“Krems”在英语中多作为地名使用；更完整的官方写法常见为“Krems an der Donau”（强调在多瑙河畔）。","克雷姆斯附近属于奥地利著名白葡萄酒带，常会和“Kremstal（克雷姆斯谷）”“Wachau（瓦豪）”一起出现在酒标、旅游介绍与美食文化中。"]}
{"word":"Krenak","summary":{"en":"an Indigenous people of eastern Brazil and their traditional language","zh":"巴西东部的原住民族及其传统语言"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Indigenous people from eastern Brazil, especially associated with the Rio Doce (Watu) region in the state of Minas Gerais","zh":"巴西东部的原住民族之一，主要与米纳斯吉拉斯州里约多塞河（Watu）流域相关"},"examples":[{"en":"The Krenak people have long lived along the Rio Doce basin.","zh":"克雷纳克族长期居住在里约多塞河流域。"},{"en":"Many Krenak leaders advocate for protecting their land and river.","zh":"许多克雷纳克族领袖倡议保护他们的土地与河流。"}]},{"partOfSpeech":"n.","definition":{"en":"the language traditionally spoken by the Krenak people","zh":"克雷纳克族传统使用的语言"},"examples":[{"en":"Researchers are working with communities to document Krenak.","zh":"研究者正与社群合作记录克雷纳克语。"},{"en":"Some schools include Krenak language and culture in local education programs.","zh":"一些学校在地方教育项目中纳入克雷纳克语与文化。"}]}],"phonetic":"/ˈkrɛnæk/","extraExplanation":["这是一个专名（民族名/语言名），通常首字母大写：Krenak。","在历史文献中，克雷纳克人有时被外界用其他称呼指代；其中部分旧称带有贬义或殖民时代色彩，现代写作更推荐使用 “Krenak”。","当代巴西公共讨论中，“Krenak”也常与作家与原住民思想家 Ailton Krenak 相关联；提到人名时同样写作 Krenak。"],"etymology":"源自克雷纳克族对自身群体名称的转写（葡萄牙语与英语文献中常见作 Krenak）。在不同资料中可能也会看到与其自称或邻近族群称呼相关的拼写差异。","mnemonic":["把它当作专有名词记：K 大写 + renak；看到大写就联想到“族名/语言名”。","可联想发音像“可-雷-纳克”，用“可（人）+雷（河流/自然）+纳（守护）”来记“与河流、土地守护相关的原住民族”。"]}
{"word":"kreng","summary":{"en":"“Kreng” is a Thai-derived slang word meaning you feel reluctant to impose on others (often short for “kreng jai”).","zh":"“kreng”源自泰语，指“不想麻烦别人、怕给人添负担”的心理（常为“kreng jai”的简写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Loanword/slang, chiefly from Thai) A shortened form referring to the Thai idea of being considerate and not wanting to impose on others; a feeling of reluctance to ask for help or cause inconvenience (often seen as short for “kreng jai”).","zh":"（外来词/俚语，主要来自泰语）指泰语文化里“体贴、不愿给别人添麻烦”的心理；因为怕打扰或让对方为难而不太敢开口求助（常被当作“kreng jai/เกรงใจ”的简写）。"},"examples":[{"en":"I didn’t ask for a ride because I was feeling kreng.","zh":"我没开口让人载我，因为觉得很“kreng”（怕麻烦别人）。"},{"en":"She’s kreng about sending the food back, even though it’s wrong.","zh":"她就算拿到错的菜也很“kreng”，不太好意思退回去。"},{"en":"In Thai contexts, people may say they’re kreng when they don’t want to trouble you.","zh":"在泰国语境里，有人会说自己很“kreng”，意思是不想给你添麻烦。"}]}],"synonyms":["reluctant to impose","considerate","self-conscious about asking","deferential"],"phonetic":"/krɛŋ/","extraExplanation":["“kreng/kreng jai（เกรงใจ）”在泰国文化中很常见：它不只是“害羞”，更像一种社交上的体贴与克制——顾及对方的面子、时间与负担，因此不愿提出要求或让对方为难。","在英文里“kreng”并不算标准词汇，更多出现在东南亚相关的社群对话、旅行/留学讨论或社交媒体中；正式写作建议用解释性表达，如 “I don’t want to impose.” 或 “I feel bad asking.”"]}
{"word":"krennerite","summary":{"en":"Krennerite is a rare gold-bearing mineral (KAuTe₂).","zh":"krennerite（克伦纳矿）是一种稀有的含金矿物（KAuTe₂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral made of potassium gold telluride (chemical formula: KAuTe₂).","zh":"一种稀有矿物，主要成分为钾-金-碲化物（化学式：KAuTe₂）。"},"examples":[{"en":"Krennerite is an important ore mineral because it contains gold.","zh":"克伦纳矿很重要，因为它是一种含金的矿石矿物。"},{"en":"The specimen was identified as krennerite after lab testing.","zh":"经过实验室检测，这个标本被鉴定为克伦纳矿。"}]}],"synonyms":["potassium gold telluride"],"phonetic":"/ˈkrɛnəˌraɪt/","extraExplanation":["“krennerite”是以匈牙利矿物学家Károly (Karl) Krenner的名字命名的矿物名，因此首字母小写，属于专有名词衍生的普通名词。","它常出现在矿物学、地质学与采矿语境中，日常英语里很少使用；在阅读矿物标本说明或矿床资料时更常见。"]}
{"word":"kreosote","summary":{"en":"Creosote is a tar-based liquid used to preserve wood; it can also mean the desert creosote bush.","zh":"Creosote 指用于防腐木材的焦油类液体（杂酚油）；也可指沙漠植物“脂臭灌木/克里奥索特灌木”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong-smelling, oily, dark liquid made from coal tar or wood tar, used to preserve wood and protect it from insects and rot","zh":"一种气味很强的油状深色液体，由煤焦油或木焦油制成，用于防腐木材、防虫和防腐烂"},"examples":[{"en":"The fence posts were treated with creosote to keep them from rotting.","zh":"栅栏柱子用杂酚油处理过，以防腐烂。"},{"en":"Creosote has a sharp smell, so people often notice it around railroad ties.","zh":"杂酚油气味刺鼻，所以人们常在铁路枕木附近闻到。"}]},{"partOfSpeech":"n.","definition":{"en":"a desert shrub (also called the creosote bush) common in the southwestern U.S., named because its leaves smell like creosote after rain","zh":"一种常见于美国西南部沙漠地区的灌木（也叫“克里奥索特灌木/脂臭灌木”），因雨后叶子会散发类似杂酚油的气味而得名"},"examples":[{"en":"After the rain, the desert smelled like creosote bush.","zh":"雨后，沙漠里有股脂臭灌木的气味。"},{"en":"Creosote is one of the most widespread plants in the Mojave Desert.","zh":"脂臭灌木是莫哈韦沙漠分布最广的植物之一。"}]}],"synonyms":["wood preservative (context)","tar oil (context)"],"phonetic":"/ˈkriəˌsoʊt/","extraExplanation":["“kreosote”通常是“creosote”的拼写误差或不常见变体；标准拼写是 creosote。","杂酚油（尤其是煤焦油杂酚油）含有多种化学成分，使用或接触时通常需要注意安全与通风；在一些地区对其用途有严格规定。"]}
{"word":"krepi","summary":{"en":"“Krepi” is not standard English; it’s usually a misspelling of “crepe” or “creepy.”","zh":"“krepi”不是标准英语词；通常是把“crepe”或“creepy”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or informal spelling. In English contexts, people often mean “crepe” (a thin pancake/fabric) or “creepy” (scary/strange).","zh":"不是标准英语单词；通常是拼写错误或非正式写法。在英语语境里，人们常想表达“crepe”（可丽饼/绉纱）或“creepy”（令人不安的/怪吓人的）。"},"examples":[{"en":"I couldn’t find “krepi” in the dictionary—did you mean “crepe” or “creepy”?","zh":"我在词典里找不到“krepi”——你是想写“crepe”还是“creepy”？"},{"en":"If you mean the thin French pancake, write “crepe,” not “krepi.”","zh":"如果你指的是法式薄饼，应写“crepe”，不是“krepi”。"},{"en":"If you mean “strange and scary,” the correct spelling is “creepy.”","zh":"如果你想表达“怪怪的、让人害怕的”，正确拼法是“creepy”。"}]}],"phonetic":"ˈkrɛpi","extraExplanation":["“krepi”更像是把发音按母语习惯拼出来的写法（例如想写 /ˈkrɛpi/ 这种读音）。如果你能提供一句包含“krepi”的原句或说明它来自哪种语言/平台（聊天、歌曲、游戏、名字等），我可以更准确判断你真正想查的词。"]}
{"word":"krepis","summary":{"en":"“Crepe/crepes” most commonly means a very thin French-style pancake; it can also mean a type of slightly wrinkled fabric.","zh":"“crepe/crepes”最常指法式薄饼（可丽饼）；也可指一种带细皱纹的布料（绉纱/绉布）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very thin pancake, often filled or topped with sweet or savory ingredients (common in French cooking).","zh":"可丽饼；法式薄饼（很薄的煎饼，常加甜或咸的馅料/配料）。"},"examples":[{"en":"I ordered a crepe with strawberries and whipped cream.","zh":"我点了一份草莓加鲜奶油的可丽饼。"},{"en":"They make savory crepes with ham, cheese, and eggs.","zh":"他们做火腿、奶酪和鸡蛋口味的咸可丽饼。"}]},{"partOfSpeech":"n.","definition":{"en":"a light, slightly wrinkled cloth (often silk or synthetic) used in clothing; also used for mourning clothes in older traditions.","zh":"绉纱；绉布（常用于服装的一种轻薄、有细皱纹的布料；旧时也可用于丧服）。"},"examples":[{"en":"She wore a crepe dress that draped softly.","zh":"她穿了一条垂坠感很柔和的绉布连衣裙。"},{"en":"In some traditions, black crepe was used as a sign of mourning.","zh":"在一些传统中，黑色绉纱曾被用作哀悼的标志。"}]}],"synonyms":["pancake (for the food sense)","thin pancake","wrinkled fabric (for the cloth sense)"],"phonetic":"/kreɪp/","extraExplanation":["你输入的“krepis”更像是把英语 **crepes**（可丽饼的复数）按发音拼出来的。英语里单数常写 **crepe**，复数是 **crepes**（很多菜单上也直接用法语写法 **crêpe / crêpes**）。"]}
{"word":"kreplach","summary":{"en":"Kreplach are Jewish filled dumplings, often served in soup.","zh":"Kreplach 是犹太风味的带馅面皮饺子，常放在汤里吃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish (often Ashkenazi) dumpling made of pasta dough and filled with meat, potatoes, or other ingredients, commonly served in soup (especially chicken soup) or sometimes fried.","zh":"克雷普拉赫（常见于阿什肯纳兹犹太饮食的一种饺子/面皮馅点），用面团包裹肉馅、土豆等馅料，常放在汤里（尤其是鸡汤）食用，也可煎炸。"},"examples":[{"en":"We had chicken soup with kreplach for the holiday meal.","zh":"节日大餐时，我们喝了加克雷普拉赫的鸡汤。"},{"en":"My grandmother makes kreplach with beef and onions.","zh":"我奶奶做的克雷普拉赫用牛肉和洋葱作馅。"},{"en":"Some people pan-fry kreplach and serve them with sour cream.","zh":"有些人会把克雷普拉赫煎一下，再配酸奶油吃。"}]}],"synonyms":["filled dumplings","Jewish dumplings"],"phonetic":"/ˈkrɛplɑx/","extraExplanation":["“Kreplach”常见于意第绪语（Yiddish）与阿什肯纳兹犹太饮食文化中，形状常为三角或半月。它常在犹太节日或家庭聚餐出现，尤其与“鸡汤里的饺子”这类温暖的家常意象联系紧密。","英文里“kreplach”多作为不可数或复数名词使用（例如：We ate kreplach. / a bowl of kreplach），单数有时也会说“a kreplach”，但在实际交流中更常直接用作整体菜名。"]}
{"word":"kreplech","summary":{"en":"Kreplach (“kreplech”) are Jewish filled dumplings, often served in chicken soup.","zh":"Kreplach（“kreplech”）是犹太风味的包馅小饺子/馄饨，常放在鸡汤里食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Kreplach (also spelled “kreplech”) are small Jewish dumplings—usually filled with meat, potato, or cheese—often served in soup (especially chicken soup) or sometimes fried.","zh":"Kreplach（也常写作“kreplech”）是一种犹太风味小饺子/馄饨，常见内馅有肉、土豆或奶酪；通常放在汤里（尤其是鸡汤）食用，也有油炸的做法。"},"examples":[{"en":"My grandmother makes kreplach for chicken soup every year.","zh":"我奶奶每年都会包kreplach，放进鸡汤里吃。"},{"en":"We ordered kreplach as a starter at the deli.","zh":"我们在熟食店点了kreplach当开胃菜。"}]}],"synonyms":["dumplings","Jewish dumplings","filled dumplings"],"phonetic":"/ˈkrɛp.lɑx/","extraExplanation":["“Kreplach”源自意第绪语（Yiddish），在英语里多用于描述东欧阿什肯纳兹犹太饮食文化中的“馄饨/饺子”类食物。拼写常见有kreplach与kreplech。","它常与特定节日或传统餐桌联系在一起：例如在普珥节（Purim）或赎罪日前后（Yom Kippur）的一些家庭传统中会出现（不同家庭做法与时间不尽相同）。","文化语境中，提到“kreplach in chicken soup”很容易让人联想到经典的犹太熟食店（Jewish deli）与“家常安慰食物（comfort food）”。"]}
{"word":"Kreutzer","summary":{"en":"a proper name tied to Beethoven’s famous violin sonata and to the violinist it was dedicated to","zh":"与贝多芬著名小提琴奏鸣曲及其题献对象小提琴家相关的专名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A French violinist and composer (Rodolphe Kreutzer, 1766–1831), best remembered because Beethoven dedicated his Violin Sonata No. 9 to him.","zh":"法国小提琴家兼作曲家罗道夫·克鲁采（1766–1831）；他最广为人知是因为贝多芬将《第九号小提琴奏鸣曲》题献给他。"},"examples":[{"en":"Beethoven dedicated his Violin Sonata No. 9 to Rodolphe Kreutzer, even though Kreutzer reportedly never performed it.","zh":"贝多芬将《第九号小提琴奏鸣曲》题献给罗道夫·克鲁采，尽管据说克鲁采本人并未演奏过这首作品。"},{"en":"Kreutzer was a leading violin teacher in Paris during the early 19th century.","zh":"19世纪初，克鲁采是巴黎重要的小提琴教育家之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A common nickname for Beethoven’s Violin Sonata No. 9 in A major, Op. 47: the “Kreutzer Sonata.”","zh":"贝多芬《A大调第九号小提琴奏鸣曲，作品47》的常用别称： “《克鲁采奏鸣曲》”。"},"examples":[{"en":"The recital ended with Beethoven’s “Kreutzer Sonata.”","zh":"音乐会以贝多芬的《克鲁采奏鸣曲》收尾。"},{"en":"Many pianists find the “Kreutzer” demanding because it is both fast and dramatic.","zh":"不少钢琴家觉得《克鲁采》很难，因为它既快速又戏剧性强。"}]},{"partOfSpeech":"n.","definition":{"en":"A reference to Tolstoy’s novella “The Kreutzer Sonata,” inspired by Beethoven’s sonata and focused on jealousy, marriage, and morality.","zh":"指托尔斯泰中篇小说《克鲁采奏鸣曲》；作品受贝多芬同名奏鸣曲启发，主题涉及嫉妒、婚姻与道德。"},"examples":[{"en":"Tolstoy’s “The Kreutzer Sonata” caused controversy for its views on love and marriage.","zh":"托尔斯泰的《克鲁采奏鸣曲》因其对爱情与婚姻的观点引发争议。"},{"en":"In the novella, a performance of the sonata becomes a turning point in the story.","zh":"在小说中，一次《克鲁采奏鸣曲》的演奏成为情节的转折点。"}]}],"synonyms":["Kreutzer Sonata","Violin Sonata No. 9","Op. 47","The Kreutzer Sonata","Rodolphe Kreutzer"],"phonetic":"/ˈkrɔɪt.sɚ/","extraExplanation":["读音与拼写提示：英语里常见写法是 “Kreutzer”（多用于人名、奏鸣曲与文学作品标题）；不要与历史上奥地利小硬币 “Kreuzer”（常译“克鲁泽/克罗伊策”）混淆。"],"etymology":"源自德语姓氏 Kreutzer（亦见 Kreutzer/Kreuzer 等拼写变体）。作为文化用法，因贝多芬将《第九号小提琴奏鸣曲》题献给法国小提琴家 Rodolphe Kreutzer，作品遂以其姓氏广泛流传；托尔斯泰后来又以该奏鸣曲为灵感写成同名小说。","mnemonic":["把它联想成“克鲁采/克鲁策”这个译名：一听到就想到贝多芬那首非常有名、很“炸裂”的小提琴奏鸣曲。","记忆链：Kreutzer（人名）→ Kreutzer Sonata（贝多芬奏鸣曲）→ Tolstoy（托尔斯泰同名小说）。"]}
{"word":"kreutzer","summary":{"en":"Kreutzer is a historical small coin from German/Austrian regions, and it’s also a cultural name most famously linked to Beethoven’s “Kreutzer Sonata.”","zh":"Kreutzer 指德奥地区历史上的小面值硬币，也常作为文化专名，最著名的是与贝多芬《克罗伊策奏鸣曲》相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former small coin used in parts of Germany and Austria (historically a low-value unit of money).","zh":"（历史上）德国、奥地利等地使用过的“克罗伊策/克罗伊采尔”，一种小面值硬币（低价值货币单位）。"},"examples":[{"en":"In old Austrian records, prices were sometimes listed in kreutzers.","zh":"在旧奥地利的记录里，价格有时会用“克罗伊策”来标注。"},{"en":"He found a few kreutzers in a box of family keepsakes.","zh":"他在一盒彩具般的家族纪念物里发现了几枚克罗伊策硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a name used in culture for works connected to “Kreutzer,” especially Beethoven’s “Kreutzer Sonata.”","zh":"（常大写）文化语境中的专名，常指与“Kreutzer”相关的作品，尤其是贝多芬的《克罗伊策奏鸣曲》。"},"examples":[{"en":"They listened to Beethoven’s Kreutzer Sonata in class.","zh":"他们在课上听了贝多芬的《克罗伊策奏鸣曲》。"},{"en":"The novel mentions the Kreutzer Sonata as a symbol of intense emotion.","zh":"那部小说提到《克罗伊策奏鸣曲》，把它当作强烈情感的象征。"}]}],"synonyms":["kreuzer","coin","small change"],"phonetic":"/ˈkrɔɪtsər/","extraExplanation":["“Kreutzer/kreuzer”源自德语，和“十字（Kreuz）”有关（早期硬币上常有十字图案）。拼写在英文里常见为 Kreutzer，也可见 Kreuzer。","“Kreutzer Sonata（克罗伊策奏鸣曲）”是贝多芬《第九小提琴奏鸣曲》。它后来也影响了文学：托尔斯泰有中篇小说《The Kreutzer Sonata（克罗伊策奏鸣曲）》借此探讨婚姻、欲望与嫉妒等主题。","读音上，-eu- 在德语里接近英文的“oy”音，所以常读作 /ˈkrɔɪtsər/。"]}
{"word":"kreutzers","summary":{"en":"“Kreutzers” means the plural of “kreutzer,” an old small coin used in parts of Central Europe.","zh":"“Kreutzers”是“kreutzer”的复数，指中欧部分地区曾使用的旧小面额硬币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of kreutzer: a small coin formerly used in Austria and some parts of Germany.","zh":"kreutzer 的复数：旧时在奥地利及德国部分地区使用的一种小面额硬币。"},"examples":[{"en":"He paid a few kreutzers for a piece of bread in the old story.","zh":"在那个老故事里，他用几枚 kreutzers 买了一块面包。"},{"en":"The museum displayed kreutzers from different centuries.","zh":"博物馆展出了不同时期的 kreutzers（旧币）。"}]}],"synonyms":["old coins","small change"],"phonetic":"/ˈkrɔɪtsərz/","extraExplanation":["“Kreutzer/Kreuzer”源自德语，历史上常指奥地利帝国等地区的小额货币单位；在英语文本里多用于历史叙述或文学作品的时代背景。","在文化语境中，“Kreutzer”还常让人联想到贝多芬《克鲁采小提琴奏鸣曲》（Kreutzer Sonata），以及托尔斯泰的中篇小说《克鲁采奏鸣曲》；这些作品里出现的“kreutzer”更多是标题与典故联想，而不是“硬币”本义。"]}
{"word":"Kreuzer","summary":{"en":"a historical small-value coin; also (in German use) a cruiser warship","zh":"旧时小面额硬币；也可指（德语用法中的）巡洋舰"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small coin formerly used in parts of Central Europe (especially in the Austrian Empire), worth a very small amount of money","zh":"（旧时）中欧部分地区使用的小面额硬币，尤指奥地利帝国时期的“克劳泽/十字币”，面值很小"},"examples":[{"en":"In the novel, he couldn’t even spare a single Kreuzer for bread.","zh":"在小说里，他连一个克劳泽买面包都掏不出来。"},{"en":"Collectors sometimes display Austrian Kreuzer coins by year and mint.","zh":"收藏者有时会按年份和铸币厂展示奥地利的克劳泽硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"(from German) a cruiser; a warship designed for speed and long-range missions","zh":"（源自德语）巡洋舰；一种强调速度与远航能力的军舰"},"examples":[{"en":"In some historical texts, the term Kreuzer is used where English would say “cruiser.”","zh":"在一些历史文献中，会用“Kreuzer”来指英语里的“cruiser（巡洋舰）”。"},{"en":"The Kreuzer patrolled the sea lanes to protect merchant ships.","zh":"这艘巡洋舰巡逻海上航线以保护商船。"}]}],"synonyms":["penny","small change","coin","cruiser","warship"],"phonetic":"/ˈkrɔɪtsɚ/","extraExplanation":["在英语里，Kreuzer 多出现在历史、文学或钱币收藏语境，通常指奥地利等地旧币；现代日常英语很少用它。读到时可以把它理解为“很小的钱/零钱”或具体的旧币单位。"],"etymology":"来自德语 Kreuzer。货币义与 Kreuz（“十字”）有关：早期某些硬币上带有十字图案，因此得名；后来成为奥地利等地的小面额货币名称。军舰义为德语中对“巡洋舰”的称呼，源自 kreuzen（“巡航、穿行”）等相关词。","mnemonic":["记忆“硬币义”：Kreuz≈cross（十字），Kreuzer=“带十字的硬币”。","记忆“军舰义”：想成“cross（穿行）海面巡航”的船→cruiser。"]}
{"word":"kreuzer","summary":{"en":"Kreuzer is a German word most often referring to a historical small coin, and sometimes used to mean a (German) cruiser warship in naval contexts.","zh":"Kreuzer 是德语词，最常指一种历史上的小面额硬币；在海军史语境中也可指（德国的）巡洋舰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A small coin used in parts of Central Europe (especially Austria and southern Germany), worth a minor unit of currency.","zh":"（历史）中欧部分地区（尤指奥地利与德国南部）曾使用的一种小面额硬币，相当于货币的辅币单位。"},"examples":[{"en":"He paid a few kreuzers for a piece of bread.","zh":"他用几枚克罗伊策买了一块面包。"},{"en":"The museum displayed old Austrian coins, including the kreuzer.","zh":"博物馆展出了旧奥地利硬币，其中就有克罗伊策。"}]},{"partOfSpeech":"n.","definition":{"en":"(military, German term) A cruiser (a type of warship) in German contexts, especially when talking about German naval history.","zh":"（军事，德语用语）“巡洋舰”；多用于讨论德国海军史或德语语境中的军舰类别。"},"examples":[{"en":"The report mentions several German Kreuzer operating in the Atlantic.","zh":"报告提到有几艘德国巡洋舰在大西洋活动。"},{"en":"In German sources, the ship is labeled as a Kreuzer.","zh":"在德文资料中，这艘船被标注为“巡洋舰（Kreuzer）”。"}]}],"synonyms":["(coin) penny (approx.)","(coin) small change","(ship) cruiser"],"phonetic":"/ˈkrɔɪtsɚ/","extraExplanation":["“Kreuzer”是德语词，字面与“cross（十字）”有关，早期钱币上常带十字图案，因此得名。","作为货币单位时，常见于旧奥地利体系（如“Gulden and Kreuzer”），在现代已基本退出流通，只在历史、收藏、文学语境中出现。","作为军舰类别时，它相当于英语“cruiser”。英语文章有时会保留德语写法“Kreuzer”，以强调德国原始分类或史料出处。"]}
{"word":"kreuzers","summary":{"en":"Kreuzers are small historical coins (plural of kreuzer) once used in Central Europe.","zh":"Kreuzers 指中欧历史上使用的小额硬币（kreuzer 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of kreuzer: a small coin and monetary unit used historically in parts of Central Europe (especially the Austrian Empire and some German states).","zh":"kreuzer 的复数形式：中欧部分地区（尤指奥地利帝国及一些德意志邦国）历史上使用的一种小额硬币/货币单位。"},"examples":[{"en":"He paid a few kreuzers for bread at the market.","zh":"他在集市上用几枚 kreuzers 买了面包。"},{"en":"In older stories, a poor student might have only a handful of kreuzers.","zh":"在一些旧故事里，穷学生可能只有一小把 kreuzers。"}]}],"synonyms":["small coins","cents (approx., in meaning)","pennies (approx., in meaning)"],"phonetic":"/ˈkrɔɪtsərz/","extraExplanation":["“Kreuzer”源自德语，和“cross（十字）”有关：早期硬币上常有十字图案，因此得名。","在奥地利帝国体系里，kreuzer 常被当作“小钱”的象征，类似英语里用“a few cents（几分钱）”来表达金额很少。","你可能在文学作品或历史背景的英文译本里见到它，比如描写19世纪中欧生活的小说、回忆录或历史研究。"]}
{"word":"kri","summary":{"en":"KRI most commonly means “Key Risk Indicator,” a metric used to monitor and warn about rising risk.","zh":"KRI最常见指“关键风险指标”，用于监测并预警风险上升的度量指标。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(business, finance) Abbreviation for “Key Risk Indicator”: a measurable sign used to monitor and warn about increasing risk in a process, project, or organization.","zh":"（商业/金融）“Key Risk Indicator”的缩写：关键风险指标，用来监测并预警流程、项目或组织中风险上升的可量化信号。"},"examples":[{"en":"Our compliance team tracks KRIs to spot problems before they become incidents.","zh":"我们的合规团队会跟踪KRI，以便在问题变成事件之前提前发现。"},{"en":"A rising customer-complaint rate can be a KRI for product quality risk.","zh":"客户投诉率上升可能是产品质量风险的一个KRI。"},{"en":"They set a threshold for each KRI and send an alert when it’s exceeded.","zh":"他们为每个KRI设定阈值，超过就会发出警报。"}]}],"synonyms":["risk metric","risk indicator","early-warning indicator"],"phonetic":"/ˌkeɪ ɑr ˈaɪ/","extraExplanation":["KRI通常用于风险管理体系里，常与KPI（Key Performance Indicator，关键绩效指标）对比：KPI看“表现好不好”，KRI看“风险高不高”。","在正式写作中一般写作大写“KRI”，读作逐字母“K-R-I”。","常见搭配：KRI threshold（KRI阈值）、KRI dashboard（KRI看板/仪表盘）、leading KRI（领先/前瞻性KRI，用于早期预警）。"]}
{"word":"kriegspiel","summary":{"en":"Kriegspiel refers either to a military war‑game simulation or to a chess variant played with hidden information and an umpire.","zh":"Kriegspiel既可指军事兵棋/战争推演，也可指需裁判、信息隐藏的国际象棋变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a war game originally developed in 19th‑century Prussia to train military officers, using maps, pieces, and rules to simulate battles","zh":"（源自19世纪普鲁士的）军事兵棋/战争模拟，用地图与规则来演练战斗、训练军官"},"examples":[{"en":"The academy used kriegspiel exercises to teach strategy and decision‑making.","zh":"军校用克里格斯皮尔（兵棋）演练来教授战略与决策。"},{"en":"Historians often describe early kriegspiel as a turning point in modern military training.","zh":"历史学者常把早期的克里格斯皮尔视为现代军事训练的转折点。"}]},{"partOfSpeech":"n.","definition":{"en":"a chess variant in which players cannot see the opponent’s pieces and must rely on an umpire to confirm legal moves and results","zh":"“盲棋裁判制”的国际象棋变体：看不到对手棋子，由裁判告知走法是否可行及结果"},"examples":[{"en":"They played kriegspiel chess, asking the umpire whether each move was legal.","zh":"他们下克里格斯皮尔象棋，每一步都要问裁判是否合规。"},{"en":"In kriegspiel, uncertainty forces you to plan with incomplete information.","zh":"在克里格斯皮尔中，不确定性迫使你在信息不完整的情况下制定计划。"}]}],"synonyms":["wargame","war game","military simulation","map exercise"],"phonetic":"/ˈkriːɡʃpiːl/","extraExplanation":["“Kriegspiel”是德语词，直译为“战争游戏”（Krieg=战争，Spiel=游戏）。英语里常写作Kriegsspiel或kriegspiel，语境不同指两类：一类是军事训练用的兵棋推演；另一类是国际象棋的“信息不完全”变体，通常需要裁判在旁。","在英语写作中，它多出现在军事史、战略研究或棋类文化的文章里，属于比较书面、专业的外来词。"]}
{"word":"krieker","summary":{"en":"“Krieker” is not standard English; it’s usually a misspelling of “creaker” or a proper name (surname/username).","zh":"“krieker”不是标准英语词；多半是把“creaker”拼错，或是专有名词（姓氏/网名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling of “creaker” (something that creaks) or as a surname/username.","zh":"不是标准英语单词。最常见的情况是把 “creaker”（会发出吱呀声的东西/发出吱呀声的人或物）拼错，或作为姓氏/网名出现。"},"examples":[{"en":"I couldn’t find “krieker” in an English dictionary—did you mean “creaker” or a person’s name?","zh":"我在英语词典里找不到 “krieker”——你是不是想写 “creaker”，或者是某个人名？"},{"en":"The old door is a real creaker.","zh":"那扇旧门真是个“吱呀作响的家伙”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper name) A family name or screen name; its meaning depends on the person or the original language (often confused with the German surname “Krieger”).","zh":"（专有名词）姓氏或网名；具体含义取决于本人或来源语言（常与德语姓氏 “Krieger” 混淆）。"},"examples":[{"en":"Krieker is my online handle, not an English word.","zh":"Krieker 是我的网名，不是一个英语单词。"},{"en":"I saw the name Krieker in the credits.","zh":"我在演职员表里看到了 Krieker 这个名字。"}]}],"synonyms":["creaker","name","surname","username"],"phonetic":"/ˈkriːkər/","extraExplanation":["“krieker”本身在英语里不常见，所以学习时更推荐你确认语境：\n1）如果你想表达“吱呀作响的东西”，常见拼法是 creaker（来自动词 creak）。\n2）如果你是在游戏、电影字幕、社交媒体看到的，它更可能是用户名/姓氏。\n3）如果你本来想写德语姓氏 Krieger（常见含义与“战士”有关），拼写和发音会不同。"]}
{"word":"krigia","summary":{"en":"Krigia is a botanical genus of small, dandelion-like wildflowers in the daisy family.","zh":"Krigia 是一个植物属名，指菊科中外形像蒲公英的一类小型野花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of wild flowering plants in the daisy family (Asteraceae), often called dwarf dandelions; found especially in North America","zh":"一种菊科（Asteraceae）的野生开花植物属，常被称为“矮蒲公英”（dwarf dandelions）；主要分布于北美"},"examples":[{"en":"Krigia flowers look small but resemble dandelions with their yellow heads.","zh":"Krigia 的花虽小，但黄色花头看起来很像蒲公英。"},{"en":"The field guide lists Krigia as a common spring wildflower in parts of the eastern U.S.","zh":"野外植物图鉴把 Krigia 记为美国东部一些地区常见的春季野花。"}]}],"synonyms":["dwarf dandelion (common name)","false dandelion (common name)"],"phonetic":"/ˈkrɪdʒiə/","extraExplanation":["Krigia 通常作为植物学里的“属名”（genus name）使用，写作首字母大写（Krigia）。若指某个具体物种，会用双名法，例如 Krigia virginica（属名 + 种加词）。","它的常见俗名有时会包含“dwarf dandelion（矮蒲公英）”“false dandelion（假蒲公英）”，用于强调外形相似，但并不等同于真正的蒲公英（Taraxacum）。"]}
{"word":"krikorian","summary":{"en":"Krikorian is a (often Armenian) family name used as a surname.","zh":"Krikorian 是一个（常见于亚美尼亚裔的）姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname, often Armenian in origin (a family name).","zh":"一个姓氏（家族姓），常见于亚美尼亚裔人群。"},"examples":[{"en":"Ms. Krikorian will lead the meeting today.","zh":"Krikorian 女士今天将主持会议。"},{"en":"I emailed Professor Krikorian about the assignment.","zh":"我给 Krikorian 教授发邮件询问作业。"}]}],"synonyms":["(no true synonyms; proper name)"],"phonetic":"/krɪˈkɔriən/","extraExplanation":["“Krikorian”常被认为是亚美尼亚姓氏，通常与名字“Krikor”（相当于英语名 Gregory“格里高利”）有关，带有“某某的后代/家族”的含义。不同家族与地区也可能出现拼写变体（如 Krikoryan、Krikorjan 等）。","在英语语境中它主要作为专有名词使用：需要大写，通常不加冠词（不说 a Krikorian），但可用复数指“一家人”（the Krikorians = Krikorian 一家）。"]}
{"word":"krill","summary":{"en":"Krill are tiny shrimp-like sea animals that form large swarms and are a major food source in ocean ecosystems.","zh":"磷虾是体型很小、类似小虾的海洋动物，常成群出现，是海洋生态系统中重要的食物来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"tiny shrimp-like sea animals that live in large groups and are a key food source for whales, seals, penguins, and many fish","zh":"磷虾；一种类似小虾的海洋小型甲壳动物，常成群生活，是鲸、海豹、企鹅和许多鱼类的重要食物来源"},"examples":[{"en":"Whales often feed on huge swarms of krill.","zh":"鲸常常以大量成群的磷虾为食。"},{"en":"In the Antarctic Ocean, krill are essential to the entire food chain.","zh":"在南极海域，磷虾对整个食物链都至关重要。"}]}],"synonyms":["zooplankton (broader term)","planktonic crustaceans (more technical)"],"phonetic":"/krɪl/","extraExplanation":["“Krill”常被当作不可数名词来谈论整体（例如：Krill is an important food source.），但也可以用复数“krills”表示不同种类或不同群体（较少见）。","磷虾在英语科普与环保话题里很常见，因为它们处在食物网底层，却支撑了许多大型海洋动物；因此常出现在关于海洋生态、气候与渔业管理的讨论中。"]}
{"word":"krills","summary":{"en":"Krills are small shrimp-like sea animals (plural of krill), eaten by many larger animals such as whales and penguins.","zh":"Krills 是 krill 的复数，指磷虾等小型、似虾的海洋动物，是鲸和企鹅等许多大型动物的重要食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of krill: very small, shrimp-like sea animals that are a major food source for many ocean animals (especially whales, seals, and penguins).","zh":"krill 的复数：磷虾，体型很小、类似虾的海洋动物，是许多海洋动物（尤其是鲸、海豹、企鹅等）的重要食物来源。"},"examples":[{"en":"Many whales migrate to Antarctica to feed on krills.","zh":"许多鲸会迁徙到南极去捕食磷虾。"},{"en":"Penguins depend on krills when fish are scarce.","zh":"当鱼类稀少时，企鹅会依赖磷虾为食。"},{"en":"Scientists study krills to understand changes in the ocean ecosystem.","zh":"科学家研究磷虾，以了解海洋生态系统的变化。"}]}],"synonyms":["krill"],"phonetic":"/krɪl/","extraExplanation":["“Krill”在英文里既可以指单数也可以指复数（不加 -s 也常见），但“krills”作为复数形式也正确，尤其在强调“不同群体/种类的磷虾”或在某些写作风格中会出现。","磷虾在南大洋（南极附近）特别重要，常被称为海洋食物链的“关键物种”；因此在环境保护与渔业管理的讨论中，这个词也很常见。"]}
{"word":"krimmer","summary":{"en":"“Krimmer” is most commonly a proper noun, especially a surname (last name).","zh":"“Krimmer”最常见是专有名词，尤其用作姓氏（英文里的 last name）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), used as a person’s last name.","zh":"姓氏（家族姓），用作人的英文姓/最后一个名字。"},"examples":[{"en":"Dr. Krimmer will speak at the conference tomorrow.","zh":"Krimmer 医生明天将在会议上发言。"},{"en":"My teacher’s last name is Krimmer.","zh":"我老师的姓是 Krimmer。"}]}],"phonetic":"/ˈkrɪmər/","extraExplanation":["“Krimmer”在英语里通常不是常见词汇，而是专有名词（多见于姓氏、品牌名或地名拼写）。","它也可能是其他语言姓氏的英语拼写形式（例如德语姓氏的变体），在英文文本中一般保留原拼写并首字母大写：Krimmer。","如果你是在某本书/游戏/影片里看到的“Krimmer”，也可能是角色名或地名；给我一句原句/出处我可以帮你判断具体含义与语气。"]}
{"word":"krimmers","summary":{"en":"“Krimmers” is most commonly a plural surname (the Krimmer family). It can also appear as a rare misspelling of slang “crimmers” (= criminals).","zh":"“Krimmers”最常见是复数姓氏（Krimmer 一家/多人）。也可能是把俚语“crimmers”（罪犯）拼错的少见写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural family name (surname): people whose last name is Krimmer.","zh":"姓氏 Krimmer 的复数：指姓 Krimmer 的一家人或多位姓 Krimmer 的人。"},"examples":[{"en":"The Krimmers moved to Chicago last year.","zh":"Krimmer 一家去年搬到了芝加哥。"},{"en":"I met two Krimmers at the conference.","zh":"我在会议上遇到了两位姓 Krimmer 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) Sometimes seen as a misspelling of informal “crimmers,” meaning “criminals.”","zh":"（非标准/少见）有时被当作拼写错误，用来指口语 “crimmers”（罪犯、犯罪分子）。"},"examples":[{"en":"If you meant “crimmers,” it’s informal slang for criminals.","zh":"如果你想写的是 “crimmers”，那是指“罪犯”的非正式俚语。"}]}],"synonyms":["(surname) the Krimmer family","(if meaning criminals) criminals","lawbreakers"],"phonetic":"/ˈkrɪmərz/","extraExplanation":["“Krimmers”在英语里不算常见的普通词，更常见的是专有名词（姓氏），通常需要大写：Krimmers。","如果你是在歌词、小说或聊天里看到的，可能是人名/网名；也可能是把“crimmers（criminals 的俚语）”拼错了。你可以告诉我它出现的句子，我可以帮你更准确判断。"]}
{"word":"krina","summary":{"en":"“Krina” is not a common English vocabulary word; it’s usually a name or a misspelling of another word.","zh":"“Krina” 不是常见英语词汇；通常是人名或其他词的拼写误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly seen as a personal name (a proper noun). If you meant a different word, it may be a misspelling (for example, “crane,” “kinda,” or a name like “Karina”).","zh":"不是标准英语单词；最常见用法是人名（专有名词）。如果你想查的是别的词，可能是拼写错误（例如“crane（鹤/起重机）”“kinda（有点/算是）”或人名“Karina”）。"},"examples":[{"en":"Krina is a student in my class.","zh":"Krina 是我班上的一名学生。"},{"en":"I can’t find “krina” in an English dictionary—did you mean “Karina”?","zh":"我在英语词典里找不到 “krina”——你是不是想写 “Karina”？"}]}],"phonetic":"/ˈkriːnə/","extraExplanation":["“Krina” 更可能是名字或来自其他语言的拼写。为了帮你准确解释，你可以告诉我：你在哪个句子/场景里看到它？或者你想表达的中文意思是什么？我也可以根据你的上下文帮你判断是不是想写：kinda / crane / Karina 等。"]}
{"word":"krinein","summary":{"en":"krinein is an Ancient Greek verb meaning “to judge/decide,” and by extension “to distinguish.” It is the root behind words like critic and criterion.","zh":"krinein 是古希腊语动词，核心意思是“判断/裁决/作决定”，引申为“区分/辨别”。它也是 critic、criterion 等英语词的词源。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Ancient Greek, transliterated) to judge; to decide after considering evidence.","zh":"（古希腊语音译）判断；裁决；在权衡证据后作出决定。"},"examples":[{"en":"In Greek philosophy, krinein means “to judge” or “to decide,” not just to criticize.","zh":"在希腊哲学语境中，krinein 的意思是“判断/裁决”或“作出决定”，不只是“批评”。"},{"en":"A good researcher must krinein between strong and weak evidence.","zh":"优秀的研究者必须在强证据与弱证据之间作出判断。"}]},{"partOfSpeech":"v.","definition":{"en":"to separate, distinguish, or discriminate between things (often by making a judgment).","zh":"区分；辨别；分开（通常通过判断来进行）。"},"examples":[{"en":"The task is to krinein truth from rumor.","zh":"这项任务是把真相与谣言区分开来。"},{"en":"In court, the judge is expected to krinein fairly.","zh":"在法庭上，人们期望法官能公正裁断。"}]}],"synonyms":["judge","decide","discern","distinguish","evaluate"],"phonetic":"/kriˈneɪn/","extraExplanation":["krinein（κρίνειν）是一个非常重要的词根来源：英语里的 critic（批评家）、criticize（批评）、critical（批判的/关键的）、criterion（标准，复数 criteria）都与它同源。核心概念并不是“挑毛病”，而是“分辨—判断—作决定”。","在古典语境里，它常与“法律裁决”“理性分辨”“做出选择”相关；因此在学术写作中谈到 critical thinking（批判性思维）时，更强调“基于证据的判断能力”。"]}
{"word":"kriophoros","summary":{"en":"Kriophoros means “ram-bearer,” referring to a figure/statue (often Hermes) carrying a ram in ancient Greek religious and artistic contexts.","zh":"Kriophoros 意为“背羊者”，指古希腊宗教与艺术中（常与赫尔墨斯相关）肩扛公羊的人物形象或雕像。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Greek art and religion) a figure or statue of a person carrying a ram, often as a sacrificial offering; “the ram-bearer.”","zh":"（古希腊艺术与宗教中）背负公羊的人物形象或雕像，常象征献祭供品；意为“背羊者／负羊者”。"},"examples":[{"en":"The museum label identified the statue as a kriophoros, a ram-bearer linked to sacrifice.","zh":"博物馆的说明牌将这尊雕像标注为 kriophoros（背羊者），与献祭传统有关。"},{"en":"In classical sculpture, a kriophoros often represents a ritual moment rather than everyday herding.","zh":"在古典雕塑中，kriophoros 往往表现的是仪式场景，而不是日常放牧。"}]},{"partOfSpeech":"n.","definition":{"en":"A title or epithet (especially of the god Hermes) meaning “ram-bearer.”","zh":"（尤指赫尔墨斯的）称号或尊称，意为“背羊者”。"},"examples":[{"en":"Some texts refer to Hermes as Kriophoros, emphasizing his role in protecting the community.","zh":"有些文本称赫尔墨斯为 Kriophoros，强调他守护城邦的角色。"},{"en":"The historian explained that “Kriophoros” is an epithet, not a separate deity.","zh":"历史学者解释说，“Kriophoros”是尊称，并非另一位独立神祇。"}]}],"synonyms":["ram-bearer","Hermes Kriophoros"],"phonetic":"/ˌkriːoʊˈfɔːrəs/","extraExplanation":["该词源自希腊语：krios（公羊）+ phoros（携带者、负载者），字面义就是“背着公羊的人”。","艺术史中很常见的例子是“赫尔墨斯·Kriophoros（背羊者赫尔墨斯）”的形象：他肩扛公羊，象征献祭、净化或对城邦的保护。","在英语里它属于比较学术/博物馆语境的外来词，日常对话更常用 ram-bearer（背羊者）来解释。"]}
{"word":"Krios","summary":{"en":"a Titan in Greek mythology; also spelled “Crius.”","zh":"希腊神话中的一位泰坦，亦拼作“Crius”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Greek mythology) A Titan associated with the constellation Aries; also spelled “Crius.”","zh":"（希腊神话）泰坦之一，常与白羊座（Aries）相关；亦作“Crius”。"},"examples":[{"en":"In some retellings of Greek myth, Krios is listed among the Titans who came before the Olympian gods.","zh":"在一些希腊神话的复述中，Krios 被列为奥林匹斯诸神之前的泰坦之一。"},{"en":"You may see the name written as “Crius” in older English translations.","zh":"在较旧的英文译本里，你可能会看到这个名字写作“Crius”。"}]}],"synonyms":["Crius"],"phonetic":"/ˈkriːoʊs/","extraExplanation":["这是专有名词（神名），不同版本的神话与家谱细节可能略有差异；学习时可把它当作“泰坦姓名 + 与公羊/白羊座的联想”来记。"],"etymology":"源自古希腊语 Κριός（Kriós），常被解释为“公羊（ram）”，因此与白羊座的联想较常见；英语中也有拉丁化/异拼形式 “Crius”。","mnemonic":["把 Krios 记成“k + r(i)os”，联想到希腊语里常与“公羊/白羊座”有关：Krios ≈ Aries（白羊座）。","看到异拼 “Crius” 时不要慌：两者指同一位泰坦，可当作同名的两种英文写法。"]}
{"word":"Kris","summary":{"en":"a personal name; also a traditional Southeast Asian dagger","zh":"人名；也指东南亚传统匕首/短剑"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name, often a spelling variant of Chris (from Christopher or Christine)","zh":"人名：常见英文名，常作 Chris 的变体（源自 Christopher 或 Christine）"},"examples":[{"en":"Kris said he would call after work.","zh":"Kris 说他下班后会打电话。"},{"en":"Her name is Kris, spelled with a K.","zh":"她叫 Kris，用 K 开头拼。"}]},{"partOfSpeech":"n.","definition":{"en":"a Southeast Asian dagger (more commonly spelled keris), often with a wavy blade","zh":"（东南亚）一种匕首/短剑（更常拼作 keris），刀刃常呈波浪形"},"examples":[{"en":"The museum displayed a kris with an intricately carved handle.","zh":"博物馆展出了一把柄部雕刻精美的 kris。"},{"en":"In some traditions, a kris is treated as a family heirloom.","zh":"在一些传统中，kris 会被当作传家宝。"}]}],"synonyms":["Chris","keris","dagger"],"phonetic":"/krɪs/","extraExplanation":["人名 Kris 在英语语境里常用于男性或女性（更偏中性）。","“kris/keris”不只是武器，也常带有文化与仪式意义；英语里两种拼写都能见到，但学术或博物馆语境更常用 keris。"],"etymology":"作人名时，Kris 多被视为 Chris 的变体拼写；Chris 源自希腊语系的名字（如 Christopher/Christine）。作“匕首”义时来自马来语/爪哇语 keris（英语里也常写作 kris）。","mnemonic":["记人名：把它当成 Chris 的“换 K 拼法”，发音基本不变 /krɪs/。","记武器：kris/keris 听起来像“刻刃（kè rèn）”，联想到“刻着花纹的刀刃”。"]}
{"word":"kris","summary":{"en":"“Kris” most commonly refers to a Southeast Asian dagger (also spelled “keris”), and it can also be a personal name/nickname.","zh":"“Kris”最常指东南亚的传统匕首（也拼作“keris”），也可以是人名或昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Southeast Asian dagger, often with a wavy blade, especially from Indonesia and Malaysia; also spelled “keris.”","zh":"一种东南亚传统匕首（常见波浪形刀刃），尤指印度尼西亚、马来西亚一带；也可拼作“keris”。"},"examples":[{"en":"In the museum, we saw a kris with a beautifully carved handle.","zh":"在博物馆里，我们看到了一把刀柄雕刻精美的克力士匕首（kris）。"},{"en":"The kris is often displayed as a cultural symbol, not just a weapon.","zh":"克力士匕首常被当作文化象征来展示，不仅仅是武器。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name or nickname (often a variant of “Chris,” or short for names like “Kristen” or “Kristopher”).","zh":"人名或昵称（常作为“Chris”的变体，或是“Kristen / Kristopher”等名字的简称）。"},"examples":[{"en":"Kris said she would call after work.","zh":"Kris 说她下班后会打电话。"},{"en":"I met Kris at a school event last weekend.","zh":"我上周末在学校活动上认识了 Kris。"}]}],"synonyms":["keris"],"phonetic":"/krɪs/","extraExplanation":["“kris/keris”在英语里多指一种具有仪式与身份象征意义的传统匕首，常与爪哇、马来文化相关；许多刀刃呈波浪形，但也有直刃款式。","在文学或文化介绍类英文文章中，kris常被用来体现“传统、权威、家族传承、仪式感”等意象。"]}
{"word":"krises","summary":{"en":"“Crises” means more than one crisis—urgent, serious situations needing immediate action.","zh":"“crises”是“crisis”的复数，表示多个需要紧急处理的严重局势/危机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “crisis”: serious, dangerous, or difficult situations that require urgent action or decisions.","zh":"“crisis”的复数：危机；指严重、危险或艰难的局势，需要紧急处理或做出决定。"},"examples":[{"en":"The country is facing multiple crises, including inflation and unemployment.","zh":"这个国家正面临多重危机，包括通货膨胀和失业。"},{"en":"During crises, clear communication is essential.","zh":"在危机时期，清晰沟通至关重要。"},{"en":"Hospitals must be prepared for public health crises.","zh":"医院必须为公共卫生危机做好准备。"}]}],"synonyms":["emergencies","critical situations","disasters (often stronger)","turning points (more figurative)"],"phonetic":"/ˈkraɪsiːz/","extraExplanation":["“krises”通常被认为是拼写错误，标准拼写是“crises”。单数是“crisis”。","发音上，“crisis”的复数“crises”读音变化明显：crisis /ˈkraɪsɪs/，crises /ˈkraɪsiːz/。","“crisis”源自希腊语，原意与“决定、转折点”有关，所以常指事情到了必须做出关键决定的关头。"]}
{"word":"Krishna","summary":{"en":"A Hindu deity; also a personal name.","zh":"印度教神祇名；也作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major Hindu deity, often understood as an avatar of Vishnu and a central figure in the Mahabharata and the Bhagavad Gita.","zh":"印度教重要神祇之一，常被视为毗湿奴的化身；也是《摩诃婆罗多》与《薄伽梵歌》中的核心人物。"},"examples":[{"en":"In the Bhagavad Gita, Krishna teaches Arjuna about duty and devotion.","zh":"在《薄伽梵歌》中，Krishna 教导 Arjuna 关于责任与虔敬。"},{"en":"Many festivals celebrate Krishna’s life stories, especially his childhood.","zh":"许多节日会庆祝 Krishna 的生平故事，尤其是他童年的传说。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name used in India and elsewhere, especially among people with Hindu cultural backgrounds.","zh":"人名（名），在印度及其他地区常见，尤其见于具有印度教文化背景的人群。"},"examples":[{"en":"Krishna is my colleague’s first name.","zh":"Krishna 是我同事的名字。"},{"en":"She named her son Krishna to honor her family tradition.","zh":"她给儿子取名 Krishna，以纪念家族传统。"}]}],"synonyms":["Kṛṣṇa","Lord Krishna","Shri Krishna"],"phonetic":"/ˈkrɪʃnə/","extraExplanation":["在英语语境中，Krishna 常指“克里希纳信仰/奎师那崇拜”相关传统（如 ISKCON，俗称 Hare Krishna 运动）。在文学与宗教研究中也常见其作为《薄伽梵歌》中的导师与神性形象出现。"],"etymology":"源自梵语 Kṛṣṇa（कृष्ण），原义与“黑、深色、深蓝”相关；作为神名与人名长期使用，并随印度宗教与文化传播进入英语。","mnemonic":["可联想中文译名“奎师那/克里希纳”：发音接近“KRISH-na”，重音在前（KRISH）。","记义提示：梵语词源与“深色”有关，可联想到常见的“深蓝/黑色神像形象”。"]}
{"word":"krishna","summary":{"en":"Krishna is a Hindu deity (often seen as an avatar of Vishnu) and also a common given name, especially in India.","zh":"Krishna 指印度教神祇（常被视为毗湿奴的化身），也可作常见人名，尤其在印度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Krishna: a major deity in Hinduism, commonly worshiped as an avatar (incarnation) of Vishnu and known in many stories for wisdom, compassion, and playfulness.","zh":"克里希纳（Krishna）：印度教的重要神祇，常被崇拜为毗湿奴（Vishnu）的化身，以智慧、慈悲与富有生命力的形象闻名，出现在许多经典故事中。"},"examples":[{"en":"In the Bhagavad Gita, Krishna teaches Arjuna about duty and devotion.","zh":"在《薄伽梵歌》中，克里希纳向阿周那讲解责任与虔 devotion（奉爱/信爱）之道。"},{"en":"Many temples hold festivals in honor of Krishna.","zh":"许多寺庙会举办庆典来纪念克里希纳。"}]},{"partOfSpeech":"n.","definition":{"en":"Krishna: a given name used especially in India and in communities influenced by Hindu culture.","zh":"Krishna：人名（名字），常见于印度及受印度教文化影响的社群中。"},"examples":[{"en":"Krishna is my classmate from Mumbai.","zh":"Krishna 是我来自孟买的同学。"},{"en":"She named her son Krishna after the deity.","zh":"她以这位神祇之名给儿子取名为 Krishna。"}]}],"synonyms":["Kṛṣṇa","Lord Krishna"],"phonetic":"/ˈkrɪʃnə/","extraExplanation":["“Krishna”常见梵文转写为“Kṛṣṇa”，中文也常译作“奎师那/克里希纳”。英语里通常读作两音节（KRISH-nuh）。","克里希纳在印度史诗与经典中很重要：如《摩诃婆罗多》中的《薄伽梵歌》章节；民间故事里也常出现他作为牧童、吹笛者等形象。"]}
{"word":"Krishna-centered","summary":{"en":"Devotion- or theme-focused on Krishna as the central figure.","zh":"以克里希纳为核心的（信仰/实践/主题）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Focused on devotion to Krishna or making Krishna the main theme in belief, practice, community life, or art.","zh":"以克里希纳（Krishna）的信仰与奉献为核心；把克里希纳作为思想、修行、社群生活或艺术主题的中心。"},"examples":[{"en":"The temple offers Krishna-centered worship services every evening.","zh":"这座寺庙每晚都举行以克里希纳为核心的礼拜仪式。"},{"en":"She prefers Krishna-centered music and chants during meditation.","zh":"她冥想时更喜欢以克里希纳为核心的音乐与诵唱。"},{"en":"Their festival is Krishna-centered, highlighting stories from his life.","zh":"他们的节庆以克里希纳为核心，重点呈现他生平的故事。"}]}],"synonyms":["Krishna-focused","Krishna-centric","Krishna-oriented","Krishna-devotional"],"phonetic":"/ˈkrɪʃnə ˈsɛn.tɚd/","extraExplanation":["Krishna（克里希纳）是印度教重要神祇之一，常被视为毗湿奴（Vishnu）的化身；在“克里希纳信仰”（Krishna devotion / Krishna bhakti）传统中，人们通过唱诵（chanting）、敬拜（worship）、讲述故事与节庆来表达奉爱（bhakti）。","写法上常用连字符：Krishna-centered，表示“以Krishna为中心的”。在学术写作或宗教社群介绍中较常见。"],"etymology":"由专名“Krishna（克里希纳）”+ “centered（以……为中心的）”构成的复合形容词；常见于宗教与文化语境，用来说明某种实践或传统把克里希纳置于核心位置。","mnemonic":["把它拆开记：Krishna + centered＝“以克里希纳为中心”。看到 centered 就联想到“中心/核心”。","联想中文“以……为核心”：Krishna-centered≈“克里希纳本位/核心导向”。"]}
{"word":"Krishna-related","summary":{"en":"connected with Krishna or traditions centered on him","zh":"与克里希那及其相关传统/文化有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with Krishna (a major deity in Hinduism), or with stories, worship, festivals, art, music, or traditions centered on him.","zh":"与克里希那（印度教重要神祇）有关的；指围绕他的传说、崇拜、节庆、艺术、音乐或传统。"},"examples":[{"en":"The museum has a small gallery of Krishna-related paintings from Rajasthan.","zh":"博物馆有一个小展厅，展出来自拉贾斯坦邦的一些与克里希那有关的绘画。"},{"en":"She is researching Krishna-related songs sung during Janmashtami.","zh":"她在研究主显节（Janmashtami）期间演唱的与克里希那有关的歌曲。"},{"en":"The lecture covered Krishna-related themes in the Bhagavata Purana.","zh":"讲座讨论了《薄伽梵往世书》中与克里希那相关的主题。"}]}],"synonyms":["associated with Krishna","connected with Krishna","Krishna-centric","Krishna-based","Krishnaitic"],"phonetic":"/ˈkrɪʃnə rɪˈleɪtɪd/","extraExplanation":["写法提示：常见为连字符形式“Krishna-related”，也可见“Krishna related”（较松散）或“Krishna-related traditions/art/literature”等搭配。","语境提示：在跨文化写作中，使用此词通常较中性、学术；若写给大众读者，可改用更具体表达，如“stories about Krishna（关于克里希那的故事）”“Krishna worship（克里希那崇拜）”。"],"etymology":"“Krishna-related”是由专名“Krishna（克里希那）”+ “related（相关的）”组合而成的复合形容词；常用于学术写作、新闻与说明性文字中，表示“与某主题/人物相关”。","mnemonic":["把它拆开记：Krishna（人名/神名）+ related（相关的）= “跟克里希那有关的”。看到连字符就想到“打包成一个形容词”。","联想：related ≈ “有关系的”。中文直译就是“克里希那相关”。"]}
{"word":"krishnaism","summary":{"en":"Krishnaism: a Hindu devotional tradition centered on worship of Krishna.","zh":"Krishnaism：以崇拜克里希纳为中心的印度教奉爱传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tradition within Hinduism that focuses on devotion to Krishna (seen as a form of Vishnu or as the Supreme God), emphasizing worship (bhakti), sacred texts, and devotional practices such as chanting.","zh":"印度教中的一种传统，核心是对克里希纳（Krishna）的虔敬崇拜（常被视为毗湿奴的化身或至高神），强调“奉爱”（bhakti）、经典学习与念诵等修行。"},"examples":[{"en":"Krishnaism is especially associated with devotional singing and the chanting of Krishna’s names.","zh":"克里希纳教常与虔敬歌唱和念诵克里希纳的圣名联系在一起。"},{"en":"Some scholars describe Gaudiya Vaishnavism as a major form of Krishnaism.","zh":"一些学者把高迪亚毗湿奴派（Gaudiya Vaishnavism）描述为克里希纳教的重要形态。"}]}],"synonyms":["Krishna worship","Krishna devotion","(a form of) Vaishnavism","Gaudiya Vaishnavism (related)"],"phonetic":"/ˈkrɪʃnəˌɪzəm/","extraExplanation":["“Krishnaism”是学术或说明性语境中常见的称呼，日常交流里人们更常说“Vaishnavism（毗湿奴派）”或直接指具体宗派（如Gaudiya Vaishnavism）。","它与“bhakti（奉爱/虔敬）传统”密切相关，常见实践包括kirtan（唱诵）、japa（默念念珠）、节庆与供奉等。","现代世界中，ISKCON（International Society for Krishna Consciousness，常译“国际克里希纳意识协会”）让许多人在英语语境里接触到与Krishna相关的奉爱传统。"]}
{"word":"krishnaist","summary":{"en":"A Krishnaist is a devotee of Krishna; it can also describe Krishna-centered religious traditions.","zh":"Krishnaist 指克里希纳（奎师那）的信徒，也可作形容词表示与克里希纳崇拜相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower or devotee of Krishna (a major deity in Hinduism), especially someone who practices Krishna-centered forms of Hindu worship","zh":"克里希纳（Krishna）的信徒；崇拜克里希纳的印度教修行者（尤指以克里希纳为核心的宗派）"},"examples":[{"en":"She became a Krishnaist after studying the Bhagavad Gita.","zh":"她在研读《薄伽梵歌》后成为一名克里希纳信徒。"},{"en":"The Krishnaist community held a festival with singing and dancing.","zh":"克里希纳信徒的社群举办了一个有歌唱与舞蹈的节庆活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the worship of Krishna or to Krishna-centered traditions within Hinduism","zh":"与克里希纳崇拜有关的；属于以克里希纳为中心的印度教传统的"},"examples":[{"en":"They studied Krishnaist philosophy and devotional poetry.","zh":"他们学习克里希纳传统的哲学与奉爱诗歌。"},{"en":"The temple follows a Krishnaist devotional tradition.","zh":"这座寺庙遵循以克里希纳为中心的奉爱传统。"}]}],"synonyms":["Vaishnava","Hare Krishna devotee","Krishna devotee"],"phonetic":"/ˈkrɪʃnə.ɪst/","extraExplanation":["“Krishnaist”在英语里相对少见，更常见的相关词包括“Vaishnava（毗湿奴派信徒）”和“Hare Krishna devotee（哈瑞克里希纳/国际奎师那知觉协会相关的信徒）”。“Krishnaist”更泛指对克里希纳的崇拜者，不一定特指某个组织。","在文化语境中，克里希纳常被视为毗湿奴（Vishnu）的化身之一；许多克里希纳信仰传统强调“bhakti（奉爱/虔敬）”，常见实践包括诵唱圣名（kirtan）、节庆与敬拜仪式。"]}
{"word":"krishnaite","summary":{"en":"A Krishnaite is a follower of Krishna; it can also describe things related to Krishna worship.","zh":"Krishnaite 指奎师那的信徒，也可作形容词表示与奎师那崇拜相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a devotee or follower of Krishna, especially within Vaishnavism (and often associated with the modern Hare Krishna movement).","zh":"奎师那（Krishna）的信徒；尤指印度教毗湿奴派（Vaishnavism）中崇拜奎师那的人（常也指“哈瑞奎师那”运动的成员）。"},"examples":[{"en":"Several Krishnaites gathered to sing devotional songs in the temple.","zh":"一些奎师那信徒在寺庙里聚集，吟唱敬神的歌曲。"},{"en":"He met a group of Krishnaites distributing free vegetarian food.","zh":"他遇到一群奎师那信徒在发放免费的素食。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Krishna or to Krishna worship and its traditions.","zh":"与奎师那有关的；与崇拜奎师那及其传统相关的。"},"examples":[{"en":"The festival featured Krishnaite music and dance.","zh":"节庆活动展示了与奎师那传统相关的音乐与舞蹈。"},{"en":"She studies Krishnaite texts in a comparative religion class.","zh":"她在比较宗教学课程中研究奎师那相关的经典文本。"}]}],"synonyms":["Vaishnava","Hare Krishna devotee","Krishna devotee"],"phonetic":"/ˈkrɪʃnəˌaɪt/","extraExplanation":["“Krishnaite”来自“Krishna（奎师那）+ -ite（表示某一群体的成员/追随者）”。在英语里有时会专指国际奎师那知觉协会（ISKCON，常被称为“Hare Krishna movement”）的成员，但更宽泛也可指毗湿奴派中崇拜奎师那的信众。使用时通常是中性描述；在宗教语境中更常见、也更尊重的称呼还包括“Vaishnava（毗湿奴派信徒）”或“Hare Krishna devotee（哈瑞奎师那信徒）”。"]}
{"word":"krishnaitic","summary":{"en":"“Krishnaitic” means “related to Krishna or Krishna-centered Hindu worship and traditions.”","zh":"“Krishnaitic”意为“与克里希纳有关的，或以克里希纳为中心的印度教崇拜与传统”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Krishna, especially to the worship or traditions centered on Krishna in Hinduism.","zh":"与克里希纳（Krishna）有关的；尤指印度教中以克里希纳为中心的崇拜或传统。"},"examples":[{"en":"The museum has a small collection of Krishnaitic paintings showing scenes from Krishna’s life.","zh":"这家博物馆收藏了一小批与克里希纳相关的绘画，描绘他生平中的场景。"},{"en":"Some devotional songs in the region have strong Krishnaitic themes.","zh":"该地区的一些虔敬歌曲带有浓厚的克里希纳主题。"}]}],"synonyms":["Krishna-related","Krishna-centered","Vaishnava (context-dependent)"],"phonetic":"/ˌkrɪʃ.nəˈiː.tɪk/","extraExplanation":["“Krishnaitic”在现代英语中并不常见，更常见的表达是“Krishna-related / Krishna-centered / Vaishnava（毗湿奴派的）”。在学术或宗教研究语境里，它可用来概括与克里希纳信仰、神话故事、仪式与艺术相关的内容。","克里希纳是印度教中重要的神祇之一，常被视为毗湿奴（Vishnu）的化身。与他相关的经典与故事常见于《薄伽梵歌》（Bhagavad Gita）与《博伽梵往世书》（Bhagavata Purana）等文本；艺术中也常出现他吹笛、与牧女（gopis）共舞或童年事迹等主题。"]}
{"word":"krispies","summary":{"en":"“Krispies” most often refers to the Rice Krispies cereal brand; informally, it can mean crispy snacks or crunchy toppings.","zh":"“Krispies”最常指 Rice Krispies 麦片品牌；非正式用法中也可泛指酥脆零食或增加脆感的配料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually capitalized) A brand name used for a popular puffed-rice breakfast cereal, best known as “Rice Krispies.”","zh":"（通常大写）一种膨化米早餐麦片的品牌名，最常见于“Rice Krispies（米香脆麦片）”。"},"examples":[{"en":"I had Rice Krispies with milk for breakfast.","zh":"我早餐吃了 Rice Krispies 加牛奶。"},{"en":"The recipe says to add Krispies for crunch.","zh":"食谱说要加 Krispies 增加酥脆口感。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Crispy snacks or foods, especially when used as a playful nickname.","zh":"（非正式）指酥脆的零食或食物，常带俏皮的称呼意味。"},"examples":[{"en":"These chicken krispies are really crunchy.","zh":"这些炸鸡脆片真的很酥。"},{"en":"Do you want some krispies on top of the salad?","zh":"你想在沙拉上撒点脆脆的配料吗？"}]}],"synonyms":["Rice Krispies","crispy snacks","crunchy cereal"],"phonetic":"/ˈkrɪspiz/","extraExplanation":["“Krispies”常见于美国文化语境里，最典型是 Kellogg’s 的“Rice Krispies”。这个名字故意用 K 来营造品牌辨识度，也呼应“crisp（酥脆）”的口感。","在美国广告与流行文化中，Rice Krispies 经典口号是“Snap! Crackle! Pop!”（形容倒牛奶时的噼啪声），所以在食谱里也常被用作增加“crunch（脆感）”的配料。"]}
{"word":"kriss","summary":{"en":"A kriss is a traditional Southeast Asian dagger, often wavy-bladed and culturally significant.","zh":"kriss 是东南亚传统匕首/短剑，常见波浪形刀身并具有文化意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Southeast Asian dagger (especially from Indonesia and Malaysia), often with a wavy blade and cultural or ceremonial importance","zh":"（尤指印尼、马来西亚的）传统东南亚匕首/短剑，刀身常呈波浪形，并具有文化或仪式意义"},"examples":[{"en":"The museum displayed a kriss with a beautifully carved wooden handle.","zh":"博物馆展出了一把匕首（kriss），木质刀柄雕刻得很精美。"},{"en":"In some stories, a kriss is believed to bring luck or protection to its owner.","zh":"在一些故事里，kriss 被认为能给主人带来好运或保护。"}]}],"synonyms":["keris","dagger","short sword"],"phonetic":"/krɪs/","extraExplanation":["“kriss”也常拼作“keris”（更接近印尼语/马来语的拼写）。它不仅是武器，也常被视为具有精神象征或家族传承意义的器物，在传统舞蹈、婚礼或仪式中出现。"]}
{"word":"Krissy","summary":{"en":"a feminine given name, often used as a nickname","zh":"女性名字，常作昵称使用"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, often used as a nickname for Christina, Christine, or Kristen/Kristin","zh":"女性名字，常用作 Christina、Christine 或 Kristen/Kristin 等名字的昵称"},"examples":[{"en":"Krissy is running late, but she’ll be here soon.","zh":"Krissy 要迟到了，但她很快就到。"},{"en":"I met Krissy at a friend’s birthday party.","zh":"我在朋友的生日派对上认识了 Krissy。"},{"en":"Krissy is short for Christina in her case.","zh":"对她来说，Krissy 是 Christina 的简称。"}]}],"synonyms":["Chrissy","Chris","Kristy","Christina","Christine"],"phonetic":"/ˈkrɪsi/","extraExplanation":["在英语文化中，Krissy/Chrissy 这类拼法常见于昵称或较亲切的称呼；正式文件上更常见的是 Christina/Christine/Kristin 等全名。"],"etymology":"主要是英文名的昵称写法：由 Chris/Chrissy 或 Kristy 等变体发展而来；这些名字通常来源于 Christina/Christine（与希腊语 Christos “受膏者”相关）。","mnemonic":["记作“Chris + -y/-sy（昵称尾巴）”：很多英文昵称会在常见名字后加 -y/-ie/-sy 来显得更亲切。"]}
{"word":"Krista","summary":{"en":"Krista is a female first name, often related to Kristin/Kristen or Christina.","zh":"Krista 是女性英文名，常与 Kristin/Kristen 或 Christina 等名字相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, used in English-speaking countries; often a short form or variant of names like Kristin/Kristen or Christina","zh":"女性名字（英文名）；常被视为 Kristin/Kristen 或 Christina 等名字的简称或变体"},"examples":[{"en":"Krista is starting a new job next week.","zh":"Krista 下周要开始一份新工作。"},{"en":"I met Krista at a conference in Chicago.","zh":"我在芝加哥的一个会议上认识了 Krista。"}]}],"synonyms":["Kristen","Kristin","Christina"],"phonetic":"/ˈkrɪstə/","extraExplanation":["Krista 通常被认为与“Christ-（基督）”同源，常见解释是“基督的追随者/信徒”之意；不过在人名使用中，更重要的是它作为一个现代、简洁的女性英文名出现。","在正式场合（证件、邮件签名）会直接使用 Krista；在更口语的场合，有些人也会用昵称，但并不固定，通常取决于个人偏好。"]}
{"word":"Kristabel","summary":{"en":"a feminine given name; a variant spelling of Christabel.","zh":"女性人名；Christabel 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a variant spelling of “Christabel”), used as a personal name.","zh":"女性名字（常被视为“Christabel”的变体拼写），用作人名。"},"examples":[{"en":"Kristabel moved to California for graduate school.","zh":"Kristabel 为了读研究生搬到了加州。"},{"en":"We named our daughter Kristabel because we liked the sound of it.","zh":"我们给女儿取名 Kristabel，因为喜欢这个名字的读音。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary reference) a spelling variant sometimes used when referring to “Christabel,” a famous unfinished narrative poem by Samuel Taylor Coleridge.","zh":"（文学指涉）有时用作“Christabel”的另一种拼写，用来指塞缪尔·泰勒·柯勒律治那首著名的未完成叙事诗《Christabel》。"},"examples":[{"en":"In some discussions online, “Kristabel” appears as an alternative spelling of Coleridge’s “Christabel.”","zh":"在一些网络讨论中，“Kristabel”会被当作柯勒律治《Christabel》的替代拼写。"}]}],"synonyms":["Christabel","Cristabel"],"phonetic":"/ˈkrɪstəbɛl/","extraExplanation":["如果你是想查文学作品名：更常见、标准的拼写是《Christabel》（柯勒律治，1797–1800 年间写作，1816 年出版）。","作为人名，Kristabel 在英语世界相对少见，常见于家长偏好独特拼写或家族命名传统的场景。"],"etymology":"多被视为 Christabel 的变体拼写。Christabel 这个名字常被解释为由 “Christ-（基督）” 与表示“美丽/可爱”的词源成分组合而来；历史上也出现过不同拼写形式（如 Cristabel 等），现代用法以人名为主。","mnemonic":["把它拆成“Krist- + -abel”：前半段像 Chris/Christ 的变体，后半段 -bel/-belle 常让人联想到“美丽（belle）”，可记作“有点像 Christabel 的名字”。"]}
{"word":"Kristel","summary":{"en":"a female given name (variant spelling)","zh":"女性名字（变体拼写）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name; a variant spelling of Christel/Christelle, sometimes associated with Crystal in English-speaking contexts","zh":"女性名字；常见为 Christel/Christelle 的变体拼写；在英语语境中有时也会让人联想到 Crystal（“水晶”）这一名字"},"examples":[{"en":"Kristel introduced herself and spelled her name for the receptionist.","zh":"Kristel 自我介绍后，还向前台拼写了自己的名字。"},{"en":"Please ask Kristel to join the meeting at 3 p.m.","zh":"请让 Kristel 下午三点参加会议。"}]}],"synonyms":["Christel","Christelle","Crystal"],"phonetic":"/ˈkrɪstəl/","extraExplanation":["这是专有名词（人名），通常不翻译含义；正式场合可按本人提供的拼写与读音使用。","不同地区读音可能略有差异；若不确定，最礼貌的方式是直接询问对方：“How do you pronounce your name?”（你的名字怎么读？）"],"etymology":"多为欧洲女性名 Christel/Christelle 的变体拼写；Christel 源自 Christian 相关的名字体系，原义与“基督徒/属于基督”有关。在英语环境中也可能被当作 Crystal 的变体来使用或被误读为 Crystal。","mnemonic":["把它记成“Chris- + -tel”的感觉：和 Christel/Christelle 很接近，看到 K 也别慌，就是换了首字母。","如果你先记得 Crystal（水晶），也能帮助你记住拼写里有 -stel 这段（但两者不一定同源）。"]}
{"word":"Kristen","summary":{"en":"a common female name; occasionally a surname","zh":"常見女性名字；偶爾作姓氏"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, used especially in English-speaking countries; sometimes also used as a surname","zh":"女性名字（英語國家常見）；有時也可作為姓氏"},"examples":[{"en":"Kristen is coming to the meeting tomorrow.","zh":"Kristen 明天會來開會。"},{"en":"I met a woman named Kristen at the library.","zh":"我在圖書館認識了一位叫 Kristen 的女士。"}]}],"synonyms":["Kristin","Kristine","Christine","Christina"],"phonetic":"/ˈkrɪstən/","extraExplanation":["在英語裡，Kristen 通常被理解為女性名。不同地區可能更常見的拼法包括 Kristen、Kristin、Kristine、Christine。","知名人物例子：美國演員 Kristen Stewart（《暮光之城》系列）。"],"etymology":"源自斯堪地那維亞與英語語境中的人名形式，常被視為 Christian（「基督徒」）或 Christine/Christina 的變體拼寫；核心語源與希臘語 *Christianos*（意為「基督的追隨者」）相關。","mnemonic":["把 Kristen 聯想成「Chris-」開頭的名字家族（Christine/Christian）：看到 K 開頭也常與「Christian/Christine 的變體」有關。"]}
{"word":"kristen","summary":{"en":"Kristen is a common female first name.","zh":"Kristen 是一个常见的女性英文名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), common in English-speaking countries.","zh":"女性名字（名），在英语国家较常见。"},"examples":[{"en":"Kristen is starting a new job next week.","zh":"Kristen 下周要开始一份新工作。"},{"en":"I met Kristen at a friend’s birthday party.","zh":"我在朋友的生日派对上认识了 Kristen。"}]}],"synonyms":["Kristin","Kirsten","Kristina","Krista"],"phonetic":"/ˈkrɪstən/","extraExplanation":["“Kristen”多被视为人名，常见于美国等英语国家。它通常被认为与“Christian（基督徒）”同源，可追溯到希腊语/拉丁语中表示“基督/受膏者”的词根；在北欧语言中也常见相关变体。","常见拼写/变体包括：Kristin、Kirsten、Kristina、Krista。发音会随地区略有不同，但英语里多读作“KRIS-tən”。"]}
{"word":"Kristi","summary":{"en":"a common female given name; a variant or short form related to Christine/Kristina","zh":"常见女性名字；与 Christine/Kristina 等相关的变体或简称"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name, commonly used in English-speaking countries; often a variant of Kristy/Christy or a short form of Kristina/Kristine (related to “Christian”).","zh":"女性名字，英语国家常见；常被视为 Kristy/Christy 的变体，或 Kristina/Kristine 的简称（与“基督徒/基督教”相关）。"},"examples":[{"en":"Kristi introduced herself at the meeting and shared her project update.","zh":"Kristi 在会上做了自我介绍，并分享了她的项目进展。"},{"en":"I got an email from Kristi about the schedule change.","zh":"我收到了 Kristi 发来的邮件，说日程有变。"}]}],"synonyms":["Kristy","Christy","Kristie","Kirsty","Kristina","Kristine","Christine"],"phonetic":"/ˈkrɪsti/","extraExplanation":["这是专有名词（人名），通常不翻译；在中文语境里多按音译处理（如“克里斯蒂/克里丝蒂”等），具体写法会因个人偏好而不同。","在英文写作中，人名首字母大写；称呼时可用全名 Kristi，也可能在熟人间出现更短的昵称。"],"etymology":"来自希腊语词根“Christos”（意为“受膏者”），经拉丁语与古法语进入英语，形成 Christine/Kristine 等名字；Kristi 多作为昵称或拼写变体使用。“K”拼写在北欧、东欧等地区也较常见。","mnemonic":["把 Kristi 记成“Chris-”家族的名字变体：看到 Kr-/Chr- 常能联想到 Christine/Christian 这一组。","联想中文音：Kris-ti ≈ “克里丝蒂”，读音接近就容易记住。"]}
{"word":"kristi","summary":{"en":"Kristi is most commonly a female first name, often a short form of Kristina/Christina; it can also be a less common surname.","zh":"Kristi 最常见是女性名字，常作为 Kristina/Christina 的简称；也可作较少见的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a variant of “Kristy/Christy”), often used as a short form of Kristina/Christina","zh":"女性名字（“Kristy/Christy”的变体），常作为 Kristina/Christina 的昵称或简称"},"examples":[{"en":"Kristi is starting a new job next week.","zh":"Kristi 下周要开始一份新工作。"},{"en":"I met Kristi at a friend’s birthday party.","zh":"我在朋友的生日派对上认识了 Kristi。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name), less common than the given name","zh":"姓氏（家族姓），不如作为名字常见"},"examples":[{"en":"Dr. Kristi will present the research findings today.","zh":"Kristi 医生今天将展示研究结果。"}]}],"synonyms":["Kristy","Christy"],"phonetic":"/ˈkrɪsti/","extraExplanation":["“Kristi”常被认为与“Christina/Christine”等名字同源，源头与希腊语“Christos”（意为“受膏者”）相关，因此在基督教文化影响较深的地区较常见。","英文里拼写相近的还有 Kristy、Christy、Kirsty（后者在英式英语地区更常见），读音和使用地域可能不同。"]}
{"word":"Kristian","summary":{"en":"a male first name; a variant spelling of Christian","zh":"男性名字；Christian 的变体拼写"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine given name, a variant spelling of “Christian,” used in many European languages.","zh":"男性名字，“Christian（克里斯琴/基督徒）”的变体拼写，常见于多种欧洲语言。"},"examples":[{"en":"Kristian is a common first name in parts of Scandinavia.","zh":"Kristian 在斯堪的纳维亚部分地区是很常见的名字。"},{"en":"Kristian spelled his name with a K, not a C.","zh":"Kristian 把名字用 K 拼，不用 C。"}]}],"synonyms":["Christian","Kristjan","Kristijan"],"phonetic":"/ˈkrɪstiən/","extraExplanation":["Kristian 多见于丹麦、挪威、瑞典、冰岛等地区，也出现在德语、斯拉夫语等语境里。英语环境中更常见的拼法是 Christian。","作为人名时通常不翻译“词义”，但在了解来源时可理解为与基督教传统相关的姓名。"],"etymology":"源自“Christian”的变体拼写；而 Christian 来自拉丁语 Christianus（“基督徒、属于基督的人”），更早与希腊语 Khristós（“受膏者”）相关。许多北欧与东欧语言中更常用 K- 的拼写。","mnemonic":["把 K 当作“北欧/德国常见的 K 开头拼法”提示：Christian 的另一种写法。","联想：K + “ristian”≈“Christian 换了个开头字母”。"]}
{"word":"kristian","summary":{"en":"Kristian is a male first name, a variant spelling of Christian.","zh":"Kristian 是男性名字，是 Christian 的一种变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name; a variant spelling of “Christian,” used in several European languages and in English.","zh":"男性名字；“Christian（克里斯蒂安）”的变体拼写，在多种欧洲语言以及英语中使用。"},"examples":[{"en":"Kristian is coming to the meeting at 3 p.m.","zh":"Kristian 下午三点来开会。"},{"en":"Her brother is named Kristian, spelled with a K.","zh":"她哥哥叫 Kristian，是用 K 开头拼写的。"}]}],"synonyms":["Christian"],"phonetic":"/ˈkrɪstiən/","extraExplanation":["“Kristian”常见于北欧与东欧地区（如丹麦、挪威、瑞典、德国、斯拉夫语系国家等）的拼写习惯；英语里更常见的是“Christian”。","在日常交流中，遇到此类名字最稳妥的问法是：\"How do you pronounce your name?\"（你的名字怎么读？）或\"How do you spell it?\"（怎么拼？）。"]}
{"word":"Kristiane","summary":{"en":"a feminine given name, related to the Christian name family.","zh":"女性人名；与“基督/Christian”词源相关的一组名字变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feminine given name, a variant of Kristiane/Christiane, used in several European languages.","zh":"女性名字；Kristiane/Christiane 的变体之一，见于多种欧洲语言。"},"examples":[{"en":"Kristiane introduced herself at the meeting and shared her role on the team.","zh":"Kristiane 在会议上做了自我介绍，并分享了她在团队中的职责。"},{"en":"I met Kristiane while studying abroad in Norway.","zh":"我在挪威留学时认识了 Kristiane。"}]}],"synonyms":["Christiane","Kristina","Christina","Christine"],"phonetic":"/krɪˈstiːænə/","extraExplanation":["这是专有名词（人名），通常不翻译意思，中文多采用音译（如“克里斯蒂安娜/克里斯蒂亚娜”等），具体写法会因个人偏好与证件拼写而不同。","在英语环境中，读音可能接近含“Chris-”的名字家族（如 Christina/Christine），但以本人自我介绍为准最礼貌。"],"etymology":"源自拉丁语 Christianus（“基督徒；与基督相关的人”），经由欧洲多种语言演变为 Christiane / Kristiane 等女性名形式；K- 拼写常见于斯堪的纳维亚语系与部分中东欧拼写习惯。","mnemonic":["记忆联想：把它看作“Krist- + -iane”，类似常见名字 Christina/Christine 的家族；看到 K 开头可联想到北欧常见的拼写习惯（如 Kristina）。"]}
{"word":"Kristiania","summary":{"en":"Oslo’s former city name in historical usage.","zh":"奥斯陆在历史文献中的旧城名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The former name of Oslo, Norway, used mainly from 1877 to 1925 (and often seen in older books, maps, and historical texts).","zh":"挪威首都奥斯陆的旧称，主要在1877—1925年间使用（常见于旧书、老地图与历史文献中）。"},"examples":[{"en":"In early 20th-century travel diaries, Oslo is often called Kristiania.","zh":"在20世纪初的旅行日记里，奥斯陆常被称为Kristiania。"},{"en":"The novel is set in Kristiania before the city officially changed its name to Oslo.","zh":"这部小说的背景设在城市正式更名为奥斯陆之前的Kristiania。"}]}],"synonyms":["Oslo","Christiania"],"phonetic":"ˌkrɪstiˈɑːniə","extraExplanation":["在英语和历史资料中，你可能会同时看到 Christiania 与 Kristiania：它们指的是同一座城市在不同时期/不同拼写习惯下的名称。","阅读北欧文学或历史（如19—20世纪挪威作品）时，Kristiania 往往暗示“旧时代的奥斯陆”，带有历史氛围。"],"etymology":"Kristiania 是 Oslo 的历史地名拼写之一。该名称与丹麦-挪威国王 Christian IV（克里斯蒂安四世）有关：城市在1624年大火后重建并以国王命名，早期更常见拼写为 Christiania；19世纪后期出现更“挪威化”的拼写 Kristiania，1925年改回 Oslo。","mnemonic":["记忆法：把 Kristiania 里的 “Krist-” 联想到 “Kristian（克里斯蒂安）”→ 这座城曾与国王 Christian 的名字相关。","联想对照：Kristiania（旧称）→ Oslo（今名），像“老名字换新名字”的城市改名。"]}
{"word":"Kristiansand","summary":{"en":"a coastal city and port in southern Norway","zh":"挪威南部的海岸港口城市"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southern Norway on the Skagerrak coast; an important regional center and port.","zh":"挪威南部、斯卡格拉克海峡沿岸的一座城市；是重要的地区中心与港口城市。"},"examples":[{"en":"Kristiansand is known for its coastal scenery and summer festivals.","zh":"克里斯蒂安桑以海岸风光和夏季节庆而闻名。"},{"en":"We took a ferry from Denmark to Kristiansand.","zh":"我们从丹麦坐渡轮到克里斯蒂安桑。"}]}],"synonyms":["Christiansand"],"phonetic":"/ˈkrɪstjənˌsɑn/","extraExplanation":["发音提示：英语里通常重音在第一个音节 KRIS-；也有人按挪威语习惯读得更“清晰分节”。中文常译作“克里斯蒂安桑/克里斯蒂安松”（不同译法并存）。","文化小知识：这里有挪威较受欢迎的动物园与游乐园（Kristiansand Dyrepark），夏天旅游人气很高。"],"etymology":"地名来源于丹麦-挪威国王克里斯蒂安四世（Christian IV）于1641年建立该城时的命名；早期常见拼写为“Christiansand”，后逐渐固定为现代拼写“Kristiansand”。","mnemonic":["拆分记忆：Kristian + sand。sand 像“桑/森”的音感，可联想到中文译名末尾的“桑”。","把它和人名 Christian 联系：这座城市与国王 Christian IV 的命名有关。"]}
{"word":"Kristie","summary":{"en":"a feminine given name, often a variant/nickname form of Christine or Christina","zh":"女性英文名，常为 Christine/Christina 的昵称或变体"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name; a spelling variant of Christie/Kristy, often used as a nickname for Christine or Christina","zh":"女性名字；常见拼写变体（类似 Christie/Kristy），也常作 Christine 或 Christina 的昵称"},"examples":[{"en":"Kristie introduced herself to the new classmates on the first day.","zh":"Kristie 在第一天向新同学做了自我介绍。"},{"en":"I met Kristie at a friend’s birthday party.","zh":"我在朋友的生日派对上认识了 Kristie。"}]}],"synonyms":["Christie","Kristy","Christy"],"phonetic":"/ˈkrɪsti/","extraExplanation":["这是专有名词（人名），通常首字母大写。不同拼写（Kristie/Christie/Kristy）读音常接近，具体以当事人自我介绍为准。"],"etymology":"多被视为 Christine/Christina 的昵称或变体拼写；其根源可追溯到希腊语“Christos”（意为“受膏者”），并通过拉丁语/法语形式进入英语姓名体系。","mnemonic":["把它拆成“Chris + -tie/-ie”：-ie 常见于英文昵称/小名（像 Katie、Susie），所以 Kristie 很像“Chris 的昵称形式”。","联想中文谐音“克里丝蒂”，更容易记住是女性英文名。"]}
{"word":"Kristin","summary":{"en":"a feminine personal name; a spelling variant related to Christine/Christina","zh":"女性人名；与 Christine/Christina 同源的拼写变体"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, common in English-speaking countries","zh":"女性名字，在英语国家较常见"},"examples":[{"en":"Kristin moved to Seattle for a new job.","zh":"Kristin 为了新工作搬去了西雅图。"},{"en":"I met Kristin at a friend’s birthday party.","zh":"我在朋友的生日派对上认识了 Kristin。"}]},{"partOfSpeech":"n.","definition":{"en":"a variant spelling of names related to Christine/Christina, traditionally associated with Christianity","zh":"与 Christine/Christina 同源的变体拼写，传统上与基督教文化有关"},"examples":[{"en":"Her name is Kristin, a variant of Christine.","zh":"她叫 Kristin，是 Christine 的一种变体拼写。"},{"en":"In her family, Kristin is a name passed down through generations.","zh":"在她家里，Kristin 是代代相传的名字。"}]}],"synonyms":["Kristen","Kristina","Christine","Christina"],"phonetic":"/ˈkrɪstɪn/","extraExplanation":["在英语里，人名常有多种拼写（如 Kristin/Kristen/Christine），读音相近但可能带有地区或年代偏好：Kristin 在美国较常见，Kristen 也很常见。拼写差异通常不改变名字的基本来源与含义。"],"etymology":"源自北欧及英语姓名体系中的拼写变体，常被视为 Christine/Christina 的变形；更早可追溯到拉丁语 Christianus（“基督徒的、与基督有关的”）及希腊语 Khristós（“受膏者”）。","mnemonic":["把 Kristin 联想到“Chris-”这一组同源名字（Christine/Christina/Kristen），看到 K 开头也可能是同一个来源的变体。","记忆法：Kris- + -tin（像“tin=铁罐/小盒”），想象“一个叫 Kris 的小盒子”帮助记住拼写中的 -tin。"]}
{"word":"kristin","summary":{"en":"Kristin is a common female first name, related to Christine/Christina.","zh":"Kristin 是常见的女性名字，与 Christine/Christina 等名字同源或相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), common in English-speaking countries; also used as a surname in some cases","zh":"女性名字（名），在英语国家较常见；有时也可作姓氏"},"examples":[{"en":"Kristin is joining our team next week.","zh":"Kristin 下周会加入我们的团队。"},{"en":"I met Kristin at a conference in Chicago.","zh":"我在芝加哥的一场会议上认识了 Kristin。"}]}],"synonyms":["Kristen","Christine","Christina","Kristina"],"phonetic":"/ˈkrɪstɪn/","extraExplanation":["Kristin 常被视为 Christine / Christina / Kristin 的变体之一，词源与“Christian（基督徒）”相关，来自希腊语 *Christos*（意为“受膏者”）。","在北欧（如挪威、瑞典）以及北美较常见。不同拼写（Kristin, Kristen, Kristina, Christine）在地域与年代上会有偏好。","写作与称呼上注意区分：Kristin / Kristen 发音相近，但很多人会在意具体拼写；正式场合建议以对方自我介绍或邮件签名为准。"]}
{"word":"Kristina","summary":{"en":"a feminine given name; a variant spelling of Christina","zh":"女性名字；Christina 的变体拼写"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, a spelling variant of Christina (often used in many European languages and in English)","zh":"女性名字；Christina 的一种拼写变体（在多种欧洲语言及英语中常见）"},"examples":[{"en":"Kristina introduced herself and shook everyone’s hand.","zh":"Kristina 自我介绍，并和大家握手。"},{"en":"Kristina is a common name in parts of Northern and Eastern Europe.","zh":"Kristina 在北欧和东欧的一些地区很常见。"}]}],"synonyms":["Christina","Christine","Kristine","Cristina"],"phonetic":"/krɪˈstiːnə/","extraExplanation":["读写提示：英文里名字常有多种拼写（Christina / Christine / Kristina 等），发音和用法往往非常接近；正式文件里要以护照/证件拼写为准。"],"etymology":"源自 Christina（拉丁语 Christiana），与“基督（Christ）”相关，原意接近“基督徒/属于基督的人”。在斯拉夫语族、北欧语言等中常见以 K- 开头的拼写（如 Kristina）。","mnemonic":["记忆法：把它联想成“Chris + tina”，前半像常见名 Chris，后半 tina 像“蒂娜”，合起来就是常见女名的感觉。","如果你熟悉 Christina：K 版的 Christina → Kristina（把 Ch- 换成 K-）。"]}
{"word":"Kristinaux","summary":{"en":"A name or username rather than a standard dictionary word.","zh":"更像人名或网名，而非标准词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (likely a personal name, surname, or username). It is not a standard English dictionary word.","zh":"专有名词（很可能是人名、姓氏或网名/账号名），并非标准英语词典词汇。"},"examples":[{"en":"Kristinaux posted the announcement on the forum.","zh":"Kristinaux 在论坛上发布了公告。"},{"en":"I’m not sure how to pronounce Kristinaux—could you say it for me?","zh":"我不确定 Kristinaux 怎么读——你能读给我听吗？"}]}],"synonyms":["username","handle","screen name","nickname","proper name"],"phonetic":"/ˈkrɪstɪˌnoʊks/","extraExplanation":["结尾“-aux”在法语中常见（如 cadeaux），英语里也常被用来营造“法式/高级感”的视觉效果，但这不一定表示它真的是法语词。","如果这是人名或账号名，发音通常以本人/官方写法为准；你也可以提供语境（它来自哪里、怎么用的），我可以更准确地判断读法与含义。"],"etymology":"看起来像是由名字“Kristina/Kristin”加上后缀或装饰性拼写（如 -aux，常见于法语拼写风格）组合而成的创意写法；但没有可靠的标准词源记录，更多取决于命名者的意图（例如昵称、品牌名、游戏ID）。","mnemonic":["把它拆成“Kristin + aux”：Kristin（像常见名字 Kristin）+ aux（长得像法语结尾），记作“Kristin 的法式拼写版”。"]}
{"word":"kristinaux","summary":{"en":"“Kristinaux” is likely a made-up name (often a username or brand), not a common English word.","zh":"“Kristinaux”很可能是自造名称（常见于用户名或品牌），不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word; most likely a coined name (e.g., a username/handle, brand name, or a personal name) that combines “Kristin” with “aux.”","zh":"不是标准英语词典词；更可能是自造名称（如用户名/账号名、品牌名或人名），可能由“Kristin”和“aux”组合而成。"},"examples":[{"en":"My username online is Kristinaux.","zh":"我在网上的用户名是 Kristinaux。"},{"en":"Kristinaux posted a new video yesterday.","zh":"Kristinaux 昨天发了新视频。"}]}],"phonetic":"/ˈkrɪstɪnaʊks/","extraExplanation":["“aux”在英语里常见为“auxiliary（辅助的）”的缩写，口语或网络中也常指“aux cable/AUX”（音频输入接口，如车载音响上的AUX口）。因此“Kristinaux”可能带有“Kristin + 辅助/音频AUX”的个人风格含义，但具体含义通常取决于使用者本人。","如果你是在某个特定语境看到它（比如音乐设备、社交媒体账号、公司名、角色名），把那句话/页面发我，我可以根据上下文更准确解释。"]}
{"word":"Kristine","summary":{"en":"A feminine given name, a spelling variant of Christine/Christina.","zh":"女性人名，Christine/Christina 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name; a variant of Christine/Christina, used especially in Scandinavia and English-speaking countries.","zh":"女性名字；Christine/Christina 的变体，常见于北欧及英语国家。"},"examples":[{"en":"Kristine moved to Chicago for her new job.","zh":"Kristine 为了新工作搬到了芝加哥。"},{"en":"My aunt’s name is Kristine, but everyone calls her Kris.","zh":"我阿姨叫 Kristine，但大家都叫她 Kris。"}]}],"synonyms":["Christine","Christina","Kristin","Kristina"],"phonetic":"/krɪˈstin/","extraExplanation":["在英语里这是专有名词（人名），通常首字母大写。","常见昵称：Kris、Kristy（是否使用取决于本人偏好）。"],"etymology":"源自拉丁语 Christianus（“基督徒的”）相关的人名传统，经由 Christina/Christine 演变出多种拼写；Kristine 常见于北欧地区的拼写习惯。","mnemonic":["把 Kris- 联想到常见昵称“Chris/Kris”，记住它是 Christine/Christina 的一种拼写。"]}
{"word":"Kristof","summary":{"en":"a male given name; also known as a character name in Frozen.","zh":"男性名字；也可指《冰雪奇缘》中的角色名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name, common in Northern and Eastern Europe; a variant spelling of “Kristoff,” related to “Christopher.”","zh":"男性名字，常见于北欧与东欧；是“Kristoff”的变体拼写，并与“Christopher（克里斯托弗）”同源。"},"examples":[{"en":"Kristof is a common Hungarian given name.","zh":"Kristof 是一个常见的匈牙利男性名字。"},{"en":"His name is Kristof, but some people spell it Kristoff.","zh":"他叫 Kristof，但有些人会拼成 Kristoff。"}]},{"partOfSpeech":"other","definition":{"en":"the name of a main character in Disney’s film Frozen (often spelled “Kristoff” in the English version).","zh":"迪士尼电影《冰雪奇缘》中的主要角色名字（英文版本通常拼作 “Kristoff”）。"},"examples":[{"en":"In Frozen, Kristoff helps Anna travel through the snow.","zh":"在《冰雪奇缘》中，Kristoff 帮安娜穿越雪地旅行。"},{"en":"Many viewers remember Kristoff for his bond with Sven.","zh":"很多观众记得 Kristoff 和驯鹿 Sven 之间的感情。"}]}],"synonyms":["Kristoff","Kristoffer","Christopher"],"phonetic":"/ˈkrɪstɔf/","extraExplanation":["拼写小提示：在不同语言里常见形式包括 Kristóf（匈牙利语常见带重音符号）、Kristof、Kristoff、Kristoffer（北欧较常见）。英语语境中最常见的对应名是 Christopher。"],"etymology":"多为 Kristoff / Kristóf 的变体拼写；来源可追溯到希腊语名词 Christophoros，意为“背负基督之人”，后来在基督教文化影响下进入拉丁语与各欧洲语言并演变出多种拼写。","mnemonic":["把它联想成“Chris + (t)off”：像是 Chris 的一个北欧/东欧风格变体，所以看到 Kristof 就想到 Christopher/Chris 家族的名字。"]}
{"word":"Kristofer","summary":{"en":"a male name; a spelling variant of Christopher.","zh":"男性人名；Christopher 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, a variant spelling of “Christopher.”","zh":"男性名字，“Christopher（克里斯托弗）”的拼写变体之一。"},"examples":[{"en":"Kristofer moved to Seattle for college.","zh":"Kristofer 去西雅图上大学了。"},{"en":"I met a Kristofer at the conference.","zh":"我在会议上认识了一个叫 Kristofer 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a family name (surname).","zh":"（较少见）姓氏。"},"examples":[{"en":"Dr. Kristofer will speak at 3 p.m.","zh":"Kristofer 博士将在下午三点发言。"}]}],"synonyms":["Christopher","Kristoffer","Kristof"],"phonetic":"ˈkrɪstəfɚ","extraExplanation":["这是专有名词（人名），通常不翻译含义，中文多按音译处理。不同国家/地区的拼写差异很常见：例如北欧更常见 Kristoffer，而英语环境更常见 Christopher。"],"etymology":"源自“Christopher”的变体拼写；Christopher 来自希腊语名词 Christophoros，意为“携带基督的人”（Christ + pherein “携带/承载”）。不同语言与地区常出现 Kristoffer/Kristofer/Kristof 等拼法。","mnemonic":["把 Kristofer 拆成“Krist- + -ofer”，联想到“Krist(=Christ) + offer（奉献）”，记成“与 Christ 有关的名字变体”。","联想常见名 Christopher（克里斯托弗）：把“Ch”换成“K”，就更像 Kristofer/Kristoffer 的拼法。"]}
{"word":"Kristoff","summary":{"en":"a male first name (also used as a surname)","zh":"男性名字（也可作姓氏）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name, commonly used in Eastern and Northern Europe and in English-speaking contexts (often a variant of Kristof/Christoph/Christopher)","zh":"男性名字；常见于东欧、北欧及英语语境中（常被视为 Kristof/Christoph/Christopher 的变体）"},"examples":[{"en":"Kristoff introduced himself at the start of the meeting.","zh":"Kristoff 在会议开始时做了自我介绍。"},{"en":"Her brother, Kristoff, studies engineering in Boston.","zh":"她的哥哥 Kristoff 在波士顿读工程。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname)","zh":"姓氏"},"examples":[{"en":"The article was written by Maria Kristoff.","zh":"这篇文章由 Maria Kristoff 撰写。"},{"en":"I found Dr. Kristoff’s office on the third floor.","zh":"我在三楼找到了 Kristoff 医生的办公室。"}]}],"synonyms":["Christopher","Christoph","Kristof"],"phonetic":"/ˈkrɪstɔf/","extraExplanation":["在流行文化中，它也常被用作角色名（例如迪士尼《Frozen》中人物名为 Kristoff），因此在英语国家的认知度更高。作为人名时通常需要大写首字母。"],"etymology":"多被认为源自“Christopher/Christoph/Kristof”这一姓名系统：来自希腊语 Christóphoros，意为“背负基督的人（bearer of Christ）”。不同语言与地区会出现拼写变体（如用 K- 开头的形式在斯拉夫语系或北欧语境中更常见）。","mnemonic":["把它联想成“Chris +（更硬朗的）K 开头拼法”：看到 Kri- 就想到和 Christopher 同一“家族”的变体。","中文记忆：可音近记“克里斯托夫”（常见译名），听到/看到就能迅速对应到这是人名。"]}
{"word":"Kristoffer","summary":{"en":"a Scandinavian form of the male name Christopher; also used as a surname.","zh":"斯堪的纳维亚地区常见的男性名（相当于 Christopher）；也可作姓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, a Scandinavian variant of “Christopher.”","zh":"男性名字；“Christopher（克里斯托弗）”的斯堪的纳维亚语变体。"},"examples":[{"en":"Kristoffer moved to the U.S. for graduate school.","zh":"Kristoffer 为了读研搬到了美国。"},{"en":"How do you spell Kristoffer—one “f” or two?","zh":"Kristoffer 怎么拼？是一个 f 还是两个？"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Ms. Kristoffer will join the meeting at 3 p.m.","zh":"Kristoffer 女士会在下午三点参加会议。"}]}],"synonyms":["Christopher"],"phonetic":"/ˈkrɪstɔfər/","extraExplanation":["在挪威、瑞典、丹麦等地区更常见这种拼写（Kristoffer），英语国家更常见拼写是 Christopher。正式场合可直接用作名；需要英文对应时，有时会被写作 Christopher，但最好尊重本人证件拼写。"],"etymology":"源自斯堪的纳维亚语（如挪威语、瑞典语）对 “Christopher” 的拼写与发音变体；而 “Christopher” 来自希腊语名词 Christophoros，意为“背负基督者/承载基督者”。","mnemonic":["把它当作“Christopher 的北欧拼写”：K 代替 Ch，结尾 -offer 看起来像 offer（提供），联想“Kristoffer = 北欧版 Christopher”。"]}
{"word":"Kristy","summary":{"en":"a common female first name, a variant spelling of Christy/Kristi","zh":"常见的女性英文名，为 Christy/Kristi 的变体拼写"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name; a spelling variant of Christy/Kristi, often used in English-speaking countries","zh":"女性名字；常见于英语国家，是 Christy/Kristi 的一种拼写变体"},"examples":[{"en":"Kristy is joining our class next week.","zh":"Kristy 下周要加入我们班。"},{"en":"I met Kristy at a volunteer event.","zh":"我是在一次志愿活动上认识 Kristy 的。"}]}],"synonyms":["Christy","Kristi","Kristie"],"phonetic":"/ˈkrɪsti/","extraExplanation":["作为人名时，Kristy 通常是昵称或独立名字（有时也可作 Kristina/Christine 的昵称）。拼写上还有 Kristi、Kristie、Christy 等变体，发音在不同家庭/地区可能略有差异。"],"etymology":"多被视为 Christy/Kristi 的变体拼写；这些名字常与 Christine/Christina 同源，最终可追溯到希腊语词根 Christos（与“基督”相关的称号）。现代用法多为人名本身，并不一定带有宗教含义。","mnemonic":["把它联想成“Chris”的变体：K-risty 里有 -rist-，容易让人想到 Christy/Christine 那一组名字。","记拼写：Kristy = Kris + ty（像“克里斯 + 提”一样拆开记）。"]}
{"word":"Kristyna","summary":{"en":"a Czech/Slavic female given name related to Christina.","zh":"与 Christina 同源的捷克/斯拉夫地区常见女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, common in Czech and some other Slavic-language communities; a form of “Christina.”","zh":"女性名字，在捷克及部分斯拉夫语地区较常见；为“Christina（克里斯蒂娜）”的变体之一。"},"examples":[{"en":"Kristyna is from Prague, and she speaks Czech and English.","zh":"Kristyna 来自布拉格，她会说捷克语和英语。"},{"en":"I met Kristyna at a conference last year.","zh":"我去年在一次会议上认识了 Kristyna。"}]}],"synonyms":["Christina","Kristina","Christine"],"phonetic":"/krɪˈstiːnə/","extraExplanation":["发音提示：在英语语境里常读作“kris-TEE-nuh”；在捷克语里常见写法为 Kristýna，其中“ý”表示长音，整体会更接近“kris-TEE-naa”的感觉（不同人也可能根据所在国家采用不同读法）。","文化小补充：这是典型的“同源不同拼写”的欧洲人名，出国或跨语言交流时，常会遇到 Kristina / Kristýna / Christina 等多种拼法。"],"etymology":"源自希腊语词根“Christ-”（与“Christ/基督”相关）所形成的人名传统；在中欧与斯拉夫语言环境中常见拼写为 Kristýna / Kristyna，对应英语常见形式 Christina。","mnemonic":["记忆法：把它拆成“Krist- + -yna”，前半段像“Chris-（克里斯）”，所以可联想到 Christina 的家族拼写。","中文联想：可记成“克里丝-蒂娜”的捷克拼法——看到 K 开头，多半是中东欧/斯拉夫常见的变体。"]}
{"word":"krisuvigite","summary":{"en":"“krisuvigite” is not recognized as a standard English word; it likely needs context or corrected spelling.","zh":"“krisuvigite”并非标准英语词汇；需要语境或更正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it may be a misspelling, a username, a coined term, or a proper name (e.g., a place/person).","zh":"不是主要英语词典中的标准词；可能是拼写错误、用户名、造词，或专有名词（如地名/人名）。"},"examples":[{"en":"I couldn’t find “krisuvigite” in an English dictionary—could you share a sentence that uses it?","zh":"我在英语词典里查不到“krisuvigite”，你能给我一个包含它的句子吗？"},{"en":"If it’s a name, the spelling might be specific to a person or place.","zh":"如果它是专有名词，拼写可能是特定人物或地点的写法。"}]}],"phonetic":"/ˈkrɪsjuˌvɪɡaɪt/","extraExplanation":["我目前无法把“krisuvigite”可靠地对应到某个常见英语单词或固定短语。为了帮你准确解释：\n1）它是从哪里看到的（文章/游戏/歌曲/社交媒体）？\n2）你想表达的意思是什么，或它出现的完整句子是什么？\n3）你是否可能想写的是某个相近拼写（例如以 -gate、-gite、-vite 结尾的词）？\n提供以上任意信息，我就能更精确地给出词义、用法和例句。"]}
{"word":"kritarchy","summary":{"en":"Kritarchy means “rule by judges,” a government where courts/judges hold the main power.","zh":"kritarchy 指“法官统治/司法统治”，即法院或法官在政治中掌握主要权力的政体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of government where judges (courts) hold the main political authority; rule by the judiciary","zh":"法官（法院）掌握主要政治权力的政体；司法统治（法官统治）"},"examples":[{"en":"Some writers describe ancient Israel in the period of the Judges as a kind of kritarchy.","zh":"一些作者把古代以色列的士师时期描述为一种“司法统治”（kritarchy）。"},{"en":"Critics warned that the country was drifting toward a kritarchy, where major decisions were effectively made in courts.","zh":"批评者警告说，这个国家正滑向“司法统治”，重大决定几乎都在法庭上作出。"}]}],"synonyms":["rule by judges","government by the judiciary","judicial rule","judicial government"],"phonetic":"/ˈkrɪtɑrki/","extraExplanation":["词源：来自希腊语 roots，kritēs（“法官”）+ -archy（“统治/政体”）。","用法提示：kritarchy 多用于政治学/历史写作，日常英语更常用的表达是 “rule by judges” 或 “government by the judiciary”。它常带有批评色彩，暗示法院权力过大。"]}
{"word":"kriterion","summary":{"en":"Kriterion is a less common spelling of criterion: a standard used to judge or decide something.","zh":"Kriterion 是 criterion 的较少见拼写：指用于判断或决定事情的标准/准则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant spelling of “criterion”) a standard or rule used to judge, evaluate, or decide something.","zh":"（“criterion”的变体拼写）标准；准则；用来判断、评估或决定某事的规则。"},"examples":[{"en":"Cost is our main criterion for choosing a new laptop.","zh":"价格是我们选择新笔记本电脑的主要标准。"},{"en":"One important criterion is whether the plan is realistic.","zh":"一个重要的评判标准是这个计划是否现实。"}]},{"partOfSpeech":"n.","definition":{"en":"(Technical, mathematics/logic) a test or principle that helps determine whether something is true or fits a category.","zh":"（专业用法，数学/逻辑）判别法；判据；用于判断某事是否成立或是否符合某类的检验原则。"},"examples":[{"en":"The researcher used a clear criterion to classify the data.","zh":"研究者用一个明确的判据来对数据分类。"},{"en":"This criterion tells us whether the series converges.","zh":"这个判别法告诉我们该级数是否收敛。"}]}],"synonyms":["criterion","standard","measure","benchmark","yardstick","test"],"phonetic":"/kraɪˈtɪriən/","extraExplanation":["“kriterion”来自希腊语词根（与“judge/判断”有关），有时在哲学或学术写作中用来强调希腊原词的形式；但在现代英语里更常见、也更推荐使用拼写“criterion”。","单数常用：criterion（或较少见的kriterion）；复数：criteria（或kriteria）。日常写作中用“criteria”当单数是常见错误。"]}
{"word":"krites","summary":{"en":"“Krites” is usually a rare Greek transliteration meaning “judges/critics,” or a surname.","zh":"“Krites”多为少见的希腊语音译（意为“审判者/评判者”），也可能是姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) a transliterated Greek word meaning “judges” or “critics,” sometimes seen in Bible/academic writing (plural of Greek kritēs).","zh":"（少见）源自希腊语的音译词，意思是“审判者/法官”或“评判者/评论者”，偶见于圣经或学术写作中（希腊语 kritēs 的复数）。"},"examples":[{"en":"In some Bible study notes, “krites” is glossed as “judges.”","zh":"在一些圣经研读注释里，“krites”会被释义为“审判者/士师”。"},{"en":"The author uses the Greek term “krites” to emphasize the role of critics in public debate.","zh":"作者用希腊词“krites”来强调评论者在公共讨论中的作用。"}]},{"partOfSpeech":"other","definition":{"en":"A surname (family name).","zh":"姓氏（家族名）。"},"examples":[{"en":"Dr. Krites published a study on language learning.","zh":"Krites 博士发表了一项关于语言学习的研究。"}]}],"synonyms":["judges","critics"],"phonetic":"/ˈkraɪtiːz/","extraExplanation":["“krites”在现代英语里不是常用词；如果你是在日常对话、作业或考试里看到它，很可能是：\n1）拼写想写“writes”（写）、“cries”（哭喊）、“criteria”（标准，复数）之一；\n2）人名/姓氏；\n3）宗教或古典学文本中对希腊语 κριτής（kritēs，法官/评判者）的转写。\n如果你能告诉我它出现的句子，我可以帮你判断最可能的意思。"]}
{"word":"krithia","summary":{"en":"Krithia is a place name in Gallipoli, Turkey, best known from World War I history.","zh":"Krithia 是土耳其加里波利地区的地名，主要因一战历史（加里波利战役）而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A village on the Gallipoli peninsula in Turkey (today near the site of Alçıtepe), known in English mainly for the World War I battles fought there during the Gallipoli Campaign.","zh":"土耳其加里波利半岛上的一个村庄（今靠近 Alçıtepe 一带），在英语中主要因第一次世界大战加里波利战役中发生在此地附近的战斗而为人所知。"},"examples":[{"en":"Many accounts of the Gallipoli Campaign mention the fighting near Krithia.","zh":"许多关于加里波利战役的记述都会提到在 Krithia 附近的战斗。"},{"en":"The troops advanced toward Krithia but faced heavy resistance.","zh":"部队向 Krithia 推进，但遭遇了强烈抵抗。"}]}],"synonyms":["Alçıtepe (modern nearby place name)"],"phonetic":"/ˈkrɪθiə/","extraExplanation":["Krithia 常见于历史写作中，尤其是 “Battle of Krithia（克里希亚战役）”。现代地图上更常见的相关地名是 Alçıtepe（阿尔奇特佩），但英文史料里仍广泛使用 Krithia。","读写时可把它当作专有名词（地名）来处理：首字母大写，通常不加冠词（不说 the Krithia）。"]}
{"word":"Kriti","summary":{"en":"a common Indian name; also a Sanskrit-based term meaning “work/creation,” especially a type of Carnatic composition.","zh":"常见印度人名；亦为梵语系词，意为“作品/创作”，尤指卡纳提克古典乐的一种乐曲体裁。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (commonly used in India); often used for girls/women.","zh":"人名（在印度较常见）；多用于女性名字。"},"examples":[{"en":"Kriti moved to Chicago for graduate school.","zh":"Kriti 去芝加哥读研究生了。"},{"en":"I met Kriti through a friend from Delhi.","zh":"我通过一位来自德里的朋友认识了 Kriti。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Sanskrit) a “creation” or “work”; in South Indian (Carnatic) classical music, a major type of devotional song/composition.","zh":"（源自梵语）“创作／作品”；在南印度（卡纳提克）古典音乐中，指一种重要的宗教歌曲／乐曲体裁（kriti）。"},"examples":[{"en":"The concert featured a famous kriti by Tyagaraja.","zh":"音乐会演奏了一首第亚格拉贾的著名 kriti。"},{"en":"In this context, kriti refers to a composed musical piece, not a person’s name.","zh":"在这个语境里，kriti 指的是创作的乐曲，而不是人名。"}]}],"synonyms":["given name","composition","song","piece","work","creation"],"phonetic":"/ˈkrɪti/","extraExplanation":["作为英文文本中的“Kriti”，最常见是人名；如果出现在音乐/文化相关文章（尤其提到 Carnatic、Tyagaraja 等），更可能是音乐术语“kriti/krithi”。","拼写上有时会看到 kriti / krithi 的变体，通常反映不同的转写习惯。"],"etymology":"多见为印度人名；同时也来自梵语 kṛti，原意偏向“做成的东西、创作、作品”，后来在卡纳提克古典音乐里专指一种重要的声乐作品体裁。","mnemonic":["记法1：把它和“create（创造）”联想——梵语本义就是“创作/作品”。","记法2：看到音乐语境（concert, composition, Carnatic）时，就把它当作“乐曲作品体裁”。"]}
{"word":"kritikos","summary":{"en":"*Kritikos* is a Greek-derived term meaning “able to judge,” best known as the root idea behind English words like “critic” and “critical.”","zh":"*kritikos*是源自希腊语的词，意思是“善于判断的”，常用于解释英语中“critic”“critical”等词的词源含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Ancient Greek) “able to judge; discerning.” Used in English mainly in etymology or scholarly writing as the root idea behind words like “critic” and “critical.”","zh":"（源自古希腊语）“善于判断的；有辨别力的”。在英语中多见于词源学或学术语境，用来解释“critic（评论家）”“critical（批判的/关键的）”等词的来源含义。"},"examples":[{"en":"The English word “critic” comes from Greek *kritikos*, meaning “able to judge.”","zh":"英语单词“critic（评论家）”来自希腊语 *kritikos*，意思是“善于判断的”。"},{"en":"In classical studies, *kritikos* describes someone trained to evaluate texts or ideas carefully.","zh":"在古典研究中，*kritikos*指受过训练、能细致评判文本或观点的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A judge or critic (rare in modern English; usually discussed as a Greek term rather than used as an everyday English noun).","zh":"评判者；评论者（现代英语中很少直接当作名词使用，通常作为希腊语术语来讨论）。"},"examples":[{"en":"Some authors contrast the *kritikos* (judge) with the poet or performer in Greek cultural life.","zh":"有些作者会把*kritikos*（评判者）与诗人或表演者在希腊文化生活中的角色作对比。"}]}],"synonyms":["discerning","judicious","critical","analytical"],"phonetic":"ˈkrɪtɪkɔs","extraExplanation":["*Kritikos*（κριτικός）来自希腊语动词 *krinein*（κρίνειν，“分开、判断、裁决”）。因此它不仅和“批评”有关，也和“做出决定/裁决”的概念有关。","英语里的 *critic*（评论家）、*criticism*（批评）、*critical*（批判的/关键的）、*criterion*（标准）都与这条词根相关：核心含义是“判断与区分”。"]}
{"word":"kriton","summary":{"en":"Kriton is a Greek name, often another spelling of Crito, and it can also refer to Plato’s dialogue “Crito/Kriton.”","zh":"Kriton 是一个希腊名字，常被视为 Crito 的另一种拼写；也可指柏拉图的对话篇《Crito/Kriton》（《克里托》）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Greek male name; a variant transliteration of “Crito,” known from ancient Athens.","zh":"一个希腊男性名字；“Crito（克里托）”的另一种音译写法，在古雅典语境中较常见。"},"examples":[{"en":"Kriton is a common transliteration in some editions of Greek texts.","zh":"在一些希腊文献版本中，Kriton 是一种常见的音译写法。"},{"en":"In Plato’s dialogue, Kriton (Crito) is a loyal friend who visits Socrates in prison.","zh":"在柏拉图的对话篇中，Kriton（Crito）是苏格拉底的忠实朋友，会去监狱探望他。"}]},{"partOfSpeech":"n.","definition":{"en":"the title “Kriton/Crito,” a short philosophical dialogue by Plato about justice, law, and whether one should escape punishment.","zh":"《Kriton/Crito》（《克里托》）：柏拉图的一篇短哲学对话，讨论正义、法律，以及是否应当逃避惩罚等问题。"},"examples":[{"en":"We read Kriton to discuss the conflict between personal conscience and the law.","zh":"我们读《Kriton》来讨论个人良知与法律之间的冲突。"},{"en":"The “Kriton” dialogue is often paired with the “Apology” when studying Socrates.","zh":"学习苏格拉底时，《Kriton》常与《Apology》（《申辩篇》）一起阅读。"}]}],"synonyms":["Crito"],"phonetic":"/ˈkriːtɑːn/","extraExplanation":["“Kriton”更常见于把古希腊语名字按字母对应进行转写（transliteration）的语境；英语世界里更广为人知的拼写通常是“Crito”。","在文学与哲学引用中，你可能会看到《Crito》或《Kriton》指同一篇作品；是否用 K 或 C 往往取决于出版社、学术传统或译者习惯。"]}
{"word":"kritrima","summary":{"en":"Kritrima means “artificial; man-made,” mainly used in South Asian contexts.","zh":"kritrima 意为“人工的、合成的”，主要见于南亚语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"artificial; made by humans rather than occurring naturally (a loanword from Sanskrit/Hindi, used mainly in South Asian contexts)","zh":"人工的；非自然形成的（源自梵语/印地语的借词，主要在南亚语境中使用）"},"examples":[{"en":"Some people prefer natural flavors, not kritrima ones.","zh":"有些人更喜欢天然口味，不喜欢人工的（kritrima）口味。"},{"en":"The hospital used kritrima limbs to help patients walk again.","zh":"医院使用人工假肢（kritrima limbs）帮助病人重新行走。"}]},{"partOfSpeech":"n.","definition":{"en":"an artificial or synthetic thing (less common as a noun in English writing)","zh":"人工制品；合成物（在英语里作名词较少见）"},"examples":[{"en":"He criticized the kritrimas in the food industry.","zh":"他批评食品行业里的各种人工添加物/合成物（kritrimas）。"}]}],"synonyms":["artificial","synthetic","man-made","unnatural"],"phonetic":"/krɪˈtriːmə/","extraExplanation":["“kritrima”对应梵语/印地语“कृत्रिम (kṛtrima)”，常见意思是“人工的、合成的”。在一般英语环境里更常用的词是 artificial / synthetic / man-made；如果你的读者不熟悉南亚语言，建议优先用这些英语词。","在印度相关的英文语境中，你可能会看到“kritrima ang (artificial limbs，人工肢体)”“kritrima garbh (artificial womb，人工子宫)”这类搭配。"]}
{"word":"krivu","summary":{"en":"“krivu” is not standard English; it’s likely a name or a non-English word meaning “wrong/at fault,” depending on context.","zh":"“krivu”不是标准英语；更可能是名字或外来语，含义需看语境（常见为“错／有过错”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “krivu” is most often seen as a non-English form (especially in some Slavic languages) meaning “wrong / at fault” (feminine accusative form of a word like “kriv”). It may also be a name (surname, username, or place name).","zh":"不是标准英语单词。“krivu”更常见于非英语用法（尤其部分斯拉夫语言中），大致表示“错误的／有过错的／怪某人”（类似“kriv”的阴性宾格形式）。也可能是人名、用户名或地名。"},"examples":[{"en":"I saw “krivu” in a comment, but it wasn’t English—so I needed more context to understand it.","zh":"我在评论里看到“krivu”，但它不是英语，所以需要更多语境才能理解。"},{"en":"Is “krivu” a name, a typo, or a word from another language?","zh":"“krivu”是名字、拼写错误，还是其他语言的词？"}]}],"phonetic":"/ˈkriːvuː/","extraExplanation":["如果你是在英文文章/聊天里看到“krivu”，它很可能不是英语词，而是：①用户名/昵称；②人名或地名；③外来语（常见于巴尔干/斯拉夫语系语境，含“错、怪、过错”的意思）。","你可以把原句（前后各一两句话）发我，我就能更准确判断它在你的语境里是什么意思，以及是否其实是某个英文词的拼写误差。"]}
{"word":"krna","summary":{"en":"“krna” is informal Hinglish (Romanized Hindi) meaning “to do/make,” not standard English.","zh":"“krna”是非正式Hinglish（印地语拉丁拼写），意思是“做/进行”，不属于标准英语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not standard English. A common Romanized Hindi/Hinglish form of Hindi “करना (karna),” meaning “to do; to make; to perform,” often seen in informal texting.","zh":"不是标准英语。常见的印地语/印式英语（Hinglish）拉丁字母拼写，来自印地语“करना (karna)”，意思是“做；进行；制作”，常用于非正式聊天。"},"examples":[{"en":"I have to krna this homework today. (informal Hinglish)","zh":"我今天得把这个作业做完。（非正式Hinglish）"},{"en":"What krna now? (meaning: What should we do now?)","zh":"现在要做什么？（意思是：我们现在该怎么办？）"}]}],"synonyms":["do","make","perform","carry out"],"phonetic":"/ˈkɑr.nə/","extraExplanation":["“krna”常见于南亚语境的网络聊天，是把印地语动词“karna（做/进行）”省略元音后的写法（类似把“karna”打成“krna”）。在正式英文写作中不建议使用；可改成 do / make / perform，或用完整的 Hindi 拼写 karna。","如果你原本想查的是 “RNA”（核糖核酸）或其他缩写（如电台呼号 KRNA），可以告诉我具体语境，我可以按正确词条解释。"]}
{"word":"krobyloi","summary":{"en":"“krobyloi” is not a recognized English word; it’s likely a name/handle or transliteration.","zh":"“krobyloi”并非公认英文词汇；很可能是人名/昵称或外语音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a proper name, username, or a transliteration from another language. Meaning depends on the context you saw it in.","zh":"不是标准英文单词；更可能是专有名词（人名/网名）或其他语言的音译。具体含义需结合出现的语境判断。"},"examples":[{"en":"My gamer tag is Krobyloi.","zh":"我的游戏昵称是 Krobyloi。"},{"en":"Krobyloi commented on the post, but I don’t know who they are.","zh":"Krobyloi 在帖子下留言了，但我不知道他/她是谁。"}]}],"phonetic":"/ˈkroʊbɪlɔɪ/","extraExplanation":["“Krobyloi”在常见英文词典中没有固定词条，可能是拼写变体、虚构词，或来自其他语言（例如姓氏/地名的拉丁转写）。","如果你能提供它出现的句子、平台（游戏/社交媒体/小说）或是否应为大写（Krobyloi vs krobyloi），我可以更准确判断它是否是某个名字、梗，或某个词的误拼。"]}
{"word":"krobylos","summary":{"en":"Krobylos is a rare term from Ancient Greek meaning a topknot or tuft of hair tied up on the crown of the head.","zh":"Krobylos 是一个源自古希腊语的罕见词，指头顶扎起的发髻或一束头发。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek) a topknot or tuft of hair, especially a lock tied up on the crown of the head.","zh":"（古希腊语）发髻；头顶扎起的一束头发（尤指头顶的发束或发结）。"},"examples":[{"en":"In some ancient Greek descriptions, a young man is shown wearing a krobylos tied high on his head.","zh":"在一些古希腊的描写中，年轻男子被刻画为把头发扎成高高的 krobylos（发髻）。"},{"en":"The statue’s hair is gathered into a krobylos, suggesting a traditional style.","zh":"雕像的头发束成一个 krobylos（发结），暗示这是一种传统发式。"}]}],"synonyms":["topknot","bun","hair knot","tuft"],"phonetic":"/ˈkroʊbɪlɔs/","extraExplanation":["“krobylos”来自古希腊语 κρώβυλος，常见于古典文献或艺术史/考古学语境，用来描述特定的发型（头顶的发束或发髻）。在现代英语里很少作为日常词使用，更常见的通俗说法是 bun / topknot / hair knot。"]}
{"word":"krocidolite","summary":{"en":"Crocidolite is blue asbestos, a hazardous fibrous mineral once used in industry.","zh":"Crocidolite 指“蓝石棉”，一种曾用于工业但对健康高度危险的纤维状矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blue, fibrous mineral (a type of asbestos) that was once used for insulation and other industrial purposes but is now avoided because its dust is highly hazardous to health.","zh":"一种蓝色纤维状矿物（石棉的一种），过去常用于隔热等工业用途，但因其粉尘对健康危害极大而现多被禁止或避免使用。"},"examples":[{"en":"Crocidolite was used in some older insulation materials before its dangers were widely recognized.","zh":"在其危险性被广泛认识之前，蓝石棉曾用于一些旧式保温材料。"},{"en":"Workers exposed to crocidolite dust may face serious lung diseases.","zh":"接触蓝石棉粉尘的工人可能面临严重的肺部疾病。"}]}],"synonyms":["blue asbestos","asbestos (general term)"],"phonetic":"/kroʊˈsɪdəˌlaɪt/","extraExplanation":["你输入的拼写“krocidolite”更常见的标准拼写是“crocidolite”。有些资料也称其为“blue asbestos（蓝石棉）”。","词源：来自希腊语 kroky(d)-（意为“绒毛/纤维”）+ -lite（“矿物/石头”后缀）。","健康与法规背景：蓝石棉因纤维细长、易被吸入且不易排出，被认为是最危险的石棉类型之一；许多国家已严格限制或禁止其开采与使用。处理含石棉材料通常需要专业防护与合规处置。"]}
{"word":"krocket","summary":{"en":"“Rocket” can mean a spacecraft/firework, and as a verb it means to move or increase very quickly.","zh":"“rocket”既可指火箭/冲天烟花，也可作动词表示迅速上升、猛涨或快速发射。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vehicle (or part of one) that flies into the air or space using powerful engines","zh":"火箭；（进入太空的）运载火箭"},"examples":[{"en":"The rocket lifted off at dawn.","zh":"火箭在黎明时发射升空。"},{"en":"They watched a rocket launch on TV.","zh":"他们在电视上观看火箭发射。"}]},{"partOfSpeech":"n.","definition":{"en":"a firework shaped like a rocket that shoots up into the sky","zh":"（烟花）冲天火箭"},"examples":[{"en":"We lit a rocket on New Year’s Eve.","zh":"我们在除夕点燃了一个冲天火箭烟花。"}]},{"partOfSpeech":"v.","definition":{"en":"to rise or move upward very quickly","zh":"迅速上升；猛涨"},"examples":[{"en":"Gas prices rocketed last month.","zh":"上个月汽油价格猛涨。"},{"en":"The ball rocketed into the air.","zh":"球猛地飞向空中。"}]},{"partOfSpeech":"vt.","definition":{"en":"to send or shoot something upward or forward very fast","zh":"把……快速发射/射出"},"examples":[{"en":"The player rocketed the ball into the net.","zh":"那名球员把球劲射入网。"}]}],"synonyms":["launch","missile","shoot up","soar","surge"],"phonetic":"/ˈrɑkɪt/","extraExplanation":["“krocket”本身不是常见英语单词；更常见的是“rocket”。如果你指的是品牌名、用户名、游戏道具名或某个缩写（例如“K-rocket”），告诉我具体语境，我可以按那个含义解释。"]}
{"word":"Kroger","summary":{"en":"a U.S. supermarket chain","zh":"美国连锁超市品牌"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large American supermarket (grocery) chain, common in many U.S. states.","zh":"美国一家大型连锁超市（杂货店）品牌，在许多州都很常见。"},"examples":[{"en":"I’m stopping by Kroger to buy milk and eggs.","zh":"我去Kroger买牛奶和鸡蛋。"},{"en":"Kroger often has weekly deals on produce and snacks.","zh":"Kroger经常有每周的生鲜和零食优惠。"}]}],"synonyms":["supermarket","grocery store","grocer"],"phonetic":"/ˈkroʊɡər/","extraExplanation":["在美国日常口语里，人们常用“go to Kroger”表示“去Kroger这家超市买东西”。不同地区也会把类似的大型超市说成“the grocery store”，不一定指某个品牌。"],"etymology":"源自创办者姓名：Bernard Kroger（伯纳德·克罗格），他在1883年于美国俄亥俄州创立该连锁超市品牌。","mnemonic":["把它拆成发音记忆：Kro-ger ≈ “克罗-格”，联想“去克罗格买groceries（日用品/食物）”。"]}
{"word":"krohnkite","summary":{"en":"“krohnkite” is likely a misspelling of “Cronkite,” a surname best known from Walter Cronkite, a highly trusted American TV news anchor.","zh":"“krohnkite” 很可能是 “Cronkite” 的拼写错误；Cronkite 是一个姓氏，最知名的是美国极具公信力的电视新闻主播沃尔特·克朗凯特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually \"Cronkite\") A U.S. surname, best known from Walter Cronkite, a famous American TV news anchor; often used to refer to him or to a very trusted news reporter.","zh":"（通常写作 Cronkite）一个美国姓氏，最知名的是美国著名电视新闻主播沃尔特·克朗凯特；也常用来指他本人或“非常值得信赖的新闻播报员/记者”。"},"examples":[{"en":"The name is usually spelled Cronkite, not krohnkite.","zh":"这个名字通常拼作 Cronkite，而不是 krohnkite。"},{"en":"My grandpa still talks about Walter Cronkite as the most trusted newsman on TV.","zh":"我爷爷现在还会说沃尔特·克朗凯特是电视上最值得信赖的新闻主播。"}]}],"synonyms":["Walter Cronkite"],"phonetic":"ˈkrɑnkaɪt","extraExplanation":["你输入的 “krohnkite” 更像是对 “Cronkite” 的拼写误差。Walter Cronkite（沃尔特·克朗凯特）是美国 CBS 新闻的标志性主播，因报道重大事件（如登月、越战时期的新闻）而广为人知，在美国文化里常被当作“权威、可信的新闻声音”的象征。"]}
{"word":"krome","summary":{"en":"“Krome” is usually a proper name (place/brand) or a stylized spelling of “chrome.”","zh":"“Krome”通常是专有名称（地名/品牌名），或是“chrome”的风格化拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A name used for places, companies, or products (a proper name); its meaning depends on the specific context.","zh":"一个用于地名、公司名或产品名的专有名称；具体含义取决于使用场景。"},"examples":[{"en":"Krome Avenue is a major road in Miami-Dade County.","zh":"Krome Avenue 是佛罗里达州迈阿密-戴德县的一条主要道路。"},{"en":"She works at a company called Krome.","zh":"她在一家叫 Krome 的公司工作。"}]},{"partOfSpeech":"other","definition":{"en":"An informal or stylized spelling of “chrome,” often used in branding, usernames, or creative writing.","zh":"“chrome（铬/镀铬）”的非正式或风格化拼写，常见于品牌名、用户名或创意写作。"},"examples":[{"en":"His gamer tag is Krome.","zh":"他的游戏ID叫 Krome。"},{"en":"The ad says “Krome finish,” meaning a shiny chrome-like look.","zh":"广告写着“Krome finish”，意思是像镀铬一样的亮面效果。"}]}],"synonyms":["chrome"],"phonetic":"/kroʊm/","extraExplanation":["“Krome”在英语里通常不是标准词汇，更常见的是专有名词（比如美国佛州的 Krome Avenue、迈阿密的 Krome Detention Center）或品牌/艺名的拼写。","如果你本来想查的是“chrome”，它是常用词：既可以指化学元素“铬”，也常指“镀铬的金属光泽/装饰”。"]}
{"word":"kromeski","summary":{"en":"“Kromeski” is not a standard English word; it is likely a name or a misspelling.","zh":"“kromeski”不是标准英语单词；更可能是人名/网名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or unclear term; it does not appear as a common English word in major dictionaries and is most likely a proper name (e.g., a surname/username) or a misspelling of another word.","zh":"非标准或含义不明确的词；在主要英语词典中不作为常见单词出现，更可能是专有名词（如姓氏/用户名）或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “kromeski” in an English dictionary—can you share the sentence where you saw it?","zh":"我在英语词典里找不到“kromeski”——你能把它出现的句子发给我吗？"},{"en":"“Kromeski” might be a last name or an online handle rather than an English vocabulary word.","zh":"“Kromeski”可能是姓氏或网名，而不是英语词汇里的常用词。"}]}],"phonetic":"/kroʊˈmɛski/","extraExplanation":["“kromeski”看起来更像人名/网名或外来语拼写（例如东欧姓氏常见“-ski”结尾）。如果你告诉我来源（电影字幕、聊天记录、书名、游戏ID等）或给出完整句子，我可以更准确判断：它是否是某个人物名、地名、品牌名，还是某个英文词的误拼（比如读音相近的词）。"]}
{"word":"kromesky","summary":{"en":"“Kromesky” is not a common English word; it is likely a proper name or a spelling variant.","zh":"“Kromesky”不是常见英语词；更可能是专有名词或拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; most likely a proper name (e.g., a surname, username, or place name) or a misspelling.","zh":"不是标准英语词汇；更可能是专有名词（如姓氏、用户名、地名等）或拼写错误。"},"examples":[{"en":"“Kromesky” doesn’t appear in major English dictionaries; it may be a surname or a screen name.","zh":"“Kromesky”在主要英语词典中查不到；它可能是姓氏或网名。"},{"en":"Could you share where you saw “Kromesky” so I can help interpret it?","zh":"你能告诉我你在哪里看到“Kromesky”吗？这样我能更准确地解释。"}]}],"synonyms":["(none; likely a proper name)"],"phonetic":"/kroʊˈmɛski/","extraExplanation":["“Kromesky”看起来像是英语里对某个斯拉夫语系姓氏的音译/拼写变体（结尾 -sky / -ski 很常见），但仅凭这个拼写无法确定准确来源与含义。","如果你提供更多上下文（例如：句子、国家/语言、是否为人名/公司名/地名），我可以帮你判断它是否是某个真实姓氏的常见写法、可能的正确拼写，以及更自然的英文读法。"]}
{"word":"kromogram","summary":{"en":"“Kromogram” is not a standard English word; it is usually a misspelling of “chromogram” or (more commonly) “chromatogram.”","zh":"“kromogram”不是标准英语词，通常是“chromogram”或（更常见的）“chromatogram（色谱图）”的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A chart or record that represents colors or changes in color over time; sometimes used as a variant or misspelling of “chromogram”/“chromatogram.”","zh":"（不常见）表示颜色或颜色随时间变化的图表/记录；有时被当作“chromogram / chromatogram（色谱图）”的变体或拼写误写。"},"examples":[{"en":"The report included a chromogram showing how the dye shifted from blue to green.","zh":"报告里包含了一张色彩图，展示染料如何从蓝色变成绿色。"},{"en":"If you mean the output of chromatography, the standard word is “chromatogram,” not “kromogram.”","zh":"如果你指的是色谱分析的输出结果，标准词是“chromatogram（色谱图）”，不是“kromogram”。"}]}],"synonyms":["chromogram","chromatogram","color chart","color record"],"phonetic":"/ˈkroʊməɡræm/","extraExplanation":["“kromogram”在英语里非常少见，更多情况下是把“chromogram”或更常用的“chromatogram（色谱图）”拼错了。","前缀“chromo-”来自希腊语，意思是“颜色”。在科学语境里：chromatography（色谱法）→ chromatogram（色谱图/色谱记录）。如果你能告诉我你看到这个词的领域（化学、摄影、印刷等），我可以给出更贴近语境的解释。"]}
{"word":"kromskop","summary":{"en":"A Kromskop is a historical color-photography viewer/system that combines filtered images to produce a color picture.","zh":"Kromskop 是一种历史上的彩色摄影观赏装置/系统，通过叠合滤色影像来呈现彩色画面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early color-photography viewing device/system (a trademark name) that used colored filters and multiple images to recreate color when viewed through a special viewer","zh":"一种早期彩色摄影的观赏装置/系统（商标名），通过彩色滤镜与多张影像在专用观片器中合成出颜色效果"},"examples":[{"en":"The museum displayed an Ives Kromskop alongside other early color-photography experiments.","zh":"博物馆展出了艾夫斯的 Kromskop，并与其他早期彩色摄影实验一同陈列。"},{"en":"With a Kromskop viewer, three filtered images could be combined to appear as one full-color picture.","zh":"用 Kromskop 观片器可以把三张不同滤色的影像合成为一张看起来是全彩的照片。"}]}],"synonyms":["color viewer","early color photography system","three-color viewer"],"phonetic":"/ˈkrɑm.skɑp/","extraExplanation":["“Kromskop”常见于摄影史语境，指美国发明家 Frederic Eugene Ives（弗雷德里克·尤金·艾夫斯）在19世纪末推广的一套彩色成像/观赏方案。它通常与“三色法（红、绿、蓝）”有关：分别记录（或制作）三张经不同滤色处理的影像，再在观看装置中叠合，让人眼产生彩色效果。","这个词在现代英语里很少用于日常交流，更像是历史名词或品牌名；写作时常大写为 Kromskop。"]}
{"word":"krona","summary":{"en":"Krona is the currency unit of Sweden (SEK) and a related currency name in Nordic countries.","zh":"Krona 指瑞典的货币单位（SEK，克朗），也与其他北欧国家的同名货币有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic unit of money in Sweden (SEK); also used as a currency name in some other Nordic countries (spelled “krone/króna” depending on the language).","zh":"瑞典的货币基本单位（SEK，瑞典克朗）；在其他北欧国家也有同名货币，但拼写可能为 krone/króna。"},"examples":[{"en":"I paid 120 kronor for the museum ticket in Stockholm.","zh":"我在斯德哥尔摩花了120克朗买博物馆门票。"},{"en":"The price is listed in Swedish krona (SEK).","zh":"价格用瑞典克朗（SEK）标示。"}]}],"synonyms":["Swedish krona","SEK","krone","króna"],"phonetic":"/ˈkroʊnə/","extraExplanation":["“krona”来自“crown（王冠）”这一含义，历史上很多欧洲货币名称都和“王冠/皇冠”有关。","在英语语境里，说到“krona”通常指瑞典货币；挪威多写作“krone”，冰岛写作“króna”（带重音符号）。","复数在瑞典语中常见为“kronor”，但英语里也有人直接写“krona(s)”。"]}
{"word":"kronas","summary":{"en":"plural of a Nordic currency unit (krona).","zh":"北欧货币单位“克朗”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of “krona,” a currency unit used in some Nordic countries (especially Sweden; also historically/regionally in others).","zh":"“krona”的复数形式；指某些北欧国家使用的货币单位（尤指瑞典克朗；在其他地区也有历史/地区性的使用）。"},"examples":[{"en":"The ticket costs 200 kronas.","zh":"这张票要200克朗。"},{"en":"I exchanged dollars for Swedish kronas at the airport.","zh":"我在机场把美元换成了瑞典克朗。"}]}],"synonyms":["Swedish crowns","SEK"],"phonetic":"/ˈkroʊnəz/","extraExplanation":["英语里更常见的写法是：one krona / two kronor（瑞典语复数）或 two krona/kronas（英语里有时会英语化加 -s）。在实际英文文章中，你也可能看到 SEK（瑞典克朗的货币代码）。"],"etymology":"来自瑞典语（以及相关的北欧语言）krona，原意为“王冠/皇冠”，因为早期硬币上常印有皇冠图案，后来词义转为货币单位名称。","mnemonic":["把 krona 联想成 crown（王冠）：王冠→印在硬币上→货币单位。"]}
{"word":"Kronborg","summary":{"en":"A famous Danish Renaissance castle in Helsingør, closely linked with *Hamlet*.","zh":"丹麦赫尔辛格的著名文艺复兴城堡，与《哈姆雷特》渊源很深。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Renaissance castle in Helsingør (Elsinore), Denmark, famous as the setting associated with Shakespeare’s *Hamlet* and as a UNESCO World Heritage site.","zh":"丹麦赫尔辛格（Elsinore）的一座文艺复兴时期城堡，因与莎士比亚《哈姆雷特》的“埃尔西诺城堡”联系而闻名，并被列为联合国教科文组织世界遗产。"},"examples":[{"en":"Tourists visit Kronborg to see the castle linked to Shakespeare’s *Hamlet*.","zh":"游客会去参观Kronborg，因为它与莎士比亚《哈姆雷特》有关。"},{"en":"Kronborg sits by the Øresund Strait, where ships once paid a toll to pass.","zh":"Kronborg坐落在厄勒海峡旁，过去船只通过这里要缴通行税。"},{"en":"The school organized a virtual tour of Kronborg Castle in Denmark.","zh":"学校组织了一次丹麦Kronborg城堡的线上参观。"}]}],"synonyms":["Kronborg Castle","Elsinore Castle"],"phonetic":"/ˈkroʊnˌbɔrɡ/","extraExplanation":["在英语语境中，Kronborg常被称为“Kronborg Castle”。在《哈姆雷特》里出现的“El sinore Castle（埃尔西诺城堡）”通常被认为影射或借用了Kronborg的文化形象。","它位于丹麦与瑞典之间的重要航道厄勒海峡（Øresund），历史上与“海峡通行税（Sound Dues）”相关，因此兼具军事与贸易控制意义。"],"etymology":"源自丹麦语：kron-（“王冠”）+ borg（“城堡/要塞”），字面意思接近“王冠堡垒/王冠城堡”。","mnemonic":["把它拆开记：kron≈“crown（王冠）”，borg≈“堡/城堡”（像中文“堡”），合起来就是“王冠城堡”。","联想《哈姆雷特》：你想到“丹麦王子”，就容易想到他所在的城堡——Kronborg。"]}
{"word":"krone","summary":{"en":"Krone is a unit of currency used in countries like Denmark and Norway; less commonly, it can also mean a crown in some European contexts.","zh":"Krone主要指丹麦、挪威等国使用的货币单位；较少见时也可指（欧洲语境中的）王冠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic unit of money used in several countries, especially Denmark and Norway (and also Sweden, spelled “krona”); plural “kroner” or “kroner/krone” depending on the language","zh":"克朗：一些国家（尤其丹麦、挪威使用；瑞典对应为“krona/克朗”）的货币单位；复数常见为“kroner”（不同语言规则略有差异）"},"examples":[{"en":"A coffee in Oslo might cost about 45 kroner.","zh":"在奥斯陆，一杯咖啡可能要大约45克朗。"},{"en":"She exchanged euros for Danish kroner at the airport.","zh":"她在机场把欧元换成了丹麦克朗。"}]},{"partOfSpeech":"n.","definition":{"en":"a crown; in some European contexts, “Krone” can refer to a royal crown or a crown-shaped item (less common in everyday English)","zh":"王冠；在部分欧洲语境中，“Krone”可指王室王冠或冠状物（在日常英语中较少见）"},"examples":[{"en":"The museum displayed a gold Krone from the royal collection.","zh":"博物馆展出了一顶来自王室收藏的金王冠。"}]}],"synonyms":["crown","krona","kroner"],"phonetic":"/ˈkroʊnə/","extraExplanation":["“krone”这个拼写常见于丹麦语、挪威语，复数是“kroner”。瑞典语通常拼作“krona”，复数“kronor”。英语里谈到北欧货币时也会直接借用这些拼写。","写金额时常见格式如“50 kr”（kr 是常见缩写），但不同国家和场合写法会有差别。"]}
{"word":"kronen","summary":{"en":"“Kronen” is mainly a German/Dutch form: in German it means “crowns” (plural of Krone), and in Dutch it can mean “to crown.” It’s uncommon as a standard English word and often appears in names or quoted foreign text.","zh":"“Kronen”主要是德语/荷兰语形式：德语里指“王冠（复数）”，荷兰语里可表示“加冕”。它并非常见英语词，多见于名称或引用外语原文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German) plural of \"Krone\": crowns; also seen in names/titles (e.g., businesses, places, newspapers).","zh":"（德语）“Krone”的复数：王冠、皇冠；也常见于名称/标题中（如商号、地名、报纸名）。"},"examples":[{"en":"The museum displayed several old royal kronen (crowns).","zh":"博物馆展出了几顶古老的王室王冠（kronen）。"},{"en":"I recognized the word in the title \"Kronen Zeitung.\"","zh":"我在《Kronen Zeitung》（《皇冠报》）这个标题里认出了这个词。"}]},{"partOfSpeech":"v.","definition":{"en":"(Dutch) to crown; to place a crown on; to honor as the best/most important.","zh":"（荷兰语）加冕；为……戴上王冠；（比喻）使……成为最重要/最杰出的。"},"examples":[{"en":"They will kronen the winner at the end of the festival.","zh":"他们会在节日结束时为获胜者加冕。"},{"en":"Hard work can kronen a long career with success.","zh":"努力工作能让漫长的职业生涯以成功作结（“加冕”成功）。"}]}],"synonyms":["crowns","to crown"],"phonetic":"/ˈkroʊnən/","extraExplanation":["“Kronen”不是常见英语单词，更常见于德语或荷兰语语境中：\n- 德语：Krone=“王冠”，Kronen=“王冠们/多个王冠”。\n- 荷兰语：kronen=“加冕”。\n在英语文章里看到它，通常是专有名词（报纸名、品牌名、姓氏等）或引用外语原文。"]}
{"word":"kroner","summary":{"en":"Kroner means “crowns” and is the plural form of krone—the currency used especially in Denmark and Norway.","zh":"kroner意为“克朗（冠币）”，是krone的复数形式，尤指丹麦和挪威的货币单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic monetary unit of Denmark and Norway (plural: kroner); used in everyday prices and payments","zh":"丹麦和挪威的基本货币单位（复数：kroner）；用于日常标价与支付"},"examples":[{"en":"This coffee costs 45 kroner in Copenhagen.","zh":"在哥本哈根，这杯咖啡要45克朗。"},{"en":"I exchanged dollars for Norwegian kroner at the airport.","zh":"我在机场把美元换成了挪威克朗。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of krone, the currency unit used in several Scandinavian countries (e.g., Denmark, Norway)","zh":"krone（克朗）的复数形式；指斯堪的纳维亚一些国家使用的货币单位（如丹麦、挪威）"},"examples":[{"en":"Two kroner is a small coin in Denmark.","zh":"在丹麦，两克朗是一种小硬币。"},{"en":"Prices are listed in kroner, not euros.","zh":"价格用克朗标示，而不是欧元。"}]}],"synonyms":["krone (singular)","Danish kroner","Norwegian kroner"],"phonetic":"/ˈkroʊnər/","extraExplanation":["“Krone”在一些语境里也可指瑞典的货币单位（瑞典语拼写常见为krona，复数kronor）。而英语里“kroner”最常见是丹麦/挪威“krone”的复数。旅行时看清国家与货币代码：丹麦克朗 DKK，挪威克朗 NOK，瑞典克朗 SEK。"]}
{"word":"Kronia","summary":{"en":"an ancient Greek festival honoring Kronos, linked with harvest feasting and relaxed social order","zh":"古希腊祭祀克洛诺斯的节日，常与丰收宴饮及社会等级暂时放松相关"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Athenian festival honoring Kronos (Cronus), traditionally marked by feasting and a temporary relaxation of social hierarchies, sometimes including slaves dining with masters.","zh":"古雅典祭祀克洛诺斯（克罗诺斯）的节日；传统上以宴饮为主，并短暂放松社会等级差异，有时奴隶可与主人同席。"},"examples":[{"en":"In classical Athens, the Kronia was associated with harvest-time celebrations and communal meals.","zh":"在古典时期的雅典，Kronia 常与收获季的庆祝和共同用餐联系在一起。"},{"en":"Some sources describe the Kronia as a day when normal social rules were temporarily reversed.","zh":"一些资料描述 Kronia 是社会常规暂时“倒置”的一天。"}]}],"synonyms":["festival of Kronos","Cronia"],"phonetic":"/ˈkroʊniə/","extraExplanation":["Kronos（克洛诺斯）在希腊神话中是宙斯的父亲、泰坦之一。Kronia 常被理解为与农事/收获相关的节庆气氛，因此会出现“大家一起吃喝、身份界限变得更松”的描写。","英语里也常见拼写变体 Cronia（更贴近 Cronus 的拉丁化拼法），但 Kronia 更直接对应希腊语形式。"],"etymology":"源自古希腊语“Kronia”（Κρόνια），意为“属于克洛诺斯的（节日）”，由神名 Kronos（Κρόνος）派生而来。","mnemonic":["把它拆成“kron- + -ia”：kron- 联想到 Kronos（克洛诺斯），-ia 常见于“节日/活动名”（像 Olympia）。=> “克洛诺斯的节日”。","联想中文“农（nóng）事”收获季：Kronia 的氛围常和丰收宴饮联系在一起。"]}
{"word":"Kronian","summary":{"en":"connected to Kronos (and sometimes Saturn)","zh":"与克洛诺斯有关（有时也指与土星有关）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Kronos (Cronus), a Titan in Greek mythology, or to ideas associated with him (such as time, fathers and sons, generational conflict).","zh":"（形容词）与希腊神话中的克洛诺斯（Kronos/Cronus，泰坦神）有关的；或与其相关的观念（如时间、父子关系、代际冲突）有关的。"},"examples":[{"en":"In some modern poems, a Kronian father figure represents a fear of being replaced by the next generation.","zh":"在一些现代诗歌里，“Kronian式”的父亲形象常象征对被下一代取代的恐惧。"},{"en":"The essay reads the myth through a Kronian lens, focusing on power and succession.","zh":"这篇文章用“Kronian”的视角解读神话，强调权力与继承。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Saturn (associated with Kronos in later tradition), especially in astronomy or science-fiction contexts.","zh":"（形容词）与土星有关的（在后期传统中土星常与Kronos对应）；常见于天文学或科幻语境。"},"examples":[{"en":"The probe studied Kronian rings and moons for signs of unusual chemistry.","zh":"探测器研究土星（Kronian）的光环与卫星，寻找异常化学迹象。"},{"en":"The novel imagines a Kronian colony hidden beneath the clouds of Saturn.","zh":"小说想象在土星云层之下藏着一个“Kronian”的殖民地。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or being associated with Kronos/Saturn (rare).","zh":"（名词，少见）克洛诺斯/土星的追随者或相关者；与其有关的人或存在。"},"examples":[{"en":"In the story, the Kronians keep watch over the old temple.","zh":"在故事中，Kronians守望着那座古老的神庙。"}]}],"synonyms":["Saturnian","Cronian"],"phonetic":"/ˈkroʊniən/","extraExplanation":["文化提示：Kronos（Cronus）是希腊神话中的泰坦，最常见的故事线包括“推翻父亲乌拉诺斯”和“害怕被子女推翻而吞食子女”。在文学批评中，“Kronian”有时用来指代这种关于权力更替、代际焦虑的主题。","天文语境：英语里更常见的形容词是“Saturnian”。“Kronian”在科幻或较文学化的科学写作中也会出现，用来强调其神话意象。"],"etymology":"由希腊神名“Kronos（克洛诺斯）”加形容词后缀“-ian”（表示“……的/与……有关的”）构成；在一些传统中Kronos常与罗马神“Saturn（土星/农神）”对应，因此也可指“土星的”。","mnemonic":["把它拆开记：Kron(os) + -ian（……的）→“克洛诺斯的/土星的”。","联想中文：Kronian听起来像“克罗（Kro）+你安（nian）”，记成“克罗诺斯让你‘安’不下来（怕被推翻）”，对应他对继承的焦虑主题。"]}
{"word":"kronion","summary":{"en":"Kronion is a poetic name for Zeus meaning “son of Kronos.”","zh":"Kronion是宙斯的诗性称号，意为“克洛诺斯之子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Greek mythology and epic poetry) an epithet for Zeus meaning “son of Kronos (Cronus).”","zh":"（希腊神话与史诗用语）宙斯的称号，意为“克洛诺斯（Cronus）的儿子”。"},"examples":[{"en":"In Homer’s epics, Zeus is often called Kronion to emphasize his lineage.","zh":"在荷马史诗中，宙斯常被称为Kronion，以强调他的血统。"},{"en":"The poet invokes Kronion as the ruler of gods and humans.","zh":"诗人称呼Kronion，指这位统治众神与人类的神。"}]}],"synonyms":["Cronion","son of Kronos","Zeus (poetic epithet)"],"phonetic":"/ˈkroʊniən/","extraExplanation":["“Kronion”来自希腊语，属于史诗中的“固定称号/绰号”（epithet），常用于《伊利亚特》《奥德赛》等作品中，既能突出人物身份（宙斯是克洛诺斯之子），也能帮助诗歌在口头吟诵时保持节奏与韵律。","英文里也常见拼写变体“Cronion”（用C对应拉丁化拼写Cronus）。"]}
{"word":"kronor","summary":{"en":"Kronor is the plural form meaning Swedish crowns (money), used for amounts in Sweden.","zh":"kronor 指“瑞典克朗”的复数，用来表示瑞典货币金额。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of Swedish krona; a unit of money used in Sweden (SEK).","zh":"瑞典克朗（krona）的复数；瑞典使用的货币单位（SEK）。"},"examples":[{"en":"This jacket costs 799 kronor in Stockholm.","zh":"这件夹克在斯德哥尔摩卖799瑞典克朗。"},{"en":"I exchanged dollars for kronor at the airport.","zh":"我在机场把美元换成了瑞典克朗。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes used informally) the plural of krone, the currency unit in some Nordic countries; in English, “kronor” most often refers to Swedish money, while Norwegian/Danish usually use “kroner.”","zh":"（有时为非正式用法）北欧一些国家货币单位“krone”的复数；英语里“kronor”通常更常指瑞典货币，而挪威/丹麦通常写作“kroner”。"},"examples":[{"en":"He said he had a few thousand kronor saved from his trip, but he meant Swedish currency.","zh":"他说旅行后存了几千“kronor”，但他指的是瑞典货币。"},{"en":"In Norway you’ll usually see prices in kroner, not kronor.","zh":"在挪威你通常会看到标价用“kroner”，而不是“kronor”。"}]}],"synonyms":["Swedish crowns","SEK (Swedish kronor)"],"phonetic":"/ˈkroʊnɔr/","extraExplanation":["“krona/krone”在北欧语言里与“crown（王冠）”同源，所以这些货币名称常被理解为“王冠币”。","书写与符号：瑞典克朗常写作“SEK”或“kr”；金额里也常见“kr 100”。"]}
{"word":"Kronos","summary":{"en":"a Titan ruler in Greek mythology, father of Zeus","zh":"希腊神话中的泰坦统治者，宙斯之父"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the Titan who ruled during the “Golden Age” and is famous for overthrowing his father Uranus and later being overthrown by his son Zeus.","zh":"（希腊神话）泰坦神之一，“黄金时代”的统治者；以推翻父神乌拉诺斯、后来又被儿子宙斯推翻而闻名。"},"examples":[{"en":"In Greek myths, Kronos overthrew Uranus and became ruler of the Titans.","zh":"在希腊神话中，克洛诺斯推翻了乌拉诺斯，成为泰坦诸神的统治者。"},{"en":"Zeus eventually defeated Kronos and took power.","zh":"宙斯最终击败了克洛诺斯并夺取了权力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Commonly confused use) A name people sometimes connect with “time,” especially in modern writing, though the time-god is properly Chronos in Greek.","zh":"（常见混淆用法）现代写作中常被人联想到“时间”的名字；但希腊神话中严格来说“时间之神”是 Chronos（克罗诺斯/柯罗诺斯）而非 Kronos。"},"examples":[{"en":"Some modern stories treat Kronos as a symbol of time, mixing him up with Chronos.","zh":"一些现代故事把克洛诺斯当作“时间”的象征，这其实混淆了他与 Chronos。"}]}],"synonyms":["Cronus","Saturn"],"phonetic":"/ˈkroʊnɑːs/","extraExplanation":["文化提示：克洛诺斯最著名的情节之一是“吞食子女”——因为预言说他会被自己的孩子推翻，他就把孩子们吞下；但宙斯被母亲瑞亚救下，长大后迫使克洛诺斯吐出兄弟姐妹并夺取王位。此故事常被文学与艺术用来象征权力循环、恐惧与宿命。"],"etymology":"源自古希腊语 Κρόνος（Krónos）。在罗马神话传统中常被对应为 Saturn（萨图恩/土星神）。现代英语里有时因拼写相近而与 Chronos（时间）发生混淆。","mnemonic":["记忆法：Kronos 里有 “-nos”，可联想到“诺（预言/诺言）”→因为“预言”他会被儿子推翻。","易混点：Chronos（ch 开头）更常指“时间”；Kronos（k 开头）是“泰坦之王/宙斯之父”。"]}
{"word":"kronos","summary":{"en":"Kronos is a Titan in Greek mythology, best known as Zeus’s father. It is sometimes confused with Chronos, a figure associated with time.","zh":"Kronos 是希腊神话中的泰坦神，最有名的身份是宙斯之父。它有时会与代表“时间”的 Chronos 混淆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, Kronos (also spelled Cronus) is a Titan and the father of Zeus. He is known for overthrowing his father Uranus and later being overthrown by his own son, Zeus.","zh":"在希腊神话中，Kronos（也拼作 Cronus）是泰坦神之一、宙斯的父亲。他以推翻父亲乌拉诺斯（Uranus）以及后来被自己的儿子宙斯推翻而著名。"},"examples":[{"en":"In many versions of the myth, Kronos swallows his children to prevent them from taking his throne.","zh":"在许多版本的神话里，Kronos 吞下自己的孩子，以防他们夺走王位。"},{"en":"Zeus eventually defeats Kronos and becomes the ruler of the Olympian gods.","zh":"宙斯最终击败 Kronos，成为奥林匹斯诸神的统治者。"}]},{"partOfSpeech":"n.","definition":{"en":"A name sometimes (but often incorrectly) used to mean “time,” because it is confused with Chronos, the personification of time in some Greek traditions.","zh":"有时（但常常不准确）被用来表示“时间”，因为它容易与 Chronos（在一些希腊传统中代表“时间”的拟人化形象）混淆。"},"examples":[{"en":"The logo uses “Kronos” to suggest time, but the mythological time figure is usually called Chronos.","zh":"这个标志用 “Kronos” 来暗示时间，但神话里更常用来表示“时间”的形象通常叫 Chronos。"}]}],"synonyms":["Cronus"],"phonetic":"/ˈkroʊnɑːs/","extraExplanation":["很多英文资料会强调：Kronos/Cronus（泰坦神、宙斯之父）与 Chronos（时间的拟人化）不是同一个角色；只是拼写和读音相近，现代流行文化里常被混用。","英语里更常见的拼写是 Cronus；Kronos 是更贴近希腊语转写的一种写法。"]}
{"word":"Kronstadt","summary":{"en":"a place name: a Russian naval town near St. Petersburg; also an older German name for Brașov, Romania.","zh":"地名：俄罗斯圣彼得堡附近的海军城镇；也可指罗马尼亚布拉索夫的德语旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Russian port town and naval base on Kotlin Island, near St. Petersburg, historically important for the Baltic Fleet.","zh":"俄罗斯一座港口城镇与海军基地，位于圣彼得堡附近的科特林岛上，历史上是波罗的海舰队的重要据点。"},"examples":[{"en":"Kronstadt guards the sea approach to St. Petersburg.","zh":"喀琅施塔得守卫着通往圣彼得堡的海上通道。"},{"en":"The museum in Kronstadt tells the story of Russia’s naval history.","zh":"喀琅施塔得的博物馆讲述了俄罗斯的海军史。"}]},{"partOfSpeech":"n.","definition":{"en":"The historical German name for the city of Brașov in Romania (used especially in older texts).","zh":"罗马尼亚城市布拉索夫（Brașov）的德语旧称（多见于历史文献或旧文本）。"},"examples":[{"en":"In older German sources, Brașov is often called Kronstadt.","zh":"在较早的德语资料中，布拉索夫常被称为Kronstadt。"},{"en":"The guidebook explained that Kronstadt is the former German name of Brașov.","zh":"导游书解释说，Kronstadt是布拉索夫过去的德语名称。"}]}],"synonyms":["Brașov"],"phonetic":"/ˈkrɔːnʃtæt/","extraExplanation":["俄罗斯的喀琅施塔得（Kronstadt）在历史上以军港和要塞著名，常见于俄国/苏联海军史；其中“喀琅施塔得起义”（1921）也常在历史书中被提到。","在罗马尼亚语境里，现代通用名是Brașov；Kronstadt多用于德语历史文献、建筑与族群史（如外喀尔巴阡/特兰西瓦尼亚的德裔社群）相关材料。"],"etymology":"源自德语：Krone（王冠）+ Stadt（城市），字面义为“王冠之城”。该名称在不同历史语境中被用于俄罗斯的海军港口城镇，以及罗马尼亚布拉索夫的德语称呼。","mnemonic":["拆词记：Krone=“王冠” + Stadt=“城市”，联想“王冠城市”。","把Kronstadt想成“Crown+City（王冠之城）”，看到旧德语地名时更容易反应过来。"]}
{"word":"kronur","summary":{"en":"Kronur means “Icelandic krona” in the plural—amounts of Iceland’s currency.","zh":"kronur 是“冰岛克朗”的复数，用来表示冰岛货币的金额。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of Icelandic króna (ISK), the basic unit of money in Iceland; used to talk about amounts of Icelandic currency.","zh":"冰岛克朗（ISK，冰岛货币单位）的复数形式；用于表示冰岛货币的金额。"},"examples":[{"en":"The coffee cost 650 kronur.","zh":"这杯咖啡要650克朗。"},{"en":"I exchanged dollars for kronur at the airport.","zh":"我在机场把美元换成了克朗。"},{"en":"Prices are listed in kronur (ISK).","zh":"价格以克朗（ISK）标示。"}]}],"synonyms":["Icelandic króna","ISK","kronas","crowns (informal)"],"phonetic":"/ˈkroʊnʊr/","extraExplanation":["“krónur”来自冰岛语（Icelandic），是“króna”的复数。英语里更常见的写法是“krona/kronas”或直接写“Icelandic króna (ISK)”。在旅行或金融语境中，你也会看到缩写“ISK”。"]}
{"word":"kroo","summary":{"en":"“Kroo” is an older spelling of “Kru,” referring to the Kru people; historically it could also mean a hired work crew of sailors/dockworkers in West Africa.","zh":"“Kroo”是“Kru”的较旧拼写，指克鲁人；在历史语境中也可指西非受雇的水手/码头工人队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Kru (also spelled “Kroo”) people, an ethnic group mainly in Liberia and Côte d’Ivoire","zh":"克鲁人（也拼作“Kroo”），主要分布在利比里亚和科特迪瓦的一个民族成员"},"examples":[{"en":"The Kru/Kroo are known for a long tradition of seafaring.","zh":"克鲁人以悠久的航海传统而闻名。"},{"en":"A museum exhibit introduced Kru (Kroo) culture and history.","zh":"一场博物馆展览介绍了克鲁（Kroo）文化与历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a crew or group of workers in West Africa, especially dockworkers or sailors, often referring to Kru people hired for maritime work","zh":"（历史用法）西非的工人队/船员队，尤指码头工人或水手；常指受雇从事航海工作的克鲁人"},"examples":[{"en":"The ship hired a Kroo to help load cargo at the port.","zh":"那艘船在港口雇了一支“Kroo”工人队帮忙装货。"},{"en":"In older travel writing, you may see “Kroo boys” describing local seamen.","zh":"在较早的游记里，你可能会看到“Kroo boys”用来指当地水手。"}]}],"synonyms":["Kru","(historical) crew","dockworkers","sailors"],"phonetic":"/kruː/","extraExplanation":["“Kroo”常被认为是“Kru”的较旧或较殖民时期的拼写。历史上欧洲商船与殖民港口常雇用克鲁人从事航海、划艇、装卸等工作，因此“Kroo”在一些旧文献中也被用来泛指“码头/船上的雇工队”。在现代写作中，谈民族通常用“Kru”，并避免使用带有殖民色彩或可能物化群体的旧称（如“Kroo boys”），除非是在引用历史语境。"]}
{"word":"kroon","summary":{"en":"Kroon most commonly refers to Estonia’s former currency; in Dutch/Afrikaans it can mean “crown.”","zh":"kroon最常指爱沙尼亚的旧货币单位；在荷兰语/南非荷兰语中也可表示“王冠/皇冠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the former basic unit of money of Estonia, used before the euro (plural: kroons or kroon; ISO code: EEK).","zh":"（爱沙尼亚）旧货币单位，欧元启用前使用（复数：kroons 或 kroon；代码：EEK）。"},"examples":[{"en":"Before Estonia adopted the euro, prices were listed in kroons.","zh":"在爱沙尼亚改用欧元之前，商品价格用克朗（kroon）标价。"},{"en":"He exchanged 500 kroons at the bank.","zh":"他在银行兑换了500克朗（kroons）。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Dutch or Afrikaans contexts) “crown,” or something shaped like a crown; used mainly in names and local usage.","zh":"（在荷兰语或南非荷兰语语境中）“王冠/皇冠”；也可指形似王冠的东西，多见于专有名词或本地用法。"},"examples":[{"en":"In Afrikaans, “kroon” means “crown.”","zh":"在南非荷兰语里，“kroon”意为“王冠/皇冠”。"},{"en":"The company name includes the word Kroon.","zh":"这家公司的名字里包含“Kroon”这个词。"}]}],"synonyms":["Estonian kroon","EEK","crown (Dutch/Afrikaans meaning)"],"phonetic":"/kroʊn/","extraExplanation":["爱沙尼亚的kroon在1928年首次引入；苏联解体后于1992年重新启用，2004年加入欧盟后继续使用，直到2011年改用欧元。","“kroon”与英语crown同源：许多欧洲语言里表示“王冠”的词（如瑞典语/挪威语的krona、丹麦语krone）也被用作货币名称，象征王权与国家。"]}
{"word":"krooni","summary":{"en":"Krooni is an Estonian/Finnish word meaning “crown,” and it can also refer to the former Estonian currency (kroon).","zh":"krooni 是爱沙尼亚语/芬兰语词，可指“王冠”，也可用来指爱沙尼亚旧货币单位“克朗”（kroon）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Estonian/Finnish) “crown”; also used to refer to the former Estonian currency, the kroon (EEK).","zh":"（爱沙尼亚语/芬兰语）“王冠”；也可指爱沙尼亚曾经使用的货币单位“克朗”（kroon，EEK）。"},"examples":[{"en":"He wore a krooni during the festival (using an Estonian word for “crown”).","zh":"他在节日期间戴着一顶krooni（这里用的是爱沙尼亚语的“王冠”一词）。"},{"en":"Older documents mention prices in krooni (i.e., Estonian kroons).","zh":"一些较早的文件会用krooni来标价（也就是爱沙尼亚克朗）。"}]}],"synonyms":["crown","kroon"],"phonetic":"/ˈkroʊni/","extraExplanation":["“krooni”在爱沙尼亚语里常见于变格形式：例如“kroon”（主格）= 克朗/王冠，而“krooni”常是其属格或部分格形式，意思仍与“kroon”相关，具体要看句子语法位置。","爱沙尼亚货币“kroon”在2011年被欧元（EUR）取代；因此在历史、旅游或旧文件语境中更容易看到相关用法。"]}
{"word":"kroons","summary":{"en":"“Kroons” means multiple units of Estonia’s former currency, the kroon.","zh":"“kroons”指爱沙尼亚旧货币“kroon（克朗）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of kroon: the former basic unit of money of Estonia (replaced by the euro in 2011).","zh":"kroon 的复数形式：爱沙尼亚旧货币单位（2011年起由欧元取代）。"},"examples":[{"en":"Before Estonia adopted the euro, prices were listed in kroons.","zh":"在爱沙尼亚采用欧元之前，商品价格通常用 kroons（克朗）标示。"},{"en":"He exchanged 500 kroons at the bank.","zh":"他在银行兑换了500克朗（kroons）。"}]}],"synonyms":["Estonian crowns","EEK (currency code)"],"phonetic":"/kroʊnz/","extraExplanation":["“kroon”在英语里常译作“(Estonian) kroon / crown（克朗）”，与瑞典/挪威/丹麦的“krona/krone（克朗）”同源，词根与“crown（王冠）”有关。","爱沙尼亚克朗的国际货币代码是 EEK；爱沙尼亚于2011年加入欧元区后停止使用克朗。"]}
{"word":"Kropyvnytskyi","summary":{"en":"a central Ukrainian city and regional capital","zh":"乌克兰中部的一座州府城市"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in central Ukraine; the administrative center of Kirovohrad Oblast.","zh":"乌克兰中部的一座城市；基洛沃赫拉德州（Kirovohrad Oblast）的行政中心。"},"examples":[{"en":"Kropyvnytskyi is located in central Ukraine, south of Kyiv.","zh":"Kropyvnytskyi 位于乌克兰中部，在基辅以南。"},{"en":"The city was renamed Kropyvnytskyi in 2016 as part of Ukraine’s decommunization laws.","zh":"该城市于2016年更名为 Kropyvnytskyi，这是乌克兰“去共产主义化”法律的一部分。"}]}],"synonyms":["Kirovohrad"],"phonetic":"/ˌkrɑː.pɪvˈnɪt.skij/","extraExplanation":["发音与拼写：英语里常见多种拉丁字母拼写/转写（如 Kropyvnytskyi / Kropyvnyts'kyi 等），来自乌克兰语不同转写体系。","历史背景：该城在苏联时期名为 Kirovohrad（纪念苏联政治人物基洛夫）。2016年更名体现了乌克兰近年的地名去苏联化趋势。"],"etymology":"该地名为乌克兰语转写（Kropyvnytskyi）。2016年由旧名 Kirovohrad 改为现名，以纪念乌克兰戏剧家、演员与导演 Marko Kropyvnytskyi（马尔科·克罗皮夫尼茨基）。","mnemonic":["把它拆开记：Kro- + -pnyts- + -kyi，结尾 -kyi 很像许多乌克兰姓氏/地名的常见结尾（类似“某某的/某某相关”）。","联想“戏剧舞台”：城市以戏剧家 Kropyvnytskyi 命名，可以用“戏剧之城”来帮助记忆。"]}
{"word":"krosa","summary":{"en":"Not a standard English word; likely a misspelling or a proper noun.","zh":"不是标准英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“krosa” is not a standard English word. It may be a misspelling, a name/brand, or a word from another language. If you share the sentence or where you saw it, I can help identify the intended meaning.","zh":"“krosa” 不是标准英语单词；可能是拼写错误、姓名/品牌名，或来自其他语言的词。你如果提供原句或出处，我可以帮你判断它想表达的意思。"},"examples":[{"en":"I can’t find “krosa” in an English dictionary—could you show me the full sentence?","zh":"我在英语词典里找不到“krosa”——你能把完整句子发我吗？"},{"en":"Did you mean “Korea,” “cross,” or something else?","zh":"你是想写“Korea（韩国）”、“cross（穿越/交叉）”，还是别的词？"}]}],"phonetic":"/ˈkroʊsə/","extraExplanation":["在英语学习里，遇到这种“查不到的词”，最常见的情况是：\n1）拼写打错（比如少/多了一个字母）；\n2）专有名词（人名、地名、产品名、游戏ID）；\n3）外来语或某种语言的词被直接拿来用。\n你可以告诉我：它出现的平台/领域（游戏、医学、建筑、品牌等）+ 前后各一句，我就能更准确地帮你对照可能的正确词。"]}
{"word":"kroshka","summary":{"en":"a crumb or an affectionate “little one” (Russian)","zh":"（俄语）碎屑；也可作亲昵称呼“宝贝/小家伙”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small crumb or tiny piece (from Russian usage)","zh":"（源自俄语用法）面包屑；碎屑；一小块碎片"},"examples":[{"en":"There were kroshkas of bread on the table after breakfast.","zh":"早餐后桌上有一些面包屑。"},{"en":"He brushed the kroshkas off his shirt.","zh":"他把衬衫上的碎屑拍掉了。"}]},{"partOfSpeech":"n.","definition":{"en":"a term of endearment meaning “little one / dear,” used when addressing someone affectionately (Russian)","zh":"（俄语昵称）小宝贝；亲爱的；小家伙（用于亲昵称呼）"},"examples":[{"en":"“Kroshka, are you okay?” she asked gently.","zh":"“小宝贝，你还好吗？”她温柔地问。"},{"en":"In the novel, the mother calls her child “kroshka.”","zh":"在小说里，母亲称呼孩子为“kroshka（小宝贝）”。"}]}],"synonyms":["crumb","speck","bit","darling","sweetie","little one"],"phonetic":"/ˈkroʊʃkə/","extraExplanation":["这是俄语外来词（转写成拉丁字母：kroshka）。在英语语境里多出现在涉及俄语人物、文学或文化的文本中；日常英语更常用 crumb / crumbs 表达“面包屑”。如果作为昵称使用，通常保留俄语风味，带有亲昵、温柔的语气。"],"etymology":"来自俄语「крошка (kroshka)」，原意与「碎、弄碎」相关，可指“碎屑/小碎块”，也可引申为“个子小的人、可爱的小家伙”，常作昵称。","mnemonic":["联想中文“咔嚓（kacha）一碎就成渣”，kroshka 里有“碎屑/渣”的感觉。","把 kroshka 想成“可爱小颗粒”：既是小碎屑，也是“小宝贝”（小小的、惹人爱）。"]}
{"word":"krouchka","summary":{"en":"“Krouchka” is a nonstandard transliteration of a Russian word meaning “mug/cup.” In English, you usually say “mug.”","zh":"“krouchka”多为俄语“кружка”的非标准转写，意思是“马克杯/杯子”。英语里通常直接说“mug”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Borrowed/transliterated from Russian) a mug; a drinking cup, often for tea or beer.","zh":"（俄语音译/转写）杯子；马克杯（常用于喝茶或啤酒）。"},"examples":[{"en":"In some Russian stores, a “krouchka” refers to a mug for tea.","zh":"在一些俄语商店里，“krouchka”指的是用来喝茶的马克杯。"},{"en":"He bought a metal krouchka for camping.","zh":"他买了一个金属的“krouchka”用来露营。"}]}],"synonyms":["mug","cup","tankard"],"phonetic":"/ˈkruʒkə/","extraExplanation":["“krouchka”并不是常见的标准英语单词，更像是俄语“кружка”的一种拉丁字母转写/拼写变体。更常见的转写是“kruzhka”。","俄语“кружка”在日常生活里多指“马克杯/啤酒杯”。在英语语境中通常直接说“mug”或“cup”，除非你在强调俄语文化或引用俄语商品名称。"]}
{"word":"kroushka","summary":{"en":"Kroushka (often spelled “kroshka”) is a Russian-derived word meaning “little one/sweetie,” and less commonly “crumb.”","zh":"kroushka（更常写作 kroshka）源自俄语，常指“宝贝/小可爱”，较少见时也指“碎屑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Russian) a small child or a loved person; “little one,” “sweetie.”","zh":"（源自俄语）指小孩子或心爱的人；“小可爱 / 宝贝 / 亲爱的”。"},"examples":[{"en":"In the novel, the grandmother calls the girl “kroushka,” meaning “little one.”","zh":"在小说里，奶奶叫那个女孩“kroushka”，意思是“小宝贝”。"},{"en":"He texted, “Good night, kroushka,” using it as a term of affection.","zh":"他发短信说：“晚安，kroushka”，把它当作亲昵称呼。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common; Russian meaning) a crumb; a tiny piece of food.","zh":"（较少见；俄语含义）面包屑；食物碎屑。"},"examples":[{"en":"There were kroushka on the table after the cookies.","zh":"吃完饼干后，桌上有一些碎屑（kroushka）。"}]}],"synonyms":["kroshka","little one","sweetie","darling","crumb"],"phonetic":"/ˈkroʊʃkə/","extraExplanation":["“kroushka”常见于英语里的俄语文化语境，但更标准的转写通常是“kroshka”（俄语：крошка）。在俄语里既可以指“碎屑”，也可用作昵称，类似英语的“sweetie / little one”。","英语读者遇到它多半出现在小说、移民家庭对话、或带有俄罗斯/斯拉夫氛围的文本中；实际交流时最好确认对方是否熟悉这个称呼，以免显得突兀。"]}
{"word":"krs","summary":{"en":"“KRs” most often means “key results” in OKRs; it can also refer to the rapper KRS-One depending on context.","zh":"“KRs” 最常见指 OKR 里的“关键结果”；也可能在语境中指说唱歌手 KRS-One。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) key results; measurable outcomes used in the OKR (Objectives and Key Results) goal-setting method.","zh":"（缩写）关键结果；在 OKR（目标与关键结果）体系中用来衡量目标是否达成的可量化结果。"},"examples":[{"en":"Our objective is to improve customer satisfaction, and our KRs include raising the rating from 4.2 to 4.5.","zh":"我们的目标是提升客户满意度，关键结果包括把评分从 4.2 提高到 4.5。"},{"en":"Each team writes 2–5 KRs so progress is easy to track.","zh":"每个团队会写 2–5 个关键结果，方便追踪进度。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) KRS-One; an influential American hip-hop artist (stage name).","zh":"（专有名词）KRS-One；一位有影响力的美国嘻哈音乐人（艺名）。"},"examples":[{"en":"KRS-One is known for socially conscious lyrics.","zh":"KRS-One 以关注社会议题的歌词而出名。"}]}],"synonyms":["key results","metrics (in OKRs)","measures"],"phonetic":"/ˌkeɪ ˈɑːrz/","extraExplanation":["在职场语境里更常见的是 “KRs”，通常与 “OKRs” 连用：Objective 是方向/意图，KRs 必须是可衡量的数字或明确交付物（如“上线某功能”“营收增长到 X”），用来判断是否达成目标。","如果你指的是别的 “KRS”（例如学校系统、公司缩写、游戏/社群用语等），告诉我上下文，我可以按你的场景解释。"]}
{"word":"Kru","summary":{"en":"a respectful Thai term for a teacher or master","zh":"对老师、教练、师傅的泰语尊称"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Thailand) a respectful title for a teacher, instructor, or master, especially in traditional arts such as Muay Thai or dance.","zh":"（泰国）对老师、教练、师傅的尊称，常用于泰拳、舞蹈等传统技艺领域。"},"examples":[{"en":"Our kru taught us the basic Muay Thai stance before we started sparring.","zh":"我们的师傅先教我们泰拳的基本站姿，然后才开始对练。"},{"en":"Students bowed to the kru at the beginning of class.","zh":"学生在上课开始时向老师行礼。"}]},{"partOfSpeech":"n.","definition":{"en":"A teacher or trainer in some Southeast Asian cultural contexts, used as a loanword in English writing about the region.","zh":"（在英语中作外来词）指某些东南亚语境中的老师/教练，常见于介绍当地文化的英文文章。"},"examples":[{"en":"The travel guide explained that “kru” is used to address instructors politely.","zh":"旅游指南解释说，“kru”用于礼貌地称呼指导老师。"},{"en":"She interviewed a kru who specializes in classical Thai dance.","zh":"她采访了一位专攻泰国古典舞的老师。"}]}],"synonyms":["teacher","instructor","trainer","master","mentor"],"phonetic":"/kruː/","extraExplanation":["在泰拳馆里，人们常用“kru”或更正式的“khru”称呼教练；有时也会听到“Ajarn/Arjan”（更偏学术或资深老师的称呼）。在英文中写作“kru/khru”都可能出现，属于音译差异。"],"etymology":"源自泰语 ครู（khruu），意思是“老师/师傅”，英语中多作为文化相关借词使用，常见于泰国武术与传统艺术介绍。","mnemonic":["联想中文“师傅/老师”：看到 kru 就想到“苦练（kǔ liàn）的人带你练”，= 教练/师傅。"]}
{"word":"kru","summary":{"en":"“Kru” is mainly used as a Thai title meaning “teacher/instructor,” especially in Thailand-related contexts.","zh":"“Kru”主要用作泰语称谓，意思是“老师/教练”，多见于与泰国相关的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Thai title) a teacher or instructor; a respectful way to address someone who teaches, especially in Thailand (e.g., school teachers, music teachers, martial arts trainers).","zh":"（泰语称谓）老师、教练；在泰国用于尊称教师或授课者（如学校老师、音乐老师、武术教练等）。"},"examples":[{"en":"In Thailand, students often call their teacher “Kru” followed by the teacher’s name.","zh":"在泰国，学生常常用“Kru + 老师的名字”来称呼老师。"},{"en":"Our Muay Thai kru taught us the basic stance and footwork.","zh":"我们的泰拳教练（kru）教我们基本站姿和步法。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation in some contexts (not a standard English word), so the meaning depends on the field or community.","zh":"在某些语境中的缩写（不是标准英文单词）；具体含义取决于领域或社群。"},"examples":[{"en":"I saw “KRU” on the form, but it wasn’t explained—so I asked what it stood for.","zh":"我在表格上看到“KRU”，但没有解释，所以我去问它代表什么。"}]}],"synonyms":["teacher","instructor","coach"],"phonetic":"/kruː/","extraExplanation":["“Kru”（ครู）是泰语借词，常见于英语语境多与泰国文化相关（如泰拳、泰国音乐/舞蹈教学）。在泰国也有“Wai Kru”仪式（向老师致敬/谢师礼），体现对师长的尊重。","如果你指的是某个特定缩写（例如学校、机场代码、公司名、网络昵称等），给我一句原句或上下文，我可以帮你准确解释。"]}
{"word":"krubi","summary":{"en":"“Krubi” is usually a proper name (often the Hungarian artist Krúbi) or a context-dependent username/brand, not a standard English vocabulary word.","zh":"“Krubi”通常是专有名词（常指匈牙利艺人 Krúbi）或取决于语境的用户名/品牌名，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A stage name, most commonly referring to the Hungarian rapper/singer-songwriter “Krúbi” (often written without the accent as “Krubi”).","zh":"（专有名词）一个艺名，最常见指匈牙利说唱歌手/创作歌手“Krúbi”（常被写成不带重音符号的“Krubi”）。"},"examples":[{"en":"Krubi released a new song last week.","zh":"Krubi 上周发布了新歌。"},{"en":"I found Krúbi’s lyrics interesting, but they’re in Hungarian.","zh":"我觉得 Krúbi 的歌词很有意思，但它们是匈牙利语的。"}]},{"partOfSpeech":"other","definition":{"en":"(General use) A non-standard English word; it may be a username, nickname, brand name, or a misspelling. Meaning depends on context.","zh":"（一般用法）不是标准英语单词；可能是用户名、昵称、品牌名或拼写错误，具体含义取决于语境。"},"examples":[{"en":"My gaming handle is Krubi.","zh":"我的游戏昵称是 Krubi。"},{"en":"Did you mean “Krúbi” or something else by “krubi”?","zh":"你说的“krubi”是指“Krúbi”，还是别的意思？"}]}],"phonetic":"/ˈkruːbi/","extraExplanation":["“Krúbi”里的“ú”是匈牙利语的长元音；在英文环境中常被简化成“Krubi”。如果你是在聊天或作业里看到这个词，最好提供一句原文，我可以帮你判断它具体指人名、账号名，还是拼写错误。"]}
{"word":"krubis","summary":{"en":"“Krubis” isn’t a common English word; it’s likely a name or a misspelling.","zh":"“krubis”不是常见英语词；更可能是专名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a proper name (e.g., a username, surname, product name) or a misspelling of another word.","zh":"不是标准英语词汇；更可能是专有名词（如用户名、姓氏、品牌名等）或某个英语词的拼写错误。"},"examples":[{"en":"I couldn’t find “krubis” in major English dictionaries—could it be a name or a brand?","zh":"我在主流英语词典里找不到“krubis”——它会不会是名字或品牌？"},{"en":"If you meant “cruise,” the spelling is different.","zh":"如果你想写的是“cruise（乘船旅行/巡游）”，拼写不一样。"}]}],"phonetic":"/ˈkruːbɪs/","extraExplanation":["“krubis”在英语中没有常见、固定的词义。为了更准确地帮你：\n1）你是在什么句子/语境里看到的？\n2）是人名、地名、游戏ID、公司名，还是外来语？\n3）你是否想拼写：cruise, Kravis, Krebs, Krub (khrap) 等？\n把原句发我，我可以根据上下文判断最可能的意思与正确拼写。"]}
{"word":"krubut","summary":{"en":"“Krubut” isn’t a standard English word; it’s likely a misspelling or a name.","zh":"“krubut”不是标准英语词汇，更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name/username, or a word from another language.","zh":"不是标准英语单词，可能是拼写错误、人名/网名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “krubut” in an English dictionary—do you know where you saw it?","zh":"我在英语词典里找不到“krubut”——你是在哪里看到的？"},{"en":"If you meant a different spelling, please share the sentence so I can help you identify the word.","zh":"如果你想写的是另一种拼法，请把它所在的句子发我，我可以帮你确认。"}]}],"phonetic":"/ˈkruːˌbʌt/","extraExplanation":["“krubut”看起来更像是：①拼写错误（打字漏字/错位）；②专有名词（人名、地名、品牌、账号）；③外来语的转写。为了准确解释，我需要你提供：你在哪看到它（网页/游戏/聊天/作业）以及它前后的一整句话。","如果你是想表达礼貌用语，可能与你听到的泰语“krub/khrap（ครับ）”有关，但“krubut”本身并不是常见英语表达。"]}
{"word":"krubuts","summary":{"en":"“Krubuts” is likely a misspelling of “kibbutz,” a communal settlement in Israel.","zh":"“krubuts”很可能是“kibbutz”的拼写错误，指以色列的集体社区（基布兹）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A communal settlement in Israel where members traditionally share work, income, and resources (especially in farming, though many now have industry or other jobs).","zh":"（以色列的）基布兹：一种集体社区／公社式定居点，成员传统上共同劳动并共享收入与资源（早期多以农业为主，如今也常有工业或其他产业）。"},"examples":[{"en":"She volunteered on a kibbutz during her gap year.","zh":"她在间隔年期间去基布兹做志愿者。"},{"en":"Life on the kibbutz used to be based on shared property and shared responsibility.","zh":"基布兹的生活过去建立在共有财产与共同责任之上。"}]}],"synonyms":["commune","collective community"],"phonetic":"/kɪˈbʊts/","extraExplanation":["“krubuts”不是常见英文单词，最可能是把“kibbutz”拼错了（字母位置接近）。","kibbutz一词来自希伯来语，和以色列的社会与历史发展密切相关：早期强调集体劳动与平等分配；现代许多基布兹已更市场化，但仍保留社区特色。"]}
{"word":"Kruger","summary":{"en":"a Dutch/German-origin family name widely used in notable personal and place names","zh":"源自荷兰语/德语的姓氏，常见于知名人物与地名等专名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname of Dutch/German origin; it is best known in English through notable people and place names","zh":"一个源自荷兰语/德语的姓氏；在英语中常因知名人物或地名而被熟知"},"examples":[{"en":"In history class, we learned about Paul Kruger and South African politics in the late 1800s.","zh":"在历史课上，我们学习了保罗·克鲁格，以及19世纪末南非的政治。"},{"en":"They went on a safari in Kruger National Park.","zh":"他们在克鲁格国家公园参加了野生动物观赏之旅。"}]}],"phonetic":"/ˈkruːɡər/","extraExplanation":["在英语语境里，“Kruger”常指两类很有辨识度的专名：①人名（如南非历史人物 Paul Kruger）；②地名（尤其是南非的 Kruger National Park）。在阅读新闻、旅行攻略或历史材料时出现频率较高。","发音上，英语里常读作“KRU-ger”，重音在第一音节；第二音节里的 g 为硬音 /g/（类似“go”的 g）。"],"etymology":"多见于荷兰语/南非荷兰语与德语传统中的姓氏拼写。其对应的德语姓氏形式常写作“Krüger”，历史上与“制陶者、做陶罐/水壶的人（potter/jug maker）”等职业姓氏相关；英语中常以“Kruger”拼写出现。","mnemonic":["把它分成两段记：KRU + ger，读起来像“哭（kru） + 哥儿（ger）”，帮助记住重音在前面。","联想“Kruger National Park（克鲁格国家公园）”= 非洲野生动物、草原、狮子大象等画面，更容易把拼写和含义（专名）绑定。"]}
{"word":"krugerism","summary":{"en":"Krugerism means the political ideology or style associated with Paul Kruger, especially conservative Boer nationalism in late-19th-century South Africa.","zh":"Krugerism 指与保罗·克鲁格相关的政治理念或作风，尤指19世纪末南非德兰士瓦的保守布尔民族主义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the political ideas, policies, or style associated with Paul Kruger (1825–1904), especially conservative Boer/Afrikaner nationalism in the South African Republic (Transvaal) in the late 1800s","zh":"（历史用语）“克鲁格主义”：指与保罗·克鲁格（Paul Kruger）相关的政治思想、政策或作风，尤指19世纪末南非共和国（德兰士瓦）保守的布尔人/阿非利卡人民族主义倾向"},"examples":[{"en":"Some British writers blamed rising tensions in the Transvaal on Krugerism.","zh":"一些英国作家把德兰士瓦局势紧张的加剧归咎于“克鲁格主义”。"},{"en":"In the debate, Krugerism was contrasted with more liberal, pro-British reform proposals.","zh":"在这场辩论中，“克鲁格主义”与更自由、更亲英的改革方案形成对比。"}]}],"synonyms":["Kruger’s policies","Boer nationalism (contextual)","Afrikaner nationalism (contextual)"],"phonetic":"/ˈkruːɡərɪzəm/","extraExplanation":["“Krugerism”是一个带明显历史语境的词，主要出现在关于南非布尔战争（Boer War）前后政治的英语史料或评论中。它来自人名 Paul Kruger + 后缀 -ism（表示“主义/风格/倾向”），常带批评意味，指保守、排外、强调布尔人自治与反英立场等。现代日常英语中很少使用，更多见于历史写作或学术讨论。"]}
{"word":"krugerite","summary":{"en":"“Krugerite” is a rare specialist term, mainly used as a mineral name in geology/mineralogy rather than everyday English.","zh":"“Krugerite”是一个罕见的专业词，主要作为地质/矿物学中的矿物名称使用，而非日常英语用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very rare technical term used as a name for a mineral; it is not a common word in everyday English and is usually seen only in geology/mineralogy contexts.","zh":"一个非常罕见的专业术语，用作某种矿物的名称；在日常英语中几乎不使用，通常只出现在地质学/矿物学语境中。"},"examples":[{"en":"The report lists krugerite among several rare minerals found in the sample.","zh":"报告把 krugerite 列为样品中发现的几种稀有矿物之一。"},{"en":"I couldn’t find “krugerite” in general dictionaries; it seems to be a specialist mineral name.","zh":"我在普通词典里找不到 “krugerite”；它似乎是矿物学领域的专门名称。"}]}],"phonetic":"/ˈkruːɡəraɪt/","extraExplanation":["“krugerite”不属于常见英语词汇，因此在大型通用词典里可能查不到。它更像是某个矿物（或矿物变种）的专有名称，具体指哪一种会因资料来源而异。","如果你能提供出处（例如：论文标题、句子上下文、或你看到它的网页/书籍领域），我可以更准确地给出该矿物的成分信息、命名来源，以及在中文里常见的对应译名。"]}
{"word":"kruisen","summary":{"en":"“kruisen” is a Dutch verb meaning “to cross,” “to intersect,” or sometimes “to cruise around slowly.”","zh":"“kruisen”是荷兰语动词，常指“穿过/横渡”“相交/交叉”，有时也可指“慢慢兜行/巡航”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Dutch) to cross; to go across (a road, river, etc.).","zh":"（荷兰语）穿过；横渡（道路、河流等）。"},"examples":[{"en":"We need to kruisen the river before it gets dark.","zh":"我们得在天黑前横渡那条河。"},{"en":"Be careful when you kruisen the street—look both ways.","zh":"过马路（kruisen）时要小心——左右都要看。"}]},{"partOfSpeech":"v.","definition":{"en":"(Dutch) to intersect; to cross each other (lines, routes, paths).","zh":"（荷兰语）相交；交叉（线、路线、路径）。"},"examples":[{"en":"Two hiking trails kruisen near the old church.","zh":"两条徒步小径在老教堂附近交叉。"},{"en":"Their shipping routes kruisen in the narrow channel.","zh":"他们的航线在狭窄的海峡处交汇。"}]},{"partOfSpeech":"v.","definition":{"en":"(Dutch) to cruise; to travel around slowly (often by car/ship), sometimes looking for something.","zh":"（荷兰语）巡航；慢慢兜行（常指开车/乘船四处转，有时带有“寻找目标”的含义）。"},"examples":[{"en":"On weekends they kruisen along the coast in their car.","zh":"周末他们开车沿着海岸兜风（kruisen）。"},{"en":"The boats kruisen through the harbor at sunset.","zh":"夕阳时分，船只在港口里巡航（kruisen）。"}]}],"synonyms":["cross","intersect","cruise"],"phonetic":"/ˈkrɔɪzən/","extraExplanation":["“kruisen”是荷兰语动词，来自名词“kruis”（十字、交叉），因此常见核心意思是“交叉/穿越”。","发音在荷兰语里“ui”的元音比较特殊，英语里没有完全对应；上面的音标是给英语学习者的近似读法。"]}
{"word":"kruller","summary":{"en":"A kruller is a fried pastry/doughnut, often the light “French cruller” in U.S. English.","zh":"Kruller 指一种油炸点心/甜甜圈；在美式英语中多指轻盈蓬松的法式脆麻花圈（French cruller）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of fried pastry (doughnut), often twisted or ridged; in the U.S. it commonly refers to a light, airy “French cruller” made from choux pastry.","zh":"一种油炸点心（甜甜圈/油炸面团），常见为扭结或有纹路的形状；在美国常指较轻盈蓬松的“法式脆麻花圈（French cruller）”，多用泡芙面糊制成。"},"examples":[{"en":"I grabbed a French cruller and a coffee on my way to work.","zh":"我上班路上买了一个法式脆麻花圈和一杯咖啡。"},{"en":"This kruller is lighter than a regular yeast doughnut.","zh":"这个脆麻花圈比普通的酵母甜甜圈更轻盈。"}]}],"synonyms":["cruller","doughnut","fried pastry"],"phonetic":"/ˈkrʌlər/","extraExplanation":["“Kruller”来自丹麦语/挪威语等北欧语言，原意与“卷曲、扭转的形状”有关，因此这种点心常见扭结或条纹的造型。","在美国常见搭配是“French cruller”（法式脆麻花圈），外形像带沟槽的环状，口感更空气感；在北欧地区的“kringle/kruller”家族点心形态与配方可能不同。"]}
{"word":"krullers","summary":{"en":"“Krullers” usually means “crullers”: a kind of twisted or ridged doughnut.","zh":"“krullers”通常指“crullers”：一种扭结或有纹路的甜甜圈类油炸点心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of twisted or ridged fried pastry (a kind of doughnut), often glazed or dusted with sugar; “krullers” is a common misspelling of “crullers.”","zh":"一种扭结状或有条纹的油炸甜点（类似甜甜圈），常裹糖霜或撒糖粉；“krullers”常见于“crullers”的误拼。"},"examples":[{"en":"I bought two crullers and a coffee for breakfast.","zh":"我买了两个扭结甜甜圈和一杯咖啡当早餐。"},{"en":"The bakery’s French crullers are light and airy.","zh":"那家面包店的法式扭结甜甜圈很轻盈、口感蓬松。"}]}],"synonyms":["doughnut","donut","French cruller"],"phonetic":"/ˈkrʌlər/","extraExplanation":["“cruller”在北美常指甜甜圈的一种；其中“French cruller（法式扭结甜甜圈）”通常用泡芙面糊（choux pastry）油炸，口感更轻、更空；而有些“cruller”则更像普通面团甜甜圈。","词源上与荷兰语等欧洲语言中表示“卷曲/扭转”的词有关，因此常见外形是扭结或环形带纹路。"]}
{"word":"kruman","summary":{"en":"“Kruman” means a sailor or worker from the Kru people, especially in historical West African maritime contexts.","zh":"“kruman”指克鲁族出身的水手或劳工，多用于历史上的西非航海语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sailor or worker from the Kru people (mainly from present-day Liberia and Côte d’Ivoire), historically hired on European ships and along the West African coast","zh":"克鲁人水手／工人（指来自克鲁族的非洲水手或劳工；历史上常受雇于欧洲船只与西非沿岸航运）"},"examples":[{"en":"In the 1800s, many ships on the West African coast hired Krumen as skilled boatmen.","zh":"在19世纪，许多在西非沿岸航行的船只会雇用克鲁人水手作为熟练的划船手。"},{"en":"The novel mentions a Kruman guiding the crew safely through the surf.","zh":"小说提到一位克鲁人水手带领船员安全穿过浪区。"}]}],"synonyms":["Kru man","Kru sailor","Kru worker"],"phonetic":"/ˈkruːmən/","extraExplanation":["“Kruman”也常见作复数“Krumen”，或写作“Kru man”。这个词主要出现在18—20世纪的航海、殖民史与旅行记述中，现代日常英语里很少使用。","在当代语境中，更中性、准确的说法通常是“Kru sailor / Kru worker”或直接说“a sailor from the Kru people”。","在一些旧文献里该词可能带有殖民时代的视角；阅读历史文本时可以注意语境与语气。"]}
{"word":"krumhorn","summary":{"en":"A krumhorn is a curved Renaissance woodwind instrument with a capped double reed and a buzzy, nasal tone.","zh":"krumhorn 指一种文艺复兴时期的弯曲木管乐器，带风帽双簧片，音色嗡嗡且带鼻音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Renaissance wind instrument with a capped double reed and a curved shape, known for its buzzing, nasal sound","zh":"（文艺复兴时期的）克鲁姆号；一种带“盖帽”双簧片、外形弯曲的木管乐器，以嗡嗡的鼻音音色著称"},"examples":[{"en":"The early music ensemble added a krumhorn to give the dance a rustic color.","zh":"这支古乐团加入了克鲁姆号，让这段舞曲更有乡野气息。"},{"en":"In class, we compared the krumhorn’s sound with the recorder’s clearer tone.","zh":"课堂上，我们把克鲁姆号的音色和竖笛更清亮的音色作了比较。"}]}],"synonyms":["crumhorn"],"phonetic":"/ˈkrʌmˌhɔrn/","extraExplanation":["“krumhorn”更常见的拼写是“crumhorn”。词源来自德语“Krum(m)horn”，意为“弯曲的角（horn）”，指它标志性的弯曲外形。","它属于“带风帽（capped reed）”的双簧类：簧片被罩在风帽里，演奏者不直接用嘴唇控制簧片，因此音量与音色控制不如双簧管那样灵活，但音色很有辨识度，常用于文艺复兴/早期音乐复原演出。"]}
{"word":"krummholz","summary":{"en":"Krummholz is a belt of low, twisted trees/shrubs shaped by harsh wind and cold near the treeline.","zh":"Krummholz 指林线附近因风寒而矮小扭曲、贴地生长的矮曲林带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stunted, twisted trees or dense shrubs that grow near the upper edge of forests (the treeline) in cold, windy mountain or polar regions.","zh":"（多指在寒冷多风的高山或极地林线附近生长的）矮曲林；被风寒压制而矮小、扭曲的树木或灌木丛。"},"examples":[{"en":"Above the treeline, krummholz forms low, wind-shaped mats of spruce and fir.","zh":"在林线以上，矮曲林会形成贴地生长、被风塑形的云杉和冷杉丛。"},{"en":"We sheltered behind the krummholz to escape the strongest gusts.","zh":"我们躲在矮曲林后面，避开最猛烈的阵风。"}]}],"synonyms":["wind-sculpted trees","stunted trees","scrub (in alpine context)"],"phonetic":"/ˈkrʊmhoʊlts/","extraExplanation":["“Krummholz”源自德语：krumm（弯曲的）+ Holz（木头/林木）。在英语里常用于生态学与地理写作，强调树木因强风、低温、冰雪与贫瘠土壤而长期受压，呈现“矮、密、弯、贴地”的形态。","相关概念：treeline（林线）、alpine tundra（高山苔原）、wind-pruned（被风‘修剪’的）。在一些自然写作中，krummholz常被用来营造“严酷环境中的顽强生命力”这一意象。"]}
{"word":"krummhorn","summary":{"en":"A curved Renaissance double-reed woodwind with a distinctive buzzing tone.","zh":"一种弯曲的文艺复兴双簧木管乐器，音色嗡鸣且很有特色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Renaissance-era double-reed woodwind instrument with a curved shape and a covered reed, producing a nasal, buzzing sound.","zh":"一种文艺复兴时期的双簧木管乐器，外形弯曲、簧片被罩住，音色带有鼻音与嗡鸣感。"},"examples":[{"en":"The early-music ensemble added a krummhorn to recreate a 16th-century sound.","zh":"这支古乐团加入了克鲁姆号，以重现16世纪的声音风格。"},{"en":"Compared with the recorder, the krummhorn sounds more reedy and buzzy.","zh":"和竖笛相比，克鲁姆号的音色更像簧片、也更嗡鸣。"}]}],"synonyms":["crumhorn","cromorne"],"phonetic":"/ˈkrʊmˌhɔrn/","extraExplanation":["“krummhorn”来自德语：krumm（弯的）+ Horn（号/角），名称就描述了它弯曲的外形。","它的簧片被放在风帽（windcap）里，演奏者不会直接用嘴唇控制簧片，因此音量与表情变化通常不如双簧管那样灵活，但音色很有辨识度。","你也可能看到拼写变体“crumhorn”或“cromorne”，都指同一种（或非常接近的）乐器。"]}
{"word":"krumping","summary":{"en":"an intense, expressive street dance style (or doing it)","zh":"一种强烈、富表现力的街舞风格（或跳这种舞）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-energy street dance style with sharp, exaggerated, and expressive movements, often used to show strong emotion.","zh":"一种高能量的街舞风格，动作夸张有力、节奏强烈，常用来表达强烈情绪。"},"examples":[{"en":"She learned krumping to improve her freestyle performance.","zh":"她学了 krumping 来提升自己的即兴舞蹈表现。"},{"en":"Krumping is known for powerful chest pops and fast arm swings.","zh":"Krumping 以强烈的胸部震动和快速的手臂挥动而闻名。"},{"en":"The battle ended with both dancers krumping at full intensity.","zh":"这场斗舞最后以两位舞者火力全开地跳 krumping 收尾。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of doing the dance style “krump”; dancing in that style.","zh":"以 krump 风格跳舞；跳 krumping 的行为。"},"examples":[{"en":"We spent the afternoon krumping in the studio.","zh":"我们整个下午都在舞室里跳 krumping。"},{"en":"He started krumping after watching videos online.","zh":"他看了网上的视频后开始练 krumping。"}]}],"synonyms":["street dance","freestyle dance","urban dance","battle dance"],"phonetic":"/ˈkrʌm.pɪŋ/","extraExplanation":["Krumping 常与 “clowning”（小丑舞）有历史关联：它在社区派对与街头斗舞中发展出来，强调情绪释放、力量感与个人风格。","在流行文化中，纪录片《Rize》（2005）让更多人认识了这种舞蹈与其社会背景。"],"etymology":"源自美国洛杉矶2000年代初的街舞文化，“krumping”来自动词/名词“krump”。有人把 KRUMP 解释为 “Kingdom Radically Uplifted Mighty Praise”的缩写，但多被认为是后来为了赋义而产生的“回造缩写”（backronym）；实际用法更像是对“猛烈、爆发式动作”的拟声与口语化命名。","mnemonic":["联想中文“狂蹦/狂甩”：krump 的感觉像在音乐里“狂蹦”爆发，动作又“甩”得很猛。","记发音：krump 近似“克朗普”，想象“克”住不住的能量要“砰”地爆出来。"]}
{"word":"kruppaz","summary":{"en":"“kruppaz” isn’t a standard English word; it’s likely a name, username, or a misspelling of “Krupp” or “croup.”","zh":"“kruppaz”不是标准英语词；更可能是名字/用户名，或是“Krupp”或“croup”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/unclear term: “kruppaz” is not a common English word. It may be a username, a brand/name, or a misspelling/variant of “Krupp” (a German industrial family/company name) or “croup” (a children’s illness).","zh":"非标准/含义不明确的词：“kruppaz”不是常见英语词。它可能是用户名、品牌/姓名，或是“Krupp”（德国工业家族/公司名）或“croup”（儿童喉炎/哮吼）的拼写变体。"},"examples":[{"en":"I couldn’t find a standard dictionary meaning for “kruppaz”—is it a name or slang from a specific community?","zh":"我在标准词典里找不到“kruppaz”的释义——它是名字还是某个圈子里的俚语？"},{"en":"If you meant “Krupp,” it’s often used as a proper name in historical contexts.","zh":"如果你想写的是“Krupp”，它常作为专有名词出现在历史语境中。"}]}],"phonetic":"/ˈkrʌpəz/","extraExplanation":["如果你能提供一句包含“kruppaz”的原句（例如聊天内容、歌词或游戏里看到的用法），我可以更准确判断它的意思与语气。","“Krupp”（克虏伯）在英语里多作为专有名词出现，常与德国工业史、军工与19–20世纪欧洲历史相关；而“croup”则是常见医学词，指儿童呼吸道症状（犬吠样咳嗽）。"]}
{"word":"kryo","summary":{"en":"Kryo is mainly known as a fast, compact serialization library for Java and related JVM languages.","zh":"Kryo 主要指一个用于 Java 及 JVM 语言的快速、紧凑的序列化库。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Java serialization library (often used with Kotlin/Scala too) for converting objects to bytes and back, designed to be fast and compact.","zh":"一个用于 Java（也常用于 Kotlin/Scala）的对象序列化库，把对象转换成字节并可再还原，特点是速度快、体积小。"},"examples":[{"en":"We use Kryo to serialize objects before sending them over the network.","zh":"我们用 Kryo 在通过网络发送之前把对象序列化。"},{"en":"Kryo can be faster than Java’s built-in serialization in many cases.","zh":"在很多情况下，Kryo 比 Java 自带的序列化更快。"},{"en":"Make sure to register your classes with Kryo to improve performance.","zh":"为提升性能，确保把你的类在 Kryo 里注册（register）。"}]}],"synonyms":["serialization library","object serialization"],"phonetic":"ˈkraɪ.oʊ","extraExplanation":["Kryo 不是常见英语单词，更常见的是作为软件库/项目名出现。它的名字常被认为与希腊语词根“kryos”（意为“寒冷”）有关，类似的英语词根是 cryo-（如 cryogenics“低温学/冷冻技术”）。"]}
{"word":"kryokonite","summary":{"en":"Cryoconite is dark dust on glaciers that absorbs sunlight and helps melt the ice, often forming small “cryoconite holes.”","zh":"Cryoconite（冰尘）是冰川上的黑色粉尘，会吸收阳光、促进融冰，并常形成“冰尘洞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dark dust-like material (often a mix of mineral particles, soot, and microbes) found on the surface of glaciers; it absorbs sunlight and can melt small holes in the ice.","zh":"冰川表面的黑色粉尘状物质（常由矿物颗粒、烟尘和微生物混合组成）；它会吸收阳光并使冰面融化形成小洞。"},"examples":[{"en":"Scientists studied cryoconite to understand how it speeds up glacier melting.","zh":"科学家研究冰尘（cryoconite），以了解它如何加速冰川融化。"},{"en":"After a warm week, cryoconite holes became deeper on the glacier surface.","zh":"经历了一周的暖天气后，冰川表面的冰尘洞变得更深了。"}]}],"synonyms":["glacial dust","soot (in context)","mineral dust (in context)"],"phonetic":"/ˌkraɪ.oʊˈkɑː.naɪt/","extraExplanation":["你输入的“kryokonite”更常见的拼写是 **cryoconite**（学术与科普写作中普遍使用）。","词源上，cryoconite 常被解释为由表示“冰/寒冷”的词根 **cryo-** 与表示“尘埃”的成分组合而来，因此常被译为“冰尘”。","在冰川学里常见搭配是 **cryoconite holes**（冰尘洞）：黑色颗粒吸热，融出一个小坑，坑底聚集更多颗粒与微生物，形成独特的小生态环境。"]}
{"word":"kryolite","summary":{"en":"Cryolite: a rare mineral (sodium aluminum fluoride) historically used in aluminum production.","zh":"冰晶石：一种稀有矿物（氟铝酸钠），历史上常用于铝的生产冶炼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (sodium aluminum fluoride) once used widely in making aluminum because it helps lower the melting point of the ore mixture","zh":"一种稀有矿物（冰晶石，主要成分为氟铝酸钠），曾广泛用于铝的冶炼，因为它能降低矿料混合物的熔点"},"examples":[{"en":"Cryolite was historically important in aluminum smelting.","zh":"冰晶石在历史上对铝的冶炼非常重要。"},{"en":"Scientists studied cryolite deposits in Greenland.","zh":"科学家研究了格陵兰的冰晶石矿床。"}]}],"synonyms":["cryolite","sodium aluminum fluoride","Na3AlF6"],"phonetic":"/ˈkraɪəˌlaɪt/","extraExplanation":["“kryolite”更常见的拼写是“cryolite”。词源来自希腊语：kryos（寒冷）+ lithos（石头），因其外观像冰而得名。","在工业上，冰晶石常作为助熔剂用于电解铝（霍尔–埃鲁法工艺），帮助氧化铝在较低温度下更容易熔融并导电。如今多用人工合成冰晶石替代天然矿。"]}
{"word":"kryolites","summary":{"en":"“Cryolites” is the plural of “cryolite,” a rare mineral historically used in aluminum production.","zh":"“cryolites”是“cryolite（冰晶石）”的复数，指一种曾用于炼铝的稀有矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare, soft mineral (sodium aluminum fluoride) once widely used in making aluminum and in some glass/ceramic processes; “cryolites” is the plural form.","zh":"一种稀有、较软的矿物（冰晶石；主要成分为氟化铝钠），曾广泛用于炼铝以及某些玻璃/陶瓷工艺中；“cryolites”为其复数形式。"},"examples":[{"en":"Cryolite was once important in the aluminum industry.","zh":"冰晶石曾在炼铝工业中非常重要。"},{"en":"Scientists analyzed the cryolites found near the old mine.","zh":"科学家分析了在旧矿区附近发现的冰晶石（复数）。"},{"en":"The museum display explains how cryolite helped lower the melting point in early aluminum production.","zh":"博物馆展板解释了冰晶石如何在早期炼铝中帮助降低熔点。"}]}],"synonyms":["sodium aluminum fluoride"],"phonetic":"/ˈkraɪəˌlaɪt/","extraExplanation":["“cryolite”一词来自希腊语词根：cryo-（寒冷）+ lithos（石头），因为它最早被描述时与“像冰一样”的外观有关。","历史上，格陵兰（Greenland）曾有著名矿床；冰晶石在霍尔-埃鲁法（Hall–Héroult process）相关的炼铝技术中起过关键作用（作为助熔/溶剂材料），后来多被人造替代品取代。","拼写提示：你输入的“kryolites”常见于把 c 写成 k 的误拼；标准拼写是 “cryolites”（复数），单数是 “cryolite”。"]}
{"word":"kryolith","summary":{"en":"Kryolith is a rare spelling of cryolite, a mineral used historically in aluminum smelting.","zh":"kryolith 是 cryolite（冰晶石）的少见拼写，冰晶石曾在铝冶炼中具有重要用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral (sodium aluminum fluoride) also spelled **cryolite**, historically important in aluminum production.\nExamples:\n1) En: Cryolite (kryolith) was once mined in Greenland.  Zh: 冰晶石（kryolith/cryolite）曾在格陵兰被开采。\n2) En: The smelting process used cryolite to lower the melting point of alumina.  Zh: 冶炼过程中会用冰晶石来降低氧化铝的熔点。","zh":"一种矿物（氟铝酸钠），英文常见拼写为 **cryolite**（kryolith 为变体拼写），历史上在铝的冶炼中很重要。\n例句：\n1) En: Cryolite (kryolith) was once mined in Greenland.  Zh: 冰晶石（kryolith/cryolite）曾在格陵兰被开采。\n2) En: The smelting process used cryolite to lower the melting point of alumina.  Zh: 冶炼过程中会用冰晶石来降低氧化铝的熔点。"},"examples":[{"en":"Cryolite (kryolith) was once mined in Greenland.","zh":"冰晶石（kryolith/cryolite）曾在格陵兰被开采。"},{"en":"The smelting process used cryolite to lower the melting point of alumina.","zh":"冶炼过程中会用冰晶石来降低氧化铝的熔点。"}]}],"synonyms":["cryolite"],"phonetic":"/ˈkraɪ.əˌlaɪt/","extraExplanation":["“kryolith”在英语里比较少见，更常用的标准拼写是 **cryolite**。在阅读科学史、矿物学资料或北欧/德语相关文本时，可能会看到这种拼写差异。","词源可追溯到希腊语：*kryos*（冰冷）+ *lithos*（石头），对应它“像冰一样”的外观。"]}
{"word":"kryoliths","summary":{"en":"Kryoliths (more commonly spelled cryolites) are rare minerals used historically in aluminum production.","zh":"kryoliths（更常写作 cryolites）指“冰晶石”这种稀有矿物，历史上常用于炼铝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of (kryolith/cryolite): a rare mineral (sodium aluminum fluoride) once used to help melt aluminum ore in the production of aluminum.","zh":"（kryolith/cryolite 的复数）一种稀有矿物“冰晶石”（氟化铝钠），过去常用于冶炼铝时帮助降低氧化铝的熔点。"},"examples":[{"en":"In older textbooks, kryoliths are mentioned as an important material in early aluminum smelting.","zh":"在较早的教材里，常会提到冰晶石（kryoliths）在早期炼铝中的重要作用。"},{"en":"Natural kryoliths are rare, so modern industry often uses synthetic substitutes.","zh":"天然冰晶石（kryoliths）很稀少，因此现代工业常用人工合成的替代品。"}]}],"synonyms":["cryolites","cryolite (plural)"],"phonetic":"/ˈkraɪəˌlaɪts/","extraExplanation":["“kryolith(s)”是“cryolite(s)”的较少见拼写变体，常见于某些欧洲语言/资料（例如受德语拼写影响）。英文里更常用 cryolite / cryolites。","冰晶石历史上与格陵兰（Greenland）的矿藏联系很深；它在霍尔-埃鲁法（Hall–Héroult process）等炼铝工艺的发展中曾非常关键。现在多用人造冰晶石或其他氟盐体系来替代天然矿。"]}
{"word":"krypsis","summary":{"en":"Krypsis means an organism’s camouflage—staying hidden by blending into its environment.","zh":"Krypsis 指生物通过与环境融合来隐藏自己的一种“伪装/隐蔽”策略。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) The ability of an organism to avoid being seen or recognized by blending in with its surroundings; camouflage or concealment.","zh":"（生物学）生物通过与环境融为一体来避免被发现或被识别的能力；伪装、隐蔽。"},"examples":[{"en":"The moth survives by krypsis, resting on tree bark that matches its wing pattern.","zh":"这只飞蛾靠隐蔽（krypsis）生存，它停在与翅膀花纹相似的树皮上。"},{"en":"In winter, the hare’s white fur is a form of krypsis in snowy landscapes.","zh":"冬天野兔的白色毛皮是在雪地环境中的一种隐蔽（krypsis）。"}]}],"synonyms":["camouflage","concealment","crypsis","disguise","stealth"],"phonetic":"/ˈkrɪpsɪs/","extraExplanation":["词源来自希腊语 *kryptos*（“隐藏的”），也和常见词根 **crypt-** 有关，如 *cryptic*（神秘难懂的）和 *encrypt*（加密）。","在动物行为与演化语境里，**krypsis** 常与 **aposematism**（警戒色：用鲜艳颜色警告天敌“我有毒/不好吃”）形成对比：一个是“躲起来”，一个是“显眼地警告”。","学术写作中也常见形容词 **cryptic**（隐蔽的、难以察觉的）来描述“具有 krypsis 的”体色或行为。"]}
{"word":"kryptic","summary":{"en":"“Cryptic” means mysterious or hard to understand because the meaning is hidden or unclear.","zh":"“cryptic”表示“意思隐藏或不清晰，因此显得神秘、难懂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a hidden or unclear meaning; difficult to understand because it is mysterious, brief, or coded.","zh":"含义隐晦的；难以理解的（因为神秘、简略或像密码一样）。"},"examples":[{"en":"Her message was so cryptic that I didn’t know what she wanted.","zh":"她的信息太隐晦了，我不知道她想要什么。"},{"en":"The note contained a cryptic warning: “Don’t trust the smile.”","zh":"纸条上有一句隐晦的警告：“别相信那个微笑。”"},{"en":"He gave a cryptic answer and changed the subject.","zh":"他给了一个含糊隐晦的回答，然后换了话题。"}]}],"synonyms":["mysterious","enigmatic","obscure","puzzling","ambiguous"],"phonetic":"/ˈkrɪptɪk/","extraExplanation":["“kryptic”通常是“cryptic”的拼写错误或非标准拼写；标准拼写是 cryptic。","词源与“crypto-（隐藏）”有关，常见于“cryptography（密码学）”。因此 cryptic 常带有“像密码一样难懂/需要解码”的感觉。","用法小提示：cryptic 常用来形容信息、评论、微笑、线索、诗句等（a cryptic message/comment/smile/clue）。"]}
{"word":"krypticism","summary":{"en":"Krypticism means “crypticness”: unclear, mysterious expression that is hard to interpret.","zh":"krypticism 指“晦涩/隐晦”的表达特质，意思不清楚、带神秘感，不易解读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being cryptic—expressing ideas in a mysterious, unclear, or hard-to-understand way.","zh":"“隐晦/晦涩”的特质；指表达方式神秘、含糊或不容易理解。"},"examples":[{"en":"The poem’s krypticism makes it hard for new readers to understand.","zh":"这首诗的晦涩让新读者很难理解。"},{"en":"People argued about the politician’s krypticism and what he really meant.","zh":"人们争论那位政治人物说话太隐晦，他到底想表达什么。"}]}],"synonyms":["crypticism","crypticness","obscurity","enigmatic style","opacity"],"phonetic":"/ˈkrɪp.tɪˌsɪz.əm/","extraExplanation":["“krypticism”并不是常见的标准拼写；更常见的是 **crypticism**（或更常用的表达是 **crypticness / obscurity**）。在英语里 **crypt-** 来自希腊语词根，和“隐藏”有关（如 *crypt*）。","在文学评论中，有时会用类似 *crypticism* 这样的词来评价作品“含义隐藏、需要解读”。如果你是在写正式文章，建议优先用 *crypticness*（更口语、常见）或 *obscurity*（更正式）。"]}
{"word":"kryptocyanine","summary":{"en":"Kryptocyanine is a cyanine dye used mainly to sensitize photographic materials, often toward red or near‑infrared light.","zh":"Kryptocyanine 是一种花青染料，主要用于给摄影感光材料“增感”，常把敏感范围扩展到红光或近红外。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of cyanine dye used especially as a photographic sensitizer (a chemical that extends a film or plate’s sensitivity to different wavelengths of light, often toward the red/near‑infrared).","zh":"一种花青（cyanine）染料，尤其用作摄影增感染料（使胶片/感光材料对不同波长的光更敏感，常扩展到红光或近红外）。"},"examples":[{"en":"Early photographic researchers used kryptocyanine to make plates more sensitive to red light.","zh":"早期的摄影研究者使用 kryptocyanine，让感光板对红光更敏感。"},{"en":"The lab compared several cyanine dyes, including kryptocyanine, for near‑infrared imaging.","zh":"实验室比较了多种花青染料（包括 kryptocyanine）在近红外成像中的效果。"}]}],"synonyms":["cyanine dye","sensitizing dye","photographic sensitizer"],"phonetic":"/ˌkrɪptoʊˈsaɪənaɪn/","extraExplanation":["词源上可拆为 krypto-（“隐藏的”）+ cyanine（与“青/蓝绿色、氰”相关的染料类名）。它属于“花青染料”家族，这类染料在摄影史上常被用作“增感染料”，用来把感光材料的响应从蓝/紫外扩展到更长波长（如红光、近红外）。"]}
{"word":"kryptol","summary":{"en":"“kryptol” is not a standard English word; it is usually a proper name or a context-specific term (sometimes a product/brand name).","zh":"“kryptol”不是标准常用英语词；通常是专有名词或特定语境用语（有时是产品/品牌名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare/proper name; most often seen as a brand or title (not a common English vocabulary word).","zh":"一个较少见的专有名词；多见于品牌名或作品名（不是常见英语词汇）。"},"examples":[{"en":"I couldn’t find “kryptol” in a standard dictionary; it may be a brand name.","zh":"我在常见词典里找不到“kryptol”；它可能是一个品牌名。"},{"en":"Could you share the sentence or screenshot where you saw “kryptol”?","zh":"你能发一下你看到“kryptol”的句子或截图吗？"}]},{"partOfSpeech":"n.","definition":{"en":"sometimes used as a spelling for “Kryptol,” the name of a candle/wax product (less common; context-dependent).","zh":"有时用来指“Kryptol”（一种蜡烛/蜡制品的名称；较少见，取决于语境）。"},"examples":[{"en":"The old catalog listed Kryptol as a type of candle wax.","zh":"那本旧目录把Kryptol列为一种蜡烛用蜡。"}]}],"synonyms":["crypto (possible intended word, context-dependent)","cryptic (possible related word, context-dependent)"],"phonetic":"/ˈkrɪp.tɔl/","extraExplanation":["“kryptol”不是现代英语里的常用词。很多情况下它可能是：1）专有名词（品牌/产品名/作品名/用户名）；2）拼写变体或拼写错误，常见的接近词包括“crypto”（加密货币/密码学相关）或“cryptic”（含义隐晦的）。","如果你告诉我它出现的领域（比如加密货币、游戏、小说、化学品、品牌目录等）以及原句，我可以更准确地解释它在该语境中的意思。"]}
{"word":"kryptomere","summary":{"en":"Kryptomere means the Japanese cedar (Cryptomeria japonica), an evergreen conifer used for timber and landscaping.","zh":"kryptomere 指日本柳杉（Cryptomeria japonica），一种常绿针叶树，常用于木材与园林景观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese cedar tree (Cryptomeria japonica), an evergreen conifer often planted for timber and as an ornamental tree","zh":"日本柳杉（Cryptomeria japonica），一种常绿针叶树，常用于木材生产与园林观赏"},"examples":[{"en":"The garden path was lined with tall kryptomeres that stayed green all winter.","zh":"花园小路两旁种着高大的柳杉，整个冬天都保持常绿。"},{"en":"In Japan, kryptomere forests are widely managed for construction wood.","zh":"在日本，柳杉人工林常被管理用于建筑用材。"}]}],"synonyms":["cryptomeria","Japanese cedar","sugi"],"phonetic":"/ˈkrɪp.təˌmɪr/","extraExplanation":["“kryptomere”是“cryptomere”的另一种拼写形式，常见于法语影响下的拼写（如法语：kryptomère）。英语里更常用的说法是“cryptomeria”或“Japanese cedar”，在日本也常叫“sugi（杉）”。","这种树在日本文化中很常见：寺庙、神社附近常见成排的柳杉；同时它也是重要的经济树种，用于建筑与木制品。"]}
{"word":"Krypton","summary":{"en":"Krypton is a noble gas element (Kr) used in some lights and lasers, and it is also the fictional home planet of Superman.","zh":"Krypton 指化学元素“氪”（Kr），用于某些照明与激光；也可指超人故乡的虚构行星“氪星”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Kr) that is a colorless, odorless noble gas found in small amounts in air, used in some lighting and lasers","zh":"氪（化学元素，符号 Kr），一种无色无味的惰性气体，空气中含量很少，用于某些照明设备和激光器"},"examples":[{"en":"Krypton is used in some flash lamps and high-intensity lighting.","zh":"氪用于一些闪光灯和高强度照明设备中。"},{"en":"Scientists filled the bulb with krypton to make the light more efficient.","zh":"科学家在灯泡里充入氪，使光更高效。"}]},{"partOfSpeech":"n.","definition":{"en":"(in popular culture) a fictional planet, best known as Superman’s home world in DC Comics","zh":"（流行文化）虚构的行星；最著名的是 DC 漫画中超人的故乡"},"examples":[{"en":"In the story, Superman was born on Krypton.","zh":"在故事里，超人出生在氪星。"},{"en":"The movie shows Krypton as an advanced but doomed world.","zh":"电影把氪星展现为高度发达但注定毁灭的世界。"}]}],"synonyms":["Kr (chemical symbol)","krypton gas","(fictional) Superman’s home planet"],"phonetic":"/ˈkrɪpˌtɑn/","extraExplanation":["“Krypton”来自希腊语 *kryptos*，意思是“隐藏的”。它在19世纪末被发现时，因为在空气中含量极低、不易察觉而得名。","化学里的氪属于“稀有气体/惰性气体”（noble gases），通常不容易与其他元素发生反应，因此常用于需要稳定气体环境的场景。"]}
{"word":"krypton","summary":{"en":"Krypton is a rare noble gas element (Kr) used in some lighting and lasers.","zh":"氪（Kr）是一种稀有的惰性气体元素，用于部分照明和激光设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Kr) that is a colorless, odorless noble gas found in small amounts in air; it is used in some lights and in certain lasers","zh":"一种化学元素（符号 Kr），无色无味的惰性气体，在空气中含量很少；常用于某些灯泡和激光器等"},"examples":[{"en":"Krypton is a noble gas, so it does not react easily with other elements.","zh":"氪是一种惰性气体，因此不容易与其他元素发生反应。"},{"en":"Some high-performance light bulbs contain krypton to improve brightness and efficiency.","zh":"一些高性能灯泡会加入氪气，以提升亮度和效率。"}]}],"synonyms":["Kr (chemical symbol)","noble gas (category)"],"phonetic":"/ˈkrɪp.tɑn/","extraExplanation":["“krypton”一词来自希腊语 *kryptos*，意为“隐藏的”。它在1898年被发现于液化空气残留物中，因为含量极低，像“藏起来”一样不易被察觉。","在流行文化中，“Krypton”也常指超人的故乡“氪星”（与元素同名但语境不同）。看到大写 *Krypton* 时，常是在讲星球；小写 *krypton* 多指化学元素。"]}
{"word":"kryptonite","summary":{"en":"Kryptonite is Superman’s fictional weakness and is commonly used to mean someone’s “Achilles’ heel.”","zh":"kryptonite 指《超人》中的氪石，也常用来比喻某人的“致命弱点/克星”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fictional substance from the Superman stories that weakens Superman; more generally, something that makes a strong person or plan fail.","zh":"（虚构）氪石：出自《超人》故事、能削弱超人的物质；引申为“致命弱点/克星”，指让强者或计划失效的东西。"},"examples":[{"en":"In the Superman comics, kryptonite drains his strength.","zh":"在《超人》漫画里，氪石会削弱他的力量。"},{"en":"Lack of sleep is my kryptonite—I can’t focus without it.","zh":"睡眠不足是我的“氪石”——没有睡眠我就难以专注。"},{"en":"Bad communication became the team’s kryptonite during the project.","zh":"沟通不良成了团队做项目时的“克星”。"}]}],"synonyms":["Achilles' heel","weak spot","fatal flaw","nemesis"],"phonetic":"ˈkrɪptəˌnaɪt","extraExplanation":["“Kryptonite”最早来自DC漫画（1930s–1940s的《Superman》相关作品），后来在美式英语里很常用来比喻“唯一的弱点”。常见表达是“X is my kryptonite”。","书写上通常首字母大写“Kryptonite”表示漫画中的氪石；小写“kryptonite”多用于比喻义（非正式）。","相关近义说法：Achilles’ heel（致命弱点，源自希腊神话）、weak spot（弱点）、fatal flaw（致命缺陷）。"]}
{"word":"kryptons","summary":{"en":"“Kryptons” most commonly means multiple instances/amounts of the noble gas krypton (Kr), though in science writing “krypton” is usually treated as uncountable.","zh":"“Kryptons”通常指“氪（Kr）”这种惰性气体的复数形式/多份用量，但在科学英语中“krypton”更常作为不可数名词使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of krypton: a chemical element (symbol Kr), a colorless, odorless noble gas found in the air in very small amounts.","zh":"krypton（氪）的复数：一种化学元素（符号 Kr），无色无味的惰性气体，在空气中含量极低。"},"examples":[{"en":"Scientists filled the lamp with kryptons (krypton gases) to improve brightness.","zh":"科学家用氪气（kryptons / krypton gases）填充灯泡，以提高亮度。"},{"en":"Small amounts of kryptons are present in Earth’s atmosphere.","zh":"地球大气中含有少量的氪气（kryptons）。"}]}],"synonyms":["krypton (gas)","Kr (symbol)"],"phonetic":"/ˈkrɪpˌtɑn/","extraExplanation":["“Kryptons”在标准英语里不太常见：因为“krypton”通常作为不可数名词使用（说“krypton gas”更自然）。在科幻语境中，“Kryptons”有时也会被用来指“来自氪星（Krypton）的事物/人”，但更常见的表达是“people from Krypton”或“Kryptonians（氪星人）”。"]}
{"word":"kryptopyrrole","summary":{"en":"a reported urine pyrrole compound linked in some contexts to pyroluria","zh":"一种据称可在尿中检出的吡咯样化合物，常在部分语境中与“吡咯尿症”相关联"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pyrrole-like compound reported in some urine tests, sometimes discussed (especially in alternative medicine) in connection with “pyroluria.”","zh":"一种被报道可在尿液检测中出现的“吡咯样”化合物；在某些（尤其是替代医学）语境中常与“吡咯尿症/pyroluria”联系在一起。"},"examples":[{"en":"Some alternative clinics test urine for kryptopyrrole as part of a pyroluria screening.","zh":"一些替代医学诊所会做尿液的 kryptopyrrole 检测，作为“吡咯尿症”筛查的一部分。"},{"en":"The paper discusses whether kryptopyrrole measurements are reliable across different laboratories.","zh":"这篇论文讨论了不同实验室之间的 kryptopyrrole 测量是否可靠。"}]}],"synonyms":["mauve factor","HPL","hydroxyhemopyrrolin-2-one"],"phonetic":"/ˌkrɪp.toʊˈpɪr.oʊl/","extraExplanation":["在英文医学与科研语境里，kryptopyrrole 常与“pyroluria（吡咯尿症）”一起出现；但该概念在主流医学中存在较大争议：检测方法、化合物具体指代（有时与 HPL、mauve factor 等名词混用）、以及与症状之间的因果关系都缺乏一致结论。阅读相关资料时建议区分：研究性讨论 vs. 临床共识。"],"etymology":"词源上由 krypto-（希腊语“隐藏的”之意）+ pyrrole（“吡咯”，一种含氮五元环化合物）构成，字面可理解为“隐藏的吡咯（相关物）”。","mnemonic":["拆词记忆：krypto-≈“crypt/隐秘” + pyrrole≈“吡咯环”，联想“尿里藏着的吡咯相关物质”。","把 krypto- 想成“crypt（密室）”，pyrrole 想成“化学环”，合起来就是“密室里的吡咯”。"]}
{"word":"Krysta","summary":{"en":"a female given name (a common variant spelling)","zh":"女性名字（常见变体拼写）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, often used as a variant spelling of Krista or Krystal/Crystal","zh":"女性名字；常见为 Krista 或 Krystal/Crystal 的变体拼写"},"examples":[{"en":"Krysta moved to Chicago after college.","zh":"Krysta 大学毕业后搬去了芝加哥。"},{"en":"Please ask Krysta if she can join the meeting at 3 p.m.","zh":"请问一下 Krysta 能不能参加下午三点的会议。"}]}],"synonyms":["Krista","Krystal","Crystal"],"phonetic":"/ˈkrɪstə/","extraExplanation":["在英语世界里，人名的不同拼写（如 Krysta / Krista / Krystal）很常见，发音通常相近，但个人可能有自己的偏好；正式场合应以本人写法为准。"],"etymology":"这是一个英文女性名的变体拼写，常与 Krista（多被视为 Christina 的简称/变体）或 Krystal/Crystal（与“水晶”Crystal 的拼写变体）相关。具体来源常取决于家庭偏好与拼写风格。","mnemonic":["把它联想到“crystal（水晶）”：Krysta 的拼写看起来像把 Crystal 改成了更“名字化”的形式。"]}
{"word":"krystallos","summary":{"en":"“Krystallos” is an Ancient Greek word meaning “ice” or “crystal,” and it is the origin of English “crystal.”","zh":"Krystallos 是古希腊语，意为“冰”或“水晶/晶体”，也是英语 crystal 的词源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek) “ice” or “crystal”; the source word that later developed into English “crystal.”","zh":"（古希腊语）“冰”或“水晶/晶体”；也是英语 crystal（“水晶/晶体”）的词源。"},"examples":[{"en":"In Ancient Greek texts, “krystallos” could mean clear ice.","zh":"在古希腊语文献中，krystallos 可以指清澈的冰。"},{"en":"The English word “crystal” comes from Greek “krystallos.”","zh":"英语单词 crystal 源自希腊语 krystallos。"}]}],"synonyms":["crystal","ice"],"phonetic":"/krɪˈstɑːlɔs/","extraExplanation":["Krystallos（κρύσταλλος）最早常指“冰”，因为古人认为某些透明的石英（水晶）是“永不融化的冰”，所以后来也用于指“水晶/透明晶体”。","如果你在现代语境（品牌名、昵称、游戏设定）看到 krystallos，它通常是借用这个古希腊词根来营造“冷冽、透明、结晶”的意象。"]}
{"word":"Krzysztof","summary":{"en":"a Polish male first name (Christopher equivalent).","zh":"波兰男性名（对应英文 Christopher）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Polish masculine given name, equivalent to the English name “Christopher.”","zh":"波兰男性名字，相当于英文名“Christopher（克里斯托弗）”。"},"examples":[{"en":"Krzysztof is a common first name in Poland.","zh":"Krzysztof 是波兰很常见的男性名字。"},{"en":"Krzysztof introduced himself as “Chris” when speaking English.","zh":"Krzysztof 讲英语时自我介绍用“Chris”。"}]}],"synonyms":["Christopher","Chris"],"phonetic":"/ˈkʐɨʂ.tɔf/","extraExplanation":["波兰语里“rz”常发类似英语“zh”的音（接近 /ʐ/），“sz”接近英语“sh”，所以 Krzysztof 虽然拼写复杂，但大致可听成“KR-zhish-tof”。","常见昵称：Krzysiek、Krzysztof → 口语里也可能被英语环境简化为 Chris。"],"etymology":"源自希腊语 Christóphoros（意为“背负基督的人”，英语 Christopher 同源），经由拉丁语/教会传统进入斯拉夫语系，在波兰语中形成 Krzysztof 这一拼写与读音。","mnemonic":["把它当作“Christopher 的波兰版”：看到 Krzysztof 就联想到 Christopher（克里斯托弗）。","记拼写：开头 “Krz-” 很有波兰风格，像把 “Chris-” 换成了 “Krzys-”。"]}
{"word":"krzysztof","summary":{"en":"Krzysztof is a common Polish male name meaning the same as “Christopher.”","zh":"Krzysztof 是常见的波兰男性名字，相当于英文名 Christopher（克里斯托弗）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Polish male given name, equivalent to the English name “Christopher.”","zh":"波兰男性名字，相当于英文名“Christopher（克里斯托弗）”。"},"examples":[{"en":"Krzysztof is my colleague from Poland.","zh":"Krzysztof 是我来自波兰的同事。"},{"en":"How do you pronounce Krzysztof?","zh":"Krzysztof 怎么读？"}]}],"synonyms":["Christopher","Kris"],"phonetic":"/ˈkʃɪʃ.tɔf/","extraExplanation":["“Krzysztof”在波兰语中的大致读音接近英语里的“kshish-tof”。拼写里常见的组合：\n- “rz”常发类似英语“zh”的音（在某些环境下也会接近“sh”）。\n- “sz”通常发“sh”音。\n所以整体听起来会有明显的“sh”音。","这个名字与“Christopher”同源，来自希腊语“Christophoros”，含义常被解释为“背负基督的人/基督的承载者”。在基督教文化影响较深的欧洲国家很常见。"]}

