{"word":"kua","summary":{"en":"“kua” is usually Pinyin for the Chinese verb 夸, meaning “to praise/compliment” (and sometimes “to boast,” depending on context).","zh":"“kua”通常是汉语拼音，对应动词“夸”，意思是“称赞/夸奖”（有时也可表示“自夸”，看语境）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Pinyin; used in Chinese learning) to praise or compliment; sometimes also to boast, depending on context.","zh":"（拼音；多用于中文学习语境）夸、称赞；有时也可指“夸口/自夸”，取决于语境。"},"examples":[{"en":"In this sentence, “kua” means “to praise”: “Wǒ yào kua nǐ.”","zh":"在这句话里，“kua”表示“称赞”： “我要夸你。”"},{"en":"She wrote “kua” in her notes to remember the verb “夸” (to compliment).","zh":"她在笔记里写了“kua”，用来记动词“夸”（称赞）。"}]}],"synonyms":["praise","compliment","commend","flatter (sometimes)","boast (context-dependent)"],"phonetic":"/kwɑ/","extraExplanation":["“kua”不是常见英文单词，更多是汉语拼音的写法，用在学中文、词汇表、字幕或跨文化交流中。","常见声调区别：kuā（第一声）= 夸（称赞）；kuà（第四声）= 跨（跨越/跨过）。没有声调标注时容易混淆。","如果你是在英文句子里看到KUA/Kua，也可能是缩写、品牌名或人名，需要结合上下文确认。"]}
{"word":"kuan","summary":{"en":"“Kuan” is most commonly used in English as a romanized Chinese surname; “kuan” by itself is not a standard English word and may represent different Mandarin syllables depending on tone.","zh":"“Kuan”在英语中最常见用法是中文姓氏的罗马字拼写；“kuan”本身不是标准英文词，可能对应不同声调的汉语音节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese family name, often spelled from Mandarin pinyin (also written as Guan/Quan in other romanization styles)","zh":"一个中文姓氏的英文拼写，常见于汉语拼音的转写（在不同拼写体系中也可能写作 Guan/Quan 等）"},"examples":[{"en":"Ms. Kuan will join the meeting at 3 p.m.","zh":"关女士将于下午三点参加会议。"},{"en":"My last name is Kuan, spelled K-U-A-N.","zh":"我姓 Kuan，拼作 K-U-A-N。"}]},{"partOfSpeech":"other","definition":{"en":"a romanized spelling that may represent different Mandarin syllables depending on tone (not a standard English word by itself)","zh":"一种罗马字拼写，可能对应汉语普通话中不同声调的“kuan”音节（本身不是标准英文单词）"},"examples":[{"en":"“Kuan” might come from different Chinese characters, so you may need the tone or the original characters.","zh":"“Kuan”可能来自不同汉字，所以通常需要声调或原字来确认。"},{"en":"On its own, “kuan” is usually treated as a name or a transliteration, not an English vocabulary word.","zh":"单独写“kuan”时，一般被当作名字或音译，而不是英文词汇。"}]}],"synonyms":["Guan","Quan"],"phonetic":"/kwɑn/","extraExplanation":["“kuan”在汉语拼音里可能对应多种声调与字，例如：kuān（宽）、kuǎn（款）、kuàn（惯/盥等较少见）。没有声调时，很难确定具体意思。","如果你想查的是某个中文词（如“宽/款/髋”等）对应的英文表达，发我汉字或句子语境，我可以给出更准确的英文释义与例句。"]}
{"word":"kuang","summary":{"en":"“Kuang” is usually a Chinese name spelling or a pinyin romanization, not a standard English vocabulary word.","zh":"“Kuang”多为中文姓名拼写或拼音转写，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Chinese surname or given name (a romanization of several Chinese characters, depending on tone and character).","zh":"一个中文姓氏或名字（可对应不同汉字与声调的拼音转写）。"},"examples":[{"en":"Professor Kuang will speak at the conference tomorrow.","zh":"匡教授明天将在会议上发言。"},{"en":"I met someone named Kuang during my trip to Taiwan.","zh":"我在台湾旅行时认识了一个叫 Kuang 的人。"}]},{"partOfSpeech":"other","definition":{"en":"a romanization sometimes used for Chinese words such as kuáng (狂), meaning “wild/crazy,” when writing Chinese sounds in the Latin alphabet (not a standard English word).","zh":"有时用来转写中文词（如 kuáng「狂」），表示“狂野/疯狂”；但它不是标准英语单词。"},"examples":[{"en":"In pinyin, kuáng (狂) can be loosely glossed as “crazy” or “wild.”","zh":"在拼音中，kuáng（狂）大致可译为“疯狂”或“狂野”。"},{"en":"Some menus write “kuang spicy” to suggest an over-the-top level of heat.","zh":"有些菜单会写“kuang spicy”来表示辣得夸张。"}]}],"synonyms":["(as a name) Kuang","(for kuáng 狂) crazy","wild"],"phonetic":"/kwɑŋ/","extraExplanation":["“Kuang”本身不是常见英语词汇，多见于人名/地名的拼写（专有名词），或作为中文拼音的转写。","中文拼音的声调会改变对应汉字与含义：例如 kuāng（匡/筐/框等）、kuáng（狂）、kuàng（矿/况等）。只写“kuang”不标声调时，具体意思需要看上下文或原汉字。","如果你想查的是英文里表示“狂/疯狂”的词，更自然的说法包括：crazy, wild, manic（偏医学/文学语感）, unhinged（更强烈、偏口语）。"]}
{"word":"kuar","summary":{"en":"“kuar” is not a standard English word; it’s likely a typo or a proper name.","zh":"“kuar”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name (proper noun). If you meant an English word, please share the sentence or the correct spelling.","zh":"不是标准英语单词，更可能是拼写错误或人名/地名（专有名词）。如果你想查英语单词，请提供上下文句子或正确拼写。"},"examples":[{"en":"I typed “kuar,” but I’m not sure how to spell it—could it be “quarrel”?","zh":"我打了“kuar”，但不确定怎么拼——会不会是“quarrel（争吵）”？"},{"en":"Can you tell me what “kuar” means in this sentence?","zh":"你能告诉我这个句子里的“kuar”是什么意思吗？"}]}],"phonetic":"/kwɑr/","extraExplanation":["“kuar”在英语里不常见，也不是常用词条。它可能是：\n1）拼错：例如你想写的是 quarrel（争吵）、quart（夸脱）、quark（夸克）等；\n2）外来语/人名/地名：某些语言或姓名里可能出现 Kuar。\n把你看到“kuar”的整句话发来，我可以更准确判断。"]}
{"word":"kuba","summary":{"en":"“Kuba” most commonly refers either to Cuba (in some languages) or to the Kuba people/kingdom in Central Africa, depending on context.","zh":"“Kuba”最常见的两种意思是：在某些语言中表示“古巴”，或指中非地区的库巴人/库巴王国，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cuba (an alternative spelling in some languages; also used as a transliteration or brand/name).","zh":"古巴（在一些语言中的另一种拼写；也可作为音译或名称/品牌使用）。"},"examples":[{"en":"My friend moved from Kuba (Cuba) to Florida last year.","zh":"我朋友去年从Kuba（古巴）搬到了佛罗里达。"},{"en":"In Polish, you may see “Kuba” used where English says “Cuba.”","zh":"在波兰语里，你可能会看到用“Kuba”来表示英语中的“Cuba（古巴）”。"}]},{"partOfSpeech":"n.","definition":{"en":"The Kuba people / the Kuba Kingdom, a culturally rich group and historical state in what is now the Democratic Republic of the Congo.","zh":"库巴人／库巴王国（位于今刚果民主共和国的一支文化丰富的民族及其历史国家）。"},"examples":[{"en":"The museum has an exhibit on Kuba art and textiles.","zh":"博物馆有一个关于库巴艺术与纺织品的展览。"},{"en":"Researchers study the history of the Kuba Kingdom in Central Africa.","zh":"研究者研究中非库巴王国的历史。"}]}],"synonyms":["Cuba","Kuba people","Kuba Kingdom"],"phonetic":"/ˈkuːbə/","extraExplanation":["“Kuba”在不同语境里含义差别很大：\n1) 作为“古巴”的拼写：在某些语言（如波兰语等）中，“Kuba”常被用来指英语的“Cuba”。\n2) 作为专有名词：人类学/历史语境中，“Kuba”更常指刚果（金）地区的库巴人及库巴王国，以面具、木雕、织物等艺术传统闻名。\n\n如果你是在问人名，“Kuba”在部分欧洲国家也可作男性名字或昵称（常与“Jacob/Jakub”相关），需要结合上下文判断。"]}
{"word":"kubachi","summary":{"en":"Kubachi refers to a village in Dagestan, Russia, and by extension the distinctive silver and metalwork tradition associated with it.","zh":"Kubachi 指俄罗斯达吉斯坦的库巴奇村，也可引申指其著名的银器与金属工艺传统（库巴奇风格/制品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village in the Republic of Dagestan (Russia), famous for traditional metalworking—especially silver jewelry, engraved weapons, and decorative crafts.","zh":"库巴奇：俄罗斯达吉斯坦共和国的一个村庄，以传统金属工艺闻名，尤其是银饰、雕刻武器与装饰性工艺品。"},"examples":[{"en":"Kubachi is well known for its master silversmiths and finely engraved jewelry.","zh":"库巴奇以银匠大师和精细雕刻的珠宝闻名。"},{"en":"The museum displayed Kubachi works, including decorated daggers and silver bowls.","zh":"博物馆展出了库巴奇工艺品，包括装饰匕首和银碗。"}]},{"partOfSpeech":"adj.","definition":{"en":"made in Kubachi or in the traditional style associated with Kubachi metalwork (often used before a noun).","zh":"库巴奇风格的；库巴奇出产的（常作定语，用于名词前，指该地传统金属工艺风格）。"},"examples":[{"en":"She bought a Kubachi silver bracelet with intricate patterns.","zh":"她买了一只纹样精致的库巴奇银手镯。"},{"en":"Collectors sometimes look for Kubachi-style engraving on blades.","zh":"收藏者有时会寻找刀刃上的库巴奇风格雕刻。"}]}],"synonyms":["(no true synonym; related: Dagestan, Caucasus metalwork, silverwork)"],"phonetic":"/kuˈbɑːtʃi/","extraExplanation":["“Kubachi”常见于艺术史、民族志或古董收藏语境中，指向高加索地区的工艺传统。库巴奇工匠的银器与武器装饰以细密刻纹、黑银（发黑填刻）等技法著称，因此在英文里也常见搭配如“Kubachi silver”“Kubachi dagger”。"]}
{"word":"kubanka","summary":{"en":"Kubanka means a traditional Cossack-style round fur hat, especially associated with the Kuban region.","zh":"kubanka 指一种传统哥萨克风格的圆筒毛皮帽，尤与俄罗斯库班地区相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall, round fur hat (often made of sheepskin) traditionally worn by Cossacks, especially from the Kuban region of southern Russia; also used as a ceremonial or winter hat in some military or folk costumes","zh":"一种高筒、圆形的毛皮帽（常用羊皮制成），传统上由哥萨克人佩戴，尤指俄罗斯南部库班地区；也可见于某些军装或民俗服饰中的礼帽/冬帽"},"examples":[{"en":"He wore a black kubanka with his winter coat.","zh":"他穿着冬大衣，戴了一顶黑色的库班卡毛皮帽。"},{"en":"In the parade, the dancers’ kubankas matched their Cossack-style uniforms.","zh":"在游行中，舞者的库班卡帽与他们的哥萨克风制服相配。"}]}],"synonyms":["Cossack hat","papakha (related)","fur hat"],"phonetic":"/kuˈbɑŋkə/","extraExplanation":["“Kubanka”来自“Kuban（库班）”这一地名（位于俄罗斯南部），与当地的库班哥萨克文化相关。它在外形上常被认为是“papakha（帕帕哈毛皮帽）”的较矮版本：papakha通常更高、更蓬松，而kubanka更短、更圆。","在英语语境里，这个词多出现在历史、军装/民族服饰、或时尚描写中；有时也会被泛称为“Cossack hat（哥萨克帽）”。"]}
{"word":"kubba","summary":{"en":"Kubba is a Middle Eastern stuffed bulgur-and-meat dish, often fried, baked, or cooked in soup.","zh":"Kubba 是一种中东的“粗麦碎（或米）与肉”做外皮、内馅调味肉的料理，可炸、烤或做成汤丸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Middle Eastern dish made from a casing of bulgur wheat (or rice) and minced meat, usually stuffed with seasoned meat, onions, and spices; it can be fried, baked, or cooked in soup","zh":"一种中东料理：用粗麦碎（或米）与绞肉做外皮，内馅常是调味肉末、洋葱和香料；可油炸、烘烤，或做成汤里的丸子"},"examples":[{"en":"We ordered kubba with yogurt sauce and fresh mint.","zh":"我们点了配酸奶酱和新鲜薄荷的 kubba。"},{"en":"In some recipes, kubba is served in a rich tomato broth.","zh":"在一些做法里，kubba 会放在浓郁的番茄汤里上桌。"}]}],"synonyms":["kibbeh","kubbeh","kibbe"],"phonetic":"/ˈkʊbə/","extraExplanation":["“Kubba”常见于伊拉克、叙利亚等地的英语转写；在黎凡特地区更常见的拼法是“kibbeh / kibbe”。不同地区做法差异很大：有的做成油炸的椭圆形饼/丸子，有的做成汤（如番茄汤或罗望子汤）里的丸子。","这是外来词的多种拼写并存现象：阿拉伯语词进入英语后，常因方言与转写系统不同而出现 kubba/kubbeh/kibbeh 等写法。"]}
{"word":"kubera","summary":{"en":"Kubera is a mythological figure best known in Hinduism as the god/guardian of wealth and treasures, and is sometimes linked with Vaisravana in Buddhist contexts.","zh":"Kubera是神话人物，最常见于印度教语境中作为财富与宝藏的神祇/守护者；在部分佛教语境中也常与毗沙门天（Vaisravana）相关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Hindu mythology, Kubera is the god (or divine guardian) of wealth, treasures, and prosperity, often described as the king of the yakshas (nature-spirits) and a keeper of riches.","zh":"在印度教神话中，Kubera（俱毗罗/库贝拉）是掌管财富、宝藏与繁荣的神祇，常被说成夜叉（yakshas，自然灵/精灵）之王、财富的守护者。"},"examples":[{"en":"In some Hindu traditions, people pray to Kubera for prosperity and financial stability.","zh":"在一些印度教传统中，人们会向Kubera祈求富足与财务稳定。"},{"en":"The story mentions Kubera as a guardian of immense treasures.","zh":"故事中提到Kubera守护着巨大的宝藏。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Buddhist and Asian traditions, Kubera is closely associated with Vaisravana, one of the Four Heavenly Kings, also linked to wealth and protection.","zh":"在一些佛教与亚洲传统中，Kubera常与四大天王之一的毗沙门天（Vaisravana）密切相关，同样与财富与护法形象相连。"},"examples":[{"en":"Some temples depict Kubera/Vaisravana as a protector figure connected with wealth.","zh":"一些寺庙会将Kubera/毗沙门天塑造成与财富相关的护法形象。"}]}],"synonyms":["god of wealth","guardian of wealth","Vaisravana (related in some traditions)"],"phonetic":"/kuːˈbɛrə/","extraExplanation":["名称与文化背景：Kubera源自古印度宗教与史诗传统（如《罗摩衍那》等相关叙事中常出现的财富守护者形象）。在艺术形象里，他常被描绘为富足、持钱袋或宝物，象征“资源的守护与分配”。","跨文化对应：在不同地区与宗教传播过程中，Kubera的形象与“护世天王/财富守护神”的观念相互融合，因此在部分语境里会与毗沙门天（Vaisravana）并提或被视作相关联的形象。"]}
{"word":"kubong","summary":{"en":"“Kubong” is not a common English word; it’s usually a name (person/place/brand) or a misspelling of a similar word.","zh":"“Kubong”不是常见英语词；多为人名/地名/品牌名等专有名词，或是相近词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal or place name (proper noun). It is not a common standard English word, so its meaning depends on who/what it refers to (e.g., a person’s name, a brand, a username, or a location).","zh":"人名或地名（专有名词）。它不是常见的标准英语词汇，因此含义取决于具体指代对象（如人名、品牌名、用户名或地点）。"},"examples":[{"en":"Kubong is the name on the account profile.","zh":"Kubong 是账户资料上的名字。"},{"en":"I met Kubong at the conference last year.","zh":"我去年在会议上认识了 Kubong。"}]},{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A likely misspelling or variant spelling of a similar-sounding word; you may have meant another form (e.g., “kabong”).","zh":"（非标准）可能是某个读音相近词的拼写误差或变体；你可能想写的是另一个形式（如 “kabong”）。"},"examples":[{"en":"Did you mean kabong instead of kubong?","zh":"你想写的是 kabong 而不是 kubong 吗？"}]}],"synonyms":["proper name","username","brand name"],"phonetic":"/kuːˈbɔŋ/","extraExplanation":["“Kubong”在英语词典里并不常见，所以通常被当作专有名词使用（名字/昵称/品牌/地名）。如果你能提供一句上下文（它出现在哪句话里、指人还是物、来自哪种语言），我可以更准确地判断含义与用法。","它也可能来自其他语言的罗马字转写（例如韩语地名/人名），这类词在英语里一般不翻译含义，而是按发音使用。"]}
{"word":"kubuklion","summary":{"en":"“kubuklion” isn’t recognized as a standard English word; it’s probably a name or a nonstandard/spelled variant.","zh":"“kubuklion”不属于标准英语词汇；更可能是名字或非标准/变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a proper name, username, brand name, or a misspelling/transliteration.","zh":"不是标准英语单词；更可能是专有名词（人名/地名）、用户名、品牌名，或拼写错误/音译词。"},"examples":[{"en":"I couldn’t find “kubuklion” in an English dictionary—could you share a sentence or where you saw it?","zh":"我在英语词典里找不到“kubuklion”——你能提供一句例句或你在哪里看到的吗？"},{"en":"It may be a name or a made-up word used online.","zh":"它可能是一个名字，或是网络上自造的词。"}]}],"phonetic":"/kuːbʊkˈliːən/","extraExplanation":["“kubuklion”看起来不像常见英语词根组合（例如常见的前缀/后缀），因此更像是：\n1）专有名词（某个角色名、项目名、店名）；\n2）其他语言的音译（把外语发音用拉丁字母写出来）；\n3）拼写变体或打字错误。\n如果你告诉我它出现的语境（游戏/小说/社交平台/一段话），我可以帮你判断可能的含义与正确拼法。"]}
{"word":"kuchean","summary":{"en":"Kuchean means “of Kucha (ancient Kucha/Kuqa on the Silk Road),” and in linguistics it often refers to Tocharian B.","zh":"Kuchean 指“龟兹（库车/库恰）地区的”，在语言学中也常指吐火罗语B。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Kucha (also spelled Kuqa), an ancient oasis kingdom on the Silk Road in today’s Xinjiang, China.","zh":"与龟兹（今中国新疆库车/库恰一带的丝绸之路绿洲古国）有关的；龟兹的。"},"examples":[{"en":"Kuchean murals show strong Buddhist influence from Central Asia.","zh":"龟兹的壁画显示出来自中亚的强烈佛教影响。"},{"en":"The lecture introduced Kuchean music and dance traditions along the Silk Road.","zh":"讲座介绍了丝绸之路上的龟兹音乐与舞蹈传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"A historical linguistic label for Tocharian B, the Tocharian language variety mainly attested in and around Kucha.","zh":"历史语言学用语：吐火罗语B（主要在龟兹及其周边地区见于文献的吐火罗语变体）。"},"examples":[{"en":"Many textbooks call Tocharian B the Kuchean variety.","zh":"许多教材把吐火罗语B称为“龟兹方言/龟兹语”。"},{"en":"Researchers compare Kuchean (Tocharian B) with Tocharian A to study sound changes.","zh":"研究者会比较龟兹语（吐火罗语B）与吐火罗语A来研究语音演变。"}]}],"synonyms":["Kucha(n)","Tocharian B"],"phonetic":"/kuːˈtʃiːən/","extraExplanation":["“Kuchean”来自地名 Kucha（现代常写作 Kuqa/库车；古称“龟兹”）。在英语学术写作中，它既可指“龟兹地区的/与龟兹有关的”，也常用作吐火罗语B（Tocharian B）的别称。","发音上可拆成 Kuche- + -an（表示“……的/……人/……语”的后缀，如 Roman、Mexican）。"]}
{"word":"kuchen","summary":{"en":"Kuchen means “cake,” often a German-style coffee cake, used in English mainly as a loanword.","zh":"Kuchen意为“蛋糕”，常指德式咖啡蛋糕；在英语中主要作为外来词使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From German) a cake, especially a coffee cake often topped with fruit or crumbs.","zh":"（源自德语）蛋糕；尤指常配咖啡食用、表面常有水果或酥粒的咖啡蛋糕。"},"examples":[{"en":"At the bakery, I bought an apple kuchen for dessert.","zh":"我在面包店买了一个苹果kuchen当甜点。"},{"en":"In some American communities with German roots, kuchen is a traditional Sunday treat.","zh":"在一些有德国文化背景的美国社区里，kuchen是传统的周日点心。"},{"en":"She served warm kuchen with coffee in the afternoon.","zh":"她下午端上热乎乎的kuchen配咖啡。"}]}],"synonyms":["coffee cake","German cake","crumb cake"],"phonetic":"/ˈkuːkən/","extraExplanation":["“Kuchen”在德语里是“蛋糕/糕点”的统称；在英语语境中多作为借词出现，尤其在美国中西部等德裔移民较多的地区（也常见于菜单、烘焙店）。","发音在英语里常被读作接近“KOO-ken”（更像德语），但不同地区会有变化。","常见相关词：coffee cake（咖啡蛋糕）、strudel（果馅卷）、torte（奶油/夹层蛋糕）、crumb topping（酥粒表层）。"]}
{"word":"kuchens","summary":{"en":"Kuchens are German-style cakes (plural of kuchen), often served as coffee cake with fruit or custard.","zh":"Kuchens 是 kuchen 的复数，指德式蛋糕/咖啡蛋糕，常见水果或蛋奶馅口味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of kuchen: a type of German-style cake, often a coffee cake with fruit, custard, or a sweet topping.","zh":"kuchen 的复数：一种德式蛋糕/咖啡蛋糕，常配水果、卡仕达（蛋奶馅）或甜酥粒等配料。"},"examples":[{"en":"The bakery sells several kinds of kuchens, including apple and cherry.","zh":"那家面包店卖好几种 kuchen（德式蛋糕），包括苹果和樱桃口味。"},{"en":"We brought kuchens to the potluck because they travel well.","zh":"我们带了几块 kuchen 去聚餐，因为它们很方便携带。"}]}],"synonyms":["German coffee cake","coffee cake","pastry"],"phonetic":"/ˈkuːkənz/","extraExplanation":["“kuchen”来自德语 Kuchen（蛋糕）。在美国（尤其是有德国移民历史的地区，如中西部、宾夕法尼亚等），你可能会在烘焙店或社区活动中看到这个词。拼写上英语里常直接用 kuchen / kuchens 作为借词。"]}
{"word":"kudize","summary":{"en":"“kudize” isn’t a recognized English word; it’s probably a misspelling (e.g., “kudzu,” “customize,” “criticize”) or a proper name.","zh":"“kudize”不是常见英文单词；更可能是拼写错误（如“kudzu / customize / criticize”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/brand. Please share the sentence/context so I can identify the intended word.","zh":"不是标准英文单词；可能是拼写错误，或是人名/品牌名。请提供句子或使用语境，方便判断你想表达的词。"},"examples":[{"en":"I can’t find “kudize” in a standard English dictionary—could you show the sentence where you saw it?","zh":"我在常见英文词典里查不到“kudize”——你能把看到它的句子发我吗？"},{"en":"Did you mean “kudzu” or “customize”?","zh":"你想写的是“kudzu（葛藤）”还是“customize（定制/自定义）”吗？"}]}],"phonetic":"N/A","extraExplanation":["“kudize”很像以下词的拼写变体/误拼：\n1) kudzu /ˈkʌdzuː/：名词，葛藤（在美国南方很常见、蔓延很快的藤本植物），常用于环境/生态话题。\n2) customize：动词，“定制、个性化设置”。\n3) criticize：动词，“批评、评论”。\n如果你告诉我它出现的场景（聊天、游戏ID、歌曲歌词、论文等），我可以更准确判断并给出对应词条与用法。"]}
{"word":"kudo","summary":{"en":"A (less common) singular form meaning praise or credit for something well done; most people say “kudos.”","zh":"表示对做得好的事的赞誉/功劳；但更常用的说法是“kudos”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"praise or credit for an achievement (a less common singular form of “kudos”)","zh":"（因成就而得到的）赞誉、荣誉；“kudos”的较少见单数形式"},"examples":[{"en":"She got a lot of kudos for finishing the project early—some people even gave her a kudo in the team chat.","zh":"她因为提前完成项目而获得很多赞誉——有些人甚至在团队群里给了她一个“kudo”。"},{"en":"I want to give you a kudo for staying calm during the meeting.","zh":"我想表扬你在会议中保持冷静。"}]}],"synonyms":["praise","credit","recognition","compliment","props"],"phonetic":"/ˈkuːdoʊ/","extraExplanation":["“kudo”在现代英语里不算常见；更常见的是“kudos”。很多母语者也把“kudos”当作单数来用：You deserve kudos.（你值得称赞。）","词源来自希腊语 κῦδος（kudos），意为“荣耀、名声”。因此传统上“kudos”本身就像一个整体概念，不一定需要复数形式；但在口语和职场文化中，人们也会造出“a kudo / kudos”来表示“一条表扬”。","在一些工作平台或团队文化里，“give someone a kudo”常指给同事点“表扬/感谢”（类似一条公开认可）。"]}
{"word":"kudos","summary":{"en":"Kudos means praise or recognition for something well done.","zh":"Kudos 指对做得好的事情给予的称赞或认可。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Praise or public credit for an achievement or good work.","zh":"（对成就或好表现的）赞扬；荣誉；好评。"},"examples":[{"en":"She deserves kudos for finishing the project early.","zh":"她提前完成项目，理应得到称赞。"},{"en":"The team got kudos from customers for their quick support.","zh":"团队因快速的支持服务而获得了客户的好评。"}]}],"synonyms":["praise","recognition","credit","acclaim"],"phonetic":"/ˈkuːdoʊz/","extraExplanation":["“kudos”源自希腊语，原意接近“荣耀/名声”。在现代英语中常表示“称赞、荣誉”。","用法提示：虽然“kudos”以 -s 结尾，但一般当作不可数名词使用，更常说“get/receive/deserve kudos”，而不是“a kudo”（后者偶尔会见到，但不如前者自然）。","常见搭配：kudos to you/him/them（对你/他/他们表示称赞）；give kudos（给予称赞）；earn kudos（赢得称赞）。"]}
{"word":"kudrun","summary":{"en":"Kudrun is the title of a medieval German heroic epic and also a rare Germanic female given name.","zh":"Kudrun 既是中世纪德语英雄史诗《库德伦》的标题，也可作较少见的日耳曼女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medieval Middle High German heroic epic poem (c. 13th century), also known as the “Kudrunlied,” centered on Princess Kudrun and themes of abduction, endurance, and reconciliation","zh":"中世纪德语英雄史诗（约13世纪），又称《库德伦之歌》（Kudrunlied），讲述库德伦公主的故事，主题包括掳掠、坚忍与和解"},"examples":[{"en":"In a course on medieval literature, we read Kudrun alongside the Nibelungenlied.","zh":"在中世纪文学课上，我们把《库德伦》与《尼伯龙根之歌》一起阅读。"},{"en":"Kudrun is often discussed as a counterpoint to darker revenge epics because it ends with reconciliation.","zh":"《库德伦》常被视为更黑暗的复仇史诗的对照，因为它以和解收尾。"}]},{"partOfSpeech":"n.","definition":{"en":"a female given name used in Germanic contexts; a variant/related form of Gudrun","zh":"日耳曼语系语境中的女性名；与 Gudrun（古德伦）相关或可视为变体"},"examples":[{"en":"Kudrun is a rare name outside German-speaking countries.","zh":"在德语国家之外，Kudrun 这个名字比较少见。"},{"en":"They chose the name Kudrun because of its connection to old Germanic stories.","zh":"他们选择 Kudrun 这个名字，是因为它与古老的日耳曼故事有关。"}]}],"synonyms":["Kudrunlied"],"phonetic":"/ˈkuːdrʊn/","extraExplanation":["《Kudrun》（常见英文也写作 Kudrunlied）大约成书于13世纪，属于“英雄史诗”传统，但整体气质比《尼伯龙根之歌》更强调忍耐与最终的调停，因此在文学史上常被拿来作对比。","人名 Kudrun 与北欧传说中的 Gudrún/Gudrun 有亲缘关系；不同语言/地区会出现拼写差异。"]}
{"word":"kudu","summary":{"en":"A kudu is a large African antelope, famous for its spiral horns.","zh":"kudu 指一种大型非洲羚羊，以螺旋状长角闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large African antelope (either the greater kudu or the lesser kudu) with long spiral horns (usually on the male).","zh":"一种大型非洲羚羊（大捻角羚或小捻角羚），以（多为雄性）长而螺旋状的角为特征。"},"examples":[{"en":"We saw a kudu standing quietly among the acacia trees.","zh":"我们看到一只捻角羚静静地站在金合欢树丛中。"},{"en":"The male kudu’s spiral horns can look like a natural sculpture.","zh":"雄性捻角羚的螺旋角看起来像天然的雕塑。"}]}],"synonyms":["antelope","greater kudu","lesser kudu"],"phonetic":"/ˈkuːduː/","extraExplanation":["“kudu”是非洲英语里常见的动物名，主要指两种：greater kudu（大捻角羚）和 lesser kudu（小捻角羚）。在野生动物纪录片和非洲草原旅行（safari）语境中很常见。","词源经由南非荷兰语（Afrikaans）进入英语，常见拼写为 kudu，也可见到较少用的 koedoe。"]}
{"word":"kudus","summary":{"en":"Kudus is a place name: a city in Central Java, Indonesia.","zh":"Kudus是地名：印度尼西亚中爪哇的一座城市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Kudus: a city (regency capital) in Central Java, Indonesia, known for its Islamic heritage and local industry (especially the clove cigarette industry).","zh":"Kudus：印度尼西亚中爪哇省的一座城市（县治），以伊斯兰文化传统与地方产业（尤其是丁香卷烟产业）闻名。"},"examples":[{"en":"My friend’s family lives in Kudus, Central Java.","zh":"我朋友的家住在中爪哇的Kudus。"},{"en":"Kudus is often visited for its historic mosques and religious sites.","zh":"Kudus常因其历史清真寺和宗教遗址而有人造访。"}]}],"phonetic":"/ˈkuːdʊs/","extraExplanation":["在英语语境中，“Kudus”通常作为专有名词（地名）出现。它也常被英语学习者与“kudos”（/ˈkuːdoʊz/，意为“称赞、赞誉”）混淆；如果你想表达“给你点赞/称赞你”，更可能要用的是“kudos”。"]}
{"word":"kudzu","summary":{"en":"Kudzu is a very fast-growing vine that spreads aggressively and can cover other plants and structures.","zh":"kudzu 指一种生长极快、扩散性强的葛藤，常覆盖并压制其他植物或建筑物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fast-growing climbing vine (Pueraria montana) originally from East Asia, known for spreading quickly and covering trees, buildings, and other plants","zh":"葛藤（葛属植物），原产东亚的一种快速生长的攀援藤本植物，以蔓延迅速、覆盖树木/建筑/其他植物而闻名"},"examples":[{"en":"Kudzu can grow so quickly in warm weather that it seems to swallow entire hillsides.","zh":"在温暖天气里，葛藤生长得非常快，仿佛能“吞没”整座山坡。"},{"en":"In some parts of the U.S. South, kudzu covers abandoned houses and fences.","zh":"在美国南部的一些地区，葛藤会覆盖废弃的房屋和篱笆。"},{"en":"The park removed kudzu to protect native plants.","zh":"公园清除葛藤以保护本地植物。"}]}],"synonyms":["vine","climbing vine","invasive vine"],"phonetic":"/ˈkʊd.zu/","extraExplanation":["“kudzu”来自日语“kuzu（葛）”，与中文“葛”同源的东亚植物名。","在美国文化里，kudzu 常被称为 “the vine that ate the South（吃掉南方的藤蔓）”，用来形容它作为外来入侵植物蔓延之快。","在东亚，葛的根（葛根）也常用于食物与传统用途；但在北美许多地区，kudzu 更常以“难以控制的入侵植物”形象出现。"]}
{"word":"kudzus","summary":{"en":"“Kudzus” is the plural of “kudzu,” a fast-growing vine often known as an invasive plant in the U.S.","zh":"“Kudzus” 是 “kudzu” 的复数，指生长很快、在美国常被视为入侵植物的葛藤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of kudzu: a fast-growing climbing vine (Pueraria montana) that is often invasive, especially in the southeastern U.S.","zh":"kudzu 的复数：葛藤／野葛（一种攀援藤本植物），生长很快，在美国东南部等地常被视为入侵植物。"},"examples":[{"en":"Kudzus can cover trees and abandoned buildings in just a few seasons.","zh":"葛藤可能只需几个季节就能覆盖树木和废弃建筑。"},{"en":"Local groups work to remove kudz us from parks to protect native plants.","zh":"当地团体会从公园清除葛藤，以保护本地植物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) foods or products made from kudzu, such as kudzu starch.","zh":"（较少见）由葛藤制成的食物或产品，例如葛粉／葛根淀粉。"},"examples":[{"en":"Some shops sell sweets thickened with kudzu starch.","zh":"有些店会卖用葛粉增稠的甜点。"}]}],"synonyms":["kudzu vines","invasive vine","Pueraria montana"],"phonetic":"ˈkʊdzuː","extraExplanation":["“Kudzu”来自日语“葛（くず）”，19世纪末被引入美国，曾作为观赏植物与水土保持植物推广；但因为生长极快、缺少天敌，后来在美国南部成为典型的入侵植物。","在美国文化里，kudzu 常被当作“什么都能吞没的藤蔓”的象征，用来形容事物扩张得又快又难控制（比如：The problem spread like kudzu）。"]}
{"word":"kue","summary":{"en":"Kue is a Southeast Asian word used in English to mean a traditional cake or sweet snack, especially Indonesian desserts.","zh":"Kue 常作为外来词出现在英语中，指东南亚（尤指印尼）的传统糕点或甜口小吃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Southeast Asian, especially Indonesian/Malay) a cake, pastry, or sweet snack; often a small traditional dessert sold in markets.","zh":"（东南亚用语，尤指印尼/马来）糕点、甜点或甜口小吃；常指集市上卖的传统小点心。"},"examples":[{"en":"I bought some kue from a street market in Jakarta.","zh":"我在雅加达的街市买了一些 kue（糕点）。"},{"en":"These kue are made with coconut milk and palm sugar.","zh":"这些 kue 是用椰奶和棕榈糖做的。"}]}],"synonyms":["cake","pastry","dessert","sweet snack","treat"],"phonetic":"/kuˈeɪ/","extraExplanation":["“kue”主要见于印尼语（Bahasa Indonesia）语境；在马来西亚/新加坡更常见拼写“kuih”。它不是传统英语词，但在英语旅行、美食文章或菜单里常作为外来词直接使用，指一类本地甜点/点心的总称。","常见搭配会直接说具体品种名（如 kue lapis、kue putu 等），或用英语解释成 “traditional Indonesian sweets/snacks”。"]}
{"word":"kueh","summary":{"en":"Kueh is a general term for traditional Southeast Asian bite-sized cakes/snacks, especially in Singapore and Malaysia.","zh":"Kueh是对东南亚（尤新加坡、马来西亚）传统小糕点/点心的统称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small Southeast Asian snack or dessert (often a steamed, baked, or fried cake/pastry), common in Singapore, Malaysia, and Indonesia","zh":"（东南亚常见的）传统小点心/甜点（常为蒸、烤或炸的糕点/点心），在新加坡、马来西亚和印尼很常见"},"examples":[{"en":"I bought some kueh for breakfast—pandan cake and kuih lapis.","zh":"我买了一些kueh当早餐——香兰蛋糕和九层糕。"},{"en":"At the market, you can find colorful kueh made with coconut milk and rice flour.","zh":"在市场上，你可以找到用椰浆和米粉做的彩色kueh。"}]}],"synonyms":["kuih","kue","traditional rice cakes","Southeast Asian snacks"],"phonetic":"/kweɪ/","extraExplanation":["“kueh”是新马常见拼法之一，也常见作“kuih”（马来语较常用）或“kue” （印尼语较常用）。在新加坡英语语境里，常指各类传统糕点/点心的总称（不只是一种）。","发音在当地口语里常接近“kway”。常见类型包括：kueh lapis（九层糕）、ondeh-ondeh（椰糖糯米团）、ang ku kueh（红龟粿）、kueh talam（椰香双色糕）等。","这种点心与娘惹/峇峇（Peranakan）与马来华人饮食文化关系密切，常见于节庆、拜祭或下午茶点心。"]}
{"word":"kuehneola","summary":{"en":"Kuehneola is the scientific genus name of certain rust fungi that can cause plant rust diseases.","zh":"Kuehneola 是一种锈菌属的学名，部分物种可引起植物锈病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of rust fungi (plant pathogens) that infect certain plants and can cause rust diseases (often seen as orange or yellow spots/powder on leaves).","zh":"一种锈菌属（植物病原真菌）的名称，可感染某些植物并引起“锈病”（叶片上常见橙黄/黄色斑点或粉状孢子堆）。"},"examples":[{"en":"The extension guide listed Kuehneola as one possible cause of rust symptoms on brambles.","zh":"推广手册把 Kuehneola 列为悬钩子类作物出现锈病症状的可能原因之一。"},{"en":"Under the microscope, the lab compared spore structures to descriptions of Kuehneola species.","zh":"在显微镜下，实验室将孢子结构与 Kuehneola 各物种的描述进行比对。"}]}],"synonyms":["rust fungus (genus)"],"phonetic":"/kjuːˈniːoʊlə/","extraExplanation":["这是一个拉丁化的生物学属名，通常出现在植物病理学、真菌学或农业检测报告中。日常英语交流里很少用到，多为学术/专业语境。","属名的读法在英语里常按拉丁学名的英语习惯近似发音；不同地区/学者之间可能有轻微差异。"]}
{"word":"kuei","summary":{"en":"“Kuei” is usually an older-style spelling for a Chinese sound (often now written “gui”) or a Chinese name; it is not a common English word.","zh":"“Kuei”多为旧式中文音译拼写（常对应今拼音“gui”等）或中文姓名拼写，并非常见英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a spelling used in older Romanization systems (especially Wade–Giles) for some Chinese syllables that are now usually written as “gui” (and sometimes “kui”) in Hanyu Pinyin; seen in older books, maps, or names.","zh":"一种较旧的中文罗马字拼写（尤其见于威妥玛拼音 Wade–Giles），常对应现在汉语拼音里的“gui”（有时也会让人联想到“kui”）；多见于旧书、老地图或人名地名的旧译写。"},"examples":[{"en":"In older histories, you may see “Kuei-chou,” which is now commonly written as “Guizhou.”","zh":"在较老的历史书里，你可能会看到“Kuei-chou”，现在更常写作“Guizhou（贵州）”。"},{"en":"Some immigrants kept the spelling “Kuei” in their family name, even after Pinyin became standard.","zh":"有些移民即使在汉语拼音普及后，仍保留“Kuei”作为家族姓氏的拼写。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal or family name spelled “Kuei,” usually of Chinese origin (a transliteration rather than an English word).","zh":"“Kuei”作人名或姓氏的拼写，通常源自中文音译（更像姓名拼写，而不是英语词汇本身）。"},"examples":[{"en":"Dr. Kuei will speak at the conference tomorrow.","zh":"Kuei博士明天将在会议上发言。"},{"en":"Kuei is the spelling on his passport.","zh":"他的护照上拼写为Kuei。"}]}],"synonyms":["(no direct English synonym; modern Pinyin forms vary by context)"],"phonetic":"/ɡweɪ/","extraExplanation":["“Kuei”本身不是常规英语词汇，更常见于旧式中文音译或姓名拼写。","威妥玛拼音（Wade–Giles）曾在英语世界广泛使用，所以你会在老文献里看到很多以 -kuei、-chou、-hsien 等结尾的拼法；后来汉语拼音（Hanyu Pinyin）成为主流后，对应拼法往往变成 gui、zhou、xian 等。","如果你是在某个具体语境里看到 kuei（比如菜单、地名、诗歌/小说里的人名），把原句发我，我可以帮你判断它更可能对应哪个中文音节与含义。"]}
{"word":"kues","summary":{"en":"Cue means a signal or prompt (often in theater), and it can also mean a pool stick; as a verb, it means to give a signal or set something ready.","zh":"Cue 表示“提示/信号”（常用于戏剧等场景），也可指“台球杆”；作动词表示“提示、示意”或“把内容调到准备播放/使用的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a signal, hint, or prompt that tells you what to do or what will happen next","zh":"提示；信号；暗示（告诉你该做什么或接下来会发生什么）"},"examples":[{"en":"That look was a cue for me to stop talking.","zh":"那个眼神是在提示我别再说了。"},{"en":"When the music changes, that’s your cue to enter.","zh":"音乐一变，就是你进场的提示。"}]},{"partOfSpeech":"n.","definition":{"en":"a line or action that reminds an actor what to say or do next, especially in theater or film","zh":"（戏剧/影视中）提词；提示台词或动作的信号"},"examples":[{"en":"The actor missed his cue and came on stage too early.","zh":"演员错过提示，太早上台了。"},{"en":"She waited for her cue before speaking.","zh":"她等到提示后才开口。"}]},{"partOfSpeech":"n.","definition":{"en":"a long stick used to hit the ball in games like pool or billiards","zh":"（台球）球杆"},"examples":[{"en":"He chalked his cue before the next shot.","zh":"他在下一杆前给球杆擦了粉。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give someone a signal or prompt to start doing something","zh":"给（某人）提示；示意开始做某事"},"examples":[{"en":"The director cued the actors to begin.","zh":"导演示意演员开始。"},{"en":"She cued the music on her phone.","zh":"她在手机上把音乐调到准备播放的状态。"}]}],"synonyms":["signal","prompt","hint","clue","indicator"],"phonetic":"/kjuː/","extraExplanation":["你输入的 “kues” 很可能是拼写错误，常见目标词是 “cue /kjuː/”。英语里 “cue” 和 “queue” 发音相同（/kjuː/），但意思不同：cue=提示/暗示；queue=队列/排队。"]}
{"word":"kuffieh","summary":{"en":"Kuffieh (more commonly spelled keffiyeh) is a traditional Middle Eastern scarf worn for protection and cultural identity.","zh":"Kuffieh（更常见拼作 keffiyeh）是中东传统头巾/围巾，用于防护，也承载文化身份意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Middle Eastern scarf (often cotton), usually worn on the head or around the neck for protection from sun, wind, and dust; also worn as a cultural or political symbol","zh":"（中东传统）头巾/围巾（多为棉质），常戴在头上或围在颈部，用于防晒、防风、防沙；也可作为文化或政治象征"},"examples":[{"en":"He wrapped a keffiyeh around his neck to keep the dust out.","zh":"他把一条keffiyeh（中东头巾）围在脖子上，防止灰尘进入。"},{"en":"In some places, the keffiyeh is part of traditional everyday clothing.","zh":"在一些地方，keffiyeh 是传统日常服饰的一部分。"},{"en":"The black-and-white keffiyeh is sometimes associated with Palestinian identity.","zh":"黑白格的 keffiyeh 有时与巴勒斯坦身份认同相关联。"}]}],"synonyms":["keffiyeh","kefiya","kufiya","shemagh","ghutra"],"phonetic":"/kəˈfiːjə/","extraExplanation":["“kuffieh”是“keffiyeh”的较少见拼写变体。英语里更常见的拼法还有“kefiya”“kufiya”，不同拼法主要来自阿拉伯语音译差异。","在跨文化语境中使用或穿戴keffiyeh时，最好了解其文化与历史含义（在某些场合也带有政治象征），并避免把它当作单纯“时尚道具”来嘲弄或刻板化呈现。","相关词：ghutra（海湾地区常见的白色头巾）、shemagh（另一种常见的格纹头巾，部分地区更常用）。"]}
{"word":"kufic","summary":{"en":"Kufic is an early, angular style of Arabic script, and it can also describe writing or art done in that style.","zh":"Kufic 指阿拉伯文字的一种早期、棱角分明的书写风格（库法体），也可用来形容采用这种风格的文字或艺术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early, angular style of Arabic writing used especially in early Qur’an manuscripts, inscriptions, and Islamic art","zh":"库法体（阿拉伯文字的一种早期、棱角分明的书写风格，常见于早期《古兰经》手抄本、碑刻与伊斯兰艺术装饰）"},"examples":[{"en":"The museum displayed a Qur’an page written in Kufic.","zh":"博物馆展出了一页用库法体书写的《古兰经》手抄页。"},{"en":"The coin’s inscription is in Kufic script.","zh":"这枚硬币上的铭文是库法体。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Kufic style of Arabic writing","zh":"库法体的；与库法体书写风格有关的"},"examples":[{"en":"The building has Kufic calligraphy carved above the doorway.","zh":"门楣上雕刻着库法体书法。"},{"en":"She studied Kufic letter shapes for her design project.","zh":"她为设计项目研究库法体的字母造型。"}]}],"synonyms":["Kufic script","early Arabic script","Arabic calligraphy (general)"],"phonetic":"/ˈkuːfɪk/","extraExplanation":["“Kufic”源自伊拉克古城Kufa（库法）。这种字体以直线与几何感强著称，常用于早期伊斯兰时期的抄写与建筑装饰；在现代也常见于标志设计、图案与装饰性书法中。"]}
{"word":"kufiyeh","summary":{"en":"A kufiyeh is a traditional Middle Eastern headscarf (often called a keffiyeh).","zh":"kufiyeh 指中东传统头巾（也常写作 keffiyeh）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Middle Eastern headscarf, often a square cloth worn folded and wrapped around the head and neck (also spelled keffiyeh)","zh":"中东传统头巾（常为方形布巾，折叠后缠绕于头部与颈部；也拼作 keffiyeh）"},"examples":[{"en":"He wore a black-and-white kufiyeh to protect his face from dust and sun.","zh":"他戴着黑白相间的库菲耶头巾来防尘、防晒。"},{"en":"In many places, the kufiyeh is part of everyday dress as well as special occasions.","zh":"在许多地方，库菲耶头巾既用于日常穿着，也用于特殊场合。"}]}],"synonyms":["keffiyeh","headscarf","scarf"],"phonetic":"/kəˈfiːjə/","extraExplanation":["“kufiyeh/keffiyeh”在英语里常指阿拉伯世界常见的头巾。不同地区可能有不同叫法与戴法（如 ghutra 等）。","在一些语境中，kufiyeh 也可能带有文化或政治象征意义；在使用或描述时，尽量尊重其文化背景，并注意场合与措辞。","拼写差异较常见：kufiyeh、keffiyeh、kefiyah 等；但通常都指同一种（或非常接近的）头巾。"]}
{"word":"kuge","summary":{"en":"“Kuge” is a borrowed Japanese term meaning an Imperial Court noble in premodern Japan.","zh":"“kuge”是借自日语的词，指日本近代以前的朝廷贵族（公家）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese court noble; a member of the aristocratic class centered around the Imperial Court (especially in premodern Japan).","zh":"（日本历史）公家；朝廷贵族；指以天皇朝廷为中心的贵族阶层（尤指近代以前）。"},"examples":[{"en":"In the Heian period, kuge families held high ranks at the Imperial Court.","zh":"在平安时代，许多公家家族在朝廷中担任高位。"},{"en":"The warlords gained power, but the kuge still kept ceremonial status.","zh":"武家掌握了实权，但公家仍保有礼仪与象征性的地位。"}]}],"synonyms":["court noble","aristocrat","Imperial Court nobility"],"phonetic":"/ˈkuːɡeɪ/","extraExplanation":["“kuge”是日语词（常见于历史、文学、游戏或动漫语境），不是现代日常英语词汇；英文里通常直接借用日语拼写“kuge”。","与“samurai（武士）/ buke（武家）”相对：公家更偏向朝廷官职、文化与礼仪传统；武家更偏向军事与地方统治。","如果你本来想查的是英文单词“gouge（凿/敲竹杠）”“kudos（赞扬）”或别的拼写相近词，也可以告诉我使用场景，我可以帮你确认。"]}
{"word":"kugel","summary":{"en":"Kugel is a Jewish baked casserole, usually made with noodles or potatoes, often eaten on the Sabbath and holidays.","zh":"Kugel 指犹太传统的烤砂锅/焗烤菜，常用面条或土豆做，多在安息日和节日食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Jewish (Ashkenazi) baked casserole, most commonly made with egg noodles or potatoes, often served on the Sabbath and holidays.","zh":"库格尔（犹太阿什肯纳兹传统烤砂锅/焗烤菜），最常见用蛋面条或土豆制作，常在安息日和节日食用。"},"examples":[{"en":"My neighbor brought noodle kugel to the holiday dinner.","zh":"我的邻居带了面条库格尔去参加节日晚餐。"},{"en":"Potato kugel is crispy on top and soft inside.","zh":"土豆库格尔表面酥脆，里面松软。"},{"en":"At the synagogue picnic, there were trays of kugel and challah.","zh":"在会堂的野餐上，有一盘盘库格尔和哈拉面包。"}]}],"synonyms":["casserole","noodle pudding","potato pudding"],"phonetic":"/ˈkuːɡəl/","extraExplanation":["“Kugel”来自意第绪语（Yiddish），与德语中表示“球/圆形”的词同源；早期的库格尔常做成圆形，后来在北美更常见的是长方形烤盘版。","常见口味分为甜味（例如加糖、肉桂、葡萄干、奶酪/奶油）和咸味（例如土豆、洋葱、胡椒）。在英语语境里说“noodle kugel”或“potato kugel”能更清楚地说明是哪一种。","在美国文学与影视中，kugel常用来表现犹太家庭餐桌与节日氛围；它像“chicken soup（鸡汤）”“latkes（土豆饼）”一样，带有明显的文化身份与怀旧意味。"]}
{"word":"kugelhof","summary":{"en":"Kugelhof is a traditional ring-shaped yeast cake from Alsace and nearby regions (often spelled “kugelhopf”).","zh":"Kugelhof是一种传统的环形酵母甜蛋糕，来自阿尔萨斯及周边地区（常拼作kugelhopf）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ring-shaped yeast cake (often with raisins or almonds), traditionally from Alsace (France) and nearby German-speaking regions; also spelled “kugelhopf.”","zh":"一种环形的发酵甜蛋糕（常加入葡萄干或杏仁），传统来自法国阿尔萨斯及周边德语区；也常拼作“kugelhopf”。"},"examples":[{"en":"For breakfast in Strasbourg, I had a slice of kugelhof with coffee.","zh":"在斯特拉斯堡吃早餐时，我配咖啡吃了一片kugelhof。"},{"en":"She baked a kugelhof and dusted it with powdered sugar.","zh":"她烤了一个kugelhof，并在表面撒了糖粉。"}]}],"synonyms":["kugelhopf","Gugelhupf","Alsatian yeast cake"],"phonetic":"/ˈkuːɡəlˌhɔf/","extraExplanation":["“kugelhof”更常见的标准拼法是“kugelhopf / Gugelhupf”。它通常用带中空烟囱的环形模具烤制，外形有点像bundt cake（圆环蛋糕），但传统版本多为酵母发酵面团，口感更接近面包与蛋糕之间。","在欧洲饮食文化中，它常出现在节庆、周末早餐或下午茶场景，属于带有地域特色的传统点心。"]}
{"word":"kugels","summary":{"en":"“Kugels” means more than one kugel, a Jewish baked noodle- or potato-based casserole.","zh":"“kugels”是 kugel 的复数，指一种犹太传统的面条或土豆烤制砂锅/布丁类菜肴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of kugel: a traditional Ashkenazi Jewish baked casserole, often made with noodles or potatoes and usually served as a side dish (sometimes sweet, sometimes savory).","zh":"kugel 的复数：一种传统的阿什肯纳兹犹太烤制砂锅/布丁类菜肴，常用面条或土豆制成，通常作为配菜（可甜可咸）。"},"examples":[{"en":"They brought two kugels to the potluck—one sweet noodle kugel and one savory potato kugel.","zh":"他们带了两份 kugel 去聚餐——一份甜的面条 kugel，一份咸的土豆 kugel。"},{"en":"Kugels are often served at Shabbat meals and holiday gatherings.","zh":"kugels 常在安息日餐和节日聚会中出现。"}]}],"synonyms":["kugel","noodle pudding","potato pudding"],"phonetic":"/ˈkuːɡəl/","extraExplanation":["“Kugel”源自意第绪语（Yiddish），与德语里表示“球/圆形”的词有关；早期的 kugel 可能更偏圆形或团状，后来发展成常见的烤盘砂锅做法。","在北美语境里，人们常说“noodle kugel（面条布丁/烤面条）”和“potato kugel（土豆饼/土豆烤砂锅）”；甜口版本常会加糖、肉桂、葡萄干或奶制品。"]}
{"word":"kuhnia","summary":{"en":"“Kuhnia” (more often spelled “kukhnya”) is a Russian word meaning “kitchen,” sometimes used to evoke Russian kitchen culture or behind-the-scenes talk.","zh":"“kuhnia”（更常见写法为“kukhnya”）是俄语“厨房”，有时也用来指俄式厨房文化或幕后私下讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Russian word meaning “kitchen”; also used in English-language contexts to refer to Russian cuisine, kitchen culture, or (informally) behind-the-scenes political or organizational “kitchen talk.”","zh":"俄语词，意思是“厨房”；在英语语境中也可指俄式饮食/厨房文化，或（非正式）指政治、组织内部“幕后讨论/小圈子聊天”。"},"examples":[{"en":"In Russian, “кухня (kuhnia/kukhnya)” means “kitchen.”","zh":"在俄语里，“кухня（kuhnia/kukhnya）”就是“厨房”。"},{"en":"The book explores Soviet life through the lens of the communal kuhnia.","zh":"这本书从“公共厨房（kuhnia）”的角度探讨苏联时期的生活。"},{"en":"They joked that the real decisions were made in the kuhnia, not in the meeting room.","zh":"他们开玩笑说，真正的决定是在“厨房（kuhnia）”里做出的，而不是在会议室。"}]}],"synonyms":["kitchen","kukhnya"],"phonetic":"/ˈkʊxnjə/","extraExplanation":["“kuhnia”更常见的拉丁转写是“kukhnya”，对应俄语“кухня”。因为俄语里有一个类似喉音的辅音“х”，所以不同转写会出现 h/kh 的差异。","在俄罗斯与一些东欧文化里，“厨房”常被视为家庭或朋友私下聊天、吐槽与交换消息的核心空间，因此“厨房”也常被引申为“幕后谈话/私密社交圈”。","若你是在菜单或餐厅名里看到它，通常更接近“俄式厨房/家常菜”的文化含义；若在社会学或政治语境中出现，则可能强调“非正式、私下”的讨论场景。"]}
{"word":"kui","summary":{"en":"“kui” is most often seen in English as a Māori loanword meaning an elderly woman (often respectfully), or as a personal name/surname.","zh":"“kui”在英文中多见于：毛利语借词，指年长女性（常带尊称语感）；也可作为人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Māori) an elderly woman; sometimes used as a respectful way to refer to a grandmother/elder woman in Māori culture.","zh":"（源自毛利语）年长女性；在毛利文化语境中有时可用于尊称祖母/女性长者。"},"examples":[{"en":"In the story, the kui gives the children advice about respect and family.","zh":"在故事里，这位kui给孩子们关于尊重与家庭的建议。"},{"en":"She learned some Māori words, like kui, to speak politely with elders.","zh":"她学了一些毛利语词汇，比如kui，用来礼貌地和长者交流。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name or surname (used in different cultures/regions).","zh":"人名或姓氏（在不同文化/地区中使用）。"},"examples":[{"en":"Kui is her family name.","zh":"Kui是她的姓。"},{"en":"Mr. Kui will join the meeting at 3 p.m.","zh":"Kui先生将于下午三点参加会议。"}]}],"synonyms":["grandmother","elder woman","matriarch"],"phonetic":"/ˈkuː.i/","extraExplanation":["“kui”并不是常见的标准英文词汇；在英文文本中出现时，最常见的是作为毛利语借词（指女性长者），或作为人名/姓氏。","如果你指的是中文拼音“kui”，它可能对应多个汉字（如：亏、奎、魁、葵等），含义差别很大；最好提供上下文或汉字以便准确解释。"]}
{"word":"kuichua","summary":{"en":"Quechua is an Indigenous Andean language family and can also refer to the Quechua people.","zh":"Quechua（克丘亚）指安第斯原住民语言族，也可指克丘亚族群/克丘亚人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled Quechua) A family of Indigenous languages of the Andes, especially in Peru, Bolivia, and Ecuador; also the most widely spoken Indigenous language group in South America.","zh":"（也常拼作 Quechua）安第斯山区的原住民语言族，主要分布在秘鲁、玻利维亚和厄瓜多尔；也是南美洲使用人数最多的原住民语言群。"},"examples":[{"en":"Many people in Peru speak Quechua at home and Spanish at school.","zh":"在秘鲁，很多人在家里说克丘亚语，在学校说西班牙语。"},{"en":"The museum offers audio guides in English, Spanish, and Quechua.","zh":"这家博物馆提供英语、西班牙语和克丘亚语的语音导览。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who belongs to the Quechua peoples (Indigenous groups in the Andes).","zh":"克丘亚人；安第斯地区的克丘亚族群成员。"},"examples":[{"en":"She is Quechua and learned traditional weaving from her grandmother.","zh":"她是克丘亚人，从外婆那里学会了传统织布。"},{"en":"Quechua communities have preserved many ancient farming practices.","zh":"克丘亚社区保留了许多古老的农耕方式。"}]}],"synonyms":["Kichwa","Kichua"],"phonetic":"/ˈkɛtʃwə/","extraExplanation":["你输入的“kuichua”常见于把发音用拼音式写法记下来；标准英语更常写 **Quechua**（也见 **Kichwa/Kichua**，多与厄瓜多尔等地的拼写习惯有关）。","在英语里，这个词既可指“语言”，也可指“族群/人”。语境中常通过搭配来判断：**speak Quechua**（说克丘亚语）、**Quechua people/communities**（克丘亚人/社区）。"]}
{"word":"Kuizhou","summary":{"en":"Kuizhou is a historical Chinese prefecture name, associated with today’s Fengjie (Chongqing) near the Three Gorges.","zh":"Kuizhou（夔州）是中国古代的州名，主要对应今重庆奉节一带，靠近长江三峡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical prefecture (prefecture-level region) in imperial China, centered around today’s Fengjie area in Chongqing, near the Three Gorges of the Yangtze River; also used as a historical place name in literature and history.","zh":"中国古代的一个州（地方行政区），治所在今重庆奉节一带，靠近长江三峡；也常作为历史地名出现在史书与文学作品中。"},"examples":[{"en":"Du Fu wrote several famous poems while living in Kuizhou near the Three Gorges.","zh":"杜甫在靠近三峡的夔州居住时写下了多首名篇。"},{"en":"The record says the officials were reassigned from Kuizhou to another prefecture.","zh":"史料记载官员从夔州调任到另一州。"}]}],"synonyms":["Kui Prefecture","夔州","Kuizhou Prefecture"],"phonetic":"/kweɪˈdʒoʊ/","extraExplanation":["“夔州（Kuizhou）”在唐宋时期尤其常见，地理上扼守长江三峡要冲，交通与军事意义突出。","文学上最有名的关联之一是杜甫晚年寓居夔州（今奉节一带），其诗中常写峡江风景与漂泊心境；因此在中文语境里，“夔州”也常带有浓厚的文化与诗意色彩。","现代地名中一般不再作为行政区使用；讨论历史或文学时才会用到这一称呼。"]}
{"word":"kujawiak","summary":{"en":"A traditional Polish folk dance (and its music) from the Kujawy region, typically slow-to-moderate in triple time.","zh":"一种源自波兰库亚维地区的传统民间舞（及其舞曲），多为较慢到中速的三拍子风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Polish folk dance (and its music) from the Kujawy region, usually in a slow-to-moderate triple meter and often considered one of the three main “mazurka-type” dances.","zh":"库亚维亚克（kujawiak）：一种源自波兰库亚维地区（Kujawy）的传统民间舞（及其舞曲），通常为较慢到中速的三拍子，经常被视为“马祖卡类”三大舞之一。"},"examples":[{"en":"The ensemble performed a kujawiak before moving on to faster dances.","zh":"乐团表演了一段库亚维亚克舞，然后才转向更快的舞种。"},{"en":"In this piece, the kujawiak rhythm feels gentle and lyrical.","zh":"在这首曲子里，库亚维亚克的节奏听起来温柔而抒情。"}]}],"synonyms":["mazurka (related)","oberek (related)","Polish folk dance (broad term)"],"phonetic":"/kuːˈjɑːviˌɑːk/","extraExplanation":["“Kujawiak”来自波兰语，字面意思与“库亚维（Kujawy）地区的人/事物”相关，因此既指舞蹈也常指其音乐风格。","它常与另外两种“马祖卡类”舞蹈并列：较快更活泼的 oberek，以及介于其间、节奏更有跳跃感的 mazur。学习时可把 kujawiak 记成这三者里最柔和、最抒情的那一种。","在古典音乐中，作曲家有时会借用 kujawiak 的节奏与风格写成钢琴曲或管弦乐段落，用来营造朴素、乡土、温柔的氛围。"]}
{"word":"kuk","summary":{"en":"“kuk/KUK” is either an offensive slur for Korean people (avoid using it) or an acronym whose meaning depends on context.","zh":"“kuk/KUK”可能是对韩国人的冒犯性蔑称（应避免使用），也可能是需结合语境判断含义的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, offensive) A derogatory term for a Korean person; used as an ethnic slur.","zh":"（俚语，冒犯性）对韩国人的蔑称/种族歧视用语。"},"examples":[{"en":"Please don’t use that word—it’s an ethnic slur and can seriously hurt people.","zh":"请不要用这个词——它是种族歧视用语，会严重伤害他人。"},{"en":"Some platforms remove posts containing slurs like this to prevent harassment.","zh":"一些平台会删除包含这类侮辱性词语的内容，以防止骚扰。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation or acronym that can stand for different things depending on the context (for example, a company, an organization, or a place code).","zh":"缩写/首字母缩略词；具体指代因语境而异（例如公司、组织或地点代码）。"},"examples":[{"en":"What does KUK stand for in this document?","zh":"在这份文件里，KUK 代表什么？"},{"en":"KUK can mean different things in different fields, so check the context.","zh":"KUK 在不同领域可能有不同含义，所以要看语境。"}]}],"synonyms":["Korean (neutral term for nationality/ethnicity)","acronym","abbreviation"],"phonetic":"/kʌk/","extraExplanation":["“kuk”作为对韩国人的蔑称，常见于英语网络辱骂语境；即使在引用或开玩笑时也可能造成伤害。若你想表达“韩国人/韩国的”，更合适的中性说法是“a Korean person / Korean”。","如果你看到“KUK”是出现在文件、学校、公司名称或地图/代码里，它更可能是缩写。你可以把出现它的整句话或截图发来，我可以帮你判断具体指什么。"]}
{"word":"kukang","summary":{"en":"“Kukang” is a Malay/Indonesian word used for a slow loris, a small nocturnal primate.","zh":"“Kukang”是马来语/印尼语中对“懒猴”（一种小型夜行灵长类动物）的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slow loris (a small nocturnal primate from Southeast Asia), especially the Sunda slow loris","zh":"懒猴（东南亚的一种小型夜行灵长类动物），尤指巽他懒猴"},"examples":[{"en":"In Indonesia, people sometimes call a slow loris a “kukang.”","zh":"在印度尼西亚，人们有时把懒猴叫作“kukang”。"},{"en":"The kukang moves slowly and quietly through the trees at night.","zh":"懒猴在夜里缓慢、安静地在树上移动。"},{"en":"Many wildlife groups warn that the kukang should not be kept as a pet.","zh":"许多野生动物保护组织提醒：懒猴不应被当作宠物饲养。"}]}],"synonyms":["slow loris","loris"],"phonetic":"/kuːˈkɑŋ/","extraExplanation":["“Kukang”主要来自马来语/印尼语，在英语语境中常作为外来词使用，指“懒猴（slow loris）”。在野生动物保护话题里也较常见，因为懒猴涉及非法宠物贸易与保育问题。"]}
{"word":"kukeri","summary":{"en":"Kukeri are Bulgarian masked ritual performers who dance and parade to chase away evil and bring good luck.","zh":"庫克里是保加利亞的蒙面儀式表演者，透過舞蹈與遊行驅邪並祈求好運。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Bulgarian culture) Masked folk performers who take part in traditional winter or early-spring rituals to chase away evil and welcome health and a good harvest.","zh":"（保加利亞文化）庫克里：參與冬季或早春傳統儀式的蒙面民俗表演者，旨在驅邪避凶、祈求健康與豐收。"},"examples":[{"en":"In Bulgaria, the kukeri parade through villages wearing scary masks and large bells.","zh":"在保加利亞，庫克里會戴著嚇人的面具、繫著大鈴鐺在村莊裡遊行。"},{"en":"The festival featured kukeri dancing to symbolically drive away bad spirits.","zh":"節慶中有庫克里舞蹈表演，象徵性地趕走邪靈與厄運。"}]}],"synonyms":["masked ritual performers","mummers","masked dancers"],"phonetic":"/kuˈkɛri/","extraExplanation":["「Kukeri」在英文中常當作複數名詞使用（也可見單數形式「kuker」）。他們通常穿著毛皮或色彩鮮豔的服裝，配戴木雕或獸形面具，並搖響大鈴鐺製造聲響，這種「以噪音驅邪」的觀念在巴爾幹地區的民俗裡很常見。","在介紹民俗時，也常把 kukeri 與英文的「mummers（化裝遊行者）」或「masked dancers（蒙面舞者）」做類比，但 kukeri 指的是特定的保加利亞傳統。"]}
{"word":"kuki","summary":{"en":"Kuki usually refers to an ethnic group in Northeast India and nearby regions, and also to their related languages; it can also be used as an adjective meaning “of the Kuki people.”","zh":"Kuki 通常指印度东北部及周边地区的库基族群，也可指其相关语言；作形容词可表示“库基人的/与库基文化相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of ethnic communities (the Kuki people) living mainly in Northeast India (especially Manipur, Mizoram, Assam) and parts of Myanmar and Bangladesh","zh":"库基人：主要分布在印度东北部（尤其曼尼普尔、米佐拉姆、阿萨姆）以及缅甸和孟加拉部分地区的一些民族群体的统称"},"examples":[{"en":"Many Kuki communities live in the hills of Manipur.","zh":"许多库基人社区生活在曼尼普尔的山区。"},{"en":"The Kuki people have rich traditions in music and oral storytelling.","zh":"库基人拥有丰富的音乐与口述故事传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Kuki (Kuki-Chin) languages: a group of related languages spoken by Kuki and related peoples in Northeast India and Myanmar","zh":"库基语（库基—钦语支）：库基人及相关族群在印度东北部与缅甸使用的一组亲缘语言"},"examples":[{"en":"She studies Kuki languages as part of her research on the Kuki-Chin language group.","zh":"她研究库基语，作为她对库基—钦语群研究的一部分。"},{"en":"Different villages may speak different Kuki varieties.","zh":"不同村落可能使用不同的库基语变体。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Kuki people or their languages and culture","zh":"库基人的；与库基语言或库基文化相关的"},"examples":[{"en":"They organized a Kuki cultural festival in the city.","zh":"他们在城市里举办了库基文化节。"},{"en":"The museum displayed Kuki textiles and traditional tools.","zh":"博物馆展出了库基织物和传统工具。"}]}],"synonyms":["Kuki people","Kuki-Chin","Kuki-Chin languages"],"phonetic":"/ˈkuːki/","extraExplanation":["“Kuki”常见于南亚与东南亚相关的新闻、历史与人类学语境，涉及族群认同、语言分类与地区政治等话题。作为族名/语言名时通常首字母大写（Kuki）。","如果你原本想输入的是“cookie（饼干）”，拼写是 cookie，读音也接近 /ˈkʊki/；而专名 Kuki 更常读 /ˈkuːki/。你可以告诉我你想查哪一个，我可以给对应的词条与例句。"]}
{"word":"kukoline","summary":{"en":"“Kukoline” is not a common English word; it is likely a proper name or a misspelling.","zh":"“Kukoline”不是常见英语词；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a proper name (e.g., a username, brand, or place name) or a misspelling of another word.","zh":"不是常见英语词典中的标准词；更可能是专有名词（如用户名、品牌名、地名）或其他词的拼写错误。"},"examples":[{"en":"I saw the name “Kukoline” on a product label, but I couldn’t find its meaning in English.","zh":"我在产品标签上看到“Kukoline”这个名字，但在英语里查不到它的含义。"},{"en":"Is “Kukoline” a brand name, or did you mean a different word?","zh":"“Kukoline”是品牌名吗，还是你想写的是另一个词？"}]}],"phonetic":"/ˈkuːkəlaɪn/","extraExplanation":["“Kukoline”在英语里不像是常用词汇；如果你能提供它出现的语境（例如：句子、品牌/包装、国家或语言来源），我可以帮你判断它是否是：1）专有名词的音译/拼写变体；2）某个词的误拼（比如某些以 -line 结尾的词）；3）某种小语种或人名的转写形式。","如果你是想问发音：按英文拼写习惯可暂时读作 /ˈkuːkəlaɪn/（近似“库克-莱恩”），但专名的真实读法可能因来源语言而不同。"]}
{"word":"kukri","summary":{"en":"A kukri is a Nepalese curved knife used as a tool or weapon.","zh":"Kukri 指尼泊尔的弯刃刀，可作工具或武器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a curved, heavy knife from Nepal, used as both a tool and a weapon (also spelled khukuri)","zh":"尼泊尔的一种弯刃厚重大刀，既可作工具也可作武器（也常拼作 khukuri）"},"examples":[{"en":"He bought a kukri as a souvenir from Nepal.","zh":"他从尼泊尔买了一把库克里刀当纪念品。"},{"en":"A kukri’s forward-curving blade makes it good for chopping.","zh":"库克里刀向前弯的刀刃使它很适合砍削。"},{"en":"In some stories, a kukri is carried for protection on mountain journeys.","zh":"在一些故事里，人们会在山路旅途中携带库克里刀用来自卫。"}]}],"synonyms":["khukuri","Nepalese knife"],"phonetic":"/ˈkʊkri/","extraExplanation":["“Kukri / khukuri”最常与尼泊尔文化联系在一起，尤其与廓尔喀（Gurkha）士兵的传统装备有关，因此在历史、军事或旅行语境中会经常见到。","这种刀的典型特征是刀身前弯、重心靠前，既能砍木、开路，也能用于近身防卫；在英文中它常被当作一种“特色刀具”的专有名词来使用。"]}
{"word":"kukris","summary":{"en":"Kukris are traditional Nepalese curved knives, often linked to the Gurkhas.","zh":"Kukris 指尼泊尔传统的内弯刀，常与廓尔喀士兵相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, heavy knife with a broad, inward-curving blade, traditionally used in Nepal; often associated with the Gurkhas (Nepalese soldiers).","zh":"一种短而厚重、刀刃向内弯曲的刀，源自尼泊尔；常与廓尔喀（尼泊尔士兵）联系在一起。"},"examples":[{"en":"The museum displayed kukris used by Gurkha soldiers.","zh":"博物馆展出了廓尔喀士兵使用过的库克里弯刀。"},{"en":"He bought a kukri as a collector’s item, not as a weapon.","zh":"他买了一把库克里弯刀作为收藏品，而不是当武器。"}]}],"synonyms":["khukuri","curved knife","Gurkha knife"],"phonetic":"/ˈkʊkri/","extraExplanation":["“kukri”也常拼作“khukuri”。在尼泊尔文化中，它既是实用工具（砍柴、切割）也带有象征意义；在英语语境里提到 kukri，常会联想到 Gurkhas 的军刀传统。","“kukris”是复数形式；单数是“a kukri”。"]}
{"word":"kuku","summary":{"en":"“Kuku” most commonly means “chicken” in Swahili and may appear in East African contexts; it can also be a name or nickname.","zh":"“kuku”最常见是斯瓦希里语里的“鸡”，常出现在东非相关语境；也可作人名或昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Swahili) a chicken; poultry (often used when talking about East African food or culture).","zh":"（源自斯瓦希里语）鸡；家禽（常用于东非饮食或文化语境）。"},"examples":[{"en":"In Kenya, “kuku” usually means chicken, and you might see it on a menu.","zh":"在肯尼亚，“kuku”通常指鸡，你可能会在菜单上看到这个词。"},{"en":"We ordered kuku stew with rice.","zh":"我们点了鸡肉炖菜配米饭。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name or nickname in some cultures (used as a given name, surname, or online handle).","zh":"某些文化中的人名或昵称（可作名、姓或网名）。"},"examples":[{"en":"Kuku is her nickname among friends.","zh":"Kuku 是朋友们给她的昵称。"},{"en":"The artist goes by the name Kuku.","zh":"这位艺术家使用 Kuku 这个名字。"}]}],"synonyms":["chicken","poultry"],"phonetic":"/ˈkuːkuː/","extraExplanation":["“kuku”并不是最常见的英语词汇；在英语语境里它多见于借用外来语（尤其是斯瓦希里语）或作为人名/昵称。","如果你本来想查的是英语里的 **cuckoo**（布谷鸟）或口语 **kooky/cuckoo**（“古怪的、疯疯癫癫的”），拼写会更常见、用法也不同。你可以告诉我你的句子，我帮你确认你要找的词。"]}
{"word":"kukui","summary":{"en":"Kukui is the Hawaiian candlenut tree (or its nut), often used for oil and traditional leis.","zh":"Kukui 指夏威夷的烛果树（或其果仁），常用于榨油及制作传统花环饰品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree native to Hawaiʻi (the candlenut tree) whose nuts are used for oil, traditional lamps, and leis","zh":"夏威夷常见的海檬果（石栗）树／烛果树；其果仁可榨油，也可做传统照明与花环（花冠）饰品"},"examples":[{"en":"In Hawaiʻi, you often see kukui trees growing near parks and roads.","zh":"在夏威夷，你常会在公园和路边看到库库伊树。"},{"en":"She wore a kukui nut lei at the welcome ceremony.","zh":"她在欢迎仪式上戴着一串库库伊果（果仁）项链花环。"},{"en":"Kukui oil is used in skincare products.","zh":"库库伊油常用于护肤产品。"}]}],"synonyms":["candlenut","candlenut tree","kukui nut"],"phonetic":"/ˈkuːkuːi/","extraExplanation":["“Kukui”来自夏威夷语，常被称为“candlenut（烛果）”，因为过去人们会把果仁串起来点燃当作简易蜡烛/灯使用。","在夏威夷文化中，kukui 与“光明、指引、守护”有关；kukui nut lei 常用于欢迎、祝福与纪念场合。","kukui（烛果树）也是夏威夷的州树之一，因此在当地具有明显的文化与象征意义。"]}
{"word":"kukulcan","summary":{"en":"Kukulcan is the Maya “Feathered Serpent” deity, strongly associated with Chichén Itzá.","zh":"Kukulcan（库库尔坎）是玛雅文化中的“羽蛇神”，与奇琴伊察关系密切。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major deity in ancient Maya culture, often called the “Feathered Serpent,” associated with wind, rain, creation, and political/religious power (especially linked to Chichén Itzá).","zh":"古代玛雅文化中的重要神祇，常被称为“羽蛇神”，与风、雨、创世以及政治/宗教权力有关（尤与奇琴伊察联系紧密）。"},"examples":[{"en":"Kukulcan is sometimes described as a feathered serpent in Maya art and stories.","zh":"在玛雅艺术与传说中，库库尔坎常被描绘为“羽毛覆盖的蛇”。"},{"en":"The temple at Chichén Itzá is often connected with Kukulcan.","zh":"奇琴伊察的神庙常被认为与库库尔坎有关。"}]}],"synonyms":["Feathered Serpent","Quetzalcoatl (related/parallel)"],"phonetic":"/kuːˈkuːlkɑːn/","extraExplanation":["“Kukulcan”多见于英语历史、考古、旅游与宗教研究语境；在西语或学术写作中也常写作“Kukulkán”。","库库尔坎常被拿来与阿兹特克/托尔特克传统中的“Quetzalcoatl（羽蛇神）”对照：两者形象与职能相近，但来自不同文化与语言体系。","在奇琴伊察的埃尔卡斯蒂略（El Castillo，亦称库库尔坎金字塔）附近，常会提到春分/秋分时出现的“蛇影”现象，这是现代常见的文化解说与旅游叙事之一。"]}
{"word":"kukupa","summary":{"en":"Kukupa is a Māori word meaning the New Zealand pigeon (kererū).","zh":"Kukupa 是毛利语词，指新西兰鸽（kererū）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Māori word for the New Zealand pigeon (also called the kererū), a large native forest pigeon.","zh":"毛利语中指“新西兰鸽”（也叫 kererū），一种新西兰本土森林里常见的大型鸽类。"},"examples":[{"en":"We saw a kukupa feeding on berries high in the trees.","zh":"我们看到一只 kukupa 在高高的树上啄食浆果。"},{"en":"In some New Zealand writing, kukupa is used to emphasize a Māori cultural context.","zh":"在一些新西兰作品中，会用 kukupa 来强调毛利文化语境。"}]}],"synonyms":["kererū","New Zealand pigeon"],"phonetic":"/kuːˈkuːpə/","extraExplanation":["“Kukupa”主要出现在新西兰英语语境中，通常是借用毛利语（te reo Māori）的词汇来指代本土物种；在日常交流里也常见另一个名称“kererū”。","在一些传统与文化语境中，kukupa/kererū与森林、季节性果实等意象相关；使用毛利语词汇也常带有尊重本土文化与强调地方特色的意味。"]}
{"word":"kukuruku","summary":{"en":"“kukuruku” is a playful sound word for a rooster crow, like “cock-a-doodle-doo.”","zh":"“kukuruku”是模仿公鸡打鸣的拟声词，相当于英语的“cock-a-doodle-doo”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An onomatopoeic (sound-like) word used to imitate a rooster’s crow, similar to “cock-a-doodle-doo.”","zh":"拟声词，用来模仿公鸡打鸣的声音，类似英语里的“cock-a-doodle-doo”。"},"examples":[{"en":"At sunrise the kids shouted, “Kukuruku!” to imitate the rooster.","zh":"日出时，孩子们喊“kukuruku！”来模仿公鸡打鸣。"},{"en":"In the story, the farm woke up to a loud “kukuruku.”","zh":"在故事里，农场被一声响亮的“kukuruku”叫醒了。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, informal) A playful way to refer to a rooster’s crowing or the feeling of “morning has started.”","zh":"（引申，非正式）俏皮地指“鸡叫声”，或表达“早晨开始了”的感觉。"},"examples":[{"en":"I heard a kukuruku outside—must be early.","zh":"我听到外面有“kukuruku”的声音——肯定很早了。"},{"en":"No alarm needed; the neighborhood kukuruku wakes me up.","zh":"不用闹钟；附近的“kukuruku”就能把我叫醒。"}]}],"synonyms":["cock-a-doodle-doo","cockcrow","rooster crow"],"phonetic":"/ˌkuːkuˈruːkuː/","extraExplanation":["“kukuruku”更常见于一些语言/地区对鸡叫的拟声（例如部分西语或东欧语境的儿童故事、歌曲、口语模仿）。英语里最常见的对应说法是“cock-a-doodle-doo”。不同语言会用不同的拟声词来写同一种动物叫声，这是很常见的文化与语言差异。"]}
{"word":"kula","summary":{"en":"“Kula” most often refers to the ceremonial gift-exchange system (the Kula ring) in Papua New Guinea; it can also be a place name, especially an area on Maui, Hawaii.","zh":"“Kula”最常指巴布亚新几内亚的仪式性礼物交换体系（库拉圈）；也可作地名，尤指夏威夷毛伊岛的库拉地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Kula (Kula ring): a ceremonial system of gift exchange among island communities in the Milne Bay Province of Papua New Guinea, especially the Trobriand Islands, involving the circulation of shell necklaces and armbands in opposite directions to build trust, status, and social ties","zh":"库拉交换（库拉圈）：巴布亚新几内亚米尔恩湾省一带（尤指特罗布里恩群岛）岛民之间的仪式性礼物交换体系。人们让贝壳项链与贝壳臂环沿相反方向流通，以建立信任、声望与社会关系"},"examples":[{"en":"In anthropology class, we studied the Kula and how it creates long-term partnerships.","zh":"在人类学课上，我们学习了库拉交换，以及它如何促成长期的伙伴关系。"},{"en":"The gifts in the Kula are valuable because of their history and the relationships they represent, not just their materials.","zh":"库拉交换中的礼物之所以珍贵，是因为它们的历史与所代表的关系，而不只是材料本身。"}]},{"partOfSpeech":"n.","definition":{"en":"Kula: a place name, most commonly a district/area on the island of Maui in Hawaii (U.S.)","zh":"Kula：地名，最常见指美国夏威夷州毛伊岛上的库拉地区"},"examples":[{"en":"We drove up to Kula to visit the farms and enjoy the cooler weather.","zh":"我们开车上库拉去参观农场，享受更凉爽的天气。"}]}],"synonyms":["Kula ring","ceremonial exchange"],"phonetic":"/ˈkuːlə/","extraExplanation":["“Kula”常见于人类学著作中，尤其与学者马林诺夫斯基（Bronisław Malinowski）对特罗布里恩群岛的田野研究有关。它常被用来说明：礼物交换不仅是“物品流通”，更是一种维系社会关系与身份地位的制度。","英语里写作大写“Kula”多表示库拉交换体系或地名；小写“kula”在日常英语中不太常见，具体含义常取决于语境（人类学/地理）。"]}
{"word":"kulack","summary":{"en":"Kulack (more commonly spelled kulak) means a wealthy peasant in Russia, and later a Soviet-era label for people accused of being “rich peasants” or rural enemies.","zh":"Kulack（更常见拼写 kulak）指俄国的富农；在苏联时期也常作为政治标签，指被指控为“富农”或农村阶级敌人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a relatively wealthy peasant in Imperial Russia, especially one who owned land, tools, or hired labor","zh":"（沙俄时期）富农；相对富裕、拥有土地或农具、有时雇人劳作的农民"},"examples":[{"en":"In pre-revolutionary Russia, some villagers labeled the most successful farmers as kulaks.","zh":"在革命前的俄国，一些村民把最成功的农民称为富农（kulaks）。"},{"en":"The novel describes tensions between poor peasants and the kulaks in the countryside.","zh":"小说描写了乡村中贫农与富农之间的矛盾。"}]},{"partOfSpeech":"n.","definition":{"en":"(often derogatory) a person accused by Soviet authorities of being a wealthy peasant or an “enemy” in the countryside","zh":"（常带贬义，苏联语境）被当局指控为富农或“农村阶级敌人”的人"},"examples":[{"en":"During collectivization, many families were denounced as kulaks.","zh":"在集体化时期，许多家庭被批斗为“富农”（kulaks）。"},{"en":"He was branded a kulak for owning a few animals and extra grain.","zh":"他因为多养了几只牲畜、存了些余粮就被扣上“富农”的帽子。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of a kulak (also written as kulak; “kulack” is a less common spelling)","zh":"富农的；与富农有关的（也常写作 kulak；kulack 属较少见拼写）"},"examples":[{"en":"The speech condemned “kulak” (or “kulack”) attitudes toward private property.","zh":"演讲谴责了对私有财产的“富农式”态度。"}]}],"synonyms":["kulak","wealthy peasant","rich peasant (historical)"],"phonetic":"/ˈkuːlɑk/","extraExplanation":["“Kulak”原意与俄语中“拳头”有关，暗示“攥紧财产、精明强硬”的形象。后来在苏联政治语境里，它不只是社会经济称谓，也常被当作政治标签，用来指控、打击被认为阻碍集体化的人。英语里更常见拼写是 kulak；kulack 多见于旧译或变体拼写。"]}
{"word":"kulah","summary":{"en":"Kulah means a (often conical) traditional cap/hat, especially in Turkish, Persian, or South Asian cultural contexts.","zh":"Kulah 指一种传统的帽子（常为圆锥形），多见于土耳其、波斯或南亚文化语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cap or hat (often conical), especially in Turkish, Persian, or South Asian contexts; sometimes a traditional or ceremonial headpiece.","zh":"（常呈圆锥形的）帽子、头巾帽；多见于土耳其、波斯或南亚语境中，有时指传统或仪式用的头饰。"},"examples":[{"en":"In the museum, you can see a tall kulah worn by officials in the Ottoman period.","zh":"在博物馆里，你能看到奥斯曼时期官员戴的高高的库拉帽（kulah）。"},{"en":"He bought a simple kulah as part of a traditional costume.","zh":"他买了一顶朴素的库拉帽（kulah），作为传统服饰的一部分。"}]}],"synonyms":["cap","hat","headdress","fez"],"phonetic":"/kuːˈlɑː/","extraExplanation":["“kulah”常见拼写还有“kullah”。在土耳其语中对应“külah”，常指圆锥形帽；在波斯语、乌尔都语等语境里也可泛指帽子。不同地区、不同历史时期的“kulah”外形和用途差异很大：有的用于日常保暖，有的与宗教团体或官方服饰相关。阅读历史或旅行类英文时遇到该词，通常可先理解为“传统帽子/礼帽”。"]}
{"word":"kulaite","summary":{"en":"Kool-Aid is a sweet drink mix brand; informally it can also mean blind, unquestioning belief (as in “drink the Kool-Aid”).","zh":"Kool-Aid是甜味冲饮品牌；口语中也可指“盲目相信/不加质疑地追随”（如 drink the Kool-Aid）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of sweet powdered drink mix, usually mixed with water and sugar; also used to mean a brightly colored, very sweet drink (even if it is not the brand).","zh":"一种甜味粉末饮料冲剂的品牌（通常加水和糖冲泡）；也可泛指颜色很鲜艳、很甜的饮料（即使不是该品牌）。"},"examples":[{"en":"We made a pitcher of Kool-Aid for the kids at the picnic.","zh":"我们在野餐时给孩子们冲了一壶Kool-Aid。"},{"en":"His tongue was stained red from drinking Kool-Aid.","zh":"他喝了Kool-Aid后舌头被染成了红色。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, often negative) unquestioning loyalty to an idea, group, or leader; blind belief.","zh":"（非正式，常带贬义）对某个观点、团体或领袖的盲目相信与追随；不加质疑的忠诚。"},"examples":[{"en":"I like the product, but I’m not going to drink the Kool-Aid and ignore its problems.","zh":"我喜欢这个产品，但我不会“喝Kool-Aid”到忽视它的问题。"},{"en":"Some fans drink the Kool-Aid and believe every rumor online.","zh":"有些粉丝盲目相信，网上的每条传闻都当真。"}]}],"synonyms":["powdered drink mix","sweet drink","blind faith","unquestioning loyalty"],"phonetic":"/ˈkuːl eɪd/","extraExplanation":["你输入的“kulaite”在英语里不是常见拼写；最接近且很常见的词是“Kool-Aid”（酷爱/果珍一类的甜味冲饮品牌）。","“drink the Kool-Aid（喝Kool-Aid）”这个说法来自1978年美国“琼斯镇（Jonestown）事件”：邪教组织成员被迫/被诱导喝下掺毒饮料而死亡。后来它被引申为“盲目相信、照单全收（尤其是对组织或领袖）”。日常使用时通常带批评意味，最好避免用于严肃或敏感场合。"]}
{"word":"kulak","summary":{"en":"A “kulak” is a term from Russian history meaning a wealthy peasant, later used as a political label during Soviet collectivization.","zh":"“kulak”是俄国历史语境中的词，指“富农”，后来在苏联集体化时期常作为政治标签使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wealthy peasant or small landowner in the Russian Empire (and later, in early Soviet usage, a label for peasants considered “rich” or opposed to collectivization)","zh":"（旧俄/苏联语境）富农；（苏联时期常带贬义）被指为“富农”、被视为反对集体化的人"},"examples":[{"en":"In many history books, kulaks are described as better-off peasants who owned more land or livestock than their neighbors.","zh":"在许多历史书中，kulak 被描述为比邻居更富裕的农民，拥有更多土地或牲畜。"},{"en":"During Stalin’s collectivization, people could be labeled kulaks even if they were not truly wealthy.","zh":"在斯大林的集体化时期，即使并不真正富裕，也可能被贴上 kulak（富农）的标签。"},{"en":"The novel mentions a family accused of being kulaks and forced to leave their village.","zh":"小说提到一家人被指控为 kulak（富农），被迫离开村庄。"}]}],"synonyms":["wealthy peasant","rich peasant","peasant landowner"],"phonetic":"/ˈkuːlæk/","extraExplanation":["这个词来自俄语“кулак”，字面意思是“拳头”。在历史语境中，它逐渐变成一种政治标签：苏联集体化时期常用来指“富农”或被认为阻碍政策的人，因此带有强烈的贬义和指控意味。阅读历史材料时，要注意它不一定是中性的社会阶层描述，常带政治宣传色彩。"]}
{"word":"kulaki","summary":{"en":"Kulaki is the plural of kulak, a Soviet-era term for peasants labeled as wealthy and treated as class enemies.","zh":"Kulaki 是 kulak 的复数，指苏联时期被称为“富农”并被当作阶级敌人的农民群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of kulak: in Soviet history, relatively wealthy peasants in Russia/Ukraine who were labeled as class enemies and often persecuted, especially during Stalin’s collectivization.","zh":"“kulak”的复数：苏联历史中指俄国/乌克兰等地相对富裕的农民，被贴上“阶级敌人”的标签，尤其在斯大林集体化时期常遭到迫害。"},"examples":[{"en":"In Soviet propaganda, the kulaki were blamed for food shortages.","zh":"在苏联的宣传中，kulaki 常被指责为粮食短缺的罪魁祸首。"},{"en":"Many kulaki were forced to give up their land during collectivization.","zh":"在集体化过程中，许多 kulaki 被迫交出土地。"}]}],"synonyms":["kulaks","wealthy peasants (contextual)","rich peasants (contextual)"],"phonetic":"/kuːˈlɑːki/","extraExplanation":["这是一个俄语借词（kulak），原意与“拳头”有关，后来在政治语境中被用作阶级标签。它不仅描述经济状况，也常带有强烈贬义与政治指控色彩。","使用时通常出现在历史、政治或学术语境中；日常英语里不常用。若泛指“富农”，更常见的表达是 wealthy peasants（相对富裕的农民），但并不等同于其历史政治含义。"]}
{"word":"kulakism","summary":{"en":"Kulakism means the supposed ideology or influence of Soviet “kulaks,” often used as a political accusation in discussions of collectivization.","zh":"Kulakism 指“富农”相关的思想或势力影响，在谈论苏联集体化等议题时常作为一种政治指控用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Politics, history) The ideology, practices, or social influence associated with “kulaks” (relatively well-off peasants in the former Soviet Union), especially as portrayed by Soviet policy and propaganda.","zh":"（政治/历史）“富农”（苏联语境中指较富裕的农民阶层）相关的思想、做法或社会影响，尤指在苏联政策与宣传话语中对“富农势力”的指称。"},"examples":[{"en":"In Soviet rhetoric, kulakism was blamed for resisting collectivization.","zh":"在苏联的政治话语中，“富农主义”常被指责为抵制集体化。"},{"en":"The article discusses how accusations of kulakism were used to justify harsh measures in the countryside.","zh":"这篇文章讨论了“富农主义”的指控如何被用来为农村的严厉措施辩护。"}]}],"synonyms":["kulak ideology","kulak influence","anti-collectivization sentiment"],"phonetic":"/ˈkuːlɑːˌkɪzəm/","extraExplanation":["“Kulak”一词源自俄语，原意与“拳头”有关，后来在苏联语境中用来指农村中被认为“较富裕”的农民。随着1920—1930年代集体化推进，“kulakism（富农主义）”常作为政治标签使用，含有强烈的指控色彩，未必是中性学术用语。","在英语写作里，kulakism多见于历史研究、政治评论或讨论苏联宣传语言时。使用时最好交代具体历史背景，避免把复杂的农村阶层简单化为固定刻板印象。"]}
{"word":"kulaks","summary":{"en":"Kulaks were “wealthy peasants” in Russia, especially those targeted in Soviet-era campaigns; the word is often historical and sometimes derogatory.","zh":"Kulaks 指俄罗斯的“富农”，尤指苏联时期被运动针对的群体；多用于历史语境，且常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, often derogatory) A relatively wealthy peasant in Russia, especially one accused by the Soviet government of exploiting poorer farmers and resisting collectivization.","zh":"（历史用语，常带贬义）“富农”：俄罗斯较富裕的农民，尤指在苏联时期被指控剥削贫农、反对农业集体化的人。"},"examples":[{"en":"In Soviet propaganda, kulaks were blamed for food shortages.","zh":"在苏联宣传中，富农常被指责是粮食短缺的罪魁祸首。"},{"en":"The novel describes a village where families feared being labeled kulaks.","zh":"这部小说描写了一个村庄，许多家庭害怕被贴上“富农”的标签。"}]}],"synonyms":["wealthy peasants","rich peasants","(Soviet-era) class enemies (contextual)"],"phonetic":"/ˈkuːlæk/","extraExplanation":["“Kulak”原意与俄语中“拳头”有关，暗示其“攥紧财富/有势力”。在20世纪20—30年代苏联推行农业集体化时，“kulak”常被用作政治标签，用来指认或打击被认为“阶级敌人”的农村群体；因此该词在历史叙述中带有强烈意识形态色彩。","英语中常见复数为“kulaks”。写作时需注意语境：在历史研究里可作中性分类词，但在很多文本中仍带贬义或指控意味。"]}
{"word":"kulan","summary":{"en":"A kulan is a Central Asian wild donkey (a type of Asiatic wild ass).","zh":"kulan 指中亚野驴（亚洲野驴的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild donkey (a type of Asiatic wild ass) native to Central Asia, related to the onager","zh":"中亚野驴（亚洲野驴的一种），与“波斯野驴（onager）”近缘"},"examples":[{"en":"The kulan lives on the dry grasslands and deserts of Central Asia.","zh":"中亚野驴生活在中亚的干旱草原和沙漠地区。"},{"en":"Conservationists are working to protect the kulan’s habitat.","zh":"自然保护人士正在努力保护中亚野驴的栖息地。"}]}],"synonyms":["Asiatic wild ass","onager"],"phonetic":"/kuːˈlɑːn/","extraExplanation":["“kulan”常见于动物学与自然纪录片语境，指亚洲野驴（Asiatic wild ass）的一类或其中特定亚种；在更广义的英文资料里，有时也会用“onager”泛指类似的亚洲野驴。","该词多用于科普/学术写作，日常口语里不常见；如果你是在阅读文章或看纪录片遇到它，通常就是在讲中亚的野生有蹄类动物与生态保护。"]}
{"word":"kulanapan","summary":{"en":"“kulanapan” is not recognized as a standard English word; it is likely a name or a term from another language.","zh":"“kulanapan”不是标准英语词汇；更可能是名字或来自其他语言的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a proper name (e.g., a username, place name) or a misspelling/romanization from another language.","zh":"不是标准英语单词。可能是专有名词（如用户名、地名），或来自其他语言的拼写/音译。"},"examples":[{"en":"I found the word “kulanapan” online, but I can’t find it in an English dictionary.","zh":"我在网上看到“kulanapan”，但在英语词典里查不到。"},{"en":"If “kulanapan” is a name, its meaning depends on the language or culture it comes from.","zh":"如果“kulanapan”是名字，它的含义取决于其来源语言或文化。"}]}],"phonetic":"/ˌkuːləˈnɑːpən/","extraExplanation":["“kulanapan”看起来不像常见英语词汇。你能告诉我你在哪里看到的、前后一句话是什么、它是不是人名/地名/品牌名吗？有了语境我可以帮你判断可能的语言来源与含义。"]}
{"word":"kulang","summary":{"en":"Kulang (Filipino/Tagalog) means “not enough” or “to lack.”","zh":"Kulang（菲律宾语/他加禄语）表示“不够/不足”或“缺少”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Tagalog/Filipino) insufficient; not enough; short of what is needed.","zh":"（他加禄语/菲律宾语）不足的；不够的；短缺的。"},"examples":[{"en":"Kulang ang pera ko.","zh":"我的钱不够。"},{"en":"Kulang ang oras para matapos ito.","zh":"时间不够完成这个。"},{"en":"Your explanation is kulang—please add more details.","zh":"你的解释不够——请补充更多细节。"}]},{"partOfSpeech":"v.","definition":{"en":"(Tagalog/Filipino) to lack; to be missing something; to fall short.","zh":"（他加禄语/菲律宾语）缺少；不足；不够。"},"examples":[{"en":"Kulang ako sa tulog.","zh":"我睡眠不足。"},{"en":"Kulang siya sa karanasan.","zh":"他/她经验不足。"}]}],"synonyms":["insufficient","not enough","lacking","short (of)","inadequate"],"phonetic":"/kuˈlɑŋ/","extraExplanation":["“Kulang”常见搭配是“kulang sa + 名词”，表示“在……方面不足/缺少”，如：kulang sa pera（缺钱）、kulang sa oras（缺时间）、kulang sa tulog（睡眠不足）、kulang sa pansin（缺乏关注/注意力）。","在英语语境里，有些菲律宾人会把“kulang”夹在英文句子里当作口语表达，意思接近“not enough / lacking / short”。正式英文写作中通常改用这些英文词更自然。"]}
{"word":"kuldip","summary":{"en":"Kuldip is a South Asian given name (often spelled Kuldeep) and is commonly associated with the meaning “light of the family/clan.”","zh":"Kuldip 是南亚常见的人名（常拼作 Kuldeep），常被解释为“家族/宗族之光”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A South Asian (especially Indian) given name, most commonly spelled Kuldeep or Kuldip; it is used as a person’s first name.","zh":"一个南亚（尤其印度）常见的名字（多写作 Kuldeep 或 Kuldip），通常用作名字。"},"examples":[{"en":"Kuldip is my classmate in English class.","zh":"Kuldip 是我英语课的同学。"},{"en":"Please ask Kuldip to join the meeting at 3 p.m.","zh":"请让 Kuldip 下午三点参加会议。"}]},{"partOfSpeech":"other","definition":{"en":"In meaning and cultural origin, the name is often explained as “light/lamp of the family or clan.”","zh":"从含义与文化来源看，这个名字常被解释为“家族/宗族之光（灯）”。"},"examples":[{"en":"His parents chose the name Kuldip because it means a light for the family.","zh":"他父母选了 Kuldip 这个名字，因为它有“家族之光”的含义。"}]}],"phonetic":"/kʊlˈdiːp/","extraExplanation":["Kuldip 常见于印度语系文化圈（如印地语、旁遮普语等）。在英语环境里，它通常被当作专有名词使用，首字母要大写：Kuldip。","拼写变体很常见：Kuldeep / Kuldeepak / Kuldip 等；发音也可能因地区与个人习惯略有不同。"]}
{"word":"kuli","summary":{"en":"“Kuli” is a spelling variant of “coolie.” In English it refers to a low-paid laborer but is often offensive today; use neutral words like “worker” instead.","zh":"“kuli”是“coolie”的一种拼写形式。英语里指低薪体力劳动者，但如今常被视为冒犯；建议改用更中性的“worker/laborer/porter”等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often offensive in English) a low-paid laborer, especially in Asia; in older Western usage, a term for Asian laborers.","zh":"（英语中常被视为冒犯）苦力、（尤指在亚洲的）低薪体力劳动者；在西方旧用法中常指亚洲劳工。"},"examples":[{"en":"In some old books, Asian workers were described with this word, but today it is considered insulting.","zh":"在一些旧书里，亚洲劳工会被用这个词称呼，但在今天它通常被认为带有侮辱性。"},{"en":"Please avoid using this term in English; say “laborer,” “worker,” or “porter” instead.","zh":"英语里请尽量避免用这个词；可以改用“laborer（体力劳动者）”“worker（工人）”或“porter（搬运工）”。"}]}],"synonyms":["laborer","worker","porter"],"phonetic":"/ˈkuːli/","extraExplanation":["这个词常见于南亚/东南亚语境（如印尼语、马来语中写作 kuli，意思多为“工人、搬运工”），也对应中文“苦力”。但在英语里与殖民时期、种族歧视历史紧密相关，现代语境中容易被理解为种族贬称，因此在写作和口语中建议避免使用。","如果你是在学习印尼语/马来语：kuli 在当地日常语境里未必带强烈侮辱，但在英文翻译时应改译为 worker/laborer/porter（按具体工作选择）。"]}
{"word":"kulimit","summary":{"en":"“kulimit” isn’t a recognized English word; it’s likely a misspelling (e.g., “limit”) or you meant “culminate.”","zh":"“kulimit”不是常见英语词；更可能是拼写错误（如“limit”）或想写“culminate”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“kulimit” is not a standard English word. It may be a misspelling or a transliteration (a word written in English letters from another language). Common English words that look similar are “limit” or “culminate.”","zh":"“kulimit”不是标准英语单词。它可能是拼写错误或音译词（把其他语言用英文字母写出来）。外形相近的常见英语词有“limit（限制）”或“culminate（达到顶点/以……告终）”。"},"examples":[{"en":"I couldn’t find “kulimit” in an English dictionary—did you mean “limit”?","zh":"我在英语词典里找不到“kulimit”——你是不是想写“limit”？"},{"en":"If you meant “culminate,” you could say: “The story culminates in a surprising ending.”","zh":"如果你想表达“culminate”，可以说：“The story culminates in a surprising ending.（故事以一个令人惊讶的结局告终。）”"}]}],"synonyms":["limit","culminate"],"extraExplanation":["如果你能告诉我它出现的句子/语境、想表达的意思，或它来自哪种语言（比如菲律宾语/马来语/印尼语等），我可以更准确地判断它是不是某个外来词、专有名词（人名/地名/品牌），还是你想写的英语单词。"]}
{"word":"kulkarni","summary":{"en":"Kulkarni is a common Indian surname, originally linked to the historical role of a village accountant/record-keeper.","zh":"Kulkarni 是常见的印度姓氏，起源与历史上的“村社会计/文书记录员”这一角色有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common Indian surname (especially in Maharashtra and other parts of western India).","zh":"一个常见的印度姓氏（尤其在马哈拉施特拉邦及印度西部较常见）。"},"examples":[{"en":"Dr. Kulkarni will present the research results today.","zh":"库尔卡尼博士今天将展示研究成果。"},{"en":"My classmate’s last name is Kulkarni.","zh":"我同学的姓是 Kulkarni（库尔卡尼）。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, India) a village accountant or record-keeper; the surname originally comes from this occupational title.","zh":"（印度历史用语）村社的会计/文书记录员；该姓氏最初源自这一职业称谓。"},"examples":[{"en":"In older records, a kulkarni kept land and tax accounts for the village.","zh":"在较早的记录中，kulkarni 负责管理村里的土地与税务账目。"},{"en":"The title later became a family name in many regions.","zh":"后来这个称谓在许多地区演变为家族姓氏。"}]}],"phonetic":"/kʊlˈkɑrni/","extraExplanation":["“Kulkarni”多被英语语境当作专有名词使用（姓氏），通常首字母大写：Kulkarni。","在不同家庭与地区，读音会有细微差异；英语里常见的读法重音落在第二音节（-kar-）附近。"]}
{"word":"kullaite","summary":{"en":"“kullaite” isn’t a common English word; it likely needs context or a corrected spelling.","zh":"“kullaite”不是常见英语词，可能需要语境或纠正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It may be a misspelling or a name/term from a specific context.","zh":"不是常见英语词典中的标准词，可能是拼写错误，或来自某个特定领域/语境的名称或术语。"},"examples":[{"en":"I can’t find “kullaite” as a common English word—could you share a sentence with it?","zh":"我在常见英语词典里查不到“kullaite”——你能提供包含它的句子吗？"},{"en":"Did you mean “collide” (to crash into something) or “Kool-Aid” (a drink brand)?","zh":"你是不是想写“collide”（相撞）或“Kool-Aid”（一种饮料品牌）？"}]}],"extraExplanation":["我更需要一点语境来判断：\n1）这是人名/地名/品牌名吗？\n2）你是在游戏、小说、矿物/化学、或网络用语里看到的吗？\n3）能发一整句或截图吗？\n\n如果你告诉我它出现的句子，我可以帮你确认正确拼写，并给出准确释义与例句。"]}
{"word":"kullani","summary":{"en":"“kullani” is not English; it’s likely an informal/misspelled Turkish form related to “kullanmak” (“to use”).","zh":"“kullani”不是英语；它很可能是与土耳其语“kullanmak”（使用）相关的非正式/误拼形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not an English word. In Turkish, “kullani” is commonly seen as a misspelling or informal writing of forms of the verb “kullanmak” (“to use”). People may intend “kullan” (imperative: “use”) or “kullanıyor” (“is using”), depending on context.","zh":"不是英语单词。在土耳其语中，“kullani”常见于对动词“kullanmak”（“使用”）的误拼或非正式写法。具体可能想写的是“kullan”（祈使：使用）或“kullanıyor”（正在使用）等形式，需看语境。"},"examples":[{"en":"This isn’t an English word—did you mean the Turkish “kullan” (“use”)?","zh":"这不是英语单词——你是不是想写土耳其语的“kullan”（“使用”）？"},{"en":"If you want an English equivalent, you can often use “use” or “apply,” depending on the situation.","zh":"如果你想找英语对应词，通常可以用“use（使用）”或在某些场景用“apply（应用/使用）”，具体看语境。"}]}],"synonyms":["use","apply"],"phonetic":"/kuˈlɑni/","extraExplanation":["“kullanmak”是土耳其语里“使用”的原形动词；“kullan”是对别人下指令的“用/使用（吧）”。“kullanıyor”表示“正在使用”。“kullani”本身不太标准，可能是打字漏了字母（如应为“kullanı-”开头的变形）或网络简写。","如果你能提供一句包含“kullani”的完整句子，我可以更准确判断它想表达的具体形式，并给出最贴切的英语翻译。"]}
{"word":"kulm","summary":{"en":"“Kulm” is a rare spelling/term: usually a variant of “culm” meaning coal dust, and in geology a regional name for certain Lower Carboniferous rocks.","zh":"“kulm”较罕见：通常是“culm”（煤粉/无烟煤碎屑）的异拼；在地质学中也指中欧地区某些下石炭纪地层的区域性名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) Fine coal dust or small pieces of anthracite used as fuel; a variant spelling of “culm.”","zh":"（罕见）煤粉或小块无烟煤，用作燃料；是“culm”的另一种拼写。"},"examples":[{"en":"The factory burned kulm to fire the boiler.","zh":"那家工厂烧煤粉来给锅炉供火。"},{"en":"In older texts, you may see “kulm” where modern writing uses “culm.”","zh":"在较早的文本里，你可能会看到“kulm”，而现代写法更常用“culm”。"}]},{"partOfSpeech":"n.","definition":{"en":"(geology) “Kulm”: a term used especially in central Europe for certain Lower Carboniferous rock formations.","zh":"（地质）“Kulm”：中欧地区较常用的术语，指某些下石炭纪地层/岩层。"},"examples":[{"en":"The report compares limestone layers with nearby Kulm deposits.","zh":"报告把石灰岩层与附近的库尔姆地层沉积作了比较。"},{"en":"Kulm is a regional name, so English textbooks may not use it.","zh":"“Kulm”是地区性名称，所以英文教材里不一定会用到。"}]}],"synonyms":["culm","coal dust","anthracite fines"],"phonetic":"/kʌlm/","extraExplanation":["“kulm”在现代英语里非常少见，多数情况下人们会写“culm”。“culm”更常见的另一个意思是“禾本科植物（如竹子、麦子）的茎秆”，如果你想查的是这个更常用的词义，也可以告诉我语境。","地质学里的“Kulm”源自德语/中欧地层学传统，用作区域性分层名称；在更国际化的英文资料中，常会改用更通用的石炭纪分期与地层名称。"]}
{"word":"kulmet","summary":{"en":"“Kulmet” isn’t standard English; it’s likely a typo. Common intended words include “culminate” or “helmet,” depending on context.","zh":"“kulmet”不是标准英语词，通常是拼写/输入错误；常见可能想写的是“culminate”或“helmet”，需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or typo (commonly for “culminate/culmination” or “helmet,” depending on context).","zh":"不是标准英语单词；多见于拼写错误或打字错误（常见想写的是“culminate/culmination”或“helmet”，取决于语境）。"},"examples":[{"en":"I couldn’t find “kulmet” in an English dictionary—did you mean “culminate”?","zh":"我在英语词典里找不到“kulmet”——你是不是想写“culminate”？"},{"en":"If you meant a head protector, the correct word is “helmet,” not “kulmet.”","zh":"如果你指的是头部防护用品，正确的词是“helmet”，不是“kulmet”。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Likely intended word) “culminate”: to reach the highest point or final result after a process.","zh":"（可能想写的词）“culminate”：在一段过程后达到最高点或最终结果。"},"examples":[{"en":"Months of practice culminated in a great performance.","zh":"几个月的练习最终带来了一场很棒的演出。"},{"en":"The discussion will culminate in a vote tomorrow.","zh":"讨论将于明天以投票告终。"}]}],"synonyms":["culminate","reach a peak","come to a head","end in","result in"],"phonetic":"/ˈkʌl.mə.neɪt/","extraExplanation":["“kulmet”看起来像把 /k/ 当成 /c/ 来拼（比如把 culminate 写成 kulmet），也可能是把中间音节省略导致的缩写式拼写。若你能提供一句原句，我可以更准确判断你想表达的词。"]}
{"word":"kultur","summary":{"en":"“Kultur” is a foreign spelling used mainly in German/academic contexts; in everyday English, the word is “culture.”","zh":"“Kultur”多为德语/学术语境中的拼写；日常英语通常用“culture（文化）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword; usually written **Kultur** in English contexts) **culture**—the ideas, customs, art, food, and everyday ways of life of a group or society. Examples: “I’m learning about Korean culture.” / “He respects the local culture.”","zh":"（外来词；在英语语境中常写作 **Kultur**）**文化**——某个群体或社会的观念、习俗、艺术、饮食与日常生活方式。例：“我在学习韩国文化。” / “他尊重当地文化。”"},"examples":[{"en":"I’m interested in Japanese culture.","zh":"我对日本文化很感兴趣。"},{"en":"Food is an important part of culture.","zh":"食物是文化的重要组成部分。"}]}],"synonyms":["culture","tradition","customs","way of life"],"phonetic":"/ˈkʌltʃɚ/","extraExplanation":["“Kultur”最常见于德语或北欧语言（如瑞典语、挪威语）中，对应英语的 “culture”。在英文写作里用 “Kultur” 往往带一点学术或历史语感，常用来讨论19世纪以来欧洲思想中“民族精神/文化传统”的概念（例如与 “civilization（文明）”作对比的讨论）。","如果你是在学英语：日常表达更常用 **culture**；“Kultur”通常出现在历史、哲学、社会学等语境，或引用德语原词时。"]}
{"word":"kulturkampf","summary":{"en":"Kulturkampf means a struggle over culture and power—especially the 1870s German conflict between the state and the Catholic Church; more generally, it can mean a “culture war.”","zh":"Kulturkampf指围绕文化与权力的斗争——特指19世纪70年代德国国家与天主教会的冲突；也可泛指“文化战争”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political and cultural struggle, especially the conflict in 1870s Germany between the government (under Otto von Bismarck) and the Roman Catholic Church over control of education, appointments, and public life","zh":"文化斗争；（特指）19世纪70年代德国政府（俾斯麦）与罗马天主教会之间围绕教育、任命与公共生活控制权的冲突"},"examples":[{"en":"In history class, we studied the Kulturkampf and how it shaped church–state relations in Germany.","zh":"历史课上我们学习了“文化斗争”（Kulturkampf），以及它如何影响德国的政教关系。"},{"en":"Some writers compare today’s debates about education to a modern Kulturkampf.","zh":"一些作者把当今关于教育的争论比作现代版的“文化斗争”。"}]},{"partOfSpeech":"n.","definition":{"en":"more broadly, a “culture war”: intense conflict between groups with different values, identities, or worldviews","zh":"更广义：文化战争；不同价值观、身份认同或世界观群体之间的激烈对立"},"examples":[{"en":"The election turned into a Kulturkampf over national identity.","zh":"这场选举演变成一场围绕国家认同的文化战争（Kulturkampf）。"},{"en":"Social media can amplify a Kulturkampf by pushing people into opposing camps.","zh":"社交媒体可能通过把人推向对立阵营来放大文化战争（Kulturkampf）。"}]}],"synonyms":["culture war","church–state conflict","ideological struggle"],"phonetic":"/kuːlˈtʊrˌkæmpf/","extraExplanation":["这是德语词，字面意思是“Kultur（文化）+ Kampf（斗争/战斗）”。英语里通常保留德语拼写与大小写（Kulturkampf），多用于历史语境，或作为一种带学术色彩的比喻来指“文化战”。","历史上的“Kulturkampf”主要指俾斯麦时期为削弱天主教会影响、强化国家权力而推行的一系列政策（例如限制教会在教育与任命上的权力）。现代媒体使用时，语气可能更尖锐，暗示价值观对立且难以妥协。"]}
{"word":"kulturkreis","summary":{"en":"Kulturkreis is a German loanword meaning a “culture circle/area,” used mainly in anthropology to group societies with shared cultural traits due to diffusion or common origin.","zh":"Kulturkreis 是德语借词，意为“文化圈/文化区”，主要用于人类学中指因传播或共同起源而共享文化特征的一组社会或区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anthropology, sociology) a “culture circle” or culture area: a group of societies thought to share related cultural traits because of historical contact, diffusion, or common origin.","zh":"（人类学/社会学）“文化圈/文化区”：指一组社会因历史接触、文化传播或共同起源而被认为共享相近文化特征的区域或群体。"},"examples":[{"en":"The researcher compared marriage customs across several kulturkreise in Southeast Asia.","zh":"研究者比较了东南亚几个文化圈中的婚姻习俗。"},{"en":"In older diffusionist theory, a kulturkreis could explain why similar myths appear in distant places.","zh":"在较早的传播论理论中，“文化圈”可用来解释为何相似神话会出现在遥远地区。"}]}],"synonyms":["culture area","culture circle","cultural complex"],"phonetic":"/kʊlˈtʊr.kraɪs/","extraExplanation":["“Kulturkreis”是德语词，字面意思是“文化圈”（Kultur=文化，Kreis=圈/圈子）。它常出现在19世纪末到20世纪初的德语人类学传统中（文化传播论/扩散论），用来把文化特征按“圈”或“区域”分类并推测传播路径。现代学术写作中仍可能见到，但更常用的英语表达是“culture area”或“culture complex”；使用时通常会注明其历史理论背景，以避免给人一种过度简化或带有旧式分类学色彩的感觉。"]}
{"word":"kulturs","summary":{"en":"“Kulturs” is not standard English; you likely mean “culture” or its plural “cultures,” meaning the customs and way of life of a group, or the shared values in an organization.","zh":"“kulturs”不是标准英文拼写；你很可能想写“culture”或复数“cultures”，指某个群体的文化/生活方式，或组织中的共同价值观与氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ideas, customs, arts, and way of life of a particular group of people or society","zh":"（某个群体或社会的）文化；价值观、习俗、艺术与生活方式"},"examples":[{"en":"Food is an important part of Chinese culture.","zh":"饮食是中国文化的重要组成部分。"},{"en":"The company is trying to build a culture of trust.","zh":"这家公司正在努力建立一种信任文化。"}]},{"partOfSpeech":"n.","definition":{"en":"the beliefs and behavior shared within a particular organization, group, or activity","zh":"（组织/团体的）氛围与价值观；（共同的）行为方式"},"examples":[{"en":"Team culture affects how people communicate.","zh":"团队文化会影响人们如何沟通。"},{"en":"Some schools have a strong reading culture.","zh":"有些学校有很浓厚的阅读氛围（阅读文化）。"}]},{"partOfSpeech":"vt.","definition":{"en":"to grow bacteria, cells, or plants in controlled conditions for study or use","zh":"（在控制条件下）培养（细菌/细胞/植物）以供研究或使用"},"examples":[{"en":"Scientists cultured the bacteria in a lab.","zh":"科学家在实验室里培养细菌。"},{"en":"The doctor sent a sample to be cultured.","zh":"医生把样本送去做培养。"}]},{"partOfSpeech":"vt.","definition":{"en":"to develop or encourage a quality, skill, or attitude","zh":"培养；发展（品质/技能/态度）"},"examples":[{"en":"Reading helps you culture critical thinking.","zh":"阅读能帮助你培养批判性思维。"}]}],"synonyms":["customs","traditions","way of life","values","heritage"],"phonetic":"/ˈkʌltʃɚ/","extraExplanation":["“kulturs”不是常见的标准英文拼写。很多学习者是想写“cultures”（culture 的复数），意思是“多种文化/不同文化”。例如：Many cultures celebrate the new year in different ways.（许多文化用不同方式庆祝新年。）","在一些语境里你可能看到“kultur”（来自德语/北欧语系，常用来讨论“文化/文明”的概念差异），但日常英语里更常用的是“culture / cultures”。"]}
{"word":"kuman","summary":{"en":"Kuman is usually a proper name (place/person), not a standard English word.","zh":"Kuman 通常是专有名词（地名/人名），不是标准常用英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name used for places or people (not a common English vocabulary word)","zh":"专有名词：可作为地名或人名使用（不是常见英语词汇）"},"examples":[{"en":"Kuman is a town name you may see on some maps.","zh":"Kuman 可能会出现在一些地图上作为城镇名称。"},{"en":"I met someone named Kuman at the conference.","zh":"我在会议上认识了一个叫 Kuman 的人。"}]}],"synonyms":["(none—proper noun)"],"phonetic":"/ˈkuːmɑːn/","extraExplanation":["“Kuman”在英语里通常不是普通词汇，更常见的是作为地名/人名的拼写。不同地区读音可能略有差异。","如果你其实想查的是发音相近的词，常见可能是：human（人类）、Kumar（常见南亚姓氏/名字）、woman（女人，拼写不同）。你可以告诉我语境（句子/国家/语言来源），我可以帮你确认最可能的词。"]}
{"word":"kumara","summary":{"en":"Kumara means “sweet potato,” especially in New Zealand and the Pacific.","zh":"Kumara 指“红薯/甘薯”，尤常见于新西兰与太平洋地区的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sweet potato (especially the variety commonly eaten in New Zealand and the Pacific), originally from the Americas but widely grown in Polynesia","zh":"红薯／甘薯（尤指新西兰与太平洋地区常吃的一种品种；词源来自波利尼西亚语）"},"examples":[{"en":"In New Zealand, roasted kumara is a popular side dish.","zh":"在新西兰，烤库马拉（红薯）是一道很受欢迎的配菜。"},{"en":"She made kumara soup with coconut milk and ginger.","zh":"她用椰奶和姜做了库马拉（红薯）汤。"}]}],"synonyms":["sweet potato"],"phonetic":"/kuːˈmɑːrə/","extraExplanation":["“Kumara”常见于新西兰英语（NZ English），属于借自毛利语的外来词；在新西兰的菜单、超市与家常对话里很常用。","在北美英语里更常说“sweet potato”。在不同国家，“yam（山药/薯蓣）”有时会被误用来指 sweet potato，但严格来说它们是不同植物。"]}
{"word":"kumari","summary":{"en":"Kumari can mean a girl/maiden in South Asian languages, refer to Nepal’s “Living Goddess” tradition, or be a common female name/surname.","zh":"Kumari 可指“女孩／少女（未婚女子）”，也可特指尼泊尔“活女神（库玛丽）”传统，或作为常见的女性名字／姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in South Asia, from Sanskrit) a girl; a young unmarried woman; sometimes used with the sense of “virgin/maiden.”","zh":"（南亚用语，源自梵语）女孩；年轻未婚女子；有时带有“处女／少女（maiden）”的含义。"},"examples":[{"en":"In some Indian languages, kumari can simply mean “girl” or “young woman.”","zh":"在一些印度语言中，kumari 就是“女孩／年轻女性”的普通说法。"},{"en":"The song’s lyrics call her “kumari,” meaning a maiden.","zh":"歌词里称她为“kumari”，意思是“少女／未婚女子”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Nepal, Hindu/Buddhist tradition) the Kumari: a prepubescent girl revered as a living goddess, especially in the Kathmandu Valley.","zh":"（尼泊尔，印度教／佛教传统）库玛丽女神：被尊为“活女神”的未成年女孩，尤以加德满都谷地最著名。"},"examples":[{"en":"Many visitors to Kathmandu hope to catch a glimpse of the Kumari during a festival.","zh":"许多到加德满都的游客希望在节庆时能一睹库玛丽女神的风采。"},{"en":"The Kumari is honored in ceremonies, and her appearances are treated as highly significant.","zh":"库玛丽女神会在仪式中受到供奉，她的公开露面被视为意义重大。"}]},{"partOfSpeech":"n.","definition":{"en":"A common South Asian female given name and surname.","zh":"常见的南亚女性名字，也常用作姓氏。"},"examples":[{"en":"Kumari is a common middle name in parts of India.","zh":"在印度一些地区，Kumari 常作为中间名使用。"},{"en":"Ms. Kumari will lead today’s meeting.","zh":"Kumari 女士将主持今天的会议。"}]}],"synonyms":["girl","maiden","young woman"],"phonetic":"/ˈkuːmɑːri/","extraExplanation":["“Kumari”常被认为与梵语“kumārī（少女）”有关，因此既可能是普通名词（少女），也可能成为人名的一部分。","尼泊尔的“库玛丽（活女神）”传统在加德满都谷地尤其有名；在不同语境里写作 Kumari 时，要根据上下文判断是普通含义、人名，还是特指这一宗教文化称号。"]}
{"word":"kumbaloi","summary":{"en":"“Kumbaloi” is probably meant to be **komboloi**, Greek worry beads used for relaxation.","zh":"“kumbaloi”很可能指 **komboloi**，一种希腊的解压把玩念珠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely) a misspelling of **komboloi**: Greek “worry beads,” a string of beads people handle or click rhythmically for relaxation or habit (not usually for prayer like a rosary).","zh":"（很可能是拼写误差）**komboloi**：希腊的“解压念珠/把玩珠”，人们会用手捻动或轻敲珠子来放松、打发时间（通常不像玫瑰念珠那样用于祈祷）。"},"examples":[{"en":"He absentmindedly clicked his komboloi while talking.","zh":"他一边说话，一边心不在焉地拨弄着komboloi。"},{"en":"Komboloi are often sold in Greek markets as souvenirs.","zh":"在希腊的市集里，komboloi常作为纪念品出售。"}]}],"synonyms":["worry beads"],"phonetic":"/ˌkoʊm.bəˈlɔɪ/","extraExplanation":["你输入的 **kumbaloi** 并不是常见的英语拼写；更常见的写法是 **komboloi/kompoloi**（来源于希腊语 κομπολόι）。","文化上它更像“把玩解压的念珠”，常见于希腊男性日常生活中，用来放松、社交时打发时间；与宗教用途的念珠（如 rosary）在功能与语境上不同。","如果你能提供一句原文或你看到它的场景（书名/影片/地区），我也可以确认是否是人名、地名或别的语言词。"]}
{"word":"kumbi","summary":{"en":"“Kumbi” is usually a proper noun: a personal name, or short for “Kumbi Saleh,” a historic city linked to the Ghana Empire.","zh":"“Kumbi”通常是专有名词：可作人名，也可指与加纳帝国相关的历史城市“库姆比·萨利赫（Kumbi Saleh）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (often used in parts of Africa)","zh":"人名（常见于非洲部分地区的名字）"},"examples":[{"en":"Kumbi is a common name in some West African communities.","zh":"Kumbi 在一些西非社群中是常见的名字。"},{"en":"We met a student named Kumbi at the cultural festival.","zh":"我们在文化节上认识了一位叫 Kumbi 的学生。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in the form “Kumbi Saleh”) the historic city associated with the Ghana Empire, sometimes described as its capital","zh":"（常以 “Kumbi Saleh” 形式出现）与加纳帝国（Ghana Empire）相关的历史城市，有时被称为其都城"},"examples":[{"en":"Kumbi Saleh is frequently mentioned in discussions of early West African trade routes.","zh":"在讨论早期西非贸易路线时，经常会提到 Kumbi Saleh。"},{"en":"The lecture included a section on Kumbi Saleh and the Ghana Empire.","zh":"这场讲座包含了关于 Kumbi Saleh 和加纳帝国的一部分内容。"}]}],"synonyms":["Kumbi Saleh (specific place name)"],"phonetic":"ˈkʊmbi","extraExplanation":["“Kumbi”更常见于专有名词语境：要么是人名，要么指“库姆比·萨利赫（Kumbi Saleh）”。后者与中世纪西非的加纳帝国有关（注意：这里的“Ghana Empire/加纳帝国”是历史帝国名，不等同于现代国家“加纳/Ghana”）。","如果你是在某本书、歌曲、游戏或某种语言（例如某个族群语言）里看到“Kumbi”，它也可能是特定文化词或地名的转写；给我上下文句子我可以帮你更准确判断含义与用法。"]}
{"word":"kumbuk","summary":{"en":"Kumbuk is a South Asian (especially Sri Lankan) tropical tree known for its strong timber and common presence near waterways.","zh":"Kumbuk 指一种南亚（尤指斯里兰卡）热带树木，以坚硬木材著称，常见于河岸与水域附近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large tropical tree native to South Asia (especially Sri Lanka), valued for its hard timber and traditionally planted near rivers and tanks (reservoirs).","zh":"（南亚，尤指斯里兰卡的）一种大型热带乔木，木材坚硬耐用，传统上常种在河岸或水库（蓄水池）附近。"},"examples":[{"en":"In Sri Lanka, kumbuk trees are often seen along riverbanks.","zh":"在斯里兰卡，河岸边常能看到 kumbuk 树。"},{"en":"The bridge was built using kumbuk wood because it is strong and durable.","zh":"这座桥使用 kumbuk 木材建造，因为它结实耐用。"},{"en":"They rested in the shade of a tall kumbuk near the tank.","zh":"他们在水库旁一棵高大的 kumbuk 树下乘凉。"}]}],"synonyms":["kumbuk tree","arjuna tree (regional)"],"phonetic":"/ˈkʊm.bʌk/","extraExplanation":["“kumbuk”多见于斯里兰卡英语语境，指当地常见的一种树；在不同地区或资料中，它可能对应不同的植物学拉丁名（常被认为与榄仁属 Terminalia 的树有关）。如果你告诉我你看到这个词的出处（书名/句子/地区），我可以更准确地对照具体树种与用法。"]}
{"word":"kumhar","summary":{"en":"Kumhar means a potter, and it can also refer to the traditional potter community/caste in South Asia.","zh":"kumhar 指陶工，也可指南亚传统从事制陶的社群/种姓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In South Asia (especially India), a potter; also a person belonging to the traditional potter community/caste.","zh":"在南亚（尤其是印度），“库姆哈尔”指陶工；也可指传统从事制陶的社群/种姓成员。"},"examples":[{"en":"The kumhar shaped wet clay into bowls on a wheel.","zh":"那位库姆哈尔在拉坯机上把湿黏土塑成碗。"},{"en":"In the village market, kumhar families sold earthen pots for cooking and storing water.","zh":"在乡村集市上，库姆哈尔家庭售卖用于做饭和储水的陶罐。"}]}],"synonyms":["potter","earthenware maker","Kumbhar"],"phonetic":"/kʊmˈhɑr/","extraExplanation":["“Kumhar”是从印地语/乌尔都语等南亚语言转写到英语的词，在英语文本里常见于人类学、历史、民俗或旅行写作中。不同地区也可能拼作“kumhār / kumbhar”。","在一些语境中它既可中性地指“陶工”，也可能涉及社会身份（社群/种姓）。写作或翻译时，若不想强调社会阶层，通常用更通用的英语词“potter”。"]}
{"word":"kumis","summary":{"en":"Kumis is a slightly sour, mildly alcoholic drink made from fermented mare’s milk.","zh":"Kumis 指用发酵马奶制成的微酸、低度酒精饮料（马奶酒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Central Asian drink made from fermented mare’s milk (sometimes made from other milk), slightly sour and mildly alcoholic","zh":"库米斯酒；马奶酒：一种中亚传统饮料，由发酵的马奶（有时也用其他奶）制成，微酸，酒精度通常较低"},"examples":[{"en":"In Mongolia, some families still make kumis during the summer.","zh":"在蒙古，一些家庭夏天仍会自制马奶酒。"},{"en":"She tried kumis for the first time and said it tasted tangy, like sour yogurt.","zh":"她第一次喝马奶酒，说味道很酸爽，有点像酸奶。"},{"en":"The festival offered local foods, including kumis and dried cheese.","zh":"节日上提供了当地食物，包括马奶酒和奶酪干。"}]}],"synonyms":["koumiss","fermented mare’s milk"],"phonetic":"/ˈkuːmɪs/","extraExplanation":["“Kumis”也常拼作“koumiss”（较传统的英语拼写）。它在哈萨克、吉尔吉斯、蒙古等草原文化中很常见，常在夏季马奶充足时制作。","由于发酵程度不同，口感和酒精度会变化：有的更像气泡酸奶，有的更接近低度酒。"]}
{"word":"kumiss","summary":{"en":"Kumiss is a traditional slightly alcoholic drink made from fermented mare’s milk.","zh":"Kumiss 指用母马奶发酵制成的传统饮料，通常微酸并含少量酒精。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional drink made from fermented mare’s milk (horse milk), usually slightly sour and mildly alcoholic.","zh":"马奶酒；用母马奶发酵制成的传统饮料，通常微酸、带少量酒精。"},"examples":[{"en":"In Mongolia, visitors may be offered kumiss as a sign of hospitality.","zh":"在蒙古，来访客人可能会被用马奶酒招待，以示好客。"},{"en":"Kumiss has a tangy taste because the milk is fermented.","zh":"马奶酒因为经过发酵，所以味道带酸。"},{"en":"Some people describe kumiss as a lightly fizzy fermented milk drink.","zh":"有些人形容马奶酒像是带一点气泡的发酵乳饮料。"}]}],"synonyms":["koumiss","fermented mare’s milk"],"phonetic":"/ˈkuːmɪs/","extraExplanation":["“Kumiss”常见于中亚与蒙古草原文化，也常写作“koumiss”。它与酸奶相似但更稀、更容易产生少量酒精与气泡，传统上与游牧生活、待客礼仪密切相关。"]}
{"word":"kumisses","summary":{"en":"Kumisses are fermented mare’s-milk drinks (the plural of kumis/kumiss).","zh":"kumisses 指马奶酒（kumis/kumiss 的复数），一种用马奶发酵的传统饮料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fermented drink made from mare’s milk, traditional in Central Asia (plural form: kumisses)","zh":"马奶酒；一种用马奶发酵制成的饮料，源自中亚地区（kumisses 为复数）"},"examples":[{"en":"In the museum exhibit, we learned that nomadic groups often drank kumisses during summer.","zh":"在博物馆展览中，我们了解到游牧民族在夏季常常喝马奶酒。"},{"en":"The travel book mentioned kumisses as a traditional drink on the Central Asian steppe.","zh":"那本旅行书提到，马奶酒是中亚草原上的传统饮品。"}]}],"synonyms":["kumis","kumiss","koumiss","kumys"],"phonetic":"/ˈkuːmɪs/","extraExplanation":["“kumisses”是“kumiss / kumis / koumiss”的复数形式，英语里拼写不太统一，常见变体包括 kumis、koumiss、kumys。","这种饮料与中亚游牧文化关系密切，常见于哈萨克、吉尔吉斯、蒙古等地区的传统饮食与待客习俗中。"]}
{"word":"kumkum","summary":{"en":"Kumkum is a red powder (and the mark made from it) used in Hindu rituals and on the forehead for religious or cultural purposes.","zh":"Kumkum 指印度教传统中用于仪式与额头点印的红色粉末，也可指用它点出的红色印记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright red powder used in Hindu traditions for religious marks and rituals, often put on the forehead (tilak/bindi) or used in worship.","zh":"（印度教传统中的）朱红色粉末，用于宗教标记与仪式，常点在额头（额饰/吉祥痣）或供奉礼拜时使用。"},"examples":[{"en":"She applied a small dot of kumkum to her forehead before the ceremony.","zh":"仪式开始前，她在额头点了一点库姆库姆粉。"},{"en":"The priest offered flowers and kumkum during the puja.","zh":"祭司在礼拜仪式（puja）中供上鲜花和库姆库姆粉。"}]},{"partOfSpeech":"n.","definition":{"en":"The red mark made with this powder, usually on the forehead.","zh":"用这种粉末点出的红色印记（多在额头上）。"},"examples":[{"en":"A thin line of kumkum showed that she had just visited the temple.","zh":"她额头上的一抹库姆库姆印记表明她刚去过寺庙。"},{"en":"He noticed the kumkum on his mother’s forehead and asked about the festival.","zh":"他注意到母亲额头上的库姆库姆印记，于是问起节日的事。"}]}],"synonyms":["vermilion","tilak (related)","bindi (related)","sindoor (related)"],"phonetic":"/ˈkʊmˌkʊm/","extraExplanation":["“kumkum”多见于印度文化语境。它常与“bindi（额头圆点装饰）”“tilak（宗教额饰/印记）”一起出现；但并不完全等同：bindi更偏日常装饰或象征，tilak更偏宗教标记。","有些地区还会用“sindoor（朱砂粉）”指已婚女性在发缝处涂的红色粉末；kumkum和sindoor在使用场景与成分上可能有重叠，但文化含义与具体用法因地区与家庭习惯而不同。"]}
{"word":"kummel","summary":{"en":"Kummel is a sweet, clear caraway-flavored liqueur, often served chilled or used in cocktails.","zh":"kummel 指一种以葛缕子为主要风味的透明甜利口酒，常冷饮或用于鸡尾酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a clear, sweet liqueur flavored mainly with caraway seed (often also cumin and fennel), traditionally served chilled or used in cocktails","zh":"（库梅尔酒）一种透明、甜味的香草利口酒，主要以葛缕子籽（常也加入孜然、茴香）调味，常冷饮或用于鸡尾酒"},"examples":[{"en":"After dinner, he offered guests a small glass of kummel.","zh":"晚餐后，他请客人喝了一小杯库梅尔酒。"},{"en":"Some classic cocktail recipes use kummel for a spicy, herbal note.","zh":"一些经典鸡尾酒配方会用库梅尔酒来增加辛香的草本风味。"}]}],"synonyms":["kümmel","caraway liqueur"],"phonetic":"/ˈkʊməl/","extraExplanation":["“Kümmel”原本是德语，意思与“caraway（葛缕子）”相关；英语里常写作“kummel”（去掉变音符号 ü）或保留为“kümmel”。","它在北欧、德国及俄罗斯等地较常见，传统上会冰镇后作为餐后酒饮用；在鸡尾酒中则用来提供独特的辛香草本风味。"]}
{"word":"kummels","summary":{"en":"Kummels are servings or types of kummel: a sweet, clear caraway-flavored liqueur.","zh":"kummels 指 kummel 的复数：一种以葛缕子为主要风味的甜型透明利口酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sweet, clear liqueur flavored mainly with caraway seed (often also cumin and fennel); “kummels” is the plural form.","zh":"一种甜的、透明的利口酒，主要用葛缕子（caraway）调味（常也加入孜然和茴香）；“kummels”为其复数。"},"examples":[{"en":"After dinner, the restaurant offered small glasses of kummel.","zh":"晚餐后，餐厅提供了一小杯kummel利口酒。"},{"en":"Some old cocktail books mention kummel as a caraway-flavored liqueur.","zh":"一些老式鸡尾酒书会提到kummel，说它是一种葛缕子风味的利口酒。"}]}],"synonyms":["caraway liqueur"],"phonetic":"/ˈkʊməl/","extraExplanation":["“Kümmel”源自德语，原意与“葛缕子（caraway）”相关；这种酒在中欧、北欧与俄国饮食文化里较常见，常作为餐后酒（digestif）少量饮用。","注意别把 caraway（葛缕子）和 cumin（孜然）混淆：两者味道相近但不是同一种香料；有些配方会同时使用。"]}
{"word":"kummerbund","summary":{"en":"A cummerbund is a wide waistband worn with a tuxedo for formal evening dress.","zh":"cummerbund/kummerbund 指搭配无尾礼服等晚礼服穿的宽腰封。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wide waistband (often pleated) worn with a tuxedo or other formal evening clothes, usually instead of a vest.","zh":"（常有褶的）宽腰带；（男士）礼服腰封（多与无尾礼服等晚礼服搭配，通常用来代替马甲）。"},"examples":[{"en":"He wore a black cummerbund with his tuxedo.","zh":"他穿无尾礼服时系了一条黑色礼服腰封。"},{"en":"The dress code said “black tie,” so I rented a tuxedo and a cummerbund.","zh":"着装要求写着“black tie（正装）”，所以我租了一套无尾礼服和一条腰封。"}]}],"synonyms":["waistband","sash","formal waist wrap"],"phonetic":"/ˈkʌmərbʌnd/","extraExplanation":["“cummerbund”常见于英美的正式晚宴着装语境（black tie）。它的作用一是装饰、二是让腰部线条更整洁，传统上褶皱朝上。","词源来自印地语/乌尔都语等（与波斯语有关）的“kamarband”，原意是“束腰带”。","拼写变体：cummerbund（最常见）/kummerbund（较少见）。"]}
{"word":"kumminost","summary":{"en":"“kumminost” isn’t recognized as a standard English word; it’s likely a misspelling of “cumin.”","zh":"“kumminost”不是常见英语单词；很可能是“cumin（孜然）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling of **“cumin”** (a spice) or another term depending on your context.","zh":"不是标准英语单词。可能是 **cumin（孜然）** 的拼写错误，或与语境有关的其他词。"},"examples":[{"en":"I couldn’t find “kumminost” in an English dictionary—did you mean “cumin”?","zh":"我在英文词典里找不到“kumminost”——你是不是想写“cumin（孜然）”？"},{"en":"This soup tastes great with cumin.","zh":"这道汤加点孜然会很好吃。"}]}],"synonyms":["cumin"],"phonetic":"/ˈkjuːmɪn/","extraExplanation":["“kumminost”看起来像把“cumin”按发音写错（有些学习者会把 /kjuː/ 听成 /kuː/），也可能是某种专有名词、用户名或其他语言的词。为了给你最准确的释义，请告诉我：你在哪句话/哪个场景里看到它？"]}
{"word":"kumni","summary":{"en":"“Kumni” is not standard English; it’s usually an informal misspelling of “company.”","zh":"“kumni”不是标准英语，通常是把“company”随意拼写出来的非正式写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling (often in casual texting) of “company.” Not a standard English word in formal writing.","zh":"“company”的非标准拼写（常见于随意聊天/短信）。在正式英语中不算标准单词。"},"examples":[{"en":"I’m at work with my kumni (company).","zh":"我在公司上班（这里的 kumni 指 company）。"},{"en":"Please write “company” on the form, not “kumni.”","zh":"请在表格上写“company”，不要写“kumni”。"}]}],"synonyms":["company","firm","business"],"phonetic":"/ˈkʌm.pə.ni/","extraExplanation":["“kumni”更像是把某些语言/方言里的发音直接用英文字母写出来（音译式拼写），或是把“company”随意拼写成更接近口语发音的样子。正式场合（邮件、简历、作业）建议统一写 company。"]}
{"word":"kumquat","summary":{"en":"A small citrus fruit with an edible sweet peel and tangy flesh.","zh":"一种皮甜可食、果肉酸香的小型柑橘水果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small oval citrus fruit with a sweet edible peel and a sour inside, often eaten whole or used for marmalade and desserts.","zh":"金橘；一种小而椭圆的柑橘类水果，皮甜可食、果肉偏酸，常整颗食用或做果酱与甜点。"},"examples":[{"en":"She ate a kumquat whole—peel and all.","zh":"她把金橘整颗吃了——连皮一起。"},{"en":"Kumquats are often candied and served with tea.","zh":"金橘常被做成糖渍果，配茶食用。"}]}],"synonyms":["cumquat"],"phonetic":"/ˈkʌmˌkwɑt/","extraExplanation":["“Kumquat”一词来自粤语“金橘”（gam1 gwat1），字面意思是“金色的橘子”。在英语里它常被当作可数名词：a kumquat / some kumquats。","在西方料理中，kumquat 常见于果酱（marmalade）、糖渍（candied kumquats）或鸡尾酒装饰；在华语文化里也常用于蜜饯、泡茶或做成金橘酱。"]}
{"word":"kumquats","summary":{"en":"Kumquats are small citrus fruits with sweet edible peels and tart flesh, often eaten whole or used in cooking.","zh":"金橘是小型柑橘类水果，外皮甜且可食、果肉酸，常整颗吃或用于烹饪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, oval citrus fruit with a sweet edible peel and a tart inside, often eaten whole or used in marmalades and cooking.","zh":"金橘；一种小而椭圆的柑橘类水果，外皮可食且偏甜、果肉偏酸，常整颗食用或用于果酱与烹饪。"},"examples":[{"en":"I snack on kumquats in winter because you can eat the peel and all.","zh":"冬天我会把金橘当零食，因为连皮都可以一起吃。"},{"en":"She made kumquat marmalade for breakfast toast.","zh":"她做了金橘果酱，配早餐吐司吃。"},{"en":"Thin slices of kumquat add a bright, citrusy flavor to salads.","zh":"薄切的金橘能给沙拉增添清新的柑橘香味。"}]}],"synonyms":["golden orange","citrus fruit"],"phonetic":"/ˈkʌmˌkwɑt/","extraExplanation":["“Kumquat”来自粤语“金橘”（gam1 gwat1）音译，字面意思是“金色的橘子”。在英语里它既可数也常用复数：one kumquat / some kumquats。","食用小提示：金橘的甜主要在外皮，果肉较酸；吃之前轻轻揉一下能让外皮香气更明显。"]}
{"word":"kumrah","summary":{"en":"Kumrah is a South Asian word used in English to mean “pumpkin/winter squash.”","zh":"Kumrah 在英语中多见于南亚语境，意思是“南瓜/冬南瓜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, from Bengali/Assamese) a pumpkin or a kind of winter squash/gourd used as a vegetable in cooking.","zh":"（南亚英语用法，源自孟加拉语/阿萨姆语）南瓜；一种冬南瓜/葫芦类瓜，用作蔬菜烹饪。"},"examples":[{"en":"She cooked kumrah with lentils for dinner.","zh":"她晚饭做了南瓜（kumrah）炖扁豆。"},{"en":"In many Bengali homes, kumrah is used in soups, curries, and sweets.","zh":"在很多孟加拉家庭里，南瓜（kumrah）常用来做汤、咖喱和甜点。"}]}],"synonyms":["pumpkin","winter squash","squash"],"phonetic":"/ˈkuːmrə/","extraExplanation":["“kumrah / kumra”常见于孟加拉语、阿萨姆语等语境中，指“南瓜/冬南瓜”。在英语里它多出现在南亚移民社区的日常口语、菜单、食谱或文化介绍中，并不是标准通用英语里最常见的说法；更通用的词通常是 pumpkin 或 squash。","不同地区的拼写可能有 kumra、kumrah 等，属于音译差异。"]}
{"word":"kumshaw","summary":{"en":"Kumshaw means a small tip, gift, or bribe, especially in older China-trade contexts.","zh":"Kumshaw 指（旧时语境中）小费、谢礼或贿赂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small gift, tip, or bribe given (or asked for), especially in older contexts involving foreign trade in China.","zh":"（尤指旧时与中国对外贸易语境中）给或索要的小费、礼物或贿赂。"},"examples":[{"en":"The porter hinted he expected some kumshaw for carrying our bags.","zh":"搬运工暗示他希望搬行李能得到一点“kumshaw”（小费）。"},{"en":"In old travel stories, officials sometimes demanded kumshaw before stamping papers.","zh":"在一些旧游记里，官员有时会在盖章前索要“kumshaw”（好处费）。"}]}],"synonyms":["tip","gratuity","bribe","payoff","gift"],"phonetic":"/ˈkʌmˌʃɔ/","extraExplanation":["“kumshaw”也常拼作“cumshaw”，属于带有历史色彩的词，来源通常被认为与粤语“感谢”（gam1 ze6，意为“谢谢”）有关：原本是道谢用语，后来在通商与港口环境中被外国人误用/引申为“谢礼、小费”，再进一步带上“打点、行贿”的含义。","该词带有明显的时代与文化语境（旧时的殖民/通商口岸叙事），现代英语里较少使用；当代更常用 tip / gratuity（小费）或 bribe（贿赂）等更中性的词。"]}
{"word":"kumyk","summary":{"en":"Kumyk refers to a Turkic ethnic group in the North Caucasus and the language they speak; it can also be an adjective meaning “Kumyk-related.”","zh":"Kumyk 指北高加索地区的突厥语族民族“库米克人”及其语言“库米克语”，也可作形容词表示“与库米克相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Turkic ethnic group native mainly to Dagestan and nearby areas in the North Caucasus (Russia).","zh":"库米克人：主要居住在俄罗斯北高加索（以达吉斯坦为主及其周边）的突厥语族民族成员。"},"examples":[{"en":"Many Kumyk people live in the lowlands of Dagestan.","zh":"许多库米克人居住在达吉斯坦的低地地区。"},{"en":"The museum has a small exhibit on Kumyk history and culture.","zh":"这家博物馆有一个关于库米克历史与文化的小展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Turkic language spoken by the Kumyk people.","zh":"库米克语：库米克人使用的一种突厥语族语言。"},"examples":[{"en":"She can speak Kumyk and Russian.","zh":"她会说库米克语和俄语。"},{"en":"This dictionary includes basic Kumyk phrases.","zh":"这本词典收录了一些基础的库米克语短语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Kumyk people or their language.","zh":"库米克的：与库米克人或库米克语相关的。"},"examples":[{"en":"They performed a Kumyk folk song.","zh":"他们表演了一首库米克民歌。"},{"en":"He is studying Kumyk literature.","zh":"他在研究库米克文学。"}]}],"synonyms":["Kumyks","Kumyk language"],"phonetic":"/ˈkuːmɪk/","extraExplanation":["“Kumyk”常见于历史、民族学与语言学语境；在英语里既可指“库米克人”，也可指“库米克语”，需要结合上下文判断。","库米克语属于突厥语族，历史上在北高加索地区曾作为跨族群交流的重要语言之一。"]}
{"word":"kumys","summary":{"en":"Kumys is a traditional Central Asian fermented mare’s milk drink, often lightly alcoholic and sour.","zh":"Kumys 指中亚传统的发酵马奶饮品（马奶酒），常微酸、含少量酒精。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Central Asian drink made from fermented mare’s (female horse’s) milk, usually lightly alcoholic and slightly sour.","zh":"库梅斯（马奶酒）：一种中亚传统饮品，由发酵的母马乳制成，通常带少量酒精、口感微酸。"},"examples":[{"en":"On the steppe, many families still serve kumys to guests.","zh":"在草原上，许多家庭仍会用马奶酒招待客人。"},{"en":"Kumys has a tangy taste because the milk is fermented.","zh":"马奶酒带酸味，是因为牛奶（马奶）经过发酵。"}]}],"synonyms":["koumiss","fermented mare's milk"],"phonetic":"/ˈkuːmɪs/","extraExplanation":["“Kumys”（也常拼作“koumiss”）与中亚游牧文化关系很深，尤其常见于哈萨克、吉尔吉斯、蒙古等地区的传统生活与待客礼仪中。","它通常由乳酸发酵与轻微酒精发酵共同形成，所以味道可能像酸奶饮料但更“起泡”、也可能含少量酒精；不同地区与家庭做法差异很大。","英语里它多用于饮食文化或旅行写作语境；在文学与纪实作品中常用来营造“草原/游牧”的地域氛围。"]}
{"word":"kumyses","summary":{"en":"Kumyses are fermented mare’s-milk drinks (plural of kumys).","zh":"Kumyses 指发酵马奶饮品（kumys 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of kumys: a traditional Central Asian drink made from fermented mare’s milk (similar in idea to yogurt drinks, but usually more sour and slightly alcoholic).","zh":"kumys 的复数：一种传统的中亚饮品，由发酵的马奶制成（概念上有点像酸奶饮品，但通常更酸，并带有轻微酒精）。"},"examples":[{"en":"In some parts of Central Asia, kumyses are served to welcome guests.","zh":"在中亚的一些地区，人们会用 kumyses 来迎接客人。"},{"en":"The traveler wrote about tasting kumyses for the first time on the steppe.","zh":"那位旅行者写到自己在草原上第一次品尝 kumyses 的经历。"}]}],"synonyms":["koumiss (plural: koumisses)","fermented mare’s milk"],"phonetic":"/ˈkuːmɪsɪz/","extraExplanation":["“kumys”（也常拼作 *koumiss*）与草原游牧文化关系密切，常见于哈萨克、吉尔吉斯、蒙古等地区；传统上与待客、节庆和季节性放牧生活有关。","这类词在英语里属于“借词”（从其他语言进入英语），所以拼写可能不止一种：*kumys / koumiss*；复数也会见到 *kumyses* 或按常规加 -es 的形式。"]}
{"word":"kun","summary":{"en":"Kun most often refers to the Japanese honorific suffix “-kun,” used mainly for boys or younger males; it can also be a surname.","zh":"Kun 最常见指日语敬称后缀「-kun」，多用于男孩或较年轻男性；也可以是姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from Japanese) An honorific suffix added to someone’s name, usually for a boy or a younger male (often used by teachers, seniors, or colleagues); sometimes used for female juniors in workplaces.","zh":"（源自日语）接在名字后面的敬称后缀，通常用于男孩或较年轻的男性（常见于老师、前辈、同事的称呼）；在职场中也可能用于称呼资历较浅的女性。"},"examples":[{"en":"In many anime, a teacher might call a student “Taro-kun.”","zh":"在很多动漫里，老师可能会称呼学生为「太郎君（Taro-kun）」。"},{"en":"At work in Japan, a senior colleague may use “-kun” for a junior employee.","zh":"在日本职场里，资深同事可能会用「-kun」称呼新人或资历较浅的员工。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), used by people from different cultures (e.g., Hungarian, Korean romanization, etc.), depending on the person.","zh":"姓氏：不同文化中都可能出现（例如匈牙利姓、韩语罗马拼写等），具体来源取决于个人。"},"examples":[{"en":"Professor Kun published a new paper this year.","zh":"Kun 教授今年发表了一篇新论文。"}]}],"synonyms":["-kun (Japanese honorific)","honorific suffix"],"phonetic":"/kʊn/","extraExplanation":["「-kun」常见于英语语境中的日本文化内容（如动漫、游戏、社交媒体），属于借用表达。它通常比「-san」更亲近/更随意，但使用场合受关系、年龄、职场文化影响较大。","与之相关的敬称还有：-san（较通用、礼貌）、-sama（非常尊敬/服务场景）、-chan（亲昵、常用于小孩/亲近的人）。"]}
{"word":"kunai","summary":{"en":"Kunai is a Japanese pointed tool/weapon, often shown in pop culture as a ninja dagger or throwing knife.","zh":"Kunai（苦无）是日本的尖头工具/武器，在流行文化中常被描绘为忍者使用的匕首或投掷武器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Japanese weapon: a small, pointed metal tool (often with a ring at the handle) that is popularly shown as a ninja dagger or throwing weapon.","zh":"苦无（日本传统器具/武器）：一种小型尖头金属工具（柄端常有圆环），大众文化中常被描绘为忍者使用的匕首或投掷武器。"},"examples":[{"en":"In many anime, a ninja throws a kunai to distract an enemy.","zh":"在很多动漫里，忍者会投掷苦无来分散敌人的注意力。"},{"en":"The museum displayed farming tools that later inspired weapons like the kunai.","zh":"博物馆展示了一些农具，它们后来启发了像苦无这样的武器形象。"}]}],"synonyms":["ninja dagger","throwing knife (pop-culture use)"],"phonetic":"/kuːˈnaɪ/","extraExplanation":["“kunai（苦无）”在历史上更接近一种多用途的小工具（可挖、撬、刺），并不总是专门的“飞刀”。但在现代影视、动漫和游戏中，它常被固定塑造成忍者常用的短刃或投掷武器。","英文里通常直接用日语外来词“kunai”，复数常见写法是“kunai”（不变）或较少见的“kunais”。"]}
{"word":"kunbi","summary":{"en":"Kunbi is most commonly a Yoruba personal name and is not a standard English word.","zh":"Kunbi 通常是约鲁巴人的人名，不是标准英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A personal name (proper noun), most commonly used among Yoruba speakers in Nigeria; it is not a standard English vocabulary word.","zh":"一个人名（专有名词），在尼日利亚的约鲁巴语使用者中较常见；它不是标准英语词汇。"},"examples":[{"en":"Kunbi is my classmate from Lagos.","zh":"Kunbi 是我来自拉各斯的同学。"},{"en":"Please ask Kunbi to join the meeting at 3 p.m.","zh":"请让 Kunbi 下午三点参加会议。"}]}],"phonetic":"/ˈkʊnbi/","extraExplanation":["“Kunbi”常见为约鲁巴人名，有时是名字或昵称/缩写形式。不同家庭与拼写（如Kúnbí等带声调的写法）可能对应不同含义与完整名字来源，因此若你想确认含义，最好提供它所属语言/地区或原始拼写（是否有声调符号）。","在英语语境中，它通常按“姓名”使用：首字母大写（Kunbi），不需要加冠词（a/the）。"]}
{"word":"kundalini","summary":{"en":"Kundalini refers to a spiritual energy in yoga traditions and, by extension, a type of yoga practice meant to awaken it.","zh":"Kundalini（昆达里尼）指瑜伽传统中的灵性能量，也可引申为旨在唤醒这种能量的一种瑜伽流派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In yoga and Hindu traditions) a spiritual energy believed to lie coiled at the base of the spine, which can be awakened through practices like meditation, breathing, and yoga.","zh":"（在瑜伽与印度教传统中）被认为盘踞在脊柱底部的一种灵性能量，可通过冥想、呼吸练习与瑜伽等方式被“唤醒”。"},"examples":[{"en":"She began practicing kundalini yoga to focus her mind and manage stress.","zh":"她开始练习昆达里尼瑜伽，以集中注意力并缓解压力。"},{"en":"Some traditions describe kundalini as rising up the spine through energy centers called chakras.","zh":"一些传统把昆达里尼描述为沿脊柱向上穿过称为“脉轮”的能量中心。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) a style of yoga that aims to awaken this energy, often combining breathwork, chanting, meditation, and movement.","zh":"（引申义）“昆达里尼瑜伽”：一种旨在唤醒该能量的瑜伽流派，常结合呼吸法、诵唱、冥想与动作练习。"},"examples":[{"en":"Kundalini often includes repetitive breathing and short, energetic sequences.","zh":"昆达里尼练习常包含重复的呼吸法与短而有力的动作串联。"},{"en":"He attends a weekly Kundalini class at a local studio.","zh":"他每周在当地工作室上一次昆达里尼课程。"}]}],"synonyms":["kundalini yoga","spiritual energy","life force (context-dependent)"],"phonetic":"/ˌkʊn.dəˈliː.ni/","extraExplanation":["“Kundalini”源自梵语 kuṇḍalinī，常被解释为“盘绕的（能量/力量）”，传统意象是像蛇一样盘在脊柱底部。","在英语语境中，它既可指“昆达里尼能量”的观念，也常直接指“昆达里尼瑜伽”这种课程/流派；写作时可根据上下文是否与“yoga class/pose/breathwork”连用来判断。","相关表达：kundalini awakening（昆达里尼觉醒/唤醒）、kundalini yoga（昆达里尼瑜伽）、chakras（脉轮）。阅读与交流时也要注意：不同传统与老师对其解释差异很大，属于宗教/灵修语境，适合用尊重、中性措辞描述。"]}
{"word":"kundry","summary":{"en":"Kundry is best known as a complex female character in Wagner’s opera *Parsifal*, and it can also be used as a literary comparison for a conflicted or seductive woman.","zh":"Kundry 最常指瓦格纳歌剧《帕西法尔》中的复杂女性角色；也可在文学评论中用来比喻矛盾或具有诱惑性的女性形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A major character in Richard Wagner’s opera *Parsifal*: a mysterious woman who shifts between being a cursed wanderer, a servant, and a seductress.","zh":"（专有名词）理查德·瓦格纳歌剧《帕西法尔》（*Parsifal*）中的重要角色：一位神秘女性，在“被诅咒的流浪者、侍从、诱惑者”等身份之间转换。"},"examples":[{"en":"In Wagner’s *Parsifal*, Kundry is both a helper and a tempter.","zh":"在瓦格纳的《帕西法尔》中，Kundry 既是帮助者，也是诱惑者。"},{"en":"The director portrayed Kundry as a restless outsider searching for release.","zh":"导演把 Kundry 塑造成一个焦躁的局外人，渴望解脱。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, literary/critical use) A woman compared to Kundry—seen as conflicted, haunting, or dangerously seductive.","zh":"（引申义，文学/评论用法）被拿来类比 Kundry 的女性：常带有“矛盾、阴郁纠缠、危险诱惑”的形象色彩。"},"examples":[{"en":"Some critics called the heroine a ‘modern Kundry’ because of her divided loyalties.","zh":"一些评论家称女主角为“现代版 Kundry”，因为她在忠诚之间摇摆不定。"},{"en":"He wrote her as a Kundry figure—fierce, wounded, and hard to trust.","zh":"他把她写成一种 Kundry 式人物：强悍、受伤、让人难以完全信任。"}]}],"synonyms":["(as a comparison) temptress","(as a comparison) femme fatale","(as a comparison) seductress"],"phonetic":"ˈkʊndri","extraExplanation":["Kundry 主要出自瓦格纳晚期歌剧《帕西法尔》（1882）。这个角色融合了“受诅咒者/悔罪者/诱惑者”等多重面向，因此在文学评论里有时会被借来指一种“复杂而矛盾的女性形象”。","因为这是专名，常见写法首字母大写：Kundry。除歌剧与批评语境外，日常英语里并不常用。"]}
{"word":"kuneste","summary":{"en":"“Kuneste” is not a standard English word; it’s likely a misspelling or a proper name (possibly related to German “Künste,” meaning “the arts”).","zh":"“kuneste”不是标准英语单词；更可能是拼写错误或专有名词（也可能与德语 “Künste＝艺术”有关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name; sometimes it appears as an incorrect spelling of German “Künste” (arts) or “Kunst” (art).","zh":"不是标准英语单词。更可能是拼写错误或专有名词；有时会被误写来指德语 “Künste”（艺术/技艺，复数）或 “Kunst”（艺术）。"},"examples":[{"en":"I can’t find “kuneste” in an English dictionary—did you mean another word?","zh":"我在英语词典里查不到 “kuneste”——你是不是想写另一个词？"},{"en":"If you meant German “Künste,” it refers to the arts (like music, painting, and theater).","zh":"如果你指的是德语 “Künste”，它表示“艺术”（如音乐、绘画、戏剧等）。"}]}],"phonetic":"/kuːˈnɛstə/","extraExplanation":["“kuneste”本身不常见于英语语料库与主流词典中。如果它来自作业/书名/人名/地名，可能是专有名词（需要上下文才能确认含义）。","如果你是想表达英语单词，请把原句发出来，或告诉我你想表达的意思（例如“最聪明的/最能干的/知识/艺术”等），我可以帮你匹配最可能的正确拼写与用法。"]}
{"word":"kung","summary":{"en":"“Kung” is an uncommon standalone word in English, usually a casual short form of “kung fu,” meaning Chinese martial arts.","zh":"“Kung”在英语里不太常单独用，多为“kung fu（功夫）”的口语简写，指中国武术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “kung fu”; Chinese martial arts, or a particular style of martial arts.","zh":"（非正式）“kung fu（功夫）”的简写；指中国武术，或某一种武术流派。"},"examples":[{"en":"He’s been learning kung since middle school.","zh":"他从初中开始学功夫（武术）。"},{"en":"That move looks like it came from kung.","zh":"那一招看起来像是功夫里的动作。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, from Chinese) Skill achieved through long practice; effort or hard work (often seen in compounds like “kung fu”).","zh":"（少见，源自中文）通过长期练习获得的本领；努力、下功夫（常见于合成词“kung fu”中）。"},"examples":[{"en":"In the original sense, kung is about skill built over time, not just fighting.","zh":"在更原始的含义里，kung 指的是长期积累的本领，不只是打斗。"},{"en":"Good cooking also takes kung—practice and patience.","zh":"好厨艺也需要功夫——练习和耐心。"}]}],"synonyms":["kung fu","martial arts","wushu"],"phonetic":"/kʌŋ/","extraExplanation":["“Kung”在英语里单独使用并不常见，更常见的是固定搭配“kung fu”。“Kung fu”来自中文“功夫（gōngfu）”，在中文里既可以指武术，也可以泛指“下功夫、花时间练出来的本领”。英语里通常更偏向“武术”的意思。"]}
{"word":"kung fu","summary":{"en":"Kung fu usually means Chinese martial arts, and can also mean skill developed through hard practice.","zh":"Kung fu 通常指中国功夫/武术，也可引申为通过刻苦练习获得的技能与真本事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese martial art, or martial arts in general, especially those that use coordinated movements, balance, and discipline","zh":"中国功夫；（广义）武术，尤指讲究协调动作、平衡与训练纪律的格斗技艺"},"examples":[{"en":"She has practiced kung fu since she was a child.","zh":"她从小就练功夫。"},{"en":"In the movie, the hero uses kung fu to defend himself.","zh":"电影里，主角用功夫保护自己。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) skill gained through practice and hard work; know-how","zh":"（非正式）通过练习和努力获得的本领；技能；门道"},"examples":[{"en":"It takes real kung fu to write clear code.","zh":"写出清晰的代码需要真功夫。"},{"en":"Negotiation kung fu comes from experience.","zh":"谈判的“功夫”来自经验。"}]}],"synonyms":["martial arts","wushu","combat training","skill","know-how"],"phonetic":"/ˌkʌŋ ˈfuː/","extraExplanation":["“Kung fu”来自中文“功夫（gōngfu）”，本义是“时间与努力的积累”，所以英语里也常用来比喻“真本事/熟练技巧”。","在更正式的语境里，谈到中国武术常见的词还有“wushu（武术）”。在影视与流行文化影响下，“kung fu”在英语中更容易让人联想到中国功夫电影与格斗风格。"]}
{"word":"Kungfu","summary":{"en":"Kung fu means Chinese martial arts, and informally it can also mean skill developed through long practice.","zh":"Kung fu 指中国武术；口语中也可指通过长期练习获得的本领/功力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Chinese martial art (or the skill and practice of fighting arts from China), often involving disciplined training, forms, and self-defense.","zh":"中国武术；（源自中国的）格斗技艺与训练体系，常包含套路、基本功与防身技巧。"},"examples":[{"en":"She has practiced kung fu for five years.","zh":"她练功夫已经五年了。"},{"en":"In the movie, the hero uses kung fu to defend himself.","zh":"在电影里，主角用功夫保护自己。"}]},{"partOfSpeech":"n.","definition":{"en":"Skill or expertise gained through long practice and hard work (often used informally).","zh":"（非正式）通过长期练习与努力获得的本领；功力。"},"examples":[{"en":"With enough practice, you’ll develop the kung fu to play that song smoothly.","zh":"多练一练，你就能练出把那首歌弹顺的“功夫”。"},{"en":"He has real kung fu in the kitchen—his noodles are amazing.","zh":"他在厨房里真有两下子——他做的面特别棒。"}]}],"synonyms":["wushu","martial arts","self-defense","skill","expertise","mastery"],"phonetic":"ˌkʌŋ ˈfuː","extraExplanation":["“Kung fu”常见写法也有“kungfu”，但在英文中更标准的分写是“kung fu”。它来自中文“功夫”（普通话 pinyin: gōngfu），本义偏向“花时间下的功力/本领”，所以英文里也发展出“通过努力练出来的技能”这种引申义。","在北美语境里，“kung fu”有时会被用来泛指中国武术，虽然更准确的总称也常见“wushu”。在影视文化影响下（如李小龙、成龙等），该词在英语里非常普及。"]}
{"word":"kungfu","summary":{"en":"Kungfu means Chinese martial arts, and more broadly, skill earned through long practice.","zh":"Kungfu 指中国武术，也可泛指通过长期练习获得的真本事/功力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A style or system of Chinese martial arts (for self-defense, sport, or performance), often shown in movies and stage fighting.","zh":"中国武术的一种风格或体系（用于自卫、运动或表演），也常见于电影与舞台动作设计。"},"examples":[{"en":"He has practiced kungfu since he was a child.","zh":"他从小就开始练功夫。"},{"en":"The film features classic kungfu fight scenes.","zh":"这部电影有经典的功夫打斗场面。"},{"en":"She joined a kungfu class to improve her fitness and balance.","zh":"她参加功夫课来提高体能和平衡感。"}]},{"partOfSpeech":"n.","definition":{"en":"Skill gained through long practice and hard work (a broader meaning, especially in Chinese cultural contexts).","zh":"通过长期练习与努力获得的本领/功力（更广义的用法，常见于中文文化语境）。"},"examples":[{"en":"Good writing takes kungfu—years of practice.","zh":"写作需要功夫——要练很多年。"},{"en":"Cooking this dish well requires real kungfu.","zh":"把这道菜做得好很需要真功夫。"}]}],"synonyms":["kung fu","Chinese martial arts","wushu","martial arts","skill","craft"],"phonetic":"/ˌkʌŋˈfuː/","extraExplanation":["“kungfu”常见拼写也有“kung fu”。在英语里，它既可以指中国武术，也常被借用来表示“下功夫、真本事”。","文化语境：在英文媒体中，“kungfu”常与电影（如武打片）形象绑定；但在中文里，“功夫”也常用来指时间与努力（例如“花功夫”）。"]}
{"word":"Kunikos","summary":{"en":"“Kunikos” usually refers to multiple people named Kuniko or is a casual/incorrect way of writing the possessive “Kuniko’s.”","zh":"“Kunikos”通常指多位名叫Kuniko的人，或是把所有格“Kuniko’s”随手写/误写成没有撇号的形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A plural or possessive form of the Japanese given name “Kuniko” (often seen as “Kunikos” in casual writing, or “Kuniko’s” for possessive).","zh":"日文名“Kuniko（邦子/国子等）”的复数或所有格形式（口语/随手写时可能写成“Kunikos”，表示复数或本应写作“Kuniko’s”的所有关系）。"},"examples":[{"en":"There are two Kunikos in our class, so the teacher uses their last names.","zh":"我们班里有两位叫Kuniko的人，所以老师用她们的姓来区分。"},{"en":"Kunikos’ schedules are different, so we meet them separately.","zh":"两位Kuniko的日程不一样，所以我们分别跟她们见面。"},{"en":"Kuniko’s presentation was clear and well organized.","zh":"Kuniko的展示很清晰、很有条理。"}]}],"synonyms":["Kuniko","Kuniko’s","Kunikos’"],"phonetic":"/kuːˈniːkoʊz/","extraExplanation":["“Kuniko（くにこ）”是日本女性名，常见汉字写法有“邦子”“国子”等；不同写法含义会略有差异。","英语里一般用撇号表示所有格：单数是“Kuniko’s”。如果是复数且以-s结尾，所有格通常写作“Kunikos’”。只写“Kunikos”通常表示复数（多位叫Kuniko的人）。"]}
{"word":"kunk","summary":{"en":"“Kunk” is not a standard common English word; it is most often a misspelling of “skunk.”","zh":"“kunk”不是常见的标准英语词，最常见是把“skunk（臭鼬）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard spelling/word form, often used as a misspelling of “skunk.”","zh":"一个非常少见或不规范的拼写/词形，常见于把“skunk（臭鼬）”误拼成“kunk”。"},"examples":[{"en":"I think you mean “skunk,” not “kunk.”","zh":"我觉得你想写的是“skunk”，不是“kunk”。"},{"en":"She typed “kunk” by mistake when searching for skunk facts.","zh":"她在搜索臭鼬资料时，不小心把“skunk”打成了“kunk”。"}]}],"phonetic":"/kʌŋk/","extraExplanation":["“kunk”在标准英语词典里通常不是常用词条；最常见情况是把“skunk（臭鼬）”漏掉了开头的 s。","如果你想查的是“skunk”，它既可以指动物“臭鼬”，也常用来形容“很难闻/把人熏跑”，在口语里还能表示“彻底击败（对手一分未得）”。"]}
{"word":"kunkur","summary":{"en":"Kunkur is a South Asian (especially Indian) term for hard calcareous nodules or crust in soil, sometimes used to make lime or for building.","zh":"Kunkur 是南亚（尤指印度）对土壤中坚硬钙质结核/硬壳的称呼，可用于制石灰或建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of hard, chalky material (calcareous nodules or crust) found in the soils of South Asia, especially India; often used as a source of lime or as building material.","zh":"（南亚，尤指印度常见的）钙质结核/钙质硬壳；一种坚硬的粉白色石灰质土块，可用于制石灰或建筑。"},"examples":[{"en":"Road builders in some parts of India once used kunkur as a local construction material.","zh":"在印度的一些地区，修路的人曾把 kunkur 当作就地取材的建筑材料。"},{"en":"The soil contained many kunkur nodules, showing a high amount of calcium carbonate.","zh":"土壤里有许多 kunkur 结核，说明碳酸钙含量较高。"}]}],"synonyms":["kankar","calcrete (related)"],"phonetic":"/ˈkʌŋ.kər/","extraExplanation":["这个词在英文地质/殖民时期文献里更常见，现代学术或通用写作中更常用拼写 kankar（也指同类的钙质结核层）。","kunkur/kankar 常见于干旱或半干旱地区的土壤中，形成“硬层”（calcrete），会影响农业排水与植物扎根，但也可被开采用来烧制石灰（lime）。"]}
{"word":"kunmiut","summary":{"en":"Commute most commonly means traveling regularly between home and work/school; it can also mean reducing a legal punishment.","zh":"Commute最常指“通勤”（家与工作/学校间的规律往返）；在正式语境中也可指“减刑/减轻处罚”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to travel regularly between your home and your workplace or school","zh":"（通勤）定期在家与工作地点/学校之间往返"},"examples":[{"en":"I commute to work by subway every day.","zh":"我每天坐地铁通勤上班。"},{"en":"She commutes from New Jersey to New York City.","zh":"她从新泽西通勤到纽约市。"}]},{"partOfSpeech":"n.","definition":{"en":"a regular trip between your home and your workplace or school","zh":"通勤路程；上下班（上学）往返的路"},"examples":[{"en":"My commute takes about 40 minutes.","zh":"我的通勤大约要40分钟。"},{"en":"He has a long commute, so he leaves early.","zh":"他通勤很远，所以出门很早。"}]},{"partOfSpeech":"vt.","definition":{"en":"(formal) to replace a punishment or payment with a less severe one; to commute a sentence","zh":"（正式）减轻（刑罚/支付）；将刑期减为较轻的形式（commute a sentence）"},"examples":[{"en":"The governor commuted his prison sentence to time served.","zh":"州长将他的监禁刑期减为已服刑期。"},{"en":"The judge refused to commute the fine.","zh":"法官拒绝减免罚款。"}]}],"synonyms":["travel to work","ride","journey","reduce (a sentence)","mitigate"],"phonetic":"/kəˈmjuːt/","extraExplanation":["你输入的“kunmiut”看起来像是拼写错误；常见正确拼写是 **commute**。发音里重音在第二个音节：kə-**MYOOT**。","日常英语里最常用的是“通勤”（上班/上学往返）。在新闻或法律语境中也常见“commute a sentence（减刑）”，但语气更正式。"]}
{"word":"kunwari","summary":{"en":"Kunwari is a Filipino/Tagalog word meaning “supposedly/allegedly” or “like/as if; pretending,” often with a skeptical or teasing tone.","zh":"Kunwari 是菲律宾语/塔加洛语常用词，可表示“据说/所谓”，也可表示“好像/装作”，常带怀疑或调侃语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"supposedly; allegedly (used to show you doubt something is true)","zh":"据说；据称（常带怀疑语气）"},"examples":[{"en":"Kunwari, he didn’t hear you—but he was looking right at you.","zh":"他“据说”没听见你说话——可他明明正看着你。"},{"en":"She said, kunwari the bus was late, but I think she just woke up late.","zh":"她说“据说”是公交晚点，但我觉得她只是起晚了。"}]},{"partOfSpeech":"adv.","definition":{"en":"like; as if; pretending (used when someone is acting or making it seem true)","zh":"好像；仿佛；装作（表示假装、做样子）"},"examples":[{"en":"He smiled, kunwari he was happy, but you could tell he was worried.","zh":"他笑着，装作很开心，但你看得出他在担心。"},{"en":"Stop acting kunwari you don’t know what happened.","zh":"别装作你不知道发生了什么。"}]}],"synonyms":["supposedly","allegedly","as if","pretend","so-called"],"phonetic":"/kunˈwɑri/","extraExplanation":["“Kunwari”在菲律宾语言（主要是塔加洛语/菲律宾语）里很常见，口语里既可表示“据说/所谓”，也可表示“装作/假装”。","它常被认为来自“kung wari”（大意是“如果（是）那样的话/如果那样假设”），后来在口语中合并成一个词。","语气上常带一点讽刺或不相信：说话者往往在暗示“我才不信呢”或“你在演”。"]}
{"word":"kunzite","summary":{"en":"Kunzite is a pink-to-lilac gemstone, a variety of spodumene, used in jewelry.","zh":"Kunzite 指粉红到淡紫色的宝石，是锂辉石（spodumene）的一种，常用于珠宝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pink to lilac gemstone (a variety of the mineral spodumene), often used in jewelry","zh":"粉红到淡紫色的宝石（矿物“锂辉石”的一种），常用于珠宝首饰"},"examples":[{"en":"She wore a ring with a pale pink kunzite stone.","zh":"她戴着一枚镶有浅粉色紫锂辉石的戒指。"},{"en":"Kunzite can look different under daylight and indoor lighting.","zh":"紫锂辉石在日光和室内灯光下看起来可能不一样。"}]}],"synonyms":["spodumene (variety)","gemstone"],"phonetic":"/ˈkʌnzaɪt/","extraExplanation":["“kunzite”来自美国宝石学家 George Frederick Kunz（乔治·弗雷德里克·昆兹）的姓氏。该宝石在20世纪初被命名，用来纪念他对宝石研究与推广的贡献。","紫锂辉石属于锂辉石（spodumene）家族，颜色多为粉紫色；在珠宝语境中常被强调“柔和、浪漫”的色调。购买或佩戴时，常见建议是避免强烈日照与高温，因为部分颜色可能会随时间褪淡。"]}
{"word":"kunzites","summary":{"en":"“Kunzites” means multiple kunzite gemstones (pink-to-violet spodumene) used in jewelry.","zh":"“Kunzites”指多颗 kunzite 宝石（粉到紫色的锂辉石变种），常用于珠宝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of kunzite: pale pink to violet gemstone crystals (a variety of the mineral spodumene) used in jewelry.","zh":"kunzite 的复数：一种用于珠宝的浅粉到紫色宝石晶体（矿物“锂辉石”spodumene 的一种变种）。"},"examples":[{"en":"The jeweler showed us several kunzites with different shades of pink.","zh":"珠宝商给我们看了几颗不同粉色深浅的 kunzites（紫锂辉石）。"},{"en":"Kunzites can look more purple under certain lighting.","zh":"在某些光线下，kunzites 可能看起来更偏紫。"},{"en":"She chose kunzites for the necklace because they felt soft and romantic.","zh":"她选择用 kunzites 做项链，因为颜色显得柔和又浪漫。"}]}],"synonyms":["kunzite","pink spodumene"],"phonetic":"/ˈkʌn.zaɪts/","extraExplanation":["“Kunzite”以美国宝石学家 George F. Kunz 命名。它是锂辉石（spodumene）的一种，以粉紫色著称，常用于戒指、吊坠等首饰。","学习小提示：英语里许多宝石名词既可作可数名词（a kunzite / two kunzites），也可作不可数名词指“这种材料”（kunzite jewelry）。"]}
{"word":"kuomintang","summary":{"en":"Kuomintang: the Chinese Nationalist Party (KMT).","zh":"Kuomintang：指中国国民党（KMT）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The major Chinese political party also known as the Chinese Nationalist Party, founded in 1912; it ruled mainland China (1928–1949) and later became one of the main political parties in Taiwan.","zh":"中国国民党（也称“中国民族主义政党/中国国民党”），成立于1912年；曾在1928—1949年统治中国大陆，之后在台湾成为主要政党之一。"},"examples":[{"en":"The Kuomintang (KMT) moved its government to Taiwan in 1949.","zh":"国民党（KMT）于1949年将政府迁至台湾。"},{"en":"In many history books, the Kuomintang is discussed alongside the Chinese Communist Party.","zh":"在许多历史书中，国民党常与中国共产党一起被讨论。"}]}],"synonyms":["KMT","Chinese Nationalist Party","Nationalists (historical context)"],"phonetic":"/ˌkwɔːmɪnˈtæŋ/","extraExplanation":["“Kuomintang”来自中文“国民党”的威妥玛式/早期罗马字拼写（可理解为旧式拼法）；现代汉语拼音通常写作“Guomindang”，英文中也常用缩写“KMT”。","在英语语境里，它通常作为专有名词使用，首字母大写：the Kuomintang / the KMT。谈历史时常与“Nationalists（国民政府/国民党方面）”“Nationalist government（国民政府）”等表达一起出现。"]}
{"word":"kupfernickel","summary":{"en":"Kupfernickel is a copper–nickel alloy commonly used for coins.","zh":"Kupfernickel 指常用于硬币等的铜镍合金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a copper–nickel alloy (cupronickel), often used for coins because it is strong and resists corrosion","zh":"铜镍合金（cupronickel），常用于铸币等，因为坚固且耐腐蚀"},"examples":[{"en":"Many modern “silver-colored” coins are made from kupfernickel rather than real silver.","zh":"许多现代“银色”的硬币其实是用kupfernickel（铜镍合金）做的，而不是真银。"},{"en":"The museum label says the token is struck in kupfernickel.","zh":"博物馆标签写着这枚代币是用kupfernickel压制的。"}]}],"synonyms":["cupronickel","copper-nickel alloy","copper-nickel"],"phonetic":"/ˈkʊpfərˌnɪkəl/","extraExplanation":["“Kupfernickel”来自德语：Kupfer=“铜”，Nickel=“镍”。英语里更常见的说法是“cupronickel”或“copper-nickel (alloy)”。","在钱币语境中，它常指用于铸造“银色外观”硬币的铜镍合金；之所以常用，是因为耐磨、耐腐蚀、成本较低且不易变色。"]}
{"word":"kupfferite","summary":{"en":"Kupfferite is a rare mineral name used mainly in technical geology/mineralogy contexts.","zh":"Kupfferite 是一种罕见矿物的名称，主要用于地质/矿物学等技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral name used in geology/mineralogy (not a common everyday word)","zh":"（地质/矿物学）一种罕见矿物的名称（非日常常用词）"},"examples":[{"en":"Kupfferite is mainly discussed in mineralogy references, not in general English.","zh":"Kupfferite 主要出现在矿物学资料中，而不常见于一般英语。"},{"en":"The rock sample was tested to see whether it contained kupfferite.","zh":"研究人员检测这块岩石样品是否含有 kupfferite。"}]}],"phonetic":"/ˈkʌpfəˌraɪt/","extraExplanation":["这个词属于高度专业的矿物学词汇，常见于矿物名录、学术论文或博物馆标本说明中。","以 -ite 结尾的词在矿物名称里很常见，通常表示“某种矿物/岩石”。","许多矿物名称来自人名或地名（用来纪念发现者、研究者或产地）；kupfferite 也很可能属于这种命名方式。若你需要更精确的矿物成分与分类，请告诉我你看到它的出处（书名/论文/图片标签），我可以根据上下文补充更准确的信息。"]}
{"word":"kuphar","summary":{"en":"“Kuphar” is not standard English; it is most likely a variant transliteration of Arabic “kuffar,” meaning “nonbelievers,” and it can be offensive depending on context.","zh":"“kuphar”不是标准英语词；很可能是阿拉伯语 “kuffar” 的变体音译，意为“非信士/不信教者”，语境不当时可能带侮辱性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mostly in discussions of Islam; from Arabic kuffār) a plural term meaning “nonbelievers,” i.e., people who do not accept Islam. It can be neutral in academic writing but is often felt as insulting in real-life use.","zh":"（多见于伊斯兰相关讨论；源自阿拉伯语 kuffār）指“非信士/不信教者”，即不接受伊斯兰信仰的人。在学术语境中可能较中性，但在日常使用中常被视为带侮辱性。"},"examples":[{"en":"Some online posts use “kuffar/kuphar” as a slur against people of other religions.","zh":"一些网络帖子把“kuffar/kuphar”当作针对其他宗教人群的贬损用语。"},{"en":"In academic texts, the term may appear when explaining classical Islamic law and theology.","zh":"在学术文本中，这个词可能用于解释古典伊斯兰法与神学。"}]},{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling/transliteration. “Kuphar” is not a common standard English word; it may be a misspelling or a name (surname/place).","zh":"一种非标准拼写/音译形式。“kuphar”并非常见标准英语词，可能是拼写错误或人名/地名。"},"examples":[{"en":"Could you share the sentence where you saw “kuphar”? It may be a name or a different word.","zh":"你能提供看到“kuphar”的句子吗？它可能是人名或其实是另一个词。"}]}],"synonyms":["nonbelievers","non-Muslims (context-dependent)"],"phonetic":"/ˈkuːfɑr/","extraExplanation":["“kuphar”很可能是把阿拉伯语 **kuffār**（常见拼写：kuffar）音译成英文时出现的变体拼写。不同地区/作者可能会写成 kufar、kuffar、kufr 等。","这个词在现实交流中容易带有攻击性或群体标签化色彩。若你是写作或翻译，建议根据语境改用更中性的表达（如 “non-Muslims / nonbelievers”），或在学术讨论中注明其来源与语用色彩。","如果你想查的其实是别的英文词（例如拼错了），把原句或你想表达的意思发来，我可以帮你定位最可能的正确拼写与用法。"]}
{"word":"kupper","summary":{"en":"“Kupper” is most commonly a surname; it isn’t a common English vocabulary word and may be a misspelling of another term.","zh":"“Kupper”最常见是姓氏；不是常用英语词汇，也可能是其他词的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname). In English, “Kupper” is usually used as a last name rather than a common vocabulary word.","zh":"（姓氏）“Kupper”在英语里通常用作姓（家族名），不是常见词汇。"},"examples":[{"en":"Dr. Kupper will see you now.","zh":"Kupper 医生现在要见你。"},{"en":"The paper was written by Anna Kupper.","zh":"这篇论文由安娜·库珀（Anna Kupper）撰写。"}]},{"partOfSpeech":"other","definition":{"en":"Not a standard English word in everyday dictionaries; it may be a misspelling of another word (often “cupper”) or a brand/user name.","zh":"不是英语日常词典里的标准词；可能是其他词的拼写错误（常见如“cupper”），或是品牌名/用户名。"},"examples":[{"en":"Did you mean “cupper” (a person or device that cups something)?","zh":"你想写的是“cupper”（指“做拔罐的人/拔罐器具”，或“把东西做成杯状的人/工具”）吗？"},{"en":"I couldn’t find “kupper” in a standard dictionary—can you share the sentence you saw it in?","zh":"我在常见词典里找不到“kupper”——你能把看到它的句子发我吗？"}]}],"phonetic":"/ˈkʌpər/","extraExplanation":["“Kupper”常见于人名/姓氏，也可能来自其他语言的拼写（例如德语姓氏）。如果你告诉我它出现的句子、领域（医学/品牌/游戏ID等）或是否想查“cupper / copper / Kupfer”，我可以更准确地解释。"]}
{"word":"kurajong","summary":{"en":"Kurrajong is an Australian tree (often the bottle tree) and can also mean its bark fiber used for making rope.","zh":"Kurrajong 指澳大利亚的一种树（常指瓶树），也可指其用于制绳的树皮纤维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of Australian tree (genus *Brachychiton*), especially the bottle tree, often grown for shade and its distinctive swollen trunk","zh":"澳大利亚的一种树（梧桐属 *Brachychiton*），尤指瓶树；常用于遮荫，树干常呈膨大状，很有辨识度"},"examples":[{"en":"We stopped for lunch under a kurrajong to escape the heat.","zh":"我们在一棵库拉琼树（kurrajong）下停下来吃午饭，躲避酷热。"},{"en":"Kurrajongs are common in parts of Australia’s dry inland landscapes.","zh":"在澳大利亚一些干旱的内陆地区，库拉琼树很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"the tough inner bark fiber from a kurrajong tree, traditionally used to make rope or cord","zh":"库拉琼树的韧性内树皮纤维；传统上可用来制绳或编织绳索"},"examples":[{"en":"The basket was tied with kurrajong fiber.","zh":"这个篮子是用库拉琼纤维捆扎的。"},{"en":"People once used kurrajong bark to make strong cords.","zh":"过去人们曾用库拉琼树皮制作结实的绳索。"}]}],"synonyms":["bottle tree","Brachychiton"],"phonetic":"/ˈkʌrəˌdʒɔŋ/","extraExplanation":["“Kurrajong”源自澳大利亚原住民语言（常见说法与新南威尔士一带的语言有关），在澳大利亚英语里既指树，也可指其树皮纤维。","常见拼写是 **kurrajong**（两个 r）；你输入的 **kurajong** 也可能是拼写误差。"]}
{"word":"kuranko","summary":{"en":"Kuranko refers to the Kuranko people or their language in Sierra Leone and Guinea.","zh":"Kuranko 指库兰科民族，或他们在塞拉利昂与几内亚使用的库兰科语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Kuranko (Koranko) people, an ethnic group mainly in Sierra Leone and Guinea (West Africa).","zh":"库兰科人（也拼作 Koranko），主要分布在西非塞拉利昂和几内亚的一个民族成员。"},"examples":[{"en":"Many Kuranko communities live in the northern and northeastern regions of Sierra Leone.","zh":"许多库兰科人社区居住在塞拉利昂北部和东北部地区。"},{"en":"She is Kuranko and grew up near the border with Guinea.","zh":"她是库兰科人，在靠近几内亚边境的地方长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Kuranko language, a Mande language spoken mainly in Sierra Leone and Guinea.","zh":"库兰科语（一种曼德语族语言），主要在塞拉利昂和几内亚使用。"},"examples":[{"en":"He speaks Kuranko at home and English at school.","zh":"他在家说库兰科语，在学校说英语。"},{"en":"The health poster was translated into Kuranko to reach more villagers.","zh":"这张健康宣传海报被翻译成库兰科语，以便让更多村民读懂。"}]}],"synonyms":["Koranko"],"phonetic":"/kʊˈræŋkoʊ/","extraExplanation":["“Kuranko”在英语资料中也常见拼写为“Koranko”。有时既可指民族，也可指语言；具体含义通常由上下文决定。","库兰科语属于尼日尔-刚果语系中的曼德语族（Mande languages），与该地区其他曼德语言在词汇和语法上有一定亲缘关系。"]}
{"word":"kurbash","summary":{"en":"Kurbash means a whip, especially one historically associated with Egypt and used for punishment or driving animals.","zh":"kurbash 指一种鞭子，尤指历史上与埃及相关、用于惩罚或驱赶牲畜的鞭子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a whip (often made of leather or hippopotamus hide), historically used in Egypt and nearby regions, especially for punishment or to drive animals","zh":"（库尔巴什）一种鞭子（常为皮革或河马皮制），历史上多见于埃及及周边地区，常用于惩罚或驱赶牲畜"},"examples":[{"en":"The guard raised a kurbash as a threat, and the prisoners fell silent.","zh":"卫兵举起库尔巴什作为威胁，囚犯们立刻安静下来。"},{"en":"In old travel accounts, the kurbash is mentioned as a tool of punishment.","zh":"在早期的旅行记述中，库尔巴什常被提到是一种惩罚工具。"}]}],"synonyms":["whip","lash","scourge"],"phonetic":"/ˈkɝˌbæʃ/","extraExplanation":["“kurbash”也常拼作“courbash / kourbash”。词源一般认为来自阿拉伯语（如 *qurbāj* 一类的形式），在英语里多出现在历史、殖民时期记述或文学作品中，用来指带有特定地域色彩的“鞭子”。","语体提示：这个词常与惩罚、暴力或压迫的历史语境相关，使用时注意上下文与文化敏感性；日常英语更常用 *whip* 或 *lash*。"]}
{"word":"kurbashed","summary":{"en":"“Kurbashed” means “whipped/beaten with a kurbash (a leather whip).”","zh":"“kurbashed”意为“被用kurbash（一种皮鞭）抽打/鞭笞”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “kurbash”: to whip or beat (someone), especially with a leather whip.","zh":"“kurbash”的过去式/过去分词：用皮鞭（尤指中东、北非常见的一种皮鞭）抽打、鞭笞（某人）。"},"examples":[{"en":"The prisoner was kurbashed for trying to escape.","zh":"囚犯因为企图逃跑而被鞭笞。"},{"en":"He said he had been kurbashed by the guards.","zh":"他说自己曾被看守用鞭子抽打。"}]}],"synonyms":["whipped","flogged","lashed","scourged"],"phonetic":"/kɝˈbæʃt/","extraExplanation":["“kurbash”（也常写作 *courbash*）指一种传统皮鞭，词源与阿拉伯语/土耳其语有关，常出现在描写奥斯曼帝国或埃及等地区的历史文字与旅行/殖民时期记述中。由于带有强烈的历史与暴力语境，这个词在现代英语里较少使用，更多见于历史叙述或文学作品中。"]}
{"word":"kurbashes","summary":{"en":"Kurbashes are whips; a kurbash can also mean to whip someone.","zh":"kurbashes 是“皮鞭”的复数；kurbash 也可作动词，指“用鞭子抽打”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a whip (especially a leather whip formerly used in parts of North Africa and the Middle East), often associated with punishment or coercion","zh":"（尤指过去北非和中东部分地区使用的皮鞭）鞭子；常与惩罚或胁迫有关"},"examples":[{"en":"In the old story, the guard carried a kurbash at his side.","zh":"在那个老故事里，卫兵腰边带着一条库尔巴什皮鞭。"},{"en":"The novel describes the kurbash as a symbol of harsh rule.","zh":"小说把库尔巴什皮鞭描写成残酷统治的象征。"}]},{"partOfSpeech":"v.","definition":{"en":"to whip or beat someone with a kurbash","zh":"用库尔巴什皮鞭抽打；鞭笞"},"examples":[{"en":"The film avoids showing anyone being kurbashed, but it makes the threat clear.","zh":"电影避免直接展示鞭笞画面，但威胁的意味很明显。"},{"en":"He feared they would kurbash him for speaking out.","zh":"他担心自己会因为出声反对而遭到鞭笞。"}]}],"synonyms":["whip","lash","scourge"],"phonetic":"/kʊrˈbæʃ/","extraExplanation":["“kurbash”也常拼作“kurbash”。词源一般认为来自阿拉伯语（qurbāsh/kurbaaj 一类的转写），在英语文本里多出现在历史叙述、游记或以埃及等地为背景的文学作品中。","你输入的“kurbashes”通常是复数形式：one kurbash（一个皮鞭），two kurbashes（两条皮鞭）。在现代日常英语里较少用，更多带有历史/文化语境。"]}
{"word":"kurbashing","summary":{"en":"Curb-bashing means scraping or hitting a car wheel/tires against the curb, usually by accident while parking.","zh":"Curb-bashing 指开车/停车时不小心刮到或撞到路缘石，导致车轮或轮毂受损。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Informal) Hitting or scraping a vehicle’s wheels/tires against the curb while driving or parking, often causing damage (scuffs, bent rims, tire wear).","zh":"（非正式）开车或停车时车轮/轮胎撞到或刮到路缘石，常会造成损伤（刮痕、轮毂变形、轮胎磨损）。"},"examples":[{"en":"Parallel parking is where a lot of curb-bashing happens.","zh":"侧方停车时最容易发生“蹭马路牙子/撞路沿”的情况。"},{"en":"The rental company charged me because of curb-bashing on the front wheel.","zh":"因为前轮蹭了路沿，租车公司向我收费。"}]}],"synonyms":["hit the curb","scrape the curb","kerb-bashing (UK)","curb rash (related)"],"phonetic":"/ˈkɝb ˌbæʃɪŋ/","extraExplanation":["“kurbashing”多半是把 **curb-bashing** 连写或拼写变体。英式英语常写 **kerb**（kerb-bashing）。","口语里也常说 **hit the curb / scrape the curb / curb rash**（轮毂被路沿刮伤的痕迹）。"]}
{"word":"kurchatovium","summary":{"en":"Kurchatovium is an obsolete name once proposed for element 104, now officially called rutherfordium.","zh":"Kurchatovium是曾用于104号元素的旧拟议名称；该元素现正式称为rutherfordium。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now obsolete) proposed name for the chemical element rutherfordium (atomic number 104), used mainly in historical discussions of element naming.","zh":"“kurchatovium”曾经是化学元素“rutherfordium（鑪/卢瑟福元素，原子序104）”的一个已废弃拟议名称，主要出现在元素命名历史的讨论中。"},"examples":[{"en":"In older sources about element 104, you may see it called kurchatovium.","zh":"在一些较早的关于104号元素的资料里，你可能会看到它被称为kurchatovium。"},{"en":"The name kurchatovium is now obsolete; the accepted name is rutherfordium.","zh":"kurchatovium这个名称现在已不再使用；公认名称是rutherfordium。"}]}],"synonyms":["rutherfordium","element 104","Rf"],"phonetic":"/kɝˈtʃɑːtəˌviəm/","extraExplanation":["“kurchatovium”来源于苏联对元素104的命名提议，用来纪念物理学家伊戈尔·库尔恰托夫（Igor Kurchatov）。冷战时期，不同国家/团队在发现权与命名权上有争议，因此同一元素在不同时期出现过多个名称。","国际纯粹与应用化学联合会（IUPAC）后来为解决争议，最终确定元素104的正式英文名为“rutherfordium”。在现代化学教材与期刊中，基本只会在历史脉络下提到“kurchatovium”。"]}
{"word":"kurchicine","summary":{"en":"“Kurchicine” is not a standard English word; it most likely refers to “colchicine,” a prescription drug used mainly for gout.","zh":"“kurchicine”不是标准英语词；最可能是指“colchicine（秋水仙碱）”，一种主要用于治疗痛风的处方药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) Usually intended to mean “colchicine,” a medicine used to treat gout attacks and some inflammatory conditions.","zh":"（常见拼写错误）通常是指“colchicine（秋水仙碱）”，一种用于治疗痛风急性发作及某些炎症性疾病的药物。"},"examples":[{"en":"I think “kurchicine” is a misspelling—do you mean colchicine for gout?","zh":"我觉得“kurchicine”可能拼错了——你是想说治疗痛风的colchicine吗？"},{"en":"The doctor prescribed colchicine to reduce the inflammation during the gout flare.","zh":"医生开了秋水仙碱（colchicine）来减轻痛风发作时的炎症。"}]}],"synonyms":["colchicine","autumn crocus alkaloid","gout medicine"],"phonetic":"/ˈkɑltʃəˌsin/","extraExplanation":["“kurchicine”不是常见的英语单词，医学语境里最可能是把“colchicine”拼错了（秋水仙碱）。","colchicine 也可指从植物（如秋水仙 Colchicum autumnale）中提取的生物碱；这种物质有毒性，属于处方药/专业用途词汇。","如果你是在药单或化验单上看到这个词，建议核对原文拼写或咨询医生/药师（不要自行用药）。"]}
{"word":"kurchine","summary":{"en":"“Kurchine” is not standard English; it’s probably a misspelling or a transliteration. Provide context to identify the intended word.","zh":"“kurchine”不是标准英文，可能是拼写错误或外语转写；给出上下文可帮助确定你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a transliteration (a spelling of a word from another language) rather than an established English vocabulary item.","zh":"不是标准英文单词。更可能是拼写错误，或是外语词的音译/转写形式，而不是常见英语词汇。"},"examples":[{"en":"I couldn’t find “kurchine” in an English dictionary—did you mean “cuisine” or “kitchen”?","zh":"我在英文词典里查不到“kurchine”——你是不是想写“cuisine（菜系/烹饪）”或“kitchen（厨房）”？"},{"en":"If “kurchine” is a name or a word from another language, tell me the context and I can help interpret it.","zh":"如果“kurchine”是人名或外语词，请告诉我上下文，我可以帮你判断含义。"}]}],"phonetic":"/ˈkɝtʃaɪn/","extraExplanation":["“kurchine”在常见英美词典中不作为标准词条出现，所以很难给出可靠的发音与固定释义。","如果你是在菜单/美食语境看到它，最常见的接近词可能是：cuisine（菜系、烹饪风格）或 kitchen（厨房）。如果是在形容人或小孩，可能有人想写 urchin（顽童；海胆）。","把你看到的完整句子（或图片）发来，我可以根据上下文帮你锁定正确单词与意思。"]}
{"word":"Kurd","summary":{"en":"A Kurd is a person from the Kurdish ethnic group; it can also describe something related to Kurdish people or culture.","zh":"Kurd 指库尔德族成员；也可作形容词表示与库尔德人或库尔德文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of an ethnic group native to a region called Kurdistan, which spans parts of Türkiye, Iraq, Iran, and Syria.","zh":"库尔德人；库尔德族成员（主要分布在所谓“库尔德斯坦”地区，涵盖土耳其、伊拉克、伊朗和叙利亚部分地区）"},"examples":[{"en":"Many Kurds speak Kurdish as their first language.","zh":"许多库尔德人以库尔德语为母语。"},{"en":"The novel explores the daily life of a Kurdish family and their traditions.","zh":"这部小说描写了一个库尔德家庭的日常生活与传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the Kurdish people, their languages, or their culture.","zh":"库尔德人的；库尔德语的；库尔德文化的"},"examples":[{"en":"She is studying Kurdish music and dance.","zh":"她在研究库尔德音乐与舞蹈。"},{"en":"Kurdish communities live in several Middle Eastern countries.","zh":"一些中东国家都有库尔德社群。"}]}],"synonyms":["Kurdish person","member of the Kurdish people"],"phonetic":"/kɝd/","extraExplanation":["“Kurd”在英文里既可作名词（库尔德人），也常作形容词（Kurdish更常见，表示“库尔德的”）。日常表达里，描述语言与文化时通常用“Kurdish”，如“Kurdish language / Kurdish culture”。","使用时建议注意语境与尊重：库尔德相关话题常涉及民族认同、政治与历史问题；在新闻或学术语境中，尽量用中性、事实性的表述。"]}
{"word":"kurd","summary":{"en":"Kurd: a person from the Kurdish ethnic group; also an adjective meaning “related to Kurds.”","zh":"Kurd：库尔德民族的人；也可作形容词，表示“与库尔德人/库尔德文化有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an ethnic group native mainly to the mountainous region where Turkey, Iraq, Iran, and Syria meet (often called Kurdistan).","zh":"库尔德人；主要生活在土耳其、伊拉克、伊朗和叙利亚交界山区（常被称为“库尔德斯坦”）的一个民族的成员。"},"examples":[{"en":"My classmate is a Kurd from northern Iraq.","zh":"我的同学是来自伊拉克北部的库尔德人。"},{"en":"Kurds live in several countries, so their communities can have different local cultures.","zh":"库尔德人分布在多个国家，因此不同地区的社区也会有各自的本土文化特色。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Kurds, their languages, or their culture.","zh":"库尔德人的；与库尔德人、库尔德语或库尔德文化有关的。"},"examples":[{"en":"She is studying Kurdish music and poetry.","zh":"她在研究库尔德音乐和诗歌。"},{"en":"They shared a Kurdish meal with guests.","zh":"他们和客人一起分享了一顿库尔德餐。"}]}],"synonyms":["Kurdish person","Kurdish"],"phonetic":"/kɝd/","extraExplanation":["“Kurd/Kurds”是族群名称，一般首字母大写。","“Kurdish”常用来指“库尔德语”或“库尔德文化/音乐”等；在表达“库尔德人”时也常说“a Kurdish person”。","库尔德人使用的语言统称为库尔德语，但内部有多种主要方言/语言变体（如Kurmanji、Sorani等），因此不同地区的库尔德人可能在语言上不完全相同。"]}
{"word":"Kurdish","summary":{"en":"Kurdish means ‘related to the Kurds’ or ‘the Kurdish language(s).’","zh":"Kurdish 指“库尔德人的/库尔德文化的”，也指“库尔德语（诸变体）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Kurds (an ethnic group mainly living in parts of Turkey, Iraq, Iran, and Syria) or to their culture.","zh":"与库尔德人（主要居住在土耳其、伊拉克、伊朗和叙利亚部分地区的民族）或其文化有关的；库尔德人的。"},"examples":[{"en":"Kurdish music often uses strong rhythms and traditional instruments.","zh":"库尔德音乐常常使用强烈的节奏和传统乐器。"},{"en":"She studies Kurdish history and culture.","zh":"她研究库尔德历史与文化。"}]},{"partOfSpeech":"n.","definition":{"en":"The group of languages spoken by many Kurds (often including main varieties such as Kurmanji and Sorani).","zh":"库尔德语（许多库尔德人使用的一组语言，常见主要变体包括库尔曼吉语和索拉尼语）。"},"examples":[{"en":"He can speak Kurdish and Arabic.","zh":"他会说库尔德语和阿拉伯语。"},{"en":"This book is translated into Kurdish.","zh":"这本书被翻译成库尔德语。"}]}],"synonyms":["Kurdic (less common)"],"phonetic":"/ˈkɝːdɪʃ/","extraExplanation":["“Kurdish”既可指“库尔德人的/库尔德文化的”（形容词），也可指“库尔德语”（名词）。在新闻或学术语境中常见搭配：Kurdish people（库尔德人民）、Kurdish region/areas（库尔德地区）、Kurdish language（库尔德语）。","库尔德语通常被认为属于伊朗语族的一部分，内部有多种主要方言/变体（如 Kurmanji、Sorani）。因此有时会看到复数说法：Kurdish languages（库尔德诸语言）。"]}
{"word":"kurdish","summary":{"en":"Kurdish refers to the Kurdish people, their language, or anything related to their culture.","zh":"Kurdish 指库尔德人、库尔德语，或与库尔德文化相关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Kurdish people, their language, or their culture","zh":"与库尔德人、库尔德语或库尔德文化有关的"},"examples":[{"en":"She studies Kurdish music and poetry.","zh":"她研究库尔德音乐和诗歌。"},{"en":"Kurdish food varies by region.","zh":"库尔德美食因地区而异。"}]},{"partOfSpeech":"n.","definition":{"en":"a Kurdish person; the Kurdish people as a group","zh":"库尔德人；（总称）库尔德民族"},"examples":[{"en":"Many Kurds live in Türkiye, Iraq, Iran, and Syria.","zh":"许多库尔德人生活在土耳其、伊拉克、伊朗和叙利亚。"}]},{"partOfSpeech":"n.","definition":{"en":"the Kurdish language (a group of closely related varieties)","zh":"库尔德语（由多种彼此接近的语言/方言构成）"},"examples":[{"en":"He can speak Kurdish and Arabic.","zh":"他会说库尔德语和阿拉伯语。"},{"en":"This book is translated into Kurdish.","zh":"这本书被翻译成库尔德语。"}]}],"synonyms":["Kurd (person)","Kurdic (less common)"],"phonetic":"/ˈkɝːdɪʃ/","extraExplanation":["“Kurdish”通常既可作形容词也可作名词。作名词时，既可以指“库尔德人”，也可以指“库尔德语”，具体含义常靠上下文判断。","库尔德语在现实中常见的主要变体包括Kurmanji（库尔曼吉语）和Sorani（索拉尼语）；不同地区的书写系统与拼写习惯也可能不同。","文化与政治语境中提到Kurdish话题可能较敏感；在交流时更中性、尊重的表达是明确指“people / language / culture”，避免把民族、国家与政治立场简单等同。"]}
{"word":"kurdistan","summary":{"en":"Kurdistan is a Middle Eastern region traditionally associated with Kurdish people, sometimes referring specifically to the autonomous region in northern Iraq.","zh":"库尔德斯坦是与库尔德人传统相关的中东地区名，有时也特指伊拉克北部的库尔德斯坦自治区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in the Middle East traditionally inhabited by Kurds, spanning parts of Turkey, Iraq, Iran, and Syria; sometimes used to refer specifically to the autonomous Kurdistan Region in northern Iraq","zh":"库尔德斯坦（中东一片以库尔德人为主要居民的地区），范围跨越土耳其、伊拉克、伊朗和叙利亚的部分地区；有时也特指伊拉克北部的“库尔德斯坦地区”（自治区）"},"examples":[{"en":"Many Kurds live across Turkey, Iraq, Iran, Syria, and the broader region often called Kurdistan.","zh":"许多库尔德人分布在土耳其、伊拉克、伊朗、叙利亚等地，这片更广的区域常被称为库尔德斯坦。"},{"en":"Erbil is the capital of the Kurdistan Region of Iraq.","zh":"埃尔比勒是伊拉克库尔德斯坦地区的首府。"},{"en":"The article discusses Kurdish culture in Kurdistan and neighboring countries.","zh":"这篇文章讨论了库尔德斯坦及周边国家的库尔德文化。"}]}],"synonyms":["the Kurdistan Region (of Iraq)","Kurdish regions"],"phonetic":"/ˈkʊrdɪˌstæn/","extraExplanation":["“Kurdistan”通常是地理与文化概念，不等同于一个被普遍承认的主权国家；不同语境下可能指更广泛的库尔德聚居地，或特指“伊拉克库尔德斯坦地区”（Kurdistan Region of Iraq）。","由于涉及民族、边界与政治议题，在正式写作中可更具体说明：Kurdistan Region (Iraq)（伊拉克库尔德斯坦地区）、Turkish Kurdistan（土耳其境内的库尔德聚居区）等，以避免含糊或引发误解。","词形与相关词：Kurd（库尔德人），Kurdish（库尔德的/库尔德语的）；常见搭配如 Kurdish language（库尔德语）、Kurdish culture（库尔德文化）。"]}
{"word":"kurgan","summary":{"en":"A kurgan is an ancient burial mound, especially common in the Eurasian steppe.","zh":"kurgan 指古代的坟丘（墓冢），尤常见于欧亚草原地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A burial mound (earth-and-stone hill) built over a grave, especially in the Eurasian steppe region; often associated with ancient nomadic cultures.","zh":"库尔干（坟冢）：覆盖墓葬的土石堆成的坟丘，常见于欧亚草原地区，常与古代游牧文化相关。"},"examples":[{"en":"Archaeologists excavated a kurgan and found jewelry, weapons, and horse remains.","zh":"考古学家发掘了一座库尔干，发现了珠宝、武器和马的遗骸。"},{"en":"Many kurgans dot the степpe (steppe), marking ancient burial sites.","zh":"许多库尔干散布在草原上，标示着古老的墓地。"},{"en":"The museum exhibit explains how a kurgan was built layer by layer over the tomb.","zh":"博物馆展览解释了库尔干如何在墓室上方一层层堆建而成。"}]}],"synonyms":["burial mound","tumulus","barrow"],"phonetic":"/ˈkʊrɡən/","extraExplanation":["“kurgan”一词多经由俄语进入英语，常用于考古与历史语境，指欧亚草原地带的墓葬土丘（类似英语里的 tumulus / barrow）。","相关背景：学术上有“Kurgan hypothesis（库尔干假说）”，用于讨论印欧语系早期使用者可能的起源与扩散，与草原地区的墓葬文化研究有关。"]}
{"word":"kurgans","summary":{"en":"Kurgans are large ancient burial mounds, especially from the Eurasian Steppe.","zh":"kurgans 指（多见于欧亚草原地区的）古代大型墓丘、坟冢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large burial mounds (grave hills), especially those built by ancient peoples of the Eurasian Steppe.","zh":"（尤指欧亚草原古代民族修建的）库尔干：大型坟冢、墓丘。"},"examples":[{"en":"Archaeologists excavated kurgans and found weapons, jewelry, and horse gear.","zh":"考古学家发掘了库尔干，发现了武器、珠宝和马具。"},{"en":"Many kurgans dot the grasslands of Ukraine and southern Russia.","zh":"乌克兰和俄罗斯南部的草原上散布着许多库尔干。"},{"en":"The museum exhibit explains how kurgans were used for elite burials.","zh":"博物馆展览说明了库尔干如何用于贵族葬礼。"}]}],"synonyms":["burial mounds","tumulus","barrow"],"phonetic":"/ˈkɝːɡənz/","extraExplanation":["“kurgan”一词常见于考古与历史语境，指欧亚草原地带的土冢墓葬传统，常与斯基泰人（Scythians）、萨尔马提亚人（Sarmatians）以及部分早期游牧文化相关。","在英文写作中，kurgan不仅指“土堆”，更暗含特定的文化背景：随葬品、马匹或马具、以及地位象征等；类似但更通用的词是“tumulus”（墓冢）。"]}
{"word":"kuri","summary":{"en":"Kuri is a Japanese word commonly used in English contexts to mean “chestnut,” especially in food and seasonal autumn dishes.","zh":"Kuri 是日语词，英语语境中多指“栗子”，尤其常用于日料与秋季应季食物/甜点的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Japanese loanword) a chestnut; the edible nut of a chestnut tree, often used in Japanese sweets and seasonal dishes.","zh":"（日语外来词）栗子；栗树的可食用坚果，常用于日式甜点与应季料理。"},"examples":[{"en":"This wagashi is made with kuri (chestnut) paste.","zh":"这种和菓子是用栗子泥做的。"},{"en":"In autumn, many Japanese desserts feature kuri.","zh":"秋天很多日本甜点都会用到栗子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Food context) chestnut-flavored or chestnut-based (used in menu names, e.g., “kuri cake,” “kuri kinton”).","zh":"（饮食语境）栗子味的；以栗子为主的（常见于菜单名，如“栗子蛋糕”“栗金团”）。"},"examples":[{"en":"I ordered the kuri cake because I like nutty flavors.","zh":"我点了栗子蛋糕，因为我喜欢坚果香的味道。"},{"en":"Kuri kinton is a sweet mashed chestnut dish often eaten around New Year.","zh":"栗金团是一种甜的栗子泥料理，常在新年期间食用。"}]}],"synonyms":["chestnut","marron"],"phonetic":"/ˈkʊri/","extraExplanation":["“kuri（くり）”在日语里通常写作汉字“栗”。它常和季节感联系在一起：日本把栗子视为秋季代表食材之一。","在英文菜单或日本料理介绍中，“kuri”经常直接保留日语写法，强调日式风味；但日常英文里更常说“chestnut”。","常见搭配：kuri kinton（栗金团，甜栗子泥）、kuri manju（栗子馒头/栗子点心）、kuri gohan（栗子饭）。"]}
{"word":"kurikata","summary":{"en":"“kurikata” is not an English vocabulary word; it’s likely a romanized term (often Japanese) and needs context to define precisely.","zh":"“kurikata”不是英语词汇；更可能是（常见为日语的）罗马字拼写，需要上下文才能准确释义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a romanized (Latin-letter) spelling from another language (often Japanese). Without context, the exact meaning is unclear.","zh":"这不是标准英语单词。它更可能是其他语言（常见为日语）的罗马字拼写；缺少上下文时很难确定确切含义。"},"examples":[{"en":"I saw the word “kurikata” in a comment, but it doesn’t appear in English dictionaries.","zh":"我在评论里看到“kurikata”，但它不在英语词典里。"},{"en":"If “kurikata” is Japanese romaji, please share the original characters (kanji/kana) so I can define it accurately.","zh":"如果“kurikata”是日语罗马字，请提供原来的汉字/假名，这样我才能准确解释。"}]}],"phonetic":"/ˌkʊriˈkɑtə/","extraExplanation":["在日语里，-kata（〜方）常见于表示“方法/做法/方式”（例如：tsukurikata=做法、使い方=用法）。因此“kurikata”看起来像“某种做法/方式”的罗马字，但“kuri-”对应的具体词根很多，可能指“重复/绕/卷/整理”等，必须看上下文或原文（汉字/假名）才能确定。","如果你是在某个句子里看到的，请把整句贴出来（或告诉我语言/领域：比如料理、手工、武术、游戏等），我可以给出最贴近的释义与用法。"]}
{"word":"kurilian","summary":{"en":"Kurilian means ‘of or from the Kuril Islands’ and can be used as an adjective or a noun.","zh":"Kurilian 表示“与千岛群岛有关/来自千岛群岛”，既可作形容词也可作名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Kuril Islands (a chain of islands between northeastern Japan and Russia).","zh":"与千岛群岛（位于日本东北与俄罗斯之间的一串岛屿）有关的；千岛的。"},"examples":[{"en":"Kurilian landscapes are known for volcanoes and hot springs.","zh":"千岛（Kurilian）的地貌以火山和温泉闻名。"},{"en":"The researchers studied Kurilian seabird colonies.","zh":"研究人员研究了千岛（Kurilian）的海鸟群落。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Kuril Islands, or something (such as an animal or plant) from that region.","zh":"千岛群岛的人；或指产自/分布于千岛地区的动植物等事物。"},"examples":[{"en":"Kurilians have long relied on fishing and coastal resources.","zh":"千岛居民（Kurilians）长期依靠捕鱼和海岸资源生活。"},{"en":"The museum displayed Kurilian artifacts and photographs.","zh":"博物馆展出了千岛地区的文物和照片。"}]}],"synonyms":["Kuril","Kurile (variant)"],"phonetic":"/kjuˈrɪliən/","extraExplanation":["“Kurilian”来自“Kuril (Islands)”（千岛群岛）的地名形容词形式，常见于地理、历史、生态与自然科学写作中（如“Kurilian fox / Kurilian flora”表示千岛地区的狐狸/植物群）。","千岛群岛在历史与国际关系中也常被提及：部分岛屿的主权问题长期存在争议，因此在新闻或学术文本里你可能会看到“Kurilian issue / dispute”（千岛问题/争端）等搭配。"]}
{"word":"kurku","summary":{"en":"“kurku” isn’t recognized as an English word; please share context or intended meaning.","zh":"“kurku”不属于常见英语词；请提供语境或你想表达的意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、网名/人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “kurku” in an English dictionary—did you mean “kirk,” “kooky,” or something else?","zh":"我在英语词典里找不到“kurku”——你是想写“kirk”“kooky”，还是别的词？"},{"en":"If “Kurku” is a name, please tell me the context (sentence or topic) so I can help.","zh":"如果“Kurku”是名字，请告诉我它出现的语境（句子或话题），我才能更准确地帮你。"}]}],"phonetic":"/ˈkʊrkuː/","extraExplanation":["“kurku”可能来自其他语言（例如土耳其语/库尔德语等的转写形式），也可能只是打字时多/少输入了字母。把它放进一句完整的话里，或告诉我你想表达的中文意思，我可以帮你找到最接近的英文单词/短语。"]}
{"word":"kurmburra","summary":{"en":"Kurumburra: a town in Victoria, Australia.","zh":"Kurumburra：澳大利亚维多利亚州的一座小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small town in Victoria, Australia (South Gippsland), known as a rural service center and a stop on the South Gippsland railway line (historically) and nearby tourist routes.","zh":"澳大利亚维多利亚州（南吉普斯兰）的一座小镇，以乡村服务中心著称，历史上与南吉普斯兰铁路有关，也常作为前往周边景点的途经地。"},"examples":[{"en":"We stopped in Kurumburra for coffee on the way to Wilsons Promontory.","zh":"我们去威尔逊岬国家公园的路上，在库伦伯拉停下来喝了杯咖啡。"},{"en":"Kurumburra is in the South Gippsland region of Victoria.","zh":"库伦伯拉位于维多利亚州的南吉普斯兰地区。"}]}],"phonetic":"/kəˈrʌmbərə/","extraExplanation":["“Kurumburra”是专有名词，通常不翻译，只做音译（如“库伦伯拉”）。在英语里它更常见于地名语境：地址、旅行路线、新闻、地图等。","该地名一般被认为源自澳大利亚原住民语言（各地记录不一），很多维州地名都有类似背景。写作时常首字母大写：Kurumburra。"]}
{"word":"kurmi","summary":{"en":"Kurmi usually refers to a South Asian community traditionally linked with farming, and it can also be used as a surname.","zh":"Kurmi通常指与农耕传统相关的南亚社群，也可用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Kurmi community (a traditional farming/agricultural caste or social group) found mainly in northern and central India and Nepal","zh":"库尔米人；库尔米社群成员（主要分布在印度北部、中部及尼泊尔的传统农业/农耕社群）"},"examples":[{"en":"Many Kurmi families have traditionally worked in agriculture.","zh":"许多库尔米家庭传统上从事农业。"},{"en":"In this region, Kurmi communities are an important part of local village life.","zh":"在这个地区，库尔米社群是当地乡村生活的重要组成部分。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname or community identifier used by some people, especially in South Asia","zh":"（尤指南亚）姓氏或社群标识（一些人用来表明家族/社群身份）"},"examples":[{"en":"Her last name is Kurmi, which reflects her family’s community background.","zh":"她的姓是Kurmi，这体现了她家庭的社群背景。"}]}],"synonyms":["Kurmi community","Kurmi caste","Kurmi surname"],"phonetic":"ˈkʊrmi","extraExplanation":["“Kurmi”常见于英语新闻、历史或社会学语境中，通常作为专有名词（族群/社群名称或姓氏）使用。不同地区对其社会身份的理解可能不同，涉及印度复杂的种姓与社群结构；在正式写作中，建议使用中性、尊重的表述，并尽量根据当事人自我认同来描述。"]}
{"word":"kurn","summary":{"en":"“Kurn” isn’t a standard English word; it’s usually a misspelling of “kern” or a name.","zh":"“kurn”不是标准英语词；通常是“kern”的拼写错误或用作名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly seen as a misspelling of “kern” or as a name (surname/place/company).","zh":"不是标准英语单词；最常见是把“kern”拼错了，或作为名字（姓氏/地名/公司名）出现。"},"examples":[{"en":"I couldn’t find “kurn” in the dictionary—did you mean “kern”?","zh":"我在词典里找不到“kurn”——你是不是想写“kern”？"},{"en":"Kurn is a family name in some countries.","zh":"Kurn 在一些国家可以作为姓氏。"}]},{"partOfSpeech":"n.","definition":{"en":"If you meant “kern”: the central or essential part of something; also a single grain/seed (especially a kernel of corn).","zh":"如果你想写的是“kern”：某物的核心/要点；也可指一粒谷物/种子（尤其指玉米粒等）。"},"examples":[{"en":"The kern of his argument is that time is limited.","zh":"他论点的核心是时间有限。"},{"en":"A kern of corn got stuck in my teeth.","zh":"一粒玉米卡在我牙缝里了。"}]},{"partOfSpeech":"v.","definition":{"en":"If you meant “kern” (typography): to adjust spacing between specific pairs of letters (e.g., “A” and “V”) to make text look better.","zh":"如果你想写的是“kern”（排版术语）：调整特定字母组合之间的间距（如 A 和 V），让文字更美观。"},"examples":[{"en":"Please kern the title so the letters don’t look too far apart.","zh":"请把标题的字距调整一下，别让字母看起来离得太开。"},{"en":"This font needs better kerning in all-caps.","zh":"这个字体在全大写时需要更好的字距调整。"}]}],"synonyms":["core","essence","kernel"],"phonetic":"/kɝn/","extraExplanation":["“kurn”本身在英语里不常作为词汇使用；更常见的相关词是“kern/ kernel”。“kernel”在日常英语里更常用，意思是“核心；谷粒/果仁”。","排版里“kerning（字距调整）”非常常见；动词是“to kern”，名词更常见说法是“kerning”。"]}
{"word":"kuroshio","summary":{"en":"Kuroshio is a major warm current flowing north past Taiwan and Japan in the western Pacific.","zh":"Kuroshio 指西太平洋沿台湾与日本向北流动的一股重要暖流（黑潮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warm, strong ocean current in the western Pacific Ocean that flows northward past Taiwan and Japan; also called the Kuroshio Current or Japan Current","zh":"（西太平洋的）黑潮；一股强暖流，沿台湾东侧向北流经日本附近（也称“黑潮暖流/日本暖流”）"},"examples":[{"en":"The Kuroshio brings warm water and helps shape Japan’s coastal climate.","zh":"黑潮带来温暖海水，并影响日本沿海的气候。"},{"en":"Fisheries near Japan are strongly affected by the Kuroshio Current.","zh":"日本附近的渔业受黑潮暖流影响很大。"}]}],"synonyms":["Kuroshio Current","Japan Current","Black Current"],"phonetic":"/ˌkʊrəˈʃiːoʊ/","extraExplanation":["“Kuroshio（黒潮）”在日语里直译是“黑色的潮流/黑潮”，名字来自其海水颜色较深、流速快、带状明显的外观印象。","黑潮常被拿来类比“大西洋湾流（Gulf Stream）”：两者都是重要的暖流，会调节沿岸气候，并影响鱼群迁移、海洋生态与航行路线。"]}
{"word":"kurrajong","summary":{"en":"Kurrajong is an Australian tree name (especially Brachychiton populneus) and is also used as a place name in Australia.","zh":"Kurrajong 常指一种澳大利亚本土树（尤指Brachychiton populneus），也可用作澳大利亚的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of Australian tree (especially Brachychiton populneus) with bell-shaped flowers; its bark was traditionally used for fiber","zh":"一种澳大利亚树木（尤指瓶树属的“kurrajong”，常指Brachychiton populneus），开钟形花；其树皮传统上可取纤维使用"},"examples":[{"en":"Kurrajong trees are common in many parts of eastern Australia.","zh":"Kurrajong 树在澳大利亚东部许多地区很常见。"},{"en":"The park planted kurrajongs because they handle dry weather well.","zh":"公园种了 kurrajong，因为它们很耐旱。"},{"en":"Historically, kurrajong bark could be processed into strong fiber for rope.","zh":"在过去，kurrajong 的树皮可以加工成结实的纤维，用来做绳子。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in Australia (e.g., Kurrajong, a locality in New South Wales)","zh":"澳大利亚的地名（例如新南威尔士州的 Kurrajong 地区）"},"examples":[{"en":"They drove out to Kurrajong for the weekend.","zh":"他们周末开车去了 Kurrajong。"}]}],"synonyms":["Brachychiton populneus","bottle tree (informal)"],"phonetic":"/ˈkʌrəˌdʒɔŋ/","extraExplanation":["“kurrajong”一词源自澳大利亚原住民语言（不同地区拼写与指代可能略有差异），后来进入澳大利亚英语，常用来指一种常见的本土树（尤其是Brachychiton populneus）。","在澳大利亚语境里，kurrajong 常与耐旱、观赏与本土植物恢复相关；有时也会被泛指同属或相近外观的“瓶树/火焰树”类树木，但在植物学上并不总是同一种。"]}
{"word":"kursaal","summary":{"en":"A “Kursaal” is a grand entertainment hall/complex in a European spa resort, often linked with concerts, social events, and sometimes gambling.","zh":"“Kursaal”指欧洲疗养或温泉度假地的豪华娱乐场馆/综合体，常用于音乐会、社交活动，有时也与赌博（赌场）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large public building or complex in a European spa town, traditionally used for concerts, dancing, social events, and often gambling (like a casino).","zh":"（欧洲温泉/疗养城镇的）库尔萨尔大楼；通常是大型公共娱乐场所，用于音乐会、舞会、社交活动，且常设赌场等。"},"examples":[{"en":"They spent the evening listening to live music at the Kursaal.","zh":"他们晚上在库尔萨尔听现场音乐。"},{"en":"In many seaside resorts, the Kursaal became the center of entertainment and social life.","zh":"在许多海滨度假地，库尔萨尔曾是娱乐与社交生活的中心。"}]}],"synonyms":["spa casino","spa hall","resort entertainment hall","assembly rooms"],"phonetic":"/kʊrˈsɑl/","extraExplanation":["词源来自德语：Kur（疗养、温泉治疗）+ Saal（大厅）。因此它最初指“疗养城镇里的社交大厅”。","Kursaal 常见于19世纪到20世纪初欧洲温泉/海滨度假文化中：人们白天“疗养”“散步”，晚上到 Kursaal 听乐队、跳舞、看演出，部分地方也会设赌场。","这是一个带有地域与时代色彩的词：在英语语境里多用于指某些具体建筑（例如某地著名的 Kursaal），或在旅行/历史文本中出现。"]}
{"word":"kursch","summary":{"en":"“Kursch” isn’t recognized as a standard English word; it’s likely a name or a misspelling (often of “Kirsch”).","zh":"“kursch”不是常见英语词；多半是人名或拼写错误（常见对应为“Kirsch”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling, a surname, or a word from another language.","zh":"不是标准英语单词；更可能是拼写错误、人名（姓氏），或来自其他语言的词。"},"examples":[{"en":"I can’t find “kursch” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里查不到“kursch”——你能把看到它的句子发我吗？"},{"en":"If you meant “Kirsch,” it refers to a cherry brandy used in cooking.","zh":"如果你想写的是“Kirsch”，它指一种樱桃白兰地，常用于烹饪。"}]}],"phonetic":"/kɝʃ/","extraExplanation":["“kursch”看起来像是外来词或拼写变体。最常见的相近词包括：\n1) **Kirsch**：英语里常见，指樱桃白兰地（也用于甜点/火锅芝士等菜谱）；\n2) 可能是德语/东欧语言的姓氏或地名的拼写；\n\n如果你告诉我它出现的**语境**（一句话/网页链接/是否为人名），我可以更准确判断并给出对应释义与用法。"]}
{"word":"kurt","summary":{"en":"Kurt means brief and blunt, often sounding rude or unfriendly.","zh":"kurt 指“简短生硬”，常带有不礼貌或不友善的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Brief and direct in a way that can sound rude or unfriendly.","zh":"（说话/态度）简短生硬的，显得不耐烦或不友善的。"},"examples":[{"en":"Her reply was so kurt that I thought she was angry.","zh":"她的回复非常生硬，我还以为她生气了。"},{"en":"He gave a kurt nod and walked away.","zh":"他冷淡地点了点头就走开了。"},{"en":"Try not to sound kurt in emails, even when you’re busy.","zh":"即使很忙，发邮件也尽量别显得生硬。"}]}],"synonyms":["blunt","brusque","curt","terse","abrupt"],"phonetic":"/kɝt/","extraExplanation":["“kurt”常用来形容语气或回答“短、硬、带点不耐烦”，比单纯的“brief（简短）”更负面；也常与“tone（语气）/reply（回复）/manner（态度）”搭配。"]}
{"word":"kurta","summary":{"en":"A kurta is a traditional long tunic worn in South Asia, often for everyday wear or special celebrations.","zh":"Kurta 指南亚地区常见的传统长上衣/长衫，可日常穿着，也常用于节庆或庆典。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, loose tunic worn in South Asia, often by both men and women; it is usually worn with pants (like pajama or churidar) or a skirt, and may be plain for daily wear or richly decorated for festivals and weddings.","zh":"（南亚常见的）库尔塔长衫/长上衣；一种宽松的长款上衣，男女皆可穿，常搭配长裤（如 pajama、churidar）或裙装，日常可素雅，节庆婚礼可华丽装饰。"},"examples":[{"en":"He wore a white kurta and pajama to the family celebration.","zh":"他穿着白色的库尔塔长衫和宽松长裤参加家庭庆祝活动。"},{"en":"Many people choose a colorful kurta for Diwali.","zh":"很多人会在排灯节选择色彩鲜艳的库尔塔长衫。"},{"en":"The kurta was embroidered with gold thread for the wedding.","zh":"这件库尔塔长衫用金线绣花，专为婚礼准备。"}]}],"synonyms":["tunic","traditional South Asian tunic"],"phonetic":"/ˈkʊr.tə/","extraExplanation":["“Kurta”一词在英语中多用来指印度、巴基斯坦、孟加拉等地的传统上衣。它不完全等同于“shirt（衬衫）”或“robe（长袍）”：kurta 通常是直身或略宽松、长度到大腿或膝部，领口样式多样（如立领/圆领/开襟）。","在西方语境里，kurta 常出现在“cultural/traditional clothing（传统服饰）”“festival attire（节庆服装）”等话题中。描述时可搭配：cotton/silk kurta（棉/丝质）、embroidered kurta（刺绣款）、kurta set（成套搭配）。"]}
{"word":"kurtas","summary":{"en":"“Kurtas” means more than one kurta—traditional South Asian long, loose shirts/tunics.","zh":"“kurtas”是“kurta”的复数，指多件南亚传统的宽松长衫/长上衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “kurta”: loose, long shirts/tunics traditionally worn in South Asia (e.g., India, Pakistan, Bangladesh), by people of any gender.","zh":"“kurta”的复数：南亚（如印度、巴基斯坦、孟加拉等）常见的传统长衫/宽松长上衣（男女皆可穿）。"},"examples":[{"en":"Many guests wore kurtas to the wedding ceremony.","zh":"很多宾客在婚礼仪式上穿了库尔塔长衫。"},{"en":"The store sells cotton kurtas for summer and heavier ones for winter.","zh":"这家店卖适合夏天的棉质库尔塔，也有更厚的冬款。"},{"en":"He paired his kurta with simple sandals.","zh":"他把库尔塔搭配了简约的凉鞋。"}]}],"synonyms":["tunic","traditional long shirt"],"phonetic":"/ˈkʊrtə/","extraExplanation":["“Kurta”常被视为一种“tunic（长上衣）”，但在南亚语境里更具体：通常是直筒、宽松、长度到大腿或膝盖附近的上衣，常见搭配包括“shalwar”（宽松裤）或“pajama/pajamas”（长裤），也可能搭配“churidar”（紧口裤）。","在正式或节庆场合（如Eid、Diwali、婚礼）会出现更精致的面料与刺绣款式；日常也有朴素的棉质款。英语中既可写作“kurta / kurtas”，也常见“kurti”（更短或更偏女性款的版本，具体因地区而异）。"]}
{"word":"kurtosis","summary":{"en":"Kurtosis is a statistical measure describing how heavy a distribution’s tails are (how likely it is to produce extreme values), often compared with the normal distribution.","zh":"kurtosis（峰度）是统计指标，用来描述分布尾部有多重、出现极端值的倾向，常与正态分布作比较。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Statistics) A measure of how heavy the tails of a probability distribution are (how many extreme values it tends to produce), often discussed along with how “peaked” the distribution looks compared with a normal distribution.","zh":"（统计学）峰度：衡量一个概率分布“尾部有多重”（出现极端值的倾向有多强）的指标，也常被用来描述分布相对正态分布的“尖峭程度”。"},"examples":[{"en":"The stock returns showed high kurtosis, meaning extreme gains or losses happened more often than a normal distribution would predict.","zh":"这只股票的收益率峰度很高，意味着出现极端涨跌的频率比正态分布预测的更高。"},{"en":"When kurtosis is low, the data tend to have fewer outliers and lighter tails.","zh":"当峰度较低时，数据往往离群值更少、尾部更轻。"},{"en":"We compared the kurtosis of two datasets to see which one had more extreme values.","zh":"我们比较了两组数据的峰度，看看哪一组更容易出现极端值。"}]}],"synonyms":["tail heaviness","peakedness","tailedness"],"phonetic":"/kɝˈtoʊsɪs/","extraExplanation":["在很多教材里，正态分布的峰度（kurtosis）为 3；为了更方便比较，人们常用“超额峰度”（excess kurtosis）= 峰度 − 3。超额峰度 > 0 常被称为“尖峰厚尾”（更容易出现极端值），< 0 常被称为“平峰薄尾”。","“峰度”常被误解成只看“峰有多尖”。更学习者友好的理解是：它主要反映尾部厚度与极端值出现的倾向；尖不尖往往是伴随现象。"]}
{"word":"kurtosises","summary":{"en":"Kurtosis is a statistical measure describing how heavy a distribution’s tails (and how concentrated values are near the center) are compared with a normal distribution.","zh":"峰度是统计学指标，用来描述一个分布相对正态分布尾部有多“重”、中心有多集中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Statistics) A measure of how much a distribution’s data are concentrated in the tails and near the center, compared with a normal distribution (often discussed as “peakedness” or “tailedness”).","zh":"（统计学）峰度：衡量一个分布相对正态分布在中心与尾部聚集程度的指标（常被通俗地说成“尖不尖”“尾巴重不重”）。"},"examples":[{"en":"The dataset has high kurtosis, meaning it has more extreme outliers than a normal distribution.","zh":"这组数据峰度较高，意味着相比正态分布会出现更多极端离群值。"},{"en":"When analyzing risk, analysts often look at skewness and kurtosis together.","zh":"做风险分析时，分析师常把偏度和峰度一起看。"}]}],"synonyms":["tailedness (informal)","peakedness (informal)"],"phonetic":"/kɝˈtoʊsɪs/","extraExplanation":["你输入的“kurtosises”更常见的标准复数拼写是 **kurtoses**（对应单数 **kurtosis**）。在统计写作中，也有人直接说“values of kurtosis”（峰度的数值）。","在很多教材里会用 **excess kurtosis（超额峰度）**：把正态分布的峰度作为基准（常设为 0），用来更直观地比较“尾部是否更重”。"]}
{"word":"kuru","summary":{"en":"Kuru is a rare, fatal prion brain disease historically found in Papua New Guinea.","zh":"库鲁病是一种罕见且致命的朊病毒性脑病，历史上主要见于巴布亚新几内亚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, fatal brain disease caused by prions (misfolded proteins), historically found among the Fore people of Papua New Guinea; it leads to tremors, loss of coordination, and progressive neurological decline.","zh":"一种罕见且致命的朊病毒（错误折叠蛋白）引起的脑部疾病，历史上主要见于巴布亚新几内亚的福雷人群体；会导致颤抖、协调能力丧失及进行性神经系统衰退。"},"examples":[{"en":"Kuru is classified as a prion disease, like Creutzfeldt–Jakob disease (CJD).","zh":"库鲁病被归类为朊病毒疾病，类似克雅氏病（CJD）。"},{"en":"Scientists studied kuru to better understand how prions spread in the nervous system.","zh":"科学家研究库鲁病，以更好理解朊病毒如何在神经系统中传播。"},{"en":"After certain funeral practices ended, kuru cases declined sharply.","zh":"在某些葬礼相关习俗停止后，库鲁病病例大幅下降。"}]}],"synonyms":["prion disease","transmissible spongiform encephalopathy (TSE)"],"phonetic":"/ˈkʊruː/","extraExplanation":["“kuru”一词源自当地语言，常被解释为“颤抖/发抖”，呼应该病典型症状（如震颤与步态不稳）。","库鲁病之所以在医学史上重要，是因为它帮助人们认识到“朊病毒”这一特殊致病机制；相关研究推动了对其他朊病毒病（如CJD、疯牛病）的理解。","在文化语境中，库鲁病与特定地区过去的丧葬仪式有关。现代资料在提及这段历史时，通常会强调尊重当地文化与避免污名化。"]}
{"word":"kuruba","summary":{"en":"Kuruba refers to a community/ethnic group in South India (especially Karnataka), and it can also refer to their speech variety.","zh":"Kuruba 指南印度（尤以卡纳塔克邦）的一支社群/族群，也可指与该社群相关的语言（或方言）变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Kuruba community, a traditionally pastoral (shepherding) group found mainly in the Indian state of Karnataka and nearby regions","zh":"库鲁巴人：库鲁巴社群的成员；该群体传统上以放牧（牧羊等）为生，主要分布在印度卡纳塔克邦及其周边地区"},"examples":[{"en":"The festival included dances performed by Kuruba communities from different villages.","zh":"节庆活动中有来自不同村庄的库鲁巴社群表演舞蹈。"},{"en":"Some Kuruba families still keep sheep and goats, though many now work in towns.","zh":"一些库鲁巴家庭仍然饲养绵羊和山羊，不过也有许多人如今在城镇工作。"}]},{"partOfSpeech":"n.","definition":{"en":"the variety of speech associated with Kuruba people (sometimes discussed as a dialect or as part of closely related languages in South India)","zh":"库鲁巴人的语言/方言：与南印度一些相近语言密切相关的口语变体（在不同语境中有时被视为方言或语言的一部分）"},"examples":[{"en":"She can understand Kuruba as well as Kannada.","zh":"她既能听懂库鲁巴语，也能听懂卡纳达语。"},{"en":"Researchers recorded traditional songs in Kuruba to preserve local oral history.","zh":"研究者用库鲁巴语记录传统歌曲，以保存当地口述历史。"}]}],"synonyms":["Kurubas","Kurumba (related term; not always identical)"],"phonetic":"/kʊˈruːbə/","extraExplanation":["“Kuruba”通常是族群/社群名称，在英文写作中多作专有名词使用，首字母常大写（Kuruba）。在描述族群身份时，语气应保持尊重、避免将其简单等同于刻板印象（例如只用“shepherd caste”来概括全部生活方式）。","在南印度语境里，族群名称、社群身份与语言名称有时会重叠；不同学术或政府资料对“Kuruba”作为语言/方言的划分可能不完全一致。"]}
{"word":"kurukh","summary":{"en":"Kurukh is a Dravidian language (also called Kurux/Oraon) spoken mainly by the Oraon people in India.","zh":"Kurukh（库鲁克语）是一种达罗毗荼语系语言，也称 Kurux / Oraon，主要由印度的奥拉翁人使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Dravidian language spoken mainly by the Oraon (also called Kurukh) people in eastern and central India, and in parts of Bangladesh and Nepal.","zh":"库鲁克语：一种达罗毗荼语系语言，主要由印度东部与中部的奥拉翁人（也称库鲁克人）使用，在孟加拉国和尼泊尔部分地区也有人使用。"},"examples":[{"en":"She is learning Kurukh to speak with her grandparents.","zh":"她正在学习库鲁克语，好跟祖父母交流。"},{"en":"The Kurukh language is also known as Kurux or Oraon.","zh":"库鲁克语也被称为 Kurux（库鲁克）或 Oraon（奥拉翁语）。"}]}],"synonyms":["Kurux","Oraon"],"phonetic":"/kʊˈrʊk/","extraExplanation":["“Kurukh”多用于指语言与族群名称；英语里更常见的拼写之一是“Kurux”。在学术或新闻语境中，你可能会看到“Kurukh/Kurux (Oraon)”并列出现，以避免混淆。","库鲁克语属于达罗毗荼语系（同语系还有泰米尔语、泰卢固语等），但地理上主要分布在印度的贾坎德邦、恰蒂斯加尔邦、奥里萨邦、西孟加拉邦等地。","写法上，现实使用中常用天城文（Devanagari）或地方文字记录；不同地区/出版物的拼写与转写方式可能不完全一致。"]}
{"word":"kuruma","summary":{"en":"Kuruma is a Japanese word meaning “car/vehicle,” and in food contexts it may refer to kuruma ebi, a type of prawn used in sushi.","zh":"Kuruma 源自日语，常指“汽车/车辆”；在饮食语境中也可能指 kuruma ebi（车海老），一种常用于寿司的对虾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Japanese) a car; a vehicle (literally “wheel”).","zh":"（源自日语）汽车；车辆（字面义与“轮子”相关）。"},"examples":[{"en":"In Japanese, kuruma means “car.”","zh":"在日语里，kuruma 的意思是“汽车”。"},{"en":"I don’t have a kuruma, so I take the train to work.","zh":"我没有车，所以我坐火车去上班。"}]},{"partOfSpeech":"n.","definition":{"en":"in Japanese cuisine: kuruma ebi, a large prawn often served as sushi (commonly translated as “kuruma prawn/shrimp”).","zh":"（日本料理）指 kuruma ebi（车海老），一种常用于寿司的大型对虾（常译“车虾/斑节虾”）。"},"examples":[{"en":"The sushi set included kuruma ebi and tuna.","zh":"这份寿司套餐里有车虾和金枪鱼。"},{"en":"Kuruma ebi is often lightly cooked before being served.","zh":"车虾常常会先稍微加热处理再端上桌。"}]}],"synonyms":["car","vehicle","automobile","kuruma ebi (food context)","prawn (food context)"],"phonetic":"/kuːˈruːmə/","extraExplanation":["「くるま（kuruma）」通常写作汉字「車」。在日语里它既可以泛指“车/车辆”，也会在口语中用来特指“汽车”。更正式或更明确指汽车时，也常见「自動車（jidōsha）」。","在英语语境中，kuruma 作为外来词并不常用；更多出现在日本料理菜单（如「kuruma ebi」）或日本文化语境里。点餐时说 “kuruma ebi” 比单说 “kuruma” 更自然。"]}
{"word":"kurumaya","summary":{"en":"Kurumaya is a Japanese term meaning “car shop,” often used as a business name in English contexts.","zh":"Kurumaya 是日语词，意为“车行/汽车店”，在英语中多见于店名或品牌名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Japanese word meaning “car shop” or “car dealer” (literally “vehicle shop”); in English it is most often seen as part of a business name (e.g., a restaurant, ramen shop, or dealership).","zh":"日语词，意为“汽车店／车行”（字面为“车的店”）；在英语语境中多作为店名或品牌名出现（例如拉面店、餐馆或车商）。"},"examples":[{"en":"Let’s meet at Kurumaya Ramen after work.","zh":"下班后我们去“车屋拉面（Kurumaya Ramen）”见。"},{"en":"Kurumaya is a common kind of shop name in Japan, so you may see it on signs.","zh":"“Kurumaya”在日本是常见的店名类型，所以你可能会在招牌上看到。"}]}],"synonyms":["car shop","car dealer","auto shop"],"phonetic":"/ˌkʊruːˈmɑːjə/","extraExplanation":["“Kurumaya”通常来自日语「車屋」（くるまや）：車=车／车辆，屋=店铺（也可理解为“某某店/某某商号”）。因此它不一定指某一家特定店，而是一种很常见的命名方式。","在英语文本里，它常被当作专有名词使用（首字母大写），发音也可能因地区或店家英文标注而略有差异。","相关表达：自転車屋（jitensha-ya，自行车店）、花屋（hana-ya，花店）、本屋（hon-ya，书店）。"]}
{"word":"kurumba","summary":{"en":"Kurumba most commonly refers to an Indigenous community in southern India, and it can also refer to their language or be used as a proper name (e.g., a resort).","zh":"Kurumba 通常指印度南部的库鲁姆巴原住民族群；也可指其语言，或作为专有名称（如度假村名）使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Kurumba, an Indigenous (Adivasi) community mainly found in the Nilgiri Hills and nearby areas of southern India (especially Tamil Nadu, also parts of Kerala and Karnataka)","zh":"库鲁姆巴人：印度南部（以泰米尔纳德邦尼尔吉里山区为主，亦见于喀拉拉邦、卡纳塔克邦等地）的原住民／阿迪瓦西族群成员"},"examples":[{"en":"The Kurumba communities of the Nilgiris have their own distinct traditions and local knowledge.","zh":"尼尔吉里山区的库鲁姆巴社群拥有独特的传统与在地知识。"},{"en":"A museum exhibit introduced visitors to Kurumba crafts and daily life.","zh":"博物馆展览向访客介绍了库鲁姆巴人的手工艺与日常生活。"}]},{"partOfSpeech":"n.","definition":{"en":"the Kurumba language (or languages/dialects) spoken by some Kurumba communities in southern India","zh":"库鲁姆巴语：印度南部部分库鲁姆巴社群使用的语言（或多种方言/语言变体）"},"examples":[{"en":"She can speak Kurumba and Tamil.","zh":"她会说库鲁姆巴语和泰米尔语。"},{"en":"Researchers recorded folktales in Kurumba to help preserve the language.","zh":"研究者用库鲁姆巴语记录民间故事，以帮助保存这门语言。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used for places and businesses (for example, “Kurumba” is the name of a well-known resort in the Maldives)","zh":"专有名词：用于地名或商业名称（例如“Kurumba”也是马尔代夫一家知名度假村的名称）"},"examples":[{"en":"They booked a few nights at Kurumba in the Maldives.","zh":"他们在马尔代夫的 Kurumba 订了住几晚。"}]}],"phonetic":"/kʊˈrʌmbə/","extraExplanation":["“Kurumba”常作为族群名称使用，语境上更接近专有名词；谈论具体社群时，最好结合地点（如 Nilgiris/尼尔吉里）以避免混淆。","在南印度，“Kurumba / Kuruba / Kurubar”等名称在不同语言与地区里可能有关联或被混用，有时与“牧人/放牧群体”的历史称呼有关；如果你指的是特定官方分类或某一支系，建议标明所在邦或当地自称。"]}
{"word":"kurung","summary":{"en":"Kurung (Malay/Indonesian) usually means “to confine/enclose,” and it can also refer to a cage/enclosure or, in cultural context, the traditional outfit “(baju) kurung.”","zh":"Kurung（马来语/印尼语）常指“关住、圈住”，也可指笼子/围栏；在文化语境中还可指传统服饰“（baju）kurung”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to confine or keep someone/something enclosed (used in Malay/Indonesian); to shut in, lock up, or pen in","zh":"（马来语/印尼语）把……关起来、圈住；禁闭、囚禁"},"examples":[{"en":"The animals were kurung in a small pen overnight.","zh":"这些动物被圈在一个小围栏里过夜。"},{"en":"He felt like he was being kurung at home with nothing to do.","zh":"他觉得自己被“关”在家里，无事可做。"}]},{"partOfSpeech":"n.","definition":{"en":"a cage or enclosure; a place where something is kept shut in (less common as a standalone noun in English writing)","zh":"笼子、围栏；关押/圈住的地方（作为名词在英语中较少单独使用）"},"examples":[{"en":"The bird was kept in a kurung.","zh":"那只鸟被养在笼子里。"}]},{"partOfSpeech":"n.","definition":{"en":"short for “baju kurung,” a traditional Malay women’s outfit (a long tunic worn over a skirt)","zh":"“baju kurung”的简称：马来传统女装（长上衣配裙/纱笼）"},"examples":[{"en":"She wore a kurung to the wedding ceremony.","zh":"她在婚礼仪式上穿了马来传统服装（kurung）。"},{"en":"Kurung styles can look modern while keeping the classic shape.","zh":"Kurung 的款式可以很现代，但仍保留经典轮廓。"}]}],"synonyms":["confine","enclose","shut in","cage","pen in"],"phonetic":"/kuˈruŋ/","extraExplanation":["“Kurung”来自马来语/印尼语，核心意思与“围住、关住”有关，因此既可作动词（关押、圈住），也可延伸到“围栏/笼子”的含义。","在文化语境里，英语中更常见的是服饰用法“baju kurung”（常被简写为kurung），多见于马来西亚、新加坡、文莱等地的正式场合与节庆。"]}
{"word":"kurus","summary":{"en":"“kurus” is the Turkish subunit of money: 100 kurus = 1 Turkish lira.","zh":"“kurus”指土耳其的辅币单位：100库鲁什=1土耳其里拉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small coin or monetary unit used in Turkey, equal to 1/100 of a Turkish lira (often written in English as the plural “kurus” of Turkish “kuruş”).","zh":"土耳其使用的辅币单位或硬币，相当于1土耳其里拉的1/100（英语里常把土耳其语“kuruş”的复数写作“kurus”）。"},"examples":[{"en":"This snack costs 50 kurus (half a lira).","zh":"这份零食要50库鲁什（半里拉）。"},{"en":"The price went up from 75 kurus to 1 lira.","zh":"价格从75库鲁什涨到了1里拉。"}]}],"synonyms":["kuruş","Turkish cent (informal)"],"phonetic":"/kʊˈruːs/","extraExplanation":["在土耳其语中通常写作“kuruş”（字母ş读作“sh”音），英语资料里有时会省略变音符号而写成“kurus”。因此你可能会在旅游、汇率、商品标价等语境看到它。"]}
{"word":"kurvey","summary":{"en":"“Kurvey” is a nonstandard spelling of “curvy,” meaning “having noticeable curves” (often about a person) or “full of bends” (about roads/lines).","zh":"“kurvey”是“curvy”的非标准拼写，意思是“（常指人）身材有曲线/丰满”或“（指道路、线条等）弯曲的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) the same as “curvy”: having a body shape with smooth, rounded curves (often used about a person’s figure).","zh":"（非标准拼写）同“curvy”：曲线明显的；（常指人的身材）丰满、有曲线的。"},"examples":[{"en":"She describes herself as curvy and confident.","zh":"她形容自己身材有曲线，而且很自信。"},{"en":"The dress looks great on curvy bodies.","zh":"这条裙子很适合曲线型身材。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) having a lot of curves in shape or design; not straight.","zh":"（较少见）形状或设计有很多弧线的；不笔直的。"},"examples":[{"en":"They drove along a curvy mountain road.","zh":"他们沿着一条弯弯曲曲的山路行驶。"},{"en":"A curvy line makes the design feel softer.","zh":"弯曲的线条让设计看起来更柔和。"}]}],"synonyms":["curvy","shapely","rounded","winding","twisty"],"phonetic":"ˈkɝːvi","extraExplanation":["“kurvey”常见于社交媒体或口语里，用K来强调个性/俏皮，但在正式写作中一般用标准拼写“curvy”。","形容人的身材时，“curvy”通常语气偏正面或中性，强调“有曲线”，但在不同文化与语境里可能带有审美判断；更礼貌的做法是尊重对方自称或避免评价他人身材。"]}
{"word":"kurveyor","summary":{"en":"“Kurveyor” is not standard English; it is usually a misspelling of “purveyor,” meaning a supplier/seller or (as a verb) to provide.","zh":"“kurveyor”不是标准英文，通常是“purveyor”的误拼，意为“供应者/销售者”，作动词则指“提供”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Usually intended to mean “purveyor”: a person, company, or shop that supplies or sells particular goods or services, often with a slightly formal tone.","zh":"（非标准拼写）通常想表达的是“purveyor（供应商/销售者）”：指提供或出售某类商品或服务的人、公司或商店，语气略正式。"},"examples":[{"en":"That online store is a purveyor of specialty teas.","zh":"那家网店是特色茶叶的供应商/销售商。"},{"en":"They became a well-known purveyor of luxury travel services.","zh":"他们成了知名的高端旅行服务提供商。"}]},{"partOfSpeech":"vt.","definition":{"en":"(As a verb, “purvey”) To supply or provide, especially food, goods, or information (often in a formal or critical context).","zh":"（作动词 purvey）供应、提供（尤指食物、商品或信息；常带正式或批评语境）。"},"examples":[{"en":"Some websites purvey unreliable health advice.","zh":"一些网站传播/提供不可靠的健康建议。"},{"en":"The company purveys equipment to small hospitals.","zh":"这家公司向小型医院供应设备。"}]}],"synonyms":["supplier","vendor","provider","retailer","distributor"],"phonetic":"/pərˈveɪər/","extraExplanation":["“kurveyor”并不是常见或标准的英文拼写；在一般写作与考试中建议使用“purveyor”。","“purveyor”既可中性表示“供应/销售某类商品的人或机构”，也常用于较严肃的搭配，如“purveyor of misinformation（虚假信息的传播者）”，带批评意味。"]}
{"word":"kusa","summary":{"en":"“Kusa” is a Japanese-derived term meaning “grass,” and online it’s slang for “lol/laughing.”","zh":"“kusa”源自日语，原意是“草”，网络语境中常用来表示“哈哈/笑死”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Japanese) “grass”; used online (especially in anime/gaming communities) as slang for laughter, because repeated “w” (笑 warai, “laugh”) looks like blades of grass.","zh":"（源自日语）“草”。在网络语境（尤其二次元/游戏圈）里也可作“笑”的梗：因为连续的“w”（笑 warai 的缩写）看起来像一片草。"},"examples":[{"en":"In the chat, someone typed “kusa” after a funny clip.","zh":"在聊天室里，有人看完搞笑片段后打了句“kusa”（表示笑）。"},{"en":"The caption says “kusa” — it’s Japanese internet slang for laughing.","zh":"字幕写着“kusa”——这是日语网络里表示“笑”的俚语。"}]},{"partOfSpeech":"other","definition":{"en":"Not a standard English word; a romanized form (rōmaji) of the Japanese word くさ (kusa), meaning “grass” in everyday Japanese.","zh":"并非标准英语词；是日语 くさ（kusa）的罗马字写法，在日常日语里就是“草/草地”。"},"examples":[{"en":"In Japanese, “kusa” literally means “grass.”","zh":"在日语里，“kusa”字面意思就是“草”。"},{"en":"The subtitle uses rōmaji: “kusa” instead of くさ.","zh":"字幕用罗马字写法：用“kusa”代替 くさ。"}]}],"synonyms":["lol","lmao","haha","(JP) warai / w"],"phonetic":"/ˈkuːsɑ/","extraExplanation":["“草=笑”的网络用法常见于日语平台（如弹幕/评论区）。因为“笑”常被简写成“w”，一串“wwwww”像草丛，所以被叫作“草”（kusa）。有时也会写成“大草原”（表示笑得更夸张）。"]}
{"word":"kusam","summary":{"en":"“Kusam” (Indonesian/Malay) means dull or not shiny, and can also describe a gloomy, lifeless look or mood.","zh":"“kusam”（印尼语/马来语）表示“暗淡、无光泽”，也可指“阴沉、无精打采的样子或氛围”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"dull, not shiny or bright; lacking luster (often used for colors, metal, or light).","zh":"暗淡的；无光泽的（常形容颜色、金属或光线）。"},"examples":[{"en":"After months in storage, the silver looked kusam.","zh":"在储存了几个月后，银器看起来很暗淡。"},{"en":"The paint on the wall has become kusam over time.","zh":"墙上的油漆随着时间变得暗淡无光。"}]},{"partOfSpeech":"adj.","definition":{"en":"gloomy or lifeless in mood or appearance; lacking energy.","zh":"阴沉的；无生气的（指情绪或外观缺乏活力）。"},"examples":[{"en":"He gave a kusam smile and said nothing.","zh":"他勉强露出一个无精打采的笑容，什么也没说。"},{"en":"The room felt kusam without sunlight.","zh":"没有阳光的房间显得阴沉。"}]}],"synonyms":["dull","matte","tarnished","gloomy","lifeless"],"phonetic":"/kuˈsɑm/","extraExplanation":["“kusam”主要见于印尼语/马来语，常用来形容“失去光泽、暗淡”，也可引申为“神情黯淡、无精打采”。搭配上常见如：warna kusam（暗淡的颜色）、wajah kusam（黯淡的脸色）。","与英语表达接近的词包括：dull / matte / tarnished（指光泽）、gloomy / lifeless（指气氛或精神状态）。"]}
{"word":"kusan","summary":{"en":"“Kusan” is usually a proper noun (place name or surname), not a common English word.","zh":"“Kusan”通常是专有名词（地名或姓氏），不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (not a common English vocabulary word), used mainly as a place name—especially in Indonesia (e.g., areas named Kusan).","zh":"专有名词（不是常见英语词汇），主要用作地名——尤其见于印度尼西亚（如一些地区名为 Kusan）。"},"examples":[{"en":"Kusan is a region name found in South Kalimantan, Indonesia.","zh":"Kusan 是印度尼西亚南加里曼丹省可见的一个地名。"},{"en":"She traveled through the Kusan area during her fieldwork.","zh":"她在田野调查时经过了 Kusan 地区。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname) in some contexts.","zh":"在某些语境中可作姓氏。"},"examples":[{"en":"Mr. Kusan will join the meeting later.","zh":"Kusan 先生稍后会参加会议。"}]}],"synonyms":["(as a name) no direct synonyms"],"phonetic":"/kuːˈsɑn/","extraExplanation":["“Kusan”在英语里通常不会当作普通词汇使用，更常见的是音译出来的地名或人名。若你原本想查的是英语单词，可能是拼写接近的词，例如：\n- **cousin**（表亲/堂亲）\n- **Kushan**（贵霜；历史上的“贵霜帝国”相关）\n如果你告诉我你看到它的句子或来源（国家/语境），我可以更精准地解释。"]}
{"word":"kusha","summary":{"en":"Kusha most commonly refers to sacred “kusa/kuśa” grass used in Hindu and Buddhist rituals; it can also be a South Asian personal or character name.","zh":"Kusha 最常指印度教与佛教仪式中使用的“kusa/kuśa（库沙）草”；也可作为南亚地区的人名或角色名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hinduism and Buddhism) a type of sacred grass (also spelled “kusa/kuśa” or “darbha”) used in rituals and meditation practice.","zh":"（印度教与佛教中）一种神圣的草（也写作 kusa/kuśa 或 darbha），常用于宗教仪式与禅修等修行。"},"examples":[{"en":"In some traditions, people sit on kusha grass during meditation.","zh":"在一些传统中，人们会坐在 kusha 草上进行禅修。"},{"en":"The priest used kusha grass in the ceremony.","zh":"祭司在仪式中使用了 kusha 草。"}]},{"partOfSpeech":"n.","definition":{"en":"A name in South Asian stories and culture (a personal name or character name).","zh":"南亚文化与故事中使用的名字（人名或角色名）。"},"examples":[{"en":"Kusha is a character name you may see in Indian epics.","zh":"Kusha 是你可能在印度史诗中见到的角色名。"},{"en":"Kusha is also used as a given name today.","zh":"Kusha 现在也会被用作人名。"}]}],"synonyms":["kusa grass","darbha"],"phonetic":"/ˈkuːʃə/","extraExplanation":["“kuśa（库沙）草”来自梵语，在印度宗教语境里常被视为“净化、守护”的象征，因此会出现在祭祀、祈福、结界、禅修坐垫等相关描述中。英文里常见拼写有 kusa / kusha / kuśa。","在印度史诗《罗摩衍那》（Ramayana）中，Kusha（又作 Kuśa）常被当作人物名出现；不同译本的拼写可能不同。"]}
{"word":"kushshu","summary":{"en":"“kushshu” is not recognized as a standard English word; it likely needs context or is a misspelling (possibly of “Kush”).","zh":"“kushshu”不是标准英语词；多半需要语境确认，或是拼写错误（可能想写“Kush”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name/handle, or a romanization from another language.","zh":"不是标准英语单词。可能是拼写错误、昵称/用户名，或是其他语言的音译/转写。"},"examples":[{"en":"I couldn’t find “kushshu” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里查不到“kushshu”——你能提供它出现的句子吗？"},{"en":"If you meant “Kush,” that’s a word used for a type of cannabis (and also the Hindu Kush region).","zh":"如果你想写的是“Kush”，它常指一种大麻品种（也可指兴都库什地区）。"}]}],"phonetic":"/ˈkʊʃuː/","extraExplanation":["“kushshu”看起来像是非英语词（例如人名、网名、拟声词、或外语转写）。如果你告诉我：1) 出现的语境/句子；2) 你想表达的语言（例如日语/韩语/印地语等）；3) 是否可能想写“kush / kushy / kusshu”等近似拼写，我就能更准确地给出释义、发音与用法。"]}
{"word":"kusimanse","summary":{"en":"“kusimanse” is not a recognized English word; it’s likely a name, a foreign word, or a misspelling.","zh":"“kusimanse”不是常见英语单词；更可能是名字、外来词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a proper name, a word from another language, or a misspelling/variant of another term.","zh":"不是标准英语单词。可能是专有名词（人名/地名/品牌名）、其他语言的词，或某个英语词的拼写变体/拼写错误。"},"examples":[{"en":"I couldn’t find “kusimanse” in an English dictionary—where did you see it?","zh":"我在英语词典里查不到“kusimanse”——你是在哪里看到它的？"},{"en":"If you can share the full sentence, I can help guess the intended word.","zh":"如果你能提供完整句子，我可以帮你推测原本想表达的词。"}]}],"phonetic":"/ˌkuːsiˈmænseɪ/","extraExplanation":["目前主流英语词典与常见语料中没有“kusimanse”。它可能是：\n1）人名/地名/昵称/账号名；\n2）某种语言的外来词（例如非洲或南亚语言的音译）；\n3）拼写接近其他词（如某个词被听写/打字打错）。\n\n为了更准确：请你发一下它出现的上下文（整句/截图）、来源（歌曲/聊天/游戏/文章）、以及你想表达的意思或中文对应。"]}
{"word":"kusimansel","summary":{"en":"“kusimansel” is not a recognized English vocabulary word; please provide context or confirm the spelling.","zh":"“kusimansel”不是可识别的英语词汇；请提供上下文或确认拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"这不是标准英语单词；可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “kusimansel” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“kusimansel”；你能提供看到它的句子吗？"},{"en":"If you meant a similar English word, please check the spelling (for example, try typing it the way it appears in the original text).","zh":"如果你想查的是相近的英语词，请再核对拼写（比如按原文里的写法输入）。"}]}],"extraExplanation":["我这边无法把“kusimansel”匹配到常见英语词条。为了帮你准确解释，请你补充：\n1）它出现的句子/上下文（你看到它的地方）；\n2）这是英语、还是其他语言（如印尼语/马来语/人名/地名等）；\n3）是否可能大小写不同或有空格/连字符（如 Kusi Mansel / kusiman sel 等）。\n你也可以发一张包含该词的截图，我可以根据上下文推断含义。"]}
{"word":"kuskite","summary":{"en":"“Kuskite” isn’t recognized as a standard English word; it’s probably a misspelling (often of “exquisite”) or a proper name.","zh":"“kuskite”不是标准英语词；多半是拼写错误（常见可能是“exquisite”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a name/brand. A common intended word (based on similar spelling/sound) is “exquisite.”","zh":"不是标准英语单词；更可能是拼写错误或专有名词/品牌名。根据拼写与发音相近，常见的可能目标词是“exquisite（精美的；精致的）”。"},"examples":[{"en":"I can’t find “kuskite” in standard English dictionaries—could you share a sentence where you saw it?","zh":"我在常见英语词典里找不到“kuskite”——你能把看到它的句子发我吗？"},{"en":"Did you mean “exquisite,” as in “an exquisite painting”?","zh":"你是不是想写“exquisite”，比如“an exquisite painting（精美的画作）”？"}]}],"phonetic":"/ˈkʌsˌkaɪt/","extraExplanation":["“kuskite”很可能不是英语词汇，而是：①拼写误差（常见可能：exquisite）；②人名/地名/产品名；③其他语言的词被直接写进英文文本。","如果你把它出现的上下文（完整句子、来源网站/书名、你想表达的意思）发来，我可以帮你判断最可能的正确拼写与含义，并给出对应用法与例句。"]}
{"word":"kuskos","summary":{"en":"Couscous is a North African semolina food and also the name of dishes made from it.","zh":"Couscous（库斯库斯）是一种北非的粗粒小麦食品，也可指用它做成的料理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North African food made from tiny steamed balls of semolina (wheat), often served with vegetables, meat, or sauce","zh":"一种北非主食，由粗粒小麦粉（杜兰小麦粉）搓成的细小颗粒蒸熟而成，常配蔬菜、肉类或酱汁一起吃"},"examples":[{"en":"We had couscous with roasted vegetables for dinner.","zh":"我们晚餐吃了配烤蔬菜的库斯库斯。"},{"en":"Couscous cooks quickly, so it’s useful for busy weeknights.","zh":"库斯库斯熟得很快，所以很适合忙碌的工作日晚餐。"},{"en":"In the market, she bought spices and couscous.","zh":"她在市场买了香料和库斯库斯。"}]},{"partOfSpeech":"n.","definition":{"en":"a dish made with couscous (the grain) plus other ingredients","zh":"用库斯库斯（谷物颗粒）加上其他食材做成的一道菜"},"examples":[{"en":"This restaurant’s couscous is served with chickpeas and lamb.","zh":"这家餐厅的库斯库斯会配鹰嘴豆和羊肉一起上。"},{"en":"He brought a cold couscous salad to the picnic.","zh":"他带了一份冷的库斯库斯沙拉去野餐。"}]}],"synonyms":["semolina","grain","couscous salad","couscous dish"],"phonetic":"/ˈkuːsˌkuːs/","extraExplanation":["“kuskos”常被用来指同一种食物的不同拼写/音译；英语里最常见的拼写是 **couscous**。","库斯库斯与摩洛哥、阿尔及利亚、突尼斯等马格里布地区关系很深，常见吃法是搭配炖菜（stew）或做成沙拉。","英文里它通常不可数（some couscous），但也可以说 a couscous dish（一道库斯库斯料理）。"]}
{"word":"kuskus","summary":{"en":"Kuskus is a less common spelling for couscous, a North African semolina dish.","zh":"kuskus是couscous（库斯库斯）的不太常见拼写，指北非常见的粗粒小麦粉蒸制食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of “couscous”: small granules of steamed semolina (wheat), often served as a side dish or mixed with vegetables and meat.","zh":"“couscous”的一种拼写变体：用粗粒小麦粉（杜兰小麦粉）做成并蒸熟的细小颗粒状主食/配菜，常与蔬菜、肉类一起食用。"},"examples":[{"en":"For dinner, we had kuskus with roasted vegetables.","zh":"晚餐我们吃了蔬菜烤盘配库斯库斯（kuskus）。"},{"en":"She brought a salad made with kuskus, chickpeas, and herbs.","zh":"她带来了一道用库斯库斯、鹰嘴豆和香草做的沙拉。"}]}],"synonyms":["couscous"],"phonetic":"/ˈkuːsˌkuːs/","extraExplanation":["“kuskus”更常见于德语、波兰语等语言环境里作为“couscous”的写法；英语中主流拼写是“couscous”。","Couscous 源自北非（马格里布地区）饮食文化；在英语菜单上常见搭配有“couscous salad（库斯库斯沙拉）”“Moroccan couscous（摩洛哥风味库斯库斯）”。"]}
{"word":"kuskwogmiut","summary":{"en":"Kuskwogmiut refers to Yup’ik people associated with the Kuskokwim River region of western Alaska.","zh":"Kuskwogmiut 指与阿拉斯加西部库斯科奎姆河流域相关的尤皮克人群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of Yup’ik people traditionally associated with the Kuskokwim River region of western Alaska; also used to describe things related to this people or area","zh":"库斯科奎姆河（Kuskokwim River）流域相关的尤皮克人（Yup’ik）群体；也可指与该族群或该地区有关的事物"},"examples":[{"en":"The Kuskwogmiut have lived along the Kuskokwim River for generations.","zh":"库斯科奎姆尤皮克人（Kuskwogmiut）世世代代居住在库斯科奎姆河沿岸。"},{"en":"The museum exhibit includes Kuskwogmiut tools and clothing.","zh":"博物馆展览包括库斯科奎姆尤皮克人的工具和服饰。"}]}],"synonyms":["Kuskokwim Yup'ik","Yup'ik people of the Kuskokwim River"],"phonetic":"/kʊˈskwɔɡ.mi.ut/","extraExplanation":["“Kuskwogmiut”常见于人类学、民族志与阿拉斯加原住民相关资料中，通常指库斯科奎姆河流域的尤皮克人群体。该词属于族群名称（ethnonym），在严肃写作中一般首字母大写（Kuskwogmiut）。","词尾“-miut”在阿拉斯加一些原住民语言的相关转写中常带有“……的人/居民”的含义，所以整体可理解为“库斯科奎姆（地区）的人”。在使用时建议尊重当事社群的自称与拼写习惯，并在学术或公共文本中给出适当背景说明。"]}
{"word":"kussen","summary":{"en":"“kussen” is mainly Dutch/German: it commonly means “to kiss,” and in Dutch it can also mean “pillow/cushion.”","zh":"“kussen”主要是荷兰语/德语用词：常见义为“亲吻”；在荷兰语中也可表示“枕头/靠垫”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Dutch/German) to kiss; to touch someone with your lips as a sign of love, greeting, or affection.","zh":"（荷兰语/德语）亲吻；用嘴唇轻触某人以表达爱意、问候或亲密。"},"examples":[{"en":"In Dutch, “Ik wil je kussen” means “I want to kiss you.”","zh":"在荷兰语里，“Ik wil je kussen”意思是“我想亲你。”"},{"en":"They kissed on the cheek to say hello.","zh":"他们用亲吻脸颊的方式打招呼。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dutch) a cushion or pillow (something soft you rest on or decorate with).","zh":"（荷兰语）靠垫/枕头（柔软的垫子，用来倚靠、睡枕或装饰）。"},"examples":[{"en":"She put a cushion on the sofa.","zh":"她在沙发上放了一个靠垫。"},{"en":"I need a pillow for my neck.","zh":"我需要一个枕头垫脖子。"}]}],"synonyms":["kiss","peck","pillow","cushion"],"phonetic":"/ˈkʊsən/","extraExplanation":["“kussen”不是常见英语单词，多见于荷兰语与德语语境。荷兰语里它既可以是动词“亲吻”，也可以是名词“靠垫/枕头”，需要根据句子判断。","德语中动词原形是“küssen”（带变音符号 ü）；不带变音符号写成“kussen”有时是输入法/拼写替代，正式写法仍是“küssen”。"]}
{"word":"kusso","summary":{"en":"Kusso is a traditional Ethiopian herbal medicine, historically used to treat tapeworm.","zh":"Kusso 是一种源自埃塞俄比亚的传统草药（药粉），历史上用于驱除绦虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicinal powder made from the dried flowers of an Ethiopian tree (Hagenia abyssinica), traditionally used to treat tapeworm infections","zh":"（药用名词）由埃塞俄比亚一种树（Hagenia abyssinica，常译作“阿比西尼亚海桐/海桐属植物”）的干花制成的药粉，传统上用于驱除绦虫"},"examples":[{"en":"In older medical texts, kusso is described as a traditional remedy for tapeworm.","zh":"在较早的医学文献中，kusso 被描述为一种传统的绦虫治疗药物。"},{"en":"The traveler wrote that local healers prepared kusso from dried flowers.","zh":"那位旅行者写道，当地的治疗者会用干花配制 kusso。"}]}],"synonyms":["koso"],"phonetic":"/ˈkʊsoʊ/","extraExplanation":["Kusso 属于比较少见、偏历史/民族植物药语境的词，在现代英语中多见于旧式医学资料、植物百科或民族药研究。","它也常被写作 koso（拼写变体），阅读资料时可以留意同义拼写。","由于涉及传统驱虫用途，现实生活中不要自行使用或替代正规医疗；更多是用于理解历史文本或学术语境。"]}
{"word":"kussos","summary":{"en":"“Kussos” isn’t a standard English word; it is probably “kudos,” meaning praise or recognition.","zh":"“kussos”不是常见英语词；很可能是“kudos”，意思是表扬、认可或荣誉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “kudos”: praise, credit, or recognition for an achievement.","zh":"很可能是“kudos”的拼写错误：对成就的称赞、荣誉或认可。"},"examples":[{"en":"Kudos to you for finishing the project on time.","zh":"你按时完成项目，真是值得称赞。"},{"en":"She received kudos from her teacher for her improvement.","zh":"她的进步得到了老师的表扬。"}]}],"synonyms":["praise","recognition","credit","acclaim"],"phonetic":"/ˈkjuːdoʊs/","extraExplanation":["“Kudos”在英语里常用作不可数名词（例如：receive kudos / get kudos），也有人把它当作可数名词用（a kudos），但在较正式的写法里通常不这么用。","词源来自希腊语，原意与“荣耀、名声”有关。","如果你指的是别的词（例如人名、品牌、游戏/网络用语），请告诉我出现的句子或语境，我可以更准确解释“kussos”。"]}
{"word":"kustenau","summary":{"en":"“Kustenau” is most likely a German-origin proper name (surname/place), not a common English word.","zh":"“Kustenau”更可能是德语来源的专有名词（姓氏/地名），并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English vocabulary word). It is most likely a German-origin surname or place name, sometimes seen as “Küstenau.”","zh":"专有名词（不是标准英语词汇）。多半是德语来源的姓氏或地名，有时写作“Küstenau”。"},"examples":[{"en":"I couldn’t find “Kustenau” in an English dictionary; it appears to be a name.","zh":"我在英语词典里找不到“Kustenau”；它看起来像是一个名字。"},{"en":"Dr. Kustenau will present the research at the conference.","zh":"Kustenau 博士将在会议上报告这项研究。"}]}],"phonetic":"/ˈkʊstənˌaʊ/","extraExplanation":["“Kustenau”很可能来自德语拼写体系：如果原形是“Küstenau”，其中“ü”有时在不方便输入变音符号时会被写成“ue”（变成“Kuestenau”），也有人直接写成“u”。","如果你是想查某个英文单词，可能是拼写有误。你可以告诉我它出现的句子/语境（或是否带有变音符号，如 ü、ö、ä），我能更准确判断。"]}
{"word":"kusti","summary":{"en":"Kusti most commonly refers to traditional Indian-style wrestling, and it can also mean the sacred waist cord worn in Zoroastrian practice.","zh":"Kusti最常指印度传统摔跤；也可指祆教（琐罗亚斯德教）信徒佩戴的腰间圣绳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) Traditional wrestling, especially in India; also the sport/practice of this style of wrestling.","zh":"（南亚）传统摔跤（尤指印度的“库斯提”摔跤）；也指这种摔跤运动/训练。"},"examples":[{"en":"He trained in kusti at a local akhara every morning.","zh":"他每天早上在当地的摔跤馆（akhara）练库斯提摔跤。"},{"en":"Kusti matches are often held during festivals in some parts of India.","zh":"在印度一些地区，节日期间常会举办库斯提摔跤比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoroastrianism) A sacred cord worn around the waist as part of religious practice; also spelled “kushti.”","zh":"（祆教/琐罗亚斯德教）系在腰间的神圣圣绳（宗教服饰/仪式用品）；也常拼作“kushti”。"},"examples":[{"en":"A practicing Zoroastrian may wear the kusti as a daily religious symbol.","zh":"虔诚的祆教徒可能会日常佩戴库斯提圣绳作为信仰象征。"},{"en":"She learned how to tie the kusti properly during a family ceremony.","zh":"她在一次家庭仪式中学习了如何正确系上库斯提圣绳。"}]}],"synonyms":["Indian wrestling","pehlwani (related term)","kushti (variant spelling)"],"phonetic":"/ˈkuːsti/","extraExplanation":["“kusti”在英语里属于文化借词，常出现在介绍南亚传统体育或宗教文化的文章中；具体含义通常要看上下文（是摔跤还是祆教圣绳）。","与摔跤义项相关的词：akhara（传统摔跤训练馆/场地）、pehlwan（摔跤手）。祆教义项里也常见拼写“kushti”。"]}
{"word":"kusum","summary":{"en":"Kusum is most commonly a South Asian given name, often connected to the meaning “flower.” It can also mean “flower” in some South Asian languages, and sometimes refers to the kusum tree.","zh":"Kusum 最常见是南亚地区的人名，常与“花”的含义相关；在一些南亚语言中也可表示“花”，有时还指库苏姆树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (commonly used in India and Nepal), usually for women; it is often associated with the meaning “flower.”","zh":"人名（在印度、尼泊尔等地常见，多为女性名）；常与“花”的含义相关。"},"examples":[{"en":"Kusum is my aunt’s name, and she lives in Kathmandu.","zh":"Kusum 是我阿姨的名字，她住在加德满都。"},{"en":"Please ask Kusum to call me when she is free.","zh":"请让 Kusum 有空时给我打电话。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asian languages, e.g., Hindi/Sanskrit) “flower; blossom,” sometimes used poetically or in names.","zh":"（南亚语言，如印地语/梵语）“花；花朵”，有时用于诗意表达或名字中。"},"examples":[{"en":"In some contexts, kusum can mean “flower.”","zh":"在一些语境中，kusum 可以表示“花”。"},{"en":"The name Kusum is linked to the idea of a flower.","zh":"名字 Kusum 常与“花”的意象相关。"}]},{"partOfSpeech":"n.","definition":{"en":"(India) the kusum tree, a plant known for producing oil-rich seeds (often identified as Schleichera oleosa).","zh":"（印度）库苏姆树/库苏姆油树，一种种子含油的树（常指 Schleichera oleosa）。"},"examples":[{"en":"Kusum oil is sometimes mentioned in traditional uses.","zh":"在一些传统用途里会提到 kusum 油。"}]}],"synonyms":["flower (for the common-noun meaning)","blossom (for the common-noun meaning)"],"phonetic":"/kuːˈsʊm/","extraExplanation":["“Kusum”在英文里多作为专有名词（人名）出现；在南亚语境中，它来源于梵语/印地语中与“花、开花”相关的词根，因此常被用作带有美好意象的名字。","在印度部分地区，“kusum”也可指一种树（常见对应为 Schleichera oleosa），其种子可榨油；具体指代会随地区与语言而变化。"]}
{"word":"kutch","summary":{"en":"Kutch is a region in Gujarat, western India, famous for the Great Rann of Kutch salt desert; it is also spelled Kachchh.","zh":"Kutch 指印度西部古吉拉特邦的库奇地区，以库奇大盐沼/盐漠闻名；也常拼作 Kachchh。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region (district) in the state of Gujarat, western India, known for the Great Rann of Kutch (a vast salt desert).","zh":"库奇（印度西部古吉拉特邦的一个地区/县），以“库奇大盐沼/大盐漠”（Great Rann of Kutch）等地貌闻名。"},"examples":[{"en":"Many visitors go to Kutch in winter to see the white salt desert.","zh":"很多游客会在冬天去库奇看白色的盐漠。"},{"en":"Kutch is in Gujarat, on the western side of India.","zh":"库奇位于印度西部的古吉拉特邦。"}]},{"partOfSpeech":"n.","definition":{"en":"a common English spelling for Kachchh, the same place name used in Indian English and on maps.","zh":"Kachchh 的常见英文拼写之一（指同一个地名，在印度英语和地图上也常见）。"},"examples":[{"en":"On some maps, Kutch is written as Kachchh.","zh":"在一些地图上，Kutch 会写作 Kachchh。"}]}],"synonyms":["Kachchh"],"phonetic":"/kʊtʃ/","extraExplanation":["“Kutch/ Kachchh”在英语里通常作为专有名词使用，首字母大写（Kutch）。","该地区以手工艺（刺绣、织物、镜片装饰）和沙漠节庆活动闻名；在英语语境中常见搭配是 “the Rann of Kutch / the Great Rann of Kutch”。"]}
{"word":"kutcha","summary":{"en":"Kutcha means simple, temporary, or unpaved (often in Indian English), especially for roads or buildings.","zh":"Kutcha 指简易的、临时的或未铺装的（常见于印式英语），多用于道路或建筑等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in South Asia) Made in a simple, temporary, or unpaved way; not finished or permanent.","zh":"（尤指南亚）简易的、临时的；未铺装的；不牢固/不永久的。"},"examples":[{"en":"They drove along a kutcha road that turned muddy after the rain.","zh":"他们沿着一条土路（kutcha road）开车，雨后一片泥泞。"},{"en":"The village had mostly kutcha houses made from mud and thatch.","zh":"村里大多是用泥土和茅草搭的简易房（kutcha houses）。"}]},{"partOfSpeech":"n.","definition":{"en":"An unpaved or temporary road, or a simple temporary structure (common in Indian English).","zh":"（印式英语常用）土路；简易的临时建筑/设施。"},"examples":[{"en":"The bus can’t use the kutcha during the monsoon season.","zh":"雨季时公交车走不了那条土路（kutcha）。"},{"en":"They set up a kutcha shelter near the fields.","zh":"他们在田边搭了一个简易棚（kutcha shelter）。"}]}],"synonyms":["unpaved","dirt (road)","makeshift","temporary","rough"],"phonetic":"/ˈkʊtʃə/","extraExplanation":["“kutcha/kachcha”常见于印度英语（Indian English），来自印地语/乌尔都语的“kachchā（कच्चा）”，本义是“生的、未煮熟的”，引申为“未完成的、临时的、粗糙的”。因此在路、房屋等语境里常与“pucca”对比：pucca（也拼作pakka）指“结实的、永久的、铺好的/正规建造的”。","拼写上常见 kutcha、kachcha、kutchha 等变体；在正式国际英语写作中，可用更通用的表达替换，如 “unpaved road / dirt road / makeshift / temporary”。"]}
{"word":"kutchin","summary":{"en":"Kutchin is an older name for the Gwich’in people and their language in Alaska and northwestern Canada.","zh":"Kutchin 是对格威琴人（Gwich’in）及其语言的较旧称呼，主要见于阿拉斯加与加拿大西北部相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name formerly used for the Gwich’in people, an Indigenous group living mainly in northern Alaska (U.S.) and northwestern Canada","zh":"过去对“格威琴人（Gwich’in）”的称呼；格威琴人是主要生活在美国阿拉斯加北部及加拿大西北部的原住民族群"},"examples":[{"en":"Older books may use the word “Kutchin” for the Gwich’in people.","zh":"较早的书籍里可能会用 “Kutchin” 来指格威琴人（Gwich’in）。"},{"en":"Today, many communities prefer the name “Gwich’in” rather than “Kutchin.”","zh":"如今，许多社群更倾向使用 “Gwich’in（格威琴）” 而不是 “Kutchin”。"}]},{"partOfSpeech":"n.","definition":{"en":"the Athabaskan (Na-Dene) language spoken by the Gwich’in people; also called Gwich’in","zh":"格威琴人所使用的阿萨巴斯卡语支（Na-Dene 语系）语言；也称 Gwich’in 语"},"examples":[{"en":"Some sources list Kutchin as another name for the Gwich’in language.","zh":"有些资料把 Kutchin 作为 Gwich’in 语的别称。"}]}],"synonyms":["Gwich’in","Gwichin"],"phonetic":"/ˈkʊtʃɪn/","extraExplanation":["“Kutchin”在现代语境中常被视为较旧或外来（历史文献/人类学资料中）的称呼；在尊重当事族群的写作与交流中，通常优先使用他们自称与常用名称 “Gwich’in”。","如果你在阅读历史资料遇到“Kutchin”，它通常指的是一组与北极圈生态、驯鹿/驼鹿狩猎文化相关的格威琴社群（不同地区可能还有更细的分支名称）。"]}
{"word":"kutenai","summary":{"en":"Kutenai is a less common spelling of Kootenai, referring to an Indigenous people, their language, and regional place names (especially the river).","zh":"Kutenai 是 Kootenai 的较少见拼写，可指一个原住民族及其语言，也可指相关地名（尤其是库特奈河）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spelling variant of Kootenai: a Native American/First Nations people of the northwestern U.S. and western Canada, and also the name of their language","zh":"Kootenai 的一种拼写变体：指北美西北部（美国与加拿大）的一支原住民族（第一民族/美洲原住民），也可指他们的语言"},"examples":[{"en":"The Kutenai (Kootenai) people have a long history in the region.","zh":"Kutenai（也拼作 Kootenai）族在这一地区有悠久的历史。"},{"en":"She is studying the Kutenai language and its unique grammar.","zh":"她正在学习 Kutenai 语及其独特的语法结构。"}]},{"partOfSpeech":"n.","definition":{"en":"(also Kootenai) a name used for places in the region, especially the Kootenai/Kutenai River and nearby areas","zh":"（也写作 Kootenai）用于指该地区的一些地名，尤其是库特奈河（Kootenai/Kutenai River）及其周边地区"},"examples":[{"en":"They went fishing on the Kutenai River.","zh":"他们去库特奈河钓鱼了。"},{"en":"Wildlife is abundant near the Kutenai wetlands.","zh":"库特奈湿地附近野生动物十分丰富。"}]}],"synonyms":["Kootenai","Kootenay"],"phonetic":"ˈkuːtəneɪ","extraExplanation":["“Kutenai”更常见的拼写是“Kootenai”。不同拼写多来自不同历史时期的英法文转写方式。","在写作中提到该族群或语言时，尽量使用他们社区或相关机构当前更常采用的拼写（常见为 Kootenai），并在首次出现时注明别名/异拼写，以示尊重与清晰。"]}
{"word":"kutta","summary":{"en":"“Kutta” is a Hindi/Urdu word for “dog,” sometimes used as a harsh insult.","zh":"“kutta”是印地语/乌尔都语里“狗”的意思，有时也会被用作较强的辱骂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian languages; Hindi/Urdu) a dog. In casual speech it can also be used as an insult meaning “dog/cur,” so use with care.","zh":"（南亚语言；印地语/乌尔都语）“狗”。在口语里也常被当作侮辱用语，相当于“狗/卑鄙的人”，使用需谨慎。"},"examples":[{"en":"In Hindi/Urdu, “kutta” means “dog.”","zh":"在印地语/乌尔都语里，“kutta”就是“狗”的意思。"},{"en":"Please don’t say that word to a person—it can sound like a strong insult.","zh":"请不要用这个词称呼别人——听起来可能是很强的侮辱。"}]}],"synonyms":["dog","cur (insult)"],"phonetic":"/ˈkʊtə/","extraExplanation":["这个词在英语里不是标准常用词，但在南亚移民社区、影视作品、或跨语言对话中可能会听到。它的侮辱性取决于语气、场合与对象；对不熟的人使用容易引发冲突。比较中性的说法是直接用英文“dog”，或在印地语/乌尔都语里用更礼貌的表达避免人身指称。"]}
{"word":"kuttab","summary":{"en":"Kuttab is a traditional elementary school where children learn basic literacy, often alongside Qur’an recitation.","zh":"Kuttab指伊斯兰世界传统的启蒙学校，教授基础读写，常结合《古兰经》诵读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional elementary school in parts of the Islamic world (especially historically in the Middle East and North Africa), where children learn basic reading and writing, often with Qur’an recitation and religious instruction","zh":"（伊斯兰世界部分地区传统的）启蒙学校/初等学校（尤指历史上中东和北非），教授基础读写，常包含《古兰经》诵读与宗教教育"},"examples":[{"en":"In the village, children first learned the alphabet at a kuttab before moving on to a larger school.","zh":"在那个村子里，孩子们先在kuttab学字母，然后再去更大的学校。"},{"en":"Many historical accounts describe the kuttab as a center for basic literacy and Qur’an memorization.","zh":"许多史料把kuttab描述为基础识字教育与背诵《古兰经》的中心。"}]}],"synonyms":["Qur’anic school","Quranic school","elementary religious school"],"phonetic":"/kʊˈtɑːb/","extraExplanation":["“kuttab”常见拼写还有“kuttāb”。它源自阿拉伯语的转写，用来指传统的儿童启蒙教育场所，类似“识字班/私塾”的功能，但文化背景属于伊斯兰教育体系。","在一些地区，现代学校体系普及后，“kuttab”可能仍用于指周末或课后进行的宗教与读写启蒙课程；具体形式会因国家与社区而异。","相关词：maktab（也可指学校/办公室；在某些语境下与kuttab相关但不完全等同）。"]}
{"word":"kuttar","summary":{"en":"“Kuttar” is a South Asian slang/transliteration meaning “dog,” often used as a harsh insult.","zh":"“kuttar”是南亚语境的俚语/转写词，字面是“狗”，常用作较重的辱骂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian slang, Hindi/Urdu transliteration) a dog; often used as a strong insult meaning “dog/cur,” implying someone is contemptible.","zh":"（南亚俚语，印地语/乌尔都语的拉丁转写）狗；也常用作强烈侮辱语，类似“狗东西/卑鄙的人”。"},"examples":[{"en":"He called him “kuttar” during the argument, which was very offensive.","zh":"他在争吵中骂对方“kuttar”，这非常冒犯。"},{"en":"In many contexts, using “kuttar” is hatefully insulting and can escalate conflict.","zh":"在很多语境里，用“kuttar”带有恶意侮辱，很容易激化冲突。"}]}],"synonyms":["dog (insult)","cur","mongrel (insult)"],"phonetic":"/ˈkʊtɑr/","extraExplanation":["“kuttar”通常是把印地语/乌尔都语里的“kuttā/कुत्ता (kuttā)”（公狗）或相关形式用拉丁字母写出来的拼法之一；不同地区/个人可能写成 kutta、kuttar 等。","这是带强烈贬损色彩的骂人话。跨语言交流中建议避免使用；如果在影视、游戏或聊天里看到，理解为“骂人/侮辱”即可。"]}
{"word":"kuttaur","summary":{"en":"Couture means high-fashion, custom-made clothing and the art of making it; it can also describe things related to high-end fashion.","zh":"Couture 指高级时装与高级定制服装及其制作，也可作形容词表示“与高级时装/定制有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"high-fashion design and dressmaking, especially custom-made clothing by famous designers or fashion houses","zh":"（尤指名牌时装屋制作的）高级定制服装；高级时装设计与制作"},"examples":[{"en":"She bought a couture dress for the award ceremony.","zh":"她为颁奖典礼买了一件高级定制礼服。"},{"en":"Couture pieces are often made by hand and tailored to one person.","zh":"高级定制作品通常由手工制作，并为某一个人量身定做。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to high fashion or custom-made designer clothing","zh":"与高级时装/高级定制有关的；高级时装的"},"examples":[{"en":"The magazine featured couture brands from Paris.","zh":"那本杂志介绍了来自巴黎的高级时装品牌。"},{"en":"He prefers couture tailoring over mass-produced suits.","zh":"比起批量生产的西装，他更喜欢高级定制的剪裁。"}]}],"synonyms":["high fashion","designer fashion","haute couture","custom tailoring"],"phonetic":"/kuːˈtʊr/","extraExplanation":["你输入的“kuttaur”在英语里不常见，最可能是拼写接近的 **couture**（常见于时尚语境）。","**couture** 来自法语，常指在巴黎等地由时装屋制作的高级定制；日常英语里也常用来泛指“高级时装/大牌定制”。","常见搭配：**haute couture**（高级定制时装）、**couture house**（高级定制时装屋）、**couture designer**（高级定制设计师）。"]}
{"word":"kutun","summary":{"en":"Kutun is usually a proper name, not a common English word; it may also appear as a variant spelling of “Kuytun” (奎屯).","zh":"Kutun 通常是专有名词，并非常见英语词；也可能是“Kuytun（奎屯）”的拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word. It is most often seen as a proper name (a place name or family name) in romanized spelling.","zh":"不是常见的英语词汇。它多作为专有名词出现（如地名或姓氏的拉丁字母拼写）。"},"examples":[{"en":"I saw “Kutun” on a map, but I’m not sure which country it refers to.","zh":"我在地图上看到了“Kutun”，但不确定它指的是哪个国家/地区。"},{"en":"Kutun is used as a surname in some regions.","zh":"在一些地区，Kutun 会作为姓氏使用。"}]},{"partOfSpeech":"other","definition":{"en":"A less common spelling/transliteration sometimes used for “Kuytun,” a city name in Xinjiang, China (奎屯).","zh":"一种较少见的拼写/音译形式，有时用来指中国新疆的城市名“Kuytun（奎屯）”。"},"examples":[{"en":"Some older sources may write the city as Kutun instead of Kuytun.","zh":"一些较旧的资料可能把这个城市写作 Kutun，而不是 Kuytun。"},{"en":"Kuytun (sometimes spelled Kutun) is in Xinjiang.","zh":"Kuytun（有时写作 Kutun）位于新疆。"}]}],"synonyms":["Kuytun"],"phonetic":"/kuːˈtuːn/","extraExplanation":["“Kutun”更像是音译/拼写变体，而不是英语里固定、普遍认可的单词。如果你是在句子里看到的，我可以根据上下文判断它更可能是地名、人名，还是你想查的其实是另一个词（例如 cotton /ˈkɑtən/）。"]}
{"word":"kuvasz","summary":{"en":"Kuvasz: a large white Hungarian livestock-guardian dog breed.","zh":"Kuvasz（库瓦兹犬）：一种大型白色的匈牙利护畜/护卫犬种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, white Hungarian dog breed traditionally used to guard livestock and property (a livestock guardian dog).","zh":"库瓦兹犬；一种大型白色的匈牙利犬种，传统上用于守护牲畜和家园（护畜犬/护卫犬）。"},"examples":[{"en":"A Kuvasz is known for its loyalty and strong guarding instincts.","zh":"库瓦兹犬以忠诚和强烈的守护本能而闻名。"},{"en":"The farmer kept a Kuvasz to protect the sheep from predators.","zh":"农场主养了一只库瓦兹犬来保护羊群免受掠食动物侵害。"}]}],"synonyms":["livestock guardian dog","guard dog (general)"],"phonetic":"/ˈkuːvɑːs/","extraExplanation":["“Kuvasz”是一个犬种名称，常见于犬展、宠物百科和畜牧文化语境中。它属于典型的“护畜犬”（livestock guardian dog），工作方式更偏向独立巡护与威慑，而不是像牧羊犬那样“驱赶、聚拢”羊群。","该犬种起源与匈牙利的畜牧传统密切相关；英语里通常把它当作专有名词使用，复数可写作 Kuvasz 或 Kuvaszok（更偏匈牙利语用法）。","文化上，库瓦兹犬常被描述为聪明、警觉、对家人亲近但对陌生人谨慎；因此在英文介绍中经常出现 guardian, protective, independent, territorial 等词来形容它。"]}
{"word":"kuvaszok","summary":{"en":"“Kuvaszok” means more than one Kuvasz, a white Hungarian livestock-guardian dog breed.","zh":"“kuvaszok”指多只库瓦兹犬——一种匈牙利的白色护畜护卫犬犬种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of kuvasz: large white Hungarian livestock-guardian dogs (a dog breed).","zh":"kuvasz（库瓦兹犬）的复数：一种来自匈牙利的大型白色护畜护卫犬（犬种）。"},"examples":[{"en":"The farm keeps two kuvaszok to guard the sheep at night.","zh":"农场养了两只库瓦兹犬，晚上用来守护羊群。"},{"en":"Kuvaszok are known for their independence and strong protective instincts.","zh":"库瓦兹犬以独立性强、保护欲很强而闻名。"}]}],"synonyms":["Kuvasz (plural sense)","livestock guardian dogs","Hungarian guardian dogs"],"phonetic":"/ˈkuːvɑːz/","extraExplanation":["“Kuvaszok”是匈牙利语的复数形式（-ok 是常见复数结尾）。英语里更常写作复数“Kuvasz”或“Kuvaszes”，但在讨论匈牙利语、犬种历史或较专业的语境中也会见到“kuvaszok”。","库瓦兹犬传统上用于看护羊群、农场和家庭，对陌生人警惕、对主人忠诚；训练时通常需要耐心与清晰一致的规则。"]}
{"word":"kuvera","summary":{"en":"Kuvera (often spelled Kubera) is a mythological deity associated with wealth and prosperity, especially in Hinduism and some Buddhist traditions.","zh":"Kuvera（常写作 Kubera）是与财富、兴盛相关的神话人物，主要见于印度教，也出现在部分佛教传统中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Hindu mythology, Kuvera (more commonly spelled Kubera) is the god of wealth and the king of the yakshas (nature-spirits), often described as the treasurer of the gods.","zh":"在印度教神话中，Kuvera（更常见拼作 Kubera）是财富之神、夜叉（yaksha，自然灵/守护灵）之王，常被称为众神的“财库/司库”。"},"examples":[{"en":"In the story, Kuvera is praised as the guardian of riches.","zh":"在故事里，Kuvera 被赞颂为财富的守护者。"},{"en":"Some temples include images of Kuvera/Kubera near other deities associated with prosperity.","zh":"一些寺庙会在与兴旺相关的其他神祇旁供奉 Kuvera/Kubera 的形象。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Buddhist traditions, Kuvera/Kubera is also honored as a protector deity connected with prosperity (often linked with Vaiśravaṇa).","zh":"在部分佛教传统中，Kuvera/Kubera 也被尊为与富足相关的护法神（常与毗沙门天 Vaiśravaṇa 相联系）。"},"examples":[{"en":"The text mentions Kuvera as a protective figure who brings abundance.","zh":"文献中提到 Kuvera 是带来丰足、具有护持作用的形象。"}]}],"synonyms":["Kubera"],"phonetic":"/kuːˈvɛrə/","extraExplanation":["“Kuvera”多被视为“Kubera”的异拼/转写差异：不同语言与学术体系会出现不同拼法（如 Kuvera、Kubera）。日常英语里更常见 Kubera。","在印度传统中，Kubera 常与“北方守护/北方之王”等意象相连，也常被描写为拥有无尽财宝的统治者；但这些细节会因版本、地域与宗派而不同。","学习使用时要注意文化语境：它通常是专名（proper name），在英文写作中一般首字母大写（Kuvera/Kubera）。"]}
{"word":"Kuwait","summary":{"en":"Kuwait is a Middle Eastern country on the Persian Gulf; its capital is Kuwait City.","zh":"Kuwait 指中东的科威特（波斯湾沿岸国家），首都是科威特城。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in the Middle East on the Persian Gulf, bordering Iraq and Saudi Arabia; its capital city is also called Kuwait (Kuwait City).","zh":"科威特：中东波斯湾沿岸国家，北邻伊拉克、南邻沙特阿拉伯；其首都也叫科威特（科威特城）。"},"examples":[{"en":"Kuwait is known for its oil industry and modern skyline in Kuwait City.","zh":"科威特以石油产业以及科威特城的现代化天际线而闻名。"},{"en":"She moved to Kuwait for work and learned about Gulf culture.","zh":"她因为工作搬到科威特，并了解了海湾地区的文化。"}]}],"phonetic":"/kuˈweɪt/","extraExplanation":["“Kuwait”常被当作专有名词使用；指国家时通常不加冠词（说“in Kuwait”），但当它修饰名词（如“the State of Kuwait（科威特国）”）或用于特定正式语境时可能出现冠词。","形容词和国籍常用“ Kuwaiti（科威特的；科威特人）”，例如：Kuwaiti food / a Kuwaiti engineer。","地理与文化背景：科威特位于波斯湾西北岸，阿拉伯语为官方语言；货币是科威特第纳尔（KWD）。"]}
{"word":"kuwait","summary":{"en":"Kuwait is a Middle Eastern country on the Persian Gulf.","zh":"Kuwait 指位于波斯湾的中东国家“科威特”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in the Middle East at the northwestern edge of the Persian Gulf, known for its oil industry and modern city of Kuwait City.","zh":"科威特：中东国家，位于波斯湾西北岸，以石油产业和现代化首都科威特城闻名。"},"examples":[{"en":"Kuwait is a small country with a significant oil economy.","zh":"科威特是一个国土不大但石油经济很重要的国家。"},{"en":"She traveled to Kuwait for work and lived in Kuwait City.","zh":"她因工作去科威特，并住在科威特城。"}]}],"synonyms":["the State of Kuwait"],"phonetic":"/kʊˈweɪt/","extraExplanation":["“Kuwait”通常读作两个音节（ku-WAIT）。在英语里它属于专有名词，常见搭配有：Kuwait City（科威特城）、the State of Kuwait（科威特国）、Kuwaiti（科威特的；科威特人）。","文化与背景：科威特是海湾国家之一，历史上与海上贸易有关；20世纪后因石油资源而迅速发展。英语新闻中也常出现与1990年伊拉克入侵科威特（the invasion of Kuwait）相关的历史语境。"]}
{"word":"Kuwaiti","summary":{"en":"Kuwaiti means someone from Kuwait, or something related to Kuwait.","zh":"Kuwaiti 指“科威特人”，或“与科威特有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Kuwait; a citizen or resident of Kuwait","zh":"科威特人；科威特的公民或居民"},"examples":[{"en":"Many Kuwaitis speak Arabic, and some also speak English at work or school.","zh":"许多科威特人说阿拉伯语，有些人在工作或学校也会说英语。"},{"en":"A Kuwaiti friend recommended this restaurant.","zh":"一位科威特朋友推荐了这家餐厅。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Kuwait, its people, culture, or Arabic variety spoken there","zh":"科威特的；与科威特、其人民、文化或当地阿拉伯语（方言）有关的"},"examples":[{"en":"Kuwaiti food often includes rice, grilled meats, and spices.","zh":"科威特美食常包含米饭、烤肉和香料。"},{"en":"She studies Kuwaiti history in a Middle East politics course.","zh":"她在一门中东政治课程里学习科威特历史。"}]}],"synonyms":["from Kuwait","of Kuwait"],"phonetic":"/kuːˈweɪti/","extraExplanation":["“Kuwaiti”是英语里表示国籍/族群与形容词的常见构词：国家名“Kuwait” + “-i”（类似的还有“Iraqi, Pakistani, Israeli”）。","发音里中间的 /w/ 与 “wait” 的 /weɪt/ 相近；很多学习者容易把重音放错或漏掉 /w/。","文化语境中，谈到“a Kuwaiti”通常指国籍身份；若想更宽泛地说“在科威特生活的人”，也可说“a resident of Kuwait”。"]}
{"word":"kuwaiti","summary":{"en":"“Kuwaiti” means someone from Kuwait, or something related to Kuwait.","zh":"“Kuwaiti”指科威特人，或与科威特有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Kuwait, or someone of Kuwaiti nationality or heritage","zh":"科威特人；科威特国籍的人；有科威特血统的人"},"examples":[{"en":"She is Kuwaiti and grew up in Kuwait City.","zh":"她是科威特人，在科威特城长大。"},{"en":"Many Kuwaitis speak Arabic, and some also speak English.","zh":"许多科威特人说阿拉伯语，有些人也会说英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Kuwait, its people, culture, or language","zh":"科威特的；与科威特、其人民、文化或语言有关的"},"examples":[{"en":"Kuwaiti food often includes rice, lamb, and spices.","zh":"科威特美食常包含米饭、羊肉和香料。"},{"en":"They visited a Kuwaiti museum to learn about the country’s history.","zh":"他们参观了科威特的博物馆来了解这个国家的历史。"}]}],"synonyms":["from Kuwait","Kuwait (adj. use in some contexts)"],"phonetic":"/kuːˈweɪti/","extraExplanation":["“Kuwaiti”通常发音为三音节 /kuːˈweɪti/。拼写中虽然有“ai”，但读音更接近“way + tee”。","英语里国籍/民族形容词常同时可作名词（如 Canadian, Japanese）。因此“a Kuwaiti”=“一个科威特人”，而“Kuwaiti culture”=“科威特文化”。"]}

