{"word":"kW","summary":{"en":"kW means kilowatt, a unit of power equal to 1,000 watts.","zh":"kW 指千瓦，是功率单位，等于 1,000 瓦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"kilowatt (kW): a unit of power equal to 1,000 watts, often used to describe the power of engines, heaters, and electrical devices.","zh":"千瓦（kW）：功率单位，等于 1,000 瓦（W），常用于描述发动机、加热器和电器设备的功率大小。"},"examples":[{"en":"This electric kettle is rated at 2 kW, so it boils water quickly.","zh":"这台电热水壶额定功率是 2 kW，所以烧水很快。"},{"en":"The solar system can produce up to 5 kW of power on a sunny day.","zh":"这套太阳能系统在晴天最多可输出 5 kW 的功率。"},{"en":"The motor uses 0.75 kW when running at full speed.","zh":"这台电机在全速运转时耗用 0.75 kW 的功率。"}]}],"synonyms":["kilowatt"],"phonetic":"/ˈkɪləˌwɑt/","extraExplanation":["kW 表示“功率”（power），强调“当下有多大的输出/消耗能力”。例如空调 3 kW，指它工作时的功率大小。","不要把 kW 和 kWh 混淆：kWh（千瓦时）表示“用电量/能量”（energy）。直观理解：kW 像“速度”，kWh 像“走了多远”。例如 2 kW 的电器用 3 小时，耗电量约为 6 kWh。"]}
{"word":"kw","summary":{"en":"“kw/kW” most commonly means “kilowatt,” a unit of power; online it can also mean “keyword.”","zh":"“kw/kW”最常见指“kilowatt（千瓦）”，一种功率单位；在网络语境中也可指“keyword（关键词）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"kilowatt (kW): a unit of power equal to 1,000 watts, commonly used to measure electricity use or the power of engines and appliances.","zh":"千瓦（kW）：功率单位，等于1000瓦，常用于衡量用电量相关的功率或设备/发动机的功率。"},"examples":[{"en":"This air conditioner uses about 2 kW when it’s running.","zh":"这台空调运行时大约耗用2千瓦的功率。"},{"en":"The charger can deliver up to 150 kW at peak speed.","zh":"这款充电桩峰值功率可达150千瓦。"}]},{"partOfSpeech":"n.","definition":{"en":"(in online writing) abbreviation for “keyword,” meaning an important word or search term used to find information.","zh":"（网络写作中）“keyword（关键词）”的缩写，指用于检索信息的重要词或搜索词。"},"examples":[{"en":"Try adding a few more KWs to your article so people can find it in search.","zh":"试着在文章里再加几个关键词，这样大家更容易搜到。"},{"en":"The main KW for this page is “beginner English.”","zh":"这个页面的主要关键词是“初级英语”。"}]}],"synonyms":["kilowatt","kW","keyword","search term"],"phonetic":"/ˈkɪləˌwɑt/","extraExplanation":["在正式写作里，表示“千瓦”通常写作“kW”（小写k、大写W），而不是“kw”。在工程、电费账单、充电功率等场景中最常见。","“KW=keyword”更多见于电商、SEO（搜索优化）、广告投放或内容运营的语境里。"]}
{"word":"kwacha","summary":{"en":"Kwacha is the name of the currency used in Zambia and in Malawi.","zh":"Kwacha 是赞比亚和马拉维使用的货币名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic unit of money in Zambia (plural: kwacha).","zh":"赞比亚的货币单位“克瓦查”（复数也常用 kwacha）。"},"examples":[{"en":"I exchanged some dollars into Zambian kwacha at the airport.","zh":"我在机场把一些美元换成了赞比亚克瓦查。"},{"en":"The price is 50 kwacha, not including tax.","zh":"价格是50克瓦查，不含税。"}]},{"partOfSpeech":"n.","definition":{"en":"the basic unit of money in Malawi (plural: kwacha).","zh":"马拉维的货币单位“克瓦查”（复数也常用 kwacha）。"},"examples":[{"en":"You can pay in Malawian kwacha or by card at some hotels.","zh":"一些酒店可以用马拉维克瓦查或刷卡付款。"},{"en":"The bus ticket costs about 2,000 kwacha.","zh":"公交车票大约要2000克瓦查。"}]}],"synonyms":["Zambian kwacha","Malawian kwacha"],"phonetic":"/ˈkwɑːtʃə/","extraExplanation":["“Kwacha”源自班图语族的一些语言，和“黎明/天亮”有关（常被解释为“新的开始”之意），因此被用作国名与货币象征意义的一部分。","写作时可用更明确的说法：Zambian kwacha（赞比亚克瓦查）或 Malawian kwacha（马拉维克瓦查）。两国是不同货币：赞比亚常见代码 ZMW，马拉维常见代码 MWK。"]}
{"word":"kwachas","summary":{"en":"“Kwachas” is the plural form of “kwacha,” the currency unit of Malawi and Zambia.","zh":"“Kwachas”是“kwacha”的复数形式，指马拉维和赞比亚的货币单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic unit of money in Malawi and Zambia (plural: kwacha or kwachas).","zh":"马拉维和赞比亚的货币单位（复数可用 kwacha 或 kwachas）。"},"examples":[{"en":"I exchanged dollars for Malawian kwachas at the airport.","zh":"我在机场把美元换成了马拉维克瓦查。"},{"en":"The bus ticket costs 5,000 kwachas.","zh":"这张公交车票要5000克瓦查。"}]}],"synonyms":["Malawian kwacha","Zambian kwacha"],"phonetic":"/ˈkwɑːtʃə/","extraExplanation":["“Kwacha”一词来自当地语言（如奇切瓦语/尼扬贾语），原意与“黎明/破晓”有关，象征“新的开始”。","两国使用的“kwacha”是不同货币：马拉维克瓦查（ISO 代码：MWK）与赞比亚克瓦查（ISO 代码：ZMW）。在新闻或汇率中常用国家名来区分。","复数形式在英语里常见两种：不变形用“kwacha”（e.g., 10 kwacha），或加 -s 用“kwachas”（e.g., 10 kwachas）；具体写法可随地区与写作风格。"]}
{"word":"kwaiken","summary":{"en":"“Kwaiken” is not standard English; it’s likely a misspelling of “quicken” or “quaking.”","zh":"“kwaiken”不是标准英语词，可能是“quicken”或“quaking”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or nonstandard spelling of “quicken” (to make something faster) or “quaking” (shaking, often from fear or cold).","zh":"不是标准英语单词。更可能是“quicken”（使更快）或“quaking”（发抖/震颤，常因害怕或寒冷）的拼写错误或非标准写法。"},"examples":[{"en":"Did you mean “quicken”? We need to quicken the pace if we want to finish on time.","zh":"你是不是想写“quicken”？如果想按时完成，我们得加快进度。"},{"en":"Did you mean “quaking”? He was quaking with fear when he heard the noise.","zh":"你是不是想写“quaking”？听到声响时他吓得发抖。"}]}],"synonyms":["quicken","quaking"],"phonetic":"/ˈkwaɪkən/","extraExplanation":["“kwaiken”在常见英语词典中通常查不到。如果你是在小说、人名、地名、游戏/网名里看到的，它可能是专有名词（例如姓氏、角色名）或某种方言/外语的转写。","如果你把它发在一句完整的句子里（前后各给我3–5个词），我可以更准确判断你想表达的是哪个词，以及应如何拼写和使用。"]}
{"word":"kwakiutl","summary":{"en":"Kwakiutl refers to a Northwest Coast First Nations people (often now called Kwakwaka’wakw) and sometimes to their language, Kwak’wala.","zh":"Kwakiutl指加拿大西北海岸的原住民族群（现多称Kwakwaka’wakw），也可指其语言Kwak’wala。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a First Nations people from the Pacific Northwest Coast of Canada (especially northern Vancouver Island and nearby mainland areas); the term is widely used in older English sources, but many people today prefer the name “Kwakwaka’wakw.”","zh":"（加拿大太平洋西北海岸的）原住民族群之一，主要分布在温哥华岛北部及附近大陆地区；该词在旧英文资料中常见，但如今许多人更偏好使用“Kwakwaka’wakw（夸夸卡瓦克）”这一名称。"},"examples":[{"en":"The museum exhibit includes Kwakiutl masks and carvings from the Northwest Coast.","zh":"博物馆展览包括来自西北海岸的夸基乌特尔（Kwakiutl）面具与雕刻。"},{"en":"In many current writings, “Kwakwaka’wakw” is used instead of “Kwakiutl.”","zh":"在许多当代写作中，人们用“Kwakwaka’wakw”来替代“Kwakiutl”。"}]},{"partOfSpeech":"n.","definition":{"en":"the language traditionally associated with the Kwakwaka’wakw peoples; often called “Kwak’wala.”","zh":"与Kwakwaka’wakw族群传统相关的语言；常称为“Kwak’wala（夸克瓦拉语）”。"},"examples":[{"en":"Some community programs offer classes in Kwakiutl (Kwak’wala) to support language revitalization.","zh":"一些社区项目开设夸基乌特尔语（Kwak’wala）课程，以支持语言复振。"}]}],"synonyms":["Kwakwaka’wakw","Kwak’wala"],"phonetic":"/ˈkwɑːkiˌuːtəl/","extraExplanation":["“Kwakiutl”在英文中长期被当作总称使用，但在更精确或更尊重当事人的语境里，常用“Kwakwaka’wakw”指族群整体；“Kwakiutl”有时更具体地指其中一个群体（如Kwagu’ł一带），而语言更常写作“Kwak’wala”。在写作与引用资料时，若不确定，使用当事人偏好的自称并加以说明会更合适。"]}
{"word":"kwamme","summary":{"en":"“kwamme” is most likely a misspelling of “Kwame,” a common Ghanaian male name meaning a boy born on Saturday in Akan tradition.","zh":"“kwamme”很可能是“Kwame”的误拼；Kwame 是加纳常见男性名，在阿坎传统中意为“星期六出生的男孩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A West African (especially Ghanaian) male given name, commonly spelled Kwame; in Akan culture it traditionally refers to a boy born on Saturday.","zh":"一个西非（尤其是加纳）常见的男性名字，常见拼写为 Kwame；在阿坎（Akan）文化中传统上指“星期六出生的男孩”。"},"examples":[{"en":"Kwame is a common boy’s name in Ghana.","zh":"Kwame 是加纳很常见的男孩名字。"},{"en":"My classmate Kwame taught me a few words in Twi.","zh":"我的同学 Kwame 教了我几句契维语（Twi）。"}]}],"phonetic":"/ˈkwɑːmeɪ/","extraExplanation":["你输入的“kwamme”更像是拼写变体或拼写错误；更常见的形式是“Kwame”。在阿坎命名传统里，按出生星期给孩子取名很常见（例如 Kwame 表示星期六出生的男孩）。","如果你指的是别的词（比如网络用语、游戏名、品牌名或某个方言词），可以告诉我出现它的句子或语境，我可以再帮你确认准确含义和用法。"]}
{"word":"kwan","summary":{"en":"“Kwan” is most often a surname, and it can also mean a martial arts school/lineage in Korean taekwondo contexts.","zh":"“Kwan”最常见是姓氏；在跆拳道等韩式武术语境中也可指“馆/派/系”（道馆或流派传承）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), common among people of East Asian heritage (e.g., Korean 권/관, Chinese 关/關, Cantonese romanizations, etc.).","zh":"姓氏（常见于东亚背景的人名中，如韩语权/官/馆等不同汉字来源的拼写；中文关/關等在不同拼音/粤拼转写中也可能出现）。"},"examples":[{"en":"Michelle Kwan is a famous American figure skater.","zh":"Michelle Kwan（关颖珊）是一位著名的美国花样滑冰运动员。"},{"en":"My teacher’s last name is Kwan.","zh":"我老师的姓是 Kwan。"}]},{"partOfSpeech":"n.","definition":{"en":"In Korean martial arts (especially taekwondo), a school, training hall, or style lineage (often seen in names like “Chung Do Kwan”).","zh":"（韩式武术/跆拳道用语）“馆/派/系”，指某个道馆、训练体系或流派传承（常见于如“Chung Do Kwan”等名称中）。"},"examples":[{"en":"He trains at a taekwondo kwan with a long tradition.","zh":"他在一个历史悠久的跆拳道流派（道馆体系）里训练。"},{"en":"‘Kwan’ in the school name usually points to its lineage.","zh":"学校名称里的“kwan”通常表示它的传承流派。"}]}],"synonyms":["(surname) none","(taekwondo) school","dojang (related)","lineage"],"phonetic":"/kwɑn/","extraExplanation":["“Kwan”本身不是一个常见的英文词汇，更常见于姓名拼写或韩语武术词汇的转写（romanization）。不同地区、不同转写系统会把不同的汉字/韩文字写成同样的 Kwan，因此具体含义往往要看这个人的原文姓名或语境（如跆拳道流派名）。"]}
{"word":"kwannon","summary":{"en":"“Kwannon” is an older English spelling for Kannon/Guanyin, the bodhisattva of compassion in East Asian Buddhism.","zh":"“Kwannon”是较早的英文拼写，指东亚佛教中慈悲菩萨（日本多写Kannon，中文为观音）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A Japanese name for the bodhisattva of compassion, better known in Chinese as Guanyin (观音).","zh":"（专有名词）日本对“慈悲菩萨”的称呼之一，中文更常见为“观音”。"},"examples":[{"en":"The statue was labeled “Kwannon,” a Japanese name for the bodhisattva of compassion.","zh":"那尊雕像的标签写着“Kwannon”，这是慈悲菩萨在日语中的一种称呼。"},{"en":"In some older English texts, you may see “Kwannon” used instead of “Kannon” or “Guanyin.”","zh":"在一些较早的英文资料中，你可能会看到用“Kwannon”来替代“Kannon”或“Guanyin（观音）”。"}]}],"synonyms":["Kannon","Guanyin","Avalokiteśvara"],"phonetic":"/ˈkwɑːnən/","extraExplanation":["“Kwannon”多见于较早的英文转写或品牌/文化语境中；现代更常见的拼写是“Kannon”（日语）或“Guanyin”（中文“观音”的拼音）。","佳能 Canon 早期商标和宣传中曾与“Kwanon/Kwannon（观音）”有关联：公司最初产品名曾用过类似拼写，后来改为“Canon”。（注意：不同资料中拼写与细节可能略有差异。）"]}
{"word":"kwanza","summary":{"en":"Kwanzaa is a week-long cultural holiday (Dec 26–Jan 1) celebrating African heritage and community, mainly observed in the U.S.","zh":"宽扎节是一个为期一周（12月26日至1月1日）的文化节日，庆祝非洲传统与社区精神，主要在美国庆祝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Kwanzaa: a week-long cultural holiday celebrating African heritage and community, observed mainly in the United States from December 26 to January 1.","zh":"宽扎节：一个为期一周的文化节日，庆祝非洲（尤其是非裔美国人）的传统与社区精神，主要在美国于12月26日至1月1日庆祝。"},"examples":[{"en":"Our family lights the candles each night during Kwanzaa.","zh":"我们家在宽扎节期间每晚点燃蜡烛。"},{"en":"Kwanzaa celebrations often include music, storytelling, and shared meals.","zh":"宽扎节庆祝活动常包括音乐、讲故事和共进餐食。"},{"en":"Schools sometimes teach students about Kwanzaa alongside other winter holidays.","zh":"学校有时会在介绍其他冬季节日的同时讲解宽扎节。"}]}],"synonyms":["African American cultural holiday","Kwanzaa celebration"],"phonetic":"/kwɑːnˈzɑː/","extraExplanation":["“Kwanzaa”一词源自斯瓦希里语短语“matunda ya kwanza”，意为“初熟的果实/第一批果实”。节日名称用双写“a”（Kwanzaa）是为了象征性地对应七个原则（Nguzo Saba）。","宽扎节由毛拉纳·卡伦加（Maulana Karenga）于1966年在美国创立，强调文化认同、团结与自我提升。常见象征物包括烛台（kinara）与七支蜡烛（mishumaa saba），每天点一支并讨论一个原则。"]}
{"word":"kwanzas","summary":{"en":"“Kwanzas” means multiple units of the Angolan currency “kwanza.”","zh":"“Kwanzas”指安哥拉货币单位“kwanza（宽扎）”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “kwanza,” the basic monetary unit of Angola (currency code: AOA).","zh":"“kwanza（宽扎/安哥拉宽扎）”的复数；安哥拉的货币单位（货币代码：AOA）。"},"examples":[{"en":"I exchanged my dollars for kwanzas at the airport in Luanda.","zh":"我在罗安达的机场把美元换成了宽扎。"},{"en":"The taxi ride cost 3,000 kwanzas.","zh":"那趟出租车花了3000宽扎。"}]}],"synonyms":["Angolan kwanzas","AOA (currency code)"],"phonetic":"/ˈkwɑnzə/","extraExplanation":["“kwanza”是安哥拉的法定货币名称，常见写法是“kwanza / kwanzas”。实际使用中也常用货币代码“AOA”或货币符号“Kz”。"]}
{"word":"kwapa","summary":{"en":"“Kwapa” isn’t a recognized English word; please share context—maybe you meant “kappa” or another similar-looking word.","zh":"“kwapa”不是常见英语词；请提供上下文，可能你想写的是“kappa”或其他相近拼写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language used in English contexts.","zh":"不是标准英语单词。它可能是拼写错误、人名/地名，或是从其他语言借入、在英语语境中使用的词。"},"examples":[{"en":"I couldn’t find “kwapa” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“kwapa”——你能把你看到它的句子发我吗？"},{"en":"If you meant “kappa,” that’s a Greek letter used in math and science.","zh":"如果你想写的是“kappa”，那是一个在数学和科学中常用的希腊字母。"}]}],"extraExplanation":["“kwapa”更像是其他语言的拼写（例如菲律宾语/他加禄语网络用语）或人名、品牌名。若你能提供：1）出现的句子；2）它来自哪里（聊天、歌词、游戏、社媒等）；3）你想表达的意思，我可以更准确判断并给出对应英语词与用法。","你可能想输入的常见英语词：\n- kappa /ˈkæpə/：希腊字母 κ\n- quip：俏皮话\n- cap：帽子；或“限制（cap）”\n请告诉我你实际想查哪一个，或直接贴原句。"]}
{"word":"kwarta","summary":{"en":"“Kwarta” is an informal Filipino/Tagalog word meaning “money,” often used in casual Taglish conversations.","zh":"“kwarta”是菲律宾语/他加禄语里表示“钱”的非正式说法，常见于日常的夹杂英语对话中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money; cash (informal; common in Filipino/Tagalog usage).","zh":"钱；现金（非正式用法，常见于菲律宾语/他加禄语中）。"},"examples":[{"en":"I don’t have enough kwarta to buy lunch today.","zh":"我今天没有足够的钱买午饭。"},{"en":"He works hard to earn kwarta for his family.","zh":"他努力工作为家人赚钱。"}]},{"partOfSpeech":"n.","definition":{"en":"a coin or small amount of money; spare change (informal).","zh":"硬币；零钱（非正式）。"},"examples":[{"en":"Do you have kwarta for the bus fare?","zh":"你有坐公交的零钱吗？"},{"en":"She keeps some kwarta in her pocket for emergencies.","zh":"她口袋里放了一些零钱以备不时之需。"}]}],"synonyms":["money","cash","coins","change","funds"],"phonetic":"/ˈkwɑrtɑ/","extraExplanation":["“kwarta”在菲律宾英语对话或夹杂他加禄语（Taglish）的语境里很常见，常用来随口说“钱”。","词源上一般认为与西班牙语殖民时期的货币用词有关（常被联系到西语中的小额硬币称呼，如“cuarto/cuarta”等），所以带有历史与文化背景色彩。"]}
{"word":"kwarterka","summary":{"en":"Kwaterka is a Polish term for a quarter-liter (about 250 ml) bottle or measure of spirits, especially vodka.","zh":"Kwaterka 是波兰语，指约250毫升（四分之一升）的小瓶/小份烈酒，常指伏特加。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bottle or measure of alcohol (especially vodka) equal to about a quarter of a liter (≈250 ml), used in Poland","zh":"（波兰常用）“四分之一升”的小酒量/小酒瓶（约250毫升），常指伏特加等烈酒"},"examples":[{"en":"He stopped at the shop and bought a kwarterka of vodka.","zh":"他在店里停了一下，买了一瓶250毫升的伏特加（kwarterka）。"},{"en":"In casual speech, a kwarterka is a common size for a small bottle of spirits in Poland.","zh":"在日常口语里，kwarterka 是波兰很常见的小瓶烈酒规格。"}]}],"synonyms":["quarter-liter bottle","250 ml bottle","quarter bottle"],"phonetic":"/kwɑrˈtɛrkə/","extraExplanation":["这是一个波兰语词（不是标准英语），在英语语境中多见于讨论波兰文化、旅行、移民社区或翻译文本时。","kwarterka 字面上与“quarter（四分之一）”相关，通常指 1/4 升（约 250 ml）的容量；在波兰还常见 0.5 升（“pół litra”）等说法。"]}
{"word":"kwartje","summary":{"en":"Kwartje is a Dutch word for the old 25-cent coin (a quarter guilder), and it can also mean a small amount of money.","zh":"Kwartje 是荷兰语，指旧时的25分硬币（四分之一荷兰盾），也可泛指“小钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Dutch 25-cent coin (one quarter of a guilder), used before the euro; by extension, a small amount of money","zh":"（欧元启用前）荷兰的25分硬币（相当于1/4荷兰盾）；也可引申为“一点钱、小钱”"},"examples":[{"en":"I only have a kwartje left—can it cover the tip?","zh":"我只剩一个kwartje了——够付小费吗？"},{"en":"Back then, a phone call could cost a kwartje.","zh":"那时候打个电话可能要花一个kwartje。"}]}],"synonyms":["quarter","twenty-five-cent coin","small change"],"phonetic":"/ˈkvɑr(t)ʃə/","extraExplanation":["“kwartje”来自“kwart”（四分之一），原本指“1/4荷兰盾”的硬币面额。2002年荷兰改用欧元后，这个词在日常里更多出现在回忆或固定表达中。","常见习语：het kwartje valt（字面“那个kwartje掉下来了”），意思相当于英语的“the penny drops / it clicks”，指“终于明白了、恍然大悟”。"]}
{"word":"kwashiorkor","summary":{"en":"Kwashiorkor is a severe protein-deficiency disease, especially in children, often causing swelling and poor growth.","zh":"Kwashiorkor（夸希奥科病）是以蛋白质严重缺乏为主的重度营养不良，常见于儿童，可导致水肿与发育不良。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a serious disease in children caused by severe lack of protein (often with enough calories from starches), leading to swelling (edema), a swollen belly, poor growth, and weakened immunity","zh":"夸希奥科病（常见于儿童的一种严重营养不良疾病）：主要由于蛋白质严重缺乏（有时热量来自淀粉类食物仍相对充足）引起，表现为水肿、腹部膨隆、生长发育不良、免疫力下降等"},"examples":[{"en":"The clinic treated several children with kwashiorkor after a long period of food shortage.","zh":"在长期食物短缺之后，这家诊所治疗了几名患夸希奥科病的儿童。"},{"en":"A swollen belly and puffy feet can be signs of kwashiorkor, but a doctor must confirm the diagnosis.","zh":"腹部膨隆和脚部浮肿可能是夸希奥科病的迹象，但需要医生确诊。"},{"en":"Public health programs focus on preventing kwashiorkor by improving access to protein-rich foods.","zh":"公共卫生项目通过改善蛋白质丰富食物的可获得性来预防夸希奥科病。"}]}],"synonyms":["protein-energy malnutrition (type: kwashiorkor)","severe malnutrition"],"phonetic":"/ˌkwɑːʃiˈɔːrkər/","extraExplanation":["“kwashiorkor”一词源自西非（常说来自加纳的加语/阿坎语相关表达），常被解释为“（新生儿出生后）被迫断奶的孩子”等含义，反映了在食物与照护条件不足时，幼儿在断奶后更容易发生蛋白质缺乏。","学习时可与“marasmus（消瘦型营养不良，热量与蛋白质都严重不足）”对比：kwashiorkor常见水肿、腹胀等；marasmus更典型的是明显消瘦。两者都属于严重营养不良，需要专业医疗与营养干预。","这是医学与公共卫生语境中的词汇，涉及贫困、粮食安全与儿童健康等议题；在写作或讨论时注意避免将疾病与特定地区或人群刻板化地绑定，强调结构性因素与可行的预防措施会更合适。"]}
{"word":"kwatuma","summary":{"en":"“Kwatuma” is usually a proper name, not a standard English word.","zh":"“Kwatuma”通常是人名/姓氏，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (most commonly a Ghanaian/Akan name or surname). It is not a standard English vocabulary word.","zh":"一个专有名词（最常见为加纳/阿坎语系地区的人名或姓氏）。它不是标准英语词汇。"},"examples":[{"en":"Mr. Kwatuma will join the meeting at 3 p.m.","zh":"Kwatuma 先生将于下午三点参加会议。"},{"en":"I saw the name “Kwatuma” on the class list.","zh":"我在班级名单上看到了“Kwatuma”这个名字。"}]}],"phonetic":"/kwɑːˈtuːmə/","extraExplanation":["“Kwatuma”在英语词典里通常查不到作为普通词的固定含义，更常见的是作为人名/姓氏（例如西非加纳地区较常见）。","如果你是在写作或聊天中想表达英语单词，你可能想写的是 **quantum**（量子）或 **Kwartuma/Kwatuma** 等拼写变体。你可以告诉我它出现的句子或语境，我可以帮你确认准确拼写和意思。"]}
{"word":"kwaznku","summary":{"en":"“kwaznku” doesn’t appear to be a recognized English word. Please share the context or the intended spelling.","zh":"“kwaznku”不像是可识别的英文单词。请提供上下文或你想输入的正确拼写。"},"phonetic":"N/A","extraExplanation":["我在常见英语词典、俚语与缩写中找不到“kwaznku”，它看起来不像标准英文单词，可能是：拼写错误、用户名/代号、某种语言的转写，或你想查的词被键盘误输入。","你可以把它放进一个句子里，或告诉我你在哪里看到的（聊天、游戏、歌曲、课本等），我就能更准确判断。","如果你想查的是类似发音的英文词，可能需要你提供目标含义（例如“奇怪的”“夸张的”“某个品牌/地名”等），我也可以根据你的描述帮你反推正确拼写。"]}
{"word":"kwazoku","summary":{"en":"“Kwazoku” likely refers to Japanese “kazoku,” meaning “family.”","zh":"“kwazoku”很可能指日语“kazoku（家族）”，意思是“家人/家庭”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Japanese) a family; one’s family members as a group.","zh":"（源自日语）家人；家庭（作为一个整体）。"},"examples":[{"en":"In Japanese, “kazoku” means “family.”","zh":"在日语里，“kazoku” 的意思是“家人/家庭”。"},{"en":"The film focuses on a kazoku trying to stay together.","zh":"这部电影聚焦于一个家庭努力维系在一起。"}]}],"synonyms":["family","household","kazoku"],"phonetic":"/kɑːˈzoʊku/","extraExplanation":["“kwazoku”在英文语境里并不常见；多数情况下你想写的是日语罗马字“kazoku（家族）”。“kwa-”这种拼法可能来自听写、输入法或非标准转写。","在英语中提到日本文化（如影视、动漫、社会议题）时，有时会直接借用“kazoku”来强调“日式家庭/家族观念”的语境；一般日常英文仍用“family”。"]}
{"word":"kweilo","summary":{"en":"“Kweilo” is a Cantonese-derived slang word for a white (often Western) foreigner, and it is frequently considered offensive.","zh":"“kweilo”源自粤语的俚语，指白人（常指西方）外国人，且常被视为带冒犯性的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Cantonese loanword) A slang, often offensive term for a white foreigner, especially in Hong Kong; sometimes used more generally for a Western foreigner.","zh":"（粤语外来词）对“白人外国人”的俚语称呼，常带冒犯意味，尤指香港语境；有时也泛指西方外国人。"},"examples":[{"en":"In the film, a local character calls the tourist “kweilo,” and the scene shows it as disrespectful.","zh":"在那部电影里，本地角色称游客为“kweilo”，剧情表现这是不尊重的说法。"},{"en":"Some people use the word casually, but many consider it a slur, so it’s best to avoid it.","zh":"有些人会随口用这个词，但很多人认为它是贬称，所以最好避免使用。"}]}],"synonyms":["foreigner","Westerner","expat (context-dependent)","white foreigner (descriptive)"],"phonetic":"ˈkweɪloʊ","extraExplanation":["“kweilo”来自粤语“鬼佬”（gwái lóu），字面意思是“鬼/妖怪 + 男人/家伙”，因此容易带有“把外国人当作异类”的贬义。实际语气因说话者、场合与关系而变化：朋友间可能被当作玩笑，但在正式场合或对陌生人使用通常不礼貌。英语写作或跨文化交流中，建议用更中性的表达，如 “foreigner,” “expat,” “Western visitor,” 或直接用国籍/身份。"]}
{"word":"kwekwlo","summary":{"en":"“kwekwlo” is not a recognized English word; context is needed to identify what it means.","zh":"“kwekwlo”不是可识别的英语单词；需要语境才能判断含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “kwekwlo” does not appear in common English dictionaries and may be a misspelling, a username/name, or a word from another language.","zh":"不是标准英语单词。“kwekwlo”在常见英语词典中找不到，可能是拼写错误、用户名/人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “kwekwlo” in an English dictionary—can you share a sentence with it?","zh":"我在英语词典里找不到“kwekwlo”——你能给我一个包含它的句子吗？"},{"en":"Did you mean “kwek” or “kek,” or is “kwekwlo” a name?","zh":"你是想写“kwek”还是“kek”，还是说“kwekwlo”是一个名字？"}]}],"extraExplanation":["你可以告诉我它出现的语境（在哪本书/哪条评论/哪段对话里），我就能更准确判断它是什么：\n1）是否是拼写错误（比如键盘误触/漏字母）；\n2）是否是某种网络用语、游戏ID、昵称；\n3）是否来自某种语言（例如加纳、菲律宾或印尼等地的名字/词）。\n如果你把原句贴出来，我也可以帮你推测最可能的正确拼写与含义。"]}
{"word":"kwela","summary":{"en":"Kwela is a lively South African street-music style, especially known for pennywhistle tunes.","zh":"Kwela 是一种活泼的南非街头音乐风格，尤以便士哨笛旋律著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively South African style of street music, traditionally played on the pennywhistle (and later with saxophone, guitar, etc.), popular especially in the 1950s.","zh":"一种充满活力的南非街头音乐风格，最初多由“便士哨笛”（pennywhistle）演奏，后来也加入萨克斯、吉他等乐器；在20世纪50年代尤为流行。"},"examples":[{"en":"My grandfather still loves kwela from the 1950s.","zh":"我祖父到现在还很喜欢20世纪50年代的kwela音乐。"},{"en":"We heard kwela pennywhistles outside the market.","zh":"我们在市场外听到了kwela风格的便士哨笛声。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to this music style.","zh":"与kwela音乐风格有关的；kwela风格的。"},"examples":[{"en":"The band played a kwela rhythm to open the show.","zh":"乐队用kwela节奏为演出开场。"},{"en":"She’s learning a kwela tune on the pennywhistle.","zh":"她正在用便士哨笛学习一首kwela曲子。"}]}],"synonyms":["pennywhistle music","South African street music"],"phonetic":"/ˈkweɪlə/","extraExplanation":["“Kwela”一词常被认为与南非的语言环境有关：在一些说法里，它与“上车/登上（警车或车）”之类的口语用法相关，带有当时城市街头文化与社会背景的影子。作为音乐名词时，它更多指一种轻快、适合舞动的节奏与街头演奏传统。","学习时可联想：kwela 常与 pennywhistle（便士哨笛）一起出现，属于南非流行音乐史的重要一页，也影响了后来的 mbaqanga 等风格。"]}
{"word":"kwetwer","summary":{"en":"“kwetwer” isn’t a recognized English word; it’s likely a misspelling or a name.","zh":"“kwetwer”不是常见英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name.","zh":"不是标准英语单词，可能是拼写错误或人名/地名。"},"examples":[{"en":"I can’t find “kwetwer” in an English dictionary—did you mean “whatever” or “quitter”?","zh":"我在英语词典里找不到“kwetwer”——你是不是想写“whatever”或“quitter”？"},{"en":"Please send the full sentence where you saw “kwetwer” so I can guess the intended word.","zh":"请把你看到“kwetwer”的完整句子发我，这样我才能推测你原本想表达的词。"}]}],"phonetic":"/ˈkwɛtwər/","extraExplanation":["“kwetwer”很像键盘误打或按发音拼写出来的字母组合。常见接近的目标词可能有：\n- whatever（“不管怎样/随便”）\n- quitter（“轻言放弃的人”）\n- quieter（“更安静的”）\n如果你把它出现的上下文句子、想表达的意思、或来源（歌词/聊天/游戏ID等）告诉我，我可以更准确地帮你定位正确单词并解释用法。"]}
{"word":"kwhr","summary":{"en":"“kwhr” usually means kilowatt-hour (kWh), a unit of electrical energy used for billing and measuring electricity use.","zh":"“kwhr”通常指千瓦时（kWh），一种用于计费和衡量用电量的电能单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kilowatt-hour (kWh): a unit of energy equal to using 1 kilowatt of power for 1 hour, commonly used to measure electricity consumption","zh":"千瓦时（kWh）：一种能量单位，表示以1千瓦的功率持续使用1小时所消耗（或产生）的能量，常用于计量用电量"},"examples":[{"en":"My apartment used 320 kWh of electricity last month.","zh":"我公寓上个月用了320千瓦时的电。"},{"en":"This heater consumes about 2 kWh if it runs for one hour at full power.","zh":"这个取暖器如果以最大功率运行一小时，大约消耗2千瓦时。"},{"en":"Electricity is billed per kWh on your utility statement.","zh":"电费账单通常按每千瓦时计费。"}]}],"synonyms":["kWh","kilowatt-hour","kilowatt hour"],"phonetic":"/ˈkɪləˌwɑːt ˈaʊər/","extraExplanation":["“kWh/千瓦时”是能量单位；“kW/千瓦”是功率单位。功率表示“用得有多快”，能量表示“一共用了多少”。例如：2 kW 的电器开 3 小时 = 6 kWh。","写法上更常见的是 kWh（k 小写、W 和 h 大小写按惯例）。你输入的 “kwhr/kwhr” 在口语或非正式记录里有时会见到，但在账单、说明书和正规文本中通常用 kWh 或写全 kilowatt-hour。"]}
{"word":"kwi","summary":{"en":"KWI is most commonly the airport code for Kuwait International Airport; in other contexts it may be an acronym with a local meaning.","zh":"KWI 最常见是科威特国际机场的三字机场代码；在其他语境中也可能是某种需要由上下文确定含义的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation most commonly used as the IATA airport code for Kuwait International Airport (Kuwait City).","zh":"常见缩写：科威特国际机场（科威特城）的 IATA 机场代码。"},"examples":[{"en":"My flight lands at KWI at 6:30 p.m.","zh":"我的航班晚上 6:30 抵达 KWI（科威特国际机场）。"},{"en":"Please confirm the route: DXB → KWI → LHR.","zh":"请确认航线：DXB → KWI → LHR。"}]},{"partOfSpeech":"other","definition":{"en":"A less common abbreviation that may appear in specific fields or organizations with a meaning defined by that context (for example, an internal project name).","zh":"较少见：在特定领域/组织中使用的缩写，其含义由具体语境决定（例如内部项目代号）。"},"examples":[{"en":"In this document, KWI refers to our “Key Workflow Indicator.”","zh":"在这份文件里，KWI 指我们的“关键工作流指标”。"},{"en":"Could you tell me what KWI stands for here?","zh":"你能告诉我这里的 KWI 代表什么吗？"}]}],"synonyms":["Kuwait International Airport"],"phonetic":"/kwi/","extraExplanation":["KWI 作为“机场三字代码”最常见。机票、登机牌、行程单里常用这种三字母代码（如 JFK、LAX、HND）。如果你是在别的场景看到 KWI（例如报告或聊天记录），最好向对方确认它在该语境中的全称。"]}
{"word":"kwintra","summary":{"en":"“kwintra” is not a standard English word; it’s likely a name or a misspelling.","zh":"“kwintra”不是标准英语词；更可能是名字/专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a username, brand, place name) or a misspelling of another word.","zh":"不是标准英语词汇。更可能是专有名词（如用户名、品牌名、地名）或某个单词的拼写错误。"},"examples":[{"en":"I couldn’t find “kwintra” in an English dictionary—could it be a username or a product name?","zh":"我在英语词典里查不到“kwintra”——它会不会是用户名或产品名？"},{"en":"If you meant “winter,” the spelling is different: w-i-n-t-e-r.","zh":"如果你想写“winter（冬天）”，拼写不一样：w-i-n-t-e-r。"}]}],"phonetic":"ˈkwɪntrə","extraExplanation":["“kwintra”看起来像是非英语来源的拼写（例如姓名、网名或品牌）。如果你把它放在一个句子里，或告诉我它来自哪里（游戏/社交平台/文章/歌词等），我可以更准确判断它的含义。","可能的混淆词：winter（冬天）、quintet（五重奏）、quinine（奎宁）。请确认你要查的是否是其中之一或相近拼写。"]}
