{"word":"ky","summary":{"en":"KY most commonly means Kentucky (U.S. state abbreviation). It can also refer informally to the brand KY Jelly.","zh":"KY 最常见指美国肯塔基州的缩写；也可非正式地指 KY Jelly（润滑剂）品牌。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the U.S. postal abbreviation for the state of Kentucky","zh":"美国肯塔基州（Kentucky）的邮政缩写"},"examples":[{"en":"I’m moving to KY for a new job.","zh":"我因为新工作要搬去肯塔基州（KY）。"},{"en":"Please ship the package to Louisville, KY.","zh":"请把包裹寄到肯塔基州路易维尔（Louisville, KY）。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, brand name) a common short name for KY Jelly, a water-based personal lubricant","zh":"（非正式/品牌名）KY Jelly 的简称，一种水性润滑剂"},"examples":[{"en":"They bought KY at the pharmacy.","zh":"他们在药店买了 KY（润滑剂）。"},{"en":"The doctor recommended using a water-based lubricant like KY.","zh":"医生建议使用像 KY 这样的水性润滑剂。"}]}],"synonyms":["Kentucky"],"phonetic":"/ˌkeɪˈwaɪ/","extraExplanation":["“KY”最常见是美国州名缩写：Kentucky（肯塔基州）。在地址里写“City, KY”是标准写法。","“KY”也常被当作品牌简称，指 KY Jelly（润滑剂）。在正式写作中更建议写全名以避免误解。"]}
{"word":"kyabuka","summary":{"en":"“kyabuka” isn’t an English word; it likely needs context (name/romanization) to interpret.","zh":"“kyabuka”不是英文词；很可能需要语境（人名/罗马字）才能解释。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a name, a username, or a romanized spelling from another language (for example, Japanese), but its meaning cannot be confirmed without context.","zh":"不是标准英文单词。它可能是人名、用户名，或来自其他语言（例如日语）的罗马字拼写；但在缺少语境时无法确定具体含义。"},"examples":[{"en":"I saw “kyabuka” in a comment, but I’m not sure what it refers to.","zh":"我在评论里看到“kyabuka”，但不确定它指什么。"},{"en":"Is “kyabuka” a person’s name or a word from another language?","zh":"“kyabuka”是人名还是其他语言的词？"}]}],"phonetic":"/ˌkjaˈbuːkə/","extraExplanation":["“kyabuka”看起来像外来语的罗马字拼写（例如日语把片假名写成拉丁字母），但不同拼写可能对应完全不同的词。","如果你能提供：①出现的句子/上下文；②它来自哪里（游戏、动漫、社交平台、歌曲等）；③你想表达的意思（比如‘卷心菜’‘出租车’‘某个角色’），我可以更准确地判断并给出对应词条。"]}
{"word":"kyack","summary":{"en":"“Kayak” is a small boat you paddle with a double-bladed paddle; it can also mean the activity of paddling one.","zh":"“Kayak”指用双叶桨划行的小船（皮划艇），也可作动词表示“划皮划艇”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, narrow boat (often with a covered top) that you move using a double-bladed paddle, used for recreation, sport, or travel on water","zh":"皮划艇；一种又窄又小的船（常带封闭式座舱），用双叶桨划行，用于休闲、运动或水上出行"},"examples":[{"en":"We rented a kayak and paddled around the lake.","zh":"我们租了一艘皮划艇，在湖上划了一圈。"},{"en":"She wears a life jacket whenever she goes kayaking.","zh":"她每次去划皮划艇都会穿救生衣。"}]},{"partOfSpeech":"v.","definition":{"en":"to travel in a kayak","zh":"划皮划艇；乘皮划艇航行"},"examples":[{"en":"They kayak along the coast every summer.","zh":"他们每年夏天都会沿着海岸划皮划艇。"},{"en":"I’m learning to kayak in calm water first.","zh":"我先在平静水域学习划皮划艇。"}]}],"synonyms":["canoe (similar, but different shape/paddle style)","paddle (v., related activity)"],"phonetic":"/ˈkaɪæk/","extraExplanation":["你写的 **kyack** 通常是拼写错误，更常见、标准的拼写是 **kayak**。","**kayak** 这个词来源于因纽特（Inuit）等北极地区原住民语言，原本指适合寒冷海域使用的小型船只。"]}
{"word":"kyacks","summary":{"en":"“Kyacks” is most likely a misspelling of “kayaks,” meaning the plural of “kayak” (the boat), or the verb form “kayaks” (does kayaking).","zh":"“kyacks”多半是“kayaks”的拼写错误：可以指“kayak（皮划艇）”的复数，也可以指动词第三人称单数“kayaks（在划皮划艇）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “kayak”: small, narrow boats that you sit in and move with a double-bladed paddle, often used for sport or travel on rivers, lakes, or the sea.","zh":"“kayak”的复数：皮划艇/独木舟（一种狭长的小船，人坐在船内，用双叶桨划行，常用于运动或水上旅行）。"},"examples":[{"en":"We rented two kayaks and paddled around the lake.","zh":"我们租了两条皮划艇，在湖上划了一圈。"},{"en":"Kayaks are popular for exploring calm coastal waters.","zh":"皮划艇很适合在平静的海岸水域探险。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of “kayak”: to travel in a kayak; to paddle a kayak.","zh":"“kayak”的第三人称单数：划皮划艇；乘皮划艇航行。"},"examples":[{"en":"She kayaks every weekend when the weather is nice.","zh":"天气好的时候，她每个周末都会去划皮划艇。"},{"en":"He kayaks down the river after work to relax.","zh":"他下班后会顺河划皮划艇放松。"}]}],"synonyms":["canoes (not identical)","paddle boats (general)"],"phonetic":"/ˈkaɪæk/","extraExplanation":["“kyacks”通常是“kayaks”的拼写误写；更常见的正确拼写是 kayak（单数）/ kayaks（复数）。","“kayak”一词来自因纽特（Inuit）相关语言，原本指在寒冷海域使用的小型船只。"]}
{"word":"kyah","summary":{"en":"“Kyah” is usually an informal South Asian texting spelling meaning “what?”; sometimes it’s just a username or name.","zh":"“Kyah”通常是南亚语境中的聊天拼写，表示“什么？”；有时也只是用户名或名字。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(South Asian informal, texting) A casual spelling of “kya?” meaning “what?”; used to ask for clarification or show surprise.","zh":"（南亚地区非正式/聊天用语）“kya?” 的随意拼写，意思是“什么？”；用于询问不清楚的内容或表示惊讶。"},"examples":[{"en":"Kyah? I didn’t catch that—can you say it again?","zh":"Kyah？我没听清——你能再说一遍吗？"},{"en":"Kyah, you already finished the project?","zh":"Kyah，你已经把项目做完了？"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A name/handle (nickname) used online; not a standard English word.","zh":"（少见）网络上的名字/ID（昵称）；不是标准英语词。"},"examples":[{"en":"Kyah posted a new video last night.","zh":"Kyah 昨晚发了一个新视频。"}]}],"synonyms":["what?","huh?","pardon?","really?"],"phonetic":"/kjɑ/","extraExplanation":["“kyah”常见于受印地语/乌尔都语影响的英语语境（例如南亚英语、网络聊天）。对应的原词多写作“kya”，在印地语/乌尔都语里相当于英语的“what”。拼成“kyah”通常只是为了更贴近口语发音或强调语气。"]}
{"word":"kyak","summary":{"en":"“Kyak” is usually a misspelling of “kayak,” a small boat you paddle with a double-bladed paddle.","zh":"“kyak”通常是“kayak”的拼写错误；“kayak”指用双头桨划的皮划艇/独木舟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common misspelling or informal variant of “kayak,” a small, narrow boat moved with a double-bladed paddle.","zh":"“kayak（皮划艇/独木舟）”的常见拼写错误或非正式写法；指一种狭长的小船，用双头桨划行。"},"examples":[{"en":"I think you mean “kayak,” not “kyak.”","zh":"我觉得你想写的是“kayak”，不是“kyak”。"},{"en":"We rented a kayak and paddled on the lake.","zh":"我们租了一艘皮划艇，在湖上划行。"}]}],"synonyms":["kayak","canoe (similar, but not the same)"],"phonetic":"/ˈkaɪæk/","extraExplanation":["“Kayak”源自因纽特（Inuit）语言，最早指北极地区使用的轻便小船。英语里标准拼写是 kayak；“kyak”通常只是打字/拼写颠倒（把 a 和 y 位置写反）或随意写法。","有趣的是，kayak 还是著名的英文回文词（palindrome）：正着倒着拼写都一样（k-a-y-a-k）。"]}
{"word":"kyaks","summary":{"en":"“Kyaks” usually refers to “kayaks,” the plural of “kayak” (a small paddle boat).","zh":"“kyaks”通常是“kayaks”的写法/拼写错误，指“kayak（皮划艇）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “kayak”) a small, narrow boat moved with a double-bladed paddle, often used for recreation or fishing.","zh":"（“kayak”的复数）皮划艇：一种细长的小船，用双叶桨划行，常用于休闲或钓鱼。"},"examples":[{"en":"We rented two kayaks and paddled across the lake.","zh":"我们租了两条皮划艇，划过了湖面。"},{"en":"These kayaks are light enough to carry to the river.","zh":"这些皮划艇很轻，轻到可以搬到河边。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common spelling) “kyaks” is often a misspelling of “kayaks.”","zh":"（较少见的拼写）“kyaks”常见于把“kayaks”拼错的情况。"},"examples":[{"en":"Did you mean “kayaks” (boats) instead of “kyaks”?","zh":"你是想写“kayaks”（皮划艇）而不是“kyaks”吗？"}]}],"synonyms":["canoes (similar but not the same)","paddle boats (general)"],"phonetic":"/ˈkaɪæk/","extraExplanation":["“kayak”一词源自因纽特语系（Inuit/Yupik）中表示“猎人小船”的词，后来进入英语并普及。","正确拼写是 kayak（单数）/ kayaks（复数）。在搜索或写作中用正确拼写更容易被理解。"]}
{"word":"kyang","summary":{"en":"Kyang means the Tibetan wild ass (also spelled kiang).","zh":"kyang 指“藏野驴”（也常拼作 kiang）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kiang; the Tibetan wild ass, a large, reddish-brown wild donkey native to the Tibetan Plateau.","zh":"（同 kiang）藏野驴；一种原产于青藏高原、体型较大的野生驴类动物，毛色多呈红褐色。"},"examples":[{"en":"The kyang can survive in cold, dry high-altitude grasslands.","zh":"藏野驴能在寒冷、干燥的高海拔草原上生存。"},{"en":"Wildlife researchers photographed a small herd of kyang near a salt lake.","zh":"野生动物研究人员在盐湖附近拍到了一小群藏野驴。"}]}],"synonyms":["kiang","Tibetan wild ass"],"phonetic":"/ˈkiɑŋ/","extraExplanation":["“kyang”常被视为“kiang”的另一种拼写，来源与藏语对这种动物的称呼有关。英语里更常见的拼写是“kiang”。","它主要生活在青藏高原等高海拔地区，常出现在自然纪录片、野生动物文章或旅行写作中。"]}
{"word":"kyanise","summary":{"en":"“Kyanise” is likely a misspelling of “cyanise/cyanize,” meaning to treat with cyanide or to tint something cyan.","zh":"“kyanise”很可能是“cyanise/cyanize”的误拼，意思是用氰化物处理，或把某物调成青色（蓝绿色）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat or expose something to cyanide (often in metallurgy or chemistry)","zh":"（常用于冶金或化学）用氰化物处理；使接触氰化物"},"examples":[{"en":"Some metals are cyanised to harden the surface.","zh":"有些金属会进行氰化处理，以使表面更硬。"},{"en":"The ore was cyanised to help extract the gold.","zh":"矿石经过氰化处理，以帮助提取黄金。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something cyan (a greenish-blue color); to tint cyan","zh":"使呈青色/蓝绿色；把……染成青色"},"examples":[{"en":"The designer cyanised the background to make the text stand out.","zh":"设计师把背景调成青色，让文字更显眼。"}]}],"synonyms":["cyanise","cyanize","treat with cyanide","tint cyan","blue-green tint"],"phonetic":"/ˈsaɪənaɪz/","extraExplanation":["“kyanise”并不是常见的标准拼写。你可能想查的是 **cyanise**（英式拼写）/ **cyanize**（美式拼写）。两者意思相同。","在冶金语境里，cyanise 常指与“渗碳/表面硬化”相关的氰化处理；在日常英语中很少用到。"]}
{"word":"kyanised","summary":{"en":"“Kyanised” means preserved (usually wood) using the historical Kyan chemical treatment to prevent decay.","zh":"“kyanised”指（多为木材）使用历史上的凯恩化学防腐处理以防腐烂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with a chemical preservative (especially mercuric chloride) to prevent wood from decaying; preserved by the “Kyan process.”","zh":"（尤指用氯化汞等防腐剂）进行防腐处理的；经“凯恩法（Kyan process）”处理而防腐的（多用于木材）。"},"examples":[{"en":"The kyanised timber resisted rot better than untreated wood.","zh":"经凯恩法处理的木材比未处理的木材更耐腐。"},{"en":"They used kyanised sleepers for the railway line in wet ground.","zh":"在潮湿地段，他们使用了经过凯恩法防腐处理的铁路枕木。"}]}],"synonyms":["preserved","treated","impregnated","rot-resistant"],"phonetic":"/ˈkaɪəˌnaɪzd/","extraExplanation":["“kyanised”（也常写作 Kyanized）来自 19 世纪的木材防腐技术，名称源于英国发明者 John Howard Kyan。该方法以氯化汞为代表性药剂来防腐，但由于汞的毒性与环境风险，如今更多见于历史文献或旧式工程材料的描述。"]}
{"word":"kyanises","summary":{"en":"“kyanises” is not standard spelling; it most likely means **cyanosis**, a bluish discoloration caused by low blood oxygen.","zh":"“kyanises”不是标准拼写；它很可能指 **cyanosis（发绀）**，即因血氧不足导致皮肤等部位发蓝紫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) Refers to **cyanosis**: a bluish or purplish color of the skin, lips, or nails caused by low oxygen in the blood.","zh":"（可能是拼写错误）指 **cyanosis（发绀）**：由于血液含氧量不足，皮肤、嘴唇或指甲呈现蓝紫色的现象。"},"examples":[{"en":"The nurse noticed **cyanosis** around his lips and checked his oxygen level right away.","zh":"护士注意到他嘴唇周围出现**发绀**，立刻检查了血氧水平。"},{"en":"In severe asthma attacks, **cyanosis** can be a warning sign that the body is not getting enough oxygen.","zh":"在严重哮喘发作时，**发绀**可能是身体缺氧的警示信号。"}]}],"synonyms":["bluish discoloration","skin blueness"],"phonetic":"/ˌsaɪəˈnoʊsɪs/","extraExplanation":["“kyanises”在常见英语词典中并不是标准拼写。你可能想写的是 **cyanosis**（发绀，名词），其复数通常写作 **cyanoses**。","词根提示：**cyan-** 来自希腊语，表示“蓝色”（如 cyan 蓝绿色、cyanide 氰化物等）。"]}
{"word":"kyanising","summary":{"en":"Kyanising is a historical method (and the act) of preserving wood with chemicals to prevent rot and insects.","zh":"Kyanising 指一种历史上的木材化学防腐方法（也可指进行该处理的动作），用来防腐烂、防虫蛀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of preserving wood by soaking it in a chemical solution (historically mercuric chloride) to prevent rot and insect damage","zh":"木材“凯安防腐处理”：把木材浸泡在化学溶液中（历史上多用氯化汞）以防腐烂、虫蛀的处理方法"},"examples":[{"en":"The old railway sleepers were kyanised to slow down decay in wet ground.","zh":"旧铁路枕木做过凯安防腐处理，以减缓在潮湿地面中的腐朽。"},{"en":"In the 19th century, some builders preferred kyanising for timber used near water.","zh":"在19世纪，一些建造者更偏好对靠近水的木材进行凯安防腐处理。"}]},{"partOfSpeech":"v.","definition":{"en":"to preserve wood using the kyanising method","zh":"用“凯安法”对木材进行防腐处理"},"examples":[{"en":"They kyanised the beams before installing them in the basement.","zh":"他们在把梁装进地下室之前先做了凯安防腐处理。"},{"en":"This kind of wood was once kyanised, but the chemicals later proved too toxic for common use.","zh":"这种木材曾经做过凯安防腐处理，但后来发现这些化学品毒性太强，不再适合普遍使用。"}]}],"synonyms":["wood preservation","timber treatment","chemical wood treatment","kyanizing"],"phonetic":"/ˈkaɪəˌnaɪzɪŋ/","extraExplanation":["“Kyanising/kyanizing”源自英国人 John Howard Kyan（约19世纪），他推广用氯化汞溶液给木材防腐；因为氯化汞毒性很强，这种方法后来多被更安全或更可控的防腐工艺取代。","拼写上英式常见 kyanising，美式常见 kyanizing；多见于历史、工程或文献语境，日常英语较少用。"]}
{"word":"kyanite","summary":{"en":"Kyanite is a typically blue mineral with blade-like crystals, used as a gemstone and in heat-resistant industrial products.","zh":"Kyanite（蓝晶石）是一种多为蓝色、呈刀片状晶体的矿物，可作宝石，也用于耐高温工业材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blue (sometimes green, gray, or white) mineral that forms in long blade-like crystals and is used as a gemstone and in high-heat industrial materials.","zh":"一种常见为蓝色（也可能呈绿、灰或白色）的矿物，常形成细长刀片状晶体；可作宝石，也可用于耐高温的工业材料。"},"examples":[{"en":"Kyanite is often cut into jewelry, but its crystals are usually long and thin.","zh":"蓝晶石常被切磨成首饰，但它的晶体通常又长又薄。"},{"en":"Some factories use kyanite to make heat-resistant ceramics.","zh":"一些工厂用蓝晶石制作耐高温陶瓷。"},{"en":"The rock sample contains quartz and kyanite, suggesting it formed under high pressure.","zh":"这块岩石样品含有石英和蓝晶石，说明它可能在高压环境下形成。"}]}],"synonyms":["aluminosilicate mineral","blue crystal (informal)"],"phonetic":"/ˈkaɪəˌnaɪt/","extraExplanation":["“kyanite”一词来自希腊语 *kyanos*，意为“深蓝色”，因此中文常译为“蓝晶石”。","在地质学中，蓝晶石是重要的“变质指示矿物”：它常出现在高压变质环境（如俯冲带相关的岩石）中。","学习相关词：*crystal*（晶体）、*gemstone*（宝石）、*mineral*（矿物）、*metamorphic rock*（变质岩）。"]}
{"word":"kyanites","summary":{"en":"“Kyanites” is the plural of “kyanite,” a crystal mineral (often blue) found in metamorphic rocks.","zh":"“Kyanites” 是 “kyanite（蓝晶石）” 的复数，指常见于变质岩中的（多为蓝色的）晶体矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Kyanites are crystals of the mineral kyanite, usually blue, that form in metamorphic rocks and are used in geology and sometimes as gemstones or industrial materials.","zh":"Kyanites 是矿物“蓝晶石（kyanite）”的晶体（常呈蓝色），形成于变质岩中，用于地质研究，也有时作为宝石或工业材料。"},"examples":[{"en":"The geologist found kyanites in the metamorphic rock sample.","zh":"地质学家在那块变质岩样品中发现了蓝晶石晶体（kyanites）。"},{"en":"Some kyanites have a deep blue color and can be cut for jewelry.","zh":"有些蓝晶石晶体呈深蓝色，可以切割后用于首饰。"}]}],"synonyms":["kyanite","disthene","aluminosilicate (mineral)"],"phonetic":"ˈkaɪəˌnaɪt","extraExplanation":["“kyanite/蓝晶石”一词来自希腊语 *kyanos*（意为“蓝色”），因为它常见的颜色是蓝色，但也可能呈白色、灰色或绿色。","蓝晶石是铝硅酸盐矿物，常作为变质作用条件（压力与温度）的指示矿物；在工业上也可用于耐火材料等。","拼写提示：单数是 *kyanite*，复数是 *kyanites*。"]}
{"word":"kyanization","summary":{"en":"Kyanization is an old method of preserving wood by chemical treatment to resist rot and insects.","zh":"Kyanization 指一种较早期的木材化学防腐处理法，用于防腐朽与防虫蛀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wood-preservation process in which timber is treated (traditionally with mercuric chloride) to prevent decay, rot, and insect damage","zh":"一种木材防腐处理法（传统上用氯化汞处理木材），用于防止腐朽、霉烂和虫蛀"},"examples":[{"en":"The museum records mention kyanization as an early method for preserving railway sleepers.","zh":"博物馆的档案提到，“Kyanization（凯恩防腐法）”曾是早期保存铁路枕木的方法之一。"},{"en":"Because of toxicity concerns, kyanization is now mainly discussed in historical accounts rather than used in modern practice.","zh":"由于毒性问题，如今“kyanization”更多出现在历史资料中，而不是现代实际应用。"}]}],"synonyms":["wood preservation","timber treatment","chemical wood treatment"],"phonetic":"/ˌkaɪ.ən.aɪˈzeɪ.ʃən/","extraExplanation":["“kyanization”源自19世纪英国化学家John Howard Kyan 的姓氏（Kyan），是一种以人物命名的工艺名词。","传统配方常涉及氯化汞（mercuric chloride），属于高毒物质；因此这一方法在现代已基本被更安全的防腐剂与工艺取代，常见于工业史、铁路史或材料保护史的语境中。","学习与记忆：词尾“-ization”常表示“……化/处理/过程”（如 modernize → modernization），因此 kyanization 可理解为“用Kyan的方法进行处理的过程”。"]}
{"word":"kyanize","summary":{"en":"Kyanize means to chemically treat wood to preserve it, historically using mercuric chloride.","zh":"Kyanize 指用化学药剂对木材进行防腐处理，历史上多指用氯化汞。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to preserve wood (or sometimes other materials) by treating it with a chemical—especially mercuric chloride—to protect it from rot, insects, or fungi","zh":"（用化学药剂，尤指氯化汞）处理木材等，使其防腐、防虫、防霉"},"examples":[{"en":"The railroad ties were kyanized to slow down decay in damp conditions.","zh":"这些铁路枕木经过氯化汞防腐处理，以减缓潮湿环境中的腐烂。"},{"en":"In the 1800s, builders sometimes kyanized timber for outdoor structures.","zh":"在19世纪，建筑工人有时会对户外用材进行氯化汞防腐处理。"}]}],"synonyms":["preserve","treat (wood)","impregnate","wood-preserve"],"phonetic":"/ˈkaɪəˌnaɪz/","extraExplanation":["“kyanize”源自19世纪英国发明家 John Howard Kyan 的防腐工艺（Kyan process）。该方法用氯化汞浸渍木材来抑制腐朽。由于氯化汞具有高毒性，现代已较少使用，更多见于历史、工业史或旧文献中。","拼写上也可能见到英式变体 “kyanise”。"]}
{"word":"kyanized","summary":{"en":"Kyanized means chemically preserved (especially wood) using Kyan’s historical anti-rot treatment.","zh":"Kyanized 指（尤指木材）经过“凯恩防腐法”化学处理而被防腐、防虫、防腐烂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with a chemical process (Kyan’s process) to preserve wood or other materials from decay, insects, or rot, especially by soaking in mercuric chloride (historically).","zh":"经“凯恩防腐法”（Kyan’s process）进行化学处理，以防腐、防虫、防腐烂（尤指历史上用氯化汞溶液浸泡木材）。"},"examples":[{"en":"The railway sleepers were kyanized to slow down rot in damp soil.","zh":"这些铁路枕木做过凯恩防腐处理，以减缓在潮湿土壤中的腐烂。"},{"en":"Old records mention kyanized timber used in docks and warehouses.","zh":"旧档案提到，码头和仓库曾使用做过凯恩防腐处理的木材。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past form of the verb) to kyanize: to preserve or protect (especially wood) using Kyan’s chemical treatment.","zh":"（动词过去式）kyanize：用凯恩化学处理法对（尤指木材）进行防腐保护。"},"examples":[{"en":"They kyanized the beams before building near the river.","zh":"他们在靠近河边施工前先对横梁做了凯恩防腐处理。"}]}],"synonyms":["preserved","treated","impregnated","protected"],"phonetic":"/ˈkaɪənaɪzd/","extraExplanation":["“Kyanized / kyanize”来自19世纪英国发明者 John Howard Kyan 的姓氏。Kyanizing 指把木材浸渍在防腐溶液中以延长使用寿命，历史上常用氯化汞（有毒）。因此这个词多见于旧工程资料、建筑史或工业史语境，现代英语里比较少用。"]}
{"word":"kyanizes","summary":{"en":"“Kyanizes” means chemically preserving wood (especially with mercuric chloride) to prevent rot or insects.","zh":"“kyanizes”指用化学方法（尤指氯化汞）给木材做防腐处理，以防腐烂或虫蛀。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"treats (wood or other materials) with a chemical preservative—especially mercuric chloride—to prevent decay or insect damage.","zh":"用化学防腐剂（尤指氯化汞）处理（木材或其他材料），以防腐烂或虫蛀。"},"examples":[{"en":"The builder kyanizes the timber before using it outdoors.","zh":"建筑工人在木材用于户外之前会先对其进行防腐处理。"},{"en":"In old manuals, it says the factory kyanizes railway sleepers to make them last longer.","zh":"在旧式手册中写道，工厂会对铁路枕木做防腐处理以延长使用寿命。"}]}],"synonyms":["preserves","treats","impregnates (with preservative)"],"phonetic":"/ˈkaɪəˌnaɪzɪz/","extraExplanation":["“kyanize”来自19世纪英国化学家 John Howard Kyan 的名字，他推广用氯化汞处理木材的“Kyan’s process”。这种方法在当时用于延长木材寿命，但由于氯化汞毒性很强，后来逐渐被更安全的防腐方式取代。","“kyanizes”是第三人称单数现在时：he/she/it kyanizes。这个词非常少见，多出现在历史材料、旧工程文献或化学/木材防腐相关语境中。"]}
{"word":"kyanizing","summary":{"en":"Kyanizing means preserving wood by chemical treatment (especially with mercuric chloride).","zh":"Kyanizing 指用化学药剂（尤指氯化汞）处理木材以防腐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of preserving wood (or other materials) by treating it with a chemical—especially mercuric chloride—to prevent rot and insect damage.","zh":"（木材等的）防腐处理法；尤指用氯化汞等化学品浸渍处理，以防腐烂和虫蛀。"},"examples":[{"en":"The old railroad ties were kyanized to slow down decay in wet soil.","zh":"这些旧铁路枕木经过氯化汞防腐处理，以减缓在潮湿土壤中的腐朽。"},{"en":"The museum record notes that the beams underwent kyanizing in the 1800s.","zh":"博物馆记录注明这些梁木在19世纪做过“氯化汞防腐处理”。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of treating wood with chemicals to preserve it (present participle/gerund of “kyanize”).","zh":"对木材进行化学防腐处理（“kyanize”的现在分词/动名词）。"},"examples":[{"en":"They were kyanizing the timber before shipping it overseas.","zh":"他们在把木材运往海外前，正在对其进行化学防腐处理。"},{"en":"Kyanizing was once promoted as a modern solution for durable construction.","zh":"“氯化汞防腐处理”曾一度被宣传为耐久建筑的现代方案。"}]}],"synonyms":["wood preservation","chemical wood treatment","timber treatment","wood impregnation"],"phonetic":"/ˈkaɪəˌnaɪzɪŋ/","extraExplanation":["“Kyanizing / kyanize”来自英国人 John Howard Kyan（约19世纪），他推广用氯化汞（corrosive sublimate）浸渍木材来防腐，因此这种方法以他的姓氏命名。","氯化汞毒性很强，历史上这种工艺后来常被更安全或更经济的木材防腐方法取代；阅读旧工程、铁路或建筑史资料时更常见。"]}
{"word":"kyano","summary":{"en":"Kyano is usually a nonstandard spelling of “cyano-,” a form meaning “blue” or “related to cyanide/–C≡N” in scientific terms.","zh":"Kyano通常是“cyano-”的非标准拼写，常用于科学词汇中，表示“蓝色”或“与氰化物/氰基（–C≡N）有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard spelling of the combining form “cyano-,” meaning “blue/dark blue” or “related to cyanide/cyano group (–C≡N)” in chemistry.","zh":"“cyano-”的少见/非标准拼写形式，意思是“蓝色/深蓝色”，或（在化学中）表示“与氰化物或氰基（–C≡N）有关”。"},"examples":[{"en":"Cyanoacrylate is the main ingredient in many “super glues.”","zh":"氰基丙烯酸酯（cyanoacrylate）是许多“瞬间胶/强力胶”的主要成分。"},{"en":"In chemistry class, we learned that the cyano group is written as –C≡N.","zh":"在化学课上，我们学到氰基写作 –C≡N。"},{"en":"The term comes from a Greek root meaning “dark blue.”","zh":"这个词源自希腊语词根，意思是“深蓝色”。"}]}],"synonyms":["cyano-"],"phonetic":"/ˈsaɪənoʊ/","extraExplanation":["“Kyano”在英语里不算常见标准拼写；你更可能会在科学词汇中看到“cyano-”。例如：cyanobacteria（蓝细菌/蓝藻）、cyanide（氰化物）、cyanosis（发绀：皮肤发青紫）。如果你是在某个品牌名、人名或游戏角色名里看到“Kyano”，那它可能是专有名词，用法和含义需要结合具体语境。"]}
{"word":"kyanol","summary":{"en":"Kyanol is usually a brand/trade name for a heat-resistant synthetic material (often phenolic fiber) used in industrial applications.","zh":"Kyanol 通常是耐高温合成材料（常指酚醛纤维）的品牌/商标名，多用于工业场景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a trade name used for a heat-resistant synthetic fiber/resin material (often referring to phenolic fiber); commonly seen in industrial contexts such as insulation, filtration, and protective materials","zh":"一种耐高温的合成纤维/树脂材料的商标名（常指酚醛纤维）；多见于工业语境，如隔热、过滤与防护材料"},"examples":[{"en":"The gloves are made with Kyanol fiber for better heat resistance.","zh":"这款手套使用了 Kyanol 纤维，因此更耐高温。"},{"en":"Kyanol-based fabric can be used in high-temperature filtration systems.","zh":"以 Kyanol 为基础的织物可用于高温过滤系统。"}]}],"synonyms":["phenolic fiber","heat-resistant fiber"],"phonetic":"ˈkaɪənɔl","extraExplanation":["“Kyanol”在一般英语词典里不常见，更像是材料领域的商品名/品牌名。实际资料中也常看到非常接近的拼法“Kynol”，同样指耐热的酚醛纤维材料；如果你是在论文、产品说明或采购清单里看到该词，建议核对原文拼写与具体厂家/标准。","作为商标词，它通常不用于日常口语；写作时可把它当作专有名词处理（首字母大写），并在首次出现时补充材料类别（例如“a phenolic fiber”）以帮助读者理解。"]}
{"word":"kyar","summary":{"en":"“Kyar” is usually not an English word; it’s often a romanized spelling from another language (commonly Burmese, meaning “tiger”).","zh":"“kyar”通常不是英语单词；多为其他语言（常见为缅甸语）的拉丁字母转写，常见意思是“老虎”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often seen as a romanized (Latin-letter) spelling of a word or name from another language (for example, Burmese).","zh":"不是标准英语单词；常见于把其他语言（例如缅甸语）的词或人名用拉丁字母转写（拼写）出来的形式。"},"examples":[{"en":"I couldn’t find “kyar” in an English dictionary—what language is it from?","zh":"我在英语词典里找不到“kyar”——它来自哪种语言？"},{"en":"In this menu, “kyar” looks like a romanized Burmese word.","zh":"在这份菜单里，“kyar”看起来像是缅甸语的转写词。"}]},{"partOfSpeech":"n.","definition":{"en":"(From Burmese romanization, common) “tiger.”","zh":"（常见于缅甸语转写）“老虎”。"},"examples":[{"en":"The Burmese word “kyar” is often translated as “tiger.”","zh":"缅甸语转写的“kyar”常被译为“老虎”。"},{"en":"The story uses “kyar” to refer to a tiger in the forest.","zh":"故事里用“kyar”指森林中的老虎。"}]}],"synonyms":["tiger (if used in the Burmese sense)"],"phonetic":"/kjɑr/","extraExplanation":["“kyar”很可能是缅甸语“ကျား”的一种拉丁字母转写形式；不同转写系统会出现不同拼法（例如 kyá / kya / kyar 等），所以在英语词典里不一定查得到。","如果你是在特定句子、歌词、游戏ID或人名里看到“kyar”，把原句/来源发我，我可以帮你判断它在那个语境里更可能是什么意思。"]}
{"word":"kyars","summary":{"en":"“kyars” isn’t a standard English word; it’s likely a misspelling or a name.","zh":"“kyars”不是标准英文词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username, or a proper name (e.g., a surname or place name).","zh":"不是标准英文单词。更可能是拼写错误、用户名，或专有名词（如姓氏或地名）。"},"examples":[{"en":"I can’t find “kyars” in a dictionary—could you share the sentence you saw it in?","zh":"我在词典里查不到“kyars”——你能把它出现的句子发我吗？"},{"en":"“Kyars” might be a name, so its meaning depends on the person or context.","zh":"“Kyars”可能是名字，因此含义取决于具体人物或语境。"}]}],"phonetic":"/kjɑrz/","extraExplanation":["“kyars”在常见英语词典中没有固定词义。它可能是以下情况之一：\n1）拼写错误：常见可能是 years（年份/年）、cars（汽车）、kyars/kyars 的误打。\n2）专有名词/网名：如果是人名、地名或账号名，通常不翻译，主要看发音或来源。\n\n如果你把它所在的完整句子贴出来，我可以帮你判断最可能的词、正确拼法和对应意思。"]}
{"word":"kyat","summary":{"en":"Kyat is the currency unit of Myanmar.","zh":"Kyat 指缅甸的货币单位（缅元）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic unit of money used in Myanmar (Burma), divided into 100 pyas","zh":"缅甸的货币单位（缅元），1 缅元 = 100 分（pya）"},"examples":[{"en":"This shirt costs 15,000 kyat.","zh":"这件衬衫要 15,000 缅元。"},{"en":"I exchanged dollars for kyat at the airport.","zh":"我在机场把美元换成了缅元。"}]}],"synonyms":["Myanmar kyat","MMK"],"phonetic":"/tʃɑːt/","extraExplanation":["“Kyat”是缅甸的官方货币名称，常见写法是“MMK”（国际标准货币代码）或“Ks”（当地常用缩写）。","在英文里“kyat”常被读成接近“chat”的音；旅行或新闻语境中常见，如物价、汇率、工资等。"]}
{"word":"kyathoi","summary":{"en":"“kyathoi” is not recognized as a standard English word; it’s likely a name, typo, or transliteration.","zh":"“kyathoi”不是标准英语词汇；更可能是名字、拼写错误或外来语音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a username, a proper name, a typo, or a transliteration from another language.","zh":"不是标准英语单词。可能是用户名、人名、拼写错误，或来自其他语言的音译。"},"examples":[{"en":"I saw “kyathoi” online, but I can’t find its meaning in English.","zh":"我在网上看到“kyathoi”，但在英语里查不到它的意思。"},{"en":"If “kyathoi” is a name, please tell me the language or where you found it.","zh":"如果“kyathoi”是名字，请告诉我它是什么语言，或你在哪里看到的。"}]}],"phonetic":"/kjaˈθɔɪ/","extraExplanation":["目前在常见英语词典与语料中找不到“kyathoi”。如果你能提供一句原文（前后各一两句）或说明它来自哪个平台/语言（例如泰语、缅语、越南语、网络缩写等），我可以更准确判断它的含义或正确拼写。","也可能是拼写接近的词（比如以“kya- / kya tho-”开头的外来语或人名）。提供大小写、是否有空格或重音符号，也会有帮助。"]}
{"word":"kyathos","summary":{"en":"Kyathos is an ancient Greek ladle-like cup, sometimes also a liquid measure.","zh":"Kyathos 指古希腊的舀酒小杯（勺形器），也可作液体容量单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small ancient Greek ladle or dipping cup, also used as a unit of volume (about one quarter of a kotyle; exact size varied by place and period).","zh":"（古希腊的）小勺形舀杯；也指一种容量单位（约为一科泰勒 kotyle 的四分之一；不同城邦与时期数值略有差异）。"},"examples":[{"en":"The archaeologist identified the bronze kyathos as a utensil for dipping wine from a mixing bowl.","zh":"考古学家认出这件青铜 kyathos 是用来从调酒碗里舀酒的器具。"},{"en":"In some ancient sources, a kyathos is mentioned as a measure for serving liquids.","zh":"在一些古代文献中，kyathos 被提到用作盛装液体的计量单位。"}]}],"synonyms":["ladle","dipper","dipping cup"],"phonetic":"/ˈkaɪəθɑːs/","extraExplanation":["Kyathos 源自古希腊语 κύαθος，常见于酒宴（symposium）的饮酒文化：人们会把酒与水在大碗（krater）里调和，再用 kyathos 舀取分装到酒杯中。","作为“容量单位”时，古希腊的计量体系在不同地区并不完全统一，所以书里看到的换算通常是近似值。"]}
{"word":"kyats","summary":{"en":"Kyats are the units of Myanmar’s currency (plural of kyat).","zh":"Kyats 指缅甸货币单位“kyat（缅元）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of kyat, the basic unit of money (currency) used in Myanmar (Burma).","zh":"kyat 的复数；缅甸（Myanmar/ Burma）的货币单位“缅元”。"},"examples":[{"en":"The ticket costs 5,000 kyats.","zh":"这张票要 5,000 缅元。"},{"en":"I exchanged dollars for kyats at the airport.","zh":"我在机场把美元换成了缅元。"},{"en":"Street food there is cheap—often just a few hundred kyats.","zh":"那里的街头小吃很便宜——常常只要几百缅元。"}]}],"synonyms":["Myanmar kyat","MMK"],"phonetic":"/tʃæts/","extraExplanation":["“kyat”通常写作 K 或 MMK（国际货币代码）。日常交流里常说“kyat/kyats”，但在价格牌、换汇单据上也常见“MMK”。","发音上，“kyat”在英语里常被读得像“chat”，所以复数“kyats”也常近似“chats”。"]}
{"word":"kyaung","summary":{"en":"Kyaung is a Myanmar (Burmese) word meaning a Buddhist monastery and, by extension, a traditional school.","zh":"Kyaung 是缅语音译词，主要指佛教僧院，也可引申为传统意义上的学校。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Myanmar/Burma) a Buddhist monastery; often also a place where boys study and live as novice monks.","zh":"（缅甸/缅语语境）佛教寺院、僧院；也常指男孩作为沙弥学习与居住的地方。"},"examples":[{"en":"He visited a small kyaung near Bagan to learn about local Buddhist life.","zh":"他参观了蒲甘附近的一座小僧院（kyaung），了解当地的佛教生活。"},{"en":"Many villages have a kyaung that serves as a community center.","zh":"很多村庄都有一座僧院（kyaung），也充当社区活动中心。"}]},{"partOfSpeech":"n.","definition":{"en":"(Myanmar) a school, especially in older or traditional usage, because monasteries historically provided education.","zh":"（缅甸）学校；尤指较传统/旧时的用法，因为僧院历史上承担教育功能。"},"examples":[{"en":"In the past, children often learned to read and write at the village kyaung.","zh":"过去，孩子们常在村里的“kyaung”（僧院学校）学习读写。"},{"en":"The town built a new kyaung to replace the old classrooms.","zh":"镇上建了一所新的学校（kyaung）来替换旧教室。"}]}],"synonyms":["monastery","temple (context-dependent)","school (Myanmar context)"],"phonetic":"/tʃaʊŋ/","extraExplanation":["“kyaung”来自缅语“ကျောင်း”，常被英语写作者用于介绍缅甸文化时的音译词。在缅甸历史上，僧院不仅是宗教场所，也承担基础教育与社区事务，所以在语境中既可能译为“寺院/僧院”，也可能译为“学校”。具体含义通常要看上下文（是否提到僧侣、诵经、出家生活，或是课程、教室、学生等）。"]}
{"word":"kybele","summary":{"en":"Kybele is an alternate spelling of Cybele, the ancient Phrygian “Great Mother” goddess, and it can also refer to the asteroid named after her.","zh":"Kybele是Cybele的另一种拼写，指古代弗里吉亚的“大母神”；也可指以她命名的小行星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Anatolian/Greek/Roman religion) the Great Mother goddess of Phrygia, later worshiped by Greeks and Romans as a powerful mother-and-nature deity.","zh":"（古代安那托利亚/希腊/罗马宗教中）弗里吉亚的“大母神”，后来被希腊与罗马人崇拜，常被视为象征母性与自然力量的女神。"},"examples":[{"en":"Kybele was honored as a mother goddess who protected cities and wild nature.","zh":"人们敬奉Kybele为母神，认为她守护城市与野性自然。"},{"en":"In Roman culture, Kybele was also called Magna Mater, meaning “Great Mother.”","zh":"在罗马文化中，Kybele也被称为Magna Mater，意思是“伟大的母亲”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Astronomy) Another spelling of “Cybele,” the name used for the asteroid 65 Cybele.","zh":"（天文学）“Cybele”的另一种拼写，用于小行星“65 Cybele”的名称。"},"examples":[{"en":"The asteroid 65 Cybele is named after Kybele/Cybele from ancient religion.","zh":"小行星65 Cybele以古代宗教中的Kybele/Cybele命名。"}]}],"synonyms":["Cybele","Magna Mater","Great Mother"],"phonetic":"/ˈsɪbəli/","extraExplanation":["“Kybele”更常见的英文拼写是“Cybele”。在艺术形象中，她常与狮子、山岳或城墙冠（象征守护城市）联系在一起。","她的崇拜在古代曾伴随强烈的仪式性音乐与舞蹈；在不同地区与时代，相关仪式与传说细节会有所差异。"]}
{"word":"kyd","summary":{"en":"“kyd” is not a standard word; it’s most often a typo for “kid,” and sometimes an abbreviation like “Keep Your Distance,” or a rare surname “Kyd.”","zh":"“kyd”不是标准单词；最常见是把“kid”打错，也可能是“Keep Your Distance（保持距离）”之类的缩写，或较少见的姓氏“Kyd”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(texting/informal) Often a typo or shorthand for “kid.”","zh":"（短信/非正式）常见为“kid（孩子/小孩）”的误拼或简写。"},"examples":[{"en":"I saw your kyd/kid at the park today.","zh":"我今天在公园看到你家孩子了。"},{"en":"That’s a smart kyd—sorry, I mean kid.","zh":"那孩子很聪明——抱歉，我是说 kid。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation; less common) “KYD” can mean “Keep Your Distance,” used as a warning or reminder.","zh":"（缩写；较少见）KYD 可表示“Keep Your Distance（保持距离）”，用于提醒或警告。"},"examples":[{"en":"KYD—there’s construction ahead.","zh":"保持距离——前方在施工。"},{"en":"The sign basically says KYD from the edge.","zh":"标牌基本意思是：离边缘远一点。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper name; rare) “Kyd” is also a surname (family name).","zh":"（专有名词；较少见）Kyd 也可以是一个英文姓氏。"},"examples":[{"en":"My teacher’s last name is Kyd.","zh":"我老师的姓是 Kyd。"}]}],"synonyms":["kid (if it means “kid”)","keep your distance (if it means “KYD”)"],"phonetic":"/kɪd/","extraExplanation":["“kyd”不是一个非常固定、普遍的英语单词，更常见的是：1）把“kid”打错；2）在特定圈子里当作缩写（比如安全提醒“Keep Your Distance”）；3）作为人名/姓氏。","如果你能把它出现的完整句子发我（或告诉我是聊天、游戏、社交媒体还是工作邮件里的用法），我可以更准确判断它在那个语境里的意思。"]}
{"word":"kye","summary":{"en":"Kye is a Scots dialect word meaning “cows/cattle,” and it can also be a surname.","zh":"kye 是苏格兰方言词，意思是“牛/牛群”，也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots dialect) cows; cattle (plural of “kye,” meaning a cow).","zh":"（苏格兰方言）牛；母牛；牛群（复数用法，指多头牛）。"},"examples":[{"en":"The kye were grazing on the hillside.","zh":"牛群正在山坡上吃草。"},{"en":"He went out to check on the kye before nightfall.","zh":"天黑前他出去查看牛群。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Ms. Kye will join the meeting at 3 p.m.","zh":"Kye 女士将于下午三点参加会议。"}]}],"synonyms":["cows","cattle"],"phonetic":"/kaɪ/","extraExplanation":["“kye”主要见于苏格兰英语（Scots）与苏格兰文学/民谣里，属于方言词；在现代标准英语里更常用“cows”或“cattle”。","在一些经典苏格兰诗歌（如罗伯特·彭斯 Robert Burns 的作品）中，你可能会看到“kye”用来营造乡村或地域色彩。"]}
{"word":"kyke","summary":{"en":"“Kyke” is a highly offensive slur for a Jewish person; avoid using it.","zh":"“kyke”是针对犹太人的高度侮辱性蔑称，应避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extremely offensive slur for a Jewish person (avoid using; use “Jewish person” instead).","zh":"对犹太人的极具侮辱性的蔑称（强烈建议避免使用；可用“犹太人/犹太裔人士”替代）。"},"examples":[{"en":"The book includes the slur “kyke” to show the character’s prejudice.","zh":"这本书为了表现人物的偏见，出现了“kyke”这种侮辱性词语。"},{"en":"Please don’t use that word—it’s a hateful slur against Jewish people.","zh":"请不要用那个词——它是针对犹太人的仇恨性蔑称。"}]}],"phonetic":"/kaɪk/","extraExplanation":["这是英语里带有强烈仇恨色彩的种族/宗教歧视用语。在学习或引用时，通常只在讨论反歧视、历史语境或文学文本分析中出现，并应明确标注“slur/侮辱性用语”。","词源常被认为与19—20世纪移民语境有关（有说法联系到“kike”在签到时写的符号/圈，或与某些姓氏/发音相关），但具体来源众说纷纭；无论词源如何，其当代用法普遍被视为不可接受。"]}
{"word":"kyklopes","summary":{"en":"Kyklopes = Cyclopes (plural): the one-eyed giants of Greek mythology.","zh":"Kyklopes = Cyclopes（复数）：希腊神话中的独眼巨人族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) In Greek mythology, the Cyclopes: powerful one-eyed giants (often described as skilled smiths who forged Zeus’s thunderbolts).","zh":"（复数）希腊神话中的独眼巨人族（常被描写为强大的铁匠，为宙斯打造雷霆）。"},"examples":[{"en":"In Greek myth, the Kyklopes made weapons for the gods.","zh":"在希腊神话中，Kyklopes（独眼巨人族）为诸神打造武器。"},{"en":"The story of Odysseus and the Cyclops is one of the most famous monster tales in the Odyssey.","zh":"《奥德赛》中奥德修斯与独眼巨人的故事是最著名的怪物传奇之一。"}]}],"synonyms":["Cyclopes","one-eyed giants"],"phonetic":"/saɪˈkloʊpiːz/","extraExplanation":["“Kyklopes”是古希腊语“Κύκλωπες”的拉丁字母转写，更常见的英语拼写是“Cyclopes”（cyclops 的复数）。在英文写作里，如果你用“Kyklopes”，通常是在强调古典学/原文转写的风格。","不同作品对独眼巨人的设定略有差异：荷马《奥德赛》里的独眼巨人更像野蛮的巨人族群；赫西俄德传统中则更强调他们是神匠（锻造者）的身份。"]}
{"word":"kyklops","summary":{"en":"Kyklops is an alternative spelling of cyclops, meaning a one‑eyed giant from Greek mythology.","zh":"Kyklops 是 cyclops 的另一种拼写，指希腊神话中的独眼巨人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mythology) A cyclops; a one‑eyed giant in ancient Greek stories.","zh":"（神话）独眼巨人；古希腊神话中的独眼巨人。"},"examples":[{"en":"In the Odyssey, Odysseus escapes from a kyklops named Polyphemus.","zh":"在《奥德赛》中，奥德修斯从名叫波吕斐摩斯的独眼巨人（kyklops）手中逃脱。"},{"en":"The painting shows a kyklops with a single eye in the middle of his forehead.","zh":"这幅画描绘了一名额头正中只有一只眼睛的独眼巨人。"}]}],"synonyms":["cyclops","one-eyed giant","Cyclops (Greek mythology)"],"phonetic":"/ˈsaɪklɑps/","extraExplanation":["“kyklops”是希腊语Κύκλωψ（Kyklōps）的音译拼写，更接近原词形；英语里更常用拼写是“cyclops”。","词源与含义：Kyklōps常被解释为与“圆/轮（kyklos）+ 眼（ōps）”相关，常被理解为“圆眼/轮眼”（对应其独眼形象）。","文学与文化常见出处：荷马史诗《奥德赛》中最有名的独眼巨人是Polyphemus；在赫西俄德等传统中，独眼巨人也与锻造、雷霆（宙斯的武器）等主题相关。"]}
{"word":"kyklos","summary":{"en":"Kyklos is a Greek-derived word meaning “circle” or “cycle,” mainly used in academic or classical contexts rather than everyday English.","zh":"Kyklos 源自希腊语，意为“圆/循环”，主要用于学术或古典语境，日常英语更常用 cycle。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Ancient Greek) a circle or ring; by extension, a cycle (a repeating sequence).","zh":"（源自古希腊语）圆、圆环；引申为循环、周期（重复出现的过程）。"},"examples":[{"en":"In Ancient Greek texts, kyklos often refers to the circle of the heavens.","zh":"在古希腊文本中，kyklos 常指“天体的圆周/天穹的圆”。"},{"en":"The idea of kyklos helps explain a cycle of seasons that repeats every year.","zh":"“kyklos”的概念有助于解释一年一度重复的四季循环。"}]},{"partOfSpeech":"n.","definition":{"en":"A set or group arranged in a circle; sometimes used for a circle of people or things (rare in modern English outside scholarship).","zh":"（围成一圈的）集合或群体；有时指一圈人或物（现代英语中较少见，多见于学术语境）。"},"examples":[{"en":"The poem describes a kyklos of dancers moving around the altar.","zh":"诗中描写了一圈舞者绕着祭坛移动。"}]}],"synonyms":["circle","ring","cycle","loop"],"phonetic":"ˈkaɪklɔs","extraExplanation":["“kyklos”（κύκλος）是希腊语“圆/环/循环”。它是很多英语词根的来源：cycle（循环）、cyclic（周期性的）、cyclone（旋风，像“旋转的圆”）、encyclopedia（en- + kyklos + paideia，原意接近“围绕知识的系统学习/总览”）。","在现代英语里，kyklos 通常不会用于日常表达，更常出现在古典学、哲学、文学研究等讨论中；日常说“循环/周期”一般用 cycle。","文学与文化中常见的相关概念包括“命运的循环”“季节轮回”等，英语里更自然的表达是 the cycle of life / the wheel of fortune。"]}
{"word":"kyl","summary":{"en":"“kyl” is not a common standard English word. It’s most often a name variant of “Kyle,” or (rarely) an abbreviation for “kiloyard(s)” meaning 1,000 yards.","zh":"“kyl”不是常见的标准英语词。最常见是人名“Kyle”的拼写变体；更少见时是“kiloyard(s)”的缩写，表示1,000码（千码）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal) A spelling variant of the given name “Kyle.”","zh":"（非正式）人名“Kyle”的一种拼写变体。"},"examples":[{"en":"Kyl said he’d bring the snacks to the meeting.","zh":"Kyl 说他会带零食来开会。"},{"en":"I think Kyl is short for Kyle on his profile.","zh":"我觉得他主页上的 Kyl 可能是 Kyle 的简称/变体。"}]},{"partOfSpeech":"other","definition":{"en":"(technical, abbreviation) “kiloyard(s),” a unit meaning 1,000 yards, used in some military/range contexts.","zh":"（技术缩写）kiloyard(s) 的缩写，表示“千码”（1,000 码），在某些军事/射程语境中会用到。"},"examples":[{"en":"The target is 2.5 kyl away.","zh":"目标距离 2.5 千码（kyl）。"},{"en":"The range was measured in kyl on the chart.","zh":"图表上用 kyl 来标注射程距离。"}]}],"synonyms":["Kyle","kiloyard"],"phonetic":"/kaɪl/","extraExplanation":["“kyl”在日常英语里不是常见词。很多时候它要么是人名（Kyle 的变体/昵称写法），要么是非常小众的技术缩写（kiloyard）。如果你是在聊天/游戏里看到的，也可能只是“kill / Kyle / cool”等词的误拼或个人ID写法，需要结合上下文判断。"]}
{"word":"kyle","summary":{"en":"Kyle is most commonly a male first name; it can also be a surname, and in Scottish English it can mean a narrow sea channel.","zh":"Kyle 最常见是男性英文名；也可作姓氏；在苏格兰英语中还可指“狭窄海峡/水道”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"（男子）名字/名（常见作英文名）"},"examples":[{"en":"Kyle is my older brother.","zh":"Kyle 是我哥哥。"},{"en":"Kyle moved to Chicago for work.","zh":"Kyle 为了工作搬到芝加哥了。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏"},"examples":[{"en":"Ms. Kyle will speak at the meeting.","zh":"Kyle 女士会在会议上发言。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in Scotland) a narrow channel, strait, or sea inlet.","zh":"（尤指苏格兰）狭窄海峡；海湾水道"},"examples":[{"en":"They sailed through a kyle between the islands.","zh":"他们穿过岛屿之间的一条狭窄海峡航行。"}]}],"synonyms":["(name) none","(Scottish sense) strait","channel","inlet"],"phonetic":"/kaɪl/","extraExplanation":["“Kyle”作人名时在美国较常见，常给人一种随和、运动感或现代的印象，但这种联想并非固定含义。","词源上，“kyle”作地理名词来自苏格兰盖尔语 *caol*，意思是“狭窄的水道/海峡”。因此你会在苏格兰地名中看到它，如 *Kyle of Lochalsh*。"]}
{"word":"Kylie","summary":{"en":"Kylie is most commonly a female first name; less commonly in Australian English it can mean a type of boomerang/throwing stick.","zh":"Kylie 最常见是女性名字；较少见时在澳大利亚英语里也可指一种回力镖/投掷木棒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"（女性）名字。"},"examples":[{"en":"Kylie is my sister’s name.","zh":"Kylie 是我姐姐的名字。"},{"en":"Kylie moved to New York for college.","zh":"Kylie 去纽约上大学了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Australian English, less common) a type of boomerang or throwing stick.","zh":"（澳大利亚英语，较少见）一种回力镖或投掷用的木棒。"},"examples":[{"en":"In some regions, a “kylie” refers to a kind of boomerang used for hunting.","zh":"在一些地区，“kylie”指一种用于狩猎的回力镖。"}]}],"synonyms":["(name) given name","(Australian sense) boomerang"],"phonetic":"/ˈkaɪli/","extraExplanation":["“Kylie”作为人名在英语国家很常见，20世纪后因澳大利亚歌手 Kylie Minogue 等公众人物而更流行；在美国也常因流行文化人物被熟知。","作为词汇（回力镖/投掷棒）时，多见于澳大利亚英语，来源与原住民语言有关；在日常对话里远不如人名用法常见。"]}
{"word":"kylie","summary":{"en":"Kylie is most commonly a female first name; less commonly, it can mean a boomerang-like Australian hunting weapon.","zh":"Kylie 最常见是女性名字；较少见时也可指类似回旋镖的澳大利亚狩猎武器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (also used as a brand or stage name), common in English-speaking countries","zh":"女性名字（也常用作品牌名或艺名），在英语国家较常见"},"examples":[{"en":"Kylie is starting a new job next week.","zh":"Kylie 下周要开始一份新工作。"},{"en":"I met someone named Kylie at the party.","zh":"我在派对上认识了一个叫 Kylie 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"a traditional Australian hunting weapon, similar to a boomerang (rare in modern everyday English)","zh":"澳大利亚传统狩猎武器，类似回旋镖（现代日常英语中较少见）"},"examples":[{"en":"In the museum, we saw a kylie used for hunting.","zh":"在博物馆里，我们看到了用于狩猎的 kylie。"}]}],"phonetic":"/ˈkaɪli/","extraExplanation":["“Kylie”作为人名在澳大利亚尤其常见，也因为一些知名人物（如歌手 Kylie Minogue、媒体人物 Kylie Jenner）而在全球更广为人知。","这个名字常被认为与澳大利亚原住民语言有关；而“kylie”作为武器一义，也与澳大利亚本土文化背景相关。实际使用中，大写“Kylie”几乎总是指人名。"]}
{"word":"kylies","summary":{"en":"“Kylies” usually means the plural of “kylie” (a boomerang) or multiple people named Kylie; it can also be the possessive form “Kylie’s,” depending on context.","zh":"“kylies”通常是“kylie”的复数（回旋镖）或指多个名叫Kylie的人；也可能是所有格“Kylie’s”，需结合上下文判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a returning throwing stick (a kind of boomerang), especially in Australian English","zh":"（澳大利亚英语）回旋镖；一种可掷出并回飞的投掷木棍"},"examples":[{"en":"The ranger showed us how to throw a kylie safely.","zh":"护林员给我们演示了如何安全地投掷回旋镖。"},{"en":"In some stories, hunters used a kylie to bring down birds.","zh":"在一些故事里，猎人用回旋镖击落鸟类。"}]},{"partOfSpeech":"n.","definition":{"en":"a female given name; “Kylies” can mean more than one person named Kylie","zh":"女性名；“Kylies”可指多个名叫Kylie的人"},"examples":[{"en":"There are three Kylies in our class, so we use last names too.","zh":"我们班有三个叫Kylie的人，所以也会用姓来区分。"},{"en":"Kylies from different countries may pronounce their names slightly differently.","zh":"来自不同国家的Kylie在名字发音上可能会有些细微差别。"}]}],"synonyms":["boomerang"],"phonetic":"/ˈkaɪli/","extraExplanation":["“kylie”作为“回旋镖”相关的词，主要见于澳大利亚语境，源自澳大利亚原住民语言（不同地区拼写与指代的器具可能有差异）。","你输入的“kylies”通常是复数形式（两个或更多的kylie），也可能是在口语/书写中指“Kylie的……”（所有格：Kylie’s）。需要看上下文才能确定。","作为人名“Kylie”，在流行文化中较常见（例如歌手 Kylie Minogue 等），因此在英语里也常被当作普通人名来使用。"]}
{"word":"kylikec","summary":{"en":"“kylikec” isn’t recognized as a common English word; it likely needs context or correction.","zh":"“kylikec”不是常见英语单词；需要上下文或可能需要改正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username, a brand name, or a transliteration from another language.","zh":"不是标准英语单词，可能是拼写错误、用户名、品牌名，或来自其他语言的音译/拼写。"},"examples":[{"en":"I can’t find “kylikec” in an English dictionary—could it be a typo?","zh":"我在英语词典里找不到“kylikec”——它会不会是拼写错误？"},{"en":"If you tell me the sentence where you saw it, I can help you guess the intended word.","zh":"如果你把它出现的句子发我，我可以帮你判断原本想写的词。"}]}],"phonetic":"/ˈkaɪlaɪk/","extraExplanation":["“kylikec”看起来像随机字母组合，也可能是把别的词打错了。你可以：1）发一下它出现的完整句子或截图；2）说明你想表达的中文意思；3）确认是否是人名/网名/游戏ID/公司名；4）检查是否想写的是类似的拼写（例如 kylike、Kyle、like、lyric 等）。有了上下文我才能更准确地帮你。"]}
{"word":"kylikes","summary":{"en":"“kylikes” is usually a username or a casual way to write “Ky likes …,” not a standard dictionary word.","zh":"“kylikes”通常是用户名/网名，或口语化写法“Ky likes …”，并非标准词典词条。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word; most commonly used as a username/handle or a casual written form meaning “Ky likes …” (Ky is a name or nickname).","zh":"不是标准英语词条；最常见用法是作为用户名/网名，或口语化书写表示“Ky 喜欢……”（Ky 可作名字或昵称）。"},"examples":[{"en":"My gaming tag is “kylikes.”","zh":"我的游戏昵称是“kylikes”。"},{"en":"In the chat, “kylikes pizza” probably means Ky likes pizza.","zh":"在聊天里，“kylikes pizza”很可能是指 Ky 喜欢披萨。"}]},{"partOfSpeech":"phrase","definition":{"en":"(If read as two words) “Ky likes” = Ky enjoys or prefers something; “likes” is the third-person singular form of the verb “like.”","zh":"（若按两个词读）“Ky likes”= Ky 喜欢/偏好某物；“likes”是动词“like”的第三人称单数形式。"},"examples":[{"en":"Ky likes quiet places to study.","zh":"Ky 喜欢安静的地方学习。"},{"en":"She likes tea, but he likes coffee.","zh":"她喜欢茶，但他喜欢咖啡。"}]}],"synonyms":["like","enjoy","prefer"],"phonetic":"ˈkaɪlaɪks","extraExplanation":["“kylikes”这种写法常见于社交媒体/游戏ID：把名字（Ky）和常用动词（likes）连在一起，便于记忆，也可以暗示“我喜欢/我推荐”的内容风格。","如果你本来想查的是“Kyle likes”（Kyle 是常见英文名）或单词“like/likes”，告诉我你想要哪一个，我可以给出更标准的词条与用法对比。"]}
{"word":"kylin","summary":{"en":"A kylin is a Chinese mythical beast (qilin) symbolizing good fortune and peace.","zh":"kylin 指中国神话中的麒麟，象征祥瑞与太平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mythical creature from Chinese culture (also known as qílín), often shown with dragon-like features and associated with good luck, peace, and the arrival of a wise ruler or important person.","zh":"中国文化中的神兽（麒麟，qílín），常被描绘为带有龙等特征，象征祥瑞、太平，也常被认为预示贤明君主或重要人物的出现。"},"examples":[{"en":"In traditional stories, seeing a kylin is a sign of peace and good fortune.","zh":"在传统故事里，见到麒麟被视为太平与好运的象征。"},{"en":"The temple gate was decorated with carvings of dragons and kylins.","zh":"寺庙大门上装饰着龙和麒麟的雕刻。"}]}],"synonyms":["qilin","kirin","Chinese unicorn (approx.)"],"phonetic":"/ˈkiːlɪn/","extraExplanation":["“kylin”是“qilin（麒麟）”的英语常见拼写之一，多用于面向西方读者的文本；也常见拼写有“kirin”。","麒麟在东亚文化圈中有不同的视觉形象：有时更像鹿/马的体态配鳞片与角，有时更“龙系”。在英语语境中，它常被概括为“Chinese unicorn”，但这只是便于理解的类比，并不完全等同于西方独角兽。","现代文化里你可能在游戏、动漫或品牌名称中看到“Kirin/Kylin”（如日本啤酒品牌“Kirin”）；这些用法通常借用其“祥瑞、吉兆”的文化联想。"]}
{"word":"kylite","summary":{"en":"“Kylite” is not a common dictionary word; it’s probably a name/brand or a misspelling (e.g., “Kylie,” “skylight,” or “key light”).","zh":"“kylite”不是常见词典词汇；更可能是人名/品牌或拼写错误（如“Kylie”“skylight”“key light”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in most dictionaries; it is likely a misspelling, a username/brand name, or a proper noun (name).","zh":"这不是常见的标准英语词（多数词典不收录）；更可能是拼写错误、用户名/品牌名，或专有名词（人名）。"},"examples":[{"en":"I couldn’t find “kylite” in the dictionary—do you mean “Kylie” or “skylight”?","zh":"我在词典里找不到“kylite”——你是想写“Kylie”还是“skylight（天窗）”吗？"},{"en":"The app shows “kylite” as a username, not a regular English word.","zh":"这个应用里“kylite”显示为用户名，而不是常规英文单词。"}]}],"phonetic":"/ˈkaɪlaɪt/","extraExplanation":["“kylite”很可能是以下几种情况之一：\n1）拼写想写 **Kylie**（常见人名，如 Kylie Minogue；也常见于品牌/昵称）；\n2）想写 **skylight**（/ˈskaɪlaɪt/，名词：天窗、采光窗）；\n3）想写 **key light**（影视/摄影用语：主光、主灯）。\n如果你把它放进一个句子里，或告诉我出现的场景（聊天、摄影、建筑、品牌等），我可以更准确判断。"]}
{"word":"kylix","summary":{"en":"A kylix is an ancient Greek two-handled drinking cup, often used for wine.","zh":"kylix 是古希腊常见的双耳浅口酒杯，多用于饮酒（尤其是葡萄酒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Greek drinking cup, typically with a wide, shallow bowl and two horizontal handles, often used for wine at social gatherings (symposia)","zh":"（古希腊）双耳浅口酒杯；一种常见于酒宴（symposium）的饮酒器，杯身宽浅、两侧有水平把手"},"examples":[{"en":"The museum displayed a red-figure kylix painted with scenes from mythology.","zh":"博物馆展出了一只红绘（red-figure）酒杯（kylix），上面绘有神话场景。"},{"en":"At a symposium, guests might drink diluted wine from a kylix.","zh":"在古希腊酒宴（symposium）上，宾客可能会用kylix饮用兑水的葡萄酒。"},{"en":"Archaeologists found a broken kylix near the remains of a pottery workshop.","zh":"考古学家在一处陶器作坊遗址附近发现了一只破碎的kylix。"}]}],"synonyms":["drinking cup","wine cup","goblet"],"phonetic":"/ˈkaɪlɪks/","extraExplanation":["kylix（复数常写作 kylikes）在古希腊很常见，尤其与“symposium（酒宴/雅集）”文化相关：人们一边饮酒、一边聊天、听音乐或讨论哲学。","很多kylix的杯底内侧会绘画图案（如酒神狄俄尼索斯、神话人物或日常生活场景）。当酒快喝完时图案才显露出来，有点像“喝到最后才出现的惊喜”。","在艺术史里常见的术语还有 black-figure（黑绘）与 red-figure（红绘），指陶器绘画技法的不同；kylix常用来呈现这些画面。"]}
{"word":"kylo","summary":{"en":"“Kylo” is mostly used as a name, especially referring to the Star Wars character Kylo Ren.","zh":"“Kylo”主要用作人名，最常见是指《星球大战》角色“凯洛·伦”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually masculine) and, most famously, the first name of Kylo Ren, a fictional character in the Star Wars sequel trilogy.","zh":"一个人名（多为男性名）；最广为人知的是《星球大战》续集三部曲中虚构角色“凯洛·伦（Kylo Ren）”的名字（名）。"},"examples":[{"en":"Kylo Ren is a major character in the Star Wars sequel trilogy.","zh":"凯洛·伦是《星球大战》续集三部曲中的重要角色。"},{"en":"I named my cat Kylo because I like Star Wars.","zh":"我给猫取名叫 Kylo，因为我喜欢《星球大战》。"}]}],"synonyms":["Kylo Ren (as a reference)"],"phonetic":"/ˈkaɪloʊ/","extraExplanation":["“Kylo”本身并不是常见英语词汇，更常见于流行文化语境，尤其是《星球大战》中的角色名。日常交流里如果单独说“Kylo”，通常需要上下文，否则别人可能会追问是不是指“Kylo Ren”。","在英语里，很多虚构作品会创造类似“Kylo”这样的名字：看起来像英文名，但不一定有传统词源或固定含义。"]}
{"word":"kyloe","summary":{"en":"“Kyloe” is not a standard English word; it’s usually a name/variant spelling (like “Kylo”) or a misspelling of “kilo.”","zh":"“Kyloe”不是标准英文词；通常是人名/变体拼写（类似“Kylo”），或是把“kilo（千克/一千-）”拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling that may be used as a personal name (a variant of “Kylo”), sometimes associated with the Star Wars character “Kylo Ren.”","zh":"一种不标准的拼写，可能用作人名（“Kylo”的变体），有时会让人联想到《星球大战》角色“凯洛·伦（Kylo Ren）”。"},"examples":[{"en":"Is “Kyloe” your name, or is it a username?","zh":"“Kyloe”是你的名字，还是网名/用户名？"},{"en":"Some people spell it “Kyloe,” but “Kylo” is more common.","zh":"有些人会拼成“Kyloe”，但更常见的是“Kylo”。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “kilo,” meaning one thousand (as a prefix) or short for “kilogram.”","zh":"常见于把“kilo”拼错；“kilo-”表示“一千”（前缀），也可指“kilogram（千克）”的简称。"},"examples":[{"en":"I think you meant “kilo”: 1 kilo is 1,000 grams.","zh":"你可能想写“kilo”：1 kilo 等于 1000 克。"},{"en":"The box weighs about two kilos.","zh":"这个箱子大约有两千克重。"}]}],"synonyms":["Kylo","kilo"],"phonetic":"ˈkaɪloʊ","extraExplanation":["“Kyloe”本身不是常见的标准英文词条，因此在词典里通常查不到。它更可能是：① 人名/昵称的创意拼写（接近 Kylo / Kylie）；② 把 kilo 拼错。","如果你告诉我你想表达的是“人名/角色名”还是“重量单位”，我可以给出更准确的发音、用法与例句。"]}
{"word":"kymation","summary":{"en":"Cymation is the visible pattern made by vibrations (often sound) in materials like sand or water.","zh":"Cymation 指振动（常见为声音）在沙子、水等介质中形成的可见图案现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study or phenomenon of visible patterns formed when sound vibrations (or other waves) move through a medium like sand, water, or a metal plate.","zh":"（声波等）振动通过介质（如沙子、水或金属板）时形成可见图案的现象或研究；常译为“音波纹样/振动成像”。"},"examples":[{"en":"In a cymation demo, sand on a metal plate jumps into geometric patterns when the plate vibrates.","zh":"在音波纹样（cymation）演示中，金属板上的沙子会随着振动跳动并排列成几何图案。"},{"en":"The teacher used cymation to show students that sound can shape matter into patterns.","zh":"老师用 cymation 来让学生看到：声音也能把物质“塑形”成图案。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific pattern produced by vibration (for example, the shapes seen in vibrating water or on a Chladni plate).","zh":"由振动产生的某一种特定图案（例如振动水面或克拉德尼板上的形状）。"},"examples":[{"en":"At a higher frequency, the cymation became more complex and symmetrical.","zh":"频率更高时，这个 cymation 图案变得更复杂、更对称。"}]}],"synonyms":["Chladni patterns","vibrational patterns","wave patterns"],"phonetic":"/saɪˈmeɪʃən/","extraExplanation":["你输入的 **kymation** 常被当作 **cymation** 的变体拼写或误拼；在学术与科普语境中更常见的标准拼写是 **cymation**。","词源与背景：cymation 来自希腊语 *kyma*（“波”）。这一概念在现代被瑞士研究者 Hans Jenny（汉斯·詹尼）在 20 世纪中期用实验与影像广泛推广；相关现象也常与 **Chladni patterns（克拉德尼图形）** 一起提到。"]}
{"word":"kymatology","summary":{"en":"Kymatology means the study of waves and wave motion.","zh":"kymatology 指“波动学”，研究波及其传播与运动规律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of waves and wave motion (such as sound waves, water waves, or light waves), especially in physics and engineering","zh":"波动学；研究各种“波”及其传播与运动规律的学科（如声波、水波、光波等），常见于物理与工程领域"},"examples":[{"en":"Kymatology helps explain how sound waves travel through air and solids.","zh":"波动学有助于解释声波如何在空气和固体中传播。"},{"en":"In this course, we use kymatology to model ripples on water.","zh":"在这门课里，我们用波动学来建立水面涟漪的模型。"}]}],"synonyms":["wave theory","undulatory theory","the study of wave phenomena"],"phonetic":"/ˌkaɪməˈtɑlədʒi/","extraExplanation":["“kymatology”在现代英语中比较少见，更常见的说法是“wave theory（波动理论）”或直接说“the study of wave phenomena（波现象研究）”。","词源来自希腊语“kyma”（意为“波、浪”）+ “-logy”（学科、研究）。","不要与“cymatics / kymatics（克拉德尼图形/声波可视化等‘声致形态’研究）”混淆：cymatics更偏向把振动/声波通过介质（沙子、水等）呈现出图案的现象与实验。"]}
{"word":"kymbalon","summary":{"en":"“Kymbalon” is a rare/old spelling of “cymbal,” a metal percussion instrument.","zh":"“kymbalon”是“cymbal（钹）”的一种罕见/古体拼写，指金属打击乐器钹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A cymbal; a round metal percussion instrument that you strike or clash to make a loud ringing sound.","zh":"（罕见/古体）钹；一种圆形金属打击乐器，敲击或相互碰撞会发出响亮的金属声。"},"examples":[{"en":"The crash of the kymbalon signaled the climax of the music.","zh":"钹（kymbalon）的强烈撞击声标志着乐曲进入高潮。"},{"en":"In older religious texts, “kymbalon” often refers to cymbals used in worship.","zh":"在较早的宗教文本中，kymbalon 常用来指礼拜中使用的钹。"}]}],"synonyms":["cymbal"],"phonetic":"/ˈsɪmbəl/","extraExplanation":["“kymbalon”更常见的现代拼写是“cymbal”。它来自希腊语 κῠ́μβᾰλον（kymbalon），在一些古典、宗教或文学语境里会保留这种较接近原文的拼写。","注意不要和“cimbalom”混淆：cimbalom 是一种用小槌敲击弦的乐器（扬琴类），不是钹。"]}
{"word":"kymnel","summary":{"en":"“Kymnel” is not a standard English word; it is likely a misspelling of “kernel.”","zh":"“kymnel”不是标准英语单词，很可能是“kernel”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “kernel.”","zh":"不是标准英语单词，可能是“kernel”的拼写错误。"},"examples":[{"en":"I can’t find “kymnel” in an English dictionary—did you mean “kernel”?","zh":"我在英语词典里找不到“kymnel”——你是不是想写“kernel”？"},{"en":"The correct spelling is “kernel,” not “kymnel.”","zh":"正确拼写是“kernel”，不是“kymnel”。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “kernel”) The inner, essential part of something; the most important idea.","zh":"（如果你想写“kernel”）事物的核心部分；要点、精髓。"},"examples":[{"en":"The kernel of her argument is that time matters more than money.","zh":"她论点的核心是：时间比金钱更重要。"},{"en":"Try to find the kernel of truth in what he said.","zh":"试着在他说的话里找出那一点真实的核心。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “kernel”) The edible seed inside the shell of a nut or the grain of corn.","zh":"（如果你想写“kernel”）（坚果的）仁；（玉米的）籽粒。"},"examples":[{"en":"Remove the shells and eat the nut kernels.","zh":"去掉壳，吃里面的坚果仁。"},{"en":"Corn kernels popped into popcorn.","zh":"玉米粒爆成了爆米花。"}]}],"synonyms":["core","essence","heart","gist"],"phonetic":"/ˈkɝːnəl/","extraExplanation":["“kernel”既可用于具体事物（玉米粒、坚果仁），也常用于抽象表达（the kernel of an idea＝想法的核心/精髓）。","如果你能提供“kymnel”出现的句子或上下文，我也可以帮你确认是否是其他语言、名字、或专有名词。"]}
{"word":"kymogram","summary":{"en":"A kymogram is a time-based tracing made by a kymograph, used to record physiological changes (e.g., blood pressure, breathing) over time.","zh":"kymogram 指由 kymograph 绘制的随时间变化的描记曲线，用于记录生理指标（如血压、呼吸等）的变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a graphic record (a time-based tracing) made by a kymograph, showing changes in a physiological process such as blood pressure, muscle contraction, or breathing over time","zh":"（由描记器/波动记录器绘制的）描记图；一种按时间记录生理过程变化的曲线图，例如血压、肌肉收缩或呼吸的变化"},"examples":[{"en":"The lab report included a kymogram of the subject’s blood pressure during exercise.","zh":"实验报告中包含了受试者运动时血压变化的描记图。"},{"en":"By comparing the kymograms, the researcher could see the muscle contractions becoming weaker.","zh":"通过对比这些描记图，研究人员能看出肌肉收缩变弱了。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the instrument or device used to produce such a record","zh":"（较少见）用来生成描记图的仪器（有时也这样用，但更常说 kymograph）"},"examples":[{"en":"In older texts, “kymogram” may refer to the recording apparatus itself.","zh":"在较早的文献中，“kymogram”有时也指记录装置本身。"}]}],"synonyms":["physiological tracing","time tracing","recording (in physiology)"],"phonetic":"/ˈkaɪməˌɡræm/","extraExplanation":["词源提示：kymogram 来自希腊语 kym(a)-（波、波动）+ -gram（记录、图）。它强调“波动随时间的记录”。在现代医学与生理学里，更常把设备称为 kymograph，把生成的曲线称为 kymogram。"]}
{"word":"kymograms","summary":{"en":"Kymograms are recorded wave-form graphs showing changes (like pressure or movement) over time.","zh":"Kymograms 指记录压力或运动等随时间变化的波形曲线图（kymogram 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of kymogram: graphical records of wave-like movements (such as pressure, pulse, breathing, or muscle contraction) made by a measuring device.","zh":"kymogram 的复数：用仪器把波动性运动（如压力、脉搏、呼吸或肌肉收缩）记录成曲线/图像的“波形记录图”。"},"examples":[{"en":"The researchers compared the kymograms of heart pressure before and after the drug was given.","zh":"研究人员比较了给药前后心脏压力的波形记录图（kymograms）。"},{"en":"Old physiology textbooks often show kymograms to explain how breathing changes over time.","zh":"旧版生理学教材常用波形记录图来说明呼吸随时间的变化。"}]}],"synonyms":["waveform records","tracings","pressure traces","recordings"],"phonetic":"/ˈkaɪməˌɡræmz/","extraExplanation":["“kymogram”常见于生理学、医学史和早期实验研究：早期用“kymograph（波形记录器）”把压力或运动随时间变化画在滚筒纸上，形成kymogram。现代临床更常见的是更具体的记录名称（如ECG心电图、pressure trace压力曲线等），但在研究或历史语境中仍会出现。","词源提示：来自希腊语 kym(a)-（波浪）+ -graph（记录/书写），核心含义就是“把波浪式变化记录下来”。"]}
{"word":"kymograph","summary":{"en":"A kymograph is an instrument used to record physiological movements or pressures over time, producing a tracing (often a wave-like line).","zh":"kymograph 指一种把生理运动或压力等信号随时间记录成曲线的仪器（常见为波形描记）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that records changes in movement, pressure, or other physiological signals over time on a moving surface (traditionally a rotating drum with paper).","zh":"（生理学等中）记录运动、压力等信号随时间变化的仪器（传统上为裹纸的旋转圆筒记录装置）。"},"examples":[{"en":"In the physiology lab, the kymograph traced the muscle’s contraction as a wavy line on paper.","zh":"在生理实验室里，描记器把肌肉收缩记录成纸上的波形曲线。"},{"en":"The researcher used a kymograph to record breathing patterns during the experiment.","zh":"研究人员用描记器记录实验过程中的呼吸模式。"}]}],"synonyms":["recording drum","physiograph (broader)","tracing device"],"phonetic":"/ˈkaɪməˌɡræf/","extraExplanation":["词源提示：kymograph 来自希腊语 kyma（“波”）+ graph（“写/记录”），因此常被理解为“把波形写下来/记录下来”的仪器。","常见学科语境：多见于生理学、药理学、神经科学的早期实验记录系统。现代实验室更常用数字传感器与计算机采集系统，但教材或历史实验描述中仍会出现 kymograph。","读文献小技巧：在论文或实验记录里，kymograph tracing 指“描记曲线/记录曲线”，有时也可泛指用这种装置得到的那条记录线。"]}
{"word":"kymographic","summary":{"en":"Kymographic means “related to a kymograph,” especially recordings shown as wave-like traces over time.","zh":"kymographic 指“与描记器（kymograph）有关的”，尤其指把随时间变化记录成波形曲线的记录/图线。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a kymograph (a device that records changes such as pressure, movement, or muscle contractions over time, often as wave-like lines on paper or a screen).","zh":"与描记器（kymograph，一种记录随时间变化的压力、运动或肌肉收缩等数据的装置，常以波形曲线呈现）有关的；描记器的。"},"examples":[{"en":"The researchers used kymographic recordings to measure changes in blood pressure during the experiment.","zh":"研究人员使用描记器的记录来测量实验中血压的变化。"},{"en":"Kymographic traces showed a regular rhythm in the heart contractions.","zh":"描记器曲线显示心脏收缩节律很规律。"}]}],"synonyms":["kymograph-related","tracing (in physiology context)"],"phonetic":"/ˌkaɪməˈɡræfɪk/","extraExplanation":["词源提示：kymo- 来自希腊语 kyma（“波浪”），-graphic 表示“记录/描绘的”。因此 kymographic 常用于生理学、医学或实验心理学等语境，强调把变化“画成波形曲线”。"]}
{"word":"kymography","summary":{"en":"Kymography is the recording of wave-like bodily movements (like pulse or breathing) as a graph over time.","zh":"Kymography 指把脉搏、呼吸等人体波动性变化以随时间变化的曲线方式记录下来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A method of recording wave-like movements in the body (such as breathing, pulse, or pressure changes), usually as a graph over time.","zh":"一种记录人体内波动性运动（如呼吸、脉搏或压力变化）的方法，通常以随时间变化的曲线图呈现。"},"examples":[{"en":"In early physiology labs, kymography was used to record a heartbeat as a line on moving paper.","zh":"在早期的生理学实验室里，常用波动描记法把心跳记录为移动纸带上的一条曲线。"},{"en":"The professor showed how kymography could track changes in blood pressure during exercise.","zh":"教授展示了波动描记法如何追踪运动过程中血压的变化。"}]}],"synonyms":["physiological recording","waveform recording"],"phonetic":"/ˌkaɪˈmɑːɡrəfi/","extraExplanation":["词源上常解释为希腊语 kyma（“波”）+ -graphy（“记录/描记”），因此它强调“把波形运动记录下来”。","在现代医学里，许多更先进的电子传感与成像技术已取代传统机械式描记器，但该词仍会出现在生理学史、研究方法或特定仪器描述中。"]}
{"word":"kymric","summary":{"en":"Kymric means Welsh, especially in older or scholarly contexts; it can also (rarely) mean the Welsh language or a Welsh person.","zh":"kymric 指“威尔士的/威尔士语相关的”（多用于较旧或学术语境）；也可很少见地指威尔士语或威尔士人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Welsh; relating to Wales, the Welsh people, or the Welsh language (especially in historical or scholarly writing).","zh":"威尔士的；与威尔士、威尔士人或威尔士语有关的（多见于历史或学术语境）。"},"examples":[{"en":"Some older books use “Kymric” to describe Welsh traditions and literature.","zh":"一些较早的书会用“kymric”来描述威尔士的传统与文学。"},{"en":"The museum has a small exhibit on Kymric culture in medieval Britain.","zh":"博物馆有一个关于中世纪不列颠威尔士（kymric）文化的小展区。"}]},{"partOfSpeech":"n.","definition":{"en":"The Welsh language, or a Welsh person (rare and old-fashioned).","zh":"威尔士语；或威尔士人（较少见、偏旧式用法）。"},"examples":[{"en":"In nineteenth-century texts, “the Kymric” may refer to the Welsh language.","zh":"在十九世纪的文本中，“the Kymric”有时指威尔士语。"}]}],"synonyms":["Welsh","Cymric"],"phonetic":"/ˈkɪmrɪk/","extraExplanation":["“Kymric”常被视为“Cymric”的拼写变体；现代英语里更常见的是“Welsh”（威尔士的/威尔士语）或“Cymric”（较学术/文学）。","词源上与威尔士语“Cymru”（威尔士）及“Cymry”（威尔士人）相关；拼写中的“K-”多见于较早的英语化转写。"]}
{"word":"kyndill","summary":{"en":"Kyndill is an Icelandic noun meaning “torch” (a handheld light).","zh":"Kyndill 是冰岛语名词，意思是“火把/手持照明物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Icelandic) a torch; a handheld light (sometimes also used for “candle” in older/literary contexts).","zh":"（冰岛语）火把；手持照明物（在较旧/文学语境中有时也可指“蜡烛”）。"},"examples":[{"en":"Hann kveikti á kyndli og gekk inn í hellinn.","zh":"他点燃火把，走进了洞穴。"},{"en":"Í sögunum ber hetjan oft kyndil í myrkri.","zh":"在传说故事里，英雄常在黑暗中举着火把。"}]}],"synonyms":["torch","flare","candle","light"],"phonetic":"/ˈkɪn.dɪl/","extraExplanation":["“Kyndill”不是英语单词，而是冰岛语名词。去冰岛旅行或读北欧题材作品时，可能会在路标、博物馆说明或文学译文里见到它。","发音上，冰岛语中“ky-”的起始辅音更接近偏“硬/前置”的 k 音；给英语学习者的近似读法可理解为类似“KIN-dil”。","如果你本来想查英语单词，最常见的近似拼写是 **kindle**（点燃；激起兴趣；电子书阅读器品牌名）。你可以告诉我你的语境/句子，我可以帮你确认。"]}
{"word":"kynikos","summary":{"en":"Kynikos is a rare word from Greek meaning “dog-like,” used mainly in academic contexts to refer to the ancient Greek Cynics and their anti-conventional lifestyle.","zh":"Kynikos 是一个源自希腊语、较罕见的词，意为“像狗一样”，多用于学术语境，指古希腊犬儒学派及其反传统的生活态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to the ancient Greek Cynic philosophers; literally “dog-like,” describing a shameless, anti-conventional way of life associated with Cynicism.","zh":"（罕见）与古希腊“犬儒学派”有关；字面义为“像狗一样”，指与犬儒主义相关的、不拘礼法、反传统的生活态度。"},"examples":[{"en":"His essay adopts a kynikos tone, praising simple living and mocking social status.","zh":"他的文章带有犬儒学派式（kynikos）的语气，推崇简朴生活并嘲讽社会地位。"},{"en":"In the lecture, Diogenes was described as the most famous figure of the kynikos tradition.","zh":"在讲座中，第欧根尼被描述为犬儒学派（kynikos）传统中最著名的人物。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A Cynic (a member or follower of the ancient Cynic school).","zh":"（罕见）犬儒学派成员；犬儒主义者（指古代犬儒学派的追随者）。"},"examples":[{"en":"Ancient writers sometimes contrasted a kynikos with a Stoic in debates about virtue.","zh":"古代作家有时会在有关美德的辩论中，将犬儒学派者（kynikos）与斯多葛学派者作对比。"}]}],"synonyms":["Cynic","Cynic (of the ancient school)","Cynic philosophy","Cynical (modern sense, approximate)"],"phonetic":"/ˈkɪnɪkɔs/","extraExplanation":["词源：来自希腊语 κυνικός (kynikós)，源于 κύων (kyōn，“狗”)。犬儒学派之所以与“狗”相关，一方面是因为他们提倡像狗一样不受社会虚伪礼法束缚的生活方式，另一方面也可能带有当时社会对其生活方式的讥讽意味。","用法提醒：现代英语里更常用的是 cynic / cynical（“愤世嫉俗的、爱讽刺的”），而 kynikos 更偏学术/古典语境，用来指“古希腊犬儒学派”的思想与传统。"]}
{"word":"Kynne","summary":{"en":"Kynne is most commonly a surname; in archaic (Middle English) use, it can mean “kind/type/nature,” sometimes “kin/family.”","zh":"Kynne 最常见是姓氏；在较古老（中古英语）用法中，可表示“种类/类型/本性”，有时也指“亲族/家族”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A family name (surname).","zh":"（专有名词）姓氏。"},"examples":[{"en":"Ms. Kynne will join the meeting at 3 p.m.","zh":"Kynne 女士将于下午三点参加会议。"},{"en":"I found the name Kynne in an old school record.","zh":"我在一份旧的学校档案里发现了 Kynne 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic, mainly Middle English) A kind, type, or nature; sometimes also “kin/family.”","zh":"（古语，主要见于中古英语）种类、类型、本性；有时也可指“亲族/家族”。"},"examples":[{"en":"In older writing, “of that kynne” can mean “of that kind.”","zh":"在较古老的写法中，“of that kynne”可表示“属于那一类”。"},{"en":"The word “kynne” could refer to one’s kin or family in medieval texts.","zh":"在中世纪文本中，“kynne”有时可指亲族或家族。"}]}],"synonyms":["(archaic) kind","type","sort","(archaic) kin","family"],"phonetic":"/kɪn/","extraExplanation":["“Kynne”更多时候会被当作人名/姓氏来理解；作为词汇用法则偏古老，常见拼写还有“kynde / kin / kind”。","中古英语里的“kynne”与现代英语“kin（亲族）”和“kind（种类/仁慈）”在词源上有关联：它们都来自表示“同类、同族”的古日耳曼语词根。"]}
{"word":"kynurenic","summary":{"en":"Kynurenic means “related to kynurenic acid or the kynurenine (tryptophan-breakdown) pathway.”","zh":"kynurenic 指“与犬尿喹啉酸或犬尿氨酸（色氨酸分解）通路相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to kynurenic acid or the kynurenine pathway (a biochemical route that breaks down the amino acid tryptophan).","zh":"与犬尿喹啉酸（kynurenic acid）或犬尿氨酸通路（分解色氨酸的生化代谢途径）有关的。"},"examples":[{"en":"Researchers measured kynurenic levels in the blood to study inflammation.","zh":"研究人员测量血液中的犬尿喹啉酸水平，以研究炎症。"},{"en":"Kynurenic metabolites are often discussed in neuroscience and psychiatry studies.","zh":"在神经科学与精神病学研究中，常会讨论与犬尿喹啉酸相关的代谢物。"}]}],"synonyms":["kynurenine-pathway–related"],"phonetic":"/ˌkaɪnjʊˈrɛnɪk/","extraExplanation":["“kynurenic”主要用于学术/医学语境，最常见搭配是“kynurenic acid（犬尿喹啉酸）”。该物质属于色氨酸代谢（犬尿氨酸通路）的产物之一，常在免疫、炎症、神经递质调节等研究中出现。"]}
{"word":"kynurin","summary":{"en":"Kynurenine is a biological chemical produced from tryptophan breakdown, commonly discussed in medical and biochemical contexts.","zh":"犬尿氨酸是色氨酸分解产生的生物化学物质，常见于医学与生化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical made in the body when it breaks down the amino acid tryptophan (part of the “kynurenine pathway”); it is studied in biology and medicine, especially in relation to the brain and the immune system","zh":"犬尿氨酸（人体分解色氨酸时生成的一种化学物质，属于“犬尿氨酸途径”；在生物与医学研究中常见，尤其与大脑和免疫系统有关）"},"examples":[{"en":"Researchers measured kynurenine levels in the blood.","zh":"研究人员测量了血液中的犬尿氨酸水平。"},{"en":"Kynurenine is produced when the body breaks down tryptophan.","zh":"当人体分解色氨酸时会产生犬尿氨酸。"}]}],"synonyms":["L-kynurenine"],"phonetic":"/kaɪˈnjʊərəniːn/","extraExplanation":["“kynurin”更常见是对 **kynurenine** 的拼写简写或拼写错误；标准英文拼写通常为 **kynurenine**（名词）。","该词多出现在学术论文、医学检验或生物化学语境中，日常英语里很少使用；如果你是在报告/化验单里看到它，通常与色氨酸代谢相关指标有关。","词源上与希腊语 *kyon*（狗）有关：早期研究中该代谢产物与尿液有关，因此有“犬尿-”这一译名。"]}
{"word":"kynurine","summary":{"en":"Kynurenine is a tryptophan-breakdown compound in the body, often studied for effects on the brain and immunity.","zh":"犬尿氨酸是人体分解色氨酸时产生的化合物，常因其可能影响大脑与免疫功能而被研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical made in the body when the amino acid tryptophan is broken down (especially in the kynurenine pathway); it is studied because it can affect the brain and the immune system","zh":"（生化）犬尿氨酸：人体分解氨基酸“色氨酸”（尤其经“犬尿氨酸通路”）时产生的一种天然化合物；常用于研究其对大脑与免疫系统的影响"},"examples":[{"en":"Kynurenine is produced when the body metabolizes tryptophan.","zh":"当人体代谢色氨酸时，会产生犬尿氨酸。"},{"en":"Some studies link changes in kynurenine levels to inflammation and mood-related disorders.","zh":"一些研究将犬尿氨酸水平的变化与炎症及情绪相关障碍联系起来。"}]}],"synonyms":["kynurenine","L-kynurenine"],"phonetic":"/kaɪˈnʊrənin/","extraExplanation":["你输入的“kynurine”更常见的标准拼写是 **kynurenine**（来自希腊语 *kynos*“狗”+ *ouron*“尿”，与早期在狗尿中发现的相关化合物有关）。","犬尿氨酸本身不是“维生素/激素”，而是色氨酸代谢链上的“中间产物”。它可进一步转化为多种下游物质（如 kynurenic acid、quinolinic acid），这些物质在神经科学与免疫学研究中较常被提及。"]}
{"word":"kyoodle","summary":{"en":"“Kyoodle” is not a standard English word; it’s usually a brand or invented name, so its meaning depends on context.","zh":"“Kyoodle”不是标准英语词汇；通常是品牌名或自造名称，具体含义要看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare word that is most often seen as a brand name or a made-up name; it does not have a widely accepted dictionary meaning in standard English.","zh":"一个很少见的词，多数情况下作为品牌名或人为创造的名称使用；在标准英语里没有公认的词典释义。"},"examples":[{"en":"I couldn’t find a standard dictionary definition for “Kyoodle.”","zh":"我找不到“Kyoodle”的标准词典释义。"},{"en":"Kyoodle may be a product name, so its meaning depends on the company that uses it.","zh":"Kyoodle 可能是产品名，所以它的含义取决于使用它的公司。"}]},{"partOfSpeech":"n.","definition":{"en":"(As a name) a proper noun used for a person, character, app, or product; it functions like a title rather than a regular vocabulary word.","zh":"（作为名称）用于人名、角色名、应用名或产品名的专有名词；更像“标题/名字”，而不是普通词汇。"},"examples":[{"en":"Kyoodle is the name of the game my cousin plays.","zh":"Kyoodle 是我表弟在玩的那个游戏的名字。"},{"en":"Have you tried the Kyoodle app yet?","zh":"你试过 Kyoodle 这个应用了吗？"}]}],"phonetic":"/kaɪˈuːdəl/","extraExplanation":["“Kyoodle”看起来更像是商标/产品名或网络自造词，而不是传统词汇。此类词通常不会出现在主流词典里，含义也不固定。","如果你能提供一句包含它的原句、它出现的网站/产品、或你想表达的意思（比如是人名、游戏名、玩具名等），我可以更准确地解释它在那个语境中的含义与用法。"]}
{"word":"kyoodled","summary":{"en":"“Kyoodled” is not standard English; it’s usually a playful/mistyped form of “canoodled” or “cuddled.”","zh":"“kyoodled”不是标准英语，通常是俏皮/误拼，想表达“canoodled”或“cuddled”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling. Most often a misspelling of “canoodled” (kissed and cuddled in a romantic/affectionate way) or “cuddled” (held someone close affectionately).","zh":"非标准拼写。常见是把“canoodled”（亲昵地接吻、搂抱调情）或“cuddled”（亲密地拥抱、依偎）拼错。"},"examples":[{"en":"I think you meant “canoodled”: They canoodled on the couch while watching a movie.","zh":"你可能想写“canoodled”：他们一边看电影一边在沙发上亲昵地依偎、接吻。"},{"en":"If you meant “cuddled”: The child cuddled up to her mom.","zh":"如果你想表达“cuddled”：孩子依偎在妈妈身边。"}]}],"synonyms":["canoodled","cuddled","snuggled","nuzzled"],"phonetic":"/ˈkjuːd(ə)ld/","extraExplanation":["“kyoodled”不是常见英文词典词条。如果你是在短信、小说对话或可爱卖萌的语境里看到它，往往是为了模仿发音/营造俏皮感（把 /kjuː/ 这种“kyoo-”音写出来）。","更地道的写法通常是：\n- canoodled：偏“暧昧/情侣式”的亲昵（带调情意味）\n- cuddled：更中性，可用于家人、朋友、宠物之间的拥抱依偎\n如果你能提供原句，我可以帮你判断最准确对应哪一个词。"]}
{"word":"kyoodling","summary":{"en":"“Kyoodling” is not a standard English word; it’s likely a playful online spelling, often implying doing something in a cute/silly way.","zh":"“Kyoodling”不是标准英语词，更像网络上的玩笑式拼写，常用来暗示“很可爱/很傻萌地做某事”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or playful spelling found online; it does not have a widely accepted dictionary meaning. People may use it to suggest doing something in a “cute” way (for example, making cute sounds or casually scribbling).","zh":"一种非标准、偏网络/玩笑式的拼写；并没有公认的词典释义。有人会用它来表达“很可爱地做某事”（例如发出可爱的声音，或随手乱画）。"},"examples":[{"en":"I couldn’t find a clear definition of “kyoodling,” but it seems like playful internet spelling.","zh":"我查不到“kyoodling”的明确释义，但它看起来像是网络上的玩笑式拼写。"},{"en":"She posted a video of her cat kyoodling around the room (meaning: acting cute and silly).","zh":"她发了一个视频，说她的猫在房间里“kyoodling”（意思是：又萌又傻地闹腾）。"}]}],"synonyms":["yodeling","doodling","cooing","goofing around"],"phonetic":"/ˈkjudlɪŋ/","extraExplanation":["更常见、可能的目标词：\n1) yodeling（约德尔唱法/山歌式高低音转换的歌唱）——常见于阿尔卑斯、乡村音乐等语境。\n2) doodling（随手涂鸦）——上课或开会时在纸上乱画。\n如果你告诉我你看到“kyoodling”的句子或视频链接/截图语境，我可以帮你判断更接近哪一个。"]}
{"word":"kyoto","summary":{"en":"Kyoto is a historic Japanese city, once the imperial capital, famous for traditional culture and temples.","zh":"Kyoto（京都）是日本历史名城，曾为古都，以传统文化与寺庙闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Kyoto: a major city in Japan, famous for its long history as the country’s former imperial capital and for its temples, traditional culture, and gardens.","zh":"京都：日本的重要城市，以曾是日本的古都（皇城）而闻名，也以寺庙、传统文化与庭园著称。"},"examples":[{"en":"Kyoto is known for its historic temples and traditional streets.","zh":"京都以历史悠久的寺庙和传统街区而闻名。"},{"en":"We took a day trip from Osaka to Kyoto.","zh":"我们从大阪到京都进行了一日游。"}]}],"synonyms":["the former Japanese capital (description)","Kyoto City"],"phonetic":"/ˈkjoʊtoʊ/","extraExplanation":["京都在794年成为日本都城，称为“平安京”，此后长期作为政治与文化中心；即使后来首都迁到东京，京都仍被视为日本传统文化的重要象征。","英文里“Kyoto”通常指城市本身；谈到“京都府”时，会说 Kyoto Prefecture（京都府是日本的一个行政区，范围比京都市更大）。"]}
{"word":"kyphoscoliosis","summary":{"en":"Kyphoscoliosis is a combined spinal deformity: kyphosis (forward rounding) plus scoliosis (sideways curvature).","zh":"Kyphoscoliosis 指脊柱同时存在后凸与侧弯的综合性畸形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the spine has both an outward hump (kyphosis) and a sideways curve (scoliosis), causing an abnormal overall spinal curvature","zh":"（医学）脊柱同时出现后凸（驼背样弯曲）与侧弯（向侧面弯曲）的情况，导致脊柱总体畸形"},"examples":[{"en":"The doctor diagnosed her with kyphoscoliosis after reviewing the X-ray.","zh":"医生查看X光片后诊断她患有脊柱后侧弯（kyphoscoliosis）。"},{"en":"Severe kyphoscoliosis can make breathing more difficult because it affects the shape of the chest.","zh":"严重的脊柱后侧弯可能会影响胸廓形状，从而使呼吸更困难。"}]}],"synonyms":["combined kyphosis and scoliosis","spinal deformity (general)"],"phonetic":"/ˌkaɪfoʊˌskoʊliˈoʊsɪs/","extraExplanation":["词源提示：kypho- 来自希腊语，表示“弯曲/驼背样后凸”；scoliosis 表示“脊柱侧弯”。合起来强调“同时存在两种方向的弯曲”。","使用语境：这是较正式的医学术语，日常交流中更常听到 kyphosis（脊柱后凸/驼背）或 scoliosis（脊柱侧弯）分别描述。"]}
{"word":"kyphoscoliotic","summary":{"en":"A medical adjective meaning “having both kyphosis and scoliosis.”","zh":"医学形容词：指“同时存在脊柱后凸与脊柱侧弯”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) having both kyphosis and scoliosis; having an abnormally rounded (hunched) spine plus a sideways curvature.","zh":"（医学）同时患有脊柱后凸与脊柱侧弯的；脊柱既向后弯曲（驼背样）又向侧方弯曲的。"},"examples":[{"en":"The X-ray showed a kyphoscoliotic spine, with both a forward hump and a lateral curve.","zh":"X 光显示脊柱为 kyphoscoliotic（后凸合并侧弯），既有向前的驼峰样弯曲，也有向侧方的弯曲。"},{"en":"Some patients with severe kyphoscoliotic deformity may have breathing difficulties.","zh":"部分严重后凸合并侧弯的患者可能会出现呼吸困难。"}]}],"synonyms":["kyphoscoliosis-related","having kyphoscoliosis","combined kyphotic and scoliotic"],"phonetic":"/ˌkaɪfoʊˌskoʊliˈɑtɪk/","extraExplanation":["词源提示：kypho- 来自希腊语 *kyphos*（“弯、驼背”），scolio- 来自 *skolios*（“弯曲的、歪斜的”），-otic 表示“……的/与……有关的”。因此该词直译就是“同时与后凸和侧弯相关的”。","常见使用场景：多用于医学影像报告、体格检查记录或疾病名称中（如 kyphoscoliotic deformity / kyphoscoliotic posture）。它通常描述“形态/体态”，不等同于具体病因。"]}
{"word":"kyphoses","summary":{"en":"Kyphoses is the plural form of kyphosis, meaning abnormal forward curvature of the upper spine (rounded upper back).","zh":"Kyphoses 是 kyphosis 的复数，指上段脊柱异常向前弯曲（上背圆、后凸）的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of kyphosis: abnormal forward rounding (curvature) of the upper back/spine","zh":"kyphosis（脊柱后凸）的复数：指上背部/脊柱出现异常向前弯曲、圆背的情况"},"examples":[{"en":"The doctor compared X-rays to track how the patient’s kyphoses changed over time.","zh":"医生对比了X光片，以追踪患者的多处脊柱后凸随时间的变化。"},{"en":"Severe kyphoses can cause back pain and affect breathing in some people.","zh":"严重的脊柱后凸可能导致背痛，并在某些人身上影响呼吸。"}]}],"synonyms":["spinal curvatures","rounded upper backs"],"phonetic":"/kaɪˈfoʊsiz/","extraExplanation":["“kyphosis/kyphoses”是医学用语，常见于影像学报告或骨科/脊柱科就诊记录中。日常英语里更常用更口语的说法如“hunched back / rounded upper back（驼背、上背圆）”。","词源来自希腊语“kyphos”，意为“弯曲、驼”。复数形式“kyphoses”属于以“-is”结尾的医学名词变复数为“-es”的类型（类似 diagnoses, analyses）。"]}
{"word":"kyphosidae","summary":{"en":"Kyphosidae is the scientific family name for sea chubs, a group of warm-water coastal marine fish.","zh":"Kyphosidae 是“海鲫（sea chubs）”这类暖水近海海水鱼的科学“科”名（鲹鲷科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine fish (the sea chubs), usually found in warm coastal waters; many are algae-eaters with deep, oval bodies","zh":"鲹鲷科（又称“海鲫/海鲷类、sea chubs”）：一类生活在温暖近海的海水鱼；常见特征是体形较高而侧扁，许多以藻类为食"},"examples":[{"en":"Many Kyphosidae are seen grazing on algae around rocky reefs.","zh":"许多鲹鲷科鱼类常在岩礁附近啃食藻类。"},{"en":"The sea chub belongs to the family Kyphosidae.","zh":"海鲫（sea chub）属于鲹鲷科。"}]}],"synonyms":["sea chub family","Kyphosid fish"],"phonetic":"/ˌkaɪfoʊˈsaɪdiː/","extraExplanation":["“Kyphosidae”是生物分类学中的“科”名（family）。在科名后缀“-idae”常用于动物分类（如Felidae猫科、Canidae犬科）。","词根“kyphos-”源自希腊语，含“弯曲、驼背”之意，可能与这类鱼较高、圆拱的体型外观有关。"]}
{"word":"kyphosis","summary":{"en":"Kyphosis is an abnormal rounding of the upper back due to an excessive outward curve of the spine.","zh":"Kyphosis 指上背部因脊柱向后弯曲过度而出现的异常圆弧（脊柱后凸/驼背样）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) An abnormal outward curvature of the upper spine, causing a rounded or “hunched” back.\nExample: The doctor said her back pain was related to kyphosis.（医生说她的背痛与脊柱后凸有关。）\nExample: Good posture can help prevent mild kyphosis from getting worse.（良好姿势有助于防止轻度脊柱后凸加重。）","zh":"（医学）脊柱（多为胸椎）向后异常弯曲，导致上背部圆弧、驼背样外观。\n例：医生说她的背痛与脊柱后凸有关。\n例：良好姿势有助于防止轻度脊柱后凸加重。"},"examples":[{"en":"The doctor said her back pain was related to kyphosis.","zh":"医生说她的背痛与脊柱后凸有关。"},{"en":"Good posture can help prevent mild kyphosis from getting worse.","zh":"良好姿势有助于防止轻度脊柱后凸加重。"}]}],"synonyms":["hunchback (informal)","spinal curvature","hyperkyphosis"],"phonetic":"/kaɪˈfoʊsɪs/","extraExplanation":["“Kyphosis”来自希腊语 *kyphos*（意为“弯曲、驼背”）+ *-osis*（表示“状态/病变”），属于医学术语。","日常中文常译为“脊柱后凸”或“驼背”。需要注意：口语里的“驼背”不一定是医学诊断；而医学上的kyphosis强调脊柱曲度异常（可轻可重）。","常见原因包括不良姿势（姿势性后凸）、骨质疏松导致椎体压缩性骨折（老年人较常见）、青少年Scheuermann病（结构性后凸）等；治疗可能从姿势训练、物理治疗到支具或手术，需由专业医生评估。"]}
{"word":"kyphotic","summary":{"en":"Kyphotic describes a hunched or abnormally rounded upper back, related to kyphosis.","zh":"Kyphotic 指上背部呈后凸、驼背样的弯曲状态，与脊柱后凸（kyphosis）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an abnormal outward curve of the upper back (a hunched or rounded-back posture), often related to kyphosis.","zh":"（上背部）后凸的；呈驼背样弯曲的（常与“脊柱后凸/驼背”kyphosis有关）。"},"examples":[{"en":"The doctor noted a kyphotic posture during the physical exam.","zh":"医生在体检时注意到他有后凸的姿势。"},{"en":"Long hours of slouching at a desk can contribute to a more kyphotic upper back.","zh":"长时间趴坐在书桌前可能会让上背部更容易呈现后凸。"},{"en":"The brace was used to help prevent the spine from becoming more kyphotic over time.","zh":"使用支具是为了帮助防止脊柱随着时间变得更后凸。"}]}],"synonyms":["hunched","rounded-back","stooped"],"phonetic":"/kaɪˈfɑtɪk/","extraExplanation":["这是一个医学/解剖学用词，日常口语里更常说“hunched”或“rounded back”。“kyph-”来自希腊语，表示“弯、拱”。常见搭配有“kyphotic posture（后凸体态）”“kyphotic curve（后凸弧度）”。注意它描述的是“向后凸”的弯曲；与“lordotic（前凸）”相对。"]}
{"word":"kyrial","summary":{"en":"Kyrial means “connected to the Kyrie (‘Lord, have mercy’)” and can also mean a book/section containing Kyrie musical settings.","zh":"kyrial 指“与礼仪中的 Kyrie（主啊，求你怜悯）相关的”，也可指“收录 Kyrie 曲调/唱段的书或章节”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Kyrie (“Kyrie eleison,” meaning “Lord, have mercy”) in Christian (especially Catholic and Anglican) liturgy.","zh":"（尤指天主教、圣公会礼仪中）与“Kyrie（Kyrie eleison，意为‘主啊，求你怜悯’）”有关的；用于“Kyrie”祈求文的。"},"examples":[{"en":"The choir rehearsed a kyrial chant for Sunday’s Mass.","zh":"合唱团为周日弥撒排练了一段用于“Kyrie”的圣咏。"},{"en":"In some services, the kyrial response is sung by the congregation.","zh":"在一些礼拜中，会众会唱出“Kyrie”的应答。"}]},{"partOfSpeech":"n.","definition":{"en":"A book or section of a liturgical book containing musical settings of the Kyrie (often grouped by seasons or occasions).","zh":"（礼仪用）收录“Kyrie”唱段/曲调的书（或礼仪书中的相关部分），常按教会年节期或不同场合编排。"},"examples":[{"en":"The organist opened the kyrial to choose a setting of the Kyrie.","zh":"风琴师翻开那本收录“Kyrie”曲调的书，挑选一个版本。"},{"en":"Older kyrials may list several Kyrie melodies for different feast days.","zh":"较早的“Kyrial”书里可能会列出多个节日用的“Kyrie”旋律。"}]}],"synonyms":["Kyrie-related","liturgical"],"phonetic":"/ˈkɪriəl/","extraExplanation":["“Kyrial”源自教会拉丁语/希腊语传统：Kyrie 来自希腊语“Κύριε”（主啊）。在西方礼仪中，Kyrie 常出现在礼拜开头的认罪/恳求环节。","这个词在日常英语中很少见，更多出现在教会音乐、礼仪研究或合唱/圣咏相关语境里。"]}
{"word":"kyriale","summary":{"en":"Kyriale = a chant book/section containing Mass Ordinary settings (especially the Kyrie) in Catholic liturgy.","zh":"Kyriale＝天主教礼仪圣咏曲集/篇章，收录弥撒常用经文（尤其《垂怜经 Kyrie》）的曲调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a book or section of a Roman Catholic chant book that contains the sung parts of the Mass Ordinary (especially the Kyrie, Gloria, Sanctus, and Agnus Dei), often in Gregorian chant settings.","zh":"（天主教礼仪/圣乐）《Kyriale》：收录弥撒“常用经文”（尤其是《垂怜经 Kyrie》《光荣颂 Gloria》《欢呼圣哉 Sanctus》《羔羊颂 Agnus Dei》）的圣咏/格里高利圣咏曲调的书或篇章。"},"examples":[{"en":"The choir practiced from the Kyriale for Sunday Mass.","zh":"合唱团用《Kyriale》来排练主日弥撒的圣咏。"},{"en":"In a traditional Latin Mass, the Kyriale provides several chant settings of the Kyrie.","zh":"在传统拉丁弥撒中，《Kyriale》提供多种《垂怜经》的圣咏曲调版本。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) relating to the “Kyrie” (“Lord, have mercy”) in Christian liturgy.","zh":"（较少用）与礼仪中的《垂怜经 Kyrie》（“主啊，求你垂怜”）相关的。"},"examples":[{"en":"The composer wrote a kyriale-style melody for the opening prayer.","zh":"作曲家为开场祈祷写了一段带有“Kyrie风格”的旋律。"}]}],"synonyms":["chant book","Mass Ordinary (settings)","Kyrie (contextually)"],"phonetic":"/ˌkɪriˈɑːleɪ/","extraExplanation":["“Kyriale”来自拉丁语礼仪传统，核心与希腊语“Κύριε ἐλέησον（Kyrie eleison，主啊，求你垂怜）”有关。虽然弥撒多为拉丁文，但“Kyrie”这句长期保留希腊文形式。","在西方音乐史与教会音乐语境中，你更常见到“Kyrie”（单指一段经文/乐章）或“Kyrie eleison”（完整短句）。而“Kyriale”更偏向“曲集/书名/章节名”，多见于礼仪、合唱、格里高利圣咏资料中。"]}
{"word":"kyrie","summary":{"en":"Kyrie is a liturgical prayer meaning “Lord, have mercy,” and also the musical movement based on those words in a Mass setting.","zh":"Kyrie 指礼仪中的“主啊，怜悯”祷文，也指以该词句谱写的弥撒（或合唱）乐章。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Christian liturgy) A short prayer meaning “Lord, have mercy,” especially the line “Kyrie eleison,” used in church services and the Mass.","zh":"（基督教礼仪）意为“主啊，怜悯（我们）”的短祷文，尤指礼仪中的“Kyrie eleison（主啊，怜悯）”，常用于弥撒与礼拜中。"},"examples":[{"en":"The congregation sang the Kyrie before the readings.","zh":"会众在读经前唱了“Kyrie（主啊，怜悯）”。"},{"en":"In many churches, the Kyrie is repeated several times.","zh":"在许多教会中，Kyrie 会重复多次。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) The part of a Mass—or a choral piece—set to the words of the Kyrie, often forming the opening movement of a Mass setting.","zh":"（音乐）以 Kyrie 词句谱写的弥撒乐段或合唱乐章，常作为弥撒套曲的开篇乐章。"},"examples":[{"en":"Mozart’s Mass begins with a powerful Kyrie.","zh":"莫扎特的弥撒以气势强烈的 Kyrie 开篇。"},{"en":"The choir rehearsed the Kyrie and Gloria for the concert.","zh":"合唱团为音乐会排练了 Kyrie 和 Gloria。"}]}],"synonyms":["Kyrie eleison","Lord, have mercy"],"phonetic":"/ˈkɪri.eɪ/","extraExplanation":["“Kyrie”来自希腊语“Κύριε（Kýrie）”，意为“主啊”。完整常见句是“Kyrie eleison”，直译“主啊，怜悯（我们）”。虽然源自希腊语，但在拉丁礼天主教弥撒中也长期保留使用，因此在西方音乐与宗教语境里非常常见。","英语中常把“Kyrie”当作专有名词使用（首字母大写），指礼仪片段或对应的音乐乐章；在合唱/古典音乐圈里，读音常接近“KEER-ee-ay”。"]}
{"word":"kyrielle","summary":{"en":"A kyrielle is a poem with short stanzas and a repeating refrain line.","zh":"kyrielle是一种由短诗节组成、并反复使用叠句的诗歌体裁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poem form made of short stanzas (usually quatrains) with the same line repeated as a refrain, often with eight syllables per line","zh":"一种诗歌体裁：由短诗节（常为四行诗节）组成，并反复使用同一句作为叠句（refrain），每行常为八音节"},"examples":[{"en":"She wrote a kyrielle in four-line stanzas, repeating the final line like a song chorus.","zh":"她写了一首kyrielle，用四行诗节组成，并像歌的副歌一样反复最后一句。"},{"en":"In class we practiced writing a kyrielle to learn how repetition shapes meaning.","zh":"课堂上我们练习写kyrielle，学习重复如何塑造含义。"}]}],"synonyms":["refrain poem","fixed verse form","poetic form"],"phonetic":"/ˌkɪriˈɛl/","extraExplanation":["“kyrielle”来自法语，和教会礼仪中的“Kyrie eleison（主啊，求怜悯）”有关，因此常带有“连串、反复吟唱”的感觉。","这种体裁在英语诗歌学习中常见的规则是：每节四行、每行八音节（octosyllabic），并用同一句反复作叠句；不同教材对细节可能略有变化。"]}
{"word":"kyries","summary":{"en":"“Kyries” is the plural of “Kyrie,” usually referring to the liturgical prayer “Lord, have mercy,” or (less commonly) multiple people named Kyrie.","zh":"“kyries”是“Kyrie”的复数，通常指礼仪祷文“主啊，求你怜悯”（垂怜经）；也可指多个名叫 Kyrie 的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “Kyrie”: a short Christian liturgical prayer meaning “Lord, have mercy,” often sung or said in church services (especially in the Mass).","zh":"“Kyrie”的复数：基督教礼仪中的短祷文，意思是“主啊，求你怜悯”，常在教会礼拜中吟唱或诵念（尤其在弥撒中）。"},"examples":[{"en":"The choir sang several kyries during the service.","zh":"诗班在礼拜中唱了几段“垂怜经”（kyries）。"},{"en":"Different composers wrote kyries in very different styles.","zh":"不同作曲家写的“垂怜经”风格差异很大。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of the proper name “Kyrie” (people named Kyrie).","zh":"专有名词“Kyrie”的复数：指多个名叫 Kyrie 的人。"},"examples":[{"en":"There were two Kyries in my class, so we used last names.","zh":"我们班有两个叫 Kyrie 的同学，所以大家用姓来区分。"}]}],"synonyms":["Kyrie eleison","Lord, have mercy"],"phonetic":"/ˈkɪri/","extraExplanation":["“Kyrie”来自希腊语“Κύριε”（Kyrie），意思是“主啊”。完整常见形式是“Kyrie eleison”，直译为“主啊，求你怜悯”。在西方古典音乐与教会音乐里，“Kyrie”也常指弥撒曲（Mass）中对应的一个乐章/段落。"]}
{"word":"kyrine","summary":{"en":"“Kyrine” is not a standard English word; it’s usually a name or a variant/misspelling of Kyrene/Cyrene (ancient Cyrene).","zh":"“kyrine”不是标准英语词；通常是名字，或Kyrene/Cyrene（昔兰尼）的变体/误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare/nonstandard spelling, usually a name. In English, “kyrine” is not a common dictionary word; it is most often seen as a variant/misspelling of “Kyrene/Cyrene” (an ancient Greek city in North Africa) or as an invented personal name.","zh":"一种较少见/非标准的拼写，通常作为名字使用。在英语里“kyrine”并不是常见词典词；它多见于“Kyrene/Cyrene”（北非古希腊城市“昔兰尼”）的变体/误拼，或作为自创的人名。"},"examples":[{"en":"I couldn’t find “kyrine” in a dictionary—do you mean “Cyrene/Kyrene”?","zh":"我在词典里找不到“kyrine”——你是想写“Cyrene/Kyrene”吗？"},{"en":"Kyrene (also spelled Cyrene) was an important ancient Greek city in present-day Libya.","zh":"Kyrene（也拼作Cyrene）是位于今利比亚的一座重要古希腊城市。"}]}],"synonyms":["Cyrene","Kyrene"],"phonetic":"/saɪˈriːni/","extraExplanation":["如果你是在文章或作业里看到“kyrine”，很可能是把 Cyrene/Kyrene（昔兰尼）拼错了：英文里常见两种拼法，Cyrene 更常用于英文历史写作，Kyrene 更贴近希腊语转写。","在《圣经》语境里更常见的是 “Simon of Cyrene”（昔兰尼的西门）。如果你提供一句包含“kyrine”的原句，我可以帮你判断它到底指地名、人名，还是别的专有名词/品牌名。"]}
{"word":"kyriologic","summary":{"en":"Kyriologic is a rare adjective used mostly in theology to mean “related to (Christ’s) lordship,” especially the confession of Jesus as Lord.","zh":"Kyriologic 是一个较少见的形容词，多用于神学语境，表示“与（基督的）主权/主位有关”，尤其指对“耶稣为主”的理解与论述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Christ’s lordship (the title “Lord”) in Christian theology; concerned with understanding Jesus as “Lord.”","zh":"（基督教神学）与基督的“主权/主位”（“主”这一称号）有关的；探讨耶稣作为“主”的理解。"},"examples":[{"en":"The book offers a kyriologic reading of Paul’s letters, focusing on what it means to confess Jesus as Lord.","zh":"这本书以“主位/主权”视角解读保罗书信，重点讨论“承认耶稣为主”意味着什么。"},{"en":"In a kyriologic framework, worship language is closely tied to questions of authority and allegiance.","zh":"在“主位”框架中，敬拜用语与权威和效忠的问题紧密相关。"}]},{"partOfSpeech":"adj.","definition":{"en":"More broadly (academic/rare): relating to “lordship” or mastery.","zh":"更广义（学术用语/较少见）：与“主宰、支配、主人身份（lordship）”有关的。"},"examples":[{"en":"Some scholars use kyriologic language to discuss how power is expressed through titles like “lord” or “master.”","zh":"有些学者用“kyriologic”相关表述来讨论“lord / master”等称号如何体现权力。"}]}],"synonyms":["Christological","lordship-related","theological"],"phonetic":"/ˌkɪriəˈlɑdʒɪk/","extraExplanation":["词源：kyriologic 来自希腊语 kyrios（“主、主宰”）+ -log-（与“言说/论述/研究”相关）+ -ic（形容词后缀）。因此它常用于“关于‘主’这一称号/主权的论述”。","使用场景：该词在日常英语中非常罕见，主要见于神学、宗教学、圣经研究或学术写作中。更常见的替代表达包括 Christological（基督论的）、about the lordship of Christ（关于基督主权的）、theology of Lordship（主权神学）。","相关概念：在新约与早期基督教语境中，“Jesus is Lord（耶稣是主）”不仅是敬拜称呼，也可带有身份认同与效忠含义，因此 kyriologic 讨论有时会涉及政治/社会语境下的“权威与忠诚”。"]}
{"word":"kyrios","summary":{"en":"Kyrios is a Greek noun meaning “Lord,” especially used in the Bible as a title for God or Jesus.","zh":"Kyrios 是希腊语名词，意为“主”，在圣经语境中尤指上帝或耶稣的称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Greek word meaning “Lord” or “master,” used especially as a title for God or Jesus in the New Testament.","zh":"希腊语词，意为“主 / 主人”，在《新约》中常作为上帝或耶稣的称号。"},"examples":[{"en":"In many English Bibles, the Greek word kyrios is translated as “Lord.”","zh":"在许多英文《圣经》中，希腊语 kyrios 常被译为“Lord（主）”。"},{"en":"Early Christians confessed, “Jesus is kyrios,” meaning “Jesus is Lord.”","zh":"早期基督徒宣认“Jesus is kyrios”，意思是“耶稣是主”。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical/general) a respectful title meaning “sir” or “lord,” used for a person of authority in ancient Greek contexts.","zh":"（历史/一般用法）对有权势者的尊称，相当于“先生 / 大人 / 领主”。"},"examples":[{"en":"A servant might address his master as kyrios in everyday speech.","zh":"仆人日常可能用 kyrios 来称呼主人。"}]}],"synonyms":["Lord","master","sir"],"phonetic":"/ˈkɪri.oʊs/","extraExplanation":["Kyrios（κύριος）在《七十士译本》（希伯来圣经的希腊文译本）中常用来对应上帝的圣名 YHWH（耶和华），因此在《新约》里用 kyrios 指称耶稣时，往往带有很强的神学意味：不仅是“主人”，也暗含“主、神”的身份宣告。","英语圣经里常见的排版习惯：LORD（全大写）有时用来表示原文是上帝的圣名（YHWH），而 Lord（首字母大写）更常是一般“主”的称号；但不同译本规则不完全一致。"]}
{"word":"kyschty","summary":{"en":"“kyschty” isn’t standard English; you may mean “kitsch,” meaning showy, overly sentimental ‘bad taste’ art or decor (sometimes enjoyed ironically).","zh":"“kyschty”不是标准英语词；你可能想写“kitsch”，指浮夸、过度煽情、常被认为品味不佳的艺术或装饰（有时也会被反讽式地喜欢）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a name. Many learners who type “kyschty” may mean “kitsch,” a common English word.","zh":"不是标准英语单词；更可能是拼写错误或人名/地名。很多学习者输入“kyschty”时，可能想写的是常见英语词“kitsch”。"},"examples":[{"en":"I can’t find “kyschty” in an English dictionary—did you mean “kitsch”?","zh":"我在英语词典里找不到“kyschty”——你是不是想写“kitsch”？"},{"en":"If you tell me the sentence you saw it in, I can help identify the correct word.","zh":"如果你把它出现的句子发给我，我可以帮你判断正确的词。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) “kitsch”: art, design, or objects that are showy, overly sentimental, or in “bad taste,” sometimes enjoyed in a playful or ironic way.","zh":"（可能想写的词）“kitsch”：指浮夸、过度煽情、被认为“品味不佳”的艺术/设计/物品；有时人们会以戏谑或反讽的方式欣赏。"},"examples":[{"en":"The hotel lobby is full of kitsch: fake gold statues and glittery paintings.","zh":"酒店大堂充满了俗艳装饰：仿金雕像和亮闪闪的画。"},{"en":"Some people love kitsch because it feels fun and nostalgic.","zh":"有些人喜欢这种俗艳风格，因为它有趣又让人怀旧。"},{"en":"The movie uses kitsch on purpose to create a campy style.","zh":"这部电影故意使用俗艳元素来营造夸张搞怪的风格。"}]}],"synonyms":["tacky","gaudy","camp","cheesy"],"phonetic":"/kɪtʃ/","extraExplanation":["“kitsch”源自德语，常用来评价艺术/装饰“华而不实、过分甜腻”。在英语里也常带一点幽默或反讽：你可能知道它有点“俗”，但仍觉得好玩、可爱。","如果“kyschty”是你看到的用户名、地名或品牌名，请把上下文（完整句子/链接/截图）发来，我可以更准确判断。"]}
{"word":"kyschtymite","summary":{"en":"Kyshtymite is a rare mineral named after Kyshtym, Russia.","zh":"Kyshtymite 是一种罕见矿物，名称来自俄罗斯的基什特姆（Kyshtym）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral species named after Kyshtym (a town in Russia).","zh":"一种罕见的矿物名称，得名于俄罗斯的基什特姆（Kyshtym）镇。"},"examples":[{"en":"Kyshtymite is a rare mineral that is mainly discussed in mineralogy references.","zh":"Kyshtymite（基什特姆矿）是一种罕见矿物，主要出现在矿物学资料中。"},{"en":"The museum label listed the specimen as kyshtymite, but it is not commonly seen in everyday geology classes.","zh":"博物馆的标签把这块标本标为kyshtymite，但在一般地质课程里并不常见。"}]}],"phonetic":"/kɪʃˈtaɪmaɪt/","extraExplanation":["你输入的“kyschtymite”很可能是拼写误差；更常见的拼法是 **kyshtymite**（以Kyshtym地名命名的矿物）。如果你告诉我它出现的语境（论文、展品标签、聊天等），我可以进一步核对是否还有其他可能的拼法或指代。","这类以地名命名的矿物后缀 **-ite** 很常见，意思大致是“……矿/……石”（如 graphite 石墨、calcite 方解石）。"]}
{"word":"kyte","summary":{"en":"Kyte is a dialect/older spelling of “kite,” most often meaning the bird of prey (especially the red kite), and more rarely the flying toy; it can also be a surname.","zh":"Kyte通常是“kite”的方言/较旧拼写，多指猛禽（尤指红鸢），较少指风筝；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, chiefly Scottish/Northern English) A kite: a large bird of prey, especially the red kite.","zh":"（方言，主要见于苏格兰/英格兰北部）“kite（鸢/鹞）”：一种大型猛禽，尤指红鸢。"},"examples":[{"en":"In old Scottish writing, you may see “kyte” used for the red kite.","zh":"在较早的苏格兰文字里，你可能会看到用“kyte”来指红鸢。"},{"en":"A kyte circled above the valley, searching for food.","zh":"一只kyte在山谷上空盘旋，寻找食物。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare spelling) A kite: a light frame covered with paper or cloth that you fly in the wind.","zh":"（少见拼写）风筝：用纸或布蒙在骨架上、借风放飞的玩具。"},"examples":[{"en":"The book uses the spelling “kyte,” but it means the same as “kite.”","zh":"这本书用“kyte”这种拼写，但意思和“kite”一样。"},{"en":"The children ran across the field to fly a kyte.","zh":"孩子们跑过田野去放风筝。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏。"},"examples":[{"en":"Kyte is also used as a last name in English-speaking countries.","zh":"“Kyte”在英语国家也可作姓氏。"}]}],"synonyms":["kite","red kite"],"phonetic":"/kaɪt/","extraExplanation":["“Kyte”多被视为“kite”的方言或古拼写，常见于苏格兰与英格兰北部的文本。阅读文学作品或地方史料时遇到它，一般可直接按“kite”来理解。"]}
{"word":"kytes","summary":{"en":"“Kytes” is the plural of “kyte,” an older/less common spelling of “kite” (a bird of prey). It can also mean “stomach” in old-fashioned informal use, and relates to the verb “kite” in finance.","zh":"“Kytes”是“kyte”的复数，“kyte”是较旧/较少见的“kite（鸢等猛禽）”拼写；也可在旧式口语中指“肚子”。在金融语境里还与动词“kite（开空头支票等套取资金）”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of kyte) a kite: a type of bird of prey (raptor), or sometimes the toy flown on a string.","zh":"（kyte 的复数）“kite”的另一种拼写：一种鸢/鹞等猛禽；有时也指用线放飞的风筝。"},"examples":[{"en":"We watched the kytes circling high over the fields.","zh":"我们看着那些鸢在田野上空高高盘旋。"},{"en":"In older spelling, “kyte” can mean the bird we usually spell “kite.”","zh":"在较旧的拼写里，“kyte”可以指我们现在通常拼作“kite”的那种鸟。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, old-fashioned) a person’s stomach or belly.","zh":"（非正式，较旧用法）肚子，腹部。"},"examples":[{"en":"After the big meal, his kyte felt uncomfortably full.","zh":"大吃一顿后，他的肚子胀得不舒服。"}]},{"partOfSpeech":"v.","definition":{"en":"(finance) to illegally or dishonestly obtain money or credit (for example, by writing checks without enough funds); to “kite” checks.","zh":"（金融）通过不诚实手段套取资金或信用（例如开空头支票）；“支票漂浮/套现”。"},"examples":[{"en":"The company was accused of kyting checks to cover short-term debts.","zh":"那家公司被指控用开空头支票的方式来应付短期债务。"}]}],"synonyms":["kites","raptors","hawks","belly","stomach","kite (checks)"],"phonetic":"/kaɪt/","extraExplanation":["“kyte/kytes”在现代英语里比较少见，最常见的拼写是“kite/kites”。在文学或方言文本中你更可能看到“kyte(s)”表示猛禽；而表示“肚子”的用法带有苏格兰或英式方言/旧式色彩。","如果你原本想写的是玩具“风筝”的复数，现代标准写法是 “kites”。"]}
{"word":"kythe","summary":{"en":"“Kythe” is a Scots word meaning “to appear/come to light” or “to make known/reveal.”","zh":"“kythe”是苏格兰英语词，常指“出现/显现”或“使人知晓/揭示”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Scots, literary) To appear; to come into view or become known.","zh":"（苏格兰英语/文学用语）出现；露面；显现；被人知晓。"},"examples":[{"en":"He did not kythe at the meeting, so we assumed he was sick.","zh":"他在会议上没有露面，所以我们以为他病了。"},{"en":"If the truth ever kythes, people will understand what happened.","zh":"如果真相哪天显现出来，人们就会明白发生了什么。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Scots, literary) To show or make (something) known; to reveal.","zh":"（苏格兰英语/文学用语）使（某事）为人所知；揭示；表明。"},"examples":[{"en":"She kythe’d her gratitude with a small gift.","zh":"她用一份小礼物表达（表明）了她的感激之情。"},{"en":"The letter kythed his true feelings.","zh":"那封信揭示了他真实的感受。"}]}],"synonyms":["appear","show up","come to light","emerge","reveal","make known"],"phonetic":"/kaɪð/","extraExplanation":["“kythe”主要见于苏格兰英语（Scots）与较具文学色彩的写作中，现代日常英语里不常用。读到它时，常可用更常见的“appear / show up / come to light / reveal / make known”来理解。"]}
{"word":"kythed","summary":{"en":"**kythed** is an uncommon Scots form meaning “appeared/showed up” or “became known,” the past form of *kythe*.","zh":" **kythed** 是不常见的苏格兰方言形式，表示“出现/露面”或“显现、为人所知”，是 *kythe* 的过去式形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots, dialect) Past tense/past participle of **kythe**: to appear or become visible; to show oneself; to make something known or evident.","zh":"（苏格兰方言）**kythe** 的过去式/过去分词：出现、露面；显现出来；（使某事）为人所知、变得明显。"},"examples":[{"en":"He **kythed** at the meeting after weeks away.","zh":"他离开了好几周后，终于在会议上露面了。"},{"en":"The truth **kythed** in the end.","zh":"真相最终显现出来了。"}]}],"synonyms":["appeared","showed up","emerged","became known"],"phonetic":"/kaɪðd/","extraExplanation":["“kythe / kyth(e)”主要见于苏格兰英语与苏格兰文学（Scots），在现代日常英语里很少使用。阅读苏格兰诗歌或小说时可能会遇到，如叙述人物“露面、现身”或“事情变得明显”。","拼写上常见变体：kythe / kythe(d) / kythit（不同地区与时期写法不同）。"]}
{"word":"kythes","summary":{"en":"“Kythes” is usually the Scots/archaic verb form of “kythe,” meaning “appears/comes into view” or “becomes known.”","zh":"“kythes”通常是苏格兰用语/古语动词“kythe”的第三人称形式，意思是“出现/露面”或“变得为人所知”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Scottish/archaic) To appear; to come into view or be found.","zh":"（苏格兰用语/古语）出现；露面；被发现。"},"examples":[{"en":"A deer kythed at the edge of the forest just before dusk.","zh":"黄昏前，一只鹿在森林边缘出现了。"},{"en":"If he kythes again, tell him I’m not home.","zh":"如果他又出现了，就告诉他我不在家。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Scottish/archaic) To become known; to show one’s qualities clearly.","zh":"（苏格兰用语/古语）变得为人所知；显露（某种品质）。"},"examples":[{"en":"Her kindness soon kythed in the way she treated newcomers.","zh":"她的善良很快就在她对待新来者的方式中显露出来。"},{"en":"The truth will kythe in time.","zh":"真相终会水落石出。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Scottish/archaic) To make known; to reveal.","zh":"（苏格兰用语/古语）使为人所知；揭示。"},"examples":[{"en":"He would not kythe his plans to anyone.","zh":"他不愿把计划透露给任何人。"}]}],"synonyms":["appear","show up","turn up","emerge","become known","reveal"],"phonetic":"/kaɪð/","extraExplanation":["你输入的“kythes”通常是动词“kythe”的第三人称单数现在时（he/she kythes）。","“kythe”多见于苏格兰英语与文学/民谣语境，现代日常英语里更常用 appear, show up, become known, reveal 等来表达相近意思。"]}
{"word":"kything","summary":{"en":"“Kything” is a Scots dialect word meaning an appearance or the act of showing up/becoming known.","zh":"“kything”是苏格兰方言词，表示“出现/露面”或“显露、为人所知”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots dialect) the act of appearing or becoming visible/known; a showing up.","zh":"（苏格兰方言）出现；显露；让人看见/知道。"},"examples":[{"en":"After weeks of silence, his kything in town surprised everyone.","zh":"沉默了好几周后，他在镇上突然出现让大家都很惊讶。"},{"en":"There was no sign or kything of the lost dog all day.","zh":"一整天都没有走失的狗的踪影或出现。"}]},{"partOfSpeech":"other","definition":{"en":"(Scots dialect, from the verb “to kythe”) appearing; showing yourself; coming to light.","zh":"（苏格兰方言，源自动词 kythe）正在出现；露面；逐渐为人所知。"},"examples":[{"en":"She’s been kything less since she moved away.","zh":"自从搬走后，她就更少露面了。"},{"en":"The truth is kything at last.","zh":"真相终于逐渐显露出来了。"}]}],"synonyms":["appearance","showing up","emergence","come to light","appear"],"phonetic":"/ˈkaɪðɪŋ/","extraExplanation":["“kything”在标准英语里非常少见，主要见于苏格兰英语（Scots）。它与动词“kythe”有关，意思是“显现、露面、让人知道”。在日常美式英语中，你更常用：appear, show up, emerge, come to light。","如果你其实想输入的是“key thing”（关键点/最重要的事情）或“anything”（任何事），告诉我语境/句子，我可以给你更准确的词条和用法。"]}
{"word":"kytoon","summary":{"en":"“Kytoon” is usually a name (brand/company); sometimes it’s used as a nonstandard spelling of “cartoon.”","zh":"“Kytoon”通常是名称（品牌/公司）；有时也被当作“cartoon（动画片/漫画）”的非标准拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) The name “Kytoon” is used by some media/animation brands or companies; it can refer to an entertainment/animation-related organization depending on context.","zh":"（专有名词）“Kytoon”常被一些媒体/动画相关品牌或公司用作名称；具体指哪一家机构要看语境。"},"examples":[{"en":"Kytoon produced animated content for children.","zh":"Kytoon 制作面向儿童的动画内容。"},{"en":"I saw the Kytoon logo at the end of the episode.","zh":"我在这一集结尾看到了 Kytoon 的标志。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal/creative spelling) A nonstandard spelling some people use online for “cartoon,” meaning an animated show or a humorous drawing.","zh":"（非正式/创意拼写）网络上有人用来代替“cartoon”的非标准拼写，意思是“动画片”或“漫画/讽刺画”。"},"examples":[{"en":"That kytoon is really funny.","zh":"那个“kytoon”（动画/漫画）真的很好笑。"},{"en":"I used to watch kytoons after school.","zh":"我以前放学后常看“kytoons”（动画片）。"}]}],"synonyms":["cartoon","animation","animated show"],"phonetic":"/kaɪˈtuːn/","extraExplanation":["“kytoon”不是常见的标准英语词汇。若你是在看视频片尾、商标、网站名，通常应理解为品牌/公司名，并注意大小写（Kytoon）。","如果你想表达“动画片/漫画”，标准拼写是 cartoon。你也可以把原句发我，我能帮你判断这里应不应该用 Kytoon 还是 cartoon。"]}
{"word":"kyu","summary":{"en":"“kyu” is mainly an internet exclamation meaning “so cute!”; it can also be a name or a context-specific abbreviation.","zh":"“kyu”主要是网络感叹词，表示“太可爱了！”；也可能是人名/昵称或特定语境下的缩写。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Internet/anime slang) A squeal or sound people type to show that something is very cute; similar to “aww!” or “squee!”","zh":"（网络/动漫圈俚语）用来表示“太可爱了！”的拟声/感叹词；类似于 “aww!” 或 “squee!”"},"examples":[{"en":"Kyu—look at that tiny puppy!","zh":"Kyu——看那只小奶狗，太可爱了！"},{"en":"She posted a baby photo and everyone replied “kyu!”","zh":"她发了宝宝照片，大家都回“kyu！”"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name or nickname (seen in some Asian contexts); used like a proper noun.","zh":"人名或昵称（在一些亚洲语境中可见）；作为专有名词使用。"},"examples":[{"en":"Kyu is my teammate on the project.","zh":"Kyu 是我项目里的队友。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation in some contexts (e.g., for an organization or school); meaning depends on the specific community.","zh":"在某些语境中的缩写（例如某个组织/学校等）；具体含义取决于使用场景。"},"examples":[{"en":"Check what “KYU” stands for in your document before using it.","zh":"在使用“KYU”之前，先确认它在你的文件里代表什么。"}]}],"synonyms":["aww","squee","so cute"],"phonetic":"/kjuː/","extraExplanation":["“kyu”常见于二次元/粉丝文化的打字拟声，用来表达被可爱事物“萌到”的情绪。它和日语里表现可爱或小动物叫声的拟声词风格接近，但在英语网络语境中更多是“可爱到尖叫”的效果。","如果你是想问“why”的口语写法，英语里更常见的是“cuz/cos”（=because）或直接用“why”。“kyu”一般不表示“为什么”。"]}
{"word":"kyung","summary":{"en":"Kyung is usually a Korean name or a romanized form of the Korean syllable 경; its exact meaning depends on the hanja used.","zh":"Kyung 通常是韩语人名（或名字成分）或音节“경”的转写；具体含义取决于所用汉字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Korean given name (or part of a given name), commonly romanized as “Kyung,” and often associated with meanings like “respect,” “honor,” or “brightness,” depending on which Chinese character (hanja) is used.","zh":"一个韩语人名（或名字的一部分），常拼写为 “Kyung”。其含义会因所用汉字（韩文：한자）不同而变化，常见联想包括“敬/尊敬”“荣誉”或“光明/明亮”等。"},"examples":[{"en":"Kyung is a common element in Korean names like Kyung-mi or Kyung-soo.","zh":"Kyung 常见于韩语名字中，比如 Kyung-mi（景美/敬美等）或 Kyung-soo（景秀/敬洙等）。"},{"en":"Her name is Kyung, and it can be spelled differently in English depending on the system used.","zh":"她的名字是 Kyung，而用英语拼写时会因采用的转写体系不同而出现不同写法。"}]},{"partOfSpeech":"other","definition":{"en":"a romanization of the Korean syllable “경” (gyeong) in some contexts; spelling varies widely in English (e.g., Kyung, Gyeong, Kyŏng).","zh":"韩语音节“경（gyeong）”在某些语境下的一种拉丁字母转写；英语拼写差异较大（如 Kyung、Gyeong、Kyŏng 等）。"},"examples":[{"en":"In modern Revised Romanization, 경 is usually written as “gyeong,” but you may still see “kyung.”","zh":"在现代“修订式罗马字”中，경 通常写作 “gyeong”，但仍可能见到 “kyung”。"},{"en":"The same Korean sound may appear as Kyung on passports and as Gyeong in textbooks.","zh":"同一个韩语读音，在护照上可能写作 Kyung，在教材里可能写作 Gyeong。"}]}],"synonyms":["Gyeong","Kyŏng"],"phonetic":"/kjʌŋ/","extraExplanation":["“Kyung”本身不是英语词汇，更多是韩语名字/音节的英文拼写。不同拼写往往来自不同的罗马字方案（如早期的 McCune–Reischauer、后来韩国官方的修订式罗马字），以及个人在护照/学校/社交媒体上的固定写法。","若你指的是某位具体人物（例如艺名、作者名或同学名字），“Kyung”对应的确切含义需要看其名字所用的汉字（한자）或韩文全名。"]}
{"word":"kyurin","summary":{"en":"Curing usually means treating an illness, preserving food (like meat), or letting materials (like concrete) harden properly.","zh":"Curing 通常指治疗疾病、腌制/熏制等保存食物，或让材料（如混凝土）固化变硬的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making an illness go away or become better; treatment","zh":"治愈或改善疾病的过程；治疗"},"examples":[{"en":"The new medicine is curing more patients each year.","zh":"这种新药每年能治愈更多病人。"},{"en":"Scientists are working on curing the disease.","zh":"科学家正在研究治疗这种疾病的方法。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of preserving food (especially meat or fish) by salting, smoking, or drying","zh":"（尤指肉类或鱼类的）腌制、熏制或风干等保存加工过程"},"examples":[{"en":"Curing makes the meat last longer.","zh":"腌制可以让肉保存更久。"},{"en":"This ham is made by a traditional curing method.","zh":"这款火腿采用传统腌制工艺制作。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of making a material become hard, dry, or set (for example, concrete or paint)","zh":"（材料如混凝土、油漆等）固化、干燥、硬化的过程"},"examples":[{"en":"The concrete needs time for curing before it’s strong.","zh":"混凝土需要固化时间才能变结实。"},{"en":"Good curing helps the paint last longer.","zh":"良好的固化能让油漆更耐用。"}]}],"synonyms":["treatment","healing","preservation","hardening"],"phonetic":"/ˈkjʊrɪŋ/","extraExplanation":["你输入的“kyurin”不是常见英语拼写。我推测你想查的是“curing”（治愈/腌制/固化）。如果你其实指的是人名、品牌名，或日语罗马字（如 kyūri きゅうり，意为“黄瓜”），告诉我使用场景，我可以再精准解释。"]}
{"word":"kyurinish","summary":{"en":"“kyurinish” is commonly used to mean “appearance/look” or “form,” especially as a transliteration from Uzbek (ko‘rinish).","zh":"“kyurinish”常用来表示“外观/样子”或“形态/呈现方式”，多为乌兹别克语（ko‘rinish）的音译写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the appearance or look of someone or something; the way it seems from the outside","zh":"外观；样子；看起来的样子（指人或事物从外表呈现出来的感觉）"},"examples":[{"en":"The new building has a modern kyurinish with lots of glass.","zh":"这栋新楼外观（kyurinish）很现代，使用了很多玻璃。"},{"en":"Don’t judge a person only by their kyurinish.","zh":"不要只凭一个人的外表（kyurinish）来评判。"}]},{"partOfSpeech":"n.","definition":{"en":"a form, version, or visible type of something (how something shows itself)","zh":"形态；呈现方式；某事物显现出来的形式"},"examples":[{"en":"There are different kyurinish of this tradition in different regions.","zh":"同一种传统在不同地区会有不同的呈现形式（kyurinish）。"}]}],"synonyms":["appearance","look","form","view"],"phonetic":"/ˈkjuːrɪnɪʃ/","extraExplanation":["“kyurinish”常见于中亚语言（尤其是乌兹别克语）中，更标准的拉丁拼写通常是“ko‘rinish”（也可写作“korinish”）。意思大致对应英语的 appearance/look 或 form/view。","如果你是在学英语写作：在正式场合更常用 appearance（外观/外表）、look（样子/神态）、form（形式/形态）、view（视图/景观，偏“看到的景象”）。"]}

