{"word":"L","summary":{"en":"“L” is the letter L; informally it can also mean a loss (opposite of W).","zh":"“L”既指字母 L；在口语/网络中也可指“失败/输”（与 W 相对）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 12th letter of the English alphabet","zh":"英语字母表中的第12个字母（L）"},"examples":[{"en":"“L” comes after K and before M.","zh":"L 在 K 之后、M 之前。"},{"en":"Please write your name in capital letters, like “L”.","zh":"请用大写字母写你的名字，比如 “L”。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially online) a loss or failure; the opposite of a win (W)","zh":"（非正式，尤指网络用语）失败、输；与胜利（W）相对"},"examples":[{"en":"Our team took an L last night.","zh":"我们队昨晚输了。"},{"en":"I missed the bus—another L for my day.","zh":"我错过了公交——今天又一次“翻车/不顺”。"},{"en":"Take the L and move on.","zh":"认输/接受失败，然后继续前进。"}]}],"synonyms":["(letter) L","(loss) defeat","loss","failure"],"phonetic":"/ɛl/","extraExplanation":["“L = loss”的用法常见于游戏、体育和社交媒体评论中（如“big L”表示“惨败/很尴尬的失败”）。相对地，“W”常用来表示“win（赢）”。"]}
{"word":"l","summary":{"en":"“L” is the 12th letter of the alphabet; it can also mean “liter” (L) or “large” size (L).","zh":"“L”是英语字母表的第12个字母；也常用作“升（L）”或服装“大号（L码）”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 12th letter of the English alphabet","zh":"英语字母表中的第12个字母（L）"},"examples":[{"en":"“L” comes after “K” and before “M.”","zh":"“L”在“K”之后，在“M”之前。"},{"en":"Her name starts with the letter L.","zh":"她的名字以字母L开头。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “liter,” a metric unit of volume","zh":"“liter（升）”的缩写，用于表示体积"},"examples":[{"en":"This bottle holds 2 L of water.","zh":"这个瓶子能装2升水。"},{"en":"Add 0.5 L of milk to the pot.","zh":"往锅里加入0.5升牛奶。"}]},{"partOfSpeech":"n.","definition":{"en":"a label meaning “large,” often used for clothing sizes","zh":"表示“L码/大号”的标识，常用于服装尺码"},"examples":[{"en":"I usually wear a size L.","zh":"我通常穿L码。"},{"en":"Do you have this shirt in L?","zh":"这件衬衫有L码吗？"}]}],"phonetic":"/ɛl/","extraExplanation":["在英语里，单个字母常常既可以指“字母本身”，也可以作为各种缩写出现（如L=liter）。具体含义通常要看上下文（比如在衣服标签上几乎一定指尺码）。","发音是 /ɛl/，开头是短元音“eh”的感觉，结尾是清晰的“l”音。"]}
{"word":"L-altrose","summary":{"en":"a rare L-form six-carbon aldose sugar","zh":"一种罕见的L型六碳醛糖"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare monosaccharide (simple sugar) in the L-configuration; specifically, an aldohexose (a six‑carbon aldose).","zh":"一种罕见的单糖（简单糖），属于L型构型；具体来说是醛己糖（六碳醛糖）。"},"examples":[{"en":"In carbohydrate chemistry, L-altrose is discussed as one of the stereoisomers of aldohexoses.","zh":"在糖类化学中，L-altrose 常被作为醛己糖立体异构体之一来讨论。"},{"en":"The lab compared L-altrose and related sugars to study how stereochemistry affects enzyme binding.","zh":"实验室比较了 L-altrose 与相关糖类，以研究立体化学如何影响酶的结合。"}]}],"synonyms":["altrose","aldohexose","monosaccharide"],"phonetic":"/ˌɛl ˈæl.troʊs/","extraExplanation":["D/L 不是“右旋/左旋”（那是 +/− 或 d/l 的旋光性），而是分子在费歇尔投影中相对参照物（通常是甘油醛）的空间构型分类。L-altrose 的“L-”指构型系列，不直接说明它一定向左旋光。"],"etymology":"“altrose”源自糖类命名体系中的名称；前缀“L-”来自立体化学的D/L标记法，表示它与甘油醛（glyceraldehyde）参照构型中的L系列对应。","mnemonic":["把 “L-” 记成 “Left（左边）系列”：看到 L- 就联想到“L系列构型”，用来区分与 D- 的镜像关系。","“aldohexose”可拆记：aldo-（醛）+ hex-（六）→ “有醛基的六碳糖”。"]}
{"word":"L-arginine","summary":{"en":"An amino acid used to build proteins and support nitric-oxide-related blood vessel function.","zh":"用于合成蛋白质，并与一氧化氮相关的血管功能支持有关的氨基酸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An amino acid used by the body to build proteins; it can also be converted into nitric oxide, which helps relax blood vessels and improve blood flow.","zh":"一种氨基酸，人体用它来合成蛋白质；也可转化为一氧化氮，帮助血管放松、改善血流。"},"examples":[{"en":"L-arginine is involved in protein synthesis and wound healing.","zh":"L-精氨酸参与蛋白质合成与伤口愈合。"},{"en":"Some people take L-arginine supplements to support blood flow, but results can vary.","zh":"有些人会补充L-精氨酸来帮助血流，但效果因人而异。"},{"en":"Foods like meat, nuts, and legumes can provide L-arginine.","zh":"肉类、坚果和豆类等食物可以提供L-精氨酸。"}]}],"synonyms":["arginine"],"phonetic":"/ˌɛl ˈɑrdʒəˌnin/","extraExplanation":["在营养学语境里，“L-”很重要：它指的是分子空间构型（左旋），而不是“left=左边”的日常意思。人体用于合成蛋白质的多为L型氨基酸。","作为补充剂时常见于运动、血流支持等场景；若有基础疾病或在用药（如降压药、硝酸酯类等），通常应先咨询专业人士。"],"etymology":"“arginine”源自拉丁语相关词根，最初与“银（argentum）”有关：这种氨基酸早期以银盐形式被分离与研究，因此得名；“L-”表示其为天然蛋白质中常见的左旋（L型）构型。","mnemonic":["把“arginine”联想成“artery（动脉）”开头的 ar-：它常被提到与血管（血流）相关（通过一氧化氮途径）。","“L-”记成“Life里常见的版本”：人体蛋白质主要用L型氨基酸。"]}
{"word":"L-asparagine","summary":{"en":"a protein-building amino acid (Asn) used in many biological processes","zh":"一种用于合成蛋白质的氨基酸（Asn），参与多种生理过程"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An amino acid (abbrev. Asn) found in many proteins; it is used by the body to build proteins and is important in metabolism and cell function.","zh":"一种氨基酸（缩写 Asn），广泛存在于蛋白质中；人体用它来合成蛋白质，并参与代谢与细胞功能。"},"examples":[{"en":"L-asparagine is one of the amino acids used to build proteins in the human body.","zh":"L-天冬酰胺是人体用于合成蛋白质的氨基酸之一。"},{"en":"In biochemistry class, we learned that Asn is the three-letter code for L-asparagine.","zh":"在生物化学课上，我们学到 Asn 是 L-天冬酰胺的三字母代码。"},{"en":"Some research focuses on how cancer cells depend on L-asparagine for growth.","zh":"一些研究关注癌细胞如何依赖 L-天冬酰胺来生长。"}]}],"synonyms":["asparagine","Asn"],"phonetic":"/ˌɛl əˈspærədʒiːn/","extraExplanation":["“L-”与“D-”是化学中描述分子空间构型的一种方式。对多数氨基酸而言，生物体内合成并用于蛋白质的通常是 L-型。","英文里常把 L-asparagine 直接简称为 “asparagine”，在非严格语境下两者常被混用；科研或配方标签中写 L- 往往更精确。"],"etymology":"来自“asparagus（芦笋）”，因为该物质最早从芦笋汁中被分离出来；“L-”表示它是天然蛋白质中常见的左旋（L-型）构型。","mnemonic":["把 asparagine 联想到 asparagus（芦笋）：它最早就和“芦笋”有关——从芦笋里分离得到。","记缩写 Asn：可以联想成 “Amino acid, short name (Asn)”——氨基酸的短名。"]}
{"word":"L-carnitine","summary":{"en":"a natural compound that helps the body use fatty acids for energy; also a medical treatment for carnitine deficiency","zh":"帮助脂肪酸进入线粒体以供能的天然化合物；也可作为治疗肉碱缺乏的药用形式"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring compound in the body (and found in foods and supplements) that helps transport fatty acids into cells’ mitochondria to be used for energy","zh":"一种人体内天然存在的化合物（也存在于食物与补充剂中），主要作用是把脂肪酸运送到细胞的线粒体中，用于产生能量"},"examples":[{"en":"Some people take L-carnitine supplements to support energy metabolism.","zh":"有些人会补充左旋肉碱来支持能量代谢。"},{"en":"In the body, L-carnitine helps move fatty acids into mitochondria for fuel.","zh":"在体内，左旋肉碱帮助把脂肪酸送进线粒体作为燃料。"},{"en":"Red meat is a common dietary source of L-carnitine.","zh":"红肉是左旋肉碱常见的膳食来源。"}]},{"partOfSpeech":"n.","definition":{"en":"a form of carnitine used medically (also called levocarnitine) to treat certain carnitine deficiencies","zh":"一种用于医疗的肉碱形式（也叫左旋肉碱/levocarnitine），用于治疗某些肉碱缺乏相关疾病"},"examples":[{"en":"Levocarnitine may be prescribed for patients with a diagnosed carnitine deficiency.","zh":"对确诊为肉碱缺乏的患者，医生可能会开具左旋肉碱。"},{"en":"Do not self-medicate with high doses without medical advice.","zh":"不要在缺乏医疗建议的情况下自行服用大剂量。"}]}],"synonyms":["carnitine","levocarnitine"],"phonetic":"/ˌɛl ˈkɑrnəˌtin/","extraExplanation":["常见中文名是“左旋肉碱”。在健身与减脂语境中常被提及，但实际效果与个人饮食、运动、剂量与健康状况有关；若有基础疾病、正在用药、或怀孕/哺乳，建议先咨询医生。","“L-”与“D-”是化学里的立体构型标记；人体常用的通常是L-形式。市面上也常见“acetyl-L-carnitine（乙酰左旋肉碱）”，属于相关衍生物，用途与研究方向略不同。"],"etymology":"“carnitine”来自拉丁语“carō / carnis”（肉），因为最早从肉类中分离得到；“L-”表示分子的构型（左旋/天然常见的形式）。","mnemonic":["把“carn-”联想到“carnivore（食肉动物）/ carne（肉）”，记住它和“肉类来源、脂肪代谢”常一起出现。","“L-”可记成“Left（左）”，对应中文“左旋”。"]}
{"word":"L-carnosine","summary":{"en":"A muscle- and brain-based dipeptide also used as a dietary supplement; the naturally common L-form.","zh":"存在于肌肉与大脑的二肽，也常作补充剂；指天然常见的L-构型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naturally occurring dipeptide (made of beta-alanine and histidine) found mainly in skeletal muscle and the brain; it is commonly sold as a dietary supplement.","zh":"一种天然存在的二肽（由β-丙氨酸与组氨酸组成），主要存在于骨骼肌和大脑中；也常作为膳食补充剂出售。"},"examples":[{"en":"L-carnosine is abundant in meat because it is concentrated in muscle tissue.","zh":"L-肌肽在肉类中含量较高，因为它主要集中在肌肉组织里。"},{"en":"Some people take L-carnosine as a supplement, but evidence for specific benefits varies by claim.","zh":"有些人把L-肌肽当作补充剂服用，但不同功效主张的证据强弱不一。"}]},{"partOfSpeech":"n.","definition":{"en":"In chemistry/biochemistry, the specific naturally occurring form of carnosine that contains the L-configuration of its amino-acid components (as opposed to a D-form).","zh":"在化学/生物化学中，指肌肽的天然常见构型：其氨基酸组分为L-构型（相对于D-构型）。"},"examples":[{"en":"Most biological proteins and peptides use L-amino acids, so L-carnosine is the form typically discussed in physiology.","zh":"多数生物体内的蛋白质与肽由L-氨基酸构成，因此生理学讨论的通常是L-肌肽。"}]}],"synonyms":["carnosine","beta-alanyl-L-histidine"],"phonetic":"ˌɛlˈkɑrnəsiːn","extraExplanation":["补充剂语境中常提到其可能与“抗氧化、抗糖化（减少AGEs形成）”相关，但具体效果取决于研究对象、剂量与指标；不应替代正规医疗建议。","术语提示：L-通常表示与天然氨基酸同向的立体构型；很多情况下“carnosine”在市面上默认指的就是L-carnosine。"],"etymology":"“carnosine”来自拉丁语词根 caro/carn-（意为“肉、肌肉”），因其最初从肌肉组织中被发现；前缀“L-”表示其手性构型为L型（常见于生物体内的氨基酸/肽）。","mnemonic":["看到 carn- 可联想到 carnivore（食肉动物）/carnal（肉体的），都和“肉、肌肉”相关 → 肌肽主要在肌肉里。","把 L- 记成“Life/生物体常用的方向”→ 生物体内更常见的是L-型。"]}
{"word":"L-citrulline","summary":{"en":"an amino acid used by the body and commonly taken to support nitric oxide and blood flow","zh":"一种人体可利用的氨基酸，常用于支持一氧化氮生成与血流循环"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring amino acid (the “L-” form used by the body), found in foods like watermelon and often taken as a supplement; in the body it can be converted into L-arginine and supports nitric oxide production and blood flow","zh":"一种天然存在的氨基酸（“L-”表示人体可利用的左旋形式），存在于西瓜等食物中，也常作为补充剂；在体内可转化为L-精氨酸，并有助于一氧化氮生成与血流循环"},"examples":[{"en":"Some people take L-citrulline before exercise to support blood flow.","zh":"有些人会在运动前补充L-瓜氨酸来帮助血流循环。"},{"en":"Watermelon is a natural food source of citrulline.","zh":"西瓜是瓜氨酸的天然食物来源。"},{"en":"Ask your doctor if L-citrulline is safe for you, especially if you take blood-pressure medicine.","zh":"如果你在服用降压药，最好先咨询医生L-瓜氨酸是否适合你。"}]}],"synonyms":["citrulline","L-citrulline malate"],"phonetic":"/ˌɛl ˌsɪtrəˈliːn/","extraExplanation":["补充剂领域常见的相关说法：L-瓜氨酸进入体内后可提高L-精氨酸水平，从而间接支持一氧化氮（NO）生成；NO与血管舒张、血流相关。","市面上也常见“citrulline malate（瓜氨酸苹果酸盐）”，属于不同配方形式；具体剂量与适用人群应参考产品说明并结合医生建议。"],"etymology":"“citrulline”来自拉丁语 *citrullus*（西瓜）＋化学后缀 *-ine*（常用于命名化合物/生物碱/氨基酸等）。之所以与西瓜相关，是因为它最早从西瓜中被分离出来。“L-”表示该分子为“左旋体”（与人体蛋白质相关的常见形式）。","mnemonic":["联想“citrus/柑橘”+“西瓜”：citrullus=西瓜，所以这种氨基酸和西瓜有关。","记“L-”=“Left 左旋”=人体更常用的形式。"]}
{"word":"L-cystathionine","summary":{"en":"An L-form metabolic intermediate in sulfur amino acid pathways.","zh":"含硫氨基酸代谢途径中的一种L-构型中间产物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naturally occurring amino-acid–like compound (the L-form) found in the body as an intermediate in sulfur amino acid metabolism, especially in the pathway that converts methionine to cysteine.","zh":"一种体内天然存在的“类氨基酸”化合物（L-构型），是含硫氨基酸代谢中的中间产物，尤其参与由蛋氨酸转化为半胱氨酸的代谢途径。"},"examples":[{"en":"In the transsulfuration pathway, L-cystathionine is formed before cysteine is produced.","zh":"在转硫途径中，会先生成L-胱硫醚，随后才产生半胱氨酸。"},{"en":"Some lab tests measure related metabolites to evaluate sulfur amino acid metabolism.","zh":"一些实验室检测会测量相关代谢物，用于评估含硫氨基酸代谢情况。"}]}],"synonyms":["cystathionine"],"phonetic":"/ˌɛl ˌsɪs.təˈθaɪ.əˌniːn/","extraExplanation":["L- 表示手性构型（与 D- 相对）。在生物体内，许多氨基酸及其相关分子以 L- 构型更常见。","它常出现在“转硫途径（transsulfuration pathway）”的语境中，和同型半胱氨酸（homocysteine）、胱硫醚β合成酶（CBS）、胱硫醚γ裂解酶（CGL/CTH）等概念相关。"],"etymology":"词形来自化学构词：cysta-（与“半胱氨酸/胱”相关）+ thio-（表示“硫”）+ -ine（常见于含氮有机化合物/氨基酸类名称）；前缀 L- 表示其为“左旋/天然常见的手性构型”。","mnemonic":["把词拆开记：cysta（联想“胱/半胱氨酸”）+ thio（=硫）+ -ine（化学名后缀）→“和胱、硫有关的化合物”。","L- 可以联想“Left（左）”→ 左旋构型（生物体更常见）。"]}
{"word":"L-cysteine","summary":{"en":"a sulfur-containing amino acid used to build proteins","zh":"一种用于合成蛋白质的含硫氨基酸"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sulfur-containing amino acid used by the body to build proteins; an antioxidant building block (via glutathione) and a common ingredient in supplements and food processing","zh":"一种含硫氨基酸，人体用来合成蛋白质；也是抗氧化体系（如谷胱甘肽）的重要组成，并常用于营养补充剂与食品加工"},"examples":[{"en":"L-cysteine helps the body make glutathione, an important antioxidant.","zh":"L-半胱氨酸有助于人体合成谷胱甘肽，这是一种重要的抗氧化物质。"},{"en":"Some bakeries use L-cysteine to improve dough handling and texture.","zh":"一些烘焙会用L-半胱氨酸来改善面团的操作性和口感。"},{"en":"The label lists L-cysteine as an ingredient in the supplement.","zh":"标签上把L-半胱氨酸列为该补充剂的成分之一。"}]}],"synonyms":["cysteine"],"phonetic":"/ˌɛl ˈsɪstɪˌin/","extraExplanation":["“L-”与“D-”是立体化学构型标记：人体蛋白质主要由L-型氨基酸组成，所以营养与食品领域通常指L-型。","在食品配料表中，L-cysteine 有时会标为“L-半胱氨酸”或“半胱氨酸”，常用于改良面团筋性与延展性。不同国家/地区对其来源（如发酵法或其他来源）的标示与规范可能不同。"],"etymology":"词源来自“cyst-（囊/膀胱）”这一希腊语词根（早期与含硫化合物的发现背景相关）+ “-eine”（常见于氨基酸/化学物质命名的后缀）。前面的“L-”表示其为自然界与人体蛋白质中最常见的左旋（L型）构型。","mnemonic":["记“cys-”像“硫(sulfur)”的关键字：半胱氨酸含硫，常与“二硫键”联系在一起。","“L-”可联想“Left=左”，L-型是人体更常用的那一型。"]}
{"word":"L-DOPA","summary":{"en":"a dopamine-precursor drug used for Parkinson’s symptoms","zh":"用于缓解帕金森相关症状的多巴胺前体药物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (levodopa) that the body converts into dopamine, mainly used to treat Parkinson’s disease and related movement problems","zh":"一种药物（左旋多巴），在体内可转化为多巴胺，主要用于治疗帕金森病及相关运动障碍"},"examples":[{"en":"L-DOPA is often prescribed to reduce tremor and stiffness in Parkinson’s disease.","zh":"L-DOPA 常用于减轻帕金森病患者的震颤和僵硬。"},{"en":"Over time, some patients may need adjustments in their L-DOPA dose.","zh":"随着时间推移，一些患者可能需要调整 L-DOPA 的剂量。"},{"en":"Doctors may combine L-DOPA with other drugs to improve symptom control.","zh":"医生可能会将 L-DOPA 与其他药物联合使用，以更好地控制症状。"}]}],"synonyms":["levodopa"],"phonetic":"ˌɛl ˈdoʊpə","extraExplanation":["它是“多巴胺的前体”，能穿过血脑屏障进入大脑后再转化为多巴胺；而多巴胺本身通常不易直接进入大脑。","医学语境里常写作 L-DOPA；在处方与说明书中更常见 levodopa（左旋多巴）。"],"etymology":"缩写自 L-3,4-dihydroxyphenylalanine（L-型 3,4-二羟基苯丙氨酸）。L- 表示“左旋异构体”；DOPA 来自其化学结构命名。临床上常用通用名 levodopa。","mnemonic":["把它记成“L = left（左）”，所以是“左旋”的 DOPA → 左旋多巴。","联想“DOPA → dopamine（多巴胺）”，它是用来“补多巴胺”的前体。"]}
{"word":"L-glutamine","summary":{"en":"a naturally occurring amino acid (the L-form) used to build proteins; also sold as a supplement","zh":"人体常见的L型氨基酸，用于合成蛋白质；也常作为补充剂出售"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an amino acid used by the body to build proteins; the naturally occurring form of glutamine found in humans and many foods","zh":"一种氨基酸，用于人体合成蛋白质；“L-型”是人体与食物中最常见、天然存在的谷氨酰胺形式"},"examples":[{"en":"L-glutamine is one of the most abundant amino acids in the body.","zh":"L-谷氨酰胺是人体内含量非常高的一种氨基酸。"},{"en":"Foods like meat, eggs, and beans contain L-glutamine.","zh":"肉类、鸡蛋和豆类等食物含有L-谷氨酰胺。"},{"en":"During illness or intense training, the body may use more L-glutamine than usual.","zh":"生病或高强度训练时，身体可能会比平时消耗更多的L-谷氨酰胺。"}]},{"partOfSpeech":"n.","definition":{"en":"a dietary supplement form of glutamine, taken by some people to support recovery or gut health (evidence varies by use)","zh":"作为膳食补充剂形式的谷氨酰胺；有些人用来辅助恢复或肠道健康（不同用途的证据强弱不一）"},"examples":[{"en":"He asked his doctor whether L-glutamine supplements were appropriate for him.","zh":"他询问医生自己是否适合补充L-谷氨酰胺。"},{"en":"Some athletes take L-glutamine after workouts, but results can be mixed.","zh":"一些运动员会在训练后补充L-谷氨酰胺，但效果可能因人而异。"}]}],"synonyms":["glutamine","Gln"],"phonetic":"ˌɛlˈɡluːtəˌmiːn","extraExplanation":["“L-”与“D-”表示分子在空间结构上的“手性/构型”差异。人体蛋白质主要由L-型氨基酸组成，因此日常语境里说的glutamine通常指L-glutamine。","医学与营养领域中，L-glutamine常被讨论与肌肉恢复、免疫功能、肠道黏膜等相关；但具体效果取决于人群与目的。若有肝肾疾病、正在治疗或要长期高剂量使用，建议先咨询专业医生。"],"etymology":"“glutamine”来自“glutamic (acid)”（谷氨酸）+ 化学后缀“-amine/‑amine”（与含氮基团相关）。前缀“L-”来自拉丁语 laevus（左），用于表示分子的构型（与“D-”相对）。","mnemonic":["记忆法：把“L-”想成“Life（生命）里常见的那一型”——人体主要用L-型氨基酸。","glutamine ≈ glutamic acid（谷氨酸）的一位“亲戚”，中文可联想“谷氨酸→谷氨酰胺”（名字很像，都是“谷氨-”家族）。"]}
{"word":"L-gulose","summary":{"en":"a rare L‑configured aldohexose sugar","zh":"一种罕见的 L-构型醛己糖"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare monosaccharide (an aldohexose) that is the L‑stereoisomer of gulose; used mainly in research and stereochemistry discussions rather than in everyday nutrition.","zh":"一种罕见的单糖（醛己糖），是 gulose（古洛糖）的 L-构型立体异构体；多用于科研与立体化学讨论，而非常见营养糖。"},"examples":[{"en":"L-gulose is mainly encountered in carbohydrate chemistry research.","zh":"L-gulose 主要出现在糖类化学研究中。"},{"en":"Compared with D-sugars, L-gulose is much less common in nature.","zh":"与常见的 D-型糖相比，L-gulose 在自然界中要罕见得多。"}]}],"synonyms":["gulose","aldohexose","rare sugar"],"phonetic":"/ˌɛl ˈɡjuːloʊs/","extraExplanation":["很多天然糖以 D-构型更常见；“L-”并不等同于“使光向左旋”的绝对规律（旋光方向与 D/L 构型不是一一对应），但在学习时可先把 D/L 理解为“相对于参照物的空间排布类别”。","作为“醛己糖（aldohexose）”，它含 6 个碳原子并带有醛基；因此常在有机化学/生物化学课程中用来练习立体异构体与费歇尔投影（Fischer projection）的辨认。"],"etymology":"“gulose”源自早期糖类命名体系（以不同醛己糖立体异构体为基础的命名）；前缀 “L-” 表示其与甘油醛（glyceraldehyde）参照体系对应的左旋/构型类别，用来区分与 “D-” 构型的镜像关系。","mnemonic":["记忆法：把 “L-” 直接联想成中文“左”（Left=左），提醒自己它是与 D-构型相对的那一类空间排布。","把 “gulose” 联想成“古（gu）+洛（luo）”，形成“古洛糖”的音译印象；加上 L- 就是“左构型的古洛糖”。"]}
{"word":"L-kynurenine","summary":{"en":"a tryptophan-derived metabolite in the kynurenine pathway","zh":"色氨酸代谢产生、属于犬尿氨酸通路的代谢物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring molecule made from the amino acid tryptophan in the body; it is part of the kynurenine pathway and is studied for its roles in immune function and brain chemistry","zh":"一种在体内由氨基酸“色氨酸”代谢生成的天然分子；属于“犬尿氨酸通路”，常用于研究免疫功能与脑内化学过程等作用"},"examples":[{"en":"Researchers measured L-kynurenine levels in blood to study changes in inflammation.","zh":"研究人员测量血液中的 L-犬尿氨酸水平，以研究炎症变化。"},{"en":"L-kynurenine is produced when the body breaks down tryptophan.","zh":"当身体分解色氨酸时，会生成 L-犬尿氨酸。"},{"en":"Some studies link the kynurenine pathway to mood and cognition.","zh":"一些研究将犬尿氨酸通路与情绪和认知联系起来。"}]}],"synonyms":["kynurenine","L-kynurenine sulfate"],"phonetic":"/ˌɛl kaɪˈnjʊrəˌniːn/","extraExplanation":["学习提示：在生物化学里，“L- / D-”通常指分子的立体构型（手性）。多数人体蛋白质使用的氨基酸为 L-构型，所以很多相关代谢产物也会用 L-来标明。","常见语境：文献里它常与“tryptophan（色氨酸）”“kynurenine pathway（犬尿氨酸通路）”“IDO/TDO（关键酶）”“neuroactive metabolites（神经活性代谢物）”等一起出现。"],"etymology":"“kynurenine”源自“kynurenic acid（犬尿喹啉酸）”的命名体系；“kynuren-”与早期在尿液研究中的化学命名传统有关。“L-”表示该分子为氨基酸常见的左旋（L）构型（与“D-”相对），常用于生化与药理命名。","mnemonic":["把“kynu-”联想成“犬尿（quǎn niào）”：中文里常译作“犬尿氨酸”，看到“kynurenine”就想到“犬尿氨酸通路”。","“L-”可以记成“Left（左）”：L- = 左旋构型。"]}
{"word":"L-lactic","summary":{"en":"the L-form stereoisomer of lactic acid/lactate commonly made by the human body","zh":"人体常产生的L-构型（左旋）乳酸/乳酸盐"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"the L- (left-handed) stereoisomer form of lactic acid or lactate, the main type produced in human muscles during exercise","zh":"L-（左旋）构型的乳酸或乳酸盐；人体运动时肌肉中主要生成的那一种乳酸形式"},"examples":[{"en":"During intense exercise, the body produces mostly L-lactic acid in the muscles.","zh":"在高强度运动时，人体肌肉主要生成L-乳酸。"},{"en":"The report compared L-lactic and D-lactic levels in the blood.","zh":"报告比较了血液中L-乳酸与D-乳酸的水平。"},{"en":"Many fermented foods contain L-lactic acid made by bacteria.","zh":"许多发酵食品含有由细菌产生的L-乳酸。"}]}],"synonyms":["L-lactate","L-lactic acid","levo-lactic"],"phonetic":"/ˌɛl ˈlæk.tɪk/","extraExplanation":["在生理与营养学语境里，人们常把“L-lactic acid / L-lactate”视为“常见、人体会大量产生并可被代谢利用的乳酸”。与之相对的“D-lactic”在人类体内较少见，某些肠道菌或特定发酵过程可能产生更多。","写法上常见：L-lactic acid（L-乳酸）、L-lactate（L-乳酸盐/乳酸根）。科研或临床报告里也可能写作 “L-(+)-lactic acid”。"],"etymology":"“lactic”来自拉丁语 lac（牛奶），因乳酸最早与酸奶/发酵乳等现象相关；“L-”源自立体化学标记，表示分子在特定参考体系下的构型（与“D-”相对），常口语理解为“左旋/左手型”。","mnemonic":["记“L = Left（左）”：L-lactic 就是“左（旋）乳酸”。","把“lactic”联想到“乳”（牛奶 lac-）：乳酸最早与乳制品发酵联系紧密。"]}
{"word":"L-lactide","summary":{"en":"an L-form lactide monomer used to make biodegradable polymers such as PLLA","zh":"用于制备PLLA等可降解聚合物的L型乳酸内酯单体"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specific stereoisomer of lactide (a cyclic di-ester made from two lactic acid units), used as a monomer to produce poly(L-lactic acid) (PLLA), a type of biodegradable plastic","zh":"乳酸内酯（lactide）的一个特定立体异构体（由两个乳酸分子脱水成环得到的环状二酯），常用作单体来制备聚左旋乳酸（PLLA）等可降解材料"},"examples":[{"en":"L-lactide is commonly polymerized to make PLLA for medical implants and biodegradable packaging.","zh":"L-乳酸内酯常被聚合制成PLLA，用于医用植入物和可降解包装。"},{"en":"Compared with mixed lactide, L-lactide can give a polymer with higher crystallinity.","zh":"与混合乳酸内酯相比，L-乳酸内酯可得到结晶度更高的聚合物。"},{"en":"The purity of L-lactide strongly affects the final material’s strength and melting point.","zh":"L-乳酸内酯的纯度会显著影响最终材料的强度和熔点。"}]}],"synonyms":["L-lactic acid dimer","lactide monomer","L-lactide monomer"],"phonetic":"/ˈɛl ˈlæktaɪd/","extraExplanation":["“L-”在这里主要是立体构型标记（与手性/镜像异构有关），不等同于简单的“左旋/右旋”日常概念；在材料科学里，L-lactide常对应生成PLLA，通常更容易形成结晶结构，从而影响硬度、透明度、耐热性等。","在聚乳酸（PLA）产业链中，lactide（乳酸内酯）常被作为关键中间体：先由乳酸制得lactide，再开环聚合（ROP）得到PLA。L-lactide、D-lactide与meso-lactide的比例会改变最终PLA的性能。"],"etymology":"词源来自“lactic（乳酸的）+ -ide（化学后缀，常见于化合物名）”。“lactide”指由乳酸缩合形成的环状二酯；前缀“L-”表示其立体化学构型为L型（与乳酸的手性构型相关），用于区分D-、L-或外消旋混合物。","mnemonic":["把它拆开记：L + lactide。lactic=乳酸，-ide=化学物名后缀；所以就是“L型的乳酸内酯”。","联想“PLA塑料”常见路线：乳酸 → lactide → PLA；其中L-lactide常对应PLLA（两个L开头更好记）。"]}
{"word":"L-leucine","summary":{"en":"an essential amino acid used to build proteins, especially in muscle","zh":"用于合成蛋白质、与肌肉相关的必需氨基酸"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An essential amino acid used by the body to build and repair proteins, especially in muscle; one of the branched-chain amino acids (BCAAs).","zh":"一种必需氨基酸，人体用来合成与修复蛋白质，尤其与肌肉相关；属于支链氨基酸（BCAA）之一。"},"examples":[{"en":"L-leucine is important for muscle protein synthesis after exercise.","zh":"L-亮氨酸对运动后的肌肉蛋白合成很重要。"},{"en":"Foods like meat, eggs, and soy contain leucine.","zh":"肉类、鸡蛋和大豆等食物含有亮氨酸。"},{"en":"Because it is essential, you need to get leucine from your diet.","zh":"由于它是必需氨基酸，你需要从饮食中摄取亮氨酸。"}]}],"synonyms":["leucine","2-amino-4-methylpentanoic acid"],"phonetic":"/ˈluːsiːn/","extraExplanation":["“L-”常见于氨基酸名称（如L-leucine、L-lysine），表示与“D-”相对的空间结构；人体蛋白质主要由L-型氨基酸组成。","亮氨酸与异亮氨酸（isoleucine）和缬氨酸（valine）并称BCAA，常见于运动营养与蛋白质补充剂的讨论中。"],"etymology":"“leucine/亮氨酸”一词来自希腊语 *leukos*（意为“白色”），早期与其被分离/结晶时呈白色外观有关；“L-”表示该分子属于生物体中常见的L构型（立体化学中的一种镜像形式）。","mnemonic":["记“leu-”≈“白/亮”：来自希腊语“白色”，对应中文名“亮氨酸”的“亮”。","把它和“BCAA”绑一起记：亮氨酸=支链氨基酸三兄弟之一（Leu–Ile–Val）。"]}
{"word":"L-leucyl","summary":{"en":"derived from the L-leucine residue/group","zh":"由L-亮氨酸衍生的残基/基团"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biochemistry) describing a chemical group or residue derived from the amino acid L-leucine, especially when L-leucine is part of a peptide or attached to another molecule.","zh":"（生物化学）指来源于氨基酸L-亮氨酸的化学基团或“残基”，常用于表示L-亮氨酸作为肽链的一部分或连接到其他分子上。"},"examples":[{"en":"L-leucyl-L-alanine is a dipeptide made from L-leucine and L-alanine.","zh":"L-leucyl-L-alanine 是由L-亮氨酸和L-丙氨酸组成的二肽。"},{"en":"The enzyme recognizes an L-leucyl group on the substrate.","zh":"该酶会识别底物上的 L-leucyl 基团。"},{"en":"Researchers modified the drug by adding an L-leucyl moiety to improve uptake.","zh":"研究人员通过加入 L-leucyl 基团来提高药物的摄取。"}]}],"synonyms":["L-leucine residue","L-leucine-derived group","leucine residue"],"phonetic":"ˌɛl ˈluːsɪl","extraExplanation":["在肽或蛋白质里，某个氨基酸“并入链中”后常被称为“残基（residue）”。因此 L-leucyl 常可理解为“来自 L-亮氨酸的那一段/那一位”。","拼写提示：leucyl 是“亮氨酸的酰基形式”的写法，常见于二肽/多肽命名（如 leucyl-alanine）。"],"etymology":"词源由两部分组成：L- 表示“左旋（L-构型）”，是氨基酸立体化学命名；leucyl 来自 leucine（亮氨酸）加上化学后缀 -yl，表示“由……衍生的基团/残基”。在肽命名中常用来指“亮氨酸残基”。","mnemonic":["把它拆开记：L- = 左手（Left）→ L-构型；leucyl ≈ leucine（亮氨酸）+ -yl（基团）→ “亮氨酸基/亮氨酸残基”。","联想中文：亮氨酸“亮”→ 看到 L-leucyl 就想到“L-亮（氨酸）那一段”。"]}
{"word":"L-limonene","summary":{"en":"a citrus-smelling terpene used in flavors, fragrances, and solvents","zh":"带柑橘气味的萜烯，常用于香精、香料与溶剂"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring citrus-scented terpene found in the peel oils of oranges, lemons, and other citrus fruits; widely used in flavors, fragrances, and cleaning/solvent products.","zh":"一种天然存在、带柑橘香味的萜烯，主要存在于橙子、柠檬等柑橘类果皮精油中；常用于食品香料、香精香氛以及清洁剂/溶剂等产品。"},"examples":[{"en":"Many orange-scented cleaners use L-limonene as a solvent and fragrance ingredient.","zh":"许多橙香型清洁剂会用 L‑limonene 作为溶剂和香味成分。"},{"en":"Citrus peel oil is rich in limonene, which gives it its bright, fresh smell.","zh":"柑橘类果皮精油富含 limonene，这也是它清新明亮气味的来源。"},{"en":"The label lists L-limonene among the fragrance components.","zh":"标签在香精成分中列出了 L‑limonene。"}]}],"synonyms":["limonene","d-limonene","citrus terpene"],"phonetic":"/ˌɛl ˈlɪməˌniːn/","extraExplanation":["在日常产品标签里，你可能会看到“limonene / L‑limonene”作为香精或溶剂成分出现。对过敏体质人群来说，它在空气中氧化后可能增加皮肤致敏风险，因此部分地区法规会要求在一定浓度以上标示出来。"],"etymology":"源自“lemon（柠檬）”一词的构词基础，加上化学命名中常见的后缀“-ene”（表示不饱和烃/烯类）。L‑ 表示其特定的立体构型（与光学异构相关），常见于化学命名。","mnemonic":["把它拆开记：lemon（柠檬）+ -ene（化学里常见后缀）→ “柠檬味的化学物质”。","联想“柑橘皮精油=香香的油”，主要香味分子之一就是 limonene。"]}
{"word":"l-limonene","summary":{"en":"the levorotatory enantiomer of limonene, a citrus-scented terpene","zh":"柠檬烯的左旋对映体，带柑橘香的萜烯"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specific mirror-image form (enantiomer) of limonene, a citrus-scented terpene found in many plant oils and used in fragrances, flavorings, and some cleaning products","zh":"柠檬烯（limonene）的一种“镜像异构体”（对映体）；属于带柑橘气味的萜烯，存在于多种植物精油中，常用于香精香料、食品香味与部分清洁用品"},"examples":[{"en":"Some pine-derived essential oils contain l-limonene along with other terpenes.","zh":"一些松木来源的精油中含有 l‑limonene 以及其他萜烯。"},{"en":"In fragrance formulation, the two forms of limonene can smell different to people.","zh":"在香精配方中，柠檬烯的两种对映体对人闻起来可能会有差别。"},{"en":"The label lists l-limonene as a naturally occurring ingredient from citrus peel oil.","zh":"标签把 l‑limonene 标为来自柑橘果皮油的天然成分。"}]}],"synonyms":["limonene","(−)-limonene","(S)-limonene","levorotatory limonene"],"phonetic":"/ˌɛl ˈlɪməˌniːn/","extraExplanation":["在化学里，l- / d- 常用于表示“旋光方向”（左旋/右旋），不一定等同于绝对构型的 R/S；现代文献也常见写法为 (−)-limonene 或 (S)-limonene。","日常产品里更常见的是 limonene（不特别标明对映体）；当配方或研究需要区分气味、反应性或生物作用时，才会更明确写 l-limonene。"],"etymology":"词源来自法语/德语化学命名传统：limonene 源于 lemon / limon（“柠檬”）+ 化学后缀 -ene（表示不饱和烃/烯类）。前缀 l- 表示“左旋”（levorotatory），指它使偏振光向左旋转，是 limonene 的一种对映体标记。","mnemonic":["记忆法：l- 可以联想到 left（左边）→ 左旋。","把 limon- 联想到“柠檬/柑橘味”，-ene 联想到“烯/萜烯类”常见于精油。"]}
{"word":"L-ornithine","summary":{"en":"an amino acid used in the urea cycle to help remove ammonia.","zh":"参与尿素循环、帮助清除氨的氨基酸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural amino acid involved in the urea cycle, helping the body convert toxic ammonia into urea; it is not one of the standard amino acids used to build proteins.","zh":"一种天然氨基酸，参与“尿素循环”，帮助身体把有毒的氨转化为尿素；它不是用于合成蛋白质的标准氨基酸之一。"},"examples":[{"en":"L-ornithine plays a key role in the urea cycle in the liver.","zh":"L-鸟氨酸在肝脏的尿素循环中起关键作用。"},{"en":"Some athletes take L-ornithine as a supplement, but evidence for performance benefits is mixed.","zh":"有些运动员会补充L-鸟氨酸，但对提升运动表现的证据并不一致。"},{"en":"In biochemistry class, we learned how ornithine helps remove excess nitrogen from the body.","zh":"在生物化学课上，我们学习了鸟氨酸如何帮助身体清除多余的氮。"}]}],"synonyms":["ornithine","L-ornithine monohydrochloride"],"phonetic":"/ɔrˈnɪθiːn/","extraExplanation":["在生理学里，L-鸟氨酸常与“精氨酸（arginine）—瓜氨酸（citrulline）—鸟氨酸（ornithine）”一起出现，构成尿素循环的关键环节。","它属于“非蛋白原性氨基酸”（non-proteinogenic amino acid）：在体内很重要，但不直接被核糖体用来拼接成蛋白质。","作为保健品时常见与L-天冬氨酸鸟氨酸（ornithine aspartate, 常用于肝性脑病相关研究）或与精氨酸同类的代谢讨论一起出现；若有肝肾疾病或正在用药，补充前通常应咨询专业人士。"],"etymology":"“ornithine/鸟氨酸”一名来自希腊语词根 ornith-（“鸟”）。它最早与“鸟类排泄物”相关的研究背景有关，后来该名称沿用到这种参与含氮代谢（尿素循环）的氨基酸上。前缀“L-”表示其为天然常见的手性构型（与生物体内常见的氨基酸构型一致）。","mnemonic":["记忆法：ornith- 联想“ornithology（鸟类学）”，看到 ornith 就想到“鸟”，再联想到“鸟氨酸”。","把“尿素循环”想成“把氨（ammonia）转走的循环”，鸟氨酸是其中的“转运/周转角色”。"]}
{"word":"l-plate","summary":{"en":"An “L” sign on a vehicle indicating a learner driver (mainly UK usage).","zh":"贴在车辆上的“L”字标志，表示学员司机（主要为英式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sign with a large letter “L” that a learner driver displays on a vehicle to show they are still learning to drive.","zh":"“L”字学习驾驶标志牌（通常贴在车上），表示驾驶者是学员司机/新手司机。"},"examples":[{"en":"In the UK, you must display L-plates when you’re driving as a learner.","zh":"在英国，学员驾驶时必须展示L牌。"},{"en":"He’s practicing parking with L-plates on his car.","zh":"他在车上挂着L牌练习停车。"}]}],"synonyms":["learner plate","learner sign"],"phonetic":"/ˈɛl pleɪt/","extraExplanation":["“L-plate”主要用于英式英语（UK等），L代表 learner（学员）。在一些国家/地区，学员驾驶有明确的标识规定；例如英国常见 L-plates（红色L白底）或在通过考试后用 P-plates（P代表 probationary/新手期）来提示其他道路使用者。","写法上常见 l-plate / L-plate（不太区分大小写），复数为 L-plates。"]}
{"word":"L-theanine","summary":{"en":"A tea-derived amino acid often linked with relaxation.","zh":"源自茶叶、常与放松减压相关的氨基酸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An amino acid found mainly in tea leaves (especially green tea) and some mushrooms, often used as a dietary supplement and commonly associated with relaxation and reduced stress without strong drowsiness.","zh":"一种氨基酸，主要存在于茶叶（尤其是绿茶）及部分蘑菇中；也常作为膳食补充剂使用，通常与放松、减压相关，往往不明显引起嗜睡。"},"examples":[{"en":"Many people drink green tea for its caffeine and L-theanine balance.","zh":"很多人喝绿茶是因为其中咖啡因与L-茶氨酸的平衡。"},{"en":"She takes L-theanine before a presentation to feel calmer.","zh":"她在做演讲前会补充L-茶氨酸，让自己更镇定。"},{"en":"The label says each capsule contains 200 mg of L-theanine.","zh":"标签上写着每粒胶囊含200毫克L-茶氨酸。"}]}],"synonyms":["theanine"],"phonetic":"/ˌɛl ˈθiːəniːn/","extraExplanation":["在日常英语里，L-theanine多出现在营养补充剂、茶饮成分、或与“calm focus（平静专注）”相关的健康讨论中。","它属于营养/保健语境用语，不等同于医学建议；如果涉及用量、药物相互作用或健康问题，英语里常见表达是“talk to your doctor/pharmacist（咨询医生/药师）”。"],"etymology":"源自“theanine（茶氨酸）”，名称与“tea（茶）”相关；前缀“L-”表示其在化学上属于“左旋（L型）”的构型，是生物体中更常见的一种形式。","mnemonic":["记忆法：L- = “Left/左旋（左）”，theanine 里有 “tea（茶）” 的影子 → “茶里的左旋茶氨酸”。","联想：喝茶让人“心定下来（thea-听起来像‘茶’）”→ L-theanine 常被提到与放松有关。"]}
{"word":"L-tryptophan","summary":{"en":"an essential amino acid needed for proteins and for making serotonin and melatonin","zh":"一种必需氨基酸，用于合成蛋白质，并参与生成血清素与褪黑素"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An essential amino acid used by the body to build proteins and to make important chemicals such as serotonin and melatonin; it must be obtained from food or supplements.","zh":"一种必需氨基酸，用于合成蛋白质，并参与生成血清素与褪黑素等重要物质；人体无法自行合成，需从食物或补充剂获得。"},"examples":[{"en":"Turkey, eggs, and soybeans contain L-tryptophan.","zh":"火鸡肉、鸡蛋和大豆都含有L-色氨酸。"},{"en":"Some people take L-tryptophan as a supplement to support sleep.","zh":"有些人会补充L-色氨酸来帮助睡眠。"},{"en":"Because it is essential, you need enough L-tryptophan in your diet.","zh":"因为它是必需氨基酸，饮食中需要摄入足够的L-色氨酸。"}]}],"synonyms":["tryptophan","L-Trp"],"phonetic":"/ˌɛl trɪpˈtɔfæn/","extraExplanation":["“L-”是立体化学标记：人体蛋白质主要由L型氨基酸组成，所以营养与补充剂通常写作L-tryptophan。","它与情绪与睡眠常被联系，是因为它可作为合成血清素（serotonin）与褪黑素（melatonin）的前体；但效果受饮食、个体差异与医学因素影响。","与“5-HTP”不同：5-HTP是血清素合成路径中的另一种中间产物；两者在补充剂市场常被并列讨论，但并不等同。"],"etymology":"“tryptophan”来自对其分解产物的命名：与“trypto-”（源自希腊语，和“分解/处理”相关的构词）以及化学命名中常见的“-phane/-phan”成分有关；“L-”表示其为生物体内常见、参与蛋白质构成的左旋（L型）立体构型。","mnemonic":["记忆法：把它拆成“trip + to + fan（去追粉）”，联想“吃了想睡、情绪更稳”——帮助你记住它常被用于睡眠/情绪相关讨论。","“L”可以联想“Life（生命）常用的那一型”：人体蛋白质主要用L型氨基酸。"]}
{"word":"L-tyrosine","summary":{"en":"an amino acid (L-form) used to build proteins and make key brain and thyroid chemicals","zh":"一种用于合成蛋白质并参与生成神经递质与甲状腺相关物质的左旋氨基酸"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an amino acid used by the body to build proteins and to help make important chemicals such as dopamine, norepinephrine, and thyroid hormones; often sold as a dietary supplement","zh":"一种氨基酸，人体用它来合成蛋白质，并参与生成多巴胺、去甲肾上腺素及甲状腺激素等重要物质；也常作为膳食补充剂出售"},"examples":[{"en":"L-tyrosine is found in many protein-rich foods like dairy, meat, and beans.","zh":"L-酪氨酸存在于许多高蛋白食物中，如奶制品、肉类和豆类。"},{"en":"Some people take L-tyrosine supplements when they feel stressed or tired.","zh":"有些人在感到压力大或疲劳时会服用L-酪氨酸补充剂。"},{"en":"If you have a thyroid condition, ask a doctor before using L-tyrosine.","zh":"如果你有甲状腺方面的问题，使用L-酪氨酸前应先咨询医生。"}]}],"synonyms":["tyrosine","4-hydroxyphenylalanine"],"phonetic":"/ˌɛl ˈtaɪrəˌsin/","extraExplanation":["学习提示：营养品标签里常写“L-tyrosine”，与“tyrosine”通常指同一种氨基酸的常见补充剂形式；而“D-tyrosine”是另一种镜像构型，生物利用方式不同，日常补充更常见的是L-型。","常见搭配：L-tyrosine supplement（L-酪氨酸补充剂）, tyrosine-rich foods（富含酪氨酸的食物）, thyroid hormones（甲状腺激素）, neurotransmitters（神经递质）。"],"etymology":"“tyrosine”源自希腊语“tyros（奶酪）”，因其最早从奶酪蛋白中分离得到；“L-”表示其为左旋（L-构型）的氨基酸形式，也是生物体内更常见、用于合成蛋白质的形式。","mnemonic":["把“tyro-”联想成“奶酪（希腊语tyros）”，记住它最早与奶酪/蛋白分离有关。","“L-”可联想“Life（生命常用）”：人体合成蛋白质常用的是L-型氨基酸。"]}
{"word":"L-valine","summary":{"en":"the natural L-form of the essential amino acid valine","zh":"必需氨基酸缬氨酸的天然左旋（L型）形式"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An essential branched-chain amino acid (the naturally occurring left-handed form of valine) used by the body to build proteins and support muscle and tissue repair.","zh":"一种必需的支链氨基酸（缬氨酸的天然“左旋”形式），人体用它来合成蛋白质，并支持肌肉与组织修复。"},"examples":[{"en":"L-valine is one of the three BCAAs often discussed in sports nutrition.","zh":"L-缬氨酸是运动营养中常提到的三种支链氨基酸（BCAA）之一。"},{"en":"Because it is essential, you must get L-valine from food such as meat, dairy, beans, or soy.","zh":"由于它是必需氨基酸，L-缬氨酸必须从食物中获取，比如肉类、乳制品、豆类或大豆。"},{"en":"Some supplements list L-valine in grams per serving on the label.","zh":"有些补充剂会在标签上标出每份所含的 L-缬氨酸克数。"}]}],"synonyms":["valine","L-valine","Val"],"phonetic":"/ˌɛl ˈvæliːn/","extraExplanation":["在营养与生物化学语境里，“L-”通常强调这是人体更常利用的天然构型；另一种“D-”构型在人体蛋白质中很少见。","L-缬氨酸常与另外两种支链氨基酸 L-亮氨酸（leucine）和 L-异亮氨酸（isoleucine）一起出现，合称 BCAAs。","在医学或检验语境中，它也可能作为“氨基酸代谢”相关讨论的一部分出现。"],"etymology":"“valine”一词源自植物名“valerian（缬草）”，早期研究中与其来源/关联有关；“L-”表示该分子是“左旋/左手性（L-form）”的立体构型，这是生物体内蛋白质常用的形式。","mnemonic":["把 L-valine 记成“Left（左）+ 缬氨酸”：L- 就是“左旋版本”。","联想“V”= “V形分叉”→ 支链氨基酸（branched-chain）。"]}
{"word":"l/c","summary":{"en":"“l/c” is an abbreviation that commonly means letter of credit (trade), but it can also mean liquid chromatography (lab) or lowercase (writing).","zh":"“l/c”是缩写，常见含义是信用证（贸易），也可能指液相色谱（实验室）或小写字母（书写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation: “letter of credit” (used in international trade). A bank’s written promise to pay a seller after the seller presents the required shipping documents.","zh":"缩写：信用证（国际贸易用语）。银行出具的书面付款承诺：卖方在提交符合要求的装运单据后，银行向其付款。"},"examples":[{"en":"The exporter asked the buyer to open an L/C before shipping the goods.","zh":"出口商要求买方在发货前开立信用证（L/C）。"},{"en":"Payment will be made by irrevocable L/C at sight.","zh":"付款方式为即期不可撤销信用证。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation: “liquid chromatography” (a laboratory method for separating and analyzing mixtures).","zh":"缩写：液相色谱（实验室中用于分离与分析混合物的方法）。"},"examples":[{"en":"We used L/C to separate the compounds before analysis.","zh":"我们先用液相色谱（L/C）分离化合物，再进行分析。"},{"en":"The lab report includes L/C conditions such as the solvent and flow rate.","zh":"实验报告包含液相色谱条件，例如溶剂与流速。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation: “lowercase” (sometimes written as l/c), meaning small letters like a, b, c.","zh":"缩写：小写字母（有时写作 l/c），指 a、b、c 这类小写。"},"examples":[{"en":"Please write your username in l/c only.","zh":"请只用小写（l/c）填写用户名。"},{"en":"The password is case-sensitive, so l/c and U/C are different.","zh":"密码区分大小写，所以小写（l/c）和大写（U/C）不同。"}]}],"synonyms":["letter of credit","LC","lowercase","liquid chromatography"],"phonetic":"ˌɛl ˈsi","extraExplanation":["“l/c”在不同领域含义差异很大：贸易最常见指信用证（letter of credit）；理工/化学语境可能指液相色谱（liquid chromatography）；日常书写里也有人用来表示小写（lowercase）。如果你告诉我你看到它的句子或场景（邮件/合同/实验报告/作业要求等），我可以帮你确定最准确的意思。"]}

